{"songs": [{"title": "Kickin It With Cool C", "album": "Finally Famous: The Mixtape", "year": "2007-11-24", "image": "https://images.genius.com/e4311df795cf4c9077ccbb609da0c55a.500x500x1.jpg", "lyrics": "(Hey man, don't you realize\nIn order for us to make this thing work, man\nWe've got to get rid of the pimps, and the pushers, and the prostitutes?)\n\nBa-ha-ha-ha...\nYes, yes, y'all\n\n[ Cool J + Marley Marl]\nAh, ah\nCool J: That's funky\n\nMarley Marl: Yeah\n\nJ: Hey yo, Marley, man\n\nMarl: Yo, what's up, man?\n\nJ: Hey yo, man\nYou know\nWe was gettin busy on the album everyday\nWe been gettin funky, but\nI wanna take this jam back to Farmers\nKnowmsayin?\n\nMarl: Yo, let's go back on Farmers\nAnd get some of them early MC's\nYou used to be kickin it with back in the day?\n\nJ: Yeah, yeah, yeah\n\nMarl: Yo, let's do a jam with them\n\nJ: Aight, bet\nBut first I gotta like introduce it\nYouknowmsayin?\n\nMarl: Aight, kick it...\n\n(Farmers Boulevard)\n\n[ Verse: L.L. Cool J]\nBack in the days, before I was Cool J\nI used to hang up on the corner, pumpin' games people play\nSittin' on a garbage can, rhymin' to my man\nTalkin' bout big money and future plans\nI always told the brothers, if I got a contract\nWhen the money started flowin', I'd be back\nTo do a jam, against all odds\nIntroducing rapper 1 from Farmers Boulevard\n\n[Verse: Bomb ]\nHey yo, B-o-m-b, bomb explosion\nAttack like a cat when I'm trapped and I'm closed in\nSharp-ass claws, and I break all laws\nIn a while all jaws, cause I'm perfect, no flaws\nNow I'm back to Farmers on some new improved\n(Sh...) I'm makin moves, not fakin moves\nSo don't you never come around here, talkin that talk\nOr walkin that walk, you'll get played like a sport\nFootball, soccer, whatever you savor\nYou're a tramp and a pussycat, ready for labor\nHa! L'll have you breakin' locks\nI'll have you cookin fried rice in a big steel box\nThe type of skills that I got reigned for years\nNo worry or cares, your crew'll shed tears\n'Hip-hip-hooray, he's back!' Yo, save the cheers\nSuckers, I'm drinkin forties of beers\nOn the Boulevard\n\n[ Cool J + Marley Marl]\nCool J: Funky, funky, funky rhymes bein' said here\n\nMarl: Hey yo, hey yo\nHey yo Uncle L, let's go...\n\nJ: Yeah man, I wanna check out my man Big Money Grip\nYo, what's up, man\nKick a little somethin'\n\n[Verse: Big Money Grip ]\nKick out the can and slam\nSummertime, C.I.A. step into the jam\nReach for the mic, and the punks start to fold up\nAnd the brothers start fleein' like it's a hold-up\nSome step aside, but a few play me close\nNever worry, cause the brother who cross me's gettin buried\nAnd the fool who wants to deal with another dose\nI see to it in a hour that the mutha...'s comatose\nFarmers Boulevard, the place\nHandin me a mic is like givin' a chainsaw to Leatherface\nSmokin MC's in an instant\nAt my side bustin caps is T-Boogie, my assistant\nThrow that speaker in the trash\nWhy's that? Cause Gangster Boogie gave the woofer a gash\nBig Money Grip makin you get up\nFarmers Crew's in effect, we never heard of a head-up\n\n[Cool J + Marley Marl ]\nYo, yo, yo\nIt's kinda funky out here on the boulevard, yo\n\nCool J: Yeah, we livin' Chinese people in a Turkish bath, baby\nMarl: Hi C over there, man\nJ: Yo, what's up Hi C...\n\n[Verse: Hi C ]\nHi C on the scene, at last to bust a funky rhyme\nMore than a line on time, because I'm gettin' mine\nNever underestimate the skill of a great one\nThe Boulevard Lord, shorts, never take none\nAnother funky rapper from around the way\nLeavin' bodies at a party, cause somebody gotta pay\nBoy, you been told, put your lips on hold\nAll you remember is a barrel and a mouth full of gold\nSpreadin' terror on the street like they was in the past\nAny punks on the block, yo, never could last\nAnd I never feel sorry for a sucker I gained on\nAny slick talker, yo, he's bound to get rained on\nAt any Farmers party at my side is a Mag\n(One time a sucker got ill and went out in a bodybag)\nFear will erupt through the heart of another\nThe Farmers Crew will never fall, that's word to the mother\n\n[ Cool J + Marley Marl ]\nYo, yo\nIt's kinda funky out here\nYo, yo, yo, Hi C\nYo man, y'all kinda funky out here, yo\nI was -\nYo, what's up?\nNine years ago, man\nYouknowmsayin?\n\nCool J: Farmers Boulevard, baby\n\nMarley Marl: Yo, I was kinda -\nI was kinda stagnant to sleep on it\nBut yo, L\nWon't you - won't you sum it all up for the people, aight?\n\nJ: Aight, let me sum this up\n\n[Verse: L.L. Cool J ]\nNow you heard the brothers speakin 'bout the street that we're from\nRhymes hittin', beats kickin', you can't get none\nF-A-R-M-E-R-S passin' the test\nMarley Marl in the background doin the rest\nDo-re-mi-fa-so-la-ti-do, do-ti-la-so-fa-mi-re-do, Kato\nGet up out my face before I play you like Play-Doh\nI did a jam against all odds\nAnd it was dedicated to Farmers Boulevard\n(Farmers Boulevard)\nKeep on\n(Farmers Boulevard)\nTo the beat, y'all\nA funky beat, y'all\nYes, yes, y'all\nYou don't stop"}], "artist": "Big Sean"}