{"artist": "Knoc-turn’al", "songs": [{"image": "https://images.genius.com/4c50173e2bd3fb16450053d6e2eac177.500x500x1.jpg", "title": "Str8 Westcoast", "year": null, "album": "L.A. Confidential", "lyrics": "Super ugly\nMr X to tha Z\nYeah, Warren\nLA indo, gangster and mack mo\nBullets at your window, dangerous\n\nRuthless, hostile, unforgiven, who gave you permission\nTo try to stop me from livin', huh? Try again faggot\nYou've gotta ride better than that\nTo move out in front of the pack, it's two thousand and two\n\nMy backpack raps got my backpack\nStrapped and filled with plaques\nI ain't relaxed or laid back at home with my feet up\nI drop Pravda, lock and load, heat the streets up\nYou weak fuck\n\nShakin' and dancin'\nY'all takin' pills, we takin' penitentiary chances\nI'm too advanced is\nNever the same when I hit it and quit it\nYou want it come get it, I'm wit' it\n\nWhen I say that I'm wit' it\nThat means I got a main defense team that's gon' get me acquitted\nG's is walkin' out the courtroom like George Jefferson\nStop the interviewin', the faggot had it comin' to him\n\nWarren G\n\nWhat y'all thought, I wasn't gonna return with a hit\nToo much smokin' that Sherman shit\nI learnt this from the best that got y'all sprung\nThe, the doctor Andre Young\n\nCompton, LB, ain't nothing y'all can tell me\nGoin' hard on the yard till my dogs bail me\nThey tells me I can't proceed wit' it\nI came back and got Warren G wit' it\n\nWest coast, still smoking on that indo\nSmoke, oh no, don't pretend, oh no\nI woulda came but I was dead broke, no mo\nI'm rollin' on some real, oh no\n\n'Bout to get it, but niggas trip though, let's go\nI'm the realest and they all know real dope\nYou need a filter or you will choke, indo\nThat's all a nigga will smoke, oh no\n\nNow, niggas better get between their door, door\nI'm shakin' all your shit onto the floor\nAnd niggas don't get it\nBut be careful what you ask for you just might get it\n\nYo the undisputed middle weight champ runnin' like Hopkins\nClap six to ya shins niggas start hoppin', Shiest never stoppin'\nIn other words, if your click full\nCan't press mute and it don't apply now\n\nI'm feelin' funny in the tummy\nAnd a nigga ain't been eatin' for weeks, I'm sick\nI ain't trying to get no better but rather\nInfect the world leavin' Vicks in a old sweater\n\nKnoc's landin', tell me if it ain't me, who got the best planin'?\nWho got your ears tuned it and who keeps you listenin'?\nWho gots your undivided attention?\nWho makes your panties wet, girl?\n\nHold up, pause, which nigga on TV\nThat you see makes you wanna give up the draws\nAt parties and shows, I mash regardless\nYo hardest flows couldn't stop this bombardment\nI clench the vision till there's no room for expansion\n\nAll prepared for war it's Knoc's landin'\nA nightly stalker, in shadows I walk\nMindin' my own while haters throw soft\nThe more I succeed, the more bitches clock\n\nThrough my peripheral vision, I watch subconsciously\nWaitin' to introduce you to tragedy see it's Knoc's landin'"}]}