{"artist": "Petey Pablo", "songs": [{"album": "Diary of a Sinner: 1st Entry", "title": "919", "image": "https://images.genius.com/0d2bbb0b347544f2a5d6ad0222f2fcda.220x220x1.jpg", "lyrics": "[Intro]\nOhhhhh (North Carolina)\nOn, top (y'all better come on)\nHarvest (y'all bettter come on!)\nPetey Pablo (c'mon!)\nAbnormal, huhhh\n\n[Hook]\n9-1-9 motherfuckerrrrr\n(WHAT!) 9 (WHAT!) 1 (WHAT!) 9 motherfucker\n9-1-9 motherfucker\nI'm representin NINE, ONE, NINE motherfucker!\n\n[Petey Pablo]\nBorn and raised, precious year '73\nBack then we knew how shit was gon' be, MOTHERFUCKER!\nWhat you know about this year, my neck of the woods\nMy nigga my hood, my God - they good to us Carolina\nLove my liquor house, club, my big girl, my son a thug\nMy big, family with fifty-eleven cousins\nYa heard? Huhhhh, Southern Magnoila belle\nNo Limit, 'ouisiana, Dungeon, A-T-L\nIt's a chain here, we the nation jump on boats with a load\nGet this Carolina show on the road\nWhodie I want billboards with my face all across the world\nWith a outline of my state nigga, puffin it up\nY'all feelin us, to the point you sloshin shit out your cup\nSo the fuck WHAT, they playin a club cut 'bout us\nSlosh out the rest of us, AHHHH, feel the rhyme\nHolla motherfuckin 9-1-9, uhhhhhh\n\n[Hook] - repeat 2X\n\n[Petey Pablo]\nLook at us baby, on our way to fortune and fame\nYour main man done fucked around and got us a name\nA motherfucker don't really want a train-train\nBut it still came and ain't stop the thang, y'knowmsayin?\nNow we in the game, don't know it now, oh you bound to bust down\nOh it's on now! I put my whole STATE through the door\nOhhh Lord, how you let them do that folk?\nLike I'm losin control, runnin motherfuckers off the road, one-double-O\n95 South 'til I get home, mannnn\nThe country had to come there, poppa I love home\nAnd comin home, like I love my momma; pop the champagne partner\nFuck it, drink it straight out the bottle\nFuck work tomorrow, Carolina havin a party\nGet drunk as you wanna, get what'll get you tight\nTonight is a nigga night, aight? Nigga get right\nNow with all your might, holla like your best friend died\nAnd his help number is 9-1-9, one time\n\n[Hook] - echoes at the end\n\n\"The number you requested, area code 9-1-9\nWill be automatically dialed...\"\n\n[Petey Pablo]\nWhat, what!\nThe whole feelin of this 9-1-9 give you the type of\n9-1-9 kind of get high\nNigga this the code of the world (people)\nYou ain't gotta be from the 9, just holla loud, spit the shit out\nMan they lovin the South, loved it before but even more now\nLater who wants a response from the crowd\nLook how my niggas holdin it down\nScreamin like they shit here out (it is how!)\nMotherfucker feel the power!\nRepresent yo' stompin ground\nShow 'em how it is at the house, y'all sold the fuck out\nAll together now, please, I need you so wow\nJust the law niggas turned it down, comin too loud\n\n[Hook] - repeat 2X", "year": null}]}