{"songs": [{"lyrics": "[Audience clapping]\n\n[Intro: Maria Davis]\nYo wassup everybody, this is Maria Davis, Mad Wednesdays, we here tonight to have a good time\n(\"Yo! Start the show! Start the show!\")\nWait a minute; I see my man over there, Jay-Z\nJay-Z, Dame Dash let me hear that lil tape of yours, and it's phat\nWhy don't you come up here and kick a lil freestyle\nPut that champagne down, and kick a lil freestyle for me tonight\n\n[Intro: Jay-Z & Audience]\nCan I kick it? (Yes you can!)\nCan I kick it? (Yes you can!)\nCan I kick it? (Yes you can!)\nY'all motherfuckers must've heard that Tribe Called Quest shit\nLet's do it again!\nCan I kick it? (Yes you can!)\nCan I kick it? (Yes you can!)\nCan I kick it? (Yes you can!)\nWell I'm gone... check this out\n\n[Verse 1: Jay-Z]\nToo much West Coast dick lickin'\nAnd too many niggas on a mission, doin' your best Jay-Z rendition\nToo many rough motherfuckers, I got my suspicions\nThat you're just fish in a pool of sharks, nigga, listen\nToo many bitches wanna be ladies, so if you a ho\nI'ma call you a ho, too many bitches are shady\nToo many ladies give these niggas too many chances\nToo many brothers wannabe lovers don't know what romance is\nToo many bitches stuck up from too many sexual advances\nNo question; Jay-Z got too many answers\nI been around this block too many times\nRocked too many rhymes, cocked too many nines, too\nTo all my brothers it ain't too late to come together\n'Cause too much black and too much love, equal forever\nI don't follow any guidelines 'cause too many niggas ride mine\nSo I change styles every two rhymes\n\n[Interlude: Jay-Z]\nHah, what the fuck\nThat's 22 two's for y'all motherfuckers out there, nahmean?\nShall I continue? Check it out, what?\n\n[Refrain: Jay-Z]\nCan I kick it? (Yes you can!)\nCan I kick it? (Yes you can!)\nCan I kick it? (Yes you can!)\nWell I'm gone... yo, yo, yo\n\n[Verse 2: Jay-Z]\nCopped to reach my quota, push rock, roll up smooth like on ya\nWhole groove like hold-up, swoll up\nToo many faggot niggas clockin' my spendin'\nExercisin' your gay-like minds like Richard Simmons\nIf you could catch Jay right, on the late night\nWithout the eight, right, maybe you could test my weight, right\nI dip, spit quicker than you ever seen\nAdminister pain, next the minister's screamin' your name\nAt your wake as I peek in, look in your casket\nFeelin' sarcastic, \"Look at him, still sleepin'\"\nYou never ready, forever petty minds stay petty\nMine's thinkin' longevity until I'm seventy\nLivin' heavenly, fuck, felony after felony, what?\nNigga you broke, what the fuck you going to tell me?\n\n[Outro: Maria Davis]\nJay-Z, Jay-Z, now you know this is a phat track (aight)\nNow this is comin' on your new album, on Roc-A-Fella records in '96?\n(No doubt, no doubt)\nWell, it is definitely the bomb! But you know I do wanna say somethin' to you, I know you've been havin' a lot of problems with the law\nBut I know you innocent, and I'm behind you 100%. Mad Wednesdays, Ruby King, DJ Ace, Dame Dash, Roc-A-Fella Records, we all behind you, you can come back any time!\n(Hah, thanks a lot)\nWait a minute, wait a minute, wait a minute, wait a minute, Ace, turn that music down. I smell some reefer, now you see? That's why, our people don't have anything, because we don't know how to go in places and act properly\n(\"Hey, shut the fuck up!\")\nWait a minute, wait a minute, who told me shut the eff up? Who told me to shut the eff up? Get him out of here! I'm not gonna continue this show, until you throw him out! Get him out right now, then I'ma continue my speech!\nThank you, he's out of here now, now like I was sayin'... we gotta build our own businesses, we gotta get our own record companies goin' like Roc-A-Fella Records, we got this, put our own money in our businesses...", "title": "22 Two’s", "image": "https://images.genius.com/18040c4f503942a16d6577d9820644cb.1000x1000x1.jpg", "year": "1996-06-25", "album": "Reasonable Doubt"}], "artist": "JAY-Z"}