{"songs": [{"lyrics": "[Intro: Cookie Monster sample]\nOkay\nTime to rhyme\nWith Cookie!\n\n[Verse 1]\nHello boys and girls, I'm the Crookie Monster\nAnybody who steps to me, yo i'll put it on ya\nYou know i'm a puppet, and out here, sitting thick\nHolding the fort on sesame street, me and my clique\nWe eat crookie, made from weed\nOoh yummy yummy yummy!\nNobody in the industry can ever take my style from me\nI got a call on my cellular phone from The Count:\n\"I don't like when they smoke all my weed then they bounce!\"\nBut actually, right down the block in back of me\nSnuffleupagus is selling all the crack happily\nYa'll didn't know how I met Oscar:  you know Maria?\nWe bumped her and tossed her\nHe so pissed off cuz he lost her\nSeen him when he try to floss her, then his whole clique flipped\nMessing with the crookie monster then he got the bitch whipped\nNow it's all on your thing when the whole block buggin\nI should have never [?] Mr. Cooper's fucking cousin\n\n[Chorus]\nThe Crookie Monster\n(COOKIE!!!)\nI'm the Crookie Monster\nSing along with me, sing a song with me\nI'm the Crookie Monster\n(COOKIE!!!)\nI'm the Crookie Monster\nSing along with me, sing a song with me\n\n[Verse 2]\nMe and Bert and Ernie was getting dirty in Romper Room\nSmoking hash, popping tabs, open a lot of mushrooms\nWord to the father, I asked Maria if I could massage her\nOne day I caught her out there fucking Mister Rogers\nWhile he was singing, taking off his socks and his shoes\nI'm the fucking Crookie Monster, still paying my dues\nOne day i had to stomp out Oscar, left him on the curb\nGot me some real bad herb from Big Bird\nSmacked him so hard, till he lost his feathers\nI love my crookie, forever and ever and ever and ever\nOh yeah, you didn't know that I could rap on the track?\nBoys and girls let me tell you, the Crookie Monster is back\n\n[Chorus]\nThe Crookie Monster\nI'm the Crookie Monster\n(COOKIE!!!)\nI'm the Crookie Monster\nSing along with me, sing a song with me\nI'm the Crookie Monster\n(COOKIE!!!)\nI'm the Crookie Monster\nSing along with me, sing a song with me\n\n[Bridge: Cookie Monster et al., samples]\nYou-you-you-you want a cookie?\nThat's right!\n(COOKIE!)\nHey you, hey\nWhat are you waiting for?\nCOOKIE!\n\n[Verse 3]\nOh where's the blunts? On the ash tray\nThat nigga Julio?  Oh shit, he's past gay!\nOK, the last day I'm gonna kiss Helena Rubinstein\nI don't need to keep it clean, fuck a channel 13\nI'm on the scene with big brillas\n[?] Crookie Monster, she keep the baby pictures\nFor all my fuzzy niggas\nYo everybody, I'm realer than you think\nI beat up Kermit told him Miss Piggy and her pussy stink\nHow much you want to bet? Hell you ain't no threat\nI run Sesame Street, I got the whole block [?]\nI could be bigger and larger than Master P or Puffy\nI'm the fucking Crookie Monster, the whole world loves me\n\n[Chorus]\nThe Crookie Monster\nI'm the Crookie Monster\n(COOKIE!!!)\nI'm the Crookie Monster\nSing along with me, sing a song with me\nI'm the Crookie Monster\n(COOKIE!!!)\nI'm the Crookie Monster\nSing along with me, sing a song with me\n\n[Outro: Grover & Herry Monster]\nListen, everybody!\nThese are all VERY SECRET MONSTER THINGS\nAnd we're gonna tell you because we like you!", "title": "Crookie Monster", "album": null, "image": "https://s3.amazonaws.com/rapgenius/220px-Agallah_2011.jpg", "year": null}], "artist": "Agallah"}