{"songs": [{"year": null, "album": "It’s a Beautiful Thing", "image": "https://images.genius.com/a38241df710942558e84bde3f2e0774b.804x800x1.jpg", "title": "Ride Wit Us", "lyrics": "[Keith Murray]\nYeah, ride with me, yeah!\nYeah! Ride with me\nRoll ya down windows and ride with me\n(All: Ride with us) Yeah!\nBitch (All: Ride with us) Yeah!\n(All: Ride With us)\nRoll up ya windows and (All: Ride with us)\n\n[Verse 1: Too $hort]\nLet's smoke this Oakland Indo don't roll down the window\nStart the car we ain't going to far\nYou know that big booty girl you're always fucking wit?\nShe got a sister, I really want to get\nSome Georgia girls, some College Park\nYou already fucked when we get to start it off\nPark in a drive-way, it won't take long\nDo it like that it goes, on and on\nYou know this the kind of the shit I know you want\nE made the beat, let me show you something (Erick Sermon: Yeah)\nQuite a few hate us, wanna see us play out\nBut we got the formula to get paid now (Erick Sermon: Word up)\nYou can't stand in the way of success\nWe got the same job but you make much less\nI remember how it used to be (Erick Sermon: Like what?) before we had crack\nIf you had a few hundreds in your pocket that was fat\n\n[Erick Sermon-Chorus]\nIf you feel like smoking then (All: Ride with us) (Redman: Yeah!)\nHop the train with no token (Bitch) (All: Ride with us) (Redman: Yeah!)\nIf ya don't give a fuck then (All: Ride with us)\n\n[Keith Murray]\nRoll ya windows down and (All: Ride with us)\n\n[Erick Sermon]\nIf ya got +5 On It+ then (All: Ride With us) (Redman: Yeah!)\nAnd if ya hate fake niggas then (All: Ride with us) (Redman: Yeah!)\nAnd if ya cool pull triggers then (All: Ride with us)\n\n[Redman]\nRoll up ya windows and (All: Ride with us)\n\n[Verse 2: Keith Murray]\nAiyyo, I lick two shots it's heard around the world\nCheck out our forty and a blunt can take a nigga girl (Take a nigga girl)\nLike E ? don't say nothing I'm hunting (Redman: Word)\nOn the microphone, it's the eve of destruction (Redman: Yeah!)\nAs the world goes around like passion you get flat in a orderly fashion\nYou was warn like a coming detraction\nI got playa hated, felt liberated\nPut em on a burner cause nigga violated (Redman: Word! Word!)\nWe scamper like guide dogs through the fog\nIf ya feel like you wanna hop, leap like a frog (Like a frog!)\nLike a Sergent General, get busy chief (Redman: Word up)\nThe fastast way to spell wrong relief is Keith! (Redman: Keith!)\nI leave you ass'd out like a cocain droute\nAiyo, can I get a witness like Andre Crotch? (Redman: Crotch!)\nNiggas need to stop frontin, bitches need to stop stuntin (Redman: Word!)\nCause they know fuck well they can't stop my production\n\n[Erick Sermon-Chorus]\nIf ya like smoking then (All: Ride with us) (Redman: Yeah!)\nHop the train with no token (All: Ride with us) (Redman: Yeah!)\nIf ya don't give a fuck then (All: Ride with us)\n\n[Redman]\nRoll ya windows down and (Too $hort: Beotch!) (All: Ride with us)\n\n[Erick Sermon]\nAnd If ya got +5 On It+ then (All: Ride With us)\nAnd if ya hate fake niggas then (All: Ride with us)\nAnd if ya cool pull triggers then (All: Ride with us)\n\n[Redman]\nRoll up ya windows and (All: Ride with us)\n\n[Verse 3: Redman]\nAiyyo, I got the, forty acres without the fucking mule\nDoc Ike Turner, giving mic's audio abuse (Erick Sermon: Word up)\nI smack a big mouth bitch, and her baby sitter and her lesbian friend, and\nThat nigga with her\nI don't give a fuck I smack blood outta midget\nMy tactics make Evil D say \"Come on, kick it!\"\nA black five with rims which could spot me in\nWhen I die, I snatch you like Doc  Kervorkian\nSo turn the beat up while Narcs got me on sweep up (Uh-huh)\nI'm lucky, I usually tote more guns than Peter (Ha-ha)\nI'll fuck you up till where you forehead and cut meat up\nYou wanna box I +Square+ more than Madison Arena (Ding!)\nBackstabbing bitches and niggas, EAT A DICK!\nPlus, you never heard the Doc do nothing like this\nBackstabbing bitches and niggas, EAT A DICK!\nPlus, you never heard the Doc do nothing like this\n\n[Erick Sermon-Chorus]\nIf ya like smoking then (All: Ride with us)\nHop the train with no token (Bitch) (All: Ride with us) (All: Yeah!)\nIf ya don't give a fuck then (All: Ride with us)\n\n[All]\nRoll ya windows down and ride with us\n\n[Erick Sermon]\nAnd If ya got +5 On It+ then (All: Ride With us) (Redman: Yeah!)\nAnd if ya hate fake niggas then (All: Ride with us) (Redman: Yeah!)\nAnd if ya cool pull triggers then (All: Ride with us)\n\n[Redman]\nRoll up ya windows and (All: Ride with us)\n\n[Erick Sermon]\nCome on ride with us, ride with us\nCome on, ride with us, ride with us\nCome on, ride with us, ride with us\nRide ride ride ride ride ride ride\nCome on, then ride with us, ride with us\nCome on, ride with us, ride ride"}], "artist": "Keith Murray"}