{"artist": "Fat Joe", "songs": [{"year": "2013-08-26", "album": "The Darkside Vol. 3 ", "image": "https://images.genius.com/a53228c5255a58acb80e04151cc60a17.500x500x1.jpg", "lyrics": "[Intro]\nOye money eta vaina ta calientisimo aqui loco que lo que contigo\nTengo una pila mono por todo lao loco esto e rapido muevete\n\n[Verse 1]\nI'm the realest nigga in here, you already know it\nA lot of you's fuck boys, you already showed it\nUse a straw to sip the Moët, diamonds on the Cuban\nWhere the fuck have you been? I'm producin' Rick Rubin\nSome of you call it Britney, rest in peace Whitney\nBut when you live your dreams, nightmares could turn to tricky\nChase until your heart stops, some niggas don't make eighteen\nI was pitchin' hard rocks while you was watchin' A-Team\nRocky Balboa, hard white ain't a mystery\nAnd I'm rockin' more gold chains than Mr. T\nI love strippers like 2 Chainz\nIn that new mousseline bumpin' New Slaves, uh\n\n[Chorus]\nMGM Vegas on a late night\nBet I put the bread, that's a cake fight\nLil' broad in a push-up bra and a fat pussy\nLove to take it raw, bring it back to me\nMGM Vegas on a late night\nBet I put the bread, that's a cake fight\nLil' broad in a push-up bra and a fat pussy\nLove to take it raw, bring it back to me\n\n[Bridge]\nOh, my Mexicana baby\nTu ta fuelte\nMi seniorita\nYes, lord\nMy Columbiana baby\nCocaina\nMi catalina\nThat raw\n\n[Verse 2]\nPlatinum crucifixes, diamonds in the crown of thorns\nAnd you popped up out the hood, survived the phantom doors\nIt's a suicide, it's a suicide\nPicture Justin Timberlake, no suit and ties\nA pair Timberlands and a hoodie on\nThey wanna strap me to the same bed they put Tookie on\nFuck 'em, though\nI'm screamin' TS is aboard the flight\nSix people on a twelve-seater for the night\nNow that's six niggas with straps, six figures to match\nOn our way to Vegas with yo bitch rollin' the craps\nPut it all on crack and watch the money show\nA pair of Christians have your bitches catch the Holy Ghost, uh\n\n[Chorus]\nMGM Vegas on a late night\nBet I put the bread, that's a cake fight\nLil' broad in a push-up bra and a fat pussy\nLove to take it raw, bring it back to me\nMGM Vegas on a late night\nBet I put the bread, that's a cake fight\nLil' broad in a push-up bra and a fat pussy\nLove to take it raw, bring it back to me\n\n[Outro]\nOh my Mexicana baby\nTu ta fuelte\nMi seniorita\nYes, lord", "title": "MGM Grand"}]}