{"songs": [{"image": "https://images.genius.com/273d640313c08ab2fea96f7d4f1a0551.500x500x1.jpg", "album": "4 Reasons", "title": "Bullshit", "lyrics": "[Intro: Dae Dae]\nI just came up on a fucking lick ho\nI'm not going for it shit no more\nI just turned up for my motherfucking homies\nWhere you were when I was going through that bullshit?\nWhere you were when I was going through that bullshit?\n(We got London on the track)\n\n[Verse 1: Dae Dae]\nDaddy got three, my brother took a two\nBeen through so much shit, feel like I got shit to lose\nRoad to hell way hot, my daddy out in there\nI just made your big homie pipe down, ya-ya\nI ain't nothing to play with, I got childrens\nLil bitch, where you were when it was blurry? Ya-ya-ya\nA lot of shit done changed, my mama doing good, ya\nI been spending a lot of money on shit I shouldn't\nLove life a movie, this shit outrageous\nI just dropped that motherfucking Love Life Pages\nDae Dae came up quick that shit ridiculous\nIn Atlanta trap you heard that DefAnition, ya-ya\n\n[Hook: Dae Dae]\nBullshit, going through that bullshit\nWhere-where you was?\nWhere you was when I was going through that bullshit?\nWhere-where you was? Yeah\n\n[Verse 2: 21 Savage]\nWoah, nigga where you was?\nI done trapped on boulevard where they was screaming cuz\nAnd when I trapped on boulevard I was still a blood\nThat Glock 40 with a 30, nigga facts nigga\nYoung Savage got a lot of fucking racks nigga\nYoung Savage get a pussy nigga whacked nigga\nWhere your ass was at when I ain't had scraps nigga?\nNow you want Louis V and red bottoms, stop it ho\nI came straight from the bottom and I'm cocky ho\nAin't no convo if them panties ain't dropping ho\nYou better suck me, you better fuck me\nKnock your favorite rapper over like Humpty\nWhen I was young, girl's cousin used to hunch me\nI got rich, my baby mamas tryna dump me\nThey like \"why your engine right there where your trunk be?\"\nBull shit, bitch you know that pussy funky\nMilly Rock, Milly Rock, diamonds do the Milly Rock\nBullshit, bullshit, you can get a full clip\nPull up in something nasty nigga, yeah I'm on that \"oh shit\"\nBitch you know I'm tacky, know I'm hot, know I got pull bitch\n\n[Dae Dae]\nBullshit, going through that bullshit\nWhere-where you was?\nWhere you was when I was going through that bullshit?\nWhere-where you was? Yeah", "year": "2016-11-02"}], "artist": "Dae Dae"}