{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "[Intro]\nWoot!\nI just wrote this one\n\n[Verse]\nWere saying goodbye to 2015\nWe won't miss you, you ugly bitch\nYo, What a crazy year\nLemme say this clear\nLotta good things happened that will make you cheer\nA lot of bad things happened that were way severe\nLet's pop a bottle of the champagne and say some cheers\nIt's December and it's warm outside\nI dont wanna have a debate but man it's making me hot\nIm gonna tell you all about the highlights of the year, all the biggest news stories in case you forgot\nDown in Charleston\nSouth Carolina was a shooting at a church, 9 people dead 1 hurt\nAnd South Carolina made everyone mad so they were forced to remove the confederate flag from the capitol building\nCecil the lion was living in Africa chillin until Walter Palmer an asshole a villian just illegally tracked him and killed him and murdered him\nBruce Jenner became Caitlyn and she blurred the lines between her and him\nI swear to god the second that I thought i'd seen it all there was an earthquake killing twenty thousand people in Nepal and the hatred was awful\nEvery other conversation that I read up on facebook was hostile\nSo relax it's just facts\nMark Zuckerburg had a daughter named Max\nA lot of black kids killed by cops and a lot of chinese stacks got killed by stocks\nIf you listen to radio this year it was apparent lotta brand new rap not real it's pop\nBut the Women's world cup was great\nIt was a beautiful achievement for our mothers and our daughters and we finally got some images of pluto from a satellite and went to mars and OMG we found water!\nWhat?\nYes it's true\nIm gonna move there away from you\nMayweather fought Pac Man\nOn Pay per view (On Pay Too Much Damn Money)\nRonda Rousey got her title belt taken too\nThe World Series Champions were baby blue and the Super Bowl was won by the Patriots too\nConnor McGreggor\nGolden State\nLamar Odom was found in a coma state and it was awful damn\nRIP to Freddie Grey Sandra Bland\nRowdy Roddy Piper Yogi Berra Wes Craven thank you for giving me joy\nAlso i gotta send an RIP to Leonard Nimoy\nThis was the year of the American Sniper\nShootings in public an American crisis\nInnocent Civilians out in Paris were lifeless\nCharlie Hebdo shot by the terrorists ISIS\nShootings out in San Bernardino\nShootings at the planned parenthood in Colorado Springs\nNow in every single state across America it's legal to get married even Kim Davis can't intervene\nThere was a European Migrant crisis with the Syrian refugees but in America the only thing we care about is hitting the quan eating bacon eating pizza with extra cheese\n\n[Outro]\nSTAR WARS, I LOVE STAR WARS\nMan, I bet ISIS is jealous because they can't watch STAR WARS x3\nThey're gonna be really jealous when we get our self driving cars next year\nHappy new year biatch!", "year": "2015-12-31", "album": "YouTube", "title": "2015 In 2 Minutes"}], "artist": "Mac Lethal"}