{"artist": "Fat Pat", "songs": [{"year": null, "album": "Ghetto Dreams", "image": "https://images.genius.com/7f512ec967ef83b8e46821fdbe35272e.640x640x1.jpg", "lyrics": "[Verse 1: ]\nBottom all the way to the top\nAnd it seems like a struggle but I had to get out, no doubt\nBout my paper so I had to mash, 150 on my dash\nSo you know I'm rolling fast, all about my cash\nAin't no time to play, put it in perspective\nTime for ho checking, bitch made nigga wrecking\nWhat, uh, with that talking down shit\nBut don't know shit, but all up on my dick?\nMiss me with that sideways shit, I'm on a mission\nPay attention, watch the news, got my shoes, pay your own dues\nAnd pick your own fools to ride wit, get high wit\nThat do or die shit, that no lie shit\nWe multiply chips and gain fat grips, but I tell you\nIf yo eyes ain't open, they'll get ya, if I catch em I smoke em\nUh, if I catch em I smoke em, uh, if I catch em I smoke em\n\n[Hook: ]\nI kept my mind on my paper - yeah, I stayed on my grind\nWhile the haters and the hoes - yeah, they all talked down\nAll the way to the top is the way it gotta be\nIt's the Mister in the place, so what do you see? (2x)\n\n[Verse 2: ]\nPulling up on the corner, jumping out my Benz\nHoller at that boy Tony and a couple more friends\nConversating about Benjamin's and niggas who owed us ends\nPulled Tony to the side, asked him if he wanted to make quick wins\nA couple of chickens, Tony was game\nAnd I ain't seen that boy to this very day\nI'm rolling with my nine, on sight it's going down\nBlasting for my green, putting it all on the line\nI couldn't believe it, good guy gone bad\nBut when I catch that cat, he wish he never had\nThe streets be bumping bout situations, bout taking care of my business\nHell na cause, I ain't bullshitting, that nigga's gonna get it\n\n[Hook: ]\n\n[Verse 3: ]\nPlayers get gangsta too (that's right)\nJumpin out my gators into my stomping boots\nTo make a nigga feel it if it's like that\nCause knuckling up ain't a thang with Mr. Fat Pat\nBut ain't about no bullshit, I'm about my mail\nStack my ends, floss my Benz, aid my clientele\nThat he say she say - a bunch of bullshit\nJust mad cause a nigga fucking his bitch and trying to get rich\nAnd what about the snitch, that boy ain't saying nothing\nPut his body in a body-bag and burnt off on my buttons\nCame strutting through the lobby, I seen that boy Tony\nThe Lord only know that I had my pistol on me\nDo or die situations, hesitation will get me killed\nAnd I knew that Tony had his pistol up in here\nGunshots rang out and I'm the last man standing\nMr. Fat Pat standing strong busting him with his god damn cannon\n\n[Hook]", "title": "Tha Last Man Standin’"}]}