{"songs": [{"title": "Gangland", "album": "Church Clothes 3", "year": "2016-01-15", "image": "https://images.genius.com/ecf271772aa0af61304b89a07eb15401.1000x1000x1.jpg", "lyrics": "[Intro 1]\nWe not playin' out here, it's for real. We livin' out here for life, we tryna to get it. Ain't nobody finna take our life. I keep my young homies out here with these things, my big homies keep handlin' me. And we keep it crackin'. My other name should've been Jesse James 'cause I stay with my cannon didn't have no choice, I was raised right around the corner from where we standin'. Hollow points in it and all of that, I'm ready. We gang bangin'!\n\n[Intro 2: Lecrae]\nMy cousin *beep* was a killer\nHe done pulled a lot of triggers\nHe done made a lot of mamas cry\nAnd if you ask him why he do it he'd just say, \"I'm young and foolish\"\nBang on you right before he made them bullets fly\n\n[Verse 1: Lecrae]\nHe ain't have no sense of dignity, his daddy was a mystery\nHe'll probably end up dead or sittin' in a penitentiary\nAnd tell the judge he can go to hell for the sentence\nAnd it probably make no sense to you but listen to the history\nThe new Jim Crow or the old one\nPeople out here fightin' for equality and honestly I think they owed some\nBack and forth some\nCleaver got a message for the people\nBunchy with 'em and they tryna stop the evil\nAnd they cliqued up with they fist up\nThe whole neighborhood feelin' like they meant somethin'\nThen it was a mix-up, Fed's got 'em fixed up\nEnd of the movement, back to the bricks, bruh\nAnd Raymond Washington about to start the Crips up\nThey gettin' bigger every day and tryna fix stuff\nThey saw Geronimo Pratt dodgin' bullets from attacks\nGuess they figure, \"We don't really want it this much\"\n\n[Break 1: Lecrae]\nYou know originally, the gangs were created to protect everybody in the community. There was lynching and bombing going on and the gangs were there to protect. What people don't understand is that a lot of the leaders died. Medgar Evers (has been shot), Bunchy Carter (has been shot), Fred Hampton (has been shot), MLK (has been shot in Memphis Tennessee). These youngsters didn't have any direction. No leaders to look up to so they imploded on themselves\n\n[Verse 2: Lecrae]\nThey say that Crips stands for Community\nRevolutionary InterParty Service\nWay before the genocide and the murders\nA little after integration was the verdict\nWhen bombs might go off at the Sunday service (baow!)\nThey protectin' they community\nThen it turn into diplomatic immunity\nThen a fight against oppression was depressin'\nNow they keep on losin' battles and they started losin' unity\nNow they beat each other blue-black\nForce fed self-hate 'til they tooth crack\nGot they own folks hidin' on the rooftops\nThey ain't finna take no more, they finna shoot back (baow!)\nNow they bond like a family, they all bloods\nFrom the concrete jungle to the small hoods\nThrowin' signs up, now the crime's up\nWe was meant to kill oppression now we load 9's up\nBut never mind us, grind us\nFactory done closed, now a lot of people jobless\nNow they got the drugs comin' in from Nicaragua\nGovernment done turned a blind eye or they liars\n\n[Break 2: Lecrae]\nIt was a perfect storm. I mean, we're talkin' post-segregation. And what are you gonna do? The factories have closed and no one's hiring anybody from the urban community because of what you look like. And now there's a war going on in Nicaragua and drugs are being imported into your community. Are you gonna sell drugs or are you gonna be homeless? 'Cause the government's not paying attention\n\n[Verse 3: Propaganda]\nHuh, man, you tell me\nWhat's a reasonable man to say?\nThere's a high school in Alabama named after Robert E. Lee\nAnd it's 89% black, you don't see the irony?\nWhat it do to a psyche, it's simple, you don't like me\nWhat I'm 'posed to do now?\nDelusional calling that system criminal justice\nWhere the rich and the guilty are safer than the poor and the innocent\nWhy would we listen?\nWhen American churches scuff they Toms on our brother's dead bodies\nAs they march to stop gay marriage\nYo, we had issues with Planned Parenthood too\nWe just cared about black lives outside the wombs just as much as in\nYoung man gon' find purpose somehow\nAnd The Nation was at least around\nAnd when them vice lords told him he was of royal descent\nAnd that war on drugs felt much more like war on the poor\nHe figured forget it\nWhy don't you come stay a while?\nTell us that the son of man walked on Egyptian\nAnd Eastern soil and wasn't just a Western construct\nOur master used to control us\nBut what the Master used to free us\nAnd it was a crooked system just like this that left the King of Kings bloodless\nYeah, we are truly a descendant of a King\nOnly his reign is infinite\nAnd being right is a distant second to the joy of compassion\nWhy don't you come stay a while?"}], "artist": "Lecrae"}