{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "Can’t Tell Me Nothing (Official Remix)", "lyrics": "[Intro: Kanye West & Young Jeezy]\nLa, la, la, la\n8732 that's the way it go\nWait 'til I get my money right\nKanye and Jizzle, say it ain't so\n\n[Verse 1: Young Jeezy]\nIf I had a billion dollars (YEAHHHHHHHHHH)\nYeah, I'd spend all in a day, show these niggas how to play (play)\nTop floor penthouse, I'll show them where I stay (stay)\nGrand piano, might learn to play (Ha Ha!)\nPaid a hundred grand just to walk past it every day (Woo! Woo!)\nYou know I like them white keys on it (yea!)\nDuct tape when we wrap them, call me prejudice\nCause I never touch the black ones (keys that is, Ha Ha!)\nLet me show how to do this, shawty! (shawty!)\nI hit the strip club and I blew bout forty (DAMN!)\nPatron got me so confused (fused)\nUntil I stumbled outside and I made the news\nFresh nine piece, yeah them wings is cajun\nNever seen me in the kitchen nigga, I am amazing (nah)\nWell, fuck it I'm rich then\nIf balling is a crime, fuck it I'm hit then\nIf thugging is a term, fuck it I'm it then\nThe insane dough, hey, fuck it I'm sick then\nSomebody call me a shrink\nUntil then, I'mma fix me a drink (Ha Ha!)\nTop down in the Bent, I'm so intoxicated\nSometimes I think to myself \"Goddamn, I made it\"\nAnd I know they hate it\nOn the all night flight\nTrying to get my money right, wassup?\n\n[Hook: Kanye West (Young Jeezy)]\nLa La La La (Hey!)\nWait till I get my money right\nLa La La La (Yeah!)\nThen you can't tell me nothing, right?\nExcuse me, is you saying something?\nUh uh, you can't tell me nothing (HA HA!)\nYou can't tell me nothing\nUh uh, you can't tell me nothing\n\n[Verse 2: Kanye West (Young Jeezy)]\nYeah, homie this a theme song\nFirst I get my money right, then I get my team on\nIf I always prayed to have gleam on\n$300 jeans on, do that mean I dream wrong?\nAnd I was high as a Leer Jet\nFly as the insect, even though we in debt\nAnd it don't matter if I get her number cause\nWhen I get my money right she gon come running\nAnd I'll be good like \"God\" with an extra \"o\"\nGod knows that my check needs some extra 0's\nAnd you know that you need to bring some extra hoes\nNot in jogging pants either, tell them wear some sexy clothes\nNow my game so professional\nAnd my chain so fresh, they go (oh oh oh oh oh)\nRight after the fame did you gain anything?\nDamn 'Ye, would you change anything?\nBut (If I had a billion dollars! YEAHHHHHHHHHH)\nI'd copped more pink polos and pop those collars\nMisery love company, her nickname Sorrow\nMy Benz need company, her nickname Tahoe\n“Wait 'til I get my money” everybody's motto\nSo I'mma need a bravo for everything that I wrote\nYeah, hey, mama they can't hate him\n'Cause after all of the drama, K slayed them\n\n[Hook]\n\n[Outro: Kanye West (Young Jeezy)]\n(If I had a billion dollars YEAHHHHHHHHHH)\nWait till I get my money right\n(If I had a billion dollars YEAHHHHHHHHHH)\nThen you can't tell me nothing, right?\n\n[Connie Mitchell (Young Jeezy)]\n(I'm serious, nigga! Hey!)\nWhy were you late?\n(Yeah! HA HA!\nYeah! You know I'm serious, nigga! I got money!)\n\nOh oh oh oh oh\nGood money made!\nOh oh oh oh oh\nGood money made!\nWhy were you late?\nOh oh oh oh oh\nGood money made!"}], "artist": "Kanye West"}