{"songs": [{"album": "Roy G Biv: What A Colourful World", "image": "https://images.genius.com/38e414dca697a21f78d4fdc5ec927cda.640x640x1.jpg", "year": "2015-10-12", "title": "Castles in BK", "lyrics": "[Produced by Thanks Joey]\n\n[Hook]\nNigga it’s chess, not checkers\nDon’t let emotion control you and fuck the whole event\nYou gotta move your pieces and control your centre\nYou gotta move in peace and control your centre\n\n[Verse 1]\nI never stop no matter what the competitor’s gotta say\nChop it up like an edit, a predator’s gotta prey\nStand down, look at my city right in the face\n[?] recognize that we caught up in yesterday\nHey, wait, I’m building castles out in Brooklyn\nThis chess, not checkers, watch the king switch with the rook\nAnd then it’s checkmate nigga\nThe check play [?] then it’s [?] bricking up your chest plate nigga\nSoul inventors never no pretenders\nIt’s like my borough is my co-defender\nAin’t no agenda besides control the centre\nIs it the hustlers or the customers that‘s co-dependent?\nIf the knight takes the bishop, does he go to Heaven?\nThat’s the question, science versus religion\nApply it to higher living you’ll find it’s the same mission\nMy flow is lotus position, you’re broken up like a bedframe\nYou can’t advance on the board without an endgame\nSo what’s your endgame?\n\n[Hook]\n\n[Verse 2]\nLife ain’t a game, it’s a bitch and she gonna diss you\nYou tryna master the game like you searching for Bobby Fischer\nYou fallin’ victim to the lies you be clutching on\nSuch a pawn to the bandwagon you jumping on\nWe ain’t game players, we’re game changers who spray up the train\nAnd remain famous, my neighbours be waving flags like gang bangers\nThe knights and the police patrol the blocks on horses\nThe bishop saw the priest, they asking who to worship\nEverybody claim the king, it ain’t a secret\nThat the king the most important but the king also the weakest\nEspecially when his queen is gone he be leanin’ on the other for protection\nSee your queen is much more than just affection, word\nI need my queens to recognise their power\nGot the world in your palm like Ms. Hill’s “Final Hour”\nI forever stay clever, knock you out like Mayweather\nFor the belt cause the most difficult opponent is myself, yes\n\n[Hook]"}], "artist": "Talib Kweli"}