{"artist": "Valete", "songs": [{"title": "Os Melhores Anos", "year": "2012-10-16", "lyrics": "[Verso 1 - Valete]\nAnos 90, tempo de minha adolescência\nTempos de imprudência sem pensar em consequências\nIa sempre po' ringue sempre que havia sol\nCom a camisola do Malone e a bola de basketball\n\nIa para o Carrefour roubar M&M's\nNos phones eu ' tava a ouvir as jams do Eminem\nAntes do primeiro álbum quando eu era mega Fan\nNo futebol, imitava Steve McManaman\n\nFins de semana com a minha dama Mariama\nMeus manos na vida profana a fumar marijuana\nAos 15 ja ia pa' disco abrir Perignons\nSempre com as mesmas calças da Levis e a sweat da Chevignon\n\nVia porno de surra filmes da Flame\nDa Desiree Lane e da imabativel Heather Wayne\nLutas de turmas era tipo faixa de Gaza\nLutava depois ia pa' casa pa' não perder o Tsubasa claro\n\nNo carnaval ninguém leva a mal\nAtiravamos balos de agua contra a esquadra policial\nBófias, vinham atras de nos como um ciclone\nE nós tipo Papillon a fugir da Babylon\n\nJá era viciado em Jeru The Damaja\nMas o meu maior vício era Championship Manager\nFicava horas e horas preso no jogo\nAquela merda era a minha droga era o meu desafogo, mano\n\n\n[Refrão]\nNão tenhas pressa, mano. Curte a adolescência\nVão ser os melhores anos da tua existência\nSer adulto é foda não corras pa' chegar cá\nÉ só problemas e vida de penitência\n\n[Verso 2 - Jimmy P]\nSou geração de noventa, Insane In The Brain\nGeração Grunge, Nirvana e Kurt Cobain\nAdolescência entre Lisboa e Paris\nNo tempo em que Djs ainda sabiam o que eram Vinis\n\nE hoje putos estao a dar para Ronaldo\nEsquerdino pé canhão, meu sonho era ser igual ao Rivaldo\nHoras a esfregar joelhos no asfalto\nRoda bota fora, Rua 8, esse era o meu palco\n\n97 sempre baggys e cap\nPa gravar umas barras tinha que ser em cassete\nAnos mais tarde desperto po' rap\nSempre a consumir Boss Ac, Chullage\nSam the Kid e Valete\n\nSempre a colar o pisto man\nSou do tempo do Walkman, do mini disc e do discman\nEm repeat Nas - \"The World Is Yours\"\nEnquanto praticara durante horas in line e skateboard\n\nSaudades de ser imaturo\nDas nossas conversas intermináveis lá sentados no muro\nDa fruta roubada na vizinhança\nDa ausência dos tópicos actuais como crise e poupança\n\nHistórias do homem do saco\nAos 12 o primeiro beijo, aos 15 o primeiro tchaco\nAproveita bem enquanto há inocência\nMelhor tempo da nossa vida é a adolescência!\n\n[Refrão]\nNão tenhas pressa, mano. Curte a adolescência\nVão ser os melhores anos da tua existência\nSer adulto é foda não corras pa' chegar cá\nÉ só problemas e vida de penitência!", "album": null, "image": "https://images.genius.com/1ec9a704e065eb4f5b2125cdfb6cd195.429x429x1.jpg"}]}