{"artist": "YNW Melly", "songs": [{"image": "https://images.genius.com/52566ade421509162c6faae57e9bfdad.750x750x1.jpg", "year": "2019-04-09", "album": null, "lyrics": "[Intro]\nAT\nHm, hm, hm, hm, hmm, hmm\n\n[Verse 1]\nCan you stand the pain, stand the rain?\nI'm insane, but somehow you ease the pain (Yung Shad, you killed this track)\nI can buy you new designer thangs\nGucci, Louis, Prada, yeah, the finer thangs\nIced out Cuban Link, Rolex, VVS, pinky ring\nWalk the same, talk the same\nStay the same, fuck the fame, never change\n\n[Chorus 1]\n'Cause I can not wait until (Until) they set me free (Free)\nSo I finally (Finally), can spend the rest of my days with you (My days)\nGirl, I'm dangerously in love with you\nEternally (Eternally), not just mentally, but physically I am feeling you\nAnd I really hope that you feeling me (Whoa)\nIs you feeling me? (Whoa)\nHold it down for me and (Whoa) I promise that I'll take care of you\n'Cause I can not wait until (Whoa) they set me free (Whoa)\nSo I finally, can spend the rest of my days with you\nGirl, (Whoa) I'm dangerously in love with you (Whoa)\nI'll never leave, not just mentally, but physically I am feeling you\n\n[Verse 2]\nOh, oh\nOh, this is more than a crush that I have on you\nI'm infatuated with everything you do\n'Cause I need ya', and I want ya'\nAnd I swear it get better and better\nPussy wetter than ever\nOoh, I love when you wear that Beretta\nLet me help you take off yo' shoes (Off yo' shoes)\nBuy you a Rolex and want to see you flex (Yeah, yeah)\nOh, oh, oh yeah, oh\nYou know I'm thuggin', hit it with my durag on\nBaby, can we please make love on a mattress full of hunnids? (Full of hunnids)\nFeeling on your body, leaving hickeys on your stomach (On your stomach)\nI'ma make you scream my name and have you drippin' like a faucet\nMove too fast, I'm finna miss your ass, and make you get up off it\n\n[Chorus 2]\nI'm so glad that they have set me free\nNow I finally, can spend the rest of my days with you\nGirl, I'm dangerously in love with you\nEternally, not just mentally, but physically I am feeling you\nAnd I really hope that you're feeling me\nIs you feeling me?\nHold it down for me and I promise that I'll take care of you\n'Cause I'm dangerously in love with you\nI'll never leave, just keep loving me\nAnd I promise I'll take care of you (You)\n\n[Refrain]\nI promise I'll take care of you (I'm gon' just take care of you)\nI promise I'll take care of you (I'm gon' just take care of you)\nI promise I'll take care of you (Oh, oh, oh, oh, oh, oh)\nGirl, let me take care of you, like girl, let me take care of you (I promise)\nLike girl, let me take care of you (From the 772)\nAnd girl, let me take care of you (From the 772)\nLike girl, let me take care of you (From the 772)\nMight as well call this \"772 Love Pt. 2\"\n\n[Interlude]\nI, I, ooh, I, heart you\nI promise I, I heart you (Ooh, whoa, whoa)\nDon't make Melly break, babe\nIt's Marcus baby, ahahaha\n\n[Verse 3]\nI'm moving too fast\nGot three on the dash\nBitch, I'm on your ass (I'm on your ass)\nLike where is you going? (You know that this Melly, bitch)\nI'm getting this money, I'm fucking these bitches and she still know\nFaithful to you, you\nGon' love me forever, ever\nAin't no lame, no lame, no lame\n\n[Outro]\nNo, oh, oh, oh, oh, oh, oh, oh, oh\nWoah, woah, woah\nOh, oh, oh, oh, oh, oh, oh, oh, oh", "title": "Dangerously in Love (772 Love Pt. 2)"}]}