{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/0e825d5daf35800f4be503b4ff58164c.640x640x1.jpg", "title": "Chinese Food", "album": "Weekend Warrior", "lyrics": "Yo, you know this is.. FON-KAY\nI'd like to say rest in peace, to Aaliyah (sweet thing)\nAnd 'Left Eye' Lopez\nBut, you know, shout out to my man Bruce Lee\nJackie Chan, check it out, Jet Li\n\n[Verse One]\nI'mma bring it to you like this\nDrop a three pointer from the corner like swish\nWalk around with a name belt and a funky new rap\nShell tops new and Space Invaders cap\nOld school like, bread and gravy\nMe and Monty roll together like Fred and Grady\nAin't, nothin you can say to stop this mad man\nPlay Defender, Centipede and Ms. Pac-Man\nJust like Martin Luther I had a dream\nIn a house with no heat, just kerosene\nCall Biz Mark, so you get the better connection\nThe type to wear Timbs to a weddin reception\nI'm so smart, I even got a GED\nPlus a vide-oh-oh, BET, and MTV\nI'm the best thing out now go ask your moms\nSpendin money on cars just to pass the time\n\n[Hook]\nFour chicken wings with shrimp fried rice, that's good\n{*scratch: \"Egg foo yung\"*}\nBeef and broccoli with a little white rice, that's good\n{*scratch: \"Fried one time\"*}\nChicken chow mein with a little white rice, that's good\n{*sample: \"Mix it mix it up nice\"*}\nI need a couple of egg rolls in my neighborhood, that's good\n\n[Verse Two]\nI'm the Uptown rhymer, large like Big Momma\nKeep three girls on the couch like \"Oh Drama\"\nEnd every line with period, no comma\nHidin out 'til I'm found like Osama\nWalk on water, filled with pirahnas\nWant the tie within coats with no liner\nIf I ever lose my girl, I go find her\nIf not, I got Shirl' and Tawanna\nRight back on ya, yep the old timer\nAny contract you got, I no sign-a\nDon't smoke or use drugs, of no kind-a\nEverything that I wear, is de-signer\nJust like Dolce, hang with Gabbana\nBiz Mark play his part, the show timer\nMake any party hot like your sauna\nStill keep the crowd controlled with no drama\n\n[Hook] - change last line to \"I need SOME egg rolls..\" etc\n\n[Verse Three]\nIt's the Mmah, Zah-aYYAH, Rrah, Zah-KaYYAH\nWhen Guiliani leave I will be the Mayor\nIn the year two-thou', I'm gonna house\nI'm still tryin to look up a girl's blouse\nGot a Hummer for the summer, Benz for my girlfriend\nWhen it comes to ice, I got a lot of dia-monds\nI'm hangin at the Rucker, watchin skip-to-my-loo\nGirls askin me to do the {*puh, ah one-two*}\nWeather is good, about eighty degrees\nMy X-Ray vision seein thongs and G's\nThankin the Lord for the beautiful day\nI seen people sippin on Tanqueray\nEverything's the same, in the new millen'\nSeattle is where, they got a Hip-Hop Museum\nSo listen to the way I rock the spot\nRight about now I'mma make you hot\n\n[Hook] - change last line again\n\n[Biz Markie]\nRrrrrah! The Emmezah..\nHey, Bruce Lee! Jackie Chan! My man Jet Li!\nFive Deadly Venoms, the Master Killer\nHuang Yu, Angela Mayo, okay\n{*Biz imitating the oriental beat*}\nI'm the Bizz Markeeee and I can rock\nTo {???}\nI can't forget my man by the name of {?} he rock\nHe rock, I'm the Biz and I STOP"}], "artist": "Biz Markie"}