{"songs": [{"title": "​a goldUn Prayer///a goldUn Morning (金朝。)", "image": "https://images.genius.com/246fd3cffefeef5a40c25b269d06df23.500x500x1.jpg", "lyrics": "** Pt.1 A goldUn prayer**\n\nNo love for these hoes\nNo hate for these niggas\nMan, I'm just gettin' my paper\nWhile I'm stackin' my riches\nA long way from a million\nBut I promise I get it\nAnd that's as long as I'm livin'\nLet me know if you wit' it\nWish I could give you this feelin'\nI'll be here for a minute\nScreamin' at the top of my lungs\nFrom the top of this buildin'\nIronic tho, it was the flow, had me on top like the ceilin'\nDope like the rocks they was dealin'\nHope you acknowledge we killin' shit\nBeen killin' since we first emerged\nSo if you ain't on yo' shit, my music'll leave you motivated\nAt worst, discouraged\nThey say I'm hard to read like cursive words, weirdo\nGet called a lot of things and my favorites' probably \"You nerd\"\nStands for \"No One Ever Really Dies\"\nAnd if you look inside my eyes, you can see the pockets\nVery much alive\nI done studied every legend in it's prime\nThese interviews is like the game tape when Kobe studied Mike\nYou'll soon be studying mine\n\n[Hook]\nI still pray and pray, and pray and pray\nAnd pray and pray, and pray and pray\nBut nothin' ever happens, it's so sad\nI still pray and pray, and pray and pray\nAnd pray and pray, and pray and pray\nAnd nothin' ever happens, but I'm still here\nI still pray and pray, and pray and pray\nAnd pray and pray, and pray and pray\nWhen something ever happens, I'll be glad\nI still pray and pray, and pray and pray\nAnd pray and pray, and pray and pray\nAnd nothing ever happens, just never happens\n\n[Break]\n\n**Pt.2 A goldUn morning**\n\n(All day!)\nThis is the story of the goldUn child. The boy born on the west side of Chicago, whose travels somehow led him to Brooklyn, New York. Along the way he made many friends. And of course, made many enemies. He even made many mistakes. And he made many people proud. But most importantly, he made beautiful music. Any story worth tellin' has it's shares of ups and downs. But the important thing is, the happy ending. This is the result of talent, luck, consistence, and hard work. Destined from the beginning to be - goldUn child", "year": "2015-11-19", "album": "goldUn Child"}], "artist": "Ace Hashimoto"}