{"artist": "Kid Capri", "songs": [{"image": "https://images.genius.com/3ab7e648317c8fc3f7e94ef00586a381.400x400x1.jpg", "title": "You Know My Style", "year": null, "album": "The Tape", "lyrics": "[Biz Markie]\nYo! Your moms so poor\nShe went in Kentucky Fried Chicken and licked everybody else's fingers\n\n[Kid Capri]\nYo Biz man you know that ain't my style\n\n[Biz Markie]\nTchk, yo man what IS your style Capri?\n\n[Kid Capri]\nYou know my style..\n\nGive me the mic, Lords of Funk is in full flight\nI keep you goin and flowin, all day and night\nSo lets proceed with the sounds that you really need\nThe Kid is funky and my DJ got a lot of speed\nSilver D and Money Mark, is blowin up\nDon't think we won't be at a battle cause we're showin up\nAnd if you ever try to diss you're gonna get stomped\nI'm gonna make it plain and simple - there's no COMP!\nYeah I said it, so whatcha gonna do about it?\nThe Kid Capri is super dope, I just gotta shout it\nThe Lords of Funk will rock a party for a while\nNow I can tell you that, but you know my style\nYou know my style..\n\nNow my country 'tis of thee, let me tell you what it means to me\nI really love it when them crowds scream for me\nIt gets me hyped, makes me wanna rock right\nFrom tonight, all the way until tomorrow night\nYou know the flavor, so now, do me a favor\nPlease respond to the sounds Kid Capri gave ya\nI worked hard, to do what I do for people\nI'm not conceited, cause everybody is my equal\nI had a problem, with suckers, that tried to diss\nI overlooked 'em but they still wanted to persist\nI had to blow up, and blow up on 'em very large\nCause chaos, and war, and sabotage\nThey made me mad, even though they didn't harm me\nThey stepped off when I went, and got my army\nMoney Mark, Silver D, and Troopa Love\nPoppa Duke chillin with, the man above\nYou couldn't diss me, no matter, how much you paid\nYou made the record, but I'm the one that gets it played\nRed Alert, he's blazin on my radio\nAnd I'm the man, that's blazin in your auto\nI go cameo, you think that youse a super ho?\nYou get sprayed, and played like a afro\nSo go ahead Hobbes, I make fingers pop\nAnd you could never, get what the Kid Capri got\nBefore I blow up, my man you better show up\nCause once I'm finished with you, you're gonna throw up\nI get respect, I teach 'em, and then correct\nYou're out of order out of style like a mock neck\nI'm gettin papers, while you suck Now or Laters\nI wear a silk Guess denim, and alligators\nSo go ahead chump, I'm not the one son\nI grab the mic and wax that booty like a shotgun\nI'm not frontin, or fakin, or 'fessin to ya\nI'm Kid Capri, so let that be a lesson to ya!\n\nPunk, you know my style\nDon't ever try to front kid, cause you know my style\nOn the down low, you know my style\n\nOh man there go my main man Spud Luva for the Troopa Love crew\nHe got it goin on\nThere go Shabar, she she got a little flavor right there\nMoney Mark, Silver D, Lords of Funk, Kool V in the house\nKnahmsayin, pushin Kid Capri\nMy main man the brother (?) BIZZZZZZZZ Markie\nMy man Kool V in the house\nThat's my man Grand Daddy I.U\nKnahmsayin, Diamond Shell, Dapper Jay, they got it goin on\nMy main man the Chief Rockin Starchild\nHe in the house, he got it goin on\nMy man the world famous BUSSSSSSSY Bee\nHe kickin flavor, yknahmsayin?\nEverybody doin this for the do\nPuttin flavor where it's supposed to be\nThe Kid Capri is outta here like last year\nAnd I'm gone, SEE YA!\nCause you know my style\nYou know my style.. uhh! C'mon.. woo!\nCause you know my style.. {*echoes to fade*}"}]}