{"songs": [{"title": "Really?", "lyrics": "[Verse 1: Akala]\n\nWho’s fuckin' with the flow of the kid\nDuppy riddims then I kill em with the shit\nYuppie feelings, Couldn’t give a shit\nCouple Shillings, now they think they’re rich\nNever ever could they ever get em’\nSever heads whatever I am ever clever dread\nEverybody Killer fill em up with lead?\nAre they realy really, is that many dead?\nEvery spitter [] for the bread\nAre they really ready to go bury heads\nDoes it matter, if its chatter\nWhat you gotta do to be a better rapper\nWann coppy me cop a snapper\nHow cute, little slapper\nFew riddles syllables spittin Jewls\nSpirituals, for the youth\nTake em’ into schools turn them into fools\nGot them coming out thinkin that they {}\nEverything they hold everything they know\nEverybody got to be a better clone\n\n[Chorus: Akala]\n\nWho’s Fuckin with me really sincerely\nI tell you to think clearly you cannot get near me\nCos who’s ramping with me really sincerely\nI tell you to think clearly you can't even hear me\n\n[Verse 2: Akala]\n\nBloods flowing  in my veins never tame\nPain weighing in my frame never sane\nPlayers never changed games stay the same\nBut the wicked wizard will forever reign\nWitty lyrics comin out my brain\nSickest with the physics could never explain\nI am the bloody one no talk\nYou’re just a fraud like the courts\nTalk and they fuckin talk and retort\nBut what they’re sellin I have never bought\nThey wanna bloody yell about the law\nBut they’re the ones peddeling the war\nBlood to settle scores got to get the raw minerals\nCriminals with the law\nI am the f one are they dumb?\nDh are my sons, send em to they mum\nNever spat a sick verse whip a gun\nIf the fight come? Prolly woulda run\nYou see couple tracksuits\nCouple black youths\nCouple fat suits\nAnd you think cos they talk tough\nThat really mean that they trap food\nBut the roads know what the roads know\nOnly few rappers getting rolls tho\nWho cares if you can't flow tho\nI don’t really watch for the show show\n\n[Hook x2]\n\n[Verse 3: Akala]\n\nSeen a drug addiction uncles sent to prison\nCapitalism inner city livin\nAv’ a seat start from the beginning\nStory that im spinning it will never finish\nGlory that I’m giving it cannot diminish\nCor he’s bloody sick, take him to a clinic\nWhat you think it is, schizophrenic lyrics?\nWhat a prick he will never mimic\nEvery single little fact that they have\nRags in their bags that never has\nEver made the subject of my track\nThough I may get fresh when I rap\nOr maybe not so bloody what\nEither way girls wanna clog\nAnd I got a car and I got a watch\nSo what blud where your office?\nWhere your knowledge bigger than a college\nIf you haven’t got it wonder in a forest\nLost in your mind\nLost in your soul\nWhere you’re going you will never know", "year": null, "album": "Knowledge Is Power Vol. 1", "image": "https://images.genius.com/95f4dbc07c7455e0bbf14b55f99cc7a0.918x1000x1.jpg"}], "artist": "Akala"}