{"artist": "C-Rayz Walz", "songs": [{"title": "Degrees (Clean)", "album": "Whodaf**kareyou / Degrees", "year": "2001-01-01", "image": "https://images.genius.com/54f828e30ca5e7313e352dd0722e3a50.600x600x1.jpg", "lyrics": "[Verse 1: C-Rayz Walz]\nI wrote rhymes on papyrus, clutch the obelisk\nManifest the true and livin', reveal the obvious\nProminent, dominant, hand secret documents\nAnd all the high continents' monuments\nOnly to be awakened by your third consciousness—honor this\nI hold the secrets to life now with my esophagus\nRenew my history every time I build with wisdom\nSo when they go, I don't have regrets.  Diss 'em and miss 'em\nI'm the light and the prism, the glitch in the system\nThe assertive victim who murdered death and his rhythm\nGot hyper to chill with sniper skills, focus my goal\nTook a stronghold on my soul\nAnd puffed an L just to inhale hell\nConversatin' with Satan, contemplatin' to add on elimination\nBaptize my lips and spit the Holy Grail\nDestined to fail, arrogance cause earthquakes in hell\nOld people gossip, adults criticize\nWe all judgmental, but can't control our own lives\nI realized the world's on my dick so I pissed in public\nBalance the skills—some real hate and love shit\nFor each slug that hit, I got a script with the same\nImpact of ten gats—yo, in fact, I speak flame\nFocus on the real cause I've been that\nI got a plan for that self hatred—end that\n\n[Hook: Sample from Guru on Gang Starr's \"JFK 2 LAX\"] (x2)\n\"Read, study lessons and build your inner power\" (x3)\n\"The next level doesn't tolerate cowards\"\n\n[Verse 2: C-Rayz Walz]\nI play 21 with crackheads—slap-box raps\nMy block's a danger chamber—strangers chased by gats\nI'm the black target.  Spit first, make the jam last\nRelentless trenches, beats buried in sand bags\nBlast back, splash tracks, run on water\nMy New World Order—Buckshot like Terry Porter\nBlaze trail.  You way frail like Puffy in jail\nYa'll drink bubbly in hell.  I prevail and inhale\nStuck with a golden pose like the son of Jor-El\nContact the most high before your eyes get the smell\nYour head swells.  Thoughts get heavy like barbells\nC-Rayz born to blaze—in my presence, you [caravels?]\nChiseled in the culture.  Conscious cartel\nDo the math like vultures while the God dwells\nOn the actual fact, my bright light violet-ultra\nBiting these words will cause ulcers\n\n[Bridge: Sample from Guru on Gang Starr's \"JFK 2 LAX\"]\n\"Read.\"  \"Read\"\n\n[Verse 3: C-Rayz Walz]\nSubterranean brain stats and dirty train track rats\nFuck the fame, black—in the end, we the same cats\nNourishment from maggots, soil for the earth\nLife is ritual, death is not a curse\nIf we send first we are blessed in the last stage\nI reflect the past age and think straight like Gibraltar\nMeditate, burn incense at my alter\nCall libation for great queens and forefathers\nI shave, brother.  I come with (?)\nUnderstandin' my eyes the supreme color copier\nMy afterlife simple as black and white\nStill movement like water reflecting the moonlight\nI hear voices in my head and obey what they send through\nAin't your vocals upon my thought instrumental\nRead, study lessons, build your inner power\nSick ciphers, the minute's being born to this hour\n\n[Hook: Sample from Guru on Gang Starr's \"JFK 2 LAX\"] (x2)\n\"Read, study lessons and build your inner power\" (x3)\n\"The next level doesn't tolerate cowards\""}]}