{"artist": "Canibus", "songs": [{"title": "A Different Vibe in L.A.", "album": "C! True Hollywood Stories", "year": null, "image": "https://images.genius.com/b3eb34359661b0bc8191e1fdb19d157e.600x600x1.jpg", "lyrics": "[Hook]\nDoop-doop da-da..\nIt's a whole different vibe when you in L.A\nDoop-doop da-da..\nIt's a whole different vibe when you in L.A\nDoop-doop da-da..\nIt's a whole different vibe when you in L.A\nDoop-doop da-da..\nIt's a whole different vibe when you in L.A\n\n[Verse 1]\nYeah, cruisin down Melrose, hella slow in a yellow Marinello\nLookin for who sells shelltoes that I could match with my silk robe\nI'm like Hugh Hefner at 26 years old, with clear goals\nYeah I'll take two pair of those\nI love the way my toes feel in the cyberfoam soles when I'm doin' shows\nWho knows, I'm prepared to go to and fro\nAll I do is tell you dudes where the Western Union dough\nYou need my social security info?\nHere's my tax I.D. number, it's worth ten fold\nI remember my first album, it shipped gold\nThat's an insult, considering I did this one in Kinko's\nI'm dying to see what this will sold\nWill the critics diss it at all, or will they feed Bis to the wolves?\nLike I haven't been there before\nBut at least I'm on a different vibe now, this year it's on\n\n[Hook]\n\n[Verse 2]\nIt's definitely a different vibe west of the Prime Meridian\nProducers play with live instruments, rhymes are wittier\nBut don't sleep cuz in a heartbeat Cali'll shit on ya\nSomeone'll put a hit on ya, this'll be where they bury ya\nI think it's beautiful, I don't want to be scarin' ya\nThe women are prettier and the climate is superior\nGot a girl from Syria, smells like strawberries on her period\nI'm serious - that's why I moved in with the chick\nWe on the top of Mount Olympus, sharin' our interests\nOver a moonlit dinner, burnin' some incense\nShe looks so innocent, next think I know she's pinnin' me to the bed\nLike a scene outta Basic Instinct\nBought her a pink mink and a double link ring\nShe didn't know I was a rapper and I did my thing-thing\nWhat a coincidence, she listened to Eminem and NSYNC\nShaggy, Nelly, and the St. Lunatic clique, Uh-Ohhhh!\n\n[Hook]\n\n[Verse 3]\nYeah baby, Canibus in the flesh\nEverybody want a dose of me, come here baby stand close to me\nTake a photo with me, take this address\nIf you develop 'em post one to me\nIf you miss me and you wanna kiss me then blow one to me\nI like your eccentricities, tailor-fitting jeans\nTennis bracelets from Tiffany's in Venice, Italy\nAre you from the Middle East? (Oh)\nI plan to travel there after my new release\nI got Timbaland doin' some beats\nYeah, his cousin goes to school with my niece\nBy the way I'm sorta starved, what kinda food do you eat?\nYeah sure hop in the car, we'll cruise the streets\nAround here I know alotta cool places to eat\nYou off from what, noon to three? Just roll with me\nMy homie Lou just two-wayed me from Laguna Beach\nYou can meet the rest of the crew, a bunch of super freaks\nWe got to unwind, we 'bout to hit the road in two weeks, c'mon\n\n[Hook]\n\nDoop-doop da-da.. [repeat to fade]"}]}