{"artist": "Boogie", "songs": [{"album": "LA Leakers Freestyles", "title": "Boogie Freestyle | LA Leakers Freestyle #025", "year": "2017-10-23", "lyrics": "[Spoken: Justin Credible, DJ Sourmilk, & Boogie]\nYes, yes! L.A. Leakers\nThat’s right\nJustin Credible, Sourmilk!\nYeah, that!\nThe west side of Compton has invaded the studio\nNow we in this jawn!\nBoogie in here, ready to talk some shit!\nLive from the west side, let’s get to it, man\nShady Records!\nShoutout the L.A. Leakers. Shoutout to Shady Records, man, shoutout to the world\nYeah, yeah, yeah, let’s get to it!\n\n[Intro: Boogie & DJ Sourmilk]\nYo-yo, yo, yeah, whoa\nBoogie!\nWoo\nI said, yo yo, aw man, goddamn oh (ooh)\n\n[Verse: Boogie]\nCome get a stroke of the best\nI see you holding your breath\nMight just get soaked from the stress\nWatch me, I flow in the mess, emotional wreck\nBut in this sea of lies, we ain’t synchronized\nGotta realign, I think me diving in these DMs\nGot a nigga really out here sinking eyes\nShit, I pray my Visa never get declined\nDon’t ever ask me what my cash do\nI still got problems with my phone bill\nShit, I still ain’t even paid the past-due\nYeah, we act new when it’s hard times\nWe might walk lines but we tiptoe, ugh\nTried to tell ‘em how our hearts died\nBut the dark side got us lit, though\nMy weed man still got nicks, though\nHe forever saying how his phone tapped\nSince pro clubs, been tryna go pro\nI’m in another league; call it pro-Black\nNah, it’s four Blacks in this hotbox\nWith these cold hearts, with like four straps\nFinna go back to the other side\nYou on borrowed time, nigga, hold that\nThe homie got these Twitter quotes\nI say he tripping, really, bro, stop it\nThis the land of the fake-woke\nBeing false gods get you no profit\nI ain’t saying that I’m so popping\nI ain’t gotta say the obvious\nI got curved by, like, three singers\nMan, it’s really fucking with my confidence\nYou know I’m still up on that Compton shit\nBut it’s gang signs, fuck a birth sign\nI heard it’s demons that I can’t see\nI need a Lasik surgery for my third eye\nThis the worst time\nBut let me surge by and power up, ugh\nThey burn my skin and scar my flesh\nLike, “Fuck your album cuts,” ugh\nSee, when you high up in the sky\nAnd you start thinking you the plug\nI’m so eager for rap beef\nI think that everything a sub\nYou know the drugs leave me impaired\nI got them problems but don’t care\nBut know that sober-up is real\nWhen you wake up and they still there, ugh\nI’m never home, but I never left (ooh)\nThey full-court, but they never press\nI’m the one that get a ref-and-tech\nI’m really Jordan’d up in retrospect\nI need that Nike check, I need a thottie next\nI need to sell these diamonds\nFrom this pressure I’m applying next, yo\nLove your address\nBut on the West, this shit just feel different, ugh\nLike, let some rapper come and test me\nNo, I’m still with it\nWe been with it since little children\nHit the store, split fifty cent with my nigga\nHe dipping in hatred, he chipped him a nigga\nBut I miss him, my nigga\nWest side, west side, west side\n\n[Outro: Justin Credible, DJ Sourmilk, & Boogie]\nOoh! Wow!\nFull court but they never press!\nWest side, west side, west side\nYeah! Yeah, yeah yeah\nYou hear what Boogie just did, rappers!\nWest side, west side, west\nWhen you come to the LA Leakers’ show, you gotta bring them real bars\nYeah, my man!\nBoogie, appreciate that, brother\nYeah!\nI appreciate y’all, man, for having me. Thank you\nYou already know, man. Congrats on the new situation\nShoutout the LA Leakers. Shoutout to all the ugly people in the world\nPower 106! #1 for hip-hop!\nKnow that!\nYeah! Yeah!", "image": "https://images.genius.com/6f329ec4a2750d93b8aa60439c9ba414.500x500x1.jpg"}]}