{"artist": "Drake", "songs": [{"year": "2016-08-28", "album": null, "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg", "title": "2016 MTV VMAs Vanguard Award Intro for Rihanna", "lyrics": "The first time, the first time I met Robyn Fenty was 2005. She was shooting a music video at a restaurant called Avacado in Toronto, the song was \"Pon de Replay,\" and the director... and the director of the video was Little X. I was introduced to her as the kid who played background music at the restaurant as people ate their dinner. It's hard to believe that eleven years later all three of us would come together the visual for her song called \"Work.\"\n\nToday the world knows Little X as Director X, they know me as Drake and not the kid singing while you order pasta. But eleven years later, they still know Rihanna as the one and only, Rihanna.\n\nCaptivating from day one, the iconic being that is Rihanna was already at a place where most artists only dream of going. For them, that's often the peak, but for her, that was a starting point, as she has kept ascending to an untouchable level ever since.\n\nWhen it comes to music, she relentlessly takes over the charts with every release. When it comes to performances, they swarm in masses just to be in her presence... obviously... And when it comes to fashion and style, she makes it seem so effortless until you try to do it yourself, which is when it gets a little awkward.\n\nWhat's most impressive isn't the endless list of stats, awards and accomplishments. What's most impressive is the person. Some artists need to play a character to achieve success, some need to downplay their own natural instincts to blend in. She succeeds by doing something that no one in this industry does, which is being herself.\n\nThis woman has surpassed all competition while still being the same girl from Barbados, surrounded by the same friends, speaking with the same accent and never missing a crop over unless it's to come and perform at OVO Fest. We love the music which can change styles from album to album. We love the videos which change their artistic vision from year to year. But most of all, we love the woman who hasn't changed since day one.\n\nShe's someone, she's someone I've been in love with since I was 22 years old. She's one of my... she's one of my best friends in the world. All my adult life I've looked up to her even though she's younger than me. She's a living, breathing legend in our industry. Ladies and gentlemen, the recipient of the Michael Jackson Vanguard Award for 2016: Rihanna."}]}