{"artist": "50 Cent", "songs": [{"album": "Power of the Dollar", "image": "https://images.genius.com/f29b6e681d1b1237ec06d01ab616992a.600x600x1.jpg", "title": "Gun Runners", "lyrics": "[50 Cent]\nAww man...who the fuck is callin'?\nI don't even wanna answer this shit...Hello?\n\n[Black Child]\nWhattup nigga it's Black\nRemember me from way back?\nWe used to go to school together\nMan, I got your number from Heather\nShe said you sell guns, I got beef I wanna see what you got\nAnd if I like it I'll cop\n\n[50 Cent]\nDamm nigga, you hot\nYou talkin' like you tryin' to get a nigga knocked\nWhat time is it? man, it's fuckin' 4 O'clock\nI shouldn't sell you shit, but Son, meet me on the block\nI ain't got time to waste man, where this nigga at?\nI'm in the Brown hooptie, there he go, I see 'em\nPullin' up slow in the BM\nI popped my trunk to show him what I'm workin' wit'\nFirst I showed him the TEC\nI told him Niggas give these shits respect\nBut you don't want this, Man\nThese shits is known to jam\nThis is a little smaller here\nAnd a little more common, 9 Millimeter Ruger\n16 shots, hollow points will go through ya\nAnd this? this here? this is a 12 gauge Mossberg kid\nTwo shots and you can wet like half a block\nThis shit here gets my dick hard\nIt's a Calico, it holds a hundred shots\nIf you can't kill your beef with this you need to stop\nC'mon, pick somethin' now nigga, you know it's hot\n\n[Black Child]\nMan, stop actin' like that nigga, just show me what you got\n\n[50 Cent]\nAight, nigga look, I got Two 380's\nOne black, one chrome, and 4 Glocks\nThey all hold 21 shots\nLook, I done been through all my shit nigga\nSo tell me what you want\n\n[Black Child]\nIt's hard to choose man, I think I'll take 'em all\n\n[50 Cent]\nOh, you gon' do me like that?\nI got one more piece to show you, my Derringer\nI keep it in the small of my back\nIt's a two shot, it's chrome, my initials engraved in it\n(shots ring off)\nLook at you now, you had to get it\nYour BM? I'm takin' it, shit, you don't need it\nPark it where I can watch it at and see if it got low jack\nThen take it to the chop shop to my Man Kojak\nHe gon' give me more cream so I can cop mo' gats\nJoe and Duke came through, them niggas copped two TEC's\nSaid \"Don't go by the gamblin' spot, that shit gon' get wet\"", "year": null}]}