{"songs": [{"album": "1000 Days, 1000 Songs", "year": "2014-08-15", "title": "Be Free", "image": "https://images.rapgenius.com/e1a0d302d483fd1c749dd91b613fc867.500x500x1.jpg", "lyrics": "[Verse 1]\nAnd I'm in denial\nAnd it don't take no x-ray to see right through my smile\nI know, I be on the go\nAnd there ain't no drink out there that can numb my soul\nOh no\n\n[Hook]\nAll we wanna do is take the chains off\nAll we wanna do is break the chains off\nAll we wanna do is be free\nAll we wanna do is be free\nAll we wanna do is take the chains off\nAll we wanna do is break the chains off\nAll we wanna do is be free\nAll we wanna do is be free\n\n[Verse 2]\nCan you tell me why\nEvery time I step outside I see my niggas die\nI'm lettin' you know\nThat there ain't no gun they make that can kill my soul\nOh no\n\n[Hook]\nAll we wanna do is take the chains off\nAll we wanna do is break the chains off\nAll we wanna do is be free\nAll we wanna do is be free\nAll we wanna do is take the chains off\nAll we wanna do is break the chains off\nAll we wanna do is be free\nAll we wanna do is be free\n\n[Eyewitness account from Dorian Johnson:]\nSo now it was like the officer is pulling him inside the car and he's trying to pull away.  At no time the officer said that he was going to do anything until he pulled out his weapon. His weapon was drawn and he said, \"I'll shoot you\" or, \"I'm going to shoot\" and in the same moment, the first shot went off. We looked down and he was shot and there was blood coming from him. Then we took off running\n\n[Bridge]\nAre we all alone, fighting on our own\nPlease give me a chance, I don't wanna dance\nSomethings got me down, I will stand my ground\nDon't just stand around, don't just stand around\n\n[Eyewitness account from Dorian Johnson:]\nAs we took off running I ducked and hid for my life, because I was fearing for my life. I hid behind the first car I saw. My friend, he kept running, and he told me to keep running because he feared for me too. So as he was running the officer was trying to get out of the car, and once he got out the car he pursued my friend but his weapon was drawn. Now he didn't see any weapon drawn at him or anything like that, us going for no weapon. His weapon was already drawn when he got out the car. He shot again, and once my friend felt that shot, he turned around and put his hands in the air, and started to get down, but the officer still approached with his weapon drawn and he fired 7 more shots and my friend died\n\n[Hook]\nAll we wanna do is take the chains off\nAll we wanna do is break the chains off\nAll we wanna do is be free\nAll we wanna do is be free\nAll we wanna do is take the chains off\nAll we wanna do is break the chains off\nAll we wanna do is be free\nAll we wanna do is be free"}], "artist": "J. Cole"}