{"songs": [{"image": "https://images.genius.com/b714c76ff85aee144b80660942cf2e22.1000x1000x1.jpg", "year": null, "lyrics": "What up John (testing one, two, three)\nWhat up Kon (hey convict music)\nLet's go (can you believe it)\n\nFresh white tee, fresh car walls, summertime hood niggas look like stars\nJewelry drip, fresh white airs\nMommy shake it up keep your ass right there (oh, can you believe it?)\nMy man got liquor and my cup's right here\nI can smell smoke pass the dutch right here\nNigga pass that, Capri pants with the waist cut off\nI wanna smash that (oh, can you believe it?)\nParty ran pack, mingling baby, and I can LL shake, you jingling baby?\nBack your ass up, I'm a start tingling baby\nWe can have more fun if wiggling baby (yea, can you believe it?)\nP hit the club with a dutch and a dub with it\nNigga don't cuff it if you ain't in love with it\nMatter fact let the grub get it\nPlease don't hate cause at least you can say you was with it\n\n[Chorus]\nCan you believe it? Get a break and get off the streets\nClear my mind from the shit I see\nIn a world full of smoke, contact from the weed\nThat's when it really bond on me\nI'm a be here for life, I ain't never gonna leave\nThe ghetto is all that I know\nIt's just another day in the hood my nigga\nLaying back trying get this dough\nYellin out ohhhhh, all up in the club\nAnd you know how we roll, squad deep like oh\nBad little bitch*s with their booty on score trying to beat like whoa\nKnow your ass feel it cause its outta control\nLet me hear you say oh, let me hear you say oh oh\nCan you believe it?\n\nBig ass truck, brand new rims, tank top Yankee, tanned out Tims\nBracelet, chain, fronts bob thin, new tattoos\nNew black shoes (hey, can you believe it?)\nGucci, Ermays, do that too\nWanna feel the breeze get a new black coupe\nNigga drop the top, come through the hood\nPut a hundred on your three or your foul line shot\n(ooh, ooh, oh can you believe it?)\nLending outfits all in the bus cause none of us could\nSee a summer without trips (none of us can see it)\nMad hoops so the little boys might bark at you\nBut they all lack good if the hood bothered you\n\nCan you believe it?\nGet a break and get off the streets\nClear my mind from the shit I see\nIn a world full of smoke, attack from the weed\nThat's when it really bond on me\nI'm a be here for life, never gonna leave\nThe ghetto is all that I know\nIt's just another day in the hood my nigga\nLaying back trying get this dough\nYellin out oh, all up in the club and you know how we roll\nSquad deep like oh\nBad little bitch*s with their booty on score trying to beat like whoa\nKnow your ass feel it cause its outta control\nLet me hear you say oh, let me hear you say oh oh\nCan you believe it?\n\nBasketball tournament, pitbull pups\nLadies in the club poring Chris in cups\nNiggas in the jail calling home on the phone (cause they locked up)\nBut you still trying to act like ain't shit enough\nMad sieves in the park, mad fights in the park\nNiggas talk how they run every night from the narcs\nAside from the light to the dark then the dark to the light\nI wanna smoke but I could search for my life\n\nCan you believe it?\nI've done spent ten again, watching her bend again, dancing for many men\nTell me have ever though about getting in\nA room full of convicts and D Block militants\nWe'll show you the time of your life\nYou can occupy my passenger side\nIntroduce you to the street life\nWatch you fall in love after just one night\nOhhhh, all up in the club and you know how we roll\nSquad deep like oh\nBad little bitches with their booty on score trying to beat like whoa\nKnow your ass feel it cause its outta control\nLet me hear you say oh, let me hear you say oh oh\nCan you believe it?\n\nCan you believe it? (Can you believe it? )\nLil' John, Akon, S.P. the ghost\nFeel what we trying to do (Can you believe it? )\nCan you believe it (Can you believe it? )", "title": "Can You Believe It", "album": null}], "artist": "Akon"}