{"artist": "Paul Wall", "songs": [{"album": "Get Money, Stay True", "title": "Everybody Know Me", "image": "https://images.genius.com/543671ac02810bd4cb034863e36dc96d.220x220x1.jpg", "lyrics": "[Intro - Paul Wall]\nWe back baby\nSwishahouse, TF\nMr. Lee, P. Wall\n\n[Hook 1 - Paul Wall]\nI got the screw tape playin in the deck\nSo I drive slowly (slow)\nGot them swangers pokin\nYeah the slab hold me (hey)\nEverybody know me (know me)\nEverybody know me (know me)\nEverybody know me (know me)\nEverybody know me (know me)\nCooler than a fan (fan)\nMoney in my hand\nStashed in them brown paper bags\nWith them rubberbands (bands)\nI ain't got to say nothin\nEverybody know me (know me)\nEverybody know me (know me)\nEverybody know me (know me)\n\n[Verse 1 - Paul Wall]\nBallin is a habit\nThat money, I got to have it\nI'm an addict for that paper\nMy hustle is automatic\nMy presence is so Jurassic\nThese lames is so tragic\nI'm lightin that Cali cactus\nSo I'm higher than an attic\nI'm choppin up the block like a garbage disposal\nSo the boppers proposition an indecent proposal\nI'm cool like popsicle\nBeen grindin since I was little\nOn this pool pick narrating these proverbs and riddles\nI'm fresh like green bananas and fly like Continental\nCause I stay up on my grind late night, like Jimmy Kimmel\nIn that pomegranate slam with the roof convert\nFive stars under the skirts, call it famous footwork\nThat Cali is active when Lil Keke got the trees lit\nTiltin the bumper kit\nI'm flippin with the screens lit\nRidin with the Big Dogg\nWe Breakin 'Em Off\nSippin the stuff to cure my cough\nPardon me, I'm throwed off\n\n[Hook 2 - Paul Wall]\nWith the screw tape playin in the deck\nSo I drive slowly (slow)\nGot them swangers pokin\nYeah the slab hold me (hey)\nEverybody know me (know me)\nCooler than a fan (fan)\nMoney in my hand\nStashed in them brown paper bags\nWith them rubberbands (bands)\nI ain't got to say nothin, everybody know me (know me)\nEverybody know me (know me)\nEverybody know me (know me)\n\n[Verse 2 - Snoop Dogg]\n(Roll it up), smoke it up, break it up, throw it up\nSpeed it up, slow it up, cut it up, screw it up\nDo it up, who involved?\nDo it to 'em Uncle Dogg\nEverywhere I've flown and gone\nBeen know to bounce some balls\nMy entourage, stay in charge\nI could never camouflage ('flage)\nDoggy do it extra large (large)\nCoppin to a lesser charge (charge)\nPaul Wall your next in charge, S is hard, reppin hard\nPress 'em hard (what?), tech in core (what?)\nBlast 'em like Nessie Mars (what? what?)\nYes a star, I'm a bad mother (mother, mother)\nI'm the only rapper known by your grandmother\nAnd your preacher and your teacher, ain't that a trip? (trip)\nMoshi moshi acuagru ain't that a bitch? (biatch)\nThat's Japanese, little homie, you should learn to mingle (mingle)\nSee, Snoop Dogg is international and bilingual (lingual)\nI'm in the game, got the fame and the money mayne (mayne)\nAnd everybody know my motherfuckin name (name)\n\n[Hook 1]\n\n[Verse 3 - Paul Wall]\nUh huh, come on\nCorrect me if I'm wrong but God damn I'm fly\nIn my famous stars and straps, no suit, no tie\nI got the heavy starch crease, so I'm sharp as an ice pick\nI'm swangin and bangin and holdin grain like a vice grip\nI'm high as a ceiling fan, I'm flyer than Superman\nI'm hot as a frying pan, cause baby I'm the man\nAnd I'm leanin like a kick stand, stackin up them grands\nFrom T Wet to Batan, that wood grain up in my hand\nRoll it up and pass it, as I cruise through traffic\nSlow motion candy ocean on this antique classic\nI'm superseedin my quota, out collectin these dimes\nMy speech slurred cause I'm leanin like a half passed nine\nI'm tippin down on them craigers, I'm skatin like Darren Harper\nWith a trunk full of speakers beatin hard like Travis Barker\nThe money in the stash, paid for make stack\nI'm swangin till the fo's clack, drinkin codeine extract\n\n[Hook 2]", "year": "2007-04-03"}]}