{"songs": [{"album": "Friday Night Lights", "year": "2010-11-12", "title": "Blow Up", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg", "lyrics": "[Chorus]\nHey, this is a song for my haters\nYeah, you got me feeling like the greatest\nYeah, hey, this is a song for my haters\nHey hey, you got me feeling like the greatest\nHa, bitch I’m about to blow up\nBitch I’m about to blow up\n\n[Verse 1]\nHey, I came up\nI warmed up, the next up\nBitch I’m about to blow up\nNow don’t it sound legendary\nLive enough to resurrect the dead and buried\nThis for niggas who ain't satisfied with secondary\nThis for my sisters who ain't satisfied with secretary\nUh, I’m blowing up and bitch I’m still me\nBut what's the cost to live your dream, do you feel me?\nEverything glittering ain't what you think it will be\nFunny how money, chains and whips make me feel free\nI’m starring in this bitch and yeah I write the show\nFuck the haters, I’m headed to the place you like to go\nThey say: \"What you fighting for? The game is on life support\"\nAnd Gary Coleman just passed: life is short\nBitch I’m about to blow up\nLook I’m about to blow up\nYeah, got to the club early just to get in free\nAnd wait for hoes to show up\nBut now its bottles at them tables, bring the models boy\nI’m about to po’ up\nUh ha, you know what\nBitch I’m about to blow up\nLeft side, left side\nRight side, right side\nLeft side, left side, hey\n\n[Chorus]\nHey, this is a song for my haters\nYeah, you got me feeling like the greatest\nYeah, hey, this is a song for my haters\nHey hey, you got me feeling like the greatest\nHa, bitch I’m about to blow up\nBitch I’m about to blow up\n\n[Verse 2]\nMama said I should reconsider law school\nThat means I wear a suit and bend the truth and feel awful\nHell naw, got a degree, but what that cost you?\nYou make a good salary just to pay Sally Mae\nThat's real as ever\nDucking bill collectors like Jehovah’s witness\nWhen they showed up at your door at Christmas\nWas broke as dishes tryna let it go\nHit the club she drop it low\nLower than my credit score\nAccount overdraft what I got this debit for\nSo much debt it got me drinking, thinking \"Bitch I better blow\"\nI better blow\nThese hoes ain't checking for no nigga with no vehicle\nYou border like Mexico\nHey baby girl, what it look like?\nAnd where ya head at?\nAnd what ya cook like?\nShe said \"where ya bread at\nAnd what your whip like?\nYou ain't got one or the other well brother good night\"\n\n[Chorus]\nHey, this is a song for my haters\nYeah, you got me feeling like the greatest\nYeah, hey, this is a song for my haters\nHey hey, you got me feeling like the greatest\nHa, bitch I’m about to blow up\nBitch I’m about to blow up\n\n[Verse 3]\nPraise God, it’s hard to stay spiritual\nHow they got these niggas on the TV selling miracles\nYou mean to tell me everything gon be fine\nIf I call your hotline and pay 29.99 shit\nWell damn, why ain't you say so?\nTake this check and ask God to multiply all my pesos\nAnd erase my number out the phones of these fake hoes\nI saved her number just in case but now it’s case closed\nTo you niggas biting my flows and my subject matter\nYou’ll never be me partner so it don’t fuckin' matter\nYou try to be and your career will see funerals\nAnd be you, that's when it sounds beautiful\nThen maybe you could blow up\nAnd maybe you could blow up\nShit, but you know what?\nFor now, bitch I’m about to blow up"}], "artist": "J. Cole"}