{"artist": "Drake", "songs": [{"year": "2018-06-29", "album": "Scorpion", "image": "https://images.genius.com/2fee80dd9aec0717aef8e1eb7aaaae4c.809x809x1.jpg", "title": "After Dark", "lyrics": "[Intro: Static Major]\nHaha, haha\nYeah, ayy (After dark)\n\n[Chorus: Drake, Static Major & Both]\nIn the whip solo\nNo one's gotta know (After dark)\nKnockin' at your door\nI don't gotta work anymore (After dark)\nYou can\nPut your phone down, you're gonna need two hands (After dark)\nYou can't get enough\nGirl, you know I set it up, for after dark\n\n[Verse 1: Drake & Static Major]\nLate night like Left Eye, I'm creepin'\nAssuming the worst 'cause I haven't heard from you all weekend\nYour silence is drivin' me up the wall, up the wall\nI cannot tell if you're duckin' calls or missin' calls\n'Cause you've been so patient\nI drink on the job and smoke on the job\nSo, I don't know how serious you take it\nCan't offer much more, you've heard it before\nThat narrative for me isn't changin'\nI wanna make you a priority\nI wanna let you know there's more to me\nI wanna have your faith restored in me\nI'll be on my way (After dark)\n\n[Chorus: Drake, Static Major, Ty Dolla $ign, Drake & Static]\nIn the whip solo, no one's gotta know\n(No one's gotta know) after dark\nKnockin' at your door, I don’t gotta work anymore\n(I don't gotta work no more) after dark\nYou can, put your phone down, you’re gonna need two hands\n(Ooh yeah, ooh yeah) after dark\nYou can't get enough\nGirl, you know I set it up, for after dark\n\n[Verse 2: Ty Dolla $ign]\nLate night, me and you, got you wet like the pool\nThen I'm tryna dive in, put some time in, yeah\nGet the vibe right, get your mind right\nIt's gon' be a long night (Ooh yeah)\nPut your feet in this water, don't wanna get your hair wet\nWe've hooked up a couple times, we ain't took it there yet\nYou broke up with your man and ain't been with nobody else\nYou like, \"Fuck these niggas,\" rather keep it to yourself\nHe did you wrong, he left you down bad\nNow you can't trust nobody\nYou said, \"Do anything, but just don't lie to me\"\nI said I ride for you, girl, you said you ride for me\nUmm, pulled up to the show then we got ghost\nAnd when it's after dark anything goes\n\n[Chorus: Drake, Static Major, Ty Dolla $ign, Drake & Static]\nIn the whip solo, no one's gotta know\n(No one's gotta know) after dark\nKnockin' at your door, I don’t gotta work anymore\n(I don't gotta work no more) after dark\nYou can, put your phone down, you’re gonna need two hands\n(Ooh yeah, ooh yeah) after dark\nYou can't get enough\nGirl, you know I set it up, for after dark\n\n[Spoken Outro: Al Wood]\n93.7, WBLK, [?] at the Quiet Storm, taking you right there with Hall & Oates. Moving you through the storm in what is now 19 minutes after 10 o’clock. Thanks for your phone calls as we get you closer to your requests and dedications. Phone lines are open for you to send a love, your love note dedications. 644-9393, call me. Coming up, we will head through your storm with Troop, Fantasia, Chaka Khan, my Funny Valentine Jill Scott, giving you whatever and more, the selected music of Mr. Luther Vandross, as we kick off your first hour of the most selective, most seductive, most relaxing four hours of the 93-7. It’s Al Wood and you are safe, soft and warm, in the loving embrace of my storm on BLK"}]}