{"songs": [{"year": null, "title": "Desperado", "image": "https://images.genius.com/3c22beeaf7429878d5c802e89fd45a11.500x500x1.jpg", "lyrics": "[Intro]\nYea..\nYea man, yo Mr. Jones, b'\nI'm a motherfuckin' (*\"Desperado\"*)\nYes, yes (yes, yes)\nChea, turn me up\nTurn me up, turn me up, turn me up\n\n[Verse 1]\nSeven AM, I wake up to my little sister puttin' on make-up\nR. Kelly come on, she turn the bass up\n'Move Ya Body Like A Snake,' WHAT?\nYou need to take ya ass to school and get them fuckin' grades up\nMy lil' brotha, he swear he 'bout to get some cake up\nRunnin' 'round all crazy rockin' a fake Jacob\nThe lil' nigga keep raisin his voice to my mom\nI'mma have no choice but to do him some harm\nFor now, I play the block wit' my cousin Tyrell\nCause around him, pussy is not what I smell\nFresh outta jail, the street, will I survive? Will I fail?\nWill I go to hell or go back with 25 wit' a L\nSee only time will tell if only crime prevail\nThe rap now, only the phony kind can sell\nAnd I don't wanna have to keep runnin' from 5-0\nI don't wanna live my life like no (*\"Desperado\"*)\n\n[Hook]\nWe come from the bottom of the street\nWe stuck like gum to the bottom of ya feet\nIf you front in ya rap, we catch you in the street (in the street)\nRun up on you wit the heat\nI'mma (*\"Desperado\"*)\n{Repeat}\n\n[Bridge: talking]\n{various ad-libs}\nI pushed the lil' nigga unda the wing right?\nI mean, I practically raised this nigga\nHe runnin' 'round the street now like he wanna be a muhfuckin' (*\"Desperado\"*)\n\n[Verse 2]\nWe was two lil' brothers of the same kind\nQuick to approach a lil shorty wit' the same line\nCo-defendants, arrested for the same crime\nCause when the D's found the nine, we both said it ain't mine\nNobody snitchin', now we chillin on the same line\nGoin to chow to eat some of the same slime\nI'm tryin' to tell the nigga the thoughts of my changed mind\nHow when I get out, I ain't gettin' on the same grind\nI'm tired of seein' what crack smoke do to black folk\nThat shit ain't funny at all dawg it's like a bad joke\nHe said, whateva' man, I'll do whateva to get the cheddar man\nDo like 50 Cent, sell \"A Lil Bit\" of ery'thang\nThat made me wanna punch the kid in the mouth\nI just wonder how long it take for him to figure this out\nI said, trust lil' nigga if you know like I know\nYou wouldn't wanna go home to no muthafuckin' (*\"Desperado\"*)\n\n[Bridge: talking]\nWord up shorty nab, don't be like me, you could be better than me\nYou don't wanna grow up to be no muthafuckin' (*\"Desperado\"*)\n\n[Hook]", "album": "The Return Of Tha Yardfather"}], "artist": "Saigon"}