{"songs": [{"year": null, "album": "My Life is a Movie", "image": "https://images.genius.com/5b75d54d0308abb6dc6e5d131b2b35e8.168x179x1.jpg", "title": "My Life Is A Movie", "lyrics": "[Hook]\nI can't even take it no more\nSo what will it take to let me in a door?\nMy life is a movie subtitled to suit me\nAction and drama filled with black uzis\n\n[Verse 1]\nI'm a retarded artist, I walk with a limp\nI'm sick, I should see a shrink, I'm unstable in the whip\nI talk with a slang, old school, top of the game\nI owe money, I can't even talk to the bank\nI'm furious, my [?] tape is so serious\nI sport more blood raps than periods\nCheck me out like a product you about to buy\nI'm hot, motherfucker you about to fry\nWhere I'm from, rappers say \"we don't go\"\nWhen I'm around here, rappers say \"we don't flow\"\nAnd why's that? Cause wise rappers act like that\nThey don't want it, they can't say more than \"blah blah blah\"\nJust teasing, I could be sub-freezing\nI'm out to kill like white men in duck season\nI'm fresh, sicker than the [?] rate too\nBut you wouldn't get the point even if my finger faced you\n\n[Hook]\nI can't even take it no more\nSo what will it take to let me in a door?\nMy life is a movie subtitled to suit me\nAction and drama filled with black uzis\n\n[Verse 2]\nShoot me, I got zero so sue me\nI hear gunshots, inspirations go through me\nYou frightened, calm down, who's fighting?\nYou're like Avril, the question is: who's writing?\nI should sing like André 3000 (Outkast!)\nPunk rap, same but had these kids acting\nI propose new ideas while you buy beers\nYou think I'm dope, what you do that is\nI don't blame you, I'm violently soul-jazzy\nI'm disgusting, I'm twisted and it's all passion\nI'm like masturbating in public, I'm so nasty\nFigure me out, feel me but don't gas me\nI'm truth, I can't shop in the high end\nCause when I go home I be really high then\nI ask \"where's the love?\" like will.i.am\n(coughing) That's how sick I am\n\n[Hook]\nI can't even take it no more\nSo what will it take to let me in a door?\nMy life is a movie subtitled to suit me\nAction and drama filled with black uzis\n\n[Verse 3]\nWhat's it all worth? What if it don't work?\nWhat if I can't cope? What if I lose hope?\nWhat if I choose dope? What if I sniff coke?\nWhat if I stay broke? What if they don't fill?\nWhat if it don't kill? What if I don't sell?\nWhat if I don't bail? What if I'm not sick?\nWhat if I'm just well? What if my luck sucks?\nWhat if I fucked up? What if I get stopped?\nWhat if I get knocked? What if I get shot?\nWhat if I get caught? What if I get--?\n(?)Deeka deep my stampede(?)\n\n[Hook]\nI can't even take it no more\nSo what will it take to let me in a door?\nMy life is a movie subtitled to suit me\nAction and drama filled with black uzis\n\n[Outro]\nLet it ride\nBang ya head\nThat's it\n(Represent, represent)\nIt's Dusty (represent, represent)\nYo you feel me (represent, represent)\nMove out of my way, let me do the running man here\n(Represent, represent)\nThat's it\nCheck me out, my name is K'Naan the dusty foot philosopher\nGood night, ladies and gentlemen"}], "artist": "K’naan"}