{"artist": "Canibus", "songs": [{"title": "Blind by Design (Ft. Nappi Music)", "album": "Full Spectrum Dominance 3", "year": null, "image": "https://images.genius.com/94586c731d34b8bcc23db8eee22ef97f.500x500x1.jpg", "lyrics": "[Verse 1: Canibus]\nBuild the wall, if it's a trap \"kill them all\"\nThe voltage is too small I need a billion more\nMy K-9s are too small, I gotta feed them more\nDear Santa Claus - how 'bout you feed the poor?\nWWG1WGA, read the blog\nDon't you dare put your dirty paws on my seed vault\nFamily feud, now I'm in a manly mood\nDude - stop listening to Q, that can't be true\nI heard Q likes Hip-Hop too, yeah? What's his favorite group?\nI dunno but I'm gonna' need proof\nI was looking for Flava Flav in Creed, I ain't see 'im\nAll I see is Mr. T fightin' for our freedoms\nClubber Lang & Iron Mike eat 'em, tag team 'em\nBag over the head, hang for treason\n2019 season's greetings, call me back\nI'm in a meeting, cause runnin' the country is not easy\n\n[Chorus: Nappi Music x2]\nIf I get control of my mind then i'm FREE\nCall tha army cuz i'm bein all i can BE\nI was blind, followed the signs 'n now I SEE\nThe stupid motherfuckers that are scared of ME\n\n[Verse 2: Canibus]\nHere's the thing, nothing goes down without a hitch\nSometimes diplomacy works, never without a glitch\nEvidence, negligence - stinky breath death threats peppermints\nThat's why I stopped checking my messages\nMy crossfit Nano's come in Jack Russell dog shit camo\nNow I really feel like Rambo\nIf a man of the cloth ever tries to put his hand in my shorts\nI'll band saw the whole back of his pants off\nWhile he's still wearing them, according to God's biblical source\nI just feel like saying \"Lyrical Law\"\nJust because I fell outta love with Hip-Hop, now I'm bored\nI didn't like the peace treaty accord\nMockingbird media bought, don't know who to trust no more\nThey act like Adebisi from OZ\nThey follow me in Walmart everytime I go looking for car parts\nOr when I'm drying off at the car wash\n\n[Chorus: Nappi Music x2]\nIf I get control of my mind then i'm FREE\nCall tha army cuz i'm bein all i can BE\nI was blind, followed the signs 'n now I SEE\nThat stupid motherfuckers that are scared of ME"}]}