{"artist": "Vanilla Ice", "songs": [{"title": "Elvis Killed Kennedy", "year": "2001-10-23", "lyrics": "[Verse 1: Chuck D]\nConfrontation town front\nI can't front! No, I can't believe this funk\nGot a blacklash as long as some happy ass\nClown, frown, Uh I get down\nIn the trenches underneath the underground\nUnder a blanket of hell you never heard rejected the sound\nWrap your troubles in dreams baby in search of a theme\nI can't believe I'm triple teamed\nI voted! Hope my ass wasn't railroaded\nRan for the border to avoid the slaughter\nShit! I blamed that tape recorder cause you mad outta order\nBeyond categories, another East side story Uh\nThat's three thousand miles ago\nCause cats are shook by past crooks\nDoin street hooks too many freestyles yo be off the books\nBe the judge make sure that needle don't budge don't prejudge\nYour frustration anger at the association\nWhat difference it makin got the whole world\nHatin art of war vocals influence the locals\n\n[Hook 2x]\nIt's a mad mad world we've been living everyday\nWhat you gone to say all man say I'm a fuck up\nLiving don't throw it away\nIt's a mad mad world we've been living everyday\nWhat you goin to do all man say I'm a fuck up\nLiving don't throw it away\nClaver est operes a mixer\nLe New Jacks sont dans\nLes MC's sont pres auteur en toute Liberte\nIt's a mad mad world we've been living everyday\n\n(Translation)\nWe are ready to get in the mix\nThe new generation are in the place to be\nMC's are ready to express themselves freely\n\n[Verse 2: Vanilla Ice]\nNow I feel trapped in this everyday form of life\nWho's wrong or right who knows I still fight\nTo survive live from the land of confusion\nMan's abusing which religion are you choosing\nSubstance abusing losing touch with reality\nHave you forgot about your family values\nCan't you understand the plan\nWorld destruction push the button end of discussion\nBoom\nWhat'cha gonna do now\nIt's like the sound of a nuclear holocaust going Boo Yah\nWhat a mad world\nWe got cops on the take\nFemales being raped\nBodies floatin in the lake\nWhy? Over hate\nBetter check your faith cause it'll be gone before you wake\n\nChorus", "album": "Bi-Polar: Bomb Tha System", "image": "https://images.genius.com/a16d4d55e67b3b23d045b99ddb30bd72.220x217x1.jpg"}]}