{"artist": "Bankroll Fresh", "songs": [{"lyrics": "[Verse;]\nDiamonds pressed against the wood\nI got mother fucking money like I fucking should\nA lot of niggas hating on me, earrings like Suge...Knight\nDiamond, bright, shining, light\nIt’s a motherfucking sunny day\nAnd this rap shit paying me\nAnd my pockets on full like I’m selling D\nRemember days I reflected on selling P's\nRemember days nigga calling I'm collecting ki's\nRemember days niggas calling I'm collecting fees\nSucka ass nigga hating motherfuck ya\nI got this motherfucker on me, I'll bust ya\nYou rap niggas playin friendly I don’t trust ya\nYou rap niggas playin friendly I don’t trust ya\nSneak dissin nigga talk behind my back it come right back to me\nAnd nigga you a pussy nigga you was scared to pull it\nAnd I got this 45 on me for any nigga bullet\nI got this 40 cal on me try me I'll pop ya\nDown in Houston at the Galleria big shoppin\n454 I could frame ya I'm big blockin\nA young nigga hall of fame like I’m John Stockton\nI'm throwin this shit from long range I get these hoes droppin\nI'm throwin this shit from long range I got these hoes poppin\nI pull up wit a whole thang meet me at the partments\nThey say the feds watchin hell nah these niggas tellin\nAin't no tellin what a nigga tellin what you sellin\nWho could you trust in these streets? Not a fuckin soul\nAnd what goes on behind closed doors you'll never know\n\n[Outro:]\nSee this shit forreal man\nLike every motherfuckin day this shit get thick forreal my nigga\nYou don’t know how the fuck this shit be feelin man\nYo mf...yo mf patna nigga, foldin on you nigga\nShit forreal nigga\nWho the fuck could you trust nigga\nYou gettin this mf money nigga\nWho is there to trust nigga?\nThese money hungry bitches? Fuck nah\nYou gon mf get it or you gon starve nigga\nI’m goin to get it nigga\nI ain't got time to mf play and lay nigga\nOne hunnit nigga", "image": "https://images.genius.com/37fbe0aeda90290af65fe6f6f6631f63.500x500x1.jpg", "year": null, "title": "LOAHB2 Real Trapper Freestyle", "album": "Life Of A Hot Boy 2: Real Trapper"}]}