{"songs": [{"album": "T.I. vs T.I.P.", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg", "year": "2007-07-03", "title": "Act I: T.I.P.", "lyrics": "{*TV changing channels*}\n\"Rapper T.I.\"\n\"3 Grammy nomination...\"\n\"With the second highest debut on the hip-hop...\"\n\"If you look left there's a monkey next to an anaconda\"\n\"Sentenced to probation...\" - \"BBC\"\n\"Philant John...\" - \"Philant Johnson, gunned down\"\n\"In a hail of gun...\"\n\"... suffered a miscarriage\"\n\"_ATL_ opens with a...\"\n\"Featuring with the acting debut of rapper T.I.\"\n\n[T.I.]\nMan, I ain't sign up for this shit\nI lost my partner, and lost my life homes\nMan fuck this shit, I'm done\n\nAy, listen homes, get Atlantic on the phone, go on call 'em\nAnd tell Craig, Julie, Kev, and Kys - I need to holla at 'em\nFirst I gotta let 'em know I'm tired of rappin\nFuck the money, ever since Phil died I ain't happy\nHey what's happenin, we under new operations\nThough we ready for whatever, we like ya cooperation better\nListen when I'm talkin, throw it off, I ain't patient\nI'mma tell ya once then start countin shell cases\nDon't mean to scare you but this bullshit is irritatin\nI'mma tell you like it is shawty, I ain't fin' to play\nI feel like another case comin round the corner any day\nI know the consequences, I'm the same nigga anyway - anyway\nIt's way more important than what I'm fin' ta say\nDo what I say or I ain't droppin shit 'til twenty twenty-eight\n(Who gives a fuck if he comes on the 20th for 28th?)\n{He said the year 2028 you fucking moron!}\nListen guys, on that B-I shit\nIt's T.I.P. from here on out, fuck that T.I. shit\nGive a damn what any nigga gotta say 'bout this\n(Yo check this cat) Yeah I think it's best to say I did it\nDon't be e-mailin no itineraries, I won't get it\nYa best bet just holla when they fill the jet\nTell Cindy ain't no photo shoots and I ain't interviewin\nRefuse and I'll build a subdivision and shoot a dozen movies\n{Cash that check and be spendin our money}\nYou right about that honey, thanks for doin that for me\nSpeakin of money - you can always buy me out but the price high\nI ain't none of T.I. nigga, no mo' Mr. Nice Guy\n\n[Lyor Cohen]\nListen kid, understand me here (what?)\nThis is Lyor Cohen (yeah yeah)\nYou better treat this company with some respect (ha ha ha ha)\nAnd you better not be playin with my motherfuckin money\n\n[Outro: T.I.]\nOh I got ya motherfuckin money partner, but I ain't playin\nYou got any sense you'll do what the fuck I say\nI ain't sellin no goddamn albums\nAnd that ain't no threat, that's a motherfuckin promise jack!\nCome and see me if you want it\nGet it like the Red Cross nigga!\n{*phone hangs up and dial tone*}\n\n[Repeat to fade]\nHustle pimp, hustle pimp\n\n{*busy signal*}\n\"If you'd like to make a call, please hang up and try again\nIf you need help, hang up and then dial your operator.\""}], "artist": "T.I."}