{"songs": [{"lyrics": "[Intro]\nDr. Dre: Yo, man, it's a lot of brothers out there flakin' and perpetratin' but scared to kick reality\nIce Cube: Man, you've been doin' all this dope producing, but you ain't had a chance to show 'em what time it is\nDr. Dre: So what you want me to do? ... (Express yourself)\n\n[Verse 1: Dr. Dre]\nI'm expressing with my full capabilities\nAnd now I'm living in correctional facilities\nCause some don't agree with how I do this\nI get straight, meditate like a Buddhist\nI'm dropping flavor, my behavior is hereditary\nBut my technique is very necessary\nBlame it on Ice Cube, because he says it gets funky\nWhen you got a subject and a predicate\nAdd it on a dope beat and that'll make you think\nSome suckers just tickle me pink\nTo my stomach, cause they don't flow like this one\nYou know what? I won't hesitate to dis one\nOr two before I'm through, so don't try to sing this\nSome drop science, well I'm dropping English\nEven if Yella makes it a cappella\nI still express, yo I don't smoke weed or sess\nCause it's known to give a brother brain damage\nAnd brain damage on the mic don't manage nothing\nBut making a sucker and you equal, don't be another sequel\n\n[Chorus]\nExpress yourself\nCome on and do it\n\n[Verse 2: Dr. Dre]\nNow, getting back to the PG\nThat's program, and it's easy\nDre is back, new jacks are made hollow\nExpressing ain't their subject because they like to follow\nThe words, the style, the trend, the records I spin\nAgain and again and again, yo, you on the other end\nWatch a brother saying dope rhymes with no help\nThere's no fessing and guessing while I'm expressing myself\nIt's crazy to see people be\nWhat society wants them to be, but not me\nRuthless is the way to go, they know\nOthers say rhymes that fail to be original\nOr they kill where the hip-hop starts\nForget about the ghetto and rap for the pop charts\nSome musicians cuss at home\nBut scared to use profanity when up on the microphone\nYeah, they want reality but you won't hear none\nThey rather exaggerate a little fiction\nSome say no to drugs and take a stand\nBut after the show they go looking for the dopeman\nOr they ban my group from the radio, hear N.W.A and say \"Hell no!\"\nBut you know it ain't all about wealth as long as you make a note to...\n\n[Chorus]\nExpress yourself\nCome on and do it\n\n[Verse 3: Dr. Dre]\nFrom the heart cause if you wanna start to move up the chart\nThen expression is a big part of it\nYou ain't efficient when you flow\nYou ain't swift, moving like a tortoise, full of rigor mortis\nThere's a little bit more to show\nI got rhymes in my mind, embedded like an embryo\nOr a lesson, all of 'em expression\nAnd if you start fessing, I got a Smith and Wesson for you\nI might ignore your record because it has no bottom\nI get loose in the summer, winter, spring and autumn\nIt's Dre on the mic, getting physical\nDoing the job, N.W.A is the lynch mob\nYes, I'm macabre but you know you need this\nAnd the knowledge is growing, just like a fetus\nOr a tumor but here's the rumor\nDre is in the neighborhood and he's up to no good\nWhen I start expressing myself, Yella slam it\nCause If I stay funky like this, I'm doing damage\nOr I'mma be too hyped and need a straight jacket\nI got knowledge and other suckers lack it\nSo, when you see Dre, a DJ on the mic\nAsk what it's like, it's like we getting hype tonight\nCause if I strike, it ain't for your good health\nBut I won't strike if you just\n\n[Chorus]\nExpress yourself\nCome on and do it", "album": "Straight Outta Compton", "year": "1988-07-10", "title": "Express Yourself", "image": "https://images.genius.com/253cced2ff8d60ecb6a211562e9499a9.600x600x1.jpg"}], "artist": "N.W.A"}