{"artist": "Papoose", "songs": [{"album": null, "title": "Back on My Bullshit (Remix)", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Intro: Rick Ross]\nAny nigga, any nigga been throwin' shade or hatin' in the last 3 years, fuck 'em\nYeah, we shittin' on you right now\nWe ain't givin' no passes, yeah, you pussy\nBang, ha, bang\nNiggas still got the same car from my Trilla album, what?\n\n[Verse 1: Papoose]\nThis summer, I'm only ridin' in convertibles, son\nI'm signed to MMG, money, murder and guns\nRick Ross was official, I knew him a long time\n'Cause he took off his shades just so he can look in my eye\nBack with the remix, heard you back in the precinct\nQuit yappin', you weakling\nPackin' a mean grip\nAutomatic with 3 clips\nYou rap with no reason\nStacked with some mean chips\nI spent a rack on a clean whip\nI'll get it back when a key flip\nGrams bagging, we saran wrapping' out in Manhattan\nYou don't have to believe it\nMarried the queen chick\nShe be keepin' her king lit\nI be grabbin' her cleavage\nClappin' up leaches\nWhen the ratchet unleashes\nI blast 'em to pieces\nFast when I'm reachin'\nLeave you paraplegic\nWe be on that Max B shit\nBout it bout it, Master P but you get defeated\nWe the mafia like the 3 6\nThe kingpin I have an actual reason to stop you maggots from breathin'\nNo pacifier, I was passing fire arms, fire chromes when you rappers were seeded\nTrappin' and eatin', got 'em back on the defence, I be havin' 'em speechless\nFly and flashy, got 'em aggy, said he's sending shots at me but I know he received it\n\n[Chorus: Jaquae]\nThis time I ain't playing fair\nI'ma take what's mine\nI want more money, more part, goddamn\nNigga, it's about that time\nI'm back on my bullshit\nI'm back on my bullshit\nI said I'm back on my bullshit\nI'm back on my bullshit, hey\n\n[Verse 2: Rick Ross]\nMet Pap in '96, fresh off the bus\nResidue in my raps from holdin' dust\nI didn't wanna in case I made her touch her toes\nWe touchin' money but really, who touch the most?\nWe on the corner with my slugs poppin' wheelies\nWe never run 'cause we know who run the city\nShe on the train just to let us run the train\nWho do the body, I'ma give that boy a chain\nHustler, I got it tatted on my neck\n20 deal Presidents tatted across my chest\n[?] now they say that boy the best\nTell us what you know 'cause you don't get no respect\nI pass it to Papoose out on a fast break\nHer pussy can never be better than what's in my ashtray\nBang, biggest\nHer pussy can never be better than what's in my ashtray\n\n[Chorus: Jaquae]\nThis time I ain't playing fair\nI'ma take what's mine\nI want more money, more part, goddamn\nNigga, it's about that time\nI'm back on my bullshit\nI'm back on my bullshit\nI said I'm back on my bullshit\nI'm back on my bullshit, hey\n\n[Outro: Rick Ross]\nAyo, Pap, remember when we met at the 5 villains photoshoot?\nLike yo, ain't no 5 Philly villains, nigga\nWe the future of the rap game\nFuture of the culture\nWe the biggest\nWe shook hands then, homie\nSee it in my eyes then, nigga, let's go", "year": "2017-05-26"}]}