{"artist": "KILLY", "songs": [{"image": "https://images.genius.com/0a7e609d0bd2cc3f7e6bd9620616271d.1000x1000x1.jpg", "title": "Simulation", "year": "2019-06-14", "album": "Light Path 8", "lyrics": "[Intro]\nBijan 'bout it, ’bout it, boy\n\n[Chorus]\nDon't get caught in the moment (In the moment)\n24/7, stay open\nLifestyle won't change for nothing (What?)\nFast life might leave you hopeless (What? Yeah)\nLifestyle, I can’t escape it, the simulation\nLifestyle, I can't escape it, the simulation (Oh, no, no)\n\n[Verse 1]\nChandelier, dinner table, white wine (White wine)\nShorty fell in love with the limelight (The limelight)\nSmokin' cookie-ookie, I'ma take flight\nWaistline BB Simons, buckle got a super shine (Glee, glee, glee)\nI come from the north, I'm still a super slime (Slime)\nBeat the pussy up like it's a Budokai\nSuicide doors goin' do-or-die (Swerve)\nFast life catching up, don't look behind (No)\nShawty think we click ’cause her horoscope\nLet her know, I ain’t him, it not one of those (One of those)\nLean, lean, drop in the antidote (Yeah, yeah, drop)\nI smoke strong, you smokin' charcoal\nThat’s not the plug, that's a narco\nRacks every other week, comin' in, cargo (Racks)\nFast life a little harmful (Hey)\nBut I'ma live forever, fuck a downfall\n\n[Chorus]\nDon’t get caught in the moment (In the moment)\n24/7, stay open\nLifestyle won't change for nothing (What?)\nFast life might leave you hopeless (What? Yeah)\nLifestyle, I can't escape it, the simulation\nLifestyle, I can't escape it, the simulation (Oh, no, no)\n\n[Verse 2]\nThe simulation, devil on my back and the evil follow me\nBorn alone, die alone, please don't bother me, yeah\nCome for my soul, they want a part of me (What?)\nIf it's not them then it's 5G (5G)\nOr probably what they putting in the water (Yeah)\nEverywhere I look is a facade, yeah (Yeah, yeah)\nThe simulation doesn't offer solace (Yeah, yeah)\nStill walking out the Louis store stomping (Yeah, yeah)\nBought the whole store, a little guilt on my conscience (Yeah, yeah)\nKeep the fake far away, cleanse the toxins\nI don't trust a lot, I trust the process (Me, me, me)\nAll these new faces so exhausting\nI can see your whole fate through these Prada optics (Optics)\nCounting up blessings, never losses (Losses)\nPour some out for my guys, not forgotten (Yeah)\n\n[Chorus]\nDon't get caught in the moment (In the moment)\n24/7, stay open\nLifestyle won't change for nothing (What?)\nFast life might leave you hopeless (What? Yeah)\nLifestyle, I can't escape it, the simulation\nLifestyle, I can't escape it, the simulation (Oh, no, no)\n\n[Outro]\nYeah, yeah, yeah, what?"}]}