{"songs": [{"image": "https://images.genius.com/10c1ee673161b4c94517a1a138fc3e08.750x750x1.jpg", "title": "Only One (feat. Shuree Williams)", "album": "Xist Music Presents: Move Vol. 1", "year": "2012-08-28", "lyrics": "[Verse 1: NF]\nGod if you ain't in the picture, I don't wanna be apart of it\nTryna keep my pride with me, You tell me to swallow it\nYea so I swallowed it, broke open and bottled it\nYou took all my sins and told me that You'd demolish 'em\nAnd I ain't gotta live like I ain't got no direction\nYou just took my hands and You gave me the directions\nNow I'm on the right road lookin' at the right map\nI might take a bad turn but You steer me right back\nLet's go, yea\nI'm feelin' better than I ever did\nUh, yeah, better than I ever was\nI dare someone to say what better is\nCan feelin' better than this is somethin' I never done\nI put my hands up and I praise You\nI ain't even gotta trip, I'm unashamed too\nYou see the things of this world, they don't fill me up\nYou're pourin' out Your love, I want You to fill my cup\n\n[Chorus: Shuree Williams]\nAnd I'll show the world\nYou're the only One for me\nYou're the only One for me\n(2x)\n\n[Verse 2: NF]\nYeah You give me grace, even though I don't deserve that\nDon't know how to thank You, don't know where the words at\nOn the other hand, I just feel speechless\nBut I got a lot to say, so might as well speak it\nI'm nothin' but a sinner, I don't know why You accept me\nYour arms wide open, why are You so accepting?\nHangin' with the world, thought I had the best things\nThen I turned around and realized that y'all left me\nAnd it upsets me that I fail\nBut at the same time I know You will\nShow me Your mercy, I ain't even worthy\nI'm lower than derpy, but You are for real\nAnd I ain't gotta worry 'bout You leavin' me broken\nAnd I ain't gotta worry 'bout You leavin' me hopeless\nYou are what hope is, and I put hope in You alone\nI want the world to know this\n\n[Chorus: Shuree Williams]\nAnd I'll show the world\nYou're the only One for me\nYou're the only One for me\n(4x)\n\n[Bridge: Shuree]\nWoah woah, I'll shout it\nWoah woah, the mountains\nWoah woah, don't doubt it\nThat I am Your's"}], "artist": "NF"}