{"artist": "Cage", "songs": [{"title": "Illest 4 Letter Word", "album": "For Your Box", "year": null, "image": "https://images.genius.com/659c6920621d1e7d8c28f528b2110f29.300x298x1.jpg", "lyrics": "Test Test..\n\n(CAGE)\nYou wanna kill me nigga?\n\nAll the way live, we bring to you to host the annual drowning\nIn Lake Michigan..\n\n(CAGE)\nI heard some blonde bitch walking through New York looking for Cage!\nI'll stab you in the face, ten times in the same place\nWaste your little infant, see you thinking different\nWhen in the same building or on the street lift you off your feet\nWon't chill then, microsibling to my cock\nDribbling, Scribbling verses\nFor the worthless, fuck a million purses\nPOP THUG! See if your doctor can remove the slug\nI bug when I think, so simple\nJux you in the club\nSomething for ya entourage\nSomething for your body guards\nHistory shows rappers dying in cars\nThey lost one in the West; we lost one in the East\nShould I drown you in Lake Mich. or buck you in Miami Beach?\n\nChorus: Cage\n\nThe illest four-letter word in the world is Cage!\nYa better off fucking some cunt raw and gettin AIDS\n\nBitch the illest four letter word in the world is Cage!\nBitch the illest four letter word in the world is Cage!\nYa better off fucking some cunt raw and gettin AIDS\n\nThe Illest four letter word in the world is Cage!\n\n(CAGE)\nThe illest four letter word in the world, supporter\nRhyme slaughter, the listener to death save the gun for the\nBlonde Ambition, fell off the Christian wagon\nYour systems saggin biting my shit and I'm laughing\nI can freak simple shit and sell records but I don't\nI write the illest shit that cause fans to enter bitin' zones\nKeep your guards by your guard you showing cards on the low\nSee a man gotta deal, now y'all look just like Quo\nAll you schizophrenics need help with reality\nKill your two little personalities\nShook and slut getting salary\nObserve gravity pullin ya in to earth gradually\nYou'll see you need a style I ain't create to try and battle me\n\nChorus\n\n(CAGE)\nBig electro shock if you can't understand\nI wreck intellects slanted brains like Japan\nMy An-ger's like a gust of sick lust\nWon't you come and injure us is what their brains scream thus\nI've never contemplated while hallucinating\nMy existence aiding those with imaginations\nAnd mental disorders pulsating\nI'm trading\nMy lost love leak princess for interest and this other slut\nThat puffs bundles of dust\nFrom bongs while she rocks a thong we get trommed\nI keep touchin' her clit with salad tongs\nFucked her up against the intercom\nSo my nigga's down stairs can hear\nStill buggin like an insect laying larva in ya ear\nChorus"}]}