{"artist": "Ice Cube", "songs": [{"title": "Extradition", "lyrics": "[Intro]\nDear Momma, If some people came by the house lookin for me\nI'm innocent of anything they say I done\nNow I don't know when I'll be able to write you again\nBut I will be back to California to see you\nYour son, Ice-motherfucking-Cube\n\n[Chorus]\nKeep my hand on my gun cause they got me on the run\nI swear I didn't do what they say I done\nKeep my hand on my gun cause they got me on the run\nI swear I didn't do what they say I done\n\n[Verse 1]\nGhetto destroyer, paranoia, I need a lawyer\nThis bitch named Netoia, say they lookin for ya\nGot to get the fuck out of here (yeah right)\nThis bitch dimmed the lights (nigga, spend the night)\nBust a quick nut, got the fuck up and got on\nCause this the same street I got shot on\nSo God bless the Impala double-S\nI gotta holla cos I'm smokin on double stress\nTweakin, niggas be leakin, information\nGot the feds seekin, incarceration\nNiggas say my name popped up\nBitch hop up\nNigga close the shop up\nThey tryina stop up my cashflow\nLeave me asshole naked (fuck!)\nGone in sixty seconds, burn all records\nNigga gettin skinny eating Denny's\nCount my pennies, only got a bag full of twenties\n\n[Chorus]\nListen, these Feds fishin for this extradition\nI'm on a mission, fuck 'em, fight 'em, dodge 'em, ditch 'em\nI gotta kick rocks, I can't pick locks\nOr spend the rest of my life in a shit-box\n\n[Verse 2]\nIt's so hard to get a room without a credit card\nIt's so hard not to let 'em know where you are\nTried to get a Rent-A-Car\nWhitey laughed when I showed him cash\nHad to mash 'fore he called the Feds on my ass\nWent to Vegas for the weekend\nMet a ho down for freakin\nHey bitch, why you sneakin?\nGrabbed the paper out her hand\nAm I the man on the front page? (Fuck!)\nSame height, same age (click-click)\nGrab the gauge, put it down the G-way\nGot my hostage suckin sausage on the freeway\nShe say let's hit a Circle-K\nRan inside and made the niggas obey\nIt's like I hit the Lotto outside Colorado\nRobbed the [?] for his wallet and my votto\nThat's my motto and I gotta warn ya\nBefore I'm through, I'm going back to California\n\n[Chorus]\nKeep my hand on my gun cause they got me on the run\nI swear I didn't do what they say I done\nListen, these Feds fishin for this extradition\nI'm on a mission, fuck 'em, fight 'em, dodge 'em, ditch 'em\nI gotta kick rocks, I can't pick locks\nOr spend the rest of my life in a shit-box\n\n[Verse 3]\nIt's my boys, Utah to Illinois\nSettin decoys, so I can infiltrate\nAll fifty states\nCan't wait till I'm back on my feet\nSwitch and shake this bitch in her sleep\nLow key you feds can't see me\nAll up in D.C. with strike number three\nClownin, made a little stock to get a little cock\nNow I got niggas bangin' in Little Rock\nI'm going back to Cali westbound with my strikes\nDon't give a fuck who's on the marin or the mic\nI should've known when I seen that motherfucker in the lobby\nLooking like he wanna rob me (Fuck!)\nFederal, don't like no black hetero-sexual, intellectual\nTried to turn me into a vegetable\nAn I'm 'a sue all black and blue\nWhen I come to-hand cuff (Fuck y'all!)\nBig grey bus, scandalous (Fuck you too!)\nAnd they can't stand us\nThey get excited and I tried to fight it (mama)\nI'm going back to Cali for sure, extradited\n\n[Chorus]\nKeep my hand on my gun cause they got me on the run\nI swear I didn't do what they say I done\nListen, these Feds fishin for this extradition\nI'm on a mission, fuck 'em, fight 'em, dodge 'em, ditch 'em\nI gotta kick rocks, I can't pick locks\nOr spend the rest of my life in a shit-box\n\n[Outro]\nHey mama, when y'all send pictures you can't send a polaroid\nGot to be the regular pictures\nAn' they got us in here puttin' in computer chips or something\nI don't know. Like they playin with us, it's like a game\nIt ain't nuttin' but a game to them mama\nIt's my life", "image": "https://images.genius.com/9a92bffe36c691d91a9dd7116941cd17.1000x1000x1.jpg", "album": "War & Peace Vol. 1 (The War Disc)", "year": "1998-11-17"}]}