{"songs": [{"year": "2004-06-15", "title": "Organize", "image": "https://images.genius.com/5b24b6cf31321d7d04a5e1c4405d5ccc.400x400x1.jpg", "lyrics": "[Intro]\nYo, yo, this is it right here (this is it)\nIt's a new day (new day)\nA new time, a new era\nPsycho+Logical forever\nUncle Howie forever\nThis is the time to get ourselves together (get it together people)\nOrganize around this shit right here (right here)\nThis is how it go down, yo\n\n[Hook]\nAll my people getting rich let's, organize\nGangs, from bloods to crips let's, organize\nAll folks to the kids let's, organize\nOrganize means freedom, hear what I'm speaking\nTo the truant selling drugs let's, organize\nFrom the students, to the thugs let's organize\nAll my brothers in the clubs let's, organize\nOrganize means freedom, freedom, freedom\n\n[Verse 1]\nFirst install in yourself why you're here on Earth's surface\nFrom the birth to end of hurt, what's your worth and your purpose?\nIs you worth to your work?, what's your goals and aspirations?\nIs you aggressive or passive, or do you hold your patience?\nThis whole nation built on lies, blatantly killing minds\nWar cost billions, poor childrens is traumatised\nWe don't own our lives off the womb compromised, 'cause\nIf I do, that means that I'll be conquered and lost, fuck that\nI'm built for combat, from where we bare arms at\nConfront my enemies with my comrades, beyond that\nStand for something, if not, fall for anything\nOrganize is key and being free can offer many things\nSee? That's why the military so powerful\nBut I'ma get my army together like Colin Powell do\nIdentify causes because it's essential\nStop complaining about what's right and let the fighting continue\n\n[Hook]\n\n[Verse 2]\nThe whole school system sucks, it ain't halfway decent\nDropout rates increasing 'cause the way they be teaching\nThe streets been teaching us lessons for years\nBut we became more concerned, we're just impressing our peers\nI'm testing you here, to see, if you wanna be part\nOf this method to use our streets smart and take over these retards\nWe start first, knowing how the system works\nEducate ourselves and stay out of the prisons and church\nWe work to be mentally and physically strong and healthy\nRealize there's nothing wrong with being wealthy\nNow tell me you don't wanna be rich, come on, dog\nWell, if you wanna be rich then stop being a bitch and wake up\nYou fake fuck, take off your mask and make-up\nThe stakes up, and keep finding new ways to stay up\nFuck my temper, just remember what I told you:\nControl your enemy, don't let your enemy control you!\n\n[Hook]\n\n[Outro]\nPsycho+Logical, Uncle Howie, organize\nNecro, Non Phixion, organize\nAll my peoples in the place let's, organize\nOrganize means freedom, hear what I'm speaking", "album": "Sabacolypse: A Change Gon’ Come"}], "artist": "Sabac"}