{"songs": [{"title": "Brooklyn Poppin’", "lyrics": "[Intro]\nAin't nothin' like that good ole' liquor, nigga\nAhhhh, haha\nYo, Pvnch what up, man?\n\n[Hook 1]\nIf you ain't got no haters, you ain't poppin'\nIf you ain't got no paper, you ain't poppin\nI got that now, I got that later, what you coppin?\nI got that loud, I got that stink, I got that rotten\n\n[Verse 1]\nI finesse, I collect, I deposit\nThats probably why your bitch is in my comments\nI say, \"Come and get this dick,\" she say, \"Where? Nigga, stop it\"\nI said, \"I got that eight-inch in the closet!\"\nYeah, they hatin', but they watchin'\nFuck being in my bag, I'm in my wallet\nMad hoes, mad hoes I admit I be thottin'\nI get pussy from my looks, you get pussy from you pockets\nI don't care if she foreign, I don't care if she exotic\nI like women from the hood, that'll pop it if they cock it\nWhen we driven and we hear that \"Woop woop!\" yeah, them sirens\nShe don't run, she be the one to take the work and she hide it\nAnd now they looking looking they won't find it\nAnd now her pussy smell like that exotic\nY'all can have that foreign from the island\nAin't nothing like a down bitch from the projects\n\n[Hook 2]\nIf you ain't Red Lyfe, you ain't poppin'\nAnd if the head ain't right, she ain't ridin'\nYou ain't heard Young M.A., the trendin' topic\nWe fuckin' up some commas, you just common\n\n[Verse 2]\nLike a skateboard on the rail, we just grindin'\nTo be honest, I just do it, I don't promise\nIgnore the haters they just want to get acknowledged\nMy account, match the numbers on my mileage\nIf they ain't talkin' what we talkin' we ain't signin'\nNope, nope, no John Hancockin'\nOn my way to the top, slowly comin'\nHad to kick down the door, they ain't hear when i was knockin'\nNow im wildin'\nOn any track I get on, I demolish\nCuz, rap is all I know, I said fuck goin' to college\nI already got the knowledge\nOn what I'm trynna accomplish\nNobody's in my alignment\nYoung M.A., Brooklyn's Finest\n\n[Hook 3]\nYou wearin' foreigns with no car, you ain't poppin\nIf you don't know who we are, you ain't poppin'\nYou poppin' other niggas bottles, you ain't poppin\nShawty you ain't trynna swallow you ain't poppin'\n\n[Outro]\nIf you ain't reppin' Brooklyn, you ain't poppin'\nIf you ain't reppin' Brooklyn, you ain't poppin'\nIf you ain't reppin' Brooklyn, you ain't poppin' nigga\nIf you ain't reppin' Brooklyn, you ain't poppin' nigga\nShout out to Pvnch, you reppin' Brooklyn cuz you poppin nigga\nCuz we only reppin' Brooklyn, cuz we poppin' nigga (Huh?)\nBrooklyn we poppin' nigga\nIt's BK, and we poppin' nigga\nWe reppin Brooklyn, cuz we poppin' nigga (Huh?)\nWe reppin Brooklyn, cuz we poppin nigga\nIt's Brooklyn", "album": "Sleep Walkin", "year": "2015-09-24", "image": "https://images.rapgenius.com/a41f59d75c4cf23094b7978a98a327de.300x300x1.jpg"}], "artist": "Young M.A"}