{"songs": [{"title": "Workin", "lyrics": "(feat. Good Charlotte)\n\nI've been workin' been workin' been workin ' been workin' been workin' my\nWhole life long, that's why I'm ready to sing it, and sang it, I'm doin, I'm\nDoin it in these songs, I'm workin\n\nListen, now can you picture a boy with dreams bigger?\nSeen it made it from wishin' I came from section 8 livin they livings\nCooking dope up in kitchens, always I had a mission the kids in this\nMusic business, listen this how I did this let's get it, They don't know\nWhat I'm doin I get it I'm movin been workin' my whole life long (I'm\nWorkin). And when I get it, I'm goin, I keep It, I move it, I write it in all\nThese songs, (I'm just workin). I'm gon be remembered why, (why) cause\nHustle mode is my life. Haters can't stop my shine, I was destined to\nWrite these lines (yea). From crimes to spittin' rhymes, neva a 9 to 5. I'm\nA dreamer with so much drive, to chances I could've died\n\n[Together:]\nAnd the truth is, I've been struggling my whole life. Do you\nWanna know the truth is? I've been hustling over time. Will they ever\nKnow the truth is? See I told you this is my rhyme! They don't wanna know the truth is\n(Yung- Drizzle) the truth is, I'm workin\nI've been workin, been workin, been workin, been workin, been workin my\nWhole life long tthat's why I'm ready to sing it, and sang it, I'm doin, I'm\nDoin it in these songs. (I'm workin). See this is my only mission, so now\nWhen they ever mention, they braggin' tell'em I did it (The Truth) came\nFrom nothing my spirit, struggled to make a living, troubled my heart is\nFearless in my term of endearment it's fearless right when you hear it\nThey don't get it (naaw) when you've got it (nope) when you know it (yea)\nThey can't stop it (one hundred) cause when you goin(yes) you finally get\nIt(yes) they gonna hate it but they neva gon forget it\nMy story is never ending, forgive me for all my sinning like back in the\nBeginning, when me and Datho was banging, can't tell me my saga's\nFinished, I'm doin it for my,.. my ryder's no longer with us, rest in peace\nNow watch me get it\n\n[Together:]\nAnd the truth is, I've been struggling my whole life. Do you\nWanna know the truth is? I've been hustling over time. Will they ever\nKnow the truth is? Joe I told you this is our time. They don't wanna kno\nThe truth is, (Yung-Drizzle) the truth is, I'm Workin\nI've been workin' been workin' been workin ' been workin' been workin' my\nWhole life long, that's why I'm ready to sing it, and sang it, I'm doin, I'm\nDoin it in these songs, I'm workin. (I'm Workin)", "album": null, "year": null, "image": "https://assets.genius.com/images/default_cover_image.png?1570807223"}], "artist": "Young Dre The Truth"}