{"artist": "R.A. The Rugged Man", "songs": [{"album": "Night of the Bloody Apes ", "year": "1994-11-05", "lyrics": "[Hook: R.A. The Rugged Man]\nBloodshed huuaa hoooo, huuaa!\nBloodshed huuaa hoooo, huuaa!\nBloodshed huuaa hoooo, huuaa!\nBloodshed huuaa hoooo, huuaa!\nBloodshed huuaa hoooo, huuaa!\nBloodshed huuaa hoooo, huuaa!\nBloodshed huuaa hoooo, huuaa!\nBloodshed huuaa huuaa huuaa!\n\n[Verse 1: R.A. The Rugged Man]\nCheck this, I wreck shit, I rip shit, no\nBring that shit back, rewind it (ihateeverybodyihateverybodyihateeverybody..)\nYou can't kick it what I'm talking bout\nBLAOW! Shout it out, now ya faggot ass is walking out\n1 to the head from the white bred and ya dead bled\nDripping bleak blood red, from the bloodshed\nBless them bitches with my big testes, I molest them\nShitty rappers I dissect 'em, swallow 'em and then digest 'em\nIiii don't give a motherfuck about you\nThe whack rap, I can't live without you\nI don't need it if I meet a stank pussy\nI meet greet it, I might eat it, I ain't never been defeated\nNooobooodyyy knooows\nThat I got the ill flows, shit blows when my dick grows\nI'm doin' tours, I'm down with whores not jabber jaws\n(I got a man) Oh yeah, word, shut the fuck up and drop ya drawers!\nBloodshed huuaa, say goodbye to ooo-eh\nOoo eh, straight ooo eh, ooo, ooo eh\n\n[Hook]\n\n[Verse 2: R.A. The Rugged Man]\nBeastie neck fool down in Carolina\nI won't be going downtown unless there's gold in her vagina\nThey have opinions, the southern counties\nAct like (?) I take out three of them, I hate to be 'em\nWith the hua-haa, bloodshed huuaa\nWit da new-eh, style for ya crew-eh\nAnd I could just make it get to ya baby, blauuhh\n(Yo, kick that real shit!) Now what was it?\nGot disgusted, now bust it, ya microphone is rusted\nI buh-buh-buh-ba-bum rushed it\nIt's ALRIGHT, I'll make ya feel it\nHopsy topsy, I'm lethal like a Nazi, you can't stop me\nWho da fuck ya think ya are?\nBlah blah blah (R.A. The Rugged) a superstar!\nI don't need no-nonsense, the constantly be jumping\nFrom my John-son (YES!) I'll be there where ya at punk\nYa better watch ya back 'cos I never fight fair\nSo bring some hookers and I might have some do rahh\nBloodshed huuaa!\n\n[Hook]\n\n[Verse 3: R.A. The Rugged Man]\nHow's about that just think bout that\nI wouldn't doubt that we be the Crustified Dibbs\nWhat they say to them, don't say to me\nI heard that booty demo tape you played to me\nThat's why faggots are afraid of me\nDaps is down with The Trackmasters\nThe ill bastards down to make ya Ghetto Blaster disasters\nI be the Rugged-is-is-is dismiss this\nPut on ya lipsticks and kiss this, ya lips are brown\nTo which the hookers fuck 'em (?) I'm like wood I'm high strung\nDon't fuck fuck the roll lettered tongue, 'cos I be the one\nOhh-ehh, I'm so super troop-eh\nI'm a trooper, keep rising to the top\nI never stop, I get paid to talk more shit like a Southern County cop\nI'm jamming bikes up the asses of dykes\nFuck women's rights, I got more pussy on me than Hermorpha-dites\nBut check the Blood, uh, shed, hua-hoooo\nOoh eh, check the Blood, ooo ooo, huuaa!\n\n[Hook]\n\n[Outro: R.A. The Rugged Man]\nHuuaa, huuaa, hoooo, bloodshed!", "title": "Bloodshed Hua Hoo", "image": "https://images.genius.com/84b0f16d4833b6bc6135c44a1037e32b.600x599x1.jpg"}]}