{"artist": "Prince Paul", "songs": [{"album": "The Redux", "title": "Uff It", "image": "https://images.genius.com/e58569cd90b518f059533fae5240c13e.1000x1000x1.jpg", "lyrics": "[Intro]\nHark! Who goes yonder?\nIt is I! Prince Paul of Nottingham\nWell, Speak up man what is it?\n\nAlright listen, Imma tell you my story\n\n[Verse 1: Rhyme-Valore]\nRhyme-Valore 500 pound gorilla, King Kong\nWhen I sing songs, heads play ping-pong\nI fill her, body up with plenty of ding dong\nShe loves me hugs me, because we rich\nI ain't fuckin' witcha man cause your man's a snitch\nHe ran and bitched, I run the streets\nCome with heat when you flossin'\nNiggas be pricin', whatchu costin'?\nWe beat niggas up often, I ain't braggin'\nViolent times, violent rhymes\nSmart niggas come with silent nines\nYou couldn't miss, oh my goodness\nHow, could this\nOne man break the back of a whole rap pack\nThen hit the streets strapped, armed for combat\nNiggas get back slapped, I bet that hurt\nBitches get the blackjack right up under that skirt\nThey call him [Valour?], all aces\nThe first time out, I got four Questlove faces\n\n[Hook: Super Star]\nFuck it, that's how I'm feelin' today\nFuck it, you best to be on your way\nFuck it, I ain't in the mood to play\nMotherfucker, somebody gots to pay\n\n[Verse 2: Super Star]\nComing through with the crew, I gots to [heat?] clock figures\nAnd if I must feed my seeds, I'll bust both triggers\nTwentyfo' [?], only sixteen shots\nStill wouldn't have a clue, now who [?]\nI return to the scene, of the crime you know the sayin'\nLike the [holocaust?] I paid the cost, on my knees prayin'\nLive, I let live I die, let die\nWhy ask why, whats the reason\nWho the fuck am I?\n\n[Jean Grae]\nJean, who the fuck else control the mic like this?\nThe album twenty dollars, cost of my vocals? priceless\nHit your ribcage and flip and split your [dates?] wig\nWhen I spit from the corner of [?] stage\nSwitch it like hips on [fish?], I'm sick nigga\nFlick y'all off like ashes on cigarettes\nSlicker than water that's filled with axeon\n[rip ya neck?] on, any fuckin' track I rep on\n\n[Hook: Super Star]\nFuck it, that's how I'm feelin' today\nFuck it, you best to be on your way\nFuck it, I ain't in the mood to play\nMoth-\n\n\"There's no one that can match me. My style is﻿ impetuous, my defense is impregnable, and I'm just ferocious. I want your heart. I want to eat his children. Praise be to Allah.\"\n\n[Outro: Prince Paul]\nYo, yo check it out. This one goes out to my long island crew. My man Bumpy Knuckles, R.A the Rugged Man, Horror City, De La Soul and DJ P.Paul [?]. Yeu-ah!\n\n(It happened years ago, life closed in on her too much. She was mentally ill. Then slowly the lights came on again, she recovered. All that is behind her, or is it?)", "year": null}]}