{"songs": [{"image": "https://images.genius.com/def92196a0e23158a8cd127e3dde6217.470x470x1.jpg", "album": "The Hybrid ", "title": "Greatest Rapper Ever", "lyrics": "[Verse 1]\nMy homie's a magician with the Tec\nMake your chain disappear and reappear on his neck\nI ain't tricking with you hoes, but shit don't ask him\nOnly thing I give a bitch? A fucking orgasm\nI'll throw you in the river, hands tied tight\nWatch your ass drown, feel it in the air tonight\nI'm spitting that dope shit, smoking on regulars\nWriting 16's like internet child predators\nRocking that 10 Deep, but I stay dolo\nYou wearing polo, who are you, Young Dro?\nI'm fifth floor at the Bellagio\nVegas bitches that's resembling Rosario\nDawson, awesome, hit the head, Mario\nSorry yo, my tongue long, she squirted off the sheets\nShe gave me that Becky, I gave her that yoshi\nThe only time you niggas touch keys is Motif\n\n[Verse 2]\nGo and sell a beat, you never sold a rock\nStill be sitting on the couch if I was signed to Koch\nCoulda signed to the Roc, nah, I'm signed to the streets\nThe D is the only thing that's profiting for me\nFeeling like Big Meech, when we're 'bout to cook up\nBut not the one from B.M.F. dog, the one from Lynwood\nIt ain't a nigga I know\nThree years straight, three dollar blows\nGood any hood, anywhere I go I'm straight\nNigga hit me with a hundred cause the look on my face\nMomma, I'm honored to be your son\nCould snatch a stack of stamps out and not rip a single one\n\n[Verse 3]\nUsed to be in a rush, to finish off my sack\nI was so thirsty dog, sold a pregnant bitch crack\nLet her pay me extra, smoke it in the back, then she came back\nTitties out smacking herself on the back, talking 'bout\nSomething crawling on her, looking like the world's falling on her\nAnd I pushed it, you rub the foots of the bitches I mushed\nFunky ass cutlass three deep, blowing kush, North got her shook\nStarted reading when the judge threw the fucking book\nBut the block was off the hook, said \"Fuck class!\"\nOff them same pills that had Carlton dancing fast\nYoung buck, look, now a grown up\nNow I pop them same pills, listening to Donuts\nI rap like I bet my life\nCause in all actuality, nigga I did\nYou rap like you used to hit the pipe\nNah nigga that ain't crack, that's crackhead shit\nRep that shit, will tell a bitch\nYou wouldn't break a brick, you ain't seeing this dick\nYou trick on the bitch, dog you ain't rich\nTake a bitch to the movies, take her to the crib\n\n[Outro]\nYou seeing Brown? Nope, never\n'bout to live the title of the greatest rapper ever\nIt don't get no better, it don't get no better", "year": "2010-03-16"}], "artist": "Danny Brown"}