{"songs": [{"lyrics": "[Intro]\nGeyeah, NYMP the realest, uhh\nThis is educated thug MU-SIC, niggas\n\n[Verse 1]\nLife's a battle, mean streets eat you alive\nBlocks'll have you, tryin' to maintain your course\nThrough the potholes and gravel\nHot holes and what-have-you, tryin' to clock dough\nFoes tryin' to pop shots through you by code\nPigs tryin' to grab you and lock up your soul\nThrough the Hot Apple, nighttime shots crackle\n(Bucka bucka bucka) fiends tryin' to gaffle you\nNot only coke heads but the Feds in the Mercury Topaz\nAfter you, up the avenue\nTryin' to give you big numbers, you got math to do\nTryin' to make you miss summer, shit, that ain't cool\nI caught smaller cases tryin' to get capital\nUp against the wall, tryin' to pass through\nGhost-like, hear the cries from the tortured souls\nMost nights, I hold my toast tight, and it goes like\n\n[Chorus]\nUhh, N.Y.M.P., the realest niggas\nN.Y.M.P., the realest niggas\nUhh, uh-huh-uh-UHH, N.Y.M.P. the realest\nMarcy.. Brooklyn..\n\n[Verse 2]\nYo, I come through, gettin' money, sittin' on twenties\nNiggas throwin' me shade, but ain't shit sunny\nHot shells only thing niggas could get from me\nCocktails thrown in your livin' room, KA-BOOM!\nI'm so confrontational\nThey shoulda never let me go on probation yo\nI'm a hustler, except that..\nNo correctional facilities can correct that\nI took a step back, I viewed myself, seen where my head was at\nIt's where that dough is homie, gotta get that\nGotta get away, some try but head back\nUhh, street smart niggas got left back\nSome died, they left stacks\nMe, I ball right, and on top of that I'm dog nice\nJigga been cold as fuck before ice\nNot before Christ, but a long fuckin' time\nGet your mind right niggas\n\n[Chorus]\nN.Y.M.P., the realest\nUh-huh-uh-UHH, N.Y.M.P., the realest niggas\nUhh uh-huh, uh-UHH, N.Y.M.P. the realest niggas\nMarcy.. feel me..\n\n[Verse 3]\nI looked death in the face years back\nI held tears back, I gathered myself and stared back\nI'm from where you don't crack, the weak don't live\nYou gotta bounce back homie, the streets don't give\nI take and rape villages, who gon' stop him?\nNot Rudy Giuliani, not Hillary Rodham\nStill I still pop him\nShit, I grassy knoll and hilltop him, it's all political now\nI think big when I spit at you now\nBetween my dog and the figures, the four gonna get'cha\nBetween life and death, they killed my spirit\nSo what little life I got left, y'all can expect me to ball\nI empowered myself, teacher said I was a lost cause\n'Cause I used to roam them halls\nStill I spit knowledge, dropped out of high school, skipped college\nWho woulda thought I'd make it \"Big\" like Ms. Wallace?\n\n[Chorus]\nUhh, yeah, N.Y.M.P., the realest niggas\nBrooklyn, what? Uhh, N.Y.M.P., the realest niggas\nUhh, uh-huh-uh-UHH, N.Y.M.P. the realest niggas\nMarcy.. New York, Brooklyn, N.Y.M.P. the realest, feel me\n\n[Outro]\nEducated, thug mu-sic niggas\nThis is Brooklyn, this is gangsta, this is project\nReal shit, N.Y.M.P. the realest niggas\nMarcy, Brooklyn, stompin' grounds\nFuck with me", "title": "NYMP", "image": "https://images.genius.com/16c23bf8d7a8a73a71d30d2ec47600b1.1000x1000x1.jpg", "year": "1999-12-28", "album": "Vol. 3… Life and Times of S. Carter"}], "artist": "JAY-Z"}