{"artist": "Pink Guy", "songs": [{"album": "PINK GUY", "title": "Kill Yourself (Album Version) (Original Version)", "image": "https://images.genius.com/930f3f0dd5bb07a703c94897874ec1db.900x900x1.jpg", "lyrics": "[Intro]\nSHUT (God damn!)\nTHE. FUCK. UP\nSHUT (Yeah, yeah!)\nTHE. FUCK. UP\n\n[Verse]\nPoo poo, pee pee, penis and vagina\nWomen with dicks and weak men with vaginas\nSo fucking delicate like mommy’s fine china\nIf you have complaints, please, wait your turn and line up\nI got a message for these little fags tryna\nBe a momma's boy and a teacher's pet, pimple face, asswipe\nLooking like they just had a gyne-cologist\nStick five fingers in your ass, no lube\nSo whatcha gonna do?\nIf you’re number one, shove it up your ass and make it number two (ooh)\nLadies getting mad in the comments, and I'm hearing it\nYou think it was a typo with these red lines and periods\n(oooh)\nHa-ha, no comma\nBitches with their self esteem get out of the sauna\nMy shit lies in the sewers, closing the hatch\nI only joke about diseases and reference that only you can catch\n(''Ew, oh my god'')\nAnd if you think you're fucking grown up\nKeep breathing heavy with your keyboard and fedora\nHands around your dick with the kung-fu grip\nStroking back and forth to My Little Pony clips, bitch\nGo outside and ride a bike or something\nAnd get laughed at by kids to remind you that you are nothing\nAnd then, get hit by every car or truck that ever passes\n\"Your life flashes before your eyes!\"\nOh wait, it's your Google Glasses\nNevermind, faggot\nJust pick your ass up and take you to the closest sign, faggot\nI'm not done yet, you get up and you go home\nSit at your computer and open up Google Chrome\nAnd then look at tutorials on how to hang yourself at home\nAnd then you can hang yourself\n(''Is that the end of the story?'')\nHa-ha-ha-ha-ha, no son\n\n[Hook]\nKill yourself\nPlease, please kill yourself\nYou should really kill yourselves\nPlease, please kill yourself\nYou should really kill yourselves\n\n[Outro]\n(I got a little bit of that anal cream for your asshole)", "year": "2014-05-23"}]}