{"artist": "Immortal Technique", "songs": [{"title": "Bin Laden", "lyrics": "[Intro: Mos Def]\nMan, you hear this bullshit they be talking\nEvery day, man\nIt's like these motherfuckers is just like professional liars\nYou know what I'm sayin'? It's wild, listen\n\n[Hook: Mos Def + Jadakiss]\nBin Laden didn't blow up the projects\nIt was you, nigga\nTell the truth, nigga!\nBush knocked down the towers\nTell the truth, nigga!\nBush knocked down the towers\nTell the truth, nigga!\n\n[Verse 1: Immortal Technique]\nI pledge no allegiance, nigga, fuck the President's speeches!\nI'm baptized by America and covered in leeches\nThe dirty water that bleaches your soul and your facial features\nDrownin' you in propaganda that they spit through the speakers\nAnd if you speak about the evil that the government does\nThe Patriot Act will track you to the type of your blood\nThey try to frame you and say you was tryna sell drugs\nAnd throw a federal indictment on niggas to show you love\nThis shit is run by fake Christians, fake politicians\nLook at they mansions, and look at the conditions you live in\nAll they talk about is terrorism on television\nThey tell you to listen, but they don't really tell you they mission\nThey funded al-Qaeda, and now they blame the Muslim religion\nEven though Bin Laden was a CIA tactician\nThey gave him billions of dollars and they funded his purpose\nFahrenheit 9/11? That's just scratchin' the surface!\n\n[Hook: Mos Def + Jadakiss]\nBin Laden didn't blow up the projects\nIt was you, nigga\nTell the truth, nigga!\nBush knocked down the towers\nTell the truth, nigga!\nBush knocked down the towers\nTell the truth, nigga!\n\n[Verse 2: Immortal Technique]\nThey say the rebels in Iraq still fight for Saddam\nBut that's bullshit, I'll show you why it's totally wrong\n‘Cause if another country invaded the hood tonight\nIt'd be warfare through Harlem and Washington Heights\nI wouldn't be fightin' for Bush or White America's dream\nI'd be fightin' for my people's survival and self-esteem\nI wouldn't fight for racist churches from the South, my nigga\nI'd be fightin' to keep the occupation out, my nigga\nYou ever clock someone who talk shit or look at you wrong?\nImagine if they shot at you and was rapin' your moms\nAnd of course Saddam Hussein had chemical weapons\nWe sold him that shit after Ronald Reagan's election\nMercenary contractors fightin' a new era\nCorporate military bankin' off the war on terror\nThey controllin' the ghetto with the fear of attack\nTryin' to distract the fact that they engineerin' the crack\nSo I'm strapped, like Lee Malvo, holdin' a sniper rifle\nThese bullets will touch your kids, and I don't mean like Michael\nYour body be sent to the morgue, stripped down and recycled\nI fire on house niggas that support you and like you\n‘Cause innocent people get murdered in the struggle daily\nAnd poor people never get shit and struggle daily\nThis ain't no alien conspiracy theory, this shit is real\nWritten on the dollar underneath the Masonic seal\n\n[Interlude: Eminem]\nI don't rap for dead presidents\nI'd rather see the President dead\nIt's never been said, but I set precedents\n\n[Hook: Mos Def + Jadakiss]\nBin Laden didn't blow up the projects\nIt was you, nigga\nTell the truth, nigga!\nBush knocked down the towers\nTell the truth, nigga!\nBush knocked down the towers\nTell the truth, nigga!\n\n[Interlude: Eminem]\nShady Records was eighty seconds away from the Towers\nSome cowards fucked with the wrong building\nThey meant to hit ours", "image": "https://images.genius.com/0b9bc707c6505c2946706a4581326e12.973x1000x1.jpg", "album": null, "year": null}]}