{"artist": "Boogie", "songs": [{"album": "The Reach", "title": "Find Me", "year": "2015-06-24", "lyrics": "[Refrain: Boogie]\nI swear this shit gets so lonely I swear this shit gets so lonely\nYou've been a flower of my heart from the day them feelings rose on me\nThe day them feelings rose on me\nSee you could wrap me up in thorns, you know you still gon' have this hold on me\nIf good women like good water, why I always got these hoes on me?\nLike you was planted in the dark, see I didn't think you was gon' grow on me\n\n[Verse 1: Boogie]\nI wonder why you so guarded, mission a fire finisher ended before we started\nPicture you like a artist, but what I'm drawing to day\nIs a better way to your heart without drama up in the way\n\n[Hook: Boogie]\nLock me out my place and let me fall into your space, oh baby\nI'm hoping you find me\nNo lock for my safe, I let this sit all in your face, oh baby\nI'm hoping you find me\n\n[Refrain: Boogie & D'anna Stewart]\nI swear this shit get so lonely, swear this shit get so lonely\nYou've been a flower of my heart, from the day them feelings rose on me\n'Til them feelings rose on me\nSee you could wrap me up in thorns, you know you still gon' have this hold on me\nStill gon' have this hold on me\nThat's crazy, If good women like good water, why I always got these hoes on me?\nLike you was planted in the dark, see I didn't think you was gon' grow on me\n\n[Verse 2: Boogie]\nSame shit that got my bros on me\nTelling me I'm trippin', uh, telling me I'm slippin'\nI've been on you for a while, we turn these miles into inches\nCommitment, I swear it ain't no fiction when I say\n\n[Hook: Boogie]\nLock me out my place and let me fall into your space, oh baby\nI'm hoping you find me\nNo lock for my safe, I let this sit all in your face, oh baby\nI'm hoping you find me\n\n[Outro: Boogie & D'anna Stewart]\nYou deserve it\nWould I be wrong if I don't tell you, baby?\nWrong if I don't tell you baby\nOh baby, oh find, oh find, find\nLock me in, take me away\nLock me in, take me away", "image": "https://images.genius.com/329e9e692537ac6301adb12b1fef2ab9.300x300x1.jpg"}]}