{"artist": "King T", "songs": [{"image": "https://images.genius.com/4ecadf00855c55fe49bd112852218051.704x704x1.jpg", "title": "We Got Tha Fat Joint", "year": null, "album": "Tha Triflin’ Album", "lyrics": "Wrap\nThen pass that joint\n\n( *in the background* )\nWhere the joint, man?\nSomebody got it\nI ain't got it\n\nCheck it out y'all\nMad Kap's in the house\nNefrettiti's in the house\nAnd she finna kick it like this\nCome on now\nCome on\n\n[ VERSE 1: Nefretiti ]\nSo just call me the spark, held by the flame\nOnce again my beats make white boys reclaim\nA stain on your brain, and yet I'm stayin the same\nBust another rhyme, move into the hard time\nMy lifeline revolves into a circle of zero\nAnd like for real I never liked no superficial hero\nNow this joint is fat, so spark up that fat joint\nAnd yes, you best believe I'm born again to prove my point\nTo say the least, I know you know that hip-hop won't stop\nI smooth will get wreck, then pass me the joint\n\nPass it around\nPass it around\nPass it around (2x)\n\n[ Motif ]\nImprovisation is the key to this freestyle\nHip-hop style, while jazz in the meanwhile\nStride, glide, and all that good stuff\nRide to the rhythm of this jazz, it's rough\nYou're crippled in the brain from a late night feature\nThe government is run by the beast and the creatures\nHanger for the hook-up, for the jab it's junk\nThey're comin in your speaker with the funk-fu-fu-funk\nSome want you to say today I can't fit on one caper\nTake out the seeds and begin to rollin papers\nThen I roll the blunt or a spliff or a fattie\nFeelin like a hood with a beanie in a Caddy\nI love my herb, I love my money, cause I'm young, matty\nNever eat the pork, cause it's much, much too fatty\nSo come down, selector, and give me my props\nI'm runnin through a field of marihuana crops\nI'm thinkin, all the green, fat, crazy, stinky buds\nFlow on the instrumental, cause this rhyme is not a dud\n\n[ Coke ]\nGettin crazy blunted, and you'll never say I fronted\nOn the raps, cause I take the track and run it\nInto the ground, I'm ghetto clown number one\nRhymes are kinda fat like two tons of fun\nSmash, boom, bam! and I never sound flam\nIt's that nigga King Tee with the Mad Kap band\nGettin stupid high off the chocolate ghetto thai\nSo pass the dutchie on the left-hand side\nKing Tee and Nef, and the rhymes are on point\nBut now it's time for Coke to pass the fuckin joint\n\nPass it around\nPass it around\nPass it around (5x)\n\n[ King Tee ]\nNow here comes the bomb...\nPass it around, throw some flex in\nPeek-a-boo! I mean - ooh! I be fresh when\nI do that, but wait - who dat? It's the King\nMad Kap, Nefrettiti's the queen\nWith the sound of Africa to the streets\nSomethin the Man can't cheat\nAnd make it pop, cause we're already poppin\nSo I'm whistlin, sittin on the dock by\nThe bay, singin 'ay-hey,' can you copy?\nBoomin like a jeep, deep with my posse\nWhat's up, sister? yeah, it's Mister\nK-i-n-g Tee, I brung a mixture\nOf ruff rhymes, I drove by to shoot the pop rap\nCause you know you gotta stop that\nBullshit, but when my pull hits, it's on point\nAnd I got the fat joint\n\nPass it around\nPass it around\nPass it around (4x)"}]}