{"artist": "Iggy Azalea", "songs": [{"title": "100", "lyrics": "[Intro: Watch The Duck]\nYou ain't the type of lady that's known to fuck around\nKeep your mind on your money, and you ain't looking to settle down\nGirl, you keep it 100, 100, 100 when you're 'round me, yeah\nThat's why I keep it 100, 100, 100 when you're round me, girl\nWhen you come around me, when you come around me\nYeah, girl, you keep it 100, 100, 100, when you're 'round me\nGirl, when you come around me\n\n[Verse 1: Iggy Azalea]\nImma keep it 100, I'm a boss chick, but he run it\nNo Michael Kors just Tom Ford\nSaint Tropez, I'm like bonjour\nIn Spain wearing that Balmain, Lanvin, Givenchy\nOn the top floor of that penthouse, I got ten toes on that concrete\nKeep it G with the money, I ain't gotta lie about shit\nI don't need the money, I can buy my shit\nHeard in the streets that he fucked that bitch\nHe know I'mma put his ass out my shit\nPaid one million for that drop six\nAnd he got the Glock in my cockpit\nThem other chicks he get caught with\nI'm the bitch he gonna rock with\nThey talk shit, but we bought shit, fly Aussie on boss shit\nWhen he need to be, where he need to be\nI tell him \"go on, it ain't no thing to me\"\nGotta hit that thing, bring that back witcha\nLet me thumb through the check if you wanna get sexy\nYou knew I was high class ass when you met me\nMy money tall, it's too bad for y'all\nY'all dough as short as Joe Pesci\nI'm a fancy bitch but I'm ratchet\nNot like the bitch you had, ain't never had shit\nRespect that, how I come around, no run around\nYou better humble down\nThem games, ain't gonna play none\nKeep it A1 since day one, yeah\n\n[Hook: Watch The Duck]\nYou ain't the type of lady that's known to fuck around\nKeep your mind on your money and you ain't looking to settle down\nGirl, you keep it 100, 100, 100 when you're 'round me\nYeah, girl you keep it 100, 100, 100 when you're 'round me\nGirl, when you come around me\n\n[Verse 2: Iggy Azalea]\nBankrolls'r'us, we got it, you know how we ride\nNo credit, no debit, no thanks\nMy clique pay cash everything we buy\nSee me walking by with my nose in the sky\nMake you be like, \"Damn bitch, can't say hi?\"\nThen I hop in the drop and wave goodbye\nAs I drive through the tunnel looking like Lady Di\nWhy stress myself when he not there?\nLet's see how he likes seeing me out there\nYou know how many dudes want me out there?\nJust stop thinking about it, you got no idea\nDon't try me man, you know I will\nThrow this brick through your wind shield\nKnife your nice new Rover Wheel\nThat fireplace? Your clothes in there\nIf I know you two in there, no asking what you doing there\nImma send my crew in there, you two gonna be ruined there\nYou violate, I demonstrate, especially if I'm true to you\nAnd when I come around, I keep it 100 as usual\n\n[Hook: Watch The Duck]\nYou ain't the type of lady that's known to fuck around\nKeep your mind on your money and you ain't looking to settle down\nGirl, you keep it 100, 100, 100 when you're 'round me\nYeah, girl you keep it 100, 100, 100 when you're 'round me\nGirl, when you come around me\n\n[Outro: Watch The Duck & (Iggy Azalea)]\n100, 100 as usual, 100 as usual\n(When I come around I keep it 100 as usual)\n100, 100 as usual, 100 as usual\n(When I come around I keep it 100 as usual)", "image": "https://images.genius.com/93009056cf66da79cb648084235c3540.1000x1000x1.jpg", "album": "The New Classic", "year": "2014-04-21"}]}