{"artist": "Fashawn", "songs": [{"year": "2012-04-03", "album": "Higher Learning 2", "image": "https://images.genius.com/e483145f15089213e79bccc6be96eef8.500x500x1.jpg", "lyrics": "Witness Fashawn, invented in a minute or more\nLike a chemist; guess who just kicked in the door\nWith a fifth of Jim Beam in his veins, G on his chain\nMe and the Gang, pitching them game\nLike Chris Carpenter, roll with a thick squadron\nWhat I oughta give you artists is a trip to a mausoleum\nShowstopping you gotta see him\nNext time probably riding something European\nWhere the fuck's my passport? I need to get out of here\nHigh enough to kick the stratosphere\nRoll the carpet out, your majesty's here\nI'm velour, y'all cashmere\nThe champ's back and you can't cheer?\nBesides Christ ain't a spirit that this man fears\nIf I ain't the best, I'm damn near\nTell me how you plan to hang with a chandelier\nYour whole camp queer: gang of Pam Griers\nTo all hustlers: I'm fronting work\nNever wanted to wear cleats, just wanted to run the turf\nBeef twice, I be burying niggas\nHe's nice but don't compare him to Jigga\nLet's get one thing...crystal clear\nI'm a magician dear, cause I made all of my peers disappear\nY'all ain't rappers, y'all actors: Richard Gere\nAnd the fact is you cats should switch careers\nTwo things real: my niggas, my bitch' hair\nI'm on my tenth tape, sixth year\nUmm...maybe a little longer, it made me into a monster\nPatient, everyday I was getting stronger, wait up\nI had to get my weight up and be an entrepreneur, straight up\nWas told, \"Follow the light, you'll shine bright, just give it time\"\nI write, keep in mind that it's a grind. Watch homie\nSome can't endure the climb so the top's lonely\nStill, it feels like I'm barely getting started\nPossessed by the dearly departed rap martyrs\nMiddle name Mustafa, some think I'm a prophet\nMost say I'm a problem impossible to fix\nCommit a massacre like Al Capone\nWith a flow and a style unknown; a Golden Child is grown\nIn a zone on a cloud of my own\nThis time around with my crown, my robe\nI flew thousands and thousands of miles from home\nSo ciao to my pals in Rome\nI hug the lane I'm an Aston, bang like a Maverick\nWith the aim of a trained assassin and so it remains\nYou lames is as-if, past tense and named a has-been\nFuck what you heard, here's what y'all forgot\nGotta stop pretending you are what you not\nWhen this product hit the block every jaw finna drop\nBitches hopping out they drawers and they tops\nLike they clothes on fire, just to roll with the sire\nA level much higher, bout to soak the sky up\nHa! He's just boo\nMafioso, I'm giving niggas cement shoes\nLet 'em sleep with the piranhas\nI'm leaving rappers resting in peace in their pajamas\nStop snoozing, I'm comfy in my spot and I'm not moving\nYou'd have to send a shot through him\nGod forbid that ever happen\nReady for whatever action\nIn case I gotta spin your melon backwards\nThe technique is elephant rap\nType of shit leave your skeleton cracked\nLike I hit you with the heaviest axe\nI be leaving footsteps on the track\nNow I'm embedded as a legend in fact\nI'm a double barrel shotty, a Pacquiao blow to the body\nAnd that'll make you niggas convert: Ali\n...Punk!", "title": "Manny Pacquiao"}]}