{"songs": [{"image": "https://images.genius.com/b568e8d559c7ba98ef485809d81c1d79.1000x1000x1.jpg", "title": "Braveheart Party", "album": "Stillmatic", "year": "2001-12-18", "lyrics": "[Intro] (Nas)\nYeah... ay yo Jungle... ay yo Wiz...\nCome on man... Let's do this\nIt's a Braveheart party y'all\nC'mon\n\n[Hook] (Mary)\nThrow your hands up cuz we wanna dance\nDon't be afraid just take a chance\nCuz this beat will rock your body\nGet up on the floor and party\nNow y'all tell me what y'all wanna do\nThinkin' while I have a drink or two\nThrow your hands up everybody\nGet up on the floor and party\n\n[Verse 1] (Nas)\nI move at night, respect my gangsta\nReady for whatever you bring, the mood is right\nThe club is righteous, tight with family\nSqueezin on big old bubbles with no panties\nLadies who's sexually free\nAnd once in a while live on the wild side, kinky & nasty\nMiddle fingers up and say \"Fuck the world\"\nThrow your hands up, they can't fuck with you girl\nAnd my fellas, two time felons, two nine tote and lethal\nQuick to leave you wide open, if you gettin' tore down\nBlowin' a blunt cloud, and the DJ's makin' you feel thugged out\nPut yo hands up\n\nRepeat Chorus\n\n[Verse 2] (Jungle)\nI pull in a V12 drop all red\nLook at ma with that cat paw tat on'er leg\nCome here girl can I kiss you, let me lick you\nShow you what your body made for, you're official\nYou could be my baby mama lookin like that\nWhat you drink, champagne or Cognac\nWhat you like dancin diamonds, Dolce Gabbana\nFendi, Louis Vuitton, Gucci and Prada\nA nigga like Jungle to always come thru\nShine in yo hood whenever the fuck you want to\nCause I'mma B.R.A.V., E.H.E.A.R.T. from QB\nPut'em up...\n\nRepeat Chorus\n\nParty all night (Party all night)\nLet's drink, no fights (Let's drink, no fights)\nParty all night (Whachu wan' do?)\nLet's drink, no fights (Drink up...c'mon, yeah, yeah...)\n\n[Verse 3] (Wiz)\nI'm blaze, haze for days\nBlackout thinkin' of ways to get paid\nMac out corner I got it's all laid\nShorty, with a nice round ass in my face\nNow do she want me to touch her?\nOr do she want me to see?\nFuck is she comin wit me\nA true BHG Wiz, not complex\nChin checks if it get hectic\nNigga Braveheart respected\nGet bent at the bar, talk shit, walk it\nAnd if I can't talk it, the false big cop a case\nI'm here to blaze, roll up a dutch and take it to the face\nThrow yo hands up\n\nRepeat Chorus 2X"}], "artist": "Nas"}