{"artist": "Ice Cube", "songs": [{"title": "Hood Robbin’", "lyrics": "[Intro]\nMan, I ain't gon' be shit in the morning\nAfter drinking that, uh\n\n[Interlude]\nIf I can sell you the American Dream, I can sell you anything\n\n[Verse 1]\nI got to get out, I'm getting put out of my house\nI got to pack up my refrigerator and couch\nIt's a set-up, but the bank wants me out\nOr the L.A.P.D. will smoke me out\nThis adjustable rate, it choked me out\nThey gave me a loan, and I had no clout\nThey gave me a house, for me and my spouse\nCalled my momma and my aunt\nY'all should re-finance\nI let 'em dance with the devil\nDig their own grave and I gave them the shovel\nFuck, my daddy built that house\nAnd when he got drunk, he almost killed that house\nIs this the American Dream, or the American Scheme?\nThat got me walking in these American streets?\nIt's kinda sad when you have to get a hernia\nCuz you help your grand mama move her furniture\n\n[Interlude]\nIf I can sell you the American Dream, I can sell you anything\n\n[Verse 2]\nLook at this maggot, with a stimulus package\nI can give a fuck about a Dow Jones average\nWhat the fuck you do when your paycheck is average?\nLaw abiding citizen turn into a savage\nGot to feed children, got to feed the habit\nFell into a rabbit hole, chasing that rabbit\nNow I'm in Wonderland feeling like the Son of Sam\nI'm at your West Coast branch, gun in hand\nI'mma feel like Superman\nWalk by the teller, better call the trooper, mam\nIt's the revenge of the lambs\nBig Bad Wolf, we're sick of these scams\nSick of these plans, sick of this dance\nWalked into his office took the nine out my pants\nYou're not a man, you're a serpent\nThen I prayed to God let the nine get to workin'\n\n[Hook]\nI better get to workin'\nYou know I heard they hood robbin'\nYour money or your life and there ain't no stopping\nI better get to workin'\nYou know I heard they hood robbin'\nYour money or your life and there ain't no stopping\n\n[Bridge]\nAin't that a bitch\nWhen you got to steal from the poor, and give to the rich\nAin't that a bitch\nWhen you got to steal from the poor, and give to the rich\n\n[Verse 3]\nUh, drug dealer MD\nDoctor feel good, give you what you need\nIn California, prescribe that weed\nOxy cotton and codeine\nTurn your grand mama into a fiend\nAnd see the sign not at first, it ain't free\nI know you 'bout to die, but let me see your ID\nI know you 'bout to lie, but can you pay this fee?\nIf you can't pay, then please have a seat\nYou can't see a doctor, but you could see a priest\nWe can’t save your life 'til we got some assurance\nYour premium is paid at that insurance\nI hope you got endurance\nThey got me on hold, and I'm under the influence\nNurse high as a kite\nIn charge with my life\nAnd everything is lost\nWithout a Blue Cross\n\n[Hook]\nYou know I heard they hood robbin'\nYour money or your life and there ain't no stopping\nYou know I heard they hood robbin'\nYour money or your life and there ain't no stopping\n\n[Bridge]\nAin't that a bitch (that's a bitch)\nWhen you got to steal from the poor, and give to the rich\nAin't that a bitch (that's a bitch)\nWhen you got to steal from the poor, and give to the rich\n\n[Outro]\nWhatever you need\nWe got it for cheap right here, baby\nThis America, it ain't gonna cost you nothing\nBut a arm and a leg\nMaybe one of them motherfuckin' ears\nDon't trip, just put it on your credit card\nPut it in your baby name", "image": "https://images.genius.com/f1c6e4522c58b032c43433a2345b1bb1.1000x1000x1.jpg", "album": "I Am the West", "year": "2010-09-28"}]}