{"artist": "YNW Melly", "songs": [{"image": "https://images.genius.com/0e0522b6466c3e1e62ae6bed3f8f9f6d.726x726x1.jpg", "year": "2018-08-03", "album": "I AM YOU", "lyrics": "[Chorus]\nKnee deep in that water, need a surfboard\nWipe them tears off your face, what you cryin' for?\nWhat the hell, what the hell are you mad for?\nWhat, what are, you mad for?\nTell me baby, what are you mad for?\nWipe them tears off your face, what you sad for?\nI give you everything you ask for\nSo tell me why the hell are you mad for?\n\n[Verse 1]\nWipe them tears off your eyes, stop crying\nWhen you're not by my side, feel like I'm dying\nI, ooh ooh, oh my\nShe say she love me 'cause she heard that Slangin' Iron\nOh go brazy, ooh my baby, she so cute, mmh\nOh go crazy, that's my boo-boo in a Maserati, mmh\nI got niggas 'round me and you know they 'bout to body, mmh\nAny bitch whoever disrespect anything 'bout me\nVVS on your neck and it's so fire\nUh, smokin' LOL, I am so high\nThink that I need a dry cleaner\nAll these bitches wet when they see my demeanor\nPull up with a stick, let it go at your fade\nFuckin' with my niggas, bet your ass get a raid\nYNW, we finna walk through the place\nEverywhere we go, we trash you like a fuckin' disgrace\nI been in and out of states, I be all around the world\nI done seen a whole lot of boys and girls\nWho screamin' out they love me\nSo tell me why you ain't ridin' for me\n\n[Chorus]\nWhat the hell, what the hell is you mad for?\nWipe them tears off your face, what you sad for?\nWipe them tears off your eyes, stop crying\nWhen I'm not around you, feel like I'm dying\n\n[Verse 2]\nYou can see it in your face when you're lying\nTick, pick up your chin, what is wrong with you?\nOoh, matter fact, uh, on you\nWant you, girl what's goin' on with you?\nKeep sayin' no, girl I'm gon' make a song with you\n\n[Outro]\nAyy bae, come here\nAyy, right here\nI can't, I'm scared\nYou scared, huh\nWhat the fuck you mean you scared man?\nYou know the track, you know the track\nI'm scared\nAlright say it's Lil Reebee, it's Lil Reebee\nAnd fuck that, I can't rap, fuck that\nNo, no\nC'mon baby\nI can't do this\nI might keep that\nTell me what the hell you mad for, mwah\nI love you bae\nI said I love you bae\nI love you too\nNo you don't, get out my face\nI am you", "title": "I Am You"}]}