{"artist": "Pacewon", "songs": [{"album": "Won", "title": "Rush", "image": "https://images.genius.com/51988e399d7fd0c27dc7bf9671e91b51.600x600x1.jpg", "lyrics": "It's the RUSH..\nWe RUSH.. fourth and two we RUSH..\nRoc-A-Bloc we RUSH.. Outsidaz RUSH..\nIt's the RUSH.. ha ha, this the RUSH..\n\n[Pacewon]\nYo, huh, yo\nI sell fifty dollar clips at the colleges\nTo future lawyers, optometrists and magazine columnists (huh)\nGhetto politics, I drop a load\nOf raps that explode on impact like hollow-tips\nYo, cock your Glock lick shots for the Pacer!\nRaw like coke and got more jokes than Frasier\nLike Saddam Hussein, Pace will raise a\nArmy East of Eden on the borderline of Asia\nArmed in bomb shit, tec-9's and mag clips\nMy hooded crew got the bulletproof jackets\nYo, part of my plan is get this bad bitch\nTo fuck the President, give that man the package\nNext I'll fix up a chemical mixture (huh)\nTo get the armed forces out the picture\nWith them gone, my men storm the globe and\nThen we'll own it, like Caesar and the Romans\nTime flies, years become moments\nAnd the Outsidaz still creepin like rodents\nYo Pacewon bringin you the rawl deal\nAppeal, work and get mines for real; yo, yo\n\n[Hook: repeat 2X]\nThe cops can't stop the RUSH\nThe stick-up kids can't stop the RUSH\nThe DEA can't stop the RUSH\nMy whole click cock back and bust, FOR REAL\n\n[Pacewon]\nYo, yo, yo\nProfessor Kick-Ass, Mr. Teach-A-Kid-A-Lesson\nFresh like the Prince, without Jazzy Jeff and\nI'm the architect that can draw your path to heaven\nWith my Glock, bust rounds twenty-four - seven!\nPacewon, spy like James Bond-a\nLock up a Hon-da, pick up the un-der\nWith my mind on which land to conquer\nI make the audience sweat like Jane Fonda\nPace'll fly a jet, violent tyrant\nMind bent, dog-drippin, pissin on hydrants\nStraight flippin on crews that ain't silent\nThey come by the two's and get chewed like Trident\nI tour the world makin real estate investments\nGot more land than the Riddler got questions\nI travel yars, battle squads\nAnd read rappers like fortune tellers read tarot cards\nYo, a menace, wild like Crazy Ed is\nWith a sick scheme to make more green than lettuce\nFilm credits, who dick get the wettest?\nMy presence bring \"Good Times\" like James Evans\nPace'll violate all across the tri-state\nMakin niggas hum like my pager on vibrate\nGettin dough with more Brothers than Warner\nYour moms ain't know, quote Snow, and \"Informer\"\n\nHa ha, ha, ha\nRoc-A-Bloc, Pacewon\nHa ha, yo\nRoc-A-Bloc Pacewon, what?\nRoc-A-Bloc Pacewon, yo!\n\n[Hook]", "year": null}]}