{"artist": "DJ Battlecat", "songs": [{"lyrics": "[Verse 1: Cavie]\nNow watch me somersault, flip-flop, flip-flop, double backdrop\nA hand full of rhythm and wipe my ass with this track\nFlush the camo, and explode with the vocal pitch\nThe lyrical mad man-murderer is up in this bitch\nNow all these record labels looking for the Cavie\nSmall time independent producers is coming crafty\nNo royalties nigga, ain't Nate and Pac\nAnd sign for one year with seven motherfucking options\nBound to a contract; that shit ain't even cool\nFeeling like a ho, doing involuntary servitude\nWhat's even worse is yo shady ass manager\nTelling you to sign your name so it's on shit that could damage ya\nAmateur ass motherfuckers in my business\nAin't even got no skills, and tryna make decisions\nThinking that they got a nigga locked up for years\nBut ain't no busta motherfucker can fuck off my career\n\n[Chorus: Peeps Game]\nThe reality check is for those bustas who be frontin', see\nAnd all those busta ass fags in the industry\nSo watch your backs, and keep your backs watched\nCause you never know who could be clocking yo pockets\nGunshots if ya try to clock Glocks\nSet tripping, acting like ya know\nT.K.O. if ya think so, don't be that punk ho\nIt's business, not yo sho\nReality's checked, now ya know\n\n[Verse 2: Peeps Game]\nI've been through so much drama that this shit is like a movie\nChanging scripts on me? Causing me to wreck my mind\nI've been on my good behavior\nTryna do the right thing, cause music is my savior\nBut, I have to deal with knuckleheads who be tripping on they headtrips\nI just spit on that shit, cause I'm red\nThe approaches I get are so funny\nThank God I'm smarting than those honeys who be juggling us for money\nI have my bulletproof mind on\nCheck yaself, grab ya bags and don't be so shallow\nI battle if I have to set you straight, even raise ya tone of voice\nWhen you're speaking to me, I am the real and nobody\nA female was tripped on my the pure power\nBattlecat picked the track so now you can devour\nThe drama has been taped into ya mind\nCheck reality and see through the lights\nDon't wait for the truth to find you\nAll you need to do is be true\nAnd check the fools that try to get you, that's real\n\n[Chorus: Peeps Game]\nThe reality check is for those bustas who be frontin', see\nAnd all those busta ass fags in the industry\nSo watch your backs, and keep your backs watched\nCause you never know who could be clocking yo pockets\nGunshots if ya try to clock Glocks\nSet tripping, acting like ya know\nT.K.O. if ya think so, don't be that punk ho\nIt's business, not yo sho\nReality's checked, now ya know\n\n[Verse 3: Playa Hamm]\nNow I’m known for bringing these bustas heads when it comes to it\nWhile spitting mack, intoxicated like a fat ass bootsack\nIn fact, many must not screw it thinking since it’s on their conversation\nBut I just can’t see no retaliation\nI told ya, when I entered this game\nI raise the spot with a passion and affection that’s trashing\nAnd this is how I’m living\nSo you could take this reality check to the neck homies and come correct\nLike it seems to me the players doing it in the East\nPutting it down, so everyone can get upon a piece\nA robbery is what I’m stressing not to set trip\nToo many tricks don’t wanna see me with no pimp as it is\nLike this here used to allocate on bottoms, went from my coming\nNiggas act like we can’t have nothing if they ain’t getting some\nThese suckers know who made it easier to slang a sack\nDon’t let the media make you have to question your back\nCause it’s ours for the taking, [?] the shaking and faking\nCause it’s way too much money that them mothers making\nFirst it’s gon’ take you and me, then it’s gon’ take us and we\nCause ours will never be if together you can’t see\n\n[Verse 4: Kam]\nYo what time is it? Niggas do y’all really know?\nWhat everybody have to act so silly fo’, really doe?\nUntil we go Hollywood the niggas be cool\nThen they start blowing up and act a goddamn fool\nGetting gassed up, and passed up every opportunity\nTo make sure the West Coast had the proper unity\nBut nah, it’s always the same, no?\nMoney and fame, they say that’s all I’m in the game fo’\nSo what’s my name? I get my bud from the spot\nI’m Elmer J. Fudd, millionaire, I own a mansion and a yacht\nGot killas on deck that’ll peel ya cap\nWell, I can dance to the beat but can’t feel ya rap\nIt’s a reality check\n\n[Chorus: Peeps Game]\nThe reality check is for those bustas who be frontin', see\nAnd all those busta ass fags in the industry\nSo watch your backs, and keep your backs watched\nCause you never know who could be clocking yo pockets\nGunshots if ya try to clock Glocks\nSet tripping, acting like ya know\nT.K.O. if ya think so, don't be that punk ho\nIt's business, not yo sho\nReality's checked, now ya know", "image": "https://images.genius.com/a015b23b431d5b266522c65b97a0f91e.600x600x1.jpg", "year": null, "title": "Reality Check", "album": "Gumbo Roots"}]}