{"songs": [{"year": "2011-01-01", "image": "https://images.genius.com/ce9a0317f67940b823d8370135d930af.500x500x1.jpg", "title": "Right With You", "album": "Dirty Pretty Things", "lyrics": "[Intro]\nYo.. It's Rapper\nAre you listening?\n{Sound without +Focus...+ is just, noise}\nI hope you takin note, hope you payin attention\nUh..\n\n[Verse One: Rapper Big Pooh]\nI'm tryna like it's '99\nLooking back, I remember everything was fine\nMaybe not, baby, maybe I was bein blind\nGenu-wine with my time, I would write a rhyme\nGo to school, go to work, then the studio\n308 North Hall, that was truly though\nThe first time I felt we was the perfect match\nWe fucked around in the past, I was too detached\nClearly over matched, slightly overwhelmed\nI saw you in my future, couldn't take the helm\nI'm in another space, still happy\nDid you ever really see my face? All smiles\nAll the while I'm in another place\nThis becoming an addiction but I love the chase\nSearching for that first high, never destined to return\nUsher playin loud - \"Let it +Burn+, baby +Burn+\"\nIt's burning\n\n[Hook: Focus...]\nAs long as I'm here, I can't just let it die\nCause I wanna get it right for you\nI'ma do as much as I can, gotta let me try\nCause I wanna get it right with you\nMake it right with you ahh, you ahh, you, ahh, ah\nMake it right with you ahh, you ahh, you, ahh, ah\nMake it righht with you\n\n[Verse Two: Rapper Big Pooh]\nIf you let it go, when it comes back\nMaybe it was meant to be, I'm dreaming 'bout\nYou and I, what a sight to see\nWe already friends, I enjoy your company\nSeeing how my boys ack', like they like you more than me\nThat kinda turn me on and evoke jealousy\nI love our inner action, adore being with you\nWe were having fun, up to see the sun\nNeglect needing funds cause I bond to see us through it\nPush baby push, Nike checks, +Just Do It+\nNow I'm going through it, you tugging at the heart\nIt grained in my soul, a part of my mind\nA piece of my existence, now you understand\nTryna lead my resistance, what about a break\n'fore you break a nigga spirit? I probably need time\nTo myself but I fear it, I miss you.. already\n\n[Hook]\n\n[Verse Three: Rapper Big Pooh]\nOff a hiatus, I move a lil' different\nI see you changed too, but something seems missing\nYou not the same one, I gave my heart to\nThinking I'ma treat you like them other niggas do\nWhat we had was special, what it is now?\nYou been impregnated, overrun by kids how?\nYou let yourself go, you were a queen now\nYou fiend for that dough, we would take it slow\nAnd let it marinate, cooking up dishes\nHave 'em begging for a plate, that's past tense, baby\nLook who bat crazy, maybe me cause I still\nWant you as my lady, I been thinkin 'bout\nRelationships here lately, this is one-sided\nAll them things that you used to give {I PROVIDE IT}\nAin't no need to hide it, affair's never stopped\nYou will always be my #1 girl: hip-hop\n\n[Chorus]"}], "artist": "Rapper Big Pooh"}