{"songs": [{"image": "https://images.genius.com/393a795343ecd130585ccebeb935534b.600x600x1.jpg", "year": "2013-11-11", "title": "Canned Laughter", "album": "March Madness Vol.1: Madness Begins ", "lyrics": "[Intro: Various Artists]\n\n(Fuck ya circle) Yeah, same punch line\n(Fuck ya circle) Yeah, Same punch line\n\n[Hook: XV]\nLaugh tracks, applause and hand claps\nAs we hear the same punch lines in all these damn raps\nBeen soft, lip balm, sitcom acts\nSquare, who me? Never been called that\nSquarian ether don’t play this close to the heater\nPut some water in the tray and just place inside the freezer\nTake it out when you’ve made that follower a leader\nThen throw ice cubes down for the nicest emcee up\n\n[Verse 1: XV]\nUnbelievable L7 believer\nSince I was next to seven that night that I held the receiver\nI’m in LA taking a breather when the twins stopped breathing\nThen I made square in the circle to get over the grieving\nOr when my grandma passed, and I just kept dreaming\nThat she was like, right there and I just kept reaching\nBut couldn’t reach it, that’s the reason Imma’ shine til she sees it\nOr til I make it to heaven, and ask “grandma you see it?” believe it\n\n[Hook: XV]\n\n[Verse 2: XV]\nBiggie’s demon, I took a weekend to let it sink in\nRefraining from reaching, the mind state Chris Lighty would think in\nEating church’s while my label’s preaching\nThey can’t reach me on the jack so instead they jack reaching\nBad reason\nHave meetings bout’ tracks with wack treatments\nAnd acts that’s half decent and bars that’s half eaten\nLet’s fact check these Rap Genius meanings when it lacks genius\nNiggas suck, like Sookie's last season. (Laughter)\n\n[Hook: XV]\n\n[Verse 3: XV]\nYou thought a square wasn’t cool?\nThrew em’  two ice cubes, Jay said “New Rules”\nMight bring back jerry curl juice with this fro like Fudge\nHigher learning like the view of a Dead Poet standing on his chair inside a school\nTaking shots off the top, like Remy on the roof\nScreaming fuck niggas\nI hope you got Aflac, Duck nigga, cuz’ here comes the attack\nSmooth as orange Julius Caesar under my snapback\nGat strap for niggas that be thirsty for an @ back\nThat’s that, the roots to the square that I am\nUsed to rap like 50 cent, now I wrap 100’s in bands\nThe real square root of a key, is 32 grams\nBut when did I expect these dudes to tell the truth to their fans huh?\nMust have forgot where I am\nThe kid with the green backpack is back to the plan\nSo when I hear these punch lines about squares from these rap niggas\nThey’re the first to remind me, don’t rap like the last nigga\nI heard this game is like handling dope\nSo the 10 Crack Commandments is the shit that I quote\nI learned you can’t fix the game if you end up broke\nAsk Nas, he made Ether, now that camel’s the goat\nSo if you take their breath away, keep your hands on their throat\nSquarian ether, that’s a more fatal of dose\n\n[Hook: XV]"}], "artist": "XV"}