{"songs": [{"image": "https://images.genius.com/65c98702fc773f6dafd41563fe5c5485.500x500x1.jpg", "title": "Disciple", "album": "Street’s Disciple", "year": "2004-11-30", "lyrics": "[Intro]\nNas \"Two-thousand-four, yeah. L, whattup?\"\nL.E.S. \"Prophesy!\"\nNas \"Yeah.\"\nL.E.S. \"Prophesy baby!\"\n\n[Hook: Nas & L.E.S.]\nDisciple, Disciple (What?!) Disciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (Let's go!)\n\n[Verse 1: Nas]\nWord to mama, any lineup of rhymers\nCould bring any drama, anytime, the city's mine, Nas Is Like\nLove Undying, Money's My Bitch in Thugz Mansion\nThugs dancin' around the fly shit\nPharaoh garment's Prada, Egyptian camelback-riders\nPyramid architects, Perignon bottles\nMoney, jewelry want me then come get me\nHit me but don't miss me, you history\nLead flowin' around like a Frisbee, Italian dons from Sicily kiss me\nThis ain't 50, this ain't Jigga, this ain't Diddy, this ain't Pretty\nPain, power, pussy and pistols, lyrically no one, hold none near me, hear me\nKids cheer me like The Count of Monte-Cristo\nSteady poundin' soundin' like G without the lisp though\nMy big bro told me plain and simple, \"Nas do not look back\"\nWatch where you took rap, no bookbags and trucker hats\nJust army jacks and diamonds that's flashin'\nWhat the fuck is that, freestyle\n\n[Hook: Nas & L.E.S.]\nDisciple, Disciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (Esco!)\n\n[Verse 2: Nas]\nLike Paul, Michael and Matthew, Peter, James and Andrew\nPhillip, Simon and Judas -- I'm disciple of music\nStreet beats is the main thing minus the traitor\nAnd I'm not a dictator, I'm the righteous invitin' you haters\nInside the life of the greatest, it'll take you through something real\nGet a smack in your face, cause I hurt up, trauma-tize, llama\nBust shells, destroy yet try'ta prevent violence\nIf I present iron somebody dyin', don't even worry 'bout it\nThen dress warm for the cemetery climate\nWhen I speak I need cemetery silence, terror\nSee me, gold Hummers, Lamborghinis, man who stole the summer\nHand straight gleamin', if I don't know you toe-tag you\nDrag you through the cement, fo-fo maggie\nBody parts in my man's Maserati car, then party hard in Madagascar\nWhile rigor mortis'll grab ya, him retarded, I'm pass that\nGloves on, where the mask at? Too many love songs\nAll the thugs gone, what happened? Where's the passion?\nRappers battlin' non-rappers, carryin' on backwards\nLaughin' sayin' Nas thinks he's Farrakhan preachin' blackness\nHell yeah, awareness is my alias\nWord to the 'Braveheart' written on my bare chest\nThe realest, HERE IT IS!\n\n[Hook: Nas & L.E.S.]\nDisciple, Disciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (STREET'S!)\nDisciple (Street's!)\nDisciple (Street's!)\nDisciple (Esco!)"}], "artist": "Nas"}