{"artist": "Philthy Rich", "songs": [{"album": "East Oakland Legend (Deluxe Version)", "title": "Don’t Forget", "image": "https://images.genius.com/7e872d801b103b399f70aa3555b7b485.1000x1000x1.jpg", "lyrics": "[Intro]\nFunk or Die\nAyy, it's Philthy, nigga\nThe Mekanix\nUh-huh, look\n\n[Verse]\nNiggas must’ve forgot that I'm in my bag (Must've)\nSome niggas stay solid, some went bad (Solid)\nSmokin’ Killzone Gelato 59 (Killzone)\nThat nigga try to rob me, then he gon' die tryin' (It's Philthy)\nNiggas fuckin' with the opps then get mad at me (That right?)\nBut any nigga play with me gon' be a casualty (You know it is)\nI'm the wrong nigga for you to go against (It's Philthy, nigga)\nAnd all that sneak dissin’ ain’t no offense (It's Philthy)\nJust remember I’m the nigga who put you in position (Oh, you forgot?)\nThey told me you would cross me, but I didn't listen (They told me you would)\nOnly a broke nigga give you all his time (Broke bitch)\nFree my little brother, gave him all this time (It's Philthy)\nPour out a whole brick on the stage for Jack (Hey, rest in peace)\nThey'll smile at your face and stab you in your back (You know they will)\nOnly successful person in my whole family (Swear to God)\nI was crossed a million times by my own family (It’s Philthy)\nI'll beat a nigga ass like I'm Devin Haney (Hey D-H, what's happenin'?)\nAnd still'll hit the block and serve a nigga auntie (Seminary)\nI'm on my East Oakland shit, we move a little different (East Oakland)\nFell back on some niggas, gave 'em a little distance (It's Philthy)\nWhat you forgot I roll Funk or Die and Trigger for life? (Oh, you forgot?)\nAnd Killzone, I was funkin' up in real life (Funk or Die)\nLoyalty is everything, ain't tryna ruin that (Uh-uh)\nBut ain't no loyalty in this shit, nigga, I'm through with that (It's Philthy)\nWhy Philthy still on Semi' worth a few M's? (Chump change)\nWhy them niggas on the 'net, tryna sublims? (Why?)\nI can't reply to every sucker that mention my name (Uh-uh)\nNiggas really clout chasin' and searchin' for fame (It's Philthy)\nHatin' on a rich nigga, you gon' die broke (Hater)\nAll blue faces, baby, on the dead locs (On the dead homies)\nNiggas hangin' with the niggas who said that they shot me (Is that right?)\nI told 'em get 'em out the way and they said they got me (It's Philthy)\nMy ex-bitch in my DM, say she really miss me (Faggot)\nBut she be likin' all the pictures of niggas who diss me (Pussy)\nDouble cuppin' every day, I tried to kick it though (I tried to)\nI still remember where you stay, don't make me kick a door (It's Philthy)\nNiggas catchin' all these bodies, but ain't make the news (Uh-uh)\nI ain't heard nothin' about it so I'm so confused (I am)\nYou think they stopped makin' guns when they made yours? (I keep it on me)\nI put food on your plate when I made yours (It's Philthy)\nWant me to boycott Gucci for a ski mask (Designer)\nYou couldn't afford it anyway with your cheap ass (Uh-uh)\nI parked a million dollars of cars on one block (Foreign)\nAnd cooked a million dollars in dope in one pot (It's Philthy)\nNiggas think I fell off 'cause I fell back (Never)\nVisa got a Trackhawk and a Hellcat (Ayy, free Visa)\nThe moral of the story, nigga, my whole team eatin' (Ayy, eat it up)\nCut the ankle monitor off because it keep beepin' (It's Philthy)\nJust spent Valentine's Day with my bottom bitch (Solid)\nBeen down a dime, that say a whole lot about a bitch (Stomp down)\nThe first Asian bitch I knocked when I jumped in it (Is that right?)\nI was born in this sitch, you got jumped in it (It's Philthy)\nNext nigga diss me, I'ma turn his enemy up (Swear to God)\nAnd when you see me, make sure you keep that same energy up (Ayy, do that)\nJust spent thirty thousand on this Bentley truck chain (Bustdown)\nAyy bitch, I came a long way from that baby stain (It's Philthy)\nJust got some bad news that my kidneys failin' (Syrup)\nAnd one of these niggas close to me might be tellin' (Is that right?)\nOne thing I've never been, a snake or a rat (Never)\nOvernight five thou', she wan' take a stack (It's Philthy)\nCan't rap beef with a nigga who bought a verse from me (Uh-uh)\nJust know them Seminary niggas gon' murk for me (Seminary)\nNiggas been doin' this ten years straight (Ten years straight)\nYou little broke ass niggas ten years late (Ten years late)\nIt's Philthy\n\n[Interlude]\nHey man, I swear to God, man\nIt ain't a nigga in East Oakland, man, that did it like me, nigga\nYou feel me?\nParkin' these foreigns, fuckin' these bitches, countin' this money nigga, keepin' it solid\nNot a stain on my resume, huh?\nPuttin' niggas on, puttin' niggas in position to eat\nKeepin' it one thousand\nRepresentin' this East Oakland like me though, nigga\nHuh, free all my niggas though\nIt's Philthy, nigga\n\n[Outro: JBay]\nYeah, mane, it's Young JBay, mane, you feel me?\nOn everything, man, I'm comin' home, mane, you know\nFor real, that appeal comin' through, you feel me?\nDon't doubt me, 'cause I will be back, you feel me?\nAnd I ain't doin' no playin' at all, you know?\nFOD, you know what I'm sayin', entertainment\nYou know what it is\nThe Mekanix", "year": "2019-04-26"}]}