{"songs": [{"year": null, "image": "https://images.genius.com/6397384eb55923709bcbeda0808783ee.1000x1000x1.jpg", "title": "Do That...", "album": "Birdman", "lyrics": "[Intro: P. Diddy]\nC'mon now, c'mon now\nCash Money, Bad Boy baby\nLet's go\n\n[Hook: Mannie Fresh]\nPretty lady go on do dat dance\nPretty lady go on do dat dance (c'mon now, let's go)\nSexy momma go on do dat dance\nSexy momma go on do dat dance (c'mon now)\nMake it move for me baby (do you like dat daddy?)\nMake it jingle for me baby (do you like dat daddy?)\nTouch it down to the floo' (do you like dat daddy?)\nPick it up and let's go (do you like dat daddy?)\n\n[Baby]\nSee I walk through the club wit my Prada on\nVallet to da keys cuz tha cars so strong\nTwenty four whoooo, mami know too\nBallas come through tha side doo' wit they crew\nI went left and Puff went right\nPlus we had on all that ice\nI had a bald chick he had one too\nI had a mink on she had one too\n\n[P. Diddy talking]\nHey Birdman hold up a second\nYou see them ladies over there?\nThem ladies singing that thing, ladies sing\nYeah, I like that there\nFinish what you were saying\n\n[Baby]\nI bought tha bar out so he bought tha bar too\nIt ain't nothin to a balla mami do what we do\nPimp game wear big rings\nBirdman drive a red Range\n\n[Hook: Mannie Fresh]\nPretty lady go on do dat dance\nPretty lady go on do dat dance (c'mon now, let's go)\nSexy momma go on do dat dance\nSexy momma go on do dat dance (c'mon now, let's go)\nPretty lady go on do dat dance\nPretty lady go on do dat dance (c'mon now, let's go)\nSexy momma go on do dat dance\nSexy momma go on do that dance (c'mon now)\nMake it move for me baby (do you like dat daddy?)\nMake it jingle for me baby (do you like dat daddy?)\nTouch it down to the floo' (do you like dat daddy?)\nPick it up and let's go (do you like dat daddy?)\nMake it move for me baby (do you like dat daddy?)\nMake it jingle for me baby (do you like dat daddy?)\nTouch it down to the floo' (do you like dat daddy?)\nPick it up and let's go (do you like dat daddy?)\n\n[P. Diddy]\nNow shake it fast, watch yo'self\nMa show me what you workin wit twurk dat thang\nBounce like dat girl work that thang\nMake a pimp wanna hurt that thang\nStop frontin ma and do dat dance\nMake yo knees touch ya elbows and do dat dere\nWhat you got dere? Bend ova show that tattoo right there\nJus shake it, shake it, break it, break it\nNow look at you momma, oooohh, high cut\nI see from behind ya, oooohh, she's all that\nBaby you a designa wit a, coach bag\nWit a scarf around it wit a, coach hat\nSmack it up, slap it up, let me turn it up\nTil you steam and you scream, I'm burnin up\nOn tha scene I seen her doin the butt\nKeep doin what your doin to her, let's go\n\n[Hook]\n\n[P. Diddy]\nI see you lookin at me momma like you could, drop somethin\nKeep lookin at me momma cause you a, hot somethin\nGirl shake it around, like you got somethin\nNo playin around momma, stop frontin\n\n[Baby]\nI see what you doin mami, um hum\nI like the way you move mami (*bird sounds*)\nMe and Diddy could buy you a car, ma\nMe and Diddy could make you a star, ma\nSee those? Let's go\nTell hot get them broads I'll bring 'em to the car show\nWipe a pimp down, touch the floo'\nBend ova pop it love, show me what'cha know\n\n[Hook]"}], "artist": "Birdman"}