{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/b294ecc265a79f3e4ef86c41b208e8e4.500x500x1.jpg", "title": "Good-Bye (City of Dope)", "year": "2008-07-08", "album": "I Pledge Allegiance to the Grind II", "lyrics": "[Intro]\nThere's 8 million stories in the City of Dope\nI'mma just tell you about a few I know\n\n[Verse 1]\nI'm in the trap house trapped out\nThree naked bitches bagging up sacks\nTitties and ass out\nTwo monkey-men on the door with their gats out\nThe fumes got a nigga about to pass out\nI'm taking pulls from the blacken as I ash out\nThe .45 hanging out my king-sized denim\nA gangster on the stove cooking dinner\nThe last three hours I chefed six pounds of powder\nAnd three pyrexes\nAnd now I stare at six big breasteses\nWhen I get a call from Alexis\nDyke bitch from Texas\nKnown to rock 'caine, gold and new Rolexes\nRoll on Lexuses\nKeep her sexy bitch with her\nHit her with \"What up Lexi?\"\nAs I leaned on her Lexus I told her\n\"Girl, what's up, Sexy?\"\nAnd then I told Lexis \"You must be tricking and treating\"\nShe said, \"Naw nigga, I'm licking and eating\"\nAn out boss bitch in town for the weekend\nAnd she trying to find young hoes to get her freak in\nI told her \"Okay, but let a nigga lock up\"\nI told them bitches \"Clean the kitchen and mop up\"\nTold the monkey-men to lock the whole spot up\nAnd stop up as they put all the Glocks and the rocks up\nI left in an '85 regal just turning the Pac up\nAnd what?\n\n[Hook]\nIf I catch you slipping around my way\nYou deserve to get got\nAnd if you get caught slipping without that thing\nYou deserve to get shot\nDon't be surprised when you see me and my gang\nRunning up in your spot\nWhen you shake hands and say \"hello\" to the bad guy\n\n[Refrain]\nKiss your ass good-bye\nGood-bye, good-bye\nKiss your ass good-bye\nGood-bye, good-bye\nKiss your ass good-bye\n\n[Verse 2]\nLater around eight I'm on some devilish shit\nIn room 666 with a devilish bitch\nMe and her watching Belly and shit\nAnd she rubbing my belly and shit\nWhispering this shit, like:\n(Hey Mike how you pay this bitch\nHow you act like you ain't the one with a dick\nThe drop on? You got three points left\nNow how you gonna let that bitch ball and stunt?\nShit, I might as well fuck the dyke bitch myself\nGet my hands on all of that there white myself)\nHer jazzy mouth damn near made be smack the broad\nBut she smart for a bagger broad\nPlus she got a body that'll help me bag and rob this dyke broad\n\n[Hook]\n[Refrain]\n\n[Verse 3]\nBrought the plan together with major deception\nHad Black call up Lexi at the west end\nTold her that she stole my phone\nAnd she was trying to get to her before I got home\nThe fat bitch catfished, yeah she took bait\nSet up a rendezvous with my boo at eight\nTwenty minutes later I called Lexi\nSaid \"Bitch, we straight\nI got five young broads for you ready to shake\nI'm about to come get you, you ready to skate?\"\nShe said \"Naw, I'm hungover, I got a headache\"\nWent to Black, told her \"Baby we straight\nLet her eat it 'til she sleeping then open the door\nShe gonna awake to duct tape, face down on the floor\"\nSure did, she awoke to my .44\nLooking all confused, staring at my ho\nSeen tears in her eyes that was oh-so-hazy\nTold her \"Bitch, God said don't covet your neighbor\nYou dance with the Devil, you will be disabled\nBitch, I'm a beast and this my bishe\nAll we do is walk the earth and eat the weak\"\nShe said \"Mike how you gon' do this shit to me?\nWe been doing good business since at least '03\"\nI told her \"Bitch, be a man, this is M.O.B.\"\nThe dumb dyke began to lick cause she thought it was a dick\n\n[Outro]\n(\"How my hair look Mike?\")\n\"You look good girl\"\n*gunshot*\n\n[Refrain]"}]}