{"songs": [{"title": "PettyWap", "lyrics": "[Intro]\nUh\n\n[Verse 1]\nBag flippin', cash trippin'\nPull up, beat the block like a ass whoopin'\nStashbox, keep the stash in it, racks in it\nBought that bitch a Fashion Nova dress just to see her ass in it\nTwerk for my Instagram\nShe just got a hundred missed calls, it's her man, damn\nOh, that's your nigga now, huh?\nSaid you wasn't with him, now you with him now, huh?\nThings different now, huh?\nYou committed now, huh?\nI guess I can't hit it how I hit it now, huh?\nWell, hit me when your nigga ain't around\nThere's money to be made, bitch, I won't wait around\nI flex on her for fun, but I do not play around\nS on my chest and I keep a cape around\nGang gang with me, yeah, I keep like eight around\nEven when you think they ain't around, they around\nWoah, woah, woah, we ain't playing fair\nOh no, no, you don't want to take it there\nThinkin' 'bout my next move in my thinking chair\nThis chip is on my shoulder and it's stayin' there\n'Cause I been through a lot of bull\nAnd they can't stand me 'cause I'm misunderstood\nAnd I need a bad bitch just to give her good-good\nAnd girl, I like to eat, I hope you like to cook, cook\nUsed to get the work from my cousin WupWup\nWhat up, five? Free the guys out the woop-woop\n\n[Chorus]\nTeacher said, \"You'll never make it\"\nTurned my textbook to a checkbook\nI put food on the table\nAnd I did that without a cookbook\nI'm rich and they fucking hate it\nAnd while they looking mad, I'm just looking good\n\n[Verse 2]\nAyy, I feel like flexin'\nBitch, just call my phone, don't feel like texting\nMy Louis clothes is French, that's what I'm dressed in\nDior my cologne, she said my scent is her obsession\nI became possessive soon as the money came in my possession\nI'm selfish, no question\nMy alarm is set to every second, no restin'\nMy haters spend a lot of time with me, I'm they best friend\nI'm they best friend\nGo, best friend, go, best friend\nGo, best friend, go, best friend\nGo, best friend, yeah, go, ayy\n\n[Chorus]\nTeacher said, \"You'll never make it,\" uh\nTurned my textbook to a checkbook\nI put food on the table\nAnd I did that without a cookbook\nI'm rich and they fucking hate it\nAnd while they looking mad, I'm just looking good\nHah, ayy\nAnd while they looking mad, I'm just looking good", "album": "Herstory In The Making", "year": "2018-07-03", "image": "https://images.genius.com/b2909be1dcf2911b70b7c9ac923cfa9c.750x750x1.jpg"}], "artist": "Young M.A"}