{"songs": [{"title": "Mannibalector", "image": "https://images.genius.com/7fd34c05170fbf0f207b4d1804a8232f.600x597x1.jpg", "lyrics": "[Intro]\nNot again fool. Come on man oh. What? (One of those missions, I'm telling you) Yeah I- I- I know. (Yeah) Alright, alright, alright check it out. Personal belongings in the basket. Got a bag for you right here, so just put the clothes in there. Take off them muthafuckin' boots too, I got different some newer for you, different trade. Umm, go ahead and holla at me when you done. I'll be in the backroom. I got some shit for you so... just let me know when you ready\n\n[Verse 1: Brotha Lynch Hung]\nNow that I know it's time to eat\nI can feel it in my gut and I'm 'bout to run up\nPut a gun up in 'em, cut up in 'em\nAutocratic, automatic reaper\nI will leave 'em bleedin' in the street with the heater\nDiabolical, after I follow you I eat your meat up\nWhile he's hollow, I swallow a bottle as I eat the anatomy\nAmityville, Mannibal, can and he will\nMan I'm an animal, when I'm heatin' 'em up I'm lethal\nYou don't want to be fuckin' with me, I eat dead people\nI'm that nigga that's keepin' body parts in the freezer\nShit, fuck her and leave her\nI'd rather put her up until I'm hungry then I eat her\nThe doctors, the coroners, the cops they'll never see her\nI eat that bitch up quicker than a crocodile, believe it\nNow I wish a nigga would, that's what emcees get\nThese motherfuckers is bitches, I hit 'em in the cleavage\n\n[Hook: Brotha Lynch Hung]\nYeah, I'm Mannibalector\nShe's standing there naked, I'm 'bout to get naked\nShe's tied to the bedpost, I like to give head most\nShe likes to give head best, blood on the headrest\nStrange Music, bitch, you can tell by the necklace\nI carry me a chainsaw but this ain't the Texas\nChainsaw Massacre, nigga, worse than the Manson\nMurders, I turn 'em to hamburger meat\n\n[Verse 2: Brotha Lynch Hung]\nI put 'em in the trunk of the droptop\nI don't wanna get blood on my Pioneer boxtop\nOperation make pasta\nMakin' it, test the spaghetti noodles, I'm a coo-coo\nAnd a local in the [?] with a cleaver in the dresser\nButcher knife and machete, I do you in the poop chute\nPoke 'em and I undress 'em and leave 'em in the recipe\nI told you I was an atheist, eatin' 'em with lettuce and meat\nPuttin' niggas in a wok pot, takin' niggas to the chop shop\nNiggas is as soft as a box of cotton\nNiggas be off that oxycotton\nProbably rotten 'em, body rotten\nObviously potty tottened\nProbably not in danger yet, internet cable\nWatchin' ID channel cause I'm able\nAnd cocaine in cellophane wrapped up under the table\nReady to murder rappers, cut 'em and clap 'em, reppin' the label\nBlue house in the stable, mini MACs on the table\nTornado, NATO, egos get ladeled and they know\n\n[Hook: Brotha Lynch Hung]\nYeah, I'm Mannibalector\nShe's standing there naked, I'm 'bout to get naked\nShe's tied to the bedpost, I like to give head most\nShe likes to give head best, blood on the headrest\nStrange Music, bitch, you can tell by the necklace\nI carry me a chainsaw but this ain't the Texas\nChainsaw Massacre, nigga, worse than the Manson\nMurders, I turn 'em to hamburger meat\n\n[Verse 3: Brotha Lynch Hung]\nFresh out the motherfuckin' county jail\nPillows with no feathers and the county smell\nBlack sweat t-shirt, brown as hell\nIf a nigga try to fuck with me I crown his head\nHe don't wanna get bloody, does he?\nI'mma have to get muddy, buddy\nHit 'im with the chainsaw, Cuddy\nLeavin' his brains raw, dummy\nI'ma have to get silly putty\nI'ma have to hit 'till he's ugly\nI'ma have to get really ugly\nKilling Cuddy, killing Cuddy\nMr. McGillicuddy, he's the high school teacher\nUsed to take the bitches to the closet to teach 'em\n'Till he took my daughter to the closet to teach her\nNow I'm usin' his head as my album's main feature\nSerial killers kill a nigga not time and I'm the creature\nFrom the black side of town now I'm about to eat [?]\nCut her up and I eat her, crack domes like Easter\nEaster egg, leave me, eat her\n\n[Hook: Brotha Lynch Hung]\nYeah, I'm Mannibalector\nShe's standing there naked, I'm 'bout to get naked\nShe's tied to the bedpost, I like to give head most\nShe likes to give head best, blood on the headrest\nStrange Music, bitch, you can tell by the necklace\nI carry me a chainsaw but this ain't the Texas\nChainsaw Massacre, nigga, worse than the Manson\nMurders, I turn 'em to hamburger meat\n\n[Outro]\nThis right here: this is traditional brass knuckles. This one's already got the two inch blade [?]. Easily penetrate any vital organs. Uh, this right here, I know you lose these a lot, so I got a three piece set of, umm you know, what you call them, umm, scalpels. Yeah I got them three piece set of scalpels for you. Umm. I got some other stuff over here you might like. You know, I know how your sick-ass brain works, so... You know what I'm sayin', whatever you need just grab it, holla at me. Let me know what you took so I can go, you know what I'm sayin', re-up. And, umm you know what I'm sayin', holla at me and, umm, shit\n\nGRRR\n\nHey hey, man, give me some bigger pants or somethin'. Bigger pants", "year": "2011-02-21", "album": "Coathanga Strangla"}], "artist": "Brotha Lynch Hung"}