{"songs": [{"title": "Glory", "album": null, "year": "1998-01-01", "image": "https://images.genius.com/9bff8cc8ed9ebdd661c8db5449570950.600x600x1.jpg", "lyrics": "[Intro]\nWord up, it's La\nIt's rough out here God, you know?\nWord up, yeah\n\n[Chorus x2]\nIt's only love, doing this thing, paw\nIt's only love that I'm giving\n\n[Verse 1]\nYo, Earths are crying, as they see their sons dying\nIn the streets, bitches are burning like the bottom of an iron\nNegativity is all that brothers see in my environment\nI don't work for the white man 'cause cocaine is hiring\nMy times is expiring, but I don't care\nAll I do is buy sneakers, new cars and beer\nWhen I need to buy estates 'fore it get too late\nBut furnished basements, have my all crew, lifting weights\nDrinking liquor, see the real picture, your life is too short\nWill you make that million dollars, paw, before you get caught?\nBetween stick-up kids and Jake, you got to make your own fate\nIt was another kid's beef, my son got caught by a stray\nAnd he passed, gone in a flash from a four-five shell\nAnd I gotta believe in heaven 'cause the ghetto is hell\nWhat is reality, and the lifestyle of all men?\nI need a mansion, twins, Heinekens and skins\nI don't drink Gin to sin, leave that to raw-dick Kim\n'Cause he too light to fight, so he shoot to win in the end\n\n[Chorus x2]\nIt's only love, doing this thing, paw\nIt's only love that I'm giving\n\n[Verse 2]\nMadmen disappear here over the years\nAccept collect calls from my penitentiary peers\nIt's locked down for snow, I wanna live a better life\nKnow mad niggas caught by the Germans and drugs twice\nNow they behind bars, told when to eat, sleep and shit\nTransformed a three-year to a eight-year bid\n'Cause he jooked a kid, peace to Mena, Big E, now Wayne\nYou'll be home son, sporting fly Air ones\nBut in the world, yeah there's still shorties bugging\nOn a block at night busting off guns for nothing\nI've done that, I'm trying to escape that, black\nLittle Mike just came back from doing four years flat\nHe was a hostage, trapped in a four-corner room\nShipped far upstate, seen light to the moon\nNever snitched, that's why he doing six plus six\nWhile half y'all cats'll go to court, singing like a bitch\nThese are the true facts of it, either hate it or love it\nStash your toast in my whip, in the wood grain, covered\nBut it's peace, cause I'ma fuck up cats with no grease\nThis track is for the niggas locked down and deceased\nR.I.P., R.I.P\n\n[Chorus x4]\nIt's only love, doing this thing, paw\nIt's only love that I'm giving\n\n[Outro: La the Darkman *during Chorus*]\nWord up, Parada\nLiz, Big Gus, all my maniacs\nTracks, cousin Facts\nWord up, Mena, Slow Joe\nYou know? Word up\nAll mine, you know what I mean?\nGotti, word up\nSelassie, know what I'm saying? Word up\nYou know? My man King, Ced Demon\nKing Gunner, word up\nKnow what I'm saying?? Ugh!"}], "artist": "La The Darkman"}