{"songs": [{"title": "Find No Enemy", "lyrics": "Apparently I'm second generation black Caribbean\nAnd half white Scottish whatever that means\nSee lately I feel confused with the boxes\nCause to me all they do is breed conflict\nIt's not that I've lost touch with the reality\nRacism, sexism and nationality\nJust to me it all seems like insanity\nWhy must I rob you of your humanity\nTo feel good about mine?\nIt's all about crime\nDehumanizing is how I justify it\nSo I must keep on lying about the history of Africa\nSo I can live the with massacres\nAnd repeat my mantra of Muslim and terrorist\nSo I can sleep at night as bombs take flight\nEyes open wide but I'm blind to the sight\nToo busy chasing the perfect life\nAnd the working class keep them uneducated\nTruly educated men could never be a racist\nTo educate is to draw out what is within\nAre we not all the same under the skin?\nI got a heart like yours that pumps blood and oxygen\nAnd insecurities are a whole lot of them I'm scared like you deep down\nI really do care that world is not fair like you\nBut I don't even believe my own prayers like you\nChasing career going nowhere like you\nLost in a fog of my own insecurities\nI hold myself up as an image of purity\nAnd I judge everybody else\nBy the color of their skin or the size of their wealth\nBut it's not good for my health\nAs the only one I ever really judge is myself\nThe oppressor must suffer like the oppressed\nThough I pretend I'm in control of this mess\nBy inflating my ego, puffing my chest\nI see my weakness, and need to show strength\nOr what we think strong is because if we're honest?\nTrue strength is the strength to be honest\nAnd if I'm honest I am just tired\nIf I'm honest I am just tired\nTired of everyday filling up my car and knowing that\nI'm paying for the bombs in Iraq\nTired of pretending like it don't hurt my heart\nOf wanting change but not knowing where to start\nTired of listening to all the conditioning\nAnd all the forms they got me filling in\nNext time you see what is a thug and despise him\nPlease know I was just like him\nCause I was like eight the first time I saw crack\nSame time I first smoked weed choking on blowbacks\nFirst time I saw knifes penetrate flesh\nIt was meat cleavers to the back of the head\nAs I grew and teenage years passed\nMany more knifes pierced and the shots blast\nAnd I not saying I had the worst upbringing\nBut there's a million young men just like me in prison\nWe complain about racism and elevate clowns\nWith their trousers down swinging their dicks round\nMaybe that is not quite literal\nBut everything they do is just as stereotypical\nTo my real fans I feel your pain\nAnd I get the messages, but don't complain\nThat we ain't got more fame for paying our part\nThey can keep the charts all I want is your hearts\nThey can keep the charts all I want is your hearts\nThey can keep the charts all I want is your hearts\nCalling it black radio, don't make laugh\nSo is black music all about tits and arse?\nYou don't represent nothing, you're just pretending\nWhen was the last time you ever played Hendrix?\nOr Miles Davis or John Coltrane?\nOr Ella Fitzgerald or Billie Holiday?\nWe can call it urban to me that's cool\nIf urban means street, that includes jazz too\nAnd rock for that matter\nGo ask Mick Jagger or Jimmy Page what they were listening to - the blues\nNot discrediting, love Zeppelin too, just giving credit where credit is due\nThat blood soaked word rappers still use\nAll it really shows is that we still self abuse\nThat was the word that was used to kill Kelso Cochrane and Emmett Till\nThat was the word that the conscience eased\nAnd made people pleased to hung you from trees\nThat was the word that let the whips crack\nNo matter what you say you can't take it back\nAnd I can say their black so I feel their pain easier\nBut 1915 look at Armenia\nIf the whole world is human stupidity\nThough we choke ourselves to death quite literally\nAnd I can talk with my comfortable mouth\nWith my comfortable clothes and my comfortable house\nThe tables will turn, we can but stall them\nEvery empire on this earth has fallen\nSo unless we can find another way\nMaybe not today, but it will come one day\nIt may sound like I'm bitter but in fact truth be told I am quite the opposite\nI wake everyday and am overwhelmed\nJust to be alive and be like no one else\nAnd the sheer weight of the thought of space\nIs enough to keep my little ego in place\nAll that we chase and try to replace, all along it was right in our face\nThe only way we can ever change anything\nIs to look in the mirror and find no enemy\nThe only way we can ever change anything\nLook in the mirror and find no enemy", "year": "2010-01-01", "album": "DoubleThink", "image": "https://images.genius.com/1d372a1e5ce6759370053ad0e1be955f.1000x1000x1.jpg"}], "artist": "Akala"}