{"songs": [{"lyrics": "[Verse 1]\nFirst the Fat Boys break up, now every day I wake up\nSomebody got a problem with Hov'\nWhat's up? Cats all fed up cause I got a little cheddar\nAnd my record's movin' out the store?\nYoung cats gettin' at me, young rappers spittin' at me\nMy homie Big predicted this thing exactly\n\"Mo' Money, Mo' Problems\"- gotta move carefully\nCause cat hate when you getting money like athletes\nYoung'ns ice-grilling me, ohh - you not feeling me?\nFine; it cost you nothing - pay me no mind\nLook, I'm on my grind, cousin, ain't got time for fronting\nSensitive thugs, they all need hugs\nDamn little man I'm just trying do me\nIf the record's two mil you know I'm trying move three\nGet a couple of chicks, get 'em to try to do E\nHopefully they'll ménage before I reach my garage\nI don't want much, yo I drove every car\nSome nice cooked food, some nice clean drawers\nBird-ass niggas I don't mean to ruffle y'all\nI know you waiting in the wing but I'm doing my thing\nWhere's the love?\n\n[Hook (Jaguar Wright)]\n(Ain't no love, in the heart of the city)\nI said where's the love?\n(Ain't no love, in the heart of town)\n\n[Verse 2]\nAnd then the Fugees gonna break up, now everyday I wake up\nSomebody got something to say\nWhat's all the fussing for? Because I'm grubbing more\nAnd I pack heat like I'm the oven door?\nThey pray and pray on my downfall\nBut every time I hit the ground I bounce up like roundball\nNow I don't wanna have to kill soundboys\nDon't wanna have to cock back the four pound boy\nLook scrapper I got nephews to look after\nI'm not looking at you dudes, I'm looking past ya\nI thought I told you cats I'm not a rapper\nCan I live? I told you in '96\nThat I came to take this shit and I did, handle my biz\nI scramble like Randall with his\nCunningham but the only thing running is numbers fam\nJigga held you down 6 summers; damn, where's the love?\n\n[Hook (Jaguar Wright)]\n(Ain't no love, in the heart of the city)\nOk I feel you ma, I said where's the love?\n(Ain't no love, in the heart of town)\nEverybody let's take em to church\n(Ain't no love, in the heart of the city\nAin't no love, in the heart of town)\n\n[Verse 3]\nThen Richard Pryor gon' and burn up and Ike and Tina\nTurner\nBreak up then I wake up to more bullsh\nYou knew me before records, you never disrespected me\nNow that I'm successful you'll pull this sh\nNigga I'll step on your porch, step to your boss\nLet's end the speculation, I'm talking to all of y'all\nMales shouldn't be jealous that's a female trait\nWhat you mad cause you push dimes and he sell weight?\nY'all don't know my expenses, I gotta buy bigger plates\nHehehe, and more baggies, why you all aggie?\nNigga respect the game, that should be it\nWhat you eat don't make me sh - where's the love?\n\n[Hook]\n(Ain't no love, in the heart of the city)\nI said where's the love?\n(Ain't no love, in the heart of town)\n(I said it ain't no)\nAin't no\n(I said it ain't no)\nAin't no\n(I said it ain't no)\nAin't no\n(I said it ain't no love in the heart of town)\nAin't no\nI like that start again\n(I said it ain't no)\nAin't no\n(I said it ain't no)\nAin't no\n(I said it ain't no)\nAin't no\n(I said it ain't no ain't no ain't no love)\n(Ain't no love, in the heart of the city)\n(Ain't no love, in the heart of town)\n(Ain't no)\nAin't no\nUh huh\nAin't no\n(Ain't no love)\n\n[Outro]\nEverybody give it up for Jagwar Wright come on\nThat's all you baby that's all you\nThat's all Jay\nYeah right", "title": "Heart of the City (Ain’t No Love) (MTV Unplugged)", "image": "https://images.genius.com/a7449b38b8eab47232b379bc442a5f10.1000x1000x1.jpg", "year": "2001-12-18", "album": "MTV Unplugged"}], "artist": "JAY-Z"}