{"artist": "King T", "songs": [{"image": "https://images.genius.com/1be8875f252ab97264f07d49cfc3aac4.599x599x1.jpg", "title": "You Can’t See Me", "year": null, "album": "IV Life", "lyrics": "[King Tee]\nI run that old gangsterism on the normal\nThe name is King Tee, I pack guns like it's formal\nWith the utmost respect I be chillin\nKnockin MC's out cause I'm the best in this building\nI be the G-R-E-A-T, plus majestic\nMagical, radical, the technique is hectic\nI, floss upon the scene in the front and back Caddy\nYeah, here goes Big Daddy, heh\nIn my trunk I keep a whole fifth of 'gnac\nIn there with some extra hollow points for my strap\nCause I bust on fools, I shoot down fools that front\nThe last of the few with the funk\nKing Tipsy, who flips the, rhymes like I'm crazy\nYou know these artificial gangsters can't fade Tee\nThe original G, from the C-P-T\nI'm no joke on the funk fool, you can't see me\n\n\"To all my people with the funk..\" (Yeah)\nYou can't see me!\n\"To all my people with the funk..\" \".. where ya at?\"\nYou can't see me!\n\"To all my people with the funk..\" \".. where ya at?\"\n\"To all my people with the funk..\" \".. where ya at-at-at?\"\n\n[King Tee]\nHuh, I'm really into girls with fat cats\nHoochies, and hoes, and some hoodrats\nI take 'em to the Snooty Fox for the spin\nBut if they real proper, we hit the Comfort Inn\nI grab a fifth of Tanqueray and some Squirt\nA fat bag of chronic then we're coolin like Levert\nTurn on the porno flicks just to set the mood\nToss the bitch up and leave her ass in the room\nCause a bitch ain't shit like Snoop told it\nAll I do is toss and let the next man hold it\nI chill at the bar because that's the spot\nWhere a bitch'll get ten dollars just rubbin on the cock\nYeah, Tee bein a trick won't work\nYou won't spend my money on no Dooney and Bourke\nAnd that's real, comin from a real-ass G\nI'mma just toss yo' ass like a salad beatch, you can't see me\n\n\"To all my people with the funk..\" \".. where ya at?\"\nYou can't see me!\n\"To all my people with the funk..\" \".. where ya at?\"\nYou can't see me!\n\"To all my people with the funk..\" \".. where ya at?\"\n\"To all my people with the funk..\" \".. where ya at?\"\n\n[King Tee]\nNow I'mma take the third verse to the neck\nThen ask who's next and, ask who wrecks?\nI bring Tha Alkaholik spirit to the room\nDown two 40's, then hit the boom\nRelease all your doubts cause, I'm what it's about\nThe funky drunk man, in front with the stout\nAnd niggas wanna test the fashion\nCause I bring passion, for those who's askin\nI don't trip I just, hit the switch for the funk shit\nI don't fuck with the punk shit\nI slang my rap like crack, and niggas be cluckin\nA quick blast for the buck\nThen they spark, and yo oh, peace to Mark\nFor the beat from Carolina to the Compton streets\nThey'll know, the original G, from the C-P-T\nI \"Act a Fool\" on the funk boy, you can't see me\n\n\"To all my people with the funk..\" \".. where ya at?\"\nYou can't see me!\n\"To all my people with the funk..\" \".. where ya at?\"\nYou can't see me!\n\"To all my people with the funk..\" \".. where ya at?\"\n\"To all my people with the funk..\" \".. where ya at?\"\n\n{*scratches ad-libbed to fade*}"}]}