{"songs": [{"title": "24k of Gold", "album": "Detroit", "year": "2012-09-05", "image": "https://images.genius.com/6b6ac4eb55acf7dda757b1f6c6081c31.500x500x1.jpg", "lyrics": "[Intro: Big Sean]\nYeah, G.O.O.D\n\n[Chorus: Big Sean & Jhené Aiko]\nWishing I could wrap my whole life up in 24 karats of gold\nLately, I've been dreaming 'bout diamonds and pearls\nYup, diamonds and pearls\nAnd enough money I could rule the world\nIf I ruled the world, yeah, if I ruled the world\nIf I ruled the world man, it got me thinking man if I ruled the world\nIf I ruled the world, if I ruled the world\nI could rule the world man, if I ruled the world\n\n[Verse 1: Big Sean]\nIf I ruled the world, I would buy it all\nI'm addicted to champagne and buying the mall\nI'm addicted to living life above the law\nHow much do it take to live above the law?\nI call my homie Ralph up, cause his car stop\nTold him bump a new car, come grab the car lot\nThat way you can have convertibles, and a hardtop\nOpen up a few doors, since we had a hard knock, life\nLike, open up\nWhere restaurants and legs stay opened up\nStart a franchise so my dawg can quit wearing\nA .44 up on his waist like it's his pants size\nAnd to my OG locked up bumping \"Ready or Not\"\nWho was just trying to do it big, but wasn't ready to die\nCop a first class whatever he like, with hoes already inside\nNow he can rest in peace while he alive\nFuckin' right\n\n[Chorus: Big Sean & Jhené Aiko]\nWishing I could wrap my whole life up in 24 karats of gold\nLately, I've been dreaming 'bout diamonds and pearls\nYup, diamonds and pearls\nAnd enough money I could rule the world\nIf I ruled the world, yeah, if I ruled the world\nIf I ruled the world man, it got me thinking man if I ruled the world\nIf I ruled the world, if I ruled the world\nI could rule the world man, if I ruled the world\n\n[Verse 2: Big Sean]\nSeems life's never at a standstill, even in a photo\nThinking about the ex-girl, I hoed though\nLike would we have won it all, or would I have lost it all like Ocho\nThe things I think about the most are things I never know though\nLike, why don't schools teach more mathematics?\nLess trigonometry and more about taxes?\nThey at the chalkboard, teaching us ass backwards\nHow about preparing us for life instead of lab rat us?\nWith a mansion that's about five floors\nNo more sleeping on the couches, cause we got five more\nWith the fam that reminded me what I'm alive for\nAnd at the same time remind me what I'd die for\nA world where you wouldn't need sleep\nThat way we could catch up instead of chase dreams\nAnd finally get the speedboat my dad always wanted\nMm, I swear I feel it coming\n\n[Chorus: Big Sean & Jhené Aiko, J. Cole]\nWishing I could wrap my whole life up in 24 karats of gold\nLately, I've been dreaming 'bout diamonds and pearls\nYup, diamonds and pearls\nAnd enough money I could rule the world (Cole World)\nIf I ruled the world, yeah, if I ruled the world (Cole)\nIf I ruled the world man, it got me thinking man if I ruled the world\nIf I ruled the world, if I ruled the world\nI could rule the world man, if I ruled the world (Cole World)\n\n[Verse 3: J. Cole]\nIs this a dream? Well that's how it feel\nSometimes I got to pinch a fat ass to see if it's real\nI specifically remember, no heat in the winter\nNow I supply heat for the winter\nThen I skate to the beach for the winter\nWhen it comes to chips boy, nigga get a grip\nNo cleats I'm a winner\nShow love to the hoes and the freaks I remember\nHit the club and raise hell all week for the sinners\nMeet a young Dennis, the menace to society\nCheck my sobriety, fuck hoes in varieties\nShame that these things is the reasons you admire me\nBut, I'm getting dough man, these flows gon' retire me\nSplurging all crazy\nSwitching lanes in the Range swerving all crazy (Swerve)\nStyle on Nadal, I've been serving y'all lately, cheddar on Federer\nBall till I fall, et cetera, et cetera\n\n[Chorus: Big Sean & Jhené Aiko]\nWishing I could wrap my whole life up in 24 karats of gold\nLately, I've been dreaming 'bout diamonds and pearls\nYup, diamonds and pearls\nAnd enough money I could rule the world\nIf I ruled the world, yeah, if I ruled the world\nIf I ruled the world man, it got me thinking man if I ruled the world\nIf I ruled the world, if I ruled the world\nI could rule the world man, if I ruled the world"}], "artist": "Big Sean"}