{"artist": "Valete", "songs": [{"title": "Beleza Artificial", "year": null, "lyrics": "[Intro - Sam the Kid]\nYo Valete man obrigado mesmo foda-se\nEra mesmo neste som que eu queria entrar man foda-se\nCertas bitches...\nHá certas damas é mesmo que não têm nada na cabeça, foda-se! Tipo um gajo quer falar com elas\nNepia, só é para foder\nUm gajo quer ter uma conversa, não dá para ter conversa\nFoda-se, também chamaste aí o Bónus\nMeu puto fala bem, yo yo\n\n[Verse 1 - Bónus]\nBem servidas de peito, com uma peida frenética\nSão modelos femininos de bombas genéticas\nInvestem no corpo para se sobrepor ao intelecto\nPor isso têm o cérebro torto e deixam sempre o peito aberto\nQuando usam micro-saias querem toda a gente atenta\nNa rua ou no centro desfilam sempre às horas de ponta\nTodos dão conta, man, e qualquer homem esquenta\nSe não for pra ser montada pra que é que serve uma jumenta?\n\n[Verse 2 - Valete]\nTudo o que elas são está por baixo duma cueca\nO que é que diz uma peida que fala? Merda!\nO corpo é tudo então não pode ficar parado\nO cérebro é frustrado, anda sempre desempregado\nMediocridade incorporada numa obra de arte\nElas nunca existirão segundo Descartes\n(Eu penso, logo...)\nMamadeiras, vazias como a minha carteira\nSafam-se no mercado do emprego porque conheceram o Taveira\n\n[Refrão x2 - Valete]\nAqui ou acolá, cena tá toda má\nBué da muchachas na cabeça só têm caca\nJá disse, assim não dá, sai do meu habitat\nPorque tu não dizes nada, apenas blá blá\n\n[Verse 3 - Bónus]\nÉ a nova geração, sempre na exibição\nQuerem fama, depois da fama levam difamação\nSó sabem dizer que sim e concordar com o que disseres\nNunca lêem livros têm muitos caracteres\nNão são mulheres, são pedaços de carne à paisana\nFilhas da cultura pimba, TV, lixo é o programa\nSão acolhedoras damas com uma peida que abana\nE têm forma humana porque Deus também se engana\n\n[Verse 4 - Valete]\nManos vivos pegam nelas man, pinote e nada mais\nSão jogos de treino, nunca chegarão a oficiais\nA pachacha delas está disponível como um escuteiro\nÉ como uma discoteca gratuita sem porteiro\nAté descamisados entram, não há censura\nEuros é como BSE, deixa-as na loucura\nFísico-predomínio, declínio do raciocínio\nSe só existisse amor platónico casavam com babuínos\n\n[Refrão x2 - Valete]\nAqui ou acolá, cena tá toda má\nBué da muchachas na cabeça só têm caca\nJá disse, assim não dá, sai do meu habitat\nPorque tu não dizes nada, apenas blá blá\n\n[Verse 5 - Sam the Kid]\nYo, beleza exterior, natural, com sabor a\n\"Se não fores lavar essa merda já vai criar bolor\"\nYo, refiro-me ao teu crânio, o teu corpo tá bom\nNão passas um dia sem a magia do teu batom\nTens um cenário de cuarra quando te abanas ao som\nVens ter comigo, dou-te barra, agora já sou barron?\nYo, tá-se bem, dá-me estiga, chama-me o que quiseres\nEu não procuro affairs, vai ter com os teus chauffeurs\nPorque eu não tenho bote nem chicote, então desapareces\nSou eu que não te mereço ou és tu que não me mereces?\n\n[Verse 6 - Valete]\nNinguém vê o fim dos teus buracos\nMas mesmo assim não te atemorizes\nNós não vamos por aí, os nossos caralhos têm vertigens\n\n[Verse 7 - Sam the Kid]\nTens pensamentos medíocres que só querem que tu lucres\nTodos os dias novos looks, hoje à noite é p'ó Lux\nOnde apanhas grandes mocas, com vodkas e brocas\nE tocas em cocas, sufocas, convocas o sexo a quem provocas\nCom tantas polaroids já te dói os olhos\nNão queres os quarta-classe boys, queres é mongolóides\nHá praí aos molhes, és tu que escolhes\nDestróis casamentos como homens fossem toys\nEntra, mira, mira, gala, gala\nCom tantos implantes encontro os cantos da sala\nAdoras palação, que o teu damo te defenda\nA provocares os outros com esses teus griffes de renda\nPara não ficar traído com o vestido fodido\nSedução no ouvido em troca de um apelido\nTem de ser alguém querido, de preferência um senhor\nMas eu não vejo cupido então não pode ser amor (na na)\n\n[Refrão x2 - Valete]\nAqui ou acolá, cena tá toda má\nBué da muchachas na cabeça só têm caca\nJá disse, assim não dá, sai do meu habitat\nPorque tu não dizes nada, apenas blá blá\n\n[Valete e Bónus]\nSó dizes blá blá\n(...)\nNunca lêem livros\nQuantos caracteres é que elas...\nQuantos caracteres é que o livro precisa de ter para elas lerem?\nDez caracteres\nDez caracteres?\nDez caracteres\n(...)\nSó dizes blá blá\n\nBling bling bitches", "album": "Educação Visual", "image": "https://images.genius.com/51d60e7328e4b1048f51604aceb3c06b.1000x750x1.jpg"}]}