{"songs": [{"image": "https://images.genius.com/918b4db0bc6d6cd1a89e223b72d2d53b.1000x1000x1.jpg", "title": "Human Consumption", "album": "The Pre-Fix for Death", "year": "2004-09-21", "lyrics": "[Intro]\nA cannibal is a person who eats human flesh\nThere is much discussion as to whether cannibalism is an inherit characteristic in all human beings or animal impulses\nOr whether cannibalism Stems only from the minds of man-beasts such as some of the most prolific serial-killers\n\n[Verse 1]\nSick fucks with mild mannerisms practicing cannibalism\nFrom Aztecs to starving North Koreans in prison\nLiving Hannibal's vision, can you stomach the luncheon?\nWe're butchering the human carcass for human consumption\nUncivilized atheists looking to devour you when you're dead\nCause in the head it spiritually empowers you\nOverpopulation and famine, the problem's solved\nThey're eating people, there's no need to get cops involved\nPartial birth abortion infants killed in vagina\nYou could buy body-parts, they're eating baby's in China\nPractice the effigy as soon as you die\nReincarnate a vulture and eat the corpse of Christ, you will crucify\nPatient zombie's leaving death-industry\nFeast on the flesh of Clarice, cause young girls are the best to eat\nAt least that your parents that carve you the Bible supports cannibalism\nEat your children when God starves you\n\n[Verse 2]\nThe last kaboom, Dahmer and Gein delved in it with shelves of it\nParts by the dozen sick like filthy clinic\nTrapped with no food made you a mauler\nEven moral Christians will be reduced to being the animal we all are\nWill you survive like the film \"Alive?\"\nWhen forced to face cannibalism like when the pilgrims arrived?\nAlbert Fish's fetish for individual mastication\nWas his equivalent to masturbation\nThey're looking for people to kill consensually for thrills\nAdvertising for victims on cannibal URL\nOne victim ate himself with the killer\nThen agreed to be slain\nStrange, like Ray Liotta being fed his own brains\nIt's legal in Germany, believe me\nCannibals are celebrities, look at movies at UK TV\nDahmer action-figures, the families think it's perverted\nThe makers said \"fuck it\"\nAt least someone is eating off the murderers\n\n[Outro:]\nJeffery I hate you! Jeffery's out of control! Don't [fuck] with me Jeffery, I'll kill you\n\nOn the related subject I must confess to you, I'm giving very serious thought to eating your wife\n\nWhat the hell are you doing there sitting in the dark?\n\nThinking about cannibalism\n\nLittle is known about the effects of eating human flesh. Some studies have revealed tribes ritualistically cannibalizing became struck with Kuru, a disease of the brain later named the laughing disease causing hysterical laughter"}], "artist": "Necro"}