{"songs": [{"image": "https://images.genius.com/2d33d460c2bb299f939ae6e8314af26c.640x640x1.jpg", "title": "Party of Three", "album": "Attitude City", "year": "2013-10-15", "lyrics": "[Verse 1]\nGirl, I'm gonna take you on a date tonight\nSo put on your sexy dress and meet me\nIn my chambers by the firelight\nThis night is gonna be the best of your life\nOh yeah the mood is right\nYou look more beautiful than poetry can describe\nBy the way, do you mind if Ninja Brian joins us\nHe's promised not to kill anyone-\nOh never mind\n\n[Chorus]\nIt's a party of three\nIt's just you and me\nAnd a psychotic ninja\nEvery girl's dream\nDon't make sudden movements\n\n[Waiter] Good evening, would you like an appetizer?\n[Danny] Oh, Brian!\n\nDo you see what I mean?\nNothing's more romantic\nThan a murder in the second degree\nYou'll be convinced\nThough I'm sensing you're not totally\nOn board with this\n\nWas it the murder thing?\nYeah, I thought it might be\n\n[Verse 2]\nNow it's after dinner and we're out at the club\nI'm grinding up against you and I'm starting to chub (Uh)\nOh you know girl, we're makin' it work\nWhile Brian goes completely fucking apeshit berserk\nThere were 300 people at this club\nBrian killed 297, so that leaves us with a\n\n[Chorus]\nParty of three\nIf human life were a keyboard\nHe'd be gluing down Control-Alt-Delete\nDon't make direct eye contact!\n\n[DJ] Yo I'm the DJ! Who wants to dance? Ahg!\n[Danny] OK Brian, we get it\n\nGirl you're looking at me\nLike your feeling sick\nI'll take you home and give you vitamin P\nThat stands for penis\nNothing will come between us\nBrian, lay down a tasty bridge\n\n[Bridge]\nDamn girl, we had such a great night\nIt's a shame more bystanders couldn't have survived\nWe're going back to my place where we're gonna make love\nAt the moment of completion I'll release a flock of doves\nLet me lay the foundation of the state of our relations\nThere's gonna be temptation then sensations of vibration\nFollowed by the cremation of your sexual frustration\nEnding in the culmination of elation consummation\nThere's just one thing I think I forgot to mention\nNinja Brian's gonna be there giving us his full attention\nCause nothing could be hotter than our sensual embrace\nWith a ninja staring at us three inches from your face\n\n[Chorus]\nIt's a party of three\nWelcome to my kingdom of Slamalot\nYou are the new queen\nPlease take your throne\nTogether we'll rule this majestic bedroom alone\nOh, hey Brian\n\nI think we all can agree\nIt's time for me to plow your fields and\nSow the seeds of a new family tree\nWe're young and free\nCome on, baby\nIt's just you and me\n\nAnd Ninja Brian"}], "artist": "Ninja Sex Party"}