{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/2d4938c52a7ad6a70466fec5d33637cb.500x500x1.jpg", "year": null, "album": null, "lyrics": "(Hook)\nI'm gettin' drunk, Hammertime\nWhat you say, punk? Hammertime\nThis one is yours, that one is mine\nRaise it up, Hammertime\nHammertime, Hammertime, Hammertime, Hammertime\nThat one is yours, that one is mine\n\n(Verse 1: Yelawolf)\nPull me over cause I'm fallin’ over, throwin' up\nRunnin’ over rappers, drunk – “Hello, Mama - How was church?”\nAnother Sunday and I'm wakin’ up\nFeelin’ like I ate a bowl of shit for dessert\nFor the first day of Christmas I want bud\nSecond day of Christmas I want Jack\nMe and Santa Claus gonna crawl through the city in the Chevy\nThrowin’ rocks at your front door, now\nShady Records, buddy, you don’t wanna war with that\nYou feelin’ real good cause I’m feelin’ laid back\nBut if I wanna run around the wanna circle with the chopper\nSo I can slow your roll, then I’ll do it in fact\nAnd I’ll run around your all-black Maybach\nWith a can of white paint like I came from the top\nWhen the CD drops if you wanna tell your mama\nThat you wanna come play like you came from the sty\nI'm right on time, don't change the clock\nWith the prime of the rhyme - aim and cock\nAnd the game's on lock, got the game in the box\nToys 'R U, we got \"Us\" on lock\nBetter push a mop, better find a job\nCall the cops, find a dog\nCause if I make a call, then the people who care about you\nWill never, ever, ever, ever find you at all\nAw naw! hell naw! I done up and done it\nFootball hundred, Crimson Tide, hand me a hundred\nYelawolf's raw, yeah he's done it\nBut I can't afford to lose this gold\nIt’d be like drivin’ a Ford to the show\nI’d rather walk and get my Chevy towed\nTo the front door of the bar, I stroll!\n\n(Hook)\n\n(Verse 2: Rittz)\nHammertime, a Jack Daniels is an old friend of mine\nI bought my lady friend a gin and lime\nI’ve got my hand on her panty line\nWe took a pill so the feeling gets simplified\nI snort a Zanny line and feel the drainers drip\nHard liquor when I’m sippin’, we don't baby sit\nDrunk, spittin’ like an infant on a baby’s bib\nI could get hit by a freight train and live\nBut chicks, I’mma go hammer - I'mma go slam her\nTry the Crown Royal with a little Goldschläger\nDude wanna go run us, mouth full of shit\nI'mma bust him in the head with his SoCo bottle\nHe gon' need some cold water and a pack of ice\nI ain't no role model, got a bag of white\nWe bout to chop it out, we hoppin’ out\nThat’s somethin’ old school, drivin’ drunk, fuck the flashin’ lights\nWe go HAM!\n\n(Hook)", "title": "Hammertime"}]}