{"songs": [{"image": "https://images.genius.com/3407e464b90665cb8b7267df3541d089.500x500x1.jpg", "title": "Esco Let’s Go", "album": "The Nigger Tape", "year": null, "lyrics": "[Intro]\nEsco let's go\nEsco let's go, c'mon\nEsco let's go, let's go, let's go\nEsco let's go, yeah, c'mon\n\n[Verse 1]\nI used to drive in a circle before I pulled up\nNow I just go up, they know when I got it tucked\nTip the door man, racist neighbors flinching\nThey don't know if I'ma rob 'em or if I'm Russell Simmons\nThey thought it was me, just like Mike Bivins\nThey pray for my downfall like the mom of Robin Givens\nWatching how you living\nI just wanted to roll B-L-U-N-T, and watch B-E-T\nPicture Amerie eating Free\nI'm trying to write hood movies, like Posse and Five Heartbeats\nI'm all inside a dark room\nMy incense smoke took the form of ghost and it spoke\nIt said, \"Nas, you the best on both coasts, you so big\nYou should write the word slave\nOn both sides of ya beards like Prince did\nSo what's this? Fuck St. Nicholas\nYou the only ghetto nigga in the hood giving gifts\"\n\n[Chorus]\nWHAT IT IS!\nEsco let's go (bra tat ta tat tat tata tat bra tat)\nEsco let's go, c'mon\nWHAT IT IS! WHAT IT IS!\nEsco let's go (bra tat ta tat tat tata tat bra tat)\nEsco let's go, c'mon\nWHAT IT IS! WHAT IT IS!\nEsco let's go, let's go, let's go (bra tat ta tat tat tata tat bra tat)\nEsco let's go, let's go, let's go\nWHAT IT IS! WHAT IT IS, NIGGA! Esco let's go, yeah\nWHAT IT IS, NIGGA! WHAT IT IS!\n\n[Verse 2]\nI jump in the shower, it feel like rain\nEverybody wanna be king but can't handle the pain\nUsed to rap now they all wanna sing\nAsk Elizabeth Taylor, when did ice turn to bling\nShe said, \"Nas, it 'cause y'all rock tiny diamonds in the biggest chains\nYou the first nigga in the game that said fuck fame\nYou the 5th nigga in The Beatles\nYou the 10th nigga in the Wu-Tang, so nigga let yo' nuts hang\"\nBut they can't handle it, I'm scandalous, I'm trifling\nThat's why I'm wifing 'em, quick to stick a knife in 'em\nCatch me thinking, drinking, hurting my health\nThese women keep trying to unloosen my belt\nTrying to get my wealth\nI feel like Jesus with doubting Thomas', broken promises\nI wanna walk the golden streets like where my mama is\nBut if I do what y'all want, I'll get a thousand years\n\n[Chorus]\nWHAT IT IS!\nEsco let's go (bra tat ta tat tat tata tat bra tat)\nEsco let's go, c'mon\nWHAT IT IS! WHAT IT IS!\nEsco let's go (bra tat ta tat tat tata tat bra tat)\nEsco let's go, c'mon\nWHAT IT IS! WHAT IT IS!\nEsco let's go, let's go, let's go (bra tat ta tat tat tata tat bra tat)\nEsco let's go, let's go, let's go\nWHAT IT IS! WHAT IT IS, NIGGA! Esco let's go, yeah\nWHAT IT IS, NIGGA! WHAT IT IS!\n\n[Verse 3]\nStaring at the face of my watch\nIt's like a crystal ball with the ability to make the issue stall\nI told my man duck 'cause I know where the missile fall\n'Cause the ice is a fortune teller for the rich and small\nWent to my man crib who dead and saw his picture fall\nI picked it up his voice whispered, \"nigga ball\"\nSo I smoke the finest, 85 footer ocean liners\nI do it for the have nots of mad spots\nThat resemble screensavers on your laptops\nAnd niggas can't believe it like seeing that nigga Zab drop\nI'll be in Cameroon, bandanas on silk Dior\nSip cream liqueur, green and blue Fila velour suits\nBoss move, only thing that I endorse duke\nStash houses, gamble, I don't sweat a loss duke\nAll true and living, God, we was here first\nParisian linen garb and Kashmir shirts\n\n[Chorus]\nWHAT IT IS!\nEsco let's go (bra tat ta tat tat tata tat bra tat)\nEsco let's go, c'mon\nWHAT IT IS! WHAT IT IS!\nEsco let's go (bra tat ta tat tat tata tat bra tat)\nEsco let's go, c'mon\nWHAT IT IS! WHAT IT IS!\nEsco let's go, let's go, let's go (bra tat ta tat tat tata tat bra tat)\nEsco let's go, let's go, let's go\nWHAT IT IS! WHAT IT IS, NIGGA! Esco let's go, yeah\nWHAT IT IS, NIGGA! WHAT IT IS!"}], "artist": "Nas"}