{"artist": "E-40", "songs": [{"title": "Dey Ain’t No", "image": "https://images.genius.com/b52b581f902f3353abd2c96694363546.800x800x1.jpg", "album": "In a Major Way", "year": "1995-03-14", "lyrics": "Zap board beneath the ashtray, woofers in the back\nWater in the duals make loud glass pack\nGold tippy toes without a lick of chrome\nBought a set of Vogues and left the, stickers on\nSeven grand worth of bump for the trunks\nPaid cash, all ones\nSome old bitch came up to me and said, \"What's the latest, bro?\"\nI said, \"I'm tryin to have more chips than Las Vegas, ho\"\nShe said, \"Can I roll with you? I get the dicks hard\"\nI said, \"You gon' work the strip, Sonoma Boulevard\"\n\"How much would I make?\" I said, \"Mega\nJust bring me back my scrilla scratch paper\"\nHeart (heart) money (money) street (street) hustle\nSex, drugs, smuggle, bubble\nHorns, yellin, speakers, subbin\nSound just like the inside of a club, and...\nHow many times could a Conrad come so buttery?\nAlways on to' back, have people lovin me\nAlcoholic drunk that ain't no gimmick, B\nI'm always in and out the Betty Ford clinic, see\nDrug paraphernalia cream butterscotch\nIllegal like a garbage of hubba rocks\nWorkin off my pager, you know the ropes\nI'm makin that cabbage cornbread like Oprah\nDiamond satch-uels from ja-fuckin-home\nPose just like a pimp smokin a honey blunt\nIn a Major Way I tried to told ya\nNiggas had my shit fucked back in the days but now they know'a\nSold a bunch of units underground\nThey was bumpin Save a Hoe in every town\nRumor has it that I died, I got smoked, mayne\nBut I'm alive, they was talkin about somebody else, mayne\n\n*chorus*\nWe say dem niggas P.H\nBut dey really ain't knowin, dey ain't no\nMe rather stack more papes\nAnd steady get to bubblin, yeah fa sho'\n\nRevenues, on my mind\nI can't hold back, now's the time\nBust a dope addict crack fiend in the jaw\nFool had his spook on, tried to steal my car\nDa Bay, where hoes be janky, sheist\nAnd niggas, do so much dirt we got lice\nPrices, go up and down like a teeter-totter\nFilthy shit, ring around the collar\nJust the other day I heard a Bootsy nigga shout\n\"Man that nigga don't be doin all that damn shit he talk about\"\nFools think they know me think they got me figured out\nBut NIGGA... NIGGA!?!?\nI plays this shit for bread and meat\nSo nigga if you feel froggish leap\nI don't smoke dog food, sherm, loop or snow\nBut I leave a trail of bidis everywhere I go\nSo tell a friend like Alpha Beta\nI'm gonna get it like T.C. the money maker\nI know you're with it\nMayday mayday, unexplained object coming your way\nBreaker breaker it's E-40 bitches call me the ahh\nBallin ass, tycoon talkin big wheeler\nMoney hungry, penny pinchin stingy nigga\nOn the sc-rilla, always on the go, get a\nSuper bad and we can split her\n\n*chorus*\n\nMe have no time for de bullshiters (4X)"}]}