{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "Pain", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[DIALOGUE]\nTRU (w/ (sample)): Damn, everything getting cold. 'Cept for them bullet holes. That's the only thing hot... Why the fuck did he had to do this to me? (PAIN!) Why? Damn. Hmmm. (PAIN!) shit...\n\n[Verse 1: Sha/Tru]\nThis is how it's all gon' end, fuck that\nYou bust at me? I'm busting back again\nFeel the heat, ain't no way that you gon' fuckin win\nShiiiiit, I set fire to a fucking friend\nFried in the end, you think of death, you gon' think of me\nWith your last breath, it's how it's got to be\nThe shell brought me closer to my God-to-be\nHell brought me closer to my soul set free (PAIN!)\nIt's so much pain I'm almost giving up\nPhlegm mixed wit blood is what I'm bringing up\n\"I hope I don't die\" is what keep ringing up\n\"You better off dead,\" is what somebody saying\nNow nigga, hold your head up, I'm only playing\nNever prayed before, but I'm praying now (PAIN!)\nSeen a flash of light and I'm going down\nThe last thing I seen, the crowd was gathering round (PAIN!)\n\n[Interlude]\n[*crowd sounds, EMT sirens*]\n(PAIN!)\n\n[Verse 2: Breeze/Tariq]\nIt got real with hot steel coming in\nCutting and jigging, digging deeper, aching\nKeep awaking, the rest is long, but goddamn it\nThe pressure's strong, fucking pain, clutching my brain\nTouching the vein's arteries, bleeding heavily\nPart of me leaving steadily, getting harder to breathe\nAnd yet I be still alive, I'ma make it, I will survive\nI'ma take it to the next level, yo, I'm wilding\nDo the vexed devil know my styling?\nHeld down, hell-bound gravity having me sinking\nThinking I'm a motherfuckin' man (PAIN!)\nGot a brother stuck in a jam, drive my son\nA buck and a scam, getting me, wetting me, crimson drenched\nIn my mind, son, I find some hymns entrenched\nA lot of mournful, faint humming\nTomorrow's dawn, I swear that shit ain't coming\n\n[Outro]\n(PAIN!)\n(PAIN!)", "year": "1999-02-23"}]}