{"artist": "360", "songs": [{"album": "Vintage Modern", "year": "2017-10-27", "title": "Letters", "image": "https://images.genius.com/0bffd97fa0b451a138d7a789b09aaba0.1000x1000x1.jpg", "lyrics": "[Chorus]\nI believe you become who you were\nWhen you're old, but you get it quite late\nMr Future can you send a letter my way?\nI'ma have a guess what the letter might say\nIf you could see who you were to become\nDo you think you would do the same thing?\nWhen it comes to girls would you play the same game?\nWhen a baby girl's gonna take on your name\n\n[Verse 1]\nIf the future you could go and write a letter to yourself\nImagine all the shit that it'd say\nMakes me wonder if you reckon it'd help\nIn the way that you treat girls and the different it'd make\nI wonder if you would switch it up and respect women\nInstead of tellin' all these lies just for sex with 'em\nThere's nothing wrong with having sex, but what's being a dog\nIs you leadin' 'em on just so you'll get with 'em\nWould you hit then kick her out so she's all alone\nInstead of doing what's really right and walk her home?\nWould you call 'em bitches? Would you call 'em hoes?\nOr would you be riddled with guilt that you called 'em both?\n'Cause when you go and have a baby girl you call your own\nThose words, what if someone went and called your daughter those?\nI know learnin' from your past is important though\nI just think there's certain little things that you oughta to know\n\n[Chorus]\nI believe you become who you were\nWhen you're old, but you get it quite late (quite late)\nMr Future can you send a letter my way? (my way)\nI'ma have a guess what the letter might say\nIf you could see who you were to become\nDo you think you would do the same thing? (same thing)\nWhen it comes to girls would you play the same game? (same game)\nWhen a baby girl's gonna take on your name\n\n[Post-Chorus: Carl Dimataga & Whalan]\nMaybe I will see you later\nI'll see you later\nMaybe I will see you later\nI'll see you later\n\n[Verse 2]\nWhen you're young as fuck you run amok, always fuckin' something up\nIt's funny though, that attitude eventually will come undone\nIf your stomach's rumblin' and churning like there's something up\nThat's the beginning of you learnin' how to trust your gut\nIf you're hurtin' just be open, never suck it up\nForce it out, homie, 'cause there's none above your mothers love\nBack up what your brother does, always bring each other up\nMake sure your father's proud of everything his son's become\nI realise your guard's up and that you stubborn, but\nListen to your fam when they tellin' you you fuckin' up\nBelieve in yourself with no doubt, you're number one\nFuck shootin' for the fence, go ahead and touch the sun\nWhen it comes to life, if I had to go and sum it up\nThe meaning of it all to me is simple: love and love\nI know [?] shit can sound corny though\nTo me it's real as fuck and somethin' that you oughta know\n\n[Chorus]\nI believe you become who you were\nWhen you're old, but you get it quite late (quite late)\nMr Future can you send a letter my way? (my way)\nI'ma have a guess what the letter might say\nIf you could see who you were to become\nDo you think you would do the same thing? (same thing)\nWhen it comes to girls would you play the same game? (same game)\nWhen a baby girl's gonna take on your name\n\n[Post-Chorus: Carl Dimataga & Whalan]\nMaybe I will see you later\nI'll see you later\nMaybe I will see you later\nI'll see you later\n\n[Outro]\nSo when you go and find your own wife you need to have your own lives\nHave each others backs so you both strive, ayy\nWhat's so important though is having your alone time\nBut even more knowin' that you don't mind, ayy\nA life you cosign, live's that you both like\nNever watchin' life as it goes by, ayy\nWhat you got together's crucial that you both thrive\nOtherwise the shit is gonna nosedive, ayy"}]}