{"songs": [{"title": "Thug 4 U", "image": "https://images.genius.com/61847e5352bc257ae9aaf0d6d7eb98d9.1000x1000x1.jpg", "year": "2017-10-20", "album": "First Night Out", "lyrics": "[Intro]\nDo you think we need one more?\nYou think we need one more\nAlright, we'll get one more\nOoh ah, ooh\nOoh ah, ooh\nOoh ah, ooh\nOoh ah, ooh\n\n[Chorus]\nBaby let me thug for you\nLet me make sure nobody don't fuck with you\nYou might be around a thug or two\nYou might be around a plug or two\nBaby let me thug for you\nLet me make sure nobody don't fuck with you\nYou might be around a thug or two\nYou might be around a cuz or two\n\n[Verse 1]\nHave you drippin' 'fore I kiss it (ooh ah, ooh)\nCome hit a mission with a nigga (ooh ah, ooh)\nFaceTime while you rub it (ooh ah, ooh)\nMama's boy but I be thuggin' (and I really really love it)\nGotta get the bag, ayy\nGet the bag, keep a bag\nAin't comin' home by eight but I for sure make sure you straight\nIt ain't nothin' like she dated when a real one coming over\nShe get hectic, hit my line, guess who comin' with the blower\nBoo you good?\n\n[Chorus]\nBaby let me thug for you\nLet me make sure nobody don't fuck with you (yes)\nYou might be around a thug or two (yes)\nYou might be around a plug or two\nBaby let me thug for you\nLet me make sure nobody don't fuck with you (that's what's up)\nYou might be around a thug or two\nYou might be around a cuz or two\n\n[Verse 2: 03 Greedo]\nBaby let me put some thug in you\nKnow I'm high so let a nigga put some drugs in you\nShe a square but she be fuckin' with the drug dealers\nPlus I heard her daddy was a thug so I stuck with her\nI put that molly in my mud when I fuck with her\nShe slow it down and speed it up, I fell in love with her\nAin't eat her out, I beat it up, she expected me to cuff\nI'm nothing like your man, I'm too much realer\nWon't trick but I got you\nYou just my lil partner\nAnd fuck what they say\nThese people just poppin'\n\n[Chorus]\nBaby let me thug for you\nLet me make sure nobody don't fuck with you (yes)\nYou might be around a thug or two (yes)\nYou might be around a plug or two\nBaby let me thug for you\nLet me make sure nobody don't fuck with you\nYou might be around a thug or two\nYou might be around a cuz or two\n\n[Verse 3: Problem]\nHad to remind her like you know who you fuckin' with?\nMister international, bitch you still on fed\nZone four on a ho, what the fuck is big?\nI do it gigantic, my pimpin' titanic\nBitch I been braggin', ain't shit happenin'\nWith your funky ass\nThem square niggas you was fuckin' with might let it pass\nOnly time I'm pullin' up is to collect my trap\nIf I'm getting out of bed better be some cash\nPut my Fila's on\nI spent a hundred thousand just on Regal chrome\nSittin' on them fours, daddy lookin' like a beast\nSittin' on them fours, daddy lookin' like a beast\nBaby say she like it when I flex on her\nFuckin' with the yacht, I blew a check on her\nTold the homies she my bitch and I'ma keep it cool\nNigga out of line, I'ma do the fool (yes)\n\n[Chorus]\nBaby let me thug for you\nLet me make sure nobody don't fuck with you\nYou might be around a thug or two, shit\nYou might be around a plug or two (that's what's up)\n\n[Outro]\nOoh ah, ooh\nOoh ah, ooh\nOoh ah, ooh\nOoh ah, ooh"}], "artist": "03 Greedo"}