{"songs": [{"image": "https://images.genius.com/75a265916a97836aa5ab08c709a44211.1000x1000x1.jpg", "album": "PSYCHODRAMA", "title": "Screwface Capital", "lyrics": "[Intro]\nAnd I want you now with me\nAnd I want you now with me\nAnd I-\n\n[Verse]\nI made a link with the Russians\nSix figure discussions, dinners in public\nMy linen all tailored\nMy outstanding payments swift like Taylor\nAnd boy I owe 'dem men a beatin'\nBut don't watch what I'm makin'\nJust know I put both of the P's in opp\nAt the same time, I put the \"pay\" in paigon\nMan wanna beef, don't know what the stakes is\nBroad daylight, do a nigga want a day shift?\nThree scales got 'em livin' on basic\nMy location changes quicker than gears on a brand new Porsche Cayman\nI told RJ put down the line and he did\nBut he's got another three like H's\nI gotta watch for the greed and the hatred\nI'm sayin' who's on votes?\nWe hit up a nigga and see who's on smoke when it's that time\nYou can run that shit there and it's cool but you can't hear like a bad line\nIt's been fifteen minutes since me and her fucked and I'm sayin' \"What you still in the house for?\"\nGirls say I'm rude but they won't never leave, 'cause you know the jab right like southpaws\nOutdoors, me and my niggas are all outlaws\nI tell a man speak with respect\nHow you gonna say that we beef with your chest\nLike Sergei didn't G-lean on your set?\nI do not have one neek as a friend\nIf it's beef on the ends than it's bleaker for them\nThis ting's comin' like Pokemon GO\n'Cause I see man once, never seen him again\nMan don't really wanna walk to the shop\nOr jump in the train 'cause the ends got tension\nOne eye on my opps, two eyes on my friends\n'Cause at least my opps, man knows their intentions\nI turned a loss to a lesson\nI turned a curse to a gift and blessing\nAny girl that I've got an interest in\nFace interesting, body impressive\nI got ninety-nine out of a hundred marks in class on my English questions\nI'd get the same if I did it again 'cause I still don't know the definition of restin'\nI've put blood in, I've put sweat in\nI shed tears when my niggas got sentenced\nI spent years with my niggas in Streatham\nBut you wouldn't know that 'cause you don't live this\nWhat have you done for your siblings?\nI made sure that the family's sweet\nSo many days that I starved myself just to make sure that my whole family eats\nThe Merc is a beast and I'm blackin' it out\nOne point nine on the plan for a house\nI ain't got a memory of when dad was around\nStill a child when I turned man of the house\nTell me what you know about a bag full of bills\nAnd your mom crying out, saying, \"Son, I can't take it\"\nAnd then staring in the mirror for an hour\nWith a tear in your eye like, \"I gotta go make it\"\nEver seen a good friend turn paigon?\nA pretty girl glow down, turn basic?\nEver seen a nigga 'nough man rated\nLosing his mind 'cause of food that he's takin'?\nYou're either a lamb or you're Hannibal\nGood kid but I grew up 'round animals\nNo chick can't tell me about attitude\nI got girl from the Screwface Capital\n\n[Outro]\nAnd I want\nAnd I, and I\nAnd I, and I, and I, and I\nAnd I want, and I want\nAnd I want\nAnd I, and I\nAnd I, and I, and I, and I\nAnd I want, and I want\nAnd I want\nAnd I, and I\nAnd I, and I, and I, and I\nAnd I want, and I want\nAnd I want\nAnd I, and I\nAnd I, and I, and I, and I\nAnd I want, and I want", "year": "2019-03-08"}], "artist": "Dave"}