{"songs": [{"year": null, "title": "Nobody Cares", "image": "https://s3.amazonaws.com/rapgenius/1374583262_saigon.jpg", "lyrics": "[Hook: Saigon] (x2)\nWhat's really, really crack?  What's really, really dope?\nWhat's really, really sad is we don't really have hope\nWhat's really, really hood?  What's really, really there?\nSad shit about it, nobody really, really cares\n\n[Verse 1: Saigon]\nThey opened up another Chinese place as if we needed one\nLike we can't get a hold of Chin-Wong\nHe in the hood with the egg foo young.  Kennedy Fried\nStay open ‘til five.  Look, guys, open your eyes\nWe can't survive when people come in our neighborhood and ride\nWhile we fall like the towers hours after Bin Laden's surprise\nKnowledge is magnemetized—niggas gonna to cling to the truth\nWhich is every word that I sing in the booth\nI gotta watch the shit I bring to the youth\nRap is affecting the hood—my little cuz Nate slinging is proof\nI used to listen to Onyx and think I had bionics\nDre made me say, “Fuck my book.  Where the fuck is my chronic?”\nThe funny shit is it's a white man that always behind it\nHe turn a [noggin-hit?] relation into his economics\nAnd it's a promise ‘til I'm dead and gone (What?)\nWhen that revolution come, I'mma be good and ready to get it on (Get it on!)\n\n[Hook: Saigon] (x2)\nWhat's really, really crack?  What's really, really dope?\nWhat's really, really sad is we don't really have hope\nWhat's really, really hood?  What's really, really there?\nSad shit about it, nobody really, really cares\n\n[Verse 2: stic.man]\nA lot of [busters?] be claiming that they military-minded\nBut real is not an image—it's the substance behind it\nPulling out your pistol in your own neighborhood, stunting\nEndangering the babies on the block—that ain't about nothing\nThe OGs say the gangs used to be about something\nThe street life had honor and code; now, we just fronting\nIs it rap that got us acting like that?\nOr the conditions we live in that got us cornered and packed?\nUp in the prisons, politicians running ‘round with these rappers like mascots\nSo they can hijack the have-not vote in the ballot box\nNow I'm anti to Bush agenda but I remember\nIt was Bill Clinton that took welfare.  Do you remember?\nWhat's really hood with these MC wars?  Inflated egos\nActing like some gossiping hoes—that shit is weak, yo\nI focus on stacking this paper, setting the power\n‘Cause if we ain't controlling the hood, then it ain't ours\n\n[Hook: Saigon] (x2)\nWhat's really, really crack?  What's really, really dope?\nWhat's really, really sad is we don't really have hope\nWhat's really, really hood?  What's really, really there?\nSad shit about it, nobody really, really cares", "album": null}], "artist": "Saigon"}