{"songs": [{"year": null, "title": "Mr. Cool (That Ain’t Cool)", "image": "https://images.genius.com/dacb6f69fe5b86a67f2ad154712c7ba5.404x404x1.jpg", "lyrics": "Who, you?\nYou ain't cool\nHell nah\nYou?\n\n[Verse 1]\nYou ride around in the Benz with the shiny rims\nThe same one on the bedroom wall of little Jamal\nHe wanna be just like you, he want the motorcycle\nThe rifle, the culture cipher you guzzle\nThe wives that you juggle\nYeah, he hear about the pies that you smuggle\nYet all he see is the glamor\nGive a damn about the lives that you trouble\nGet ready for little you\nYou creating a fool\nHe even heard that you be fucking with wolves\nBut still think you so\nCool\n\nYou need to be taking shorty to school\nYou ain't cool\nYou's a motherfucking fool\nYou need to be dropping shorty some jewels\nYou ain't cool\n\n[Verse 2]\nYou in the studio rapping how you gon make it rain\nYou need to ask the man in the mirror to make a change\nYou rocking red and soo wooing like you relate to gangs\nYou ain't banging, you be hanging down at the Laker game\nThese rap niggas the definition of tough herbs\nWhen they rhyming they turn to hustlers, quick to bust birds\nSee em in they video wilding, spitting cuss words\nDirector yell cut, turn back to a bitch with a dust nerve\nIt'd be easy to make this sucka take his chain off\nJust to prove to him we ain't cut from the same cloth\nYou the white man's mule, just a popular fool\nSupposed to be using hip hop as a tool\nYou ain't cool\n\nYou play the game but you don't play by the rules\nThat ain't cool\nMan, you's a motherfucking fool\nThe ghetto's on fire, you adding the fuel\nThat ain't cool\nNah\nCheck\n\n[Verse 3]\nYou on the television bragging bout your better living\nHow you the wife of a baller and you get recognition\nYou know being independent's a much better decision\nYou groupies the reason niggas lose respect for the women\nAnd all these reality shows that expose\nThese women for who they are, and make em look like hoes\nA shame what a bitch'll do for some views\nFor sleeping with dudes\nYou think you win but as a people we lose\nThat ain't cool\n\nCan't have my daughters looking up to a flooz\nThat ain't cool\nYou's a motherfucking fool\nPut your value in some red bottom shoes\nThat ain't cool\n\nCheck, check it out\nYes\nSaigon\nYeah yeah, good guy gang\nWe here to stay\nScram Jones, Saigon, we back\nKicking reality rap\nNahmsayin it ain't ever gon stop, good guy gang\nHa ha, S to the", "album": "Warning Shots 3: One Foot in the Grave"}], "artist": "Saigon"}