{"songs": [{"year": null, "image": "https://images.genius.com/91a6e6737bc2d3a1a3bd88e759fca43f.302x300x1.jpg", "title": "Feelin’ Lovely", "album": "The Beginning and the End", "lyrics": "Yeah, its going down.. 7th sign film slash records in full motherfucking effect (yes sir) please believe it nigga, bizzy the kid, midwest cowboy\n\nSippin muggle, feelin lovely, dizzy smokin sticky icky, in every city my ni***s rollin wit me, strapped up on me, yaheard i got kicked out of bone thugs n harmony? what u thinkin, im a soldier, survive, the ugly, dont come around me if u whiskin 4 money i ain't got it, u kno i just got out of the jail? (what?) they put 2gether my bail and im still runnin from the popo, ridin wit the top down, top down, purple haze, makin my shift, hittin snitches and let the six four drop down, drop down, jealous ni***s callin me a son of a whooOO!!\n\nAnd i be runnin from the police, all week\nWe bin drinkin and smokin rollin them swisher sweets\nWhen we get up in the club they tell us 2 leave\nIts something about liqour make u c enemies (who is that?) [Wrong i think..]\nMy body luv drinking hennesy\nAdrenalin pumpin im thuggish ruggish with energy\nHeaven is where we wanna be!! and money is what we wanna see!!\n\nI got them bullets that'll move ya body, body!!\nPut em in a gangster like hasta~la~vista\nI'm ghetto like [gostos for mostas [or something..]]\nIts time for the four, hail ceaser\nWalk through here with the gasoline jacket, snatchin the reefer\nGotta go, go, fresh out of the county, steady as we grow\nAll of my ni***s is dead.. and im bein questioned by the feds\nLet me know what they said ,enemies sleepin in my bed\nThis was written by my bishop wit this vision in my head\nHey, let me c u left marsh, do it for death charge\nI can feel the vision wit my company in red\nLet me know what they said, cuz they fake like they my friends\nIts the jealousy in them, and the zealousness in them\nAnd u can tell em once again, i, my people winnin\nU can choke and it [??] seemless sprees is spinnin\nGot this skeez blending breeze, i make a week at the knees\nI mean literally, i make a week at the knees!\n\nChorus 2 times"}], "artist": "Bizzy Bone"}