{"songs": [{"image": "https://images.genius.com/7120e2a45934c823e3314d9acc9c011d.700x630x1.jpg", "year": "2013-01-01", "lyrics": "[Hook: Akon]\nIt’s a dirty job but somebody’s gotta do it\nI see you working go and put your back into it\nBaby I’mma watch… you, just keep it moving\nYou know exactly what you’re doing\nSo go and do your dirty work\nGo and do your dirty work\n\n[Verse 1: Akon]\nAss up\nFace down\nPerfect body and she lay it to the ground\nStacked up\nWaist down\nWanted to throw it like a pitcher on a mound\nI see them niggas reaching for their last dollar\nAsking dumb questions like “baby, do you model?”\nPromising everything, hopin’ that they follow\nPraying for America, I hope they down with Harry Potter\nIsn’t she the most beautiful thing that you ever saw?\nDon’t she deserve the biggest diamond ring that you ever bought?\n\n[Hook]\n\n[Bridge]\nGettin’ down dirty, gettin’ down dirty, gettin’ down...\nGo and do your dirty work\nGettin’ down dirty, gettin’ down dirty, gettin’ down...\n\n[Verse 2: Akon]\nBack up\nShake down\nJust give it all to me and do it right now\nShack up\nTake down\nJust wanna love you without looking' like a clown\nYou’re the best that ever did it\nYou’re killing everybody, how're you supposed to make a living?\nYes I know you hear it all when they trickin'\nI can hear them niggas saying you too pretty to be strippin'\nIsn’t she the most beautiful thing that you ever saw?\nDon’t she deserve the biggest diamond ring that you ever bought?\n\n[Hook]\n\n[Bridge]\n\n[Verse 3: Wiz Khalifa]\nMore money, more problems, less rest\nIf it’s about a dollar later, shorty, let’s invest\nDrop the top, pull the whip out like a hamstring\nYou on your job but I’m a boss, I keep my hands clean\nKeep grabbin' all up on my coat\nI’m lettin' out all of this smoke\nI’m thrown' money in the air\nI’m buying' bottles for my folks\nAnd then I’m coming back for more\n‘Cause you know all my favorite features\nI'mma roll some of this reefer\nYou can call me Young Khalifa\n\n[Hook]\n\n[Bridge]", "title": "Dirty Work", "album": "Stadium"}], "artist": "Akon"}