{"songs": [{"year": "2018-12-07", "album": "Subtle Meditation", "image": "https://images.genius.com/06c2afa0f8860f128094b4fd2880238d.668x668x1.jpg", "title": "Deep Blue Sea", "lyrics": "[Chorus]\nOne false move and you might trip\nYeah you might slip, fall into the traps they set\nIt ain't a game if you thought it was\nNigga they ain't playing fair, how you think they won?\nYou better keep your eyes wide and your mind sharp\nKeep your head on a swivel when you at war\nLeakin' blood in the water with the great white sharks\nIt gets crazy in the dark especially when you got no heart\n\n[Verse 1]\nNo love, my soul cold as a icebox\nThe pain wore me out like a carhartt\nMy paranoia kicking in, the only thing I feel is numb\nI don't trust my mothers sons, I don't fuck with anyone\nThink I seen too much, think I done too many drugs\n8 hits of acid buggin' out in the hot tub\nFantasize, bout nooses round my neck until I breathe less\nMy sanity's on recess\nAll I got is regrets\nAll I do is regress\nYou can say I'm depressed\nDrowning in the deep end, strugglin' I can't swim\nSwinging for the fences but I'm feeling like I can't win\nI make the same mistakes over and over, and over again, damn\n\n[Chorus]\nOne false move and you might trip\nYeah you might slip, fall into the traps they set\nIt ain't a game if you thought it was\nNigga they ain't playing fair, how you think they won?\nYou better keep your eyes wide and your mind sharp\nKeep your head on a swivel when you at war\nLeakin' blood in the water with the great white sharks\nIt gets crazy in the dark especially when you got no heart\n\n[Verse 2]\nMy manuscript and memoirs reads thus\n\"Here lies the body of a nigga that's hopeless, and basically gave up\"\nThe cash ain't changed much\nI still never dealt with all the shit that I bottled up\nI'm coming loose at the seams, can't get my shit together\nLive in paradise but all I see is this bad weather\nGot everything I wanted but I still feel hollow\nMy biggest fear today is that I'll wake up tomorrow\nPremonitions of death, this time I'm living is borrowed\nI got all of these blessings but yet I still feel sorrow\nOnly person that I like to talk to is myself\nToo many voices in my head, not one of them help\nI used to think it was being broke so I wanted wealth\nBut then I finally realized I'm forever lost, this another epilogue\nWe'll see if I make it to the next episode\nWill I stay? Will I go? I don't know\n\n[Chorus]\nOne false move and you might trip\nYeah you might slip, fall into the traps they set\nIt ain't a game if you thought it was\nNigga they ain't playing fair, how you think they won?\nYou better keep your eyes wide and your mind sharp\nKeep your head on a swivel when you at war\nLeakin' blood in the water with the great white sharks\nIt gets crazy in the dark especially when you got no heart"}], "artist": "K.A.A.N."}