{"songs": [{"year": "2019-03-12", "image": "https://images.genius.com/632cbe474a2ab6a525c2a0da36a43d67.1000x1000x1.jpg", "title": "House Party", "album": "I Am Me", "lyrics": "[Intro]\nFr-Fr-FreshDuzIt on the beat, bitch\nYou know I'm fresh, you know I'm fresh\nHah, hah\n\n[Chorus]\nParty in my house, turn it to a club (Club)\nDiamonds in my mouth, that's at least a dub (Dub)\nHe was dissin' for some clout, caught him in the club (Fool)\nPut that .40 to his mouth, let him taste a slug (That's on my mama)\n\n[Verse]\nHuh, I'm designered down, don't you see me in it? (In it)\nI got them hoes lined up like a clinic (Lined up)\nHoes talk to me, they jock, they can't finish they sentence (Word)\nFuck that, plug just told me the pack gon' touch down, 22 minutes (It's cool)\nHeard he got the work in-house, call me Emmitt Smith how a nigga run up in it (Yes)\nKevin McCallister, I'm in the Challenger lookin' for the whip bandits (Word)\nI got the racks on me, used to play tennis, I got them customers, Dennys and Lenox (Huh)\nI'm a hood nigga, baby, I'll still eat a four for four from Wendy's (Yeah, yeah, yeah, yeah)\nFour for four, fresh from head to toe, nigga say he a shooter, he over for (Woah)\nDo-si-do, out the bow-si-bow, nigga lyin', his daddy Pinocchio (No)\nWhere the tiles? These niggas got no flows (Blow)\nOn the east, bitch, we run from the po-po (Yoom)\nThis nigga say he got bands, well, he had them bands until he went solo (Solo)\nSmokin' dope, my eyes so low (Gas)\nYou fresh, bitch, I know so (Know so)\nThese niggas so broke, they pick it up, put it down 'cause the total (Broke)\nHit your bitch from the back like a wreck, when she tap out, that mean she totaled (Totaled)\nBook her out just to come to the city, kill 'em in the city, call that shit a no-show (Doon, doon, doon)\n\n[Chorus]\nHuh, party in my house, turn it to a club (Club)\nDiamonds in my mouth, that's at least a dub (Dub)\nHe was dissin' for some clout, caught him in the club (Fool)\nPut that .40 to his mouth, let him taste a slug (That's on my mama)\n\n[Outro]\nHuh, I'm designered down, don't you see me in it? (In it)\nHuh, I'm designered down, don't you see me in it? (In it)\nI'm designered down, don't you see me in it? (In it)\nI got them hoes lined up like a clinic (Lined up)"}], "artist": "BlocBoy JB"}