{"songs": [{"lyrics": "Yeah, I know you just ripped the packaging off your CD\nIf you're like me, you're reading the credits right now\nIf you're in your car, I don't care if it's winter\nI want you to put all your windows down ... zone out ... buckle up ... let's go ...\n\n[Verse 1]\nHello, it's Hova\nThat's right youngin, the wait is over\nThe new millennium is upon us, the album is here\nBefore we get into this shit let's get a few things clear\nRappers with no relation, that's 7 degrees of separation\nAnd I'm Kevin Bacon\nThis is the murderous version\nJigga the shit, even when he rhyme in third person\nHova the god, I should be rapping with a turban\nHaters can't disturb him, waiters can't serve him\nMike Jordan of rap, outside j workin'\nNow watch how quickly I drop 50\nI don't like playin', niggas can't stick me\nNiggas cannot jam me, niggas can't get me\nSlimmie at the Rucker wanna leave and spend with me\nI consistently take 'em out the park like Ken Griffey\nDo you believe? It's Hova the god ...\n\n[Verse 2]\nWell I'm the ghetto's answer to Trump\nI'm cancer to The Hamptons\n$20 million of guap, ransacking mansions\nIncrease the noise pollution soon as I land in\nDon't even trust uppity white folk, keep the cannon tucked\nNiggas try to lean on Jay, shots gonna stand you up\nGlocks gon' pop, y'all not understanding much\nI hustled for the ducats, well now I hustle for the rush\nLike fuck it, baby, I just love it\nChicks now, say they like the way I thug it\nSince my album dropped, my stock rose ... like I went public\nLadies, I love y'all, but I love my freedom more\nI love my niggas, love to see them ball\nI love Beans and Bleek\nThem niggas like my Peter and Paul\nMy disciples\nAnd that's right, we're coming for the title\nDo you believe? It's Hova the god ...\n\n[Verse 3]\nWhoever thought young Shawn Carter would change the game?\nUsed to rap to the raindrops off my window pane\nDuckin' the plain cops, pushing indo and 'cane\nAt the kitchen table, late night, no pen, just my brain\nFirst album, niggas loved me 'cause they thought I was poor\nGuess I'm successful, industry don't love me no more\nBut I'm the same nigga from your corner, bubblin' raw\nSkully tilted, pants saggin', damn near touching the floor\nAnd I come with do-rags to your so-called awards\nT-shirt with my chain out, like fuck y'all all\nRetrospect, ain't been the same since I lost my dad\nHe's still alive, but still, fuck you, don't cross my path\nA&Rs had me feelin' like Moss in the draft\nSo I turned the league out with Reasonable Doubt\nGet your CDs out\nLet's go song for song\nI'm the illest nigga doing it 'til y'all prove me wrong\nDo you believe?\nIt's Hova the god ...", "title": "Hova Song (Full Version with 3 Verses)", "image": "https://images.genius.com/16c23bf8d7a8a73a71d30d2ec47600b1.1000x1000x1.jpg", "year": "1999-12-28", "album": "Vol. 3… Life and Times of S. Carter"}], "artist": "JAY-Z"}