{"artist": "Immortal Technique", "songs": [{"title": "Goonies Never Die", "lyrics": "[Intro 1]\nAnd it's not smart to be dumb\nIt's not smart to be dumb\nBumb de dumb dumb dumb\nBack where I come from\nIt's not considered smart to be dumb\n\n[Intro 2: Immortal Technique + Empanada]\n— Okay, little empanada, time for bed.\n— Uncle Felipe…\n— What? What is it now?\n— I heard that you and my dad used to be in a gang. Is that true?\n— Who told you that, man? Your mother?\nIt wasn't a gang, we were just a group of friends.\n— Did you do bad things?\n— No no no, look, we just used to draw on stuff, play karate, borrow things, throw stuff, you know, run around at night, like Goonies.\n— What's a Goonie?\n— You never heard of Goonies before?!\n\n[Verse 1: Immortal Technique]\nI could've chose another life with the feds tryna get me\nLittle kids puttin' work in like at Gap and Disney\nIn the whip, high as shit like Bobby and Whitney\nGrab your hand and push the motherfuckin' pedal to sixty\nHarlem cops frisk me to get me to make their quotas\nBut I told ya \"Siempre hay que separar las drogas\"\nBar brawl in the club, poppin' and rockin' jaws\nShot it out, leavin' bullet holes the size of Matzoh balls\nI love thick chicks, never fucked with a slim broad\nPlayed soccer and hammered nails into their shin guards\nGambled at cee lo with Dominicans locked in the tombs\nWe was there for robbin' niggas for them Spanish doubloons\nRemember Goonie-era graffiti of all sorts?\nNow they wanna foreclose on the hood to build a golf course\nI'll put your hand in a blender to make an entrée\nThen cut your dick off and glue it back on the wrong way\n\n[Hook: Immortal Technique]\nAll my revolutionary soldiers better ride\nMy word is mathematics, bitch, numbers never lie\nSo even if they tell you I'm dead, I'm still alive\nBecause, motherfucker, Goonies never die\nWitness protection program, rappers better hide\nI serve revenge out the freezer, niggas never slide\nSo if they tell you I'm gone and you safe, niggas lied\nBecause, motherfucker, Goonies never die\n\n[Verse 2: Swave Sevah]\nI'm a certified Goonie, the type to burglarize your crib\nAnd leave it smellin' like sour and Afghan gooey\nLife is a movie, but yours was filmed on a greener screen\nI give you pure uncut raw, no deleted scenes\nWar with a broadsword, dumpin' a TEC-9\nSlit your throat, give you a Colombian necktie\nThe best buy to get, we let die\nLet fly the next guy to try some shit\nListen, a few words just to describe my clique\nWe like a gang of Spartans, walkin' on the Gaza Strip\nNever say die it's time to fight and we never run\nMy Goonies rob niggas for jewelry\nWe call 'em treasure hunts\nLet him front like he a tough guy with me\nI'll hit him, slug turn him to One-Eyed Willy\nWatery grave, hide your chips\nI'll hijack your boat load and cruise away on my pirate ship\n\n[Hook: Immortal Technique]\nAll my revolutionary soldiers better ride\nMy word is mathematics, bitch, numbers never lie\nSo even if they tell you I'm dead, I'm still alive\nBecause, motherfucker, Goonies never die\nWitness protection program, rappers better hide\nI serve revenge out the freezer, niggas never slide\nSo if they tell you I'm gone and you safe, niggas lied\nBecause, motherfucker, Goonies never die\n\n[Verse 3: Diabolic]\nBefore Duncan Pinderhughes was runnin' with Doug E. Doug\nMy team got away with murder, we ain't fit the bloody glove\nThose jungle breeds and we come to feed our hungry cubs\nWith hoes pullin' out our pipes\nLike Goonies under country clubs\nLet these funny thugs know whoever steps in Bolic's spot\nIs gettin' crushed with solid rock like Chester Copperpot\nI suggest the drama stops, I'll flood blocks with mustard gas\nYou're up shits creek in a rubber raft cut in half\nCross my fuckin' path, I dare you, I'll mangle who lit the fuse\nQuick to lose my marbles like Mikey replacin' his with jewels\nWatchin' y'all enslave the game, I'm forced to say the truth\nBreak the chains quick as Sloth reachin' for a Baby Ruth\nWe got 80 proof and whores in Daisy Dukes extra low\nWhile fat bitches do the truffle shuffle just to get in shows\nFuck what your record sold! Respect the code and recognize\nThe rebel tribe that my people kept alive will never die\n\n[Hook: Immortal Technique]\nAll my revolutionary soldiers better ride\nMy word is mathematics, bitch, numbers never lie\nSo even if they tell you I'm dead, I'm still alive\nBecause, motherfucker, Goonies never die\nWitness protection program, rappers better hide\nI serve revenge out the freezer, niggas never slide\nSo if they tell you I'm gone and you safe, niggas lied\nBecause, motherfucker, Goonies never die", "image": "https://images.genius.com/d17ee30cab427a6ea7fa3bfa64561580.400x400x1.jpg", "album": "The Martyr", "year": "2011-10-27"}]}