{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Production by Cool V]\n\nIntro: Mmm.. mmm, yeah\nOh I like this\nI wanna tell this story\nA little story about umm..\n.. a brother who you would think has everything goin for himself\nBut apparently for some reason he just ain't happenin\nI call this brother Mr. Pitiful\nI wanna tell you somethin about him, check it out\n\n[Verse 1: Big Daddy Kane]\nThe story begins in 1984\nWhen I met the Biz Markie out in front of the store\nHe used to tell me all the time, \"Yo your lyrics is hype\nWe got to get together and make a record of some type\"\nI said, \"Man, the hype behind Run-D.M.C. and Cool J\nWhat the fuck makes you think they're gonna give us a play?\"\nWe did a few shows together, freestylin on stage\nManhattan and Long Island, for Mike and Dave\nAfter that, I was convinced we can do it\nUntil my man Biz jetted and came out with \"Make the Music..\"\nFrom right there, I said, \"Man, this shit is real\nLook at Biz in the new leather and a pair of spot bills\"\nI got to give it to you Dukes, I was wrong\nWell you out there now, so put my black ass on\nAnd sure enough, huh, in about a year's time\nI was R-A-W, goin for mine\nDroppin jams that slammed on every radio program\nAnd bam, GOD DAMN, look where I am\nThe first album, _Long Live the Kane_, it sold\nAbout umm.. AWW FUKKIT it went gold\nThe money was comin in, yes I had done em in\nIt wasn't quite hard for me to find a woman then\nCause I was in demand for lots of fans\nA sexy chocolate guy in the public eye\nI bought myself a condo out in Queens\nA plush white Volvo and drove off the scene\nBut I remained the same since I moved out\nFor instance - drinkin Olde E and Guinness Stout\nAnd also, hangin out with the troops\nMost of all, takin care of Ma Dukes\nThen all of a sudden things started to change\nAnd many old friends started actin strange\nBehind my back, sayin I'm soft and a sucker\nSome even said, \"Yo let's rob the motherfucker\"\nAnd family members askin for my papers\nBut Biz set them straight, by makin \"The Vapors\"\nGirls cryin pregnant, to get some of my green\nI'm like, \"What the fuck is this? Billie Jean?\"\nPeople harassin me, steadily askin me\nDis or dat, some even had the audacity\nTo say that I only liked light-skinned women\nTchk, huh, are you kiddin?\nCause I love everyone\nAnd I never act prejudiced to none\nBut for some reason people make my lifestyle so critical\nThat's why they call me Mr. Pitiful\n\nOutro: A few people know what I'm sayin\nHmm, to the Little Daddy Shane, you know what I mean\nAnd to my man Cool V, you know what I mean\nTo T.J. Swan, you know what I mean\nAnd to Scoob and Scrap, you know what I mean\nTo Rob Base and E.Z. Rock, you know what I mean\nThe Magnum Force, you know what I mean\nAnd to the playboys, you know what I mean\nTo Shemp Shawn, you know what I mean\nAnd the F.M.C., you know what I mean\nCan't forget Miv, you know what I mean\nGodfather D, you know what I mean\nMy man Doug E. Fresh, you know what I mean\nAnd the fifty dollar crew from Canada know what I mean\nBut most of all I can't forget my man Biz-Mar-KIE\nAnd may I send this to A.J. Quest, Rest In Peace ??", "image": "https://images.genius.com/9018e5e448f4d08b6115d24de00e8af0.1000x1000x1.jpg", "year": "1990-10-30", "title": "Mr. Pitiful", "album": "Taste of Chocolate"}]}