{"artist": "360", "songs": [{"album": "Please Be Seated 2 ", "year": "2010-09-13", "title": "Shutterbug", "image": "https://images.genius.com/ce0cf5e48473d30e15d0675c37cfb37b.519x391x1.png", "lyrics": "[Skit: 360 & Woman]\nAh, mmm, oh, oh, good girl\nOh, mmm-oh, yeah, oh, oh\nOh, mmm, oh, 60\nCall me Pez, call me Pez\nWhat?\nNothing, nothing, shh\n\n[Intro: 360]\nYo, Please Be Seated, bitches\nNumber two, bitches, what up, bitch?\n\n[Verse 1: 360]\nYo, I don't understand your shit, yo, explain it first\nNerd rappers need to rap in layman's terms\nFor me though, it's fuck 'safety first'\nIt goes alcohol, drugs, then safety's third\nIn the last months, I have fuckin' wrecked shit\nI'm a ball breaker, pun intended\nI'll bust ya head 'til none forget this\nDon't come correct then you'll come corrected\nFuck the world, go unprotected\nKeep on going 'til it's fuckin' pregnant\nI am never early\nIf I'm booked in at 6:00, then expect 360 at 7:30\nHey yo, bitch, cook me some eggs\nAnd if they ain't runny, fuckin' cook 'em again\nThe last time I got stuck in a booby trap\nYo, I was like, \"Where the fuck are the boobies at?\"\nAnd this is how I be livin' in tune with rap\nBut why you gotta get rude with that?\n'Cause these hoes on my dick 'cause I'm lookin' like Ted Danson\nMaybe so, but Teddy is less handsome\nI used to wake up, first thing, blaze up\nHey, yo, my taste buds only ever taste bud\nThen me and Mary had a break up\nSee, I didn't want to but I didn't get the same buzz\nSick of livin' like a king for two days\nThen spend the next fortnight livin' off loose change\nI think I need a new name\nBecause I ain't made for livin' underground like Bruce Wayne\nUh, this the definition of Aussie swag\nI got the crown, come get at me if you want it back\n360 rockin' over Shutterbug\nBecause I, I, I am a funny cunt\n\n[Chorus: Big Boi & Cutty (Sampled)]\nNow party people in the club, it's time to cut a rug\nAnd throw the deuce up in the sky just for the shutterbugs\nI'm double fisted and you empty, you can grab a cup\nBoy stop, I'm just playing let me dap you up\nBaby baby, you're in my system\nBaby baby, tell me you're listening\n\n[Verse 2: GMC]\nI said, \"Fuck you, dickhead, this is me styling\"\nCallin' you inferior and this is me dialing\nI own this microphone\nSo go fuck yourself if you don't like my tone\nBack, I'ma fuck you tip, ignant\nI don't even know who the fuck you is\nNon-discriminatory\nHigh on skill, my flow got me feeling euphoric\nIt's GMC, so guaranteed this speed gonna need a burial for it\nNow I don't skeet, watch me go ahead\nAnd do a bunch of motherfucking aerials off it\nI stunt with the flow, nobody double lead it\nWrite my own shit, like Robby Rodriguez\nRide my own dick, like I lovin' my penis\nAlso in love with Rosario Dawson\nThe things I'd do to Rosario Dawson\nWould both be scary and awesome, Miranda Kerr\nThat's the question that I answer first\nBut then I gotta big load and I hand it to her\nBuckle your seat belt, motherfucker\nYou buckle your seat belt now\nSending you in like an email now\nLadies and gentlemen, please be seated\nTres-seis-cero and GMC\n\n[Chorus: Big Boi & Cutty (Sampled)]\nNow party people in the club, it's time to cut a rug\nAnd throw the deuce up in the sky just for the shutterbugs\nI'm double fisted and you empty, you can grab a cup\nBoy stop, I'm just playing let me dap you up\nBaby baby, you're in my system\nBaby baby, tell me you're listening"}]}