{"artist": "Canibus", "songs": [{"title": "Draft Me", "album": "C! True Hollywood Stories", "year": null, "image": "https://images.genius.com/b3eb34359661b0bc8191e1fdb19d157e.600x600x1.jpg", "lyrics": "*Newsreporter talking*\n\n\"Also the, hearing from the defense department that they launched\nSome fifty Tomahawk cruise missiles\nNot only from ahh US ships but also from British\nSubmarines in the area\"\n\n[Hook: 2x]\nDraft me! I wanna fight for my country\nJump in a Humvee and murder those monkeys!\nDraft me! I'm too dedicated to fail\nJustice must prevail (Justice must prevail!)\n\n[Canibus]\nYo, I wanna get drafted, I wanna see somebody get they ass kicked\nWith standard military tactics\nFuck brass knuckles, I'll punch you with brass fists\nTotally flowin with my emotions in my moment of madness\nI'll wake up the whole barracks, murder you on your mattress\nAnd look at you like, \"What's the matter?\"\nYou better go back to your bed, before I have to act up\nYou might be the next one to get ripped you jacker!\nYou better not tell the captain\nI might accidentally shoot you with the mack 10 at target practice\nRunnin' through the obstacle course, up and across\nOver the logs, five more, damn soldier you strong\nCome on, I wanna be agile and docile\nBreak ya legs like popsicle sticks, put you in a hospital\nStand over top of you, put a pillow over your nostrils\nAnd just feel so sorrowful\nIt doesn't make me feel powerful, it's just a parable\nIt's just a rhyme really none of this is tangible\nSo don't ask me about it, I won't get angry at you\nAnd before I get angry, I just won't answer you\nYou better go get in shape or lift some weights nigga\nCuz next time I see you I'mma be a ape nigga\nLemme find out you still callin out my name\nI'll crash into your tour bus with a plane nigga\n\n[Hook: 2x]\n\n[Verse 2: C4]\nFuckin with my freedom, leave a muh'fucker bleedin\nLeave 'em in pain like a infant when he teethin\nIt's huntin season, and ya loved ones grievin\nCuz I never back up (no sir) I never back down\nAsk Brown (Ha!) From the bell to the last round\nFace down, dick in the dirt, hit 'em where it hurt\nMake the enemy my lil' bitch in a skirt\nCuz when it rained it poured, this ain't a game it's war\nOne goal, one aim son, same as yours\nAlotta pain to endure, terrain to explore\nAnd I'mma hold my weapon right cuz I was trained in the Corp\nYou don't want no trouble, whole city reduced to rubble\nAnd we gon' make it happen, quick, fast, and on the double\nDraft me!\n\n[Verse 3: C4]\nSo y'all best go get y'all shuffles!\n(Draft me) The situation's gettin ugly\nSo who better but me, and put to sleep the enemy\nDraft me, pass me the M-16\nGive me a buzz cut, ask me if I give a fuck\nI'm comin out blastin, military four-fashion\nTwelve close castin, for weapons of mass-distraction\nOutlastin all the privates in my company\nFightin for my family, and the cats that grew up with me\nMy Band of Brothers, rarely just smother the enemy\nRazor blades cut ya face and leave a scar so you remember me\nLurkin, to leave y'all with bloody red turbans\nScreamin \"Jihad!\" while y'all pray to a false god\nWe ready for, all out war, it's time to settle the score\nGrab a .44 and dump into nigga's door\nDraft me, you ain't even gotta ask me, I'm ready\nWith the Rambo machete, using tactics that's deadly\nDraft me, I swear to God, we ready for the Taliban\nDrop the bomb, and huddle with some nuclear laws, come on!\n\n[Hook: 2x]\n\n[Canibus (as Stan)]\nTruthfully, I wouldn't wanna go to war if they asked me\nI'd rather puff hashish and talk about headies and Lassie\nI was just sayin to Canibus last week\nI heard a record called Channel 0 that was mad deep\nWhen I'm overseas I can't eat, the food is nasty\nBis has a seafood fancy, I'm allergic to crabby\nG'head draft me, you're all in my new family\nI'll have a good time wavin gats at them arab sheikhs\nIf I get hit, one of the team'll carry me\nSo g'head draft me, g'head draft me\n\n[Hook: 2x]\n\n*George W. Bush talking*\n\n\"The only way to pursue peace is to pursue those that threaten it\nWe did not ask for this mission, but we will fulfill it...\""}]}