{"artist": "Kid Rock", "songs": [{"image": "https://images.genius.com/3c584591dd46a786ccefd7e6a6c39785.400x400x1.jpg", "title": "American Bad Ass", "year": "2000-04-18", "album": "The History of Rock", "lyrics": "[Intro]\nYeah! and I've set up and torn down this stage with my own two hands\nWe've traveled this land packed tight in minivans\nAnd all this for the fans, girls, money, and fame\nI play their game, and then they scream my name\nI will show no shame, I live and die for this\nIf I come off soft, then chew on this....\nAre you scared?\n\n[Verse 1]\nDevil without cause, and I'm back\nWith the beaver hats and Ben Davis slacks\n30-pack of Stroh's, 30-pack of hoes\nNo rogaine in the propane flows\nChosen one, I'm the living proof\nWith the gift of gab from the city of truth\nI jabbed and stabbed and knocked critics back\nAnd I did not stutter when I said that\nI'm goin platinum sellin' rhymes\nI went platinum seven times\nAnd still they ill they wanna see us fry\nI guess because of only God knows why\nWhy why why why\n\n[Chorus]\nOhhhhh\nThey call me cowboy, I'm the singer in black\nThrow a finger in the air, let me see where you're at\nAnd say (Hey, hey)\nLet me hear where you're at and say (Hey, hey)\nI'm giving it back so say (Hey, hey)\nShow me some metal and say (Hey, hey, hey, hey)\n(Fuck all y'all)\n\n[Verse 2]\nI like AC/DC and ZZ Top\nBocephus, Beasties, and the Kings of Rock\nSkynyrd, Seger, Limp, Korn, the Stones\nDavid Allan Coe, and No Show Jones\nYeah! Pass that bottle around\nGot the rock from Detroit and soul from Motown\nThe underground stoned fuckin' pimp\nWith tracks that mack and slap back the whack\nNever gayed away, I don't play with ass\nBut watch me rock with Liberace flash\nPunk rock the Clash, boy bands are trash\nI like Johnny Cash and Grandmaster Flash\n\n[Chorus]\nOhhhhh\nThey call me cowboy, I'm the singer in black\nThrow a finger in the air, let me see where you're at\nAnd say \"Hey, hey\"\nLet me hear where you're at and say (Hey, hey)\nI'm giving it back so say (Hey, hey)\nShow me some metal and say (Hey, hey, hey, hey)\n\n[Bridge]\nYeah, I saw your band\nJumping around on stage like a bunch of wounded ducks (Psh!)\nWhen you gonna learn sucker?\nYou just can't fuck with Twisted Brown Trucker!\n\n[Verse 3]\nI'm an American Bad Ass, watch me kick\nYou can roll with Rock or you can suck my dick\nI'm a porno flick, I'm like Amazing Grace\nI'm gonna fuck some hoes after I rock this place\nSuper fly living double wide\nSide car on my Glide so Joe C can ride\nFull sack to share, bringin flash and flair\nGot the long hair swinging, middle finger in the air\nSnake skin suit, 65 Chevelle\nSee me ride in sin hear the rebel yell\nI won't live to tell, so if you do\nGive the next generation a big \"Fuck you!\"\nWho knew I'd blow up like Oklahoma\nSaid fuck high school, pissed on my diploma\nSmell the aroma, check my hits\nI know it stinks in here, cause I'm the shit\n\n[Chorus]\nOhhhhh\nThey call me cowboy, I'm the singer in black\nThrow a finger in the air, let me see where you're at\nAnd say (Hey, hey)\nLet me hear where you're at and say (Hey, hey)\nI'm giving it back so say (Hey, hey)\nShow me some metal and say (Hey, hey, hey, hey)\n\n[Outro]\nI'm a cowboy, bad ass in black singing\n(Hey, hey, hey, hey)\nFrom side to side, from front to back Say\n(Hey, hey, hey, hey)\nI put Detroit City back on the map by singin'\n(Hey, hey, hey, hey)\nKid Rock's in the house and that's where I'm at!"}]}