{"artist": "Yukmouth", "songs": [{"album": "Godzilla", "image": "https://images.genius.com/06ce9a2ae3e7a9474fcfc10e00a00df9.500x494x1.jpg", "year": null, "lyrics": "[Yukmouth]\nA motherfuckin (deezless) ? Production ya dig, they love ya boy\nYukmouth, Devin, Ampichino, what?\nThey love ya boy\nYeah, Rap-a-Lot mafia, nigga\nOakland to Akron to the motherfuckin PA\nThey love us boy, feel me?\nAnd free pimps see, nigga\n\n[Ampichino]\nAmpichino (cuz we love ya boy)\nThey love ya boy cuz I blow big dro\nIn Acapulco or Cancun wit six hoes\nIn a Pocanos blowin dro smoke through my nose\nCockin' a fo' fo', my eyes half closed\nI'm duckin these tramp hoes\nIn KC gettin' bigga figgas like JT\nIn a Mercedes, in Houston, compin' some lady\nIn a H2 sippin' on Grey Goose and grapefruit\nSmoken on catpiss ready for war like Beirut\nAmpichino still be duckin the law\nWe got big blocks of raw\nYa'll got little rocks like Arkansas\nAkron, Cleveland, Cincinnati\nBrooklyn, the Bronx, New York, out to Cali\nOakland, Compton, my niggas in Frisco\nVallejo, Sacramento, Fresno to Fillmore\nFuturistic like Elroy, watchin' these decoys\nI know deep boys, got street lords in Detroit\n\n[Hook]\nSt. Louis to Compton (they love ya boy)\nHouston to Austin (they love ya boy)\nNY and Boston (they love ya boy)\nCuz every city that I go I be thuggin boy\nPortland to Oakland (they love ya boy)\nAkron to Cleveland (they love ya boy)\nKC to (?) (they love ya boy)\nCuz everycity that I go I be thuggin boy\n\n[Yukmouth]\nYeah, Yuk a international star, what I pass fo'\nJust like Atlanta, bitch, get ya anything ya ask fo'\nJags off the flo'\nNavigation in the dash bo'\nSpreewheels keep spinnin' like a cassette when it fast fo'\nNigga back and forth like Aaliyah\nCall me the overseer\nOne night in Australia, 2 pounds of reefer\nI tote around the heata, the fo' fiva\nShows in Costa Rica, I blow speakas\nStuntastic (?)\nYou not a crook I rock jewels to make ya woman look\nIn Amsterdam smoken purple cush and (?)\nIn Switzerland they call me swisher man\nI twist a swisher quicker then the flick of a nigga hand\nGet the picture man?\nYukmouth I bring that bay thing back\nI got fans from Russia to London wit regime tats\nVice lords and disciples, they love ya boy\nAnd gang bangers never ever blame cuz ya boy\n\n[Hook]\nFrom LA to PA (they love ya boy)\nMIA to VA (they love ya boy)\nFrom Atlanta to Nevada (they love ya boy)\nCuz every city that I go I be thuggin boy\nAmsterdam to DC (they love ya boy)\nTo Japan to Sydney (they love ya boy)\nThrough Chi-town to Sac-town (they love ya boy)\nCuz every city that I go I be thuggin boy\n\n[Devin]\nI just left Kentucky where they love me up in Louisville\nThey know I'mma come back here cuz they know the dude be real\nOf course DC knows the deal\nI like to go go to the (?) and chill\nNiggas from everywhere tryin to do what I did\nRunnin' up askin \"yo, yo who is that kid?\"\nSee me up in Denver, the Colorado Springs\nWhere the air is fresh and it helps me when I sing\nYo...Da...Lay... Eeh...Whoo\nGot a pussy and a titty or two?\nFor ya boy, yep yep the travelin' man\nNo pressure on you nigga\nSee I'll a snap if I can\nAnd off to another state\nHurry up and clean my nuts bitch, a brotha late\nCall up my niggas and tell 'em I made it safe up over herre\nNigga, you in Dallas?\nNah I'm in Missouri\nOh, over therre...\n\n[Hook]\nSt. Louis to Compton (they love ya boy)\nHouston to Austin (they love ya boy)\nNY and Boston (they love ya boy)\nCuz every city that I go I be thuggin boy\nPortland to Oakland (they love ya boy)\nAkron to Cleveland (they love ya boy)\nKC to (?) (they love ya boy)\nCuz everycity that I go I be thuggin boy\n\nFrom LA to PA (they love ya boy)\nMIA to VA (they love ya boy)\nFrom Atlanta to Nevada (they love ya boy)\nCuz every city that I go I be thuggin boy\nAmsterdam to DC (they love ya boy)\nTo Japan to Sydney (they love ya boy)\nThrough Chi-town to Sac-town (they love ya boy)\nCuz every city that I go I be thuggin boy", "title": "Ya Boy"}]}