{"songs": [{"year": "2008-09-09", "album": "Not 4 Sale", "image": "https://images.genius.com/f0a901d03b5db37284706922ef6d3d03.1000x1000x1.jpg", "title": "Gimme Some", "lyrics": "[Intro: Kardinal Offishall (The-Dream)]\nHey! (hey)\nHey! (hey)\nHey! Hey! Hey! (Radio killer...)\n\n[Verse 1: Kardinal Offishall]\nAiyyo I thought I could take her, jeans full of paper\nEverything a everything but Kardi couldn't break her\nMet her on a plane going straight to Jamaica\nLeft a vino and casino with a villa on an acre\nMan a bad man with a firebrand on his sleeve\nMoonlight shining on that yacky weave\nFireworks busting like you couldn't believe\nTryna get both my paws on her chest like Eve\nAiyyo they call me Mr. Kardi, apple to Bacardi\nDoesn't matter while I'm trying wine ya ting up in the party\nI will deal with the kids girl, beat out ya batta\nAnytime any place any where, doesn't matter come on!\n\n[Hook: The-Dream]\nWhy wouldn't I (why?)\nWant a body like that? (Cheah!)\nMy heart go (BOOM!)\nEverytime you back that back (Cheah!)\nAnd why wouldn't I (why?)\nWant a body like that? (Eh!)\nMy them niggas go (Ehhh!)\nEverytime you drop that\nI just wanna feel it (oooh)\nThen I wanna touch it (oooh)\nThen I wanna rub it (oooh)\nHmm that ain't enough\nSo let me love it (ehh!)\nLet me hug it (ehh!)\nDo you wanna gimme some..gimme some...\nDo you wanna gimme some..gimme some...\n\n[Verse 2: Kardinal Offishall]\nAiyyo the Konvict sauna, black J's too\nWhen I get her to the 'telly there's not telling what I'll do\nMan a bedroom bully, bourgeois boss\nHaffi leave a good impression no matter how much a the cost\nBut I'll never pay a dollar, never pay a fee\nMan a better run from the T-D-O-T, K-A-R-D\n-Inal a know, ginnal a love criminal (right gyal!) hear me now?\nSe mi now, time for you to do you\nWhile I'm doing me I'm tryna do you too\nLemme show ya who's who, bad boy Kardinal\nParty done started now, how do ya do? Ehh?!\n\n[Hook: The-Dream]\n\n[Verse 3: Kardinal Offishall]\nSomebody told me that I couldn't do it, that's why I do it to death\nI'm grim reaper fresh with every last breath\nThe world dance to the pulse of my heart\nRevolutionary rocksteady straight from the start\nYoung girl this is not about lust\nStop with all the talking this is about us\nIt's about you plus me living together\nForever riding in your X6 with the plush leather\nMy girl look better than yours, get money much better than yours\nWith the head knock once in the drawers\nOh lord lemme pause while Dream sing bring the applause\nClap clap clap clap!\n\n[Hook: The-Dream]\n\n[Outro Hook: The-Dream]\nI know you wanna gimme some..gimme some..gimme some..\nI know you wanna gimme some..gimme some..gimme some.."}], "artist": "Kardinal Offishall"}