{"songs": [{"title": "I Wish This Was A Tupac Beat!", "album": null, "year": "2015-11-09", "image": "https://images.genius.com/485b12792efe1c2d5ce900a40c747e8b.100x100x1.jpg", "lyrics": "[Intro: 2Pac]\nStarin' at the world through my rearview\nJust lookin' back at the world\nFrom another level, you know what I mean? Starin'\n\n[Verse 1: 2Pac]\nMultiple gunshots clear the block, the fun stops\nSnitches is callin' cops, people shot, nobody stops\nI wonder when the world stopped carin'\nLast night two kids shot while the whole block starin'\nI will never understand this society\nFirst they try to murder me, then they lie to me\nProduct of a dyin' breed; all my homies tryin' weed\nNow the little babies crazed, raised off Hennessy\nTell me, will my enemies flee when they see me?\nBelieve me, even thugs gotta learn to take it easy\nListen, through intermissions, search your heart for a plan\nAnd we turnin' bad boys to grown men, it's on again\nI give a holla to my niggas in the darkest corners\nRoll a perfect blunt, and let me spark it for ya\nOne love from a thug nigga\nRollin' with a posse full of paranoid drug dealers\nTo the end, my friend, I'm seein' nothin' but my dreams comin' true\nWhile I'm starin' at the world through my rearview\nSee, I'm seein' nothin' but my dreams comin' true\nWhile I'm starin' at the world through my rearview\n\n[Hook: 2Pac]\nThey got me starin' at the world through my rearview\nGo on, baby, scream to God, he can't hear you\nI can feel your heart beatin' fast 'cause it's time to die\nGettin' high, watchin' time fly\nAnd all my motherfuckers\nStarin' at the world through my rearview\nGo on, baby, scream to God, he can't hear you\nI can feel your heart beatin' fast 'cause it's time to die\nGettin' high, watchin' time fly\nAnd all my motherfuckers\n\n[Verse 2: E.D.I. Mean]\nNow you see him, now you don't\nSome niggas be here for the moment, and then they gone\nWhat happened to 'em?\nWell, let's see, it seems to be a mystery\nBut all I know I never let the money get to me\nStay down like the truest\nThug Life until I check out this bitch, I thought you knew this\nWho is gonna catch me when I fall or even care to?\nWhile you thinkin' I see you lost up in my rearview\nHear you is down with them Outlawz\nOutcast, left far, I'm through like southpaws\nBut still we keep mashin' until our dreams come through\nStarin' at the world through my rearview\n\n[Verse 3: 2Pac]\nNow, I was raised as a young black male\nIn order to get paid, forced to make crack sales\nCaught a nigga so they send me to these overpacked jails\nIn the cell, countin' days in this livin' black hell\nDo you feel me? Keys to ignition, use at your discretion\nRoll with a 12 gauge pump for protection\nNiggas hate me in the section, from years of chin-checkin'\nTurn to Smith & Wesson war weapons\nHeavenly Father, I'm a soldier\nI'm gettin' hotter 'cause the world's gettin' colder\nBaby, let me hold ya: talk to my guns like they fly bitches\nAll you bustas best to run, look at my bitches!\n\n[Bridge: 2Pac]\nNow I know the answers to the question\n“Do dreams come true?”\nStill starin' at the world through my rearview\nI said, now I know the answer\n“Do dreams come true?”\nStarin' at the world through my rearview\n\n[Hook: 2Pac]\nThey got me starin' at the world through my rearview\nGo on, baby, scream to God, he can't hear you\nI can feel your heart beatin' fast 'cause it's time to die\nGettin' high, watchin' time fly\nAnd all my motherfuckers\nStarin' at the world through my rearview\nGo on, baby, scream to God, he can't hear you\nI can feel your heart beatin' fast 'cause it's time to die\nGettin' high, watchin' time fly\nAnd all my motherfuckers"}], "artist": "Left Brain"}