{"artist": "Fabolous", "songs": [{"year": "2003-03-04", "album": "Street Dreams", "image": "https://images.genius.com/4b857fc26420a638d0085145c7bcd7f3.1000x1000x1.jpg", "lyrics": "Unh. It's the duh-duh-duh-duh-duhduhduhduhduhduh-damn\n\n[Intro]\nDamn, it the way he grab on himself\nBefore he getting closer to you, girls be like damn\nDamn, it's the wife beater\nWish you were the one in the drop top two seater\nDamn, I can't blame him\nIf he wasn't mine shit, I would try to claim him\nCause he's so fly, I'm so fly\nYou play yourself if you try to deny it, damn\n\n[Verse 1: Fabolous]\nI'm nothin' like the other brother\nI got no choice but to slut her\nCause I'm in a tan six with a base gut\nThat look something like a nutta-butta duhduhduhduh\nMami you'll be in St. Tropez\nRiding jet skis and mopeds, nodding like dopeheads\nPaparazzi snapping pictures, they must think you J. Lopez (bitch)\nLet's roast in spinach, hit a club and just post up in it\nWhat you mean are we here yet?\nI got a lear jet that gets to the west coast in minutes (hehe)\nI'm smoother than white vanilla fudge and white and yellow studs\nCause if they witness how I'm killing them out here\nThese girls just might go tell the judge I rest my case\n\n[Hook]\nDamn, it the way he grab on himself\nBefore he getting closer to you, girls be like damn (you feelin that right)\nDamn, it's the wife beater\nWish you were the one in the drop top two seater (come on let's ride)\nDamn, I can't blame him\nIf he wasn't mine shit, I would try to claim him (I'm sure you would)\nCause he's so fly, I'm so fly\nYou play yourself if you try to deny it, damn (and what you say girl)\n\n[Verse 2: Fabolous]\nYou could be prancing through ghettos\nIn Dior pants and stilettos\nAll you got to do is swallow some kids\nLike that witch did Hansel and Gretel\nWho's as handsome as ghetto?\nThis mans earring looks transparent\nAnd my Mitchell & Ness throwbacks be so old\nThey could be somebody grandparents, baby like (Damn)\nI want the kind of money athletes consume\nI have to assume, I'm no fool but I'm so cool\nWhen I walk in, it feel like it's a draft in the room, Whoo (Damn)\nI'm so sick, I drive in reverse pass\nCall me a nurse fast\nShorty just lay back in the Maybach\nGet a feel like you sitting in first class, relax\n\n[Hook]\n\n[Verse 3: Fabolous]\nThey ask for it\nSo I put TV's in the headrest and the dashboard\nYou got to catch it on tape cause when the truck stops\nThe rims still look like they on fast-forward, unh\nDamn, I'm sipping liquor the colour of Smurf skin\nAs long as the earth spins, and you'll get seasick\nAnd my waves be thick enough for them Cali dudes to surf in, cowabunga!\nYour low riding denims look like midgets is hiding in them\nThey say I like it from the front, they like it from the back\nBut when the kids is sliding in them, they be screaming (Damn)\nThe biggest dykes these switching for dudes for figures like me\nAnd um I'm not bragging\nBut imagine that you could even fuck with a nigga like me\n\n[Hook]", "title": "Damn"}]}