{"songs": [{"title": "Enemy Or Friend", "lyrics": "Say, I'm a rappin motherfucker, fuck that\nI'm a trappin motherfucker, I make it happen, motherfucker\nI went and got, put my niggas on\nIf you say you ain't eatin, to each it's own\nI don't owe you shit, what you do for me?\nYou ain't sell that work, you ain't shoot for me\nHeard niggas talkin down when I ain't around\nBut when I pull up it's the other way around\nReal nigga this, real nigga that\nReal niggas treat niggas with respect and you a pussy, nigga\n\nSo keep looking, nigga, keep your word to yourself before they have to book a nigga\nMan I shook a nigga, took a nigga birds\n'Cause I take offense to nigga's words\nWatch your mouth, homie\nOne nigga hating on my grind\nI'm from the city but they don't want me to shine\nI don't get it, niggas trying to hold me down\nLike they don't want me to climb, to the top\nBut they're plan declined\n\nI'm in war with my enemies, watching niggas who close to me\nMy young niggas ride or die and this how it's 'pose to be\nThe hate at a all-time high, I'm keeping that toast with me\nIt's shoot first ask question later, 'cause that's how it 'pose to be\n\nAnd every day I wake up, I'm face the haters\nKnowing it don't 'pose to be this way\nEven my own home boys, they're playing games, lord\nAnd this strap gone put 'em in they place\nIf I kill a nigga will they repent my sins?\nHustling day and night, I try to get a new benz\nIs you an enemy or friend?\n\nWhat I'm supposed to do, back against the wall\nStrap on my dog, real me, blind if I don't fall\nThey say when the smoke clear, a lot of niggas they ain gon be around\nBut my young niggas, they'll hold me down\nThug life, outlaw, feeling like I'm pac\nPut that strap on his ass, have 'em in a state of shock\nAmbulance came, now they takin his ass to the doc\nAnd when the white boys come, nigga, I ain't trying to talk\nIt's CMG for life, exercise your muscle, you gotta tighten your hustle\nGet your money, my nigga, don't get caught in the shuffle\nI play the cards I was dealt, I bet it all and double\nAnd I never lost money to suckers, how real is dat\n\nEvery day I wake up, I'm faced the haters\nKnowing it don't 'posed to be this way\nEven my own home boys, they playing games, lord\nAnd this strap, gone put 'em in they place\nIf I kill a nigga will they repent my sins?\nHustling day and night, I'm tryna get a new benz\nIs you an enemy or friend?\n\nI'm in war with my enemies, watching niggas that's close to me\nMy young niggas ride or die and that's how it's 'posed to be\nThe hate at a all time high, I'm keeping that toast with me\nIt's shoot first, ask question later\n'cause that's how its 'posed to be", "album": "CM7: The World Is Yours", "year": "2012-10-18", "image": "https://images.genius.com/3041aa877a139f9d730d0b4645a09c77.1000x1000x1.jpg"}], "artist": "Yo Gotti"}