{"artist": "Warren G", "songs": [{"year": "1997-03-25", "lyrics": "[Intro: Warren G]\n(Whats up Warren G?)\nWhats happenin? I'm just chillin, you know\nCheckin my game you dig, you know\nTrippin off these fools around this situation here, you know its like that\n\n[Verse 1: Mr. Malik]\nI went from hustlin and slangin' to bustin and bangin\nI got to keep it real, so fuck not cursin when I'm sangin'\nNow let me tell y'all about this shit, went down the other night\nMe and the doggs see some niggas, just caught up in the hype\nTryin to ride and get by like the FBI\nCause we know bout them hk's, they right outside\nBut we never knew y'all had a clue bout what we go through\nSo tell how the fuck could you speak on my crew\n\n[Verse 2: Bad Azz]\nI went from dirt to large work like boatloads of keys\nIt's hard work and it hurts to live life on ya knees\nSo God please have a lil' mercy on my soul\nWhat my eyes see, my mind think, my hand should hold\nThe outcome of these actions warm hearts turn cold\nLil' snake tryin' to blast me with the gun he stole\nWe hang out, banged out, same route as the day before\nBlessed with perception, but don't know how my days a go\nCould see my nigga hittin' with some pay, a few days ago\n\n[Verse 3: Perfec]\nBlaze up a flow, sit watch my paper grow\nCautious, in case niggas wanna cross this\nBut they can't cross me, I'm way too flossy\nOut here making millions\nAll in with the villians\nLet's turn these millions to trillions\nI've seen it all pop slow unfold, and go\nNow it's time to get mo' dough, ya know\nI play under the wrath of thunder\nElectric shocks hot as the summer\nMore foul than funner, gun ya\nIn the open range, man it seems strange\nEven sometimes deranged inside my brain\nI hold the key, identify then flee\nEvery MC close to me\nCause I'm supposed to be all in with my chips (nigga)\nI'm all in with the crips and bloods\nGrips for thugs, I nudge\nThe homie on his shoulder, cause every day I'm getting older\nAs the world turns and gets colder\nLaid back I shot me sumpin', Perfec from dynamic, banging G-Funk\n\n[Verse 4: Warren G]\nWell I moved from the East to the West\nWord on the street, niggas wanna test\nBut these MC's, is scared to buck\nPlus they talk too much and smoke too many blunts\nYou fucking rookies\nSweet as Mr. Smith's cookies\nYa hate me one minute and the next ya wanna buck me\nHe sent a ho, in the back seat of my fo'\nWhile ya Going Back To Cali, watch how you flow\nNow ya know, about this Warren G Era\nG-Funk terror, look into the mirror\nAnd what you see is the don of the company\nThat nigga, (Warren, Warren, Warren to the G)\nDo you still see, what I see\nAll of the homies in the LB\nSittin back, and we makin the cash\nWarren G, Perfec, Hershey Locc and Bad Azz\n\n[Chorus: Warren G and Mr. Malik] x2\nAnd we never knew you had clue of what we go through\nSo how in the fuck could y'all speak of our crew\nYa thought this, ya thought that, we thought y'all should laid back\nYeah it's like that, homie it's like that\nSittin back, and we makin the cash\nIt's Warren, Perfec, Hershey Loc and Bad Azz\nSittin back, and we makin the cash\nIt's Warren, Perfec, Hershey Loc and Bad Azz\n\n[Outro: Warren G]\nYa know what I'm sayin Warren G\nWith my homeboy from the pound Hershey Locc\nAnd the homie Perfec, ya know what I'm saying and Mr. Bad Azz\nThat's how we doing it fool, yeah\nWe ain't bangin on wacks nigga\nYeah we doing it like we should be fool, yeah", "image": "https://images.genius.com/d0191f52cbece0c662cd18e324f486e9.1000x1000x1.jpg", "album": "Take a Look Over Your Shoulder (Reality)", "title": "What We Go Through"}]}