{"artist": "Kidd Kidd", "songs": [{"image": "https://images.genius.com/618dea054f2d84c4713013075be1ad0c.1000x1000x1.jpg", "title": "Platinum", "year": null, "album": null, "lyrics": "[Verse 1]\nI just wanna go platinum\nIf I go gold, send me back to Africa\nI just wanna see platinum\nOn my first album\nThat's all I'm asking\nIs just to go platinum\nBe a famous rapper\nLights, camera, action\nCan a nigga go platinum y'all?\nYou gotta stop bootlegging like alcohol\nMan, I had a dream I was a rap star\nGetting that fan's money, fastest cars\nThe fastest bars, chilling with the baddest bitches\nCameras flicking, you with your family chilling\nSmell a good chicken fill your granny's kitchen\nRest in peace [?] she no longer with us\nBut I seen her so vivid in my vision\nShe said \"Boy, I'm glad you stuck with it\"\nHuged and kissed me\nSaid \"Go to church, you need some uplifting\"\nBut I'd rather roll up one and get lifted\nHow could a boy that missed so many Christmases\nBe this gifted?\nNo pot to piss in, it was written\nEven a slum dog can get a million\nRap is all politics and no politicians\nClaiming he got 'em bricks, man, he probably snitching\nThey wanna see ma fall but I ain't tripping\nNot even if the label tryna clip me\nI seen niggas get sign and he still sitting\nHad to get a restaurant job, washing dishes\nShit, I ain't going out like that\nI'mma get a plaque [?]\nRepresent Mazant, put my hood on a map\nLet the industry know, where real niggas go rap, huh?\n\n[Bridge x2]\nOczekiwałem Twoich najdroższych ramion\nPoszukiwałem w tłumie\nZnalazłem samo\n\n[Verse 2]\nThis rap shit ain't just rap shit\nMan, that's like you saying that my rap's shit\nYou want me unwrapping like a peckish\nBack to Mazant packing and wrapping that package\nHoes grabbing my package tryna see where I'm packing\nWon't trap me with that po-po-po-po-po-package\nFeds wanna trap me, hope The Lord sends me pass\nDon't see me packing\nI know some niggas in hell who'd love to see me packing\nBut I'm stacking, stashing and last it\nIf you ain't hating, why you looking mad then?\nYou wanna see me make it, where the fuck you at then, ha?\nDon't treat me like a husband\nI kept it real and always have been\nPardon me for being outlandish\nI just wanna live lavish\nTwo bad bitches and they speaking Spanish\nI don't understand a shit they saying but I know I'm smashing\nNiggas come to the crib, but they ain't crashing\nHe ain't flier than me, I've seen a plane crashing\nI'm on my private plane just laughing\nWhen I go platinum... ha (When I go platinum)\n\n[Bridge x2]\nOczekiwałem Twoich najdroższych ramion\nPoszukiwałem w tłumie\nZnalazłem samo"}]}