{"songs": [{"title": "Sleazy", "album": null, "year": null, "image": "https://images.genius.com/64b15c9489c65f5bf8f6577334347404.434x434x1.jpg", "lyrics": "I dont need you and your brand new Benz\nOr your boujee friends\nAnd I dont need love looking like diamonds\nLooking like diamonds\nGet sleazy\nWe started out so cute in our baby pictures\nThat mommy shot for our daddy so that he wouldn't forget you\nHe forgot anyway, but hey, one day hell remember\nIf not hes human, Im human, you human, well forgive him\nGod gives him his ultimatum, can't see how momma hates him\nHes such a cool a-s guy, then wonder why she date him\nIm only 8, Im not old enough, guess its complicated\nTwo parent dwellings, expelling have got so underrated\nI only say this in cadence so it dont get negated\nI was gon save it for later but later look like maybe\nThis crazy lady named Kesha is guessing my Mercedes\nWould be all new and through through, but its the 19802s\nBut now that we are cool cool, she sippin Irish Baileys\nShe say Stacks, youre true blue?\nI said Nah, Im Navy\nI call her Kesha, she like it, because its hood to her\nShe call me Andre 6000 cause Im good to her\nI dont need you and your brand new Benz\nOr your boujee friends\nAnd I dont need love looking like diamonds\nLooking like diamonds\nI dont need you and your brand new Benz\nOr your boujee friends\nAnd I dont need love looking like diamonds\nLooking like diamonds\nYou can't imagine the immensity of the f*ck Im not giving\nAbout your money and man servant at the mansion you live in\nAnd I dont wanna go places where all my ladies can't get in\nJust grab a bottle, some boys, and lets take it back to my basement\nAnd get sleazy, sick of all your lines, so cheesy\nSorry daddy, but Im not that easy\nIm not gonna sit here while you circle jerk it and work it\nImma take it back to where my man and my girls is\nSleazy, get sleazy, get sleazy, get sleazy, cause imma get\nSleazy, get sleazy, get sleazy, get sleazy, cause imma get\nI dont need you and your brand new Benz\nOr your boujee friends\nAnd I dont need love looking like diamonds\nLooking like diamonds\nI dont need you and your brand new Benz\nOr your boujee friends\nAnd I dont need love looking like diamonds\nLooking like diamonds\nRat-a-tat-tat on your dum-dum drum\nThe beats so fat gonna make me come\nUm, um, um, over to your place!\nRat-a-tat-tat on your dum-dum drum\nThe beats so fat, gonna make me come\nUm, um, um, over to your place!\nI dont mean to critique on your seduction technique\nBut your moneys not impressing me, its kinda weak\nThat you really think youre gonna get my rocks off\nGet my top and socks off, by showing me the dollars in your drop box\nMe and all my friends, we dont buy bottles, we bring em\nWe take the drinks from the tables when you get up and leave em\nAnd I dont care if you stare and you call us scummy\nCause we ain't after your affection, and sure as hell not your money, honey\nI dont need you and your brand new Benz\nOr your boujee friends\nAnd I dont need love looking like diamonds\nLooking like diamonds\nI dont need you and your brand new Benz\nOr your boujee friends\nAnd I dont need love looking like diamonds\nLooking like diamonds\nRat-a-tat-tat on your dum-dum drum\nThe beats so fat, gonna make me come\nUm, um, um, over to your place!\nRat-a-tat-tat on your dum-dum drum\nThe beats so fat, gonna make me come\nUm, um, um, over to your place!"}], "artist": "André 3000"}