{"artist": "Wale", "songs": [{"title": "Effortless", "year": "2018-03-13", "lyrics": "[Intro]\nThere is she\nEffortlessly so stunning\nBaby, can we create something?\nDon't leave me wandering\n\n[Chorus]\n'Cause we're so effortless, girl\nThe way we bubble so effortless\nThat's why I love you\nYou got me shook up, shook up, shook up, shook down of your loving\nSo effortless, so effortless\n\n[Verse 1]\nFolarin, hol' up\nNever trust a big butt and a smile\nI been sippin' poison that's brown\nI've been here, but I've been low key\nCan't nobody say they've seen me around\nI got circumstances that got my circumference workin' backwards\nMy circle's small as a barber shop in a Rasta mansion\nLockin' with you as I unravel the possibilities\nWhen not with you I just miss your body, I got your energy\nGucci startin' to bore you ain't it\nYou rather patience and conversation\nShe mature, but she still a baby\n'Cause she get a check but still check my pages\n\n[Chorus]\n'Cause we're so effortless, girl (with your immature ass)\nThe way we bubble so effortless\nThat's why I love you\nYou got me shook up, shook up, shook up, shook down of your loving\nSo effortless, so effortless\n\n[Verse 2]\nWould you rather me put in work or be shy, baby?\nWould you rather me say you're perfect and lie, baby?\nWrite my name up in cursive between your thighs baby\nWould you rather me thirsty and you dehydrated?\nI got the feelin' I'm catchin' feelings I can't fade 'em\nCasual love is innocent but to care is fatal, uh\nIt's embarrassing carin' for some people\nThe heart you wear that's on your sleeve is there to mislead you, uh\nI know I'm petty and immature and I know\nI've been hurt before shouldn't be the source of my cold heart\nMaybe shawty could be the first\nTo show me how to love on a level where effort isn't work\n\n[Chorus]\n'Cause we're so effortless, girl\nThe way we bubble so effortless\nThat's why I love you\nYou got me shook up, shook up, shook up, shook down of your loving\nSo effortless, so effortless\n\n[Bridge]\nI want it as is, such a natural beauty\nAre you even real?\nAre you doin' this to me?\nYou're my favorite thrill\nAnd there is no rush\nBut I think the universe is speaking to us\n\n[Chorus]\n'Cause we're so effortless, girl (uh, right)\nThe way we bubble so effortless (we at West Lake of the late night)\nThat's why I love you ( I hit this drink so hard I think I just seen Mike)\nYou got me shook up, shook up, shook up, shook down of your loving\nSo effortless, so effortless\n\nShe can do this with no effort", "album": "It’s Complicated - EP", "image": "https://images.genius.com/bd1dbfedbdb01582a9faa8b4c3cd9330.355x355x1.jpg"}]}