{"artist": "Pastor Troy", "songs": [{"album": null, "title": "Get That Mone, Pt. 2", "image": "https://images.genius.com/c8486eeacddeb24d9c9128ca7be2c332.269x269x1.jpg", "lyrics": "Girls shakin that ass boy (Yeah)\nShakin that ass all in yo lil young face nigga\n(Yall know it's on)\nThem girls say, \"Troy bring another\nPop That Pussy for us\"\n(Get 'em out them thongs)\nD.S.G.G. where y'all at?\n(Ain't nothing but some money in here)\nThem Down South Georgia Girls\n(Yall know it's on)\nGet this money right (Get that money right)\nGet 'em out them thongs\n\n[Chorus] 2x\nShe on her hands and her knees and she workin that ass\nShe on her hands and her knees and she twerkin that\nAss\nShe on her hands and her knees and she shakin that ass\nStraight poppin that ass, I mean she droppin that ass\n\n[Verse 1]\nStep off in the strip club dead fresh\nRight in time for the amateur contest\nGo to the DJ give him bout 500 hundred\nI got some mo hoe I wanna see how bad you want it\nWho is this caramel from the A-T-L?\nYou know the business, my dick is hard as hell\nWhat you wanna do? Where the V?\nWhere the after P? What you drinkin B?\nWhy don't you come and dance for me?\nTake it to the ground don't be dancin all nonchalant\nYou don't wanna dance\nYou don't wanna hit my fuckin blunt\nWhat you really want is the money, you can tell me\nI'm the consumer, what you got to sell me?\nI'd rather pay, 'fore you call me everyday\nTalking out the way because I won't say\nWhere I'm at, or what I do\nA matter fact Ms. Bree fuck you\n\n[Chorus] 2x\n\nIn the V.I.P wit this new chick\nThey say they call her White, White Chocolate\nGreased up from her motherfuckin toes up\nWent to poppin that ass, had to tell her hold up\nDroppin hundreds, gettin blunted\nCause she super stunted\nPT tryin to cut\nWhite Chocolate what's up?\nI got the pent house, me and my nigga Red Mouth\nRound up yo homegirls and then we all can ride out\nLimo at the do', don't go if you playin hoe\nTake it to the flo', let me know that you is fo' sho'\nI ain't wit the games, spendin change I'm a balla\nI'm a act a bitch when I know I ain't gone call her\nTo all the, niggas in the club spendin cash\nShe on hands and knees, she shakin that ass\nAnd shakin it fast, and shakin it faster\nMake that ass clap for the motherfuckin Pastor\n\n[Chorus] 2x\n\nAye yo this joint right here is for all my ladies\n(Yall know it's on)\nAcross the motherfuckin nation\nWe do this big baby (Get 'em out them thongs)\nAll the DJ's in the strip club representing\nThat P-Troy shit (They know it's on)\nWhat's up baby we doing this thang big\n(Get 'em out them thongs)\nWhat's up Cacky Lac, what's up Charlotte\nGa in this motherfucker, Ga in this motherfucker\nGentlemen's club, Boom Boom Room, Boom Boom Room\nAll the strip clubs drop this motherfuckin blaze\nCrank this shit up, Let's get paid\nIt's going down in a major way\nWhat's up TD, what's up Royal, what's up Drama Boy\nWhere they at? Let's ride y'all, let's ride\nMan it's 4 o'clock in the motherfucking morning\nIt's 4 o'clock in the damn morning\nI'm drunk as hell, let's go\nTake me home", "year": null}]}