{"artist": "G Herbo", "songs": [{"title": "Do Yo Sh!t", "album": "Still Swervin", "year": "2019-02-01", "image": "https://images.genius.com/c9afa7b8044e0a1dd4a8eba6baf78768.1000x1000x1.jpg", "lyrics": "[Intro]\nOh, oh\nDY Krazy\nUh-huh, uh-huh, yeah\nWhat up? What up?\n\n[Chorus]\nUh, girl, what up? (Girl, what's up?)\nGo'n do that shit (Do that shit)\nGirl, do your shit\nYou know you the shit, uh\nGive a fuck who you with, uh\nAre you too cute to admit, huh?\nAre you too cute to commit, huh?\nYour nigga put some jewels on your wrist, huh?\nUh, girl, what up?\nGo'n do that shit\nGirl, do your shit\nYou know you the shit, uh\nGive a fuck who you with, uh\nAre you too cute to admit, huh?\nAre you too cute to commit, huh?\nYour nigga put some jewels on your wrist, huh?\n\n[Verse 1]\nYou know your bank account got G's, shoes got double C's, niggas droolin' and shit, huh?\nYou got them niggas choosin' and shit, huh?\nYou say you get to choose who you with, huh?\nHuh, then what, huh?\nI guess there ain't no rules in this shit, uh (Like a pimp)\nBut you know me, I'ma come through, score low-key, I don't like losin' and shit, uh\nWhen you wrote me, I was geeked up, ask broski\nCould've had me gone, it was so easy\nBut you went along, already know you ain't know me, so I went long 'fore you start teasin'\nAnd I come through like a pimp (Uh)\nYou know your last nigga was a wimp\nLet me put your name on a blimp, uh\nAnd I stand tall, no limp\nI'ma shoot my shot like Kemp\nFuck 'round, tip dunk off the rim\nYou know how I jump out the gym, uh\nMost important, you know I ain't nothin' like him\nAnd I know you ain't nothin' like them, uh\nWhen we at Benihanas, I get steak and lobster\nYou know I can't fuck with that shrimp, uh\nWhen I hop in the big truck, I roll up a big 'Wood\nYou know I can't fuck with no skimp\nAs I roll out the zipper, she undo my zipper\n'Cause I can't do nothin' but win, uh\nNow I can't do nothin' but grin (Blessed)\nI'm feelin' and touchin' her skin\nWe gon' end up fuckin' again, uh\n\n[Chorus]\nUh, girl, what up? (Girl, what's up?)\nGo'n do that shit (Do that shit)\nGirl, do your shit\nYou know you the shit, uh\nGive a fuck who you with, uh\nAre you too cute to admit, huh?\nAre you too cute to commit, huh?\nYour nigga put some jewels on your wrist, huh?\nUh, girl, what up?\nGo'n do that shit\nGirl, do your shit\nYou know you the shit, uh\nGive a fuck who you with, uh\nAre you too cute to admit, huh?\nAre you too cute to commit, huh?\nYour nigga put some jewels on your wrist, huh?\n\n[Verse 2]\nI know you don't touch other men\nYou know when I'm in the stu', I ain't touchin' a pen\nYou know I hop in that drip and don't touch it again\n'Fore I turned 21 I was touchin' an M (You know that)\nI'm in that S-63 Benz\nReally I just been bool, I ain't get it in\nIt's just me and like two or three friends\nBut they'll move around if you gettin' in\nLet the sunroof down if you gettin' in\nIt's like you ridin' outside, you can feel the wind\nAnd you know you protected, I got this bitch right on my hip\nDon't believe, you can feel it then\nMight tell you 'bout some shit I done really did\nBut hell nah, you might think you a killer then\nYou ain't never seen money to the ceiling then\nI'll have your head spinnin' like a ceiling fan\nI grew up with gorillas and killers and\nI just gotta say when and I send 'em in\nYou would think they go fishing and reel 'em in\n'Cause they always come with who I send 'em in\nIf I wasn't born in poverty, I wouldn't be a sinner then\nHow the fuck we gon' eat without dividends?\nYou ain't never met me, I ain't do what I had in the streets to get 'head, don't be bitter then\nAnd I was dead broke, I remember when\nI taste good in your mouth like cinnamon\nAnd you know I'm still the man like gingerbread\nI'ma roll a Backwood while I'm gettin' head\nAnd he broke, he ain't never seen six figures\nSo don't tell me 'bout nothin' no nigga said\nHang with nine rich niggas, you gon' be the tenth one\nYeah, I think that was somethin' that Jigga said\nYou ain't rich until your niggas rich with you\nYeah, I think that was somethin' I should've said\nAin't gon' never get up 'less you go without\nAnd I think that's the reason I get ahead\nGotta pick that bitch up when I leave the house\nThen put one up and pray I don't end up dead\nOff a Perc', that's the reason my eyes red\nGotta stay high 'cause I don't wanna feel the lead\n\n[Chorus]\nUh, girl, what up? (Girl, what's up?)\nGo'n do that shit (Do that shit)\nGirl, do your shit\nYou know you the shit, uh\nGive a fuck who you with, uh\nAre you too cute to admit, huh?\nAre you too cute to commit, huh?\nYour nigga put some jewels on your wrist, huh?\nUh, girl, what up?\nGo'n do that shit\nGirl, do your shit\nYou know you the shit, uh\nGive a fuck who you with, uh\nAre you too cute to admit, huh?\nAre you too cute to commit, huh?\nYour nigga put some jewels on your wrist, huh?"}]}