{"songs": [{"album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "title": "Can’t Cry", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg", "lyrics": "[Intro]\nYeah\nNeed y’all niggas to feel me, yo\nFeel my pain\nSaid soft niggas can’t last hard times, yo\nBelieve that shit\nYeah, (Yeah) aye (Aye)\nReal niggas don’t cry\nLook, yo\n\n[Verse 1]\nWas just a youngin’ with that fresh fade\nBird chest, legs skinny\nThat hoop dreaming had me tryna be the next Penny\nFresh pennies on my feet\nMomma paid for everything I’m wearing\nAt the fair staring at girls, not a care in the world\nAw nigga, but shit done changed since Maine was my nickname\nA little nigga chasing things, tryna kick game\nNow I’m a man worried about my fam\nLet me explain\nIt’s like my pockets stay broke, and if not them shit’s sprained\nAnd so I rap for my niggas trapped in the struggle\nYou feeling like the world’s on your back so you stumble\nIn the field like a quarterback get sacked, then you fumble\nJobs don’t call a nigga back, so it’s back to the hustle\nNiggas praying for they moms, the same time they moms pray for them\nAsk the Lord to stay with them, guide them on they way\nBut damn a nigga been a lost faith\nIt hurts on the usual\nThe only time you catch me up at church is a funeral (damn)\n\n[Hook]\nSometimes sunshine turn to rain my nigga\nThe same ones you love will bring you pain, my nigga\nI don’t know if I’ll see tomorrow\nBut I won’t cry, no, I can’t cry\nAnd in this life times getting hard my nigga\nBut fuck that, I’m aiming for the stars, my nigga\nI won’t stop, try ‘til the day I die\nAnd I won’t cry, no, I can’t cry, no\n(ay, ay, ay, yea)\n(listen, yo)\n\n[Verse 2]\nI sit back and watch the news every now and then\nEither get depressed or mad from watching the world just crash\nEven the weather’s bad\nIt be the same shit, got my brain twisted\nLike, “Damn it’s ’06 and niggas still up on that gang shit?” (that shit old, dawg)\nYesterday this kid got his whole frame split\nOnly seventeen, he was finna to graduate in like three weeks, some stupid niggas got him for his chain\nBut he fought back, they blasted him and left him on the pavement, uh (rest in peace)\nAnd now they telling me this little girl just got raped\nSome dude snatched her, she was standing at the bus stop\nWait, man she was eleven!\nWhat the fuck is up with this world?\nGot these grown niggas fucking with girls?\nPlus the cops harassing us\nEvery week be blasting us, on accident, or so they claim\nReporters sympathizing like they truly know the pain, (right)\nThey killed her only son\nNow she wanna blow her brains out\nChange the channel man, I can’t watch this shit\n\n[Hook]\nSometimes sunshine turn to rain my nigga\nThe same ones you love will bring you pain, my nigga\nI don’t know if I’ll see tomorrow\nAnd I won’t cry, no, I can’t cry\nAnd in this life times getting hard my nigga\nBut fuck that, I’m aiming for the stars, my nigga\nI won’t stop, try ‘til the day I die\nAnd I won’t cry, no, I can’t cry, no\n\n[Verse 3]\nTake a ride through the city man, tell me what you witness\nPoverty, richness, crooked cops and misfits\nViolence, hatred, real devastation\nNeighborhoods looking like there’s still segregation\nWelfare, single mothers, no jobs\nTryna get a piece for yourself, but they hogging up the whole pie\nFiends in the street so high off of that crack shit\nThis nigga thirteen with a gat under his mattress (bang!)\nWhite folks got the road to success mapped and that’s all good\nBut why don’t blacks got that same atlas?\nI asked the same question a million ways\nAnd it seems like I done prayed for a million days\nBut still the ills remain, just bills and pain\nShootouts in project buildings, children slain\nSkies filled with rain and I just sit and wonder why\nIt's enough to make a nigga wanna cry, but I can’t though\n\n[Hook]\nSometimes sunshine turn to rain my nigga\nThe same ones you love will bring you pain, my nigga\nI don’t know if I’ll see tomorrow\nAnd I won’t cry, no, I can’t cry\nAnd in this life times getting hard my nigga\nBut fuck that, I’m aiming for the stars, my nigga\nI won’t stop, try ‘til the day I die\nAnd I won’t cry, no, I can’t cry, no\n\n[Outro]\nYeah, shit dedicated to my cousin Ricky man\nHoop dreams cut short man\nLearned he had a baby on the way\nNigga wasn’t even a senior in high school, though\nHold your head man"}], "artist": "J. Cole"}