{"songs": [{"year": "1999-11-30", "album": "Amplified", "image": "https://images.genius.com/6e84984f4b00329695a16521d47f4aca.300x300x1.jpg", "title": "N.T.", "lyrics": "[Verse 1: Q-Tip]\nFor real though, who really got sick flow?\nOn the edge, not the ledge hangin' out of the window\nBird chest niggas with ya wind of this fear rap\nFuck around you'll be minced meat inside of a meal sack\nPuny little punks better hit the gym\nBut that doesn't mean nothin' to the heart within\nYou cramped up, you and your team, I'm amped up\nAnd you asses can't dim my beam\nMy shine what the fuck is on your mind?\nLittle weakling rappers better hit the grind\nOther brothers ain't motivated, they can't do it\nNot only did I penetrate it, I ran through it\nMy music comes on and we mosh at the dance\nInside of your mind or you're inside of my pants\nMusical intentions that we have is vast\nYou sick? Drink a NyQuil, well, I'm bed on your ass\nOh well then here comes the gelatin\nTip's on some shit is what you yap on your cell to friends\nNow your party is completely blown\nReal name is Kamaal, I'm in \"complete me\" zone\nIt's rap time, for you, that means nap time\nReachin for my joint? What the fuck, I'mma clap mine\nSingin songs of sixpence, you sit tensed\nSurprised your ass at the end like The Sixth Sense\nHeavy hitters knocking shit out the park\nYou didn't even really play, tell me why did you start\nSpittin' sharp blades laced with bleach\nYou wanna play around, kid? I'm not a walk at the beach\nA stroll in the park or your fuckin' playground\nPut on your headphones, tell me how grenades sound\nPut on your walk face and go underneath the town\nQ-Tip, Abstractm how I gets down\n\nChorus: Busta Rhymes + [Q-Tip]\nAll my bitches, dance if you know that you damn sure\nLet your pussy drip on the dance floor if you wanna\n[Get down]\nFuck that niggas will bust gats\nBetter lit a make for their rush that cuz they wanna\n[Get down]\nFlip this piano sick shit\n[Get down]\nChill you can get off my dick and\n[Get down]\nWhile I'm on the hook get on your good foot\nAnd blow up the spot for all of you niggas cuz that's how we\n[Get down]\n\n[Verse 2: Q-Tip]\nComin with the brand new quickly we pan to\nThe young black man with intentions to ban you\nSeems that people need an aid today\nSo many fade away, so many fiend to stay\nI really rhyme cuz I feel I should say things\nWhile the fraudulent act rap just so they cop rings\nOr maybe because when they was young\nThey was fronted on and left alone to have their own fun\nNow they're all grown up to be assholes\nI'm giving you the rope, will you tie it to lassos?\nYou swing dangling from peach trees\nWhile I sip my Daiquiris in the Southwest breeze\nWritings so exciting the pen it keeps\nDrippin out jings that's converted to hymns and them\nPeople be hummin it from now to their next of kin\nMy family is starving? You know they want me to win\nMe, forfeit? Nigga, please get off it\nSend the check in my name to my office\nMutombo in the lane, yo, I toss it\nAbstract comin through, witness the bomb shit"}], "artist": "Q-Tip"}