{"artist": "Wale", "songs": [{"title": "Cassius (Excellency) [Feat. DJ Money]", "year": "2018-05-07", "lyrics": "[intro]\nAli:\n\nHold up!\nBlack excellence\nI be repping it differently uhh\nTo Howard coast tell em how are you with this rapping thing uhh\nUnderrated from chocolate city with all the flavor\nMy bitches ball like im Q Mcall they Sanaa Lathan\nBlack excellence\nWe depart from the negative boy\nBlack denim that keep a knot like a pessimist boy\nBlack niggas, hate black niggas that’s evident so\nKeep black windows\nWith masked niggas\nThat never miss boy\nCharles Manson is celebrated somebody save us\nDr. Sebi was really curing what people gave us\nIm a beacon of what you become if you got passion\nI feel like Ali\nBut feel like I be where all the cash is\nNever could reach the masses\nLabel said im to deep\nThen I told them people let’s drown then\nBlacks executed for moving around and maybe I think to deep, but  think it be for this brown skin\nPro black isn’t anti-white\nBut how we act like we don’t seen no tiki torches at night\nDig\nPro black isn’t anti-white\nBut if a Nazi try me, catch these Ali hands on site ya dig\n\nUh\nYo\nBoy\nYea\n\nBlack excellence\nA young perfectionist\nWhite America fear us intelligent man with melanin uhh\nRap effortless, son of African immigrants\nEvery bag of this pack like I’m ‘bout to ptttthhh pttthhh with anyone\nYou a field nigga, (field)\nPosin’ Ass real nigga\nAn uncle Tom that can sorta rhyme, so they deal with ya\nAnd me I see through it\nThe honorable Wale Folarin, Cassius Muhammad, Sonny Liston you heel niggas\nSay my name......Olu\nNow Say my name......Olu\nTell the ref to lift up my fist\nWhich to aim and pay me my loot\nBlack excellence uhh\nBlack Lexus that ahh\nNever drive it, ride me if you get the drift\nI’m the underdog, they don’t talk about what I’ve done, (no)\nThe odds seven to one to seven bell you’ll be done\nI talk how I talk, (talk)\nI’m walking that walk, (walk)\nCould never fight for a country that want me to fall\nExile for a short minute when Zyla was born\nI\nBeef with her mom a lil its throwing me off, (Sorry)\nBut I’m back that’s my word, (word)\nIf these bags that I be in a speed bag it’d go brrrrrrt yea\nLike that with the words, (woo)\nBlack excellence\nChocolate city bitch\nI’m on the phone with [?] and [?]\nTalkin a milli bitch\nJust the correctional, cut the message off really quick\nNo pressure, impressive, despite they’re effort I’ll hit em again\n\nDouble M and DC y’all, and ima rep my dog\n\nYea\nNaw,.\nY’all never catch my bars\nI mean I write it, I really write it\nI’m still southpaw\nAwkward\nLefty\nIntrovert, it’s hard to get near me\nThat’s why I’m in interviews high\nCause I be highly defensive, forreal (real)\nIm Black and Im proud\nNo walking me down\nWe shocking the world again let me give that out\n\nBlack excellence\n\nBlack excellence\n\nBlack excellence\n\nHold up\n\nHold up\n\nYea hold up\n\nSay my name Olu....", "album": null, "image": "https://images.genius.com/a934d89caa40cf3d07e1244d90d64ff7.630x625x1.png"}]}