{"songs": [{"year": "2008-11-04", "album": "The Renaissance", "image": "https://images.genius.com/5d721c8b6f6e8f0141dafa2547e2bd79.500x500x1.jpg", "title": "Won’t Trade", "lyrics": "[Intro: Sample]\nWelcome to 'All Sports, All Day.' Today on the program, trade talks. Continue in New York City, but it doesn't disturb his productivity on the field\n\n[Verse 1: Q-Tip]\n(Now that I know what it is, boy)\nFor your epitaph, niggas laugh, chicks steady gas your ass\nSiphoning out your cash, seein' the door, the flash\nWhile I stay enclosed, walkin' out in my clothes, she said\n(I wouldn't trade it for nothing)\nYou motherfuckin' right, wantin' this shit every night\nFinish up, I hold her tight, wearin' feelings on my sleeve\nEven when I had to leave, cooler than the evening breeze\nDo you believe? (Gotta believe!)\n(I wouldn't trade it for nothing)\nThe Division One leader, in the rebound with numerous shorties\nOff the post, goin' coast to coast, she on the hardwood\nSub, I'm out the game, she sayin', \"Nah, he good\", I mean\n(I wouldn't trade it for nothing)\nFor no amount of dough, franchise this man\nGive him all the things you can\nThink long-term plans, he be bringin' in the fans\nFront-page magazine, listen to this lady scream:\n(I wouldn't trade it for nothing)\nCause she know what's better for her\nToppin' in the peckin' order, fluid like the runnin' water\nNicest nigga? Kinda, sorta\nWhen he screamin' just the slaughter, no matter the quarter\nI get it (I wouldn't trade it for nothing)\nThe club-house king, battin' practice, slug and swing\nGametime's anything, when I'm in, you're 'bout a minute\nHoldin' the bat, it's good as fact\nShe's out the park, and comin' back, she sayin'\n(I wouldn't trade it for nothing)\nEverywhere you sit you get a good view of the ballplayer and all\nAnd the famous hall inevitably will make a call\nHangin' memorabilia from your walls\nThis is why you can't trade me\n(I wouldn't trade it for nothing)\n\n[Press Conference Interlude 2]\nWhen asked about the trade rumors, he simply replied that he's just here to produce, to put forth the best effort for his team\n\n[Verse 2: Q-Tip]\n(Now that I know what it is, boy)\nYou can put your money on a sure thing\nCertain profits will they bring\nCeremonies are the ringer, in the White House thing\nClear your mantle, the trophies I bring, do you wanna trade?\n(I wouldn't trade it for nothing)\nCause in the end as a teammate\nYou're lookin' for a back shoot, and go-to ball\nLeaves it all on the floor, always lookin' to score\nPep-talks in the locker-room, this is why you sing this tune\n(I wouldn't trade it for nothing)\nAnd injuries can't make me sit out, I ball till you get out\nHook off, no di-doubt, and all like get out\nI train for the pressure and come out fresher\nEquipped for the game, you know my name, it makes me better\nA cheer, for the whole team, let's go, for the whole thing\nThe ballad that you're holding, MVP voting\nAnd I, represent the sentiment, you're emoting, as you say\n(I wouldn't trade it for nothing)\nThe physical ability, with mental capability\nLegitimately places me inside of your vicinity\nAnd I ain't really seein' me vacatin' this community\nI'm stayin' here (I wouldn't trade it for nothing)\nI'm glad that you feel this way, here's where I like to play\nI need to hear it everyday, they cheer for me, say, \"Ole\"\nWait a minute, \"Andele\"? I dunno, well, anyway\n(I wouldn't trade it for nothing)\n\n[Outro: Sample]\n\"There was a lot of talk, there was buzz and your name came up in the- in the trade rumors ugh, how seriously did you take that?\"\n\"Uh... uh, not serious at all really\""}], "artist": "Q-Tip"}