{"songs": [{"year": "2011-05-03", "image": "https://images.rapgenius.com/84c56f61213c4ffdcd67d8e4968c74c7.500x500x1.jpg", "title": "5-6", "album": "Damn Fool", "lyrics": "[Intro]\nYeah, right here is where all my villain niggas ride with me, ya dig?\nWe 'bout to rep that 5-6 block, boy!\nHighland & Wayne, don' act like y'all don't remember!\nThis how we do it, does it, this how we done it, ya dig?\nGet up on it, if you ain't wit it you slipping! 5-6 shit! Let's go!\n\n[Hook]x2\n5-6, 5-6\n5-6, 5-6 (villain nigga)\n5-6, 5-6\n5-6, 5-6, I'm from\n\n[Verse 1:Big Scoob]\nRepetitive as evident, I'm proud of my soil\nAnd every verse of every song I be repping it royal\nGot it tatted on my shoulders, nigga dig that\nIntroduce you to my hood when I spit rap\nGot you drinking what we drinking when you parted out\nGot every city 'cross the globe screaming Vill wow\nIt's amazing how it's changing with this rap thing\nA gutter movement with this music now we got fame\nBut I remember when  this music wasn't cracking man\nOn the block with my Glock doing my trapping thing\nAin't much difference in existence man we still the same\nThe only difference 'stead of Highland now we moved to Wayne\nStill got villains from the block steady trapping caine\nThat sticky icky,PCP, and some went back to caine\nI'm tryna make it for my dawgs, put em on the plane\nI'm tryna fly so they can fly now what's that block name\n\n[Hook]x2\n\n[Verse 2:Txx Will]\nIf you ain't from 'round here then you 'gon need a pass\nCause if I say let's get this nigga then that's gon be your ass\nThere's plenty violence 'round here man but pity it runs low\nWhere young killers getting high off gunsmoke\nIn weekends on Wayne get the work up\nFrom Friday nights till Clever open church up\nAround the clock, [???] 3 days no shower, newspaper says we average 62 quarts an hour\n56 is the hood, it's the hood, and ya heard, 7 out of any 10 niggas putting murders down\nFuck ya weak ass block cause it's not mine\nMine the one with bullet holes in the stop signs\nThis is real shit, Vill shit, let's get this clear\nPizza Hut ain't delivered round here in years\nThey say we roguish and we way too violent\nRemember that the next time before you turn on Highland\n\n[Hook]x2\n\n[Verse 3:Big Scoob &Txx Will]\nThis the part where my villain niggas stand up\nGot 'em rocking on the movement with they hands up\nI remember seeing hands up for a different reason\nPull that pistol tell them pussies that they ain't leaving\nTake it easy for me villain that's all in the past\nGot these people screaming villain time to get the cash\nBig homie it ain't nothing you just make the call\nImma fall back play the role for my dawg\nBest believe me, gutter living made us too greasy\nSo from that, then go to this man it's too easy\nI said I'm with it but it still got my heat with me\nPlay me funny, Imma gun a nigga real swiftly\nOnce a fool, still a fool how the game goes\nIf I can change, then you can change let's get this change bro\nHell yeah, money motivate me real tough, keep it street, we gon eat, so through the block up\n\n[Hook]x2"}], "artist": "Big Scoob"}