{"songs": [{"image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg", "title": "High", "album": null, "year": null, "lyrics": "[Talking: Nas]\nThe wild Gremlins\nYa'll know the F. right?\n\n[Verse 1: Nas]\nWhen the winner lose... and the losers win\nNobody scores just a few good men\nBut everybody sins\nA lot of young die\nFall in the trap, strung high\nTry to go legal, but the hood calling you back\nFlipping the crack, cause I miss it for example\nWatching base-heads wildin' on my first sample\nI elevated up, since snakes in my circumference\nNow I hit my niggas with cakes and say, \"Pump This\"\nThank god for cracks, corners, and marijuana\nHoodrats and good gats to carry on ya\nI got dead friends, misled friends, crackhead friends\nWild Gremlins, who \"bust led\" friends\nSilent weapons for quiet wars\nOr loud gats\nTussle too long, some shiny moves the crowd back\nIt's powerful, niggas would die over respect\nAnd money is secondary to that whole aspect\n\n[Hook: Nas]\nI Love it, when I'm... High\nI'm at my Best, when I'm... Hiiigh\nI like my sex, when I'm... Hii-iiigh\nCash, Tecs... Flash Tecs, when I ride through ya projects\nAnd clap at sets, a nigga... High\nNorth, South, East, West, riders get... Hiiigh\nI take ya'll niggas on a lyrical... Hii-iiigh\nI twist it up, Listen up to the real shit, feel this, REALNESS!\n\n[Nas:]\nNiggas rushing to the top, not knowing what it takes to be...\nKing Of The Industry, the wise move patiently\nYa niggas is hating me, won't be happy till I'm back witcha...\nSelling crack witcha, half & half on a pack witcha\nMy pen and pad, paint a black picture...\nOf young goons passing liquor, after-hour store mass of niggas\nStreet corner combos, staggering winos...\nTahoes coming through, blasting songs I know\nNiggas scheme, girls pregnant by sixteen\nClique out to get rich...\nEmpty clips for cream\nSame funeral home, for different stiff bodies\nOnce a month a new family goes there, it don't surprise me\nCried 'til the tears, dried up inside me\nRevenge to the end, laws in NYC\nGot up by the way I used to be...\nApartment 5D... where dope fiends in the hall try your knob when you sleep\nSurveillance Cameras in my house now, watching you creep\nSpot you from deep, guns for all possible beef\nNiggas try to rock you asleep\nKidnap your whole fam for a week\nAsking for ransom, niggas starving, dying to eat\n\n[Hook: Nas]\nI Love it, when I'm... High\nI'm at my Best, when I'm... Hiiigh\nYo... I like my sex, when I'm... Hii-iiigh\nCash, Tecs... Flash Tecs, when I ride through ya projects\nAnd clap at sets, a nigga... High\nNorth, South, East, West, riders get... Hiiigh\nI take ya'll niggas on a lyrical... Hii-iiigh\nI twist it up, Listen up to the real shit, feel this, REALNESS!"}], "artist": "Nas"}