{"songs": [{"year": "2011-10-14", "album": "The Nebulizer", "image": "https://images.genius.com/108c1549cb9fa7e49685238b78f6936d.600x600x1.jpg", "title": "Gonna Get Hi Today", "lyrics": "[Intro: Anthony \"Rats\" McCarthy]\nI get that feeling, like every day\nI'm just trying to escape but it ain't easy, it ain't easy, yeah\nSo I'm gonna get higher and I'm gonna get higher\n'Cause it ain't easy, it ain't easy, yeah\nBaby, baby, I know (baby, I know)\nBaby I gotta go (I gotta go)\n'Cause you don't fiend like I do (you don't fiend like I do)\nTell me what can I do?\n(Gotta get my drink on) Gotta get my drink on\n(But I don't wanna bring you down) Don't wanna bring you down\nI really gotta have it girl to ease my mind\n('Cause I'm not gonna be here for long) I'm not gonna be here for long\nI get that feeling, like every day\nI'm just trying to escape but it ain't easy, it ain't easy, yeah\nSo I'm gonna get higher an I'm gonna get higher\nCause it ain't easy, it ain't easy, yeah\n\n[Verse 1: Kerser]\nOnly god knows why I choose to do what I do\nIt's like I'm never level headed killing, killing the mood\nOr better yet, I'm meant to fill in the truth\nIt's all I do, I write the truth and I spill it to you\nI pop a pill in the booth, I really need to get my head straight\nMemories are blank, like why I didn't make tenth grade\nI'm getting high and drunk, I'm climbing up and might'n jump\nThat depends on if you gonna promise that you'll buy me drugs\nI enjoy it when they block out the stress\nAnd, for the alcohol, I sip it 'cause it blocks out the rest\nI've got no oxygen left, and they screaming at me \"wake up\"\nAmbos at my house, they ask my mates \"well, did he take drugs?\"\nThat should draw the line, fuck that, I snort the line\nHave I lost my mind? It's safe enough to say it's borderline\nI think I'm giving it up-nut, I'm snipping a bud-cunt\nWhile sniffing the dust up, I'm living life fucked up\n\n[Hook: Anthony \"Rats\" McCarthy]\nGonna get high today\nFeeling all my troubles go away\nGonna get high today\nFeeling all my troubles go away\nH-I, I get high\nH-I, I get high\nH-I, I get high\nH-I, I get high\n\n[Verse 2: Kerser]\nI lost the track of days, like \"what's the date?\" I'm off my face\nI'm wondering if what I say can make a kid go pop today\nI gotta say, please don't look up to me, it's nothing nice\nMy fucking eyes look like they've been in scuffle fights and pumbled twice\nBut that's the lack of sleep that happens when I'm having E's\nFuck getting scattered, I call Nebs like \"let me smash a beat\"\nWhile drinking liquor with a Xanny tab, the only way\nI'm ever slowing down is if the motor breaks with open flames\nI'm broke again and yesterday I had a big wad\nSpent it all on drugs and then I bought some kicks, bitch what\nA million reasons why I'm off my head, don't question why\nI'm wondering if I should even tell them why I'm getting high\nThe life I'm living got me tripping, sipping, got no chaser\nGot no way to ever make it out of getting off my face, I\nTake another one, yep, and then break another one's neck\nAnd take the hundreds and jet and waste the money on...yep\n\n[Hook: Anthony \"Rats\" McCarthy]\nGonna get high today\nFeeling all my troubles go away\nGonna get high today\nFeeling all my troubles go away\nH-I, I get high\nH-I, I get high\nH-I, I get high\nH-I, I get high\n\n[Verse 3: Kerser]\nI show my face, they know their place, I'm riding 'round with gallons\nOf that manufactured slapped and battered rapping hazard magic\nBut, call it medicine, I'm getting off my head again\nI'm mentioning, if they gon' fuck my brain, well, then I'm getting 'em\nWhat the fuck? You think I'm sober? I don't ever think that's\nTaken place. I made mistakes like lacing cakes with eights of base\nSo give me more of anything to give my head a buzz\nThe deadly drugs; I'm getting up with anything they pressing up\nStamp the pill, enhance the deal 'cause I ain't leaving gronk\nReach is long, I punch you in the face and fucking breach my bond\nTell me, I ain't living how I'm spitting, got the proof\nI'm watching you, I turn you into something they call (chopped and screwed)\nThe lot of you are biters, biting out on what I do\nI'm getting drunk and high to try and help the stress I gotta move\nBut that ain't working so I'm back up on my drug shit\nA shot of scotch, a shot of vodka, then I got the bud-lit\n\n[Hook: Anthony \"Rats\" McCarthy]\nGonna get high today\nFeeling all my troubles go away\nGonna get high today\nFeeling all my troubles go away\nH-I, I get high\nH-I, I get high\nH-I, I get high\nH-I, I get high"}], "artist": "Kerser"}