{"artist": "R. Kelly", "songs": [{"album": "R.", "year": "1998-09-11", "lyrics": "[Intro: Tone]\nUnstoppable\nTrackmasters, Rockland, come on\n\n[Verse 1: Foxy Brown]\nNa-na so sick, make your toes twitch\nGet up in yo' ass and ride that shit\nOh yeah, dare you act shady with the first lady?\nLet's go half on this baby\nInner thighs thick so when we fuck you must put me in a swiss ho'\nRoom 704, fuck they mad at me fo'?\nSkin copper, na-na stay proper, who could stop her?\nNuthin'.  Hey, do a somersault\nAll that platinum shit you bought?\nNigga, fuck you thought, it ain't my fault\nKeep the wrist rocky, attitude cocky\nNext time you see me, address me like, \"Miss Foxy\"\nIt's for the wrist? Cop it.  If it's a six?  Drop it\nThongs with topless, how you like that Robbie?\nAin't nothing sweet, you know my style, doggy style\nFrom the back, in the back, hit it like that\n\n[Chorus: R. Kelly & Foxy Brown]\nThe dolla bill\nNuthin' but stacks get you anything\nAnywhere, as a matter of fact, dollar bill\nSay what you want baby\nWhile you be stalling at the lights\nWe be dippin' in Mercedes\nDollar bill\nCan get us from here to Rio\nIn two hours first class still time to take a shower\nThe dollar bill\nWhere ever we be it's VIP stats,  no doubt\nSo what y'all cats know about that\n\n[Verse 2: R. Kelly]\nSay lady, I'm liking what I see\nCome on and talk to me baby, baby, baby\nCan't you see one night is all I need\nWe'll go somewhere and be\nTalkin' about your future plans with me\nI would do anything\nTo have you in my life,  that's right\nWe can take a flight out of here, go anywhere\n\n[Verse 3: R. Kelly]\nUh uh, I got proof rims on the V-12\nMake you raise the roof, no gold in the tooth\nPut some in the vault CD's overseas\nPrivate lofts, I'm you haters holocaust\nAin't my fault I rap, then still made a mill'\nBut it's my fault I got my own label deal\nVacation in Japan while you wish for Bennihana's\nOn the way to pick up Madona, the ill na-na\n\n[Verse 4: Foxy Brown]\nNow you know the na-na plays with the big boys, aye'day\nFrom the six coupe to the big Royce, can you handle that?\nA lotta sass and ass with that\nAnd I'm strictly for the dough\nSo, fuck you think I'm here fo'?\nPrincesses in a row, row platinum status\nIce lace to pink face\nThen I back the faggots\nSee me rocking ery'thang from Mongolians to Persians\nY'all still learning, I got 'em swervin', through a sermon\nAnd there's nuthin' you can tell me 'bout these cats that I\nDon't even ram through a plan, too much stack\nMust I, continue this?\nMight be a couple of cats that I miss\nWe could skip the French kiss, take it straight to the wrist\nAnd it gets no iller than this\nNa-na engraved on canary ice, see me wear it twice\nDid y'all niggas hear me right?\nMe and Kelly put the lock down on New York to Chi-town\nHis town to my town, for the dollar bill\n\n[Chorus: R. Kelly & Foxy Brown]\nThe dolla bill\nNuthin' but stacks get you anything\nAnywhere, as a matter of fact, dollar bill\nSay what you want baby\nWhile you be stalling at the lights\nWe be dippin' in Mercedes\nDollar bill\nCan get us from here to Rio\nIn two hours first class still time to take a shower\nThe dollar bill\nWhere ever we be it's VIP stats,  no doubt\nSo what y'all cats know about that\n\n[Verse 5: R. Kelly & (Tone)]\nTell me who dat said dat we couldn't rock\nI roll the dice, bet the dots say we won't stop\nI roll from Chitown to Cali, hit your block\nI bless the day that R&B music meet hip hop\n(You haters thought that Kelly couldn't keep it hot)\nEven when I'm in your face, y'all see me not\nSportin' nothing but the rocks, navigators on the block\nMerridian CD's with five TV's\nCollege honeys follow in your GS3\nWe on the way to IHOP, coming from the spot\nNiggas in the lot jammin' to the knock\n(Y'all mad cuz you can't get what we got)\nWho's the number one contender, January through December?\nCut your forest down while you niggas screamin' Timothy\nSophia know me from the beach house in Miami\n(Banks know me) so I could give a damn about the Grammies\n\n[Outro: R. Kelly]\nThe dollar bill\nDollar bill y'all, dollar bill y'all, dollar bill y'all\nThe dollar bill\nDollar bill y'all, dollar bill y'all, dollar bill y'all\nThe dollar bill\nDollar bill y'all, dollar bill y'all, dollar bill y'all\nThe dollar bill\nDollar bill y'all, dollar bill y'all, dollar bill y'all\nThe dollar bill, Track Masters, Rockland", "title": "Dollar Bill", "image": "https://images.genius.com/975a62d87a698c2af865a7c6aada8692.1000x1000x1.jpg"}]}