{"songs": [{"image": "https://images.genius.com/3e9eb1a54603939f78e669e77c3051a3.500x500x1.jpg", "album": null, "title": "Dear Watsky", "lyrics": "[Verse]\nDear George\nThis may seem a little premature\nBut let me inform and reassure you what I'm here for\nSee:\nThere's three of four MCs I simply adore\nAnd I can't really afford for them to be ignored\nThey rap with purpose, challenge your belief and more\nThan scratch the surface, Grand Wizard Theodore\nYou see, I hear you perform\nAnd then I feel all tingly and warm\nLike these things are seeing porn\nTherefore:\nI thought it'd be mint if we recorded\nSo if you want to do this thing, give me a call, it's\nAnother pale kid sitting in his bedsit\nSpinning syllables in a ball, it's a head trip\nI want to give props, though I'm not often a dick sucker\nAnd it isn't often that I kiss butts\nYes, but it isn't often that I hear lyrics bringing this stuff\nSo let me pucker my lips up and give love\nYour subtle lisp just gives a certain crispness\nTo your presence, like red ribbon at Christmas\nYou lyrically bring a vision, images and pictures\nTo widen the line of our sight like strabismus\nListeners reminice for the time\nRap was a little bit deeper than just the meniscus\nYou must have missed or dismissed this missive\nThat insists on simplistic lyrics to get hits\n'Cause our business is a harsh mistress\nWhen MCs receive more spins than a discus\nBut the chips don't stack quick, I'm left listless\nSo I might just get down with the thickness\n\nBut hold on, there's another way\nWatch, see?\nYou can be a geek like me, Watsky\nOr any other bugger keeping it real\nWith stuff for people to feel\nRegardless of if it leads to a deal\nThe secret to really having fun for yourself\nIs to differentiate between money and wealth\nI spent years trying to be somebody else\nAnd then I realised it wasn't good for my health\n\n[Outro]\nRap's in need of a bit of positivity\nSo maybe a love letter is a good place to start\n'Cause I love letters (hah)\nHey George, George\nIsn't rap fun?\nIt's like weaving a tapestry of language\nI luv it\nWhy don't more people do this?\nImagine if the great musicians, playwrights, poets of the past\nHad this technology at their disposal\nWhat would they do with it?", "year": "2012-07-30"}], "artist": "Dan Bull"}