{"songs": [{"year": "2010-02-02", "lyrics": "[Intro]\nOkay, this is very simple\nI come in, you take your clothes off\nAnd I take pictures, m'kay?\n\n[Verse 1]\nShe gets up and takes a shower\nNow she's in the mirror for hours\nBy the way, she's a model of course\nHere all made-up in make-up powder\nWalking on the runway\nBut she don't know where she going\nShe just hoping that she keep rolling\nChildhood broken, 10 years later now she's a ho\nAnd everybody wonder, why does she act so cold\nCause all that attitude ain't natural\nLeave that drama on that there door\nCause I ain't really into all that therefore\n\n[Interlude 1]\nYes, yes, darling\nYou look absolutely magnificent on this wonderful and spectacular evening\nBut um, would you mind showing some more cleavage, would you then?\n\n[Hook]\nWatch her take off her bra\nPosing like a star\nSmiling for the camera, camera\nAh, she's a movie star\nWith that runway walk\nJust smiling for the camera, camera, camera\n\n[Verse 2]\nShe from a town far away\nThen she moved from the A to go to Georgia State\nAnd then she got turned out, then she dropped out\nNow she's an actress who wants to sing\nBut ain't that pretty\nShe's just trying to mimic the life in the city\nTrying to keep up with that limelight living\nJust wishing for one audition and video position\nBut it ain't how she used to be\nAt 2 or 3, now she's a hoochie freak so\nNow they wonder if you will see\nJust a little old cutie with a booty, booty\n\n[Interlude 2]\nDarling, darling\nWhy the long face, why the long face?\nEverybody loves you, girl\nEveryone loves you!\nYou know, you're going to be legendary one day\n\n[Hook]\n\n[Verse 3]\nShe dropped out of school at 16\nAnti-abortion, her dad is missing\nThen she got her a job at Wendy's\nTwo years later, she's into stripping\nTwerkin' that bunny\nJust to make her some daycare money\nAnd to pay for the rent bill monthly\nHer son saying that ain't my mummy\nBut, but, fifteen years down the line\nShe ain't the same as she passed her prime\nNow it's all gone down the drain\nSay goodbye to all the fame\n\n[Interlude 3]\nOn behalf of Worldwide Incorporated\nI'm sorry to inform you that we will no longer need your modeling services, darling\nThat's the way the cookie crumbles\nStiff up the upper lip, hmm?\n\n[Hook X2]", "title": "Camera", "album": "B.o.B Vs Bobby Ray", "image": "https://images.genius.com/43ec171838184bac0a8baa89f9e6d0a9.600x600x1.jpg"}], "artist": "B.o.B"}