{"songs": [{"image": "https://images.genius.com/3e04787eea4f43554ffcbde3a35ad709.1000x1000x1.jpg", "title": "Mutilate The Beat", "album": "Death Rap", "year": null, "lyrics": "Mutilate the beat\n\n[Verse 1:]\nMy character traits, I consider attractive, hate,bitterness\nProactive with blades, grittiness, transform, activate\nLike a general, official, hit you with an enemy missile\nMy extended pistol is beneficial to the issue\nI'm hot tempered, the red dot's centered, leave you shot and Dismembered, you blood clot, you got dented\nSpiritual healing, satanic, walking on ceilings, warped appeal,cold Like a corpse with no feelings\nGang territorial, squeeze a banger at ya in a state of euphoria, Leave you bleeding like Fangoria. Skeezing Eva Longoria\nSlaughter ya, get gorier than Korea, see ya\nBedridden, head bitten. By a kitten\nBred with rabies, shitting out red, left dead sittin'\nLacking awareness, in all fairness, you're wack, clapped\nAnd left physically impaired pissed, see a therapist\nIt's natural for me to flip, come at ya with a bat and split\nYa head open, or catch you with a clip. The.44 magnum spits, Magnanimous, kill you like Euronymous then walk off anonymous A Malcolm McLaren rebel, you're on the low baron level\nWith a piece of shit on your head like Aaron Neville\nForever death like Trevor Peres, if my endeavor's are slept on, Never-the-less, sever the flesh. You gotta die, laws of the Bible\nDo not apply, say goodbye to my rivals, you should try to comply. Assault ya, rude behavior, flavor like salt on ya food, enslave ya, on the altar subdued. The sinning, atheist, demented, winning, sadist, I can see the inner traces of resentment on your faces. A proper amount of fucked up lines, you can't possibly count, buck up ya spine with a nine, shot to the ground\n\n[Hook:]\nMutilate the beat. Mutilate the beat. Mutilate the beat\n\n[Verse 2:]\nThe skills of my intellect, allow me to kill you in a sec, fill you up with Percoset, power drill\nYou in the neck. Brilliantly like when Quentin directs, the quintessential, villian in-effect, chin check you diligently. Good hearted 'til the hood scarred it, I wish you would start it, spark it, the death of you we could market. A bad dude, with an attitude like Zab Jud, I'll pull a gat on you, give you a stab tattoo. You worship idols, strip ya titles, rip ya vitals, grippin' tools, attack like fighting bulls. My motivating factor's to kill like operating tractor trailers, drunk as a sailor, motor skills nil. My crooked path is straight, took her on a date, making a hooker masturbate with my.38. My machete will slash ya, deep gashes, your heart beats faster, get ready to meet your master\n\n[Hook:]\nMutilate the Beat"}], "artist": "Necro"}