{"songs": [{"title": "Ooo Wee Freestyle", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Intro: Samples]\n*instrumental*\nYay!\nDo you want to hear it?\n\n[Verse: brandUn DeShay]\nOh yeah\nNow, I don’t know it all, but a couple things I do know\nThe music is a talent, you can’t plan it like Pluto\nYou got to thank God, but with more than a cool, though\nIf you can keep your money stacking better than a Juno\nBe real, not pseudo, honesty’s the best policy\nAnd honestly, there’s no one hotter than me, probably\nHonestly, I can be a lot of things, anything\nAs long as I got my man God with me\nAny dream can turn into reality, even when their hearts turn cold like Natalie\nI never let it sadden me\nAnd if you want battle me\nI find a way to [?] past shield, then I eat them like it’s fattening\nTried to put the pressure on me ‘cause they want to flatten me\nBut all my tracks fat, so all they did was flatter me\nI know when they be sampling, using throwbacks so they lateraling\nSo I can always tell like I’m tattling\n\n[Verse 2: brandUn DeShay]\nAnd I don’t got to write ‘cause my freestyle’s great\nBut every time I write, I’m in a freestyle state\nI never let my pen stop moving until I’m finished\nAnd when it stops moving, then I’m finished\nLike, I know this is God-given talent\nHaters try to stop me but they only got the slip like balance\nNever slip, my balance is right on the center\nWhichever label that sign me, probably right on the center\nAnd it’s all too common in these recent years\nThough word of God could probably hardly reach the ears\nOf the youth, and it starts in the booth\nCavity search but not the kind find in the tooth\nToo many others know it all too well, in a box like a clothes line\nThe club fights the only time we take it outside\nSo I’m just praying that they feel what I’m saying like is real\nNot only do they hear, but they feel\nThere’s a reason I’m singing this song, I’m not talking until my face turns blue\nI’m talking until my [?] face turns blue\nI know this much is true like [?]\nBut follow me, follow my moves and you can be the man too", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}