{"artist": "Astronautalis", "songs": [{"title": "Running Away From God", "image": "https://images.genius.com/e789c1eee5bf67c9330ead32545b7bf5.1000x1000x1.jpg", "album": "Cut The Body Loose", "lyrics": "[Verse 1]\nEven after 6 months, NOLA still a wreck\nThe 9th ward still had water up to your chest\nUnder I-10, they piled dead cars\nEver seen an ambulance with high water marks?\nAnd they don’t dance no more, all we do is flinch\nBrace for that old taste that chase a strong fist\nWith blood on lips, and flooded bricks\nTaste that whiskey kiss, born sweaty and free\nFuck a club, mu'fucker, take that shit to the streets - G\n\n[Hook]\nWe were born running away from God, away from God\nWe were born running away, away\nWe were born running away from God, away from God\nWe were born running away\n\n[Verse 2]\n\"10 euros that's cheap for sure\"\nHe said it all in broken words\nBut these people ain’t got nothing\nThey’d rather drink what they have than buy your merch\nČadca isn’t pretty, but Tatranský works\nThick liquor dark brown, made of secret herbs\nSlovakia'll get busy, they don’t need no words\nAnd anything is a club if the speakers work – ey!\nTurn it up till it shakes the rafters\nNo kings, no gods, no masters\nBeat build  while the euro collapsing\nLittle kids are tagging “all cops are bastards”\nAntiFa is passin’, in they old jean jackets\nThey don’t need no magic just to make this happen\nMake out, make due, make the best of what you got\nAnd turn the volume up till it shakes the rafters\nTill it shakes the rafters\nTill it shakes the rafters\nTill it shakes the rafters\nWe make our own disasters!\n\n[Hook]\n\n[Verse 3]\nEy Ey Ey Ey\nWe ain’t no gangsters\nWe ain’t no thugs\nWe all just flesh and blood\nAnd we don’t need you to mess it up\nWe independent son, we dig our own graves\nSalt our own lands, make our own plagues just for fun\nAnd you can test us, come\nWe’ll be waiting by that front gate with the Beam up in our cup\nAnd I’m dumbfound how in my home town, cops come: they all just run\nLandlord wants us out: we pack our bags and shut the whole thing up\nSo I was like, “Aight, what you do when police come through to shake you down?”\nLaughed out loud and said, “We lock them motherfuckers out!”\n\nThat's a true story", "year": "2016-05-13"}]}