{"artist": "Pouya", "songs": [{"album": "South Side Slugs", "title": "Spice Girls", "image": "https://images.genius.com/7fb8bfc4978c7618e15a2f630f97b65c.500x500x1.jpg", "lyrics": "[Verse 1: Denzel Curry]\nI'm hard, ready for the bogard\nHunger, nigga I'm the hunter\nMy bar, nigga mind on mars\nWorldstar cause a nigga wanna be star\nThrow the fist, have a fit\nGrab the clip, pistol grip\nMake them flip, pass the spliff\nAxe shit, pass the fish\nYou wanna pass the bitch?\nCause I'ma beat the pussy up like a grizzly\nTil now it look like the roaches of my cheeba\nGirl don't leak on my sneakers\nNow there is spit on my adidas\nNiggas are talking that shit so I'm rolling my reefer\nNigga wanna talk about a motherfucker\nNigga wanna talk about a motherfucker\nNigga I'm drinking some fucking OE\nI'm pimping these bitches like into the sea\n\nDenzel the Curry the ultimate nigga by far\nYour bitch want a xanny, that heat with the candy the bar\nIn a mad city, I'm gifted I'm Kendrick Lamar\nBut you can say fuck that shit nigga, I'm just going hard\nYou niggas ?\n\n\n[Verse 2: SdotBraddy]\nNiggas claiming they don't fuck with me\nBetter get physical when I'm running into you\nCause when it's man to man and face to face\nSome of you are sounding like Ph in physical\nHow does it feel? Oh, to me how's it feel\nOh, to know that you're pitiful\nHow can you hate on a nigga who's working\nBack to back to back to back\nTo get mom out of that cubicle\nSo don't call me while I'm at work\nBuilding up my net worth\nCause it's my money and I need it now, now, now, now, now\nLike J.G. Wentworth\nAnd I know my haters wanna kill themselves\nEvery time I say a hot line\nBut before you do call 1-800-273-8255\n\n[Verse 3: Pouya]\nMy music immaculate, plus I am passionate when I be bashing it\nAre you selling it or are you capping it?\nIs you on the stale or are you clapping?\nBitch on fire like a match box\nStill getting money in my tube socks\nPop the Glock, tear the roof off\nDown the 9-5, quit my 9-5\nHad no downsize, only uprise\nAin't no surprise\nI did what I had to so I could surpass you\nI got more styles than a fashion show in Paris\nI'm the one that your parents made aware of\nBe careful with that one\nHe's a scumbag, do not trust him\nIf you fall in love he gone leave you\nThe man got too many hoes he don't need you\nThat's the nonsense that they feed you\nAnd you listen, cause you got no mind for yourself\nAnd you probably got a hundred bodies under your belt\nRegardless as I'm heartless in that department\nWhen it come to my money I'm an army\nBy my lonesome, South Side Slugs\nPutting on for the broke ones\nIt take one to know one\n\nGet a full clip to ya lip\nTalking slick, I ain't talking Gang Starr\nFlorida reppin'\nThe bottom of the map, we done came so far\nYou wasn't with me coming up\nYou not gone be when I'm on\nIn between your bitch like floss\nYou's a fraud, you ain't got the sauce", "year": "2015-03-25"}]}