{"songs": [{"image": "https://images.genius.com/fe7d5810fa51b8e81d7eeb21c834aab1.499x500x1.jpg", "title": "I’m Sick of You", "album": "I Need Drugs", "year": "2000-11-07", "lyrics": "Yeah yo, all you bitch ass niggas shady motherfuckers\n\n[Hook]\nI'm sick of you {*scratching*}\nWhat? I'm sick of you {*scratching*}\n\n[Verse 1]\nI'm sick of you I need robitussin, don't make me start bustin\nYou so depressed, you can't let me enjoy a minute\nYou make me sick, like I ate food with poison in it\nYou played out, you're too repetitive\nGive me a sedative before my brain gets negative\nAnd I get the fever for the flavour of a shankin\nRight in your throat G, cause on your bullshit I've OD'd\nI've had it! You lying in the habit like a teenager in tablets\nLikie carrots and rabbits, automatics and religious fanatics\n\n[Hook]\nI'm sick of you {*scratching*}\nFucking bitch.. I'm sick of you {*scratching*}\nPass me the Excederin before I bash your fuckin head in\n\n[Verse 2]\nI ain't feelin you\nThe only thing I feel's an allergic reaction\nPass the medication, you got me sick like a patient\nDigestin your weak conversation\nShut the fuck up cause I'm not patient\nBut I'm mental, you might catch laceration\nWanna be hard rock, STOP, play at your age\nI'm sick from you pussies; like I fucked y'all and you had AIDS\nMy stomach feelin obscure, the only cure is a knife into your dick\nSuck enjoy it, stop you from rappin cause your style's poor\n\n[Hook]\nI'm sick of you {*scratching*}\nI'm sick of you {*scratching*}\nPass me an Advil before I make you travel below some gravel\n\n[Verse 3]\nI get nauseated, from a DJ with a wack playlist\nAnd court for six hours of lookin at his dickhead baliff\nCriminal court is like a virus clinic, cause I'm sick\nOnce I'm in it, the disease called annoyin grows each minute\nGo get your own style, you ain't sick enough\nYo I got a headache son, cause you're suckin my dick too much\nAnd that's the only way shit like you will grow up\nMy acid lunch, eat you up, you make you wanna throw up\n\n[Hook]\nI'm sick of you {*scratching*}\nI'm sick of you {*scratching*}\nHand me a Bufferin before you catch a fuckin snuffin\n\nBitch! I'm fuckin sick of you!\nFuckin bitch-ass motherfuckers, shady sluts!\nWHAT!"}], "artist": "Necro"}