{"songs": [{"image": "https://images.genius.com/d258961791ab731cca5aed7ed00e8073.500x500x1.jpg", "lyrics": "Ay yo Josh\nAy yo where the fuck you at man?\nWhat you mean you on your way yo'\nOur session was at 9 its fuckin’ 11\nI'm out here, blowed, smokin L’s\nWaitin for yo ass\nI don't even think I got..\nOh no I definitely still got some weed for the lab\nBut still when you gonna be here?\nSoon? Mother fucker how soo..\nOh there you are right now\nAy yo whats good bruh?\n\nAy yo whats good bro\nShit chillin’\nYeah I'm tryin to go to the studio or whatever\nYeah I got shit to drop mother fucker\nI always got shit to drop damn\nIght you’ll meet me there?\n\nI woke up scratched my nuts\nRolled a swisher on the shitter\nGot blowed then I light me up a cigarette\nThe coolest flow coolio a movie roll\nNow I’m tryna head up to the lab\nI headed to the studio open the door\nSay wassup to everybody who was posted before\nI’m bout to record, they know I’m smokin’ of course\nBlow some haze in the air, pull out my notebook\nThen I head up to the booth, load the beat off my email\nPhone on silent, ignorin’ calls from females\nMy man Josh sit down, get the tempo\nPut on my headphones\nIght, let’s go\nI let go intro of the beats startin’\nSay a couple words try not to be retarded, huh\nCuz I'm a goofy dude doin' what I choose to do\nEatin’ tracks up like some snacks call me scooby doo\nNow the beat about to drop verse 1\nIts like a war when the soldier pull the first gun\nEverything’s blank it’s just me and the mic\nI don’t read a lot, so I try and see what I write\nVisualize the melody, hypnotize everybody watchin\nI hope they ain’t blink they eyes\nCuz you don’t wanna miss a fuckin second\nWhen I’m catchin wreck\nI be in the booth goin’ off try to catch my breath\nCouple more bars, couple seconds left\nKillin’ em softly takin’ extra steps\nThey never guessed I be murderin’ and blessin’\nIght the first done but before we start the second\nWe gotta do mad shit\nDoubles and adlibs\nAnd Josh make it sound like magic\nHe a old school genius with the pro tools\nTryna school me on everything that the pros do\nI tell him that he needs to think it in the book\nBut for now we makin guap just singin’ on some hooks\nSo I don’t worry bout the chorus\nThe track gotta hook on it\nAnd my verses with that, they sound good on it\nNow I do a second maybe do a third\nIf I’m in the mood to go crazy with my words\nI take a lil’ break got some haze to burn\nThe cats sittin’ outside can wait they turn\nWe makin’ classics in the session\nMom’s askin me these questions\n\"When you comin' home? You got school.\"\nNah, I’m suspended\nAfter this track done burn the last blunt smokin’ good\nPayin’ for my time with stolen goods\nSay peace to whoever, outside its dark\nI’m blowed and can’t find where the fuck I parked\nSo I beep the car, oh there it is\nLets go ahead and dip, hop in the whip\nLight a cigarette and sit\nGotta ride home ahead of us\nSlumped in the back\nTell my man wit the whip to bump on my track\n\nTryna ride out, and I’m high now", "year": null, "album": "The Jukebox: Prelude to Class Clown", "title": "A Night In The Studio"}], "artist": "Mac Miller"}