{"songs": [{"image": "https://images.genius.com/0e1f124f48c2edf75255aa6292bdf2b5.600x600x1.jpg", "title": "Pit", "album": "Die!", "year": null, "lyrics": "[Intro]\nStart a pit!\nStart a pit!\n\n[Verse 1: Necro]\nI’m a dragon spitting out magma\nPop bangers, leave you like chopped angus\nHold an axe like Genghis Gun, I’m like a young Genghis Khan\nLike a gang of ex-cons that hang up murder rates\nMurder’s great, snapping, clapping you up\nChew up flesh like werewolves yapping\nVictims, who’s up to bat? Smack em with a bat\nHack em into pieces, Jesus, Christ motherfuckers are pussy\nPetrified, mortified, testified you all die\nI’m the sort of guy that stays fortified\nWith a vest and a .45 wounds cauterized\nGoons on the rise rebellion, one million felons yelling, “Necro, tell em!”\nTo hell with them, fuck politics\nBuck at the cops, they can suck the cock\n\n[Hook]\n\nStart a pit! Do it! Now! Yeah!\n\n[Verse 2]\n\nHere’s a shank and a snuff, stop acting tough\nI don’t like you, you’re not gangster enough\nI’m at peace with reality, I got a blood feast mentality\nYou’re into bestiality, you fuck dogs and you suck logs\nYou’re into buttplugs, you don’t need drugs\nSo nice I’ll buck you up with a flare gun\nFuck you up in a fair one, stomp you with Air Ones\nYou get carried away, you literally get carried away on a stretcher pitifully\nMy bad your honour, I know I fucked up\nBut killing a cop is a badge of honour\nYou’re a queer in tights, dying like a deer in headlights\nStrict with the nine like dead mice\nFinally put your brain to sleep painfully\nKill you and laugh at you simultaneously\n\n[Hook]\n\n[Verse 3]\n\nVintage, you’re cutting edge in one package\nGun-clappers backwards like a sexually active attractive nun with a strap-on\nCrucifix dildo haunting the chapel\nPeople you don’t want to street brawl or you’ll bleed\nAll over the place like I hit your nose with a speed ball\nLike a psycho in jail with the brain of Michael Dell\nHit your brain with a rifle shell\nShit like an ex-lax pill, crack your skull\nI’ll flip out like Axl Rose on Paxil\nDon’t need Source or XXL to excel my career, it’s no career loss\nRide like a bicycle, smacked you up in high school\nLike an icicle I’m ice cold\nFoursomes in Toronto, orgies in Montreal, pervert, aren’t we all?\n\n[Hook]\n\n> > Lyrics posted by heroin4yourears < <"}], "artist": "Necro"}