{"songs": [{"lyrics": "[Intro]\nGimme that beat, fool, it’s a full-time jack move\nDon’t worry, 'Schino, I'll give it back soon\nJust having a little fun\nWassup, my nigga?\nS. Dot, the Collection\nBlack Album coming soon\nJust gon' vent a little bit\nHave a little fun with it\nYes, yes\n\n[Verse]\nAin't nobody dumpin' on Hov, you ain’t in sanitation\nOr sanitarium, what are you, crazy? Jay-Z'll bury 'em\nI'll get you drug out the club, they'll have to carry 'em\nGo ahead, bug out, I'll Raid, nigga, scurry\nWorry, I'm, not, the Mike Jordan of the mic recording\nIt's Hovi, baby, you Kobe, maybe; Tracy McGrady\nMatter-fact, you a Harold Miner\nJ.R. Rider, washed up on marijuana\nEven worse, you a Pervis Ellis\nYou worthless, fella; you ain't no athlete, you Shawn Bradley\nI ain’t talkin' to nobody in particular\nMy flow's just vehicular homicide when I’m kickin' up DUST!\nAnybody in my path is a car crash waiting to happen\nNigga, WHAT!\nI got my foot on the throat on the pulse of this rap game\nAnd I ain’t letting up, YUP!\nWho’s the nicest? Life or lifeless on these mic devices\nAnd I don't write this, I just mic this, I will it to happen\nOne-take Hov, I’m real at this rapping\nMy new name is Just the Facts\nWhile the rest of y'all just adjust the facts\nPut words together, just to match\nI say what I feel, y’all adjust to that\nI do the opposite of y’all so I just attract\nThe realer audience usually unjustly Black\nKnow my flow and the shit they go through just match\nLike the sound of my voice and a choice Just track\nI just tackle the subject, the flak from the public is nothing\nI know real niggas happen to love it\nIf you don’t like it, then look in the mirror\nMost likely you ain’t live it so you don’t get it\nYou ain’t did it, so you can't vision, the picture I’m painting\nAin't vivid, the language I’m spitting is so foreign to ya\nSee what starving'll do to ya\nGrowin' up hard in a little apartment'll do to ya\n\n[Outro]\nHah, I’m just talkin’ to ya\nI'm just talkin' through ya", "title": "Pump It Up Freestyle", "image": "https://images.genius.com/0572d3c2a8305ab228c6cfdc3005ee89.300x300x1.jpg", "year": null, "album": "The S. Carter Collection"}], "artist": "JAY-Z"}