{"songs": [{"image": "https://images.genius.com/87ee57604e02647a0536025394b9daf2.300x169x1.jpg", "year": "2010-01-19", "title": "Bad News Part 2", "album": null, "lyrics": "[Intro: Kanye West]:\nDidn't you know I was waiting on you\nWaiting on a dream that'll never come true\nDidn't you know I was waiting on you\nMy face turned to stone when I heard the news\nWhen you decide to break the rules\nCause I just heard some real bad news\n\n[Verse 1: XV]\nYeah, the 11 Freshman speaks out\nEverybody waiting for the list to leak out\nI came off the benches, aiming for the fences\nI was close to home and they said \"He's out\"\nSean asked, \"Did XXL reach out?\"\nAnd that question hit me over the head like Steve Stoute\nThe game ain't a trap it's barely a weed house\nBut I'll be damned if my plans reroute\nIn '09 I lived what I always dreamed 'bout\nThe X-Man blew, yeah Beast out\nA couple manager's later, a few new haters\nAnd I think I got it made, hey, clean house\nBig Sean asked, J. Cole knew\nNipsey Hussle wondered, Wiz did too\nThe flood gates opened on the first thing smoking\nAnd I'm just hoping that I fucking get through\nDown the Rabbit Hole we go when they pay me what I'm owed\nThe day it comes, I feel I'll never know\nMy fans get discouraged like, \"Will he ever blow?\"\nSo I'm heard about through word of mouth and everyday it grows\nBut this shit is like relationships and everywhere it shows\nCause my girl is getting jealous after shows\nWhere everybody loves me, just like we hoped\nBut the screams so far, we don't seem so close\nNow think about that and let it soak\nWhile I sit and think about raps that I wrote\nFor Everybody's Nobody\nDamn, so dope man\nManager dropped the ball, hope he don't drop the soap\nAnd if you wanna touch base, nigga talk to Pete Wentz\nKid with a dream\nWhere is he went?\nI'm seasoned for a Lost episode fourteen\nLooking right and left like it don't make sense\nSandlot kids, everybody's Benny\nAm I the only one who found it cool to be Squints?\nCatch my metaphors and say \"ooh\" like Prince\nBut miss it and your shallow ass thinks I'm dense\nArguing on Twitter with a nigga who just got tight\nFor some reason he thinking I owe him my life\nIt ain't cause I'm from Wichita and on Nahright?\nIt's because I'm from Wichita and in they eyesight\nThe face of the city, I can't help being\nReaching out to old friends for my well being\nAnd I'd hate for them to think that I'd change\nWhen we hit them all a halfway ball like Belding\nAnd I saw y'all's eyes\nEverything is different and I don't know why\nGet it to the point closer where I don't try\nHow's relationships sink if the water runs dry\nI think the bank full is a tank full\nSo when that day's close, I'll be thankful\nKids that ain't cool found a voice to sing through\nAnd that's more than a reason why I can't lose\nDynasty album track 14\nBut the fear that they won't is the worst thing\nHow it never happen is a big fucking riddle\nNow my circle nice and small like A cup nipples\nWouldn't get a shot like I can't touch pistols\nNow I'm turning, this the Blueprints for a missile\nFuck You, Him, Her, Tom, Dick and Crystal\nSob\nThat feeling is so blissful\nAll I saying is when they gonna pay it is past due\nOne of the hardest working of all of these rap dudes\nAnd if it ain't me then you better ask who\nAnd when they say a name say, \"I got some bad news.\""}], "artist": "XV"}