{"artist": "Drake", "songs": [{"year": null, "album": "Heartbreak Drake", "image": "https://images.genius.com/405c9bcb0dcbee7d15bcc86cd8e8366a.500x500x1.jpg", "title": "Brand New (Remix)", "lyrics": "(Drake)\nThis here is on some truthful shit\nIts seems like everything I do your use to it\nAnd I hate hearing stories bout who you've been with!\nThats when I gotta hide what I'm feeling inside\nSo you still think I'm confident and damned\nIs this gonna last?\nYou're up on a pedestal\nAre we moving too fast?\nFeels Like I'm in crazy competition with the past\nThat's why I gotta ask, is anything I'm doing brand new\n\n(chorus)\nBrand new, brand new, brand new, brand new\nIs anything I'm doing brand new?\nBrand new, brand new, brand new, brand new, brand new\n(Aye Aye Aye)\n\n(Drake verse 2)\nThis here is something personal\nHighly doubt this feeling is reversible\nKnowledge is pain and that is why it hurts to know\nThat you attempt to hide, and put mistakes aside\nSo I dont ever question you and damn\nI can't even find, the perfect brush\nSo I can paint whats going through my mind\nRacing against myself, but I'm a couple steps behind\nThat's why I gotta ask, is anything I'm doing brand new?\n\n(chorus)\nBrand new, brand new, brand new, brand new\nIs anything I'm doing brand new?\nBrand new, brand new, brand new, brand new, brand new girl\n(Aye Aye Aye)\n\n(Lil Wayne)\nThis here on some remix shit\nSeems like ever thing I do they leakin it\nAnd I hate hearing stories of who im sleeping with\nI swear I got to hide what I got in my ride\nSo she still think im confident and damn\nHow long will this last\nMy life is on the pedestal, am I moving to fast?\nFeel like im in crazy competition with my past\nThat's why I gotta ask\nIs anything im doing brand new\n\n(chorus)\nBrand new, brand new, brand new, brand new\nIs anything I'm doing brand new?\nBrand new, brand new, brand new, brand new, brand new\n(aye,aye,aye)\n\n(Lil Wayne)\nRemix baby if he can do good then I can do better\nDont blame me if any man would if he knew better(um huh)and dont won't to here about him anymore\nBut I know you heared this song before..\n\n(Drake)\nIs anything I'm doing brand new(6x)\nIs everything I'm doing too late(6x)\n\nDid he take off your clothes off just like this\nDid he give you loving just like this\nDid you spend the night in his bed\nOn the very first date\nTell me baby am I too late?\n\n(chorus w/Drake)\nIs anything im doing brand new?\nBrand new brand new\nShow me if this is brand new, new\nOoh ohh yeah yeah yeah\n\n(Lil Wayne)\nAnd this is the remix baby weezy baby,drizzy, yung mula baby"}]}