{"songs": [{"title": "Hallelujah", "album": "Rehab: Deluxe Edition", "year": "2011-09-15", "image": "https://images.rapgenius.com/c76f305a6f4ee27fc9374d4de760b312.650x650x1.jpg", "lyrics": "[Verse 1]\nGone in the club on the vod-ka-ka\nTryna get lil' momma in the car-ar-ar\nI heard a gun pop like \"pa-pa-pa,\"\nSomeone hit us with a choppa like \"ra-ta-ta\"\nAn average night for a couple of no goods\nUp in college but yet we still actin' so hood\nNever makin' it to church, man we drinkin' till it hurts\nIf we could do it tomorrow yeah we sure would\nWhen you're sittin' in your room and you're feelin' like a fool\nCause you got a couple STDs\nSee your partners on the news cause he thought that he was cool\nNow they 'bout to put him six feet deep\nWhen I'm really at my lowest and I'm feelin' kinda hopeless\nEverybody gotta hate on me\nShame on me cause the blame's on me\nBut hallelujah the Lord showed his grace on me\nHe saved me, was on my way to hell with a full tank\nI don't care what them boys think\nCause what I'm on is a sure thing\nStackin' they money up like it's Legos\nTienes hambre para all of the pesos\nThey'll never be satisfied, man I tried, it's a lie\nThe only hope you got is turning to Jesús\nI'm not here to impress, I'm here to impact\nI won't settle for less, got my cross on my back\nI was out my mind, my head was screwed up\nBut Jesus saved me, hallelujah!\n\n[Hook]\nTurn up my level, still a Rebel, screaming hallelujah!\nMe and my partners on your block, we holla hallelujah!\nWas out my mind, my head was screwed up\nBut Jesus saved me! Hallelujah!!\nHey what you say? Hallelujah!!\nHey what you say? Hallelujah!!\nHey what you say? Hallelujah!!\nHey what you say? Hallelujah!!\nMy soul was empty, my life was foolish\nBut Jesus saved me! Hallelujah!!\n\n[Verse 2]\nFollow me, follow me, I'm a phenomenon\nNot because of what I do or the music I'm on\nSmokin' with shooters and gettin' caught up in too much\nI found the Lord was the truest and now I follow the Son\nEnemy of the King like Sauron, he shoulda smashed ya boy, I was a moron\nRunnin' from the truth, full of 40 Proof\nHalf-naked looks, lies that I only wanted more of\nKnew in my heart I was opposed to you\nKnew I wasn't doing what I was supposed to do\nMade in your image but I was more like a menace\nAnd by your grace I repented and now I'm close to you\nI tell the world but when I tell 'em they don't listen\n\"How you rappin' but you Christian?\" They don't get it so they diss it\nBut they shot Pac and they popped Biggie\nI pray my killer gets saved when he done with me\nFirst put me on a plane, headed to the rap game\nLet me tell the whole world how the Lord did it\nGo and put me in line with all the worst sinners\nOnly difference is I'm tall and a little thinner\nBut if you ask who's forgiven, see my hand hit the ceiling\nI been changed like weather after a cold winter\nThey can say what they wanna, I ain't scared of these people\nLord is my shepherd, I fear no evil\nMy soul was empty, my life was foolish\nBut Jesus saved me, hallelujah!\n\n[Hook]\nTurn up my level, still a Rebel, screaming hallelujah!\nMe and my partners on your block, we holla hallelujah!\nWas out my mind, my head was screwed up\nBut Jesus saved me! Hallelujah!!\nHey what you say? Hallelujah!!\nHey what you say? Hallelujah!!\nHey what you say? Hallelujah!!\nHey what you say? Hallelujah!!\nMy soul was empty, my life was foolish\nBut Jesus saved me! Hallelujah!!\n\n[Outro: Thi'sl]\nFor flippin' work, bangin' Rugers\n13, I was a shooter\nBut Jesus saved my life, hallelujah!\nBut Jesus saved my life, hallelujah!\nBut Jesus saved my life, hallelujah!"}], "artist": "Lecrae"}