{"artist": "E-40", "songs": [{"title": "Da Bumble", "image": "https://images.genius.com/b52b581f902f3353abd2c96694363546.800x800x1.jpg", "album": "In a Major Way", "year": "1995-03-14", "lyrics": "[Verse 1]\nI flipped a Lexi, speed up and catch me\nLexus of Concord, reached out and touched me\nSome of you hoe cake ass niggas like broads be messy\nI know some beautiful black intelligent women, that's sexy\nE-40's back and actin' black and\nI don't be balkin, nor even high cappin\nYou better watch me, I'm comin smebbin\nNinety-five, ninety-six, ninety-seven\nFade your pistolian, 30-ought-6 custodian\nSpecial shout to Casual, Del, the Souls and Opium\nAbout the town, the Valley-Joe\nJust like a democratic, I'm for' the po'\nFuck the bumble, new Click Shit ain't no punk ho\nPedestrians stumble, sound like a gorilla\nTryin to get up out the trunk ho\nContinue strikin it, hope you likin it\nFilthy McNasties at the bus stop hitchhikin' it\nNever reneging or feeling bogus\nWhen it comes to spittin I'm ferocious\nMannish with it, cabbages, savages\nHangin' out the window of the sunroof, ham sandwiches\nAll day, everyday, 40 play\nHe say, she say, bieetch! that-a-way\nKeep it goin though - don't stop\nShakin baking soda, forms a rock\n36 zips on a triple beam scale\nBurn the duct tape but keep all the ya-yo\nWhip appeal, overkill, extras\nReally real, apron specialist\n(Drisidrisomina?) is the illest zaggin\n59 clip kizzartridge you know I'm pizzackin'\nIn the mornin, cookin bacon\nIn the ghetto in the bullet-proof apron\nHere comes the laws, batter ram crushin through my walls\nIm in my drawers runnin from the canine cocaine-sniffing dogs\nSome niggas hate me, some niggas love me\nSome niggas shake my paw, some niggas mug me\nI see ya tweakin, I see ya geekin\nYour bootch is with me while you sleepin\nA motherfucker ain't gotta be Flash Gordon\nAll up in front of a batch to get a batch\nThat Hector the hoe protector shit won't work\nThat batch just wants your scrizzach\nLettin' em know, portfolio zodiac sign Scorpio\nSeeded and breeded soldier, V-A-L-L-E-J-O\nNever show weakness to your enemy\nNever leave your crib with out your pepper, beeotch!\nI'm tryin' to get nigga rich\nOpen up a shop cotton candy and licorice\nCash in stashes, that's a must\nWe made another million and that's a plus\nDon't get it twisted man, don't try to find me\nMight be in Switzerland, or Hawaii\n1-2-3-40, wheels new shoes scrappin toe to toe\nCraps, blackjack and keno, strike sideways hit Reno\nBall cap tight, no smilin\nSittin lo somethin profilin, beeitch!\nFuck the bumble, new Click shit ain't no punk ho\nNew Click shit ain't no punk ho\n\n[Outro chit chat]"}]}