{"artist": "Cam’ron", "songs": [{"title": "Easier Said", "album": "1st of the Month, Volume 6", "year": "2014-12-01", "image": "https://images.genius.com/0836b61add240a59b44822253514d6d1.1000x1000x1.jpg", "lyrics": "[Intro: Cam'ron (sample)]\n(Easier said then done, done, done...)\nThat's exactly what it is, huh\nKilla, uh\n\n[Verse 1: Cam'ron (girl)]\nUh, cars, I keep on copping 'em, hearts, I keep on breaking 'em\nMa, it's no mistaking him (he gets dough)\nThey like when Gucci touch me, love when Louie hug me\nYep, it's truly ugly (that's fo' sho)\nGo drink ya haterade, crib is like Flavor Flav's\nGirls in flavors, babe (he got hoes)\nUh, couch is Gator, Gator, in the tank Calamari\nCarpet made of Fox, my living room's a wild safari\nElevator for the cars, where you sit yours?\nPark the 6 on the 6th floor (he is fly)\nGet your assailants on me\nCome on dog, the Feds got surveillance on me (that's no lie)\nYep, dibble, dab, it's just a riddle, laugh\nYou selling nickel bags (to get by)\nI keep a pistol bag, in the kitchen\nBathroom, bedroom, call my house the missile pad, uh\n\n[Interlude: Cam'ron (sample)]\n(Easier said then done) Killa\nA lot of dudes talking 'bout they don't care about jail\nThat (?), I tell 'em\n(It's easier said then done)\nYou ain't been down on hund', Center Street to that DA's office\nHave you, huh?\n(It's easier said then done)\nOr niggas talking 'bout, \"Yo, shoot me dog, I'm real\"\nKnow what I tell 'em\n(It's easier said then done)\nKnow about that six hour surgery, two years worth of therapy\nTwo paralyzed fingers, knahmean?!\n\n[Verse 2: Cam'ron (girl)]\nKilla, uh, uh\nSo what I made a million, I'm chilling, a straight civilian\nI know on the plate is killing\nBut I'm here to save the children\nI'm a hypocrite, every day I play the building\nWhere the hero? But this hero, play the villain\nThat's the way I'm feeling, had to replace the ceilings\nLandscape, and I swear\nGot my neighbors grilling\nSo I cop some acres, God, to the top you take us\nHe know we not some fakers\nEvery day the cops come chase us\nNot what they make us, we the minority\nWanna be the majority, skybox, watch the Lakers\nSo I could ball like Lucille\nIn the mall, I'm too real (he is real)\nAnd I don't care at all how you feel\nI'll fall if you squeal (they will squeal)\nAnd ya bank account it's on Slim Fast\nDrink down ya slim ass, up in a M-Class, Killa\n\n[Outro: Cam'ron (sample)]\n(Easier said then done)\nI know a lot of y'all scheming on me out there\nOne thing's for sure, two things for certain\n(It's easier said then done)\nFuck around, get ya cap clapped backwards\nBetter all wait to Friday to fry fish, nigga\n(It's easier said then done)\nThen y'all niggas talking 'bout y'all getting money, man\nY'all don't know about hustling\n(It's easier said then done)\nHer-on's like the stock exchange, nigga\nPrice go up, price go down\nNigga could sell you all paper, what's really good"}]}