{"songs": [{"title": "Wop (Remix)", "album": "Keed Talk to ’Em", "year": "2018-12-12", "image": "https://images.genius.com/f2e480614acef09dbbbb2ce6eb8bd2a9.999x999x1.png", "lyrics": "[Intro: Lil Keed]\nYou know I just copped this YSL piece, you know what I'm sayin'\nNo cap\nI'm with big slime and I got um, Stackman in the motherfuckin' room too\nKeedtoven as always, know what I'm sayin'?\nAyy, where you get that beat from? Mooktoven\nKeed, talk to 'em\n\n[Chorus: Lil Keed]\nI got shooters so I hope a nigga ain't on nothin' (Wop)\nMe and big slime fuckin' these hoes, nah, we ain't cuffin' nothin' (Wop, wop)\nI got cheese on me wrapped in saran (Wop)\nWhat's that floatin' 'round that Crush? Man, that's all Xans (Wop)\nForeign ho just wanna embrace, she don't need no weave (Wop, wop)\nWater on my neck and wrist, yeah, Dasani (Wop)\nYou can picture this right now, ain't talking Sony (Wop)\nBlack pitchfork, that's that Masi'\nYeah, I did it from the ground up\n\n[Verse 1: Lil Keed]\nAnd I just left Bali and I'm smokin', mmh\nNaw, they can't be me, these niggas can't see me, nigga stop\nYeah, I pulled up on Bleveland Ave in that drop (Slime)\nYeah, Glock with a dick, yeah, it gon' pop (Boom)\nYeah, I got bad bitches, yeah give me top (Toodles)\nOff-White denim on, cost me a lot (No cap)\nOff-White shoes, rock them bitches with Gucci socks (Yeah yeah)\nThey don't wanna see them slimes out, they call the cops (No cap)\nYeah you say you slime, but did your partners slime him out? (Slatt slatt)\nI got up, they hands out, but y'all niggas counted me out (Uh-huh)\nAny nigga make a sound, I make Stick Baby clear the block (Skrrt)\nOn the way to these M's, I ain't even do no stops (Uh-uh)\nBust down Rollie, no tick, no tock (Uh-uh)\nNigga was flexing for the day, gotta give it back at 12 o'clock (Uh-huh)\n(Keed, talk to em)\n\n[Chorus: Lil Keed]\nI got shooters so I hope a nigga ain't on nothin' (Wop)\nMe and big slime fuckin' these hoes, nah, we ain't cuffin' nothin' (Wop, wop)\nI got cheese on me wrapped in saran (Wop)\nWhat's that floatin' 'round that Crush? Man, that's all Xans (Wop)\nForeign ho just wanna embrace, she don't need no weave (Wop, wop)\nWater on my neck and wrist, yeah, Dasani (Wop)\nYou can picture this right now, ain't talking Sony (Wop)\nBlack pitchfork, that's that Masi'\nYeah, I did it from the ground up\n\n[Verse 2: Lil Yachty & Lil Keed]\nI got too many hoes to chase a thot bitch (Lil' bitch)\nI don't argue with no peon, I just block the bitch (Block the bitch)\nI got two Bentleys, paid cash, no lie (Skrrt)\nHit the bitch from the side, she said, \"Oh God\" (Oh God)\nI told Keed he up next, that's on my mama (Slatt)\nI got cheese hidin' out just like Osama (Cheese)\nWith the slimes and they bite just like piranhas (Slimes)\nI be ballin' on the block just like Mo Bamba (Woo)\nI was 18 in a Benz, not no damn Honda (Skrrt skrrt)\nDoin' dash, got me sinnin' in front of your honor (Yeah)\nI'm a real nigga, I ain't with the he-say, she-say (And?)\nAnd I'm the new 'Rari, not no Stingray (Keed, talk to 'em)\nLil Boat\n\n[Chorus: Lil Keed]\nI got shooters so I hope a nigga ain't on nothin' (Wop)\nMe and big slime fuckin' these hoes, nah, we ain't cuffin' nothin' (Wop, wop)\nI got cheese on me wrapped in saran (Wop)\nWhat's that floatin' 'round that Crush? Man, that's all Xans (Wop)\nForeign ho just wanna embrace, she don't need no weave (Wop, wop)\nWater on my neck and wrist, yeah, Dasani (Wop)\nYou can picture this right now, ain't talking Sony (Wop)\nBlack pitchfork, that's that Masi'\nYeah, I did it from the ground up"}], "artist": "Lil Keed"}