{"songs": [{"title": "Check", "lyrics": "[Intro]\nCVR the gang, Cashville Records\nYou dig what I'm sayin'?\nI don't wan' hear 'bout none of that other shit\nNah, fuck that, that part\nFuck all this shit really though\nYeah, you know what I'm sayin'?\nI don't know when I'm droppin' no album\nCompulsive the motherfuckin' EP, we on this type shit, you dig?\n\n[Verse 1]\nFilled up all my clips and wiped my fingerprints\nLeft some shells all on they doorstep, I ain't seen 'em since\nCouple killers say they killers but I'm not convinced\nSnorting powder out a dollar behind limo tints\nEmpty out your pockets, you young niggas must not got no rent\nI'm compulsive, fuck that shit, bitch, I got the Vick\n\n[Chorus]\nTell me where that check at (Run up a...)\nTell me where that check at\nShowin' up, I'm unexpected\nGive a fuck if you respect it\nI been black balled and neglected\nWhere my motherfuckin' check at?\nBetter tell me where that check at (Run up a...)\nTell me where that check at (Run up a check)\n\n[Verse 2]\nLose a ho and gain a ho, I tell a bitch let's go\nTake the six and get the O and tell my niggas let's roll\nTake these bricks and break 'em in zones and tell these niggas let's eat\nI got these niggas breakin' in homes, what you find, you keep\nOkay, so you gon' jack the plug, that's a jack leak\nDab behind the brick of H when you can buy it cheap\nI keep on puttin' pressure on 'em 'til I find a leak\nI'm dumpin' these Cookies ashes on 'em 'til they finally speak\n\n[Chorus]\nAnd tell me where that check at (Run up a...)\nTell me where that check at\nShowin' up, I'm unexpected\nGive a fuck if you respect it\nI been black balled and neglected\nWhere my motherfuckin' check at?\nBetter tell me where that check at (Run up a...)\nTell me where that check at (Run up a check)\n\n[Verse 3]\nMy bitch .40 Glock ain't got no safety on it\nFuck some public shit, this powder make you hate me, don't it?\nFuck the government, the shutdown is the way we want it\nI know some narcos on the border waitin' for this moment\nI got some young niggas with racks makin' they appointments\nWe gon' pull up, pick up that pack, make it back by the morning\nYeah, loyalty, and I got lawyer fees\nAnd I got a ski mask but I'm lettin' these niggas know it's me\nI really been kinging on these niggas with no royalties\nHad to go sign my fuckin' self, you not employing me\n\n[Chorus]\nTell me where that check at (Run up a...)\nTell me where that check at\nShowin' up, I'm unexpected\nGive a fuck if you respect it\nI been black balled and neglected\nWhere my motherfuckin' check at?\nBetter tell me where that check at (Run up a...)\nTell me where that check at (Run up a check)", "album": "Compulsive", "year": "2019-04-12", "image": "https://images.genius.com/dd1510ec0f7e89e04c124e916b495b47.1000x1000x1.jpg"}], "artist": "Young Buck"}