{"songs": [{"year": "2016-11-04", "image": "https://images.genius.com/276f9ce7db4fdfcb8518ab6ab64cfd4a.500x500x1.jpg", "title": "Money Low", "album": "H.O.G.", "lyrics": "[Intro]\n[Big Scoob] Shit, what you drinking boy?\n[Boogie Man[?]] Shit, whatever you drinking\n[BS] Well I only drink one can, so we doing Crown tonight\n[BM] Shit\n[BS] Alright\n[Rat] Scoob! Scoob!\n[BS] What's up with it?\n[Rat] What's going on with you big fella?\n[BS] What's happenin' with it man?\n[Rat] Man, you know I'm still trying to holler at you man. You know, I told you come over and fuck with me man\n[BS] Boy, you still trying to push that package. I done told you I ain't pushing right now\n[Rat] Scoob, Scoob, check this out man. I got everything you need. Just come over here and fuck with me man. No, fuck with me for real Scoob\n[BS] Alright, man look here. I'm gonna run in this store man. I'll holler at you. You got my line. Hit me up\n[Rat] Ay, I'mma hit you, alright?\n[BS] Alright\n[Rat] Alright, hit you in a minute\n[BS] Woo\n\n[BM] Man, who that nigga?\n[BS] Man, that's that nigga from LA I be telling you about man. Tryna push that package. I'm starting to think blood or rat\n[BM] Shit, you wanna knock him?\n\n[Verse 1]\nDirty game, fuck the rules when it's hunger pains\nEverybody, anybody, they can get it man\nJudgmental, you can judge me, just don't try to fuck me\nShit get ugly for this money, blood, really trust me\nI done seen it, I done done it, I done played the game\nI'm older now, so I tried to find another lane\nBut every now again, the devil creeps inside again\nThe voices make my choices and reminds me just what violence is\nRubbing on my callouses, slamming liquor, dial it in\nSwitching on the heathen for the evening, blood I'm diving in\nRolling in the Taurus, gripping on my Taurus\nSeventeen with the bean, headfirst I'm a Taurus\nWindows heavy tinted making sure they never saw us\nMind ready for this fuck shit, way too late to duck this\nDuct tape and [?], the money or your fingerprints\nThere's ways to get my money, ain't no way to get my fingertips\n\n[Hook]\nWhen my money low, when my money low\nAin't no feelings, ain't no love if I'm coming bro\nWhen my money low and my hunger grows\nI let the voices make my choices when my money low\nTime to run it bro for the bun or blow\nAnybody, everybody when my money low\nSwitch to hunting mode as my hunger grows\nNo peace, no sleep when my money low\n\n[Interlude]\n[Rat] Hello?\n[BS] What's up with it man? It's Scoob\n[Rat] Big fella, what's going on?\n[BS] What's happenin' man? You know, uh, hollered at my guys man. They say pull up\n[Rat] Shit man. I mean, how many y'all need man. I got --\n[BS] Woah, woah, easy! We on the phone, but uh --\nRat - Oh, my bad, my bad\n[BS] We on deck though man. I'm talking bout whatever you can handle, ya know what I'm talking about?\n[Rat] Ah, say no more. Say no more. Imma get my shit together and I'll pull up on you\n\n[Verse 2]\nNo pulling back, it's set in motion rolling downhill\nMy niggas hungry, ain't no paper shaking 'round here\nWon't think about it, niggas 'bout it so we all in\nYou gotta get it how you live it, blood, tag me in\nA murder mission, the money's coming, my motivation\nNo getting distant, no running from me, my situation\nThe underbelly, the fucking gutter's my preparation\nSo run it nigga, I'm greedy needing the explanation\nI ain't sleeping, I'm sleep deprived and deprivation\nPouring whiskey, I'm pissy, the only way to face it\nIn the basement I'm hanging plastic, this shit is drastic\nLike a movie but real and ain't nobody acting\nI only laugh to keep from crying, keep a clear mind\nI'm built for it by design, it's a filthy grind\nOn my soul I ain't whole, got a debt to pay\nAnd Lord knows that I owe when I step away\n\n[Hook]\nWhen my money low, when my money low\nAin't no feelings, ain't no love if I'm coming bro\nWhen my money low and my hunger grows\nI let the voices make my choices when my money low\nTime to run it bro for the bun or blow\nAnybody, everybody when my money low\nSwitch to hunting mode as my hunger grows\nNo peace, no sleep when my money low\n\n[Outro]\n[Rat] Hey man, it ain't gotta be like -- (muffled)\n[BS] Shut the fuck up nigga\n[BM] Hey big dawg, wanna deal with this problem in the future or you wanna end it now?\n[BS] End it\n*gunshot*"}], "artist": "Big Scoob"}