{"artist": "G-Dep", "songs": [{"title": "It’s All Over (feat. Carl Thomas)", "album": null, "year": null, "image": "https://images.genius.com/e809032be49dc1abed1b3b49bf50e014.620x400x1.jpg", "lyrics": "(God Bless My Soul) - repeat 4X\nYo\nThat's my word man, I got to put it together\nFuck it, just get what you got to get and let's get going\nToday's the day man\n\nYo\nNigga this is it\nYour life and your word ain't shit, spit\nThis real as it get\nPlus, there's no one you can trust\nLove what, do it for the lust\nTrust, it's never too much\nGot to get the money in my clutch\nCase closed, shut\nSplit a nigga guts\nRight through the middle like a dutch\nNever did like him much, my man\nGather up the artillery\nYou feelin' me?\nWhat gives? Tryin' to live it's killin' me\nIt's all about the whips\nChicks with the hips\nRunnin' the number hole, take the chips, the slips\nDo the dip\nSee if time is movin' quick, runnin' out\nNo time for dumbin' out\nI got one life to live\nA wife, a kid\nAnd I still didn't get the ring or the crib\nLook what I did!\n\n(Chorus, Carl Thomas)\n\nWhatcha' gonna do?\nWhen the G's, enemies, then the thieves come knockin' at your door\nWhen they come for you (today's the day)\nAnd you know, it's all over!\nI'm too swift for you (today's the day)\nCause I keep my game trump tight, nigga free, nigga ride\nHere's my gift to you\nNow you know, it's all over!\n\n(gun click)\n\nYou know what this is (gun blast)\nDrew a show through to get biz\nAnd what I gotta do to get big\nDig, believe, it's all about your speed\nCars cash weed\nIt's all a nigga need, indeed\nSeems I was deceived in greed\nBorn in the bullshit\nGuns with full clips\nFinding myself where there's nuns and pulpits\nBring it\nStep on the streets and get to slingin'\nI'm about to make it hot like piss\nBeen hungry before but not like this\nAnd if life's a bitch\nShe need to get cookin'\nAnd cause that fool to get jewels and shit tookin'\nBaby need milk\nWhen I do it up I need silk\nScales on tilt\nThat's how a nigga built\nI need my money tall like Wilt on stilts\nAnd fuck around and get a nigga killed\n\n(Chorus, Carl Thomas)\n\nKnow why?\nI'm the antonym of rich, the synonym of poor\nHow could you think of winnin' on the floor?\nYou're not sure, take the game winning shot\nAnd you're not pure, what you took the shot for?\nA penny for your thought, a nickel for a kiss\nBut I ain't got a nickel for ya miss\nI'm all up in a twist\nFuck all the glamour and the glitz\nIma' hop and skip\nPut me in a slammer in the mix\nTill ya ears or ya hear, the hammer when it clicks...Clack (gun click)\nCausing you to yell \"GET BACK!\"\nI want the cake\nThe early American China plates\nThe meetin' island drapes\nAnd bottles of Alize\nSo I can put my hoes in Sergio Valente\nHey, smile and say\n\"Money made my day\"\nMan I'm tellin you the plan\nEverything's a scam\nSex, cars, put the money in my hand\n\n(Chorus, Carl Thomas)\n\n(Outro)"}]}