{"artist": "Amil", "songs": [{"title": "Get Down", "album": "All Money is Legal", "year": "2000-09-19", "image": "https://images.genius.com/48d6fc16e6c826f1eb305466c8fedcc8.500x500x1.jpg", "lyrics": "[Amil]\nOh shhhh\nYo Jon-John this track is crazy\n\n[Jon-John]\nYou know how i do\nBrowntown, Roc-A-Fella\n\n[Amil]\nWhere my ballers at?  Where my thugs at?\nWhere my fellows at?\nWhere my coins at?  Where my bitches at?\nWhere my ladies at?\nWhere my ballers at?  Where my thugs at?\nWhere my fellows at?\nWhere my coins at?  Where my bitches at?\nWhere my ladies at?\n\nLet me know what tha deal, keep it real\nIf you wanna build\nAin't nothing wrong with a roughneck\nRockin' dirty Timbs, baggy jeans, and a nice chest\nWhat you do on the low?\nYou Bling-bling\nYou's a thug for sure, I want ice cold ice, hit me off\nWanna break me off, you gotta break me off\nBreak me off\n\nChorus:\nHowever you wanna get down\nI can get down, baby, like you get down\nYou know I don't play around\nIf you got diamonds, maybe we can get down\nHowever you wanna get down\nI can get down, baby, like you get down\nYou know I don't play around\nIf you got diamonds, maybe we can get down, get down\n\nCan I live?  Let me live, you want me\nThen you gotta give\nI'm a bad girl, such a bad girl\nNot a hot girl, but a rock girl\nDrive a drop girl\nHair is done, body's right\nYou wanna touch cause I'm just that tight\nWe can roll, we can stroll but I gotta let you know\nI ain't giving out without doe\n\nChorus:\n\nSo if you wanna get with me\nThen diamonds is what I need\nYou are what I need\nAnd if you want to make me happy\nThen give me some of your cream\nGive it to me baby, give it to me, give it to me\n\n[Amil]\nRap:\nUh huh, yeah\nAmilliyon, Major Coins\nUh\nIt be the brokest niggas always talking shit\nI don't even notice niggas who can't offer shit\nWhat that look like, a broke nigga flossin this\nMajor Coin, meaning high costing bitch\nOnly a baller in fact can keep me in the minks\nTo the small of my back, I'm just keeping it real\nLetting y'all know from the gate, no papes, no scrapes\nYou ain't hungry for it, no plates\nMother fucker you'll get clowned first\nTreat you like a corner scrub slinging an ounce of dirt\nThink about it, what sound worse?\nTelling my Coins you broke, or you drowned the purse?\nSee only official bitches wifey of a rich nigga\nA smart bitch, fuck with no trick niggas\nThem grimy bitches fuck with stick niggas\nAnd a dumb bitch just fuck you for your dick nigga\n\nChorus:"}]}