{"artist": "Big Ed", "songs": [{"lyrics": "Silkk(echoin himself):\nNow I'm bout to take the world into a No Limit rodeo (feel this)\nP can ya understand this one?\nNow see we gonna keep it bout it and rowdy\nNow I got Mia X, Big Ed and ya know when I'm in here, Silkk the Shocker\nIt's bout to get serious, so I'm gonna get the world bucked up\n\nBig Ed and Mia X\nWhere my cowgirls at, here we go, where my cowboys  (x2)\nGet on the dance floor\nUnnhh (yea)\nGet on the dance floor\n\nSilkk:\nTo my thugs(thugs), I say my cowboys(cowboys)grab ya'll lassos and um(Mama\nMia)\nAll my cowgirls(cowgirls), saddle up, cause yo I'm bout to ride it(ride it\nWith me)\nI got somethin new(Big Ed) ride with us\n\nBig Ed:\nI got a new dance for ya\n\nSilkk:\nBig Ed tell em how it go\n\nBig Ed:\nIt's called the rodeo\nPut your right arm up, dip, and buck your hips\nPut your left arm up, dip, and buck your hips(do it till your saddles right)\nPut your right arm up, dip, and buck your hips(come on, bump your hips)\n(Come on, buck your hips)\n(Do it till your saddles right)\nPut your right arm up, dip, and buck your hips\nPut your left arm up, dip, and buck your hips(come on)\nSaddle me up, come and ride this buckin bronco\nWork it out baby, video for the peep show\nDosy doe at the Alamo\nTwist your hips like a tornado, explode like a volcano\nBounce up and down like a po-go\nYour love it got me fiennin like a nympho, hit ya with the gusto\nErotic trust as we undergo orgasmic eruptions\nBaskin in the after glow\nI slam my boy like big 5 and domino\nScreamin my name like old ladies screamin bingo!\nI got ya shakin excess, climactic combos\nShe's tryin to be quit bittin the pillows\nIt seems it get wetter the farther in I go\nYou want me to go deeper?  Cause baby I go plenty mo\nYou can pull my slot all night like a casino\nSo you can ride me baby, fast or slow\n\nCHORUS:(x4)\nRide like a buckin bronco(ride it, ride it, come on come on)\n(Do you like that)\nIn the rodeo, a rodeo (ride it ride it, come on come on)\n(Tell me do you like that)\nRide like a buckin bronco(ride it, ride it, come on come on)\n(I know you like that)\nIn the rodeo, a rodeo (ride it ride it, come on come on)\n(Tell me do you like that)\n\nSilkk:\nCome on,come on, come on, come on\nGrab the lasso, and let me rope them hips\nLook I love them tryin take all of it, bittin your lip\nWalked in dimonds shine look true that there\nEverybody talkin bout look, who that there\nCan't let a good thing pass me\nCome on boo an get sassy\n(Boy you nasty)\nI know\nForget about your man, see if you can take this\nI don't hate unless it be fake, time to bust, get rape an switch(switch)\nFlex the Lex, now I'm like sex in the Benz\nSex unstoppable is it possible to have sex and be friends\nSo come and ride this bronco, buck and dip\nCan you picture this skinny cowboy, between them hips\nNo limit soldier, so come and ride me baby\nHard to stop when I'm inside ya baby\nNow it's the new sheriff in town, down and dirty\nTryin to get this chick to serve me, ya heard me?\nRide it\n\nCHORUS:(X4)\n\nMia X:\nGot your saddle on, now baby I'm a getty up\nFirst I rock steady get it wetter then I buck\nHaving you screamin my name, (Mama Mia) sugar walls top rankin\nKeep a nigga peelin off the frequency be bankin, ah\nLet her take a spankin when I ride it back, was fake you out\nPlaya roll when you ain't shit like an actor\nMac the, wieldest niggas mama tie em down\nSilkk scarfs, hand cuffs, ghetto rodeo style now\nI can ride for miles, so daddy can you keep up\nGaurenteed to knock that ass out like you been beat up\nHeat up, hotter than July, cause big girls don't cry\nWe take it all stride out, slides up and down\nBounces all around, works it twerks it\nBuy Miss Pussy crown, I wears it\nI swears it's gonna (for real) be a cold day in hell no doubt\nTo ever say you want me out at the rodeo(uunhh)\n\nCHORUS:(x4)\n\nSilkk and Big Ed:\nWhere the cowgirls at where they at\nThe Bay Richmond\nWhere the cowgirls at where they at\nL.A. California\nWhere the cowgirls at where they at\nNew Orleans, Louisiana\nWhere the cowgirls at Where the cowgirls at where they at\nMiami, Florida\nWhere the cowgirls at there they go\nAtlanta, Georgia\nWhere the cowgirls at there they go\nCharlette the Caralinas\nWhere the cowgirls at where the cowgirls at where the cowgirls at\nThere they go\nNew York east-coast\nWhere the cowgirls at there they go\nChicago, Illinos\nWhere they at where they at there they go\nCleveland, Ohio\nWhere the cowgirls at there they go\nHouston, texas\nWhere they at there they go\nJackson, Mississippi\nWhere they at there they go there they go there they go\nNorth Mid-west Down-south West-coast\nUngh!\n(Rodeo)", "image": "https://images.genius.com/d1645663d13224ddd74a3441afd4c58c.772x768x1.jpg", "year": null, "title": "Rodeo", "album": "The Assassin"}]}