{"songs": [{"year": "2010-05-04", "image": "https://images.genius.com/eb6854c991aabb131bc059f24ab97e61.500x500x1.jpg", "title": "2000 & Beyond", "album": "K.R.I.T. Wuz Here", "lyrics": "[Intro:]\nRight now we'd like to bring on a young make who believes in doing things his own way. Based on the way he (?) all the folks who've seen him work, his way has gotta be pretty hip. So lets make some noise\n\n[Hook:]\nIn 2000 and beyond\n\n[Verse 1:]\nTricks and hoes, bitches and stripper poles\nShake it for dollar signs, let me see from behind\nThe ghetto's a fairytale, pimps and Jazzabells\nDealers with chrome rims with products for you to sell\nChemistry in the kitchen, alleys with rubber in it\nTires go round and round, windows heavy tinted\nKush is scented inside, pull me over\nNow they talkin bout a K9 (Code 6), black man face down\nCharge it to game, bums warm their weary souls over open flames\nJunkie can't find God watch him find his vein\nPreacher walk by like he ain't seen a thang\nPass the collection plate\nNiggas thought shit was gonna change on election day\nHealthcare H1N1 nasal spray\nGot me scared to hit the block\nWear my flag as a mask, tote a Glock, in 2000 and beyond\n\n[Hook:]\n\n[Verse 2:]\nPoor folk scrape dollars and spend the last of their income tax\nOn impalas with the S-S, church gives awards to the best dress\nPastor drive a Bentley, got me thinkin, I was the less blessed\nCause I let a middle man, he was cappin' with em askin'\nI dont understand, how you fit that many rings on a helping hand\nTired of deception, but I pay his kid's tuition cause I'm tryna get to heaven\nAin't it crazy, scared to have a baby\nHow can I protect it from the same streets that made me?\nConcrete gladiator blood shed overflowin\nIn real life some places Russell Crowe will never go\nPimp tight flossin, look at what it cost me\nPeace of mind no sleep late night tossin and turnin\nWaitin' on the end, pray to God forgive me for my sins, in 2000 and beyond\n\n[Hook:]\n\n[Verse 3:]\nAs a child I was cold with a chip on my shoulder\nGrandma told me be careful cause ther're sharks in the water\nThey will kill you, let the good lord steer you\nDon't worry bout the government\nCause baby they dont feel you\nMartin Luther King had dream, we was right there\nI wonder what he saw when up and had nightmares\nQuite scared, all the work he had done\nCouldn't stop what we've become, in 2000 and beyond\n\n[Hook:]\n\n[Outro:]\n(Ain't nothin' I say gon' get me outta this. But things were gettin' bad for me and I had to do what I had to do to survive)"}], "artist": "Big K.R.I.T."}