{"artist": "Boondox", "songs": [{"album": "Let ’Em Bleed: The Mixxtape, Vol. 2", "title": "They Know", "year": "2008-07-08", "lyrics": "[Intro: Dj Clay]\nSCARECROW\n\n[Verse 1: Boondox]\nOn my knees havin' feelings of pain\nOn the ceiling blood sprayed mist\nI'm needin some fuckin desperate healing\nI close my eyes to see my whole life pass by\nIm hurt up on the inside and ain't even gotta ask why\nIt's like I'm caught up in the pressure, feelin empty\nWaking up drenched in sweat, soakin wet\nAin't got nobody with me\nI'm all alone and fightin battles with my inner demons\nCloset filled with bones  so many secrets and they're talkin to me\nDid they see me do it? dump the body in the river\nOpen up their stomach, drink the blood, and then I eat the liver\nWas there a witness to my sickness?\nI swear paranoia got me goin crazy, should I confess?\nAll this murder piling up, stackin at my feet\nGot me in them cold sweats I'm drowning in a Krimson Kreek\nNow I'm nervous, feelin empty  scitzrophranic\nAll this passion, skull bashin, got me manic in a fuckin panic\n\n[Hook]\nI feel their eyes on me\nSomethin watches my every move\nIf they see what I see, they'd know exactly what I do\n\n[Verse 2: Boondox]\nTry and amend yet another crime on my mind\nWalk amongst society and try to leave this all behind\nBut every step I take I feel the pressure growin\nPeople starin at me, shit, all these motherfuckers knowin what I do\nBy the moonlight while creepin in the dark\nDo they know about the jogger in the bushes by the park?\nDo they know about the lady in the woods by the highway?\nWill I rot in prison cause I gotta do it my way?\nI shoulda listened to em cause it all made sense\nBurn the bodies, burn my clothes, and burn up all the evidence\nBut now I'm stressin with a mind full of questions\nScitzrophrania, depression, gotta find a new profession\nFeelin weak with all this growin' thin and this agony I'm livin in\nA killer from the crops only knowin bout a life of sin\nThis shit was easy when I didn't make the choices\nKillin ain't the same when you're ignoring all the voices\n\n[Hook]\n\n[Verse 3: Boondox]\nAll these voices in my head, are they the voices from the dead?\nI hear them comin down the halls underneath my fuckin bed\nIs it their spirits or their bodies that I tried to hide?\nThey come to tell me that they gon be waitin on the other side\nOr is it demons? yeah its demons knockin at my soul\nI might be better off if I let em take control\n\n[Hook]", "image": "https://images.genius.com/45a4c7c76935f48104a645b1482f821c.1000x897x1.jpg"}]}