{"songs": [{"album": "I Really Rap", "year": "2017-11-30", "title": "Extravagant", "image": "https://images.genius.com/8c75d09384d3e2e7dd519dae8ec8c1f5.1000x1000x1.jpg", "lyrics": "[Intro]\nUh\nTurn me up a little bit\nI don't wanna sound like I'm mad at nobody\nFull extravagant\nHarlem\nYou know where I'm from\nZeus\nYeah\n\n[Verse]\nLook, you know the dog, I'm a different pedigree\nI be so involved, I might get accessory\nHaters salty, diamonds do the Pepper Seed\nAnd what these babies cost me, I should do a registry\nAll this jealousy will never get the best of me\nFinish runnin' your mouth and check the legacy\nYou'll never F with me, so tell 'em S a D\nCars so foreign, I park 'em at the embassy\nYellin', \"Hi, hater\", goin' Al-Qaeda\nYou in my neighborhood, you better be a mob player\nTry a playa, the (?) look like an eye laser\nI been comin' off the hip before the SkyPager\nWho let the little league into the major league?\nWho tryin' to get with me, knowin' I play for keeps?\nYou'll never tame the beast, whoever claim I'm weak\nApologize like Kevin Hart before the tape release\nGeesh, let's keep it short, I'm on the go\nWho wanna smoke with Writer, ever though he's on parole?\nI come through with the semi, lookin' Jaffe Jo\nHe gon' do me like Remy, (?) on my PO\nI'm so mafio, even the mobsters know\nBanana clips stickin' out, look like a lobster roll\nGet a load of me before I let them choppers blow\nYou got some dope for me, you better bring it, rapido\nTryin' to be rival, you must be off the meds\nYou don't get it right, believe you gettin' all this lead\nWho's as nice as me? I put 'em all to bed\nNiggas biting me, shit feel like The Walking Dead\nDJ Khaled know I'm great with the bars\nSon couldn't hang with me if his name was Asahd\nWhatchu say, you a God? That's 'cause you rooks don't understand the culture\nYou in the field but you look light as Sammy Sosa\nYeah, there ain't nobody sicker\nWho really your favorite rapper if I wrote for that nigga?\nIf I wasn't, half of ya'll wouldn't even notice that nigga\nYou ain't notice that nigga? Huh\nYou lyrically in trouble, forget the help I get it off the muscle\nGuiseppe belt look like somebody scribbled on the buckle\nDominican, I hustle, the school be over grind\nSound like I'm gettin' off but I'm doing overtime\nZeus\nIt's over"}], "artist": "J.R. Writer"}