{"songs": [{"title": "Before They Called You White", "image": "https://images.genius.com/0d6839530413c8ca4d5d4da399f117ee.640x640x1.jpg", "lyrics": "[Intro]\nAt what point did poor European people that used to rebel\nAgainst the ones that forced them to work land they didn't own and die with nothing of their own\nWhat was it that turned their hearts so that they start to identify with power even though they're powerless?\nIdentify with wealth even though they're broke?\nIt's the invention of whiteness\n\n[Verse]\nThey call you white by white standards\nDamn what they're talking 'bout human first\nStand and curse the dirty hand that first crafted the plan\nSpread it through the land and shattered the damn Earth\nThis is sickest system that ever existed\nSince this Earth's beginning, commenced, it's twisting\nHow you convince man with red blood to bleed?\nCompletely devalue what a human being means\nNobody called themselves white several centuries ago\nThey were living off the land with the trees\nThey were Dutch, they were Irish, they were German\nThey were Greek with culture, families, tradition and beliefs\nAnd rich blood suckers saw new soil to seize\nAnd they ain't 'bout to get their hands dirty, cracker please\nSwindled you to trade in your identity\nShowed you pie in the sky and promised you a piece\nWith symbolic image in the scripture that you're reading\nWhite holy angels and black evil demons\nYou were so starving that you started to believe it\nNow you'll die colonizing for somebody else's greed\nDon't you see the overseers are still in the field?\nEvery breath a warden breathe is still in the jail\nYou will never own that farm or the prison for real\nTerrified of the time when your victims rebel\nListen you don't fear them, you fear the blood on your hand\nAll the ugly you done to that man\nThat woman, that child, that land\nThat sea, that sky, that they'd look you in the eye\nAnd demand that you tell them why\nAll them years whipping, and lying, and killing\nGenerations of poison, and bombing, and drilling\nAll designed to turn the hearts of your children to stone\nGot post traumatic slave master syndrome\nHow the hell are y'all going to heal, be made whole?\nYou identifying with the people in control\nYou can't throw a human in the bottom of a boat\nUnless somebody got a damn chain around your soul\nIn that middle passage asking who got stole?\nA hot auction block where your blood ran cold\nEvery day a cop let them shots explode\nYou're gon' have to find a way to regain your soul\n\n[Hook]\nI said the eye can't see itself\nIt can't sit back, critique itself, and peep itself\nIt needs help\nTake the sword for example\nNo matter how hard, it can't carve its own handle\nI said the eye can't see itself\nIt can't sit back, critique itself, and peep itself\nIt needs help\nTake the sword for example\nNo matter how hard, it can't carve its own handle\n\n[Vocal Sample]\nThe inner city of our cities is like another country. The rules are different. It's almost like you need a passport there. The police treat people differently. When I lived out in the suburbs, if my car broke down on the highway and a state trooper pulled up behind me, I wouldn't have been scared. I'd have been glad. But young man after young man after young man had been beaten by the police and the only way you know, you've got to be with the people and we live separated. We go in air conditioned cars and we stick on your interstates and hang out with people just like us. Well, by God's grace, I was brought into this, and seeing how race plays a part and how poverty plays a part, and my job is to go out to the American people", "year": "2017-05-05", "album": "All the Beauty in This Whole Life"}], "artist": "Brother Ali"}