{"artist": "King T", "songs": [{"image": "https://images.genius.com/dc61ccdd1dd20750a95785c799561625.820x820x1.jpg", "title": "Flirt", "year": null, "album": "Act a Fool", "lyrics": "(Oh yeah)\n(Flirt) (flirt) (flirt) (flirt) (flirt)...\n\n(Oh yeah)\n\n[ VERSE 1: King Tee ]\nNow girlies, ladies, just stay alert\nI'm what you call a legitimate flirt\nAnd if you don't know how to spell f-l-i-r-King Tee\nThe coolest of the cool, there's no one cooler than me\nBecause I talk to dames with no hesitation\nI fill their heads with dreams and fascination\nAnd when it's time for me to break that bone\n(Oh yeah) I just wax, then send they ass home (See ya!)\nCause I'm a K-i-n-g, no, a p-i-m-p\nI put pretty girls to work\nNow if you wanna join my crew\nYou must listen to what I do\nIt's real simple, it's slick and real easy\nI just (flirt)\n\n(Girls will all wanna try) --] LL Cool J\n(Flirt)\n\n(Oh yeah)\n\n[ VERSE 1: King Tee ]\nNow don't get me wrong, I don't think I'm macho\nI talk to girls and they get all hot, so\nI just let em know that I'm a real cool niggaroe\nNot a tramp, just your average gigolo\nClose to Casanova, got the knowledge of Farrakhan\nStroll like a pimp or a black Don Juan\nI play my role real cool cause I don't wanna scare em\n(Oh yeah) I'm recruitin for my King Tee harem\nGirls try to front messin with the pooh-put\nI just tell em who I am and knock boots, huh\nI diss a stunt after smokin a blunt\nCatch a real fly girl cause they think I'm a hunk\nBut I'm a (flirt)\n\n(Thought I was a) --] Rakim\n(Flirt)\n\n(Oh yeah)\n\n[ VERSE 2: King Tee (& DJ Pooh) ]\n(Now wait a cotton-pickin second, King Tee)\nWhat's up? (You're not a better flirt than me)\nWha-ha? Who are you? (Pooh, the pimp saga\nI take the freak to the Snooty or Ramada\nYou take girls to a cheap motel)\nSh-shut up (Then run your mouth like Howard Cosell)\nNo, it's not like that, I'm a romancer\nSkeezers like the way I do the cool dances\nI got money to spend, I got money to lend\nAnd if the girls don't want it, hell, give it to the men\nI ain't a souped up jerk\nIt's either my way or the highway, the fly way\nI'm a (flirt)\n\n(Oh yeah)\n\n(That's right y'all, his name is) --] Kurtis Blow\n(Flirt)\n\n(It can be done but only I can do it) --]Rakim\n\n(Flirt)\n\n(King Tee is) --] King Tee\n(one hell of a) --] Dimples D\n(flirt)"}]}