{"artist": "Capital STEEZ", "songs": [{"title": "Infinity and Beyond", "album": "AmeriKKKan Korruption", "year": "2012-04-07", "image": "https://images.genius.com/6172be389a954926184790991e7ca0ff.500x500x1.jpg", "lyrics": "[Produced by J. Rawls]\n\n[Intro]\nRest in peace R.I.O.T\nSay I owe him a verse for this\nSo Ima give him a verse for this\nAnd I ain't gotta rehearse this shit\n\n[Verse]\nI got em asking what I'm going do next\nProbably find me riding with McFly on a photo jet\n\"Why you ain't go solo yet?\"\nIdontknow?, I just ain't planned to lose my manz for no wrote off checks\nBut, damn, we still ain't make a cent\nBout to leave high school and moms gotta pay the rent\nPlus she climbing outta major debt\nSo it shows that you never too old to take baby steps\nBut I was used to them hard lessons\nThis rap shit came along as an odd blessing\nMy best man told me \"aim for the stars brethren\nI'll be riding shotty, so start revvin' them car engines\"\nFrom Illmatic to Villematic, dance songs pop, but real rappers is still at it\nI don't even think a deal matter, because when the fame come, you just another pill addict\nAnd, that's a genre I refuse to represent\nThe next option is rendezvous with elegance\nIf your collars blue you're probably used to standing at a desk for eight hours\nAnd opted out to selling bricks\nAnd then come selfishness\nBut I don't planned to quit until every single shelf is hit\nAnd when I try to pull myself to quit, I'm more in it for fans than I'm in it for me\n\"Yo, STEEZ, you know you nice dawg, you killin' them beats and\nI'm really wishing I could send you a beat, and you need to get on some industry beats\nAnd that girl you wrote a song, is she letting you beat?\"\nWoah, hold up dawg, you can't be serious?\nYou really think I fell off from lyricism?\nTell these cats the top dawg is in the kitchen\nCooking up tracks and this time you better listen\nCause if you ain't noticed yet, we growin vets and we still ain't broke a sweat\nBlowing dust off of old cassettes\nIt just hasn't been the same since my homie's death\nYou little niggas hold no respect\nThinking that you gotta hold a tech to pose a threat\nI told you I'm focused man\nIt's point game, no assist, and I'm going in, said I'm going in\n\n[Chorus]\nThis is how we chill from '93 til\nThis is how we chill from '93 til\nThis is how we chill from '93 -- til infinity and beyond\nThis is how we chill from '93 til\nThis is how we chill from '93 til\nThis is how we chill from '93 -- til infinity and beyond"}]}