{"artist": "Rich Homie Quan", "songs": [{"lyrics": "[Into]\nOkay , I'm reloaded\n[Rich Homie Quan]\nYou ready B\nHa ha ha ha If I could go all the way back\nAnd change it all\nI wouldn't\nI came from the bottom for a reason nigga\n\n[Verse 1: Rich Homie Quan]\nJumped off the porch\nIen have nothing\nWhen i was poor, they was laughing at me\nNow I'm on them billboards, and I'm laughing at them\nI give you my heart, you can have it baby\nIt was cool at first, it's been a little dramatic lately\nWas me and you at first, it's been me and your family lately\nWhy throw my name in the dirt\nI'm like what happened baby?\nMake up sex make her hurt\nRide this saddle baby\nCuz them, No Muslim but it's 'Alaykum\nCause them, My cousins will get something taken\nThe oven baking, left the motherfucker on 350\nI ain't counting Monday, feel like I been on the road for 350\nDays nigga (aye)\nI'm paid nigga (aye)\nAin't tell you bout the house that I got with\nThat Lake in the backyard nigga\nAct hard nigga\nI will pull your card nigga\nPlay, with me got some niggas who will\nLay on you\nWhere you stay?\nNigga I ain't playing 100 gran on your head nigga\nLike a Jesus piece, Nah I ain't playing with you\nIf the bitch a freak, I ain't even laying with her\nUsed to hit licks just to make a couple bands nigga\n(Aye, Aye) Talk a little louder\nI ain't heard what you saying nigga\nDid a couple walk-throughs\nMade a lot of bands nigga\nI ain't tryna talk to you if yeen talking cash nigga, Money\nLike Usher I got it bad nigga\nBad Nigga\nMichael Jackson Bad Nigga\nBad nigga (aye)\nLeather jacket on\nYeah, I'm that nigga\nI was born in the 80s like the crack nigga\nAye (8x)\n\n[Verse 2]\nNever heard of a atari, play games on 'em\nNever drove in a Ferrari, switching lanes on them\nDamien Wayans that's a shame on them\nBig booty freak, lil bitch, tatted my name on it\nI heard them niggas hating, ya'll the same on us\nSince them niggas claim they hot\nI set some flame on them\nReal nigga. What youu thought?\nWe ain't  lame homies\nSkinny jeans see the knot, and that thang on me\nBang Bang Pow\nThere go one of y'all niggas\nIf I aim at y'all I ain't missing you niggas\nCreep in your house like Clause, I ain't using no chimney\nLike the 24th of December\nIma make youu niggas remember\nThem Christmas Eve's I ain't have shit, beginner\nThem open mics they was laughing\nNow I'm spending so much money\nThey ain't asking\nNo question bout my bitch\n'Cause she the baddest\nI be on the road\nYeah I seen a lot of hoes\nAt the end of every rainbow is there a pot of gold\nWanna hold you in my hand, want you under my control\nForesighting  the city girl I wanna tear the globe\nRan off my money now I'm tryna get some mo\nBands to the ceiling, yeah we stacked it from the flo'\nAnd we got some more up in the walls\nSome more behind the pictures\nOver the hot fire plate\nBehind the Lord\nI ain't like the call\nEmpire he was out\nReferee that's a foul\nGot a technical 'cause of hard a nigga ball\nTMZ all in my business 'cause I fall\nI meant fell\nBorn in October, weigh it on my scale\nI ain't tryna come over if I can not nail\nThis picture in your frame\nThese bitches know my name\nRich Homie Baby", "title": "For Rich Or Poor", "year": null, "image": "https://images.genius.com/334dc3565e640f1df6f809a163903cad.1000x1000x1.jpg", "album": null}]}