{"songs": [{"lyrics": "[Intro: Jay-Z]\nWhat?\nWell fuck you... bitch\nNow can you bounce wit me, wit me, wit me wit me\nCan you bounce wit me, bounce wit me, wit me wit me\nCan you bounce wit me, bounce wit me, ge-gi-gi-gi-gi-gi\nCan you bounce wit me, bounce wit me, ye-ye-yeah\nUh-huh uh-huh bounce wit me, bounce wit me\nCan ya can ya can ya bounce wit me, bounce wit me\nYa-yah-yah, ya-ya-yah-yeah bounce wit me, bounce wit me\nGe-gi, ge-gi-gi-gi-geyeah bounce wit me, bounce wit me\nGet it!\n\n[Verse 1: Jay-Z]\nCan I hit in the mornin' without givin' you half of my dough\nAnd even worse, if I was broke would you want me\nIf I couldn't get you finer things like all of them diamond rings\nBitches kill for would you still roll\nIf we couldn't see the sun risin' off the shore of Thailand\nWould you ride then, if I wasn't driving\nIf I wasn't a, eight-figure nigga by the name of Jigga\nWould you come around me or would you clown me\nIf I couldn't flow futuristic, would ya\nPut your two lips on my wood and kiss it, could ya\nSee yourself with a nigga working harder than nine to five\nTen to six, two jobs to survive, or\nDo you need a baller, so you can shop and tear the mall up\nBrag, tell your friends what I bought ya\nIf you couldn't see yourself with a nigga when his dough is low\nBaby girl, if this is so, yo\n\n[Refrain: Jay-Z & Amil]\nCan I get a fuck you\nTo these bitches from all of my niggas\nWho don't love hoes, they get no dough\nCan I get a woop woop\nTo these niggas from all of my bitches\nWho don't got love for niggas without dubs\nCan I get a fuck you\nTo these bitches from all of my niggas\nWho don't love hoes, they get no dough\nCan I get a woop woop\nTo these niggas from all of my bitches\nWho don't got love for niggas without dubs\n\n[Break: Jay-Z & Amil]\nNow can you bounce wit me, uhh\nBounce wit me, bounce wit me\nCan ya can ya can ya bounce wit me, bounce wit me\nUh uh.. Major Coins, Amil-lion\nBounce wit me, bounce wit me\nUhh, yo bounce wit me\nCan ya can ya can ya bounce wit me, bounce wit me\nYeah, uh-uh uh uh\n\n[Verse 2: Amil]\nYou ain't gotta be rich but fuck that\nHow we gonna get around on your bus pass\nBefore I put this pussy on your mustache\nCan you afford me? My niggas breadwinners, never corny\nAmbition makes me so horny\nNot the fussin' and the frontin'\nIf you got nothing, baby boy, you better\nGet up, get out and get some, shit\nI like a - lot of Prada, Alizé and vodka\nLate nights, candlelight, then I tear the cock up\nGet it up I put it down e'rytime it pop up, huh\nI got to snap 'em, let it loose, then I knock ya\nFeel the juice, then I got ya - when you produce a rock\nI let you meet momma and introduce you to poppa\nMy - coochie remains in a Gucci name\nNever test my patience, nigga, I'm high maintenance\nHigh class, if you ain't rollin', bypass\nIf you ain't holdin' I dash yo\n\n[Refrain: Jay-Z & Amil]\nCan I get a fuck you\nTo these bitches from all of my niggas\nWho don't love hoes, they get no dough\nCan I get a woop woop\nTo these niggas from all of my bitches\nWho don't got love for niggas without dubs\nCan I get a fuck you\nTo these bitches from all of my niggas\nWho don't love hoes, they get no dough\nCan I get a woop woop\nTo these niggas from all of my bitches\nWho don't got love for niggas without dubs\n\n[Break: Jay-Z & Ja Rule]\nNow can you bounce for me, bounce for me\nUhh\nCan ya can ya can ya bounce wit me, bounce wit me\nUhh!\nGi-gi-gi-geyeah-geyeah\nCan ya bounce wit me, bounce wit me\nUHH!\nGi-gi-gi-gi can ya bounce wit me, bounce wit me\nUhh! Yeah\n\n[Verse 3: Ja Rule]\nIt ain't even a question\nHow my dough flows, I'm good to these bad hoes\nLike my puss wet like damp clothes\nWhat y'all niggas don't know: it's e-asy to pimp a hoe\nBitches better have my money fo' sho'\nBefore they go runnin' they mouth, promotin' how\nI be dickin' they, back out, go 'head, let it out\nI fucks with my Gat out, bounce and leave a hundred\nMakin' 'em feel, slutted even if they don't want it\nIt's been so long, since I met a chick ain't about chips but then I'm\nDead wrong, when I tell 'em, \"be gone\"\nSo hold on to the feelin' of flossin' and plat-num\n'Cause from now on, you can witness Ja the i-con\nWith hoodies and Timbs on, 'cause I thugs my bitches\nVV studs my bitches, then we rob bitch niggas\nI'm talkin' 'bout straight figures, if you here, you with us\nIf not Boo, you know what, I still fucked you\n\n[Refrain: Jay-Z & Amil]\nCan I get a fuck you\nTo these bitches from all of my niggas\nWho don't love hoes, they get no dough\nCan I get a woop woop\nTo these niggas from all of my bitches\nWho don't got love for niggas without dubs\nCan I get a fuck you\nTo these bitches from all of my niggas\nWho don't love hoes, they get no dough\nCan I get a woop woop\nTo these niggas from all of my bitches\nWho don't got love for niggas without dubs\n\n[Outro: Jay-Z]\nNow can you bounce wit me, bounce wit me\nGe-gi, ge-gi-gi-gi bounce wit me, bounce wit me\nWit me wit me wit me bounce wit me, bounce wit me\nBounce, bitch, bounce.. wit me wit me wit me wit me\nCan ya bounce wit me wit me\nGe-gi, uh-huh uh-huh uh-huh uh-huh\nUh-huh uh-huh uh-huh uh-huh uh-huh uh-huh uh\nCan ya bounce wit me bounce wit me\nGeyeah", "title": "Can I Get A…", "image": "https://images.genius.com/c98b5b5a93b431022bb0d85c9e92a691.400x400x1.jpg", "year": "1998-09-29", "album": "Vol. 2… Hard Knock Life"}], "artist": "JAY-Z"}