{"artist": "Petey Pablo", "songs": [{"album": "Diary of a Sinner: 1st Entry", "title": "Do Dat", "image": "https://images.genius.com/0d2bbb0b347544f2a5d6ad0222f2fcda.220x220x1.jpg", "lyrics": "[Intro]\nAiyyo check this verse out\nMy platinum chains, my big willy, my Mercedes-Benz\nThat's right? {*laughing*}\n\n[Verse 1]\nAre you a gun busting nigga? (Buh-Buh-Buh-Buh)\nAre you a bitch baggin nigga? (Whu-Whu-Whu-Whu)\nYou got ice and ya chain and ya chong wit your Rolly on\nNot just any Rolly but you bought the most expensive one\nHey take ya car keys*Jingle Jingle* to ya class E\nBig body be for your CD- I mean, DVD\nFor ya T.V in ya head beats, in ya back seat\nHaha, y'all think I'm mean\nRunnin round talking bout the shit that you be talking bout\nHow you the drug game sold up and locked down\nJohn Gotti got life and I'm sure he never told nobody\nBoy lets put on an album so the fuckin feds could buy it\nYou shouldn't be shouting out them bodies you buried\nNine millimeters and Techs and them AK47's\nIllegal weapons you talking bout you snucked in the club\nYou got so many guns\nTell me why you rappers steady getting robbed\nI got two more verses for you (huh)\nThis ain't just to an individual person\nThese questions here for all of ya\n\n[Hook]\nI can write a song without ice, bitches, and cars\nCan you mutha fuckas do dat? (DO DAT?!)\nI can blaze a track without bustin a gat at a cat\nCan you mutha fuckas do dat? (DO DAT?!)\n\n[Chorus 2x]\nYoouuu gon' have to change up all yo shit in a little bit\nWhen the radios in the club get to pumpin this\nAnd they start to finding out what what rappin really is\n\n[Verse 2]\nVerse 2, now that you know what the song's about\nYall probably cussin me out\nYou gonna listen to it anyhow\nLets talk about somebody like Eskimo\nRentin they jewelry from Jacob and don't think we know\nYou got a platinum piece but your chain is plain white gold\nAfter the video it got to go back to the store\nThat's Crazy, talkin bout some shit you don't own\nOughta be ashamed of yourself\nYo, don't they call that frontin, holmes?\nYou ain't Jigga, Nigga\nNor can you spin like Puff\nAnd got a cash money deal\nSo what's your Big Willy talk for?\nI get so excited man, your track got me leapin\nThen you start rhyming and *Yawn* I get sleepy\n\n[Chorus]\n\n[Hook]\n\n[Verse 3]\nIt's a sad situation, record labels buggin out\nCuz they star artist done ran out of shit to talk about (Whoa!)\nYeah that's crazy and you think about it baby\nOnly thing that changed in yo rhyme was ya date \"2000\"\nOh that shit is hot, put that on the album\nYou heard it with my man kick that shit (??)\nLoud and proud, nigga swear he be throwin down\nArthur lose his voice every time he opens his mouth\nI oughta hold up a signs and boycott they ass right\nNo more muthafuckin sound alikes!\nSound-a-like (Mobb Deep!) Sound-a-like (Jay-Z!) Sound-a-like (B.I.G.!)\nAnd we don't need no more please!\n\n[Chorus]", "year": null}]}