{"songs": [{"title": "Grm Daily (Pompus Peterson) - Freestyle", "lyrics": "[intro]\n\nGood Evening Ladies & Gentleman!\nMy name is pompous Peterson and I am heir to the “Print Money When You Like - Fund Genocide at Will” Banking Dynasty\nAnd I’ll be speaking at the Thieve’s Banquet across Great Great Britain from this coming Monday\nBut in the meantime, I would just like to share some thoughts with you on what I think it takes to be a wonderful thief:\n\n[Verse 1: Akala (as Pompus Peterson)]\n\nSpeak proper English, you’ll go further\nThe accent of legitimate murder\nCos silly boys think they're bad with their burners\nBut I drop shit from the sky like a bird does\nYou can’t duck when I drop my muck or merely say yuck\nYou are totally fucked\nWhen you claim that you body man\nBut I duppy more man than any 'ex shooter' can\nCos I went to Eaton and Oxbridge\nWe get it in with the wraps in the boxes\nThese silly boys really think that we’re doctors\nBut look closer, we’re actually monsters\nAll you chavs and immigrant scum\nDare to complain when I drop you a crumb\nBut I ain’t having none, no not a bar\nCos I passed the bar and the ultimate par\nWhen I tell the people 'just work hard and you will go far'\nNo you must learn how to smile as you kill\nIf you want to be like the folks on the hill\nWith the bank full of mil’s and a land full of drills\nWe get those spectacular deals so who can fuck with me?\nI’m living in luxury, villa in Tuscany\nTrain full of cocaine\nAnd a bunch of little boys yet they put their trust in me\nCos I pronounce my T’s with E’s so they believe my cheese\nBut no brown man with a beard can bomb like me\nNo, never could be!\nAnd I bust my gun in a dancehall set speed\nQuicker than any yardie\nNo brown man with a beard can’t bomb like me\nNo, never could be!\nAnd I bust my gun in a dancehall set speed\nQuicker than any yardie could dream\nYou don’t really know what it means to be me\nMy soul I dream to redeem\nNo in fact I’m ecstatic cause my bombs they kill democratic\nSilly paupers can’t hack it\nBring it to me, who’s gonna back it?\nWhen I’ve got beef with a chief I draw from my goons\nYou call them soldiers and police\nBut they are just private security\nEven though you people pay for them\nWhen your protests try to get close to the rich\nWho keeps you away from them?\nIt’s a racket I’m of,  you couldn't dream of\nNo tax bracket, I just whip the cream off\nGreen, you must be lean off\nIf you think democracy’s what I dream of\nMy ally is Saudi Arabia, I sip tea down in Belgravia\nAnd oppose a leader in Africa and support the massacres in Papua\nAnd that is all before breakfast\nSo I’ve got no response for the hecklers\nAll over the globe I’ve got assholes that hate their own and kill for the throne\nAnd I own your manor\nSo mind your manners\nWhich gang-bangers?\nWhat bandanas?\nCock what hammers?\nPlus my grammar never stammer\nPlus my grammar never stammer\nI own money, I’ve been getting rich\nBitch!\nEver since 1066\nShout to John Locke and Adam Smith\nMy late homies started this shit\nNow everybody wants a part of this shit\nBut you must know there’s an art to this shit\nFirst, you must pronounce your T’s with ease\nSo they believe your G’s\nBut no brown man with a beard can’t bomb like me\nNo, never could be\nAnd I bust my gun in a dancehall set speed\nQuicker than any yardie\nNo brown man with a beard can't bomb like me\nNo, never could be\nAnd I bust my gun in a dancehall set speed\nQuicker than any yardie could dream\nTouring starts next week\nBanquet of Thieves, November 19th\nYou'll see that half breed picky haired chap\nBut he can rap\n\n[Verse 2: Akala]\n\nWhat’s the palava? nobody’s harder\nThan father Akala, I’m smarter than Arthur\nRappers talk grease and I grieve them with laughter\nOf my life, them family don’t know that half of..\nLike I ain’t ever been in a balaclava\nI’ll spar in the ring, bring arms to the master\nFather, you don’t really want nada\nI’m harder, I’ll flow, beat down like Alana\nNada\nNuff of the coco and garner, when anybody make me a martyr\nI charter\nKarma surrounds my aura with armor\nI’m sure that your “sword?/soul?” “caught boat to the harbor?”\nOn the microphone, a lotta clones\nBut I’m known all over the globe for spittin poems\nAnd I am my label\nTower of Babel, I can’t explain you\n“mits?” “they rate you?”\n10 years grindin’\nLook how many man are signed or unsigned all of the time and\nBut I’m still shining\nWith nothing but the talent of my rhyming\nNever did babble about a diamond\nI’m dabblin’ with the finest, travelin with your highness\nI’ll spit a verse, I’m jabbin ‘em with the timin’\nOf Ali when shufflin at his prime and\nYour man are doin’ nothin, I swear that you’re only mimin’\nDeaf as a bat\nI’m darker than black\nA sergeant, marchin’ with scars on my back\nYou’re a target so you can hardly relax\nWhen I pass you, never had the chance to react\nLet alone the heart to attack\nAnd let that be that\nI’ll see you on tour...", "year": null, "album": null, "image": "https://images.genius.com/3222ca5815132f2ac56b73bacb186bf1.1000x672x1.jpg"}], "artist": "Akala"}