{"artist": "Ice-T", "songs": [{"title": "Message to the Soldier", "lyrics": "Yo, Ice, you been down with the struggle for a long time, man...\nWhy don't you drop some knowledge for these brothers who\nWant to get involved in this war...\n\nTake notes: real gangstas wear trench coats\nGrey suits, black ties and they seek votes\nAnd you're not to be misled\nThey'll kill you in your fuckin' bed\nThey don't sell dope, yo, excuse me, yes they do\nBut they don't look that much like me or you\nBut if you pull up the sheets and expose them\nThey'll crawl up like snakes and show fangs of venom\nNow I've been soldier for years\nRepresentin' the tattooed tears\nOther brothas locked up with no choice\nLeft in the bowels of the devil with no voice\nMy phones are tapped, my crib is bugged\nMy car is tailed from club to club\nAnd this ain't no fuckin' joke\nThey want to see a nigga broke\nYou can't slip, if you slip you're out\nYou gotta know what you're talkin' about\nDrop science every chance you get\nHit direct and indirect, speak in code\nCause you're never alone\nThat's why I use this low tone\nFollow this and you might grow older\nThis is a message to the soldiers...\n\nNow they killed King and they shot X\nNow they want me, you could be next\nAll you gotta do is speak too loud\nAll you gotta be is be too proud\nCause once you let'em know\nWho you are and where you're at\nYou better watch your back\nCause you might think you're just dope\nWhile you're livin' in a sniper's scope\nI'm not tryin' to scare you\nBut there's a danger if you get too deep\nSome nights I don't sleep\nAll you wanna do is tell the truth\nAll you wanna do is save the youth\nIce Cube knows, Souljah knows, P.E. knows\nThey throw death blows\nAnd if you got kids or a girl that's true\nThey'll move on them too\nBut when I'm gone I need you to carry on\nYou gotta be strong and fight for our salvation\nBut there will be retaliation, soldier...\n\nTo think that rap couldn't be attacked\nIs ignorin' the simple fact\nThat they never ment us to speak\nThey had planned to keep the black man weak\nBut rap hit the streets\nBlack rage amplified over dope beats\nNow they want to shut us down\nAnd they don't fuck around\nCheck the history books, son\nBlack leaders die young\nThey tell us that your words are scary\nThey're revolutionary\nBecause we speak the truth\nAbout crime and drugs\nAnd expose the real thugs\nThis info is not beneficial\nTo the groups that go by three initals\nSo they try to discredit\nThey'll dog you with an edit\nPrint the words the way you never said it\nBut we gotta make'em regret it, soldiers...\n\nWord! I know a lot of brothas out there want to get in this war...\nYou know what I'm sayin'? a lot of sistas got a lot of knowledge to drop on our people. But right now they're movin' to shut down all hip-hop. The first amendment had absolutely nothin' to do with black people, at the time constitution was written, we were considered nothin' but property...The expectation of havin' black people speak on records never came to mind, so we gotta move!\nBut believe me, all the black leaders have been silenced and most\nOf the time it's been violent, so if you choose to get in this war\nRealize what you're in for but we gotta move on...\nAnd we gotta stay strong...\n\nMessage to the soldiers, welcome to the struggle...\nMessage to the soldiers, be careful, soldiers...", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg", "album": "Home Invasion", "year": "1993-03-23"}]}