{"artist": "Fashawn", "songs": [{"year": "2014-12-01", "album": "Fash-ionably Late", "image": "https://images.genius.com/eac42f05dd35017f5b015faee937c6b6.500x500x1.jpg", "lyrics": "[Intro: Fashawn]\nShit is madness...the fuck is wrong with you?\nYo Al, calm down, calm down man...\nNo really, what the fuck is wrong with with you?\nYou got some nerve, bitch\nUh, uh\n\n[Verse 1: Fashawn]\nTell me, how could you disrespect me in public?\nYou can come and get the rest of your luggage\nThis has nothing to do with fame, shit I came from nothing\nAnd I know when a bitch brains corrupted\nStill in awe; not Eve, wondering \"Why Eve?\"\nThe one who gave birth, supposed to be the Earth to my seed\nIf I could press rewind, I never would've put my hands on you\nNever read the manual, \"Things that a Man Should Do\"\nUh, I'll admit I've had a few\nApril, Danielle, Rachel, Amber too\nThe furthest thing from the family dude\nShowed us pictures of me somewhere on camera nude (that's fucked up, I'm sorry)\nShit, I tried but honestly\nThe concept of monogamy is not for me\nOnly thing I'm  afraid of is commitment\nI'm sorry but this relationship has ended, now stay up out my business (bitch)\n\n[Bridge]\nSo if you want to see a nigga again, you ain't gotta pretend\nUh, no I'm not a lover, but I'm more than a friend, I don't know where to begin\nAnd she don't ever want to go out, she said she'd rather go in\n\n[Interlude: Fashawn and Samples]\nLet's go in, hey hey, oh\n\"There's some ladies out there that can do some wild shit\"\nI'm telling you, dawg. Know what I'm saying though?\nYeah, I see them too\n\"Check this out\"\nOk, ok, type of bitch, I know you ain't lying\n\n[Verse 2: Fashawn]\nUh, her crib's spacious but its rented\nShe get impatient when it come to big faces\nSummertime: paper-chase, hibernate for the winter\nJust maybe you'll catch her face in December\nKept her fans itching, I mean the fiends springing\nHad that ambition, trying to reach a zenith\nTo the top from the bottom, all the while\nStayed fresh from her socks to her noggin off the Game Wess\nLike Jigga out West, they're in trenches\nType of chickens that drive Lexuses and Benzes\nBut still alift in Maybach, keep her thang cocked\nA pain in the ass; bucket, ain't no straight shots\nI swear I'd never hit a woman\nBut I'd shake the shit out, when if she don't zip her mouth up\nCan't live with them, can't live without them\nWe go overboard for what's under their blouses\nI swear, some be on some wild shit\nYou know the ones you wouldn't want to have a child with\nOh no, I see your ass and trowel tip\nI can tell by a smile she a foul bitch\n\n[Interlude: Fashawn and Samples]\nCheck it out, uh, check it out\n\"Something for your mind, body, and your soul\"\nUh-huh, yeah; ayo Alc\nWe coming from, coming from, uh uh\n\n[Verse 3: Fashawn]\nFrom the side of California where dreams are denied\nAnd niggas collect cream doing crime\nBut for me, fortunately, I can rhyme\nBelieved eventually I would shine\nClimb out the bucket in fact, never stuck in the trap\nI'm singing, the production is what I come to attack\nQuit bumping your gums and go uncrumble your raps\nYou ain't a boss, you a worker; here, hustle this pack\nBoy, get down or get from 'round here\nFor a pound, I'll leave a clown aired the fuck out\nIn a minute, knock a nigga from his couch to his kitchen\nUh, I don't mean to be mean, but that's all I can be\nAll I got is my word, these two balls in my jeans\nAnd the world in my palm as long as I'm in control\nI hypnotize your mind, body, and soul\nLet it be known\n\n[Outro: Fashawn and Sample]\nIt's the F, nigga\nUh, word to safety, word is simply\n\"All my life I've been a rolling stone\nI got no place that I call my home\"\nDesperado, Santiago, uh", "title": "Songs in F Major"}]}