{"songs": [{"year": "2000-03-30", "image": "https://images.genius.com/2820e48a4c103631f8e268bb9d4c2db0.355x350x1.jpg", "title": "It’s So Hard", "album": "Yeeeah Baby", "lyrics": "[Verse 1: Big Punisher]\nYou can catch me in the cherry red one-fifty\nGot the Glizzy locked in the stizzy\nPop the clizzy, going sixty down a one-wizzy\nDrunk pissy, tryin' to cruise through the avenue\nWhile my peoples is poppin' bottles up in Sue's Rendevous\nFuck that! Spun the U-ey, lost a hubcap\nIt's back to the shack, came back in a \"What's that?\"\nStraight from Paris, checkin' Gaby's new baby carriage\nPerry Ellis, auburn cherry reddish\nFresh out the dealer, got the TEC for the squealers\nWear a vest for the killers, nothin' less, ‘cause it's realer\nIn the Big Apple, where it's quick to get your shit tackled\nEnemies spit at you, best friends kidnap you\nTrust no one; got beef, bust yo' gun\nYou don't need no one talking 'bout that you owe him\nI'ma go for dolo; Scarface without Manolo\nOne deep, I be solo, bustin' heat, throwin' bolos, it's hard\n\n[Hook: Donnell Jones]\nAnd it's so hard, yeah\nNiggas wanna be like Pun\nBut they don't bust they guns\nAnd it's so hard\nNiggas wanna fuck my wife\nNggas wanna take my life\nBut it's so hard\n\n[Hook adlibs: Big Punisher]\nIt's hard work, baby\nI just lost a hundred pounds, I'm tryin' to live\nI ain't goin' nowhere\nI'm stayin' alive, baby\nThat's my wife, I paid for them titties!\nGet your own! Your own, ya heard?\n\n[Verse 2: Big Punisher]\nRollin' with the Squad, we like Gods\nCatch us at the bar-de-bar-de-bars, strip bars in Miami\nAlmost came home with the Grammy\nNext year, bringing home three for the family\nWatch me, you can catch it live on the Hitachi\nPoppin' shit like a Nazi, iced out like DeBiase\nFuck that! Liberace, fo'-X Versace, somebody stop me!\nNever that! SKEE-YU! Where my niggas at?\nUptown, uptown, you know you feelin' that\nCash rule, hardcore you can dance to\nThat old Biggie give me, One More Chance\nTake a glance and I'm off with yours\nWith both hands take off my drawers\nAnd jerk me like the Source Awards\nI love hip-hop, I ain't even probably the best lyricist alive\nTerror Squad, nigga, stop sleepin'!\n\n[Hook: Donnell Jones]\nAnd it's so hard, yeah\nNiggas wanna be like Pun\nBut they don't bust they guns\nAnd it's so hard\nNiggas wanna fuck my wife\nNggas wanna take my life\nBut it's so hard\n\n[Hook Adlibs: Big Punisher]\nWhat you say your name was again?\nAnd I know you from where? Elementary school?\nI don't know you, man!\nMoney, not you again, go that way!\n\n[Coda: Donell Jones]\nYeah, you ain't fucking my wife, takin' my life\nAnd if you just hatin', just walk on by\nAll you haters just walk on by\nSee, me and Big Pun be rollin'\nSchemin' on you and your homie\nBetter just walk on by\nWhile we role back and talk for a while\nAnd to the Boricuas, stay up, stay up, stay up!\nAnd to all my homies, you gotta know what's up!"}], "artist": "Big Pun"}