{"artist": "WC", "songs": [{"year": "2007-08-14", "lyrics": "[W.C.]\nTwist the cap back and turn it up and\nBack to get it crackin' in this motherfucker\nComin' through like pardon me, excuse me\nSmellin' like ooh-wee in a blue T, y'all know who I be\nDub Sizzleen, eyes full of Visine\nLeanin' in a 745-LI Beam'\nBig bucks and big trucks, buzzed and faded\nYou and that toothpick lookin' drug related\nNew money, new day - same to nigga to pull over\nJump out and knock the Murray's Grease out your toupee\nWest West baby baby, don't test baby baby\n(Here I come with my handkerchief in hand)\nI got 'em packin' the spot like back in the spot\nThis West Coast shit is like crack in the pot\nCan't nobody serve it like I serve it\nGot 'em shakin' like Michael J. Fox, these niggas lookin' nervous\n\n[Hook]\nWe do what we do\nThis West Coast is voodoo on you\n(See the Lord is my shepherd\nGot me so hood, a nigga can't help it)\nWe do, what we do\nThis West Coast is voodoo on you\n(And just for the record\nI came in this world by myself and butt naked)\n\n[The Game]\nNigga it's time for the re-up\nSince everybody wanna be us, then G up\nBlaze the motherfuckin' weed up\nEverywhere we go they showin' us love\nAnd by the time we leave they throwin' up dubs\nI've been in this shit, almost got 10 in this shit\nYour favorite rapper I done been in his bitch\nWho showed you how to put gold D's on a Bentley?\nThe nigga that showed me, he from Eastside 20's\nI'm the West Coast Don, the Compton phenom\nThat drop bombs on you niggas, nothin' but dope rhymes\nI was coached by the O.G.'s, taught to stay low-key\nNow everybody know me, Mr. Fuck the Police\nUnite the Coast, bury the snitches\nAll my niggas got two strikes and they stare at your bitches\nLike what the fuck you gon' do when niggas run up on you\nWith a gun up on you and pull the trigger nigga\nWelcome to California\n\n[Hook]\nWe do what we do\nThis West Coast is voodoo on you\n(See the Lord is my shepherd\nGot me so hood, a nigga can't help it)\nWe do, what we do\nThis West Coast is voodoo on you\n(And just for the record\nI came in this world by myself and butt naked)", "image": "https://images.genius.com/d4ed6bd2c7a379500fac9a01a4457d66.300x300x1.png", "album": "Guilty by Affiliation", "title": "West Coast Voodoo"}]}