{"songs": [{"year": "1997-12-09", "album": "Eye & I", "image": "https://images.genius.com/f1579141bc34038372c5f692cd18be20.636x636x1.jpg", "title": "Make It Happen", "lyrics": "[Verse 1: Kardinal Offishall]\nYo, naughty and ready\nCome to claim the party\nKardinal and Red-1 are gon' spark the mic\nWe massive from the West to the East side of Barn(?)\nAll the weak sounds can't come it\nWe sing, Oh Lord Mr. Kardinal style nice times twice\nRed-1 on the mic device mice times two\nOriginal imperial lyrical manifestations of freshness\nBest in these politics called rap music\nAbuse it like a pedophile on coke\nEighth wonder of the world, tallest freestyle structure\nFlucuate a verb like Misfit\nWith that on my team I wouldn't risk it\nThat's the sound of my biscuit\nReady flip it\n\n[Verse 2: Red-1]\nYo, actions speak louder than words, so lets do this\nDon't know we business, don't know that we the rudest\nThe specialist yes we must progress\nGwan express manifest obtain and invest in self-interest\nAnd watch the fly multiply, Red-1 and Kardinal\nYes you must recognize, to this I testify\nBy the ways of the Samurai\nIf I fail to make it happen, then I accept to die\nCause, no progress, that is a problem\nEast vs. West, enough man are dead\nStay penniless, that not work again\nTell you what, we make it happen\nOccupied by vibes and not gun clapping\nThrough rapping, we build foundations\nWith this brings levels of realization\nIf somebody got to rule, why can't we be the ones?\nLike\n\n[Chorus: Saukrates]\nChic-blow\nDeform your structure with no problem\nYou thought you knew, but I am you times ten\nYou want some of this and brign your foundation\nSeen, come again\n\n[Verse 3: Kardinal Offishall & Red-1]\nKnock you out lilke my initials\nEvil style like Proctor-Gamble, on your life like Suge Knight\nWe check them gwan write, we a respect them\nCause, them are our enemy we are dem no friend\nWhen an MC lick hot, let them send them to the West\nMake Chemo drop beats 'til them less palm's fist\nPump this a in your Beamer\nYes we be the.. General Official\nPedophiles when it comes to the instrumentals\nCombine styles, and commence with crackin'\nConquer the world and Trump girls make it happen\nRascalz in a dis with F-O-S specialist, no stress\nWatch how we big up our chest\nI'm a hip hop trackster running\nSeen the other feet have a better chance of seeing the second coming of Christ the Lord\nHe's my light and salvation, Mr. Kardinal combine with Red-1\nAll de come down\nOriginal gun yapper, put down your water gun\nWhoever your God is, say your prayer and bye\nCause everybody a fin go, it your turn to die\nSo why why why?\nWhy must I be crucify, hey boy stop cry\nAnd identify who's on your side\nCause it ain't the Red-1 or the Kardinal\n\n[Chorus: Saukrates]\nChic-blow\nDeform your structure with no problem\nYou thought you knew, but I am you times ten\nYou want some of this and brign your foundation\nSeen, come again\n\n[Verse 4: Red-1 & Kardinal Offishall]\nAyo, right now\nRight and now, if a boy fi test, he gon get licked down\nCause, that's how we like it\nIt's absolute niceness\nThey not ???? if they you know you walk straight\nCause a man might debate, and if you really irate\nPut in your style bait fate, chosen by the devil\nWhile I reach the higher level, you steaming like a pale kettle\nSo God sickle, let the big man handle this\nUnder pressure, the situation's delicate\nReady with the steadiness of a surgeon\nWe write the version, like the goods of a virgin\nYo, all naughty walk to a pumpkin belly\nJah lead enough niggas trying to buy Pelle Pelle\nWith no food a in your belly\nCrip youth and smelly\nBut your clothes look crisp\nRed-1 the lyricist\nAnd down the Offishall, when a shoot and miss\nM-I-C twin clips is what we armed with\nI check you a master of Kung-Fu\nIf you got verbs and nerves to try to dis our crew\nYo might dis you\nIf you try to run contest with our crew\nWhile we running with the majors\nNiggas going gold off their demos\nStrength coming from your peeps, while I'm solo like a rolo\n\n[Chorus: Saukrates]\nChic-blow\nDeform your structure with no problem\nYou thought you knew, but I am you times ten\nYou want some of this and brign your foundation\nSeen, come again\nChic-blow\nDeform your structure with no problem\nYou thought you knew, but I am you times ten\nYou want some of this and brign your foundation\nSeen, come again"}], "artist": "Kardinal Offishall"}