{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/cb610cd6deeaa359ad987bf8f9dcb669.1000x1000x1.jpg", "title": "Loyalty", "year": null, "album": null, "lyrics": "Verse One:\nWhen I was five years old I realized there was a road\nAt the end I will win lots of pots of gold\nNever took a break, never made a mistake\nTook time to create cos there's money to make\nTo be a billionaire takes hard work for years\nSome nights I shedded tears while I sent up prayers\nBeen through hard times, even worked part time\nIn a? Seafood? Store sweepin floors for dimes\nI was sort of a porter takin the next man's order\nBreakin my back for? A shack for headquarters?\nAll my manpower for four bucks an hour\nTook the time, I wrote rhymes in the shower\nShoes are scoffed cos the road gets rough\nBut I'ma rock it til my pockets ain't stuffed enough\nAll the freaks wouldn't speak cos my checks was weak\nThey would turn the other cheek so I started to seek\nA way to get a play, and maybe one day\nI'll be performin up a storm for a decent pay\nNo matter how it seems I always kept the dream\nAll the girlies scream and suckas get creamed\nDreamed about it for five years straight\nFinally I got a break and cut my first plate\nThe road ain't yellow and there ain't no witches\nMy name is Kool G Rap, I'm on the road to the riches\n\nVerse Two:\nI used to stand on the block sellin cooked up rock\nMoney bustin out my sock cos I really would clock\nThey were for kind of fiends bringin jackets and jeans\nMagazines, anything, just to hustle for beans\nThe cash was comin fast, money grew like grass\nPeople hungry for the blast that don't even last\nDidn't want to be involved but the money will getcha\nGettin richer and richer, the police took my picture\nBut I still supplied, some people I knew died\nMurders and homicides for bottles of suicide\nMoney, jewelry, livin like a star\nAnd I wasn't too far from a Jaguar car\nIn a small-time casino, the town's Al Pacino\nFor all of the girls, the pretty boy Valentino\nI shot up stores and I kicked down doors\nCollecting scars from little neighborhood wars\nMany legs I broke, many necks I choked\nAnd if provoked I let the pistol smoke\nLoyal members in a crew now down with the game\nSellin nickels and dimes, sunshine or rain\nWhat I had was bad from my shoes to my pad\nIn the first time in my life loanin money to dad\nNow the table's turned and my lifestyle switches\nMy name is Kool G Rap, I'm on the road to the riches\n\nVerse Three:\n? A thug a-mugs? For drugs, he eventually bugs\nLookin for crack on carpets and rugs\n? The squealers tells? But the dealer still sells\nLittle spoiled kids inheritin oil wells\nI was the type on the opposite side\nOf smokin the pipe, in a beef I got hype\nCos rags to riches switches men to witches\nBecome stitches, body bags in ditches\nBloodshed, I painted the town red\nPeople fled as I put a dread's head to bed\nThat mean's dead, in other words deceased\nFace got erased, bullets got released\nBombs were planted, the kids were kidnapped\nIn fact that was a way to get back\nAt enemies who tried to clock G's\nOn my block, now they forever knock Z's\nPlans of rampages went for ages\nSome got knocked and locked inside cages\nSome bit the dust for crumbs and crusts\nIn God We Trust, now rots to rust\nPlus caps to cops, policeman drops\nYou blew off his top when the pistol went pop\nTroopers, soldiers, rollin like boulders\nEyes of hate and their hearts get colder\nSome young male put in jail\nHis lawyer so good his bail is on sale\nLookin at the hourglass, how long can this power last?\nLonger than my song but he already fell\nHe likes to eat hardy, party\nBe like John Gotti, and drive a Maserati\nRough in the ghetto, but in jail he's Jello\nMellow, yellow fellow, tell or hell, hello\nOne court date can turn an outlaw to an inmate\nBut just? Stay?, ship him upstate by the Great Lakes\nAnd than a-wait and wait and wait\nTil he breaks, that's all it takes\nSo he fakes to be a man, but he can't stand\nOn his own two feet because now he's in a new land\nRules are different and so is life\nWhen you think with a shank, talk with a knife\nNot my lifestyle so I made a you-turn\nMore money I earn, more money to burn\nPushin all buttons, pullin all switches\nMy name is G. Rap, I'm on the road to the riches"}]}