{"artist": "Immortal Technique", "songs": [{"title": "Bin Laden (Remix)", "lyrics": "\"I want the world to know you won't beat us, because we're the children of those who took the worst fall of slavery and brutality that ever lived, that ever existed. Our parents survived the Middle Passage. Only the strong got here, and then we lost our name, our culture, our religion, and we're still here. So you may have a momentary victory, Mr. Bush, but you don't know who we are.\"\n\n[Verse 1: Immortal Technique]\nI pledge no allegiance, fuck the President's speeches!\nWhat the industry did to 'Pac they did to Jesus\nRapin' his vocals, and then destroyin' the message\nTryin' to deport us if they can't destroy and arrest us\nGovernment front religious, but their heart is empty\nLike a televangelist preachin' out of his Bentley\nCallin' abortion murder in a medical building\nBut don't give a fuck about bombin' Iraqi children\nTalkin' like units in the fuckin' libretto\nLook at their mansions and look at your suburban ghetto\nThe gulag, the new hood where they send us to live\n'Cause they don't give a fuck about none of our kids\nThat's why Blacks and Latinos get the worst education\nWhile devils run America like Birth of a Nation\nAffirmative action ain't reverse discrimination\nThat shit is a pathetic excuse for reparations\n\n[Hook: KRS-One]\nBin Laden didn't blow up the projects\nIt was you, nigga, it was you\nBush knocked down the towers\nIt was you, nigga, it was you\nIt was you, motherfucker!\n\n[Verse 2: Immortal Technique]\nThey say that terrorism revolves around the Qur'an\nBut that is stupid, I'll show you why it's totally wrong\n'Cause if this country was invaded and crumbled\nI'd turn Harlem into a Columbian jungle\nAnd I wouldn't be fightin' for a Christian nation\nI'd be fightin' for survival from extermination\nI wouldn't fight for Fox News, them racist niggas\nI'd be fightin' for the hood, for the faceless niggas\nFor the immigrants America loves to despise\nEven though it needs them to make the economy rise\nThey feed us genetically-modified garbage\nSo I repetitively reload the cartridge\nBoston, New York, down to Atlanta\nGuerilla war in the swamps of Louisiana\nCamera panoramas of hammers couldn't rock me\nEast Coast to West Coast, you can't stop me\nAnd fuck Schwarzenegger, his pops was a Nazi\nAnd it runs in the family, so run for the Grammy's\nRun to the coon picnic and try to pick up a mammy\nBut half of y'all are faggots tryin' to pick up a tranny\nEddie Murphy-ass motherfuckers goin' commercial\nEven Interscope is gettin' pimped by Universal\nGreen Tutankhamen Lantern, I curse you and murk you\nBut the Bin Laden slush fund remix just burked you\n\n[Hook: KRS-One]\nBin Laden didn't blow up the projects\nIt was you, nigga, it was you\nBush knocked down the towers\nIt was you, nigga, it was you\nIt was you, motherfucker!", "image": "https://s3.amazonaws.com/rapgenius/1-immortal_technique-20101005.Jpg", "album": null, "year": null}]}