{"songs": [{"title": "The Sickness", "album": "Immortalized", "year": null, "lyrics": "*(Swoop G)*\n\nRight back at cha!\nUh, 3 Times!\nLet these fools know they fuckin wit... MOBB LIFE!\nYou know, B.A., Mr. Kamakazie\nKeek Da Sneak, Sneaky One\nAger Man, my boy\n3 Times\n\nVerse 1 *(Ager Man)*\n\nFirst off all\nI got no time for these bitches thats smilin all in my face\nThese niggas like bitches be fake\nFrom head to toe laced up wit hate, nigga\nI'm a playa!\nRidin, cuz fake niggas be scary liers\nRunnin tired\nGot me strapped up in a zone to open fire\nYou got killas, we got killas to play the game of cash\nToo many softies tryin to copy, but now I'm up in they ass\nSee mama raised me to be a leader, so mutha fucka follow me\nWhen the funk go down we ridin' deep\nWit a, I got you, an a you get me\nFear no man but God, so if it's on, its on\nCowards can come an get ya, but I'mma get ya later on\nI'm all bout me an mine\nFuck the snitches, fuck the bitches\nKeep an out when we ride\nCuz we on a mission for riches\nNigga feel this, laced up by realas, dealas an killas\nThat give a fuck about ya feelin's, cuz nigga its strictly business\nNigga what? Back up off me you softie\nI'm a cold piece of work like a dope fiend when\nYou bitch niggas try to cross me\n\nChorus 2x *(Keek Da Sneak)*\n\nThe Sickness of a million niggas\nEnvy the enemy\nThe remedy ??? ??? leave ya mind froze\nAn blind fold, an tied up in a truck\nThat says THREE TIMES! fa ya mind ho\nAn they find foes in a Cutlass sweet\nDestruction of East\n\nVerse 2 *(Keek Da Sneak)*\n\nK-R-A-Z-Y just fuckin' it up everytime\nIt's trip gold an shine\n(an I...) keeps my nine\nYou gettin robbed nigga\nI put that on the Mobb nigga\nSo don't be slippin\nHatin an seregatin an thought them youngstas wasn't trippin\nDo G's get to go?\nWhen the weapons hit the spot\nAn all you damn impersonators gotta pay\nGet fucked wit an A-K\nBitch you bit it\nOn the verge ???\nNo longer ready\nSee yous a poodle\nAn when you see them niggas betta up ya shit\nAn yous a ???\nJew-els an ???\nBurbons an Harleys\nReported stolen, you bitches so niggas is ridin' Charlie\nLavishly coordinated, this family tree\nParaphanalia 2 Tha M.O.B\nGot it tatted on my stomach\nThree Times! When I run it\nAn\nThat's what I'm sizzilin gettin them bucks\nAn ain't no bitch gettin free fuck\nIt's A.O.B. for the Nine-say whaaa??!!\nIn the cut\nThrow out my dezzle\nTryin' to get off the hizzle\nTil the next nigga rizzle\nWhat the fuck he talkin' bout \"pull pistols\"?\nWhat fizzle?\nYou gotta minute\nPulled him over, I shot his ass\nTwo left, so I bounced in\nWanna hit the bomb? Bitch hold ya breath\n\nChorus 2x\n\nVerse 3 *(Bart)*\n\nNigga what?\nWe come out the cuts an fuck shit up like straight mobbstas\nNiggas is dyin to die but ready to ride like Face Mobbstas\nBoy, ya feelin this gangsta paradise?\nDealin we shakin the dice an watch you end it wit yo life\nWe sold a gang a buddah\nLike ???\nYou juss a cutie, you actin like them groupies\nSo you dyin to tell a hoochie\nJuss a bootsie nigga\nI hate niggas thats down to rape niggas wit bitches\nYou steadily stackin ya chips but bumpin ya gums to all them bitches\nNigga I know you love to hate us\nBoy ya should wake up\nBefore we touch ya fuckin face up like mascara make-up\nWe stackin more chips than in casinos\nDippin' in Reno\nMad cuz we pocketed all them C-Notes\nNigga crack some cee-low\nShoot ya shottie an get forgotten\nCuz me an my peoples gon get ya peoples an gets to mobbin\n\nChorus 2x\n\n*(Swoop G)*\n\nMobb juss like a muta fuckin body blow or sumpthin\nNo hittin nigga wit this, 3 Times shit!\nYou know, can you handle it?\nCuz a mutha fucka might fold up an fumble\nOoops!\nSteppin on niggas, you know\nCrawlin on niggas, but then we steppin now\nSucka ass!!", "image": "https://images.genius.com/2417c02a0230db056bb96cdac58d5dd6.400x384x1.png"}], "artist": "3X Krazy"}