{"songs": [{"image": "https://images.genius.com/d139ded1190d7e3c5cdc6dda61c6767f.600x600x1.jpg", "title": "#1 (Wally Remix)", "album": "Da Derrty Versions - The Reinvention", "year": "2003-11-25", "lyrics": "[*scratched*]\n\"Rising to the top\"\n\"Number one\"\n\n[Intro - Nelly] {*w/ ad-libs*}\nOh let's go!\nDerrty ENT!\nNigga, we all we got, aye\nWe all we got!\nOk! Can you hear me!?...\n\n[Verse 1 - Nelly]\nThey said I was crazy, when I stop slangin the crack\nTook err'thang I had, and I put it in rap\nIf I ain't a Lunatic, then what do ya call that\nIf my pockets ain't obese, then what do ya call fat\nI wasn't born on purpose, I was unpurposely born\nI'm the result of what happens when the condom is torn\nI was sworn to secrecy, only talking when need to be\nNever saying too much, and these niggas talking repeatedly\nConceivably I rip it up mo' then I get regretted fo'\nSame biz you paying, on notes I get the credit fo'\nMore retro, than nigga before you get thrown back\nI start taking, snap shots, I ain't talking that Kodak\nStart cocking the fo's back, start making ya dome crack\nHeard you don't like me and I'm happy to know that\nFeel like I'm cheating don't it, kinda unfair in fact\nFeel like I'm playing wit two Shaq's, and two T-Mac's, dirty\n\n[Chorus 1 - Nelly]\nI - am - number one, no matter if you like it\nHere take it sit down and write it\nI - am - number one\nHey hey hey hey...\nWhat does it take to be number one\nTwo is not a winner, and three nobody remembers\nWhat does it take to be number one\nHey hey hey hey...\n\n[Verse 2 - The Posta Boy]\nYo yo, I was born number one, from the start so smart\nBefore I could walk I was attending Head Start\nThe jail niggas say I'm hard\nIf you ask 106 who I be, they gon say I'm God!\nNumber one like the first man ever touched space\nOr the dot on the dice when a nigga roll Ace (Damn!)\nWinning team legacy, I rep to the death of me\nAnd just for the record B, none of y'all can F wit me\nRise to the top like I'm brick in the pot\nI'm like Allen wit the rock, I ain't missing a shot\nWhen I'm down in the Dirty I be booted 'n sooted\nMe and Nelly got the Airs wit the chinchilla swooshes\nAnyway that's some other shit; And it's a shame\nI'm so filthy now my great grand daughter mother rich\nP to the B see, I'm ghetto and greasy!\nI'm the champ, and ain't never been a nigga defeat me\n\n[Chorus 2 - The Posta Boy]\nHarlem is! - number one\nFor my niggas in the borough, to start that dinero\nNigga Posta is! - number one\nI'ma center fold nigga, fucked up rose nigga\nWe the team baby, we - number one\nFor my niggas that down, for me always been around\nNigga Posta he's! - number one\nI don't talk it, I live it, cause I'm the first one that did it\n\n[Verse 3 - Pusha T]\nLookin for a coward - well it's not in here\nUnder the BBC, this heart be popping here\nThe game is wild, few gonna drop this year\nSome of y'all not this year, the rest of y'all getting dropped this year\nI'm hearing that the cops is (I'm hearing it) cops is here\nIn these BBC socks, I got the rocks in here\nIf the cops in here, I got my Glock in here\nIf the Glock in here, you know it's gon' get +Hot in Here+\nTouch ya soul to sue, like them heat holders do\nThe new 645, I'll have the first in June\nStart the summer off, floating wit the guts maroon\n+Ricky Schroder+ paint job, colored +Silver Spoon+\nBoys in black guts, black paint, midnight coon\nBlack gun, red beam, ready for high noon\nPusha straight like, half-past noon\n\"Hell Hath No Fury\" coming soon, bet we'll do number one\n\n[Chorus 1] + (w/ Malice ad-libs)\n\n[Verse 4 - Malice]\nIt was just '98, I was holding work\nNow I'm only worth - over a mill, hell of a growth spurt\nAnd you don't wanna talk, show money\nYou would think it was talk show money\nHoney fully understand, Malicious never down on his luck\nI'll fly you across the water, we ain't even got to fuck\nHell, we can even dap when we park\nWhatever helps you keep focus, safeguard your heart\nIcky messy mayne, we wrecklessly aim\nIt's the tale of two brothers like Frank and Jesse James\nI will - write your outro, ghost write your life\nI'm so author, I should smoke a pipe\nI disregard all subliminal gestures\nI'm the lead roller, y'all couldn't cast his extras\nI run wit it, threw it in my sleep, I'm one wit it\nAnd that's one wit a bullet, I'll be the first to pull it, uh\n\n[Chorus 1]\n\n[Outro - scratches] - [To fade]\n\"Rising to the top\"\n\"Number One\""}], "artist": "Nelly"}