{"songs": [{"lyrics": "[Intro: FBI + MC Ren]\nCatch those motherfuckers, catch them, catch them\nHey man, keep up keep up, this way, come on man, hurry up\nYou don't really think you're gonna get away, do you?\nWe haven't spotted them yet. But they're somewhere in the immediate vicinity\n\n[Verse 1: MC Ren]\nA 100 miles and runnin' -  MC Ren, I hold the gun and\nYou want me to kill a mutherfucker and it's done in\nSince I'm stereotyped to kill and destruct -\nIs one of the main reasons I don't give a fuck\nChances are usually not good\n'Cause I'm frisked with my hands on a hot hood\nAnd gettin' jacked by the you-know-who\nWhen in a black and white the capacity is two\nWe're not alone, we're three more brothers, I mean street-brothers\nNot wearing medallions, 'cause we're not stupid, mutherfuckers\nThey're out to take our heads for what we said in the past\nPoint blank, they can kiss my black ass\nI didn't stutter when I said \"Fuck Tha Police\"\n'Cause it's hard for a nigga to get peace\nNow it's broken and can't be fixed\n'Cause police and little black niggas don't mix so\nNow I'm creepin' through the fall\nRunnin' like a G, we'll see, I might have slayed y'all\nSo for now pack the gun and\nHold it in the air 'cause MC Ren has a 100 miles of runnin'\n\n[Interlude]\nIn today's news. Four fugitives are on the run\nFBI sources tell us that the four are headed\n100 miles to their home base, Compton\n\n[Break: Dr. Dre + Eazy-E]\nLend me a mutherfuckin' ear\nSo I can tell you why\n\n[Verse 2: Dr. Dre]\nRunnin' with my brothers, headed for the homebase\nWith a steady pace on the face that just reads race\nThe road ahead goes on and on\nThe shit is gettin' longer than the mutherfuckin' marathon\nRunnin' on but never runnin' out\nStayin' wired and if I get tired, I can still try out\nHitchhikin' if that's what it gotta do\nBut nobody's pickin' up a Nigga Witta Attitude\nConfused, yo but Dre's a nigga with nuthin' to lose\nOne of the few who's been accused and abused\nOf the crime of poisonin' young minds\nBut you don't know shit til you been in my shoes\nAnd Dre is back from the C-P-T\nDroppin' some shit that's D-O-P-E\nSo fuck the P-O-L-I-C-E!\nAnd any mutherfucker that disagrees\nStuck and runnin' hard, hauling ass\n'Cause I been a nigga known for havin' a notorious past\nMy mind was slick - my temper was too quick\nNow the FBI's all over my dick\n\n[Verse 3: Eazy-E]\nGot the stick and runnin' just to find the gun that started the clock\nThat's when the E jumped off the startin' block\nA 100 miles from home and, yo, it's a long stretch\nA little sprintin' mutherfucker that they won't catch\nYeah, back to Compton again\nYo, it's either that or the Federal pen\n'Cause niggas been runnin' since beginning of time\nTakin' a minute to tell you what's on my mutherfuckin' mind\nRunnin' like I just don't care\nCompton's 50 miles but, yo, I'mma get there\nArchin' my back and on a straight route\nJust like Carl Lewis I'm ballin' the fuck out\nFrom city to city I'm a menace as I pass by\nRippin' up shit just so you can remember I'm\nA straight up nigga that's done in, gunnin' and comin'\nStraight at yo ass, a 100 miles and runnin'\n\n[Interlude]\nThis one goes out to the four brothers from Compton\nYou're almost there, but the FBI has a little message for you:\nNowhere to run to, baby. Nowhere to hide\nGood luck brothers\n\n[Verse 4: MC Ren]\nRunnin' like a nigga I hate to lose\nShow me on the news but I hate to be abused\nI know it was a set-up - So now I'm gonna get up\nEven if the FBI wants me to shut up\nBut I've got 10 000 niggas strong\nThey got everybody singin' my \"Fuck Tha Police\" song\nAnd while they treat my group like dirt\nTheir whole fuckin' family is wearin' our T-shirts\nSo I'mma run 'til I can't run no more\n'Cause it's time for MC Ren to settle the score\nI got a urge to kick down doors\nAt my grave like a slave even if the Ren calls\n\n[Verse 5: Dr. Dre]\nClouds are dark and brothers are hidin'\nDick-tricklin' at the sunny mutherfucker's are ridin'\nStarted with five and, yo, one couldn't take it\nSo now there's four 'cause the fifth couldn't make it\nThe number's even - now I'm leavin'\nWe're never gettin' took by a bitch with a weave in\nHer and the troops are right behind me\nBut they're so fuckin' stupid, they'll never find me\n\n[Verse 6: Eazy-E]\nOne more mile to go through the dark streets\nRunnin' like a mutherfucker on my own two feet\nBut you know I never stumble or lag last\nI'm almost home so I better haul ass\nTearin' up everything in sight\nIt's a little crazy mutherfucker dodging the searchlight\nNow that chase, the shit, is done and\nFour mutherfuckers goin' crazy with\nA 100 miles of runnin'!\n\nStop! Stop! Stop! Stop! Surprise, niggas!", "album": "The Best Of N.W.A: The Strength Of Street Knowledge", "year": "1990-05-29", "title": "100 Miles and Runnin’", "image": "https://images.genius.com/2fe86712465fd594990ed18b9142f78e.600x600x1.jpg"}], "artist": "N.W.A"}