{"artist": "Angel Haze", "songs": [{"title": "Smile", "image": "https://images.genius.com/94752f8107601b005d0ccd537b1f7727.500x500x1.jpg", "album": "Voice - EP", "lyrics": "On February 15th\nA day immediately after another you hate\nYou told me \"smiling doesn’t get you anywhere in life.\"\nI can’t explain the way my guts turned\nThe way my thoughts burned with all of the memories\nAll of the times I felt I could be ready to die\nAnd you would look me right into my tear filled eyes and say: “Smile babe, don’t cry.”\n\nAnd all I can wonder now is what changed that for you?\nIs it the way that I loved you so roughly I tore you into pieces\nThat no longer believe in the beauty of a smile?\nWas it life and all of its choices,\nAll of its choosing that removed the smile that was like a bruise upon your beautiful face?\nOr did you let your sorrows erase you?\n\nWas it your lack of freedom?\nWas it the fact that people are idiots\nWho find gold mines inside of beautiful people like you and still don’t know how to treat them?\nHave you been sucked dry?\nPretending the smile came from inside you every time I’ve ever seen it\nThat mile long walk across the teeth that emerged from the midst of your lips when you felt it\nMy God, you were my heaven\n\nYou used to smile like the ends of your mouth could grow their own hands\nReach into the mirrors in your eyes and pull your soul out\nLike the sun was smiling back at you and the midst of your troubles\nTelling you the night you’ll only endure for a moment\nBut the light from my lips will return in the morning, I promise\n\nLike the moon lit your room with the light so perfect\nWhen we kiss you swear that heaven had birthed it\nLike there were angels in attendance that tore love from your appendage\nAnd shoved it down my throat forcing me to swallow it whole\nLike the glow from your soul became the light in your eyes\nI was so used to having guide me, having hide me from my darkness\n\nYou used to smile and it would tear me apart but you are so, so different now\nI don’t know who you are, I can’t figure you out\nBut if I retrace the steps in my mind\nI can count all the times I’ve seen you hurt\nSeen all the weight you’ve been forced to carry\nAnd maybe, in that moment I’d kneel before you\nKnees kissing the ground beneath me and ask you to place your burdens upon my shoulder\nAnd I would carry them for you for this lifetime and ten lifetimes over\nJust so the weight of your burdens wouldn’t become the pain in your smile\nJust so the thought of a smile wouldn’t keep weighing you down\nJust so you would believe that everyday of my life\nI spend 15 seconds taking a glimpse into heaven when you smile\n\nYou don’t know the beauty of it all\nI've seen the slowing of a heartbeat that is aged with its pain\nRestart and beat with a rapidity that will make infinity shamed\nI’ve seen scars heal\nMinds filled with positivity\nPeople brought together\nFriendships mended\nSoul mates found\nAnd all of this was just from a smile\n\nSo the next time I see it\nI’ll run into your arms like the wives and children\nOf the soldiers whose souls were thought to be stolen by the lives that they’ve taken\nMistakes that they’ve made\nBy the pieces of themselves they have thought they lost\nAnd you will show me the way back to myself and watch me become as new as I always do\n\nAnd maybe this love turn into one thing that birthed a thousand others that give you a reason to smile\nIt may take a while but I’ve never seen anything more beautiful than what I see when you do\nAnd I don’t believe in anything like I believe in you\nSo smile for me, even when this world tries to tear you into two\nSmile for me because, I love when you do\nI love when you do", "year": null}]}