{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": "1997-10-14", "lyrics": "[Intro: Evil Dee]\n(Yes yes y'all, yeah yeah y'all, yes to the yeah y'all, yes yes yeah y'all yeah)\nWord up, R.A., Rock on!\n(Yeah y'all, yes yes y'all, yeah y'all yes y'all, yeah yeah yes y'all)\n\n[Hook 1: R.A. the Rugged Man (Agallah)]\nWe not like you other MC's\n(Riding fake props)\nI'll be in this rap shit till my fucking heart stops\n\n[Hook 2:  R.A. the Rugged Man {Agallah}]\n(We not like you other MC's)\nRiding fake props (Evil Dee is on the mix, c'mon kick it!)\n(Acting hard but you front in front of the cops)\n\n[Verse 1: Agallah]\nKarate flick co-starring Agallah and, me and you street sparring\nYo son what about Sharon\nI'm in the mansion sipping Dom with Wong from Hong Kong\nWe smoking fucking hydro out the bong\nYou telling me Adolf the Assassinator \"you the don\"\nDon what nigga, that's that old funny shit\nYo we got the information, yo where the money kid?\nFucking up ya generation like the mob\nI'm on my job, yo Brooklyn New York street heart throb\nKnock you out till your fucking face blob\n8-Off the Assassinator, yo kid we hard\nYo smack you on some barbecue lard\nYo kid, yo niggas is hungry you god!\nYo, I know what time it is like clap and flash and shaft\nSit down with my niggas, smoke weed, watch a video and laugh\nYo, smacking bitches on the ass\nYo, anymore weed to pass?\nThat's the next question, the next suggestion\nIt's where your rhyme profession, sinking down the drain\nYo fuck his name, fuck the game\n8-Off the Assassinator shooting like the flamethrower\nYo God, split the seas like Noah, or should I say Moses\nEverything is not fucking dandelions and roses\nSupposed to fold us, niggas chose us to rock us\n8-Off the, stop us, see our dime droppers\nNiggas with the shit poppers, I'm on some high school shit\nRunning through the fucking hall ripping open niggas lockers\nSeeing if they stole my rhymes\nYo kid I'm giving niggas one more chance, one more time to enhance\nYo kid I seen a glance of a cat trying to steal my rap\nAll them niggas deserve is a smack\nAdolf the, I don't like that\nYou a baby need to feed similac, yo god, how about that?\nI seen you doubt that raw route that\nYo Adolf the, how you being to me?\nYo you need to wake up smelling the coffee\n\n[Hook 1]\n\n[Verse 2: R.A. The Rugged Man]\n'Cause we complain daily, cursed with all types of bad lucks\nIt's common sense, \"everybody's life sucks\"\nDon't you know that? I knew this, my whole life\nThe anglo-saxon, Caucasian, low life\nThe no money broke life, the subway cup holders\nStreet corners, constantly look over you shoulders\nIt's official, we dirty crusty, till death do us, or does us\nIt's a shame ain't nobody love us\nPlus understand this Rugged Man be who the man is\nI'm trying to piss on white bitches, trying to act like they Spanish\nMy two fists light you, if I fight you, I bite you\nLike Mike Tyson, we street-fighting\nThe money, pussy, plus the glamour, none of it's exciting\nI'm sick of living, I stay depressed make me wanna give in\n(Make me wanna give in, make me wanna give in, make me wanna give in)\nI'm not gonna be able to do this shit y'all\nSuffolk County that's the place we live\nExit 6-2 crazy ass Stonybrook kids\nVinnie Baretta Human Beatbox Bum, who be the sickest?\nNobody sicker, your click's thick but mine's thicker\nI rock wit ya, who iller? You outta place\nGot big balls whip the dick out, fuck you in your face\nThe beautiful, the rap leader, the lack of cash dreamer\nThe 450 lb fat bitch ass-eater\nYo ask MC Hammer if he seen her\nI need a freak like Adina, yo Agallah bring the heater\nThey biting styles like mosquita\nBut fuck them I stay creeping, which bitch wanna get they pussy eaten?\nSuper-freak hideous\nI went to school on the special ED minibus\nCan't trust us, bust us, who rugged? Us\nAdolf Agallah, R.A. the Rugged Man\n\n[Hook 1 x2]\n\n[Hook 2 x2]\n\n[Outro: Evil Dee]\nWord up, know what I'm saying, Evil Dee in your area\nIf you listening on cassette, you better turn that motherfucker over\nIf you got a CD, let that motherfucker play\n'Cause we going on to the next side", "title": "’Till My Heart Stops", "image": "https://images.genius.com/db5f1be160a3b09ca4a61618f595fe41.400x396x1.jpg"}]}