{"artist": "Planet Asia", "songs": [{"album": "The Grand Opening", "title": "It’s All Big", "image": "https://images.genius.com/cb88bb05cdeba97350da2c7dd2f127f2.500x492x1.jpg", "lyrics": "[Planet Asia]\nYeah\nIt's a heater, Planet As', J. Web (Grand Opening)\nWorldwide\nWe gon' take this one from the West, to the East\nKnock this\nTo the East, to down South\nIt's all big\nFrom the South, to overseas (put your radios up)\nYeah, c'mon\n\n[Verse One]\nKnock, knock (who's at the do'?)\nIt's P.A. baby with the Don and the Mo'\nNow honor my flow, it's fifteen years in the makin\nNow it's just sixteen beers in Jamaica\nI'm the hip-hop Barry White with Hustler tales\nCause my voice makes honies wanna touch theyselves\nJust give it to me girl, shake your booty ma\nMake a nigga wanna turn you to a movie star\nJacuzzi in the car, I'm bout to lose it y'all\nWho woulda thought your baby boy'd be a superstar?\nAnd in the hood, all my peoples know I spit it hard\nTwo-thousand-and-what?  Y'all cowards bout to get a bar\nAnd mines is gritty, spent a lot of time in the city\nMindin, my business, grindin, I'm high-saditty find me\nNow that's a military assignment\nAnd if anybody told you I ain't the hottest then they lyin!\n\n[Chorus: Planet Asia]\nThirty inch rims on the truck (it's all big)\nBottles poppin off in the club (it's all big)\nAfterparty up in your crib (it's all big)\nAnd people show you nothin but love (it's all big)\nNext day, do it again (it's all big)\nThis time, you and your friends (it's all big)\nNo need to worry ma, you know we got ends (it's all big)\nStop frontin girl, just hop in the Benz (it's all big)\n\n[Verse Two]\nVerse two, aiyyo I'm R-A-W\nE.S.T. the Acknickalous one, owwwww\nThe Greatest Man Alive!\nI'm just stayin alive, by keepin y'all sayin I'm fly\nRight, right?  (TRUE!)  Word bond man, really tho'\nI never mess with silly hoes, just chicks with brains\n\"At your local college dorms,\" we sneak past the R.A.'s\nHit your dame, fast in a flash, quick to game\nBut Young As' got bars to tie\nI'm tryin to get enough cash to buy the cars that fly\nAirplanes with the bars inside\nThirty-thousand feet high squad deep spittin bars instead\nPS2, X-Box, see my crew\nMake suckers wanna be that cool\nLookin at us like we got food but kick rocks once the heaters move\nBut back to the song - miras move, c'mon\n\n[Chorus]\n\n[verse Three]\nDamn girl!  Shake it then you go back it up\nWhen God made you he gave the whole package\nBut don't trip - I was born to work it with no practice\nNo houses, no couches, no mattress\n(Jayson you nasty!) That's what they tell me, but umm\nSomehow they always end up at the telly, and umm\nSomehow their good lookin friends start trailin\nAnd inhale what's in the other room that they're smellin\nOr trailin just because of what their homegirl was tellin\nSo, it's only right I keep it tight and take care of 'em\nAnd, you can have 'em for the rest of your life\nBut I'm just tryin to have the rest of the night\nDon't need no stress in my life\nDon't need a person askin questions to fight\nSpeak not a word ma unless it's polite, 'fore I invest in a flight\nCause all I need is affection tonight\nBut when it's over it's the exit aight?  Now let's ride\n\n[Chorus]", "year": null}]}