{"songs": [{"album": null, "image": "https://images.genius.com/e9a2d816210e8c73493287fd2de78735.1000x1000x1.jpg", "year": "2019-08-02", "title": "How You Want It?", "lyrics": "[Intro: Teyana Taylor]\nTell me what you want (Oh)\nTell me what you want (Oh)\nTell me what you want (Oh)\nTell me what you want (Oh)\nTell me what you want (Oh)\nTell me what you want\nTell me what you want from me (Hitmaka)\n\n[Verse 1: Teyana Taylor]\nYou're my MVP\nTonight I plan on fucking you to sleep\nTo, to, to put it deep\nBaby, you know I'm a different type of freak (Yeah)\nSo what you tryna do to me?\nDon't be shy, talk dirty to me\nNow take a shot of Hennessy\n\n[Chorus: Teyana Taylor]\nTell me what you want (How you want it?)\nAss up and face down with the loving\nBaby, let me know when you need it\nFour course meal, chow down when you eat it\nMake me curl my toes (Tell me)\nWhat's the quickest way to turn you on?\nI'm on it, middle of the night\nTell me what you want\n\n[Verse 2: Teyana Taylor]\nTell me what you want\nI will do it all the way\nMake you scream my name\nI, I keep it nice and tight\nBoy, relax and let me ride\nDo the things we like, oh\nTo be the one, wanna see and feel the wood\nI'm a nasty bitch so I'ma fuck it like I should\nKnow that you've been peeping I'm a savage\nAnd the pussy good so if you want it, you could have it, yeah, yeah\nClimb up on this dick, make it a habit, yeah, yeah\nFucking with a bitch that's never average, yeah, yeah\n\n[Chorus: Teyana Taylor]\nTell me what you want from me? (How you want it?)\nAss up and face down (With the loving)\nBaby, let me know (When you need it)\nFour course meal, chow down (When you eat it)\nMake me curl my toes (Tell me)\nWhat's the quickest way to turn you on?\nI'm on it, middle of the night\nTell me what you want\n\n[Verse 3: King Combs]\nYeah, tell me all the things you see in the kid\nIs it me or is it just the life that I live?\nJust tell me what it is 'cause I can make you feel (What is it?)\nHow he never did as long as you keep it real\nAnd yeah, I know I'm young, but I'm old enough\nI'ma stand in that pussy, have you folding up (Uh-huh)\nFace down, ass up, girl, you know what's up\nEat it up, beat it up, make your toes curl up\nI got no time to waste and no time to chase\nGot to move at Christian's pace (C'mon)\nHold it down when it's all at stake\nOn your curves, girl, I'm slowing my brakes\nNo guarantees I'ma make it home safe\nI'm so stuck in my ways, out of town for a couple of days\nBut when I'm back, I'll be right on my way\nAnd I got nothing to say\nNo games, girl, you know my style\nI got the recipe to make you smile, what?\n\n[Chorus: Teyana Taylor]\nTell me what you want from me? (How you want it?)\nAss up and face down (With the loving)\nBaby, let me know (When you need it)\nFour course meal, chow down (When you eat it)\nMake me curl my toes (Tell me)\nWhat's the quickest way to turn you on?\nI'm on it, middle of the night\nTell me what you want\n\n[Outro: Teyana Taylor]\nTell me what you want\nTell me what you want (Oh)\nTell me what you want (Oh)\nTell me what you want (Oh)\nTell me what you want (Oh)\nTell me what you want\nTell me what you want"}], "artist": "Teyana Taylor"}