{"songs": [{"lyrics": "Radio? Check, check\nVideo? Check, check\nThis is how the city folk and mole-people connect\nSomebody warped the message prior to passin it to the next\nNow the perforated counties making you upset\n\nHarvest all Brand-X Clark Kents to worm food\nCarbon heart buried his nozzle in fossil marker art\nPardon, cadaver had a legitimate pulse\nAnd littered volts all over the village where the skittish pigeons molt\nBastard polter gasps when the pigeon with Lazarus billy-goat whiskers\nHe roasted sea-salt in the open blisters\nBut blind anarchy slips through the cracks\nSee naked martyrs with Bubblelicious on fishing rods itching to pull it back\nWhen that organic invention incubated to hatch some comply to making fructose on paper now\nApply the details later and the clues will taper out\nUnruley mayor souse, who piggy jammy happy shooting at the bladed mouth\nBazooka Tooth zoo-keep the paper route with janky funds and favors\nCradled by twelve empty Zelda heart containers\nMan, it's freezing in this brick bitch, winter forever\nLike Punxatawny Phil found with his four furry wrists severed\nI walk face-first through the sex, drugs, and church\nWith wild things that make Maurice Sendak question his early works\nBut no hostages, no promises\nOut to clock corporate cogs and sprockets\nNot clogs, all grommets\nRunning from a rabid ring-wraith click basilisk\nSerpentine, in and out of traffic jam and murder scenes\nScrub blood of the AF1s 52 Pick-up first degrees\nSome toddlers smuggled tommy guns and crack into the nurseries\nDog, there's a fucking baby at the door asking for wallets\nAnd those ain't twin Beanie Babies inside his pockets\n2010's sonograms showed the magnum formed directly out the fetus\nEvolution for the young killer convenience\n\nRadio? Check, check\nVideo? Check, check\nThis is how the city folk and mole-people connect\nSomebody warped the message prior to passin it to the next\nNow the perforated counties making you upset\n\nMagazine? Check, check\nPaper route? Check, check\nThis is how the hermitted and busy bee connect\nSomebody's losing track and their flesh and blood's in arrest\nPolka-dotted landscapes, what did you expect\n\nNow adays, even the babies got guns\nDiaper snipers having clocktower fun\nMisplace the bottle, might catch a bad one\nHave a mid-life crisis when you're ten years young\n\nIf this Jesus piece around your neck is bigger than your pistol\nIt makes homicide okie-dokie and your god will forgive you\nJust show the saints at Heaven's gate\nYou should be on the list\nI hear he overlooks manslaughter for a tattooed crucifix\nTwisty, fishy, contradicty, wild animal ship fleet\nOff the sliding board dock of the Mr. Turtle pool mom bought\nSomewhere they laminate dry bones in cool water and ease medulla\nAfter you thumb suck and diaper change, get burped and shoot the school up\nI'd duel too, but only to exploit no-brainers\nTeenager beef passed alligator teeth and extra-curricular flagpole scrapping\nAmongst tadpoles it happens\nYellow backbone de-mechanism brought airborne shrapnel scraps to hassle captains\nBy the itchy index of an umbilically garbed fraggle baby\nFragile maybe, you think?\nChopped shopin a mislead, maladjustee trustee locked box\nHiding clips that light the sky in seconds\nLike fuel and communal hop-scotch gives them leverage\nCuddle with mortars while I mumble\nIn the immortal slang of mushmouth for the anti-led Nirvana\nI used to think I'd get hit by a bus or something Dumb and Dumber\nNow the bus is slugs plugged by the newest kiddie thug wonder\nSuffixed to kings, he rebel, wide pride dosage\nFor tomorrow the holsters are bound to outnumber the roaches\nI'm not a coach\nBut that'll even jolt the immobile\nWhen global terrorism's all the rage, your folk get smoked local\nBlock, if you need me (Yeah?)\nI had to bounce to D.C. (Yeah?)\nTo bullet-proof mom's flower garden before the war cheats me (Yeah?)\nIf I'm not back in a week tell the crew I said peace and lay low\nStrays don't vacate slow\n\nRadio? Check, check\nVideo? Check, check\nThis is how the city folk and mole-people connect\nSomebody warped the message prior to passin it to the next\nNow the perforated counties making you upset\n\nMagazine? Check, check\nNewsflash! Check, check\nThis is how the hermitted and busy bee connect\nSomebody's losing track and their flesh and blood's in arrest\nPolka-dotted landscapes, what did you expect\n\nNow adays, even the babies got guns\nDiaper snipers having clocktower fun\nMisplace the bottle, might catch a bad one\nHave a mid-life crisis when you're ten years young\n\nAboard the battleship\nGrey\nSky\nThe day\nI\nGot the phone call\nJam Master Jay died\nSo no, I'll probably never write another Daylight\nBecause the stingers tend to cling more than the portable hay-rides\nIt adds it up when a pioneer fall\nIn comparison to your ninety-nine bottle of beer wall\nThere's banana peels in your hamster wheels\nHand-cannons in your shoe box\nPlease\nMine's got Adidas\nRest in peace", "title": "Babies with Guns", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}