{"artist": "Fat Joe", "songs": [{"year": null, "album": "Jealous Ones Still Envy (J.O.S.E.)", "image": "https://images.genius.com/4a7618aab6a23480b8790a58ffad66c8.1000x1000x1.jpg", "lyrics": "[Fat Joe]\nUh-oh, uh-oh..\nLet's get it over with\nYo sound boy turn the levels up\nLet's get it over with, UH!\nTerror Squad up in this motherfucker\nWhere my real niggas at?\nMy Bronx niggas, my (?) niggas\nI see you Lil' Hat! Uh, Ahaha!\nIt's time to take it to these niggas right here\nYeah.. yo.. yo..\n\nWho wanna spaz out? Crunchtime, blow ya abs out\nLeave you in the fetal position, witcha ass out\nReady to mash out any crew actin like\nThey the true facts of life, frontin through the camera lights\nDespite, we hold it down regardless\nI got Def Jam suckin me like, \"I wish you was my artist\"\nFor starters, who's the largest cat?\nGet a hundred grand from my most garbage rap\nNow how hard is that? Everything we spit be hot\nWhether it's live on Flex or in front of the chicken spot\nGrimed out, we really live whatchu rhyme 'bout\nSee me posted up in the Tunnel, with my shines out\nIce cold like Alaska when I pass ya\nGot girls shakin, losin they breath, as if they catchin asthma\nHeaded to the bar to pop some bottles\nNow we in the car headed home to rock some models\nAll I hear in the background is Gucci and Prada\nBut I'm tryna gas these bitches to screw me for nada\nWe the best that done it, confess you fronted\nAnybody wanna test how much straps, you want it?\n\n[Hook - Fat Joe]\nAiyyo the gangsta's back\nStop it right where you at\nLet a real nigga rock real murderer rap\nTell them thug niggas, listen to that\nGotchu feelin it hard like Joe the God's really bringin it back!\n\n[Fat Joe]\nI'm from my days and legends, since age eleven\nI was the cause of dope fiends catchin AIDS infections\nMost of us are dead, but the rest is locked\nRunnin in the rec room and check me out on the box\nA CEO could get optioned tryna change the channel\nIt's like tryna take the flesh outta the mouth of hungry cannibals\nJoe the God, the flow is hard\nKnown for packin two dozen birds like Noah's Ark\nI'm the realest of 'em, make you feel the pressure\nCatch you at a club, smack you up, steal ya leather\nYou niggas soften me, beat you out of the mix\nTough talk, tough walk, but you cry like a bitch\nI see you downin the Cris', I'm not hatin, I'm just aggrevated\nI ask myself every day, how these faggots made it?\nFuck around with the Don and get decapitated\nI'm sick of hearin 'em (?) for all the cats that made it\n\n[Hook - Fat Joe]\n\n[Hook 2 - Armageddon]\nAiyyo the kid is back\nLeave it right where you at\nLet a real nigga hold that, you probably won't clap\nTell them thug niggas, move it on back\nI'm feelin tight and I'm hot\nReady to pop the crack right through your back\n\n[Armageddon]\nThat's how Kenny rocks, I'm more advanced than how your learnin\nI'm like the force of space balance and planets while they churnin\nPoppin rosary beads, piss on ya candle while it's burnin\nRush ya widows crib and pop ya baby while he's burpin\nNow I know you can feel the heat I generate\nImagine when I penetrate ya stomach, and make ya body's center bake\nWe can argue for days, whether it's faster to drop five shots\nIn ya astronaut before you cloud the stash box\nSplash ya brains on ya birds' laps\nSwerve you on the curb, crash the Range, and push the front skirt back\nAnd murk after that, blurtin curse words\nYo I popped that nigga's son one before we catch the first\nI'mma kill any murderer, leave a nigga burpin up\nBlood, chokin on chunks of his lung interior\nEvery verse that I spit's a personal riff\nI mean a ill key frontin, I'm a murder you shit\nNiggas play me while distrubin the Bricks\nI'm like the feelin of the first time they ever held a bird in they grip\nMotivator thug, scrape 'em, shoot the bolts in his butt\nEnergizin 'em up, make 'em wanna open 'em up\nActin like I can't happen till I smack him in his Adam's apple\nDeath to rappin, I don't wanna battle\nI'd rather rush your studio session and shatter the booth\nClap at ya face, give the mic feedback the goof\n\n[Hook]\n[Hook 2]", "title": "Murder Rap"}]}