{"artist": "3rd Bass", "songs": [{"lyrics": "\"And so, my fellow Americans\nAsk not.. what your country can do for you\nAsk what you can do for your country\" -] President John F. Kennedy\n\n\"And now, back to New York\"\n\n[Pete Nice]\nHeart as, hard as, Chinese arithmetic\nAvante garder, not a heretic\nFigure out a right rhyme, stick it in my cranium\nPete Nice, elemental like uranium\nThrowin joints, blowin like a cool breeze\nSwimmin in, I lift on juice, I wax MC's\nThese hoes go frontin on my Jimmy\nI smack em on the back, sit em down, say\n\"Gimme some rhythm\" (Rhythm!) Baby loosen up my collar\nI'll lay you out, like a funeral parlor\nReady willin, fillin, killin for a Billin, Top\nI never stop, with Serch and Sam drillin it\nSoul in the Hole, MC's workin\nKickin it, vickin, the suckers who be jerkin\nMe and my posse are hardcore, you want some more\nReason that I'm squeezin your girl (You never please her!)\nSo I pleased, then I threw her in the gutter\nCut her off, my wisdom wiser so I muster\nRows of all opposed, lows conquer all\nThose who pose as dope I say nope, I wear def clothes\nDapper like Dan from, three the hard one\nNever stigmatize as a rapper or I'll slap ya\nYou're stung from my tongue as you run from the drum\n(Diggy drum) Three the hard way, wordz of wizdom\n\n\"This time there was three\"\n\"One two..\" \"Three the hard way!\"\n\"This time there was three\"\n\"One two..\" \"Three the hard way!\"\n\n[MC Serch]\nA branch of the hip-hop tip grills your dome\nYou're toe ingrown low showin you ain't got nobody home\nProne to the microphone, light up, and take out\nMake out your will Bill, three is gonna break out\nThe stylee, me and P-E-T-E\nEmbark on a mission that's deadly, break out the ammo\nAiyyo Sammo, hook up the beat\nAnd I'll lay the plan OH man\nYou just got taken, I took a head out\nAttack on the back of the six of the Guinness Stout\nUsin abusin, those of the past tense\nFunning gunning, but I'm summing up the nonsense\nThree, the hard way, cards laid are OK\nGettin up and settin up, just for a payday\nThe minister, sinister (I ain't no devil!)\nNot a snake slithering scoundrel Sam level\nThis track to SMACK, the smile off a doubter\nThe brother's, another MC who's about\nFrontin like he's buntin, deceivin the delinquent\nRappers on track, bustin out a medium\nFor those opposed, who manifest a diss\nPete tell em: \"Manifest THIS!\"\nNot righteous, but might just, make you wanna listen\nYo I'm Elvis with the wordz of wizdom\n\n\"This time there was three\"\n\"One two..\" \"Three the hard way!\"\n\"This time there was three\"\n\"One two..\" \"Three the hard way!\"\n\n[Pete Nice]\nA ludicrous buddhist, Brutus when I do this\nSo true to this, perpetrators view this\nStyle, empirical, lyrical, it's critical\nThree the hard way, boy you need medical attention\nI'm like a surgeon in my left hand\nHold a microphone like a scalpel so you understand\nWordz of wisdom, woven like a spider\nBitch on my tip, I get busy and I ride her\nUptown, then I drown her like a psycho-pathic\nCause I'm graphic on the mic I never let go\nLight skinner eat dinner like a soul man\nProve with the rhyme I'm down, Sam's hands\nTransform strong (too strong) as a good pitch\nSwitch up the wizdom, it's a word which\nKicks out the Benzi in a frenzy it sends me\nUp the Bronx River back to Brooklyn apprehends me\nLike a d-tech bustin my man in the projects\nI'll send you up North, I ain't gettin' respect\nPrejudicial, your style artificial\nAs live as limb that's attached to a cripple\nIt's simple (so simple) eliminate you like Gotti\nI chill in Bed-Stuy and drive a Mazzeratti\nWith the body of a freak on my side, how am I livin?\n(How ya livin?) Larger than large, with the wordz of wizdom\n\n[MC Serch]\nHyper-selective, Serch is attracting\nFemales who focus on the future, not slacking\nRhythmic it's too quick, feel it, I let it flow\nSam Sever seas'll submerge, so let it go\nThroughout, or put out, lyrics like a d-valve\nSpeak up, a deeper meaning as I leak out\nAnd seek out, a three the hard way endeavor\nPete Nice, Serch, produced by Sam Sever\nLivin in my shoes boy, this is not Shoe Town\nA showdown for Motown, it's a new sound\nLyrics that lick, the tick off a timepiece\nFoamin at the mouth punk, you need a leash\nWhat are you sick?? I'm a slick stupid scientist\nRhymin that you can't comprehend (but you're buyin this)\nRecord I'm wreckin, my homeboys are breakin\nHopin that you're copin, no slopin, I'm not takin no shorts\nCause I'm playin the high post\nAsk any girl in the place, who's the fly most\nBrother with a cover, shootin to my cribbo\nThe tease wants a please, girl screamin ditto\nSo I did this, I needed the bed rest\nHangin with the bangin on the strength, there's no contest\nPhysically or lyrically, it's my kingdom\nStingin em and bringin em the wordz of wizdom\n\n\"This time there was three\"\n\"One two..\" \"Three the hard way!\"\n\"This time there was three\"\n\"One two..\" \"Three the hard way!\"\n\n[MC Serch]\nShammo.. hook up the def mix!\nHahahahahahaha...\nAhh, ahhahaha hahahahah tch tch tch\nHahahaha\nAhh ahahahhaha hah\n\n\"All but three of the defendants were found guilty\"\n..\n\"All but three of the defendants were found guilty\"\n\nHahahahh ahahhahhah\n\n..\n\nSee-ya! *echoes*\n\n*some singing*\n\nYo yo... that's ridiculous.. *echoes*", "image": "https://images.genius.com/ab41b3ae09cc27fdd7afaa66229d0bf5.500x500x1.jpg", "album": "The Cactus Album", "title": "Wordz of Wizdom", "year": "1989-11-14"}]}