{"artist": "360", "songs": [{"album": "Utopia", "year": "2014-06-13", "title": "It’s All About to End", "image": "https://images.genius.com/6bf8c425f59f3f687ac7d323a202fdbd.1000x1000x1.jpg", "lyrics": "[Verse 1: 360]\nReligion in society’s what I'm getting inspired from\nMy head is saying write this song, but be prepared, it might be long\nIt'll take seconds to get the type of clock or kind of watch with a timer on\nIt doesn't matter; it's still a fucking timeless song\nIs there life beyond? Or is science wrong?\nFuck what the Bible wants; I'm knowing what's right and wrong\nI’m like the God's son went ahead and died for us\nWe just need to find a cross, the same type that Christ was on\nAnd I'll get on; so only one life is lost\nI will sacrifice the lot and only want a kind response\nSo don't worship me, go and get a hearse for me\nDon't write a verse for me, just saying out the words I speak\n'Cause personally, I see they burnt Jesus to the third degree\nI got the idea, you twist what I say and bring out the worst in me\nPlus the hearse is the only time you'll dig up dirt on me\nAnd that's the end so close the motherfucking curtains, please\n\n[Hook: Daniel Johns]\nIt's all about to end; it's all about to end\nOr we could start it up again\nBut it's all about to end, all about to end\n\n[Verse 2: 360]\nYeah, it's so repetitive; you need to stop the negatives\nFrom entering our heads again, it enters in, just exit it (All about to end)\nHow long you gonna be consumed with this pathetic shit?\nHeaven won't let ‘em in ‘cause of what their sexual preference is\nI ain't perfect, I ain't sayin' I'm heaven sent\nThe first thing they need to change is that fucking judgmental shit\nHear what I'm sayin' and don't be taking offence to this\nYou obviously don't see the positivity in these messages\nThey've already had like two fucking testaments\nThey need a third one now; I wonder what the new message is\nWe believe it's like a presence with no evidence\nLooking at the sky with no real knowledge of where our heaven is\nThey're really more concerned with debt and where their credit lives\nAnd benefits, you wanna be an angel? Go and get some wings\n‘Cause humans made up angels, they made up everything\nWe made up Christmas, different religions, we made up wedding rings\nSo don't censor it, try and make some sense of it\nJesus knows you’ve got cash, can he go and spend a bit?\nAnd pay big dollars for your God to go repent your sins\nL. Ron Hubbard wants to buy some expensive shit\nIf Christ is asking you for money, that's offensive shit\nI didn't know they had any currency up where heaven is\nAnd there's a devilish smile on my devil's lips\nThe exorcist, takin' every kid and giving sense to them\n\n[Pre-Hook: Daniel Johns]\nToo many wars won, but something that needs gone\nSimply together, speaking the lie, speak of a better time\nOh, there were too many lives lost, but something we need's gone\nWe're living the lie, always together now, sing together now\n\n[Hook: Daniel Johns]\nIt's all about to end; it's all about to end\nOr we could start it up again\nBut it's all about to end, all about to end\n\n[Verse 3: 360]\nI understand if they wanted to go all make believe\nBut God didn't write the Bible, it is make believe\nThey going to hell, they caught the gay disease\nTake your ego out, 'cause every one of 'em is the same as me\nYou need a change some things, change the way your brain perceives\nHow other people live their life, whatever person they’re made to be\nI'm seeing everything that Satan’s seen\nAnd that still doesn't come close to when he faces me\nIt's getting cold so rapidly yo my brain will freeze\nPut your hands together, I don't mean clap, pray for me\nI see these motherfuckers chasin' me, chasin' me\nI'll be waiting at the end patiently, patiently\nDig deep to the soul to know a human's worth\nGod is really a metaphor for the universe\nWhy hate homosexuals? What? They're too absurd?\nWhy abuse someone's choices when they weren't there to choose them first?\nThis is too superb, which life do you prefer?\nLucifer? Why's the sky the limit when the moon was first?\nWhen your time's up, will you still believe in your faith?\nBelieve what you want, he works in mysterious ways\n\n[Pre-Hook: Daniel Johns]\nToo many wars won, but something that needs gone\nSimply together, speaking the lie, speak of a better time\nOh, there were too many lives lost, but something we need's gone\nWe're living the lie, always together now, sing together now\n\n[Hook: Daniel Johns]\nIt's all about to end; it's all about to end\nOr we could start it up again\nBut it's all about to end, all about to end"}]}