{"songs": [{"lyrics": "\"His opponent from St. Petersburg, Florida\"\n\"Two hundred thirty-one pounds, Barry Horowitz!!\"\n\n[Action Bronson]\nYeah, the Chocolatier\nBronsalinio... yeah\n\nTo the back with the hat, lean back in the 'llac\nCrack the window, hear the soldier styles and that in back\nAin't no \"Cat in the Hat,\" just a cat that can rap\nThis is Bronson - representing Flushing, Queens on the map\nYeah - heavyweight primate with a Harvard mind\nBlunts filled with the citrus mixed with orange lime\nPussy drip when the thought of Action come to mind\nBorn to ride, winter spring summer shine\nBonafide, eyes wide, run and hide\nYou don't want the revolution to be televised\nTerrorfied from the Arab mountain death camps\nWith the iron burning hot, give you chest stamps\nPhone calls with the cloth over the mouthpiece\nWith or without leaf, burn about an ounce chief\nTo the neck like a razor for the stubble\nRaised inside the struggle, blazin in the huddle yeah\nDig a hole, throw the lamb in it\nLeft the slippers in the sand motherfuckers couldn't stand in it\n\n(\"Someone took the words to my song\") {*ding ding ding*}\n\nIt's Barry Horowitz rap, I pat myself on the back\nDon't fake the funk on a nasty dunk, Shaq I attack\nClose the window to your soul, weed inside my lungs burn\nThese old suckers gettin placed into a young urn\nSpecialized like the little bus\nUse my chubby little finger first to stimulate the clitoris\nKing Kong ain't got shit on us\nI'm out here gettin it for real while you motherfuckers filibust'\nWeed in my finger flicker, I'm on a solo mission\nStarted at pole position, eyes on the long division\nAs it burn my thumb, I roll another one\nQuite persistant, that's why they call me my mother's son\nShoot the cold gift, leave your ho stiff\nMake your ho sniff Hootie and the Blowfish\nObey the coke king\nCause every motherfucker in rockin loaded, I'm on that old shit!\n\n(\"Someone took the words to my song\" - 2X)\n\n[Jim Ross]\n\"Barry Horowitz, always likes to pat himself on the back\"", "title": "Barry Horowitz", "album": "Dr. Lecter", "image": "https://images.genius.com/9b10376fe5cc5f697702488523dba2cd.580x521x1.jpg", "year": null}], "artist": "Action Bronson"}