{"songs": [{"album": "DiCaprio", "year": "2015-01-26", "title": "LeTrow", "image": "https://images.genius.com/dccbebb129ae1330d5157ffd021203ef.640x640x1.jpg", "lyrics": "[Intro: Sample]\nI'm honored to be here today. I stand before you not as an expert, but as a concerned citizen. This is the most urgent of times and the most urgent of messages. The community knows it, industry knows it, governments know it, even the United States military knows it. You can make history, or you will be vilified by it\n\n[Verse 1: J.I.D]\nWhile they were sittin' on they hands, I was standin' and plottin'\nWhen I be in my own world, It's like the world has forgotten\nMeditatin' in silence besides the loud in my pocket\nI don't want to hear nothing, a rat pissin' on cotton\nA rapper pissin' on rappers, I'm a Jekyll, I'm a jackal\nFrom rapper to rapper, you rappers PaRappa the Rapper\nShark in the lake, dodgin' the fake\nOn the line, I'm a snapper\nHeard you the best thing coming up, oh, God, I'm dyin' from laughter\nNo, I'm dyin' from living\nI been robbing and giving\nNiggas chances just to raise the fucking standards, wait\nHeard all the hoopla, faking, and all the antics\nCan't even count all the punches a nigga landed\nNationwide tour from the west side, then back to Decatur\nI ain't even signed this deal, girl, I'm just splashing this swavor\nBaby, you Betty Shabazz, you kinda match my flavor\nI'm a freak with a great mind, girl, a master debater\nHornier than the good Reverend Dr. Martin Luther\nCome here, baby, come and kiss on the king junior\nThen take a trip to the six, with me, it ain't pretty as Toronto, Canada\nGotta walk with the hammer here\nSmall things like that you couldn't fathom\nLittle forty'll knock the apple out of Adam\nLittle shorty sling weed and crack dabble\nUpgrade to full-time, where your tassle, where your bando?\nWhere the hassle when the cops jocking, blocking trying to find?\nWhere the guala and the drugs? Ollie oxen free\nHotbox topping foxy mama in a box chevy, monotonous debauchery\nObviously I've been out of it awhile\nYou should've got my things and sent for me\nEmpathy, empathize with my pathological lies\nDivide that pride and split the pot\nIt's only by God's grace that I made it this far\nThus far, I need his plus y'alls\n\n[Interlude: Leonardo DiCaprio]\nEvery week, we’re seeing new and undeniable events, evidence that accelerated climate change is here now. Droughts are intensifying, our oceans are acidifying, with methane plumes rising up from beneath the ocean floor. We are seeing extreme weather events, and the West Antarctic and Greenland ice-sheets melting at unprecedented rates, decades ahead of scientific projections\n\n[Verse 2: 6LACK]\nWaiting on shit to pan out, why you standing there with your hand out like you looking for some change?\nI mean, I could offer that, but why would I offer that when you niggas could just utilize your brain?\nI want that right there, yeah, I want that right there, yeah, give me all that there\nYeah, want that right there, so, come on 'bout that there, I need all that there\n\n[Outro: Shelly Nicole]\nWe need it all, like\nSome niggas like, how he get on, how he get on?\nHe get on because he's supposed to be\nYou gotta work for this shit\nNiggas got great time, great time, great hustle\nThis is the time, no more weak shit\nIt's not allowed like, new rules, we on some new shit\nWell, it's the same shit, but we gon' teach y'all some new rules\nCause niggas make the same shit\nThis right here, it's gon' get you right\nThis is the motivation that you need\nTake notes, take notes\nDon't copy cause you can't, but you can take some notes"}], "artist": "JID"}