{"songs": [{"title": "On Fire", "lyrics": "[Verse 1]\nOh hi goddamn, brown Trans Am, I'm on fire\nLoud as Cham', standing in the trap with these loud ass jems\nLoud ass pipes, around these loud ass rims\nGod, God, look at my garage, Maserati cars\nI can't see floors, this is no facade\nBitches go retard\nThousand pass we call that a picture in the yard\nMy paint keep falling, wet, wet shawty\n\"Shoulder Lean\" money, I'm still balling\nGot them soldiers in the tomb, pockets overload\nStack my money up and take a rocket to the moon\nAK in the freezer, ready to put my glasses in the room\nWhen I get with these hoes, first we pop it then we sue them\nThe hottest in the room, you know I won't lie\nYou know I'm sitting tall, you know I'm on fire\n\n[Chorus]\nCall me Young Dro Because I'm smoking on fire\nBall if you want, please shawty don't try\nPlayers only live once, everybody going to die\nSo whatever shawty want, you know shawty going to buy\nAye, but shawty on fa, fa, fa, on fire\nShawty on fa, fa, fa, on fire\nShawty on fa, fa, fa, on fire\nShawty on fa, fa, fa, on fire\nCall me Young Dro because I'm smoking on fire (X4)\n\n[Verse 2]\nI am Young Dro, what you telling me?\nPocket full of celery, I know how to be a player\nI am V. Delery, nigga run up on me wrong know I get a felony\nDamn fresh in the club, damn who they asking me?\nFellas be trying see my cars look like my Automart\nRovers in the crowd and I don't know how to call them up\n\nI'ma start a hundred cars, race them up, paid them up\n(Incomprehensible) grey in March, Uncle Blue in April, dimes in the stable\nGators I'ma blow them out\nTell the bitches if they don't behave I'ma throw them out\nDrop top probable, make it rain on the Doppler\nGrand Hustle king got a mafia, nigga what's popping?\nI'm a beast, soon as I hit release mode\nPop your open like the Lamborghini doors\nYoung Dro I'm the \"Best Thang Smokin\nOn fire, on fire, on fire, on fire\n\n[Chorus]\n\n[Verse 3]\nRiding down Edgecombe, I just left Zaxby's\nChickens at the restaurant, chickens in my Chevy trunk\nClassic, super straight, Dro you cannot duplicate\nNigga you ain't hustle till you sold it out the Super 8\nTraveloid, super cake, do a hundred jazz up\nSuper strong kush got them coughing like the swap meet\n(Incomprehensible)\nDro you say you spent a million on the jewelry\nWho you lying to? Try who?\nNigga I will suffocate and bust the K\nShow them how to cultivate, and buy a house with ocean state\nPlus I say I'm real with the hustle I multicate\nFirst they start biting, I require y'all muzzle they\nMouth is doubt me, eight mile high houses\nGrand Hustle king y'all know what I'm about bitch\n\n[Chorus]", "album": null, "year": null, "image": "https://images.genius.com/134a4872ea91075f919728667ab13bf3.877x877x1.jpg"}], "artist": "Young Dro"}