{"songs": [{"image": "https://images.genius.com/b3d34ea442eef932a71e2da425174dd8.600x600x1.jpg", "title": "Freestyle", "album": "Street Villans Vol. 1", "year": null, "lyrics": "[Uncle Howie/\"Kid Joe\"]\nThis is a Necro exclusive man \"Psycho+logical Street\nVillains 1 volume 1 carbon copy!\"\nNew Necro exclusive.  \"Shits dynamite bro\"\n\n[Necro]\nMy intention is to affend smear degrade and mock\nMake you feel uncomfortable like a 20 inch cock in your twat\nI'll stab any walk of life with a fork or knife\nEvery dope break I make is like a snow flake\nYou want beef you'll get a whole steak\nPolice will need dogs to locate your skull after you're raped\nAnd dumped into an old lake\nOut of a trunk I'll murder you and eat cake\nCuz nuthin happened spark a match on you and watch you cremate\nYou'll decay in NY you'll rot in New York\nAfter your dropped on your part I'll be poppin your cork\nYou like Bopper when you walk you'll be bobbin your head on the cock\nAnd the jaw blast and there from there to the crotch of the hawk\nThe mics scarred like a manic depressive that doesn't like guards\nPull my card I'll ram a spark rod in your lard\nI hate everyone thats why I'm so special\nWhen it comes to stabbin I'm a professional with a vessel\nChoppin you senselessly then your buried\nPop a Glock untill it's empty see my shockumentary involuntary\n\n[Kid Joe/ \"Uncle Howie\"]\nNew Necro exclusive \"Street Villains Volume 1\" shits dynamite brand new\n\"come on and listen to it.\"  NEW NECRO BRAND NEW\n\nI'm tappin your wifes guts revolving my life around sluts\nCarvin my knife into your bitch and see which organs are fucked\nI'm full of lust my cum shoots like fools thrust\nOut a clock bitch clean your asshole it's full of crust\nAll you bored housewives will get your breats sliced off\nYour tits suck shit fuck youll get fuck dick sucked rip your mouth off\nRip out the jaws split the skis\nIts all about the cause gettin my dick sucked with no teeth\nI'm makin women unfaithful I'm distasteful\nLeavin a faceful of cum gracefully and shes graciously grateful\nYou're desperate you'll allow yourself to be molested\nBy any direlect with testecles and a dick\nYou dont care if hes been tested or if he's infested\nYou so desperate youd have sex with asbestos\nYou'd suck Uncle Fester's testes\nYou so depressed a simple request will get you undressed\n\nPsycho+Logical Street Villains Volume 1 grab your guns\nThe first installment of your death peep it Brutality Part 1\nIn stores September you better remember\nYou'll get dismembered bitch die"}], "artist": "Necro"}