{"songs": [{"title": "How You Know", "album": "Bay Chronicles", "year": "2019-03-29", "image": "https://images.genius.com/9b70c3f92bee5b020fb86a794b814de7.1000x1000x1.png", "lyrics": "[Verse 1]\nI'm in my Audi music loud while blowing dro\nI had to tint the windows just to hide the smoke\nNo, I can't drive unless it's chrome up in the tires\nOpen the door, you think I just came out a fire\nPull up beside me, I will leave you in the dust\nI brought my own, so ain't no passing when I puff\nSay you got 50? Sorry, 50 ain't enough\nIt's Lil Debbie, so you know I'm caking up\nGo to the mall and buy it all just like before\nYou wear my size, they just sold out in every store\nMy floor is full of stretched and broken rubber bands\nMoney so new that it get sticky to my hands\nBetter sit down because you never stood a chance\nI fucking dump the world (and got time for romance?)\nBefore I land, I need my money in advance\nYeah you a fan, but please, don't step on my new Vans\n\n[Chorus]\nNow how you know, how you know?\nHow you know this pussy good, boy, how you know?\nNow how you know, how you know?\nHow you know I run the Bay, bitch, how you know?\nNow how you know, how you know?\nHow you know this pussy good, boy, how you know?\nNow how you know, how you know?\nHow you know I run the Bay, bitch, how you know?\n\n[Verse 2]\nIf the purse ain't Gucci Gang, you know it's Fendi\nIf not Ciroc that I be sipping, then it's Henny\nIf not a 'Rari, then I'm probably in a Rover\nIf not 8 grams up in my blunt, well then, I'm sober\nI'm waking up to 2 more million in the bank\nAnd I just smoked a pound, the neighbors say it stank\nI got a truck that's standing bigger than a tank\nAnd my nails gon always match the Candy paint\nShe say she on my level\nI said, \"Hoe, you wish\"\nI got that sex appeal these men cannot resist\nIf your homies happy, please don't take the risk\nI'll take your man and give him back then take his bitch\nNo, I'm not cocky but my confidence is high\nAnd If I want it, I'm gon make sure that it's mine\nAin't got no budget so I never check the tags\nJust dropped a couple bags to get a bigger bag\n\n[Chorus]\nNow how you know, how you know?\nHow you know this pussy good, boy, how you know?\nNow how you know, how you know?How you know I run the Bay, bitch, how you know?\nNow how you know, how you know?\nHow you know this pussy good, boy, how you know?\nNow how you know, how you know?How you know I run the Bay, bitch, how you know?"}], "artist": "Lil Debbie"}