{"songs": [{"album": "Paperwork: The Motion Picture", "image": "https://images.genius.com/0aedeee6f38d44bf87bbee70cb36cca3.640x640x1.jpg", "year": "2014-10-21", "title": "About My Issue", "lyrics": "[Intro: T.I.]\nSearch far and wide\nAnd I bet you'll never find a lil' nigga with a heart this size\nKeep me separate and apart from all the frauds\nThey see me get appalled, you know why?\n\n[Chorus: Victoria Monet]\nI'm about my issue, babe\nAnd you can tell by my name, yeah\nI'm about my issue, babe\nWhatever stands in my way, yeah\nOoh, la da da, da da da, la da da da da da da\nOoh, la da da, da da da, la da da da da da da\n\n[Verse 1: T.I.]\nAyy, ayy\nEvery time I take penitentiary chance all I say\nGod with me, I'ma find my way\nNigga, they ain't even fuck around nowaday\nFeds came in the house, say they found my yay\nA couple handguns and a new SK\nBag full of weed and some Grand Marnier\nBut fuck it though, I gotta keep my grandma straight\nCatch a case, getaway by the grace of God\nStandin' on the corner slangin' slabs of hard\nJust a young soldier, no camouflage\nMan, them niggas ain't tough, they're just playing hard\nI pull a fuck nigga card on GP\nBetween 'em make 11 mill and peewee\nWe spray your block, turn around, pull up, repeat\nAnd laugh 'bout it, lookin' at it on TV\nMan, I'm certified in my gangster\nHittin' on the ride like my banger\nI'm in the gated mansion, no neighbor\nNew Italian suits on my hangers\nI got Cuban links and diamond rings\nSolitaires and shiny things\nAyy, fuck how tough you tryna seem\nCome try the king, 'cause I'm about my\n\n[Chorus: Victoria Monet]\nI'm about my issue, babe\nAnd you can tell by my name, yeah\nI'm about my issue, babe\nWhatever stands in my way, yeah\nOoh, la da da, da da da, la da da da da da da\nOoh, la da da, da da da, la da da da da da da\n\n[Verse 2: T.I.]\nAyy\nHave you ever heard the point blank blast of a Mossberg?\nWhole block never mind like it's not heard\nLil' nigga keep it movin' like they not scared\nAnd out here, it's do or die\nKill or be killed, in the coupe so fly\nMan, the niggas over there tried to shoot your guy\nMan, the fully automatic .22 go by like, \"Damn\"\nAnd as fly as I am, it's hard for you to tell how high I am, huhn\nOh my, God damn, you see it don't believe it still\nAnd all I ever had was a Glock 23 and an extra mag\nPresidential weed and a extra bag\nTwo or three bad bitches on the jet to France\nWe set to land and I get to the plan how to violate your little sexy ass\nThen get in the Jag, the little Vette crash\nJust ride this till you get to splash\nYou a wild girl, go cowgirl\nKeep the noise down, you loud girl\nTurn down, don't know how girl\nNo white girl 'cause\n\n[Chorus: Victoria Monet]\nI'm about my issue, babe\nAnd you can tell by my name, yeah\nI'm about my issue, babe\nWhatever stands in my way, yeah\nOoh, la da da, da da da, la da da da da da da\nOoh, la da da, da da da, la da da da da da da\n\n[Verse 3: Nipsey Hussle]\nYuh, look\nCouldn't listen to niggas they said I dream too much\nHeart fucked up, guess I seen too much\nNumb to it now, bring a gun to it now\nWhen this shit pop, I'ma run to it now\nNiggas talk loud but they dumb to announce\nBarely got away so you tryna play it down\nWhen they kick down your door and they run through your house\nCuffs on your wrists and they cussin' you out\nIt'll make sense then, tellin' you that they got your prints then\nWhat's the reward for your risk then?\nNiggas game goofy, this just in\nTime after time, don't be needin' a light, nigga, blind lead the blind\nWhy do we ride? Grind to provide, nigga, not just to shine\nBlood in my eyes, stress on my mind, let a fly nigga fly\nNine on my side, God, I'm your child but times are so wild\nPlayin' with me, I'ma draw down and I'ma show out\nIf it gotta go down, I'm prepared to go now 'cause\n\n[Chorus: Victoria Monet]\nI'm about my issue, babe\nAnd you can tell by my name, yeah\nI'm about my issue, babe\nWhatever stands in my way, yeah\nOoh, la da da, da da da, la da da da da da da\nOoh, la da da, da da da, la da da da da da da"}], "artist": "T.I."}