{"songs": [{"year": null, "image": "https://images.genius.com/830988646a2380b0dc105fa3260156a9.700x700x1.jpg", "title": "Like a Muhfucka", "album": "Otherside of the Game", "lyrics": "[Intro]\nAha\nYeah\nIt's your man, Big Shug, man\nAll my muhfuckas, you know\nThis is what we do, man\nIt's some more, some more studio\nMuhfucking shit right now\nAha\nYo man, we break it down like shit here\nYou feel me?\nAha\nYeah, yeah\n\n[Scratches]\n\"Motherfucker\"\n\"Motherfucker\"\n\"Motherfucker\"\n\"Motherfucker\"\n\"Motherfucker\"\n\"Motherfucker\"\n\"Motherfucker\"\n\"Motherfucker\"\n\n[Verse]\nI got dough like a muhfucka, flow like a muhfucka\nOne more song for the show, like a muhfucka\nStrapped like a muhfucka, clap like a muhfucka\nShow cornballs where it's at, like a muhfucka\nNiggas like a muhfucka, bitches like a muhfucka\nFans all over the world, like a muhfucka\nRaps like a muhfucka, tracks like a muhfucka\nBeats by DJ Premier, like a muhfucka\nSlick like a muhfucka, click like a muhfucka\nSlap the fat ass of a chick, like a muhfucka\nPunch like a muhfucka, crunch like a muhfucka\nTaking all your money for lunch, like a muhfucka\nTussle like a muhfucka, muscle like a muhfucka\nSex dime chicks from Brussels, like a muhfucka\nTimbs like a muhfucka, rims like a muhfucka\nCadillac sedan or a Benz, like a muhfucka\nBill like a muhfucka, Slap like a muhfucka\nWorld Famous M.O.P., like a muhfucka\nSha like a muhfucka, Panch like a muhfucka\nNYGz to the death, like a muhfucka\nPoet like a muhfucka, know it like a muhfucka\nQueensbridge nigga for real, like a muhfucka\nFrankie like a muhfucka, Term like a muhfucka\nSingapore Kane, my man, like a muhfucka\nPan like a muhfucka, Bury like a muhfucka\nBoston nigga for life, like a muhfucka\nLike a muhfucka, like a muhfucka\nBig Shug, DJ Premier, like a muhfucka\n\n[Outro]\nYeah nigga\nIt's my muhfuckas right now\nYa mean?\nHolding it down\nBoston, my muhfuckas\nWorldwide, all my muhfukas\nAtlanta\nLA\nAll my muhfuckas, you feel me?\nBig Shug\nMidwest niggas\nDown south, dirty dirty\nMy muhfuckas\nAha\nLike a muhfucka\nI love all of y'all, like a muhfucka"}], "artist": "Big Shug"}