{"artist": "Peedi Crakk", "songs": [{"album": null, "title": "Temporary Relief (feat. Sparks)", "image": "https://s3.amazonaws.com/rapgenius/Peedi_Crakk_7.JPG.jpg", "lyrics": "(feat. Sparks)\n\n[Intro: Peedi Crakk]\nYea, uhhh\nSP, Peedi muthafuckin Crack\nCPR\n\n[Verse 1: Peedi Crakk]\nEvery time I'm in the buildin', they feelin' me all crazy\nJust made a million and spent it with yo lady\nRe-coupin, chilled and V couped it\nWhite Nikes duke swoosh shit that's how I do shit\nListen to my new shit\nIt's way betta than that dirt that yall producing nigga\nThe hood rich bent on good shit for a minute\nNaw I finished I need that GT Bent, I can see me all in it(all in it)\nCouple TV's breezin' light tinted\nSP representa\nLocal husky on the fender nigga\nYa I'm back like I live in this bitch\nI bought a gat, a couple ounces of lick\nIt's P. Crack, ain't nuttin' changed\nI'll burn a pound in this bitch\nAnd for my change, I'll bust a round in this bitch\nSP prince of prop, put my crown on my shit\nMy hand in a brick\nI'm runnin' wit the ROC and my handle is sick\nBiatch\nNigga, nigga..\n\n[Chorus: Peedi Crakk]\nCuz every time on my grind it's like gangstas fuckin' wit us (wit us)\nOk, ok and they run up and bust (up and bust.. up and bust)\nCuz every time on my grind It's like gangstas fuckin' wit us (wit us)\nNigga.. nigga\n\n[Verse 2: Peedi Crakk]\nCrakk in the kitchen, position with hot agua\nCaliente yay bubble like hot lava\nCoke problem ho.. and my revolver knows..\nAbout the size of ok coral ohhhh..\nFactious bastard mashed with the mattic\nHalf black half Hispanic you a faggot\nBlast gat, trash that, metal with the side and back at it\nJackrabbit style no condo, no one behind him\nGangstas done signed him\nShined him, refined him, thanks for the fine wine, nigga\nPeedi Crakk holla back no problem\nThem thousand stacks, have it back in an hour\nHit the block with powder, like shower to shower\nStop all that nonsense boy\nI got you sniffin' on that Johnson & Johnson crack.. holla..nigga\n\n[Chorus]\n\n[Verse 3: Sparks]\nThey say its a white man's world (white man's world)\nI'm steady shootin' at my own kind rather fuck the next man's girl\nInstead of going home to mine with a polluted mind\nI guess going nuts others saw how they get down\nPicked up on the game and left behind follow the sign\nI kept my head to the sky even when I was down like everything was fine\nKept a smile (smile nigga)\nLike the first day I was introduced to dinin'\nAnd got to sipping and thinking all sorts of shit start going through my mind\nLike State Prop. get it on until the end of time\nThe strippers and the numbers then I started thinking bout all them little bustas\nThat done crossed the motherfucka got to peeking at my burner\nSnatch my keys off the dresser ran through the door and I hopped up in the squada\nStarted creeping through the heat of the night on these jokers\nDon't I paint the perfect picture that's how the boy get down for the figures\nHolla back nigga\n\n[Chorus]", "year": null}]}