{"songs": [{"album": "Stoic", "image": "https://images.genius.com/815db944cfd1552de023107589d7e376.1000x1000x1.jpg", "year": null, "title": "Ain’t That A Bitch", "lyrics": "[Intro]\nYeah\nAw-wah-aw-wah, ugh!\nNappy Boy!\nAhahah! Yeah!\nUgh!\n\n[Hook]\nThese niggas tryin' to be black Bill Gates (Gates!)\nBut what they can't see (See!)\nIs Bill Gates tryin' to be the white version of me\nAin't that a bitch> (Ain't that a bitch? Ain't that some shit?)\nAin't that a bitch? Man, I just wanna get rich\nSo I can see my niggas live (Live) and watch them haters die slow\nI used to be in your position so you know that I know\nThat's a bitch (ain't that a bitch)\nAin't that a bitch (Ain't that some shit?)\nMan, I just wanna get rich, ain't that a bitch?\nMan, how'd you wanna get rich?\nAnd I can see my niggas live and watch them haters die slow\nI used to be in your position\nSo you know that I know that's a bitch\n\n[Verse 1]\nSmoking on this technology\nMy presence is a present, you ain't gotta acknowledge me\nDon't matter how I gotta get it, even robbery\nIt's black mask on you motherfuckers like it's Halloween\nFollow me bitch I'm all that\nYou gotta be kidding, that big dog with that small cat\nI'm the dean, I got a permanent hall pass\nSo when you see me in the hall, you better haul ass\nF-F-F-Fall back, all my watches is wrong\n3 hours late to the Grammys, you can watch me at home\nMy 808's a gracious taste like a Glock to the dome\nTen thousand dollar suit, you think I was mocking Capone\nThese people hate the truth if you don't believe in that\nThen why the paparazzi don't give a fuck where I'm eating at\nCause you know real niggas ride and wack niggas hate\nSo then you realize\n\n[Hook]\nThese niggas tryin' to be black Bill Gates\nBut what they can't see\nIs Bill Gates tryin' to be the white version of me\nAin't that a bitch (ain't that a bitch?)\nAin't that a bitch? Man, how'd you wanna get rich?\nAnd I can see my niggas live and watch them haters die slow\nI used to be in your position so you know that I know\nThat's a bitch (ain't that a bitch) ain't that a bitch\nMan how'd you wanna get rich\nAin't that a bitch? Man, how'd you wanna get rich?\nAnd I can see my niggas live and watch them haters die slow\nI used to be in your position so you know that I know\nThat's a bitch\n\n[Verse 2]\nUgh, I-I got good news and bad news\nThe bad news is that the good news is sad news\nB-B-But the good news is you finally gettin' what you wished for\nBut everybody wished they can get shit they don't do shit for\nSo what makes you so different? Is this what you deserve?\nI've been eatin', I've been eatin', I'm not ready for dessert\nTires screeching, tires screeching; man, I'm finna hit the curb\nI believe it, I've been reading, I take in the good word\nPraise the Lord, nigga; you got me!\nAll these candy yours, nigga; houses and Bugattis!\nY-Y-You doin' bad, hoe? D-D-D-Do better!\nYou tryin' to get this bread bro? Bruschetta!\nMy mindframe is boss-boss-boss, that's on everything I get on\nMake a fucking throne out of anything I sit on\nYou niggas look like toilets, I prepare to get my shit on\nYou keep pissing me off, you gon' get pissed on, yeah!\n\n[Hook]\nThese niggas tryin' to be black Bill Gates (Gates!)\nBut what they can't see (See!)\nIs Bill Gates tryin' to be the white version of me\nAin't that a bitch? (Ha, ain't that a bitch? Ain't that some shit?)\nAin't that a bitch? Man,  I just wanna get rich\nAnd I can see my niggas live (Live)\nAnd watch them haters die slow (Die slow)\nI used to be in your position so you know that I know\nThat's a bitch (Ha, ain't that a bitch? Ain't that some shit?)\nAin't that a bitch? Man, I just wanna get rich\nAin't that a bitch? (Mm-mm) Man, I just wanna get rich\nAnd I can see my niggas live, and watch them haters die slow\nI used to be in your position so you know that I know\nThat's a bitch"}], "artist": "T-Pain"}