{"artist": "Porta", "songs": [{"album": "Reset", "title": "Continuará", "image": "https://images.genius.com/0786171922516cdb77f0f7ea0149854a.953x953x1.jpg", "lyrics": "Gracias a mi familia, a mi novia, a mis amigos y a los colaboradores\nA mis fans & a mis detractores, todos me animais a continuar...\n\nEste es el fin de mi obra, para empezar otra etapa\nHoy muero, pa' resurgir, como un Fénix\nEs mi final feliz, pero no encontrareis nada más sincero\nOs lo juro, estoy 100x100 seguro\nHIP HOP puro, pa' todo el que espero!\nTraigo lo más duro, tú comete esta roca!\nFuerte como un muro, te chaparé la boca seguro\n& Te equivocas, me he vuelto más maduro\nMasoca estás en apuros, te dejo inseguro\n& A tu novia loca!\nPor mi podríamos decir\nQue la mayoría de los grandes de la escena\nDan más pena que los unders!\nQue van de valiente con los colegas de ...\nSolos nada, porque solos solo son un mierda más\nSi tuvieras la oportunidad pondrías tu culo en venta\nNo buscas triunfar, me parece normal que me mientas\nNo quieres admiración, pero mandas mensajes\nA todos tus colegas pa' que voten tu puta canción!\nRevolucionate contra mi tontaina\nPrestame atención, soy la evolución como un Final Fantasy\nEsto funciona así, te vi empezar\nTe he visto aprender & voy a esperar hasta que te caigas!\nMe llaman Porta,( shh) tu llamame señor\nLa verdad yo canto mal, pero tú rapeas peor!\n& Si, sigo sin el respeto que siempre merecí\nTodo sea por el futuro del HIP HOP aquí\nTú sigues a un rebaño que se deja llevar\nIrás contra tu voluntad, si eso te hace ser más real\nYo paso de un idealismo nazi & hoy\nMe siento orgulloso, nunca fui como vosotros, pero casi!\n& Así me levanto, con la cabeza alta & erguida\nCalidad no me falta, apartad-te, no te quiero en mi vida!\nYo soy MC, tu debes ser rapero\nTu a mi de que coño vas a darme lecciones, ¿Eh maquetero?\nSi no sabes que decir, tragate tus palabras\nEstoy como una cabra & si, todo lo que tienes es por mi\nMe sobran tablas, ya no te voy a permitir\nAsí que ten cuidado con la mierda que hablas\nPor la espalda, & en el fondo tienes miedo\nEsto ya no es un juego, & desde luego\nQue puedo dejar por el suelo tu ego\nVas a juzgar mi amor por el rap?\nEl rap solo siente amor por el que se deja los huevos\n\nYo he cambiado el rap aquí, ahora todos los Mc's\nHacen lo que yo hice porque antes tuvieron miedo, si\nDe lo que pudieran decir\nAsí que ya he hecho historia\nMe alejo de la escoria pa volver a resurgir!", "year": "2012-05-07"}]}