{"artist": "C-Murder", "songs": [{"title": "Ride on Dem Bustas", "album": "Bossalinie", "year": null, "image": "https://images.genius.com/d9d150bc0beb864e7c957a9d712378ee.230x218x1.jpg", "lyrics": "(*Helicopter propeller*)\n\n(Whisper getting louder)\nReal nigga\nReal nigga\nReal nigga\nReal nigga\n\n(C-Murder)\nReal motherfuckin nigga\n\n(C-Murder - in background)\nFrom the motherfucking Deadly Sounds\nOn to the motherfucking Beats By The motherfucking Pound\nNigga I walk with a real motherfuckin dirty gun\nWith a motherfucking round\nBitch!\n\nChorus (2x):\nReal niggas and we ride on them bustas\nWe some real niggas scream fuck them motherfuckers\n\n(C-Murder)\nI smoke weed, when my mind gone, I ain't tripping\nBullets flipping, young nigga bout that hollow tippin'\nFliping Ki's on the block, where them G's at\nGot them hoes sucking my dick till they knees crack\nDrop top 6 all black with the black tints\nI got them niggas pushing crack like a Mack 10\nA dollar short and I'm coming\nBout to have these fools running\nHundred rounds humming, bout to break em off something\nCall my cousin Rock on the Mobile phone, he at home\nMagnolia projects, straight from Clebourne\nIn the city, where the shitty niggas quick to give you\nA ticket to the morgue (nigga) after they kill you\nFuck the penn, cause if I go again, I'm a rider\nYou never catch me slipping, I got my heater right beside, uh\nRunning from the cops, cause the law, I don't trust ya\nI'm a real nigga and I ride on them bustas, I'm a\n\nChorus (2x)\n\n(Magic)\nWhat Shit!!! I sick and I'm tired of all the fakers\nNiggas be talking about they gonna keep it real\nNigga give me the strap and get in the back\nThis shits is about to get real!!! (Ch Ch Chh)\nI came here a head-buster, a dome-crusher\nThey founded out I can rap and they told me put down the strap ands\nNow I'm getting paper screaming 9th WARD\nI real in this shit, I took it in blood its tatted on my arm\nSo now when I ride I take the nine with (nine with me)\nIt don't take less than 2.5 to get me (Ha ha ha)\nI'm with C, I'm with Serv, and we smoking on some herb\nContiplating on how to get cha, cause you done struck a nerve\nWho gone ride with me (my niggas)\nWho gone die with me (my niggas)\nWho gone bust at these cowards with me\nWho gone ride with me (my niggas), I'm a\n\nChorus (2x)\n\n(Mr. Serv On)\nNow Ke'Noe religious ass lay this fire ass motherfucking track\nOughta spare ride on you motherfuckers (ride)\nBut I got a little something to take to these motherfuckers\nYou them niggas them bullet suckers (bitch ass)\nYou know them niggas that say they ain't scared to die\nBut they'll take a bullet? (Come On, You Scared)\nWell C and Magic, give me a pistol with a happy trigger\nI got ready to get home and sound some loot\nI'mma pull it, just to think\nI got this motherfucking tank by signing a contract (Hell No)\nBitch you better get your motherfucking mind right\nAsk Me how the fuck I act!\nI was riding on niggas block\nWhen you niggas was still running from the cops (bitch ass)\nI done made a little motherfucking money\nSo you think that shit gonna really make me stop\n(shit, never nigga never)\nI got a tatoo on my stomach that made me motherfucking bleed\n(Come on T.R.U.!)\nSo every drop that hit the ground nigga\nFor every round in the tank nigga you know I believe (believe)\nI done got bad on this motherfucking microphone (Hell Yeah!)\nBut if C call me nigga and take one of you niggas home\nFuck, ride nigga, ha what (Lets Roll!)\nWe some\n\nChorus (4x)\n\nFuck all them motherfucking bitch ass\nPunk ass, playa hating pussy (Fuckin Right Nigga Ya Heard Me!)\nMotherfuckers out there talking shit\nCause when I run up on you motherfuckers\nYou bound to get your motherfucking wig split (bloom, bloom)\nOl' soft ass, cheesy, funky, dirty\nOl' shoe wearing dirty motherfucking poot\nStain draws bitch ass, yellow belly motherFUCKERS, BIATCH!\n(Ride On Dem Bustaz)\nThat means you bitch\n(Screamin Fuck Dem Motherfuckers)\n3rd ward, 9th ward nigga\nNo Limit, cause I'm in it\nNigga Ke'Noe, again on the motherfucking beat-o!\nDeadly sounds nigga incognito!\nBitch!"}]}