{"artist": "Knoc-turn’al", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/knocturnal.jpg", "title": "The Way I Am (Original Version)", "year": null, "album": null, "lyrics": "[Intro: Knoc-Turn'al]\nYes\nI'm a do me\nI'm a do me\nYou gon' do you\nYou gon' do you\nI'm a do me\nI'm a do me (yes)\nYou gon' do you\nYou gon' do you\nI'm a do me\nI'm a do me\n\n[Verse 1: Knoc-Turn'al]\nI'm the most underrated rapper of all time\nSo why do you accept those that bite my rhymes?\nMe and Eminem ride for D-R-E (Dr. Dre)\nMe and X (Xzibit) was in the club bout to blast off heat\nQuik (DJ) told me to be all I can be\nNate (Dogg) is my \"Dogg\" him and Warren G\nThey recognize the Ridah in the driver's seat\nAn even 50 Cent said he'll ride for me (ah, get em)\nWe somethin' like Gangsta Rap cousins\nOn my daughter I'm a die for I let you touch em\nYou know I like livin'\nEnjoyin' myself and I ain't bullshittin'\nYou don't move me wit fat mouth and lippin'\nAnd you don't want to see me out of retirement trippin'\nI got a lot to live for\nAnd I'd be damned if I change one bit\nI like the way I am\nYou understand?\n\n[Chorus: Knoc-Turn'al]\nPut your hands up, come off them grams\nI ain't trippin' that's the way I am (the way I am)\nAnd if you see me wit heat in my hand\nYou better duck, that's the way I am (the way I am)\nI can't believe you got up in them pants\nSexy lady, go on, do that dance\nCome on over when you sick of ya man\nAnd we can chill, that's the way I am (the way I am)\n\n[Hook: Knoc-Turn'al]\nI don't know that girl, I just met her\nSippin' on sour Amoretta\nShe gon' do her thing if I let her (yes!)\nBut I'm a bounce cause her friend looks better\nI like the way she notice me\nI like the way she got herself in V.I.P\nIf she sees K-N-O-C\nShe gon' chill and wait out front for me\n\n[Verse 2: Knoc-Turn'al]\nWho do you know that rides for the Coast\nWith a new breed and style of Rap like me?\nI had the patience to study the game\nDr. Dre made two Chronics and this is Chronic III\nI make classic hits and buy classic cars\nAnd see classic hoes at classic bars\nKnoc just stepped in the spot and the \"girls all pause\"\nMagic stick , I break down walls\nGot my heat if some shit jumps off\nReally, you steppin' to me is a lost cause\nParty animal, here since a 1/4 to 10:00\nBaby face, 6'2\" wit a L.A. brim\nI got Shell-Toes on - I don't wear them Timbs\nGot hoes, got weed, and a gallon of Gin\nAin't no tellin' what I might get in\nThe first night, do it right, I'm a do it again\nCome on\n\n[Chorus: Knoc-Turn'al]\n\n[Knoc-Turn'al talking]\nYou know where we be, in the club\nCome find me, I ain't trippin'\nAir is free, so what ever you wanna do\nFor real though\nHuh, it's just the way I am\n\n[Chorus: Knoc-Turn'al]"}]}