{"songs": [{"image": "https://images.genius.com/72218595c0bb6861d2cc11041abd4c7d.1000x1000x1.jpg", "title": "WATCH ME", "album": "GOODNIGHT LOVELL", "year": "2019-02-22", "lyrics": "[Intro: The Time Traveller]\nAyo, the renegade never die\nGinseng\nWe just multiply, e'rything good\nNight Lovell\n\n[Verse 1: Night Lovell]\nAll these bitches want me 'cause I'm better than their nigga now\nAll these niggas try to fucking kill me but they don't know how\nStay out of my business, all you nosy niggas slow me down\nI don't love no bitch 'cause all these bitches on the table now\nWatch me\nTake your brain if you take it back you got me\nYou insane so we left you in the lobby\nCan't complain 'cause she suck my dick so sloppy\nShe said try to stop me, yeah\n\n[Interlude: The Time Traveller]\nDem bwoi haffi know seh we nuh tek back no talk\nDem bwoi haffi know seh a we shine the light inna dark\nDem bwoi haffi know seh we make the pitbull-dem bark\n\n[Verse 2: Night Lovell]\nTake you to the dance, you my baby for the day\nTouching on my pants, then I'll let you lead the way\nBaby, take my hand, girl, I'll take you to the bay\nYour nigga take my bands then I'll cut him in his face\nIf you try to knock me down, I'll doggystyle your baby\nI've been spending too much of this fucking money lately\nI suggest you stay inside your crib, it's for your safety\nSlide with crazy niggas and they snipe you for my safety\nI don't know your face and I can't let you in, ayy\nDon't try calling JJ, he won't let you in\nCrazy lady, I don't know you, bitch, who let you in?\nShe say that I fucked her crazy, we should text again\nYou so stupid\nSay you like my friend, bitch, do I look like Cupid?\nThis your nigga, what the fuck he really doing?\nIf you say you got a nigga, why they booing?\nLeave that boy fuming, ayy\n\n[Outro: The Time Traveller]\nAyo, Shottawa\nSome cold winter, freeza, ha\nDon't freeze up, can't get no cooler\nThem not ready fi starve people, not the broad people"}], "artist": "Night Lovell"}