{"songs": [{"title": "Bentley Coupe", "album": null, "year": "2016-10-06", "image": "https://images.genius.com/5935b23002b32468c2b0a580d38b159f.500x500x1.jpg", "lyrics": "[Intro: Gucci Mane]\nHaan?\n(Absolutely)\n\n[Verse 1: Lil Yachty & Gucci Mane]\nAnd I just nutted on Trinity (Haan?, bitch)\nBitch you not you, you a mini-me\nFuck up that fuck up in any facility (Hoo!)\nSuckin' on dick must be your main ability (Damn!)\nHatin' ass nigga, ol' fakin' ass nigga\nI'll fry you on a pan, ol' bacon ass nigga (Bow!)\nBeggin' ass nigga, lyin' on your figures\nYou don't pull triggers, nigga, you such a bitch (No! Bitch)\nYou don't pull triggers, you such a snitch (Haan? Bitch)\nNeck full of water, my diamonds glist' (Burr)\n250 cash, I might drop on that Bentley, bitch (Skrr)\nI might go cop me a Bentley coupe (Skrr, yeah)\n\n[Chorus: Lil Yachty & Gucci Mane]\nI might go cop me a Bentley coupe (Haan? Skrt)\nI might go cop me a Bentley coupe (Skrt)\nI might go cop me a Bentley coupe (Skrt)\nIt's Gucci! Let's go\nI might go cop me a- (Lil Boat, skrt-skrt-skrt)\nI might go cop me a Bentley coupe (Haan?)\nI might go cop me a Bentley coupe (It's Gucci! Burr)\nI might go cop me a Bentley coupe  (Haan?)\nI might go cop me a skrt-skrt-skrt (Go! Lil Boat!)\n\n[Verse 2: Gucci Mane & Lil Yachty]\nI might go cop me a don, don (Haan?)\nIn the hood I'm like LeBron\nIt's so much ice on my watch and my pinky\nThat haters wanna cut off my arm (Burr)\nWay too much sauce, I'm like Uzi, Uzi\nWater drippin', I'm jacuzzi, 'cuzzi (Bling)\nShe suckin' it up like a smoothie, smoothie (Haan?)\nI think I'm in love like Choosey Susie (Damn)\nHaters sayin' what they gon' do to me (What?)\nBeefin' with niggas not new to me (No!)\nWatch what you say now, Gucci don't play now\nEA my playground, I love how the K sound (Graow, graow)\nMe and Lil Yachty in Nautica (Nautica)\nPolar bear, Gucci, Antarctica (BRRR!)\n20 chains on like Mardi Gras (Bling!)\nWoke up this mornin', bought another car (Damn!)\nToo much pressure will smother yah (Hoo!)\nYou know the real niggas don't fuck with ya (No)\nWe spillin' Ace of Spades on the furniture (Haan)\nAnd I'll wet a nigga up like a water gun (Grra-grra, Wop)\nSo many Rollies, got my brother one (Brr)\nBust at your boy, get another gun (Pa-pow)\nI raised you lil' boys, you my other sons (Woo!)\nGuwop just spazzed out on another one, Wop! (Yeah)\n\n[Chorus: Lil Yachty]\nI might go cop me a Bentley coupe (Skrt-skrt)\nI might go cop me a Bentley coupe (Skrt)\nI might go cop me a Bentley coupe (Skrt-skrt)\nI might go cop me a- (Lil Boat, skrt-skrt-skrt)\nI might go cop me a Bentley coupe (Lil Boat!)\nI might go cop me a Bentley coupe (Yuh)\nI might go cop me a Bentley coupe (Yuh, yuh)\nI might go cop me a skrt-skrt-skrt (Uh! Uh!)\n\n[Verse 3: Lil Yachty]\nAyy (Lil Boat)\nNiggas be mad 'cause I'm richer\nI'll spit on your sister, I pity Marissa (Yeah)\nShe should've fucked with me back when I ain't had shit (Bitch)\nNow my money sittin' tall on giraffe shit (Hah!)\nShout out them Southside bloods in Jurassic (Brrt)\nAsk how I'm doin', bitch nigga, I'm fantastic (I'm Gucci)\nJust got a new bitch, she like doin' gymnastics (Yeah)\nI wrap up that sack with a string of elastic (Yeah, yeah, Lil Boat!)\nYeah, I might go cop me a Bentley coupe (Skrrt!)\nI might go cop me some spinners too (Skrt-skrt-skrt)\nThese hatin' ass rappin' ass niggas be mad\nThey mad 'cause niggas is no longer into you (Time's up)\nDamn, your money short like an interlude (Lil' money!)\nAin't no tellin' what I'm finna do (Lil Boat!)\nGot a crew with amenities, touch me, they strokin' me (Okay)\nThey look at Boat like he the holy trinity (Uh!)\nBut I encourage philanthropy (Yeah)\nYeah and I ball when I rap like I'm Master P (Swish)\nIf one more old ass nigga say somethin' 'bout 2Pac or Biggie\n(Yeah, yeah)\nI might lose my sanity\nLil Boat! (Bitch!)\n\n[Outro: Lil Yachty]\nNah, for real, man, I don't know nothin' about that shit, man\nStop askin' me 'bout that shit, ain't gon' tell y'all too many times\nMan, I'm young and I'm rich\nYou prolly mad 'cause your kids keep playin' me\nThey not gon' stop playin' me\nIt's Lil Boat, bitch\nSuck my dick"}], "artist": "Lil Yachty"}