{"artist": "Will Smith", "songs": [{"year": "1997-12-01", "lyrics": "[Will Smith]\nIntro, the maestro, nice flow\nHot like nitro.. cool as ice though\nThat type of dichotomy, y'all know it's gotta be\nWho else could it be BUT me?\nRub your eyes, behold the Big Williest\nDream supreme beam straight from Philly it's the\nEclectic female attractor\nRapper slash actor, right back at ya\nAnd to the next millenium many come but few are chosen\nSee me servin like the U.S. Open\nAnother type of hustler listed at Blockbuster\n.. go and ask a movie usher\nWho is he? He or she - SFP\nMovies, CD's, and TV's, but uh-uh\nCause today I take a break from that\nAs I roll where a tank of gas'll take me at\nI used to rock these red Iroc Z's\nNow I rock the MB's with the twelves and V's\nToday, sun high.. up in the sky\nFrom N.Y. la la to M.I., just cruisin\n\n[Tichina Arnold]\nWhere, baby, I don't care (just cruisin)\nAs long as you take me there (just cruisin)\nSomewhere to clear my mind (just cruisin)\nJust cruisin\n\n[Will Smith]\nZero to sixty, flossin - 90 degrees\nSony cartridges, ten CD's each\nReach to the beach, Southside leanin\nIt ain't often I'm off and I'm feenin for the -\n- top down, drop down got me hot now\nHeated up can't stop now\nWhat up cutie wop? Sure sure is cookin yo\nI know I'm spoken for, can't hurt lookin though\nPop CD's, B-I-G's, then 2Pac's\nWhile cruisin the blocks, hittin the hot spots\nGot my celly on O-F-F\nGolden Arches got my belly goin oh yes yes\nSo let's just - ease on down ease on down the road\nNo pager roll my hip as I'm rollin my whip\nCause today I'm on the solo creep\nMan, why you think I be workin so hard all week?\nI'm just cruisin\n\n[Tichina Arnold]\nWhere, baby, I don't care (just cruisin)\nAs long as you take me there (just cruisin)\nSomewhere to clear my mind (just cruisin)\nJust cruisin (I'm just cruisin)\nWhere, baby, I don't care (just cruisin)\nAs long as you take me there (just cruisin)\nSomewhere to clear my mind (just cruisin)\nJust cruisin\n\n[Will Smith]\nSun settin in the S-K-Y\nMust say I've had the best day I'm..\nTryin to find a exit, a place to chill\nNot too hectic, so I can spend some time with Will\nLet the, sunshine to the moonlight clear my mind\nSoul search, see what I find\nIf I'm bein the best lover and friend\nAm I being the best daddy I can?\nI pray I am, and I feel good today\nReminisce as I'm cruisin around the way\nRoll tight past the park where I used to play\nCan't think of a better way to spend my day\nUh, still findin my way, still growin\nPetrol blowin, moon soon showin\nGots to get goin, losin the light\nAnd \"The Freaks Come Out at Night,\" right\nJust cruisin\n\n[Tichina Arnold]\nWhere, baby, I don't care (just cruisin)\nAs long as you take me there (just cruisin)\nSomewhere to clear my mind (just cruisin)\nJust cruisin (I'm just cruisin)\nWhere, baby, I don't care (just cruisin)\nAs long as you take me there (just cruisin)\nSomewhere to clear my mind (just cruisin)\nJust cruisin", "image": "https://images.rapgenius.com/e2b8f3e1aed93e4c5d7bf94dcda87c4d.500x500x1.jpg", "album": "Men in Black - The Album ", "title": "Just Cruisin’"}]}