{"artist": "Wiley", "songs": [{"year": "2014-11-03", "lyrics": "[Verse 1: Wiley]\nI go back to my old estate\nShow love to the whole estate\nI roll out on my roller skates\nThe last 18 months, all the shows were great\nI've got a talent, I will never let it go to waste\nI rep the whole of London, I know the place\nLay low, I don't really wanna hold a case\nWhen you're top flight, everybody knows your face\nWell, I'm Wiley, can't pie me\nI'm a weirdo, but label me grimy, please\nFrom '07, '08 times\nI was in a Prestige black B\nHad a spaceship key, now my basic P\nIs a fee that I never saw coming like a bee\nI'm buzzing on the tree, smoke weed till my lungs say no\nCouple hours go by, then I'm crushing up more weed\nPFC, Sam's and Morley's\nAnd a red pea soup if I ever feel poorly\nJunior's and Casablanca\nMan came from nothing to a cash money banker\nNo prank and I'm calling direct\nBBK is the team that I rep\nAnd I've got my money where my mouth is\nI keep talking, no two ways about it\nI'm about it, I've got a work ethic\nDon't worry 'bout radio, I'm working it\nThis ain't normal chicken, there's jerk in it\nYou can find a diamond if you search for it\nI work with it, Miley Cyrus twerks with it\nPut me in a song and I'm murking it\nCame from the dirt with it\nWhen I'm in the club, I circle it\nI'm first with it\n\n[Hook: Wiley]\nThis is my bloodtype, bloodtype\nKnow people who are angry, people who are calm but that's what my blood's like\nThis is my bloodtype, bloodtype\nKnow people who are angry, people who are calm but that's what my blood's like\nThis is my bloodtype, this is my bloodtype\nThis is my bloodtype, yeah, this is my bloodtype\nThis is my bloodtype, this is my bloodtype\nKnow people who are angry, people who are calm but that's what my blood's like\n\n[Verse 2: Wrigz]\nI'm listening, G, but the question is will I believe\nUntil I've been around these niggas to see?\nSometimes you can tell, don't listen to me\nAnd so far I pretty much did it for free\nRealest, listen to the speeches\nBeen like this from I didn't listen to my teachers\nLook, I ain't in awe and the industry's\nFull of non-believers, cheaters and leeches\nFrom a city where they drool over heaters\nIt's hard to explain what the rule of the street is\nYou've just gotta know, you apply for a job\nWas expecting a yes, he just got a no\nPhoned up his bredrin, just got an O\nFor seventeen eighths 'cause he doesn't even smoke\nGot one already but he must get a phone\nLikkle £20 ting and he's good for the road\nSorry, gotta say no today\nGotta think of my hoes today\nYou're never gonna make no mistakes\nSo let yourself go\nMoney works for me, I've got dough to pay\nI'm wavy, she knows the way\nBut no one could own me, sit wondering lonely\nTheat she hope I'll change\nMind for the fast on the motorway\nWhy are we cautious? No one's safe\nHow we gonna do this? There's loads of ways\nBut there ain't any that ain't involving pain\nDon't stop till the problem solved or changed\nDo you do it for the fame or the culture's sake?\nWhat's your bloodtype?\nDo you do it for the fame or the culture's sake?\n\n[Hook: Wiley]\nThis is my bloodtype, bloodtype\nKnow people who are angry, people who are calm but that's what my blood's like\nThis is my bloodtype, bloodtype\nKnow people who are angry, people who are calm but that's what my blood's like\nThis is my bloodtype, this is my bloodtype\nThis is my bloodtype, yeah, this is my bloodtype\nThis is my bloodtype, this is my bloodtype\nKnow people who are angry, people who are calm but that's what my blood's like", "image": "https://images.genius.com/cd54c7751f119aa53e2eb8065e120645.1000x1000x1.jpg", "album": "Snakes & Ladders", "title": "Bloodtype"}]}