{"artist": "Pusha T", "songs": [{"album": "Fear of God II: Let Us Pray [EP]", "title": "Trouble on My Mind", "image": "https://images.rapgenius.com/fa68ae24a681c789a7b086135792b451.475x392x1.jpg", "lyrics": "[Verse 1: Pusha T]\nIt's the blackout, 'Rari got the back out\nShowing my black ass, engine in the glass house\nStarted in the crack house, Obama went the back route\nKill bin Laden, 'nother four up in the black house\nStill got the Macs out, pull the mask down like a mascot\nStill trick with bitches, out with money or with ass shots\nGOOD had room for one more, I took the last spot\nRe-Up Gang, P the nigga, 'Ye done hit the jackpot\nWhole 'nother level, then you add fame\nThat's a whole 'nother devil, legit drug dealer\nThat's a whole 'nother bezel, the carbon Audemar\nThat's a whole 'nother metal, but still keep it ghetto\nBehind the scenes, pull strings like Gepetto\nThe gun blow steam, whistle like a tea kettle\nRunnin' like the rebels, UNLV\nSport shoe on a pedal, I let you niggas settle (yeugh!)\n\n[Hook: Pusha T]\nTrouble on my mind\nI got trouble on my mind\nTrouble on my mind\nSo much trouble on my mind\nTrouble on my mind\nI got trouble on my mind\nTrouble on my mind\nSo much trouble on my mind\n\n[Verse 2: Tyler, The Creator]\nPharrell said \"get 'em\", so I got 'em\nTripped on Bristol Palin then I accidentally shot 'em\nThen it ricocheted and killed the game, I'm a problem\n'Cause I wanna fuck the world but not a fan of using condoms\nPardon my French, I'm going hard as my dick\nWhen I envision my tip on the crust of bitch lips\nMr. Lipschitz has been trippin'\nSince I mentioned Reptar triceratops dinosaur dick\nI feel it in my gut to kill these muthafucks\nIs a must, like the arm of my pits\nYou niggas coming shorter than a Bushwick Billy costume\nOn sale during Christmas in Philly\nUm, well, not really, it's getting kinda chilly\nLet's hit a couple bars and give some bitches wet willies\nSoaked, getting jiggy with it in Bel-Air's richest\nWith a bag of pills, couple berries and a biscuit\n\n[Hook: Pusha T]\nTrouble on my mind\nI got trouble on my mind\nTrouble on my mind\nSo much trouble on my mind\n\n[Verse 3: Tyler, The Creator]\nI'm a fucking walking paradox\nAnd a really shitty rapper in my favorite pair of socks\nIroned pair of dockers, two Glocks cocked screamin', \"West side!\"\nWith the speakers blastin' a pair of Pacs\nYonkers 10 milli, you're silly\nThinkin' that this 'preme wasn't free, willy\nThe feeling is neutral, the gang is youthful\nAnd fuckin' tighter than Chad Hugo's pupils, it's Wolf Gang and the\n\n[Verse 4: Pusha T]\nWith the Re-Up's a helluva buzz\nRick James said cocaine's a helluva drug\nWho else could put the hipsters with felons and thugs\nAnd paint a perfect picture of what sellin' it does?\nThis is for the critics, who doubted the chemistry\nTwo different worlds, same symmetry\nAnd this black art, see the wizardry when you at the top\nOf your game, you make enemies, you'll never finish me\n\n[Hook: Pusha T]\nTrouble on my mind\nI got trouble on my mind\nTrouble on my mind\nSo much trouble on my mind", "year": "2011-11-08"}]}