{"songs": [{"title": "I’ll Be Around", "image": "https://images.genius.com/da56947cb42116f7c3b9f723d7df591a.470x470x1.jpg", "lyrics": "[Hook] [Phonte]:\nThe sun still shines and the birds still chirping\nBills all paid, baby everything working\nAnything you need to see that I'm holding you down\n\n[Verse One] [Phonte]:\nHey Ms. Thanga Thang\nWhat's happening?\nI've been all around world and forth and back again\nAnd for you pretty ladies, normally I sing a song\nBut every now and then I like to do my rapper thang\nIt seems like lately you don't like the way I'm travelling\nAnd all that's going through your mind is that it ain't the same\nAnd even though I got you chilling where you wanna be\nRight there, still you're having Nightmares like Dana Dane\nWell consider this\nIt seems relationships today can be so hit or miss\nI mean, wouldn't you say the same?\nCause even when I come home to be your Clark Kent\nAll you do is talk shit about them times I'm Superman\nSo whenever you get cabin\nFever just imagine\nYourself back in the club with them Orangutans\nI mean them monkey ass niggas just hanging around\nMaybe then you can appreciate my swanger thangs\nYes sir\n\n[Hook] [Phonte]:\nThe sun still shines and the birds still chirping\nBills all paid, baby everything working\nAnything you need to see that I'm holding you down (holding you down)\nThe music might stop but the party's not over\nYou my lucky star I'm your four leaf clover\nBaby anytime you need me, you know I'll be around (I'll be around)\n\n[Phonte talking]:\nLadies, I want yo to get a manicure to this one. If you're feeling really good, I want you to, huh, exfoliate to this one. Haha, yes I do. And if you feeling real nice I want you to get a pedicure to this one. All my fellas, huh, let's go\n\n[Verse Two] [Brother Ali]:\nI know them lonely\nNights get old and that bed get mighty cold\nAnd the, weight of this family just be resting on your shoulder\nYou're a, Native New Yorker\nFreezing to death in Minnesota for a man who almost always on the road\nWoman such as you, she may wonder what to do\nI know that possibility seem ugly but it's true\nNow he's got his career but it's me that's sitting here\nAnd you just might miss that something special that just for you\nWell, my heart long for you when I'm gone from you\nJust cause I'm not all up\nUnder you don't mean I don't love you\nTo the contrariety I've been on every continent\nTrying to spit and get it right and get a house for you\nThat's why I'm globe trotting so often\nI'm trying to put that glowing dot up in your horizon\nGo to school, I pay tuition, new shoes, I gave the children\nWith a little\nSmidgen left so we can go shopping\nBut if I'm so honest\nAll that paper\nDon't mean nothing\nWhen comparing to your loving and the care you give your\nHusband\nWish I could lay up on your chest and hear your heartbeat\nWhispering our name together as we fall asleep\nThe crowd cheering as I close the show\nIf they only know you only let me go cause you adore me so\nAnd understand that I'm a natural man\nGot to be who and what I am\nGirl let me stand next to you\n\n[Hook] [Phonte]:\nThe sun still shines and the birds still chirping\nBills all paid, baby everything working\nAnything you need to see that I'm holding you down (holding you down)\nThe music might stop but the party's not over\nYou my lucky star I'm your four leaf clover\nBaby anytime you need me, you know I'll be around (I'll be around)", "year": "2012-02-15", "album": "The Bite Marked Heart"}], "artist": "Brother Ali"}