{"artist": "Ice Cube", "songs": [{"title": "2 N the Morning", "lyrics": "\"Yeah this is a story of a famous dog\nOf a dog that chases it's tail, will be dizzy\"\n\n[Ice Cube]\nMet her snake ass at a barbecue bash\nShe had a lot of ass and a twenty dollar stash\n.. of some of that superb 'erb\nShe said, \"I got the chronic, so fuck whatcha heard\"\n\"Ice Cube do you wanna hit this?\nThis shit is hype, sho' you right\"\nSoon as she passed me the J and a lighter\nMe and this hoodrat bitch got tighter\nTalkin all day on the blanket (so whassup?)\nWith her ass jacked up, beggin me to spank it\nLookin like a host from the Barbary coast\nNigga don't wanna get burnt like toast\nWhassup wit deez nuts in ya me-outh\nAight everybody.. c'mon we out\nTook her to the six dollar hole in the wall\nAnd I like how she's holdin the balls\nGobble gobble, from the incision\nStuff that bitch and it ain't Thanksgiving\nDidn't even have to fuck all night long\nTake me home, damn it's on\nJumped out the cover, snatched off the rubber\nMet the ho's mother - yo whassup?\nGot the seven digits and I'm gone'n\nThat's the kinda bitch you can call at 2 n the morning\n\n[Hook: Ice Cube]\nNot just knee deep, she was O.G. deep\nWhen she did the freak with me\nNot just knee deep, she was O.G. deep\nWhen she did the freak with me\n\n\"Yeah this is a story of a famous dog\nOf a dog that chases it's tail, will be dizzy\"\n\n[Ice Cube]\nI bumped this ho on the danceflo'\nWhere you wanna go? She said, \"I don't know\"\nI thought I had a treat in the passenger seat\nNow her ass wanna get somethin to eat\nFrom where? She said, \"Denny's I figure\"\nI said, \"Hell no cause they don't like niggas\"\nLet's go to my house and order Domino's\nAnd maybe I can get the bitch out her clothes\nGot to the panties, her ass started fightin\nAnd I'm thinkin bout my dog Mike Tyson\nTook her ass home, all alone (ring ring)\nWhoa-oh, there go the phone\nAy whatcha doin? \"Nuthin\"\nThen what about screwin?\nNow I'm fuckin and I'm yawnin (*YAWN*) yup\nBut thank God for the bitch\nThat'll come/cum at 2 n the morning\n\n[Hook]\n\n[Ice Cube]\nYou the kind of girl to eat a dick up raw\nAnd drink a 40 through a straw\nAnd I love ya, cause you're down to get dug\nAnd your man don't know you're gettin fucked by a thug\nYou a woman that's true (that's right)\nDoin what the fuck you wanna do\nAnd it's cool, cause you got a purse full of rubbers\nAnd I'm a friend of your brother's (yup)\nSo jump your freaky ass in your Hyundai\nI got a room at the Omni\nNothin tricky, no you ain't picky\nWhassup Nikki? Down for a quickie\nGet your lil' dickie and your Mickey and you're straight\nAnd gotta be at work by 8\nCalled you last night, you wasn't home and\nDamn - it's half past 2 n the morning\n\n[Hook]\n\n\"Yeah this is a story of a famous dog\nOf a dog that chases it's tail, will be dizzy\"\n\n[Girl] Hello?\n[Cube] Yo whassup this Cube, whatchu doin?\n[Girl] I'm asleep\n[Cube] Asleep? Get yer ass up and come over here\n[Girl] Want me to drive way over there?\n[Cube] Yeah, come on through and shit, y'know, it's about 2\n[Girl] Alright, here I come..", "image": "https://images.genius.com/bd986178756b67188db2d06a77696b78.1000x1000x1.jpg", "album": "Bootlegs & B-Sides", "year": "1994-11-22"}]}