{"artist": "Pink Guy", "songs": [{"album": "PINK GUY", "title": "Dick Pays Rent", "image": "https://images.genius.com/930f3f0dd5bb07a703c94897874ec1db.900x900x1.jpg", "lyrics": "[Intro]\nI let the beat drop like old people with polio\n(That's actually really fucked up)\n\n[Hook: Santa's Brother]\nBitches can't handle my shit\nThey get really excited when they see my dick\nMy dick pays rent and my dick pays quick\nSo I got a little story that'll rattle your tits\n\n[Verse 1: Santa's Brother]\nWhy wasn't the chicken able to cross the road?\nBecause it was disabled\nThe doctors say I have a disease\nBut I find that really fucking hard to believe\nI hang dogs from trees so I can raise the ROOF\nI turned around way too fast and knocked things off the shelf with my dick\nNow it's really red and blue like Lilo and Stitch\nNow it's really starting to itch (hepatitis)\nThis beat drops like my balls at the age of 12\nMy nipples shrivels up like a dehydrated elf\nI shot an old man in the kneecaps\nI shot an old man in the kneecaps\nThey call me moose knuckles\nBecause when I sit down, you can see my balls stick out like moose knuckles\nI get diseases from the great sex\nI'm coughing up blood, so I'm gonna pass the mic\n\n[Hook: Pink Guy]\nBitches can't handle my shit\nThey get really excited when they see my dick\nMy dick pays rent and my dick pays quick\nSo I got a little story that'll rattle your tits\n\n[Verse 2: Pink Guy]\nThey call me Mr. Fancy Pants with these nasty rants\nThey wanna get a little Mr. Magic Man\nThey want a little fire from the land Japan\nSo I give a little hell for these faggots, man\nI shake things up like Parkinson's\nOn these faggots with cars and rims\nCuz we're having a blast\nLike Kim Jong on his last lung bombing America son, yeah\nYou can't kill me 'cuz Chin Chin is my lord\nFuck that, I ain't about the peace\nI'm really all about that vaginal crease\nCuz I'm done with you assholes\nYou fail hard like you're missin' a class, tho\nMotherfucker, I will kill you\nMotherfucker, I will kill you\n\n[Outro: Santa's Brother & Pink Guy]\nWell, that was pretty mean\n(Yeah, well, you're pretty fucking disgusting)", "year": "2013-07-05"}]}