{"artist": "E-40", "songs": [{"title": "Borrow Yo’ Broad", "image": "https://images.genius.com/841113c618ea11b5cbd44a43565e925e.788x768x1.jpg", "album": "Charlie Hustle: The Blueprint of a Self-Made Millionaire", "year": "1999-11-09", "lyrics": "[Intro: E-40]\nBeeyatch!\nIt's a fool cause I'm in Texas-Arkana right?\nI seen baby girl, she say, look ah uh you know what I say to myself\nI say, she look like Baby Dattaway! (Dattaway!)\nYou smell that? I say look here\nI been lookin for you in the broad daylight with a flashlight baby\nWhere you been? (Where you been?)\nYeah, like my nigga Pimpin' Ken\n\n[Hook: E-40]\nWhat we really need to do is put that ho on the track man\n(any batch, superbad, any batch, smell that?)\nWhat we really need to do is put that ho on the track man\n(any batch, superbad, any batch, smell that?)\nWell let me borrow yo' broad (let me borrow yo' broad)\nLet me borrow yo' batch (let me borrow yo' batch)\nLet me borrow yo' bootch (let me borrow yo' bootch)\nLet me borrow that ho! (let me borrow that ho!)\n\n[E-40]\nI hear fetti (petty) callin (callin)\nCallin (callin) yeah the bitch subject again\nBroke and reckless eyeballin, fuckin around with Charlie Hustle main\nIt's in my spine (it's in my spine)\nAnd what's deeply and hella obvious that what the broad think\nIs her business, must be mine\nI put the tick in the time, I thought you knew (I thought you knew)\nRetire (retire) - tsh, BEEYATCH (BEEYTACH!)\nThrough with it before most of these square dancers\nEven had any kind of idea what to with it, get tired (get tired)\nHe ain't gon' bust a girl, that ain't you toughest (that ain't you toughest)\nDude I cain't play a fool, potnah I'm a solid nigga dig this (dig that)\nSuspension (suspension)\nBitch got to pay me ho, or pay me no attention!\n\n[Hook]\n\n[B-Legit]\nPay attention, this one with extension, big boots with the gloves\nSeems she's lookin for love\nSpent a dub at the bar with her, see I promised not to hit her\nLong as I can get her\nTo the floor fashion show, short skirt and high heels\nSo the ass can show, satisfaction\nAction make her ask for mo', gettin dough\nDon't need no ho that's po', you know?\nYou'd rather blow fo' with the snowbunny, well I ain't mad\nCause the ho money mo' money, sweet as snow money\nBring it to a pimp so he maintain wealth\nForty G's on the yacht, I got cock for sale\nMight bail to Miami, nine hoes deep\nRed Bull and my bad hoes get no sleep\nGators on my feet, I talk shit you know\nOn how everything here is a ho\n\n[Hook]\n\n[E-40]\nBeeyatch!\n\n[Outro]\nSmell, smell, Char-lie\nSmell, smell, smell me\nSmell, smell, the cheezie\nSmell, smell, smell away\nYou can't make a tramp a champ even if you put her on a stamp\nThat bitch still wouldn't be worth a cryin dime\nA blue nickel, or a screamin quarter\n40-Water put it in order\nBitch it's about CB&H and I ain't talkin about pure cane sugar\nI'm talkin about cock a butt and HEAD\nCock, butt, and head\nCock, butt, and head\nCock, butt, and head\nCock, butt, and head\n(Beeyatch!)\n\n[Roger Troutman voice]\nWhat you need to do is put that ho on the track baby\nRight now, or let me borrow that broad\nLet me borrow that batch\nLet me borrow that bootch\nLet me borrow that ho"}]}