{"artist": "Problem", "songs": [{"album": "Hotels 2: The Master Suite", "title": "Best Pussy", "image": "https://images.genius.com/0c42d3d823c193fb1fd92a546ec12ef6.600x600x1.jpg", "lyrics": "[Problem]\nCrazy bitches got the best pussy x12\n\n[Woman]\nI can't stand your black ass!\nYou act like a little boy instead of a grown ass man\nI hate you!\n\n[Man]\nWell you know what? (Yeah)\nI hate your ass too\nDo something!\n\n[Verse 1: Problem]\nCrazy bitches got the best pussy\n\nI should've known when I met her mama\nShe on her 3rd stepfather, so she looking for a daddy\nThat's why she call every nigga she with daddy\nIf we ain't fighting she don't feel happy\nShe wanna fuck, fight, fuck, fight, fuck in that order\nEverytime i try to stop i'm back fucking back on her\nLast time we got into it she pushed me down the steps\nTry to leave she ran up on me damn near hit her with a left\nI’m like, bitch, you need to chill out\n\n[Hook]\nCrazy bitches got the best pussy (They do)\nCrazy bitches got the best pussy (I ain't gon’ lie)\nCrazy bitches got the best pussy (They do)\nCrazy bitches got the best pussy\nCrazy bitches got the best pussy\nCrazy bitches got the best pussy (I ain't gon’ lie)\nCrazy bitches got the best pussy (They do)\nCrazy bitches got the best pussy (What)\n\n[Verse 2: Problem]\nI ain't going to lie i'm crazy too though\nOne minute i'm trying to move on next minute we playing Uno\nLike damn, What the fuck is wrong with yall?\nI can't leave her alone, i need to stop and\nI know i do But ima keep on doing it\nWe ain't winning cause we keep on losing it\nGetting mad she lose it quick and i know i'm a fool\nWhen I move the dick I push the tongue all on the clit and just lick lick lick lick lick lick\nTell her I love her when i'm all inside her\nWe even fuck when i'm getting vibed\nFalling asleep drunk next to her\nShe grabbed the phone and be all inside it\nAll inside it, getting all excited\nWaking me up just punching and shit\nGoing through my head at the same time\nWhy am i fucking this bitch?\nStill, I gotta read the sign, free my mind\nCuz I swear this bitch will have me doing time\n\nDamn\n\n[Hook]\nCrazy bitches got the best pussy (They do)\nCrazy bitches got the best pussy (I ain't going to lie)\nCrazy bitches got the best pussy (They do)\nCrazy bitches got the best pussy (Hold up)\nCrazy bitches got the best pussy\nCrazy bitches got the best pussy\nCrazy bitches got the best pussy (They do)\nCrazy bitches got the best pussy\n\n[Verse 3: Problem]\nYeah\nYou're upset, I'm upset, what the fuck we going to do?\nStop listening to your friends man them bitches crazy too\nTired of motherfucking lying What the fuck I'm finna do\nBaby don't say shit I ain't in the fucking mood\nTo be listening to that\nYah yah yah that blah blah blah stop that\nAnd the marks you used to fuck with, I am not that\nSo stop that, all that fucking crazy ass acting\nWant to trip again? I'll send yo ass packing\nYeah, i'm checking you\nYeah, i'm checking you\nYeah, i'm checking you\nBaby i'm a star i can have that bitch next to you\nYeah, your homegirl, I could've had that bitch yesterday\nMatter fucking fact I can have that bitch everyday\nAny day, so you better recognize what's what (What’s What)\nI ain't fucking round this time\nStop grabbing on my dick, kissing on my neck\nStop shit.....Girl give me that pussy\n\nShit\n\n[Hook]\nCrazy bitches got the best pussy (They do)\nCrazy bitches got the best pussy (I ain't gon' lie)\nCrazy bitches got the best pussy (They do)\nCrazy bitches got the best pussy (Come on)\n\n[Outro]\nBest pussy\nBest pussy\nBest pussy (They do)\nBest pussy\nBest pussy (They do)\nBest pussy\n\nShit\n\nMan\n\nCrazy bitches got the best pussy\n\n(They do)\n\nFuck", "year": "2016-04-01"}]}