{"songs": [{"image": "https://images.genius.com/29945bf84176151836dcda7f99aa32bb.600x576x1.jpg", "year": null, "lyrics": "[Chorus:]\nIt's a 304 thing\nLet me see your body swing... swaaaang\nLet me see your body move\nDon't just sit there get your groove on\nIt's a 304 thing\n\n[AMG:]\nPagenet Nationwide on my side\nNever miss a beep from a freak with a big behind\nWho wanna bump and grind with the bigga nigga?\nI need a hooker who's quick to lick a dicka\nTake a sip of liquor, Hennessy and Dom Pérignon\nGettin' high with the bone\nLookin' for the late night hype\nPlayer haters huggin' on they hoes so tight\nTrick of the Month, trickin' on a stunt\nThinkin' you's the mack 'cause your pockets on fat\nI'm the reel-to-reel, got the steel to deal\nAnd, put my fist to your grill and will (damn!)\nTake your hoe to the honeycomb hideout\nGive her this mighty love, then I slide out\nI'm the wham-bam thank ya m'am king of the underground swing\nBaby it's a 304 thing\n\n[Chorus:]\nIt's a 304 thing\nLet me see your body swing... swaaaang\nLet me see your body move\nDon't just sit there get your groove on\nIt's a 304 thing\n\n[AMG:]\nI'm just a nigga from the motherfuckin' what?\nUsed to make ends with the birds and the bud\nBefore I made a demo, before I rode a limo\nThey used to call me Spend, paper to the pen\nBeats to the tape, sittin' in the studio\nNiggas try to act it, but they never knew me though\nJust me and mo' doe, never in a four-do'\nHe me low keyin', Cherokee'n\nNow it's '94 and, A-M' is the name\nFuckin' up the game, steppin' on the lames\nNiggas wanna gangbang but I wanna make ends\nFuck a '6-4 put me in a Benz\nWith a redbone bad mamma jamma\nWith the thumps and the bump like my nigga Hammer\nAnd it's real good, comin' with the California feel good slang\nCause nigga it's a 304 thing\n\n[Chorus:]\nIt's a 304 thing\nLet me see your body swing... swaaaang\nLet me see your body move\nDon't just sit there get your groove on\nIt's a 304 thing\n\n[AMG:]\nNigga who is you? Guess ya don't know about my crew\nWill put you in a twist and they don't miss\nToo many to name, but they don't want fame\nJust a piece of the game\nAnd some wanna get high but I gets fly\nFrom the Coast with the most to the best thigh\nAnd I can't forget Chicago and Frisco\nHouston where the Geto Boys is thick yo\nAtlanta, GA where the players play now\nOne more gen for my niggas that locked down\nAnd all the rap superstars and they crews\nYou better get yours, before they get you\nAnd to the ladies, I don't hate ya but I love ya\nBut a few of y'all, oh yes I'm through with y'all\nSo if ya like what ya hear let me here ya say HO!\nCause baby it's a 304 thing\n\n[Chorus:]\nIt's a 304 thing\nLet me see your body swing... swaaaang\nLet me see your body move\nDon't just sit there get your groove on\nIt's a 304 thing", "title": "304 Thang", "album": "Ballin’ Outta Control"}], "artist": "AMG"}