{"artist": "The Weeknd", "songs": [{"year": "2011-03-21", "lyrics": "[Intro]\nOh, oh-ooh\nOh (woah), oh (woah)\nOh, oh\n\n[Verse]\nThey say my brain meltin'\nAnd the only thing I'll tell 'em is\nI'm livin' for the present and the future don't exist\nSo, baby take your clothes off, a chance like this\nYou may never get to show off, show off\nShow off what you talking about\nUnless you like to tease, baby\nWhen in reality you don't know how to please, baby\nBlue-ball queen, take your fuckin' seat, baby\nRide it out, now I know you wanna scream, baby\nBetter than your next man\nAnd if he swingin' I get dumber than the next man\n'Cause I don't play\nUnless it's keys, then I play all day (All day)\nYou like them keys? We gon' play all day (All day)\nWet dream fry your brain all day, all day\nI think you lost your morals, girl (What?)\nBut it's okay 'cause you don't need 'em where we're goin'\nIn that two-floor loft in the middle of the city\nAfter rollin' through the city with me\nI promise you gon' see\nThat I'm only fuckin' 20, girl\nAmnesia, put your mind in a dream world\nWhat you doin' in the bathroom? (Woah)\nI hear noises in the bathroom (Woah)\nBaby, it's okay\nWe can do it in the living room\nTwisting turns in 'em, the only girls that we fuck with\nSeem to have 20 different pills in 'em\nThey tell us that they love us\nEven though they want a next man\nAnd the next man's bitch want the third man\nEddie Murphy shit, yeah, we trade places\nRehearse lines to them and then we fuck faces\nYeah, we know just how to get a buzz\nMix it with the hash, come fuck with us\nI'm raw, mothafucka, I'm raw\nMy love so lost, and my niggas, man\nThese bitches can't touch what we got if they wanted\nI'll plug any nigga that'll step\nMan, I got 'em, yeah, I got 'em\n'Til the ending of our credits\nLife's such a movie, filmed independent, us against the city\nPlease don't get offended when we don't answer your calls\nAnd if you got a problem, come and find us, we can talk about it\nWhat's good, young ho? You about it?\nGot a loft right now, you excited?\nYou excited\n\n[Outro]\nOoh, ooh\nAh, ah\nOoh-ahh\nWhat you thinkin' about?\nWhat you thinkin' about?\nYeah\nWhat you thinkin' about?\nOoh, what you thinkin' about?\nWhat you thinkin' about?\nWhat you thinkin' about?\nWhat you thinkin'?\nI been thinkin' 'bout, ooh\nI know everything, ooh\nI know everything\nI know it all\nI know it all\nAhh, ahh, ahh, ooh\nOoh-ahh, ahh, ahh\nOoh, oh no, no, no\nAhh, ahh-ooh, ooh", "image": "https://images.rapgenius.com/69lpcpa38u6555biixhaabgep.1000x1000x1.jpg", "album": "House of Balloons", "title": "Loft Music"}]}