{"songs": [{"lyrics": "Featuring KRS-One\n\nIntro: KRS-One\n\nBo bo bo! How many times I gotta tell you man? D-Nice, number one\nLyracist out here in the world today. All the suckers that want to\nPerpetrate the fraud must come correct! Know what I'm saying? This\nIs KRS-One from the massive BDP crew. And of course we are doing it\nJust for you. The styles are from 1990, and 1991 and 1992. So we\nGonna break it down a little something like this, check it out\n\nChorus: KRS-One\nI say the TR-808 is coming, bright and early in the morning\nI say the TR-808 is coming, but you see that is daily living\n\nVerse One: D-Nice\nI-I'm D-Nice the 808 it's no mistake\nNow this is not the time but the music that I make\nAnd wait, I'm telling you, why don't you just listen\nJust because I come from the Bronx I'm not dissing or wishing\nCause the beat sounds groovy\nI drink Ammoretta on the rocks cause it cools me off\nAnd usually when I am speaking\nI usually wear a cap and gown when I'm teaching\nOr reaching out, huh, to touch someone\nI'm rocking on the microphone just to have fun\nSo run (Bo bo bo!) cause I'm number one\nAnd if you want to battle me then pull out a gun\nDon't forget the ammo-nition and listen\nDon't ever bite a lyric cause then you're pissing me off\nAnd with the style that I'm bringing\nThe girls love it, and of course, girls I'm swinging\nAnd seeing (Bo bo bo!) I left the girls' hearts broken\nNow I'm back to tell you all I'm not joking\nAnd I'm hoping you see that I'm the main topic\nYou put me in the wildest crowd and I'm a rock it\n\nChorus\n\nOutro: KRS-One\n\nYes man, you see every time of the week BDP rules! You know what I'm saying?\nMy man D-Nice in the house producing up his own album this time in 1990. How\nMany of you suckers out there can get with that? Ha ha, you know what I'm\nSaying? I'm not gonna give no shoutouts on this record because the whole BDP\nCrew know who down and who ain't down, so if you not down, throw your hands in\nThe air if you ain't down. Ha ha, suckers! We fresh for 1990 as usual. My man\nD-Nice wrecking the parties, wrecking the females, wrecking the clubs all over\nThe country. London, Japan, Germany, everywhere on the planet we rule. Get it\nThrough your head once and for all. My name is KRS-One, I'm outta here. Peace!", "album": "Call Me D-Nice", "year": null, "title": "The TR 808 is Coming", "image": "https://images.genius.com/eb0cb470ed0037a539adc0b84eb90ebd.432x432x1.jpg"}], "artist": "D Nice"}