{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C. Pt. 2", "title": "Click Clack", "image": "https://images.genius.com/e25277b4e30e7ff6801bccf445a029d8.499x499x1.jpg", "lyrics": "(Prodigy talking)\nClick Clack\nRock-a-bye Baby\nClick Clack\nOh you'se dead mothafucka\n\n[Prodigy]\nJust look into my eyes, you see there's no bullshit\nAnd I'ma professional, drama bring a .9 slinger\nJust look at my face; do I look like I'm playing with you?\nListen to my verse; Do it sound like I'm a scared fool? NO!\nI don't give a fuck when I rap\nYou see me in the street it's the same way I act\nIt's not movie dawg, it's a reality show\nSo that'll be real good when that cali-coat blow\n\n(Chorus) Prodigy\nWelcome to the life of V.I.P\nOn DVD 'cause shit too violent for MTV\nThere's niggas being killed; bitches being fucked\nThere's drugs being sold; our money getting up\n\n[Big Twinz]\nIf you look into my mind; all you see is hate dunn\nThe blood's everywhere, but most of 'em is fake one's\nI load up the .9, trying to get payload\nI take everything from you shoes to your Kangol\nYou gotta give it up or get your arm chopped off\nNiggas know my name - Big Twinz pop off\nThe fiends know wassup, I'm the one to cop off\nI'm not soft, Infamous fire like hot-sauce\n\n[Prodigy]\nGet a load of real shit, the hemi go bang\nThe swami go rang, in the shoot & range\nSo I could perfect my aim\nStick you like a dope needle how a nigga aim\nSharp-shooter, top shotta, top fire rapper\nVoted most likely to knock back up...\nI pick the ratch[et] up and cap you up\nNight or day it don't matter\nThe skateboarder, surfboarder, snowboarder\nUnderstand P you see 'cause he's sorta...\nThe best stuff on Earth\nAnd if you come up with your bitch to put the cuff on first\n'Cause I'ma animal pimp, I get up on a female\nAnd tell her things she likes, she give me that tail\nAnd I call heads, but I was all wrong dawg, a sex is the best\n\n(Prodigy talking)\nClick Clack\nRock-a-bye Baby\nClick Clack\n\n(Sample)\n\"And the man walked in the valley of the shadow of death\nFor years and he feared no evil\"", "year": "2008-04-22"}]}