{"songs": [{"year": "2019-06-14", "image": "https://images.genius.com/632cbe474a2ab6a525c2a0da36a43d67.1000x1000x1.jpg", "title": "Privacy", "album": "I Am Me", "lyrics": "[Intro]\nWalked in your hood with the chopper on side of me, I turn your hood to a robbery\n(Damn Chop, this shit slappin')\nAyy\n\n[Chorus]\nWalked in your hood with the chopper on side of me, I turn your hood to a robbery (Robbery)\nTwo freaky bitches named Ebony, Ivory, they eatin' parental advisory (They slurpin')\nIf you say that you love me, bitch, why would you lie to me? (Huh?)\nI guess I'm a blunt, niggas want to put fire to me  (That's on my mama)\nTrap full of birds, my plug like to fly to me\nHe say that he like the privacy (Privacy)\nWalked in your hood with the chopper on side of me, I turn your hood to a robbery (Woah, woah, woah)\nTwo freaky bitches named Ebony, Ivory, they eatin' parental advisory (That's on my mama)\nIf you say that you love me, bitch, why would you lie to me?\nI guess I'm a blunt, niggas want to put fire to me (Yeah)\nTrap full of birds, my plug like to fly to me (Yeah, yeah)\nHe say that he like the privacy (Yeah, yeah, yeah)\n\n[Verse]\nMr. Work-a-Bitch like she get off at six\nThree up in the morning, wake her up with the dick\nMy jewelry the candyman, got few cuts on my wrist (Froze)\nThese niggas don't stand a chance, everybody hate this (Woah)\nI done seen my niggas kill his dawg, Mike Vick (Mike)\nWith these bitches, I be on and off, light switch (Light)\nI had to cut her off, so that's not my bitch (Nah)\n'Cause she bit up on my ear on some Mike Mike shit\nI remember I was trappin' on the sidekicks\nSaw myself gettin' rich like a fuckin' psychic\nI was wearin' niggas' clothes, that wasn't even my shit\nBut I still looked fresh as fuck, and your bitch liked it, so\nBitch, I'm from Memphis, the city's a go\nIf it's some tension, my nigga, let me know\nWhy I keep a thirty, 'cause it's at least thirty or forty for me to walk up in the door\n\n[Interlude]\nCome on now\nY'all know it's Bloc\nWord, word\nHeard they got Bloc in the house\nThat nigga got a whole lot of money, too\nFor real\n\n[Chorus]\nWalked in your hood with the chopper on side of me, I turn your hood to a robbery (Robbery)\nTwo freaky bitches named Ebony, Ivory, they eatin' parental advisory (They slurpin')\nIf you say that you love me, bitch, why would you lie to me? (Huh?)\nI guess I'm a blunt, niggas want to put fire to me  (That's on my mama)\nTrap full of birds, my plug like to fly to me\nHe say that he like the privacy (Privacy)\nWalked in your hood with the chopper on side of me, I turn your hood to a robbery (Woah, woah, woah)\nTwo freaky bitches named Ebony, Ivory, they eatin' parental advisory (That's on my mama)\nIf you say that you love me, bitch, why would you lie to me?\nI guess I'm a blunt, niggas want to put fire to me (Yeah)\nTrap full of birds, my plug like to fly to me (Yeah, yeah)\nHe say that he like the privacy (Yeah, yeah, yeah)\n\n[Outro]\nChoppamatics made another one"}], "artist": "BlocBoy JB"}