{"songs": [{"year": "2017-04-14", "album": "DAMN.", "image": "https://images.genius.com/d25e7043f51c2de6acaf6c39caa60da2.1000x1000x1.jpg", "title": "FEAR.", "lyrics": "[Intro: Dale Warren]\nPoverty's paradise\nI don’t think I could find a way to make it on this earth\n(I've been hungry all my life)\n\n[Voicemail: Carl Duckworth]\nWhat's up, family?\nYeah, it’s your cousin Carl, man, just givin' you a call, man\nI know you been havin' a lot on yo' mind lately\nAnd I know you feel like, you know\nPeople ain't been prayin' for you\nBut you have to understand this, man, that we are a cursed people Deuteronomy 28:28 says, \"The Lord shall smite thee with madness And blindness, and astonishment of heart\"\nSee, family, that's why you feel like you feel\nLike you got a chip on your shoulder\nUntil you follow His commandments, you gonna feel that way\n\n[Bridge 1: Charles Edward Sydney Isom Jr. & Kendrick Lamar]\nWhy God, why God do I gotta suffer?\nPain in my heart carry burdens full of struggle\nWhy God, why God do I gotta bleed?\nEvery stone thrown at you restin' at my feet\nWhy God, why God do I gotta suffer?\nEarth is no more, won’t you burn this muh’fucka?\nI don't think I could find a way to make it on this earth\nAkcuf’hum siht nrub uoy t'now ,erom on si htraE\nReffus attog I od doG yhw ,doG yhW\nTeef ym ta 'nitser uoy ta nworht enots yrevE\nDeelb attog I od doG yhw ,doG yhW\nElggurts fo lluf snedrub yrrac traeh ym ni niaP\nReffus attog I od doG yhw ,doG yhW\nTeef ym ta 'nitser uoy ta nworht enots yrevE\n\n[Verse 1: Kendrick Lamar]\nI beat yo’ ass, keep talkin' back\nI beat yo' ass, who bought you that?\nYou stole it, I beat yo' ass if you say that game is broken\nI beat yo' ass if you jump on my couch\nI beat yo' ass if you walk in this house\nWith tears in your eyes, runnin' from Poo Poo and Prentice\nGo back outside, I beat yo' ass, lil' nigga\nThat homework better be finished, I beat yo' ass\nYour teachers better not be bitchin' 'bout you in class\nThat pizza better not be wasted, you eat it all\nThat TV better not be loud if you got it on\nThem Jordans better not get dirty when I just bought 'em\nBetter not hear 'bout you humpin' on Keisha's daughter\nBetter not hear you got caught up\nI beat yo' ass, you better not run to your father\nI beat yo' ass, you know my patience runnin' thin\nI got buku payments to make\nCounty building's on my ass, tryna take my food stamps away\nI beat yo' ass if you tell them social workers he live here\nI beat yo' ass if I beat yo' ass twice and you still here\nSeven years old, think you run this house by yourself?\nNigga, you gon' fear me if you don't fear no one else\n\n[Chorus: Kendrick Lamar]\nIf I could smoke fear away, I'd roll that mothafucker up\nAnd then I'd take two puffs\nI'm high now (Huh), I'm high now (Huh)\nI'm high now (Huh), I'm high now (Huh)\nLife's a bitch, pull them panties to the side now\n(Pull them panties to the side now)\nI don't think I could find a way to make it on this earth\n\n[Verse 2: Kendrick Lamar]\nI'll prolly die anonymous, I'll prolly die with promises\nI'll prolly die walkin' back home from the candy house\nI'll prolly die because these colors are standin' out\nI'll prolly die because I ain't know Demarcus was snitchin'\nI'll prolly die at these house parties, fuckin' with bitches\nI'll prolly die from witnesses leavin' me falsed accused\nI'll prolly die from thinkin' that me and your hood was cool\nOr maybe die from pressin' the line, actin' too extra\nOr maybe die because these smokers are more than desperate\nI'll prolly die from one of these bats and blue badges\nBody-slammed on black and white paint, my bones snappin'\nOr maybe die from panic or die from bein' too lax\nOr die from waitin' on it, die 'cause I'm movin' too fast\nI'll prolly die tryna buy weed at the apartments\nI'll prolly die tryna defuse two homies arguin'\nI'll prolly die 'cause that's what you do when you're 17\nAll worries in a hurry, I wish I controlled things\n\n[Chorus: Kendrick Lamar]\nIf I could smoke fear away, I'd roll that mothafucker up\nAnd then I'd take two puffs\n(I've been hungry all my life)\nI'm high now (Huh), I'm high now (Huh)\nI'm high now (Huh), I'm high now (Huh)\nLife's a bitch, pull them panties to the side now\n(Pull them panties to the side now)\nNow\n\n[Verse 3: Kendrick Lamar]\nWhen I was 27, I grew accustomed to more fear\nAccumulated 10 times over throughout the years\nMy newfound life made all of me magnified\nHow many accolades do I need to block denial?\nThe shock value of my success put bolts in me\nAll this money, is God playin' a joke on me?\nIs it for the moment, and will he see me as Job?\nTake it from me and leave me worse than I was before?\nAt 27, my biggest fear was losin' it all\nScared to spend money, had me sleepin' from hall to hall\nScared to go back to Section 8 with my mama stressin'\n30 shows a month and I still won't buy me no Lexus\nWhat is an advisor? Somebody that's holdin' my checks\nJust to fuck me over and put my finances in debt?\nI read a case about Rihanna's accountant and wondered\nHow did the Bad Girl feel when she looked at them numbers?\nThe type of shit'll make me flip out and just kill somethin'\nDrill somethin', get ill and fill ratchets with a lil' somethin'\nI practiced runnin' from fear, guess I had some good luck\nAt 27 years old, my biggest fear was bein' judged\nHow they look at me reflect on myself, my family, my city\nWhat they say 'bout me reveal if my reputation would miss me\nWhat they see from me would trickle down generations in time\nWhat they hear from me would make 'em highlight my simplest lines\n\n[Verse 4: Kendrick Lamar]\nI'm talkin' fear, fear of losin' creativity\nI'm talkin' fear, fear of missin' out on you and me\nI'm talkin' fear, fear of losin' loyalty from pride\n'Cause my DNA won't let me involve in the light of God\nI'm talkin' fear, fear that my humbleness is gone\nI'm talkin' fear, fear that love ain't livin' here no more\nI'm talkin' fear, fear that it's wickedness or weakness\nFear, whatever it is, both is distinctive\nFear, what happens on Earth stays on Earth\nAnd I can't take these feelings with me, so hopefully, they disperse\nWithin fourteen tracks, carried out over wax\nSearchin' for resolutions until somebody get back\nFear, what happens on Earth stays on Earth\nAnd I can't take these feelings with me, so hopefully they disperse\nWithin fourteen tracks, carried out over wax\nWonderin' if I'm livin' through fear or livin' through rap\nDamn\n\n[Bridge 2: Bēkon]\nGod damn you, God damn me\nGod damn us, God damn we\nGod damn us all\n\n[Outro: Carl Duckworth]\nVerse 2 says, \"You only have I known of all the families of the Earth, therefore I will punish you for all your iniquities.\"\nSo until we come back to these commandments\nUntil you come back to these commandments\nWe gonna feel this way, we gonna be under this curse\nBecause He said He's gonna punish us\nThe so-called Blacks, Hispanics, and Native American Indians\nAre the true children of Israel\nWe are the Israelites, according to the Bible\nThe children of Israel\nHe's gonna punish us for our iniquities, for our disobedience\nBecause we chose to follow other gods\nThat man chastens his son, so the Lord, thy God, chasten thee\nSo, just like you chasten your own son, He's gonna chastise you\nBecause He loves you, so that's why we get chastised\nThat's why we're in the position that we're in\nUntil we come back to these laws, statutes, and commandments\nAnd do what the Lord says, these curses is gonna be upon us\nWe gonna be at a lower state in this life that we live\nHere, in today, in the United States of America\nI love you, family, and I pray for you\nGod bless you\nShalom"}], "artist": "Kendrick Lamar"}