{"artist": "Willie D", "songs": [{"year": null, "lyrics": "Here's somethin for you fraudulent-ass niggas\n\n\t(Pussy in the click, pussy in the click\n\tI got a muthafuckin pussy in my click)\t\t(4x)\n\nSignin loyalty contracts\nYou muthafuckas is bitch\nTakin a nigga kindness for weakness\nWishin I knew some of y'all niggas was hoes\nA smile ain't nothin but a frown turned upside down\nWatch these niggas\n\n[ VERSE 1 ]\nSay nigga, you'se a hoe if I ever seen one\nPay me my fuckin dough when I see you then some\nClear the way, fuck was comin out of that fool's mouth?\nHere comes the realest nigga down south\nHave you ever had a nigga in your muthafuckin click\nClaimin that he real, but he's a muthafuckin bitch?\nActin all hard, nigga can't squab\nGive that bitch your dope and watch his ass get robbed\nGotta watch my back, cause these niggas are makin dirty moves\nScreamin that they down, when in fact they hatin on the crew\nCall me a fool, but I roll on them sons of bitches\nAnd I don't give a fuck about the consequences\nI'm jumpin fences, it's me, the police kinda fat\nCause my muthafuckin homie downtown rat\nHomicidal ideas crossin my mind\nBitches callin my parole officer lyin\nCan't seem to find a true pal\nYou say you're down with me, but tryin to fuck my gal\nThought you was real, nigga, but you fake as shit\nYo girlish ways make you a pussy in the click\n\n\n\t(Pussy in the click, pussy in the click\n\tI got a muthafuckin pussy in the click)\n\n[ VERSE 2 ]\nRemember when you brought hoes to my crib, and vice versa\nAfter the club gettin pussy on the dresser\nFuckin in the same room, that's how it was\nIf I had a quarter, it was yours\nLike a crackhead and his pipe, me and you was tight\nSo fuckin close we even dressed alike\nYou used to say, \"Fuck L.L. and Run-D.M.C\nThey can't fuck with my nigga Willie D\"\nBut then I started makin money\nAnd you started actin funny\nTellin people I changed\nSpeakin bad on my name\nBut I'm the same muthafucka that saved your life\nWhen them killers was tryin to get you at the club that night\nComin off tour, kickin you down on the strenght\nBought your kids Christmas gifts and paid your goddamn rent\nI can't believe all the shit you said\nPuttin my business in the sewer\nGossipin like a bitch, nigga, you a\n\n\t(Pussy in the click, pussy in the click\n\tI got a muthafuckin pussy in the click)\n\n[ VERSE 3 ]\nFraud niggas, stay out of my reach, capisc'\nAnd get your own shit like Lil' Kim, you goddamn leech\nDon't make me preach, cause I can talk about this shit for days\nSheift-hearted bastards and they bitchy ways\nThese niggas out for self, they can't be trusted\nIn your face when you got paper, but where they at when you busted?\nWell adjusted to ridin solo, who needs a friend\nWhen every nigga and his mammy tryin to win on ya?\nI fight by myself, get drunk by myself\nSmoke weed by myself, cause I don't need no fuckin help\nWatch your step, cause loyalty is taught to locate\n]From the streets to the suites everybody so fake\nSnake in the grass, I see your ass, and it's tremlbin black\nWe ran a train on that hoe, and you keep doublin back\nNow we don't speak, but it ain't my fault you fell in love with that bitch\nDown to play, now you stuck with a pussy in the click", "image": "https://images.genius.com/c20249656f384001f10bb6881020ea0b.1000x1000x1.jpg", "album": "J Prince Presents Realest Ni@@as Down South", "title": "Pussy in the Click"}]}