{"songs": [{"year": "2001-10-16", "image": "https://images.genius.com/8af6cd69d2d9ed7258d80228afce41de.220x220x1.jpg", "title": "Saturday Afternoon", "album": "1 Less G n da Hood", "lyrics": "Who wanna ride?!\nWho wanna ride?!\nWho wanna ride?!\n\nIt's a Saturday afternoon on the Eastside\nMashin' in the bucket, sippin' on formeldahyde\nPockets lookin' sore so you know I gotta go\nPull a 2-11 on the neighborhood sto'\nMash on the gas, then I hit the pavement\nJumped out the bucket, headed straight in\nTold the fuckin' clerk, put the money on the table\nI'm a lunatic and my mind is unstable\nHe stuttered like a bitch\nTryin' to stop the hit\nShakin' like a twig\nSo you know I dumped the clip!\n16 shots left his body on the flo'\nBreak the register, took the money, and I broke\nOut the fuckin' back do' straight to the bucket\nPut the money in, start the ride, and I punch it\nBeen from the hood, straight shots in the daylight\nA normal Saturday for Blaze on the Eastside\n\nEvery Saturday afternoon!\n(Who wanna ride?!)\nI go robbin' these bitches and hoes!\n(Who wanna ride?!)\nEvery Saturday afternoon!\n(Who wanna ride?!)\nI go robbin' these bitches and hoes!\n\nHeaded on back the crib to count my dough\nGot 200 dollars and I'm lookin' for mo'\nCuz I'm greedy and I'm back on the streets\nRollin' thru the hood, to another store I creep\nNow I'm on my feet cuz the cops is on my tail\nThey wanna see me go to jail with no bail\nBut they can't cuz I'm rockin' a hoodie\nA .45 cal. in my waist, so don't push me\nSame Saturday, still hittin' licks for cash\nWalked into Carlins, demanded all his stash\nThe sucka talked shit, but filled the bag up\nGuess he thought his homie in the back was gonna tag him\nBlaze, and he came out from the back room\nRunnin' at a dead homie, Blaze, with a broom\nI put two slugs in they muthafuckin' chest\nSaturday afternoon, I laid them hoes to rest\n\nEvery Saturday afternoon!\n(Who wanna ride?!)\nI go robbin' these bitches and hoes!\n(Who wanna ride?!)\nEvery Saturday afternoon!\n(Who wanna ride?!)\nI go robbin' these bitches and hoes!\n\nWalk out the Carlin's, headed 'cross Grashiot\nCops rollin' by, my hoodie up, I'm mashin'\nWent to count my cash, got 5 C-notes\nNeed 5 mo' for some weed to smoke\nSo I know I gotta rob a suburb store\nIn the suburbs they keep real cash in they drawer\nNot like the ghetto just nickel and dime shit\nTired of walkin' so I car jacked a bitch\nAt the stoplight, I jumped in, told her get out\nCall the cops, I know where you live, I'll put your lights out\nNow I'm mashin' down the block\nTo the liquor spot\nFound a purse, went thru it in the parkin' lot\nWhaddya know, the bitch had $600 dollars\nThe sun's still out so you know I'm gonna follow\nThrough with the plan, robbib' suckas for they cheddar\nOn Saturday, still a G, down to the letter\n\nEvery Saturday afternoon!\n(Who wanna ride?!)\nI go robbin' these bitches and hoes!\n(Who wanna ride?!)\nEvery Saturday afternoon!\n(Who wanna ride?!)\nI go robbin' these bitches and hoes!\nEvery Saturday afternoon!\n(Who wanna ride?!)\nI go robbin' these bitches and hoes!\n(Who wanna ride?!)\nEvery Saturday afternoon!\n(Who wanna ride?!)\nI go robbin' these bitches and hoes!\n\n\"4...3..3...2....2....2...1....1.......\"\n\nWho wanna ride?!\nWho wanna ride?!\nWho wanna ride?!\nWho wanna ride?"}], "artist": "Blaze Ya Dead Homie"}