{"songs": [{"image": "https://images.genius.com/246e4408dbf779ecc2275ceef46c850e.453x450x1.jpg", "year": "1992-04-16", "title": "Who’s Tha Hoe?", "album": "Psycho Active", "lyrics": "{Verse 1: X-Raided}\nPicture this, a black man walks into a white store\nShe's a white hoe, and the nigga says \"Hello\"\nShe says \"Hi\" back in a friendly tone\nBut she was really thinking \"Nigga, leave me the hell alone\"\nBut then, the nigga threw his rap\nTold her that he loved her, and all that crap!\nI knew what he wanted to do\nTake her to her house, pick up her brew, and then screw\nThis is something that I know well\nBlack hoes is cool, but white hoes are dumb as hell\nShe fell for the drama that he was talking\nWhen she should've said \"Nigga, keep walking!\"\nBut she was nothing but a flirt\nShe thought to herself \"A little sex won't hurt\"\nHuh, but little did the white hoe know\nThe nigga was a jiggalo, you know, a male hoe\nThey left the store, and went to the nigga's house\nDoggy style, turned her white ass out\nThe nigga got a 40 out the fridge\nKicked back, and took a few swigs\nHe passed it to the hoe, and she took a few sips\nHe took it from her, put it down, and he touched her lips\nHe put her ass out, baby, you gotta go\nNow let me know, who's the motherfucking hoe\nIn this case?\n\n{Chorus: X-Raided, Brotha Lynch Hung, and Sicx}\nWho's the, who's the hoe\n(Repeats three more times)\n\n{Verse 2: X-Raided}\nWe all know what happened to the white hoe\nShe got sick, took a trip to the hospital\nIt wasn't A.I.D.S., or some other disease\nShe was pregnant, because she was easy\nShe got money, but still, was a damn shame\nThe baby's father, she don't know his damn name\nAnd what's she gonna tell Pops?\nHe thought she was a V, but the panties drop\n(Sicx): Did she come out with the fact?\nI don't know, Moms is old, she might have a heart attack\nShe ain't showing yet, so why bother?\nRight now, she needs to try to find the father\nShe got the address, and went to the front door\nThe nigga opened it, and said,\"What up, hoe?!\"\nHe noticed that she wasn't gonna apologize\nAnd from the Levis, he was hugging her thighs\nHe said,\"Baby, did you wanna come in?\"\nAnd like a dummy, she did, and they was fucking again\nShe forgot what she was there for\nThis time, yo, I know who's the hoe\n\n{Chorus: X-Raided, Brotha Lynch Hung, and Sicx}\n\n{Verse 3: X-Raided}\nShe lost her baby, maybe, it was for the best\nOr it could've been a little test\nPut together by you know who (Sicx: Nigga, scheme)\nThe hoes be screaming, too\nI don't know, it's crazy than a motherfuck\nIs it the nigga you trick, or the dick she sucked?\nOr is it both that makes you a big bitch\nYou get mad, so you switch\nGo find you another hoe to get with\nEat each other's pussies, and playing with rubber dicks\nNiggas is hoes, too, dropping them drawls\nGetting up the shit walls\nDon't ask me, because I don't know\nThe nigga or the bitch, which one is the hoe?\n\n{Chorus: X-Raided, Brotha Lynch Hung, and Sicx}\n\n(End of the Song)"}], "artist": "X-Raided"}