{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse 1]\nGrab a hold of yourself, open your eyes\nGet wise to the exercise\nBeing taught by the teacher that's most dominant\nYou need knowledge?\nWell I'm dropping it\nListen to the rap allow it to trap\nYour body and soul so that you can adapt\nTo the man on display as I take you away\nSo may I?\n[Yes you may!]\nProud to be a Black man\nComing exact and\nGiving up to brothers five on the back hand\nPray for lease and peace upon each other\nWith my sisters and brothers\n[Marley Marl: yo, word to the mother!]\nI say the mother, as in the motherland\nBut on the other hand, another man\nTackled and shackled our ancestors\nBut we beat him with freedom, so let's bless the\nCountry that we all came from\nBecause the moral of it all is we shall overcome\nThe cream will keep rising\nWe be sizing\nUp, the Asiatic one is enterprising\nBuilding and building to carry on\nAll the way from Malcolm X to Farrakhan\nMartin Luther was a tutor, many were pupils\nThose who fell victim were those without scruples\nHowever, to sever, we could never\nSo hold up the peace sign and stand together\nTake heed to the words that I manifest\nAnd when I'm through speaking, Marley Marl'll do the rest\n\n[Break]\n[James Brown getting cut up:\nPeople, people\nWe gotta get over, before we go under (x2)\nLet's get together] (x2)\n[Marley Marl?:\nYo Big Daddy, what you gonna say now?]\n\n[Verse 2]\nTake a stand the fight for power\nCause we've been here before the Mayflower\nLiving superior abiding by nature\nThe history of the Asiatic one paid the\nPrice to be paid in slavery\nLike the name of Antonio was gave to me\nBut knowledge of self broke every shackle and chain\nNow I declare myself as the Big Daddy Kane\nThe teacher, teaching a lesson to be heard\nThat's word, to the mother my brother\nSo discover the truth of one another\nCause here's the real deal upon our skin color\nLay down white, yellow, red or pink\nBut the color of black is most dominant\nThe rising and sizing can never cease\n[Marley Marl: what you going say now?]\nPeace!\n\n[Farrakhan: ...the mother of all living things and the Black man\nIs the original man, we just can't escape our destiny]\n\n[Word to the mother!] (x2)\n\n[Farrakhan: I thank Allah for allowing me to teach this subject today\nCrowd: yeah, that's right...]", "image": "https://images.genius.com/a3044a73939ccd541c13cf37d29d70bb.1000x1000x1.jpg", "year": "1988-06-28", "title": "Word to the Mother (Land)", "album": "Long Live the Kane"}]}