{"artist": "Ice-T", "songs": [{"title": "Lifestyles of the Rich and Infamous", "lyrics": "It's eight a.m. I roll out my silk sheets\nGet fly crash the limo back seats\nLookin' in the faces of some ladies that I never met\nOn the interview tip, no sweat\nThey ask me questions, I throw the words back\nThey say they write facts, I know that's bull crap\nThey're kickin' drama but then drama's my middle name\nThat's the price ya pay for big fame\nThe cellular phone rings\nDon't wanta pick it up\nBut it's my J-O-B I gotta kick it up\nAnother damn reporter\nOn the line with a word quiz\nI gotta show cause I'm livin' in showbiz\nOut the limo, to the plane, in the pourin' rain\nI hate flyin' but there's no time for slow trains\nAnother show to do, I gotta catch my crew\nThey left last night in the bus around two\nThe plane's a small one\nNo fun at all\nBouncin' round the air like a tennis ball\nWhen it touches down i wanna kiss the ground\nBut it's time to wreck a new town\nGet to the arena, meet up with the crew\nThey tell me all the speakers blew\nThe cordless don't work\nSound man's a jerk\nSomebody's gonna get hurt\nI'm crazy mad but my fans want autographs\nI turn my angry frowns into fake laughs\nI can't be rude 'cause they wouldn't understand\nI ain't human no more, I'm a superman\n\nCHORUS\nYou can try\nBut you'll never understand this\nYou can try\nBut you'll never understand this\nYou can try\nBut you'll never understand this\nThe lifestyles of the rich and infamous\n\nFour hours 'til show time oh well\nI might as well check in the hotel\nGet a little rest before it's time for us to play\nTen brothers standin' in the hallway\nAll with demo tapes, they need the hook up\nThey heard that I was the one to look up\nI can't ditch 'em\nCause they already saw me\nI'll put my head down\nMaybe they'll ignore me\nNo chance \"Ice what's goin' on?\"\nI listened to twenty-five songs\nAnd after that the brothers still wouldn't leave\nThey started lookin' at my T.V\nI was gonna break down if they didn't jet soon\nSnuck across the hall and crashed in E's room\nBut then this freak came in, thought I was E\nStraddled her legs across me\nRipped off her blouse\nPushed her breast against my face\nStarted gyrating her waist\nSounds fly, like a hype sex thriller?\nBut see, she looked like Godzilla\nPushed her off me, homegirl hit the floor\nThis is what it's like on tour\nI hit the hallway it was crawlin' thick\n\"Could weez take ya picture real quick?\"\nJumped into a pose that I used a million times before\nTook pictures with the whole damn floor\nI couldn't say no, not to my fans\nYou see, they wouldn't understand\n\nCHORUS\n\nNow it's show time, \"time to flow\" time\n\"Evil lost the records but we still gotta go\" time\nThe house is packed, everybody's on their feet\nSo I say, \"Throw on Rakim's beat.\"\nE hits the fader and the crowd is lit\nI start bustin' off some new shit\nThe stage is so smokey that I almost fall off\nI start inhalin' it, I'm tryin' not to cough\nI'm catchin' problems from every angle\nThe mic cords are tangled\nI try to flow smooth but my words are mangled\nDamn near slipped and broke my ankle\nIf that ain't enough the police are hawkin'\nListenin' real close to the words I'm talkin'\nThey wanna put a brother like me in the back seat\nJust because I curse the beat\nThey wanna tap my phone, wanna keep my crib bugged\nCall all my homies felons and street thugs\nYou might say i think this lifestyle sucks?\nI wouldn't trade it for a million bucks\nAlthough it's all not glamour and gleam\nIt's still my dream\n\nCHORUS", "image": "https://images.genius.com/679d07b7f63a4a34deb91acaf683d50a.546x485x1.jpg", "album": "O.G. Original Gangster", "year": "1991-05-14"}]}