{"songs": [{"year": "2012-03-05", "image": "https://images.genius.com/c827d7823eca2625dae750eca362369f.320x320x1.jpg", "title": "Down & Out", "album": "4eva N a Day", "lyrics": "[Intro]\nGood Lord we back one mo' 'gin\nThis for the people, this for the have-nots..\nI know what you going through\nI know what you dealing with on the daily, you feel me?\nAin't nothing but sunshine from here..\nLet's get high\n\n[Hook]\nSippin' on this drank don't ease my pain\nLord, I wish it would\nSmoking all this weed don't make me sane\nBut it should\nIn a world that's down and out\nIn a world that's down and out\n\n[Verse 1]\nI got my back against the wall\nOnce again, I've been cornered\nSmoke that roach from my ash tray\nFrom the other day and down this last Corona\nThat I scrape for, gotta make more\nGotta get mine cause when I get time\nI'mma get shine and clear my runway\nAnd wait 'til I get signed\nTo stretch my wings and fly\nDo what I gotta do to get by\nSee the world through my third eye\nWould answer the things I worried about\nAt the end of days, bills to pay\nIf it's a white man's world, am I still a slave\nTo the minimum wage?\nKeep words minimal, subliminal\nY'all won't make it anyway\nOut the traps they set\nFollow them tracks they left to the White House\nAnd tell Oprah Winfrey I don't need no chicken\nBitch is gonna turn my lights out\nOn a daily basis\nPiece of American Pie they cut me, I can barely taste it\nBut I know it ain't 'bout shit cause my grandma ain't make it\n\n[Hook]\n\n[Verse 2]\nCan't take that for granted though\nI'm still searching for antidotes\nNiggas outchea sick from the money they spent\nTrying to get more cars and clothes and hoes\nThat really know they poles, is that on earth winning y'all?\nIs every woman in a sundress, really down for the cause?\nI can't be sure, nowadays everybody 'bout dough\nAbout the play, a queen to be? A gold digger? I can't even say\nBut either way I strap up, wrap up\nCause I don't want no capsules after\nA rock-a-bye that I deny cause she stay on heads like tassels\nAnd that's not to say ain't no queens around my way\nI seen one the other day, but she had bruises on her face\nAnd cried to me that men ain't shit and she fed up\nThey only want her with her legs up\nEven though her nose swollen and eye was closed\nI told her keep her head up\n\n[Hook]"}], "artist": "Big K.R.I.T."}