{"songs": [{"image": "https://images.genius.com/c5fdb381127fcc19d35b597092bcec4b.640x640x1.jpg", "album": null, "title": "Straight Facts", "lyrics": "[Verse]\nWhen I was sky high not many of you wanted to see me fall\nI had one big ego, but I was mentally small\nI thought I was the man, telling everybody what to do\nWhen really they were just using me including my skrilla too\nSo look who's laughing now because it definitely ain't me\nDue to all my fuckery my agent had to lower my fee\nWith all the money I owe out, I could own me another key\nInstead I sold the house I lived in 'cause I was working for free\nMy friends were looking at me for help when I couldn't help myself\nAnd labelled me a no one when the label put me on it's shelf\nI weren't eating properly and they could see I wasn't well\nStill all they seemed to care about was my wealth\nFuck my health\nSee the Tinnitus thing I have, has always put me through hell\nToo busy looking out for others and not thinking about myself\nI'm rich and paranoid, who else is tryna' fuck with my girl?\nWho else is making up lies for another story to sell?\nYo, my BM sold like two stories on me for like 30K\nMy TM was doing dirty on me like almost every day\nRight under my nose, I would have never have known\nSo thank fuck that I'm paranoid and I went through his phone\nFuck I see a text to his wife\nThey nearly ruined my life\nThinking how's all this information getting printed overnight?\nNo lie, no lie\nI know it's in black and white\nAnd even though it's in The Times it's still a big bag of shite!\nI blame myself for being ignorant and opening up\nBut when you're stuck in this industry, you don't know who to trust\nI'm screaming where is the love?\n'Cause on the flip side, on my kid's life\nIn the streets I would've opened you up\nJust like that, Mumma we ain't going out like that\nOne day I'ma catch him outside ah, how 'bout dat?\nYou know like that\nWhen Pops used to preach I should've listened\nNow I bet he's up there grinning just 'cause I tried fight back\nI remember the times I used to steal bare weed from your pouch\nAnd pocket any loose change you left lying around the house\nI'd do anything to spend a couple seconds with him alive\nInstead I'm just left with a memory of him dead on the couch\nForever putting pieces together tryna' figure shit out\nImagine I was more than puzzled, having to give you mouth to mouth\nMy lord there was dry blood all down your face\nI will never forget the taste, tryna' save the man of the house\nThey say 'home is where the heart is'\nWell my one was on the market\nMum's got her own key but she prefers it where we started\nQueen of the hood, reminiscing must feel good\nCouldn't afford to buy me trainers now she's cleaning up my books\nWhen she's cleaning up the flat\nShe be polishing the plaques\nShe ain't worried about no bailiffs now her baby's paying tax\nWhen the press are talking trash, know that it ain't facts\nWhy would I smash my own gaff up when my yout's are in the back\nI'd be mad if I sat here tryna' justify every article\nI've already been chewed up and spat out into little particles\nEven though I'm sensitive and a softy at heart\nAll I hear is 'rip them apart 'cause there ain't nobody as hard as you'\nEasily antagonised, when I hear a bag of lies\nEveryone's got a past, only difference is mine's glamorised\nTalk about being terrorised, like say I'm gonna fall back\nYour favourite artist now started out as my support act\nThe scene was way needier, way before social media\nWhen we used to turn to radio just to make our lives easier\nCheck my Wikipedia\nI sold out bare arenas yo\nThey tried to brand me urban\nSo I climbed outta the pigeon hole\nI kicked down the door and left it open for the rest\nI went platinum three times, so how am I still in debt?\n700K on the first, 500 on the next\nWhen you sign a shitty deal fam\nWhat else do you expect?\nOi Stormzy you the guy now, I've always fucked with Skep'\nI writ my hardest 32 the first time I heard Wretch\nI ain't got a chip on my shoulder about who's the best\nBut I beg someone tell Drizzy I'm packing something fresh\nI got as far as I am from going HAM as I can\nSo for me going jail weren't really part of the plan\nI came a long way from getting chased down in that Megane\nSo imagine man like me, stuck in the can\nThey say I'm too hard headed, and one day I'm gonna learn\nNever thought I would be sat here selling signatures for burn\nOi Akhi are you listening?\nIt really don't matter about who you are on the outside or if your wrist is glistening\nIn here, you'll get hung up to dry for moving wet\nThe only time I'm talking shit, when I'm plugging up my tech\nAy so fuck the KG's you have, wrapped around your neck\nHere all that matters is the KG's you're pushing on your chest\nMy momma told me keep my head down, stay quiet\nHow the fuck's that gonna work when [?] got man on a diet?\nThinking now I'm at my lowest, life can only get better\nThem man run up in my cell and try leave holes in my sweater\nNow I'm here and I got a price on my head top, uh\nWell I'ma double that just get the pussy' head top\nFrom lobster and steak, to yam and noodles and tuna\nThursday's cantine, couldn't come any sooner\nSitting in my cell wishing that it could be way cooler\nNo charger for the tizzy so I can't even call you\nOi, get down and lay down\nI ain't come back to play around\nEven though I was excluded, this industry's still my playground", "year": "2017-07-30"}], "artist": "Dappy"}