{"songs": [{"year": null, "album": "Enigma", "image": "https://images.genius.com/482eea61300bdf72a62b443973fd7a5c.1000x1000x1.jpg", "title": "Whut’s Happenin’", "lyrics": "[Intro]\nNiggas can't hold me back\nWe ain't comin' for no bullshit\nNiggas talking all that yakkity-yak, word up\n\n[Verse 1]\nHere's to Mr. Keith Murray, the Mr. Pictionary\nThe Mr. Quick To Fuck Shit Up In a Hurry\nOn the mic I'll squash your little Ms. Philosophy\nWith atomic technological atrocity\nI find it very ironic that niggas try to rhyme behind me\nThe supersonic Def Squad MC\nGet a bird's eye view\nAnd don't miss the crispiest nigga in the nucleus\nWith futuristic linguistics\nBallistics be twisted like physics (word up)\nNiggas be like how you come up wit this shit\nBut it's automatic, I'm inorganic\nWith the ability to travel nine planets\nNiggas can't understand it\nPlease, I spark the brain of too many MCs\nI be more than gladly to take your G's\nWe could battle for car keys and car titles\nHouse deeds and bank accounts to make it final\nI got what you need\nThe most homicidal words to come out of a human being\nMind state sick like Idi Amin\n\n[Hook]\nYou can do what ya got to and say what you may\nBut niggas gonna come outside with gun play anyway\nSo I play the game and let the ball bounce where it may\nAnd roll with Def Squad and L.O.D. everyday\nYou can do what ya got to and say what you may\nBut niggas gonna come outside wit gun play anyway\nSo I play the game and let the ball bounce where it may\nAnd roll with Def Squad and L.O.D. everyday\n\n[Verse 2]\nAbracadabra talk shit I'll reach right out and grab ya\nThe hype got you like gimme, don't let it have ya\nI'll knock you skeezers pleasers black like Jesus\nNever lost in the jungle, navigators with Caesars\nInstead, dare iz a dark side said by Red\nI'm consciously, cruciously coming for your head\nI'm from a small coast called Stay Out My Path\nAnd from a big city called Foot Up in Your Ass\nJeepers, weepers, peepers, get snuffed\nBy the sneakiest, throughout the speakers like fisticuffs\nWho the fuck is this paging me?\nOh, it's my creepy, greepy, grimy\nRough rhyme, crime-y Reggie\nI'm saying, fuck who, went where, when, why and how\nGet my shit to me not now but right now\nLucky niggas went platinum thinkin' they can see us\nWe swoop down on crews like angels on dust\nI'll leave your mental so broke you can't pay attention\nWhen I get inside your head\nAnd take your brain to another dimension\nI'm itching for a scratch and somebody to try to match\nThe battle cats who constantly be on it like that\nThe doom has dawned in\nWe knockin' niggas out without warning and pissing on them\nThe configuration is brain cell-wastin'\nRenegades of funk like Afrika Bambataa and the Zulu Nation\nYou facin' a maniac, pacing over the track\nConstantly bringing drama like Jason\nIn fact, I'm L.O.D.ing it on go planet Def Squad\nPuttin' it down play for play like Ahmad Rashad\nFor the cause, I'm wiring jaws\nGot niggas eating four-course meals out of KrazySstraws\nAnd if it ain't def it ain't shit\nI'm taking it to the limit and killing it each and every minute\nCause Keith Murray takes the beef a major step higher\nAnd peacemakers will get caught in the cross fire\nHip-hop's filled with backstabbers, blunt grabbers\nCats with dirty claws, dogs with filthy paws\nThen you got rap artists, claimin' to be the hardest\nBust them in their shit and they're quick to press charges\nSpot rushers, block busters (word up)\nRockin' diamond clusters (ugh)\nComin' to stick the rich out you motherfuckers (yeah, yeah)\nEducated black man on premises\nL.O.D. and Def Squad forever, archnemesis\nAnd remember this\n\n[Chorus]\nYou can do what ya got to and say what you may\nBut niggas gonna come outside wit gun play anyway\nSo I play the game and let the ball bounce where it may\nAnd roll with Def Squad and L.O.D. everyday (Err-day)\nYou can do what ya got to and say what you may\nBut niggas gonna come outside wit gun play anyway\nSo I play the game and let the ball bounce where it may\nAnd roll with Def Squad and L.O.D. everyday"}], "artist": "Keith Murray"}