{"songs": [{"year": null, "image": "https://images.genius.com/8979e195a075754dfc6965f7356b0293.700x700x1.jpg", "title": "Respect It", "album": "Rapper’s Delight", "lyrics": "[Verse 1: Illa J]\nIt's Illa J, you better respect it\nNothing but excellence, you better expect it\nAbout to be the top cheddar collector\nI come hard, ladies love it better erected\nBout to star in my own movie, call it 'Balls of Steel'\nAnd I'mma get Quentin to direct it\nTarantino if you don't know the lingo\nI got King Dilla since Common got the new Primo\nI see you having nightmares but it ain't a dream no\nI'm the prince and the ladies love cream yo\nYou don't know what time it is like a Casino\nI'm tryna break Beatles' records like Cee-Lo\nThe renaissance man, know not to veto\nI love numbers, call me Mister Tino\nIlla J stack them chips like Fritos\nAnd you old emcees, go and play some bingo\n\n[Hook]\nWe about to take over, you better respect it\nGame time, break over, you better expect it\nWe eating dinner when you just getting your breakfast\nDo it with ease, we can make a hit in a second\nHardcore Hip Hop, you better respect it\nHardcore Hip Hop, you better respect it, uh\nWhat? What? What? What?\nWhat? What? What?\n\n[Verse 2: Rapper Big Pooh]\nMy mind is the tool, hard as the jewel\nThis rap shit is in me, call me the mule\nCall me a fool, I die for what I believe in\nFirmly planned and in this game I'm not leavin\nTis the season, to stop all you wack niggas\nAnd your breathin, you not eatin\nI'm not in peak and barely raising the decibels\nIt's my party, welcome all to the festival\nI turn your piece of career into a vegetable\nCelery, carrots? Nah, squashing duke\nI got the washer too\nBeen sick for so long caught walking flu\nI thought you fuckers knew, it's the Rapper Pooh\nYou better find out who I am nigga, get a clue\nI got a problem with your team, they can get it too\nYou wanna check a nigga record? I got a few\nI thought you niggas knew\n\n[Hook]\n\n[Verse 3: Bishop Lamont]\nThese skills are sharp, fangs sharp, jaw frames crush y'all lames\nSo who am I to vision a collision in the fast lane?\nTotal your vocal, leave you immobile while the octane\nHit the stage with nine just like Wu-Tang\nProtect Ya Neck, twist your spine, open house your brain\nNickname T-Pain, bullets sang\nTippin skit, flippin hit, dip and rip your whole game\nCoroner bag and zip, eulogy your name\nUsually I maintain but rappers talking insane\nScience class, two school niggas re-enact that big bang\nBlast, bloodbath, bathe in the lead rain\nI ain't playing games, spray the heat like we\nColdplay, rush your blood to the head, thoroughbred emcee\nNorth Cackalac, Cali and the D\nIlla J, Poobie, Lamont, who fuckin with we?\n\n[Hook]"}], "artist": "Rapper Big Pooh"}