{"songs": [{"image": "https://images.genius.com/2cbec7b745c109ceb67758132235acd9.600x600x1.jpg", "year": "1998-08-25", "title": "Nobody Sound Like Me", "album": "40 Days & 40 Nightz", "lyrics": "[Intro]\nInterviewer: If you saw you walking on a street and black man were comin' toward you, what would you be feeling?\nMan: Just one single black man? (Yeah) I really don't fear that. You know but if it's a group I'm talking from age thirty, even thirteen, even younger than thirteen. Yes I will walk across the street\nInterviewer: Well let me ask you this...\n\n[Chorus: Sample]\nI don't want niggas soundin' like me\nI don't want niggas soundin' like me knowhatI'msayin'?\nI don't want niggas soundin' like me knowhatI'msayin'?\n\n[Verse 1: Xzibit]\nYo we gettiin' restless me and D.O.G.s\nNever pretendin' rather we sendin' a very clear message\nEither you with me or against me punk hit 'em up\nProvide housin' for these shrimp from the shells we dump\nI'm makin' 'em bounce other niggas fail to bump\nTil we takin' advantage of inflicting irreversible damage\nIt's the long-awaited anticipated Likwit MC\nBombin' first cause I feel it's better to give then receive\nYou better believe\nXzibit stays savage above the average\nWhen niggas try to switch turn bitch for the cabbage\nBut see all that irrelevant it's like tryin' to turn a whore celibate\nI dance with the devil for the hell of it\nBurning down your lavish landscape on digital tape\nCause everything you rhymin' about is actually fake\nSo make room for the legitimate nasty inconsiderate\nThinkin' you rankin' top dollar but really counterfeit\n\n[Chorus: Sample]\nI don't want niggas soundin' like me\nI don't want niggas soundin' like me knowhatI'msayin'?\nI don't want niggas soundin' like me knowhatI'msayin'?\n\n[Verse 2: Montageone]\nNiggas we null and void I get swole like a keyloid\nTo overload your system with rhymes for millenniums\nTo shut down artists with beats the deep closure\nBattlin' top rank for bank and exposure\nSo open up your door to me Cause if it's closed\nI'm a brakin' in with some pantyhose\nOver the mic\nSo you don't know who I sound like\nExecuting those who record and bite to sound tight\nIt's not permitted by the right\nThe Gustopo surprising these niggas like Benny Blanco\nRemember me man? You thought I was a fan till I threw you in the back of a\nVan\nYo these Drop Squad delegates rhymes are delicate\nI spit on the mic to get these MC's pussys wet\nFor those with plans to clone me thee original\nIt can't be done I'm digital (digital)\n\n[Chorus: Sample]\nI don't want niggas soundin' like me\nI don't want niggas soundin' like me knowhatI'msayin'?\nI don't want niggas soundin' like me knowhatI'msayin'?\n\n[Verse 3: Xzibit]\nYo who wanna come see the hard rock?\nThe nonstop green block yo whole block receive speed knot\nYou need not\nGet brave my bullets never graze\nThey hit close to home separating flesh from bone\nSo better get off on your own bitch\nRollin' chrome shit tryin' to own shit\nI was molded, after the best that the streets had to offer\nThe author of my own destiny\nSo I suggest you stop stressin' me\nI'll find out when I pull my nine out and blow your mind out\nPlay a deadly game with no fouls and no timeouts\nInhale large amounts of dojah forever ready like a soldier\nI'm lock mode and shoot from the shoulder\nAnd burn down your lavish landscape digital tape\nCause everything you rhyme about is actually fake\nSo make room for the legitimate nasty inconsiderate\nThinkin' you rankin' top dollar but really counterfeit\n\n[Chorus: Sample]\nI don't want niggas soundin' like me\nI don't want niggas soundin' like me knowhatI'msayin'?\nI don't want niggas soundin' like me knowhatI'msayin'?\n\n[Outro]\nI don't want niggas soundin' like me. On no album"}], "artist": "Xzibit"}