{"songs": [{"year": "2015-11-13", "album": "Next Step", "image": "https://images.genius.com/623f415517090669819e4d39e8a4e309.600x600x1.jpg", "title": "Paranoid", "lyrics": "[Hook: John Andrew]\nI'm feeling the pressure, there's nowhere to go\nNobody knows that I'm 'bout to explode\nAnd it's all in my head\nSomebody help me, I feel all alone\nNobody knows that I'm losing control\nAnd it's all in my head, in my head\n\n[Verse 1: Kerser]\nAll in my head, paranoid\nDrop a couple pills and I'm mad annoyed\nCan't believe I got myself bad destroyed\nTrying to beat life, I don't have a choice\nSitting up late every night I try fly by\nWonder why but I can't deny\nI'm kinda lost and it's fucked, I'm famous\nBut it's what I wanted and I'm not just saying it\nGo back and take a listen when I started this\nAll I ever wanted was a part in this\nThen I went past every other artist\nThen I got a habit and it's fucked 'cause now I feel like a target\nEveryday I wake up I feel like my heart ache\nDunno what to do I just wanna restart it\nNever would of rapped if I knew this was the outcome\nGoin' in public feels like I'm having anxiety attacks\nAnd I try to relax nut, I'm hiding the facts\nThat there's a knife in my dacks\nParanoid yeah, at the worst of times\nI spill my whole life when Kerser rhymes\nAnd when Scott raps he falls apart\nI make real rap, don't call it art\nThey may feel that I'm torn apart\nIf it's all in my head then I'ma follow my heart\n\n[Hook: John Andrew]\nI'm feeling the pressure, there's nowhere to go\nNobody knows that I'm 'bout to explode\nAnd it's all in my head\nSomebody help me, I feel all alone\nNobody knows that I'm losing control\nAnd it's all in my head, in my head\n\n[Verse 2: Kerser]\nAll in my head and I need to escape\nFeeling locked in, need keys to the gate\nI don't ever wanna go back to the old me\nThink before you say it what a smart man told me\nI never did though always on my shit bro\nDropping hot rhymes and my mind is Skitzo\nShit no, am I losing track?\nWhen I used to roam the street, I got used to that\nNot used to fame, it fucked my head\nI blame the fame when I'm dumping meds\n'Cause it's fucked me up and I know the facts\nYou can write that down and you can quote me lad\nSomebody help 'cause I feel alone\nEven at home don't feel at home\nBout to explode on the verge of this\nMusic weighing up all the perks of this\nIs it worth the shit? Well, the cash is nice\nBut I work so hard for the lavish life\nEveryone got to say at the end of the day\nThat you breaking my trust is the end of the day\nDon't mention my name in a negative tone\n'Cause I'm paranoid probably get ya dead from my phone\nOn the way home and the pressure hits\nPop another pill now I'm swept to bits\n\n[Hook: John Andrew]\nI'm feeling the pressure, there's nowhere to go\nNobody knows that I'm 'bout to explode\nAnd it's all in my head\nSomebody help me, I feel all alone\nNobody knows that I'm losing control\nAnd it's all in my head, in my head\n\n[Bridge: Kerser]\nI cannot move no more\nI cannot move no more\nWhy am I on the floor?\nWhy am I on the floor?\nI cannot move no more\nI cannot move no more\nWhy am I on the floor?\nWhy am I on the floor?\n\n[Hook: John Andrew]\nI'm feeling the pressure, there's nowhere to go\nNobody knows that I'm 'bout to explode\nAnd it's all in my head\nSomebody help me, I feel all alone\nNobody knows that I'm losing control\nAnd it's all in my head, in my head"}], "artist": "Kerser"}