{"songs": [{"image": "https://images.genius.com/85aa08489d0d5e8aada5e0ac39885102.500x500x1.jpg", "album": "Soundcloud Releases", "title": "Shook Ones (Freestyle)", "lyrics": "[Intro]\nAye, it's Dame D.O.L.L.A\nLook, listen\nHa, we back at it, man\nAye, look\n\n[Verse 2: Dame D.O.L.L.A.]\nLast of a dying breed and they taking me for granted\nI represent the ones working for it, nothing handed\nThe world is all backwards, how we lazy and demending?\nWe ain't working towards dreams, we just working towards mansions\nAnd the money is the root of all evil\nHow easy they deceive you?\nLately I've been feeling bad for my people\n'Cause our act game cold, but real life slacking\nIt's raining outside, but we ain't even wearing jackets\nStill wet behind the ears, running from the facts\nWe don't wanna be statistics, but we adding to the stats\nTry to stay 'way from typical, further from hypocritical\nCautious of your circle, for growing it's really pivotal\nA lot of pride in my upbringing, in church I was up singing\nMy momma starring at me, that's one reason I gotta thank my fam and I felt ya'\nAnd even back then I was never feeling sheltered\nI see my people struggle and they still don't ask for nothing\nWe always gon' keep it solid, I know when the times are toughest\nI know when they gon' be fine and, I know when to give 'em something\nDon't ever try to finesse me, I know when a sucker bluffing\nSmall circle, man, it's hard to get close to me\nI stick to who I am and not who I'm supposed to be\nI never say much, they might say I'm awkward socially\nYour girl Ms. Parker and I'm Professor Oglevee\nSo, y'all see one thing, the women see another\nYou see a baller-rapper not an educated hustler\nTo keep it real, I was fathered for the money and the fame\nYou a cornball now if you was corny when you came\nI'm giving game for the clueless and the lost souls\nThis'll be the map for y'all on lost roads\nWords from a frog to all of y'all toads\nI'm the new definition of all of y'all goals\n\n[Outro]\nHello\nDame D.O.L.L.A", "year": "2016-06-13"}], "artist": "Dame D.O.L.L.A."}