{"songs": [{"year": null, "image": "https://images.genius.com/306441a47d61f6f0573172b900c3387e.350x350x1.jpg", "title": "Do Your Thing", "album": null, "lyrics": "[Biz + P. Diddy]\nAnd you don't stop\nAnd you can't stop\n\n[P. Diddy] Yeah, yeah - I like this\n\n[B-I-Z] If you\n[Diddy] If you\n[B-I-Z] Wanna know\n[Diddy] Wanna know\n[B-I-Z] The real deal, about the Biz\n[Diddy] A-say what, a-say what?\n[B-I-Z] Well I'm the Biz Markie\n[Diddy] And I'm the P. Diddy\n[B-I-Z] So you know what time it is\n[Diddy] A-come on\n[B-I-Z] If you\n[Diddy] If you\n[B-I-Z] Wanna know\n[Diddy] Wanna know\n[B-I-Z] The real deal, about the Biz\n[Diddy] A-say what?\n[Diddy] And that's comin from me, the P. Diddy\n[Diddy] And you know what time it is, RIGHHHT\n\n[P. Diddy]\nSo come on Diabolical\nDon't stop and don't you dare quit\nJust get on the mic, sit on the mic\nSpit on the mic and don't you dare quit!\n\n[Biz Markie]\nWhen I get on the mic, I guarantee\nThere's no better MC than Biz Markie\nEverything I say, or anything I do\nWill move yo' posse or your crew\nWhen you me hear me say, and what I play\nAffects a lot of people in the strangest way\nWell I'm too cold to freeze, too hot to burn\nAnd I never miss a tag when it's my turn\nCause I can, rock the mic if you give me a chance\nCool V'll cut the record, make you do the 'Biz Dance'\nI can - flip the crowd with a wave of my hand\nI'm the Diabolical, \"And you know this MAAAAAAN!\"\n\n[Hook]\nYou can do your thang, and any-thang you choose\nBut please, please, leave my thang alone\nYou can do your thang, and any-thang you choose\nBut please, please, leave my thang alone\n\n[Biz Markie]\nI'm the court jester, the manifester\nI used to buy my clothes at A.J. Lester's\nThe rhymerator, the beat creator\nWhack rappers get dropped like a hot potato\nThe dime repeater, the MC greeter\nKnuckle bleeder, no need for a heater\nThe only MC in history\nWho didn't even have to R-A-P\nThe bum destroyer, I'm comin for ya\nGot took to court and didn't need a lawyer\nMake James Brown get down (yeah yeah)\nMade Beretta go get her (yeah yeah)\nMade Laverne and Bill Cosby (yeah yeah)\nGo change they sweaters (yeah yeah)\nI fought Mike Tyson, dropped him in 4\nWent to Fort Knox and kicked down the door\nRocked seven continents with all this flow\n\"And this is somethin for the radi-ohhhh\"\n\n[Hook]\n\n[Biz Markie]\nGot ladies screamin STRANJE STRANJE\nWith the rhythm and rhymes and style that I display\nIf rap was sex, I'd be a porno star\nWith Sade, and Janet, in a menage-a-trois\nMerrily merrily, life is just a dream-ah\nFirst car, I ever had was a Beamer\nFirst girl, I ever had was a screamer\nI got out of breath and almost caught emphysema\nPut the party people in a state of shock\nWhile Biz compose songs like Sebastian Bach\nThis is the end of this scenario\nLike Robin Harris, \"I gotta go - gotta go!\"\n\n[Hook] - repeat 2X w/ ad libs\n\n[Sung ad libs before a quick fadeout]"}], "artist": "Biz Markie"}