{"artist": "WC", "songs": [{"year": "1998-04-28", "lyrics": "[Intro: Daz Dillinger + WC]\nClown, muthafucka, clown\nYeah (“Check it out y’all”)\nBack in your muthafuckin’ ass once more (“Check it out y’all”)\nDub-C, CJ Mac, and Ice Cube, and diggy Daz knocking down your door\nCrazy Toones, what’s happening? Yeah, break it down like that\nShow these niggas where their heart at\nShow these niggas where heart\n\n[Crazy Toones scratching]\n(“That’s right”) (“Here I come”) (“Mad muthafuckin’ CM Mac”)\n(“Here I come”) (“Mad muthafuckin’ CJ Mac”)\n(“That’s right”)(“Here I come”)(“Mad muthafuckin’ CJ Mac”)\n(“It’s like that y’all, it’s like that y’all…it’s like that-uh-that-that”)\n(“Like that y’all, it’s like that y’all...”)(“And it goes a little something like this”)\n\n[Verse 1: CJ Mac]\n10 years ago, a friend of mine\nGave me a half a chicken, told me, “Hoodsta, go grind”\nBought a half a gallon, beaker, and a pound of pro\nSwear to God you niggas never see me short no more\nFrom the Southern Cali alleyways to birds in Virginia\nMr. Woo swoop the coupe on dubs, I ain’t bullshittin’\nFlossy flossy, you droppin’ carachi\nI got china white, now what you set like?\nBling, look at my wrist, you see my diamonds done blinking\nOne stone, 7-karat ring, nigga\nCJ Mac, I swerve Impalas, spend dollars, and floss jewels\nI’m on Cristal, bust a pistol, first boss move\nYou niggas hate me, but give me respect\nAnd love head, known to keep a bitch taco naked\nPunk biatch, I fuck ‘em if she’s stealing me clothes\nFuck a misdemeanor bitch and fuck with felony hoes\n\n[Verse 2: Daz Dillinger]\nNow all of y’all are OG’s\nAll my real niggas roll with these\nWe got something vicious up our sleeves\nMaking niggas bleed dead in the street\nFor what you claim for the rep and the name\nGet looney insane, we tie ‘em to the brain\nMotto of Tha Gang: “We blast and maintain”\nWe got fame, status for flying, giving niggas static\nMaking their muthafuckin’ hearts so panicked\nWe back, Cube, Dub, CJ Mac\nTrue indeed riders, punk, we Westsiders\nNo other can divide us, make the barrel blow my fire\nMaking all these sucker ass niggas run and expire\nLike that, what it is, my opponents get shut ‘til the end\nThat’s how it is\n\n[Interlude: Ice Cube]\nSupreme gangsta shit\nWe dream gangsta shit\nSupreme gangsta shit\nWe dream gangsta shit\n\n[Crazy Toones scratching]\n(“Ice Cube…back up in this B-I-itch”)\n\n[Verse 3: Ice Cube]\nThe mega don, uh-huh, the episode\nScrillions is what a nigga fold\nWe meant it, rollin’ in tinted, the authentic\nGhetto scented, we invented, highly recommended\nGo independent, and defend it\nAin’t scared to throw up my dub and represent it (Westside)\nIt’s Beretta and Mister Mo’ Cheddar\nLet Ice Cube rhyme last, niggas know better\nSee me in this godfather, you better tuck your tail\nFuck a bitch dreams, niggas waiting too in hell\nTake a photo, niggas know, though\nIce Cube went from Soul-Glo to a fuckin’ mogul\nBet your hoe know we’s in town, fresh off Con-Air\nGave a concierge cab fare, pullin’ hair, slappin’ titties\nGiving her shitties to new jack cities\nDelectable, rich and pretty\n\n[Crazy Toones scratching]\n(“Like that y’all, it’s like that y’all…it’s like that-uh-that-that”)\n(“Like that y’all, it’s like that y’all, it’s like that-uh-that-that, it’s like that y’all”)\n(“Dub-C…back up in this B-I-itch”)\n\n[Verse 4: WC]\nNow what in the fuck is this? C. Mac, Cube, Daz\nHow would the fuck I look letting y’all clown without me riding with y’all ass?\nTake it up outta the Cadillac, hittin’ front and back\nTalking shit on rings, tattoos and golf hats\nLast year was Curb Servin’, this year I’m counting stacks\nWith the don, the Dillinger, me the killer, my nigga C. Mac blown off ‘gnac\nStrictly G’s, bitch, no fleas in my clique\nJust niggas in colored beanies with that 7-digit itch\nKeep it rich, ‘cause gangsta rap shit, nigga, I’m in love with it\nStuck with it; if it ain’t that gangsta shit, I can’t fuck with it\nSince the days of Funkadelic, I’ve been giving it up\nCreasing these khakis, folding the tongue on these Chucks\nThey say G’s keep the world spinning—well, if that’s true\nPicture me spinning the globe on my middle finger like Meadowlark Lemon\nFuck the world, I’m through with you bustas in ‘98\nGive me the pussy, the money, and the mic and I’m straight\n\n[Crazy Toones scratching]\n(“Like that y’all…it’s like that y’all…it’s like that-uh-that-that, it’s like that y’all”)\n(“Like that y’all, it’s like that y’all, it’s like that-uh-that-that, it’s like that y’all”)", "image": "https://images.genius.com/e3cb3b767a7c4236e1df057692fb01b0.402x400x1.jpg", "album": "The Shadiest One", "title": "Like That"}]}