{"artist": "C-Rayz Walz", "songs": [{"title": "Black Soap", "album": "Year of the Beast", "year": "2005-05-17", "image": "https://images.genius.com/566d299c2471c83ab1595731e9242047.1000x1000x1.jpg", "lyrics": "C-Rayz Walz ft. M1 - “Black Soap”\n[Emcee(s): C-Rayz Walz and M1]\n[Producer(s): Djibril Toure (of The Welfare Poets) and Jamaki Knight (of The Welfare Poets)]\n\n[Intro: C-Rayz Walz]\nSo I remember this brother used to teach me 52 Blocks and steel arms and everything and, one time, I was in his house and I seen these blue bottles... like, this white substance powder and I had to overlay shit with my moms.  So I told her, like, “Yo, moms.  Sensei had these bottles up.”  We suddenly had a conversation.  Later, she tell me, “Hey, that was crack!”\n\n[Hook: C-Rayz Walz and M1] (x2)\nOils, incense, black soap, crack, dope\nGotta have a hustle to stack that dough.  Every-\n-body can’t rap, yo.  That’s a fact, so\nSome of us still caught up in the hassle\n\n[Verse 1: C-Rayz Walz]\nYo, we used\nTo sell mangos, straw hats, and coconuts.  Now we\nIn America with no stores to open up.  Dope\nIn lust.  You could even see The Beast approaching us, set\nTo eat the heart of the meat like sweet kosher cuts.  Peep\nThe autobiographic havoc.  Flashback\nTo past.  I used to pack bags for cash, kid\nUsed all the change for video games.  Thinking\n“Long Range” now—my scenario changed.  Rites\nOf passage, the civilizing savage.  I a-\n-dapted to this and embraced balance.  Fear of\nA black planet (Word?) and black economy.  I tried to\nGet jobs, but my sideburns were stopping me.  Am I too\nStrong-looking?  Hmm.  I used to wonder.  Or is it\nThe digits of my social security number?  Stuck\nIn the cold, some just lick the blade and en-\n-joy the taste of cold blood like Kool-Aid, and if you\nTrue paid, that’s news to me\nIt’s bigger than your car and your jewel-e-ry.  My life\nAin’t a beach with babes like Baywatch.  I try to\nSell socks and dodge stray shots, but gay\nCops want to stick my ass and blast, snatch my\nOils and leave my table smashed.  We take\nCrew flicks, move swift.  New kicks stay butter.  Dry\nSkin soul.  The cold streets is shea butter.  Slick\nKids say, “Gutter,” but mean “tribal,” going out\nLike hunters by all means of survival, and if the\nNoose around your throat got you moody and broke, then you\nKnow why we all pump “Peruvian Coke,” ‘cause, more or\nLess, we all get less than more, and, at the\nChorus, moral-less to test the poor for\n\n[Hook: C-Rayz Walz and M1] (x2)\nOils, incense, black soap, crack, dope\nGotta have a hustle to stack that dough.  Every-\n-body can’t rap, yo.  That’s a fact, so\nSome of us still caught up in the hassle\n\n[Verse 2: M1]\nYo, when they\nCome with the hassle, we come with the hustle and work the\nMoney muscle like Marcus Garvey building an army.  When they\nCome with the okie doke, I’ll pull out the pokey poke\nAnd let ‘em know they really don’t want me to lokey loc\nAnd if it’s the flim-flam shit, man, I been ran\nThat.  Old-school like a trickling track, see? ‘Cause\nEither you give or take.  Get it straight.  And I felt the\nSame damn way since ’88.  It was high\nSchool, the boys’ locker room.  Hustling hard, didn’t\nKnow drug-dealing was a government job.  And to\nTop it off, instead of collecting for unemployment\nLocked in a six-by-nine is where my boys went\nAfter the Bose, Polos, and fake gold.  Damn\nIt’s a shame how my money was blown.  Only\nKnew a few ballers and hustlers who ever stacked it\nWings, you know.  Money, I’ll show you just what that crack did: it\nWasn’t attractive.  Mom blocked up, aunt\nCracked out, hood on self-destruct, ‘cause a\nIllegal business controls America\nThey’re hypocrites—just look what they’re selling ya\nEverywhere you go, got that chronic or dro or the\nEcstasy, and I know you heard this before, ‘cause, uh\nMy favorite rappers be slinging right on the radio\nY’all don’t give a fuck.  They’ll do you—that’s what they pay your for\n\n[Hook: C-Rayz Walz and M1] (x2)\nOils, incense, black soap, crack, dope\nGotta have a hustle to stack that dough.  Every-\n-body can’t rap, yo.  That’s a fact, so\nSome of us still caught up in the hassle"}]}