{"artist": "3rd Bass", "songs": [{"lyrics": "[MC Serch]\nAiyyo Prince Paul, is this a Gas Face lyrical remix?\n\n[Prince Paul]\nYes indeed Serch\nAnd it goes a little umm-ah, somethin like this..\n\nVerse One: Pete Nice\n\nGas, past tense, made facially\n3rd Bass'll express, KMD\nThree blind mice on sight\nZev Lover, gave it the first light\nSo I revise on remix\nSwing super unleaded on my gas dick\nKicks em in the grill, for non-believers\nI leave em speechless, backstab deceivers\nSub Roc cut Serch with the clipper\nI change oil, I unzip my zipper\nA riff of Aretha, a face of saliva\nDon't gas the 3rd, the 3rd is liver\nAnd try your luck, but your ass got waxed\nSo all negative vibes got axed\nI beg to differ, I cleanse my system\nAnother victim, the Gas Face I give em\n\n\"Oh shit.. oh shit.. oh shit.. oh shit..\"\n\n(MC Serch)\n\nVerse Two: MC Serch\n\nBlack cat is bad luck, bad guys wear black\nMusta been a white guy who started all that\n(Make the Gas Face!) For those souped up supremicsts\nCan't forget about the cocaine chemist\nThat made crack a household name\nSilence for Yusef Hawkins being slain\nLamebrains, who can't accept us equal\nBlack and white, wrong or right we're all people\nTrying for better days, to let our kids see some\nTenement Square, people fightin for freedom\nBeijing students fought armies with guns and knives\nAt Kent State, they took four lives\nNelson Mandela's not free\nCause he can't even vote in his own country\nOne day these problems will scatter\nCan't you see the Gas Face is no laughing matter?\n\"Oh shit!\"\n\n[MC Serch]\nThere it is for ninety-one ninety-two ninety-three\n\n[Prince Paul]\nYo whassup whassup whassup\n\n[MC Serch]\nYo Prince Paul who we givin the Gas Face too now G?\n\n[Prince Paul]\nYo we givin the Gas Face to, Jerome Williker, of the Bronx\n\n*laughter*\n\n[MC Serch]\nYe-yeah! Hey yo no Gas Face for Chantelle\nNo Gas Face for the Brooklyn-Queens\nConnecticut Long Island New Jersey Strong Island posse\nNone of them get the Gas Face\n\n[Prince Paul]\nCause we love everyone! {*laughter*}\nStupid man, y'all sick (\"oh shit!\")\n\n[MC Serch]\nYeah we sick but we out too, peace", "image": "https://images.genius.com/66b094b3f4ff3a3de57feb7e3b9816d8.300x300x1.jpg", "album": "The Cactus Revisited", "title": "The Gas Face (Remix)", "year": null}]}