{"songs": [{"album": "Hood Politics 7", "image": "https://images.genius.com/28931b3714ee0d34fe4138002fb9cb51.500x500x1.jpg", "year": null, "title": "Up Against The Wall", "lyrics": "[Verse 1:]\nKnow who you dealing with? Guess you could say I'm feeling it\n'Cause I don't know where I am or who these people I'm chillin with\nSo shake shake it up, shit I finna make a cup\nBut something so stronger than the morning, I ain't waking up\nMan if they know me they know snuck or get bizz\nIf this the light in front of my tunnel it must be the fridge\nI'm a alcoholic, on toilets I shit blood\nSo it's gon take a little more for me to get buzzed\nYou say I got a problem, I say I got a problem\nFollow me now and sip the bottle til it rip the bottom\nDon't get us started baby, we know what we doin\nThey call my spot forgot and that's where we keep the brew in\nYea, and I keep drinkin like a fish\nAnd I ain't quitin, I be sippin til I'm pissin in the kitchen\nAnd I take a last sip and I can't swallow the rest\nAnd now I'm up against the wall, I pass the bottle to Rex\n\nUh, fuck man\n\n[Verse 2:]\nTipsy once, now pissy drunk\nThe whole room spinnin, why I took this Henny from snap\nST a fair, then it's the aroma of skunk\nI'm stuck watchin this bitch rollin a blunt\nI can't feel my face, this a party or what?\nParty it up, swallowin from bottomless cup\nI don't feel good, gotta throw up\nTurn spazzin in my ear like dog ra ra\nFuck you niggas, when did all these broads show up?\nAin't a party less everybody covered in sluts\nRunnin em up, liquor I love, shit is a must\nGrab the up like listen, is you crushin or what?\nJust touch the point of pas out, blackout status\nSurrounded by bottles and profilactic rappers\nHow did I get here? Only concern\nLet me think on it as I pass the bottle to turn\n\n[Verse 3:]\nGirl you the worse, tryna pass that bottle to me\nSon I wouldn't take that bottle if that bottle was free\nThat's all backwash, plus I got a fresh one in my bag\nWent we done with this, we all gon need a cab\nI got a white girl sniffin in your kitchen\nAnd both of her girls with it, we could go hit up this mission\nAnother Saturday I'm missin, wifey probably briefing\nBlowing up my phone but I ain't tryna listen\nI'm just up against the wall, feelin extra wavy\nMan, this house party's extra crazy\nSeen a cat throwin up in yo bathroom sink\nFallin over, maybe I should snatch his link\nYo T chill, there's somebody knockin at the door\nLet me step over this body that's passed out on the floor\nAs I open up the door, pigs in my face\nNow I can't finish the bottle cause the bottle's with J, damn"}], "artist": "Termanology"}