{"songs": [{"album": "KOD", "year": "2018-04-20", "title": "BRACKETS", "image": "https://images.genius.com/5cdf2147b92170e674f6809e259cc36f.440x440x1.jpg", "lyrics": "[Intro: Richard Pryor]\nLotta shit happens, like, being in show business\nA lot of shit happens, like, like, I make a lot of money, you know\nAnd I'm really happy about it\nAnd I'm not bragging, I just wanna say something\nI make a so—fuck, it's ridiculous\nBut wait, wait a minute, wait a minute\nHey, if my father was alive today, I would go home and say\n\"Dad, I wanna tell you how much money I made\"\nYou know what he'd say? \"You's a lying motherfucker\nJoe Louis didn't make that much money\nCome in here, get your ass out the house\nComing here with that bullshit,\" hah\n\n[Verse 1]\nNiggas hating on me, I ain't used to that\nKnow a couple people wanna shoot for that\nI say \"No, no, no, chill, it ain't no need for that\"\nThem niggas tryna blow and ain't need me for that\nAnd if it work for them, well shit, I'm cool with that\n'Cause how they feel, I ain't got shit to do with that\nI just sit back on cool and watch my paper stack\nAnd trip off how much bread them crackers take from that\n\n[Chorus]\n(Whoa whoa whoa whoa, yeah, yeah, yeah, yeah)\n(Whoa whoa whoa whoa, yeah, yeah, yeah, yeah)\n(Whoa whoa whoa whoa, yeah, yeah, yeah, yeah)\n(Whoa whoa whoa whoa, yeah, yeah, yeah, yeah)\n\n[Bridge]\nIt's been a long time since I have felt this way\nAbout something but now, but now\nI'm controlling my mind, the days are warm\nThe nights are cold, the lost is found, I'm found\nLord knows I need something to fill this void\nLord knows I need something to fill this void\nLord knows I need something to fill this void\nLord knows I need something to fill this void\n\n[Interlude]\nHell yeah boy, I'm a goddamn millionaire now\nHell yeah, nigga, they can't tell me shit now, bro, hell no, fuck that\nBitch, got my first motherfuckin' million dollar check nigga\nI'm goddamn lit boy, you crazy as hell\nHold up, it's my phone real quick, it's my Unc'\nUncle Sam and shit\n\"What's up Unc'? Yup. Hey, I told you that check was coming in, I gotchu when it came in. Goddamn, I'm a man of my word. Goddamn, I told you I'ma have it, and goddamn, I'ma have it for you. Hell, shit, damn right. Now, how much was it though? Uh huh. Huh? Half? Half nigga? You crazy, boy, you crazy. Bitch, you crazy as fuck. Bitch, bitch, you better suck half my dick!\n\n[Verse 2]\nYeah, I pay taxes, so much taxes, shit don't make sense\nWhere do my dollars go? You see lately, I ain't been convinced\nI guess they say my dollars supposed to build roads and schools\nBut my niggas barely graduate, they ain't got the tools\nMaybe 'cause the tax dollars that I make sure I send\nGet spent hirin' some teachers that don't look like them\nAnd the curriculum be tricking them, them dollars I spend\nGot us learning about the heroes with the whitest of skin\nOne thing about the men that's controlling the pen\nThat write history, they always seem to white-out they sins\nMaybe we'll never see a black man in the White House again\nI'll write a check to the IRS, my pockets get slim\nDamn, do I even have a say 'bout where it's goin'?\nSome older nigga told me to start votin'\nI said \"Democracy is too fuckin' slow\"\nIf I'm givin' y'all this hard-earned bread, I wanna know\nBetter yet, let me decide, bitch, it's 2018\nLet me pick the things I'm funding from an app on my screen\nBetter that than letting wack congressman I've never seen\nDictate where my money go, straight into the palms of some Money-hungry company that make guns that circulate the country And then wind up in my hood, making bloody clothes\nStray bullet hit a young boy with a snotty nose\nFrom the concrete, he was prolly rose\nNow his body froze and nobody knows what to tell his mother\nHe did good at the white man schools unlike his brother\nWho was lost in the streets all day, not using rubbers\nSo right now, he got two on the way\nStill sleep on covers in his mama house\nShe can't take this shit no more, she want him out\nOn the morning of the funeral, just as she's walking out\nWiping tears away, grabbing her keys and sunglasses\nShe remember that she gotta file her taxes, damn\n\n[Chorus]\n(Whoa whoa whoa whoa, yeah, yeah, yeah, yeah)\n(Whoa whoa whoa whoa, yeah, yeah, yeah, yeah)\n(Whoa whoa whoa whoa, yeah, yeah, yeah, yeah)\n(Whoa whoa whoa whoa, yeah, yeah, yeah, yeah)"}], "artist": "J. Cole"}