{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": "2013-04-30", "lyrics": "[Intro: Brother Ali]\nSaid they just don't make 'em like this no more\nIn fact they never made 'em like this before\nI'm 'bout the baddest man that ya eyes done saw\nBaby, I'm down by law\n\n[Chorus: The Notorious B.I.G.]\nDangerous\nDangerous\nDangerous\n\n[Verse 1: Brother Ali]\nLife gave me nothing free, but my ugly\nAss mug and a couple of fat nuts to squeeze\nDick dangling down in my dungarees\nHungry beast, I'll chase your ass up a tree\nYou know what's up with me, I'm sucker-free\nNot uptown or uppity, it's not my cup of tea\nFeared one in the streets, won't nothing bleed\nExcept my knuckle meat, caught up in your fucking teeth\nBrother, please, I'm out here rhyming for survival\nPlus I got a outta-body-mind-blowing live show\nSquad of fine dimes follow me wherever I go\nGot them on their knees trying to honor my arrival\nQuick Draw McGraw, this mic of mine\nI'm a prime time prido, down by lidaw\nBroke dick, big dog. Who the hell am I?\nThe A, the L, the I, and I'm the God damn shit, y'all\n\n[Chorus: The Notorious B.I.G.]\nDangerous\nDangerous\nDangerous\nDangerous\nDangerous\nDangerous\nYou should see me swing the jimmy\n\n[Verse 2: R.A. The Rugged Man]\nDon't get me started, I'm golden era, '88 baby highly regarded\nI get stupid, dookie, doo-doo, def, dumb, retarded\nWatch you fade like a high top when I drop, leave you flattened like a\nPancake at IHOP, with a pistol I'm a nice shot\nMany battles are losable, losing isn't unusual\nLife is brutal, but beautiful, birth allude to a funeral\nI'm straight raw, cocaine natural, you that flesh-eating\nVeterinarian drug used to de-worm cattle\nThe same way Big flipped mics I'mma show you how I run things\nI'm the Don: Corleone, Cornelius, Trump, King\nIs the world yours or mine? I'm an immortal in his prime, structure doesn't\nFollow the corporate design, I'm snapping your porcelain spine\nToo deep for the mortal mind every time I'm recording a rhyme\nThey find that I'm crossing the line if you're blind and ignoring the grind\nIt's sickening, ain't a chick alive I won't stick my dick in\nI'm more shameless than Hammer dancing for popcorn chicken\nAce was the ink before Irv Gotti was laundering loot\nAnd he dropped Slaughtahouse before they was ever forming a group\nFuck being miserable, whether it's the mental or in the flesh physical\nBlessed are the poor in spirit, yeah, I took it Biblical, I'm so\nDangerous\n\n[Chorus: The Notorious B.I.G.]\nDangerous\nDangerous\nDangerous\nDangerous\nDangerous\nDangerous\nYou should see me swing the jimmy\n\n[Verse 3: Masta Ace]\nWhen this mic's in my hand I'm a cannibal man\nEat my own kind, damn, I'm an animal, fam\nAnd if you a grown man then stand if you can\nOn your own two feet with a tangible plan\nNow my plan's ripping them all, never fall\nAnd achieve all goals like I'm kicking a ball\nLike taking out your dick in the mall, want everyone\nTo see that it's me and I'm sicker than y'all\nAnd this track's like a brick in the jaw, a bat to the head\nGo ahead, get back in the bed\nKeep sleeping, I'll be the nightmare of your dreams\nSpit right, the flow's tight like a pair of your jeans\nTake those off, y'all dudes feminine style\nSo foul, meanwhile, men, women, and child\nPraise me, the epitome of the best\nDeadly like three in the chest, dangerous\n\n[Chorus: The Notorious B.I.G.]\nDangerous\nDangerous\nDangerous\nDangerous\nDangerous\nDangerous\nYou should see me swing the jimmy", "title": "The Dangerous Three", "image": "https://images.genius.com/c839ae29cd32413eb20a1c6585d7d604.1000x1000x1.jpg"}]}