{"songs": [{"image": "https://images.genius.com/f7d42d0db13086f046e08faacf066ef0.500x500x1.jpg", "year": null, "lyrics": "(Ladies and gentlemen!) (gentlemen)\n(\"brother of, brother of a pitch, brother who start\")\n\n[Intro - Rapper Big Pooh - talking] - w/ ad libs\nBoston to N.C. collabo\nAkrobatik, (yes, yes) Little Brother (yes, yes)\nAkrobatik 'bout to set it off (set it off) (UH!)\nPhonte 'bout to set it off (set it off) (UH!)\nRapper Pooh 'bout to set it off (set it off) (UH! UH!)\nAnd 9th Wonder 'bout to set it off (UH! UH!)\n\n[Verse 1 - Rapper Big Pooh]\nHey yo, this whole shit's kind of funny\nWent from who got the props, to nigga I got money\nEverybody reachin in the same pot of honey\nScramble in the streets, but your eggs look runny\nSunny, I excel you can't tell\nVeil my brim to those before him\nSwim with the fishes, wish for a better year\nI'm no shuck but life I spear\nThe people outside my life, they cheer\nI've been peepin y'all my whole career\nWhen the road get tough, curve out, two hands I steer\nWant to see how life look from a pier\nIt appears that all my niggas know how it look down here\nGo hard, just don't play fair\nI displace tears, put 'em in every word I rap\nLook ahead, ain't no takin it back\nIt's like that nigga\n\n[Hook] - w/ ad libs\n[Akrobatik]\nNow when you see Ak be prepared for the flow (flow)\n\n{Rapper Big Pooh]\nWhen you see Big Pooh it's the knockout blow\n\n[All]\nAnd when you see Phonte watch out for big dough\nJust a PSA to let y'all know\n\n[Akrobatik]\nYou gotta be prepared ... (are you ready to make your mark?)\nYou gotta be prepared ... (are you ready to move with speed?)\nYou know you gotta be prepared ... (are you ready to take the lead?)\nLead, yes, my brother, yes indeed\n\n[Verse 2 - Akrobatik]\nCheck it out, this whole rap shit is kind of blurry (uh)\nIt's not quite the same as the days of Hit Squad and Keith Murray\nNowadays rappers come through with a brief flurry\nBut yo it ain't really no need to worry\nCause you listenin to flows from the heavens\nI don't drive but always hear Ak your a legend/Acura Legend\nMy response - \"I'm workin hard, servin my fans and servin God\"\nThe key to makin it in this rap game is simply learn the odds\nWhen I did, I became a business man\nNot a whole industry like \"yo, who is this man?\" (huh)\nLittle Bro and Akro, you know who they are\nCats gettin money since niggas was off the radar (yep)\nStart the world tour put the 'net in a frenzy\nPackin New York City spots on Wednesdays\nAlways stay prolific, keep the concepts specific\nNow we the niggas that settin all the trends, hey\n\n[Hook]\n\n[Verse 3 - Phonte]\nIt's funny how niggas get props for their grind\nInstead of the time they invested in they rhymes\nI think we got it twisted, got it all wrong\nThe cart before the horse, the tail waggin the dog\nPeople taggin along to each and every song\nThat's dumb enough to get the people all on they feet\nAin't nothin wrong with dancin, but we ain't takin chances\nNow black radio soundin like Sesame Street\nIn the middle of a war niggas playin for keeps\nWith an idiot in office that we should of inpeached\nBut you would never know checkin ur-ban radio\nTo let the music tell it, everything is sweet\nI'm done tryin to touch niggas who don't want to be reached\nI want to touch the youth, but here's the fuckin truth\nI've played this sport and now I carry the torch\nBut if niggas like darkness, then what's the fuckin use?\n\n[Hook]\n\n[Outro]\n(*cuts by DJ Jayceeoh*)\n\"Brother of a pitch\"\n\"Brother of a pitch\"\n\"Brother of a pitch\"\n\"Brother of a pitch\"\n\"Is the brother who start\"\n\"Brother of a pitch\"\n\"Is the brother who start\"", "title": "Be Prepared", "album": "Absolute Value"}], "artist": "Akrobatik"}