{"songs": [{"year": "2014-11-14", "album": "King", "image": "https://images.genius.com/ec5428c73b3a017560d3e59fe3c42b82.600x600x1.jpg", "title": "C-Town", "lyrics": "[Intro]\nYou tired again cunt?\n*Kerser and Nebs muttering*\nAyo look, I'm gonna say some shit yeah?\n\n[Verse 1]\nA bad bitch tryna catch me with an eye wink\nI tell her \"Fuck off, go and pour my drink\"\nKing Kers, Nebs One at the fresh shit\nYour dream girl treating us like she desperate\nAnd she ain't even wanna speak to you\nSo we throw her to the crew like sweet [?]\nShe away, eshay\nEverything is esh-fray\nMy mission is to get paid\nBlew a stack at the mall for the fuck of it\nOut of everything I brought I only wore half of it\nGot 'em jealous, Aussie Hip-Hop has a new face\nThat's why my posters hanging in your girlies room mate\nWhat's a pawn to a king?\nBitches use my film clips for a porno, it's sick\nI'm still flipping cash, Nebs still on the payroll\nHe gets his cash then he looks at me like 'HEY YO!\"\n\n[Chorus]\nBitches wanna get down in the C-Town\nThey know we don't fuck around in the C-Town\nI come through with a pound in the C-Town\nSipping lean at the spot is where I be found\nBitches wanna get down in the C-Town\nThey know we don't fuck around in the C-Town\nI come through with a pound in the C-Town\nI got my weed with a bottle look at me now\n\n[Verse 2]\nIn the studio with Nebs and we sipping on some rich shit\nBitches screaming at the door for some real dick\nMoney on our mind, Gucci on the shirt\nDo the Kers bitch, do it, do it 'til it hurts\nWhy you angry at your sales, you can't move nah?\nMy whole crew move units, that's the truth brah\nTook my missus to the snow for a month\nCame back, new pay fans are loading me up\nIt's all the same, I'm a hustler I came from the streets\nThe same ones that play this saying \"Fuck the police\"\nIn the hood, drive through in my new car\nSee the boys, call the shots, then I cruise brah\nI'm a Rap God, no Shady tho\nMore drugs, more liquor, more crazy bro\nNext promoter that is shifty with the bread swap\nI'm leave it at this *click* headshot\n\n[Chorus]\nBitches wanna get down in the C-Town\nThey know we don't fuck around in the C-Town\nI come through with a pound in the C-Town\nSipping lean at the spot is where I be found\nBitches wanna get down in the C-Town\nThey know we don't fuck around in the C-Town\nI come through with a pound in the C-Town\nI got my weed with a bottle with a mean sound\n\n[Bridge]\n*Kers and Nebs muttering*\n\n[Chorus]\nBitches wanna get down in the C-Town\nThey know we don't fuck around in the C-Town\nI come through with a pound in the C-Town\nSipping lean at the spot is where I be found\nBitches wanna get down in the C-Town\nThey know we don't fuck around in the C-Town\nI come through with a pound in the C-Town\nI got my weed with a bottle with a mean sound"}], "artist": "Kerser"}