{"songs": [{"image": "https://images.genius.com/e960df995f69f71e6fb29abf9972d94e.1000x1000x1.jpg", "title": "I’m Serious", "album": "Cradle 2 The Grave", "year": "2003-02-18", "lyrics": "[Pusha T]\nOK, Pusha..minus the T\nNiggas is talkin' too blasphemous\nTell me is it these Asscher cuts that got you thinkin'\nI'm not in touch with that mask 'n glove\nDon't let the Reverend close your casket cause\nWe think you thinkin'\nThese verses is curses, the only thing worse is\nI'm the ringmaster of the circus\nMeanin' that, I'm the only one in the show with purpose\nMost of you motherfuckers don't scratch the surface\nLook, still ghetto, still tote heavy metal\nStill throw a nickname on all of my vehicle\nLike the Cooperfield coupe, now you see it now you don't\nWith one flick of the wrist wow! the roof will go poof! (poof)\nI'm an achiever make all of you believers\nAnd I'll be damned if you overthrow Virginia's Caesar\nSpend a day, sin away, walk with me\nHug corners in the hood like a ghetto renegade, switch!\nSpend a way, rolls gold Jesus\nPink diamonds face flush like it was dunked in pink lemonade\nListen, I'm not actin', this ain't rappin', this live in action\nLet's consider all the facts in\nI got caught dealin' some weight back when\nNow that I'm blown, it's new to men\nI know its hurts to see it, but players please believe it\n\n[Hook: Pusha T (2x)]\nI'm cool with your wishin', don't talk cause I'm listenin'\nFuck 'round and end up missin' if you're curious\nNo weed or no vodka, my soul will make me pop ya\nDon't make me have to milk box ya, I'm serious\n\n[Malice]\nSee how ya boy do, I pull up in that ride quick\n50 on the wrist leanin', niggas is sick\nSteamin', they can't understand the meanin'\nSo they plot and conjure up ways to interrupt my well-bein'\nBut that 9's been a damn good friend\nTrustworthy, made it to see 30 and I owe it all to him\nJewels lookin' as if I done robbed a vault\nSo if your bitch takes an interest it is not her fault\nI mean, look, head to toe heavy in weight\nPockets loaded, hey I must say I take a cake\nThey speak ill, but words don't break him bone\nThey bounce off him, cause see him is purchasin' homes\nSee his stones, how they complement each other?\nSize of the rocks and they fluctuate in color\nThat him is me get a clue enough's enough\nTook it easy on y'all fuckers and I ain't even rimed my truck (Uhh)\nTo put it simple I'm a rarity, ma\nFrom the cars to the jewels what clarity, ha\nStick with me show you life that's out of this world\nAnd I ain't lyin' to you love, I only lie to my girl\nI lust for the riches, what a treat this is\nThe Lord is dealin' with my demons and my weaknesses\nGod forgive, lose it all or God forbid\nBut from the Cradle 2 The Grave I'm a live\n\n[Hook (4x)]"}], "artist": "Clipse"}