{"songs": [{"title": "Haters", "album": null, "year": "2012-04-01", "image": "https://images.genius.com/eaab8a504477a90120f3290d121961fc.500x500x1.jpg", "lyrics": "[Intro: R. Kelly]\nI'm in your mix x8\n\n[Verse 1: Lil Reese]\nShe ain't even my chick but she probably going\nSee these niggas faces when I pull up in that foreign\nMaybe its my style, Maybe its my credit, she say them niggas boring\nAll we know is win win bitch yes we scoring\nReal nigga shit 300, we don't fuck around\nBad bitches call me just to fuck around\nThey dont like dicks, they just like for me to dick em down\nTalking bout that goofy ass niggas tryna sit em down\nBoi she a star look at that ass straight head spinner\nHuh, You see my squad, and we go hard, yes we some bread winners\nYup, That thot there she a runna, 3hunna they'll run ha'\nGood head she a goner kush roll double monster\nFeds taking pictures so I gotta stop and go\nReal talk boy don't run our mouth that's all we know\nMe and the hood together foreva like Will and Jada\n3hunna we next they forever gone hate us\n\n[Hook: R. Kelly]\nI'm in your mix x8\nAnd them haters gone hate x4\n\n[Bridge: Lil Reese]\nThat's all they gon do man\nThey ain't got no other choice\nShouts out to my bro gods\nChief Keef Lil Durk what's happening broski\n\n[Verse 2: Lil Reese]\nFuck nigga, fuck nigga (fuck nigga)\nFuck nigga, fuck boy, pussy nigga the best is I\nYou on the stand shots fired man down you'll testify\nSnitches run they mouth my niggas them niggas We don't play that\nCouple drillers come and drill you my nigga Right where you stay at\nMy biggest hater is the reason I can't get no sleep (no sleep)\nN-n-no sleep F-fuck the police\nCause I ride out solo dolo, My niggas my family 3hunna\nRed beam on the 30 that's a no go, GBE OTF that's the logo\nFree five Free law free brudo\nLost some real niggas from a long time ago\nGrind time so you know I gotta grind tho\nPrime time so you know I gotta shine tho\nWe riding we riding with a strap or two\nAnd we don't go back and forth like the rappers do\nAnd they say these niggas ain't hating\nThis Chicago the motherfucking capital\n\n[Hook: R. Kelly]"}], "artist": "Lil Reese"}