{"songs": [{"album": "Thr33 Ringz", "image": "https://images.genius.com/1c9a02cd6c726adaf48e44273aa15ed7.500x500x1.jpg", "year": "2008-11-11", "title": "Change", "lyrics": "[Intro: Diddy]\nI'll do anything for you... for you I'll change the world\nNo more wars, no more poverty, no more hurt, no more pain\nYou showed me how to love you again, for you I change the world\nPain sing...\n\n[Hook: T-Pain]\nIf I could change the world\nOh, I would be the sunlight in your universe\nOh, you will think my love was really something good, baby\nIf I could change, if I could change\nIf I could change the world, the world, the world, the world\n\n[Verse I: T-Pain]\nOoh there would be no more wars\nOpportunity knockin' on doors for us, for us\nNobody ain't known each other\nBuddies turning into lovers for us, for us\nOh when the moonlight turns to sunshine\nEverybody waking up to abandon dreams (Uh-uh uh-uh)\nCause everybody need what they want\nBut don't want what they need; let's talk about unity\nChanging the world!\n\n[Hook: T-Pain]\nIf I could change the world (hey yeah)\nOh, I would be the sunlight in your universe (in your universe)\nOh, you will think my love was really something good, baby\nIf I could change (change), if I could change (yeah, change)\nIf I could change the world, the world, the world, the world\n\n[Verse II: Akon]\nIf I could change the world\nI order for the line to be erased that the border this day\nThis day, everyone deserves an opportunity\nThere be no new world order\nIf nobody wouldn't never got slaughtered that way\nThat way, that means so much more love and unity\nDaughters will be close to their mothers\nSons will be raised by their fathers today\nToday, a good family ain't nothing greater\nRaces crimes, hate crimes will never exist, I'll turn everyone into a Hershey's kiss (kiss)\nAnd we can eat away our fear (fear), ooooh\n\n[Hook: T-Pain, Akon & Marry J. Blige]\nIf I could change the world (oooh)\nOh, I would be the sunlight in your universe (hey)\nOh, you will think my love was really something good, baby\nIf I could change (yeah), if I could change (if I could, if I could, I would change)\nIf I could change the world (the world), the world (the world), the world, the world\n\n[Verse III: Mary J. Blige]\nThere would be no self hate\nWe will all have to love everything about ourselves, so we can love everyone else\nNothing would hold us down\nBecause we'll all walk around with a smile and never frown and that will remove those clouds\nThere'll be no more self-loathing\nEveryone will know in their hearts that they just fine and that's when the light's gonna shine\nEveryone will understand\nIn order to have some peace you must believe, believe the best in you\nBelieve I can change\n\n[Hook: T-Pain & Mary J. Blige & both]\nIf I could change the world\nOh, I would be the sunlight in your universe (sunlight in your universe)\nOh, you will think my love was really something good, baby\nIf I could change (Change the world), if I could change the world\nIf I could, if I could change the world, the world, the world, the world"}], "artist": "T-Pain"}