{"songs": [{"image": "https://images.genius.com/502e64ad8b70f4992bafe55475ce7dd4.892x892x1.jpg", "year": null, "lyrics": "Yo tengo miles d cosas que puedo darte\nEl mundo entero todo por amarte\nYo te mantengo en tu reino toda la vida\nMi nina tu seras mi consentida\nTengo costumbres y fachas de callejero\nIndependiente, hago lo que quiero\nTengo movidas que me azen mucho dinero\nCamino el mundo y no me desespero\n\nQuisiera saber que es lo que te encanta\nAlgun ramo de flores o musica de banda?\nNo tengo mucho que ofrecerte pero creeme\nSe querer hasta la muerte\nAveces digo nunca eh tenido compasion en mi vida\nMe azes falta tu por que estas ala medida\nNo pido mucho pero te dire quedito\nQue de vez en cuando me prestez de akellito\nTengo un carro mas o menos para pasearte\nComo no si eres mi obra de arte\nYo te presumo ante todos mis amigos\nY te llevo al pic-nic todos los domingos\nTe comprare alguna camisa con tu nombre\nY letras de grafiti que digan\nEl es mi hombre\nCaminaremos sobre venice y cuando\nCaiga la noche cenaremos en el denny's\n\nCoro\n\nNo tengo mucho para impresionarte\nPero tengo las ganas de conquistarte\nSe que ati te interesa la moneda\nPero no importa intentare con lo que pueda\nTe quiero llevar a que mires el oceano\nEl carro no es mio y tampoko es del ano\nDe arriva se ve todo sin bajarte\nTe bajara pero cobran por parkearte\nTampoko no te quiero imponer\nPero despues de eso podemos ir a comer\nNo tienes nada de que tener pena\nMi jefe es buena onda y siempre ace buena cena\nDespues de eso yo conosco un cine\nEsta en mi casa y ojala te fazine\nMi compa tiene una tele de las grandes\nY peliculas piratas las que aguantes\nTe pedire que traigas tus pijamas\nMi sofa se ve chico pero se convierte en cama\nY en la manana que me digas que te vas\nMe levanto y te llevo ala parada del bus\n\nCoro\n\nDeterminadamente estoy determinado a poder\nTenerte siempre parte de mi vida\nTal como un dueto \"como quien?\"\nMarco antonio y maricela \"ay! que buen ejemplo!\"\nNo tengo jet privado ni un departamento\nEn el penthouse pues eso sale caro\nVolaremos de primera clase por el southwest\nY comeremos lo mejor de cacahuates\nMija que te paresio mi propuesta\nSolo dime para cuando estas dispuesta\nDejame saverlo en adelantado ya saves que\nEl carro ay que pedirlo prestado\nEs todo lo que tengo para darte y ojala sera\nSuficiente para demostrarte que por ti\nYo are lo necesario para\nAserte feliz siempre alo diario\n\nYo tengo miles de cosas que puedo darte\nEl mundo entero todo por amarte\nYo te mantengo en tu reino toda la vida\nMi nina tu seras mi consentida\nTengo costumbres y fachas de callejero\nIndependiente, hago lo que quiero\nTengo movidas que me azen mucho dinero\nCamino el mundo y no me desespero", "title": "Mi Consentida", "album": null}], "artist": "Akwid"}