{"artist": "Cam’ron", "songs": [{"title": "Get Em Daddy", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Intro - Cam'ron]\nThey say beauty's in the eye of the beholder\nThat's why I look in the mirror every morning and realize how fly I am\nThey wanna know what fuckin label I'm signing to\nI'm the C.E.O. of Diplomat Records, I sign myself\nGetchya cake up!\n\n[Verse 1 - Cam'ron]\nI'm like a crack addict\nWith these Macs I've got a bad habit\nClack-clack, in the pen, back out, I'm back at it\nIt's like my lawyer know black magic, black rabbit\nOut the black hat, black. Back home to my Craftmatic\nNext to it: stash mattress. Under it: cash, bastard\nHad them bitches ass-backwards, fuck 'em like a jackrabbit\nIs she crab status? Call the girl a itchy twat\nStick me not, I go and get dutches, it's a 50-box\nI got weed, hash; when I breeze past, breathe fast\nEat ass on point like Steve Nash\nBut I'm fixin to be OG Nixon in 3\nEnough jewels, you fools - I'm cool! - my kicks are a G\nI got tramp whores. Yours!\nBeen V.I.P. since B.I.G\nI never seen a dance floor (Nope!)\nBehind the velvet rope, pop bottles, hella smoke\nGirls with contacts want contact, I tell 'em \"nope!\"\nYou go \"Pon' de River\": leave you in ponds and rivers\nDon Juan, a Long John, the long arm of harm'll hitchya\nWe like the March Of Dimes the way we march with dimes\nGood help is hard to find\nSoft white the art I twine\nArt design, archin' mine, Fresno to Clarke I'm fine\nSun ill, Gun Hill, back to Central park, it's mine (Mine!)\n\n[Hook - Cam'ron]\n'Til this day, dude, still followed by State troops\nGray Coupe, whip in momma's name\nMade a mistake (oops!)\n(Get 'em Daddy!) Daddy Got 'em, y'all glad he shot 'em\nHow me holiday? I love it when mommy say\n(Get 'em Daddy!) Had to bite, put it on satellite\nGet ya money up, jewelry tight, swagger right\n(Get 'em Daddy!) Got 'em mommy, you my Gotham Bonnie\nCause I'm Batman with the pump, Johnny Johnny\n(Get 'em Daddy!) Honey smile, don't act funny-style\nIn one ear, yeah yeah, 220 thou'\n\n[Verse 2 - Hell Rell]\nPo-Po wanna pick his brain, ho's wanna give him brain\nWe rose up to bigger fame, glows from the tennis chain\nMake foes wanna get him slain, these hollows will twist a man\nI left out of Clinton Max, got picked up by Killa Cam fam\nWe on another level, I'm bout to pull that Porsche out\nAnd flood the other bezel, I get dug like shovels\nY'all niggas fuck with pebbles; I flip big boulders\nSwitch Rovers, hit 'em with the gun that's in his holster\nYou could gargle cum, ma; why sip soda?\nThese niggas wanna be Scarface, I'm with Sosa\nYou need to have my number if you wanna buy weight\nFuck a borough, we floodin' the whole Tri-State\n20 thou' on the arm, more rocks on the charm\nAnd I done copped from every damn haze spot on Audubon\nHeavy weed smoker, get ounces for free\nAdd up everything you got, it ain't amountin' to me\nI'm in the Crown Victoria, Mac in the back\nSee these little niggas rappin' to rap, man I just happen to rap\nKnow what I do: manufacturing crack\nKeep talking, get you snatched for that scratch, clapped with the Mac\nI'm 'bout to buy more guns, 'bout to buy more trucks\nAnd when we on the road, bitches follow the tour bus\nYou mad cause you losing, plus in the Bronx\nI'm responsible for most of the stabbings and the shootings\n\n[Hook]"}]}