{"songs": [{"year": "2018-07-17", "album": "Pure Intentions", "image": "https://images.genius.com/2619374aaf74e820050eff994da86264.1000x1000x1.jpg", "title": "Gridlock", "lyrics": "[Verse 1]\nSeparate the known from the no go (from the no go)\nWe check ya from the status to the photo (uh huh)\nYou realer now, don't worry you still show ho (it's gon' show ho)\nThe cameras on it, you ain't even know though (uh huh)\nYou need more than a black belt in my dojo (in my dojo)\nThat don't mean that you can't get caught in a chokehold (uh huh)\nCalm your bitch-ass down, I got somethin' to show you (somethin' to show ya)\nYou too busy bein' a fuckin' bozo guess I'ma\nWatch you self destruct\nIf you don't give a fuck\nThen why should I help you? Oh you ain't askin' for it huh\nNo you got all this figured out, so much bullshit to untwine\nOh so you a stand-up guy but fall on your ass every time\nIt look like your paper running out\nYou might have to find a new paper route\nMight have to sit your ass on the sidelines\nTill you get your shit sorted out\nFunny how the word broke ain't pronounced\nLike y'all ain't know what that's about\nPride is a double edged sword\nReady to take a nigga out\n\n[Hook]\nExcuse me, don't\nMean to intrude, and you\nDo not know me, no more\nThan I know you, but if\nI was in your shoes\nI would use this as a tool\nSo tell me what the fuck you wanna do\nGet gone or get got\nGet gone or get got\nGet gone or get got\nOh you the hottest on the block?\nGet gone or get got\nLock grid and gridlock\n\n[Verse 2]\nMake sure you know your role before you play it ('fore you play it)\nMake sure you read the fine prints in your statements (uh huh)\nGettin' even mothafucker that's my favorite (that's my favorite)\nAnd when it comes to that bitch I'm nothin' to play with (uh huh)\nNiggas shuck and jive I think that shit's outrageous (that shit's outrageous)\nDon't bring that shit around me I heard it's contagious (uh huh)\nEverything you on I think that shit's outdated (old as fuck)\nBut you're too busy worrying 'bout opinions\nSo nigga guess what I'ma do\nThe opposite of you\nTryna ride a wave nah that's what sucka niggas do\nI give two fucks what niggas do\nShit you might call me out of touch\nMy shit hit like an uppercut\nI hit you with another one\nSomebody please tell me why\nThese niggas trash by design\nThat shit sound mad asinine\nSound like the blind lead the blind\nMothafucka I can't read braille\nBut I can see bullshit pretty well\nThese bitch niggas fold under pressure\nThat's 'cause these bitch niggas frail\nAnd uh\n\n[Hook]\nExcuse me, don't\nMean to intrude, and you\nDo not know me, no more\nThan I know you, but if\nI was in your shoes\nI would use this as a tool\nSo tell me what the fuck you wanna do\nGet gone or get got\nGet gone or get got\nGet gone or get got\nOh you the hottest on the block?\nGet gone or get got\nLock grid and gridlock\nGet gone or get got\nGet gone or get got\nGet gone or get got\nOh you the hottest on the block?\nGet gone or get got\nLock grid and gridlock"}], "artist": "K.A.A.N."}