{"songs": [{"year": "2018-11-27", "album": "KB4*", "image": "https://images.genius.com/471f808f37594cccc5e5f6137050c8e6.600x600x1.jpg", "title": "Die Rich", "lyrics": "[Intro: KB]\nI came, oh, I came (I came, I came)\nWith nothing, with nothing\nI came with nothing\nBut I fought for something\nAnd I leave with everything\n(Go, go, go, go!)\n\n[Chorus: KB]\nYeah\nHomie, I got that glow, I cannot hide it (yeah, yeah)\nI got Heaven printed on my eyelids\nThinking, \"If I die tonight, then I'ma die rich\"\nThinking, \"If I die tonight, then I’ma die rich\"\nI got that, uh, yeah, finessin' with the kindness (kindness)\nWhat they talking about?\nWe forever financed (financed)\nI'm thinking, \"Whoa, we the ones that die rich\" (die rich, die rich)\nI’m thinking, \"If I die tonight, then I'ma die rich\" (die rich, die rich)\n\n[Verse 1: KB]\nAye, just the queen and I, Martin, Gina vibes\nYeah, didn't need a dime to know that we arrived (uh, no)\nHGA the law that we abide by\nBye, bye, got *NSYNC with Him and came alive, yeah\nTold my bro that it ain't what you make, it's what you keep\nHe told me, \"Bury me in Louis sheets!\"\nUh, run it up (run it up)\nRun it up, run it up, run it up (run it up)\nDouble up money, they leveled up\nBet it up, let me just sum it up, money, that's not enough\nAudemars, Audemars, bust down, yeah\nMoney dance, money dance, touchdown, yeah\nAdonai not impressed and you gonna die\nWhat am I gonna bribe God with a hunnid dollars?\nHunnid times, I'ma tell you how to levitate\nHow to put stocks where they never sink\nEnd the day in the faith, give away anything\nAny day, it'll pay many more in the Name\nWoo, yeah, I’ma die lit (die lit)\nKB, KB charged up, I’ve been indicted\nYeah, I'm the baby daddy with no side play\nYeah, my BMW’s like the i8\nWhen e-, when eternity is underneath my eyelids\nSo every time I close my eyes, I just get reminded\nJust turn the lights off\n\n[Bridge: KB]\nI came with nothing\nBut I fought for something\nAnd I leave with everything\nAnd that's all I'll ever do\n(Go, go, go, go!)\n\n[Chorus: KB]\nHomie, I got that glow I cannot hide it (yeah, yeah)\nI got Heaven printed on my eyelids\nThinking, \"If I die tonight, then I'ma die rich\" (die rich)\nThinking, \"If I die tonight, then I’ma die rich\"\nI got the, uh, yeah, finessin' with the kindness\nWhat they talking about?\nWe forever financed (financed)\nI'm thinking, \"Whoa, we the ones that die rich\" (die rich)\nI'm thinking, \"If I die tonight, then I'ma die rich\" (die rich, die rich)\n\n[Verse 2: KB]\nAll my friends were buyin' Louis\nAll we wanted was some Gucci\nKeep our closets stocked with brands\nThat we don't own a stock or two in\nGod bless the entrepreneur\nPastor taught me how to steward\nCooking bars, Martha Stewart\nBusiness deals and flippin' units\nI was taught by Martin Luther\nGet the bag, but don't abuse it\nEvery dollar, we accrue it\nBelongs to God and not the jeweler\nJesus, Jesus help me through it\nI will not be young and foolish\nCash rules nothin' 'round me, homie, just Yeshua\nIs it crazy thinkin' we give more to people than ourselves?\nInheritance for my children, ROI's that never fail\nIf my businesses go under and my property don't sell\nDid it for the Kingdom, served the people and my soul is well, yeah\n\n[Chorus: KB]\nHomie, I got that glow I cannot hide it (yeah, yeah)\nI got Heaven printed on my eyelids\nThinking, \"If I die tonight, then I'ma die rich\" (die rich)\nThinking, \"If I die tonight, then I'ma die rich\"\nI got the, uh, yeah, finessin' with the kindness\nWhat they talking about?\nWe forever financed (financed)\nI'm thinking, \"Whoa, we the ones that die rich\"\nI'm thinking, \"If I die tonight, then I'ma die rich\"\nLet my little brother go\n\n[Verse 3: Ray Emmanuel]\nIf I die tonight, homie, I'ma die rich\nNo, I ain't talkin' 'bout the money I get\nOnly 14 years old, but I set my goals\nAnd I don't really care about diamonds and gold\nIt's all about what's inside your soul\nI don't wanna go down that wrong road\nMaterialism can make you a victim\nAnd put you inside of the mass of the prison\nPut it in physical work and that spiritual work\n'Cause life'll make our spiritual hurt\nI'm not the best, but I'm not the worst\nI do what I can to please God, it come first\nSo money is cool, but when I die I'll be a millionaire times 2\nGod is the answer, He's stronger than cancer\nThe Master is waiting on you with the juice!"}], "artist": "KB"}