{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "DONDA", "lyrics": "I appreciate everyone’s support for my clothing line but I wanted to clarify a few things… The name of the line is Kanye West not DW… The DW was a design element placed on the invite in homage to my mom :-). I really appreciate the fake DW twitter page but since it’s not official I can’t co-sign any information on it\n“Simplicity is the ultimate sophistication.” – Leonardo Da Vinci\nMore clarity… I have no agency representing me currently… William Morris was fired after Cara Lewis quit. I love Cara Lewis :-)\nI love being back at my fashion office learning and creating. It’s so challenging and fun and I’m surrounded by amazing people. They say you only live once but every time I come to work I feel like I’m starting a second life. You guys might think I have some type of backing for my line but I don’t. I did the first fashion show out of my own pocket and used the money I made touring to follow my passion. I’ve been working at this for 8 years now. From the first offers to do urban clothing lines that I turned down…to begging Bape to do my line and never making any real headway…to having an office in LA that was shut down after the “MTV” moment along with my tour with (Lady) Gaga\nI moved to Japan for one month after that and designed every night in my room. I had this opportunity to intern at Fendi and was also offered a position at Versace which I could not take due to my contract with LV which was for 2 years. I moved to Rome after I left Japan and worked at Fendi for 4 months undercover. I was there to give ideas for the men’s collection. I snuck to Giuseppe Zanotti’s factory still under contract and learned to design womens shoes for 2 years before my first show in Paris. After doing the first LV collection I was sure I would get a second shot to create but was never given the opportunity\nI designed a sneaker called the (Air) Yeezy with Nike. I’m “allowed” to design 1 pair of sneakers every 2 years. I have more ideas…\nEarly 2011 I moved to Paris and opened a small design studio. The language barrier was quite difficult. I still don’t have a Paris VAT number to this day. I don’t know what a VAT is but every time I asked why we didn’t have fabrics they said it was because of the VAT. In Paris I met many great people in design including the master Azzedine Alaia. Azzedine even came by my studio one day :-). This was the greatest feeling to stand in his presence in my embarrassingly small Paris studio in a courtyard opposite Collate\nI remember being 5 years old picking and my mother taking me with her shopping at the discount fur spots. She said I would always point to the most expensive furs, even as a child. LOL. There is something about making clothing that always brings me back to that point. For the first 16 or 17 years of my life the only thing I knew about women’s clothing was what my Mom would wear. I guess some critics would joke that I still don’t know anything. LOL. My Mom would wear blue jeans with a fur and an embellished “Cosby Show” sweater :-) to pick me up from school. The teachers said I couldn’t focus. I used to get kicked out of class for bringing dirty magazines and drawing Nike’s in 4th grade\nBeing a celebrity has afforded me many opportunities but has also boxed me in creatively. I was just discussing becoming the creative director for the Jetson movie and someone on the call yelled out, “you should do a Jetsons tour!”\nThis just happened a few hours ago. I was very insulted of course because for anyone that’s seen the Watch the Throne Tour, Coachella, Glow in the Dark or Runaway know that I have real ideas\nI appreciate having the most nominations at the Grammy’s but I feel so conflicted by the fact that award shows sometimes are completely illogical. Good logic tells me “smile Kanye”, the world likes you again. “Red or blue pill?”…aaaaand Swallow. LOL. I wouldn’t have the prestige I have if it wasn’t partially for the Grammy's validation and I honor that\nHmmmmm, what to wear? Here I go again… Yeezy the trend setter or complete f*cking fashion victim…the verdict is still out. This is just a train of thought but I figure it’s better to read than trained thoughts\nWhat good is fame and prestige if you can’t use it to help people? I want to help by doing what I know how to do best…create\nI have started a new company and I’m so excited about the name…it’s got the best name ever…of all companies…of all time!!!\nThe name of the company is DONDA\nDONDA is a design company which will galvanize amazing thinkers and put them in a creative space to bounce there dreams and ideas. I used to blog all the time an fit was a way to get my opinion out. Dr Dre redesigned headphones and made more impact off of one product. I am assembling a team of architects, graphic designers, directors musicians, producers, A&Rs, writers, publicist, social media experts, app guys, managers, car designers, clothing designers, DJs, video game designers, publishers, tech guys, lawyers, bankers, nutritionists, doctors, scientists and teachers\nDONDA will be comprised of over 22 divisions with a goal to make products and experiences that people want and can afford. I want to put creatives in a room together with like minds that are all way doper than me. We want to help simplify and aesthetically improve everything we see hear, touch, taste and feel. To dream of, create, advertise and produce products driven equally by emotional want and utilitarian need.. To marry our wants and needs…DONDA\nThis will all take time but I wanted everyone’s to know what I really care about…I care about people…I care about my fans…I care about people who have never heard of me…There are over 7 billion people on the planet now…It’s something about coming from music that makes me so optimistic. Music travels and is not limited to only the wealthy. Sometimes my grammar is wrong but my thinking is right :-). My mom was an English teacher so I know she sends an SMDH from heaven :-). 5:18 am in London, my dreams keep me woke\nThe Watch the Throne tour was a small example of what a DONDA experience can be…\nI’m currently working on a new 7 screen experience…\n\nThis is one of our projects to be released this year called 2016 Olympics…It’s semi sci-fi, since 2016 is only 4 years away, :-)\nWe would also like to design the MTV awards. We’re taking everything 10 steps at a time, LOL! I wanted to put this in the world, in hopes that the people who can actually make a difference will stand up and reach out. We need as many amazing powerful smart talented wealthy people to be involved. Come get on board…don’t just sit there…reach out\nWe can collectively effect the world through design. We need to pick up where Steve Jobs left off\nWhen I said wealthy I wanted to point out there are so many billionaires in the world that can come together and help to redesign it and help education. School systems were designed to turn people into factory workers. Schools should be designed to prep human beings for real life\nSpike Jonze and I want to do a Summer school that tries new forms of curriculum. Math classes should teach addition, subtraction, multiplication, division, accounting and money management aaaaaand cut!!!\nUNLESS YOU’RE A MATH MAJOR!!! Kids you should be able to take majors starting in grammar school like how it is at performing art schools. Instead of kicking kids out of schools for using their iPhones…why not promote it?\nAllow kids to use search engines to do test…like the real WORLD!!! Give kids the amount of test they would have in a year in one day but they have to get everything perfect…please excuse my grammar…I know it’s extremely ironic\nSome kids have better memories than others…what about emotional IQ’s? What about kids who do bad in school because of how bad their surroundings are?\nExcuse me…I just get excited at the possibilities…the more excited I get the more grammatical errors you’ll see…\nWe need to take what Michael Jackson felt and Mcqueen and Steve Jobs, and we need make things better\nWhen me and Jay toured, every night I peered into the audience astonished by the different walks of life that came to support us\nThe adrenaline is running…I don’t know if I can even get to sleep now. From Wall Street to the London riots to Chicago murders…I sit everyday and ask what can I do to make a difference. I know this is not a very rapper thing to say but I haven’t bought a new car or piece of jewelry in about 2 years\nI invest every dime back into creativity, hiring amazing creatives, paying for flights, offices…etc. My area of expertise is in music, my passion is in music, design, film and products…my strength is connectivity…\nThere are so many broken systems from the economy to school systems to jail systems…we need experts for this. We need scientist and top world designers to directly affect governments\nI just wanted to share what’s been on my mind…\n“If you have an apple and I have an apple and we exchange these apples then you and I will still each have one apple…but if you have an idea and I have an idea and we exchange these ideas, then each of us will have two ideas.” – George Bernard Shaw"}], "artist": "Kanye West"}