{"artist": "Canibus", "songs": [{"title": "Full Battle Rattle", "album": "The Vitruvian Man (Mixtape)", "year": null, "image": "https://images.genius.com/4c70f007f1382040d1bfe4130f9721ec.468x468x1.jpg", "lyrics": "(Canibus)\n\"You wanna face lift? This is what it takes 'Bis\nA beat that'll make a nigga think an earthquake hit\"\nThe blue-collar rapper, enigmatic, democratic\nRap-savvy fanatic that could smash any match-up\nHigh when I wrote this, bring welding goggles to my show\nMy flow glow brighter than any diamond that you know\nI walk among you, draw energy from you\nThe Art of Sun-Tzu, he used to bus' too\nI'm like a Shaolin monk on crunk\nHolding himself up with his thumb on a stump\nGet a Hummer for the summer to stunt\nAnd just sit in the front while my lungs become one with a blunt\nFuturistic old-schooler, look like JFK Jr. when I suit up\nJacob 'The Jeweler' with an new cut\nCan-I-Bus! I ain't got what I want yet\nHow could you respect one of the best\nWhat, I can't get no\nGrab the mic, nigga, let's go\nBet me who got the best flow\nYou end up with less doe\nOpen your vest, let your chest show\nI'ma open your chest, let your breath go with a .38 Special\nKeep it on the low, don't let the press know\nBehind the scenes they put me on death row and won't let go\nBrace yourself while I break the chains\nMy beats bang so hard they erase the plains\n\n(Canibus)\nYo\nThis is full battle rattle, attack you\nSalute or I'll smash you\nCan-I-Bus bus' to blast you\n\nFull battle rattle, attack you\nSalute or I'll smash you\nCan-I-Bus bus' to blast you\n\nFull battle rattle, attack you\nSalute or I'll smash you\nCan-I-Bus bus' to blast you\n\nFull battle rattle, attack you\nSalute or I'll smash you\nCan-I-Bus bus' to blast you\n\n(Canibus)\nThe Hundred Bar Monster spit without hawkin' up\nSmash your whole roster, fuck what it cost ya'\nFuck what it cost me, join the army smoke Bob Marley\nThe sergeant major honorably discharged me\nFor my sinsemilla and my hemp incense\nInspiration, why it's only worth ten percent\nAnother day in the life for Mr. Can-I-Bus\nMy life too rough for me not to recognize rough\nThe soldier's back to blow a fucking hole through rap\nI wish they'd let me out the cage and stop holding me back\nYou might say the only thing holding me back is myself\nIt ain't hard to tell what's holding me back is my sales\nI don't make record for girls, I spit for the borough\nBut I'm an artist in an ignorant world\nWorld class athlete trained to attack beats\nMixtapes smash the streets, try to patch the leaks\nNiggas try to battle me but lose, they got limited views\nI remember when I was primitive too\nI sit and talk with the inquisitive youth, cause I be spittin' the truth\nSometimes I ask them, \"What you listenin' to?\"\nLyrical fitness is the proof, let me put you in the booth\nNottz'll play the beat-loop, let me see what you can do\nThe older advise the younger when they recognize the hunger\nI do a couple reps with the mic to get pumped up\nMonkey-bar sit-ups, blood rush to my head\nI write rhymes upside-down with an astronaut pen\nSpit a hot sixteen at Mach 10, take it up a notch then\nLaunch everything when I'm locked in\nYou in the kill-zone boxed in\nTried to play jump rope with skis on and got dropped when you hopped in\nThe Last Mohican, smoke you in the first season\nYou don't speak it but it's no secret\nPeep it, you lightweight like rice-cakes\nAnybody under twenty-one that touch the microphone is mic-bait\nHungry niggas start to get tight-faced, that's when the fight breaks\nA sixty second round is a nice pace\nWork a nigga out 'til he spit up white paste\nTell him he can hide the bruise on his face with nightshade\nIf you looking for a battle you came to the right place\nThis is Mic Club and over here I'm the Mic Ace\n\n(Canibus)\nYo\nThis is full battle rattle, attack you\nSalute or I'll smash you\nCan-I-Bus bus' to blast you\n\nFull battle rattle, attack you\nSalute or I'll smash you\nCan-I-Bus bus' to blast you\n\nFull battle rattle, attack you\nSalute or I'll smash you\nCan-I-Bus bus' to blast you\n\nFull battle rattle, attack you\nSalute or I'll smash you\nCan-I-Bus bus' to blast you //"}]}