{"songs": [{"year": "2011-02-15", "title": "It’s Alright", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "[Intro: sample of \"Superstar\" from Luther Vandross]\nDon't you remember you told me you loved me baby?\nYou said you'd be coming back this way again\nBaby baby baby baby ohhh baby\nI love you, yeah, I really do\n\n[Saigon - over Intro]\nUhh, it's real\nDear Lord, yeah\nThis letter is from Saigon, the Yardfather\nWe fucked up Lord\nWill, talk, to 'em\nI tell 'em\n\n[Saigon]\nIt's alright, it's alright\nI know my rent is overdue, they 'bout to shut off my light\nAnd even if I get a job, too late, you're too right\nGotta do what I gotta do to get this loot up tonight\nIt's alright, I write a letter dedicated to God\nFirst I'll thank him, without him I'da never made it this far\nBut it's hard tryin to think of why he not gettin involved\nIt's a lady with a newborn baby livin in the car\nThe police is beatin us up, the hurricane is eatin us up\nKatrina flood water was deep as a fuck\nDear Lord, are we ever gon' receive a reward\nFor all the sufferin and pain and misery we endure?\nJust like Trans-Atlantic slave trade, the AIDS, the crack\nWhen are we ever gon' get paid back?\nPS: write your boy S to the A back\nAnd tell Luther we got a joint we gave that stays on playback\n\n[Hook: Marsha Ambrosius (Saigon) {sample}]\n{\"Don't you remember you told me you loved me baby?\"}\nWhen you told me you loved me (that's what you told me, ain't it?)\n{\"You said you'd be coming back this way again\"}\n(You said you, you, you said you, you said that you was comin back) I'm back\n{\"Baby baby baby baby ohhh baby\"}\nYou told me you was comin back, that I would see you but you never told me when\n{\"I love you, yeah, I really do\"}\nI want you here to guide me by my side so it doesn't have to be in vain\nSo never leavin you again\n\n[Saigon]\nIt's alright, it's alright\nThey narcotized our neighborhood flood the ghetto with white\nMy nigga only 21, he too young for two strikes\nBut if he catch another felony he gonna do life, that ain't right\nI write a letter dedicated to our\nFather who art in Heaven, Muslim brothers call him Allah\nAnd they all tryin to think of why he not gettin involved\nAmerica is bombin them for no reason at all\nGas prices eatin us up, parole officers cheatin us yup\nThey lock us in for dirty pee in a cup\nAyo I know you love us Lord, but please show black people a sign\nTo us, society's a lethal design\nThem A-T-Liens adapt to the track\nUp top, we call it the block, when not most of the crackers live that\nC'mon Lord, you don't see nothin the matter with that?\nHit me back, I think me and you need to chat\n\n[Hook]\n\n[Saigon]\nTo all the ladies havin babies on they own\nThese niggas ain't shit ma, for real yo? You better off alone\nIf he ain't smart enough to know why he should stay\nThen what could he possibly teach his seed anyway?\nYou gotta grind like you never grind\nEven if it mean you gotta shake your never mind, I know I read your mind\nYou gotta do what you gotta, get it together ma\nA baby ain't temporary, that shit's forever ma\nA mother's love is the freshest kind\nThat'll get y'all through the hard times, the pain and the stress combined\nRaise your seed, you don't need no man\nEspecially one that need to be de-programmed\nType brother think he righteous cause he don't eat no ham\nBut he keep plans of fuckin with some kilograms\nGirlfriend, you know what you do when the time is right\nYou tell your lil' one that it's alright\nFor real, keep your head up\n\n[Hook]\n\n[Outro: Saigon]\nI dedicate this song, to the whole Abandoned Nation\nIf you've been abandoned in any sense of the word\nThen you part of this Abandoned Nation\nGotta take it for what it's worth, right\nGod love us young brothers, that's right\nTo all my brothers on lockdown, the whole Abandoned Nation\nLet's go\n\n[Numerous shoutouts to the end]", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}