{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "Get Out the Kitchen", "album": "The Chalice", "lyrics": "Billy woods ft. Priviledge - “Get Out the Kitchen”\n[Emcee(s): billy woods and Priviledge]\n[Producer(s): 007 (AKA Bond)]\n\n[Verse 1: billy woods]\nPlay your position or get the fuck out the kitchen\nTake what’s yours or keep wishing.  My mama’ll\nTell you I don’t listen.  In addition, there’s\nA price for admission.  I got pot but not\nTo piss in, and if you shut up, might hear the gas\nHissing.  I’m already dead like a Pale-\n-stinian on a mission.  After image seared\nIn the retina like faded graffiti, cooking pies\nBaked off CD, cut you where it’s meaty\nIt’s what for dinner, my crew mad greedy\nSauté my forte, BK all day\nWhere I get it my way\n\n[Verse 2: Priviledge]\nPriviledge rip this, Mike Myers surveys\nSpit these ridiculous flows, ripping clothes of\nThe same emcee in half.  When he steps up\nTo bat, every day, it’s the same old thing: just\nSome false and fronting motherfuckers everywhere I look around\nThey’re one and the same, so I touch ‘em down\nWith this lyrical diction, spit a hype ren-\n-dition of a mic collision with tight wisdom.  Yo, the\nLight glistens like the calm of a storm, but it’s\nType crimson.  Time shift us, and technicians\nCouldn’t keep track of how I trek through dimensions\nDid I mention spitting venomous prose, yelling in tones scarcely\nAudible?  Sometimes, it’s barely when the volume go\nBut always problematic if you hear me right across from you\nWhispering the kiss of death, spitting nothing less until\nThese bitches coming out of dresses, ask for Priviledge backstage\nI got game, trying to mack like back in the day\nWhere female [?] washed my troubles away just\nLike Semmi and Akeem when they Came to America\nIn search of a queen.  I’m clinging by a feather on\nThe wings of a dream.  Dissention, it seems, are in\nThe ranks.  You’re getting benched on your team without no thanks.  Like\nA trembling fiend, spend his last on crank.  Telling\nThese niggas that cats’ll come and push that shank while\nYou’re not looking.  Not a Spike Lee joint but still Crooklyn\nThese city blocks that we’re stuck in, we’re running, we’re\nFucking, do drugs and act tough in like\nIt’s nothing.  This is life, cousin.  This is my mic and\nI love it, so I’m not fronting.  Strife coming, so we\nStay blunted, Olde-E-guzzling on the block ‘til\nThe cops tried to stop some, had me down.  “Duke\nI got none [?] nuggets, you won’t find one of ‘em”\nI’m holding tons, son.  Fuck a shakedown\nThese badge-wearing gangsters don’t fool me, they hold guns\nLike Nino Brown to a nigga back like he was\nA lecherous servant.  Is that protecting and serving?  All\nI see ‘em doo is spreading cheeks like sexual perverts, and\nThe cats who deserve it skate daily, leaving crews\nSplit up, niggas trying to get their corner back like Champ Bailey\nI just want to smoke L’s fat as Hank Fraley\nAnd spit flows deeper than the SEALs in the Navy\nAnd if I make ten cent, it’s all gravy ‘cause\nI do it for the love of the game.  Trust me, dawg\nThe struggle’s the aim, it’s all a hustle, we all one and the same"}], "artist": "​billy woods"}