{"artist": "Ant Banks", "songs": [{"title": "Gameless Mortals", "image": "https://images.genius.com/f5e3b268f1ab7a632ba28e1447e73a94.774x768x1.jpg", "album": "Derty Werk", "lyrics": "Oh yeah, y'know Kev (whassup boy?)\nWe was out ridin the other day\nRollin a livin room on 20's y'know (right)\nJust just ridin, tryin to fuckin with a bitch or sum'n y'knowhatImean?\n(That's right, that's right) And this bitch starin me up and down\nHad the nerve enough to say to me (what's that?)\nI see you peekin but you ain't speakin (what?)\n\n[Verse One]\nDamn a nigga can't talk I thought my, game was fine\nFeel like I can't walk and chew gum at the same time\nTake aim and train, nigga mold a girl\nUnfold the game, and then control her world\nBut niggas they be ass-kissin, givin them ends\nLettin broke-ass bitches even live in the Benz\nBut that's a no-no, nigga what you tryin to do?\nHomey those hoes 'sposed to be supplyin you\nGot the game all crossed up (uhh) no doubt\nGave your change to a toss-up (damn) and sold out\nNigga you could buy pussy but you can't buy love\nI don't, know what you squares be thinkin of\nSavin hoes like \"Braveheart\"\nEatin pussy must be your fuckin trademark, ha ha!\nLet your superhater powers just activate\nCause I'm the playa y'all niggas just love to hate\n\n[Hook: repeat 2X]\nIs it love or what? Straight pimpin\nNiggas be fuckin up - they simpin\nTake a bitch all the way home y'all (all the way home y'all)\n'Sposed to make 'em catch the bus (got 'em into the bus)\n\n[Verse Two]\nI'm talkin garlic, crab with the noodles\nWhat happened to 7/11 for some Doritos and red hot burritos?\nNow niggas is straight flossin for the tossin\nNo more hot wing and nuggets with the sweet and sour sauce'n\nIt's all about the cheddar, who got the cheese\nCan I have some more ice for my Cristal please?\nUsed to take 'em to Reno now it's all the way to Vegas\nNo more Motel 6, dumb bitch think she struck it rich\nThey say that game is to be sold and not told\nBut game has been financed with a lapdance\nBringin 'em back stage all up in the studio sessions (hehehe)\nI guess niggas ain't learned they lesson\nAbout the game cause it's all bad with corruption\nNigga finger fuckin lickin without the dick in\nWell if you don't know, now you know\nIt's time to let a ho be a ho\n\n[Hook]\n\n{*phone rings*}\nHello? (Hey somebody paged?)\nNigga this me! (Oh whassup baby?)\nI got a flat tire, could you come get me?\n(Sheeit you betta get yo' ass on the bus!)\n{*dial tone*}\n\n[Verse Three: Grip]\nCatch the bus? Shit, what the hell you mean?\nI just call the next pimp to pick me up from the scene\nIt ain't no thang homeboy you know that's a fact\nCause when I swang, I have a nigga on his back\nSittin on his face, we at his place\nBy the way trick, how that taste? You know with game I stay laced\nHe keep my neck and wrists shinin with diamonds\nAnd I laugh at a bitch, claimin that's her men pervin\nBizznitches be havin they homies thinkin they pimpin\nGet 'em all alone they start simpin, big trickin, ass lickin\nTongue all in the clit\nCan't even get hard and steady braggin about his dick, sheeit\nYou ain't heard? Quit tryin to shotcall, you a nerd homey\nGet shot to the curb homey off that herb homey\nAnd it got you runnin your mouth\nBut I'm Grip and like bowlin pins I'm knockin 'em out\n\n[Hook] - repeat 2X\n\nWhassup baby? Oh you got a flat tire?\nDon't trip, I got a can of Fix-a-Flat in the trunk\nMatter fact you can take my spare\nHehe, I still got you", "year": null}]}