{"artist": "Beanie Sigel", "songs": [{"lyrics": "[unknown singer or sample]\nHow does it feel (MAC) bein next to you\nI wanna know how, just let me knowwww-know-know-know\n\n[Beanie Sigel]\nI got them diamonds on my neck, I'm so icey\nI think they like Sig', in them white tees\nThem SB jeans, sneaks is me\nBurnt green with the camouflage print\nFake Willies wanna know what's the damage I spent\nOn that new V-Twizzy, grown man with no fence\nRoughly the cost about three bricks off\nCooked up then bagged in trays - have a nice day!\nI'm in my bag and I'm havin it my way\nSick of the floss, sick of cars, you niggas car-sick\nSick of seein Sig' in them large whips\nNo plates and offended, temp plates in the window\nOh my God! If you could see the garage I back intah\nNiggas grind all summer then be crack in the wintah\nI'm never cracked, one number I'm back in yah\nYESSSS~! It's always Mac, nigga the top spender\nJust check your boy out in all his splendor\nHow I grind in the winter, cop up in the spring\nWait for the summer to show off my new things\nAnd in the fall, I do just that - I fall back!\nAnd listen to the rumors on how I'm all that\nYou see this shit? Boy I copped all that!\nYes, I can cover the bet, as you should\nHowever do you want it just drop it's all good\n\n[Chorus]\nMoney, cars, cash, clothes\nBeans says if you 'bout that shit then let me know\nIf you 'bout that shit then let me know\nIf you 'bout that shit then let me know\nMoney, cars, cash, clothes\nBaby girl if you 'bout that shit then let me know\nIf you 'bout that shit then let me know\nIf you 'bout that shit then let me know\n\n[Beanie Sigel]\nI SHOW YOU HOW TO DO THIS DUDE~!\nI done turned more blocks into Rubik's Cube\nYour boy, let off shots from that newest tool\nThen I skate on cops in that newest cruise\nI'm rich boy, ahh looka here\nBlow up icey and rich but your jewels ain't lookin clear\nI show you lil' dudes how to cook a square\nAnd how to grind it to the limit when you push it yeah\nYou don't want it with Sig', I pull your card out\nYou ain't got no bitches now bring them broads out\nWe can go chip for chip, I pull some large out\nOr go whip for whip, I bring them cars out\nBring the Benz out, bring the Aston-Mart' out\nPorsche Box' or the drop top Ferrar' out\nBring the old school six-fours out\n'Til the four doors out, Cool & Dre, bring the chorus out\n\n[Chorus]\n\n[Beanie Sigel]\nUhh, however do you want it bitch I ain't stutter\nYou fuckin with that dude, man I lay 'em gutted\nThat nigga 'dere pop\nAnd I done lost more work in a pot than y'all ever copped\nRight cat, wrong litter box\nAnd I don't window shop, and I don't lease I just pick and cop\nI got the title to the shit I got\nYou need that work, I'm on the boat by the river dock\nI put you niggas in a triple threat soon as I hit The Roc\nNiggas claim they ballin but can't hit the shot\nYeah I'm flagrant, this ain't your game kid\nStay in your lane or get your shit blocked, how you want it?\n\n[Chorus]\n\n[Beanie Sigel]\nHowever do you (*2X*}\nGangsters, pop that shit, and let me know, uhh...", "image": "https://images.genius.com/356ca6b0db6d8d8b7be50568bdfb53c0.700x695x1.jpg", "year": null, "title": "Bout That", "album": "The Solution"}]}