{"songs": [{"title": "Show You", "album": "OG In My System", "year": "2017-08-18", "image": "https://images.genius.com/310f7d7a842817a60ca4801917821dbb.1000x1000x1.jpg", "lyrics": "[Intro]\nAy, ay, ay\n(Queen business over here)\nAy, ay, ay\nCash rules everything around me\n(Bitches [?] crown, better sit on the throne)\nAy, ay, ay\nAy, ay, ay\n(Show 'em, Debbie!)\n\n[Verse 1]\nCash rules everything around me\nGreen, get the money, bitch\nYou wanna be the queen, get the honey\nGot a beach front view and a breeze\nAnd it seems some sunny\nBitches tryna get a dream, coming for me\nI was born ready\nBitch, I'm born ready\nIf you wanna come against the queen\nBee, the swarm ready\nYeah, we buzzing\nBitch I been buzzin'\nTook impossible and did it like it's nothing, yeah\nLike a prophet, yeah, I'm like a prophet\nEverything I said, I get and went and got it\nWhat you call it? I'm just living\nMeaning we the hoe that got this money coming\nFlowing like a faucet, I'ma toss it\nWe don't even like to entertain all the talking\nNo discussion, we just off 'em, get the coffin\nBitches barking what you're body made of talking?\nOnly talking money here, motherfucker, call it\n\n[Pre-Hook]\nI so fly, can't deny that I'm high\nGet rich or try it, eye for eye, do or die\nI rule the world, fuck your rules, I defy\nI, I do for I, made my moves move the sky\n\n[Hook]\nThis is what it look like, like, like, like\nCook it, took it to the oven\nWatch it risen when it's cooked right, right, right, right\nYou think I'm playing with you bitches? Nah\nThis is what it look like, like, like, like\nBithes talking way too often\nI just smoking and it's good night, night, night, night, night\nI'm sick of playing with you bitches, nah\n\n[Verse 2]\nDebbie, you should prolly get to know\nCrash the Beamer, went and copped a Chevy nova\nPaid tripping, I should prolly get a coaster\nOnly making bangers, I should prolly get a poster\nCruising down the coast\nRep the city like I'm 'posed to\nBitch, you know I been a roller\nI'm a motherfucking soldier\nI could send them hitters like a motherfuckin' Sosa\nBitches laying on the sofa, on the way the bitch is over\nWe don't even like to entertain all the bluffing\nNo discussion, all my bitches get the bussin'\nGot a issue, beat these bitches like percussion\nBitches making moves, ain't no need for interruptions\n\n[Pre-Hook]\nI so fly, can't deny that I'm high\nGet rich or try it, eye for eye, do or die\nI rule the world, fuck your rules, I defy\nI, I do for I, made my moves move the sky\n\n[Hook]\nThis is what it look like, like, like, like\nCook it, took it to the oven\nWatch it risen when it's cooked right, right, right, right\nYou think I'm playing with you bitches? Nah\nThis is what it look like, like, like, like\nBithes talking way too often\nI just smoking and it's good night, night, night, night, night\nI'm sick of playing with you bitches, nah"}], "artist": "Lil Debbie"}