{"songs": [{"year": "2011-11-15", "lyrics": "[Hook x5: Bun B]\nFive on the kush, twenty on the drinks\nSo loaded in the club that a nigga can't think\n\n[B.o.B]\nI said I'm thrown to the side, like a lateral\nI swear tonight I'm doin' major damage, it's collateral\nFifty on the potion, one hundred on the smokin'\nPanoramic roof, but we ride in slow motion\nPatron pass to you, top shelf we toastin'\nTop models, tops poppin' off, Kelly Rowland\nIt's whatever, I never let up, I never feel better\nA house full of freaks and they'll never say never\nMy seats all leather, my jackets all leather\nGot PETA pissed off cause my pillow full of feathers\nSince day one I stay down like a cellar\nBun B, K.R.I.T., B.o.B. we some fuckin' trend setters\n\n[Hook]\n\n[Big K.R.I.T.]\nOk, I roll up and I pour up to the motherfuckin' top\nPimp C, twenty-four, what's a whip if it don't chop?\nSubwoofers in my cushion, what's a trunk if it don't knock\nDigi on the dash, if I want it then I cop\nCause it's G ho, let me work this wheel ho\nIs there difference cause I'm young, huh?\nWhat shit you think a real nigga live for?\nDrink lean and pop pills folk\nSo far in the sky, you can hear God talk when I crack my window\nAnd clear out this endo\n\n[Hook]\n\n[Bun B]\nWell it's mista bigga, swisha picka up, but what's the deal though?\nRolling with your sister, twisting big and blow and kill bro\nTrunk popped open, speakers kick it like a steel toe\nWith a big old bag of that southside swag that I pick up by the kilo\nAll the trill note till they recognize, haters get on the sideline\nKilling roaches like pesticide, then lead em off of my timeline\nGetting older, but I'm colder, better with age like I'm fine wine\nKiller on the mic like Grind Time, how would you like to live my shine?\nI'm too fresh and I'm too clean, getting thrown by routine\nAnd I'm so wavy they like to pay me and this all gravy like poutine\nPimping baby, what you mean? I'm with B.o.B, you with K.R.I.T\nAnd we on the job, trees is lit, so get off the knob playa, we the shit\n\n[Hook]", "title": "5 On The Kush", "album": "E.P.I.C. (Every Play is Crucial)", "image": "https://images.genius.com/e5a4565350f88e7eb8d8b6e1a5b364fb.500x500x1.jpg"}], "artist": "B.o.B"}