{"songs": [{"album": "Truly Yours 2", "year": "2013-04-30", "title": "Chris Tucker", "image": "https://images.genius.com/eea3c8d569aba2182316f265944de431.896x896x1.png", "lyrics": "[Hook: J. Cole]\nChris Tucker, money talk, motherfucker\nChris Tucker, money talk, motherfucker\nChris Tucker, money talk, motherfucker\nAyy, all you broke niggas be quiet\n\n[Verse 1: J Cole]\nI can't control this urge to fuck hoes and splurge\nMy sidepieces got real jobs, nigga I don't fuck with no birds\nMy main chick she got real hair, never had to shop to get hers\nGot a neat freak that don't eat meat, but goddamn she rocking them furs\nBall so hard mothafucka wanna fine me, and now the hoe wanna climb me\nIf real recognize real, that's why it took a motherfucker like Hov to sign me\nBall so hard I'm the truth nigga, All-Star game catching 'oops nigga\nIf you a bitch and I'm a bitch, I'm Sheryl Swoopes and you hoops nigga\n\n[Hook: J. Cole (2 Chainz)]\nChris Tucker, money talk, motherfucker (Yeah!)\nChris Tucker, money talk, motherfucker (Yeah!)\nChris Tucker, money talk, motherfucker\nAyy, all you broke niggas be quiet\n\n[Verse 2: J Cole]\nCole world, safe to say I'm cold blooded\nIn this cold life the more cold you are seem like the more the hoes love you\nSo I book a flight, she land today, she leave tonight with no luggage\nGot the camera on in my bedroom, shooting video with no budget\nGo! Only nigga up in first class, old lady tryna be friendly, ayy\nShe think I'm in the NBA, why a nigga can't have his MBA?\nNext time I'ma flip the script, you know, kick some shit that's gon' shock her\n\"You're so tall, what team do you play for?\" No bitch, I'm a doctor\nFlow hella proper, Cole never flopped, nah\nFloat like a propeller, no helicopter shit\nKnots thick like a bowlegged chick\nStick dick to a gold digger, won't give her dollar\nFuck your nine I'm a whole different caliber\nNigga say they pop cause they dont fill they collars up\nRead a book get your knowledge up, book a flight get ya mileage up\nBitch nigga...\n\n[Hook: J. Cole (2 Chainz)]\nChris Tucker, money talk, motherfucker (Yeah!)\nChris Tucker, money talk, motherfucker (Yeah!)\nChris Tucker, money talk, motherfucker (2 Chainz)\nAyy, all you broke niggas be quiet\n\n[Verse 3: 2 Chainz]\nI'ma start off with these four bars\nI'm in a barbie at a sports bar\nI'm rockin' gold bars, whoop your ass with this crowbar\nI'm like \"Oh Boy, catch your girl off that rebound\"\nFix her hair up, get her a re-do\nJust my car out that paint shop, so I guess that's a mothafuckin' re-coupe\nLet me demonstrate, gotta think about it before I go on a dinner date\nMight eat a rich bitch, yes I got me expensive taste\nGot my pockets on full, stomach on full, gun on full, I got full coverage\nNiggas don't know the full story, I'm smokin' on gas, full service\nMoney talk, true story, if you don't got none then don't say shit\nBanana clips going ape shit, if you don't make money you don't make sense\nI got gold on my bracelet, got ya girlfriend chasing it\nBust a nut in her mouth, so now she can baby sit\n\n[Hook: J. Cole (2 Chainz)]\nChris Tucker, money talk motherfucker (Yeah!)\nChris Tucker, money talk motherfucker (Yeah!)\nChris Tucker, money talk motherfucker\nAyy, all you broke niggas be quiet\n\n[Outro: J Cole]\nThis liquor I've been sippin' got me kissing all these models\nAnd I might not see tomorrow, I might not see tomorrow\nPlease don't tell my momma I spent my tuition on these bottles\nJust to pay back all these loans man we gon' have to hit the lotto'"}], "artist": "J. Cole"}