{"songs": [{"lyrics": "[Intro: Puff Daddy (Jay-Z)]\nBad Boys\n(Puff what up nigga? Let's go half on a boat!)\nCome out and play\nYou know we had to do a remix right? (Me too, uh, Young!)\n\n[Verse 1: Jay-Z]\nYou niggas is ass, I put your ass in a bad play\nThis ain't no fair one, get rid of you the fast way\nSki mask way, pull hammers from the coat\nThis ain't no handgun, this shit'll sink a boat\n(What boat?)\nAny one in the Atlantic, the S.S. Minnow, the Titanic\nSend a distress signal like poof\nRed flares in the air don't matter to me\nSend the army, coast guard, the whole faculty\nI see and I raise you one, I raise guns like Bebe's kids\nThe Bad Boy but no I'm not Janice's, I'm Gloria's warrior\nWhen I flash the tool, leave you stiff like photographers\nY'all don't got heart for this art of war\nMy arsenal is more awesome than yours\nWhen Hov' in the building niggas lost from the door\nFrom the front porch 'cause I have no flaws\n\n[Chorus: Jay-Z]\nY'all keep acting like y'all don't hear\nI put this little red laser in your ear\n\n[Verse 2: Jay-Z]\nNo rap, you rat, you wack, you bore me\nI wanna end your career but you gon' do it for me\nI'm, one of the greats\nYou know Young demand 'bout a hundred out the gate\nFor a flyer with my face (woo!)\nI'm like Mariah with the cake\nLord knows 'bout to retire with Mase\nAll my broads look like Mya in the waist\nAll over the country like Shania in the face\nI brought the pliers to the place\nTo apply pressure, I don't know how you gon' take\nNiggas acting like they flying with a cape\n'Til I bring 'em to Earth then they hiring the Jake\nMonkeys can't look the lion in the face\nThe king of the jungle, nigga, did I mumble?\n\n[Chorus: Jay-Z]\nY'all keep acting like y'all don't hear\nI put this little red laser in your ear\nI'm saying this slow so you clear\nI put this little red laser in your ear\n\n[Verse 3: Jay-Z]\n(Is he?) Uh, I'm dead serious\nSave them games you play for Lil' Vicious\nI bust a deuce-deuce in your bubble goose\nGod damn, Brooklyn to Hollywood, I'm so good\nThe Roc denim jeans, uh!\nS Dots in green, the red Roc chain\nYou gotta love it how he does it (how he do it?)\nHow I hustle a dollar then I double it\nY'all ain't fucking with my déjà vu\nY'all can't double down the way I do\nNigga, The Blueprint 2, I move three\nY'all can't move me from the number one spot\nRun the numbers on S Dot\n\n[Chorus: Jay-Z]\nY'all keep acting like y'all don't hear\nI put this little red laser in your ear\nI'm saying this slow so you clear\nI put this little red laser in your ear, geah", "title": "Laser In Ya Ear (Freestyle)", "image": "https://images.genius.com/0572d3c2a8305ab228c6cfdc3005ee89.300x300x1.jpg", "year": "2003-11-28", "album": "The S. Carter Collection"}], "artist": "JAY-Z"}