{"songs": [{"image": "https://images.genius.com/a3fd279a06905f403dad30fe443fdc0e.600x600x1.jpg", "title": "Bye Baby", "album": "Life Is Good", "year": "2012-07-17", "lyrics": "[Produced by Noah \"40\" Shebib & Salaam]\n\n[Intro: Guy sample]\nI guess you knew and blew a good thing, baby\n\n[Verse 1: Nas]\nBye baby, I guess you knew why I walked away\nWhen we walked to the altar, that was an awesome day\nDid counselling, couldn't force me to stay\nSomething happens when you say I do, we go astray\nWhy did we mess it up? We was friends, we had it all\nReason you don't trust men, that was your daddy fault\nHe in the grave – let it go, he no longer living\nSaid you caught him cheating with mom, fucking other women\nFuck that gotta do with us? Here's the keys to the newest truck\nBirkin bags, we burning cash, now baby, do it up\nNo matter who you fuck, that was before me\nWanted you as my shorty since before I saw you screaming\n\"Hate you so much right now\"\nShould've saw the meaning, angry black woman\nActions of a demon, I'm leaving\n\n[Chorus: Guy sample (Nas)]\nI guess you knew and blew a good thing, baby (Bye baby)\nYou know I'm saying bye-bye (Bye-bye baby)\n'Cause I'm saying bye-bye (Bye baby)\n'Cause I'm saying bye-bye\nI guess you knew and blew a good thing, baby\n\n[Verse 2: Nas]\nBye baby, I guess you know why I had to leave\nSeven months in your pregnancy, 'bout to have my seed\nLet's take it back some years, rewind it to the happy years\nYou and your Star Trak fam, I'm thinking you cats are weird\nSame time, different year, I was digging y'all flow\nThen I tatted you on my arm so niggas would know\nI thought no one could stop us, matching gold watches\nI was your Johnny Depp, you was my Janis Joplin\nYet the cuter version, yet I knew you personally\nBetter than you knew yourself – and I knew this for certain\nCrib in the Dominican, you got away from everybody\nYou screaming at the racist cops in Miami was probably\nThe highlight of my life, like \"Ha, yo, look at my wife!\"\nGangsta, me and 20 cops 'bout to fight, crazy night\nBailed you out, next morning we got clean\nLike it never happened, and later we at that Heat game\nJust another day in the life of two people in love\nBut it wasn't enough, so baby, guess what...\n\n[Chorus: Guy sample (Nas)]\nI guess you knew and blew a good thing, baby (Bye baby)\nOH! OH! AHHHHHHHH! Bye-bye (Bye-bye baby)\nI can't believe that this is happening to us\n'Cause I'm saying bye-bye (Bye baby)\n'Cause I'm saying bye-bye\nI guess you knew and blew a good thing, baby\n\n[Verse 3: Nas]\nListen, could you imagine writing your deposition\nDivorce lawyer telling you how this thing gonna be ending?\nWith you paying out the ass and I'm talking half\nNot some, but half, no, serious, half\nHalf of your soul, half of your heart, you leaving behind\nIt’s either that or die, I wanted peace of mind\nAnd all I seen was selfish cowards\nUnder their breath, saying, \"Why did Nas trust her?\"\nBut look at yourself! Speak louder, bruh!\nYou live with your baby moms\nAnd scared to make an honest woman out of her\nAnd make her your bride, fake pimps, you ain't even alive\nAt least I can say I tried plus enjoyed the ride\nPlus we got our little boy, my little joy and pride\nHe got my nose, my grill, your color, your eyes\nNext go round I hope I pick the truest type\nAnd watch me do it all again – it’s a beautiful life, aight?\nGoodbye!\n\n[Chorus: Guy sample (Nas)]\n(Bye baby) Baby.. baby\nYou know I'm saying bye-bye (Bye-bye baby)\nI can't believe that this is happening to us\n'Cause I'm saying bye-bye (Bye baby)\nI guess you knew and blew a good thing\nYou know I'm saying bye-bye\nI guess you knew and blew a good thing, baby\n\n[Outro: Guy sample]\n'Til we make love just one more time\nMake it seem forever\nThis is our last and final goodbye\nGoodbye"}], "artist": "Nas"}