{"artist": "Ant Banks", "songs": [{"title": "Got Ta Hustle", "image": "https://s3.amazonaws.com/rapgenius/58573415.jpg", "album": "The N.W.A. Legacy, Vol. 2", "lyrics": "[Intro: MC Ren Talking]\nYo, check this out niggas\nSome more motherfuckin West coast shit, nigga\nFrom L.A. to \"The Whole Damn Yay,\" it's going down nigga\nOoooooh.... shit\nMC Ren up in this motherfucker man\nYou know how we do nigga\nWe dwhat the fuck we wanna do, on the West coast nigga\nThe best coast nigga, or the\nI mean, thisk we gonna do Ren...\nCall me nigga Banks nigga\nPut this shit down your punk ass like this..\n\n[Verse 1: Ant Banks]\nNow here's East doughs\nGo and put they mack down all in the streets\nAnd the, two boss players is rollin for keys\nBut it's ships outta notes\nNo hustle-Ass-Niggas actin like hoes \"like hoes\"\nShit's gotlinded, nigga what don't get dummy\nYou better cline, you're acting like you scare of money\nI can show you how tame, you put your G's first\nSteady trippin with the next nigga got it on\nIt grse.......\n\n[Verse 2: MC Ren]\nNigga please\n\n[Hook]\nGet your hustle baby\nAre all you live to grind, you make your body hustle baby \"that's right\"\nCan't comprehend what here we in road, you got to hustle baby\nI swear I spread mob, everybody hustles baby \"feel me\"\nNo need that lies spoke y'all \"come on\"\n(*Phone ring sound*)\nI'm just a player roll with the real ones \"with the real ones\"\nIt's all about the paper chase \"the paper chase\"\nWith the money and things to have thangs\nI bought the big Thanks \"Big Thanks\"\nWith the niggas that don't be makin them fade\n\n[Verse 3: Dollar Bill]\nNigga what you thought I'mma grind till I get caught\nEvery thang I bought and every thang I stacked in the boat\nCame for me at soldier the streets\n5.8 grand pair shoes inserted into my feet\nDiscriminate how I eat and feel your body temperature heat\nNiggas standin in and out the real and quick to stack\nEverything I mean at night is pussy and count\nDollar Bill is gettin paper, niggas mate without a pager\nI guess it's in your nature, there's a God mager \"uhh\"\nI can't be side track from gettin scratch\nDon't be fool bout the wrap I still roll the sack\nDon't be a L.G. cause wall D sell 'em corm\nWhere I'm from, every body gets the hustle on........\n\n[Hook]\n\n[Verse 4: Ant Banks]\nGold niggers wanna ride on bozack\nCause we sell out shows\nAnd yell out flows just to tell our hoes\nThe rainbows back with that pimp mentality \"yeah\"\nPure bread age when you raised in Cali'......\n\n[Verse 5: MC Ren]\nNigga it's all on my back, they got they noses on my sack\nLookin for bitches and a free act\nD.J. gotta contract, nigga with the 'Bill\nTo put your hands on my sckrill, my dick is your free peal\nGet up off your ass and get it\nDon't be lookin for the Villain to get it\nMy black ass won't spit it\nCall me nigga Banks my nigga \"that's right\"\nFrom the Bay, be fuckin you like trey\nCause we're hustlin' all day....\n\n[Hook]\n\nShake it all you busters makin Sckrill this is how we do it \"that's right\"\nShake it all you haters makin Sckrill this is how we do it \"that's right\"\nShake it all you busters makin Sckrill this is how we do it\nShake it all you niggas makin Sckrill this is how we do it\n\n[Outro: Ant Banks]\nHow we do it, I mean this is how we do it for the wild to the Yay baby\nAll motherfuckin day, y'all know, this is not the feelin\nAll right, MC-motherfuckin-Ren The villain\nDollar Bill, the money makin ass motherfucker from the town\nAll right, hey you nigga, the Big-Bad-Azz and me, Bitch!", "year": null}]}