{"artist": "Yung Joc", "songs": [{"album": null, "image": "https://images.genius.com/22499e1de4fddec5dee3a6c7062bbea4.420x420x1.jpg", "year": null, "lyrics": "[Intro: Yung Joc] + (Ms. B)\nEenie, meeny, miney, moe\nHow many girls from the club won't go\nI knowwww you see it; I knowwww you see it)\n(I'm like Eenie, meeny, miney, moe)\nHow many players in the club won't go\n(I knowwww you see it, I knowwww you see it)\n\nYung Joc\nNow you can call me tip drill, they playing my song\nThrow a couple ones, then she throw away her thongs\nWhen she bust it open, take a picture with my phone\nShe love my cologne, ???\nNow she jockin', it's goin' down\nSlap the waitress on the booty, tell her \"get another round\"\nAnd when I make it rain, money all over the ground\nFresh force ones, Sean John button down\nAnd then I'm like \"oh boy, a clique fulla stars\"\nBig four fifth, big d**k, and big cars\nAt the end of the day, when it's all said and done\nI need four freaks 'cause I need more than one\n\n(Chorus)\nYung Joc\nEenie, meeny, miney, moe\nHow many girls from the club won't go\n(I knowwww you see it, I knowwww you see it)\nI'm like bim (bim) bam (bam) I know you want some (some)\nShe chewing on the d**k like a piece of bubble yum\n(I knowwww you see it, I knowwww you see it)\n\n[Hook 2: Ms. B]\nEenie, meeny, miney, moe\nHow many players in the club won't go\n(I knowwww you see it, I knowww you see it)\nThen I'm like bim (bim) bam (bam) I know you want some (some)\nYou chewing on the butt like a piece of bubble yum\n(I knowwww you see it, I knowwww you see it)\n\n[Ms. B]\nI ain't never been the type to show off in the club\nReal laid back poppin' plenty bottles of\nBub, don't smoke but I got much purp\nGet that nigga real high, make him slurp it then burp\nCould you be a groupie? I hear you singin' my song\nLike I see you, lemme feel your tongue\nIt's me, Ms. B. n***a, let me get you laced\nTake a step back, blow the pussy in ya face\nI ain't talking kush n***a, talking a rat race\nSo many to choose from, give 'em all a little taste\nGotta house fulla p***y, the madam of hip hop\nMy bitches are superstars, so gushy you need a mop\nYea\n\n(Chorus)\nYung Joc\nI got stacks on deck, snowflakes on my neck\nNew J's on my feet, make my outfit complete\n(I know you see it, I know you see it)\n\n[Ms. B]\nI got stacks on deck, n***as love my flow\nGot a mohawk blowin', air forces that glow\n(I know you see it, I know you see it)\n\n[Yung Joc]\nEenie meeny miney, moe\nHow many girls from the club won't go\n(I know you see it, I know you see it)\nI'm like bim bam, I know you want some\nShe chewing on the dick like a piece of bubble yum\n(I know you see it, I know you see it)\n\n[Ms. B]\nI'm like Eenie meeny miney, moe\nHow many players in the club won't go\n(I know you see it, I know you see it)", "title": "I Know You See It (feat. Brandy “Ms. B” Hambrick) (Promo Only clean edit)"}]}