{"artist": "A$AP Rocky", "songs": [{"title": "Hear Me", "image": "https://images.rapgenius.com/93ce6d56cc41f6923487ff860a78d83a.500x500x1.jpg", "album": null, "lyrics": "[Verse 1: A$AP Rocky]\nFirst of all, I would like to start by saying\nI'm the motherfucking man, just thought I'd let you niggas know, hear me?\nIf the shit hit the fan and these rappers start\nThe pen coming at you niggas' throats, hear me?\nDo it big out in Cannes\nAt the film festival, nigga, every year I go, hear me?\nBig dick, that's my man\nKeep forty bitches round, bring 'em everywhere I go\nHear me? Hear me? Chilling on a boat\nIn the south of France, island happened off the coast\nSaint-Tropez when I'm waving to the folks\nGot the young trap lord with me looking like the Pope, hear me?\nGrew up living broke\nBefore we'd seen it all, niggas had to dream it all\nDon't you compare me cause there ain't nobody near me\nThey don't see me but they feel me\nThey don't feel me but they feel me, they hear me\n\n[Hook: A$AP Rocky & Pharrell]\nHear me?\nYoung niggas doing what it takes to survive\nHear me?\nYoung niggas only pay attention if it's fly\nHear me?\nAll I ever hope to do is prosper when I strive\nHear me?\nIf they ain't playing in the game then they hating on the side\nHear me?\n\n[Verse 2: A$AP Rocky]\nBlack dark shades, black leather jacket\nBad chick on my arm got me looking like The Fonz, hear me?\nWe the champions and about to get a ring same size as LeBron's, hear me? Hear me?\nYeah, life is a bitch and it's no holds barred, every man for themselves, hear me? Hear me?\nAnd if you ain't a man and your name ain't Solange\nKeep your hands to yourself, hear me?\nBut I don't know them grown folks' business\nThe thoughts that they plant like it's photosynthe-sis\nIn your bits, put their nose all in it\nI bring 'em to the light with my photogenics\nHear me? Fuck all those critics\nIf Flacko on the booth, that mean a killer on the loose, ooh\nDon't you compare me cause there ain't nobody near me\nThey don't see me but they feel me\nThey don't feel me but they fear me, they hear me\n\n[Hook: A$AP Rocky]\nHear me? Hear me?\nYoung niggas doing what it takes to survive\nHear me? Hear me?\nYoung niggas only pay attention if it's fly\nHear me? Hear me?\nAll I ever hope to do is prosper when I strive\nHear me?\nIf they ain't playing in the game then they hating on the side\n\n[Verse 3: A$AP Rocky]\nUh, third verse, turn to third gear\nI left a couple things out like the third wheel\nThese niggas lying on tracks without a third rail\nCause yeah, I'm only stating facts when I'm saying on wax\nIn your ear like I'm cleaning out the wax\nThey don't hear me like they're deaf, \"it was wack\", was dirt there?\nHear me? Yes, I gotta talk about the trap\nMatter of fact, let me talk about rap cause I've served here\nYeah, hear me? Hear me?\nMan, fuck the bullshit cause now I'm in my zone, hear me? Hear me?\nI hear the same bullshit in every other song, hear me?\nSo I try to give 'em something different, listen when I'm on, hear me? Hear me?\nSaddest thing about it is they only pay attention and they miss you when you're gone, hear me? Hear me?", "year": "2016-01-27"}]}