{"songs": [{"year": "1999-11-30", "album": "Amplified", "image": "https://images.genius.com/6e84984f4b00329695a16521d47f4aca.300x300x1.jpg", "title": "End Of Time", "lyrics": "Q-Tip:\n\nJust feelin' things out for real, ya know?\nJust wanna do me for real, ya know?\nNo reason to make it complicated, for feelin' agitated\nYou love it or you hate it…fuck it\nDesperation jumpin' off of street corners and\nHustlas lookin for runs like Pop Warner and\nLocal state officials….man they out of touch\nGetting money for some, aiyo, ain't nothin' much\nBut yo…let them tell it, we smoke it and we sell it\nYou don't understand, so don't gel it\nYou sneakin' souls just for phat diamond golds\nCuz our lady friends have likings for designer clothes\nPeople in my hood think….if I'm lookin raggedy, then the cat is just a weakling\nIn the very fake chain of oppression….the television taught me any lesson, it's\n\"Image is Nothing\", but yo I got a thirst\nNothing, but yo I got a thirst\nNothing, but yo I got a thirst\nWhat's worse?  Your rings or your purse?\n\nJonathan Davis (KoRn):\nAll aboard!  All aboard!  Make your way to the back there! Hey you!  Step lively!  Women and\nChildren first! What's wrong with you?\nThe world is coming to an end!\nCome on now, we're looking at the end!  There's not enough room for freakin' everybody!  We have to leave all of our paraphernalia behind!  Come forward wankers!  All of those wankers!  Come on, let's go!  This way!  Come on now, lot!  We're looking at the end.  Let's go!  Move it to the back, there!  Come on now, let's go!\n\nJohnathan Davis:\nBuck that, bum back\nBum dick, broke back\nBaghdad, bomb back\nBum dick, right back\nDark dick, broke back\nRight back, bomb that\nBum dick, bomb back\nBomb back!\n\nJohnathan Davis:\nIt's kinda scary you see\nHow fucked up things can be\nEach time you take a breath\nHell it could be your last\nThere's so much shit around us\nThings we can't even see\nIf this is end of the line\nThat's where I wanna be (repeat 4x's)\n\n[HOOK]\nEnd of the line/\nEnd of time (repeat 4x's)"}], "artist": "Q-Tip"}