{"songs": [{"year": "1989-10-10", "image": "https://images.genius.com/7c84ab3a345d944b61d4c41970988d2c.1000x1000x1.jpg", "title": "Mudd Foot", "album": "The Biz Never Sleeps", "lyrics": "\"Hey Mudfoot, you know what we're here for, lay some treats on us!\"\n-] Fat Albert\n\n[Intro]\nYo, dis is one of the, dis dis\nYo dis is that, that's that joint\nYo that's the.. that's that joint\nYo this is another one from the, y'know\nYou know who it's from!  WHAT?!\nOh, now you don't know who it's from now right?\nOkay, now I'ma just tell you\nYou know this is from the diabolical energetical\nPoetrical numerical new lyrical man, B-I-Z\nEmmezah-emmezah-A-R-K-I-E\nBest on the scene, man appointed rap king in effect\nIf you EVER try to disrespect the Biz Markie\nDisability checks you collect, BUT ANYWAY!\nI'm just bringin you you somethin\nA new, a new a little somethin\nBecause you remember me from y'know, \"The Biz Mark, Biz Mark\"\nAnd from the {*beatboxing*} and all that mess\nAnd you know all the other stuff from like, \"Make the Music..\"\nBut yo, but I'd like to dedicate this to, my best friend TJ Swan\nMy cuz-n, my cousin Cutmaster Cool V\nMy man, my man, and my man, DJ Marley Marl\nCause we in the studio doin this, this is for my NEW DANCE\nSo check it out, everybody ready\nI think he's ready to get, I-ah-I\nI-I just think he's read', I think I'm ready to get hype\n\n[Biz Markie]\nI'm the Diabolical, Biz Markie\nFrom \"Pickin' Boogers,\" the \"Vapors\" - \"Make the Music\" you see\nBut now I'm bringin to you for your enjoyment\nIt's an animated dance for my employment\nYou might remember him from Saturday afternoon\nHe was my favorite character on any cartoon\nBut when you do the dance, you can't stay kaput\nEVERYBODY GET UP.. and do the Mudd Foot\nC'MON!  Get up and do the Mudd Foot\nC'mon, yo yo, yo c'mon and do the MUDD Foot\n\"Hey hey,\" yo hey, yo, do the MUDD Foot\n\n[Interlude]\nNow bust this out\nI'm not even gonna get into no rhymin\nI just want everybody to listen to the funky beat\nWhile my DJ Cutmaster Cool V, cut up what the name of this dance is\n\n{*Cool V scratches \"Mudfoot\"*}\n\n[Outro]\nYou know, I can't really do all that stuff\nYou know I'm not into that cuttin, but\nI want everybody to the dance, let me show you\nYou see, you gotta act like you crippled\nLike you just got one leg, and you know you just gotta just\nYou gotta just, ge-ge-ge-ge-ge-just gotta relax\nAnd just, let the music take over your body and just chill\nCause this is the Diabolical B-I-Z, Emmezah-A-Rrrah\nYou know me from, \"The Biz Mark, Biz Mark\"\nI already said that already, but it don't even MATTER\nBring the bassline back in, now bust this out\nI'm just talkin about, this is gon' be the new thing to take over\nThe next century, cause it's gettin ready to be the 90's\nAnd I want this to be one of the hottest dances comin out\nIt's called the \"Mudd Foot\"\nYou know, you you can't do \"The Butt\" off this music\nYou can't do \"The Wop,\" can't do nuttin else off it\nCan't do the \"Michael Jackson\"\nOnly thing you can do off this music is the \"Mudd Foot\"\nCan't be doin that \"Arsenio Hall\"\nI don't know I don't know how he do that, m-heh-heh\nOr that I.O.U.'n, Scoob and Scrap'n\nAnd anybody else dancin\nOnly thing you can do off this, is, the \"Mudd Foot\"\nSo c'mon, do the MUDD Foot\nYo, I, see, you know I been here\nI been in this studio for about a month\nI'm tryin to teach Swan how to do the \"Mudd Foot\"\nI don't know what the heck he doin, he-heh-heh\nMarley can't even do it, yo\nI'm tryin to teach, Cool V how to the \"Mudd Foot\"\nHe doin the \"Butt Foot\" I don't know what the heck he doin\nBut, the way you gotta do the \"Mudd Foot\"\nYou gotta just kick it, it gotta be like flowin y'know?\nIt gotta be flowin!\nI know everybody from Uptown, by the Apollo, Uptown\nWay Uptown, the Bronx, Brooklyn, Queens, Manhattan, Staten Island\nLong Island!  Everybody from out of state like Kansas City\nCalifornia, everywhere, I can't forget New Jersey, Newark y'know\n{*fades out*}"}], "artist": "Biz Markie"}