{"artist": "50 Cent", "songs": [{"album": "Power of the Dollar", "image": "https://images.genius.com/f29b6e681d1b1237ec06d01ab616992a.600x600x1.jpg", "title": "Da Repercussions", "lyrics": "[Hook]\nYou niggas say somethin' slick, you'll get slapped for that\nYou niggas schemin' on some jewels, you'll get clapped for that\nIf y'all niggas want war, I got the mack for that\nRun up with some work, and get your head cracked for that\n\n[Verse 1]\nNigga if a nickel bag sold in the park, I want in on it\nThe bullshit I'm in right now nigga, I've been on it\nIf I don't eat, nobody eat, code of the street\nNo surrender, no retreat, my niggas rollin' with heat\nYou'll know my steez, I spark trees, under palm trees\nFeel a breeze, and fees, in expanded keys\nCop it straight from the bay, tap dance on the yay\nYour people make a G day, you ain't rich, you just ok\nI take the stand under oath and lie\nBefore I snitch on my clique, I'll fry\nOr watch time go by\nNiggas want to steal slabs, and dib or dab\nIn the posse, who steals from the hands that feed 'em, deserve to die\n\n[Hook] - 2X\n\n[Verse 2]\nYou gettin' money nigga? (yeah!), you thugged out? (yeah!)\nWell 50 Cent is the hottest shit out this year (yeah!)\nYou bust your gun nigga? (yeah!), you on the run nigga? (yeah!)\nYou treat a grown man like he ya son, nigga? (yeah!)\nYo, I ain't the first parolee, to catch his nigga for his rolee\nAnd after being on the street, less than a week (uh huh)\nLook, niggas who know me, know I'm up to no good\nMan my fan base is spreading like HIV in the hood\nWhy smack a nigga silly, when I can squeeze the milly\nA slug'll split a niggas ass, worst than the philly\nI stay with the heater, cut the D with Bonita\nMy wifey kept acting up, so I had to leave her\nIt hurted when I left, but I knew I didn't need her\nIf it wasn't for my seed, I wouldn't even hafta see her\nShe tried to front like she don't need me, she miss me, believe me\nIt's that soap opera shit, the bitch watch too much TV\n\n[Hook] - 2X\n\n[Verse 3]\nAight you niggas tryin' to do too much (STOP FRONTIN')\nThem little bit of chips you got son, (AIN'T NOTHIN')\nI seen you with your whip outside son (YOU STUNTIN')\nYou spent your last on that (YOU AIN'T HOLDIN' NOTHIN')\nRap niggas, they actin' like they ready to flip\nWhen I let off a clip, it ain't a part of the script\nIts like tradition, rap niggas, dyin' they whips\nSo I spent a little chips, to bulletproof my shit\nYou a 6 coupe nigga, but you years behind\nNigga yours a 92, mine's a 99\nYou're not in my league, the ghetto taught me tools to succeed\nShall up I proceed, I'll write it down so you can read\nIf you've been listening, I know you like loving what I said\nIf not you dumb fuck, I just went over your head\n\n[Hook] - 2X", "year": "2000-07-06"}]}