{"songs": [{"title": "I Figured It Out!", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "[Verse 1: brandUn DeShay]\nWe all met at Sam's house about 10 P.M\nOut of work, ready to party with some of our friends\nLaughs and jokes and making phone calls\nAnd Laura staying with me, she said no one's home\nWe've been best friends since we were sophomores\nShe was the one who inspired me to get out more\nHere comes George with the things for the pregame, I don't drink much\nBut I'm not the DD, so more like a backup\nNow we all vacate and head out of the basement\nI heard someone call \"shotty\", I'm too late\nThen we hopped in the backseat with four more\nThis SUV is only a four-door, this ride better be short\nAnd here's Laura next to me, so close that we're Siamese\nBut she's texting me, and the text reads:\n\"Keep an eye out for me, try not to forget\"\nBut I already made that vow from the day that we met\nThe streetlights shine the bluest light\nBut how could I find joy on the bluest night?\nI might have to carry her home, I made a vow\nIf she falls sick, if she passes out\nIf only I was man enough to man up, we could be on her couch\nProbably making out, instead I made a vow\nHopefully this leads to us one day writing vows\nNow everyone's getting out\nWe pile up the doorstep, music is playing loud\nAlmost like a teen movie, how this is playing out\nWe crowd the living room, there's spilled beer\nAmongst all of the madness, a few tears\nLaura's dancing with who knows, and so is the rest of them\nI'm not much of a dancer, I'm talking to Chelsea and a couple of her friends\nLive for the weekend\nThe suburbs' pastime\nAnd nobody asked why\nI'm sick of the same beer I had since I got here\nIt's making my mom proud, I know that she's not here\nI can't help but stare at Laura, the feelings, I wish I only knew\nMy feelings, I wish she only knew too\n\n[Verse 2: brandUn DeShay]\n3 A.M. rolls around, the party is over\nWe all jump back in the Rover\nExcept there's only four this time\nThe other ones got rides and left earlier in the night\nLaid out in the backseat, all I'm thinking is rest\nBut Laura, next to me, lies her head on my chest\nThen like a reflex, I wrap my around\nAnd...\n\n[Sample: Bloc Party]\nI figured it out\nI figured it out\nI figured it out\nI figured it out\nI can see it again\nI can see it again\nI can see it again\nI can see it again\nI can see it again", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}