{"songs": [{"year": null, "image": "https://images.genius.com/37cf871f97468bf3b1525c3f0f5b065c.500x500x1.jpg", "title": "Booth N da Sky", "album": "The Last King", "lyrics": "[Verse 1: Ben Beamon]\nMe, Big and Pac in a black 'lac\nPac got his scar tat, I got my hat back\nBig riding shotgun with a Coogi on, looking for CD to roll a doobie on\nBlunt hittin' hard, Jack Dempsey\nSmoke up in the car, listening to Pimp C\nAfter that, we hit the booth, the killer bee, the track was some J Dilla Heat\nThe hook went:\n\n[Hook]\nEven when a nigga been gone, I'mma still live on\nYeah, my music is alive, then shoot me if you try, but I can never die, nigga\nEven when a nigga been gone, I'mma still live on\nYeah, my booth is in the sky, then shoot me if you try, but I can never die, nigga\n\n[Verse 2: Big K.R.I.T.]\nIn the abyss I resiz-ide, in the skizz-eye\nI throw my Polo embroidered angel wings on and flizz-eye\nAnd hit the nearest block party, to jam out with MJ, Pac and Bob Marley\nFreestyle with Biggie and Pun, Big Year actin' a fool\nAaliyah ad-libbing to Screw on the 1s and 2s\nAnd I mean everything was chill:\nWillie was talking fly, and Marvin Gaye was on the grill\nPimp C sat me down and told me, \"Young'n, keep it trill.\"\n\"It don't matter what they want, just always do what you feel,\"\n\"If you've gotta press something, be the diamond on the wheel,\"\n\"cause being scared to swang down just ain't no way to live\n\"cause even old schools show they grills\"\nThen he said, \"Hold up!\"\nGrabbed some wine, hollered out, \"UGK for life!\" raised his glass and told me, \"po' up\"\nMy granddaddy tapped me on the shoulders\nThen my grandma told me they was so proud I showed up with a booth in the sky\n\n[Hook]\nEven when a nigga been gone, I'mma still live on\nYeah, my music is alive, then shoot me if you try, but I can never die, nigga\nEven when a nigga been gone, I'mma still live on\nYeah, my booth is in the sky, then shoot me if you try, but I can never die, nigga"}], "artist": "Big K.R.I.T."}