{"songs": [{"title": "Lil Shayne", "image": "https://images.genius.com/d39be70f638c88c431339e037c0e69e2.1000x1000x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nMan, this instrumental is ultra... ultra fucked up\nBut, I mean...\nI couldn't find any better\nI had to get on this one\nThis the only shit I was feeling, so\n\n[Verse: brandUn DeShay]\nStarted out hustling, ended up balling\nWouldn't give me her number, she ended up calling\nNiggas claiming they fly, but they ended up stalling\nSoon as their verse started, I ended up LOL'ing\nThat's LOL present tense, Jesus, how I'm raising dead presidents\nAin't got a greatest hits, but you're gonna always get the best of me\nGot a whole, whole lot of heart up in the chest of me\nI ain't gay, but passed with flying colors when they testing me\nEspecially the compos, uh oh, there's trouble, Joe\nFans hype because all my shit tight like some muscle shows\nThrow a couple shows and everybody showing up\nI swear, wasn't a year ago ain't nobody noticed us\nNo need for introduction here, they already know it's us\nThrow this on the iPod, they already know what's up\nIt's us, so they know it's tough, Odd Future back in the spot\nWe at the top, whether you like it or not\nWhile they cooking up schemes, put the caters on them\nUh oh, just ran out of fingers to count the haters on\nSo onto the toes, they're coming with more\nBut, damn it, I'm so gifted, I should come with a bow\nGoddamn it, I'm so lifted, I should come with a rope\nGod-given, I should come with the Pope\nI ain't baking with flour, but yo, I'd love to be rolling in dough\nThey're yelling, \"DeShay, you're on fire!\" Should I stop, drop, or roll\nOr shoot a couple three-pointers like in NBA Jam?\nThere's people swearing they can beat me when they know that they can't\nIt's so sad and shameful, the blame is on them\nThey had a sold-out game and now it's raining on them\nAww, so say hi to the bye-byes and see-you-laters\nYou looking out of date with them wheels like roller skaters\nMan, these niggas is so slow, they modem staters\nShit, I'm trying to get more than haters, they're motivators\nI dropped the world, I'm so clumsy with globes\nBut then again, I dropped my girl, I'm so clumsy with hoes\nBut what do you know? If this a show, then we're co-stars\nOn this track, I'm about to black like Jim Crow laws\nI'm here pleading with the bass, like, \"Why you hitting so hard?\"\nThe whole city on my back, but how I get so far?\nPerseverance and persistence, dog, I had to work truly hard\nYou want the success to come overnight like booty calls\nBut you ain't even getting no booty calls, so how could you metaphorically do it?\nDon't you know that sounds stupid?\nGod gave you a brain, right? So use it, be prudent\nDope producer-slash-rapper-slash-A and B student\nNow I'm the future\n\n[Outro: brandUn DeShay]\nThat's brandUn DeShay\nTelling you to upgrade your GPA\nNiggas\nStay in school\nDon't do drugs, give hugs", "year": "2009-12-25", "album": "Your Favorite! MixTape"}], "artist": "Ace Hashimoto"}