{"songs": [{"lyrics": "[Intro: CPO Boss Hogg]\nHehehehehehehahahahaha\nYeah, it's me again\nSo check it out - ladies, not gentlemen\nDrop your draws, cop a seat\nAnd let's get into this, yeah\n\n[Verse 1: Eazy-E]\nEasily I'm approachin', there ain't no jokin'\nWhen the pussy holes are open\nReady to fuck until my dick is raw\nYo! the muthafuckin' devil's son-in-law\n(Peter Peter, the Pussy-eater)\nNo it's the E, the mothafuckin' pussy-beater\nAnd I’m the quicker-picker-up, I'm quick to pick up a bitch\nSo come here bitch and lick up and lick up and lick up the dick\nNow how many nuts would it take for me\nTo let that bitch graduate to lesson three, let's see\n(Splash splash splash splash splash splash)\nAs you can see I straight waxed that ass\nBack up bitch unless you want nut in your eye\nI never never ever ever seen a bitch cry\nNut one, nut two, nut four, five, six\nI lost the third nut in the mix, fuck it!\n(Hey yo Yella boy, why don't you rewind it!)\nSix, five, four, now three is up\nGimme that gimme that gimme that nut\nYou wanna feel the dick baby try your luck\nBecause the E likes to fuck fuck fuck yo\nI get 'em stuck-on and get the fuck on\nGive 'em a Tootsie Roll and tell 'em thanks for the pussy hole\nI find 'em fuck 'em and flee you know\nBut before I D.O. - yo I take a ho to the hotel\nTo the motel, to the holiday inn\nYo, if that bitch start fuckin' up (What you do?)\nI'll just fuck her friend\n\n[Transition: Eazy-E + Dr. Dre]\nAh Dr. Dre\nWhat up?\nMy mellow\nYo\nIt's on you - so what the fuck you're gonna do?\n\n[Verse 2: Dr. Dre]\nWell, it's on and on and on and on\nYo the beat don't stoppin' 'till the break o' dawn\nYo, every bitch I know they wanna get with me\nThe motherfuckin' notorious D-R-E\nSpit game at a bitch while a nigga's around\nAnd you know most ho's knows not to clown\nCause if a bitch tries to diss me while I'm full of liquor\nI smack the bitch up and shoot the nigga that's with her\nThat's the kind of nigga that you're listenin' to\nTalk to you for a minute then my dick's in you\nYo now every single bitch got a price to pay\nUp on the dicks of N.W.A\nI find 'em fuck 'em and flee you know\nBut before I D.O. - yo, I take a hoe to the hotel\nTo the motel, to the holiday inn (say what?)\nIf that bitch start fuckin' up, yo\nI'll just fuck her friend\n\n[Transition: Dr. Dre + MC Ren]\nNow MC Ren\nWhat up?\nMy mellow\nA check it out\nIt's on you - so what the fuck you're gonna do?\n\n[Verse 3: MC Ren]\nNow gather around y'all, and check it out y'all\nAnd all the bitches come and suck up on my balls y'all\nAnd take a ticket to play with it like a Slinky\nSo put your lips on my big chocolate twinkie\nAnd you swallow all the nut if you bitches are smart\nTo make my dick pop up like a Pop-Tart\nBut after I nut I'mma leave ya\nBut first I must deceive ya, because bitch I don't need ya\nAnd don't say that you love me too\nCause if I turn my back you would fuck the whole crew\nYou're nothin' but a stank ho' tryin' to take my bank ho'\nSo I have to let you know  at a hotel\nAnd a motel and a holiday inn (say what?)\nBecause if that bitch starts fuckin' up yo\nI'll just fuck her friend", "album": "Efil4zaggin", "year": "1991-05-28", "title": "Findum, Fuckum & Flee", "image": "https://images.genius.com/378262f83025b434fc5375a332bd1a1f.800x800x1.png"}], "artist": "N.W.A"}