{"artist": "Ace Hood", "songs": [{"title": "Piss Em Off", "album": "Starvation", "year": "2012-01-01", "lyrics": "[Verse 1]\nFresh on the scene, I just let the swag talk\nWatch, I pull up in that foreign just to piss ‘em off\nHad to whisper to my dog, I say we here to ball\nChain ring, wrist bling, I'mma piss ‘em off\nOkay, more bottles of Rosay\nHermes on her waist, complimented by that oche\nLooking kinda fly Mr. Hood what them hoes say?\nPissing niggas off by the bezel on the watch face\nOn that nick Shorty, this just how the boss play\nPhantom with the two tone, left it with the valet\nYou know how im ridin', catch me couping on a Sunday\nBitch I am the shit. We clear? blu-Ray\n\n[Hook]\nCheck the swag. Yea, it’s on\nGettin’ cash, the bank roll\nI get it fast, never slow\nPiss ‘em off just to let them haters know\nLet ‘em know you will never meet a nigga this fly, I ain’t lying\nGot the top off the wip\nYou ain’t ridin’, you ain’t ridin’\nIf the watch under 40\nYou ain’t shinnin’, you ain’t shinnin’\nPiss ‘em off, you niggas all talk, ain’t buying it\n\n[Verse 2]\nOld man, ten grand, bought the whole mall\nHeard they hatin’ so I did it just to piss ‘em off\nChilling with a bad bitch Mrs. WhatchaCall\nPut her in a red bottom just to piss ‘em off\nGood lord, you know what the wrist cost\nBid the pretty penny probably triple what your rent cost\nYea a nigga shine it, like cutting on a chandelier\nHop in about that Porsche, why of course that be tha Panamera\nLouis, Gucci, Fendi or Versace be my day a apparel\nOh that shit got you talkin’\nIt’s nice, Christmas Caroline with the bullshit\nI do this for real though\nKick it with a player, talking game winning field goal\nSwimming in some money, fuck around and do a backstroke\nYou know how I like it baby, you just keep your back low\nMain I’m a dog, my whips are retarded\nSwag out of space, you couldn’t match it with a martian\nWhatcha talkin’ nigga?\n\n[Hook]\nCheck the swag. Yea, it’s on\nGettin’ cash, the bank row\nI get it fast, never slow\nPiss ‘em off just to let them haters know\nLet ‘em know you will never meet a nigga this fly, ain’t lying\nGot the top off the whip\nYou ain’t ridin’, you ain’t ridin’\nIf the watch under 40\nYou ain’t shinnin’, you ain’t shinnin’\nPiss ‘em off, you niggas all talk, ain’t buying it", "image": "https://images.genius.com/ee1f29169e460342b88aa5c8d75ede59.500x500x1.jpg"}]}