{"songs": [{"image": "https://images.genius.com/31d292c82b0bd3742f39fc65fe0c1bf7.500x500x1.jpg", "album": null, "title": "BULLSHOT", "lyrics": "[Intro]\nAccording to a recent tweet by Iggy Azalea\n\"Diss songs shouldn't be filled with celebrity name drops to pad out lazy bars\"\nI beg to differ\n\n[Verse]\nRihanna never hit me in a text, I take that as disrespect\nSo now I’m gonna diss this set of celebs, just for the Swift effect\nDon't care whether it's correct, this is the internet, we’re here to misdirect\nSo don't get offended, it's just pretend and I'm dissing them, just to hit the trend\nRipping Eminem's latest song, it'd be thick to spend a cent on\nIggy Azalea, real name is Kelly, so maybe you're jelly\nThat Machine Gun's taking the credit, your space on radio and telly\nYou’ve changed, Katy Perry, used to be irritating, but lately you’re very\nWhereas me, I'm the same as I was as a teenager, but with a way bigger belly\nOh, by the way, got a tip for J. Cole, just shut your cake hole\nOh, hey, Dolan Dark, these aren’t memes, they're stolen art\nYou need to see a doctor, Grandayy, grab that needle, cold and sharp\nStick it in Logan's heart, before the rematch show can start\nHe's overdosing on his own ego, we need Maxmoefoe so he can barf\nAt my birthday, someone put on Paul McCartney, I said \"Fuh You, don’t spoil my party\"\nNo one wants anymore of the Carters, we only want Jay-Z or Beyoncé\nI can't say anything about Ariana Grande, without making a tear drop\nAndrew Huang makes music out of anything, why not make it out of earshot?\nCareer got as big as Big Narstie, now it's shrinking in size, Melissa McCarthy\nI'm Dana Carvey, trying to re-create the fame of Garth, Dick Ayoade\nYou're not Moss, and Minecraft's something, that you'll never top, Notch\nBeat the devil out of Bob Ross, make him run out of red, blood loss\nDoes anybody watch Smosh, or did they swap for Vanoss? (gosh)\nBut guess what, whatever it was, I bet it's not Jesse Cox\nWent to the docks and I searched the whole harbour\nStill couldn't dredge anything up as low as Nicole Arbour\nNot even me, when I'm dissing my own father\nOr asking, \"where's your certificate, Obama?\"\nOh, MC Lars, your tracks are like town on a Wednesday, empty bars\nDamn, I'm begging you, Kendrick Lamar, don't smoke, your flow's full of phlegm and catarrh\nI bent my guitar trying to play like Brian May, I should make him send me the cost\nBut he might not pay off, like calling iDubbbz gay\nHey, didn't anybody tell J Cyrus how stale Vine is\nYou're past your sell date, RiceGum\nTyler the Creator, a tireless creator of shiteness\nTried to get the Fine Brothers feat on a track, the cheek, they didn't even react\nDon't know where to start with Jacksepticeye, there's too much for this track to rectify\nThat's the beauty, I don't have to specify, cover my tracks, I misdirect and lie\nJonathan Pie, a collar and tie, won't hide your bile, so curl up and die\nWhy do you even try? Should leave and cry like Stephen Fry\nJeez, I sound like Pyrocynical, the kind of guy that find it difficult\nTo say anything nice, he's like the pinnacle of edgy teens, trying to rebel\nIt's nigh on as bad as ImAllexx, and I simply don't like Callux\nMarkiplier? Bollocks - you can write that in italics\nCasey Neistat is compensating too hard for his lazy life status\nMaking millions saying inane opinions\nI'm hating Maisie Williams, in the same way you're hating minions\nIt's a silly thing, but I really think Lilly Singh shouldn't really sing\nJimmy Kimmel, get off my homepage, and lemme see more Limmy's Show\nLately, there's way too much Amy Schumer, can't get rid of her, baby boomer\nHad enough of that zany humour, I want her gone now, maybe sooner\nJT Music, were you ashamed of your Machinima name, or did you lose it?\nCatch up, we're not living in a kingly age, yeah, I'm looking at you, Lindybeige\nWon't see me in the club, there's a reason, ayy, I dance like Theresa May\nRecently, I've been forcing rhymes, Eminem does it all the time\nNow Shady's forty-five, anyone still check Shade 45?\nBy the way, Oliver Age 24, you're not twenty-four anymore\nJust go away, W2S, and on the way out, close the door\nGameboy Jones should call it quits, I don't know what you're posting for\nNo one's coming for your show, Paul Joseph Watson, there's no conspiracy, no one's watching\nThey just chose an option with no bloke, who's foaming, frothing?\nRode a Salford bus for several stops, just to slag Gary Neville off\nNow that Rap Devil dropped, I can attack Kwebbelkop\nTravis Scott, I've got goosebumps, when I burned the booth of Charlie Sloth\nShefali Oza, weather? He hardly knows her\nGive it up, Stylosa, nobody's watching your show, it's all over\nLike Alex Jones looking at trans phallic zones on his phone\nThough he sprays transphobic rage, he loves dick, Bonecage\nDragging brains back to the stone age, let's locate Post Malone's cage\nHey, ProZD looks just like an emoji, see?\nGive him the stink eye, I miss Pink Guy, how slow could Joji be?\nAn eager beaver, these people are needless as Jessica Nigri's DD procedure\nDon't need to hear Justin Bieber, Wiz Khalifa or Nigahiga either\nI'm recalling Ethan and Hila, getting all in Jordan Peterson's wiener\nBreath reeks of lobster now, better brush your teeth, call Lady Leshurr\nPeter Dinklage need elocution lessons for better speaking english\nHey, Peter Serafinowicz, look around, your second season's really shit\nI blame Graham Lineham personally, says TERF is a slur, but will curse at adversaries\nDoubt? Read all about it, where on earth is Professor Green now?\nEmma Blackery ain't exactly singing masterly\nNew songs sound made in a factory and that's flattery, music quality descending rapidly\nNow lemme give Roomie a tip, try improving your tuning a bit\nLike the surgery Boogie has picked, it's just a band - Scroobius Pip\nHope nobody'll wanna sue me for this, Chris Brown already had too many hits\nHow many people can I humanly diss and how many of 'em will see the humour in this?\n6IX9INE's too busy grooming the kids, is he guilty? Yeah, I'm assuming he is\nChris Pine's no brilliant actor, William Shatner's really a bastard\nDizzee Rascal's as good at music as Gizzy Gazza's as good at movies\nRichard Branson sniffs his pants and Arin Hanson, that man ain't handsome\nJim Chapman, might as well dress in drag or a bin bag\nFuck Big Stig and Syntax, fuck Strippin and Sjin, twats\nI don't donate to Philip DeFranco, Patreon hidden, it's fillin' his bank tho\nI don't hate him, I'm just jealous of him making dollars out of all you fellows\nI make Jacob Rees-Mogg swap place with Snoop Dogg and do drugs\nWith Joe Sugg and Pewdie's pugs, Ozuna's music truly sucks\nI truly hope Armando Iannucci's movies tank\nCoochie coo, Lil Pump don't wanna know what I'd do to your gucci gang\nDonald Trump, what can I say that hasn't been said? I'm all stumped\nLike when I'm watching Watsky ruin his career, what's he doin'?\nI'm obviously too envious of Stupendium to be friends with him\nFRANKIEonPC 1080p's outdated, get a new pentium\nI'm heavily scorning Jeremy Corbyn, anarchy's a better remedy for him\nCould Ellen be more fawning? Forget Stormzy, gimme a storm warning\nI'm goin' all in, Jake Paul is appalling, Jay Foreman is boring\nJames Corden, according to me, is a great big ball of just boring\nI'll call in and diss my Discord server, 'til Brit's a bit more subservient\nBrit, you're my servant, Nick, Jordan, all of you are boring burdens\nI'm an insult-hurling Birmingham boy, pure vermin\nSlow burning, Bo Burnham and pointing out that Hola Soy isn't so German\nDo I rate Elro? Hell no, potientally wish him well tho\nCan't take it, but I dish it out, tell Ricky Berwick to lick his elbow\nDude Perfect, you're as perfect as superfluous feuds, worthless\nNever worked out what your true purpose is, useless as Keem as a news journalist\nFuck anybody who's heard my diss, including you, you're deserving this\nPut the word out quick, NerdOut! ripped me off, I'm not sore about it\n'Cause they're the new kid on the block and I used to be hot, now I'm not like a burnt out whip\nMiracle of Sound, you're really dumbing down, I can already predict your single coming out\nI'd give Aaron Fraser-Nash a razor gash, you're a clown, FabvL, chap, sit down\nShit, wow, look at Daddyphatsnaps' cruddy track, that's bloody crap, that\nBut still, I might pirate it, like I'm on a pirate ship, flying a black flag\nOi, Henry Rollins, you're a punk Phil Collins, fuck Peter Hollens and Jack Frags\nAction Bronson's rappin' nonsense, Elon Musk's an actual nonce\nHe interrupted Andy Milonakis' stream and tried to touch his Johnson\nMy stream of consciousness constantly leaking consonants\nUpon the beat, incontinent concerts in three different continents\nConcertinaed concepts, don't leave a comment, I won't read your correspondence\nI'm more bothered reading Boris Johnson's bollocks columns\nCheated on his wife and he lost the ring so you can't blame the hobbits, Gollum\nAlex Wassabi, I'm sorry that you are not with Lauren\nSid Vicious, gone but not forgotten, unlike Johnny Rotten\nI'm not fond of Benedenedict Cucumberuphisbottom\nPlus, it's not often Hopsin drops something I bother watching\nIf I've got the option, I would rather watch Matt Hoss or nothing\nMake a schedule, Boyinaband, stop going away and annoying the fans\nBut Faze Banks, stay away, thanks, I'm sure when you talk it's great bants\nNah, you're as awkward as a Ricky Gervais dance, so I'm already making escape plans\nHmm, I wonder whether Drake wanks, then shakes hands with underage fans\nI'll sponsor Colin Kaepernick, just to piss off the racist pricks\nI'll take a shit and rub their face in it, then make them pay for it\nFuck David Shrigley, JME, fuck Daniel Craig, Xzibit\nAnd absolutely fuck that Microsoft Word paperclip\nI hate myself\n\n[Outro]\nI'm just playing, all of you fore-mentioned people\nYou know I love you", "year": "2018-09-23"}], "artist": "Dan Bull"}