{"songs": [{"image": "https://images.genius.com/5558befb83c1a20447e8e59fc8c93648.999x1000x1.jpg", "title": "Out the Pocket", "album": "The Sexorcist", "year": "2005-08-02", "lyrics": "(Chorus)\nThis is pimp shit\nIt's the sexorcist\nSlappin you in the face, bitch\nPimp shit\nDon't look me in the sockets\nYou're out the pocket\n\n(Necro)\nYou think you're beautiful slut, have a look in the mirror\nYou'll realize you're better off slicing your throat with a scissor, can I be clearer? Hm\nNo one wants to love a whore, just remember you'll work to repay me immitating Amy sucking members\nDon't tell me to 'be cool', bitch, your future's lookin negative. So bad, you're so poor, you can't pay me enough to let you live\nStop wastin' time and go to your room\nCause I got a customer for you, and he's gonna bust nuts on you\nSo, give him a good time, come on, HEY! YOU BETTER GET A MOVE ON, MAKE ME MONEY, IT'S LIKE THAT, AND THAT'S THE WAY!\nPlus you're only a whore, not a title lady\nSo do a whore's job and do it damn well, baby\nSuck a fuckin dick, same service you give to every trick\nDress up fancy-shmancy, and sell your body for me on the lan-cy\nSportin' panties on your knees, in the street rockin a guarder-builted mini-skirt. January, zero degrees\nThe tock, got you on lock, you payin' me, and you don't want swallowin cock, a little twisted but that's business\nWhat is this? You don't got my money? I don't care how long it takes to get it, just get it, now GET!\n\n(Chorus)\nThis is pimp shit\nIt's the sexorcist\nSlappin you in the face, bitch\nPimp shit\nDon't look me in the sockets\nYou're out the pocket\n\n(Necro)\nYou'll rock bikini briefs, like hamera pumps and a bump, humpin chumps til my pocket looks like it got the mumps\nA pimp is only as good as a product\nWhich makes me great cause my product is who was from the projects\nAnyone can control a slut's body\nBut the keys to control a mind and once a mind's controlled, are behind consoled\nYoung bitches cravin to walk the street pavement\nSexual enslavement's been goin on since cavemen\nYou better get your shit together, bitch\nWrap your tit with leather and walk the strip in sadistic weather\nIt don't matter, spit in your face\nI don't give a fuck if you got raped, you better come up with my pay!\nI'll cut your night skin, You wanna leave me bitch\nYou better learn to sell pussy in Iceland\nI got ten whores, a hundred dollars from each ones, a G a night, seven times a grand, 7Gs a night, this be a'ight\n\n(Chorus)\nThis is pimp shit\nIt's the sexorcist\nSlappin you in the face, bitch\nPimp shit\nDon't look me in the sockets\nYou're out the pocket\n\nHookers are beautiful people, beautiful people"}], "artist": "Necro"}