{"artist": "Yung Joc", "songs": [{"album": null, "image": "https://images.genius.com/22499e1de4fddec5dee3a6c7062bbea4.420x420x1.jpg", "year": null, "lyrics": "Shawty snap (yeah) T-pain\nDamn, shawty snap, Yung joc (shawty)\nHey, hey she's snappin'\n\nSnap ya fingers, do the step, you can do it all by yourself\nWoo, baby girl, what's your name?\nLet me talk to you, let me buy you a drink\nI'm T-pain, you know me\nKonvict music nappy boy ooh\nI know the club close at three\nWhat's the chances that you are rollin' wit' me?\nBack to the crib, show you how I live\nLet's get drunk, forget what we did\n\n[Chorus]\nI'm a buy you a drank (Then I'm a take you home with me)\nI got money in the bank (Shawty, what chu think about that? Find me in the gray Cadillac)\nWe in the bed like (Ooh, ooh, ooh, ooh, ooh)\nWe in the bed like (Ooh, ooh, ooh, ooh, ooh)\n\nTalk to me, I talk back\nLet's talk money, I'll talk that\nKrunk juice bombs, Oakley shades\nShawty got class, oh behave\nLet's get gone, walk it out (walk it out)\nJust like that; that's what I'm talkin' 'bout\nWe gon' have fun, you gon' see\nOn that Patron, you should get like me\n\n[Chorus]\nWon't you meet me at the bar? Respect big pimpin'\nTell me how you feel, mama, tell me what you sippin'\nA certified dime piece deserves Lou-ey one-three\nOne-fifty a shot, three for you and three for me\nI'm checkin' yo' body language; I love the conversation\nAnd when you lick your lips, I get a tinglin' sensation\nNow we're both 'bout tipsy, you say you in the mood\nAll I need is 'bout a hour, better yet, maybe two (two)\nLet me take you where I live, Ferrari switch gears\nWhen I whisper in ya ear, ya legs hit the chandelier\nPassion fruit and sex all in the atmosphere\nI'm a let T-pain sing it so he can make it clear\n\n[Chorus]\nLet's get gone, walk it out (Now walk it out, think about it, ah, snap)\nNow rock, rock, rock, rock\nYou can do it all by yo' self\nLet's get gone, walk it out (Now walk it out, think about it, ah, snap)\nNow rock, rock, rock, rock\nYou can do it all by yo' self\n\n[Chorus]", "title": "Buy U A Drank (Shawty Snappin’)"}]}