{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "[Intro]\nDanny Grooves, drop the motherfucking beat\n\nProbably shouldn't be doing this\nBut it's 2017, and on behalf of all literate people\nWe are sick of illiterate people giving us their fucking opinion\nOkay?\n\n[Verse 1]\nFirst of all Geoff, I hope you burn up in hell\nHere's a list of all the goddamn words you misspelled\nIn the message that you sent me, for better comprehension\nI'm gonna break your message down, every single sentence\n\nYou said I suck at raping, you owe me an apology\nI don't rape, Geoff, I rap, you forgot a 'P'\nAfter 'I just want to let you know' put a comma\nI may suck at raping but I'm good at fucking your momma\n\nMan sharpen up your English when you write\nYou called me moth fucker, Geoff, think before you type\nI don't fuck bugs\nBut I bet that you wish that Tom Brady would come and fuck you with the buttplugs\n\n[Verse 2]\nYou disrespecting my dad and said I like the cheese\nWell that's false too, let's discuss my salary\nFor me, rapper's the greatest career\nI probably pay more in taxes than you make in a year\n\nBut that's not the focus, you can't form a sentence\nWith your idiotic, incorrect use of the ellipsis\nAn ellipsis is three dots, not two dots\nA Greek term that signifies an unfinished thought\nWhich is all you've got\n\nIdiots like you just tug away my heart\nWith your improper usage of these punctuation marks\nListen, if you want to write a paragraph or sentence\nYou need to understand prepositions and tenses\n\n[Verse 3]\nYou shoulda said \"If my daughter brought you home, I'd beat your\nFucking face in with my .45 Desert Eagle.\"\nInstead you got the tense wrong and said Dessert Eagle\nI love desserts, Geoff, that's not a way to hurt Lethal\n\nYou called me Dutch bag, shoulda called me douchebag\nYour parents spelled your name wrong, that's fucking too bad\nThat's not Jeff, I think that says Geoff\nDrop to your motherfucking knees and suck a G, off\nG-E-O-F-F? What? Shoutout to the Jeffs with the J in the front\nAnd the E in the middle two F's in the back\nGo fuck yourself, my name is Mac, your shit is wack\n\nYeah", "year": "2017-03-15", "album": "YouTube", "title": "A Rap Grammar Lesson... for Internet Trolls"}], "artist": "Mac Lethal"}