{"songs": [{"year": "2015-12-11", "image": "https://images.genius.com/c03c0a3f9195d374975890a9196565bb.1000x1000x1.jpg", "title": "Blutdiamanten", "album": "Zuhältertape Volume 4", "lyrics": "[Part 1]\nIch ticke die Cracksteine, fetze dich weg per Brecheisen\nUnd du Dreckschwein spuckst mit deinem Blut ein SOS-Zeichen\nIch bin gekommen, um das Land zu zerbersten\nIhr, um das Handtuch zu werfen, wie Sänger bei Punkrockkonzerten\nDenn es gibt Gunshots ins Herz, ihr labert von Ghettobeton\nDoch wenn ich komm, fallt ihr aus der Rolle wie 'n Mentosbonbon\nDenn ich zerfick' Rapper wie'n Triebtäter\nDeine Stiefväter sind zwei Skilehrer, drei Musiklehrer und ein Briefträger\nHau' ich Kiezschläger per Faust an Betonfassaden\nSieht ihr Face aus als hätt' es 'nen Ausschlag wie Kompassnadeln\nYeah, viel zu viel Cash, doch statt an Kinderdörfer spenden\nKommen die Kröten in'n Schredder wie beim Ninja-Turtles-Gangbang\nDas Bling am Körper glänzt, denn ich bin Boss - das ist indiskutabel\nEs wär sinnlos, zu sagen, K zu dem O sei nicht King in den Straßen\nHundesohn! Ich lasse dich killen von nigerianischen Kindersoldaten\nFür eine Rittersporttafel und paar Digimonkarten, Hurensohn!\nZwischen uns liegen Welten - der Boss ist back!\nSpiegelnde Felgen, lilane Pelze implizier'n der Boss ist back!\nUnd schlägt mit der Faust straight in dein Face mit ner Power\nSo heftig, wenn er dann noch einmal ausholt, Nutte, dann klebst du noch drauf\n\n[Hook 1]\nIch bin kein Studiogangster oder Bluesmusiksänger\nIch bin Deutschlands einziger Zuhälterrapper\nMach mit Rotlicht-Schlampen Geld, roll' auf Kohlefaserfelgen\nNuttensohn, dein Wecker wird ersetzt durch Dobermanngebell\nIch bring' 'ne blutige Ära, so wie Julius Cäsar\nIch bin Deutschlands einziger Zuhälterrapper\nSchicke Groupies anschaffen mit Guccihandtaschen\nFinanziert durch den Import von Blutdiamanten\n\n[Part 2]\nYeah!\nDu machst auf Rauschgiftverchecker, doch was Ecstasy angeht\nHab' ich 'ne ganze Ecke mehr im Haus wie das Pentagon\nAh, lauf, wenn die Gangster kommen, Cockrider\nSonst kommen meine Rottweiler über dich wie Smogschleier\nÜber Großstadthausfassaden\nBin ich Opa, spiel'n meine Enkel Verstecken in meinen Kokastrauchplantagen\nIch tick' Dope nachts auf den Straßen, fick auf Rap\nDenn da ist nur Kleingeld drin wie in Colaautomaten\nIch bin motherfuckin' back im Building\nUnd muss Rapper auf Distanz halten wie Kameras in Actionfilmen\nIch lock' mit Milchschokolade Wilson Gonzalez\nSchick' ihn auf den Strich und sag' zu Freiern: „Ey willst 'n Gonzalez? (zehn Euro!)“\nYo, nachdem ich dich per Poloschläger folter'\nLiegst du so verdreht da, dass dein Yogatrainer stolz wär'\nDas Zuhältertape 4 - schon vor zehn Jahr'n derselbe Sound\nIch erfind' das Rad nicht neu, doch hau' paar Platinfelgen drauf\n\n[Hook 1]\nIch bin kein Studiogangster oder Bluesmusiksänger\nIch bin Deutschlands einziger Zuhälterrapper\nMach mit Rotlicht-Schlampen Geld, roll' auf Kohlefaserfelgen\nNuttensohn, dein Wecker wird ersetzt durch Dobermanngebell\nIch bring' 'ne blutige Ära, so wie Julius Cäsar\nIch bin Deutschlands einziger Zuhälterrapper\nSchicke Groupies anschaffen mit Guccihandtaschen\nFinanziert durch den Import von Blutdiamanten\n\n[Hook 2]\nIch bin kein Studiogangster oder Bluesmusiksänger\nIch bin Deutschlands einziger Zuhälterrapper\nLeer' relaxt ein Magazin in dich glücklosen Punk\nUnd empfinde dabei nichts außer dem Rückstoß der Gun\nIch bring' 'ne blutige Ära, so wie Julius Cäsar\nIch bin Deutschlands einziger Zuhälterrapper\nGeh' kurz Platin mit paar lässigen Punches und Flows zu dem Beat\nHomo-MCs labern weiter von Songwriting und großer Musik - Bitches!"}], "artist": "Kollegah"}