{"artist": "WC", "songs": [{"year": null, "lyrics": "[Intro]\nYea\nTurn the music up a little bit . . .[*Nate Dogg in background] Dah-dah-daaah\nUh, yea Lah-dah-daaah\nA little bit louder . . right there Dah-dah-daaah\n[Nate Dogg:] In the name of the streets\n\n[Verse: WC]\nClick click bu ya! Dub kicked the frame in (uh huh)\nNigga let the games begin, as I standin'\nTossed the tall can on a campus off the limital\nScanners takin' penitentiary chances\nSick wit it, off the ric wit it\nBlue beenie knitted; freshly acquitted\nGrind-grimey, the thick body and the big body\nWit lyrics and 'draulics hotter than the Majave\nSellin', brubble bellin', career felon\nEscalade 3-braid beard wearin'\nFuck it, I thug for free and thug to eat\nNiggas call me \"Home of Cake\" cause I love the cheese\nGangstas, hustlas, pimps, if ya follow me\nLet me see ya put them hands up like a robbery\nI solemnly swear to stay down and slang the seed\nI spit in the name of the streets\n\n[Hook: Nate Dogg + WC]\nI'm gonna roll (I'm gonna roll)\nI'm gon' stay fly (I'm gonna stay fly)\nI'm gonna bust (I'm gonna bust)\nHold my hood up high (throw my hood up high)\nIn the name of the streets\nI'm gonna roll (I'm gonna roll)\nI'm gon' rich ride (I'm goin' rich ride)\nI'm gonna ball (I'm gonna ball)\nHold my hood up high\nIn the name of the streets\n\n[Verse: Snoop Dogg]\nThis the itty-bitty nigga from the city they call LB\nWhat you know about the D-O-G?\nI keep my peeps wit a bag a' treats\nOn the streets my nephews beat your beat and keep that heat\nIn the Cutt and indiscrete\nMe and Dub-C crippin' couzins in this industry\nA lotta' y'all pretend to be\nWanna see friends wit me and then sleep wit the enemy?\nWant some, get some, bad enough take some\nSuckas poppin' off I'm 'bout to take one\nBraids on, make done, don't want none\nAnd just cause we talkin', what you doin' C-Walking?\nIt's not just a dance it's a way a' living\nNow if ya C-Walking, ya best to \"see\" Crippin'\nAnd that goes for kids too, and R&B singers\nNigga quit Crip-Walking if ya ain't a gang banger\n\n[Hook]\n\n[Bridge: Nate Dogg]\nI told a woman I don't love her but she wants to go\nI told another that I want her but she wants to ho\nI ain't a hater I'm a player so I fucked 'em both\nIn the name of the streets\n\n[Verse: Xzibit]\nHigh resolution, high definition\nLet the tape roll let the whole world listen\nHold your position, don't go backwards\nI'm frontlining and the West keep shining\nFuck wit ya nigga your boy \"X\" still grindin'\nFuck them other niggas they just high siding\nTalking and lie, bitchin' and cry\nGossip and hate but ain't nobody's right\nFuck going diamond if ya make it turn pussy\nDon't push me, peep game like a booky\nThe hook lining singer, the deep thinker\nEgo auto-biography beat it nigga ya bother me\nGlass hit them hard, take no prisoners\nBeen choiced for the voice\nI speak for my people like a Senator\nRaise up, the blunts get blazed up\nSwing like a gorilla nigga you ain't a king, c'mon!\n\n[Hook]\n\n[Outro]\n[*Nate Dogg in background] Dah-dah-daaah\nYea . . . Lah-dah-daaah\nDub-C . . . Dah-dah-daaah\nThe \"Ghetto Heisman\"\n[Nate Dogg:] In the name of the streets\nSwangin' through a hood near you [*over last line of outro] Dah-dah-daaah", "image": "https://images.genius.com/d5c581e7b9187269a56ff8d1646efc7e.220x220x1.jpg", "album": "Ghetto Heisman", "title": "The Streets (Remix)"}]}