{"songs": [{"image": "https://images.genius.com/7521267b7988b507395d65324d39651d.1000x1000x1.jpg", "title": "Hello New World", "album": "Hell Hath No Fury", "year": "2006-11-28", "lyrics": "[Intro: Pharrell]\nStraight crushing you\n\n[Hook: Pharrell]\nHello new world, here we come on them Twinkie trains\nWith the hood screaming, \"We on our way\"\nCan't forget where I come from\nSo I extend my hand to my man, screaming, \"I'm on my way!\"\nYes, I rap, but best believe, them things still get wrapped\nBy Papi, screaming, \"It's on its way!\"\nI can't wait for the next nigga from my hood to say\n\"Look out world, I'm on my way\"\n\n[Verse 1: Pusha T]\nI listen to the beat and the rhyme is wrote\nSee, I was 16, eyes full of hope\nBagging up grams at the Hyatt, though\nThe news called it crack, I called it Diet Coke (Ohhh!)\nAt the same time, hiding from mama, dodging the drama\nFucking plenty bitches while ducking the baby mama\nI found poetry, excuse me, Floetry\n\"Say yes!\" niggas hear the \"yuugh!\" and they know it's me\nMake ‘em sick to their stomach how they s'posed to be\nSipping on a 50 foot yacht, nigga, motion free\nOcean in my backyard where its s'posed to be\nFunny how my neighbors don't think its where I'm s'posed to be\nThey think I'm cuter in jail\nBut the only time I'm boxed in is when the roof's on the SL\nAnd that even come off, so that would mean I'm visiting\nNew world, I hope y'all listening, envisioning\n\n[Hook: Pharrell]\nHello new world, here we come on them Twinkie trains\nWith the hood screaming, \"We on our way\"\nCan't forget where I come from\nSo I extend my hand to my man, screaming, \"I'm on my way!\"\nYes, I rap, but best believe, them things still get wrapped\nBy Papi, screaming, \"It's on its way!\"\nI can't wait for the next nigga from my hood to say\n\"Look out world, I'm on my way\"\n\n[Verse 2: Malice]\nThis goes out to my A-alikes that hang out on them corners\nWho rock Air Nikes, live a hustler's way of life\nIn white tees, constantly, ducking from Ds\nPumping that D arm readily, waiting to squeeze\nWho stay cookin, stay lookin, over they shoulders\nHoldin them boulders, tryin to avoid central booking\nI ain't coming at ‘cha, quote-unquote \"famous rapper\"\nWho turn positive, try to tell ya how to live\nBut this information I must pass to the homies\nIf hustling is a must, be Sosa, not Tony\nWe can all shine, I want your wrist lit like mine\nNeck and ears, I want it lit like mine\nForeign cars, stick shift, six gears like mine\nAnything that keep mama from crying, visiting\nYou from behind that glass, while you away, sentencing\n'Cause the judge is saying \"Life\" like it ain't someone's life\n\n[Hook: Pharrell]\nHello new world, here we come on them Twinkie trains\nWith the hood screaming, \"We on our way\"\nCan't forget where I come from\nSo I extend my hand to my man, screaming, \"I'm on my way!\"\nYes, I rap, but best believe, them things still get wrapped\nBy Papi, screaming, \"It's on its way!\"\nI can't wait for the next nigga from my hood to say\n\"Look out world, I'm on my way\"\n\n[Interlude: Grimey]\nYo, what up, what up. This is ya man Grimey from downtown Norfolk. Just want y'all to know it's about time for us to come up and make a change, man. They keep tryin' to keep us down, but that ain't the way to be, man. It's about time for us to get it together, man. Ery'body else put they shit together. Why the niggas can't get together, put they money together? Hustlers come together with hustlers, know what I'm saying? This ain't just for the playas in VA. This for playas all over the world. This is Grimey\n\n[Verse 3: Pusha T]\nTimes-a-wasting, niggas doin so much hatin\nFree ya heart, and show ya greatness\nI, like you, had to come from up under the basement\nJust like you, had Satan tryin my patience\nStill you look at me through jealous eyes\nI wish to see all my niggas rise up! Get that money\nPut them 9s up, piggy-back out the ghetto ‘for times up!\nNiggas rush!\n\n[Hook: Pharrell]\nHello new world, here we come on them Twinkie trains\nWith the hood screaming, \"We on our way\"\nCan't forget where I come from\nSo I extend my hand to my man, screaming, \"I'm on my way!\"\nYes, I rap, but best believe, them things still get wrapped\nBy Papi, screaming, \"It's on its way!\"\nI can't wait for the next nigga from my hood to say\n\"Look out world, I'm on my way\""}], "artist": "Clipse"}