{"songs": [{"lyrics": "[Intro: Pharell Williams]\nOh oh oh oh\n\n[Chorus: Mary J. Blige, Pharell & JAY-Z]\nI'm taking out this time (uh huh, uh huh)\nTo give you a piece of my mind\nThis what we do 'bout this time of year\nWho do you think you are? (uh huh, uh huh)\nBaby one day you'll be a star\n\n[Verse 1: 2Pac]\n(Oh, shit)\nStarted as a seed from the semen; straight outta papa's nuts\nLustin' for creamin' - bitches with big butts\nCurves make a nigga cry, tits and shit\nWhen I'm locked down beggin' you for porno flicks\nSneak weed in, help a nigga pass the time\nPut my name tattoo'd so that ass is mine\nTell everybody; 'Pac put it down for good\nA local legend through the whole hood, follow me\nI got a gun on me, goin' for none on the run baby\nYou know a nigga need some, is my son crazy?\nWhy I cry, when I be thuggin' 'til I die\nPicture a nigga in heaven, high off weed I fly\nGot me missin' dead homies wishin' phonies would die\nHit the weed and hope it get me high; dear God\nUnderstand my ways, livin' major\nBlessed with a thug's heart.. and a real live nigga nature\n\n[Pre-Chorus: Busta Rhymes]\nYes you know I'll die for you\nAnd ya know I'll ride with you\nI will always try with you\nAnd give ya my love and cry with you\n\n[Chorus 2: Mariah Carey]\nI will climb a mountain high aha\nUntil I was up to touch the sky\nSo baby come and get more close to me\nThis is where your love is supposed to be\n\n[Verse 2: 2Pac]\nI let you kiss me where it hurts\nMe and you gettin' busy, slingin' dick in the dirt\nMet you at a pool party it was cool to kick it\nSee us, tongue-kissin', you was truly with it\nLittle Ecstasy, Hennessy, mix with me\nPicture me pay for pussy when the dick's for free\nHey now, where my niggas at? Tell these hoes\nBefore I pay; I jerk off, word to Moses\nVisions of you sittin' there sweaty and wet\nPointin' to the places that you want me to hit\nGive me room all up in the womb, call the cops\nNigga, hittin' walls 'til them bastard drop\nLabel me Makaveli - thug nigga with bite\nLivin' life like a rock star's Friday night\nMake money, get pussy, always keep a pager\nCell phone in the ride to complete my nature, feel me!\n\n[Chorus 3: Mary J. Blige]\nBut until then lately, I'm the one who's crazy?\n'Cause that's the way you're making me feel\n(Young's in the building)\nI'm just trying to get mine, I don't have the time\nTo knock the hustle for real\n\n[Verse 3: Jay-Z]\nYo, y'all niggas lunching, punching the clock\nMy function is to make much and lay back munching\nSipping Remy on the rocks, my crew something to watch\nNothing to stop, un-stoppable\nScheme on the ice, I gotta hot your crew\nI gotta, let you playas know the time like Movado\nMy motto, stack rocks like Colorado\nWaddle off the champagne, Cristals by the bottle\nIt's a damn shame what you're not though: (who?) me\nSlick like a gato, Jay-Z\nMy pops knew exactly what he did when he made me\nTried to get a nut and he got a nut and what\nStraight bananas; can a playa see me\nGot the US Open, advantage Jigga\nServe like Sampras, play fake rappers like a campus\nLe Tigre, son you're too eager\nYou ain't having it, good me either\nLet's get together and make this whole world believe us, huh\nAt my arraignment screaming\nAll us blacks got is sports and entertainment, until we even\nThieving, as long as I'm breathing\nCan't knock the way a playa eating, yeah", "title": "Can’t Knock The Hustle (The S. Carter Collection Remix)", "image": "https://images.genius.com/0572d3c2a8305ab228c6cfdc3005ee89.300x300x1.jpg", "year": null, "album": "The S. Carter Collection"}], "artist": "JAY-Z"}