{"artist": "Half A Mill", "songs": [{"album": "Milíon", "lyrics": "[Chorus]\nSome niggas Blood and some niggas Crip\nSome niggas thugs and some niggas is bitch\nSome niggas ain't got nothin some niggas rich\nSome niggas die frontin and some livin the shit\n\nChorus 2x\n\n[Verse 1]\nAyo, we play for keeps, taught from day one how to blaze the heat\nThree-hundred and sixty ways to eat, razor blade your meat\nI'm getting something, if not, then I'm hitting something\nDefinetley, especially if my ribs is touching\nOut for mine, for your shines I'll blow you out your mind\nYou could throw a thousand signs\nI'm only concerned about the dollar signs\nStashing my cheese, stashing my crack in back of my Fi\nState to state, nationally!\nActually, factually\nI'll fracture every member of your faculty, send your cavalry!\nI got M1's and macs with me, send your cash to me\nI'll have them niggas scared to ask for me\nThrow your man off the Tappanzee\nOther members of your running, where the traffic be?\nHighland, he busting big guns, they coming after me\nI'm wilding, real live shit, ain't no acting B\nIt's not a game, we ain't playing\nDun, we spraying, won't stop till everyone laying on the pavement\nEvery nigga you came with is getting painted\nWe specialize in wetting guys, technicalize\nSmith & Wessun-ilize, I've seen the best of them die\nEspecially, testing I, put the teck to your eye\nSo you can see death, take a deep breath\nAnd say goodbye, Why!?\n\nChorus 2x\n\n[Verse 2]\nStreets is too real, thug nowadays is to ill\nFuck a hundred thou, I need a few mil\nEven if it leaves you killed\nYou resting in peace, I rest with blue steel\nI'm even wetting police and Navy blue seals\nHow crazy you feel!?\nMilitant click, ten in the whip\nI know Bohemians with, plenty of chips\nPull this off and we'll be rich, filthiest top billing milkiest\nIn the Hamptons, out on the mansions where they live\nThey on some ram shit, Hindu niggas, reading sanscrit\nI want a man by every exit so they can't split\nRush the crib, all we see is candles lit\nYo, they got gold cows, gold owls, on some chanting shit\nTie them up, red dot them up, fuck the ransom shit\nHit the safe, chips in the case, back to the whip\nDun, we laced, back to BK, Albany,relaxed in the PJ's\nSplitting mathematics on a weekday\nSouth of P chases stuffed inside of briefcases quiet money!\nKeep our mouth shut like freemasons paid men\n\nChorus 2x\n\n[Verse 3]\nWe from the housing bricks pushing year two-thousand whips\nWe went from ounces to bricks, house on the cliff\nThousands on the wrist, got a crew of wild villains\nThats down to flip, down to spit\nReal live thugs above the counterfeit\nReal live drug, under the counter shit, a pound a hit\nWho you riding with might be the nigga you dying with\nShot on fire we shot niggas cause they was wired kid\nNew drops up, pull rooftops up\nShoot your spots up, put pirranas in your hot tub\nMight be a bomb under the cork next time you pop bub, nigga!", "year": null, "image": "https://images.genius.com/23e45bc88de0a6f6a0ac73d6b9f6b05f.500x500x1.jpg", "title": "Some Niggaz (Extended Version)"}]}