{"artist": "Post Malone", "songs": [{"album": null, "title": "Me Or Us (Demo)", "image": "https://images.genius.com/fc7e20f4fe2f7dd19a877bb5cb1677bc.937x937x1.jpg", "lyrics": "[Intro]\nUh-du-du, uh-du-du‚ uh-du-du‚ uh-du-du\nHey‚ remember the time you drove all night?\nOoh-ooh, ooh-ooh\nNight, night‚ night, night, yeah‚ yeah\nAyy, ayy, ayy\n\n[Verse 1]\nThey say love is blind, I can't do the time\nI want a watch, this kind, but they don't know buyin'\nWith a bottle of Synthroid, can I buy it? I don't know\nAyy, hey, ayy\nWhen I came up the top, when I came up from the bottom\nAnd you was right there, I tell you, I saw you\nAnd all of my diamonds shinin' even when I was\nWas stuck in the dirt, you said it was\nAyy, they said it wouldn't hurt when you go\nBut I don't even know anymore\nI'm so gone on a forty, yeah, you know\nYeah, ayy, hey\nIt's a moonshine, it's a moon-vibe\nI was on my grind all the damn time\nWhen I was away, you was on my mind\n\n[Bridge]\nAyy, I gotta do what I gotta do\nBut I'ma, I'ma come home soon\nI'ma come home soon, I'ma come\nAyy, I gotta do, yeah\nAyy, gotta do what I gotta do\nI'ma come home, I'ma come home soon\nBelieve that's true\nAyy\n\n[Verse 2]\nOoh, why, ooh, why you gotta leave me without some love?\nIf it's all the same to you\nIf it's on the way, you know I'm dancin'\nJumpin' out the frame, ooh\nI walk in cabanas, ooh, I'ma call my mans, ooh\nDealin' with your cans, hoe, never call my name, hoe\nI ain't gotta do this shit, I don't wanna say no\nSippin' on it, drinkin' slow\nIt take away my pain, yo\nIt's something that's on the lane, yeah\nThen I hear me on the radio, ayy, yeah\nI remember, I remember\nI remember when you said it was the same\nAnd you wrong, oh no, no, no\nBut I don't think it all, all the same\nNo, why\n\n[Outro]\nAhh, why, why-y\nOoh, ooh-ooh\nThe same thing as before\nI know you understand that you in my heart, oh no, no, oh no\nOoh-ooh-ooh-ooh\nMy momma say don't let go\nI won't let go when you say you'll come home\nI might be going when I say I'll come home\nMy, yeah, oh yeah, oh, ahh, ooh-ooh\nAh-ah-ah-ah-ah-ah\nI don't wanna go now", "year": null}]}