{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/d51a09ab284e0481b02b4d6ecfda5c73.1000x1000x1.jpg", "title": "God", "year": null, "album": "Behind The Musik (A Boy Named Jonah)", "lyrics": "You are the first and the last\nStrength that I have, if my world was to crash\nYou are the same from today to the past\nPlain that your love don't change and I'm glad\n\nYou remain is the way I could have\nNew life and you took the blame that I had\nAn over-night change came with a flash\nI know it might seem kinda strange if you ask\n\nBut how can I describe who you are?\nWhat could I write? Where would I start?\nWho would define the one who made the stars?\nAnd made them shine and still lives in my heart?\n\nNo words would explain who you are\nHow could I ever just name who you are?\nEven heaven can't contain who you are!\nIs the only way I can say who you are?\n\n(Chorus)\nIt's God! Truly God!\nCan you see? Can you hear?\nCan you touch? Can you feel?\n\nIt's God! Truly God!\nI can't explain any other way\nBut it's God\n\nSo amazing to me\nYou spoke a word, everything changes to be\nSeven days, you made the sun raise in the trees\nAnd let it blaze, made the sun raise in the east\n\nI gaze on all you made and I see\nAnd I'm ashamed of sinful ways, and its me\nAnd I'm amazed that you came straight, just for me\nIt's kinda strange, but that's the way that you be\n\nYou are the reason I live\n\nYou're all I'm needing to live\nYou are the mean, and I live\nWith so much peace, I see, and you give\n\nYou right here, it's quite clear that you live\nYou're the air that I breathe and you live\nIt's not that clear, what I'm speaking\nIt's just that...\nAll that I can say is...\n\n(Chorus)\n\n(Repeat Chorus)\nSo at the end of the day\nWhen everything you made just fades into gray\nOnly one thing remains, it's the same\nThe fact that your love, it refuses to change\n\nSo plain, I'm amazed by your ways\n'Cause you, so great, but you came and you gave\nYour whole life, and you died, straight to the grave\nThree days into life, came and you raised\n\nAnd I can still call on your name\nAnd even when I fall, you remain, it's the same\nYou are my all in all, that I claim\nI used to be kinda like Paul, but I changed\n\nHow could I ever be ashamed?\nIts obvious that you live and you reign\nSupreme as the very reason I'm saved\nSee what I mean is, what I mean is that you're...\n\n(Second Half of Chorus)\n\n(Chorus)\n\n(Repeat Chorus)\nJust God\nNothing else"}]}