{"songs": [{"title": "Original King", "image": "https://images.genius.com/bc93d9a1f10bf994d92790c0d8a53c75.1000x1000x1.jpg", "lyrics": "* originally appeared on Scribble Jam '06 Compilation\n\n[Intro]\nNow just you hold on a god damn minute now!\nMotherfucker hold your eyes up when you're talking to me\nDon't you know you're in the presence of greatness boy? Original king\nLove to do his thing. You in trouble right now motherfucker\n\n[Verse One]\nYes y'all the flesh and bone season\nVeteran, yet it's just my second whole season\nEtched in stone one of the best poets breathin'\nThey don't kick over the respect I don't need 'em\nI bring it like it never been brung man\nI swing it like it never been swung\nI'm second to none\nAs long as I still got a breath in my lung\nMight as well find yourself a place to rest til I'm done\nBlessed with somethin' called a sophomore curse\nThat mean you waitin' for me cause you loved my first\nMust have heard hunger and thirst up in the verse\nAnd now wanna bust so much that it hurts\nPlus what am I? A flash in the pan?\nI fizzle out and stand here, ass in my hand\nI ain't that kind of man, I'm attached to my fans\nEvery track that I smash gotta match their demands\nI'm the first to the venue, last to the van\nI carry turntables and the wax for my man\nI shoot a star out the sky, land in my hand\nI'm off to the next one catch me if you can\nAmen\n\n[Brother Ali]\nNot fuckin' around. Been watchin' you motherfuckers scurrin' around and shit\nSwear to God you real. You ain't seen shit. You ain't did shit\nYou 'bout shit. Hold up\n\n[Verse Two]\nI hear tell that I ain't your cup of tea\nI fuck with white rappers and you can't fuck with me\nI sold my old pistol and don't run the streets\nAnd I ain't got tattoos all up my sleeves\nWell\nAll I can tell you is that I am what I am\nHow could you not respect one that stand as a man?\nLest you never peek up out your box\nYou a follower\nI don't kiss ass and suck dick, I'm not popular but\nIf you were real you would recognize me\nThey don't make them like motherfuckin' Ali\nNo more\nI ain't here to blow my own horn\nBut it takes a certain person to write those songs\nThe biggest difference between us\nIs unlike them I don't pretend to be no thug\nJust a city kid and know how to throw a punch\nI'm no stranger to the taste of my own blood\nGot you chain and decide to grow nuts\nThat shit's Golden Girls that ain't golden gloves\nTell 'em Ant\nI ain't scrap no more, I'm growed up\nToo busy, no free hand to hold a grudge\nTold your ass once that my shit is amazin'\nSeen me on stage, think it's biscuits and gravy\nI spent my young life in the eye of the shit\nDon't hate me for anything I ever did\nMotherfucker!\n\n[Speaking]\nI mean come on now. What you starin' at your speaker for man?\nThere's nothing wrong with it. There's no holes here\nIt's you, you're hatin'\n\n[Hook] - 3X\nI live I die, I laugh so that I don't cry\nI work hard\nI bust my young ass to survive\nAin't no rap video this is real ass life!", "year": null, "album": "Off the Record"}], "artist": "Brother Ali"}