{"artist": "Canibus", "songs": [{"title": "DJ Clue Freestyle", "album": null, "year": "1997-01-01", "image": "https://images.rapgenius.com/4eb097b1530b48c393621d9de8ded7c7.480x360x1.jpg", "lyrics": "[Produced by DJ Clue]\n\n[Intro: Canibus & DJ Clue]\nWord up!\nYo, what up? This is Canibus about to black out\nRepresentin' Group Home, shout out to Lost Boyz, Def Squad, Charles Suitt, Mr. Sexx, DJ Clue, and Desert Storm\nLet's drop it\nHaha! Hoo! Canibus, freestyle, niggas though, Clue!\n\n[Verse 1: Canibus]\nYo, I speak in frequencies dogs would have trouble hearin'\nCanibus is the lyrical version of German engineering\nRaw metaphors keep you high for months\nFly around the earth twice without refueling once\nAin't too many categories I can fit in when it come to spittin'\n'Cause I'm overqualified for the position\nThe laser guided lyrical hybrid\nCreatin' scripts so sick, I gotta arm wrestle my pen to write it\nDon't get excited, 'cause if I ever catch one of you wannabe's bitin'\nWe're gonna be fist-fightin'\nSo motherfuckers what you want? I got the shotgun pumped\nYou feel like a frog, nigga? Then jump\nI posses the lyrical ammo to battle\nAnd rip any one of you warm-blooded mammals to shambles\nI make examples of you and eat a mouth full of ya crew\nThe type of MC you can't outdo\nI'll battle you on the net, I'll battle you in the flesh\nI'll battle you over the phone you can call me collect\nI'll battle you for the respect, I'll battle you over a blank check\nI'll battle you with a gun to my neck\nI'll battle you standin' over the toilet with my dick out\nI'll battle you jugglin' a hand grenade with the pin out\nIn a stolen car with the VIN number ripped out\nDrinkin' a Guinness Stout doin' a 360 spin-out\nI stay righteous like Farrakhan puffin' on the marijuan'\nYou understand where I'm comin' from?\nYou number one and I'm negative two\nBasically nigga that means I'm still better than you\nBasic mathematics, the verbal mechanics of rhymin'\nBehold, I crush a piece of coal and create a diamond\nOn the microphone\nI'm sicker than those who've Acquired Immune Deficiency\nSyndromes\nAnd every word I utter for hip-hop lovers\nWill reflect forever like two mirrors facing each other\nThe baddest M-Other, F-Ucker\nLet me break the style down so you don't have to wonder\nI walk the B-Lock with G-Lock C-Ocked\nTrying to get the D-R-Op on the C-Ops\nBlow spots, capsize boats shipwrecked yachts\nHead shots hit you at 300 nautical knots\nYou calling the cops complaining about the hip-hop\nGetting Benjamin's like the L-Ox, it don't stop\nEh-eh, eh-eh, put away your burners you can't serve us\nMy whole camp is allergic to being murdered\nMetaphors is proof I got more than just a couple screws loose\nLatinos call me the Black Jesus\nSo for all who believe the telekinesis of Jesus\nI touch a paraplegic and heal him"}]}