{"songs": [{"year": null, "image": "https://images.genius.com/343c2c53c7b1f818cf50919e00643c0a.428x428x1.jpg", "title": "Ain’t Worried Bout Sh*t", "album": null, "lyrics": "(Lil Wayne)\nHa.. I'm.. so cool\n\n(Baby)\nYeah nigga, stand one, blow one nigga\n\n(LW)\nBird.. man\n\n(B)\nI promise you, we gon' give 'em what they want 'til they come get us nigga\n\n(LW)\nBird.. man, J-R, ya know\n\n(B)\nYou feel me?\nWhen gon' chase it 'til we can't chase it no more\nSo y'all might as well eat this food nigga\nAnd it got to be the best of the best\nOne, come one shorty, get with me nigga\n\n(Lil Wayne)\nSee I, ride when I gotta, grind cuz I gotta\nMilk this game 'til it's sour\nWhy I gotta do the backstreets when it's hotter\nEven though the boy smooth sellin' like Prada, speak up\nThe tool yellin' like, holla, y'heard me?\nGot the fools bailin' like Jackie, Kersee\nYou try join him, I can help you with that\nI'm important in rap but I'm special with gats\nYou know the young god bless you in fact, like you sneezed or somethin'\nEven with a stack of money in they hand, they ain't squeezin' nothin'\nI'm Weezy fuck it\nLeave a motherfucker wheezin' when I asthma pump him, yeah\nAnd I don't ask for nothin' boy, I only ask them buggy boy\nAnd as for money, watch the young god turn cash to money\nCuz that's him\n\n(Chorus 2x: Lil Wayne)\nYea, and we ain't stressin' 'bout shit\nWe grindin' like a mo'fucker tryin' stay rich\nThe cops on my trail so my track I switch\nSee niggas with money shouldn't act like this\n\n(Baby)\nYeah, pimpin', there's some fraud 'round here\nNigga better stop hatin' before they disappear\nI see the same ol' shit\nAnd pop the same ol' shit 'til your neighborhood hit, bitch\nDisrespect that Nolia dogg\nThem third world Hot Boy soldiers dogg\nAnd make a nigga understand\nWhen you fuckin' with a soldier with the grandmaster plan nigga\nI'm tryin' to make a few million\nBuy a few buildings, one day stop dealin'\nAnd go and raise my children\nGot it on my mind, that's the way a nigga livin'\nI bring ya back '84\nDope game jumpin' when the water hit the flo' nigga\nCuz we was doin' it dogg\nEverybody gettin' money, we was doin' it dogg\n\n(Chorus)\n(Lil Wayne)\nWeezy, and I ride to the end of the road\nAnd I'm hotter than a fire on the end of the fo'\nAnd plenty times I had to get it from the flo'\nBut I made it to the ceilin' and every wall could hear me\nAnd if these walls could talk, they probably cry\nLike the strings on the guitar\nAnd see you, you with that bullshit that's leighway to the do'\nOnly to cut off the lights, g'night\n\n(Baby)\nLook, it's Sunday, we in the hood gettin' our groove on\nEvery nigga uptown gotta have they tool on\nYeah, and they Birdman'd down\nNigga represent the bling cuz I hold my own crown nigga\nShit, a hood rich high clique\nThat come from the slums where they pack extra clips, I love 'em nigga\nThe only way that we know is how to flip and rescore 'em\nAnd go and get some more dough, nigga\n\n(Chorus)\n(Baby)\nYeah, this grindin' to another linin' nigga\nKnow what I'm sayin'?\nIf you in the way, you'll get moved over nigga\nThink I'ma let one of you bitch niggas stop me from gettin' a billion dollars nigga?\nFuck ya and what ya made of nigga\nY'understand? Nigga got a problem with this shit\nThat's your shit nigga\nSuck a nigga dick a die nigga\nBirdman, made man nigga\nYeah, that's how it's goin' diggity nigga\nFuck anything in between\nIf you in the line of duty nigga you got your issue, feel me?\nOne"}], "artist": "Birdman"}