{"artist": "Anybody Killa", "songs": [{"title": "Hated Me", "image": "https://images.genius.com/0ef45eaaeeb6c906ab411eeb71f61222.800x800x1.jpg", "album": "Hatchet Warrior", "lyrics": "[Verse 1]\nIf you ever started hating me, how would you act?\nLike you never fuckin knew me and you ain't got my back\nIf you ever started hating me, what would you do?\nTry and stab me in the back when I'm just passin through\nIf you ever started hating me, fuck it that's it\nLet it be known that you're a hater and you're just full of shit\nIf you ever started hating me, then catch your stone\nUnderground is better livin then your mainstream home\nIf you ever started hating me, then take it to the streets\nDetroit, Eastside 7 mile is where we'll meet\nIf you ever started hating me, then watch your back\nYou'd be surprised what hood rats would do for crack\nIf you ever started hating me, then keep your distance\nWhy the fuck would you want to be up in my business?\nIf you ever started hating me, it's not my fault\nYou just probably never liked me from the start mother fucker\n\n[Hook]\nI say fuck you! and offer no apologies\nFor my mythologies I be just how I be\nAnd I be wicked too, so fuck your family\nIf they damin' me, and don't try bannin' me\nThis hatchet fam insanity, how can it be uncaninly?\n\n[Verse 2]\nIf you ever started hating me, then don't come around\nCuz I don't think you're gonna like it if I'm beatin you down\nPistol whippin mother fuckers for the shit that they say\nLike my names the only reason that I act this way\nIf you ever started hating me, then hold your breath\nCuz it just might be the last thing that you have left\nGrabbin on to your life movin closer to death\nCuz juggalos are gettin fed up with the shit that you spread\nIf you ever started hating me, then bitch fuck you\nIf it's that way mother fucker then I hate you too\nTell your family eat a dick I hope they whole crew dies\nAnd they never fuckin make it up to Shangri-La\nIf you ever started hating me, then rest in peace\nCuz all the enemies I have are pretty much deceased\nDedicated to the dark cuz their soul was never wanted\nSo now I pray that their afterlife is fuckin hard\n\n[Hook]\nI say fuck you! and offer no apologies\nFor my mythologies I be just how I be\nAnd I be wicked too, so fuck your family\nIf they damin' me, and don't try bannin' me\nThis hatchet fam insanity, how can it be uncaninly?\n\n[Verse 3]\nI can't help what I feel when I write so I'ma tell it\nAnd I hope to all the haters that this shit is spreadin\nThe only reason there's haters is cuz they feel left out\nNo life, no home cuz juggalos shut 'em out\nSo now they hide behind computers actin hard when they soft\nI swear to god I hope they're fingers fall off\nI can't stand em, to tell the truth I just don't need them around\nSo when I see ya I'ma teach ya how to get smacked down\nIf you ever started hating me, just fall off the earth\nBecause the soul your body carries really has no worth\nUnderstand the situation homie hate me or not\nOr it's the ? that you hate that's why your stomache's in knots\nAlways feeling left out cuz you don't fit in\nSo now you spread around this hate and still act like a friend\nBut time will only tell how much your hatred grows\nThat's why we always screamin fuck a juggaho\n\n[Hook]\nI say fuck you! and offer no apologies\nFor my mythologies I be just how I be\nAnd I be wicked too, so fuck your family\nIf they damin' me, and don't try bannin' me\nThis hatchet fam insanity, how can it be uncannily?", "year": "2003-04-08"}]}