{"artist": "Ice-T", "songs": [{"title": "Exodus", "lyrics": "Yeah, This is Ice-T\nYou've just been listening to the Seventh Deadly Sin\nTo me the Seventh Deadly Sin is hardcore rap\nAnd I'm very proud to have been a part of that throughout the years\nI'd like to send peace out to all my homeboys that kept it real\nAnd love to all my niggas that have died out here\nIn this bullshit that we call the streets\nYou know? What can I say? Hip Hops been good to a nigga\nI got mad love for the East coast, West coast, North and South\nI got my niggas The Top Guns here\nWe gonna sign this one off like this:\n\nMy life's been a great story in the ultimate war\nShould I ill or do right? Make peace or go raw?\nI can't explain the true penalties of fame and the wealth\nTell me who can I trust? I can't trust myself\nGot the devil got me thinking 'bout them ill moves\nEvery damn kid on the street, they got something to prove\nPush a bullet through my heart, why not? That's a start\nThey could push their reps quicker, kill a well known nigga\nAnd if you say you're going to kill me, should I blast you first?\nBeing black is kinda like being born with a curse\nDo or Die, that's the code of the streets I didn't invent\nNiggas sketch my life out with malicious intent\nMy skin color's got me trapped in a never ending ghetto\nI move to the hills, but I can never let go\nThe gun shots and the homicides just don't stop\nAnd just because I came up, I can always drop\n\nYo.. we come prepared for guerilla warfare\nNever scared soldiers to the heart\nAnd hose them body parts with the hardwear\nYou spark a dun with Bizzaro or sequel\nWhen you catch a link on the wings of this desert eagle\nFlappin, we splittin caps friend\nRemember when niggas would shoot joints\nNow niggas be wildin' placing hollow points\nCause in this rat race, shit be moving at a murderous pace\nMad sons got slugs to the face, OG packs kilos\nOver sore losers and cilo, prepare like a scout\nI hold the burner on the delo\nIn this age of idolatry, mad niggas worship u vanity\nIf Five ?? you nigga maintain humanity - insanity\nHope you see the light ­ like the prism's true colors\nOnly a few remain brothers, fuck the others\nIn this cold world ­ the war that's controlled by the trigger\nRevelation or the scripture got to be that live nigga\n\nSo if niggas want to bite the sound like Tyson\nDeck him in the left eye, murder sit down like ryerson\nYou wanna dis, don't even try son\nHey yo, Pizzone ­ I'm the prodigy you need to keep ya eyes on\nYo who the don, who plays it all night long?\n50 mill strong, Handle like napalm. Word is bond\nWho get it on when it's time to drop a bomb?\nSadq keep it cool and calm with the niapalm\nDroppin emcee's to their knees and make them pie straight\nDust and take and serve niggas on my hot plate\nSo cats who got beef, we can take it to the streets\nCause shit these niggas talk to the grave with they teeth\nIt's time to meet your maker step into the new millennium\nI analyze data like intel Pentium\nSo follow me, I blame sovereignty for God we bust\nTop Gun, move bright, smooth as Ice, sex and dust\n\nAnte up the goods, Top Gun Ice-T in your neck of the woods\nI'm 15 blocks deep in the foreign neighborhood\nStreet of my styles, no smiles, trying to gun down the golden child\nStill on trial for my old endeavors\nCold weather got catched trying to buck wholes in my fucking sweater\nNiggas is soft like butter, leathers and felt\nTime to heat it up and melt\nFelt the welts from brass belt buckles to brass knuckles\nKill all the jokes and chuckles ­ let's all get together\nMy fam stay thick together\nTrick off and lick off together\nNo matter the weather\nLets ease on down to the bow and to the bricks\nWhen I start to squeeze, I won't ease off a bit\nWon't be no teams up in here with no clashes\nJust bunk mile sleds boot shines up in the masses\n\nLife got no guarantees, I'm looking for the long lease\nWhen I'm in LA, it ain't hard to find me\n21st floor eating shrimp at Belonte's\nEvery time you see me I'm connected to a dime piece\nI check your styles, although you rhyme quicker\nNo matter what you do, I'll always lace mine thicker\nJealousy will make a fool die quicker than liquor\nWatch your back with your niggas\nCause that's right where they'll stick ya\nYou see me in the club jeweled up, all alone\nI give love to my homies, then I bounce the fuck home\nBodyguards are something that I just don't do\nCause if I'm after you black, I'm gonna clap them too\nMoney makes all my homies look brand new\nI don't fuck with the fakes, I make moves with the true\nIce ­ baby chopping that real, thought you knew\nI might sound hard, but nigga I can die too\n\nCause I'm as real as you", "image": "https://images.genius.com/64f26659fd999b48a36adf8773cb8eb0.1000x1000x1.jpg", "album": "The Seventh Deadly Sin", "year": null}]}