{"songs": [{"lyrics": "[Intro]\nYeeeeees man! But I'm not a yes man. It goes down. For the umpteenth time. Acey de uno on deck. Aceyalone in the place to be. Aceone in the house\n\"We came to rock\"\nBar Nine is on the mixture. And that's how we do it. Moving your fixture. What's up to all the Project Blow'dians. Y'all know what the code is to ride chaos to order. Every Thursday night at 343 Lemerk, we gets down. But check it out. Now, I'm sending this one out to all of the ye-ye's across the world. Ha. Y'all know who you are. And all the nobodies. Once again. Y'all know who y'all are. And um, all the outsiders. Sincerely from Mr. Outsider himself, you know what I'm saying? And all the smart people. This goes out to y'all. True. Check it out. What's up Jup'?\n\n[Hook]\nNow I know you don't wanna be no waterboy forever\nNever, seeing the field, thinking you got it together\nPlaying foosball in the street\nOh it's your game but it's they concrete\nAnd it's my ball and it's my treat\nOh it's your world but it's my heat\n\n[Verse One]\nAnd I live in a hellhole in the wall and I'll never see the light of day\nSo subliminals controlling all of y'all but it won't take mine's away\nWhat is that instinct?\nI react before I think and it make that thought complete\nTell it to the weak\nSmell before you leap\nListen here, many moons ago my seed planted in the minds to feed\nYes indeed I cut I bleed, I'm sweating tears until I'm free\nMy sector the 213\nMy protector the E.Y.E\nJust soak it in like Mother Earth, does birth\nCause once that jewel is just a cesspool for food\nTrue\nWell here's another chapter to that never ending capture\nGrabbed ya, I tapped your mental\nAnd stroked your mind so gentle\nI'm an oddball from the stars and I rhyme irregular\nBut I'm smart\nAnd I know exactly who I are\nYes, sick of turning unicycles into car\nSoon as I get a little bit of it in my jar\nNow I know you don't wanna be a waterboy for life\nOr even the water man with the melon in the myth\nJust put your ear to the glass and I'm telling you to split\nThis the story of a gambling man who never passed a [?]\nGot me upset\nTrying to tell me water ain't wet\n\n[Hook]\n\n[Verse Two]\n\"Now life ain't fair\" Owl said, but who really cares?\nI know some people that's over here but they wanna be over there\nWhile there's some real cool cats\nBut, yeah they wanna be bears\nAnd when I see them chasing chicken I get heated like a flare\nWell your face looks scared and your space suit got a tear\nYou're a square\nAnd I'm beyond compare and I'm rare\nYeah and I'm sick of turning apples into pears\nSoon as I get a little bit of it I'mma share\nSome people need a lifetime to say what they say\nAll I need is my mic line and a minute to play\nOh I get in it and sway\nIf I may I'll show you the way\nI'll mold and shape the clay to make a better day\nNow I am the epitome of the remedies that you meet\nI'll back 'em up in a corner and crack 'em when I'm key\nOr I see the seed gon' grow (so?)\nBut it still need H2O\nI got people out in every state saying \"Acey I hate your flow\"\nCause when I echo\nI love to see the whole crowd sekkle\nI get ya like the ginny got the jackal\nAnd if any wanna cackle\nI break out my shackle and I shackle up your feet\nI beat 'em to the baseline and tackle 'em on beat\nNow I'm the missing piece to the puzzle\nI'm the answer to all your prayers\nMade a mountain out of a molehill, not to mention I built the stairs\nYeah and I'm sick of turning apples into pears\nSoon as I get a little bit of it I'mma share\n\n[Hook]", "title": "Waterboy", "album": "Project Blowed Sampler", "image": "https://images.genius.com/6954804efbeb16bd9717031caea49cb0.578x600x1.jpg", "year": "1995-01-01"}], "artist": "Aceyalone"}