{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Verse 1: R.A. The Rugged Man]\nEverybody says that my mind's twisted\nPlus when I'm homeless my phone number's unlisted\nI ate your bitch pussy till my tongue blistered\nJohn L. Sullivan, street fighting, bare fisted\nMy four days in California, we gotta warn ya\nSmack cats that don't like rap like Time Warners\nStraight up sinners, break Ten Commandments\nFornicators, God probably hate us\nR.A. the Rugged Man out in Cali, that's the latest\nWhy the fuck bitches don't date us? Who give a fuck, we pay for it\nYou want mercy? Ask Marvin Gaye for it\nMy head turns grey for it, I make my own way for it\nNow why they want me dead? I'm to get bloodshed\nYou remember? Get it to ya head\nCaucasian like all serial killers, Dirty Crusty\nThat's the click, certified bloodspillers, motherfuckers\nWe backstabbers like OJs, man, go get this money back like my old days\nHopefully, they got dope for me out in Cali\nLet's see any MC flow for me\nArtificial, smack you up with the pistol\nLet me see what this do, ain't nobody miss you\nSing it\n\n[Hook x2]\nThink again, dead man never blink again\n(Think again, dead man never blink again)\nYour heart stop, never beat again\nThink about that till we meet again, 'gain\n\n[Verse 2: R.A. The Rugged Man]\nI be the rugged fly guy, the do or die guy\nI be like Guy saying \"Bye Bye\", keep on to my eye\nThey wanna stop me, blast my chest\nYou might have seen me on the Channel 5 loose, wearing my bulletproof vest\nPlus my pockets forever carry lead\nRA the Rugged Man aka Larry Flynt, aka Larry Holmes\nPeep the reach, it must be 81 inches\nWhite like picket fences, some find us offensive\nYour rap style's not impressive, knock you out senseless\nDeath Wish, Vigilante, Bronson, Paul Kersey\nRe-endorse me, who cursed me?\nJ.D. Walker, fat bitch stalker, awkward\nOut in Cali, or peep this New Yorker\nTorture chamber, we pull out the flamer\nGon' be slayer for real, fuck being a player\n\n[Hook x2]\n\n[Verse 3: R.A. The Rugged Man]\nNow what the deal baby? Keep it real baby\nNow we pack steel baby, am I crazy? Maybe\nI be R-U-G, G-E-D\nHated like L-A, P-D\nWho we? Rugged Man plus Overdose producer\nPlay us too close, we shoot ya, that's right\nNow who wanna die like Princess?\nWhy you fuck with my family, like incest?\n1998, annual sinfest\nLyrically there's not too many been blessed\nI'm a sinner, but everybody's sinning, ain't no pretending\nI'm cursed, but we've been cursed since the beginning\n\n[Hook x2]", "title": "4 Days in Cali", "image": "https://images.genius.com/db5f1be160a3b09ca4a61618f595fe41.400x396x1.jpg"}]}