{"artist": "Ace Hood", "songs": [{"title": "Realest Livin", "album": null, "year": null, "lyrics": "[Intro: Birdman]\nRealest Livin'\n\n[Verse 1: Ace Hood]\nOK now hood off in this mother fucker\nGot the niggas all rolling hollering\nBeast back in this mother fucker\nAnd im into this bitch\nDon't make me click off in this motherfucker\nBetter ask them bitches, I’ll be swimming on they distance lover\nWanna have my baby? trick you crazy\nI keeps a rubber\nNever ever play me for no sucker\nAnd I ain't stutter\nI ain't into that bull i sip Muscatto and im lay back\nThat brand new Maserati inside of a suede black\nAnd the chick im with hella thick just know that I filet that\nI swear that pussy good, she good, she looky, love the nookie\nI’m just a nigga who addicted to this money flow\nAin’t nobody on his level run and tell him fo\nThat’s real shit, I swear my swagger keep an attitude\nPistol on me homie, he won’t show no gratitude!\nDon’t want no problems, let this bust off in your blatter too\nStanding ovation for the realest nigga in the room\n\n[Bridge]\nFrom the day that I was born, up out the womb\nPledge allegiance to keep you real and pay my dues\nHonor the mother and the father, death 'fore honor\nI hear my brothers keeper and that's before the mighty dollar\nStanding ovation!\n\n[Hook]\nFor the realest nigga living\nStanding ovation!\nFor the realest nigga living\nStanding ovation!\nFor the realest nigga living\nStanding ovation!\nFor the realest nigga living\nStanding ovation!\n\n[Verse 2: Ace Hood]\nMirror, mirror on the wall, who the realest?\nThey say that God don't fear nobody I'm his spitting image\nLook in my eyes and see the beast\nMy kind is rare invented\nChoppa on the seat will have you call on your religion\nFather God come and bless me, I'm a sinner mane\nYou know these niggas talking tough, gone need a dinner plan\nDon't make me send those niggas off into that mini van\nI ain’t no killer, put a thousand on your brother head\nReal shit, you're looking at the realest living tho\nOnly niggas speaking real, I never sugarcoat\nWay to many nigga banging and they’re selling dough\nI don’t know what it’s about it, I just get my hustle on\nToo legit the quit, I really got my heater chrome\nCall that style my BFF and I don’t leave it home\nAnd that's word to my momma, don't want no drama\nLoyal to the bone, and that’s before I see the commas\n\n[Bridge + Hook]\n\n[Verse 3: Rick Ross]\nSmoking like Harry Potter\nMy flow keep getting hotter\nShe dances to my single\nBet she just want a dollar\nUh, but I got her, I know she a dog\nShe know that I’m balling, she know who’s the boss\nGot the 2 door, the 4 door, i even get the trucks\nGetting loo like ma ludo mammy, I got the bucks\nCall it killers, they're lurking I see 'em in the gust\nRemember as soon as I point a finger, you’re getting touched\nPlay with fire, I could get you sent to hell\nAngel of death, I could hear her on the cell\nSpeed dial, double MG\nGod Forgives And I Don't, you niggas will see\n\n[Bridge + Hook]", "image": "https://images.genius.com/2b8521f75a42651c7f8673b2f3f696bc.720x720x1.jpg"}]}