{"artist": "Vanilla Ice", "songs": [{"title": "Play That Funky Music (1990)", "year": null, "lyrics": "[Intro]\nYo, Vanilla. Kick it one time, boy!\nLay down the boogie and play that funky music 'till you die\n\n[Verse 1]\nCheck it out, cause Ice is rhyming\nTo the top I keep on climbing\nSuckas thought I couldn't swing this\nNow rock the crowd and get a pump-fist\nGo, Ice, everybody is sayin'\nTo the funky beat that's playin'\nIf you wanna stop me you can't hang\nVanilla is in this with a shotgun bang\nExtreme is where I'm taking it\nOne week MCs just keep on faking it\nSmooth, like Strawberry ice cream\nFlow with the beat real smooth and nicely\nLadies, I wanna' rock with you\nAnd Later in the night, you know I'd like to pursue\nSomething real sexy and nice\nPlay that funky music, Vanilla Ice!\n\n[Chorus]\nPlay that funky music\nPlay that funky music right (Pump it up!)\nPlay that funky music right (I can't hear you!)\nLay down the boogie and play that funky music 'till you die\n\n[Verse 2]\nSome people thought I wouldn't break\nThen I stuffed number one in their face\nNever, forget where I came from\nDon't lose your head (heh) cause you can get dumb\nDo it, is my motto for the moment\nGet in my way, I'll knock you out like my opponent\nCause' in this life it's one for all\nAll for one and a loud no downfall\nPunks, always wanna' get some\nPick-Pockets and then they try to play dumb\nYo, take it From the Ice man\nLyrical Poet with a master plan\nTelling you how it is in showbiz\nA white rapper with some street knowledge\nI write the rhyme for you (Yeeeah)\nDrop this one for the V.I.P. Crew\n\n[Chorus]\n\n[Verse 3]\nYour wreakin' vast (No!) And I can tell it\nYour body's gettin' hot (So?) So I can smell it\nSo don't be mad, and don't be sad\nCause your lyrics brought the Ice(sss)\nYou can call me Dad\nYour pitchin' a fit, so step back and endure\nWitch doctor Ice(sss) will do the dance to cure\nCome up close, uh, and don't be square\nYou wanna' battle me? Anytime, Anywhere\nYou thought that I was weak\nBoy, your dead wrong\nCome on everybody, let's sing this song\nSay, Play that funky music\n(Play that funky music)\nSay, Go, white boy, Go, white boy, Go\n(Go, white boy, Go, white boy, Go)\nJust lay down and boogie, and play that funky music till' you die\n\n[Chorus]\n\nPump it Up!\nWhat's my DJ's name?\nThat's right baby\nBOOM!", "album": "To the Extreme", "image": "https://images.genius.com/43185a1d83abfd185beb3886b4c33135.600x600x1.jpg"}]}