{"songs": [{"lyrics": "[Intro: Dr. Dre]\nYou are now about to witness the strength of street knowledge\n\n[Verse 1: Ice Cube]\nStraight outta Compton!\nCrazy motherfucker named Ice Cube\nFrom the gang called Niggas Wit Attitudes\nWhen I'm called off, I got a sawed-off\nSqueeze the trigger and bodies are hauled off\nYou too, boy, if you fuck with me\nThe police are gonna have to come and get me\nOff your ass, that's how I'm going out\nFor the punk motherfuckers that's showing out\nNiggas start to mumble, they wanna rumble\nMix 'em and cook 'em in a pot, like gumbo\nGoing off on the motherfucker like that\nWith a gat that's pointed at your ass\nSo give it up smooth\nAin't no telling when I'm down for a jack move\nHere's a murder rap to keep y'all dancin'\nWith a crime record like Charles Manson\nAK-47 is the tool\nDon't make me act a motherfucking fool\nMe you can go toe to toe, no maybe\nI'm knocking niggas out the box, daily\nYo, weekly, monthly and yearly\nUntil them dumb motherfuckers see clearly\nThat I'm down with the capital C-P-T\nBoy, you can't fuck with me\nSo when I'm in your neighborhood, you better duck\n‘Cause Ice Cube is crazy as fuck\nAs I leave, believe I'm stompin'\nBut when I come back boy, I'm coming straight outta Compton\n(Compton Compton Compton)\n\n[Interlude: Eazy E (MC Ren)]\nYo, Ren! (Whassup?)\nTell 'em where you from!\n\n[Verse 2: MC Ren]\nStraight outta Compton, another crazy ass nigga\nMore punks I smoke, yo, my rep gets bigger\nI'm a bad motherfucker, and you know this\nBut the pussy-ass niggas won't show this\nBut I don't give a fuck, I'ma make my snaps\nIf not from the records, from jacking or craps\nJust like burglary, the definition is jacking\nAnd when I'm legally armed it's called packing\nShoot a motherfucker in a minute\nI find a good piece of pussy and go up in it\nSo if you're at a show in the front row\nI'ma call you a bitch or dirty-ass ho\nYou'll probably get mad like a bitch is supposed to\nBut that shows me, slut, you're not opposed to\nA crazy motherfucker from the street\nAttitude legit, ‘cause I'm tearing up shit\nMC Ren controls the automatic\nFor any dumb motherfucker that starts static\nNot the right hand, ‘cause I'm the hand itself\nEvery time I pull an AK off the shelf\nThe security is maximum, and that's a law\nR-E-N spells Ren, but I'm raw\nSee, ‘cause I'm the motherfucking villain\nThe definition is clear, you're the witness of a killin'\nThat's taking place without a clue\nAnd once you're on the scope, your ass is through\nLook, you might take it as a trip\nBut a nigga like Ren is on a gangsta tip\nStraight outta Compton\n(Compton Compton Compton)\n(Straight outta Compton)\n\n[Interlude: Dr. Dre]\nEazy is his name, and the boy is coming…\n\n[Verse 3: Eazy E]\nStraight outta Compton\nIs a brother that'll smother your mother\nAnd make your sister think I love her\nDangerous motherfucker raising hell\nAnd if I ever get caught, I make bail\nSee, I don't give a fuck, that's the problem\nI see a motherfucking cop, I don't dodge him\nBut I'm smart, lay low, creep a while\nAnd when I see a punk pass, I smile\nTo me it's kinda funny, the attitude showing a nigga driving\nBut don't know where the fuck he's going, just rolling\nLooking for the one they call Eazy\nBut here's a flash, they'll never seize me\nRuthless, never seen, like a shadow in the dark\nExcept when I unload\nYou see a spark and jump over hesitation\nAnd hear the scream of the one who got the lead penetration\nFeel a little gust of wind and I'm jetting\nBut leave a memory no one'll be forgetting\nSo what about the bitch who got shot? Fuck her!\nYou think I give a damn about a bitch? I ain't a sucker\nThis is an autobiography of the E\nAnd if you ever fuck with me\nYou'll get taken by a stupid dope brother who will smother\nWord to the motherfucker, straight outta Compton\n(Compton Compton Compton)\n(Straight outta Compton)\n\n[Outro]\nDamn, that shit was dope!", "album": "Straight Outta Compton", "year": "1988-07-10", "title": "Straight Outta Compton", "image": "https://images.genius.com/0fd7322281abb618c142d5f39139db51.600x600x1.jpg"}], "artist": "N.W.A"}