{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/26d65093c145e92972f6e95f41326a21.300x300x1.jpg", "title": "That’s Life", "year": "2006-11-21", "album": "I Pledge Allegiance to the Grind", "lyrics": "[Intro]\nHey, my name's Malik and Killer Mike's my dad\nIf you don't like what he's sayin', so what\nThat's life\n\nTold you last tape I'm a killer man\nI'm a rapper, what the fuck do I know\nWell I'm also a nigga that came off Martin Luther King, man\nSon of a dope lady\nAnd I went to fuckin' Morehouse nigga\nI accomplished something, I became something nigga\nThat's who I am to criticize any nigga\nOprah, Bill, Clinton, Cosby, anybody\n\n[Verse 1]\nThe fat bitch singing show over, end opera\nLeader of the crack Rat Pack, I Sinatra\nThey say I dissed Oprah\nI'm like so what\nI never get to jump up and down on a sofa (that's life)\nNow watch me as I Cruise like Tom through the slums\nWhere the education's poor and the children growing dumb\nIn the section of the city where saditty's don't come\nWhere Mr. Cosby and Ms. Winfrey won't come\nUnless it's a hurricane then FEMA don't come\nComing live from the city where the Dreamer came from\nStanding on the same corners that he stood upon\nI got violence in my waistband, death in my palm\nAsk 'em am I a bad guy, ya goddamn right\nI done seen how ya do a nigga when he doin' right\nThe Dream died on a balcony, standin' at a hotel\nNow niggas whippin' coke gel and a O tale\nWe desegregated - put black with the white\nNo longer marching for rights, they sparking a pipe (that's life)\nPipe dreams, crack fiends\nCars look like ice cream\nKids see the bling-bling and they want them nice things\nAll cause of tennis shoes our kids drop out of schools\nThey said be like Mike, so ball nigga (that's life)\n\nNow help me understand something\nIf you a leader and you really mean something to your people\nAin't you supposed to be in the community with your people?\nAin't you supposed to be there?\nLike the only people I see in the communities\nAre rappers and ball players\nWhere the fuck all y'all doctors?\nWhere y'all bourgeoisie niggas at?\nAll the kids got is us, Grind Time rap game\n\n[Verse 2]\nRead an old magazine, check out a new dress\nI be havin' conversations with Cornel West\nKiller Mike don't give a damn if it's me ya ain't likin'\nThe last great debate I had was with Michael Eric Dyson\nCall me a dumb rapper\nGirl stop, pardon me\nYou be hard pressed to find another rapper smart as me\nMaybe Jay-Z, 2Pac, C-U-B-E\nBut Oprah'd rather put Superhead on TV\nNow whatcha white audience gon' think about we\nThe same white audience that watch Bill O' Reilly\nI saw the smirk on they face when you came at Luda\nThe same nice ladies that forgave Martha Stewart\nSo I can be a crook\nTake money off the books\nJust as long as I'm liked by a rich man's wife?\n\nOK, hold up. I can't rap about doing crime\nBut if I actually do crime, and do time\nI can come back out\nAnd have a TV show\nWith an all white audience\nIf I rob shareholders of millions?\nBut if I rap about getting some money on the block\nIt's a problem?\nAre you fuckin' retarded?\nI'm not even gonna tell you how stupid you are right now\nCause you should already know, Grind Time Rap Game (that's life)\n\n[Verse 3]\nNiecey had a man, not a mouse or a mole\nWhen the pressure come knockin, I ain't runnin in a hole\nGeorge Bush don't like blacks\nNo shit, Sherlock\nAnd his daddy CIA had flooded the hood with rock\nAnd his momma said the women oughta feel at home\nGettin' raped in the bathroom in the Superdome\nThe comment Kanye made was damn near right\nBut Bush hate poor people\nBe 'em black or white (that's life)\nHell yeah I said it, cause Oprah won't say it\nAnd Bill won't say it, and they still won't say it\nIf you really bout intelligence, you really know I'm right\nIf you lookin' for some leadership, look for Killer Mike (that's life)\nLookin' for a movement, it's Grind Time Rap Game\nKids see us in the street and go bang bang bang\nThey see me on the street and on the corners they hang\nMyspace Grind Time Online, join the gang\n\n[Outro]\nAye man, all you adults out there, all you supposed grown people\nWould you please stop lying to young people\nCould we please have a moment of fuckin' honesty?\nYou know honesty?\nThe shit you ask young people to be with you when you ask are they havin' sex or doin' drugs?\nCould we please stop fuckin' lying\nLike you preachers out there who spread the myth\nThat young boys who sag their pants picked that shit up in prison to let niggas know they homosexuals\nYou in your faggot, twisted mind know that ain't true\nYou sick fuck, for even sayin' that shit\nWe wear our fuckin' pants big\nBecause our mothers were too poor to buy our size\nSo they had to buy two or three sizes up\nCall it what it is nigga: poverty\nIt's fuckin' poverty\nYou know poverty, the opposite of the big fuckin' cars and planes you drive\nMutherfucka\nTo all you rich bourgeoisie niggas out there\nStop ignoring your cousins in the ghetto\nBecause they're there\nStop looking down on 'em\nStop using crack addicts and Mexicans\nAs cheap labor to build your fuckin' houses\nAnd then shitting on poor black people and Latins\nYou pieces of shit\nThat's for you rich motherfuckas: black and white\nIn the mean time us rappers\nUs lowly b-boys and us motherfuckin' athletes'll be here in the ghetto\nServicing the motherfuckin' children\nWe are the new Robin Hoods\nWe are the Pied Pipers\nWe will lead the kids into a better life than the motherfuckin' lies you doing\nKids grow up, be doctors, be lawyers\nJust don't be liars and connivers like the ones we got now\nYoung men, grow up\nBe clergymen, be a preacher\nJust don't be a motherfuckin' greedy hog like most of the ones we got now\nGrind Time Rap Game\nBang, bang, bang\nIf you don't like what I'm sayin'....that's life"}]}