{"songs": [{"album": "Never Fold", "image": "https://images.genius.com/6d40da745664c6e6933d471876a87984.1000x1000x1.jpg", "year": "2019-03-08", "title": "Step Into Love", "lyrics": "[Chorus: Sarah Reeves]\nStep into love like you've never been hurt before\nStep into trust like you've never been burnt before\nWould you just step in your heart and open your soul?\nI'll be waiting when you let go\nStep into love like you've never been, never been hurt before\n\n[Verse 1: Tedashii]\nGo\nLast year was so hard, I almost gave it up\nBut even Lazarus had hope, God, I pray You raise me up\nIt came to light who was in the dark, I don't know who to trust\nSo many actors who just want a part, they'll take a piece of us\nBut I can't let go, I tighten my grip\nI hold on to hope, and fight to the end\nPeople may change, God is the same, why would I quit?\nI've been through the storm, live with the pain, but I'm still in\n\n[Chorus: Sarah Reeves]\nStep into love like you've never been hurt before\nStep into trust like you've never been burnt before\nWould you just step in your heart and open your soul?\nI'll be waiting when you let go\nStep into love like you've never been, never been hurt before\n\n[Verse 2: Tedashii]\nDon't you ever turn back, we not going that way\nTomorrow ain't ever promised, so let's not waste today\nHeart broke, but I won't break\nCan't find freedom, tryna escape\nGoing through, you gotta go through\nThe only way is when I find faith, yeah\n\"Come to Me,\" what He said to me\nBut all I see is this angry sea\nBeyond the boat, where I think it's safe\nBut in Him, I can face the waves\nStorm is real, I feel, but so is who I'm living for\nWalk on water with the Father, know He'll carry me to shore\nEvery L is just another lesson\nI refuse to live and second-guess Him\nWhen I let Him down, they tried to take me down\nBut I ain't bring it up and I just tried to help, yeah\nStep into love\nI know that it's tough\nI know He's in love\nI ain't givin' up\n\n[Bridge: Sarah Reeves]\nYou made it past all the past, you're a miracle\nHe's always there, cast your cares when it's difficult\nDon't let your past hold you back, you're a miracle, miracle, miracle\n\n[Chorus: Sarah Reeves]\nStep into love like you've never been hurt before\nStep into trust like you've never been burnt before\nWould you just step in your heart and open your soul?\nI'll be waiting when you let go\nStep into love like you've never been, never been hurt before"}], "artist": "Tedashii"}