{"artist": "Cam’ron", "songs": [{"title": "Believe In Flee", "album": null, "year": "2019-10-01", "image": "https://images.genius.com/58f55c1504a6009dbd90aafbcbefc2d1.700x700x1.jpg", "lyrics": "[Intro]\nYou-you-you got to believe something (Uh, uh, uh, uh, uh, ah, ah)\n(Uh, uh, uh, uh, uh, ah, ah) Why not believe in flee? (Ah, ah, ah, ah, ah, kill, kill, kill)\nYou got to believe\nI mean you got to believe in something, right? Why not?\nWhy not believe in flee? (Flee, flee, flee)\nYou got to believe\n\n[Verse 1]\nPoverty, nah, I wasn't understanding it (Nope)\nNo way that I'll ever have a hand in it\nMy building look abandoned so Kim had to abandon it (Peace)\nNow to get in my crib, you need a laminate (Hello)\nIt's me, flee, the car all pink (All pink)\nTwo door, take your bitch with one wink (Hey baby)\nLocation where the black rich niggas link\nMove a couple bricks a month in case the ship ever sink\nWaste load, three quarter, phone left, mink (Ta da)\n(Cam'ron gettin' money?) Well, as sure as shit stink\nThe white real soft so we call the shit \"Powder puff\"\nTwo chains on, yeah, we made our mama's proud of us (Hey mama)\n[?] so please, don't get loud with us (Talk nice)\n[?] for anybody who doubted us\n\n[Chorus]\nYou got to believe in something\nWhy not believe in flee?\nYou got to believe (Flee) in something (Ah, yeah, ah, yeah)\nWhy not believe in flee? (Ah, yeah, ah, yeah, yeah) Listen\nYou got to believe\n\n[Verse 2]\nFl-flee fours, knitted sweaters over new cotten\nDon't talk, I ask. nigga, [?] poppin'\nNow it's opportunity, don't matter who's watchin'\nPlay ball, sell drugs nigga, (You got to believe) I had two options\n[?] I turned that to a few options\nI ain't show you how to get your boo poppin' (Facts)\nOr to get your whole crew poppin'\nSo you ain't have to be crew hoppin'\nI'm known to cause a frenzy\n'Cause you see me in the Bentley\n[?], (You got to believe) please don't think it's nuttin' friendly\nAll red, the Benzy\nI get head, Lewinsky\nI mean the real Lewinsky\nI wouldn't bet against me (Flee)\n\n[Chorus]\nWhy not believe in flee?\nYou got to believe in something (Something)\nWhy not believe in flee? (Flee)\nYou got to believe in something (Something)\nWhy not believe in flee? (Flee)\n\n[Outro]\nYou got to believe"}]}