{"artist": "Positive K", "songs": [{"album": null, "title": "Step Up Front (3 Heineken Technique)", "image": "https://images.genius.com/c2abf6077deb234a5be12d881aa642e6.350x350x1.jpg", "lyrics": "[Ego Trip's \"Book of Rap Lists\"; p. 114]\n\nMusic first..\nGrand Puba - \"Step up front!\"\nAhh, Milk Dee - \"Step up front!\"\nA Priority Posse - \"Step up front!\"\nTo my mom and my dad - \"Step up front!\"\nUhh, c'mon.. yeah, c'mon..\nYeah baby c'mon.. uh, c'mon..\n\n[Verse One]\nLet's discuss this - listen while I bust this\nIt's from the K, so hey you can trust this\nRhyme ritual rap my rap spiritual\nPumpin and jumpin, from the max to the minimum\nI don't moan and groan, I take it on\nFor floozies I bone I just leave 'em alone\nI need a clear head in order for me to win it\nSo baby, \"Hold up - hey! Wait a minute!\"\n\nUhh, yeah.. uhh, c'mon..\nYeah baby c'mon now.. uhh, c'mon..\n\n[Verse Two]\nOn the square - I'm not riffin like Andy Griffith\nJust fed up, goin head up, with competition\nDon't excluse or place no restriction\nGotta qualify to be in my jurisdiction\nRazzle, dazzle, burn you to a frazzle\nSoon you say you don't need the hassle\nI'm too hard to be soft, too loud to be a duck\nAnd if you are well then look tough luck\nIt's not your world so don't work at no resentment\nTryin to front on a three-hour rap segment\nI'm the one so FUCK your attitude\nI got a chip on my shoulder, plus I'm in a bad mood\nYou're huffin, puffin, bluffin for nothin\nCome out your face, word is bond I hurt somethin\nRockin your knot, puttin a wop in your bop\nHittin the spot, just like an insulin shot\nSo whassup Hobbes? I'm all in it\n\"Hold up - hey! Wait a minute!\"\n\nYeah.. uhh, yeah baby c'mon..\nUh, c'mon..\n\n[Verse Three]\nWell uhh, boom batter, sissies don't matter\nSorry homeboy my pockets is gettin fatter\nThe chain gets thicker, the records come quicker\nYour girl keeps comin around I'm gonna stick her\nSo plan your prevention I'm the best in your dimension\nDon't cause static and I don't like tension\nCellophone sissies - I see through ya\nEvery rhyme you say I'll outdo ya\nI'm an MC please I'm not a microphone teaser\nGot more rhymes than meat in your freezer\nSo don't debate it, or complicate it\nAppreciate the fact new jacks, I made it\nYeahhhh boy, believe it's true\nWhat I've done many wants to do\nMy rhymes are sufficient, also suffice\nNo matter how you put it they're plain just nice\nTakes time to be written, pull fully intact\nI never had to front I got too much back\nWell I said things changed ever since I got in it\nSo, \"Hold up - hey! Wait a minute!\"\n\nUhh, if it ain't rough it ain't right\nIf it ain't loose it's tight\nAnd if it ain't black it's white\nSo c'mon, maintain your aggression\nAnd use some discretion\nAnd I'ma get wreck in just about onnnnnnnne second\n\n[Verse Four]\nPositive, the gentleman, the rapper\nIntelligent, clean cut, dapper\nBlowin out scales on the rhyme barometer\nRaisin temperatures upon the hip-hop thermometer\nCommercial - controversial's not my image\nI'm roughin up rappers just like a, football scrimmage\nPut 'em to a test, see what they can commit\nAnd if they can't take an order like my dog - sit!\nGirls I want - yeah I can get 'em\nShakespeare? Couldn't shoot a rap better\nGot a way with words, that could seduce you\nWhen you find out honey, you just got loose\nWord to the mother, mother to the word\nIt's not absurd by what you just heard\nI rock 'em, wrote 'em, long like a totem pole\nBaby God bless your soul\nI choose 'em, flooze 'em, bang 'em, bruise 'em\nSend 'em to the next man then I excuse 'em\nI'm the Positive, not the interrogative\nWith a lot to take and a hell of a lot to give\nBut umm, people changed ever since I got in it so\n\"Hold up - hey! Wait a minute!\"\n\nUhh, yo I wanna say whassup to the crew\nTo Audio Two, and MC Lyte\nAlso the Alliance\nAnd to the Hillside Posse, yo we outta here!\nBut c'mon on.. yeah, c'mon now..\nYeah baby c'mon.. uhh, c'mon..\nYeah..", "year": null}]}