{"songs": [{"lyrics": "[Intro: Afu-Ra]\nYeah! Afu-Ra one time yeah!\nWatch out!\nSometimes I reminisce! Uh!\nAbout comin' up in the game\nLot a things did change\nYeah we spit this here\nBrooklin! Uh! Porto! Yeah Portugal Yeah\nParty to life force. Ya know!\n\n[Verse1: Afu-Ra]\nIs like I'm locked to this game\nI eat, sleep, drink\nShit Im shackeld to the game\nIn a nut shell I'm trapped mentally and physically\nWhen i sign another line I know it would be the end of me\nA mathematical spillage you feel it to the physical\nA black cat inventing lyrical miracles\nSo what the God to do\nSo what a brother to do\nI reach to do hard core\nKeep dig to the core\n??\nGot my first album, like they wanna give some more\nI love this this hip hop world like its a baby\nSometimes I reminisce yeah, it makes me crazy\n\n[Hook: Female Voice and Afu-Ra]\nRecordação...\nI reminisce, I reminisce\nRecordação...\nBut in times like this, ´\nYeah sometimes it makes me crazy\nA inocência...\nI reminisce, I reminisce\nIt make me crazy\nI reminisce, I reminisce\nBack in the day\nSometimes it makes me crazy!\n\n[Verse 2: Mundo Segundo]\nNo decurso do percurso o discurso deu-me um curso\nSem recurso, na escola da rua não há concurso\nSomos doutores, alunos e professores e\nSimultaneamente ouvintes e espetadores\nNão tive bolsa mas mais de vinte valores que\nHerdei de grandes senhores não de cobradores de favores\nProfissionais e amadores\nBons conhecedores\nSem tons e ensurdecedores sintam aliviam dores\nMundo Segundo nova gaia residente\nVelha escola ou nova escola a melhor escola de sempre\nNão tenho escolta na frente\nBando, grupo ou seguranças\nMas tenho bons amigos quando a hora é de cobranças\nCasado sem alianças, não ando sempre em mudanças\nNao derreto finanças pois no possuo grandes heranças\nInvisto nas poupanças uma ou duas crianças sem\nGramas ou balanças sem sentenças ou fianças\nIsto muito bonito mas para quem vê de fora\nPara alguns muito ridículo na formula que o mercado explora\nNao tenho gajas no varão ou um vasto pasto de vacas\nGajos de canhão, matracas, borboletas, facas\nBoa vibração e uma mensagem positiva\nAlcoviteiro faz-te à vida aqui a entrada proibida\nSou coeso, obeso com peso, conta e medida\nTu tás preso no desprezo, surpreso de quem duvida\n\n[Hook]\n\n[Verse3: Maze]\nReminiscências levam-me à idade da inocência\nA essência de quem eramos na adolescência\nAssimilávamos rimas que nos transformavam\nSem imaginar as vidas que as nossas mudavam\nNa janela do segundo com um caderno na mão\nEnquanto o Mundo bate na MPC com paixão\nA canção da temperança pura preserverança\nA bombear ar nas PUMP sempre na esperança\nDe dar o salto de fé do parapeito do planeta\nQueda livre pra areia movediça da ampulheta\nE o tempo passa e a tinta esgota na caneta\nO sonho avança cria a realidade que projeta\nQuem diria que um dia ia cumprimentar Bambaataa\nOu Grand Master Flash e outros nomes da nata\nEm 2000 ouvia em loop o corpo da força da vida\nHoje na mesma faixa uma utopia cumprida\n\n[Hook]\n\n[Afu-Ra]\nYeah Afu-Ra yeah!\nShout out to my people, Portugal, Porto\nGod know! Yag yag yo\nAfu-Ra\nLife force\nWatch out! Uh!", "title": "Reminisce", "album": null, "image": "https://s3.amazonaws.com/rapgenius/afu-ra-img-m9bcd974145235fbc46fbd6fe84387fc7.jpg", "year": "2013-08-01"}], "artist": "Afu-Ra"}