{"songs": [{"image": "https://images.genius.com/dc8859718c8b912f6ac8d798eb3580c0.600x594x1.jpg", "lyrics": "[Verse 1]\nTake a big hit, straight to your lungs\nA fat spliff, but nigga can you fuck with one?\nIt’s the dank, the shit that have a nigga daze-y\nKinda hazy, you know, straight crazy\nI got some raps and a track that I could flow to\nI need some dank and I know who I can go to\nTo my potna, the one with the fat sacks\nI get a personal pack and then I’m at that\nIt ain’t that I’m addicted on it\nBut the way it have me bein’ just make me want it\nYou know a nigga gots to give his props to the alcohol\nBut the dank is the shit for young Mac Mall\nOr maybe it’s the fuckin’ dog in me\nThat make grab a pack of zags and MD 20/20\nNah, I better switch that to gin\n‘Cause once that I get in she gon’ wish I never been\nBut see, I guess it’s just a side effect\nWhen you smokin’ on the dank wit' my tape in ya deck\nIt’s like that when I’m full of marijuana, ‘cause I’mma\nMake ya bitch feel way hotter than a sauna\nFull of the dank, the Taylor, the zesty\nPuffin’ on the dank in the Crest is where the best be, see\nIt’s a muthafuckin’ family thang, and that’s how we hang\n‘Cause even Kool had a muthafuckin’ gang\nTell me that, I’m slammin’ in ya car again\nSmokin’ dank just like a fuckin’ Rastafarian\nKick back, playa, hear what I’m sayin’\nBecause can’t nathan stop me, mane, when I’m dankin’ and drankin’\n\n[Chorus]\nI know you got some money on the dank, nigga (3x)\nWhat’s up? Fire up\nI know you got some money on the dank, nigga (3x)\nWhat’s up? Muthafucka, fire up\n\n[Verse 2]\nI been a chronic alcoholic since the days of O-L-D\nCrackin’ the 40s wit my muthafuckin’ homies\nMe and P.U.G, we hit the strip, uh oh\nSippin’ on gin and juice with the flow, I’m tore\nI’m drinkin’ like a maniac although my stomach’s empty\nBut to me and my SES gettin’ ripped comes strictly\nA 40, I was sippin’ one, ‘fore I was really grippin’ one\nI’m way too young to drink, my potnas elders get me one\nI sip on E&J, I thought the Hennessey was famous\nPass a pint of gin and watch a nigga act like Dayness\nSee that’s a SES shot to my Crew Thang cuddie\nT. Love, Short and Sleep, them my alcoholic buddies\nMoms tellin’ me to slow down, ‘cause I’m always tore down\nShe knew it was on, the first day I found out I didn’t need a ID\nThe C-O-P and gin gettin' soundin’ good to me\nSometime the drank make a nigga homicidal\n‘Cause fools they get nauseous when I come to this recital\nOf the Mac Mall lyrics to your dome, mane\nSlam it in your box or your deck or your home, mane\nSo don’t trip if it slip ‘cause you know it’s on hit\nSo watch these niggas tighten up on they bitch, when I come like this\nYou can’t get with me, even if I was tipsy\nI blast Handsome Town, as if my name was Filthy Phil\nBut on the real, sucka, take a dose\nOf the pimpin’ ass playa that’s sessin’ the most\nAnd I’m the nigga that the tricks be hatin’\n‘Cause I act a muthafuckin’ fool, when I’m dankin’ and drankin’\n\n[Chorus]\n\n[Verse 3]\nDankin’ and drankin’, a real cool thang that I love to do\nWith my crew, I got no time to be trippin’ off fools\nWho love to run up when they alcohol level way too high\nThat shit ain’t fly, yeah, that’s how fools die\nBut niggas still drink and drain go off a little quicker\nSteady getting courage from the liquor\nBut I know the next we gon’ be homies\nYeah, I got drank in my system, so is it gettin’ kinda lonely?\nSo if you see me, creepin’ through the Crest land\nFire up, ‘cause I’m lookin’ for the doja man\nSmokin’ on dry, me love to get high\nMe fuck with the dank ‘til the day that me die\nLove E&J and doja, call me, man, I’m sober\nThe drank make me want to put a fool in a coma\nFuck with the dank ‘cause it keeps me kinda peaceful\nFire up with Big John, get dank with DJ Cee, so\nDrank got me sprung, dank got me hooked\nMe live in the Crest with the playas and crooks\nMuch love to young Dubee, and Mac D-R-E\nStrictly dankin’ and drankin’ got me feelin’ irie\n\n[Chorus]", "year": "1993-07-12", "album": "Illegal Business?", "title": "$$ On Da Dank"}], "artist": "Mac Mall"}