{"songs": [{"title": "Hope", "album": "Rehab: Deluxe Edition", "year": "2011-09-27", "image": "https://images.genius.com/aa1bc7d1a0685a263e7fe2806314752d.550x550x1.jpg", "lyrics": "[Chorus]\nWould you still believe if the walls tumbled down?\nIf nights start getting cold would you stay around?\nWhen life starts getting hard could you fly above the fire?\nOr would you rather take an easy road to get to where we are?\n\n[Verse 1]\nHope, a four letter word, seldom heard\nYes plenty we can use but this ones sorta preferred\nAnd everybody want it but for many it won't occur\n'Cause they hoping they can see it but most of they vision blurred\nPeople hopin happy hour will get 'em talking in slurrs\n'Cause tonight is Friday night and on Monday is back to work\nBaby sister got a job and she hoping to lose hers\n'Cause she deal with losers who hopin to use her\nDrop her back off at the club, treat her like whose her\nShe just workin and then she hopin to pay for her school search\nI guess hopin in the dope but they hopeless abusers\nHope is what you do when you can't see into the future\nSee my hope is not a verb, my hope is found in a noun\nMommas think that cap and gowns is the greatest hope to be found\nDaddy's hope is in his zero, that's preceded by some commas\nMy cousins is marijuana, he hope to escape the drama-need\nHOPE\n\n[Chorus]\nWould you still believe if the walls tumbled down?\nIf nights start getting cold would you stay around?\nWhen life starts getting hard, could you fly above the fire?\nOr would you rather take an easy road to get to where we are?\n\n[Verse 2]\nI need it, I gotta have it, I gotta get it for real\nI see people flat out starving just hopin' to get a meal\nPeople prostitute they music they hopin' for record deals\nI'm hopin in what I know and they hopin in what they feel\nBut they feeling is never real it's belief\nNothing more than opinion, maybe something you think\nQuicker than you could blink, hopin no hope at all\nSoon as you get to flying you hopin that you don't fall\nYour hope don't last forever, now you done hit a wall\nBut maybe something more but you hopin no hope at all\nAnd now you are confused, cause you been paying dues\nThat cross more than you got, because that's in you got to lose\nAnd you ain't gotta clue that you ain't got hope\nYou got a boat full of wishin' that won't float\nAnd even when it does, it's only for a second I'm reckon\nThat's prolly why you listenin to this message, because you need hope\n\n[Chorus]\nWould you still believe if the walls tumble down?\nIf nights start getting cold would you stay around?\nWhen life starts getting (hard or hot) could you fly above the fire?\nOr would you rather take an easy road to get to where we are?"}], "artist": "Lecrae"}