{"songs": [{"title": "Goon Music", "image": "https://images.genius.com/7295bc7823cd773714425da85727d32b.1000x1000x1.jpg", "lyrics": "[Verse 1]\nAll I wanted was a big Benz\nTo ride my friends in\nA pretty girl, with no curfew, and some thick skin\nA new outfit, to get dressed and slip in\nNo im not slippin\nI got my girlfriend\nShe ridin by my side till the world end\n\nAnd right before it do\nI thank the lord for my courage\nAnd I promise if I cheat:\nI NEVER DID IT ON PURPOSE\nLets go Brisk!\n\nI is!\nI couldn't stop nor switch gears!\nI switch chicks, like I switch pills\nAnd I been doin this a couple years\nI cry so much, I could fill a bucket up wiith tears\n\nSo please tell me:\nDO YOU FEEL ME?\nIf you dont you's a hata\nIts all good, i'll pray for ya\nKeep talkin, theres a place for ya\n\nI gave my all to this goon life\nAnd all I got was fast money and Ice\nLets Proceed: Street Medicine\n\n[Verse 2]\nYou are lookin at the article of hard work\nThat if succeeds, got me twisted every concert\nReal niggas recognize, so we convese\nSee I be bumpin in they Donks every verse\nNow listen:\n\nThat fie weed get stuck in my backwood\nHad a little more, to make sure its packfull\nI'm so consistent, I'm so gifted\nI should've been born on Christmas\nJe-sus, be born with privildges\nI did it to benefit the hood and little ones\nI never look down or ever try to belittle them\nNor my siblings, why bicker?\nI'm just tryna do BIGGER\nYea\n\nAnd I look intense to help me\nMy thin ass gotta make all these niggas respect me\nSo I'm just out fuckin the world\nBustin nuts, tryna have a little girl\nBRISCO!\nKeep going Brisk! Yeaaa!\n\n[Verse 3]\nIf I ain't the best, what you call us?\nNothin to loose but my voice, so im allin!\nIts like I had no other choice, this music was my callin\nOn the edge tryna keep myself from fawlin\nCompare me to your favorite artist\nHad this reign of greatness that im embarkin!\n\nIt stands no chance!\nI won't take pay, 360 deal or advance\nFUCK EM! I'd rather wait in line\nAnd me and these cats go and do our time\n\nGrinding!\nI know they claim that diamonds dont tarnish\nUnder Louis-Faton garmets!\n\nI Promise!\nWhen I bring it home!\nI'mma drop dad off and put another nigga on!\nGOON MUSIC!\nThats just the method of, showin another goon how to do it!\nBRISCO!", "year": null, "album": "Revenge"}], "artist": "Brisco"}