{"songs": [{"album": null, "year": "2011-02-26", "title": "Can I Get Witcha", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "[Verse 1: The Notorious B.I.G]\nAnother day in the ghetto\nOne look outside I'm already upset yo\nIt look about a hundred-and-two\nIt's a Saturday and Biggie ain't got nuttin to do\nUhh, I'm intrrupted by a phone ring {*brrrrring*}\nSometimes I wish I never got the motherfuckin thing\n\"Hello hello? Can I speak to Biggie?\"\nYo who dis? \"Taisha\" Yo call back, I'm busy\nWhy don'tcha hit me on the box a little later\nWashed up, got dressed, hits the elevator\nSteps out it's the same old scene\nDope fiend, crack fiend, eyewitness news team\nI seen a honey with a butt looking butter soft\nI know she looks much better with them clothes up off\nSitting all thick, with the ruby red lipstick {*SMACK*}\nThat's the one I gotta get with\n\n[Hook: The Notorious B.I.G]\nCan I get witcha, can I get witcha\nCan I get witcha, can I get witcha\n\"Why you wanna get with me?\"\nCause you got a big B-U-T, T, see\nCan I get witcha, can I get witcha\nCan I get witcha, can I get witcha\n\"Why you wanna get with me?\"\nCause you got a big B-U-T, T\n\n[Verse 2: J. Cole]\nI'm tryna get with ya girl, I ain't even going stunt\nMiss Fat booty, man I seen it from the front\nI mean that shit was pumped, had me fiending from the jump\nAnd that ass was right, shit would make a fag look twice\nSo I approach like “shawty , whats good with cha?”\nNigga was hopin’ to go back to the hood with ya\nAnd yeah I see them other niggas tryna look at cha\nWouldn’t slang the thing right even if they could get ya\nMe I’m from the Ville where we learn how to mack well\nAnd you gon’ yell when I hit it from the back well\nTake you to the crib and throw on a little Maxwell\nGrab a condom know cause, shit, I don’t know you that well\nHaa, was fucking with that\nFar from hater but see dem brothers was wack\nSo don’t you worry bout them mean muggin’ girl\nI’m tougher than that\nAnd niggas mad cause this light skinned brotha is back\nI’m sayin’ though\n\n[Hook & Interlude]\n\n[Verse 3: J. Cole]\nStripes on the Polo\nOn the late night, fucking your wife on the low low\nMy pipe like a pogo stick, no homo\nNo ice but I’m cold though\nCologne on my nuts in case she might wanna go low\nI’m from the Ville where niggas fight for the dolo\nSo think twice or take the same advice from the fo’fo’\nMe running to PoPo and muthaf-ckin’ no go\nA Carolina nigga, I’m the muthaf-ckin logo\nShit, fly as hell on my ozone shit\nDisrespect me nigga you could get your cornroll split\nAnd that goes for you too, I’m on my Bono shit\nNiggas got no delivery thats that Digiorno shit\nI got porno chicks callin’, I still neglect them nigga\nI’m about my money like a bill collector\nFor you slow niggas I put it more in laymans\nIf you ain't talkin’ money its a foreign language\nBut uh, shawty can I get wit cha\n\n[Hook: The Notorious B.I.G]\nCan I get witcha, can I get witcha\nCan I get witcha, can I get witcha\n\"Why you wanna get with me?\"\nCause you got a big B-U-T, T, see\nCan I get witcha, can I get witcha\nCan I get witcha, can I get witcha\n\"Why you wanna get with me?\"\nCause you got a big B-U-T, T"}], "artist": "J. Cole"}