{"artist": "Aminé", "songs": [{"title": "​hunnybee remix", "album": null, "year": "2019-01-07", "image": "https://images.genius.com/afacbcbe5c0c42a917191c47542506c4.500x500x1.jpg", "lyrics": "[Intro: Aminé]\nYeah, you know I'm back in the building\nYeah, where did you think I went?\nI didn't go nowhere, I'm still, I'm-I'm right here\nYeah man, yeah you know it's-it's been cool\nThe sun has been shining\nYou know what I mean, how 'bout you?\nI don't give a fuck, look\n\n[Verse 1: Aminé]\nWestside baby, PDX made me\n503 'til I D-I- (You know)\nAin't shit sweet but the pussy I eat\nAnd you know I'm in this bitch like a IUD (Yee)\nI'm the dude that your girl told you not to worry 'bout (True)\nNow I'm your house with my legs on the couch (True)\nFace pointed south so her ass wanna bounce (Hey)\nShawty give me head when I respect her\nSo I get head all the time (Hey)\nThat's why I'm ahead of the time (Hey)\nMy verse is priceless, my touch is Midas\nUnknown New Zealand, my chains from Iceland (Hey) (Period)\nReel it in, tell a friend\nAmine got the juice and I'm always gon' sin (Yeah)\nAfter school with it like a nigga Dom Kennedy (Yeah)\nSmoke big dope just to take away the pain in me\nI'm a grown ass man\nPussy ass niggas can't stop my plans (Nah)\nNo handouts, I don't need no hand (Nah)\nYour girl walked in said \"Play my jam\" (Play my jam)\nI ain't Timberlake but I make your feelings ache (True)\nGirls twerk and sing to the shit I make (Yee)\nI wonder why she don't like a nigga like me (Hey)\nMaybe she does but her pride too mighty\n\n[Chorus: Aminé]\nI'm not sure what I see\nCupid don't fuck with me\nAre you telling me this is a sign? (Wait is this a sign?)\nShe's looking in my eyes\nI don't see no other guys (No)\nAre you telling me this is a sign? (Wait is this a sign?)\n\n[Interlude: Aminé]\nOh my god, that's hard\nWoah!\n\n[Verse 2: Aminé]\nI'm too jaded, walls keep caving\nMight say I'm good but I got two faces\nFeels so basic, hard to say this\nI like a girl that dance like honey\nAnd always 'bout it, 'bout it\nBut she 'bout that money\n\n[Outro: Unknown Mortal Orchestra & Aminé]\nHunnybee, Hunnybee\nThere's no such thing\nAs sweeter a sting\nHunnybee, Hunnybee\nThere's no such thing\nAs sweeter a sting\nHunnybee, Hunnybee\nThere's no such thing\nAs sweeter a sting (Uh huh, uh huh)\nHunnybee (Yeah), Hunnybee\nThere's no such thing (Yeah yeah)\nAs sweeter a sting"}]}