{"songs": [{"image": "https://images.genius.com/41476a2511b7ea02477cf20eb9ceb8ad.500x500x1.jpg", "lyrics": "(Intro)\nYa Ya ya (Yo, yo, yo)\nLet me get this shit started, mayne (get this shit started, mayne!)\nIf it's gon' be a party, let me get the shit started, mayne (get the party started, mayne!)\nYadadameam? (yadadamean!)\n\n(Verse 1)\nPass the boilermaker, and your toilet paper\nI'm shittin' on fools, dope like a quarter caker\nOr a acre, not a Celtic or a Laker\nI'm a King, find me on Florin with a mouth full of bling\nIn something clean, doing MY thing\nNigga what you mean, I'm a legend like Kareem\nAbdul-Jabbar, I screwed your broad\nSnaked ya, 42 faked ya\nOops, fooled ya, boy\nWho's ya boy? He's better of dead\nLet that cat know he's in over his head\nWhat? You ain't know? I'm mafia nigga\nGot a nation of thugs that'll die for ya nigga\nRide for ya nigga, But, I need no mans\nWanna tango? Come on, nigga, we gon' dance\nI'll do the Thizzle Wiggle, right on your face\nThen throw you in the trunk with the bump and the base\n\n(Hook 1 (by PSD))\nYadidamean, I'm Hotta Den Steam\nSharp as a crease, nigga, follow my teach\nBother me not, nigga, potna is mean\nA prophet-like street hustla, nigga\nCutthoat heat tucka\nYadidamean, I'm Hotta Den Steam\nSharp as a crease, nigga, follow my teach\nBother me not, nigga, potna is mean\nA prophet-like street hustla, nigga\nCutthoat heat tucka\n\n(Verse 2)\nI'm prideful, pack a rifle, like Daniel Boone\nRomper Room tycoon, best things since cartoons\nAnd my platoon'll eat a nigga like shrooms\nGoons, muggin' n' thuggin' from July to June\nA gorilla do the baboon all in a womb\nFind me flossin' on flyers that say \"Coming Soon\"\nI 'coon, nocturnal, love the moon\nBut we can meet in the middle of the street at high noon\nAnd my beat goes boom, to concern may it whom\nOn this mic, I'll eat ya, no forks, knives or spoons\nI sport Nike shoes, strike Gucci and Louie\nFrom the Crest, on the best, light, sticky and gooey\nNever fuck with the Chewy, but when I kick it with Dubee\nWe pop several Thizzes, ooh we get stuey\nShoo buh dee doo wop, doo buh dee doo\nMirror, mirror on the wall, tell me who be the fool?\n\n(Hook 2 (by PSD))\nYadidamean, I'm Hotta Den Steam\nSharp as a crease, nigga, follow my teach\nBother me not, nigga, potna is mean\nA prophet-like street hustla, nigga\nCutthoat heat tucka\nYadidamean, I'm Hotta Den Steam\nSharp as a crease, nigga, follow my teach\nBother me not, nigga, potna is mean\nA prophet-like street hustla, nigga\nCutthoat heat tucka\n\n(Verse 3)\nThe Feds watch me, like I'm a fuckin' Hitachi\nBut I got Lessons And Suggestions, like The RBL Posse\nProtected by God, see, Them devils can't hurt me\nAnd them haters get ate just like Thanksgiving Turkey\nI'm a warrior, when I, come out and play\nI do it like we do it, nigga, out in The Bay\nSideshow after every show, yokin' in a Chevy, ho\nSeven seven Box, or a Glasshouse seven fo'\nYou never no, yo, I keep 'em guessin'\nStrapped with a fat .40 Cal Smith & Wesson\nFor my protection, but nobody see it\n'Til it's funk, when it's funk, punk I 3D it\nLive N' Direct, I ride for respect\nAnd I got prison tactics, catch a knife to the neck\nCatch me in a 2 seater on Van Ness\nRidin' with my 2 heaters, who wan' come test?\n\n(Hook 3 (by PSD))\nYadidamean, I'm Hotta Den Steam\nSharp as a crease, nigga, follow my teach\nBother me not, nigga, potna is mean\nA prophet-like street hustla, nigga\nCutthoat heat tucka\nYadidamean, I'm Hotta Den Steam\nSharp as a crease, nigga, follow my teach\nBother me not, nigga, potna is mean\nA prophet-like street hustla, nigga\nCutthoat heat tucka\n\nYaaaaaaaaaaaaaaaaaaaaaaaaaaaaaaa!", "year": "2003-07-15", "album": "Heart of a Gangsta, Mind of a Hustla, Tongue of a Pimp", "title": "Hotta Den Steam"}], "artist": "Mac Dre"}