{"songs": [{"image": "https://images.genius.com/c4d8605dff947c8e53f29c6880512a28.645x645x1.jpg", "title": "Bay", "album": "Brass Knuckles", "year": "2008-09-16", "lyrics": "* Wal-Mart online bonus track\n\n[Intro]\nUh, mm, mm, mm, mm, mm\nMm, mm, mm, mm, mm, mm, mm\n\n[Hook: Nelly]\nI was out in the - Bay Bay Bay Bay Bay\nMet some niggas from the - Bay Bay Bay Bay Bay\nMet some girls from the - Bay Bay Bay Bay Bay\nLot of folks in the - Bay Bay Bay Bay Bay\nAnd they all go - dum dum dum dum dum dum dum dum\nThey all get - dum dum dum dum dum dum dum dum\nThey all go - dum dum dum dum dum dum dum dum\nThey all get - dum dum dum dum dum dum dum dum\nOhh!\n\n[Nelly - impersonating Spice 1]\nUh, uh, uh\nAiyyo I represent that Derrty E-N-T all the way\nBut I'mma rip this shit up like I'm straight from the Bay\nBut no it ain't the Spiggity 1 from back in the day\nIt's the diggity-diggity Derrty one, they call him Nelly\nLeanin' on his Cutlass with his cellular phone\nYou could tell that the St. Lou' was his home\nMore mail than the rest of them rappers\nCause they did more stompin than the cappers\nAnd that's why Ice clique was it\nFirst name St., last name 'Tics\nHalf-brothers and they name Murph' and Ky'\nSlo had a mask, City and Ali\nOld school rep, color cranberry\nUp in the abyss with homie E-40\nOrange juice, mix it with the Tang-and-a-ray\nHey, what can I say? (huh?)\nI was out in the..\n\n[Hook]\n\n[Nelly - impersonating Too $hort]\nWho you think this is?\nThis ain't Short, this St. Louis\n+Born to Mack+, ma that's my biz\nLife's +Too Short+, baby catch my drift\nI was told not long ago\n\"Nelly, don't stop that rap\nIf you do it well enough\nShe just might bring it back\"\nThen I yelled out BIATCH! I go on and on\nBaby girl skills on the level of porn\nA freaky tail that I met out on tour\nMama was bad like Lena Horne\n$hort then said I got a dirty mouth\nSometimes that might be true\nBut I'm the CEO of Derrty mayne\nSo, I ain't trippin off you\nI'm just out in the..\n\n[Hook]\n\n[Nelly - impersonating E-40]\nRock a green fitted, with a yellow A\nYeah I'm from the Lou', but today I'm reppin Bay\nBring the yellow tape, he ain't gettin far\nMirror in my pocket so I practice lookin hard\nAnd you don't wanna be around when them boys pullin out them thangs\nAll my niggas is pimps, man they all carryin canes\nI met this girl up in the club, she told me call her Wassie\nRed bone thick, with a bangin-ass body\nNow is I, now is I, should I save her?\nThink about it, no way, UGHH!\nLook up in the sky, it's a bird, it's a plane\nWhat's his crew name? Derrty E-N-T mayne!\nI just wanna know (know) tell me when to go (go)\nPrice is on the Cavi', but I can get it low\nPocket full of fatty and sippin that hurricane\nSo just sprinkle me mayne\n\n[Hook]\n\n[Outro]\nMm, mm, mm, mm, mm, mm, mm, mm\nMm, mm, mm, mm, mm, mm, mm, mm"}], "artist": "Nelly"}