{"songs": [{"image": "https://images.rapgenius.com/2a93127b01839921771818a8925db541.1000x1000x1.jpg", "title": "All I Have (PRO_FITT Remix)", "album": "WOW Hits Party Mix (Deluxe Edition)", "year": "2015-03-10", "lyrics": "[Hook]\nDon't tell me that this isn't real\nDon't tell me this ain't how I feel\nThis is all I have, all I have\nDon't tell me that this isn't real\nDon't tell me this ain't how I feel\nThis is all I have, all I have\n\n[Verse 1]\nAll I ever wanted was somebody to hear me\nAnd all I ever wanted was somebody to feel me\nAnd everybody wanna tell me that I'm out of my head\nWhen I'm on the mic that's fine but that don't scare me\nIt's been a long time but I'm back now\nRap pow welcome to the rap house\nRap pow will live till I pass out (blackout blackout\nEverybody keep on wondering if I still) rap now\nAre you serious? Anybody out there hearing this?\nYo I came in the game as a lyricist\nAnd I'mma leave like that. Period\nYou sniff lines, I write lines, you've now entered in my mind\nAnd you better get ready cause you might find\nI'm from a different place and my kind\nIt's a little bit different than yours is\nQuit snoring (hip hop isn't dead)\nIt's just been in mourning from the moment I quit recording\nQuick, record this!\nListen I'm warming up and you're misinformed if\nYou think that I'm slipping up, this ain't sick enough, then I'll skip the chorus\nI've been here ain't nobody heard of me?\nYeah I'mma turn this beat to a murder scene\nI don't live for the world\nI live for the King, I live for the King, focus\nWrote this with emotion\nIt's hard to get a break when the door's ain't open\nIt's hard to get a shot when the gun ain't loaded\nAnd it's hard to make a living when nobody wanna notice. Hold it\nWhat am I insane maybe? Plain crazy\nYou put me in a room with a mic you will not restrain me\nYou do what you wanted but you can't contain me\nLazy! Is not a character trait of mine. Don't wait in line\nThis is the current condition of my state of mind\n\n[Hook]\nDon't tell me that this isn't real\nDon't tell me this ain't how I feel\nThis is all I have, all I have\n(This is all I have, all I have)\n\n[Verse 2]\nAll I ever wanted was somebody to get this\nAll I ever wanted was somebody to play this\nTake my song, put it on their playlist and get goosebumps every time they play it. Rate us\nIf that's my calling or not Father, maybe I should just not bother\nGo back to that 9 to 5 but I am not a quitters so quit that\nI never been a killer but I guarantee I kill tracks\nPut them in a coffin, lost in\nRip that, trying to make an impact in rap is that insane? Well I guess so\nRap though, better give me that pencil\nAnd you ain't ever gonna make it, it's all mental\nI am in a place where I can't let go. Ah!\nI still work a job and do this\nAnd y'all know what's stupid?\nI thought all you had to do was get a record deal and yo things start moving\nBut that's not the case because most of the times the artists you hear\nYou keep on thinking that artist is new but that artist has probably been at it for years\nYeah. In the back of my mind thinking\nAm I wasting my time dreaming\nAnd I ain't got no money in my wallet but I guarantee there ain't no way that I am gonna leave this\nI need this. I swear to y'all I need this (I swear to y'all I need this)\nAnd this hip-hop's in my veins if you cut me I'mma bleed it\nAnd yo. What you think I write write raps for no reason, no\nTake my pain and I put em in a song ever since them pills they took my mom\nI've been a different person. Don't try to predict my verses\nWhat you're hearing now is me whether I'm in front or behind that curtain\nI stand behind these words. I'm a Christian but I'm not perfect (don't tell me that this isn't real)\nDon't tell me to calm down. I'm calm now, listen I'm just working (don't tell me this ain't how I feel)\nYeah it might take a minute to get it but once you get it everything will be crystal clear (this is all I have, all I have)\nI don't think they see my vision here. I don't think they see my vision here!\n\n[Hook]\nDon't tell me that this isn't real\nDon't tell me this ain't how I feel\nThis is all I have, all I have oh oh\nDon't tell me that this isn't real\nDon't tell me this ain't how I feel\nOh this is all I have, all I have, oh yeah\nDon't tell me that this isn't real (all I ever wanted was somebody to get this)\nDon't tell me this ain't how I feel (all I ever wanted was somebody to play this)\nAll I ever wanted was somebody to get this, all I have\nAll I ever wanted was somebody to get this, all I have\n\nDon't tell me that this isn't real, this isn't real, this isn't real\nThis is all that I have, this is all that I have\n\n[Outro]\nDon't tell me that this isn't real\nDon't tell me this ain't how I feel\nThis is all I have, all I have"}], "artist": "NF"}