{"songs": [{"lyrics": "[Intro]\nIt was all a dream\n\n[Refrain: Faith Evans]\nLast night I had a dream, thoughts was racin through my head\nFelt so real to me, this is what was said\n\n[Verse 1: Jay-Z]\n\"Had a dream,\" I said; \"Bout who?\" he said\n\"'Bout B.I.G.,\" I said; \"That's big,\" he said\n\"Dig what he said\"; \"Proceed,\" he said\n\"Indeed,\" I said, so, breathe I did\n\"Don't repeat what I say,\" I said, he said nothing\nHe agreed with his head, he just nodded like this\nWhat I believe to be a yes, I repeated what was said\n\"It came to me like a whisper last evening,\" I said\n\"What's the deal, playboy?\" was the greeting he said\nFirst thing I wanted to know was the reason he was dead\n\"Mo' Money Mo' Problems,'\" better believe it,\" he said\n\"Careful what you wish for, you might receive it,\" he said\n\"I see,\" I said, \"jealousy\" I said\n\"Got the whole industry mad at me,\" I said\nThen B.I. said, \"Hov, remind yourself:\nNobody built like you, you designed yourself!\"\n\"I agree,\" I said, \"my one of a kind self\"\nGetting stoned every day like Jesus did\n\"What he said,\" I said, \"has been said before\"\n\"Just keep doin your thing,\" he said; \"say no more\"\n\n[Refrain: Faith Evans]\nWas it all a dream - tell me\nWas it all a dream, was it a dream\nWas it all a dre-eeee-eeeee-eeam\nI gotta know (It was all a dream)\nWas it all a dream - was it a dream\nWas it all a dream, a dream\nWas it all a dre-eeee-eeeee-eeam\n\n[Verse 2: Notorious B.I.G.]\nIt was all a dream, I used to read Word Up! magazine\nSalt-n-Pepa and Heavy D up in the limousine\nHanging pictures on my wall\nEvery Saturday, Rap Attack, Mr. Magic, Marley Marl\nI let my tape rock 'til my tape popped\nSmoking weed and bamboo, sipping on private stock\nWay back, when I had the red and black lumberjack\nWith the hat to match\nRemember Rapping Duke, \"duh-ha, duh-ha\"\nYou never thought that hip-hop would take it this far\nNow I'm in the limelight 'cause I rhyme tight\nTime to get paid, blow up like the (World Trade)\nBorn sinner, the opposite of a winner\nRemember when I used to eat sardines for dinner\nPeace to Ron G, Brucey B, Kid Capri\nFunkmaster Flex, Lovebug Starsky\nI'm blowing up like you thought I would\nCall the crib, same number same hood, it's all good\nAnd if you don't know, now you know, nigga\n\n[Refrain: Faith Evans]\nWas it all a dream - tell me\nWas it all a dream, was it a dream\nWas it all a dre-eeee-eeeee-eeam\nI gotta know (It was all a dream)\nWas it all a dream - was it a dream\nWas it all a dream, a dream\nWas it all a dre-eeee-eeeee-eeam\n\n[Outro: Jay-Z (spoken)]\n\"I see,\" I said, \"jealousy\" I said\n\"Got the whole industry mad at me,\" I said\nThen B.I. said, \"Hov, remind yourself:\nNobody built like you, you designed yourself!\"\n\"I agree,\" I said, \"my one of a kind self\"\nGetting stoned every day like Jesus did\n\"What he said,\" I said, \"has been said before\"\n\"Just keep doin your thing,\" he said; \"say no more\"", "title": "A Dream", "image": "https://images.genius.com/bbaaa25ac55d3bc2008448e1647d3b54.720x631x1.jpg", "year": "2002-11-12", "album": "The Blueprint 2: The Gift & The Curse"}], "artist": "JAY-Z"}