{"songs": [{"title": "分かる (WAKARU)", "image": "https://images.genius.com/2210f2f80b766fff98cdfcf2f67cdba0.1000x1000x1.jpg", "lyrics": "[Chorus]\nWakaru, Wakaru\nWe gon ask you, \"who the fuck you talking to?\"\nTalking to\nComing round here like we rock witchu\nRock witchu\nNigga said, \"Show ya right.\"\nYou don't wanna roll the dice\nWe gon roll up on you like\nWakaru, Wakaru\nWe gon ask you, \"who the fuck you talking to?\"\nTalking to\nComing round here like we rock witchu\nRock witchu\nNigga said, \"Show ya right.\"\nYou don't wanna roll the dice\nWe gon roll up on you like\n\n[Verse 1]\nDeezy, where you been?!\nStacking yen, doing hella shit\nOn my Bryson Tiller tip\nI'm back and I'm better bitch!\nShibuya, we hella lit\nChibuya, I represent\nI school ya, no reprimand\nTabun? No, a definite\nI'm out here making yen stack\n32 bars on a J.A.M track\nDippin out the casa with Tsubasa, thats a syntax\nWhile you losers follow in line\nI'm going Bleach with the heat, tips hollow inside\nOK, I play... Lyrically I'm the same\nI'm going bleach with the beats, fuck with me and get stained\nYou might see me with some Gucci\nOr Monica, no Belluci\nBut my X-Large fit with my Takeo Kikuchi\n100% paid, 106 ways\nI could ball on you niggas 106 days\nI don't love em, I duck em, I do what a pimp says\nI be stuck in my ways, I be stuck in my ways\nYeah!\nThe maverick cat in the habitat\nBorn half and half, the Afrocentric Asian be the aftermath\nOh, I had to laugh, yall goofy with the back-to-backs\nBooth be like the tabernacs, writing raps til the tablet cracks\nYou doubt me like Yoshi in Smash\nI'm going Master Roshi, riding Denentoshi and back\nOr probably somewhere in Osaka, drinking saka, eating sushi\nThat's Supreme on my hat, but a nigga feel gucci\nIt's obvious that all this godliness gotchu probably pissed\nNo ollie shit when I pop up on you, that's a promise bitch\nI'm honest with, every word I say, don't gotta politic\nAnd wavy, my armada lit\nPeace, now I'm outta this\n(GONE!)\n\n[Outro]\nYo, I been having a good time out here\nYou know what I'm saying\nThis my first time in Japan but it feel like I've been here before\nYou know what I'm saying\nMe and Tsubasa, we with two honeys\nYou know what I'm saying\nYou might get lucky if you can get a meal\nOr Tsutaya and Chill\nLet's get it", "year": "2016-06-01", "album": null}], "artist": "Ace Hashimoto"}