{"artist": "G Herbo", "songs": [{"title": "Bug", "album": "Still Swervin", "year": "2019-02-01", "image": "https://images.genius.com/c9afa7b8044e0a1dd4a8eba6baf78768.1000x1000x1.jpg", "lyrics": "[Chorus: G Herbo]\nI walk in this bitch, I'm lookin' like a light bulb\nGive me 30 thousand to walk in your night club\nAnd I switch my shoes and shit like I'm from Flight Club\nI got drugs, is you gon' use 'em? Bitch, I don't like nice girls\nUh, uh, go on, get bugged\nUh, they play the song at the club, go on, get bugged\nAnd I'm a thug, the hoes like us\nCome party with the gang-gang, you gon' have fun\n\n[Verse 1: G Herbo]\nUh, big G Herbo, call me Swervo\nFuck that humble shit, hit the turbo\nYou can't even book me for nothin' less than 30\nBut 20 or somethin', that's what you get a verse for\nI was drinkin' lean on niggas first\nFoenem got me poppin' Percs, though\n.380 Glock, ho, put that in your purse\nProlly go on a lil' chase for the worst, though\nChill, though, you thirsty as fuck\nI can't fuck with groupie bitches, I'ma keep it a buck\nGotta keep it 150, got a light dub or a 50 with me\nPull to the club for the backend, keep that shit if you frisk me\nAlready goin' up in this bitch, it's risky\nAh-ha, foenem lose control up in this bitch like Missy\nAnd you ain't never say they miss me\nLord, fuck it, I'ma spend a rack and bulletproof the Bentley truck\nMatter fact, that ain't even gonna be tough, I'm 'bout to get some money\n\n[Chorus: G Herbo]\nI walk in this bitch, I'm lookin' like a light bulb\nGive me 30 thousand to walk in your night club\nAnd I switch my shoes and shit like I'm from Flight Club\nI got drugs, is you gon' use 'em? Bitch, I don't like nice girls\nUh, uh, go on, get bugged\nUh, they play the song at the club, go on, get bugged\nAnd I'm a thug, the hoes like us\nCome party with the gang-gang, you gon' have fun\n\n[Verse 2: Lil 40]\nI might pull up with your bop, I got her off the drugs\nDrop out of school, I always ditched to go hang with the thugs\nExotic pack, this ain't just weed what I put in my lungs\nHollow points the only shells what I want in my guns\nFold up lil' crew 'cause both a real loose screwy (I am)\nFuck the opps, sit back and roll their homies out the QT\nI been stackin', miss my niggas, this one for Lil Boosie\nCome have fun with the gang, we turn shit to a movie\nAll these bitches groupies, I might buy some uzis\nPass 'em to the gang-gang, niggas smoked like loosies\nNiggas get fucked like coochie, we rob niggas for they oochies\nTreat a penny nigga like Rudy's, most of these niggas is goofies, gang\n\n[Chorus: G Herbo]\nI walk in this bitch, I'm lookin' like a light bulb\nGive me 30 thousand to walk in your night club\nAnd I switch my shoes and shit like I'm from Flight Club\nI got drugs, is you gon' use 'em? Bitch, I don't like nice girls\nUh, uh, go on, get bugged\nUh, they play the song at the club, go on, get bugged\nAnd I'm a thug, the hoes like us\nCome party with the gang-gang, you gon' have fun\n\n[Verse 3: Pretty Savage]\nAyy, hey, where you from?\nWho told you come around this way? Bitch, is you dumb?\nThis drip so slimy, murder one\nGang on gangsta shit, 150 in the slums\nAyy, serve what you want because we on the same thing\nYou a walkin' lick if you ain't with the stain gang\nMy brother fucked a ho down with your main thing\nFuck nigga, rocks in the jewels, let the chain swing\nWettin' the blocks broad day, nigga, dang rain\nBendin' the block, yellin', \"Gang, gang, gang, gang\"\nRun from cops and they know we won't say names\nPick up the Glocks, milly rock-a-bye, bang-bang\nPlay by the rules, a'ight?\nWalk-walk away, don't make the news, a'ight?\nI might go drop on a Tuesday night\nDiamonds dancin', thought you could use the light, yeah\nYou gotta wait 'til it's payday\nBank cash my check in the same day\nYou tryna see what your bae say\nMy niggas solid, bro coolin', that's my ese\n\n[Chorus: G Herbo]\nI walk in this bitch, I'm lookin' like a light bulb\nGive me 30 thousand to walk in your night club, uh\nAnd I switch my shoes and shit like I'm from Flight Club\nI got drugs, is you gon' use 'em? Bitch, I don't like nice girls\nUh, uh, go on, get bugged\nUh, they play the song at the club, go on and bug\nAnd I'm a thug, the hoes like us\nCome party with the gang-gang, you gon' have fun"}]}