{"artist": "360", "songs": [{"album": "What You See Is What You Get", "year": "2008-03-22", "title": "Woah!", "image": "https://images.genius.com/b01a68880fdf408d16b94407da51e8b8.600x598x1.jpg", "lyrics": "[Intro: 360]\nWoah! (Forthwrite) That's what people say when they see us. It's like, \"Woah!\" (360 and PEZ) Like a rude awakening. Like a massive shock. Like, \"Woah!\"\n\n[Verse 1: 360 & PEZ]\nHey yo, we kind of stand out of a crowd, yeah, you notice this\nOnly ice that I try to smoke is the frozen shit (Uh)\nIf you think I'm gonna pass blame you silly son\nOnly finger that I'm ever pointing is the middle one\nNow I'm talking in a little conversation\nThere's a crowd so just switch off your patience\nNow raise up your hands, we making a stand\nHold 'em up and wave, just wave, wave\nYou know were better than the norm and if you question it you're gone\nSo just believe it and leave all of that aggression at the door\nAll who even entering the place know\nThat we're real rapper nice, so just chill back and vibe a little bit\nYou might sit, sipping on your wine\nBut I get sick of just sitting in one position for the night\nSo I like to move and find my mood\nJust wave your hands side to side if you like this groove\nIt's like that, now back to the matter at hand\nIf you're an arrogant fan then get to clapping your hands\nAnd go crazy, don't do it any other way\nThe party's right now, now everybody say\n\n[Chorus: 360]\nWoah! Everybody going sick in the crowd\nYou all know what we're singing about, just get loud\nWoah! Make the place jump, go and turn the bass up\nIf you wanna raise up, everybody say \"Woah!\"\nWoah! Everybody going sick in the crowd\nYou all know what we're singing about, just get loud\nWoah! Make the place jump, go and turn the bass up\nIf you wanna party then throw your hands up high\n\n[Verse 2: 360 & PEZ]\nYeah, 60's in the house\nWhile I'm kickin' this rhythm at all the kiddies sitting down (Yep)\nIf you be drinking it go and stick it in your mouth\nEven if it's nearly full then you're finishing it now, yeah\nFans chant [?] light the fuse\nIf you can't dance, damn, man, buy some booze\nAnd clap hands from the grandstand, riot too\nMake this show wild enough to hit the nightly news\nOn Channel 9 and 2, and then on 7 and 10\nUntil every regular resident reckons that it's repetitive (What?)\nYou know the game when you got fame on your mind\nI'm tryna get myself a plane so I can take it and fly\nAway to the sky and write, \"Yo, I made it\" in white\nWith my name next to it, yeah, my aim is to try\nAnd get so famous I can go places\nAnd get my own waitress even when they have no waiters here\nAnd now we switching back the flow while we bringing it back\nMaking music that we love, I'll be singing a track\nAnd anybody get around with a plan to diss us\nRock up late, have you saying, \"Damn, you missed us\"\n\n[Chorus: 360]\nWoah! Everybody going sick in the crowd\nYou all know what we're singing about, just get loud\nWoah! Make the place jump, go and turn the bass up\nIf you wanna raise up, everybody say \"Woah!\"\nWoah! Everybody going sick in the crowd\nYou all know what we're singing about, just get loud\nWoah! Make the place jump, go and turn the bass up\nIf you wanna party then bounce, woah!\n\n[Outro: 360]\nWoah!\nWoah!\nWoah!\nIf you wanna party then bounce"}]}