{"songs": [{"year": "2012-02-21", "image": "https://images.genius.com/356f10af62b8119c07edb8d71580c5d3.320x320x1.jpg", "title": "The World is a Ghetto", "album": "Pineapple Now-Laters", "lyrics": "[Intro]\nKids is what make me feel so good\nSee you looking at the glory that's coming up into the future of life\nSee the younger youth is what's gonna make everything to keep going\nAfter I done passed down the hill\nYoung and black!\n\n[Hook: BJ the Chicago Kid] x2\nDon't you know\nThat it's true\nThat for me\nAnd for you\nThe world is a ghetto\n\n[Interlude]\nThen there's a lot of funky things in this country\nAnd there's a lot of good things too\nBut there's more funky than good\nWe've changed some for the best\nAwful lot of cases for the worst\nAnd some, they have not changed at all\n\n[Verse 1: BJ the Chicago Kid]\nWalking down the street\nFoggy eyes\nLooking at the sky\nStarry eyes\nSearching for a place\nWeary eyes\nCrying in the night\nTeary eyes\n\n[Hook] x2\n\n[Interlude]\nDude, we got to get our minds together!\nAnytime a brother was shot another brother in his own neighborhood\nThen go to his funeral and turn over his own casket\nThey need to have the police down there\nCause see the niggas is N.A.A.C.P\nNiggas ain't actin' like colored people\nIf I can't work and make it, I steal and take it\nThey come up to me with a nigga who can put air in a bottle and sell it\nHe can do it man\nA nigga can sell anything\n\n[Verse 2: Kendrick Lamar]\nAs I watch the sky change colors\nThe rain flooded the neighborhoods of the black brothers\nThe black mothers are stressing, the coroners have covered\nAnother statistic, episodes of a cold summer\nThe street runners got the same legs of Michael Johnson\nThe fast life surpassed life beyond the conscience\nProfanity in the air, the children use the content\nThe vanity's in the air, that Louis bag: haunted\nThe black girl with the hair, that's kind of coarse\nHer baby daddy's in court, she smoking on a Newport\nSeventeen with dreams of becoming a stripper\nOr becoming an AIDS victim while touching them zippers\nThe life that we living in, things we would do just to live again\nHow can an angel forever live in sin?\n\n[Hook] x4\n\n[Outro]\nYou know, anybody that uses somebody else to gain is pimpin'\nWell, I tell you what soul brother, lookie here\nCan't nobody pimp you but your pimp ass self\nYou understand?\nThen there's a lot of funky things in this country\nAnd there's a lot of good things too\nBut there's more funky than good\nShit ain't gettin' better\nWe've changed some for the best\nAwful lot of cases for the worst\nAnd some, they have not changed at all"}], "artist": "BJ the Chicago Kid"}