{"artist": "Vakill", "songs": [{"title": "Acts of Vengeance", "year": null, "lyrics": "A pastor for 16 years in the hood\nKnown for steering all my troubled peers to the good\nMade sure God's word appeared understood\nSo those that didn't believe that he worked wonders - could\nFamily of five - livin' wife, one boy, two girls\nSpiritually guided through this new world's few perils\nCommunity activist, summer camps, youth centres\nBible class to help us find the God and the truth in us\nShield us from the true sinners that corrupted the block\nSo dreams of kids wouldn't be interrupted and blocked\nWhen a homeless sought shelter in a dead-ended search\nHe'd take him in, feed him, let him rest his head in the church\nA neighbourhood cornerstone that made his presence felt\nNever took credit, always said God's blessings helped\n\"I'm just the instrument\", he'd say; \"God's the musician\"\nHe'd help of bringing dreams of finding jobs to fruition\nThen a six-year-old girl was killed in a crossfire\nBlock got hot, made the price of the coke go higher\nThe pastor took action, waged a war on drugs\nWith vows to clean up the hood, that he swore on blood\nThree days a week, the hood is led by this prophet marchin'\nDope man's pissed because it's affecting his profit margin\nNow all this heat got the dope game forced in a drought\nCause the pastor got squad cars, and reinforcements out\nAnd the thugs ain't feelin' his influence on the community\nSo they wait one Sunday to seize for an opportunity\nThe pastor's at church, second service, from noon to three\nUnsuspecting the acts of vengeance that are soon to be\nWhile he's giving sermon, the thugs is teaching a lesson\nSo all the anti-drug shit that he preach is in question\nPoured four gallons of gasoline on his estate\nThank God no one's home, if so they wouldn't've escaped\nCause killin' wasn't the purpose\nJust to make the good pastor nervous\nBut the kids attended the mornin' service\nSo he let them stay home and put the oldest in charge\nThey were burned beyond recognition, smoldered and charred\nWhen the pastor found out, his heart got colder and hard\nBut you vowed to be a soldier to God\nAnd those innocent children, didn't have a chance to escape once\nAnd did I mention that the youngest of the three was eight months?\n\nWHAT WOULD YOU DO?\nCause murder, your soul can't afford\nWHAT WOULD YOU DO?\nRemember, you a man of the lord\nWHAT WOULD YOU DO?\nGod said revenge is his alone, so only he's allowed to place his hands on\nThe sword\nWHAT WOULD YOU DO?\nJust accept it, and grieve inside?\nWHAT WOULD YOU DO?\nThrow away your reliefs in mind?\nWHAT WOULD YOU DO?\nWOULD YOU RATHER LEAVE IT UP TO GOD? OR LOAD UP TECHS AND NINES AND EVEN UP\nTHE ODDS?\n\nI got a nine on the left...\nTech on the right...\nSo I guess I'm ready to ride...\nFrom now on NO MERCY\nWe all gotta die, but you first G\n\nI got a nine on the left...\nTech on the right...\nSo I guess I'm ready to ride...\nFrom now on NO MERCY\nWe all gotta die, but you first G", "album": "Worst Fears Confirmed", "image": "https://images.genius.com/c889b12ec78f38ef02a2008434b6f21d.967x968x1.jpg"}]}