{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/42281596b18a280da263b6c5dbe8f23e.540x540x1.jpg", "year": "2013-03-14", "album": "Trunk Muzik Returns", "lyrics": "[Intro]\nFame fame fame\nFame fame fame\nFame fame fame\nFame fame fame\nFame fame fame\nFame fame fame\n\n[Verse 1]\nRunnin' like a fool, I got a new demo-tape\nHeaded to a label on a low-key dope race\nGotta be on time, gotta go do show - faced\nCan't be late, gotta go photo take\nManager want me to do a song for the whole place\nWithout a microphone, DJ, and no stage\nSo I put my pride inside my pocket to hold safe\nKnowin' inside of my heart these people are so fake\nPictures of New York, skyliners are back-dropped\n23 floors up down lookin' at cab tops\nI’m so fucking nervous, that I can’t even act not\nThinkin jumpin' out this window ain’t such a bad drop\nSmackin' the blacktop, cuz I’m not a have-a-lot\nI’m just a have-not\nIs it my time? And am I lookin' at that watch?\nIt could be the end of it all, maybe my last shot\nBut I got a funny feeling it ain’t right\nI tell my manager, but he just thinkin it’s stage-fright\nMinus the fuckin sweat that’s drippin off of my face\nI realize if I do it, then it’s only for a price\nSo am I lookin' at a hook wit the bait, bite?\nAm I the big catch? A dinner for late night?\nDo they realize I’m in terrible shape, right?\nCan’t even afford to get my little boy a bike\nI sit down in front of LA Reid\nThe president of Def Jam, the boss before me\nAnd to my left is KP and 30 of A&R's who work for him\nHe said Yelawolf is an emcee from Alabama\nYelawolf you can have the floor and\nI told him if you wanna see me sing\nCome catch me tourin' but I ain’t performin' for the fame\n\n[Interlude]\nAnd just like that (Fame fame fame)\nI lost a deal with Def Jam (Fame fame fame)\nAnd I went home on Christmas broke\nI didn’t know what the fuck to do man (Fame fame fame)\nShit (Fame fame fame)\n\n[Hook 1]\nMoney comes and goes just like the fallin' rain\nBetter leave a bucket outside and collect the change\nSomeday we’ll look back and think what have we gained?\nAnd I hope we can say\nMore than fame\n\n[Verse 2]\nWhat’s the use in complaining about the decision I made?\nIf it’s rainin' (Then it's rainin')\nThen fuck it, pull the umbrella out, hey that’s entertainment (Entertainment)\nI’m above it and focused\nGot a lot of shows I gotta go hit\nIn the back of my mind I’m thinkin, \"Did I blow it?\" (Did ya blow it?)\nDid you notice all the people you roll with\nAre losing their focus because of my ego (My people)\n‘Cause I’m hopeless, won’t listen to nobody\nThey sit and go on about how I won’t make it (You won't make it)\nIf I keep fuckin' up relationships with executive folks\nWith these checks to cut for deals, I’ll be broke then\nStuck in the south with nothing but my old shit\nAin't no new whips, new house, new clothes\nNew dough, you know you gotta go face it\nLook who in the eyes, say I’m sorry for fucking up\nThese rappers are coming up\nWhat you gonna do about it?\nJust sit back and watch 'em and get up\nAnd make a move about it, be about it\nSee it’s about the way you committed, now you got to go-and-get it\nI got a question\nAre you strong enough? Answer:\n\"Fuck yeah!\"\nI ain’t about to be another white-boy stuck here\nHit the road, do any fuckin' show that I could get overseas, let's go!\nCanada, let’s go\nSouth by South-West\nYelawolf Expo, killed that\nMade it my\nFocus, let’s roll\nNow every label and their mamma tryin' to get a hold\nNone of 'em had me, and here come Interscope\n\n[Interlude]\nYea\nThen I got a deal\nYou know?\nI don’t know\nI guess integrity goes a long way man\nGotta know when to hold 'em, know when to fold 'em\nShady Records\nSlumerican\n\n[Hook 2]\nJust give me some place that I can hang\nSomewhere way back in the back to drink a drink\nYou ain’t gotta tell me that I ain’t the same, I'm sayin'\nI’ve seen some things\nPeople change\n\n[Hook 1]\nMoney comes and goes just like the fallin' rain\nBetter leave a bucket outside and collect the change\nSomeday we’ll look back and think what have we gained?\nAnd I hope we can say\nMore than fame", "title": "Fame"}]}