{"songs": [{"year": "2019-07-26", "image": "https://images.genius.com/2b0d9b37a19b6bc28133440f033f2fb4.1000x1000x1.png", "title": "Playa’s Ball", "album": "1123", "lyrics": "[Intro]\nHow y'all feelin' tonight?\nI said, \"How y'all feelin' tonight?\" (Alright)\nWell ladies if you in the buildin'\nAnd you sexy and you got that feelin'\nLet me hear ya say \"ah-ah\" (Ah-ah)\nSay \"ah-ah\" (Ah-ah)\nAnd all my dogs in the buildin', playas if you fuck with\nHustlers [?] that make that cash\nSay \"hell yeah\" (Hell yeah)\nSay \"hell yeah\" (Hell yeah)\n\n[Verse 1: BJ the Chicago Kid]\nOh, baby (Baby)\nI been chillin' right here all night long (Woo-ooh)\nIt's just crazy that the baddest woman came along (And girl)\nI bet you could change the weather\nBetter yet my life, if ya hold me baby (Hold me baby)\nSweeter than honey (Honey)\nYou can have it all even my money (Even my money baby)\nGot all my dogs laughin' 'cause it's funny\nI'm such a fool for you\nYeah all of this and I don't even know her name\n\n(Boom, tch, ka, tch, b-boom, boom\nKa, boom, boom, tch, ka, tch, b-boom\nBoom, ka, boom, boom, tch, ka, tch\nB-boom, boom, ka, boom, boom)\n\n[Verse 2: BJ the Chicago Kid]\nI see it makes you smile when I call you baby (Baby)\nI hope I can see that smile every day (Ooh-ooh)\nAnd I walked over here because they asked \"Who?\"\nAnd I said \"you\"\nYeah all of this and I don't even know your name (Your name)\nI guess that's what I'll call you just for now (Just for now)\nAnd baby 'fore you leave please take a bow\nYes, you, ohh\nAs I walk you out baby can I know your name?\n\n[Verse 3: Rick Ross]\nTime is of the essence, diamonds in your presence\nWant you to myself, would you consider that is selfish?\nOkay, well then cool\nThat just been the mood\nYou know that certain feelin' when they drop you off at school\nYou loco with your homies, cyphers in the hall\nYour first nickel bag, you be caught up in the fall\nJordans on the park, rodents wanna rob\nHoes wanna link up, but your cellphone need a charge\nHow do we connect other than the internet?\nShe brought her homie with her, how she know I'm into that?\nThat's such a perfect guest, this a hustler's tournament\nThe road to the riches, bitches ain't no turnin' back (Yo)\nMaybach Music\nThe biggest boss, Young Renzel\nBJ The Chicago Kid\nAKA The Windy City\nBitch better catch this breeze\nM-I-yayo, cocaine cowboy\nYoung Renzel, AKA the biggest boss"}], "artist": "BJ the Chicago Kid"}