{"songs": [{"lyrics": "[Slug]\nBurn it down...\nPad the circles 'round your life\nTo capture all the sides you sight\nMagic tricks where skeptics sink\nThe ice is thin, stay off the lake\nWaiting for a clock to punch\nWish I could breathe and stop for lunch\nIf I stop to count the leaves on only one of these here trees\nNot sure that I know what's pure\nBorn to kill the insecure\nSome respect, some resent, some remain from start to end\nWear my heart on my short sleeves\nI'm stuck out here, I lost my keys\nFrom the roof I watch the street\nAnd pray for those that's caught beneath\n\n[Hook--Slug and Aesop] 2x\nAs long as I know right from wrong\nI'll be ok, I'll sing my songs\n\n[Slug]\nI dunno what I have left\nTo give other than truth and breath\nAngel when she shuts her eyes\nLike we will leave to my demise\nBetween my time is short\nAbout to start my last resort\nWake me up when it's time to make babies\nTalkin planet earthquakes\nTied the laces, touch the ground\nLet emotions ruptured now\nAs long as I know right from wrong, I'll be ok I'll sing my songs\n\nChorus 4x\n\n[Aesop Rock]\nI wanna lift every yellowbrick\nI've never felt pressure to have to justify my selfishness\nAt least not to you and yours\nMaybe just my friends and fellowships\nAs long as the mood is somehow linked to my enhanced development\nI swear they'll understand!!!\nThere's a storm outside my tenement\nBeats upon my windows with Mother Nature's adrenaline\nI guess that's why my homie Blockhead stays glued to the television\nNow I look less intelligent\nCuz I'm the one that tried to bear the elements and lost\nWell it's warm by the filament\nHuddled up close in the company of all my relatives\nStories, laughs, black coffee and honest-to-God sentiment\nCocooned inside the unified efforts to all get settled in\nAway from where the rain pours!\nWell count your delegates\nWeed out the bums who practice migration other than elegant\nOf course I realize the filtering procedure's delicate\nBut let devils inside to collide with your overzealousness\nAnd fall to rock bottom\nSpot 'em with their carelessness\nThe urge could burst to turn even those pacifist to militant\nYou can't even have half of free second\nTo become jealous in\nYou gotta aim, fire and aspire to be model veteran\nBuried in merit badges\nI'm stuck in the center and could care less\nAbout the eye of the storm and its monstrous measurements\nI got a defense that I call coolin' with my brethren\nSometimes I get wet\nBut it's better than risking life and limb to me, don't you agree?\n\nChorus 4x\n\n[Aesop Rock] *repeat to fade*\nIf you wanna push\nThen I'm ready to push\nBut if you pulling while I'm pushin'\nThen why did you ask me to push?", "title": "I’ll Be OK", "album": "Float", "image": "https://i.genius.com/097177ea52f6ad0147914b68157107a588f47fb2?url=http%3A%2F%2Fwww.mushrecords.com%2Falbum_art_front%2FMH202_D.jpg", "year": "2000-09-05"}], "artist": "Aesop Rock"}