{"artist": "AZ", "songs": [{"title": "AZ’s Chillin", "image": "https://images.genius.com/f7164c7711f98cbf75acb3b0f523d851.744x728x1.jpg", "album": "A.W.O.L.", "lyrics": "Aight I'm waitin on you..\n\n[AZ]\nAZ's chillin, Brooklyn's chillin\nWhat mo' can I say? Why catch feelings\nUsed to hide the crack in the hotel ceilings\nBut that was way back when I was wholesale fillers\nWe made a killing off our little bity buildings\nBut really them lil' gun silly niggas still illin\nClip is chillin, chips to the ceiling\nShot in ninety-six June this wound still healing\nThat's right, this three-wheeling got it good\nAnd if you never had it locked in your own hood you should\nStop frontin, and lookin hard\n'Fore the gym star sneeze, leave your face scarred it's\nNo more bosses, girls think that I'm god I'm a\nYoung full artist either eat or you starvin\nEither beef or you barred, the finger either the yard\nI'm sittin peepin my odds before seekin peace in the Mars but\nStill do me cause it's easy to do\nSo the fly CEO, I ain't easy to chew\nAnd that's how it is, you can ask Blitz\nJail, for more than aggravated assault\nWild Style took it to trial said it's all his fault\n\nAZ's chillin, Brooklyn's chillin\nWhat mo' can I say? Why catch feelings\nMy cons-tributions to this jam\nIs confusing because I am...\n... low key and y'all know the deal\nAnd when you real then you real no need to ice grill\nYES, I'm nice still, YES, my mic skills\nIs so ill for real give myself slight chills\nAnd I get money, money I got\nBig bottles of Belve keep the bloodflow hot\nBone's up in queen, wood in the feds\nWild born and barred niggas hold your head\nCause I'm still here, hustle with no fear\nThe muscle is still here that love be still sheer\nI dare, a muh'fucker pull my card\nI got more than a great big bodyguard\nSo press up if you wanna get served\nI survived in the hood, now I'm all in the burbs\nWith the bass on thump, suitcase in the trunk\nProbably UV with the tooly lettin Akon pump\n\nAZ's chillin, Brooklyn's chillin\nWhat mo' can I say? Why catch feelings\nHow long can I lay to touch millions\n'fore that AK spray or sprays on civilians\nI'm five for five, I'm rated R\nI'm gifted, and I'm goin far\nDown the ave, to the spot\nFour dubs of 'dro that's all I copped\nNo mo' but chammy that's all I pop\nSo solo with the fam that we all we got\nHate for what, I live that life\nI done drove every car, I did that ice\nDone touched a few broads, some hid they wife\nI was too large to dodge, had to deal my life\nI kept it fair, I played the game\nNow it's time for the whole world to know my name\n\nAZ's chillin, Brooklyn's chillin\nWhat mo' can I say? Why catch feelings\nJust do the dance that's easy to do\nLean back or that two-step, what's easy for you\nThis jam is on and on and on\nGuaranteed airplay 'til your breath is gone!\n\nI get the money so I don't care, I do-I don't care, I do-I don't care\nNew York get that money so I don't care, get the-get the money so I don't care\nCali get that money so I don't care, I do-I don't care, I don't care\nMiami get that money so I don't care, get the-get the money so I don't care\nDetroit get that money so I don't care, I don't care, I do-I don't care\nChi-Town get that money so I don't care, I don't care, I do-I don't care\nAtlanta get that money so I don't care, get the-get the money so I don't care", "year": "2005-09-06"}]}