{"artist": "Pimp C", "songs": [{"album": "The Sweet James Jones Stories", "title": "I’m a Hustler", "image": "https://images.genius.com/d5984a79c276e0748a892e587a93e941.772x768x1.jpg", "lyrics": "[Intro: Pimp C]\nI stay paid and I like blades\nOld school cars and loving Maze\nI've got hoes (I've got hoes), I do shows\nGetting money a-, riding Rolls (riding Rolls)\nKeep my grind I don't, waste my time\nComing up, getting down for mines\n\n[Hook: Pimp C]\nI'm a hustler baby, and I gots to have it\nI'm a hustler baby, and I gots to grab it\n\n[Verse 1: Pimp C]\nDeep up in the game, ain't no stopping\nI get my money like Johnny Guitar Watson\nPimping them hoes and put the bitch on the track\nAnd tell the ho to bring all my money back\nI want to holler at that boy Ike Turner\nYou gotta know it's 'bout the paper and you learn her\nAbout getting on the corner for your daddy\nWhat love got to do with it, I'm in the Caddy\nI got a yellow-ass ho that'll suck you up\nThat'll blow in your butt ain't scared to fuck\nAnd she'll bend over, take it like a G\nBecause you know the bitch down with Pimp C\nI switched my name to Jack Tripper\nNow the hoes trying to pull down my fucking zipper\nAnd get to that snake with the cobra head\nI got some homeboys doing life in the fed\n\n[Hook: Pimp C]\nI'm a hustler baby, and I gots to have it\nI'm a hustler baby, and I gots to grab it\n\nSee me on the slab, whipping in the Nav'\nYou already know I'm cooking in the lab x2\n\n[Verse 2: Pimp C]\nWhen I was young, all I wanted was a 'lac\nI used to think them niggas was fiends that was blowing on the weed sack\nCause all I did was cut up cheese\nAnd sell dope and come through with the thang with ease\nI used to have a .25 pistol\nBut now I got some shit that shoot like a missile\nI tuck a AK, HK too bitch\nI'll hit you up, I ain't going for that ho shit\nThem other niggas playing games in the streets\nYou think it's 'bout being lame and making lame beats\nWe ain't 'bout you and them beats niggas\nCause fuck boys, could easily get hit with the trigger\nYou think you rich?\nBut you a bitch\nYou see me in the club check my pitch\nI'm down with J. Prince bitch, and you know that\nWhen we come through splitting bitch niggas hats\n\n[Hook: Pimp C]\n\n[Verse 3: Pimp C]\nTold you before I'm a country star\nIn a country car\nGot a country ass bitch, sip country barre\nGot a country son, got a country chain\nComing down in the car, and gripping country grain\n\n[Outro: Pimp C]\nSweet Jones bitch, Pimp (peeeimp) knahmtalkinbout?\nGo out and get that shit\nI'm talking 'bout doing a million records independently sold, on your bitch ass\nSo when you see me in the city recognize I'm already paid\nWhen you see me chopping on blades, don't rob us bitch\nNot them phony-ass blades with no knockers on 'em\nRepresenting that south, P.A. to be exact\nAnd ain't no gang in P.A bitch-ass nigga\nAin't no blood and no Crip, fuck-ass nigga I'm Texas\nI told ya, bitch", "year": "2005-03-02"}]}