{"artist": "Ice-T", "songs": [{"title": "Dog ‘N’ The Wax", "lyrics": "[Intro: Ice-T]\nSuckers step back, reacting his attack\nEvil E's in the place, cold doggin' the wax!\n\n[Dave Storrs]\nWORD!! WORD!!\n\n[Verse 1: Ice-T]\nAll punks grab for your mothers, today's the day\nI'm here to say warriors come out and play\nRhyme for your lives, weak run and hide\nMy name is Ice-T, L.A.'s where I reside\nFly as a bird, also awesome with herb\nIf you bite I will take your life best believe that's word\nFBI's most wanted, but them suckers can't stop me\nMean rapping mother, terrorizing Qaddafi\nFew tried to match the def raps I wrote\nDis my rhyme that's the time, razor meets your throat\nBorn in New Jersey but raised in L.A\nStreets just as hard and the player's still play\nFar from a fag, getting paid for my brag\nSo if you wanna come and battle bring a body bag\nDefinitely deadly and that ain't no jive\nAnd if you don't like what I'm saying, we can take it outside\n'Cause ain't nothin' like a squabble 'cause you know I'ms fine\nAnd if knife be your reason, then Uzi be mine\nSo all punks get ill cause you know I'm gonna\nRhymes that ignite bite like a piranha\nIce-T's just rockin' the tracks\nAnd Evil E's in the place, just doggin' the wax!\n\n[Chorus: DJ Flash scratches quotes below]\n\n[Verse 2: Ice-T]\nI love the ladies who were down with the T\nBut what I hate and I state is a fool MC\nYou wanna battle the Ice, you gotta be insane\nOne step toward my reppin', I inflict the pain\nGot so many raps, I got no place to store 'em\nGot so many damn pages, I can wallpaper the Forum\nAssassination, is my solution\nNo light operation, just massive contusions\nDef dealing rhymer with a lust for blood\nConflict with the master and your name is mud\nKick it up, no mercy for the fact you're brave\nI'll just bury your butt, then I'll spit on your grave\nLaugh at your family as they stand and cry\nCold smack your mother all in the eye\n'Cause I'll never get to heaven but you know damn well\nI'll wear Bermuda shorts while I'm maxin' in hell\nSo all suckers step back, reacting the death's attack\nDon't try to write me off, just talking like way smack\nBecause I'll leave a shamble, I hustle don't gamble\nAnd I'll rock your butt blind like HBO scramble\nDoggin' the wax!\n\n\"Warning. The surgeon general of Chilltown, New York has determined that the sounds you're about to hear, can be devastating to your ear\"\n\n[Verse 3: Ice-T]\nSharp as a razor, down as dirt\nRhyme is my life, party is my work\nL.A. is my place, More Righteous is my base\nSo my lyrics make sense, no words I waste\nDown for a duel, colder than Kool\nChill with the brothers who built the old school\nRhyme like a rocket, smooths in the pocket\nProgram the 808 and just lock it\nCrash the studio with my crew, twenty four tracks mixed down to two\nJam hits the stores, packed kinds of floors\nFreaks in my hotel room by the scores\nThis MC Ice-T, I rock the freaks to ecstasy\nTake them to the T-O-P and bust them out officially\nNever off, always on, rockin' to the break of dawn\nLike this, like that, an MC that's not the whack\nAll rappers in the game, recognize my name\nThey write off as been lame, or get me credit for my fame\nI'm here to make it clear, '86 is my year\nI'm the rapper you should fear and I'll have to peer\nSupreme MC Chief, and when I die in my belief\nBattle from L.A. to Rome, rock beyond the Thunderdome\nSound hard, know why? It is, don't try\nOnly the top MCs will master this ability\nIf you do, you'll find out what that misword [?]\nOr run that other [?], for high speed poetry\nTake advice from Ice-T, leave the cuts to Evil E\nGet a girl, feel the bass, rock her at this funky pace, ah!\n\n[Break: DJ Flash displaying Old School turntablizm skills]\n\n[Verse 4: Ice-T]\nI'm dialing M, for murdering fine MC's heads\nShowing no remorse, reanimatin' the dead\nKicking dirt in the wombs, turning a wheel in the rap\nI'll make you run for the hills with a streak up your back\nMy rhymes are my pigeons, stock cooler than cold\nBoys always convincing, jewelry solid gold\nMagnified finesse, a Hollywood address\nThe perpetrator, cremator, representing the West\nAvenge is my best friend, homicide is my life\nI write my rhymes in my book with blood on the knife\nNever been beaten in life, never planned to beat\nEither rocked two days straight before I take a breath\nThe rhymes, memorize them like inside my head\nAnd anyone who dared bite somehow ends up dead\nGot a license to kill, dogs refusing to chill\nUncut violence is my true thrill\nI'm a hitman kinda sort of, suckers talk in manure\nWith co-cold man known tactics, no man can endure\nNot to be mistaken, when MCs fakin'\nAll contracts issued, to Ice-T are taken, with the multitude routes\nYou have no chance to shout\nWith the silencer of a ninja, your lights are out\nGirls cry to sight, some in Latin fight\nFor the post positions at my jam each night\nThe player from L.A., cooler than any Jay!\nMy name is Ice-T, I make the mafia pay!\nDoggin' the wax!\n\n[Outro: DJ Flash]\nNot bad y'all!\nNot bad at all!", "image": "https://images.genius.com/df4557e49373e2fa2965c8b6d8afb990.600x592x1.jpg", "album": "The Classic Collection", "year": null}]}