{"songs": [{"title": "Adam lives in theory - live", "album": null, "year": null, "image": "https://images.genius.com/4fff53f85a4f6704ecb471ac0c617cfe.446x446x1.jpg", "lyrics": "Adam lives in theory tryin' to turn stone into bread\nMasquerading like he's got it figured out\nCut off from the sunshine, only smart in his own head\nLeaving his descendants to hope and doubt\nLeft to his devices, those worthless sacrifices\nPraying to the altar of his self\nMaking pilgrimages thinking he's religious\nLike he's got all the light, and no one else\nHe takes the unsuspected\n'Cuz he knows they're not connected\nAnd he shows them how to be just as he is, virtually real\nAnd commercially appeal, to the lust of all the people where he lives\nEve was so naive, blinded by the pride and greed\nWanting to be intellectual\nDrifting from the way, she got turned down one day\nAnd now she thinks that she's bisexual\nCaught up in emotion, burning up in her devotion\nTo the king of exploitation in the field\nShe handed him her virtue, 'cuz he told, \"I won't hurt you\"\nSo she lay with him to see how good it feels\nNow can you tell me, what, what we gonna do now?\nWhere we gonna go now? What we gonna say now?\nNow can you tell me, what, what we gonna do now?\nWhere we gonna go now? What we gonna say now?\nNow after the sensation, and the empty fornication\nShe brought infection home into her bed\nQuickly multiplying, now the three of them are dyin'\nBy the poison she perceived to be good\nNow Eve and her husband, are perverted in their judgment\n'Cuz everything appeared to be the same\nThey entertain suggestions, next time just use protection\nDesiring to cover up their shame\nBut much to their demise, poor decision closed their eyes\nTo the very antidote of their dilemma\nBurning in their lust, both of them adulterous\nDestroying the original agenda\nPraying to the sky, in order to maintain a lie\nThey exhausted every possible conclusion\nThey can't even entertain, or the solution in a brain\nOr filled with vain, information and pollution\nHiding from the truth, he provided an excuse\nTo explain away his desperate situation\nWhen confronted, blamed his wife, giving birth to carnal life\nRefusing to acknowledge what he'd done\nAnd now, if we can agree with who created us to be\nWho says we're guilty, everyone before His eyes\nMaking no exceptions, since the day of our conception\nPredisposed to hating truth, and loving lies\nThen can you tell me, what, what we gonna do now?\nWhere we gonna go now? What we gonna say now?\nNow can you tell me, what, what we gonna do now?\nWhere we gonna go now? What we gonna say now?\nStop walking in pride, let the thief be crucified\nUnlearn everything you know and let Him teach you\nLine upon line, and precept upon precept\nSay goodbye to this decaying social system\nHe wants to know, how far we're willing to go?\nIf we love Him like we say we do, He'll try us\nJust you don't regress, or slip into hopelessness\nOnce He's satisfied, His love, He won't deny us\nAnd then He'll tell us what, what we gonna do now\nWhere we gonna go now, what we gonna say now\nAnd then He'll tell us, what, what we gonna do now\nWhere we gonna go now, what we gonna say now\nI'm telling you, telling you, I'm telling you\nI'm telling you, I'm telling you, I'm telling you\nHe's gonna tell us, tell us, tell us\nOoh! Yeah"}], "artist": "Lauryn Hill"}