{"artist": "Fat Joe", "songs": [{"year": "2013-05-23", "album": null, "image": "https://images.genius.com/9dbf643e1ad32ccb4975870b7d47bddb.400x400x1.jpg", "lyrics": "[Intro: Future]\nIt ain't about this ice around my mu'fuckin neck\nAnd Givenchy and Versace and shit, you kno what I'm sayin'?\nI gonna run out of time with you\n\n[Hook: Future]\nWith money and the fame and the women\nWith the luxury cars and the all the spending\nCan you love me? (Can you love me? 3x)\nCan you love me? (can you love me?)\nLove me long time (Long Time, Long Time)\nLove me long time (Long Time, Long Time)\nCan you love me? (Can you love me? 3x)\nCan you love me? (Can you love me)\nLove me long time\n\n[Fat Joe]\nYeah, uh..\nPapi love you long time, girl\nSmoking on Jamaican, that's that uptown girl\nGave you keys to that drop (drop), hundred G's it's a shot (shot)\nBal harbor, to the harbor, diving off of them yachts\nBody look like a stallion, girl, hit the gym and coast fiending\nUsed to go with just window shop, couldn't even go send it\nGot too used to that winning (winning), I got used to them women\nNow you beef, stay at least, never dreamed to this ending\n\n[Hook: Future]\n\n[Fat Joe]\nYou said you'd love me long time girl\nBut now you say I call you at the wrong time, girl\nOh you acting different (different), what you out here slipping (slipping)\nRun the streets with these enemies and make me no difference\nShow me that catalogue, to hermans I cope that\nThey said it only come in hard top, I drop that\nMama said you don't love me (love me), shit about to get ugly\nWould you love me and fuck me, if I wasn't getting this money\n\n[Future]\nIf I ain't have that theory, five karat earrings\nGirl would you love me for me?\nWhen that money get low you started tripping\nNow you walking out the door and you flipping\nEven my mama said you wasn't gon' love me\nFrom the beginning\nCause I was winning\nI didn't listen\n\nCan you love me for me?\nCan you love me for me? (Can you love me? 6x)\nLove me long time, love me long time 2x\nCan you love me? (Can you love me? 3x)\nIf you love me (can you love me)\nLove me long time\nLove me all the time\nLove me all the time\nIf you love me\n\n[Hook: Future]", "title": "Love Me Long Time"}]}