{"songs": [{"image": "https://images.genius.com/22859e4e6406784457e93f212f910d36.1000x1000x1.jpg", "year": "2018-09-28", "lyrics": "[Verse 1: Tuka]\nYou called me today, you told me you were gonna die\n(Father, father, father)\nWhat was I gonna say? Sorry, I don’t wanna lie\n(My father, father, father)\nYou remind me of this old folk song that got passed around\nYou used to sing it\nI bet the songs that you sang inside of that pub\nDidn’t just pay for your dinner\nParty like an animal\nIt was a party with the animals\n\n[Verse 2: Tuka]\nSink a lot of liquor, kiss a lot of women\nHow many could you pick up? My money’s six\nSittin' pretty in the middle of a letter\nMum said you’re the reason I stutter\nOne day she got sick again, it hit her\nYou could have had it all\nInstead, she had enough\n\n[Chorus: alt-J]\nThere is a house in New Orleans\nThey call the Rising Sun\nAnd it's been the ruin of many a poor soul\nAnd, Lord, my father's one\n\n[Verse 3: Tuka]\nWith me and my sister, we had to leave behind mister\nMy mother was a high planes drifter, she said I could ride with her\nWe started again as a party of three with our heart on our sleeves\nShe asked for redemption, in need of a friend\nHe was charming I guess, but history repeats\nPardon the cliché, it was hard to believe\nI can’t pretend like you, he was no father to me\nMotherfucker was an animal\nWants to party with the animals\n\n[Verse 4: Tuka]\nStrum a guitar, in our house of the rising sun\nYou beat my mother in our madhouse of the rising sun\nDrunk on Monday, was his father’s son\nIn the background singing, this is the song he sung\n\n[Chorus: alt-J]\nThere is a house in New Orleans\nThey call the Rising Sun\nAnd it's been the ruin of many a poor soul\nAnd, Lord, my father's one\n\n[Spoken Outro]\n[?], it was in me repertoire for quite a little while, oh, for years\nAnd then I’ve gotta bring the how I could do it in such a way\nWith little finger picks on a twelve-string guitar, strung six strings\nSo, I had this huge guitar, really big guitar\nWith a big lot of noise in it\nAnd I’d do \"The House of the Rising Sun\"\nBut you had to wait 'til you had enough drunks around\nCan you understand that?\nLike, you must have got, you wait until you've got enough drunks And you’d go, \"Right\" and sing \"The House of the Rising Sun\"\nAnd they’d be singing away and carrying on\nAnd throwing money in the box\nIt was a good one", "title": "House of the Rising Sun (Tuka Version)", "album": "REDUXER"}], "artist": "​​alt-J"}