{"artist": "Wale", "songs": [{"title": "Barry Sanders", "year": null, "lyrics": "[Intro: Paid in Full scene]\nTryna stay up out the light\nUp out the spotlight\nThe club\nAnd all that kinda stuff man\nTryna hide, tryna ignore\nBut its all fake\nUnderstand what I’m sayin?\nThis life...\nThis game...\nThere ain’t no lovin it it don’t love you back\nI feel your hate… I do man\nBut see man\nA nigga like me man\nI love the game\nI love the hustle\nBe feelin like one of them ball playin niggas you know\nLike Bird, Magic or somethin\nYeah you know a nigga got dough, a nigga could lead the league\nBut if I leave…\nThe fans still gon love me man?\n\n[Verse 1]\nI need your admiration for infinity\nNot that this ain't lucrative, but I just need your energy\nI got the passion to please, I will not gasp or fatigue\nAnd the way I'm ballin, gimme a Grammy or Danny O'B\nStanding OV, let these bitches follow me\nAnd I just give them D, give them D like they is out the league\nHasheem Thabeet and various other peoples\nThe pressures of greatness always comes with critiquing\nNewest of sneakers, you consuming the bleachers\nBlewin' some reefer in my zone like a 2-3 defense\nDouble-M G up, we up, y'all just relax\nSee uh, all my females show bust, Curtis Enis\nNittany Lion, my Penn State it, niggas recite it\nI'm Michael Jordan major, you niggas Harold Miner\nPussy be all on me, we too young for romancin'\nMy niggas never block, I think I'm Barry Sanders\n\n[Verse 2]\nVic Page never made it, Len Bias never made it\nSee God gave us the talent, but the devil make us famous\nMy effort is contagious, so check this BOA shit\nWith this recording I'm as sick as Jordan before Game 6\nJazz talkin, I bet I pick and roll with your bitch\nYou got some paper for me? Hit me on the Hornacek\nWalter Payton Mercedez, sweetness in every ride\nHold on my pupils slowing, I don't got no lazy eye\nKicking flows, pockets about as thick as strippers on poles\nZone blocking with these bitches, I'm just picking a hole\nPardon that jargon but since I'm balling they getting salty\nThey all catching feelings, I should Biletnikoff 'em\nThem niggas talking, they like man he official\nMan, you Olowokandi I'm just being Pacific\nI'm just bein' prolific, right now don't need no Mrs\nI got a rack of Trojans, no ring, my Lane Kiffin\nI'm tryin' pimp em I'm trying to be that cool\nAll them bitches Converse with me off that React Juice\nNow Jordan III my shoe, Double M G my crew\nWhen you do it big as Manute you make it seem minute\nRicky Moore Flightposite, Mike Bibby blue Foams\nInterscope feeling like Charlotte when they traded Kobe you know?\nBut I let it go, Rozay finna re-up\nHe got himself a Kobe and they stuck with Vlade Divac\nAnd we no la de de da I don't care for any people\nShallow bitches go Hail Mary when I throw that D-Route\nHa, now keep out, me and my whole team out\nAnd I'm as high as Deion feet is headed to the house", "album": "The Eleven One Eleven Theory", "image": "https://images.genius.com/3deb1db85b83276b4511c8ad1cf1b26f.320x320x1.jpg"}]}