{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/8518dd2d23ac286b62bc5bd0d0d3d6db.1000x1000x1.jpg", "title": "Cross My Heart", "year": null, "album": "Heavy Mental", "lyrics": "[Intro: (child) Killah Priest]\n(One two, one two)\nNo doubt\n(The microphone's on)\nCross my heart, hope to die, word is bond\n(I've been waiting along time for this)\nHere we go, Killah Priest, '97, '98\nY'all know somethin'?\n\n[Verse 1: Killah Priest]\nIt's the Byzantine king, supreme\nAll kneel kiss the ring into a Elohim\nI blow steam from the families of the Maccabees\nSmack emcees, watch 'em scream, \"Your Majesty!\"\nMake 'em suffer the capacity of tragedy\nHold the crowd down like gravity\nBack the fuck off, stop grabbin' me, hands off me\nNiggas start to bore me, I'm gettin' sleepy, I need some coffee\nMe and my Wu-bandits, we bury niggas deep in the canvas\nBody bandage like some mummies\nYou fucking dummies, you can't take nothing from me\nIt's the longest waited, the most anticipated, the album hesitated\nScream the name out, \"Killah Priest!\"\nI leave the blood spilling in the streets\nI'm from the dark hills of Brownsville\nThe seven shields on windmills across the killin' fields\nNever forget it, tell them rap critics\nI speak in arithmetics, so they can never get it\nI'm too scientific, lyrics explicit\nI roll with thirsty niggas, thieves and killers\nTigers, gorillas, faces like Godzilla\nWe stomp rappers that smile like a car dealer\nThe God iller, cross my heart hope to die\nWe multiply, by the hundreds, drunken by the thousand\nSee me outside your show browsin', beating up your soundmen\nPlayer haters and players, we give 'em cold stares\nAny last prayers?\n\n[Verse 2: Inspectah Deck]\nConcrete techniques, bomb beats that cause casualties\nMy faculty, hold it down like gravity\nRapidly threaten like weapons to adolescents\nGhetto residents quick to past tense your present\nState of the slums, kill for a plate of crumbs\nFake ones, they're coarse with smiles and snake tongues\nI'm deep into this,I sometimes gasp for air\nDeadly warfare, hot blocks, cops, and cold stares\nShots blare like fireworks on July the 4th\nWeapons get tossed, fugitive slidin' off\nMy forces combine, new world, 2009\nDigital criminals, we make mills in cybercrime\nIt's all planned ahead 2 times, I see the signs through a great mind\nThe heaviest chains could not bind\n\n[Chorus: Killah Priest]\nWe stare you eye to eye, we tell the truth no lie\nWe cross our heart and hope to die, hope to die\n\n[Verse 3: Genius/GZA]\nHigh ranked officials in armed tanks with missiles\nBlood drizzle, simple fact, you slept on the issue\nThat before you started jerkin' off Joysticks and Sega\nI was rockin' off 100 watt amps in Cerwin-Vega\nTrue fine tune it, ship enough units\nMCs ask, \"Who be those rhyme killers in masks?\"\nNo doubt, difficult task to last in the square\nBeware, infinite amount of darts is in the air\nI'm victorious with no opponents and blast through components\nWith microphonics, watch the whole world live the moment\nAnything anti that came approachin' this\nOur incapable love speech remains motionless\n\n[Chorus: Killah Priest]\nWe stare you eye to eye, we tell the truth no lie\nWe cross our heart and hope to die, hope to die\nWe stare you eye to eye, we tell the truth no lie\nWe cross our heart and hope to die, hope to die\nWe hope to die.."}]}