{"artist": "Cam’ron", "songs": [{"title": "Humphrey", "album": "Federal Reserve", "year": "2014-01-29", "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Produced by A-Trak and Party Supplies]\n\n[Intro]\nAlways tryna doubt a nigga 'round here\nI ain't ever really lost nothin'\nHARLEM!\n\n[Verse 1]\nDame said I'm buggin' cause I wanna fight B-Hop\nI said I'll fuck him up after two months of detox (true)\nTrue, besides that, 8 mil' from Reebok\nI take him to the bar, Pa, that’s 33 shots\nHe tellin' me I need not (what?)\nHe must not remember young Killa that hustled in his weed spot\nWhen he had the black Lex and I boost tree tops\nSomebody talk about him then they woulda got a speed knot\nThis is when me and Hud sorta ran the G spot\nOlder niggas left and we came in with green tops\nListen here, so you got my vision clear\nNever for pro but I made niggas disappear (poof!)\nNiggas know not to fuck with me (word!)\nAnd my record is sucka free\nThis money, I've been makin' it work\nSo A-Trak, let's take 'em to church\nThey don't hear me though!\n\n[Interlude]\nNa'm sayin'?\nI ain't fight my way to the top of the food chain to be a vegetarian\nI'll get my own\nBank is a place still lend you money\nIf you prove you gon' need it, nahmean?\n\n[Verse 2]\nMy parents got high, no lie, it's no shame\nA product of dust, lust, and cocaine\nStill cool with some niggas though, that sniff 'caine\nThat grow weed to grow hair like Rogaine\nHeartless to the core, feel no pain\nThat's models, hood rats, old flames\nBitch niggas, haters, famous, no names\nStreet fighter.. I throw flames\nOn the strip, no strippers\nBut she suckin' the tip, I might tip her\nUnderstood in my hood, that's the way we go\nYou can't comprehend or understand the ratio\nFrom a baby, yo, pop got no money for milk\nThe .380 blow, up-up-away we go\nNo cash to help out your lady, yo\nAnd look out for baby bro\nShould I rob a bank? Tell me somethin', yes, go, maybe, no\nWhat I do next? Get crackhead fellatio\nThey thought I was slow like Radio\nA couple years later, though, they heard me on the radio\n\nWhoa, bro, yo, Killa (..Killa)\nA-Trak, na'm sayin?\nIt's heartfelt\n\n[Outro: A-Trak scratches]\nKilla Cam in the buildin'\nDipset!\nWhat the game been missin'\nSomethin' incredible that's about to take place\nCam got the shit to pop"}]}