{"songs": [{"lyrics": "[Intro: MC Ren]\nNinteen-ninety-mothafucking-one\nN.W.A back in this mothafucker, yo\nTakin' out all you commercialized-ass niggas\nAnd we're on this laid back track\nAnd we're doin' this one kinda smooth\nSo whatcha gonna do, Dre? - Kick it!\n\n[Verse 1: Dr. Dre]\nAnd so on, let the shit flow on\nBecause I need somethin' to go off on\nThe mothafuckin' D-R-E servin' a death wish\nSo I'mma hit you like this\nEarly in the morning, hop into the B-en-z\nI got 44 ways of gettin' paid\nSittin' in my lap as I roll off the Compton blocks\nTo scoop up Ren, I heard shots\n1, 2, 3, then I seen a nigga\nHoppin' the fence and it was Ren on the mothafuckin' trigger\nHe got in the Benz and said\n\"Dre, I was speakin' to yo' bitch O'Shea”\nAnd as we roll on, I seen the patroller creep\nSo we got ghost before they peeped\nMe and Ren in a black CE, yo\nBumpin' some funky shit by the D.O.C\nI gotta get paid, paid in a hurry, see\nI got a have it if I'm not paid thoroughly\nI start takin', makin' sure my shit is steady bumpin'\nA nigga always into somethin'\n\n[Interlude: Admiral Dancehall]\nBa-ba-ba-ba! Fuck the mothafuckin' police cause they push that black man down and they kick him in his mothafuckin' balls. Goddamn police, fuck them! Come down, MC Ren\n\n[Verse 2: MC Ren]\nI heard a dope beat, somebody told me that Buck did it\nBut if Dre didn't do it I can't fuck with it\nN.W.A is like a mix a fix a trix\nReal niggas with big dicks\nYou're takin' a chance when you think that\nTalkin' under your breath won't lead to young death\nFuckin' up shit, ain’t shit but a killin'\nFor a nigga labeled as bein' a mothafuckin' villain\nBut you don't know me, a record can't tell ya\nHow so many prayed I'd be a mothafuckin' failure\nReal niggas gotta have top rankin'\nI hooked up with three more niggas and started makin'\nFunky-ass shit for your system\nMight sound nice so it makes you wanna listen to a\nSample of a ruthless organization\nBut you don't want a confrontation\nReal niggas don't play\nYella, Eazy, me, and the nigga nigga Dre\nYo, always makin' sure that my shit is steady bumpin'\nA nigga always into somethin'\n\n[Interlude: Admiral Dancehall]\nBoom-boom! Look at that bitch walking down the mothafuckin' street\nNow she know the Admiral wanna hold my dick in\nBecause that bitch’s booty is so na-na-na-na-na-na-nasty\n\n[Bridge: Dr. Dre]\nYeah, the world's most dangerous group\nDefinitely in this mothafucka\nSendin' a shout-out to all the bitches out there\nYo, you can get the pick up to suck a dick up 'til you hiccup\nYou know what I'm sayin'\n\n[Verse 3: Dr. Dre]\nYo, cause I'm a nigga for life\nAnd I really don't give a fuck\nI'm goin' for mine, every time\nI see a fuckin' softy, punk strong as coffee\nA nigga like that best to back up off me\nYo, cause these are the days and the times of the real niggas\nFalse niggas, end up as tossed niggas\nAnd that's on the real, cause I'm a nigga that kills\nAgain and again, so tell 'em what's up Ren\n\n[Verse 4: MC Ren]\nIf I'm not into nothin', I don't feel right\nSo I grab the nine and the clip and go and murder mothafuckas at night\nBecause I'm startin' to fiend, from sittin' in a cell\nWhere the crime was too tragic I couldn't make bail\nSo now they gotta hold me\nAnd listen to rehabilitation over and over, sayin' they told me\nBut I don't give a fuck cuz I know my shit is pumpin'\nA nigga always into somethin'\n\n[Outro: Admiral Dancehall]\n1991 and N.W.A get the job done\nAdmiral Dancehall gonna tell a story 'bout a girl that's quick fi lick me dick, it goes something like this....\nDa girl quick fi lickin' me dick, da girl quick fi lickin' me dick\nDa girl quick fi lickin' me dick, she got a dirty habit\nDi gyal fi wicked ah wiley\nGyal fi wicked ah wiley\nWicked ah wicked ah wicked\nAh gyal fi wicked ah wicked\nBecause the Admiral Dance\nI come and announce\nMy name is Admiral D. y’all\nRastafari had to get up on sound ja\nDoctor Dre, a he mon tha masta\nMC Ren even him come kinda fasta\nHere come Yella wit tha wickedy wickedy wax\nWickedy wickedy wax\nW-wickedy wickedy scratch-a\nThat’s why the Admiral\nMe lyrics dem ah taught\nEveryone-a\nNWA is in tha house\nIs in tha house\nIs in tha house-a\nA listen up cu' we in tha house\nCould ya\nUp up\nListen up up\nUh, up up\nJust listen up up\nBecause…\nRem? Dance every lady love me\nCould ya, every lady come and-a run gets me\nBecause me singin' on the NWA album\nThat’s why me singin' up on the NWA album, gal", "album": "Efil4zaggin", "year": "1991-05-28", "title": "Alwayz Into Somethin", "image": "https://images.genius.com/37602298fa2cfd523d52e0b30db2f9e5.829x829x1.png"}], "artist": "N.W.A"}