{"artist": "Watsky", "songs": [{"year": "2016-07-26", "lyrics": "[Verse 1]\nOne day you opened up your eyes inside of you\nInside a world inside a universe you didn’t get to choose\nYou didn’t get to pick the rules or pick the past or set the pace\nOr cast the cast and crew\nYou didn’t get to pick your starting place\nAnd though it was a race you didn’t understand\nYou simply lined up on the blocks and when the pistol popped you ran\nAnd when you tripped and dropped, you picked yourself up off the ground\nAnd picked your scabs and knew you had to pick a plan to end what you began\nAs you got older there were days of cold surrender\nDays of shrugged whatevers folded in with days of shocking splendor\nBut as time advanced, the lovely days were covered up from view\nBy an advancing melancholy haze that hovered near the dew\nYet there were moments\nThere were these pure arresting moments when you stepped outside your head\nOutside your pain, outside control, outside the bullshit, out of body, out of rage\nOutside the need to get it, get it? You will never get it\nThat’s okay\n\n[Chorus]\nHave you felt a little off today\nHad a lot to say\nBut wound up talking to yourself?\nI've been hunting for a kindly ear\nBut couldn’t find one near\nAnd wound up talking to myself\n\n[Verse 2]\nHad a little spot—where you been going through a lot\nWanna shove it to the bottom—but a trouble gonna bubble to the top\nThen the bubble gonna pop—and the hustle never ever gonna stop\n'Cause you get up in the morning get ahead, get to bed and then you do it all again until the moment that you drop\nYou need a plot—what you wanna witness with this life you got?\nYou kicked and fought tryna get up in your skin and pick this lock\nThat ticking clock lets you know that bitch you got these situations witchu\nIssues someone fit to quick should sit you down to talk\nEver wonder who’s the crazy the one—people walking to work as if nothing is off\nBut if a person really got it they would be cracking a bottle on somebody’s head and looting from shops\nAre there times you’re alone knowin' nobody’s home, but you walk around mutterin' under your breath second guessing shit saying, \"Goddammit, goddammit, goddammit,\" just whispering soft\nDo you ever get lost, deep in your thoughts, tripping when you think about the cost of seeing this through?\nWhen you tie your stomach into knots that you don’t know how to undo\nBut do you ever have another moment after that, when you can see\nThere’s no one way this has to be? Or maybe that’s just me\n\n[Chorus]\nHave you felt a little off today\nHad a lot to say\nBut wound up talking to yourself?\nI've been hunting for a kindly ear\nBut couldn’t find one near\nAnd wound up talking to myself\n\n[Outro]\nDada-da-da-da-da\nHow you feeling today?\nDada-da-da-da-da\nHow you feeling today?\nDada-da-da-da-da\nHow you feeling today?\nDada-da-da-da-da\nHow you feeling today?\nDada-da-da-da-da\nHow you feeling today?\nDada-da-da-da-da\nHow you feeling today?\nDada-da-da-da-da\nHow you feeling today?\nDada-da-da-da-da\nHow you feeling today?\nDada-da-da-da-da\nHow you feeling today?", "image": "https://images.genius.com/caf3c17709b04ff24300da4d62da46fa.630x630x1.jpg", "album": "x INFINITY", "title": "Talking to Myself"}]}