{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/f204169148acddc245026e4df021bd2e.399x399x1.jpg", "title": "First Nigga", "year": null, "album": "The Veteran", "lyrics": "[Premier cuts & scratches]\n\"Kool G. Rap is my name\"\n\n[Hook]\nYo, who that first nigga that read about it (\"Kool G. Rap\")\nWho that first nigga that spit about it (\"Kool G. Rap\")\nWhat's that nigga name \"Forget about it!\"\nFirst nigga that read about it (\"Kool G. Rap\")\nWho that first nigga that spit about it\nWhat's that nigga name \"Forget about it!\"\n\n[Verse One]\nYo, who that real Don of that thug shit\nPoppin' slugs shit, cock 'n block shit\nSpit about street, murder and drug shit\nBrought you the facts on twenty tracks on how they mug shit\nTaught you to survive, in these streets you gotta lug shit\nFirst nigga that spit about rocks and shit\nDiamonds and jelly-jars, nigga yeah, proper shit\nEven told you I was pumpin' on the block and shit\nWho the first nigga that told you he would pop ya shit\nWho the first nigga to spit about jail, cells and fiscale\nBail on sit-L, ripping a bitch tead-L\nWho took you from the \"Road To Riches\", the \"Ill Street Blues\"\nIn a jacuzz' with the uz', crack avenues\nBlack you lose to a wolf, pack packing tools\nWho stepped up in this rap game, a sane actin' fool\nWho the first \"Wanted: Dead Or Alive\"\nThat told you live and let it demise\nTen steps ahead of you guys\nStarted \"4, 5, 6\" on it\nG. Rap and Rakim was the first niggas that bought a eightie-man click 'n it\nLook at my life baby, I'm a eighties man rippin' it\nLegendary cat play the path for y'all to get with it\n\n[Hook]\n\n[Verse Two]\nWho that nigga that took the rapflows to the next level\nWish only I was black, fish rappers and ex-rebels\nMy second LP bitch, showed you the sex devil\nPhoto shoots and silk suits, special effect rebels\nAnd it's a shame you sorta rocks around a Lex' bezzle\nSmacking niggas with stacks and ones\nOn the run, clappin the guns\nStacking crack funds and packing the slums\nTold you how them kids blow off they radget for crums\nWas among y'all niggas raps, was too attached to the huns\nI was the first nigga to spit graphic\nStrictly about dealers and slick addicts\nHow to click maddicts and split a cabbage\nY'all niggas' shit was average\nExcept a few cats in the game that came to reign and have shit established\n\n[Hook]\n\n[ Premier cuts & scratches ]\n\"Kool G. Rap is my name\""}]}