{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[K] Brother man, brother man\n[S] Uhh, a brother man, brother.. man, yeah!\n[K] Brother man, brother.. man, go 'head\n[S] Brother man, brother.. man, yeah!\n[K] A brother man, brother man, uhh\n[S] A brother man, brother.. man, yeah!\n[K] Brother man, brother.. man\n[S] Uh-huh, a brother man, brother man\n\n[Kane]\nCheck it, we wreck shop, from nighttime to dawn\nIt's goin it's goin it's goin it's goin\n\n[Shane]\nIt's gone!\nCause Lil' Daddy's like a rap helter skelter\nA bad mother..\n\n[Kane]\nChill Shane, respect your elders\nMy younger one, UHH, tall and yellow\nAiyyo, I got you covered like an umbrella\n\n[Shane]\nWell, I got a little rap thing I wanna breeze through\n\n[Kane]\nSo may I release you?\n\n[Shane]\nOh oh, please do\n\n[Kane]\nSo Lil' Daddy, my ace, my brother\nGet on the mic and let's rock with one another\n\n[Shane]\nAnd, here comes the six foot four, the rough and raw\nTo blow up the mic with rhymes you like\nI strike the stage in a rage and burn just like a twelve gauge\nShotgun, cause son, the Shane is not the one\nThe noise bringer, humdinger, funky rhyme stinger\nBring your girl to my show and I'ma swing her\nThe Lil' Daddy got it down pat, YEAH\nI'm like the name Heavy D, I sound fat\nWord for word, line for line, UH\nI gets mine and show I'm poetically in-clined\nIf rap was made by ? then redeemed because\nYou ain't got no ahhhhhice creeeeeeeeam\nSo take a seat in the rear\nDon't dare to compare, cause I swear, you gets nothin here\nThe way you see me knock out the next brother\nYou'd think my moms had a talk with LL's mother, huh\nAiy-yi-yi-yah, momma mia\nMan I burn the next MC like gonorrhea\nKnock the boots on a girl named Althea\nThen pull her friend by the name of Maria\n\n[Kane]\nWell I got a little rap thing I wanna breeze through\n\n[Shane]\nSo may I release you?\n\n[Kane]\nOh oh, please do\n\n[Shane]\nSo Big Daddy, my ace, my brother\nGet on the mic, and let's rap with one another\n\n[Kane]\nWhen I grab the microphone and shout\nYou gotta spread out, spread out, spread out, spread out\nI'm ready to rip it apart, I hit em with one of the rhymes\nI'm rough in a flash, trash, bash, crash, smash slash mash\nRun for shelter, no one can help ya\nYou pushed up on a heavyweight, when your rhymes are welter-\n-weight that's right, wait, because you're not fitted\n*singing* You're never gonna get it, never gonna get it\nUHH, I'm what you call a rap legend\nAnd definitely the last MC to be present\nDon't even try to take mines\nYou fuckin new jack, you still got price tags on your rhymes\nYo what's that sayin that Hammer says uhh\nU Can't Touch This, just like a pimple yo I'ma bust this\nI'm like Steven Seagal, Out for Justice\nAs for competition, pssssssh, what's this?\nYou're not prepared to, rappers are scared to\nConfront this, cause you know damn well you don't want this\nSome good advice is just break out\nBefore I treat you like a fast food restaurant and take-out\nAs soon as I see the microphone yo I'ma, seize that\nSqueeze that, a battle, you better, freeze that\nCause if you go through the Wrath of Kane, uhh\nNot even Lisa Fischer can ease the pain, so\n\n[K] Brother man, brother.. man\n[S] Uh-huh, brother man, brother.. man\n[K] Yo, brother man, brother mega-man, UHH!\n[S] A brother man, brother mega-man, yeah!\n[K] Brother man, brother man..\n[S] Ha hah!  Brother man, brother.. man, yeah!\n[K] Brother man, brother MAN, aowww!\n[S] A brother man, brother.. man\n\n[both]\nRUFFFFFFFFFFF!", "image": "https://images.genius.com/b6cc17d62fd6810516cc285d9804a8ab.1000x1000x1.jpg", "year": "1993-05-25", "title": "Brother Man, Brother Man", "album": "Looks Like a Job For..."}]}