{"artist": "PnB Rock", "songs": [{"album": "RNB (Real Nigga Bangaz)", "title": "Not At All", "image": "https://images.genius.com/bf4848b445a61d23d1d79e4df8832afb.500x500x1.jpg", "lyrics": "[Chorus: PnB Rock]\nOh, what is this about?\nLately you been trippin' out\nTellin' me you love me\nBut you know damn well I don't do no cuffing\nShawty not at all, not at all, not at all, not all\nNot at all, ho not at all, not at all, nah, nah, nah nah nah\n\n[Verse 1: PnB Rock]\nAll that cuffin', I'm too young for that\nI was big girl, if I said love I wanted that\nFuck from you must not heard none of my songs\nIt's get this money, fuck these bitches 'til I'm gone\nSame shit, different day, different money, different lay\nWent to sleep broke motherfucker then you in the way\nNiggas always frontin' like they block goin' a brick a day\nYour bitch text him goodbye, and them niggas ain't got shit to say\nNo, ooh, peep these niggas' faces\nJealous shit, you won't get nowhere hatin'\nFuckin' bitches, I don't cuff 'em, I don't want relations\n'Til I make it swear to god that trapping is my occupation\nOoh, sneaky bitch just try to say she love me\nHer man just died, she's fuckin' his brother\nIt's funny 'cause she think she know me though\nBut she gon' lock me up and kill me like I'm Romeo, nah\n\n[Chorus: PnB Rock]\nOh, what is this about?\nLately you been trippin' out\nTellin' me you love me\nBut you know damn well I don't do no cuffing\nShawty not at all, not at all, not at all, not all\nNot at all, ho not at all, not at all, nah, nah, nah nah nah\n\n[Verse 2: Deek215]\nWe don't trust 'em, we just fuck 'em\nWe duck 'em, we never love 'em\nThey see you gettin' that fame, bitches down for whatever\nShe say like the way that I rap, and she like the way that I shine\nI'ma fuck her quick to get my nut off\nNever stoppin' my grind\nShe called my phone and said she heard me on the radio\nI started laughin' like damn bitch I already know\nShe said she kinda upset because I let her go\nI said damn that's crazy, but yeah I gotta go\nHold up, I ain't come from that\nLil nigga too young for that\nIt's MOB, I want every dollar\nEvery cent, you gettin' none of that, huh\nNot at all, that's the reason that I ball\nWhen I was down, dead and broke\nYou ain't answer none of my calls\nNot at all, that's the reason that I ball\nWhen I was down, dead and broke\nYou ain't answer none of my calls\nDamn, back it up\nThese hoes be acting up\nShe said she love me\nHad a nigga just crackin' up, let's go\n\n[Chorus: PnB Rock]\nOh, what is this about?\nLately you been trippin' out\nTellin' me you love me\nBut you know damn well I don't do no cuffing\nShawty not at all\nOh, what is this about?\nThinkin' you my nigga now\nCallin' me your bro\nBut was you sayin' that shit a week ago?\nPussy nigga not at all, not at all, not all, not at all\nNot at all, ho not at all, not at all, nah, nah, nah nah nah, ooh\nOh yeah", "year": "2014-06-25"}]}