{"artist": "Fabolous", "songs": [{"year": "2015-05-09", "album": "Friday Night Freestyles", "image": "https://images.genius.com/d8c1d7b184f6047f698686d2a5eb3f62.500x500x1.jpg", "lyrics": "[Intro]\nHello?\nWhat's up, girl?\nAin't nothin', this nigga in here stressin'\nTalkin' that old off-the-wall back-to-Africa shit again\nWhat, that God body shit?\nYeah, that dumb shit, I'm tryin' to get up out of here\nI hear that, but, yo, you know the spot is pumpin' tonight\nWord, for real, where?\nYou know, where the real niggas is poppin' the Cristal\nNot that White Star\nHa-ha, word, where the real niggas at?\n\n[Verse]\nYo, they just want a nigga to lose; Mayweather-Pac-Man\nGovernment don't play fair, they'd rather backhand\nCops killin' us left and right, pray for the black man\nI'm tryin' to get that Creflo Dollar, faithfully stack bands\nAnd, listen, I refuse to let 'em jack the O.G\nYeah, you's a nigga like a black emoji\nI got the LTE flows, you niggas still a 4G\nI'm Nino Brown on a roof and you got to go, G\nAm I my brother's keeper?\nMy brother keep a (-) on the hip, not a beeper, he the reaper\nBlack hoodie on, turn you to a hard sleeper\nTurn your peoples into weepers, your chick a leaper\nJumped on your boy and gave it to me for cheaper\nProbably 'cause you shallow and my pockets is deeper\nI just want it on a late night, he could keep her\nPick her up in the Wrangler, Jeepers Creepers\nScary Movie, she be runnin', but she keep fallin'\nNow she ballin', she love it that my seats' Spalding\nThat's ball leather, it gets cooler like fall weather\nWe meet up at the Four Seasons, that's all weather\nThe sad part: he don't even know he lost her\nHe don't drink, but she do say he double-crossed her\nYou probably won't get that 'til you look at the bottle\nThere's a message in it, baby, just look in the bottom\nShorty, don't lose yourself tryin' to look like these models\n'Cause it's way more to life than bookings and bottles\nLookin' for follows, hook up for swallow\nSome nigga with a big cheque, yeah, you lookin' for lotto\nOwe you dollar and a dream bitches, Powerball bitches\nWin 4Life, Mega Millions, pick four bitches\nLookin' for a nigga that's 6'4\", bitches\nSettin' thirst traps, got to click more pictures\nThat's a lick for bitches, ride the dick, raw bitches\nHave a baby by the nigga, make him trick more riches\nDamn, she just want to play with them boss toys\nLex' coupes, the Beamers and the Benz, Lost Boys\nThink they got a good one, lock her down and wife her\nFound out she a scared bidder, not a lifer\nCouple rappers in her circle, pussy in a cypher\nFucked the boss and the shooter, she Michelle Pfeiffer\nScarface shit, caption like 'I only fuck with bosses'\n'The biggest ones, #TheRickRosses'\nYeah, you with the winnin' team, but you takin' losses\nShout-out to the college girls out here takin' courses\nJust because they in school, but never get no credit\nWe follow hoes that don't know where they headed\nBut I ain't preachin', I ain't tryin' minister nothin'\nBut fuck a bag, you better get a business or somethin'\nYou better stack this and flip instead of spinnin' some stuntin'\nBefore your dope boy boo catch a sentence or somethin'\n'Cause I, I remember how that girl flossed\nNow look at her, that girl lost", "title": "Black Girl Lost Freestyle"}]}