{"songs": [{"image": "https://images.genius.com/f5c5d75e5a52f8df5fa4820d6ec6dfc9.550x550x1.jpg", "year": "2014-11-20", "lyrics": "[Intro - Mr. Lif and live crowd]\nWhen I say \"Akro\", y'all say \"batik\"\n\"Akro!\" \"batik!\" \"Akro\" \"batik!\"\nWhen I say \"Akro\", y'all say \"batik\"\n\"Akro!\" \"batik!\" \"Akro\" \"batik!\"\n\n[Verse 1]\nYo check this\nThese rappers come and they go\nBut I've been here the whole time letting motherfuckers know\nThis is longevity vs. brevity\nYou'll never be ready to meddle with my pedigree\nI'm not impressed by Mr. Fresh Guy\nWho's hot now - next year, working at Best Buy\nThis is Akrobatik, brother, why would you test I?\nYou leave with your chest fried - even the best tried\nAnd lest I forget, pop rap is no threat\nI'm a vet from the era of the purple cassette\nAnd yo, no, I don't drive no fancy car\nBut where I've been, so, your whip will never get you that far\nI'm known as an underground international star\nYou're the answer to a trivia question at the bar\nYou won't be around next year\nBut guarantee another Akrobatik gem will reappear\nBecause (I-I)\n\n[Hook]\nI'm built To last\nI'm here to stay\nI hold it down\nGet out my fucking way\nI'm built to last\nYeah, you're here today\nBut you're gone tomorrow\nGet out my fucking way\n\n[Scratchwork - DJ Reel Drama]\nCause I'm the type of nigga that's built to last\nBuilt To Last\nCause Im the type of nigga that's\nBuilt To Last\n\n[Verse 2]\nLittle dudes handing their careers over like they lost bets\nAin't willing to put in the years to be a boss vet\nImmovable object, Rock of Gibraltar\nThere's greatness running by you like you're blocking for Walter\nOld Faithful, verbal shots bust your whole grapefruit\nIf Ak smells hate, troop? Then Black Hell Breaks Loose\nHere's something new to peep and blast, niggas\nFor my 2092 jeep ass niggas\nWhat you hear leaves the careers of mad toys dead\nWe ain't going nowhere, like Bad Boy said\nFresh since the 80s, in the 90s I was dope\nSince 2000, I've been one of the most dependable to quote\nWhether you know it or not, I've been blowing up spots, collecting victories\nRocked with y'all New York City to Italy\nI strangle the track, and make the song squirm\nStanding strong, firm - Built To Last for the long term, saying\n\n[Hook]\n\n[Scratchwork]\n\n[Verse 3]\nAyo\nI've returned from aortic dissection\nTo move hip-hop into a forward direction\nSo you can clear the orbit of this morbid perception\nThat hip-hop could forfeit border protection\nY'all forced it with this corporate affection\nThat's leaving fans absorbing nothing more than your sexin' and flexin'\nIf you ain't the authentic, then order my next shit\nSit down with it, learn a thing or two about the hectic eclectic\nElectricity when I flex my ethnicity\nIt's no mystery when I bless the set vividly\nThat history is being made\nIn every Ak verse you hear, sincere homage to pioneers is being paid\nI make the jams that the fans want to rush for\nAkrobatik is the one-man Mt. Rushmore\nReason laid the dope drum track for me\nTo proceed with rap's greatest comeback story\nBecause I am\n\n[Hook]\n\n[Scratchwork]", "title": "Built To Last", "album": "Built To Last "}], "artist": "Akrobatik"}