{"songs": [{"album": null, "image": "https://i.genius.com/a00e79783c0abd286fd3f93bbb4e2bed0efa04ac?url=https%3A%2F%2Fwww.music-bazaar.com%2Falbum-images%2Fvol3%2F212%2F212640%2F1454108-big%2FFuck-An-Umbrella-Single-cover.jpg", "year": "2011-01-01", "title": "Fuck An Umbrella", "lyrics": "[Produced by JHawk]\n\n[Intro]\nYeah, it's Mills\nI'm not usually the type\nTo do this shit\nBut uh I just had\nTo so fuck it\n\n[Verse 1]\nIf you feel me then you know what this is all about\nWow, did I just take it there now\nHow did someone have the audacity\nTo come after me taxin' my master piece\nNah, they won't get no stacks off me\nFuck 'em once, fuck 'em twice, now here's three\nSpeak shame on my name to improve game\nBut your girlfriend's friend told me everything\nYeah, you should watch who you're talkin' to\nBreak your back please don't plan on walkin' through\nI'll throw a bitch in the window of your living room\nStrap the cash in and I need my fucking answer soon\nOr I'll have a second album up for ransom suit\nCause I just can't comprehend how you could do that to a friend\nI hope you lay awake in bed and just think and just think\n\n[Hook]\nOne day I'mma make it rain\nAnd I'mma laugh all the way to the bank\nSaying fuck an umbrella, fuck an umbrella\nFuck an umbrella, fuck an umbrella\nAnd I'mma keep my head up and\nDo my own thing through all this bullshit\nSaying fuck fake friends and bitches\nI only trust music, music\n\n[Verse 2]\nIt's not about the money for me, it's about my team\nI've been heavy in some shit and now I'm finally clean\nIt's ironic how a label that doesn't have any green\nWants to hold a kid back from persuing a life dream\nWhat the fuck does that make me?\nDollar signs in your eyes?\nThat's why this song is free\nCause I could give a fuck about all your problems, save it\nYou'll be sorry when I'm rich and famous\nBrah, this business is shameless\nThat's why to me you'll forever remain nameless\nYeah, forgettin' where I came from\nShit, I've done eveything since day one\nUhm, I'mma keep pushing these envelopes\nLet's see who's the first to leave\nPlus I know I'm always in the lead\nP.S. I'm the reason why my album leaked\n\n[Hook]\n\n[Bridge x2]\nImma live in the sky some day\nI'll be sure not to let you know\nAnd I think I found a way to not say a word but get your secrets told\n\n[Hook]"}], "artist": "T. Mills"}