{"songs": [{"year": "2012-10-22", "album": "good kid, m.A.A.d city (Deluxe Version)", "image": "https://images.genius.com/f3db37bb8953d6e671d8bb532da2e855.220x220x1.jpg", "title": "​good kid", "lyrics": "[Produced by Pharrell Williams]\n\n[Hook: Pharrell Williams]\nMass hallucination, baby\nIll education, baby\nWant to reconnect with your elations?\nThis is your station, baby\n\n[Verse 1: Kendrick Lamar]\nLook inside these walls and you see I'm havin' withdrawals\nOf a prisoner on his way\nTrapped inside your desire to fire bullets that stray\nTrack attire just tell you I'm tired and ran away\nI should ask a choir: \"What do you require\nTo sing a song that acquire me to have faith?\"\nAs the record spin I should pray\nFor the record, I recognize that I'm easily prey\nI got ate alive yesterday\nI got animosity buildin', it's prob'ly big as a buildin'\nMe jumpin' off of the roof is me just playin' it safe\nBut what am I 'posed to do when the topic is red or blue\nAnd you understand that I ain't\nBut know I'm accustomed to just a couple that look for trouble\nAnd live in the street with rank\nNo better picture to paint than me walkin' from bible study\nAnd called his homies because he had said he noticed my face\nFrom a function that tooken place, they was wonderin' if I bang\nStep on my neck and get blood on your Nike checks\nI don't mind 'cause one day you'll respect\nThe good kid, m.A.A.d city\n\n[Hook: Pharrell Williams]\nMass hallucination, baby\nIll education, baby\nWant to reconnect with your elations?\nThis is your station, baby\n\n[Verse 2: Kendrick Lamar]\nAll I see is strobe lights, blindin' me in my hindsight\nFindin' me by myself, promise me you can help\nIn all honesty I got time to be copacetic until\nYou had finally made decision to hold me against my will\nIt was like a head-on collision that folded me standing still\nI can never pick out the difference and grade a cop on the bill\nEvery time you clock in the morning, I feel you just want to kill\nAll my innocence while ignorin' my purpose to persevere\nAs a better person; I know you heard this and probably in fear\nBut what am I 'posed to do when the blinkin' of red and blue\nFlash from the top of your roof and your dog has to say woof\nAnd you ask: \"Lift up your shirt,\" because you wonder if a tattoo\nOf affiliation can make it a pleasure to put me through\nGang files, but that don't matter because the matter is racial profile\nI heard 'em chatter: \"He's prob'ly young, but I know that he's down\nStep on his neck as hard as your bullet-proof vest\nHe don't mind, he know we'll never respect\nThe good kid, m.A.A.d. city.\"\n\n[Hook: Pharrell Williams]\nMass hallucination, baby\nIll education, baby\nWant to reconnect with your elations?\nThis is your station, baby\n\n[Verse 3: Kendrick Lamar]\nAll I see in this room: 20's, Xannies and these 'shrooms\nGrown-up candy for pain, can we live in a sane\nSociety? It's entirely stressful upon my brain\nYou hired me as a victim, I quietly hope for change\nWhen violence is the rhythm, inspired me to obtain\nThe silence in this room with 20's, Xannies and 'shrooms\nSome grown-up candy, I lost it, I feel it's nothin' to lose\nThe streets sure to release the worst side of my best\nDon't mind, 'cause now you ever in debt to good kid, m.A.A.d. city\n\n[Hook: Pharrell Williams]\nMass hallucination, baby\nIll education, baby\nWant to reconnect with your elations?\nThis is your station, baby"}], "artist": "Kendrick Lamar"}