{"artist": "ZelooperZ", "songs": [{"year": null, "album": "Coon N The Room", "title": "Bitches And Money", "image": "https://images.genius.com/33eef4e459a769730be55158ee218523.500x500x1.jpg", "lyrics": "[Intro]\nI’m bout to make it rain\nAll 2 dollar bills\nWestside!\nGirls, currency [x6]\nFuck this shit man\n\n[Hook]\nI got money, I got bitches\nI got bitches, I got money\nI got money, I got bitches\nI got bitches, I got money\nI got money, money gets me bitches\nBitches get my money\nI got money, I got bitches\nI got bitches, I got money\nI got money, bitches, bitches, money\nMoney, bitches, bitches, bitches\nI got money, money, bitches, bitches\nBitches get me money\nI got money, I got bitches\nI got bitches, get me money\n\n[Verse 1]\nAll this money pour in, all these hoes go in\nAll this green around me like a nigga lawn mowing (John Deere)\nSome Illuminati clothing, a fresh man goes in\nShitting on these hoes cause I ain’t have a pot to go in\nSonning all these niggas like “Luke I am your father” (bitch)\nAll these hoes give me head like the scar in Harry Potter\nThrew 400 so I'm throwing 500 fivers\nSlapping bitches up, hands full of baby powder\nI’m a motherfucking coon, sitting in the room\nFucking all these bitches, like I am Bill Clinton\nMoney by the minute, I put it on the mitten\nIf money gets me bitches, bitches bring me all my digits\n\n[Hook]\n\n[Verse 2]\nBout to fuck a pair of twins, all geminis (hell yeah)\nThought I was fucking 8 hoes at the same time\nShe gave me brain, mouth on my head\nSo you could say, she was on my mind\nI ain’t got to say shit, like a fucking mime\nCause you know I got them white faces like I roll with mimes\nWhen I step in this bitch I blow like a landmine\nYou can go ahead and hate I really don’t mind\nRolling, getting baked from Whitney, Sidney, and Britney\nCounting all these white faces, grand [?] and [?]\nGive me ramen noodles, I don’t fuck with the Beni’s\nAnd your motherfucking fork was worth every penny penny\n\n[Hook]\n\n[Bridge]\n(School these hoes)\nYou want to go to the movies, bitch you heard of bootleg?\nI ain’t buying shit!\nYou want to go out [?], bitch you heard of ramen noodles?\nI ain’t buying shit!\nHo, I ain’t buying shit! [x3]\nI said I ain’t buying shit!\nHo, I ain’t buying shit! [x3]\nI said I ain’t buying shit!\n\n[Hook]"}]}