{"songs": [{"year": "2017-11-10", "album": "Engraved In The Game", "image": "https://images.genius.com/d2a4d928684e2efa403cd26a8dc80fa5.1000x1000x1.jpg", "title": "I Thought Ya Quit", "lyrics": "[Verse 1]\nBass drop heavy, I just drank more Henny\nI'm about to piss you off, thank you, I'm ready\nIt's the Kerser one, bitch, big chains in the Drive-Thru\nEverybody lookin', I just came here to buy food\nPrice of fame, handle that with a few tabs\nMake a move back, what you mean I got my groove back?\nAin't ever left, set the swagger where it meant to be\nGot the fresh recipe, demolishing my enemies\nTracy Grimshaw, I still haven't finished yet\nGot a photo on my blowup-doll, I'm kickin' it\nThen I'm sticking it with a fuckin' switchblade\nWatch it fly around the room, I think it got an itch, mate\nThink I'm insane, throw me in the loony bin\nI'll be with Rates like, man I swap your blue for green\nReal intelligent, I'm always staying relevant\nYou tellin' by my elegance, I'm nothing short of excellent\n\n[Hook]\nAsk me if I'm sober, I be like fuck no!\nYou're talking weed, alcohol, all the drugs bro\nI don't pop pills, unless I triple dump\nBut I thought you quit? Well I didn't, cunt\nI did clean up and I ain't on the hard shit\nI just live life, enjoy it 'til I pass it\nSo who the man with the shit to sell?\nIt's Kerser, want 'em free or you can keep it to yourself\n\n[Verse 2]\nStill drive 'round town like a maniac\nI don't know but my psych say it's brain attacks\nSo insane with rap, I should fuckin' dangle cats\nBy the tail yellin' \"free pussy\" to a gang of fags\nYou ain't get no pictures brah\nYou just like to let the people stop and think you are\nI got these bitches throwin' bras as I'm rappin' lad\nSome bitches stalk, if I see them, I'ma slap them bad\nWhat the fuck? I ain't a pop star bitch\nI ain't soft, you won't hear me on no Triple J shit\nI'm a one-man army with a thousand on course\nSo many people through your door that your house will just fall\nGet with the program, I'm so sick with my art\nThat these other rappin' faggots keep on kissin' my arse\nYou can't get sick of me brah, I remain at the top\nI'm a legend already, I'd be crazy to stop, what?\n\n[Hook]\nAsk me if I'm sober, I be like fuck no!\nYou're talking weed, alcohol, all the drugs bro\nI don't pop pills, unless I triple dump\nBut I thought you quit? Well I didn't, cunt\nI did clean up and I ain't on the hard shit\nI just live life, enjoy it 'til I pass it\nSo who the man with the shit to sell?\nIt's Kerser, want 'em free or you can keep it to yourself\n\n[Outro]\nSo long Trace!"}], "artist": "Kerser"}