{"artist": "Boondox", "songs": [{"album": "Abaddon", "title": "The Sober Truth", "year": "2014-05-13", "lyrics": "[Intro: Boondox]\nY'all thought I was done, huh?\nThought it was over?\nShit, it ain't over\nI'm just gettin' started in this motherfucker\nBoondox! The Scarecrow\n\n[Hook]\nAnd these moments I can't take\nThat I feel like I'mma break\nWhen did I get so down\nNever thought I slow down\nWas it over? Got sober\nDidn't know what I might do\nFelt like hands from a priest and\nIt hit me that (I knew I was a motherfucking beast!)\n\n[Verse 1]\nAin't been too long I've been sober\nBlacked out most of my damn life\nBitches get fucked in bent over\nI got shot on the next wife\nY'all don't know but a little bit\nMy shit ain't been closed to told\nAlways say that I'm loosin' it\nBut my soul ain't been close to sold\nAngel on my shoulder and the devil in my right hand\nLookin' to Jehova, empty bottles on the night stand\nBattle with delusion calls, battle with who close to me\nSo much damn confusion didn't know who I supposed to be\nBut never no more, repeat that never no more\nI see that comin' from a mile away and never no more\nDon't be that same motherfucker with my head up in the cloud\nNot just another motherfucker screamin' \"hey, look at me now\"\nStill rollin' with the heater, desert eagle, that will never change\nQuick to pull the triger now y'all fools are never outta range\nOnly thing you need to know I got to put this on my tatt\nDox is fucking monster ressurected, put that on a hat\n\n[Hook]\n\n[Verse 2]\nThe worst thing that they ever did\nWas let me get my mind right\nThey shoulda kept me on that shit, not let me get my rhyme tight\n19 days locked in the dark, y'all don't think I was coming back\nDirty now, he ain't got the heart, but here I spit on another track\nHoping that these bastards don't forgot how much they hate me\nHope they still be sleepin' on it and highly underrate me\nHope your girl still flicks her bean, while you at work to my shit\nHope she use your credit card on iTunes when she buy it\nNow I got this new shit, enjoy it now and live it up\nFirst that she hear this gon' be the last time that she give it up\nOn you can put that on a tall tee\nWith my number writen under it so she can call me\nCall me? A motherfucker call me lame ass\nLong as heatens love me you can put a bullet in my brain\nAnd they gon' resurrect me on the third day (apparition)\nYou just feedin' fire to the flames bitch (ammunition)\n\n[Hook x2]", "image": "https://images.genius.com/181444660a65d0000670a98f7f5af756.400x400x1.jpg"}]}