{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/0e825d5daf35800f4be503b4ff58164c.640x640x1.jpg", "title": "Tear Shit Up", "album": "Weekend Warrior", "lyrics": "[Biz Markie]\nHuh-huh, uh-huh, yeah, uh-huh\nY'all know, uh-huh, uh, uh-huh\nY'all know, uh, uh uh-huh\nCheck it out {\"C'mon!\" - Chuck D}\n\n[Verse One - every last word or syllable is echoed]\nDon't go to Getty, go to Exxon\nLike \"Bonita Applebum,\" ya gotta put me on\nGot good luck like Lucky Charms leprechaun\nCan't believe Freaky Tah and Big L is gone\nYou think I'm a mailman, well my delivery\nAin't no other brother like the B-I with the Z\nEmezah-A-Rrrah, say K-I with the E\nI got mo' rhymes than Muhammad Ali\nNot number one but here to have fun\nGuaranteed to proceed and get the job done\nY'all, know, my competition is none\nFunky funky fresh from the day I begun\nYou rock with me, you're guaranteed to have a ball\nGot a big belly, over six feet tall\nMy favorite team is the Vikings when I watch football\nHere's another one to get you off the wall\n\n[Chorus - unknown female while Jeff scratches]\nHe's Biz Markie, as you can see\nHe came to tear tear tear shit up {\"C'mon!\"}\nHe's Biz Markie, as you can see\nHe came to tear tear tear shit up {\"C'mon!\"}\nHe's Biz Markie, as you can see\nHe came to tear tear tear shit up {\"C'mon!\"}\nHe's Biz Markie, as you can see\nHe came to tear tear tear shit up, up, up {\"C'mon!\"}\n\n[Verse Two - with the same echo]\nSoon to be elected in the Hall of Fame\nI rock the microphone, emceeing's my game\nI flip so many styles, my name should be Flipper\nOn Three's Company, I wish I was Jack Tripper\nBack in the days, I used to eat {?}litina{?}\nBack in the days, my sister had a Thumbelina\nBack in the days, I liked a girl named Angelina\nBack in the days, I wanted to get in between her\nMy jingle bella, always Roc-A-Fella\nEven my acapella will be a best seller\nShe couldn't believe what I had achieved\nFunky like ring around the collar, doo doo on the sleeves\nEnquiring minds always want to know\nHow did I get my ill freestyle flow?\nI just tell 'em straight up without no B\nAsk me no questions yo, here's my ID\n\n[Chorus]\n\n[Verse Three - same echo once again]\nI'm not Captain Kirk, or Mr. Spock\nWhen I put the party people in a state of shock\nI'm like Mark Twain, or Shakespeare\nCause when I'm on the stage, people throw they hands in the air\nWavin 'em wild, like in a frenzy\nDog in the house like I'm Spuds McKenzie\nI'm just doin it, just rockin the house\nSucker MC's is spiders or mouse\nComin off the top of my head\nI'm not dumb so don't be misled\nWhen I was young, I never pissed in the bed\nAlways listened to what my moms and pops said\nLove reggae so much, you could call me a dred\nGot a big belly so you know I'm well fed\nAnd I'm a lover-lover like my name is Ed\nAnd I'm +2 Awesome+ like K and Teddy Ted\n\n[Chorus] - 2X"}], "artist": "Biz Markie"}