{"artist": "Wiley", "songs": [{"year": "2013-09-02", "lyrics": "[Verse 1: Wiley]\nWe're gonna take it one step further\nOn the riddim committing murder\nMan in my city mandem have heard of\nI'm around like a burger, the kids draw for the burner\nAnd burn ya because they're sick of being learners\nSick of being heard of cause of the music that I don't do\nFuck about on the pitch, I'm gonna roast you\nCause I got the skill of a winner, I'm gonna boast too\nIf it was '82 I would have torched you\nI'm hopeful, hopefully developing\nAnd I be the only king that gets Devil in\nAnd I'm doubling, I'm trebling, I'm better than I've ever been\nThe revolution is over and I'm about to settle in\nI've already been a nice kid, an Ice Kid\nAnd then an ice man, that's why it's hard we're forgetting him\nWe've gotta take it up level and beyond\nI'm a rebel on a song, take off cause I'm relevant\n\n[Hook: Wiley]\nWe gotta take it that one\nStep further\nStep further\nStep further\nWe gotta take it that one\nStep further\nStep further\nStep further\n\n[Verse 2: Ghetts]\nThis ain't the level you reach overnight\nAre you ready for this?\nLancelot's when I bury the king\nI said, sorry, pardon! What?\nOh my God, it's a regular spin!\nBet any given I'll be better than him\nFuckboy, you can't level with the level I bring\nI'm a P-R-O-B-L-E-M\nI'm a demi-god with the devil within\nI said bullet if you wan' push it\nSo man ah salt and pepper your skin\nToo many wannabe Kendrick Lamars\nSendin' them bars, but Ghetts did it before Kendrick\nAnd I offended plenty of stars\nI can make fear enter your heart, I'm relentless\nCan't say grime's dead to a grime head\nI am more the original mic-man times 10\n\n[Hook: Wiley]\nWe gotta take it that one\nStep further\nStep further\nStep further\nWe gotta take it that one\nStep further\nStep further\nStep further\n\n[Verse 3: Ice Kid]\nI just wanna smile again\nStifle them with the rhymes again\nI'mma rhyme till death\nAre you mad to think I'm content with the life of stress\nI've got bars, I'm on a Rikers Island ting\nAnd I think it's time to find the life within\nBetter mind, I'll put my knife inside your hip\nAll the niggas by my side, I'll die for them\nI'll go blind on the right riddim\nRise up into the sky cause I fly like a pilot is\nYou couldn't find where the [?] at, so I had to find the clique\nThey wanna see me die before my time begins\nBright like a diamond ring\nGo and jump on the riddim and I ride like a cyclist\nSore loser but I like to win\nThey don't shine cuh the light in their mind's too dim\n\n[Hook: Wiley]\nWe gotta take it that one\nStep further\nStep further\nStep further\nWe gotta take it that one\nStep further\nStep further\nStep further\n\n[Verse 4: Devlin]\nOne step in the right direction\nI fantasise of big knifes at night\nAnd slicing up One Direction\nA killer on the loose\nI'm blamed for the white complexion\nIs that far enough?\nI ain't here through luck, I'm here by election\nWanna try it? Then I'm raring up\nI'll start tearing up your whole rhyming section\nI'm gonna go too far\nI'll get myself drunk at my local bar\nBut tell your girlfriend I'm a local star\nBe sick on her skirt then literally blurt\nI'll go further than that\nI've already got sperm in the bank\nIn case this generation rises after I die\nAnd they wanna spit dirt on a lad\n\n[Hook: Wiley]\nWe gotta take it that one\nStep further\nStep further\nStep further\nWe gotta take it that one\nStep further\nStep further\nStep further", "image": "https://images.genius.com/225673af311222d087a51c74d11b59d5.1000x1000x1.jpg", "album": "Ya Dun Know Vol. 1", "title": "1 Step Further"}]}