{"artist": "Ice-T", "songs": [{"title": "Gotta Lotta Love", "lyrics": "[ VERSE 1 ]\nWoke up the other mornin, I heard a rumor\nThey said the gang wars was over\nI told em they was bullshittin, they said it's real as hell\nCan't explain the way I felt\nToo many years I seen my brothers die\nAnd I can't say that shit was really that fly\nBut I used to gangbang when I was younger\nSo it's really hard to tell a kid that he's goin under\nI never thought I lived to see us chill\nCrips and Bloods holdin hands, the shit is ill\nBut I love it, I can't help it\nToo much death on the streets, and we dealt it\nVan Ness Boys, The Hoovers, The 60s\nBounty Hunters, 8-Treys, all coolin out, gee\nI pray the shit'll never stop\nYou used to see the wrong colors, and the gats went pop-pop\nBut now the kids got a chance to live\nAnd the O.G.'s got something to give\nThat's love, black on black, that's how they made it\nAnd if any busters flip, they get faded\nL.A. is where I'm speakin of\nPeace to all the gangsters, cause I got a lotta love\n\n[ VERSE 2 ]\nI got a lotta love, cause you're all my brothers\nRed or blue, black's the color\nWe got a chance, so we can really sweat the real fools\nShow those muthafuckas the real tools\nCheck the enemy, it ain't the family\nNot 1-11, try L.A.P.D\nThey gotta understand, they beat on a blackman\nThere's gonna be drama, know what I'm sayin?\nAnd if we flip, let's all flip together\nCause I'm prepared, kid, for rough weather\nAnd we gotta realize, the boys on the east side\nYou call em Eses, I call em allies\nBecause the day that we all unite\nWatch the pigs get real polite\nPunk muthafuckas gotta learn quick\nThat we ain't takin no more shit\nL.A. is where I'm speakin of\nPeace to all the gangsters, cause I got a lotta love\n\n[ VERSE 3 ]\nCrenshaw Boulevard, Sunday afternoon\nFolks sittin on things, mad systems boom\nThe girls are lookin better\nThe gang truce is on, so you wear whatever\nAt Venice by the ocean\nRag-top Trey hits the three-wheel motion\nThere's gangsters all around\nStill crazy sets, but you just don't clown\nI pray L.A. can stay this way\nIt's the first summer I can really say\nI felt cool, we all chilled\nWent to the park, and nobody got killed\nNow if you got a problem, it's man on man\nYou don't need a gang to solve em\nI seen the greatest thing I seen in my life\nTwo brothers in a straight up fist fight\nNobody pulled a gat, nobody jumped in\nNobody pulled a knife, nobody got done in\nL.A. is where I'm speakin of\nPeace to my city, cause I got a lotta love\n\n[ VERSE 4 ]\nG-a-t-e-s, I hope you wear a vest\nEven after you're out the fuckin office\nCause we're on a totally different tip\nFuck that pig brutality shit\nThis unity is gettin to me\nEvery brother on the street is my homie\nI'm rollin through a hood that I never been\nAnd every brother steps to me as a friend\nI love it, I love it\nAnd nothin in my life will ever be above it\nWe wanna see our kids all grown up\nWe're tired of seein our hoods get blown up\nL.A. is a great place\nFly girls, dope cars, life at a fast pace\nBut gangbanging was killin it quick\nAnother child got hit - bullshit\nPop-pop-pop, 10 on a weekend\nWe was goin off to deep end\nBut now we got a chance, my friend\nTo mend, and make the colors blend\nLet's all go out on a picnic, kick shit\nAnd squash all the static\nLast year I lost about five homies\nThis shit is real to me\nL.A. is where I'm speakin of\nPeace to all the gangsters, cause I got a lotta love\n\nYo\nThis is goin out to all the gangbangers\nAll over South Central\nWatts\nInglewood\nAll over L.A., basically\nEast L.A\nYouknowmsayin?\nIt's basically goin down\nPeace to all the Crips and the Bloods\nVan Ness Boys\nHoovers\nRollin 60s\n83's\nBounty Hunters\nYeah\nAnd the Jungle\nThis is goin out to all the brothers over there in Watts\nYou know what I'm sayin?\nThrowin it up\nGrape Street\nNutty Blocc\nFront Hood\nAnd all them niggas out there in Compton\nRollin 30s\nHarlem\nAh yeah\nPueblos\nNickerson G's\nPeace\nInglewood Family\n18th Street\nSouth Loc\nAnd all the Ese homeboys\nAll the different sets\nEvery set, Crip, Blood\nWhat doesn't matter to me\nCause I gotta love\nYou know what I'm sayin?\nHope the truce never ends\nYouknowsayin?\nWe can do this", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg", "album": "Home Invasion", "year": "1993-03-23"}]}