{"artist": "Beanie Sigel", "songs": [{"lyrics": "New shit\nWSUP!\nWSUP!\nWSUP!\n\n[Beanie Mac]\nStop, chill, relax, and let this nigga Sigel flow\nI know you can't believe the flow, you can't cope I flow dope\nLike a key ya blow\nYou like \"Nah, Beans?\", same nigga from 21st and Sigel street\nWhen it's beef people let them desert eagle speak\nSo whoever, wherever I don't care where we meet\nStop, chill, don't talk shit sideways outta your mouth\nI will slap spit sideways outta your mouth\nBitch niggas talk indirect it don't matter\nWhen you got snitch niggas right in your set\nThat's why I know where you niggas sling coke and pump D at\nSame spot that you liable to see me at\nGun and a mask, one in the stash where the seat at\nStop, all my young bucks huggin the block\nStop puttin drugs in your sock\nYou makin it easy for the cops to catch you\nThey hooked to that stash and that trash and that bag of pretzels\nYou gotta hustle smarter than that\nCop coke harder than that, keep your dough apart from your crack\nKeep a stash in the dark for the trap\nMan you never know when the narks gon launch an attack\n\nHOOK: repeat 2X\n\nStop, I know you cats livin a lie\nYou niggas rats you ain't willin to die\nChill, I spit it for my niggas keepin it street\nKeepin they steel, all my niggas keepin it real\n\nIt's still vets in the game tryin na earn respect\nI got the best thug album and y'all ain't heard shit yet\nYou can shuffle up the cards I'mma learn the deck\nWhen I do the game is mine, man I'm aimin high\nNiggas talk about guns don't be carryin none\nEvery two hammers I cock I'm buryin one\nI'mma dress in all stash this year, whenever I'm near\nFrom the First Union, to Madison Square\nStop, chill, cuz I know y'all niggas like Mac fuckin that track\nLet me show you somethin dog it ain't nothin for Mac\nIt come all natural like I'm bustin my gat\nOr I'm stuck in a spot crushin the crack\nGot ice in a pot, fluffin the crack\nTakin backs to the block so don't stuff in them packs\nDoin life on the Roc ain't nothin fuckin with that\nMe, jail, dog, you can put me under the ground\nWhere I'm from all my niggas they from under the ground\nYou can hear us when we come it's a thunderous sound\nTrees, stompin, Roc jeans and a bunch of white T troopers\nStay on post with they toast and they like to shoot you\nPhilly cats no rack, big guns and Sumas\n\nHOOK 2X", "image": "https://images.genius.com/a5d876dd3d88aa58a26a93ff8e32c391.500x500x1.jpg", "year": "2000-02-29", "title": "Stop, Chill", "album": "The Truth"}]}