{"artist": "Pusha T", "songs": [{"album": "PT4*", "title": "Coming Home", "image": "https://images.genius.com/b3b3bfb765d5c46dbdfadd3b94c7fb5c.680x680x1.jpg", "lyrics": "[Verse 1: Pusha T]\nUh, ah, fuck it, we all poor\nEven if you got money, still lookin' for more\nWhy am I buyin' Rollies? I got 20 for sure\nStill connect witchu, it's still hid in the drawer\nWith no Js on, I'm still lookin' to score\nYou see they gave us crack, then started wagin' a war\nUh, all these lies, they steady tellin' me\nBefore Obama, we had Eric B. (Woo)\nOr Tony Lewis out in D.C.\nThe 80's kingpins, gotta free them\nAll these faces, they ain't believe in\nIf no child's left, then how can we leave them?\n\n[Chorus 1: Lauryn Hill]\nWhen love is gone, you hold onto anything\nSome do wrong, just to feel anything\nBut when the void is filled, you stand up to anything\nWhen love is real, you can do anything\n(You can do anything)\n\n[Verse 2: Pusha T]\nUh, I do it for my big Benz drivers (Drivers)\nFor my street-corner survivors (Survivors)\nFor my niggas that miss The Wire (Woo)\nAnd throwback mamis, that won't retire\nReminiscin' on the days\nWhen the trips was Cancún and the bottles got sprayed\nYou can't relate 'cause you wasn't there\nNah, you wasn't hot, let me make it clear\nY’all was breakin' into cars, we was breakin' bad\nWhen y’all was fightin' dogs, we was racin' Jags\nThis the life for the fast\nAin't no future, ain't no past, we won't worry 'bout the crash, uh\nNow it's jail poses and club pictures\nAirbrush backdrops and jail visits\nThis the dope boy song for the dope boys gone\nLet 'em know it's still snowin'\n\n[Chorus 2: Lauryn Hill]\nWhen love's withdrawn, you hold onto anything\n(You hold onto anything)\nSome do wrong, they have to do anything\n(They have to do anything)\nBut when the void is filled, you stand up to anything\n(You stand up to anything)\nWhen love is real (When love is real)\nYou can do anything (You can do anything)\n\n[Verse 3: Pusha T]\nI'm speakin' to the soul of my black native bros\nWho ain't get to go to school like a J. Cole\nWho ain't have a silver spoon or a bankroll\nWho weren't taught the golden rule, but they made do?\nFree lunches and apple juices, uh\nFood stamps, ashamed to use 'em\nYou ever lived with the user?\nShared a bed with abusers, that's the worst way to lose 'em\n\n[Verse 4: Lauryn Hill]\nNew plan, but it's a new day\nBlack people past their due date\nSettin' the captives free in a new way\nI'm coming home, I'm coming home, I'm coming home\nI'm coming home, I'm coming home, I'm coming home\nIt's a new day, black people past their due date\nSettin' the captives free, in a new way\nSaid it's not over, it's not over\nYes, it's just started, it's just started\n\n[Chorus 3: Lauryn Hill]\nWhen love is strong, you can do anything\nThings go wrong, but you'll stand up to anything\n(But you'll stand up to anything)\n'Cause when the void is filled, you can do anything\n(When the void is filled)\nWhen the love is real, you can do anything", "year": "2019-08-28"}]}