{"songs": [{"image": "https://images.genius.com/9bc78de515a998eed4e40863e21c20b6.1000x1000x1.jpg", "year": "2006-10-17", "title": "A Minute to Pray", "album": "Full Circle", "lyrics": "[Intro]\nYeah, it's been a long time\nWelcome back, yeah\nOur Father, who art in Heaven\nGot niggas jumpin out the buildin like 9/11, c'mon\n\n[Xzibit]\nOnly God could save us\nI done burned down the town and killed my neighbor\nDo I, come to you for my early demise? (yeah)\nA minute to pray, it only take a second to die\n\nNiggas ain't prepared, too scared to do it\nDippin cigerettes in embalmin fluid\nHoods, special effects bring the drama to it\nBut sue me if you wanna see the trauma youth\nI'm a walkin time bomb, don't tick me off\nCrucified to die, nailed to the cross\nNatural transition, foot soldier to boss\nThe A.K. ricochet put blood in your cough\nAnd you know the whole fucked up part of it all?\nTake a muh'fucker's life somebody comin for yours\nIt's the get-back gangstas don't believe in karma\nOnly the strength of the dollar and the body armor\nYou the bitch ass nigga or a man of honor\nMy hands wrap around your throat like a anaconda\nThen squeeze 'til your eyes pop out of your face\nThen relocate to a brand new space (yo)\n\n[Chorus: Xzibit]\nOnly God could save us (yeah)\nI done burned down the town and killed my neighbor (yeah)\nDo I, come to you with blood on my hands (yeah)\nOr run away from the place that I stand? WHO THE FUCK I AM, YEAH!\nOnly God could save us\nI done burned down the town and killed my neighbor\nDo I, come to you for my early demise?\nA minute to pray, it only take a second to die\n\n[Xzibit]\nI used to snatch people out of cars with a shotgun\nNow I give cars to people who ain't got one\nStill got the shotgun, whole different lifestyle\nKill you with a crowbar, wrapped in a white towel\nGotta play it smart now, the streets is watchin\nThe streets dictate the beats so my beats be knockin\nFuck a Strong Arm, I'll drop your coffin\nYeah yeah, muh'fucker I hear you talkin\nNiggas so often take kindness for weakness\nHeat-seekin G with the elite on some cheap shit\nThis my square boy, you can't take me out of it\nYou want war nigga you better bring a lot of it\nI ain't a problem with puttin my problems to rest\nYou so pussy, boy you need a gynocologist\nThe hand, the bullet, the firin pin\nPlease God forgive me for I have sinned, Amen\n\n[Chorus]\n\n[Xzibit]\nHuh, hit a nigga, kill a nigga will come back\nMurder rap never attached, got too many snaps\nIt's more than raps, it's actual facts\nWelcome back to the West, left side of your map\nBeen attacked from all sides, it's time for the payback\nLay back, wait for the right time to spray that\nSpray that motherfucker, down to the last clip\nLast clip you save for the cop on some waive shit\nBlaze haze for days; shocked, stunned, amazed\nBitch best behave or take the fade\nBlaze Shade-45 in the all-black Bentley\nIf I gotta go, y'all niggas comin with me\nSimply put, Mobb Deep said y'all were (Shook)\nAnd when I come through, you just look\nWe don't change the game, we close the book\nI let you go now, I know you got crack to cook, c'mon\n\n[Chorus - 2X]"}], "artist": "Xzibit"}