{"songs": [{"year": null, "image": "https://images.genius.com/c6e43fa6132b15ac511af3c8d7de53d9.500x500x1.jpg", "title": "Come Together", "album": "Science of .Breath, Volume Three", "lyrics": "[Intro: Malcolm X]\nOf being in complete unity with each other, harmony with each other. And not letting the man maneuver us in fighting one another. Long as we practice brotherhood among ourselves and then others who want to practice brotherhood with us, we're for that. But I don't think that we should run around trying to love somebody who doesn't love us\n\n[Hook]\nOne thing I can tell you is you got to be free\n\n[Verse 1: Black Thought]\nI was, uh, too young to care when my father died\nI had to put one in the air when my mama died\nBoth victims of completely different homicides\nIt makes me wonder sometimes, damn, how I'ma die\nI can't shake these memories, I'm haunted by\nIf it bring a tear to your eye then I apologize\nWhen every child is born another shot is fired\nHow many hours is left before the clock expire?\nI'm bothered by it, and placing the bricks instead of sound\nWondering how to move a nation of millions\nBecause they ain't felt the bass in a minute\nEvery minute hip hop is ever so patiently waiting to get it\nTake a look into the sky and see 'em scraping the buildings\nOr look into the mirror, see the face of resilience\nMy heart and frustrations is in it, when I spit it it's vintage\nSo molded into my own image, yeah\n\n[Hook]\nCome together\nOne thing I can tell you is you got to be free\n(Move a nation of millions, it ain't hard to tell)\nOne thing I can tell you is you got to be free\n(Move a nation of millions, it ain't hard to tell)\nOne thing, one thing I can tell you is you got to be free\n(Move a nation of millions, it ain't hard to tell)\nOne thing I can te-te-tell you is you got to be free\n(Move a nation of millions)\nCome together right now\n(Bri-bri-bridging the gap, yeah)\nCome together right now\n(Bri-bri-bridging the gap, yeah)\nCome together right now\n(Bri-bri-bridging the gap, yeah)\nCome together right now\n(Bri-bri-bridging the gap, yeah)\n\n[Verse 2: Zumbi]\nUh, a sick cycle where we living revolved\nLike we're one step away from forever sleeping tomorrow\nFighting for pieces of hog, my [?] is scarred\nHard to be godbody, niggas body your squad\nGo against all laws, turn up the pressure from the neck up\nIt ain't all good, the hood really need a checkup\nThe blood and the veins, it seems it long ago changed\nAll addicted to riches, fame is a cold game\nDopeboys and rappers, that's the role models\nMy soul feel hollow, there is no tomorrow\nWe need to come together like X and King\n'Fore we live another day all vexed in [?]\nI got a sixth sense, homie, 'cause I'm blessed with this\nRoots crew and Zion I Official messengers\nBut when the stress it get too much it might bust\nPut the pain down, player, get together with us, yeah\n\n[Outro]\nCome together right now"}], "artist": "Black Thought"}