{"songs": [{"year": "2016-04-22", "lyrics": "[Intro: B.o.B & Police Officer]\nHow you doing sir?\nHey how you doing?\nGood. Real quick man, reason why I stopped you, you know it's a 55, you're doing 91\nUh, I-\nWhat's the hurry man?\nI'm taking my girl out on a date tonight\nYou don't got any more marijuana in the car do you?\nNah\nNo, you smoke it all?\nYup\nAlright, what I'm gonna get you to do, is just uh, don't- don't touch that gun, alright man?\nAlright\nWill you just step on out here real quick with me, okay?\nAlright\n\n[Hook]\nI don't make the rules\nI just break the rules\nBest stay in tune\nCause I'm breaking news\nI pay my dues\nI done paid my dues\nCan't tell me shit\nDon't know you dudes\n\n[Verse 1]\nI'm so Un-Traditional, you so regular, you so basic, you so unoriginal\nNot a second go by that I'm not offending you\nThey say \"Bob ain't Hip-Hop\" I don't know why, I guess it must be the stage name\nNow put me on the track with any M.C., motherfucker know you better bring your A-Game\nAnd they say I need to clean my lyrics, to a child it sounds suggestive\nOkay, I do that when the fucking government stops harbouring child molestors\nIn a time when you could be face down arrested, and get shot if you sound aggressive\nAnd here I go\nTrying to break through to the troubled youth but I guess I can't cause your child was sheltered\nHow protective is too protective\nHow neglected is too neglected\nHow every year it's a new Flu Epidemic\nHow every year it's a new terrorist group with nuclear weapons\nCan't be coincidental, orchestrated like an instrumental\nIf you use your mental, life ain't complicated, this shit is usually simple\n\n[Hook]\nI don't make the rules\nI just break the rules\nBest stay in tune\nCause I'm breaking news\nI pay my dues\nI done paid my dues\nCan't tell me shit\nDon't know you dudes\n\n[Verse 2]\nOwe you shit? I don't owe you shit\nAnd you know that shit, and you know that shit\nI won't Coexist with no bogus bitch\nPoof, be gone, Hocus Pocus bitch\nGot no time for clown ass niggas\nChatty Patty full of gossip niggas\nWord on the street, you a bottom nigga\nOld private party illuminati member\nBobby don't give no fucks, oh no\nTalk all that shit on the photo, Top all that shit on the timeline\nWhen they see me they still want a photo\nI call that free promo\nThis shit is amazing, this is the awakening\nHistory in the making\nThey want me to behave but I can't cause I can not be bought\nThere is not a journey that can not be sought\nI plan to embark\nIs there light at the end of the ship (?)\nHow can we evolve?\nA nation of children that can not be taught\nThey say this shit is just cannabis talk, but without it my thoughts are just crammed in a vault\n\n[Hook]\nI don't make the rules\nI just break the rules\nBest stay in tune\nCause I'm breaking news\nI pay my dues\nI done paid my dues\nCan't tell me shit\nDon't know you dude\n\n[Outro:]\nNo ticket?\nNope\nAw\nPraise the lord!", "title": "Break the Rules", "album": "E.A.R.T.H (Educational Avatar Reality Training Habitat)", "image": "https://images.genius.com/288c59f28a4e9c1559eae1f7558abb79.600x600x1.jpg"}], "artist": "B.o.B"}