{"songs": [{"lyrics": "[Intro: Jay-Z]\nYeah, I know you just ripped the packaging off your CD\nIf you like me you reading the credits right now\nIf you in your car, I don't care if it's winter\nI want you to put all your windows down\nZone out, buckle up, let's go\n\n[Verse: Jay-Z]\nHello it's Hova; that's right young'un the wait is over\nThe new millennium is upon us, the album is here\nBefore we get into the shit, let's get a few things clear\nRappers with no relation:\nThere's \"Seven Degrees of Separation\" and I'm Kevin Bacon\nThis is the murderer's version\nJigga the shit, even when he rhyme in third person\nHova the God, I should be rapping with a turban\nHaters can't disturb him, waiters can't serve him\nMike Jordan of rap, outside Jay working\nNow watch how quickly I drop 50\nI don't like playing, niggas can't stick me\nNiggas can not jam me, niggas can't get me\nSlimmy at the Rucker wanna leave and spend with me\nI consistently take em out the park like Ken Griffey\nDo you believe? It's Hova the God\n\n[Outro: Pain In Da Ass]\nMakes you think about the people in your life\nThen I think about BIG; what'd he say if he was here\nHe'd say, \"Jay, what's it about? What's life about?\nIf you don't go through as a man's a man\"\nHe'd say, \"Suck it up, take the fall, do the time\nThat's what makes you who you are, makes you what you are\"\nHow many years you been around this thing of ours?\nCommission, 125 years\nWhat's it about?\nIt's about rules, parameters\nYou take the beating for the friend you don't lay down\nYou don't betray who you are, what you are\nYou gotta remember guys like Taj, Chill, Ran, Emory\nThey don't roar, they don't rap\nYou know why? That's the rules, you don't break them\nYou was born to be something I wasn't even supposed to be.. humble\nOkay so you humble me now, what you got?\nYou got a war, you got global war\nYou got a worldwide crime syndicate now\nThere's no rules, there's no parameters, there's no feelings\nThere's no feelings for this game\nSo.. five ten years from now\nYou're gonna wish there was American Commission\nFive ten years from now...\nThey're gonna miss Jay-Z\nOKAY, I'M RELOADED!", "title": "Hova Song (Intro)", "image": "https://images.genius.com/16c23bf8d7a8a73a71d30d2ec47600b1.1000x1000x1.jpg", "year": "1999-12-28", "album": "Vol. 3… Life and Times of S. Carter"}], "artist": "JAY-Z"}