{"songs": [{"title": "Victory Lap", "lyrics": "[Intro]\nI don’t know, you know\nIt’s just, it’s just missing something you know\nI just wouldn’t be the same\nIt wouldn't be the same without\n(IV League papa) yeah\n(IV League papa) yeah\nYeah that’s what it was\n\n[Verse 1]\nNow we the main attraction they clap for us\nWaiting on my downfall ground floor up, that’s elevator action\nMichael Jackson couldn’t be as dangerous, shit happens\nArmed with the paint brush, hope you get the picture\nVeins full of bad blood, brrruh, Tswak' Stick 'Em\nWhat you favourite rapper used to be before the bitches\nBut that’s until we following the riches\nTake it back to the kitchen\nLike I got motswako ad-libs to my vision-e\nBig dreams in me ever since I was a pikinini\nSo you gotta use the big screen when you picture me\nHa! Kini Big Deal\nSee the tyres rotate like a windmill\nAnd I will never loose focus, cry me a river swag trip a ocean\nMotherfucker came a long way, ones and twos on IV League all day\nYet summer is still a long way, marathon I run this shit at my own pace\n\n[Pre-Hook]\nHow many rappers in the world right now\nHate it that none of them do it like I\nNever get enough, never get enough, never too much\nV. I .C .T. O .R. Y\n\n[Hook]\nHands up for my victory lap\nHands up for my victory lap hey\nToast to the winners\nHands up for my victory lap\nHands up for my victory lap hey\nIf you know you’re a winner\n\n[Verse 2]\nParty don’t stop till I say so\nWant it all from the ground floor to my angels\nDaddy Cool Diesel, heavy weight champ of the people\nFuture looks bright like casino lights\nWanted that seed ‘til my tree grow high\nRoot of all evil, spare no ego\nI keep haters on their toes like Da L.E.S. does\nBlowing notes like my name Kwela Tebza\nYou in the club acting all famous\nNobody even know what your name is\nPlenty bottles but nobody’s at your table\nHe is on the phone talking like some bloody agents (Yeses!)\nParty like I’m a rock star, tell a girl drop it low like a sports car\nI’m the king who these jokers in my court yard\nMoney talks, I converse with the all stars\nSo you all about my paper\nTell me something new, tell me something entertaining\nTell me something true, tell me nothing about failure\nServing rappers on some 24hour a day shit\n\n[Pre-Hook]\nHow many rappers in the world right now\nHate it that none of them do it like I\nNever get enough, never get enough, never too much\nV. I .C .T. O .R. Y\n\n[Hook]\nHands up for my victory lap\nHands up for my victory lap hey\nToast to the winners\nHands up for my victory lap\nHands up for my victory lap hey\nIf you know you’re a winner\n\n[Verse 3]\nGimme that old time feeling (what else!)\nGerman automobile with no ceiling (what else!)\nPush the button and start with no key ring (what else!)\nBad chick and a blunt with no seedlings (what else!)\nYou can still have what you want if you a dreamer\nStart thinking out the box, or follow the leader\nHa ... haven’t you been through that\nFeel like end of the season when your team do bad\nBut all I really need is a clean new pair\nSomebody on my arm and some money in my hand\nThat be good, you see the hunger in my eye lids\nWhether we ball or checking out prices\n\n[Pre-Hook]\nHow many rappers in the world right now\nHate it that none of them do it like I\nNever get enough, never get enough, never too much\nV. I .C .T. O .R. Y\n\n[Hook]\nHands up for my victory lap\nHands up for my victory lap hey\nToast to the winners\nHands up for my victory lap\nHands up for my victory lap hey\nIf you know you’re a winner", "year": null, "album": "Altar Ego", "image": "https://images.genius.com/04dba2cb161f7bd426cc0ca9e52a2d54.1000x1000x1.jpg"}], "artist": "AKA"}