{"songs": [{"image": "https://images.genius.com/ec22aedd2f613e78dc311b5c11b58dd1.400x401x1.jpg", "title": "Danny Glover (Remix)", "album": null, "year": "2014-01-28", "lyrics": "[Intro: Nicki Minaj]\nI got somethin' for you lookin'-ass niggas\nWeek and a half, I'ma be in that ass... pause\nIt's like I'm working on an album and a mixtape at the same motherfucking time!\n\n[Pre-Hook: Young Thug]\nOkay, cool, okay, bool, I love her\nI'ma save her, yes, like Danny Glover\nI'ma call my partner 'fore I fuck her mother\nI pass them a molly, now they kiss each other\n\n[Hook: Young Thug]\nEvery time I fuck I gotta hit me least like two bitches\nFor that dope he whipped, you need a new wrists\nForeign car outside, that bitch got two digits\nMoney stand like eight feet just like two midgets\n\n[Verse 1: Young Thug]\nWho the fuck told you\nThat Young Thugger Thugger don't fuck up the beat?\nI got six cars and I also got rentals and all of 'em tinted\nNo, I'm not Nipsey, not from L.A., but I got keys to the city\nI fuck it, I suck it, I beat it down, then she beat me to the ceilin'\nStoner my lifestyle, I'm livin' too wild\nI came to make you proud, that money keep her around\nIn love with her head, I can't turn it down\nCan't wait for my time to come back around\nShe see that you don't got Lil Haiti's style\nPlus I just seen Snoop on Girls Gone Wild\nI just bought a Bentley and a bitch came with it\nYoung rich nigga hittin' million dollar licks\nBalling in New York like a motherfucking Knick\nYou better have them racks, you ever want to hear me spit\nAnd everywhere I go I got a pass like the staff\nI'm goin' off top like a motherfuckin' layup\n357, six shots like Al\nI left ten bands in a motherfuckin' cab\n\n[Pre-Hook: Young Thug]\nOkay, cool, okay, bool, I love her\nI'ma save her, yes, like Danny Glover\nI'ma call my partner 'fore I fuck her mother\nI pass them a molly, now they kiss each other\n\n[Verse 2: Nicki Minaj]\nEvery time I come out, I ain’t ever with no new bitches\nThese bitches is stealing, I'ma sue bitches\nDripping down his dick, this pussy too vicious (vicious)\nEvery time I fuck him, I say \"Whose is it?\"\nYo! Who the fuck told 'em that, \"They was like Nicki? Oh no, bitches didn't!\"\nI'ma give bitches a minute of shine, then I'll tell 'em good riddance (good riddance)\nTo raise a child, it might take a village\nBut I wouldn't know, cause these bitches my sons\nYes, they was, and they still is\nGave him the kitten, now that nigga smitten\nTold him to hop in my foreign, and then I said, \"No, I'm just kiddin'!\"\nHell of a livin', you bitches on chitlins\nWhen I come out of my mansion, I sprinkle some bread to the pigeons\nB-b-b-b-but, bitches is lyin', they lyin', they lyin', they lie in they bio\nSo I ain't fuckin' with chickens unless I got pico de gallo\nGirls is plottin', what more could they steal?\nTell Justin Timberlake, that I am comin' for Jessica Biel\nBitch, I'm a star-rah, you niggas, I holla tomorrow\nDoors go up, 'cause I am too rich to cop a Gallardo\nNo regular doors, on Aventadors\nPainted it pink, just so I could take pictures, while you rented yours\nH-H-H-Hell of a ticket, h-h-h-h-hell of a price\nI want it, I get it, I wire the money, I never think twice\nI am not gay, but let's be precise\n'Cause if she pretty then watch it, 'cause I'ma be fuckin' ya wife\n\n[Hook: Young Thug]\nEvery time I fuck I gotta hit me least like two bitches\nFor that dope he whipped, you need a new wrists\nForeign car outside, that bitch got two digits\nMoney stand like eight feet just like two midgets\n\n[Verse 3: Young Thug]\nI knew I was gonna run my money up and everybody didn't\nAll these niggas pussy niggas, tellin' on they partner\nHope the pussy nigga get a bigger sentence\nPussy nigga play, I'm coming back with the K\nAnd I'ma shoot that motherfucker 'til he livid\nBitches wanna see a nigga thumb through it fast\nI'ma name myself Young Thugga tenant\n100 bands at a time, I fronted you bands, but you\nI don't like using profanity but the Young Thugger will cut you\nAll of my cups are muddy, I fuck my bitches' buddies\nI just want nut like Buddy, all of my bitches buddies\nPanamera with the tinted roof, all the niggas' dogs goin', \"Roof\"\nTop notch shawty, nigga ring came with karats\nYoung nigga rich, jewelry colder than the attic\nIf she ain't a virgin then that bitch is only average\nI can't even hear ya, baby, get rid of the static\nI can't learn a bitch, but I learned mathematics\nI just ball her down whenever she call my pattern\n\n[Pre-Hook: Young Thug]\nOkay, cool, okay, bool, I love her\nI'ma save her, yes, like Danny Glover\nI'ma call my partner 'fore I fuck her mother\nI pass them a molly, now they kiss each other\n\n[Hook: Young Thug]\nEvery time I fuck I gotta hit me least like two bitches\nFor that dope he whipped, you need a new wrists\nForeign car outside, that bitch got two digits\nMoney stand like eight feet just like two midgets"}], "artist": "Nicki Minaj"}