{"artist": "Andre Nickatina", "songs": [{"title": "Muthafucka", "album": "I Hate You With a Passion", "year": "1995-04-19", "image": "https://images.genius.com/caf6d8331e5ef8bd79cb75fa64fb6144.1000x1000x1.jpg", "lyrics": "(Dre Dog)\nMuthafucka so I heard you like to run your mouth\nBut eat this rhyme so you can taste what I'm a talk about\nThat sewer rat mack in black is back\nDre Dog in your dome lacin' caine wit' my dank sack\nYou get change for my respect silly muthafucka\nCome closer and get served like a dirt clucker\nWit' a mind the find of Al Capone\nBut with the gift to manip like Jim Jones\nBut muthafucka I will clown and insult ya\nAnd when you die, feed off you like a vulture\nCuz' in the streets there ain't no love so nigga fuck peace\nI break your jaw and have you chokin' on your wisdom teeth\nSix-six two-twenty not a Tommy Tucker\nYou don't like me I ain't scared of you muthafucka\nCuz' I can get racist like the Ku-Klux-Klan\nCall you Kunta Kintae then whup yo ass!\nGame exposed on the whole damn institute\nMuthafucka's get chewed like Juicy Fruit\nUhh, fools get smacked wit' the back of my hand\nNigga's get crushed like aluminum cans\nMr. Jim Jones and it just don't quite\nFillmore for life and I will fuck yo Bitch!\n\n(Cougnut)\nI'm tired of these muthafucka's talking lip\nOn who's down while I might waste a lyric clip\nTo your dome watch it bust little chumps\nBrains on my chest from the blast of that lyric\nCoughing up blood now your dead and nee a witness\nExecute rapper's of the charts is my business\nIt don't really matter if it's him or if it's her\nDecapitating bodies on my list like Jeffrey Dalmer\nSerial style murders jumpin' off on my stutter step\nGotta keep it gruesome, keep it bloody to maintain my rep\nTales of the Crypt\nIt got sick, smell the body funk\nSights on crucial make Jason look like a punk\nMC's on freeze on they knee's sayin' please\nBustin at they ass to these fools not breath\nI don't know why these muthafucka's wanna fuck wit' me\nCheck your tails runnin' up on this N-U-T\nI don't really care battle anywhere hard!\nMutalate your body when we battle pick a graveyard\nThats were you goin when I flow and when I rap\nFucked off diesel! Take a dirt nap\nRock a mic gotta go, you don't feel me do'\nFucked off D so when you step to the rock ho\nRottweiler attackage, when I'm locking on your fuckin' neck\nDon't other nathin', cuz' I take respect\nTalkin' that shit, so listen to ya holla\nFake-ass rapper gettin' sicked on someones rottweiler\nMUTHAFUCKA!!!"}]}