{"artist": "Yukmouth", "songs": [{"album": null, "image": "https://images.genius.com/fe4ce80636a153d477eafc54f843fd09.900x900x1.jpg", "year": null, "lyrics": "-=Yukmouth Talking=- (Girl)\nMan, hey you ever had a mother fuckin' wet dream man?\nThat shit is crazy man (Dreams of fuckin' an industry bitch)\nFuckin' dreams man\nFuckin' these industry bitches man (Dreams of fuckin' an industry bitch)\nIn my dream these bitches ain't about shit though\nYou feel me, oh boy\n\n(Yukmouth)\nI fucked 'em all from models to center folds\nTo rented hoes in videos\nBitches in thinner clothes\nI used to wanna fuck the leader of En Vogue\nBefore the Benzo when I was 10 years old\nNow I wanna fuck Free\nTake her from A.J. and Luda\nStick a dick through her\nPipe her down like Rotor Rooter\nMake the bitch maneuver\nMy jewel'll keep me iced out like Rick the Ruler\nThen I fuck J.Lo, Trina, Beyoncé\nAll in a ménage\nOff X and broccoli\nAnd I got Missy ass waitin' in the hallway\nI'm not a minute man fat bitch\nI fuck all day\nI take Sadé\nGet head on the highway\nThen fuck that little Mexican bitch from \"Next Friday\"\nI take Tyra Banks from Chris Webber\nAnd fuck her and Vivica Fox both together\nWest Coast forever\nNow what's fuckin' wit that?\nI need gangsta love\nSo I fuck even Da Brat\nAlicia Keys in the back\nSuck dick 'til they knee's get scratched\nThen pull they head 'til they weave detach\nWhat\n\n-=Yukmouth Talking=- (Girl)\n(Dreams of fuckin' an industry bitch)\nMy dreams be crazy man\nLast night I fucked Whitney Houston (Dreams of fuckin' an industry bitch)\nAnd slapped the shit out of Bobby Brown\nThat nigga still had that thizz face\nHe crazy\n\n(Yukmouth)\nMack 10 better watch his bitch (Watch your bitch)\nLittle Usher better watch his bitch (What your bitch)\nRest in peace Left Eye the shit\nI make Chili and T-Boz both slob the dick shit\nI like Lauren but I hate Wyclef\nI take his singin' bitch Claudette and fuck her in the Lex\nNext Pamela Lee wit her big ass breasts (Whoa)\nI fuck the bitch since she like rough sex\nThen fuck MC Lyte since she like a rough neck\nThen take that bitch Jada Pinket from the Fresh Prince (Faggot)\nWhen I was young I had a crush on Whitney\nNow I wanna fuck Christina Aguilera and Britney (Fo sho)\nAnd Shakira since she dance like a gypsy\nGet 'em tipsy and make 'em all give me Lewinsky whoa\nI fuck Janet Ms. Jackson if ya nasty\nRay J my nigga but I'll still fuck Brandy\nIf I fuck ya daughter I'll be wit the family\nDown wit Quincy Jones\nThe nigga prolly win a Grammy\nThen fuck Rachel fine ass in Miami\nThat's why the whole BET staff can't stand me\n\n=-Yukmouth Talking=-\n(Dreams of fuckin' an industry bitch)\nOh yea man\nI can't forget my drankin' potna Mary J. Blige man\n(Dreams of fuckin' an industry bitch)\nShe suck a good dick in them dreams man\nBig ass lips\nOh Boy!\n\n(Yukmouth)\nEven if it's Dre Day\nI'll still fuck Michelle'le\nTake Lisa Ray bust a nut on her belly\nHit Mya on the celly\nKnock her up in the telly\nAnd I'll still fuck Kelly even though she fuck Nelly\nI'll fuck Vita\nShe could be my murder mami\nGet sucked from Charlie Baltimore\nAnd then fuck Ashanti\nEx Destiny Child\nI still love Farrah\nFuck her in the Porsche Carrera\nMake her get her shit together\nThen I take Pink, Tweet, Lil' Kim and them\nFuck Mariah so good that she forget Eminem\nDon't fuck Foxy cuz I heard she fuck him and him\nFuck Ms. Jayda 'til she scream \"Fuck Timbaland!\"\nMe and Halle Berry go half on a baby\nI take strings from Baby\nAnd dick her down crazy (That's right)\nThen I take Madonna wit her crazy ass\nAnd Stacy Dash\nThen fuck 'em in the back of a Jag (Sheees!)\nAnd take 702 and 3LW\nAnd have a 5 way ménage at The W (jeah)\nWhat you wanna do (jeah)\nWhat you wanna do (jeah)\nWhat you wanna do (jeah)\nBitch what you wanna do\n\n-=Yukmouth Talking=- (Girl)\n(Dreams of fuckin' an industry bitch)\nMy dreams be the shit playboy\nI'm tellin' you man\nI took that bitch Kelis from Nas (Dreams of fuckin' an industry bitch)\nYou know what I'm sayin' It's nothin'\nThat nigga ain't no pimp in my dream you feel me\n(Dreams of fuckin' an industry bitch)\nI'mma tell you who suck a good dick in my dreams\nThat bitch the Truth Hurts\n(Dreams of fuckin' an industry bitch)\nEven though these my home girls\nThey still give me good head\nLil' Mo and Faith\nI love y'all both\nY'all got good head in them dreams whoa\nLet's make this reality baby\nHolla at ya boy at the Grammy's shows\nOr wherever you see a nigga at Oh Boy!\nThat's all it takes son you feel me\nThese is dreams though\nDon't get offended\nNo niggas, no bitches\nIt's fantasy man\nDon't get mad cuz you got a bad bitch\nOh Boy!\n(Dreams of fuckin' an industry bitch)\n(Dreams of fuckin' an industry bitch)", "title": "Wet Dreamz"}]}