{"songs": [{"year": "2018-05-04", "image": "https://images.genius.com/b6424d6ad1ab459f68bef7045b421240.1000x1000x1.jpg", "title": "Outro", "album": "SIMI", "lyrics": "[Intro: Five Stairsteps & Lil Juice]\nOoh-oo child, things are gonna get easier\nOoh-oo child, things are gonna get easier\nTay Keith! Fuck these niggas up!\n\n[Verse: BlocBoy JB & Five Stairsteps]\nI'm having visions in my head, (ooh-oo child) thinking 'bout me being dead (being dead)\nAll fucked up, down bad on my ass again (ass again, things are gonna get easier)\nLost so many niggas, (things are gonna get easier) man it feel like we in Pakistan (Pakistan)\nOr maybe Afghanistan (Afghanistan)\nMan I hate to lose my mans (that's on my mama)\nLost some niggas to that gunfire (to that gunfire, ooh-oo child)\nRest in peace to Simi, why you had to die? (RIP ya, RIP ya, things are gonna get easier)\nI load up my semi and shoot gunfire (I shoot gunfire, things are gonna get brighter)\nAnd it's fuck the other side 'til I see you on that other side\nWhen I lost C-Rock, man that shit felt like my brother died (ooh-oo child)\nI was outside (outside, things are gonna get), P-95, I had to let it ride (let it ride, easier)\nRest in peace Bo-40, I just copped a forty (I just copped a forty, ooh-oo child)\nI up with my forty just to get him off me (just to get him off me)\nRest in peace Ja Freezer and Lil Thump, we gon' ride out (ride out, ooh-oo child)\nHey, I don't take that easy, pop the trunk, let's go hide out (rrah)\nMy B's brought the hive out (hive out), I'm Crip but brought the fives out (the fives out)\nFully loaded, sauce like ravioli, with my nine out (with my nine out)\nIt's Bloc (ooh-oo child)\nYeah, hah, hah, hah (things are gonna get easier)\nYeah, yeah, yeah (ooh-oo child, things are gonna)\nGet brighter (get brighter), hey, hey\nFree Jaylen (free Jaylen, ooh-oo), free Lot (free Lot, child)\nWhat ya saying? (what ya saying? things are gonna get), free the block (free the block, ooh-oo child)\nCaught your man (caught your man, things are gonna get brighter), in the van\nNow he need an ambulance (ambulance)\nBroke niggas don't stand a chance, broke nigga, get some bands\n\n[Outro: BlocBoy JB & Five Stairsteps]\nFree Jaylen, free lot (ayy, ooh-oo child)\nWhat ya saying? (ayy), free the block (things are gonna get easier)\nLadies and gentleman, I wanna y'all to count with me (ooh-oo child)\nFree Jaylen, free lot (ayy)\nWhat ya saying? (free my motherfuckin' niggas),  free the block\nJust wanna speak forward to you guys, ayy (free the block, ooh-oo child, things are gonna get easier)\nAy, I got the soul (ooh-oo child, things are gonna get brighter), I got Fourth in this motherfucker mane (free my motherfuckin' niggas)\nGot Nunu (ooh-oo child), motherfuckin' CB (yeah, things are gonna get easier)\nYou got Blocboy JB (yeah, ooh-oo child), don't play me (that's me, that's me, things are gonna get brighter)\nTabo is a ho and it's on G (God), O-D (D, ooh-oo child)\nOoh I got my fingers crossed, I'm lyin' (things are gonna get easier)\nI'm flyin' to another fuckin' country (things are gonna get brighter)\nGot your bitch, and she callin' me country\nBitch I'm from Memphis, been gettin' it, I don't give a damn (ooh-oo child)\nFuck up on your bitch, and I'm fly like I'm Peter Pan (yeah, yeah, yeah, things are gonna get easier)\nYeah, yeah, yeah, yeah, yeah, yeah (ooh-oo child)\nYeah, yeah, yeah, yeah, yeah, yeah, yeah, yeah\nAnd I put your Benz to the bed (ooh-oo child), right now, ho (things are gonna get easier)\n'Cause this the motherfuckin' outro (ooh-oo child, things are gonna get brighter)\nThis the fuckin' outro, ibby-ibby-outro\nOutro, ibby-ibby-outro (ooh-oo child)\nUh-uh-uh-uh-uh, uh-uh-outro (things are gonna get easier)\nHah, hey, I'm turnt, you know what I'm sayin'? (ooh-oo child)\nHey, hey, hey\nAlright nigga I made it, ooh, hey, ibby-ibby outro, ooh, ooh, ibby-outro"}], "artist": "BlocBoy JB"}