{"songs": [{"image": "https://images.genius.com/bfd5b295c4625e047172ee9ed359e213.426x426x1.jpg", "year": null, "lyrics": "I need a dollar, dollar, a dollar is what I need, hey, hey\nWell, I need a dollar, dollar, a dollar is what I need, hey\nHey\nSaid I need dollar, dollar, a dollar is what I need\nAnd if I share with you my story would you share your dollar\nWith me?\n\nBad times are coming and I reap what I don't sow, hey, hey\nWell, let me tell you something, all that glitters ain't\nGold, hey, hey\nIt's been a long old trouble, long old troublesome road\nAnd I'm looking for somebody, come and help me carry this\nLoad\n\nI need a dollar, dollar, a dollar, that's what I need, hey\nHey\nWell, I need a dollar, dollar, a dollar, that's what I need\n\nWell, I don't know if I'm walking on solid ground\n'Cause everything around me is falling down\nAnd all I want is for someone to help me\n\nI had a job but the boss man let me go, he said\n\"I'm sorry but I won't be needing your help no more,\" I said\n\"Please mister boss man, I need this job more than you know\"\nBut he gave me my last paycheck and he sent me on out the\nDoor\n\nWell, I need a dollar, dollar, a dollar is what I need, hey\nHey\nSaid I need a dollar, dollar, a dollar is what I need, hey\nHey\nAnd I need a dollar, dollar, a dollar is what I need\nAnd if I share with you my story, would you share your\nDollar with me?\n\nWell, I don't know if I'm walking on solid ground\n'Cause everything around me is crumbling down\nAnd all I want is for someone to help me\n\nWhat in the world am I gonna to do tomorrow?\nIs there someone with a dollar that I can borrow?\nWho can help me take away my sorrow?\nMaybe it's inside the bottle, maybe it's inside the bottle\n\nI had some good old buddy, his names is whiskey and wine\nHey, hey\nAnd for my good old buddy I spent my last dime, hey, hey\nNow wine is good to me, it helps me pass the time\nAnd my good old buddy whiskey keeps me warmer than the\nSunshine\nHey, hey\n\nYour mama may have missed, a child has got his own, hey, hey\nIf God has plans for me, I hope it ain't written in stone\nHey, hey\nBecause I've been working, working myself down to the bone\nAnd I swear on grandpa's grave, I'll be paid when I come\nHome, hey, hey\n\nWell, I need a dollar, dollar, a dollar is what I need, hey\nHey\nSaid I need a dollar, dollar, a dollar is what I need, hey\nHey\nWell, I need a dollar, dollar, a dollar that's what I need\nAnd if I share with you my story, will you share your dollar\nWith me?\n\nCome on, share your dollar with me\nGo ahead, share your dollar with me\nCome on, share your dollar, give me your dollar, share your\nDollar with me\nCome on share your dollar with me", "title": "I need a dollar - radio mix", "album": null}], "artist": "Aloe Blacc"}