{"songs": [{"year": "2010-12-18", "image": "https://images.genius.com/9983525b0673afa54ec17cd72f3602f5.500x500x1.jpg", "title": "Briatore (Extended Version)", "album": "Hoodtape Volume 1 X-Mas Edition", "lyrics": "[Intro]\nYeah, was das? Gute Laune Beat oder was?\nYeah, Yeah, Yo, Heeey\n\n[Part 1]\nEy, ich parke vor deinem Haus im amerikanischen Sportwagen\nDu sagst: \"Halt Ilayla!\" Ich sag zu dir: \"Lass se!\", als hättest du'n skandinavischen Vornamen\nEy, als hätt'st du skandinavische Vorfahren\nUnd du läufst gelb an wie Asiaten bei Sportarten\nWie Weitsprung, Dreisprung, Hochsprung und Speerwerfen\nIch hol' zum Dessert gerne Joghurt mit Erdbeeren\nUnd sahnigem Milchkaffee\nWidme mich dann deinem Girl und lande 'nen Stich, wie der Privatjet von Michael\nIch komm aus dem Hotel, steig auf die Kawasaki\nFlüchte vor den Kameras der motherfuckin' Paparazzi\nMache Deals klar am Handy\nDu Eselficker, deine Sexualpartner machen \"I-ah!\" wie Nelly\nEy, ich hock' im Loft, Briatore kommt vorbei um was dazu zu lernen und\nEy nach einer Woche mit dem Boss\nIst der alte Knabe jetzt in Sachen Luxusgüter auftürmen\nUnd Schampusflaschen ausschlürfen unterwiesen wie Maulwürfe\nIch mach' 100 Riesen, verkauf' Purple Haze am Block\nKomm' bei dir rein, während du mit dein' Kifferfreunden Playsi zockst\nUnd zieh' dich ab, schlag' dich blau, klau' dann dein Porte­mon­naie\nUnd hau' ab nach draußen, lauf' durch den lauwarmen Sommerregen\n\n[Part 2]\nIch geh durchs Rotlichtviertel, das Farbenspiel der Neonlampen\nSpiegelt sich in Pfützen, ich zieh den Kragen von meinem Regenmantel hoch\nGeh dann zur Wohnung deiner Mom und klingel penetrant\nSie öffnet, begrüßt mich mit off'nen Armen wie ne Hero-Schlampe\nYeah, mit offenen Armen wie 'ne Emo-Schlampe\nIch sage kein Wort, nehm' sie durch, bezahle sie und gehe dann ins Sonnenstudio\nEy und bei Rendezvous' mit Hoes\nMusst du nur ständig denken: „Was würde der Boss jetzt tun?“\nUnd schon klappt's auch mit der Nachbarin, es ist der Hustlerking im Muskelshirt\nDu guckst empört, ich komm in deine Hood gestürmt\nDein Schmuck gehört jetzt mir\nIch nehm alles was Gold ist und glitzert\nUnd hau ab durch das donnernde, blitzende Sommergewitter"}], "artist": "Kollegah"}