{"artist": "Boogie", "songs": [{"album": null, "title": "Fade (Freestyle)", "year": "2018-10-02", "lyrics": "[Intro]\nFade away...\nFade away...\n\n[Verse]\nI been livin' on the edge (woah)\nI been livin' off safety\nI just pocket dialed god\nI think he heard me talk crazy (woah)\nI been swimming for a minute\nI see niggas actin' fishy\nI got bitches tryna bait me\nI know my eyes keep flinchin cause\nI keep on havin' visions of a nigga tryna play me\nGotta give me a 380\nI already lost my lady\nI can't let somebody do me shady\nThat's just somethin' I can not do\nI know that pussy feels good\nNot as good as the pussy from the girl that really got you\nLook at how they got you\nShoutout to the dudes on my side I respect\nI could name on the hand, shit it's only just a few\nAnd shoutout to the line that they better never cross\nIf that energy get off, know that they can get it too\nThe homie's still a fool, I'm actin' like it's cool (shit)\nWho am I to judge to say that he ain't livin' right?\nCause when I think about it when he ride with that strap on his lap\nOnly showin' that he care for his life\nHell hurt more knowin' with everything I give\nIt's a chance that the best of me might even get killed, no\nHell hurt more knowin' I gotta live here, shit\nAnd it's a possibility that heaven ain't real\nCan you think with your eyes?\nCan you see with you mind?\nDo you see me as blind?\nAll my genes don't define, but the steam that's inside\nFuck a crease I done peeped this a wrinkle in time\nAnd rest well Lil Peep, that depression shit is real\nBetter check up on your peeps\nI ain't even hit my peak\nMan I wanna drop my album every week\nShit, I might just be the reason why I leak (oh shit)\nGot me tellin' you I'm pressed when you tell me that I'm next\nGot me tellin' bout my growth when I tell you bout my ex\nGot me tellin' you so much, shit I'm runnin' out of breath\nAw man\nWe done fractured your hopes and your wounds still look open\nDon't cast me away just embrace what's been broken\nI'm showerin' regret you should bathe in the moment\nAw man\nI had to pray today that I don't fall off by nighttime\nAnd tomorrow I don't fade away\n\n[Outro]\nFade away...", "image": "https://images.genius.com/df2a27b9bc740c4a60548a743cf0589a.640x640x1.jpg"}]}