{"artist": "Ace Hood", "songs": [{"title": "2-12-12 (Thoughts)", "album": "Starvation", "year": "2012-03-30", "lyrics": "[Intro]\nR.I.P Whitney Houston\nGod bless her soul\nI’m just vibin’ though\nBut for you haters\n\n[Hook]\nNothing’s gonna stop me\nI swear to god\nNothing’s gonna stop me\nAndy, Kiko, Renegades\nNothing’s gonna stop me\nNothing’s gonna stop me\n\n[Verse 1]\nMoney talks so what’s your conversation?\nCounting my blesses, my sweet elaborated\nBeing broke ain’t a joke, that feeling is devastating\nNightmare so therefore is never stated\nCalculating every dollar bill\nReminiscin’ they missin’ like someone without a meal\nStill trippin’, this life I’m livin’ the dream still\nLook at my niggas loyalty’s mad real\nThat’s cuz we got this from the bottom up\nRemember slidin’ in my homie momma truck\nWe did what we had to do, we ain’t give a fuck\nNow we the niggas winnin’ though, wuddup?\nAin’t it funny how the time fly?\nCouple cars and a twenty story high rise\nTook a minute but shit connecting like wifi\nAnd fuck you to them niggas who said my career died\nShit, I’m livin’ quite well\nOn the beach I’m sippin’ wine and cracking lobster tails\nWith a Spanish mami give me opposite of tails\nAsk me do I like it papi I’m like hell yea\nWe da best the fuckin’ logo\nJust hope you get the picture when you take your photos\nOwn a couple cars but I need one more though\nPhantom coming soon, real nigga YOLO\nTrue, I’m just vibin' though\n\n[Hook]\nNothing’s gonna stop me\nI tell ‘em: nothing’s gonna stop me\nYea, feel good when you comin’ from nothin’ homie\nBut I tell ‘er: nothing’s gonna stop me\nSwear to god (nothing’s gonna stop me)\nStarvation\n\n[Verse 2]\nIn the studio, watching the Grammy’s homie\nPray today they nominate the one and only\nProlly cry some tears at the ceremony\nOnly lord knows when they ready for me\nInspiration runnin’ through my blood\nMotivated from the fact I made through the mud\nKept my faith although they doubted when I lost my buzz\nAll over somethin’ that I’m winnin’ ain’t gon show me love\nIn the street label me underrated\nStarving for respect my only ultimatum\nThey ask me Hood that’s why you goin’ hard\nCuz I just want my mama off that boulevard\nI come from a city where there ain’t many stars\nAnd given no pity promised them prison bars\nTeachers said I won’t amount a shit\nGraduated high-school, college never went\nStill I manage them seven figures with common sense\nAnd at the age of 52 my mama finally quit\nFuck it right I never stop\nFound a way to motivate them niggas’ blog\nWhitney Houston died yesterday\nGod bless her, hope she end up at them heaven gates\nWatching the Grammy’s just as they dedicate\nIn the mean time, let’s let this marinate\nYea, I’m just vibin’ though\n\n[Outro]\nOh yea (nothing’s gonna stop me)\nAin’t nothin’ gonna stop me man\nNothing’s gonna stop me\nR.I.P Trayvon Martin\nJustice will be served my brother\nBut guess what\nNothing’s gonna stop me\nHold ya head man(nothing’s gonna stop me)\nGod bless\nHood", "image": "https://images.genius.com/ee1f29169e460342b88aa5c8d75ede59.500x500x1.jpg"}]}