{"artist": "Fashawn", "songs": [{"year": null, "album": "Champagne & Styrofoam Cups", "image": "https://images.genius.com/09dcf1a0e7f7a1c4eac047d2fc35bd69.500x500x1.jpg", "lyrics": "[Verse One: Fashawn]\nYeah fatigue and tryin' to say this is what art is\nTrying to find time to kiss my daughter\nI missed the whole first year of her life\nAnd most of the second promoting these records\nGuess me and my father just alike\nWhen I needed him he was off in the night\nAnd my mother he never called her his wife\nWhen he was in prison I never bothered to write\nI don’t know where my personal life ends\nAnd the public one begins\nFuck money got need to make ammends\nWith the brothers I used to call friends\nBaby mothers I would run a pair\nGot me gussling gin, rolling my reefer\nReminiscing stuff on rocks and the soul of my sneakers\nIt was hustle or die, guess I’m living my dreams\nHating the fact I’m in love with the lie\n\n[Hook: Fashawn]\nI’m too proud to beg, too angry to cry\nGot me wondering why? Somebody tell me why\nI’m in love with a lie\nI’m too proud to beg, and too angry to cry\nGot me wondering why? Somebody tell me why\nI’m in love with a lie\n\n[Verse Two: Fashawn]\nSomedays I wake up and I don’t wanna write it\nGo to the lab, everyone’s invited\nYeah, I swear nothing’s exciting\nToday’s never sunny it’s just thunder and lightning\nFighting like I’m rumbling with Tyson\nFor the love of the public got me stuck in this climate\nYeah, wondering why I’m even fucking with rhyming\nSince a younging all the struggle with timing\nAll I need some good weed, some red wine\nYeah, instead of all of these dead lines\nAnticipation, fans sitting, waiting\nKnowing nothing of your man’s situation\nI travel light but the load’s heavy enough\nDone enough, already give up\nWhat I say to myself, but this is what I do\nAt the end of the day, I do it for you, you\n\n[Bridge: Fashawn]\nGot you nigga, news\nGot me sitting confused\nHit the spliff and take a sip with the brew\nNothing coming from my lips but the truth\n\n[Hook: Fashawn]\nI’m too proud to beg, too angry to cry\nGot me wondering why? Somebody tell me why\nI’m in love with a lie\nI’m too proud to beg, and too angry to cry\nGot me wondering why? Somebody tell me why\nI’m in love with a lie", "title": "In Love With A Lie"}]}