{"artist": "King T", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1375378876_King-Tee.jpg", "title": "Bass (remix)", "year": null, "album": null, "lyrics": "(King Tee)\nYo Pooh, let's.. drop.. some..\nBass, to make the walls shake\nAnd vibrate the floor, just like an earthquake\nKing Tee is back again, but with a new topic\nI wouldn't listen too close cause it's toxic\nA new format, complete with the tool\nEven though I transform, I stay cool\nFor me to get taken, how would you figure it\nRight off the bat, if you thought so would be ignorant\nOr just stupid, or cold dumb\nI play lead vocals, Pooh plays drums\nKeith does cuts, suckers get torn but\nI gotta break, here comes the horns..\n\n{*samples and scratches*}\n\nBass, to make your heart shiver\nI know you, remember back when I used to wear silver\nBut I gave it a toss, cause I was told\nThat you're not a real b-boy, without real gold\nSo I, went downtown to see\nHow much is the thirty inch dookie\nIt's quite a bit of money for a big gold chain\nThrow him a thousand then he hand me some change\nAnd now I'm cooler, in other words I got it goin\nSway to the side, while I'm showin a professional skill\nThat I put together with perfection\nI gotta clear my throat, punch in the horn section!\n\n{*samples*}\n\nCause I need some BOOM, to crack the walls\nBreak the windows, shake the room\nWhen I'm done take my photo, this is how it go though\nKing of cool lyrics, and I'm solo\nAs a rhyme preacher, shoulda been a teacher\nLet the bass reach ya, and let it beat ya\nNever givin up cause I persist to be the dopest\nI wouldn't take it as a gag or a joke it's\nSerious, bass drum kickin like a ninja\nYou wanna dance to death, (?) send ya\nIf you say that I'm the coolest I'll probably say \"Truly!\"\nBut at this time I represent Keith Cooley\n\n{*samples and scratches*}\n\nVerse four, the part where I get it off\nThen, try to rush it cause the studio costs\nI mean the main idea is BASS\nAnd you probably get a bruise when it's at your face, so\nDon't get mad or either angry at me\nI'm just a lyricist, and my name's Tee\nThe supreme cool kid who puts life in the mic\nI need bass from a drum, to hell with the pipe!\nCasanova Fly guy, funky fresh in the flesh\nAnd to those who don't you best believe I'm the best\nIf it's fashion I'm flashin, just like the drums\n{\"Hold it now..\" - \".. here it kiddy come comes!\"}\n\n{*samples*}\n\nNow Keith! (Yeah) How you livin homes? (L-l-like, like this..)\nNow everybody in the disco if you're feelin alright\nAnd you know King Tee's the MC of the night\nDon't front, get up, let me know what's happenin\nKeith does the scratchin for the King Tee's rappin\nI'm from Compton though, I travelled the nation\nAnd from every different state I get different condescation\nI'm the {k-k-king..} so just give me some space\nBack up and just let {cool drop that bass!}\n\n{*scratches*}\n{cool drop that bass!}\n{*samples*}"}]}