{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/8ada2910bdaab0ce3196f9ccd706d775.500x500x1.jpg", "title": "Bop Your Head", "year": null, "album": "View From Masada", "lyrics": "[Intro: Killah Priest]\nYea, yea, yea, yea\nYea, yea - fuck that!\nI'm set it off - yea, yea, ya shitted\nYa in some shit now, son\nIt's on now, motherfuckers can suck my dick\nI'm back! Fuck that shit!\nReady to eat niggas up, beat they ass and e'rything, son\nI'mma prove this shit, right here\nMe and my nigga - what!?\n\n[Killah Priest]\nThe emperor, chief sinister, street minister\nGuarenteed in two bars to finish ya\nReact like a cat when he arches back\nGive a fake rapper a heart attack, once I start to rap\nI'm a vocalist, nigga, supposed to rip\nLast Poet's told me this, hit ya in ya head wit my explosive fist\nThen I finish ya off with my tremendous horse-kick\nWhat now, nigga? Look at ya, talk shit\nCan't do it, cuz you ain't got no teeth in ya mouth\nAnd I know ya just tired of me, beatin ya out\nYa trained all year, in a karate class\nIt took one second, to put yo' ass in a body bag\nFrom a shotty blast, I walk up in ya club and ya parties don't last\nI like to pop shit, don't get me started\nI slap y'all motherfuckers like y'all little kids in kindergarten\nSqueeze yo' head till yo' kidneys harden\nNow watch this, I'mma call my whole motherfuckin squadron\nAnd tell niggas to just start robbin\nCuz y'all niggas is fucked up\nAnd Brooklyn niggas is really ready to get ya\nI know how to hit ya, and cut ya open\nBut don't worry, cuz I'mma stitch ya, with a rusty screwdriver\n\n[Hook: Killah Priest]\nNiggas bop yo' heads to this, real shit\nCall up yo' clicks to this, it's realness\nYou feel this in yo' streets and village\nSpare that new shit, Priest killed it\nY! Niggas bop yo' heads to this, real shit\nCall up yo' clicks to this, it's realness\nYou feel this in yo' streets and village\nSpare that new shit, 'bus killed it\n\n[Canibus]\nYo, yo, yo\nYo I'm a Macabeast MC and I possess the ability\nTo run at top speed without bendin my knees\nI destory shit, pin-point asteroids in orbit\nThen, hurl niggas thousands of miles an hour, towards it\nFuckin heathen, wrap my hands around ya neck region\nThen I start squeezin 'til ya stop breathin\nYou weaklins is playin tug-of-war wit ya tongues\nI knock the teeth out ya gums and suck the breeze out ya lungs\nHit ya wit a blow your physical frame could never sustain\nYou'll probably never walk ever again\nNigga, you think you rhyme sick? I leave you lyin stiff\nPut you in a horsemen heimlich til I break ya spine, bitch\nStop cryin bitch, before I hit ya wit the Iron, bitch\nYou can't rhyme bitch, the one triple nine's mine bitch\nThe pain'll make ya voice change octaves\nFrom low-pitched to high-pitched, every hour we kill a hostage\nWe judge MC's by they lyrical fitness\nAnd punish DJ's for puttin corny stickers on they mixes\nSmack the stripper bitches for askin for our autograph and pictures\nYou'll be scared to leave the club wit us\nYou scratch my back, I'll scratch your's bitch\nI'll eat ya salt-fish, if ya suck my sausage\nI got an atomic sub, armed wit a sub-atomic scud\nReady to spill ya crimson-colored blood\nThe four horsemen on the back of four quadripeds\nPuttin four hoof prints on ya foreheads, motherfuckers!\n(There it is!) So bop ya heads to that, uh (There it is!)\n\n[Hook]\n\n[Outro: Killah Priest]\nFuckin pussy emcee's, gon' get a shot in the eye\nY'all niggas talk behind nigga's backs\nY'all niggas better bop ya mothafuckin heads before we blow it off\nYa fuckin perfume missin idiots\nY'all niggas always runnin, go run and tell that\nGo on, runnin, run behind somebody's back\nRun and tell that and take these fuckin slugs wit ya\nWe gon' get ya mothafuckin clown\nYea..."}]}