{"songs": [{"year": "2018-02-21", "image": "https://images.genius.com/7c32c572bc55f908efcc57368f3e661d.268x268x1.jpg", "title": "Rooftops", "album": "ELEVATORS: ACT I & II", "lyrics": "[Verse]\nI swear, life just ain't fair\nAnd I could barely gather up enough feelings to care\nThey wanna see us at the bottom so I had to prepare\nCuz like I'm third wheelin', I know I don't wanna be there\nI move wild but aware since a child I knew I would be here\nI said it loud, still nobody would hear\nBut if a tree falls in the forest and you ain't near\nDoes it still make a sound or will sound disappear?\nHuh? Exactly, just as I expected\nKnew if I kept droppin' they'd hear it at any second\nThey thought I would be second, but nah, I'm not settlin'\nI'm movin' nomadic, I ain't packin' any estrogen\nI had to man up, view the world from a second lens\nNow what I do, they jack it like letterman\nSo honestly it don't bother me who I'm better than\nI make songs that change thought, and spark better men\nI'm extraterrestrial, you think we better men\nMy mob 5 deep, and the third locks me in\nSo, I be feelin' like I gotta win\nYou Radames and rider mans, have gotta end\nYour juice is minute made, mine live again\nI'm Infinite, like I'm unsigned Eminem, yeah\nI been torn like limb from limb\nWas sleeper, now reaper like Mr. Grim, yeah\nI made the cut like I went and trimmed\nNow I blow them all away like tents in winds\nStill I'm here, lonely and the craftiest\nProbably the saddest, but his music is the happiest\n'fro is the nappiest, I'm tryna be the savviest\nI get that we here to connect like magnets\nI'm never draggin' it, they think that I am\nI'm been thinkin' passin' it, it's like the pain's an exam\nClosed off like the cabinets, It's just who I am\nGivin' a damn, I guess it's a habit of man\n\n[Hook]\nLook, I aim high like tubesocks\nI'm tryna shoot for the sky like it's rooftops\nI know that they could see the rise like new stocks\nSo I'm headed for the rooftops, headed for the rooftops\nI been headed for the rooftops\nI been headed for the rooftops, headed for the rooftops\nI been headed for the rooftops\nI been headed for the rooftops, yeah"}], "artist": "Bishop Nehru"}