{"songs": [{"image": "https://images.genius.com/7bd5105544956db251fdc5f82aabbb6e.450x450x1.jpg", "title": "Real Pimp", "album": "Music & Me", "year": "2001-12-04", "lyrics": "[Hook: Nate Dogg]\nI'm a real P-I-M-P\nAnd I love the way the ladies shake that thang\nFrom a real G-A-N-G\nAnd the haters know this Dogg Pound Gangsta' gang\nNigga you can't fuck with me\nFrom the jump I told you I cannot be faded\nNever been no mystery\nNever took no shit and always got my thang\n\n[Nate Dogg]\nLet me teach you the game man, homie wit' this\nWhen he rockin' ya brain man, gimme a visit\nLet me show you the ropes loc, would she be missin'\nGoin' to smoke you some endo, we keep it pimpin'\nNiggas playin' that hate game, we keep it pimpin'\nNiggas movin' that weight man, we keep it pimpin'\nBitches shakin' that thang man, we keep it pimpin'\nGot one comin' wit' me man, I got love\nI got love for my niggas who be watchin' my back\nNo I ain't got love for hoes who play them games\nYou can check my gangsta files\nI been putting in work since 1985\nGot an angel by my side\nAll my demons always beggin' me to ride\n\n[Ludacris]\nUh, now ever since rappa's had riches, Luda's had bitches\nPimp, get more gums then baby pictures\nMenages wit sisters, veins poppin' out like shrimp, lobster\nA-Town mobster, garage full of 6's, what can I say?\nIf something don't smell right, what can I spray?\nTech-9 incense, say for instance\nSee you in the distance, hit 'em in an instant\nWe so crummy, countin' mo' money\nBut stay strapped up like crash test dummies\nPut 3 to your tummy, 2 to your throat\nAnd bulletproof cars, we ride like the pope\nJust in case, you don't make it home\nYou better super glue grip the chrome\nCause you was talkin' that yap and got put in the bed\nNow it's a frog in ya throat like Ms. Piggy givin' head\n\n[Hook: Nate Dogg]\nI'm a real P-I-M-P\nAnd I love the way the ladies shake that thang\nFrom a real G-A-N-G\nAnd the haters know this Dogg Pound Gangsta' gang\nNigga you can't fuck with me\nFrom the jump I told you I cannot be faded\nNever been no mystery\nNever took no shit and always got my thang"}], "artist": "Nate Dogg"}