{"artist": "C-Rayz Walz", "songs": [{"title": "Rampage", "album": "Off the Radar: Exclusive Lacerations", "year": "2003-09-25", "image": "https://images.genius.com/45bc71d58be69256a0b5f9c5f3abc51d.1000x1000x1.jpg", "lyrics": "[Intro: Mazzi]\nSo tense.  Trying to recreate history.  Yeah (Yeah).  Record more (Record more).  Yeah.  C-Rayz in the house.  Stronghold!  The Ancients in full effect, recreate history on some next.  Snap your necks.  Taking large checks.  Yeah.  B Slim recording.  And we ‘bout to do this.  We ‘bout to do it.  Yo\n\n[Verse 1: Paze]\nYeah, we get rugged, tough, hard like P\nTry to diss mines, got scarred by me\nChi chi man [?]\nThe Ancients are wars drawn to form Battletron\nThink the SPN aerosol with the digital read\nI’ll spit the heat out on the most critical beat out\nY’all get your styles off MP3\nEvery backpacker named Timmy wants an MPC\nY’all ass like an anal sex queen’s best scenes\nI splash with the force of an extreme wet dream\nAs I smother your girl with mother of pearl\nI’m sick with it—I’ll leave the track covered with Earl\n‘Cause I clot pesos, don’t sell yayo\nAnother word for cocaine is perico\nThat’s Spanish.  “Take that” means toma\nTú sabes mi estilo, MCs.  No me jodas\nWhen Paze dumbs, he makes the place jump\nThinking shit’s sweet can get your face lumped\n[?] these girls is awaking, they stay right on my tit, Mazz\nAnd, at the same time, I’m thinking, “Damn”\nHow could a brother spit so tight, it makes virgin chicks pro-dyke?\nI shine so bright.  Y’all flick like strobe lights\nI take the cake, leave you with no slice\nThat’s why I’m banging your wife on the table with chrome pipe\nPaze\n\n[Hook: C-Rayz Walz with DJ Scratches] (x4)\nSlow down, baby\n\n[Verse 2: C-Rayz Walz]\nThe spitter, the splasher control the audience\nBeen to Motowns/mo’ towns than Berry Gordy kids\nI get the inspiration from unnecessary stations\nThat keep playing imitation shit\nYou can’t flow, kid.  You’re weak and don’t shine\nI speak the street ‘til I outpeep your quotes\nMidget MCs with vagina meat slacks\nDon’t inspire the life.  Cut your veins with a axe\nSpears the lands through a glance\nGet in a trance, “Shoot to Kill” like a soundboy dance\nPure entertainment despite your arrangement\nI’m filthy, blaze sound with The Ancients\nNo more jobs.  Mazz, Paze, Walz\nYou and your squad better sways or get robbed\nNo other nation’s dumbing, mumble off acres\nWhen I get dumb, you hear it—the spirit of paper\nSo take your life now.  Flow?  I dare you\nMy ride’s fully stolen—I ain’t trying to scare you\nWith crips in scripts chicken and tripping\nRobbing and licking while you and your A&R kissing (Aw shit)\nSo just in case you wanna know if I rhyme, I don’t\nOur sound’ll make the crowd go, “Woah”\nMe getting dropped to stop won’t be tolerated\nI rock off the top, forgetting I’m [?]\nWalz\n\n[Hook: C-Rayz Walz with DJ Scratches] (x4)\nSlow down, baby\n\n[Verse 3: Mazzi]\nWhen I come around, homeboy, watch your honey\nLeave her drained when I rain—her smile sunny\nWhen I attack, [a prop is all laid to bone?]\nNow grab your shoes and go home\nHer pussy was packed from wall to wall and balls\nHit the tip of her clit and I can’t stall\nEvery time since then that I’m seeing her\nShe has flashbacks of me just creaming her\nAnd the notions of our sex motions\nGot a whore dumping the throat and short-choking\nKnees get weak and curl in your feet\nUsed to see techniques which surpass unique\nNo effort.  I step with the rawness to slay\nI’m off it to blaze, get a taste of the glaze\nI’m on a rampage\n\n[Hook: C-Rayz Walz with DJ Scratches] (x8)\nSlow down, baby\n\n[Bridge: Paze with DJ Scratches] (x7)\nSlow down, baby\n\n[Outro: Paze]\nHeh, rampage.  Slow down, bitch-ass.  Slow down, bitch-ass.  Slow down, bitch-ass.  Slow down... (Aight, aight)"}]}