{"songs": [{"year": "2000-04-27", "image": "https://images.genius.com/12ac060e02b1e2ddde9621830467d17f.818x818x1.jpg", "title": "...And I Rock", "album": "Next Level Vol. 1", "lyrics": "* \"..\" are Biz Markie voice samples, cut and scratched by DJ Premier\n\n[Verse 1: Biz Markie]\n\"Just here to let you know\"\nThis is Primo\n\"Just here to let you know\"\nMy man Black Indian\n\"Just here to let you know\"\nI can't forget Makigo\n\"Just here to let you know\"\nFrom U.S.A. to Japan\n\nOn the week days I be in school\nBe in school learnin, the golden rule\nI wake up in the morning hangin' out my bed\nI don't do a thing till my grace is said\nAnd when it's said, I wipe my ass\nAnd think off all the fly girls in my class\nPay off the don say it can't hurt\nI pull on my Lee's and my blue sweat shirt\nWalk around the corner seem to catch the bus\nAnd if the bus ain't there I don't dare fuss\nJust tell mama I'm Mister bust a day\nAnd she take me to school in a white OJ\nBut when I get to the school and the bell ring\nI don't even worry cause it ain't no thing\nWalk in the room they say you're late for class\nTeacher mark me late, I'm gonna kick his ass\nYou know the teachers is gonna listen to me\nCause I'm the diabolical the B-I-Z\nAnd I Rock\n\n\"Just here to let you know\" \"B-I-Z M-A-R-K-I to the E\"\n\"Just here to let you know\" \"B-I-Z M-A-R-K don't try to front\"\n\n[Verse 2: Black Indian]\nYo, now that's classic, I ain't worry about you bastards\nI'm at home in my boxers watchin' Tom Warner classics\nIt's just a rhythym I kick, while I strangle out the beat\nWhile you hear that kick, high drums and snares\nPuttin you right here met ya chicken out in Brooklyn\nWhen I hit that rare, air, you don't wanna see Black\nWhen I get mad cause I come and Black axe, square Black maks\nIt's a real thing while I hold my hands on this microphone\nI get it open till the breakadawn, or maybe to the sky kerr caucasian\nY'all be rockin for rhythyms I rock for blacks nations\nI leave you all in a daze\nI'm pickin' up these flows like pimps that brush waves\nGet it for all days my broke cup pawn flows\nCause I'ma keep it on the real, yo\n\n[Verse 3: Biz Markie]\nAnd I Rock\n\"Just here to let you know\" \"B-I-Z M-A-R-K-I to the E\"\nAnd I Rock\n\"Just here to let you know\" \"B-I-Z M-A-R-K don't try to front\"\nAnd I Rock\n\"Just here to let you know\" \"B-I-Z M-A-R-K-I to the E\"\n\"Just here to let you know\" \"B-I-Z M-A-R-K don't try too front\"\n\nMe and Superman we had a fight\nI punched him in the face for all my might\nPunched him so hard he fell to the floor\nPicked him up, and ragged him some more\nTurned around, and who did I see?\nIt was ah Lois Lane she was lookin' at me\nShe said: \"Yo Biz Markie you are the best\nCause you knocked the S off Superman's chest\"\nShe took my hand and led me to the room\nWe smoked three joints and cracked the core of the brew\nI looked her up I thought she was fine\nI knew the deal; what was on her mind\nWe took off the clothes and clicked off the light\nAnd we rocked the bed, till the sky was white\nWhen it came to the break of day\nShe said: \"Yo Biz Markie why don't you stay?\nI've cooked you some breakfast with some orange juice\"\nThat's one thing I couldn't refuse\nAt around eight I kissed her goodbye\nShe said: \"Whoo! Biz Markie you one hell of a guy!\"\n\nAnd I Rock\n\"Just here to let you know\" \"B-I-Z M-A-R-K-I on to the E\"\nBiz and Premo and you know we do, ROCK\n\"Just here to let you know\"\nNew York to Japan, Japan and New York, we rock\n\nAnd you do and you do and you do and you do and you do, WE ROCK\n*Beatboxes* Rock!\n*Beatboxes* We Rock!\n*Beatboxes* R-r-r-r-r-r-rock!\n*Beatboxes* Ah Premo, ah Premo, Premo, we rock!\n*Beatboxes* Ah Premo, ah p-p-premo, Biz Markie and Premo etc"}], "artist": "Biz Markie"}