{"songs": [{"year": "2005-02-08", "image": "https://images.genius.com/4faa518970e19e22ecdc868732305777.640x640x1.jpg", "title": "Just Friends", "album": "Sleepers", "lyrics": "[Intro - repeat 4X] *whispering*\nJust friends, just friends\nI just wanna be, just friends\n\n[Verse 1]\nAiyyo let's get one thing clear my dear\nI ain't lookin for a girl, I don't care what you hear\nI don't care who did what and put who in your ear\nBig Pooh gettin his this year - I'm talkin bout\nMeetin chicks with some business\nI just wanna be your friend with privileges\nNot talkin on the phone all night about\nWhere I was or who unless we went out\nDon't fuss and pout, cause you know how I do\nAlways chill with the crew but make time for you\nShe the young-un on the side, point guard in my squad\nNicknamed her B.G. cause she love to Go Hard\nMy God, this is the master plan\nI just wanna be your friend and not your man\nYou understand? Do you hear what I'm sayin?\nCause the kid ain't playin, word\n\n[Hook] (Intro is repeated in background)\nThere's some things that I gotta say\nEspecially when you look my way\nThis one thing that you must understand\nI just wanna be your friend and not your man\nThere's some things that I wanna do\nEspecially when I look at you\nThis one thing that you must understand\nI just wanna be your friend and not your man\n\n[Verse 2]\nI don't have a problem with monogamy\nBut the problem be, these chicks eyein me\nThey see the probably, like I got some cheese\nAnd I'mma take 'em out shoppin, spend a couple of G's\nBitch, Please! Snoop said it best\n+I don't luh these hoes+, and I suggest\nThat, you find another sucka nigga for that game plan\nI play a whole 'nother game, man\nI'm on some new when the Pooh gotta see you work\nAnd thell they're not exclusive, see me merk\nIt works, upfront, you don't see no hurt\nNo runnin to your friends like, \"Pooh did dirt\"\nI'm just tryna have some fun 'fore it's said and done\nAnd while I'm young, gotta get it all in\nBe FRIENDS - that's what it's all about\nI ain't tryna be your man, so don't even go to that route\nSo check it ouuuut!\n\n[Hook 2X]\n\n[Outro]\nYeah, ha! Get your drinks up\nTo my nigga Z-Mag, get your Rossie out\nWe gon' sit back on this one..\nLet this one ride out\nYoung Khrysis, Big Pooh\n\"Sleepers\", yeah\nDrums!"}], "artist": "Rapper Big Pooh"}