{"songs": [{"image": "https://images.genius.com/826c5df8eea3fb88d213c3fb10f319a8.1000x750x1.jpg", "lyrics": "I'm not... I'm, I'm, I'm...\n\nI am about done with this painful season, and this painful winter... You know?\n\n\n(Mac Lethal)\nGive me the birth of spring\nSo when I go outside all the birds will sing\nAnd my words will sting like bees in a hive\nAlease make the season alive\nAlright?\n\nI used to hold Nintendo games in with another game\nBack when Shawna used to give Jojo's brother brain\nBefore I started on this world buzz\nBefore bill collectors started callin' me more than my girl does\nI was curled up in the corner of my classroom\nSleepin' on my desk, or I was scribblin' these rap tunes\nTransfixed on half-moons and paychecks\nAnd mad Buhloone Mindstate was jammed in my tape deck\nFUCK no I didn't \"dress out\" for gym class\nI took a nap on the bleachers top level\nI stole all my lunches, didn't go to class, and got A's, 'cause there's 6 million ways to freak a block-schedule\nThis rhyme's for the high school dropouts\nRestaurant dishwashers, and girls who use copouts\nArtists who ain't bein' properly respected\nAnd everyone who ever got their phone disconnected\nBefore little league, Lethal played infield\nI had a Huffy and a yellow-colored Big Wheel\nI buried all my GI Joes in the backyard\nBut momma made me wear a coat 'cause of the windchill\nMy role-models were the janitor committees\nAnd the punk-rock kids who smoked cigarettes at Denny's\nUntil my girl sent me on my own\nI can't be your X-boyfriend, I'm trapped in the Y-chromosome\nI don't got a job 'cause I don't got a car\nI don't got a car 'cause I don't got a job\nI need to pay rent, I need to do somethin'\nInstead I'm gonna press the snooze button\nWith 2 dollars in my pocket, I'm spiritually William Wallace\nScreamin' for freedom in a dark winter solace\nHopin' for some healthy leads\nAs trees whisper for me to smell the breeze\n\n\nChorus: (Nezbeat and Mac Lethal)\n\nAy yo\n\nNezbeat and Mac Lethal (3x)\n\nGive me the birth of spring\nSo when I go outside all the birds will sing\nAnd my words will sting like bees in a hive\nPlease make the season alive\n\nMac Lethal\nI'm sick of winter...\n\nNezbeat\nGive me the birth of spring\nSo when I go outside all the birds will sing\nAnd my words will sting like bees in a hive\nPlease make the season alive\n\nMac Lethal\nWinter, everything goes wrong. Everything goes wrong in the winter. Everything hurts, everything's cold. No time for that. It's time for spring\n\n(Inaudible whisper)", "year": null, "album": null, "title": "Birth of Spring"}], "artist": "Mac Lethal"}