{"artist": "Angel Haze", "songs": [{"title": "SHOOTIN EVERY DAY (ROLL IN PEACE)", "image": "https://images.genius.com/1678fc5a513eab06d15365478287ae92.1000x1000x1.jpg", "album": null, "lyrics": "No, I ain't never had to worry\nI never been afraid\n7 mile shoot everyday\nNot at hoops or at no range\nSo you could bet yo ass ill spray\nOr my name ain't angel haze\nI just went in the closet and talked to God\nHe told me to give y’all all the same thang\nThat's pain nigga\nNo more competing outside of my brain nigga\nI be swerving, swerving in them lanes nigga\nI fucked you and moved on to new things nigga\nAin't no tie like velcro and shoe strings nigga\nFuckin' with these bitches they be hating a lot\nSkate in the drop, head gone i'm insane wit the top\nMan gone, I’m in ya bed hoe taking the top\nThinking about the bread like hmm, how can I make me a lot?\nWhat the fuck did I see in you bitches?\nWasted my time on all three of you bitches\nFrom here on out it's just me and these figures\nWay less you more me on these bitches\nYeah you gotta love yaself\nDon't give your wealth to these niggas\nCan’t get a kiss can’t get no ass\nDon’t waste my breath on these niggas\nI gotta focus fuck a hoe, I gotta flex on these niggas\nI'm chasing money tryna eat a bowl of Chex on these niggas\nYou ain't fuckin' wit me lil bitch\nYou ain't even on my team lil bitch\nYou can’t even fetch my fuckin' water\nYou can’t even roll my weed bitch\nYeah I had to cut you off! What!\nYou can’t get no mo me lil bitch\nYou can’t even fill my fuckin' sneakers\nYou can’t even fill my weave bitch\nWait why the fuck would I lie to these niggas?\nI been the realest since an embryonic rise on these niggas\nI don't want the cake, I want money like Pi with the figures\nI need that dollar, dollar, dollar, dollar sign to infinity\nThat's the power but I ain't gon' let it fuck or devour me\nPlan on gettin' more than what u bitches want outta me\nLike I’m the second coming lil bitches they doubted me\nBut I rose on them hoes and put them where the flowers\n\nYeah, you ain't want me when you had me\nI left now you want me back\nWhats the fuckin' deal with that\nHoes just don’t know how to act\nI had to let go of my heart\nAll that shit just hold me back\nSo when you hear me on some shit\nBitch you just know I’m gon' attack\nLike bitch I’m back now\n\nKicking on them bitches like I'm almost finished\nLike she pregnant you know she just gone deliver\nMetamorphosis, bitch I was gone a minute\nOut the box, they made they can’t hold her in it\nOut the flock, broke the nest stole the dinner\nDuck taped, gaggged, and chokehold the winner\nBitch don't put me next to no one elsa-\nMy shit so cold it just froze the winter\nHungry y’all hoes look like frozen dinners\nI mean buffet style, I mean hold my liver\nI mean I been drinking I mean I keep thinking\nThat no one can fuck with me man\n7 mile bitch we hunting again\nAngel you tripping wassup with you man?\nThought I was gone bitch you was wrong\nSit the fuck down, naw you stuck with me man\n\nNo one can match my energy\nGenetics man its chemistry\nYo hoe like me like a simile\nI like that shit\nIt's chemis-\nShit it's chemistry, it's chemistry\nAin't no one gettin' rid of me\nThey mad they can’t get rid of me\nAnd I like that shit\nI like that shit\n\nWhoa! Wait!\nI think I’m just too sick\nI have to vomit on the beat\nBitch don't make me get vindictive\nPut your mama on the streets\nI just bought a bag of blow me down\nAnd brought it to the beach, yea\nThis rap shit jus' got real again\nAnd its all because of me\n\nYou think you really gon' play me\nI be like \"look in my eyes\"\nTrippin' like bitch you blind!\nTrippin' like nigga, you tried it!\nMama like its yo time!\nI be like yes, oh my!\nWait until I drop mine!\nWait until I drop mine", "year": "2018-02-12"}]}