{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/a8906126ae46a874605d38c7d1e89e9e.1000x1000x1.jpg", "year": null, "album": null, "lyrics": "[Yelawolf]\n\n[Intro]\nMy name is Yelawolf, some of them call me \"Catfish Billy\"\nI do, I do, I do, I do, I do rip shit\nI do, I do, I do, I do...yeah, let's go\nYeah, yeah, yeah\n\nFirst of I'm a King so don't you, be the Jester in my Kingdom\nHip-Hop's like another pair of old shoes, I jus' took a toothbrush and cleaned 'em\nPut 'em on, rocked 'em to the mall, hopped in the car, while a sipped on \"Jimmy Beamin'\"\nInstead of droppin' the ball, a got 'em all, up on the wall like a broomstick leanin'\nThen a put the Chevy in cruise, took everybody to etiquette school\nListen up baby they said \"you don't have a clue\", it ain't fuck you, it's..FUCK YOU!!\nIf your gonna fight, then you fight shirtless\nYou don't ride a bike in sandals do you (no)\nThe meaning of fuck is worthless, if it don't mean nothin' to ya'\nYeah..just get it warmed up\nWhy does everybody look so perplexed?\nIf your gonna do it, do it with a purpose, thats all then do it all till its perfect\nFunky I am, so funky that a use my vocal stretch\nWhy would you stretch with funk? (MASTER FLEX)\nSo a don't pull a hamstring while am runnin' circles around circus clowns in my jeans\nCause when a pull the trigger on a piece of paper a can hear the bullet in studio go \"ping-ping\"\nA can feel the breeze of the flow blow wing yes look, hear the chequebook go \"ching-ching\"\nBring bring me the money honey yeah, go go girl, why she tellin' me to go go sing?\n\nA take that trip down the road to your soul\nAm not a vocalist but a got some vocal control\nThree-Thirty-Three this ones for you and a hope that you know\nWe gonna' shake this motherfucker till both of us old\nUntil my baby's far away out in Puerto-Rico\nDaddy's out workin' but your with me wherever we go\nMamma's ok and plus we got us 3 beautiful souls\nAnd above it all a want y'all to see me as a hero\nNo ego, no ego, this freestyle, is a peephole, of people, for the people\nCome inside, take a seat folks, here we go, no ego, no ego, this freestyle, is a peephole, of people, for the people\nCome inside, take a seat folks\n\nYeah, 2012, am 32 killin' shit bitch, for Shady Records, know that shit\nSouth as it is bitch\nFunkmaster Flex whats up homie?\n2012 is my motherfuckin',..give it up\nYou should already know\nAnd this is a M16 track by the way\nHomie you killed this shit, and he is from the \"A-L-A-B-A-M-A\" by the way\nYeah we in this bitch, what up Frank White?", "title": "I Do (Freestyle)"}]}