{"songs": [{"title": "Had ’Em All", "image": "https://images.rapgenius.com/4185a2e7bc22e6965b949e13ca9aec16.500x500x1.jpg", "lyrics": "[Verse 1]\nBitch, I done had 'em all, had a ball\nTook her by the hand and I grabbed her paw\nGirlfriend left, wasn't mad at all\nRebound game like Pau Gasol\nOnly wear Gottier or YSL\nIf I ain't at home, you should try the cell\nNigga made the beat and the rhyme himself\nGrind 'til sunrise, tired as hell\nAll kind of girls want the wifey crown\nNowadays drawing all types of crowds\nBrand new swag, bitch, wipe me down\nPicking up girls outta NikeTown\nLane Tech had all the baddest hoes\nTook the Green Line towards Cottage Grove\nFunny cuz my niggas, had a lot of flows\nAnd I wasn't even rhyming, I had the hoes\nUsed to want it all and a bag of clothes\nLavish homes, baddest songs\nPlayed the underground like the catacombs\nChildhood, never really had it holmes\nBack then, hangin round Steve and them\nRunnin round, talkin' 'bout \"she's a ten\"\nSee the same hoes next week again\nWearing the same clothes that I seen them in\nUsed to get chased out of Humboldt Park\nFuckin' with the Latin hoes after dark\nBad little nigga, act dumb but smart\nHate to get in trouble, but it's fun to start\nChitown boy out in Brooklyn now\nKarate chop samples, then took a bow\nArrogant asshole wit looks and style\nMight have to try the modesty look, but now\n\n[Hook]\nI done had 'em all\nBitch, I done had 'em all\nBitch, I done had 'em all\n\n[Verse 2]\nCamo things, Army fatigue\nMe and my team all reign supreme\nGetting our dream, all major things\nGive her that cream, (\"It's Maybelline\")\n\"Get to work, boy! You don't get paid to dream!\"\nI'm the bomb, bitch, ain't no disabling\nThey said what I'm doing was a crazy thing\nBut now a nigga really getting paid to dream\nFrom a city where we all savages\nYeah, it sounds crazy, there's facts in this\nShit come easy like laxatives\nThick glasses to see past you nigs\nPicked last man, I can't imagine this\nSick rapping, I put cash on this\nBig dragon, I'm so passionate\nWhiplashing from how fast I spit\nDope fashion, so don't ask for this\nShe want my gene pool just to splash in it\nFeeling like a Hogwarts graduate\nCause every single whore wants the magic stick\nI don't have to argue what classic is\nI'm dope, you don't even know the half of it\nBulls snapback with the jacket zipped\nFuck a Dragon Ball, I wish?\nMy nigga, I done had 'em all\n\n[Hook]", "year": "2014-04-30", "album": "goldUn Child"}], "artist": "Ace Hashimoto"}