{"artist": "King T", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1375378876_King-Tee.jpg", "title": "Got it Locked (Remix)", "year": null, "album": null, "lyrics": "[Intro: Dr. Dre]\nBump bump, ha ha ha\nMake it bump, bump bump\nBump bump, said what?\nBump bump, yeah\nYo, kick this shit homie!!\nHa ha ha\n\n[King Tee]\nOnce again, it's the shadiest\nIn the 80's when you was pushing Stadias\nI was rolling on Mercedes with the alias\nDaily, throwing up my radius\nMaybe it's why your ladies afraid of me\nDon't know what to say to me\nBut she's intrigued by the diamond cut watch\nThe black silk socks, the video is on the pock\nLet's move the party to the Doc Dre at 80 foot yachts is\nAnd you can hear the bass from blocks\nFool, wet bar just to fade ya\nWhores left behind, keep blowing up my pager\nAnd it's a freaky scene, chains and whips\nOnly bring the squeaky clean tricks that came to mix with Tha Liks\nThe authentic, Indo is scented\nLimo, windows tinted, so you can't see who's in it\nThere's no limit to how many mics get tore a minute\nIf the party's cracking then I'm in it\n\n[Chorus: Bud'da X2]\nWe got the party locked down, what you wanna do?\nLadies wanna dance, homies do too\nDon't even bring a strap to this\nKing Tee'll make you clap to this\n\nWord up, y'all  -----] Quote from a previous record\n\n[King Tee]\nNow, you're rolling with the King\nFlossing with no flaws in the ring\nTossing to leave jaws in a sling, often\nThe scrilla peeler, cabbage clutcher, kitty luster\nTiny toucher, not a buster, hustler\nRush the dancefloor, see a whore\nThat make me wanna \"Be The One With You\" like Usher\nPlus the cluster, the type black in the bar back was cool\nThe front and the back was cool\nSo we do, Cognac for two\nThat make the King wanna Act A Fool (remember that?)\nPlayer haters hot, cause I got more gold than Willie Gault and them\nI ain't faulting them, but let's talk about sex like Salt and them\nI won't end, you won't gain, let's not pretend\nI'll get the party hot like the cops walked on your blocks (What's up?)\nCause King Tee got it locked\n\n[Chorus: X2]\n\n[King Tee]\nSome of y'all still don't know what King means, it means ruler\nCastle dweller, old schooler with the wine cellar\nAnd a drawbridge, my troops got you crew hostage\nWhile I'm getting head at their grapes and sausage\nY'all kids wanna know how the boss lives?\nCrib, saucy like ribs, and I got first dibs\nSoon as you crack the bottle, toss it back 'til it's hollow\nMackin' everything from hoodrats to supermodels\nNever subtle, save your rebuttal\nYou couldn't get play in a huddle\nSo ladies tell your man tonight, you can't tonight\nHe gotta use his hand tonight, I guess I planned it right\nWe can smash out in the glass house\nHit the hotel, pull the cash out\nI'll hit it 'til you pass out, then slide back to the spot\nCause Aftermath and King Tee got it locked, yeah!!\n\n[Chorus: X4]\n\n[Outro]\nWe gotta get in to you, aww wweee\nWe gotta get in to you, aww wweee\nWe gotta get in to you, aww wweee\nWe gotta get in to you, aww wweee\nWe gotta get in to you, aww wweee\nWe gotta get in to you, aww wweee\nWe gotta get in to you, aww wweee"}]}