{"artist": "G Herbo", "songs": [{"title": "How Could U Hate Me", "album": "Humble Beast (Deluxe Edition)", "year": "2018-02-16", "image": "https://images.genius.com/8e2956fcf12a8df48395c50350e5ffbd.1000x1000x1.jpg", "lyrics": "[Intro]\nSouthside on the track, yeah\nI think bout them days when I was like dead broke\n\n[Hook]\nHow could you hate me?\nHow could you hate me?\nWhy would you hate me?\nOh, cause I made it\nHow could you hate me?\nHow could you hate me?\nWhy would you hate me?\nOh, cause I made it\n\n[Verse 1]\nI the one taught you how to make all of them plays\nI'm the one who slept in the trap all them days\nI'm the one told you don't stay in your ways\nTry go on hits and go miss anyway\nIm the one gave you that stick anyway\nIm not gon play every anyday\nI know me and my niggas the same, we not tryna fall out bout bitches and fame\nWhen it come to gunplay my niggas the same\nRun up on one of us, get hit in the brain\nLil killers with me they itching to bang\nReach for some shit you get changed\nAll of these hundreds, no change at all\nI don't rock no more balmain at all\nWe make a nigga block famous, dawg\nDissing us, we'll have them cases, dawg\nTrue shit, pussy nigga wanna talk shit not he got venom from the blue tips\nOoo shit, coulda had thirty in the Draco, but I'm riding round with a few clips\nStill I might riding round jug a few pounds\nBrand new engines, they don't make a sound\nUsed to buy whips to have fun around\nNow I just go drive my son around\nShit I be thinking about is should i ride with it less or i  still keep my gun around\nReally want war would of thought i was wearing a vest how a nigga just hug around\nOn 79th till the sun went down\nHundred thugs around\nGot love back then, but they hate me now\nShowed niggas love back then, gotta pay me now\nI'm going brazy now\n\n[Hook]\nHow could you hate me?\nHow could you hate me?\nWhy would you hate me?\nOh, cause I made it\nHow could you hate me?\nHow could you hate me?\nWhy would you hate me?\nOh, cause I made it\n\n[Verse 2]\nSmoking that shit got me lazy now ay (Posto)\nI feel so unstoppable can't nothing faze me now\nI fly from the Raq to the tropical\nYou know i gotta stay low-key like an obstacle\nPlay with the draco but today i guess the Glock will do\nGet up on a nigga ass early like cockadoo\nGirl bring that ass here im tryna put a cock in you\nIm tryna fuck you then hope in the coupe\nBlue Maserati my mood ay\nI just put on the Mcqueen and they new\nOne thousand Dollar my shoe ay\nThey say im the hottest young nigga in the Chi\nFuck around stay independent till i die\nStacking this money up till it hit the sky\nHad a hundred racks 18 i ain't gotta lie\nHad a hundred racks 18 why would lie (Bitch)\nNigga i ain't gotta lie\nI know my niggas gon fire when i fire\nNigga i ain't bout to die\nI watch out for snakes in disguise\nSee niggas fake in their eyes\nIm just out here tryna survive\nMurk niggas by allibies\nGot racks why would i lie\nTote gats how can i die\nLet me know when you ready to ride\nBefore you shoot nigga look in his eye\n?\nIm on the grind everyday how could you hate me?\nBecause i made it\n\n[Hook]\nHow could you hate me?\nHow could you hate me?\nWhy would you hate me?\nOh, cause I made it\nHow could you hate me?\nHow could you hate me?\nWhy would you hate me?\nOh, cause I made it"}]}