{"songs": [{"album": "50 Bodies Pt. 3", "image": "https://images.genius.com/dfa39f34aa029ce17cf8e1a557d5d373.500x500x1.jpg", "year": null, "title": "I Smell Like Money", "lyrics": "Hook:\nAyyo I look like money, I walk like money, I talk like money\nI smell like money, I act like money, I rap like money, I put my money in the back then go!\n\nVerse One:\nAyyo this is for my goons that be breaking and entering\nRoll up in the Berg from the project tenements\nLeave your crib with a Santa bag full of presidents\nEyes dialated but leave no evidence\nLeave yo residents, tied the fuck up like a circus elephant, purchase medicine\nWith the money from your mom purse and her television, E's, Oxys, Coke, Amphetamine\nSniffing and shredding it, redirect of a gentleman, hotter then the kettle\nThis metals full of adrenaline\nFar from a gentle man, cuz I enter scams, with last weeks blood on my hands\nYou cats sweet like Candy Yams! I'm the Candy Man! Say my name five times and Blam!\nYou see your enemy and you ran, I see my enemy and put up my hands or just give him a glance\nLike, you ain't hurting nothing the curtains shut on your hurse and then you\nDead as a horse that'll dead as cavorcki and I, Triz in a orgy then throw her back in the audience\nCeltics jersey I bought is just fresh and looking accordingly give a fuck what you thought of me\nI'm a rhyming minority, cuz i'm ill and all these new cats is boring me\nCelebrating cuz Bun got the source cover, love to see my niggas make it, pass they imagination\nFree Easy Money with street money I made it, never went to school I got a college education\nBut I move Jason, call me the doctor, have made patients, weed like a Rasta\nChicken with the pasta, that's what he ate, I can tell when they shot him, homie spit up his plate\nIsn't it great, we living in a biblical state, eye for an eye, so I might rip up your face\nI'm a problem, I should of got signed by Suge, but I didn't, so i'm still stuck in the hood\nI walk around like my shit don't stink, with my big ol' Linc, give a fuck what you weirdos think\nI tell them i'ma be the best an nobody is stopping that, some say i'm a cocky cat\nBut I ain't a copy cat, got a couple people robbed, but they ain't rob me back!\nSucks for them, feels good for me though!\nI'm a murder mas with white trash that like cash so they sell white fast till they whole life pass\nGot a Mami with a big old ass, and another one that's flat just for rubbing my back\nI'm in the trap like a mouse, call it the crack house, OG's mash out,smoke weed pass out\n\nChorus:\nI look like money, I walk like money, I talk like money\nI smell like money, I act like money, I rap like money, I put my money in the back then go!\n\nVerse Two:\nAyyo this if for my goons that be 4,5,6ing it\nPercecet, purple haze, cocaine mixing it\nPropane sipping it, but my brains infinite, like Slim Ferg shit, trust me I hurt shit\nComparing me to regularities, hilarity it's charity the way I get you high when you hearing me\nYall rappers be scaring me, must be cuz you crazy, rocking them tight pants, like my old lady\nFree gutta lee's, gutta streets got me bugging I can move a half an onion ever hour if its fronted\nOh yes! Homie I smell like money, cuz when I was a kid I used to dress bummy\nAnd that wasn't funny, and it still ain't, enemy's wanna hate but i'm laughing to the bank\nI burn shit down like more the mills baby, suck on my balls while you palm the dillz\n\nChorus x2:\nI look like money, I walk like money, I talk like money\nI smell like money, I act like money, I rap like money, I put my money in the back then go!\n\nI look like money, I walk like money, I talk like money\nI smell like money, I act like money, I rap like money, I put my money in the back then go!"}], "artist": "Termanology"}