{"artist": "A$AP Rocky", "songs": [{"title": "Fine Whine", "image": "https://images.genius.com/3054c642a320e82b70b35c53ad1cc8d5.1000x1000x1.jpg", "album": "AT.LONG.LAST.A$AP", "lyrics": "[Chorus: Joe Fox]\nThis love, this love, this love won't last forever\nThis love, this love, this love gon' own our eyes\n\n[Post-Chorus: Joe Fox]\nThis love, this love, this love won't last forever\nAnd this love, and this love, and this love gon' own our\n\n[Verse 1: A$AP Rocky]\nI think my cup is getting muddy, oh buddy\nIs this that punch, drunk, and love it, no buggy?\nEyes bloody when we out in public\nI'm hubby, she say she love me\nWasted money on syrup and honey, she think she Duffy\nThen I became a druggy, enhanced my fame and money\nAnd for your pain and suffering, my karma's waiting for me\nExpecting payments from me\nBut she won't get a damn thing from me\nShe just might get a band-aid from me\nYou swear the Benz and these bands ain't from me\n\n[Pre-Chorus: A$AP Rocky & Joe Fox]\nI know I'm a scumbag and now your heart broke\nThe night is still young, for you to sip and whine\n(Slow, slow, slow) Lemme see you whine\n(Slow, slow, slow, oh yeah)\nI know your heart is broken, pick up your wine glass\nWith your fine ass, before you whine fast whine slow\n(Slow, slow, slow) Lemme see you whine\n(Slow, slow, slow, oh yeah)\n\n[Chorus: Joe Fox]\nThis love, this love, this love won't last forever\nThis love, this love, this love gon' own our eyes\n\n[Bridge: M.I.A.]\nHow the fuck am I supposed to live?\nHow many fucks am I supposed to give?\nHow the fuck am I supposed to feel?\nTreated like a bill, cut the check and split\nTell your new bitch she can suck a dick\nTell your new bitch she can suck a dick\nTell your new bitch she can suck a dick\nTell your new bitch she can suck a dick\n\n[Verse 2: Future]\nYou the one that was putting up with me\nYou see how these streets corrupted me\nI gotta conquer everything in front of me\nEven though I broke your heart, how can you turn on me?\nWe with the shits on the real\nI do this shit on the real, I like them drinks on the real\nI fuck your bitch on the real\nWe do this shit on the real, keep it real on the real\nI was just keeping it G, she don't spend money at first\nSay you're in love with me, but I know it never gon' work\nI come through, top back, hangin' out the Vert\nEyes screwed up, I'm drinkin' syrup\nI know that look that you givin' me\nIt's killing you softly mentally\n\n[Outro: A$AP Rocky & Joe Fox]\nI know I'm a scumbag and now your heart broke\nThe night is still young, for you to sip and whine\n(Slow, slow, slow) Lemme see you whine\n(Slow, slow, slow, oh yeah)\nI know your heart is broken, pick up your wine glass\nWith your fine ass, before you whine fast whine slow\n(Slow, slow, slow) Lemme see you whine\n(Slow, slow, slow, oh yeah)\n\n[Produced by S.I.K., additional production by THC]", "year": "2015-05-26"}]}