{"songs": [{"title": "The Antagonist II", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro]\nHi, I'm Dave\nI'm Strange (No)\nI've been up so long\nDon't know where I'll go\nDon't know what I know I'm wrong (You're right)\nI must be gone (Gone)\nI must be gone (Gone)\nI'll play my god\n\n[Verse 1]\n(What you doing?)\nLike everything\nDon't shoot down my pair of wings\nLet me just smoke my Mary Jane\nI'll just hold my marriage in\nAnd that coin flip so damn 'merican\nEver take a walk in the street\nSit up in the middle of the median\nAnd they come and go and they come and go\nAnd my shit been bumpin' my shit been dope\nBut I'm missing something I'm kissing hoes\nAnd I'm missing something I'm switching roles\nAnd I'm pissed at something I'm drifting slow\nI got zip files\n(zip files zip files zip files)\nAnd I know if I click them they gonna unlock\nHow do I know that though? I wasn't taught\nI guess that shit that you learn on the job\nAnd my permanent fog isn't burning like smog\nLook at your feet totally odd (so weird)\nWhat is a feat? what is a job?\nLook at my teeth and they been moving a bit\nSo of late I've got in my retainer, but Dawg\nSooner or later the pain is a problem (ow)\nOnly its not, only its not\nThat mean its working, I guess I'm like god\n\n(nah nah nah but like it ain't even like that man\nYou know what i'm saying? like y'all you know what i'm saying\nI've been out here you know i'm getting that shit\nBut like it ain't even like that, you like-\nIt's not even one of those type of situations\nBut it just happens to be that way like\nAt the same time you know what i'm saying\nI been doing what i do out here it is what it is out here yo)\n\n[Hook]\nI don't ever front out here for a minute (go crazy)\nSay i never chill til i get it (go crazy)\nBrain what you think they committed? (go crazy)\nWeight like don go get it (go crazy)\nYo you wanna pause i live it (go crazy)\nY'all tripping like dawg that's dicky (go crazy)\nY'all listen but y'all don't listen (go crazy)\nY'all different but y'all no different (go crazy)\nIt's all in us\nOh my god oh my god\nI can't even stop this song\nNow the kid been getting bananas\nHe going Donkey Kong (Donkey Kong)\n(King of the ape shit)\nHe going Donkey Kong (Donkey Kong)\n(King of the ape shit)\n\n[Verse 2]\nI earned shit while he learned quick (no)\nChurned shit while he cursed this (no)\nAnd I turned around like I heard something\nBut i swear to god I ain't heard nothing (none)\nI second guessed you but escalated\nShit ready when I'm done renovating\nDon't fuck with me on my escapade\nDon't fuck with me on my escapade\nAnd I met a boy on that mountain top\nAnd he said to me go round the block\nAnd I did that, and I came back, and he took back what I took back\n(i'm not ready for that\nWho the fuck are- what are you?)\nI stood back while he took that\nAnd I looked back while he looked at me (hey)\nAnd that's when I knew I was on\nShouldn't be long (nope)\nI keep it moving along (yup)\nI keep on proving you wrong (yup)\nI keep on doing the shit that you want me to do (yup)\nIt don't have to be public at all\n(It will be our little secret)\nUnless you do songs about it\nHmm but why would you do that?\nWell...\n\n[Hook]\nI don't ever front out here for a minute (go crazy)\nSay i never chill til i get it (go crazy)\nBrain what you think they committed? (go crazy)\nWeight like don go get it (go crazy)\nYo you wanna pause i live it (go crazy)\nY'all tripping like dawg that's dicky (go crazy)\nY'all listen but y'all don't listen (go crazy)\nY'all different but y'all no different (go crazy)\nIt's all in us\nOh my god oh my god\nI can't even stop this song\nNow the kid been getting bananas\nHe going Donkey Kong (Donkey Kong)\n(King of the ape shit)\nHe going Donkey Kong (Donkey Kong)\n(King of the ape shit)"}], "artist": "Lil Dicky"}