{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "When Darkness Falls", "year": "2003-06-24", "album": "The Entity", "lyrics": "[Verse 1]\nIf the deaf could hear and the blind could see\nWould the deaf listen? Would the blind still be\nIn the darkness? (The darkness) Oh, the darkness\nWhen darkness falls... and when you cry I can still see\nIf you want to die, well then come with me\nIn the darkness (The darkness) Oh, the darkness\nWhen darkness falls a jade green flower, and early blue\nShe lets dirty men in her precious womb\nIn the darkness (The darkness) Oh, the darkness\nWhen darkness falls a rich king sits right on his throne\nA shade full soul, he shall die alone\nIn the darkness (The darkness) Oh, the darkness\nWhen darkness falls on you\n\n[Hook]\nWhen the darkness falls on you\nWhen the darkness falls\nWhen the darkness falls on you\nWhen the darkness falls\n\n[Verse 2]\nYou say your God doesn't treat you right\nWould you stop praying? Would you trade your life\nFor the darkness? (The darkness) Oh, the darkness\nWhen darkness falls... I believe my greatest trick\nI made you think I didn't exist\nIn the darkness (The darkness) Oh, the darkness\nWhen darkness falls... even though many have seen despair\nOur loyal subjects, they would not dare\nChoose the darkness (The darkness) Oh, the darkness\nWhen darkness falls... Sex, drugs rapid. Rock and roll\nThese higher tragedies to behold\nIn the darkness (The darkness) Oh, the darkness\nWhen darkness falls on you\n\n[Hook]\nWhen the darkness falls on you\nWhen the darkness falls\nWhen the darkness falls on you\nWhen the darkness falls\nWhen the darkness falls on you\nWhen the darkness falls\nWhen the darkness falls on you\nWhen the darkness falls\n\n[Verse 3]\nThis song is for every kid who's disturbed. Every geek, every nerd\nAll my ghetto children that lay on the curb\nA ruler who can so influence you and give you the nerve\nTo turn that pain and that hurt into some anger and burns\nYou damn angrier than everybody whos faces is heard\nShoot random, 27 bodies is facin the curb\nPractices using voodoo, oujia boards, he prays with these cults\nHe casts upon you, your first born will vacate his birth\nYou sweatin through hot flames while I'm sayin this verse\nArmageddon, you shall remain if you ain't praised in this world\nLife is messy. Careful, you may got blood stains on your shirt\nYou don't like the ways things are going? Trust me, death can't be worse\nMake your choice. Self murder or get saved in a church\nWhile the pure virgin Mary carries this baby of hers\nYou were sent to wash away sins that remain in this world\nThings go good again, but then a dark change will occur\n\n[Hook]\nWhen the darkness falls on you\nWhen the darkness falls\nWhen the darkness falls on you\nWhen the darkness falls\nWhen the darkness falls on you\nWhen the darkness falls"}]}