{"songs": [{"lyrics": "What'd I miss?\n900 cc's of the raw in one fist\nThe bum's dumb blitz\nOrder in the court where the mortars jump bricks\nEverybody, lung on the table, this point counterpoint\nAesop has the murkiest, yet he numb out the prowler oint (uh)\nAnd after bubblegum, he sink into the sofa\nClicker to pilot his broadcasted choice of cobra (hissssss)\nThe venom remains the same game of stale toxins\nCamo'd with the now ornamental satellite options\nWhatever's good I got this grave half dug (true)\nBut Yani covering taps to make the pain worse than it was (nooo)\nPlayin marbles (playin marbles)\nHit by a bus (hit by a bus)\nDeath is sweet (death is sweet)\nHell sucks, sucker\nDamien probably wishin I'd donate a fuck\nBut this shit's chiller than any conversation I've had in months\nThe iron fang drew 'em all loopy (real loopy)\nSo when he extended the hand the planet's Kujo's went Snoopy\nIn perfect synocaption, burnt to crispy critters\nLike synchronized swimmers in boric rivers\nMmmm, poor soaked critters\nLick chop dig-in, who dares lick a shot at pigeons?\nWhy I oughta (Vast get em!)\nHe surfs city circuits for the power and the glory\nTo the cowards in the quarry you will always blink before me\nIts Doc Roc full-effect, campfire stories\nLike I \"Threw Your Momma From the Train\" to try to front on \"Porkies\"\nHe finds the garbage more inspiring than the good stuff (right)\nHis ink sleeps while the military look tough\nLook, im sorry, crooked priority list\nBut Mr. USA-up-all-night's blackened heart already skips\nI'm 'bout to crash this bitch to hibernate\nTell Wolf Blitzer holler at his boy when he hosts \"Blind Date\"\nIt goes spit on CNN and force the war back through the cable box\nWhere M1's are like stage props aimed at latest names dropped\nSo now he ignorant, right? (right)\nNo, he just accepts the inevitable apocalyptic syllabus\nSing along, Zooka dies of chemical poison, and watch 'em\nBring it on\nDag nabbit, that cat's faster\nI dead opinions and swap it out for the urges\nOf a serpent tryin to stuff it in the jam before the curtains\n\nHe's numb to the guns, thanks to the tank cams\nGlued to the box like the opposites will shake hands\nEnough hell for the world's hand baskets\nEnough cells for the world's hand captured\nNumb to the guns, now he touch buttons that'll re-route imagery\nYes dawg, he recognize the history\nYes dawg, he recognize the misery\nBut switch for element of surprise and demise\n\nFrom m-16's or disco and hula-hoops\nMurder the fads before the fads murder you and yours\nMe and mine find T&A on TNT\nPleasin' to the iris more than TNT on DNA\nMorbid but important, I know, stop\nMork porked Mindy in this episode, watch\nPOW be buzzin by the rumbling cannons and less amateurs, bystander analyst\nWent through the \"Holy fuckin' shit I'm gonna die\" phase\nNow it's \"Well, I'm gonna die, let's get this barn's sides raised\"\nSo when they ask what's your opinion on the war?\nI tell 'em \"War sucks donkey dick. What's the Knicks' score?\"\nMaybe it's his allergies, no horns and pitchforks (umm, umm)\nDusk muskrat (uhmm) eleven tusk jab (uhmm)\nElegant bloodbath, leggin it, egg 'em on\nTelevision preg-a-nant and medicine is born\nGet a mean doubt, community duel glazed over blank white sockets\nLookin for a heavy seven richter to shiver the crocs right up out they options\nNovacaine, bloodwork, spoon though the Lochness\nHostage, no shame, suck the fear out his muck\nSo when the nozzles hit his nostrils\nHe don't give a fuck\nAfter all, it's just like on TV around the clock\nThe thorns are real and anger management is not\n\nHe's numb to the guns, thanks to the tank cams\nGlued to the box like the opposites will shake hands\nEnough hell for the world's hand baskets\nEnough cells for the world's hand captured\nNumb to the guns, now he touch buttons that'll re-route imagery\nYes dawg, he recognize the history\nYes dawg, he recognize the misery\nBut switch for element of surprise and demise", "title": "Numb (to the Guns)", "album": "The Prof. in... Convexed ", "image": "https://images.genius.com/d451b51bec1ca443a7b56ab53e97a975.289x289x1.jpg", "year": null}], "artist": "Aesop Rock"}