{"artist": "Benzino", "songs": [{"lyrics": "[Intro - Mario Winans]\nYellowcity, Benzino\nYellowman.. Young Heff\nThat's what they call me\nYellowcity That's where I'm from\nBenzino My nigga\nYoung Heff - c'mon rock!\n\n[Verse 1: Benzino]\nChecking in the closet for my blue Velour suit\nPiping all around it wit the matchin' Timb boots\nHop up in the wagon wit the 20 inch shoes on.. ohh\nRiding down the street wit a twenty G stack\nShorty paging me saying \"Zino where you at?\"\nLook up in the mirror 5-0 up on my back it's - uh ohh\nPull up in the spot smoking in the parking lot\nEverybody having fun niggas don't stop\nPray to God that I don't have to let the guns pop it's\nMaybe all the girls wanna chill wit Benz and Heff\nPushing up the bottle 'til there's no more Henny left\nStep it up to Louie now let's see what happens next\n\n[Hook: Mario Winans]\nWe gon' throw the party (yeah) rock the party (rock)\nThen drink Bakardi (c'mon) freak somebody (freak)\nThen leave the party to the after party y'all.. ohh\nWhat we gon' do?!\nWe gon' throw the party rock the party\nThen drink Bacardi freak somebody\nThen leave the party to the after party y'all.. ohh\nWhat we gon' do?!\n\n[Verse 2: Benzino]\nLookin' at the shorty with the Frankie B. Jeans\nThong hanging out, butterfly belly ring\nButter leather boots with the tassels, that's mean - oh\nGot up on that ass when she came up in the door\nRock it to the beat then we took it to the floor\nDJ in the club spinning record back and forth - oh\nPeople going hard cause you know the mood is right\nEverybody screaming like they at a Tyson fight\nYoung Heff in the back wit a dime looking tight, oh-my - ohhh\nHit the sour diesel mami bouncing on my lap\nVIP crowded so I take it to the back\nUp in the coat room where you find 'Zino at\n(And Mario too, yo)\nNow everybody just\n\n[Hook]\n\n[Verse 3: Benzino]\n5 in the morning more drinks at the crib\nWhachu waiting for, mami? Get your ass in!\nHop up in the coupe, girls riding wit my friend\n(Y-y-y-y-yo, y'all follow us, follow us)\nRolling through the city wit the CD on blast\nPull up at the mansion had to dip up in the stash\nScene looking sexy shorty got a fat ass, oh-my-God\nStep up in the place everybody getting wet\nSweating on the floor dancing like they having sex\nPopping Champagne taking bottles to the neck\nLooking at my Jacob it's about that time\nSun's coming up bout to close the blinds\nThis is how we do almost everyday\nNow meet me upstairs with Courvoisier\n\n[Hook]\n\n[Bridge - Eddie from Yellowcity] (2x)\nWhat is a party if it don't rock?\nWe just gon' proceed to make it hot\nA Yellowcity party, no it don't stop\nWe gon' rock...\n\n[Hook]", "image": "https://images.genius.com/6e1c33f62c229b45d503c4857602a733.1000x1000x1.jpg", "year": null, "title": "Rock the Party", "album": "Redemption"}]}