{"songs": [{"title": "Da Greatest", "lyrics": "[Hook: Female Voice][and Young Jeezy adlibs]\nMany have tried but they can't bring me down\nI'm so high that I can't touch the ground\nI'm the greatest, they hate it\nTo see I made it\nI'm on top of the world\n\n[Verse 1: Young Jeezy]\nMore money, more problems, more haters, more guns\nSomebody go and find the waitress and I bet you I need some more ones\nI'm saying I gets it done and ya'll don't do enough\nI said it's going down so what the fuck is up?\nOn top of my Benz on top of a bitch\nNo Jordan no Sherman I'm on top of my shit\nI'm not dancing I'm all over the place\nRemember back when residue was all over the safe?\nTake them back days I went five days\n120 hours, chef nigga getting paid\nNot one time, I sold every dime\nAnd my joy and my pain nigga every line\nSaid fuck the hygiene I want some fly jeans\nThat's what the bitches like, you like the bitches, right?\nBut why they call you Snow? Cause im the Christmas type\nYou see that nigga's neck? Shine like some Christmas lights\nThat Merry Christmas ice, that Wayne Gretzky ice\nI wouldn't trade this nigga for Wayne Gretzky's life\nI'm good in any Projects nigga every block\nAnd if I have it nigga I'll front a nigga every block\nGo where I want to go, do what I want to do\nSmoke what I want to smoke, screw who I want to screw\nDrive what I wanna drive, say what I wanna say\nThe streets love a nigga, say what you want to say\n\n[Hook: Female Voice][and Young Jeezy adlibs]\nMany have tried but they can't bring me down\nI'm so high that I can't touch the ground\nI'm the greatest, they hate it\nTo see I made it\nI'm on top of the world\n\n[Verse 2: Young Jeezy]\nYou see what I'm up against? You see what I'm going through?\nA million gazillion pounds\nI can't let it get me down\nMy patience just keep me up, my blunt will get me high\nIf we talking a half a pound then that's just to get me by\nSometimes I feel so alone, a nigga can't even lie\nBefore that you start to trip just let me explain why\nMy niggas in graveyards, the rest penitentiaries\nAnd they're never coming home cause they're doing centuries\nSometimes I look at the sky and stare at the fucking stars\nWas it really all worth it for jeans and some fucking cars?\nMaybe it should be, maybe it could be\nBut it ain't though I'm just thankful\nThat's why I drink more, so I can think more\nThink a lot when they're hating on you, bottom is waiting on you\nThese niggas get in these magazines these niggas say anything\nAnd if they get jammed up they'll probably tell everything\nI put that on everything if I say anything\nYou can believe that, and you can believe that\nThese niggas pray on my downfall they want me to fall hard\nBut Jeezy be Bruce Willis cause bitch I'mma Die Hard\nBitch I'mma go hard then I'mma go harder\nBitch I'm a go getter, that makes me a lot smarter\nThink they want me to change but I want to stay the same\nThe more that you stay the same the more that these niggas change\n\n[Hook: Female Voice][and Young Jeezy adlibs]\nMany have tried but they can't bring me down\nI'm so high that I can't touch the ground\nI'm the greatest, they hate it\nTo see I made it\nI'm on top of the world", "album": "Trap Or Die 2: By Any Means Necessary", "year": null, "image": "https://images.genius.com/922d9ddb76700b46d3f2cab838697e37.320x320x1.jpg"}], "artist": "Jeezy"}