{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": "2004-11-16", "lyrics": "[Intro: Sample (R.A. the Rugged Man) {Timbo King}]\nDo you resent the fact that people\nMake a special deal out of you\nPerhaps becoming a white champion in a black dominated sport?\n(Yo, I fuck up anybody, shit don't matter\nWhite, black, I'll fuck you up, you know?)\n{Yeah, that's what his mouth is saying, see in the ring? It's a different story\nYou know what I mean, in the ring, that's a different story)\nIn the right hand corner, wearing black trunks and a throwback jersey\nBlack hat, and black Timberlands, from Brooklyn, New York, Timbo King!\nIn the left hand corner, wearing white trunks, a white wife beater\nAnd dirty white shelltoes, hailing from parts unknown, R.A. the Rugged Man!\n\n[Verse 1: Timbo King]\nAiyo, we black macks, with black hats and black bats\nBlack Panthers, with black gats, twenty-one blackjacks\nTwenty one black knapsacks, black weed\nBlack Friday, nigga, black fistes\nBlack misses, onyx, black Masonic\nBlack tonic, black marble, ask Arnold\nBlack bombers, with black linen, repent black sinning\nSwimming in black women, the Men in Black winning\nBlack Timbs, black jims and black ink\nBlack ice on, black widows in black minks\n\n[Verse 2: R.A. the Rugged Man]\nIn the White House, White Owl, turn the light out\nWhite boy, night out, knock your white ass, right out\nFind out, white dog, white bitch, white fist\nBeat your bitch like this, white dick, white sheets\nDevin make white beats, suburban kids from the white streets\nJames Cagney, white heat, White Sox\nWhite rocks, white cops in donut shops\nWhite blocks, 'Nam vet white pops\nWhite three the night creatures, white sneakers\nWhite wife beaters, thin lips, white features\nWhite powder, Snow White, snow, hit the ho right\nWhite trash, low life, Whitesnake, so white\n\n[Hook]\nBlack, white, black, white\nBlack, white, black, white\n\n[Verse 3: Timbo King]\nBlack men with black belts on, black denim style\nSmoke a Black & Mild, laying down black tile\nBlack souls, lost in black holes\nBlack robes, fuck bitches out on Black Gold\nBlack seeds, black eyed peas, black pepper\nItalian black leather, fade to black\nBlack models, sport black Movados\nBlack Moet bottles, holla back, black star power\nBlack Rottweillers, black nines, black on black crime\nWhose skin blacker than mine?\nBlack spades, giving lames black eyes\nBlack Foot Indian tribe, Blackberries\nBlack Pelle Pelle's, black Israeli go to war with black skullies\nHummer's with the Black Pirellis, Armor All\nBlackball, black label, alcohol\nBlack ho, beat a nigga up, you know how that go\n\n[Verse 4: R.A. the Rugged Man]\nI'm Gerry Cooney white, Ingemar Johansson white\nSquare dance type, dancing white, I'm Charles Manson white\nSteal ya land white, Rugged Man white\nIrish white type, like to fight, white knight\nBlue eyed white Christ white, nighty night light\nToys R Us light bright white, Simple Life white\nNice life, knife fight white, Great White Hype white\nUncle Ben's rice white, hate life white\nAngel food cake white, white guys recognize\nSee the whites of their eyes, white skin, white lies\nHouse of Pain white, Everlast, Kurt Cobain white\nElvis, simple and plain white, John Wayne white\n\n[Hook]", "title": "Black and White", "image": "https://images.genius.com/3bdbfd263ed5b58a13c023066d2c7c74.900x900x1.jpg"}]}