{"artist": "ILL BILL", "songs": [{"title": "Pain Gang", "lyrics": "[Intro]\nYou been to jail before?\nMe? Of course I’ve been to jail. They don’t even want me in jail no more, I’m too old now. They want guys like you\n\n[Hook: Ill Bill]\nBloods and Crips, the Ñietas, Latin Kings, Disciples, and Vice Lords\nAll crews that bang\nVatos Locos, Four Corner Hustler thing, the Mexican Mafia\nAll crews that bang\nAl-Qaeda, CIA, Hamas, the Mossad, NYPD\nAll crews that bang\nNon Phixion, Cypress Hill, House of Pain, La Coka Nostra\nAll crews that bang\n\n[Verse 1: B-Real]\nFrom Don Corleone or to Tony Montana\nWhatever you are, homie, bikers or bandanas\nRiders who cock hammers and soldiers who roll deep\nI’m a child of the night, homie I don’t sleep\nMy crew, we slow creep while you’re counting your sheep\nWe bang on anybody stepping up they bleed in the street\nMaybe you got what it takes to lead a team of cutthroats\nMaybe you hang around with a crew of fuckholes\nFakes, frauds, fictional bangers\nNever held a heater til you had someone take your picture\nLooking invincible with it, you did it for glory\nSome did it for real and others they tell stories\nBut the collective we have here’s respected\nMaking you an offer you should never reject it\nYou roll with the bowl over, baby the math is simple\nIt’s pop pop pop in your temple\n\n[Hook]\n\n[Verse 2: Everlast]\nIRA scheming, PLO dreaming, Celtic heathen, peckerwood demon\nKicking and screaming through the depths of hell\nBareback riding on a jezebel\nThe hammer’s cocked, you get shot by the shell\nI burnt an angel’s wings then sang while he fell\nThere’s a party in hell, there’s a war in heaven\nThe whole world been shook since 9/11\nWith Muslim extremists and Zionists\nTrying to rule the world with an iron fist\nWhile the junkies and the dealers are doing the bids\nUncle Howie say it’s time for revolution, kids\nDon’t spill your blood on foreign land\nCome outside on the block with your gun in your hand\nIf you’re mad as fuck and won’t take it no more\nBuck shots in the air like you ready for war\n\n[Hook]\n\n[Verse 3: Ill Bill]\nWe don’t die, we multiply\nThis song was not made to glorify gang culture\nNor to explore the lives of soldiers or street villains\nGhetto superstars, political heroes\nCompton G’s to Brooklyn Deniros\nRaised from children to killers, prisoners to peace prize winners\nWas Nelson Mandela a terrorist?\nLet’s consider the truth: The biggest gang in the world is the police\nOur tax dollars pay for no justice and no peace\nAn empty crack vials crushed by ten year old feet\nOn their way to school past the meth heads and dope fiends\nAnatomy of a true banger, I ain’t shit without my homeboys\nFuck with my set, you get your goons strangled\nI won’t be convicted like Jimmy Coonan\nAnd you're not a gangster, who the fuck you think you fooling?\nMy ruthless brilliance soon to produce me millions\nBilly Idol homeboy, peace to Tookie Williams\n\n[Hook]", "image": "https://images.genius.com/457870257e417a35d5715090c07a987d.1000x1000x1.jpg", "album": "The Hour of Reprisal", "year": "2008-09-16"}]}