{"artist": "C-Rayz Walz", "songs": [{"title": "Making the Jux", "album": "The Dropping: Colonic Progression", "year": "2006-12-09", "image": "https://images.genius.com/6b25ad51eed6c2fabb94a09773ba6ca1.700x700x1.jpg", "lyrics": "[Intro: 4th Pyramid]\nYeah, give me an aspirin pill, motherfucker\n\n[Bridge: C-Rayz Walz] (x4)\nMaking the jux\n\n[Verse 1: C-Rayz Walz]\nWe could start with a rural report in the war with orcs\nI don’t pop cops no more—I four-four the porks\nMorbid joints shook your skeleton with tour de force\nMilitary corps stalk and secure my porch\n‘Cause they know I’m the house with Lord Voldemort\nWhen they Slytherin, I Gryffindor across the port\nHock spit, talk shit, rich with no cash\nOff the Walz, I still write graff.  Want to toe-tag?\nI shake piss in your face but I ain’t shaking your hand\nAnd I won’t support you, so I’m making a band\nIt’s getting in here (Yeah!).  I’m taking your fans\nGet your feet above my clan and I’m breaking your handstands\nYou want cock.  You don’t want to bust your Glock\nYour gun don’t work.  Your consortium is anti-pop\nIn the hood, I got clout with killers.  No doubt\nBefore I’m out, let me shout, “My niggas”\nMove-ment\n\n[Verse 2: 4th Pyramid]\nBig talk mean that you little shit riddles\nSpit, fiddle with flow type ridiculous\nNo hype, meticulous.  Hold mic for Pyramids\nForget the clout and fame\nNeed some dough.  Give me that and I’m out the game\nNot out to claim.  Well, hell, it’s the joint, kid\nOut to sell well but I’m self-appointed\nSo hot, left the kettle boiling\nInternet addict intercept bad shit\nInnocent madness.  Magnificent bastards\nDelivering rapper, limerick splatter\nLiving in chapter of serum and dagger\nFans cheering the batter, freedom from stature\nMeaningless actors, I will pee on your mattress\nBeat, I’ve been mean in the madness, just too busy\nMeeting these rap kids, fleeing arachnids\n\n[Verse 3: C-Rayz Walz]\nYou in hot water now, pasta boy.  Watch the void\nMy Leonard Nimoy thugs Spock your voice\nStop the noise, stop your noise.  What?  I’m Def\nJux to the illest manifestation of fresh\nYes, yes, I’m blessed with the rhythm of rebels\nFor sixteen bars, the god get gold medals\nFo sho, we got spare ass-whippings, spare flows\nSpear thrown through his chest.  Now George Bush is soaked\nOh!  Oh!  Man, don’t you know I’m grown?\nMy special blends in the cut.  The gems’ll get cloned\nI write essays, smash when my Brothers Slide\nYou ain’t peace, partner.  Why you thinking otherwise?\nMy up-north Cannibal niggas stay Oxing\nFuck you up in a shower, call it, “Roller-Derby Boxing”\nMake long stories shorter than cheeba tales and midget reporters\nWhen I flow, I’ll keep my head above water\n\n[Verse 4: 4th Pyramid]\nFlows track to the beat, goes back to the deep\nEssence of percussion.  Go back to sleep\nMind free from worry.  Need to let out more steam\nSeems that I’m blurry in a holographic state\nHolographic raves follow massive blades\nGot to stash the pain.  A lot of rappers claim\nTeardrops splash and rain.  Ayyo, hold up...\nThe fax just rang\nI got to make a move soon.  Money, pass the gin\nLaugh within.  Really, I don’t have to grin\nProtect your skin.  You Earl Grey?  I’m peppermint\nIf it’s the end of the day, let’s begin\nI’m granny, knitted you an amateur sweater\nHer pain guy telling you my manager’s better\nIt’s 4th P on the damage vendetta\nMad ‘cause you hot, but I’m brandishing leathers\n\n[Verse 5: C-Rayz Walz and 4th Pyramid]\n[C-Rayz Walz]\nSpicy swirl girls twirl and scratch nuts\nWhile I’m in the White House with a black tux\nForce you to be mute when I step values\n‘Cause most of y’all already dropped a wack album\n[4th Pyramid]\nPeruvian poon-poon knocking on my windowsill\nShe’s a nympho.  Still, we going in for a kill\nCome on, nigga, we don’t live a lil\nAnd make the river still, plus the Sun black\nAnd, at that point, ask, “Where your guns at?”\nAt that point, ask, “Where your guns at?”\nWhat?\n\n[Outro: C-Rayz Walz and (4th Pyramid)]\nWhere your guns at?  Where your guns at?  You got no shells.  (And that’s it right there).  Aight"}]}