{"songs": [{"image": "https://images.genius.com/d8ab635827060eb71d3130b28c7cd04f.1000x1000x1.jpg", "title": "Come on a Cone", "album": "Pink Friday: Roman Reloaded", "year": "2012-04-02", "lyrics": "[Verse 1]\nUh, uh\nBitches ain't serious, man, these bitches delirious\nAll these bitches inferiors, I just pimp my interiors\nI just pick up and go; might pick up a ho\nMight give conversation, if you kick up the dough\nNever mind my money; never mind my stats\nEvery bitch wanna be me, you can find 'em in Saks\nPink Friday, two milli; \"Super Bass,\" triple plat\nWhen you see me on Ellen, just admit that I'm winnin'\nDo a show for Versace, they request me by name\nAnd if they don't get Nicki, it just won't be the same\nWhen I'm sittin' with Anna, I'm really sittin' with Anna\nAin't a metaphor punchline, I'm really sittin' with Anna\nFront row at Oscar de la Renta posture\nAin't a bitch that could do it, not even my imposter\nPut these bitches on lock out, where the fuck is your roster?\nI pull up in that new new marinara and pasta\n\n[Hook]\nShake my head, yo, I'm mad, ain't a bitch in my zone\nIn the middle of nowhere, I just feel so alone\nGot the certification, 'cause it come with the stone\nBut, this ice is so cold, it should come on a cone\nIt should come on a cone, it should come on a cone\nYeah, my ice is so cold, it should come on a cone\nIt should come on a cone, it should come on a cone\n'Cause my ice is so cold, it should come on a cone\n\n[Verse 2]\n7-Up went and gave my commercial to Cee-Lo\nBut don't tell them I said it, let's keep it on the D-low\nIf you need you a look, just put me on your song\nBut you know it'll cost about six figures long\nBut you bitches ain't got it, where the fuck is your budgets?\nFlyin' spurs for hers, mean I'm fuckin' above it\nAnd I just got the ghost, and I'm calling it Casper\nBut this shit is so cold, it belong in Alaska\nWhy the fuck am I styling? I competes with myself\nWhen you went against Nicki, you depleted your wealth\nAnd I'm not masturbatin', but I'm feelin' myself\nPaparazzis is waiting, 'cause them pictures will sell\nNow don't you feel a-stupid, yeah, that's egg on your face\nIf you wasn't so ugly, I'd put my dick in your face\n\n[Interlude]\nDick in your face\nPut my dick in your face, yeah!\n\n[Hook]\nShake my head, yo, I'm mad, ain't a bitch in my zone\nIn the middle of nowhere, I just feel so alone\nGot the certification, 'cause it come with the stone\nBut this ice is so cold, it should come on a cone\nIt should come on a cone, it should come on a cone\nYeah, my ice is so cold, it should come on a cone\nIt should come on a cone, it should come on a cone\n'Cause my ice is so cold, it should come on a cone\n\n[Outro]\nOoh, dick in your face\nOoh, dick in your face\nOoh, dick in your face\nPut my dick in your face\nPut my dick in your face, yeah, yeah!\nYeah, yeah\nYeah, yeah\nYeah yeah, yeah yeah, yeah yeah, yeah yeah, yeah yeah, yeah yeah\nYeah!"}], "artist": "Nicki Minaj"}