{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/13e8c687e539572b0d79f0fc8cf1018e.1000x1000x1.jpg", "title": "4, 5, 6", "year": "1995-09-26", "album": "4, 5, 6", "lyrics": "4, 5, 6 is in the mix - I'm hittin them with trip's\nHeadcrack, time to get the bread black!\n4, 5, 6 is in the mix - I'm hittin them with  trip's\nHeadcrack, time to get the bread!\n\nI rolled on every cee-lo corner that I know inside the city\nKiddies, I got a fat mitt in my pocket lookin pretty\nSo who wanna get paid on the block?\nA thousand's in the pot\nNow go and grab your knots from the stash spot\nI shake them up and shake them up\nRoll and I break em up\nTwo tracies and a pound-cake\n(\"Yeah nigga, wake em up!\")\nKeepin my fingers wrapped around the joint\nIn case niggas start brawlin\nBecause I see em falling to the strong point\nOne by one they losin down the line\nA fifty\nFucked roll or duck pose\nOh nigga pay me mine! (\"Damn nigga!\")\nI grab the dice\nPlace your price, all you men are mice\nRiffin as I'm sippin on a Heineken and gettin nice\nI shake them up\nThey papes are gettin deader\nNigga sittin on a Beretta\nSaid he wanna bet that I don't throw a better\nNow the game is surrounded by some money hungry bitches\nI put the kisses on my fists and rolled the triple sixes\nAnd once again it be the point that I shoot\nThat be puttin crazy loot\nIn the pocket of my army suit\nNow who wanna come fo' another round?\nI rolled a Fo, a six, hold up\nNow I seen a fuckin pound\nYeah\nYou niggas know what the name of the game is\nI'm in yo' anus\nCee-lo, you know\nThat shit that made a nigga famous\nHookers up on the ding-dong\nI can't go wrong\nRollin for two hours long\nAnd still rollin strong\n\n4, 5, 6 is in the mix - I'm hittin them with trip's\nHeadcrack, time to get the bread black!\n4, 5, 6 is in the mix - I'm hittin them with trip's\nBettin' Grants with the cee-lo champs\n\nI make em sweat from beginners to the vets, I'm a threat\nSome niggas double up on they fifty bets\nI gotta be nice to the dice, so I'm talkin to em\nI step back, gave a tap on the sidewalk and threw em\nNigga went and put his foot in the way see\nAnd tried to ace me\nNow I got niggas rollin to that bitch Tracy\nYeah, but Tracy ain't too gentle\nNiggas thought she was simple\nAnd loses with two deuces and a fuckin pimple\n(\"A loser!\")\nI crack another brew, sit back and watch what niggas do\nWho threw that 2? you? I'm rollin the whole fuckin crew\nOne by one niggas come payin, that fell to the trey'in\nFurlough inside the bait, that's what a nigga sayin\nYour luck is tough, I'm makin enough to buy a kilo\nUh-oh, look out below, I think I rolled another cee-lo\nPick up my crap, niggas don't get back a dime of that\nAnd keep my hand right by my waist where my nine is at\nOne more test, and niggas quittin, that's zero\nBroke, cryin broke, I'm doin backstrokes in cee-notes\nCrazy pockets are empty, what a god damn shame\nNiggas you know the name of the game - word the fuck up!\n\n4, 5, 6 is in the mix - I'm hittin them with trip's\nHeadcrack, time to get the bread black!\n4, 5, 6 is in the mix - I'm hittin them with trip's\nBettin' Grants with the cee-lo champs\n\n4, 5, 6 is in the mix - I'm hittin them with  trip's\nHeadcrack, time to get the bread black!\n4, 5, 6 is in the mix - I'm hittin them with trip's\nBettin' Grants with the cee-lo champs"}]}