{"artist": "Wale", "songs": [{"title": "BET MMG Cypher", "year": "2011-01-01", "lyrics": "[Wale]\nOff rip, I'm a double M-G nigga\nRunning this shit bet you lil' niggas flea-flicker\nWindows down, letting bitches snicker\nGot cheap bitches, got cheap liquor\nDropping C-notes on strippers at the casino\nI'm making movies: them Kill Bill's and Tarantino's\nLyrically Aristotle, lyrically can't see it\nThem bammas can't see the bars, y'all some paralegals\nI smoke sweets in the suite, like this shit is legal\nCover the building in green my nigga: Fred Segal\nHa, okay that 90210 talk\nBitches talk to me, and they send you niggas postcards\nWhat you think I flow for? Y'all niggas is old dog\nY'all over the hill like you tryna race a soapbox\nAnd even if I'm broke, dog\nI'd rather have no job than no heart\nWale!\n\n[Pill]\nFlow retarded, I need to wipe the slob after every bar\nWreck beats daily, have 'em looking like Halle Berry car\nAccidents happen when I got the Mac in hand\nMic defibrillator give haters heart attacks in advance\nIt's M-O-E, so all I need is more chips\nSwag stand out like pimples and cold-sore lips\nUgh! Pill hotter than a snotty nose\nBody doze, who not exposed, give em karate blows\nLiu Kang the way I kick it, bumping Wu Tang\nTry to protect the neck, I ? from ya boo thang\nParking lot of the blue flame, flows hotter than butane\nIf you lame, the only way you hang is like Hussein\nSee, there's a war going on and I'm the general\nAnd I'mma speak it directly at ya: no subliminals\nSee, all my life I was raised by a lot of criminals\nSo all I know is scratching my pistols and my genitals\n\n[Stalley]\nPicture this: picking kicks out of Foot Locker\nThinking how I could rid evil and let the good conquer\nI'm mixing mad emotions, you know the hood'll haunt ya\nDriving you bonkers, eating roaches, yeah: just look at Yonkers\nMost of them ain't conscious, they just monsters, tryna be some mobsters\nThey call me conscious, and I think I'm better\nCause I'll be honest\nI ain't tryna be a victim of the projects or a uniformed man\nI'm tryna uniform 10 million men\nUnify them, mob through, take over and\nMaybe I'm beyond myself, maybe these are my thoughts\nShould I die by myself insubordinate?\nI start a revolution by myself, niggas better call for help\nTil there's no telling whose side are you on?\nPick one or move on, a war going on outside no one is safe from\n\n[Meek Mill]\nSelf-made, 60K the first week\nI signed with Maybach, and we did that ish the 1st week\nBefore this rapping, I was trappin', getting work cheap\nNow it'll cost you 30 racks to get a verse cheap\nSheesh! I'm like R.I.P\nI dropped 2Pac Back and did it B.I.G\nAmerica's most wanted like Chi Ali\nI'm too young to be doing this, they need to see ID\nRoss said I'm hot, Tip said I'm hot, Swizz said I'm hot\nYour chick said I'm hot\nI went and bought a whip for some chicks and a drop\nNow my watch fruity colors like Trix in a box\nThe money ain't running, it's standing still now\nI'm getting it, hustlin' like I'm still down\nSuckas is talking like I ain't still around\nThey can't deal with me, I got a deal now\nBig face hundreds, big face Rollies\nI be throwing deuces, suckers they don't know me\nMMG the team, and I think I'm Kobe\nI'm ridin' on that thing with 20's like Ginobli\nG-5 sitting on the runway\nJust to go to LIV on a Sunday\nI spend it make it right back on a Monday\nAll my niggas rolling, and we bout that gun play\nMeek Milly\nMMG\n\n[Rick Ross]\nIf you don't know, Maybach is the clique\nI'm screaming \"Maybach!\" til I'm rich\nAll the chicks see the money, clothes never bummy\nSatin to the silks, I'm icy when it's sunny\nLook around: we the largest in the game\nAll them other boys targets and I'm flawless with the aim\nHit your block with a Glock, blog that\nNorth Philly, Meek Milly - where my dogs at\nDC, Wale - nice ball cap\nNew golds Rolls Royce, yeah I'm all that\nCouple milli in the bag and my face good\nBuy a chick a new pad when she taste good\n10 chains, hustle hard: Ace Hood\nSmoke ? you know it taste good\nScoop pills, 5 G's on a phone bill\nSunlife Stadium, smoke on my home field\nMMG man, we smoked out", "album": null, "image": "https://images.genius.com/e0cde0eabe61c1ddca97cce2386792d2.421x421x1.jpg"}]}