{"songs": [{"image": "https://images.genius.com/e8f9be6df36a6370218e9971d5cb2867.640x640x1.jpg", "title": "Let’s Talk About It", "album": "Lord Willin’", "year": "2002-08-20", "lyrics": "[Intro: Jermaine Dupri]\nUh huh, oh\nOh, damn baby\nShit...........\nHow you get all that in them jeans?\nNevermind that, you hear this?\nIt's that Star Trak\nClipse, (get down!)\nSo So Def\n\n[Verse 1: Pusha T]\nQuestion - ask any nigga\nRapper or a hustler, who rocks is bigger?\n(Pharrell Williams) - The rapper!\nNaw, dawg, go figure\nWith the B-12, I make that straight killa\nI flood the block, I hug the Glock\nI have a whole neighborhood asking a thug to stop (Stop!)\n'Cause I show 'em what Waco see\nThen hit the district pay a visit to Jac-o-b\nI like my diamonds colored, watch is smothered (me too)\nShow off at the place of jewels, let the white man love it (hahaha)\nI'm too much, got bitches out for me\nBring 'em home, give 'em they choice of balcony\nShe said \"We can have more fun\", I said \"How can we?\"\nThen she brought her girl in and ate her out for me, wow (Wow!)\nAll night sexin', just think, this all came from one question\n\n[Hook: Jermaine Dupri]\nYou got a big ass bell? Lemme see you jingle it baby\nYou got a big ass bell? Lemme see you jingle it baby\nWanna talk about cars? Lets talk about it\nWanna talk about a house? Lets talk about it\nWanna talk about jewels? Lets talk about it\nWanna talk about money? Don't talk without it\nWanna talk about chicks? Lets talk about it\nWanna talk about hits? Lets talk about it\nWanna talk about cris? Lets talk about it\nBut when you talk about cash, don't talk without it\n\n[Verse 2: Jermaine Dupri]\nNow as the game rotates, and my chrome gets bigger\nMore and more girls wanna fuck this nigga\nHard for a chick not to stick around\nWhen I come through town, layin my dick down\nThey can tell a true playa by the clothes that I wear\nGame that I spit, and the length of my hair (Ok)\nThe more I come, the more I cum, get it?\nWhat you see now, I been done did it\nEvery girl around, I been done hit it\nCars been kitted, since I was sixteen\nAnd yes, I'm still spendin' that Kris Kross cream (haha)\nBig boy moves, big boy shine\nBig boy watch tell big boy time\nEverybody know I got the recipe, so you know ya'll niggas can't mess with me\nMatter of fact, I don't even gotta say no mo' (Oh)\n\n[Hook: Jermaine Dupri]\nYou got a big ass bell? Lemme see you jingle it baby\nYou got a big ass bell? Lemme see you jingle it baby\nWanna talk about cars? Lets talk about it\nWanna talk about a house? Lets talk about it\nWanna talk about jewels? Lets talk about it\nWanna talk about money? Don't talk without it\nWanna talk about chicks? Lets talk about it\nWanna talk about hits? Lets talk about it\nWanna talk about cris? Lets talk about it\nBut when you talk about cash, don't talk without it\n\n\n[Hook 2: Pharrell Williams and Jermaine Dupri]\nNa na, (OH) na na na na na na\n(Come on girl)\nNa na na na na na (Oh)\nNa na na na na na na (Come on girl)\nNa na na na na na (Oh)\nNa na na na na na (Come on girl)\nNa na na na na na (Oh)\n(I want you to move your waist for the whistle)\nNa na na na na na (Come on girl)\n\n[Verse 3: Malice]\nIt ain't too many things that exceed my reach\nSpeedboat, glass floor, let you see underneath\nBut nevermind that though, I'm just showing off\nAs I do in the Porsche with the top lost\nI ain't change the game hash, you know the name as\nMalice in my wrist, like shattered stain glass\nI generate them Franklin's and Grant's\nEach ear look like a halogen lamp\nI'm high beamin, at the same time leanin'\nIn the butter soft seat that keep a street thug scheming'\n'For we compare paper, get your weight up\nI need more points than that, don't you play with me, Jacob\nYou see me on my back, you see me live\nI'm every color of the spectrum, like ROY G. BIV\nLook dawg, get a load of how daddy ball\nWanna talk about cash?\nWell I done said it all\n\n[Hook: Jermaine Dupri]\nYou got a big ass bell? Lemme see you jingle it baby\nYou got a big ass bell? Lemme see you jingle it baby\nWanna talk about cars? Lets talk about it\nWanna talk about a house? Lets talk about it\nWanna talk about jewels? Lets talk about it\nWanna talk about money? Don't talk without it\nWanna talk about chicks? Lets talk about it\nWanna talk about hits? Lets talk about it\nWanna talk about cris? Lets talk about it\nBut when you talk about cash, don't talk without it"}], "artist": "Clipse"}