{"songs": [{"year": "2011-03-28", "image": "https://images.genius.com/ae59ac20cf16e3a440904aa06dd710ac.1000x1000x1.jpg", "title": "American Rapstar", "album": "Return of 4Eva", "lyrics": "[Intro]\nAn A&R once told me\n“You can determine the worth of a song within 15 seconds of it playing”\nWith complete and utter lack of the fact\nThat it takes takes all 3 minutes and 40 seconds of a song\nTo comprehend what I’m saying\nIt ain't a single if it don’t fly\nIt ain't a hit if it don’t ride\nNow he couldn’t tell me the components of a smash\nBut the ringtones were their all-time high\nAnd a rappers only as big as his chain, the flashier the better\n\n[Hook]\nThey say \"money make the world go round\"\nYou never lost til you lose your crown\nAnd they don’t love you till you’re under ground\nOr when you’re maxing out your bank account\nYeah, you do it all just to live the life\nEven if it means you don’t live it right\nAnd even if it means you don’t survive the night\nBut if even if you do you won’t survive the hype\nOf an American rapstar\n\n[Verse 1 - Big K.R.I.T]\nPush it to the limit (Why?)\nJust to get up high with a wood grain kitted?\nRide around town like I never lived in it\nGun in my dash, pray I never kill with it\nI’m that real with it\nGot my eyes on the prize\nBills still due, motherfuck 9-5\nSearching for a freak that wanna fuck once or twice\nWanna buy a bottle but I ain't paid my tithes\nThis ain't no lie, I got a vision and a masterplan\nTo hit the block and blow up like a Taliban\nI make it where the plane never have to land\nI make it where them lames never stand a chance\nShit, you’ll never know, only time’ll tell\nYou either starve or you find the scale\nYou either buying or you tryna' sell\nYou either fall or you grind the rails\n\n[Hook]\n\n[Verse 2 - Big K.R.I.T]\nSo watch me get it how I live\nWaiting on my moment, screaming fuck how they feel\nDodging jail cells and them pigs down to kill\nThey shot Oscar Grant swear it gave a nigga chills\nLets keep it real, if you ain't looking keep your eyes closed\nWill I pay what I owe? Only God knows\nI ain't for sure, give me strength just to change what I can’t\nAnd understand the difference between a nigga and the King that I am\nGotta keep ya finger on the trigger\nPac died, Biggie died, they ain't found a killer\nMomma say she worried ’cause I rap about the Government\nAnd how the Church caked other people out there struggling (its real though)\nI just call it how it is, folk\nI’m breathing for a reason, what you here for?\nThey got it where the villains who we cheer for\nCause they murdered all the heroes\n\n[Hook]"}], "artist": "Big K.R.I.T."}