{"artist": "Fabolous", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/8e2843dcf4a386d5de04cd6e203899e1.391x391x1.jpg", "lyrics": "(feat. Paul Cain)\n\n[Fabolous (FAB) (DJ Clue):]\nLadies and Gentlmen\nIts my pleasure to present to you (My pleasure) (Yeaaa, Yeaaa)\nStreet Family (Ah Ha, Ah ha!)\n\nStreet Fam, that Street Fam (Woo Woo)\nIt's the realest that you've ever seen (New Fabolous, Paul Cain)\n\nAnd ya'll know who I be right? (Come, On!)\nLo, Lo, Lo Lo Lo Loso (Yea!)\nLo, Lo, Lo, Lo Lo Loso\nLo, Lo, Lo, Lo Lo Loso (WOOOOOOOOOOO!)\n\nIt won't stop, until I do the numbers im suppose to\nAnd my accountant got as many numbers as a social\nWith a beach house that's, somewhere on the coast to\nBunch of bad bitches that some of ya'll propose to (CLUE CLUE!)\nI hear niggas talk, dummer then they suppose to\nI plug a leak, like a plumber is supposed to\nRide this clean yea, summers gonna pose you\nPlease don't make me be the someone who expose you, (Word Word!)\nI snatch ya kids, or someone that you close to\nThen the body parts start coming in the postal\nSummers getting close too, gotta go drop\nI gotta slow bop in the Prada low tops\nMy Domicana sell out a co-op\nShe also can suck the gum outta blow pop (Woo!)\nThe feds wanna talk to my accountant too\nThey heard I bottle green like mountain dew\nToo many rocks to be countin boo\nThe globe look like the one in the Scarface fountain do\nBut they can't take the ayto (Nah!), point blank will open ya face, (Nah)\nTill the white like a baked potato\nAnd I'm not new at this\nI'm on the jet, but ain't nothing change but the pilot line and the stewardess (Ah ha, Ah ha!)\nA guy in fur, continental flying spur\nYou might wanna keep an eye on her (CLUE CLUE!)\nTheres no question amuse**\nBefore I have her in sex positions, that look like wrestling moves, (Damn)\nGet some chest shots, coming my way\nBelieve me (Yea!) ya best not stop at my gate, (Yea!)\n3 cars, the rest not in the drive way, (Yea!)\nYou know I got rest spots like a highway (Yeaa!)(Ah Ha)\nAnd mid-town, the loft cost BIG\nThe jersey, back-yard is golf course BIG (uhh huh)\nBrooklyn, Miss Jade of course BIG\nAfter that its ME, F-A-B...you knowww ( ah ha ah ha! )\nNow what you know about chauffers (huh?)\nThe roof tucked in like a fold out sofa (woo!)\nIt's more heat when I spray off rhymes\nThe price is up like floor seats at playoff time\nYou Feel Me?\n\n[Paul Cain (PAUL) (DJ Clue):]\nChea ( Yea Yea)\nHey Yo Fab I got these Niggas (Come On!)\n\nThis shit don't stop until the cribs like Madison square\n5 in's in income is what I average a year\nPoppin corks, not the real talk but Fab in a leer\nRight now, im dead close I ain't braggin I swear, (Ah ha, Ah ha)\nCause im a hustler, I eat like im suppose\nFab taught me to watch people, mainly the leechs and the hoes\nIm the long end beefin with my foes, and the chicks freakin after shows sippin peach and different flows\nI even taught my young boys to speak to me in code\nCause its hard to tell, which niggas leakin to the po's ( Yea Yea!)\nThese boys in the hood, wanna creep me and I knows\nJust said a couple sandles would keep me on my toes\nSo I travel with the meanest cause the last two bodies that drop\nThose niggas walk around the hood like ballerinas\nFrom the scurviest I learned that the wrachet in the beamer (WHAT!)\nCalm my nigga down with the saddest look to meaner\nI would be damned if that ain't true\nTalking reckless on smack when, we all not that ain't you, (Aww Noo)\nNigga you actin out of character, reading from a movie script\nCross me, and Imma have to do you from the uzi grip\nYour shits hilarious, you think u gonna fool me prick, (huh?)\nYou a fraud, I know the clown niggas you be with\nThey don't draw guns, they draw sketches for the jake\nAnd I know know? The diamonds in dem neckless' is fake, (CLUE CLUE!)\nAnd im known over sea's but respected in the states\nAsk clue, but im gonna throw the heckle in yo face, fuckin snakes, CHEA\n\n[DJ Clue:]\nYea mannnn...Yea Man\n\nHes a Hustler! Hes a Hustler.. Part!...part one\n\nYa'll see Me", "title": ".44 Freestyle"}]}