{"artist": "Iggy Azalea", "songs": [{"title": "Fancy", "lyrics": "[Verse 1: Iggy Azalea]\nFirst things first, I'm the realest (Realest)\nDrop this and let the whole world feel it (Let 'em feel it)\nAnd I'm still in the Murda Bizness\nI can hold you down, like I'm giving lessons in physics (Right, right?)\nYou should want a bad bitch like this (Huh?)\nDrop it low and pick it up just like this (Yeah)\nCup of Ace, cup of Goose, cup of Cris\nHigh heels, something worth a half a ticket on my wrist (On my wrist)\nTaking all the liquor straight, never chase that (Never)\nRooftop like we bringing '88 back (What?)\nBring the hooks in, where the bass at?\nChampagne spilling, you should taste that\n\n[Chorus: Charli XCX]\nI'm so fancy, you already know\nI'm in the fast lane, from L.A. to Tokyo\nI'm so fancy, can't you taste this gold?\nRemember my name, 'bout to blow-oh-oh-oh\n\n[Verse 2: Iggy Azalea]\nI said baby, I do this, I thought that you knew this\nCan't stand no haters, and honest, the truth is\nThat my flow retarded, each beat dear, departed\nSwagger on stupid, I can't shop in no department\nAnd get my money on time, if they got money, decline\nAnd swear I meant that there so much that I give that line a rewind\nSaid I get my money on time, if they got money, decline\nI just can't worry 'bout no haters, gotta stay on my grind\nNow tell me, who that, who that? That do that, do that?\nPut that paper over all, I thought you knew that, knew that\nI be that I-G-G-Y, put my name in bold\nI been working, I'm up in here with some change to throw\n\n[Chorus: Charli XCX]\nI'm so fancy, you already know\nI'm in the fast lane, from L.A. to Tokyo\nI'm so fancy, can't you taste this gold?\nRemember my name, 'bout to blow-oh-oh-oh\n\n[Bridge: Charli XCX]\nTrash the hotel, let's get drunk on the minibar\nMake the phone call, feels so good getting what I want\nYeah, keep on turning it up\nChandelier swinging, we don't give a fuck\nFilm star, yeah, I’m deluxe\nClassic, expensive, you don't get to touch, ow!\n\n[Verse 3: Iggy Azalea]\nStill stunting, how you love that?\nGot the whole world asking how I does that\nHot girl, hands off, don't touch that\nLook at it, I bet you wishing you could clutch that\nThat's just the way you like it, huh?\nIt's so good, he just wishing he could bite it, huh?\nNever turn down nothing\nSlayin' these hoes, gold trigger on the gun like\n\n[Chorus: Charli XCX]\nI'm so fancy, you already know\nI'm in the fast lane, from L.A. to Tokyo\nI'm so fancy, can't you taste this gold?\nRemember my name, 'bout to blow-oh-oh-oh\n\n[Outro: Iggy Azalea & (Charli XCX)]\nWho that, who that? I-G-G-Y\nThat do that, do that, I-G-G-Y\nWho that, who that? I-G-G-Y\n(Blow-oh-oh-oh)\nWho that, who that? I-G-G-Y\nThat do that, do that, I-G-G-Y\nWho that, who that? I-G-G-Y\n(Blow-oh-oh-oh)", "image": "https://images.genius.com/e9a04c0d861e4f38ba89221f460077f6.1000x1000x1.jpg", "album": "The New Classic", "year": "2014-02-17"}]}