{"artist": "Willie D", "songs": [{"year": null, "lyrics": "Pastor:\nHey siter Bettie, sister Clara\nAnd who is this?  You new here, ain't you brother?\n\nWillie D:\nYep\n\nPastor:\nWell welcome to Mount Paid in Full\nGod sure is good, ain't he?\n\nWillie D:\nSure is\n\nPastor:\nWell we gonna ask you to put all you valuables in this here cup\nAnd pass all your other metal objects to brother Swaggert\nYou can pick em up over there on the other side\n\nWillie D:\nWhat, y'all having a problem with weapons or something in Church?\n\nPastor:\nNo, brother, it's just that Pastor Gimme don't want no change in the\nChurch\n\nVerse 1:\nAin't that a bitch, the churchhouse getting rich\nBut I'm looking like dookie on a stick\nAs soon as I walked in, they couldn't wait\nTo pass that goddamned collection plate\nAnd before I could stick my dollar in\nThe ushers were making rounds again\nTo get there I had to hitch a ride\nAnd these motherfuckers talking about 20 percent in tithes\nTelling me it's for the homeless, and those\nWith nowhere to go, but at night the church door is closed\nNow you can come as you are\nBut you better be sharp as a tack, with a new car\nCause if you ain't got that cash\nWatch them so-called Christians talk about your ass\nI don't give a fuck about your blessings\nYou want to know my religion, why don't you guess it\n\nChorus: (2x)\nWhy's everybody keep playing with God?\n\nVerse 2:\nI gotta talk about these clowns behind the pulpit\nCause they full of that bullshit\nIt's no wonder they think they large\nWith these motherfucking members treating they ass like God\nBut they ain't God cause God loves everybody\nBut Baptist preachers, they backslide\nWhen it comes to Muslims they ain't got no love\nNow what you motherfuckers scared of?\nThat niggas will abandon your vision\nAnd say don't give me that old time religion\nI'm sick and tired of my homies getting killed\nAnd the pastor's saying that it's God's will\nFuck the enemy, yo I don't love him\nThat's why I cut for the motherfucking Muslims\nPut your hands on me and shit gets scary\nI'm a put your ass in a cemetary\nNow you'll call me Judas and say I ain't right\nBut fuck you bitch, they talk about Christ\nI don't give a fuck about your blessings\nYou want to know my religion why don't you guess it\n\nChorus (2x)\n\nVerse 3:\nNow I know why my daddy don't go no more\nThe church ain't nothing but a fashion show\nThey going to meet and greet and peep and gaze\nThey ain't trying to get saved\nCause if they was they'd practice what they preached\nAnd praise the Lord more than one day out the week\nMaybe that's why a nigga ain't repenting\nThe churchhouse be having some fine ass women in it\nAnd that's why the preacher can't spread the word of the Lord\nCause he be looking just as hard\nIt's the blind trying to lead the blind\nAnd you wonder why niggas is so behind\nI can stay my ass at the crib and watch the game\nIf I want to be entertained\nCause this shit done got out of hand\nMotherfuckers doing the bump in the choir stand\nYou get mad cause I'm questioning your merit\nBut goddamnit if the shoe fit, wear it\nI don't give a fuck about your blessings\nYou want to know my religion why don't you guess it\n\nChorus (4x)\n\nThis song was inspired by all you so-called saved motherfuckers out there\nThe ones thats backsliding\nYou sinner free motherfuckers that be\nJumping up and down in church every Sunday and shit getting the Holy Ghost\nBut I'm a let you motherfuckers know\nIf one of you hoes fall on me, I'm a knock your ass smooth out\nI don't give a damn, I'm straight up with it\nBut some of you motherfuckers be\nGoing out to the club on Saturday and shit\nAnd coming to church with a motherfucking hangover\nAnd oh yeah, all you motherfucking parents\nThat's talking about Willie D is a bad influence on your kids\nFuck you hoes, raise your own motherfucking kids\nI ain't no motherfucking role model\nYou be your motherfucking kid's role model, motherfucking loser\nYeah, just when a nigga start getting a piece of this apple pie\nIn America, you hoes want to start lining against rap\nSmashing up tapes and shit, what you want us to do\nStart by climbing through your motherfucking windows\nIn the middle of the night?\nYou better speed on before you get peed on\nNow let the congregation say Amen", "image": "https://images.genius.com/64f58472036475b394d3cdeb5a8c499f.770x768x1.jpg", "album": "Play Witcha Mama", "title": "Guess My Religion"}]}