{"songs": [{"year": "2019-09-27", "album": "I’m Him", "image": "https://images.genius.com/616d488e4df5441f8e2204baea3a3701.1000x1000x1.jpg", "title": "Have You Ever", "lyrics": "[Intro]\nThis for all the niggas that come up out the real slums, you know?\nYou was wearin' your uniform maybe three weeks in a row, you heard me?\nYeah, it's stains on your shirt, you know?\nStains on your clothes, you heard me?\nReal talk, projects\n\n[Chorus]\nHave you ever been treated like you wasn't shit? (Wasn't shit)\nBackstabbed by the niggas you was fuckin' with (Fuckin' with)\nLaughed at by the niggas you was runnin' with (Runnin' with)\nTreated bad by a bitch 'cause you wasn't rich (Wasn't rich)\nHave you ever been treated like you wasn't shit? (Wasn't shit)\nBackstabbed by the niggas you was fuckin' with (Fuckin' with)\nLaughed at by the niggas you was runnin' with (Runnin' with)\nTreated bad by a bitch 'cause you wasn't rich (Wasn't rich)\n\n[Verse 1]\nHow many people had to walk and had to catch a ride? (What's up?)\nThe bus just passed by, but you wasn't there on time\nThe club just let out and you not even fly (Damn)\nThe block just shut down, you gotta stay and grind\nThe streets know, somebody play, it be a homicide (Boom, boom)\nUnanswered prayers make you start to not believe in God (What?)\nGood nigga, then she forced you to the evil side\nNo transportation, different cars for you to keep a job\nFamily tellin' you to pray, but you so sick and tired\nHard to hold your head up if you don't even try\nIn the ghetto where they celebrate when people die (What?)\nBut I believe in you, keep on reachin' for the sky\n\n[Chorus]\nHave you ever been treated like you wasn't shit? (Wasn't shit)\nBackstabbed by the niggas you was fuckin' with (Fuckin' with)\nLaughed at by the niggas you was runnin' with (Runnin' with)\nTreated bad by a bitch 'cause you wasn't rich (Wasn't rich)\nHave you ever been treated like you wasn't shit? (Wasn't shit)\nBackstabbed by the niggas you was fuckin' with (Fuckin' with)\nLaughed at by the niggas you was runnin' with (Runnin' with)\nTreated bad by a bitch 'cause you wasn't rich (Let's go, let's go)\n\n[Verse 2]\nFinally got on your shit, you graduated, you got your own spot (Own spot)\nStarted off sellin' them nicks, you doin' your shit, went and got a whole block\nPuttin' that dick on this lil' bitty bitch who did you wrong now\nBrushed aluminum texture on your whip, your money strong now\nPrepay, that's a flip, you caught a play, then put the phone down (What up?)\nWho you gettin' out your body with? Look, turn your tone down\nYou ain't really with all that hyper shit, you pull that chrome out (That fire)\nYou drop fast, do the dash and hit the gas on 'em\nAfghanistan with them racks, drop a bag on 'em\nTurnin' nothin' into somethin', we gon' be alright\nWent to Emit, spun some chips and now your dentures alright\nBig body foreign, headlights\n\n[Chorus]\nHave you ever been treated like you wasn't shit? (I'm not livin' like that?)\nBackstabbed by the niggas you was fuckin' with (What up? Fuckin' with)\nLaughed at by the niggas you was runnin' with (Runnin' with, kicked all in my ass, you heard me? Yeah)\nTreated bad by a bitch 'cause you wasn't rich (Wasn't rich)\nHave you ever been treated like you wasn't shit? (Wasn't shit)\nBackstabbed by the niggas you was fuckin' with (Fuckin' with)\nLaughed at by the niggas you was runnin' with (Runnin' with)\nTreated bad by a bitch 'cause you wasn't rich\n\n[Outro]\nNiggas sayin' I want it, I need it in my life, you heard me?\nAnd it's like a nigga wait 'til they get in front a ho and then get to tryna shit on me\nMan, you could've gave me that in the car, dick, you heard me? Ayy\nAnd the Rollie bust down\nAnd the Rollie bust down\nAnd the Rollie bust down\nAnd the Rollie bust down"}], "artist": "Kevin Gates"}