{"artist": "Apathy", "songs": [{"title": "Don’t Talk to Me", "image": "https://images.genius.com/90a78c5e81aab6cc017154aa5929c6ac.1000x985x1.jpg", "album": "It’s the Bootleg Muthafuckas! Vol. 1", "lyrics": "Apathetic (yeah) the heir to the throne (word)\nMother molestors click (you know about that!)\nMy man Majik Most the sweaty back bastard\nYeah, yo don't even talk to us\nDon't run up with your burned CD or a piece of shit CD\nWith the cover picture on the front that your grandma took bitch... fuck you!\n\n[Verse 1 - Apathy]\nI turn rappers to dust, burn rappers who bust\nTurn wax to cut, burn backs of sluts\nEarn stacks of bucks, learn raps to crush\nYou herb cats who touch the microphones I clutch\nJust observe and take notes how I make pesos and date hoes\nHotter than pepper on jalapeños\nParagraphs vibe through your speaker box\nMaking people stop on the streets to clock\nLike cops in front of reefer spots\nI'm known for pulling mics apart like repair shops\nAnd when you bump I never feel it like air shocks\nI used to rock air macks with Nike Air hats\nNow I scare cats, they compare Ap to bear traps\nI'm the type of path that people don't cross\nLike the Blair witch woods when you suckers get lost\nI'm the hottest thing alive flame broiling spots\nI'm foiling plots, my brainwaves boiling pots\nAt a temperature the burners on your stove can't match\nI bust caps cause my heads way too big for hats\nI'm gonna test your girls physical stamina\nWhile I'm diggin and slammin her on the digital camera\n\n[Hook - 2X]\nSo don't talk to me about MC's got skills\nHe's alright but he's not real\nDon't talk to me about MC's got skills\nThey're okay but they're not ill\n\n[Verse 2 - Majik Most]\nAy yo hold up, Majiks on the case\nWatch the flames from my tape ignite your gas tank\nI lace you like your mom in a bondage suit\nWith matching hooker boots teaching you to tie your shoes\nYou lose every time I rhyme\nI'll clothesline you off your scooter, your nothin but a loooser!\nI'm on some highschool shit with lolipops in my pockets\nFor hot chick on my dick under seventeen with my picture in their locket\nOn the club scene they don't need to take ecstasy they think about me\nIt's obvious I won't win a grammy from a song\nBut i'll run up in moeisha and get my brandy on\nAsk me if I'm dope, C'MON I'm MAJIK MOST!\nI'll roast you bitch, I barbeque kids till you just a fucking skeleton wearin a wig\nI'm trying to be Mr. Big so don't talk to me bitch\n\n[Hook - 2X]\n\n[Verse 3 - Apathy]\nYou better watch what you say like lip syncing in mirrors\nQuit thinkin your near us, your not even a million miles close enough to hear us\nI stand six feet back and spit these raps until the concrete streets crack\nI simplfy just to pacify the mass and burn you like ants under a magnifying glass\nYa'll are underlings like the servents of kings\nWhile I form ciphers and patterns like saturns circular rings\n(it's Apathy) my sole purpose stands to cripple\nMy verses tear through tissue like surface to air missles\nNavigating fighter planes safe to the ground\nWith one engine down and enemies circling all around\nI'm mythical to hip hop fans\nSome people hear that I'm 7 foot 8'' with three heads and no fear\nThey say I spit fire and I walk on air\nWell if what they say is true then you'd better beware\n\n[Hook - 2X]", "year": null}]}