{"songs": [{"album": "Something Else", "image": "https://images.genius.com/ae74b38ee85ff63c76433b31ae507a23.1000x1000x1.png", "year": "2013-07-30", "title": "B.I.T.C.H.", "lyrics": "[Intro: Tech N9ne]\nNo, you ain't supposed to put on your devil suit\nWhen you come up in the church, young mayne, hehehehehe\nNow they ain't about to think you a rebel\nYou 'bout to make them think you birthed from flames\nLa la la-di-da-da\nWanna be on TV just to show out for mi mama\nBut breakin' into colored houses, admit\nThat it's a bitch when you sick like this\n\n[Verse 1: Tech N9ne]\nPuttin' all the face paint I can put on\nPut my black jeans and black hood on\nThat's your TV I just stood on\nWith a faded habit this brother swerves when I sip vodka\nI'm the latest rabbit; in other words, I'm a hip hopper\nYou disc jockers never played me, you said my shit stopped ya\n2001, I mixed opera now every clique's got the\nSick caca with lots of rippin' about they chips, oughta\nListen to this quick chopper flippin' and poppin'\nWith the spirit of Pac and Big Poppa!\nYa! This for your motherfuckin' rap quotes\nMy shit is surprising and shocking like Barack votes\nThe traps broke when I rapped with Tunechi and Stacks though\nOG Muggs said I'm gonna be the first rapper to cross over to black folk\n\n[Pre-Hook: Tech N9ne]\nYah, I'm breakin' into colored houses\nPolo boots and hella dark-colored outfits\nYah, I'm breakin' into colored houses\nFellas better put a chastity belt on your spouses\n\n[Hook: T-Pain]\nHey!\nMan, it must suck to be you niggas cause it don't suck to be this rich\nIf you not fuckin' with me, brethren, you can suck upon this dick\nMan I just get it how we get it where I live\nSomebody better call 911 (call 911) I'm breakin' in these niggas' cribs\nYeah, we out here workin'\nOne thing for sure, two things for certain\nI'm for real, that's how I live\nSomebody better call 911 (call 911) I'm breakin' in these niggas cribs\n\n[Verse 2: Tech N9ne]\nSince 2001 my people dodged me like Durango\nNow at my shows I see more N-words than Django\n(From Missouri) like Nelly, Chingy, and Chain Hang Low\nBut Kansas City somewhere over the rainbow\nI'm in yo' house baby, I'm in yo' living room\nLookin' down yo' blouse lady, and everybody is in tune\nTo Tech Nina, sex fiend a threat to his and whom\nThey got a beautiful woman and givin' poon\nThey want it cause I'm 'bout to be big and BOOM!!\nBreakin' into colored houses is hard, mayne\nCause everybody got (guards)\nAnd they got (dogs) and they got bars mane\nBut I'm comin' through that TV\nAnd all the ghetto is gon' see me\nSippin' the KC Tea\nNow you know Tech N9ne now everybody want a freebie!\n\n[Pre-Hook: Tech N9ne]\nDamn, I'm breakin' into colored houses\nPolo boots and hella dark-colored outfits\nYah, I'm breakin' into colored houses\nFellas better put a chastity belt on your spouses\n\n[Hook: T-Pain]\nHey!\nMan, it must suck to be you niggas cause it don't suck to be this rich\nIf you not fuckin' with me, brethren, you can suck upon this dick\nMan I just get it how we get it where I live\nSomebody better call 911 (call 911) I'm breakin' in these niggas' cribs\nYeah, we out here workin'\nOne thing for sure, two things for certain\nI'm for real, that's how I live\nSomebody better call 911 (call 911) I'm breakin' in these niggas cribs\n\n[Verse 3: Tech N9ne]\nMy people missin' me, like Diana Ross\nNo this ain't MMG, but I am a boss\nAlthough I'm wicked see, I'm fly and I floss\nSo why am I lost? Like my jam is off?\nYes you a day late, better late than never, I'm a veteran\nMy cheddar been truly silly like Stevie J face (haha)\nEvery last one of these evil haters they see me vacate\nDip to the crib, turn on the television and see my face like, \"Hey, wait...\"\n\n[Hook: T-Pain]\nHey!\nMan, it must suck to be you niggas cause it don't suck to be this rich\nIf you not fuckin' with me, brethren, you can suck upon this dick\nMan I just get it how we get it where I live\nSomebody better call 911 (call 911) I'm breakin' in these niggas' cribs\nYeah, we out here workin'\nOne thing for sure, two things for certain\nI'm for real, that's how I live\nSomebody better call 911 (call 911) I'm breakin' in these niggas cribs"}], "artist": "Tech N9ne"}