{"artist": "50 Cent", "songs": [{"album": "50 Cent is the Future", "image": "https://images.genius.com/6bc22518471304f1684549742212664c.945x945x1.jpg", "title": "Bad News", "lyrics": "[Intro]\nLloyd Banks in the house, bad news\nTony Yayo in the house, bad news\n50 cent in the house, bad news whenever 50 around it's bad news\nTrey pound's in the house, bad news\n40 Kal's in the house, bad news\nI got a knife in the house, bad news whenever 50 around it's bad news\n\n[Verse 1: Lloyd Banks]\nI think little man mad cause I'm flossin' bad\nI ain't a wrestler, but I'll put your bitch the Boston crab\nI talk money cause it costs to brag\nRound here bitches walk around wit the hair that the horses had\nRap it get your face stuck on them bricks\nI don't really like to exercise but I'll push up on a bitch\nY'all sweet like ninety-nine bananas\nThat's why I got ninety-nine niggas wit ninety-nine hammers\nThey all want a nigga to stop\nCause I rap slick enough to slip the ring off of Vivica Fox\nI'm just a playa that found out what the coaches know\nSo I'mma be around longer than the Oprah show\nYou and your man y'all both should know\nThat all it takes is a finger to send you where the ghosts go\nShit I been hated since the fifth grade\nThat's why my best friend's a the tre pound, a ice pick, and a switch blade\n\n[Hook]\nI don't like you, you don't like me\nIt's not likely that we'll ever be friends\nWhy pretend? (Ma, Banks' back at it again)\nI don't like you, you don't like me\nIt's not likely that we'll ever be friends\nWhy pretend? (Ma, Tony's back at it again)\n\n[Verse 2: Tony Yayo]\nRule number one pick a target and study him for weeks\nSee where they rest at and lay with their peeps\nNow you got the drop, know their daily routine\nSo the second rule please leave the crime scene clean\nThird rule pick a day, fourth rule pick a time\nFifth rule pick a fifth, sixth rule pick a nine\nAnd the seventh rule make sure your sidearm sweet\nSo when the shootout you leave him six feet deep\nEighth meet in a fast car with disguise\nUse a ski mask with shades on your eyes\nNinth rule don't say shit cause po-po listen\nFuck around you end up being stuck in the system\nAnd the tenth rule don't put a tag on a broken heart\nJust put a toe-tag on your mark\nAnd rule number 11, you caught a body but you not a legend\nYou better watch where you heading\n\n[Hook]\nI don't like you, you don't like me\nIt's not likely that we'll ever be friends\nWhy pretend? (Ma, 50's back at it again)\nI don't like you, you don't like me\nIt's not likely that we'll ever be friends\nWhy pretend? (Ma, 50's back at it again)\n\n[Verse 3: 50 Cent]\nDon't go against me I'll hurt your feelings\nStones in my cross the size of your earrings\nMy confidence level's high nigga can't tell\nLickin my lips at ya bitch like I'm LL\nI smile like a nigga in jail receiving mail\nBetter yet like a nigga in the bookings that made bail\nFrom day one I came in the game they said I was hot\nThey got scared, \"Cent got money,\" and I got shot\nYou put pressure on me when you compare me to 'Pac\nI'm just a new kid, I can't help that I'm hot\nWhat little niggas say to 50 cent don't matter\nI'll fire shots at the shepherd and watch the sheep scatter\nMy enemies never turn into friends, my friends turn into enemies\nYou scared then get the fuck around me\nRecord execs, know not to play wit my check\nI come through and put my knife on that vein in ya neck (YEAH!)\n\n[Hook]\nI don't like you, you don't like me\nIt's not likely that we'll ever be friends\nWhy pretend? (Ma, 50's back at it again)\nI don't like you, you don't like me\nIt's not likely that we'll ever be friends\nWhy pretend? (Ma, 50's back at it again)\n\nLloyd Banks in the house, bad news\nTony Yayo in the house, bad news\n50 cent in the house, bad news whenever 50 around it's bad news\nTray pound's in the house, bad news\n40 Kal's in the house, bad news\nI got a knife in the house, bad news whenever 50 around it's bad news", "year": "2002-06-01"}]}