{"artist": "King Los", "songs": [{"image": "https://images.genius.com/af979fd34aa3f95d652a83f4bdfdf39a.538x538x1.jpg", "title": "10 Minute Million Dollar Massacre Freestyle", "year": null, "album": null, "lyrics": "Yeah…\nYeah. We like to call this, the Ten Minute Million Dollar Massacre. And ya’ll niggas ‘bout to see why. BLOC Gang its ya boy LoS. Easy...\nLook\nListen\n[Purple Rain- Beanie Sigel]\nI had to pay a visit to my diva, “Set It Off” like Jada, Vivica, Latifah\nI’m in that GT, with the fly sneakers, and this a top model like Eva\nAnd we could pop bottles like we the San Antonio Spurs\nIf a nigga want beef, the cannon's under the fur\nIf you say you want beef and you stand up under your word\nYour man’ll put brandy onto the curb, but the herb…\nIt got my eyes low, and make me ride slow\nI keep the hydro, lit like a pyro, this how I try ho!\nI’m goin’ big places bitches you try and go\nBut we can kick it like Taebo, I know, ya heard it all before, but you never pushed convertible Azzures\nTryna get you out that skirt and then them drawers, and pull back the curtain ‘cause the view is just perfect of the shore\nI’m perfect and I’m sure\nFor certain, and the merkin’ is for sure\nKill the smirkin’ when I’m burstin’ in the door\nI’m worser than before\nI’m worser than them verses I beversed without rehearsin’\nIt’s for certain I’m the boar\n\nIt’s curtains for these whores, tryna work me, tryna jerk me, I'mma score\nThis is urgency, I burgundy your floor\nThrow my mercy on the court, I’m like Worthy on the court\nYe ain’t worthy of my sport I wake up early in the morn’ then I’m gone\nThey should call me “over the fence” I choose offense over defense\nPlus I run niggas home, like a home run over the fence\nSo run home before homes jump over the fence\nI’m in that Rover with tens, bumpin’ that HOVA and Cris\n-stopher Wallace, my cliques the wildest, I’m a soldier ya bitch\nMomma show me them tits, I got that Moet and that Cris\nThey names was Chrissy and Mo, so sip some more of that crisp, switch!\n\nNow I’m crawlin’ through the window of your crib, while you’re playin’ Nintendo with ya kids, what it is?\nI hear niggas got a lot to say\nI’m tryna make it to the top, they tryna block the way\nI put Chronic on the block, like I’m Dr. Dre\nMy niggas got that blow out, like they Docta J. I was told the cockle spray…\n\nAim that fuckin' ratchet, Hold it, load it, toad it, and choke it, made in fuckin’ basses\nBlow they ass to smitherines, ‘til it ain’t enough of caskets\nTech’ll make such a mess, you can’t clean it up with napkins\nSicker than mixin’ liquor with angel dust and aspirin\nI’m cool as a motherfucker, but I’m dangerous when rappin’\nNiggas that's on the block, they masters slingin’ bustin’ trappin’. Getting money, if you think that you could hang with us, I’m laughin’\nYeah, it’s funny\nSee money rule the world, I don’t know what it do to girls, for them diamonds jewels and pearls\nBreak it down like: Is it the money that’s makin’ em fiend for the shit that they know we could probably screen?\nA lot of the [?]\nMaybe that was too fast for you so just let me slow it down\nIf you didn’t know I was the shit well now you know it now\n\nI gotta hold it down, my city right behind me\nWe rockin’ tanks and kapris, homie we like it grimy\nWe live that life of crimies\nHold two gats like they Siamese, eyes runnin like we Chinese\nLook you know where to find me\nB.A.L.T. to the I. Need I say MORE? Heat to the sky\nPop with with you, and then we rockin’ jewels so what we gotta do to get a piece of the pie?\nReal G’s gon’ ride when shit get big\nWe comin’ and dumpin’ them flips and shit\nYou dummin’ to something your whip ain’t shit\nI’m stuntin’ in something ridiculous\n\nDo you know what this is? I do this shit to live\nNigga these clips are spare, I don’t need no witnesses\nThis fit for hit your head, get shots’ll split your wig\nTil your brains on the fishin' graves\nRockin' blue you fit the crib\nBang and Rang, what up with you blood?\nI ain’t claimin’ nothin’ but the crew love\nBloc clique shit, I fucks with true thugs\nKnew a lot of niggas that wasn’t too tough\nNow it’s bloody murder and ammunition when hammer’s clickin’ niggas runnin’ pockets with potem problems we’re bangin’ out\nPlus I’m burnin’ for recognition, they jammin’ 'cause this shit is gonna cockin' we’re watchin’ plottin’ and hangin’ out\nIt ain’t a doubt, that’s that’s shit that you feel\nShit that you love is that shit that you real\nThis shit is the shit with explicitly skill\nTerrific, exquisite, exhibit you bitch\nMy niggas, they ditch if we’re snitches you bitch\nThey clap with the mac, for they’ll scratch if you itch\nForgettin’ you peoples, and sleep with the fish\nThey fear me, you hear how I’m freakin' this shit?\n\nWe deep in this bitch, my peeps in this bitch\nI don’t wanna hear a peep in this bitch\nPlease! Tell Money stop grillin’ I ain’t peepin’ his bitch\nAnd even if I creep, I ain’t keepin’ his bitch\nI represent the streets in this bitch, the project life\nThe plush presidential suites in this bitch\nY'all niggas lookin’ sweet in this bitch- pause\nI guess I got a little wrapped up in my bars\nI play with the flow, like a cat to a mouse\nRight before he kill it, then it’s back to the house\nI’m in the lack with the pouch, some call em pokeouts\nI hop out and choke out the nigga that got the choke out\n\nThen get smoked out\nMy niggas loke (look) out\nYou still wipin’ off your sneakers, we pull boats out\nTo get in your folks house, pull the bolts out of the door\nPull up with guns, nigga pull the coat out of the floor\nWhen I pull the stroke, out of your whore\nShe like damn LoS, what you don’t got it no more?\nI’m like damn ho, what you don’t get it no more?\nYou get it once and you don’t get it no more\nHo why would she get it now, if that hooker ain’t get it before\nI get it down, like a Jeep, you inconsiderate whore!\n\nGet in some shit with your bore, I'm finna get it for sure\nI’m finna rip me a tour, I'm finna kick that is ore\nLook if rappin' don't work, I'm finna flip me some raw\nYou finna attempt me c'mon. I'm finna dip from the law\nI’m finna get me this little bitch that finna give me some jaw\nI’m finna pent me a broad. You finna attempt to be hard\nYou finna wile like you a problem, but you fit to be solved\nI'm finna figure if my four-fifth'll fit in this jar\n\nMotivation every time I sit in them cars\nFeel the plush leather seats, and keep spittin' them bars\nHit your broad to get some brain she like The Wizard of Oz\nHold on my pivot on the block I can't wikit with starve\nI mean we're starvin' for the scratch I'll scratch these bitch niggas off\n'Til I'm flyin' in a plane like I'm too big for the car\nWith the wheel scrape on the wells cause they too big for the car\nPut this sig to your jaw, man I’m sick of the yard!\nOh yeah this nigga is raw, like Eddie Murphy in leather\nHear my voice on these tracks, don’t they go perfect together?\nI could merk it whenever, workin' I'm certainly clever\nI am perfectly better, I will irk you for cheddar\nGot the worstest vendetta, that a nigga could have\nSo sit down, if you can’t stand me getting’ this cash\nMan I get in this ass, call me wedgie, no webbie\nScreamin' give me that pussy, push me to pull out this dezzie\nIn the truck with a lezzie, Jewels cut to the bezzie\nPlay the grip for the slippers, a few bucks for the Chevy\nThis is nothing, I'm ready\nNiggas bluffin' and petty\nPop my trunk and grab my bump, turn his guts to spaghetti\nI'm feelin' tougher than Pesci\n\nFeeling lucky? Don’t push me\nPull your skirt for what it’s worth; you get fucked in your pussy\nNigga don’t hush me and shush me I’m talkin' loud for a reason\nYou a punk and you jump up, then you’re down for a beatin'\nYou hear the sound of the beat, and you just start poundin' your feet\nWhen the pussy niggas ridin' by, duckin' down in the seat\nYou can tell they being rebellious from the sound of the feet\nThey in the pool with a fool, they ‘bout to drown in the deep\nSee this is shake ‘em, I’m a wake ‘em, and then clown ‘em for sleepin'\nWhen that pound get to squeakin', they get found in the reapin'\nHoldin' this own and it's leakin', lay him down for the weekend\nMovin' ground when I'm speakin', don't wanna be around when I'm geekin'\nWelcome to hell nigga peekin', what I’m gon' tell to the deacon?\nWhen you catch shells in your beacon like what the hell he was sleepin'\nGuess the devil could meet him\nGuess the reaper could greet him\nLike I need to defeat him, as I proceed to delete him\nThis the key to your freedom\nFeed 'em the D.E. and heat 'em, beat 'em leave 'em bleedin' and blind, barely breathin' and dyin'\nThat nigga dying like withering wheat\nI'm in exerting energy just shiver and they’ll speak\nYo! [?] is deep\nSo I fall in the page, silently swear to keep it real wit y'all for all of my days\nBack in school, you can catch me in the hall with my haze\nBitch you ain't hittin' this blunt, why you all in my face?\nY'all niggas call us and race, I'm bout to lap you and pass you\nAnybody in my way, fuck the hassle I’ll clap you\nSee me I razzle and dazzle, 'cause I'm fresh like “Uh”\nHangin' out the window, banging that tech like “uh”\nYou stumble when you catch one in your neck like “uh”\n\n'Cause I'm walkin' like a man, my finger on the trigger\nPocket full of money, I'm a Baltimore nigga\nCall the law nigga, this is murda, first degree\nThese niggas buggin', they don’t wanna trade a verse with me\nAdversin' me is a-a-additional adversity, I add verbs for free\nBut don’t think my adverbs are free, 'cause I'm a pro now\nI reflip the prefix to metaphors and pronouns\nShorty slow down, it's 'bout to go down\nAnd any nigga who don't know, he bout to know now\n\nSee no clown gon' stop my shine\nLong as I got my 9 and my block I'm fine\nI know niggas gotta drop sometimes, that’s how it be cousin\nI can stop my grind just 'cause the streets buzzin'\n'Cause when the heat bust in, niggas’ll scatter\nAnd if anybody ran em then what nigga is badder?\nIt ridiculous chatter, real niggas call it ho talk\nThat’s the way that hoes talk, that’s the path that I don’t walk\nSo don’t squawk, when I run up with the beat either\nSqueeze the D.E. and leave three in your cheap beater\nI cheap the sweep jeeber until I get nice\nAnd it ain't stress or nothing homie its just life!\n\n'Cause I'm the slick type\nPose-in-the-whip type\nClothes-in-the-flip type\nPut-hoes-on-the-strip type\nWe need a broke type\nNeighborhood joke type\nBullshit smoke type\nCan't flip coke like damn\nI thought he was the man\nI thought he had a plan\nI thought he was movin' grams\nLemme give him a hand (clap clap clap)\nHe about to get his fuckin' man (clap clap clap)\nIn his van (clap clap clap)\nAnd his fam' (clap clap clap)\nDamn I smashed that track\nI ain't even started motherfucker I'm retarded\nI ain't even lyin' man, I ain't even tryin' damn\nThis jungle music, I'm the king of the lion fam'\nI ain't playin' my stilly’ll killy you\nI'm off the hizzy fashizzy nizzy im really ill\n\nI like the billyill of my hat to be really low\nThe feel skillyills of these rest could really blow\nThey like the wheelios on my lat 'cause they really glow\nI keep it trilly with these bitches and silly hoes\n\nNo really though, go and roll that philly ho\nHit my nigga on the jizzer, like what the dealio?\nHere we go. Grad some drank, I’ll grab some smoke, we’ll mix ‘em both\nGet some hoes and switch your clothes\nJizzy grab that Chris and Mo!\nI attract the biggest hoes, 'cause I attack with a vicious flow\nRide in the back and my wrist is froze and on my back is the slickest clothes. Yo!\n\nYou know that nigga Los?\nYeah man, that nigga dope\nNah man that nigga broke\nLook man I'm sick of folks\nThe first prick I poke, I'mma leave the knife in him\nTwist it counterclockwise then ask him if he like livin'\nIt got a rusty blade on it, so its like venom\nBut it'll turn you boys to men, like Mike Bivins\nY'all like kittens, when the Pitbull come\nBlow up, empty your clip for fun\nLets live more tongue\nThese chicks lick dick for fun big clip, spit clips for fun\nAnd by the time your boy done, its gonna be ugly\nBut (you, and you, and you, and you, and you gon', you gon', you gon', you gon', you gon', you gon' you gonna love me)"}]}