{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": "Mohawks & Heavy Metal", "lyrics": "Chorus:\nFirst we fuck bitches, then we get money x 4\nThen we fuck bitches, but first we get money x 4\n\nVerse 1:\nSpend money like it grow on trees\nThat's why my wrist on chill and my neck on freeze\nI just make baby hits some of this OG\nThen i'm kissing on her friend while she kiss on me\nI ain't buying shit, baby better trick on me\nWouldn't even give a bad bitch dick for free\nSee it costs for the boss\nSL with the top down, riding round sitting next to something sauce\nHa! the RockStar in the building\nTheres a rock everywhere like a bar in the building\nTell the ballet bring the car to the building\nDon't hate, guns not far from the building\nDrops like a ceiling (?) and floats like a pilgrim (?)\nLife of a RoskStar. Oh! what a feeling\nAnd i ain't worried about the haters or the snitches\nTo keep it real i rather\n\nChorus:\nFirst we fuck bitches, then we get money x 4\nThen we fuck bitches, but first we get money x 4\n\nVerse 2:\nI ball like i'm in the NBA\nU got them different color J's on, them be fake\nNot me, Prada, Gucci, Louis\nStepped out the house like i'm dressed for a movie\nOohwe! she wet like a jaccuzi\nAnd after she do her, i make her do me\nLil' mama got a body full of tattoes\nI like her friend and her sister, they bad too\nIf you're a bad bitch then i'm at you\nLike a piece of pound cake (?) and a fat dude\nYou can get it from the bed to the bathroom\nGo on babe, do them lifts like a vacuum\n\nChorus:\nFirst we fuck bitches, then we get money x 4\nThen we fuck bitches, but first we get money x 4\n\nVerse 3:\nI like them girls, but i love my gwuap\nWhole bunch of hundreds in a big, fat not\nBenzes and Beamers, fresh of the lot\nBig face wrist whatch, like Flavor Flave clock\nDiamonds and rubys\nFendi and Coogi\nFresh of the store, got your whore acting choosey\nDinner and a movie\nIf she acting booshey\nI make the bitch wipe a nigga down like boosie\nYea! the girl know how it go down\nShe get it up and then she go down\nIm feeling like fuck rapping\nI'm trapping the coke went platinum\nEarrings like high beams\nMedallion on the chain like a wide screen\nAnd i'm on like a wide screen\nSquirt it on her eye like Visine\n\nChorus:\nFirst we fuck bitches, then we get money x 4\nThen we fuck bitches, but first we get money x", "title": "Fuck Bitches Get Money"}]}