{"artist": "Bas", "songs": [{"lyrics": "[Hook: Angel McCluskey]\nKeep you close to my heart\nSave up the moment,  a moment\n\n[Verse 1]\nSince my niggas facin probation we gon smoke they faces off\nWish that we can smoke and smoke until we burn them cases off\nI’m not too proud about, not much to smile about\nIt’s like they never took them fuckin braces off\nGunshots… but ain’t no fuckin races start\nEither play your part and play it apart or play it raw, hole in 1\nFew hunned yards, you a superstar groupies heart\nBut yo lady got the truest heart\nI’m on the verge of greatness, patience is the only virtue\nBut for the moment I’ll be… overindulging, I see\nGracious faces, greener passes, gold chains, purple fumes\nCouple niggas still breathing but to me R.I.P\nI give niggas a shovel, tell em “get to digging, you ain’t finished?\nTil that hole is big enough for you to fit in”\nI don’t need credit, I don’t need a fuckin credit limit\nMe and my team travel like we never learn to pivot\nAnd spend it in cities where bitches numbers be like 21 digits\nHow I’m supposed to dial that when I’m high as that, hah?\nHow was such a chilly breeze flowin from yo eye and flash\nI thought fire breed new life but niggas is dying… fast\n\n[Hook: Bas]\nI’m on a pill, think I love this bitch – that’s how real it feel\nSniffin out a Benjamin, that’s the cleanest bill\nPoisons infiltrate my regiment and even still\nI ain’t numb and under this I could feel it still\n\n[Sample of \"XIX\"]\n\n[Hook]\nI’m on a pill, think I love this bitch – that’s how real it feel\nSniffin out a Benjamin, that’s the cleanest bill\nPoisons infiltrate my regiment and even still\nI ain’t numb and under this I could feel it still", "image": "https://images.genius.com/e8444ffb238fbf0380d31f3b8d789020.500x500x1.jpg", "year": "2013-05-22", "title": "Dying Fast", "album": "Quarter Water Raised Me Vol. II"}]}