{"songs": [{"album": null, "image": "https://images.genius.com/82cf56f3623008d82b006dbec40941d2.480x480x1.jpg", "year": "2017-03-16", "title": "From the D to the A", "lyrics": "[Verse 1: Lil Yachty]\nOff top, run a nigga out his socks\nNiggas talk more than bitches\nNiggas really be on cock though (Pussy)\nJust fucked a ho out in France\nPaint her face like Picasso\nI iced out my vatos, I'm really up\nBig ass Bimmer, big Benz and my Bentley next\nDon't play around on my phone ho, gimme sex\nWatch on my wrist out of date, but it's Rolex\nGrizzley up next, I'm up now\nStrap your bullet vest\n\n[Verse 2: Tee Grizzley]\n500 50's, 600 hundreds\n700 20's, let's get straight to it\n800 10's, what's that, 8 bands?\nHit the store and get some rubber bands\nLet's get straight to it\nEverybody come together, everybody got the plan\nHe came with you\nSo if he steal it fall on you, we on your ass\nHave your mans call his mans\nMake sure they ain't movin' fast\nSoon as they touch Atlanta, get with Boat\nSecure the bag, nigga\n\n[Verse 3: Lil Yachty]\nOh, A bag secure, that's on my mama, bro\nAsian lil' ho, she ride that dick, Yokohama flow\nMade that shit double, got an Uzi, I don't scuffle\nNot a banger but that banger in my car like an airbag\nNiggas only aimin' in the sky, call those Air Mags\nAll up in Neiman's, coppin' shit like fuck a price tag\nI'm ballin', ain't near a rap nigga in the game that I'm callin'\nIf I need help, I'll dial it by my se-kelf\n\n[Verse 4: Tee Grizzley & Lil Yachty]\nYou swear your bitch faithful, she sent her location\nI hit her at the trap in Decatur, she basic (Crazy)\nChop with the laser, get decapitated\nCan't smoke, I'm on papers\nHold on, this my Jamaican (Love one)\nNiggas want me dead, so I'm steady prayin'\nAin't no disrespect without retaliation\nFuck a hotel, I hit her in the basement\nText her later like, \"I'm done with you, I got a situation, baby\"\n\n[Verse 5: Lil Yachty]\nHmmmm! Well shit, bro, let me get her then\nI'ma dog her out then switcheroo into the lion's den\nNigga talkin' down, my bro got more heat than a fryin' pan\nGucci 'round my hair, wrapped tight like I'm Taliban\n\n[Verse 6: Tee Grizzley]\nLike I'm Taliban, how we drop shit (We go)\nLot of dreadheads, lot of chopsticks\nTouch my nigga Yachty, get your top ripped (boop!)\nDon't ask the price if you know you ain't tryna cop shit\n\n[Verse 7: Lil Yachty]\nYou the type to look around but never cop shit, ayy\nI'm the type to buy the store, make them restock it, ayy\nBeam on everythin' I own, I will not miss\nGrizzley by my side like a pilot ridin' cockpit\n\n[Verse 8: Tee Grizzley & Lil Yachty]\nYachty, I might stop rappin' for this one reason (Oh, for real?)\nIf the Feds hear this shit I'm doin' a hundred seasons\nIn the hood, shootin' craps in my Yeezys\nPut angels on you niggas who be playin' like y'all demons\nYou dig?\n\n[Verse 9: Lil Yachty]\nMiddle finger to them niggas hatin' and fakin'\nThey plottin' on my death, I give their mothers deep penetration\nDiamond choker for some reason give me pure ventilation\nEvery real nigga livin' will respect this collaboration\n\n[Verse 10: Tee Grizzley]\nWe the bust down brothers, check the Rollies out\nSay you winnin' one more time, I'm pullin' trophies out\nNiggas know we out, no Shaqs, all Kobes out\nIn other words, I'm with all shooters that'll blow you down\n(Boop-boop-boop-boop-boop-boop!)\n\n[Verse 11: Lil Yachty & Tee Grizzley]\nFrom the D to the A, put respect on it\nIf that's your ho, why my dick got her mouth on it?\nI'm from the south, I got diamonds in my teeth\nI got fur on my fleece, my new ring could pay your lease\n(Lease, nigga)\n\n[Verse 12: Tee Grizzley]\nChain on my dresser next to my indictment\nWhen they said not guilty I was so excited\nFrom the A to the D, bitch you heard Yachty\nWraith comin' this summer, I'ma have your bitch drivin'\nBitch!"}], "artist": "Tee Grizzley"}