{"songs": [{"image": "https://images.genius.com/4e938672ba331b168f4f463f35fdd247.637x637x1.jpg", "year": "2000-12-12", "title": "D.N.A (Drugs-N-Alkahol)", "album": "Restless", "lyrics": "[Intro]\nDrugs-N-Alkahol baby! Ahhh!\nUhh.. mm that's funky.. ohh!\n\n[Verse 1: Xzibit]\nHuh, I'm Mr. What-The-Fuck-You-Looking-At\nI'm Mr. Quick-To-Run-And-Get-The-Gat\nTreat you like the hoods like a diplomat\nXzibit used to push a 'llac, now I'm Range Roving\nTakin over never sober, bear witness like Jehovah\nEnemies fall like October\nRestless standing tall like a soldier\nWe thick like the first Motorola brick cellular phones\nCut to the bone, celebrating \"Dre Day\"\nLove it or leave it alone (ha hah)\nJust consider me the heir to the throne\nThe lifestyle of the savage and well known protecting my owns\nRolling stone bringing it home, time for transition\nDon't talk too loud, you might find yourself missing\nLook into my eyes, all you see is will to survive\nBy any means, retreating to the Philippines\nTo meditate, liftin train like a heavyweight\nHit you and run with a California license plate\n\n[Hook: Xzibit & Snoop]\nWhen y'all niggas stop acting like bitches\nBitches stop actin' like niggas we can all clock figures\nHoes on my dick, niggas on my dick\nThey all on my dick, FUCK THAT SHIT!\nWhen y'all bitches stop acting like niggas\nNiggas stop acting like bitches we can all get riches\nHoes on my dick, niggas on my dick\nFUCK THAT SHIT! We can all get rich!\n\n[Verse 2: Snoop Dogg]\nDoggy Dogg is 'bout to blow up\nAll.. these Snoop Dogg haters need to slow up, show nuff\nKnow what? X, the game is getting slower\nBut I'm speedin 'em up and leaving 'em\nI'm bucking 'em util they bleeding bruh\nHold up, FUCK THAT, you trying to get swoll up\nBy the mic controller, clip reloader\nFrozen exposure, Cordozar the Composer\nSick like a bowl-of, a bowl of deez nuts\nFuck him up, cross him out, then toss him out\nWith the stamp on his head, nigga Dogghouse\nNigga I'm universal cracking Down South (ya heard?)\nPopping my collar with my dick in your girl's mouth, ha ha\nYou act like a dude you get smashed on fool\nLoud-mouth bitches with your fucked up attitudes\nNappy-head hoes, worse than bitch niggas\nI treat 'em all the same, bitch check your game!\n\n[Hook]\n\n[Verse 3: Xzibit]\nWith the flick of a wrist, send you deep into the abyss\nI don't pop Cryst', but will pop a nigga with this\nMade my way to the top of the list, raised your fifth\nAnything to keep it moving make it harder to hit\nWe survive when you thought we was finished and done\nLooking over my cold shoulder is Attila the Hun\nThe Gatling gun, guillotine, Don King's American Dream\nSince sixteen, shoulda been a marine\nMaking the whole scene collapse, millennium raps\nWhy fight for scraps, relax and take the whole plate with ya\nThe penny pitcher with a whole lot of come and get ya\nYou gettin' my picture or do I have to let 'em hit ya? HUAHH!\nFeel the adrenaline rush whenever I bust\nGot eyes in back of my head\nThe people the I trust is just like me\nFull of spite with very large appetites\nI'm too complex to break down in black and white\n\n[Hook]\n\n[Outro: Snoop Dogg]\n(AH-AHHH!) Nigga, yeah yeah, yeah yeah, yeah yeah, ahhh\nYes.. X to the Z, D-O-double-to-the-muthafuckin-G, OOOH-WEE!\nAhh.. this shit funky right here my nigga\nYeah, Open Bar nigga, we getting fucked up\nThree, four in the morning, ain't no time limits\nHuh huh, you ain't trying to hotbox with us nigga\nRoll some X, y'know!\n\nAhh.. niggas, bitches, niggas, bitches\nNiggas, bitches, niggas, bitches\nNiggas, bitches, niggas, bitches\nNiggas, bitches, niggas, bitches\nNiggas, bitches, niggas, bitches\nNiggas, bitches, niggas, it's all the same though"}], "artist": "Xzibit"}