{"artist": "Yukmouth", "songs": [{"album": "Thugged Out: The Albulation", "image": "https://images.genius.com/6dcb01d30774cfc257eef87de8bad453.500x500x1.jpg", "year": null, "lyrics": "*(Yukmouth)*\n\nYes!\n(Uh!)\nYes!\nWelcome!\n(Thug niggas throw yo turf in the air!)\nSmoke-A-Lot up in this bitch!\n(Throw yo hood in the air!)\nA-G-2 the Ke, DMG, yes!\nLet's kick this anthem shit\n\nChorus *(Yukmouth)*\n\nAll of my niggas Ridaz\nSmall time grindas, pimps and big timers\nWhether it's heron or hemp wit China\nI'm not a bitch on the strip sellin vagina\n(Come on, come on)\n\n\nVerse 1 *(Yukmouth)*\n\nNigga I'm always into somethin\nIf I can't beat yo ass then I'm dumpin\nGive a nigga the pumpkin head deluxe\nThen come back an shoot up they whole fuckin function\nWe funkin\nRootin-tootin, smokin on blunts wit skunk until a nigga malfunction\nGet in the coupe and punch it\nNiggas be funkin for nothin\nFuckin the game, another nigga done lost his name for side bustin\nFire somethin\nPuffin\nI put it up in the air\nYou niggas live to die hustlin, I'm fuckin wit playas from every where\nFrom Las Vegas to Delaware on down to there\nI'm a thousandaire\nMackin bitches, draggin 'em down the strip juss by they hair\nLike \"Oh dear!\"\nWhere the fuck is money? Don't go there\nI leave yo ass stuck, hungry starvin in the middle of no fuckin where\nI swear\nCut off your privlage like welfare\nSection 8, Smoke-A-Lot'll stay placed in Berlin\nBy the end of 9-8, hell yeah\nThen I'll be straight\nFuck off a hundred G's and still got money up in the safe\nRidaz nigga!\n\n*(Chorus)* 2x\n\nVerse 2 *(G-Mone of A-G-2-A-Ke)*\n\nGo inside the twitchin, missin, my mission I vision the hit\nSuckas keep watchin yo mental mix is gettin twisted\nWho is this? In the kitchen wit fixings for the come up\nServin rocks on the block til it get hot snitch we ridin on ya\nBitch we Ridaz\nRemind ya that niggas high\nIf I introduce you to the ditch, you don't wanna die\nIs the hit\nSmoke, drank already lit\nCaulkin my shit\nWho you think you fuckin wit?\nI said recognize the mutha fuckin Mobb hoe\nI don't know nothin, juss heard poppin by the door\nWho flipped you in the river did you see G Mone in the \"O\"\nBy the ???\nFlippin this A-G-2-A mutha fuckin Ke\nYou best believe we rob yo spot\nWhy not? We Rap-A fuckin Lot\nOwe us some paper\nThere's no reason for us to not Glock\nPosted wit yo mouth open hopin that I don't squeeze\nWit a swift chopped up to his knees\nSay where the cheese?\nWe Ridaz!\n\n*(Chorus)* 2x\n\nVerse 3 *(Yukmouth)*\n\nI'm juss a Y.G\nWho snuck in the gamblin shacks\nScramblin crack wit niggas who did more years than Geronimo Pratt\nKillas wit hands on they gats, mutha fuckin murder fo' hire\nMobb attire, pupils dialated, nigga hog tied in barb wire\nTorture, squeeze a niggas nuts wit plyers\nPut his place on fire\nThen escape juss like McGuyver wit the get-away driver\nLive and direct from the projects that be gated\nOn some made shit\nOutlaw affiliated!\nHe chose to spray wit gages\nBaraccaded the scene, yellow tape and white chalk\nNiggas who like doe, I get paid off\nFuck a write-off\nIt's tax free money\nDeliver 'em a China up inside a Taxi honey\nTask be lookin at me funny\nKnow I'm a trigga happy, gats be hungry\nBarkin on niggas like DMX\nBeat bitches like PMS\nAnd flee ridin a BMX, flippin GA checks at yo set\nGrab the promoter by his mutha fuckin neck\nDon't be fooled by the Rolex!\n\n*(Chorus)* 2x\n\nVerse 4 *(DMG)*\n\nWho in the mutha fuckin hell\nNothin but Regime Ridaz\nSouthside affiliated wit big timers\nBallers\nKillers, who live in mansions off the water\nLunitiks, shippin in bricks after brick\n200 percent, pure snow white Coca-Cola\nStraight Yola all the way from the Bay to Minnesota\nWhat you know bout, this Face Mob rida\nDumpin off on yo shit 4 and 5 timer\nYuk, I think it's time we fuck these mutha fuckas up\nShow these mutha fuckas up, straight up drama uncut\nFuck they mamas\nThey fuckin wit killas wit seven figgas\nPsycos, drinkin the bottles of nitro\nNow it was Yukmouth\nThat told me that\nHe got \"5 On It\"\nAnd I believed that\nAnd now you\nBetter believe it too\nNigga I will shoot\nMurder up you and you we Ridaz!! (echos)\n\n*(gun shots fire off)*", "title": "Ridaz"}]}