{"artist": "6LACK", "songs": [{"album": "East Atlanta Love Letter", "title": "Scripture", "lyrics": "[Intro]\nNo matter what, you can't take what I've been through\nImagine if I never went through what I went through\nYeah\nCame, up, uh\n\n[Verse 1]\nAyy, I want more\nUntil I get it, I won't slow\nI'm on tour\nOpening some brand new doors\nOn top, but we came from the floor\nDo you believe in foresight?\n(I do, haha, 'cause I can't ignore life)\nLook, I wrote this in a hotel the size of a closet\nJust to show you that I could do it\nJust to show you that it ain't much to it\nIf you got your hand out, don't be surprised when I look at you stupid\nWhere were you when it was me and the music?\nDon't compare me to no nigga that I'm better than\nStill new, but my attitude veteran\nAnd ain't nothing wrong with it\nSince six I knew I was gon' get it\nI ain't working 'til my palms start itchin'\nEver since a nigga put a gun to my face\nThat shit do really make you think, yeah\nI was thinking 'bout my kid, yeah\nSixteen, didn't even have a kid, yeah\nThem bullets really have you thinking about your unborn\nImagine if my whole life was untorn\nImagine when that car flip\nDon’t call it defeating odds it's-\nA blessing that I ain't gone yet\n\n[Chorus]\nI've been getting closer to God (yeah)\nNot a scripture, we been talking direct (straight line)\nSend for me and I send you closer to God (yeah, word)\nYeah, yeah, yeah\n\n[Verse 2]\nI'm on pace\nI figured out this shit ain't a race\nUp the stakes\nGot hungry, then I scrape the plate\nIt ain't hard for me to change my ways\nDo you believe in foresight?\n(I do, haha, 'cause I cannot ignore life)\nLook, the playing field ain't never been even\nI ain't 'bout to make that shit either\nSee em' tryna copy my aura, they some readers\nStudy all you want, but I came up out that freezer\nGetting bread across the Mediterranean like a pita\nYou a heat seeker, speak up\nNiggas telling me to speed up\nYou can fit your talent in a B cup\nLeaders of the new school, I think they need us\nBut first, let me light my weed up\nMy intuition ain't never led me astray\nWith all this shit on my plate\nYou'd think I'd be running in place\nBut I step to that mirror, look myself in the face\nCan nobody take my place, said they got me then they flake\nYou can try, you can test, you get sent to the gods\nI'm a R&B nigga with a hip-hop core\n\n[Outro]\nHaha, said I'm a R&B nigga with a hip-hop core, yeah\nWe just had to do that, if I don't rap anywhere on this, people are gon' hate me", "year": "2018-09-14", "image": "https://images.genius.com/68d505210dfe645f563d657a5dd75757.1000x1000x1.jpg"}]}