{"artist": "Andre Nickatina", "songs": [{"title": "Jelly Bean Colored Suits", "album": "Khan! The Me Generation", "year": "2010-04-20", "image": "https://images.genius.com/a40bfc48fac301c14baf8ed031c3f584.600x600x1.jpg", "lyrics": "I wear clothes that'll circle the globe\nAnd write raps that make them out of your nose\nI'm like a beara tone\nI take the Vegas trip man that's my favorite\nI hit the strip like a sailor coming off a ship\nI'm in the back of the car like a mafia don blowing weed wearing Louis vaton\nI'm like the diamond out of Africa\nIn the cheesecake factory talking loud like a pastor be\nI got wings that birds don't have and I fly like the birds don't fly\nIn the midnight kill an hour\nI give my life to the holy kirran but it's way behind the god of khan in the sun of Milan\nStep back as I roll the bomb\nYou might text but I won't respond\nIt's the blueberry\nGoing 90 down seminary Bumping the scarriac?\nBecause I'm so damn fresh yeah\nI wear rings like the young slick Rick and if I pawn them I can buy a brick\nFeel me on that. I crack a smile like a cracked bottle I talk shit to all the poor damn strip models\nI smoke weed like I won't get caught\nI drive my car like I'm sellin' a yot\nI'm always ask baby what you got\nI'm always ask baby what you got\nI'm always askin' baby what you got\nGive it to me\nI shoot thru like a free throw\nI'm not high but people try to find me like Nemo\nI wear the Sean john. The new white one\nI'm from Frisco\nBalcor, Barry bonds\nMan let me roll the around it\nGoing up something like hydraulics\nI be shopping on market\nYo anything fly in my sight is my target\nI like cars with the fresh leather I like them real tough\nSo I gotta call my Foid Mayweather\nI eat the gummy bears buy shoes in double pairs\nWife beaters under my shirt is what I gotta wear\nI chew now an laters and wear alligators be at the parties where you see all the ball players\nPhilmore days. Tahoe nights\nMan I be rapping just raise up the coke price\n\nMy closet looks like jelly beans from all the colorful suits that I got from the Philippines\nI keep my nails clean\nA little visene\nI'm at the mesanino root boy yanah I mean?\nI take it back like brown royal\nOr for the stop homie\nTurned it into a gym and win the pot foil\nShe like baby oil and a sweet sense\nI like something automatic on the flight trip\nAnd when it's automatic man you can see the cabbage\nYou can see it in my face\nMan I'm extra manage\nMore new cars more fresh clothes\nMy deek is the code for the pesh mode\nI like to laugh like the hyena\n\nCause every time I think I'm gonna lose I'm a straight cheater\nI wear wife beaters at your pool parties\nBut i ain't Not getting my hair wet for nobody\nI take off like a redeye\nAnd I could shoot to la in atleast 45\nTil the sunrise then we cut pies\nAnd the girls only talk to the trick guys\nI hit my lawyer with a quick bundle\nJust to let her know sometimes a guard might be in trouble\nI roll blunts in the backseat\nAnd then I sit on that ass and I watch the whole track meet"}]}