{"artist": "Valete", "songs": [{"title": "No meio das labaredas", "year": null, "lyrics": "Eu sou o bófia que entra no gueto com instinto assassino\nEu sou o gueto sem futuro sem destino\n\nEu sou o teu pai a pontapear a tua mãe\nEu sou tua mãe a chorar e a dizer-te que tá tudo bem\n\nSou Tony Carreira cheio de sucesso e afeto\nSou o maior cantor do país a pedir esmola no metro\n\nEu sou o grande traficante de droga sem cadastro\nSou o pequeno traficante há 5 anos encarcerado\n\nSou teu patrão num BM X3\nSou tua cara quando vês a conta bancária a meio do mês\n\nEu sou a retórica deste político cheio de juras e ilusões\nSou a irrelevância do teu voto no dia das eleições\n\nEu sou tua avó na igreja a rezar por um mundo mais humano\nEu sou o padre a enrabar o teu irmão de 10 anos\n\nSou filho de Salazar e de Antero de Quental\nUma nação duas caras, eu sou Portugal!\n\n\nQue sa foda o comunismo mano eu amo as pessoas\nA ideologia está só neste amor que me abençoa\nEu choro em cada fraqueza que te amaldiçoa\nEu vivo em cada sentimento que te povoa\nNunca viste um corpo subnutrido?\nA cair no solo desfortalecido, inerto e apodrecido?\nNunca viste uma mãe a vender o seu próprio filho?\n\nA perder p'ra miséria e p'ra vida sem trilho?\nNunca viste uma criança no meio do fogo cruzado\nParalisado, com as almas opacas destes homens armados?\nNunca viste um homem no alto mar\nCom uma canoa a procura da Europa e sem saber p'ra onde remar?\nNunca viste nada disso, tu não entendes a luta\nNão entendes a necessidade de ter a alma incorrupta\nNão entendes a mensagem que nos impede de viver sós\nNós somos os outros e os outros somos nós, mano\nVê tantos outros que precisam se nós\nHoje é por esses outros que eu ergo a minha voz\nÉs a fauna, és a flora, és a aurora, és a história\nÉs o rio, és o sol, és a nascente e a foz\nTudo és tu e tu és tudo, tu sem o tudo és dor, és luto\nP'ra diferença que pagas não tens álibi\nEste mundo que acaba, acaba dentro de ti\n\nVou crescer no meio das nuvens negras\nOlha p'ra mim no meio das labaredas\nOlha p'ra mim no meio das labaredas\nVai renascer aqui homens formam poemas\nVou crescer no meio das nuvens negras\nOh, no meio das labaredas\nA renascer aqui homens formam poemas\nVou crescer no meio das nuvens negras\nOlha p'ra mim no meio das labaredas", "album": null, "image": "https://images.genius.com/1ec9a704e065eb4f5b2125cdfb6cd195.429x429x1.jpg"}]}