{"songs": [{"title": "All We Need Is Love", "album": "OG In My System", "year": "2017-08-18", "image": "https://images.genius.com/310f7d7a842817a60ca4801917821dbb.1000x1000x1.jpg", "lyrics": "[Verse 1: Lil Debbie]\nAy, life's getting crazy\nWhat to do, what to do, yeah (yeah, yeah)\nProblems all around\nWorld is cruel, it's so cruel, yeah (yeah, yeah)\nSearching for a feeling\nSomething true, something true, yeah (yeah, yeah)\nI been on the vibe\nSomething new, something new, yeah (yeah, yeah)\nGather every nation, burn a peace pipe\nEven through the night I can see the light\nTell me what it's gonna take till we break\nKill the hate, we're in war and I'ma lead the fight\nPower, greed, the money, that's the root\nWe aloof, gun strong, hands up, don't shoot\nWhat's the use to this?\nI been looking at the world from a different scope\nRealest shit I quote\nLove and hope is the antidote\n\n[Chorus: Stacy Barthe]\nAll we really need is a little bit of love\nL-O-V-E, love! L-O-V-E, love! L-O-V-E!\nAll we really need is a little bit of love\nL-O-V-E, love! L-O-V-E, love! L-O-V-E, love!\n\n[Verse 2: Lil Debbie]\nThe power to breathe life and kill war\nThe power to end hate and feel more\nThe power to break the shackles and free 'em all\nOpen blind eyes to understand that we need more\n'Cause we all been the victims of the vision\nLike race, class, sex and religion, it's a prison\nLeave the past behind and free your mind\nChanging for the better, I can see the signs\nMy prayer to the one above\nAsk him if he took it all could he leave us love\nI promise that will be enough, i promise all we need is love\nI been getting better [?] respect it baby\nHad to get to work cuz it don't get no realer\nStarted in the mirror look at you\nWhat i see, same as me,  now I'm free\nLove is key, harmony\n\n[Chorus: Stacy Barthe]\nAll we really need is a little bit of love\nL-O-V-E, love! L-O-V-E, love! L-O-V-E!\nAll we really need is a little bit of love\nL-O-V-E, love! L-O-V-E, love! L-O-V-E, love!"}], "artist": "Lil Debbie"}