{"artist": "Fabolous", "songs": [{"year": null, "album": "Loso’s Way", "image": "https://images.genius.com/882378e21c9d8f7f6edbe6217683d217.630x630x1.jpg", "lyrics": "[Intro - Ryan Leslie - talking] (Fabolous)\nOne, two, R-Les, Loso, we do it like (hey!)\n(Yeah! Let's go R-Les)\nJust rock with me now (yeah!)\n(Yeah, ohh)\nNextSelection (ohh)\nHaha\n\n[Verse 1 - Fabolous]\nSame shit different day, just ride through the city, lookin pretty as the usual\nIt's the same old thang, got the name on the chain, just to let 'em know, who's who\nAnd they know I've over here, so they come and find me right after they lose you\nFor you niggas in the way, we can let the guns say - excuse you\nAt the end of the day, we just tryin find our way and I might be a come up (nice)\nAnd baby you can hitch a ride but you gotta know how to do more than keep a thumb up\nIt's so incredible that it ain't edible but they know the cake's real\n(I'm the Pillsbury Dough Man)\nYo, I couldn't even say, ask these other silicon niggas how being fake feel\n\n[Hook - Keri Hilson & Fabolous]\nYay, every day is my day, I'm a do it my way, every day, yeah\nEverything about me, what they love about me? Everything, yeah\nEverywhere that I be, feel VIP baby, yeah, baby\nAnd everybody's cool, but y'all, just, ain't, me\n\n[Verse 2 - Fabolous]\nSomebody better tell 'em that we in this bitch like an unborn baby (hey!)\nSee we be everywhere and they ain't never there, couldn't tell you where they be\nAnd you already know you ain't gotta ask me you can see that everything is up\nAnd I'm so about my money, you ain't talkin about no money\nYou ain't even gotta bring it up (Huh?)\nAnd I hope you don't think me give a sugar honey iced tea or a middle finger up (haha)\nI just stay sucker free, leave the lames where they be and I let my chips Pringle up\nEverybody calm down, there's enough to go around, you just gotta say how much you want\nDon't know what you're lookin for, unless it's a problem, I promise this ain't what you want\n\n[Hook]\n\n[Break - Keri Hilson - harmonizing for 18 seconds] - w/ ad libs\n\n[Verse 3 - Fabolous]\n(Hey!), can you do me this favor?\nAnswer this question (huh?) - y'all gon' try who? (please)\nSee the shoes by Gucci, bag by Louie, the hatin'll be by you (hater)\nAnd I appreciate the love, thank the man above\nCause a nigga feel so blessed (thank God)\nYeah and I ain't gonna stop, better get 'em Red Bulls\nI don't give these haters no rest (yeah)\n\n[Hook]\n\n[Break - Keri Hilson - harmonizing for 18 seconds] - w/ ad libs\n\n[Outro - Keri Hilson - singing]\n\"Every\" - repeated until fade", "title": "Everything, Everyday, Everywhere"}]}