{"artist": "Famous Dex", "songs": [{"year": "2017-04-18", "album": null, "image": "https://images.genius.com/ed695d41f47334bb720e54cb58606b9f.500x500x1.jpg", "lyrics": "[Intro]\nWhat we doing, Rocky? Dexter\nPour me up Rocky, you know what I'm sayin'\nPour me up some of that Big Blue, ya dig\nWhat's up, J? Ooh\nOoh, Dexter!\nYeah, what?\n\n[Chorus]\nPourin' up a Wock in the Big Blue (I did)\nDon't want to sip but your bitch do\nLookin' at your diamonds so fufu (What?)\nA pussy ass nigga wear hoola-hoop\nWait, if they tell me get em, I got em (What?)\nI pint sit, call up Rocket (Lil Rocket)\nRun in your house tell 'em drop it\nDon't want that bitch man I tell her to stop it\nPouring up a wock and the Big Blue (the wock)\nDon't want to sip but your bitch do (Lil Bitch)\nLooking at your diamonds so fufu (ah-what)\nA pussy ass nigga wear hoola-hoop (wait)\nIf they tell me get them I got them (what)\nI pint sit call it Rocket (Lil Rocket)\nRun in your house tell 'em drop it\nDon't want that bitch man I tell her to stop it\n\n[Verse]\nRun in your house tell em' drop it\nOpen the safe boy you better not lock it\nDon't want that bitch she ain't poppin' (huh)\nShe fuck for the fame, I'm not rockin' (Dexter)\nFly as hell like my nickname is Peter\nI just might buy a new freezer (what)\nDon't want that bitch she a eater\nYou wifing that bitch don't believe her (Dexter)\nWait, wock, huh sippin' that wock I don't stop\nSippin' that wock fill my heart (ou)\nMy diamonds shine in the dark huh, wait (huh)\nI just pull up in a Bentley coup (huh)\nPussy ass nigga wear tutu (bitch)\nA diamond color like some fruit (ah-what)\nCall up Gino you know he gon' shoot (Dexter)\n\n[Chorus]\nPouring up a wock and the Big Blue (I did)\nDon't want to sip but your bitch do (Lil Bitch)\nLooking at your diamonds so fufu (ah-what)\nA pussy ass nigga wear hoola-hoop (wait)\nIf they tell me get them I got them (I got em')\nI pint sit call it Rocket (Lil Rocket)\nRun in your house tell 'em drop it\nDon't want that bitch man I tell her to stop it\nPouring up a wock and the Big Blue (The wock)\nDon't want to sip but your bitch do (Lil Bitch)\nLooking at your diamonds so fufu (ah-what)\nA pussy ass nigga wear hoola-hoop (wait)\nIf they tell me get them I got them (what)\nI pint sit call it Rocket (Lil Rocket)\nRun in your house tell 'em drop it\nDon't want that bitch man I tell her to stop it", "title": "Big Blue"}]}