{"artist": "6LACK", "songs": [{"album": "East Atlanta Love Letter", "title": "Disconnect", "lyrics": "[Verse 1: 6LACK]\nYou think I don't know when to call it quits\nHow could I not know after all this here?\nI spent so much time tryna find a signal but\nIt’s safe to say it's no good\nA nigga need to roll up\n\n[Pre-Chorus: 6LACK]\nNo, I don't wanna piss you off\nNo, I ain’t tryna make you yell\nGirl, why you wanna kick me out of my natural element?\nNo, I don't wanna piss you off\nI ain't tryna make you yell\nNow why you wanna kick me out of my natural element?\n\n[Chorus: 6LACK]\nI'm tryna work it out\nBut we got a disconnect (disconnect)\nI'm tryna work it out\nBut we got a disconnect, hey\n\n[Verse 2: 6LACK]\nLove is not looking over shoulders\nLove is you should trust what I told you\nLately it's like you been speaking fantasy and I'm speaking reality\n'Cause we got problems we ain’t getting over\nI think we breaking up\nAnd not just on some boyfriend-girlfriend shit\nI think we had enough\nLike, I can’t hear you\nI'm falling out of love\n\n[Chorus: 6LACK]\nI’m tryna work it out\nBut we got a disconnect\nI'm tryna work it out\nBut we got a disconnect, hey\n\n[Verse 3: 6LACK]\nLove is not struggling to tell you \"I love you\"\nOr you saying music's above you\nI do this shit here 'cause I need\nI need you, but you couldn’t see, so\nI'm out here, listening to Monster\nHeartbreak sponsor, smoking on the ganja, yeah\nNo, I don't have no time left to care, spare, or share\n\n[Bridge: 6LACK]\nYou done made Cupid aim away\nA bow and arrow could take the pain away\nYou done made Cupid aim away\nA bow and arrow could take the pain away\n\n[Pre-Chorus: 6LACK]\nBut I don't wanna piss you off\nI ain't tryna make you yell\nGirl, why you wanna kick me out of my natural element?\nGirl, I don't wanna piss you off\nNo, I ain't tryna make you yell\nWhy you wanna kick me out of my natural element?\n\n[Chorus: 6LACK]\nI'm tryna work it out\n\n[Outro: LightSkinKeisha]\nNiggas be so motherfucking quick to talk about, \"Oh, I want a bitch that's loyal, I want a bitch that's loyal.\"\nAnd it's like, damn, nigga, what the fuck you think these bitches want from y'all niggas, period? The fuck?\nY'all be the first one that talks about loyalty, but be the first ones to fold on a bitch in a motherfucking hot second\nLike, damn, nigga, you can't hold it down for two seconds? Hold your dick down, nigga\nI'm holding my pussy down, I'm keeping my pussy to myself - keep your dick to yourself, nigga. That's mine! The fuck? I don't like to share, period!", "year": "2018-09-14", "image": "https://images.genius.com/68d505210dfe645f563d657a5dd75757.1000x1000x1.jpg"}]}