{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Produced by Large Professor]\n\nThings been said, plenty rumors been spread\nMany many many new jacks got it in they head\nThat they can raise up on this and put the Kane in fright\nHe-he, Yeah right!\nListen, you're just as soft as baby powder\nDon't let your mouth get you in somethin'\nYour rhymes can't get you out of\nSome good advice is don't even come out my way\nYou better press upon Chucky if you're lookin' for Child's Play\n'Cause I'm a grown ass man in total command\nOne of the best to ever be and\nNo other can ever take a stand\nWhen I kick a verse, the scene becomes so scary\nThat niggas get quiet like a library\nI pick up the mic like a hunter in hot pursuit\nOh, you want some of this? Then put that mic on mute\nBecause you'll be in more danger than Penelope Pitstop\nPoint blank, you get your shit dropped\nI got a death blow whenever I throw\nWith double impact to take out the whole row\nHuh, I start swingin' again and again\nYou'll hear so many “Ooh-ah's” you'll think it was Boyz II Men\nI break down, shakedown, proceed down, beat down\nBack down, smackdown, rip down, get down\nShowdown, throwdown, rundown, come down! (DJ rewinds)\nHere's a little message for your own concern\nYou try to press up on this and get burned\nA battle with a non-believe is what I yearn\nDamn, niggas never learn\n\nNiggas!\nThis is for your own concern”\nYou must learn\nNiggas!\nThis is for your own concern\nYou must learn\nNiggas!\nThis is for your own concern\nYou must learn\nNiggas!\nThis is for your own concern\nYou must learn\n\nIf you ever see a jam playin' you can bet that damn Kane\nWill make it sparkle and bubble like champagne\nDom Perignon I'm the Don of the set\nAnd I'll bet, that the girls, will agree\nThat the B, the-I-G, D-A-double-D-Y Superfly feel\nLike Ron O'Neal, gets ill, I got it goin' on\nWord is bond, I'm more Dangerous\nThan Michael Jackson, hah, sha-mon!\nSo, I don't attract with the wick-wick-wack\nSo take a step back, you new, new, new jack\n'Cause young boy, all of your rhymes are pre-natal\nMines are fatal, 'cause I got The Hand That Rocks the Cradle\nSo stay in your crib pen, before you get did in\nUhh, I mean done in, you gets none and\nThe last rapper to press upon me wrong was\nUmm... damn it's been that long!\nSo competin' is not a smart decision\n'Cause I start to dissin', then start dismissin'\nYou're tryin' to battle with me well Goddamn scram\nThe style that you're usin' is as old as a Trans-Am\nUpdate yourself just like an 850\nShift see, oh what's the use you still can't with me\nMany MC's tried their best to press up\nBut I guess, their best wasn't good enough\nI'm not Robert Townsend, but every time I speak\nI'll leave a rapper's chest beatin' like he had Five Heartbeats\nKnockin' out comp like Rocky Balboa\nAnd I make more noise than a lawnmower\nFor my stacks, I worked hard to earn\nBein' the bigger the better the badder the boss\nThe brother to break em when bringin' the bomb\nTo blow up the Boogie Down-\n(Inhales, deep sigh)\nDamn, niggas never learn!", "image": "https://images.genius.com/b6cc17d62fd6810516cc285d9804a8ab.1000x1000x1.jpg", "year": "1993-05-25", "title": "Niggaz Never Learn", "album": "Looks Like a Job For..."}]}