{"songs": [{"lyrics": "[Intro: Dr. Dre + MC Ren]\nAh yeah, right about now Compton's in the muthafuckin' house Yeah do it, do it, do it\nN.W.A is in full effect\nAyo, Yella boy, kick me that funky-ass beat right here\nKick that shit in\nYeah, yeah\nPump it up, pump it up\nWho's in the muthafuckin' house right now? Who's in the house?\n(Compton's in the muthafuckin' house)\nPump that shit up\nYeah, yeah, yeah, Compton's definitely in the muthafuckin' house\nAyo Ren, what we gon' do?\n\n[Verse 1: MC Ren & Dr. Dre + Eazy-E]\nTo the people over here\nTo the people over there\nTo the people, the people, the people, people, the people, the people, people\nFrom everywhere watching the show\nPaying top dollars because they know\nWhen we're on the stage, we're in a muthafuckin' rage\n[R] So Dre\n[D] What up?\n[R] Why don't you get the 12 gauge\n[D] Yeah\nAnd show 'em how Eazy-Duz-It\nSo if you punks wanna make somethin' of it\nStep up, run up, get up, what's up, suckers?\nYou want some of this?\nThen you're a stupid muthafucka\nKickin' - like the kick from a kickdrum\nYella boy on the drum gettin' dumb\nProgrammin' - a beat that's hittin'\nAnd if you listen then you know we're not bullshittin'\n\n[Verse 2: MC Ren & (Dr. Dre)]\nDope - like a pound or a key (Yeah)\nSo shut the fuck up and listen to me\nI make a killin'\nI got money to the ceilin' (Why's that?)\n'Cause I'm a muthafuckin' ruthless villain\nMC Ren - stomping any fool in my way\nWith some help from my homeboy Dre\n\n[Verse 3: Dr. Dre + MC Ren]\nNow my name is Dre the muthafuckin' doctor\nRippin' shit up, oh yeah, and here to rock ya\nWith some help from my homeboy E\nThe criminal of the Ruthless posse\nFuckin' it up, word up, is what we do\nThe reputation of the NWA crew\nGettin' busy because we're cold stompin'\nAnd we're born and raised\nAnd we're born and raised\nAnd we're born and raised in Compton\n\n[Verse 4: MC Ren & Dr. Dre]\n[R] Speaking of Compton, it's making me sick (Why?)\nEverybody's talking that crazy shit\n[D] Saying they were raised in the CPT (Uh-huh)\nJust as I was, they try to be like me\n[R & D] Poppin' that shit, get the fuck out my face\nKnowin' that they never even seen the place\nClaiming my city, it's my city they claim\nMuthafucka, we're about to put some salt in your game\n\n[Break: Dr. Dre + MC Ren]\nYeah, I'm tired of these muthafuckas running around town Talking about they're from Compton and shit\nTrying to get on the bandwagon\nYeah Dre, I know what you're saying, man\nBut let's tell them who we're talking about, on the one\n\n[Verse 6: Dr. Dre & MC Ren]\nWhat do you call a crew that can rap like that?\n[R] Yo N.W.A call them muthafuckas wack\n[D] Yeah, you know what time it is, listen to why we call them wack\nThey got a wacky wack record with a wacky wack crew\n[R] Yo, what about the lyrics?\n[D] That shit's wacky wack too\n[R] With a fucked up style and a fucked up show\n[D] Ayo Ren, what about the scratching, is it def?\n[R] Fuck no!\nThe muthafuckin' record is so muthafuckin' wack\nThe muthafuckin' Cracker Jack needs to step the fuck back\n\n[Break: Dr. Dre + MC Ren]\nDo you want some of this?\n(\"Hell no, he replied\")\nDre, the muthafuckin' doctor\nWell, for the record, it's Ren, and for the street, it's Villain\nDre, the muthafuckin' doctor\nWell, for the record, it's Ren, and for the street, it's Villain\nYella boy, why don't you kick me one of them funky-ass beats?\nMy boy, my boy, my boy Ice Cube\nYo, we got my homeboy Eazy-E in the house\nWon't you tell 'em what your name is?\n\n[Verse 7: MC Ren]\nMC Ren is the muthafucking coroner\nI'm getting rid of muthafuckas as if they was a foreigner\nShow no grief to pretend when I sin\nI punch you can block it but I'ma still get in\nThis ain't a TKO in the first\nBut it's some shit from a nigga in black and much worse\nThan a beating from Tyson 'cause Ren is not nice and\nYour ass is better off just rolling a dice and\nFinding you a number for luck\n'Cause you will need it when you see I don't give a fuck\nMy identity, and the shit is getting shown\nWithout a video I'm still getting known\nI'm at a show then my picture is taken\nOne click of the flash and punk niggas are breakin'\nTo the door, tryin' to join my fan club\nLip-syncin' over one of my dubs\nAn instrumental will scratch for the moment\nUntil I fuck up the so called opponent\nThat's standing in the zone of the twilight\nSaying, \"How in the fuck did he get mixed up in my fight?\"\nIt wasn't a mistake, it was a set-up\nSo until I'm finished pumpin' my lyrics, you should shut up\nAnd don't attempt to speak\nBecause it's bad enough you're rollin' up shit creek\nWith a nigga like Ren about the hit\nNow let me hear you muthafuckas talk some more shit\nOr I'ma bust your ass in your mouth\nYo, unless you're saying, \"Compton's in the house\"\n\n[Verse 8: Dr. Dre + Eazy-E]\nWho really cares - about a sucker on a take off\nBust a move, we can have a shake and bake-off\nMe and you can go 'cause I don't care\nYo, rap fight or guerrilla warfare\nWe can rumble, 'cause when my lungs go in and out\nI kick rhymes in a bundle to win a bout\nOr scurry or scuffle\nI just muffle the opposition, there's no competition\nLet them know that Dre is getting stronger\nCompton's in the house but now it's some' longer\nI won't get set-up, shut up, I'm kinda fed up\nYou can say uncle and I still won't let up\n'Cause Dre is the muthafuckin' doctor\nAnd if me and Ren's on the mic, it's like propaganda no doubt\nBoy, you should've known by now\n(\"Compton's in the house\")\n\n[Outro: Dr. Dre]\nYeah, it's time to put Compton on the map\nSo don't ever think you can get it none, you stupid muthafuckas!\n(\"Compton's in the house\")", "album": "Straight Outta Compton", "year": "1988-08-08", "title": "Compton’s N the House (Remix)", "image": "https://images.genius.com/0ec6f769fde231f68fadfff699d2b94c.1000x1000x1.jpg"}], "artist": "N.W.A"}