{"songs": [{"year": "2003-08-25", "album": null, "image": "https://images.genius.com/7666f8dbb7db7bdbcd9bea1e0bd66cb6.600x600x1.jpg", "title": "Milkshake (Remix)", "lyrics": "[Intro: Kelis]\nFirst you make sure you've got two cups\nJust in case, hmm, he shows up\nMake sure they're ice cream filled\nBut you can't forget about the milk\n\n[Verse 1: Pharrell]\nYeah nigga, see me in the air nigga\nLearjet then I'm there nigga\nA 'G' somethin and I'm coastin\nHit a bird out the sky see him closin to the ocean\nYeah nigga, I wear Billion Eight, not Air nigga\nIt's like five hundred for a pair nigga\nWhatchu fallin out your chair nigga? Dont stare nigga\nYeah nigga, niggas' act so phony\nSee me rockin my roley, you wanna call the police\nI skateboard nigga, you dont know me, ho please\nIma show you more beats, more fees, more keys, more vis\nBBC, wait a minute, more cheese\nMore Pouncey's flyin overseas\nI told you I'm in the air nigga, hmm, yeah nigga\nYou see what's in my ear nigga?\nQuarter million for the pair nigga\nDont ask about this here nigga\nCause a ring's somethin you dont wanna hear nigga\nSee you scared niggas, whatchu dare nigga\nI pay Liberace fair nigga, so yellow so rare nigga\nSo there nigga, hmm, yeah nigga\n\n[Hook: Kelis](x2)\nMy milkshake brings all the boys to the yard\nAnd there like \"It's better than yours\nDamn rite, it's better than yours\nI could teach you, but I have to charge\n\n[Verse 2: Kelis]\nEverybody wanna know about who I touch\nMy reputation and who I fuck\nSome of y'all think I squeezed by with luck\nBut that ain't stop, that's from buyin that new Porsche truck\nYeah, I said Nas, y'all sick of SARS\nGot the big house, cars, and garage\nI'm kinda into Cosabella bras\nI'm kinda into Vicky's secret draws\nYeah, Vicky's secret if you can keep it\nIf you don't leak it, maybe you can eat it\nFendi bags, Prada lenses\nLV Trunk, boo I'm expensive\nMy girls know who I be (true)\nMy girls like VIP (true)\nAnd they like Hpno-I-C (Que)\nAnd they ain't tryin to show you ID (True)\nLookin like a queen from Karnival\nNiggas try to talk to me on the low\nI ain't really catchin cause I'm on slow\nAnd tryin not to scratch my Mano-lo\nBlahnik, used to smoke chronic\nNow show me blunts, I might just vomit\nAll you little niggas, thanks for the comments\nCause now it's fifity G's for Kelis to be on it\n\n[Hook]\n\n[Post-Hook: Kelis]\nLa-la la la la\nMy milkshake brings all the boys to the yard\nLa-la la la la\nHey-hey hey hey hey\nLa-la la la la\nDamn rite it's better than yours\nThis is the remix\n\n[Verse 3: Pusha T]\nHmm, flows on top of flows\nTwo hundred karats in my B-Boy pose\nCool Whip, the ice cream rake em in O's\nMy milkshake sell way better than yours\nKeep my bitch in that juicy ga-tor\nSweats over the Louis's and they draggin the floor\nLemme tell how to mack a whore\nShow that bitch Lacroix then take her back to poor, hmm\nYeah, I'm big wheelin, seen that B, with the mesh grillin?\nHow it stretch from the seat to the ceilin?\nBlack on black playing a villain, lap full of stainless steel-in\nHmm, yeah, imagine the feelin, drop Lord Willin' sold a million\nThe first woulda been GT from dope dealin, top billin\nAudio too, heard ya flows now it's time for school, check it\nHmm, don't let my Rollsy change through ya\nNothin bout Pusha tool up, it's just Jacob's my jeweler\nLike to keep me cooler, keep heat in Philly like Slick Rick the Ruler\nYoung rappers act like y'all know, '04 is mine with the rhyme fo sho\nQuarter million selling out the door\nKelis two million stand on that so-pho-more, Clipse!\n\n[Hook](x2)"}], "artist": "Kelis"}