{"songs": [{"album": "3ChordFold", "image": "https://images.genius.com/51f2b6e20460f075460157eae988ce37.600x600x1.jpg", "year": null, "title": "No Wrong No Right", "lyrics": "[Intro: James Fauntleroy]\nNo wrong no right\nDon't know why it's so hard to let go\nWe should've called the quits a long time ago\nFeeling like we both get a half alone\nI could do bad on my own\nEven laying next to you it don't feel right\nExpectations are too high\nI'm not meeting yours you ain't meeting mine\nAll I really wanted was a happy life\nSo baby can we please sign?\n\n[Verse 1: Terrace Martin]\nAll of this back and forth\nDon't really run this course\nAt first we were so supportive\nNow we treat each other like a couple of orphans\nDysfunctional everything\nWe build this outta order\nNo hopes of getting better\nIf this is whatcha wanna do I might al well let'ya\nPerfect novel baby I refuse to settle\nI medicate myself but ain't no numbing this pain\nStudio on a plane but really ain't no escape\nStill calling home through\nFor whatever's worth\nI'm sorry it's too late for all of that now\nAnd that's when the fighting starts\nYou say things I say things too\nWe let our pride get the best of us\nThis ain't what people in love do\n\n[Hook: James Fauntleroy]\nGirl it's your sign and then my sign\nGirl it's your sign and then my sign\nIt's true\nNo wrong and no right\n\n[Verse 2: Terrace Martin]\nSo baby can we please stop?\nAll of this back and forth stepping\nThere's no moving forward\nSee our relationship died a long time ago\nIt's like a ship I couldn't keep afloat\nI hear that love predicts all things but now you and me\nDifferent day same song\nWe are not in sync\nI turn the music loud\nSee if I could tune it out\nToo many reminders we ain't working out I said\nI said love don't hurt but emotions do\nTried to keep it cool should've kept it moving\nBut I can't refuse it wanna see us happy\nWanna see you happy even if it's without me\nThat's real\n\n[Hook]"}], "artist": "Terrace Martin"}