{"songs": [{"image": "https://images.genius.com/c93362744a33b4196acf0d52520994c4.264x264x1.jpg", "album": null, "title": "F**k Them", "lyrics": "[Hook: Dappy]\nSo know you wanna know\nBut where was you when I was broke?\nNow I see love you've never shown\nSo what you think I'm dating\nOi mum, I swear we made it\n\nAh so fuck them\nThey don't go as hard as me\nWho's been claiming that they're ill?\nFuck them I'm on disease\nI put my money where my mouth is\nThey be lying through teeth\nOh and don't be mistaken, I'll still lick down a pagon\n\nAh so fuck them\nThey don't go as hard as me\nI done raise the bar so high, no satellite can't find me\nThey can keep chasing their dreams until I clap them out their sleep\nPiss- pissed that they're fading\nBun them they've been cremated (Ahh)\n\n\n[Verse 1: Dappy]\nLies, you've been gassing up them hoes with your bullshit\n'Cause you've been pissing on your balls with your small dick\n\"Look I got my willy out (Hey!)\nAnd the camera's on but nothin' can be wrong with that, if that's what harry's on\nTarzan's in the booth big\n[?] my hand\nI ain't showing of my tan\nI'm just letting my shit, hang on\nHalf the size of [?], that's how nighty\nLight-tracy is, time I beat up the game bat, chris breezy did to ree-ree\nThat's just B-A take a nap, B-K-Y\nI'm doing me Gee, them ringtone represents, got no credit come rings around\nAnd breaks one leg in, B-K\nSoft and sweet, I'll piss on their own toilet seat, I shit on them, boy he\nFreaks, they'll never catch me on a sunbave! coz no-one cares about, what\nThe fuck was made in chelsea, the only way is a street, don't care what\nNo-one tells me, started of, one them, two shots, none left, ten man, one\nPen, then turns later, ahah-ahah, BLOAW, ahah-ahah, pussy roll out my\nCarpet, coz it's the 'king of the jungle', just took the piss out of the\nMotor-cheating, took a shit turn into rookie, then wiped his ass\nBid-id-id-R-S, didn't even get time to flush it, coz the fucking thing\nCharted (haha) it's over and finished shut up, u dickheads be quite, I'm\nStuffing my face in and taking pussy, you on a diet, u like to go to gucci\nPick up a hat just to try it, take a picture, post in on twitter then don't\nEven buy it, you cat, u don't hustler, u just listen to nip CD on his strap\nU ever seen who's on the top of ur kick Gee, I got strap once before and u\nCan even ask tinchy Gee, I got them out my shit, BRAP and it wasn't\nOfficialy, you see my chain's linked to my prive, if u take that it come to\nMy life chat, we'll take outside not even my toilet will let shit slide\nLet alone booky manning out whip, don't think they're playing around with\nTheir dickhead, if u see the shape of that clip BOOM, BOOM, suck your mum u\nPrick\nSo know u wanna know\nWhere was u when I was broke, know I see love you've never shown, so what\nYou think I'm dating, I swear we made it, ahh so fuck them, they don't go as\nHard as me\nWho's been training at their AO - fuck them I'm on disease, I put my money\nWhere my mouth is, they be lyring through teeth, oh and don't be mistaken, I\nStall it down a pagon, ahh so fuck them, they don't go as hard as me, I don't\nRaise the bar so high no satalitte can't find me, they can keep chasing\nTheir dreams untill I clap them out their sleep, piss- pissed that they're\nFading, bun them they've been prevated, ahhh. ahah-ahahaaa BLOOMBLAY, I'm\nThe... king of the jungleee, hoooahhh, no-ones fucking with tarzan, so\nFuck theeemmm!", "year": null}], "artist": "Dappy"}