{"songs": [{"lyrics": "[Chorus]\nI just up my fifty, shoot right at his fitted\nBlow his top, I know bitches giving top\nThey wanting drops, they want my spot\nI'm like Foxy, but I'm Asian\nI'm a young doll you can't cop\nOff your head, so come correct\nThese bitches ain't tough, ain't took no shots\n\n[Verse]\nNiggas said I'm getting no bag, I eat my cake, I'm 'bout my guap\nWhen you see me hold your tongue\nThe people's champ like I'm The Rock\nQuit the acting, bitch, never been average\nSee me you panicking, envy huh!\nKeep my semi tucked, ain't no running up\nPull up to a bitch house, knock up on the door\nKick the door down, and pull a bitch out\nI was so conceited, Barbie Doll I got my Glock out\nCurving, goofy niggas want my clout, can't get no hand outs\nDon't try hard, I just stand out\nButter cup, pussy fill him up, he wanna eat me up (Lick me up)\nWe fuck in the truck, my inner freak a lust\nOld niggas, I can't fuck with 'em I got trust issues\nThese hoes, they can't fuck with me, rob a drug dealer\nPop a Xan, hit the running man that thot can't stand a chance\nTook offense, setting all the trends, they hating but been a fan\nYoung bitch, I got more cash then my own dad!\nFuck a problem, I don't beef with that I'm out to get a bag\nI'ma eat my beef like a meat feast\nCuff you, I'm no P-V\nMy life is a movie, my swag is sold in 3D\nNo facing 'em in case I'ma beat that shit\nOpen the safe you can keep them bricks\nPop your mans like a magic trick\nHe ain't blow his stick he ain't about that shit\nThese niggas moving like hoes yeah these bitches ain't count up no rolls\nI stay down, ten on my toes\nTake no shit from you I'm bold\nIn the lead, I'm with the Packers\nWatch the bitches need relaxers\nPrecious girl, but I'm a demon uh!\nSemi automatic tough!\nThrowing them C's\nHop out the B!\nNiggas was hating I got on my feet\nBrother was drilling the heart of a g\nFilling two 30's get hit with a piece\nSpeak on my name, I go off on a bitch!\nDo what you say instead of causing a fit\nMaking 'em sick, making 'em mad\nI was in school rocking Louis the bag\nStick 'em up, glizzy's tucked\nYou get fucked around and shot\nStrippers love me, they busting it\nShe fucked bro 'nem on the spot\nI know bitches who pretty slide in your DM you get got!\nGoofy's thirsty you ain't ready, you won't survive by twenty shots\n\n[Chorus]\nI just up my fifty, shoot right at his fitted\nBlow his top, I know bitches giving top\nThey wanting drops, they want my spot\nI'm like Foxy, but I'm Asian\nI'm a young doll you can't cop\nOff your head, so come correct\nThese bitches ain't tough, ain't took no shots", "album": null, "year": "2017-11-20", "title": "Gummo (Remix)", "image": "https://images.genius.com/0acb936913d283a3488561ceb5b9c078.1000x989x1.jpg"}], "artist": "Asian Da Brat"}