{"songs": [{"title": "I Gotta Find Peace of Mind", "album": "MTV Unplugged 2.0", "year": "2002-05-07", "image": "https://images.genius.com/223n7ezbshqosz0dhiz8hrmkd.500x500x1.jpg", "lyrics": "[Intro]\nI gotta find peace of mind\nI know another cord...\nI gotta find peace of mind\nSee, this what that voice in your head says\nWhen you try to get peace of mind\nI gotta find peace of mind, I gotta find peace of mind\n\n[Hook]\nHe says it's impossible, but I know it's possible\nHe says it's impossible, but I know it's possible\n\n[Verse 1]\nHe says there's no me without him\nPlease help me forget about him\nHe takes all my energy, trapped in my memory\nConstantly holding me, constantly holdin' me\nI need to tell you all, all the pain he's caused, mm-mm-mm-mm\nI need to tell I'm, I'm undone because, mm-mm-mm-mm\n\n[Chorus]\nHe says it's impossible, but I know it's possible\nHe says it's impossible without him, but I know it's possible\n\n[Verse 2]\nTo finally be in love, and know the real meaning of\nA lasting relationship, not based on ownership\nI trust every part of You, 'cause all that I...\nAll that you say you do\nYou love me despite myself, sometimes I fight myself\nI just can't believe that you, would have anything to do\nWith someone so insecure, someone so immature\nOh, you inspire me, to be the higher me\n\n[Verse 3]\nYou make my desire pure, you make my desire pure\nJust tell me what to say, I can't find the words to say\nPlease don't be mad with me, I have no identity\nAll that I've known is gone, all I was building on\nI wanna walk with you, how do I talk to you\n\n[Verse 4]\nTouch my mouth with your hands\nTouch my mouth with your hands\nOh I wanna understand, the meaning of your embrace\nI know now I have to face the temptations of my past\nPlease don't let me disgrace, will my devotion last?\nNow that I know the truth, now that it's no excuse\n\n[Pre-Chorus]\nKeeping me from your love, what was I thinking of?\nHolding me from your love, what was I thinking of?\nYou are my peace of mind, that old me is left behind\nYou are my peace of mind, that old me is left behind\n\n[Chorus]\nHe says it's impossible, but I know it's possible\nHe says it's improbable, but I know it's tangible\nHe says it's not grab-able, but I know it's have-able\n\n[Bridge]\n'Cause anything's possible, oh anything is possible\nPlease come free my mind, please come meet my mind\nCan you see my mind? Oh\nWon't you come free my mind?\nOh, I know it's possible\nAnything, anything, anything, anything, anything, yeah\nAnything, anything, anything, anything, yeah\nAnything, anything, anything, anything, anything, yeah\nOh free! Free, free, free your mind\nFree, free your mind... free, free your mind\nFree, free, free, free your mind\nOh, it's so possible, oh it's so possible\nI'm telling you it's possible, I'm telling you it's possible\nFree, free... free, free... free, free... get free now\nFree, free... free, free, free, free... free, free\n\n[Chorus]\nYou're my peace of mind, that old me is left behind\nYou're my peace of mind, you're my peace of mind\nHe's my peace of mind, he's my peace of mind\nHe's my peace of mind, he's my peace of mind\n\n[Outro]\nWhat a joy it is to be alive\nTo get another chance, yeah\nEveryday's another chance\nTo get it right this time\nEveryday's another chance\nOh what a merciful, merciful, merciful God\nOh what a wonderful, wonderful, wonderful God\n[Repeat till fade]"}], "artist": "Lauryn Hill"}