{"artist": "G-Eazy", "songs": [{"title": "BAD BOY", "album": null, "year": "2018-08-31", "image": "https://images.genius.com/67809804a6f28a23c06c1188687ab71f.500x500x1.jpg", "lyrics": "[Skit]\nThis is L. Penny-Feather, and I am here in the heart of Times Square, New York City, and it is just bitch-assness rampant everywhere I look. Up, down, and all around. I just seen about a dozen people walk by me that just had so much bitch-assness in them, it was ridiculous\n\n[Intro]\nPopcorn and sodas are available by concessions stands outside\nGet your popcorn\nDid this kid, just really do that shit?\nSmoke!\nTalk to this motherfucker right here\nSmoke, smoke, smoke, smoke, smoke\nYeah!\n\n[Verse]\nSomeone might'a lit a fire inside the soul of me\nYour shots just graze me, I'm standing, ain't put a hole in me\nI answer to no one, nobody can get control of me\nMGK please stop trolling me, get over me\nYou wanna be me, you're mad that you're not as big as me\nI'm everywhere, I'm your nightmare, you can't get rid of me\nCall a Uber, turn on the radio, mad you're hearing me\n\"Him & I's\" on, mad you're listening to Halsey sing to me\nCan't fuck with nobody with so much negative energy\nA pillar in this game bruh, I'll be here until infinity\nAsk myself why am I entertaining a mini-me?\nYou're so below my class, you're reaching, you're not offending me\nI headline arenas, and all of my shits go platinum\nYou never seen a plaque and your last shit did thirty thousand\nIt's not a competition, I'd hurt you if I start braggin'\nIrrelevant in culture, no one gives a fuck about him\nYou got both of my numbers, all this time, you never called the boy\nI'm headlining, heard you opening up for Fall Out Boy\nDon't play with my name, you fucker, I said it's not a toy\nDisrespect her again, I'll smack you, I'm not a boy\nOpened up my savage, usually I don't do this shit\nI don't got too much time, let's be honest, and let's get to this shit\nYour last joint was six years ago\nIt's a miracle that Flex found you worth it enough to even hear you flow\nBut I guess you both might have something in common, though\nYou got your spot tooken from you, you're mad about it so\nYeah, that’s why it might sting, but I'm the fucking hive\nBreakfast Club at 105, it's keeping New York's shit alive\nWe did like 30 shows together out in Europe\nYou mugged me, but you never spoke, you never tried to square up\nUntil that night in Finland, I said we got shit to clear up\nYou got sentimental and you almost start to tear up\nYou told me how you fucked with me, and you ain't have no problems\nI said it's all love, whatever happened we forgot it (Fuckin' punk)\nAnd then you flip-floppin' all year, talkin' 'bout me\nYou talked behind my back, this whole time you never called me (Be a man, motherfucker)\nSo why you actin' extra tough? Keep it lit, it’s just a bluff\nWhy's it me and not you that's sittin' ringside next to Puff?\nI ain't want to bring this up, but respect to the OG\nBut don't ever cross the line again, fuck, you don't know me\nHonestly, what's up with you? This behavior is nothing new\nJealous, actin' petty, guess I make you uncomfortable\nBad Boy treats you like a family you're adopted to\nYou're signed to him, tell me why doesn't Puff fuck with you\nNumbers don't lie, I don't either, hear your bullshit through the speaker\nYou are such a fucking joke, I ain't want to do this ether\nYou must hate yourself, I don't understand your issue\nIronic this what's happening the night that Eminem dissed you\nFuck you, bitch"}]}