{"artist": "ILL BILL", "songs": [{"title": "SEPTAGRAM", "lyrics": "[Intro]\n\"Thousands of years before the dawn of civilization, evil magicians fought for supremacy.\"\n\n\"It’s mine! The ultimate power! Power which can convert thought waves into material action! There is nothing I cannot do! Nothing!\"\n\n[Verse 1: ILL Bill]\nAnton LaVey Fu Manchu facial hair\nGoons with the hateful stare\nMove with palatial flare\nYoung Gary Busey but carry an Uzi\nYoung Cosby, hairy pussies and strawberry roofies\nYoung Ozzy, creep in the grass, spray with the milli-chrome\nSki-mask on my face like it’s really cold\nSummertime but my blood like icicles\nPossessed by a demon whose name is undecipherable\nThe tip of every hollow twirl like a football\nShocking to see that half of your head’s what it took off\nI’m like murder with the MAC-11\nThe fire swirling from the barrel like past redemption\nSpaz with the chopper, savage like acid and vodka\nI’m like the Grim Reaper but carry a shotgun\nMet with culties that would go December close\nWhen death approached the end is close\nYet to tote finesse to the freshest rose\nPuffery from an Academy Marina\nSlugs from my niner will make you dance like a ballerina\nLike dust in the wind, like angels in the hellfire\nSilent like a twelve-gauge in the jail riot\nOpposite of Henry Hill, proper, stay quiet\nSpray five, 'Catch A Predator' like Dateline\nCut from the cloth of a lost tribe of gladiators\nRun the microphone or get your fucking hands amputated\n\n[Outro]\n\"After six thousand years the curse has ended! Who summoned my spirits from the depths of time?\"\n\n\"I do! I command your help in overthrowing my enemies!\"\n\n\"Fool! What care I for such as you? Begone, growling dog! Before my destruction I was gathering magical powers for the conquest of the world! I shall yet build an everlasting empire of Black Magic...\"", "image": "https://images.genius.com/228d2ebd2bcc82b1b531ca58db70a36c.600x600x1.jpg", "album": "SEPTAGRAM", "year": "2016-06-10"}]}