{"artist": "Iamsu!", "songs": [{"title": "HollyWeezy", "lyrics": "[Intro]\nUh\nYeah (x2)\nEh\nYeah(x2)\nUh\n(I-I-I-I-AM-SU)\n\n[Verse 1]\nThis here ain't free, this ain't oxygen\nI'm taking all the love I can give\nI'm on some 'I'm right back papa shit'\nWhy you just floppin' shit?\nWe do the opposite\nMy flow is stupid\nMy swagga retarded\nBut bitch I'm  not far from incompetent\nDon't condone violence\nBut if they want problems\nWe want the phone like we parliment\nSomeone tell Weezy to gimme a call\nI'm feelin' like him in 2008\nA whole bunch of haters, I whole bunch of favors\nI feelin' like granus a mile away\nI'm lookin' adversity in her face\nImma drink coffee, all I need is mug\nLike 4 bitch I like you better when you dress down\nShe be acting too satiti when she clean up\nI'm fresh off a tour\nMy granny just died\nI feel like I have got no patience left\nTo walk in my shoes, is to follow a giant\nBut this nigga still takin' baby steps\nThey must not know who they rappin' with\nI'm way too focused an accurate\nI'm on my grind, I'm so Indie\nThat shit be from Indianapolis\nIf theres a will we can make a way\nThat s what the [?] can't take away\nTake her pants off. like she wearing break aways\nAnd we finish off , Mary Jane, paper planes\nHeavy kicking like i'm weraing ackle weights\nDodgoing my exes for o's like i'm writing' plays\nI swear I feel like jhonny cage\nInside my whole mouth like Jhanny dang\nMoney is nothin'. I make a G, eazy\nDo that from the Bay to the Universe\nIn lovewith the money\nI'm all in m y feelings  and bitch i would not get my feelings hurt\nI can;t do nothing probono\nNigga don't like me, it's fuck em\nNo homo\nShit done got crazy i hit the road solo\nI can;t fuck with you, bor, batty boys no more\nWe come from Cali, my girls come from Soho\nLie to me baby, my dick like Pinociho\n89 baby like 5'5's and 44\nSmoking that loud got me so anti-social\nStudy my vocals\nCopy my style\nHow can this rap niggas not be my child?\nI guess we in Bae what they got to do now\nOhh, my grandma is proud of her child\nI be feeling like the man when i roll\nWest coast wanna ht, we can roll too\nNigga hit my twitter like he missin the old Su\nSwallow my pride it was nasty like cold food\nYeah\nLets get it\n\n(I-I-I-I-AM-SU) [x4]", "image": "https://images.genius.com/97a44decbf3592630b071b29f4346184.400x400x1.jpg", "album": "Young California", "year": null}]}