{"songs": [{"title": "Look It’s A Dead Body", "image": "https://images.genius.com/7fd34c05170fbf0f207b4d1804a8232f.600x597x1.jpg", "lyrics": "[Verse 1]\nLeaving Reese's pieces\nMy thesis, bitch give me something to eat with\nA brand new recipe anatomy deep dish\nChop! Cut! Chop! Cut! Anatomy deep dish\n\nI'm so tired of this shit, my life's like\nMy life's like nigga I'm twisted, the nice guy\nAlways getting stiffed it and if this shit don't change\nI'm a get those brains and I'm a get those brains and briskets\nAnd mix it, sick shit started the sickness\nNow bitches and niggas think I'm soft like biscuits\nBut it gets hard like bitches nipples\nMy shit goes hard won't fit in the toilet, won't flush\nNiggas think they fucking with Lynch, nigga don't,  hush\nGot a nigga's guts looking like one's crushing it\nIf your house was a bitch nigga I'd run it up in your stuff\nNiggas think I'm nuts cause I kill and bust nuts\nI'll be off the X not even knowing what's what\nRivals get cut up\nI can't smoke so I'm murdering for fun\nAnd that shit's fucked up\n\n[Hook]\nLook it's a dead body, over here\nBlood all over the place like motor steel\nNiggas ain't fucking with Lynch\nYou know the deal\nI eat 'em when I am done with 'em, nigga\nThat's overkill\nYes sir, yes sir\n\n[Verse 2]\nLeaving resses pieces\nMy thesis, bitch give me something to eat with\nA brand new recipe anatomy deep dish\nChk, chk, cha, anatomy deep dish\n\nI might kill her for nothing while I'm nutting\nAfter they dead I'm fucking, aight\nSpit so nasty my teeth don't look right\nFucking dead bodies at night (fucking dead bodies at night)\nI'm just sick in the head, getting the bread\nMC's getting the blade instead of the lead\nThis time I'm keeping the brain instead of the head\nThis crime is hitting the news instead of the feds\nY'all niggas bust like fags, Adam and Ed\nHave your whole family looking out of a red\nHave the hoes panties drippin', I'm straight Crippin'\nLight blue six four but with the paint still dripping\n24 street block throw it up daily\nStill having abortions nigga\nI don't need babies\nAnd I don't eat babies\nI'm sicker than the rabies\nStill hella mad cause I didn't sign with Shady\nRecords, but I'm strange now, snake and the bat\nNigga, sickest independent on the map, nigga brap nigga\nLook at it like that nigga\nWanna see a dead body? This is where it's at nigga\n\n[Hook]\n\n[Therapist]\nThat's not what you told me\nI read in the paper the other day that you were eating people\nA taking their skin and cooking them\nAnd then devouring them\nThen devouring them...\n\n[Verse 3]\nLeaving Reese's Pieces\nMy thesis, give me something to eat with\nA brand new recipe anatomy deep dish\nChk, chk, deep dish\n\nI know this is different, different\nA lot of people tell me I'm gifted, bitches!\nTired of gettin' cheated, fuck this shit\nIf shit gets worse, I'm a rent me a hearse\nLeave a nigga's balls in his girlfriend's purse\nBad news is you'll never see where he lurks\nIt don't even hurt, waterfall dripping out the skirts\nWhen it comes to rapping I am Captain Kirk\nHigher that the spaceship\nSo I wrote the album\nNiggas try to put me in the middle like Malcolm\nYouTube Sicc teevee, you see the outcome\nLock 'em with a machete and I won't leave 'em without one\n\n[Hook]\n\n[Outro]\nDamn! Even my therapist turning on me, man\nWhat the fuck is going on in this motherfucker\nGod damn it!\nNever tell anybody that you know where a dead body is\nOr you gonna get checked first\nAll the time, it always happens", "year": "2011-04-05", "album": "Coathanga Strangla"}], "artist": "Brotha Lynch Hung"}