{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "Heartless Monster", "lyrics": "[Intro: 50 Cent]\nYo!\nBay Area!\nYou are now rockin'\nWith Big Von\nAnd 50 Cent\n\nYo!\nSouthside. Roll something, smoke something nigga yeah\nI fall off then I bounce back\nI'm incredible, yeah\n\n[Verse 1: 50 Cent]\n6-2 to the O, back to the '62 here we go\nIt's like every time I get on some niggas try to jam me\nI grind, I go hard for my niggas try to jam me\nI'm strapped now movin' round with the swammy\nGot a baby by your baby mama, nigga we family\nNiggas mad at the kid 'cuz I'm caked up\nYeah they want that pinky ring, yeah they want that Jacob\nSleeping Beauty tell me when you gon' wake up\nYou'll never have me hog-tied\nYou'll never have me jake'd up\nI'm holdin'\nMotherfucker I'm strizzapped\nI'm rollin with the mizzack\nI'll lay your ass flizzat\nYou wanna talk? Talk to me\nYou wanna be dead?\nIt's boom bye-bye to a body boy yeah\nI had a dream I was broke, and woke up rich\nIt used to be the other way around, ain't that some shit?\nI had a pistol under my pillow, a pistol next to my kicks\nA pistol on my night stand, a pistol next to my bitch\nI seen bullets on the couch\nI seen bullets by the TV\nWoke up feeling like niggas can't see me\nAsk Em and Dre they'll tell you now I'm on some different shit\n'Cuz i got a different tech, and they got a different clip\nYeah I got money now, every day a different whip\nDifferent bracelet, different trip, shut your fucking lips\nDon't be a rat\nThere's nothing worse than that\n\n[Outro: 50 Cent]\nYeah\nIt's the return of the heartless monster\nI already know what time it is\nAnd you already know what time it is\nI'll shake the motherfucking town up\nNiggas already said, they said \"if 50 can't do numbers, then the numbers can't be done\"\nHuh?\nI should give y'all niggas a whole R&B record\n808's and my hearts broken, motherfuckers\nI'm just a different breed of nigga, huh?\nNiggas is faggots man\nI don't like none of these niggas, man\nCome around, niggas got them rainbow colors on\nY'all niggas confused?\nNiggas from the hood ain't supposed to wear no retro shit\nI'mma tell my little niggas to start kicking your fucking ass\nSee you out there with that funny shit on\n'Look him, he's a faggot, kick him, kick his fucking ass'\n[Laughs]", "year": null}]}