{"artist": "Benzino", "songs": [{"lyrics": "Fam Base\nAll my thugs say\n\n[Verse 1: 2Pac]\nSick, Thicker than most of these tricks\nI got my mind on makin money but you stuck on these fake bitches\nI stay blunted, And never fronted and I doubt if I do\nCause if I did, Then I get beat up by my fuckin crew\nA real nigga, Since you figure that you ready to box\nYou catchin knots from my nigga Freddie Foxxx\nAnd Ahk, You really don't want none from Pac\nCause I'll be strapped wit a Glock\nAnd throw thangs like I'm born to box\nI'll hit this motherfuckin gin then I'll be all in\nHell yeah, Young niggas straight ballin\nAnd everybody wants to see if I'm a g weighin 165\nAnd I'm high 'til I fuckin die\nThug life in this motherfucker catchin wreck\nBig stretch hit me off when I hit the set\nBut now I'm cool cause I'm tipsy and I filla\nNigga tryin to see if I'm a killa\nCmon\n\n[Hook]\nIf my pain don't speak my story, If these words don't speak my soul\nIf my struggle be the legacy, In this world if I let go\nIs it the only thing that's constant is a change that's overdue?\nIf they fault me for my attitude, I'm just tryin to make it through\n\n[Verse 2: Freddie Foxxx]\nIt's Bump Knucks from the underground still full of rage\nRhymes, I write 'em in blood, They spill through the page\nI been on my Lillo Thomas, layin in the cut\nWaitin for feds and snitches to move, Nigga what?\nI'm a smooth nigga but, I'm extra deadly\nI'm 45 minutes of gangster medley's\nI'm a crook, to the heart B, Master the theft\nSteal everything but air, I won't take ya breath\nY'all know, The 3 pound 7 cali revolve\nGot a murder to solve, My heart was involved\nI'm a thug nigga, I still say fuck a label\nFuck wit ray, And nigga you will duck a table\nKrupt mob, My Nigga we bounce from the jake's\nTryin to turn into key's, The ounces we take\nI'm a locman, Diamond, Rhymin godzilla\nWit the calico's cocked, You fuckin wit a killa\n\n[Hook]\n\n[Verse 3: Benzino]\nDon't you ever think for a minute I wasn't comin back\nMakaveli would never be on a Shady track\nHow could you ever insinuate the inprobable?\nThe number 1 rapper alive? How is it possible?\nRunnin through these industry niggas like I was Ray Lewis\nNever scurred to press on the trigger because I been through it\nTryin to keep me from flyin, They gonna let you do it\nOnly thing that kept me from dyin is makin rap music\nTell me what you hidin for, Was it miami on memorial day?\nUp in the all-star in La, Super bowl sunday\nWe up in houston where niggas like the gunplay\nAnd everybody's shootin, I'm a universal hood nigga, Me and Bumpy put it down\nWit Makaveli, These niggas wasn't even around\nWhat's the difference between ya niggas and mine?\nWe was up in the studio wit the realist of all time\n\n[Hook]", "image": "https://images.genius.com/945c7322d9672c48d11afc32d5031058.500x500x1.jpg", "year": null, "title": "Trying to Make it Through", "album": "Arch Nemesis"}]}