{"songs": [{"title": "Ur Fresh!", "image": "https://s3.amazonaws.com/rapgenius/1373228742_42.jpg", "lyrics": "[Verse 1]\n(I've fallen!) In love, and I don't think I wanna get up\nCruisin' through life on a banana peel, don't wanna slip up\nI seen it and that shit sucks! I'd rather a sippy cup\nOver a bottle, she holds the throttle and drives me so nuts\nI mean so crazy, I'm thinkin' this may be love at first sight\nShe picked me up in her ma's truck, let me fuck the first night\nI don't think that was too poor; other girls, I get too bored of\nQuickly, we clicked like we were (?), oh lord\nI'm all about the lick like two broads who just come up\nGot no problem wiping all the cum up\nShe's definitely my number one summer love\nA lot of niggas might put one a-bove\nBut not me, she's perfect as it gets\nThe way she work her hips when I'm hittin', yo, that's the shit\nI be thinking about when I do a song for the ladies\nI picture the way her that back bends like Mercedes\nNo, baby, I'm all good to go\nI'll probably text her when I finish this song and let her know\nLike, \"You know I made a song for you\nYou ain't at home, is you?\nOh yeah? I'll text your phone when I'm on my way, peace.\"\n\n[Verse 2]\nOur conversation requires no concentration\nNo consentations of problems, eyes full of constellations\nFor this moment we waited, and so far, it's what I expected\nYou got the body and good golly, you hotter than Texas\nSo refreshin' the next step is, to see what you own\nI got the lesson, the next test, we takin' it home\nYou know I'm far from a poet, I'm a star and she know it\nSo I told her to treat my dick like my cover and blow it\nThe head game exchanged to the bed frame\nTake a look at us, right on the table, no free cable but we hookin' up\nRemember when I wasn't so fresh? She gave no shits\nAnd now I got her goin' like road trips\nThe whole flip of my traffic of all the baddest chicks\nFrom average, since and the fact I'm packin', my swag's patented\nRavishin', yet rational, whatever you call it\nI bet we all will say it's love but I can see that we fallin'\nIt's all good", "year": "2011-09-30", "album": "All Day DeShay: AM"}], "artist": "Ace Hashimoto"}