{"artist": "Will Smith", "songs": [{"year": null, "lyrics": "[Mary J. Blige]\nWhyyyyyy, whyyyyyy\nWhyyyyyy, whyyyyyy\n\n[Hook: Will Smith - while Mary repeats in background]\nI really wish I could explain it baby\nIt's just the world is kinda crazy baby\nAin't no pretty way to paint it baby\nDon't cry, dry your eyes\n\n[Verse One: Will Smith]\nSeptember 11th I woke up about 7 AM\nWest coast time, french toast and my turkey bacon\nTakin my time awakin, turnin my TV on\nTo my surprise, saw what everybody in the world saw\nMe and my children, images were chillin\nMy son said - daddy were there people in that building?\nA cold sweat, frozen with a lump in my chest\nI heard his question, couldn't bring my lips to say yes to him\nThat night at my son's side, he cried\nAnd prayed for the ones who died in the World Trade\nHis palms to God, seeds of qualms with God\nHe just, kept on pressin me, wanna know why\nThen one week later our bombs were dropped\nWe seein them, on CNN, they just won't stop\nThe infrared, images of brutal attack\nHe said \"Daddy now we killin 'em back,\" right right\n\n[Hook] - repeat 2X + (Mary J. Blige ad lib crooning)\n\n[Interlude: Mary J. Blige]\nSouls are captured (souls are captured)\nDreams are stolen (dreams are stolen)\nHearts are broken (hearts are broken)\nEvil plaguin he rewardin\nHate surrender (hate surrender)\nLove exaulted! (Love exaulted!)\nHOPE ELATED! (HOPE ELATED!)\nNegativity DESTROYED AND..\n\n[Verse Two: Will Smith]\nHonest to God, why is the bomb always gettin the last word\nAnd why, did her uncles have to molest her\nAnd why, did all them cops have to be shootin to kill?\nAnd why, did all them priests have to act so ill?\nTell me why did James Byrd Jr. have to be touched?\nTell my why did Malcolm and Martin depart from us\nTell me why did the sniper make that little boy shoot\nAnd why, is human life always denied for loot?\nTell me WHY did MANDELA have to live in a cage\nWhy did my brother Sterling have to die at that age\nTell me why did Reginald Denny deserve his fate\nAnd why the {bleep} can't love, seem to defeat hate?\nTell me why is it so hard for all the children to eat?\nWhy did 'Pac and Biggie Smalls have to fall in the street?\nTell me why did Jam Master Jay have to go that way?\nPlease, what am I supposed to say my kids when they say\n\n[Hook] - repeat 2X as before\n\n[Verse Three: Will Smith]\nCan't explain it baby life is just really crazy\nI mean if it's world wars or the life of a little baby\nWe got more stores than they got rice under buddha lazy\nYou live four scores and still it be drivin you crazy\nBut for me I try to see the bright side\nSometimes it be like the goodness be tryin to hide\nOr tryin to flee, but it can't, it's deep inside\nSweetie you be the light for others, make 'em believe in God\n\n[Interlude]", "image": "https://images.genius.com/b6862accc0e70d12f7d4a50c2aee85da.1000x1000x1.jpg", "album": "Lost and Found", "title": "Tell Me Why"}]}