{"songs": [{"image": "https://images.genius.com/fbfac38980de59a9b7e86f8ee4ac99df.500x500x1.jpg", "year": null, "title": "Born A Motivator", "album": "Sacramentally Disturbed", "lyrics": "[Intro]\n\nI want to create a system\nThat allows you to succeed in both area: Life and your enterprise\nBy the way which one would you say is more valuable?\nWhich one?\n\"Life\"\nThat's not how most people live the game (Live the game, live the game, live the game, live the game)\n\n[Bridge]\n\n(Fuck niggas\nBitches too\nAll I got is this money\nThis'll do) x7\n\n[Hook]\n\nYeah!\nI was born a motivator\nFamiliar with the paper\n\n(Born a motivator\nFamiliar with the paper\nBorn motivator\nFamiliar with the paper) x3\n\nI was born a motivator\nFamiliar with the paper\n\n[Verse 1]\n\nIf you the jack of all trades you amass to nothing\nStaring at my bread hoping Imma pass you a crumb\nBlocc Star bitch, I'm on some grown man shit\nBy my own drawers, own socks, own socks tricks\nYeah nigga, I'm talking to you again\nClassification: Time to do and forgive again\nYou so broke your dog look at you like 'What you doing, get your own damn stick?\nAnd get off, this is my own damn ditch'\nOnce upon a time I let a nigga spit on a .9\nLet a nigga get a little shine\nBut he wanted more, wanted mine\nWanted to be Raided\nProbably copy my movements like a mime\nWanted success but not grind no stress\nBut won't mind his own goal for sure, he's just buying\nAll the while you're boy called and do what I wanted him to do\nI had a team but they weren't doin what I wanna do\nWhen I (????) that nigga told\nStaying on the line and they put me in the hole\nFeeling like I ain't seen the sun in 68 days\nThought about killin that nigga 68 ways\nBetrayal or loyalty, homie, What's the answer?\nDisgusted, damn cous, You up for transfer\nWhen I (?????) that nigga told\nStaying on the line and they put me in the hole\nDamn, well what do you know?\nI'm on familiar ground\nI know all about the bottom, I can feel the ground\nI can feel the fate\nStay dedicated: Hard work, love, loyalty, and respect\nI know you hated nigga\n\n[Hook] x1.5\n\n[Outro]\n\nOr you could cultivate that sense of wealth, that sense of abundancy here\nThe more you can feel that sense of joy\nThe more easy it's gonna be living for you financially\nCause you're not gonna be in this scared and fearful mode\nNow if that's not enough by itself, ya know, this great sense of abundancy\nIf you use the wrong mechanics, it will be disaster\nBut if I have to have an area to get you started with\nI wanna have emotional and psychological strength\nCause that's gonna carry you through the mechanics of boring or frustrating\nOr when things aren't working out\nYou're emotion, you're psychology is gonna carry you\nIt will get you to keep doing it (Doing it, doing it, doing it, doing it)\n\n[Bridge] x.5"}], "artist": "X-Raided"}