{"artist": "Fat Joe", "songs": [{"year": null, "album": "The Fast and the Furious (Soundtrack)", "image": "https://images.genius.com/7a6ca6b439312b29ef9ca24c73fef85f.220x220x1.jpg", "lyrics": "[Fat Joe]\nUhh, T.S.!\nNone better (Bronx niggas, uhh)\nLife of a hustler (ha-hah, what'chu know about that?)\nYo, yo, yo\nYo the mind of a hustler be trained to count money and lies\nSupplying customers and keepin' peace suspended in time\nPop another thug that's tryin to scream but they dimes\nHoppin all the clubs in town, they don't need to wear shines\nThey got that energy, confident and always aware\nWho's watchin them, bitches on top of them, they don't just be near\nProbably spot poppy and them they robbed last year\nAnd just, nod and stare and show no fear\nCause nine times out of ten this bitch connects this kid to shoot you\nThey too hot so catchin a body's too crucial\nIf you a hustler, I know you relate\nWhether you home base or go out of state\nThis shit is real\nAnd you better recognize when you see 'em, these niggas kill\nA whole 'nother drug dealer keep 'em with steels\nSo be creepin so it's real on the deal, with the F-E-D\nSome of them sleep in six feet cause they skrilled\n\n[Hook: Armageddon]\nFuckin with hustlers - you see us in the clubs\nEverybody wanna be us, wife beaters and flip drugs\nWe them hustlers - a little thug's role model\nWhere the snub full of hollows tryna earn a little power\nHe a hustler - some of us locked for eternity\nGet shot down and murdered in beef or turnin for police\nHustlers - yeah, you know what the sparks done\nYou know where we evolve from, you know when the heart's pump\nHustlin\n\n[Fat Joe - overlapping end of Hook]\nYo, yo, yo, yo, yo\nSee life a style, now it's rappin, how you push packs in large amounts\nAnd never spend a day in life movin them cats about?\nThat's not what crack's about; I cooked it, cut it and lift it\nFrom Brooklyn to one-sixty fifth, I took bricks and flip shit\nClips I sit 'em even whip some women from runnin they lips\nAnd gettin me in the middle of shit with other niggas\nAnd real dealers don't be yappin on the phone\nWhat you think, father born?  Don't be caskets and clothes\nC'mon y'all know niggas slip, speakin a joke\nThere go the dial tone, click, now you steamin with holes\nY'all motherfuckers couldn't fathom what's about to go down\nLike a year from now, when the bears get out\nFrom a ten-year stretch down to air shit out\nMake him a man, show your heart when I tear it out\nThey say hustlin is the key to success, and on that note\nI can feed you niggas for less, I got mad coke\n\n[Hook]\n\n[Fat Joe]\nYeah, it's for all my hustlin niggas\nAll my liquid dime niggas\nAll my niggas flippin bricks out there, yeah\nAll my niggas in the Columbia brother suits\nIn the pourin rain, tryna get your shit on\nSmokin the C.I. in the rain, y'know? (uh-huh)\nCup of noodles in your hand\nIt's you nigga Joey Coco, and I'm a hustler\n\n[Hook]", "title": "Hustlin’"}]}