{"artist": "AZ", "songs": [{"title": "Dead End", "image": "https://images.genius.com/d13f06c0e66f01d56532a90d5f7d2283.300x300x1.jpg", "album": "Undeniable", "lyrics": "[Talking]\nYo wasup?\nYo what what up oh shit aye whats good nigga?\nLook at you nigga you still out here?\nOh I'm chillin man I'm holding the block down baby!\nWord?\nYou know that, that's my style\nNo doubt\nLet me hold something man would you let me hold something man?\nYou wanna hold something?\nYeah let me hold something\nI ain't seen you in five years, you not throwing dirt all on my name and all that\nAww come on! don, come on! so you gonna blow up on me like that? aw man!\nYou don't think I hear nun?\nYeah whatever, whatever\n\n[Chorus]\nEverybody want, everybody need some'll speed hit a bump while the others succeed\nSome'll just breathe 'till they pack up and leave\nSo watch what you do cause that could be you\n\n[Verse:1]\nWhere's everybody when the shells and the shotties tryna sail through your body nobody wanna polly\nEverybody cool when they cruisin in Denali's all crude up and jolly tryna screw all the hotties\nRight they beside when them labels wanna sign me\nSoon as the tsunami everybody got grimy\nCouldn't understand even fan try and try me like, \"Damn you a man this a stand up comedy?\"\nWheres the honory the real you'll promise me it's still dishonesty I feel no harmony\nCan't cope when the cold is near when niggas broke if they soul ain't there\nOr reverse when your man from the dirt get his hands on some work\nEverything seem good start expanding his turf with the dreams from the hood figure family is first 'till you call like you should and the number's no good\nNobody's perfect once you scratch through the surface see life's like a circus and we all serve a purpose\nWhat your worth is? are you worthless ?\nA work-a-holic for yours or on your first bid\nNo joke we was all better broke had to ante up for smoke thats when everybody spoke\nKept it all hood everybody had hope and them boats came afloat everybody had coke\n\n[Talking]\nAyo you remember when the, when the spots was coppin' man we's had cheese lines gettin 30 40 a day?\nNah nah nah, I remember when Demi was out there in Dacata you kna' I mean? way before Larry was poppin' gettin bout 40 or 50 day haha\n\n[Chorus]\nEverybody want, everybody need some'll speed hit a bump while the others succeed\nSome'll just breathe 'till they pack up and leave\nSo watch what you do cause that could be you\n\n[Verse:2]\nNow everybody rap how confusing is that\nConfusing all these dudes like it's cool to get clapped\nBe a fool if you choose but how foolish is that\nWhen the move is to move like you smooth as a mac\nI refuse to get trapped with them boys on my back\nCause that shit gets you hit at the ball with them macs\nNow think about and ask how annoying is that\nNow multiply that by 15 flat\nI rather lean back with 16 stacks and something european with the flip screen flats\nWe all human beings but we get things fast\nSo watch what you do cause that could be you\nSome ain't got a clue others know not to do\nA few souvenirs in some water aqua blue\nSo which one is you? what this shit coming to?\nJust don't be the next one the crew come and view.. atleast no time soon\n\n[Chorus]\nEverybody want, everybody need some'll speed hit a bump while the others succeed\nSome'll just breathe 'till they pack up and leave\nSo watch what you do cause that could be you\nCause that could be you\nCause that could be you\n\n[Talking]\nYeah for all those that ever did it, got away with it, this for ya'll. Hahaa\nIt's life baby. It's two sides to everything.  Up or down, left or right, right or wrong. Don't get it wrong get it right. Hahaha", "year": "2008-04-01"}]}