{"artist": "Fashawn", "songs": [{"year": null, "album": "Boy Meets World", "image": "https://images.genius.com/4eb0769f2fa647dc2e26d40d1390094b.1000x1000x1.jpg", "lyrics": "[Intro]\nThey say everything you go through in life makes life worth living\nBut if the world should end tomorrow...\nI often think about that sometimes, know what I'm saying?\n\n[VERSE 1]\nI'll take the pain and the strife\nI know it's not in vain\nAnd struggle relate to everything in this life\nI'm maintaining became a beam of light for the youth in the streets\nIntertwining with goons never complaining cuz its all written\nDon't be bitter we all sinners\nLusting for the good life, some hearts cold as December\nHiding behind stripes and stars Father forgive um\nEarth out of her mind look what she had to witness\nI talk to her at times she tell me what's on her heart\nI tell her what's on my mind\nMomma where do I start?\nWhy everybody divided?\nWhy people afraid to die?\nShe told me \"talk to ya Father, he's in the sky.\"\n\n[VERSE 2]\nFather why everybody complaining bout what they got?\nUngrateful, they don't see what you gave um?\nMake a lump sum of money start to thinking they made it\nHe said if you pay attention to the weather I'm jaded\nIt could be mid July and I feel like raining\nAny day of the year I shed a tear Poppa amazing\nOne drop could flood the block there's no one greater\nAnd that's why I live in the sky\nNo lie, I'm fly, defy gravity, I reply damn\nIt's like you only show yourself to the wise\nI know why you won't let me come home\nLeft me here on my own cuz I ain't doing my job so you just letting me roam\nHe responded \"correct\" go home to my mom I'm vexed\nShe the reason for my drama and stress, you seem to love her\nRemember though, she the present but I'm forever\nWon't be long till you see us together I replied until than...\n\n[Hook]\nNow if the world should end tomorrow, Lord have mercy on me\nAnd if the sky should fall and the walls come tumbling down, tumbling down\n\nNow if the world should end tomorrow, Lord have mercy on me\nAnd if the sky should fall and the walls come tumbling down, tumbling down\nThen that's what its gonna be\nThen that's what its gonna be", "title": "Father"}]}