{"songs": [{"title": "Twenty-Sixteen", "album": "Good Grades Bad Habits 2", "year": "2016-02-19", "image": "https://images.genius.com/263421f8f18b7666fa75cd578dc7b98a.275x275x1.jpg", "lyrics": "[Intro]\nYa yuh, aye, these niggas must've thought I was a one hit wonder or something, haha, ay\nAye\n\n[Verse]\nShe layed on me like a futon\nI ain't worried 'bout that bitch I got a new one\nStacking money, smoking gas, what are you on?\nAlways been a real nigga, you a fool one\nAll these bitches wanna fuck me 'cause I'm up now\nBought a Sprite, I pour the lean up in my cup now\nI was looking back, I got it out the mud, wow\nYou funny style, boy, you knowing I'm a cash cow\nI just wanna get the top, she can't stay the night\nI went and bought the Bape, I ain't care about the price\nThey see we eating, all we got, they cannot take the slice\nI learned from my life, I don't ever take advice\nI was up with my niggas, steady rolling dice\nWhy these bitches acting funny?\nTell me, is you in it for the money?\nAin't taking nothing from me\nMaking sure my brothers never hungry\nAll about my carrots like a bunny\nShe want it in her tummy\nMama told me wrap up like a mummy\nSmoking Grade-A I'm not no dummy\nI just find it funny\nFriends always changing over money\n2016, I'm that motherfucking nigga you should worry 'bout\nI was riding through the 7, bro tote them Mac-11's\nHe'll squeeze it any second, I'm like, \"Oh, yeah\"\nTell them niggas back up off me now they see my flow is cold\nSo I play 'em like it's hockey, they're like, \"Oh, no\"\nGood grades and bad habits\nNow my niggas living lavish\nMoney turned me to a savage\nI don't give a fuck\nAnd I need that new Mercedes\nThey look at me like I'm crazy\nBut I'm screaming, \"Fuck you, pay me\"\nOn my own shit\nYeah I put that shit in motion\nNiggas hating 'cause I'm loafing\nBetter watch how you approach us\nI am not the one to play with\nEverybody on my dick 'cause I ain't on the same shit\nI just had a different vision, y'all be on that lame shit\nShawty fucking with a winner\nShe just wanna smoke my drugs\nI can't take her out for dinner\nI just gave her bomb D\nCheeks blow like TNT\nIf you ain't in my circle, nigga you a enemy\n2016 I got a lot of goals\nAye, only 17 with a lot of hoes\nAye, asking who you are, boy nobody knows\nAye, I just kept it real, I can never fold\nNigga"}], "artist": "Lil Skies"}