{"songs": [{"lyrics": "[Verse 1 - Jay-Z]\nAy yo I got a resolution\nThis year I'm playing right\nNo 6:15 this year, yeah, you can stay the night\nWe can go bowling, it ain't like before\nCan't y'all see that I'm growing? I was so immature\nI was young and having money\nHaving honeys come to the crib\nDig in their shit\nAnd they couldn't get cab money from me\nSome bad chicks didn't get past the bridge\nI went to 1 Trump Plaza on their asses\nNo room service, just snacks and shit\nWork with those Lil Debbies\nAnd when you're done, get ready\nThe chicks I was fiending to smash\nLet 'em lean on the cash\nWill take 'em on long trips\nBreak 'em with long dick\nThere was no such thing as strong relationships\nBut I'm off that player shit\nI need a chick that practice Tai Chi\nThat still can buy weed\nAnd can give me some good head\nAnd I'll make her a mami\n\n[Hook]\n(Hey papi!)\nEven if they don't understand the flow\nThey understand the dough, my ladies going\n(Hey papi!)\nPromise you'll never let me go\nPromise you'll never leave me\nPromise we'll grow\n\n[Verse 2 - Memphis Bleek]\nThe only thing Bleek spinning is\nThem chrome wheels spinning on them new rims\nHome, suspended from school again\nI'm grown, still ill, ladies love the ve-hi-cle, like \"Bleek\nCan I feel up on your wood and grill?\"\nIt's a hood thing, wood grain, off the chain\nShe give me good brain\nLove the way I push my slang\nCalling my jack soon as they hop in my V\nThey catching contact, weed smoke all up in the weave\nBet your man can't do it like this, like this\nI bet his wrists ain't bluish like this, like this\nAnd I'm from Marcy, you catch me on anybody's block\nReppin' th-the Roc\nHoes, they all clock like:\n\n[Hook]\n\n[Verse 3 - Jay-Z]\nI was the worst, I used to switch chicks every day\nHad niggas mad, for real, like, \"I wish he was gay\"\nCause they knew sooner or later hun was getting with Jay\nJust a matter of time: she was getting with Jay\nI'll have your chick in the summer tropics sipping on 'zae\nSpitting up in the Pacifics, smoking spliffs in the shade\nShe used to love you, but she feeling different today\nYou used to smother her. Look at your honey slipping away\nConsorting with hustlers, niggas that be giving her space\nShe said she feel free when she's around me\nI'm letting her do her and, in turn, she's doing me\nShe on the phone with her friends like, \"How cool is he?\"", "title": "Hey Papi", "image": "https://images.rapgenius.com/32b63c4c06f8204fdbffd62ac0b32a9e.1000x948x1.jpg", "year": "2000-07-11", "album": "Nutty Professor II: The Klumps (Soundtrack)"}], "artist": "JAY-Z"}