{"songs": [{"image": "https://images.genius.com/75a265916a97836aa5ab08c709a44211.1000x1000x1.jpg", "album": "PSYCHODRAMA", "title": "Drama", "lyrics": "[Intro: Dave's elder brother Christopher Omoregie]\nLike man was saying, bruv\nMany nights man prayed, bruv\nSomewhere someone's gonna help me through this, man\nSomeone is gonna help bring me out of this shit, y'know?\nTime, it took a while for man to recognise, boy, who you were gonna send\nAnd you know what? Mans, I'm very proud\nI'm very happy to see it's one of my own init, y'know?\nAnd boy, I know none of this is easy, y'know?\nI'm just proud to be, to be witnessing what's going on, man, y'know?\n\n[Verse: Dave]\nLook\nI don't know where to start\nBut I just done my first psychodrama\nAnd I hope the world hears my craft\nI'm excited man, I pray you get to hear my craft\nFrom our childhood, our mother didn't hear me laugh\nI'm presenting you the future, I don't fear my past\nI ain't got a tattoo anywhere near my arms\nBut best believe on my sleeves is where I wear my heart\nDo you know how easy it is to be a sinner?\nHow many losses you need before you can be a winner?\nReason with a criminal that needs to eat a dinner\nIs it survival of the fittest or is he a killer?\nLosing dad was big, losing you was even bigger\nNever had a father and I needed you to be the figure\nWe're forgetting that we had a brother that was even bigger\nWe were figures just tryna figure out who could be a figure\nMy brothers never spoke to each other when I was growing up\nI remember tryna to build a bridge, I wasn't old enough\nI pray I hold the game for as long as you man can hold a grudge\nYears went by, I know it's fucked\nI had to hold it up for mummy on my own\nI know it's tough, I got the coldest blood\nI remember when you got sentenced and I was throwing up\nIt's like they took a piece of my freedom when I had opened up\nI just lost the only fucking person that I idolised\nFor my entire life I copied you down to the finest line\nBro, I got a flame in my mind I'm trying to firefight\nThe pill I had to swallow wasn't bitter, it was cyanide\nI learn over time, separation issues I describe\nAre probably the reasons that I struggle feeling anything\nI ain't got a vision of a marriage or a wedding ring\nIt's world domination in music or it ain't anything\nI'm obsessed, focused on the objective\nTell a don yes, disagree, I object\nUsed to treat my women like an object\nGirls want a monster come and see I'm the Loch Ness\nSettle for a lot less\nI just hope you're proud of me brother, it's been a long stretch\nYou're my hero and prior to this\nI was living on the edge like a house on a cliff\nBut now I'm living in the present like my house was a gift\nI'm going psycho, this scene's mine bro\nRappers wanna diss me, it's only online though\nThey put the mic and soft in the micro\nSoft? Not I, bro\nSwimming's the only time I can lie though\nAnd lemme be genuine\nAnybody rich my age is American, kicking ball or inherited\nIt only makes sense I'm independent knowing everything it happened how I'm telling it\nYou niggas aren't getting it\nI'm coming from the struggle I survived and I'm still here\nUsed to bump trains that's two ways, I don't feel fear\nI don't know trust, I know a tight bond will tear\nLike a good wig, I can't tell you if it's real here\nI'm from south London, brother, people getting killed here\nYou can make a mill' but you can lose it if you're still here\nI lost over 30 grand to family, I'm still here\nThe word don't appeal to me, you steal from me I'm still here\nBro, I wasn't made for this\nI don't get a break, but I'm aware of what breaking is\nI wish you could take a hint as well as you can take the piss\nI don't even speak to our brother, man, I just pray for him\nIt's never too late for him\nLife is at it's craziest, walls started caving in\nAll the things I've seen would turn a theist, atheist\nI didn't get 99 marks in English, I was faking it\nI got 98 ‘cause I don't know what a vacation is\nIf you saw God what would you say to him?\nIf given the chance would you have taken it?\nIf you could rewind time what would you change in it?\nDo you believe in what an angel is?\nFurthermore, do you believe in what the devil is?\nDo you believe that I can illustrate what Streatham is, then break the fourth​ wall and base Lesley on my relatives?\nI'm grateful for my life because I aimed for this\nEvery bad moment every single fucking day of this\nPeople looking at me, that's what fame can bring\nBut to understand the stairs, you take steps then retrace the shit\nI tell my circle, the future's ours, we're shaping it\nThe past is just the reason I had came to this\nI thank God for the pain because it made me this\n\n[Outro: Dave's elder brother Christopher Omoregie]\nI don't know if you remember those days, bruv\nIn them days, there was one night in particular, bruv\nCame home and for some reason man put on a beat\nWe were just in the front room, freestyling, bar for bar\nI don't even know how old you was these times, bruv\nProbably about, hmm, ten? Ten, nine?\nYeah, man, if I think about it now, think about the transition\nThem days there, you had no bars\nBut to see the stuff you're doing today, proper man, you know I mean that\nThinking man's definitely blessed to see how the whole ting's come together\nFrom times when I think it was 'JKYL+HYD' man, you played man that one there\nMan was thinking, \"Yo, this one here is a banger\", bruv\nI remember when I heard that one live on the airwaves for the first time bruv, we was pumping it\nMan come to my door was like, \"Rah man, that's a bit loud you know?\"\nI'm like, \"Fam, that's my brudda\"\nHe was like, \"Yeah?\"\nAnd you know, on your birthday, man sent you a little card\nAnd it begins\n'Jesse made seven of his sons pass before Samuel, but Samuel said to him, \"The Lord has not chosen these.\"\nSo he asked Jesse, \"Are these all the sons you have?\"\n\"There is still the youngest,\" Jesse answered, \"but he's tending the sheep.\"\nSamuel said, \"Send for him, we will not sit down to eat until he arrives.\"\nSo he sent and had him brought in. He was ruddy, with a fine appearance and handsome features\nAnd then the Lord said, \"Rise and anoint him, he's the one.\"'\nBro, you know what that means?\nSay no more man", "year": "2019-03-08"}], "artist": "Dave"}