{"artist": "Ice-T", "songs": [{"title": "It’s On", "lyrics": "Yo, Ice\nThe organization say they can't stay in business with us any longer\nWhat you gonna do?\n\n[Ice-T]\nWe always knew we were gonna come to this point sooner or later\nWe have absolutely no option but to move forward\nWe'll have to set up our own distribution, manufacturing\nRun a totally indipendent organization and operation\nWe still got our connections in Texas, Miami, New York, Chicago\nDetroit, and soldiers on the street willing to die\nI can't put any cut on the product\nI just can't live like that\nBut from now on if any cops get in our way\n[Gun shots]\n\n[Ice-T]\nTurn up the mic dog, so I can get off\nFind me Charlton Heston and I might cut his head off\nI'm not to be fucked with\nStep in the range of my Gauge and get bucked quick\nNiggas, hoes, I don't know who you are, my friends or foes\nSmile in my face and plot to kill me behind doors\nI got a new attitude, no trust\nGot me in a corner all a nigga can do is bust\nIt may be you\nThere's gonna be a lot of dead before I'm through\nI'm 'bout to break off niggas who play me and dis' me\nTry to switch from side to side like they whip me\nThe damage is done\nSource Magazine, you're the first one\nYou try to dis Chuck, Cube and me\nHow the fuck you pick us 3?\nYou punk motherfuckers ain't shit, you're just a bunch of hoes\nMakin' money off the pros\nAnd when I see I get you in my sights\nI give your ass a story to write\nCause it's on\n\nIt's on\n\n[Hook: Ice-T]\nIt's on motherfucker and you can't turn the shit off\nCatch you in the streets and your ass'll get tossed\nBang! Bang! Bang! Cause it ain't no thang\nTo put in work and watch your head burst\n\n[Ice-T]\nA lot of fans ain't shit\nLet me repeat\nA lot of fans ain't shit\nQuick to flip if our group don't hit\nThey don't make you nothin but a pop ho bitch\nAnd I don't need ya\nI love to bleed ya\nAll I ever wanted was a real nigga's praise\nBut the sad motherfuckin' fact\nIs that ain't that many real motherfuckers these days\nGame knows game I know too many who plays the name\nAnd I can make it in the music or the street game\nI still got hoes that'll work, still got crews that'll hit\nStill roll with an extra clip\nAnd those who think they'll stop me, doubt it\nThose motherfuckers better think about it\nYou'd best to let me rap\nIce back on the streets?\nYou don't want that\nCause I break ill\nAnd you'll really have to Body Count the cops I'll kill, it's on\n\n[Hook: Ice-T]\nIt's on motherfucker and you can't turn the shit off\nCatch you in the streets and your ass'll get tossed\nBang! Bang! Bang! Cause it ain't no thing\nTo put in work and watch your body jerk\nIt's on\n\n[Ice-T]\nIt's on motherfucker you goddamn right\nIt's on, my royalty cheque, yeah, fool, I write my own\nI own my own label put my own shit out\nSo no one tells me what the fuck to talk about\nAnd all the suckas that said I was through\nYou need to wake up to my view\nI'm fallen off\nHa! Ha! That's a joke!\nYou motherfuckers are still unknown and broke\nAnd I'm stankin' rich\nMy fuckin maid lives better than you, bitch\nSo shut your trap\nWhen it comes to this level of game, you don't know jacks\nCIA, FBI, IRS\nTry to flip us out for sweat\nBut they'll never sweat you son\nCause you're broke and you're dumb and you're no threat to no one\nThem fools don't play\nI gotta deal with those motherfuckers every day\nThey'd love to get me behind bars\nThey hawk a nigga like I'm Carlos Escobar\nBut in a way I am\nBeen puttin dope on the street for years and don't give a damn\nSo I'm thinkin about them, friend\nThe real motherfuckin gangstas wanna see me end\nIt's gonna end up in a bloodbath, no doubt\nThat's the only way I'm going out, it's on\n\n[Hook: Ice-T]\nIt's on\nIt's on motherfucker and you can't turn the shit off\nCatch you in the streets and your ass'll get tossed\nBang! Bang! Bang! Cause it ain't no thing\nTo put in work and watch your head burst\nIt's on", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg", "album": "Home Invasion", "year": null}]}