{"artist": "Pitbull", "songs": [{"album": "Money Is Still A Major Issue", "title": "Culo (Remix)", "image": "https://images.genius.com/65cfdfd153412c58e5282748819c7e68.583x583x1.jpg", "lyrics": "Yeah, yeah, yeah, yeah, yeah, let's go\n(Let's go)\nRight about now, we need all the ladies to hit the danceflo'\n(Dominicana)\nIf you got a big ol' booty\n(Cubana, Mexicana)\n\nAnd you like to set that motherfucker, let's go\n(Colombiana)\n(Boricua)\nPitbull, Lil' Jon, hey, hey\n\n¡Ahora que si, esa hevita esta enterita tiene tremendo culo!\n¡Esta tan linda, esta tan rica, tiene tremendo culo!\n¡Qué rica chiquita, pero que importa si tiene tremendo culo!\n¡Hazme el favor y menéate, chica, tienes tremendo culo!\n\nPull up to the club, walk in then I\nPull up to the bar, get drinks then I\nPull up to a broad let her know what it is\nHow it is, why it is, what it is\n(Hey, hey, hey, hey)\n\nI ain't got time for no games\nI'm hopin', mami, that you feel the same\nI got what you need to feel the pain\nHere's my number, call me\nWhen you're up for an even exchange\n\nFeel me, let me see you\nDo that dirty dance, dirty dance\nMami, feel me let me see you touch your toes\nOr shake that thing and talk with your ass\n\nFeel me! All my chicos, all my Jamaicans\n(Put your hands up)\nAll my Haitians\n'Cause they know, I'm a rep'\n'Til the day that they kill me, pull up\n\n¡Esa evita, esta enterita tiene tremendo culo!\n¡Esta tan linda, esta tan rica, tiene tremendo culo!\n¡Qué rica, chiquita, pero que importa si tiene tremendo culo!\n¡Hazme el favor y menéate, chica, tienes tremendo culo!\n\nMami got the ass and thighs like Trina and J. Lo\nMultiply it, she's off the chain off the glass, off the flip\nAnd with a couple more drinks I'll be off the hip, mayn\nI'll be wearin' her out and when I'm finished\nParamedics gon' be carryin' her out, mayn\n(That's right)\n\nThe night is young and if you shave\n(Hey, hey, hey, hey, hey)\nI'll give you some of this mighty tongue, hey\nBe easy, go ahead, please me, talk to me sleezy, baby\n(Yeah)\nI wanna freak, a monster in bed, last thing I need is a lady\n\n¡Esa evita, esta enterita, tiene tremendo culo!\n¡Esta tan linda, esta tan rica, tiene tremendo culo!\n¡Qué rica, chiquita, pero que importa si tiene tremendo culo!\n¡Hazme el favor y menéate, chica, tienes tremendo culo!\n\nCulo, hey, hey, hey, hey shake that shit, hey\nHey, hey, hey, hey shake that shit, hey\nHey, hey, hey, hey shake that shit, hey\nHey, hey, hey, hey shake that shit, hey", "year": null}]}