{"artist": "Pharrell Williams", "songs": [{"album": null, "title": "Mamacita", "image": "https://images.genius.com/aa964e94a21e7b893801ed3a2bd389b8.1000x1000x1.jpg", "lyrics": "[Intro: Pharrell]\nShe want to break it down\nBreak it down, break it down, break it down\nWoah, woah, woah\nShe want some Reggaeton, Reggaeton, Reggaeton, Reggaeton\nWoah, woah, woah, woah\n\n[Hook: Pharrell]\nMamacita, oh my god I think you're on fire\nDo you want me to get you water?\nYou make me want to be your baby father\nCause the dance you do is getting hotter\nI better cuff you before the boys follow\nWhatchu' think? I think you wanna'\nI think you wanna'\nShe wanna' break it down, break it down, break it down, break it down\nWoah, woah, woah\nShe Want Some Reggaeton, Reggaeton, Reggaeton, Reggaeton\nWoah, woah, woah, woah\n\n[Verse 1: Pharrell]\n(Skateboy!)\n\nI've been long overdue\nFor something overdone\nYou've been undertouched, well I can make you overcome\nI know he telling you what he can make you and\nI know he telling you where he can take you\nBy the way ma', hey is that your hair?\nIf it ain't, it took two days in the hair-shop chair\nIm just joking\nI make you smile right?\n\n[Verse 2: Pharrell]\nLook, come here, I mean excuse me baby\nYou dancing fast ma' this ain't Merengue\nBut your butt in search of your volantes\nIt's plump I'm being honest, cause it's just nice\nYou're looking different saying to yourself\n(This no right)\nSure you cute, but you know you won't dismiss this plight\nWhen my chain keep binking like Christmas lights\nGet it right\n\n(Yezzir)\n\n[Hook]\n\n[Verse 3: Daddy Yankee (Spanish/English)]\nYo what's up ma'\nYou may not know Spanish , But you know Daddy Yankee\nSin uso de esteroides\nY tiendas aquí en Miami\nBoxeador latín hustler!\nSomos los dueños de los bizcochos y los suplimos a costo\nYou know mamacita tu si ere' dinamita\nY me la explota si te pones bien perrita\nTen cuidao ! el perro ta ajitao !\nQue aquí estamos [?]\nSacude lo cause your body is on fuego\nLa vida real en mi corazon la llevo ma'\nKeep it going son los matones\nCon los pies en la tierra y la mente en millones\nYankee Y Pharrell dándote la rumba buena\nCon mas sabor que la comida de abuela\n\n[Hook]\n\n[Verse 4: Pharrell]\n(Hey girl!)\n\nLet's go finish at mi casa\nTrust me, it'd be proper\nI got muchos negros on my lache with the choppers\nIf they suspect us, someone trespasa\nAll you hear is BRRRAT and then scream, Cucaracha!\nTrust me, P is no pimp\nSee I got heavy pockets, so I walk with a limp\nOne night with he, and I'll make ya scream\nYou'll wake up, (wake up) like it's a dream\nCall downstairs, tell em to make us P.J.s\nRight after that, dry cycle our P.J.S\nRight after that, book us a P.J\nWhat you mean, how? When you got money, it's easy\nThis ain't dookie, ma, I'm not Green Day\nWake up, you're about to miss your damn dream day\nNow everybody just sing what the screen say\nIt goes\n\n[Hook/Outro]", "year": null}]}