{"artist": "Sky Wikluh", "songs": [{"year": null, "lyrics": "AJMO!\nObrati paznju sad ovamo\nOrtaci ne znaju za 2007\nS vrha brda zaliva\n23 moj hood, ne tvoj p****!\nWikluh sky sine, ljubav za sve brdjane\nHate za sve koji to nisu a misle da jesu\nSlusaj vamo, slusaj to!\n\nHej, burazeru sta ima daj\nReci mi sta ti je sad\nNekad si bio k?o car sada si propala stvar\nIz hooda te odavno znam, klinac bio si drag\nSvima bio si gad i imo si zajeban dar\nSad imas zajeban rad, krnes eksera par, zickas za pljuge i var\nSmeskas se ko neki c***\nReci mi, buraz, ti znas, vredelo da se prodas, neoprezno tako hodas, pa pao dole padas\nOpet stradas i vredelo da se nadas da ces moju bivsu da `rash, brdjanin si bio nas\nJel vredelo, buraz to sve, seres mi i za djale, da seres isto sto i tvoj cale tebi reci mi, hej!\nJos uvek tesko mi je, jer uvek za tebe sve da umrem, ali sada ne, sad je tvoj red da umires\nReci mi buraz dal se isplatilo celo sranje, bez bunde i bez drugara varis jeftino granje, ajmo!\n\nKada najblizi oko tebe pokazuju to, da zele ti zlo, jer su pali na dno\nNajgore bude u tebi al ne pokazuj to jos, cuvaj snagu za sutra jer stize novi spor\nKada najblizi oko tebe pokazuju to, da zele ti zlo, jer su pali na dno\nNe mozes da ukapiras bili ste kao rov ortaci znaju ko je sam, pa sad napustaju brod\n\nHvala burazeru bas, pomog?o si mi da znas\nNe znam kako spavas kada 23 nije tvoj kraj\nJer veliki ovaj mali grad i sve se dozna pa da i sve se prepozna pa da\nLetis u stvari padas, ne mogu verovati vise nikome, sada svi bi hteli da se malo priklone\nBadava ne mogu da frikujem na fakeove, badava ostacu ne menjam se o, ne\nKada likovi se trude da te sjebu onda znaj, kada likovi se cude kako ne mogu to da urade muvaju\nVise vole da si dole govore budale a mene k*** bole\nI sta je sad bilo? Svi bi hteli malo da repuju, ali j***** sto u stvari ne znaju\nStvarno je j***** ali neka vezbaju\nNeki ce misliti dugo da znaju da govore o tome sta se desava\nA neki ce shvatiti ipak na kraju da im glavni i nije ta prestava\nI ti si taj, slinavi mali jadnik to se ne oprasta\nNastifana budala sa raspalom glavom, primi\nPreterano puno pozdrava\nZivo me zanima sta ces sad da radis, sa svojom facom koja bazdi ___\nSvi ti fini drugari, njisi te svi na kari!\n\nRef\n\nOrtaci ne znaju pa seru kojesta, poverenje bez kraja moja je greska\nNapuste brod cim prica postane teska, sta ce ti riba bolje nadji si decka\nOrtaci ne znaju, a misle da znaju, daju sebi za pravo da mnogo laju\nI zna se sta oni svi nadju na kraju, kobaju, koju popuse kralju!!!\n10.05.2010", "image": "https://images.genius.com/ee2904df18d0e9f24a226140c7df893b.600x600x1.jpg", "album": "Ortaci Ne Znaju", "title": "Ajmo"}]}