{"artist": "G Herbo", "songs": [{"title": "Hood Cycle", "album": "Still Swervin", "year": "2019-01-09", "image": "https://images.genius.com/c9afa7b8044e0a1dd4a8eba6baf78768.1000x1000x1.jpg", "lyrics": "[Intro]\nUh\nI call it heart music\nNo, not H-A-R-D, H-E-A-R-T\nHeartfelt shit, you know?\nYeah, um\nYou know, we go through painful shit with painkillers 'cause we soldiers ourselves\n\n[Verse]\nI'm just staring in the palm of my hand\nThinkin, \"Should I pop this Perc?\"\n\"No, it might kill me\"\nIf you got PTSD, you feel me\nDead or in jail, you will be\nWhat the cop told to the little me\nFast-forward time, not literally\nIf I go on tour, I'll make a mill' at least\nMa didn't have much, we didn't really eat\nTherefore, I was always in the streets\nYou didn't hear who hit at me in no tweets\nThat's 'cause it was some real beef\nE'ryday a shootout for four weeks\nFour thirty clips, we four deep\nCan't hug the block 'cause we ride with Glocks\nSo you already know this is real beef\nYeah, since I got rich all these people in my life depend on me\nSo you know I gotta smoke weed\nQuit gangbangin', got more cheese\nI don't know buddy, he know me\nAnd you know we shinin'\nEverybody with me got a Rolly (Uh)\nNigga rich, you know he smashin' (Uh)\nSecurity freak like roadie\nAnd I miss my brodie (Uh)\nSlap stickin' my forty (Uh)\nStill exotic smokin' (Uh)\nGot something that I owed him (Uh)\nSpit hood bibles\nFor niggas that get bumped, sons go pick it up\nThat's the hood cycle (Uh)\nSo I'm tryna go flyin', ain't got no opps\nI don't want no lil' rivals\nThat's the hood cycle\nWhen you ain't got no money\nEverybody in the hood like you\nWhen you start makin' some money\nEverybody in the hood get excited, too\nBut ain't nobody did nothin' for you\nNow they lookin' like, \"Damn, who invited you?\"\nWhen you can't give 'em nothin'\nThat's when they start to feel somethin' (Uh-uh)\nGimme some space, I don't trust nobody\nGon' make me kill somethin'\nAnd they all love me\nDeep at shows when I was this broke nigga\nI ain't seen all of you\nNot a call from you\nMoved out grandma crib\nRight out front used to get in shootouts\nI was just a kid\nShoulda got some money, bought you a house\nAnd now you dead, I regret all the time I spent without\nI was deep in the streets\nJack that kid, tryna ball, who out?\nFoolish things I did\nSorry for how I lived\nMy mama lost without you, she ain't gotta tell me\nI look in her eyes and see it\nWalkin' in my house, my eyes was red\nDemons talkin' inside my head\nGlock was out of lead (Uh)\nSo evidently I had to spread\nWhen God got me out of bed (Uh)\nLet me hop out right on my leg\nOh, I know what you sayin'\nYou must want me to go chase some bread\nNigga, talkin' 'bout what you hear\nI thought you was the man (Was)\nSayin' that ho gave you some head (Blood)\nWhere all that shit in my bed? (Cuz)\nI'm just tryin' to come in the house and fuck\nI don't wanna come in no house and fuss\nGirl, why you gotta get loud and cuss?\nGon' head, pull that blouse all up\nLet me get it from the back or somethin'\nFuck it, gonna put you on the couch, now what? (What?)\nI done fell in love (Uh)\nFor the month\nNow we in the club\nAll these diamonds on\nShe got a fat ass, climbin' the pole\nShe lookin' like a muh'\nJust to walk up in this bitch that gave me some rolls\nWhy don't I throw some money?\nYou gettin' ones back up off the floor\nCharlamagne, you fuckin' donkey\nWhite teacher at school caught me as a flunkie\n'Cause I was a fuckin' junkie\nAnd I admit it, coulda wrecked the whip\nI fell asleep, I'm lucky\nHad I listened to him\n'Coulda fell a victim to the streets, I'm lucky\nNow I ride past in a Bent like, \"You fuckin' honky"}]}