{"songs": [{"image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg", "title": "Foul Breeze", "album": null, "year": null, "lyrics": "[Verse 1]\nAmazing man, got a letter from an Asian fan\nHe asked, \"was I black, was I gon' play Japan soon?\"\nWrote back, \"Yes\" danced in the shower, got dressed\nOld school, powdered my neck\nI give, but I'm selfish\nTattoo of my chick lips on my pelvis\nWell it's the pubic part, excuse me y'all\nI think that I became musical\nWay before rap I did wanna be the tap dance kid\nOn Broadway, 42nd Street, legendary\nThree-card Molly, Nasir drives a Harley now\nFYI, for your info\nInsects splattered on the bike window\nTatted innuendo\nJust last night, don't know where it came from\nGuess it's from a past life\nAm I charismatic enough?\nDoes my charm reach people that could make a change?\nIf I shoot with straight aim at the positive target\nAnd swooed 'em to make a deposit into my account\nWould that be progress?\nI doubt\n\n[Chorus]\nSomething is fishy, something is bothering me\nI just can't figure it out\nSomething right under my tongue, I can't speak it\nCan't spell it, yo it's bugging me out\nSomebody doin' something wrong to somebody I know\nSomehow it's related to me and now I'm frustrated\nCause now I'm focusing too hard\nOn something that's just too plain to see\n\n[Verse 2]\nSavoir faire yeah radiate, conscience clear\nAbout to have a monstrous year\nLive in the spot, yeah, err night, deep\nLadies, get ya harder than termite teeth\nC'est la vie, I'm engaged\nBut the crew came to play, they fly free, check me\nAnd they wrist is froze, like toes on a body in the morgue\nThat was put there by the squad\nLook here, I'm the God on the mic on the track\nLike Arthur Ashe with a tennis rack, tell the DJ, spin it back\n{*beat reverses*}\nYeah, somethin' like that\nUh, it go\nSavoir-faire yeah, radiate, conscience clear\nAbout to have a monstrous year\nLive in the spot, yeah, err night, deep\nLadies, get ya harder than termite teeth\nC'est la vie, I'm engaged\nBut the crew came to play, they fly free, check me\nAnd they wrist is froze, like toes on a body in the morgue\nThey were all put there by the squad\nLook here, I'm the god on the mic on the track\nLike Arthur Ash on the tennis rack, tell the, nah\nEverything I be in\nCreme de la creme from the linen to the gold front rim\nCold stuntin'\nTake a look around, what you found?\nLike Master Ace, tell me the world's a faster place\nHigh school students will slash your face\nAnd these white nigga hoods, I'm talkin'\nComputer rage is real\nGet excited when I'm walkin'\nCause I'm used to dark shades and a limousine tint\nBusiness managers scare me half to death\nWhen they tell me every month what is (?) being spent\n\n[Chorus]\nSomething is fishy, something is bothering me\nI just can't figure it out\nSomething right under my tongue, I can't speak it\nCan't spell it, yo it's bugging me out\nSomebody doin' something wrong to somebody I know\nSomehow it's related to me and now I'm frustrated\nCause now I'm focusing too hard\nOn something that's just too plain to see\n\n[Verse 3]\nI don't like when my girl try to pull a MC Lyte\nJumped out the whip, through the train\nLeave me like D Nice\nThey say we used to resemble each other\nBoth last name Jones so we must be brothers\nMy yearly salary suffers\nCause I hate work, no play make Jack lame\nAnd I rock parts on my head that are hotter than yours\nHot rosado lines, designs your barber can't draw\nPosters of Nas on the barbershop doors\nEntourage, security galore\nWhen was the last time you rode by yourself, superstar?\nGot so much love I shot Cupid in the heart\nI'm awakened by my own screams\nLucifer masturbated in my dreams\nIt means somebody is gonna get fucked in the worst way\nAnd none of y'all hoes touchin' my wordplay\nJanitors and men with eighty mil both feel the same grief\nThe men at work, blue collars of the old men\nShinin' shoes, shoe polish go through the same dramas\nThey wish for a better tomorrow\nI thought only five percenters are conspiracy theorists\nThinkin' what the new world order thing is\nBut everybody does\nThe fear of the planet is contaminatin everybody's blood\nTriliteral, Democratic parties\nAnglo-American military alliance\nStudy at Oxford, scholars, they watchin'\nNASDAQ, Dow Jones, got the world stocks in a shamble\nProcter and Gamble\nToxins demand you understand who plans to jam you\nSome random thoughts by the candlelight in Paris\nAs I struggle to be savvy\n\n[Chorus]\nSomething is fishy, something is bothering me\nI just can't figure it out\nSomething right under my tongue, I can't speak it\nCan't spell it, yo it's bugging me out\nSomebody doin' something wrong to somebody I know\nSomehow it's related to me and now I'm frustrated\nCause now I'm focusing too hard\nOn something that's just too plain to see"}], "artist": "Nas"}