{"songs": [{"image": "https://images.genius.com/f3466cb5e87aee1a64f8be6e3eafe415.851x851x1.jpg", "year": null, "lyrics": "[Ali]\nYo, yo, yo, yo\n\n[Chorus]\nBreathe in (breathe in) breathe out (breathe out)\nDo the chickenhead go on let it out\nBreathe out (breathe out) Breathe in (breathe in)\nPut ya back in and let ya knees bend\nBreathe in (breathe in) breathe out (breathe out)\nDo the monastery go on let it out\nBreathe out (breathe out) Breathe in (breathe in)\nPut ya back out and let ya knees bend\n\n[Verse: Ali]\nSomebody move, nobody get hurt\nThis is official, man, only dance flo' experts\nAnd party animals and me being a rhyme cannibal\nFlamable Hannibal while it's bangin' it's understandable\nNow back to somebody movin' nobody get hurt\nMy intentions on this one is the party wet his shirt\nNow go to work and do the chicken (buh kah)\nDo the chicken, and once you do it's stickin'\nBelieve me dirty it's kickin' through the door\nThrowback Vokal velour\nMatchin' Diadonas, fresh off tour, head to the floor\nTake it round, round, chickenhead breakin' it down\nCreated by my town the monastery is found\nOr the Casino like Reno, I'm that nigga can see low\nCrowd movin' all black, white, la-latino\nThere will be no extra space to waste\nPick up the pace, see your heart rate\nAnd if you start to hyperventilate\n\n[Chorus]\n\n[Verse: Ali]\nRight now, I hope you wit me\nI'm a Wizard like Chris Whitney\nWhen doin' it law breakin' the people gon' come get me\nFirst, ladies put ya drink by ya purse\nFellas tuck in ya shirt and put in belt buckle words\nSayin', ladies get ya dip right and ya hip right\nFellas ya betta find that and get behind that\nThird, you can do it, shaken or stirred\nShow up per word and flap like a bird\nFo, do it some mo', five, make sure it's live\nSix, ladies and fellas here we go now, SWING!\nSeven, laid back like you lookin' for heaven\nLet ya body preach like we in church and need a reverend\nEight, if you made it this far, dirty you straight\nIf not, you better practice and get it fo' it's too late\nNine, is this the time to prepare for the dime?\nTen - start all over again!\n\n[Chorus]\n\n[Verse: Nelly]\nYo, who got that, that fire?\nThat fire, I can't lie-uh\nI need that, that fire\nCause' nothin' else will do (ooh ooh)\nPass me that, that fire\nThat fire, I can't lie-uh\nI'm gon' off, that fire\nCause' nothin' else will do (ooh ooh)\n\n[Ali]\nIt's got that party feel, 'Cris and Bakardi appeal\nFo' real nobody killin', I would, like a naughty will\nLike 'Pac say, I got mine, gotta get yours\nTake it lower than ya did before, control the floor\nYou can be county or city, ugly or pretty\nNo chest the tig ol' bitties, all ages five to fifty\nNow breathe in, breathe out\nIf ya got it goin' then show me what you about\n\n[Chorus]", "title": "Breathe In, Breathe Out", "album": "Bad Company: Music from the Motion Picture"}], "artist": "Ali Jones"}