{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/ff349502ffcbfd8f7bdac9fe013f2b15.600x601x1.jpg", "title": "#UNfollowed.", "year": "2013-01-30", "album": "D.A.I.S.Y. rage", "lyrics": "[Verse 1]\nI didn't wanna do it but I caved and I'm bitter that I blew it\nSo I saved your digits so I hit him up at parties and at raves\nAnd I'm sorry for my art, it's in my heart\nAnd it's based like a God, like a bitch, like a Martian\nAnd I only start shit when I get Bacardi and I'm brave, I mean\nI heartily forgave you for lying but I'm pretty sure I'm dying\nAnd my room is like a grave, and\nI am relating to Aaliyah 'cause you say you're gonna leave her but you ain't\nAnd I've been patiently waiting since the day that you asked\n\"Would your mama would have a problem if we date?\"\n\n[Chorus]\nAnd, so, what then?\nShould I just blubber to my friends and let 'em say \"FUCK MEN!\"\nBy that, they mean you, how rude, fuck them, right?\nSo, what should I expect?\nSo, what then?\nShould I just blubber to my friends and let 'em say \"FUCK MEN!\"\nBy that, they mean you, how rude, fuck them, right?\nSo, what should I expect?\n\n[Verse 2]\nAnd I can tell I'm agitating you with all the badgering I do\nYou're unattached, I kinda knew, but I just\nI wanna let it past and get it through\nHow's he getting all the ass? I know you do\nAnd I'll admit the stalker thing's a pretty bad plan\nBut I'm just a little girl and you're a grown ass man\nSo like, I know how to handle you\nFucking with the kid you say you want to lend your hand to\nBut she's a hottie, I can't even hold a candle\nI could've gave her Twitter to me, could've used her handle\nSaid, \"you're prettier but could you lend your man to me?\"\nAnd evaded a whole scandal\nThis isn't what I planned, you're more demanding that I thought\nAnd I am flakier than dandruff\nI wanna hold your hand and look outlandish together\nAnd just perpetuate propaganda\n\n[Chorus]\nAnd, so, what then?\nShould I just blubber to my friends and let 'em say \"FUCK MEN!\"\nBy that, they mean you, how rude, fuck them, right?\nSo, what should I expect?\nSo, what then?\nShould I just blubber to my friends and let 'em say \"FUCK MEN!\"\nBy that, they mean you, how rude, fuck them, right?\nSo, what should I expect?\n\n[Verse 3]\nI know the stalker thing's a pretty bad plan\nBut I'm just a little girl and I'm your number one fan\nAnd everybody tells me you're a grown ass man but, like\nI know how to handle you\nThe stalker thing, it was a pretty bad plan\nBut I'm just a little girl and I'm your number one fan\nSo, I know how to handle you\nFucking with the kid you say you want to lend your hand to\nMy fans enable me in kissing your butt\nAnd like everybody little kiss is a publicity stunt\nYou say, \"Kitty is you trickin', or what?\"\nI'm unflinching, I'm a stick in the mud\nAll I can talk about is rhymes, though\n'Cause what else is there to say when we're sleepin' in different time zones?\nFucking tour from California, Vermont\nAnd like \"ooh ooh ooh, you're the one that I want\"\nWe talk a little, but eventually stop, so\nYou're the one that I want\nWhy the fuck are you the one that I want?"}]}