{"songs": [{"title": "Police", "album": "Bred 2 Die Born 2 Live", "year": null, "image": "https://images.genius.com/0ec27b6023fdef052011e493255845b9.900x900x1.jpg", "lyrics": "[Chorus:]\nEy ey Mr. Police is you hearin me you can do yo J-O-B witout fuckin touchin me. Ey ey Mr. Police is you hearin me you ain't shit witout cha badge get da fuck roun me. Repeat 2x\nThis lil piggy ran home, and that lil piggy ran home. And this lil piggy ran home, and that lil piggy ran home. [x2]\n\n[Verse 1:]\nEverybody wan kno what happened in Orlando, we had a confirmation but they ain't wan let it go. Tryna push me, ol bitch ass police, actin hard wit a suit but a badge can't fool me. C'mon dawg dont take ya job dis serious. A gun will kill any fuckin cat dats curious. Its a lot of hard heads in tha streets dats furious. Ain't nuthin u can tell me, ain't nuthin u can do to us. Wit cha chest all out tryna be bad, nigga I can tell you broke cuz u took my cash. One sight of abuse and ima whip yo ass. C'mon man why you tryna rag? Dont wanna let a nigga off tha hook, wanna go by da book. Wen we both kno in our eyes you da biggest crook. Stop actin you kno you on tha powder. Punk ass prolly sniff da dope by da fuckin hour\n\n[Chorus:]\nEy ey Mr. Police is you hearin me you can do yo J-O-B witout fuckin touchin me. Ey ey Mr. Police is you hearin me you ain't shit witout cha badge get da fuck roun me. Repeat 2x\nThis lil piggy ran home, and that lil piggy ran home. And this lil piggy ran home, and that lil piggy ran home. [x2]\n\n[Verse 2:]\nPolice dont love me, they tryna cuff me. Somebody do somethin I ain't even get nuthin. They came in rushin, I start to bustin. Wit my back to da wall I can see wuts comin. Stead of handlin da shit they wanna handle tha shit. Tha feds outside of my door tryna take a pic. And some of em cool and some of em rude but I feel er'one of em my attitude. And I hope they do wut they gotta do. Cuz if they pull tha heat ima pull tha tube. And if it ain't in ya heart boy dont be no fool, cuz God still lookin at chu. Cuz on earth lot of fuckin chiefs no indians. They say some of da police fag and feminine. If you call for help you prolly snitch on ya self. Do tha ??? niggas catch a fuckin gun from tha belt\n\n[Chorus:]\nEy ey Mr. Police is you hearin me you can do yo J-O-B witout fuckin touchin me. Ey ey Mr. Police is you hearin me you ain't shit witout cha badge get da fuck roun me. Repeat 2x\nThis lil piggy ran home, and that lil piggy ran home. And this lil piggy ran home, and that lil piggy ran home. [x2]"}], "artist": "Lil Scrappy"}