{"songs": [{"image": "https://images.genius.com/0c18a75acfcf19165852eabf1a1fe910.1000x1000x1.jpg", "title": "That’s Alright", "album": "I’m Free - EP", "year": "2012-05-01", "lyrics": "[Verse 1]\nMaybe you and me could take a trip to the sky\nFeels like I'm already there when I look in your eyes\nAy, listen, baby, I was thinkin' maybe\nWe could take a trip and go around the world\nWouldn't really matter where we at as long as you're my girl\nSome say I'm crazy, but that don't faze me\nYou remind me of the sunshine when it's rainin'\nEven if it's for a minute, I forget where my pain is\nAnd that's for real, that's the way I feel\nGot me feelin' so good every time you laugh\nI wonder how we got here, how did this happen\nI don't care, and baby girl I swear\n\n[Chorus]\nBaby, you and me are like the stars in the sky\nSometimes we look dim, sometimes we look bright\nAnd that's okay, yeah\nAnd that's okay, yeah\nAnd baby, you and me are like the rain in the clouds\nSometimes we stay up, sometimes we fall down\nAnd that's alright, yeah\nAnd that's alright, yeah\n\n[Verse 2]\nBut baby, hold up, I just gotta notice\nYou look kinda mad, was it something that I said?\n'Cause you know I didn't mean it\nYeah, you know I didn't mean it\nYou look kinda upset, was it something I did?\nIf I had the chance then I would take it all back\nBut I don't\nBut I don't\nI don't wanna sound like I think I'm perfect\n'Cause that's not me\nYeah, that's not me\nI don't wanna act like I'm that kinda person\nWhy can't you see?\nWhy can't you see, yeah?\n\n[Chorus]\nBaby, you and me are like the stars in the sky\nSometimes we look dim, sometimes we look bright\nAnd that's okay, yeah\nAnd that's okay, yeah\nAnd baby, you and me are like the rain in the clouds\nSometimes we stay up, sometimes we fall down\nAnd that's alright, yeah\nAnd that's alright, yeah\n\n[Verse 3]\nI don't wanna sound like I'm jokin', yo\n'Cause the point I'm at is emotional\nLook at me go, talkin' about the pain I feel and the way, I don't\nWanna see you walk out that door\nCan imagine not seeing you no more\nBut I guess I'm just gonna have to get used to it and just learn to cope\nI don't know which way we're supposed to go\nLookin' for the pieces of our hearts, it's obvious we're broke\nI'm so sick of the overload that's holdin' on them roll and go\nMaybe we should turn around if we forget we ever--No\nThat would defeat the purpose, now wouldn't it?\nAnd this relationship isn't how I envisioned it\nThis ain't how I pictured it, but I don't care\n'Cause even when you're gone, it's like you're still here\nSo, I don't wanna hear about how this ain't workin'\nAnd this relationship don't have no purpose\nAnd maybe tomorrow we ain't gon' be feelin' the same\nThat's okay, as long as you know how I'm feelin' today\n\n[Chorus]\nBaby, you and me are like the stars in the sky\nSometimes we look dim, sometimes we look bright\nAnd that's okay, yeah\nAnd that's okay, yeah\nAnd baby, you and me are like the rain in the clouds\nSometimes we stay up, sometimes we fall down\nAnd that's alright, yeah\nAnd that's alright, yeah"}], "artist": "NF"}