{"songs": [{"title": "24 - 23", "lyrics": "Oh this shit right here nigga\nThis Thug Motivation-103\nI'mma tell these niggas what I'm doing:\n\n[Hook:]\nSee I'm sitting here chilling with this Roley on my arm\nWhat I paid for it, should've came with an alarm\nYeah I'm tryna fuck, baby don't be alarmed\nSee I used to pay Kobe, but now I pay Lebron\nKobe, Lebron, Kobe, Lebron\nYeah I used to pay Kobe until I paid Lebron\nKobe, Lebron, Kobe, Lebron\n24, 23 - y'all niggas remember me\n\n[Verse 1]\nY'all niggas remember who?\nSummer of 02'\nCame doing that white thang\nThey ain't know what to do\nThey ain't know what to think\nI ain't know how to feel\nAnd I ain't even have a deal then dog let's keep it real\nAnd while we at it nigga let's just keep it trill\nStill the realest nigga in it homie how you feel?\nI said I'm feeling like a million bucks\nMake me go to Footlocker and buy about a million chucks\nUh oh! They say the club is off the chain\nI'm on my Louis shit, fuck some Gucci, mane\nThese niggas still on my dick\nThey like some groupies mane\nCan't keep they lips closed\nThey worse than coochies mane\nAnd that fruity looking stupid like some Coogi, mane\nLet you trick me out these streets\nYou must be stupid mane\nTell him this ain't what he want, not the boy Snow\nBut between me and you I think the boy slow\n\n[Hook]\n\n[Verse 2]\nY'all niggas remember that money before rap\nNiggas round my way call me Mr. Penny and a Sac\nThem Boyz N Da Hood they call a nigga Mr. Bring It Back\nMr. Go and Get It anywhere you know I keep a map\nThey say it's going down tonight I hope I make it back\nHe say he reeing up now you know I'm loving that\nShe say it's going down tonight you know I'm fucking that\nAnd ain't no sense in searching me, you know I'm fucking strapped\nUh Oh! They say the club is off the chain\nStraight shots to the head fuck some Juice mane\nAsk the real niggas in the city who got the Juice, mane\nThese niggas talking bout they work but where they proof mane\nY'all know these niggas clowns and I'm the truth mane\nIf this is what your going for then what's the use mane\nTell em this ain't what they want not the boy snow\nBut between me and you I think them boys slow\n\n[Hook]\n\n[Verse 3]\nY'all niggas remember when I used to get it in\nV.P. West Inn\nPull up with a light tent\nFall up in the spot\nBlow about a light 10\nAll that and I'm light-skinned\nCouple hundred carats and all that's on my skin\nYou niggas get the picture of what I've written den\nPardon me, Feds takin snap shots\nAin't been there 30 minutes spent the half block\nUh oh! The club is still off the chain\nDon't stop there! \"Where the after party, mane?\"\n\"Jizzle, who you tryna invite?\" Everybody, mane!\nThis is my summer and I'm killing everybody mane\nSo I'm a be out in every hood\nHollering at everybody\nAnd I'm a be in every spot nigga and every party\nSee this is what they want yeah that boy snow\nBut between me and you I think them hoes slow", "album": null, "year": null, "image": "https://images.genius.com/3cfc7d8b148531d9f31298153302cbf6.415x415x1.jpg"}], "artist": "Jeezy"}