{"artist": "Wale", "songs": [{"title": "3 Days 3 Hours", "year": "2018-09-14", "lyrics": "[Chorus: Tevin Campbell]\nCan't be without you, baby\nNot even for a night\nAnd so I've been thinking lately\nOf being with you for all time\n\n[Verse 1]\nMmm, it's 4:30 in Eastern time where I'm at, shorty\nIn the A.M., I'm sayin' though, where you at, shorty?\nI'm happy without you but got my doubts, shorty\nLike, like if my currency dry out, would you be out thirsty?\nWould your mind want me, like your soul want me?\nWhen I go down on you, I drown for quarter centuries\nYou a whole globe, you a whole earth\nAnd I'm a troubled millionaire that fears you know your worth\nAbsence makes the heart grow, fonder so we ponder\nOn the things we gon' do, when distance ain't a problem\nOur intentions, they was honest, we was cordial, we was talkin'\nWe was hidin', there was no one, we was lyin', it was fuckin'\nForeplay with your body divided now\nIt's forehead kisses before my flight departed, that\nShowed me the feelings, 'bout to play with that\nThree days away, three hours back, hold on\n\n[Chorus: Wale, Tevin Campbell & Crowd]\nCan't be without you, baby\nNot even for a night\n(Wale! Wale! Wale! Wale! Wale! Wale! Wale! Wale!)\nAnd so I've been thinking lately\nI don't got no voice, who got my phone?\nWho got my phone? You got my phone?\nOf being with you for all time\nMm, she called me? Hold on now\nYou have reach the voicemail box\nHol' up, mm\n\n[Verse 2]\nJust got off the stage, know you sleepin', but wait, look\nJust lost my voice for this crowd I only seen your face in\nEverywhere but these women real as a fairy tale\nCan barely talk but you hit my line, I'ma hear you well\nI need that vibe from you 'cause spendin' time on this bus\nTake the power from my brain, in 'tween your thighs they should rest\nWe alive, we in love, we can die if we don't\nIf monogamy you want then share your time with Pornhub (ha!)\nI'm just playin', just need you, know I'm lonely\nGreen Tea, Ricola and Honey Gold\nWe missin' each other more so we horny or don't speak\nThree hours apart, cool, two days and you seein' me\nMy vocals is now shot, call up doctor, steroid me\nCortisone 'til my quarter zone is back as your toy please\nI know you don't need nothin' but what I got\nTwo days away, three hours back, goodnight\n\n[Chorus: Wale & Tevin Campbell]\nCan't be without you, baby\nWe one tomorrow away from celebratin' that\nThat very tomorrow's the day\nNot even for a night\nI know it's late but I'ma hit you later\nAnd so I been thinking lately\nOf being with you for all time\n\n[Outro]\nI'm on the way, you know\nOnce you know my voice back\nCause see like 100 forevers plus a day\nSince I last seen the livin' embodiment of my forever face to face\nAnd I might just inject your body with knowledge\nYour body with style, you'll be flyer than Rox Brown\nOkay, I'm lyin', nobody flyin' than Rox\nBut I might just get in a half squat position\nAnd proposition you with a shiny rock under an open box\nSo the onlookers can understand that we all official\nWe all just kids lookin' for the first love we ever injected\nSo whenever I'm never next to you\nI never look to the next woman even on her best moment to bestowed\nA stove you kept warm for me, as I kept distance, you kept cookin'\nSugar, we went from three days and three hours\n'til we two days and three hours to, \"Girl he think he Darius Lovehall\nHe walkin' down the street writin' poetry\nTo make the between yo' knees feel like you need balance\"\nAnd I see you alot but I see you on camera\nSo it seem like a lie when I say I need to see us together\nFrom three days to two days, from two days to today\nFrom today to tonight, from tonight to forever\nI'm up the street", "album": "Free Lunch", "image": "https://images.genius.com/702c0a054929730ee1cf6d9ad60fbd7f.1000x1000x1.jpg"}]}