{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/3067c302983abed2fb91504570362e92.640x640x1.jpg", "title": "Feel Good", "year": "2009-10-24", "album": "The Cleveland Show", "lyrics": "Bitch I feel good\nDon't I look stupendous?\nMy shine is so endless\nAin't shit you can do to end this\nEven when I'm dead niggas still gon' bump that Chip shit\nCoke white escalade on sixes for you dipshits\nSo we won't forget this, Midwest nigga be the coldest\nCleveland is the city where you hustle or you hopeless\nAnd my closet's like a store bitch\nOnly difference is you ain't gon' find this in no store bitch\nI'm fresher than your whole clique\nG Shock over D.C. grinding every time you see me\nThat Louis Vuitton complete me\nNow R.I.P. to ant while I'm out here stunting with Keke\nI be ridin' super tint\nI'm a ghost you never see me\nCause I'm up above, I'm in the clouds, I'm rolling up, I'm looking down\nChip in the house, y'all stop ya breathin\nI'm a superhero, like Hancock to Cleveland (nigga)\n\nChorus:\nHell yea, that nigga shine all the time but look at him you can tell he from the hood\nBitch, I feel good\nHold up, roll up, we just smoked 4 blunts and I'm feelin like I should\nBitch, I feel good\nNigga where the liquor? Where the cups? Where the ladies, where the sluts? I'm drunk, what\nBitch, I feel good\nAnd I'mma stay a fresh, fly nigga doing everything you would if you could\nBitch, I feel good\n\nDon't I look tremendous?\nDamn I feel so splendid\nI walk up in yo shindig\nHigher than the ozone, damn I can float home\nJust call me when you want some\nI'm out here by my lonesome\nPack a Bape jacket for the winter Polo v-neck for the summer\nI'm a young hood boss, I do what I wanna\nIf you tryna fuck with me then you better have some commas\nI be with them OG's, I'm probably stuntin' with yo fathaaa\nProblem is you don't want it, nada\nMy nigga's got hella choppas, you gonna need hella doctaaas\nAnd I rep my city proper\nProbably catch me rockin' Prada, hoppin off a helicoptaaa\nIn the skizigh, CuDi hand me ya shizit\nNigga we gettin hizzigh\nUh, looking for izzigh, yeah here I go\nThe nigga who get your income tax every show (let's go)\n\nChorus"}]}