{"artist": "Yung Joc", "songs": [{"album": "New Joc City", "image": "https://images.genius.com/c8d5a7e86b7ff9f7536f527abd4fc252.500x499x1.jpg", "year": null, "lyrics": "[Movie announcer]\nNow showing\nNew Joc City, starring Yung Joc, A-T-L's most wanted\nIn an action packed movie about gunfights\nGrinding, the ol' trap, and most of all, getting money\n\n[Yung Joc]\nOh you already know what it is folk\nHey folk, y'all niggas watch out, dope boy's comin\n\nLet me paint a picture, here's the backdrop\nNiggas on the block with a sock full of rocks\nMy intuition tells me, here come the cops\nFirst nigga run, last nigga get knocked\nA couple hours later when it's time to get funded\nTen percent of food stamps cost you fo' hundred\nI had to use a alias cause I'm a most wanted\nNow I'm back in the Chevy on the pedal and I'm runnin\n\n[Announcer] New Joc City!\n[Dispatcher] 210, we have a visual on the subject\n[The police] Roger that\n(Five-oh nigga!) Nigga I see 'em that's five-oh nigga\n(Oh shit!) Nigga that's five-oh (Run nigga!)\n\n[Yung Joc]\nNow I gotta switch up cause my trap on fire\nIt's hot like the thermostat was set on high\nI need another spot just to stash those pies\nI'mma juice the first down ho that rode by\nI'mma tell ya like this, watch yourself bruh\nThe first time she get wrong it time to check her\nEven though she lick me from my balls to my neck up\nI gotta watch myself cause this could be a set up\n\n[Announcer] The saga continues\n{*loud knocking on door*}\n[Yung Joc] Baby see who the fuck who it is\n[The broad] I don't know!\n[Yung Joc] You got, you got somebody comin over here?\n[The broad] Nah, I mean, you know nobody comin this late\n[Yung Joc] Man, who the fuck is that man\n[Yung Joc] Them motherfuckers actin\n{*glass breaking*}\n[Yung Joc] like they tryin to get in though man - OH SHIT!\n\n[Yung Joc]\nThat's when the do' swang open like WHAM\nNiggas pointin choppers at me like Uncle Sam\nThankin to myself \"What the fuck, God damn\"\nI sho' hop to God that this nigga chopper jam\nI'm lookin at him crazy, I don't know what to tell him\nHe put the chopper to the back of my cerebellum\nI tell him, the block's in that box on the flo'\nBut if you touch that bitch the whole house gon' explode\n\n[Announcer] New Joc City!\n[Computer] 10 seconds 'til detenation\nTen, nine, eight, seven, six, five, four, three, two, goodbye\n{*kaboom*}\n[Announcer] This has been another Bad Boy South\n[Announcer] Block Entertainment production\n[Announcer] Now showing in your local fucking hood", "title": "New Joc City (Intro)"}]}