{"artist": "Peewee Longway", "songs": [{"album": "The Blue M&M Vol 2 King Size", "title": "Other Side", "image": "https://images.genius.com/d13b6c12bea37a9c4ed83616d4c890a6.500x500x1.jpg", "lyrics": "Aye!\n[Chorus]:\nI'm from the project, yeah we trap and make a million\nI'm from the project, it ain't nothin but drug dealing\nI'm from the project, every night gon be some killing\nI'm from the project, Fuck a bitch behind the building\nAye!\nYeah that other side\nDon't fuck with that other side\nI come from the other side\nYeah that other side\nDon't fuck with that other side\nI come from the other side\nI fuck with them gudda guys\nThey come from that other side\n\n[Hook]:\nI fuck with them gudda guys they come from the other side\nI'm one of them gudda guys\nI come from the other side\n\n[Verse 1]:\nI'm from the project where they really be killing\nPulling that bitch, that ain't nothin' but sadity\nYoung nigga trap and rubberband bundles\nHundred round drum on my gun that's Osama\nYou hear that bitch, Ka Ka Ka by your window\nIn The Summertime you hug up under your momma\nI hit the projects and run up a check\nAudemars wrist, thats a stupid Breguet\nI got a bitch on a bitch having sex\nAye, I am a Cali connect\nUhh I make your bitch get wet\nAye, turn up that bitch for a check\n\n[Chorus]:\n\n[Verse 2]:\nJump out serve the bricks in them trenches\nJuggin pounds of bricks, fuck a credential\nOne way in this bitch, how you gon' enter\nTry that sneaky shit yeah we gon' kill em\nThe bricks like the zoo full of gorillas\nDope dealers and trap-ing that thriller\nGambino Brick stomps in the middle\nCouple of bitches gon' trap for that nigga\nNo strap no trap she put Mac's on the nigga\nYeah that other side, murder capital nigga\nWe front you a pack if you packing lil nigga\nGot bodies and Benjamin's, stack it up\nUPS, FEDEX truck back em up\nYou can come to the hood and get a sack of dust\nThat got neighborhood watch, watching out for us\nTrap the Habitat Housing, we tear 'em up\n(Longway Bitch!)\n\n[Chorus]:", "year": "2015-02-01"}]}