{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/643d9675eedcaa5319fa306772e6375b.479x479x1.jpg", "title": "Exotische Kunst (New God Flow Freestyle)", "year": "2013-02-07", "album": "63", "lyrics": "Bieber\nSerena Williams\nBieber\n\nKool baby, vision game crazy\nThe light Jay-Z, nah the light Ye maybe\nNah wait, the white Drake nah jokes\nThe brown broke Rozay, no way\nProbably more along the lines of young Jose\nCanseco\nPero mas Mac Dre though\nSlave name Victor Vazquez\nAsk this kid no questions, I'll tell you no answers\nPour a little out for the souls of the dads of the pretty ho dancers\nClimbing ladders and MC Hammers\nKool A.D. sprinkle me\nMoves like Jagger\nSmooth like criminal\nFools think they rude subliminal\nNot even in the mood to deal with you\nDude I think I'm true spiritual\nNegro, blanco, zebra macho\nBald, chemo\nCheap street fighter like Blanka\nYa'll a bunch of toys - Tonka\nShit stains, manchas\nListen to my mantra\nListen to your poppa and your momma\nBut wait wait yo\nAlso listen to your karma\nListen to your sister and your brother and your cousin and your other fam\nAnd to me - the other man\nI Zimbra, I'm just trying to live bruh\n\n(Have a good time with G-O-D)\nNot even trying to win bruh\nIf I was trying I'd of been bruh\nLet me say it again - I Zimbra\nA soft soul but still rugged as a timb\nPlus I'm dunking on these fools and they can't even touch the rim\nDude you buggin if you think you touching Kool, you ain't fuckin with him\nAnd I don't even play basketball\nPlus it wasn't really in the plan to even rap at all\nI was trying to be a novelist\nBut who fuckin reads books? Be honest\nA lot of knowledge from college is a mirage, you need to see beyond it\nThis track is like a mattress in the hood and ya'll sleeping on it\nModern day Shakespeare, peep the sonnets\nPeep how I hook the little seeds on ebonics\nMy phonics is sonic - half pyrite, half onyx\nYa'll full of shit like colonics\nHow did these times come upon us?\nAnd what's beyond this?\nLook upon your life with fondness, I think it would be a pretty good idea\n\n(Have a good time with G-O-D)\nAttention lame artists!\nLook my invention game flawless - Thomas\nEdison, couldn't con this\nEllison, couldn't see this\nWilde asleep, couldn't dream this\nSee me eating venison in Switzerland\nPlease believe and understand and feel this realness\nTry this eel from the sea, a Japanese man cut it with a knife\nDo you love it? It's nice\nDo you love your fuckin life?\nSee me buzz up above the strife\nPlus I know my flow is foolish\n17 and Martin King, yeah let's do this\nAnd all that, I'm a dog ya'll cats and mallrats\nAnd I don't even rap about gats and all that\nWhat you want to call that? Fall back\nYa'll flat - like small racks\nMe I'm rack city, rap city bohemian\nItty bitty titty committee want to breed me in\nDon't even recall how many demons I put semen in\nBut every devil is a fallen angel\nSo the saying goes\nPunchlines, power moves I'm playing those\nRace cards, trading those, race car\nNascar, fast car, crack of dawn\nGazing at the last star\n\nAbstract, abstract\n\nMulatto Franz Kafka\nYou couldn't see me believe me I'm Jimmy Hoffa\nShouting out freeze to the officer like, nah\nYou under arrest though!\nFill all the prisons with cops and let the rest go\nLook at all the children in the Costco\nKool A.D. the new god flow\nPablo Picasso, I'm an asshole\n\nAbstract, abstract"}]}