{"artist": "Yung Gravy", "songs": [{"album": "Snow Cougar", "image": "https://images.genius.com/184619d553ff53a371f24ccb0c0d2f22.500x500x1.jpg", "year": "2016-09-09", "lyrics": "[Introduction: Yung Gravy and The Chordettes]\n(Bum bum bum bum bum bum bum bum bum bum bum bum bum)\nGravy\n(Bum bum bum bum bum bum bum bum bum bum bum bum bum)\nMr. Sandman bring me a dream (bum bum bum bum)\nMake him the cutest that I’ve ever seen (bum bum bum bum)\nGive him two lips like roses and clover (bum bum bum bum)\nThen tell him that his lonesome nights are over\n\n[Verse 1]\nGravy make it splash like Pippen\nShit that’s nothin’ (splash)\nErrbody call me Big Pimpin’\nNo, I ain’t bluffin\nI'm with your mom in the kitchen\nMakin’ blueberry muffins\nMust be Thanksgiving\nCuz your bitch want the stuffing\n\n[Hook]\nMr. Clean\nGravy why your flow so mean?\nMr. Clean\nPull up with my whole damn team\nMr. Clean\nMr. Clean\nMr. Clean\nMr. Clean\n\n[Verse 2]\nGravy, he be clean like Windex (wooh)\nJust hit your mom with my index (wooh)\nAnd yo bitch look like a pinhead\nAll my haters, they be skinheads\nPissed off cuz they wife is they sister\nAnd Yung Gravy just kissed her (hot damn)\nPull up on the scene\nCause a wet dream I might need a submarine\nIf you got the beef I turn yo ass to smitherines (uh)\nYo bitch looking scary I thought it was Halloween\nGravy, he be clean like some fucking Listerine (uh)\nBut I smooth it out like a jar of Vaseline\nShit\nPosted with a MILF and her name is Charlene\nErrybody wonder how she got the hygiene\nIt’s all thanks to Mr. Clean\n\n[Hook]\nMr. Clean\nGravy why your flow so mean?\nMr. Clean\nPull up with my whole damn team\nMr. Clean\nMr. Clean\nMr. Clean\nMr. Clean\n\n[Verse 3]\nGravy, he be clean like Colgate (aye)\nWhite MILF Charlene that’s my soulmate (aye)\nYou ain’t got a bitch I might donate (aye)\nSlide in the DMs with the snowflake (uhuh)\nTalkin ‘bout your girl my favorite topic\nYou can’t even see me you would think I’m microscopic\nGravy ballin’ out like the fuckin’ Flint Tropics\nTurn these bitches on cuz I’m really good at Bop-It\nClean in, Clean out\nPullin up drop top Viper\nHad to steal yo bitch\nFinessed it like I’m Swiper\nSo much bread gotta get my fiber\nGravy, he be cleaner than your windshield wipers (uh)\nYour step-mom made me a pie\nYou can call me the Pied-Piper (sheesh)\nI don’t eat the booty, I ain’t even gotta say it\nBut I'll eat my girls ass if she had a bad day (aye)\nGravy don’t play\nBitch I’m at the bakery, them donuts gettin glazed\nStay with three hoes like it’s the holidays\nStuck to the bread, you would think I’m mayonnaise\n(Hot Damn)\nShit I’m so God damn clean got me feelin’ like I’m Billy Mays\n(Holy Shit)\n\n[Hook]\nMr. Clean\nGravy why your flow so mean?\nMr. Clean\nPull up with my whole damn team\nMr. Clean\nMr. Clean\nMr. Clean\nMr. Clean\n\n[Outro: Ice Cream Taster]\nCover all 9,000 taste buds\nAerate it\nWarm it up\nDriving up\nThat top note\nThat cream\nPure vanilla\nSweeteners\nMmm, that's a ten", "title": "Mr. Clean"}]}