{"artist": "Professor Green", "songs": [{"album": null, "title": "D.P.M.O. (Remix)", "image": "https://images.genius.com/62d13e9c49f7e4502b4c30e7630fc461.500x461x1.jpg", "lyrics": "[Intro: Orelsan & P.Green]\nProfesseur, c'est quoi la leçon pour aujourd'hui ?\nDon't piss me off\n\n[Couplet 1: Professor Green]\nPneumonoultramicroscopicsilicovolcanoconiosis\nI don't know\nWhat that is\nBut I just know it flows sick\nOh shit\nThere I go being a dick again\nLook at me I can say the longest word in the dictiona-ry ry ry...\nI don't know much but I know \"The future's bright, the future's green\"\nThe future's me\nThe future's I\nMaybe you'd understand me a little better if you were high\nToo like my DJ I-I-I-IQ\nMake no mistake I'm just as high-igh-igh too\nIf you say the wrong thing about me\nYour career is something that you can say goodbye, bye, bye to\nHow's your album doing? Mine flew\nThis time around I'm doing what I did on the last one times two\nAnd some\nDamn son!\nHave you seen the state of your eyeballs?\n\n[Refrain]\nDon't piss me, don't piss me, don't piss me off (me cassez pas les *hum*)\nDon't piss me, don't piss me, don't piss me off\n'Til we stop there will be no falling, no we're giving everything we've got\nEt on ira où on veut aller on arrêtera qu'à la fin des temps\n\n[Couplet 2: Orelsan]\nY'a bientôt 2 heures j'aurais dû commencer ma journée\nSi y'a des bonnes raisons d'sortir du lit j'les ait pas trouvé\nLaissez-moi souffler\nÇa va mal tourner\nMissile groupé, bim-bim touché\nOuh, j'ai 40 paires pourtant j'suis mal à l'aise dans mes pompes\nJ'srais sûrement satisfait quand j'aurai fini par changer le monde\nQuand on me demande pourquoi j'suis sombre j'réponds qu'l'avenir me fait peur\nEn gros j'me prépare pour le pire même si j'aspire au meilleur\nNon, pas le temps d'être maniaque sur l'hygiène\nChez moi tu pourrais t'noyer dans les tas d'factures qui traînent\nLa semaine on taff dur la thune qu'on claque sur le week-end\nTout nous tape sur le système donc on tape sur le système\nOh, encore une soirée dans les bars-bars-bars\nOù, j'étais censé m'arrêter de boire-oire-oire (ouh)\nJ'suis même pas vraiment motivé par la gloire\nJ'essaie juste de nourrir les gosses que j'finirai par avoir\nOu pas\n\n[Refrain 2]\nDon't piss me, don't piss me, don't piss me off (me cassez pas les *hum*)\nDon't piss me, don't piss me, don't piss me off\n'Til we stop there will be no falling, no we're giving everything we've got\n'Til the wheels fall off we'll be rolling, yeah we go anywhere we want\n\nParoles rédigées et expliquées par la communauté RapGenius France", "year": "2012-01-17"}]}