{"songs": [{"year": "2013-10-10", "image": "https://images.genius.com/95c025cb5e0a6f9adaa65601de06eb93.400x400x1.jpg", "title": "Exhale", "album": "StrictlyFLOWz", "lyrics": "[Intro: Bishop Nehru]\nYeah, yeah. Fuck is up nigga?\nSuburban Shoguns out this bitch, nigga\nOn some exhale shit. Fuck wrong with you niggas?\nBout to take over this Hip-Hop shit\nY'all niggas ain't Hip-Hop artists, y'all niggas is rappers\nGet that shit right. We out here, nigga\n\n[Verse 1: Que Hampton]\nCheck it, crack flows cracked floors when I'm stepping on\nYour sound waves never heard it coming, nigga death did\nShit you gotta respect it, the Shogun on the record\nBound to chop the top off billboard slots\nThe autopsy read his head is departed from the necklace, the lettuce\nSo love Christ you get the message\nGodly with this shit, so refreshing to know I got the flow to do in a dude reckless\nNigga sword to the stu'\n\n[Verse 2: Bishop Nehru]\nI'm battering lives with the pad n' the mic, bashin' the trife\nFlows make em' grab for a knife\nBefore hoes thought he would go postal, now I'm killing em' global with all of these cold flows\nNiggas don't know\nHow they gon' hate? They stay saying I'm cocky, niggas is not me, they back nigga don't jock me\nI kill em' no probably, got mad bills no Cosby, started mad autopsies, who the fuck is gon' stop me?\n\n[Verse 3: Que Hampton]\nQue and the ruder niggas you figure it get no iller if\nIggy was with me the semi would surely hit ya\nThe mind a lethal weapon, I wreck it with lethal seconds, I'm lethal with the nine so\nThe breath will leave you at seven\nCan't stand a sixteen, goddamn I spit mean\nMy flow slit wrists, hit arteries, just shit\nMy jet stream don't let em' get steam, I mean bad business\nShow you what will happen in a casket, rap business\n\n[Verse 4: Bishop Nehru]\nCrossin' the seas in different seasons, leavin' beats in defeat when I'm speakin'\nPeople greeting a God cause I go harder, any track know I slaughter, could probably sleep with ya daughter\nI'll be on a-mission to straight riches, niggas ask to get on track, they axe missin', and in fact, I act missin'\nNow I'm the cat that dissin', I'm a lion, niggas lying, they ain't beating this kitten\n\n[Verse 5: Que Hampton]\nAwe shit, I'm rapping mad ign'ant, the black cat bad luck, but attacking with the writtens\nAttacking all the kittens, they have to get their lickings\nEat it up, and beat it up, keys will lock dreams for cream\nDrop-top beams, my themes drop top mean, she fiends for top speed\nWhich means hot rod fiend, never drop keys or weed in my pocket\nA lighter to spark it in the heart that beats, beats, and beats the hardest\n\n[Verse 6: Bishop Nehru]\nMe n' Que Ham go Rambo, where's the ammo, niggas ran home, we dismantle your mans hole\nJock and handle, these grand flows, we hot as a candle, so know that the fans go demand more\nNo name drops, niggas not insane, they'll be all black like a gothic gang, got this game in a lock\nIt's strange cause nauseous lames spit all this nonsense that still got this fame, it's a shame.."}], "artist": "Bishop Nehru"}