{"artist": "Fat Joe", "songs": [{"year": "1995-10-03", "album": "Jealous One’s Envy", "image": "https://images.genius.com/d39ec88ceb1de2aaf358c7c2fdc2898c.640x616x1.jpg", "lyrics": "\"Bronx keeps creating it..\" -] KRS-One {cut and scratched}\n[Fat Joe] The bigger nigga from the Bronx, Fat Joe!\n\"Bronx keeps creating it..\" -] KRS-One {cut and scratched}\n[Fat Joe] The bigger nigga from the Bronx, Fat Joe!\n\n[Fat Joe]\nAiyyo I said yes yes y'all-n, to the beat all-n\nAlways been no peace so I never like to ball in\nBut I maintain and keep a grip on the mic\nAnd say a punchline that'll get the crowd hyped, RIGHT\nI never could determine who's the best\nIt was either KRS or that nigga Lord Finesse\nBut now I maintain that's with my own career\nJoe gettin gold dough or somethin wrong in here\nCause everybody knows I got the skills to pay the bills\nPlus I got the flow cause you know +The *Hit is Real+\nWhat? Top notch, I give you nuttin but the raw talent\nBut don't fake jax and make me have to get violent\nYou wouldn't like it when I flip the script\nCause when I flip the script, my Glock can have an empty clip\nYeah, straight from the Ave of Trinity\nI hate it when a juvenile tries to prove his masculinity\nI got the whole vicinity locked down\nPolice hate it, look what they done to 2Pac now\nYou make me wanna blast or somethin\nBut for now I keep infiltratin these crews that be frontin\nAnd all these other MC's be hatin it\nBecause the Bronx keeps creatin it, rock on\n\n\"Bronx keeps creating it..\" -] KRS-One {cut and scratched}\n[Fat Joe] The bigger nigga from the Bronx, Fat Joe!\n\"Bronx keeps creating it..\" -] KRS-One {cut and scratched}\n[Fat Joe] The bigger nigga from the Bronx, Fat Joe!\n\n[Fat Joe]\nAiyyo I'm comin on de dance with de spliff of sensei\nThe name is Fat Joe and the crew is BDP\nNinety-three, was the year that I debuted it\nRepresentin, for all my niggas gettin booted\nNow who is the number one +Boricua on the Set+?\nWhen in San Fran' I go check Sway and Tech\nOtherwise I live the real live back in the BX\nKnown for transformin on rappers like I'm Jesus\nYou didn't know I order hits and what not?\nDon't make me have to let the dogs loose\nAnd hear the two-per shot, BOO-YA\nAin't it funny how nobody really cares\nOne minute you're here, the next minute you're under there\nWord to Christ, I put out your lights\nEvery stripe's precise, K.O.'s in all fights\nFatal like Joe with this murderous flow\nThe Bronx keeps creatin it, you know how that go, peace\n\n\"Bronx keeps creating it..\" -] KRS-One {cut and scratched}\n[Fat Joe] The bigger nigga from the Bronx, Fat Joe, yeah!\n\"Bronx keeps creating it..\" -] KRS-One {cut and scratched}", "title": "Bronx Keeps Creating It"}]}