{"artist": "ZelooperZ", "songs": [{"year": "2019-02-28", "album": "Wildcard", "title": "Delirious", "image": "https://images.genius.com/05b7afc94ec1ca9a5bb7cdce09f2cdaf.1000x1000x1.jpg", "lyrics": "[Verse 1]\nWork it been gone, jeans be like Jim Jones\nI put face on, you ain't making it home\nSend me bitcoin, bust it down like indo\nFreaky Rick on I can’t help but tip-toe\nIn the crib lotta plans hella cheese\nLet it blow, let it go, like Febreeze\nWho are you to tell me when to leave?\nThey can't move like I do, I'm unleashed\nYou see me on my knee you a one\nJust like me, she get me what I want, Cruella\nI’m a dog, Dalmatian, Cruella, headhunter\nYour white tee five dollars, my shit over a hunnid\nAin't athletic, check only thing I run up\nBeen had respect, go everywhere I wanna\nKeep it one thousand sellin' paint to your momma\nKeep it one hundred thousand paint [?]\n\n[Chorus]\nAnd I'm thinking and I'm drinking\nBitches sneaky, I just treat 'em\nDelirious, I'm serious\nAnd you see, we get [?]\nEasy peasy, Pablo Petey\nThat's my goodies, then I eat it\nLil Jon Bones, undefeated\nStrapped like Judge [?], you gon’ need it\n\n[Verse 2]\nInstant escalated\nPremeditated\nYou overrated\nYou never trapped four years in a fucking vacant\nGet the rhyme sloppy\nGetting high till I see Picaso bodies\nBasquiat faces\nFlow on the beat, That’s So Raven\nBeen had bar game, that's so blatant\nWhen momma baggin’ up, you was with them hoes playing\nHow you gon' get it, I was hidin' paper\nStep father thief-ass nigga trynna leave me basic\nBut I'm too grown, I put that nigga in the basement\nSeen the difference in the pack when they told me weigh it\nI can’t go back overseas for daylight savings\n\n[Chorus]\nAnd I'm thinking and I'm drinking\nBitches sneaky, I just treat 'em\nDelirious, I'm serious\nAnd you see, we get [?]\nEasy peasy, Pablo Petey\nThat's my goodies, then I eat it\nLil Jon Bones, undefeated\nStrapped like Judge [?], you gon' need it\n\n[Outro: Francis Bacon]\nFrancis Bacon: \"These are my few abstract paintings here, because I use the walls and things to test the colors out on\"\nInterviewers: \"Yea, and you like leaving stuff there?\"\nFrancis Bacon: \"Well I do, I just leave it there, I've even tried to clean it up, but uhm, I work much better in chaos.\""}]}