{"artist": "Fat Joe", "songs": [{"year": "2005-06-14", "album": "All or Nothing", "image": "https://images.genius.com/07b605de3e64892070232ced7e01e190.1000x1000x1.jpg", "lyrics": "[Chorus: Mashonda (Fat Joe)]\nWhen I'm all alone, 'cause you're not home (Swizz Beatz! Uhh)\nAll I want you to do for me is - listen baby\n(Sing to me baby, uhh)\nSaid you'd hold me down, but you're never around\n(Loretta I see you baby, uhh)\nCan you please just - listen baby (yeah)\nWhen I'm all alone, 'cause you're not home (woo!)\nAll I want you to do for me is - listen baby (uh-huh)\nSaid you'd hold me down, but you're never around\n(DFL, Stew, I see you too nigga, yeah, uhh)\nCan you please just - listen baby\n\n[Verse 1: Fat Joe]\nSit back, relax, Joe Crack's back\nJoe Crack's that nigga ya other niggas love to hate on (so hate on)\nPlayers keep showin' love so players play on\nWhat Crack's preachin' is CHUURCH, so niggas pray on\nGood heavens, had to wait for track seven\nTo adjust them fly dresses and high heel stilettos, yes\nThis vibe is perfect, I wonder\nMaybe that's why it falls on God's perfect number\nAnd you're all my angels\nVictoria Secret insatiable, that's this feeling\nC'mon, get it together\nMy flight lands in a half an hour, we can do whatever\n\n[Chorus: Mashonda (Fat Joe)]\nWhen I'm all alone, 'cause you're not home (woo! Uhh)\nAll I want you to do for me is - listen baby (yeah, uh-huh)\nSaid you'd hold me down, but you're never around (talk to me baby)\nCan you please just - listen baby\nWhen I'm all alone, 'cause you're not home\n(Don't catch feelings ma)\nAll I want you to do for me is - listen baby\n(You know what this is, hahaha, bitch)\nSaid you'd hold me down, but you're never around\nCan you please just - listen baby (yeah, uhh, yo)\n\n[Verse 2: Fat Joe]\nWhen you mad she's happy when she's sad she's glad\nShe ecstatic to see me and she's spazin'\nToo much of y'all for me to keep happy\nStill in all y'all keep callin' me daddy (woo!)\nI'm tryin' to change it (uhh), similar to Alaskan skies (yeah)\nMidnight look like the sunrise\nThat means I, ain't budgin', I'm still the same\nSame kisser, same hugger, same Joe Crack you love him (uhh)\nYou do ma, admit it, girl, you trust him\nTo be back at that hotel suite crushin' (crushin')\nAnd you just in time\nTo break me off before my hotel checkout time (hahahaha)\n\n[Chorus: Mashonda (Fat Joe)]\nWhen I'm all alone, 'cause you're not home (woo, woo!)\nAll I want you to do for me is - listen baby (we on tour right now)\nSaid you'd hold me down, but you're never around (yeah)\nCan you please just - listen baby (talk to me baby, talk to me)\nWhen I'm all alone (uhh), 'cause you're not home (haha)\nAll I want you to do for me is - listen baby\n(I mean my D.C. girl, she don't like my V.A. girl)\nSaid you'd hold me down, but you're never around\n(My A-T-L girl don't like my Cali baby, haha)\nCan you please just - listen baby\n\n[Verse 3: Fat Joe]\nYo, I know ma, I see your vision\nFuckin' with me is like an all-inclusive private island vacation (woo!)\nRoom service, serve by A.M. to the P.M\nAll, night crushin' this amazin' human being\nGot you love struck, topic controversial\n'Cause when I'm gone you're lost like that Corona commercial\nI know time is money, still I can't reimburse you, girl\nFor what you wear, that's the day I reverse you, girl\nYou get your nails painted proper (yeah)\nPull out the black AMEX, I'll take you shoppin'\nBut when it's time to go I disappear like Copper'\nI see you next time when I decide to pop up, I'm gone\n\n[Chorus: Mashonda (Fat Joe)]\nWhen I'm all alone, (yeah) 'cause you're not home\nAll I want you to do for me is - listen baby\n(It's like you don't know I got a wife)\nSaid you'd hold me down, but you're never around\n(Hahahahahahahaha)\nCan you please just - listen baby (YEAH!!)\nWhen I'm all alone, 'cause you're not home\n(And another one, Khaled!)\nAll I want you to do for me is - listen baby (Cool & Dre)\nSaid you'd hold me down, but you're never around (L.V.)\nCan you please just - listen baby (Swizz!)", "title": "Listen Baby"}]}