{"songs": [{"lyrics": "[Intro]\nAwww yeah! We in the motherfuckin' place tonight!\nShow's about to start guys, everybody get to your seats\nBronsolinio's comin' to the stage\nMmm, knew about the local things what they all talkin' about\n\n[Verse 1]\nStep in the door, Bronsolini, the mayor\nThe kush replayer, 80's bushy pussy gushy slayer\nI'm a star and I'mma prove it\nSaw me in the foreign car, shorty had a movement\nComin to your town, lockin' it down, rockin' it out\nI'm on fire there's no stoppin' it now, it's tournament edition\nShorty on the arm an ornament for fishin'\nBrussels eatin' breakfast in the Orient for chicken, listen\nKnow my mother wanna see me win\nSlide the crack inside the slot you put your CD in\nGive a couple bucks, let me live, puff a dutch\nCause ain't no motherfucker playin' me in Suckerpunch\nIt's my time, no more standin' in line\nNow it's time to eat, paired up with the rarest of wine\nHair red just like the meat, never careless with mine\nPlay your part and stay sharp daddy, cherish your crime\n\n[Verse 2]\nAiyyo, you couldn't wait to hear this fly shit\nShorty open up your thighs quick, smoke the pussy like a Thai stick\nMy style is lovin' in the island by Dubai dick\nI leave my socks right on the floor cause this is my shit\nIntoxicatin' aroma, drugs rolled in a diploma\nBeautiful wine, we in Sonoma yo\nThe cheese plate, fish a pike out the lake\nTake a dyke on a date, she let me pipe cause I'm an ape\nWhite limey, maneuver at night, fuck assumption\nBronsolin' bring the truth to the light, that we the best\nAnd ain't no motherfucker tellin' me different\nMost talent and I practice, ain't no shock that I'm winnin'\nDouble-layered linens\nKnown for sinnin' in cinnamon women in tinted renteds\nCinderella pendants, the Lord flow tremendous\nAll I got is myself so fuck a co-defendant\nStruck ass stripper, she tried to play me yo the whore's demented\n\n[Outro]\nBronsolinio, Amuse Bouche\nJust a little fuckin' taste of that mouth bitch", "title": "Moonstruck", "album": "Dr. Lecter", "image": "https://images.genius.com/9b10376fe5cc5f697702488523dba2cd.580x521x1.jpg", "year": null}], "artist": "Action Bronson"}