{"artist": "Immortal Technique", "songs": [{"title": "Mark of the Beast", "lyrics": "[Verse 1: Akir]\nGet ya dough, watch it go back to the people that holdin' some\nBasic ancient secrets they keeping, its us they stole it from\nPeter Joseph told us so, only those that seem to know can counteract the status quo, balance act, which way to go\nMy RFID, CID, used by the beast to track you\nYeah, charge in the car can cause an alarm\nThat’s part of the arm that traps you\nNow, bags you check in, you go inside, you prepared to fly\nWatch for scannin', you cannot hide, comfortable\n(You go no matter what you done, what treats for sky)\nClimbing a tree while I’m getting high\nThat big brother eagle start to die\nNo matter what degrees, they weave and devise a plan to decease, all that sees they provide\nWaitin' for us to breathe out the evil inside\nNo need to kiss, the dream is alive\nFree us from the evils of the demons outside\n\n[Hook 1]\nI blame it on the government, say it on the radio\nI have a devil in my infrared scope\nEvery president we've ever had lied\nBuck! Buck! Buck! Cause I don't give a motherfuck!\n\n[Verse 2: Beast 1333]\nYo, the world a﻿ mess, we all lust the flesh\nI won't stop till the people see success\nSo many beat to death, so many people left\nWith the mark of the beast, can't cheat the test\nYou bear the mark, I bear the mark\nWith the blood in the waters they're for sharks\nNow everybody want to be quoting Marx\nLess of the bite, and more of a bark\nIn a world of fakes, here's what it takes\nGotta have big balls, not baby grapes\nAt a crazy pace, let's do it face-to-face\nThe whole race chase waste space age sensash\nWith a warm embrace, they go and stab your back\nIt's so wack that the hacks flapjack the tracks\nAnd when the bombs attack we gon' bomb 'em back\nWhit the cold facts rap tracks catch a jax\nThere's no latch attached, you can't own a soul\nSo don't go go scroll, Po Po Patrol\nLet's go toe to toe like pro dojo\nThrows sold yo' soul, so don't go so slow\nNo need to crow, no need to flip\nWhat we need is a change in leadership\nWon't even give a﻿ chance to plead the fifth\nBefore the radar go from bleep to blip, bitch!\n\n[Hook 2]\nI blame it on the government, say it one the radio\nAnd if you don’t already know\nI have a devil in my infrared scope\nBuck buck buck! Cause I don’t give a motherfuck!\nI blame it on the government\nEvery president we ever had lied!\nAnd my hand’s on the 16-shot\nSemi-automatic crooked cop killing Glock!\n\n[Verse 3: Immortal Technique]\nYou think I don't notice the line when you cross it?\nI'm like the mind of a genius trapped in a cerebral palsy\nYou underestimate the hood, you think niggas is stupid\nWe read the country's credits, niggas know who produced it\nWhy the fuck you think they're pushing military recruitment?\nAmerica been platinum, and she afraid of recoupment\nSo when you try to close the border, and don't let us in\nI'll overthrow California with 20 million Mexicans\nCubans and Chinese who came looking for freedom\nTill they realized America was run by demons\nAnd I don't mean George Bush, he was a fuckin' zero\nMore like the Roman emperor Nero\nWho did nothing while the black slum turned to Atlantis\nI mean those behind the canvas that made the mechanics\nAnd then planned it\nIt sounds simple, but stupid niggas won't understand it\nUntil the mark of the beast has your face branded, nigga\n\n[Hook 3]", "image": "https://images.genius.com/d17ee30cab427a6ea7fa3bfa64561580.400x400x1.jpg", "album": "The Martyr", "year": "2011-10-27"}]}