{"artist": "C-Rayz Walz", "songs": [{"title": "Floe", "album": "Ravipops (The Substance)", "year": "2003-07-29", "image": "https://images.genius.com/df19d4ceb040577708d7c9504abcc4c1.1000x1000x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nC-Rayz.  Walz.  Massive.  We did it y'all.  Ravipops.  I'm here—emphatically, yes.  Definitive Jux.  Ravipops\n\nLadies and gentlemen, we got C-Rayz Walz and a million fans in the house tonight.  He just came off tour.  Reppin' for his 25th single.  See?  See \"Ravipops - The Substance.\"  He gon' show you how he get down\n\n[Verse 1: C-Rayz Walz]\nYo, I put the pace down, recognize my fate now\nI'm ill, still freakin' skills like H-Town\nI disgrace clowns who make frowns\nSmile in your face but hate and deliver fake pounds\nI'm a animal in a cannibal sector\nWith chicks that give you brains like Hannibal Lecter\nPeep logic—there's nothin' you can do to stop this\nYou had a better chance catchin' bullets with chopsticks (WAHH!)\nWait for the avalanche—then you'll get down\nSpit rounds—my sitcom's a full clip now\nMurder shows, practiced and unrehearsed\nDead on point like a convertible cactus hearse\nIt's mucus fluid when I spit exclusive music\nI believe in dirt, so I do it, stupid\nI move units, like {?} and white rose\nMy freestyle's ill—I'm dope when I write flows\n\n[Bridge: C-Rayz Walz]\nPut the sun in your face, make you walk a tightrope and pose\nI can't just rhyme—I can flow\nF-f-flow, flow f-flow, f-f-flow, flow, flow\n\n[Verse 2: C-Rayz Walz]\nI do somersaults with Silly Sally in Silicone Alley\nRoll red carpets in darkness through Death Valley\nAnd receive love (love) like Larry\nI'm flowin', black.  It's September?  Goin' back to Cali\nTo drink booze in the House of Blues\nDoin' the James in Elvis Presley shoes\nFrom the belly of BK, where the drama's at\nAll the way to Saudi Arabia, where the llamas at\nTrapped in central bookings for a chronic sack\nFeelin' worse—I'm really here for killin' a verse\nHomicide comes to ask, \"Who did it?\"\nI step to the next Iron Galaxy like astral physics\nI'm spiked with no sugar—natural image\nThirst is nothin', burst you for frontin' at the scrimmage\nVampires suck—you stuck once bitten\nOff the head, I'm fed—my freestyle eats my written\nI need that dollar like Chris Rock—just kiddin'\nI'm down to earth like sunlight and alien visits\nIn the club with {?}, guzzlin' water\nTrainin' my daughter to be a soldier—I taught her\nTo put six in your chest like Julius Erving\nControllin' the cypher—you foolishly swervin'\nI deserve to glow and now you know\nAyyo, I can't just rhyme—I can flow\n\n[Outro: C-Rayz Walz]\nFlow, flow, flow (x3)\n\nFlow..."}]}