{"artist": "50 Cent", "songs": [{"album": "The Massacre", "image": "https://images.genius.com/ca36dfbff5c6dfcea453afdb61476f86.1000x1000x1.jpg", "title": "I Don’t Need ’Em", "lyrics": "[Intro]\nYeah, it is what it is man\nUh-huh\n\n[Verse 1]\nSirens flashin' you know the routine, the crime scene taped off\nIt started out a robbery, they blew half his face off\nThey seen him shinin', cross full of diamonds he bought grindin'\nHis foot slip off the ladder of success he was climbin'\nThe D's came through, askin' niggas if they know what happened\nSomehow my name end up in anythin' that involves clappin'\nDetectives at my mama crib, they say they wanna question me\nThey put me in a lineup last time and they arrested me\nWhen it come to cookin' coke, they know I got the recipe\nI turn a quarter to a half, that's why they mess with me\nI'm the neighborhood pusher, I move packs to make stacks\nA little weed, a little X, a little H, little crack\nFigure, I'll push it to the limit, take the shit to the max\nNavy blue vest on, navy blue Yankee hat\nCalm, in my palm's fully loaded firearm\nFirst to let off last to run, every time it's on\n\n[Chorus]\nI tell niggas to suck my dick, get the fuck out my face\n'Cause I don't need 'em\n'Cause they're, never around, when I'm down\nShot and I'm bleedin'\n\n[Break]\n(What? Nigga is there.. is there a motherfuckin' problem nigga?)\n(Oh, yeah that's what I, I thought so.. pussy!)\n\n[Verse 2]\nNiggas be talkin 'bout me, they always callin' me crazy\nFuck them OG niggas, they stuck in the 80's\nSayin they gon' do me somethin', now you know that's a lie\nNigga you look at me wrong I let the hammer fly\nI'm rich, I still wake up, with crime on my mind\nQueens nigga put it down like Pappy Mason in his prime\nWhen I say move, nigga move, or get caught in the crossfire\nI prevents runnin', cut my fuckin' hand on the barbed wire\nThis shit's crazy, it's just a different day it's the same shit\nHollow-tip partin' yo' head, leave your whole fuckin' brain split\nThey sick, they see me in that Aston Martin\nWhat's the matter? They can't get that hooptie started\nThought they was grindin', well God damn, where that money at?\nThought you was fucked up, cause you was lettin' paper stack\nYou ain't a hustler, matter fact, you's a buster\nI don't trust ya, I should send niggas to touch ya\n\n[Chorus]\nI tell niggas to suck my dick, get the fuck out my face\n'Cause I don't need 'em\n'Cause they're, never around, when I'm down\nShot and I'm bleedin'\n\n[Outro]\nWhat? Who say they gon' do somethin' to me?\nMust be out your rabbit-ass mind\nFuck around kill one of these niggas", "year": "2005-03-03"}]}