{"songs": [{"lyrics": "[Intro: Jay-Z]\nCome on... life... death...\nHere... gone... yo\n\n[Chorus: Jay-Z]\nIf I should die, don't cry, my niggas\nJust ride, my niggas, bust bullets in the sky, my niggas\nAnd when I'm gone don't mourn, my niggas\nGet on, my niggas\nWhen it's real say word to Shawn, my niggas\nIf I should die...\n\n[Verse 1: Jay-Z]\nDon't cry, my niggas, it's been one hell of a ride, my niggas\nIn the middle of the drought, I flipped pies, my niggas\nI did joints with Mary J. Blige, my niggas\nI've eluded the coppers, got booted with Big Poppa\nSkated through with the Caesar picadas\nAt high school got head by the lockers\nGassed the baddest girl in the class to show me her knockers\nRocked jewels, dropped school, still didn't fail\nRhymes still written well, hold court in the street\nNever sit in the cell for a second then I'm gettin' my bail\nShoot it out with the bounty hunters fuck\nSittin' in the county for summers if they should down me\nEverybody around us become one for that day\nTo live life get your shit right and play\nDon't get it twisted like braids, if I'm missed it's okay\nBut life's short, don't miss a day, uhh\n\n[Chorus: Jay-Z]\nIf I should die, don't cry, my niggas\nJust ride, my niggas, bust bullets in the sky, my niggas\nAnd when I'm gone don't mourn, my niggas\nGet on, my niggas\nWhen it's real say word to Shawn, my niggas\nIf I should die...\n\n[Chorus 2: Wais]\n... don't cry, my niggas\nIt's been one hell of a ride, my niggas\nSay word to Wais, my niggas\nWhen I'm gone don't mourn, my niggas\nJust keep gettin' it on, my niggas\nSay word is bond, my niggas\n\n[Verse 2: Wais]\nI got a lot to look back on, in '88 got my crack on\nTen years later gettin' my rap on\nGettin' shorties like a thespian\nHad an episode with two lesbians, got a fetish for that\nDrunk ginseng with Japanese chicks and pulled the root out\nSqueeze my whole clip to survive shootouts\nBeen on both coasts, fired all kinds of heat\nProbably be kinda glad to leave these mean streets\nI got de-mands to meet and questions to fulfill\nLike is that mystery God real?\nAnd how was Kennedy killed?\nI ain't mad, I must've smoked a ton of reefer\nSipped Coronas with Latifah, broke the code of Geneva\nI know when I reach the other side I'ma see the\nCat I had beef with who blood remains on my sneaker\nThen it's on again, if I could be born again\nI live my life through my son\nAnd tell him never have a friend\nJust family, reincarnated I'll shorten the time\nThat I waited to get paid, tell him never be afraid\nNiggas hearts pump Kool Aid and yo' blood run thicker\nNever shed tears, cry liquor, my nigga\n\n[Chorus 2: Wais]\nIf I die don't cry, my niggas\nIt's been one hell of a ride, my niggas\nSay word to Wais, my niggas\nWhen I'm gone don't mourn, my niggas\nJust keep bangin' these songs, my niggas\nSay word is bond, my niggas\nIf I die...\n\n[Chorus 3: Half Dead]\n... don't cry my niggas\nJust stay gettin' high, my niggas\nDon't wonder why, my niggas\nWhen I'm gone live on, my niggas\nJust follow my path, my niggas\nSay word to Half, my nigga\n\n[Verse 3: Half Dead]\nI'm the aftermath of pleasure never die alone\nBorn to live forever through life's struggles\nI cut corners and took drastic measures\nSeen niggas life expire right in front of me\nTime could never mend what these cold streets\nMentally done to me, too often, I close my eyes\nAnd see my own coffin feelin' haunted\nReady to leave this world that I'm lost in\nMy only chance to see the seeds I lost through abortion\nWhen I'm gone y'all niggas better not mourn, keep flossin'\nAs long as my name lives on what's most important\nI'll be down in hell scorchin' preparin' for life\nAfterlife still torchin' and blazin' these mics\nIt'd rain for 40 days and 40 nights\nAnd I'd return on the 3rd like Christ\n(Without my physical portion)\nMy spirit a poltergeist for sure\nI'll be back through the Heights tomorrow\nBlood over y'all fake niggas door\nWhat you thought, huh?\nWhat you thought, nigga?\n\n[Chorus 3: Half Dead]\nIf I should die don't cry, my niggas\nJust stay gettin' high, my niggas\nDon't wonder why, my niggas\nWhen I'm gone live on, my niggas\nJust follow my path, my niggas\nSay word to Half, my nigga\nWhen I die...\n\n[Chorus 2: Wais]\n... don't cry, my niggas\nIt's been one hell of a ride, my niggas\nSay word to Wais, my niggas\nWhen I'm gone don't mourn, my niggas\nJust keep gettin' it on, my niggas\nSay word is bond, my niggas\nIf I die...\n\n[Chorus: Jay-Z]\n... don't cry, my niggas\nJust ride, my niggas, bust bullets in the sky, my niggas\nAnd when I'm gone don't mourn, my niggas\nGet on, my niggas\nWhen it's real say word to Shawn, my niggas\nIf I should die...\n\n[Verse 4: Jay-Z]\nI'd tell Big they're still hearin' his songs\nRun into Pac ask him where we went wrong\nTell him life is miserable when ya dealin' in the physical form\nIs everything that's invisible gone?\nI need to know, will I still feel pain or will it be ironic?\nWill I chill in the flames for all the ills of my brain?\nCan I re, veal the game to all the hustlers\nTrapped in the race and if so can I leave this place?\nCan I puff cigars and drink Cristal?\nIf this is heaven to me is this considered heavenly?\nCan I still touch lives, answer their \"whats and whys\"\nMake sure everybody in my fam' clutch five?\nIf I should die... don't cry, my niggas", "title": "If I Should Die", "image": "https://images.genius.com/1f3b917b779cd80ad127e64f21d6010a.1000x1000x1.jpg", "year": "1998-09-29", "album": "Vol. 2… Hard Knock Life"}], "artist": "JAY-Z"}