{"artist": "Antoinette", "songs": [{"title": "The Fox that Rox the Box", "image": "https://images.genius.com/0cdcd221412f3a6c5e1bae45be8d1359.400x383x1.jpg", "album": "Burnin’ At 20 Below", "lyrics": "[ * disses MC Lyte ]\n\nDon't stay shocked, cause it ain't surprisin\nI ain't the sun, but Antoinette's risin\nAnd neither am I your daughter\nI ain't Crystal, but I'm clearer than water\nStamp? I ain't mail, so you stamp who?\nHogwash, and you're washed like shampoo\nI give a blow to the Temple like Shirley\nSo see ya.. and bye-bye, birdie\nCause once again I gotta bring names down\nAnd you be slidin on stage like James Brown\nAnd like him you'll turn an addict\nNow ain't that dramatic, from legend to static?\nRush me, and you'll just fumble\nDon't think you're tough, cause all cookies crumble\nI ain't even gotta strive to be the one\nI'm the queen, I'm far from a crumb\nSo save the 'Cha Cha', cause I'm back out\nThe Lyte was dim, but here comes the blackout\nAnd I'm hard to find\nThe week was yours, but the year is mine\nHm - thought you could take me\nBut even a good cook couldn't bake me\nSo hold on to you and yours, your shoes and socks\nCause it's the fox that rocks the box\n\nThey call me the Tailor of Rap, cause I got it sewn up\nSunday's the day, but you shouldn'ta shown up\nNo u-turnin, cause that's your route\nRooks check in, but they don't check out\nAnd like paint your stay is permanent\nI'm the Boss and only now you're learnin it?\nWash up, here's a wet rag\nDon't know the time, you must got jet lag\nOh, here's the question I've been meanin to ask:\n'Eyes on what'? Trash?\nI'm large and I know you want a piece of this\nBut you gotta come sweeter, sis\nYou ain't found, but you seem lost in\nDon't let me be the one to reach your fortune\nYour lights are dim, you don't seem too bright\nYou must be goin left, cause you ain't goin right\nYou ain't in charge, so why should I hail ya?\nI don't ride the train, so I rather derail ya\nI feel sorry, tisk-tisk-tisk\nBut that's what happens when you f--k with a cat\nLike a broken record you might get scratched\nBut if you spring you fall, in other words drop\nThis is the fox that rocks the box\n\nI figured you're wiser, but you just got dumber\nYou're down the drain like Liquid Plumber\nThat's your life, so why even risk it?\nI make bread while you make bisquits\n(That's dope, Antoinette, we beat that)\nNah Dee, they might bite and eat that", "year": null}]}