{"songs": [{"lyrics": "[Allen Iverson Snippet]\n\nI'm supposed to be the franchise player, and we're in here talking about practice. I mean, listen, we talkin' about practice. Not a game, not a game, not a game, we talkin' about practice\n\n[Intro]\n\nIt's motherfucking me\nBam Bam Shit man\nSlap her ass like she scored 30\nRide dirty\n\n[Verse 1]\n\nThirty thousand for the DNA swab, don't quit your day job\nYou batty boys ain't even on my radar\nOrder breasts of veal at Walt Frazier's\nDog, my women come in all flavors, fold paper, Lord save us\nComplete a drug deal in a rental rented from AVIS\nBest believe my motherfucking Timberlands pounding the pavement\nDog, I lay with hoes, I smoke butter the same color as Jalen Rose\nStand on the balcony naked, just screaming, \"Fuck it, I made it!\"\nEvery meal I eat steak to make a statement\nPatrick Bateman, thirty Mexicans in the basement, let's get it shaking\nThe whole block's smelling like bacon\nMy shorty keep it real, take a shit out the car window\nHide money in a Nintendo\nGot a degree in dental\nCook like she down in the delta\nWrestled the gator for the foot display\nRiver monsters, Dog the Bounty Hunter\nOpen bally stuntin', this is Southern Cali summer, bitch\n\n[Verse 2]\n\nIt be the novelist, bare-handed choke a hippopotamus\nI need to go to Drug-Dealing Anonymous\nCheerio ship-flip like Rey Mysterio\nMe laid up with big money be the scenario\nOut the watch flew a canary, it's cuckoo\nLet my man who just came home throw a party where you poo-poo\nUh, that is not a nice thought\nGet locked up in the afternoon, I make it out by Night Court\nLong as I don't see that world\nI got the lawyer on retainer like a teenage girl\nEating chicken parmesean in the holding cell\nMy feet up, hittin' my G-Pen, yeah, you know me well\nQuadruple-black coupe, smacks for if you act stupid\nNo love here, motherfuckers, I clap Cupid, jump in the black Buick\nThen make a sharp right\nMy mother wrist is so cut, look like a shark bite\nAnd when I play the guitar, I'm always on acid\nShe said I look like David Justice when she see me floating in the Maxima\nIt's me", "title": "Practice", "album": "Blue Chips 2", "image": "https://images.genius.com/3tkvpk6nyazea6ub0nsnj8s01.500x500x1.jpg", "year": "2013-10-28"}], "artist": "Action Bronson"}