{"artist": "Warren G", "songs": [{"year": "1994-06-07", "lyrics": "[Chorus: G Child]\nMr. President, hey, this is the G Child\nSpacekateers, I'm back baby yes I'm back\nAnd Mr. President you're not chillin in the house baby\nYou're not chillin in the house\nYa know why? huh? huh? Should I tell ya?\nYou know why? Yeah.. cuz ya ya ya ya chillin in the shack beeyatch!\n\n[Chorus: Bo Roc]\nThis is the shack, this is how we act\nCaps I peel, flex my steel\nThis is the shack, this is how we act\nCaps I peel, flex my steel\n\n[Verse 1: C-Knight]\nIts ya muthafuckin third letter of ya alphabet\nPut Knight at the end of it\nIts a nigga you can't get with\nFunky styles, I be showin niggas\nI be blowin niggas straight out they socks, because\nThe Dove Shack is comin more twisted than dredlocks\nNow plot on the shack if you wanna\nBut if you get caught slipping\nWe will be dippin\nDown your block\nJust to street sweep your spot, nigga\nBut you can still follow along, grab ahold of my nut sack\nBecause I've got the doja\nOh I haven't told ya much love to my nigga Warren\nHe's a G, hook me, now I'm gettin funky\nI'm chillin with my feet up on the table in the shack\nWith my revolver, problem solver\nWaitin for a nigga to fuck with this\nSo I can let his ass know who he is\n\n[Chorus: Bo Roc]\nThis is the shack, this is how we act\nCaps I peel, flex my steel\nThis is the shack, this is how we act\nCaps I peel, flex my steel\n\n[Verse 2: 2 Scoops]\nIts the nigga 2 Scoops, the Long Beach Eastsider\nNiggas start to duck when I come cuz I'm a ridah\nSo I suggest you get the 411 on the shack\nWe peelin caps to the front, then we peel em back\nApproachin the wrong way, with no delay I blast your ass\nDraw for the gat but the Scoop is much faster\nYou can't miss me with that, step in my path\nI let the AK ripper cut that ass in half\nI dwells, I bells, in the LBC\nThe real menace to society\nPackin up alrighty\nA flow, but watch the one I used to abuse this track\nWe in front of that ass and you still can't see the shack\nSo pack up your gear and run and hide\n(and pass the dutchie to the left hand side)\nWe comin like that, it ain't no love for no rat\nI guess thats how we act when we chillin in the shack\n\n[Chorus: Bo Roc]\nThis is the shack, this is how we act\nCaps I peel, flex my steel\nThis is the shack, this is how we act\nCaps I peel, flex my steel\n\n[Verse 3: Bo Roc]\nAs you enter into the zone called the G Funk (now relax)\nHere a lie a war with the west (Dove Shack)\nKicks it is a know em\nRip em will be torn\nDip it as we flip it\nWicked with the Warren G child\nSee styles, meanwhile freestyles have been rendered\nI see the door of your mind, may I enter?\nI knock and I promise I won't hurt you\nThe definition of G Funk is just something to like swerve\nTo something to smoke herb\nTo sunk we and we serve\nGet with the dope herb\nTake a tall kid beat the loccness\nLessons will be taught before caught in the shuffle\nFlexin all the muscle, livin large is fuckin rustle\nI'm Simmons, I'm Robin, like givin\nI know you love this funky style\nOut this world, make your head twirl\nHear the less, now play the squirrel as you earl on the track\nWho am I Bo Roc from The Dove Shack\n\n[Chorus: Bo Roc]\nThis is the shack, this is how we act\nCaps I peel, flex my steel\nThis is the shack, this is how we act\nCaps I peel, flex my steel", "image": "https://images.genius.com/0571e437bbfbeabe74fae67aeff31522.1000x1000x1.jpg", "album": "Regulate... G Funk Era", "title": "This Is the Shack"}]}