{"songs": [{"album": "Cole World: The Sideline Story", "year": "2011-09-11", "title": "Breakdown", "image": "https://images.genius.com/40e3a5c128f6db9b27cebe6606882165.1000x1000x1.jpg", "lyrics": "[Verse 1]\nYeah\nYeah\n\nLook, I just shed tears homie and no I ain't too proud to admit it\nJust seen my father for the first time in a minute\nWhen I say a minute I mean years man\nDamn, a whale could have swam in them tears fam\nCause as I left em' I reflected on my younger days\nWhen it was just me and my brother and my mother played\nFather, ‘cause no other man bothered\nNot even my biological, it never seemed logical\nBut I accepted it 'cause I ain't know no better\nThought I was brighter than a Polo sweater\nNo pops was like Martin with no Coretta\nSo many things you could have told me\nAnd saved me the trouble of letting my mistakes show me\nI feel like you barely know me\nAnd that's a shame ‘cause our last name is the same\nThat blood type flowing through our veins is the same\nMy mama left you and it may be that anger's to blame\nBut that's no excuse, only you and God know the truth\nAnd why you only call monthly, barely ever saw me\nSpend some summers with you and played with my cousin Maury\nMaybe I should be telling you “fuck you” ‘cause you selfish\nBut I want a father so bad, I can't help but...\n\nBreak down\nI break down\nCan't help but break down\nI break down\n\n[Verse 2]\nYeah, I never thought I'd see my mama on that shit, man\nIt's fucking with her body, now she sick, damn\nI wanted a big house with a white picket fence and a pool\nWho would have ever thought that it would come to this, man?\nQuicksand is what this life feel like\nThat shit these rappers kick is nothing like real life\nYou made a milli off of serving hard white? Yeah right\nMy mama tell you what addicted to that pipe feel like\nStupid niggas, I heard the cops be shooting niggas\nI swear to God, wish I could bulletproof my niggas\nCan't get no jobs, but they still recruiting niggas\nWe trying to stand tall when it get too crucial niggas\n\nBreak down, we break down\nWe break down, we break down\nBreak the break down\n\n[Verse 3]\nYeah, He's serving time, locked down\nAnd she don't want nobody to know\nHis daughter 25 pounds\nBy the time he get out, she gon' be 4\nNow will his girl stay down?\nAin't no doubt she love him, yeah that's for sure\nBut temptation stays round\nAnd if she strayed, how could he ever know? Never know\nAnd so, she goes to the club on the weekend\nA little freaking, but them niggas holla, but she never speakin'\nBut tonight I see the devil creeping\n'Cause she been lonely, she ain't felt a man in seven seasons\nDamn! She doin the best that she can\nHer mama tellin' her to find another man\nShe college educated with a felon boyfriend\nThat's what she thinkin' tonight\nMaybe she's right, but please\n\nStay down mama\nGotta be strong, don't break down mama\nPlease\nStay down mama\nGotta be strong, don't break down mama\nDon't break down\nYeah, don't break down\nDon't break down\nDon't break down\nUh, break the break down...\n\nBreak, break down\nSteady break me down\nBreak, break down\nSteady break me down\nBreak, break down\nSteady break me down\nBreak, break down\nSteady break me down..."}], "artist": "J. Cole"}