{"songs": [{"year": "2010-05-18", "image": "https://images.genius.com/1b1da653144da5c5a984e726b5af373b.450x450x1.jpg", "title": "Down This Road", "album": "Friday Night at St. Andrews", "lyrics": "[Hook: Yelawolf]\nYou ain't ever been down this road before\nYou ain't ever seen a J running with no clothes\nGrandmama beat the switches where the air wind rolls\nSold a sack in the culdasack down that road\n\nTake a left motherfucker (X4)\n\n[Verse 1: Yelawolf]\nCatfish Billy, ain't it Bizarre tho?\nCountry motherfuckers yup. I got a carload\nGot a 30 pack of Bud in this Monte Carlo\nAnd I'm macking this slut who got an ass like a barn door\nTold her I'll give her the stick for a carton of Marlboro's\nMy boy said I'm tripping, but she looked at it its charm tho\nWhat a mystic man I am with this art flow\nLike creek water we harder than a drunk trying to dart throw\nChevy's in the back barretta's click clack\nMullets in the Starter Jacket your babies in the bed\nGave my mama keys to a 1980 lac'\nShe let her boyfriend see it and we never got it back\nFuck it, it's a bucket\nA bullet's in budget, I'll just go back to cookie cutting\nAnd reach under the rug and pull out a sack of bud\nAnd hit my buddy up for a nugget\nBuddy, it's all in the family, and I mean family by cousins\nAnd we sitting in a fucking beanbag, on the front porch swinging lean back\nBig truck riding never clean that, buckshot signs you ain't ever seen that\n\n[Hook]\n\n[Verse 2: Bizarre]\n75 north an hour from Toledo\nBlue chevy's big body Regal's\nHammerton tuxedo, home of HKiller raised by lions, tigers, gorrilla's\nRed Magnum, Helicopter doors. Big potholes will fuck up your 24's\nDetroit, Michigan where people dont care no more\nChrysler and Ford plant they ain't there no more\n20/20 vision make the wrong decision\nGet 5 to 10 and Jackson Prison\nAbandoned homes, drug dealers, crack addicts, lots of white boys, but ain't no B-Rabbit\nWhen I gotta have it, blowing that kush\nCar started out I need that push\nThe home of the purple gang and the home of Coleman Young\nDetroit, Michigan great place not to come\n\n[Hook]"}], "artist": "Bizarre"}