{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/2435f727d48cd3047e7ebf62372980b1.500x500x1.jpg", "title": "I Am", "year": "2008-05-20", "album": "Behind the Stained Glass", "lyrics": "[Chorus x2: Killah Priest]\nI was born like that, I live like that\nFeel me? Free, so let it be\nI Am... King, transform the God\nOf who? Of me\n\n[Verse 1: Killah Priest]\nIf I could write my own obituary\nI tell of things I've seen and heard, I'll admit not a bit was scary\n'Cause it was real so I'll feel no remorse\nFor those who try to crucify me then kneel to my cross\nWhy do women love to come in my life then leave?\nThen hate the way I talk, he tries to walk righteously\nThey listen to their friends, my sins, my short comings\nImpregnated your thoughts with their nonsense\nWhen all of them have lost husbands\nWives have trials, try to save lives\nLife and death is in the hands of what you feed the family\nThink of poisoning the God? Then plea to insanity\nNah, Satan you a liar, internal fire\nThe life eternal of things that concerns the writer\nThe brighter inferno of ring that make the sky light up\nWe're bound by honor, we're bound law\nWhat I found is armor, his word is the sword\nHeard by all but felt by few\nBefore I make a cause, my inner self I view\nIf Corinthians is correct, gave you the respect\nNot the jealousy of the next couple trouble of steps\nLet's cuddle to death\n\n[Chorus x2: Killah Priest]\nI was born like that, I live like that\nFeel me? Free, so let it be\nI Am... King, transform the God\nOf who? Of me\n\n[Verse 2: Killah Priest]\nMy manifestation came when you were hand to hand with Satan in reign\nMy crown rolled upon the ground, I'm slained, drizzling rain\nWait, my adrenaline done came\nI'm still in the game, I rose like Neo\nBehold, meet me in the sequel\nFor the people, the soaring eagle, fall like D-evil\nDivinity sentence me, infinity, imagery seeing scenes when I dream\nMy genes is like that of a King but that energy leaves\nLike a spiral of Bibles, going up it's Jacob's Ladder\nGod break up my matter\nSpiritual body is formed, so long, stop trying to hold on\nAppear in white and gone like a snowstorm\nBelove it, be not ignorant of this one thing\nA day with the Lord is a thousand years\nYards of blood, miles in tears, clouds turn clear\nI'm finally there\nMy mind's prepared to climb those stairs to my destiny\nMy kindred body set it free; the spirit alone let it be\nI got my weaponry; secondly my seventh plane is heavenly\nThe unexplained is shown of me, the mysteries, the thrones\nI'm giving keys to the bottomless pit\nSolomon whits, the obvious man will marvel at this\n\n[Chorus x2: Killah Priest]\nI was born like that, I live like that\nFeel me? Free, so let it be\nI Am... King, transform the God\nOf who? Of me"}]}