{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Money, Power, Respect", "album": "X-Ology: The Best of X-Raided", "lyrics": "* one of five new releases on the Greatest Hits album\n\nFirst Verse (X-Raided, with studio enhanced voice):\n\nI gave you money, power, respect, cars and gold\nMade you a star, platinum cards, scar up your foes\nHad your back, through it all, my love never expired\nDown to do it all, I did it, no matter what you desired\nAll I required, was that you keep it real with me\nAnd any man that crossed your path would have to deal with me\nHe was in it in the beginning and through the start of it all\nOn 24th Street, rappin' for guns and smokes\nWrite bars everyday, stay battlin' niggas\nOn the corner, in the hood, dismantlein' niggas\nI was watchin' you, vowed that you could excel at somethin'\nInstead of sittin' in the dank house steady inhalin' somethin'\nSo I snatched you up, put you at the right place at the right time\nOpen mic night at the club, with the right bass and the right rhymes\nGot discovered, your chance of a lifetime, got a contract big\nNow you pushin' cassettes and compact discs\nDoin' videos and shows too fast\nWith your crew, thirty deep, smokin' O's and hash\nBut you didn't want to sign autographs, no respect for your fans\nYou forgot where you came from, you think you the man!\nI gave you money, then when your second album dropped\nDubbed you with bad reviews, low sales, and this was the plot\nYou got dropped from the label's roster and lost all that you gained\nNot a peep to your name cuz you disrespected the game\n\n[Chorus: X-Raided & Studio enhanced voice of X-Raided]\n(Both) I gave you money, power, respect, cars and gold\nMade you a star, platinum cards, scar up your foes\nI was there, through it all, my love never expired\nDown to do it all, I had your back, no matter what you desired\nAll I required, was that you keep it real with me\n(Enhanced) And any man that crossed your path would have to deal with me\n(X-Raided) But is you still with me?\n(Enhanced) Livin' in debt forever eternally\n(X-Raided) Then turn to me\n(Enhanced) Get your head together\n\nSecond Verse (X-Raided + Enhanced Voice):\n\n(X-Raided)\nYou gave me money, power, respect, cars and gold\nMade me a star, platinum cards, scar up my foes\nYou had my back, through it all, your love never expired\nDown to do it all, you was there, no matter what I desired\nAll you required, was that I kept it real with you\nAnd any man that crossed my path would have to deal with you\nI feel it's true\n\n(Enhanced Voice)\nThen why you go against the grain?\n\n(X-Raided)\nThat's what children do\n\n(Enhanced Voice)\nThat's why I had to commence the pain\nTo convince your brain, to never circumvent the game\nYou'll be resented, don't be tempted by illusions of fame\n\n(X-Raided)\nFor in this game, I'm choosin' to follow the rules and change\nLoosenin' my steelo, bruised my ego, assumed the pain\nLosin' my people\n\n(Enhanced Voice)\nThey're evil, you don't need 'em to live\nThey have no love, and love is what you need 'em to give\nIt's me and you against the World\n\n(X-Raided)\nI finally figured that out\nBlowin' trees and crushin' girls is all them fools about\nI'm choosin' a route that'll definitely lead to bigger clout\nLike the Isley Brothers what I discovered makes me want to shout\nWhat can I do with the respect of a man whose respect is worthless?\nHow can a man who has no purpose in life serve me a purpose?\nJust wanna hurt me, they vicious and merciless\n\n(Enhanced Voice)\nWhat's your mission?\n\n(X-Raided)\nCollectin' money in surpluses, my only intention\nMy only henchmen is the game, keep him near to my heart\n\n(Enhanced Voice)\nMention my name and I'll appear\n\n(X-Raided)\nYeah, til' death do us part\n\n[Chorus]"}], "artist": "X-Raided"}