{"artist": "Iggy Azalea", "songs": [{"title": "1-800-BONE", "lyrics": "[Hook:]\nMotherfuckers calling my phone\n1-800-Bone\nBoy, ain't you know?\nI can back it up like a Tonka truck\nSo call my phone phone\n1-800-Bone\nSay you got that gun?\nThat AK-47\nBang! bang! bang!\n\n[Verse 1: Iggy Azalea]\nIggy got that secret service, this that presidential shit\nGet the busy tone when ya call my phone and my voicemail full of messages\nSay you got that AK-47, well, let me see you shoot it\nEat it up, beat it up boy, don't bruise it\nPut ya hands on it, don't slip, don't lose it\nBad bitches in my chat room, my chat room be poppin'\nTurn that chat room to a freak show when them bad bitches get topless\nPut it on Ustream for the whole world so the whole world can see it\nGot that hotline, and it's about time for me to swap it out, I gotta re-up\nThey saying, \"Iggy, oh, Iggy,\" they wanna play with that kitty\nThey calling, blowing my phone up, wishing they could kick it with me\nThe way I'm stunting I'm hurting feelings, they wondering what I'm getting\nA hustler charging all of you customers by the minute\n\n[Hook:]\nMotherfuckers calling my phone\n1-800-Bone\nBoy, ain't you know?\nI can back it up like a Tonka truck\nSo call my phone phone\n1-800-Bone\nSay you got that gun?\nThat AK-47\nBang! bang! bang!\n\n[Verse 2:]\nI double G Y, Iggy\nWho fuck with I? Not many\nWell know like them four turtles\nShredder, Bebop, and Rocksteady\nThat late night call be the beddy-bye\nNow tell me, who the fuck are you sleeping on?\nRound trip flight where the fuck I want\nDoing everything you bitches don't\nPrivate parties on roof tops\nExclusive shit when I shoe shop\nOther hoes just crew hop, while I'm pulling up in the new drop\n1-800-Bone thug\nThat freak shit I put you on some\nYou could try all night but I won't come\n(you could try all night but I won't come)\nYou better make sure you ready\nThese killer instincts is deadly\nThey calling two at a time, got that 3 way on my telly\nMy hotline always ringing, I got them specials and deals\nYou know my sex is a weapon, they lining up to get killed\n\n[Hook:]\nMotherfuckers calling my phone\n1-800-Bone\nBoy, ain't you know?\nI can back it up like a Tonka truck\nSo call my phone phone\n1-800-Bone\nSay you got that gun?\nThat AK-47\nBang! bang! bang!\n\n[Bridge:]\nLet me go stupid\nGo ape shit\nGo dumb\nGo insane\nIn the membrane\nThat straight jacket shit\nI'm a crazy bitch", "image": "https://images.genius.com/122cb5a8d88b89ac2c08aedadb152d20.1000x1000x1.png", "album": "TrapGold", "year": null}]}