{"songs": [{"image": "https://images.genius.com/fe7b2d9af535866969cc7963ac422da8.900x900x1.jpg", "lyrics": "[Intro: Mac Lethal]\nSeven on the beat\nKansas City, motherfuckface (word)\nSee I don't wear those trendy-ass dunks anymore, or them dumb-ass Bathing Ape hoodies\nYou know what, man? This is not an independent rap beat, can you tell?\nListen to that bass. (Rhymesayers entertainment)\nIt's gonna flip your car over\n\nWhat I want you to do is, uh-\nTell your grandmother to stop bitching, load your bong up,  take a fat-ass hit right now\n\n[Verse 1: Mac Lethal]\nGood evening, I've arrived to clean your pill drawer out\nAnd talk to birds like Kilgore Trout\nI shout out loud\nI think that most these rappers out are probably into guys actually\nCause they want five mics, I'd rather have five Mallories\nWhen I write unraveled violent shades of quite contagious psycho babble\nHit me with a big steel shovel\nDig me in the white stone gravel\nAt the live show frazzled\nProvoke the ravenous mischief the counter rhythms are rowdy\nBut fuck these rappers, they're bitches\nCops come with their sirens like 'wee-oo, wee-oo'\nI'm too illegal with the ink pen\nPush or click over like somebody's trying to beep in\nEveryday is Saturday so baby hit the snooze button, let's sleep in\nI say I'm selfish but they never listen\nSo I took 'em Christmas shopping and I bought myself a television\nBetter find the troll up hold up got a clever line to pull up\nJohnny Rotten popped an Oxycontin, nevermind the bullocks, oh!\n\n[Hook]\nLive up in your city I'm about to steal the show\nThese people disagree but I don't listen to 'em though\nI'll never do a stupid dance up in my video\nI'm perfectly content with being crazy\n(x2)\n\n[Verse 2: Mac Lethal]\nI received an e-mail from the president of a Nigerian bank\nIt said he had a hundred thousand dollars for me (Thanks!)\nI can now invent my engine for the hard shell truth served\nIn the barbell-brute version of Marcel Proust words in a capsule\nAttacking the vocabulary kingdom, see not everybody's cool\nI got the swagger of a penguin\nWhat you're seein is a dirty splash of Kansas City Eurotrash\nYour surly-ass uncle, counting dirty cash\nCops pull me over with their sirens like 'wee-oo, wee-oo'\nI'm driving drunk like it's the weekend\nBoy I gives a fuck, me and the homie Al Swearengen chill, brandy I'll swill, taking synthetic heroin pills\nI lo-lo-love the taste of hops and malted barley and beer\nIt makes me wanna bite who's on stage like Carlos Mencia\nBut I don't steal, I've had a charming career\nSo bring your armor and gear\nBecause the dope style harbingers here\nOh!\n\n[Hook]\n\nBuy me a drink I've got some craziness to kill\nPeople spreading rumors, they ain't saying shit for real\nKansas City motherfucker, full of dangerous skill\nI'm perfectly content with being crazy (Hell yeah)\n(x2)", "year": null, "album": "11:11", "title": "Crazy"}], "artist": "Mac Lethal"}