{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/b968840b5ebd29f20f38cc18d412d0f7.360x360x1.jpg", "title": "INSTANT PLEASURE BUTTON FUNCTIONAL", "year": null, "album": "The Electric Kool A.D. Acid Test", "lyrics": "[Verse]\nKool A.D\nStep into the place like \"Ohh, baby\"\nI'm just another MC\nAnother rap hip hop rapper MC\nMan I'm just a dumb rapper\nOh, hum, come, bum, bubble gum rapper\nNot a gun clapper, just a gum flapper\nKnown to even freestyle cypher with some laughter\nCan flow faster than [?], but I can run faster\nYo, I go threw the cloister halls like a nun's laughter\nThe scriptures in my brain are one chapter\nI spit 'em at your dame while she on the bun master working it\nOh my god, shit\nIt's like an info commercial\nYo, everybody's rapping like its a commercial\nActing like life is a big commercial\nKool A.D., and I'm soo commercial\nFirst Latin rapper to sample Charles Bronson the band\nSampling Charles Bronson the man\nSecond reference on the album to the one rhyme\nIn that one part of that one big pun rhyme\nOne dime, minus one is nine\nSush, none of them whine\nKnow to do the same shit [?] of mine\nIt's like a lot of shit\nI don't even have the time to write all of the similes\nShit is silly please\nPhilly pilly please\nPass the philly, Jesus, I got a Christ complex\nVicious, I got a motherfuckin' black beans with white rice complex\nI rock a cardboard crown that I copped from a kid's meal\nRide around town on a big wheel\nKing of Oceania, I'm a pretty big deal\nGet the bacon, dawg, give a fuck what a pig feel\nUber alles with the John Wayne swagger\nSemiotic semi automatic brain dagger\nGuns lack the bodies of human truths\nClips on the pusher TV stay moving news\nBrush it off with the wink and the shrug\nGimmie a rug, gimmie the drugs, gimmie some love, gimmie a hug\nBig macin' in the jaws of life\nYo, lips smacking on a lawless wife (?)\nLike Lucy known to get the chips like [?]\nSometimes I beg and sometimes I'm choosey\nNo, yes, everybody take a deep breath\nYes, everybody take a deep--\nYo, mm-mm-mm, now I'm jacking Kraftwerk\nI can shit on the track till my ass hurts\nCaptain beefheart in the back\nLike it was John Coltrane on a Black Sabbath track\nNew generation, just to ask Girl Talk\nMash ups on the internet: suck the world's cock\n\n[Outro/Hook?]\nRULING CLASS INSTANT PLEASURE BUTTON FUNCTIONAL X4\nKOOL A.D. AND THE BUTTON SOO FUNCTIONAL\nKOOL A.D. INSTANT PLEASURE BUTTON FUNCTIONAL\n\n[Repeat/Spelling Kool A.D.]"}]}