{"artist": "G-Dep", "songs": [{"title": "Everyday", "album": "Child of the Ghetto", "year": "2001-11-20", "image": "https://images.genius.com/bddcce4afa23dd703cfaf4bd2ea9dfe7.300x300x1.jpg", "lyrics": "[Verse 1]\nAyo, I walk down the block with my stomach in knots (uh huh)\nSpent time hustlin', runnin' from cops (uh)\nBroke as a joke, no ends at all\nCan't play ball and my Timbs is small\nCan't buy trees with, government cheese (word)\nI rather be where it's breeze, niggas bubblin' ki's (uh huh)\nMy moms got two jobs one on her knees\nAnd writin' letters to the governor \"Please call off the deed\" (shit)\nMy baby mother with another brother with cash (uh huh)\nThey drive by roll down the window and laugh (ok)\nI solve all my problems with indo and hash\nBought my daughter a Nintendo now she calling him Dad\nMy landlord's a jerk (damn), the water don't work (uh huh)\nMy little sister twelve and she bought her own skirt\nRather do Kirk, than, do her homework\nTalk blunts and boys and she'll jump for joy\nShit is twisted, opportunity knocked but I missed it\nOut in the park gettin' lifted\nSo now I'm sittin here shit out of luck, without a buck\nAnd it don't make a difference\n\n[Hook]\nSo do you hear me?\n'Cause if you don't I'll come up close and say it clearly\nI got to know I got to go\nI strive for my pay, (yo) each and every way (yo)\nBut this type of shit it happens everyday\n\n[Verse 2]\nIt's like I'm trapped in a maze walk around in a daze\nI won't rest 'til I'm paid or I'm down in my grave\nI wanna look tough, but my sneakers is scuffed (uh huh)\nEveryday pants in the week is enough\nI had a little money but it came and it went\nNow it's either pay the rent, or stay in a tent\nAnd it don't make sense how the shit is intense\nAnd all you got up in your pocket is lint, you get the hint?\nI had a cigarette for breakfast, just for beginners (damn)\nPride for my lunch and, sleep for dinner (word?)\nTried to go to church, priest called me a sinner (uh huh)\nThey call me everythin', except for a winner\nI'm walkin' in the rain wishin' things would change\nIt ain't a game, man I pawned all the rings and chains\nEmotionally scarred from, losin' my job\nPass the nod nigga, times is hard\n\n[Hook]\nNow do you hear me?\n'Cause if you don't I'll come up close and say it clearly\nI got to know, I got to go\nI strive for my pay, each and every way\nBut this type of shit it happens everyday\nNow would you check me?\nIf I was you and you was me, would you respect me?\nI got to know I got to go\nI strive for my pay, each and every way\nBut this type of shit it happens everyday\n\n[Verse 3]\nYo, yo, I ain't gonna front, all I want is a blunt\nA pair of blue and yellow dunks and my hundreds in chunks (uh huh)\nBut, people see me, put they purse to the front\nI'm wakin' up early on the first of the month\nHoneys don't respect when you call 'em collect\nAnd it's 25 cent you can call 'em direct\nI put my life on the line I ain't makin' a dime\nNiggas call me \"Never mind, man, you're wastin' your time\"\nAyo, I'm livin' in the ghetto and I'm tryin' to survive\nAt the same time a nigga rollin' by in a five\nCan't find the drive for a 9-5\nIt's like I only get by when I'm feeling the high\nAnd I ain't got no smoke, the elevator broke (damn)\nI'm at the end of my rope, tryna find a way to cope (I see)\nI'm sippin' on Gin thinkin' how I could win\nI don't know where it begin but this is where it could end\n\n[Hook]\nNow do you hear me?\n'Cause if you don't I'll come up close and say it clearly\nI got to know, I got to go\nI strive for my pay, each and every way\nBut this type of shit it happens everyday\nNow would you check me?\nIf I was you and you was me, would you respect me?\nI got to know I got to go\nI strive for my pay, each and every way\nBut this type of shit it happens everyday"}]}