{"songs": [{"image": "https://images.genius.com/172fd11d985cafaf1a69338ab1207c15.600x600x1.jpg", "year": null, "lyrics": "¿Siempre que te pregunto que como, cuando y donde?\n¿No me contestas, que quieres que te ruegue?\nYa sabes que yo no estoy pa' rogarle a nadie\n¿Hasta cuando no?.. mira deja y te explico algo\n\nPor que será que, cada vez que te miro\nTe haces del rogar y de coraje yo me trago mi suspiro\nEstas bonita y eso no lo niego para nada\nPero en veces me tratas como nada\nCuando tú quieres, sola te me arrimas\nMe confundo por que el rechazo me lastima\nMis sentimientos siempre te los he dicho\nY tu nomás por andar con tus caprichos\nMe la pones muy difícil la situación\nEs por eso la razón que te escribí esta canción\nPara explicarte, y que entiendas en claro\nQue el día que te decidas tú dime y yo te aclaro\nNo se por que lo tienes que pensar tanto\nDime...Vale la pena si me aguanto\nTe decides por que ya no puede más mi corazón\nY ya no quiero tu razón\n\nCoro...\nSiempre que te pregunto\n¿Que como, cuando y donde?\nTú siempre me respondes\nQuizás, quizás, quizás...\n\nA dos bloques de mi casa conozco a una morena\nTodos mis compas la conocen a ella\nCon ellos, se porta un poco sería\nY conmigo, tal vez me preste alguna feria\nMe encanta, pasearme por su casa\nDe todas sus amigas ella es la que mas me pasa\nPero siempre, que le digo que ondas cuando?\nSonríe, y me dice no es pa' tanto\nTe digo, si la miras te enloqueces\nPor que a esta nena la he tratado ya por meses\nY sus ojos, están como los quiero\nSe me hace que esta morenita, cayó del cielo\nYo quiero, que ya me deje pasar\nY deje, ya de hacerse del rogar\nSé que quiere, pues también se pone roja\nLe tendré que dar por otro lado a ver si no se enoja\n\nCoro (repetir)\nSiempre que te pregunto\n¿Que como, cuando y donde?\nTú siempre me respondes\nQuizás, quizás, quizás...\n\n\nQue mas quieres… ya la he tratado de todos modos, su manera\nDios mío, no nada no quieres nada\nLa lleve al Mc Donalds, le compre un Bigmac\nSu soda y todavía no quiere nada…\nNo seas Fresa, no seas Naca…\n\nPor elevarme te la pasas platicando\nPreguntando, que con cuantas otras ando\nEso no es para que tú te preocupes\nQue tu traes otros colgando es lo que supe\nSe me hace que contigo ya no puedo\nPrefiero tener nada mejor solo yo me quedo\nPor que no buscas a alguien más para hacer menso\nY así, esto yo ya no lo pienso\nCada vez al preguntarle, me sale con cada excusa\nY yo imaginándome otra cosa más sabrosa\nEs difícil, pero con ella me comporto\nA veces pienso, no será que tiene otro\nQue la anda enamorando y conquistando como yo\nPues un poco mas cuidado si la neta tiene novio\nY si no, pues a ver como le haré\nPor que esta chica de nuevo tiene que caer…\n\nCoro (repetir)\nSiempre que te pregunto\n¿Que como, cuando y donde?\nTú siempre me respondes\nQuizás, quizás, quizás...", "title": "Como, Cuando y Donde", "album": "Komp 104.9 Radio Compa"}], "artist": "Akwid"}