{"artist": "Boondox", "songs": [{"album": "South of Hell", "title": "Lezbehonest", "year": "2010-05-11", "lyrics": "[Skit:]\nOh Shit, you look cute as hell\nNow you move over here and let me start massaging that fine ass of your's\n\nWhat the fuck's up with these bitches?\nI got dick for days but these hoes wanna keep their face buried in some pussy!?\nBitch You ain't even gay\n\n[Verse 1:]\nShe got a Katy Perry ringtone, plays it like a theme song. Kissed a girl and liked it, now she's swearin' off the ding dong. Back and forth like ping pong, she really strictly dicky, now Madonna scorin' Britney now the bitch is strictly licky. Suck a dick, suck a titty, she don't really give a fuck, and rainbow or her preice mean she always gettin' lucky. Had her first fish platter on her girlfriend's futon, hidden valley, tossin' salad, lickin' on a crouton. No shame in this fake bitch game, swervin' in and out of traffic, never stayin' in her own lane. She want a piece of cake and yeah she wanna eat it too, pay her some attention and the bitch will go down eatin' you\n\n[Chorus:]\nBe actin' Lezbehonest. No more trips for you down south\nDing-a-ling you know you want it, take the pussy out yo mouth\nYou love the peter! Bitch don't lie. You love the cock!\nDon't even try. No more pooter! No more coochie! VaJayJay time to say good bye\n\n[Verse 2:]\nGirls gone by, Spring break, college road trip in some wet t-shirts, wrestlin' in cool whip. Flash a nipple, slap a pussy for attention. Just turned eighteen, now she on a fuckin' mission. Got a make her daddy listen, maybe show a little anger four shots of jagermister, tongue kiss a perfect stranger. Three, Four fingers deep in some bleach blonde bimbo, a double headed dildo beatin' like it's Kimbo. Put in on the YouTube. The pictures on the Myspace, just so I can peep it, wish the bitch would sit on my face. Two straight broads tongue kissin' by the swimmin' pool, fake dyke bitches eatin' coochie 'cause it's cool\n\n[Chorus:]\nBe actin' Lezbehonest\nNo more trips for you down south\nDing-a-ling you know you want it, take the pussy out yo mouth\n\nBitch you know you want it, don't say that you don't want it\n\nBitch you know you want it, don't say that you don't want it\nBitch you know you want it, don't say that you don't want it\nBitch you know you want it\nBitch you know you want it\n\nNever gonna beat her, now you're lickin' on the cooter\nOne day she was your friend and the next she wasn't screwin'\nNow I'm massed out with no luck, can't even get my dick sucked\nJerkin' off in the corner watchin' her and you fuck\n\n[Verse 3:]\nDon't get your panties twisted, shit I love them freaky bitches. Daisy chains, runnin' trains, girl on girl and pussy fistin'. All I'm rally tryin' to say, girl just don't claim your ass is gay. I laid the pipe the other day and fucked your girlfriend the other day. Tell the truth, don't even trip. you know you like to wrap them lips around a peter lick the tip 'cause little girls don't come equipped. Bitch please, you ain't right, what you really tryin' to prove carpet muchin', donkey punchin' cause you claim you're so confused. Yeah I push my dick on hard to see you sixty-ninin' neden. But to rise up on your cake won't be the case up at your weddin'. Put in perspective cut the act you ain't no lesbian, just a trick who love the dick but Perpetrate a lesbian\n\n[Chorus:]\nBe actin' Lezbehonest. No more trips for you down south\nDing-a-ling you know you want it, take the pussy out yo mouth\nYou love the peter! Bitch don't lie. You love the cock!\nDon't even try. No more pooter! No more coochie! VaJayJay time to say good bye\n\n[Skit:]\nAfter all, we're just two lonely bitches on the loose for the weekend\nYeah, I bet your little ass is on fire\nYou'll be a new woman when I'm finished working on you", "image": "https://images.genius.com/065e7cb2b70fad281b6176257886e84e.500x500x1.jpg"}]}