{"artist": "Andre Nickatina", "songs": [{"title": "King Nicky’s Crown", "album": "Daiquiri Factory: Cocaine Raps, Vol. 2", "year": "2000-06-06", "image": "https://images.genius.com/938e1205f8900a38bea9cfb2f96124ae.220x220x1.jpg", "lyrics": "Verse 1 (Andre Nickatina)\n\nMy raps are like a cell phone rate\nCause they keep ringin all across the state\nHit the barbque party make a handsome plate\nI give u hell untill i make it to the pealy date\nFeel pretty, king nicky do it for the city\nThe spot got hot when they shut of the semi\nGame is late with a straight poker face\nMy recipies cats all wourlin to taste\nBut wait its the chef the new hockey ref\nCuz im a cold rap cat till my very last breathe, yes\nI crash cars with the melokie brothers\nMy horoscope told me there is no other\nI rap everyday like a christmas gift\nI stay hot at the head if the g's dont flip, but trip\nCrushed velvet i tackle no helmet (wuh)\nI probly ain't shit if u let a freak tell it\n\nVerse 2 (Lolo Swift)\n\nWha (??) (??) (??) (??) via pimp take it for what its worth\nLoli lo might mama never (???)\n(?????????????????????????)\nWith the magnitude that you submittin'\nTo the game brame watch this how you be forgettin\nCut out your never next with the stylish jack\nLeave ur ass for dead cause you be fuckin faggots BITCH\nPicture this superbowl sunday\nNiggas shoottin craps in the kitchen\n(?????????????????????????????)\nBank robber\n(???????????????????????)\nWhat ever you like pumpin I ain't from my abs\nCause my ass is tight\n\nVerse 3 (Andre Nickatina)\n\nI write scriptures\nFor those (???????) drug picture\nTreat the pain and make it feel liek a slug hit cha\n(???) im about to make bail\nThe plan i got (????) cliental\nThe killer whale goes deep benathe the ocean floor\nAnd leaves dead MC's at the sandshore\nThe atlantic, man dont panic, you act liek u ain't never\nGet your ass kicked\nI make money and for me its sheer kind\nComin through, smellin good, park (??) (ooooh)\nAll in detriot man they know my (??)\nStretchin they necks tryin ta check the guy cuz\nI stay quite when my other niggas get loud\nI kick style with my silver tooth smile (cha ching)\nI cook rhymes on a cookie sheet\nWhile you play that top on a rookie beat\nWORD\n\nVerse 4 (Lolo Swift)\n\nFrankly, Im about to spank thee\nOn the microphone (???)\nStitchin up your pain with my protocall\nYoull get your (???)\nKidding, you see my devilsh grin\nI see the way you like sedating while im lickin my ends\nWhile u be gressin im progressin your the (????)\nFirst lesson compessin, cause (???????)\nIs the first step to a cry (?????) im a pimps grip\n(???) now really how far do you think the players\nPath gon getcha? c'mon nigga HUH HUH?\n\nShiiit you know mackin is a game freak, and im a player\nBut not for long (????)\nShiiit, King Nicky in full effect I got coke dealers askin\n\"What you doin next?\" and check\nLike the honycomb hideout hidaway, i dont drive nickatine\nI just fly away. Spread my wings like a vulture when it comes to this\nMakin moneys more sweater then a tounge kiss\nShift the gears on my (??) like a (??)\nBack there i had you spinnin like a comacobie\nWork the rap like a drunk work a bar tender\nShake it live like a colt 45\n\nFeel free to correct it its needs to be!"}]}