{"artist": "Fabolous", "songs": [{"year": null, "album": "Real Talk", "image": "https://images.genius.com/1de0001bab671e3228ac0aa53fc0a73c.1000x1000x1.jpg", "lyrics": "[Reverend preaching]\nHa ha ha haa\nBrothers and sisters we're gathered here today\nTo listen to a young man that's on fiiya\nYou sittin in the church wit Reverend Charlie Murphy\nAnd I'mma bring it to ya wit brother F-A-B-O-L-O-U-S\nFabolous\n\n(Fab): Preach, Brother preach\n(Rev.): Fabolous\n(Fab): Preach Brother preach\n(Rev.): Preach to 'em Brother, Church\n(Fab): Yea, Uh.. uh.. uh.. uh\n\n[Verse 1]\nYo, I preach through my raps\nGod is watchin me I still reach to my strap\nBroads is watchin me they wanna leech to my trap\nTha Jesus Christ on my neck reach to my lap\nI teach you to rap in my Sunday School\nThese bitches get a one day rule\nYou gotta fuck be Monday, cool?\nOr she gotta stroke a stick like the hun play pool\nIf not you gotta walk like a runway fool\nCatch me in the moon shine or the sun ray jewels\nIf you keep sayin your prayers maybe one day you'll..\n..be blessed like me 'til then keep stompin in your Air Force O-N-E-S Nikes\nThey should make scriptures wit my flows\nI'm the young Bishop Don Juan that stripped ya for your hoes\nSo if I throw a dollar at ya scream Hallelujah\nWhile I grab the neck of my robe and pop a collar to ya\nChurch\n\n[Reverend preaching]\nNow in this world that we live in, there's all kinds of pimps\nYou got ya playas, ya ballas, ya macs, ya gorrilla\nPimps that take what they want\nYa all-star pimps... Pimps that (?)\nPimps wit nothin but the Gators on ya feet (Preach to em brother)\nNice pimps, mean pimps\n\n[Verse 2]\nI feel like the angel of God\nAll I gotta do is drive the Range through and nod\nIt's like I was put here to put layers in the air\nPut squares in my ear, put squares in the chair\nPut pairs in the rear\nI even put 20 inch footwear in my spare\nLord knows I gotta stay on them spinners\nDis verse is like grace that you say on your dinners\nGirls come wit me knowin that they gonna be sinners\nBut, I'mma sense of relief\nAnd I ain't never been a trick kinda like its against my belief\nIf she got it from me then I'm convinced she a theif\nBut they say God giveth and He taketh away\nAnd I can do the same thing when I shake with the 'K\nIf a nigga make a mistake wit the pay, Goddamit\nAt the club I get right in\nSo if heaven got a ghetto I should fit right in\nGod loves me\n\n[Reverend preaching]\nNow just what kind of ho are you?\nAre you a tough ho, or a soft ho? (That's right)\nAre you a big ho, or a little ho? (Lil' teenie weenie)\nA domestic ho, or an international ho?\nA rich ho, or a broke ass ho?\n\n[Verse 3]\nYea, me momma got my name from the Baptist who made\nTha wrong moves wit the women and died for it\nYou make the wrong moves when you come and you try for it\nNew York City of God\nI 'den saved some of New York's prettiest broads\nI'm spittin the gospel\nI hit my apostle's wit the coke that'll heal a sick\nSoon as it get in they nostrils\nA Dros Trios, bring the organs on ya\nA 40-Caliber'll turn ya to a organ donor\nAnd a day or two, you'll be a morgue aroma\nWhile I go city to city fillin the pieu's up\nI ask God to forgive me while I'm fillin the Uz' up\nDemons won't let me see a man fillin my shoes up\nI ease 'em wit a sermon, but that ain't hard\nWhen I'm in the Beamer before they released 'em to the Germans\nYou prolly got the man you love wit you\nBut wouldn't you rather have the Man above wit you?\nCan I get an Amen\n\n[Reverend talking]\nNow some of ya'll are pimps, And some of ya'll are hoes\nBut the rest.. the rest of ya'll.. don't think I don't know\nYa just a hater.. They hate what you got\nThey put a black eye on on the game whenever they play\nThey piss in the pool, And they fart on the elevator\nThen look you in the face, Like they think you did it\nThey hate change (They hate change)\nAnd they hate progress\nThey hate me and they hate you\nThey hate they own momma\nCuz they think its her fault that they ain't got shit\nBut I'm here to tell ya today\nThat if you a hater\nThen you are the outter take or your own business (Amen)\nAnd someody just put 25 dollars in the collection plate\nSo I'mma go up on the corner\nAnd buy me a fish sandwich\nY'all hold it down, I'll be right back\nTha Reverend Charlie Brown\nAnd don't you ever forget\nFabolous, Fabolous, Fabolous, Fabolous\nBitch ass motherfuckers\n{*fades out*}", "title": "Church"}]}