{"artist": "Apathy", "songs": [{"title": "Ap is Like...", "image": "https://images.genius.com/e141ff9150df93387385a0a66f7cbd92.678x658x1.jpg", "album": "Baptism By Fire", "lyrics": "(Uh! Yeah!) Connecticut!\n(Uh! A...P!) Apathy!\n(Demigodz!) Yup, uh!\n(Doe Rakers) 'course...\nYo...\n\nYo I ain't afraid of shit, I won't even pretend\nI be flippin' God off through his microscope lens\nThis asshole supreme and his violent friends\nClosest we came to peace signs is drivin' a Benz\nThis is hip-hop that overloads amps and speaker boxes\nFor muthafuckas' rooms that cluttered with sneaker boxes\nTongue ring bitches who be sneakin' our oxes\nIn the club where security decreases the options\nCause Ap is like William Blake, but filled with hate\nWho broke open his brain to let the skills escape\nIt's like silicon tits to porno chicks\nI could flow on 'till Voltron's torso splits\nI supply, multiply like Gordo's chips\nI'm a He-Man, and y'all are on some Orko shit\nGold BBS rims on a Saab with the stop sign\n'87 status radio show dot nine\nConnecticut veteran, better than ever before\nHandprints embedded in metal of mics I tore\nIn half with half a paragraph, skin grafts needed\nIt's equivalent to starin' in the sun when tryin' to read it\nY'all wanna get defeated, that's a personal decision\nBut I'm cuttin' muthafuckas up with surgical precision\nA legend in the making, the last of a dyin' breed\nY'all are newjacks, probably get shook when buyin' weed\nYou're MySpace gangstas, with guns in pictures\nI'll slap your face and tongue fuck your sisters\nFor this next one, you gotta be sharp so listen:\nI'll hit you in the head like turbulence when you pissin' (Phenomenal!)\nCash I stack's astronomical\nNikes are pricey, Pisces astrological\nAp's wifey's a fat ass Aphrodite\nThat badass bastard that spaz out like hyphy\nHand out like Heisman Trophies\nApproach me and your homies are pourin' out fo'-ties of OE\nI'm playin \"Time's Up\" by O.C\nSellin O-Z's and O-C's to kids in the OC\nHate authority from P.O.'s to C.O.'s\nCause we know, we see those, and we ain't seein' no dough\nSo play the low, slow it down, make paper, through it around\nI'mma have a lot of fun before I go underground\n'Fore my spirit speeds through space and punctures the sun\nI'll be keepin' heaven 'fore a muthafucker should run\nI ain't frontin' like I'm runnin' 'round with hundreds of guns\nBut just watch, got an ox hidden under my tongue, son\nMTV just got Sucker Free Sundays\nI'm sucker free 365, not one day\nYou average little cornball phony ho model\nY'all ain't Fif, you're more like a Rosie O'Donnell\nI'm dyin' for rappers to stop glorifyin' diamonds\nCause wannabes are rhymin' 'bout 'em when they never buy 'em\nDude's swear they poppin' but the labels never sign 'em\nIt appears that materialism is what defines 'em\nLet's fast forward ten years to see where we find 'em\nIt's hard to focus vision when them hater blockers blind 'em\nIt's hard to disagree when they know that I'm right\nDon't know what it's like? I stick it in your sister every night", "year": "2007-01-15"}]}