{"songs": [{"lyrics": "(chorus)\nShe's a dirty birdie, she's so flirty\nComing out the house looking all nice and purty\nShe's a whirly girly, she don't get up early\nShe like to sleep late and party like LaVerne and Shirley\n(repeat)\n\nThere she goes, she's a freaky-deaky, thicky-mickey\nShe kinky, she stinky and she take the winky-dinky\nShe dingy and janky and she love the hanky-panky\nShe fucky sucky shucky ducky, screaming \"Spank me!\"\nShe itchy scratchy oochie coochie, Gucci luchi\nShe tooty fruity with the booty and she love sushi\nNow who's she? Now who's she?\n\n(chorus 2x)\n\nThere she goes at the clubby-clubby, rubby-dubby\nDrinky-drinky bubbly-bubbly\nLovey-dovey in the cutty with the buddy-buddy, chubby-chubby\nNo they ain't fuddy-duddy, they like putty\nLike to say \"Daddy-daddy!\" and blaze fatties\nMake you go baddie-baddie for the meat patty\nShe like it real juicy-juicy and she loosey-goosey\nYou know she like Acey-Deucy and she work the poo-sy\nNow who's she? Now who's she?\n\n(chorus 2x)\n\nThere she goes, sweet honey-bunny she yummy-yummy\nAlways screaming \"Money-money!\" like it ain't funny\nPut it in her tummy-tummy, she cummy-cummy\nYes she's a mommy-mommy but still stunning\nRum with the Coka-Cola, she like nola [?]\nTalking on the Motorola, outta controlla\nMake a homie happy-happy for the nappy-nappy\nShe said \"I know it's sloppy, papi, but get at me\"\nWho dat be? Who dat be?\n\n(chorus 2x)\n\nThere she goes she's big and pretty with the titties\nNext to miss itty-bitty with the fat kitty\nShe like it bang-bang chitty, nitty-gritty\nDancing to \"Doo Wah Ditty\" in the city\nBig booga wooga sugar, she my nigga\nShe don't stop get it get it, and I dig her\nNow who is her? Now who is her?\n\n(chorus 2x)\n\nGirls the girls they love me\nGirls the girls they love me", "title": "Dirty Birdie", "album": "Hip Hop and the World We Live In", "image": "https://images.genius.com/dde48df06ccd165a12ed0bc40d9c736e.500x500x1.jpg", "year": null}], "artist": "Aceyalone"}