{"artist": "Ant Banks", "songs": [{"title": "Streets of Oakland", "image": "https://images.genius.com/f15a8c91348ddd75d458eec3b8d6c818.782x768x1.jpg", "album": "The Big Badass", "lyrics": "[Ant Banks]\nYeah, to the break of dawn, you know? Let's do this\n\nChorus:\nNiggas in Oakland all day long\nBe pimping these hoes from dusk til dawn\nMaking cash real fast and you know it's on\nHanging on the streets of Oakland\n\nAll we do is smoke that weed\nAnd drink brew on the ave til we get keyed\nAnd a little bit of head is all we need\nHanging on the streets of Oakland\n\n[Ant Banks]\nWelcome to the danger zone, where the niggas don't play that\nEvery man for self, the rule is to stay strapped\nCause rat packers try to jack that ass\nFrom the jealousy that's built in the streets when you stack cash\nAnd they'll blast, hoping they can get get it\nPunk, so if you got it, you best to get with it\nOr quit it, cause niggas be flipping over dope and\nYour friends might get you if you're slipping in Oakland\nYeah, so don't play no punk-ass nigga close\nCause they'll mash on your cash and get ghost\nAnd don't say Ant Banks didn't warn ya\nAbout the loced-ass gangstas killing in California\nThat's where I'm from, nigga, rolling in my G-ride\nHey, you gonna see me slide when I'm on the Eastside\nMaking all my fucking gitnotes\nMaking sure my gat straight smitnokes, smobbing with my fitnokes\nThat's all we doing is the town is seeing bitches clowning\nKicking back getting high lounging\nIt really doesn't matter what you do, yo chilling with your crew\nYou're sipping on a brew, you're pimping bitches too\nAnd the shit don't bother me if that's how it's gotta be\nThen macking these hoes should be equality\nSee, the game goes deep when you're rolling\nHanging on the streets of Oakland\n\nChorus\n\nNighttime falls and everybody's perking\nNo punks around so funks occurring\nBut the sideshow's back and everybody's flossing\nIn they ride trying to side and all the freaks are tossing\nAnd brother with bump, trunk of funk is knocking\nCandy paint on they ride keeps the bitches jocking\nKnowing you's a balling-ass nigga everybody hates\nRolling in the town with a pound straight dropping weight\nBlowing up like dynamite\nSelling weed, yey, angel dust, hop, and China white\nFuck it, you're making duckets, never riding buckets\nPlaying punk bitches like puppets\nYo, but there's a lot of fake counterfeit macks\nPlaya hating on they homies trying to dry cat\nTo look good for the hoes, man these niggas ain't joking\nBoy, you get that ass smoked in Oakland\n\nChorus\n\n[Boots - spoken]\nAw yeah, The Coup is up in here, and we be talking about the\nReal. Motherfuckas know that we know, that they know, that we\nKnow the deal. Now the originality of our principality is that\nWe don't play the pimp. But the reality of our locality, and\nYou'll learn this gradually, is that motherfuckas do this shit\nTo pay their rent. But here's a hint: how we gonna get it straight\nWhen we bent? Shit, see I ain't never had shit but my stripes\nAnd my game and my life, and all them's just hand downs from my\nGrandaddy. Yeah, I'm living large kidding with Ant Banks, but I'm\nStill hustling food stamps for my candy apple red Caddy. Alright...", "year": "1994-06-14"}]}