{"songs": [{"lyrics": "[Verse 1: Ice Cube]\nHere's a little something about a brotha like me\nNever shoulda been let out the penitentiary\nIce Cube would like to say\nThat I'm a crazy motha from around the way\nSince I was a youth, I smoked weed out\nNow I'm the type of punk that you read about\nDoin' a crime or two, that's what the hell I do\nYou don't like how I'm livin well [garbled]!\nThis is a crew, and I'm in it\nMy man Dre'll knock you out in a minute\nWith a right left, right left you're toothless\nAnd then you say -- damn they ruthless!\nWe'll make you say it again [damn]\nN.W.A's messing up the program\nAnd then you realize we don't care\nWe don't just say no, we're too busy saying: \"Yeah\"\nAbout drinking straight out the eight bottle\nTell the truth -- do I look like a role model?\nTo a kid looking up to me\nLife ain't nothin but girls and money\nCause I'm the type of brotha that's built to last\nWe had some in the present, some in the past\nBut I don't give a damn cause I keep bailing\nYo, tell em what they yelling\n\n[Hook]\nGangsta gangsta, that's what they're yelling\n(It's not about a salary, it's all about reality)\nGangsta, Gangsta\n(He'll tell you exactly how he feel, and don't want a thing back)\n\n[Verse 2: Ice Cube]\nHomies all standing around, just hanging\nSome dope-dealing, some gang-banging\nWe decide to roll and we deep\nSee a sucka on Daytons and we creep\nReal slow, and before you know\nI had my AK pointed in the window\nCheck it in, punk, or I might blast\nHe got scared and hit the gas\nWe tried to catch him, but you all know\nYou can't catch a five point oh, so\nWe headed right back to the fort\nSweatin’ all the girls in the biker shorts\nWe didn't get no play, from the ladies\nWith six thugs in a car are you crazy?\nShe was scared, and it was showing\nWe all said [garbled] and kept going\nTo the hood, and we was fin to\nLook for somethin’ else to get into\nLike a new female, or in fact\nA bum rush, but we call it rat pack\nOn a sucka for nothin’ at all\nIce Cube'll go stupid when I'm full of eight ball\nI might stumble, but still won't lose\nNow I'm dressed in the county blues\nCause I'm the type of brotha that's built to last\nWe had some in the present, some in the past\nBut I don't give a damn cause I keep bailin'\nYo, tell em what they yellin'\n\n[Interlude: Dr. Dre (MC Ren)]\nWait a minute, wait a minute, cut this\n(Man whatcha gonna do now?)\n\"What we're gonna do right here is go way back\"\nHow far you goin back? \"Way back\"\n\"As we go a lil somethin like this\"\n\n[Ice Cube]\nHere's a lil gangsta, short in size\nA t-shirt and Levi's is his only disguise\nBuilt like a tank yet hard to hit\nIce Cube and Eazy E [Dre:] cold rockin' it\n\n[Verse 3: Eazy E (MC Ren)]\nWell I'm Eazy E the one they're talkin about\nSucka tried to roll the dice and just crapped out\nPolice tried to roll, so it's time to go\nI creeped away real slow and jumped in the six-fo'\nWith the \"Diamond in the back, sun-roof top\"\nDiggin' the scene with the gangsta lean\nCause I'm the E, I don't slang or bang\nI just knock suckas out like it ain't no thang\nAnd all the ladies, you know I'm talkin to you\n\"We love you Eazy!\" Yeah, I love you too\nBecause you see, you know I gotta be legit\n(So let me tell you stupid suckas who you're messing with]\nCause I'm the type of brotha that's built to last\nWe had some in the present, some in the past\nBut I don't give a damn cause I keep bailin'\nYo, tell em what they yellin'\n\n[Hook]\nGangsta, Gangsta, that's what they're yelling\n(It's not about a salary, it's all about reality)\nGangsta, Gangsta\n(He'll...up you and yours, and anything that gets in his way)\n\nGangsta, Gangsta, that's what they're yelling\n(It's not about a salary, it's all about reality)\nGangsta, Gangsta\n(He'll just call you a low-life mother..., and talk about your funky ways)", "album": "Straight Outta Compton (Clean)", "year": null, "title": "Gangsta Gangsta (Clean)", "image": "https://images.genius.com/cf6cbda0b09812dba8e939e35431c042.1000x1000x1.jpg"}], "artist": "N.W.A"}