{"artist": "WC", "songs": [{"year": null, "lyrics": "[Chorus: P. Dot]\nWhen them guns goes off, we be ready for war\nWhen them guns goes off, bitches hit the floor\nWhen them guns goes off, and them sirens roar\nBetter get that money, and be out the door\n\n[W.C.]\nRacket, racket, comin' out of the back end\nDead at you, he throwin' the hot lead at you\nSwang affiliate, X.O. sip, a gold getter\nWith the rest to gather, my cold killer\nIt's \"Me Against the World\" like 2Pac\nAnd like Biggie, I'm \"Ready to Die\" for what you got\nGot a crew with killas behind me, I'm grimey\nI'm one of the big body, blowin' cushions where you can find me\nFor figures, we bust triggers, who could fuck with us?\nDub, E-40, Christ Bearer, plus RZA\nStick you with the Blade, we gots to get paid\nAnd for the moolah, we intertwine like French braids\nAnd I can't fight the feeling like one way\nWhen it comes down to this gangsta shit and gun play\nFor the loot, we compute it, quick to shoot it\nSo hit the switch, punk blew it, and bang the music\n\n[Hook: P. Dot (The Reverend William Black)]\nI don't care what it takes, we gon' make it\nThey say the chains too strong for us to break it\nWilling to do what it takes for us to make it\nAnd we can overcome anything we faced with\n(We are soldiers after all, down by honor we won't fall\nAfter all, all, all, all, all....)\n\n[Christ Bearer]\nWhen them guns go off, bitches hit the floor\nOr then forty four slugs gonna hit you, ho\nI don't care what it takes, I pull out a gear\nFuck the snakes, and Kurtis Blow with The Breaks off\nArtie Murphy and the Petty Coat Junction\nGet two thirty off the head with cold dumplings\nNiggas jump when the AK bark\nCrystal grip pump, make the gun niggas spark\nYou dig? Niggas ready for war\nBeen carryin' the world for so long, it ain't heavy no more\nAnd even when the sirens roar, I taught the violence gore to start firing more\nAnd when we run out of bullets, and you still want static?\nI grab the three eighty and pull out the automatic\nWe better get the money, for shootin' Mossbergs and Beretta's\nNiggas ain't shit funny, when it comes to a brawl\nSuckin' Northstar, trippin' in\nGuns go off, y'all know y'all strippin'\n\n[Hook: P. Dot (The Reverend William Black)]\nWilling to do what it takes for us to make it\nAnd we can overcome anything we faced with\n(We are soldiers after all, down by honor we won't fall\nAfter all, all, all, all, all....)\n\n[E-40]\nLook out peon, we might of lost the battle, but we won the war\nI grab a bullet, travel, bodies hit the floor\nCan't be scared of your shadow, you gotta have heart\nKillas on my soil, will turn off the lights and park\nGet out the car, unlock, fill out the chopper and let it chop\nWalk off like nothing happened, give a fuck bout a cop\nTouch you with the Blade, take off your toupee\nPut my dirt in your Glocks, sometimes I do my dark in the day\nMy momma didn't raise no sick, she raised a beast\nAnd I can't rest til my enemies rest in peace\nThe bigger they are, the harder they fall\nRun up on me, I'ma knock the hell outta y'all\nMy back against the ball, strappin' and jackin', I'm puttin' hands on 'em\nOne hitter, quitter, bob & weavin', karate stance on 'em\nDance on 'em, ran on 'em, and land on 'em\nPut my brand on 'em, stand on 'em, because I can on 'em\n\n[Chorus]\n\n[Hook]", "image": "https://images.genius.com/3c05b0eb613f54120a931d9f74d63a50.500x500x1.jpg", "album": "Blade: Trinity O.S.T", "title": "When the Guns Come Out"}]}