{"artist": "Asher Roth", "songs": [{"title": "Lion’s Roar", "image": "https://images.genius.com/530d3219cbffab25c91a88faa96b0d3a.475x475x1.jpg", "album": "Asleep in the Bread Aisle", "lyrics": "[Asher Roth]\nPretty girl, you know that you so hot (hot, hot-hot)\nHow about I take you to my spot? (spot, spot-spot)\nWe can take off all our clothes, evoke our animal\nYou hear my lion roar, head high, eyes closed\nYou begin to describe all things we do in a big big bed in an empty room\nLook at you on me then me on you with a warm washcloth and a few ice cubes\nDid it get so wet? No I'm at my best when I make you sweat\nReady now get set cause you get no rest\nI'mma smack that butt, I'mma grab them breasts\nYeahhh, tell me what you like (like) can I scratch and bite? (bite)\nWe can scratch that fight (fight) make it last all night\nSlidin on your side and curves, satisfy the primal urge\nRidin on you back and forth, that's how you make my lion roar\n\n[Hook: New Kingdom]\nHead high, I'm low\nHear my, lion roar (ooooh)\nLion roar (ooooh)\nHead high, I'm low\nHear my, lion roar (ooooh)\nLion roar (ooooh)\n\n[Asher Roth]\nYeah yeah...\nOn the mic I'm a beast, I'm a big bad beast\nI could speak that heat, I don't need no reason\nJesus, them big teeth you be feedin\nBetter leave now, I'm 'bout to be eatin\nEven you stick around and we beatin\nBleedin, have him laid out on the cement\nBreathin, I had him back in your team and\nLeave in peace and have a safe evenin\nBeef is not what I like to do\nSpeakin just to enlighten you\nTeach him a rhyme and preach in the mind and\nA beautiful thing keep fightin through\nJust how big's the fight in you? Tight and high and mighty or\nA lighty, hide your heiny when a giant hasn't frightened you (you)\nLook in my eyes (eyes) you see my pride? (pride)\nYou see the fire (fire) burnin down the side\nWill and drive'll make a man, doin what you say I can't\nOh you think I'm playin? Well let's see just what you made of then\n\n[Hook]\n\n[Busta Rhymes]\nBusta Bust and I'm back on my BULLSHIT NOW!!\n\nC'mon! Got to make you wanna jump jump jump\nAnd I come with another banger and I know you wanna bump\nCap and gown when I smack you down\nAnd I graduated homie bangin in the trunk\nPut yo' hands where my eyes could see\nLet me take this thing to where it really need to be\nOne-two-three, let me take time\nTo remind y'all that you can't fuck with me\nShake yo' ass on the way to the flo'\nIn the dungeon drinkin and the lions roar\nAll my little mamis come to the crib\nLet me pound on the coochie until it gets sore\nThen I laugh and cough when I flash and floss\nMoment when I get cash as a boss\nAsher Roth, I'm comin too\nCause I heard that you got a lot of ass in the loft\nSee I ain't playin mister\nI'm 'bout to twist your sister\nThat's how we do it killer, yeah!\n(Lion roar) Yeah! (Lion roar)\n\n[Outro: Asher Roth]\nThat's when I let my lion roar (lion roar) x6\n(Lion roar.. lion roar.. lion roar)", "year": "2009-04-20"}]}