{"artist": "Fashawn", "songs": [{"year": null, "album": "Champagne & Styrofoam Cups", "image": "https://images.genius.com/09dcf1a0e7f7a1c4eac047d2fc35bd69.500x500x1.jpg", "lyrics": "[Verse 1]\n\nMaybe cuz we gotta deal with all of this pressure\nTryna do what's expected\nNo longer an adolescent\nConfident when you steppin'\nHard to be calm and collective, when you constantly stressin'\nOver dollars and debtin'\nYour mind is congested\nYou rather hop on the train, leave the block for a day or two\nMan, stop playin' games\nAin't no one in your way but you\nBe a man. life ain't no cartoon, Peter Pan\nFeed your fam\nMinors to major leaguers, we advance\nStill saggin' my jeans, like I'm back in my teens\nFeelin' like a maniac, at least that's what it seems\nI'm an addict, a fiend, with a habit to dream\nLike I can have anything, no elaborate scheme\nJust a palace for the king, i'm going to far again\nSame apartment, same khaki's, same cardigan, FUCK\nIt feel like I got a knot on my brain\nAin't nobody to blame, can't let it drive me insane\nHear that?\n\n[Hook: Kobe]\n\nYeah, it's gotta be another way out\nCan you help me find my way out\nI'm feeling like I'm living to die, I'm tryna survive\nYeah, it's gotta be another way out\nCan you help me find my way out\nI'm feeling like I'm living to die, I'm tryna survive\n\n[Verse 2]\n\nMaybe cuz we gotta deal with artist deception\nNiggas who call you brethren\nBut wouldn't visit your deathbed\nWomen all need affection\nLoyalty up for questionin'\nNever know they objective\nIt's better to just neglect it and finish your breakfast\nBut the temperature risin'\nTrying to prevent being violent\nProbably better off in an asylum\nGot a list full of problems\nAnd a brain full of distractions\nWhen you listen, you just get static\nCouldn't picture this happening, huh?\nNow, it's real. Can't explain\nHow it feels\nPray to God, on yo' knees\nNow and then you gotta kneel\nEven G's, what you mean?\nMy head full of scene\nI'm indeed, in need of some space\nCan I breathe?\nYa'll please, do the same\nI been trained, put everything in perspective\nHow you plan to make a comeback\nWhen you never made an exit\nI suggest that you take it one day at a time\nThere's no escaping, unless you walk away from your mind\nAnd that's why....\n\n[Hook]\n\n[Outro]\n\nMovin' on man, you know who else you need to do a record with? Wiz California. Man, that baby right on, man!\n\nRight, right, I actually have records with Wiz Khalifa\n\nYou say you did a record with Wiz Khalifa?\n\nIt's Khalifa, yeah\n\nWell you need to work with the nigga Wiz California. He good too. And he more humble than all ya'll niggas!", "title": "Living to Die"}]}