{"songs": [{"year": "2004-06-15", "title": "The Scientist", "image": "https://images.genius.com/5b24b6cf31321d7d04a5e1c4405d5ccc.400x400x1.jpg", "lyrics": "[Intro: Q-Unique]\nAt the end of 2003, an estimated 42 million people worldwide were living with HIV and AIDS. 70% of these people, that's 29.4 million live in South Africa\n\n1975 they created AIDS inside a laboratory!\n\n[Verse 1: Sabac]\nI'm preparing a technical experimental chemical event\nThat will affect your ventricles fluid collected in your testicles\nBloodstream and genitals causing grieving and pain\nLeaving you braindead, heathen bleeding squeezing your veins\nIn these days of [?] power you’ll never suspect the doings\nOf another prized scientist to project and ruin\nPeople’s lives with diseases that only affect humans\nYou can’t find the cure in animal testing or transfusions\nMan, I can’t wait, this feeling is great\nI can’t believe how much the government is willing to pay\nI start killing the gays, Latins, black and white trash\nThen the young folk and just hope there won’t be a backlash\nI'll laugh last on the paths that minimise population\nGod forgive me for how quickly people die from my creation\nI’m debating whether or not to withhold the only cure\nKill more people than the evils of the World and Holy War\n\n[Interlude: Q-Unique]\nAn estimated 5 million new HIV infections occured worldwide during 2003, that's 14 thousand infections each and every day\n950 thousand US residents are living with HIV and AIDS, 25% are unaware they are infected\n\n1975 they created AIDS inside a laboratory!\n\n[Verse 2: Sabac]\nTaught to implement disaster, take something used a lot\nProof I got started with the common use of booster shots\nThose who not believe, this disease will damage the completion\nOf immune system [?]\nSee me leak and discharge, got you speaking mish mash\nThis God's way of teaching demon's not to lean in his arms\nSexual behavior plays a major role in your survival\nI will give you what you get when you disrespect The Bible\nI'll do anything to kill the fags, niggers and [?]\n[???]\nSick for life is the effect\nNothing can find to protect you\nThere's no stop for what I'm plotting\nWhat I'm pumping might infect you\n\n[Interlude: Q-Unique]\nIn 2003, approximately 6 thousand non-adults became infected with HIV\nApproximately 40 thousand new HIV infections  occured in the United States\nHalf of those infected people are younger than 25 years old\n\n1975 they created AIDS inside a laboratory!\n\n[Verse 3: Sabac]\nI'm leaking lethal sin, people dying out at rapid rate\nMy tactic straight, my teach is [?] to preserve the master race\nCaskets wait to be filled by the patients it kills\nFool you will think you be cured by taking some pills\nAffecting the world, even the people you watch on TV\nThe Liberaces, Freddy Mercuries and Eazy-Es\nIt's to lead world panic, my antics are so climatic, synthetic CD for [?] dramatic\nMan, you can't combat it\nTaxes increase, [?] and come with answers\nBring the message, self awareness, but people are dumb and careless\nFail as ones, be infected in the time that least expecting\nNeglecting the truth leaves you [?]\nNothing support denial [?] in your brain leave you believing for some reason that this disease is contained\nDeath toll is far from retro, don't think it won't affect you\nWhich is peeking, so keep sleeping and then one day come and get you\n\n[Outro: Q-Unique]\nAs for December 31st, 2002 an estimated 501,669 in the United States had died\n\n1975 they created AIDS inside a laboratory!", "album": "Sabacolypse: A Change Gon’ Come"}], "artist": "Sabac"}