{"artist": "Cappadonna", "songs": [{"title": "Money, Cash, Flows", "album": "The Struggle", "year": "2003-10-23", "image": "https://images.genius.com/f7a7e9bd3d16cfdfd266ae989d07c7b8.500x500x1.jpg", "lyrics": "[Intro: Lounge Mode]\nWalk with us... Code:Red, speak up\n\n[Lounge Mode]\nI'mma set it from the front of the door and let it be known\nThat I'm, settin' it straight and I'm comin' back home\nCuz I told ya'll, the tank top hustle a lot\nBut I'm a little dude and I still muscle the block\n\n[Crunch Lo]\nAiyo, we comin' for the blocks, the aves and the streets\nThe team stay on the grind cuz the fam gotta eat\nDimes get bagged and sealed like it was work\nAnd ain't nothin' safe get ya teflon shirt\n\n[Remedy]\nStreet life, drugs shit, money comes in bundles\nThug shit, and terratorial rumbles\nGuns and in vintage, Don sweaters\nWe love phat whips, exotic bitches, new Code:Red leathers\n\n[Cappadonna]\nAiyo, my hood hate theyself\nThe bitches love Don', cuz they mate theyself\nAnd niggas can't snake me, so they snake theyself\nAnd they just pussy to me, they rape theyself and they take theyself\n\n[Chorus: Cappadonna, Lounge Mode, Remedy, Crunch Lo]\nMoney, cash, flows and bitches\nMoney, cash, flows and bitches\nMoney, cash, flows and bitches\nMoney, cash, flows and bitches\n\n[Crunch Lo]\nAiyo, it's busy on the strip and they ain't too much rule\nSo how many M.C.'s must I consume?\nOpen up a nigga like a pussy womb\nSo nigga, call ya orangutang Goons and baboons\n\n[Remedy]\nWho the fuck are you? That'll crew with me and two\nMaybe more, can't come, fuck, kick down your door, son\nYou can have beef and not know it\nSome gas in a bottle with a rag, then light it and throw it\n\n[Cappadonna]\nWe love, grindin' the honies and makin' the moneys\nToss it up, lovely, breakin' the twenties\nAnd broke crews for a rap song, bakin' the sunnies\nLay back lovely, shakin' the bunnies\n\n[Lounge Mode]\nIt's the reason why they put me here, to blast off\nCuz the rap game suck and I'm ready to crash course\nWith an O-1 'Rari, smoked and tinted\nWho you know that shoot best when he's smoked and bented?\n\n[Chorus: Cappadonna, Lounge Mode, Remedy, Crunch Lo]\nMoney, cash, flows and bitches\nMoney, cash, flows and bitches\nMoney, cash, flows and bitches\nMoney, cash, flows and bitches\n\n[Remedy]\nYo, I'll jump in my whip, yo and run you over\nPass the weed and the Dutch to the ciga-r roller\nFrom the Stat', with the shoulder strap holder\nFuck Beans, fuck Free, fuck The Roc and Hova\n\n[Lounge Mode]\nFuck the cops and The Roc, I'mma do whatever\nI come through rock a little wear, shoot who ever\nIt's a Struggle, that's why I told ya'll I bubble\nBuck a thing, bust a thing, if you see I'm in trouble\n\n[Crunch Lo]\nAiyo, I spit like a baby, a dog with the rabbies\nBowlin' hot gravy, get spilled we too ill\nWith the pill, emphatic slam\nCrunch to the Lo, to the rap, from the Stat's who I am\n\n[Cappadonna]\nCode:Red Entertainment\nI'm not just a client, I'm also acquinted\nReal respect real and it's all non-tainted\nHandcuffed in the courtroom, bitin' the plaintiff\nRun from the arraignment\n\n[Chorus: Cappadonna, Lounge Mode, Remedy, Crunch Lo]\nMoney, cash, flows and bitches\nMoney, cash, flows and bitches\nMoney, cash, flows and bitches\nMoney, cash, flows and bitches\n\n[Outro: Lounge Mode]\nYeah, man, aiyo Slash\nYou tell Jay, right, that we gon' get this joint poppin' right\nLo gon' come with us in a minute, call Shockey up\nAnd then we gon' rock it out, knawhatimean?\nSo, just in case, you got bucked, you make sure he got that thing\nAnd we gon' move, let's go baby, right here, move.."}]}