{"songs": [{"year": null, "title": "Swang", "image": "https://images.genius.com/8ec7b3fd691b6f406a5ab62708b7b991.600x600x1.jpg", "lyrics": "Yeah\nSammy Adams\nSwing your drank, but if you ballin' swing that bottle\n\nYeah\n[Hook]\nSwing a drank if you balling swing a bottle\nWe up in the club get your girl back tomorrow\nCause we get it poppin' only hitting models\nIf you ain't a ten get your hands off my bottle\n\nI'm up in the club chillin' with a couple twelves\nBottles of the Goose rollin' up a couple L's\nHeaven bound? I don't know, I might go to Hell\nCause you know I'm a sinner. Baby girl you couldn't tell?\nNow I'm a get my mind, get my mind, get my mind right\nHard to not be the man, catch me in the limelight\nCatch me at my table standing on the joint\nTwo chords and my mic and my mac are connected like cable\nShorty swing your drank to the side then drop it\nI can fill you up my supply's not stopping\nCause we hit the club and it's just like shopping\nAny bottle that you like, girl go cop it\n\n[Hook x 2]\nSwing a drank if you balling swing a bottle\nWe up in the club get your girl back tomorrow\nCause we get it poppin' only hitting models\nIf you ain't a ten get your hands off my bottle\n\nYeah\nV.I.P. and your girl's trying to roll\nShe's about 26, chick you a little old\nNot to mention that you only care about my dough\nOr the fact that I can spit it any stage, any show\nWe livin' in a world that they say is so cold\nBut life's good baby cause my champagne gold\nMy girls stay hot when the wintertime goes\nAnd they all know who they are they ain't nothing if they don't\n[?] shoes with a black dress matching\n3 bottles poured up call that a hat trick\nYeah\nJust wanna see you jump till your knees can't bend\nMy entourage deep so you need your friends\nHop up in the Beem with the two [?]\nPlus four on the rims\nThat's what we be in\nLike what you see? Baby please come taste it\nNot a Jersey boy but I am the situation\n\n[Hook x 2]\n\n[Bridge]\nSwing your drank, swing your bottle (Swang, Swang)\n[X4]\n\n[Hook x 2]\n\nUh\nSee our bottles never run out\nMaybe your drinks do\n(Hahaha)\nThat's why we got bottle service baby\nAll night\nOh yeah", "album": "Boston’s Boy"}], "artist": "Sammy Adams"}