{"artist": "Cage", "songs": [{"title": "Radiohead", "album": "For Your Box", "year": "1997-01-01", "image": "https://images.genius.com/a6aca3eb5aae1296ebfa9d51f15e38af.600x381x1.jpg", "lyrics": "(I'm a Radiohead, I'm a Radiohead)\n\nComing this winter, straight jackets by North Face\nTour’d 3 all girl schools and could spit out how each whore taste\nRecord shops'll see more fiends than a Detox\nWhen Cage shit drops, like LSD blots\nYou can't handcuff what you can't snuff\nBefore your body's embalmed I dipped the philly for a puff\nKeep your eyes peeled - make sure your teams packing the Glocks kids\nPour disinfectant in they ears I'm speaking noxious\nAlex the baby came after after birth\nI ain't been straight with God since he dropped my ass on Earth\nYou gonna burn for that!\nThen burn me right now Paul\nMy scalp still wears a scar from that lobotomy seminar\nCan't help but act out, when I black out\nI push my brother's eyes in then I kicked them back out\nYou kids trying to blast at me better learn to shoot straighter\nPremature brains get cooked up in the incubator (pssssss)\nPage 67, Paragraph 2\nShow precision in your ‘how to skin MC’s alive manual’\n\nI'm a Radiohead, getting open 'til I'm brain dead\nThen I'm getting open 'til you brain dead\nI'm a Radiohead, getting open 'til I'm brain dead\nThen I'm getting open 'til I brain dead\n\nI was possessed by Dionysus\nKicked outta highschool for giving paps smears of crisis\nCold-type ciphers\nI burn motherfuckers 'til the fume kicks\nWatch me fuck them four Craft bitches to death with broom sticks\nSweeping with chicks, lacing up dicks, getting lovely\n'Til I'm spaced out roughly like Martians playing rugby (aha)\nSee a vigilante, shoot him 'til his heart stops\nAnd send his eyes to the cops in a box for crime watch\nSlipped out the snatch, wipe my face clean of the crap\nThat's been holding me back since minus 9 months my leaky sack\nBlind ya!\nT. EC. Behind ya!\nWho could undermine the?\nSickest of intelligence to find ya!\nThe VAGINA RE-DESIGNAH\nGet you opened out your mind ya\nSent to death trynna slide out your own spine ta\nFind a life where your cock's treated like Christ\nAnd every cunt from up the block will beg forgiveness from your sex device\n\nI'm a Radiohead, getting open 'til I'm brain dead\nThen I'm getting open 'til you brain dead (x2)\n\nObnoxious crotches\nSmack they ass 'til skin blotches\nMail bombin'\nWeather from Holland\nStill smilin'\nFishburne like Lawrence\nAgent Orange\nRevived a victim then locked her in cold storage\nAte a pussy popped\nStumped her under vulture nigga blocks\nAnalyze the blood clots, before greater body rots\nFactual photo: puss pierced shut\nSeared slut Josie\nUsed to take facials mostly\nGang this bong\nWhile I pick that Lionel Ritchie afro cunt out all night long\nI'm into like... (fffff) altering my perception\nEmptied a clip in my reflection for looking my direction\n\nI'm a Radiohead, getting open 'til I'm brain dead\nThen I'm getting open 'til you brain dead (x2)\n\n(I'm a Radiohead, I'm a Radiohead\nThe nasty Agent Orange is comin'\nBright and early in the mornin'\nWith the Necro coroner behind drumin'\nOn the severed headpiece of your woman)"}]}