{"songs": [{"year": "2012-03-05", "image": "https://images.genius.com/c827d7823eca2625dae750eca362369f.320x320x1.jpg", "title": "4EvaNaDay (Theme)", "album": "4eva N a Day", "lyrics": "[Chorus]\nThey said it couldn't be forever, wouldn't be forever\nThe grain ain't enough, you gotta mix it with the leather\nYour grind ain't enough, you gotta mix it with the hate\nWhen it's all over what would I say?\n4eva n a day, day, day, day, day, day\n4eva n a day, day, day, day, day, day\n4eva n a day, day, day, day, day, day\n4eva n a day, watch what I say\n4eva n a day\n\n[Verse 1]\nMy momma say \"What's up Big, how ya feel?\"\nI dedicate this to them haters that's in my grill\nThem doubters and them non-believers that said I wouldn't\nAnd them A&Rs when I spit them bars that said I couldn't\nAnd them bourgie broads that wasn't fucking when I was broke\nNow they squeeze by to the V-I so I can jump down they throat\nI put it on the line and do what I love and above all have hope\nThat it was meant for me and it was meant to be then it'll pay off like it's s'posed\n\n[Chorus]\nThey said it couldn't be forever, wouldn't be forever\nThe grain ain't enough, you gotta mix it with the leather\nYour grind ain't enough, you gotta mix it with the hate\nWhen it's all over what would I say?\n4eva n a day, day, day, day, day, day\n4eva n a day, day, day, day, day, day\n4eva n a day, day, day, day, day, day\n4eva n a day, watch what I say\n4eva n a day\n\n[Verse 2]\nThey tryna say that I switched up, but most of them niggas done bitched up\nIf you ain't 'bout your own people, what you gon' raise your fists for?\nOld school with them kickers, like karate feet, my money stretch like Pilates be\nIf you never been to the top it's something that you gotta see\nSomewhere that you gotta be, I never dealt with the lames\nKnock on wood but I'm hella good in this candy paint\nNo time to waste, keep my pace, forever still\nWorry about you and how you live, I did it big, I hurt they feelings\n\n[Chorus]\nThey said it couldn't be forever, wouldn't be forever\nThe grain ain't enough, you gotta mix it with the leather\nYour grind ain't enough, you gotta mix it with the hate\nWhen it's all over what would I say?\n4eva n a day, day, day, day, day, day\n4eva n a day, day, day, day, day, day\n4eva n a day, day, day, day, day, day\n4eva n a day, watch what I say\n4eva n a day\n\n[Verse 3]\nI dedicate this third verse to all the candy coaters and the slab riders\nRecord breakers that did mad favors when they knew no one ever heard about us\nAnd them playa pimps, Chevy donks that crank the thump 'til the trunk beat\nCross love from a bad broad that jump in cause she fuck with me\nIn the hood selling CDs cause they showed love at the Mom & Pops\n'Til I sold em all even when my buzz was small and still chose to cop\nFact remains that I’m still the same and I’ll never change or settle\nCause I ain't tripping on mainstream cause love from the underground, that's forever\nNow, that's forever\n\n[Chorus]\nThey said it couldn't be forever, wouldn't be forever\nThe grain ain't enough, you gotta mix it with the leather\nYour grind ain't enough, you gotta mix it with the hate\nWhen it's all over what would I say?\n4eva n a day, day, day, day, day, day\n4eva n a day, day, day, day, day, day\n4eva n a day, day, day, day, day, day\n4eva n a day, watch what I say\n4eva n a day"}], "artist": "Big K.R.I.T."}