{"artist": "Gangsta Boo", "songs": [{"title": "Miss Dot Com", "album": "Forever Gangsta", "year": "2010-11-19", "image": "https://images.genius.com/325cb9fa7e5102929da5685efe619ec7.500x500x1.jpg", "lyrics": "[Intro]\nI'm gonna have the Internet going nuts with this one\nYour girl Gangsta Boo, the Queen of Memphis, is checking in\nY'all already know what time it is\nI'm bringing you that brand new dot com\nGangsta Boo, a.k.a. Miss Dot Com\nCause I'm tired of these hoes hating on me dot com\nIt ain't fuck Gangsta Boo dot com\nIt's fuck you, bitch, dot com\nHit me up on Twitter at GangstaBooQOM, Queen of Memphis, dot com, bitch\n\n[Hook]\nI'm the shit dot com\nYou boys wanna fuck me dot com\nCause my booty is so juicy dot com\nNails fixed dot com, hair fixed dot com\nAnd I got a Gucci bag full of tricks dot com\n\n[Verse 1]\nYeah run Forrest run, yeah run and tell that\nAll you talking-ass hoes wanna talk behind my back\nI'mma call you chatterbox dot com\nBlah blah blah blah blah dot com\nYou hoes need a new name\nI'mma call you whisper dot com\nAnd you can't touch a fucking picture dot com\nI mean, you hoes love me\nYou really just mad cause your dude wanna fuck me\nYour pictures looking ugly, girl; your tummy getting chubby\nMy tummy getting fat cause I'm getting ton of money dot com\nLife's a bitch dot com, but it pay the bills\nI'm Mrs. Dot Com, you know what it is\nI'm at your leave, please believe dot com\nTry me if you want to, it's whatever dot com\nI'm the queen of this game, you know the name dot com\nGetting money ain't a thing; where the dollars dot com\n\n[Hook]\n\n[Verse 2]\nI bring the heat, I bring the heat dot com\nYou wanna try me, you will get defeated dot com\nThey fuck with me so greatly in the streets dot com\nCause they know I'm Gangsta Boo, I'm really sweet dot com, hey!\nI'm on they level dot com\nI keep it so real while you fake it dot com\nI'm riding in the new bently truck dot com\nRed hair don't care while the other bitches blond\nMy pussy be the bomb dot com\nHe wanna pay my rent dot com\nThe way I ride his dick dot com\nYeah, I know I make you sick dot com\nReal ass, real big tits dot com\nWebsite be booming dot com\nSelling naked pictures dot com\nAnd I always get it in a lump sum\nI'mma give you what you want dot com\nI'd rather count money not sheeps dot com\n\n[Hook]"}]}