{"songs": [{"year": "1998-10-06", "image": "https://images.genius.com/408f7ad14b984b84913605cf7b4b6645.500x500x1.jpg", "title": "Mr. Majesty II", "album": "Heaven’z Movie", "lyrics": "(Crowd cheering)\n\n[Mr. Majesty]\nThis is Mr. Majesty representin' on behalf of the 7th Sign Regime (Laughs)\n(Yea, yea, yea, 7th Sign Regime representin')\n\nThunderstorms when they mourn fallen angels\nMental methodical mind, niggas wanna tangle\n365 I'm live at every angle\nMental methodical mind, niggas wanna tangle\n\nEverybody knows 7th Sign got the hoes\nEverybody knows we divine wit' the flows\nShouldn't have to tell you when it rains wear your coat\nIt's thunderstoms because we mourn the dope\n\n[Mr. Majesty]\nManipulatin' metaphors I take full credit for\nYou can rest assured you'll never more suffer through flaw\nYou can steady toughen the law;\nThey'll be harder criminal brushin' the shores\nTuck in your jaw\nIf your confidence is lower, minus lead blower\nSinus flaired to the smallest odor\nTried to get open but just a file folder\nNext man style holder, weightless chest a tasteless death\nI'm compound to be a sound souljah\nOn tracks compact, bolder abstract flava\nDrift like the mist holdin' a black fist with right shoulder\nAddition to the culture went fishin' with these vultures\nEnlistment predicted to be held over\nHired wired cobras to work front desk, smoke\nDress the dress, pure moist no choice but to be less\nHis ploy to decoy the congress, skills\nToo broke to pay homage\nIn a craft he shows his ass, in a trash conglomerate\nHad your staff astonished precise math, most dominant\nSwitch\n\n[Mr. Majesty]\nEnchanted romantic mechanics will banish\nNo talents damaged in fragments unbalanced and silenced\nStompin' the housing, crowdin' kids\nThat's pounding playgrounds and courts\nWhere small missiles went through\nSo often a sport on the wrong course trailing the horse\nRaps biggest divorce needs figures\nFor me, my niggas: weed, food, and cloth\nWhen the greed mood falls off\nThe danger remainder is a hard rock slagged soft\nWalked past slop almost crushed by a bus\nNot lookin', in a rush, might have been a mascot for\nI.H.O.P. as human slush, keep it lower than hush\nThe diploma for lust and slight comas\nWhen I bust and then again works skins to heavy musk, everready cuts\nCoincidentally is simply a mystery melody rush\n\nThunderstorms when they mourn fallen angels\nMental methodical mind, niggas wanna tangle\n365 I'm live at every angle\nMental methodical mind, niggas wanna tangle\n\nEverybody knows 7th Sign got the hoes\nEverybody knows we divine wit' the flows\nShouldn't have to tell you when it rains wear your coat\nIt's thunderstoms because we mourn the dope\n\n[Mr. Majesty]\nPercussion rushin', crushin' the sounds\nThe inner raggamuffin', got me bustin' them down\nA nine milli really make a nigga worship the ground\nPreparering kings, courtship is now\nIgnite torch for sundown\nQuiz of a ninja disguised as a stupid nigga\nThis biz will injure the unwise and traumatize offenders\nWhite lies turn shades of gray like skies in November\nAt the brink of dismay\nMy eyes will never flicker\nHerbs, got the nerve to pray when the city gets sicka punks\nIntellectually drunk with butter flies in their liver\nHave no ties to the beginning\nCold fries, but I've put in work for dessert and dinner, no perks\nIncentive: soul search the whole earth extensive\nHad a low chirp, slow birth in placenta\nIncubated and escalated to contender\nPushin' through gush waitin' for air on mush\nNow sexually molest ovaries, finessed\nLocally approach me with respect and royalty - Majesty\n\n\"And after this you'll call me Your Majesty'\"\n\nMotion sicknes prevents the wickedness from overseas magnificence\nNo talents with instruments\nBut the choke-hold vocals compensate the difference\nSociety full of menaces - abnormal residents\n\nIt's like I'm floatin'\nI think I'm floatin'\nGot me open, I guess I'm floatin'\nNo jokin', I'm movin' as my words are spoken\nA vibe in groovin', lightening movement\nI feel so exclusive"}], "artist": "Bizzy Bone"}