{"artist": "Fat Joe", "songs": [{"year": "1993-07-27", "album": "Represent", "image": "https://images.genius.com/74218f34fc7a7f477441922b9caced21.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah!\nCheck it out, check-a-check-a, check it out\n\n[Verse 1]\nWould you believe that Fat Joe would flip a style like this?\nI can't get played, cause I roll with Baby Chris, nevertheless\nNiggas be tryin' to front the role\nWhen everybody knows, I'm gonna go gold\nAt least, kickin' the funky styles that you wanna hear\nJoe is bigger and better, so have no fear\nI'll be rippin' the mic, clockin' dough, stickin' the hoes\nAfter every single show, you know (Know)\nOne of the best to grab the mic so don't try to front\nAin't nuttin here yours, so what the fuck you want?\nWhen I step on stage, I'm second to none\nMakin MC's run, without the use of a gun, yeah\nTalkin' about the way I rock a party\nNiggas must be thinkin' that I'm high or drunk on Bacardi\nI be hippin' and hoppin', rockin' and shockin', the whole rap scene\nI'm mean, my favorite color is green\nI guess that's why they call it the blues\nYour money you lose 'cause you choose to disrespect and neglect\nThe skills of the Fat one, but I'm all that, son\nGimme the microphone and I'ma show you how it's gonna be done\nSo don't fake moves 'cause I never fall\nThat's how I'm livin'\nHey yo, I'm livin' fat y'all\n\n[Chorus]\nI'm livin' fat, y'all, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nHey yo, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nHey yo, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nHey yo, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nHey yo, I'm livin' fat\n\n[Verse 2]\nLook at the way I freak this style, I'm versatile\nNiggas don't want the funk because they know I'm buckwild\nCould you believe the rappers that they talk shit\nWhile I be rippin' the microphone and all my records are hits\nThe name is Fat Joe, I'm on the down low\nI chill with Lord Finesse, you know I got the flow\nI be freakin' the funk, not fakin' the funk, you're facin' a punk, yeah\nFuck around and you'll be layin' in the dumps\nI got props, believe it or not\nI never got caught because I pay off the cops, yeah\nOne of the livest niggas in New York\nSometimes I be chillin' with Son\nSometimes I be chillin' with Hawk\nYou know that Brooklyn in the house and Uptown is too\nI gotta be sayin' 'peace,\"' to the Boogie, the Bronx crew\nPete, Sap, Brim, Vayo Mack, Gizmo, Nicer, B.G., my main man Crack\nSo now you know the flav and you know the time\nBrothers always be tellin' me, \"Joe why don't you kick a Fat rhyme?\"\nSo I don't front on my peeps\nKick a verse or two, then be out, and peace G\nSo don't try to step to dis, you know you take a fall\nAsk how I'm livin', hey yo, I'm livin Fat, y'all\n\n[Chorus]\nI'm livin' fat, y'all, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nAyo, I'm livin' fat, y'all, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nAyo, I'm livin' fat, y'all, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\nAyo, I'm livin' fat, y'all, I'm livin' fat\nI'm livin' fat, y'all, I'm livin' fat\n\n[Outro]\nAyo, I'm livin' fat\nNinety-three, Lord Finesse, Fat Joe, Diamond D\nShowbiz and A.G., D.I.T.C. and I'm out", "title": "Livin’ Fat"}]}