{"songs": [{"title": "To Zion", "album": "The Miseducation of Lauryn Hill", "year": "1998-08-25", "image": "https://images.genius.com/1b4427b3ad0a40feb97bb94e532da4b0.600x600x1.jpg", "lyrics": "[Intro]\nOne day, I'm gonna understand...\nZion\n\n[Verse 1]\nUnsure of what the balance held\nI touched my belly overwhelmed\nBy what I had been chosen to perform\nBut then an angel came one day\nTold me to kneel down and pray\nFor unto me a man-child would be born\nWoe this crazy circumstance\nI knew his life deserved a chance\nBut everybody told me to be smart\n\"Look at your career,\" they said\n\"Lauryn, baby use your head\"\nBut instead I chose to use my heart\n\n[Chorus]\nNow the joy of my world\nIs in Zion! (Zion, Zion!)\nNow the joy of my world\nIs in Zion! (Zion, uhh, Zion!)\n\n[Verse 2]\nHow beautiful if nothing more\nThan to wait at Zion's door\nI've never been in love like this before\nNow let me pray to keep you from\nThe perils that will surely come\nSee life for you, my prince has just begun\nAnd I thank you for choosing me\nTo come through unto life to be\nA beautiful reflection of His grace\nSee I know that a gift so great\nIs only one God could create\nAnd I'm reminded every time I see your face\n\n[Chorus]\nThat the joy (Joy)\nOf my world (World)\nIs in Zion (Is in Zion)\nIs in Zion (Is in Zion)\nNow the joy (Joy)\nOf my world (World)\nIs in Zion (Is in Zion, is in Zion)\nNow the joy (Joy)\nOf my world (World)\nIs in Zion (Is in Zion, is in Zion)\nNow the joy (Joy)\nOf my world (World)\nIs in Zion (Is in Zion, is in Zion)\n\n[Outro]\nMarching, marching, marching, marching (Marching)\nTo Zion, marching, marching, marching (We gon' march)\nMarching, marching, marching, marching\nTo Zion, marching, beautiful, beautiful, Zion\nMarching, marching, marching, marching\nTo Zion, marching, marching, marching\nMarching, marching, marching, marching\nTo Zion, marching, beautiful, beautiful, Zion\nMarching, marching, marching, marching (My joy, my joy)\nTo Zion, marching, marching, marching (My joy, my joy)\nMarching, marching, marching, marching (My joy, my joy)\nTo Zion, marching, beautiful, beautiful, Zion (My joy, my joy)\nMarching, marching, marching, marching (My joy, my joy)\nTo Zion, marching, marching, marching (My joy, my joy)\nMarching, marching, marching, marching (You're the joy)\nTo Zion, marching, beautiful, beautiful, Zion (Of my life)\nMarching, marching, marching, marching (It is in Zion)\nTo Zion, marching, marching, marching (Zion)\nMarching, marching, marching, marching (You're the joy)\nTo Zion, marching, beautiful, beautiful, Zion (You're the joy of my life)\nMarching, beautiful, beautiful Zion (Is in Zion, Zion)\nMarching, beautiful, beautiful Zion (It is in Zion)\nMarching, beautiful, beautiful Zion\nMarching, beautiful, beautiful Zion\nMarching, beautiful, beautiful Zion\nMarching, beautiful, beautiful Zion\nMarching\n\n[Skit]\n\n[Teacher]\nOkay, how many people here have ever been in love? I know none of the guys are gonna raise their hand. How many of y'all ever been in love?\n\n[Class]\n(Mumbling)\n\n[Teacher]\nI know none of the guys been in... we don't get in love, right? Oh! Let this black man right here tell what his idea of love is, 'cause not all the time we hear a young black man talk about love. About your personal definition, don't tell me what Webster thinks. Huh?\n\n[Boy]\nWillingness to do everything for that person\n\n[Teacher]\nOkay, everything like what? Explain. Let him talk c'mon. If I asked him to talk about a fancy car, he'd be right on point. But we wanna talk about love. You can do it. (To another pupil) What do you think? You said you love somebody, you should know why you love them right?\n\n[Boy 2]\nThe way they act\n\n[Teacher]\nUh-huh\n\n[Boy 2]\nThe way they carry themselves, stuff like that\n\n[Teacher]\nOkay\n\n[Girl]\nThe way that they hang with they boys, and they just stand out. It's like sometimes it don't even matter like what they wear or what they look like. It's like, that way, you know?\n\n[Girl 2]\nYeah\n\n[Girl]\nIt's like you know you want to talk to him, because he stands out, it's like he got a glow or something\n\n[Teacher]\nThat's deep\n\n[Boy 2]\nThat's what I'm talking about\n\n[Teacher]\nI thought that was a beautiful point. Anyone else want to deal with that?\n\n[Girl 2]\nIt's sometimes, like when they try to act funny in front of they boys, like when they get around say they love you. They can't love you. 'Cause love-love-love wouldn't do that\n\n[Girl 3]\nLove is not phony!\n\n[Class]\n(Laughter)"}], "artist": "Lauryn Hill"}