{"artist": "Capital STEEZ", "songs": [{"title": "The Lounge", "album": null, "year": null, "image": "https://images.genius.com/126d3d8ed37f6738b16f5c405b0c0aab.431x431x1.png", "lyrics": "[Intro: Chuck Strangers]\nI'm drinking a 40\nPat's eating noodles\nJesse rolled a blunt\nI'm coming on the beat\nLet these niggas know what's up\n\n[Verse 1: Chuck Strangers]\nWho be I, Chuck yes\nSmoke sesh', you can't handle\nDoing what I plan to\nThis is the crew, man I thought you knew\nThe papers Raw, and the beats is too\nAnd the freaks is too\nThen the homies coming through\nRSVP jam offers too\nI walked up in your shit, and all these hoes ugly\nBut I'm still up for something\n'Cause Kirk Knight brought me my grandpa swag\nVintage polo tags\nCatch me stuntin' like your dad\nThat's the fool, you wished you had the fat boy's back\nYou can tell your homegirls that\nThe sky is the limit\nWe don't sell weed that got no seeds in it\nLooking in the mirror and impressed with the new me\nYou been on my mind, but the money is all I see\nLook ma', No hands\nNiggas rollin', my watch showin’\nYou mad? It’s too bad\nYou stressed off them seeds in yo quarter bag?\nMy [?] roll something that you wish y’all had\n\n[Hook: Chuck Strangers]\nI don't want no 9-5\nI don't want no 9-5\nI don't want no 9-5\nI don't want no 9-5\nI don't want no 9-5\nI don't want no 9-5\nBetter keep an open mind if you're trynna survive\nI don't want no 9-5\n\n[Verse 2: Uno Hype]\nI felt that I deserved it all\nFigured I stand tall when the curtains calls\nWhat if it ain't work at all?\nThen it ain't worth it dawg\nSee the way I work these bars\nWith the vision that could birth a star\nFlow's mean cause I'm working hard\nBeen a vet, why you swerving off?\nOne take then I'm floatin' off\nNugs from a purple jar, lock jaw when I pull it\nYou get locked off and I couldn't\nCats salty how I push shit\nWe pepper ass niggas\nThe 90s made some reckless ass niggas\nLow cash niggas, flow gas niggas\nPeyton Mannin how I'm passing it\nHope the dro' pass quicker, than the masses grip ya\nFuck the hype, how I switch up\nKush-ups in the morning like nigga fuck som sit-ups\nGet the picture that I print up\nMost MC's need guidance so they pick us, so twist up\nI put my guidance in the swisher\nToo much money to be floatin' 'round so nigga get up\n\n[Hook: Uno Hype]\nFuck a 9-5\nFuck a 9-5\nKeep an open mind if you're trying to survive\nBut nigga fuck a 9-5\nFuck a 9-5\nNigga, fuck a 9-5\nRather get rich off this rap shit than steal or rob\nNigga, fuck a 9-5\n\n[Verse 3: Capital STEEZ]\nI'm coming from the home place of way too many mouths to be fed\nWhen you make it to be the greatest or you're probably dead\nAnd 9 to 5 is the only time you can spend\nThis is coming from the bottom of my heart and off the top of my head\nJust freestyling in them hallways all day\nThought that you was balling that's until you seen Lebron play\nLike you better step your shit up kid\nWe in the school of hard knocks with the stick up kids\nA little fame will make your best man switch quick\nAn unspoken truth so you betta keep your lip zipped\nAn infant to the game bout to hit six\nYears writing verses and I still ain't get rich\nI guess I'm looking for a man to blame, getting older realizing it'll have to change\nSo by the age of 21 I'ma have a champagne range rover, J roller, and a platinum chain\n\n[Hook: Capital STEEZ]\nCuause I don't want no 9 to 5\nI don't want no 9 to 5\nYou better keep an open mind if your trying to survive\nCause I don't want no 9 to 5\nSaid I don't want no 9 to 5\nI don't want no 9 to 5\nBetter keep an open mind if your trying to survive\nCause I don't want no 9 to 5\nThis one"}]}