{"songs": [{"image": "https://images.genius.com/4c5616d5a2ce424aaac25f629b82e287.325x325x1.jpg", "year": "1995-12-12", "title": "Deuce-5 To Life", "album": "Xorcist", "lyrics": "[Verse 1]\n187, gang related, I'm accused\nAnd after every court date my face is on the news\nThey say I wrote a song about a murder\nI maintain my innocence, it's nothing but a coincidence\nI'll admit it looks kind of shadey\nFrom the outside looking in\nThe situation is serious but people don't comprehend\nI was 17 years young back in '92\nFacing 25 to life for something I didn't do\nMy song is supposed to be a big admission on my part\nAnd they're using the lyrics against me when my trial gets ready to start\nMy songs are being misinterpre-ta-ted\nIt ain't nothing but the D.A. trying to prove premeditated\nThey've got X-Raided stuck, majorly crossed up\nThe D.A. got a fucked up witness and my lawyer is a dump truck\nI've been sitting in the county, three years have already went by\nThey're pressuring my Locs, trying to get them to testify\nSnitching ain't no joke, it's hazardous to your health\nWhen you point one finger at me, you're pointing three back at yourself\nMy homies got convicted for murder in the first degree\nAin't no doubt about it, they'll try to do worse to me\nThey take me in the court room in front of an all white jury\nWith the family looking me with barely concealed fury\nMy lawyer standing next to me, prepared to represent\nAnd help me get convicted cause to him\nI'm guilty till proven innocent...\n\n[Chorus]\nWhy they trying to give me deuce-5 to life?\nThey trying to give me 25 to life cause I'm guilty till proven innocent...\n\n[Verse 2]\nI open up the front page of the Sacramento Bee\nAnd read the article that Dan McGrath wrote about me\nHe has his own opinion and it's his job to write it\nI say he's being biased and completly one sided\nThe media write their stories for the public to consume\nAnd any chance I have of getting a fair trial in Sac is doomed\nAny potential jurors mind is being contaminated\nFrom reading all the bull they wrote about X-Raided\nI never told anybody to go out kill somebody's folks\nAnd blaming it all on me and\nA song I wrote is a complete joke\nThey're looking for a move but they're looking in the dark\nPutting a noose around my neck and a bullet in my heart\nJust because I'm capable of killing doesn't mean I kill\nAnd just because I'm capable of killing doesn't mean I will\nI wish they all knew, how can I make you feel me?\nX-Raided didn't do it but I've gotta ride cause I'm guilty till proven innocent...\n\n[Chorus]\nWhy they trying to give me deuce-5 to life?\nThey trying to give me 25 to life cause I'm guilty till proven innocent...\n\n[Verse 3]\nI'm knowing I'm going to end up in the pen\nFighting my appeal and hoping that I win\nIt's me and Baby Bread fighting this fucked up case\nLike Dooney and B-Dub trying to get these years erased\nIn Sac there ain't no love when you're from the Garden Blocc\nManiac, C-Mooney, Baby Snake and Lil' Venom already got washed\nI'm trying to keep my head up but my load is getting heavy\nIt makes me want to do like Sicx: take some Tylenol and get it over with\nBut instead I just maintain and do everything to keep my composure\nRepresenting the Blocc to the fullest and riding like a soldier\nI told you fools the X-Loc ain't going out like the average\nI didn't kill your folks but if you run up then I gotta loc up like a savage\nOn that ass, bitch, it ain't nothing personal thang, it's just about survival\nAnd I'm going to be 125 years old before I die\nIf I can help it\nYou made your threats and I felt it but I ain't dead yet\nSo you niggas talking about\nWhat you're going to do when you see me\nI'll be on the weights, wearing state boots and a beanie\nI wish I didn't have to be this way but it's reality\nSo I'm strapped based on the fact\nI'm guilty till proven innocent...\n\n[Chorus]\nWhy they trying to give me deuce-5 to life?\nThey trying to give me 25 to life\nCause I'm guilty till proven innocent..."}], "artist": "X-Raided"}