{"songs": [{"image": "https://images.genius.com/508cfd1c27feb972bd0f02726a60791a.1000x1000x1.jpg", "title": "U Played Yourself", "album": "Strings and Bling", "year": "2018-07-06", "lyrics": "[Intro]\nOk ok ok ok\nI'm about to say all facts\nDeep\n\n[Chorus]\nYou played yourself, you played yourself, you played yourself\nYou played yourself\nShe cheated on you, she cheated on you\nHe cheated on you, he cheated on you\nOh you played yourself, you played yourself\nYou know you played yourself\nOkay, you played yourself\nShe cheated on you, she cheated on you, he cheated on you\nHe cheated on you\nThat's wifey huh, for lifey huh?\nYour partner in crime, so why did she lie?\nYeah she cheated on you yeah she cheated on you (okay)\n\n[Verse 1]\nTwo thousand eighteen only trust your team\nDon't chase LB's only chase your dream, that's word\nLike cheek, 'coz that's a thing now that's how it be\nIf life was perfect you'd be easy\nWouldn't have to do the silent treatment\nFound out she was creeping\nUnforgettable evening\nI could tell you wish you could tap in your memory bank and delete it\nYou can't un-see it, that's your baby baby you don't believe it\nYou don't want the truth but you need it, sucka\nKnow you feel like a sucka thought ya was a lucky motherfucka\nAre you gon let her walk in and out dog?\nOr find out who she messing with and punch em in their mouth\nKnock em out take em down?\nWhat now? Well done, you played yourself\nTake a bow\nI said are you gon let her walk in and out dog?\nOr find out who she messing with and punch em in their mouth\nKnock em out take em down?\nTake him out, what now?\nSit your ass down nigga\n\n[Chorus]\nYou played yourself, you played yourself, you played yourself\nYou played yourself\nShe cheated on you, she cheated on you, he cheated on you\nHe cheated on you\nOh you played yourself, you played yourself\nYou know you played yourself\nOkay, you played yourself\nShe cheated on you, she cheated on you, he cheated on you\nHe cheated on you\nThat's wifey huh, for lifey huh?\nYour partner in crime, so why did she lie?\nYeah she cheated on you yeah she cheated on you (okay)\n\n[Verse 2]\nYou wrong you wrong for pretending like you don't know\nThat he's with the homies but the homies is out with the hoes\nThat's just how it goes nobody will tell you why so\nThat's gang code, that's bro code, that's guy code\nWhat's the action, what you planning?\nWhy you standing?\nYou gave your left hand to a man that just can't handle it\nGet over it, move past don't look back at it\nYou know it's real when rappers say don't look back at it\nAnyway back to this, practice this\nOnly give your fucks to your mattresses\nOnly give your trust to the bank this year\nOnly throw it back in the bank and shit yeah\nTake my relationship advice or go through the same thing twice\n\n[Outro]\nThis is a side message to address what may upset the small group of people who haven't come to terms with their reality. People in denial of a truth that could set them free. What Mr. Ivyson is saying is, take all this so-called love that you had devoted in a stranger, and invest it equally between what you see when you imagine your greatest self and what you see when you look in the mirror. And he 100% guarantees you, you will find gold. But don't forget: you still played yourself. Strings and Bling"}], "artist": "Nasty C"}