{"artist": "A$AP Ferg", "songs": [{"title": "DJ Self Freestyle", "image": "https://images.genius.com/c9440ee0b76ac4cc57b13638e1b04b1b.500x500x1.jpg", "album": null, "lyrics": "[Verse 1: A$AP Ferg]\nMoney, power, respect\nTalking out of your neck\nDid a deal with adidas, but all I want is the check\nNew level, the bezel I filled the front with baguettes\nWe don't even go out, because all I want is the sex\nI'm telling the truth ain't even spending the loot\nStill fucking all these bitches because they be calling me cute\nAin't even start tripping yet\nDreams of fucking an RNB bitch, and I ain't start picking yet\nFirst Ima go after Madonna, cause I know she'll like Rihanna\nThen we can go to Tijuana, puff marijuana\nPuff in the back of the cabana\nOr settle for a bitch up in a Honda\nWith a fat ass , no class just good mouth\nI'll take her to my crib, I fucked a bitch in [??]\nYeah!\nFerg just walked in the party now\nGetting new bucks, got the  diamonds and the Cartiers now\nYeah!\nI pushed a rim and the rari now\nAll ya niggas salty like [??] now\nAll these niggas borrow style\nGot mag, and I got to go to Maury's now\n\n\n[DJ Self]\nA$AP Ferg!\nSalute that boy when you see him!\nHarlem! You should be proud!\nNew York City!\n\n[Verse 2 : A$AP Ferg]\nI had to prematurely lose my Yamboughini\nThat lean and ketamine took my man out his beanie\nI wish we could of worked out, eat a better zucchini\nAnd trade in that big bottle of henny for the Fuji\nI was Aladdin, he was a genie\nI love his momma, I be sadden when she see me\nWho would of knew that the party would end wrong\nWho would of knew Fergie Ferg would sing a sad song\nWho would of knew A$AP would come this far\nWho would of knew Yams vision make us all stars\nThe fame and access will kill us all\nYou ever deal with a drug addict who was your boy?\nWho, when you talk to him, he kept nodding off\nI swear he sound like he was dying every time he snore\nI got to talk about it, I have to get it off\nAnybody with a problem with it, man you niggas soft\n\n\n\n[DJ Self & A$AP Ferg]\nNow check it out\nYou know what it is, A$AP Ferg in the building!\nNew York stand up, Harlem in the building\nWe on a new level\nWe on a new level!\nYou know what it is!\nCheck it out\n\n[Verse 3: A$AP Ferg]\nI paid the cost to be the boss, now I'm calling the shots\nI was working on my craft, you was scoring with thots\nBig Tymers, I'm getting Marty Baller to pop\nOpen up the floodgates, I'm taking all of my block\nNew regime , shits insane, crystal caine\nSee love tight with the pistol game\nTalk shit out your mouth and lose your brain\nAnd we don't give a fuck about that shit you claim\nAll this fake ass going around, its getting so bad\nAbout to start fucking model bitches with no ass\nShout outs to the girls who loved me before cash\nFuck the fake ones, that get them so mad\nWe them great ones I think you know that\nKilling ya rappers, better get them a toe tag\nHip-Hop savior, grills and a durag\nI got Missy on the album, Ferg how you do that?\nSold out the garden, Ferg how you do that?\nWorked with Madonna, Ferg how you do that?\nI been a problem, been that before rap\nKilling ya rappers, and I thought you knew that\nI think I need my chain to swing more\nIce in my teeth to bling more\nBout to call Will, fuck you taking so long with my ring for\nDJ Self I need my shit to play more", "year": "2016-04-27"}]}