{"songs": [{"album": "CakeWalk", "year": "2010-05-17", "title": "Paper Planes", "image": "https://images.genius.com/d737d032384784252b6795bbaad6ddf0.800x800x1.jpg", "lyrics": "[Verse 1: JID]\nShit, I’m a ol’ gutter ass boy\nI beat your whore to the floor out her Christian Dior\nWhy? Ha, ‘cause I don’t like beef\nAnd if I feel like a nigga don’t like me, suck a dick, fight me\nYou walk a tight rope, it’s on a weak string\nAnd you’re going to be sleeping while we’re creeping\nAnd we will break your front screen, put the gun beam\nTo your fore frontal, nigga say uncle\nGive me back my mind back, give me back my brain\nI tend to lose these things when I’m going insane\nIntellectual male but bad to the bone\nYou faking, please cut it out, Joey Gladstone\nBack up, give me my, uh, so give me my room\nSo as I light my blunt and jump over the moon\nAnd if you not give me my room to see me go boom\nSee me go boom, see me go- see me boom\n\n[Chorus: MIA]\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\n\n[Verse 2: JID]\nAs I take a puff out the bong, many things that I do wrong\nBut at the same I do right, it’s hard being black\nWhen niggas living off the white, feds on sight\nSo I take the Kanye approach and say what I like\nBut not always the right thing depending on the timing\nShit, or the place, nigga get out my face\nIs what Taylor Swift should have said when Mr. West had disrespected\nBut she can’t say the n-word, that’ll get her dentures\nJID, temper, temper, sorry I’m deranged\nAll you need’s a roller, then you got your way to the fame\nLong as your flow’s on point and your beats by Jack Swing\nNiggas gettin’ money, shoutout to Young Money\nShoutout Grand Hustle, shoutout to Interscope\nJust tryin’ to get inside the game so I can get in niggas’ throats\nYou rappers should kill yourself, guess who selling the rope?\nAnd I came a long way from variations of dope\n\n[Chorus: MIA]\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\nAll I wanna do is\nAnd a\nAnd take your money\n\n[Outro: DJ Khaled]\nHampton University’s own\nDJ Tay James\nTay James, what it does?\nIt’s DJ Khaled, the don dada\nBig dog, Pitbull, Terror Squad\nAKA the beat nova cane\nAKA we the best"}], "artist": "JID"}