{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/1731203bf886ef7720d250ebf2de1bb0.540x540x1.png", "title": "Expeditiously", "year": "2019-04-15", "album": "Kill Bill*", "lyrics": "[Intro]\nTrue story, ain't no lyin'\nA wise man can play a fool but a fool can't play wise\nUnless you judge me by my cover so you can't read between my lines\nI'm a street poet, poetical genius\nGod made me, believe me\nThey ain't know that I was intellectual\nTryna change your life, but they won't let ya\nI'm in Detroit right now\nJust hollerin' at my nigga Wiz\n\n[Verse]\nI was hollerin' at my boy, he say he feel like he gon' die soon\nHad to pray for him because he need it more than I do\nHow can I tell my people that's exactly the way I feel?\nBut I know that I'm blessed, so I won't give a bitch that idea\nRunnin' from the Jakes, I was posted up with a 9 mill\nGot me jumpin' gates, I got credit cards in my high heels\nAll my niggas fake, that shit kept comin' out like diarrhea\nSyko on my line, I'ma pick him up, he in Liberia\nWiz, he just whipped up a brick and he ain't put no noodles in it\nTold him I just caught me a fish, so don't put no tuna in it\nThey know that I'm baptized in blood, I let my soul sing it\nRunnin' round wildin', I'm childish, I ain't got no home trainin'\nTalking to my lil' boy, I promise won't let them boys kill me\nLookin' at my lil' boy like, \"Father, don't let them boys steer me\"\nNigga tried to trap me, I saw it, they say that boy slippery\nNiggas tried to trap me, I saw it, they say that boy slippery\nYoung nigga stickin' to the code, 'cause I don't condone snitchin'\nI ain't goin' out like that rapper, I won't do no tippin'\nWillie said my name on the TV, that boy a bold witness\nOn the news he T.I.P.’d me, that boy got no feelings\nSuwoop put the pole on lil' buddy, they said The Game strippin'\nOld heads ain't hittin' on nothin', I say them boys kiddin'\nI want all the smoke out the stove, but I don't even roll Phillies\nHow the hell you callin' me out when you know I don't listen?\nHow you try and put me in timeout when I ain't Big Boy children?\nNigga waitin' on for me to fall off just like that boy Gillie\nSaid they ride for me 'til the wheel fall off, I be like, \"Oh really?\"\nHow you tell me what came out my mouth, you don't even know Nipsey?\nTiny, that bitch ugly as hell, I don't even want Piggy\nI can't beat you niggas at talkin', give me a long sentence\nKnow I keep the pole and I ain't no ho, I know some Rollin 60s\nAnd I'm thuggin' all on my lonely, but I keep some Zoes with me\nHow the hell you cancel a nigga, and I don't even smoke tobacco?\nMute me when I voice my opinion, and I ain't even know it mattered\nJump right on my live and record me, everything I say be Platinum\nSpecial kind of nigga, they know me, they want my name slandered\nSpecial kind of nigga, they know me, they want my name slandered\nMy head right on the swivel, I'm focused, they want my brain splattered\nHow the hell you cancel a nigga, and I don't even smoke tobacco?\nMute me when I voice my opinion, and I ain't even know it mattered"}]}