{"songs": [{"title": "Swerve n Skid", "lyrics": "[Intro]\nYo, listen\nAJ from the l-l-l-lane\nLook, look\n\n[Verse]\nWait up, yep, ah\nYou thought that I missed the drop but I never\nBig impact like Ross or Heather\nMan mind out when I'm strapped with the leather\nTold man already that we got the pumpy\nDump it, niggas'll fly like feather\nMandem think that I just turned bad\nI was bad from when I chilled by Mo Better\nStrap put man in a peak dilemma\nDon't bell man off an unknown bredda\nWhite and bold, 6 feet in the North Face\nGym shoes? Nah, I do not shot cheddar\nYou're not bad, bad yout? Never\nWest Indies strap hold bare pepper\nTrue Religions and a Polish pistol\nSkengman dance, I'm a real hotstepper\nFlick me a draw, won't see that tenner\nBeef me at night, won't see light ever\nWalk in the Westwood and I'm too bait\nSo I told the babe she can hold my wetter\nTold my babe she can have my pickney\nTings in her bra, feds can't shift me\nHolding the food, dogs can't sniff me\nDirt moves happen a lot like Pixie\nThey wanna pitch me\nI said \"clash my team, are you tipsy?\nWhen you man all sound like Mixy\"\nMust be a joke, no funny man trick me\nTry touch Zuu or Ty or Jammz\nOr LS or PK, I'll be stabbing\nAxe man up on the road, no ramping\nTwo breh tackled, blacked out, no clamping\nRun a man down, no hide or camping\nThat fake tool that you have's got blanks in\nYou won't pull it, there's no bullet\nOnly time you manna buss is wanking\nCame blacked out to the dance, no smiley\nI've got trees, bags of the miley\nSo it's all hot, heatwave like Wiley\nBut I need Ps so I've gotta get grimy\nIf you never knew that, you must be a dunce\nNo, it's not twice, tell a man once\nIf you ever try and fuck around with the funds\nMan would've thought that I speak in tongues\nSpeak in Thai, speak in Greek\nDon't ever try come West on a beef\nCuh you will get laced with the shotgun teeth\nI don't banter\nLick off the combo, shots'll catch ya\nMan get hit with Akuma's anger\nMan get hit with a shot like Blanka\nI'm doing numbers, AJ's something like a ruler\nX is the shankers, Danny is the shooter\nYou man are bad behind a computer\nJay done said he sucks food like hoover\nNet for a peng ting and she said \"eat me\"\nI told her \"that's not me\" like Junior\nThat's not me, Jamie Adenuga\nMan turn dark like Jin and Kazuya\nBad girl sipping on gin and tonic\nBut me no wife bad gyal, that's horrid\nLoose tings tryna get rings like Sonic\nThrew me the narns, weren't really on it\nYou man are fake like Jake and Finn\nYou man are fake like Wallace and Gromit\nIf you saw what the rambo done to your bredrin\nIt would've made a big man go vomit\nNiggas all wanna come friend and bred man\nShell an MC off the mic like F that\nHeard some sideman sitting in my ends\nSaid he watch my watch, let him know he's a dead man\nYou've got heart like man?\nIf you've got heart like man then trust me, I rate that\nPhoned for two and got one, what a brave cat\nTake man's trapsuit line, then I break that\nI don't fight like Hong Kong Phooey\nChicks dem give me mad head like Stewie\nBrixton with DM, with X, I'm in Lewi\nCook beef overly burnt, not chewy\nMan a done war\nCall Mick for the clique, man a done talk\nThought she gon' wife man? Ah, what a dumb whore\nSend man way off the ends like Scunthorpe\nI'm not afraid, time to do what you come for\nIf you ain't levelling, what you gun for? Bang\nMake man scatter when the gun roar\nDrew bare man's wifeys I can't un-draw\nBatter man, finish at a man when I turn raw\nYou got a bring-in\nMy team's never singing, the rap ringing\nStraps stay shelling, I'm not swinging\nYou spin me? Must be pinging\nToo much mandy, your draw's all swinging\nLick man down from a ting\nDon't talk trash, don't get brave\nOff the mic, you're a snot-nosed kid\nI'll make any car swerve and skid\nYou niggas all broke, you worthless prick\nMan count dough, we serve and flip\nOn the lane all night, tryna earn these chips\nI'll make any car swerve and skid\nYou niggas all broke, you worthless prick\nMan count dough, we serve and flip\nOn the lane all night, tryna earn these chips\nAJ from the lane\nCuzzy, I earned that name\nCuh I stick to the strip in the snow or the rain\nAJ on the top, AJ on the 'caine\nStack into a box like Blaine\nBeg a man call my name\nScream MTP, if we're feeling brave\nI'll catch man on his way home from a rave", "year": "2015-02-02", "album": "AJ’s Stocking Filler", "image": "https://images.genius.com/8acb9c95ce5f2883d50de88bc3ad5798.1000x1000x1.jpg"}], "artist": "AJ Tracey"}