{"artist": "Watsky", "songs": [{"year": "2011-06-19", "lyrics": "Excuse me, miss, what's your name?\nThat's a nice name\nI had to write this haiku:\n\"Hi! I like like you\nFor your high IQ, and you're\nQuite fine too. Date me?\"\nYou showed the poem to your friends? (messed up)\nWhatever, I don't need it\nI can read between the lines, be conceited\nI'll beat it, cause I don't really have the T-I-M-E, time\n\nYou're coming on a little strong, okay?\nI get it\nWhen I was there you barely wanted me\nNow I'm scarce commodity\nAnd since I'm rare you care to make my bare bod your property\nI'm sorry princess, I boycott your boy ploy, I think it's best\nI guess, we have thin common interests\n\nI mean, it's not like your favorite South Park character is\nButters\nOr your favorite food is\nMainly Japanese\nAnd Amy's mac and cheese-\nYou too?\nI get pretty torn up when I see roadkill\nBut damn, I just love manatees, they're so chill, right?\n\nThe Beatles are best\nI could listen to Lennon again and again and\nEspecially Penny Lane\nAnd Eminem is a beast with a pen and a pad\nAnd drunk Denny's is better than Bennigan's any day\nOdwalla, Koalas, Pico de Gallo, Tika Masala, Hakunah Matata\nI'm looking at making a living in doing the one that I love with what I've been given\nAnd I'm thinking that we could maybe bring the power nap back\nI eat sugar from the bottom of the Sour Patch pack\nOh, snap!\nIt's like we're finishing each other's...\nI love you, girl, you're my other half\nBaby got me high like a hovercraft\nYour loving got me high like I'm huffing or I puff and pass\nDamn, you're so upperclass!\nI want to get up it like a hand up a puppet's ass\nWho'd you call a mother-?\nYou too\nUp your-!\nUntrue\nI mean it, stop it, yo!\n\nWell, if I'm a poor man's Michael Cera\nYou're Janeane Garofalo\nNo, your pouncing caused this downswing!\nMaybe we should browse around for couple's counseling?\nYou make me sick, you give me fever\nThen leave, I never liked you either!", "image": "https://images.genius.com/15e329cac8808712e9bcdedd4c1b05fd.1000x1000x1.jpg", "album": null, "title": "A Love Story"}]}