{"artist": "A$AP Rocky", "songs": [{"title": "Funkmaster Flex Freestyle Part 1", "image": "https://images.genius.com/84260afdfa02f8cba4117c80ac6c847b.1000x1000x1.jpg", "album": null, "lyrics": "[A$AP Rocky]\nI'm who these ladies love, who your main bitch lust for\nMounts of dead presidents, and I ain't talking Rushmore\nCodeine and syrup got my safe like the drugstore\nHating niggas, niggas hating, bitches hating -- fuck, boy\nShe a gold-digger, but who am I to judge her?\nWe above the law, who am I to cuff her?\nIt's obvious she want me, mayne\nYou could try to [fuck her]\nI be swimming in these women, I'm the scuba diver lover\nKnown around the globe but Harlem's where I be at\nSame home as Cam'ron, and I ain't talking Diaz\nFlame spitter nigga, guaranteed to get a heat rash\nBallin' all seasons, subscribe for your league pass\nRap Simon London, Louis Vuitton Don shits\nChristian Louboutin for guys with red bottoms\nYves St. Laurent kicks, Christian Dior sponsors\nThesis snap-backs like I'm straight outta Compton\nRick Owens, I own 'em\nMargiela's, I did 'em\nY3's, we on it\nAlexander, we miss 'im\nI'm talking 'bout the king, yes, Alexander McQueen\nMay he live, rest in peace, and we do it through our jeans\n\n[A$AP Nast]\nI'm trying to tell 'em I see my future as crystal-clear\nShine like some crystal, yeah, so I keep pistols near\nNot far at all, one reach, that's all\nYou sleep, sleep in the back of some old Ford pickup\nOn the side of the road\nCold, cold world, no J\nNo way, Jose\nN.A. all day\nS.T., that's me\nAsk why, and you wonder why my flow go over guys\nWho want a horse and drive\nBut you often find it's coffin time, no Pokemon\nPlate still stuffed to the top, but ain't no pork on mine\nIt's quite often I could come up with Mighty Morphin rhymes\nFool think he fucking with Nast, must have lost his mind\nYeah, you lost your mind, the throne is mine\nI watch the throne\nSmoking reefer, slightly past my zone\nI'll soon be back at home\nI'm relaxing, homes\nI got the Mac tucked in my jack\nI might just act if you ain't acting right\nFuck it, I keep the Magnum\nBust it; niggas don't want it with my niggas, we steady coming\nHundred deep, three hundred we coming like Spartan\nFucker, just pardon my flow\nI come through your deli department or market\nNah, check it out\nI'm swagging, my niggas with it too\nYour bitch with it, I probably just hit her then I'm through\nThrough, I'm chilling, I'm chilling with the homies\nRolling up a couple Swishers, couple bitches on me\nI be chilling, homie\nGet the picture? We all around the globe, check the flow on me\n\n[A$AP Ferg]\n(Yeah, Fergenstein you never heard of mine\nI'm sippin' Persian wine with your Persian Dime)\nMedusa faceded mogul\nFergenstein too cool too\nHoodlum in these Owen boots\nRicky Owen but I ain't on you\nFuck burnin', I thaw the booth\nNigga I ain't lyin', I told the truth\nLil' kids gone hold the deuce\nSip holy water, tryna seek the the truth\nUh, that was just me startin' off...\n\n[A$AP Twelvy]\nMan I came to bring the pain\nTwelve be spittin' flames\nLive from the two twelve with my eight dollar gang\nAP, Audemar\nRunning like a Viking back\nIt's the grand with the flow, all the hoes be liking that\nRecite it back\nRun it back\nPlay it over, play it over\nASAP everything, my young niggas takin' over\nPyrex, baking soda, loud and some roll up\nCookin' up some shit Ty Nast screamin'...\n\n[A$AP Ferg]\nDonatella on speed dial\nDiamond teeth when these smile\nTriple tongue, Jeremy Scott's\nMargiela's on me, nigga no socks\nDropped in a bitch, nigga no pop", "year": null}]}