{"artist": "Inspectah Deck", "songs": [{"title": "House Nigga (Joe Budden Diss)", "lyrics": "[Verse 1]\nFirst of all, you a blog thug, YouTube goon\nHOUSE NIGGA! Your food get chewed up rude\nI see you like to put your world online\nAin't nobody checking for you, they checking for your girl's behind\nWhile your homey in the bedroom, lust in his eyes\nWhile you filming dumb shit, they probably fucked a few times\nWow, how you Slaughterhouse? You barely get a nod\nI'm convict benching, daily in the yard\nSo I'm built like Optimus Prime\nYou couldn't see me with binoculars\nI'm, way ahead of you, obviously I'm better too\nDeck show him how to properly rhyme\nHe on mine, like he didn't see the property sign\nLyrically blunt, I'm broad day, physically dump\nThis nigga's life's a publicity stunt\nBut, he think he fever, I ain't a believer\nDef Jam chucked him, they ain't feel him neither\nWhy are you talking like the Morpheus of rhymes?\nWhen my first shit, sold more than all your shit combined\nWorshiping Tahiry's doing something to your mind\nI should get your tummy tucked, just for jumping out of line\nMan, really? Name me three Joe Budden songs\nDon't worry, I got time, I cut the song\n\n[Interlude: 'Jeopardy' skit]\nOh, oh man, umm, three Joe Budden songs, umm...\nDamn, uh, the -- Pump It Up!\nUh, agh -- ahh, shit... this for a hundred thousand, too?\nAhh, I'm bout to blow the shit!\nAhh... did I say Pump It Up?\nOh, oh ---\n\n[Verse 2]\nStill waiting, Resident Patient, stay sick\nBasic, the truth's on, face it, taste it\nHunt it to the head, make him retract statements\nMy next move, probably increase your hatred\nTake it how you take it, HBO Bodie\nState wide ain't nobody rocking no Joey\nI'm a legend, Meth let you live, I'mma set it\nAnd I ain't on the phone but you get the text message\nI'mma rep til the death, with my life put on it\nIf it's dollars, then it's cents, then I'm likely on it\nI'm deep in the pits, where the trife be on it\nOnly hood you be in, got Nike on it\nHOUSE NIGGA! You don't see the strips\nYour fuzzy house shoes underneath your bitch\nAnd I ain't got to talk bout Gloria Velez\nStalker ass nigga, you was calling her, obsessed\nComputer love scrub, think you safe behind a desk\nLike we won't call Redman and get your address\nYeah, yeah, we got a problem, Houston\nEyes all swoll when the God repute them\n\n[Interlude]\n\n[Verse 3]\nLike we need ghostwriting, mothafucka, we the titans\nYou catch your head cracked with no dice, man\nHood like the dollar van, Taliban carrying bombs\nVerbal onslaught, warhawk, blowing your flag\nThrow in your towel, there's no chance, load up the mag\nHold down the Shao, return home, holding your dome\nGlorious king, I wish you would\nHOUSE NIGGA! Couch gangsta, think you Suge?\nNah, you the fiend out, halfway house cat\nMissing tooth rap, touch Deck, I doubt that\n\"Pump It Up\" was wack, you swagger jacked \"Scenario\"\nAll that other trash, couldn't last in my stereo\nCouldn't beat Lloyd Banks, couldn't beat Meth\nCouldn't beat Jay-Z, what you got left?\nI show you what substance is (uncontrolled, nigga), ruggedness\nLike fifty ATV's, label me G\nYou a HOUSE NIGGA! Take your slippers off, Microsoft crook\nNever seen a juks, never seen your wifey cook\nNever seen you sitting with your seeds reading books\nWanna show the mass, that ain't work, so you sold your ass\nShowed the world you lame and no control you have\nYou Google MC, your feet the only 'sole' you have\nAct like you strong in the pits, up north\nGet your manhood took, right along with your kicks\nLike you got it going on in The Bricks, nigga please\nOnly ones know the words to your song is your kids\nAnd this here, won't even boost my career\nThis is kid's stuff, plus your name ain't big enough\nI said, \"fuck it, I'd do it for fun.\"\nHave 'em like, \"Damn, Deck, why you do it to son?\"\n'Cause he, stupid or drunk, loose wit the tongue\nPlus fronting like he want it, should of knew it would come\nAsk around, who dispatching the raw?\nThrow our name on the scale, my side probably crash to the floor\nCause I'm heavy like the classic Ford, before I fall\nI will shoot, stab, kick, bite, scratch and claw\nI mean fistfight, grab and all, I'mma get like that's for sure\nI'mma give right after the brawl\nSmall timers, too late for you to come up\nYou won't get a name off me, you get done up\nHOUSE NIGGA! You don't get your hands dirty\nThey don't respect you outside of Jersey\n\n[Outro]\nThey don't respect you outside of Jersey, man\nNobody fucking knows you\nYou trying to disrespect the legend\nWe king size in this shit, man\nUnderstand that, I go to mothafucking Germany\nJapan, Honolulu, France, Ethiopia, Croatia\nNiggas know my mothafucking name\nWho's you? Who's you?\nThey don't respect you outside of Jersey\nBow down to the face of greatness, mothafucka\nYeah, you better recruit everybody\nThe war is on, nigga, the war is on, nigga\nJohnny Blaze, you know I got you, man\nThis nigga is fish food, straight up fish food\nYou wanna swim with the sharks?\nI'm waiting for your response, nigga\nFive minutes long, next time I'mma give you eight\nA dirty eight, straight to the face\nHolla back, nigga", "image": "https://images.genius.com/ec81fe76ab1184b20e5472621f8a9698.497x394x1.jpg", "album": null, "year": "2009-07-08"}]}