{"songs": [{"lyrics": "[Verse 1]\nI remove your roof nigga let the sun shine in\nThirty-eight waist, enough to put one nine in\nReally a thirty-six without the gun I'm thin\nBut when the gat is tucked, I'm fat as fuck\nIgnorant bastard, I'm takin' it back to day one\nNo kids, but trust me I know how to raise a gun\nFor niggas that think I spend my days in the sun\nWell here's the shock of your life, the Glock not the mic\nHomie I'm not into hype; trust me, I'm still street\nYou still fuckin' up then trust me I still creep\nYeah I know the platinum chain be lookin' real sweet\nBut reach and I bury niggas sixty feet deep\nS dot Carter turn rappers into martyrs\nSeparate fathers from their daughters, why bother\nI'm a crook like you, I took like you\nI disobeyed the law, threw out the book like you\nHow dare you look at Jigga like I'm shook like who\nI keep the fifth with me nigga, come and get me..\n\n[Interlude]\nCOME AND GET ME!\n{*gong sounds*} Ka-ka-ka-ka-ka-ka-ka-come..\n{*bell rings*} COME AND GET ME! Ka-ka-ka-COME AND GET ME! ..\n{*bell rings*} COME AND GET ME! Ka-ka-ka..\n{*bell rings*} .. Ka-ka-ka-ka-come\n{*bell rings*} .. come and get me COME AND GET ME\n\n[Break]\nDon't know what y'all niggas is\nTryin' to do but I don't like it\nYeah, straight gangster shit\nHeyyyy, uh-huh-uh-uhh gangster shit\nUhh, straight gangster nigga\nRoc..\n\n[Verse 2]\nYo, the summer's 'bout to get hot\nNiggas home from jail and they plottin'\nHeard about the watch, the Bentley hard-top\nThe Continental T, got 'em resentin' me\nGod I work hard, please don't envy me\nI paid the cost to be the boss to floss this hard\nI can recall a year ago I almost lost this job\nAll y'all remember is the part about me parkin' the hard\nWhat about all them days I was walkin' my dogs\nBarkin' at broads, but they never hollered back\nAnd if they did all they said was, \"Where them dollars at?\"\nImagine, bein' skinny growin' up around brolic cats\nThe quiet assassin demeanor of them college cats\nUntil I got a gat and loudly start poppin' back\nRound the way, niggas called me Bobby Boucher\nNow all I hear is whispers of what you gon' do to Jay\nHow y'all gon' stick me up, take my jewels away\nPull out your gat, car jack me, take my cruise away\nWell I got news for y'all fools today, hey..\n\n[Chorus]\nI got, shots to give, come and get me nigga\nY'all wanna rob the kid? Come and get me nigga\nI won't, part with this, come and get me nigga\nI worked, hard for this, come and get me nigga\nI got, shots to give, COME AND GET ME...\nCOME AND GET ME...\n\n[Verse 3]\nI made it so, you could say Marcy and it was all good\nI ain't crossover I brought the suburbs to the hood\nMade 'em relate to your struggle, told 'em 'bout your hustle\nWent on MTV with do-rags, I made them love you\nYou know normally them people wouldn't be fuckin' witchu\n'Til I made 'em understand why you do what you do\nI expected to hear, \"Jay, if it wasn't for you..\"\nBut instead, all I hear is buzzin' in your crew\nHow y'all schemin', tryin' to get accustomed to my moves\nSo y'all could tape my mouth, stake out my house\nBut I got pride I'm a nigga first\nI gotta cock back and pull the trigger first\nThat's how Jigga work\nThe funny thing; I represent y'all every time I spit a verse\nAnd that's the shit that hurts\nBut hey, I got my mind right, got my nine right here\nSo when y'all feel that the time is right..\n\n[Chorus]\nI got, shots to give, come and get me nigga\nY'all wanna rob the kid? Come and get me nigga\nI won't, part with this, come and get me nigga\nI worked, hard for this, come and get me nigga\nI got, shots to give, COME AND GET ME...\nCOME AND GET ME...\n\n[Verse 4]\nAyo yo, ayo yo\nIt's only fair that I warn ya, rap's my new hustle\nI'm treatin' it like the corner, fuck with me if you wanna\nMy game change but my mind-frame remains the same\nI gotta protect what's mine\nShit I started from nothin'; zero, zip\nI made my way hustlin', I don't owe niggas shit\nI'm paranoid now, so I keep the gun gripped\nCats I played skelly with? Niggas done flipped\nI keep a banger in the ankle, one in the hip\nTwo in the stash, one come up when I shift\nI keep one under the chair where I sit\nI even got a gun in the hair in the bun of my bitch\nAsk Biggs; every time he'd come to my crib\nHe'd find another gun that I hid\nI'm ready to make this one of the, hottest summer there is\nEveryday like a hundred-and-six... shit...\n\n[Chorus]\nI got, shots to give, come and get me nigga\nY'all wanna rob the kid? Come and get me nigga\nI won't, part with this, come and get me nigga\nI worked, hard for this, come and get me nigga\nI got, shots to give, COME AND GET ME...\nCOME AND GET ME...\n\nI got, shots to give, come and get me nigga\nY'all wanna rob the kid? Come and get me nigga\nI won't, part with this, come and get me nigga\nI worked, hard for this, come and get me nigga\nI got, shots to give, COME AND GET ME...\nCOME AND GET ME...\n\n[Outro]\nMotherfuckers!", "title": "Come and Get Me", "image": "https://images.genius.com/16c23bf8d7a8a73a71d30d2ec47600b1.1000x1000x1.jpg", "year": "1999-12-28", "album": "Vol. 3… Life and Times of S. Carter"}], "artist": "JAY-Z"}