{"songs": [{"image": "https://images.genius.com/9703948ee40b2385b6c79a5f9eeffec3.700x700x1.jpg", "year": null, "lyrics": "[Intro - Akrobatik - talking]\nLet's take 'em back to '86\nCrack bones! (uh), yeah\n\n[Verse 1 - Akrobatik]\n206 simultaneous snaps\nIs what you suffer when I hit with you spontaneous raps (uh) (what's the deal?)\nIt's Akrobatik, unstoppable kid\nThey find broken bones like an archeological dig (archeological dig)\nAt the venue, from all the broken rappers I've been through\nI want to know the extremes their bones will bend to (bones will bend to)\nThey broke like chicks who act silly and fuck (silly)\nAnd Ambiguously Gay like Billy and Chuck (Billy and Chuck)\nI run that ass down like a 36 wheeler truck (*imitating a tire screeching*)\nWith no brakes (no brakes), cause I don't tolerate no fakes (no fakes)\nA \"Bonecrusher\" like Smith (Smith), \"Earthcrusher\" like Lif (Lif)\nPut you on your tail bone with a blow that's swift (blow that's swift)\nThe lessons of the game (uh), they need to go back and learn 'em (learn 'em)\nBefore Ak burn 'em (burn 'em) and leave 'em with a cracked sternum (sternum)\nYou want battle scars?? Fuck with me, you're gonna earn 'em (earn 'em)\nI guarantee you leave the party last in a body cast (in a body cast)\nNow you're stuck without bone support\nI'll crack your skull and go fishin for thoughts\nAnd find nothin (and find nothin), I'm seein that the playing field is empty\nThe effects of what I kick is bonecrushin when I MC (bonecrushin when I MC) (uh)\n\n[Hook - Cuts by DJ Therapy]\n\"Have you ever heard the sounds of bones splittin?\" (splittin, splittin)\n\"Stab your brain your nosebone\" - Prodigy\n\"My rap snaps ya sacroiliac\" - Jeru the Damaja\n\"Hey yo, step the fuck back, because my raps crack bones\" - Akrobatik\n\n\"Have you ever heard the sounds of bones splittin?\" (splittin, splittin)\n\"Stab your brain your nosebone\" - Prodigy\n\"My rap snaps ya sacroiliac\" - Jeru the Damaja\n\"Step back, because my raps crack bones\" - Akrobatik\n\n[Verse 2 - Akrobatik]\nAnd when I'm not exactly sure what I wanna do next\nI simply throw on that old school joint from Das EFX\n-- My thigh bone's connected to my, hip bone\n-- My hip bone's connectin to my huh, hardy har har har\nI laugh cause breakin your funny bone is humorous/humerus\nToo many injuries to count, they mad numerous (mad numerous) (uh)\nSnap your jaw with the mandible claw (yeah)\nNow you feel the pain victims of Hannibal saw! (uh)\nYo, you better keep your platinum in the baller zone (baller zone)\nYou can't hold the weight of that medallion with a broken collar bone (broken collar bone)\nAnd all you \"Internet MC's,\" please (please)\nYou can't key style with snapped phalanges (phalanges)\nFist through your monitor, breaks your eye socket (uh)\nNiggas know the party ain't through, 'til I rock it ('til I rock it)\n(what's your name?) Akrobatik, one eighth of a ton\nSix feet and two inches son, he never flinches (he never flinches)\nCrack your pelvis for shakin like Elvis (Elvis)\nStrip your vertebrae from your body like a shellfish (like a shellfish)\nBody armor can't stop the bum rush\nAk leaves the opposition hush, feel the bone crush, what?\n\n[Hook]\n\nYeah\n\n[Outro - Cuts by DJ Therapy]\n\"The, the sounds\"\n\"The, the, the, the, the, the sounds\"\n\"Sounds, sounds, of, of, of, of, of bones splittin\"\n\"Bones splittin\"\n\"Bones, bones, bones, bones splittin\"\n\"Bo-bones splittin\"\n\"crack bones\"", "title": "The Bonecrusher", "album": "Balance"}], "artist": "Akrobatik"}