{"artist": "Boldy James", "songs": [{"album": null, "title": "Chirps", "year": null, "lyrics": "[Intro]\n\n[Verse 1]\nBandidos, bandidos\nLeft pocket full of BBQ Fritos\nBandidos, bandidos\nAnd this is not your cheese, bitch, Doritos\nBandidos, bandidos\nFree Chi and R.I.P. Santino\nMy gambinos, for selling dinos\nI got a pocket full of flamin' hot Cheetos\nHowever you want it my nigga you can get it\nI usually sell 'em whole, but for you I can split it\nAnd cook it right in front of you, just give me 20 minutes\nAnd that's gonna cost you if I gotta show you how I did it\nMixing baking soda with the yola, I'm a wizard\nAnd my wrist game colder than an Oreo blizzard\nSpend 15 O's out a quarter of a chicken\n5 O's over that's an extra 10 big ones\nIf you really getting money, in Detroit we say you getting 'em\nIf you got it all on you, shit then where the fuck is it\nCause I don't fuck with no snitches\nI keep most of my bidness\nOn the need to know and all you need to know is what's the ticket on a chirps\n\n[Hook 2x]\n(Kilos, birds, chickens, eagles, bricks)\n(Kilos, birds, chickens, eagles, bricks)\n(Hard, soft, however you want it nigga)\n(Hard, soft, however you want it nigga)\n\n[Verse 2]\nI got them bandidos\nAnd I been coppin soft, nigga you can ask Gino\nR.I.P. E Flowers and Moschino\nBeen getting money in the park ask Bino\nFree D-Lo, what up Cino\nThe whole crack spiff love me, ask lil B-O\nAnd skito, remember me and little D-Bo\nUsed to live in house on mana behind the P-O\nOr when I was in Boysville, paying the C-O\nTo sneak in morphine pills for me and Speedo\nCortez like \"What you gonna do when you get free Bo?\"\nBuy 2 guns and another quarter a kilo\nWhile y'all niggas is at Northlands, skating in trios\nI was on the highway with a quarter a kilo\nAnd I did it all my way, without Carlito\nIn the hood brick life and with that libo\nAnd [?] selling chirps\n\n[Hook 2x]", "image": "https://i.genius.com/6c415f4dab8083310481b9fd82d82fd218bb6f4a?url=http%3A%2F%2Fboldyjames.com%2Fwp-content%2Fuploads%2F2013%2F08%2Fmaxresdefault.jpg"}]}