{"artist": "Immortal Technique", "songs": [{"title": "The Prophecy", "lyrics": "[Intro]\nSo you're the motherfucker they call Immortal Technique\nWhat the fuck make you so special, nigga?\nHuh? What the fuck do you do?\n\n[Verse]\nI calculate planet alignment like Mayan astronomy\nDiscoverin' atrocities\nWorse than Aristotle subjectin' children to sodomy\nYour theory of the galaxy is primitive like Ptolemy\nThe truth about the universe dug up like Aztec pottery\nUnpredictable results like experimental psychology\nI stomp the streets with emcee's beneath my feet in colonies\nBut presentation and spirit revolve around autonomy\nSearchin' for monogamy\nAnd cuttin' fake bitches out of my mind like a lobotomy\nSo obviously I'm not gonna be here to play games\nWalk the top of the world and leave the arctic circle in flames\nBattle the beast and false prophet predicted in the King James\nI give a fuck about your emcee name, I don't admire you\nOnly by dental records will you be identifiable\n'Cause the future is not reliable\nRemember when rap was not economically viable?\nComparable to what motherfuckers think of me\nI might be nobody, but wait 'til I'm together like a symphony\nResoundin' sound that will continue infinitely\nAngel of Death punishin' all those who live in infamy\nAnd shine so far away from you\nYou'll never get a glimpse of me\nAttempts to extinguish me don't even bother me none\nLike retarded kids throwin' ice cubes at the sun\nA victory against Immortal Technique will never be done\nJust degrees of losin' it every second you're addin' one\nSome niggas dream of pushin' kilos, but I drop tons\nWith more facts and formulas and philosophical logic\nThen a basement full of scientists puffin' on chronic\nDip the mic in potassium cyanide and liquid bubonic\nAnd use it as a sonic wand to find the spawn of the demonic\nScreamin' like Onyx is of absolutely no consequence\nThe poison is dense enough to clog up your arteries\nMercy is not a part of me\nI cause you bodily injury permanently\nBecause simply verbally murdering me\nIs inconceivable 'cause of the unbelievable evil injected inside\nThe blood stream of my people\nAnd redemption is not located under a church steeple\nThe feeble and the meek in soul just like the technique\nWill inherit the Earth, but the Earth will be weak\nMother Earth in her decrepit terminal illness physique\nThe year 3000 is bleak, no happily ever after\nJust death following the Fourth Reich disaster\nA legacy of bastards, with plastic explosives\nYour future's been eroded, 'cause you forgot that when your free it's multiplied indefinitely\nBy the struggle that be, the struggle I see\nTo socialistically unite the Third World countries\nExpose hypocrisy in America's democracy\nSloppily obsessed with stoppin' me 'cause I speak prophecy\nTrample and dismantle your capitalist philosophy\nThe same way I stomp the conquerin' rap monopoly\nAnd I'm not a fuckin' prophet… but that's the fuckin' prophecy", "image": "https://images.genius.com/9c9631e16897ed9bc090afd0a05da5ae.1000x974x1.jpg", "album": "Revolutionary Vol. 1", "year": "2001-09-18"}]}