{"songs": [{"year": "2007-11-13", "title": "Anybody Can Get It", "image": "https://images.genius.com/957f0d0a594a246a123db431c7990d2a.1000x1000x1.jpg", "lyrics": "[Intro]\n\"This shit is hot.  Who is it?\"\n\"No clue\"\n\"Sounds like Eminem to me\"\n\"What you know about hip hop, Drama?\"\n\"What are you crazy, bro?  I'm OG\"\n\"OG?  The last hip hop CD you bought was the kid who played box set\"\n“So who is it, then?”\n“I never heard it before”\n“Yeah, me neither”\n“Since when does E listen to rap music?”\n“Saigon”\n\n[Verse 1: Saigon]\nY’all can try to [bear up?] in the sagas a war survivor tell\nYou might as well.  I’m out of jail—shit is ‘bout to get hot as hell (“Fire it!  I double-dare you!”)\nHis last word before volunteering his chest for the 30-inch slug to tear through\nNo, I don’t confuse you.  I tell the whole truth unlike the news’ll do\nListen ‘cause shit is sort of unusual\nLiving Markie, man Mike living 422 and [?]\nShorty that talk a lot of shit but can’t fight\n[He hit him and his many B with?] chilling like after smoking twenty-three nicks\nGuzzling vodka with Hennessey mixed\nReminiscing of penitentiary tricks, enemy hits\nGetting chased out the Bronx, fucking with some Trinity chicks\nSomehow, the conversation switched to hip hop\nAll Mike was saying was some shit ‘bout how we miss Pac\nAnd how all these rappers that’s out now is riding his cock\nAnd if Makaveli was here, he would have this shit locked\n\n[Hook: Saigon]\nAnybody could get it—so watch what you say out your mouth\n‘Cause you could catch it on the way out your house\nAnybody could get it—nigga, you could be hugging your bed\nAnd get hit with a slug in your head\nAnybody could get it—white, black, old, young\nThe lead in this gun ain’t prejudice, son\nAnybody could get it—so watch what you say and watch what you do\n‘Cause, duke, it could happen to you too\n\n[Verse 2: Saigon]\nNow Markie was like, “You wiling, son.  [?] niggas [?] crazier\nThat’s like comparing Penny Hardaway to McGrady or\nNike Air to a Avia.  Regular soldier to them ones in Saudi Arabia\nYou got to be crazy, bruh\nAll that shit was cool then, but now is now\nThat ‘save the world’ shit been went out of style”\nWow.  That must’ve made Mike mad\n‘Cause he had the look on his face like he was so ready to break bad\nHe said, “Aight.  Then tell me who can fuck with Saigon\nNobody—and that’s some shit I’m down to bet my life on\nI got a cousin in the pen—daddy ain’t even met\n[Corrode?] his label and they sent them commissary in sweats\nFar as real, that’s as real as it gets\nAnd that’s the reason he the rookie that collect more respect than the vets”\nBut Markie said, “Fuck Saigon!  That nigga suck too!”\nMike took it there and said, “Suck my dick!  Fuck you!”\n\n[Hook: Saigon]\nAnybody could get it—so watch what you say out your mouth\n‘Cause you could catch it on the way out your house\nAnybody could get it—nigga, you could be hugging your bed\nAnd get hit with a slug in your head\nAnybody could get it—white, black, old, young\nThe lead in this gun ain’t prejudice, son\nAnybody could get it—so watch what you say and watch what you do\n‘Cause, duke, it could happen to you too\n\n[Verse 3: Saigon]\nNow they in a fighting position.  Markie threw a right with precision\nHit his eye—he had to fight for his vision\nHe ran back to the crib to get a knife from the kitchen\nThought about gutting this nigga like them lifers in prison\nSecond thought, he didn’t like the decision\n“Nigga tried to play me out.  ‘Bout to take away the life that he’s living”\nThought about the .38 near the dirty plate in the cabinet\nRan through the crib heated and proceeded to grabbing it\nCame back out.  Markie was still on the bitch\nSeen Mike coming towards him and he ain’t even flinch\nSaid, “Nigga, if you got a weapon, then you better use it\nDon’t get little ass hurt ‘cause you loving Saigon music”\nBut he was prepared to.  Said, “I ain’t tryna hear you”\nPointed the gun at him.  Markie said, “Fire it.  I double-dare you\nDouble-dare you shoot me, mutha…  Nigga, I take your...”\n(*Gunshots*)  Oh shit.  Hold it, nigga\n\n[Hook: Saigon]\nAnybody could get it—so watch what you say out your mouth\n‘Cause you could catch it on the way out your house\nAnybody could get it—nigga, you could be hugging your bed\nAnd get hit with a slug in your head\nAnybody could get it—white, black, old, young\nThe lead in this gun ain’t prejudice, son\nAnybody could get it—so watch what you say and watch what you do\n‘Cause, duke, it could happen to you too", "album": "The Moral of the Story"}], "artist": "Saigon"}