{"artist": "Willie the Kid", "songs": [{"year": null, "lyrics": "Feat. La the Darkman, Lonnie Mack\n[Intro: La the Darkman (Willie the Kid)]\nYeah nigga, gangsta shit, you heard? CUB, AMG\nEmbassy, yeah, Willie the Kid, Lonnie Mack, LAD (Sing Sing)\nMotherfucker (I said um)\n[Willie the Kid]\nWillie the Kid so cold, niggas call me free arm\nWould I be on? Be eons beyond you weak pee-ons\nFucking morons, you boring me\nTell my little freak bitch to pour me, the dealership ??? me\nPardon me, bullets out the cartridge hit your arteries\nHeavy artillery, my arsenal and armories\nI'ma be under palm trees when your head split\nSing Sing the gang, running guns off of Craigs List\nHope there's no confusion, my niggas bring the tools in\nOpen wounds oozin, there's multiple contusions\nClusion, moral of the story, don't be snoozin\nKissin on the trophy, I don't understand loosin\nWho starvin? So much snow, we need toboggans\nPrices so low, ain't no need to bargain\nMy joggin, harvesting hip plants and gardens\nI'm trying to move far where white folks are jogging\nMarksmen, sharp shooters, shoot the wings of a gnat\nWish niggas shut the fuck up, other then that\nI'm good, I'm grateful, these niggas distasteful\nWillie trap papers like staples, the hateful\n\n[Chorus X2: Willie the Kid]\nWhen there's drama, niggas know\nAll you hearin is the sound of the semi (pah pah), better let em know\nLay em down (pah pah) chopper get to choppin\nLay em down (pah pah) better let em know\n[Willie the Kid]\nYou niggas forever petty, you're never ready, I'm everything\nThrough the midwest, I got niggas in every bing\nI own your Jackson Peakins, even ?Tarahoe?\nCount tech, PLR, with the air holes\nWe air those, do a nigga bad, somethin terrible\nYeah, I gotta laugh, you niggas is hysterical\nImperial, Crown Prince Abdullah, big chain\nRemind you of a cooler, brain like a computer\nA shooter like Dick Cheney, movin like Zab Judah\nMackin to the ladies, dick between their hooters\nEmpty niggas pockets, split it between my shooters\nYou bitch ass niggas need nail polish removers\n[La the Darkman]\nI'm brave like a Marine, cunning like a snake\nHe ok, he good, but I'm great\nOut ?RA?, blowin purple like a grape\nI eat your food, then like your plate, it's LA\n\n[Chorus X2]\n[Lonnie Mack]\nI turtle a nigga, put your head in a shell\nShell in your head, nigga, that's enough said\nMr. Embassy Cartel, AMG Mafia\nWe lose niggas for real, nigga we'll Hoffa you\nSwimming with ???, flown from the ocean flow\nA nigga say he want it, he lying like Pinocchio\nFind a hand in a brown paper bag on your door step\nThe hostage been talked to, be we ain't turned em ghost yet\nMake a foul call cuz you done barked at the wrong dog\nMarked dead, fool look like ketchup on a corn dog\nChopper aimed high, tryin to decapitate a hater head\nNiggas dressed up like a tall Mr. Potato Head\n\n[Chorus X2]", "image": "https://images.genius.com/df120facc435b1e9b1715c0edd93d400.800x800x1.jpg", "album": "Absolute Greatness", "title": "Let Em Know"}]}