{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro] (Only on the MP3 version)\nYou know I heard Sharp Sound play this the other night at Transit\nAnd I thought to myself....why not?\n\n[Verse 1]\nUnion Jack goblen' major whiskey problem\nBazooka tooth batterang I'm a man that need no robbin'\nMayday all day long and the fam is steady mobbing\nTagging up your coffin with a swag that's panty dropping\nThis ain't how Wrek rhymes this is out of character\nPlease don't let it frighten you, be like Frank Bannister\nI've been bored for so long please send me a challenger\nEven if it's in your women and I gotta get it up and tell your mother you dont want to handle her\nPlease smile wide for the camera\nExtinct the think you even matter bro\nMy ink is ink and it will damage you\nI'mma link the drink and I'm a jack of all trades\nD-d-dangerous family I'm a plan to damage so say with a whole lot of Jameso\nSlam the whole stage up and better but I stand and grab the whole thang man....\n\n[Bridge]\nAlright that was my beat your bitch down warm-up\nLet me see if I could touch the god level. Hey D-Ray could you pass me a red bull?\n\n[Verse 2]\nLet's go, I've been running for a minute\nAnd it's almost at a limit that I'm getting all civic\nReally got a headache and I think need a medic\nIn this game is all the same you play your lane iust to get the credit (go!)\nLast year would they let us get it? (No!)\nWanna hate us on every second? (So!)\nThat's fine motherfuckers, I don't need your shit\nI'mma make my records\nEven if I have gotta to hit them with a little gimmick\nI'mma get them with a little bitter leave another limit\nI'mma split them up and leave them living up in pacific\nI'mma kill them leave a critic swimming up until the crickets\nSpit it while I give them all the bow like Riddick\nOld clichés, hey so inventive\nYet a better writer on my own incentive let a palar that we follow no man no pence\nFuck a breath\nAnd regrets, live life fast get high and bet\nGet a bucket of fuck it and skydive the rest they ducking the double and high fives be left\nI'm a trip wire all hit fire no shit sire split to get wired\nTip the lip wire I'm quick to split liars but I rather iust sit Here coke and smile\nEven when I'm on a little hit I gotta get them to the better bit\nThat's my job, ho\nMenace to the enemy I never knew a remedy\nFor what's coming out my jaw\nSo\nI'mma hit them with a whole lotta of cinnamon\nFollowed by a dump truck filled with bar soap\nJust get inside and get your kids and wife it's going down\nDon't get you jaw broke\nMayday, Mayday, ...", "title": "Look At Me Now (Freestyle)", "year": "2013-01-31", "album": "The Rooftops Mixtape", "image": "https://images.genius.com/88e068903a4f33a883dd03382fcde905.700x700x1.jpg"}]}