{"songs": [{"year": null, "image": "https://images.genius.com/ce0c7f002d95c6699740803862bdb51c.500x500x1.jpg", "title": "Come, Go, See, Know", "album": "The Midwest Cowboy", "lyrics": "[Intro: Bizzy]\nAnd one for the love of the Lord\nHeavenly Father we need us a sword, sword, sword, sword, sword\nAnd one for the love of the Lord\nAnd one for the love of the Lord\nHeavenly Father we need us a sword, sword, sword, sword, sword\n(Get off me, get off me!) What, what, what?\n\n[Chorus: Bizzy Bone]\nAnd where do we come, come, and where do we go, go\nTell me what do we see (see) see, tell me what do you know (what, what?)\nAnd where do we come, come, and where do we go, go\nTell me what do we see (see) see, tell me what do you know (what, what?)\n\n[Bizzy Bone]\nAnd one for the love of the Lord and Heavenly Father we need us a sword\nBut we know no weapons are formed\nThey'll go up against us, we got us no sword\nAnd I'm ridin the midst of the war, money galore, gunning my gunny\nMy sonny, and honey I'm feelin it raw, watchin it every step of the door\nWhatever you seen and you saw\nYou should be shuttin your jaw, killin 'em y'all\nSee that is the only thing I wanted to do, what I'm here for\nRemember you gotta be you, I gotta be me, we gotta be\nForever together you'll see, where most of them flee it'll be B.B\nI gotta do me; what'chu expect, forgot that I come from the set?\nWanna get wet and punched and how to get crunched\nYou come and you get with the best\nNevertheless, one of the blessed, some of the rest, comin to test\nEnvious friends, we're here for our enemies\nNever pretend to be rude I don't even have to poke out my chest\nWe up in the rep, the story is told but baby you don't know the half\nPlaces I done been without sellin out\nIt'll make me cry until I laugh ('til I laugh)\nThe higher power watches over me every day\nEvery step of the way\nNow one in the house, yes, it's one forever\nNow it's time to move out, rough, rugged and clever\n\n[Chorus]\n\n[Bizzy Bone]\nTragedy, bodies are flyin, spirits are cryin\nI am Bryon, here to rock it for planet Orion\nDeep, breathin and sighin, tryin to make it righteous\nWith everything goin against us, why they still tryin to fight us?\nBrighter days for the titans of Christ, throwin the rice\nPrices is ice, cyanide, high in the light\nElevations of plateau-able, still with the unknowable\nShowed up, for the show-able; still, I'm down to roll-able\nYou know, ready to go, the posse of my people\nMeek, and still feeble, royal, and legal\nI'm feelin good baby, and makin love, it is phenomenal\nDon't treat me like an animal, I'm not an honorable\nGet it poppin baby\n\n[Chorus]\n\n[Bizzy Bone]\nNow let me sit back, relax and let these rhythms teach you the facts\nAs I massage yo' feet - you need somethin to eat? (woo)\nIt's Mr. Loverboy, with a pocket full of tender\nBaby, these are my sisters and brothers, we livin in splendor\nRemember me? It's baby Bryon born in September\nI will never leave you momma, not never, ever, ever\nI mean forever, forever ever ever\nThrough the winter and the dawn even of, stormy weather\nJewelry, draped in the dawn, court cases adjourned\nMake, praises of joy to the Lord, poise boy\nI'm tellin them that I need some quiet to kill the fuckin noise\nThese motherfuckers don't know I need some oint-ment\n\n[Chorus]\n\n[Outro: Bizzy]\nThank you, thank you, thank you for tunin in\nMost definitely, thank you very very very much\nPraise God up in here; oh hey, sit down, have you a drink\nY'understand what I'm sayin, get you a drink\nLean back, let your toes rest\nBizzy Bone the Midwest Cowboy, please believe me\nWith no bullet-proof vest, it's on and motherfuckin crackin baby\nShouts out, to the family members\nLil' Layzie Bone, in the motherfuckin house\nKrayzie Bone, in the motherfuckin house\nWish Bone, in the motherfuckin house!\nFlesh-N-Bone, can't wait 'til you get out nigga\nCan't wait 'til you get out nigga, one time for they mind\nNo evil, no weapons formed against us shall prosper\nPlease trust and believe, one time for they mind\nWhere do we go?"}], "artist": "Bizzy Bone"}