{"artist": "88-Keys", "songs": [{"album": null, "lyrics": "[Verse 1: Mac Miller]\nThey told me, \"Don't make a promise you can't keep\nAll the drugs in your system, you can't sleep\nHow many times you had to buy a Plan B\nFor a girl you never bring back home to meet your family?\"\nMan, man, I swear it's what I dream about\nEver since my mom told me that she need me out\nAlways smoking weed, 'causing trouble, never clean the house\nBut I paid her back for everything; I guess we even now\nNothing better than some head after a long day\nThat's the only thing that ever keep mine on straight\nAnd she asked me, \"Why the long face?\"\nHow I spent 350 dollars on this entrée\nI drown my sorrow in that bottle\nToday is full of regret, find forever in tomorrow\nMan up, what's the problem?\nEverything is Jazz and I'm Stockton (Haha)\n\n[Chorus: Mac Miller]\nYeah, I know it seem a little bit strange sometimes (Yeah, yeah)\nEverybody live a little, everybody die (Yeah, yeah)\nThat's life (That's life), whatchu gonna do? (Whatchu gonna do?)\nThat's life (That's life), baby, I would spend it all witchu (All with you)\n\n[Verse 2: Mac Miller]\nAnd I'm headed to the other side, where the grass is always greener\nAnd your bitch is down to ride, but that ass is always meaner\nSee, my cash got deeper and my morals disappeared\nNever thought I'd be a asshole, this my last show\nCan I please get a standing ovation?\nA hunnid naked bitches in my dressing room waiting\nWe lost a lot of blood for this fucked up nation\nBut me, I'm getting high, making love in that spaceship\nSo what are the basics? Tell me your problems\nYou losin' your job or, even worse, you don't got one\nSo hard to stay sober when you feeling fucked over so much\nAlways coming up short, you like the roach of a blunt (Yeah)\nAnd I could never sleep at night\nFuck paying bills, I need a brand new lease on life\nWhy does doing wrong always feel so right?\nWell, I guess, fuck it, that's life (That's life)\n\n[Chorus: Mac Miller]\nYeah, I know it seem a little bit strange sometimes (Yeah, yeah)\nEverybody live a little, everybody die (Yeah, yeah)\nThat's life (That's life), whatchu gonna do? (Whatchu gonna do?)\nThat's life (That's life), baby, I would spend it all witchu (All with you)\n\n[Bridge: Sia]\nNow, I wish I could take all your pain\nBut when the toxin is fame\nThe drugs, they don't fill the hole, no\nConnections the game\nWish you'd picked up the phone\nKnew that I'd be your home\nKnew that you weren't alone\nKnew that you weren't alone\nKnew that you weren't alone\n\n[Outro: Sia]\nI saw you act a little bit strange sometimes, you'd say:\n\"Yeah, everybody lives and everybody dies, one day\"\nWell, that's right, whatchu gonna do?\nThat's life, and I wish you could have spent it on the truth", "image": "https://images.genius.com/1b2ca3520ed031069b5450a86c1bab67.1000x1000x1.jpg", "year": "2019-06-20", "title": "That’s Life"}]}