{"songs": [{"year": "2009-10-11", "image": "https://images.genius.com/20ef7a3d0f457d0220b6f742df404e45.334x334x1.jpg", "title": "Hey Heystak", "album": null, "lyrics": "[Intro: Bizarre]\nYeah, Detroit, stand up\nShaaady\nHey Haystak, sorry for the delay\nSee we been on tour for the last 48 days\nWe're potluck, you know what I'm saying?\nI ain't had time to get back to you I been on my grind, grinding\nBut it's time now, I'm back in the studio, for your ass nigga!\n\n[Verse 1: Bizarre]\nWe smoke kush and drink malt liquor\nCrazy white boys meet some crazy ass niggas\nWe pull them triggas, open up your chest\nCall the EMS, body such a mess\nIt's the fat white boy from Nashville, Tennessee\nAnd you ain't heard, 'bout them boys from the D? (You ain't heard?)\nIt's the no fly zone, ask Shane Capone\nWe the reason Whitey Ford didn't make it home\nCome to Detroit, talking shit\nYou always talking 'bout pits?\nWell watch my dogs sit\nD12 nasty, running the streets\nYou a fake Bubba Sparxxx that can't stay on beat\nAnd we a hundred deep, ready to stomp a ho\nAlways screaming \"family\" but you ain't no juggalo\nGot kicked off tour, for smacking a girl\nWe'll come to Nashville, and fuck up your world\nAnd when I see you, I'ma send them slugs\nYou  probably wanna get naked, and wrestle in the mud\nFree my own boy and smoke a little bud\nDrink some Jägermeisters and get fucked up\nYou all on camera, showing ten stacks\nYou need to pay Oktaine father dad back\nWe get into a boxing match, I'll put you in a daze\nAnd have my nephews, beat the shit outta Lil Blaze\nI'm blazing the haze, and popping the pills\n(Yo Bizarre chill, yo chill)\n\n[Interlude: King Gordy]\nAyo, chill\nChill Bizarre\nNigga let your high guy get at him\nKing Gordy, Haystak, you are a full blown bitch\n\n[Hook: King Gordy]\nHey Haystak (Bitch)\nYou are really just a big gay fag (Homo)\nFucking Lil Blaze in his ass, like that, he's a child\nYou like to jack your pit bulls off quite fast\nWith your fat white ass\nHey Haystak (Bitch)\nDetroit niggas came to Tennessee to rape that\nPretty little mouth that your wife got and you hate that\nWe came to fuck your little children as some payback\nYour rhymes are straight whack (Yeah)\nHey Haystak\n\n[Verse 2: King Gordy]\nNigga, Haystak?\nYou're more like stank fat, fake whack, cake rap, ain't scrapped in years\nGot his face slapped and tears came falling, got his chain snatched (Bitch)\nFace facts, your rhymes are straight whack\nYou are garbage trying to start shit with Marshall\nBut your rhymes were too awful\nWhen he saw you probably laughed so hard\nSo milk shot out of his nostrils\nBut you really want Marshall to be your father\nWho molested you, want to slob Marshall's nob off\nGod, you wish you could get pregnant hoping Marshall's the papa\nNigga why did you start up?\nWhy did I even bother?\nWhere's your wife and your daughter? (Where!?)\nSee Jeffrey I'm too vicious\nAnd them rhymes you were kickin' were quite bootylicious\nWanted to blow Scarface, took a lot to stop you\nAnd Def Jam dropped you ‘cause filling you wasn't possible\nYou're finished when I hit a menace, shit he'll need a dentist\nWishing that he was Bubba Sparxxx's girlfriend's assistant\nSo he can assist in, putting Bubba's dick in her mouth\nThen take it out, and when he's coming, put it in his\n\n[Interlude: King Gordy]\nYou fucking faggot (Fag)\nHaystak (Bitch), hey fag\nYou're a full blown bitch\n\n[Hook: King Gordy]\nHey Haystak (Bitch)\nYou are really just a big gay fag (Homo)\nFucking Lil Blaze in his ass, like that, he's a child\nYou like to jack your pit bulls off quite fast\nWith your fat white ass\nHey Haystak (Bitch)\nDetroit niggas came to Tennessee to rape that\nPretty little mouth that your wife got and you hate that\nWe came to fuck your little children as some payback\nYour rhymes are straight whack (Yeah)\nHey Haystak\n\n[Outro: Bizarre]\nYeah\nSee, enough is enough\nWe tired of hearing you motherfucking talk\nShut your motherfucking mouth up, punk\nYou diss Eminem, you dissing me\nYou dissing my city, nigga\nAnd we can't have that, Haystak, ha ha ha\nAnd this [?], we ain't even let loose\nYou know what I'm saying?\nWe gon' let the pit bulls out on your ass, the real pitts\nCrazy ass niggas, you want it you got it, it's on, ha ha ha\nAnd don't worry 'bout Marshall responding\nHe too busy dissing real motherfuckers like Mariah Carey\nWe got you, you light work, biatch"}], "artist": "Bizarre"}