{"songs": [{"album": "prEVOLVEr: The Mixtape", "image": "https://images.genius.com/f9f928db2773faa98c77d896a8576381.500x500x1.jpg", "year": null, "title": "Danger", "lyrics": "[Intro]\nF-Y-R-E, Pain\nOk, I ain't gotta tell ya on the track baby\nDanger, danger (this shit is)\nDanger, danger (this shit is)\nDanger, danger, danger, danger\n\n[Verse 1]\nMan, I'm so spectacular I manufacture hits like Hit Factory\nI'm on my shit so tell that bitch to get back from me\nMack black Cadillac's and G's\nSo many them hoes be running after me\nWe might need a limos worth of backseats\nCause all in my shotgun be ridin shotgun\nFor niggas that's looking at me wrong like a hot nun\nIt's obvious these dumb hoes don't get it yet\nFuckin around with Pain and get pwned on the internet\nThis shit I'm doing is illegal like three murders\nSo put'cha bread up I got beef like three burgers\nLick shots a make ya team jump like three hurdles\nYou niggas weird and slow and I'm smarter than Steve Urkel\nSee me?\n\n[Interlude]\nDanger, danger, danger, danger\n\n[Verse 2]\nYeah, they say that boy got the bar on his neck\nAdvertising for other niggas and they ain't got off of the check\nCause I ain't looking for no money, I'm just cool like that\nNa, now they don't teach you nothin' in yo school like that\nSo these niggas mad 'cause I dropped out, but I still got paid\nAnd how I keep my face clean, but I still got maids\nHow I unmanaged the dreads and how I get my braids\nBut I'm awesome, so you can't say that shit 'bout Pain\nSee me?\n\n[Interlude]\nDanger, danger, danger, danger\n\n[Verse 3]\nI'm a keep it going like a marathon, A Merry-Go-Round\nIf Mary make it to my room, then Mary-Go-Down\nHold up. slow down, I bet'cha know now\nOld-fashion show down with a new fashion 4-pound\nYeah, show some respect in this bitch\nYou getting stacks of money, I get stacks of checks in this bitch\nNigga, it's about to be a train wreck in this bitch\nMy niggas ready, that's why all of 'em sweating and shit\nI got another group of niggas that'll make ya leave\nInstead of putting on ya act, that's just make believe\nMaybe it's all of this money, maybe the ice on my wrist\nMaybe the Phantom outside, maybe it's Maybelline\nSee me?!"}], "artist": "T-Pain"}