{"artist": "Knoc-turn’al", "songs": [{"image": "https://images.genius.com/6fade8c4fc0be289776bb35d74635cf6.640x640x1.jpg", "title": "The Way I Am", "year": null, "album": "The Way I Am", "lyrics": "[Intro - Knoc-turn'al - talking]\nYes\nI'ma do me\nI'ma do me\nYou gon' do you\nYou gon' do you\nI'ma do me\nI'ma do me (yes)\nYou gon' do you\nYou gon' do you\nI'ma do me\nI'ma do me\n\n[Verse 1 - Knoc-turn'al]\nI, I've been ridin for five years with D-R-E\nYou minor, I'm major league\nBut what y'all didn't expect to see\nIs me on TV with Snoop D-O double G\nSmoke weed, get a buzz, show a young G love\nIf you don't give a fuck (what?)\nPut your hands up (what?)\nParty like it should be done\nYou leaving at 2 girl? You know the night's just begun\nThe after hours spot is off the hook\nThe ugly crows buy the bottle of Crook\nThe fly crows keep smokin the kush\nSo you know I got a bird and a bush\nYou run up, you get stomped to mush\nLook it here, I talk to God, I don't pray\nWhen I want somethin, I don't play\nIt's Knoc-turn'al with a capital K\nBest believe it's a brand new day\nAnd if you feel me sunshine, come around my way\n\n[Chorus - Knoc-turn'al]\nPut your hands up, come off them grams\nI ain't trippin that's the way I am (the way I am)\nAnd if you see me with heat in my hand\nYou better duck that's the way I am (the way I am)\nI can't believe ya got up in them pants\nSexy lady gon' do that dance (*breathing noises*)\nCome on over when your sick of ya man\nAnd we can chill that's the way I am (the way I am)\n\n[Verse 2 - Snoop Dogg]\nLight blue shoes (shoes), dark blue pants (uh)\nFour, five bitches and they all wanna dance\nI don't get down bitch, that ain't my program\nI don't hold hands and I don't slow jam (uh uh)\nI C-Walk in the park with the fellas\nAnd make suckers jealous cause they can't out sell us\nYou wanna join us? Well here's a few pointers\nAbout them riders from the state of California\n(Knoc-turn'al), knock on wood\nEastside, LB, shit it's all too good\nIn the hood, he's so \"Confidential\"\nWith the way that we get you and the shit that I hit you\nAnd spit you, split you, sit you down\nClick, cock, pop at you, rock you and knock you down\nPimp slap you and sock you down\nLifestyles of the motherfuckin Dogg Pound, now (*echo*)\n\n[Chorus]\n\n[Break - Knoc-turn'al]\nI don't know that girl I just met her\nSippin on sour Amoretta\nShe gon' do her thing if I let her\nBut I'ma bounce cause her friend looks better\nI like the way she knows me\nLike the way she got herself in V.I.P\nIf she sees K-N-O-C\nShe gon' chill and wait out front for me\n\n[Verse 3 - Knoc-turn'al]\nWho do you know that rides for the coast\nWith a new breed and style of rap like me?\nI had the patience to study the game\nDr. Dre made two Chronics and this is Chronic Three\nI make classic hits and buy classic cars\nAnd see classic hoes at classic bars\n(Now I just step in the spot and the girls all pause)\nMagic stick, I break down walls\nGot my heat if some shit jumps off\nReally you steppin to me is a lost cause\nParty animal, here since a quarter to ten\nBabyface, six-two with a L.A. brim\nI got shell toes on, I don't wear them Timbs\nI got hoes, got weed, and a gallon of gin\nAin't no tellin what I might get in\nThe first night, do it right, I'ma do it again\nC'mon\n\n[Chorus] - 2X\n\n[Outro - Knoc-turn'al - talking]\nYou know where we be, in da club\nCome find me, I ain't trippin\nAir is free, so what ever you wanna do\nFor real though\nHuh, it's just the way I am"}]}