{"songs": [{"lyrics": "[Skit: Krazy D + Eazy-E (Dr. Dre)]\n*Sirens*\nAh shit. Man, them pinche black gangstas are at it again\nI wonder who they fucked up today?\n*Screeching Tires*\nYou motherfucker!\n*Machine Gun Fire*\n(Got him)\n\n[Police + MC Ren]\nPull over to the side right now\nMan, fuck them motherfuckers!\n\n[Intro: Eazy-E + Sample]\nYo, Dre! Give me a funky-ass bassline!\nRight here!\n\n[Verse 1: Ice Cube]\nHere's a little somethin' about a nigga like me\nNever should've been let out the penitentiary\nIce Cube would like to say\nThat I'm a crazy mothafucka from around the way\nSince I was a youth, I smoked weed out\nNow I'm the mothafucka that you read about\nTakin' a life or two, that's what the hell I do\nYou don't like how I'm livin'? Well, fuck you!\nThis is a gang and I'm in it\nMy man Dre'll fuck you up in a minute\nWith a right left, right left, you toothless\nAnd then you say: \"Goddamn, they ruthless!\"\nEverywhere we go they say: \"Damn!\"\nN.W.A's fuckin' up the program\nAnd then you realize we don't care\nWe don’t just say no, we’re too busy sayin', \"Yeah!\"\nAbout drinkin' straight out the eight bottle\nDo I look like a mothafuckin' role model?\nTo a kid lookin' up to me\nLife ain't nothin' but bitches and money\n'Cause I'm the type of nigga that's built to last\nIf you fuck with me I’ll put my foot in your ass\nSee, I don't give a fuck, 'cause I keep bailin'\nYo, what the fuck are they yellin'?\n\n[Chorus: MC Ren + Sample]\nGangsta, Gangsta! That's what they're yellin'\nIt's not about a salary, it's all about reality\nGangsta, Gangsta!\nHopin' you sophisticated motherfuckers\nHear what I have to say\n\n[Verse 2: Ice Cube]\nWhen me and my posse stepped in the house\nAll the punk-ass niggas start breakin' out\n'Cause you know, they know what’s up\nSo we started lookin' for the bitches with the big butts\nLike her, but she keep cryin'\n\"I got a boyfriend\"—bitch, stop lyin'!\nDumb-ass hooker ain't nothin' but a dyke\nSuddenly I see some niggas that I don't like\nWalked over to 'em, and said, \"What's up?\"\nThe first nigga that I saw, hit him in the jaw\nRen started stompin' him, and so did E\nBy that time got rushed by security\nOut the door, but we don't quit\nRen said: \"Let's start some shit\"\nI got a shotgun, and here's the plot\nTakin' niggas out with a flurry of buck shots\nBoom, boom, boom! Yeah, I was gunnin'\nAnd then you look, all you see is niggas runnin'\nAnd fallin' and yellin' and pushin' and screamin'\nAnd cussin', I stepped back and I kept bustin'\nAnd then I realized it's time for me to go\nSo I stopped, jumped in the vehicle\nIt's like this, because of that who-ride\nN.W.A is wanted for a homicide\n'Cause I'm the type of nigga that's built to last\nFuck with me, I'll put my foot in your ass\nSee, I don't give a fuck, 'cause I keep bailin'\nYo, what the fuck are they yellin'?\n\n[Chorus: MC Ren + Sample]\nGangsta, Gangsta! That's what they're yellin'\nIt's not about a salary, it's all about reality\nGangsta, Gangsta\nHe'll tell you exactly how he feel\nAnd don't hold a fuckin' thing back\n\n[Verse 3: Ice Cube]\nHomies all standin' around, just hangin'\nSome dope-dealin', some gang-bangin'\nWe decide to roll and we deep\nSee a nigga on Dayton's and we creep\nReal slow and before you know\nI had my shotgun pointed in the window\nHe got scared and hit the gas\nRight then I knew I had to smoke his ass\nHe kept rollin', I jumped in the bucket\nWe couldn't catch him, so I said fuck it\nThen we headed right back to the fort\nSweatin' all the bitches in the biker shorts\nWe didn't get no play from the ladies\nWith six niggas in a car—are you crazy?\nShe was scared, and it was showin'\nWe all said \"Fuck you, bitch!\" and kept goin'\nTo the hood, and we was fin to\nFind somethin' else to get into\nLike some pussy, or in fact\nA bum rush, but we call it rat pack\nOn a nigga for nothin' at all\nIce Cube'll go stupid when I'm full of eight ball\nI might stumble, but still won't lose\nNow I'm dressed in the county blues\n'Cause I'm the type of nigga that's built to last\nIf you fuck with me, I'll put my foot in your ass\nI don't give a fuck, 'cause I keep bailin'\nYo, what the fuck are they yellin'?\n\n[Interlude: Dr. Dre + MC Ren (The Jimmy Castor Bunch)]\nWait a minute, wait a minute, cut this shit!\nMan, what'cha gon' do now?\n(What we're gonna do right here is go way back)\nHow far you goin' back? (Way back)\n\"As we go a lil' somethin' like this\"—hit it!\n\n[Pre-Verse: Ice Cube]\nHere's a little gangsta, short in size\nA t-shirt and Levi's is his only disguise\nBuilt like a tank, yet hard to hit\nIce Cube and Eazy-E cold runnin' shit\n\n[Verse 4: Eazy-E]\nWell, I'm Eazy-E, the one they're talkin' about\nNigga tried to roll the dice and just crapped out\nPolice tried to roll, so it's time to go\nI creeped away real slow and jumped in the six-fo'\nWith the {diamond in the back, sun-roof top}\nDiggin' the scene with the gangsta lean\n'Cause I'm the E, I don't slang or bang\nI just smoke motherfuckers like it ain't no thang\nAnd all you bitches, you know I'm talkin' to you\n\"We want to fuck you, Eazy,\" I want to fuck you too\nBecause you see, I don’t really take no shit\nSo let me tell you motherfuckers who you're fuckin' with\n'Cause I'm the type of nigga that's built to last\nIf you fuck with me, I'll put a foot in your ass\nI don't give a fuck, 'cause I keep bailin'\nYo, what the fuck are they yellin'?\n\n[Chorus: MC Ren + Sample]\nGangsta, Gangsta! That's what they're yellin'\nIt's not about a salary, it's all about reality\nGangsta, Gangsta\nHe'll fuck up you and yours\nAnd anything that gets in his way\nGangsta, Gangsta! That's what they're yellin'\nIt's not about a salary, it's all about reality\nGangsta, Gangsta\nHe'll just call you a low-life motherfucker\nAnd talk about yo' funky ways", "album": "Straight Outta Compton", "year": "1988-09-05", "title": "Gangsta Gangsta", "image": "https://images.genius.com/fd371d42dce5252e7c95d0f36b740f46.400x402x1.jpg"}], "artist": "N.W.A"}