{"artist": "Canibus", "songs": [{"title": "Gybaotc", "album": "My Name is Nobody", "year": null, "image": "https://images.genius.com/478f658d8d991509f0f55d07ed6e3df4.500x500x1.jpg", "lyrics": "[Verse 1: Canibus]\nYo, I done been from Jersey to Brooklyn\nDone been through Queens where the crooks hang\nDone been on tour doing group thangs\nCause I'm always tasting that pootang\nReally love it when a girl got a cute name\nGot a cute attitude and a cute frame\nGot a big ass butt, breasts and no brain\nThem things make a nigga want to shoot game\nNow check it, I done been through a few thangs\nDone seen a lot more than some loose change\nAlways been open minded to new thangs\nLooking for a rap nigga, I'ma true thang\nBeen a Hip-Hop nigga since youth man\nBeat-box and break-dance too man\nUsed to do electric boogaloos man\nDo Egyptian love with two hands\nI remember when I lived down south, yo\nIn a hot ass one story house, yo\nWhere the A.C. was always going out, yo\nSometime spend a whole day outdoors\nWe had a block-party, barbeque, eating food, in the pool\nMusic got us in that mood, everybody act a fool\nI'mma tell you like this man\nEvery night I go down to the city man\nTo the gentlemen's club where my niggas hang\nThem stripper chicks know how to strip man\nDJs be spinning them hits man\nPlay the Cash-Money clique and the Jigga man\nThem hoes be thick but sick man\nEvery stripper think a motherfucking rich man\nLike Sisqo, the R&B singing man\nThink I got a bank account with a million man\nCase of Crystal cost about six grand\nBitch better get a less expensive brand\nGot to stick to the budget when I trick, man\nHow about ten dollars for a sip, man?\nMy whole dance for a ten dollar tip, man\nStill waiting on my royalty check, man\nHow about a rain-check next time, yo?\nHow about a handful of coupons, yo?\nHow about tickets to my next five shows\nTurn around, let me test that behind, yo, I love a fine ho\n\n[Chorus x2]\nBounces over here, this nigga touched my derriere\nWhere the nigga at? I'll jack him up\nGet your broke ass out the club\nBounces over here, this nigga touched my derriere\nWhere the nigga at? I'll jack him up\nGet your broke ass out the club\n\n[Verse 2: Free]\nNigga please! What you think this is\nWe ain’t just strippers, we actresses\nI been tryin' to get into this acting bizz\nBut in the meantime I need cash to live\nShake this big butt, pay them dues\nI gotta buy books cause I’m goin to school\nMama ain’t raised no female fool\nI gotta use what God gave a bitch to use\nBig titties ain’t nuttin but tools\nWith a fat ass I control the room\nPlus I probably make more money than you\nAnd I got a man, look at my tattoo\nMost niggas wanna know where I’m from\nMy hair short now, but it used to be long\nIf you really wanna see a girl perform\nYou gotta give me more than ten dollars a song\n$50 make me come out the thong\nGrab you in your neck, just legs and arms (?)\nNiggas hear a song, gettin hot and warm\nBetter not touch me, I call the guards\nA lot of y'all niggas tryna go too far\nI don’t get down like that, uh-uhh\nIf you thought so, nigga, you thought wrong\nMost of y'all fellas got wives at home\nYou can trick her, but you can’t trick me\nSee you in the stripclub every week\nTryna keep it low key and be discrete\nYou got a mark where your wedding ring ‘posed to be\nI don’t give a damn, keep hitting me offf\nFifty dollars a song, that’s what it cost\nNigga I don’t care that you got a divorce\nGlad the bitch left, nigga, it’s your fault\nEverytime you see me you’re tryna talk\nTryna stall the time because you ass is broke\nThat’s right, you can’t pay child support\nDon’t offer me no cigarette, I don’t smoke\nAll the girls know who you with\nAnd you got more kids than an orphanage\nWhat it is, you mean what it was\nNigga, get your broke ass out the club\n\n[Chorus x2]\nBounces over here, this nigga touched my derriere\nWhere the nigga at? I'll jack him up\nGet your broke ass out the club\nBounces over here, this nigga touched my derriere\nWhere the nigga at? I'll jack him up\nGet your broke ass out the club\n\n[Verse 3: Canibus]\nGirl, why you trying to get loud, screaming lies\nActing surprised, rolling your eyes\nYou act like a nigga done committed a crime\nYou know my elbow just brushed your thigh\nNow them guys, twice my size\nTryna throw a nigga like me outside\nI be up in this club all the time\nBut it's the first time that I crossed the line\nDamn girl, why you so mean to me?\nYou know I can't leave, I done lost my keys\nDon't throw me out, Mr. Bouncer, please\nLet me take the girl up to V.I.P\nShe was just playing cause I'm low on cheese\nLook at it, she only got eyes on me\nThey bloodshot red, so she's smoking weed\nYou know how these stripper chicks love to tease\nI think I left my cell phone back at my seat\nI had a couple of drinks and I need a receipt\nFollow me to the bathroom to pee\nI keep about three G's in my briefs\nDamn baby boy, you done ripped my sleeve\nI ain't trying to beef, give me room to breath\n\n[Chorus x2]\nBounces over here, this nigga touched my derriere\nWhere the nigga at? I'll jack him up\nGet your broke ass out the club\nBounces over here, this nigga touched my derriere\nWhere the nigga at? I'll jack him up\nGet your broke ass out the clubth\nWhy I got to leave, tell me what I done?\n\n[Outro: Canibus]\nGod damn girl, give a nigga some love\nI'm all out of dubs but I'll give you some ones"}]}