{"artist": "Fabolous", "songs": [{"year": null, "album": "Real Talk", "image": "https://images.genius.com/1de0001bab671e3228ac0aa53fc0a73c.1000x1000x1.jpg", "lyrics": "[Intro - Fabolous]\nFrom hood to hood they see what's hood\nAnd know who I be! uh!\n\n[Verse - Fabolous]\nI got the Yankee leaning, just sittin over the brows\nAnd the G4 is just getting over the clouds\nYou can't tell me that I ain't what's up right now\nI got a bottle of Tequila upside down\nThere's some chicks wit boyfriends that are up tight now\nCause they know the big 'dog' had a 'pups' like wow\nI'm stuck in my city ways\nHeading over seas wit a zip of New York City's haze\nYou rats can keep running through your city's maze\nUntil you get sprayed with the pesticide\nI know you in that hole, you best to hide\nLike the rest who tried, who went and testified\nOf course your girl wanna slide over and be rubbed\nAnd don't mind taking rides over the G dubs\nI ride Rovers on Spre-dubs\nPlease don't be another dude who died over a ski dub, chill\n\n[Hook - Fabolous & (Thara)]\nFrom hood to hood they see what's hood and know who I be\nFrom block to block they see it, not can't know who I be\nFrom state to state they cannot hate, they know who I be\nFrom the east to west, through the midwest and downsouth it's Ghetto!\n(It's Ghetto-oh!) It's Ghetto! (It's Ghetto-oh!) It's Ghetto!\n(It's Ghetto-oh!) It's Ghetto! (It's Ghetto-ohh!) It's Ghetto!\n\n[Verse - Fabolous]\nI get it jumping like a lo lo '64\nAnd bet they hop on it like a pogo stick pro\nI'm chilling wit these go go chicks though\nThat do the kind of things that belong in a porno flick yo\nYou know it's him and the gang\nWit the bling worked on, that remind you of lemon meringue\nBut remember the thangs, ain't too far\nAnd y'all wanna hear em go bang bang bang\nLike John Witherspoon, I'm watching em closely\nI know the snakes gon' slither soon\nThe two toned Maybach's getting delivered soon\nThe back feels like sitting in the living room\nI'm so hard bodied like the suit on Batman\nIt's that man that back to back plat' scan\nI'm back for the third time, I make words rhyme for a living\nYou probably heard I'm still ghetto, nigga!\n\n[Hook]\n\n[Verse - Fabolous]\nThey tried to put two 9's on me, just like Gretzky\nBut my lawyer saw through it just like wet tees\nI smoke till my eyes look just like Jet Li's\nOn islands where the water's blue just like Pepsi\nYeah the trigger just might get squeezed\nAnd the slugs will skip over your waves, just like jet skis\nHoes know Ghetto from New York, call em the Fresh Prince\nAnd throw rose petals when I walk\nThey love how I came back hard like good blow\nAnd I'm still a heart throb to a hood ho\nThat's what hood though, yes I would know\nThat's cause I'm in the streets like man hole covers\nRims look like blades when a fan blow brother\nI'm waiting on a storm to land, roast others\nThe man no other, cause I been in it\nMy time is money, y'all couldn't buy ten minutes\nI'm gone! catch up!\n\n[Hook]\n\n[Scott Storch instrumental outro]", "title": "Ghetto"}]}