{"artist": "50 Cent", "songs": [{"album": "2050 Before the Massacre (G-Unit Radio Part 10)", "image": "https://images.genius.com/7bd9a9c7d612745933846c2130e0fb49.500x500x1.jpg", "title": "I’m An Animal", "lyrics": "[INTRO]\nYeah\nThis is gonna hurt you this time\nGon’ see if y’all niggas can survive to second round\nYou said what?!\nIt’s over boy!\nIt’s like a Murder Inc clearance sale…\n\n[Chorus]\nAsk about me\nThey’ll tell you I’m an animal, an animal\nYou touch one of mines I’ll react like an animal, an animal\nThey say I have no conscience\nI’ll kill if I have to, y’all\nThey say I’m an animal\nSometimes a nigga cross the line and he got to go\nMove on him like an animal\n\nNigga don't talk to me if you ain't in my bracket\n100 mil, that's 60 after taxes\nI was a little dirty nigga flipping my mattress\nSneakers fuck up til I started pumping packs, kid\nBeefin' with the older niggas getting my ass kicked\nBought a little .380 I stopped all that shit\nBack on that bullshit you know I’ve been on\nRiding with the same 9 Tre used to kill Bon\nNiggas dead serious, niggas though we was playin\nPicture me laughing in the crib after Tre shot Wayne\nSouthside ain't southside without the team\nNiggas starving I feed em they'll ride for me\nWhen feds come, nigga shit gets funky\nIrv love Preme he fittin' to be his bunkee\nIn a park full of kids, I pop of the mack\nThey see the flare from the nozzle and scatter like rats\nI know the police is listening, this is for the D's\nMe and Star was cool & I ain't hit Cheese\nSigned a deal and made a mil before Bags got shot\nMade 20 more 'fore Tah-Tah got knocked\nMan this rap shit is me B, I got this locked\nTreat it just like the block workout non-stop\nI dazzle with the footwork, maneuver with the heat\nThink boy or get your brains left in the street\nYeah the Stick-up Kids say it’s out the tax\nBut I get your shines back for you homie, relax\nI send my little shooters right at 'em with Gats\nHit 'em so hard they gonna send that back\nYou know I know who ran up in your crib\nThe first thing they do is holla at the kid\nThey say 50 fucked with us man, we poor need work\nThey need niggas like us to do their dirt\n\n[Chorus]\nAsk about me\nThey’ll tell you I’m an animal, an animal\nYou touch one of mines I’ll react like an animal, an animal\nThey say I have no conscience I’ll kill if I have to, y’all\nThey say I’m an animal\nSometimes a nigga cross the line and he got to go\nMove on him like an animal\n\n[OUTRO]\nYeah\nNigga what?!\nGet a good look nigga!\nSee the flash of my diamonds and shit nigga!\nHahaha\nRidin back since this shit cost more than yo momma house\nYou’re fucking playing with me nigga?\nI came up hard nigga!\nYou already know what I’m about!\nWhat?! Hahaha…\nAye\nAye tell Preme\nThat if he send me a written apology\nWe can squash this shit\nNaaww nigga…we ain’t squashing this shit", "year": null}]}