{"songs": [{"year": "2015-03-15", "album": "To Pimp a Butterfly", "image": "https://images.genius.com/ffb1a13cfda120ba85ab9e2a83a4e158.1000x1000x1.jpg", "title": "For Sale? (Interlude)", "lyrics": "[Produced by Taz Arnold; Additional production by Sounwave & Terrace Martin]\n\n[Intro: Bilal]\nOh, oh, oh, oh, ohhhh, ohh\nOh, oh, oh, oh, ohhhh, ohh\n(Breathing)\nWhat's wrong, nigga?\nI thought you was keeping it gangsta\nI thought this what you wanted\nThey say if you scared, go to church\nBut remember, he knows the Bible too\n\n[Chorus: Kendrick Lamar]\nNow, baby, when I get you, get you, get you, get you\nI'ma go hit the throttle with you\nSmoking, lokin', poking that doja 'til I'm idle with you\n'Cause I (want you)\nNow, baby, when I'm riding here, I'm riding dirty\nRegistration is out of service\nSmoking, lokin', drinking that potion, you can see me swerving\n'Cause I (want you)\n(I want you more than you know)\n\n[Verse 1: Kendrick Lamar]\nI remember you took me to the mall last week, baby\nYou looked me in my eyes about four, five times\n'Til I was hypnotized, then you clarified\nThat I (want you)\nYou said Sherane ain't got nothing on Lucy\nI said, \"You crazy?\"\nRoses are red, violets are blue\nBut me and you both pushing up daisies if I (want you)\n\n[Bridge: Kendrick Lamar]\nNow, baby, when I get you, get you, get you, get you\nI'ma go hit the throttle with you\nSmoking, lokin', poking that doja 'til I'm idle with you\n'Cause I (want you)\n\n[Verse 2: Kendrick Lamar]\nYou said to me, you said your name was Lucy\nI said, \"Where's Ricardo?\"\nYou said, \"Oh, no, not the show\"\nThen you spit a little rap to me like this\nWhen I turned twenty-six, I was like, \"Oh, shit\"\nYou said to me, I remember what you said too, you said:\n\"My name is Lucy, Kendrick, you introduced me, Kendrick\nUsually I don’t do this but I see you and me, Kendrick\nLucy give you no worries, Lucy got million stories\nAbout these rappers that I came after when they was boring\nLucy gon' fill your pockets\nLucy gon' move your mama out of Compton\nInside the gi-gantic mansion like I promised\nLucy just want your trust and loyalty, avoiding me?\nIt's not so easy, I'm at these functions accordingly\nKendrick, Lucy don't slack a minute, Lucy work harder\nLucy gon' call you even when Lucy know you love your Father\nI'm Lucy, I loosely heard prayers on your first album, truly\nLucy don't mind, 'cause at the end of the day you'll pursue me\nLucy go get it, Lucy not timid, Lucy up front\nLucy got paperwork on top of paperwork\nI want you to know that Lucy got you\nAll your life I watched you\nAnd now you all grown up to sign this contract, if that’s possible\"\n\n[Chorus: Kendrick Lamar]\nGet you, get you, get you, get you\nI'ma go hit the throttle with you\nSmoking, lokin', poking that doja 'til I'm idle with you\n'Cause I (want you)\nNow, baby, when I'm riding here, I'm riding dirty\nRegistration is out of service\nSmoking, lokin', drinking that potion, you can see me swerving\n'Cause I (want you)\n\n[Refrain: Bilal]\nOh, oh, oh, oh, ohhhh, ohh\nOh, oh, oh, oh, ohhhh, ohh\n\n[Poem]\nI remembered you was conflicted\nMisusing your influence, sometimes I did the same\nAbusing my power full of resentment\nResentment that turned into a deep depression\nFound myself screamin' in the hotel room\nI didn't wanna self destruct\nThe evils of Lucy was all around me\nSo I went runnin' for answers\nUntil I came home"}], "artist": "Kendrick Lamar"}