{"songs": [{"title": "Letter To My Countrymen", "image": "https://images.genius.com/34496ea878c12c3ca7f7791350eef29a.899x899x1.jpg", "lyrics": "\"Sooner or later\"\n\n[Verse One]:\nI used to think I hated this place\nCouldn't wait to tell the president straight to his face\nBut lately I changed, nowadays I embrace it all\nBeautiful ideals and amazing flaws\nGot to care enough to give a testament'\nBout the deeply depressing mess we're in\nIt's home so we better make the best of it\nI wanna make this country what it says it is\nStill dream in the vividest living color\nNo matter how many times my love been smothered\nWho's ever above us won't just let us suffer\nAll of this struggling got to amount to something\nThis is a letter to my countrymen\nEspecially those my age and younger than\nWe're up against an ugly trend\nEverybody's hustling, don't nobody touch their friends\nNo group singing and dancing\nNo anthem nobody holds hands, and...\nInstead they give you a handheld\nAnd make you shoulder life's burden by your damn self\nOne thing that can't be debated\nPower never changed on it's own you got to make it\nThat's why community is so sacred\nThat's the symbol that we make when we raise fists\n\nChorus: \"Sooner or later\"\n\n[Verse 2]:\nWe don't really like to talk about the race thing\nThe whole grandparents used to own slaves thing\nPat ourselves on the back in February\nLooking at pictures of Abe Lincoln and the great King\nBut the real picture's much more embarrassing\nWe're still not even close to really sharing things\nThe situation of oppressed people\nShows what we feel it means to be a human being\nWhat does it mean to be American?\nI think the struggle to be free is our inheritance\nAnd if we say it how it really is\nWe know our lily skin still give us privilege\nAdvantage is given to the few\nThat are built into the roots of our biggest institutions\nThat's the truth in life we got to choose\nDo I fight in the movement or think I'm entitled to it\nThis is not a practice life\nThis is the big game we got to attack it right\nEach one of us is headed for the grave\nThis old crooked world won't be saved by the passive type\nThis is a letter to my countrymen\nNot from a Democrat or a Republican\nBut one among ya\nThat's why you call me Brother\nAin't scared to tell you we're in trouble cause I love you\n\nChorus:\"Sooner or later\"\n\n[Verse 3]:\nThey tell me I'm a dreamer, they ridicule\nThey feel defeated, old, bitter, and cynical\nExcuse me but I see it from a different view\nI still believe in what a driven few could really do\nI know that the masses want to sleep\nAnd they would just rather hear me rapping to the beat\nBut I want to pass this planet to my son\nA little better than it was when they handed it to me\nSo\nI wrote a letter to my countrymen\nI'll be happy if it only reaches one of them\nReporting live A-L-I, your brother\nMourning in America, dreaming in color\n\n[Dr. Cornel West talking]:\nMy dear Brother Ali,I think you know deep down in your soul that something, something just ain't right.You don't want to be just well adjusted to injustice and well adapted to indifference. You want to be a person with integrity who leaves a mark on the world.People can say when you go that you left the world just a little better than you found it. I understand. I want to be like that too", "year": "2012-09-18", "album": "Mourning in America and Dreaming in Color"}], "artist": "Brother Ali"}