{"artist": "Vado", "songs": [{"title": "One Time", "year": null, "lyrics": "[Verse 1]\nFoul play, keep still don't violate\nCan't sleep when trying to meet Millz or Wale\n40 Cal spray over some dry yay\nLight a j with a babe cooler than Sade\nIt's him again, flow hard as Timberlands\nHoodie on, got them scared of these bars like Zimmerman\nHear them bickering, let me zip up my zipper then\nThey broke, ain't no fixing it\nEvery watch is from Switzerland\nHand on the K, standing on stage\nThe same niggas that hate be a fan of his page\nLast deal had me feel like a man in a cage\nThe rap Deron Will, I demanded a trade\nPass leaving like this is my last season\nKeep a pair of hard to get Air's like bad breathing\nNiggas acting like hoes they drag queenin'\nLet him burn, you're a waste of sperm, bad semen\n\n[Hook]\nI gotta get mine, speed up a slow grind\nYo Slime! There go one time!\n\n[Verse 2]\nHuh\nGet your mind on the hustle\nOver time on the grind make it bubble\nLearn the plays never slide from the huddle\nI can dig it without the lime and the shovel\nJust came out, brung a lot of 'caine out\nMe and Kane out, bugging, smoking our brains out\nWreckless when I talk like hearing Dame's mouth\nThe game got whole team here, this MH's house (Sliiiiiiiiime!)\nMask and glove in the glove compartment\nI beg your pardon, I leave you departed in your apartment\nGot a shooter with a beard like James Harden\nJ's on him, clubhouse seats, the game starting! (Whussup!)\nAll my niggas up, moved across, live it up\nBe in these condos bored like \"Call some bitches up!\"\nHard to reach me my number is always switching up\nLike throwing broads in the air, we're never bitching up!\n\n[Hook]\nI gotta get mine, speed up a slow grind\nYo Slime! There go one time!\n\n[Verse 3]\nI've seen them though, turn around, act like we're chilling\nAfter they cruise by, just meet me back in the building\nStack a mil, you ain't got it, I had a feeling (I knew it)\nI'm 6-series steering looking up like it had a ceiling!\nThis for them niggas that's on their trap shit\nOn the Ave will stash crack in their chapsticks\nI stash crack in the Marmot\nInside pocket, like \"I got it all, what you girls want?\"\n\n[Hook]\nI gotta get mine, speed up a slow grind\nYo Slime! There go one time!", "album": null, "image": "https://images.genius.com/e2d9824f3848684bc687e9cad8889c34.687x595x1.jpg"}]}