{"artist": "Doughboyz Cashout", "songs": [{"title": "Im Dat Nigga", "album": "ItsThaWorld Vol. 2", "year": "2013-11-01", "image": "https://images.rapgenius.com/e87acbfc443e3edd4fe7bb89c1ef20ad.500x500x1.jpg", "lyrics": "[Verse 1: HBK]\nI hit the airport with a lot of Louis luggage\nHit Somerset drop stacks like fuck it\nHoes on my dick, but that really ain't nothing\nTold that bitch somethin that the Doughboyz coming\nYoung niggas fooling round this bitch like its on\nYour bitch gave me dome cause she saying she was on\n7-deuce was the streets I was raised on\n7-deuce was the streets I got paid on\nBitch-ass niggas why these bitch niggas hurting?\nMakin' diss songs but nobody even heard it\nDiamonds so wet, looking like them bitches surfin\nGivenchy and Cavalli, God damn I'm looking perfect\nI'm still that nigga, hoes choosin' when I pull up\nBitch, I'm the shit, I'm the shit like Pull-Ups\nI'm that nigga that your little brother looks up to\nFree my nigga Rocky in the block doing push-ups\nA nigga got a problem then we'll kill him like, \"what up?\"\nReal niggas get love and fake niggas get fucked up\nBut nigga miss you with the chopper bullets, you done lucked up\nYou ain't got no money, go home and shut the fuck up\n\n[Hook: Big Quis]\nI hit the mall and (cash)\nAnything I want I (grab)\nA1 dope got the hood on (smash)\nBitch, cause I'm that nigga\nI'm still that nigga\nI hit the mall and (cash)\nAnything I want I (grab)\nA1 dope got the hood on (smash)\nBitch, cause I'm that nigga\nI'm still that nigga\n\n[Verse 2: Big Quis]\nI'm a stunner, I'll admit\nKnown to keep some loud lit\nPresidential Rollies on every dude I'm down with\nTurned the bitch around, stuck it in and she can take the dick\nYeah we both fuck, but have to put your face in it\nIt be the brokest motherfuckers that be on some hating shit\nBut they need to go to jail for streaking with their naked wrists\nAll these hoes takin' pics, the DBC the dream team\nThis medaillon 20 thousand, bitch bling bling\nI don't drink lean, I sip Dom P that glow up\nHottest niggas in the city but we all froze up\n[?] and carry stacks that can't fold up\nPeople say that we be showin' out but I just show up\nFED's tell us that we 'bout to blow up, C4\nNeighbourhood hero, 5 karats in my earlobe\n[?] in my pocket, you can't knock it I done came up\nBYLUG bitch, [?] hold your chain up\n\n[Hook: Big Quis]\nI hit the mall and (cash)\nAnything I want I (grab)\nA1 dope got the hood on (smash)\nBitch, cause I'm that nigga\nI'm still that nigga\nI hit the mall and (cash)\nAnything I want I (grab)\nA1 dope got the hood on (smash)\nBitch, cause I'm that nigga\nI'm still that nigga\n\n[Verse 3: Payroll Giovanni]\nFlashy but I'm humble, you don't like me then it's fuck you\n\nI started with a ounce\n\nBring your bitch 'round me\n\nMarble floors\n\nBig dogs\n\nThey talk like bitch so I tell they bitches to come through\n\n\n\n[Hook]\n\n[Verse 4: Dre Armany]\n\n[Hook]"}]}