{"artist": "Papoose", "songs": [{"album": "Most Hated Alive", "title": "I’m Like That (Remix)", "image": "https://images.genius.com/28e7d5ba08f0e096e289be88b85528d7.500x500x1.jpg", "lyrics": "[Intro: Papoose]\nSound like it's gonna be a hot summer, cool off\nI told you I got 'em..... Papoose, Pa-poose\n\n[Hook: Papoose]\nI'm gettin' money everyday cause I'm like that\nI wear my jewelry anyway cause I'm like that\nI drive a Cadillac truck cause I'm like that\nI don't give a flyin' fuck cause I'm like that\nThat dude ain't like that, he ain't like that\nThey ain't like that, them niggas ain't like that\nThat nigga ain't like that, he ain't like that\nThey ain't like that, them niggas ain't like that\nTHEY AIGHT!!!!!\n\n[Verse 1: Papoose]\nI told y'all I'm like that\nThey said I fell off, tell 'em I'm right back!\nI drove in the industry in the white 'lac\nBack then, only two niggas was nice scrap\nIf you wasn't screamin' \"SQUAD UP!\" just like Stack\nYou was screamin' \"THUGA THUGA THUGA!\" just like Pap\nIn your ear like a Q-Tip where Phife at?!\nThough you said you was a rider man where's your bike at?!\nI like a bucket naked bitch with nice tatts\nEarrings with the hoops in 'em just like Shaq\n'Bout to put Knicks in the strip where Spike at?!\nDo your homework shots fly when I strike back\nI spit fire like Satan when I rap\nGot the Jesus piece if you wonder where Christ at?\nI hustle like the snowman, your girl your loan fam\nShe show the ta ta's I ain't talkin' about Hulk man\n\n[Hook: Papoose & Jadakiss]\nI'm gettin' money everyday cause I'm like that (Yeah!)\nI wear my jewelry anyway cause I'm like that (Ha Ha Ha!)\nI drive a Cadillac truck cause I'm like that (Uh!)\nI don't give a flyin' fuck cause I'm like that (FUCK 'EM!)\nThat dude ain't like that (Nah!) he ain't like that (Uh oh!)\nThey ain't like that (Nope!) them niggas ain't like that (EH HEH!!!)\nThat nigga ain't like that (Nah!) he ain't like that (Uh oh!)\nThey ain't like that (Nah!) them niggas ain't like that (Uh!)\nTHEY AIGHT!!!!!\n\n[Verse 2: Jadakiss & Styles P]\nYeah! Yo! Uh! I'm like that!\nMy transporter always get that white back\n(Make sure the couch right to catch that flight back)\nAddicted to the same medication as Mike Jack!\n(Old school high top Air's with the Nike strap)\nWe don't want your bitch dog come get your wife back\n(Money in the safe keep the dough where the rice at)\nWho advised you?! Where you get your advice at?!\n(Never get the eat the whole pie you gotta slice that)\nLil' paper you spit nigga we spit twice that\n(For you it's like a mill but for us it's a life snack)\nDrive by, shoot shit up in the white Acc'\n(Niggas used to steal on you, you wouldn't fight back)\nBut bitch actin' tough you should be where the dykes at\n(Like Cushi in Casino put your hand where the vice at)\nYou eyeballs will pop out, and you won't like that\n('Cause you ain't like that!)\n\n[Hook: Papoose & 2 Chainz]\nI'm gettin' money everyday cause I'm like that\nI wear my jewelry anyway cause I'm like that\nI drive a Cadillac truck cause I'm like that\nI don't give a flyin' fuck cause I'm like that\nThat dude ain't like that, he ain't like that\nThey ain't like that, them niggas ain't like that\nThat nigga ain't like that, he ain't like that\nThey ain't like that, them niggas ain't like that (UH! 2 CHAINZ!!!!!)\nTHEY AIGHT!!!!!\n\n[Verse 3: 2 Chainz]\nYeah! Rise to form you ride in the Delorean\nBack To The Future so you niggas better Oregon\nDealt when I'm approachin', hey mayne good\nBut I got enough rounds to hit you and your closest friend\nYou know I roll 'em in, throw 'em in, kick 'em out\nLaid back, every room got a fuckin' different couch\nEveryday I'm smokin' on a different ounce (YEAH!)\nEvery mill I make I buy a fuckin' different house\nAnd they AIGHT!\nGot three girlfriends and they all dykes\nWe all high, S.O.S. Swag on site\nYeah It's like that, did my thang\nBrought that white back\nGet that cheese, don't get scared of that mice trap\nRAAAHHHH!! A lot of rounds kill 'em with the muffled sound\nStill an underdog puttin' niggas underground\n\n[Hook: Papoose]\nI'm gettin' money everyday cause I'm like that\nI wear my jewelry anyway cause I'm like that\nI drive a Cadillac truck cause I'm like that\nI don't give a flyin' fuck cause I'm like that\nThat dude ain't like that, he ain't like that\nThey ain't like that, them niggas ain't like that\nThat nigga ain't like that, he ain't like that\nThey ain't like that, them niggas ain't like that\nTHEY AIGHT!!!!!", "year": null}]}