{"songs": [{"album": "California Livin’ Part 2", "year": null, "title": "Mrs. California", "image": "https://images.genius.com/20c5987e929dec87b6e59767b98df4d2.277x277x1.png", "lyrics": "[J-Diggs]\nI gots this saucy lil' tender\nBaby bad to the bone\nDisrespect lil' mama best to know it be on\nI go hard for baby girl\nI can't help but to dig her\nA lil' jealous cause I know she got more than one nigga\nThe way I figure its cool if you're treatin' her right\nYou best be suckin' her, fuckin' her, and eatin' her right\nYou want the truth\nI done bust shots for baby before\nFor niggas neglectin' and disrespectin' my ho\n\"Hell no! You lost your mind? Is y'all crazy?\"\nThis is my bitch, I love her, and she havin' my babies\nWe been together since the top\nWhen I was jockin' the corners\nWas only 10 when I met my lil' friend California\nStumbled up one her when I was like ridin' my bike\nCome to find out, Cali gets live at night\nShe hang wit Bay boys\nAnd bangers called Crips and Bloods\nShe taught me how to hustle sellin' dimes and dubs\nWe made love on the daily\nI was payin' her dues\nCali taught me the game\nBut Cali changed the rules\nConfused, I never knew better\nUsed to sweat her for cheddar\nShe seduced me, and used me, from the day that I met her\nShe had me body guardin'\nAnd I'm jump-startin', and I'm drive bying' and dischargin'\nHigh speed chasin', false statements to the sergeant\nI was so young and so dumb\nThe time, had no funds\nBut fuckin' wit young Cali\nI got more dope and more guns\nPut me on her turf and made me hustle for her trap money\nWhispered in my ear \"If you do good I'll give you rap money\"\nSat me down one night so she can whip me wit some game\nGave me pen and pad, equipped me wit some slang\nTold me that I'd write about the life that she had laid out\nKeep her name alive\nAnd make sure she never played out\nRepresent that place where we met on that Cali corner\nLet the world know I got a thang for Mrs. California"}], "artist": "J-Diggs"}