{"artist": "Angie Martinez", "songs": [{"title": "Dem Thangz", "image": "https://images.genius.com/849921ad7867e1c7a512284ad16faa0a.600x600x1.jpg", "album": "Up Close and Personal", "lyrics": "[Hook: Q-Tip]\nGirl, you gotta move dem thangz, dem thangz\nI wanna see you move dem thangz, dem thangz\nIn the hood dawg, you know they move dem thangz, dem thangz\nCause ain't a damn thing changed man, they move dem thangz\n(yeah it is my thang)\n[A] Yeah, I know how to move it.. (yeah it is my thang)\n[Q] I know how to do it.. (yeah it is my thang)\n[A] I know how to move it man.. (yeah it is my thang)\n[Q] And I know how to do it\n\n[Angie Martinez]\nYo, whoo!\nStep up in the club like \"Who up in here?\"\nLinda Carter with the world premier, watch out now!\nShit ain't clear, cause Hova got me open on the Belvedere\nYeah, settin it real good feelin proper\nCheckin out the nigga with the Gucci parka, like\nUh-huh, okay, whassup?\nIt's a luv-a-dub, and it's your world\nI'm a choosy girl\nBut we can dance to the dawn like Lucy Pearl\nCause you got that thang thang\nAnd we can do big thangz, but go, easy\nLike I told you before, cause I don't wanna hurt you pah.. huh\nAnd the name is Angela\nAnd ain't too many niggas that can handle her, it's true\n\n[Hook]\n\n[Angie Martinez]\nUhh, since the start of it all\nStandin alone, claimin my own, y'know?\nLittle that, little this\nCop a couple pieces to cover my little wrists\nPrayin while they hopin they sayin my shit'll miss\nMan listen, it's, my, thang I'm, well connected\nPull dem strings and I'm, not new\nOn the block for a minute\nAnd I, won't stop 'til I get it, get it\nComin widdit like the Punisher\nGettin all up in your stomach uhh.. huh, my bad\nGettin focused now\nLot of niggas in the club wanna poke us now\nBut, back it up baby nice and slow\nCause I roll with a whole lot of G.I. Joe's\nIn the cut camoflauged with they eyes on me\nWhile I, move, my thang, c'mon\n\n[Hook]\n\n[Angie Martinez]\nYo.. I, come through - doin what I do\nNiggas buggin out like, \"Who the fuck knew?\"\nSame chick from the radio dial\nSame one from the summer jam, gettin 'em wild\nBut now my niggas it's a new day\nBK always like Biggie doin \"Jui-cy\"\nIced out like David Blaine\nWhat's it all about baby IT'S, MY, THANG\n\n[A] Yeah, I know how to move it.. (yeah, it's my thang)\n[Q] I know how to do it.. (yeah, it's my thang)\n[A] I know how to move it man.. (yeah, it's my thang)\n[Q] And I know how to do it (yeah, it's my thang)\n\n[Hook]\n\n[A] Yeah, I know how to move it..\n[Q] I know how to do it..\n[A] I know how to move it man..", "year": "2001-04-17"}]}