{"songs": [{"title": "Celebrity", "album": "Finally Famous (Super Deluxe Edition)", "year": "2011-06-28", "image": "https://images.rapgenius.com/2efe71ba2f413e6e4aa04e8d84802904.500x500x1.jpg", "lyrics": "[Hook]\nI am in love with the lights, the love, the rights, the wrongs\nThey told me that it wouldn't be night for long!\nThe life, the love, the rights, the wrong\nThey told me that it wouldn't be night for long!\n\n[Verse 1]\nAnd I'm in love with the lights, the love\nCelebrity hoes, Hollywood parties that never get old\nTable full of new hoes, champagne nuvo\nMy mind is on Venus, but my neck is on Pluto\nI need a girl that look badder than my girlfriend\nYou know the ones that look badder than their girlfriends\nPaparazzi try to pop Big since I'm in Cali\nBut I just hide my face doing a Errol Flynns\nHoody over my head, Jedi, Anakin\nLooking like a BBC Louis V mannequin\nShe ain't got no man in em\nShe got no companion, she's Jenifer Aniston\nI'm trying to hit her, and her friend\nAnd again, and again\nPass it to my mans and them\nFucking all the baddest bitches in cities we're landing in!\n\n[Pre-Hook]\nWhat happens when it all falls\nAnd the success is all gone\nAnd is all gone?\nBut for now I'm a celebrity!\nFor now I'm a celebrity!\n\n[Hook]\nI am in love with the lights, the love, the rights, the wrongs\nThey told me that it wouldn't be night for long!\nThe life, the love, the rights, the wrong\nThey told me that it wouldn't be night for long!\n\n[Verse 2]\nI'm in love with the money..\nThey say that it's the root of all evil\nAt least that's what the pastor tried to teach us\nBut he will pass around that collection plate\nTil it's heavyweight as soon as his speech through\nThen hop in that Benz coupe\nShit, I'm trying to get Benz too!\nBut how is it the root of all evil?\nIf it could take my whole family out to Rio?\nNo more repo\nA depo, just speed boats\nJewelry all gold call me C3PO\nSmoke so much, I gotta see 3PO\nCause I'm worldwide tour with me and my nigga Zeno\nMost comfortable behind the mics like T.O\nSo I hate to lose my Mike like Tito\n\n[Pre-Hook]\nWhat happens when it all falls\nAnd the success is all gone\nAnd is all gone?\nBut for now I'm a celebrity!\nFor now I'm a celebrity!\n\n[Hook]\nCause I'm in love with the lights, the love, the rights, the wrongs\nThey told me that it wouldn't be night for long!\nThe life, the love, the rights, the wrong\nThey told me that it wouldn't be night for long!\n\n[Verse 3]\nI do it for, everything in life for love and meaning\nI hope they never try to tell me I'm leaving\nGetting everything I want, then I've got my mom next\nLA Reid sign checks right after the contract\nI always have a crazy flow pockets was on radio\nActive cause I guess I was active on a radio\nWay back in high school, yeah nigga CT\nWhere I met my nigga Tone, Pat Piff, and CT\nCame out of the slump nigga way before T3\nGiving hoes the run around, we just call them track meets\nIt's funny now when I look back\nCause them times gave me the inspiration that the track needs"}], "artist": "Big Sean"}