{"songs": [{"image": "https://images.genius.com/318dc7e7c59580923985d07fb182716a.500x500x1.jpg", "album": "Generation Gaming IX", "title": "Bloodborne", "lyrics": "[intro]\nWhen I was a baby, I was born!\nBut I wasn't born in a hospital..\nI was\nBORN\nIN\nBLOOD!\nYayy!\n\n[Verse 1]\nRah!\nThis town to which I've come is hellish\nFull of malice, the sun has vanished\nNow it's overrun with rabid grubs and maggots\nSo I guess it's good I'm hooded\nClad in rugged rags and brandishing a massive bloody mallet\nThe Hunter's plan is plundering an underground pungent palace overrun with baddies\nA Chalice dungeon, that is\nAnd should I perish in this parish, this gothic ghetto\nFret not, I'm coming back to get my blood echoes!\n\n[Chorus]\nBloodborne, we were born in blood\nSnuff all of your torches and throw up your hoods\nBloodborne, we were born in blood\nNow we rise from the dark like morning wood\n\n[Verse 2]\nThe graveyard's my playground, swing on the beast claw\nLogarius merry-go-round\nDid you ever see saw?\nI want to play a game, flamespray and maim\nAny tainted dog, beast, boar or maiden\nMan I flay and aim my blade\nSpread their brains on the pavement like Mayonnaise\n'til their late like passengers on Merseyrail Railways\nHow I miss the gay old days, sun on my pale face\nNah, son I'm a trailblazer\nNever save, no failsafe\nThese doomed peasents' future isn't too pleasant\nLittle more than a source of food for the moon presence\nSo you'd better use your communion runes or do penance\nFor absolution shall elude you without true repentance\nNeuter you with a Saw Cleaver, leave you with a sore beaver\nIt'll hurt more than missing spoiler alerts on Saul Teasers\nOr biting grapeshot you thought were some maltesers\nThis region's never even seen a person called Jesus\n\n[Chorus]\nBloodborne, we were born in blood\nSnuff all of your torches and throw up your hoods\nBloodborne, we were born in blood\nNow we rise from the dark like morning wood (rah)\n\n[Verse 3]\nWatch the Brick Troll, his hits sting more than rick rolls\nOr sticking a Tonitrus right into your dickhole\nI use a hunchback as a human punchbag\nAnd when I'm done I have him running back to school without his lunchpack\nAnd here's a fun fact: my Hunter Axe\nHas a somewhat different function that it would were I a lumberjack\nI'm sick enough to recite that Monty Python bit\nWhile swiping it from side to side in the middle of a viper pit\nHow did I get my job? Where did I find the gig?\nLet's just put it this way: I didn't apply for it\nAnd I might be sick, but the true boss isn't me exactly\nTip your hat to Mr. Hidetaka Miyazaki\n\n[Chorus]\nBloodborne, we were born in blood\nSnuff all of your torches and throw up your hoods\nBloodborne, we were born in blood\nNow we rise from the dark like morning wood\n\n[Outro]\n(Bloodborne, we were born in blood)\n(Snuff all of your torches and throw up your hoods)\n(Bloodborne, we were born in blood)\n(Now we rise from the dark like morning wood)", "year": "2015-04-27"}], "artist": "Dan Bull"}