{"artist": "King Los", "songs": [{"image": "https://images.genius.com/063677e3f883a417c8b506294dd5c56c.500x500x1.jpg", "title": "Angel (Dirty Money Freestyle)", "year": null, "album": "Zero Gravity", "lyrics": "Uh, Zero\nLos\nIt's like this how it's supposed to happen, you know?\nWhen it comes to the pursuit of more\nWhy the fuck would I settle for less?\nI'm ready\nGot angels around me now, heheh\n\nYeah, yeah, yo\nAyo, I'm laughin' at the critics in the booth\nI just throw on the Raybans\nAnd pour a lil' liquor in my juice\nMy flow ain't a critical dispute\nI push myself so hard -\nIt could be considered physical abuse\nLife like a circus when it come to this fame\nI been walkin' the tightrope for years, jugglin' pain\nHad to struggle to gain\nYou can see the thorough in my eyes\nI like to shake these niggas hand\nAnd feel the girl in they vibe\nI'm leavin' niggas by the curb on this ride\nThere's something buried inside\nThat felt different back when Gerald was alive\nYeah, I'm on my grind, whatchu whinin' and mad for?\nI ain't throwin' shade, you can't shine in my shadow\nCompare my voice to the pathetic in you\nPardon my rhetoric, but you better get etiquette school\nYou embellish irrelevance you unintelligent fools\nAnd you lack the vernacular that deems you eligible\nWalked through hell and I'm cool\nSwim through the pool of forbidden water\nHell fire, scorch I lived it amidst the torture\nHardships distortion, unfortunate misfortunes\nUltimate grief for it's no ultimate resources\nThese courses I ran made a man of me\nIt's funny how I used to think pain made a family\nLove harder, but love only bring the pain\nAll that shit confusin' as a bitch, and it seem the same\nSeen the game from angles you couldn't imagine\nIt's pushin' your luck to say I'll never be pushin' a Phantom\nI'm from where it get heated in the trap\nIf you get beaten in a scrap\nThen you reachin' for ya strap\nAnd it's funny how they greet you with a dap'\nHow they hug you, tell you to stay up\nBefore they bring you an attack\nIf I ever feel defeated with this rap\nIt's a wrap, I will literally chase\nSuccess down and beat it with a bat\nI'm a heathen when I zap\nThere's a reason that I rap\nYou will never see the day nor\nThe evening that I slack\nNo stressin', progression is no question\nAnd tribulation with no faith is no blessin'\nNo guessin', and I'm so sincere\nThat I'm so on yo ass if you don't concur\nCuz rappers all fake like smoke and mirrors\nAnd I've been known to snap like spoken word\nAudiences, y'all ridiculous and hardly vicious\nGuard ya trenches, be conscientious, y'all all pretenders\nAnd I'm from where the choppas be\nWhere niggas get bagged like a shoppin' spree\nWay nice, I'm on my Ray Rice, it ain't no stoppin' me\nAnd that's just what they do for fun\nAnd if you standin' next to him, that's a two for one\nWelcome to The Wire, where we hirin' a goon or two\nIt'll look like we made flyers for ya funeral\nWho are you to judge me? Assuming you above me\nBut you never been around for all my beautifuls and uglys\nTrust me, I ain't even on my third style\nI ain't even start reachin' in my word pile\nWith no words I could make ya girl smile\nWith four words I could make the world bow\nY'all niggas thorough? How? Let's get this real clear\nI been thru everything - and I'm still here\nSome say I'm cocky - too conceited\nBut they ain't see all the superficials I superseded\nNo more fallin' - Forever standin'\nAnd this time when I take flight, I'm never landin'\nWavin' at everything below\nHad a smoky past, but my futures so Deebo\nWatch what you record, and I ain't talkin' TiVo\nMeet me in the sky mothafucka, Zero"}]}