{"artist": "Ice Cube", "songs": [{"title": "Givin’ Up the Nappy Dug Out", "lyrics": "[Intro - \"Pops\" talking to Ice Cube, who is at the door]\n\n[Pops] Yeah\n[Ice Cube] Umm, uhh is Cheryl here?\n[Pops] Well who are you?\n[Cube] Tell her Ice Cube is here\n[Pops] WHO?!\n[Cube] Ice Cube!\n[Pops] ICE CUBE?! Man I ain't lettin my damn daughter go out with no damn Ice Cubes man! Man what the hell you talkin' about man? I brought my daughter up man in a Catholic school, private school. Man what you want with her? I'm sick of this bullshit!\n[Cube] Yo man, let me tell you somethin':\n\n[Verse One - Ice Cube]\nYour daughter was a nice girl, now she is a slut\nA queen treatin' niggas just like King Tut\nGobblin up nuts, sorta like a hummingbird\nSuckin up the Lench Mob crew, and I'm comin' third\nUsed to get straight A's, now she just skippin' class\nOh my, do I like to grip the hips and ass\nOnly seventeen, with a lot of practice\nOn black boys jimmies and white boys cactus\nSorry sorry sir, but I gotta be brief\nA lotta niggas like bustin' nuts in her teeth\nDrink it up, drink it up, even though she's Catholic\nThat don't mean shit, cause she's givin' up the ass quick\nQuicker than you can say, \"Candy,\"\nThe bitch is on my Snicker... and oh man she\nCan take on three men - built like He-Men\nHer little-bitty twat got gallons of semen\nFourteen niggas in line ready to bang your\nPride-and-joy, I mean daddy's little angel\nTell the little bitch to bring her ass out the house\nCause your daughter's known, for givin' up the nappy dug out\n\n[Hook 2X]\n\n\"I got a big old ding-a-ling, and if that bitch can hang\nI'm gonna do my thing, with your dauuuughter!\"\n[Sample] Givin up the nappy dug out!\n\n[Interlude - \"Pops\"]\n\n[\"Pops\"]\nLook motherfucker you better get from in front of my house with that old god damn bullshit, you curly-haired motherfucker. You better get out of here witcho' fine ass. Man, youse a little fine motherfucker\n\n[Verse Two - Ice Cube]\nMister, mister, before you make me go\nI'm here to let you know your little girl is a ho\nNympho, nympho, boy is she bad\nGet her all alone and out comes the kneepads\nI know she is a minor and it is illegal\nBut the bitch is worse than Vanessa Del Rio\nAnd if you decide to call rape\nWe got the little hooker on tape, now:\nTell the fuckin' slut to please hurry up\nAnd wear that dress that's tight on her butt\nSo I can finger-fuck on the way to the bed\nBeen in so many rooms, she got a dot on her forehead\nFace turnin' red from grabbin' them ankles\nFuck and get up is how I do them stank-hoes\nYou should hear how she sounds with a cock in her\nBoots get knocked, from here to Czechoslovakia\nTwo are on top, one on the bottom\nFirst nigga got the boots; man, you shoulda shot him\nCause after I got 'em it was over\nNow niggas get lucky like a four-leaf clover\nOn daddy's little girl\nShe keeps nuts in her mouth like the bitch was a squirrel\nSo tell Cheryl to bring her ass home\nCause the line at my house is gettin loooooooong, ay!\n\n[Hook 2x]\n\n\"I got a big old ding-a-ling, and if that bitch can hang\nI'm gonna do my thing, with your dauuuughter!\"\n[Cube] Yeah.. yeah.. bitch, bitch givin up the nappy dug out!\n\"I got a big old ding-a-ling, and if that bitch can hang\nI'm gonna do my thing, with your dauuuughter!\"\n[Cube] Yo..\n\n[Pops]\nLittle motherfucker!\n[Girl]\nDaddy, where did he go?\n[Pops]\nI'll tell you where he went, god damnit!\n[Girl]\nMercy!\n\n\"Givin up the nappy, givin up the nappy dug out\" [Kane (2X)]\n\"Givin up the nappy dug out..\" [2X]\n\"Givin up the nappy, givin up the nappy dug out\" [Kane (2X)]\n\"Givin up the nappy dug out..\" [1X]\n\"Givin-givin up the nappy dug out..\"\n[Girl]\nMercy!\n\n[Outro - A Singing Condom]\nWarning: when having sexual intercourse with a female like Cheryl\nYou must use, jimmy hat condoms\n\nWe're called jimmy hats, have you ever seen us?\nMost guys wear us round rolled up on your penis\nIf you're real smart, you will always use us\nPut me in your wallet, 'cause some dummies lose us screws us\nAnd goin bare back, without the bare facts\n'll have creepy crawlers crawlin on your nutsac!\nSo get the J-I-M-M-Y to the hats\nIt's me and two brothers in a pack\n\n\"Run out and get your jimmy hats..\" [KRS-One]\n\"Small, and extra large\"\n\"Run out and get your jimmy hats..\" [KRS-One]\n\n[Condom] Or this might happen to you!", "image": "https://images.rapgenius.com/89a02ab603eae95e0d380fcd08eda589.1000x1000x1.jpg", "album": "Death Certificate", "year": "1991-10-29"}]}