{"songs": [{"album": "Writer’s Block 5", "year": null, "title": "Intro", "image": "https://images.genius.com/b87542d9c9de1386d18c4cd8212f740d.500x500x1.jpg", "lyrics": "[Verse 1]\nGet it clear -- hater, I'm here\nStill Standing, welcome to the tape of the year\nHaze in the air, I done turned it up another notch\nBulbs in my ear, I done turned it up a couple watts\nAt the motherfucking spot -- not the \"motherfucking spot\"\nBut your mother's fucking spot, with the butter in the pots\nI don't know why I come across humble when I'm not\nMight have lost a couple rocks, but I'm up a couple blocks\nSuckers need to stop, give me a break\nSince '07 I've been getting six figures a tape\nWhile you get what you take; I'm a bit overweight\nPicking pounds up like I'm trying to get into shape\nHundred grips in the safe, that's something you know nothing 'bout\nSo get in your place -- my bad, I mean your mother's house\nHuh, I laugh; put up the right cash\nAnd these corns want beef, I'mma crush 'em like hash\nThe hottest you know; you gotta be slow\nI'm still standing, nothing like the Monica show\nThe Dips split, and they wondering which side I'mma go\nBut I don't pick sides, and the game's not to be told\nI don't switch sides, man -- the game's got to be sold\nI'm gonna let the Dip fly until they can't fly anymo'\nNo, ain't no one iller; what up, Killa?\nAin't speak about two years but what up, nigga?\nI'm still J.R., a.k.a. A.R\nB.k.a. \"Who are you? You ain't on my radar\"\nGet it? This my play-yard, and I don't want these pawns around\nPlay hard, I play you out -- listen, this my stomping ground\nI want the crown even though that I'm a champion\nYou still buying Champions; shit, I'm from Lionel Hampton\n130th, burning piff with the burner grip\nI don't need a burner to murder this -- I just murder it\nI know you heard I'm sick, or if not, you heard I'm sick\nAnd yeah, the flow from outer space, but I'm earthing this\nHow you sold grams? You ain't never served a brick\nIt's like you got no hands -- you ain't got a bird to flip\nI'm from the murder strip, hood life shady\nNah, I wasn't born a rapper -- the hood life made me\nBut lately, I've been in the hood like crazy\nPut red marks on your head, you'll look like Baby, baby\nI am great, skipping on the race\n730, but what I meant it's twenty minutes late\nNiggas reckless, give the kid a break\nScott Tissue records, I'm shitting on your tapes\nBut hey, I'm still lamping, Lex with the grill dancing\nStill scrambling cause yes, I'm a real champion\nOf course, come mess with a real cannon\nYou thought I fell off, well welcome to Still Standing\nWriter!"}], "artist": "J.R. Writer"}