{"songs": [{"title": "Intro", "album": "Lil Boat ", "year": "2016-03-10", "image": "https://images.genius.com/5e13fd7416e57fc857d2f0cc09da983e.800x800x1.jpg", "lyrics": "[Sample: Dory & Marlin]\nHey, Mr. Grumpy Gills\nWhen life gets you down, you know what you gotta do?\nI don't know what you gotta do when life gets you down\nJust keep swimming, just keep swimming\nJust keep swimming, swimming, swimming\nDory, no singing\nWhat do we do? We swim\nHo ho ho ho ho ho ho, I love to swim\nDory, Dory\nWhen you want to swim\n\n[Intro: Darnell Boat & Lil Boat]\nOh, okay. Where? Oh, you want me to sit right here? Where, look right there? Okay, okay, alright. I got it. Well... well, hello folks, Darnell Boat here. Today, I'ma tell you a little story about my two nephews, Lil Yachty and Lil Boat. Well, I don't know where to start. Look, here's Lil Boat now\nLil Boat!\nOkay\n\n[Verse 1: Lil Boat]\nI've got these strange voices inside my head\nKeep a stack and .380 beside my bed\nNot to be cool, but in case they run up on me\nIf y'all bet on my fam, clutch with double on me\nWent to school on a dirt road with black hoes and potholes\nThis shit was just then, this was four months\nLate nights with gang on them store hunts\nLoitering Walmart for pure fun\nLook at me now, all of my classmates like, \"Wow\"\nMy teachers like, \"Damn\"\nI remember I didn't have not a fan\nNow I step out and Lil Boat is the man\nWoah, this shit is surreal\nPockets stuffed in with blue bills\nSo much people trying to ask how it feels\nBut, nigga, I don't know\nEveryday I ball like finger roll (woo!)\nHow'd you do it? Only God knows (oh!)\nI want to know who's real until the time folds\nPeople looking at Lil Boat with their hands out cause I'm wearing nicer clothes\nI'ma stay down with the same niggas I came up with that's the master plan\n26 for a nigga hand, diamonds so cold you might need a fan (woo!)\nI don't know who I am sometimes\nI might rap a verse, I might sing a song\nCame up overnight from one song\nOne night get her out the thong\nOld heads hating on Boat\n'Cause I'm young as fuck and I'm rich as hell\nPants low like I'm fresh in jail\nBut I've been out, motherfuck 12 (woo!)\n\n[Interlude: Darnell Boat & Lil Yachty]\nSee, he's a little--he's a little bit more aggressive. Well, you know, as this story unfolds, and you know what I'm saying, as the story gets told, uh, I'll tell you a little bit more about Yachty. He's a little bit nicer. Let's call him\nHello? Hello?\n\n[Verse 2: Lil Yachty]\nOh, oh, ohhh\nHello Boat, it's so nice to meet you\nI'm so glad you came\nHello, hello\nWhat's poppin'? It's Lil Yachty, I'm in the party\nI need three thotties to come suck on my posse\nWhat's poppin'? Woah\nHello, hello, hello\nHello, hello\nHello, hello, hello, hello\nHello, hello, hello\nOh, hello\nWelcome to my life\nHello, hello, hello"}], "artist": "Lil Yachty"}