{"songs": [{"image": "https://images.genius.com/49e67f195e584291bc2a980f23cdad07.809x799x1.jpg", "year": "1996-10-15", "title": "At the Speed of Life", "album": "At the Speed of Life", "lyrics": "[Intro: Dialogue from Taxi Driver]\nListen you fuckers, you screwheads\nHere's a man who would not take it anymore\nA man who stood up against\nThe scum, the cunts, the dogs, the filth, the shit\nHere is some one who stood up\nHere is...\nYeah! Hennessy for Everyone Music proudly presents\nXzibit, movin' at the speed of life\nYeah! Check it\n\n[Verse 1]\nIt took a long time comin but we waited\nXzibit went from underrated, to now most anticipated\nNever would of thought that I would rock your set\nAnd get love and respect without no special effects\nOnly the rugged ruff shit that the hard rock need\nLyrics must contain more then just clothes bitches and weed\nThinkin how you like to see the next man bleed\nTryin to glorify greed; livin life at ridiculous speed - indeed!\nThe main goal's to achieve, to succeed\nHave it laid out for your seed\nBut the world gets colder every day by day\nPhysically, mentally gettin drained by L.A\nTrying to find piece of mind is like tryin to find a gold mine\nIt just won't happen, no time for relaxin\nReal soldiers of fortune the front line of the action\nSo never show a nigga what you packin (You know what I'm sayin?)\nIt's too much weight to be jugglin\nWho do you picture when you think about strugglin\nKids in the bed, no food stomach bubbilin\nOr niggas in the E-class heavy drug smugglin\n\n[Chorus]\nMovin'', yeah!\nYes, movin'\nAt the speed of life\n\n[Verse 2]\nAnd plus I feel that no style is darker than mine\nThere was a time it was all about beats and rhymes\nBut nowadays the blind just follow the blind\nAnd when I die, niggas still recite these lines\nTo rock the heads, waterbeds citys and towns\nBringin strength to the masses that be holdin it down\nThe underground! to upper echelon and beyond\nXzibit rock and roll the streets like a vagabond\nNigga wanna trip you gettin dissed like a blonde bitch\nMackin to Farrakhan, run game like a marathon\nIt's here today then tomorrow it's gone\nIt's the law of the land, a straight modern day babylon!\n\n[Chorus]\nMovin', yeah! Yeah! Like this\nLike this, at the speed of life\nAh! Bring it live, yeah!\n\n[Verse 3]\nXzibit lookin at the earth thru wide angles\nI find a stairway to heaven in the city of lost angels\nWhere small situations turn to heavy altercations\nWith a heavy-ass price cause, niggas don't fight no more!\nBefore hip-hop was all about drama\nAnything for a dollar before Kane fucked Madonna\nXzibit maintain and stayed bent like a comma\nJust me and my bottle, we shall lead not follow\nEmcees be full of shit but they style be hollow\nIt seems you've bitten off more than you can possibly swallow\nJust a day in the life of a man named X\nOnly blunts and latex for the opposite sex\nYou see niggas comin through to smoke out and pay respect\nEver since fifteen, I been ready for anything\nWhatever they bring in any shape form or fashion\nI live to the fullest and rock rhyme with a passion\nBut in the meanwhile if worse comes to worst\nBust a round or bust a verse whatever comes first\nYeah! we got it locked down tight\nXzibit bring truth to the light shit is movin, at the speed of life\n\n[Chorus]\nMovin'\nAt the speed of life"}], "artist": "Xzibit"}