{"artist": "Pusha T", "songs": [{"album": "King Push – Darkest Before Dawn: The Prelude", "title": "M.P.A.", "image": "https://images.genius.com/456d2c1e7b1dc2d52a08c5840820861b.1000x1000x1.jpg", "lyrics": "[Intro: The-Dream]\nI see the strangest things\nThe evil that money brings\nI swear it’s like a disease\nThat goes round and round and round like sirens\nAnd they wanna bury me\nWhy? Cause I’m anti everything\nI swear it’s like a disease\nThat goes round and round and round like sirens\n\n[Hook: Kanye West & A$AP Rocky]\nMoney, pussy, alcohol\nYou niggas pussy after all\nMoney, pussy, alcohol\nYou niggas pussy not at all\nGet in them drawers\nI had a dream I had it all\nI woke up and really had it all\n\n[Verse 1: Pusha T]\nThe three leading killers of you niggas\nIs the shit that’s most appealing to you niggas\nEven I fell victim to it, your pride don’t let you do it\nThe lies will get you through it\nMoney, pussy, alcohol, what a wonderful cocktail\nFronted my first brick over oxtails and ran with it\nDope is like a two-way street\nThe addiction, both you and me, now take a seat\nEvery car got a fleet, every broad get a jeep\nEvery sparkle in the club that wasn’t ours, we compete\nPoor minds, poor decision makers\nNo reward, then what’s the risk you taking?\nNew bitch I been fucking might start a rap war\nWon’t unveil it yet, can’t tell it yet\nDefense wins games Bill Belichick\nThese hoes having Google numbers, niggas better check\nYuugh\n\n[Hook]\nMoney, pussy, alcohol\nYou niggas pussy after all\nMoney, pussy, alcohol\nYou niggas pussy not at all\nGet in them drawers\nI had a dream I had it all\nI woke up and really had it all\n\n[Verse 2: Pusha T]\nShout out my bitches fucking baseball niggas\nThat dress like Bamas with guaranteed contracts\nYeah, I see your vision, sick of prison visits\nNow the Major League’s where you're fishing\nYou young and hot, so why not?\nThe dealers is washed, the money is dry, so take your best shot\nWe can’t judge you ‘cause we ain’t hug you\nWe sent you off to other hoods and let them niggas fuck you\nFor real, we made you watch from afar\nEven talked down on you, tryna dim your star\nUntil we seen them foreign cars pull up\nAnd watch them pick you up\nAnd then we realized we missed a diamond in the rough\nSo, make us proud, make it count\nUntil you learn to love ‘em, make ‘em spare no amount\nMake ‘em dig deeper to keep ya, knowing you deserve it\nTake advantage of it when you’re worth it\nReal bitches worth it\n\n[Hook]\nMoney, pussy, alcohol\nYou niggas pussy after all\nMoney, pussy, alcohol\nYou niggas pussy not at all\nGet in them drawers\nI had a dream I had it all\nI woke up and really had it all\n\n[Verse 3: Pusha T]\nI’ve been watching all you real niggas\nI done seen more won't than you will niggas\nTake a swing, snatch a chain\nLose your mind, go insane\nI’m in the club, you in the club too\nI got money, you got money too\nYou think it’s honey dew\nWhispering in my ear like a hunny do\nEyeballing every bottle that we running through\nTrying to stand near, nigga damn near\nPushing bitches out the way to Instagram here\nIt’s no pictures, now you in your feelings\nI’m a real dope boy, no stranger dealings\nBruised ego, Henny-induced Debos\nNickel bag niggas, all of a sudden Ninos\nI cancel all of you G-Moneys for G money\nI get it done for quarter ki money, for real\n\n[Hook]\nMoney, pussy, alcohol\nYou niggas pussy after all\nMoney, pussy, alcohol\nYou niggas pussy not at all\nGet in them drawers\nI had a dream I had it all\nI woke up and really had it all\n\n[Produced by Kanye West and J. Cole]", "year": "2015-12-18"}]}