{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "Fly", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "[Verso 1]\nFecha os olhos man!\nAprende que a ver não te vais aperceber de nada\nA vida é lá fora mas é cá dentro que tu farás a tua jornada\nVivemos numa casa, bonita arrumada mas de janela fechada\nAparência é que ilude, o toque de veludo eu sinto em cada passada\nEu vivo em toda a morada\nTranspiro pela tua cara\nEu sirvo a qualquer vontade e viro a minha cara à chapada\nNão sou rei nenhum, tira-me a coroa e diz-me quanto ela custou?\nNão quero ser ídolo, quero que a índole seja a de espalhar amor...\nImagino o meu corpo imóvel no chao\nMinha alma flutua co beat da canção\nUm arrepio activa-me a sensação\nPor um fio ligo a minha percepção\nNao sou carne pa canhao, lutar po cifrao? esquece, nao contem comigo!\nApenas luto e canto, vou entrando num abrigo:\n'Tou na toca do coelho perguntando como é que eu cheguei aqui\nNada faz sentido, devia ter ido pa trás, pq é q eu fugi?\nMas agora 'tou bem, sou cidadão no pais da maravilhas\nAlice é vizinha, as vezes fodemos até gastarmos as pilhas\nE quando acordamos não vemos noticias\nApenas sentimos na pele uma brisa de caricias\nEla tem demónios, eu mato-os à espada\nEla ri-se dos meus e mata-os à padrada\nSe o perfeito existisse, eu qd o visse dava-lhe um kiss na cara\nUm dia a velhice irá tratar disso e virá me buscar a casa\nOu melhor, um dia a velhice irá me deixar em casa\nPor isso é que eu digo, venha o juízo final, aqui nada me atrasa..\n\n[Refrão]\nPodes voar não sejas anjo caído\nO teu lugar no céu não foi esquecido\nVai levantar o véu, sê o marido\nE ama a morte como a vida e depois disso:\nFly fly fly...............", "year": "2014-06-06"}]}