{"songs": [{"year": "2019-10-04", "album": "Stacked", "image": "https://images.genius.com/7fafbbdcf6308759c7d9ebb44684b39a.1000x1000x1.png", "title": "Mobb’n", "lyrics": "[Intro]\nDon't fuck with me I pull up wit the robbers\nPretty mob bitch, we pullin' up like we mobsters\nDon't fuck with me I pull up wit the robbers\nPretty mob bitch, we pullin' up like we mobsters\nBitches think it's sweet 'till they find out I'm a monster\nI don't fuck with hoes, all these bitches is imposter (On God)\n\n[Verse 1]\nIf they talking 'bout my pussy, it's delicious\nI got all these niggas trippin', every nigga wanna hit it, uh\nBut I'm exclusive, I ain't got no time to kick it\nGotta pay me for a visit, bitch I'm all about my business\nEver since I came into this rap shit, I been killin' shit\nAll these bitches copy what I do, I might build the bitch\nAll this ice on both my wrist, I'm numb so I ain't feel the shit\nGot an ice cube on both of my ears, so I ain't hearin' shit\n\n[Chorus]\nBitch\nKnock if you buck\nIf you say you with it, why the fuck you ain't pull up?\nAnd I keep that pump in the trunk\nBitch I'm with the shit and I'ma line you hoes up\nKnock if you buck\nIf you say you with it, why the fuck you ain't pull up?\nAnd I keep that pump in the trunk, yeah\nBitch I'm with the shit and I'ma line you hoes up\n\n[Verse 2]\nI put my hands to my fists, like I'm fightin' up somethin'\nKnockin' bitches out, just like I'm Tyson or somethin'\nI'ma let the chopper sing just like it's Bryson or somethin'\nBitch I'm all about the smoke like it's vikings or somethin'\nThese bitches talkin' on the 'Gram though\nReally be some fans though\nGot 'em big mad 'cause I'm the head bitch in commando\nI’m the puppet master, pullin' strings just like a banjo\nIf you ain't 'bout that life then get the fuck up out the bando\n\n[Chorus]\nBitch\nKnock if you buck\nIf you say you with it, why the fuck you ain't pull up?\nAnd I keep that pump in the trunk\nBitch I'm with the shit and I'ma line you hoes up\nKnock if you buck\nIf you say you with it, why the fuck you ain't pull up?\nAnd I keep that pump in the trunk, yeah\nBitch I'm with the shit and I'ma line you hoes up\n\n[Verse 3]\nIt's Big Kash and I'ma pull up with the racks (Pull up with the racks)\nBasic bitches, I can't let these hoes distract me (No)\nGettin' chauffered, most these bitches be in taxis\nShe beyond scared straight, I got her runnin' like a track meet\nWho is you? Pull up with that 22\nGive a fuck about her, don't give a fuck about you\nBitch I'm all about my cash, I prefer my hunnids blue\nGot these bitches big mad, tell that bitch to bust a move\n\n[Chorus]\nBitch\nKnock if you buck\nIf you say you with it, why the fuck you ain't pull up?\nAnd I keep that pump in the trunk\nBitch I'm with the shit and I'ma line you hoes up\nKnock if you buck\nIf you say you with it, why the fuck you ain't pull up?\nAnd I keep that pump in the trunk, yeah\nBitch I'm with the shit and I'ma line you hoes up\n\n[Outro]\nGet beat the fuck up, yup"}], "artist": "Kash Doll"}