{"artist": "Canibus", "songs": [{"title": "Cingularity Point", "album": "The ‘C’ of Tranquility", "year": "2010-10-05", "image": "https://images.genius.com/bcd4d41b609a532514c5daa8d24d2bbd.600x600x1.jpg", "lyrics": "[Intro: Canibus]\nThis is for the I.M. Culture\nA poor pauper's offering for the alter\nThe 'C' of Tranquility, I'ma show you what I see\nThe 'C' of Tranquility, I'ma show you what I see\n\n[Hook: Canibus]\nThe 'C' of Tranquility, what will it really be?\nWhat does the future hold? What do you really see?\nI see a revolution in the industry\nThat will ignite the rebirth of MCs lyrically\nThe 'C' of Tranquility, what will they really be?\nWhat does the future hold? What can you really see?\nI see the partition of God's religion\nBecome united by our bars and our common visions\n\n[Verse 1: Canibus]\nBeen a long time spitting long rhymes, but I never left you\nAlways came back busting rhymes that were special\nBack then, I wanted to impress you by addressing the truth\nNowadays, I'm just confessing in the booth\nThe Golden Era of Rap will always be apart of me\nThe future talks to me because the present is ignoring me\nMy destiny is calling me, the armory of God is guarding me\nBut all you can see is holographic artistry\nRhyme mechanics, like that of a blind pianist\nThe keys are metallic, my fingers are magnets\nThe music is magic, what is this madness?\nThe stanzas are rites of passage, your left brain habits become your baggage\nThe masses become savage, roaming the streets with torn fabrics\nCreativity is less than average\nEvery baby is born a bastard, so why did you have it?\nThis question requires no answer, I understand it\n\n[Hook: Canibus]\nThe 'C' of Tranquility, what will it really be?\nWhat does the future hold? What do you really see?\nI see a revolution in the industry\nThat will ignite the rebirth of MCs lyrically\nThe 'C' of Tranquility, what will they really be?\nWhat does the future hold? What can you really see?\nI see the partition of God's religion\nBecome united by our bars and our common visions\n\n[Verse 2: Canibus]\nThrough my music, magic and inoculated interaction\nRip the Jacker shows you the future in fragments\nThrough madness my view is expanded, request passage permission is granted, I'll introduce you to the language of dragons\nTo help balance near impossible trances in the labyrinth of the enchanted\nWhere air quality is unbearably rancid\nFrom evil spirits, temperatures frigid\nI cross wooden bridges over methane rivers, it sounds crazy, but listen\nConcise lyrics strike down from the heavens\nA titan like Mike Tyson, Beastmaster with a tiger and pigeon\nA four finger ring with a eyeball in it for vision\n'Cause I ain't scared of no 9 foot 11 winged lizards\nI'm known as the Ripper, my soul was delivered to a wizard\nFor spiritual slave labor in a prison\nMy life is my sentence, so I live it\nBut I studied the physics and understand it, so it's only a visit\n\n[Hook: Canibus]\nThe 'C' of Tranquility, what will it really be?\nWhat does the future hold? What do you really see?\nI see a revolution in the industry\nThat will ignite the rebirth of MCs lyrically\nThe 'C' of Tranquility, what will they really be?\nWhat does the future hold? What can you really see?\nI see the partition of God's religion\nBecome united by our bars and our common visions\n\n[Verse 3: Canibus]\nCombinatrix, anything of this persuasion is considered ageless\nBeyond the matrix\nBeyond time displacement of space and spaceships in oasis\nBeyond the reach of human contemplation\nThe music is layered, not computer generated\nA human made it to satisfy unusual cravings\nThe mystic in a room with crystal walls and floors\nLooking into a crystal quartz orb, reciting lyrical law\nThat cause warm feeling sensations\nPrecipitating from the finger tips to the arms to the lips to the jaws\nTo a gold tongue that spits to the tone of the drum\nWith the oxygen that flows down the throat to the lungs\nTill every color of my chakra glows brighter than the Sun\nYou and I become we, we become one\nAnd the clarity of singularity has begun\nBetween zero point zero and zero point one\n\n[Hook: Canibus]\nThe 'C' of Tranquility, what will it really be?\nWhat does the future hold? What do you really see?\nI see a revolution in the industry\nThat will ignite the rebirth of MCs lyrically\nThe 'C' of Tranquility, what will they really be?\nWhat does the future hold? What can you really see?\nI see the partition of God's religion\nBecome united by our bars and our common visions"}]}