{"songs": [{"year": "2010-07-30", "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "For the Homies", "lyrics": "[Intro]\nAnd this is for the homies\nI'm talking bout the swap meets, Rollie\nChain-wearing niggas with the white tee\nBaby tell the truth, yeah you know we...\n\n[Verse 1: Kendrick Lamar]\nSomebody get ready to pass me the hit of that endo, I'm tryna get blown\nI'm tryna get turned up like the fifteens in my Cadillac Brougham\nLooking for E.T. to phone home\nTadow, the flavor I kick reminisce the good days\nThinking back when we used to run in the swap meet for the Rollie chains\nPro Club t-shirts, whiter than Anglo-Saxons\nMake it a 1X-Tall, crispy with the cotton fashion\nThat's fashion if you come where I'm from\nCompton California, One love to the murder capital under the sun\nYoung niggas running around the street with heat bigger than me\nBut I don't trip, I still dip like salsa to a chip\nRolling down Rosecrans to scoop up my man, A-Mack\nHe talking about some foolishness on how we can pick up on some hoes, believe that\nAnd so I scooped him round 3:30, Telling me it's all good\nTiger Woods, Now we looking for the birdy birdies\nStopped at the sto' to get some rubbers\nPulled up on the breezies, Well what do you know? I think they love us\n\n[Hook]\nAnd this is for the homies\nI'm talking bout the swap meets, Rollie\nChain-wearing niggas with the white tee\nBaby tell the truth, yeah you know we got it going on\nAnd if you feel good (hey)\nRaise your hands high and throw up your hood (hey)\nRepresent the city like you know you should (hey)\nI want to make sure that you understood we got it going on\n(Is that right? Is that right?) We got it going on\n(Is that right? Is that right?) We got it going on\n(Is that right? Is that right?) We got it going on\n(Is that right? Is that right?) We got it going on\n\n[Verse 2]\nAs I continue my day, quite copacetic\nHeaded to my momma's house to see what them greens are talking bout, hungry as hell\nHad the right grub, I bail, need some gas\nARCO station on Avalon, a relative hit me up as he rolled past\nWe used to stand in line for Jordans, excited we got 'em\nRocking platinum FUBU jeans with rubber bands tied to the bottom\nThrowback jerseys, Chamberlain and James Worthy was two of my favorites\nI might pull out the green Larry Bird on special occasions\nBut anyway I'm steady coasting, smoking on that Hiroshima\nAshtray got a million roaches, I'm focussed but feeling good\nThe homies hanging on {?} and Monte Carlos\nImpalas and Tahoes, shoot something nigga, break that fifty\nI'm grabbing the city like I'm supposed to\nMaking my presence felt like Christmas day, what can I say?\nEvery vocal is spoken with the wisdom of a G\nIf you can't relate then please have a seat\n\n[Hook]\n\n[Verse 3]\nSo, wherever you located, won't you let it be known\nAnd put on for the soil of which you was grown\nI put on like brand new Chuck Taylors\nWhile giving you cuts like fresh tapers\nI'm such a fool with it, go nuts\nYou bullshitting like Tuck, the bounce then untuck\nThe bounce then throw up, a rare jewel, you duck\nTake 'em to school I must, this for the cool in us\nThis ain't for you, so what?!\n\n[Hook]"}], "artist": "Kendrick Lamar"}