{"artist": "Ace Hood", "songs": [{"title": "No Flex Zone (Freestyle)", "album": "Body Bag 3", "year": "2014-06-23", "lyrics": "[Hook: Swae Lee]\nNo flex zone, no flex zone\nThey know better, they know better\nNo flex zone, no flex zone\nThey know better, they know better\nWon a gold medal, and a gold bezel\nI treat it so special, now ya ho jealous\nFreak hoes, got several, they tens or better\nI'm a trendsetter, I'm a go getter\n\n\n[Verse 1: Ace Hood]\nAttention err'body, I'm gettin' sick and tired of gettin' modest\nI'm gettin' plenty money, now they think I'm Illuminati\nI'm the reason why they own a new Bugatti\nI'm the one who give the flow to the game\nRap game, it will neva be the same\nI done burf you niggas and then nervous you niggas\nI'm the reason why you eva had a name\nI'm the one who runnin' thangs in the south\nYou don't run a damn thing but yo mouth\nNiggas talkin' outta terms till I pull up with the burn\nNow the souls outside of yo house\nMan, see me ride round the city with the top down\nBad bitches all out of heads down\nTurnt for a nigga whole throat\nAnd I'mma come and get it like a rebound\nBust it one time like a Greyhound\nAss in the air with ya face down\nAll this money on the floor, all this money on the table\nIt so much you would think Floyd May 'round\nWhy the broke boys always wanna flex?\nBe the main ones, scare me with the checks\nNiggas ball for a minute, blowin' bands on them bitches\nNow they missin' tryna car you collect\nHowl, you's a fraud, nigga, I'm at yo bottle\nU a thot, bitch, you ain't no model\nIt's a no flex zone, couple gold chains on\nI look like I just hit the lotto\nWhole minute gone with a foreign bitch tourin'\nHeard ya new shit, ah, bored\nI'm in the studio, cookin' that greatness\nTake time, have a lil bit of patience\nI'm the one, no Neo with the Matrix\nNo flex, we the best hood nation\nThese niggas wanna claim they run it\nThou trippin' like ya took a vacation\nShout to boy AC and my dawg Choo-Choo\nWhere the lil homie project baby?\nDane gank I see ya Pompano caracida\nLot of deal, deer feel with my Haitians\nBrower\n\n[Hook]\n\n[Verse 2: Slim Jimmy]\nYoung niggas got to get to the money\nFive chains on, they look at me funny\nShowed up with the juice and the troops\nRoll a seven every time I shoot\nShe said, why you have so many condoms with you?\nI said, I'm a player, to be honest with you\nHublot, whoo, so shiny\nMind you, my crew right behind me\nWent shopping, could've bought an island\nTalking money, when I'm with Italians\nSpilling purple, on the red carpet\nAnd I'm flyer, than a nigga on a hang glider\n4-5-6-7 chains on, just stay in your lane, ho\nDon't you like these A. Wang's? Don't you like these gold fangs?\nYou a well known flexer, I'm a young trendsetter\nThese hoes, they reckless, they slick, they messy\nThree hoes freak dancing, on the loud singing acapella\nChain clang, like heavy metal\nSremm killed the haters, God bless them\n\n[Hook]", "image": "https://images.rapgenius.com/2e810d7fc4b6e7f98ff2451b78b02cbb.500x389x1.jpg"}]}