{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/c44fd26366709a679c4da2e135c11795.1000x1000x1.png", "year": "2010-01-01", "album": "Trunk Muzik", "lyrics": "[Intro]\nFuck you fuck you fuuuuuck you\nFuck you fuck you fuuuuuck you\n(its the big bad wolf)\nYeah\n\n[Verse 1: Yelawolf]\nI’m from Alabama buddy and what?\nWhat does that mean? you don’t like my state?\nYou put a stereotype on my people homie\nBut you know exactly what I’m gonna say\nYou see me shining without a diamond at all\nBut you’d rather see me stuck in the shade\nOh you mad I’m getting butter motherfucker\nYou don’t wanna see yeller get paid\nThat’s a reasonable excuse to hate\nSo thank you I must bless you\nIt's unbelievable you could rescue\nThe nephew and girl let loose\nWho am I? well you know who I am\nWhen cat fish billy's middle finger flings\nAnd all the love I’m getting from the critics\nIs making me just wanna turn around and sing (sing!)\n\n[Hook]\nFuck you! fuck you! fuuuuuck you! (Sing along!)\nFuck you! fuck you! fuuuuuck\nYou! (Fellas!)\nFuck you! fuck you! fuuuuuck you! (Ladies!)\nFuck you! fuck\nYou! fuuuuuck you! (Everybody!)\n\n[Verse 2: Yelawolf]\nYou might be used to hearing it\nAnd if you are cool then I’ll say it again\nIf you ain’t got a problem with saying out loud\nTurn around and tell it to a friend\nYou might be riding inside of your car alone\nBut you can do it with one hand\nSo throw it up when you see the boys in blue\nPassing you in a patty wagon van\nI’m a crook, take a look\nTwo words written all over my hooks\nI got in a fight last night with the security\nThis is all that it took\nI know I got a cubic zirconium watch\nAnd a chain and an old money rang but\nAll the attention it brings from the women\nIs making me wanna turn around and sing, Bitch (Fuck you!)\n\n[Hook]\n\n[Verse 3: Yelawolf]\nYelawolf I’m a piranha\nEat a beat, see the physic, yep I’m a runna'\nGet a 'fuck you', buddy come take a numba'\nSure as the sun sets over my long dick in the summa'\nI give a long bird too many wrong words\nThat fall to the life of my persona'\nFor the fiftieth time if you wondered, don’t wonder\nListen to the back, to the front\nTell the people what they want\nIf you came into the club with a sack full of buds\nBut they won’t let you roll up a blunt\nTell 'em, If they tryin' ta\nYou gotta hot girl tell her I’m gonna\nYou in the house and the song comes on\nGo outside and yell it in you pajamas (Sing!)\n\n[Hook]\n\n[Outro: Yelawolf]\nYeah\nYelawolf\nA.k.a catfish billy\nSupa hot beats\nFuck you\nHollar at g\nMustard\nYeah I’m still at it\nGhetto vision\n(It's the big bad wolf)\nHolla at your boy\nMiddle fingers in the air\nFuck You", "title": "F.U."}]}