{"artist": "Porta", "songs": [{"album": "No es cuestión de edades", "title": "Es por moda", "image": "https://images.genius.com/1d76236de7af6962571eed68e31756dd.768x768x1.jpg", "lyrics": "Es por moda, algo se trama por mi zona\nNiñatas visten rappers por su novio y qué les jodan\nSe creen que esto es un juego en el cual es fácil jugar pero\nA ver, ¿en serio piensas que me puedes engañar?\n\nBah, las cosas claras, cuidao' con quien te encaras\nLas señoras flipan por la calle cuando ven mis bragas\nY es que creo que os llevo en casi todo la ventaja\nNo engañarías ni a tu propia mamá con esa falsa tafa\n\nTípicos tópicos que solo son polifacéticos\nCuánticos cónicos ¿pero qué coño estoy diciendo?\nTengo entendido que no entiendes lo que te cuenta mi lengua\nMengua mi estilo al ver tus pintas tan patéticas, ascética\n\n(no es cuestión de estética)\n\nMira qué estúpido que apenas lleva un día en el rap\nY ya se cree que es único\nCómprate unas Buffalo, que papá te dé dinero\nLo primero es cortarse el pelo estilo calimero\n\nEres el centro de atención, quieres ser la grupie del Porta\nSi te gusta el reggaetón lo llevas mal y es que eres tonta\nEstás por moda, ¿tú? tú solo eres mi imitadora\nDemuestro estilo en mi primer tema, a ver, ¿quién ríe ahora?\n\n(Tía, el otro día vi un notas en la tele con lo pantacas tribal diciendo no sé qué de los veinte megas...)\n\n[Estribillo]\nAhora por hacerte una letra de mierda ya eres mc\nTienes micro en el PC y grabas un rap, eres el amo di que sí\nDi por ahí que nadie te puede en batallas, en letras\nEn clavarlas, en flow y en yo qué sé que más (x2)\n\n[Verso 2: Porta]\nEs Syra y Porta, yo, observo desde Barcelona\nHablemos del hip -hop y del por qué el rap ahora es moda\nYa no mola ir por la calle ver pijos vistiendo tribal\nBailan break, van de Vandame y además al son de Bisbal\n\nEsto es sentimiento y no una vestimenta, vas de imbécil\nVas de entendido, tranquilo, componer rap no es tan fácil\nHazte una letra, ve diciendo por allí que ya eres mc\nY te haces un club de grupies como lo hizo Black Eyes Peas\n\nEnseña tu rap a tu mejor colega y dirá que lo vales\nPero no es verdad, y además sé que tú lo sabes\nCómprate unos platos de mix, prueba suerte con ser DJ\nY hazte fotos con tus platos y con tu nuevo jersey\n\nMe das pena, tu concepto del rap no es más que el típico:\nCuida la estética, el físico. Sé que tu papi es rico\nFarda de novia y de coche y de lo mucho que costó\nTúnealo con buenos bafles y con Play Station 2\n\n¿Quieres ir ancho? intentar formar parte de esta movida\nNunca serás aceptado como un alma incomprendida\nPorque estás solo por moda: 'todos van así en el cole\nY ya eres rapper tan solo por vestir Dikies y Console\n\nHip Hop es un sentimiento, un movimiento cultural\nTú no sabrías definirme las tres siglas que componen rap\nMe da rabia ver a un cualquiera rapeando en la tele\nPara eso ya está el OT, maneja y recluta peleles\n\nMe cansé de ver anuncios que intentaban hacer rap\nPara promocionar juguetes para esta navidad\nB-boy de escaparate vas de que entiendes en esto\nAmigo respetas sin respetar el respeto del resto\n\n(Tía que en mi cole ahora llevan los pantalones anchos y ya se creen que son raperos y son mc's y yo qué sé más...)\n\n[ Estribillo ]\nAhora por hacerte una letra de mierda ya eres MC\nTienes micro en el PC y grabas un rap, eres el amo di que sí\nDi por ahí que nadie te puede en batallas, en letras\nEn clavarlas, en flow, y en yo qué sé que más", "year": "2006-06-11"}]}