{"artist": "Fabolous", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/8e2843dcf4a386d5de04cd6e203899e1.391x391x1.jpg", "lyrics": "* pre-release version of \"Diamonds\" before \"From Nothin' to Somethin'\"\n\n[Intro]\nDiamonds on my damn chain! It ain't hard to tell!\n\n[Hook]\nDiamonds in my damn chain!\nDiamonds in my damn chain!\nI'm like ooh daddy, I see you with that damn thang'\nNot my fault, I'm feelin' ya campaign\nI like you but, I really like your damn chain!\nDiamonds in my damn chain!\nDiamonds in my damn chain!\nIt kinda explains the way she be actin'\nShe liked my necklace so she started relaxin'\nNow that's what the fuck I call a chain reaction!\n\n[Verse 1 - Fabolous]\nYo, you think you like me now, wait until the light hit me\nI bet they house somebody girl spend the night with me\nThey gota love it, if not, then I guess they haters\nThis kinda necklace turn on the investigators\nThey ain't got one problem with this\nSquare facewatch lookin Sponge Bob on the wrist\nOne white, one gold, one nice, untold\nYou can look but don't touch, Guns might unload, now\nI respect them thugs who get they jackin' on\nBut we squeeze set every slug that we be packin's long\nYa boy got the drug money we be stackin on\nLotta carrots, not the one's Bugs Bunny snackin' on\nGot em, get em close and, lookin' like I scooped up-\n-the Titanic chain, from the bottom of the ocean\nI play them diamonds well when I got dat jewelery on\nAnd she called me Karat Jeter, maybe Canary Bonds\n\n[Hook]\n\n[Verse 2 - Lil Wayne]\nAhh! My name is Weezy F Baby! Oww!\nI usually don't do this, ha! Ok, I'm lyin'\nCuz these diamonds of mine, just sparkle like wine\nI'm easy to find, In the darker night time\nI get so much attention from ya' eyes, like signs\nI'm, kushed out my mind, Patron shots with lime\nMy necklace is a crime\nAnd that bitch fine, what that girl name\nI call my jeweller over tell her; \"Make that girl a chain!\"\nI take that girl to Spain, she can't pronounce a thang'\nAnd she got her girlfriend on the side like fame\nThe fetish is Louiane, I'm bombin' like Hussein\nBut I'm that fire, now I swallow my Butane\nResidin' on a plane, the sky is my domain\nI'm in and out the country, passports, and sweat-shorts\nAnd tanktops, and sweet thoughts, from sun shades, and private airports\nAnd of course... (Watchu got boy), I got...\n\n[Hook]\n\n[Verse 3 - Fabolous]\nYo, maybe it's them VV's, cuz' they sets Susters'\nSit on the next bus like that show on MTV\nThe waves on the chain, make a nigga fly like the wings on a plane\nWhen you sittin in between 'em\nEven when you clean em', Glitenin' when you see 'em\nBeemin' through the tints when I'm sittin in the \"Phenom\"'\nOops! I mean Phantom, my words got tangled man\nBut this tiger striped watch'll make ya bitch a Bengals fan\nWe all know Jacob, check the shit he did\nHe spent more time, \"Making The Band\" than Diddy did\nYou feel my campaign, then drop your old spouse\nI'm out in DC, at the \"White and Gold House\" (White and Gold House)...\nWanna convince me love, Secret Service meet with some of that Lewinsky love\nShe saw the chain, baby brain, no strain ever since\nNow that's what the fuck I call a real \"Chain of Events\"! Nigga\n\n[Hook]\n\n[Outro]\nDiamonds on my damn chain! It ain't hard to tell!", "title": "Diamonds (Alternate Version)"}]}