{"artist": "Pharoahe Monch", "songs": [{"album": "W.A.R. (We Are Renegades)", "title": "Shine", "image": "https://images.genius.com/2694343eb76859336bf01cf74ae9f24b.250x250x1.jpg", "lyrics": "[Hook: MeLa Machinko] - w/ ad libs\nIn my heart and in my mind\nI'm gon' win, in due time\nShow me the way, give me a sign\nAnd I'm gon' shine, I'm gon' shine\nI'm gon' shine, I'm gon' shine\nI'm gon' shine, I'm gon' shine\nI'm gon' shine, I'm gon' shine\nI'm gon' shine, I'm gon' shine\n\n[Verse 1: Pharoahe Monch]\nLook man, do not get my block pissed, we'll blast your brain\nTwo hundred thousand dollar whips and chains\nCrooked cops, Crips, crack cocaine\n2Pac, Chris, I'm still feelin the pain\nSeven year old girl, shot and slain?\nWhat does it all mean? We go insane\nIn the struggle, the stress make him asthmatic\nWe're I'm from, we do not eat organic (talk about it)\nYou see my mama can not afford Whole Foods\nShe break fast for the bread, call it soul food\nWhere I come from ... let it breathe\nWhere I come from, no one runs when funds run low in lump sums\nWe chose to dump dumb dumb bullets dunn dunn\nWe livin hum drum in the slums\nWhere scum conceal stun guns\nThe words mum for fun son\nConundrums, AIN'T PRETTY!\nIn this cess pool called New York Shitty\nI call it that cause it smell like SHIT!\nWalk around hunchbacked or you might get hit (talk about it)\nI knew a nigga sold crack to his moms\nThat same motherfucker sold crack to his kid\nLookin like three hundred comin back from his bid\nLike \"Pharoahe, let's get this money for real\"\n\n[Hook] - w/ ad libs\n\n[Verse 2: Pharoahe Monch]\nHe said \"Pharoahe, let's get this money up\"\nWhat the fuck, what you need me to holla at Steve Rifkin?\nHit him, \"Escape from New York\" like Snake Plissken\nI told you from the gate that you needed more marketing\nAnd these major labels are not listenin\nStood in a B boy stace, teeth glistenin\nFrom the gold in his mouth, the summer breeze was whistlin\nI contemplated my retort, eyes fixed in\nOn a crucifix around his neck, I guess he was Christian\nJust then, the police siren had pitched in\nTo the soundtrack of the hood, so I spoke with conviction\nSpoke as if I was 6'10\" with thick skin\nPut a little bass in my voice like pitchmen\nCause where I come from\nWhere I come from, we all come from\nSky, moon, the stars, the Earth and Sun\nMultiple skin tones, your blood is one\nThe pen is the ammo to my automatic gun\nBring to fruition what I write to get me out of the slums\nAnd I'm a shine, sh-sh-shine, shine, shine\nShine like the Sun, the world is mine\nEach line of speech designed to transcend time\nAnd reach, the unborn to transform your mind\nAnd I'm a shine, shine\n\n[Hook] - w/ ad libs\n\n[Outro: Pharoahe Monch]\nNow New York if ya in the house and ya turnin it out\nWithout a doubt, know what I'm talkin about\nJust scream and shout and everybody say\nSh-sh-sh-shine, shine, shine\n\nNow Detroit with the funky beats, gettin wild in the street\nSee the mark of the beast, say fuck the police\nWhat up X?\nShine, sh-sh-sh-shine, shine, shine\n\nChi-town with the funky sound, soul by the pound\nJust get on down with the w-w-woo! w-w-whoa!\nSay sh-sh-sh-shine, shine, shine\n\nWest coast, side with the most\nHoldin your toast, ya brag, ya boast\nWhat the ..., what the whoa!\nEverybody say, sh-sh-sh-shine, shine, shine\n\nDirty, ah ah, dirty (ya know) X2\nDirty, ah ah, dirty (come on) X4\nI say, sh-sh-shine, shine, shine", "year": "2010-07-27"}]}