{"artist": "Yung La", "songs": [{"album": null, "image": "https://i.genius.com/eacc087433f0a592c65bc8b0446c9caf92acece8?url=https%3A%2F%2Fd3rt1990lpmkn.cloudfront.net%2F640%2F352145f00e11e692782974517fbd5322f9bfa715", "year": "2008-11-25", "lyrics": "[Intro: Yung L.A.]\nOh!\nBow, (bow), bow, bow, bow\nAin't I (ain't I), ain't I (ain't I)\nAin't I (ain't I), ain't I\nOh! Oh, le'ggo! (Remix!)\nBlack Illegal boys\nGrand Hustle Boys\nAin't I (ain't I), ain't I (ain't I)\nRemix!\n\n[Verse 1: Yung L.A.]\nYou got to know the boy futuristic, ain't he? (Ain't he?)\nMy work can make the Js do the jumpman, can't it? (Can't it?)\nYou got to know this the remix right here (Bow!)\nGrand Hustle baby, it's the kings right here (Bow!)\nYou got to know we guapin' (Guap), pockets extra sloppy (What?)\nDon't I love my vegetables? Extra cheese and broccoli (What?)\nDon't Yung La like to kick it like karate? (Karate!)\nDon't I be with J-Money serving everybody? (Trap!)\nAin't we up in Magic City throwing up the profit?(Throw it up!)\nAin't me and Tip taking off like a rocket? (We taking off!)\nAin't my, ain't my, ain't my, ain't my, ain't my, money long?\nAin't I, ain't I, ain't I, ain't I still putting on? (Bow!)\n\n[Hook: Yung L.A. & (Young Dro)]\nAin't I? (Ain't I?) Ain't I? (Ain't I?)\nAin't I? (Ain't I?) Ain't I?\nAin't I smoking strong? (Strong?) Ain't I putting on? (On?)\nAin't I rocking yays? (Yays?) Ain't my money long? (Long?)\nAin't I? (Yuhhh!) Ain't I? (Yuhhh!)\nAin't I? (Yuhhh!) Ain't I? (Yuhhh!)\nAin't I' in the 'Ville? (Yuhhh!) Ain't I on the hill? (Young Dro!)\nAin't I on a pill? Ain't I, ain't I real?\n\n[Verse 2: Young Dro]\nOkay, my rims so big; I'm at the tip-top, ain't I? (Ain't I?)\nChoppers in the trunk'll make you do the \"Macarena\" ('Rena)\nPolo to the floor, yeah, motherfucker, ain't I? (Ain't I?)\nAll-black coupe, I can buy it, bitch, can't I? (Can't I?)\nRemix, Yung La and T.I, this a banger (Banger)\nDro be on that thing, you don't hear me, trick, ain't I? (Ain't I?)\nBig Rolls Royces (Royces), and I got 'em nauseous (Nauseous)\nWe be in Ferraris, the cars with the horses (Brrrr!)\nAin't I on a pill? (Yuh!) Riding down Dill\nIce, 30 below, minus the wind chill (Ugh!)\nAin't I packing chrome? (Chrome) and I'm blowing strong (Yeah)\nAin't I, ain't I, ain't I, ain't I got it going on?\nYoung Dro!\n\n[Hook: Yung L.A. & (T.I.)]\nAin't I? (Ain't I?) Ain't I? (Ain't I?)\nAin't I? (Ain't I?) Ain't I?\nAin't I smoking strong? (Strong?) Ain't I putting on? (On?)\nAin't I rocking yays? (Yays?) Ain't my money long? (Long?)\nAin't I? (Ain't I?) Ain't I? (Ain't I?)\nAin't I? (Ain't I?) Ain't I? (Hey! Hey, it's the King, homie!)\nAin't I' in the 'Ville? (Well, ain't I?) Ain't I on the hill? (Well, ain't I?)\nAin't I on a pill? (Hey, ain't I?) Ain't I, ain't I real?\n\n[Verse 3: T.I.]\nRalph Lauren, Purple Label; ain't I fresh as I can be?\nMade it through my situation; ain't I blessed as I can be?\nAin't I laughing at you haters trying to take a shot at me?\nThey don't know which way to go; I'll make it easy; follow me\nHonestly, ain't I insane? I think that's the way I gotta be\nAin't I so, so superfly? Boy, ain't nobody hot as me\nAin't T.I. all on tv when he wake up and go to sleep? (Ain't he?)\nEverywhere, they notice me, and for yourself just go and see\nMy community I'm serving, though they hope I don't succeed\nHear me speak, they so intrigued\n\"Ayy, ain't he snitching?\" No, indeed\nYou come with that common flow\nYour show, I have to commandeer\nSince I see you can't take over, I'll just have to volunteer\nAyy, ain't I your superior? Listen here, bruh: you not a peer\nI'm so Zone 1 that it ain't funny, twice the G that I appear\nRep Bankhead so loud and clear, gon' be gone for bout a year\nSo Paper Trail you gotta hear, but ain't that \"Ain't I\" outta here? Ayy!\n\n[Hook: Yung L.A.]\nAin't I? (Ain't I?) Ain't I? (Ain't I?)\nAin't I? (Ain't I?) Ain't I?\nAin't I smoking strong? (Strong?) Ain't I putting on? (On?)\nAin't I rocking yays? (Yays?) Ain't my money long? (Long?)\nAin't I? (Ain't I?) Ain't I? (Ain't I?)\nAin't I? (Ain't I?) Ain't I?\nAin't I' in the 'Ville? ('Ville?) Ain't I on the hill? (Hill?)\nAin't I on a pill? (Pill?) Ain't I, ain't I real?\n\n[Outro: Yung La]\nOh!\nBow, (bow), bow, bow, bow\nAin't I (ain't I), ain't I (ain't I)\nAin't I (ain't I), ain't I\nOh! Oh, le'ggo! (Remix!)\nBlack Illegal boys\nGrand Hustle Boys\nAin't I (ain't I), ain't I (ain't I)\nRemix!", "title": "Ain’t I (Remix)"}]}