{"songs": [{"year": "2014-07-01", "title": "Blue Sunshine", "image": "https://images.genius.com/5ac985192ecf998a6a862a00118c5d82.977x1000x1.png", "lyrics": "[Intro]\nA: Listen man, not to be rude or anything but uh...What are you? I mean your costume\nB: I'm a body bag. I thought the invitation said come as you are\n\n[Verse 1]\nMy style is gory like an Edgar Allan story\nMonkey’s paw, allegory, fucking raw, category\nEdward Gorey, sorted sorta morbid, chloroform for ‘em\nFuck their foreign forums, I’ll deform 'em with some four-inch forceps\nThere's no distortions, take misfortunes and record 'em\nA borderline personality, plus poor decorum\nPour the poor me, more aurora borealis\nI'm forming calluses from holding grudges more than normal\nGot a smorgasbord, supportive followers and won't ignore 'em\nPortland, Oregon, all the way to Portland, Maine, for the boredom\nI’m going Foreman forming coarsest choruses\nAgoraphobic portions, lived behind my ribs, absorbed and dormant\nFortified a fortress I have lived in since the storm arrived\nLeft ‘em mortified from horror I’ve reported, boarded up\nThe windows and their doors are shut to keep out the vandals\nA four-cornered room and I'm staring at candles\n\n[Hook]\nA reflection I don't recognize, set with deader eyes\nLooking petrified, breath is like a pesticide\nSkeleton and extra-sized flesh of mine to gelatin\nResembling the dead alive, I identify with my enemies\nI don't like me either, I can empathize\nNever mind the effort I have severed to my lesser side\nWeathered all the weather, let the temper rise\n\n[Verse 2]\nEven in the misery, I don’t want the company\nI'm cuddling with ghosts that I know will accompany\nMe to the grave, I made with a spade\nTake me away, shutter-speed suddenly\nUtterly infatuated with the patterns splattered on my atoms\nPast or present lacks a presence when you just don’t give a, fuck you\nMartyr or a carnivore, art of war, Sun-Tzu, Sun-Tzu\nSomeone come undo these hum-drum views I sing and hum drums to\nMy tongue gon’ spew some blood unto these dumbfucks who gon’ run amok\nSo run those jewels, I’m numb and dumb to the gumshoe ones who\nWonder what I been up to, what’s the matter, is that body bag too baggy, boy?\n\n[Bridge]\nSo minimalissimo\nAt least three Gs of the Indica leaf to blow\nIn the pit of my seedy skull\nUntreatable when the sinister creature roams\nTo each his own, since when do you eat your own?\nThey called me precious, and said I'm a piece of gold\nI said they're fools, they don't listen to reason though\nThis blue sunshine hidden between my bones\n\n[Hook]", "album": "ULTRAVIOLET"}], "artist": "Sadistik"}