{"songs": [{"title": "SIRENS | Z1RENZ", "year": "2018-07-26", "album": "TA13OO", "image": "https://images.genius.com/cdb9cdd66b30e65aa86477b6570337c5.1000x1000x1.jpg", "lyrics": "[Chorus: Billie Eilish & Denzel Curry]\nBaby, when you hear the siren sounds\nWhen the karma come back 'round, don’t let me down\nBaby, there's a time to stand your ground\nEven if one of them sounds, don't let me down\n\n[Verse 1: Denzel Curry]\nEyesight is a gateway\nTo a new day and the same hate\nWith a new height and the same feet\nOn a airplane yelling, “Mayday”\nWith a good girl gone bad girl\nWho went gay ’cause of date rape\nThat's a metaphor for the US\n'Cause they got us all in the same state\nState of mind, brain is minimized\nPut me on the news, only criticize\nRevolution will never be televised\nFor the enemy, they never empathize\nAnd I never voted, never sugar coat it\nWith my finger itchin' and my gun loaded\nWhen the fire open, let it be your moment\nWhen I shoot the sheriff if he not demoted, then bang! (Bang, bang, bang)\nThis for Trayvon and Tree\nBurn the bush and chronic, speakin' honestly\nWe livin' in colonies, CNN sit-comedies\nMonstrosity run rampant all throughout United States\nTalkin' about “let's make a fort”\nTalkin’ about “let’s make it great”\nIf the shoes fit, tie it, grab the guns and riot\nTime to run with lions on the road to Zion\nIn this age of violence, time to grab the iron\nWhen I pop the silencer, it's nothing but silence when–\n\n[Chorus: Billie Eilish & Denzel Curry]\nBaby, when you hear the siren sounds\nWhen the karma come back ’round, don't let me down\nBaby, there's a time to stand your ground\nEven if one of them sounds, don't let me down\n\n[Verse 2: J.I.D]\nUh, look, okay\nBa-aby, I’m a fool because I thought you would stay\nWhether I win or I lose, they already think we dead\nBut they continue to shoot, I'm just gon' cover my head\nI need to duck and not move (Yeah) I bust a move when I (Uh)\nFind a way to get on and get up and get out the crib\nI was just looking into the mirror\nTryna dislocate my fear 'cause you broke my heart\nLet me dry my tears\nSo serious, I'm so neglected\nIn the wrong direction with a long erection\nGot no protection but it's fuck the world\nWhen she bend it over, being over-sensitive\nBut did I mention that my real intentions\nAre on me really dealin' with the consequences\nAnd I see your tone is very condescending\nWhen I talk to you, but no you won't admit it\nAnd I pity the fool\nBeen tryna vent, but you ain't tryna hear it\nLike I'm not in here, but you gotta hear it\nJust stop brushing me off to the side (Oh, shit)\nOh say, can you see a hundred dead bodies in the street\nBy the dawn's early light, double Sprite and a R.I.P. tee\nSo proudly, lights gleam, let the gun blaow in the night time\nOf the slum house, little drum bump with the one thousand\nCome-come, here they come\n\n[Chorus: Billie Eilish & Denzel Curry]\nBaby, when you hear the siren sounds\nWhen the karma come back 'round, don't let me down\nBaby, there's a time to stand your ground\nEven if one of them sounds, don't let me down\n\n[Verse 3: Denzel Curry]\nBirds chirpin', dogs barkin', kids missin', milk cartons\nSoul dark as black markets, war is startin', more spartans\nLord, prophet, praise Muhammad\n“Diff'rent Strokes”, Philip Drummond\nGave me crack, like I'm plumbin', Jesus Christ, second comin'\nCut myself, now I'm numbin', never scared, never runnin'\nChosen one, I'm one hunnid, pray for me, pray for London\nGuilty me, he ain't done and gun me down, all for nothin'\nPrecedent in abundance, President is a puppet\nGotta hate it, gotta love it, pass a class, I rise above it\nWise enough, advise the public, pistol bust, screamin' “fuck it”\nDonald Trump, Donald Duck, what the fuck is the difference?\nNow we stuck, in a rut, this ain't what I envisioned\nWhat is what? What is guts when you don't have intuition?\nNot a saint, not a sinner, tell me, what's my real religion?\nGenocide, Genesis, they say it's a new beginnin'\nI'm a sinner, you a sinner, I can see the devil grinnin', damn"}], "artist": "Denzel Curry"}