{"artist": "L’A Capone", "songs": [{"title": "Play For Keeps (100%)", "album": "RN4L (100%)", "year": null, "image": "https://images.genius.com/6369e9d0d4931130c3469d74ce6c4ffe.494x494x1.jpg", "lyrics": "[Verse 1: L'A Capone]\n\nWe play for keeps\nThe whole hood know me\nNo niggas they ain't on the block, making gwop, trynna' feed the team\nGotta' muh' fuckin' dot, no circle\nBig 30 hanging out, no curfew\nOne call, yeah Booka gon' murk you\nSneak diss, man that's gon' hurt you\nOh yeah, we taking shit\nSteady running from the jakes and shit\nWhen we reach the top, we can stop doing this basic shit\nCause I'll ride or die for my niggas\nI'll get crucified for my niggas\nYou'll never see a one-on-one, fuck boy\nThe whole squad gon' get you\nThese niggas so phony though\nThey'll act like ya' homie though\n'Till they see some bands, but it ain't ya' mans, he just bail like Romeo\nAnd I'm still by the corner store\nFuck all this rapping bro\nMight think it's a concert, and get beyond hurt, cause we clapping hoe\nNow roll that dope shit\nOn the block we smoking shit\nAnd niggas die cause the cops come quicker than a muh' fuckin' doctor, shit!\nIt's one thing I never did, and that's love a bitch\nCause I'm drilling shit, I only love my clique\nMy OG told me slow down\nSee a opp then he get blowed down\nTake him down, then smoke his whole pound\nAw, they deep, huh? Empty the round\nGet caught and I won't make a sound\nBut it's dead cause I'm shooting out of town\nWe sell green, white, but no brown\nI'm finna' bust a sell right now\nThese niggas ain't really in the field\nLil' Folks going in for the kill\nLate night, trynna' creep with the steel\nShondale, how that hot shit feel?\nAnd I love when I'm off that pill\nCan't change, boy I'm too real\nThey say real niggas don't say they real, well fuck nigga I'm real\nAnd if he can't break bread he fake\nI had one more buck on my plate\nIt was me and bro, we was in the store\nAnd both of us got fifty centy cakes\nA bitch can't tell me she's late\nThe condoms I use don't break\nWe at the starting point of this race shit\nWe gonna' win, nigga I can't wait!\n\n[Transition: RondoNumbaNine]\n\nTaking off, let's get it!\nL'A, what up bro?\nL'A Capone in the cut\nL'A Capone fuck 'em up!\n\n[Verse 2: RondoNumbaNine]\n\nRondo'll gamble with ya' soul\nGDK, fuck a Brick, get exposed\nIn the hood strapped up, bunch of poles\nJakes snatch me up and you know I can't fold\nSix Hunnid, free my nigga D. Rose\nAll these hoes kinda' getting too old\nI ain't playing no lovers games with them lover gangs, niggas getting smoked\nYeah it's a lotta' shooters on my squad\nYeah it's a lotta' shooters on my squad\nAnd if he holding on that work he getting robbed\nTec on my neck, I don't need no bodyguard\nThese niggas be crazy!\nThese niggas don't tote!\nThese niggas think it's a joke, let me see a opp, I'mma blow!\nSee a lotta' niggas say I changed\nCause Rondo done made a lil' change\nI still claim the set I claim\nAnd I ain't going trynna' take my chain\nD Block, free my nigga M Thang!\nSteve Drive, that's my campaign\nAnd I will never switch, that just don't exist\nCause that's blood on my name\nYeah I'm a shooter, bitch\nTay Six Hunnid up them Rugers quick\nDead beat pops, got raised by the block\nI was trynna' make it flip\nHe was probably wit' his moms\nHe was probably on the porch\nSince a youngin', bitch I been that nigga\nI was blowing the torch\nYou-you know how I rock, nigga\nThey-they know how I rock, nigga\nCdai got 22 shots, nigga\nAdd 8 more, that's a mop, nigga\nNiggas do all that talk\nMy niggas come from that code\nRock a opp, they could take that loss\nSix Hunnid, bitch Rondo the boss!\n\n[Outro: RondoNumbaNine]\n\nLet's get it!\nLet's get it!\nBang!\nA lotta' shooters\nFree D. Rose, he fuck 'em up!"}]}