{"songs": [{"image": "https://images.genius.com/3407e464b90665cb8b7267df3541d089.500x500x1.jpg", "title": "Ghetto (Remix)", "album": "The Nigger Tape", "year": "2008-06-09", "lyrics": "[Intro: Sample]\nForget the terrorist alerts, we need some ghetto alerts\nInformation we could use, you know:\n“Ray-Ray’s on parole, stay off the streets”\nInvasion!\nThe Evil Genius\nGreen Lantern!\n\n[Chorus]\n(Ghetto!) “The same shit is going on”\n“The crackheads stalking, loudmouths is talking”\n(Ghetto!) “The same shit is going on”\n“So you know I seen it all before”\n(Ghetto!) “The same shit is going on”\n“The crackheads stalking, loudmouths is talking”\n(Ghetto!) “The same shit is going on”\n“So you know I seen it all before”\n\n[Verse 1: Nas]\nIt's cool to love to win but it's better to hate to lose\nThere's only one Nas, 'bout a hundred thousand yous\nYou lose money chasing women\nNever lose women chasing money\nNiggas is broke plus the wolves is hungry\nMorgues full of dead niggas who was taking money\nMorgues full of niggas who the last shit they ate in they stomach\nSpinach and steak, GORE-TEX boot print still on his face\nIt’s still on his face when we visit his wake\nWhatever's undone, I'd do it\nFight against a whole army, one gun I'll use it\nSome Sun Tzu shit (Green Lantern)\nCreeping on ya like walking pneumonia\nYou're far from opponents; we could spar for the moments\nI stay in deceitful conversations\nWith creeps with foul natures\nAttempted murders trials, the basics\nThreatening the witnesses\nAnd relatives of dead victims, it’s the shit we live\n(Ghetto!) Queensbridge thug matrimony, clap a phony\nBullets even hit a cracker in his Abercrombie\nPsychoanalyst was asking me what happened to me?\nSee the 'gnac got to me, then the gat got to me\nThen, the homies on the block with the stacks of money\nThen, these beautiful bitches was bending backwards for me\nThen, lames put the rap game in a casket slowly\nMan, I don't give a fuck, this is rap to me\n\n[Chorus:]\n(Ghetto!) “The same shit is going on”\n“The crackheads stalking, loudmouths is talking”\n(Ghetto!) “The same shit is going on”\n“So you know I seen it all before”\n(Ghetto!) “The same shit is going on”\n“The crackheads stalking, loudmouths is talking”\n(Ghetto!) “The same shit is going on”\n“So you know I seen it all before”\n\n[Interlude: DJ Green Lantern & Joell Ortiz]\nYo, Joell Ortiz, man, go in! (Yaowa!)\nYo, Green, let’s take ‘em on a ride through the ghetto!\n\n[Verse 2: Joell Ortiz]\nPlanet Earth (Yaowa), the land of the worst, handle ya turf\nCannons’ll burst and break the wrists of amateur jerks (Huh!)\nDamn, it’ll hurt to know your man in that hearse\nI seen it ten times (For real)\nThey get a small article, never the headlines (Damn)\nCandles in the lobby next to empty ‘gnac bottles\nNiggas drunk, talking shit\nLike, “When they see this Mac nozzle,” but (What?)\nNothing ever happens\nEven if it do, nothing ever happens (Nah!)\nWe don’t talk and that ain’t gutter if you yapping\nIn the ghetto (Woo!), you could ask a nigga mother what happened and get a echo\nWhere I’m from, it’s so bad (Bad)\nBunch of ignorant motherfuckers with no dads\nOr he there but he don’t care\n'Cause he nursing his dope hab’ (For real)\nAnd when him and they moms argue, he always throw jabs\nSo they grip a chrome mag\nAnd walk around like “Who want a toe-tag?” (What up?)\nFiending to leave a head see-through like a coat bag\nIf your life slightly something like the one that Joe had\nThen you... (Ghetto!)\nGroup of Ps, scoop cheese, duck Ds, and squeeze (C’mon)\nBreeze in old hoopties bumping new Ortiz (Ah!)\nAnd the hoochies please Gs by getting on they knees\nGiving the body part what Scarecrow needs (Haha!)\nI’m living my life, the shit that I write is from my heart, my word\nSo go in your pocket, grab a Sharpie, homie, mark my words\nIf anybody interfere with me and these bucks\nI ain’t only ending careers, dog, I’m beating you up\nI’m still ghetto!\n\n[Chorus:]\n(Ghetto!) “The same shit is going on”\n“The crackheads stalking, loudmouths is talking”\n(Ghetto!) “The same shit is going on”\n“So you know I seen it all before”\n(Ghetto!) “The same shit is going on”\n“The crackheads stalking, loudmouths is talking”\n(Ghetto!) “The same shit is going on”\n“So you know I seen it all before”"}], "artist": "Nas"}