{"songs": [{"image": "https://images.genius.com/5735f357bf630e06a450f1aebacee90b.968x968x1.jpg", "year": "1999-01-01", "lyrics": "Akrobatik - “Militant Raw”\n[Emcee(s): Akrobatik]\n[Producer(s): Akrobatik]\n[Additional Vocals: Mr. Lif]\n[Scratches: DJ Sense]\n[Sample 1: Richard Hayman - \"Theme From the Killing of Sister George\"]\n[Sample 2: Big Daddy Kane - “Raw”]\n[Sample 3: O.C. - “No Main Topic\"]\n\n[Intro (Overlapped with Bridge 1): Akrobatik and Mr. Lif]\nMr. Lif: Weapons Lif to Akrobatik, over.  Here’s the command for us to land.  Listen, the tanks at the brinks.  Take your vocals to the air to start up a bomb scare.  You clear?  I’m out of here\nAkrobatik: No need to worry, Lif.  I got everything under control\n\n[Bridge 1 (Overlapped with Intro): Akrobatik] (x7)\n(Skills) 2, 3, 4\n\n[Verse 1: Akrobatik]\nYo, yo, yo, yo\nWhether Army, Navy, Air Force, or Marines, your whole\nArmed forces couldn't stop this one-man team.  You can't\nDetect the effect of what my words'll do to ya\nThe effect of my text is similar to thermonuclear\nWar.  This style is type militant raw, holding\nThe audience prisoner in ways you never saw\nI’ll run through your whole outfit without flaw\nThe outlaw, type of kid you're proud to shout for\nIt's funny how the good guy now becomes the villain\nMoney has become God and all squads are illing.  I'm\nA hundred-and-two years old at the tricentennial, chilling\nIf not, an intricate plot will be my feeling\nRough, rugged, raw still values I'm instilling\nAnd, until then, hoping to lower the rate of killing\nYears from my demise, you will see that my plan is still in\nImplementation—it'll come in the form of activists\nSent to fix nations.  For now, listen to Ak’ and just\nRepresent your station, spot, domain, or lo-\n-cation, but understand we from the same rotation\nGood versus Evil—both nations at war\nThis style is type militant raw (Raw, raw, raw)\n\n[Interlude 1: Mr. Lif]\nAight, fuck that.  It’s time to bring in the heavy artillery\n\n[Hook: Samples with Scratches by DJ Sense]\n“R-A-W” - Sample from Big Daddy Kane - “Raw”\n“Flip the word around, now ‘raw’ spells ‘war’” - Sample from O.C. - “No Main Topic”\n“R-A-W” - Sample from Big Daddy Kane - “Raw”\n“Flip the word around, now ‘raw’ spells ‘war’” - Sample from O.C. - “No Main Topic”\n“R-A-W” - Sample from Big Daddy Kane - “Raw”\n\n[Verse 2: Akrobatik]\nYo, this is\nThe illest war recorded—from Glory to Soldier Story\nOrganizing a regime to leave your team gory.  They can't\nHack it, so I'm strapping on my Full Metal Jacket so as\nTo bomb the population in the upper tax bracket\nSo we can uplift these inner-city sanctions\nAnd once my message cranks in, bring the tanks in\nAnd then I'm bombing from an aircraft carrier\nFinal Fantasy Tactics back to Space Harrier\nIn other words, new schools are old.  Check my smart bomb\nOr check my triple-W-dot-Akrobatik-dot-com\nAnd check my plan of attack for world dominance\nIt ain’t no over-the-top, hate shit.  Just common sense\nI'm intense beyond your definition\nBlow a million heads up without no ammunition\nOr pistol.  Just this New England Patriot missile\nTo explode your frame, leaving no remains but your gristle\nI get respect, 21-gun salute\nGot many rhyme philosophies but none pollute\nThe brain.  I spiritually massage you to the core\nThis style is type militant raw (Raw, raw, raw)\n\n[Hook: Samples with Scratches by DJ Sense]\n“R-A-W” - Sample from Big Daddy Kane - “Raw”\n“Flip the word around, now ‘raw’ spells ‘war’” - Sample from O.C. - “No Main Topic”\n“R-A-W” - Sample from Big Daddy Kane - “Raw”\n“Flip the word around, now ‘raw’ spells ‘war’” - Sample from O.C. - “No Main Topic”\n“R-A-W” - Sample from Big Daddy Kane - “Raw”", "title": "Militant Raw (Clean)", "album": "SayYesSayWord / Militant Raw & Live"}], "artist": "Akrobatik"}