{"songs": [{"lyrics": "[Intro]\nYeah, fucking throw up on the floor, shit\nGet the cleaning lady\nMy bad! Hey yo!\n\n[Verse 1]\nIn only one year, considered as a veteran\nTop of the line, the whip look like tropical lime\nOff the boat, cousin, Glock by the spine\nDo a murder seven thirty, then they flying at nine\nShit!\nHandspring half twist into the Buick\nYou say you’re doing shit but never do it\nI say I’m doing shit and then I do it\nNever going back to work in labor\nFuck that your little chain, you better tuck that\nUh, vultures flying over the carcass\nBitches blowing on my dick like a cartridge\nThrow some grass up, aim a little east of the target\nMy brain was sculpted at Harvard\nNever mention all the crime I been a part of\nServe like Ivan Lendl up in the rental\nThe cheese been assembled\nThey receiving health benefits and dental\nThe lamb was laced with fennel\nLeft hand then shift the right foot touched the pedal!\n\n[Hook]\nFrom now on I'm just the symbol\nHundred dollar drugs smoke out the window\nPaper plates, I never had a license\nCould always catch me smoking spices\nTriple lindy out the Jeep, land into a split\nGet up in the spin, doggie, I’m the shit!\nYou’re staying broke, like Maury with the hip\nHuh, catch me on Maury with my bitch\nFuck with me!\n\n[Verse 2]\nThe whip gymnast\nJump out the car into the river\nDon't splash on the dive\nStraightforward money, cash on the side\nIf you catch him I want that bastard alive\nMy bitch's ass is like an apple\nYou bitches see me look astonished\nYour boy is ill with the phonics\nSince Gary Payton had the pill for the Sonics\nYou’re still a novice\nAnd to be brutally honest, your shit is garbage!\nDog, I've been a scholar\nMy shoes are still alive from Lake Victoria\nFuck the order up, leave you stretched in the corridor\nI got my aura up, hoes that drive me in foreign truck (dykes)\nOne is riding me, the other one is rolling up (weed)\nPray to science they don’t pull me over\nIf they do, then the fun is over\nWhether young or older, motherfucker's been a musket holder\nJust sprinkle cheese on top of me, and let it get crusted over!\n\n[Hook]\n\nFuck with me! (repeated throughout)", "title": "The Symbol", "album": "Rare Chandeliers ", "image": "https://images.rapgenius.com/2b061b2a769a44c69d40c8e3af976aa0.1000x1000x1.jpg", "year": "2012-10-22"}], "artist": "Action Bronson"}