{"songs": [{"lyrics": "[Produced by Just Blaze]\n\n[Jay-Z]\nThis is a public service announcement\nSponsored by Just Blaze and the good folks at Roc-A-Fella Records\n\n[Just Blaze]\nFellow Americans, it is with the utmost pride and sincerity that I present this recording as a living testament and recollection of history in the making during our generation\n\n[Verse 1: Jay-Z]\nAllow me to re-introduce myself\nMy name is Hov, OH, H-to-the-O-V\nI used to move snowflakes by the O-Z\nI guess even back then you can call me\nCEO of the R-O-C, Hov!\nFresh out the fryin' pan into the fire\nI be the music biz number one supplier\nFlyer than a piece of paper bearin' my name\nGot the hottest chick in the game wearin' my chain, that's right\nHov, OH—not D.O.C\nBut similar to them letters, \"No One Can Do it Better\"\nI check cheddar like a food inspector\nMy homey Strict told me, \"Dude finish your breakfast\"\nSo that's what I'ma do, take you back to the dude\nWith the Lexus, fast-forward the jewels and the necklace\nLet me tell you dudes what I do to protect this\nI shoot at you actors like movie directors (*laughing*)\nThis ain't a movie, dog (oh shit)\n\n[Interlude: Just Blaze]\nNow before I finish, let me just say I did not come here to show out, did not come here to impress you. Because to tell you the truth when I leave here I'm GONE!\nAnd I don't care WHAT you think about me—but just remember, when it hits the fan, brother, whether it's next year, ten years, twenty years from now, you'll never be able to say that these brothers lied to you JACK!\n\n[Verse 2: Jay-Z]\nVing ain't lie\nI done came through the block in everything that's fly\nI'm like Che Guevara with bling on, I'm complex\nI never claimed to have wings on\nNigga, I get my \"by any means\" on whenever there's a drought\nGet your umbrellas out because that's when I brainstorm\nYou can blame Shawn, but I ain't invent the game\nI just rolled the dice, trying to get some change\nAnd I'd do it twice, ain't no sense in me\nLying as if I am a different man\nAnd I could blame my environment but\nThere ain't no reason why I be buying expensive chains\nHope you don't think users are the only abusers\nNiggas getting high within the game\nIf you do then, how would you explain?\nI'm ten years removed, still the vibe is in my veins\nI got a hustler spirit, nigga, period\nCheck out my hat yo, peep the way I wear it\nCheck out my swag' yo, I walk like a ballplayer\nNo matter where you go, you are what you are player\nAnd you can try to change but that's just the top layer\nMan, you was who you was 'fore you got here\nOnly God can judge me, so I'm gone\nEither love me, or leave me alone\n\nNow, back to our regularly scheduled program, L'Album Noir: The Black Album", "title": "Public Service Announcement", "image": "https://images.rapgenius.com/db98dd9c59a51c9b6b76f6d6a32cac9f.991x1000x1.jpg", "year": "2003-11-14", "album": "The Black Album"}], "artist": "JAY-Z"}