{"artist": "Philthy Rich", "songs": [{"album": "Fake Love (Deluxe Version)", "title": "Interlude M.A.C #2", "image": "https://images.genius.com/4b47b68360dac3b50315c2d634ecaf4b.939x939x1.jpg", "lyrics": "[Skit: M.A.C. Blast]\nMan, this fake love shit out here\n(Fake love, man)\nYou fuck with a nigga, you fuck with a nigga\nYou love a nigga, you love a nigga\nYou rock with a nigga, you rock with a nigga\n(Rock with a nigga, mayne, for real)\nShit gotta be real but at the same time\nWhen I show you that I got love for you, nigga\n(Yeah, love a nigga, man)\nThen nigga, you gotta love a nigga back, nigga\nDon't be formin' no ignorance, either, nigga\nYou gotta love the game, nigga, love it\nLove these streets and gotta stick to the same business\n(Love the culture)\nKnow what I'm sayin'?\n(Funk Or Die, Funk Or Die)\nI be talkin' to bruh, he like\n\"Niggas and bitches always talkin' 'bout\"\n'I remember niggas ridin' the bus' or\n(Talkin' too much)\n'Man, he was just ridin' the baby 'stang'\n(Bitch, you remember too much, bitch)\nNigga, okay, bitch\nWhen you seen him on the bus, you was on the bus too, nigga\nEverybody done rode the bus before, nigga\nGod damn\nEven Fee used to be on the back of the bus, bitch\nYou feel what I'm sayin'?\nYou actin' like a nigga was eighteen, nineteen on the back of the bus, mayne\nYou talkin' 'bout middle school, bitch\nWhat the fuck is you bringin' that up for?\n(Bitches be weird)\nKnow what I'm sayin'? God damn\nDo that nigga say, know what I'm sayin'\n\"Oh, I remember you, when you was wearin' ripper slippers and you used to be scared of dick\"?\n(Ripper slippers)\nNah, nigga, nigga see you like\n(Scared of dick, bitch)\n\"Okay, how you doin'?\"\n\"You doin' what the fuck you gotta do\", man\nThat's like\nSay for instance\nYou got you a little house\nYou got a little Benz truck, you know what I'm sayin'?\n(Yeah, yeah)\nEvery time you see your motherfuckin' big cousin\n(Yeah)\nHe say some stupid-ass shit like\n\"Man, you got a Benz truck, now?\"\n\"Man, I remember you used to piss in the bed\"\n(Duh)\nGod damn, everyone used to piss in the bed\n(You used to piss in the bed, too, nigga)\nGod, shit\nHow many times you gon' bring that shit up?\n(Weird-ass nigga)\nThese niggas crazy, man\nAlways talkin' some crazy shit about anyone they see successful\nYou got niggas always talkin' 'bout\n\"Oh, he ain't gettin' that off rap money\"\n\"He gettin' that off pimpin'\"\n(Pimpin')\nYou know what I'm sayin'? You got niggas talkin' 'bout\n\"He ain't get that off pimpin', he gettin' that off rappin'\"\n(He gettin' it off rappin')\nNigga, do it matter?\nIf it's rappin' or pimpin', nigga?\nSalute the hustle, dog\nA young black man turned a probation condition\nA fuckin' stayaway\n(You feel me?)\nInto a success story\nPeriod\n(Man)\nMan, I remember I used to go through that same, stupid-ass shit, nigga\n(Man, I remember I used to go through some shit back in the day)\nKnow what I'm sayin'?\nBack when I started bein' a big-head scientist, nigga, you feel what I'm sayin'?\nWhen you saucy everyday, everyday, man\nIt's nothin'\nDon't nobody say you saucy 'cause that's normal, know what I'm sayin'?\n(Right, right)\nYou a dirty little nigga\nNigga do halfway-fit, motherfuckers say you saucy\n(When you wearin' white tee shirts, 'Oh you saucy')\nSo I got my third child on the way, nigga\nI wore a snow suit for eight months, I'm just stackin'\nKnow what I'm sayin'?\nOn my birthday, nigga, you feel what I'm sayin'\nI cut my hair, cut my face, you know what I'm sayin'?\n(That's saucy?)\nPut the Acorn chain, get the Rolly, feel what I'm sayin'?\n(Know what I'm sayin'? It's my b-day, nigga, I'm supposed to)\nDo the birthday shit, right?\nSome zips goin' for like five-fifty\n(Five-fifty)\nMy nigga Bam ain't got none his turn nigga, but mayne down four seventy-five\n(Four seventy-five all day)\n\"Oh, man, I ain't buyin' no zips from them, nigga\"\n(Why, nigga?)\n\"You know what I'm sayin'? That nigga ain't no real nigga\"\n(I ain't a real nigga?)\n\"He got a settlement 'cause his mama died\"\n(I ain't a real nigga 'cause my mama gave me some money?)\n\"You know what I'm sayin'? I don't buy weed from niggas like that\"\nBruh, say what?\nNigga, I know the nigga mama, nigga, nigga mama ain't dead\n(My mama wasn't even dead)\n\"Oh nigga, that nigga just turned twenty-one, you feel what I'm sayin'?\"\n\"He got whipped by a security guard when he was little\"\n(Never got whooped by security, no time)\nNo time\nNigga, know what I'm sayin'?\nNigga just kept hatin' on a nigga\n'Cause, nigga, I'm a settlement baller, nigga?\nOr I'ma overnight success?\nNo time, nigga\nAlready had the seven-deuce Mally\nAnd the candy-orange six-eight 'Stang, nigga\nHood old school Nova, nigga\nThe candy 5.0\nAnd got a seven-one Caddy, nigga\nTwo RX-7s, nigga, and a Honda, nigga\nYou know what I'm sayin'?\nI was just puttin' that shit up, bein' a big-head scientist, nigga\nJust on some stackin' shit, nigga\n(But)\nBut it don't even matter, nigga, if I was a settlement baller, nigga\n(It don't matter)\nYou'd rather pay five fifty then four seventy-five\nJust because the way I got my money?\n(Haa)\nStupid\nNiggas be on some weird ass shit\nNow I ain't knockin' niggas, right?\n(Yeah)\nWhen nigga be like\n\"Bruh, I just seen Philthy in 2010\"\n(Exactly)\n\"Bruh was in Sac, nigga, sellin' hella weed\"\n\"I ain't seen a nigga bubble so fast, nigga\"\n\"That nigga, man, that nigga went on one\"\n(I ain't never seen a nigga bubble so fast)\n\"For real, like the last four years, nigga, it's money out there to get and I salute the nigga\"\n(Yeah)\nNigga I know that, that ain't really hatin'\n(That ain't really nothin')\nBut all them niggas that wanna keep talkin' bout tall tee bullshit\nMan, knock it off\n(Knock it off, bruh)\nIt ain't no red bottom store in Oakland, folks\n(No where)\nNiggas be travelin', seein' shit, fuckin' with different niggas\n(Exactly, mind be openin')\nNiggas mind be openin' to new lives, expandin', you know what I'm sayin'?\nSo it's gon' come out in his raps, man\n(Fa sho, it's supposed to)\nNigga s'posed to be talkin' 'bout\n(He be gettin' money)\nDoin' licks and slidin' on niggas, that ain't how a nigga livin', bro\nYou feel I'm sayin'?\n(Backin' up quarter ounces all day)\nKnow what I'm sayin', nigga?\nYou want a nigga standin' on Seminary and Fortune\nIn a motherfuckin' Wraith sellin' weight like it's '83\n(No time)\nMan, come on, bruh\nThey got Snapchat live\nIG live and all hella shit, nigga, know what I'm sayin'?\nYou gotta have love for the motherfuckin' game before the shoulders that we stand on, nigga\n(Fa sho, nigga)\nSome fool nigga paid the price way back in the day, nigga\n(Yeah, that's right)\nWhen that nigga load his firearm, nigga, with no gloves on\n(Exactly)\nNow everybody and they mama know, nigga, not to do that, nigga\nReal niggas make sacrifices so real niggas can learn from 'em, nigga\n(Fa sho)\nYou weird-ass niggas gotta get with the program, nigga\n(Man)\nLove the culture, nigga\n(Exactly)\nLove the moves that niggas make from your city, nigga\n(Man, I love the town, nigga)\nFeel what I'm sayin'?\nAnd always, instead of knockin' a nigga all the time, nigga\nStop with the fake love, nigga\n(Fa sho)\nThe Bay could be like the new Atlanta, nigga\n(On everythang, mayne)\nWithout peach tree, nigga\n(Fuck peach tree)\nNiggas know what I mean without peach tree, haha\n(Peach tree, north peach tree, city of peach tree)\nAnd that's from the nigga that look like me\nGet on his knees and wanna marry a nigga that look like 'em\n(Fa sho, mayne)\nI'm like, \"Lord, have mercy\"\nI don't know what's wrong with me\nI don't know why I feel like I wanna beat both them niggas ass\nNigga I don't give a fuck\nI'm just fuckin' off this shit, man\nI don't give a fuck how much love you got for a nigga\nNigga, you ain't gotta marry that nigga\nMan, you just love a nigga\nSee, I love a lot of black men\nI love the way black men look, nigga\nSix-packs in they own zone\nNigga I don't get the feelings of sexual feelings\nI don't wanna do nothin' with 'em, nigga\nWeird-ass nigga\nYeah, that's real love for myself, nigga, real love for the game\nAnd I know nigga\nAnd my dick don't- I ain't even fucked a bitch in the ass, nigga\n(Yeah)\nI know where my dick go, nigga\nI ain't gon' fuck with no nigga\nWeird-ass nigga\nBut, nah, man, y'all niggas gotta salute real love, bruh\n(Funk Or Die, nigga, gay-ass niggas)\nMan, my bruh be doin' his thang, man\nNiggas gettin' they chain, gettin' they watches, nigga, it's good, man\n(Salute my nigga Philthy, man)\nStop talkin' 'bout all that other bullshit, nigga\nWe all been broke before, nigga\n(Come on, man)\nWe all come from the gutter, mayne\n(Get behind a nigga)\nWe all doin' what we do\n(I wanna see the nigga be Jay-Z, nigga)\nY'all know what it is, man\n(Let's get it, nigga)\nYou know what I'm sayin'\nYou niggas gotta Funk Or Die, mayne\n(Make way for real niggas)\nThat's the language, gas all day\n(All motherfuckin' day, nigga)\n(I want the nigga to pave the way for real niggas, mayne)\n(You know, Oakland niggas get blackballed, nigga)\n(We get up in that motherfucker, niggas know what it is, mayne)\n('Cause, y'am sayin', 'cause niggas gon' do what the fuck they gon' do, man)\n(Like I said though, man)\n(It's Funk Or Die, man)\n(I fuck with my Sem-City niggas, man)\n(Free my little brother, nigga, B-O-T, nigga)\n(Know what I'm sayin', little Mall, nigga, Hyph, nigga)\n(Love you niggas, nigga)\nGas", "year": "2018-12-07"}]}