{"artist": "Peewee Longway", "songs": [{"album": "The Blue M&M Vol 2 King Size", "title": "Good Crack", "image": "https://images.rapgenius.com/198b7ef98a37d893e2f7e5597128c805.740x740x1.jpg", "lyrics": "(Hook)\nFucked up nigga gotta get back\nTake it to the pot with cooked crack\nWhen I hit it from the back, she gon look back\nShe tell me my dick like cooked crack\nEverywhere I go, I got good crack\nSwagger to dope bitch she eat it up\nCook up the crack watch'em eat it up\nTrap in the spot till the lease up\n\n(Verse 1)\nStars on my ankle, givenchy my feet up\nPlug and the socket they call me the ruler\nI got the formula, dope Costa Rica\nI'm not going back and forth with your people\nI keep the cocaine, like my nigga Gotti\nI still be trapping out brand new bugatti\nThey call my kitchen been a trapper hibachi\nI keep the hot pot, stretching out me a nazi\nOG gas bags coming in boxes\nOvernight pack from the west coast\nI don't fuck that bit with a bankroll(?)\nEverybody get ghost when the bank gone\nIn the ass, or the rate, one to the dome?\nEverywhere I'm going like good crack\nWhen I hit it from the back she gon look back\nTold me my dick like good crack\nFuck her from the back then repeat her\nChanel on feet, double c, c\nEuropean dabbin, nigga can't get these\nJumping out the Ross looking like two bricks\nYour bitch eat it up she need(?) a toothpick\nBlue Benjamin's on me the longway\nWhen I hit it from the back, bitch look back back....\nDick like COCAINE!\n\n(Hook )\nFucked up nigga gotta get back\nTake it to the pot with cooked crack\nWhen I hit it from the back, she gon look back\nShe tell me my dick like cooked crack\nEverywhere I go, I got good crack\nSwagger to dope bitch she eat it up\nCook up the crack watch'em eat it up\nTrap in the spot till the lease up. (2x)\n\n(Verse 2)\nFucked up nigga trying to bounce back\nAll my niggas got a dub sac\nAll my nigga smoke loud packS\nAnd all my niggas got anthrax\nAll my whips got snap backs and all my shit on offsets\nNon of hoes got asshsots and they say that Dick like cooked crack\nBoy I came along way when I looked back\nGot to thank God I got jugged back\nHalf a million dollars in the book bag\n2, 3 stoves where I cook at\nWhere I been a hunnid\nTrap like been a hunnid\nI been pulling up in a rari like beep beep\nCome in like the road runner\nF15,  now your shit back\nAll in your crib with the brick set\nIn the kitchen with the work, when I mix it with the soda and it jump back over that's a \"get back.\"\nWhen I walk up in the club I don't look back\nMillion dollars nigga off of cooked crack\nLame ass niggas won't flex that\nWhen I get through, when I give your bitch back\n\n(Hook)\nFucked up nigga gotta get back\nTake it to the pot with cooked crack\nWhen I hit it from the back, she gon look back\nShe tell me my dick like cooked crack\nEverywhere I go, I got good crack\nSwagger to dope bitch she eat it up\nCook up the crack watch 'em eat it up\nTrap in the spot till the lease up. (2x)", "year": "2015-02-21"}]}