{"artist": "Ice Cube", "songs": [{"title": "Jackin’ For Beats", "lyrics": "[Intro]\nWait a minute, hold on, get your ass up\nWhassup nigga?\nGet over there... shit\nYa lil punk ass nigga\nC'mere, c'mere, c'mere boy\nGod damnit you stop that shit now\nTake him to jail and get him the hell from in front of this house\nNow wait a minute, wait a minute, hey man\nWhassup?\nWait a minute?\nThere are police, go!\n\n[Verse 1]\nGive me that beat, fool, it's a full time jack move\nChilly Chill, yo homie make the track move\nAnd I'll jack any Tom, Dick and Hank\nThat's the name of the SUCKERS I done ganked\nI get away from a copper\nDrop a dime, I'll break you off somethin proper\nWith the L-E-N-C-H-M-O-B\nT-Bone and that's J-Dee\nAnd here's how we'll greet ya\nStop fool, come off that beat ya\nFeel dumb cause you're caught in the dark\n(ya lil nuttin ass mark)\nRaise up, cause you can't' have it back\nYou said - \"I ain't never got gaffled like that\"\nOff the end of the gat you choke\nShort Dog's in the house - \"Whattup loc?\"\nNuttin but a come up\nGimme that bass, and don't try to run up\nCause you'll get banked somethin sweet\nIce Cube and Da Lench Mob, is jackin for beats\n\n[Verse 2]\nHuh, and even if you're down with my crew\n*Yo Chuck man, I don't understand this man\nYou got to slow down*\nI jack them too\nAnd then we'll freak it\nKick that bass, and look what we did\nFade the grade, played, and made a few mil\nAnd I keep stealin\nIce Cube'll make it thump\nBut right about now - *let's get over the hump*\nBut I don't party and shake my butt\nI leave that to the brothers with the funny haircuts\nAnd it'll drive you nuts\nSteal your beat, and give it that gangsta touch\nLike jackin and mackin\nSay hi to the three fifty-seven I'm packin\nAnd it sounds so sweet\nIce Cube and Da Lench Mob, is jackin for beats\n\n[Verse 3]\nIce Cube, will take a funky beat and reshape it\nLocate a dope break, and then I break it\nAnd give it that gangsta lean\nDead in your face as I turn up the bass\nI make punk suckers run and duck because\nI don't try to hide cause you know that I love to\nJack a fool for his beat and then I'm outtie\nSo when I come to your town don't crowd me\nCause I know, you're gonna wanna kick it with me\nBut I know, none of y'all can get with me\nSo you think you're protected\nWell you are til you put a funky beat on a record\nThen I have to show and prove and use your groove\nCause suckers can't fade the Cube\nAnd if I jack you and you keep comin\nI'll have you marks a 100 Miles and Running!\n\n*stop stop stop stop stop!\nSa-prize, niggas*", "image": "https://images.genius.com/6c223fafae72a06b4952ce4b3f7e6b7a.992x991x1.jpg", "album": "Kill at Will EP", "year": "1990-12-18"}]}