{"songs": [{"album": "Growing Pains", "year": null, "title": "Held It Down", "image": "https://images.genius.com/7e85622bc62e8bfa09b3556f1fc80f0c.540x540x1.jpg", "lyrics": "[Hook: Ron Kenoly Jr.]\nYou say you trust me\nBut I always see you worry\nHaven't I held it down\nHeld it down at your back\nGot your back\nYou say you trust me\nBut I always see you worry\nHaven't I held it down\nHeld it down at your back\nGot your back\n\n[Verse 1: Json]\nUh loving you has never been an issue for me\nLooking back, never thought I would see these issues coming\nNo, and though that love hasn't change any\nI no longer see my cup half full but half empty\nKnow what happens to a man when a woman that he's feeling isn't with him\nAnd is not cracking with his plans\nAnd I know when it's rocky now but calm down\nThe truth is I always have held a job down\nI understand that you worry but I do need you to be my help-meet and just allow me to lead you\nAnd since the baby, the new addition is fanning flames\nBut everybody has sunny days\nWill we stand the rain?\nI know we will, I have your back and I give you my last\nBut it's a plus, we see as grace instead of the bad\nAnd I often sit and wonder what happened to us\nAnd after wondering I think what we're lacking is trust\n\n[Hook: Ron Kenoly Jr.]\nYou say you trust me\nBut I always see you worry\nHaven't I held it down\nHeld it down at your back\nGot your back\nYou say you trust me\nBut I always see you worry\nHaven't I held it down\nHeld it down at your back\nGot your back\n\n[Verse 2: Butta P]\nUh, loving you 's never been an issue for me\nI'm looking back, never thought I would see these issues coming\nUh and though that love hasn't change any\nI no longer see my cup half full but half empty\nI feel underappreciated and right at the core\nIt's like my role isn't as important compared to yours\nAnd you say I'm doing nothing but be real now\nI'm always at the crib just holding the house and kids down\nAnd I don't mind it being rocky would you please see?\nI just need you explaining things as you lead me\nThis is postpartum depression I'm not wilin' out\nYou know I'd be right behind you baby without a doubt\nI know we'll make it but I need you to know that I'm here\nAnd I ain't giving up 'cause I shed a couple of tears\nBut I often sit and wonder what happened to us\nAnd after wondering I think what we're lacking is trust\n\n[Hook: Ron Kenoly Jr.]\nYou say you trust me\nBut I always see you worry\nHaven't I held it down\nHeld it down at your back\nGot your back\nYou say you trust me\nBut I always see you worry\nHaven't I held it down\nHeld it down at your back\nGot your back\n\n[Verse 3: Json]\nUh I am love so loving you ain't a issue for me\nLook at my son and point out a better picture to me\nYou know my heart but I can show you it real simply\nAll you must do is look at the tomb still empty\nYou have faith in me to save and embrace you as heirs\nBut where's your faith in me in all of your daily affairs?\nAnd I'm knowing you having a rocky time now\nBut I'm the sovereign God who speaks and waves calm down\nSo why not trust in me? In fact I deserve it\nSee there's a purpose 'cause your faith in me 's a act of worship\nSo be anxious for nothing and cast only you weary\nMy hope is easy 'cause your burden I'm willing to carry\nConsider the grass here today and then mown down\nThe cove down so you are most certainly hove down\nAnd I never need to wonder what happens with us\nI know it all so I know what you lacking is trust\n\n[Hook: Ron Kenoly Jr.]\nYou say you trust me\nBut I always see you worry\nHaven't I held it down\nHeld it down at your back\nGot your back\nYou say you trust me\nBut I always see you worry\nHaven't I held it down\nHeld it down at your back\nGot your back\nGot your back\nGot your back\nGot your back"}], "artist": "Json"}