{"artist": "Gangsta Boo", "songs": [{"title": "Meet The Devil", "album": "Candy, Diamonds & Pills ", "year": null, "image": "https://images.genius.com/7778af2d0fab2792317e80b29035525e.500x500x1.jpg", "lyrics": "Yeah, muhfuckas be talkin' that shit\nTalkin' bout why I leave Da Mafia 6ix\nIs Boo in Triple Six?\nNigga, I AM Triple Six. Fuck you talkin' bout?\nMan, I grew up around the same shit the rest of them niggas grew up around\nFuck you mean?\n\n[Verse]\nPopped off in that old school\nLeaned back cause I'm so cool\nI ain't never ran with a pack of bitches\nIf you trust them hoes, you a damn fool\nI'm smokin' that sack, smokin', I'm smokin' that sack\nMane, and it's hella strong\nFree that nigga Guwop, he been locked up too damn long\nThem weirdos on the internet, in my comments talkin' that big shit\nI don't lose sleep for that nonsense\nY'all playing checkers, I'm playin' chess\nYou know what's up, go fuck around and getcha nose bust\nI ain't talkin' bout from this cocaine\nMy fist, bitch, be some angel dust\n\n[Hook]\nI ain't gotta hang with DJ Paul to be reppin' that triple six. (Mafia!)\nI'm a pioneer up in this bitch\nYou betta recognize who you be fuckin' with. (Mafia!)\nWith much respect, got the check, got the tech if somebody got a problem with me\nI was born in it, I'm a die in it\nIf you want me then you better try and come and get me. Bitch!\nLosin' sleep, that's neva\nAlways countin' chedda\nNosy motherfuckers wishing that they life was betta\nGirl, you do not know me\nYou ain't on my level\nKeep on talkin' shit and I'm gone make you meet the devil\n\n[Verse]\nThis shit here, this shit ain't for radio, homie. This shit is for hustlas caught in the struggle, surrounded by nothin' but phonies. (You hear me?) [x 2]\nWastin' time [???] it's gone drive you crazy\nI'ma have so many smoke mirrors up, it's too hazy\nNow you're in a daze, in a maze, I'm enraged. What the fuck you gone do now?\nYou done pushed a button, now I'm all turned up. And I don't know how to turn down\n\n[Hook]"}]}