{"songs": [{"image": "https://images.genius.com/ff321b7b11c499b6ffbd311c2022b0d4.1000x1000x1.jpg", "title": "Apex", "album": "The Art Of Chill", "year": null, "lyrics": "[Verse 1: Nitty Scott]\nYo, I can see it in your eyes, think you just got two\nFascinated with the new flu, two by two\nAll my zoo shit true and I'm too badu\nI be all over their head like the shampoo do\nSnoozing on a revolution so I blew by you\nLiterally leave your body in the Blue Bayou\nWe be looking at your troopers and your crew like ''who?''\nEducating, elevating on your boo IQ\nPledge allegiance to nothing, I got the wood and he crushing\nMy kamikazes are coming to light Picasso percussion, you dummy\nLittle bummy ain't a damn thing funny\nYou so poor, honey, all you have is money\n\n[Hook: Nitty Scott]\nSo inhale the fragrance\nI be the apex, ho, get on my wavelength\nAnother like me? Highly unlikely\nHiding in my psyche, I dare you to come and find me\n\n[Verse 2: Ab-Soul]\nI dare you to come and dare me to flip and commit a homi\nI promise to God I'm probably the God of rhyming\nDividing the profits with prophets, prophecy wasn't lying\nI grew my hair out just so I could look like a lion\nSo when I say I wore it, that metaphor is more exciting\nI understand that, for sure like beach homes and sand crabs\nBonjour, bitch pardon my French\nI never been to France, but I like to kiss like them\nConsider this the Kiss of Death like Jada came through\nNitty, you know it's love when they showing hate, boo\nFood for thought, hope you get a plateful\nLately I done turned the booth to a dinner table\nYoung mindfuck, what the fuck you thought?\nFire in my eyes, in my shades it's dark\nAnd I'm still getting used to this famous part\nThey say I sold my soul, but what about what I bought?\nSoul\n[Hook]\n\n[Verse 3: Nitty Scott]\nIt's rap game, little Bhudda baby\nI take it you can hang in spaces with mother nature the Bhudda lady\nYou feel my nexus, I'm flexin' my solar plexus\nWe can have a flower orgy and keep it all in an essence\nMore dread from warheads\nThey want the poor dead, but I fed the universe on my forehead\nAnd did this happen beforehand?\nNow face it, they just basically erasing them glitches up in the matrix\nAlways thought the term Black Magic was kinda racist\nAnd I have yet to find intelligent basis for all the hatred\nAttracting and deflecting a core of my star portals\nAin't it gorgeous to be mortal? I couldn't be more cordial\nNow who dare stare into the hazy sun?\nI tell 'em it was I, Nitty Scott the wavy one\nI move things that move things with mood swings\nGot these niggas kissing my mood ring, I'm out\n\n[Hook]"}], "artist": "Nitty Scott"}