{"songs": [{"album": null, "year": null, "title": "Good Game", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "[Verse 1]\nYeah, hey!\nHey, I'm just a Carolina nigga goin' hard for the 'Ville\nI ain't seen six figures but I feel like a mill'\nCause I'm fresh up off the deal, will I chill? Never that!\nI'm the hottest nigga out and you could tell the devil that\nGot that crack! Went from pebble to that Roc, pedal that\nSo much bass, I mean niggas can't tell where the treble at\nOn the track, niggas can't keep up, they look, they trailin' back\nNow these bustas couldn't catch up even if Id pedal back\nWon't lose, bet on that! or be in debt forever\nPlus whatever Jigga say, I'm hot\nThat's like the pot called kettle black\nNow these industry niggas like damn, \"Jay said all that? \"\nSame niggas could've signed me, now they gon regret all that\nBet on that! Bitch, this my beat, look how I get on that shit\nI'm on it like I own it cus I sewn it\nNeedle and thread, hip-hop heads know them drums express youself\nAye look, I tried to school these niggas, they need extra help\nI mean they just don't get the message dawg, no text could help\nAnd now I'm on some 'fuck you niggas', go molest yourself\nI'm tryna ball til I fall, catch myself, then ball again\nFall to the floor, dust myself, do it all again\nPardon him, sick nigga, never been a bitch nigga\nSpit it for them ones like me who never been a rich nigga\nHad the dream to make a team and get up off the bench nigga\nYou fuckin' with me, ya odds is slimma then a stick figure\nGet bigga nigga\n\n[Hook]\nHey, blood, sweat and tears, I paid my price\nHey, so come and get this good game\nAye you should come and get this good game\nHey, hey\nI pray for days and nights I gave my life\nHey, so you can come and get this good game\nThink you should come and get this good game\nHey heeyy\n\n[Verse 2]\nYeah\nI'm just a down south nigga, lil' east coast flow\nFrom the concrete jungle where the trees don't grow\nFrom the 'Ville, where the motherfuckin' streets so cold\nNigga I could show you streets where police won't go\nWe just tryna get a piece, my nigga we so po'\nWhy you lookin' at him, wonderin' why he sold dope\nOr why she smoke crack? Or why he tote gats?\nGotta stay up on your toes cus if your feet both flat\nA nigga heat gon' clap, your heartbeat go flat\nThe Lord giveth and he taketh, well he repo'ed that\nThey don't quiver, they don't shake, man they just reload gats\nSo much beef for a nigga to have a feast on that\nNow a nigga like myself ain't had to keep no gat\nBut nowadays mo'fuckers is weak, won't scrap\nSo them OG's tell a nigga, \"Please, roll strapped\"\nIt's fucked up a nigga man it be's like that\nIt be's like that (Hey) and it be's like that (Hey)\nThem boys from the 'Ville and yeah it be's like that\n\n[Hook]"}], "artist": "J. Cole"}