{"songs": [{"year": "2014-07-15", "title": "Welcome Home", "image": "https://images.genius.com/a4d52942eb4b120225094d0e316c3b15.800x800x1.jpg", "lyrics": "[Produced by Saba]\n\n[Verse 1]\nYo Saba it's been a minute, you better, you benefited, is that what you thinkin' now?\nThe rapper you been committed, your woman she throwin' a fit like nigga you cheatin' now?\nJust tell her keep it down, they try to take your dream and keep it down\nI've been turnin' up like I beat the sound\nI've been burnin' up if you do pounds\nAnd my time is up I just mute the crowd\nMy nigga comin' home soon, he found\nIf you think you gettin' known soon, don't\nI'm better than before\nSo where I'm gonna get my support at?\nWhere you go when you on your last?\nThe fam you actually had before rap\nWelcome home a doormat, they all facts, tell 'em niggas\n\n[Bridge: Saba]\nSo where I'm gonna get my support at?\nWhere you go when you on your last?\nThe fam you actually had before rap\nWelcome\n\n[Verse 2]\nYo, I walked in Def Jam on my 19th birthday, I can't recall my 18th\nCame a long way since the days where we strolled like we homeless and loitered on State Street\nI just pray that you get home safely, ironically the green line trained me\nCause I was softer than cotton startin' college something that here you can't be\nCan't see them niggas gettin' on no time soon, we worried 'bout survival out here\nLike where the hell I'm gonna get my food, nigga fuck your song I don't care\nSo where I'm gonna get my support at?\nWhere you go when you on your last?\nThe fam you actually had before rap\nWelcome home a doormat, they all facts, tell 'em niggas\n\n[Bridge: Saba]\nSo where I'm gonna get my support at?\nWhere you go when you on your last?\nThe fam you actually had before rap\nWelcome\n\n[Hook: Saba(3X)]\nPain make the best song, and the game made a stepson\nBut my heart can't be teflon, I feel everything and some\nI got some issues and some, granny worried 'bout her grandson\nI ain't worried 'bout a damn thing...nah\n\nWelcome home (6X)", "album": "COMFORTZone"}], "artist": "Saba"}