{"songs": [{"year": null, "title": "Rollin’", "image": "https://s3.amazonaws.com/rapgenius/1374161137_sammy-adams-haircut-1.jpg", "lyrics": "O yeah!  It's Wizzy!  (laughing) I'm having fun up in here, man.  Shouts to Boston!  Shout out to all my people!  This shit's fun for me man!  Everything's coming in full circle.  Wizzy!\n\n[Verse 1]\nWizzy, Wizzy, stacking, get tipsy\nAlready killed 20 drinks, but feel like nuttin's in me\nI gotta girl named Molly, hottie hollas just to lick me\nFingerprints of bitterness are fucking me up quickly\nRolled out, swinging for the fence, you know like Griffey\nOn the runway, bridges off my plane, sorry you missed me\nCloudless in the sky, but Stacy has the cabin misty\nWe just smoking Alias, but ain't fucking with Missy\nI can't feel my legs, I'm Uma Thurman in this damn thang\nMy revenge is pill form, Adderall and Ying Yangs\nTouching ladies, sweating, blazing, flammable as propane\nChampagne bottles poppin' and we cuttin' lines of cocaine\nFeeling like a million bucks, furthest from a bad place\nSmiling on my inside, but I'm grinding with my sad face\nMore and more I'm fallin', crawlin', stepping toward euphoria\nPopping shots before it ends, call me Robert Horry, brah!\n\n[Hook]\nIf you wanna roll with me\nPop and throw ya drink back\nSingles are for lovers\nIf you fucking take a trip stack\nLove me baby I can take you higher\nI can take you higher\nLet's get a little higher, higher\nX2\n\n[Verse 2]\nOn my shit, I'm out my lid, but notice how my words shape\nSean and Cudi hurricanes, well I must be an earthquake\n? hearing all these dudes show love and then they spread hate\nMy pupils are big as fuck, 'bout the size of pancakes\nRolly faced to Beezer state, Boulder boys we getting faced\nBoston fam there's no replace, meant to speak my life on tape\nI don't know if this shit's fake, either way my mind's erased\nI love every body, I'm the biggest fan of good mistakes\nGet your girl wetter than if you went and jumped in the lake\nStuck off MGM and ey, I'm puffin L's, getting baked\nMagic, in the playoffs, you a loser, you just get Laked\nWe still rollin' heavy boy, 'til the day we get cake\n\n[Talking]\nYeah!...I'm sorry ma!", "album": null}], "artist": "Sammy Adams"}