{"artist": "Capital STEEZ", "songs": [{"title": "HYPE/Beast", "album": "AmeriKKKan Korruption", "year": "2012-04-07", "image": "https://images.genius.com/6172be389a954926184790991e7ca0ff.500x500x1.jpg", "lyrics": "[Produced by Kirk Knight]\n\n[Verse 1: Uno Hype]\nI'mma pick up where the storm left me\nThey just want to do him, but these niggas can’t check me\nWasting my time, these hoes keep trynna text me\nI been in my own zone how you gonna next me\nI been in my own class how you gonna test me\nLook me in my eyes, you little niggas respect me\nThis is for all the broads that tried to reject me\nAs of lately ya boy been feeling stress free\nBut I’m glad the lord up top tried and blessed me\nSo therefore these critics just gone press me\nNever tried to impress me, all these lames is flexing\nRealer than all ya’ll its time ya’ll confess it\nI kept calling, but they never got the message\nPut in a lot of work, fall off, and that’s it?\nIt’s only one year, my nigga that’s too quick\nThey said you want next, but couldn’t give two shits\nGuess I was the one to blame\nIts a fucking shame, how a nigga just came\nAnd changed the whole game, something like an animal\nI can never be tamed, while I’m ripping off these chains\nThis the first time I'mma let it out, 93 'til the death of me, I’m showing what I’m about\nMy mind’s all still in ink, do I have to spell it out?\nThat I am delivering dope and these niggas cracked out!\n\n[Verse 2: Capital STEEZ]\nThey can't block me out son\nPut me in a box and get outdone\nSo assuming that I'm arrogant\nI broke through the half of it\nI break down where I got my clout from\nThe last child, not the least of the weak ones\nStrong minded I got a green thumb\nThe fam gotta eat son\nAnd the fans need at least a week's worth of words\nSo Kirk keep the beats running miles per hour\nWorking on my genesis, it's Penny Arcade penmanship\nTake a second, you can understand my development\nThought I had drug money with my raw presidents\nFar-side zombie spark trees\nLike Marley lost in a safari\nMom try to warn me the lords could foresee\nGod armed me with a strong army\nI heard it's cold outside\nBut you can't migrate till you learn how to fly\nLooking at the birds in the sky\nWas this world really worth when we die?\nAm I too young to question that\nHomies told me i should just relax\nI can't stand on top of the world and let the rest collapse\nI need help tryna build it back!"}]}