{"artist": "360", "songs": [{"album": "What You Hear Is What You Buy", "year": "2008-03-25", "title": "Hip Hop Sphere (Intro)", "image": "https://images.genius.com/e3fbdd8afe27f8dc4506cc60fdbc784b.600x600x1.jpg", "lyrics": "[Background Arguing]\nYeah mum, fuck off. I fuckin’ told ya I don’t fuckin’ want any, fuck off\n{\"Drunk and Hot Girls\" by Kanye West plays in the background}\n\n[Spoken]\nYeah, yeah, what up? This is uh, 360, AKA captain 6 dog, AKA Tommy 6, AKA 60 Cent, AKA 360 Mafia, AKA Dirty Love {PEZ laughs}. And you’re listening to the Hip Hop Sphere – What You Hear Is What You Buy mixtape. Downloadable mixtape for all the net-heads and shit it’s to sort of promote the album which is called What You See Is What You Get, which is out March 22, 2008 on Soul Mate Records (Cop that shit). Um, you’re gonna hear some unreleased exclusive shit that isn’t gonna come out anywhere else except here, so there’s a lot of old shit, there's this bit of newer shit and there’s some real heat in there. There's also two exclusive tracks off the album that you can’t hear anywhere else except for this. And um, if you go to my Myspace which is www.myspace.com/emcee360 , so that’s E.M.C.E.E.3.6.0., you can hear the two singles off the album, they’re up, streamable now, and you can watch a music video as well, and you can look at me, which is a fuckin’ privilege. Uh also, there’s a track on this thing called “Fallin’ & Flying”, it’s with GMC. It’s off GMC’s mixtape - The Three Letter Mixtape: Volume G, and uh, he’s signed to Solid State Recordings, and G’s probably one of my favourite MCs in this country or musical artist in general, and um, he kills shit, so make sure you cop that fuckin’ mixtape as well. Also, PEZ’s solo album A Mind Of My Own is coming out soon after mine, and it is crazy. Crazy original and the main single's featuring me too, so that’s more incentive to buy it, bitches. Hiphopsphere.com. Yeah, make sure you cop the album What You See Is What You Get in JB Hi-Fi and Sanity around Australia and your independent stores as well. And uh, yeah, check us out, baby. We’re gon' fuckin’ smash it. We’re gonna fuckin’ smash it! Smash it! Smash it! Peace"}]}