{"songs": [{"year": "2017-09-08", "title": "Highest", "image": "https://images.genius.com/63434c224d99de7c2fa4646da1ed5c4d.400x400x1.jpg", "lyrics": "[Hook]\nSɛ wo nya kakra na wo ma wo maame bia wo yɛ (highest) Yeah\nWa succeed wɔ streets still naa you no dey damu (highest) Uh huh\nWagye wo din akyɛ. Still naa wo ho ntwa mu da (highest)\n\n[Verse 1]\nAfrica rap no esi me nan so\nAfei na mabedu mo mbisa me kwanso\nOpana wada mua pɛ baabi da na wonya sika kakraa no wo de bi kɔhwɛɛ mmaa to\nRap no yakyekyere wɔ dadesɛn mu\nNti 2017 yɛkyekyɛ nesɛ hampers\nBorger wo nnyɛ celebrity\nGyae akɛsesɛm no gya sika no bi fa tip bouncers\nMma mo nni makyi nnyɛ sɛ me rap no nni cotonou\nMa crossi border sesei me wɔ Shanghai\nMoa ma miss rap wiemuhyɛn mo mpipa manim nisuo me de mo bɛto standby\nNow! Asɛm aa makayi modeɛ mo paa mo nto bet\nNkurɔfo bɛkasɛ obidi me yɛ guy guy\nBut ɛnfa me ho cos chorus bia tumi hiti\nAdɛn moanti Shatta Wale hai hai?\nProphet bedi me sika deɛ nka me to salaka and Jah guide\nCos already obidi is having a good year, car tyre\nWose alomo one tort boɔ din\nƐneɛ massa kɔ kasapreko cos that one bi the bar price\nApolisi foɔ mpaninfoɔ no hwɛ manim ɔmo se Charley obidi yɛ bad guy\nNti wo ntumi nnyɛ me foko\nMe nwia wayewa nti hwɛ mu twi wo mako\nWani tua rap no yɛfa no koko\nThis year you know what be the motto?\nƆmo se bɔ wo ho mmɔdin na di wakɔnɔdeɛ\nNnyɛ saa last hour kanzo na wo bɛ weɛ\nRap ɛhyɛ me bo na ɛma ahometeɛ\nMe de flow no asi gya so nti ɛbin aa na me tweɛ (Now!)\n\n[Hook]\nSɛ wo nya kakra na wo ma wo maame bi a, wo yɛ (highest) Yeah\nWa succeed wɔ streets still aa you no dey damu (highest) Uh huh\nWagye wo din akyɛ. Still aa wo ho ntwa mu da (highest)\n\n[Verse 2]\nYeah. Tie. Uh\n2017 na sɛ wo mpɛ masɛm a, me ne wo nni long talk\nNa sɛ last year na me nom asana deɛa afe wae mɛ we fan pop\nƐnnoama mmienu na ebetumi ada wo nsa\nWatch ne handcuff. Choose one (Weh)\nNea wo pɛsɛ wo de kɔtɔ tuo no sesa na fa tɔ laptop\nCos adeɛ yi nkyɛ na nipa adi amia\nNti yɛbɛyɛ deɛ ehia\nGhana fuo mo ngye me ndi na mo mfa ahenkyɛ no mma me sɛ deɛ Nana Addo believe Bawumiah\nMentae ɛ'shada agyesɛ buronya na me mia\nMe sua no trog na me pia\nAsomesi ɛmma wani mmere me na nea mafa mu no sɛ me bɔ nepɔ si wo tiso a, woti b3kyea\nForgeti onipa nua\nƐya a, mo twere me din wo rap nnwoma nim\nƐmmerɛ me dwene mo ho na menkɔ m’anim\nMato mebo abue rap pono ma wuramu nanso still naa mahun sɛ mo tetɛ mpoma nim\nMagye me din mfie pipipii me ho ntwa mu da\nYɛ se menkɔ manim mehwɛ makyi a, mɛdane samina\nGhana rappers dɔso Imitaion ahyɛ mu ma\nMa me nni me bɔne na me nkoa na me wɔ matemuda\nPoisonous verse ɛwc beat no so\nƐnnyɛ rap a ɛnka me gyina street so ko\nMe bars mu ɛduro tese peace no to\nMe tua light bill tua fees so nko\nNti bɛbia m’adwene da no ɛnnyɛ fight ne beef\nPimp’i Tico ɛnnyɛ ne size ne Jeep\nSɛnka mo rap no yɛtɔn no wɔ Marina Mall a, ɛnka ebi daso gugu shop nso price no cheap\n\n[Hook]\nSɛ wo nya kakra na wo ma wo maame bia wo yɛ (highest) Yeah\nWa succeed wɔ streets still naa you no dey damu (highest) Uh huh\nWagye wo din akyɛ. Still naa wo ho ntwa mu da (highest)\n\n[Outro]\nBoys no claim nso me twe me tia na mo rap abɛyɛ so kolo\nObidi ma no ate me flow nɛɛdɛ sɛ preyman sobolo", "album": "HIGHEST"}], "artist": "Sarkodie"}