{"artist": "King T", "songs": [{"image": "https://images.genius.com/641a3479424d2748b1235e965b5adbcc.320x320x1.jpg", "title": "Where’s T?", "year": null, "album": "Thy Kingdom Come", "lyrics": "[Dr. Dre]\nAy, ay, ay where the fuck did Tee just go?\n\n[Hook: singer] {X2}\nWhere is Tee?\nAnd what's going on?\n\n[Over Hook: Dr. Dre + (King Tee)]\nWhere the fuck is Tee?\n(Right here, here I come y'all)\nWhich way did he come? (Here I come)\nWhich way did he go?\n(Hah, over here)\n(Hah, here I come)\nYeah, kick that shit\n\n[King Tee]\nSet out to check my trap, twist the mode on grind\nTryna soothe my brain with my money or my mind\nBesides busting rhymes, I'm real good at doing crimes\nInfected with the code of the street and gang signs\nWhat's that line? Fuck a bitch, won't make a nigga rich\nI make a nigga switch from shot calling to a bitch\nOff the wall, my niggas never heard of y'all\nCan't trust 'em, all up in the mix near hustlers\nStop fronting, I came to represent the W\nHood rats, top dogs and thugs too\nThought you knew, but obviously not, you're through\nYou need protection from King Tee's resurrection\nPeep the session, loc get the full +Tee+ spoon\nSwallow it fast cause I'm about to leave soon\nFor the moon, smoking big bubble toots\nIn the suburban, sipping on the 'gnac\nNow we swerving past moms, gang affiliated rap stars\nIn motion, tryna get paid for the potion\nTop notch, the killer with the Rolex watch\nWith many karats, step up on the stage and straight tear it\nInto pieces, ain't a greater man except Jesus\nWho can touch me, bet a hundred thou' you couldn't bust me\nThe original Likwit rough grammer\nProtected by the gat and bandana, who am I...\n\n[Hook] {X2}\n\n[Dr. Dre]\nAy you know what...\nLooking at my Rolex, it's about that time\nTo crack open the Hennessey and roll up a dime\nLine after line, I'm blowing your mind\nDisrespect and get the nine to your spine\nA gang of niggas try but they never come close to\nThe big time player living like I'm supposed to\nSo when you see me rolling in the Testarossa\nYou can best believe I got the strap in my holster\nMobbing son, popping +Robbin-son+ like +Sugar Ray+\nPut your gun away or get done away like fait\nGot beats and stock cops, you never see the props stop\nSteady dippin, stripping emcees like a chop shop\nNow who wanna get with the black Frank Nitti?\nI ran through your city and left with my boots shitty\nNobody gets looser than this producer\nCoordinate tracks that's live, three or four cars to ride\nOh, coming out of L.A. regulating the West coast\nEast coast and between coasts, then I'm ghost\nI know you're bobbing your head cause I can see ya\nBut you can't see me, the D-R-E and the King Tee\n\n[Hook] {X2}"}]}