{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "The New Joint (DJ’s Delite)", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "PRINCE PAUL (NARRATION): One week later...\n\nBOBBITO: Oooooweee! Yo-yo, what's up? This Bobbito the Bomb, chillin' with my man, Stretch Armstrong, y'all knahmsayin? Yo! This next joint coming out, MC Tru, \"Prince Among Thieves,\" you guys been calling up. This jawn's crazy. We gon' put it on 'cause, hey, it's— it's— we gotta do it like that. So check it out!\n\nBOBBY SIMMONS: What's up, everybody? Welcome to Flavor Videos. I'm your host, Bobby Simmons. The most requested videos you been asking for. It's \"Prince Among Thieves!\" The artist is Tru. We gon' kick it for y'all one time\n\nSPECIAL K: This is Radio KCEP. I'm Special K. You asked for it, you got it. You know this one. \"Prince Among Thieves,\" by Tru\n\nDJ MECCA: What up, what up, y'all? This is DJ Mecca, 88hiphop.com. Check up Tru, up next, with his new single, \"Prince Among Thieves!\"\n\nARTIST: This the Artist and DJ Vincent on 91.3. Yo, we got this jam y'all been calling up for. \"Prince Among Thieves\" by Tru, y'all, check it out\n\nBLESS ME: Once again, coming to y'all live from Brooklyn's fattest video show, Bless Me Video, kickin' it live with my man, Tru. \"The Prince Among Thieves\"\n\nDJ ATLAS: Chillin' with my man! Tru! We got this new joint! It's called \"Prince Among Thieves!\"\n\nLYNN GONZALES: This is Lynn Gonzales, from WNYU, and this joint, \"Prince Among Thieves,\" is hot!\n\nDJ ROTIMI: Yo, what's up? This is the greatest DJ in the world, DJ Rotimi, and I got that new joint you been requesting all day. MC Tru, \"Prince Among Thieves!\"\n\nDJ EVIL DEE: Aight, here we go, knahmsayin'? Station rocking the nation! We giving you all the hip-hop flavor! Evil D in ya area! Right about now, you knahmsayin'? True, true, true. The phone lines are lighting up, true! We gon' get into that guy called MC Tru! Word up! Yo, \"Prince Among Thieves!\" Yo, throw it on, man!", "year": null}]}