{"artist": "Andy Mineo", "songs": [{"title": "Toca Tuesdays Freestyle", "album": null, "year": "2015-09-10", "image": "https://images.rapgenius.com/8e0ca5d04d6d1604e4f6f4c152c33f07.1000x563x1.jpg", "lyrics": "[Verse]\n'Bout to flow it up, ya know what's up\nI'm in the studio right now with the boy Tony Touch\nYeah, I get it goin' off the top\nThey don't wanna see me drop, they don't wanna see me get hot\nSpeakin' of which I was up on that 97 this morning\nThey was playin' me at 2\nYou know that that's the best\nAnd I was lookin' around like, \"Is this real though?\nI'm on the airwaves, I can't believe this still though\nTalkin' right now, freestylin' off the tippy\nI got Money Nels with me, he gon' get me\nPull up in that 350, and maybe we gon' skirt off\nAnd you know I ain't comin' with no writtens\nMatter fact, speakin' of writtens, let me go and address this\nI'ma talk about these rappers, uh, standin' in they dresses\nYou got other people that's writin' for you?\nI don't like that\nYou can take it back, I'm not gon' bite back\nBitin' my tongue, I'm light in the run\nI'm out here fightin' them some\nBut y'all know what it is though\nI'm not goin' off of the top, yes I am\nMatter fact I had to hit 'em with the synonym\nBoy, I am not Eminem\nBut I'm white though, I know they like those\nI come through with a light flow\nI hit you real quick, this is at night though\nThey see me cause I'm comin' through\nI might just have to snipe though\nAnd I don't even got a gun\nYou know that's how I'm gonna run through these streets\nNew York City, uptown with me\nSo shout CCF and everybody ridin' with me\nThey know just how I get it, throw me any word and watch me flip it\nI'ma go ahead and get it, this is real hip, hip-hop\nY'all know I don't stop, Tony Tizza\nI see you with the black and yellow, they know what's izzup\nDang, and I ain't even sippin' on the sizzurp\nI throw it right now, they just know what's the wizzord\nMy man over here, cornered lookin' like a wizard\nEatin' all the chicken, that's absurd\nI know you tryna get the protein, you know the flow mean\nThey know me, Andy M-I-N-E-O\nY'all just know just how it go\nI had a written though, but I don't even wanna share it\nCause the freestyle right now is goin' ridiculous\nI ain't embarassed, I'm kinda feelin' like a clown\nGoin' in it cause the flow got 'em actin' like I don't know how to act\nSo, yo, what's your name?\nVicky? What is it?\nFrida? R-I-T-A?\nRita, oh my goodness\nSo back in the day I had a girl that kinda looked like that one, Rita\nYa know just what it is, I'm not done\nSo, Rita, I'm thinkin' 'bout that one artist from Mexico\nHer name was Frida\nAnd I just saw the documentary\nYou got to bleed ya with the lyrics, when they puncture ya\nAnd you know that the flow is funkin' up\nYo, I ain't even tryna cuss\nBut I'm just gon' let 'em know that they gotta know what's up\nCause this right here be that summertime New York, crack the hydrant flow\nRooftop in Brooklyn or that Spanish food in Malico\nBada-boom, bada-bing\nThat's a paisan thing\nShawty's ice cold, so I had to ice the wedding ring\nHardly wearin' anything, it's hard to keep my mind straight\nThem fine dames got fellas actin' like some primates\nVisual beings, that's what we are\nBut she ain't even work out for it, she got work out in DR\nOh, that's not my business though\nI'm curbin' with the glass, been blessed with the gift of gab\nMy pen paid for the pad\nSituation with my dad still touchier than a iPad\nRan outta tears, all I could do now is laugh\nSorry to kill the vibe, but these are the thoughts I hide\nSometimes it be feelin' hopless, I don't bring it to God\nThat's where my faith, pride and my emotions collide\nBut as long as my eyes are open I know hope is alive\nYo, I finally found my bride, I was waitin' a long time\nBefore I ever touched a body I was tryna touch her mind\nI ordered dessert from the waiter, I said, \"Surprise me\"\nBut that's no way to get a honeymoon body, dang\nAnd now I'm eatin' way too many calories\nSo you know that the boy's lookin' kinda sloppy\nBut hold up\nI gotta chop it up so I could get real choppy\nAnd I be comin' at they hat\nAnd I ain't on the Kawasaki Ninja when I'm ridin' through\nYeah, they just know what's up\nLemme chill, cause you know the flow is up\nUh, get it"}]}