{"songs": [{"lyrics": "Party people\nParty people\nCan y'all get funky?\nSoul Sonic Force - can y'll get funky?\nThe Zulu Nation - can y'll get funky?\nYaaah!\nJust hit me\nJust taste the funk and hit me\nJust get on down and hit me\nBambaataa's gettin' so funky, now, hit me\nYaaah!\nJust hit me\n\nIt's time to chase your dreams\nUp out ya seats, make your body sway\nSocialize, get down, let your soul lead the way\nShake it now, go ladies, it's a livin' dream\nLove Life Live\nCome play the game, our world is free\nDo what you want but scream\n\nWe know a place where the nights are hot\nIt is a house of funk\nFemales and males\nBoth young and old, called the disco\n\nThe D.J. plays your favorite blast\nTakes you back to the past, music's magic (puff)\nHump pump funk and bump with some class, people\n\nRock rock to the Planet Rock, don't stop\nRock rock to the Planet Rock, don't stop\n\nThe Soul Sonic Force - Mr. Biggs, Pow Wow, and M.C. Globe\nWe emphasize to show, we got ego\nMake this your night, just slip it right, and by day\nAs the people say, live it up, shucks\nNo work or play, our world is free\nBe what you be - be\n\nRock rock to the Planet Rock, don't stop\nRock rock to the Planet Rock, don't stop\n\nYou're in a place where the nights are hot\nWhere nature's children dance and say the chants\nOn this Mother Earth, which is our rock\nThe time has come, and work for soul, show you really got soul\nAre you ready hump bump bump, get bump, now let's go, house\n\nTwist and turn, the you let your body slide\nYou got the body rock and pop, bounce and pounce\nEverybody just rock it, don't stop it\nGotta rock it, don't stop\nKeep tickin' and tockin', work it all around the clock\n\nEverybody keep rockin' and clockin' and shockin' and rockin', go house\nEverybody say, rock it, don't stop it (Crowd repeats)\nWell hit me, Mr. Biggs (Crowd repeats)\nPow Wow (Crowd repeats)\nG-L-O-B-E (Crowd repeats)\nThe Soul Sonic Force\n\nYou gotta rock it, pop it, cause it's the century\nThere is such a place that creates such a melody\nOur world is but a land of a master jam, get up and dance\nIt's time to chase your dreams\nUp out your seats, make your body sway\nSocialize, get down, let your soul lead the way\nShake it now, go ladies, it's a livin' dream\nLove Life Live\n\nZih Zih Zih Zih Zih (ad lib)\n\nEverybody say, rock it, don't stop it (Crowd repeats)\nEverybody say, shockin' and clockin' (Crowd repeats)\nEverybody say, ichi ni san shi (Crowd repeats)\nSay, Planet Rock (Crowd repeats)\nIt's the sure shot (Crowd repeats)\nSay, Planet Rock (Crowd repeats)\nIt's the sure shot (Crowd repeats)\n\nSo twist and turn, then you let your slide n' glide\nYou got the body rock and pop, bounce and pounce\nSo hit me\nJust taste the funk and hit me\nJust get on down and hit me\nBambaataa's gettin' so funky, now hit me\nEvery piece of the world\nRate the message of our words\nAll men, women, boys, and girls, hey our Planet Rock is superb\nGet on it\nYou got the groove, move (ad lib)\nFeel the groove - feel it\nDo what ya want but ya know ya got to be cool and boogie\nOut on the floor, go down\nBring it low\nClose to the ground\nEverybody just rock it, don't stop it, gotta rock it\nDon't stop\nKeep tickin' and tockin'\nWork it all around the clock\nEverybody just rock it, don't stop it\nGotta rock it, don't stop (repeats)", "title": "Planet Rock", "album": "Planet Rock - The Album", "image": "https://images.genius.com/8331b6c8262a509e390a36b467c78f1d.1000x1000x1.jpg", "year": "1982-01-01"}], "artist": "Afrika Bambaataa & Soulsonic Force"}