{"songs": [{"image": "https://images.genius.com/55c6bfb6928ee69fa076f8f2a3218981.700x700x1.jpg", "lyrics": "[Intro: U-God]\nCountdown...\n\n[Verse 1: U-God]\nAre you ready? Are you mad inside?\nGot you strapped down to your seats\nOut of the doorway, bullets ripped, full clip\nGod speed, approach follow my lead\nFire winds gust, empire crush\nFull thrust, fall in the hole, roll wit the rush\nUntouchable chunk of earwax and soul\nSound waves slay out the bat cave smoke\nMy belly-full prance dance, avalanche quote\nDown slope, elegant as Fantasia\nKiller whale tale inhale, black male from Asia\nAll out the wood works, hood shirts and wizards\nNo match, unhatch, the rap is rigid\nIn the shaft, shotty cocked, hip hop to the limit\nNightwatch, pad mark\nSparks spin a quake nuclear blast, heavy on the cash\nGimmie what it takes NOW!!\n\n[Chorus: x2: U-God]\nRage, rock roll, fight\nBrawl, fall, rumbleee!\n\n[Verse 2: Letha Face]\nThe diabolic witty, dialect's darker than Gotham City\nWith the possibility to stop your walkin ability\nGod forgive me, spark enemies with pistol grips\nThe missile tip's impact hit you so hard, you shit through your dick\nOfficial scripts strikes when physical hits\nYou physical bitch, watch for the imperial blitz, serious shit\nSubmit, subject to the wreck war tone, and thought poems\nLiver than WWF Warzone\nWalk upon them Gotti tracks, bodies collapse\nRap for lottery stacks, shatter like when pottery cracks\nLogical facts from the terror dome\nSpill from the guts, trail to you ?puss? from where you bust\nIn God you now entrust\nDog you like hound and mutts, Pound Pups get sound struck\nClown what? You'll get drowned in the cut\nWhile crowd round up\n\n[Chorus: x2: U-God]\nRage, rock roll, fight\nBrawl, fall, rumbleee!\n\n[Verse 3: Inspectah Deck]\nA-yo, yo;\nI spit bars, traveling tremendous speed measuring far\nBeen busting satellites circling Mars\nVerbal onslaught, bring forth physical force\nOf a hundred wild niggas piled in a Trojan Horse\nThought method, set it on generic mic ethic\nProfessional neck shit, left foes beheaded\nThis music, is mind control like computer chips\nBeen doing this for numerous years, refuse to lose it\nWith turbo tactics, maneuver like a trained soldier\nHall of Fame flame thrower, take game, it's game over\nAyatollah, high roller nine totter\nMind controller, 2009 time folder\nMy coalition, bring the demolition\nWu-blade decision, slate the competition, wit no intermission\nSpitting hazardous darts, up front like Rosa Parks\nMakin million men march\n\n[Chorus: x2: U-God]\nRage, rock roll, fight\nBrawl, fall, rumbleee!\n\n[Verse 4: Method Man]\nYo, who got next? Meth got next\nI chin check, all these MC's line em up god, I go Jihad\nDeclare holy war, it be hard to dip and dodge\nPolice squads trying to bogard, we rip and rob\nThe boulevard ain't safe for your kids, that's how it is\nIn the ghetto, we ain't scared to death, but scared to live\nSo Goldy, mosey to the spot, get that moldy\nRusty-ass .38 Special, niggas owe me\nSlowly I turn, face the one and only\nNaughty By Nature, I Do My Dirt All By My Lonely\nAsk Pretty Tony, when I got a bitch I keeps a bitch\n36 Chambers, enter at your own risk\nTake that watch off and tuck your necklace\nCity never sleeps, streets is restless\nRap style'll slave you, when you least expect it\nPull the plug on your respirator, leave you breathless\nWu-Tang forever and a day, better warn your boys\nI deploy battleship rap, seek and destroy\n\n[Chorus: x2: U-God]\nRage, rock roll, fight\nBrawl, fall, rumbleee!", "title": "Rumble", "year": "1999-10-19", "album": "Golden Arms Redemption"}], "artist": "U-God"}