{"artist": "Cardi B", "songs": [{"title": "Bronx Season", "album": "Gangsta Bitch Music, Vol. 2", "year": "2016-09-15", "image": "https://images.genius.com/21352aa4d5659f1ff17b139d927c156b.1000x1000x1.jpg", "lyrics": "[Intro]\nOh, how you doin'?\nI'm alright\n(laughs)\n\n[Verse]\nNow how much times do I gotta prove these niggas wrong?\nAnd how much times I gotta show these bitches I ain't soft?\nHow many shows I gotta sell out 'fore you get the cost?\nWhy they really tryna front like I ain't hit the charts?\nAll these labels, throwin' deals from left to right\nBut I ain't givin' in until they get them numbers right\nAll these people think that this shit happen overnight\nAll that flexin' they be doin', shit is all a hype\nNo tolerance for a hatin' bitch talkin' shit\nOnly time I hold my tongue is when I'm suckin' dick\nSo when I see you in the streets, yeah, it's fuckin' lit\nAnd don't be talkin' all that sorry shit, don't flip the script\nI see the lights, I hear the hype, I hit the mic\nI kill the show, I get my dough, I catch a flight\nI see a hater, I'm runnin' down, it's on sight\nI throw my hands, I hit em' left, I hit em' right\nThey sleepin' on me just because I used to strip\nBut it's all good 'cause now they wanna get up in my VIP\nBlowin' up my phone, sayin' everythin' I touch is lit\nActin' corn and wanna fuck me like they wasn't talkin' shit, woah\nI let 'em live, let the shady motherfuckers live\nGet them the price then it's time to show them what it is\nDon't got the bat? Well then what you really tryna pitch?\nDon't waste my time, I ain't never been no average bitch\nNot to mention, I did my tour and that shit was winnin'\nIndependent, the headline, award of feelin'\nI thank the Lord for all the blessings that he is given\nI love the fans, they fill me up with their ammunition\nI don't really talk shit but now I gotta off this\nI don't know why bitches think we work in the same office\nCorny bitches tryna keep up? Look exhausted\nWave the white flag, girl, you might as well just forfeit\nMy ex told me I was never gon' be shit\nLookie, lookie now, lookie now, nigga I'm that bitch\nWhat you thought? Yeah, you really lost, now you kinda sick\nBut I ain't never need a nigga, I was always on my shit, yeah\nI used to stare at magazines on the train\nLookin' at these models like, \"I gotta be this one day\"\nFuck around, got myself a name, now I'm gettin' paid\nLeft the corny bitches in the grave, so they throwin' shade"}]}