{"songs": [{"year": null, "album": "Rap-Murr-Phobia", "image": "https://images.genius.com/1b9dc33c44d02a7b07bfd925c3d36043.1000x1000x1.jpg", "title": "What it Is", "lyrics": "*scratching*\nWu-Wu-Tang the-the-the Legion of Doom\n\n[Method Man] talking\nYo!\nL.O.D. Killa Beez Wu-Tang\nBaby Yeah!\n50 Grand Method Man\n\n[50 Grand]\nThey say L.O.D. this and L.O.D. that\nIts L.O.D. when I walk L.O.D. leaves tracks\nYou better love L.O.D. L.O.D. won't fail\nL.O.D. gang related half a mill for bail\nFeds like the soundscan wanna see what I sale\nL.O.D. know how to do it big without no mail\nAnd they all wanna see how L.O.D. be wilin'\nWit the Ticallion Stallion from Shaolin Island\n\n[Hook]\nMeth: And it was what it is when it was when it wasn't\nAnd if it ain't that Grand what could it be?\nGrand: And if it ain't that Meth what could it be?\nMeth: And if it ain't the Wu?\nGrand: Yo Its the L.O.D!\n\n[Method Man]\nThey sayin Wu-Tang this and Wu-Tang that\nBut they dont fuck wit Wu-Tang cuz Wu-Tang got straps\nLike hoes in hair salons boy Wu-Tang got wraps\nI'm dope syringe in your arm the boy got tracks (Ya Heard!)\nI'm noddin' on beat, I'm mobbin' on streets, the method\nBe starvin' to eat, cigar in my cheek, forget it\nThe L.O.Ds in here, the Killa Beez in here\nIf you ain't drinkin' and smokin' you shouldn't be in here\n\n[Hook]\nMeth: And it was what it is when it was when it wasn't\nAnd if it ain't that?\nGrand: Meth what could it be?\nMeth: And if it ain't that Keith what could it be?\nGrand: And if it ain't the Wu?\nKeith: Its Keith Murray!\n\n[Keith Murray]\nThey sayin Keith done this and Keith done that\nBut they don't fuck wit Keith cuz Murray'll snap\nIts the mack maniac rap insaniac\nL.O.D skull and cross bone on my back\nIts no hassle, you could killed for 500 dollas like Alfalfa\nFrom the Little Rascals\nI'm like the drug that was your worse enemy\nCame back to be your best friend\nAnd fried you in the end\n\n[Hook]\nMeth: And it was what it is when it was when it wasn't\nAnd if it ain't that Grand what could it be?\nGrand: And if it ain't that?\nMeth: Keith what could it be?\nKeith: And if it ain't the Wu?\nGrand: Yo its the L.O.D!\n\n[50 Grand]\nI crush everything and everyone within my clutch\nMy speech break bricks in half I'm still out to lunch\nL.O.D wit the Method we fuckin' wit ninjas\nBit wit the rap bug caught the influenza\nLyrically I'll air you out, Meth clear you out\nYou like a mistake when I'm writin' gotta smear you out\nI go ballistic on second thought I give you a break\nCut you into little pieces and mail you to every state\n\n[Method Man]\nWe off the meter off the block or straight off the street\nWe in your party like when pit bulls of the leash\nYes, when Meths wit the Legion of Doom\nPack your shit up your life will be leavin' you soon\nPicture big dick daddy in a big sick caddy\nMy ho even sicker wit a big thick fatty\nLord! Somebody pinch me this can't be real\nI'm ill like action flick stars that can't be killed\n\n[Keith Murray]\nAnd I ain't never met a sucker and we got a long\nI ain't never smoked no blunt that wasn't too strong\nWe been D4L before D4L\nRock wit the Funk Doc shut down the whole jail\nWhen Plus got killed L.O. rushed the courthouse\nI'll smack that talk back in your mouth\nThe L.O.D's in here, the Killa Beez in here\nIf you ain't gettin' rowdy you shouldn't be in here\n\n[Hook]\nMeth: And it was what it is when it was when it wasn't\nAnd if it ain't that Grand what could it be?\nGrand: And if it ain't that?\nMeth: Keith what could it be?\nKeith: And if it ain't the Wu?\nGrand: Yo Its the L.O.D?\n\n*scratching*\nWu-Wu-Wu-Wu-Tang the-the-the Legion of Doom\nWu-Wu-Wu-Wu-Tang the-the-the Legion of Doom\nWu-Wu-Wu-Wu-Tang L-L-L-L-L.O.D!\nWu-Wu-Wu-Wu-Tang L-L-L-L-L.O.D!\nWu-Wu-Wu-Wu-Tang the-the-the Legion of Doom\nWu-Wu-Wu-Wu-Tang the-the-the Legion of Doom\nWu-Wu-Wu-Wu-Tang L-L-L-L-L.O.D!"}], "artist": "Keith Murray"}