{"songs": [{"year": null, "title": "Touch Me, Tease Me (Hidden Bonus Track)", "image": "https://images.genius.com/6b4f873431041165fe1193e317d621cf.700x700x1.jpg", "lyrics": "[Intro: Sauce Money]\nMan\nThey just don't understand\nHow hard it is for a young black male\nStill wanna beef\nWe don't wanna compromise\nAll we wanna do is take take take\nYa better get some\n\n[Verse 1: Sauce Money]\nI'm in the streets with my thug love\nYou know the block is hot\nPlus them niggas tryna set up shop\nGettin' money in these streets is all I got\nEven if it takes me gettin' shot\nBesides what you riffin' for?\nFive Gs what I hit you for\nCan't believe you still want more\nI'm a thug boo you know thugs don't trick\nJust cuz I love you, you wanna drive the six\nWell that's too much shine, unnecessary flair\nNo more arguing, take some dough for ya hair\nJust beep me 12 o'clock, I'll be right there\nTo pick you up, don't ruin that\nI don't really be doin' that\nWhat you mean that's not good enough?\nI'm spendin' too much of time in the hood and stuff?\nIn the drop chrome shinnin' flauntin' my crew\nI'm tryna get paid ma, what you want me to do?\n\n[Chorus: Lil' Kim]\nYou gotta please me\nTouch and tease me\nLove me, hug me\nRub me, squeeze me\nKiss me, and never deceive me\nShow me, you gotta believe me\nOr leave me\nPlease me\nTouch and tease me\nLove me, hug me\nRub me, squeeze me\nKiss me, and never deceive me\nShow me, you gotta believe me\nOr leave me\n\n[Verse 2: Sauce Money]\nYou got some nerve grillin' me wit a frown a lot\nAttitude real stank, I ain't around a lot\nCan't understand why I'm outta town a lot\nI rap for big paper now, this ain't around the block\nNow you treat me like I'm cheatin', creepin' or sumin'\nSneakin' or sumin', late night keepin' 'em humpin'\nWhy you look at Sauce funny? (What you don't trust a nigga?)\nI work hard, look at your diamonds.... them shits cost money\nForget about your homies, they jealous of you\nI ain't really tryna hear what they tell us to do\nBesides half of them ain't even got no man\nThat's why I'm goin' all out, puttin' rocks on your hand\nBut you don't really care, you're spoiled and shit\nTalk slick like you drink baby oil and shit\nShe got a 500 wit chrome, spoiler kit\nAnd you still not happy, man what's wrong wit chicks\n\n[Chorus: Lil' Kim]\nYou gotta please me\nTouch and tease me\nLove me, hug me\nRub me, squeeze me\nKiss me, and never deceive me\nShow me, you gotta believe me\nOr leave me\nPlease me\nTouch and tease me\nLove me, hug me\nRub me, squeeze me\nKiss me, and never deceive me\nShow me, you gotta believe me\nOr leave me\n\n[Verse 3: Sauce Money]\nEnjoy your cut necklace, finer things\nVersace, Armani, diamond rings\nAnything you can imagine, if you mine let it\nNo more school loans, your own line or credit\nWalk in closets, full link minks in 'em\nHis and her Rollies, extra links wit 'em\nBottles of Dom, tennis braids for your arm\nFour-five workers for your beauty salon\nBut you don't wanna hear that, you still not happy\nShit, so what the industry's bustin' at me\nCar chases through Brooklyn, cop's on my tail\nFeds hit the spot, found it chopped on the scale\nUndercovers D's hit the block for a sale\nFor you or nobody else, I'm not goin' to jail\nImagine, all of this inside of a day\nJust for your ungrateful ass, whatchu got to say?\n\n[Chorus: Lil' Kim]\nYou gotta please me\nTouch and tease me\nLove me, hug me\nRub me, squeeze me\nKiss me, and never deceive me\nShow me, you gotta believe me\nOr leave me\nPlease me\nTouch and tease me\nLove me, hug me\nRub me, squeeze me\nKiss me, and never deceive me\nShow me, you gotta believe me\nOr leave me", "album": "Middle Finger U"}], "artist": "Sauce Money"}