{"artist": "Problem", "songs": [{"album": "Hotels", "title": "Good Pussy", "image": "https://images.genius.com/15abb7fd4efada220fc8791e7d53c261.355x355x1.jpg", "lyrics": "You know this is about you, girl. You know who I'm talkin to. DJ Hit\nGood pussy, good good pussy. Good pussy, real good pussy. So good I am all up in that pussy. So good I through the hood up in that pussy. Good pussy, good good pussy (she got that). Good pussy, real good pussy (sure). So good I through the hood up in that pussy. DJ Hit\nI'm notorious for doin it big in that pussy. It get any wetter I'ma swim in that pussy. Triple X momma, we gonna fill in that pussy. I'ma pack my shit and come live in that pussy. Deep all in ya, feel it in your stomach, cause every other pump is feelin like I'm comin. I'm throwin up the hood, yeah, got a nigga thuggin. Yeah I got one on but it ain't feelin like nothin. Damn, little momma got that wet wet. And other niggas bitches is always the best sex. Yeah, yes she move it all around. Then she speed it, speed it up. Then she slow it, slow it down. See, there you go, playin, little momma need to stop. I live to give this hoe every dollar that I got. Hell no, she ain't a model, she likes em off the block, block. Swear to god I'm gonna get your ass pregnant, finished\nGood pussy, good good pussy. Good pussy, real good pussy. So good I through the hood up in that pussy. So good I through the hood up in that pussy. (x2)\nIf I knew I would just buy my would been round my throne. Three other ex's got her name tatted on em. She take it, and she give it back like a loaner. Usually, when I play the D, I control em. But, this shit's kind of different. Got me all in club like tongue kissin-ing. So every shot I get to shoot, I'm switchin it. Deep down and up close I'm hittin it. With a hammer or a baseball bat, three four five six seven eight, all that. My last bitch's pussy fine but ain't all that. Leave texts on my phone like we can't call back. Hell naw, I'm with my new bitch. The crew too alive on some new shit. Yeah they all blue devils on some new shit. I got the whole spot covered on some real shit\nGood pussy, good good pussy. Good pussy, real good pussy. So good I through the hood up in that pussy. So good I through the hood up in that pussy. (x2)\nGood pussy, real good pussy. She grew up on sixth street, she got that hood pussy. Young nigga got pipe, no plumbing. And Michael Jackson, beat it, like she stole something. So good, I throw my hood up. Monkey ball pussy, got me doin pull ups. Car street pussy, I beat it up in the back seat. Garbage minded, all my thoughts is nasty. Met her in the club, man though, I had to fuck. Bakin like an ayer pussy, wetter than a tub. We could take some pictures, baby, we could make a movie. It was like a christmas gift how she gave it to me. I popped a pill and fucked all night. She catch balls, but not the Randy Moss type. Like a replay, I make her bring it back. She go for the sack like Warren Sapp\nGood pussy, good good pussy. Good pussy, real good pussy. So good I through the hood up in that pussy. So good I through the hood up in that pussy. (x2)", "year": "2011-05-07"}]}