{"songs": [{"year": "2009-01-30", "album": "C4", "image": "https://images.genius.com/8b626036c563b0aefa7a5b83f1fb9302.750x750x1.jpg", "title": "G Code", "lyrics": "[Intro]\nYeah. How I sound out there Ali? Good? Then good\n\n[Verse 1]\nCan I pay my past a visit?\nCentennial Compton School District\nAnd video campus shut the fuck up your premises\nKing Drew and Westchester had the baddest bitches\nAnd my nigga L Wood had a white Toyota, and we got pulled over\nHad to hide the bottle because there was mix with Hennessy and soda\nEvery time we rode up we was unsober\nAnd everybody had know that\nMy nigga Yan Yan had all the red P Hat\nWhich was really dumb because where we was at\nWas the other side and more than likely\nThe other side really didn't like that\nDidn't have no burner so if they shot us we could never really shoot back\nCould of lost our life over hood rats\nWe was dumb as fuck but lucky for us we was lucky enough\nThat the black car didn't pull up and ask where yall niggas from\nI know some, nigga less fortunate was fucking with the enemies' bitch\nShe had a fat ass and a brown Camaro but it wasn't that fast it was like a V6\nBut anyways she was one of those hoes in highschool with the cornrows\nSize 5 Jordans, Rolex sporting, and wanna fight everybody she knows\nWell she's important, well she wasn't, she was just so and so so and so cousin\nHe was a red, so anytime she got into it, that who she would get\nNow let me get back to the plan\nHomie had ask, \" Do ya got a man?\"\nShe said,\"No\", he said, \"Oh yeah\nWhere do you stay?\" She said, \" Rosecrans\"\nRosecrans and what? She said, \"Don't matter just know I fuck\nHe said, \"What? you're a, you're a little freaky bitch huh?\"\nShe said, \"Yeah daddy I can you get you sprung\nI can work that pussy and the tongue\nIf you come over I can make you cum\nIf you come over make sure that you bring drink\nBecause I like to get to drunk.\"\nAnd that he did, that Friday he was where she lived\nNotice that he was out of bounds\nBut didn't give a fuck cause he wanted to fuck that bitch right now\nWalked in the house, rubber on, panties down\nOldies playing in the background\nLet's get it on Marvin Gaye had bumped to the morning\nTime to go, picked his pants up off the floor\nKissed that bitch in the mouth then walked to the door\nWhen he walked out he seen a four four Bluh!\nDidn't know that was the pussy he was dealing with\n\n[Hook]\nAnd that's how you get your ass killed bitch!\nThat's how you get your ass killed bitch!\nThat's how you get your ass killed bitch!\nGet your ass killed bitch! How?\nFucking with them hoes, them hoes, them hoes, them hoes\nThem hoes hoes, them scandalous hoes\nThem hoes hoes will have you uh dead dead dead\n\n[Verse 2]\nLook. I guess we all can learn from mistakes\nBut your first mistake, might be your death date\nAnd death doesn't wait, on no one\nA million ways to die, and you can make it a million and one\nIf you not aware of the rules or maybe tryna fill someone else shoes\nLike a square trying to be a gangster kind of remind of this one dude\nHe wasn't thirteen he was twenty two\nWhen he went to first get put on the hood\nHe wasn't born it, Boys in the Hood the movie made him think it was all good\nBut usually this type of person want to prove his s s s s self on purpose\nTell everybody quit working, but really he's worthless\nHis momma had money, his daddy had money, so he had money\nThe OG's that gave him a pistol, think that he was gonna be just another crash dummy\nAnd the funny thing about it he thought he was bout it like P-Miller\nBut he wasn't no killa\nJust a monkey hanging around a bunch of gorillas\nEverybody wanna be tough guy so he did, approached this guy like, \"Where are you from?\" with his gun but didn't shoot it, rule number one\nNever pull out if you don't use it\nEven though the dude didn't banged the very next day he seen around the way blew his brains out while homeboy was cruising\nNot knowing the scariest nigga will split your shit\n\n[Hook]\nAnd that's how he got his ass killed bitch!\nThat's how he got his ass killed bitch!\nThat's how he got his ass killed bitch!\nFuck around and get your ass killed bitch! How?\nNot knowing the G codes, the codes the codes\nThe G codes, the codes the codes\nThe G codes, if you don't know then your already dead dead dead\nFeel me?"}], "artist": "Kendrick Lamar"}