{"artist": "Apathy", "songs": [{"title": "Bloc Party", "image": "https://images.genius.com/aaaae50163287364429e596cd5315e89.500x500x1.jpg", "album": "Hell’s Lost & Found: It’s The Bootleg, Muthafu@kas! Volume 2", "lyrics": "[Green Lantern:]\nInvasion!\n\n[Mike]\nHey Ap', why don’t you do the uh…the intro on this shit?\n\n[Apathy]\nYo Apathy, Fort Minor, Styles Of Beyond, Demigodz\n\n[Mike]\nHere we go\n\n[Verse 1: Apathy]\nYo, rappers like heavy metal and ghettos\nGuns, metals and ammos\nI pistol whip Tony and fuck Meadow Soprano\nA cat who sells them bugs but tell them thugs\nThey don’t know to carry more heat than welding gloves\nI walk amongst the gods, keep my head in the clouds\nOh we show groupie love, getting head in the crowds\nPut it in girls mouth blast off like NASA\nThe master of nastiness transform a classy bitch into\nA little sheen freak sadomasochist\nDastardly bastard of rap so disastrous\nSpitting, healed a cripple like Christ the miraculous\nAnd fights my savageness, turns punks, pacifists\nThe police clock Ap like there he go\nAlways on the watch because I use to carry blow\nAlways lock her down but I never marry hoes\nBury foes when the flows comes through your stereo\n\n[Verse 2: Mike]\nThere we go flipping up a predictable verse\nIt’s a curse to burst words like Tourette's on purpose\nPut the verb like a backhand reject perverse as it is\nI can't stop and its making me nervous, ok?\nGet me on a track and I'm cracking\nPacking up a backpack full of tracks on some CDs\nBe me, fuck that not like me\nTo bite me you need to be you times ninety\nI got schemes and a team so hyped we\nGet on a scene make a scene on the nightly\nSay what I mean, whether mean or politely\nLiving the dream in some clean white Nike's\nOr DC's, I'm not giving a shit\nFuck the words that you heard and the lips that they hang from\nI stay banging to bang, bang drums and hanging you lames\nAnd the same no names gangs you came from\nI don’t got an excuse, just talking the truth\nI'm fucking awesome when I'm rocking the booth\nAnd I stay ready with hot bloc rocking abuse\nY'all are really not stopping us dude, yeah Tak, get em'\n\n[Verse 3: Tak]\nIt started off get on over and hit the galaxy\nNow we're moving them over they're crowing me as the Cali king\nAnything tossed on my fuse getting chewed up\nWith a quota six and little good weight, too much\nGoing to get smacked in the face with aluminum bats\nYour fucking raps as good as me, Boo-booin'\nI said I was rude, step in the shoes, you don't believe me\nYou can ask Devin the dude how I strip down the bitch clown stand in my socks\nWhip the mother fuckers ass like I'm Cannibal Ox\nYou want to be stoned? beat him with a basket of rocks\nGet your shit flowing feeling for the casket to drop\nYou know them S.O.B.'s never get the record to stop\nBreaking the habit is impossible what happened to Tak\nHe's unleashed, he's a beast so Sledge hand me a bloc\nParty, whats your corpses posing for, the camera was shot, huh\nStyles and Machine Shop, necklace fly\nNo wonder everyone is so petrified\nI said, Styles and Machine Shop, necklace fly\nNo wonder everyone is so petrified\nYou hear that?", "year": "2005-10-30"}]}