{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "Alien / SpaceX (Original)", "lyrics": "[Intro: Ant Clemons & Kanye West]\nTelling my brothers to stay calm, though\nTurned to a monster, won't let it go to a-\nFed him to your plug, it goes where it goes\nThe nightmares still haunt me (Dream)\nWhen I sleep, they haunt me\nWhen I sleep, they haunt me (Ooh)\nAnd my nightmares, they haunt me (Ooh ooh)\nBut I won't let 'em get the best of me (Yeah)\nIn a sunken-\n\n[Chorus: Kanye West]\nAlien, magical, flyin', and all\nBeing, I got her signed on\nBeam me up, I'm 'bout to sign off\nDumber now, need to take time off\nDumber now, I don't believe the time\nShould have gone, man, I believe they lyin' (Get a mic, huh)\nSign, do you believe in science?\nBigger sign, bet they gon' bleed now\n\n[Verse: Kanye West]\nAliens, double to sign off\nBetter time, 'bout to take time off\nI don't believe in time, I just believe in science\nOrder a bleeding nine, tell her, \"Don't leave tonight\"\nAlien, being 'bout to fly out\nTook her out, order her something with eyes out\nThey was done, we the one, we just on\nLouis thong, Lebanon, we become, what they done?\nDuh-na-na, duh, feel it, feel it, feel it\nThis ain't our planet, that's why I kill it\nKill it, animals, kill it, ozone, kill it\nBlood, spill it, somethin' you deal with\nAlien, took the time off, I just took time off\nFly up, a pyramid, dunked on, Vesuvius\nNo bro, serious, I'm dead serious\nI'm dead serious, I'm dead serious\nAlien, period, she on her period\nShe gonna come here yet, something, then we get\nCloser, better yet, na-na, duh-na-na\nAlien, takeoff, I took time off\nI don't believe in time, I just believe in science\nI've just been feeling nine\nWe gon' just leave at nine\nChristian calendar, some-some calendar\nAirplane, challenge us, happen to challenge her\nSaid, \"It blow up,\" Michael Moore said, \"No what?\"\nAin't nobody die, Alex Jones said the same shit and fried\nOh shit\nAlien, pyramid, fly off, take off\nBreak off, Kit Kat, take off, wake up\nMake off, they go, say go, get makeov'\nYou let go in Waco, Texas\nPull up, err-err, 'Lexis\nFlex this, bless this, genesis, precious\nMessage, message, bless it\nDon't stress it, don't stress shit\nDon't test it, don't test this\nDon't touch this, man they Hammer time\nOn the dotted line, on the camera time\nWhen it's out of line and they meant it right\nDone it down to nine, on the dotted line\nWant a better line and I'm feeling right\nKill the feeling, right, oh and I made it rhyme\n'Cause I met a time and you're out of time\nAnd you wear the line and he out of line\nBut he set it off, on the Adderall\nWhen they got it all, set it off y'all\n\n[Outro: Kanye West]\nAlien, takeoff, monster"}], "artist": "Kanye West"}