{"artist": "WC", "songs": [{"year": null, "lyrics": "Mm, mm, mm\n\n[WC]\nAw Yeah\nI'm wit this\nIt's me, The Shadiest One\n(Dub, callin' all dubs)\n\n[Ice Cube]\nHot licks, hot licks\nComin' wit them hot licks, hot licks\nHit 'em wit them hot licks, hot licks\nRollin' with them hot licks\nHot licks\n\n[WC]\nHaters steppin to me, they wanna get some\nBut I'm the dub, yo, yo, you know the outcome\nAnother victory, they can't get wit' me\nSmoke from the left so coupe it's all they ever see\nI'm on the grind, I got's to get mine, loc\nI been puttin' it down since the days of low pro, so\nWhy's everybody now hatin' on me? (why?)\nCould it be I'm runnin' wit the dub SCG\nOr is it that I'm countin my riches\nGetting' my fingernails cleaned\nAnd being braided by the finest bitches\nWhateva the case you need to back up off my Benz\nKeep my name out yo mouth and slow down like loose ends\nCuz I wrote for gears, y'all\nCame to 'fore I served all y'all\nI deserve my R y'all\nDub C, the new leader of the pack\nWit' the brand new sack, and yo, I can't hold back\n\n[Hook: Ice Cube]\nIt ain't a problem that I can't fix\nAnd I can do it wit' yo bitch\nSo if you lookin' for trouble and you wanna feel muscle\nAll up against yo brain\nAnd away go troubles down the drain\nI said away go troubles down the drain\n(Bang, bang dub C!)\n\n[WC]\nNot just braggin', snippin', saggin'\nBang when I talk make the whole world c-walk\nI wants a little, yeah nigga, no doubt\nI put myself in this game, and I'm the only one can take me out\nThe 4 droppa wit the Jocelyn complexion\nStill love the women with tats and C-sections\nProtection, got my own bodyguard nigga\nFuck security, sleep wit my finga on the trigga\nA street scholar, born into nada go riff-rockin' prada\nTo rockin' shows in the Dama Fleet collar (hoo hooooo!)\nNever thought a rapper can be livin' like this\nAll I wanted was for real loc's to feel my shit\nPaid dues, curb served, for what, connected?\nSometimes feared but I'm never disrespected\nGet the cash and mash, drivin' for the meal ticket\nStretch and takin' work, we gon get it, I can't hold back\n\n[Hook]\n\n[WC]\nGet up, get up, get up, now throw your hood in the air\nLet me know you out there\nEastside, Westside, South and up North\nIf y'all respect mine, man I'mma respect yours\nFrom the crips to bloods to latinos\nI'm down with any nigga that's down for makin' c-notes\nIllegal, a desert eagle can't lie\nI'm addicted to twistin fools for them birds that don't fly\nCause real G's chase cheese and shake busters\nCut for one another motherfuckin' color\nWe quick to bring it, but ain't got time for the drama\nI'm all about stackin' dollaz and swangin' Impalas\nI got my money to make, niggas a gank, yea to chase\nKeys a takin', bottles of paint\nPounds I flip up outta the state\nLiquor to drink, pepper the bank\nWhores to break, goes away\nFoes I came, better to swing\nI fade it again, now what's my name?\n\n(scratching)\nI'm, I'm, I'm a dub to the C\nI'mma dub to the C\nI'mma dub to the C\nI'mma dub to the C\n\n[Hook]\n\nBang bang\nHoo Hoooo!", "image": "https://images.genius.com/e3cb3b767a7c4236e1df057692fb01b0.402x400x1.jpg", "album": "The Shadiest One", "title": "Can’t Hold Back"}]}