{"artist": "Phora", "songs": [{"album": "Therapy", "title": "If I Gave You My Heart", "image": "https://images.genius.com/65c3239dd2e63481c9fbb3b3eec607a1.1000x1000x1.jpg", "lyrics": "[Intro]\nThis track right here, is for the one\nNot the ones that think they the ones\nBut this is for the one, that knows she's the one\n& those ones that think they the one might think this the one about the one\nBut this is the one about the one that knows she's the one\n\n[Verse 1]\nAuthenticity lives deep within the words\nDreamin' of the sky, & she's sleeping with the birds\n& when she wakes up, she's prettier than ever, she don't ever need no make up\nEvery single night we conversate ,& we stay up 6 hours talking on the phone\nIt assures me when I look into your eyes I'm not alone\nShe's ain't trippin' on no facebook statues, or which girl that is\nShe trust me & I never ever dare to take advantage\nGrab me by my hand & she asked me if I knew Spanish\n& I told her Si, poquito mi amor. I'm not your average\nNot just my lover,you're my bestfriend\nMy pride & joy & I will never treat you less than\nWe both got a past but don't let it ruin our future\nThat beautiful voice is something I'm willing to get used to\nI mean, I ain't the type to have theses girls on the side\nBetter yet, I'm the type to keep that girl by my side\n\n[Chorus]\nShe said \"I love you to the moon & back\"\n& I replied, with a smile, \"I love you too, in fact.\"\nI have trust in me & you, baby don't ruin that\nSo , if I gave you my heart what would you do with that?\nShe said \"I love you to the moon & back\"\n& I replied, with a smile, \"I love you too, in fact.\"\n[I have trust in me & you, baby don't ruin that]\nSo , if I gave you my heart what would you do with that?\n\n[Verse 2]\nWhat would you do if I gave you my heart?\nWould you treat it with care or would you break it apart?\n& I know you got your guard up, you're just playing it smart\nCause you dealt with to many niggas just playing a part\nI appreciate all the times you were there for me\nEvery time I stressed out & we talked it's like therapy\nYou take the pain away with nothing but a sentence\nSo I'm wishing that this conversation's endless\nBut if not, let's make it last. Even when it's hard to smile you make me laugh\nEvery time I fucked up, you had the love to take me back\nLook, I know it's crazy but I think you're the one\nGot me thinking commitment, even raising a son hah\nYou know I'm playing wit you girl, don't get excited\nI mean any thing's possible just depends on the timing\nSo tell me when you're ready girl, I'll wait 'til the start\n& think about what you would do if I gave you my heart\n\n[Chorus]\nShe said \"I love you to the moon & back\"\n& I replied, with a smile, \"I love you too, in fact.\"\nI have trust in me & you, baby don't ruin that\nSo , if I gave you my heart what would you do with that?\nShe said \"I love you to the moon & back\"\n& I replied, with a smile, \"I love you too, in fact.\"\nI have trust in me & you, baby don't ruin that\nSo , if I gave you my heart what would you do with that?", "year": "2012-04-23"}]}