{"songs": [{"title": "Intro", "album": "Slime Avenue", "year": "2018-03-24", "image": "https://images.genius.com/07e73dacba335ef319597720044e7eea.640x640x1.jpg", "lyrics": "[Intro]\nAyy, where you get that beat from? Mooktoven!\nLong Live Baby Jace shit\nFly high\n\n[Verse]\nYeah, I thought it was over but nah it ain't over\nI got a choppa choppa on my shoulder\nI keep that blocka blocka, it's fully loaded\nYeah yeah yeah nigga get wicked\nCan't wait to fish tail in the Bentley\nBad lil' ho, yeah, she said her name Bridgette\nCan't smoke my blunt, can't roll, can't fix it\nYeah yeah Murder She Wrote\nMe and the draco got a beam with a scope\nA Glock with a dick inside of my coat\nShoot it like Jack In The Box then pop out and give 'em a show\nFor sure\nI rock with them slimes for sure\nI [?] in my pocket nigga, yeah, for sure\n[?] man you know how that go\nYeah you know how that go\nNigga don't give a nigga shit\nNigga want smoke cause I fucked on his bitch\nI ain't really trippin' nigga get his shit split, split\nYoung nigga came from a lick\nYoung nigga came from the bricks\nYeah I just came from your bitch\nPut them bitches and I'm finna' bend em\nAnd I'm bangin' blood, be with real niggas\nDon't give a fuck what you been through throw it up\nI just popped the seal, I pour that shit up\nGoin' back and forth, man I don't like to fuss\nThen pull up and bust, and bust\nDraco on draco on draco\nSlime gon' bust your potato\nChop up all his ass up like some play-doh\nAnd I got nat hoes all in Clayco\nThey diggin' my pimpin'\nColored roll did I mention?\nMean boy [?]\nNiggas wanna switch from foe\nCame a long way from holes in the clothes\nAnd I got hoes at the shows\nWon't bend won't break\nCan't take no hoe on a date\nI'm at the studio everyday\nAnd I just lost Lil Jace\nIt's somethin' I had to face\nHad to get away\nTold the mom don't even cry\nImma' gon' make this shit straight\nYeah Imma' gon' make somethin' shake\nWe gon' pull up in the wraith\nWish a nigga would\nPull up in they own fucking hood\nLeave a nigga dead in his hood\n[?]\n\n[Outro]\nHold on, hold on, Mook stop the fuckin' beat man..."}], "artist": "Lil Keed"}