{"artist": "Apathy", "songs": [{"title": "DJ Next [Nextclusive Barbeque Sauce Freestyle]", "image": "https://images.genius.com/90a78c5e81aab6cc017154aa5929c6ac.1000x985x1.jpg", "album": "It’s the Bootleg Muthafuckas! Vol. 1", "lyrics": "[Intro:]\nYo, DJ. Who the fuck is next?\n\nYea, Apathy of the Demigodz, my dick's bigger than yours motherfucker! (Yea, motherfucker) Straight outta Compton motherfucker. I'll fuckin'... (yo) shove a can of fuckin' beef stew up your ass and put a can opener down your throat an open that shit bitch. I ain't fuckin' wit y'all. Yo, Apathy of the Demigodz, uh. DJ Next. What the fuck y'all want? Yo, yo, yo\n\n[Verse 1: Apathy]\nMy style's enormous, knock the planet off it's balanced orbit\nI'm takin' out the trash like I get allowance for it\nMy brain's processin' data, deep knowledge analyst\nGettin' paid like liquor stores on college campuses\nBrain cells swell like the flames hell contains\nMy shit's goin' gold like Nintendo Zelda games\nIf y'all try to step to me I'm lookin at you skeptically\nYou probably won't get far like a retard on Jeopardy\nYou want to spark beef then you better call a truce\nOr you'll fall of like Bishop in the last scene of Juice\nAnd I don't give a fuck what you're doin' to the beats\nY'all could never burn me like Lucifer at the beach\n(I'm too hot) And even if I die from Glock shots\nCats won't believe I'm really dead like 2Pac\nI'm hidin' out in Boston, they'll dig up my coffin\nAnd bug when they find it's the body of Andy Kaufman\n\n[Hook]\nHave no fear, prepare for the exclusive\nHave no fear, prepare for the exclusive\n\n[Verse 2: Romen Rok]\nWell it's the funky girl gettin' GQ, keepin' it cool\nWith that whip hit rap shit turnin' my lips blue\nFuck the cheeseburgers I brought the brew to the barbeque\nAnd we ain't gonna stop drinkin' 'til the cops come through\n(You and what crew?) Funk on the fleet, Rudolph style\nWith the Gray Clouds Lounge, home of the upside down smile\nKeep the crowd loud like the muffler on a Harley\nMy favorite video game is Yars Revenge on Atari\nI catch a lot of kisses, handshakes, and support\nI'm creative like a kid with a box of sidewalk chalk\nWe cause more racket then a wooden roller coaster\nMC's with chips on they shoulder get bulldozed over\nPeace to DJ Next to Alius and Ap\nWho never walk on stage without skrilla and dap\nAnd to all your sour patch crappy cardboard blues\nHere's a stone cold Steve Austin double-fisted fuck you!\n\n[Hook]\nHave no fear, prepare for the exclusive\nHave no fear, prepare for the exclusive\n\n[Verse 3: Alius]\nLet the cop play bitch, Alius game sick\nCall me Dr. Naismith, treat y'all to plain basics\nEquation to be blazin', science of rhymin'\nForgot them platinum dreams when I heard about diamond\nI'm in the zone, with every weight of my own off the dome\nRock with Ap and Romen 'til the cops come home, it gets ugly\nLet the industry love me, refuse to let 'em fuck me\nTry to crack black, I snap back quicker than a bungee\nI'm that Coach Tony Dungy, controllin' your Buccaneers\nLike drity sluts and beers, I'm what's gettin' fucked in here\nI'll bust a nut in ya ear, impregnatin' your thoughts\nLeft alone to raise my brain child, no ounce of support\nThen i'm vacatin' to spark, my verbal journals are to fertile\nGettin' gear like a gerbil before my squad has to herb you\nHaters on my dick so bad their mouths look like milk commercials\n(Gulp) Y'all got milk?", "year": "2003-09-23"}]}