{"artist": "King Los", "songs": [{"image": "https://images.genius.com/972fc6073ad82206821cfe0b1481f17e.320x320x1.jpg", "title": "King Los", "year": null, "album": "The Crown Ain’t Safe ", "lyrics": "[Hook]\nKing los, king los, bow down, kiss a nigga rings ho\nBeen knocked down, hated on, bitch I still did my thing though [x2]\nI thank the lord every breath I take\nEvery step I make, im going on for this song, nigga wishing thats my fate\nThats why I go go way too hard, they say I go go way too hard, go go way too hard\n\n[Verse 1]\nYo, rap on shit nobody go hard, I dont need nobody\nI body whole squads\nI bury niggas on the dark side of the moon\nTill the sun come up and throw a party on mars\nIm outta this world outta my mind, stuck at the bottom thinking\nHow do I climb, how do I climb?, Fuck I sound to get up I turn this bitch upside down\nCause I get down to get up, sit down do sit ups\nSit up do push ups push ups to lay back\nSo I make money do cruches\nSo you hate my guts when I pull up the maybach\nHoney said she ain't never seen a guy thorough\nSo I got it on strength like a bicep curl\nHopped out the pussy like I gotta murk it out\nSorry baby girl, itll never work out, get it?\nSnapback, custom made fitted's\nShitted on ever spectator every critic midgets never seen one quite fly\nYou a pint size guy to a giant like I, digits\nI throw them in the bank\nBitches planking on the dick like they throwing in the anchor, her, er, and you too\nIt ain't all about the rappers\n\n[Hook]\n\n[Verse 2]\nTheyll never make another me\nI dont even need half of me to make another you\nI'm coming for number one, so shitting on niggas is the only way you ever see me taking number two\nIm back like vertabrae\nNigga stop fronting, you ain't even really got the guts for this\nBetter man up nigga, im a stand up nigga\nBack rosa parks woulda got up for this, cause I get down to get up\nNever put the pen down to give up\nNow a nigga pin down the pin up it feel like I been up\nAnd yall niggas stuggling so when I pull up I betta feel like a chin up\nDown, then up, down again and im so nice I put down the pen\nThink you wanna battle, you wanna say yes\nDont push up if you dont wanna play chess get it?\nWear air j's ever digit and im the rap game\nLos destorying ever nigga dont knock on a door when ya boy in the kitchen probably mention\nIm something and the rock ain't cooking\nSki mask in the booth hope the cops ain't looking\nTell me god ain't smiling nigga spot ain't took it\nMy pa staying proud these niggas stay lying\nI was born in the jungle man these niggas ain't lions\n\n[Hook]\n\n[Verse 3: Lola Monroe]\nQueen Bossette cause I run shit, I stay dumb slick fly, tell a bum bitch bye\nWanna come trick, why, you ain't built like that\nYou gonna fuck and get killed like that\nOle back of the race looking bitch ole wack ass drag in the face looking bitch\nOle half ass\nNo swag having ass\nHo ass slow ass\nLast of the apes looking bitch\nYou're styled played out like manolo boots\nWe taking headshots welcome to the photoshoot\nIll wipe this bitch! Who hype this bitch?\nMake me put a ho down like Mike Vick pit\nBetcha life get hit like a 10 car crash\nYou dont really want it though send me all trash im from garfield\nWhere they known to skill all rats\nAnd ride of white boy like Kim Kardash\nGet it?\nChristian Louboutins when I pivot\nIts so gross how you broke bitches in a Civic I did it\nIm good shit, the hoods big ticket\nGet off my lolipop if you ain't gonna lick it\nIm wicked, your money like Beckham, let's kick it\nKnow of ya'll bitches wanna step in my district\nSay I ain't the truth and these bitches ain't lying!\nI was born in the jungle these bitches ain't lions\nI'm Queen Roe, Queen Roe\n\n[Hook]"}]}