{"artist": "A$AP Ferg", "songs": [{"title": "East Coast REMIX", "image": "https://images.genius.com/2ca86b22f79d45ce68d7bf388cb5320b.600x600x1.jpg", "album": "Still Striving", "lyrics": "[Intro: A$AP Ferg & Busta Rhymes]\nRun it up, run it up, run it up, run it up (Remix)\nFuck that shit, we get turnt 'til the sun is up\nAll of you niggas get burnt when the gun is up\nThis that East Coast motherfucker\nCall me Mr. East Coast motherfucker\nLet me give them a friendly reminder real quick, yo\n\n[Verse 1: Busta Rhymes]\nY'all already know the god gotta talk\nEvery single time I come you niggas know I gotta do it\nYes I gotta do it and I gotta kill 'em and I gotta hit 'em\nYes you know a nigga gotta beat 'em stupid\nOnly got 41 seconds just to give a nigga shit\nEvery second bitch I gotta use it\nSomewhat a nigga blew it and I cannot\nGrab the microphone and not make a motherfucker lose it\nAnd I make niggas jump in the back\nNiggas up, she in the back of the truck\nLil' mommy wanna fuck and she really wanna suck\nWhen I finish with it then we go in the back of the club\nAnd we do this shit again my nigga, pronto\nBip-de-badda-de-booda-de-beat it like a bongo\nBanging on the pussy like a nigga named Alonzo\nHead game crazy, that make her the head honcho\nMad cause I took his bitch and now he thinks he macho?\nSomebody better call the cops yo\n'Fore we run up inside of that nigga's lil' condo\nPut him in a box so the nigga in a cargo (Cargo? CARGO!)\nShut a nigga down (fake bitch)\nThrow a bottle at ya, shut a nigga mouth (Break shit)\nCome and follow me, stand up on the couch (Shake shit)\nLet us wallow, niggas know we're in the house (Trey fifth)\nEast Coast nigga!\n\n[Verse 2: A$AP Ferg]\n10031 is where my zip is\nLive in Har-ar-lem, up in the trenches\nRun through a bodega like I ain't got riches\nRun through a bodega like I ain't got (Come on)\nDon't do it for the haters, I do it for the bitches\nMy flow Al-Qaeda, I kill rap niggas\nY'all Now and Laters, sweet ass-niggas\nSoon as you get famous, they wanna ass-kiss (Muah)\nOnly thing that I'm missing is Hov verse (JAY-Z)\nI get a feeling, they want the old Ferg\n\"Cocaine Castle\", \"Hood Pope\" Ferg\nGot a question to ask you: do you know Ferg?\nDo you know that I come from where the toast burn?\nNew York, New York, 143rd\nOn Hungry Ham up on the corner\nFiends gangster lean, they never sober\nFrom being in the streets to run a culture\nI never been in the weave, I had hoes, bruh\nWho's that jiggy motherfucker with the clothes, bruh?\nI'm finna kill these motherfuckers with the flow, bruh\nI'm the best in the game with the flow, bruh\nIn New York I Milly Rock to \"Magnolia\"\nI love the East but shoutout to every coast, bruh\nSouth to North and even West Coast, bruh\n\n[Verse 3: A$AP Rocky]\nBlackin' like I'm fresh up out retirement, my flow still monumental\nMental, couldn't ride an instrumental but they ridin' dick\nI set the standards for requirements, so call the firemen\nJust me, myself and I, the world is mine, I put the \"I\" in his\nHis posse too clean (Ayy), his diamonds like TIP (Ayy)\nHis skin too clear (Ayy), his bitch gon' stare (Ayy)\nSo mind your biz, how they find the time for minding mine\nI find these college chicks for top with Kylie's lips\nOh my, oh my (Run it)\nRun it, run it like you want it (Run it)\nRun it, run it like you stole it (Run it)\nRunning, running like I'm going (Woo!)\nRunning, pitching like I'm bowling (Woo!)\nIn my city, gangs run the inner city\nLoad a semi for the chiddy bang\nFlacko, Fergie, Frenchie with the bitties\nHit up Remy for the pretty gang\n\n[Verse 4: Dave East]\nLately I feel like a Beatle\nI'm Paulie McCartney just rocking Moschino\nMoscato or Pinot\nI got some bitches to hop in the Regal\nPhenomenal deep throat\nI'm more Ali than Muhammad\nMy noodles was Ramen, go Google my diamonds\nI got some shooters in college\nI feel like a coach, I'm recruiting and signing\nLook, I still be moving in silence\nI'm ballin' in blue like I'm hooping in Dallas (Ballin'!)\nBitch I don't play for no Mavericks\nYou need to think who gon' pay for your casket\nIgnorant bastard\nBut I'm still conscious enough to give hope to the masses\nWatch the coke do gymnastics\nDominique Dawes, foreign my car when I'm mashin'\n\n[Verse 5: French Montana]\nChain busting it down, wrist busting it down\nYour bitch busting it down, Rap game I'm fucking it now\nI could be a jeweler, neck that's Slick the Ruler\nYou niggas is comedy, talking fast like Bone Thugs-N-Harmony\nKRS-One, Big L flows, son of a gun with the Buffalo\nHead on my wrist is a P1, made more money than E1 (1!)\nOne time Chinx, two time Yams (Yams)\nGet the money, slide like a violin (Violin)\nYou know my nigga Max almost home? (Hanh)\nYou know who run the East Coast zone nigga?\n\n[Verse 6: Rick Ross]\nIn the kitchen, culinary, I could whip a Bloody Mary\nAnd I wish that blood would dead me, I'ma get ya brother buried\nGangbanging with your halo, business on the payphone\nBitches pussies drying up, like Taz's Angels\nNever was a client, 'cause that boy ain't buying it\nAnd I got a bottom bitch, my top come on consignment\nStep up from the minor league, double M the dynasty\nNo, I never sold dope, I just got me a finder's fee\nFollowing my frequency, niggas rapping week to week\nSuckers be so weak to me, text, but don't speak to me\nYou can never speak for me, see the B.I. chemistry\nCheck into the crazy house, I'ma turn the labels out\n\n[Chorus: A$AP Ferg]\nRun it up, run it up, run it up, run it up\nRun it up, run it up, run it up, run it up (Remix)\nFuck that shit, we get turnt 'til the sun is up\nAll of you niggas get burnt when the gun is up\nThis that East Coast motherfucker\nBut I know this West Coast (Snoop Dogg!)\n\n[Verse 7: Snoop Dogg]\n10/20 was my date of birth, the day I came to Earth\nBottle-sipping, love to burp, young nigga that's doing dirt\nLong Beach across my shirt, all y'all niggas gon' get merked\nWhat the fuck is you talkin' bout?\nMe and Ferg, we gon put in work\nBang on ya' gang culture, out of this world\nIt's all on a bitch, is she a Blood? Is she a Crip?\nDon't slip, think not, on the block where it's hot\nLegalize with the nines, give a fuck about a cop\nReal shit, this is it, from the bottom to the Bay\nThis is anybody K, California all day\nYes-sir, on the curb, Mossberg by the van\nLittle homies on the roof with the blam, blam, blam!\nLong Beach, popping pill on 'em\nI been working so hard, nigga, get your bale on\nI been working so hard, nigga, work to sell somethin'\nI been working so hard, welcome to the hellzone, zone, zone\n\n[Chorus: A$AP Ferg & Snoop Dogg]\nSee I'm from Long Beach\nRun it up, run it up, run it up, run it up\nRun it up, run it up, run it up, run it up (Remix)\nSee I'm from Long Beach\nFuck that shit, we get turnt 'til the sun is up\nAll of you niggas get burnt when the gun is up\nSee I'm from Long Beach\nThis that East Coast motherfucker\nCalifornia motherfucker, see I'm from Long Beach\nCall me Mr. East Coast motherfucker\nWest Coast", "year": "2017-08-04"}]}