{"artist": "Pusha T", "songs": [{"album": null, "title": "Millions - live from spotify sxsw 2014", "image": "https://images.genius.com/66e8896c8c1bb069880e68e1abc3f74f.900x900x1.jpg", "lyrics": "[Intro: Pusha T]\nYou know what happens when G. O. O. D. Music and mmg get together right?\nWe get that money\n\n[Hook x2: Pusha T]\nMillions, Millions in the ceiling\nMillions, Millions in the ceiling\nMillions, Millions in the ceiling\nMillions, Millions in the ceiling\nChoppers, choppers in the closet\nChoppers, choppers in the closet\nChoppers, choppers in the closet\nChoppers, choppers in the closet\n\n[Verse 1: Pusha T]\nThis that shit that ya’ll wanted?\nThis shit cook up hard don't it?\nYall gotta beg my pardon on it\nBut this shit sound like God don't it? (yeaah)\nI'm tired and yall gotta pay your ties\nCall my Phantom the Holy Ghost\nChurch on chrome wheel tires\nPop a tags when I'm paranoid\nCause a pawn shop was my paradise\nI was there pop when that powder came\nFor that not safe in that shoe box\nBlue tops, blue tops, bad bitch in that blue fox\nThis big face and blue-ray and these black diamonds like boondocks\n\n[Bridge: Pusha T]\nI restore the feeling of when niggas made a killin’\nHiding choppers in the closet half a million in the ceiling\nAnd them niggas with angel faces cryin’ out with I'll intentions\nAnd just so I can buy them Christians have em fuck it on all their bitches ah!\n\n[Hook:]\n\n[Verse 2: Rick Ross]\nI'm honored by horror stories, wanna be home owners\nHorrible outcome with the boy got one motive\nPrize when he conficted, pride on every visit\nI'm crying sayin his name, ride for all my niggas\nUsed to fiddle my fingers, until I found me a fortune\nFinger fuckin Ferrari’s, South of France early mornin\nGet drunk with Donatello, Versace, my Acapella\nNever see me in Neimans, nigga commiting treason\nSoft loafer prefered, frost organic herb\nStay away from the forbes of our only can tell you more\nI got this I got that\nI got that, I got this\nGot a kilo for twenty\nMy niggas say I'm the shit\n\n[Hook:]\n\n[Verse 3: Pusha T]\nThis that shit ya’ll ask for\nMake a nigga on the gas floor\n2- door, 4-door, roll through the hood like task force\nFast forward, Oops! They say they wanna see proof\nMy record sells ain't much as theirs and we still ridin same coupes\nHow we still fuckin same hoe?\nHow we still buy the same clothes?\nHow we both got the same watch?\nI’m just keepin ya’ll on your toes\nDope boys, gold mind\nThat price drop and that Coke rise\nThen set it over that blue flame\nThen hang to dry like clothes line\n\n[Bridge: Pusha T]\nI restore the feeling of when niggas made a killin’\nHiding choppers in the closet half a million in the ceiling\nGot the razor on the counter Arm-N- Hammer in the kitchen\nJust to keep my feet in Christians and keep fuckin all your bitches, aaah!\n\n[Hook:]", "year": null}]}