{"songs": [{"year": null, "album": "It’s a Beautiful Thing", "image": "https://images.genius.com/a38241df710942558e84bde3f2e0774b.804x800x1.jpg", "title": "Radio", "lyrics": "\"word\"- Slick Rick\n\nIntro:\nRock on. All my peoples up top rock on. All my peoples down low rock on. All\nMy peoples on the left rock on. All my peoples on the right. Word up. Def\nSquad rock on\n\nVerse 1:\nWell it's the supersonical ginintonical\nAsk your chronicles splatter crews all you hear is ahh and ouhs\nTime to face the music bring you down to Earth like Poppa Smurf\nI'm worldwide like on the web in your turf\nWith full fledge rap pack with anxiety attacks\nFor those that thought I wouldn't be back\nWith that bone chillin' horror killin' all on goin' drama\nSave the rah rah for your mama\nBragadoshis prone to static\nCome through the jam and wreck the mic by force of habit\nTantalizin' make you feel good like cryin'\nI can't be dissed so you can stop tryin'\nAnd Keith Murray will prevail\nSo you can eat a shit sandwich and go to hell\n\nHook:\nI got the skunky funky illest funk flow\nFor the glamorous scandalous world of radio\n\"now this song is from all of us to all of them\" (x2)\n\nVerse 2:\nYo I throw the beat up in the cobra clutch\nHit it with the Midas touch\nDig up in the mic just like a gold rush\nNever ran never felt the need to run\nThey know not to come cause they all get some\nI'm still fabulous still mackadoshis\nMy dj still cut it the closest\nSo who's an error when's a never?\nI melt through your butter leather\nAnd then I splatter through your Gucci sweater\nDeep as a river in a ragin' flood\nI come with open arms showin' nothin' but love\nComin' less than zero modern day hero\nDeliver hot shit just like Dominos\nKeep it movin' or get it on\nCause money talks and bullshit runs the marathon word is bond\nNon stoppin' mic shockin' bottles poppin'\nWord up son you we keep it rockin'\n\nHook\n\nVerse 3:\nI'm like a character and my life is a movie\nGroupies step to me\nDo me\nTry to sue me\nBecause I make a record got money in a car\nI'm a star?\nNaw naw naw that's bullshit paw\nIn the black range look ya never ever worry\nParked in the front I hear voices sayin' \"That's Keith Murray\"\nThe name of the game is fame\nYou know the price you recognize the God like Christ\nMasses of posses packed up schemin'\nLadies love me they keep on screamin'\nExpressin' all the feelin' of the world today\nSome might listen to my music and try to say\nNothin' other than \"Yo this shit is dope\"\nAnd in the everyday life struggle Murray goes for broke\nFrom day to day month to month year to year\nI swear I tear any mic any stage anywhere\nI be the standards of which excellence is measured\nSo for me to rock all day it'll be my pleasure\n\nHook"}], "artist": "Keith Murray"}