{"songs": [{"title": "The Hot Seat Freestyle", "album": null, "year": "2014-10-29", "image": "https://images.genius.com/a3d25d0210e13494897cca2f0441ba4c.1000x1000x1.jpg", "lyrics": "[Intro Lil Dicky & DJ Greg Nitty]\nOh\n(Greg Nitty!)\nThis is the first time I ever rapped on the radio, I just want you to know that\n(Okay, let's go)\nJust know it\n(L-Let's go in)\n\n[Verse 1]\nI don't know the definition, fuck is average?\nI've been sitting, watching Waiters\nSo impatient like it's baggage claim\nI'm 'bout to be the greatest, naked pictures in my chat\nThese other rappers fucking lazy, word to banging in a hammock\nY'all ain't even hanging\nY'all ain't in the running boy\nI'm fucking up the track, like the youngin' in the runnin'\nY'all are lighter with the fire, I won a match\nHe be like \"Naw I'm bout it bro\", how you get at that?\nThese bitches tryna rap, they don't get they time rappin'\nI'm coming\nLike I'm fucking, they Underwood and to be Frank I ain't frontin'\nWord to Kevin Spacey\nOn another level debatably crazier\nThe shit they play beside the porn that you playin'\nAt a matinee eatin' Dippin' Dots, getting checks\nFuck I care that my Twitter not... I care a little bit\nAlgorithm isn't doin' it's job, assumin' it's flawed\nThey probably not believin' the Hobbes\nThe nice boy been ballin', white boy been a dank King, Scot Pollard\nGotta tell my mom \"Stop calling\", but dog\nConfused about my destiny\nMaking me repeat myself like I was judging spelling bees but\nI'm just tryna smoke weed, grab a quesarito\nGot azul by a Spanish chick, muy bonito\nOr bonita, that's my vita\nKeep the rapping type both ways, dexterous, where my rita?\nAnd when it's y'all it's a nice sound\nWhen it's me it be like \"Everybody pipe down\"\nY'all the background, play your part ho\nChex Mix, grubbin' up at Wells Fargo\nHad to make a new account, did 'em with the checks mix\nY'all are tryna fit in, I'm the one who playin' Tetris\nThis is the beginning of my day, it's breakfast\nY'all the minibars, y'all got mini bars\nWalk up in this bitch like I was born bread\nGoing deeper with this spitting, like some porn head\nPicture every rapper laying on the floor dead\nWhile I'm in a chair, cross legged, eating cornbread\nI just fucked a black chick\nYeah I'm proud, if that's racist suck a black dick\nI'm the one going straight to the top\nDon't mistake it, it's not that flagrant when you blatantly flop\nI stay down, like my date gown in this bitch\nI'm bout to hit the playground, straight clown all these kids\nWatching ladybugs with your lady, got it made like that\nCleaning house like a maid might rap\nDon't play with you lame type cats\nSame shit for days, motherfucker, if you cold I got flames\nY'all the ice caps\nI bet money y'all don't even know about the ice caps\nI don't know that much either tho, 'bout the ice caps\n\n[Intermission]\n\n[Intro Lil Dicky & DJ Greg Nitty]\nUh, ooh\nL...D\nYuh, ey\n(This is Part 2. Yo talk to 'em man)\nUh, sure\n\n[Verse 2]\nWe can start with the rap\nFlowing like malls, like \"Ah there's a Gap\"\nGo in my call logs, dogs wanna chat\nBig dogs\nMissed calls\nLot of motherfuckers in the league know L\nAnd I just had brunch with Embiid and Noel\nAnd I just got fucked and was sucked by a dumb slut\nUsually I like 'em Ivy League, oh well\nSummer camp, I've been going H.A.M\nYoung man with that choppa'\nThat's rifelry, I like movies, I'm going H.A.M. for that Oscar\nI'm way far on their radar, like they know I'm comin', that's Doppler\nThey borin' to me, that's opera, I'm scorin' beauties, that's soccer\nMe and Jonah Hill smoked\nThen we talkin' shit 'bout how the rest of y'all blow\nThen we take a dip up in his pool, pretty cool\nNot the pool, shit is hot\nJust a view from the spot, shit is hot\nBunch of blonde bitches laughing all night\nMe and Busta Rhymes meet in Venice for a bite\nTalking shit about a comedy scene, the shit is so light he tell me\nCan't disagree, get it right he tell me, I mean\nI thought by now he can see that I'm witty\nDown in L.A. I been running the city\nAsk anybody in music or film who got next in this bitch\nAnd they all sayin' \"Dicky\"\nI just do it like it's nothin' to it\nLife getting pretty sweet like I fondue it\nI'm killing bitches in my lane on some T. Stewart\nAnd I've been scoring prevent, yeah the dime blew it\nI'm the man, bro\nI don't really care what the fuck you think\nAnd my steak look rare, but I grub that pink\nAnd the grundle stink\nAnd I bump NSYNC\nDon't suck dick, but I blow that good\nDon't want shit, but a ho that would\nLemme hold that, ben and fold that\nGet a Kodak, Cowboy, Jerry Jones that, lemme own that\nFuck that girl\nI got hair, never cut them curls\nAnd it's truth or dare, with a cute au pair\nGet a room to share, hit a boom, Pat Burrell\nSpit that turd, that's that shit\nYo girl up on my dick\nI'm 'bout to sperm up on them hips\nDon't want to murder us a kid\nOh shit, what you say?\nDon't you do this everyday?\nDon't you usually go with double meat when you eat Chipotle?\nDon't your crew lack someone black, but you want one to hang?\nNo slave\nI heard your boo got so much back\nShe bangin' that Notre Dame clock\nI'm faded tho\nFucking bitches you'd label undatable\nMissing birthdays, ay belated, bruh\nNaked out in San Fran on that roof top\nTan cans, no tube top\nI'm the motherfucking man, god damn\nAnd these motherfucking bitches full of shit like zoo mops"}], "artist": "Lil Dicky"}