{"songs": [{"image": "https://images.genius.com/1e9d47cc7d2d89c839c4ec32d0815a5e.929x929x1.jpg", "lyrics": "[Hook]:\nBiggie and Jay two of the greatest\nWhat we tryna figure out is who is the greatest?\nWho was Mike Tyson in his prime?\nWho was Michael Jackson, Michael Jordan with the rhymes?\nI’m talking bout the best of the best\nWho the greatest of all time?\nI’m talking bout the best of the best\nWho the greatest of all time?\n\n[Verse 1]:\nFirst it was Nas, then it was Biggie\nThen Big got killed and Jay start running the city\nIf Big was here how big would Jay be?\nYou know how many people talk about that daily?\nThey be like “you know Jigga\nHe a hustler if Big was here he’d be bigger”\nOther niggas be like “Nah kid!\nHe wouldn’t be that big cause he was second to Big!”\nHe might still be doing his thing, but not that big\nJust Big still would’ve been King\nWould he have came at Big like he came at Nas?\nOh what’s the big difference between Biggie and Nas?\nSee rap is competitive this shit is a sport\nAnd Jay knew there could only be one King of New York\nImagine that: Biggie vs Jay\nI mean Brooklyn would have won either way\n\n[Hook]\n\n[Verse 2]:\nIf Big was here, how big would Jay be?\nYou know how many people talk about that daily?\nI’m cool with Jay, but I never met Big\nYou think he woulda had that run like Jay did?\nOr would Jay have had that run if they ain't kill Big?\nThe answers to them questions we’ll never know kid\nI know they slept on Reasonable Doubt\nReason being at the time they was Biggie’d out\nBig and Diddy was running the town\nJay was doing his thing but he was underground\nBut Big knew Jay was that nigga\nJust like Jay knew Big was that nigga\nWould Big have got better if he was still alive?\nOr would he have fell off like the nigga Nas?\nAnd I’m not tryna shit on Nas\nTrust me I know I ain't got shit on Nas!\nBut first Big took the crown from him\nAnd then Jay took the crown from him\nBecause when Big died the crown went back to Nas\nJay was like “fuck that that shit supposed to be mine.”\nDropped Takeover then took over\nThat’s when the Garden started to book Hova\nAnd I’m not tryna shit on Nas\nTrust me I know I ain't got shit on Nas!\n\n[Hook]", "title": "Big vs Jay", "year": null, "album": null}], "artist": "Uncle Murda"}