{"songs": [{"image": "https://images.genius.com/a43c6474feffd9d9f0cdd3873fa9c774.300x300x1.jpg", "lyrics": "[Refrain]\nDem-dem-dem-free-freekdem\nDem-dem-dem-free-free-dem\n\n[Verse 1]\nI’m so tangy, people call me Mathangi\nGoddess of word, bitches I’mma keep it banging\nTruth is like a rotten tooth, you gotta spit it out!\nLet the bottom two, let my wisdom work it out\nBig on the underground, can’t knock me down\nVicki Leekx bitches, back by dope demand\nI sleep on my talent and I stand by it too\nI can say lots with a little words or few like\nLike Adam had 'em, yeh, me, the madame\nYeah I’ll introduce you to the dooms do dooms\nCome let we go, do you like my perfumes?\nMade it at home with some gasoline and shrooms\nOil and water are two extremes\nWe like fucking carpets, you fucking brooms\nWhy is your tattoo some ugly looking thing?\nI got many designs they're downloading on Bing\nMy cousin got his G.C.S.E.'s decorating\nHe’s handy you might need him when I finish what I’m saying\nLet's be frank, you my stan, I'm your stan\nI don’t care what you smoke, what you fucking drank\nI'm allowed to be pissed at mates who are yanks\nCause it’s not me and you, it's the fucking banks!\n\n[Hook]\nBring the noise when we run upon them!\nBring the noise when we run upon them!\nBring the noise when we run upon them!\nBring the noise when we run upon them!\n\n[Refrain]\nDem-dem-dem-free-freekdem\nDem-dem-dem-free-free-dem\n\n[Verse 2]\nTruth is like a rotten tooth, you gotta spit it out\nI left the bottom two, let my wisdom work it out\nThe world is ours, send your soldier powers\nThese words I announce, hope you heard 'em like cows\nAlpha Kenny buddy, Roger, Charlie, and Rich\nBitch, my swag bitches, but you can’t touch this\nSo click, click, click, please get off my dick\nJust ‘cause I know more don’t make me thick\nI'm a overweight, heavyweight, female Slick Rick\nIf you need the trees then my shits got stick\nI got bug spray, bucket, stick\nTons of the fun stuff, tons and tons of it\n\n[Hook]\nBring the noise when we run upon them!\nBring the noise when we run upon them!\nBring the noise when we run upon them!\nBring the noise when we run upon them!\n\n[Refrain]\nDem-dem-dem-free-freekdem\nDem-dem-dem-free-free-dem\n\n[Verse 3]\nMy nan was a stan for imported liquor brands\n72 bottles at her birthday got drank\nI must say people I got her to freaking thank\nI'm a party fucking animal, if you ain't, scram!\nMy uncle jumped a boat, it took him to Iran\nWhat started as a life now it got him banned\nSo I came in a hurry, not a white van\nLearnt that Sam, Ram, Chan, are the same man\nCorrugated iron wooden shacks\nGated mansions next to XX\nBoys on motor bikes next to Maybachs\nWe got backpacks next to cats from Kyzack\nEx-convicts and diplomats\nRapper and Russians who don't pay tax\nThese cards are stacked and this is out crack\nRewind, pull it, and bring it all back\n\n[Hook]\nBring the noise when we run upon them!\nBring the noise when we run upon them!\nBring the noise when we run upon them!\nBring the noise when we run upon them!\n\n[Refrain]\nDem-dem-dem-free-freekdem\nDem-dem-dem-free-free-dem\n\n[Outro]\nFreedom’s just another word\nChoose\nNothing left to lose\nChoose\nFreedom’s just another word\nChoose\nNothing left to lose\nChoose\nFreedom’s just another word\nChoose\nNothing left to lose", "year": "2013-11-05", "album": "Matangi", "title": "Bring The Noize"}], "artist": "M.I.A."}