{"songs": [{"album": "#3Tay-K47", "image": "https://images.genius.com/7df1200715e32e2ae7579a50eb7196fa.718x718x1.png", "year": "2017-06-15", "title": "The Race", "lyrics": "[Intro]\nI-I-I'm Lil Tay-K, I don't think you want no action (Gang, gang)\nYou want action, you get turned into past tense (In the past)\nYour boys deep? Well, let's get to subtractin' (Pow, pow)\nSmith & Wesson made my 9 with some compassion (Skrrt, skrrt)\n\n[Chorus]\nFu-fu-fuck a beat, I was tryna beat a case (Gang, gang)\nBut I ain't beat that case, bitch, I did the race (Skrrt, skrrt)\nBeat it up, where I nut? Shorty face (Lil bitch)\nEli blast crackin' 4s like a vase (Gang)\nPop a nigga then I go out my way (Skrrt)\nDo the dash then I go out the way\nRo-ro-rob a nigga shoes, rob a nigga lace (Gimme that shit, nigga)\nWe tryna see a hunnit bands in our face\n\n[Verse]\nPimp gon' be eatin' good noodles every day (Free Pimp)\nBitch, I'm drawin' doodles, Tay-K, paint the way (You're a simp)\nChoppa tear your dudies into fish fillet (Lil bitch)\nI-I-I woke up too moody, who gon' die today? (Skrrt)\nShoot a fuckboy in his mothafuckin' face (Grrah, grrah)\nWe-we-we cookin' up, boy, you don't wanna go dat way (Dat way, dat way)\nGotta go dat way, you get robbed for your rackades (Rackades, rackades)\nGotta go dat way, boy, you not gon' be happy (Hahaha)\nI-I-I tote 50s, I'm a shooter like Young Pappy (Pew)\nBitch try to rob, we make her dance, Michael Jackson (Skrrt)\nWe was plottin', y'all was tryna get the pack in (Lil bitch)\nGet the pack in, you get robbed for a fraction (Gimme that shit)\nI-I-I'm Lil Tay-K, I don't think you want no action\nYou want action, you get turned into past tense\nYour boys deep? Well, let's get to subtractin'\nSmith & Wesson made my 9 with subcompaction\n\n[Chorus]\nFu-fu-fuck a beat, I was tryna beat a case\nBut I ain't beat that case, bitch, I did the race (Skrrt, skrrt)\nBeat it up, where I nut? Shorty face (Gang, gang)\nEli blast crackin' 4s like a vase\nPop a nigga then I go out my way (Grra, grra)\nDo the dash then I go out the way\nRo-ro-rob a nigga shoes, rob a nigga lace (Gimme that shit, nigga)\nWe tryna see a hunnit bands in our face\nFu-fu-fuck a beat, I was tryna beat a case (Gang, gang)\nBut I ain't beat that case, bitch, I did the race (Skrrt, skrrt)\nBeat it up, where I nut? Shorty face (Lil bitch)\nEli blast crackin' 4s like a vase (Gang)\nPop a nigga then I go out my way (Skrrt)\nDo the dash then I go out the way\nRo-ro-rob a nigga shoes, rob a nigga lace (Gimme that shit, nigga)\nWe tryna see a hunnit bands in our face\n\n\n[Outro]\nSee it in my mothafuckin' face"}], "artist": "Tay-K"}