{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f1ce17fdad92806e2e9b19241838f42f.1000x1000x1.jpg", "title": "JoJo’s Chillin’", "year": "2012-05-15", "album": "R.A.P. Music", "lyrics": "[Intro: Killer Mike]\nThis album was created entirely by Jaime and Mike\n\n[Verse 1: Killer Mike]\nMy man JoJo got a caught on fed photo\nSo he gotta get out of Atlanta hit SoHo\nBaby mama say he been selfish, he like \"so ho?\"\nThen he picked up the cell phone called his old ho\nShe took him to the airport, hit him with some bread\nParked in the deck, then hit him with some head\nHit the counter with the fake ID and the ticket\nThe old man little suspicious but he hit him with a fifty\nHit him with a hundred, hit him with the \"Shhh...\"\nThe old man stamped the ticket and he went like \"Shhh...\"\nThen he hit him with the smile, and he hit him with the wink\nAnd JoJo hit the bathroom, JoJo hit the sink\nCold water, had to splash on the face\nHis iPod pumping Snoop \"Murder was the Case\"\nOh shit, looked to his left, Ghostface\n\"Peace God, Peace God, where's Shallah Rae?\"\n\"Think he had show down in M.I.A today\"\nGhost told him \"nice Wallies\" then went out on his way\nNow it's back to reality, reality say:\nStill gotta make it to that side of the gate\nHe moves out the bathroom quickly with haste\nAnd it's a long line, it's a while before the gates\nAnd it's an old lady giving Jo the evil eye\nMad cause she see him cutting spaces in line\n\n[Hook]\nJoJo's Chillin'\n\n[Verse 2: Killer Mike]\nBack in line JoJo spot Ivy\nGirl from the hood that he knew from NYC\nTSA agent so she cleared him on the ID\nBefore he go through X-ray he taking off his shades\nTaking off his jacket, arm out the sleeve\nReached in his pocket, oh shit got weed\nHe done made it this far, whats Jo to do?\nSo he stuffed it in his pocket\nAnd he walked right through (He walked right through?)\nHe walked right through\nThen the TSA agent say \"She pointing at you.\"\nThe old lady that had seen Jo cut line\nWent to a officer and tried to drop dime\nBut Ivy wasn't having that, stepped to the copper\nTold him that the old lady's ID wasn't proper\nNow the old lady getting treated like a terrorist\nCop got his hand where her grey pubic hair it is\nAfter this though she gonna have to see a therapist\nJoJo found the situation hilarious\nThrew the old lady's deuces, heading to the train\nConcourse A, headed to his plane\nArrived on time, they called the first class\nUpgraded ticket took a little more cash\nJo's relieved, hes almost free\nCan't wait to land in the NYC\n\n[Hook]\n\n[Verse 3: Killer Mike]\nSeat belts on, seat back up\nTriple shot of Seagram's in JoJo's cup\nA little too much he felt the stewardess up\nShe said \"Stop, sir!\", he looks like \"What?\"\nGave a big tip then he headed to the bathroom\nWhen he got there told her \"Hey, it has room\"\nTurned the bathroom into a smashroom\nShe was hitting lines he was hitting from behind\nLook up in the mirror saw Ghost another time\n\"Peace god, pardon god, I ain't see ya Wis'\nLean toward the mirror cause I gotta talk biz\"\nGhostface told him only 20 to LaGuardia\nWhen you get there a car take you to Astoria\nYou don't want the alphabet boys on call\nSo tell the stewardess to make a wheelchair call\nWheelchair came, deboard plane\nJojo couple old folks and they canes\nExiting the door he seen a dog walking slow\nCouldn't dump the weed, nowhere to go\nTurns out the dog sniffed out that blow\nGood thing the stewardess a cokehead ho\nCause they bumrushed the bitch\nAnd threw her ass to the flo'\nJo told the wheelchair boy \"Let's go!\"\nAnd Jo got away that's how the story go\n\n[Hook]"}]}