{"artist": "Pharrell Williams", "songs": [{"album": "In My Mind (The Prequel)", "title": "Word to the Motherland", "image": "https://images.genius.com/15c3a4148e8368b49f9e0527134125d7.500x500x1.jpg", "lyrics": "[Intro: Pharrell Williams and (DJ Drama)]\nNah, nah dude seriously, did I monster that?\nDid I monster that though? It's nothin'\nUh, check it out (Gangsta Breezy)\n\n[Verse 1]\nReal niggas save up for out-of-state, but collect stash houses\nDrive Jeep wagons taxidermy their couches\nGetting small dope, fuck LV pouches\nOn the corner selling' that tiger, you can tell how they crouch\nI've seen pictures of Jimmy Henchman when he was in jail\nFresh beeper, fresh chain, fresh sneaker detail\nLike he could, order anything from hits to sales\nLike he in the four seasons ordering cocktails\nReal gangsta's do it, they don't have to prove it\nThe keys is spoken for, you don't tell 'em to move it\nThey operate just like sleuths, they flow\nFiends and hoes as they [?]\nLike the three letter crew out in ATL\nFed's scratching they heads sayin', \"will they please tell\"\nThe nigga [?] like the new Rayfel\nWith police escorts that's louder than a [?] sale (Uh-Huh)\nAnd you get [?] get your Steinberg's [?]\nHe paid that way, you think he ain't gon' write it?\nThe fed's get excited, not knowin' the con's inside it\nSo [?] the day they tried before they even write it (Gangsta Breezy)\nNow back to the necessity if you gon' supply it\nAll your weak links, Donald Trump, and nigga you're fired\nI did my research, my street exposure reworked\nI was too busy drivin' in [?] and hoes [?]\nNow remember, who got you hired?\nWho both, educate and spit the shit you like?\nNow analyze the picture that the non-thug drew\nSip your Corona, and puff your [?]\n\n[Hook]\nTime for the, time for the, best of the best (Time for the, time for the, best)\nThe new double-R driver BBC on my chest (The new double-R driver BBC on my chest)\nWhen you got your marked Jigga boots with the LV dress (Marked Jigga boots with the LV dress)\nYeah, well holler at the kid, yessir, nothin' less (Holler at the kid, yessir, nothin' less)", "year": null}]}