{"artist": "King T", "songs": [{"image": "https://images.genius.com/641a3479424d2748b1235e965b5adbcc.320x320x1.jpg", "title": "Big Boyz", "year": null, "album": "Thy Kingdom Come", "lyrics": "[King Tee] (Too $hort)\nEy $hort (What's up mayne?)\nAh nothin' man, just sittin' up here man\nDrinkin' on this big Hennessy\nWhat's happenin' with you?\n(Over here smokin' on this big weed\nAnd my big joint sittin' on 20's)\nYeah, yeah, if they can't hang with the big boys\nThey need to stay off the turf, you know what I'm sayin'?\n(That's right... I feel the same way mayne\nPut it down like this)\n\n[King Tee]\nMe and the players roll tight, sleep all day and play nights\nBlowin' 20 G's with ease at big fights\nKeepin' clamps on the crap table, I be runnin 'em\nMan I got problems but cash ain't one of 'em\nI stomp out in trucks with humps that bump blocks\nFlossin' in The Bay with $hort and big shot\nWonderin', what else could a nigga go buy\nWhat other bitch could we toss up and get high\nNiggas might lie but I'm a player by nature\nWork a ho quick for the paper\nSo haters feel the vapors, yeah take a hit from the bomb\n(Chronic) I brought a whole pound, stay calm\n(Bionic) East Oak-town and Comp-town\nFuck gettin' down, we vex, we been down\nAnd fuck anyone who thought my shit was for punks\nLike Richie Rich said, you don't want no funk\n\n[Too $hort]\nI'm from the Golden State, Californ-I-A\nYou think you already know what I wanna say\nBitch recognize game when ya callin' a pimp\nYou see this shit don't end so I'm ballin' again\nThat's what I got my Benz and the Lexus for\nYou know a nigga like to fuck, bring some extra hoes\nIf you thinkin', California livin' is fake\nThere's some real ass niggas in this big ass state\nI took a four hour drive up Interstate 5\nDid a hundred miles an hour with a bitch on my side\nI wasn't trippin' off shit 'til I blew my woofers\nRidin' back to Oakland with two fine hookers\n\n[King Tee] (Too $hort)\nBig boys, with big dicks and big wheels\nBig bank accounts, big cribs on big hills\n(Livin' like players for the '9-seezy)\nMackadelic King Tee (With ya nigga Too $heezy)\n\n[King Tee]\nAin't nothin' but G's and pimps in this pal\nChokin' on the bud and drinkin' Cristal\nBig boys with big hats\nBig cigars with big bank and big straps\nHaters say that I'm a trick cause I let my bitch drive my 6-heezy\nNow I'm on the mic with Too $heezy\nLivin' life easy, million dollar deals and connections\nDrunk in your V.I.P. section\n(Rollin' up on the side in your GS, homie you don't know me)\nThe Rolly on the arm cost forty\nA baby loc Goldy, mackin' at them hoes at the bar\n(Baby I can make yo' ass a star)\nYou on the Metro? Let's hit this X.O. and let's ride\nThe wide-body's parked outside\nPlayalistics, I'm on these hoes hoods for '9-7\nGod I hope players go to Heaven\n\n[Too $hort]\nHell yeah, she said - \"I know why they call ya $hort Dog\"\n\"But why you always gotta be so hard on us women?\"\nWhat a nigga gotta do?\nTreat a young lady like a prostitute\nCause that's how we livin' in the '9-0s\nI'm tired of y'all savin' these fine hoes\nIf you ever see a lady, treat her with class\nBut these disrespectful bitches, beat they ass\nAnd don't hesitate to represent the game right\nCause it's cool to go home to your same wife every night\nAnd never say shit about mine\nI be seein' your bitch out all the time\nSmilin', starin' at me, nigga what's up?\nI know your bitch, if I want to I could fuck\nBut I'm all about my money so keep your punk ho\nAnd let the funk flow"}]}