{"artist": "Ice Cube", "songs": [{"title": "Lakers national anthem 2010", "lyrics": "(Intro)\nHey What up Felli. Knock out. Yo Like I say, Ray J, L.A stand up. Yeah west coast\n\nRAY J -Chorus:\nWe goin' party till the early morn\nWhen the Lakers bring the trophy home\nWe got that California purple gold\nAnd F them Laker Haters cuz we down with the greatest\n\nICE CUBE:\nCleveland or Boston\nCleveland or Boston\nGlad we playin' Boston, put they ass in a coffin\nWatch Kobe Bryant off 'em in the finals so often\nAlways on fire, keep 'em chuckin' and coughin'\nOff that California purple, that Laker Purple in the air\nC’mon everybody, Paul Pierce need his wheelchair\n3rd year, still there, this will be my third\nMy style's like Magic Johnson, yours is like, Larry Bird\nOverrated nerd, but this ain’t the 80′s man\nWe got Ron Artest, don’t you know, he’s a crazy man\nDefense all crazy man! This ain’t no lazy man!\nAll up in your jersey like the ghost of James Worthy\nYou ain’t worthy to hold up that championship trophy\nRollin' down Figueroa on the bus with Kobe\nDon’t ask my ring size, you already know it\nI got a drawer full I might as well throw it\nI’m down on the floor, I’m in my suite\nIt’s goin' be sweet to watch the Lakers repeat\nI’m down on the floor, I’m in my suite\nYell \"beat LA!\" and get Boston beat\n\nCleveland or Boston\nCleveland or Boston\nGlad we playin' Boston, put they ass in a coffin\nWatch Kobe Bryant off em in the finals so often\nAlways on fire, keep em' chunkin' and coughin'\nOff that California purple\n(Off that, off that, off that, off that) California purple\n(Off that, off that, off that, off that) California purple\n\n[Hook]\n\n[Verse 2 Chino XL and Roscoe Umali]\nChino XL:\nThe Lakers are magnificent\nCritics better admit it\nWe winning, shoot it, pivot\nWith less than a second left and it swishes\nDon’t test us, you know how vicious\nArtest is, leavin' the Celtics cryin'\nLike Lebron when the Magic gave em that ass whippin'\nLake Show you know we down for the kill\nScore numbers greater than gallons lost in that BP oil spill\nPaul’s pie gets pierced by the king of the kings\nRondo’s obsessed like Schmegal with the Lord of the Rings\nHis name was Kobe\n\nRoscoe Umali:\nRoscoe Umali, I reppin' for the Lakers\nThe all time greatest, can't nobody fade us\nI do it for the jersey that be hangin' from the Staples\nJabbar, West, Magic, Worthy, Chamberlain and Baylor\nFisher, Pau and Bynum got championship rings with diamonds\nWhile the homies Ron Artest to run the defensive assignments\nBench mobbin' Odom, the Black Mamba Kobe\nWe parade on Figueroa with the championship trophy\n\n[Hook]\n\n[Verse 3 New Boyz and Ray J]\nNew Boyz:\nWe the best it's so. How you ain’t a fan by now bro?\nLaker’s over there head like it Shannon Brown dunk\nAnybody stepping up, we getting rid of them lanes\nSay LeBron needs Verizon, he ain’t getting a ring\nPlay LA and it’s over for sure\nTell them Boston leprechauns that them clovers don’t work\nThe Lakers win another championship\nThat’s why we got D Fisher to keep on reelin' 'em in\n\nRay J\nIt’s gonna be down Lakers in the motherf---in house right now\nYa’ll need to stop, stop runnin' your mouth\nWe gone celebrate and pop bottles right now\nYou ain't gon' top us down\n\nNew Boyz:\nOk I’m ballin, yeah I’m ballin\nThem fouls you can’t be callin’\nWatch you in it girl\nLeague my n---- we be on that Spartan\nNumber one and you can call in\nWe put that ass to bed\nBuzzer shot game winnin'\nDerek Fisher, Ron Artest, Kobe Bryant on they head\nWe call that dude the man\nCatch us up in LA reppin with my Laker fans\nPurple and gold, yeah we smashed 'em up and they gone\nLakers took the whole series and the rest went home\n\nICE CUBE:\nI’m down on the floor, I’m in my suite\nIt’s goin be sweet to watch the Lakers\nRepeat I’m down on the floor, I’m in my suite\nYell \"beat LA!\" and get Boston beat\nCleveland or Boston\nCleveland or Boston\nGlad we playin' Boston, put they ass in a coffin\nWatch Kobe Bryant off 'em in the finals so often\nAlways on fire. Keep 'em chunkin' and coughin'\n\nOff that California purple\n(Off that, off that, off that, off that) California purple X4\n\n[Lil Rob]\nCheck check it\nLil' Rob from San Diego but I’m down for Los Angeles\nI'm down with Los Angeles, L.A. K-E-R-S\nThe best from the west side (Left side)\nWe at the Pacific to be specific\nAll I need the purple and gold holmes\nIf you don’t know, now you know holmes\nDon’t act stupid, stupid\nYou know how we do it, when we hoop it\n\n[Hook/Outro]", "image": "https://images.genius.com/c457bbdb72f694aa2707c388b36e7230.960x764x1.jpg", "album": null, "year": "2008-10-06"}]}