{"artist": "Anderson .Paak", "songs": [{"title": "What Can We Do?", "album": "Ventura", "year": "2019-04-12", "image": "https://images.genius.com/93a042aff45826b8e533047fbb3d78a7.1000x1000x1.jpg", "lyrics": "[Intro: Anderson .Paak]\nYeah\nUh\n\n[Verse 1: Anderson .Paak & Nate Dogg]\nIt's the rap singer, the hook master\nReal life convict, son of a gambler\nHeart made of stone, and he move so cold\n'Cause my girl up and gone, she'll be back in the morn'\nGo lil' mama, take your drama\nSeems like I can't live without it\nI ache and moan\n'Cause my heart is broke\n'Cause my love went wrong\nYeah, another bag and she'll love me in the morn'\nWhile the bubble over stove\nAs I was dreaming of a bag, then I woke\nYou were starting to snore, wake your ass up\nLayin' in a bed full of cash\nYou slowly rolled over and whispered back to me\n\"That's just the way things have to be\"\nHey\n\n[Chorus: Nate Dogg & Anderson .Paak]\nWhat can we do? (Yeah, what can we do?)\nWhat can we do? (What can we do, baby?)\nWhat can we do? (Hey, what can we do?)\nWhat can we do? (Do)\n\n[Verse 2: Nate Dogg, Anderson .Paak & Both]\nThat's when the change comes\nThat's when the game's done\nThat's when the walls come tumbling down\nAh, ah, ah, yeah\nThey see me gettin' action\nStarted, it ain't no fun\nTime to grow up and turn it around\nAh, ah, ah, yeah\n\n[Chorus: Nate Dogg & Anderson .Paak]\nHey, what can we do? (Yeah, what can we do?)\nWhat can we do? (What can we do, baby?)\nWhat can we do? (Ooh, what can we do? Yeah)\nWhat can we do? (Yeah)\n\n[Post-Chorus: Nate Dogg & Anderson .Paak]\nTo make it feel just like it used to feel\nIf my cup was empty, you could fill it (Yeah, yeah)\nI feel you, yeah, yeah, I hear you\nTo make it feel just like it used to feel\nIf my cup was empty, you could fill it (Yeah)\nYeah, yeah, yeah\n\n[Bridge: Nate Dogg & Anderson .Paak]\nWhat can we do, what can we do, what can we do?\n(Yeah, what'cha sayin', Nate?)\nWhat can we do, what can we do, what can we do? (Yeah)\nWhat can we do, what can we do, what can we do? (Like that)\nWhat can we do, what can we do, what can we do?\n\n[Outro: Anderson .Paak & Nate Dogg]\nDamn, Nate, you sound good than a motherfucker, man\nI need a blowout in my voice, man\nKeep singin' that shit\nYeah, you can erase all that, man\nHell naw, we already paid for this studio session, my nigga, hold on\nIt sound good, bro, where you goin'?\nLiving gone\nAyy, Nate\nWhoa, whoa, whoa, whoa, whoa, whoa, whoa\nYeah, yeah, yeah, yeah, yeah\nNate\nMmm, ah, ah yeah"}]}