{"artist": "Half A Mill", "songs": [{"album": null, "lyrics": "Verse 1: (Half-a-Mil)\nSpark up the trees to the street anthem\nFirm lounge in the Hamptons on beach Mansions\nRich kids got reasons for expansion, sippin' scotch on Yachts\nWe used to hold drops, chop O's to rocks\nLeft the spot when it's hot until the snow dropped\nNow we rock gators low top\nMore Christal to pop\nManifest the raw style of Hip-Hop\nPut rap inside a ziplock\nPut the map inside a kickbox\nLet the ship stop, finesse the best Roley wrist watch\nHold a brick for every tic-toc\nLoad fifths, let the clip drop\nYou try to get props? fuck around and get your wig popped\nYou'd be better off pumpin' my sound\nIn the Navigator jeep, bitches jumpin' around\nSkunk by the pound, illin' with pretty Women from outta town\nHalf-a-Mil up in ya system spittin' wisdom rounds\nUp in ya club gettin' down\nDoin' the hustle and the bus stop spinnin' Women 'round\nWhen in doubt I hear the sounds\nThe illest shit around\nShow and prove\n\nChorus - This music makes you wanna move, get ya groove on, this music\nMakes you wanna groove, get ya groove on. (repeat 2X)\n\nVerse 2: (AZ)\nIt's all love, empty out the bar, Benz car\nIslam, rised to his own, niggas been large\nGuns blow, when you hear shots run low\nPlayas know, paper chase, stack, play it low\nIced out, club nights, cut the lights out\nRush ya wifes house, get her whole fam wiped out\nQuiet storm type, real rich, niggas wan' bite\nAll for all on mics, don't make me have to show you the light\n\nVerse 3: (Half-a-Mil)\nI'm all for this dough, like the rap Ross Perot\nBorn to blow, on the low, on the corner for dough\nFlashin' gold, ice Rol, could've been on life parole\nThe greatest story ever told, life is cold\nA hyper soul with a mic I'm a pro-\nFessional, unquestionable\nPushin' Four Lex's too\nBe with mean chicks that like Sexist dudes\nPush V's incredible, more degrees than Medical\nSmoke trees on schedule\n\nChorus 4X\n\nVerse 4: (Half-a-Mil)\nWe be the crowd movers\nNiggas is slick but we smoother\nManeuever like two Rugers\nThe type of kid to have a chick holdin' a brick between her two hooters\nI used to ride fixes, now I fly in Sixes\nCamouflage, survival of the fittest\nGrand God, America's the land of ours\nThey band God from the planet hard\nFrom the landin' of the Ark\nTo the sparks that brought light out of the dark\nSimulated Hip-Hop, bring the mics out in the park\nMC's used to rap to get props\nNow we'd rather get Yachts\nAnd massive knots, crash drops\nCash crops, we came a long way from crack rock\nIt's been a long day\nYou know how many niggas went the wrong way?\nWell hey, I'll still be the God livin' in Ellhay\nFeel me?, we're never guilty\nSuper hoes milk me, schiest matters kill me\nWhite knowledge healed me\nFor real G, it was predicted in the end\nWise Men will acsend lyrically\nVisually picture me\nStick wit' me in this World of mystery\nYou kiddin' me?\nI'd rather puff Sensee, empty M3's out of MP's\nRock mics, 'cause I can rip these and get G's\nWhip Bentley's from the Projects to NC\nShow and prove\n\nChorus 4X", "year": null, "image": "https://images.genius.com/80be703830ac91269b786d1198ace3b7.550x553x1.jpg", "title": "Groove On"}]}