{"artist": "YG", "songs": [{"image": "https://images.genius.com/6d9597606099b223fdd3ad68fa232887.1000x1000x1.jpg", "year": "2016-06-14", "album": "Still Brazy", "lyrics": "[Hook: YG]\nI'm a nigga and I can't go outside\nWe looking bad on the news black on black homicide\nI'm a nigga and I can't go outside\nI need them dollars, got these problems with this llama on my mind\nI'm a nigga and I can't go outside\nThey make it harder by the day, gotta keep this hope alive\nI'm a nigga and I can't go outside\nCause if my homies say it's on then you know I'm down to ride\n\n[Verse 1: YG]\nWe make it hard for us with all this black on black crime\nIn the same state we gotta pay our tax\nIf we get locked up it's double rate\nWe get popped then retaliate, and they sell us these guns\nIn these fucked up schools where they teach us what they told to\nHalf the shit I learnt in school I ain't never used\nThese fucked up rules the government trying to control you\nThat's why we saying fuck the law, we act like we the ones with the juice\nIt's fucked up around here, some niggas luck up out here\nThe rest end up stuck up around here\nSo I'm speaking for my peers cause I still see their tears\nI ain't sugarcoating nothing nigga, this is what it is\nThey supply us with the county to make us feel comfortable\nCouple years pass, we in the same spot we was before\nWe was content on that section 8 shit\nAt the first of the month we got them groceries for them kids\nBut nah, they're fucking up our mental\nKeeping us slaves so we can't be successful black people\nWe need to come together, fuck they system\nTired of being a victim, tired of racism\nSo I'mma spit this ism 'til this shit stop\nCause this that \"nigga, we all we got!\"\nWe need to stop hating on what the next black got\nGive him his props to figure out how he ran shop\nSo our kid's kid's can be good\nOn a house in the hills, and with a house out in the hood\n(Sound good) Cause them folks that be wealthy\nWe never thinking of tomorrow, it's so unhealthy\nWe killing ourselves, they killing us too\nThey distract us with entertainment while they get they loot\nThey never gave us what they owed us, put liquor stores on every corner\nWelcome to Lost Skanless, California\n\n[Interlude: Sadboy Loko]\nHaha, buenos dias motherfuckers\nI'm Sadboy Loko, and I'm here to speak for my people\n\n[Verse 2: Sadboy Loko]\nWe need to come together, look around\nThey made the border for the browns cause we're not allowed\nGotta get the green card for me and my child\nThose assholes payment under the table that don't last a while\nThose jobs getting passed around, they dog our people\nWhy we gotta look for work at Home Depot?\nIt was us before the natives, why we ain't equal?\nBut why you give us no perks, fool we need those\n\"And we're trying to make America Great\"\nFuck you esé, somebody bring him to the Treces\nAnd (*static*) just for disrespecting\nBlack, brown or pale, it don't matter to me\nThe only color that call shots in this world is green\nAnd at eighteen they want you to sign up for war\nThat's why most rather bang and hang around at the store\nSo to you, it's just another selling corn\nTo me, we out here hustling for the mortgage\nFuck you think we crossing the border for?\nWhy you think in a bedroom there's more than four?\nYou explored my country but can't accept my people\nBut who you want to run your business? My people\nMy flag is green, white, red, in the center's an eagle\nBrown Pride, fist high, this is for my illegals\n\n[Hook: Sadboy Loko]\nI'm a Chicano and I can't go outside\nA brown cop harassing me, I guess we all look alike\nI'm a Chicano and I can't go outside\nThis happens daily, all the time, I can never ask why\nI'm a Chicano and I can't go outside\nThey make it harder by the day, tryna keep this hope alive\nI'm a Chicano and I can't go outside\nCause if my homies say it's on, then you know I'm down to ride\n\n[Outro]\nDon't shoot...don't shoot officer, don't shoot, my hands up...my hands up...\nMultiple shot are heard", "title": "Blacks & Browns"}]}