{"songs": [{"year": "2016-01-15", "image": "https://images.genius.com/65316c14ff19b1d12065c987b51a1a9a.600x600x1.jpg", "title": "Eternal", "album": "The Casket Factory", "lyrics": "[Hook: Blaze]\nRecognize, that I am not alive\nI survived in the sands of the hourglass of time\nI'm the chalk line outline everything is mine\nFrom the wind to the Earth to the shadows far behind\nI'm the stars in the sky and I shine so bright\nI'm eternal, I'm the reason that the day turns night\nI'm the water and the sun, I'm the bullet in your gun\nI'm the finger on the trigger and I'm 'bout to blast one\n\n[Verse 1: Blaze]\nI ain't ever give a shit, all them bitches better recognize\nThe dead motherfucker on the block\nAnd I'm baptized in the blood of the fallen\nKeep it G, going HAM, Yosemite Sam\nFuck around be the next hologram\nBig dog way off the collar, don't bother\nWith the cage, can't keep me like the way I need my space\nGoing six feet deep, where the dead man sleeps\nWith the rats that creep, am I blessed for weeks?\nAnd the maggots still seep by the open wounds\nDressed like a Vagabond draped in tatted runes\nI've been left for dead, misread and misquoted\nBeen stepped over, unless a man would have voted\nUnder pressures of those with their bloated egos\nSense of righteousness and the path that they chose\nNever know the half, you are last, you're the past\nGoing backwards real fast, that's why they laugh\n\n[Hook: Blaze]\n\n[Verse 2: Blaze]\nIt's all about pro?, you bitches better hope\nI don't see you on the streets cause I'm going to your dome\nWith the handle of the 38 special fuck the tissue\nFacial reconstruction from the beating that I issue\nFuck you know that I miss you, you's a bitch, it's official\nTalk that shit, get your neck slit quick on some box cutter shit\nOf the graveyard shift, laugh as blood drips, yelling\n(Majik Ninja bitch!)\nYou think you know me? If only you fuckin' phony\nThink a motherfucker can control me? You can blow me\nAnd blow balls of the has been stars\nAs they fall they about as relevant as a mall\nMeaning they dying off, fast march on the ends?\nTake your last [?] statement of the ?lap dance?\nYou had your chance, [?] pop bottles\nAnd everything in your grips just like you won the lotto\n\n[Hook: Blaze]"}], "artist": "Blaze Ya Dead Homie"}