{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Red] Yo, whassup Big Daddy?\n[Kane] Aiyyo whassup Red Alert? I'm chillin Duke\n[Red] Yo do me a favor man -- pleeeeeease tell me\nAbout these big ol bubblehead girls out here\n\n[Big Daddy Kane]\nWell hey, you know that lady on the top floor of my buildin?\nThe heavyset one with about ten children?\nYou may remember her as a slim honey\nWhen her man name was Pimp Daddy Hustler Stack Money\nA big time drug dealer from around the way\nSlingin rocks, makin G's everyday\nHe drove a big fat Mercedes Benz\nAnd even bought her a car to perpetrate for her friends\nIt was a brand new Jag, with the spoiler and rag\nAnd the girl was a nag, cause all she did was just brag\nI mean baaaaaaaaaaad -- we know your coat cost a lot\nYou didn't have to leave on the price tag\nAnd count the times her stomach got plump\nHavin baby after baby by the same old chump\nAnd then the day came, he left the dame shamed\nBut who's to blame? Y'all know the name of the game\nPimp Daddy's wanted as he maxes and relaxes\nShe can't even sue for money, pushers don't pay taxes\nSo what's to do? Oh yeah\nTo feed ten mouths, she had to call on Mr. Welfare\n\n[Red] What? Mr. Welfare?\nMan they playin high-post with low income\nCheck this out -- when y'all go around to the corner\nY'all gonna check out another episode\nGo like somethin like this..\n\n[Big Daddy Kane]\nHey, if you think that suck, bust this\nAnother little story as I reminisce\nAbout an old friend of mine that was livin out of order\nMakin money like water (illlllll-egal?) Yeah, sorta\nHe sold drugs and robbed a lot of people\nBut in these days and times, who lives illegal?\nIt's all about who knows the trade\nAnd who am I to knock him? Homeboy was gettin paid\nHe chose his own lifestyle to live - it was negative\nBut his own prerogative\nMakin cash to flash and stash in half the trash\nThe cops made the dash (sufferin succotash!)\nBecause he had to do ten in the pen\nAnd then begin again to apprehend, huh\nBut what's lost is lost, the reign is over\n(Huhhh, see ya!) Nice to know ya\nMoney, no longer can he collect it\nCan't even get a job cause he got a jail record\nSo what's left? No hopes of a career\nSo yeahhh, he's callin Mr. Welfare!\n\n[Red] Mr. Big Daddy Kane\nThey don't know what time it is about Mr. Welfare\nDo me a favor -- open up your book to page fifteen\nAt the top and read it off like thisssssssss\n\n[Big Daddy Kane]\nHere's a story of a guy who had to cop out his life\nFor bein a high school dropout\nIn the ninth grade he wanted to get paid\nBut now the young brother needs government aid\nBecause in his past he decided to cut class\nAnd run in the streets to make ends meet\nNo shame in the game of his\nBut silly rabbit, Trix are for kids!\nSo when you sat on the corner with a 40 ounce\nTalkin bout whattup? Can't even pronounce\nYour words correct, now in retrospect\nThat's a shame - but in '89, who gives a heck?\nThere's no type of path to follow\nIt's all about a dollar, fuck bein a scholar\nThat's why your report card's through\nLike a BizMark beat, it reads eww-eww-eww-eww-eww!\nSo now you wanna wake up and smell the coffee?\nLookin for a helpin hand, but get off me!\nI tried to tell you the deal last summer\nStay in school, and get yourself a diploma\nNow you're on your own, tryin to make it alone\nNo food or home, chewin on a meaty bone\nSo what's to do since the cupboard is bare?\nBrrring brrring! Call on Mr. Welfare\n\n[Red] Yo Kane, that's the story about my man Mr. Welfare huh?\n[Kane] Yo like Chuck D said, how low can you go\n[Red] If she go any lower, she gonna have a personal problem\nYo my man Mister Cee, cut it up money!\n\n* Mister Cee cuts \"welll-fare\" *\n\n[Kool DJ Red Alert]\nWe-eh-el-el-el, el-el-elllllllfare, c'mon!\nYeah Mr. Welfare\nHe on some new stuff, what what is it?\nHe all new and improved?\nRight? Yeah, like that old Bug-Out stuff\nThis guy, is he alright or what?\nI think he on a mission with no kind of learnin\nYou know what Big Daddy Kane?\nWe gonna have to take care of this matter\nMister Cee, go ahead, cut it up\nMy man Big Daddy Kane gonna see about my man Mr. Welfare alright?\nPlaces to go, people to see, things to do\nAnd you know what else to get.. see ya!\nYeahhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhhsss!", "image": "https://images.genius.com/e5112b31d8bd715b9e736175eff672d9.1000x1000x1.jpg", "year": "1989-09-19", "title": "Calling Mr. Welfare", "album": "It’s a Big Daddy Thing"}]}