{"artist": "Fabolous", "songs": [{"year": "2011-12-25", "album": "There Is No Competition III: Death Comes in 3's", "image": "https://images.genius.com/a0348c935d57487123b43e794a9fcd9a.500x500x1.jpg", "lyrics": "[Verse 1: Fabolous]\nTough times don't last, but tough people do\nI father niggas the way Wayne and Puff reproduce\nLittle rap bastards, running round with your snapback caps backwards\nShould be in rap caskets\nWho you think showed them to go hard with stunting?\nAnd who you think showed them that those broads was nothing?\nAnd who you think showed them that those cars was something?\nAnd when Father's Day came, I got no card or nothing\nSo I ain't out here trying to expose frauds for nothing\nAnd I ain't out here pulling these hoes' cards for nothing\nThey was bitches on deck, y'all made em queens\nWatching sports with a chick who got ballplayer dreams -- swish\nI'm watching these dogs play with my old bones\nI feel like niggas done found one of my old phones\nWe in the house -- y'all look into home loans\nAnd when the market was up, you wouldn'tve sold, holmes\nSo this the foreclosure of the wanna-be\nIf you can't be yourself, then who you gonna be?\nDad to your swag, your style was like a son to me\nYour stylist got thank-yous, you never sent one to me\nLet's pray for 'im, y'all repeat this one with me\n\"Now I lay me down to sleep, I pray for those who run with me\nIf I die before I wake, arrest the girl I brung with me\nI give the Lord my swag to take whenever God is done with me\"\n\n[Hook: Fabolous]\nI be saying to myself as I put on the gloves\n\"It hurts when you gotta kill a nigga you love\"\n\n[Verse 2: Paul Cain]\nIt's painful when best friends become your enemies\nAnd you're finding out that they're not who they pretend to be\nThe whole time, you conspired to put an end to me\nAnd I'm still trying to show this nigga love -- silly me\nSo I might shed tears as I put on my gloves\nBut I won't show emotion when I fill him with slugs\nCause niggas die every day here, and you can get hit\nPicking your seed up from daycare, niggas don't play fair\nThat's why I'm straightforward, fuck being all discreet\nAnd knock him off quick, fuck beefing on for weeks\nSo we was up late night hunting, y'all was sleep\nCause we the wolves hiding in clothes, y'all the sheep\nWho taught you the game, who showed y'all the streets?\nAnd who brought in the things they sold y'all for cheap?\nAnd who came with the bail when them hoes called police?\nNow you're fronting, so I gotta expose y'all deceit\nUngrateful motherfucker -- who fed you when you was hurting?\nWhenever drama came up, who was putting the work in?\nI was spitting live on Hot 9, you was still rehearsing\nAlready my son, and this was before I met you in person\nSo no matter how many colorful fake chains you purchase\nLike that bullshit you wearing, you always gonna be worthless\nYou just spit it, I lived it -- who's really writing the verses?\nLous put him in a casket -- who you think's driving the hearses?\n\n[Hook]", "title": "Death In The Family"}]}