{"songs": [{"year": "2007-09-11", "album": "Graduation", "image": "https://images.genius.com/680d4985b1fccdf554ab887abb63a453.1000x1000x1.jpg", "title": "Barry Bonds", "lyrics": "[Verse 1: Kanye West]\nIt's what ya all been waitin' fo', ain't it?\nWhat people pay paper fo', damn it\nThey can't stand it, they want somethin' new\nSo let's get reacquainted, became the hood favorite\nI can't even explain it, I surprise myself too\n\n[Chorus: Kanye West]\nLife of a Don, lights keep glowin'\nComin' in the club wit' that fresh shit on\nWit' somethin' crazy on my arm, uh-huh-hum\nAnd here's another hit, Barry Bonds\n\n[Refrain: Kanye West]\nWe outta here, baby! We outta here, baby!\nWe outta here, baby!\n\n[Verse 2: Kanye West]\nDude! Fresh off the plane – Konnichiwa, bitches!\nTurn around another plane, my passport on pivot\nAsk for it, I did it – that asshole done did it!\nTalked it then he lived it, spit it then he shit it\nI don't need writ–ears, I might bounce ideas\nBut only I could come up with some shit like this\nI done played the underdog my whole career\nI've been a very good sport, haven't I, this year?\nThey say \"He goin' crazy and we seen this befo'\"\nBut I'm doin' pretty good as far as geniuses go\nAnd I'm doin' pretty hood in my pink polo\nNigga, please, how you gon' say I ain't no Lo-head?\n'Cause my Dior got me more model head?\nI'm insulted, you should go 'head\nAnd bow so hard till your knees hit yo' forehead\nAnd the flow just hit code red\nTop five MCs, you ain't gotta remind me\nTop five MCs, you gotta rewind me\nI'm high up on the line, you could get behind me\nBut my head's so big, you can't sit behind me\n\n[Chorus: Kanye West]\nLife of a Don, lights keep glowin'\nComin' in the club wit' that fresh shit on\nWit' somethin' crazy on my arm, uh-huh-hum\nAnd here's another hit, Barry Bonds\n\n[Refrain: Lil Wayne]\nYeah, yeah, we outta here, baby!\nWhat? What? We outta here, baby!\nAyy, Mr. West, we so outta here, baby!\nAnd me? I'm Mr. Weezy Baby, yeah!\n\n[Verse 3: Lil Wayne]\nI'm so bright, not shady\nMy teeth and my ice so white like Shady\nIce in my teeth so refrigerated\nI'm so fuckin' good like I'm sleepin' with Meagan (ha!)\nI'm all about my Franklins, Lincolns, and Reagans\nWhenever they make them, I shall hayve them\nOops, I meant \"have them\" – I'm so crazy!\nBut if you play crazy, you be sleepin' with daisies\nI'm such a hayvoc – oops, I meant \"havoc\"!\nAnd my drink's still pinker than the Easter rabbit\nAnd I'm still col' like Keyshia's family\nStove on my waist turn beef to patties (baow!)\nAnd I ate it 'cause I'm so avid (no homo)\nAnd I don't front and I don't go backwards\nAnd I don't practice and I don't lack shit\nAnd you can get buried – suck my bat, bitch (ha!)\n\n[Refrain: Kanye West & Lil Wayne]\nWe outta here, baby!\nWe outta here, baby!\nWe outta here, baby!\nSwag at a hundred and climbin', baby, yeah!\n\n[Chorus: Lil Wayne]\nLife of a Don, lights keep glowin'\nComin' in the club wit' that fresh shit on\nWit' somethin' crazy on my arm, uh-huh-hum\nAnd here's another hit, Barry Bonds"}], "artist": "Kanye West"}