{"songs": [{"year": "1999-11-30", "album": "Amplified", "image": "https://images.genius.com/6e84984f4b00329695a16521d47f4aca.300x300x1.jpg", "title": "Wait Up", "lyrics": "[Verse 1:]\nWe on a brand new page; millennium days\nDesperation on the streets gotta find a new way\nKeep the mics and choke holds. The saga unfolds\nMachavellian approaches executed by the coach\nI'm in these streets like a ghost\nThe air-jettin' artist\nTo the love, I hit 'em right plus I hit the hardest, man\nI got a whole new approach for the rhymin'\nYou cherry cats slide, I'm holdin out for the hymen\nUh! You play the rappin' roll\nI take the rap and sold\nAnd intertwine it wit' mine and turn a half to whole\nI'm just a genie in a Jack bottle\nThem fake ballin'-ass cats is just a wack model\nThis joint knocks wit' the force of a gat throttle\nI live by 'You put it out, we get it back' motto\nHey. But who around but just your average reproduction, love\nRap is gettin' lose so all the ice is screamin' 'Thug'\nWhat the hell is wrong? I'm askin' in this song\nOne time I smoked hash out of the hippies' bong\nOne of us is goin' laid cause I ain't gettin' played\nI leave you right inside that shitty-ass bed you made\nAnd walk along chuggin' Baller's Brains, rockin' rings\nAnd things and just waitin' for white rains\nI got the drive, dog. I hope the dogs' ready\nMy mentality on dime chicks is stay sweaty\n\n[Hook:]\nWait up. Your wait up. Wait up\nGet your (\"It's the Ummah for all time.\") wait up\nWait up. Your wait up. Wait up\nGet your (\"The Ummah forevea!\") wait up\nWait up. Your wait up. Wait up\nGet your (\"GET YOUR WAAAIIIIIIIIIIT...\") wait up\nWait up. Your wait up. Wait up\nGet your (\"..UP! UP! UP! UP! Yo!\" ) wait up\n\n[Verse 2:]\nYou wanna shoot dice or wanna shoot rounds?\nWanna sell rhymes or wanna sell pounds?\nThe decision is yours. I'd rather see tours\nGet chicks wit' ghetto shit fallin' out they drawers\nMy team stay posted. They stay roasted\nNiggas who all in it had a hard knock livin'\nAdministra, rhyme minista, illa treasura\nYou didn't know that your man was a legend, huh?\nEmbonishment for the both of you\nI hit the road and I take my whole fuckin' crew\nCause I'm a Queens cat. (\"True.\") To the G's cat. (\"True.\")\nGettin' money for more than one needs cat. (\"Aiiight, c'mon.\")\nCondition never peers and (\"Take it home, kid.\") mind stands out\nFrom Seattle to South Beach my joint: grand clout\nIt's the street commentator, providin' you wit' data\nOn how to live unique and it's really not neat. We gotta...\n\n[Hook:]\n\nAnd all the fellas go, 'Yeah, yeah, yeah.'\nAnd all my ladies go, 'Uh, uh, uh.'\nAnd all the fellas go, 'Yeah, yeah, yeah.'\nAnd all the ladies go, 'Uh, uh, uh.'\nFellas go, 'Where you at?'\nLadies go, 'Yo, come back!'\nFellas go...ladies go...\nFellas go...ladies...yo...\n\n[Verse 3:]\nA mellow disposition even when it's pain\nYour mental ammunition is faulty wit' a drain\nI puts it down, Lord, Fuck a mic cord\nBrother's out of his game so we can see tours\nThe innovator - your man still a hater\nThe Abstract imprint, it stays like a Smint\nI got the masses cold, wigglin' and shakin' they ass\nMa, you betta get involved and do it real fast"}], "artist": "Q-Tip"}