{"artist": "Azealia Banks", "songs": [{"title": "Barbie Shit", "image": "https://images.genius.com/3928a7adc764ce0c58a295e374d3dedc.800x800x1.jpg", "album": null, "lyrics": "[Intro]\nKeep it moving (x9)\n\n[Hook]\n(Long weave, lipstick) I-I be on that Barbie Shit\n(Pretty in the face and) A bitch look plastic (x2)\n\n[Verse 1]\nWhat up, I fucks with all things monetary\nMy urge for the dough is involuntary\nI need that cream like Ben and Jerry\nI'm so caked up in the commissary\nUsed to eat mad chips at the front of the week\nNow I stack mad chips at the front of the week\nAnd I got mad clips at the front of the Jeep\nSo don't get caught trying to sample the cheese, huh\nNacho like you can't have lactose\nI stay with new shit like assholes\nSmoke that weed, get buck like rascals\nNiggas wanna pop, put them up like tadpoles\nWho's that? Who's me? You already know\nMs. Banks, 18, all about the dough\nMocassins, zooted jeans and polo\nFrank hat, 151 logo\nIn Soho, eyes low from the loco\nCause I hit that swish like a chokehold\nY'all just clowning, niggas straight Bozos\nStill cherry lounging? Man that's an old flow\nPlease, I cop the new steez\nA bitch don't dance? better do it for 5 g's\nNiggas stay frontin' like their clothes worth somethin'\nWell that looks like H&M to me\nRun around town talking about a triple beam\nAnd they getting cream and they got the nina\nDone coined a misdemeanor\nFelony money, that's my demeanor\nI keep this cash like my eyelashes nigga, long and pretty\nI get flyer than the next bitch do, and I never had to put one brick in the womb\n\n[Hook]\n(Long weave, lipstick) I-I be on that Barbie Shit (yeah!)\n(Pretty in the face and) A bitch look plastic (x4)\n\n[Verse 2]\nThat bitch own a pair of sixes, but I own a pair of fives\nAnd my Nudie jeans look better than her Levis\nBitches steady hating, anticipating and waiting\nFor conversation, they wanna come chill with the dope bitch\nLong weave, lipstick, I be on that barbie shit\nGot a pack of swishers and a bag of purple by the tits\nI like freaky-deaky shit, so a freaky bitch (keep uh...)\nBig dick niggas at the top of my buddy list\nWon't sex till ya lick my clit and tell me where the money is\nDumb birds, just occurred they get no words like sign language and shit\nWe just pull up in the whip\nCock that 4-5th like I'm missing one finger, bitch\nThat last line was clever\nDuck, Duck, Bitch, get down like feathers!\nA-Z-E-A-L-I-A is G-A-N-G-S-T-A\nClap on a nigga like Ay Bay Bay\nWe'll pull the trigger out in broad day\nSo y'all bitches better watch where the fuck you look and what you say\n\n[Hook]\n(Long weave, lipstick) I-I be on that Barbie Shit (yeah!)\n(Pretty in the face and) A bitch look plastic (x4)", "year": null}]}