{"songs": [{"year": "2011-09-20", "image": "https://images.rapgenius.com/64f8d1290eed070579f66ad5e00238ce.700x700x1.jpg", "title": "No Filter", "album": "No Filter  ", "lyrics": "[Intro:Big Scoob]\nNo filter, the latest entry from the big fella\nThe definition of no filter\nIs I say what the fuck I wanna say\nWhen I wanna say it\nNo matter who's listening!\nThe truth is\nHalf of these niggas don't fuck with me anyway!\nSo what a fuck am I losing?\nFuck y'all!\n\nChorus: (x2)\nNo control on these thoughts I've been thinking\nNo filter on my words I just serve you what I'm thinking\nAnd please don't be mistaken, it's not only when I'm drinking\nWhen I choose to share my mental, it's a problem in the making\nFeel me nigga!\n\n[Verse 1: Big Scoob]\nI ain't never been one to bite my tongue\nI see the very first thing I'm thinking just for fun\nI call it whiskey thoughts, the thoughts that whiskey bought\nIf that's the way I feel, then that's what I'mma talk\nMost of what I say, turns around and bites me\nBut I don't give a fuck, cause y'all don't really fuck with me\nThey say I say things that don't really need to say\nBut if I hold it back, then it means I'm being fake\nI'm in a pit with snakes, slimy bastards filled with hate\nBut I'm trying to feel my plate, so it's really no escape\nMaybe this is fate, I can be the voice of reason in a business where it pays for you to be deceiving\nThat's why it's open season on these pussies when they speak to me\nI don't get no closer to these niggas than I need to be\nThat was my mistake, niggas first go around\nNo new for no feelings in this business so I'm showing out\nFeel me nigga!\n\nChorus: (x2)\n\n[Verse 2: Big Scoob]\nMind of a maniac, the pictures where I'm living at\nRhymes of a braniac, now that I remember that\nI'm defined with these rhymes and the way I act\nHard times left the grind in every rap\nHard times left your homie mental scars\nThat's the reason I'll be drinking\nI'm just drinking, drinking hard!\nThough I try to write these bars\nBut these bars bring up memories\nThese memories bring up violence\nThat I'm trying to keep within me\nSo I'm hoping that you hearing me\nBetter yet, you're feeling me\nI'm trying to give you niggas\nSimple ways how to deal with me\nAlways keep it real with me, keep your shit intact\nLying is the number one reason I react become a silverback\nIntroduction to this animal, no tolerance for no sucker shit\nThe shit is not understandable\nI'mma keep it with my hustle that's the motto of the hood\nFill up that bravado boy I wish a nigga would\nI ain't up to no good, I'm just trying to chase a dollar\nWatch your tongue and how you come or it just might be a problem\nFeel me nigga?\n\nChorus: (x2)"}], "artist": "Big Scoob"}