{"songs": [{"year": "2013-10-25", "album": "S.C.O.T.", "image": "https://images.genius.com/84085e89142cb021fb85634062e40a2b.700x700x1.jpg", "title": "4 The Fans", "lyrics": "[Verse 1:]\nI can save your life; shit won’t even take no time\nWalked through hell to get here, now I’m meant to fucking make it rhyme\nI had the ground pulled from under me so come with me\nSaid I was the sickest, somehow still I kept humble, geez!\nI seen what you seen, maybe seen a little more\nI been there hungry, empty stomach, living fucking poor\nI’ve seen them fights on the street, domestic shit too\nOne stage was crazy the whole hood was dacking shivs, truth\nI've seen them guns drawn for fun, add a DS\nThat's fun chasing funds, they was street fresh\nNow they in a cell, I watched it fall apart\nTalk to Sero's mum, it hurts to hear her when she pours her heart\nPlus my own mum, she ain't wanna hear my shit\nShe's best to block it out if I was her I'd break to bits\nWhat to do? I'm just trying to save my fans now\nSo it's fuck the world, drinking liquor with my pants down\n\n[Hook:]\nThis for you, now you, you the fans now\nThis for all the fans who feeling like they need a new route\nYou can do it if I did it, find a better place\nYou can turn your future, wiping out your yesterdays\nThis for her, this for him, this for your life\nI'm paying back my fans, so I'm a gonna give 'em more rhymes\nNo matter what they say...fuck impossible\nMake it possible, remove the IM, that's the obstacle\n\n[Verse 2:]\nWhen I heard nightmare I didn't sleep for nights; swear\nMe and Rates the same so put us in a psych, yeah\nIs that the answer? Is it? Lock down the whole crew?\nHalf in prison, half in rehab, half in doll ques\nI guess I fluked it then, why I sitting at the top?\nYou decide, 'cause these cunts won't ever bring me props\nJealousy will probably overrule the whole world\nI'm with my fans, we just chilling in our own world\nI've got my crew too, the ones that made it through the struggle\nMind you, those who didn't make it, I'm still here just know I love you\nI should be idolised, I'm proof that the gutter grows\nIf you do it properly, turn that gutter to a fucking rose\nI don't fucking know, I'm eating Xanny tabs\n'Cause anxiety has got me feeling like I have attacks\nBut you don't care for me, I know where to play my part\nI won't get lost, I've did it, proven that I'm way too smart\n\n[Hook:]\nThis for you, now you, you the fans now\nThis for all the fans who feeling like they need a new route\nYou can do it if I did it, find a better place\nYou can turn your future, wiping out your yesterdays\nThis for her, this for him, this for your life\nI'm paying back my fans, so I'm a gonna give 'em more rhymes\nNo matter what they say...fuck impossible\nMake it possible, remove the IM, that's the obstacle\n\n[Verse 3:]\nAnd I still spin out. Is this a dream or something?\nNebs my brother and I thank him 'cause he's seen something\nWhen they was doubting me, Nebs was like fuck that\nHe's like \"We got this, man. I see we gonna run rap\"\nAnd look what fucking happened. I thank you mad fam\nI thank Sarm for giving patience, shout outs to That's Them\nAnd my best mate Boobz I owe my life to\nIf I never met him never would have picked up mics, phew!\nThat was high school, and they were high still\nHe said I'm the best in Oz, and he's right still\nShouts to Rates one; fuck, he knew this day would come\nAnd his day is coming from the streets I guess we fucking won\nShouts to Jay Dee, he on top of shit\nHis music hitting hard, I can't see 'em stopping him\nOh yeah, and April forget them broke days\nI told you that I love you, plus I made 'em go away\n\n[Hook:]\nThis for you, now you, you the fans now\nThis for all the fans who feeling like they need a new route\nYou can do it if I did it, find a better place\nYou can turn your future, wiping out your yesterdays\nThis for her, this for him, this for your life\nI'm paying back my fans, so I'm a gonna give 'em more rhymes\nNo matter what they say...fuck impossible\nMake it possible, remove the IM, that's the obstacle"}], "artist": "Kerser"}