{"artist": "Webbie", "songs": [{"year": null, "lyrics": "She say he say ?\nNo\nSay!\nShe say he say ?\nSay it!\nWhatever, man, this shit is crazy!\n\nShe say every time she talk is like I never listen\nAsk me why we never kiss, she say seem like I'm always flipping\nShe say every time she talk is like I never listen\nAct like all I like is money running around with different bitches\n\nShe say every time she talk is like I never listen\nAsk me why we never kiss, she say seem like I'm always flipping\nShe say every time she talk is like I never listen\nAct like all I like is money running around with different bitches\n\nShe's got a new phone\nI wiped out the slow songs\nTell me how this whole gone\nSaid she's 'bout to move on\nBye, ain't gonna cry\nNow, this the reason why\nI keep a bitch on the side\nBut she's holding nigga down\nAnd now she say she's tired\nWow, my life, see\nShe ain't feeling to cry\nNo more. No. It just give you a hole\nWhen you wanna hit assailing\nBust it open on the floor\nI never had coffee, I'm not a popo\nBut you know you got to squeeze\nI got you two to leave\nMan, you know I got that cheap\nAnd you know how it be\nI can lay up on the Ubber\nI'm too much up in the streets\n\nShe say every time she talk is like I never listen\nAsk me why we never kiss, she say seem like I'm always flipping\nShe say every time she talk is like I never listen\nAct like all I like is money running around with different bitches\n\n? I'm telling you the truth\nI've got a family at home, bu\nThat's hard to believe\nAnd yet, I do what I want, too\nBut my baby ain't tripping, she know who I belong to\nShe know I keep a list of bad bitches I'm known to\nBut I won't be doing nothing, my reputation's too strong, too\nBe with all that side shit, so I won't even try the shit\nClimb first, cloud then, collide with my side bitch\nBuy shit, she riding it, take a spin like classic\nShe's on her ass, she's so happy that she's my bitch\nAnd she's got a nigga, probably a lot of niggers\nI bought her a phone, she call me when she ain't by the niggers\nAnd she's straight by the money, how she's doing a lot of niggers\nI watch her clothes clothes, ?\nI drive her crazy, though, she my little baby, though\nAnd she already know everytime I hit the dough\n\nShe say everytime she talk is like I never listen\nAsk me why we never kiss, she say seem like I'm always flipping\nShe say everytime she talk is like I never listen\nAct like all I like is money running around with different bitches\n\nNow, how you gonna say that, girl, you know that ain't right!\nYou know I like you, you know I love life\nI love ice, I love cars, I love living\nI love seeing my niggers walking about the freezers\nI'm on a mission, got no time to be hugging and kissing\nTime going fast, baby I gotta get it\nI love growing money, I hate it being broke\nI love t smoke, but reggae is what I hate the most\nI rather trip than slip, baby, and I ain't slipping\nIf you leave, you be ready to miss me. You can't blame me\nIt's what the streets did me, what? You forgot\nThat you promised that you'll be here with me?\nWe'll fuck ? but you'll never forget me\nThink I'mma loose me the sleep, girl, forget it!\nAnd then we brake-up, and then we make-up\nI just can't leave this girl alone, shit, say what?\n\nShe say every time she talk is like I never listen\nAsk me why we never kiss, she say seem like I'm always flipping\nShe say every time she talk is like I never listen\nAct like all I like is money running around with different bitches", "image": "https://images.genius.com/403f81a3904e2c735642fc97e1527bdc.300x300x1.jpg", "album": "Savage Life 4", "title": "She Say"}]}