{"songs": [{"title": "Live From the Chippie Bun Club", "image": "https://images.genius.com/bc93d9a1f10bf994d92790c0d8a53c75.1000x1000x1.jpg", "lyrics": "* originally from Mr. Dibbs' album \"Thirty Seven\"\n\n[Intro]\nComin' to the stage right about now\nWe got this crazy son of bitch named uh, by the name of Mr. Dibbs\nGo on put something on\n\n[Verse One]\nServed 18 months out in World War II\nEuropean theater for the red, white & blue\nHe watched from the deck with what remained of his crew\nAs his home finally came into view\nAnd the segregated Army had made him a Sargent\nHe came back hard and lookin' like a wood carvin'\nBobby Green, in all his magnificence\nEmbraced his young bride, she felt so innocent\nHe try to sleep but he had chest murmurs\nAnd wake up and at night tryin' to bayonet Germans\nShe would ask him but all he'd tell\nIs they ain't never lie when they'd said \"War is hell\"\nShe didn't need to hear about the fires and bombs\nAnd how his young friends used to die in his arms\nMan, he wouldn't even know where to start\nHe kept a photograph in a pocket over his heart\nBut he could kill strangers with the best of 'em\nEvery last colored solider got nothing but respect for him\nHe came home, it's like he ain't even grown\nRent rooms, he ain't even got a place of his own\nMissed his daddy's funeral, fighting for freedom\nReturned to find out that his wife didn't need him\nCause while the man of the house was vacant\nShe learned to earn enough to break bread and pay rent\nThe Army awarded him the Medal Of Honor\nHe now cleans toilets with a cramp in his posture\n\"Yes sir, no ma'am\", kill for these people with his own hands\nCan't get respected as a grown man\nNow that's what you call workin' poor\nCan't afford to bring his woman home, nothing from the store\nBut on the first Saturday of every month\nShe can wear the blue dress and eat whatever she want\nShe's queen for a day\nAnd needless to say\nThat's the only reason he has to breath in a way\nAnd on that night they were waitin' for a dish\nHe excused himself from the table to piss\nAnd in his absence\nA young bad motherfucker\nStep up like he think he James Cagney or something (\"Yo baby yo yo yo)\nShe said, \"That's mighty kind of ya\nBut I'm a married woman and I'm here with my husband.\"\nHe grabbed her arm and tried to hold firm\nShe pulled away and said, \"I already told you sir\"\nHe drew back, slapped her face\nGot his bar stool back and tossed another brew back\nBobby returned to find tears in her eyes\nAnd she's so shook up she can't tell him why\nGathered her composure, told the story\nBobby kept his wits about him and approached him calmly\nThen something happened inside, he snapped\nAnd struck him so hard that his eyes rolled back\nAnd his body collapsed\nGrabbed him by the arm pits, lifted him and drug him outside in the back\nAnd right there in the still of the night\nBobby beat the young man within an inch of his life\nIt might have been what he did to his wife\nI imagine that straw would be all it would take to break the camel's back\nThey all flocked from inside to get a scene\nJaws dropped, they were too horrified to intervene\nHe had him face down\nNaked from the waist down\nAnd what happened next cleared the whole playground\nSee, Bobby had already did what his hands could\nTook the next 10 minutes stripping his manhood\nBrutalizing him\nHe not gay but he had to go inside of him to really take his pride from him\nThe kid disappeared to who-knows-where\nAnd Bobby and his wife Ethal still live here\nAnd they never spoke about it for the rest of they life\nThat's all they called it was \"that night\"\n\n[Hook: 2X]\nThat night when the pillar crumbled\nThat night when the stone wall cracked and it all collapsed\nThat night a desperate person at the end of his chain\nGot tired of trying to make sense of the pain\nThat night when the statue stumbled\nThat night when the stone wall cracked and it all collapsed\nThat night a desperate person at the end of his chain\nGot tired of trying to make sense of the pain\nThat night (that night) [x4]\n\nOutro:\nYes y'all. Just put your hands in the sky. Just one hand in the sky\nWave that motherfucker. Left, right, left right\nMake some noise for the drummer now. Mr. Dibbs!\n\n_________________________________________________________________\nWindows Live Hotmail gives you a free,exclusive gift", "year": null, "album": "Off the Record"}], "artist": "Brother Ali"}