{"artist": "Willie D", "songs": [{"year": "1989-12-21", "lyrics": "[Verse 1]\nThey said the song was forbidden it couldn’t be written\nAs you can see the the motherfuckers were bullshittin'\nMany feared the Klan would hush 'em\nBut I snatched the pen and said \"fuck 'em!\"\nWrote the rhyme, put it in time\nMy mind, it ain’t blind to their kind\nMotherfuck a goddamned KKK\nMorton Downey Jr. get your prejudiced ass away\nFrom my TV set\nZip it, son of a bitch; I ain’t through yet\nBefore I’m on my way today\nI’ve got something to say to the KKK:\nFuck you, bitch!\n\n[Chorus]\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n\n[Verse 2]\nTelevision—a bigger killer than cancer\nDo you watch it? Wrong answer!\nIt’s teaching our kids how to steal and kill\nDon’t ask me how I feel\nCuz I might just form a congregation to start wastin'\nThey’re fucking us up through education\nPoor neighborhoods are getting short sticked\n'Cause everyone else gets help from the government\nThe board of education are bunch of\nPrejudiced sons of bitches, I’m snitching\nCause all you hoes gotta go\nT.A.K.S., that’s a test for the white folks\nThey ain’t teaching our kids the same shit\nHypocrite, bullshit teachers ain’t new to this\nSo it’s up to us to get involved\nCause to them it’s just a motherfucking job\nI see fresh text books at white schools\nWe getting shit they done already used\nThe board is the motherfucking enemy\nSo we can’t compete academically\nWith students our own age\nAll of this shit goes back to the slave days\nWhen the white man kept us illiterate\nHid the books, so we wouldn’t know shit\nWe’ve got to fight for justice\nCause those motherfuckers ain’t giving a shit\nBefore I’m on my way today\nI’ve got something to say to the KKK:\nFuck you, bitch!\n\n[Chorus]\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n\n[Verse 3]\n40 acres and a mule, peace to Charles Sumner\nDavid Duke: I got your number\nTalking that shit in the Cajun state\nCome to Texas and I'm-a wait\nFor you to start talking that trash, yeah\nSo me and my boys can put somethin' on your ass\nHow can you say that you’re a Christian motherfucker\nWhen you don’t even love your own brother?\nFamily, boy, whether you like it or not\nWhen will this bullshit stop?\nHatin' another man for his skin complexion\nBut I’m focused in another direction\nStraight out to ghetto and into rap\nThey saw blacks getting over and tried to hold us back\nFucking with me, what for?\nCause I ain’t slamming a guitar?\nFuck you, bitch!\n\n[Chorus]\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n\n[Sample from Dr. Martin Luther King Jr. speech]\n\n[Verse 4 - Willie D]\nKing, the man is long gone\nBut I’m aware that it wasn’t that long ago\nThat he was killed in cold blood by a bigot\nHoover dirty ass knew before he did it\nThe hangings, the whippings, damn a five-oh\nWe ain’t taking none of that shit no mo'\nCall me a nigga if you wanna\nAnd I’mma run circles around your ass like at Daytona\nThe white man got us believing\nThat everything white is right and black is evil\nThe only bad thing black is the black eye you gonna get\nFronting me with that bullshit\nSkinheads ain’t new to this land\nIt’s just another name for the Ku-Klux Klan\nEvery racist in America can suck my dick\nAnd while you doing it, listen to this:\nFuck you, bitch!\n\n[Chorus]\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK\n(Yeah) Motherfuck the KKK", "image": "https://images.genius.com/03c2b50829c5f112b3f64d1ceaa1bce1.700x700x1.jpg", "album": "Controversy", "title": "Fuck the KKK"}]}