{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C. Pt. 2", "title": "When I See You", "image": "https://images.genius.com/e25277b4e30e7ff6801bccf445a029d8.499x499x1.jpg", "lyrics": "[Prodigy]\nYeah\nIt go; 1, 2, 3, to the 4\nThat nigga P double got that shit fo'sho\n5, 6, 7, to the 8\nYou niggas make me laugh straight to the bank\nYou niggas got problems with me?\nCan't wait till we're in the same room in the same place\nYou just dropped the brick get outta my face\nYour album sound like shit, fucking disgrace\nTo the whole black race, rap race\nStop wasting budgets; buy your self a place\nMy song will embarrass you, you're in the wrong game\nI'll make you look stupid, sound real lame\nCompare to this sixteen bars of pain\nWhen I write I get tight, I'll be ready to bang\nCause in real life out in the world it get worst\nI'll brace car, buy guns, and bang for your shirt\n\n(Chorus) Prodigy\nThere's gon' be some shit when I see you\nGoodfella nigga but I'm 'fenna get evil\nUp, put 'em when his pants was down\nLook, now I got 'em running on camera now\nThere's gon' be some shit at this party\nEverybody leaving except for one body\nGot his self killed over that Bacardi\nWe handle the shit then its back to the party\n\n[Prodigy]\nAyo, dunn take the blunt while I fuck this nigga up\nKeep burning our flag and he fronting like he tough\nNiggas comin home from jail like they 'sposed to have me\nUnder some type of pressure, go fuck your mother\nYou really wanna step to me?\nGet online and go around the block, who next to get live?\nOn P-TV, better not have step\nCause everybody watching they all gon' witness\nMy power and strength, they see it's not a toy\nYou're trying to pet a Lion, I'mma enjoy me an arm for dinner\nMay God forbid I, get a whole of the rest of you I'll be a sinner\nAnd thou shall not kill, unless they trying to kill me\nAnd then shall finger pop the Uzi\nNow the bitch's all wet, bitch ass nigga, I'll make 'em fall back\nWhen I hit 'em in his titties, catch 'em in the city\nDoing real dirty cause his face real pretty\nNiggas bleed more when they're drunk off the Henney\nYou fucked up my shirt, mad DNA\n\n(Chorus) Prodigy", "year": "2008-04-22"}]}