{"artist": "Kool A.D.", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1362185468_Kool-AD-Okayplayer-interview2.jpg", "title": "Chicory", "year": null, "album": null, "lyrics": "Kool A.D. best rapper in the fuckin world\nHundred dollar freestyle for you and your girl\nOh my god what the fuck\nAy\nWhat the fuck ay\nOh my motherfuckin god\nHundred dollar freestyle\nKool A.D. best rapper in the fuckin world\nOh no not another one\n\n[Verse 1]\nBlowin a pound of the chicory\nNigga please, it’s Victor V\nLook at me, smellin the air called victory\nKool A.D. with the fricassee\nRicochet rabbit mane, I spit flames it’s a habit\nI kick game in a big way, it’s madness\nI switch lanes in a big frame, I grip thangs it’s magic\nI flip thangs get cabbage\nMy nickname, my alias\nThat’s Kool A.D. I’m crazy bitch\nSwaggin so hard talkin major shit\nI’m actin on boulevards, I’m pullin cards\nI’m smackin the actor that’s lookin hard\nY’all y’all shook and y’all cookin\nWait nah y’all ain’t cookin dog\nY’all ain’t even fuckin cookin dog\nI’m cookin dog, do a cookin dance like I’m Lil B\nK.D. man like look at me\nI play defense like sugary\nMy offense, o-ffensive\nI hook a 3, extensive\nI’m MJ, not MG, that’s Booker T\nExpensive, my jewelry\nShiva devotion Buddha bless (?)\nY’all already know like who the best\nStill Hungary like Budapest\nReal money I’m truly blessed\nI kill dunny, ill dunny, I’m stupid fresh\nYou impressed? Yeah I don’t care\nI’ma keep goin fuckin hard man\nIt’s no fair filet mignon man\nIt’s so rare you probably wanna test don’t go there\nGrow a pair, we out here, y’all nowhere\nY’all language is metaphor\nAlready said it but peep who I said it for\nI ain’t even fuckin give no fucks like anymore\nFuck it I never did, the flow so irreverent\n????\nI’m cookin I’m workin the handle and flippin the pancake\nLook at the beautiful music ya man make\nYo jump in a damn lake and fuckin cool out\nWhip out the tool now, yo what it do now\nOff of that strong, that too loud\nTrue proud, young African\nHoldin a ratchet I’m crackin the shit back\nJust crackin the words (?)\nI’m crackin a Mac at you herb\nDoin this, that, and the third\nI’m stacking the lab (?) just like I’m flipping some crack up a curb\nY’all wack and y’all nerds\nAnd y’all ain’t fuckin know the half and y’all actin absurd\nAnd I’m killin it nothing is real and shit\nYeah fuck it I’m real as shit\nEverything real as shit are you feeling it?\nReel it in, yeah here we go man\nThere he was, now I’m barely buzzed\nI’m swim in the memories, I live in the heavenly reverie\nI live in a moment of love and I’m loving it presently\nLove is a ocean of plenty, I’m sailing a ship on the sea\nWith the weaponry, I’m smoking a feathery pre\nNever he be less than a fuckin god MC\nThat’s Kool A.D. and I’m probably\nRealest mothafuckin thing in your mind right now\nOoh god damn wow"}]}