{"artist": "Anybody Killa", "songs": [{"title": "On My Way", "image": "https://images.genius.com/043a960c080afdd5e266d49e02eee1a3.500x500x1.jpg", "album": "Medicine Bag", "lyrics": "[Verse 1:]\nI'm on my way and I'm moving top speed\nAin't no looking back so don't even wave to me\nI'm going for a time to chase what I believe\nIn other words I'm following my dreams\nSo many set they mind to do the same\nEven if it seems a little strange (They still do it)\nTake my advice, that there's more in life to gain\nIf you just willing to fight through the pain (and keep kicking!)\n\n[Hook:]\nCan't nobody change me or what I believe\nSo I make it a need to go out and achieve\nOutdone by no one, new life's test run\nThought my time was up but the journey has just begun\nCan't nobody change me or what I believe\nSo I make it a need to go out and achieve\nOutdone by Gods son, new life's test run\nThought my time was up but the journey has just begun\n\n[Verse 2:]\nThis life we live, the struggles we face\nThe path we're on, the moves we make\nAt any time can all be replaced\nLike a memory in your head just being erased\nSo I'll move on just to keep the lead\nAnd make sure that nobody gets in front of me (look out)\nIt's like I can't stop now\nCause the power that I feel when I'm hearing the crowd (Juggalo!)\nIt's just so addicting (FAMILY! FAMILY FAMILY FAMILY...)\nThe love that you get with no sight of friction (FAMILY! FAMILY FAMILY FAMILY...)\nWill keep you moving til you're all worn out\nBut that's the type of feeling that I'm talking about!\n\n[Hook]\n\n[Verse 3:]\nI got the secret and it changed my mentality\nNow I'm pushing all my energy into the galaxy\nLike a Jager Bomb, gives you personality\nI'm on my way, so don't try to come after me (get out my way!)\nAdvertise every time they criticize\nInstead of looking deep into what's real in our eyes so realize...\nSome look at us as a joke\nAnd get upset cause they got choked when they tried to provoke\n\n[Hook x2]", "year": "2010-10-19"}]}