{"artist": "Anybody Killa", "songs": [{"title": "Trails of Tears", "image": "https://images.genius.com/8a7a13e5aff4ea229c97fc6e44c5aae7.1000x1000x1.jpg", "album": "Mudface", "lyrics": "Everybody running acting like they don't know where they going [x6]\nAs I walk through the trails of life I get so disturbed\nSo little time with so much to learn\nAll these faces askin for me to help\nBut I barely getting through this myself\nThat why I'm here writing\nPoor man's therapy put your pain to words\nMake it all fit together just to share it with the world\nThat's why some people just don't understand\nCause my rhymes are like a puzzle that they mind can't comprehend\nBut that's the path they chose, the lonely road\nWhere the street signs read your now out of control\nNot me though, I'm in it for the long haul\nSo I'ma fuckin make it, even if I have to crawl\nI'm not the type that wants to learn from mistakes\nSo every chance I get I think of moves to make\nI'm underestimated but I'm still here\nCause the name of the trail I'm on is have no fear\n\n[Chorus x2]\n(As I walk through)\nWhich way do I go, which way do I go, which way do I go, which way do I go, follow me\n(These trails of tears)\nAre you lost? Do you know which way to go?\nThe path your on, is it fast or is it slow?\nIs it everything that you always dreamed?\nOr is it just little more than what it seems?\nAre you headed on the one that fits?\nOr do you wish you could go back and switch it up right quick?\nNow I mean right is in the right path\nBut quick is in a hurry for them slow motherfuckers who always act like they don't hear me\nThis is my last attempt for your attention, any more wasted time will just be a failed mission\nIf you ain't down, why even mention my name\nTryin to hate on me cause of your own self shame\nSome only do it cause they wish they was me\nThat's why the path that they lead is called whack mc's\nAs my true warrior keep shit real, walking the concrete trails ready to kill at will\nI'm with'cha\n\n[Chorus x2]\nIt's time to take you on a whole new journey\nBut we got to stick together cause it might get lonely\nWe headed through the muddy swamps, for real\nAnd this experience might change how you feel\nWhether it's good, bad, happy, or sad\nJust as long as you follow you gonna find your path\nAnd where it ends, it's all up to you\nJust as long as you try you're best to make it through\nLet's go\n\n[Chorus x2]", "year": "2008-11-25"}]}