{"artist": "Apathy", "songs": [{"title": "Alien Weaponry", "image": "https://images.genius.com/e0fd6f4042838cf24cc48a890f2b142e.1000x1000x1.jpg", "album": "The Widow’s Son", "lyrics": "[Intro: Manly P. Hall]\n\"So now we come to another interesting episode. In the last few years, there has been a great deal of emphasis upon extraterrestrials visiting our planet.\"\n\n[Verse 1: Apathy]\nAyo, these muh'fuckas buggin' if they think I'll hang it up\nPass the mic in my direction and I straight up ate it up\nReally got the guns I talk about, I wouldn't make it up\nUltramag Four Horsemen, I'm about to Raise it up\n'Til I’m Kool Keith crazy with voices that tell me shit\nTrigger fingers extended like E.T. with Elliot\nYa get ya belly hit, it’s shakin' like ballistic gel, this is hell\nBodies gettin' dropped like pennies inside a wishin' well\nPennywise, fingers with Freddy knives and chainsaws\nPut you in a coma make ya brain pause, this is why we break jaws\nSingin' Judas Priest while we break laws\nRockin' break beats since Eazy E sold 8 balls\nI travel through space now and lay foes face down\n'Cause Ap is real, battlefields feel just like playgrounds\nThese little double time yappity yap rappers\nI’ll rapidly smack backwards get battery packs fractured\n\n[Pre-hook: Apathy]\nWe ain't in the same place\nOr occupy the same space (Space!)\nSo get the fuck out my face\n\n[Sample in Chorus]\nMost of you can't even comprehend what I am saying\nEven in my human form the message I'm relaying\n\n[Chorus: Apathy]\nI got that ancient technology\nI keep the Alien Weaponry on me\nI keep the Alien Weaponry\nI got that ancient technology\nI keep the Alien Weaponry on me\nI keep the Alien...\n\n[Verse 2: Apathy]\nMy verse makes earthquakes and aftershocks, scarin' off massive flocks\nOf birds on rooftops, shatterin' glass in ya Apple Watch\nAp and Nottz rockin' like Axl Rose in acid wash\nAstronauts blastin' off, laughin' while rappers watch\nIn disbelief, this is beef, problems you never wanted\nMy raps kill entire crowds and leaves ya whole town haunted\nAnd while you rockin' man buns, I’m cockin' handguns\nStickin' you for paper I’ll pass down to my grand sons\nFans run when Ap is on the stage, I’m metamorphin’\nIn to a Demogorgon, I’ll give your head an abortion\nI’ll leave ya brain in the dumpster, the braver the dumber\n'Cause some brazen muthafucker 'bout to get his brains braided this summer\nSince Biggie was Unbelievable, I was similar\nAssemblin' sentences like defenses established around perimeters\nYou outgunned, outshined, must be out ya mind\nRaps is putrid, Ap is stupid, slap the fluid out ya spine\nSpit divine scripture, rhymes sicker than polio\nI’m Godzilla in Tokyo, dick’s big as a totem pole\nGot inhuman capabilities kinda like Opio\nGrabbin' bulls by the horn this ain’t my first rodeo, yo\n\n[Pre-hook: Apathy]\nWe ain't in the same place\nOr occupy the same space (Space!)\nSo get the fuck out my face\n\n[Sample in Chorus]\nMost of you can't even comprehend what I am saying\nEven in my human form the message I'm relaying\n\n[Chorus: Apathy]\nI got that ancient technology\nI keep the Alien Weaponry on me\nI keep the Alien Weaponry\nI got that ancient technology\nI keep the Alien Weaponry on me\nI keep the Alien Weaponry\n\n[Outro: Manly P. Hall]\n\"But what we seemed to have overlooked, is the possibility that these records that we now consider to arise from extraterrestrial sources could be the records of the great civilizations that were here before they destroyed themselves.\"\n\n[Sample from the song You Belong to Me]\n\"See the Pyramids along the nile\"\n\nAncient Technology", "year": "2018-01-18"}]}