{"artist": "Bahamadia", "songs": [{"lyrics": "[Verse 1: Bahamadia]\nI'm reclinin' out West, maxin' at the ress\nPressed to see my cutie that I call to come caress me\nDesperate pooh unavailable to check this\nNot into masturbating yo 'cause that's some other shit\nSince I had hit the dry spell I figured I'd manicure my nails\nThen out the blue I'm interrupted by the bell\nIt was K talkin' bout D\n\"C'mon let's bounce tonight, Wu-Tang performin' at the Fever\nAnd I got the backstage passes, VIP status\nTha afterparty's at the Marriott, we in the night like Gladys\"\nCool I can do with that\nGive me 45 so I can wash the pussy cat\nAnd marinade the body, hop in Mizarahi\nTighten up the afro and turn to superhottie\nI tell you what, I'll hit you up soon as I'm ready\nWhen I see your Mitsubishi out front we jettin'\n\n[Hook]\nTrue honey buns, wanna have fun\nUnlike a chick who settle for the hit and run, yeah\nTo all tha girls do what you gotta do\nBut it ain't what you do - it's how you do it (you do it)\n\n[Verse 2: Bahamadia]\nArrivin' at the club like 11:45\nScenery was live\nMob like a 3-2 center outside, fly rides, the whole shabang\nYou know how Philly hang come time they get extravagant\nWhile I was sidetrackeded by the glamour and the glitz\nKey was chattin' with the bouncer telling' him we on the list\nWithin a split second we escorted through congestion\nRoutine friction, metal detection, all clear as air, no question\nSo we grabbed Kahluas at the bar\nAnd head towards the dance section, no hesitation\nBreeze into the back\nIn the green room where the celebrities was at\nThat's when the propaganda began to emerge\nStar stud events must trigger hoochie alerts\n'Cause Kia went berserk, diggy low at first\nSubtle body language actin' like a flirt\nTongue stickin' out wit the baby doll pout\nTalkin' all loud, I'm like what's dis all about?\n\n[Lil' Cess as Kia]\nThere go Method Man\nI'm sayin' what's up with him?\nI'm tryna see him fo' real\nThey look good\nWhy you lookin' at me like that?\nI'm sayin' I got to get mine\nFo' real, I got to get mine, okay?\n\n[Verse 3: Bahamadia]\nHere come the raw maneuver, lewder than imagined\nKia aimin' for attention, strivin' for it with a passion\nSlips out her sarong, started dancing in her thongs\nLike a bootie song was on, I said \"sis you know you wrong\nSee you the reason nigs be screamin' bitches, hoes and tricks\nI don't believe you goin' out on that Adina Howard shit\nDon't you think these niggas think you hotter than the sun?\nEven if they talk to you they wanna hit & run\nAnd if you schemin' on the cream, boo\nYou ain't gettin' none, you played from the door\nWith that nut shit you done\"\nThen she gon' look at me and say \"yo chill whatever\" (whatever)\nI thought you was my peeps, I said I thought you was together\nYour actions bounce on all these chicks in here like a reflector\nI'm tryna school you sis, it's plain that you don't know no better\nBut I'm not the one to judge, so do what you gotta do\nBut it ain't what you do - it's how you do it (you do it)\n\n[Hook]\nYo, true honey buns\nWanna have fun\nUnlike a chick who settle for the hit and run, yeah\nTo all the girls do what you gotta do\nBut it ain't what you do - it's how you do it (it's how you do it)\n(It's how you do it)\n(It's how you do it)\n(It's how you do it)\n(It's how you do it)", "image": "https://images.genius.com/c3f333fe50df0474b5bc5c334f14f219.1000x1000x1.jpg", "year": "1996-04-02", "title": "True Honey Buns (Dat Freak Shit)", "album": "Kollage"}]}