{"songs": [{"title": "1st Quarter Freestyle", "album": null, "year": "2014-01-01", "image": "https://images.genius.com/417826ceb885e3103d88d34a0549a121.500x500x1.jpg", "lyrics": "[Intro]\nYou gon' have to kill me for me to stop gettin' it, feel me?\nStraight up\nGod!\nFinally famous, nigga\nPaper chasers, G.O.O.D\nMy girl the baddest, too, G.O.O.D\nI'ma just keep countin'\nI look up\nOkay\n\n[Hook]\nI always got a grip, I never slip, I never panic\nGot my Rolex set Pacific, while I fly through the Atlantic\nAnd just like a know-it-all, I always got the upper hand\nAnd if I listen to you bitches I would still be on the campus\nBut instead I'm in The Standard, with a girl who got some standards\nGettin' head in the Jacuzzi and she claim she from Los Angeles\nBut she ain't come up for air one time, I swear she from Atlantis\n\n[Verse 1]\nIt's so fuckin' hard to have manners since I bought a manor\nI never take off, I just take off her panties\nTo partially nominated, yeah, yeah nigga you know me\nHop on a song and kill with niggas, who just won all the trophies\nBitch I ain't playin' no more like D. Rose or Kobe, it's Kobe the beef and it's shrimp ravioli\nSean Don, you know me, my cash homophobic, I swear it's so straight\nThen I double it up like I cloned it!\nMy homie called me like \"Sean Don, look\nYou know I got a girl, like you, so my nigga this one's off the books\nBut could you hook me up with Ariana Grande?\"\nSeems like niggas just call me for the hook-up or to get up off the hook\nI'm back in this bitch like I'm parallel parkin' (swerve swerve)\nGet hit with that 18, what's that? Bitch it's two 9's, that's parallel sparkin'\nI look up to the stars and God damnit I swear I can hear them shits talkin'\nTo you they the stars but to me they a target\nShe said that I'm fine and I say that I'm gorgeous\nI'm livin' so lawless, I promise\nWe just landed, Bora Bora\nChampagne, I pour, I pour\nModel girls, old Kimora\nFuck more or less, it's more or more\nI'm stackin' paper, safe to safe, drawer to drawer, bank to bank, floor to floor\nTouch a dollar and them killas be door to door to door to door to door to door\nFace to face, Hennessy, case to case\nDay to day, I paper chase, amazin' grace\nI've been plottin' since '86, and I was born in '88\nSo what the fuck that make me?\nA young visionary\nMy secretary finna be a millionare\nImma call her military\nFinally Famous militarian, I rep that, that\n'Til I hit the cemetery\nAnd I'm way too skinny for jail, ho\nSo I gotta stay rich enough just for the bail, ho\nI'm collectin' this change like I live in a well\nHeaven on Earth, I could get it through Hell\nBitch, we did it and did it ourselves\nSo now I'm presidential, my life, presidential, my wife\nResidential, the lake, presidential estates\nLike my homie Tone said, I could talk about my watch all day\nBut that's a fuckin' presidential debate\nMan shout out to SAYITAINTTONE and Jay John\nAdubb Da Gawd, Earlly Mac, Danny Brown\nOba and Boldy, Doughboyz and Vezzo\nTrick, Eminem, Royce Team\nEast Side, K-Dizzle\nDusty, Ro' Spit and the rest of them niggas\n'Til we come together, we all ain't gon' get it\nWe run the city!\n\n[Interlude]\nMan, free my dog Juan, man, straight up\nLot of shit been on my mind lately, feel me?\n\n[Verse 2]\nMy homie talked to me like \"Man why the hell you look the way you lookin'?\nHow you feel the way you feel\nWhen you got every architect in town\nMan, tryna sit and build\nYou got every girl that's in Detroit that's hot tryna come chill\nCause I just lost my nigga Doe B and a fuckin' Uncle Phil\nNigga, Ye layed the Blueprint\nSo I need hundred dollar bills, new print\nHangin' from my family tree, I'm a nuisance, millionaire\nFuck your two cents, you ain't do shit\nI'm a player, baby, I be wearin' zoo print\nLightin' struck like Zeus sent\nSometimes, to see the bigger picture, man you gotta zoom in\nSean cold, bitch where you been?\nMotherfucka, I've been great\nThis for the fans that say they love the album but they fuckin' love the mixtapes\nFor y'all, man I do whatever it takes\nDon't worry\n\n[Hook]\nI always got a grip, I never slip, I never panic\nGot my Rolex set Pacific, while I fly through the Atlantic\nAnd just like a know-it-all, I always got the upper hand\nAnd if I listen to you bitches I would still be on the campus\nBut instead I'm in The Standard, with a girl who got some standards\nGettin' head in the Jacuzzi and she claim she from Los Angeles\nBut she ain't come up for air one time, I swear she from Atlantis\n\n[Outro]\nFinally famous\nYou little fuckin' bitch\nAnd all that I just did, all my old shit, that's practice\nSo from here on out it's murder, nigga\nOh that's who you excited, oh that's the new nigga?\nHe's alright\nYou ain't fuckin' with me!\nWaddup doe Key Wane!\nAs the dynasty grows, sunshine's all we know\nDetroit, G.O.O.D\nWaddup La Flame, the homie Travi$ Scott\nKillin' y'all\nMy girl the baddest, my drinks the coldest\nMy team the realest, the trillest\nFinally Famous over everything"}], "artist": "Big Sean"}