{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse 1: Big Daddy Kane]\nA rap pro, do a show, good to go, also\nCameo Afro, Virgo, domino\nI go Rambo, Gigolo, Romeo\nFriday night spend money on a ho\nBattle cry Samurai, I'm what they call terror\nErasing all errors, give work to pall bearers\nI'm talking caskets, coffins, I'm the bastard swordsman\nThat cause the loss of massive organs\nFear factor, hereafter, disaster\nClimb like the Stairmaster, coming through, clear a path of\nThe raw aggression, that'll take your best on\nYou start talking Teflon, then you switch to Revlon\nNigga, choose your weapon, hope you got your vest on\nTalking Superman shit when you ain't got ya S on?\nGet ahead of who? Never you, skills too technical\nLeave nothing left for you but residue, the state of vegetable\nThe mad swag and do flaunt it, my dick and you want it\nOnly question now, is \"nigga, who want it?\"\nCause once trouble said (like that) trouble dead\nBoy don't make me have to pull out this double edge\nA rap pro, do a show, good to go, also\nCameo Afro, Virgo, domino\nI go Rambo, Gigolo, Romeo\nFriday night spend money on a ho-\nTel, to get a good night's sleep, I'm keeping in step\nDo I come off? Yep\n\n[GZA]\nMy sword crash through your breastplate, splash the blood on your scared face\nDrops leave your trail in the snow, showing the clear trace\nBehind punctured steel, their bodies rot\nArm and leg missing, head laying near the chopping block\nAn experience, that shattered your spine, break spirits\nSame shit that fucks with your mind, you hate to hear it, nigga\nDef man world is silent, he hears nothing\nBut we punish those who play dumb, years bluffing\nFloods and bloodbaths, up on elevator shafts\nMany rivers choked with bodies, float it like rafts\nSpark wires from auto-fire, verbal and slang with gats\nStreets filled with casualties, wherever the tanks was at\nConflict is imminent, preliminary attack\nEveryone's a target, so cemeteries are packed\nA solid nigga, drink liquids and gas you up\nHit you with a stupefying drug, pass ya cup\n\n[Hook: Suga Bang Bang]\nWhy you trying to test me swordplay when I'm sharp in every way?\nThis life I live—I'll do it all by myself\nWhy you trying to test me swordplay when I'm sharp in every way?\nThis life I live—I'll do it all by myself", "image": "https://images.genius.com/934a82446b3da7846960f0df79197fa9.592x592x1.jpg", "year": "2006-01-30", "title": "Cameo Afro", "album": "Afro Samurai Soundtrack Album"}]}