{"artist": "Gangsta Boo", "songs": [{"title": "Hard Not 2 Kill", "album": "Both Worlds *69", "year": null, "image": "https://images.genius.com/05275b2a5cae3f310f25e06511aa2191.400x400x1.jpg", "lyrics": "What's the motherfucking business?\nI'm tryna tell ya it's hard not to kill you chicken-head ass hoes\nTalking all that motherfucking shit, but it's all good\nI done caught a few charges, I ain't scared to catch some more\nYou hear me bitch? Come to my motherfucking do' and watch me\nPluck yo' motherfucking feathers\n\n[Verse 1]\nI'm the girl about the cash, I'm the lady with the mask\nI'm the one with the trigger, watch me pull it, make it blast\nI'm the one who got some niggas, I'm the one who got their back\nI'm the one they call \"Miss Lady Gangsta\" sweep you off the map\nWhat, you tryna step to me 'cuz you feeling like a killer?\nIn my eyes, I see bloody skies, dump you in a river\nI'm the motherfucking girl who talking all that shit\nI'm the first lady of the motherfucking Triple Six\nI'm the first one to call a hit on yo' fucking crew\nI'm the one who got you whacked cuz you fucked with Gangsta Boo\nI'm the one who be yelling, \"Blaze the blunt\" if you got it\nI'm the one that's yelling \"Sike\" cuz I got my own fire\nIf you haters wanna rumble bring yo' anna to the do'\nHo you know how you can get me, you can catch me at a show\nThis is how I represent for my ghetto-gangsta niggas\nIf you want a gangsta-girl, holla at a lady boy!\n\n[Hook: 4X]\nIt's hard not to kill niggas\nIt's like an everyday job not to kill niggas (I'll kill)\nNiggas you better know that\n\n[Verse 2]\nYou need a girl that's gonna get high with you\nLie with you, cry with you\nRide with you, die with you\nAll that type of shit I'll do\nI'm the type of girl that's gonna be down for mine\nAll the time, on the grind\nReady to ride, folks by my side without spilling a dime\nIt really don't even matter to me\nDwelling, I'm chilling in the B.H.Z\nFlipping the script, and coming so clean\nI'll forever be known as La-to the-Dy (lady)\nBitches and niggas can't feed off of me\nI'm riding and mobbing with H to the C\nP to the posse, you haters can't stop a bitch because it's meant to be\nGangsta, the gangsta is coming so hard\nI be known as the bitch with the attitude\nListen, you hear me, I'm saying it's all to the good\nDon't be a damn fool\nYou need a girl that's gone holla out your do'\n\"The folks is kicking in your do' \"\nI be the one that be coming like my name is \"Cleo\"\nBe knocking you straight to the flo'\nI love gangsta niggas, gangsta niggas love me\nMe and gangsta niggas got our fucking family\nThis is how I represent for my ghetto-gangsta niggas\nIf you want a gangsta girl, holla at a lady boy!\n\nChorus (4x)\n\n[Verse 3]\nFuck them other niggas, I be hanging with my fucking click\nOut to get that cheddar, cuz it's better when you having shit\nDoing gangsta stuff got me sitting off in a beamer truck\nGangsta like to fuck, hit me later, let me know what's up\nMarching and stepping, I got the bullets, I'm gonna use em'\nProfessional slanger I'm out the jungle\nI'm packing the weapon, commence to steppin up to your face\nAs I buck, you will die, I bounce the scene and without a trace\nIf it's anna to handle, the Misses Gangsta is bout her biz\nI be coming and gunnin', I thought you hoes knew what time it is\nWhen you see me you know that it's some shit, cuz I don't come out\nI'll be in yo' house, I'm on the couch with the pistol out\nI be taking them chances cuz I'm a gangsta that's claiming clout\nIf you bitches keep pressing off in my grill, I'm a choke you out\nThis is how I represent for my ghetto-gangsta niggas\nIf you want a gangsta girl, holla at a lady boy"}]}