{"artist": "A$ton Matthews", "songs": [{"title": "Lullaby", "image": "https://images.genius.com/103d9253d69ccc9cdf420e8f83e30587.500x500x1.jpg", "album": " A$ton 3:16", "lyrics": "[Intro: Kevin Hart]\nMe, by myself\nOne guy, one bullet\nAll day, every day\nWake up, go back to sleep, take a nap\nYou ever go night night, nigga!?\nYou about to go night night, nigga!\nEverybody go night night, nigga!\n\n[Hook: A$ton Matthews]\nThen it's rock-a-bye baby\nRock-a-bye baby, rock-a-bye baby\nRock-a-bye baby\nWhen the choppers knock, baby, then it's rock-a-bye baby\nRock-a-bye baby\nRock-a-bye baby, rock-a-bye baby\nRock-a-bye baby\nWhen the choppers knock, baby, then it's rock-a-bye baby\n\n[Verse 1: A$ton Matthews]\nYou never know names, my shooters got range\nGet removed for the sane\nWhen these new niggas hang, they new to the game\nAnd the chopper leave brains\nWho bringing the pain? Rang-a-tang on that ang\nAnd it's gon' leave a stain\nHop out, do my thang, skrrt skrrt through the lanes\nNo face and no names\nGive a fuck 'bout these lames, got ice in the cup\nGot ice in the chain\nYour bitch in the cut, dry sex in the cup, you want make it rush\nThen bring it to us, you get in a jam, then you don't know us\nWe move on the hush, finessing, we juggin'\nThat shit that we clutchin', we'll need no discussion\nIt's nothin', my niggas know it's nothin'\nBrick Mick Foley, flex Pac, arm, arm, leg, then headshots\nShorty, drop that acid, and show me what that neck 'bout\nNeck service, that neck service, she'll bust it open if the check worth it\nMoney and the power, now these bitches tryna hang with me\nDriver and a shooter, make a move, it ain't a thang to me\nHit a lick and then hit the road, catch five shots 'fore you hit the flo'\nShe hit the do' and hit the dome, that's a redbone under mistletoe\n\n[Pre-Hook: A$ton Matthews]\nMy bitches, they foreign, you slippin', I'm scorin'\nTwo two-threes, I'm Jordan, you slippin', I'm scorin'\nYou slippin', I'm scorin', you slippin', I'm scorin'\nYou slippin', I'm scorin', I'm scorin'\n\n[Hook: A$ton Matthews]\nThen it's rock-a-bye baby\nRock-a-bye baby, rock-a-bye baby\nRock-a-bye baby\nWhen the choppers knock, baby, then it's rock-a-bye baby\nRock-a-bye baby\nRock-a-bye baby, rock-a-bye baby\nRock-a-bye baby\nWhen the choppers knock, baby, then it's rock-a-bye baby\n\n[Verse 2: A$AP Ferg]\nRock-a-bye baby, bitch, you crazy\nYou think you killing me? I hit up your auntie and baby\nNow ain't that your grandma Mercedes?\nCut that bitch and your grandpa, [?] Hades\nGet her ass burned in the Benz\nWindow shield wipers with daises\nTalk-and-never-do-the-shit nigga\nCatch him messing with them hooligan niggas\nA bunch of [?] demons off the wet\nAnd the chiefer finna pull up, lookin' thru you with the blinker\nHit 'em with the lead like a number two pencil\nHungry while I wait, well then motherfuck this nigga\nCatch a nigga dreaming while he drooling on the pillow\nI pray to the Lord I could have a day, no sinnin'\nSwear to God, stressed 'cause my head getting thinner\nI wanna win, never motherfucking winter\nKeep it in the jeans, pistol, need a zipper\nSeeing life through the eyes of a killer\nCatch him on the block like Thrilla in Manila\nMake his ass shake like Ali and Frazier\nRun up on his ass like a motherfucking pacer\nPut him in a lake so I guess he a Laker, swim\n\n[Pre-Hook: A$ton Matthews]\nMy bitches, they foreign, you slippin', I'm scorin'\nTwo two-threes, I'm Jordan, you slippin', I'm scorin'\nYou slippin', I'm scorin', you slippin', I'm scorin'\nYou slippin', I'm scorin', I'm scorin'\n\n[Hook: A$ton Matthews]\nThen it's rock-a-bye baby\nRock-a-bye baby, rock-a-bye baby\nRock-a-bye baby\nWhen the choppers knock, baby, then it's rock-a-bye baby\nRock-a-bye baby\nRock-a-bye baby, rock-a-bye baby\nRock-a-bye baby\nWhen the choppers knock, baby, then it's rock-a-bye baby\n\n[Outro: A$AP Nast]\nYou ain't fucking with it, you feel me?\nI want you to hurt niggas' feelings out here, bruh\nLike seriously, my nigga\nLike if you gon' move how a nigga move, man\nYou gotta be out here wilding out on these niggas, bruh\nDon't fucking talking to niggas, don't sign no autographs\nDon't talk to kids, slap babies\nAll this crazy shit, my nigga, you feel me?\nThat's the type of shit I'm on, bruh\nWe 'bout to take over the world, man, Out Here Boys, nigga\nYeah, you know what they call me, right?\nWinston Myvry", "year": "2014-03-16"}]}