{"songs": [{"image": "https://images.rapgenius.com/01c600f3c9ad9017b5eef6bc587e8151.1000x1000x1.jpg", "title": "Intro 2", "album": "Therapy Session", "year": "2016-03-25", "lyrics": "[Verse]\n(Yeah!) I'm back, did anyone miss me?\nThey said the second record can be tricky\nWell, that's kind of funny, 'cause I am not trippin'\nMy fans—they know what it is and they with me\nYeah, I ain't the type that's gon' ride with the semi\nI came from a town with three lights and no city\nI've been doing shows for nothin' but pennies\nWhen I leave the stage, they never forget me\nMansion was a glimpse of my life\nI let you see what it's like to be in my head\nPeople ask me what I think I think I'd be doin'\nIf it wasn't music, I'd rather be dead, agh!\nYou heard what I said, that was like me at a three\nYou don't wanna see me at ten\nOr maybe you do\nI promise if that is the case, then that is what y'all gonna get\nIf you're looking for music with watered down lyrics\nI promise that you need to go somewhere else\nAnd if you want somebody to tell you everything\nThat you wanna hear, I won't be any help\nThis flow is familiar, I think I heard it before\nYeah, I made it myself!\nI left the door open to come in my mansion\nBut I never said it's a beautiful house\nSome of y'all sat on the porch\nLooked at my windows and stared at my door\nThey ask me if I'm gonna kill it this record\nI laugh in their face and I ask 'em, \"Do you see the blood on the floors?\"\n\"He's at it again\"\n\"NF is crazy, he's bad for the kids\"\n\"He never talks about nothing but him\"\n\"And my friends say, 'He's kind of a diva.'\"\nWell, you need to get some new friends\nI'm as chill as it gets\n'Til I get on the stage and flip on the switch\nAnd I go to a place where nobody is\nIf you bring up my name in a song, that's something that you will regret\nLearned a lot in a year\nI remember the shows when no one was there\nI remember the shows when nobody cared\nSome people in front of me laughing like, \"He isn't going nowhere.\"\nIt's funny now, isn't it?\nThis type of life isn't how I envisioned it\nThis type of life, it just ain't how I pictured it\nI'm in the back of the tour bus\nTryin' to FaceTime my family, it's different\nNot what you think it is\nWrite a review, tell me what you think of this\nGive me three stars and call me an idiot\nBut to be honest, it don't make a difference\nI know some people don't get it\nBut you have now entered a therapy session\nIf you don't like music that's personal\nI have no clue what you people are doin' here, might as well throw out the record\nI pull up a chair, I talk to my music like nobody's there\nOnly person I judge is the one in the mirror\nAnd lately, he ain't doin' well\nI don't need y'all in my ear\nI'm tired of hearin' it\nYou call it music, I call her my therapist\nShe keep on telling me I have been carryin'\nWay too much baggage, I need to take care of it\nI know she's right, but, man, it's embarrassing\nMusic has raised me more than my parent did\nTake out a picture of us and I stare at it\nWho am I kiddin'? You probably ain't hearin' this\nShow me an artist you wanna compare me with\nYou put us both on a track, I'ma bury 'em\nGive me the shovel, it's 'bout to get scarier\nNone of you want it with rap, who you staring at?\nI see you got beats, but where is the lyrics at?\nNF is the logo, you know I've been wearin' that\nDon't come to my show and be sittin' that very back\nI call you out in the crowd like, \"There he is!\"\nThought I'd be happy, it feels like I'm cursed\nIt's hard to be clean when you play in the dirt\nYou gave me this place to go when I'm hurtin'\nI thought it'd get better, but it's getting worse\nAnd I got nobody to blame when I work\nLike 24/7, I ain't been to church\nAnd Satan keep callin' me, he tryna flirt\nI hang up the phone, these are more than just words\nI drive on that highway and listen to Mansion\nI look up to God like, \"When did this happen?\"\nYellin' with all of my fans to wake up\nBut feel like I haven't\nI get emotional, I didn't plan this\nI'm doing things I never imagined\nI'm sorry, but I gotta leave\nI don't wanna be late for my therapy session, agh!"}], "artist": "NF"}