{"songs": [{"year": "2009-06-30", "image": "https://images.genius.com/69a36be14d6ea4a081e8b94ff44cbc4e.994x994x1.jpg", "title": "I-Gititin", "album": "Tha Blaqprint", "lyrics": "[Intro]\nWho Haa\n\n[Verse 1]\nRhyme flow dangerous, 30 plus, never rust\nNiggas can not hang with it, it's like being hit with a fucking bus\nI hear ya niggas talking, tell me what the fuck ya smoking\nBlaq Poet, don't provoke him, Henny drinking, haze blowing\nGun-toting bastard, what the fuck ya want to do\nI swear I'll blow at ya niggas, that's word to Kenny Lou (KL)\nKeep it a hundred, I'm the best that never done it\nNiggas want to give me the crown and I don't even want it\nWhat I do want is for you punks to pay attention\nAin't nothing wrong with that kiddy shit, but this what's been missing\nPremo on the beat and me on the rhyme\nThat means it's heat on the streets, it's about that time\n\n[Hook]\nI get it in, for all my thuns that's not here\nFor those whom I shed tears and ran with for years\nI get it in, for New York, true talk, nigga\nWe the best, what the fuck you thought?\nI get it in\n\n[Sample]\n\"Yeah Kid\"\n\n[Blaq Poet]\nHold up hold up, hold the fuck up Premo\n\n[DJ Premier]\nPo' what up?\n\n[Blaq Poet]\nYo\nHold up, hold up\n\n[Sample]\n\"Go in, go in\"\n\n[Verse 2 (w/ DJ Premier)]\nYa here to witness, niggas got no choice but to blast this\nHip-hop resurrected, I rise from the ashes\nAnd you know, Blaq Po' is like a submachine\nIt ain't a fucking thing to blow your ass to smithereens\nI'm on some Queen shit, \"bridge\" shit, mean shit\nWhat other nigga makes this ill, gangster lean shit? (I don't know)\nWhat other nigga makes you just want to get it in? (I don't know)\nWhat other nigga drink that gin on top of Henn? (I don't know)\nWhat other nigga make that real hard shit\nMake them other niggas make all that bottom bar shit\nLet them other niggas run around and chase them hoes\nI let them other niggas run around in them tight ass clothes\nLet them other niggas sit back and think they came\nLet them other niggas talk about their whips and blings\nI'm from the streets, motherfucker, and I'm really hood\nSo don't make me do it to you 'cause I really could\n\n[Sample]\n\"Yeah kid\"\n\"You not an MC, you's a rapper\"\n\"Go in, go in\"\n\n[Hook]\nI get it in, for all my thuns that ain't here\nFor those who I shed tears and ran with for years\nI get it in, for New York, true talk, nigga\nWe the best, what the fuck you thought\nI get it in, for all my thuns that ain't here\nFor those who I shed tears and ran with for years\nI get it in, for New York, true talk, nigga\nWe the best, what the fuck you thought\nI get it in\n\n[Verse 3]\nI splatter your matter nigga, you never mattered\nAll over the block, niggas need to stop with all that chit chatter\nYo fuck these niggas, y'all fake as niggas\nSee me and you smiling in my face as niggas\nSnake ass niggas, don't think I see you slithering\nHow stupid can you be when you know I fucking get it in\nI let you get closer, then I put this close you\nLeave your ass in Nova Scotia, stiff where nobody knows ya\nGangster kaiser, the mac light your night up\nI sit back and light up, them things tear you right up\nOh I love it when a plan comes together\nWhen my hand touch the cheddar, feed your mans to the shredder\nI get it in\n\n[Outro]\nWho haa\nYeah motherfuckers\nStraight gutter shit\n(What up)\nBlaq Poet\n(Year Round)\nDJ Premier\nThe game is over\nIt's ours\nWe the hardest\nWe the best\n(NYGz nigga)\nUh\nFree Rave Roulette\nYou heard"}], "artist": "Blaq Poet"}