{"artist": "C-Rayz Walz", "songs": [{"title": "Carefree (The Beatnikz Remix)", "album": "Year of The Beatnikz", "year": "2011-05-11", "image": "https://images.genius.com/7831f8f52321349fa4de48c10b092b4c.624x624x1.jpg", "lyrics": "C-Rayz Walz ft. Jeanine - “Carefree (The Beatnikz Remix)”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): The Beatnikz (Frank Blank and Lil Jay)]\n[Additional Vocals: Khiladi]\n[Hook/Vocals: Jeanine]\n\n[Intro: C-Rayz Walz]\nConfucius say, “Man who likes Sun Cycle always get moon-burnt.”  Hehehe.  Yo, speaking of burnt...\n\n[Hook 1 (Overlapped with Hook 2): C-Rayz Walz]\nThe fashion of the passion was realer than real\nLife was lovely, except what I can’t feel.  Miss you\nHope all is well with you.  Need to talk to you, hold your\nHand and walk with you.  Of course it’s you.  Holler\nBack however.  Hope all is well.  For Heaven’s\nSake, I just went through Hell.  I’m at the gates\nThe fashion of the passion was realer than real\nLife was lovely, except what I can’t feel\n\n[Hook 2 (Overlapped with Hook 1): Jeanine] (x2)\nWhatever you want\nWhatever you need\nWhatever you need\nI’ll be waiting\n\n[Verse 1: C-Rayz Walz]\nComprehend\nThe page, extensive blades.  I know you afraid\nBut front Harder than Mike's Lemonade, they say, “When a\nMan hold his feelings, that’s how you get titties to form,” but out of\nRaw talent, my son was born.  Sour\n“Grapes of Wrath” never laugh, get old and sad, start to\nWhine/wine when they get pressed for time, define smash\nWithout an essence, esoteric example of ass.  You’ll be\nStuck in the past.  You get it?  (Yeah, that’s some shit, yo).  Unfinished\nRoutes of the in and outs left a bitter taste in your doubt\nGuinness stout mouth or timid house is where the lion sleeps\nSex sells.  Free nights and weekends is my next tale/Nextel\nIf lines beep, then wait to exhale.  A better\nChance to fail if you lie and cheat.  Heads or tails, your conscious\nGets to walking.  Both options’ll drop you off in a coffin\nCoughing in the winter with pneumonia and the flu.  I got\nThe Chaka Khan chronic—god, \"I Feel for You\" (I feel for you)\n\n[Hook 1 (Overlapped with Hook 2): C-Rayz Walz]\nThe fashion of the passion was realer than real\nLife was lovely, except what I can’t feel.  Miss you\nHope all is well with you.  Need to talk to you, hold your\nHand and walk with you.  Of course it’s you.  Holler\nBack however.  Hope all is well.  For Heaven’s\nSake, I just went through Hell.  I’m at the gates\nThe fashion of the passion was realer than real\nLife was lovely, except what I can’t feel\n\n[Hook 2 (Overlapped with Hook 1): Jeanine] (x2)\nWhatever you want\nWhatever you need\nWhatever you need\nI’ll be waiting\n\n[Verse 2: C-Rayz Walz]\nFor my\nSpanish Fly killers, living la vida lust, a China\nBrush touched, designed your nuts with cups and crust (I took)\n(Mine when I realized) that’s a good look.  Twenty bucks?  That\nA piff sack attack for both of us, plus we in love\nOn some gay shit—not literally.  Yeah\nMa, if you that shit, then I’m that kid physically.  It\n“Rains  Forever” when it pours (Hey).  The problems is formed\n(You ain’t peeped it?) They even plaque with plastic in porn.  Bad\nThings come and go.  Good things come to those who wait.  Life’s\nA test, depending on the one that you take.  Use your\nBrakes, stop, go.  The return I came before.  Y’all ain’t\nSwallowed.  This is the Second Coming—digest hollow points\nFollow the power of suggestion, turn into\nAn answer.  Hope is not confession.  Waiting to ex-\n-hale, don’t hold your breath.  Something like\nHaving your first baby—you’re that close to death\n\n[Hook 1 (Overlapped with Hook 2): C-Rayz Walz]\nThe fashion of the passion was realer than real\nLife was lovely, except what I can’t feel.  Miss you\nHope all is well with you.  Need to talk to you, hold your\nHand and walk with you.  Of course it’s you.  Holler\nBack however.  Hope all is well.  For Heaven’s\nSake, I just went through Hell.  I’m at the gates\nThe fashion of the passion was realer than real\nLife was lovely, except what I can’t feel\n\n[Hook 2 (Overlapped with Hook 1): Jeanine] (x2)\nWhatever you want\nWhatever you need\nWhatever you need\nI’ll be waiting\n\n[Verse 3: C-Rayz Walz]\nI fronted\nFor years.  (I ain’t want to go see the doc).  I was\nMel Gibsoned out, scared of Conspiracy shots like\n“I don’t give a fuck.”  (“Nah, I’m lying”)\n“I did.  Four times this morning.”  (“What about)\n(That night I was drinking?”)  “But...”  (“What about the back of my)\n(Dad’s Lincoln?”)  “Word up, yo.  Shorty was stinking.”  “Wait!\nRemember Rhode Island with Rhonda, Robin, and\nAbsinthe?”  (“Nah, hold up.  That seems absent.”)  And it’s been, like\nTwenty-five O’s after thirty-five shows.  You know\nHow it goes: rock star on the road with no clothes\nPoking holes.  Tour bus became the Poconos\nIf you don’t smell me, you got a broken nose.  Thinking who you\nBoned, you could feel it in your bones.  Chasing your\nPast on the phone, paranoid, in the zone.  You could be\nFull-blown like hurricanes hit your homes.  There’s\nHella pain in your dome, made you feel strange and alone\nGenital anarchy, penile percolating\nA vaginal voyage with a dismal destination\nYou cry when you born.  We cry when you gone.  It’s hard\nTo see the cypher in the eye of the storm.  What if\nThere was flashcards that gave the rules of life?  To use\nA light in darkness and improve your sight?  It’s all\nFun and games ‘til it’s not—go ‘head and ‘fess.  I know you were\nStressed the first time you took your AIDS test"}]}