{"artist": "Iggy Azalea", "songs": [{"title": "Kawasaki", "lyrics": "[Chorus]\nThey tellin' me be humble, but they know I'm cocky\nLet me feel myself, yeah, daddy know I'm cocky\nAh, my wrist is rocky, come try and stop me\nHe wanna pop a wheelie, ride him like a Kawasaki\nBig Phantom grill, cook the streets like hibachi\nI'm sippin' sake, I'm raw like ahi\nBoy, why you always wanna meet me in the lobby?\nHe wanna pop a wheelie, ride him like a Kawasaki\n\n[Verse 1]\nAh, I'm goin' live, sit down and watch me\nYou're rockin' Jordans but you're Dennis Rodman\nI used to get the chicken fingers, now I get the lobster\nOr I get the pasta, yeah, all my bitches mobbin'\nHalloween team, fame turned me to a monster\nI make him fight for the pussy, I'm Ronda Rousey\nPlayin' hard to get, ring around the rosey\nIf we're lock in, keep it low key, shit, I'm going live\nThe block is hot, bitch go inside\nBarry Sanders tryna juke the truth, we know you lyin'\nShe poppin' pussy, pussy swollen, pop a Motrin now\nI can take my jewelry off, still be the golden child\nI'm going live, she just wanna watch\nShe with you 'cause you're rich, she just wants a watch\n\n[Pre-Chorus]\nThey told me to be humble, so I started humming (mmm, mmm)\nFuck you hoes, I came from nothin' (huh!)\n\n[Chorus]\nThey tellin' me be humble, but they know I'm cocky\nLet me feel myself, yeah, daddy know I'm cocky\nAh, my wrist is rocky, come try and stop me\nHe wanna pop a wheelie, ride him like a Kawasaki\nBig Phantom grill, cook the streets like hibachi\nI'm sippin' sake, I'm raw like ahi\nBoy, why you always wanna meet me in the lobby?\nHe wanna pop a wheelie, ride him like a Kawasaki\n\n[Verse 2]\nAh, I'm going live, close your eyes, open wide\nI could act like I'm humble but you know I'm not\nYou mean to act like I don't know when I know I'm hot\nAct shocked when my shit blow, woah\nHe wanna rock to my tempo\nI'm in the endzone, he in the friend zone\nIf you really on, where you team at? Put them on\nLookin' in the mirror, only bitch I depend on\nAh, I'm going live, sit down and watch me\nSee my ass tan, I was in the tropics\n'Bout to catch a flight just to go shoppin'\nThis a 1 to 1, what you know about it?\nBig amounts, big time accountants\nI can only vouch for my account\nAnd who I hold it down with\n\n[Pre-Chorus]\nThey told me to be humble, so I started humming (mmm, mmm)\nFuck you hoes, I came from nothin'\n\n[Chorus]\nThey tellin' me be humble but they know I'm cocky\nLet me feel myself, yeah, daddy know I'm cocky\nAh, my wrist is rocky, come try and stop me\nHe wanna pop a wheelie, ride him like a Kawasaki\nBig Phantom grill, cook the streets like hibachi\nI'm sippin' sake, I'm raw like ahi\nBoy, why you always wanna meet me in the lobby?\nHe wanna pop a wheelie\n\n[Outro]\nRide him like a Kawasaki\n(Ride him like a) Kawasaki, Kawasaki", "image": "https://images.genius.com/1388697b0301cf38d5a2ad229f96032a.600x600x1.png", "album": "Survive the Summer - EP", "year": "2018-08-03"}]}