{"artist": "Ice Cube", "songs": [{"title": "Fuck ’em (insert)", "lyrics": "[5 seconds fades-in]\n\n[Female Interviewer:]\nPlease, welcome O'Shea Jackson better known as Ice Cube!\nHow you doin'?\n\n[Ice Cube:] How you doin'?\n\n[Female Interviewer (male):]\nGood to see you\nWell known that the Crips and the Bloods are allegedly coming together\nYeah, you've been alot in the media lately than other rappers, we'd mentioned earlier Cube, that uhm...\nYou know? You have been labelled a lota thing\nWhat do you say to the people with the causal being anti-semitic, (fuck 'em!)\nOr anti-careerist?\nIt's probably the reason why they say that it's beacause some of the lyrics were...\nAimed at the women, bitches and hoes, and all that\nI wanna talk a little bit about that, too\nBecause we saw the parents' discussion about this last time and... (yeah!)\nSo and brothers, uhm... folks walkin' around, totin' guns, uuuuhm...\nAll that kinda stuff, do you think that sometimes those images and those lyrics...\nHelp white folks justify their continual racism againts us, or continue racism against us? (nah!)\n\n[Ice Cube:]\nI-I speak... in a perpective as uh... brothers on,..\nWhat we need to do is look in the mirror\nI-I, I do want the white community to understand our community more...\nAnd see what's going on, and see what, what uh... the things they've done to us in the past...\nAre still affectin' us now... mentally, you know?\nAnd,.. the reason I said it's because, I mean everything I said about, uh, uuuhm... you know?\nEverything I said on records before the riots, you know? Uuuh... (uh-hmm!)\nAnything you want to know about the riots...\nWas in the records before the riots! All you had to do was go...\nTo the Ice Cube library and, and, and...\n\n[Female Interviewer:] In, in, in...\n\n[Ice Cube:]\nPick a record and it would have told you\nYou know? I've given warnings...\n\n[Female Interviewer:]\nSo in other words, it's almost like a... war-warning or prophecy?\n\n[Ice Cube:]\nI-I've, I've given...\nI've given so many warnings on what's going to happen\nIf we don't get these, uuh...\nThese, these things straight in our lives, the clashes the-then, you know?\nArmageddon is-is-is, is near! Eheh! [beat stops]\n\n[Movie Bites from \"Scarface (1981) \", Al Pacino as Tony Montana speaks:]\nThis here...\nThese words all about money", "image": "https://images.genius.com/aa204256470ef9ed3c3a3fbcc1ee43da.1000x1000x1.jpg", "album": "The Predator", "year": "1992-11-17"}]}