{"artist": "YG", "songs": [{"image": "https://images.rapgenius.com/400327e7600d967602999d4f082a2633.500x500x1.jpg", "year": "2015-12-12", "album": "Def Jam Presents: Direct Deposit Vol. 1", "lyrics": "[Sample]\nCAINE: I needed some rims bad and I knew just how to get them. And I sure as hell wasn't gonna pay for them. All I had to do was to catch some fool slippin' and jack his ass\nRESPONSE: Nigga what the fuck you want from me?\nCAINE: Nigga, you know what the fuck I want nigga. I want your motherfuckin' Dayton's, and your motherfuckin' stereo, and I'll take a double burger with cheese\nRESPONSE: What!? (*static*)\n\n[Intro: YG]\nWe got London on the track!\nUgh!\n\n[Chorus: YG]\nI wanna Benz, I wanna look good with my friends\nI need my money, that don't ever end\nI wanna blow some bands, and still have some bands\nI wanna be the motherfuckin' man\nBitch, I wanna Benz, I wanna look good with my friends\nI need my money, that don't ever end\nI wanna blow some bands, and still have some bands\nI wanna be the motherfuckin' man\n\n[Post-Chorus: YG]\nTens, twenties, fifties, hundreds\nBitch, I’m YG 400\nTens, twenties, fifties, hundreds\nBitch, I’m YG 400\n\n[Verse 1: YG]\nI want a four door Benz that fit all my friends\nSo I could pull up on a bitch and tell her, “Bitch, get in”\nBitch, I want the crib, nobody know where I live\n'Cause that’s where I hide all my shit\nDiamonds on my wrist, on my neck and other wrist\nGoddamn, look at this\nOh, she want a kid? She wanna trip when I dip\nDamn, bitch, let me live\nI wanna be a baller, hit the mall, ring it all up\nIt’s ten Gs, ring it all up\nHit the strip club, we make a mess, she clean it all up\nBlack Chyna, clean it all up\nI do it 'cause I can, African American\nThey never wanted us to have bands\nDo you hear what I’m sayin'?\nThis was not in they plan\nBut now a young nigga got bands and...\n\n[Chorus: YG]\nI wanna Benz, I wanna look good with my friends\nI need my money, that don't ever end\nI wanna blow some bands, and still have some bands\nI wanna be the motherfuckin' man\nBitch, I want a Benz, I wanna look good with my friends\nI need my money, that don't ever end\nI wanna blow some bands, and still have some bands\nI wanna be the motherfuckin' man\n\n[Post-Chorus Nipsey Hussle]\nTens, twenties, fifties, hundreds\nBitch, I’m NH 600\nTens, twenties, fifties, hundreds\nBitch, I’m NH 600\n\n[Verse 2: Nipsey Hu$$le]\nI want an all-black Benz without no tints\nSo you can see the gold glow when the sun shine in ('Sup?)\nPut Pirellis on stocks, I don’t want no rims\nWant a big stash spot to put this four-five in, I want\nAll my niggas ballin' in the fast lane\nHundred some thick when we pull up to the valet (What?)\nPark and hop out with the mad face\n'Cause niggas think shit turned down since the cash came (yeah)\nOh, fuck that, heard shots then we bust back (Bang)\nBulletproof everything, you can trust that\nYou done it like we done it, I suggest that (Why?)\n'Cause would you rather be the victim or the suspect?\nOh, no, I came too far (Look!)\nChanged my ways, no, I change my broad (Look!)\nChase my change, never change my squad\nAnd stack 'til I can change my car, 'cause I wanna Benz!\n\n[Chorus: YG]\nI wanna Benz, I wanna look good with my friends\nI need my money, that don't ever end\nI wanna blow some bands, and still have some bands\nI wanna be the motherfuckin' man\nBitch, I wanna Benz, I wanna look good with my friends\nI need my money, that don't ever end\nI wanna blow some bands, and still have some bands\nI wanna be the motherfuckin' man\n\n[Post-Chorus: YG & 50 Cent]\nTens, twenties, fifties, hundreds\nBitch, I’m YG 400\nTens, twenties, fifties, hundreds\nIt’s Fifty, bitch, I keep it one hunnid!\n\n[Verse 3: 50 Cent]\nWe blew a hunnid Gs on some bitches out in Vegas\nIt’s YG and Fifty, niggas know they can’t fade it\nShe get the seven digits, she could say she hit the jackpot\nAccountants ain’t counting money coming out the crack spots\nCome through in a motorcade, bitch, we shut your block down\nForeigns everywhere, you know a nigga on top now\nWe tipping, bitches stripping, bust it open for a real nigga\nYou thinking she won’t, I’m thinking hell yeah, she will\nFigure there’s gonna be a party right after the party\nShe may menage with somebody\n'Cause we got bitches with us that’s bringing more bitches, get it?\nI bet you your bitch be with it, she come through she gon' get it\nThis is nothing personal, now why would this be hurting you?\nBottles popping, pussy popping, mollies in the water\nCrazy shit that we be doing with somebody daughter\nHave me thinking, \"Damn, nigga, we be out of order\"\nWe turn up 'til they have to call the law on us\n\n[Chorus: YG]\nI wanna Benz, I wanna look good with my friends\nI need my money, that don't ever end\nI wanna blow some bands, and still have some bands\nI wanna be the motherfuckin' man\nBitch, I wanna Benz, I wanna look good with my friends\nI need my money, that don't ever end\nI wanna blow some bands, and still have some bands\nI wanna be the motherfuckin' man\n\n[Post-Chorus YG]\nTens, twenties, fifties, hundreds\nBitch, I’m YG 400\nTens, twenties, fifties, hundreds\nBitch, I’m YG 400", "title": "I Wanna Benz"}]}