{"artist": "Bas", "songs": [{"lyrics": "[Verse 1: Bas]\nThey putting prices on heads, silver or lead\nI pray the scores settle 'fore the devil notice you dead\nGot me smoking the potent, my eyes open and Otis, they red\nThoughts of my eye roam and words that I hoped I had said\nThat aunty sippin on, we missin ya\nEven tho you gone, your thought alone can lift us up\nThis is us\nGot some niggas never call me 'less they need something\nBut I pick up, like, \"whassup, what you need cousin?\"\nMy niggas know that I love 'em\nGive 'em roses while they can smell 'em\nCause ain't no tellin' who'll be here tomorrow\nUsed to borrow your digital scale\nFlippin' them sales\nBut now it's digital dash while you're still in the past\nBoy, trust me when I tell you, the picture got much bigger\nThe swishers and dutch fill up\nBitches in lust with us\nMomma would dissapprove, losing my way\nLost in the sauce, this bolognese is so amazing\nHad a talk and she remark: \"you so engaging\"\nRunning game, it's all the same\nI'm growing jaded\nHad a couple things in common, like Lonnie Lynn\nBut I'm too faded for conversatin'\nI'm sittin' here contemplatin' how to win\n\n[Chorus: J Cole]\nTime keeps slipping away, away\nAnother day another love song, hey\nAnother day another love song, hey\nTime keeps slipping away, away\nAnother day another love song, hey\nAnother day another love song, hey\n\n[Verse 2: J Cole]\nYeah\nCousin in jail again, asking me for bail again\nClose when I was 12, but I was much frailer then\nHe was like 16, a nigga from the gutter and\nYears ago his favorite uncle had married my mother and\nHere we are, runnin' through the Ville like dumb and dumber and\nFor that summer man I swear I wish you was my brother then\nWell time passed and we fell off cause you moved back home\nLittle did you know Jermaine done grew a new back bone\nNiggas thought he wouldn't make it 'till he proved that wrong\n12 years later on the radio that Who Dat song\nYour homeboy bumps the Warm Up now you buggin'\nCause you looking at the cover and you say \"Yo that's my cousin\"\nAnd niggas looking at you like you lying but you wasn't\nNext thing I know you blowing up my line all a sudden\nAnd I'm showing love saying \"yo look what I did\nMan, nobody coming from here ever did this shit this big\"\nBut now you saying \"Man enough about you\nShit what about me, my nigga what about me?\nOh you forgot about me?\"\nSame niggas showed you how to rap, now you don't know how to act\nBoy I'm at the bottom you could pull a nigga out of that\nPut me in a video, yo put me on your hottest track\nBring me on the road with you, you know 'cuz got yo back\nAnd I'm strapped up if them niggas act up\nSee you headed to the top you need to let me catch up\nPlease let me catch up\nWon't you let me catch up man\"\n\"I'll see you when I see you\nHarsh as it seems to say, I wouldn't want to be you\nBail you out for your daughter and I pray to God\nA nigga never pull your card or she won't ever get to see you\"\n\n[Chorus: J Cole]\nTime keeps slipping away, away\nAnother day another love song, hey\nAnother day another love song, hey\nTime keeps slipping away, away\nAnother day another love song, hey\nAnother day another love song, hey", "image": "https://images.genius.com/39c68731f53df590ac095e6694ceb1c8.500x500x1.jpg", "year": "2013-04-30", "title": "Cousins", "album": "Quarter Water Raised Me Vol. II"}]}