{"songs": [{"year": null, "album": "The Most Beautifullest Thing in This World", "image": "https://images.genius.com/447c633e96f2be906b387d1114ff07c4.953x953x1.jpg", "title": "Bom Bom Zee", "lyrics": "[Keith Murray]\nYo this is Keith Murray and Hurricane G with the bom bom zee\nTrey deep takin to the streets\nWe straight ball hoggin, word up\nNiggas know what time it is\nStraight up\nStraight motherfuckin Def Squad, L.O.D\n\nWe can stand in the water and can't get wet\nDef Squad always got some fly shit on deck\n\n[Paul Hightower] Gl-or-ia!!\n\n[Hurricane G]\nHey fun-ny, what's up with that money grip, yeahhh\nGet hip to my tune and yo watch me flip\nThe master, the ultimate funk, freak-er\nI'm unique, I got soul out my sneak-er\nA dope female, with the fat tail\nI never liked college, so yo, fuck Yale!\nIf you don't know me by now I'm Puerto Rican\n(When the track be creepin she be freakin when she speakin!)\nThe Bad Mamma Jama, still bust the grammar\nFuck the bullshit, let's get legit\nYes me the Hurricane yo I pack skills\nSo I keep on steppin like I'm doin drills\nHut one, two, charge enlarge\nGod damn, so don't fuck around with the jam!\nSit back, relax, niggas and watch me kick it\nDon't flex, in my pocketbook I pack a biscuit\nI blow your ass out (click click BOOYAKA)\nHow's that?  Now peep the size of my gat\nI'm gassed, so motherfuckers kiss my ass\nMy whole ass; my entire big fat ol' ass!\n\n[Keith Murray]\nKeith Murray run this motherfucker!  (Hell motherfuckin yeah!)\nKeith Murray run this motherfucker!  (Hell motherfuckin yeah!)\n\n[Paul Hightower] Ke-ii-thhh!!!\n\n[Keith Murray]\nThe mad matador metaphoric mergers like traffic *car tires squeal*\nNot havin it, bashin your style I'm somethin drastic\nBiblically, theoretically, practically speaklin who\nWanna step in the helm of the realm of the Def Squad crew (Def Squad!!)\nI shoot the gift like SWISH drinkin Olde English\nNigga you wish you had the style, more distinguished than this\nPissed ain't the word so observe -- how I break\nYour flow down through science, and kick you to the curb\nFirsthand dirt and jungle poetry\nYou see me, G, we or E and somethin out this anatomy\nFound the words of motherfuckin technology\n(like that) and we out\n\n[Paul Hightower]\nIt's the bom bom zee, ohhh yeah\nWith Keith Murray, and Hurricane G...\nFor y'all that don't know -- ya betta ask somebody!"}], "artist": "Keith Murray"}