{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/86239d3de00e4660583da44a02ffa821.820x546x1.jpg", "title": "Killer Mike Introduces Bernie Sanders at Rally in Atlanta (Nov. 23rd, 2015)", "year": "2015-11-23", "album": null, "lyrics": "I am honored to be here. Oh, I am truly, truly honored to be here. I am from Atlanta, Georgia and I say that proudly. I repeat: I am from Atlanta, Georgia and I say that proudly.\n\nIf you’re from Atlanta, Georgia, you may be familiar with a young man who grew up not far from here. His name is Martin King. Now, I know this is the part where usually it’s a black minister in front of you, and usually you get all warm and cozy inside, and usually you hear about ‘I have a dream’ and holding hands and going for ice cream.\n\nThat’s not why I’m here today. I’m not here to talk about benevolent politicians that are going to come and save the day for you. I’m not here to talk about the dream that you think is unattainable so you settle for less. I’m not here to talk about Utopian society where everyone is forgiven and no one has to pay for past debts.\n\nWhat I am talking about today is Martin King post the Washington march. Martin King on the war on poverty. Martin King against the war machine that uses your sons and your nephews to go to other lands and murder. I have no time in my short 40 years on this Earth to relive the Reagan years. I have no desire to see us elect our own Margaret Thatcher.\n\nI am here as a proponent of the liberal revolution that says healthcare is a right. I am here because working class and poor people deserve a chance at economic freedom. And yes, you work 40 hours a week – and you should not be in poverty.\n\nWhile here, I have to tell you that in my heart of hearts, in my heart of hearts, I fully believe that Sen. Bernie Sanders is the right man to lead this country. I believe it because he, unlike any other candidate, said I would like to restore the Voting Rights Act. He, unlike any other candidate, said I wish to end this illegal war on drugs. Unlike any other candidate in my life, he said that education should be free.\n\nNow, I only have a few minutes. But as I read The Atlanta Journal-Constitution’s comments about me speaking tonight, one jumped out at me. And it broke my heart. It said, ‘I don’t listen to rap and I will no longer be listening to Bernie Sanders.’\n\nI just want to say that, whoever wrote that, before I was a rapper, I was a son of Atlanta.\n\nBefore I ever wrote one rhyming word on paper, before that, I was a black man in America.\n\nAnd before I ever learned how to dance a jig, I gave a damn about American politicians.\n\nI gave a damn about the people of America. And I took to the streets.\n\nI know I’m preaching to the choir tonight. I know there are not a lot of voices of dissension out there. I know I’m preaching to the choir. But I’m here to tell you: Stay encouraged. Stay invigorated. Stay bold. Stay confronting bullshit at every turn.\n\nMake sure that wherever you go, you take the name, the idea, the philosophy and the ideology of Bernie Sanders there. And you make sure that when you read they are on fire, that you felt the Bern.\n\nI have said in many a rap I don’t trust the church or the government. A Democrat or a Republican. A Pope or a bishop or them other men.\n\nBut after spending five hours tonight with someone who has spent the last 50 years radically fighting for your rights and mine, I can tell you that I am very proud tonight to announce the next president of the United States: Sen. Bernie Sanders."}]}