{"artist": "Yella Beezy", "songs": [{"image": "https://images.genius.com/804d37ad67a4341db2d63125ad8c31a6.1000x1000x1.jpg", "year": "2018-11-16", "album": "Ain’t No Going Bacc", "lyrics": "[Intro]\nShun On The Beat\nLet's show us\nI said, \"Oh us\"\nWhen I pull a you on you\nAyy\n\n[Chorus]\nSay I'm hittin' on two by two (Two)\nThey watch tryna do what I do (Do)\nKnow I'm poppin', tryna screw who I screw (Screw)\nEvery step tryna move where I move (Move)\nWhy you keep playin' games with me? (Ayy)\nThis ain't no 'Skip to My Lou' (Lou)\nAnd you keep on lockin' your tooth (Tooth)\nBut you didn't know I been had the juice (I been had the juice)\n(Shun On The Beat)\nHow you gon' get mad at me (Me)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (Ayy)\nHow you gon' get mad at me (Me)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (You on you)\nI pull a you on you (I pull a you on)\nI pull a you on you (I pull a you on)\nI pull a you on you (I pull a you on)\nI pull a you on, I pull a you on\nI pull a you on you (I pull a you on)\nI pull a you on you (I pull a you on)\nI pull a you on you (I pull a you on)\nI pull a you on, I pull a you on\n\n[Verse 1]\nI pulled a you on you so just move on\nOne of your moves, you act like I did you too wrong\nBeen down the road before, I been knowin' you for too long\nBut you're lucky treatin' me and it got your mind too gone\nYou gotta be kiddin' me, what feelings? I'm too numb\nDifferent problem every week and your mind too young\nI'm sick and tired of your beef, all the arguin' too dumb\nPlay hide and go seek, chase you and then you run\nKeep on talkin' that shit but ain't gon' do none\nKeep poppin' off at the lip like you some\nFucked her on the futon, gave the hoe a few blurries\nSon gave me a two for one like a coupon\nSay I'm gettin' hot up in here like Tucson\nI love the gang-gang, gang bang like a GroupOn\nAnd I ain't got time to play I just had a new son\nTryna get the package up in traffic, rush hour, don't flee, though\nI cannot lie on you (I cannot lie on you)\nAnd I got my eyes on you (I got my eyes on you)\nEvery time I dive on you (Every time I dive on you)\nI just wanna slide in you (Just wanna slide up)\nI cut all ties with you (I cut all ties up)\nNo, I cannot ride with you (I cannot ride on)\nI don't wanna vibe with you (Don't wanna ride on)\nI can't shuck and jive with you\n\n[Chorus]\nSay I'm hittin' on two by two (Two)\nThey watch tryna do what I do (Do)\nKnow I'm poppin', tryna screw who I screw (Screw)\nEvery step tryna move where I move (Move)\nWhy you keep playin' games with me? (Ayy)\nThis ain't no 'Skip to My Lou' (Lou)\nAnd you keep on lockin' your tooth (Tooth)\nBut you didn't know I been had the juice (I been had the juice)\nHow you gon' get mad at me (Me)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (Ayy)\nHow you gon' get mad at me (Me)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (You on you)\n\n[Verse 2]\nLet the phone call 'til the bitch turn silent\nNigga get to trippin' get to poppin' at your eyelids\nAnd I don't want no company, can't nobody come to my crib\nPeople pocket watchin' tryna figure out how I live\nAll the nigga jockin', yeah they're tryna follow my drill\nI'm the hottest topic, yeah nigga this my year\nYour bitch gobble-gobble all night up on my dick\nKeep on callin' me, tryna ride up in my whip\nCame outta nowhere, nigga how the fuck you got here\nCannon up a lot here, got a lot of knots here\nServed a lot of custs, fuck ducks on this block, here\nAyy, bitches, watch here, don't tick-tock here\nEverywhere I go I'm strapped up with the Glock here\nYou will get popped here, bust on, shot here\nAdd it up, add it up, nigga gettin' guwop here\nEveryone claimin' that they real, hush it\nPump fakin' actin like they treal, bluffin'\nPussy ass nigga better chill, ain't scared of nothin'\nNigga start pullin' out the drill, you runnin'\nI ain't tryna fuck down that little bitch, she busted\nEvery other day she arguin' and fussin'\nI ain't tryna holla bitch, end of discussion\nBetter talk that shit to the nigga you fuckin'\n\n[Chorus]\nSay I'm hittin' on two by two (Two)\nThey watch tryna do what I do (Do)\nKnow I'm poppin', tryna screw who I screw (Screw)\nEvery step tryna move where I move (Move)\nWhy you keep playin' games with me? (Ayy)\nThis ain't no 'Skip to My Lou' (Lou)\nAnd you keep on lockin' your tooth (Tooth)\nBut you didn't know I been had the juice (I been had the juice)\nHow you gon' get mad at me (Me)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (Ayy)\nHow you gon' get mad at me (Me)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (Ayy)\nWhen I pull a you on you? (You on you)\nI pull a you on you (I pull a you on)\nI pull a you on you (I pull a you on)\nI pull a you on you (I pull a you on)\nI pull a you on, I pull a you on\nI pull a you on you (I pull a you on)\nI pull a you on you (I pull a you on)\nI pull a you on you (I pull a you on)\nI pull a you on, I pull a you on", "title": "You On You"}]}