{"artist": "Asher Roth", "songs": [{"title": "Bad Day", "image": "https://images.genius.com/530d3219cbffab25c91a88faa96b0d3a.475x475x1.jpg", "album": "Asleep in the Bread Aisle", "lyrics": "[Intro: Asher Roth]\nUh, and it just keeps goin (yeah)\nAnd it just keeps\n\n[Verse 1: Asher Roth]\nSo I'm in the airport getting ready to leave\nHeading to a friend's wedding in the N.Y.C\nBut my head has been spinning, I'm forgetting to eat\nAll this jet setting has been really getting to me\nIt's already 11:20, I'm ready to sleep\nBut instead I end up sitting in a 27-C\nAn aisle seat, fine by me\nBut the guy that's inside's always tryin to pee\nWith a wild child behind me, he's cryin and keeps\nFlippin out and kickin at me while he violently screams\nSo I silently plea, oh God, please\nLet there be a honey sitting 27-B\nBut of course some morbidly obese\nBeast is in the seat that wheezes when he breathes\nDude sitting D is at least three deep\nAnd he keeps telling me what is wrong with his knees: (I got bad knees)\n'Osgood Schlatters,' just need water\nBut for a bottle they charge two dollars\" (what?)\nAnd when I thought that it couldn't get worse\nI forgot my iPod\n\n[Hook: Jazze Pha + Asher Roth]\nI'm havin a bad day\nNothin ever seems to go my way\nEverybody needs to go away\nWhy? Because I'm havin a bad dayyyyy, yeah\nHey hey, and it just keeps goin (keep goin)\nAnd it just keeps (goin on!)\nAnd it just keeps goin (keep goin)\nAnd it just keeps (goin on)\n\n[Verse 2: Asher Roth]\nSo four hours and turbulence\nWe land when I'm about to turd in my pants\nBut the captain has \"Seatbelt fastened\"\nSo my ass is just passin gas and\nThen at last I escaped from the plane\nWhen I'm minutes away from clinically insane\nI make my way towards baggage claim\nWhen I hear a high-pitched voice scream my name (Asher!)\nSome dumb bitch I went to high school with\nWhile I'm sweating she's telling me she likes my shit\nI just smile and think, 'bout how great it would be\nIf I could just hit this chick with a quick leg sweep (leg sweep)\nSo I pick up my L.L. Bean\nAnd beeline for the next taxi\nIn need of weed, and boxer briefs\nBut my bag's only got Maxi's\n\n[Hook: Jazze Pha + Asher Roth]\nI'm havin a bad day\nNothin ever seems to go my way\nEverybody needs to go away\nWhy? Because I'm havin a bad dayyyyy, yeah\nHey hey, and it just keeps goin (keep goin)\nAnd it just keeps (goin on!)\nAnd it just keeps goin (keep goin)\nAnd it just keeps (goin on)\n\n[Verse 3: Asher Roth]\nI check in to my hotel room\nAnd I pick up my cell phone to dial the groom\nTell him my mood and how I'm ordering food\nAnd I'm probably gonna stay in and watch a movie\nBut the tube has no HBO (what?)\nSo anything I want, yo I'm paying fo'\nBut I'm lame and broke, so I'm laying in a robe\nWatching that \"Little People, Big World\" show\nRight then there's a knock at the door\nIt's my last hope for a Spanish whore\nWho will change my sheets in exchange for penis\n\"Hi, I've lost my cat; have you seen it?\"\nJesus, this day is the worst\nAt least I can give Little Me a jerk\nAnd then go to sleep, healthy and disease-less\nIt guess it could be worse; but I'm just\n\n[Hook: Jazze Pha + Asher Roth]\nI'm havin a bad day\nNothin ever seems to go my way\nEverybody needs to go away\nWhy? Because I'm havin a bad dayyyyy, yeah\nHey hey, and it just keeps goin (keep goin)\nAnd it just keeps (goin on!)\nAnd it just keeps goin (keep goin)\nAnd it just keeps (goin on)\n\n[Outro: Jazze Pha]\nHey, and it keep goin onnnnn\nHahahaha, yo", "year": "2009-04-20"}]}