{"artist": "Vakill", "songs": [{"title": "Sweetest Way to Die", "year": "2003-01-01", "lyrics": "[Verse I: Vakill]\n\nThe summer was 1987\nI was king of graff\nWild hundreds\n119th the ave\nI had the south locked cleverly\nI was stocked heavily\nShoe polish, Krylon\nHello my name is thick as my game was slicker\nDidn't need a black book\nI could lay out a piece off of memory\nHalf hour flat like it was ten of me\nAnd still have time to flip my enemies names\nUpside down\nIf you was toy then that was penalty\nFrom petty tags to full blown color crescendos\nBlackbooks to scratch bombin' the bus window\nI was addicted\nBut every time I'd stopped those flames rekindled\nCuz the fame's what I was mainly in for\nOne day my niggas gave me info\nI was number one on the vandalism's guest list\nAnd cops is restless\nThat's when the phone ring\nIt was five-0\nSorry wrong number\nShit it's about to be a long summer\n\n(phone ringing)\n\nVakill: \"Damn five-o, shit, I gotta think fast...\nI gotta get the fuck outta here\"\n\nSome Ho: \"You gonna answer the fucking phone or what?\"\n\nVakill: \"Naw, don't touch that shit, it's bill collector.\"\n\n\n[VERSE II: Vakill]\n\nThe name I made in the streets is now a name\nToo strong to mention\nI was drawing the right shit\nBut now I'm drawing the wrong attention\nIt seems my graffiti most flaunted\nMade me see P.D's most wanted\nI'm most wanted in particular by this plain clothes cop\nNamed Agorn\nAnd writers for niggas he plague on\nLast year he caught one of my peeps\nAnd pushed him off the L platform\nIn front of a train\nAnd now his legs gone\nAnd I already got two strikes for the same shit\nThree's a felony\nThat would make my mothers brain flip\nIn the judges eyes\nI'm a youth of troubled caliber\nFuck community service\nI'll do a couple calendars\nI ain't built for that\nI ain't got that kinda frame god\nMy brain scarred visioning\nThat time behind the same bars\nPaged Memo ass twice\nShit I wish this fool call\n(Phone rings)\"What up VAK?\"\nMeet me at the pool hall\n\nVakill: \"Yo call your shot nigga\"\n\nHOMIE:  \"I got yellow on the corner dude, whats up with this taggin' bullshit dude?\"\n\nVakill: \"I'm sayin' man, I ain't sweatin' that shit, they ain't gonna catch me alive\"\n\nHomie:  \"Dude, you ain't making no money off of that punk shit dude\"\n\nVakill: \"It ain't about the dough, its about hip hop yo, its hip hop\"\n\nHomie:  \"Dude your looking like shit with paint chips all over your fucking legs\"\n\nVakill: \"It's alright though, I'm too clever, they'll never get me....\"\n\n[VERSE III: Vakill]\n\nQuarter after nine\nWhile creepin' home\nIt grabs my mind\nI'm facing ten years of math combined\nAnd guaranteed to serve half the time\nThats five years too many\nFor a supposedly graff\nDesign path to crime\nI need to lay low\nAnd what would do me some good\nIs a couple days of street separation\nI'm suffering from sleep deprivation\nIncarcerated nightmares\nGot me waking up sweatin'\nIn deep perspiration\nI lit up a bag of boon\nThat's when it hit me starin'\nAs the cloud shaped weed smoke\nAnd the aerosol loomed\nI'mma do the illest piece\nThen close every window in the room\nTill I'm consumed by the aerosol fumes\nMaybe jail got me suicidal\nOr maybe this will make me an\nA underground legend\nA sewer idol\nNo regrets and no sad goodbyes\nShit I'd rather it be this way\nThis was the sweetest way\nTo die...", "album": "The Darkest Cloud", "image": "https://images.genius.com/f0fa8d572f04773a721576175bcefb21.488x500x1.jpg"}]}