{"songs": [{"lyrics": "[Intro: Marvin Gaye]\nDreamed of you this morning\nThen came the dawn, and\nI thought you were here with me\nIf you could only see\nHow much I love you\nThat's all, that's all baby\nOh no-oh, I never gave up no way\nI never, felt that before\nOh no-oh, I never gave up no way\nI never, felt that before\nOh no-oh, I never gave up no way\nI never, felt that before\nBut there's always; that's all, that's all baby\n\n[Verse 1: Jay-Z]\nUhh, uhh!\nThis is the shit you dream about with the homies steaming out\nBack-to-back, backing them Bimmers out\nSeems as our plans to get a grant\nThen go off to college, didn't pan or even out\nWe need it now, we need a town\nWe need a place to pitch, we need a mound\nFor now, I'm just a lazy boy\nBig dreaming in my La-Z-Boy\nIn the clouds of smoke, been playing this Marvin\nMama forgive me, should be thinking about Harvard\nBut that's too far away, niggas are starving\nNothing wrong with my aim, just gotta change the target\nI got dreams of bagging snidd-ow, the size of pillows\nI see pies every time my eyes clidd-ose\nI see rides, sixes, I gotta get those\nLife's a bitch, I hope to not make her a widow\n\n[Chorus: Marvin Gaye sample (Jay-Z)]\nOh no-oh, I never gave up no way\nI never felt that before\n(American dreamin')\nOh no-oh, I never gave up no way\nI never felt that before\n(I'm just American dreamin')\nOh no-oh, I never gave up no way\nI never felt that before\n(American dreamin')\nBut there's always, that's all, that's all baby\n\n[Verse 2: Jay-Z]\nUh, uhhhh!\nNow see the life's right there, and it seems right there\nIt's not quite near, and it's not like we're\nProfessionals, moving the decimals\nKnow where to cop? Nah! Got a connect? No!\nWho in the F knows how to be successful\nNeed a Personal Jesus, I'm in Depeche Mode\nThey say its celestial, it's all in the stars\nLike Tony La Russa on how you play your Cards\n'Cause y'all ain't fucking with me! The ironies are\nAt all costs better avoid these bars\nNow let's start, on your mark\nGet set, let's go, get out the car\nGoing in circles it's a vicious cycle\nThis is a crash course, this ain't high school\nWake up Muttley, you're dreaming again\nYour own reality show, the season begins\n\n[Chorus: Marvin Gaye sample (Jay-Z)]\nOh no-oh, I never gave up no way\nI never felt that before\n(American dreamin')\nOh no-oh, I never gave up no way\nI never felt that before\n(I'm just American dreamin')\nOh no-oh, I never gave up no way\nI never felt that before\n(American dreamin')\nBut there's always, that's all, that's all baby\n\n[Verse 3: Jay-Z]\nStep one in this process: scramble up in your projects\nAnd head to the heights where big coke is processed\nYou gotta convince them that you're not from the precinct\nPlease speak slow 'cause he no speaky no English\nIf he takes a liking after a couple of trips\nAnd your money is straight, he's going to give you consignment\nYou're now in a game where only time can tell\nSurvive the droughts, I wish you well - hold up\nSurvive the droughts? I wish you well?\nHow sick am I? I wish you health\nI wish you wheels, I wish you wealth\nI wish you insight so you could see for yourself\nYou could see the signs when the jackers is scheming\nAnd the cops is coming, you could read they mind\nYou could see from behind, you could redefine\nThe game as we know it, one dream at a time\nI'm, American dreamin'\n\n[Chorus: Marvin Gaye sample (Jay-Z)]\nOh no-oh, I never gave up no way\nI never felt that before\n(American dreamin')\nOh no-oh, I never gave up no way\nI never felt that before\n(I'm just American dreamin')\nOh no-oh, I never gave up no way\nI never felt that before\n(American dreamin')\nBut there's always, that's all, that's all baby\n\n[Outro: Jay-Z]\nAmerican dreamin'", "title": "American Dreamin’", "image": "https://images.genius.com/778c1892b8a2f5aee554c4c797ca8915.1000x1000x1.jpg", "year": "2007-11-06", "album": "American Gangster"}], "artist": "JAY-Z"}