{"artist": "Problem", "songs": [{"album": "Welcome to Mollywood 2", "title": "D2B", "image": "https://images.rapgenius.com/8beb331a39ec39c79902fafbe7fde070.500x500x1.jpg", "lyrics": "[Hook]\nGirl what's wrong? my man ain't shit\nGirl what's wrong? my man ain't shit\nGirl what's wrong? my man ain't shit\nBut why you won't leave em\nCause bitch D2B, D2B, D2B, D2B, D2B, D2B, D2B\nCause bitch D2B, D2B, D2B, D2B, D2B, D2B, D2B\nCause bitch D2B\n\n[Verse 1: Problem]\nYeah I'm dickin' her down\nThrow it in my face, let her sit where I smile\nIn the bedroom it ain't no rules\nBurnin' that pussy like it got own shoes\nWhat? make me shoot it first, first like Kobe\nWhen I'm done do the beat it up dance like Jody\nHave the ass makin tacos, cleanin the shit\nDo you fuck other girls? pleading the fifth, wall out\nDon't be asking no questions\n, hey what the boy be bout\nHold up, don't let me catch you with another nigga though, what?\nI might start choking you out\nYeah stroking you out, beating it, eating it slow\nKeeping it wet like I'm selling the shot\nSuck suck on your nipples while I play with the hole\nYeah we doing it big, you better take all this spot\n\n[Hook]\nGirl what's wrong? my man ain't shit\nGirl what's wrong? my man ain't shit\nGirl what's wrong? my man ain't shit\nBut why you won't leave em\nCause bitch D2B, D2B, D2B, D2B, D2B, D2B, D2B\nCause bitch D2B, D2B, D2B, D2B, D2B, D2B, D2B\nCause bitch D2B\n\n[Verse 2: Bad Lucc]\nPut it all on her tummy\nShe on my dick like black people in jen and rummy\nHey stop callin to see about\nWhen she turn the frany crazy you gotta key about me\nStab the pussy like a knife fight\nDisrespectful with the dick I'm what your wife like\nI'm on a corner maintainin' the shit\nShe pull up like a nigga you out here slangin that shiiiiiiitttttt\nYeah that, and if I hold out on her she want her bread back\nTensive nigga like she gonna when hear that\nAnd eat that pussy pipe down nigga hear crack\nYou mad I got her under my spell cause you trap\nShe be rolling with the nigga cause I rap with that dick\nAnd so far you burp like you bad\n\n[Hook]\nGirl what's wrong? my man ain't shit\nGirl what's wrong? my man ain't shit\nGirl what's wrong? my man ain't shit\nBut why you won't leave em\nCause bitch D2B, D2B, D2B, D2B, D2B, D2B, D2B\nCause bitch D2B, D2B, D2B, D2B, D2B, D2B, D2B\nCause bitch D2B\n\n[Verse 3]\nI'm going all out, all out\nHe got that good dick ball out\nThe dick so big he don't fall out\nFu-fu-fuck me so good make me crawl out\nI need that asap\nI see them bitches in the club tryin to take that\nBitch, my pussy so good make em pass that\nWhat I look like lettin another bitch have dat\nYou better hit my line boy\nIt's night time ima take you like a crime boy\nThat dick all in my mind boy\nThe way I rhyme make it bust like a nine boy\nGive it to me fast, give me now, give me later\nMhm give me that shit, I'ma make it\nGive it to me fast, gimme now, gimme later\nMhm give me that shit, I'ma make it\n\n[Hook]\nGirl what's wrong? my man ain't shit\nGirl what's wrong? my man ain't shit\nGirl what's wrong? my man ain't shit\nBut why you won't leave em\nCause bitch D2B, D2B, D2B, D2B, D2B, D2B, D2B\nCause bitch D2B, D2B, D2B, D2B, D2B, D2B, D2B\nCause bitch D2B", "year": null}]}