{"songs": [{"image": "https://images.genius.com/3e0642e0d60983bc42f6672798b48508.1000x1000x1.jpg", "title": "Samaritan", "album": null, "year": "2013-12-07", "lyrics": "[Bridge]\nHad a dollar and dream\nInside my pocket\nTook a step to the left and start walkin\nTalkin' like\n\"How am I gon' get home tonight?\nI left my bus card, on the night stand\nBy the kitchen.\"\n\n[Hook]\nSamaritan, samaritan help me please\nSamaritan, Samaritan be good to me\nSamaritan, Samaritan be good to me\n\n[Verse 1: Noname Gypsy]\nI met a wise man on the corner of an island, in Thailand\nA good man, he helped me with my finance\nHe told me my life span would span a lifetime of phone calls\nAnd staplers and people to piss off\nBut I reminded him I barely could read\nI graduated high school, happy I even got C's\nCause the D's and F's was lookin' hella grimey\nBaby sister smilin' at me, just happy to come behind me\nDon't ask me what I look like in the darkness\nSit still for too long, your own bones become cathartic\nGot me feelin' like I'm tall, dumb, and ugly\nMake a home on the stage where all of the people love me\n\"She's so lovely, rappin' about her broken\nWearin her false lashes and hopin she gettin chosen\nYou a female rapper. Don't rap about that shit\nYou 'sposed to be a bad bitch or at least a little confident.\"\n\n[Bridge]\nHad a dollar and dream\nInside my pocket\nTook a step to the left and start walkin\nTalkin' like\n\"How am I gon' get home tonight?\nI left my bus card, on the night stand\nBy the kitchen.\"\n\n[Hook]\nSamaritan, samaritan help me please\nSamaritan, Samaritan be good to me\nSamaritan, Samaritan be good to me\n\n[Verse 2: Noname]\nWelcome to verse two\nThis where it gets sticky\nThe dollar I once had, had dream of a buck fifty\nEven the money'll leave you for the money\nHad the nerve to look at me and tell me, I was hella bummy\n\n[Verse 3: Mick Jenkins]\nHella funny comin' from a nigga with a homeless soul\nSee commercials how they out here sellin' broken dreams\nMild situations of escape, check the Oprah show\nCouldn't fly out the hood with a boneless wing\nBack porch planning my campaign\nTwistin' some shit and sippin' some shit\nThat bubble like champagne\nNoses in the air for that dank shit\nPinkies in the air for that Hilary Swank shit\nMillion dollars a deal, make em' tell em escape\nThat fact that he so chill about it, compel em' to hate\nThe women that I court like appelates compel him to think that\nI only do it, bad, like Blanket's dad\nThat's Michael Jackson, you sleepin, but how you sleep on that?\nWhen I'm takin' niggas higher, like it's tree on deck\nAnd it's tree on deck. Canada Dry on the rocks, watch\nThe poetry started in coffee shops, I'm used to the grind\nI could wait for the cream, it's no sugar in that\nNot even strings attached, Gepetto could pull him an act\nCompetitors ruling out, I compel them to pull the facts\nMy resumé been faxed, ain't thinkin gold until I'm Goldman Sachs\nUntil a nigga records gettin' mad spins in your Cul-de-sac\nDon't distract, though the key to this is preservation\nI pray your prayers reaches elevation\nJust see them snares as a symbol for the simple and it's sinful\nHave a glass of ginger ale, It's a celebration\nWord"}], "artist": "Noname"}