{"artist": "Ice Cube", "songs": [{"title": "Get Off My Dick and Tell Yo Bitch to Come Here (Remix)", "lyrics": "[Flavor Flav] Stay off his dick!\n\n[Verse 1: Ice Cube]\nNigga, some don't think I can flow, so here we go\nTo a new track, to show the wack, that I can throw\nStyles that show up, I blow up and blast here\nNiggas still tripping off the shit I said last year\nAbout a bitch is a bitch is a ho is a slut\nAnd I don't like niggas on my nuts!\nSo I dedicate this one to the groupie\nAnd the Charlie, all on my Snoopy\nBrothers keep askin, \"Ice Cube yo when will you bust\"\nThey surround me and make a big fuss\nNow I was taught, back on my block\nThat you don't ride on nobody's jock\nFor anything they do, FUCK him and his crew\nUnless, you were gettin paid too!\nI'm not saying this to diss each and every fan\nWomen you can ride; men, be a man!\nShake my hand, and make it a FIRM shake\nSay, \"Whattup Ice Cube?\" and then break\nCause if you're hanging near I'mma tell you loud and clear\nGet off my my dick, nigga, and tell your bitch to come here\n\nMotherfucker, back up off me\nI'm not signing no autographs, I'm not giving no free t-shirts\nAnd I'm not HAVING none of this bullshit you're talking\nYouknowhatI'msayin?\n\n[Verse 2]\nI step into the club to rub-a-dub\nIt seems like all the little hoes fall in love\nWith my money, cause yo about a year ago\nI was just your ordinary average everyday crazy ass broke\nBut you know, I just can't be equal\nCause they know I know a lot of famous people\nBut to a one-night stand, there's no sequel\nHere's the pickle, pretend it's a Popsicle\nSee, for a fat booty, I do damage\nThey think I'm a star, so I take advantage\nIt's just another Ice Cube groupie fest\nShe's a ho cause they knew her at the front desk\nTold her to meet me at the room 110\nAnd the bitch showed up with her boyfriend\nI let him in, all he could do was grin\nHe had a camera, a t-shirt, a pad and pen\nHe said, \"Yo, Ice Cube, can you sign this?\"\nI only did it cause his bitch was the finest\nShe blew me a kiss and gave a bitter frown\nLike, \"How can we get rid of this clown?\"\nMe and her sat down, he got a little jealous\nCause his punk ass sat in the middle of us\nAnd he asked me question after question\nIt felt like a motherfucking interview session\nThen his girl got up, I heard the door shut\nAnd he was still there, swinging from my nuts\nI said, \"Get the FUCK out!\" and made it loud and clear\nGet off my dick, nigga, and tell your bitch to come here\n\nI see me about ten mark ass motherfucking fans\nKnock on the door, talking about whassup?\n\nYo man, it was about a hundred and twenty dicks man\nNiggas start, niggas coming out of hotel rooms\nWithout no bitches!\n\nThey can get gaffled like they in a motherfucking raffle\nPunk ass\n\n[Verse 3]\nYo, I respect the respectable\nIf your girl is all on my dick, check the ho\nSay, \"Yeah that nigga he can rap fly\nBut you know, stars are up in the sky\"\nCause all I got is hard dick and bubblegum\nJust ran out my last stick is where I'm coming from\nI'm not telling you to diss Mr. Ice Cube\nCause you know, I'm the one that can show and prove\nNow groupie girls, I just make em wait\nBut the groupie boys, I can't tolerate\nI hate it so much, I'mma start giving stitches\nTo the niggas that's staring like bitches\nCause I'm not a fairy, a Mary or a faggot\nGimme the eye, I'll fly, and tag it\nNow you see? Jocking ain't healthy\nCause you think that I'm young and I'm wealthy\nWith juice, so I see you try to run behind\nBut I'mma tell you, punk, you gets none of mine\nCause I was taught, see a fool, use a fool\nBy the niggas who terrorized the old school\nSo don't try me or buy me a beer\nJust stay off my dick, nigga", "image": "https://images.genius.com/6c223fafae72a06b4952ce4b3f7e6b7a.992x991x1.jpg", "album": "Kill at Will EP", "year": "1990-12-18"}]}