{"artist": "Big Boi", "songs": [{"lyrics": "[Intro]\nHey man, when was the last time you went tea-bagging?\nMust be tea time!\n\n[Chorus: Janelle Monáe]\nBe still, young heart\nNever will you fall apart\nBe still, young heart\nNever will you fall apart\nBe wise, my dear, you must learn to just be still\nUntil you really, really know\nShow me you're right, shine your light\nI wonder when will I know\n\n[Verse 1: Big Boi]\nTo hell if I don't prey\nLike a mannequin in the window, I don't say\nA word, I like to sit back, observe\nMy heart says do not disturb, and yours\nIs like a doorknob, everybody get a turn (Yeah)\nNow that's a turnoff, girl, I'm not concerned\nMore like the early bird tryin' to get the worm, worm\nBut not on those terms, you got on my nerves\nSay I don't deserve you, you're gonna learn\nTreat it like a perm, leave it be or let it burn (Burn)\nEat 'em like an urr-ange, orange\nSo when they on the verge of leavin', it don't get borin'\nForeign trips are taken just to see your smiley faces\nTime's a-wastin' and I don't like to waste no time\nYou can be down or... yeah\n\n[Chorus: Janelle Monáe]\nBe still, young heart\nNever will you fall apart\nBe still, young heart\nNever will you fall apart\nBe wise, my dear, you must learn to just be still\nUntil you really, really know\nShow me you're right, shine your light\nI wonder when will I know\n\n[Verse 2: Janelle Monáe]\nI love being in love (Being in love)\nThen you let me down, turned my heart around\nGivin' up on love makes my ocean drown\nYou lived in my heart\nSecret melodies haunt me at night\nMaybe lies and lullabies\nThis is my last farewell\nYou let me down\n\n[Chorus: Janelle Monáe]\nBe still, young heart\nNever will you fall apart\nBe still, young heart\nNever will you fall apart\nBe wise, my dear, you must learn to just be still\nUntil you really, really know\nShow me you're right, shine your light\nI wonder when will I know\n\n[Verse 3: Big Boi]\nYeah, from behind the Cadillac do'\nGrip this wood, slide around real slow\nJust thinkin', mind blown\nAs I glare through the smoke tinted windows\nI be still\n\n[Chorus: Janelle Monáe]\nBe still, young heart\nNever will you fall apart\nBe still, young heart\nNever will you fall apart\nBe wise, my dear, you must learn to just be still\nUntil you really, really know\nShow me you're right, shine your light\nI wonder when will I know\n\n[Skit]\nI came up here, finna come down and get me something to eat, take me a bath, know what I'm saying?\nBubba walked over to the phone booth, askin' 'bout the blue flame\nI told 'em they ain't got nothin' but some big booty hoes down there\nAlright\nAin't no drug transactions being made, I don't sell no drugs\nSo, so where did he get the crack from?\nBoy, I could not tell you that! If I had some crack, I would be smoking it, I use drugs, I don't sell no drugs\nOkay, so we gon' take this little 30 dollars then book it into evidence\nWe ain't got to do that, brother! I sit down and told you I ain't sold that man no crack, I don't know where he brought that crack from!\nI had them same 30 dollars that I had when I walked over there, 'cause I'm goin' in my pockets to get my money out and make sure I had change to use the phone!", "image": "https://images.genius.com/d490a9246c93be0a14dc0d13699d97a2.908x908x1.jpg", "year": "2010-07-06", "title": "Be Still", "album": "Sir Lucious Left Foot... The Son of Chico Dusty"}]}