{"songs": [{"year": "2013-09-27", "title": "Firing Squad", "image": "https://images.genius.com/3cb6aaa4a0525c2741ec6d4b143ada0c.960x960x1.jpg", "lyrics": "[Intro: Sadistik]\n(Ah, the simple life)\nYeah, this is my rifle\nThere are many like it, but this one is mine\n\n[Verse 1: Sadistik]\nI had a heart of gold, I wore it on my sleeve\nVampire bit my arm and then it tore in three\nI melted down the pieces and sold them for a fee\nAnd all I got was some boredom from the normalty\n\n[Verse 1: Ceschi]\nBorn to bleed\nProbably never get more than what's been thorn from me\nSwarms of bees\nStill sting to the rhythm of a Grindcore horrible scream\nMorrissey\nTaught me never to forget those pretty girls who make graves\nBut could it be a mistake to ache, I'm Joan of Arc\nBurning on a stake this day and age\n\n[Verse 2: Sadistik]\nAll I ever wanted was to cut open my stomach\nLet the butterflies go back home, that's all I know\nThat's Prozac, notes pass through me\nUsually, I don't show that spooky side\nI hide a mile high, shine so bright I might go blind\nIdle eyes, rifle sights, cycle go through my vital signs\nWith a title fight, never rival side and silly motherfucker with a psycho mind\nI go on a high note like a Bible line, but I don't lie though\nSo fire those, nice rifles at my temples, watch me die slow\nWatch 'em all agree I'm monster in the pm\nAnd marijuana Tijuana caught up in Tequila\nOnomatopoeia when the heart beats off-beat\nI don't wanna be another xerox\nCopy, watch me, re-animate a zombie\nMelancholy's always on my mind, my my mind may defy\nMy mine own guidelines that I know, they'll probably bite soon\nSo when High Noon comes, I'll set down my two guns\nTick-tock, quickdraw, instant, these holes are my own flesh\nCount to five, bound and tied and blindfolded\nThey ready, they aim and now I'm so\nDead\n\n[Verse 3: Ceschi]\nDistance makes the heart grow fonder, so I pulled mine outta my chest\nHurled off to the deepest, darkest black yonder into a hornets nest\nWhere they picked apart everything I loved and left the remains for the birds\nBroken, aimless, but we’re famous, painted, God never could maintain his work\nComplex of these poison tounges, life has tested me more than once\nTook the best of me, fucked aggressively, fed me to the wolves for my gods\nTo a thousand tiny red pixels covering your canvas\nEvery single syllable I spit is a pivotal piece of me unleashed\nRepresenting my tangled anguish\n\n[Verse 4: Ceschi]\nAll I ever wanted was to cut open my stomach\nAnd strangle my enemies with the intestines that I pull from it\nAnd I've been a bull running, everytime I seen red the scene fled\nKnow that my motherfucking team was best\nBut please believe the week, everything the magazines the teens fed\nSo when I scream it from the top of my lungs I mean this plead\nWith the streets that leave my team dead\n\n[Outro]\n\"Emotionally I have a lot of pain, and I'm stunned that six human beings would stand in front of one human being and fire 46 shots. I just don't understand that. It appeared to be a firing squad dressed in police uniforms.\"\n\n(Fuck the police! Fuck the police! Nine to yo dome like, Fuck the police!\nFuck the police! Fuck the police! Nine to yo dome like, Fuck the police!)", "album": "Firing Squad"}], "artist": "Sadistik"}