{"songs": [{"image": "https://images.genius.com/f0d1da80eb06e99f84f0aafd0c194d0f.1000x1000x1.jpg", "year": "2018-08-15", "lyrics": "[Verse 1: Little Simz]\nPlay it seven times over, it's the seventh time, seventh day\nGimme seven lives, when I'm done with seven, gimme eight\nSeven colours in the rainbow, what happened to grey?\n2007, chose a path and decided my fate, facts\nMind's blown, seven doobies to the face\nRolled seven prayers but had eleven in my brain\nFeeling stranger things every time that I bring the forcefield light\nI'll be Snow White with my seven dwarves, can't lie\nRuns through my mind, meetin' heaven's door\nOh, I cannot get through life showin' no remorse, no time\nWhat if you roll seven on the dice?\nWhat if you get to know me and find out I got seven sides?\nWait – will you wanna be free?\nWatch Aladdin with your third eye, you'll see\nNever got three wishes from a genie\nIn the real world, not your dreams be way too deep\nBeginning, middle and end, everything is me\nBeginning, middle and end, everything is three\nMind, body, and soul; birth, life, and death\nPast, present, and future, goin' over your head\nToo ahead, too much of anything be bad for you, need balance The yin and yang is never bad for you\nThe good and the bad, men and women, they unite\nEverything is everything, everyone is too alike\nWay too similar, need individuality to strike\nToo much chat, not enough, doin' whatever is right\nAm I right or am I right? Right?\nFeelin' too damn high, still I'm glad I'm\n\n[Verse 2: Joe Newman]\nNeon, neon, neon\nA blue neon lamp in a midnight country field\nCows surround so you lean on, lean on\nSo much your hugs become hold-ons\n\n[Verse 3: Little Simz]\nThe ones who tell you tell you how it really is\nThey trick you into believin' there's only one winner here\nWell, fuck it, I'm comin' first, in the condition to work\nAll I need is one mic, get you one last verse\nI've got one voice, once chance, one mother, one past\nOne pair of heels, one nose ring, one car, one goal\nWill it ever change? Who knows\nOne day, a little me, ten fingers, ten toes\nTen friends turn foes, you know how it goes\nTen songs for you, twelve days, ten shows\nBy the age of ten, I was already on a roll\nStayin' out past ten, right, and Mummy didn't know\nTen crack commandments, Biggie taught me so\nHome, but my body's still on ten different time zones\nBeen livin' in flight mode, ten seats on the plane\nHow I get here? Man, I thought I'd never see the day\nStill, it came\n\n[Verse 4: Joe Newman]\nNeon, neon, neon\nA blue neon lamp in a midnight country field\nCows surround so you lean on, lean on\nSo much your hugs become hold-ons\n\n[Bridge: Little Simz]\nSee you where I'm at, see you where I'm at\nSee–see you where I'm at, right?\nSee you where I'm at, see you where I'm at\nMake a wish, cannot take it back\nFuck it, I'll relax, neon lamps\nNeon lamps (Neon lamps)\nMake a wish, cannot take it back\nCannot take it back, cannot take it back\n\n[Verse 5: Joe Newman]\nWell, that smell of sex\nGood like burning wood\nThe wayward lad laid claim\nTo two thirsty girls from Hornsea\nWho left a note when morning came\n\n[Verse 6: Little Simz]\nAlways told I'm unreadable, unbeatable\nThese days unreachable, my number's seasonal\nStill, I love you\nNiggas know my karma pays the truth from a lick of youth\nNothing I love more than being here, in and out of booths\nStill, I miss you\n\n[Outro: Ellie Rowsell]\nGirls from the pool say \"Hi\" (Girls from the pool say \"Hi\")\nThe road erodes at five feet per year\nAlong England's east coastline\n\"Was this your first time?\" (\"Was this your first time?\")\n\"Love is just a button we pressed\nLast night by the camp fire\" (\"Last night by the camp fire\")", "title": "3WW (OTG Version)", "album": "REDUXER"}], "artist": "​​alt-J"}