{"songs": [{"album": null, "year": null, "title": "Already", "image": "https://images.genius.com/cf5f9dac15a8dd46feb029634a1ae995.749x749x1.jpg", "lyrics": "[Verse 1: J.R. Writer]\nHit the club, different kind of toy\nBunch of sour in the air, middle finger to the boys\nThe bitches love how I'm living -- you annoyed?\nLeave them cowards over there; man, them niggas ain't employed\nI'm a boss, I ain't gotta talk\nHow you puttin' on? Man, you need to knock it off\nI be in my zone while you feeling kinda lost\nCouple shots of the Patron got me feeling kinda sauced\n\n[Hook: J.R. Writer]\nSo I'm ready; I been ready already\nBunch of diamonds in the pink Prezi, all heavy\nYou ain't know we get plenty, talk feti\nYou just starting out, I been ready already\nAlready already already\nAlready already already\nYou ain't know we get plenty, talk feti\nYou just starting out, I been ready already\n\n[Verse 2: J.R. Writer]\nYou ain't gotta give a fuck that I'm nice, though\nBad mami in the truck, Heights flow\nDon't know how I give it up, but your wife know\nI still got it on tuck, nigga -- lipo\nSick with the rap tracks, this is a mismatch\nKing of the crack raps, you niggas been wack\nThing in the knapsack, don't get your wig cracked\nGimme that that that -- come get your shit back\nWhere we at? All in, going all out\nGet to talking, that's because they all mouth\nAsk your bitch, she know what I'm all 'bout\nI'm so sick, nigga, I should call out\nLittle Hennessey, different kind of energy\nSicker with the punch, even sicker with similes\nRemember me? We gon' have to talk feti\nYou can have that -- I done had it already\n\n[Hook]\n\n[Verse 3: Vado]\nYou ain't gotta give a fuck, but don't get indicted\nGot my bars up without a liquor license\nThey hear them bars up, they like, this nigga writing\nSame bitches have you starstruck, a nigga piping\nI'm at a table full of devils bacuto\nGripping metal, single sipping with Uno\nShit is pathetic -- niggas better than who, though?\nI'm living the legend I'm gonna be when I'm through, though\nGet 'em, yeah nigga let's get 'em\nSic 'em, get the dogs to rip 'em\nThe next bars, I did 'em\nYou can't bullshit him\nWould sport Jordans, Pippens around hood denim\nQuick to floss in an instant, send you off from a distance\nBottom six inches, red alert like she mixing\nGet work, let's fix it, you all ready\nSpeakers in the trunk, hear it knocking all heavy\nVato\n\n[Hook]"}], "artist": "J.R. Writer"}