{"songs": [{"title": "Better Than Ever", "lyrics": "[Intro: Jeezy and DJ Drama]\nDRAM!\nWassup, my nigga?\nI'm still here, nigga, I ain't go nowhere\nI see you got ya wiggle on\nAffiliates you fuck niggas\nPay attention\n\nChea, Chea\nFuck goin' on out there nigga\nHeard a lotta lil niggas talkin' reckless\nI drink Rosé like you niggas drink Heinekens nigga\nBy the bottles nigga\nRoll blunts bigger than you lil niggas, man\nFuck wrong with these niggas?\nBetter chill out 'fore I shut that side of town down, nigga\nWon't nunna y'all niggas be eatin'\n\n[Verse 1: Jeezy]\nI'm back...better than ever\nStayed on my grind, stacked up some mo' cheddar (Aye)\nStay outta my way, lil niggas you know better\nBefore the fif' go clap\nBetter stick to rap (BOW!)\nA round of applause, the whole clip\nI'll come where ya at, nigga don't eem trip\nYou see I ain't arrogant, just confident\nAnd when I tell you I'm the best it's not a compliment (nope)\nMore like the truth\nThe shit was a wrap when I stepped in the booth (Chea!)\nThem GFGs got the coupe lookin' silly\nOne month on the road, came home with a milly (Ha HAAA)\nGet my grown man on, cuz I'm not a kid (nope)\nAnd I had a vision, like Alex did (Yeeeeeeeah)\nI'm a muhfuckin' clown\nFor my birthday, I shut the whole city down (Daaaaaamn)\nComparin' me to who? I'm in a league of my own\nNext year I'll throw it at the Georgia Dome (Ha Haaaaa)\nReal talk I'm a muhfuckin' fool\nTwo-time loser, still ridin' with the tool (YEAH!)\nThe hood rats, they say \"He so crazy!\"\nTake my time with it, the flow so lazy (YEAH!)\nWord on the street is that I'm goin' commercial\nBitch, I'll stop what I'm doin' 'fore I go commercial (Ha Haaaa)\nGot 99 problems, and money ain't one (nope)\nGimme a minute, see ya boy ain't done (uh uh)\nThem haters want me gone\nThem folks want me locked up\nPlus, I heard a few niggas want a nigga chalked up\nDamn, niggas wanna stick me for my paper\nIt's okay, see I'm strapped anyway (Ha Haaaa)\nThese niggas don't understand me\nThese niggas can't comprehend me, why I ride that candy\n'92-'93, I was drillin' them niggas\n'94-'95, I was killin' them niggas\n26 for the bizz-ird\nAnything lizz-ess\nIs just absizz-urd (Ha HAAAAA)\nSame ole routine, Monday to Friday\nBricks in the trunk, nigga, I'm on the highway (Let's get it!)\nBest believe I was 2 cars back\nMy nigga bring 'em back for a couple of stacks (YEAH!)\nI'm just havin' fun with these niggas\n42 bars, look I'm done with these niggas", "album": "Can’t Ban the Snowman", "year": null, "image": "https://images.genius.com/3e5baf6a5046dabf4bb3726d99c4b625.320x320x1.jpg"}], "artist": "Jeezy"}