{"songs": [{"album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "title": "Dead Presidents", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg", "lyrics": "[Intro]\nLet me try this\nUh, Yeah\nMoney coming soon\nI'm out for Presidents to represent me\nOmen what up nigga?\nYea niggaaaa, yea, uh\n\n[Verse 1]\nGimmie my money, man, why else would a nigga be grinding? (right)\nOut for them diamonds, dog, how else could a nigga be shining?(true)\nI'm glowing, knowing that the flow intact\nGet this record deal, I swear to God, my first 'mil I'm blowing that! (haha)\nLike fuck it I know I'll grow it back, shit, it's nothing\nFunny how blacks spend dough on mad shit for stuntin,'(yea)\nBut shit, that's all we know man, thats how a niggas raised (true)\nYou learn bout two things: getting pussy, getting paid. (uh)\nAnd you should be gettin' laid by the time you in ninth grade\nSo niggas lying on they dick and hoes giving nice brain, yea\nIn class dreamin' bout having these nice things, (uh)\nAnd then you look around and wonder why you strugglin'\nBut them whites ain't. (hmmm)\nI brush it off like, \"fuck it, it's motivation,\"(yea)\nSome niggas gotta walk through life, some niggas roller skating,)\nSome niggas bypassing steps, some niggas chose to take 'em. (yea)\nAnd for that fortune, man, some niggas sold their soul to Satan\nBut fuck it man, I ain't hatin,' I gotta go for mines\nMy little God-sister pregnant now, I put in overtime\nOn my grind, yea, just like the nigga making Folgers\nI'm focused, on my bite, like a cobra, I'm tryna get my Oprah on\nThese hoes is crying cuz I won't pay 'em attention, (nah)\nTime is money, bitch, and a nigga payin tuition, (ahaha)\nReal niggas hustle by using their intuition, (yup)\nWhile these fake niggas ain't into doing, they into wishin,'\n\nYeah\nUh\nI'm out for Presidents to represent me\nI'm talking Benjamins, nigga\nGrants nigga\nFrom Washingtons, man\nTired of those\nYeah!\n\n[Verse 2]\nTill I'm rich, ain't no reason to settle nigga\nIts greed that make a nigga wink at the devil to get that cheese\nYou niggas couldn't think at my level, even with trees\nYou couldn't get this deep with a shovel, now nigga, please\nI'm chasing G's tryna throw some diamonds on them freeze\nSick shit, sneeze on some thousand-dollar sleeves\nEase to the top and I'm not finna leave till I'm hot\nBut my watch gotta breeze, a south nigga\nBoy, I'm shining without the diamonds in my mouth\nOut grindin' while you reclining on your couch\nI'm climbing, you haters blinded by the doubt\nMy niggas riding is devout, so talking violence out yo' mouth\nAnd you gonna find what I'm about, nigga!\nFar from a slouch, nigga, I ain't gonna parlé with y’all\nI’ll probably hit ya, my hand game like Bobby Fisher\nBut check, them checks is all a nigga thinking\nFor them Presidents, I’ll treat a nigga like Lincoln"}], "artist": "J. Cole"}