{"songs": [{"year": "1997-12-09", "album": "Eye & I", "image": "https://images.genius.com/f1579141bc34038372c5f692cd18be20.636x636x1.jpg", "title": "Mysteries", "lyrics": "[Intro]\nYo\nYo Sauks\nYo what man, what up?\nLast night man, last night I was out by this club, yo\nThis man talking to me outside telling me how much he axe inside my ear\nTrying to stress the F.O.S. brothers nawhatImean?\nKnow what I mean, talking about a whole bunch of de nuttin'\nYo check this out man\nYo check out what this go\nCheck this out like this\n\n[Verse 1]\nNiggas is it what you do?\nOr what I'm thinking that I can accomplish?\nEither way I'mma dog your shit, because you ain't a hit\nBrother up there talking loud, you're rocking a crowd ain't nothing\nFreestyling and so what in the world are you think you going to do\nWith that wack crew, your whole damn setup\nF.O.S. should get wet up cause those niggas don't let up\nWord up, they rock every show and they think they large\nY'all niggas y'all talk to every ho and think that how it go\nWell this is how it is, I'mma teach y'all nigs the biz\nWhile you claim to know the street when there's a barrel to your cheek\nY'all niggas crying like you're sweeter than a box full of Pot of Gold chocolates\nLet me really tell you how it should be told\nY'all niggas couldn't last up in the real world\nWith real G's get shot and lyrics don't mean shit to a cop\nWhen y'all niggas do dat, for real dat one cap peel type shit\nThe Nonce brothers might quit\nBut until that point in time, keep going with your rhyme\nAnd I'm come to every show and make sure I drop dimes\nAnd yell aloud freestyle, in attempt to make you plop\nCause my shit don't stop until y'all niggas drop\nWord up\n\n[Chorus]\nYou know it ain't right (right) you know it ain't right\nHaters try to copy but they can't (right right)\nThe mysteries in the night\nThe mysteries in the night got me flipping, evil players got me dipping\nCircle maintain outta sight (that's right)\nYou know it ain't right (right) you know it ain't right\nHaters try to copy but they can't (right right)\nThe mysteries in the night\nThe mysteries in the night got me flipping, evil players got me dipping\nCircle maintain outta sight (that's right)\n\n[Verse 2]\nYo Sauks, what up?\nNiggas think we can't kick this shit for real\nBut I'mma let 'em know, quite how the show go\nUp inside the T-dot, oh yes the flex is genuine\nTen individuals with the style imperial\nAnd we might pull ya gal, word up that's the Offishall style\nNo doubt we in this to win this, I wrote the book and drink the Guinness\nAnd we made a stack waiting for y'all niggas to finish\nYour bitching, switching up your testimony every time\nTalking other shit cause he couldn't fuck with the line\nFirst we couldn't rap, now we can't get strapped\nBrother I don't get down like that, but Super G got my back\nAnd Y-Look got the headline, your girl got my waistline\nIn time you will see the F.O.S. niggys\nDown straight from excellence, your pestilence\nKeeps pushing us to the top, yo brother it don't stop\nIt don't stop y'all\n\n[Chorus]\nYou know it ain't right (right) you know it ain't right\nHaters try to copy but they can't (right right)\nThe mysteries in the night\nThe mysteries in the night got me flipping, evil players got me dipping\nCircle maintain outta sight (that's right)\nYou know it ain't right (right) you know it ain't right\nHaters try to copy but they can't (right right)\n{The mysteries in the night}\nThe mysteries in the night got me flipping, evil players got me dipping\nCircle maintain outta sight (that's right)\n\n[Verse 3]\nJust because you keep calling my name, momma that you know\nThe Kardinal Mr. Lu doesn't run from a crew\nAsk my man Choclair\nIf you test we'll tear your section in half to divide the aftermath\nThe Circle rocks hard to maintain our title\nWhile you bustin' caps for nothing, we get paid for our recital\nBitch, do not ever mess with the squad, I told u it don't stop 'til they kill hip-hop\nAnd even then we'll still rock for the heads that still with it\nAnd even if it's one, we'll get the job done\nPlayer, better wave your hands in the air\nSo your crew can get dropped, for real it don't stop\nWe'll still rock for the heads that still with it\nAnd even if it's one we'll get the job done\nPlayer, better wave your hands in the air\nSo your crew can get dropped, for real it don't stop\nIt don't stop y'all\n\n[Chorus]\nYou know it ain't right (right) you know it ain't right\nHaters try to copy but they can't (right right)\nThe mysteries in the night\nThe mysteries in the night got me flipping, evil players got me dipping\nCircle maintain outta sight (that's right)\nYou know it ain't right (right) you know it ain't right\nHaters try to copy but they can't (right right)\nThe mysteries in the night\nThe mysteries in the night got me flipping, evil players got me dipping\nCircle maintain outta sight (that's right)\nYou know it ain't right (right) you know it ain't right\nHaters try to copy but they can't (right right)\nThe mysteries in the night\nThe mysteries in the night got me flipping, evil players got me dipping\nCircle maintain outta sight (that's right)\n\n[Outro]\nYeah yeah, on the Hill, come on\nMysteries in the night\nUh huh uh huh\nForever baby, to the year 2G, know what I'm saying\nWord up we out\nLike that and uh, like this and uh"}], "artist": "Kardinal Offishall"}