{"songs": [{"lyrics": "[Chorus: DaBaby]\nThey said they want some of that raw shit (Raw)\nTurn it up, I'ma sit in the car, bitch (Turn me up, Tahj Money)\nIf you turn off your lights, you gon' see me at night\nHo, you know I'm a motherfucking star, bitch (Bling)\nHow I know you ain't from where I'm from?\n'Cause you know you can't go leave your gun in the car, dick (The fuck?)\nNigga like me walk down on your ass\nLeave you stuck in the sand like a motherfuckin' starfish (Let's go)\n\n[Verse 1: DaBaby]\nWhere the Backwoods at? I'm tryna smoke some' (Let's go)\nSTG, swear to God they don't want none' (Hah)\nSTD, play with fire, I'ma burn something\nBack to back in Scatpack doing donuts (Skrrt)\nStarting not to get head 'til I want some\nShe eat up the two-ball, the screwball like ice cream (Ice cream)\nWho you know wear designer with Nike? (Me)\nI smile and I show off my dimples, I'm icy (Cheese)\nName a label that's fucking with my team (My team)\nSomebody come give me a challenge, excite me (Come on)\nNigga better stay 'way from that water\nI let this bitch off, it's gon' hit you like lightning (Hah, boom)\nHow the fuck they let Baby go platinum?\nI thought he was wack and they didn't even like him (Hah, bitch)\nYou can come see my plaque on my wall\nWalkin' 'round in my drawers, talking shit in my castle (Uh-huh)\nThink he sick, wipe his nose, I'm a nappy (Sick)\nTake his bitch, that's my ho, I'm her daddy (Her dad)\nShip the shit to your door, send the addy (Your door)\nMix it in with the low, doesn't matter (Uh, low)\nNigga know I was having that remix (Yeah)\nI play pussy and burn you, that's defense (Bitch)\nBaby pull out my dick and she eat it\nShe like how I be kicking that street shit\nThat's your boy, he aight, he ain't me, bitch (Bitch)\nCheck me out on your screen, BET, bitch (Yeah)\nKnow I got the whole gang in LA (The gang)\nI'm strapped up with that thang in LA (Uh, huh?)\nI hop off the plane and I skate\nShe 'bout to come bring me some brain, that's my bae (My bae)\nI can't go back and forth with a ho\nLike a bitch who gon' do everything that I say (Shh, Quavo)\n\n[Verse 2: Quavo]\nSay they want some of that trap talk (Trap)\nI get a brick, let it moonwalk (Brick)\nThe K shoot silent, but it still talk (Rrah)\nSmoke with the pilot in the skybox (Uh)\nThe Culinan came with a umbrella (Skrrt)\nBaguettes, no prongs, they stayin' together (Ice)\nI lift my arm and change the weather (Woo)\nTurn a bitch from nothing to a Cinderella (Bad, go)\n\n[Chorus: DaBaby]\nThey said they want some of that raw shit (Raw)\nTurn it up, I'ma sit in the car, bitch (Turn me up)\nIf you turn off your lights, you gon' see me at night\nHo, you know I'm a motherfucking star, bitch (Bling)\nHow I know you ain't from where I'm from?\n'Cause you know you can't go leave your gun in the car, dick (The fuck?)\nNigga like me walk down on your ass\nLeave you stuck in the sand like a motherfuckin' starfish (Let's go)\nThey said they want some of that raw shit (Raw)\nTurn it up, I'ma sit in the car, bitch (Turn me up)\nIf you turn off your lights, you gon' see me at night\nHo, you know I'm a motherfucking star, bitch (Bling)\nHow I know you ain't from where I'm from?\n'Cause you know you can't go leave your gun in the car, dick (The fuck?)\nNigga like me walk down on your ass\nLeave you stuck in the sand like a motherfuckin' starfish (Takeoff)\n\n[Verse 3: Takeoff & Offset]\nI feel like how I'm sipping on Activis (Act')\nMight as well turn to an activist (Might as well)\nThe meeting was corporate, walked in like we been there\nMan, they ain't know we really was savages (No)\nAin't in a UPS or with the FedEx, but a nigga be packing it (Smash)\nAin't tryna brag or boast or tell 'em something they don't know\nBut a nigga be having it (Cash)\nMetal on me all time (Brr)\nBeefing with metal detectors and magnets (Brr)\nBitch, I'm with 'Set and DaBaby\nHit the racetrack just to see who the fastest (Skrrt)\nBaby just came out of a cast\nDon't make us put your bitch ass in a casket (Don't)\nWe wrapping up plastic actually\nI get the backend, hot like a dragon (Hot, hot)\n\n[Verse 4: Offset]\nI hit the Cook', then I ash it (Hey)\nI fishtail the Demon, I drag it (Skrrt)\nThese niggas broke, maggots (Broke)\nTake your bitch throat, stab it (Ugh)\nAudemar, baguettes got added (Audemar)\nGrab the stick, pay the hit when it's static (Baow)\nYeah, my bitch is the baddest, I’m bragging (Woo)\nQuarter mil' on the Richard, it's plastic (Hey, hey)\n\n[Chorus: DaBaby]\nThey said they want some of that raw shit (Raw)\nTurn it up, I'ma sit in the car, bitch (Turn me up)\nIf you turn off your lights, you gon' see me at night\nHo, you know I'm a motherfucking star, bitch (Bling)\nHow I know you ain't from where I'm from?\n'Cause you know you can't go leave your gun in the car, dick (The fuck?)\nNigga like me walk down on your ass\nLeave you stuck in the sand like a motherfuckin' starfish (Let's go)\nThey said they want some of that raw shit (Raw)\nTurn it up, I'ma sit in the car, bitch (Turn me up)\nIf you turn off your lights, you gon' see me at night\nHo, you know I'm a motherfucking star, bitch (Bling)\nHow I know you ain't from where I'm from?\n'Cause you know you can't go leave your gun in the car, dick (The fuck?)\nNigga like me walk down on your ass\nLeave you stuck in the sand like a motherfuckin' starfish", "album": "KIRK", "year": "2019-09-27", "title": "RAW SHIT", "image": "https://images.genius.com/13178bc885dfa3d4ad71a41a098dbe60.1000x1000x1.jpg"}], "artist": "DaBaby"}