{"songs": [{"title": "Ant Do Shit For Me", "album": null, "year": "2016-02-28", "image": "https://images.genius.com/6cc1d2541bb0317b97bce9cc960894c8.395x395x1.jpg", "lyrics": "(intro)\nYea...Woah (an't did shit for me)\n\n(hook)\nHow you want my money ant did shit for me. How you want my cars ant did shit for me. I bailed you niggas out and did shit for me. Keep callin my phone got to be kiddin me. I found your war zone did shit for me.  That's won't you niggas sympathy. Did shit for me, yea. Did shit for me\n\n(verse 1)\nIkea with me Reedy with me. Jrock with me Ikey with me. Verney with me zoo with me. I suffer like the zoo with me. Dthang with me Chino with me. BJ with me SB with me. Can't forget about Nuskie. That's why out here imma do you. Yea. And my Album like a movie. Remember my name but you got too goofy. Yo bitch wanna do me. Is it my watch or is it my children. They im singed  Def Jam no im not. Im singed to OTF they took they spot. Fuck them niggas i hope they rot.  Im getting millions while yall on the block. yea. yall on the corner im on a yacht.  Im in my house you on the yard. Yellin days just took a boy. How you hot but you make noise\n\n(verse 2)\nGot LoLo with me Zayden with me. got bella with me Nuskie with me. got money with me Pluto with me. Rondo with me LA with me. Chiraq with me LA with me. New York with i got bitches. Bitches on top of these bitches. Smoking that loud dont fuck with that midget. On probation can't smoke nothing. Foul my probation a morning yea.[?]. Niggas mad I live like doctors. yea. effins confused with choppers. Like where it at and got no choppers. Effins bullets flying through the bricks. Me and my niggas sliding through the bricks. Fuck the bitch I slide on ya bitch. All white dope look like the whip. Im the shit get off my dick. OTF we been the shit. yea i got French with me coke boys. Niggas mad they make no noise. shoutout to them old boys. Q86 double 0 boys\n\n(verse 3)\nI got Bodies with me Devincies with me. Red bottoms with me nike with me. niggas hating i got ikea with me. Nigga we dont like you niggas. Stay out my business ant got time for it. Im some shit what you lying for. And that wine more. Boy imma grind more"}], "artist": "Lil Durk"}