{"artist": "Boondox", "songs": [{"album": "Abaddon", "title": "Psycho Symphony", "year": "2014-05-13", "lyrics": "[Verse 1: Boondox]\nFall asleep dreamin' red is what I see anymore\nAnd I do not fear of death because I seen em before\nMy eyes are closed to open wide to see it never change\nOnly the players in the game, but all the rest stay the same\nIs this reality I'm livin' in or pinnace for pricing\nI'm feelin' sorry for myself, please take out the violin\nAnd playin' symphony to soundtrack of a lunatic\nI mighta illuminated or finally loosin' it\nI walk a thin line between myself and somebody else\nAnd I cannot decipher between I'm living in fuckin' hell\nOr dying on earth, my whole world is a crying shame\nNothing is what it seems it’s like some shit out the crying game\nI’m sickening, inflicted in feeling somewhat vindictive\nI'd put a bullet in my brain, but even that seems conflicted\nWhere would I end up or it just start all over\nGive me the horns of Lucifer or the wings of Jehovah\n\n[Hook: Syn]\nAll this violence in your head seem\nFlowing through your veins like a symphony\nAnd it's a psychopathic melody\nSit in silence still your head scream\nPlaying through your veins like a symphony\nAnd it's a psychopathic melody\nIt's a psychopathic melody\nIt's a psychopathic melody\n\n[Verse 2: Boondox]\nIs my reality a figment of my imagination\nEverything that I see, somehow it’s all my creation\nOr am I just as disturbed as some fuckers locked in the padded cell\nDoped up on anti psychotics, livin' in hell\nCan't remember my birth, no recolection of death\nAnd where did it all go away? No longer taking a breath\nAnd when did it all go away? If I started blastin' at bastards\nStartin' killing everybody, I’m a virus or cancer?\nAm I the reason for bleeding the reason families are grieving\nThe reason for seasons like I’m the reason for heathens\nOr am I just a human being who is only being human\nWith more questions and answers like what the hell am I doing?\nWhy do I'm still obsessed with this shit just fill me with zolopine\nLet me drew in the corner, just shoot me up fully dopamine\nI just wanna drift away I call my daily departed\nBut with my love that's how this whole situation got started\n\n[Hook]\n\n[Bridge: Syn]\nThis won't go away until your dying day\nAnd you will suffer in your own way (your own way)\nAnd in the end there will be hell to pay (hell to pay)\nAt the gates they say \"go away, go away, go away...\"\n\n[Hook]", "image": "https://images.genius.com/181444660a65d0000670a98f7f5af756.400x400x1.jpg"}]}