{"songs": [{"year": "2005-12-14", "title": "The Head of State", "image": "https://images.genius.com/9c2849cfac5218c726612b73adab589c.300x300x1.jpg", "lyrics": "[Hook]\nThe head of state is lyin’\n‘Cause the world is multiplyin’\nA hundred men are dying\nMothers home are crying\nFamilies die\n\n[Verse 1 – Papoose]\nThey charge Russell Simmons, say he ain't register as a lobbyist\nBloomberg make a million a week—he's a communist\nShow Saddam's sons on TV.  Who’s watchin’ it?\nUdai and Kusai’s alive, they trick knowledges\nSayin’, “We'll decrease the killing”—that's they analysis\nWords to increase the killin’ was spoke Arabic\nShot Davis right where he stand, they surrounded him\nIn city hall, they murdered a black city councilman\nSay Al Sharpton sold drugs they provided him\nPresidential race we faced, they took him out of it\nSay they liberating Iraq, but that's abolishment\nNow they celebrating ‘cause oil was they accomplishment\nLook at your 20 dollar bill, no astonishment\n4,000 jews don't show up, and now we tower-less?\nPut a flag on Saddam's head, I'm tired of this\nWithout justice, we powerless\n\n[Hook x2]\nThe head of state is lyin’\n‘Cause the world is multiplyin’\nA hundred men are dying\nMothers home are crying\nFamilies die\n\n[Verse 2 – Saigon]\nLook, we live in the day where most hoes go both ways\nIt's so craze, America love to promote gay\nCoke still come in both ways.  They locked my man John Forté\nThem bitches need to be blown away\nFor takin’ the stand, and takin’ a man\nWho was only tryna to get a lil’ cake in his hand\nThey don't talk about how he was invested in stock\nAll they do is lock us up, while the rest of us watch\nAnd listen up—I'll tell you how the system is corrupt\nHow it takes a black man and kicks him in the butt\nSo when he hit the streets and see guns, he picks ‘em up\nAnd if he sees some people with funds, he sticks ‘em up\nThen he ends up locked up in the stock\nCracker put him there, but still he blamin’ the block\nInstead of readin’ books, he joined a gang at a stop\nNow he runnin’ ‘round the yard with the ox in his buttocks\n\n[Hook x2]\nThe head of state is lyin’\n‘Cause the world is multiplyin’\nA hundred men are dying\nMothers home are crying\nFamilies die\n\n[Verse 3 – Papoose]\nI been around so much robbery, larceny, and poverty\nThe average cypher couldn't revolve with me\nRhyming genius and design speeches like choreography\nWhat you study hard to be?\nMy kind of rhyme don't got no bottom line ‘cause I come deeper then Scientology\nPhilosophies logically written in glossaries\nI could take on a armory and face a army with a pen in the palm of me\nWord to the bond of me, honestly\nIn my Bone Thug and artery, harmony's part of me\nFlow remarkably, but understand it's some art from me\nIt's complicated like living Islamicly without equality\nSo I make my listeners see pictures just like photography\nMoves rap like majority.  I'm the son of song biologically\nThe fatherly artistry fathered me and comfortably\nSaw beyond degrees.  Y'all believe what's too hard to see\nMasters of visions, so my path is to listen\nDon't question my wisdom, I'm origin—ask your religion\n\n[Verse 4 – Saigon]\nIt's a very beautiful thing when you can bring truth to the light\nSpit hardness and still get the youth to unite\nIt ain't one rapper out now maneuverin’ right\nYour ice is nice, but what you tryna do for the fight?\nYou gon' play pussy or play dog?\nI'mma make the D.J play songs for y’all that made it to the morgue\nYou gotta understand the situation we placed in\nMalcolm got murdered—we never got his replacement\nIt kinda make sense why niggas’ll wet your face in\nFor something as stupid as chasin’ a reputation\nSaigon was gun man, I can bust a sawed-off shotgun with one hand\nGive you a quick suntan\nYea, real recognize real\nAll I recognize when I look in your eyes is the god of the squeal\nSon, I’m ill like the shit MacGyver could build\nTreat you and your troops like the hoop when I deposit the pill\n\n[Hook]\nThe head of state is lyin’\n‘Cause the world is multiplyin’\nA hundred men are dying\nMothers home are crying\nFamilies die", "album": "Swizz Beatz Presentz: Abandoned Tracks Vol. 1"}], "artist": "Saigon"}