{"songs": [{"lyrics": "[Uncredited spoken word poet forms the song's intro]\nThere was a curious secretive streak in the man\nWhich led to many dramatic effects - but left even his\nClosest friends guessing as to what his exact plans might be\nHe pushed to an extreme, the axiom that the only safe plotter\nWas he who plotted alone. I was nearer him than anyone else\nAnd yet I always conscious of the gap between\n\n[Aceyalone]\nSay mayne, let me rap to you for a minute\nSay.. yeah, yea you - ay mayne, say you!\nSay! Say mayne! Say mayne!\nSay mayne let me rap to you for a minute\nYeah I gotta holla at you, yeah\nSay what?\n\nThe QUESTION is how could a man like me\nActually, a man that's free\nOf speech and the ability to reach, the masses\nNever not, know what to say I know how brainwaves operate\nConsistantly and our ideas, FUEL our existance\nSee if you can see if you can see if my resistance\nAgainst this oppressor, a passive aggressor\nMaster professor, with every chance I get\nTo, lure some sleepin people out the pit\nOne, foot in the grave the other, foot in some shit\nYo time waits for no man, especially not you\nGet yo' murk, this'll be yo' very first clue when\nWORDS, fail and actions take over you will see\nThat them are no more you can take away freedom outcome\nTHERE I WAS, in between my freedom and a slug\nWhen they, pull the plug\nI'mma walk through the light that's ahead of me\nCould've been, ANYONE instead of me so live and let it be\nSpoken like they said it to me\nYo, say what's on yo' mind nigga, let the people see\nSOME speaker's on the podium, hit you with the sodium\nGo up in equipped without petroleum\nBut I'm a +Project Blowedian+\nMore complex than your Napoleon\nOkay, Double-A, never runnin out of things to\n\n[Hook]\nSAY, whatchu wanna SAY\nAnd watch what people SAY, about what you SAY\nJust SAY, whatchu wanna SAY\nAnd watch what people SAY, about what you SAY\nSAY, whatchu wanna SAY\nAnd watch what people SAY, about what you SAY\nJust SAY, whatchu wanna SAY\nAnd watch what people SAY, about what you SAY\n\n[Aceyalone]\nThe QUESTION is how could a guy like me\nActually, a mighty MC with the eye of a bee\nConditioned to the same ol' conditionin\nPosition in mid-air, limbo\nOnce upon a time I didn't care but\nNow it's not that simple\nMaybe I, should refrain\nAnd let the unimaginative, non-creative ones give me some brains\nGive me some brains\nSAY! Maybe I should rename the talk\nRun a lap with my trap while you backslide in the dark\nMy choppers, OH my choppers\nGet me out of the worst work, blade choppers\nSave the hoppers, boppers\nDisballoon bar not a popper stopper\nFeel the dreams cash cropper copper steel wool\nStill pull chords\nWrestled with these bullhorns\nWith both arms, 'til they all submit\nPut the mic on B-LAST and let me say some shit\n\n[Hook]\n\n[Aceyalone]\nNever runnin out of things to say..\nNever runnin out of things to say, say, say mayne\nSay mayne! Y-yeah, ay mayne, SAY!\nLet me holla atchu\nSay mayne, yeah you, say\nSay what? What?\nSay, say what say what?\nSay what? Say what?\nSay why? Yeah\nSay when, aight when", "title": "Say", "album": "Hip Hop and the World We Live In", "image": "https://images.genius.com/dde48df06ccd165a12ed0bc40d9c736e.500x500x1.jpg", "year": null}], "artist": "Aceyalone"}