{"songs": [{"image": "https://images.genius.com/50a27841c8fd113c4acf184726cc64a7.696x696x1.jpg", "title": "House Arrest Tingz", "album": null, "year": "2019-09-26", "lyrics": "[Intro]\nDrum Dummie\nDrum Dummie made the beat and you know he killed it\nOh, this Drum Dummie who made this beat, huh?\nI ain't flashin', though\nI'm just coolin' right now\nIt ain't nobody but me and Herm in the studio\nAnd I'm just bored\nAnd, I hope y'all was waitin' to hear from me\nSo, I just recorded\n\n[Verse 1]\nReal street nigga, I ain't tryna feel no sorrow\nDrive that Maybach like a fuckin' Monte Carlo\nI been tryna find some peace and only God know\nCross me once, can't call my phone, you get the dial tone\nI been on fleek, I'm poppin' (I'm poppin')\nNot many 'round if you don't know, it helped my pockets (My pockets)\nAnd my bro, take that Draco and go wildin' (Blaw, blaw)\nTryna grow up, don't come in contact with that violence\nViolins should be played, how I'm stylin'\nComment \"Where,\" she like, \"What picture?\" That ain't my bitch\nTired of the Bayou, I want take it out to New York\nAnd live a high life like a nigga signed with Highbridge\nI flash out and take his head from off his body\nI never once showed you that side, but that's who I'm is\nHidin' out, I let that 30 spit on College\nIf I die right now, just check the stats and see how I did\nI'm a real street nigga, yeah\nI just pulled my retta out and tried to stop a nigga (Where you goin'?)\nI just walked outside my house and almost shot a nigga (Fuck is you doin'?)\nFuck my ex, I hope my next can prolly top a nigga\n\n[Chorus]\nTake me to a place I can't imagine (Oh)\nVictim of heartbreak and I'm so damaged (Oh)\nSteppin' in blood, we deep thugs and I can't panic\nYeah, we knocked him off\nNigga what? They gotta hand it\n\n[Verse 2]\nI just took to foreign on the block and took the top off\nTalkin' out his top, I go by top, I get him knocked off\nSee them youngins hoppin' out that Benz, that's some dropouts\nThey was hatin', I knocked 'em out my lens, that ain't my fault\nI'm with Herm, I'm drinkin' on that Hen' like a papa\nPure codeine, they drinkin' on that gin, I been goin' off\nGoin' off on all these hoes waitin' on me to fall\nI walk in court, dirty as the fuck with pee up in my draws\nBitch, I'm drunker than the fuck, I need some Tylenol\nI go nuts, soon as you buck, I shoot at all of y'all (Blaw, blaw)\nI left therapy with K3 and I sped off\nTalkin' proper as the fuck with my head off\nTalkin' proper as the fuck with my head off\nBeen goin' crazy but I can't let my son see it all\nAll this love got me damaged, I just want it gone\nIf you my friend, let's get it in, bitch, take yo' panties off\n\n[Chorus]\nTake me to a place I can't imagine (Oh)\nVictim of heartbreak and I'm so damaged (Oh)\nSteppin' in blood, we deep thugs and I can't panic\nYeah, we knocked him off\nNigga what? They gotta hand it"}], "artist": "YoungBoy Never Broke Again"}