{"songs": [{"title": "FDB (Remix 3)", "lyrics": "[Intro: DJ Drama]\nHustle Gang\nRemix! F.D.B!\n\n[Bridge: Young Dro]\nWest Side, Bankhead, that's where I'm from\nEverything y’all did, it been done\nMy Tru game and my shoe game\nCan’t touch that shit\n\n[Hook: Young Dro]\nBitch steady holl'in' ‘bout \"fuck me?\"\nNah, fuck that bitch\nFuck that bitch (x2)\nBitch steady holl'in' ‘bout \"fuck me?\"\nNah, fuck that bitch\nFuck that bitch (x2)\nBitch steady holl'in' ‘bout \"fuck me?\"\nNah, fuck that bitch\n\n[Verse 1: Young Dro]\nI'mma go three, stupid on the remix\nI'mma show you how to raise up out the fire like a phoenix\nI'm a Bankhead nigga, so I'm straighter than a penis\nIf ya try the Westside, I'mma nut up like semen\nIce got me anemic, walking up in Neiman's\nAnd everytime I get a new broad, I get subpoenaed\nMy baby mama mad and my girl look like a genie\nI got racks like Venus, 20 stack in my jeans\nBread like panini, eating steaks and zucchini\nWit' ya broad in Tahiti, spaghetti string bikini\nI don't spit on tracks, I throw up on 'em like bulimic\nPardon, my High Time album a problem, wait!\n\n[Hook]\n\n[Verse 2: B.o.B]\nEastside, Candler Road, with yo' ho, I'm an animal\nShe twerk that pussy, Hannah Montana, ho\nYeah, her feet pretty, I just want the camel toe\nYeah, she thought that I was playing till I'm claiming\nI'mma slap my name on it like a motherfucking envelope, yeah!\nShouts out to my nigga Young Dro\nAnd all the real niggas on the Westside\nThis year, when I turn 25, I'mma take a G5 for a test drive\nSouthside girls got all the game\nNorthside girls sniff all the 'caine\nEastside girls talk all the shit\nAnd all the Westside girls say \"fuck that bitch\"\n\n[Hook]\n\n[Verse 3: Wale]\nWe lit for the remix, nigga so cold\nI'm in the helix with three chicks, waiting on the fourth\nAnd my shoe game, oh, nah, already know\nI do things, Liu Kang, ready, set, go, uh\nKnock, knock, hear the bitches at the door?\nParty at Onyx, I'm leaving out broke\nWalking beside me, you see a light show\nWell, my girl got a girl, guess I'm living like Dro\nDro, clean in this bitch\nNow, I'm finna shoulder lean in this bitch\nThey don't even search my team in this bitch\nSo I pro'ly got the purp and lean in this biotch!\nStill it's \"fuck that chick\"\nHit her off the Goose then duck that chick\nHold up, we don't rock like that\nMake 'em all fall back, never trust that chick\nBob Marley tip, reggaeton, oh baby, I'm the boss of that\nNever give your heart if she not for real\nSo go and play some Pac, that's why we call you bitch\n\n[Hook]\n\n[Verse 4: Chief Keef]\nBitch, don't even want you no more, fuck that shit\nEvery nigga toting around me, he better bust that bitch\nHeard y'all niggas playa hatin', what's up with that shit?\nHe gon' get you played up, get your paper up, but don't cuff that bitch\nMy squad, we'll fuck that bitch\nShe ain't even know I'm the CEO, that dumb ass bitch\nForty thousand in Moncler, yeah, I run that bitch\nAnd I run with O'Block but yo' block, I'm on that bitch\nLil stuntin' ass bitch\nHood nigga, love money, I throw bands, look up for that shit\nShe spilled some liquor on my Louie, I'm off that bitch\nThen I took that bitch virginity, I got some top and I fucked that bitch\n\n[Hook]", "album": null, "year": null, "image": "https://images.genius.com/134a4872ea91075f919728667ab13bf3.877x877x1.jpg"}], "artist": "Young Dro"}