{"artist": "Asher Roth", "songs": [{"title": "Eggs Florentine", "image": "https://images.genius.com/e7be0abebf7a2ead2080b2dbd056152e.500x500x1.jpg", "album": "The Greenhouse Effect Vol 2", "lyrics": "[Verse 1:Asher Roth]\nTop dollar, holler if you got it\nSince the Rockwilder, I been making solid head nodders\nShiiit\nHow 'bout it? Modest and methodic\nWould it be a problem that I never graduated college?\nKiiid\nHa! Got 'em. Kinda like Sada-dem\nThey shot 'em, spot 'em, coming out the garden, with his mom n'\nKiiids\nHippopotamus, pot I got is awesome\nBlossom\nCrossing the pollination of Ryan Gosling\nBeat and coughing, swimming with the dolphins\nTalking like I'm Mr. Marinate but that'd be jargon\nUse your noggin Bobby, this is my preorgative\nAsk if I'm the nicest and you'll get a bunch of bobbleheads\nFollow this, unexpected journey, on some hobbit shit\nAll around the world, in your city bet I'm rockin' it\nTake a nice drop straight from Sucassin\nThey gass my spass, breaka breaka sirchu blacka\nKnock around the block, kill a knicker bocker\nSpittin' realer hip-hop, but listen to Joe Cocker\nAnd hypocrisy, either you a sprinter or a jogger\nIf it was ninth grade, kid, you'd be locked inside your locker\nYeah, knock knock, father of The Rock get me out of this\nYou don't like the Roth you're a communist\n\n[Hook]\n\n[Verse 2: King Mez]\nUnrealistic flow, business-minded as aristocrats\nHungry as (?) like gimme yo lunch remember that\nNiggas slang crack like the family can't get killed from that\nThink they ready for beef and never read nutrition facts\nCollege cut a nigga the price of all that tuition whack\nWith a grand heel, like a nigga bringing The Pistols back\nAnd I'm right on target with topics, bringing precision back\nEverything you see artificial I'm bringing vision back\nThat's on my honor, I'm giving you coke, more so than Tijuana\nShe older than me but you buy her flowers I see you want her\nDon Juan a quarterback to all you pom pommers\nHow you gon' harm a terminator you ain't John Connor\nBoy, I'm sorry that's just the writer in me\nCould also be that boiled blood line that's probably in me\nAnd if you like a bag and she with me that's probably Fendi\nBut it was probably a gift and she gave it to me and missed it\nKeeping soul round me\n\n[Hook]\n\n[Verse 3: Remy Banks]\nCrack the window light the reefer, bro I need to vent\nGot some things up on my mental that I need to flip\nSeems I can't repent, now haunt me when I'm bent\nI felt like I'm a saint, so mama feel like I'm heaven sent\nEncrypt these thoughts that I deciphered into verses\nSome days I'm feeling worthless, I know I got a purpose\nAnd I know I'm supposed to be here just trying to scratch the surface\nThese songs will make utilizing the talent I was birthed with\nMist from the purple haze fogging up my brain\nBathin' Ape camo'd down like I'm Major Payne\nIn London coolin' out high and up with James\nWith a team of British ducks whilin' out like I'm Bombay\nDog, I know about light\nSpent weeks out in Europe thrice times\nI mean what I say\nWho else do I need to persuade that I'm one of the illest young niggas spittin' today\nQueens we in the building\n\n[Hook/Outro]", "year": null}]}