{"songs": [{"image": "https://images.genius.com/1e9d47cc7d2d89c839c4ec32d0815a5e.929x929x1.jpg", "lyrics": "[Intro: Uncle Murda]\nI make Brooklyn look good right?\n\n[Verse 1: Uncle Murda]\nMy car’s wu wuu wuuu wuuu\nListen to the engine going vroom-vroom\nThat’s why she gave me the poom poom\nStill got that thing on my waist that go boom-boom\nBang! Wu wuu wuuu wuuu\nNow you hear them police sirens like wu wuu wuuu wuuu\nTen bad chicks surround me who Imma screw\nPuerto Rican, black girls, white girls wu wuu wuuu wuuu\nSomebody poo in the poom poom room\nYour poom poom head game wu wuu wuuu wuuu\nWith 20 niggers, 10 Crip wearing blue wuu\nOther 10 Blood screaming, \"I'll sue\"\nThought my package got caught feeling like ooh-ooh\nThen I heard it landed, screamed out, \"wu wuu wuu\"\nThe work jumping out the pot like wu wuu wuuu wuuu\nThis fist gone have the fiends on the block like wu wuu wuuu wuuu\n\n[Hook: Uncle Murda] (x2)\nSheesh! Wu wuu wuuu wuuu\nCome through like wu wuu wuuu wuuu\nI get money like wu wuu wuuu wuuu\nMy bitch body is wu wuu wuuu wuuu\n\n[Verse 2: Rocko]\nFlow cold, make 'em sneeze, achoo\nDon’t stand too close, I'll catch the flu\nSpiked up in my lieu\nKickin big shit bitch kung fu\nIf you only knew, if you only knew\nI will throw it in for you know what to do\nPocket full of green like my favorite hue\nRaised in the A now I stay in Peru\nSuper cool dude, don’t get it misconstrued\nAll I do is win (win!), I refuse to lose\nF friends told to stick to 'em\nAiming at ya head shoulders shampoo\nI'm do me, do you\nPiss on you, I’m the shit, doo doo\nInked up, body full of tattoo\nWalk through, all the bitches like \"ooh!\"\n\n[Hook] (x2)\n\n[Verse 3: Uncle Murda]\nDamn her ass is wu wuu wuuu wuuu\nShe can work in perfections or work in schools\nAnd she on that molly wu wuu wuuu wuuu\nThinking bout all the freaky shit she about to do\nSheesh! wu wuu wuuu wuuu\nMy crew deep like the Wu\nIf you want beef, what it do?\nYou pussy by yourself tough when you with your crew\nI’ve been tough since public school\nMama whip my ass for being bad in school\nBeat me in the showers what she used to do\nBelt used to hurt had me screaming out, \"ooh ooh ooh\"\nThen I go outside with an attitude\nFlipping on niggers they like, \"I thought we was cool!\"\nOver misunderstanding, I'm eating niggas' food\nCall me the animal that took over the zoo\n\n[Hook] (x2)", "title": "Wu wuu wuu", "year": "2013-09-17", "album": null}], "artist": "Uncle Murda"}