{"artist": "6ix9ine", "songs": [{"year": "2015-03-05", "title": "Daniel Hernandez Statements (2015 Use of a Child in a Sexual Performance case)", "album": null, "lyrics": "I GREW UP WITHOUT A FATHER, HE DIED WHEN I WAS 13. MY BIRTHDAY IS MAY 8‚ 1996. I LIVE AT ██████ WITH MY MOTHER AND BROTHER. I AM AN ARTIST.\nTHE  SCUMBAG PERSONA IS JUST FOR SHOCK VALUE. IT STARTED WHEN I STARTED MAKING CLOTHING WITH THE WORDS HIV AND PUSSY ON IT. THEY GOT FAMOUS AND WENT VIRAL. BAM. BECAUSE PUSSY AND HIV WORKED‚ WE FIGURED THE SCUMBAG69 HASHTAG WOULD HAVE THE SAME SHOCK VALUE. THE GIRLS THAT ARE IN THE PICTURES‚ I DON'T DO ANTYHING [sic] WITH THEM IT'S A PHOTOSHOOT. I NEVER TOUCHED THEM. A LOT OF TIMES WHEN I DO THE PICTURES MY GIRLFRIEND IS THERE WITH ME TAKING THE PICTURES.\nTHAT'S  ME IN ALL OF THOSE PHOTOS AND THE VIDEOS. I WENT TO A RECORDING STUDIO IN MANHATTAN ON SATURDAY FEB 21, 2015, AND I MET THIS GUY TAY MILLY AT THE STUDIO. HE WAS ROLLING WITH A BUNCH OF GUYS AND HAD A LOT OF MONEY. THEY ASKED ME IF I WANTED TO COME HANG OUT WITH THEM UPTOWN AND I THOUGHT WHY NOT‚ I JUST WORKED SO HARD IN THE STUDIO, WHY NOT?\nSO WE WENT IN A BLACK CAR UPTOWN TO HARLEM. I'M NOT FROM THERE AND HAVE NEVER HUNG OUT THERE BUT I KNEW I WAS IN HARLEM. WE WENT UPSTAIRS. WE WERE THERE FOR A LITTLE WHILE WHEN TAY MILLLY [sic] CALLS A GIRL ON THE PHONE AND TELLS HER TO COME OVER. SHE CAME OVER AND WE WERE ALL PARTYING HARD. I WASN'T DOING DRUGS, I DON'T DO DRUGS. I DON'T KNOW IF THEY WERE DRINKING.\n\nTHAT'S TAY AND ME AT THE STUDIO. IT WAS TAKEN ON THE SAME DAY WE WENT TO THE PARTY. THAT'S ME AND THE GIRL IN THE INSTAGARM PHOTO THAT SAYS P 411 IN THE CORNER. THAT'S THE GIRL TAY MILLY CALLED ON THE PHONE. I DIDN'T HAVE SEX WITH HER. SHE WAS DOING WHAT SHE WAS DOING.\nI  WAS DOING IT FOR MY IMAGE. WHEN SHE CAME IN AND SHE ASKED ME HOW OLD I WAS AND I TOLD HER I WAS 18 AND I ASSUMED SHE WAS OLDER. THE WAY SHE WAS ASKING MADE ME THINK SHE WAS OLDER. LIKE 19. THE STILL FROM THE VIDEO FROM REPOST WHIZAPP - THAT'S ME AND TAY MILLY AND THE SAME GIRL. THE REPOST WHIZ APP IS AN APP THAT YOU CAN REPOST THINGS FROM OTHER PEOPLE'S INSTAGRAMS ONTO YOUR OWN. I REPOSTED THE VIDEO FROM TAYS [sic] INSTAGARM TO MY OWN.\n\nI  LEFT LATE THAT NIGHT WHILE THE PARTY WAS STILL GOING ON. I TOOK THE TRAIN FROM UPTOWN. EITHER 103 OR 106 STREET. IT WAS ICE WATER WE POURED ON HER. I NEVER MET THESE GUYS BEFORE.\nIS TAY STILL ALIVE OR IS HE IN A COMA? CAN I GO SIT WITH HIM? THE GIRL ASKED ME TO USE MY PHONE TO GO ON HER FACEBOOK AND I TOLD HER THERE WAS NO WIFI HERE I DON'T KNOW HOW YOU ARE GOING TO DO IT\n\nTAY  SAID I THINK THEY HID THE GIRL UPSTATE. YOU GOTTA FIND HER BECAUSE SHE WILL TELL YOU I DIDN'T HAVE SEX WITH HER. TAY TOLD ME HE JUMPED OUT THE WINDOW BECAUSE HE THOUGHT HE HAD A PAROLE WARRANT. IF YOU FIND THAT GIRL I REALLY WANT TO APOLOGIZE TO HER AND HER MOM. IM [sic] GOING TO GO TO JAIL FOR 15 YEARS AND BE A REGISTERED SEX OFFENDER. THAT HASHTAG IS LEGIT NOW. ██████ IS A GOOGLE NUMBER I HAVE ON MY PHONE THAT I ONLY HAVE SERVICE ON IF I HAVE WIFI", "image": "https://images.genius.com/af146a12266478af9681f1090531631a.751x1000x1.jpg"}]}