{"artist": "Boldy James", "songs": [{"album": "Trapper’s Alley: Pros and Cons", "title": "Long Run", "year": null, "lyrics": "[Intro]\nI'm ready\nBold face James\nConcreatures\nInglés\nTell these watch they mouth if they want they teeth you hear me?\nConcreatures\nDrugzone\n227\nNiggas know what it is with me\n\n[Verse 1]\nBoldy blocks, Bend Street, king of the skelly\nIn the jelly, whipping s'ghetti getting so much fetti\nCall me Soda Popinski or 'chine Gun Kelly\nFrom Kelly to telly in my soda club pelle\nOn the block, 10 deep, three five seven\nOne dessi, two 'chetes, and my throwaway peggy\nIf the police try to flick me, I'm fleeing\nWhen they catch me they goin' hit me with a netty\nSo you know it ain't petty\nYou know it ain't reggie\nYou knew you wasn't ready\nIf you hit me, better catch me, you know I ain't friendly (at all)\nLike Casper, you know I ain't friendly\nAnd friendly got a stash, now I'm ghost with my friend Lee\nIn the Jag blowing smoke with a 10 piece\nGraduated from semipro to the big leagues\nHad to let them know what the six meant\nThat's where I'm at, here I go, come and get me\n\n[Hook]\nIn no time\nIt's been a longtime coming for a longtime\nIt's been a longtime running from a longtime\nKept the phone lines jumping like a telethon\nIn the blowspot putting out that topside\nSpent my whole life thugging in the sunshine\nWith my .45 ducking from the one time\nIt's been a longtime running from a longtime\nIt's been a longtime coming, had a long run\n\n[Verse 2]\nFell asleep with my finger on the trigger\nThat's a real street dream, why you sleeping on a nigga?\nNever me slipping, reaching for the blick again\nPeeled, sweet dreams, you sleeping with the fishes\nIn the creeks, send a finger to your Mrs\nAnd the meal, can't let them get the drop on me\nCall me what you want, just don't call the cops on me\nOr call me collect at the spot homie\n(Hello? Who is this? Where the fuck is Boldy?\nDawg working with the feds, trynna put them on me)\nGot popped with a brick and some mark money\nGot off with intent, did a 1 to 20\nFor snitching on my cuddy, nigga had it coming to him\nI fell off, but bounced back like Silly Putty (Big Dummy!)\nI risked fed time for this money\nIt's concreatures\nHellblock, hully gully\n\n[Hook]\n\n[Verse 3]\nWhen my back is against the wall\nWhat happens if it should fall?\nI live for today, but pray for a better tomorrow\nCrack is against the law\nWhat happens if you get caught?\nFor selling that yay? And they send you behind the wall?\nWhy would you risk it all?\nMoochie, I've been through it all\nMight as well give it all to me, I can move it all\nMagical with the wand, don't panic when it dissolve\nThat's just its purest form, no additives but the Arm and Hammer\nWhen whip it hard, the hammer is a revolver\nJam it like that's my song, they play it in rental cars\nTraffic and bricks of raw, bird play, chicken talk\nI know Sergei and I ain't talking Fedorov\nNiggas with jealous hearts turn state, tip you off\nDon't even know what a chirp weigh, or what it costs\nAfter a get it off, first base, second, walk\nStole third base, heading home, finna score a homerun\n\n[Hook]", "image": "https://images.genius.com/06f819733860ea6f65fb77cc4e85eb44.500x500x1.jpg"}]}