{"songs": [{"year": "1991-08-27", "image": "https://images.genius.com/40f66b653cd7b106d8dea9f33eac5a75.598x598x1.jpg", "title": "Let Go My Eggo", "album": "I Need a Haircut", "lyrics": "Ahhh-yew-whayaeuwwww\nNow it-it-it-it-it-it sound funky\nYo Doc, I'mma count it on three\nOne, two, three\n\nWell I'm not a qualuudes or a halucinogen\nI'm just comin up with rhymes that I invent\nOut of my head, or like on the spot\nAnd uhh, whether you know it or whether you not\n?? we did the Mudfoot in your town\nI-I'm super-educated, ready to get down\nJust check out what the heck I got to say\nIt's not the same ol', rhythm and rap cliche\nMarkie the king of a rec, I rock and put you in check\nHypnotizin recognizin plus I get respect\nAnd if you think you can, mess with the magical man\nI rock the mic do what I like and plus I got a plan\nSo don't be missin don't be listenin to the format\nDetermined like a German like a head is to a hat\nThat's why I qualify, as the better MC\nI never treat people like they were fleas\nBut if you think that I got a big head though\nEHHHH AHAHHHHHH! Let go my emehamahmmm EGGO\n\n{Cool V cuts \"I'm the BizMarkie, yo known for beatbox and the rap and..\"}\nLet go my Mmm ah mmm uh uh EGGO!\n{Cool V cuts again}\nLet go my mm mm mm mm EGGO!\n{Cool V cuts again}\nNow bust this out\n\nWell well well well you know it's me\nThe Mudfoot, yeah the Diabolical B\nI-Z-abba-zee-mm-A-Rrrah, I'm a superstarrah\nAlways rap on mines, so I don't have to bother\nI just come up out with somethin G like\nOther MC's thinkin, I'm on the mic\nSuper, duper, MC party pooper\nA tick-tock to the roc the mic and I recoup-ah\nRate and I am great, my DJ is a-ight\nIf he say rock it to the rhythm, well rhymes I be writin\nBMV Studios, didn't you know\nMy D-O-C is down and Jidoe\nI sing, on record, I get respected never neglected\nWell protected edu-I-do you know that I'm\nThe, oh-riginal B, I-Z-M-A-R, K-I with E\nAnd if you think it's me, no, I think it's the\nC-double-O-L V, and my man D-O-C\nI get with Big E, I zugga zagga zee\nI'm backwards other MC know what this mean\nHellafied king, I do my own thing\nMake the microphone sing, and you know that I bring\nAnd everytime I rock, I don't got a big head though\nFORGET THAT! Let go my mm-ah-ehrmm-mmah EGGO!\n\n{Cool V cuts \"I'm the BizMarkie, yo known for beatbox and the rap and..\"}\nLet go my Mmm ah mmm uhh EGGO!\n{Cool V cuts again}\nLet go my mm uh mm uh EGGO..\n{Cool V cuts again}\nLet go my mah-uhh umm-uhh EGGO!\n{Cool V cuts again}\n\nNow a lot of like people wanna know about me\nThe original diabolical energetical\nB-I-Z-mmmahhhzayy-Rrrah superstarrah of rap\nAnd it don't matter to me, I'll make your hands clap\nBest in zing, the man appointed rap king\nDown to wreck your body, I make the 'phone sing\nThat's why I say zzznoahh, MC shower\nHey, in Junior High School I say Shenandoah\nAnd, bedknocks and broomsticks\nWith my DJ Cool V, that is on the mix\nI do it out of my head-n, from hear to Homestead'n\nOr even Belleport cause it is my sport\n\n{Cool V cuts \"I'm the BizMarkie, yo known for beatbox and the rap and..\"}\n{Cool V cuts again}\n{Cool V cuts again}\n{Cool V cuts \"I'm the Biz\" over and over}\n{Cool V cuts \"I'm the BizMarkie, yo known for beatbox and the rap and..\"}\n{Cool V cuts again to fade}"}], "artist": "Biz Markie"}