{"songs": [{"title": "Ooh Big Momma", "album": "Big Momma’s House (Music From the Motion Picture)", "year": null, "image": "https://images.genius.com/3dec82a70eb0e2a58fce48c9a19a9536.500x500x1.jpg", "lyrics": "Yeah, (Yeah) Yeah, (Yeah) Yeah, (Yeah) Yeah, (Yeah) Yeah, (Yeah)\nYeah, (Yeah) Yeah, (Yeah) Yeah, (Yeah) Yeah, (Yeah) Yeah, (Yeah)\nLil' Jon and them Eastside Boyz, alright, alright\nTalkin' bout Big Momma, Big Momma, Big Momma\n\n[Hook x16\nGO BIG MOMMA!, go ahead, go ahead\n\n[Verse 1]\nUh, uh, uh, uh ooh, ah let's begin\nBig Momma comin' through better tell your friends\nWhat that South like\nThat good country cookin' all day and night\nShe might be big but she can still go\nTo the dance flo' to the back of our co'\nHey, don't talk no junk\nYa might get skunked with a mother gun, huh\nIf ya wanna fight\nBig Momma knock ya out with one aight\nIt's all to the good\nCause nobody watchin' over our neighborhood\nBut wait a minute\nI came to get with Sherry or Bennett\nCause she so cute\nAnd I love it when she wear them Daisy Dukes\n\n[Hook x16]\nGO BIG MOMMA!, go ahead, go ahead\n\n[Verse 2]\nI was at a jam the other night\nSeen Big Momma, she was lookin' tight\nIced out, grill in her mouth\nFlake in her hair, representin' that South\nOn the floor she was shakin' that thang\nPoppin' that thang, damn, twerkin' that thang\nBig Momma off the chain\nShe will show ya know shame cause she true to the game\nAnd ya know she serious\nAnd the way she bounce got a playa delirious\nAnd I know she ready\nGotta dance so crunk even though she heafty\nAnd when we left the club\nI seen Big Momma's Caddy sittin' on them dubs\nAnd the trunk with the block beater\nI was sittin' right behind her in the two-seater\n\n[Hook x16]\nGO BIG MOMMA!, what, what\n\n[Verse 3]\nOoh look at Big Momma, OOH BIG MAMA!\nBig Momma droppin' that thang, OOH BIG MAMA!\nBig Momma big and beautiful, OOH BIG MAMA!\nLook at Big Momma with them Daisy Dukes, OOH BIG MAMA!\nBig Momma got on some jammies, OOH BIG MAMA!\nBig Momma what chu' talkin' bout, OOH BIG MAMA!\nBig Momma done gone off the top, OOH BIG MAMA!\nBig Momma you scare me, OOH BIG MAMA!\n\n[Hook x16]\nGO BIG MOMMA!, go ahead, go ahead\n\nGO AHEAD! (Repeated to fade)"}], "artist": "Lil Jon"}