{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/64247e32a2f4bad9c47295bb1d1e3d2e.883x883x1.jpg", "title": "​florida (2019)", "year": "2019-04-05", "album": "ROSE GOLD", "lyrics": "[Chorus]\nI don't think I'll make it hanging here another day\nI get spirited away\nEvery time I'm near it I run clear the other way\nI disappear, I never stay, I'm spirited away\nI don't think I'll make it hanging here another day\nI wanna get spirited away\nI disappear, I never stay\nI disappear, I never stay\n\n[Verse 1]\nI'm out on the balcony, I can see the ocean\nI'm practicing alchemy on you, pour a potion\nI conjure a spell, wish you well\nI can say I'm joking when I call my city hell, but\nTossing dollars and pennies in wishing wells\nAnd I promised I'd be gone and forget it by 2012\nAnd I thought if I got out I'd never visit\nWhen you talk I think you're all a bunch of bitches\nAnd never listen\nI hide in closets, the smallest that I can fit in\nGetting restless, I fuss and I fidget and\nI feel so grey in my city, it's a prison\nI just wanna shine my colors on the walls like a prism but\nNo one answers when I ask how their work's been\nOr smiles back on the street or at the church and\nI don't speak and I don't care, it isn't worth it\nI'll be meek enough to inherit the earth, but\n\n[Chorus]\nI don't think I'll make it hanging here another day\nI get spirited away\nEvery time I'm near it I run clear the other way\nI disappear, I never stay, I'm spirited away\nI don't think I'll make it hanging here another day\nI wanna get spirited away\nI disappear, I never stay\nI disappear, I never stay\n\n[Verse 2]\nBitter and sad is how I'm feeling like I'm celery\nAnd I could draw the pattern on my ceiling from my memory\nI grow balls to show up at my old fave places\nDeep breaths Kitty, very brave face, chest out\nRemind myself I deserve this\nEven though they'll be whispering that I'm worthless\nMy mama says to show 'em what I'm made of\nBut they already know it all and that's what I'm afraid of\nAnd I've been real down but I'm powering up\nI've been a real big motherfucking coward, it sucks\nYou know it's been a couple years, I think I've had enough\nYou don't think I do it? I don't think I give a fuck\n\n[Outro]\nDo you really think it's fair that I've had to be scared of you?\nAre you embarrassed? I guess you better go and hide in Paris"}]}