{"songs": [{"year": null, "title": "Embarrassed", "image": "https://images.genius.com/af357ab92dde48966f2efd2335518e9f.268x268x1.jpg", "lyrics": "[Intro: Slug]\nLook at me for a second\nNo, seriously, look at me\nHonestly, ask yourself this\nLookin' at me, do you really think that there is any way possible for you to embarrass me?\nLook at me! Do you really think I care what you think?\nDo you really think I care what you say?\nLook at me!\n\n[Hook: Eyedea/Sage]\nI'm embarrassed by my past actions and even more ashamed\nOf my present thoughts and future endeavors to clear my name (x2)\n\nI'm embarrassed, I'm embarrassing, I'm an embarrassment, and it's all addin' up (x2)\n\n[Verse 1: Sage Francis]\nI'm so preoccupied with self indulgency to see\nWhat you provided me, I fully appreciate your offerings\nAnd the awful things in life are lessened\nBy lessons of self-acceptance\nI want blessings\nAnd I regret keeping a distance\nFor future reference over bridges are preventable, I know the traps\nHumanity as a whole will collapse, now close the gaps\nWe dwell on what we share, and what separates us\nWe're all different, but what makes us a unit?\nMusic is a universal language; so is anguish, pain, and torment\nBalance of emotions, it shows a happiness upon us\nNo more pickin' sides, one without the other is impossible\n(Uhh, forgot what I was supposed to say)\nThey call it bi-polar, unstable conditions, they got me lookin' over my shoulder\nThe book that I wrote ya', was meant to move the time slower\nBut it was spent cookin' my mind's motor, now I'm older\n\n[Hook] x2\n\n[Verse 2: Eyedea]\nYeah, it was in the cards that I’m to be forever haunted\nHip hop is slowly but surely becoming the Big Brother I never wanted\nTo hurt me, purely to mic\nStill my head is astonished with sonics, aesthetics\nPoetics and knowledge, and polished rhetoric\nEverything has its negative\nConscience consciously edit\nConstantly get rid of the rigorous repetitive movements\nBeen better than you since...\nIt's easier to talk to you about it than to do it\nHere I am, center of the spotlight\nThey all drunk and smilin', waiting for their cockfight\n\"Time to entertain\" says the clock of life\nSo I became the freaky kid I'm starin' at, even though you know it's not right\nEmbarrassment, it's in between insecurity and arrogance\nI'm a machine with a clarity I can barely grip\nSo if I seem red in the face, it's not cause I feel out of place\nIt's just that\n\n[Hook] x 2\n\n[\"Breakdown\" x2 - Slug]\nAnd I can yell all day, all night, all day\nAnd I still doubt that you would hear a word I say\nAnd I can drive all night, all day, all night\nBut if you stay with me, you'll never get it right\n\n[Verse 3 - Slug]\nI was never much for the self-driven skepticism\nI was that cat that let distraction affect my vision\nYou were the kitten that was screaming to\nCover up the sound of landing or crashing, however it was going down\nBut it's goin' down and it's goin' fast\nAnd I have no doubts about whether or not it's gonna last\nFill the glass, tilt your head backwards\nLet it trickle through the throat to where you hide your giggles and your laughs\nI'll wait to find the correct departure time\nShine my eyes to keep the lies from climbin' up inside my mind\nSome belong to you, and some belong to me\nBut none of them can escape the contemplation necessary\nYou can't scare me, but you can keep it buried\nPut your hands on the circle; try to steer me\nAnd now that I sing all of my songs worth singing\nI'm guessing that it's just a test to see how strong I can bring it", "album": "The Known Unsoldier...Sick Of Waging War"}], "artist": "Sage Francis"}