{"songs": [{"album": "Cameo King II", "image": "https://images.genius.com/e50d03732aaf738c0bbfd3aa449808b1.500x500x1.jpg", "year": null, "title": "Can’t Stop My Shine", "lyrics": "[Verse One][Krumb Snatcha]:\nBack in '96 when my first joint dropped\nMy first goal was to hit the ball up out of the park\nPrimo laced the track and I provided the raps\nIt was the perfect rendition of I'm fuckin' with gats\nThen one year further to the B.I.G. murder\nSix months before, 'Pac popped by the burner\nBeen predicted, I only told a few\nThey wouldn't listen till I caught the Rap Quotable\nNow the game is all static by the sound of automatics\nWhen hip hop is dyin', then it's tragic\nCame a long way since I Gotta Have It\nWhen Edo was the first Boston cat with a classic\nNeeded MTV Raps, Ed Lover, Dr. Dre\nWho would've thought he'd be rockin' each day\nMy up and comin' youngin' now takin' the reigns\nWith two legends and a mindset on changin' the game\nLet's go\n\n[Hook] [Termanology]:\nCan't stop my shine, no way cause I'mma blow, I'mma blow\nI'mma take it to the top\nJust a matter of time, I'mma do my thing, my thing\nShowOff, ShowOff\nCan't stop my shine, no way cause I'mma blow, I'mma blow\nI'mma take it to the top\nJust a matter of time, I'mma do my thing, my thing\nS.T. dot\n\n[Verse Two] [Termanology]:\nYo, back in '06 when my best shit dropped\nPrimo laced the beat, had the critics in shock\nTerm really tore down, Watch How It Go Down\nUsed to think he wouldn't blow but he gon' blow now\nBeen through some street shit, that I ain't peace with\nCats comin' through leavin' burners with my nieces\nKrumb heard me spit, signed me right on the spot\nAlbum never came out, went back to the block\nDid what I had to do, blew up S.T. dot\nRecords, I'mma make it on my own, watch me pop\nFirst LP dropped, didn't get a lot of scans\nBut I got a lot of press and I got a lot of fans\nFunny how I stage dive now when they throw they hands up\nWhen I jump in the crowd to hold me up\nIll cause I got that cream, give it to Preme\nMe, Stat and then Green, a money makin' machine\n\n[Hook] [Termanology]:\nCan't stop my shine, no way cause I'mma blow, I'mma blow\nI'mma take it to the top\nJust a matter of time, I'mma do my thing, my thing\nShowOff, ShowOff\nCan't stop my shine, no way cause I'mma blow, I'mma blow\nI'mma take it to the top\nJust a matter of time, I'mma do my thing, my thing\nS.T. dot\n\n[Outro] [Termanology Talking]:\nI'd like to take this time out. To thank everybody that been ridin' with me from day one. Krumb what up? DC. S.T. dot. The squad, you know what it is. Crazy man. Went from 3D, ST The Squad, Centerfield Records. Detonator Records, Amalgam Records, Brick Records, Nature Sounds Records, ShowOff. KS. Shout out to Skitz man. Ed Bones, Checkmark. Detention. Bob Nash. Man, there's too many to name man. Traffic, what up? All my cats in Law Town, Hell Town, you know what it is man. Termanology and DC. Krumb Snatcha. We out"}], "artist": "Termanology"}