{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "2015 BET Honors Visionary Award Acceptance Speech", "lyrics": "Well seeing that, I think I, maybe for one of the first times in my life, I understand how it is to feel humbled. I want to say some \"thank you\"s really quick. Thank God for Stephen Hill, who is so sincerely good at exactly what he does and gives so much and doesn't care about what Ghost somebody's driving or how big somebody's house is and brings the most awesome collection of classic, current, and futuristic black music every day. So, make some noise for Stephen Hill to start this\n\nSo, since this is pre-taped and the fact that Adam Blackstone used to be my music director, I'm pretty sure he's not gonna start the music on me. If I go Chicago for a second, you know it was interesting when I went and visited Minister Louis Farrakhan, and I just really wanted to expand so much more on the things that I had been talking about over the past couple years. And it was interesting or groundbreaking and really special for me to see his reaction and his expression about my relationship with a woman not of color, and for us to focus on the idea of love and not the idea of separation. You know, at the barbershop and everything, I used to hear people talking about, \"You know when an entertainer get on, of course you know he gon' go and get a white girl and buy her all this... and the white girl gon' go and get a rich black dude.\" But I want to say that my wife has dated broke black dudes. So it ain't got nothing to do with the money\n\nAnd it takes me back to a story that she told me where her father, Robert Kardashian, walked out, and on the side of his Bentley, they wrote \"Nigga lover\" because Robert Kardashian was the genius that put together the defense team that got O.J. off. She had never seen her father curse, get mad, he was the most laid back human being. And he went so crazy and tried to chase the people down, and she sat there crying and said, \"Dad why you going so crazy?\" He said to her, \"One day you may have a black child. A beautiful, beautiful, beautiful black child. And it's gonna be hard, you're gonna see how hard it is.\"\n\nSo, true enough, we deal with racism because there are different races, or the micro of it is that we focus on the different races, as opposed to the macro, which is the human race. The bit of soundbytes that everyone loved from last year that got taken out of context or misunderstood did come from a place of saying part of the reason why I'm not allowed to be empowered is because of race, because of people's perception of celebrity, because all they want to present to young black men is the idea of making it to the league or making it to be a rapper, but not the idea of becoming an owner. And they would do anything they can to make it seem like a truthful idea is a stupid idea or a crazy idea\n\nHarriet Tubman said she could have freed so many more, and I'm sorry mom if that was incorrect English. Harriet Tubman could have freed more if they only knew they weren't free. So don't think that because we can afford this custom Balmain suit that we're free. And don't think that because we can buy a $300,000 car that we're free. And don't think that because it's 3% of a gated community that has colored people in it that we're free. It's the mentality, the slave mentality, where we all eventually become slaves to that car. Slaves to the perception. Slaves to the idea of being cool\n\nI thought it was so appropriate the way Wayne Brady kicked his whole shit off tonight. For us to express ourselves. Our power, our oil, since we don't own any oil. Our oil is our expression, is our influence. Don't never let them take that away. And when we have the chance to express it and influence, don't only do it for us, do it for the human race"}], "artist": "Kanye West"}