{"songs": [{"year": null, "title": "The Next Spot", "image": "https://images.genius.com/cd29718e436b4c969a36495c282f35e7.400x393x1.jpg", "lyrics": "Hook:\nTo the next spot on to the next spot on to the next on to the next (x4)\n\nGrand Puba Intro:\nYeah. Sadatty X. Grand Puba baby. ? up in here. Huh\n\nGrand Puba:\nAy to my brother Big Dat show me what cha got\n\nSadat X:\nGrand Puba Maxwell only time will tell\n\nGrand Puba:\nTime to put it all down and spread it around\n\nSadat X:\nNow that the weather's warm lets release the storm\n\nGrand Puba:\nAy my MC thesis leave MCs in pieces like Rieces\nControling chickens with telekinesis\n\nSadat X:\nI shake the high school class way pass through the text book\nWill be the next hook check the home row\n\nGrand Puba:\nI hit a flow that's oddly cause I be Godly\nGrand Puba comin' with that garbage not hardly\n\nSadat X:\nIn the land of the wild we maintain our style\nWe play low, pickup the tab and go\n\nGrand Puba:\nHey we move swiftly like the second hand on a Rolex\nAnd move in the curve when it's time to cash the big checks\n\nSadat X:\nThere's a million ways to live on this thing called a planet\nI'm a live everyday I ain't takin' nothing for granted\nAs long as I can stand it or at least that's how I planned it\nLive well, be on catch the sunshine\n\nHook\n\nGrand Puba talking:\nHuh Sadatty X. We keep it moving. Yeah, Grand Puba baby. What?\n\nSadat X:\nFrom the island beaches to the high school teachers\nDancehalls and malls others graffitti on the wall\nI'll be here till three till the old bell rings\nGive me a minute to chill and I'll collect my things\nThe word around town is that I took the crown\nBest in the world pound for pound\nBeen around this place and I will astound\nSo c'mon everybody let's all get down\n\nGrand Puba:\nAy I ain't mad at this game it's been good to me\nI get Tommy free I get Nike free\nI got 19 inch chromes on my 8 50\nI got three different cribs no tellin' where I be\nSee, I don't like to brag but I'm good at this rhyme thing\nGun sling no drug things no matter what they hygene\nMy level on conscious make some sound like nonsence\nIt me, Sadat puttin' it to ya live\n\nHook\n\nGrand Puba talking:\nYeah lay up stay up. No dills new yills. All the way across the world and\nWe go like this\n\nSadat X:\nI make you party all night like when your mom work the night shift\nAnd you had company, a female body\nNow I ain't sayin' nothin' that ain't been said before\nWith my hands in the source as I'm make ya a big boss\nI seen the kid floss for one long night\nAnd get bail outta sight and can't handle it\nBut he fronted when the dinner was candle lit\nAin't no steaks for these frontin' fakes\n\nGrand Puba:\nAy third verse final chapter\nMad three smoke I'm after\nBut there's still one main factor\nTime to spread some love and laughter\nI'm civilized so I have to deal with Actual Facts\nNo matter where yo at it's still considered black on black\nRather see you with a dime havin' a good time to my rhyme\nSadat's rhyme and everything'll be fine\n\nHook", "album": "High School High (Music From and Inspired By the Motion Picture) "}], "artist": "Sadat X"}