{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/21bdd915768bba8a4230188219c45f1d.630x630x1.jpg", "title": "Bossin up (Remix)", "year": null, "album": null, "lyrics": "[Verse 1: Young Jeezy]\nI’mma show you motherfuckers how to kill a remix\nComin’ all black like I’m hittin’ them licks\nAll black .40 with them ladders hangin’ out\n30-round clips, call them shits chopsticks\nRun up in the booth with a ski mask on\nRun up in the booth make a ski mask song\nRun up the booth, then I hop up in the Coupe\nNow I’m ridin’ in the ‘Rari with a ski mask on\nI’m too bossed up, I need to turn my boss down\nKing of the Street shit, where the fuck is my crown?\nGraduated from the street with my cap and my gown\nYou the motherfuckin’ man if you servin’ your town\nMy lil’ nigga eat, sleep, shit and deal cocaine\nNot that rap shit, I’m talkin’ real cocaine\nCTE, TBC (what is is, homeboy?) “Boss Yo Life Up Gang”\nWith my boss bitch and she bossed up\nOn that 2Pac, she’s gettin’ tossed up\nCan’t cross me, you’ll get crossed up\nCan’t cross me, I’m too bossed up\nMy name Hefe, I do boss shit\nNo Old Star, get lost, bitch\nYou a bitch nigga? Then kick rocks\nJust know rich niggas do drop-tops\nYou ain’t shit, I talk shit\nEbola rhymes, my watch sick\nI’m Top Gun, I’m in the cockpit\nGot the game locked, call the locksmith\nNo Stan Smith, I do gourmet\nGiuseppes, new J's\nMy earrings, they cold as fuck\nCall the North Pole, that’s bossin’ up\n\n[Hook]\nValet park my whip, nigga\nHammer time for my chips, nigga\n(Bossin’ up) add it up\nYour girlfriend choosin’ so you mad as fuck\nChillin’ with my coalition, niggas rackin’ up\n(Bossin’ up) add it up\n(Bossin’ up) add it up\nA lil’ Louis, but my bitch want some bags and stuff\n\n[Verse 2: Kid Ink]\nIt go, uhh\nBossin’ up and you downgrade\nLook around and see a bunch of clowns\nTryna represent my town lately (wait)\nI’ve been gone for like 30 days\nI wore every chain, no wedding ring\nGot a boss bitch and she understand\nThat timing is everything\nNah, don’t trip – put it on the tab\nKnowin’ I’m a G, gotta put it on the bag\nBreak a bitch down, gotta put her in a cast\nShe ain’t got a ride, might put her in a cab\nYou ain’t even know, nigga? Put him in a class\nTrip, Big Chuck might put you in the past\nHit a blunt hard, nigga, put me in the pads\nJust rolled up, but the high don’t last\nRidin’ through the city, hope I don’t crash\nKnow they thought that it wasn’t gon’ last\nYou can’t even tell me why you mad?\nIs it really that bad, is you doin’ that bad?\nWhat you make in a year I pay in taxes\nThe money burnin’ holes in my pocket\nI just need somewhere to ash it\nNah, you ain’t gotta ask, bitch…\n\n[Hook]\n\n[Verse 3: YG]\nOkay, I’m bossin’ up…\n‘Cause I done already lost enough\nSee, like… ever since last year…\nEverythin’ I’m buyin’, now it cost one up\nSay, it’s dark as fuck…\nGirl, why you actin’ hard to fuck?\nWhy you got your guards up?\nLike you playin’ ball or somethin’\nPull up in that Porsche Panamera, park it up\nHop out lookin’ sharp as fuck, tint dark as fuck\nBitch, fuck up off…\nBut you know we don’t love them hoes\nYeah, me and Young partnerin’ up\nThat’s the talk in all the barbershops, nigga\nShaq height, couldn’t baller block\nProbably invest in all the stocks\nI’m 400, corporate thuggin’, Pushaz Ink the label\nMama still got bills that’s gotta be paid for\nRemember when mama wasn’t able?\nWith them credit card numbers, I was payin’ cable\nIt’s all respect over here… we gettin’ checks over here\nAll my homies rap, so all my niggas got next over here\n\n[Hook]"}]}