{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "Handle Your Time", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Intro: Sadat X/Convict 2]\nOh my goodness! Look what they sendin through nowadays! Ah, it's a light-weight! And he got a smirk on his face like he's all of that! Yeah, well, we gone see what it is!\n\n[Verse 1: Xzibit/Convict 1]\nWhat you in for? Everything under the sun\nRecently, got me first degree wit a hot gun\nThat's my third strike, so Xzibit can't go home\nFight to see Daylight like Sylvester Stallone\nDon't ask too many questions, nigga, keep that on the d-low\nMy family might mistake you for an undercover C-O\nLast one that tried didn't make it past booking\nFive times in the neck when everybody was looking\n\n[Verse 2: Sadat X/Convict 2]\nYou see the judge, but he don't budge\nThat's your third felony, I believe, strike three\nRemanded and stranded, to the cold steel granite\nLost to the world, your moms and your girl\nKeep your weight up, or your ass get ate up\nCats is stickin, straight up wit the shank, get more time in the tank\nAsk Hank, he bout to bank, killed a cop with high rank\nThey gave him life and now another cat is fuckin his wife\n\n[Verse 3: Xzibit/Convict 1]\nJust because I'm locked down don't mean the hustlin stop\nHeroin and pen joints, twenty dollars a pop\nYou a new recruit, so today, I'm letting you slide\nBut tomorrow, you'll be confronted with twos in the side\nIf you a smart motherfucker, you'll be falling with mine\nBehind bars, no bitches and cars, we only got time\nWhere I'm from, time is money and got neither to waste\nOnce in a while, catch a Canaanite in the wrong place\nBEAT HIM DOWN! Break the strongest hand, piss in his face\nStrike fear, play the rear, 'fore he catchin a case\nLow-class, got a dozen free visitors pass\nPlus the female C-Order wanna give me some ass\n\n[Hook: Sadat X/Convict 2]\nThis is your new home, boss, where you survive at all costs\nAnd if you don't, well, it's only your loss\nYou're only here 'cause you tried to floss and be the boss, ha\nHandle your time like a man, yo\nThis is your new home, boss, where you survive at all costs\nAnd if you don't, well, it's only your loss\nYou're only here 'cause you flossed and was the boss, ha\nHandle your time like a man\n\n[Verse 4: Xzibit/Convict 1]\nSo it's my twenty-third birthday (Yay!), drinkin Pruno\nYou know no matter what it take, we gotta celebrate\nFuck stayin straight, hair braided by this Muslim cat\nRegulate the whole yard, now we got the straps\nNiggas say, \"Who the fuck is that?\" The X-Man, rowdy\nGettin treated like the feds in the county\nCorrectional facilities, basically you don't wanna fuck wit these\nMurders and felonies keep you company (YEAH!)\n\n[Interlude: Kidd Creole/Convict 3]\nAnd yes y'all, come on in! All ya brand new, heifer, sissy, soft booty-ass shook niggas! Yeah, bitch, welcome to Central Booking! A sleepover for pimps, producrt hustlers, drug slingers, and gun clappers, even bitch-ass, shook-ass niggas like y'all! Get on your game! And by the look on your Mary Carey, kitten-ass faces, niggas about to beat you all down to the last stop!\n\n[Verse 6: Sadat X/Convict 2]\nI'm all good, as I telephone my hood\nAt first I was shook, tried to play by the book\nBut you can't bid your time by stayin in the cell\nI'm getting high every day like I was still on the corner\nWhere I'm in fat pink caps, New York to California\nMaking deals for mils, holding cigarette lottos\nGivin cats pills, and tell em, \"Yo, try those!\"\nNiggas try to scheme but my team is tight\nWe as shady as the night and bring fright to sight\nHey you be aight, but don't act like no sucka\nAin't you ain't got to be the wildest mothafucker\nUse control, put a cat in a hole if he's broke\nAnd let em know, I just wanna serve my time and go\nAnd flow, lay low, try to grab some dough\nAyo, I ain't tryin to jail, somebody post my bail\n\n[Hook: Sadat X/Convict 2]\nThis is your new home, boss, where you survive at all costs\nAnd if you don't, well, it's only your loss\nYou're only here 'cause you tried to floss and be the boss, ha\nHandle your time like a man, yo\nThis is your new home, boss, where you survive at all costs\nAnd if you don't, well, it's only your loss\nYou're only here 'cause you flossed and was the boss, ha\nHandle your time like a man\n\n[OUTRO/CONCURRENT MONOLOGUES]\n\nCONVICT 2: Yo man, shh... it's real, man. I need some new kicks man. Somebody slide me some money, man, or something, man. I ain't get no letters, man. Niggas forgettin about me, man, you knahmsayin'? S'posed to be my crew.. Can't even make collect phone calls, man! Tryna jam me on collect calls now. Nobody ain't home, nobody wanna write me, I ain't got nuttin to read, you knahmsayin'? Ain't nobody put no money on my books... It's like I'm starving in here, man. This ain't no fun! This ain't no fun!\n\nCONVICT 3: Oh what? Oh, shut the fuck up! Nigga, what? You gon' be my bitch tonight, man, what! I'll poke y'all, don't come on the island! Don't be on the island when I get there, motherfucker!\nWhat! Ah, um! You will be mines tonight, motherfucker! Mines, you hear me? You'll be mines tonight, motherfucker! Don't fall asleep tonight, bitch!\n\n[*footsteps approaching*]", "year": "1999-02-23"}]}