{"songs": [{"image": "https://images.genius.com/c5081e84cd0bc682af51474aeea57d7f.1000x1000x1.jpg", "title": "JOAN OF ARC", "album": "GOODNIGHT LOVELL", "year": "2018-05-30", "lyrics": "[Intro: Night Lovell]\nYou ain't talk back, like\nYou'll see\nYeah, ayy, ayy\nAyy\nFatality\n\n[Chorus: Night Lovell]\nTell me that she wanna ride me through the night then call me back\nI like how she riding 'cause she take that shit all in that bag\nI got bands in my pants and I'm dancing\nI'm like man, you a fan, why you snapping?\nNumb the pain, so I'm like, baby, you my novocaine\nI don't even know you, swear to God, bitch, how you know my name?\nI'm like damn, why you mad? I'm the god, nigga\nI'm so sorry, check that shawty, she's a gold digger\n\n[Verse 1: Ruby da Cherry]\nI don't give a fuck, never cleaning up\nBitch, my blood is mud, never clean it up\nEnter the Chamber of Love, set it on fire and run\nBitch, I'm a slut when it come to the drugs\nI was sent here to get fucked up and then die\nYou don't want me, bitch, and if you say you do, then you're lyin'\nI ain't a socialite, I'm staying home tonight\nMaybe another night, shawty give me dome, I'm high\nNever thinking with a sober mind\nSo I might guess that she left me for the same reason she loved me\nStole her fucking pills and now she don't trust me\nSlapped me 'cross my face, she said, \"Ruby, you disgusting\"\nBaby girl, I got money, ain't no need for discussing\nTold me never call her back and I don't think she bluffin'\n\n[Chorus: Night Lovell]\nThat she wanna ride me through the night then call me back\nI like how she riding 'cause she take that shit all in that bag\nI got bands in my pants and I'm dancing\nI'm like man, you a fan, why you snapping?\nNumb the pain, so I'm like, baby, you my novocaine\nI don't even know you, swear to God, bitch, how you know my name?\nI'm like damn, why you mad? I'm the god, nigga\nI'm so sorry, check that shawty... (Yeah, yeah)\n\n[Verse 2: $crim]\nCradle to the gray, I cradle in my grave\nFlickin' ash, brain on drugs, I can't get no peace of mind\nI can't lie it fucking hurts, I was designed to shine\nNow I'm popping bars 'til my brain fogs, drop like a phone line\nDon't speak, we just squeeze, bitch on her knees\nHelp me put my mind at ease, begging to God, I don't believe\nGive me relief, on this grief\nNo sleep, I can't eat\nLight getting dimmer and dimmer\nCall me selfish, blow my brains out, now I'm gone forever"}], "artist": "Night Lovell"}