{"songs": [{"album": "You Can’t See Me", "image": "https://images.genius.com/3ba027519405d3ba8a314fd3f7f0dc44.1000x1000x1.jpg", "year": "2005-04-09", "title": "The Time Is Now", "lyrics": "[Intro]\nKrrr, Amadou!\n\n[Hook: John Cena]\nYour time is up, my time is now\nYou can't see me, my time is now\nIt's the franchise, boy I'm shining now\nYou can't see me, my time is now!\n\n[Verse 1: John Cena]\nIn case you forgot or fell off I'm still hot, knock your shell off\nMy money stack fat plus I can't turn the swell off\nThe franchise, doing big business, I live this\nIt's automatic I win this oh you hear those horns, you finished\nA soldier, and I stay under you fighting\nPlus I'm storming on you chumps like I'm thunder and lightning\nAin't no way you breaking me kid, I'm harder than nails\nPlus I keep it on lock like I'm part of the jail\nI'm slaughtering stale competition, I got the whole block wishing\nThey could run with my division but they gone fishing\nWith no bait, kid your boy hold weight\nI got my soul straight, I brush your mouth like Colgate\nIn any weather, I'm never better your boy's so hot\nYou'll never catch me in the next man's sweater\nIf they hate, let 'em hate, I drop ya whole clan\nLay yo' ass down for the three-second tan\n(Krrr, Amadou!)\n\n[Hook]\nYour time is up, my time is now\nYou can't see me, my time is now\nIt's the franchise, boy I'm shining now\nYou can't see me, my time is now!\n\n[Verse 2: Trademarc]\nYeah, uh\nIt's gonna be what it's gon' be\nFive pounds of courage buddy, tint pants with a gold T\nUh, it's a war dance and victory step\nA raw stance is a gift when you insist it's my rep\nJohn Cena, Trademarc, y'all are so-so and talk about\nThe bread you make but don't know the recipe for dough though\nAimin guns in all your photos, that's a no-no\nWhen this pop, you'll lip lock, your big talk's a blatant no-show\nSee what happens when the ice age melt\nYou see monetary status is not what matters, but it helps\nI rock a timepiece by Benny if any\nThe same reason y'all could love me is the same reason y'all condemn me\nA man's measured by the way that he thinks\nNot clothing lines, ice links, leather and minks\nI spent 20 plus years seeking knowledge of self\nSo, for now, Marc Predka's living live for wealth\n(Krrr, Amadou!)\n\n[Hook]\nYour time is up, my time is now\nYou can't see me, my time is now\nIt's the franchise, boy I'm shining now\nYou can't see me, my time is now!\nYour time is up, my time is now\nYou can't see me, my time is now\nIt's the franchise, boy I'm shining now\nYou can't see me, my time is now!"}], "artist": "John Cena & Tha Trademarc"}