{"songs": [{"year": null, "image": "https://images.genius.com/b245dff946be15239da702e083f68370.752x752x1.jpg", "title": "Whatcha Gon Do?", "album": null, "lyrics": "Yo, yo, yo, yo...\nYo, yo, yo, yo...\nYo, yo...\n\n[Verse 1]\nIt's hard to explain how my squad can harbor the strain\nOf being the largest name in rap, since the almighty Kane\nAcknowledge the fame\nMy college terrain was the rugged streets from Harlem to Queens\nBack to the Bronx who fathered the dream\nThat Started this thing called rap, where I reign supreme, my team\nRegardless of that, I've seen things as far as a crack\nThat'll make the hardest largest artist heart just collapse\nI'm part of all that that's why it's so hard to go back\nAnd start it from scratch\nI'm locked and I'm trapped in a giant cage\nTryin to savor these few dyin days\nI have left, to the form of flesh\nShould I lie in my grave?\nI'm tryin to persuade, my mind to try to be brave\nAnd not give death the satisfaction of seein me dyin afraid\nThat's why I rise from the grave singing church songs like\nI was Je-sus Christ ba-rum-pum-pum-pum\n\n[Hook x2]\nWhatcha gon' do when Pun comes?\nKnockin' at ya front door\nAnd he wants waaaaaaaaaaar.. ooooh (holy shit) yeah\nHe ain't a rapper he'll kill you\n\n[Verse 2]\nTill my last breath I'll have death before dishonor\n(come on) and welcome drama (yeah)\nWit open arms and a code of honor\nMy hole persona equals that of gods\nDefinin' matters hard and more before you even had a job\nI'll stab and rob if I have to\nFuck it i'll blast you, tell the devil it was Pun if he ask you\nAnd let him know how we be deadin' um'\nShow 'em my emblem, the tombstone, the throne, every millennium\nA child is born that can perform at a level beyond\nThe expected 4 minute 30 second song\nWe reign supreme, my team be all up in ya dream\nWit the \"kill anything\" grill, chillin' beside the guilotine\nExecutioner style, black suit and a smile\nWho's next to get they neck hacked loose in the crowd, move from the aisle\nDon't make me have to prove that I'm wild\nWord to Cuban, my crew killers, y'all niggas shoot in the clouds\n(Who's in the house)\nPunisher's straight from hell. Who's in the house\n(Terror Squad motherfucker we the real)\nWhat's the deal, now you know that's how we roll\nHard core like BO bring in the corns baby bro"}], "artist": "Big Pun"}