{"songs": [{"year": "2010-05-04", "image": "https://images.genius.com/beef62d8ea8657f2a6cd799581e7499b.600x600x1.jpg", "title": "Grammy Night", "album": "See Me On Top III", "lyrics": "[Hook:]\nYea, the broads out\nBring the cars out\nTaking pictures of us cause the stars out\nIt's Grammy Night, Grammy Night\nIt's Grammy Night, Grammy Night\nChampagne poppin', gonna be hella spendin'\nI'm so fresh, yes, this award winnin'\nIt's Grammy Night, it's Grammy Night\n\n[Bridge:]\nI saw a month of stars, my whip Viagra hard\nPull up so fresh, so clean, valet pay me to park my car\nMy tux is tailor made, but I still rock my J's\n\n[Verse 1:]\nJust gotta take (?) yea you can surf these waves\nTake a picture of this pimpin' young nigga and you best gone frame it on your wall\nIt's a symbol to the haters that Young Krizzle wrote the book on how a nigga is supposed to ball\nCrawl, grind, shine, I'm\nRed carpet treatments are Debonair, yes just divine (?)\nOn the ride I gotta pull up thick, we deep up in this bitch\nJust me? ahahaha! And they all up on my dick\nLet a real nigga up in here, halfway (?) gotta make it clear\nNominated for the realest spitter any nigga ever seen in a couple years\n\n[Hook:]\n\n[Bridge:]\nOkay, questions about my methods to writin' and spittin' bars\nI say outrageous shit like - I'm not from here, I'm from Mars\nThat's where I get my cars, somewhere you outta visit\nMy spaceship malfunctioned and crash-landed in Mississippi\nI see what grindin' get me\nMore camera time than Brittany\nMy sex tape drop next week but I got it for the low if you need to get it\nMy space done put me on, tell all my fans I love ya\nI wrote my thank you speech, these nominees ain't bustin'\nThese nominees ain't nothin'\nThey albums sit on the shelves\nI have a better chance of losin' if I was against myself\nEven then I would win, to be this fly is a sin\nI'm on my way inside, let the Grammy's begin\n\n[Hook:]\n\n[Outro:]\nOne time for (?)'s Village\nBad news V-A\nThis is the See Me On Top Mixtape, Volume 3!\nBig KRIT, youngest in charge\nDJ Infamous\nCoach K I see you!"}], "artist": "Big K.R.I.T."}