{"songs": [{"year": null, "image": "https://images.genius.com/babcc14377cae1804c642e1fe1f6e2fb.500x500x1.jpg", "title": "Kilo Rap", "album": "Queens Chronicle", "lyrics": "Yeah Nigga it's that Kilo Rap\nPut another one on top bring a kilo back. Eh!\nThat way you could see more stack\nIt's that real hustle music, nigga kilo rap!\nYeah Nigga it's that Kilo Rap\nPut another one on top bring a kilo back. Eh!\nThat way you could see more stack\nIt's that real hustle music, nigga kilo rap!\nYo now I got the heart blow, push it by the cargo, Benz with the top low, ya'll Niggas talk slow\nThat's why yo money come slow, n' yo funds low\nNigga when the guns blow...\nClik full o gun bustas, flinch any gun toucher\nNigga it's a friday, split tha code five ways\nY'all Niggas violate, then you see tha nine spray\nDouble up - money back, Double up - hundred stack\nY'all Niggas wanna rap, pure shit comin' back\nMothaf*ckas talk but they don't want none of that\nNah, they don't want beef, stash in tha car seat\nBuck em' down spark heat, Nigga we don't talk cheap\nNuthin' but a \"G\" thang, shoot'em'up BANG BANG!\nAdded to tha hustle game, flippin' work, cuttin' cane\nYou don't see the f*ckin' chain hundred on the cupboard rings\nIf you ain't talking money, Nigga what the f*ck you sayin'?\nYeah Nigga it's that Kilo Rap\nPut another one on top bring a kilo back. Eh!\nThat way you could see more stack\nIt's that real hustle music, nigga kilo rap!\nYeah Nigga it's that Kilo Rap\nPut another one on top bring a kilo back. Eh!\nThat way you could see more stack\nIt's that real hustle music, nigga kilo rap!\nEy yo, do it for tha OG's, 36 ozs\n1000 grams on the PanAm overseas\nPut it in a pan or a pot\nJust to make it hot\nNigga when tha Term n' Rock...\nFreeze by the double digits, keys turn above the sniffers\nSqueeze turn the ugly bitches, f*ckin' for tha bubbalicious\nBaby mama's here to rock, with tha seed in tha pot\nWhen the pop out the others we gon' see it on tha block\nRight in front of rich deals, dipers full of shit still\nMommy got a piss grill, Daddy tryna pinch steel\nTrunk full of fishscale, put it on tha big scale\nNigga when tha shit's real...\nNow I need another bird, holla at my brother Irv\nCut it up in tha dirt, picture from tha gutta curves\nY'all still sellin' herbs, so you can't f*ck with Term\nSt. gettin' money, Nigga whatta f*ck you heard? !\nYeah Nigga it's that Kilo Rap\nPut another one on top bring a kilo back. Eh!\nThat way you could see more stack\nIt's that real hustle music, nigga kilo rap!\nYeah Nigga it's that Kilo Rap\nPut another one on top bring a kilo back. Eh!\nThat way you could see more stack, {Yeah reeeeal, nigga}\nIt's that real hustle music, nigga kilo rap! {yo}\nYo, in em' streets, where I make my ends meet\nIn tha belly of tha beast, screamin' f*ck tha police!\nN' I'm never gon' stop til' I'm the f*ckin' boss\nFlossin' in that new poss, movin' weight like Ricky Ross, but of course:\nYou already know tha name, kid, Noyd from tha f*ckin' bridge\nSteppin' on dope, movin' coke it is what it is\nI'm not yo average rappa, known as tha gun clappa\nBurnin'-tha-dutch master, twistin' haze all day\nI'm gangsta homie, I'm so hood homie, I keep that thing on me, so you know I'm good on it\nSit back n' let my paper stack, Yo it's that Kilo Rap\nI'll be movin' mo base than that Premo track\nA couple of grams, two o my mans\nGreyhound chink that's down a quart o the plan\nBeen in town just to lock down\nCall my connect\nLet'em know I just touched down\nBring me tha Tec\nIt's on!"}], "artist": "Big Noyd"}