{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "Nightmares", "year": "2003-06-24", "album": "The Entity", "lyrics": "[Verse 1]\nWell..\n(HIGH TIMES) what I experience when I hit the blessin\n(LIFE LINES) Cuz this is serious, we will kill your best friend\n(WRITE RHYMES) like no other being, spit awkward morbid shit\n(BRIGHT WHITE) Lights what you see, keep walkin towards it\n(SHINE HEIGHT) Web Entertainment, I'm gon' get famous with a\n(FINE LINE) from arrogance, David (?) forgot what's in this\n(LIGHT CRIME) I love eatin, livin, eatin, and breathin\n(FIGHT MINE) Dumb bitch for repeatin the things that she did\n\nGORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY\n\n[Verse 2]\nArmed and dangerous, AKs turn your brains to mosh\nMix my weed with angel dust, feds label us notorious\nVan Dyke nigga that love to bust. You laid to us\nThat nigga thats baggin and tacklin\nComing with strings and violins\nThat violent shit\nOn them beds we lyin in\nWe like to sin\nHigh off speed and nitrogen\nSo much dope, it's toxic shit\nYou try to go to sleep - oh not again\nI wouldn't snooze if I was you\nYou know what Gordy gon do to you\nKing of these dreams since '92\nLook at all the hell I've took him through\nCan't lay down cause you know who\nComes right in and haunting you\nReally wanna know what death like? Well, I'm the nigga to fuck wit\nYou niggas can't bust clips (cuz) me and Fat Killahz love the dumb shit\nFuck the dumb shit, get the 'K\nAll the intentions to hit your face\nHit your waist, grab your shit\nPeel this gat, spatter quick\nI don't think you wanna fight, son\nBlood will spill all of the night, punk\nAll these hoes, I have to hit once\nCrack or blow, you got to try one\nGot ten blunts, I got to light one\nSo what you gonna do, get high or what?\n\n[Hook]\nDon't let me fall asleep\nGordy will come for me\nHe shows up in all my dreams\nChasin and hauntin me\nGORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY!\nGORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY!\n\n[Verse 3]\n(I'M A LIVE WIRE) Burn up the stage with high adrenaline\n(FLYIN HEIGHTS) That purple haze, go cop some switches then\n(LIGHT TIGHT) Son his ass, punch him by his ear lobes\n(KNIFES SLICE) Cut his ass, gut him right in here yo\n(MAD BITES) Don't let your parents know you blow crack again\n(NIGHT LIFE) Got you sellin your soap mouth and ass again\n(QUITE NICE) with these hot rhymes that I allure\n(MY MIND) Your not inside, but I'm in yours\n\n[Hook]\nDon't let me fall asleep\nGordy will come for me\nHe shows up in all my dreams\nChasin and hauntin me\nDon't let me fall asleep\nGordy will come for me\nHe shows up in all my dreams\nChasin and hauntin me\nGORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY!\nGORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY! GORDY!"}]}