{"artist": "Big Boi", "songs": [{"lyrics": "[Hook: Big Boi sample]\nI keep it playa while some choose to play it safe\nBoy check the resume, it's risky business in the A\nI keep it playa while some choose to play it safe\nBoy check the resume, it's risky business in the A\nIn the A, in the A, in the A, in the A, uh\nA, in the A, in the A, in the A, uh\nA, in the A, in the A, in the A, uh\nA, in the A, in the A, in the A, uh\n\n[Verse 1: T.I.]\nI'm a Bankhead nigga, you can bank that nigga\nLooking for a sucka, well I ain't that nigga\nI'm looking for the money, where the bank at nigga\nI'm triple OG, outrank that nigga\nI'm cold, riding through the city on vogues\n30 karats in the Rollie for the bitches and the hoes\nHanging out the window of a Bentley\nI just met my connect, dropped off snow in the bluff\nOn James P. Brawley, ain't we ballin'\nGot a problem with it, nigga bang that 40\nNiggas nowadays just ain't like shawty\nDon't spit that cocaine like shawty\nSet it on fire, they flame ain't like shawty\nFlow don't go insane, I'm mental\nBlowing presidential, 20 bricks off in the rental\nWe official ATLiens with plenty ye to sell again\nDEA on our tail again, well tell amigo mail again\nDope boy, trap nigga shit I did it\nSay you want a hundred bricks well I bet I get it\nTell them other sucka niggas tryna rep my city\nK.I.N.G. bitch best get with it\nAll I know is go get it, swag so silly\nChecks on deck, I'm racked up with it\nGot a house College Park, stay stacked up with it\nGot a Louis V bag, stay sacked up with it\nBig diamonds in my Cuban\nThey won't be where we go shooting, mane\nIn the A, it's undisputed\nWe some legends, best to do it, mane\n\n[Hook]\n\n[Verse 2: Big Boi]\nKing shit, Buckingham Palace\nTil I'm bucking on a muthafuckin' beat goddammit, I\nAin't lost a step, but some of y'all niggas flaw to death\nSince Player's Ball, I was called the best\nAnd now they only call me Daddy Fat Sax\nThe Cadillac-a with the diamond in the back\nWith the sunroof top\nMy daddy said I'm lackin' the vitamin D the sun won't stop\nShine brighter, rhyme tighter\nThan anybody in your top ten my nighga, my nigga\nLike a postman, I deliver\nSee I'm the letter with the anthrax in it, pass that, hit it\nSniff it, snort it, then gon' take a bump shawty\nUh, take a number cause I'm serving the chumps\nThat wanna jump up and get beat down, I'm Brand Nubian\nBrand new again, never get old\nWhen I was little, boy they said I had a old soul\nOld gold\nRiding with some pimps on a ho stroll, now that's loco\nAnd you're local, and I'm global\nThat means worldwide like a rising tide\nI'm gonna subside and rise again like clockwork\nC-Bone is gonna show you how the Glock work *brrat*\nNonviolent though, no violence, just styling ho\nFrom the birthplace of MLK where everything ain't okay but KKK\nI'm more Malcolm than Martin, come get some, be a target\nStanding in the kitchen with the AK, aka the Choppa\n\n[Hook]\n\n[Verse 3: Ludacris]\nNow this is the A-Town, come on the premises if you wanna\nPlay with death, you get stung like the Crocodile Hunter\nGot them racks, slanging them packs and no we can't leave them sacks alone\nHired an assistant cause my weed need a chaperone\n(Luda!) And then Big Boi will pass the lighter\nI'm convinced that we started the California brush fires\nOne, two, and it don't stop; So many whips at my crib\nYa chick came, the bitch thought it was a road block\nSpending cash so fast, you'd think I'm foolish\nAnd I love chicks with ass so it arch like St. Louis\nGot chicks hugging my nuts like a speedo\n'Cause when I'm on the mic, I go for broke like T.O\nBut we know I'm rich and pay the bills at my mother house\nAtlanta cribs jealous cause I'm chilling at my other house\nYeah you may be able to out-trap me\nBut none of you niggas will ever out-rap me\n\n[Hook]\n\n[Outro: James David Manning]\nWhat is this that you say?!\nWhat's this you say?\nIs that what you say?\nIs that what you say?!\nIs that what you say?\nThey stay out all night on the basketball court\nPracticing, and practicing their jump shot\nPracticing their hook-shot\nAnd practicing and practicing, and then they're qualified for the majors\nWell why can't you stay up all night practicing your multiplication\nPracticing your Chemistry, practicing your Physics\nWhy can't you stay up practicing that?!\nIf practice makes perfect, then why do you just specialize in fun things\nAnd not in the things that require effort, commitment, and sacrifice", "image": "https://images.genius.com/af9aa263e6f33bdd7cb5fe2b7b03129c.500x500x1.jpg", "year": "2012-12-11", "title": "In the A", "album": "Vicious Lies and Dangerous Rumors"}]}