{"songs": [{"year": "2009-05-15", "image": "https://images.genius.com/37cf871f97468bf3b1525c3f0f5b065c.500x500x1.jpg", "title": "Big Brother (Freestyle)", "album": "The Last King", "lyrics": "[Intro:]\nI like this beat\nI mean it's just a loop and all\nBut, fuck it I'mma spit anyway\nBuck, I'm just gonna spazz on these niggas real quick\n\n[Big KRIT:]\nKrizzle, he a new breed, life's like a movie\nAll the newcomers like, who he? who me?\nJust a nigga straight up out the gutter With the skill to make a New Yorker wanna be Southern\nStreetlights tell the stories of the real niggas\nPardon me if half the time I don't feel niggas\nLike honestly, how the fuck you get a deal nigga?\nI guess once I get on, I'mma have to kill niggas\nLord I was tryin' not to push it to the ledge\nThe grind ain't sturdy and we hangin' on the edge\nMississippi got next, you heard what I said?\nNow still I'd rap some of the best when I'm dead\nCheck my cred, killer is a fact\nI'm talkin' 'bout bars, I ain't talkin' 'bout pecs\nWhen I get green like Gumby, I stretch\nA pair of J's out the case, yea I'm that fresh\nYes, give me any beat and I kill it like it's livin'\nI only do me, cause fuck how they feelin'\nThat green that I'm tottin' got me higher than the ceilin'\nThe whip color Sunny-D nigga, I'm orange peelin'\nStreetlight chillin', niggas can't touch me\nCar without an engine, bitch you can't budge me\nHeard the lames hate me and they baby mommas love me\nIf they didn't handcuff 'em at my show they'd prolly fuck me\nI'm a little crazy, I'm a little off though\nPut you on display in the day like a car show\nToss you in the trunk and drive away with the cargo\nAll I see is snow-bunnies call me Donny Darko\nGrill look mean on the whip it's a gargoyle\nIt's the shit niggas in the hood sell hard for\nA fine crib and a Lambo Mercilago\nA1 Credit and the next Top Model\nBut you know niggas\nThink they guns can stop 4 niggas\nClaim they hard as hell, but really ho niggas\nSlow niggas never get paid\nGold diggers get played\nAnd lame niggas never get laid\nUnless they throwin' fetti at a chick that call me daddy\nShe bring me all the money cause she know that make me happy\nGo out and break her back just to keep her nigga flashy\nAnd see me on top, she thought it was a classic\nI'm a nervous wreck on the mic, I keep spazzin'\nMarried to my money and she havin' contractions\nGave birth to money with (?) classes\nMy Tyler dig the new line of rubberband fashion\nChill"}], "artist": "Big K.R.I.T."}