{"songs": [{"year": "2013-03-05", "image": "https://images.genius.com/283cd237d7c947223a80f65f3252599e.500x500x1.jpg", "title": "SweetLips", "album": "Nehruvia", "lyrics": "[Verse 1]\nI'm walking down the hall and I’m waiting to see your face\nA real impregnable feeling I’m chilling, for-real its great\nAnd I wish, we could take some time alone to get know each other\nOnce we known each other, we can stay at home and phone each other\nNo phony covers I'mma mention your name\nI hope you thinking the same, I ain't playing a game\nThis shit is insane. I knew you for a month and some change\nAnd still I’m catching all these feelings I can't even complain\nCuz when I'm around you its a whole different thing\nI think of dropping to a Knee and giving you a new ring\nThe pain it bring, when I see you with other guys most of them I despise\nI swear its the weirdest vibe, I try not\nTo get jeal—I mean embarrassed for you; my pride's kicked in\nI'm so sick of sitting in class and listening to \"this plus the third\" and\n\"She's a bird\"—you're mine, lesson adjourned, nothing learned\n\n[Hook.]\nGirl you're the cutest to me\nSay you're the cutest to me\nGirl I swear you're the cutest to me\nGirl I swear you're the cutest to me\nYou're the cutest to me\nYeah I said you're the cutest to me\nYeah I swear you're the cutest to me\nYeah girl I swear you're the cutest to me\nI swear you're the cutest to me\n\n[Bridge.]\nI hope you ain't here cash, sorry girl but I don't got a lot yet I\nPromise I can pay you with laughs, for as long as you want, you can trust that. And I swear I'm in love cuz I ain't ever felt like this. I said I swear I'm in love, cause I ain't ever felt like this\n\n[Verse 2]\nI wish we were together more, you're the one I adore\nNever snore when I’m with you my heart hits the floor\nThere's a distant roar fuck its one of your whores\nAs soon as we starting talking people people coming in fours like\nLet's go, it's time to go to class. We late anyway\nAnd girl you know I'm tryna pass\nI just want us to last so I can forget the past\nThose other women were trash I want you and want you fast\nYou're in my grasp like a cheetah to prey\nI mean I’m ready to cuff but I… wait, what I say? Damn you got me tripping\nNever thought I’d see the day\nWhere those words leave my mouth I guess it's something about you\n\n[Hook]\n\n[Bridge]\n\n[Hook]"}], "artist": "Bishop Nehru"}