{"songs": [{"album": null, "year": null, "title": "Cosmic Kev Freestyle", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "[Verse 1: J. Cole]\nIt took me all day to find some inspiration\nIt just hit me like a ton of bricks, no renovation\nProblem with the game now, there ain't no innovation\nI see my shit all in your shit, we call that imitation\nAnd they say that’s flattering but I ain't flattered at all\nMatter fact y’all need to practice that more\nSee my man Nate, ask me if I gained weight, I said nah\nMy pockets got fatter, that’s all\nMoney was an issue but now that that’s solved, I ball, I ball\nLike Kobe in the fall\nPut trophies on my wall, rather trophies on my mantel\nDawg my shows be off the handle\nTake the proceeds, go to gamble, ha\nBet it all black, and pray I quadruple my salary\nIf I win maybe then I can pay Sallie Mae\nTold her I be dealing with some real life shit\nShe be asking when, bitch, when I feel like it\nCole World, Cole life, Cole blooded\nI be on my shit and look at all the hoes love it\nGot a hundred fifty bitches in the club staring at me\nHow that feel? Very happy (very happy)\n\n[Verse 2: J. Cole]\nCole World, Boy, check the degree’s\nThese lil niggas is trash go and get the Febreeze\nThat’s why I blew up on you sucka’s all thats left is debris\nOne soldier’s all that’s left is fatigues\nAct like you know me boy, I’m Kobe\nHow the fuck you gon step in my league\nRapping bout bullshit, your message fatigue\nPlayed out, phoney nigga probably only got arrested for weed\nAnd out here talking that dime shit\nDom Perignon shit\nNot gon cut it like some scissors on my lawn shit\nGrown cause I own shit\nThis is what you won’t get\nGame so cold, bring the blizzard to the Palms\nI’m a wizard, I’m a don and I put this on my mom\nI’m offended, I’m appalled\nIf y’all ain’t bowing\nClaim you a monster but y’all ain't growling\nClaim you a beast, why y’all ain't howling?\n‘Bout as sweet as a jumper on the gay Ray Allen\nI’m ’bout fucking hoes like Ray J wylin’\nKillin’ niggas like K K K violence\nI guess it’s why they pay homage\nMomma I’mma be BIG and I put that on the late great Wallace\nChristopher, check my temperature, nigga my integers..\nWhatever man\n\n[Beat Change]\n\n[Verse 3: J. Cole]\nAlone in my zone, tell me don’t it sound stunning\nBeen f-cked the world but she just now cummin’\nIf I ever fell off I would hit the ground runnin’\nI ain't never been the one for fourth down puntin’\nAiming at a couple heads, bitch I’m crown huntin’\nRed dots cause a nigga dread locks\nSo I lock pick just to lock shit back\nI want Money, Power, Respect since the Lox said that\nBetter stay up on your toes, this is not tic tac\nYet, I’m a breath of fresh air, you can place your bets here\nBallin’ like a Laker you should pray for next year\nCause I’m repeating and I’m 3-peatin’\nAnd I’m knee deep in the game its quick sand and I keep leakin’\nThe label heat seekin’, nigga ain't sign me, what the fuck was he thinkin’\nThey say I killed the game, that was only pre-season\n\n[Break]\nI’m heavy\nI’m heavy\nMan these niggas get exlusives\nHey, hey\n\n[Verse 4: J. Cole]\nMan, I’m already hot, you can say I’m pre-heated\nIf money talks, mine telling your’s “be seated”\nCut my leg off I wouldn’t be defeated\nIllest nigga in the game bitch and you can retweet it\nEmail the shit make sure you CC it\nFor these fuck niggas who don’t wanna believe it\nI be in the airport damn near bare foot\nSecurity hollin’ out, Cole we need it\nGetting high as fuck and I don’t even be weeded\nNo point drinkin’ I can’t even be faded\nReal recognize real like they related\nYou ain't no fucking G boy, your style G-Rated\nHatred is flattery I’m glad to be hated\nFuckin’ bad bitches that would rather be dated\nCarolina niggas just happy he made it\nMy money was running late now, now it’s happy belated\nI’m heavy, nigga I’m heavy"}], "artist": "J. Cole"}