{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/b294ecc265a79f3e4ef86c41b208e8e4.500x500x1.jpg", "title": "Pressure", "year": "2008-07-08", "album": "I Pledge Allegiance to the Grind II", "lyrics": "[Malcolm X]\nWho are you?\nYou don't know?\nDon't tell me 'Negro'\nThat's nothing\nWhat were you before the white man named you a 'Negro'?\nWhat was your name?\nIt couldn't have been 'Smith' or 'Jones' or 'Bush' or 'Powell'\nThat wasn't your name\nThey don't have those kind of names where you and I came from\nNo what was your name?\nAnd why don't you now know what your name was then?\nWhere was your history?\nHow did a man wipe out your history?\nHow did the man, what did the man do to make you as dumb, as you are right now?\n\n[Killer Mike]\nMotherfuckas I just bought some new chuckas\nThe old ones bloodied up from stomping out mo' suckas\nBig bad Killa\nBig black gorilla\nKing Kong on you monkey ass niggas\nStep and fetch funky ass, flunky ass niggas\nDick in the booty for your Massa' ass niggas\nI don't fear no man\nNot Bush not Clinton not Osama\nAsk your Uncle Thomas how he choose Massa' over Obama\nYou could have a million dollars and a white collar\nLiberation costs more then a damn dollar\nIt costs what Christ gave\nKing gave\nX gave\nA billion dollars don't make you an ex-slave\nNigga With an Attitude since fifth grade\nI never behave\nRather be a dead man than a live slave\n\n[Hook:]\nWe can say what we like\nPut the pressure on 'em\nIce Cube and Killer Mike\nPut the pressure on 'em\nI can do what I want\nPut the pressure on 'em\nBut god dammit I'm gonna\nPut the pressure on 'em\nPut the pressure on 'em\nHomie put the pressure on 'em\nPut the pressure on 'em\nHomie put the pressure on 'em\nPut the pressure on 'em\nHomie put the pressure on 'em\nCause pressure bust pipes\nPressure bust pipes\n\n[Ice Cube:]\nI'm here to deprogram you\nDon't forget what they made your great grandmama do\nWhat they made your great granddaddy do\nWithout a dollar or a penny or a thank you\nThe same motherfuckers wanna gank you\nCause they hate you and the pussy that you came through\nCan anybody tell me that it ain't true?\nThat these motherfuckers ain't out to hurt you\nThey'll lock you up, beat you up and work you\nPut your life on a thirty year curfew\nLittle cell little window for you to look through\nEven gotta a little chair where he can cook you\nNigga please I'mma be in the breeze\nBeat 'em up with my plan like the Japanese\nNow I'm overseas\nAnd I'm trapping these\nThank God I didn't have to cock and squeeze\n\n[Hook]\n\n[Killer Mike]\nBlack politicians stop bullshitting\nAnd you funky black preachers with your pulpit\nOur kings had dreams and a big vision\nAll you give us is government and religion\nIs you a freedom fighter or a stool pigeon\nIs you down for your people in the big mission\nOr you a dirty nigga working for a fucking Clinton\nOr you dirty nigga working for a fucking Bush\nAnother message for the politicians:\nBetter get the police off our ass quickly\nIf another old lady die in this city\nSwear to god we will burn down the fucking city\nBig schemes\nBig dreams\nYeah I'm with it folk\nBut twenty years of selling dope just a fucking joke\nAnd so what, you the man with that white man?\nProbation got your answering to a white man\n\n[Hook]\n\n[Killer Mike]\nGod dammit the Red Dogs and Ramparts running rampant\nThese pigs going ham sammich\nIn New York killed a young brother\nIn Atlanta killed a grandmother\nAnd politicians say 'save the planet'\nFuck that, save us dammit!\nFrom the black pigs helped 'em kill Sean Bell\nI hope it's five degrees hotter for your ass in hell\nRace traitin' bastard, you less than trash\nI hope when Jesus come back he murder your ass\nSo you burn in hell 'til you turn white ash\nTo the one that say 'sorry' tell' em 'kiss our ass'\nWe don't need em motherfucker you can keep it for yourself\nI wish you nothing but pain and bad health\nI hope luck run away from you and wealth\nNo honor in life no honor in death\nYou a Judas to us, nigga kill yourself\n\n[Hook]\n\n[Malcolm X]\nNo Negro leaders have fought for civil rights\nThey have begged for civil rights\nThey have begged the white man for civil rights\nThey have begged the white man for freedom\nAnd anytime you beg another man to set you free\nYou will never be free\nFreedom is something you have to do for yourselves\nAnd until the American Negro lets the white man know\nThat we are really really ready and willing to pay the price that is necessary for freedom\nOur people will always be walking around and second class citizens or what you call twentieth century slaves\n(What price are you talking about sir?)\nThe price of freedom is death"}]}