{"artist": "Pink Guy", "songs": [{"album": "Pink Season", "title": "Goofy’s Trial", "image": "https://images.genius.com/176ec7cd55a78c0fcb8c2560fa88283c.1000x1000x1.jpg", "lyrics": "[Judge]\nWill the suspect please take the stand?\nMr. Goofy, is it?\n\n[Goofy]\nA hyuh, yuh!\n\n[Judge]\nMr. Goofy, you are here today being charged with mass homicide--\n\n[Goofy]\nA-yuh!\n\n[Judge]\nAnd your lawyer is here, present? Am I correct?\n\n[Lawyer]\nYes, I'm his lawyer, Joe Rosenberg, I'll be representing him here today in court\n\n[Judge]\nNow from what I see here there is strong evidence supporting the mass shooting, it looks like here, you were caught in broad daylight on CCTV (gorsh) holding an AR-7\n\n[Goofy]\nEyup!\n\n[Judge]\nSo you're admitting that the man in this footage is you, correct?\n\n[Goofy]\nHuh huh, yuh!\n\n[Judge]\nSo you do admit that this very same footage, right here, from the very same CCTV of you massacring a public Elementary School is you as well?\n\n[Goofy]\nA-hyuh hyuh hyuh gorsh!\n\n[Judge]\nIs that a yes?\n\n[Goofy]\nA-hyuh hyuh!\n\n[Judge]\nCan I get a yes, Mr. Goofy?\n\n[Lawyer]\nI object, my client has done nothing wrong\n\n[Judge]\nHe killed 27 children and crippled 5!\n\n[Lawyer]\nHe's clinically insane, Your Honor, he's crazy!\n\n[Judge]\nMr. Goofy, this is not a laughing matter\n\n[Lawyer]\nI told you, he's insane. His wife miscarried\n\n[Judge]\nMr. Goofy, what do you have to say for yourself?\n\n[Goofy]\nA-hee hyuh guilty!\n\n[Lawyer]\nYour Honor, my client would like to plead Insanity\n\n[Goofy]\nA-hyuh hyuh nope!\n\n[Judge]\nWait-wait hold on, Mr. Goofy you are saying that you were conscious?\n\n[Goofy]\nHyuh!\n\n[Judge]\nYou were conscious and aware of your actions, is that correct?\n\n[Goofy]\nHah hah, eyup!\n\n[Lawyer]\nGoofy! Goofy what are you, what the fuck are you doing?\n\n[Goofy]\nHyuh hyuh, gorsh I did it!\n\n[Judge]\nMr. Rosenberg, looks like your client has decided to come clean...\n\n[Lawyer]\nHoly fucking shit. Your Honor, I would like to call for a Recess I would like to talk to my client in private\n\n[Judge]\n(Sigh) Fine. You have five minutes\n\n[Lawyer]\nThank you, Your Honor\n\n[Judge]\nYou have five minutes\n\n[Lawyer]\nThank you, Your Honor\nGoofy, Goofy get the fuck over here!\n\n[Goofy]\nE-Hyuh hyah hah I did it!\n\n[Lawyer]\nGoofy, come here, Goofy Goofy, come here, listen to me. Alright, Goofy, Goofy, you're on thin ice right now. You're on thin ice buddy, come on. Shape up\n\n[Goofy]\nI did it!\n\n[Lawyer]\nYeah, yeah I know you did it, yeah, we all know you fuckin' did it, okay? But we can get you off! We can get you off!\n\n[Goofy]\nE-hyah I'm a murderer!\n\n[Lawyer]\nWe all know you're guilty. Look, Goofy, I'm Mickey's best lawyer, okay? He wanted me on this case because he cares about you\n\n[Goofy]\nI'll fuckin' do it again!\n\n[Lawyer]\nOkay, Goofy, do you want to go to jail?\n\n[Goofy]\nNope!\n\n[Lawyer]\nDo you want to go to a psychiatric ward?\n\n[Goofy]\nNope!\n\n[Lawyer]\nNo? Then you say that you're not guilty. You didn't do it\n\n[Goofy]\nBut I did!\n\n[Lawyer]\nYeah, I know you fuckin' did it but just say that you didn't!\n\n[Goofy]\nA-hyuh hyuh g-gorsh!\n\n[Lawyer]\nOkay Goofy, you gotta take this seriously. You killed 27 children, okay and we all know that, we all know that but I can get you out of this! Do you know how much money Mickey put on the line for this? Do you know how much money he's paying? He's doing this just for you, because he cares about you! If not for me, do this for Mickey!\n\n[Goofy]\nMmokay!\n\n[Lawyer]\nI don't care about losing the case, just do it for Mickey!\n\n[Goofy]\nHah hah okay!\n\n[Lawyer]\nGoofy!\n\n[Goofy]\nHah hah, MURDER!\n\n[Lawyer]\nGoofy, shut the fuck up! Why?\n\n[Goofy]\nThe demons told me to!\n\n[Lawyer]\nGoofy, fuck! Shut the fuck up! Goofy!\n\n[Judge]\nGuilty\n\n[Goofy]\nDying children!", "year": "2017-01-04"}]}