{"artist": "Problem", "songs": [{"album": "Selfish", "title": "Mission Statement", "image": "https://images.genius.com/8165c0445cec284a3a939bed51fc0555.1000x1000x1.jpg", "lyrics": "[Intro]\nHey, before you take them on this ride with you. Just know you gotta show these motherfuckers. You gotta show them what is that shit is that you get. This ain’t no fucking rapper, this ain’t no artist. You a movement, (Diamond Lane) you the struggle, you the vibe. You're Chachi, baby. Now start this bitch. Oh, and um, It’ll all make sense by the fourth quarter\n\n[Verse]\nChachi!\nNiggas choose a dumb dollar over smart pennies\nIf they don’t see the strings attached, don’t mean they ain’t any\nIf you ain’t took a loss, then most likely you can’t feel me\nHad it up, I’m one hundred, that’s two fifties - always\nUnless I’m dealing with this bitches\n'Cause handling the real ain’t really in they intuition\nBaby mamas included, take heed 'fore you be sorry\nOne of mine fucked the homie, another one fuckin' robbed me\nFrom industry roles to eye level with Glocks\nSurvived time after time, like watches chasing the clock, Chachi\nStill standing, still 3-5-4 banging\nTill my numbers in the rafters, look at 3-5-4 hanging\n'Fore I’m done I'ma have the world 3-5-4 banging\nBad bitches 'round L-A bet I 3-5-4 banged it\nYea, dick swinging on another level\nY'all niggas angels acting like the fucking devil\nHad some deals on the table but I backed out\nCounted mills on the table 'fore I plaqued out\nHad a three-way with your girl, yea, we maxed out\nBut I don’t remember shit, boy, I blacked out\nBird told me before I go I gotta teach him something\nIf it ain't brought about no change, then its all for nothin'\nDuckin' range, homies killed, shit it’s all for nothin'\nDiamond motherfucking lane, shit it’s all or nothin'\nStaying tall at Jabbar, we don’t fall for nothin'\nWe let these clown niggas be clowns, we just sit and watch\nWe got ours out the mud, we don’t know no stoppin'\nAnd put our backs against the wall, you gonna hear them shots\nDrak Drak, got me walkin' with my cash out\nPull up drunk, fuck your girl like I'm fresh out\nPick my youngin' from the county, boy, he fresh out\nPublic defender tried to screw him but he straight now\nMind tickin', politickin' on another million\nEverything is about precision, youngin' sit and listen\nDon’t get high and make decisions, when you on your mission\nMy last nigga that didn’t listen doin' life in prison\nShe got me sick, I need to heal up\nFeel it in my stomach like a sit up\nNiggas all said I fell off, oh, I needed that\nYea, say ol' boy took my spot, well I need it back\nFuck, whats happenin?\nDon’t make a nigga count a hundred thousand out\nDon’t make me start fucking niggas hoes again\nDon’t make me start running up on niggas with mirrors\nMakin' it easy for niggas to see how hoe they is\nI ain’t playin' nice wit niggas for no rap verse\nAnd I ain’t actin' like I like you for no rap verse\nMust I remind you niggas, I was in the trap first\nAnd I ain’t get thrown a P, Bro I push stacks first\nSole survivor’s in my blood, check my DNA\n[?] in a skirt I’ll be a okay\nMy new bitch body bang like an 808\nStay with that heat, 2-2-3’s Bape NMDs\nDiamond freeze, cold world needed heated seats\nThese fucking streets will turn a yee into a fucking beast\nStill got a thang for cute bitches wearing buns\nFreak pretty hoes and every bitch that's 'bout they funds\nMy girl fucked a real nigga now she hate lames\nStill with my day ones, can you say the same?\nNigga, can you say the same?\nIf you can't you got to live knowing you to blame\nChachi, nigga", "year": "2017-09-26"}]}