{"songs": [{"image": "https://images.genius.com/8d1a48ea8ab5436870849834ec8b060a.480x360x1.jpg", "title": "If U Were Mine", "album": "Crenshaw", "year": "2014-01-29", "lyrics": "[Intro: Nipsey Hussle & Sade \"Cherish the Day\" sample]\nIf you were mine\nIf you were mine\nThe way that I move\nWe still up all night\nAnd I breathe your air\nRunnin' this marathon\nYou only can...\n\n[Verse 1: Nipsey Hussle]\nLook, now, I can't promise commitment, but I swear we'll have fun\nIf you, ask I'll be honest, girl, you not the only one\nJust a man on a mission, with my hand on my gun\nCouple niggas that hate me, but way more people show love\nNiggas tryin' too hard, they dyin' to ball\nThen turn around and hate on me like it's a crime to evolve\nToo afraid to be different, too ashamed to just listen\nSee I'm way too 100, so now they hate on my niggas\nTried to hate on my Crippin', tried to hate on my business\nNot to call you a bitch, but they gon' hate on my bitches\nSo if you fucking with Nip, let you know my intentions\nGot to think like a rider, you gotta know your position\nSo if it's cool, then we can hop in my Mercedes coupe\nPop the cork off this imperial Veuv'\nCrank the music, blowin' circles out the roof\nAnd just enjoy the view\nShe said\n\n[Chorus: Nipsey Hussle & Sade sample with James Fauntleroy backing]\nIf you were mine\nI said\nIf you were mine\nThe way that I move\nAnd I breathe your air\nLet me hit somethin' wit' you, lil mama\nMatter of fact\nYou only can...\n\n[Verse 2: Nipsey Hussle]\nAy, I'm not trippin', back and forth with your nigga\nScared to lose what you got as you lookin' for something different\nMe? \"Fly Crippin',\" international trippin'\nI got my numbers up and now they pay for my statistics\nYeah, young nigga, started off with a vision\nBuilt this shit up from nothing, to the critics I ain't listen\nNow, transition, so check out how I'm livin'\nWe V12 pushers and they transmissions is slippin'\nNigga, get yo' bitch, 'cause I be bitch-gettin'\nTreat her like she wanna be treated, but I ain't trickin'\nBeat it like she want her shit beated, but I don't kiss it\nJust blame it on that shit that we smokin', plus we sippin'\nLook, double cups, she tryna double up\n'Cause I just hit it once, but she caught a double nut\nNasty, since she use to double dutch\nToo quick to fall in love, what the fuck?\nShe said\n\n[Chorus: Sade sample with James Fauntleroy backing]\nIf you were mine\nIf you were mine\nThe way that I move\nAnd I breathe your air\nYou only can...\n\n[Bridge: Nipsey Hu$$le]\nLook, now, if I was yours, and you was mine\nWould you do me like you do him and have someone on the side?\nSo, keep yo' nigga, while I stay on my grind\nJust hit me up and we gon' spend some time\nLook, if I was yours, and you was mine\nWould you do me like you do him and have someone on the side?\nSo, keep your nigga and I'll stay on my grind\nJust hit me up and we gon' spend some time\nRight?\n\n[Outro: Sade sample with James Fauntleroy backing]\nIf you were mine\n(All Money In, No Money Out)\nIf you were mine\nThe way that I move\nAnd I breathe your air"}], "artist": "Nipsey Hussle"}