{"artist": "Ace Hood", "songs": [{"title": "Home Invasion", "album": "Starvation 3 ", "year": "2013-01-17", "lyrics": "[Hook]\nPlaya, hater\nTurn your head round\nLay on the ground\nYou’ve been robbed\nWake up, open the door\nLay on the floor\nYou’ve been robbed\n\n[Verse 1: Ace Hood]\nUh, Nigga I smell murder\nGlock 9, put it in your sternum\n10 killers in the Chevy\nNigga 16 with the burner\nTell em put the money in the bags, go and show me where the stash, acting funny with the cash ha?\nOk, niggas wanna play dumb-dumb\nDirty Glocks, never knowing where they come from\nBang, motherfucker get low\nHundred round chopper, that potato on the nose\nKillers stay lurking and they do it on purpose\nI just tell em keep shooting like they trynna overdose\nKeep playing with a real nigga\nYou gon' end up in a box like Hilfiger\nYeah, yeah you looking at a gorilla\nI don’t like no niggas holding niggas Glocks like a 4 wheeler\nCos that bitch go to kicking, Liu Kang\nAll black when I’m ridin, Bruce Wayne\nNiggas bolt to the money, Usain\nNever change them true, 2 Chainz\nHundred grand to your boys like loose change\nBetter hush for that chopper wanna do things\nBang! Chit-chit bang-bang!\nNigga!\n\n[Hook]\n\n[Verse 2: Ace Hood]\nPhone call from my Haitian homie say papi got the good yay\nNo cellphone, no landlines, he do business off the 2 way\nCall the homies, they gon run up on him, got sticks a waving too late\nYou know what I came for so don’t play\nLeave 100 O’s round where you stay, Lord\nSomebody call the po-po\nSnitch niggas die slow\nWill they ever catch me?\nPussy nigga no no\nRunning out your mouth, I’m just hoping you about it\nEvery nigga with me, boy they ready get started\nNo patdowns when I walk up in the party\nSmoking that stank, who he think he Bob Marley?\nNo games\nWhen I pull up in that foreign, kill niggas\nHood nation motherfucker, real niggas\nWon’t stop getting money, deal with it\nYeah I’m fucking your bitch and I’m still in it\nNo tints in the whip so you see me in it\nI can run through a clip less than 2 minutes\nBang bang, reload til it start clicking\n\n[Hook]\n\n[Verse 3: Vado]\nUh, half a drank like who gave you?\nMove caine, I’ve been Abel\nBaking soda, no label\nTV on but no cable\nStreets talking, I heard em\nHands out but curd him\nHe don’t wanna work, he just wanted work\nThat he can handout and just burn him\nHeard it all before though\nThen went and copped the four-door\nTold pop I needed four more\nHe text me back like for sure\n10 choppers going fofo\nChrome four four, crack blow dope\nHad em all magnets\nWhy we don’t smoke\nI mean no speak, I thought I won’t eat, nah\nI’m tired niggas, tired niggas\nQuick to talk how they tie niggas\nI’m on the block like who’s tied nigga\nGun is cocked like who’s fire quicker\nCorner pack like those my niggas\nG spots, we racking them\nChurch guarded, I’m backing them\nThat’s a lot of money, we stacking them\n\n[Hook]", "image": "https://images.genius.com/155dcdf9038945b022391808dd3f0c60.500x500x1.jpg"}]}