{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "Holidaze", "album": "The Chalice", "lyrics": "Billy woods - “Holidaze”\n[Emcee(s): billy woods]\n[Producer(s): 007 (AKA Bond)]\n\n[Verse 1: billy woods]\nBack of the bus, I-95, going to meet\nThe man.  Home for the holidays, frankincense\nAnd haze for the fam\nNot quite back in the days, trying to keep the brother ways\nNiggas on the lamb\nCrime pays and takes back with the other hand\nHe got smoked, goddamn\nI’d seen this brother still with butters\nPushing a land, eating Fudd ruckus, getting\nFat.  Big rims where he move\nGot a big gat.  Dime broads, small\nWaist, big rack, got it like that\nTold me how a couple cats got kidnapped\nDuck-taped and electrocuted ‘til they\nGave up the stacks, getting straight jacked\nGary got deported and he ain’t coming back\n\n[Hook: billy woods]\nSo if you see me pushing, that’s my moms\nAnd if you see me with the dug, that’s the bomb\nAnd if you see me around, I ain’t\nStaying long.  Y’all stay strong\n\n[Verse 2: billy woods]\nGot love from old co’.  I ain’t gonna\nLie—a lot of niggas I used to fuck with though\nCan’t fuck with no mo’\nDown here, they get jelly over dro, feel me\nYo?  We all po\nGliding in the Caddy with Maggie, pass\nSpots where I used to cop baggies\nA lot of peoples doing badly and got\nThat swing.  Life straight\nClipped their wings.  Old cus-\n-tees paging for that thing\nNah, man.  I’m on vacation\nThis ain’t the old days, Ziplocs in\nThe basement, a nigga really trying to be\nPatient\n\n[Hook: billy woods]\nSo if you see me\nPushing, that’s my moms\nAnd if you see me with the dug, that’s the bomb\nBut if you see me ‘round here\nI ain’t staying long\nY’all stay strong\n\n[Verse 3: billy woods]\nDropped by to see Shelly.  Homegirl got a full\nBelly—like she ain’t got mouths to feed already\nWhat can you say?  Once they’re here\nIt’s to stay.  Show ‘em love anyway and just\nPray.  For what it’s worth, it’s still love\nIn every birth, but I can’t lie.  Shelly\nLooking cursed, work her fingers to the bone\nSo them kids grow up alone.  Baby\nFather done ‘em wrong, slapped her in front\nThe kids, and that’s my nigga, you dig?\nSomething real bad in the air\nLike gunpowder.  To all\nMy peoples under God towers\nAll the motherfuckers getting six dollars\nAn hour, I’m going to meet the man\nJanuary flowers\n\n[Hook: billy woods]\nSo if you see me pushing\nThat’s my moms, and if you see me with weight\nThat’s on the arm, and if\nYou see me with a gun, you know what went wrong\nY’all stay strong"}], "artist": "​billy woods"}