{"songs": [{"lyrics": "[Hook]\nWhat is that.. in the stereo\nThat's Acey/A.C. - Automatic Control\nWhat is that.. in the stereo\nAHHH! That's Acey/A.C. - Automatic Control\n\n[Verse One]\nI can leap over a buildin with the greatest of ease\nGet up and rock the party like you wouldn't believe\nGet everybody goin they'll be gone with the wind\nGo all around the world come back and do it again\nI can really rip a rapper for whatever it's worth\nAnd introduce you to the greatest show on earth\nOh it's beautiful, isn't it? I had it since birth\nAnd it feels so incredible when I'm puttin in work\nIt's like I'm headed for heights, I'm ready to fight\nThey said it be light, they said it be bright\nI said am I right, now what's the use of rockin my boat\nWell any way you rock it I'mma keep it afloat\nIt's like I fly in the ocean, I swim in the sky\nI'm live in a stereo, I'm so energized\nFor all of you guys, and all of you gals\nThis is what they sayin when they hearin them styles\n\n[Hook]\n\n[Verse Two]\nOff the head to head, born to dead\nArm Leg Leg Arm back to Head\nHmm, infrared, telescopic\nAudio'll transmit fiberoptics\nThe speed of sound, in full surround\nA full metal jacket with a new compound\nAmplified, deep and wide\nJump into your ride and lean to the side\nLo and behold I hit the Project Blowed road\nHeaded for the mountaintop, lookin for gold mode\nI sold the gold but never sold the form\nIt's hot it's cold it's warm throughout the storm\nFreakazoids, electric ladies\nRadioactive robotic babies\nFuel-injection and dual exhausts\nA cable antenna when the signal is lost\n\n[Hook]\n\n[Verse Three]\nAll up in your circuit breaker, doin my thing\nYo crank it to the maximum oh WHAT a machine\nMovin in slow-mo, not makin a fuss\nAll of a sudden when they push the button I get a rush I'm gone\nClimbin up the walls y'all, under your skin\nI know it's gonna happen but I'm wonderin when\nSo I pace myself, and brace myself\nJust in case myself, wanna try to get away from me\nMy main objective, remain effective\nFuse together rhythms that'll keep you connected\nMisdirected, disengaged\nDisinfected, a brand new page\nHit the corners and hug the curbs\nSmash on the gas that's all you heard\nCheck the monitors, heatin up thermometer\nLive wire kiss and you Twist like Oliver\n\n[Outro]\nWhat is that...\nThat's Acey/A.C. - Automatic Control\nWhat is that.. in the stereo\nAHHH! That's Acey/A.C. - Automatic Control", "title": "In Stereo", "album": "Love and Hate", "image": "https://images.genius.com/8aabb2266f1dc21cbed33421bd2b76e2.220x220x1.jpg", "year": null}], "artist": "Aceyalone"}