{"artist": "Bas", "songs": [{"lyrics": "[Verse 1]\nAy Ced\nMy nigga just roll one, let the storm settle\nFeel like a lightning storm and I'm on metal\nFeel like this life is a long walk thru nights to long coats with knives and nigga we all cattle\nCrabs in a bucket this is a small barrel\n.38 mag blast yo ass with a long barrel\nBoy meet the devil\nTell him come off you apparel\nFor that pearly white ice, your life is in peril\nThe needle ain't sterile\nThe wound is infected\nBroke as a joke\nSo the wounded neglected\nThis ain't a joke tho, it's foolish to mess with a man on the edge\nShit that's just a death wish\nYou in some shit now\nFloat in the septic\nPitch em your goals but the throw intercepted\nYour niggas is grimey\nYour ho is deceptive\nHighway to life and theres only one exit\nBut fuck it I veer off a road that is less followed  \nThe orchestra led and the guests followed\nThe trumpets blow leave your chest hollow\nViolins play your sins on the strings and it sing it go\n\n[Hook]\nWe want mula (mula)\nYea we want mula\nOh we want mula (mula)\nYea we want mula\n\nHmmm\nYea thats what the fiends want (and I'm a fiend)\nSaid thats what the fiends want (nigga)\nYea thats what the fiends want (and im a fiend)\nSaid thats what the fiends want (nigga)\n\n[Verse 2]\nHow come everywhere I go I see a liquor store?\nHow come that nigga a vet but yet that nigga broke?\nHow come a nigga gotta die for you remember me?\nHow come the middle of July feel like Decemeber?\nSee the summer time is killing season\nKiss my momma every day boy I'm barely breathing\nBunch of heathens round me rather see me under cement\nParanoia but this mook will keep me off the deep end\nSo much beef in these city streets\nI pray you go vegan\nWar torn from war stories man where do we begin\nNiggas is carbon dioxide just waitin to seep in\nWhile you sleepin leave your brain matter splattered and leaking\nFind a pastor a deacon, rabbi or imam\nTryna fly my way to heaven but this turbulence is strong\nMy momma taught me right\nMy city taught me wrong\nThey say I'm on my way\nI pray it won't be long\nNeed sunshine leave the city unwind\nShine so hard God the city leave son blind\nThe city is unkind\nThe city get no sleep\nI rummage her underworld\nThe city is so deep\nAnd it preach\n\n[Hook]\nWe want mula (mula)\nYea we want mula\nOh we want mula (mula)\nYea we want mula\n\nHmmm\nYea thats what the fiends want (and I'm a fiend)\nSaid thats what the fiends want (nigga)\nYea thats what the fiends want (and im a fiend)\nSaid thats what the fiends want (nigga)\nSMF\nSMF\n\n[Outro]\n\nI'm super mooooooooked\nI'm super mooooooooked\n\nFiend", "image": "https://images.genius.com/6f5338565e5f07aa4ee5c7f21ff0a167.500x500x1.jpg", "year": null, "title": "Mula", "album": null}]}