{"songs": [{"year": null, "album": null, "image": "https://images.rapgenius.com/b1ae565983ba30e773f194622fbadefc.1000x1000x1.jpg", "title": "Can’t Tell Me Nothing (Remix)", "lyrics": "[Intro: Kanye West]\nLa, la, la la\nWait 'til I get my money right\n\n[Verse 1: Lil Wayne]\nI got 'em, Young Carter\nOn the A-team if it's in alphabetical order\nUsed to daydream about Benzes and Porches\nAnd by 18, I had a Benz and a Porsche, ha!\nI'm so used to stuntin' on y'all\nSo tired of ballin', excuse me if I yawn\nHa! But I know what I'm doing\nOut the window of the jet, you see L.A. like a Bruin, ha\nNew coupe, foot to the floor\nWeather man make it rain, turn sugar to snow, you know\nHa! But watch how you speak\nCause in the street you can't trust every smile you meet, heh\nAnd you ain’t important as the new edition is\nRalph Tresvant, ooh, they so sensitive\nAnd it's the remix, baby!\nAnd I'm a knock it out like Felix, baby, haha\nGod damn I'm fly\nAnd my troop so cool, I don't have to lie\nHop in my car and go Kanye West\nWith my groovy new Louis Vuitton Damier vest\nHa! Yeah, let 'em hate though\nI'm on my way to the bank, LMAO (wassup?)\n\n[Hook: Kanye West]\nLa, la, la la\nWait 'til I get my money right\nLa, la, la la\nThen you can't tell me nothing, right?\nExcuse me, was you saying something?\nUh uh, you can't tell me nothing\nYou can't tell me nothing\nUh uh, you can't tell me nothing\n\n[Verse 2: Busta Rhymes]\nIt's one of the best to touch microphones\nThat'll spit the kind of shit to put the earth in a type of zone, like\nTo make 'em laugh or make 'em cry\nBring a life into existence or cause you to die\nNow when I was a shorty and when my mom called me precious\nI realized I'm outspoken and every word was infectious\nI'm sayin', Mommy said God'll bless us\nNo matter the difficulties or how much it would stress us\nI'm sayin', no matter how hard I try\nTo understand if I behave that I'll see God when I die, man\nThese words'll dawn on me, why?\nCause no one came back from death to say if it's truth or it's lies\nSee the point that I'm makin' is that she knew I was blessed\nAnd comin' to life as a legend, the man of best in the flesh\nI kiss my mother, countin' figures\nThinkin 'back on when I used to tell niggas, they sayin'\n\n[Hook]\n\n[Verse 3: Kanye West]\nYeah, homie this a theme song\nFirst I get my money right, then I get my team on\nIf I always pray to have gleam on\n$300 jeans on, do that mean I dream wrong?\nAnd I was high as a Learjet\nFly as the insect, even though we in debt\nAnd it don't matter if I get her number\nCause when I get my money right she gon' come running\nAnd I'll be good like \"God\" with an extra \"O\"\nGod knows that my check needs some extra 0's\nAnd you know that you need to bring some extra hoes\nNot in jogging pants either, tell them wear some sexy clothes\nNow my game so professional\nAnd my chain so fresh, they go (oh oh oh oh oh)\nRight after the fame did you gain anything?\nDamn Ye, would you change anything?\nBut (If I had a billion dollars)\nI'd cop more pink polos and pop those collars\nMisery love company, her nickname Sorrow\nMy Benz need company, her nickname Tahoe\n“Wait 'til  get my money,” everybody motto\nSo I'mma need a bravo for everything I wrote\nYeah, hey mama they can't hate him\nCause after all of the drama, K slayed 'em\n\n[Hook]"}], "artist": "Kanye West"}