{"songs": [{"image": "https://images.genius.com/26492136e5e9457b3426488e6702d9ad.1000x1000x1.jpg", "title": "Killa", "album": "Mailbox Money", "year": "2014-12-31", "lyrics": "[Chorus: Nipsey Hussle]\nMy AC on, my ceiling cracked, smoking killa\nLight my backwood, count 100 racks, smoking killa\nI pull up in that black on black, smoking killa\nMy AC on, my ceiling cracked, smoking killa\n\n[Verse 1: Nipsey Hussle]\nI wake up in this state of mind, like sky's the limit\nMy niggas said you crossed the line, well I'm gon' kill you\nI'm focused on a million cash, that's the vision\nSpeeding and I'm finna crash, that's the feeling\nUntil my tires burn, though, and my wheels give out\nThese backwoods burn slow, like my bills dish out\nWhen them people come for you, they gone steal yo house\nPut yo name on them papers, they gone fill you out\nCouple moves from yo quota, come fuck up yo count\nHave you thinking bounce back when you out\nLook, I'm tip-toeing over traps\nTight-roping at a height, you fall you knowing it's a wrap\nBut I'm gon' keep this balance, cause it ain't no turning back\nAin't no looking down, my niggas ain't concerned with that\nMore concerned with cash\nMore concerned with running laps, running rap\nGetting rich, then run it back\n\n[Chorus: Nipsey Hussle]\nMy AC on, my ceiling cracked, smoking killa\nLight my backwood, count 100 racks, smoking killa\nI pull up in that black on black, smoking killa\nMy AC on, my ceiling cracked, smoking killa\n\n[Verse 2: Nipsey Hussle]\nWhat's the deal, nigga? What's the deal, nigga?\nHow you feel? Now you know this shit is real, nigga\nOnce upon a time was in the field, nigga\nWar time, really kill or kill, nigga\nGunfire, shooting out civills, nigga\nYoung, wild, police gon' deal with you\nNot too many still living\nSo I gotta paint it real vivid\nI'm surprised that I'm here, nigga\nNaw, I'm blind to my fears, nigga\nI shine like De Beers, nigga\nAnd fly like a Lear, nigga\nClimb like the stairs, nigga\nSpend time out in Paris, nigga\nCome from where the grannies gotta bury niggas\nAnd money make these hoes wanna marry niggas\n\n[Chorus: Nipsey Hussle]\nMy AC on, my ceiling cracked, smoking killa\nLight my backwood, count 100 racks, smoking killa\nI pull up in that black on black, smoking killa\nMy AC on, my ceiling cracked, smoking killa\n\n[Verse 3: Nipsey Hussle]\nI think about them late nights\nDrive to Vegas across the state lines\nFinally did it, it just take time\nSince I was ye' high, my only goal was get this cake right\nAnd what they say, right\nYou on your own, it's what you make life\nYou was out there everyday, right?\nTryna push foreign, tryna eat steak, right?\nPut some hunnids in yo safe, right?\nHang some flat screens in yo place, right?\nLife insurance, just in case, right?\nGave something to the lawyer, just in case, right?\nSitting solo, first class, on a straight flight\nI remember waiting on my day like...\nEveryday I'm on this paper chase, like\nStand between these buildings 'til the daylight\nWiggle through the prisons and the grave sites\nThen you finally get it, and you take flight\n\n[Chorus: Nipsey Hussle]\nMy AC on, my ceiling cracked, smoking killa\nLight my backwood, count 100 racks, smoking killa\nI pull up in that black on black, smoking killa\nMy AC on, my ceiling cracked, smoking killa"}], "artist": "Nipsey Hussle"}