{"songs": [{"year": null, "image": "https://images.genius.com/283cd237d7c947223a80f65f3252599e.500x500x1.jpg", "title": "S.S.S (Split Society Syndrome)", "album": "Nehruvia", "lyrics": "[Verse 1]\nMe and my niggas on the corner, prepping niggas for coroners\nVerses dispersing, hurting and cursing\nAll of these foreigners, trying to war with us\nI keep restoring the, peace\nTrying to put the east back on\nThe map with rap and in fact\nWe never even slacked, theres plenty of hidden tracks\nWhere niggas spitting the facts instead of living the trap\nThey black, nobody hear\nLike infections in they ears\nIt's like they throwing a party but ain’t hardly any peers\nIn all of these years, my godliest fears have conquered\nI went bonkers trying to find a way to block haunters\nHeartless monsters running in packs like mobsters\nThey tommy clips parting lips. Believe or Doctors?\nNeed no roster, anyone can make it to the list\nThis society’ll kill you and act like you don’t exist\nIt's nothing, this sick crew don't walk around with fists\nBut if you diss sooner or later you gonna get hit like this\n\n[Hook]\nThey tell us to respect all the laws , they tell us all to listen to\nThe boss at what cost, the worlds still hectic. Nobodies protected\nOur own people fighting each other to see who’s “bestest” This worlds\nIgnorant, nobody thinks. They too busy blowing L’s and pouring a drink\nNo time to grind but still time to grind. When your friends say\nLets dip you leave in no time Quit lying\n\n[Verse 2]\nTrying to do right in this world but right isn’t enough\nWe all fight in this world we living but got it rough\nSo I gotta take a puff a Haze, to better my daze\nWe live in a maze , and getting cheddars one of the ways\nThat I could keep an eye out for people hating\nI doubt that it’ll change the way that they live\nThey still want two in my ribs cause im doing it big\nAnd all this envy causing frenzies\nCause I ain’t acting too friendly\nKnow that knowledge is plenty\nYou’d never die for a penny?\nNor would you dive for a penny\nDon’t say that dollars will win the world\nThe most you get is a girl who loves you cause of the pearls\nThat you put around her neck\nThe life You live is a wreck\nIts time to check yourself, or infect yourself\nAnd keep your wealth stealth and protect your health\nBecause this society’ll change entirely and it's strange\nBecause others gain as soon as your brains\nStrained as soon as pain is obtained"}], "artist": "Bishop Nehru"}