{"songs": [{"year": "2002-03-26", "album": "Exit", "image": "https://images.rapgenius.com/e8db6189b6a8f2951149b8b5e32e6b20.352x350x1.jpg", "title": "Freeze", "lyrics": "Yo, yo what the fuck, yo, yo\n\n[Chorus]\nIt goes stop, don't make a move, just freeze\nInstead of tellin' a lie, get down on your knees\nPlease, give up the mic to MC's\nMasters of the ceremony, is what we be\nIt goes stop, don't make a move, just freeze\nInstead of tellin' a lie, get down on your knees\nPlease, give up the mic to MC's\nMasters of the ceremony, is what we be\n\n[Verse 1]\nI was walkin' down the street about three o'clock\nWhen I saw another MC at the end of the block\nTalkin' to kids tellin' em, how they had to get the dough\nSo I rolled right up in the Cypher and said \"Yo!\"\nHere is an example of a whack MC\nCaught in the world and he just can't see\nHe said, \"What? Aiyyo, you disrespectin' me?\nNow I got to battle you and show them who the best be.\"\nHe started spittin', he said, \"Somethin' somethin' hot.\"\nThen he tried to talk about the money that he got\nI said, \"Shhh c'mon yo, that's all passé\nI got to break it down another way like this now\nFollow me here in this moment and time\nFollow the rhyme created instigated to see the crime\nYou commit, when you sit in the past. Don't you know?\nYou construct a future based on everything that you know\nBut to get to the unknown, we surely must erase\nAll the preconceived notions they keep throwin' up in our face\nOn the daily. I run over tracks like Donavan Bailey\nAnd break every record, in less than ten seconds.\"\nThey said, \"Oooooh! That's a real metaphysical\nWe pull down the light cause the force is centrifugal\"\nHe tried to act up I had to give in\nBecause the truth is an offense and not a sin, word life\n\n[Hook]\nIt goes stop, don't make a move, just freeze (You, you don't know)\nInstead of tellin' a lie, get down on your knees (So just freeze)\nPlease, give up the mic to MC's (Won't you please?)\nMasters of the ceremony, is what we be\nIt goes stop, don't make a move, just freeze (You, you don't know)\nInstead of tellin' a lie, get down on your knees (So just freeze)\nPlease, give up the mic to MC's (Won't you please?)\nMasters of the ceremony, is what we be\n\n[Verse 2]\nMC's ain't comin' equipped, with the rhyme\nDon't do the crime if you can't do the time\nThe time is essential when you play with the lives of the youth\nThey want the truth, but you want loot\nSo ya change a little bit switch up your steeds\nNow you got a bigger bag and countin' extra ki's\nPlease, everything you do we do with these\nReal MC's are universal entities, that\nScope the universe lookin' for the fraudulence\nThen we take a disguise like Clark Kent\nMy manner would have quick to check a scanner\nFor a weak MC sinkin' a city like Atlantis\nYou can't stand this, missile placed and you vanish\nI meditate delevitate the twelve planets\nYou cannot withstand the heavy verbal attack\nI'm the lyrical master blaster yeah I can do that\nI can also be your style, because I analyzed it\nYou used to rock, but now you paralyzed it\nDoesn't really matter like platinum blondes\nThink what is an MC if he can't drop bombs\nDon't really matter if it's over your head\nCause the job of resurrectin' is to wake up the dead\nSo pay attention it's the hard to behold\nThat everything that good it ain't gold, for real\n\n[Hook]\nIt goes stop, don't make a move, just freeze (You, you don't know)\nInstead of tellin' a lie, get down on your knees (So just freeze)\nPlease, give up the mic to MC's (Won't you please?)\nMasters of the ceremony, is what we be\nIt goes stop, don't make a move, just freeze (You, you don't know)\nInstead of tellin' a lie, get down on your knees (So just freeze)\nPlease, give up the mic to MC's (Won't you please?)\nMasters of the ceremony, is what we be\n\nIt goes stop, don't make a move, just freeze (You, you don't know)\nInstead of tellin' a lie, get down on your knees (So just freeze)\nPlease, give up the mic to MC's (Won't you please?)\nMasters of the ceremony, is what we be\nIt goes stop, don't make a move, just freeze (You, you don't know)\nInstead of tellin' a lie, get down on your knees (So just freeze)\nPlease, give up the mic to MC's (Won't you please?)\nMasters of the ceremony, is what we be"}], "artist": "​k-os"}