{"songs": [{"year": null, "album": "He’s Keith Murray", "image": "https://images.genius.com/7e796a2b47ce739fd258b02f553d744e.800x800x1.jpg", "title": "Oh My Goodness", "lyrics": "[Intro]\n(Yeah this the build up) OH NO!\nYou knew we was coming back\nBut you ain't know we was coming back like this\nC'mon, it's gon' be a problem ya'll\n(Yeah uh huh, Keith Murray, Def Jam, Def Squad)\nKeith Murray gon' make you go uh - uh uh uh\n(How it's gon' be)\nDef Squad gonna make you go ah - ooh ooh ah\n\n[Verse]\nI come on stomping mud holes in tracks like Timbaland\nThe producer and the booth, niggas so don't get cute\nI come through in the coupe with the chopped off roof\nHumiliate you then blast you in your birthday suit\nYou a small side order of apple cider\nI'm a three hot's in a cot dungeon rider\nMy hardcore street team crash the party with Def Jam\nAnd Incorporate +Murda+ like +Gotti+\nHow about in back of the yellow cab like Seinfeld\nChew you like little neck clams on half shells\nI got a hypochondriac flow that get real ill\nGet nautious to the beat, I spit sick at will\nAnd the time has come and your shit is sour\nYou need to turn your flow up an hour\nGive you a permanent lean, like the Pais Tower\nWith a hoes that will wet you down like a cold shower\n\n[Chorus]\nYo we got the shit on lock (uh huh)\nCome through and blast the spot (yeah man)\nAnd my name is the record, so check it, when I put it on record\nEverybody say oh my goodness!\nAnd my folks if you with me where you at? (yes sir)\nIf you love what I'm doing holla back (talk to me)\nAnd when I step on the scene, a lean mean wrecking machine\nEverybody scream oh my goodness!\n\n[Verse]\nAnd yeah I hear you talking motherfucker write the check\nAnd if you in the house then protect your neck\nI'm 'Mister See You Anywhere It's Gon' Be A Showdown'\nSo ya'll better have lyrics when I come 'round\nCause I ain't lost a battle since God knows when\nSome niggas tried to front but they gots no win\nTaught how to prevent to lose and handle the win\nLike birds are made to fly and fish made to swim\nWait a minute homie you don't really know me homie\nI'll take you to a picnic boy you lunch meat\nWith my dazzling appearance and my world wide clearance\nI am treacherous, inferio, impermanent, impetuous\nI rock like an archeologist\nDraw a picture like a forensic artist, perform like a dramatist\nI'm fabulously wicked, miraculous\nRustic, majestic, ridiculous, oh my goodness\n\n[Chorus]\n\n[Bridge]\nKeith Murray gon' make you go uh - uh uh uh\nDef Squad gon' make you go ah - ooh ooh ah\nOh my goodness!\nKeith Murray gon' make you go uh - uh uh uh\nDef Squad gon' make you go ah - ooh ooh ah\nOh my goodness!\n\n[Verse]\nAnd you in line motherfucker like them people in court\nSo when I see you I'm a pop your top like a cork\nI pack flow like ammo, spit like camels\nCome through and bless your whole crew like (achoo)\nBut some still wanna holla, pop they collar\nFucking with me like I run a funeral parlor\nLinguist lyricist out for +Chips+ like +Estrada+\nBilingual emcees even couldn't even couldn't do me nada\nWith this mic I'm handy, flows be dandy\nIt's a +Full Moon+ and hoes wanna fuck like +Brandy+\nYeah I've been hated on, you probably heard it\nAnd I kicked their little ass but them niggas deserved it\nAnd I'm still in the hood and I still rep the hood\nStill +Tee'ing Off+ for a +Long Green+ like +Tiger Woods+\nI ain't even gotta say it, ya'll know when it's hot\nSo ya'll go back up in the vocal box\n\n[Chorus]\n\n[Outro]\nUh - uh uh uh\nAh - ooh ooh ah\nOh my goodness!\nKeith Murray gon' make you go uh - uh uh uh\nDef Squad gon' make you go ah - ooh ooh ah\nOh my goodness!"}], "artist": "Keith Murray"}