{"artist": "B-Real", "songs": [{"album": "The Gunslinger Part II: Fist Full of Dollars", "title": "Lay U Flat", "lyrics": "[Intro: Samples and Proof]\nDon't any of you have the guts to pay for blood!\nI'm your huckleberry\nAlright, ah, ah\nIt's your boy Big Proof, haha!\nAah, ayo I don't care how y'all niggas wanna do this street shit\nNigga, you hear me?\nI'll put you out your misery.\n\n[Hook 1: Proof]\nOne on one, y'all ain't wit' it, gun for gun\nCome and get it, come and get it\nY'all can't walk in my shoe, dude\nI'm the only motherfucker that fit it\nOne on one, y'all ain't wit' it, gun for gun\nCome and get it, come and get it\nY'all can't walk in my shoe, dude\nI'm the only motherfucker that fit it\n\n[Verse 1: Proof]\nMotherfucker I was born on this earth half-baked\nYou gon' see the 9, nigga, like an hour past 8\nSee me in your front porch wit' that Jason mask\nDon't make me get up, bitch, and chase yo' ass\nSo know right now, gotta respect yo' ass\nMy temper 'bout as quick as a Tec can blast\n'Bout time PG came an' checked yo' ass\nThree bars later still don't respect yo' ass\nLook, motherfucker, I don't got' hear that noise\nTalkin 'bout how you deep in the streets, now where them boys?\nOut a motherfucker terrorist call me Taliban\nNiggas that see me on TV is televised\nHow do they feel 'bout being phoned up like telephone\nMayor of this city, thug, known as Ghetto Don\nP-R-O-O-F, without the fuckin' brat, I'm so-so deaf. (Don't play)\n\n[Hook 2: Proof]\nTell you once , I'll lay you flat\nYou probably know, I'll lay you flat\nShit, ain't you heard? I'll lay you flat\nNow beef for real, ain't no got a problem wit' that\nTell you once , I'll lay you flat\nYou probably know, I'll lay you flat\nShit, ain't you heard? I'll lay you flat\nBeef for real, ain't no got a problem wit' that\n\n[Verse 2: B-Real and Proof]\nHiggy, higgy, higgy\nAnd all you motherfuckers ain't thinkin' too clearly\nYou may not respect me, but you better fear me\nSteppin' outta pocket, bitch, I'll make you pay dearly\nPut you out of service and I won't treat you fairly\nYou goin' out permanent, not temporarily\nFuckin' wit' the Boogie Man, it's bound to get scary\nI'm a seer of the future, just call me visionary\nTake the stats on my crew, see it's legendary\nTop-notch niggas, livin' secondary\nDidn't wanna hurt ya but I think it's necessary\nCall six of your boys so they can help you be buried\nMe leaving you livin' happen so rarely\nAsk if you're alive all the people say barely\nHanging by your string equals livin' too daring\nHad to make him break off the chain he was wearing\nPut your face down on the ground, don't tempt me\nTo knock this whole clip off until it's empty\nYou talkin' really big but I know you pretending\nWe know you ain't shit through the message you sending\nUse your discretion, and I mean it sincerely\nYou betta' heed the warnin' and don't come near me\nMy weapons all thorough when paramilitary\nBe the unknown grave inside the cemetery. (Don't play)\n\n[Hook 2: Proof]\nTell you once , I'll lay you flat\nYou probably know, I'll lay you flat\nShit, ain't you heard? I'll lay you flat\nNow beef for real, ain't no got a problem wit' that\nTell you once , I'll lay you flat\nYou probably know, I'll lay you flat\nShit, ain't you heard? I'll lay you flat\nBeef for real, ain't no got a problem wit' that\n\n[Outro]\n*Laughing and gunshots*\n*Gunshot and laughing stops*\nI don't like that americano\nHe's too smart to be just a hired fighter\nBut shooting a pistol no one can touch. I can see that\nWhen someone with that face works with his gun you may count on two things: He's fast on the trigger, but he's also intelligent. That makes him too dangerous for you I think", "image": "https://images.genius.com/2540fc0584f5a1a9b61f7935d71b0ba9.494x494x1.png", "year": null}]}