{"artist": "Pharrell Williams", "songs": [{"album": "In My Mind", "title": "Can I Have It Like That", "image": "https://images.genius.com/1f7164404ffa194094a5c84f547f5254.599x524x1.jpg", "lyrics": "[Intro: Pharrell]\nLadies and Gentlemen\nYes, Sir... let's do it\nYes, Sir... hot... yo\n\n[Verse 1: Pharrell]\nOn and on and, my nuts I'm palmin'\nTake two of these and call me in the morning\nYou should see the way the chain harness the charm and\nFly, I'm like a bird like Nelly Furtado\nShit, pop your bottles, toast and scream, \"Cheers!\"\nGet your two-step 'cause this the record of the year\nNigga that brought you Ice Creams, two for a pair\nOfficially announcing, \"This is warfare,\" 'cause\nBack in the day, my clouds was grey\nAnd it seemed liked my angels couldn't blow them away\nBut then I sold my first verse and copped that NSX\nBut I was still ridin' in them thin-ass jets, but now\nMan, my vision so clear out the window of the Lear\nAnd I'm talkin' on my celly all the shit that you should hear\nListen clearly now\nHello? Can you hear me now?\n\n[Hook: Pharrell & Gwen Stefani]\nCan I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\nSo drop your purse and grab your hips (Uh huh)\nAnd act like you tryin' to get this money right quick\nSo can I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\n\n[Verse 2: Pharrell]\nOn and on and, this beat is on and\nI control their mind from straight over the phone\nAnd let 'em explore the words, something like a tourist\nAnd never get addicted unless that heady-wop is serious (Yes, Sir)\nFrom Louisville to Jimmy Choos, he's real\nShe know the time, she sees the Richard Mille\nPlat-double skeletal, Tourbillion\nIt's just like her body, move, it turns her on\nShe like the way my hands use her body for hand warmers\nAnd all our car doors go up like Transformers\nSee, I can do it this-a-way, I can do it that-a-way\nFrom the crib in Virginia to that new Miami getaway\nSo cool it like New Edition unless you hot as you say\nI get it, okay, let it boil away\nBut please run along, 'cause ladies is feelin' wrong\nAnd I got something right for them right after this song\nMy name is Skate... board... P\nLadies and gentlemen\n\n[Hook: Pharrell & Gwen Stefani]\nCan I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\nSo drop your purse and grab your hips (Uh huh)\nAnd act like you tryin' to get this money right quick\nSo can I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\n\n[Verse 3: Pharrell]\nOn and on and, the temperature is warm and\nI spit heat flashes, niggas get nauseous\nBright as a bitch, so analyze with caution\nWhen the light hit the ice, bet a hundred that you vomit\nAnd should I mention the fact the Transition is the track?\nNo incision to the vision just to get me where I’m at, huh\nLittle Skateboard, he too grown (Come on)\nRidin' up and down Collins in that that new Two-Tone\nIt's so cold, you don't wanna feel the chill of it (Uh)\nJust stand back and just look at the grill of it (Uh)\nI don't smoke but I bet the sense a mil' of it\nTotally intensifies the vivid-ass appeal of it\nYou can be jealous, and grit your teeth (Uh huh)\nBut all these little niggas got somethin' in reach\nSo, you want heat? These niggas can front heat\nWhile I'm on my boat party, tryin' to Sunseek\nMy name is Skate... board... P\nLadies and Gentlemen\n\n[Hook: Pharrell & Gwen Stefani]\nCan I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)\nSo drop your purse and grab your hips (Uh huh)\nAnd act like you tryin' to get this money right quick\nSo can I have it like that? (You got it like that)\nCan I have it like that? (You got it like that)", "year": "2005-10-31"}]}