{"songs": [{"album": "#SantanaWorld (+) (Deluxe)", "image": "https://images.genius.com/3f10bd74e888dd86855f5f659c72de1f.640x640x1.jpg", "year": "2017-12-14", "title": "The Race (Remix)", "lyrics": "[Intro: Tay-K & 21 Savage]\nI-I-I'm Lil Tay-K, I don't think you want no action (21, 21)\nYou want action, you get turned into past tense (Into past)\nYour boys deep? Well, let's get to subtractin'\nSmith & Wesson made my .9 with subcompaction (Skrrt)\n\n[Chorus: Tay-K]\nFuck-Fuck-Fuck a beat, I was tryna beat a case (Gang, gang)\nBut I ain't beat that case, bitch I did the race (Skrrt, skrrt)\nBeat it up, where I nut? Shorty face (Lil bitch)\nEli Blast crackin' fours like a vase (Gang)\nPop a nigga then I go out my way (Skrrt)\nDo the dash then I go out the way\nRob-Rob-Rob a nigga shoes, rob a nigga lace (Give me that shit)\nWe tryna see a hunnid bands in our face\n\n[Verse 1: 21 Savage]\nFuck a beat, I was tryna beat her face (21)\nPut it in your mouth, ahh, how it taste? (Lil bitch)\nBackend, nigga, that's a 100K (On God)\nFour shows, nigga, I can buy a Wraith (Skrrt, skrrt)\nMy street cred platinum, ain't nothin' fake (21)\nPulled up to the Slut Walk with a K (Bitch)\nYou a internet gangster, I'm a ape (21)\nYoung Savage, Zone 6, EA (On God)\nHundred round drum hangin' off the Drac' (Pew-pew-pew)\nInstagram Live got him killed broad day (On God)\nYou can have the pussy, I want the face (21)\nI ain't tryna cuff you, I don't want no case\n\n[Chorus: Tay-K, 21 Savage, & Together]\nFuck-Fuck-Fuck a beat, I was tryna beat a case\nBut I ain't beat that case, bitch I did the race (Skrrt, skrrt)\nBeat it up, where I nut? Shorty face (Yeah, I beat the case)\nEli Blast crackin' fours like a vase\nPop a nigga then I go out my way\nDo the dash then I go out the way\nRob-Rob-Rob a nigga shoes, rob a nigga lace (Give me that shit)\nWe tryna see a hunnid bands in our face\n\n[Verse 2: Tay-K]\nPimp gon' be eatin' good noodles every day (Free Pimp)\nBitch I'm drawin' doodles, Tay-K paint the way (You're a simp)\nChopper tear your dudies into fish fillet (Lil bitch)\nI-I-I woke up too moody, who gon' die today? (Skrrt)\nShoot a fuckboy in his motherfuckin' face\nWe cookin' up, boy, you don't wanna go dat way (Dat way, dat way)\nGotta go dat way, you get robbed for your rackades (Rackade, rackade)\nGotta go dat way, boy, you not gon' be happy\nI tote 50s, I'm a shooter like Young Pappy (Pew)\nBitch try to rob, we make her dance, Michael Jackson (Skrrt)\nWe was plottin', y'all was tryna get the pack in (Lil bitch)\nGet the pack in, you get robbed for a fraction (Give me that shit)\n\n[Chorus: Tay-K]\nFuck-Fuck-Fuck a beat, I was tryna beat a case (Gang, gang)\nBut I ain't beat that case, bitch I did the race (Skrrt, skrrt)\nBeat it up, where I nut? Shorty face (Lil bitch)\nEli Blast crackin' fours like a vase (Gang)\n\n[Verse 3: Young Nudy]\nYou want the drama? We got the drama\nFor you and your folks, them (Yo folks)\nWhole lotta guns, whole lotta choppers\nWhole lotta smoke for them (Whole lotta smoke for them)\nWhole lotta motherfuckin' yellow tape\nYou don't wanna smoke with them (You don't wanna smoke with them)\nThat's about me, young nigga from the streets\nStraight up PDE (Straight up)\nShoot a motherfucker straight up in the face, closed case\nNigga, ask 'bout me (Get shot at, nigga)\nNigga, I'm so gutta with it, I'm slimin'\nYoung nigga, I get with it (I get with it)\nI'm with the shits, is you with the shits?\nNigga, I don't think you with the shits (I don't think you with the shits)\nDo you got that stick? 'Cause I tote that stick\nNigga, that's some daily shit, yeah (That's some daily shit)\nI'll pitaroll a nigga if I got to (I'll pitaroll a nigga)\nNigga, don't make me pull this stick out, I might chop you (I might chop them, chop)\nNigga poppin' like some bitches (Bitches)\nGo across your head and nigga you ain't gon' need no stitches (You ain't gon' need stitches)\n\n[Chorus: Tay-K]\nFuck-Fuck-Fuck a beat, I was tryna beat a case (Gang, gang)\nBut I ain't beat that case, bitch I did the race (Skrrt, skrrt)\nBeat it up, where I nut? Shorty face (Lil bitch)\nEli Blast crackin' fours like a vase (Gang)\nPop a nigga then I go out my way (Skrrt)\nDo the dash then I go out the way\nRob-Rob-Rob a nigga shoes, rob a nigga lace (Give me that shit)\nWe tryna see a hunnid bands in our face"}], "artist": "Tay-K"}