{"songs": [{"year": "2012-04-10", "image": "https://images.genius.com/bdb1ca23b418b0572caba92910aaa741.600x600x1.jpg", "title": "The Man Who Would Be King", "album": "History Will Absolve Me", "lyrics": "Mogambo, the new world in motion picture entertainment\nMogambo, unforgettable adventure in untamed Africa\nAfrica, known for centuries as the white man's graveyard\nThe heat and fury of the jungle tears\nThe veneer of civilization from these women\nNo holds afar as they fall in love with a man who lives for adventure\n\nFacing existential threats, my advice, kill ‘em dead\nNo regrets, the devil’s rejects writ large\nObserve the precepts of a benevolent god\nBlue-eyed Prometheans in the heart of darkness.\nLand of the monsters. Walk like Quetzalcoatl amongst the conquered\nDick hard. Put myself in the stars\nThis woman in the dirt, face down, ass up, doing God’s work\nGo native, the world is yours. (It’s mine, it’s mine, it’s mine)\nThe sound of Maxim guns still sends a chill up my spine\nEmpire of the Sun never sets, a Christian’s duty is never done\nYou can bet on significant returns to all shareholders\nKing Solomon's mines, just give me a hundred experienced soldiers\nThe knowledge of good and evil, sweet nothings whispered by cobras\nUseless baubles given to greedy chiefs\nLies told with the practiced ease of an old thief\nWhen they hung the poor nigga, I felt a certain relief\n\n(No time for discretion...[yelling] I think I'm gonna run out of bullets before they run out of spears.)\n\nTake up your burden, the savage wars of peace;\nFill full the mouth of famine and bid the sickness cease;\nAnd when your goal is nearest, the end for others sought\nWatch sloth and heathen folly bring all your hopes to nought\n\nGold ill-gotten with guts and gleaming Martini-Henry Guns\nWith that holy trinity, who can argue my divinity under two red suns\nReturn like Kipling’s dead son, summoned by monkey paw\nA thousand Philistines slain with a donkey’s jaw\nGave them the rule of law, schools, roles, jobs, clothes and shod\nStill, they fled to the land of Nod\nEden’s East, upon his brow mark of the Beast\nEmpire fat like a cow slaughtered for the feast\nThe stink of a jackal’s teeth\nThe gears of war get greased, ground ‘em down to raw meat\nWhites of the eyes, limpet mines\nAn Apartheid of the mind, Brittania’s corpse exhumed\nHangnail still growing, Dr. Livingston I presume\nBlood river still flowing\nThe forest inexorably growing as Kinshasa crumbles\nThe dreams of Romans drowned out by Nyiragongo's rumble\n\nTake up your burden, the savage wars of peace;\nFill full the mouth of famine and bid the sickness cease;\nAnd when your goal is nearest, the end for others sought\nWatch sloth and heathen folly bring all your hopes to nought"}], "artist": "​billy woods"}