{"artist": "Cashisclay", "songs": [{"title": "Qualifikation [JBB 2013]", "album": "JBB 2013 - Qualifikationen", "year": "2013-03-31", "image": "https://images.genius.com/512ef1fe523bd2c83352dd7d45ddb5f6.1000x563x1.jpg", "lyrics": "[Part 1]\nQualifikation JBB Part 2\nWenn ich Battle, ist's ne einseitige Schlägerei\nUnd bei jeder Line wird dein Weib mega geil\nLädt mich ein und macht anschließend den Penis frei\nUnd warum sie dich betrügen will, das zeigt dieser Track\nDenn ich ficke dich und du hattest nie geileren Sex\nDu willst nur dass ich dich disse, weil dich keiner sonst erwähnt\nDoch forder' ich dich auf zu kontern, sagste: \"Nein, ist schon ok.\"\nJeder weiß Cro ist im ganzen Land angesagt\nIst das der Grund, dass du jetzt plötzlich Maske trägst? Chamela\nDu willst ein Battle, ich nehm' Pimmel in die Hand\nUnd deine Minderwertigkeitskomplexe hinter Arroganz verstecken\nPenner, was? Ich bin Vollblut Rapper\nDas was du Humor nennst, ist nicht mehr als Rollstuhl - Wetten das...?\n\"Gott existiert nicht, ich habe kein gewissen\"\nSchwör?! Und mach ein Hakenkreuz hinter dem Rücken\nVerschiebst dein Album und dann machst du jedes mal wieder Promo\nDu bist keine Legende, ANALyse ist nicht Detox, Homo\nEine Line puncht dich von Frankfurt bis Kamelistan\nDann fühlst du dich gefickt - Vagina von Diego Sun\nDie Augen sind geweitet - Vagina von Diego Sun\nFrag nach dem Turnier nochmal, wer die Klicks hier wem verdankt\nIch tauche auf mit einer Azzlack Armee\nFinale - Gasthook - Haft zum Befehl, choo\nDein Rap ist mehr so geht so, JBB - ich gewinne problemlos\nDu hast Stars? Ist mir egal\nUnd auch wahrscheinlich schon deinen Gewinner parat, denn pass auf, Alter\nScheinbar bestimmt Youtube mit aber Asien wurde zweiter - Julienshit\nGegenüber EmGi brachte 4Tune gute Klicks\nUnd jetzt zeig uns doch mal wer die Famehure ist\n\n[Hook]\nEy, zeig doch deinen Fans mal wer du bist\nUm maskiert zu sein braucht man keine Maske vor'm Gesicht\nDu hast ja so viel Ahnung, Alter denk an letztes Jahr\nAls Kayayin laut dir einer der besten war\nChamela und ein kleiner Junge lässt seinen Frust raus\nSpucks aus, aber dir geht langsam die Luft aus, ey\nEy weil er täglich weinend in sei'm Zimmer liegt\nZeigt er keinem das verletzte Kind hinter der Ironie\nUnd dich machen diese Depressionen krank\nRuf am besten bei der Seelsorge an\nIch mach mir Sorgen um dich\nDer Erfolg hat dich verändert, das weißt auch du\nAber ich brauche die Klicks, also scheiß drauf\n\n[Part 2]\nJulien, du hast ja überkrasse Reimketten\nSag mal, würdest du die für mich irgendwann mal Live rappen?\nBei deinem Stream warste nicht so im Takt\nWer hat bei Analyse noch gleich die Mische gemacht?\nDas ist Battleshit, du Pennerkind, ich check es nicht\nFür dich gings von \"man kennt dich\" und \"man feiert dich\"\nZu \"man findet dich lächerlich\"\nDu rappst jetzt und versuchst dich mit Musik zu etabliern\nAber wer, wenn nicht? Du solls objektiv analysier'n\nIch brauch die Kohle für 'ne Drogentherapie\nDenn ich versauf pro Woche mehr als du monatlich verdienst\nYüea, wat geht ab, Alter?\nIch geb ein' Fick auf deine Tracks voller Platzhalter\nBattleshit, ich ficke jeden dieser Hampelmänner\nAus deinem Turnier voller Conchesrapper\nBattlerap wird salonfähig, Hipsterhype\nSie wollen Mainstream? Spike findet Straße besser\nWegen Julien müssen Nutten wöchentlich im Kerker sitzen\nMit dir schlafen ist Erregung öffentlichen Ärgernisses\n4tune meint, du fickst nicht und kannst's nicht kaschier'n\nDenn deine Freundin ist wie Star Wars, die macht es mit mir\nAlso wer will noch komm' und erzähl'n, dass das wack ist?\nIch klatsche, drop dynamic und der Penner macht 'nen Backflip\nFaggots, technisch tight, scheiß auf den Rapshit\nIch geh lieber McFit ich find dünne Männer hässlich\nCashisclay das ist nur Promo für mich\nWeil ich 5 Silber auch ohne dich Drogenkid Kick\nIch geb's dir schwarz auf weiß so wie bei Seal und Heidi\nIch nehme keinen ernst, der im Live Stream 'ne Line zieht\nDie 6. Klässler Deutschlands fassen es nicht\nJeder Fan macht es nach, andr'e haste ja nicht\nWeit und breit keine Gegner zu seh'n, Blog-Battle King Clay, Realität\n\n[Hook]"}]}