{"artist": "Bas", "songs": [{"lyrics": "[Intro]\nI can't see love\nI can't see love lately\nI can't see love\nI can't see love lately\nI can't see love\nI can't see love lately\nI can't see love\nI can't see love lately\n\n[Verse 1]\nLately I got this feeling\nMy niggas is meant to get it\nIt's written up in the stars\nMade it from slimmer odds when only God was with us\nFuck it nigga we did it, been picking the game apart\nMy response for critics is spitting it from the heart\nAin't no frontin' involved\nThey feel it, I'm 'bout to make niggas fold\nSomething in the water got me floating like the work across the border\nGirl I wonder how we making it home?\nI'm no angel, I got an angle\nBack to the crib, bitch I'm tryna get you naked and bone\nShe's no angel, but with the blow she's a snow angel\nThe dangers of taking her home\nShe said, \"You caught my eye and my ears\nYou speak sincere, write precise\nCross your t's and dot your i's\nSee my fears and read my mind\nIf lawyers steal and doctors lie\nWhat's really left for you and I?\n(What's really left for you and I?)\"\nTrust, shit I don't know too much about it\nWe can take this leap of faith\n\n[Hook]\nBut I don't wanna feel the bottom, no\nI don't wanna feel the bottom, no\nGirl I don't wanna feel the bottom\nI don't wanna feel the bottom, no\nGirl I don't wanna feel the bottom\n\n[Verse 2]\nAnd I just called up my mama, she missing her son\nI've been pulling all-nighters and missing the sun\nI heard it gets addicted to some\nThe bigger the light, the quicker they come\nThey exit your life, just as quick as they come\nI'm numb to it like a brick to the gums\nI get to it, just as quick as it comes\nAs quick as it comes now\nI wish niggas wasn't so addicted to power\nI wish heaven had visiting hours\nI wish we could hit the Ave like we used to\nDime, nickel, 20 bag like we used to\nRide with my dawgs, moving cross the States\nDie by my word, that's an author's fate\nSo how your shoulders holding up fine, great?\nI got the weight of the world on mine, I'm straight\nNow pay your dues til your dues paid\nPlay your role til your role change, nigga rotate\n'Rari or Jaguar, switching forth lanes\nCall me for NASCAR, Bassy a track star\nGassin' the track like I'm running propane\nLapping these niggas and jealousy's a bitch\nMade it out the city, look around\nI brought all my niggas with me\nAnd I gotta thank God for the felonies we missed\nGotta thanks mom dukes, gotta thanks pops too\nThey say anything possible\nMy squad like apostles, believe in me\nDon't know how to quit, that's a fiend to me\nYeah, my niggas flood proof\nPray for the rain, gotta deal with mud too\nGotta deal with slugs who\nLay six feet, try to get above you\nMy niggas flood proof\nPray for the rain, gotta deal with mud too\nGotta deal with slugs who\nLay six feet, try to get above you\nThey love you\nAnd hug you, they sing your praises\nThey wear their faces backwards\nStill I see 'em acting\nJust the walking reenactment\nAin't nothin' real about 'em\nNiggas talk about us\nSpill they're heart up out us\nThey spill they're hearts\nBut what's her name again?\nWe talking 'bout lames again\nWon't pretend I'm entertained\nI'm staying sane\nI'm going through the changes\nI'm still the same\nEverybody feel you, don't feel your pain\nGo on, go on, still I, hold on to you\nGo on, go on, still I, hold on\n\n[Hook]\nCause I don't wanna feel the bottom, no\nI don't wanna feel the bottom\nSaid I don't wanna feel the bottom, no\nI don't wanna feel the bottom\n\n[Outro]\nI can't see love\nI can't see love lately", "image": "https://images.genius.com/e25804a8bf23b37fcf6a7fedf408b30e.1000x1000x1.jpg", "year": "2016-03-04", "title": "Penthouse", "album": "Too High to Riot"}]}