{"artist": "Canibus", "songs": [{"title": "2012 A.D (After Dizaster)", "album": null, "year": "2012-07-01", "image": "https://images.genius.com/ffdd25dae6a68f70cf8e2c5968cd9d78.480x360x1.jpg", "lyrics": "[Hook: Canibus]\n2012 A.D After Dizaster\nFlies buzz around a million rappers cadavers\n2012 A.D after Dizaster\nASCAP still sending checks to the master\n2012 A.D After Dizaster\nFlies buzz around a million rappers cadavers\nAsk caps still sending checks to the master\n\n[Verse 1: Canibus]\nThey want an explanation, they want a reason\nIt's all these goddamn demons\nCrawling creeping, bounty hunt emcees every weekend\nThrowing people off the deep end\nI can't beat them, I'm just glad to be breathing\nI stretch towards the ceiling\nShoulder getting better everyday I work it out, I smoke out\nThen I go say the verses with my mouth\nNumber one in Hip Hop and I ain't even mean it\nThe worst rapper alive? I don't agree with\nChoked up, so what? He was defeated\nBut if he's in that zone, he tear you to pieces\nStop talking like that, Canibus bark when I rap\nYou gotta factor all the facts\nI keep it relative so they can understand me\nI got a bunch of relatives in Miami\nMoney making Manny, big booty Brandy\nTom Clancy on a hundred footed yacht named Nancy\nYou seen Germaine's set? You ain't entertained yet?\nYou might wanna catch the main event\n\n[Hook: Canibus]\n2012 A.D After Dizaster\nFlyies buzz around a million rappers cadavers\nASCAP still sending checks to the master\n2012 A.D After Dizaster\nFlies buzz around a million rappers cadavers\nASCAP still sending checks to the master\n\n[Verse 2: Canibus]\n2012 AD yeah the summer season\nSome missed the meaning and some will receive it\nFew consumers purchase the music, some steal it\nSome really achieve success, some only dream it\nSome are conceited and greedy but don't wanna believe it\nThey point the finger at others to give themselves credence\nThey search for excuses to try to chop down your roots Bis\nThey try to make you buy back your freedom\nThe brightest beacon becomes stronger not weaken\nRip the Jacker's master thesis, love it or leave it\nThey make it sound like I never loved the rhythm of Rap\nI gave them music to listen to it with rhythm and tact\nFor Ten Thousand Bars Can-I-Bus should get a grammy\nFor Infinite composition theory and planning\nStatus quo antebellum Rap music never thanked me\nPlus I lost a battle, that's a double whammy\nYou ain't got no empathy than you ain't understanding me\nReal Hip Hop is channelled through me\nIt ain't no crime to not be the best\nWhen I was you acted like I wasn't so what you expect?\n\n[Hook: Canibus]\n2012 A.D After Dizaster\nFlies buzz around a million rappers cadavers\n2012 A.D after Dizaster\nASCAP still sending checks to the master\n2012 A.D After Dizaster\nFlies buzz around a million rappers cadavers\nASCAP still sending checks to the master\n\n[Verse 3: Canibus]\nThe holy angels are screaming, everything happens for a reason\nBut they don't wanna believe it\nHip Hop was everything to me, it's no secret\nThe ink that I write with, is the ink that I bleed with\nRetrospectively speaking the heart keeps pumping\nThe lungs keep breathing, everything happens for a reason\nI'ma always have something coming out\nInfinity is a very large amount\nI wrote it out and cried out to Jesus the dead got it easy\nThe living gotta pick up the pieces\nThe Lord saved me and show me the meaning\nOf what it feels like to be dissed and deleted\nNo grief period needed, my mission is completed\nThat's why I started the battle by praising Jesus\nI stood there in front of the world and took a dagger to the heart\nThen I launched 10,000 Bars\nCanibus career is over? It can't be\nIf only Hip Hop would stand with me\nI don't want your money I want your respect\nI paid my Hip Hop dues but can't cancel the debt\n\n[Hook: Canibus]\n2012 A.D After Dizaster\nFlies buzz around a million rappers cadavers\n2012 A.D after Dizaster\nASCAP still sending checks to the master"}]}