{"songs": [{"year": "2016-09-17", "album": "Too Much Too Soon", "image": "https://images.genius.com/1091d04cdf3371959e44d5abb6c40556.1000x1000x1.jpg", "title": "Sit Down", "lyrics": "[Intro: Kent Jones]\nGet up, get up\nWalked up in the building, seen too many bitches on the wall\nNiggas on the wall\n\n[Hook: Kent Jones]\nHey, baby, you there\nLight skin, thick with the blue hair\nRed 'Lenciagas, got a new pair\nEvery real hood bitch do hair\nHey, won't you come here?\nGet down, you know how I get down\nTell your hatin' home girls, sit down\nTake a seat, sit down\n\n[Post-Hook: Kent Jones]\nOh my God, oh my God\nI don't really know her huh? Know her huh?\nShe wanna come over huh? Over huh?\nI'm already over her, over her\n\n[Verse 1: Kent Jones]\nWhen I'm in town she make sure that she see me, you understand?\nI don't  know just how you niggas perceive me, you understand?\nThrowing stones but you just wanna be me, you understand?\nAin't them guys that you see on the TV, you understand?\n\n[Hook: Kent Jones]\nHey, baby, you there\nLight skin, thick with the blue hair\nRed 'Lenciagas, got a new pair\nEvery real hood bitch do hair\nHey, won't you come here?\nGet down, you know how I get down\nTell your hatin' home girls, sit down\nTake a seat, sit down\n\n[Verse 2: Ty Dolla Sign]\nHey lil mama, you know you fuckin' with a motherfuckin' superstar\nYou know I pick your ass up in the foreign car\nAnd fuck you right there in it like a porn star, yeah, yeah\nHey, why you so nasty?\nShe say \"Dolla why you gotta be so nasty?\"\nShe said \"Dolla $ign, why you always stay high\"\nI say, \"You ain't ever lied, you ain't ever lie\"\nI pull up on her, I got her choosin\nHer man a loser, she in a real nigga presence\nShe want Dolla, she fuck with Dolla\nShe came for Dolla, pull up in that 'Rari\nShe said \"Hey Dolla, Dolla, hey Dolla, Dolla\nWhy you spendin' all your money on these bottles?\"\nHey Dolla, Dolla, hey Dolla, Dolla\nNo more ratchets for me, only models\n\n[Hook: Kent Jones]\nHey, baby, you there\nLight skin, thick with the blue hair\nRed 'Lenciagas, got a new pair\nEvery real hood bitch do hair\nHey, won't you come here?\nGet down, you know how I get down\nTell your hatin' home girls, sit down\nTake a seat, sit down\n\n[Verse 3: Lil Dicky]\nOff top I was getting ready, white boy like my mom Betty\nI'm too nice for this game ese, I walked in, it was con-fetti\nGirls took to me already\nLil hoe with them dreads wanna go make whoopie\nGo ball Eddie, Heartbreaker, y'all all petty\nThese bitches wanna get it off the strength\nPay a ton, I'm jamming like I'm Kemp\nY'all all a bunch of fucking Detlef Schrempf's\nShowstopper, got flow poppin'\nThese hoes knockin' down doors\nJockin' my stones, moccasin flows\nStay on your toes\nI'm better than better\nI'll get it on top like a header, that's word\nLittle mama lookin' at me, nine o'clock\nAnd from the look of it that bitch need a vagina mop\nAnd you mistook if you think we that gon' designer shop\nI'ma pull up like a bull up in the china shop, break you down\nChicken parmesan, how you want it, I'm cookin'\nI got a nose for these hoes, I'm the Piglet of pussy\nI gotta know if you pro, going down on my tooshie\nCause if you are then you're probably too aggressive for Dicky\n\n[Verse 4: E-40]\nWhen I was a teen I scored a half a meal ticket\nMy team moved mean and they'll smoke you like a brisket\nRaised in the slums, in the sewer, in the gutter\nWhere shit ain't sweet like unsalted butter\nMake more paper than your daddy and your mother\nPulled up European, started with a fixer-upper\nThrowing up signs like a third base coach\nBaby she a dime, got a rump like a roast\n\n[Hook: Kent Jones]\nHey, baby, you there\nLight skin, thick with the blue hair\nRed 'Lenciagas, got a new pair\nEvery real hood bitch do hair\nHey, won't you come here?\nGet down, you know how I get down\nTell your hatin' home girls, sit down\nTake a seat, sit down\nSit down, take a seat, sit down\nSit down, take a seat, sit down\nSit down, take a seat, sit down\nSit down, take a seat, sit down\nSit down, take a seat, sit down"}], "artist": "Kent Jones"}