{"songs": [{"image": "https://images.genius.com/857a416f44825b13b2e0155587142ae2.600x600x1.jpg", "year": "2002-10-01", "title": "Heart of Man", "album": "Man vs Machine", "lyrics": "[Xzibit]\nAin't a damn thing promised to ya\nExcept livin your life, and dyin one day, I'm just bein honest to ya\nIt take a whole lot, just to get a little\nGettin caught up in the middle the answer to life's riddles\nNever, come that easy, but it was easy\nTo lead me, but it wasn't easy to see me\nGet up off the block to the TV\nAnd sell a couple million CD's, best believe me\nYou see these callouses on my soul?\nCouldn't let hate and paralysis, take control\nI pick you up when you down 'til I can't no mo'\nMy name sting in your mouth like canker sores\nBeen at war my whole life, sleepless nights\nEndless fights, but still can't walk to the light\nCause my work ain't finished on earth, for what it's worth\nFrom the cradle to the hearse, God and family first, for real\n\n[Hook: singer]\nSomewhere in the heart of man (somewhere, within, somewhere)\nThere comes a time when he must understand (when he must understand)\nThe strong withstand, the weak will fall {*repeat*}\nCause tomorrow may not come at all {*repeat*}\n\n[Xzibit]\nLife ain't long, it's more like a snapshot\nYou can have the top, I live for the hop\nNever take a day I'm breathin on this planet for granted\nTime for change, time for growth, peace understandin\nSee but niggas keep forcin my hand, disturbin my plans\nBringin out the soldier in a peaceful man\nIt's like tryin to build a house on sand; you never get\nA solid foundation, one man can change the nation\nYo I put that on all creation; Haitian, Jamaican\nAfrican, Asian, Caucausian, Indian\nWhatever your persuasion, this is the message\nTime is of essence especially when you're countin your blessings\nLessons learned from the deepest of pain, it's not a game\nKeep my name outta your mouth and I'mma keep it the same, ya dig?\nIt's a shame, graduated to the rap game\nOnly to find out crack and rap was the same thang, damn!!\n\n[Hook]\n\n[Xzibit]\nWho got skill? Who got hustle?\nWho got they family with 'em? Who pay for they muscle?\nYo it's all gon' come out in the wash, the lost angel\nWith dirty wings, bullets ricochet off my halo\nI lay low for no one, I love my life\nAin't afraid of no hard work and sacrifice\nWas born twice through the life of my seed\nMakin sure he see a side of life, I was never able to see\nHittin home like \"Ground Zero,\" move over now\nPeace to the real heroes, still underground\nI put it down for the homies that came that's hard in the paint\nI'm livin proof it's never to late, you straight\nOnce in a while I go back to the main strip\nAnd see the same niggas still doin the same shit\nAnd all I can do is increase the flow\nPut it out, let it soak in, and hope they grow, c'mon\n\n[Hook] - repeat 2X"}], "artist": "Xzibit"}