{"artist": "Yukmouth", "songs": [{"album": "Thug Lord: The New Testament", "image": "https://images.genius.com/35680e47bf5602cb32bedf4290f16072.600x600x1.jpg", "year": null, "lyrics": "[Nate Dogg]\nEverytime I smoke\nI smoke indo smoke\nIt happens every time I drink\nSomebody better call my shrink\nI'll beat it 'til the pussy's weak\nSome niggas don't sleep man I don't blink\nSometimes I think I over-think\nSometimes I feel like, somebody's watchin me\n\n[Chorus]\nYou motherfuckers can't figure it\nWhy niggas so ignorant, ignorant\nYou motherfuckers can't figure it\nWhy niggas so ignorant, ignorant\nWe drink beer and smoke cigarettes\nCause we niggas so ignorant, ignorant\nWe bang bang cause we ignorant\nMotherfuckers can't figure it, figure it\n\n[Kokane]\nI'm the epitome of this rap game\nThe most controversial name, they call me Kokane\nI'm so ignorant, black ladies be hidin they purse with white ladies\nFifty niggas in a Navigator, and a Range Rover\nBlowin bomb sticky doja\nLookin at these studio gangsters gettin over\nIt's Yuk and Kokane and Nate Dogg, we stay true\nSnatch yo wack ass off stage - we all gonna laugh at you\nAh, I wear the same khakis for about four days\nAnd I, I don't brush my teeth, cause I got tooth decay\nI keep the door open when I shit\nAnd if I'm fucked up sometimes, I forget to flush it EWWW\nFuck respectin my elders, they ain't gon' get it soft\nCut in front of a 80 year old lady, and flip her ass off\nI taught my 13 year old son how to slang\nPCR, Dogghouse when I bang, and I'm out, nigga\n\n[Chorus]\n\n[Yukmouth]\nWhat?  Nigga, ery'thang, ery'thang..\nMotherfuckers get sprayed fuckin wit Yuk, Kokane and Nate\nSince back in the day, been slangin crack nay, packin a gauge\nDiamond taps on our braids, pack a case, stack it away\nY'all niggas perform overseas then back to the states\nWhen subtractions are made, thug money the blueprint\n+Regime Killers+, my click too sick, we rule shit\nAnd to spit at a few clicks, rob motherfuckers who move bricks\nPop motherfuckers wit loose lips\nBitches who snitch out's finna get hit, get put in a ditch\nYukmouth runnin, livin this shit\n\"Ice Cream Man,\" I invented this shit\nAin't no gimmicks to this, my shit is rugged and hardcore\nGive Killa Cali niggas what they starve for\nBring y'all war like, \"What's the issue?\"\nI shoot up everybody, even an ugly fat bitch too\nIf I get you (?) (?) another shit on you ridiculous\nGive that nigga some tissue, let that bitch know, I'm ig'nant\n\n[Chorus]\n\n[Kurupt]\nAre you real motherfuckers, for real motherfucker?\nWell I ain't real, I'm ultramagnetic bitch\nI'm somethin you don't wanna fuck wit\nI'm the nigga wit the pistol, launchin six from the clip\nI'ma eclipse the moon like pitch black nigga\nNate, Yuk, Kokane, Kurupt we back nigga\nYak in a 'llac nigga, Young ready to collapse lungs\nTwo shots make slums collapse niggas\nSee me face to face, talk that shit\nPretend you on the +moon+ Michael +walk+ that shit\nWhat up pretty mama, a.k. pretty bitch\nThis Kurupt, I know you fucks to get rich\nI met many bitches, in my day\nGot the homies on the left side, holdin the 'K\nKurupt, the analytical, phenonomal, the most anticipated\nHighly hated, top graded\nIg'nant than a motherfucker, I don't give a fuck\n\n[Chorus]", "title": "So Ignorant"}]}