{"songs": [{"title": "Got Me On It", "lyrics": "[Intro]\nI don't know\nMaybe it's cause there's a bunch of fake ass niggas out here\nFake ass rappers\nAin't too many real niggas left\nJust trying to figure it out\nSomething's got me on it out here\nLet go\n\n[Hook]\nDon't know if it's the murders, the robberies, the beef, the trap\nThe hood, the straps, don't know\nBut something's got me on it\nI'm on it, I'm on it\nSomething's got me on it\nI'm on it, I'm on it\n\nDon't know if it's the pills, the weed, the coke, the lean\nThe way I'm yellow taping off the scene\nBut something's got me on it\nI'm on it, I'm on it\nSomething's got me on it\nI'm on it, I'm on it\n\n[Verse 1]\nOk, Ok, I'm back, I'm serving, I'm leaning, I'm swerving\nI'm strapped, for certain\nThese young niggas is hurtin'\nOn bond, I'm lurkin', I'm killin', I'm murkin'\nI'm shootin', I'm workin', I'm only one person\nNo tags, blue rags, you mad and I'm glad\nGot a chrome .44 mag\nPut niggas in body bags\nA-1 Yola, no soda, no oil base just over\nI'm a soldier, I told ya, I put Cashville on my shoulders\nNigga fuck me? Fuck you! Fuck him and fuck her too!\nFuck that I want something new, top down, no sunroof\nHundred pounds I run through, I'm running around like my son do\nNever say how she done you, I kick a bitch out, kung fu\nTold ya'll, I'm a come through, no religion, just truth\nThirty chickens, front you, better not give me no ones dude\nStill pimping, know I'm one, all the mirrors on our arms\nCountry nigga, livin' in a barn\nGrowing kush on a farm\n\n[Hook]\nDon't know if the plug, the powder, the money, the power\nThe way that half of these rap niggas cowards\nBut something's got me on it\nI'm on it, I'm on it\nSomething's got me on it\nI'm on it, I'm on it\n\nDon't know if it's the jail, the pen, the Rose, the Hen\nThe way that I'm back on my buck shit again\nBut something's got me on it\nI'm on it, I'm on it\nSomething's got me on it\nI'm on it, I'm on it\n\n[Verse 2]\nI'm cooking, I'm watching, I'm looking, I'm shopping\nI'm tired of all the people asking me when am I dropping\nI'm rolling, I'm rocking, I'm moving, not stopping\nI'm loading up my chopper out here bout to get it poppin'\nYou flexin', I'm stressin', and I still ain't learned my lesson\nI'm counting up all my blessings, and I'm putting them all in investments\nAnd these hoes ain't shit, but they on my dick\nI just started, you quit, I'm real, you a bitch\nI'm hell, no scale, I got eight balls for sale\nAnd I hate ya'll to tell, I pray ya'll get killed\nI'm an outlaw, without ya'll, Mayweather, south paw\nRing a bell, sound off, I smell pussy, hound dog\nCourt cases, probation, one god, one nation\nNerves bad, no patience, selling dope is my occupation\nFuck a rapper, fuck a label, I'm in the trap with no cable\nAnd I want your seat if you ain't gonna bring nothing to the table\n\n[Hook]\nDont' know if the the Lord, the devil, the bricks, the pebbles\nThe way these niggas can't get on my level\nBut something's got me on it\nI'm on it, I'm on it\nSomething's got me on it\nI'm on it, I'm on it\nI just don't know!\nI'm on it, I'm on it, I'm on it!\n\nDon't know if it's the love, the hate, the pieces, the weight\nThe way they say the real but they fake\nBut something's got me on it\nI'm on it, I'm on it\nSomething's got me on it\nI'm on it, I'm on it\n\n[Outro]\nOk, Ok, Ok, real talk\nYou know there's more black people in the penitentiary than anything\nWe kill about this money\nAin't one black president on that shit\nI'm just being real, you should be real too\nCashville records nigga\nThis rap shit is mine\nBitch niggas: your time is up! It's Buck\nHolla when you see me nigga\nBut make sure you say the right shit\nHa ha", "album": null, "year": null, "image": "https://images.genius.com/787eb0fed4a05aa802dee3238c64431a.792x792x1.jpg"}], "artist": "Young Buck"}