{"songs": [{"year": null, "album": "Fire and Glory", "image": "https://images.genius.com/dd8fc4f20fab691cb0bc8e71f35767a4.300x300x1.jpg", "title": "Kaysarasara", "lyrics": "[Intro: Estelle]\nSome men were born to be heroes\nBet everything comin' up with zeroes\nSome think they God - but you know how that goes\nQue sera sera\n\n[Kardinal Offishall]\n(Yeah, uh huh, Jake you stupid for this one son, y'know)\nAiyyo, actions speak louder than words\nMy middle finger speaks louder than yours\nI'm in the hood, feet poundin' the curb\nJealous of nothin' - mine is bigger than yours\nStandin' still, y'all runnin' with herbs\nI stole the soul motherfucker, I ain't bringin' it back\nWhack niggas like Jamsport, holdin' me back\nAnd I don't care if you're friends with Jay\nOr Dre, or Kay Slay, you're still garbage\nLearn to parlay, before you look this way\nI'm heinous with mine, Kardinal made this\nI don't pay to get on any playlist\nNiggas in the street was waitin' for someone to say this\nI ain't suckin' dick for y'all DJ's to play this (let 'em know)\nMy records spin like rims on an Avis\nLook at me wrong, and say what's up to Sammy Davis\nI'm heavy nigga, the biggest libra couldn't weigh this\nBefore you kiss your TV, you should kiss my whole anus\n\n[Hook: Estelle]\nSome men were born to be heroes\nBet everything comin' up with zeroes\nSome think they God - but you know how that goes\nQue sera sera\n\nSome men still drivin' in the highway\nDo you - just do it out of my way\nAt all costs I'm doin' it the fly way\nSo I never say que sera sera\n\n[Kardinal Offishall]\nI got the most superior mainframe in the game\nFlows like a fifty-paper, ain't a damn thing changed\nOn the mic I'm deranged, off the mic I'm just crazy\nSpit-shine my letter combos - that's what pays me\nIn other words it's the nouns and the verbs\nThat buys the X5's and the cribs on the lakesides\nI run this shit, I don't take sides\nWhat you see is what you get - most of these rappers are in disguise\nWith no persona, so they diss guys\nYou want to lose your profession? I suggest you test this guy\nThe best buy in any Best Buy\nI'll straight burn the place down like a throwback Left Eye\nAhead of the class - nobody ever left I\nI'm so right, I can't even open my left eye\nYou're dead wrong, tryin' to correct I\nI'm like the dead in one way: no choice but to respect I, yeah!\n\n[Hook: Estelle]\n\n[Kardinal Offishall]\nYo, everything I do is strong when I rap\nI don't bust no verses, I talk in thunder claps\nGive black hands daps, and X marks the map\nDot city on my chest, show the world where I'm at\nLift you higher than a three hundred dollar weed pack\nAnd a G4 smuggled in my jacket in the back\nYeah, some question my heart and dedication\nWhy? I'm into the pulse like a palpitation\nSome man dem dat I know hold down the +Big Macs+\nAnd they come and watch you air the beef out (Blak, blak)\nThat ain't me though, I'm regal like a pharaoh and them\nLeave the squabbles to the kids, I bring dollars by the pen, y'know\n\n[Hook: Estelle - 2X]\n\n[Kardinal Offishall]\nIt's Estelle, let 'em know!\nBlack Jays!"}], "artist": "Kardinal Offishall"}