{"artist": "Andre Nickatina", "songs": [{"title": "Ike Turner", "album": "I Hate You With a Passion", "year": "1995-04-19", "image": "https://images.genius.com/caf6d8331e5ef8bd79cb75fa64fb6144.1000x1000x1.jpg", "lyrics": "(Juss woke up, head hurt...)\n(Coughing)\n\nSorry Ike, I was only tryin to help you\nYou? Tryin to help Ike?\n\n(Mac 10)\nSnatchin the bitches in the headlock\nIt's that nigga the M-A-C-1-0 and Dre Dog straight doggin\nPunk bitches we be hoggin\nIt's me that nigga that post in the corner with a dunce hat\nBut fuck that\nThese hoes got a nigga on skitzo so Dre Dog, get way back\nAnd I be, that nigga I-K-E, and we know who you gonna play\nSo sit back and be O.J\nFor now, we gonna plot and premeditate this murder\nI heard a nigga say that you can't fuck with Ike Turner\nSo I'm gonna be that nigga who put these hoes out\nBlacked out, locced out\nReady to go all out\nAnd rip a heffa's grill out\nSo spill out your brains bitch, all over the carpet\nI was in the market, you got caught as a target\nNow fuckin mine you see the eye of me and you say gansta\nGangsta, that's what they be yellin for me\nThat nigga I-K-E nigga aka murder\nThat nigga Ike Turner\n\nSorry Ike, I was only tryin to help you\nYou? Tryin to help Ike?\nSorry Ike, I was only tryin to help you\nYou? Tryin to help Ike?\n\n(Mac 10)\nStirrin, yeah I'm gonna stir this shit like coffee\nYou hoes that wanna be bossy can't ball Mac cause I will off the\nLike skill kill blood will be runnin off the table\nThe black bald headed captain's back so now you got to prey for\nYour life as you look into the face of M-A-C\nBut you don't see me you juss see the M-I-R-A-G-E of me\nAnd my ax as I crizack your back\nFor fuckin with the Mac, you dirty ass rat\nSee, I could be a good guy\nI'd rather be a bad guy, and look deep in your izeye\nBefore I see you dizeye\nYou can fetch a dolla, I love when I hear hoes holla\nAnd they choke, from my hands around they collar\nThe Graveyard is back and, I'm in all black and\nMy eyes all bloodshot, cause death got me locked\nSo, I'm ready to snap and, Dre can't hold me back and\nCause I'm too far gone nigga too far gone\nMy baby mama hates me, I choked her till she couldn't breath\nAnd tightened up, until I seen her nose bleed\nI told you on Dre's album choke em until they color switch\nJuss call me (cleana man, love to see your body twitch\nI'm a crazy lunatic man, a murder man\nBut you can juss call me Mac 10\nSo don't cross me cause you will be offed G\nDre and Mac 10 nigga gone out the dark\n\n(Andre Nickatina)\nI be that nigga that be the mothafucka here\nThe mothafucka there\nKnock a Tina out and have her sleepin like a bear\nIn the winter, you lookin for the dragon then enter\nI'm warning ya, slapping you like President Abaloneya\nSo now, this indo got me snappin like an alligator\nTake her up and down like a mothafuckin elevator\nServe em, I gotta get the mothafuckin money (right)\nThen hit em with the force of a car crash dummy\nThese hoes will have a muthafuckas heart on cold\nStoppin mothafuckas like 4th and goal\nAnd on 4th and goal, I'm legit for the blitz\nBut I'm gonna set up in the middle for an LT hit like bam\nBitch you think I give a God damm?\nBreakin backboards on NBA Jams\nYou little heffa, I'm breathin down your mothafuckin neck\nWith reactions like a black hero Vietnam vet\nUpset, like you lost a fuckin million dollar check\nTo a heffa who's name was tattooed on his neck"}]}