{"songs": [{"album": "Kingdom People", "image": "https://images.genius.com/88613def626e58194d33cae2db4c5764.600x600x1.jpg", "year": "2006-10-03", "title": "He Cares", "lyrics": "Man... I know it gets hard sometimes\nAnd to be honest this life doesn't seem that fair at times\nBut I understand that we serve a great God who's sovereign\nHe's got everything in control and, even though it looks dim man, trust in Him\n\nWe grew up on the same block, handling the same rock\nThe Skip to My Lou, my little crew on the black top\nMy big homey (incomprehensible), always dying for me\nOlder, so I looked up to him dawg he was like family\n\nThe coolest of the cool, and, almost through his school but\nDuring the last week he got broken off with the heat\nNow he's gone and his kids are left alone\nIt's got me peeping Solomon for more than just his Song (ecclessiastes?\n\nI wish i could turn back the hands of time\nFor all the people who lost a loved one and felt like they was gone before they time\nBut instead I'll encourage us to put our trust in Jesus\nAnd know that God is sovereign it all happens for a reason\n\nKeep your eyes to the hills and believe that help is on the way\nAlthough the sky is black, He promises a brighter day\nWeeping man, endure for a night\nI know its hard to wait patiently, so I pray He strengthens you in the wait\n\nWhen you feel all alone\nWhen your father's not at home\nWhen your joy turns to gray\nYou can turn and call on Jesus name\n\nCast your burdens on the Lord\nWhen life seems too hard\nHe won't allow you to be moved\nAnd I know He will sustain you\n\nThere's so much pain the city streets, check the city peeps\nWe're in perilous times which means that pain is sure to increase\nSo I, do this ballad for the beautiful babies gone now\nAnd for the families who too afraid to leave home now\n\nLike the family in Chicago who's daughter was ten\nAnd at a birthday party, she was taken from them\nI write this song for my neighbors on this side of my state\nWho had lives, but watched Katrina wash it away\n\nPlus, I know the pain of a life without your father\nEven have the chance to meet him but you think why even bother\nBecause you don't really miss nothing you never really had\nBut that thinking leaves you lonely, still longin' for your dad\n\nMan, if we would only take the truth of text\nRead lamentations 3:32 for the rest\nAnd see the truth that the Father loves us\nEven though He brings calamity, He gives us compassion like hugstaz\n\nWhen you feel all alone\nWhen your father's not at home\nWhen your joy turns to gray\nYou can turn and call on Jesus name\n\nWe live in a world, and when it rains and pours - I know it does man\nAnd when bad things happen to good people in this world man\nWhen the poor get poorer and the richer have the upper hand\nWhere pain is related to actions, so no one moves and\n\nIt's hard for us to understand the ways of life\nTake my cousin last year for example when she lost her life\nTo a drunk diver, now she was sweeter than Godiva\nThey said she died on impact and this dude was the survivor\n\nI recognize, that life brings pain that will cease for a time\nAnd then it returns but we long for a consistent peace of mind (Lord)\nSo I present Jesus for those who feel burdened\nThe same God who allows evil, steps sin and gets spurned for it\n\nAmbassador said one day we will cry no more\nBut in the meantime go and cast your cares on the Lord!\n'Cause he cares for you, psalms 55 and 22 (psalm 55:22)\nGives us the proof that this God will see you through\n\nWhen you feel all alone\nWhen your father's not at home\nWhen your joy turns to gray\nYou can turn and call on Jesus name\n\nAmen. He cares man. Even when it seems dark, He cares. The Father loves us. He cares for us man. Please believe me, He loves you"}], "artist": "Tedashii"}