{"songs": [{"image": "https://images.genius.com/cbadcbce5d791b1143f766fff7666680.1000x563x1.jpg", "album": null, "title": "Don’t Do That No More", "lyrics": "[Intro: Dae Dae]\nI use to trap like my daddy\nTrap out the trenches, the trenches\nI use to trap down on Erwin, Its just some shit that I ain't finish\nMake it seem like I know yo jeweler, Yo diamonds ain't real you got to prove it\nShowing out for my momma my childrens\nI told that lil bitch you bet not even do that no more\n\n[Chorus](2x)\nYou bet not do that no more (3x)\nThese bitches all in they feelings (feelings)\nLil bitch I'm hot in the city, you better thank god I remember you\nCause' I don't remember faces baby\n\n[Verse 1: Dae Dae]\nWhy the fuck you in my section?\nWhat the fuck bitch I'm your blessing\nI had to learn all my lessons\nI built this shit fuck I'm sharing for?\nBitch I'm the man what I'm paying for?\nI bought this spot with the landlord\nI fucked the bitch I ain't pay her nothing\nI put that dick on the rampage, Trick on that bitch like I'm RayJ\nI Called your phone you was too late (too late)\nI fell in love with a basic bitch, Now the tables are turned\nI ain't gone do that no more (4x)\nThese bitches all in they feelings (feelings)\nLil bitch I'm hot in the city, you better thank god I remember you\nCause' I don't remember faces baby\n\n\n[Chorus]\nYou bet not do that no more (4x)\nThese bitches all in they feelings (feelings)\nLil bitch I'm hot in the city, you better thank god I remember you\nCause' I don't remember faces baby\n\n[Verse 2: Dae Dae]\nI don't remember you (I don't)\nI just be killing shows\nI get them J's by the two (I do), for me and my ole' lady(turn up)\nBitch don't embarrass me(don't do that), act like you got some sense (bitch)\nDon't let them laugh at me (don't do that), I gotta protect my image\nThey gotta reduce these citizens\nI gotta let loose on a pussy nigga, I gotta sing baby been a minute\nThis is my dream baby I'm living it\n(living my dreams) (3x)\n\n[Outro: Dae Dae]\nI love my momma, my daddy kicked out me and my brother\nMy momma was going through the struggle, that nigga was putting his hands on my momma\n(What you tell him)\n\n[Chorus](2x)\nYou bet not do that no more(4x)\nThese bitches all in they feelings (feelings)\nLil bitch I'm hot in the city, you better thank god I remember you\nCause' I don't remember faces baby\nYou bet not do that no more(8x)", "year": "2016-08-01"}], "artist": "Dae Dae"}