{"artist": "Apache", "songs": [{"title": "Gangsta bitch - original version", "image": "https://images.genius.com/bfbe4501b063fec9c167a4c9b139ba48.730x711x1.jpg", "album": null, "lyrics": "[Chorus: Apache]\nI need a gangsta bitch (a gangsta bitch)\nI want a gangsta bitch yo (a gangsta bitch)\n\n[Chorus: Apache]\nI need a gangsta bitch (a gangsta bitch)\nI want a gangsta bitch yo (a gangsta bitch)\nI wanna \"Gangsta boogie!\" with my (gangsta bitch)\nI want a (gangsta bitch) I need a (gangsta bitch)\nI need a gangsta bitch (a gangsta bitch)\nI want a gangsta bitch yo (a gangsta bitch)\nI wanna \"Gangsta boogie!\" with my (gangsta bitch)\nI need a (gangsta bitch) I want a (gangsta bitch)\n\n[Verse One]\nYo, I need a gangsta bitch; she don't sleep and she don't play\nStickin up girls from around the fuckin way\nStrapped but lovable, hateful but huggable\nAlways in trouble and definitely fuckable\nSee her now, booms and pounds, she's mine friend\nPuffin on a blunt, sippin on a Heineken\nShe's got charm, a firearm to match mine\nGoin to the movies packin his and her nine's\nWearin Carhart and leather, motherfuck the weather\nOn Valentine's Day, doin stick-ups together\nNo one to blame, no shame in her game\nAnd when we fuck she makes me scream out her name\nShe's not petty, confidant, ready\nRight for late night, we play fight with machetes\nThis goes out to all the gangsta hoe pros\nGive me a ghetto girl, fuck a Soul Train hoe\n\n[Chorus: Apache]\nI need a gangsta bitch yo (a gangsta bitch)\nI want a gangsta bitch (a gangsta bitch)\nI wanna \"Gangsta boogie!\" with my (gangsta bitch)\nI need a (gangsta bitch) I want a (gangsta bitch)\nI want a gangsta bitch yo (a gangsta bitch)\nI need a gangsta bitch (a gangsta bitch)\nI wanna \"Gangsta boogie!\" with my (gangsta bitch)\nI need a (gangsta bitch) I want a (gangsta bitch)\n\n[Verse Two]\nShe likes to party with her posse and drink beer\nPour a little bit out for the sisters who ain't here\nShe's not the one, player you might get done\nHer idea of fun's takin her son shoppin for a gun\nLikes to dress to impress, quick to attack\nWhen your punk-ass boys run, you know she's got your back\nIn a Benz with her friends, aiyyo Jeep kid\nDrivin down the street pumpin, \"Apache you ain't shit!\"\nSnappin on niggas, takin no shorts\nSittin on a porch, pullin on a Newport\nMinds her business, knows cause she hears things\nFat herringbone and diamond studded earrings\nShe's a thoroughbred, walks and talks with class\nTry to get fast, she just might slap your ass\nCome meet my moms, but the two might not click\nParents just don't understand..\n\n[Chorus: Apache]\nI need a gangsta bitch (a gangsta bitch)\nI want a gangsta bitch yo (a gangsta bitch)\nI wanna \"Gangsta boogie!\" with my (gangsta bitch)\nI need a (gangsta bitch) I want a (gangsta bitch)\nI want a gangsta bitch yo (a gangsta bitch)\nI want a gangsta bitch (a gangsta bitch)\nI wanna \"Gangsta boogie!\" with my (gangsta bitch)\nI need a (gangsta bitch) I want a (gangsta bitch)\n\n[Verse Three]\nI had a church girl, quiet girl, one girl was rich\nThe most memorable girl was a gangsta bitch\nWe went out a lot, sometimes we dressed the same\nLickin shots in the park and had pet names\nI called her 'Dollars' cause that's what she liked to spend\nShe called me 'Diamond' cause my dick was her best friend\nIf you owed her dough, then you had to pay\nBought her an AK for her 21st birthday\nWe packed up and shacked up, didn't need a job\nEngaged to a criminal and married to the mob\nI gave MC's injuries and beat 'em down\nWhile she's, pickin up ki's, from Uptown\nSad to say one day got caught out there\nI shed tears when the judge said five years\nShe's gone now so it's time to make my switch\nSo who'll be my next gangsta bitch?\n\nI need a gangsta bitch, yo! (a gangsta bitch)\nI want a gangsta bitch (a gangsta bitch)\nI wanna \"Gangsta boogie!\" with my (gangsta bitch)\nI need a (gangsta bitch) I want a (gangsta bitch)\nI want a gangsta bitch (a gangsta bitch)\nI want a gangsta bitch yo (a gangsta bitch)\nI wanna \"Gangsta boogie!\" with my (gangsta bitch)\nI need a (gangsta bitch) I want a (gangsta bitch)\n\n[Apache]\nYeah, yeah.. (a gangsta bitch)\nThis shit goes out to all the gangsta bitches Uptown (a gangsta bitch)\nAll the gangsta bitches in Brooklyn, Long Island (gangsta bitch)\n(a gangsta bitch) (a gangsta bitch)\nQueens, Boogie Down Bronx, Staten Island\nMount Vernon (a gangsta bitch)\nChilltown J.C., Naughtyville E.O. (a gangsta bitch)\nAnd Newark to Brick motherfuckin City (gangsta bitch)\n(a gangsta bitch) (a gangsta bitch)\nThis goes out to all the gangsta bitches, hehehah (a gangsta bitch)\nEvery-motherfuckin-where (a gangsta bitch)\nYeah, you know what I need baby (gangsta bitch)\nI need a gangsta bitch (a gangsta bitch) (a gangsta bitch)\nHahahaha! (a gangsta bitch) Yeah (a gangsta bitch)\nAhh (gangsta bitch) (a gangsta bitch) (a gangsta bitch)\nYo yo yo, yo honey check this out..\n\n{*music plays to end, DJ scratches \"ha ha ha!\"*}", "year": null}]}