{"songs": [{"year": "2017-06-30", "image": "https://images.genius.com/5459e9e148431643d2ed2d3bbdecc3b8.1000x1000x1.jpg", "title": "Beast Mode", "album": "Who Am I 3", "lyrics": "[Intro]\nHey man, hah\nI'm in beast mode, you feel me?\nFeel like Marshawn Lynch in this motherfucker, you heard me?\nAyy shut up lil ho\nThey ain't talkin' 'bout shit anyway\nAlways laughing at shit that ain't really just be funny\nYou know get you some money\nMan matter fact break the cigar down, make yourself useful ho\nHah\n\n[Verse]\nI'm in beast mode\nI'm a dog, put me on the leash mode\nHungry, I'm so hungry, I'm in feast mode\nGTA, left down right up, ayy I got cheat codes\nPlug with the chicos, they call me amigo\nNigga tried to rob me, he must thought this shit was water\nHeard his daddy dead, time to send him to his father (that's on my mama)\nMarried to the money, told her meet me at the altar\nThrow a bullet at you and you caught it, Miles Austin\nStone Cold Steve Austin, flexing like a wrestler\nSpongebob, tartar sauce, flip it with the spatula\nFucked your bitch and pulled her tracks, she got mixed and mastered\nGet my granny headed to the Bay, now that's a Packer\nThumbin' through the twenties backwards just because it's faster\nCall you niggas Adam Sandler 'cause they is some actors\nBitch I'm respected, no pastor\nYou smell the kush every time I walk past you\nYour bitch she watch me like I was a plasma\nPolo tee, rock [?] Castro, ayy\nDon't give a fuck what a hater say\nBy any means, bitch we gon' make a way\nThirty-six bows on the interstate\nAndalé, andalé, andalé\nYou say that you got it, ain't nothin' else to say\nI call up my takers now they on the way\nThey won't hesitate to take a nigga's face\nChopper up on him, make a nigga race\n\n[Outro]\nWoo, beast mode, beast mode, beast mode\nLike I said man, I feel like Marshawn Lynch in this motherfucker man\nI'm tryna get thirty of them touchdowns and get up in the backfield, you feel me?\nBeast mode, beast mode, beast mode"}], "artist": "BlocBoy JB"}