{"songs": [{"lyrics": "[Intro: Jeezy]\nYeah, see it's that\nIt's that Blueprint 3 shit right here\nIt's that TM 103 shit right here\nYou ready? You ready Hov'?\nLet's go! (Hands up!)\n\n[Verse 1: Jeezy]\nAllow me to re-introduce myself\nAt the same time re-introduce my wealth\nAt the same time rejuvenate the game\nIt's for my old dog niggas that's used to 'caine\nNow what B-dog said, I respect the game\nGD's, Vice Lords, the Crips the same\nAnd I know you're 'bout to say this off the chain\nTell 'em fake trappin' ass niggas stay out my lane\nSee I ain’t dead or in jail, I can’t complain\nAnd when these fake niggas gone, I shall remain\nAnd if you just tunin' in, let me explain\nYou know I keep that 47, Uday Hussein\nThese niggas way too far, I played the game\nAnd if you listen hard enough I say some things\nAnd when that sack got low, I shave them things\nAnd put 'em right back together, I made them things\n\n[Chorus: Jeezy]\nNow put your sets in the air if you represent your clique\nMoney in the air if you ever hit a lick, baby\nPut your hands in the air, if you know that you that bitch\nSay you looking for the real, hey well this is real as it gets\nHey! Hey! Ohh! Ohh!\nHey! Hey! Ohh! Ohh! This is real as it gets\nHey! Hey! Ohh! Ohh!\nHey! Hey! Ohh! Ohh! This is real as it gets\n\n[Verse 2: Jay-Z]\nWassup, wassup\nWassup, wassup, wassup, wassup\nI got it Jeezy...\nNow where that Southside at, wassup, wassup\nWhere the West Coast at, put your W's up\nWhere my East Coast niggas that hustle to live\nAnd all my niggas up north that's doin' a bid\nOh yeah I'm rare, I'm aware that I'm rare\nI rap and I’m real, I'm one of the few here\nThese other boys lyin', I wonder if y'all care\nThey stories out this world, I wonder if y'all hear\nBut don't really matter as long as they stay clear\nClear of the real shit we doin' over here\nWhen my nigga get home, I'm gon' send him a Lear\nFor all the time he been down, get him right up in the air\nWith a couple of broads get him right up in the air\nMile high club get him right up in there\nSend my nigga some gear like he never missed a year\nBy the time you hear this song, he'll be standin' right here\nReal nigga shit, there\n\n[Chorus: Jeezy]\nNow put your sets in the air if you represent your clique\nMoney in the air if you ever hit a lick, baby\nPut your hands in the air, if you know that you that bitch\nSay you lookin' for the real, hey well this is real as it gets\nHey! Hey! Ohh! Ohh!\nHey! Hey! Ohh! Ohh! This is real as it gets\nHey! Hey! Ohh! Ohh!\nHey! Hey! Ohh! Ohh! This is real as it gets\n\n[Verse 3: Jay-Z]\nA hundred million to the good and I'm still talkin' yayo\nAt a snails pace I won this race that y’all trail\nUh, uh, Blueprint's for sale\nFollowin' my footprints you can't fail\nSet sail, I used to duck shots but now I eat quail\nI'll probably never see jail\nEach tale contains more of the truth\nOf the statute allows me to go into detail\nUh, close your eyes, you can smell\nHov's the audio equivalent of braille\nThat's why they feel me in the favelas in Brazil\nAnd Waterhouse 'cause real recognize real\nRrraaahhh!\n\n[Verse 4: Jeezy]\nYou know me, I don't need no introduction\nCall me make a lil' somethin' out of nothin'\nAnywhere you go, we're the topic of discussion\nDamn, that's gotta be disgusting\nErr, shit make me wanna throw up\nIt's big boy music, it should make me wanna grow up\nFlows like syrup, it just make me wanna pour up\nAnd is it just me or this makes you wanna roll up\nA big fat one (one), then unpack one (one)\nThen unwrap one, peel back one (one)\nThey use to call me Jizzle with the stamp in the middle\nAnd you can tell the color when it's damp in the middle\nWhassup!\n\n[Chorus: Jeezy]\nNow put your sets in the air if you represent your clique\nMoney in the air if you ever hit a lick, baby\nPut your hands in the air, if you know that you that bitch\nSay you lookin' for the real, hey well this is real as it gets\nHey! Hey! Ohh! Ohh!\nHey! Hey! Ohh! Ohh! This is real as it gets\nHey! Hey! Ohh! Ohh!\nHey! Hey! Ohh! Ohh! This is real as it gets", "title": "Real As It Gets", "image": "https://images.genius.com/ff10a6a0a94d002a374623bb49818293.1000x1000x1.jpg", "year": "2009-09-08", "album": "The Blueprint 3"}], "artist": "JAY-Z"}