{"songs": [{"image": "https://images.genius.com/d4b8299bec1aac14c1931423e8d3466c.500x500x1.jpg", "title": "Beam Me Up Scotty", "album": "Beam Me Up Scotty", "year": "2009-04-18", "lyrics": "[Intro]\nYou know they say who, who is Nicki Minaj?\nYou know I'm like a multiple personality bitch\nLike, you know, I'm, I'm, you know, I'm a ninja, I'm a boss\nI'm, I'm the Harajuku Barbie!\n\n[Sasha Sample]\nWho said dem waan hackle mi body\nDem haffi have a permit and a licence fi me\nNow tell me who said dem waan hackle mi body\nDem haffi have a permit and a licence fi me\nAdmit it\nMi say, me moan and groan\nAdmit it, say me moan and groan\nAdmit it, say me moan and groan\nAdmit it, -mit it, -mit it, -mit it\n\n[Verse 1]\nI just heard that I was the baddest in the town\nSo I came down and had to pick up my crown\nWent to Taiwan and had to pick up my wand\nNow everybody wanna pick up my sound\nBaddest underground since Harriet Tub\nThat's why when I come around they hurry and run\nAnd I know it ain't math but I carry the one\nGot a couple body guards that'll carry the guns\nYao Ming, I'mma need a couple Asians\nSayonara, bitches, on a Kawasaki blazin'\nAyo, Rihanna, gotta come up off dem bajans\nCall Wyclef, I'm a need a couple Haitians\nNow where my West Indies?\nWhere the fuck my curry chicken and my rice and peas?\nMy madda cunt Trinis\nMy Jamaican bod gal, all my Guyanese?\n\n[Sasha Sample]\n\n[Verse 2]\nI just found out that I was doper than Amy\nWinehouse, maybe\nFresh out the navy\nFresher then a daisy\nUsed to be on Baisley\nYoung money bunny bitch please say the baby\nPlease stop callin' me, I'm such a rock star\nAssalam alaikum, where the fuck is Akbar?\nGive 'em my keys, tell 'em valet my car\nB's pon da wheels, you can see them from far\nNow all I need is a real mandingo\nGimme good uhh and distribute my single\nBootleg the mixtape out in Nigeria\nHit up Amadu, he can meet the criteria\nIf he work da middle like a mohawk, tell'em he can meet me where dem girls say aloha\nSee I got da first class pussy and he use to give me Coacha\nReal good chocha, fuck is my chauffeur?\n\n[Sasha Sample]\n\n[Bridge]\nAhh, beam me up, Scotty\nMy wa-wa wine\nMy wine is too dutty\nBeam me up scotty\nMy wa-ba wine\nMy wine is too dutty\n\n[Verse 3]\nOne, two, buckle my shoe\nNo one on the corner has swagger like I do\nKeep a two-two, get wetter then boo-hoo\nKeep a couple stacks inside of my loo-loo\nExcuse me, I'm sorry\nI got the 45 special, don't worry\nCause I'm cooler than a bloodclaat flurry\nI like mi chicken and mi goat with curry(yeah)\nNow, where my West Indies?\nWhere the fuck my curry chicken and my rice and peas?\nMy madda cunt Trinis\nMy Jamaican bad gal, all my Guyanese?\n\n[Outro]"}], "artist": "Nicki Minaj"}