{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse 1]\nMove over bacon there's something meatier\nA natural born lover with love to give free to ya\nMeatier, so all you bacon lovers move over\nCause I'm so smooth they should call me Blackanova\nI'm not tryin' to say that I'm number one\nI'm just a smooth operator that gets the job done\nSo, let me lick you from head to toe\nRealllllllll slowwwwwwwww\nCause ever since I was young I could keep girls sprung\nJust by the movement of my tongue\nI remember it all started way back\nIn ummm... Kindergarten!!\nSome played with Legos, some played with Play-Doh\nBut I was feelin' girls like a ripe tomato\nAnd now it's 1990 and you can find me as I dunk\nLockin' up girls like I want\nYes I got a harem, but I don't share em\nI collect em like per diem and MMM, you gotta see em\nBecause the ladies is all I dream of\nAnd not even Anita Baker can give sweeter love\nYou know why?\n\nCause I can do it right (4X)\nYesssss I can!\n\n[Verse 2]\nStep up girls and get somethin' to treasure\nAnd welcome to the Smooth Operator's Palace of Pleasure\nAnd if you're wondering if I want it --\nI got a Craftmatic with your name written on it\nI reminisce saying I take em eight to eighty\nBut I was just kiddin', no you have to be a lady\nEven if you're too young, with the hypest body\nI just don't go to a Similac party\nSo all those of age, we can get intimate\nBumper to bumper, so you can get your fender bent\nI treat girls just like pastry\nMmmmmmmmm *smacks lips* Tasty!\nVery kinky when it comes to hanky panky\nA well known player, but not for the Yankees\nI won't say I'm the baddest or portray that role\nBut I'm of the top two, and my father's gettin' old\nI'm taking love to a brand new height\nAnd if loving girls is wrong I don't wanna be right\nCause my man Babyface said that it's no crime\nAnd of course I'll work Diana Ross overtime\nYou know why?\n\nCause I can do it right (4X)\nYesssss I can!\n\n[Verse 3]\nIf I was on the movies I'd frame Roger Rabbit\nPlay Spike Lee with Jessica, because she's gotta have it\nBut I'm not an actor, I'm just a mack\nThat charms girls as I whisper sweet nothings to attract her\nAnd bring about that feeling of passion\nTo have her on my body like modern day fashion\nLayin' next to me, in pure ecstasy\nYou're like a door and you know that sex the key\nSo send your man to the lost and found\nI'm bringing something that's world renowned\nIn other words - good lovin' that's major\nI got girls in more areas than a SkyPager\nRunning around saying, \"Please me, please me, please me\"\nThat's why I say it ain't easy\nBut I've been able to maintain my status\nWith ladies macking without if's, and's, or maybe's\nAnd other players just can't understand it\nAnd couldn't keep they girls even if they were branded\nI always end up with them on my shelf\n*SMACK* I gotta jump back and kiss myself\nYou know why?\n\nCause I can do it right (4X)\nYesssss I can!", "image": "https://images.genius.com/065deb6c8193ec3f78eae34a4581ad24.397x400x1.jpg", "year": "1990-10-30", "title": "Cause I Can Do it Right", "album": "Taste of Chocolate"}]}