{"artist": "Warren G", "songs": [{"year": "1997-03-25", "lyrics": "[Intro:]\nMicrophone check one two uh\nAnd you don't stop\nMicrophone check one two uh\nAnd ya don't quit\n\n[Verse 1:]\nMicrophone check one two one two\nLet me clear my throat so I can do what I gotta do\nIt's expresso, mandle that I'm stacked\nNiggas, tryin to corner the market but I'm back\nBang to the boogie, and boogie to the bang\nIt's G-Funk for life sewing up everything\nLittle locs, pay attention\nDo I or should I have to mention\n44 ways where the grass is greener\nFrom OG to BG is a misdemeanor\nSt. Mary's Hospital, 10:20 AM\nOn the street called Atlantic is where I began\nOla May, uh, thats my lady, she made me\nOn a street under the bridge called hill, thats where she raised me\n\n[Chorus:] x4\nTransformers, busters in disguise\n\n[Verse 2:]\nI say chitty chitty bang bang\nBrothers wanna gang bang\nTryin to represent but dont know about the gang thang\n21st where it all begun\nBegun us on the corner with the homies havin fun\nI was a youngsta, peepin from the other corner\nSeeing sets in the air with big arms now I wanna\nBe like them, and act like them\nAnd stack like them and try to mack like them\nShit, its hard being Warren G from the LB\nAnd like the G's before, you know me\nSo I'm a stay down, for the eastside\nNot like you busters, transformers in disguise\n\n[Chorus:] x4\nTransformers, busters in disguise\n\n[Verse 3:]\nOne to twenty-one, and you know I ain't gonna stall\nI gotta give it up with the homie roll call\nOG cry baby, and the homie big roc\nMooch on the side with the stockin can ride\nBig sugar mama, flee bag and\nLady roe guard and marathon they OG see\nSalt Lake crew got little shorty Charlotte\nBut back to Louis with T-Bone is where I started\nLivin in the back in a little pink shack\nIf you know like I know then bounce to this track\nCerritos bounce to this\n21st bounce to this\nI said Lewis bounce to this\nSalt Lake bounce to this\nUnder the bridge bounce to this\nElm St. bounce to this\n710 bounce to this\nP-A-C's bounce to this\nMLK bounce to this\nLocc St. bounce to this\n1-9 bounce to this\n20th bounce to this\nLemon bounce to this\n(fades)", "image": "https://images.genius.com/d0191f52cbece0c662cd18e324f486e9.1000x1000x1.jpg", "album": "Take a Look Over Your Shoulder (Reality)", "title": "Transformers"}]}