{"songs": [{"title": "Facts", "album": "Free Crack 4", "year": "2017-12-03", "image": "https://images.genius.com/977ce8f2a06fdc6d78002a3fa6ed087e.400x400x1.jpg", "lyrics": "[Intro]\nOh My God Who Is this? L Beats?\nThe Syndicate\nYeah that's facts\nFacts\nShawty spit that crack yeah that's facts\nShawty keep a gat yeah that's facts\nAy, ay, yeah that's facts\nOh My God Who Is this? L Beats?\n\n[Verse 1: Lil Bibby]\nI was 15 years old in the trap bagging dimes up\nThen I started rapping got these crackers tryna sign us\nNiggas kill my dawg we can't put that shit behind us\nLike should I cop that bentley Shit, I still ain't made my mind up\nYou ain't never did no time huh, never been in no line up\nNever had to go rob nun, never tote no iron huh ?\nYeah, I heard I posted behind huh\nIt ain't too hard to find us\nIm still doing my sing up we crack babies don't mind us\nI'm so weighed I lost my dawg to the streets, it ain't no peace\nWe ain't squashing shit, who you going call it ain't no keep\nShawty know I'm rich, she got a man but she going to cheat\nI swear ever since I got the gwop they M.O.B\n\n[Chorus]\nYeah, that's facts (x5)\nThey like shawty spit that crack, yeah that's facts\nShawty keep a gat, yeah that's facts\nYou know I ain't moving packs, yeah that's facts\nBlew that check and got it back, yeah that's facts\nYeah, that's facts (x5)\n\n[Verse 2: Chief Keef]\nPhone booming, like the motherfucking trap\nDiss me, can get motherfucking slapped\nNo already, you get motherfucking clapped\nThe soda was dirty soon as I twisted off the cap\nI put us on the motherfucking map\nWe'll put a nigga's governement on the bullets and the scrap\nYour whole face in my motherfucking lap but I told that bitch to stop, I got to finish this lap\nI'm flyer than a motherfucking seagull\nHis name is 3 times, that's a motherfucking redo\nYeah that's facts, motherfucker, it ain't see through\nStep red nighters bankroll like I need you\n\n[Chorus]\nYeah, that's facts (x5)\nThey like shawty spit that crack, yeah that's facts\nShawty keep a gat, yeah that's facts\nYou know I ain't moving packs, yeah that's facts\nBlew that check and got it back, yeah that's facts\nYeah, that's facts (x5)"}], "artist": "Lil Bibby"}