{"artist": "9th Prince", "songs": [{"album": "Prince of New York", "lyrics": "[Intro: 9th Prince]\nYeah, it's real, right now\nAlexander the Great.... aiyo\n\n[Chorus 2X: 9th Prince]\nI'm banned from the radio\nBut still, I bust shots through your stereo\nThe hood wanna know, what's the scenario?\nI'm still hustlin', fuckin' with that yae yo, aiyo\n\n[9th Prince]\nAiyo, Brooklyn bitches call me Slim, chrome rims\nDoing a buck 50, getting head from Lil' Kim\nI was born on Staten Island, where them cops got shot\nAnd the block is always hot, Godbodies got it locked\nLike Fort Knox, we headliners, M-16 designers\nC.E.O., slash, crime rhymers\nNo matter where you hide, my infered'll find ya\nBlind ya, get you paranoid like ganja\nThe messenger, rhyme editor, walk like a predator\nThe streets is like a jungle\nCrawling with scavengers with silencers\nThat'll pop your watermelon, who you telling, what you selling?\nYo, nobody, peace to 9th Prince, so stop yelling\nFor God's sake, ya'll niggas is coke heads\nAmped off of snow flakes, I'm on a paper chase\nFlee the scene without a trace\nDipped down in black, it was me and the Ghostface\nArmy fatigued down, busting rounds at you clowns\nI'm Kool like Moe Dee, so \"how the fuck you like me now?\"\nMy underground sound that breaks the compound, aiyo\n\n[Chorus 2X]\n\n[9th Prince]\nAiyo, I gave Moses the power, to split the Red Sea\nBy any means, licking cannons at my enemies\nArmy fatigues, ducking behind trees\nI'm a Prince over seas, my hair is wooly like Jesus with bronze feet\nTrue indeed, the way I be rhyming\nI'mma blow, like the marine bombings\nSound the alarming, ain't no telling, what I be harming\nSupreme magnetic, state of mind, guns I design\nWave the nine to ya spine, for dropping dimes\nStaten Island villains, police taking flicks, I'm moving bricks\nMaking millions, cameras in the buildings\nThe Granddaddy Flow has got a brand new bag\nThe Thief of Baghdad, running with C-hags\nYour style is played and old school like flattops or shags\nOpponents lose chances they never had\nStapleton outlaws, street pharmacists\nShootouts in front of the drug store\nGod bless America, running through red lights\nBreaking laws, we hardcore, bucking down the jaw\nAnd leave 'em spinning on the ground like old school b-boys\nBreakdancing on the floor, nowaday\nI speak directly from the heart, sparks from the .357\nLight up the dark, running from NARC's\nWe was just kids back then, smoking weed\nAnd just rhyming in the parks, aiyo\n\n[Chorus 4X]", "year": null, "title": "Banned from the Radio", "image": "https://images.genius.com/5491ced6515f8b9c5af8dbaefebec9df.300x300x1.jpg"}]}