{"songs": [{"image": "https://images.genius.com/f3dc932dcf3a3d218d8e387297bf5afe.1000x1000x1.jpg", "title": "Returns", "album": "The Search", "year": "2019-07-26", "lyrics": "[Verse]\nWhat is perfect? Not me\nI've been overworkin' for weeks\nI go home then purchase some things\nThat I know will not fill my needs\nHave a dose of what I've achieved\nThen get lonesome and I critique\nWho I am and what I believe\nMake up standards too high to reach\nUntrained animal off the leash\nI'm in panic, but yet relieved\nBrought your hammock to hang with me?\nGrab a hatchet, cut down your tree\nLike a mannequin that can speak\nWhat I have in store is unique\nI just mop the floors with MCs\nI can't stop until things are clean\nI'm an amateur's what you think\nSo you stand there in disbelief\n'Til I dislocate both your feet\nThat's what happens, you step to me\nNot too graphic, but not PG\nLots of action in every scene\nI'm kidnapping all of your dreams\nHold 'em hostage and watch 'em scream (Ahh!)\nRap aside, I am what I advertise\nDon't matter how you put it, we live, then we have to die\nYou might hate it, but you can't deny\nSee, everything that I've been doing got me lookin' like a mastermind\nIt's so vain, but I vandalize that I do what you fantasizin'\nTook a vision of my dreams\nAnd then found a better way that I can make it\nI've been looking, think I'm really 'bout to maximize it (Agh!)\nThese bullets form in my mind and come out my mouth and (Pow, pow, pow)\nFor anyone out there doubting or acting mouthy (Watch, watch, watch)\nForget what you heard about me, I've been astounding (Got, got, got)\nSomething for you thinking you might run circles 'round me\nYeah, ain't this all I ever wanted?\nThat's a fact, no, that's a lie, no\nI'm confused, yeah, I got problems\nWhat's the use? Yeah, let's be honest\nScrews are loose, I need 'em tightened\nNot amused, yeah, look what I did\nBrought you something, hope you like it\nSo precise, the flow the nicest\nSo productive, stop your whining\nBack in style like I was vinyl\nI make songs and they go viral\nSomething's off if I go idle\n\"Been so long,\" yeah, okay, I know\nTake your shoes off, you're in my home\nYou got fans, but not like I do, yeah (I do, I do)\nThankful, I try to be, can't contain what's inside of me\nThey don't like this side of me 'cause I lack in compliancy\nI question what I can see if you're not playing my CD\nNo expiring, I'll decide when I think it's my time to leave (Woo)\nYeah, 'cause they won't retire me, it inspires me to be inspiring\nWhen I'm low I feel like I'm spiraling\nPushin' forward, look, I can't ignore it\nThere ain't no I in team, but drop the T and A\nSometimes, if I'm bein' honest, feels like it's only me\nNo defeat, notably, better have it right if you're quoting me\nWrite my name on your hit list, it might be the last time you wrote something\nRip that cocky smile right off your face for thinking you're close to me\nGrab a can of gasoline, light it all over your self-esteem\nSelfishly watching y'all helplessly pretend you're on my planet\nShoot you out of the sky like you're punchlines, you are not landin'\nGun jammin', reach in your mouth and rip out your tongue after tongue\nLashings, I hand 'em out like pamphlets in church, Pastor\nShow up to my funeral wearin' all black, and what's happenin'?\nI look around and wonder, \"Where my fans at?\"\nOh Lord, they know me so well, they know I'm not in that casket\nTrash bag is prolly buried somewhere full of my ashes\nMy music's superb, playin' with words, play with my nerves\nThey gon' have a list of issues long as my shirts\nVery absurd, very disturbed\nStare at the Earth like, \"This is not the place I was birthed\"\nI'm generic, you sure?\nOh, they think I'm very reserved\n'Til I open up on the beat like on my Therapy work\nI don't care what you heard, real scary, carry the verse\nWhile I'm wearin' my merch, stompin' on your arrogant turf\nSit back and observe, nah, I like to actually work\nThis life's so unpredictable, it just keeps pitching me curves\nI take a swing, I hate the things that make me feel like I'm dirt\nI've patiently been waitin', please, I think it's time for my turn\nMy expertise are melodies, they talk to me when I'm hurt\nJust let me be, eventually someday they'll see what I'm worth\nI cross my I's and dot my T's, it makes no sense, but I've learned\nNormal to you is not to me, the outcast finally returns (Returns, returns)"}], "artist": "NF"}