{"songs": [{"year": null, "image": "https://images.genius.com/41c235790fc0f3bcc10ccc9cef18db17.500x500x1.jpg", "title": "All To You", "album": "Blood, Sweat and Tears", "lyrics": "[Intro]\nI want to give it all to you\nDedicating this one to the streets. Detroit\nNigga gotta hustle westside, eastside, southwest\nWhatever way you gotta do it, but stay low, out the way\n\n[Verse 1]\nAnother day, another dollar I make\nAnother risk I take\nDodging haters in the Jacob\nMama tell me to keep my head up\nI gotta get my bread up\nWho would've knew I had to give my legs up?\nSitting up in a wheelchair\nPreaching like, \"Son be glad that your still here\"\nStill where?\nIt's feeling like a part of me gone\nI'll be glad when my brother get home\nThat's when I learn that\nLife is life; you live or die\nI guess that's why everyday I get high\nGot a wife now, two kids in my life now\nFeds trying to dict because of my mobish lifestyle\nMy pops like, \"dawg just pipe down.\"\nSame day I took the Benz filled the trunk with sounds\nThen I took a little trip fill the trunk with pounds\nIf my dead homie Mike he could see me now\n\n[Adlib.]\nI remember being broke without a dime\nYall niggas didn't wanna fuck with me, you know what I'm saying?\nNow a nigga got cheese\nPhone won't stop ringing\nYou know what I'm saying;\nNiggas won't stop hollering at a nigga\nIt's crazy how we on top\n\n[Verse 2]\nTo all my homies caught in the streets:\nI don't blame you dog do what you do to eat\nNew kicks on you feet, need clothes on you back\nGot a 9'' in your pocket, you don't know how to act\nCause you never had nothing, a product of the slums\nNow you got funds, now life seems fun\nDawg, pump ya breaks watch for snakes\nFake niggas ain't far dawg though, they right in your face\nThey riding in the car blowing gans with you\nYou think he your man he just waiting to get you\nHe'll steal ya customs steal ya hustle\nSoon as you go down he ain't nowhere to be found\nSounds crazy and I ain't trying to preach\nBut the heat is on that's why I keep the chrome\nAnd they'll never get another chance to take me out\nAnd nigga next time you better take me out\n\n[Adlib]\nDamn\nThis nigga ran up from the crib\nPopped me up, You know what I'm saying?\nWhile laying with the (?)\nEnds up in the hospital like, \"Shit\"\nNigga's still alive\n(?)\n\n[Verse 3]\nLittle blade need a new bike\nHis mama need new ice\nThats why I hustle all day all night\nI decided mine, Keep my eye on the grind\nSo stay outta mine or get sprayed with the 9\nAnd this my life dawg and I ain't braggin\nMaggin stashin? Chrysler wagon\nI heard they put a tag on my head (tag on my head)\nWell get ya money back dawg I ain't dead\nI ain't broke, matter fact a little bit richer\nWhen I was young I learned to look at the bigger picture\nSee snitches go to hell rich niggas just want bail and\nMy niggas upstate just wanna get out of jail\nAnd to you bitch ass niggas that shot me up dawg...\n(I wanna give it all to you)\n\nYou know I remember driving up the freeway with my brother dropping him off at the fair joint, you know what Im sayin\nLike, \"Dawg I got you.\"\nTwo weeks later dude he callin me from the hospital\nDawg you still alive nigga\nFuck the bullshit\nYeah dawg but barely breathing\nYou know what I'm saying?\nIt's like a time to remember you know what I'm saying\nI'm going through rehab with my headphones on like\n\"I can't wait to walk again, I can't wait to walk again.\"\nYou know now I'm back up on my feet\nYou know what I'm saying?\nAin't shit changed, I ain't missed nothing"}], "artist": "Blade Icewood"}