{"artist": "50 Cent", "songs": [{"album": "Get Rich or Die Tryin’", "image": "https://images.genius.com/3389143a3e12456fc07deb03fd3225a7.1000x1000x1.png", "title": "In Da Club", "lyrics": "[Produced by Dr. Dre & Mike Elizondo]\n\n[Intro]\nGo, go, go, go, go, go\nGo Shorty, it's your birthday\nWe gonna party like it's your birthday\nAnd we gonna sip Bacardi like it's your birthday\nAnd you know we don't give a fuck, it's not your birthday\n\n[Chorus]\nYou can find me in the club, bottle full of bub'\nLook, mami, I got the X if you into takin' drugs\nI'm into havin' sex, I ain't into makin' love\nSo come give me a hug if you into gettin' rubbed\nYou can find me in the club, bottle full of bub'\nLook, mami, I got the X if you into takin' drugs\nI'm into havin' sex, I ain't into makin' love\nSo come give me a hug if you into gettin' rubbed\n\n[Verse 1]\nWhen I pull up out front, you see the Benz on dubs (Huh-uh)\nWhen I roll twenty deep it's twenty knives in the club (Yeah!)\nNiggas heard I fuck with Dre, now they wanna show me love\nWhen you sell like Eminem and the hoes, they wanna fuck (Whoo!)\nLook homie, ain't nothin' changed: hoes down, G's up\nI see Xzibit in the cut, hey nigga, roll that weed up! (Roll that!)\nIf you watch how I move, you'll mistake me for a player or pimp\nBeen hit with a few shells, but I don't walk with a limp (I'm aight)\nIn the hood in L.A. they sayin', \"50, you hot.\" (Huh-uh)\nThey like me, I want 'em to love me like they love Pac\nBut holla in New York, the niggas'll tell you I'm loco (Yeah!)\nAnd the plan is to put the rap game in a chokehold (Huh-uh)\nI'm fully focused, man, my money on my mind\nGot a mil' out the deal and I'm still on the grind (Whoo!)\nNow Shorty said she feelin' my style, she feelin' my flow (Huh-uh)\nHer girlfriend willin' to get bi and they ready to go (Okay!)\n\n[Chorus]\nYou can find me in the club, bottle full of bub'\nLook, mami, I got the X if you into takin' drugs\nI'm into havin' sex, I ain't into makin' love\nSo come give me a hug if you into gettin' rubbed\nYou can find me in the club, bottle full of bub'\nLook, mami, I got the X if you into takin' drugs\nI'm into havin' sex, I ain't into makin' love\nSo come give me a hug if you into gettin' rubbed (Rubbed)\n\n[Bridge]\nMy flow, my show brought me the dough\nThat bought me all my fancy things\nMy crib, my cars, my clothes, my jewels\nLook, nigga, I done came up and I ain't changed (Yeah!)\n\n[Verse 2]\nAnd you should love it way more than you hate it\nNigga, you mad? I thought that you'd be happy I made it (Whoo!)\nI'm that cat by the bar toastin' to the good life\nYou the faggot-ass nigga tryin' to pull me back, right?\nWhen my joint get to pumpin' in the club, it's on\nI wink my eye at yo' bitch, if she smiles, she gone\nIf the roof on fire, let the motherfucker burn\nIf you talkin' about money, homie, I ain't concerned\nI'ma tell you what Banks told me:\n\"Cuz, go 'head, switch the style up\nIf niggas hate, then let them hate, and watch the money pile up.\"\nOr we can go upside your head with a bottle of bub'\nThey know where we fuckin' be\n\n[Chorus]\nYou can find me in the club, bottle full of bub'\nLook, mami, I got the X if you into takin' drugs\nI'm into havin' sex, I ain't into makin' love\nSo come give me a hug if you into gettin' rubbed\nYou can find me in the club, bottle full of bub'\nLook, mami, I got the X if you into takin' drugs\nI'm into havin' sex, I ain't into makin' love\nSo come give me a hug if you into gettin' rubbed (Ha-ha-ha-ha)\n\n[Outro]\nDon't try to act like you don't know where we be neither, nigga\nWe in the club all the time, nigga, so pop, pop off, nigga\nG-Unit", "year": "2003-01-07"}]}