{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/7f54a7e8e35ab0c0025418271ad28431.820x820x1.jpg", "title": "How Many", "year": null, "album": "The Offering", "lyrics": "[Verse 1]\nMy mind is designed like a Mayan pyramid\nWhen you climb up the steps\nYou can get where the emerald is\nI left witnesses for those who didn't believe\nShow the depths of sentences, y'all forbidden to leave\nAlphabets become images, you listen to see\nHow the breath of the lyricist can breathe 3-D\nTrapped in each bar, it gets deep with the God\nLike the five pillars that they teach at the Mosque\nTry to defy Killah and you seek a mirage\nTerrifying thriller, have you reaching your heart\nPriest finna get dark, dark as he can get\nDark as the first nine Pharaohs that ruled Egypt\nDark as the moon cast the shadows that cause eclipse\nDark as the ladies with the tarots telling you secrets\nDark as the gun barrel right before you squeeze it\nI enter your mind like an auditorium\nYour picture was distorted but I restored your film\nNow you see clearer, my pen has a lens\nLike I'm sitting in a theater\nCome back again\nRemind you of Rakim, but I'm not him\nThough we one and the same, the second coming of Kane\nI'm like Kool G Rap, put the Uzi in rap\nOr KRS One said it was cool to be black\nFor Slick Rick announced that the Ruler was back\nBack in the days when gold jewelry was fat\nBefore Wu or Biggie, Nas, Jigga or 50\nThat was New Yiddy, they ruled the city\nOn the West Coast, it was run by Death Row\nPac gave 'em Thug Life, but I just hug mics\nThe grip of the python, the strength in my right palm\nWill crush a competitor's life form\n\n[Hook]\nHow many MC's must I defeat?\nHow many rhymes must I show 'em technique?\nHow many metaphors?\nHow many letters in all\nHow many times must I show you I'm better than y'all?\n(2x)\n\n[Verse 2]\nRhymes after rhymes, metaphors and lines\nSince eighty four I recall the time\nLeft MC's inside of morgues and shrines\nWeak technique get absorbed like wine\nThen I piss 'em back under the trees and vines\nThis rapper that rapper I proved I'm better\nNext one, I'm about to battle Webster\nDo you think you can handle my pressure?\nThe weight of my thinking when I play with the ink pen\nIs he old or new school?\nNah - I'm in a class by myself\nPlus I drop math then I blast like a stealth\nThe bars you spit I use for chin ups\nSoon as you lay 'em down, I press the bench up\nThen I start spinning like them windchucks\nEach paragraphs is like a Pharaoh in the past\nWide is the dome piece, and narrow is the path\n\n[Hook]"}]}