{"songs": [{"year": "2007-12-11", "image": "https://images.genius.com/a51dcea6b49ee87e76d235126166aaf9.600x595x1.jpg", "title": "I’m a Stunna", "album": "5 ★ Stunna", "lyrics": "[Intro]\nYeah nigga, that's what it do\nThat's what it does, that's what it is\nAnd that's what it always was\nYou heard me? Believe that\nThis what is hidden for homeboy\nTake this one to the bank nigga\nAnd I can vouch for that, believe that\n\n[Chorus x2]\nBitch I'm a stunna, a rap hunna\nI'm just a nigga with a whole lot-a-money\nBitch I'm a stunna, a rap hunna\nIt's a M.O.B. with the money and power\n\n[Verse 1]\nNigga we don't move hoes nigga, we move 'em home\nGot the game from the G's nigga, straight of the floor\nUptown nigga with his uptown soul\nFlip a ice neat nigga, drive a red rose\nHold up in the kitchen gotta heavy on the load\nHustle from the front straight to the back door\nMoney like trees, flippin' these flees\nBitches all over cuz they know we got cheese\nRife M.O.B., that's how I be\nCook a whole [?], let him fly on the street\nTall like a motherfucker, condo on the beach\nThats how we livin', with the gators on the seats\n\n[Chorus x2]\n\n[Verse 2]\nWe put the marble on the floor 'cause we shine condos\nThem niggas act like hoes, we let 'em all go\nComing out the ceilin' with the chopper and some dope\nStuntin' on them bitches in the Bentley four door\nHalf a bird nigga with his ounce, asshole\nPoppin' at the mouth like his hair can't glow\nBaby mama drama, she was born in the U\nI was born in the milf, got the game out of nowhere\n13 bets & I come up outta nets\nCoochie [?] put me down, I love my set\nKC put me on 'til my first dollar\nI was 16 years old with a meal and job bitch\n\n[Chorus x2]\n\n[Verse 3]\nCity full of murder nigga, that's what we know\nFuck him, if he gotta go then he gotta go\nCash ain't quick nigga, hustle full of licks\nAt the same time, nigga flip a whole brick\nSayin' niggas poppin', sayin' niggas ain't shit\nMoney ain't long nigga, bitches ain't shit\nG4, Lambs, Maserati is the shit\nFrom the bottom to the top with a bad bitch\nIt's my round now, when them niggas come around\nTommy-gun banana clips make a loud sound\nBrand new crib and we built from the ground\n75 carats and we blowin' out the pound\nOne hundred\n\n[Chorus x2]\n\n[Outro]\nYeah, thats what it do nigga\nThis stuntin' shit go so muthafuckin far nigga\nThat's the business homeboy\nWe be stuntin' on them bitches every chance we get\nWe be flossed out, shinin' on them hoes nigga\nYou know how we do nigga\nSo pimpin', so flossy with it nigga\nCan't know one do it better than us\nWassup Young? You heard me? Fuck 'em\nNumber one, that's what it do nigga\nStay shinin' on them bitches\nStay grindin' on them bitches\nOne hundred, yeah"}], "artist": "Birdman"}