{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/6918fbcaf85b842ec1dd67a31236e15d.500x483x1.jpg", "title": "100it Gang (Marijuana Time)", "lyrics": "[Intro]\nI'm leanin' right now\nGot to be a bitch with ass, BWA\nHow you know us, we don't even know your name\nIt's marijuana time\nI'm leanin' right now\nNina on me now don't make me bring that .40 out\nWhat you talking 'bout don't make me bring that choppa out\nI'm leanin' right now\n\n[Hook]\nA lot of niggas flexing, say they know 100it gang\nBut how you know us and we don't know your name\nLight it up, it's marijuana time\nPour it up, I'm leanin right now\nShorty super fine and I just wanna dick her down\nBring me the pussy I'mma kill it from behind\nLight it up, it's marijuana time\nPour it up, I'm leanin right now\n\n[Verse 1]\nGot a bad bitch in Lafayette, and like 50 grand on that fuck shit\nB.G.'s and VSA's, give 'em the word they gon' bust quick\nNiggas throwing water cause they know they watered down\n(Brookstown) With more bread than dough right now\nLingo, what up? (Yo) What up? (I go) dumb (and) retawdid' (What else?)\nKnow its got a name, (But what?) don't know what to call it\n2 and a 16 ounce Sprite, I'm leaning right now\nMy phone be going dumb and that bitch ringing right now\nPull up in them ghosts (runny runny)\nMe and Mozzy Floats\nHalf pound of loud running off at the mouth, shorty need some culture\nCar full of killers, bout they business, tinted windows, in Toyota Corollas\nPlay with me or Nook, Gutta and Boobie ain't gon' stop unloading\n\n[Hook]\nA lot of niggas flexing, say they know 100it gang\nBut how you know us and we don't know your name\nLight it up, it's marijuana time\nPour it up, I'm leanin right now\nShorty super fine and I just wanna dick her down\nBring me the pussy I'mma kill it from behind\nLight it up, it's marijuana time\nPour it up, I'm leanin right now\n\n[Verse 2]\nHey bro look, look over there (I see) She want, me\nHer booty like a joystick, Nintendo... WII!\nWith Percyalago, in a Maserati\nJet Life out his body, beat it, Brasi!\nPeople get behind me I ain't slowing or I'm going, I'mma cum all on ya first for I even pull out\nVideo coming on MTV, I don't really give a fuck, long as every hood know it\nHashtag BMTP, bring me the pussy and bring ID\nNot the average girl from the videos, bumping India Arie\nIf you pussy, change the subject, paparazzi\nCaught me tongue kissing a pint while out in public, caught me\nGot to be a bitch with ass to be BWA\nCan't fuck with bartender Cherrish cause, that ho pussy stank\n\n[Hook]\nA lot of niggas flexing, say they know 100it gang\nBut how you know us and we don't know your name\nLight it up, it's marijuana time\nPour it up, I'm leanin right now\nShorty super fine and I just wanna dick her down\nBring me the pussy I'mma kill it from behind\nLight it up, it's marijuana time\nPour it up, I'm leanin right now\n\n[Verse 3]\nI'm cryin' \"shame\", nigga main line wanna fuck with Luca Brasi\nEvery time we around each other I can feel her eyes watching\nMy Roley game time give a Colorado rocky\nMet a freak from Denver called her freaky Colorado\nPussy ooh, juicier than sushi with no avocado\nAnd I don't do insecure and he don't want her for the motto\nWhat it do, Bailey's Irish Cream, drinking out the bottle\nShe get loose, like drinking chocolate martini moscatto\nPouring juice, lick it off her nipples in love what I got her\nTold her crew, freaky things we do, now they wanna holla\nConfused, but what's it to you? On twitter they follow\nStuck my tongue all in her ass this nigga go in like all the way in you already"}], "artist": "Kevin Gates"}