{"songs": [{"year": "2005-01-01", "album": "The Abstract and the Dragon", "image": "https://images.genius.com/6e5b51b62c2bc6935584c6cb0aa8c8ac.600x600x1.jpg", "title": "For the Nasty", "lyrics": "[Intro: Pharrell, Q-Tip, Busta Rhymes]\nLet me, let me, let me, let me\nLet me tell you a story, yes (uh uh)\nAbout a boy from the Tribe Called Quest (uh uh)\nI be that nigga that I think y'all know\nWith Mr. Busta Rhymes (A-yo, I'm in the studio)\n\n[Busta Rhymes]\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\n\n[Q-Tip]\nClose the door, 'ight, let a nigga rock\nCause we 'bout to eat real shit, not shit slop\nNigga can't say shit about this hip-hop\nCause I build dudes lanes while at pit stop\nBuilt they styles and they names, Frankenstein Rock\nIt's a high stake game, dudes are playing it\nI be questioning a lot of y'all who made it in\nJust move with the joint that we chartering\nMake you disappear quick, like you're part of wind\nThen laugh, ah-ha ha, and laugh again\nShorty, move a lil bit, I'm looking at your friend\nLet's get an ass shake for the beat, girl\nGet a lil eye wink, throw a tongue twirl\nWe gotta him locked smashed in, tied down\nWe on your block, turned hot spots to ghost towns\nA-yo, I'm tired of these niggas, Bus-a-Bus, now\nSay it to 'em\n\n[Hook: Q-Tip]\nThis is just, for the nasty\nA-yo, this is just for the sassy\nA-yo, this is just for the classy\nA-yo, this is just for the what? (Tell 'em now)\n\n[Busta Rhymes]\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\n\n[Busta Rhymes]\nPardon me, now, gimme room again\nIt's time to raise the level of the boom again\nNOW WHO'S THAT?! Bus-a-bus-a-bus rhyme\n(RAAAAAAAWR!!!) See, I ain't do that in a long time!\nSpitting shit, make the streets do more crime\nCop some cribs, cop a little more shine\nAlright, yea, shh shh, mm, uh, I pity y'all\nThe way I bang niggas, and how I shit on y'all\nAnd spit the slang bigger, make your label quit on y'all\nAnd do my thang, bitch, from here to Senegal\nWe getting a lot of money, me and my friend, Kammal\nI take your money too, I ain't a friend of y'all\nWith so much class, my shit will kill ya blood\n(jghejhejhehjeh) When I don't wanna rap\nAnd still I will smash and make the bitches make it clap\nAs soon as I'm finished with her, homie, I'll give her back\nSay it to 'em\n\n[Hook: Q-Tip]\nThis is just, for the nasty\nA-yo, this is just for the sassy\nA-yo, this is just for the classy\nA-yo, this is just for the what? (Tell 'em now)\n\n[Busta Rhymes]\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\n\n[Q-Tip]\nWhen the beat bang, and you're in the club\nWhen you listen and you feel a thud\nWhen you hear my voice, understand the love\nWhen the DJ spins it back, it's a friendly rub\nBut, when I'm behind, I cannot be kind\nWith your waistline, and the way you move\nLike a old break-beat, I'ma catch a groove\nOr like a old hip-hop joint, you Nice and Smooth (Come on, girl)\n\n[Hook: Q-Tip]\nThis is just, for the nasty\nA-yo, this is just for the sassy\nA-yo, this is just for the classy\nA-yo, this is just for the what? (Tell 'em now)\n\n[Busta Rhymes]\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know\nGirl MOOOOOVE!\nShow me what y'all know"}], "artist": "Q-Tip"}