{"artist": "C-Rayz Walz", "songs": [{"title": "In Your Soul", "album": "Who the F%@k Are You?", "year": null, "image": "https://images.genius.com/cbf6adcac105ff732aafdacf50af8e88.600x600x1.jpg", "lyrics": "[Sample]:\nIn your soul, there's a lullaby\n\n[Hook] [Samuel]:\nIn my soul\nIn my soul\nDa da da da da\nIn my soul\nIn my soul\nDa da da da da\n\n[Verse One] [C-Rayz Walz]:\nEverything's sacred in my left arm sleeve\nMy right arm, shoulder to palm read \"hip hop\" to me\nBoth limbs the perfect balance, Radio Raheem\nHere me doctor?\n\"In your soul\"\nAlways do the right thing\nLove and hate\nConfusion and understandin'\nAble to sit with it and still take it on a tangent\nA gut feeling\nIntuitive action\nProvin' this thing on the whole\nIs just a fraction of what's really in control\nWhat's within your soul?\nIn the music box, the pretty pixie dancing\nThe roots to the tree bark at the dog, noises chanting\nThe perfect picture of pain\nPosin' with poison\nThe bottom of sneakers I ain't right\n\"In your soul\"\nThese are the choices\nThe fish I eat\nThe voices I hear\nThat no one else does\nOr do they\nHallowed be the name say Deja vu to self buzz\nToo formless to shape up\nYoung fresh when I begin or without my shell\nI'll be within my soul\n\n[Hook] [Samuel]:\nIn my soul\nIn my soul\nDa da da da da\nIn my soul\nIn my soul\nDa da da da da\n\n[Verse Two] [Slug]:\nWhen I wake up to the sun shinin' down on my physical\nSometimes it's difficult for me to get my vision so\nI'm squintin' at the ceilin' waitin' for the paint to peel\nJust to reinforce the feelin' that I believe in is real\nBut my soul never needed validation\nSo I get up, stand up to get some elevation\nAnd I make my preparation for the day like any other\nHustle through the puzzle tryin' to guarantee my supper\nI'm not perfect\nThe proof is in the poison\nBut I try to keep the balance with the movement of voices\nNo lies let loose, truth recognize truth\nGospel, that's why you let it inside you\n(Boom)\nConsume\nYou're just a cocoon\nUntil the angel within gets to birth and bloom\nThe growth is more than just a flow and a track\nI don't front so my soul watches over my back\n\n[Hook] [Samuel]:\nIn my soul\nIn my soul\nDa da da da da\nIn my soul\nIn my soul\nDa da da da da\n\n[Verse Three] [Sum-In-1]:\nMy swagger that of a god\nI'm way ahead of my time\nAs soon as I hit the booth, I'm runnin' it down the line\nBelieve it, goin' for mine\nUndoubtedly in control\nYo, you got to feel this\n\"In your soul\"\nYo, see I'm pavin' the way to walk\nYou standin' on shaky ground\nWe hit you from different angles\nLike this is surround sound\nThe symphony's gonna play another classical piece\nInherit the soul of James, we takin' this to the streets\nSpittin' nothin' but rhythm, nothin' like helium I could lift\nLike a buffalo soldier, always give it the twist\nHip hop my first love, the moment it took hold\nNot a reason you can't breathe this\n\"In your soul\"\nYo, disregarding the hardships, I'm keepin' my game tight\nReincarnated, (died), came back the same night\nCelebratin' my life, can't stress over the enemies\nWithstand the test, I manifested my destiny\nStay up\n\n[Hook] [Samuel]:\nIn my soul\nIn my soul\nDa da da da da\nIn my soul\nIn my soul\nDa da da da da"}]}