{"artist": "Kid Capri", "songs": [{"image": "https://images.genius.com/223eae699f7fa6a530d91ded286f794f.600x600x1.jpg", "title": "Unify", "year": "1998-11-17", "album": "Soundtrack to the Streets", "lyrics": "[Snoop Dogg]\nI falls off into a party in the N.Y.C\nNiggas lookin at me strange but they lovin my chain\nBang bang, same thang, game came when I left em\nI do it by my lonely now I'm the Big Homie\n\n[Slick Rick]\nBut I'm his Royal Slickness, ghetto weakness, come Rick is\nThe one who expose cornball rappers with the quickness\nUhh, who bum from and who balls you hung from\nWouldn't give a fuck what part of the country you come from\n\n[Snoop Dogg]\nI'm Snoop Dogg, I'm smooth and imperial\nI wake up every morning to my Lucky Charms cereal\nTimes get drastic, yeah I'm a classic\nDogg Pound Gangsta chokin off that Boombastic\n\n[Slick Rick]\nNow put my verse on the first one-beat the herds come\nSo be careful cause my rap will make you eat your words son\n(Word to God) Scratch I?  Who the hardest to match (I)\nBright rewrite your still Garbage to Patch\n\n[Snoop Dogg]\nHaven't you heard?  I'm loose, shook the Feds like The Juice\nSnoop Dogg is a hundred-and-twenty-first proof\nFool usea deuce-deuce of some Genuine, Draft\nI'm genuine, like Vinny's whinin all about cash\nCash, cash, so indeed I got the weed\nAnd keep the lighter for the hash, has it\nEver been a time when you didn't have a dime\nAnd the only way to get it was to go and do a crime?\n\nChorus: Slick Rick (repeat 2X)\n\nMany underclothes hangin on the hoes\nSince (Snoop, Slick Rick) crushed anyone opposed\nLot of ladies - pop Cristal, toast to all those\nLike (Kid Capri) helpin to Unify both coasts\n\n[Slick Rick]\nI'm shredding your temple, none, 'head of the emperor\nWashed up, gang member?  Better remember\nI wipe my feet upon a rapper like a doormat\nI hit em -- where they sit around actin hardcore at\nThank God for the guardians - in light of this\nRappers always beg for me to show them who The Mighty is\nGats gonna limp, snaps on a kid\nThat always wanna start rappin (boy they're not gonna win)\nAnd wanna dash at lethal or evil\nCould a King bring style and class to black people?\nStick a whole log in and he buggin\nCause I - represent self, with my man Snoop Dogg and them\nI drop a pile of semen on em\nEven in a Yugo I could take they woman from em\nI make the hardest chew the kewl of this\nKid Capri, know the part of peasant, who The Ruler is?\n\nChorus\n\n[Snoop Dogg]\nI'm twenty-six.. still in the mix\nMy hair gettin longer, my game gettin stronger\nA nigga been on one, I thank God\nCause life in the city of stars is gettin hard\nAnd it's odd, for a G to get a job\nSo I'd rather steal and rob, and mob with my squad\nMy homie used to bang, now we follow Farrakhan\nUsed to read The Source\nNow all he read is the Holy Qu'ran\nTime brings change and change brings time\nListen to me hit you with this gangbang rhyme\nNigga, whattup, who up, YOU up!\nDoggy Dogg is on the mic\nI'm here to fuck it izzzup\nI give it to y'all, like you really got to have it\nDogg Pound Gangstaz, boy this shit is gettin tragic\nBut I'ma make me a grip and dip quick\nAnd fuck with my nigga Kid Capri on this G shit\nDial tail and bail with my nigga Slick Rick-y\nAnd all you niggas talkin bullshit can just miss me\nCan't twist me, you fuckin paper haters\nI'm dippin in my nine-eight gold Navigator\nI'm dippin like a lo-lo\nBouncin, smokin ounces, fo' sho' doe\n\nChorus 1.5X"}]}