{"artist": "Preme", "songs": [{"album": null, "title": "Colors & Commas", "image": "https://images.rapgenius.com/ec30495167ebad32dbda9f93d673aaa3.500x500x1.jpg", "lyrics": "[Intro: Troy Ave]\nHad to turn the levels down a lil' bit\nI got it\nBSB\nP. Reign what up my G\n\n[Verse 1: Troy Ave]\nTroy Ave young boss\nI'm on another level like Mars\nSee me up like the stars\nI got a spaceship for upcall\n6 Series Bimmer, it's not mine but fuck it it's my dawgs\nI rap [?] when I floss but when I'm on the crib with these hoes\nI'mma make a call, get a car for my man\nA nigga ride and drop [?]\nPull up to the spot, put her hand in my pants\nShe pull a nigga cock put her head in my [?]\n[?]\nI made most of my money off crack\nI ain't gossip, I'm just stating facts\nI got that Dolce&Gabbana [?]\n9mm ciggy, she finna teed up her name Tiggy\nOkay I changed her name to \"be discret\"\nHer name really Chanel and she sneaky\nShe in with yo boy when the man ain't home\nHe hittin' the girl like : Where she goin'?\nBitch [?] act to a bestfriend phone\n[?] and don't\n\n[Hook: Troy Ave & P. Reign]\nI be sub-stabbing in my Coogi\nKillers and commas lucci\nWon't let her hope it seduce me\nMe and my dawgs we salugi\nTake her for some fun in the 6\nShe just wanna come with the clique\nTold Gucci pull in the whip\nNigga I got guns in this bitch\n\n[Verse 2: P. Reign]\nTalk to me, talk to me\nTake the leash off your bitch, tell her walk to me\nBig dawg man these puppies can't bark with me\nCheat the club like Atlanta brought the hoax with me\nImma bless you know I keep dawg with me\nStill a lot of nigga [?] the shark with me\nGot your shawty at the window yellin' \"Run Ricky\"\nAnd fuck it if I get caught Imma call Drizzy\nI'm the nigga to see, I still get it for cheap\nFrom like a year ago with me [?] yellin free [?]\nNever mention my name, never mention my team\nOr your head on the curb, make you swallow your teeth\nNigga pull up and see, it ain't nothin' to beef\nKnow we got expensive tastes but the bullets are cheap\nImma do this one for Yams, [?]\nShe want a young wavy nigga made her swallow to see\n\n[Hook: Troy Ave & P. Reign]\nI be sub-stabbing in my Coogi\nKillers and commas and lucci\nWon't let her hope it seduce me\nMe and my dawgs we salugi\nTake her for some fun in the 6\nShe just wanna come with the clique\nTold Gucci pull in the whip\nNigga I got guns in this bitch\n\n[Verse 3: Troy Ave & P. Reign]\nMMC\nMoney Murder Crew\nIt's a proven fact and we'll murder you, hypothetically speaking\nI'm going to jail if the police [?]\nInto my past niggas I done pass\nTell to my lawyer I beat it with cash\nOff cookin' up mash, potato [?]\nSwear to God, I thought I was gon get the 8080\nMe, a nigga so blessed, I ain't riding a GSL\nI came from the bottom now a nigga doin' damn well\nLately at the top, pay me you'll get pot\nUsed to work on the block now I'm watchin' the stock\nI can handle the rock like I handle the Glock\nOkay come see I'm [?] with the shot\nShout out my nigga cause you know that's my nigga\nIf I tell you I love you, girl you know it's the liquor\nOnly answer for money so if you're callin' me nigga\nThen you better say \"Cheese\" like you pose for the picture (Woah)\n\n[Hook: Troy Ave & P. Reign]\nI be sub-stabbing in my Coogi\nKillers and commas lucci\nWon't let her hope it seduce me\nMe and my dawgs we salugi\nTake her for some fun in the 6\nShe just wanna come with the clique\nTold Gucci pull in the whip\nNigga I got guns in this bitch", "year": null}]}