{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/643d9675eedcaa5319fa306772e6375b.479x479x1.jpg", "title": "Lush", "year": null, "album": "63", "lyrics": "[Hook - Kool A.D.]\nI wanna tell the world, I wanna tell the world, I wanna tell the world\n\n[Verse 1 - Kool A.D.]\nLook how the ink sink into the napkin\nKool A.D., professional rapper\nVisualize and make it actually happen\nI'm a biter plus a writer for myself and others\nBigging up my cousins to the best of my ability\nWhat I lack in strength I make up for in agility\nPeep the fragility of man and his materials\nKool straight murdering dudes, serial\nShouts to Amaze 88, the imperial\nMagisterial\nAnd you, the young listener, how do I appear to you?\nHow many human beings on earth still fear the truth?\nAnd who cares? Like I said one time in Australia\nI'm Gil Scott-Heron, I'm new here\nI do it daily, bruh\nGive me two shots and two beers\nEvery year is a new year\nPlease marinate on the numeric and linguistic facts of that statement\nAs you gaze into the cracks of the pavement\nDon't act your age or your race or act basic\nDon't act sexist or classist or racist, right?\nShouts to Das Racist\nAnd all the fools that paid money to see exactly how we laced it\nYou helped me pay rent and eat food\nSo I could say shit for a living\nEverybody else, ya'll suck, heh, nah\nLike the origins of Thanksgiving, get it? Nah\nBut still I give thanks to the ranks of the living\nDespite the fact that banks kill to make a killing\nI just want to be on the bill, I don't even give a fuck about the top billing\nI'm in the building\n\n[Hook - Kool A.D.]\n\n[Verse 2 - Ne$$ of Weekend Money]\nSlow your roll nigga, pop tire\nFuck Dylan, nigga I spit hot fire\nI'm like Krylon niggas sprayed on the watchtower\nAll on the White House wall spray black and brown power\nThen light the little (?) cocktail mami that pop the riot\nThis real rap, ya'll fuck niggas is Oscar Meyer\nPhoney baloney, homie, on top of that you corny, homie\nNo need to phone for me, killer, like you a live wire\nMore like a liar liar, little bitch, Miley Cyrus\nYou more pussy than a female gynecologist's vagina\nBottom line, you ain't that nigga, you wack nigga\nMe and Vic run raps around you rap niggas\nThat's what it is"}]}