{"artist": "Pitbull", "songs": [{"album": "M.I.A.M.I.", "title": "Culo", "image": "https://images.genius.com/8ce66d419f15b736ff6d46728de4bb72.500x500x1.jpg", "lyrics": "[Intro: Lil' Jon & Pitbull]\nYeah, yeah, yeah, yeah, yeah, lets go (Let's go)\n(¿Como?)\nRight about now, we need all the ladies to hit the danceflo'\n(Ahora que si, Dominicana)\nIf you got a big ol' booty\n(Ahora que sea una mexicana)\nAnd you like to set that motherfucker, let's go!\n(Ahora que sea una boricua)\nPitbull, Lil' Jon, Heey, Heey!\nAhora que si\n\n[Chorus]\nEsa jevita esta enterita, tiene tremendo culo\nEsta tan linda, esta tan rica y tiene tremendo culo\nQue rica chiquita, pero que importa si tiene tremendo culo\nHazme el favor y meneate chica, tienes tremendo culo\n\n[Verse 1]\nPull up to the club, walk in then I pull up to the bar\nGet drinks then I pull up to a broad\nLet her know what it is, how it is, why it is, what it is\n(Hey hey hey hey)\nI ain't got time for no games\nI'm hopin' mami that you feel the same\nI got what you need to feel the pain\nHere's my number call me when you're up for an even exchange\nFeel me, let me see you do that dirty dance, dirty dance\nMami feel me, let me see you touch your toes\nOr shake that thing and talk wit' your ass, feel me\nAll my chicos, all my Jamaicans (Put your hands up) all my haitians\n'Cause they know I'mma rep' 'til the day that they kill me, pull up!\n\n[Chorus]\nEsa jevita esta enterita, tiene tremendo culo\nEsta tan linda, esta tan rica y tiene tremendo culo\nQue rica chiquita, pero que importa si tiene tremendo culo\nHazme el favor y meneate chica, tienes tremendo culo\n\n[Verse 2]\nMami got the ass and thighs like Trina and J. Lo\nMultiply it she's off the chain, off the glass, off the flip\nAnd with a couple more drinks I'll be off the hip maaayn\nI'll be wearin' her out\nAnd when I'm finished paramedics gon' be carryin' her out maaayn...\n(That's right)\nThe night is young, and if you shave I'll give you some of this mighty tongue, hey...\nBe easy, go ahead please me, talk to me sleezy baby (Yeah)\nI wanna freak, a monster in bed, last thing I need is a lady\n\n[Chorus]\nEsa jevita esta enterita, tiene tremendo culo\nEsta tan linda, esta tan rica y tiene tremendo culo\nQue rica chiquita, pero que importa si tiene tremendo culo\nHazme el favor y meneate chica, tienes tremendo culo\n\nEsa jevita esta enterita, tiene tremendo culo\nEsta tan linda, esta tan rica y tiene tremendo culo\nQue rica chiquita, pero que importa si tiene tremendo culo\nHazme el favor y meneate chica, tienes tremendo culo\n\n[Bridge: Lil' Jon]\nCulo, hey, hey, hey, hey, shake that shit, hey\nHey, hey, hey, hey, shake that shit, hey\nHey, hey, hey, hey, shake that shit, hey\nHey, hey, hey, hey, shake that shit, hey\n\n[Chorus]\nEsa jevita esta enterita, tiene tremendo culo (let's go now)\nEsta tan linda, esta tan rica y tiene tremendo culo (hey)\nQue rica chiquita, pero que importa si tiene tremendo culo\nHazme el favor y meneate chica, tienes tremendo culo (com'on)\n\nEsa jevita esta enterita, tiene tremendo culo\nEsta tan linda, esta tan rica y tiene tremendo culo\nQue rica chiquita, pero que importa si tiene tremendo culo\nHazme el favor y meneate chica, tienes tremendo culo", "year": "2004-07-06"}]}