{"artist": "Cage", "songs": [{"title": "Perfect World", "album": "Hell’s Winter", "year": null, "image": "https://images.genius.com/35a6c4fadae054a62d3335575b662535.500x490x1.jpg", "lyrics": "[Cage]\nMoney in the bank..\nMoney in the bank..\nI woke up president Weatherman keep the weapon in\nThe same spot that got honey spillin her estrogen\nLookin' to molest me in the back of the Lac\nI got a million plus downloads, fuck a plaque!\nAnother thing I have is a little fascination\nFor girls that use my music to make relations\nTake, ummm, for instance so persistent\nHad me doin' shit to her so unchristian\nInto pissin' and strangulation masons\nKeep callin' me about my applications\nCause I dropped it off then thought knock it off\nYou could start your own club to plot and stalk\nPerforated thinking I see shit spastic\nPenned under a microscope into a book of acid\nTransform the high to a narcotic logic\nFlying with maggots in the cock pit\n\n[Hook: Cage]\nMoney in the bank, it's a perfect world\nNew car shotgun it's the perfect girl\nEat your pills up try to work this world\nAnd have no malfunctions to hurt this girl\nMay or may not really deserve this world\nTo reveal that you really got a worthless girl..\nDon't be nervous, girl! (Okay okay)\nDon't be nervous, girl!\n\n[Cage]\nThere's a thin line between love and a fuck\nAnd how drunk she got to be to put it in her butt (Okay okay)\nStruts in her seven jeans I follow deception\nTo the suicide diner to feed my depression\nI need a girl to make me crash my Benz up\nA whistler with a blade that'll cut all my ends up\nI'll pop in every direction to catch a court case\nEast bay, West Nile, south park to north face\nMy aunts smokin' I got her crack\nI had a kid to feed then I wrote \"Agent Orange\" on a Whopper wrap\nThat's why I has it my way like a barkin pit\nOnly know the day by which side of the street I park my shit\nMake it awkward quick I'm achin' to bloom\nBut they all wanna see me eat how I ate in the womb\nInspired by Doom death and metal objects\nLike a young Zev Love X readin' Marvel Comics\n\n[Hook: Cage]\nMoney in the bank, it's a perfect world\nNew car shotgun it's the perfect girl\nEat your pills up try to work this world\nAnd have no malfunctions to hurt this girl\nMay or may not really deserve this world\nTo reveal that you really got a worthless girl..\nDon't be nervous, girl! (Okay okay)\nDon't be nervous, girl!\nCome on, girl, don't be nervous, girl! (Okay okay)\nDon't be nervous girl!\n\n[Cage]\nI take a look around soak up my environment\nRing it out into the mic and pay rent\nClips holdin' V.I.P.'s to Jesus\nWhen the birds pressed up on the glass like Grey Goose\nScience fiction with too in depth raps\nRide tsunamis through new left tracks\nSemi colon my brain geeked out and swollen\nNo glass just nerd wraps to roll dro in\nIn these last days before I drop, bleed or end\nI'll serve til they kill me like Scott Peterson\nI spit ugly so many rappers love me\nThey rush me at shows tryin to kiss and hug me\nIt's truth or dare but y'all keep pickin truth\nCause the know I'm goin' dare them to come to New York, oops!\nI spilled beer on the board fine me later while I conspire this Illuminati paper\n\n[Hook: Cage]\nMoney in the bank, it's a perfect world\nNew car shotgun it's the perfect girl\nEat your pills up try to work this world\nAnd have no malfunctions to hurt this girl\nMay or may not really deserve this world\nTo reveal that you really got a worthless girl..\nDon't be nervous, girl! (Okay okay)\nDon't be nervous, girl!\nDon't be nervous, girl! (Okay okay)\nDon't be nervous, girl!"}]}