{"artist": "Big Daddy Kane", "songs": [{"lyrics": "Enquiring minds wanna know, did the champ retire\nSo here I am, boomin like an amplifier\nI clear my throat, then I float like a boat\nNote for note, what I wrote you can't quote or even tote\nRaps are too heavy, sharp like a machete\nPass the microphone, cause Kane is all ready\nGrippin to play the part to prove that I'm in command\nThe Biggest Daddy of em all, and oh, Kane stands for\nKing Asiatic, Nobody's Equal\nOr Non-Equivalent, or Natural Ebony\nOr Now Effective, or Never Ever\nPick your definition and put it together\nCause it still comes out tastin' like chocolate\nWith the finesse MCs never got with\nCause none of them want me to touch the mic first\nThey know that it only takes Kane one verse\nSo here's the microphone, show me what you can do\nAnd uhh {yawn} wake me up when you're through\nJust so I can go and flow and throw a blow\nTo show a pro and let em all know\nThat any MC trying to be this lyrical\nShould go ask Smokey Robinson for a Miracle\nI wouldn't let a rapper go one round\nI'm knockin them down, just like Jim Brown\nSo Mister Cee, let the music play\nAnd here's what I want y'all to say\n\nOoh! (c'mon) Aah! (c'mon)\nNah-Nah-Nah, Nana (c'mon like you should)\nOoh! (c'mon) Aah! (c'mon)\nNah-Nah-Nah, Nana (uhh!)\nOoh! (oooh) Aah! (aaah)\nNah-Nah-Nah, Nana (sing that song!)\nOoh! (c'mon) Aah! (c'mon)\nNah-Nah-Nah, Nana\n\nHere's a rap avalanche, MCs travel and\nRun-run for shelter, cause they don't have a chance\nAny MC caught talkin' out of turn\nI straighten em out just like a perm\nNow let's take a second, just to recollect it\nGive a little shout to the rappers that's out\nLike all the East coast, MCs of today\nFrom Run-D.M.C. on down to Kid'n'Play\nThe ladies like Salt-N-Pepa to Latifah\nWho showed the power of a woman and me a believer\nNow backtrack with the musical jewel\nAnd say peace to the old school\nAnd all praises due to the L.A. crew\nYou put your state on the map and kept bringin rap through\nI can't forget the brothers that's down in Miami\nYou're still 2 Live if you never get a Grammy\nCause personally I feel who really needs that stuff\nIf you ask me, it's just a bunch of makeup\nThere's a lot of caucasian kids that don't even know me\nCause every Billy and Joey is another David Bowie\nI guess I used the wrong tools in my rhymes\nCause when I nailed my clock, it didn't say Hammer Time\nThat's not a diss to my Oaktown friend\nJust telling you how it is in the musical biz\nCause I make sure that every rapper in the industry\nBecomes a friend of me\nAnd Mister Cee, let the music play\nAnd here's what I want y'all to say\n\nOoh! (oooh) Aah! (aaah)\nNah-Nah-Nah, Nana (nanana)\nOoh! (c'mon) Aah! (c'mon)\nNah-Nah-Nah, Nana (c'mon won'tcha c'mon)\nOoh! (ohhh) Aah! (uhhh)\nNah-Nah-Nah, Nana (sing that song!)\nOoh! Aah!\nNah-Nah-Nah, Nana", "image": "https://images.genius.com/f2f313ca094b7792e9d4a77d69784d4d.475x473x1.jpg", "year": null, "title": "Ooh, Aah, Nah-Nah-Nah", "album": "Prince of Darkness"}]}