{"songs": [{"image": "https://images.genius.com/f2c84113d107143591f8c17cee3ee1f6.500x500x1.jpg", "year": "2002-10-01", "title": "My Name", "album": "Man vs Machine", "lyrics": "[Intro: Eminem]\nThis ain't beef man\nI don't know what the fuck to call it\nBut no beef\nWhat up, X?\nJust hit 'em\n\n[Verse 1: Eminem]\nI float like Big's spirit in this bitch, I'm ghostly\nRush me, 'cause you ain't gonna live to roast me\nI'll have my motherfucking ass kicked by Moby\nIf I let some bitch in the can like 'Bis cop over me\nTo do war and try to bring my crew back down\nI'll never stoop to that level to do that now\nI got a new cat, this time I'm pulling two gats out\nWith bullets (*bang*) I finally got something to shoot at now\n\n[Verse 2: Xzibit]\nLet's see who got they city on lock\nLet's see who got the better aim with the Glock\nLet's see who come out on top\nLet's see who really want their name in the streets\nLet's see who wanna die the same time as me\nAnd make ends meet\nNow was I blessed with a gift or cursed with a curse?\nI follow (Ugh!) hearse after hearse with verse after verse\nAnd I'll be damned if I let Billy \"Dance\" Dupri\nOr anybody swing an axe at my family tree\nSo now!\n\n[Chorus: Nate Dogg]\nI love it when you niggas be talking, saying my name\nSeems like your mouth is not connected to your brain\nTwo-zero-zero-three, and shit, it ain't the same\nBetter have a strap, my nigga, simple and plain\nPut your nuts on the table, my nigga, let's play the game\nHurt you so long, you'll be a-ddicted to pain\nI don't wanna hear what you meant, do not explain\nRight before you lay in your coffin, ho, say my name\n\n[Verse 3: Xzibit]\nWhy do you hate me? I came from nothing\nBlood, sweat, and tears, you did not create me\nHow can you doubt me? You don't know shit about me\nThere'd be no West Coast without me\nCut with the bullshit, I struggle for survival\nAnd now you tryna act like my rival?\nWatch what you say, partner, it's a small earth\nDon't play games with your life, nigga, it's not worth...\nAll the pain (All the pain), all the agony (All the agony)\nAll the horror (All the horror), all the tragedy (All the tragedy)\nPut your hands up people, it's time to fight now\nI beat holes in your chest, remain hostile\nThreaten my life? (C'mon!) One day, you'll understand\nThey say that pride is the sign of a foolish man\nSo who the FUCK! you think you talking to?\nLive and direct in the flesh, I'm right in front of you\n\n[Chorus: Nate Dogg]\nI love it when you niggas be talking, saying my name\nSeems like your mouth is not connected to your brain\nTwo-zero-zero-three, and shit, it ain't the same\nBetter have a strap, my nigga, simple and plain\nPut your nuts on the table, my nigga let's play the game\nHurt you so long, you'll be a-ddicted to pain\nI don't wanna hear what you meant, do not explain\nRight before you lay in your coffin, ho, say my name\n\n[Verse 4: Eminem]\nI never really smashed on Jermaine's ass, Dre smashed him\nNobody ganged up 'til he came back and jacked him\nI never really brought it to his ass, I tapped him\nI could have been like Treach, poom-papped and slapped him\nPurple, for mimicking him with two rapping Urkels\nI could have snapped, took it past rap and hurt you\nBut I didn't, I kept it on wax and served you\nI square dance 'cause I'm sick of rapping circles\nAround these clowns, steady trying to call me out\nIt's like I'm listening to motherfucking dogs meow\nYou'd probably do better trying to come and stomp me out\nYou don't want it with rap, this is what I'm all about (C'mon!)\n(I'm) No gangsta, you ain't either\n(Will) But I know that I spit ether\n(Not) I should've crossed your belly\n(Lose) Show you I'm not R. Kelly\n(X!) Pass me the weed\nI'ma put my ashes out on his ass for the last time, man:\nWatch your fucking mouth\n\n[Chorus: Nate Dogg]\nI love it when you niggas be talking, saying my name\nSeems like your mouth is not connected to your brain\nTwo-zero-zero-three, and shit, it ain't the same\nBetter have a strap, my nigga, simple and plain\nPut your nuts on the table, my nigga, let's play the game\nHurt you so long, you'll be a-ddicted to pain\nI don't wanna hear what you meant, do not explain\nRight before you lay in your coffin, ho, say my name\n\n[Outro: Eminem]\nIt's the last time, man\nI'm through"}], "artist": "Xzibit"}