{"songs": [{"year": null, "image": "https://images.genius.com/d71fb2e2181ad26fc82409299e161bab.460x460x1.jpg", "title": "M.O.B. (Remix)", "album": "Mob 4 Life", "lyrics": "(*talking*)\nYe-yeah, what up world, it's your boy\nC. Wiggity-Whoadie-Weezy-Ward, one more 'gain\nTha M.O.B. General, I'm back with the Mob boss Sensei\nWe got this new \"Mob 4 Life\" cd, we want y'all to check out\nRaw and uncut, some stuff we put together for the streets to bang\nFrom the South to the North, from the East to the West\nI wanna thank all the haters (thank ya)\nAnd ery'body else, who put forth to this here project\nRoll with us on this one, one love let's go\n\n[Hook - 2x]\nIt's M.O.B\nMoney Over Bullshit, you know me\nKeep it low-key, what big bro told me\nThem niggas don't know, what them niggas don't see\n\n[Big Pokey]\nIn this rap game I come, from the back of the pack\nNow they respect my work, like I'm packing a mack\nEverytime I sound check, I'm cracking the deck\nOn track split wigs, like a axe in the hat\nYou know how I act in a Lac, I'm a hog\nT.V.'s back in the back, got to fall\nTexas boys crawl, like a nigga with his legs cut\nK bullets hit niggas, and they edge up's\nPay attention, focus nigga\nThird, Fourth and Fifth Ward rogus nigga\n4-4, Southwest vaulters nigga\nBetter have that on your mind, when you approach us nigga\nA bitch'll jump fly, when they dose your hitter\nYou G about it, be about it, you supposed to get her\nI get a broad pimp of grain, I need to be in the Pimp of Fame\nThey think it's hard, but it's simple mayn\n\n[Hook - 2x]\n\n[D-1]\nIn this rap game, I run through the hard and the whack\nAnd my verses go together, like cigars in a sack\nLeaving out the club hit the crack, alarm on the Lac\n18's beating, some think I got a bomb in the back\nBecause I'm M.O.B\nAggravated assualt, and bodily injury\nTo any nigga, that try to offend me\nPo-Yo, C. Ward and Grim Reap'\nBitch, don't forget Dre Day\nI'm on the grind, everyday is pay day\nY'all bitch niggas, better make way\nCause I'm some'ing like A.I., with a A.K\nAnd to the S.U.C\nH.A.W.K., and Mike D\nBig Moe, Z-Ro and Keke\nIf it wasn't for y'all, I wouldn't be who I be\n\n[Hook - 2x]\n\n[Chris Ward]\nIn this rap game, I got the best scared to feature me\nCause they know that I eat up the track, just like a creature see\nI spit ether, lethally\nEvenly I violate, every law illegaly\nI'm one of the ones, that be running the South\nBut I got so many connects, I even be running through the North\nYou think I'm lying, just ask the Boss he'll tell ya\n(C. Ward is a quiet hustler, but he'll sell ya)\nWhatever you wanna buy, or whatever you wanna try\nAnd if you got plex (fuck you), it's whatever you wanna die\nAnd when the laws is on the creep, and I'm feeling the heat\nA nigga dress fresh, like I'm at Dyatona's Beach\nWhite lenin slacks, shirt and shoes is peach\nWe are the definition, of Newvo Reach\nThat's newly rich, we new leaders shit\nC. Ward, Sensei and D-1 you bitch\n\n[Hook - 2x]"}], "artist": "Big Pokey"}