{"artist": "Andre Nickatina", "songs": [{"title": "Awake Like an Owl", "album": "Daiquiri Factory: Cocaine Raps, Vol. 2", "year": "2000-06-06", "image": "https://images.genius.com/938e1205f8900a38bea9cfb2f96124ae.220x220x1.jpg", "lyrics": "\"What time is it!\"\n\nThis is one of those, A1-Yola raps\nStick in ya mind, stick in ya mind, stick in ya mind\n\n[Verse 1]\nWhen you up all night\nYou see things you shouldn't have saw\nBecause the night gets raw\nDrama is thicker than Skippy's peanut butter\nImagine the worried thoughts of a young man's mother\nFeelin's empty, Love don't live here anymore\nAwake like an owl at a quarter to four\nDon't blink, a Caddy just ran a red light\nBumpin' thug life, man I blend with the night\n\nThey call me greedy\n(...?) to get a girl a beaty\nIt's Andre Nickatina\nI'm like a genie in a beanie\nEl Dorado 88 Cadillac, all black\nCopy cats try to match\nBut they style ain't exactly the same\nSomebody said, \"Freeze, it's a raid!\"\nYou know cops are comin' when a brotha smells\nGlazed doughnuts, hold up\nPatna fill it to the rim\nMe and money go together like a feather in a brim\n\nI'm a magician\nSome say my (...?) ain't the same but I ain't trippin'\nA girl be yellin (...?) but I don't listen\nCrooked crow\nPlayas seem to like my style\nWhy's that killa whale...\n\n[Hook]:\nI stay awake like an owl, Hoo!\nI stay awake like an owl, Hoo, Hoo!\nI stay awake like an owl, Hoo!\nI stay awake like an owl, Hoo, Hoo!\n\n[Verse 2]\n(What are you baby?)\nI'm a Raider, camouflaged in silver and the black\nTryin' to blitz through the line for the quarter back sack\nOf the money\nI dress like it's cold, not sunny\nBut slyer than a (?) fox tryin' to catch a bunny\nIn the snow\nI'm try'na get paid like a ho\nOr better yet the pimp that's rakin' in her dough\nLike a baker\nBut check it, who's the king of the caine?\nAnd what's that tiga's name with the Macintosh computer brain mind\nOr should I say mine?\nSometimes I gotta lie to protect my crime\nI'll call my lawyer!\nBail bonds keep me on the streets\nThree in the mornin' I'm at the club with the freaks\nBut I got hawk eye\nMeanin' that the joint is bein' watched\nDrinkin' with the killas that be pushin' up the cost\nFor the drought season\n...(?) season\n...(?) up they best\nBut those be the ones that don't have to rest\nLike an owl...\n\n[Hook]\n\n[Verse 3]\nI set a trap, I have to spin a web like a spider\nDon't strike matches, hate child-proof lighters\nStay awake\nWitness how I pick up the pace\nFirst I see a girl's butt, then I look at her face\nI can't explain\nI'm eatin' garlic bread with the steak\n... (????) .... for the narcs\nBrothas droppin' cream by the fiends when they part\nI'm like a sentinel, known to be the principal original\nLookin' for the road that made it (...?) they call it federal\nI'm a general, but yet at times I blaze with my lieutenant\nPopeye, (...?), who got the spinach?\nCough, choke, feelin' no remorse for the roach\nChoppin' up freaks as ya lounge with your folks\nPlayin' dice, you take a chance at the crap game\nIt's all about the money baby, it's the rap game\nAnd I'm an owl...\n\n[Hook] x2\n\nUh... And I'm out\nUh, Shit\nIt's a planned emergency, (it's a planned emergency)\nIt's a planned emergency, (it's a planned emergency)\nWhat, STOP!\nShit, fade me, fade me, fade me, fade me, fade me...\n\n\"What time is it!\""}]}