{"artist": "Canibus", "songs": [{"title": "702-386-5397", "album": "For Whom the Beat Tolls", "year": null, "image": "https://images.genius.com/785071b78cb6153b8a1049cd734d6437.500x500x1.jpg", "lyrics": "[Intro: Canibus]\nYea, yea Can-I-Bus, Mic Club\n(Nothing to Prove, it's all love)\n\n[Canibus]\nI bust through like Sputnik 2\nThis is man's best friend, whoopty-woo\nThe flag is black, red and blue\nTroops shoot from the hoopty, dogs jump out of dooly\nBut it'll take more than that to move me\nLike; wireless mics for tireless nights\nFirefights inspire my life, why do I write?\nTwenty year Hip Hop vet, they perceive me as a threat\nThey manifest beads of sweat\nExamine the blood trail, squeeze trigger\nPuss drips out of the thumbnails, I smell like gun shells\nPolonium, pandemonium with a dose of unknownium\nThe Soviet Hugo Rodier\nFourth generation roper report\nEverything I was taught bore resemblance to my thoughts\nThe truth and design of the Guggenheim rhyme\nWhere every line is weaponized then applied\nMob shit, target acquisition is sick\nI don't miss when I twist the 556\nStand there with arms folded, firearms make me look large and bloated\n(\"I'ma gonna have to project my voice\")\nEquipment check, church bells chime\n(\"Some of this stuff might get intense\"), one more time\nJust kill 'em 'Bus, ain't nobody around to witness nothing\nHeavens devil strangle Hell's Angel with a mic cable\nThen J Wells came through\n\n[Sample from Nas @ the L.A. Listening Party on December 14th, 2006. There are two voices.]\nVoice 1: \"Yo, the niggas that use to have a nigga a little nervous was like; B.I.G., 'Pac...\"\nVoice 2: \"Right\"\nVoice 1: \"...Even Canibus, like, Eminem but them niggas got me like...\"\nVoice 2: \"If we go at it dawg we gotta go HARD!\"\n\n\"Voice 1: \"Yo, the niggas that use to have a nigga a little nervous was like; B.I.G., 'Pac...\"\nVoice 2: \"Right\"\nVoice 1: \"...Even Canibus, like, Eminem but them niggas got me like...\"\nVoice 2: \"If we go at it dawg we gotta go HARD!\"\n\n[Canibus]\nYea, yo\nI support a secure change of custody\nDon't trust the beat, trust me Canibus the emcee\nWithout moving my neck I turn to the left\nYes I am the best, you will learn to respect\nTill your death, Hip-Hop is the body, you are the chest\nI am the vest, we are sworn to protect\nThis behavioral bomb, rewritable radio songs\n\"What station is your radio on?\"\nMy training is worth millions\nImam death squads rush the building\nFrom the front line with Prince William\nI am Prince Williams, exercise cover and concealment\nProhibit the media from filming\nNever in the moment, always thinking of the Omen\nOur poor soldiers, nobody told them\nInoculate; I postulate not to wait\nDrop to your face, the active component will not break\nMy Armenian friend tried to pay me in Yen\nI threw the money in his face and said \"Pay me again\"\nYou wanna talk to the kid? Enter this ten digit grid\nI'll explain to you what I did\n702-386-5397, call, leave a message\nY'all niggas can't rap, so why you wanna go and do that?\nYou move the crowd, I move the map\nThe defiant mad Lion, triumph over the rulers of Zion\nFuck your Blood Diamonds, I'd rather laugh dying\nMiners in the mine shaft crying\n'Apocalypto' from GITMO, I'll clash with the last Mayans\nThe Sun stone science, the black, red and blue alliance\nJump through the fire, you'd be a fool to try it\nThe fire suit don't fit, NO SHIT!\nMy Saratoga suit got a customized grip\nWith a batwing released for both wrist and both feet\nBlazing hot, but I don't feel no heat\nHip-Hop's master chief, \"Here, have a seat\"\nIn the mic booth where I hang slabs of meat\nBefore, during, or after the debrief\nI'll crack your teeth, don't talk unless you asked to speak\nThe Rift Valley Fever symptoms could last for weeks\nWe call it hell in a cell, watch the bastard tweak\nReach 80° degrees North, 14° degrees East\nBeneath the ice sheet lies the Spitsberg Beast\nTransmission distorted, injuries reported\nMission aborted, follow your orders, move forward\nBRAVO! I fell in love with Suzanne Malveaux\nOn the down-low, now you know\nShe talked to the Canibus man\nCode name: Javelin Fangz\nWith 'Nothing to Prove' to the rap fans\nCould elaborate further but suffice to say\n\"Goddamn that emcee made my day\"\nHe's a butcher, a baker, a vapor box maker from Jamaica\nStill talking trash to the haters\nI'll clash with the greatest, this is major manual labor\nBeta test the data with blue lasers\nCanibus wave analysis, it's 'Nothing to Lose' in Los Angeles\nSuing Hip-Hop for the damages\nG-4's, 10.4's, still conscious but not for long\nMissile lock-on; stop the song"}]}