{"songs": [{"lyrics": "[Verse One]\nOut the gate, four-twenty minutes late\nSorry about the wait, I was in the back posted\nTrees got roasted, and I got toasted\nThe party gon' still get hosted, let's go\nGrab somebody, stab somebody\nI'm just kiddin have a party, laugh with somebody\nWe gon' break it down whether you like it or not\nI got a human beatbox goin block to block\nAnd we gon' kill that noise, chill dem boys\nDeal with them toys, good brother what's crackin?\nOpen up the candy store and give 'em a taste\nMy name's Ace, homey you about to get laced\nMan!\n\n[Hook: repeat 2X]\nY'all people done lost y'all minds\nThe thought never ran across y'all minds?\nY'know the good shit's hard to find (c'mon)\nWell this here's gon' blow yo' motherfuckin brains out\n\n[Verse Two]\nWell here we go, two-thousand fo'\nAnd my flow's still tighter than what yours mighta been\nShoulda took a vitamin, or a Vicadin\nAce is on the mic again, door men invite 'em in\nThis one's on me, this party here's free\nAs long as you don't make us, bumrush your energy\nIt's rum on the house, don't get dumb in the house\nCause who the fuck wanna have a gun in they mouth\nLife is painful but the party is packed tight\nCourse some people don't, know how to act right\nAnd for the people's delight, I'm keepin it wrapped tight\nI'm keepin my sack tight - is that right? That's right\n\n[Hook]\n\n[Verse Three]\nNow rockin this mic is natu-ral\nFor me to come weak is not allowed\nLivin my life underneath the ground\nI control the sound, I hold it down\nMy name is - Ace One, six foot one\nDon't leave the studio until the mix get done\nI do it for kicks, I do it for fun\nI do it all night 'til the mornin sun\nSee it ain't no question of who is that\nIt's just the connections of me and my rap\nWe just too good together baby it's a natural fact\nThat when I, touch the M.I., there ain't no turnin back\nIt's like\n\n[Hook]\n\n[Verse Four]\nNow homey's got a whole lot on my mind\nThat's cause I'm always, on the grind\nAnd if I ain't on the mic then I'm on my own time\nOr I could be on one or I could be online\nBut I'm not a web hog, I'm just a mic hog\nI'm fin' to set it off for, all my dawgs\nAnd for the people that believed in me, thanks a lot\nI owe it all to you, everythang I got\nI'm glad I could be here to open up shop\nAnd glad I made it past twenty-six without gettin shot\nI think I done found myself a spot\nRight between a hard place and a rock\nI bet you don't think this is all that hot\nBut you can shake the spot, whatchu got the game locked?\n\n[Hook]", "title": "Lost Your Mind", "album": "Love and Hate", "image": "https://images.genius.com/8aabb2266f1dc21cbed33421bd2b76e2.220x220x1.jpg", "year": null}], "artist": "Aceyalone"}