{"songs": [{"image": "https://images.genius.com/8e0e23387237dba2d30a8940f7e1740a.550x550x1.jpg", "album": "Glitter", "year": "2018-03-23", "lyrics": "[Verse 1: 070 Shake]\nI saved you from the ring, from the ring of fire\nOoooo, now you let me fill all your desires\nDoes this make you think? Does this make you shout?\nDoes this make you think? Does this make you think?\nDoes this make you shout?\nOpen it up\nEvery time you blink, every time you blink\nThe darkness is around\nRoaming through the streets, lonely as can be\nEvery time you sneeze, God don't bless you, God blessing me\nAnd don't be walking all alone\n'Cause these thoughts are unpure just like yours\nDon't be walking all alone, don't be walking all alone\nDon't be walking all alone\n\n[Chorus: 070 Shake]\nName somebody like me, oh\nTell me who sings to you like me, oh woah\nName somebody like me, oh woah\nTell me who sings to you like me\nName somebody like me\nWon't you tell me who sings to you like me\nWoah woah, woah woah, woah woah\nWon't you tell me who sings to you like me\n\n[Verse 2: 070 Phi]\nPeace and prosperity on my mental\nYou keep looking for clarity, I don't get you\nCare to be in this rental, I'm looking for ownership\nThey brought us in here together, I'm looking to own this ship\nLike, like, I woke up like Johnny Depp\nThe lone ranger in the dark shadows\nDonnie Brasco tryin' to infiltrate the castle\n'Cause they fear the black masses\nA public enemy 'cause I ain't here to kiss no asses\nWe just needed transcendence in this world\nWhere your friend could be your foe\nWaiting for you to blow, coming for what I'm owed\nAin't no fear and nobody cares to wipe away your tears over here, baby\n\n[Chorus: 070 Shake]\nName somebody like me, oh\nTell me who sings to you like me, oh woah\nName somebody like me, oh woah\nTell me who sings to you like me\n\n[Outro: 070 Phi]\nWalking alone, yeah, I'm walking alone\nWalking alone, walking alone\nWalking alone, yeah, I'm walking alone\nWalking alone\nWalking alone, yeah, I'm walking alone", "title": "Somebody Like Me"}], "artist": "070 Shake"}