{"songs": [{"lyrics": "[Produced by Just Blaze]\n\n[Intro: Gloria Carter]\nShawn Carter was born December 4th, weighing in at 10 pounds, 8 ounces. He was the last of my four children. The only one who didn't give me any pain when I gave birth to him. And that's how I knew that he was a special child.\n\n[Verse 1: Jay-Z]\nThey say \"They never really miss you 'til you dead or you gone.\"\nSo on that note, I'm leavin' after the song\nSo you ain't gotta feel no way about Jay, so long\nAt least let me tell you why I'm this way, hold on\nI was conceived by Gloria Carter and Adnis Reeves\nWho made love under the sycamore tree\nWhich makes me a more sicker MC, and my momma would claim\nAt 10 pounds, when I was born, I didn't give her no pain\nAlthough through the years I gave her her fair share\nI gave her her first real scare, I made up for birth when I got here\nShe knows my purpose wasn't purpose; I ain't perfect, I care\nBut I feel worthless 'cause my shirts wasn't matchin' my gear\nNow I'm just scratchin' the surface\n'Cause what's buried under there\nWas a kid torn apart once his pop disappeared\nI went to school, got good grades, could behave when I wanted\nBut I had demons deep inside that would raise when confronted\n\n[Interlude: Gloria Carter]\nShawn was a very shy child growing up. He was into sports, and a funny story is at 4 he taught himself how to ride a bike. A two-wheeler at that, isn't that special? But I noticed a change in him when me and my husband broke up.\n\n[Verse 2: Jay-Z]\nNow, all the teachers couldn't reach me\nAnd my momma couldn't beat me\nHard enough to match the pain of my pops not seein' me\nSo, with that disdain in my membrane\nGot on my pimp game; fuck the world, my defense came\nThen DeHaven introduced me to the game\nSpanish Jose introduced me to 'caine, I'm a hustler now\nMy gear is in and I'm in the in-crowd\nAnd all the wavy light-skinned girls is lovin' me now\nMy self-esteem went through the roof, man, I got my swag\nGot a Volvo from this girl when her man got bagged\nPlus I hit my momma with cash from a show that I had\nSupposedly, knowin' nobody paid Jaz wack-ass\nI'm gettin' ahead of myself; by the way, I could rap\nBut that came second to me movin' this crack\n\"Gimme a second, I swear,\" I would say about my rap career\n'Til '96 came, niggas, I'm here; goodbye!\n\n[Interlude: Gloria Carter]\nShawn used to be in the kitchen, beating on the table and rapping until the wee hours of the morning. And then I bought him a boom box, and his sisters and brothers said he would drive them nuts. But that was my way to keep him close to me and out of trouble.\n\n[Verse 3: Jay-Z]\nGoodbye to the game, all the spoils, the adrenaline rush\nYour blood boils you in the spot, knowin' cops could rush\nAnd you in a drop, you're so easy to touch\nNo two days are alike except the first and fifteenth, pretty much\nAnd \"trust\" is a word you seldom hear from us\nHustlers, we don't sleep, we rest one eye up\nAnd the drought will define a man when the well dries up\nYou learn the worth of water without work\nYou thirst 'til you die, yup!\nAnd niggas get tied up for product\nAnd little brothers' ring fingers get cut up\nTo show mothers they really got 'em\nAnd this was the stress I lived with\n'Til I decided to try this rap shit for a livin', I pray I'm forgiven\nFor every bad decision I made, every sister I played\n‘Cause I'm still paranoid to this day\nAnd it's nobody's fault, I made the decisions I made\nThis is the life I chose, or rather, the life that chose me\n\n[Outro: Jay-Z]\nIf you can't respect that, your whole perspective is wack\nMaybe you'll love me when I fade to black\nIf you can't respect that, your whole perspective is wack\nMaybe you'll love me when I fade to black\nNow if you can't respect that, your whole perspective is wack\nMaybe you'll love me when I fade to black\nIf you can't respect that, your whole perspective is wack\nMaybe you'll love me when I fade...", "title": "December 4th", "image": "https://images.genius.com/58a07fb743226031d3ccf6dc472cccdf.991x991x1.jpg", "year": "2003-11-14", "album": "The Black Album"}], "artist": "JAY-Z"}