{"artist": "Big Daddy Kane", "songs": [{"lyrics": "In this corner, representin' BK, NY\nWho, come again , I\nThat you can't deny\nFor the while I stayed, laid back in the shade\nJust like a silhouette, however still a threat\nOnce again, I return just to get my groove on\nBag somethin' that's a size 7/8 and move on\nIt be nothin' but dime girls I sport\nOnly time I hit a 3 be on the basketball court\nWhat you thought, the wrath was about to end\nNah baby, never that because I'm out to win\nSo what if he came back , he ain't even hittin' though\nSo why you standin' there with yo' nails bitten low?\nMC's tremblin', I plead innocent\nBut then again, things can get menacin'\nLadies and Gentlemen it's the world renown\nCome on ya'll let's get down, Dark Gable's in town\n\nChorus\nPut your hands up high if you testify\nAre you wit' me? (Definitely)\nCause I give it all I got when I rock the spot\nAre you wit' me? (Definitely)\nAin't gon' be no looking tight, we gon' party tonight\nAre you wit' me? (Definitely)\nOne hundred percent proof, help me raise the roof\nAre you wit' me? (Definitely)\n\nVerse 2\nIt's somethin' 'bout that Kane that I just ain't buying\nHow can his rap be solid when his flow is liquefying?\nHe keep it on beat, plus he keep it street\nPlus he keep it sweet, I mean his shit be complete\nThank you love that's right keep it real for me\nAs I run it down to you all skillfully\nBecause it ain't hard to tell who's the liver one\nGot 'em all shooken like Allen Iverson\nSee, you talking now but you ain't sayin nothin'\nI keep you listeners hittin' the rewind button\nYou thinkin', maybe I'm the one to bring it to\nBut, I don't think that's the wise thing to do\nAnother casualty with the audacity, thinkin' that he can last with me\nFast to see how I massively, drop skills gradually\nHold it down like gravity, naturally\n\nChorus\n\nVerse 3\nI come wit' the flows that go down like water\nSome of y'all just ain't got your game in order\nHmn, looks to me as though you're simpin'\nPlaya hata's that's attemptin', to be the grinch that stole pimpin'\nI cram to, understand you, what's your angle?\nYou don't want to tangle\nActin' all brand new\nNothin' that them can do, when I roll up like bamboo\nAnd dismantle, handle, everyone I ran through\nBaby, you can count on me, a sure thing\nI be all inside your hood, just like a drawstring\nThe wack, I restrict 'em, rhymes I kick 'em\nGirls I just stick 'em, whose my next victim?\nThinkin' you was ballin', now I'm callin\n\nYo' bluff(Uh huh), sho nuff (Well alright)\nWho you came out to see in the place to be\nThe ebony black ice, who that be?\n(Yours truly)\n\nChorus", "image": "https://images.genius.com/55a075f6632f5b5a223681bd3f7a7ca8.1000x1000x1.jpg", "year": "1998-04-28", "title": "Definitely", "album": "Veteranz Day"}]}