{"songs": [{"year": "2013-07-02", "image": "https://images.genius.com/31ad7ad89604d87d69b3e57bfba4ac85.936x936x1.jpg", "title": "Hack", "album": "Dour Candy", "lyrics": "I hate driving at night\nJust increase the chance Quality of Life gon’ flash them misery lights\nStay home/write that Richard Price\nBut when the script don’t flip/right back at it like a neighbor on the pipe\nPick up/drop off/pick up/drop off\nIt’s just a job but you can’t never knock off\nGettin’ old, goin soft or just seeing things for what they are\nI’ma die up in this car/hunched over the wheel with a big roll of small bills\nTray fulla ash/quarter tank of gas/dog eared photos tapes to the dash\n18 years pushing this cab/from bush dimes to kush in the bag\nYouthful crime to this is all I really have\nFlash high beams on the boulevard of broken dreams/oh, you don’t know it?\nLast exit off the road to riches and diamond rings\n\n[Hook]\nWrite the rhymes they wanna hear, right\nHere, right?\n\nThey told me:\nWoods, you need a new free project every month and a half and moving forward\nThe publicist only accepts cash\nSomething to think bout while I drive like when your connect retire\nIntroduce you to the new guy and he’s twenty-five/hmmmmmmmmm\nThe meter runs/release reefer in lungs/now we’re cooking with gas\nGood times? I ain't have fun seems like errybody else had a blast\nYour last tape was half-assed\nFew weeks pass ya mans already got the microwave on rehash\nThat’s what’s hot on the local thoroughfares, huh? Fuck it, ill take you there\nRed light/the beast just stare/watching you try to play it cool\nEverybody plays the fool/sometimes/hit the corner like we playing pool\nSink the nine\nMoving goalposts them folks change rules/no reason or rhyme\nI compete with great vigor within the lines that are painted, nigga\nNow I’m out here graveyardin’/narrow margins/pathetic pantomime\nGrey Gardens\n\n[Hook]\n\n[Outro: sample from Taxicab Confessions]"}], "artist": "​billy woods"}