{"songs": [{"album": "Scriptures", "image": "https://images.genius.com/fc08a4018680b3979b913a15b46cd21b.1000x1000x1.jpg", "year": "2019-06-07", "title": "Preach", "lyrics": "[Intro]\nAyy, they tried to bury us, right?\nThey ain't know we was C's though\nGrew up to some crazy shit\n\n[Chorus]\nTen milli' on me now, you ain't know that, did you?\nAnd somethin' low-key on your block, you ain't know that, did you?\nHad to cut into an opp like, \"You ain't on that, is you?\"\n\"You ain't on that, is you? You ain't on that, is you?\"\n(DJ on the beat, so it's a banger)\n\n[Verse 1]\nThe shit I rap be facts, I ain't just droppin' bars\nBro'nem could see a carseat, they still gon' chop the car\nI ain't trippin' if the police get my opps\nThem niggas ain't finna survive in prison, my niggas got the yards\nThem Detroit niggas want me to keep that same flow\nBut that ain't what get them millions, I can't, bro\nYou know a lot of niggas scared to make that change, though\nYou gotta do it, get money, that's how the game go\nReal nigga 'round these weird niggas, I don't fit in\nHouse up on the hills, gotta rock climb to get in\nIt ain't one nigga I can call and borrow a band\nI ain't trippin', though, 'cause the banker let me borrow M's\nYeah, we can do that debit and that credit talk\nTell your mans face to face 'fore I blow his expression off\nYou know what I used to do to get that cheddar, dawg\nI was robbin' stores for that vault, like, \"Don't set it off\"\n\n[Chorus]\nTen milli' on me now, you ain't know that, did you?\nAnd somethin' low-key on your block, you ain't know that, did you?\nHad to cut into an opp like, \"You ain't on that, is you?\"\n\"You ain't on that, is you? You ain't on that, is you?\"\n\n[Verse 2]\nBlue faces on me, bust down, little thottie\nI was pushin' foreigns through the East before Gotti\nThey came to chop bricks, you don't wanna see karate\nFree my niggas ridin' under the five, almighty\nAyy, know I fuck with G's and some Crips too\nBoy, your ho a bitch and you a bitch too\nBoy don't let them niggas get you slumped\n'Cause when you dead, they gon' still live they life and have fun\nIt's a difference from preachin', speakin' from experience\nAll the shit I been through, I remember\nNiggas say I changed for material\nBoy, is you illiterate?\nNigga, you know what the fuck I risked for this?\nNigga, you know what I risked for my wrist?\nRest in peace my opp, nigga, you ain't gon' be missed\nBesides get on Instagram and diss, your niggas ain't finna do shit\nWe gon' coexist until I want them niggas picked\n\n[Chorus]\nTen milli' on me now, you ain't know that, did you?\nAnd somethin' low-key on your block, you ain't know that, did you?\nHad to cut into an opp like, \"You ain't on that, is you?\"\n\"You ain't on that, is you? You ain't on that, is you?\"\n\n[Verse 3]\nI don't regret the shit I did wrong, naw\nBut I regret the shit I did for the wrong people\nMarMar in and out the hole like he ain't tryna come home\nBro, you only got a year left, chill, you at the door, nigga\nGot all this money waitin' on you, all these hoes, nigga\nWhen I see niggas, I just see a lot of hoes, nigga\nHow you gonna go to work with me when you broke, nigga?\nHuh? tell these niggas make it make sense\nThey run the streets night and day, still ain't made shit\nGot this .40 in my hand, it ain't on my hip\nNiggas say they on my ass, more like on my dick\nNigga, ah\n\n[Outro]\nTen milli' on me now\nAnd somethin' low-key on your block\nYou ain't on that, is you? You ain't on that, is you?\nTen milli' on me now\nOn me now"}], "artist": "Tee Grizzley"}