{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse 1]\n\nOne-fifty-eight Lewis Avenue\nBetween Lafayette and Van Buren, that was back during\nThe days of hangin on my Bed-Stuy block\nWith Spence and Mitch, followin my cousin Murdoch\nAll the brothers were real, goin for what they feel\nBy the way, peace to my man Sha and Big Neal\nNow in ninety-three I'm still bein me\nYou think my 'fridgerator ain't full of Olde E?  Huh\nA lot of times I get fly with a suit and a tie\nYeah I went from rags to riches but I still rock the saggy britches\nAnd I don't try to act brand new\nEatin escargots and usin words like \"rendezvous\"\nThe ghetto life I've seen a lot overcome\nMake a little money and then forget where they came from\nLivin a plastic lifestyle, you're more false than dentures\nDon't make me pull your file -- stop shammin!\n\n[Scratches x4]\n\"Stop, hold-up, pause, wait\" (2X)\nStop shammin!\n\n[Verse 2]\n\nSo why you wanna be what you're not?\nAnd claim to have things that you know you ain't got\nYou're just a fantasizer -- spendin all your money\nOn Luster's pink oil moisturizer\nJust to make your hair curly and thin\nYou say, \"Black is beautiful,\" but then you go and bleach your skin\nMoney you're worse than Yacub\nCause their are eight stages of graft and you broke down to two\nPlus you got a bad case of jungle fever\nAnd nmmana-nah-nah I just can't believe ya\nIt's quite obvious you don't wanna be a black man\nSo what's next - you're gonna join the Klu Klux Klan?\nYou sold out to your race and it's a big disgrace\nYou can't look your own people in the face\nYou wonder why it ain't no black schools or hospitals\nYou're makin millions of dollars and it's pitiful\nThat you can donate to leukemia all the time\nBut you can't give the Nation of Islam a dime\nThey mention Muslims, you change the subject\nYou can't even shake Farrakhan hand in public\nThat whole busy attitude is a sham\nUmm bro, umm brother, umm.. Brougham, stop shammin!\n\n[Scratches x4]\n\"Stop, hold-up, pause, wait\" (2X)\n\"Change the groove and fuck it up a little bit\"\n\n[Verse 3]\n\nI look in the mirror, at times I say, \"Damn Black Caesar;\nHow'd you get to be the woman pleaser?\"\nCause I remember when girls didn't notice me\nAnd now they wanna Come and Talk To Me like Jodeci\nIt's strange, how back in the days I couldn't get with em\nNow all of a sudden the honies they wanna give me rhythm\nWell I'ma hit it, but still I show no pity\nSo I hope you don't think you gonna be in my next video\nAnd many brothers I never even ran with\nBe actin like they been hangin with me since I was a kid\nI mean just to get a piece of the action\nMan they start rememberin more times than Michael Jackson\nBut I can't fade to the tag-alongs\nThat want me to drag em on\nFrontin like a friend just so I can put em in\nBut you cuttin yourself paper thin - stop shammin!\n\n[Scratches x4]\n\"Stop, hold-up, pause, wait\" (2X)\nAnd I'm out", "image": "https://images.genius.com/bbdac91ad158e946adbe9995eace16ac.371x372x1.jpg", "year": "1993-05-25", "title": "Stop Shammin’", "album": "Looks Like a Job For..."}]}