{"artist": "Vakill", "songs": [{"title": "Fallen", "year": null, "lyrics": "[Vakill]\nI was the nicest for at least the last six months\nSingle went dope, got heavy rotation from Funk Flex\nAnd didn't have to ask Stick once\nPenned flows that was most quoted\nKept the toast loaded for magazine critics in case the\nAlleged niggas ghostwrote it\nSpit with the armored fist\nAnd for a list had no escape route from the slums so\nRound it became an orifice\nNow I'm eating good and pushing whips\nProblem is, I'm pussy whipped by a bitch that dropped\nMe same time the label did\nAlbum sells wasn't well, no reach quota\nSo my foundation which was once mentally and\nFinancially stable slid\nTraumas all, was on alcohol plus I done acid\nPut every egg into one basket\nNow my mind rages cause imposters of label reps\nGetting gun blasted\nWon passed it\nFuck it, one life, one love, one casket\nWound up at the CEO office and blow his flesh of his chest\nAnd left that nigga slumped on his office desk\n\n[Hook]\nMy mouth wasn't built to handle rejection\n(I'm Fallen)\nYou only fucking with, answer the question\n(I'm Fallen)\nFuck trying to reason with logic\nReason with this sixteen shot cartridge holding a\nLabel hostage\n\n[Slug]\nHow many are dead? (One dead)\nHow many game pieces does he have now?\n(two, one woman and one man)\nNow, here we go again\nAnother day trying to defend a belief\nTime to make friends with the Beast\nHow many guns he got?\nOnly one's been shot\nLet me see his demands\nAnd a copy of the floorplans\nWhats the odds of suicidal?\nLet's try to get him on the horn\nAnd inform him of my arrival\nN-n-n-n-n-no no vest\nI'm going in soft\nIf he's gonna take my head off then he's gotta take my\nHead off\nNow what's his name?\nDoes he have a family?\nWhat's his background?\nDid he pick the place randomly?\nGet his girl on the phone\nLocate his mom\n(Move, move, move people now, now)\nWe're dealing with a time bomb\nAnd I'mma take it through the front door\nLook him in the eyes\nSee if we can make this grown man cry\n\n[Hook]\n\nV: Lets weigh my options, and put in perspective my position\nStop the mission\nIt's a straight shot to prison without a pot to piss in\nFuck the negotiating, I don't expect for you cops to listen\nYou probably setting me up to get shot by a\nSharpshooter from the SWAT division\nTell them bitches I won't be that easily overthrown\nI know they're listening in on your mobile phone\nYou don't know my pain, you're probably living like a\nKing on some noble throne\nIn the suburbs with a fucking Camero and a mobile home\nAll I want is my deal back\nBut the A&R stays put, in turn, I'll give you the intern\nS: What's the catch\nV: I want an even bigger deal\nNo funny shit cause I'm holding the trigger's steel\nAnd I'll drop this bitch faster than Jigga did Amil\nS: Alright I hear you\nBut still it's my responsibility\nTo guarantee these hostages are walking out of here with me\nYour everything is on their safety\nV: Yo Fuck, that\nS: Yo, no way around that\nWe've got the place surrounded\nSo what's your call kid\nYour move, whatchya gonna do?\nYou've gotta face the truth\n(Wait I've gotta face the truth)\nCause the more I toss it all around my head\nThe more I feel\nEverything that you said\nAlright so here's the fucking deal\nGimme the intern\nLet the A&R burn\nAnd as far as I'm concerned this meeting is adjourned\nThe woman and I, we're about to walk out that door\nHere's a handshake soldier cause we both won the war\n\nA&R: Wait, Wait, what are you leaving for its your job\nCome back here\nV: Naw, fuck that\nA&R: Wait, wait we can think this up now cause-\nV: Naw, fuck that, fuck you\n\n[Vakill]\nHow can you reason with the brain savagely ripped from it's humane frame\nGave sweat, tears, and slit a main vain\nNow I aim flame and squeeze out a vengeance for every\nCareer the industry ruined 4,080 in this fucked up game playing\nOpen ya mouth foul bitch\nCause now I got this 40-cal-inch *gunshot* for you to tussle\nI keep bullets for every artist that signed a loud pitch\nFunny sometimes\nI fast fake and take a tumultuous twist in life's style switch\nI don't know what world beyond this lies\nBut I can see my future, not just career through Ganda's eyes\nOnce I let this slug out, I struck out\nNevermind my side of the playing field till I was underneath the dugout\nNo matters, what could possibly be worse\nUnless that somehow the tables was reversed\nI know the Jakes is coming and I can't wait to let this heat burst\nI'mma kill everybody\nAnd just to prove that I ain't bullshitting\nI'mma start with me first *gunshot*", "album": "The Darkest Cloud", "image": "https://images.genius.com/f0fa8d572f04773a721576175bcefb21.488x500x1.jpg"}]}