{"artist": "Wax", "songs": [{"year": null, "lyrics": "[Verse]\nMary and her mom, they ain't never really had much\nNever met her dad, she was sad and such\nShe got bused to school in a good neighborhood\nBut the kids didn't treat her like a good neighbor would\nMan, harassin' her for the clothes that her mom supplied\nThe first couple times they did it, she cried\nAfter a while she'd take in stride\nWalking down hall between classes, she'd let it all slide\nSwallowing her pride to the point that it was full eaten\nAfter school getting bullied and beaten\nBut to her mom, she made none of it known\nShe figured that her mother already had enough problems of her own\nShe came home one day to a new face\nA man in her living room unpacking his suit case\nHer mom said he's going to stay with us for a while\nAt the news, Mary cracked a smile\nShe figured he'd be like a dad or maybe an older brother\nHe can stay as long as he likes she told her mother\nAnd at first it was kinda nice\nEverybody got along for the most parts just a couple minor fights\nBut as the months went on it got worse\nIf he didn't get his way he'd scream and curse\nMary never knew this was how a father behaved\nIt was less father and daughter and more master and slave\nAll the money mom saved he would blow getting bent\nBroke open her piggy bank, stole every cent\nHe would come home drunk and snort lines in the living room\nOpenly some nights he lost control totally\nHe'd grab her mom by the neck and ice grill her\nAnd tell her that if she ever left him he would kill her\nAnd Mary would listen all alone from her room shaking\nToo much for a little girl to take in\nBut the worse of it all was yet to come\nThe new habit he developed was a devilish one\nShe ain't know what he was doing but she knew it wasn't right\nWhen he came into her room in the middle of the night\nMan, she started keeping something in her night stand\nSomething she found in the kitchen by the frying pan\nShe was in a new mental state\nReady to release all of the anger and pent up hate\nAnd she swore when he came to her door\nShe wouldn't take it lying down like she had before\nShe kept the knife in the drawer with the handle sticking out\nNext time he came in she chickened out\nSo she decided she would hide it in a place much closer\nSomewhere she could grab it as soon as he approached her\nPut it under the pillow and she was ready\nThe next time he came in she wielded it like a machete\nYou could tell by the way that she swung that she had practiced\nShadow stabbing in her mirror for the past six weeks\nHer confidence level had peaked\nThe first slice to the dick then she stabbed him in the cheek\nAnd she didn't stop stabbing even when he stopped screaming\nStill stabbing and sticking even when he stopped breathing\nHer mom ran in and she screamed in horror\nAs she slipped and she fell on the blood-covered floor\nScreaming Mary!\nStick em! Ha Ha Ha! Stick Em!\nMary!\nStick em! Ha Ha Ha! Stick Em!\nMary!\nStick em! Ha Ha Ha! Stick Em!\nMa, Ma, Ma, Mom I'm done being a victim", "image": "https://images.genius.com/6f0817252fcc664558dc80369900bc26.320x320x1.jpg", "album": "Scrublife", "title": "Mary"}]}