{"artist": "Philthy Rich", "songs": [{"album": "Fake Love (Deluxe Version)", "title": "Interlude M.A.C #1", "image": "https://images.genius.com/4b47b68360dac3b50315c2d634ecaf4b.939x939x1.jpg", "lyrics": "[Skit]\nYeah, man, I remember growin' up in Oakland, man\n(Oh yeah, town business)\nGoin’ to the motherfuckin' Boom Boom Room\n(The Boom Boom Room)\nYoung niggas talkin' ’bout, \"What we gon' do when we grow up?\" (Young niggas)\n(\"What I'm gon' do when I grow up? What I'm gon' do when I grow up?\")\nKnow what I'm sayin'?\nMight have a nigga ’bout\n\"I’ma be Michael Jordan\"\n\"I'ma buy my whole family, and friends, nigga, Js\" (Lavish)\n\"Nigga, mandatory, everybody that rock with me gotta have Js\"\n(Js, nigga)\nYou know what I’m sayin'?\nThen you might have a motherfucker be like\n(All fresh like Banks)\n\"I'ma be like D and Banks and them, Felix Mitchell\"\n(Rest in peace)\n\"Buy all my lieutenants candy '71 Caddies, nigga\"\n(The Mob)\n\"And then all my captains gon’ have candy Stangs, nigga\"\n(Wah, wah, wah)\n\"Whole town gon' be like, 'Aw, shit, there go The Mob niggas'\"\n(\"Yeah, it's The Mob niggas, mayne!\")\n\"You know what I'm sayin'?\"\nSomebody else 'bout to be like\n\"Nigga, when I grow up, I'm gon' be like Too $hort\"\n(*Beatbox*)\n\"Eric B and Rakim, buyin' all my niggas donkey ropes, nigga\"\n\"Everybody gonna have donkey ropes, nigga\"\n\"Fila sweatsuits, all this shit\"\n(Yeah)\nYou know what I'm sayin'?\nThat's that Boom Boom Room talk when you young, growin' up\nBut, um, decades later\nWe all become who we become\nYou know what I'm sayin'?\nBut I just be wonderin' like\n\"Damn, was we the only little boys in the United States that used to dream like this?\"\n(Dreamers, man, know what I'm sayin'?)\nLittle bad little boys off the streets, nigga, never made it to the music industry\n(Never)\n'Til I start hearin' about my nigga Philthy, nigga\n(Philthy-motherfuckin'-Rich, nigga)\nThrowin' out pieces, nigga, multiple pieces, nigga\n(Chain after chain after chain)\nI'm sittin' in prison, nigga, level 4, nigga, thuggin'\nBay nigga, laughin', nigga\nThinkin' to myself, know what I'm talkin' about\n\"Now that's a young nigga that was growin' up on the motherfuckin' streets, nigga\"\n(Streets of Oakland)\n\"And used to go to that Boom Boom Room, nigga\"\n(Yeah)\n\"Thinkin', nigga\"\n'When I get on, nigga, I'm havin' the same niggas with me, nigga, rockin' pieces, everybody get pieced up, nigga, so when they see us, nigga, it's gon' be like \"Sem-Sem-Sem-City in the house\"'\n(\"When I get on, pieces, shinin', nigga\")\nKnow what I'm sayin'?\nNow that's what the fuck I'm talkin' 'bout\nThen I start seein', bruh\nThen with them twenty, fifty, hundred-million dollar niggas\n(Bags)\nFeel what I'm sayin'?\n(Big bags)\nOh yeah, feel what I'm sayin', I seen it\nI seen 50, you know what I'm sayin'\nHe did it for Jamaica, Queens\n(Fa sho, fa sho)\nYou know what I'm sayin'\nMeek did it for the streets of Philly\n(Salute, salute)\nRick Ross and them did- they did it for Dade County\n(Fa sho)\nUh, uh, Jim, Cam, they did it for Harlem\n(Don't forget YG)\nYG, put it on for Compton\n(Yeah)\nFeel I'm sayin'?\nLook\nGot Gucci, Jeezy, T.I. did it for Atlanta\n(T.I.)\nList go on\nSo I'm like\n\"Okay, I can't wait for the world to see this motherfuckin' town business\"\n(Town business)\nKnow what I'm sayin'?\nWe had that Oakland izm\nYou know what I'm sayin', they shine nigga, since 2Pac Shakur, rest in peace\n(Pac got on that gangsta shit)\nYou know what I'm sayin'?\nWe turned him out, know what I'm sayin'?\nAs far as that street element, you know what I'm sayin'?\n(Yeah, fa sho)\nUs, you know, the surroundin' cities\nWe the only gangstas, nigga, in the whole country nigga\nThat really ain't gangbangin'\n(That's real gangsta shit, don't get it twisted)\nKnow what I'm sayin'?\nOn that gangster shit\nSo it's time to show these niggas some originality\n(Yeah)\nFeel what I'm sayin'?\nMan, I just knew bruh was 'bout to be locked in with Def Jam\n(Yeah, I knew it)\nUniversal, Atlantic or somebody\nYou know what I'm sayin'?\nThe niggas he fuckin' with, bro\nThese niggas got songs with\nMary J. Blige, Mariah Carey, P. Diddy\n(Mary, mm-hmm, Mariah, yup)\nNe-Yo, Chris Brown\nNigga, even a deal, nigga, feel what I'm sayin'?\n(Even a deal)\nIt's hella shit, nigga\nAnd there he go, hmph, that motherfuckin' fake love\nYou feel what I'm sayin'?\nIt's the same fake love a nigga see in the dope game\n(Same shit that's in the dope game)\nYou know what I'm sayin'?\nYou see a young saucy nigga\n(Saucy)\nSo you like, \"Okay, he saucy, comin' up\"\n(Gonna use that nigga, though)\nYou snatch him up, you know what I'm sayin'?\nYou show him the finer things, you feel what I'm sayin'?\n(You know, mm-hmm)\nYou let him drive the whip, you know what I'm sayin'?\nAll this shit, you feel what I'm sayin'?\nBut you keep givin' him bundles, nigga\nYou keep spoon-feedin' him instead of really puttin' him on\n(Put that nigga on, blood)\nI ain't never did that, nigga\nAsk Whitey, nigga, feel what I'm sayin'?\n(Ask 'em)\nFrom the gate, nigga, I'm frontin' my niggas weight, nigga\nI ain't gon' do like half, nigga\n(Weight, weight, not no bundles, nigga)\nI used to throw wees out the kis, nigga\nGive 'em a couple of zips, know what I'm sayin'?\n(You ready to stop playin'?)\nOnce he act like he was ready to stop playin', nigga\n(You fresh out of white?)\nCome on, man, I'll lace him on the history of the Jetsons\n(The Jetsons, put him on The Mob)\nPut him on to The Mob, nigga\n(Mob across his chest)\nField my position, nigga\nI became the Elohim\n(Know what I'm sayin'? I became Elohim fa sho)\nNow that's real love\nThat's all real niggas gotta do when you worth fifty, a hundred, five hundred\n(Five hundred)\nNigga, that's the fuck you gotta do\nYou see the boss in Philthy, right?\n(You see the boss)\nYou see the boss in this black man\nYou know what I'm sayin', all you gotta do is give him the run down at Def Jam\n(Come on, man)\nUniversal or some shit\n(C'mon, man)\nBring him to the CEO table, know what I'm sayin'?\nAnd let him put his people on\nIt's that easy\n(That easy)\nBut when it's that fake love, nigga\n(Fake love)\nYou, you, you, you, you feel threatened, know what I'm sayin'?\nInsecure, you know what I'm sayin'?\n(\"You saucier than me\")\nAnd all that old, sucka-ass shit\nHow a nigga worth a hundred\nFive hundred million dollars\nGon' feel insecure about a nigga worth five, six million dollars?\n(You feel me?)\nEasy, nigga\n(How?)\nFakeness always feel uncomfortable around realness, nigga\n(That's on everything)\nThat's how it is\n(Say it again)\nFakeness always feel uncomfortable around realness, nigga\nKnow what I'm sayin'?\nNiggas don't know, bro\nNiggas don't know how to do that Dr. Dre shit, know what I'm sayin'?\n(Dre put niggas on)\nDre, nigga, that nigga put Snoop on\nEminem on\n50 Cent on\n(Got bags)\nNigga that wasn't- that nigga wasn't gonna chase a bigger bag, nigga\nBut, but, but, you know\nOakland the speed bump capital, nigga\n(Oakland, Oakland, nigga, speed bump capital)\nYou feel what I'm sayin'?\nThe speed bump capital, dog, know what I'm sayin'?\n(More speed bumps than any city)\nWe got the most speed bumps of any city, know what I'm sayin'?\nSo, you know\n(Vroom, vroom)\nThat fake love shit is just another bump in the motherfuckin' town\nAnother speed bump for a real town nigga, know what I'm sayin'?\nPhilthy still go true on 'em, know what I'm sayin'?\n(True on these niggas, know what I'm sayin'?)\nA killer whale among humpbacks\n(Killers, nigga)\nNigga, that's what we do, nigga\nThose niggas gon' fall back and die, nigga, know that\n(Killer whales among humpbacks)\nTrue gangsters gon' funk or die\nKnow that\nHahaha, this nigga crazy\nThat's that fake love shit, though\n(True gangstas gon' funk or die)\nWe the speed bump capital, man\nWe been doin' that shit\nFake love ain't nothin' but a speed bump\n(Mac B-b-b-last!)\nGo over that motherfucker, keep pushin', nigga", "year": "2018-12-07"}]}