{"songs": [{"image": "https://images.genius.com/7521267b7988b507395d65324d39651d.1000x1000x1.jpg", "title": "Momma I’m So Sorry", "album": "Hell Hath No Fury", "year": "2006-11-28", "lyrics": "[Intro: Pusha T & Pharrell]\nGather round!\nMiami Vice\nAll my cocaine dreamers\nYou know\nMiami Vice\nPusha spit this shit for y'all\nHere we go\n\n[Verse 1: Pusha T]\nYoungin', don't make my sails rise (Ugh!)\nI shoot you out your Chukkas\nPusha hear the whispers of all you motherfuckers\nPapa said, \"Stay free of them suckers\"\nMinus the wicked jumper, street baller like the Rucker\nSkip to My Lou if you lookin for a couple\nRoosters in the duffle\nKeep the hood screaming, \"Cock-a-doodle doo!\", fuckers\nCoke by the ton, rap niggas, I'm the one\nWith basic rhyme pattern, how the fuck you tryin' to chatter?\nASIC ass rappers, got 'em runnin' for they life\nI philosophize about Glocks and keys\nNiggas call me Young Black Socrates\nWest Indies bitch drop to knees quick (... What?)\nWith dreams of being a rich man's bitch\nFeel sorry for niggas, pull triggers and they shit click\nSo many bullets jammed in my shit, call me lead-fist\nShake the diamonds out my wrists\n\n[Chorus: Pusha T (Pharrell)]\nMama I'm so sorry, I'm so obnoxious\nI don't fear Tubbs & Crockett\nMama I'm so sorry, I'm so obnoxious\nGot two hot rocks in my pocket\nMama I'm so sorry, I'm so obnoxious\nBig home, palm trees, and watches\nMama I'm so sorry, I'm so obnoxious\nMy only accomplice is my conscience, uh (Gather round!)\n\n[Verse 2: Malice]\nYoungin', learn from me, let's not be at odds\nWe're more like than not, 2 peas of a pod\nSame hustle, 'cept my hustle now flows\nI once gave it away, at 30 grams a O\nThat accounts for all them days in the cold\nFeels like kids and cake mix, can't wait to lick the bowl\nBut it's a bigger picture, homes trust I done seen it\nFrom Frankfurt to Cologne, Oslo to Sweden\nFrom Italy's Milan to the shores of Napoli\nNow I consider Ferrari and Salvador Dalis\nI'm no longer local, my thoughts are global\nThat's why I seem distant, son, expand ya vision\nEven adored by Norwegian woman\nBlonde hair and blue eyes, I'm gettin' back with a vengeance\nWhip it like they want me all attached to the kitten\nAnd they wonder in these raps if I'm kiddin', huh\n\n[Chorus: Pusha T]\nMama I'm so sorry, I'm so obnoxious\nI don't fear Tubbs & Crockett\nMama I'm so sorry, I'm so obnoxious\nGot two hot rocks in my pocket\nMama I'm so sorry, I'm so obnoxious\nBig home, palm trees, and watches\nMama I'm so sorry, I'm so obnoxious\nMy only accomplice is my conscience, uh\n\n[Verse 3: Pusha T]\n(Miami Vice) Sorry Heavenly Father, once again I hate to bother\nIt's P the evil creeper send some to the Grim Reaper\nMeanwhile, me and my Mrs. like Solomon and Sheba\nSign of the times, her Emilio Pucci sneakers, uh\nGhetto literature, I'd damn near die for Bolivia\nIt don't take much to get rid of ya, once I send for ya\nBetter call the minister, yuugh!\n\n[Verse 4: Malice]\nI'm sorry, Grandmama, for mistakes I have made\nWhen I aired family business, how you put me in my place\nEven my baby mama, I can't look you in the face\n'Cause I can't do enough, you a symbol of God's grace\nSo I place you in the flowerbed, porcelain shower heads\nThroughout the house and keep the youngins' mouths fed\nAnd when I'm gone, I hope it is said\nI gave structure to the youth by the example I led, uh\n\n[Chorus: Pusha T]\nMama I'm so sorry, I'm so obnoxious\nI don't fear Tubbs & Crockett\nMama I'm so sorry, I'm so obnoxious\nGot two hot rocks in my pocket\nMama I'm so sorry, I'm so obnoxious\nBig home, palm trees, and watches\nMama I'm so sorry, I'm so obnoxious\nMy only accomplice is my conscience, uh\n(Miami Vice)"}], "artist": "Clipse"}