{"artist": "Pharoahe Monch", "songs": [{"album": null, "title": "Sinon says - remix", "image": "https://images.genius.com/4c25d91d2559c6f7b2476ec5c1c16437.384x384x1.jpg", "lyrics": "(Pharoahe Monch)\nGET THE FUCK UP!\nSimon says \"GET THE FUCK UP!\"\nThrow ya hands in the sky (buck buck buck buck buck!)\nQueens is in the back sippin 'Gnac, y'all wassup?\nGirls, rub on your titties (yeah)\nYeah fuck it I said it rub on ya titties\nNew York City gritty committee, pity the fool that act shitty\nIn the midst of the calm, the witty\n\n(Lady Luck)\nYo SHUT THE FUCK UP!\nLuck said \"SHUT THE FUCK UP!\"\nBitches in the back, like crack get it cut up\nI speak on behalf of them broads you call stuck up\nAct like a man and get cocked, smacked or fucked up\nPull the truck up, Luck you know the name\nAssed out in the bleachers stay shittin on the game\nI suppose what you're spittin is flames, cowards\nKnow your crew was vaginal, I could smell the dooch powder\nSummer's Eve, I drop degrees chill\nCome four by four, lose one like Dru Hill\nStay fly till you air sick, now that's ill\nTwo choices, either squeeze or peel, now that's real\n\n(Pharoahe Monch)\nWHAT THE FUCK'S goin on here, just a minute now, hold up\nSinister wit hit the time I diminish him finish him, roll up\nWhen I'm, ? cinematography state of mind\nMy rap trip, rip, clip, say the rhyme\nShit, I spectacular run hit spit bitches venacular\nMiraculous rhyme flow, back track to the Immaculate\nBinaca blast nigga that's fast, son I'll box ya\nLadies rub the ta-ta's, bras, titties and knockers on the floor\nOWWW! Fellas pull ya cock out\nOn the verge to splurge verbs for third round knock out\nUh I bust a rhyme that dust frustrated rappers\nDust crush competition, lights out like the Clapper\nThe mic ripper, whip a nigga like a slave\nSeparate him from him from his fam, he don't know how to behave\nNow, drag his ass, bag dun for his loot\nFigure me to give a nigga-y twenty-one gun salute\nThat's seven shots for 2Pac\nSeven for Biggie Smalls\nSeven for Freaky Tah up in your neighborhood malls\nHow's that, fat action packed rap remain tame\nPharoahe fuckin Monch, ain't a damn thing changed\n\n(Redman)\nYo yo get the fuck up\nFunk Doctor Spot said \"Get the fuck up\"\nI got a bitch named Nina and I tuck her\nI leave a nigga hangin like ya mom's muffler\nSnuff her, then my boys follow up\nRespect like the Fonze, you see the collar up\nI spit out a bullet, load the barrel up\nI kamikaze ya town off a Arab bus\nKarat cut, yeah mami pull over\nI bend ya pussy like for years I knew yoga\nI'm too smoked up, I can't remember me\nOff Hennesy, that's why I carry Mini-Me\nI need fifty feet when my performance starts\nI push a armored car wit ?Lauren Harts?\nNineteen inches, I'm not on the charts\nDoc turnin dark off a warning shot\nDrive off and pop, six in ya hood\n(Monch) Fuck the limelight, we rhyme tight, plus snatch the goods\nYea-yeah my nigga, one rhyme you fold over\nI'm hot-headed cuz I walk wit cold shoulders\nYeah GET THE FUCK UP!\n\n(Pharoahe Monch)\nSimon Says \"GET THE FUCK UP!\"\nThrow ya hands in the sky (buck buck buck buck buck!)\n\n(Redman)\nJersey in the back jackin cars now wassup!\nGirls, rub on ya titties\n(Yeah) That's right I said it, rub on ya titties\nBrick City gritty committee\nPity the fool that act shitty, in the midst of the calm, the witty\n\n(Method Man)\nYo yo get the fuck up\nYo yeah I said it, get the fuck up\nWalk through Shaolin after dark, you get stuck up\nSeek and destroy, baddest boy when I'm puffed up\nYa know my name, and Pharoahe Moch, why we came what?\nWe off the chain, plus we plottin on the chain, what?\nKnow ya role, by the way tuck ya gold\nAnd you and your mic can ease on down the road\nAssholes are like opinions, everybody got to have one\nShootin in the sky tryin to blast sun\nZero to sixty in a second, pull a fast one\nFifty cent flashin they hate us wit a passion\nMashin, still fresh in three-day old fashion\nYour plaid, I'm stripes, together we be flashin\nHere's a Tunnel banger\nWu-Tang death penalty, the gas chamber\nThis gon' hurt me more than it hurts you\nSlap ya like the doctor the day your momma birthed you\nJust so you can feel me\nThe same way I'ma feel this world when it kill me\nEven if time stands still, I'ma still be\nUnderground and filthy, gotta have our Way like the Milky\nInnocent until I'm proven guilty\nNever got caught in the game of tag\nMomma never kept a boyfriend wit kids this bad\nNo justice, RAIDER RUCKUS!\nUnderground till we under ground\nBut y'all first MOTHAFUCKERS!\n\n(Shabaam Sahdeeq)\nMy thugs, throw up ya set\nAnd shorties rub on ya breasts\nGET THE FUCK UP, outta that dress, I palm tits\nYou herbs get flipped like jeeps on mountain cliffs\nI'll rip through your chest, hollow-point talent tips\nDouble-S, double the threat, double your bet\nDouble up on that cash if you decide to invest\nYou sound like Big, you sound like Jay, you sound like D\nAnd I bet, when I go plat, you'll sound like me\nShabaam Sahdeeq, injure your fleet into delete\nY'all crabs are weak, frail like a fiend's physique\nI stay on the street, stay on the beat, stay wit the heat\nStay stickin fools like you for the rocks that gleam\nSo toss that link, dummy, shoulda insured that link\nStraight to Canal I'll praise that link, then pawn that link\nYou froze up, Sahdeeq says \"Shut the fuck up!\"\nPunk niggas get gun-butt up and tied up\n\n(Busta Rhymes)\nBusta Rhymes is like Hacksaw Jim Dugan\nBeen thuggin, lovin the way we flood jewels for nothin\nLay it over, another ambush we take over\nYo we don't only get money, we cut the coke and cook the shake over\nYou better guard your head right, especially if it's late at night\nOr find your picture of your autoposy up on the web site\nYo if you ever violate my space\nFuck a fat lip, I'll leave you wit a fuckin fat face\nNigga, Busta Rhymes the handsome, I'll hold you for ransom ansom\nLike the ghost in a haunted house, I'll forever live in a mansion\nBitches, snitches comin out and you know who's showin it\nLike when British civil servants pass secrets to the Soviets\nY'all niggas is seemless blends of seemless friends\nLive on about ? ? on a bunch of seamless ends\nCollosal, me and my nigga Pharoahe Moncho\nThe head honcho, gettin this money like Leonardo (do do do)\nEnough substance in the roughness\nNow watch it come around in an amazing large abundance\nNow let me clear the smoke screen you blow fiend\nLive nigga shit that'll rebuild your whole self-esteem\nPledge allegiance to the flag of united live niggas of America\nLet us control and own the fuckin area\nWildin in your whip until your crash the whole truck up\nAnd if you know what's good for you nigga you better GET THE FUCK UP!!!\nHehehe", "year": null}]}