{"songs": [{"album": null, "image": "https://images.genius.com/70f08438a0dc8c76d7be4255cb0109e1.1000x1000x1.jpg", "year": "2015-10-28", "title": "Wicked Witch of the West Coast (Mediatrix Remix)", "lyrics": "[Intro]\nThe Wicked Witch of the West Coast....\nOld school!\n\n[Chorus]\nWitchy Woman...\nWhere be this Witch?\nRight here motherfucker!\nMurder's what she wrote...this is more evil!\n\nWitchy Woman...\n\n[Verse 1]\nTime for the revival, the rebirth and the reckoning\nMicrophone check one, two I’m checkin’ in\nI felt the beckoning and answered the calling\nMind, body and soul now I’m all in\n\nThe reawakening and manifestation of me\nBlessed be, to the power of three\nComing hard like a gangsta\nThanks to the way I was raised…on NWA\nSo be mindful when you speakin’ to me\nCuz I can get primal with a scream if need be\nKeep my profile low like WC\nAin’t a damn thang changed inside me\n\nLived and died in the heat of Los Angeles\nWithin an industry that’s always been scandalous\nKept my dignity was true to my essence\nAnd now it’s time for you to feel my presence...Yeah\n\n[Chorus]\nWitchy Woman…\nWhere be this Witch?\nRight here motherfucker!\n\nMouth is my weapon, microphone lethal\nMurder’s what she wrote, this is more evil\nNow that's what i'm sayin'....\n\n[Verse 2]\nSit down... It's gonna be a bumpy night\nQuote Bette Davis, when I’m on the mic\nPolarize when I leave but this ain't “All About Eve”\nI'm a vet not an ingénue, ya betta believe\nI’m legit, I’m never weak when I spit\nSpeak my mind so never mind why I quit\nCuz I'm back and I'm fierce just like vintage Chanel\nResurrected myself and I can still rock bells\n\nLike LL with a rebel yell and I own it\nThis is my moment\nHello! Now let the dust settle\nYa thought you lost me to heavy metal\n\nHell no! I still flow like the poets I quote from the past\nWoolf to Sylvia Plath\nCasting spells when I clear my throat\nThe Wicked Witch of the West Coast\n\n[Interlude]\n(samples)\nWe're not in Kansas anymore....\nWest Coast style from LA!\n\n[Verse 3]\nNow don’t get mad cause I’m back with a vengeance\nJust clear the way as I make my entrance\nLike an old school beat that’s mean with style\nAin’t got time to act a fool like a child\nI’m grown and you shoulda known I’d come off like a boss\nIn a suit, never mind what it cost\nThat’s irrelevant, not here to flaunt figures\nOr flash my tits and ass like other bitches\n\nI’m Ruthless you’re gonna respect it...shit...\nI influenced ever since my first record\nA headbanger and a motherfuckin' rhymesayer\nFrom Ice Cube to Slayer\n\nSo let it rain, reign in blood, get ready\nHere I come to cold crush and rock steady\nHell hath no fury like a woman scorned\nOr a bitch reborn…yeah\n\n[Chorus x 2]\nWitchy Woman…\nWhere be this Witch?\nRight here Motherfucker!\n\nMouth is my weapon, microphone lethal\nMurder’s what she wrote, this is more evil\nThe saga continues…\n\nWitchy Woman…yeah!\nWhere be this Witch?\nI think you know my name....\nMotherfucker...fucker...fucker...\n\nMouth is my weapon, microphone evil\nThe saga continues…this is more evil\nThis is more evil....this is more evil....this is more evil..."}], "artist": "Tairrie B"}