{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": "1999-05-18", "lyrics": "[Intro]\nYo, yo, reverb\nBe-ba-doom, yo, feel that bassline Cap\nYo, yo that's some, that's some like, Stanley Kubrick\nStanley Kubrick\n\n[Verse 1]\nThe track bouncy, nobody get more rowdy\nThan Suffolk County, peace to Crackhead Crowley\nHonky Thomas, Cat McGlaughling, the whole crew\nCab Morada, what you gon' do, we roll through?\nFuck that, Big Earth, the midget face drop 'em\nBring em to the Port Jeff house stayed on top 'em\nNobody move this, I don't give a fuck, we untouched\nStrictly lust for papers and live life to bust nuts\nWe're God killers, let's be realistic\nWe probably gon' be punished\nWe fucking bitches by the hundreds\nWhy me? Wanna fight me? Try me\nWhy these people don't know me, don't like me?\nSociety, they wanna see me dead I stick out\nYou see me in the public, I probably pull my dick out\nSmack the fuck out of women, see me knock your bitch out\nDo something tough guy, who the fuck wanna die?\nClash of the Titans, broken bottles, bar fighting\nYou wanna battle I'mma freestyle you can start writing\nI can do that, tip the bouncers, make sure we get our gats in\nThe club just in case the action\nEverybody want it, try to take my title\nLet's see, left your chest messy, test me\nStanley Kubrick, don't stress me\nR.A. the Rugged Man, remember the name, Rugged Man!\n\n[Hook]\nRide with us (Rugged O the Bitch Beater)\nRide with us (Suffolk County, Long Island)\nRide with us (Dead broke black people)\nRide with us (Dead broke white people)\nRide with us (My man Smoothe Da Hustler)\nRide with us (Rest in peace Jason Edmunds)\nRide with us (Gordon Heights, ghostland)\nRide with us\n\n[Verse 2]\nAiyyo the R-to-da, A-to-da, Rugged\nNow think about this, who diss us? Suffolk County\nCops frisk us, their handcuffs never fit us\nOur wrists turn purple, that's why we act vicious\nPlus if we die tomorrow, won't nobody miss us\nGet half a page in The Source maybe, if that\nIt's a whole town of people acting shady, where I live at\nWe spit lyrically releasing, you don't stop\nAin't nobody ceasing til your heartbeat stop beating, bring it\nYou know where to find me, acting like you looking for me\nYou saw me you walked right by me\nA true test, the Rugged Man, the tru-est\nThe most violent, in the U.S., we see you stressed\nNow take it easy, Fat Man greasy, sloppy\nPeace to Khadafi, I'mma do this\nThey tried to stop me, way back in nine-four\nYou look into my future, I'mma probably die poor\nWe proud to be the lowest, low life losers\nWe flip your car over like Long Island steroid abusers\nWhen they 'roid raging, white boy caning\nLet me do some explain, misbehaving\nRugged Man, hairy fat slob, unshaven\nThe Ten Commandments, we constantly disobeying\n\n[Hook]\nRide with us (Dirty crusty asses)\nRide with us (The whole Infamous Mobb)\nRide with us (My main man Akinyele)\nRide with us (The whole white trash nation)\nRide with us (All the Stony Brook kids)\nRide with us (All the Port Jeff kids)\nRide with us (My man Ev Casuchi)\nRide with us (Capital the Crimelord)\nRide with us (Miguel the cop in the house)\nRide with us (Sho' nuff, Dave Greenberg)\nRide with us (All the starving artists)\nRide with us (All the starving artists)\nRide with us (All the starving artists)\nRide with us (Rugged...)", "title": "Stanley Kubrick", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}