{"songs": [{"year": null, "title": "Keep Pushing", "image": "https://images.genius.com/97e5f72432c5b33084c28f136249f9b1.442x442x1.png", "lyrics": "[Hook: Chamillionaire]\n‘Cause I’ve been up and I’ve been down\nAnd if it’s one thing that I’ve found\nYou gotta keep pushing baby\nI swear it feels like we almost made it\nWe on the way up, yeah, don’t look down\n‘Cause we so high off the ground\nBut you gotta keep pushing baby\nTo the top, yeah, we almost made it\n\n[Verse 1: Saigon]\nI relate more to struggle than to corks and the bubbles\nYour pain’s never champagne when you always in trouble\nI’m at the dealership but I’m selling these cars\nIt’s a result of collecting my second felony charge\nWatching fellows get lost, spitting bullshit bars\nIt’s like a mirage—niggas only write for the broads\nAs far as I could recall, there was only one tar\nOne teacher, one king, one God, it seem all\nRookies, they don’t respect the sport\nLike they totally forgot Kane's second thought—\nThey don’t seem to reflect no more\nThat’s why they coming out sounding so similar\nIt’s quite confusing for you remember the\nOriginator.  Boy, do I hate ‘em—fuck a perpetrator\nHater, record label slave trader\nMy story the recipe of a grown man\nHad to go put my destiny in my own hands\n\n[Hook]\n\n[Verse 2 - Saigon]\nI ain’t emerged to tell you how I splurge on the birds\nI don’t give 'emnothing but word and still hit the curves\nThen swerve to another nerve—murder superb\nThey heard of Giddy like they heard of the word\n33 and a third of what I spit—this verbally is absurd\nNever 33 and a third.  It’s addictive as herb, you heard?\nCome try and punk a nigga\nI run you over, hit your head with the bumper sticker\nIt's gon' take a month to fix you\nI'm being sincere when I say that you’ll be in intensive care\nI don’t think you really wanna visit there\nFlow water, words float like a motor boat\nBeen there and done it, dummy; I know the ropes—quote, unquote\nFront on me, I go for broke.  Smoke with me, it’s tote for tote\nJoke with me, I’m funny as Kevin Hart making Oprah jokes\nOops I told joke twice, but that’s aight\nThese motherfuckers know that I’m nice\n\n[Hook]", "album": "The Greatest Story Never Told 2: Bread And Circuses"}], "artist": "Saigon"}