{"artist": "Apache", "songs": [{"title": "Tonto", "image": "https://images.genius.com/7b040bdcfb9c6c3e03af2d9b25c4c25d.500x500x1.jpg", "album": "Apache Ain’t Shit", "lyrics": "[20 second skit between Apache and a girl]\n\n[Apache]\nLadies listen close, run quick fast pronto\nThis is a song about my dick, his name is Tonto\nThat's my dick's name, I gave it a nickname\nNo time to dance off wit'cha pants, let's play a quick game\nOf hide the salami, who'll be the first to drop\nHow many licks does it take to get the center of my Tonto pop\nI heard you'll do anything to meet rap stars\nWhat would you do for this Klondike bar?\nDon't smile, I fuck wild, you wanna slow'er up\nWhen I finish you'll be \"cuckoo!\" for Cocoa Nuts\nNot a ball there's more of the rough stuff\nFuck so hard you say, \"I've fallen and I can't get up!\"\nI've got a, little dick, but once it's inside\nIt's about this big but about THIS wide\nI rip your tummy honey, you want money that's funny\nFirst let me tempt your tummy with the taste of my Nuts'n'Honey\nHard as a brick, promise not to cum quick\nI got the - long dough, long braids, and the loooooooong dick\n\n[Hook - repeat 2X]\nMy dick, my dick! {*repeat 3X*}\nMyyyyyyyyyy dick!\n\n[Apache]\nGot a Superwoman's pussy, my dick's the Kyrptonite\nCome get fucked from your asshole to your appetite\nI'm a fucker not a fighter come get your clit rocked\nRip your pussy off, give it back to you in a ziplock\nI'm real quick to throw a fit over big tits\nTasty like Diet Coke, I'll suck 'em \"just for the taste of it\"\n(Do you eat pussy?) HELL NO! (That's fucked up, why?)\nI don't eat shit that bleeds for 7 days and doesn't die\nI hope you're strictly dickly, I'm hard as cement\nI like to fuck long strong hard and frequent\nI like to bend 'em, run up in 'em, I'm not generous\nI specialize in doin damage to your uterus\nI pound the pussy with a fierce ambition\nDon't speak, I'm a freak with the meat in position\nI love orgies, I'm horny, it's fun time\nI like to fuck at least two at one time\nKind of thick, promise not to cum quick\nI got the - long dough, long braids, and the loooooooong dick\n\n[Hook]\n\n[Apache]\nThat's my nigga if he got bigger he'd be my bigga nigga\n6 foot 3, maybe a quarter of an inch bigger I'll figure\nSince you're wet, get set to give me that\nMy dick so big I use a skully for a jimmy hat\nTonto's a Tec-9, my nuts are the two clips\nWhile I bone and ya moan as I pinch ya nips\nWhich is the reason the girls are always grabbin\nIt's back to the crib for some of that CABIN STABBIN-AH\nI got pull, I'm not the fool that's in a back sleep\nI keep you warmer than the wool on a Black Sheep\nIt's hereditary, so honey let your drawers drop\nThis dick was passed down from my pops and his pops\nCheck the ho pro, bend over and grab your ankles\nOr remind me, I might forget to say thank you\nKind of thick, promise not to cum quick\nI got the - long dough, long braids, and the loooooooong dick\n\n[Hook]", "year": "1993-02-09"}]}