{"songs": [{"title": "Jit/Juke", "album": null, "year": "2014-09-12", "image": "https://images.genius.com/63a72ca99fe179eea4ec7be13d9fa6e3.750x750x1.jpg", "lyrics": "[Verse 1]\nHo, I got my cell phone ringin', nowadays it's hard to get me\nNine times out of ten, if you ballin' then you busy\nSippin' Henney, sippin' Rémy like it's Chrissy\nAnd I pop that champagne like it's my birthday, really it's a Wednesday\nAll about the benjis, I've been gone all year\nCame back, I swear you niggas ain't done moved an inch or centi\nMind movin' like a semi, pop pop pop, the truth is\nI feel like masseuses when I back off in this bitch, I feel the tension\nHo, you've got your hand out, what that mean, like gimmie?\nWhat you need your ass, a penny? Better off askin' for kidneys\nI know thug ass niggas that'll run in your house\nYou lock the door, you lock the window, they gon' come down the chimney\nSkinny nigga but I walk inside this bitch like Dikimbe\nI'm the Laurent St., I keep a angel face with me\nYou got your hand out, ho, again, what that mean, like gimme?\nWhat you need you, a penny? Better off askin' for kidneys\nIf a bitch don’t suck my dick, I swear that shit just offend me\nHo, I'm really from Detroit, I went to Cass and not Renni\nActin' like you can't die tonight, what, you gon' come back like Kenny?\nI roll up spazzin' like Timmy, hand is attached to the benjis\n\n[Hook x2]\nAtta-tached to the benjis, not attached to these feelings\nI don't love these hoes, I'd rather fuck me a million, I mean it\nIf I said it, I mean it\n\nIf I said it, I mean it\nIf I said it, I mean it\n\n[Verse 2]\nNigga, I be the most imitated, my crib renovated\nMy old bitch assessin', my new bitch is waitin'\nJust like a doctor with my operation\nI got me my check-up but still got no patience\nAll of these texts and calls I'm not takin'\nMy phone overflowin', that shit can get drainin'\nI signed up with Ye, and he just explained it\nHow we gotta get it like Jay-Z and Damon\nDid back in the year that they came in\nStuck between a ROC and the G.O.O.D. place is where I'm remainin'\nBitch, it's finally famous\nWhat you do in a day I could do before breakfast\nYoung nigga T-rexing\nMy old bitch wish that she would've got pregnant\nTryna be the first lady because my wrist just won a presidential election\nBitch, and I hope you offended\nI said it, I meant it, I hope that recorded\nI just broke a Guinness\nI flew in from Italy through the Pacific\nShout out to Kourtney, Kim, Khloe and Scott Disick\nWhen you see my pretty face, shut the fuck up and kiss it\nAnd just know that my hands\n\n[Hook x2]\n\nIf I said it, I mean it\nIf I said it, I mean it\n\n[Outro]\nIt's goin' down, down in the earliest round\nAnd baby, we'll be goin' down swingin'\nI'll be your number one with a bullet\nI've got a loaded God complex, cock it and pull it\nIt's goin' down, down in the earliest round\nAnd baby, we'll be goin' down swingin'\nI'll be your number one with a bullet\nI've got the safety off, cocked back, ready to pull it"}], "artist": "Big Sean"}