{"artist": "R.A. The Rugged Man", "songs": [{"album": "Night of the Bloody Apes ", "year": "1994-11-05", "lyrics": "[Intro]\nMy drill!\n(What the fuck?\nThis man is a fucking asshole\nYo, that nigga sucks\nWhat a dick)\n\n[Intro: R.A. The Rugged Man]\nCrustified Dibbs!\nWord up, I send this one out to tha, ah, real men in America!\nCheck, check it, yo, um, I'm gonna kick it like, um\nGrab ya dicks! Raaargh!\n\n[Chorus: R.A. The Rugged Man]\nWalking down the street with my nuts in my hand (x4)\n\n[Verse 1: R.A. The Rugged Man]\nRarragh, who am I to call me crusty? The crust\nI got the crust dripping down, uraargh, my crust bound nuts\nI love them, I love them, I love it when you snug them\nYa lips should hug them but if not don't bug them\nOne time, the way we got the, uh\nHit me motherfuckers are you with me? (Grab ya dicks!)\nIt's the Crustified, ya better run and hide\nI separate, ya got the guts pussy wet inside\nI disrespect the next man, 'cuz a real man\nDoesn't have respect for nobody but himself, why can't they understand\nWhy I got to walk down the streets with my nuts in my hand\nMost all of them said I'm discombobulated\nObligated, grabbing on my dick, baby!\nI'm shooting offloads, my nut sack explodes\nYou're a whore to me ya nothing more to me, that's how it oughta be\nI'll be the Rugged Man, Toolbox Murderer with crust bound nuts!\n\n[Chorus]\n\n[Verse 2: R.A. The Rugged Man]\nI'm a rude boy but no kind of nervous\nMy kind another mind will rape ya mama (like this!)\nRight behind her and, uh, why would you, uh, fuck with me?\nUh, I'm having a nervous breakdown\nFuck the elders, I hold her\nUp like a boulder when I bend her\nThat's the bitch I dismembered, uh\nNow I got her to flip with my dick on ya lip\nThen I skip to the honey dip, like.. um\nWhat's up baby, come see me baby, or something like that\nI respond... I'm one step beyond-ah\nThe fat bitches are mad gone\nI'm the now type to say [?]\nNo, I'm sorry (but I'm hung with, R.A.) Do you wanna die?\nSo all ya hoochies would open up ya coochies\nAnd lick the cooties off my testicles\nI gotta pick 'em out and die Belushi's\nCrust Bound, Crust Bound\nI put my nuts in ya mouth so spread the word around\nNow that ya know, throw up ya hands and show it\nI'm walking down the street with my crust bound nuts\n\n[Chorus]\n\n[Verse 3: R.A. The Rugged Man]\nWord up, I got to bust a nut\nGive a fuck about the slop 'cos that's my hobby\n'Cos I might kick the door, I'll strip a whore\nI go to war, I could dick like Tipper Gore\nSo fuck that dyke feminist, I reminisce, remember this\nI missed I got some of that and some of this\nI'm grabbin' on my nut sack\nGets a bad rep, but I'll never cut back\nWatch I grab that body bag that\nWhilst I grab my motherfuckin' nut sack til my nuts black\nNow I'm the most, the coast to coast braggin'\nPut me on the wanted poster, grab my nuts like I'm supposed to\nI got my nuts in my hand\nSO WHO WANTS THESE NUTS IN THEIR MOUTH NOW?!\nSo get a little closer\nAnd I'ma smack you with my dick when pops like a toaster\nAnd I knock it scumbag out of the pocket\nI rip a bitches pelvis bone out the socket!\nSo if you giving up the butt, fucks\nAnd if you think you're all of that\nThen you can get my crust bound nuts!\n\n[Chorus]\n\n[Outro: Marc \"Nigga\" Nilez]\nYeah, grab ya motherfucking balls, bastard, yes!!!\nCrust Bound Nuts, yeah, come on, we out!\nFuck how we rap, yo\nRappers grab ya fucking ballsing ya hand and squeeze tightly\nI'm getting drunk and happy!\nGrab yo fucking nut sack!! We out\n(Look you see on you're on the tip, my hands on my testes)", "title": "Walking Down the Street With My Nuts In My Hand", "image": "https://images.genius.com/0459459cdc2f6a1ba50292d192b060db.500x500x1.jpg"}]}