{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/770790566878699d43ed58ab69a253ba.1000x1000x1.jpg", "title": "Excalibur", "year": "2003-07-08", "album": "Black August", "lyrics": "[Intro: Killah Priest (sample)]\nThat's it, it's war\nPriesthood, Priest\n(Mother Earth was pregnant from third thing\nYour in lock with it, I have tasted\nThe maggots of the man, I was no up in this\nBut I knew I had to rise above it all\nOr drown in all shit)\nPriest, Proverbs, hahaha\nYa'll cats think I was just gonna come off, and I don't get none\nThought ya'll wasn't hear from me again, right?\nThat's right baby, Killah Priest, Priesthood, Priest Stone\nKnowhatimean? Priesthood, yeah, uh\nYeah, yeah, this is Priest, yo, Killah Priest, Priest Stone, Priesthood\nBack for good, knowhatimean? Thought ya'll wasn't gonna hear from me again\nNow I gotta scream on everybody (family) everybody battlin'\nBattlin' in the street, whatever, check this out, yo\n\n[Killah Priest]\nIt's Priest standing in his greatness, God's favorite\nI rock the Star like King David, my Queens bathe in\nI walk past, they start wavin'\nEach arm, a thousand bracelets, face it, I'm the greatest\nMade women drunk from the royal fragrance\nI rock the latest in fashion, my jewelry flashin'\nIn other countries, they can hear my magnums\nWhen they blastin', I heard they sound like thunder clappin'\nHit you in your stomach, watch you start gaggin'\nWho gives a fuck if you're platinum?\nIf you're lyin' in a wooden casket\nFor good, now that's 'hood...\n\n[Chorus: Killah Priest]\nYo, every knee shall bow, every tongue shall confess\nEnemies lie down while I'm clutchin' my tech\nIt's on, the Priest, the Prophet, the King, the God\nThe sun, you see him quickly when I'm poppin' my gun\nIt's on...\n\n[Killah Priest]\nThou shall fear me, only as thou'se been guilty\nFeel me, sincerely yours, Priest, now industry tried to kill me\nBefore sat at tables, like the Savior at The Last Supper\nAmongst nine rap lovers, three crack hustlers, with gats covered\nPeep my last words, in the Proverbs, observe me\nIf you're worthy, I 'member your ass show\nWhen ya'll was wet and cold, I cover ya'll with robes\nGave ya'll flows, when ya'll give ya'll soul\nI gave ya'll flesh, covered ya'll bones\nBreathed in you, sat ya'll in thrones\nNow ya'll betrayed me, I raised thee from babies\nTo ya'll were grown men\nFor your birthday, I gave ya'll your own pen\nTo write with, beware of vipers, and snakes and biters\nI taught ya'll about the depths of words and dark sentences\nNow ya'll don't remember shit, but try to mimic it\nWhen I see my crown, just give me it, it's mine\nSeek your own rhyme, it's on, seek your own rhymes, come on!\n\n[Chorus]\n\n[Killah Priest]\nI lay rappers down, with the mac or the pound\nPop 'em, stretch 'em out with they backs to the ground\nLeave 'em lost in the woods, gotta find them with hounds\nMy four five'll turn a nigga from fatigues to bow-ties, no lie\nPut a nigga close by, the Most High\nOr he's a Dream Catcher, the Indian myth, pick one\nSemi or fifth, your shell get hit, ladies spell my shit\nA-D-D, I-C-T, I-V-E, lick your lips, come try me\nContestants, hook 'em up to I.V\nIn hospital, I pop pistols, fellas get ya hit like Hot Nikkels\nKillah Priest, the Priest Stone, or High Priest, I pop three\nLeave rappers in memory, the winner be me\nPriesthood, A.K.A. Body, yo\n\n[Chorus 2X]"}]}