{"songs": [{"title": "Big Sean Freestyles on Flex | Freestyle #041", "album": "Funk Flex Freestyles", "year": "2017-02-02", "image": "https://images.genius.com/245f4bc41f8d423fa59b932bdeaf60e5.719x719x1.jpg", "lyrics": "[Verse 1]\nStraight up\nLook\nThe album droppin', they gettin' nervous\nI cancel my Uber, it's time to lift the burden\nKnow if I take a pay cut that you gon' need a surgeon\nI don't want the top spot, I deserve it\nAll I do is show love and it keep reversin'\nDetroit, stand up, you know I'mma lead the resurgence\nAnd prove so much my old shit sound like another person\nYou know how the story go\nNever stuck to the script or storyboard\nI just left a four o'clock appointment with the oracle\nShe told me I got more to go, her boss workin' like I'm fresh off the unemployment though\nAnd I'm celebrating like they told me \"You are not the father\" live on the Maury Show\nIt ain't over till a nigga overdose\nI heard your new shit and I fell asleep\nAnd wasn't even sleepy, that's how I know it was weak\nLook, respect someone who came from the D\nWas able to eat, put his friends and fam on and we speak\nWho inferred that anyone who skin color this deep\nWho still hasn't peaked\nWho gets better every verse and word that he speak\nSheesh\nFlex let's go\nSettin' the tone?\nYeah, we settin' the tone\nYou lettin' them know what it is?\nYes, sir\nI Decided tonight\nLook\n\n[Verse 2]\nI know 'Ye proud of me, he took me out of debt\nI know Jay proud of me, he put this 'round my neck\nAnd I might just kill ISIS with the same ice pick that I murder Donald Trump in the same night with\nLyrically I'm prepared for the worst\nSpiritually I'm prepared for the best\nBut somehow I ended up in the middle\nThe exact place where me and destiny met\nAnd I'm still findin' perfection in the imperfections\nTryna go the right way in life's intersection\nYou're now fuckin' with the most impressive\nThe most requested, you're witnessing the underdog's interception\nAnd fourth quarter when you thought it was all over\nI'm doin' the touchdown dance breakin' they hearts and records\nAnd I probably wrote this shit down there in Austin, Texas\nLivin' a life that'll turn my girl to a detective\nI'm livin' a life that'll turn my dogs to some executives\nI'm livin' a life that'll turn my dreams to some perspectives\nSpeaking of dreams, I got new dreams and new goals\nMy new vision is two-oh, by two-oh, that's 2020\nJust tryna get that old money, young and find a loophole\n[?] and my dogs in a conference call that can use those\nSo we don't gotta look back like we missed that boat\nI got old niggas dissing, ex-girls missin'\nTell me, when did life become a game of tic-tac-toe?\nI'm celebrating everyday like I got misdiagnosed\nWith terminal cancer, but it was just that cold\nOh, shit\n\n[Verse 3]\nI keep it anchored for you, rain, sleet or thunderstorm\nLoyalty nowadays rare as a unicorn\nI dedicate this one to stories that never get told\nOnes who been offered the world for they souls but never get sold\nThose are million dollar offers but chose another road\n'Cause you realize stayin' loyal to you is always worth more\nIf the sky falls, you know I pick it back up [?]\nIn tune with the universe, like it's angels singing backup, man\nNiggas ask me what's my backup plan\nI look at 'em and say, \"Does God have a backup plan?\"\nI'm sayin', look, I ain't God but I'm godlike\nGod don't like ugly, so I must one of the ones God like\n'Cause I been at the right place at the wrong time\nWith the wrong people at the right place but still ended up here on time\nStill ended up on time\nLook, I guess it's hard not to get spotted when you livin' in the spotlight\nI got my clique poppin', but I hardly live that pop life\nMighta popped a popstar, had paparazzi pop lights\nBut don't get it twisted, I'm in L.A. livin' that Pac life\nIn New York livin' that Big life\nI'm in Detroit livin' that Don life\nI left my last bitch and got my mom right\nAnd I'm still carvin', killin' niggas, dearly departed\nWorkin' the game like a nigga blew in the cartridge\nThey know my name in Denver like I'm Eric Cartman\nI put granny in the crib like I'm her father\nAll my neighbors went to Yale and Harvard\nCaptain of the squad forever startin'\nCheck the highlights, no yellow markers\nI'm deadly switchin' Rollies onto ice like I'm cooking Crystal Light\nMy role model Walter White, my role model Walter White\nMan fuck gettin' indicted, boy, riots gettin' incited\nBlack boy from that black [?], I'm just tryna bring light in\nYoung hero in my city: Teen Titan\nThe team the tightest, I touch her and she wet beside it\nWhen I get inside it\nBut honestly, I can't get even too involved\nPhone full of numbers, but ain't too many to call\nContacts on contacts, I hate we lost contact\nI know I got more exes than a contract\nBut I wish it was you and me, remember when you were roofin' me\nI wish there was one me for you, one for my family, I mean a group of me's\nGoddamn, had to take a breather\nShit, can you believe it\nHold up, I ain't done my nigga\nNeed another?\nNo, hold up\n\nHa ha ha, yeah of course we here\nWhere else would we be at?\nOkay, let's go\n\n[Verse 4]\nOkay\nShout out my nigga Esco\nYeah\nLook, real ones\nLook, all I ever did was figure it out\nBack when a nigga used to have to live on the couch\nAnd had to brainstorm this shit just to get through the drought\nI strategized it in my head and started livin' it out\nMan, these niggas want to purse what I do on the work\nDrag my name through the mud without doing the dirt\nI put your face on the shirt like I'm doin' your merch\nYou love to talk, I'm 'bout doin' it first\nLook, I see no change, you can keep the refund\nAnd all the reruns, I seen it all before\nMan, I haven't been satisfied in a row\nThat's one time, two times, three times\nFrom where there's more pieces than piece signs\nAnd gang signs and street signs\nHard times, but you pay your fee to be a phenom\nI pull up in a car so busted that I'm hidin' in it\nDon't want that Kia even if LeBron is ridin' in it\nPsh, I'm offended\nKnowing soon as he leave that commercial he pullin' off in that Bentley\nFeelin' like the ninth inning, got a home run hittin'\nStone cold spit it, I'm too in tune to be inconsistent\nAnd I done been through the ups and downs\nAnd stay down and waited for ups to come around\nYou woulda thought we robbed a bank how I'm tryna run the town\nAnd how cops hunt us down as our time runnin' out\nI pray that karma doesn't get confused with\nSomebody who didn't put the hours and work in and who's useless\n'Cause I'm God's MC, like Jesus produced it\nIt's time to make it work and not make excuses\nWhat are you sayin', my man?\nAskin' me about my own\nWhat you tryna do what I do, boy, what, you want be my clone?\nYou ain't been through what I been through, you can't put that in songs\nWhat you tryna prove me wrong like the banks that put mom on loans\nYou better watch up your tone, like you talk on the phone\nI'm a [?] like I'm sittin' on drones\nDamn, look\nI'm tryna take the greatest story never told and make it my own\n\n[Outro]\nFlex\nI Decided out right now in this motherfucker\nMan, I ain't slept in two-three days\nI'm on beast mode\nWhatever niggas say about me, fuck what you sayin' if it ain't love\nAll I do is live my life and love, show love\nThat's what you supposed to do\nThat's the way that Jesus do it\nIf you hatin' on me, fuck you\nYou know what I'm sayin'?\nFlex in the buildin'\nG.O.O.D. Music all day\nDetroit all day\nYou see the chains?"}], "artist": "Big Sean"}