{"artist": "Peewee Longway", "songs": [{"album": "The Blue M&M Vol 2 King Size", "title": "Cut Like Me", "image": "https://images.rapgenius.com/26e39317f30d490c8be1f2c16e946222.500x500x1.jpg", "lyrics": "[Intro:]\n(Longway, Longway, blue on my end, bitch)\nWe made it clear\nCut from a different cloth\nThis cloth, can only be found in select areas..\n(You ain't cut like me.. what cloth were you cut from?)\n\n[Hook:]\nThese niggas be screaming they with the shit\nThese niggas be screaming they gangster\nThese niggas be screaming that trap shit\nBe the same niggas, that scream out your name\nThese niggas ain't cut like me\nThese niggas ain't cut like me\nThese niggas ain't cut like me\nThese niggas ain't cut like me\nThese niggas be screaming they with the shit\nThese niggas be screaming they gangster\nThese niggas be screaming that trap shit\nBe the same niggas, that scream out your name\nThese niggas ain't built like me\nThese niggas ain't built like me\nThese niggas ain't built like me\nThese niggas ain't built like me\n\n[Verse 1:]\nYou see me that on me lil nigga\nNo hesitation I squeeze on the trigger(pow, pow, pow!)\nWith no co-defendant that 40 my nigga\nTrapping in the trenches, Callaso living.(trap, trap, trap)\nWhy me work that bitch, her name Mrs. Bentley\nPussy nigga, get interrogated go snitch\nThese niggas ain't really with the traplife shit\nWorking all the time, they telling on shit\nAin't got no convo for bales or a brick\nKeep the cash I ain't trying to get in Paperwork\nThese niggas ain't shit like me. (Like Wee)\nCatch your bitch, and she dropping her panties first\nThese niggas ain't shit like me\nI'm cut from a whole 'nother cloth\nRun the sack up, stash it, no I ain't go ball\nI keep me two pistols, no undo at all\nAnd a bitch so we can go work out the spot\n\n[Hook:]\n\n[Verse 2:]\nI really ain't feeling your gangster my nigga\nThey did cut you from the same blanket my nigga\nCrippin with 50, don't hang with no wangsta\nShoot some shit up until we see bodybags\nYou can pull up to my spot we sell nothin but bags\nForeigns on foreigns with the paper tags\nI run up them bands so don't go out sad\nI talk on the phone because it might be the Fed\nTrying to purchase it but I end the call on his ass\nI thought you were gangster, now you tell the Twelve\nI had to relocate the spot on their ass\nTrappin the same old shit just a different mailman\nSame clientele with the same old scale\nThese lil niggas ain't cut Like me, can't you tell?\nThey screaming that shit\nI'm really with that shit\nPull up where you at?\nI'll flip your shit!\n\n[Hook:]", "year": "2015-02-10"}]}