{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/c894c3152f72ae90e1494d821e111ee2.450x450x1.jpg", "year": "2012-07-04", "album": "Back 2 The Throne", "lyrics": "[Verse 1: T.I.]\nGuess, who's, back, home!\nG shit, certified, nigga can’t touch him\nBosses all love him, haters, well fuck them\nBought cribs everywhere, everything custom\n\"Lun-bun-ton\", bougie bitches like \"What’s them?\"\nSolitaire clear stones, Maybach: clear dome\nBlowin' on that loud pack, bankroll's full-grown\nWell-known convict: go on with the dumb shit\nThug life wit' it, like it tatted on my stomach\nNigga better pick another number because I am not the one\nThe bigger picture's what's important before all is said and done\nI bet I get this shit back up under my feet\nBullshit aside, what I want, I keep\nI’m the big bad wolf, and I want my sheep\nYour birthday cake, I want my piece\nI’m beefing with MC's at the meet\nIt seems they’re less than decent\nI’m a beast, then you’re my feast\nApologies, you just can't keep it\nSay you’re winning?\nGuess you’re being condescending and facetious\nG’s from sea to shining sea\nYou may bump this in your Caprices! Bow!\n\n[Verse 2: Yelawolf]\nI once had a friend named Charlie\nAnd Charlie was always late to school\nHe had a black eye one day\nBut he wouldn’t say just what happened to him\nCharlie got mad in class one day\nAnd stood up with a .22 pistol\nTold everybody that he couldn’t take it anymore\nHe was over being the victim\nSee, one bullet through the wall\nAnd the history class was interrupted\nCharlie fell down in a pool of blood in the class\nThat made it public\nHe said that the bullies in school\nThey drove him to be a suicidal\nCause the mirrors didn’t reflect the criteria\nOf an American Idol\nWell, sometimes I feel like I could run\nThrough the hallways with an AK, too\nNot sayin’ that I would\nBut it might feel good to off me a rapper or two\nSo, I loaded this pen with a hollow tip\nAnd I followed Tip\nTo the hollow pits of my heart for shit\nFor you to role model with\nTake a fifth of Jack and swallow it\nTake a point shell and hollow it\nDon’t be the one with the gun\nBe the one with the rum, plus two models with\nAll the kids, listen up\nYelawolf don’t give a fuck about a club\nI don’t wanna see you in school, tryna’ do what I do\nTelling folks you gon’ pop the trunk\nMake something of something\nOr something from nothing, baby wake up\nPlay Radioactive, let me see the reaction\nSee if I really give a fuck; Shady\n\n[Hook: Lil Jon, (Yelawolf)]\nUp in the club, don’t give a fuck\nUp in the club, don’t give a fuck\nUp in the club, don’t give a fuck\nUp in the club, (still don’t give a fuck!)\n\n[Verse 3: Crooked I]\n9 millimeter, ride with a heater, drive with a liter\nI’m finna need a mic and a speaker\nI’m finna be the prominent leader, confidence-eater\nTell competition “Hasta la vista”\nDog, you putting my name in the middle of sucker shit\nIs something like you gettin’ raped by a stranger\nCause you do not know who you’re fuckin’ with\nCrooked is a product of the S-L-A-U-G-H-T-E-R\nYou, \"haha\" funny, I had money when the DVD was a VCR\nNiggas about to need CPR when they see the car, kill 'em, dead\nMight pull over, fuck my chauffeur\nCause I screw drivers: Phillips Head\nThem I’mma tell her to take me to Yela\nGetting fucked up, I ain't feelin’ embarrassed\nThe feelin’ in the air is the 2.0's party\nLike niggas and wiggas in Paris\n\n[Verse 4: Royce da 5'9\"]\nNickle 9 a rider, arriving at the drama\nThe driver firing the llama\nGot a bunch of fly bitches saying \"Hi\" to me now\nCause a nigga said \"Hi\" to Rihanna\nCause I look good, and I smell good\n(It’s a man’s world!)\nThat's right, I’m the new James Brown\nDrunk in an interview, fuck you finna do?\nWhat I’m finna do is go to the strip club and order 8 bricks\nI’m on my T.I.P. in A-T-L\nLookin for a lil pretty young thing I can skate with\n(Where we goin baby?)\nRadioactive, Shady gon' make it go platinum, I couldn’t resist\nTo jump on that Slaughterhouse, Yelawolf\nLil Jon, Hard White remix!\n\n[Hook: Lil Jon, (Yelawolf)]\nUp in the club, don’t give a fuck\nUp in the club, don’t give a fuck\nUp in the club, don’t give a fuck\nUp in the club, (still don’t give a fuck!)\n\n[Verse 5: Joell Ortiz]\nLil Jon, let me get a lil' bit\nI mean a minute, nothin’ crazy, it’s just that I’ma lyricist\nAnd I’ve been sittin’ with this ridiculous venomous bite\nAnd I’m so ready to strike, a swing and a miss!\nMy dick swing in your miss\nI got a missile, can’t call it, I might misdial\nI’m in orbit listening to Em’s last album\nGuzzling gin: recovering alcoholic\nEverything looking all right\nWelcome to the lyricist's pub, who wanna bar fight?\nIn a bar so high cause you're dealing\nWith 4 dope muhfuckers and 2 hard whites\nDeuces, period, crop circle\nThat's the family that matters, I’m not Urkel\nBut I’m smooth as Stefan when I move to snap on\nYour eyeball, your shit’ll look purple\nI’m a product of the PJ’s\nStill walk through that motherfucker in my PJ’s\nYeah I’m in J.P. Morgan often but\nDon’t think I could get chased out the PJ's\nSo try me punk, bet your body jump\nWhen this shotty pumps, have your body slumped\nYelawolf let me rip this hard white but\nPlease don't make me pop the trunk\n\n[Verse 6: Joe Budden]\nRoll that window down and start dumping!\nPull up on whatever block that y'all on\nPills got a nigga walking round doing stupid shit\nMy definition of an oxymoron\nThat ain't never stop me from gettin’ a bad one\nI would tell niggas again but they heard the story\nFurthermore, he got a couple I ain't bust\nBut there's no need to rush, they reserved it for me\nSee I’m all about fam’, I don’t fuck with the rest\nGoon’s that’ll squeeze 'til a couple is left\nThe squad, the facade, the sm-smoke and mirrors\nYellin' \"Payback!\", too broke to cover the debt\nBut I’m grown, adults, and whether that shit you say\nYou don’t reciprocate love or respect\nYou get plugged, and you're gon' need doctors\nTo cover your holes as if they never loaded cassettes\nYou probably didn’t hear me, standing on the couch\nGet froggy, I'm breaking any bottle that's near me\nSo real I don’t need a hollow to prepare me\nI’m the first one in the hood to catch a body using Siri\nCause they be thinking that I seem crazy\nMoney-motivated, CREAM make me\nWay out your league, go and dream maybe\nT.I., Team Shady\n\n[Hook: Lil Jon, (Yelawolf)]\nUp in the club, don’t give a fuck\nUp in the club, don’t give a fuck\nUp in the club, don’t give a fuck\nUp in the club, (still don’t give a fuck!)", "title": "Hard White (Remix)"}]}