{"songs": [{"year": null, "title": "Love, Hell or Right", "image": "https://images.genius.com/e24c7668835e021f3dbe8ae4d87080bc.400x400x1.jpg", "lyrics": "[Hook]\nI am the maker, owner, cream of the planet Earth\nFather of civilization, God of the universe\nLove, hell or right all night\nLove, hell or right all night\n\n[Verse 1]\nMe and Spinna done collab'd before\nUsually gotta catch him when he's home off the tour\nI wrote this on the day of knowledge build\nProving that the God's still skilled\nMe and Spinna is a good combination\nThey give me a platform to speak to my nation\nTo save my generation, one by one\nWe can do it peaceful or gun by gun\nWhenever you look into the sun, we reflect\nBeing that I'm civilized, I gotta stop lies\nOlder preachers got you looking in the skies\nEmpty your pocket right before your eyes\nA black man dies, he returns to the essence\nHis physical is gone, but he lives through the lessons\nPeace to the first born, could never be the worst born\nWe want the best part of this motherfucking Earth\n\n[Hook]\n\n[Verse 2]\nThe Nubians came, they said we hated white people\nNo, we just wanted our brothers treated equal\nNow here's the sequel, two thousand twelve\nWho's down, who knows how to save themselves?\nWho is the mystery god? Have you seen him?\nStudy your math and go straight to the gym\nPhysical and mental; You healthy? You got dental?\nBlack man, raise your family with a plan\nYou ain't gotta raise y'all hand on the wiz\nThat's they shit, that's his\nWe still in this bitch\nGod rose in equality\nDean in equality\nJustice for the snakes\nMy word is bond, and if that breaks\nI don't care what money this makes\nThis is for the seeds\nI'm here for they needs\nTeach them at home\nYou can't control the shit, they see you when they grown\n\n[Hook]\n\n[Verse 3]\nWhy I'm still here with Spinna on the beat\nI love to do this, plus I still gotta eat\nCovered this Earth with a lot of square miles\nThe I self lord and master of styles\nX is a reminder of the people I must save\nSome of us stand, but some are still enslaved\nThe God is peaceful, always forgave\nBefore we put another in the grave, I just\nLet's have a valid reason to bust\nPower is the light to take us out of the darkness\nFind your mind and it will spark\nMister ignorant nigga is the one that's controlled\nThe righteous black man is a sight to behold\nI hope you got enough of my wisdom, belly be swoll\nAnd that's right, yo", "album": "Love, Hell or Right"}], "artist": "Sadat X"}