{"artist": "Khia", "songs": [{"image": "https://images.genius.com/32deca0fcef2f3102d33fef2ae5d613b.640x640x1.jpg", "title": "Lick Me Dry", "year": "2012-07-12", "album": "MotorMouf Aka Khia Shamone", "lyrics": "[Chorus 1]\nLick, lick, lick, lick, lick me dry\nDon't try to lie, bitch, you ain't shy\nCome do me, motherfucker, stop frontin'\nPut yo mouth on it, don't say nothin'\nAll I wanna hear is your lips smackin'\nNo half-steppin', just your lips smackin'\nPut yo tongue in and out the back end\nPut it in deep, watch this pussy start snappin'\n\n[Chorus 1 repeat]\n\n[Chorus 2]\nLick, lick, lick, lick, lick me dry\nDon't try to lie, bitch, you ain't shy\nCome do me, motherfucker, stop frontin'\nPut yo mouth on it, don't say nothin'\nAll I wanna hear is your lips smackin'\nNo backtalk, just your lips smackin'\nFlick yo tongue in and out the back end\nPut it in deep, watch this pussy start snappin'\n\n[Verse 1]\nLemme grip, grip, grip, grip down on the dick\nDrop, drop it down low, now watch the pussy split\nVibratin' on the dick, gotcha wanna leave ya bitch\nPussy sittin' pretty tight, like the way ya lick the clit\nLet's go, deepthroat, swallowin' every little bit\nYa ain't never met a bitch with a pussy so sick\nThug Misses, drawn tight, supermodel on the dick\nEat the pussy all night, I don't never wanna quit\n\n[Pre-Chorus]\nLick, lick, lick, lick, lick, lick me\nTip, tip, tip, tip, tip, tip me\nWhere ya money at, nigga? 'Cause ya know ya gotta spend it\nAin't that whatcha came for, 'cause my pussy is the shit?\nMs. Good Pussy lookin' for my Mr. Good Dick\nThick, big, long dick, show me whatcha workin' with\nStand up in this pussy, rock steady, nigga, get it\nPut some bass in ya voice, don't be scared, nigga, lick it\n\n[Chorus 1 twice]\n\n[Chorus 2]\n\n[Verse 2]\nCome now, next round, bite down on the tip\nYeah, I know ya heard about me, and ya know that I'm the best\nWell, ya better not tell ya niggas 'bout this good pussy\n'cause, boy, ya know they gone want this good pussy\nAnd I'm-a keep on this pussy right back\nCandy-coated with a cherry on top, ya like that\nLick me like a lollipop, and I'm-a lick it right back\nI know you like the way this pussy lookin' juicy from the back\n\n[Pre-Chorus]\n\n[Chorus 1 twice]\n\n[Outro]\nLick me dry\nLick, lick, lick\nLick me dry\nLick, lick, lick\nLick me dry\nLick, lick, lick\nLick me dry\nLick me dry\nLick me dry\n\n[Outro repeat]"}]}