{"artist": "IDK", "songs": [{"title": "Mr. Mills", "lyrics": "[Intro]\n(Sex, drugs, money) x4\n[Jay IDK]\nOk cool now we gonna go on pace, you ready?\n(Sex, drugs, money) x4\n(Harmonizing)\n\n[Verse 1: Jay IDK]\nI guess I figured it out\nMoney ain't shit\nI guess I figured it out\nMoney is a dick\nA bitch will tell you your shit is good\nIf your money long\nEven if your dick is shorter than Gary Coleman\nShe moan\nLuckily that ain't the case (pause)\nFor me\nMy shit is in a different court\nMy ball is on a different porch\nGot stolen from the bad kids across the street\nThey been plotting on this robbery for months and weeks\nThey name is IRS, Sally Mae\nCircuit court, Penn State\nBad Bitch, Saks Fifth\nNew car, bathing ape\nJewelry, food to eat\nNigga mentality\nCoonery\nMake my pockets in need of a eulogy\nI'm spending everything I got\nOn everything I don't need\nMore weed, more weed\nI should be smoking no weed\nMatter fact I quit...\nCause every time that I start to smoke\nThat's when the paranoia begin\n\n[Bridge]\nI put my hand on the bible\nMy other hand in my pocket\nI pull it out that's my wallet\nI take the dough out and cop it\nBut I don't do it for profit I do it for show stopping\nI'm fucking up that's the topic\nMy hand still on the bible\nI'm tryna shit on my rivals\nI don't do shit for survival\nI'm greedy, I gotta gobble\nI gotta fuck all the models\nWe gotta pop all the bottles\nWe balling out full throttle\nThe bum wanted a dollar I told him\n\n[Hook: Masego]\nMula, Mula\nIt's all in your thoughts, your thoughts your thoughts\nMula Mula\nIt's all in your thoughts your thoughts your thoughts\nMula, Mula\nIt's all in your thoughts, your thoughts your thoughts\nMula, Mula\nIt's all in your thoughts, your thoughts your thoughts\n\n[Verse 2: Jay IDK & Masego]\nSometimes I talk about money that I ain’t got\nI'm lukewarm but I rap like I'm already hot\nAnd I ain't got a car but I'm working towards the shit\nSo if it don't matter if I exaggerate just a bit\nVroom, that's the 6\nThat's all on my forehead\nThe back of my head laid on couches with no bed\nTwo pockets with no bread\nSome friends that help out\nWill equal my only chance to success and a way out of the PG\nMentality that had me in the streets\nI’m CC’ed on emails\nWith the label chief\nMy friends see\nThey say sheesh\nHe got lots of cheese\nIt's probably from the smiles that they see on my IG\nBut them smiles ain't really me\nI got piles of money owed\nBut I got me a gold chain\nSo you niggas will never know\n\n[Skit: Kain Carter & Jay IDK]\n[Mr Mills:] Hold on bro i got a call. One second, settle down, settle down\nHello who is this?\n[Brian Arsinal:] Hello my name is Brian Arsinal, I'm calling from Star Alliance Collection Agency. I'm trying to get in touch with a Jason Mills?\n[Mr Mills:] Yeah that's me\n[Brian Arsinal:] Mr. Mills, this is an attempt to collect the debt. Says here you owe a grand total of thirty-thousand dollars to a Midway Recording & Production company. I almost don't know why I'm even making this phone call\n[Mr Mills:] Hey bra, don't talk to me like that bra\n[Brian Arsinal:] You the type of nigga that motherfuckers just come and look for, Mr. Mills\n[Mr Mills:] What the fuck is this nigga talking about?\n[Brian Arsinal:] Thirty-thousand, for a recording and production company?\nLike what are you, a rapper or some shit? If this was the mob, you would be dead right now! You realize that? Your family would be dead! Your kids would be in a dumpster!\nRight next to your fucking mixtape nigga", "image": "https://images.genius.com/d97b0ca6e4041c74908a8955878702c7.500x500x1.jpg", "album": "The Empty Bank", "year": "2016-09-09"}]}