{"songs": [{"year": "2016-10-20", "image": "https://images.genius.com/276f9ce7db4fdfcb8518ab6ab64cfd4a.500x500x1.jpg", "title": "Warrior", "album": "H.O.G.", "lyrics": "[Hook: Mackenzie Nicole]\nI'm a warrior, what you know about me, for real?\nWarrior, if I said it, I did it, for real\nI'm goin' beast mode, from the west to the east coast\nAlways stickin' to the G-code\nWarrior, and I'm made that way, say it that way\n\n[Verse 1: Big Scoob]\nI've been stepped on, and felt low like less than a man\nBut I bounced back, we get back, got back to the plan\nI been bust on and bust at, been hit with a few\nThen I came back, and bust back, I'm hittin' 'em too\nLet this liquor get the best of me, I'm drowning in this bottle\nOnly speakin' on my demons, I ain't looking for no sorrow\nFuck tomorrow, I'm just livin' in this moment that I'm in\nKeep it hollow in the chamber, if it's danger I'ma win\nAnd anger is my issue, that keeps me from my issues\nFuck you funny niggas, I'ma miss this just to get you, if you\nClaiming that you real, but you see though\nClaiming you's a pitbull, but really you's a shih tzu, you bitch, you\nTryin' to shake the ground I'm standing on\nFeet planted firm in the sand, and I'm strong\nUnderstand that I'm ready, bro, for anything I'm facing\nI'm a warrior by definition, any situation\n\n[Hook: Mackenzie Nicole]\nI'm a warrior, what you know about me, for real?\nWarrior, if I said it, I did it, for real\nI'm goin' beast mode, from the west to the east coast\nAlways stickin' to the G-code\nWarrior, and I'm made that way, say it that way\n\n[Verse 2: Big Scoob]\nA juggernaut, a giant, my heart beating like a lion\nIf I'm breathin' I'm defying\nTakin' form, no compliants\nObstacles and hurdles\nNow the rabbit beats the turtle\nIt's different where we livin' in\nBut I ain't one for givin' in\nMy cut of cloth is different so I chose to say it different\nDifferent codes, I live different, man\nFace it, I'm just different, nigga\nScratchin' claw and get it, man I'm always tryin' to win it\nI had missteps and setbacks, but as long as I'm still in it\nAin't no quitter in my blood, I'm a demigod of sorts\nYou can't see me on the court, man my life is like a sport\nI'm Jordan, I'm Jeter, I'm Tyson, I'm Floyd\nI'm Barry, I'm Sosa, I'm pumped up on 'roids\nMy own screamin' cheerleader, \"Scoobie you the greatest!\"\n\"Look here, let's be clear with it, homie you gon' make it\"\nI done made it, I'm still breathin' I done lived a full life\nAin't no plans of leavin', man, this dog's in the fight\n\n[Hook: Mackenzie Nicole]\nI'm a warrior, what you know about me, for real?\nWarrior, if I said it, I did it, for real\nI'm goin' beast mode, from the west to the east coast\nAlways stickin' to the G-code\nWarrior, and I'm made that way, say it that way"}], "artist": "Big Scoob"}