{"songs": [{"image": "https://images.genius.com/33f2462c21c17926cc0c9f2df803c0d1.1000x1000x1.jpg", "title": "Dr. Knockboot", "album": "I Am...", "year": "1999-03-03", "lyrics": "[Verse]\nHell yeah\nCheck it check it check, check check\nYo, when it come to sex advice, I'm the one to call\nIf you a virgin with blue balls or you tear down walls\nNot Dr. Ruth, call me Dr. Knockboot\nPimped out hats, rock fashionable suits\nA class for the youth, Sex Ed for your head\nThe do's and don'ts, that should happen in the bed\nFirst, DON'T: run up in her raw cause you get burned\nFor sure, fuckin' with the typical whore, because\nDO: rock a Rough Ryder, whenever you inside her\nYour local bodega is your supplier\nAnd DON'T: take the pussy, if she fightin'\nCause you saw what happened to 2Pac and Mike Tyson\n'Specially if you large, some hoes is trife\nGet you on a rape charge, have you servin' your life\nYo, DO: get a yes confirmation before penetration\nYou wind up in a police station\nDON'T: get with no young bitch and hit it\nShe PG-13, you rated R, she not permitted\nDO: check for ID, whenever chillin' V.I.P\nWith fly shorty P.Y.T\nYo, DON'T: lie about the cars you got\nOr who you hang with, frontin' when you borrowed your watch\nYo, DO: play your game right, if the G's tight\nThen you can fuck shorty the same night\nYo, DON'T: trick when you don't have to\nYou think you ballin'? You turn your back they laughin' at you\nYou don't gotta keep repeatin you a thug, she heard you\nIn fact, she attracted to your man that herbed you\nDO: spend a lil' dough, only if you know\nThe bitch gross a lil' somethin' too bro\nDON'T: eat the pussy the first night\nMaker her bless you, we call that shit gesundheit\nDO: set the mood right, Bailey's with ice\nA cup of Thug Passion'll make everything right\nYo, DON'T: pop shit like you Daddy Longdick\nWhen you come fast like Fed-Ex and bust too quick\nDO: hit positions she will find interest in\nDON'T: hit the pussy if that shit's blisterin'\nHope you're listenin', turn up your transisterin'\nHot 97, KISS-FM or B-L-S, with your hand up her dress\nChillin' with your girl while you thinkin' 'bout ya ex\nNot too easy not too complex\nI break it down, how to adress, the opposite sex\nProblems or questions, I can answer them best\nSignin' off Dr. Knockboot at your request, peace\n\n[Outro]\nRest havens\nFuck y'all bitches\nY'all niggas get y'all shit tight\nDr. Knockboot gotta come take y'all bitches from ya!\nAIGHT?! We out!"}], "artist": "Nas"}