{"songs": [{"year": "2018-12-21", "title": "​a&t", "image": "https://images.genius.com/fdf55cd3f0aaf3b48e1437d99bdfbcd1.1000x1000x1.jpg", "lyrics": "[Intro]\nGood job, 1st\n\n[Chorus: Yung Miami]\n(Bounce that)\nAss and titties, ass and titties (Shake that)\nAss and titties, he throw money, twenties (Bounce that)\nAss and titties (Ayy), ass and titties (Shake that)\nAss and titties (Ayy), come get savage with me\n\n[Verse 1: 21 Savage]\n21\nIf you play the paint, I'ma go for the 3 (Straight Up)\nShe don't dribble balls, but she good with the D\nStay on Fashion Nova cuz' she get it for free\nShe at home, but her Instagram location the beach (She at home bro)\nAss phat, baby can I grab that? (God damn)\nBooty viral, that shit need a hashtag (Yes ma'am)\nShe walkin' into work like where the bags at? (21, 21)\nHit a couple models, but I love the ratchets\n\n[Chorus: Yung Miami]\n(Bounce that)\nAss and titties, ass and titties (Shake that)\nAss and titties, he throw money, twenties (Bounce that)\nAss and titties (Ayy), ass and titties (Shake that)\nAss and titties (Ayy), come get savage with me\n\n[Verse 2: Yung Miami]\nWhere my big dick diamond rocking foreign driving niggas at? (Where they at?)\nBig shit poppin', fuck that talkin', where them dollas at?\n100 bad bitches in the club on some hustle shit (Yup)\nIf you ain't breaking bread, please don't you touch a bitch\nBills (I got bills), I gotta pay (I gotta pay)\nIf you gon' handle it for me, then we can play (We can play)\nAll depending how you spend it, you can stay (You can stay)\nWhen it's bout that money youngin', don't discriminate (Haha)\nI don't wanna smoke yo' weed, I don't wanna meet yo' homie (Nah)\nWe ain't gotta let me lead if you find a nigga with it on him\nI'm 21 'bout it baby, I need that cash, you feel me?\nSo, if you ain't got that bag, don't grab my ass, you hear me?\n\n[Chorus: Yung Miami]\n(Bounce that)\nAss and titties, ass and titties (Shake that)\nAss and titties, he throw money, twenties (Bounce that)\nAss and titties (Ayy), ass and titties (Shake that)\nAss and titties (Ayy), come get savage with me\n\n[Verse 3: 21 Savage]\nDrop it to the flo' after she wobble and twist (Straight up)\nI like em natural, I don't like plastic booties and lip (I don't)\nStruggling strippers always tryna sneak in the vip (21)\nYou ain't get no wristband, then you can't get no tip (Nope)\nGot a bitch a brand new G wagon and I snatched her stomach, she happy (She snatched)\n100 racks on me, I'm sagging (Yeah)\nMade it out the bottom, I'm braggin' (Straight up)\nCame in the club with that fake ass jewelry on, threw a hundred dollars, he cappin' (Cappin')\nBefore I walk around trying to act like I'm something I ain't, I just quit rapping (On God)\nI had to start selling bundles of weave, you wouldn't even get her hair done (21)\nIf a nigga had a chance, he'd fuck my bitch, nigga that's why I don't even spare none (On God)\nI'm so 21, I'm so 4L, play with this shit, get redrummed (Straight up)\nBullets so big, I could be in Zone 6, fuck around and hit a nigga in Belgium (21)\n\n[Chorus: Yung Miami]\nAss and titties, ass and titties (Shake that)\nAss and titties, he throw money, twenties (Bounce that)\nAss and titties, ass and titties (Shake that)\nAss and titties, come get savage with me\n\n[Outro: 21 Savage & Yung Miami]\nAss and titties, hunnids and fifties (21)\nYeah, I got a girl, don't leave no hickies (On God)\nSt. Laurent panties she don't wear Vicky (Straight Up)\nI'm her sugar son, her sugar daddy was 50\nBounce that\nShake that, ayy\nBounce that, ayy\nShake that, ayy\nBounce that, ayy\nShake that, ayy\nBounce that, ayy\nShake that, ayy\nBounce that", "album": "i am﹥i was"}], "artist": "21 Savage"}