{"artist": "Big Boi", "songs": [{"lyrics": "[Intro: Big Boi]\nSpeakerboxxx\nYo, just so you all know what time it is\nIt's your homeboy\nStraight from the A-T...\nI ain't even goin say the motherfucking rest\nBut you know\nIt's Dungeon Family all day long baby\nWe finna break it off with some fresh new shit\n\n[Verse 1: C-Bone]\nThis rap game lovely\nKonkrete play a part cause the Feds want to bug me\nAthletes want to be rappers, shawty, trust me\nBending corners in the Benz, ridin like a bucket, nigga fuck it\nI know some hoes slutty\nI auctioned a bitch off like a nigga playin rugby\nI done seen a ghetto meal, little buddy, trust me\nJump European, came clean through customs, no questions\nPerpetrators in the booth, rappin lame like they drug related\nIt made me sick to my stomach, lost a two and a baby\nYou don't grind, you be lying\nShould be castrated, Lorena Bobitt maybe?\n\n[Hook: Big Boi]\nTomb after tomb, boom, boom after boom\nServing up emotion once you deep inside the tomb\nFrom embryo to newborn, you can feel me in the womb\nCool, ooh, that's cool\n\n[Verse 2: Lil' Brotha]\nYou see, I cock back Glocks, got more pull than slang shots\nHit G spots, I'm givin hoes back shots\nI'm a young country boy, long socks with flip flops\nBut I pull up on your block in the 500 Benz drop\nKonkrete, Aquemini, we takin this here to the top\nBust like balloons, who gives a damn if it goes pop\nYou say it's hot, well let me turn it up another notch\nTo my real niggas, won't you pump this out your Speakerboxxx\nFuck the cops, we makin noise and we won't stop\nBump, bump, there goes the boom and it's gon' drop\nOld school, big shoes, nigga, no socks\nWe keep tools, see fools, bullets will flock\n\n[Verse 3: Big Gipp]\nThey call me Mr. Ravioli, Mr. Streudel\nMr. Poke Em with the Noodle, Mr. Cockerspaniel in your Poodle\nAfter school tutor, Roto Rooter, addicted to follies\nLike brown collies, stay soft fro crows\nSwimming in the fallopian of an Ethiopian\nTalking a different language, RBI fly wide\nTalk to me now, 84 hard, 84 soft wit me now\nBeautiful ladies, they want to walk wit me now, talk wit me now\nPussy pop for me now, sell cock for me now\nFight a bitch, hit her in the eye for me now\nSee you when I see you, now I'm out wit me now\n\n[Hook: Big Boi]\nTomb after tomb, boom, boom after boom\nServing up emotion once you deep inside the tomb\nFrom embryo to newborn, you can feel me in the womb\nCool, ooh, that's cool\n\n[Verse 4: Supa Nate]\nI will never fall off, I haul off heavy weight\nFuck wit me dog, I chop you up like Norman Bates\nI'm true to this shit, I ain't new to this shit\nOver a million sold on strictly weed, bricks\nFlammable like gasoline when I'm lit up\nI prefer my liquor dark and a mean white slut\nIt's over for you, cavern ass rapper, get out the game\nYou can fool the record labels but not the streets mayne\nI just tell it how I see it nigga, facts is facts\nThe first verse I ever wrote, I got a Platinum plaque\nI've been to hell and back so nigga give me my props\nKonkrete, Big Boi, beatin through your Speakerboxxx, yeah!\n\n[Hook: Big Boi]\nTomb after tomb, boom, boom after boom\nServing up emotion once you deep inside the tomb\nFrom embryo to newborn, you can feel me in the womb\nCool, ooh, that's cool\n\n[Verse 5: Ludacris]\nLudacris, yeah I keep a Glock in case you like to leak a lot\nMeanwhile, crankin' the volume knob up on my Speakerboxxx\nSo hear ye, \"Get the fuck on the ground!\"\nIs just a phrase you might hear strolling through the A-Town\nThey don't believe that we'll stab them in the abdomen\nFrom College Park, Georgia to College Park, Maryland\nSo put your fist up boy, you wanna romp\nYou can Bankhead Bounce or get Eastside Stomped\nThinking way back before I got mine\nPutting bullet holes through the neighborhood stop signs\nStill wild is my adrenaline, yes, ladies and gentleman\nDenenen, A hundred thou, bitch! Diamonds shimmerin\nCatch me with a sack of dro, reaching for The Strap Below\nOr with some nasty hoes, eating pistachios\nY'all driving Subarus, stuck in your cubicles\nI'm stuck in the air with weed crumbs under my cuticles\n\n[Hook: Big Boi]\nTomb after tomb, boom, boom after boom\nServing up emotion once you deep inside the tomb\nFrom embryo to newborn, you can feel me in the womb\nCool, ooh, that's cool\n\n[Verse 6: Big Boi]\nFourth and goal, should I take the three point field goal\nFor the score, or should I roll around and take the ball\nUp the middle, the gut, the what, the hole\nCranium overload, overthrowed, now we got seven more\nPoints on the board, fa sho\nB-I-G B-O-I, me oh my, I think He's blessing me\nExcelling in harmonious melody, boy we got the recipe\nLike Ragu, it's in there, giving you some of the best of me\nPlaya pimp gangsta poet, we gon spit it, we gon show it to yo ass\n\"You're a champion,\" were my dad's last words before he passed\nBut I know one day we will once more cross paths\nThey say, \"Big Boi, can you pull it off without your nigga Dre?\"\nI say, \"People, stop the madness cause me and Dre, we okay\"\nOutKast, Cell Therapy to cell division\nWe done split it down the middle so you can see both the visions\nBeen spittin it damn near 10 years, why the fuck would we be quittin?\nFuck nigga!", "image": "https://images.genius.com/547d6239cd014bda1acb0078d0ddaafc.999x999x1.jpg", "year": "2003-09-23", "title": "Tomb of the Boom", "album": "Speakerboxxx"}]}