{"songs": [{"year": null, "image": "https://images.genius.com/46c26f3476d8f94e382aebacc4cd29b9.1000x1000x1.jpg", "title": "No Joke", "album": "E.B.K.", "lyrics": "[Verse 1]\nIt's Blaq Po' I'm on a killing spree\nY'all niggas gonna remember me\nWarlord, hardcore, goin' down in history\nNigga ain't no mystery\nThe .44 guarantees a flawless victory\nY'all niggas ain't shit to me\nI got the skills to lyrically crush you\nI got them things that reach out and touch you\nViciously fuck you up, something horrible\nLet Lil Wayne and T-Pain keep playing in the carnival\nWhile I rebuild this rap shit from scratch, kid\nI got the Blaqprint, this shit is like crack, kid\nI make you want it more\nGot you searching on the floor\nGot you climbing up the walls\nWho hears? Who ball?\nNobody coming harder than me\nEvery day, getting more harder to see\nFollow a G\nCus I'm parting the sea\nWho want drama with me?\nYou might aswell point the llama at your college squeeze\n\n[Hook]\nThis shit ain't no joke\nThis shit is pure dope\nBe easy, young blood\nCareful, young folk\nIt's getting rough now\nNiggas all hush now\nTiptoeing around\nTrying not to get shook down\n\n[Verse 2]\nThe more bars I spit the more barbaric it get\nThe more blood drip, flooding the public\nMy niggas hugging the strip, this for yall niggas\nGet that money, watch them unmarked cars niggas\nAnd for the rest of you lames just pay attention\nMy name is in flames, stop your complaining and bitching\nI'm murdering main competition trigger finger itching\nI'm so ill it's sickening, like E pills and mixing\nWho ever wanted? What, what? I'm still on it, still\nRed eye blunted, still keep it 100\nRip the book bag off you backpackers\nAnd smack the shit outta all you whack rappers\nI got screwy-Louie, cave-milly running through me\nI'm possessed by all the Queensbridge fallen goonies\nIt's about to get ten times worse\nGot the haze for my head, and the henny for my thirst\nI won't stop until the end of my days\nI'm like double your age in a rage running craz'\n\n[Hook]\n\n[Movie sample]\n\"I told y'all little niggas, don't fuck with me but you wanna fuck with a nigga, right? I tried to be a good motherfucking nigga but I can't be because little bitch ass niggas wanna fuck with me. You want to fuck with a nigga, right? You want a nigga who got two stripes on him to go to jail for life!\""}], "artist": "Blaq Poet"}