{"songs": [{"title": "Boasting", "album": "Rehab", "year": "2010-09-28", "image": "https://images.rapgenius.com/dc7d6ce05b5aee3f7fd35003296d6583.540x540x1.jpg", "lyrics": "[Hook: Anthony Evans]\nIf this life has anything to gain at all\nI'll count it loss if I can't hear you, feel you, cause I need you\nCan't walk this earth alone\nI recognize I'm not my own, so before I fall\nI need to hear you, feel you, as I live to make my boast in you alone\n\n[Verse 1: Lecrae]\nWith every breath I take, with every heart beat\nSunrise and the moon lights in the dark street\nEvery glance, every dance, every note of a song\nIt's all a gift undeserved that I shouldn't have known\nEvery day that I lie, every moment I covet\nI'm deserving to die, I'm just earning your judgment\nI, without the cross there's only condemnation\nIf Jesus wasn't executed there's no celebration\nSo in times that are good, in times that are bad\nFor any times that I've had it all I will be glad\nAnd I will boast in the cross. I'll boast in my pains\nI will boast in the sunshine, boast in his reign\nWhat's my life if it's not praising you?\nAnother dollar in my bank account of vain pursuit\nI do not count my life as any value or precious at all\nLet me finish my race, let me answer my call\n\n[Hook: Anthony Evans]\nIf this life has anything to gain at all\nI'll count it loss if I can't hear you, feel you, cause I need you\nCan't walk this earth alone\nI recognize I'm not my own, so before I fall\nI need to hear you, feel you, as I live to make my boast in you alone\n\n[Verse 2: Lecrae]\nTomorrow's never promised, but it is we swear\nThink we holding our own, just a fist full of air\nGod has never been obligated to give us life\nIf we fought for our rights, we'd be in hell tonight\nMere sinners owed nothing but a fierce hand\nWe never loved him, we pushed away his pierced hands\nI rejected his love, grace, kindness, and mercy\nDying of thirst, yet, willing to die thirsty\nEternally worthy, how could I live for less?\nPatiently you turned my heart away from selfishness\nI volunteer for your sanctifying surgery\nI know the Spirit's purging me of everything that's hurting me\nRemove the veil from my darkened eyes\nSo now every morning I open your word and see the Son rise\nI hope in nothin, boast in nothin, only in your suffering\nI live to show your glory, dying to tell your story\n\n[Hook: Anthony Evans]\nIf this life has anything to gain at all\nI'll count it loss if I can't hear you, feel you, cause I need you\nCan't walk this earth alone\nI recognize I'm not my own, so before I fall\nI need to hear you, feel you, as I live to make my boast in you alone\n\n[Bridge: Anthony Evans]\nGlory was solely meant for you\nDoing what no one else could do\nWith All I have to give, (With all I have to Give)\nI'll use my life, I'll use my lips. (My Lips Yeaaah)\nI'll only glory in your Word. What gift to me I don't deserve\nI'll live in such a way that it reflects to you, my Praise\n\n[Hook: Anthony Evans]\nIf this life has anything to gain at all\nI'll count it loss if I can't hear you, feel you, cause I need you\nCan't walk this earth alone\nI recognize I'm not my own, so before I fall\nI need to hear you, feel you, as I live to make my boast in you alone"}], "artist": "Lecrae"}