{"songs": [{"title": "Step Up", "image": "https://images.genius.com/0727e032a1db7eb34f11f50570263796.869x869x1.jpg", "lyrics": "My daughter growing up fast I need to step it up\nThe industry on the crash I need to step it up\nThese days might be our last I need to step it up\nYou dig?\nStep it up now\nI got to step it up now\n\nI remember summer time\nAqua socks at the swimming pool\nSinging silly songs on the sunny afternoon\nChasing after bubbles from the bubble wand\nRight now it feels like all our troubles are gone\nIt's just me and my Yo Gabby gabba\nSippy cup sipper tippy toe tapper and her daddy is a rapper\nSo she knows my moves\nShe can stand on one leg like I do\nAnd say yo yo yo like I do\nWhen I'm looking at the baby pictures\nHow could I drop her off at the baby sitter man I'd rather be with her\nI can’t go for that I’m on my Hall and Oates tip\nShe was nodding her head to the beat when I wrote this\nI want to guide her with compassion and wise words\nAnd never criticize her\nOffer her correction when she whines and complains\nBut also take time to explain\nTrain up my child to the best of my ability\nWisdom from God is what I really need\nSo humility is natural\nI've been humiliated\nBut God wasn't ashamed to be affiliated with me\nHe even initiated\nAnd that's love I got to step it up\nI got to step it up that's love\nI got to step it up\n\nYou know girl if I step to you I'll show you my A game\nBut I want my A game to be my every day game\nI'm not one to play games\nI shoot straight aim high\nSuitcase stay fly\nStill wear my backpack act my age\nNo I'm not a daddy mac\nMore like a daddy making mac and cheese\nUp in the kitchen\nI cook it right for my Bugga Boo\nJust called to say hello girl I hope I'm not bugging you\nI don't know what to do I want to take it slow\nThey say when you meet the right one you just know\nI got nothing to hide so don't hide from me\nDon't play hide and seek don't be misleading\nIf I need you miss from sunrise to evening\nWe can bump heads without lying and a cheating\nYou're a princess because the king adopted you\nIf that wasn't the case I wouldn't rock with you\nBut since it's so I'll sow into this miss that's why I'm so into this miss\nGet it?\nSince it's so I'll sow into this miss that's why I'm so into this miss\nGet it?", "year": null, "album": null}], "artist": "Braille"}