{"artist": "R. Kelly", "songs": [{"album": null, "year": null, "lyrics": "[Intro]\nGirl, I got some money in my pockets (in my pockets)\nDo You wanna roll out with me? Yea (me yea) lets go!\nBaby, Im a playa you can't knock it (you can't knock it)\nAnd Im just tryna get in between yea (yea)\n\nI pull up to the club in that beamer oh my gosh\nNiggas looking like they never seen this kinda car\nWho is that the R.? hes a superstar\nTwelve play fourth quarter and you know im going hard\nTheres so many choices, its hard for me to choose\nI just left one club so im already off the booze\nStraight up twelve oclock I got shawty in my view\nI steps up to her and say shawty what it do?\n\n[Pre Chorus]\nShe started backing it, I started smacking it\nShe started clapping it, I started grabbing it\nAnd then I whispered in her ear, and told her lets get outta here\nWanna take you home with me girl\n\n[Chorus]\nGirl, I want yo (body body) Do you want my (body body)?\nWanna do something to (your body body), Wanna do something to (my body body)?\nIm kissing (your body body) Youre kissing (my body body)\nIm wanting (your body body) Youre wanting (my body body)\nOh lets get it Oh lets get it\nOh lets get it Oh lets get it\nOh lets get it Oh lets get it\nOh lets get it Oh lets get it, shawty\n\nI know whip must look unreal when youre looking from the outside\nSee that bentley coupe with that boy on the inside\nStep out so smooth, walking so fly\nYea you got a man but he ain't focused like R\nAin't rollin like R. Spend money like R\nBend you over, pull your hair and stroke it like R\nThese vezo jeans rocking stilletos\nPlus you so hood, word to the ghetto\n\n[Pre Chorus]\nShe started backing it, I started smacking it\nShe started clapping it, I started grabbing it\nAnd then I whispered in her ear, and told her lets get outta here\nWanna take you home with me girl\n\n[Chorus]\nGirl, I want yo (body body) Do you want my (body body)?\nWanna do something to (your body body), Wanna do something to (my body body)?\nIm kissing (your body body) Youre kissing (my body body)\nIm wanting (your body body) Youre wanting (my body body)\nOh lets get it Oh lets get it\nOh lets get it Oh lets get it\nOh lets get it Oh lets get it\nOh lets get it Oh lets get it, shawty", "title": "Body Body", "image": "https://images.genius.com/e54b7a47c059f99afc5429a8709acf02.400x400x1.jpg"}]}