{"artist": "C-Bo", "songs": [{"title": "Can We All Ball", "album": "Til My Casket Drops", "year": null, "image": "https://images.genius.com/dc4336c862301b0ea11cc46a1958acbe.500x500x1.jpg", "lyrics": "Verse 1 (Killa Tay)\nWe pump slugs, and punk thugs for their drugs\nWhen push come to shove ain't no motherfuckin love\nBow down, we just hit the town\nBut we brung shit like Hitler, bail em with a Sigma\nSwitch with the first shot, gotta check the spot\nBurnin rubber out the parkin lot, pointin out the window\nStuck off indo, bumpin my nigga C-Bo\nBitches all in my business cos they think I move kilo's\nI, call my people's on the mobile, gang global, nationwide distribution\nNow I'm posted up in Houston\nTexas, ridin a Lexus but it's supremo\nNiggas set trippin, so a solo weapon is essential\nKeep the pepper spray on my car keys, only fuck with hard Gz\nStill get my ball on like Barkley\nNothin but the California hog in me\nTouchin triggers, real niggas, straight doggin freaks\n\nChorus:\n\nCan we all ball?\nCan we all ball?\nCan we all ball?\n\nVerse 2 (JT the Bigga Figga)\nWe take the occupation when movin, my hustle never stop\nCheck what? Some babies camera's peep the blocks, stash the Glocks\nPosi's squashed, ship ki's and here there's thousand dollar bidders\nRim hats with feathers, more money than Perry Ellis\nNever known behind ???, talkin \"let my nuts hang\"\nTrade ya the .4-5 and the Tek 9 for a drop Mustang\nA long line of killers, drug dealers with stripes\nJust schoolin, you're rollin pontentially, could take your advice\n\n(C-Bo)\nWe count big face and straight laces by the hundreds\nRagtops and big blocks, gettin the money\nSippin X-O Hen, and I get it for the 1-10\nIn a convertible Benz, fearin hunted, on twins\nThey call me Bo-Loc, and fo' sho' I smoke the dodo\nAnd flip the '97 Sport to shake the po-po\nHigh rollers count, tall dollars will never fall\nIn this shit for the cash nigga, enter, forever ball\n\nChorus\n\nVerse 3 (C-Bo)\nWe are surprised in this rap game\nStraight gangsta shit makes the world go round, I'm nuttin nice\nOn a dice, bets are more wet and crush ice\nX-O, stretch Rolls, Bza's and Lexo's\nAnd fuck the best hoes, and never slippin like Magic Johnson\nKeeps my top down, increase my hatto, from Sac to Compton\nRolex down, fools shot up, solid ice\nThe gin in the cask was still followed by the vice\nIn the S-Class, we does it on the gas\nOn my cell, Bo poppin my collar, all about my cash\nHow many diggers can you scat? Now picture that\nWithout the feds on your back, homey, and that's a fact\nWe attack with Mac 1-12's to protect my sack\nI pick up my pack, tellin the order \"handle that\"\nIt ain't no room for you busters cos we knuckle ya downfall\nPlayer haters, fuck y'all, let these ballers all ball\n\nChorus:\n\nCan we all ball?\nCan we all ball?\nCan we all ball?\nCan we all ball?\nTell me, can we ball?"}]}