{"songs": [{"lyrics": "[Hook] (Afroman talking)\nHush, hush (yeah yeah)\nSomebody's callin my name (if you listen closely baby)\nHush, hush (yeah yeah)\nSomebody's callin my name\nHush (listen baby) hush (somebody's callin)\nSomebody's callin my name\nOh my lord, oh my lord, what shall I do\n\n(A man sometimes girls think I'm crazy cause I wake\nHer up and I tell her)\nSounds like Jesus (sounds like Jesus)\nSomebody's callin my name (I know I'm high but baby)\nSounds like Jesus\nAnd somebody's callin my name\nSounds like Jesus\nSomebody's callin my name\nOh my lord, Oh my lord, what shall I do\n\n(You know man, I think about all the hard times that I\nWent through and I think)\nI'm so glad that trouble don't last always\nI'm so glad that trouble don't last always\nI'm so glad I'm glad that trouble don't last always\nOh my lord, Oh my lord, what shall I do\n\nI gotta feelin, that everything's gonna be all right\nI gotta feelin everything's gonna be all right\nI gotta feelin that everything's gonna be all right\nBe all right\nBe all right\nBe all right\n\n(A man it's funny cause I learnt this song when I was a little kid\nWhen I went to visit my granddaddy down there in Mobile, Alabama\nHe stayed in this place called Trendy Garden you know what I'm sayin?\nHe used to grow his vegetables right there on the side of the house\nAnd every now and then he'd get me to help him out know what I'm sayin?\nAnd as he was like weedin out his garden and everything\nHe'd sing all kinda tunes and hymns know what I'm sayin?\nAnd sometime he'd sing the same one like over and over and over again\nYou know what I'm sayin?\nHe'd get tired of singin the words\nSometimes he'd take a sip of his water outta that glass jar, set it back down\nAnd while we was plantin them collard greens, he'd hum it\nJust like this right here, help me out cuz, you know how we used to do it)\n\n{*humming*}\n\nIt gets all in my hands\nIt gets all in my feet\nIt makes me wanna sing my song\nTo every little girl I meet\nIt gets all in my heart\nIt gets all in my sole\nIt comes straight out my mouth\nAnd then I lose control\nCause I, I got this feelin, that everything's gonna be all right\nBe all right\nBe all right\nBe all right", "title": "Hush", "album": "Because I Got High", "image": "https://images.genius.com/286e5a371c850693e27da49e4af749c5.300x308x1.jpg", "year": "2000-03-03"}], "artist": "Afroman"}