{"songs": [{"image": "https://images.genius.com/7521267b7988b507395d65324d39651d.1000x1000x1.jpg", "title": "Nightmares", "album": "Hell Hath No Fury", "year": "2006-11-28", "lyrics": "[Hook: Bilal]\nI'm having nightmares...oooooohhh\nMy niggas say I'm p-noid, they say I'm just p-noid\nI'm having nightmares...oooooohhh\nMy niggas say I'm p-noid, they say I'm just p-noid\n\n[Verse 1: Bilal]\nI'm waking up in the middle of the night\nMy heartbeat's pumpin' like something ain't right\nOh what's goin' on?\nWhen I go outside I feel something behind me\nI'm looking back, but nothin's around me\n(Oh what's goin' on...) Man, I don't know, what am I trippin' on?\nThere's something in the room, it's lurkin' in the shadows\nStaring through the darkness...man I don't know\nThese four walls are closing in, these voices ain't my friend\nThey hauntin' me...those, those memories\n\n[Hook: Bilal]\nI'm having nightmares...oooooohhh\nMy niggas say I'm p-noid, they say I'm just p-noid\nI'm having nightmares...oooooohhh\nMy niggas say I'm p-noid, they say I'm just p-noid\n\n[Verse 2: Malice]\nThey comin' for me, they runnin' up\nI'm on my balcony, seeing through the eyes of Tony\nThey say we homies, but I see hatred\nDo not they know brotherly love is sacred?\nNiggas catch feelin's, even contemplate killin's\nWhen you see millions, there are many chameleons\nYou're not a gunna for real, you're just a runna\nHaters, I spot you from afar and I'm the Deer Hunter\nThey be thinkin' nice car, nice crib\nI be thinkin' how long will these niggas let me live\nI understand, cause people need things\nAnd they will take it from you, and take you from your seedlings\nSo even when the mumblers talk\nI still walk the most humblest walk\nAnd one day, they may even catch up with me man\nBut 'til then, I'm Leonardo, Catch Me If You Can, ah!\n\n[Hook: Bilal]\nI'm having nightmares...oooooohhh\nMy niggas say I'm p-noid, they say I'm just p-noid\nI'm having nightmares...oooooohhh\nMy niggas say I'm p-noid, they say I'm just p-noid\n\n[Verse 3: Pharrell]\nLook over your shoulder, something is near\nAnd I'm so scared, when I'm alone I'm so scared\nNow it's inching closer, trouble is near\nBut nothing's there, when I look nothing's there\nI'm outta my mind, I'm runnin' from guilt, but\nIt's right by my side, there's nowhere to hide\nI'm outta my mind, I'm runnin' from guilt, but\nIt's right by my side, there's nowhere to hide\n\n[Verse 4: Pusha T]\nI make big money, drive big cars\nEverybody know me, it's like I'm a movie star\nVirginia nights, sellin hard white\nTo sellin' out shows, every gangsta love my flow\nStill, I creep low, thinking niggas trying to harm me\nHoping my karma ain't coming back here to haunt me\nWas it that nigga, I took his powder with a smile\nPray to the Lord, the gun ain't pop and hit the child, shit\nI pilt niggas' girls back like alpha-hydroxy\nSpent money like Happy Days, I'm the real Fonzie\nTop off the coupe, that's how JFK got shot, B\nCan't let niggas roll up beside me, and 2Pac me\nHolla if you hear me, tears flowing sincerely\nCheck up on my block weekly, my health yearly\nSomething's wrong with me, niggas don't get along with me\nGot a fo-fo, hope your body got strong kidneys, oh!\n\n[Hook: Bilal]\nI'm having nightmares...oooooohhh\nMy niggas say I'm p-noid, they say I'm just p-noid\nI'm having nightmares...oooooohhh\nMy niggas say I'm p-noid, they say I'm just p-noid"}], "artist": "Clipse"}