{"songs": [{"lyrics": "[Sample]\nSo I had to memorize these rhymes until I got home\nYou understand? You know, once you memorize a sentence\nIt's like an exercise\n\n[Intro]\nY'all niggas can't be serious right now\nI'm the all time heavyweight champion of flowers\nI'm leading the league in at least six statistical categories right now:\nBest flow, most consistent, realest stories\nMost charisma, I set the most trends\nAnd my interviews are hotter! Holla!\n\n[Verse 1]\nI jog in the graveyard, spar in the same ring\nThat was housed by the building where Malcolm X was slain\nI spring train in the winter, 'round early December\nRun suicide drills over and over\nWith the weight of the world on my shoulder\nThat's why they call me \"Hova\"\nI'm far from being God, but I work goddamn hard\nI wake up the birds so when the nerds asleep\nI'm catching my second wind the second the first one ends\nI am focused, man, and I'm not afraid of death\nAnd I'm going all out, I circle the vultures in a van and\nI run the block (run), pull up in a drop (pull up)\nPush up on my money (push up), I'm in great shape dunny (woo!)\nI keep jacks jumping, thirty six sets\nLike a personal trainer I teach coke to stretch\nI pump in Roc sweats, all white trainers\nThe ghetto's Billy Blanks, I show you niggas what pain is\nMaintain your stamina, Hov will damage ya\nSpot you two rhymes, y'all niggas is amateurs\nThe fifth, a dead lift if niggas don't want to get shot\nThen y'all niggas better squat, I drop your set for rep\nNo need to hit the showers, the spit from the fifth leave you wet\nLyrical exercise, y'all niggas ain't tired right?\n\n[Chorus]\nOne (and, and, and) one\nTwo (and, and, and) two\nThree (and, and, and) three\n(and) four, breathe easy...\nOne (and, and, and) one\nTwo (and, and, and) two\nThree (and, and, and) three\n(and) four, breathe easy...\nOne (and, and, and) one\nTwo (and, and, and) two\nThree (and, and, and) three\n(and) four, breathe easy...\nOne, two, three, four, breathe easy\n\n[Verse 2]\nSuckers, get your weight up, not your hate up\nJigga man is diesel when I lift the eight up\nY'all ain't ready to workout with the boy\nYour flow is brain on drugs, mines is rap on steroids\nI lift every voice when I sing, my ability\nMake yours look like an exercise in futility\nBring your squad, biceps, triceps, and quads\nWe don't struggle with undeveloped muscles\nY'all ain't real, that's y'all Achilles' heel\nSame routine when you see me you know the drill\nI spot ya, I lift the weight of the watch\nOff your arm, remain nice and calm\nPut down your things, Trinidad of the game\nKnow my way around your ring\nNo matter how many pounds you bring\nIt sounds like the same old thing\nR-O-C is the strongest team, fuckers\n\n[Chorus]\nOne (and, and, and) one\nTwo (and, and, and) two\nThree (and, and, and) three\n(and) four, breathe easy...\nOne (and, and, and) one\nTwo (and, and, and) two\nThree (and, and, and) three\n(and) four, breathe easy...\nOne (and, and, and) one\nTwo (and, and, and) two\nThree (and, and, and) three\n(and) four, breathe easy...\nOne, two, three, four, breathe easy", "title": "Breathe Easy (Lyrical Exercise)", "image": "https://images.genius.com/1aebfd816914351eb7010bd441822da8.1000x1000x1.jpg", "year": "2001-09-11", "album": "The Blueprint"}], "artist": "JAY-Z"}