{"songs": [{"image": "https://images.genius.com/0f83f6339684287642e452f3aa527238.600x600x1.jpg", "year": "2014-03-29", "title": "High Everybody", "album": "March Madness Vol. 3: Elite Eight", "lyrics": "[Intro]\nHigh, high, high, high\nHigh, high, (Hello muthafucka) high, high\n\nSo I'm a need hands (high)\nLadies (Hi)\nFellas (Hi)\nTell Everybody \"Hi\"\nEverybody high\nHigh, high, high, high\nEverybody high\nHigh, high, high, high\n\n[Verse 1]\nI'm a tell everybody \"hi,\" everybody hello\nIs everybody high, is everybody mellow\nI dance with the devil, fell asleep with an angel\nShe woke up horny and then we played Halo, Master Chiefin'\nPass the reefer to people that's believin'\nDrop tees for these events, now we getting even\nPut Vizzy in the dictionary, the kids need meaning\nWhile they was gettin' sleep in, I was living, dreaming\nThey tried to pop like a quiz, trying to test me\nAs I carved my name on the lid of my desk\nJust another kid from the mid to the west\nWith a heart full of passion, pumping big in his chest\nYes, keep it controlled on ten of my toes\nGive'em a show as colorful as Vincent Van Gogh\nLet'em inhale, like the evils open the door\nHeaven sent with the flow\nI just thought you should know\n\n[Hook]\nCause I started from the bottom\nSo they know where I'ma go\nWhen I get to the top I know\nI'll tell everybody \"hi\"\n\"Til everybody hi\n\nSo I'm a need hands (high)\nLadies (Hi)\nFellas (Hi)\nTell Everybody \"Hi\"\nEverybody high\nHigh, high, high, high\nEverybody high\nHigh, high, high, high\n(Hello)\n\n[Verse 2]\nWhere you been Vizzy? Your Tumblr feed is tumbleweeds\nIt's Spring time, that's when I turn to bumble bee\nThat means I'm buzzin' and my city shocker yellow\nGirl's who think they landing Donovan but I'm no soccer fellow\nSay \"hello.\" To the whole world when I was nobody\nDoing shows pulling hoes that was so snotty\nOut in Memphis, getting faded like I'm Yo Gotti\nNever parking, I belong in drive like old floppy\nNo copy sold, but never been no copy\nGot beams and I never met no Scotty\nYour ho tell you she was in that hotel lobby\nAnd sloppy-toppy in the droppy is her real hobby\nJust a few bars for rappers that might feel cocky\nThinking they can pop me, but they'll never stop me\nTry to block my goals but I still got'em\nBall 'til I fall like it's Autumn\n\n[Hook]"}], "artist": "XV"}