{"songs": [{"year": "2007-06-13", "lyrics": "[Intro] [B.O.B talking]:\nAye Elpee, I think these motherfuckers forgot where I was from\nIt's that nigga B.O.B. EZ Elpee is up on the beat. (DJ Scream)\n\n[Chorus]\nI'm cruisin' through Decatur tryin' to find some of that 'dro\nAnd I see too many haters cause they can't handle they hoes\nI say I can't do no better because this is all I know\nOoooh, all I know, all I know, all I know\n\n[Verse One]\nCause I was raised in the D-E-C\nA/aye I'm from Decatur\nWhere we get high and ride in sky scrapers\nGet money now and ride or die later\nGet shot and robbed by your own neighbor\nWhen the cops ridin' by, it ain't safer\nThey'll probably shock ya ass with them tasers\n'Round here, we ain't big on education\nNiggas droppin' out but be at the graduation\nBut this cities where I'm glad to be\nRep it to the fullest, don't get mad at me\nNiggas steady hatin' but they clap for me\nCause I got to spit it ill like a rap disease\n'Fo 'sho, girl I got that mojo\nGive it to you so slow\nThat ain't like them other niggas who be havin' no stroll\nAnd girl I'm layin' it down\nReppin' for my city, what's the name of my town?\n\n[Chorus]\nI'm cruisin' through Decatur tryin' to find some of that 'dro\nAnd I see too many haters cause they can't handle they hoes\nI say I can't do no better because this is all I know\nOoooh, all I know, all I know, all I know\n\n[Verse Two]:\nThe east side of the A-T-L\nAye we sit tall\nThis is the home of slang and shit talk\nGold diggin' hoes don't get no doe\nThey just get on all fours and get big balls\nAt night, watch out, the cars get jacked up\nAnd my clothes turn into target practice\nEverybody better start haulin' asses\nCause the gas station clerk never saw what happened\nNow it's on the news\nNow I'm in my school\nNiggas chillin' at the water fountain with a tool\n'Bout to cut a fool about 3:42\nAnd the po-po waitin' outside for the queue\nThey put the cuffs on him, and take him downtown\nNow they in the penitentiary a juvenile\nI ain't talkin' shit, I'm just reppin' for my town\nThis is for Decatur and this is how I sound\n\n[Chorus]\nI'm cruisin' through Decatur tryin' to find some of that 'dro\nAnd I see too many haters cause they can't handle they hoes\nI say I can't do no better because this is all I know\nOoooh, all I know, all I know, all I know\n\n[Outro] [B.O.B]:\nThis shit is all I know. Yeah. Born in South Carolina...raised up in Decatur\nI'm an '80s baby. I'm kinda cool but the hood kinda made me crazy\nYou see what I'm sayin'? And this is, and this is, and this is how it go", "title": "All I Know", "album": "The Future", "image": "https://images.genius.com/c159195f5b830821888ae5456d7793d6.250x306x1.jpg"}], "artist": "B.o.B"}