{"artist": "E-40", "songs": [{"title": "Bring the Yellow Tape", "image": "https://images.genius.com/321a53b5f52d1286845da5f7b8831a9b.700x700x1.jpg", "album": "The Mail Man", "year": "1993-09-28", "lyrics": "Some serious ass shit jumped off a little bit over an hour ago\nMy ace Boon just got peelt at the corner store\nIt's unbelievable I'm shocked this can't be true\nIm cryin vengeance for revenge look what I do\nCalled up my Mossie told my niggas to be on alert\nHeard it was some player hating O.G's out there putting in work\nFrom what I understand that shit ain't over no turfs and drugs\nIt's over some bitches and some jealous niggas with a grudge\nHot at the head I'm fired up I wanna do'em in myself\nHit me up in the corner and watch me let them have it nelf\nMoney talks and bullshit walks, I'm off to San Leandro\nFor some Glocks and techno chops and a gang of ammo\nTook a hit of the chronic dank to expand my thoughts relax nerves\nWhen I get back to the town just think them niggas gonna get straight served\nAnd a ballerish nigga like me young in the game straight having thangs\nTaking this shit from some ol' jealous ass OG's man?\nI'm not having it, you want some funk I'll bring it to ya\nDagnamit I thought you suckas already knew ah\nYes indeed, them niggas act like they can't bleed\nBut them lies, I'm talking about the element of surprise\nBring the noise, whos fallin like the big boys?\nHeavens to Merkatroid, I'm ballin like the big boys\nI just got the word I heard the same niggas robbed my partner herb\nPulled on his dick with a pair of appliers got him for a bird\nIt's gettin stanky got my curiosity arousin\nSee herbs a factor, he's worth $700,000\nGTE mobile net cellular comminication\nI got his voice mail number let me try an page him\nI'm hecka cool he hecksa cool with me\nHe called me back said \"Lets go party on them fools E.\"\nI said \"Where you at?\"\nHe said \"Where you at?\" I said I'm in Vallejo\nHe said I tell you what lets hook up me and you at Dennys in the Vill'\nI said Roger he said \"Over and out don't fake out\"\nI said what time he said one o'clock if it's traffic go the back route\nYa see, sloppy jobs ain't my forte so no mistakes\nWe do it right and when it's done bring the yellow tape\n\n(Hook)\nBring the yellow tape\nBring the yellow tape\nBring the yellow tape\nThe yellow tape\n\n[Verse 2: E-40]\nWassup my Naga you ready to ride on these ho ass block busters\nThats me an Herb talking outside of Denny's smoking a beedie sittin in my Cutlass\nIt's only a handful of them suck L's I can count them on my finger\nFuck letting this shit die down I'm ready to hear the fat singers\nI'm bout my gats but can't make cash with niggas breathing all down my back\nTherefore I must explore by taking a few lives to even the score\nMy ace Boon, my sugar low, blood pressure high\nDrinking and crying two four seven my stomach in and out\nI know this one botch that got my nigga that just got out of jail's baby\nShe'll play hop scratch she works for Pacific Bell and she just might maybe\nHelp me pull these niggas coat tails true ???\nFind out where they sleep by looking up there address on the computer\nHerb hollard bingo, tomorrow we ride my naga\nFake ass niggas done stuck there fingers in\nSome permanent shit that they can't wipe off\n\n(Talking)\nYeah, motherfuckers fail to realize the size of this\nOh it's gonna get done, three or four more hot ones\nTo the fire that already got 'em\nAin't no kind of stress to me\nMy dick get hard off this type shit boy\nTell that botch to get the 707's on them niggas residential spots\nBy tomorrow afternoon and it's on\n\nThink I didn't? got on it right away\nFinally got me a chance to use my Heckler & Knoch collection throw-aways\nAnd when we did I guess you could say we did that\nAnd after that niggas gave me my 'spec\n\nHook"}]}