{"songs": [{"image": "https://images.genius.com/246e4408dbf779ecc2275ceef46c850e.453x450x1.jpg", "year": null, "title": "Shoot Cha In A Minute", "album": "Psycho Active", "lyrics": "Artist: X-Raided\nAlbum:  Psycho Active\nSong:   Shoot Cha In A Minute\n\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop (and ya don't stop)...\nX-Raided and ya don't stop...\n\nStraight going on a war path, taking niggas out like it ain't shit\nYou can't coup with the X-Loc gone hit\nA nigga gotta be, don't even try to be a friend of me\nYou just want a piece of me\nI know what I see thru my eyes:\nI see another black brotha living life streetwise\nWho's making dollars like a dope man\nMaking money anyway a nigga can\nTaking your shit and selling drugs\nGetting drunk, sagging Levi's, looking like a thug\nHanging with my miggas at the spot\nThe spot's hot so I'm looking for cops\nAnd I spotted one\nTold my nigga Trip to slap a clip in a gun\n9 double M, the U-Z-I, you ask me why\nCause a nigga ain't gonna die...\nLike a sucka, I'm going out spraying\nLetting fools know X-Raided ain't playing\nTha Murder, yeah, I got something to do with it\nCause I shoot cha punk ass in a minute...\n\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop (and ya don't stop)...\nLynch Hung and ya don't stop...\n\nPeople always ask why I act this way\nI say: cause I'm a villain like my homeboy Ray\nA straight lunatic, a little skitzo\nA male ho, a mothafucking psycho\nKilling punk niggas like flies\nYou piss me off and everybody dies\nX ain't the one to be ludicrous\nAny mothafucka I wanna diss I'm gonna diss\nIt might be you if ya on the shitlist\nInstead of an 'uncle' I make ya say 'triple-six'\nAnd make you suck four dicks\nIn otherwords you can get the duck sick\nAnd ya better do it good, choke this dick\nMake me nut real quick\n20 seconds like a mothafucka\nIt feels good like a mothafucka so, bitch: suck\nIt tastes like chocolate, that's the nickname\nDoggy style, I'm known to inflict pain\nMaking hoes feel real swell\nA nigga with a mind like me needs to go to hell\nWhere else can a nigga go? (Nowhere!)\nIn heaven the mothafuckas don't allow psycho\nNow the book is closed\nA fool like me killed all them hoes\nCause I (shoot a mothafucka in a minute)...\n\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop (and ya don't stop)...\nYo, pump it up, nigga and ya don't stop...\n\nThe definition for a schizo is\nStrictly killing any tough son of a bitch\nWhen I say tough I mean he thinks he's tough\nI'm kinda fed up, a nigga done had enough...\nOf this shit to last me a year or two\nWhat in the fuck a nigga gotta do...\nNowadays to get his point across\nI don't know, I guess ya gotta get toasted like a salad\nA ballad of a menace, ya can call this a ten percent diss\nYa get pissed but I don't give a fuck\nYa wanna squab, yo, what the fuck is up?\nMy nigga Trip got a nine for ya ass\nTalk shit, mothafucka, and we blast\nThree sixes' the code that we use\nI'm killing muslims, baptists and jews\nAnd the hovers, fuck the witness\nHitting niggas to the triple-six sickness\nAt my house windows are tened\nKnock on my door: I shoot cha in a minute...\n\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop...\n\nThe definition for X-Raided\nIs ruthless attitude towards every delinquent\nDon't forget the 'X' for 'X-tra'\nThe X-tra as I kicks so nobody steps up\nTo the villain peeping that bullshit\nI grab the nine and unload the clip\nSpray every punk nigga on the scene\nCause I'm a lunatic, know what I mean?\nDon't forget that Triple-Six got the backfade\nStep up, try to steal, ya get sprayed\nCause I'm not giving up an inch\nAnd neither is the mothafucking Lynch...Hung\nBut you ain't dumb, you know what's up\nThe whole Mafia is crazier than a mothafuck\nWe don't give a fuck about the nextman\nUnless he's down with our clan\nAnd if ya ain't then ya got nothing incomment\nDo like a nigga from Compton\nAnd start running a hundred miles to the city I'm from\nS-A-C, punk bitch, you can't get none\nI'm from South Sac, we all packed\nEven that nigga Homicide is kicking raps\nA title to be welthy and we taking it\nAnd if not we'll shoot cha in a minute...\n\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop (and ya don't stop)...\nAnd ya don't stop (and ya don't stop)...\nCan I kick it? (And ya don't stop)...\nCan I kick it? (And ya don't stop)...\nCan I kick it? (And ya don't stop)...\nAnd ya don't stop and ya don't stop...\nAnd I'm out..."}], "artist": "X-Raided"}