{"songs": [{"album": "RevolveR", "image": "https://images.genius.com/6a7e5fcc60aa2eefc4c92f4af2a241eb.600x600x1.jpg", "year": "2011-12-06", "title": "Bang Bang Pow Pow", "lyrics": "[Chorus: T-Pain]\nMy money right (my money, money), my bread good (good, good)\nShawty fuckin’ (wassup, girl?), that head good!\nBang, bang, pow, pow\nI do my thang, thang, look at me now, now\nMy money right (my money, money), my cash up (up up and away)\nFace down (face down), ass up\nI rep my town, town, that’s where I’m from, from\nSo, nigga, pow, pow, bum, bum\n\n[Verse 1: T-Pain]\nMoney to blow, I’m limpin' off tour\nBoatloads of cash, bitch, I’m overboard\nI got money for these whores if you open up the door\nCompany accounts and they all on one accord\nReal talk, I don’t speak, even if it’s “Hi, hater”\nI’m on top and I done locked the elevator\nAll these bitches say I'm fly and I can never touch the ground\nI’m not tryna be in your circle cause I don’t fuck around\nI get that money, that money (money)\nI live it, I want it (want it)\nDrop the top on that Ferrari, now I’m in California\nI let the hardtop down and the wind blow through\nAll I do is win, what the fuck you gon' do?\nI'm good, good, good and\nI do this for my hood, hood, hood\nYeah, and ain't nobody gonna stop me I doing it right now\nSo bang, bang, pow, pow, everybody say\n\n[Chorus: T-Pain]\nMy money right (my money, money), my bread good (good, good)\nShawty fuckin’ (wassup, girl?), that head good!\nBang, bang, pow, pow\nI do my thang, thang, look at me now, now\nMy money right (my money, money), my cash up (up up and away)\nFace down (face down), ass up\nI rep my town, town, that’s where I’m from, from\nSo, nigga, pow, pow, bum, bum\n\n[Verse 2: Lil Wayne]\nI go so hard they call me go so hard\nYou ain't a king, you a joker card\nFuckin’ up the Church money like a alter boy\nI got them yellow Xannies, that's them Tonka toys\nI go bonkers, boy, I put that on my mamma nem\nThese hoes are all alike, they put the 'ho' in homonym\nI think all these niggas sound like me, that’s a compliment\nI told a midget \"Bitch, I do it big, hippopotamus\"\nPut that on my Slime and ‘em, no b-ball, we stop and pop\nNo b-ball, we got shit locked, swagger ill, wassup, doc?\nMake that pussy pop like the gun I went to jail for\nShoot the doors off that Jeep, that bitch look like a mail truck\nYa pussy, keep ya tail tucked, real niggas in this bitch\nGet that pussy wet, fuck her than I jet, Kenny Smith\nT-Pain voice, all I do is win and shit\nYoung Money in ya muthafuckin’ face, blemishes\n\n[Chorus: T-Pain]\nMy money right (my money, money), my bread good (good, good)\nShawty fuckin’ (wassup, girl?), that head good!\nBang, bang, pow, pow\nI do my thang, thang, look at me now, now\nMy money right (my money, money), my cash up (up up and away)\nFace down (face down), ass up\nI rep my town, town, that’s where I’m from, from\nSo, nigga, pow, pow, bum, bum"}], "artist": "T-Pain"}