{"songs": [{"image": "https://images.genius.com/d4b8299bec1aac14c1931423e8d3466c.500x500x1.jpg", "title": "Envy", "album": "Beam Me Up Scotty", "year": "2009-04-18", "lyrics": "[Hook]\nEnvy, all they do is envy\nDon't they know what's in me?\nDon't they know I'm coming back? Swinging for that-\nEnvy, why would they offend me?\nWhy they go against me?\nDon't they know I'm coming back, swinging for that ass?\nSw-swinging for, sw-sw-sw-swinging for\nSw-swinging for, sw-sw-sw-swinging for\nMercy, mercy, mercy_\nWhy they wanna curse me, curse me, curse me?\nThirsty, thirsty, thirsty\nWhy they wanna curse me, curse me, curse me?\n\n[Verse 1]\nNow every club promoter, wanna bid like auctions\nCause I pack shows, sell ticks like Boston\nPat your back ho, why the fuck they coughin'?\nOh, I got 'em sick, better get that coffin\nI say coffin', you can say casket\nThey're so trash, but where's the waste basket?\nWhere's my hat and where's my strait jacket?\nYup, they jackin', back to Maybachin'\nEverything I do, bitches wanna do it too\nI guess-guess you, just skip to my lou\nI just came through, I flew to St. Lou\nBack to kill you, they blew like HQ\nWhy is it that they make Nicki, a target?\nJust cause, this lil' piggy went to the market\nMarketing steps, they marketed sex\nM-Mark it with an X, they talkin' them checks now, now, now\n\n[Hook]\n\n[Verse 2]\nWhy did you envy? Why you go against me?\nWhen I got trendy, why you ain't commend me?\nWhy when I needed it, why you couldn't lend me?\nWhy you was secretive, frontin' like you friendly?\nWhy did you fear that? Held my career back\nKick it like Air Max, I don't wanna hear that\nCause now, I see-see-see-see, all your run-down\nNiggas better have my money, by sun down\nCause now when I come through, I'm stylin' on 'em\nIt's like I got, hotter than islands, on 'em\nThey say she got colder than igloos; Did she?\nI'm in a GT, she in a Mitsubishi\nJust left Mr. Miyagi\nTell that bitch jump, if that bitch feel froggy\nCause I got one leg up, in the middle of the ring\nAnd that bitch better duck, when that bell go \"Ding!\"\n\n[Hook]\n\n[Outro]\nI'm me, don't you like what you see?\nWon't you get like me?\nCause you thought that I would die\nBut I'm fine, I'm me\nDon't you like what you see?\nWon't you get like me-e-e-e-eeeee?\nCause you thought that I would die\nBut I'm fine\nOh oh, oh-oh-oh (OOOO-oh-ooooh-oh-oh)\nI'm on a go, I'm on a go, yeah\nBut bad gyal, try to stop my flow, yeah yeah yeah\nI'm fine, I'm fine\n\n[Hook]"}], "artist": "Nicki Minaj"}