{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": "2013-04-30", "lyrics": "[Intro: R.A. the Rugged Man]\nSelf-destruction, I'm headed for self-destruction\nI'm self-hating, deprecating, I need help of something\n\n[Verse 1: R.A. the Rugged Man]\nI'm like \"Cunt, pussy, slut, lick twat, lick dick\"\nNo, my vocabulary ain't improved one bit\nI'm the lowest of the lowest life-forms\nAnd I make it painfully obvious every time I write songs\nI'm hated, got liberals begging for the death penalty\nAnd conservatives wishing my mother aborted her pregnancy\nI wish my father just put his dick in my mother's mouth\nAnd instead of getting pregnant she choked on me and spit me out\nKids wanna be me, why you wanna copy this loser?\nAll I do is spit bullshit immature potty humor\nYou doubting me and not listening when I'm talking\nYou can put my dick in your mouth and rub my balls on your chin\nMotherfucker done, duck, sucker, run, run amok\nBuck, buck, gun, Whodini, hut, hut, one\nAll the other white rappers they can suck my dick\nIn fact all the black rappers they can suck my dick\nIn fact everybody out there you can suck my dick\nFind me in the basement fighting pitbulls with Michael Vick\nNow I can say faggot, shit, dick, rape, eat cunt\nAin't no censorship issues here so let's be blunt\nPeople never could stand me, I really don't care\nWill I make some enemies with this record? Hell yeah\n\n[Chorus: R.A. the Rugged Man]\nI'm a piece of shit, I'm a fucking fat fuck\nShoot me in my head, shoot me in my head\nI'm a piece of shit, I'm a fucking fat fuck\nI'm a fucking fat fuck\nI'm a piece of shit, I'm a fucking fat fuck\nShoot me in my head, shoot me in my head\nI'm a piece of shit, I'm a fucking fat fuck\nI'm a fucking fat fuck\n\n[Verse 2: R.A. the Rugged Man]\nOh yes, I'm a little bit old and a little bit bitter\nI could have sold more and been a little bit bigger\nThey claimed that I am the next rapper to get slain\nCome on, shoot me in my head, put a bullet in my fat brain\nI got explosives, guns, knives, weapons of all types\nNinja stars, nunchucks, bats, pipes, looking for fights\n(This is shit, can't you talk about something more positive like the environment or something important like politics?) Yeah, sure\nBill O'Reilly he would hate my guts, so what?\nKatie Couric she would hate my guts, so what?\nBarbara Walters or Whoopi; which one's the dumber slut?\nKeith Olbermann, bitch, could get a knife in his gut\nObama nation, the Bushs, the Clintons or 80's Reaganomics\nIt don't matter, the government always be taking your profits\nThe Republicans ain't shit, the Democrats ain't shit\nWhat would make you think that either side is ever gonna change shit?\nNancy Pelosi, that bitch crazy, before Obama she was water-\nBoarding terrorists and blowing Dick Cheney\nThink they was looking for Bin Laden, that's a croc, they was looking for him\nLike they looking for the murderers of Biggie and Pac\nFuck this, I ain't talking politics no more\nInstead I'll walk in your office and shit on your floor\nHow my crazy ass look spitting political themes?\nWhen I ain't even had beef with Bush till New Orleans\nHmm, strictly spitting that horribleness\nAnybody that don't like it, they can gargle my piss\nRugged Man need love, I'ma grab Obama with that\nThree trillion dollar budget and head to the strip club\nI'm the last one they should ever let speak\nI should save politics for Dead Prez and Immortal Technique\n\n[Chorus: R.A. the Rugged Man]\nI'm a piece of shit, I'm a fucking fat fuck\nShoot me in my head, shoot me in my head\nI'm a piece of shit, I'm a fucking fat fuck\nI'm a fucking fat fuck\nI'm a piece of shit, I'm a fucking fat fuck\nShoot me in my head, shoot me in my head\nI'm a piece of shit, I'm a fucking fat fuck\nI'm a fucking fat fuck\n\n[Outro]\nRugged Man, Rugged Man, Rugged Man\nYou're a piece of shit\nYou're a fucking fat, fucking fat\nFuck, fu-u-uck\n\nWho I'm rollin' with? Nobody nobody nobody nobody\nWho I know? Nobody nobody nobody nobody\nWho I care about? Nobody nobody nobody nobody\nWho give a fuck about me? Nobody nobody nobody nobody\nSing it bitches\nRugged Man is a piece of shit\nThat's right, that's right", "title": "Shoot Me In The Head", "image": "https://images.genius.com/c839ae29cd32413eb20a1c6585d7d604.1000x1000x1.jpg"}]}