{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "Steady Slobbin’", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Intro]\n(\"Like an all-day sucker!\")\n\n[Verse 1: Breeze/Tariq]\nIt's two o'clock, and who that knocking on the door?\nIt's like a drum, that's Mama Dukes, balling, calling me a bum\nAnd then I'm comin to my senses (\"Yo dun, you gotta represent\")\nThen I see a woman lookin bold, with a cold cup of water\nI'm like, \"C'mon Mama, gimme five more minutes\"\nAs we begin, it's sun shinin in it my eyes, I'm done whinin\nThen I rise, I gets the hygiene cleaning\nSo I'm calling up my peoples, then I'm gone\nBut wait, I notice Momma with the cooking (Good looking)\nThe eggs, the grits, and yo, the dumplings\nI guess I can sample a little something\nSit and think about the night past, stuffin my face\nI'm steady thinkin bout that tight ass\nI didn't hit it but whatever, I ate the pudding, yo, word is bond\nThat shit was good and yo I said, \"Love hit me off\"\nShe said she wouldn't (\"Nigga, hell no!\")\nThere go the door yo that's the mob and whassup my niggas?\nJust let me drop this bomb and we can start to steady slobbin'\n\n[Hook: Sheila Coiley]\nHave you ever seen such a sight in your life? (Steady slobbin'!)\nHave you ever seen such a sight in your life?\n(\"Like an all-day sucker!\") (Steady slobbin'!)\n\n[Verse 2: Breeze/Tariq]\nIt didn't break, wiping my ass, I couldn't wait\nSwiping my cash (\"A dollar?\") I hollered, \"Let's be out!\"\nWe bout to set it on the Ave\nForget it, think about the shorties I'ma bag (\"Look at him!\")\nCousin by side of honey, sweating\nBut he was too busy with money-getting\n(\"What up, son, could you spare some change?\")\nJust gettin cheddar, so then I see some of my other fellas\n(\"Whassup my niggas!\") (\"Ayo, that motherfucker kinda strange\")\nHolding it down, son, we stood there, yo, check it son\nShorty looked kinda good\n(\"Yeah then what?\") Umm, we stood there\n(\"She got a body\"!) Yeah, my nigga, look how she flaunting it\n(\"She prolly snotty\") Yo word is bond, yo I don't want that bitch\nSome sucker in a Lex' took her (\"Fuck her!\")\nGimme that next hooker, a shorty not a ho, but horny on the low (No doubt) Well, I'm betting this chick could do the job\nAnd check it, I'ma be the motherfucking don\nAnd show her I'm bout that steady slobbin'\n\n[Hook: Sheila Coiley]\nHave you ever seen such a sight in your life? (Steady slobbin'!)\nHave you ever seen such a sight in your life?\n(\"Like an all-day sucker!\") (Steady slobbin'!)\n\n[Verse 3: Breeze/Tariq & (Woman)]\nShe all alone (These niggas must be scared of the ass)\nShe overgrown, I think she kinda big, as I pass\nYo she's sort of healthy (What that mean, a healthy appetite?)\nI'm like, \"Yo I'mma go for delf, C\" (Go for delf, B, that's right)\nSwingin that \"Love yo how ya doin?\" She responded to the mack\nAnd love returned to my pursuing just like fondling the sack\nAnd saying (Finally, I got one, I know the short stay)\nAnd we up in this sorta hot, son, continued foreplaying\nAnd then, BLAOW, we steady thumpin\n(Yo hold up, boo, yo, that's my belly button\nGimme a second, let me get—) UHHH, the jelly comin!\n(Great) Of course, yo, love, I'm never satisfied\n(Yo you couldn't wait some?) Yo, after I hit her, I had her crying\nYo, shorty catching feelings, then you know a nigga snuck out\n(You call that 'sexual healing?' GET THE FUCK OUT!)\nBut first, a nigga sitting on the throne to drop this bomb\nAnd then I gather up the motherfucking squad\nAnd continue the steady slobbin'\n\n[Hook: Sheila Coiley]\nHave you ever seen such a sight in your life? (Steady slobbin'!)\nHave you ever seen such a sight in your life?\n(\"Like an all-day sucker!\") (Steady slobbin'!)\n\n[Outro]\n\"Like an all-day sucker!\"\n\"Like an all-day sucker!\"\n\"Like an all-day sucker!\"\n\"Like an all-day sucker!\"\n(*glass breaks, alarm goes off*)", "year": "1999-02-23"}]}