{"songs": [{"year": "2003-01-01", "image": "https://images.genius.com/1c1c9c3b1982f1cae03e4d20479cd365.818x818x1.jpg", "title": "Fanaticism", "album": "Camouflage (2003 Original Version)", "lyrics": "Cross my fingers for heaven and a burn a chalice with brethren\nThree-six-five, twenty-four-seven, hold cigars like 7-11\nJars of that seven-four-seven, coming to America, Johnny Dangerous\nFlex mic stainless to spit at close ranges\nWho these strangers in the mirror? Objects may be nearer\nDead see life clearer, if drugs is terror, call me Paul Pot\nRed rags and ? pens, spitting phlegm and bloody gems\nCorner store hymns, Russian Roulette among friends\nForgotten Gods guard you now, Gunzu mile, don't fuck around\nPiru's will pave the town, incoming, hit the ground\nHave a brown bag beer and a frown\n\nI drank from Mommas tears, came up fighting my peers\nShots busted and no need to fear\nThe bullet that kills you is the one you ain't hear\nKalashnikovs and spear, four-hundred years\nI been ready, pass the machete on some Mario Andrede\nGimme some gas, bags of diesel, powder to the people\nCourtesy of pigeons waving Desert Eagles\nCrumb snatching like \"Sorry Miss Jackson, it's that real\"\nSpeedy Claxton, run your pockets transaction\nG.E.D. ?splitter? factions, bagging up fractions\nMoving decimals, nine to five to square root\nOn the corner of duece hanging from my hypotenuse\nStrange fruit, cigarettes and women prefer them loose\nSemi automatic mathematics\nLike how many Backwoods before you're hustling backwards\nWord problems, essay questions\nStandardized testin', sativa sessions\nSeminars and lessons, a raw mic blessin'\n\nIf I should die before I wake- Nah\nRather stay up late blowing unk in the gate\nWatch the day break, write til my hand ache\nRewind the tape, pen out on fate\nTrue believers will detonate\nCrying \"God is great!\", give me an L and V8\nTo see straight through that screw face\nPartner, that thug shit don't hold no weight\nWhen niggas run from the Jake\nAnd shoot your grandmother\nSpeech impediment led to mac stutter\nBig bother smart than a motherfucker\nLook I don't need the cream\nFuck swimming the mainstream, rather starve\nThan sell my dreams or pedal my soul with the eye of a fiend\nBilly still got the triple beam\nAnd both thumbs green, nah mean?\nRod Strickland, I'll fuck up your team\nSpeaking shake, engraved Satan\nSounding rusty verses for your playpen\nFresh off the plantation to bear hug radio stations\nTil something's breaking\nCarpet bomb from a nigga pacing we not patient\n\nMulah Omar, ain't nobody seeing me Joe\nGot spacious closets for my seeds to grow\nBackwoodz in studio kicking in the do' fo'sho\nBe that red-eye cat with the body bag flow\n\nI know you're feeling me man!\nDeep down in your soul!"}], "artist": "​billy woods"}