{"songs": [{"year": "2018-11-19", "image": "https://images.genius.com/7e76648d6d57b45b3479824f3942d501.1000x1000x1.jpg", "title": "Conception", "album": "Streams of Thought Vol. 2", "lyrics": "[Chorus: Reek Ruffin]\nWhere I go, where I go from here?\nOh I, know I, could be nowhere\nAnd trust that all that money's good for nothin’ if you scared\nSingin', yeah, yeah\n\n[Verse 1: Black Thought]\nLook\nI am no fashion model but\nI got fresh for photographers\nThe camo coat had the collar up\n'Cause my emotions was bottled up\nAnd though the ocean did not erupt\nIt turned up ’til it's loud enough\nTo just make somethin' out of us\nPass the shadow of a doubt in us\nGodly, geometry and calculus\nThat I can move any mountain with\nA nigga gotta be an alchemist\nTryna create another avenue of revenue\nOr several because I'm in love with havin' you\nSecurity is just a whole 'nother animal\nI can't assume Xanadu had a panic room\nI wish the man in the moon had a manual\nAnd gratitude for the wishes I granted you\nA lifetime, finally I'm understandin’ you\nThe lifelines that delines in a hand or two\nAnd how it’s difficult to undo the damage you've done\nOnce the codes run under scanner too\nSo if you capture the flame and it’s painful\nYou just charge that to the game\n'Cause it's shameful to just fall back and complain\nThat you fractured the laws of attraction again\nFocus on the more passionate plane\nNo conception's immaculate, man\n\n[Chorus: Reek Ruffin]\nWhere I go, where I go from here?\nOh I, know I, could be nowhere\nAnd trust that all that money’s good for nothin' if you scared\nSingin', yeah, yeah\n\n[Verse 2: Black Thought]\nOnce again to the well, I went\nWhile the soul man screamed bloody hell out there\nI'm tryna decode the meaning of the spell I'm in\nAnd I don't even know what fucking hotel I'm in\nI checked in as the monarch of mel-a-nin\nThe el-a-phant, my body is a shell I'm in\nPiecin' myself together, teachin' myself to never\nLet one loss divorce my devel-op-ment\nReminds me of Ego Trippin' like Nikki Giovanni\nWishin' the system might deliver me a body\nCum laude, the rug on the floor was from Saudi\nThe message I'd hung on the door was unrowdy\nNo dowry, the price of it all was one cowrie\nNow we the last flophouse on The Bowery\nHuman traffickin', moving Africans\nStill rapping with fantasies, fill the bracket in\nAnd if you capture the flame, and it's painful\nThen just charge that to the game\n'Cause it's shameful to just fall back and complain\nThat you fractured the laws of attraction, again\nFocus on a more passionate plane\nEstimate a more accurate frame\nOf time, a frame of mind attached to the sane\nNo conception's immaculate, man\n\n[Chorus: Reek Ruffin]\nWhere I go, where I go from here?\nOh I, know I, could be nowhere\nAnd trust that all that money's good for nothin' if you scared\nSingin', yeah, yeah\n\nWhere I go, where I go from here?\nOh I, know I, could be nowhere\nAnd trust that all that money's good for nothin' if you scared\nSingin', yeah, yeah"}], "artist": "Black Thought"}