{"artist": "Asher Roth", "songs": [{"title": "A Milli (Remix)", "image": "https://images.genius.com/d2428ce0d129ae1116dae83c31fd96ce.800x450x1.jpg", "album": null, "lyrics": "(Bangladesh!)\nNo, not Bangladesh! Bangley\nYo, Brain Bang!\nYo Myspace's been blowing me up\nTelling me I had to do it\nAnd since I'm a real democracy\nI figured \"I might as well\"\nYou know what I mean\nIt goes like this\n\nA million here, a million there\nYeah, you got a mil but for real dog nobody cares\nIf you don't share, don't donate to charity\nChildren who can barely eat, no shoes on their feet\nWe don't see, we don't read, we don't really need to\nSelf-centered humans be the root of all evil\nIn this industry, we just feed our egos\nGot a 7 series and a brand new pea coat\nWith that \"oh, oh look at me yo\n\"Heard Ash on milli he ain't talking 'bout me though\"\nYes I am, yo, you call yourself a man\nBut it ain't about the money, it's about what you stand for\nThis is for my people who can't afford pampers\nWake up in the morning got my clothes out the hamper\n\nMoney ain't the answer, still ain't cured cancer\nI ain't got a mil but I'm a pretty good dancer\nMy advance lasts me about a week\nAfter taxes and my bills and a big sack of weed\nI am back to where I began\nChilling watching CNN\nThinking damn, we are damned, not again\nHow is George Bush not in jail for treason\nBut Clinton gets impeached for busting semen? uh\n\nA million dead, a million scarred\nA million bars till' you realize you took it too far\nWith your cars and you guns, ha, hardy-har-har\nTil' I'm dead and I'm gone I'mma party too hard\nLife's short, have a ball, matter fact, have two\nYo the government don't care, here's a big \"Fuck you!\"\nCause gas is 4 bucks, but they still drive trucks\nDumb and dumber in your hummer, yo I bet that sucks\nSpend a milli at the pump\nIn the city you don't need that\nBuy a fucking bike, maybe you wouldn't be fat\n\nYo homie where the weed at?\nYeah I need to relax, motherfucker I'm chill\n\n(Just relax b, are you done yet?)\nNah\nIt's just these stupid motherfuckers never get it\nIt's pathetic\nYo they get to the pros and don't do shit\nLike they Redick\nWhen I get that check\nI'm gonna take it right to the medic\nCause these sick kids need it more than I need a necklace\nY'all need to respect this\nI'm Asher Paul Roth, yo, I'm always on the guest list\nYeah I got a checklist\nStay getting checked, bitch\nKeep your mouth closed don't let yourself get checked bitch\nRap's Wayne Gretzky, yes, I'm the best and\nOnly 22, almost Alex Ovechkin\nI suggest y'all invest in some self-esteem\nIntervene with Charlton Heston's\nPlan to arm every man with a handgun\nWho kills people, the gun or the man? um\nI'm the best sword fighter in the land, come test me\nI'll be drinking wine while practicing my fencing\nAnd driving a jet-ski, straight multitasking\n\"How are you so good?\"\nI don't know, don't ask me\n\nA million here, a million there\nYeah, you got a mil but for real dog nobody cares\nIf you don't share, don't donate to charity\nChildren who can barely eat, no shoes on their feet\nWe don't see, we don't read, we don't really need to\nSelf-centered humans be the root of all evil\n\nMotherfucker I'm ill\nWhat up Bangly?\nYour welcome", "year": "2009-05-10"}]}