{"artist": "C-Murder", "songs": [{"title": "Duck & Run", "album": "Life Or Death", "year": "1998-03-17", "image": "https://images.genius.com/dd9b12b56387cac0b0c8ab7e7315ade3.200x200x1.jpg", "lyrics": "(gun shots in the distance, heavy breathing, reloading a clip)\n\n[Intro: C-Murder]\nDuck an Run Foo, You Better Duck an Run Nigga, Duck an Run Foo,You\nBetter Duck an Run Nigga\n\n[C-Murder]\nYou better duck an run when you hear the tank comin' through,in a show or at a\nSto' near you. When you hear No Limit Soldier or Bout It Bout It my tank dawgs\nBout to get this muthafucka rowdy, them hoes bounce that ass in the front\nLine, an my thugs be throwin up gang signs an all they talk about is break 'em\nOff somethin' rolled an start fightin' 'til the muthafuckin' place close.Po-\nPo's mad I'm smokin' weed on stage crowds gettin' smashed by da barracades.Red\nAn Blue be muggin' on both side 3-Ward niggas talkin' bout take it out side.An\nThem muthafuckin' GD's they got them Uzi's an they be bang like them niggas in\nThe movies,huh, you can come to my show for fun nigga,but be prepared to Duck\n& Run nigga....\n\n[Hook: Fiend]\nDuck an run (better duck an run nigga),duck an run (you better duck an\nRun nigga),duck an run (said duck an run nigga),duck an run (duck an run, duck\nAn run)\n\n[C-Murder]\nYou can put me in the muthafuckin' Rap Hall of Fame cuz I got ever ghetto\nNigga callin' my name.Fuck main-stream foo', I keep it real,my record sales\nKeep me paid jus' like bill.He jump street day now I gottah come an get cha\nLay it down an everybody das wit cha. I make money off the muthafuckin'\nPublic, double-platinum...an lovin' every minute of it. I celebrate wit\nCrystyle an alizae, an doin' almost every other day. 40 G's a whop, it don't\nStop. I'm off the streets now, I ain't gottah sell rocks. But the game ain't\nChanged, the ghetto's in my veins, you could tell...by my muthafuckin' name\nI'm used to bangin' foo' fa fun, I'm chill but still make you Duck & Run\nNigga...\n\n[Hook]"}]}