{"artist": "IDK", "songs": [{"title": "Julia . . .", "lyrics": "[Intro]\nWhere's God?\nWhere’s God?\n\n[Verse 1]\nI could've been dead (Where's God?)\nI could’ve been just like Manny with a bullet in his head\nI could've been this killer and living inside the feds\nWith a calendar crossing off all the days beside my bed\nOr like his cousin, yeah, I could've been a motherfucking\nMcDonald's employee with a shorty, not my wife but we got kids\nIt's a shame (Where's God?) 'cause minimum wage in this age\nAin't enough to even buy they ass a bib\nI could’ve been a college student paying my tuition\nBut I couldn’t even tell you what the fuck my major is  (Where's God?)\nBut bust my fucking ass every day to buy a suit and make a resume\nAnd take a interview and lose to a kid with a fucking trade\nYeah, I could’ve been the owner of that business (Where's God?)\nThat hired her from the lust inside my brain (Where's God?)\nAnd even though I'm 50 and she’s 21, I use my power to fuck her (Where's—)\nGrabbing her with the same damn hand that has my ring (Where's God?)\nI could've been a wife staying up at night\nLooking at my watch like, \"Where's my man? Man, I hope that he's okay\" (Where's God?)\nWhen meanwhile, he's inside a hotel getting that ho tail\nWithout a rubber or a shame (Where's God?), but stop that there\nSince a little boy, I knew that I was someone rare\nI don't know how I knew but I knew it was something inside of me\nTelling me I could be successful outside of society\nHistory classes ain't working, I'm ditching these classes\nMan these niggas need glasses, they don't see it\nI'm better than average, I'm telling you, coach, put me in\nAnd I'm still on the bench, I'm thinking I suck\nWhat's your grades? A D and a D, a D and a A, that's in art\nDoes that mean I'm great? Am I gon' be straight?\nAnd this what they say, \"There's no jobs for niggas that paint\"\nSo my whole fucking life I grew up thinking I can't\n\n[Interlude]\nNiggas that paint, niggas that paint, niggas that paint (Where's God?)\nNiggas that paint, niggas that paint, niggas\n\n[Verse 2]\nAnd meanwhile, I'm thinking that my life's fucked up\nBut my mom was going through it, she really had tough luck (Where's God?)\nBut she kept it to her herself, I had no idea (Where's God?)\nTo the point that I denied the little things I'd hear\nFrom my family members, now and then and here and there\n'Til I saw one day that mama was losing hair (Where's God?)\nAnd her losing her weight, then eventually losing her brain\n'Til I put two and two together, confusion was strain\nSince my auntie told me the truth, I'll never be the same\nWhen she died is when I heard my stepfather gave her AIDS\n\n[Interlude]\nWhere's God? Where's God? Where's God? Where's God?\nWhere's God? Where's God? Where's God? Where's God?\nWhere's God? Where's God? Where's God? Where's God?\nWhere's God? Where's God? Where's God? Where's God?\nWhere's God? Where's God? Where's God? Where's God?\n\n[Outro: IDK & Man]\nAlright, ay, so listen, what color are my pants?\nRed!\nAlright so, describe to me the color red\nWithout using another color, or anything associated with the color\nI think the color red is something that provokes emotion out of people\nNah, I'm saying how can you visually\nVisually describe it?\nDescribe the color red without using another color\nIt's impossible, there's no way you can do that\nNo\nSo look, how do you know that when you see red, right?\nI don't see blue? How do you know we see the same color?\nThere's no way to tell\nThere's no way you can tell, like\nIf, if we can see the same color no matter what because\nI could've grown up my whole life thinking that red was really\nI see blue but I thought it was red 'cause that's what they taught me\nRight\nAnd there's no way to describe it to you\nSo to know if we see the same thing, so\nIf we know— if we can't even say that we see the same thing, right?\nIf me and you can like literally talk about colors\nAnd we're not advanced enough, um, like\nSociety, humanity, whatever you wanna call it, or technology\nTo say that, to know if we actually even see the same colors\nThen how, can we say there is no God?", "image": "https://images.genius.com/b77211ed800701c5cc8dc9a5a6ec95fa.1000x1000x1.jpg", "album": "Is He Real?", "year": "2019-09-04"}]}