{"songs": [{"image": "https://images.genius.com/d23a600c139bca90fa38b331a4e93acd.1000x1000x1.jpg", "title": "Come Get Me", "album": "Nastradamus", "year": "1999-11-23", "lyrics": "[Produced by DJ Premier]\n\n[Intro]\nAnd as a special treat this evening\nI have asked America's foremost young poet\nTo read his latest poem for us\n\n[Scratching by DJ Premier]\n\"Ladies and gentlemen..\"\n\"Na-Na-Na-Nastradamus\"\n\"Everybody watch him\"\n\"Ladies and gentlemen..\"\n\"Na-Na-Na-Nastradamus\"\n\"We-we-we came a long way\"\n\"Ladies and gentlemen..\"\n\"Na-Na-Na-Nastradamus\"\n\"Everybody watch him\"\n\"Ladies and gentlemen..\"\n\"Na-Na-Na-Nastradamus\"*\n\n[Verse 1]\nYo..\nYo.. yo..\nPower and crime, the thugs slinging powder and dimes\nTwenties of D, is yo' niggas wilder than mine?\nMy niggas bust nines, puff lye and stick up cowards\nFor they shine, you resist, then you push up flowers\nI'm like Luca Brasi, Vito's best hit-man\nThat's \"Godfather\" shit, back seat, next lit plans\nRevolvers spit, I'm too tough to bargain with\nAnd you don't want the God to pull up the cars that's sick\nArms and wrists is lit up, Queensbridge Kings\nPlaques, awards, applause when I do my thing\nStreets is black as midnight, the concrete gray\nWith stains of blood and germ and piss all day\nCome on the ave, get sized up, plus appraised\nDuck and pray that my guns don't bust your way\nNiggas with names, living off reputation\nSometimes gotta remind you ain't nothing changing\n\n[Scratching by DJ Premier]\n\"Ladies and gentlemen..\"\n\"Na-Na-Na-Nastradamus\"\n\"Everybody watch him\"}\n\n[Chorus]\nIf you ill come get me, 'cause I ain't running\nIf your gun's off the hook then we'll both be gunning\nCome get me if you real, 'cause I ain't scared\nIt's all fair in love and war and I'm well prepared\nIf you ill come get me, 'cause I ain't running\nIf your gun's off the hook then we'll both be gunning\nCome get me if you real, 'cause I ain't scared\nIt's all fair in love we can take it there\n\n[Verse 2]\nYou don't like me clown? Now you wanna take me down?\nIf I bring my face around, you gon' do what? You butt\nYour crew knew I blew up, I been shining - baseball diamonds\nDick rings for your chicklings\nNiggas know what my nine pearl handle's about\nFuck you say girlie mouth? Get it krunk like the Dirty South\nAnd I know you see me flossed out, multi-milli-i\nHear your bitch talk about me, you give her the cold eye?\nGirls dig you, imagine what she feel for me?\nYou make hot songs, but she know you steal from me\nWho ill as me? I wild on haters in album three\nNext level - I take y'all niggas to 3-D\nCan't find a nigga shook from Queens\nI'll be with the most grimy killers\n(what nigga) and they all look clean\nWho put bombs underneath cars, if you want beef then start\nYour next stop is to the graveyard\n\n[Chorus]\nIf you ill come get me, 'cause I ain't running\nIf your gun's off the hook then we'll both be gunning\nCome get me if you real, 'cause I ain't scared\nIt's all fair in love and war and I'm well prepared\nIf you ill come get me, 'cause I ain't running\nIf your gun's off the hook then we'll both be gunning\nCome get me if you real, 'cause I ain't scared\nIt's all fair in love we can take it there\n\n[Verse 3]\nYou too feminine to kill again, jail got you soft\nYou talk but you scared to go back up North\nKeep your face twisted, but you don't really want nothing\nTalk a bunch of shit motherfucker and stop fronting\nYou don't wanna flip again, and sell drugs again\nBe on the run again, catch you at the Comfort Inn\nShoot up your door, bust in on you and your whore\nPut y'all in bags, clean the blood off of the floor\nSo play tough, I want y'all to get out of line\nI got nines, every color shape and design\nI sent killers every race to put one in your spine\nTwo in your ear, get your crew, who do I fear?\nNobody never get involved and none of 'em dying\nI think like you do, roll with about two irons\nCatch me flying, high in the aircraft wining\n- and dining, you die, then we laugh, you bitch-ass\nThe rich ass, they gauze up, your stab wounds\nWhile I'm getting head, in a Lear jet, bathroom\nWith all my goons, all my ice, and suitcases\nFull of paper, not money it's bank statements\nThe Illmatic that explains how we rock\nYachts and co-ops, we buy the hood and sell you a block\n\n[Chorus]\nIf you ill come get me, 'cause I ain't running\nIf your gun's off the hook then we'll both be gunning\nCome get me if you real, 'cause I ain't scared\nIt's all fair in love and war and I'm well prepared\nIf you ill come get me, 'cause I ain't running\nIf your gun's off the hook then we'll both be gunning\nCome get me if you real, 'cause I ain't scared\nIt's all fair in love we can take it there\n\n{*scratching by DJ Premier*}\n\"Ladies and gentlemen..\"\n\"Na-Na-Na-Nastradamus\"\n\"Everybody watch him\"\n\"Ladies and gentlemen..\"\n\"Na-Na-Na-Nastradamus\"\n\"We-we-we came a long way\"\n\"Ladies and gentlemen..\"\n\"Na-Na-Na-Nastradamus\"\n\"Everybody watch him\"\n\"Ladies and gentlemen..\"\n\"Na-Na-Na-Nastradamus\"*}\n\n{*scratching by DJ Premier*}\n\"Ladies and gentlemen..\"\n\"Ladies and gentlemen..\"\n\n{\"Hydro Drops\" weed skit follows}"}], "artist": "Nas"}