{"artist": "Canibus", "songs": [{"title": "Black Lithium", "album": "Full Spectrum Dominance", "year": "2018-06-22", "image": "https://images.genius.com/e46ac064e354d1b1540013198f5e0d71.1000x1000x1.jpg", "lyrics": "As I lay my head down to sleep\nIn true hip hop my soul will speak\n\n[Verse 1: Canibus]\nI quit giving a crap about rap way back\nBut this is poetry - something that they can't take back\nRight ascension, nineteen hours and fifteen lyrics\nDeclination fifty degrees of sixteen spirits\nFrom carbon I came, to carbon I return\nIt seems like ridicule is all that I've earned\nBlack lithium clouds\nMaritime meridian bound\nRap music look how silly you sound\nInsectoids, high pitch voice, fricking cricket noises\nIt's annoying like poison from Neonicotinoids\nTell me who does the Creator favour?\nThe one who loves thy neighbour\nOr the intolerable self-hating hater?\nSchlemiel! Schlimazel! Shmuck!\nWhich one of you cucks\nClean it up without making a fuss!\nI'll continue with the assumption that everything I'm saying\nCan and will be subject to misinterpretation\nTough situation\nHunting Huxtable season\nJesus\nWhere's Roy Cohn when you need him?\nI thought they was bluffing when I heard 'em say\n\"The nigga gets nothing.\"\nFeed is like insurance to the Buzzards\n\n[Hook: Nappi Music] x2\nBlack lithium\nThey want our head in the clouds so we don't see how they puttin' it down\nBlack lithium\nYou can't take my mind from me\n\n[Verse 2: Canibus]\nI've released thousands of tracks, received plaques\nNone of that matters, I wanna believe that\nMic pressure in full power on U.S.S. Nimitz\nElevation is correlated to sea level systems\nHistory is repeated\nPatterns of a purge that is critically needed to bring balance to the world\nThese are not my words, however cruel those words may sound\nThis is what we are faced with now\nThey call it choice\nI call it an adroit attempt to mind control our soul from a source\nA source of power, not ours\nWe should own our own labour, and we have shown infinite patience\nYet! There is no mention, no concessions\nWe are stuck, marooned in a place that sucks\nContinual with the assumption that everything I'm saying\nCan and will be subject to misinterpretation\nI don't know what we deserve for still believing these liars for stealin'\nCheatin' and deceivin'\nYes, remain humble\nWhile Fireteam Raven rumbles\nIn a war wagon that'll pop your bubble\n\n[Hook: Nappi Music]\nBlack lithium\nThey want our head in the clouds so we don't see how they puttin' it down\nBlack lithium\nYou can't take my mind from me\n\n[Verse 3: Canibus]\nI quit giving a crap about rap way back\nBut this is poetry - something that they can't take back\nWrite a message, twenty-three hours and nineteen minutes\nSpace station, thirty degrees and eighteen inches\nFortune and fame, steep learning curves\nThe phoenix bird that does not want to re-emerge\nYou know what they say about every day above ground\nYou embrace the hate, you can't save love now\nInstinctually low impulse control\nOften found at some some old heads watering hole\nWhere you meet your pseudo-maker?\nIn a volcano crater closed chamber\nBehold Satan, go and entertain him!\nA deal and an oath is struck\nUnknown to the deaf, dumb, and blind\nYou are told to trust\nI'll continue with the assumption\nThat everything I'm saying can and will be subject to misinterpretation\nA little bit of history'll tell you the present\nI'll be a prophetic, the future might be already written\nUnless we become brothers\nYou will suffer the suffering of the suffered through unjust judgement\n\n[Hook: Nappi Music] x2\nBlack lithium\nThey want our head in the clouds so we don't see how they puttin' it down\nBlack lithium\nYou can't take my mind from me"}]}