{"songs": [{"year": "2014-12-17", "album": "Bubblegum / IWB", "image": "https://images.genius.com/6cc1143afe7e335f8b0216bb98e015c3.1000x1000x1.jpg", "title": "IWB", "lyrics": "[Verse 1: Kevin Abstract]\nYou internet weird, boy, go and close your laptop\nBet your friends that bop\nImagine if your cousin never got shot\nImagine if shots never got thrown\nI'm alone, yeah I'm looking for a home\nAll these motherfuckers looking for a clone\nAnd I, and I, and I, and I, and I\nAnd I'm searchin' for a purpose\nI'm the furthest thing from worthless\nI'm the furthest thing from perfect\nI just thought I'd let y'all know\nBarely touched the surface\nMy cousin back in the morning\nMy good God done closed the curtains\nI just sold my fucking soul\nWho done let y'all in? (Oh)\nMy veins still crawling\nBangin' on that (Ah), slangin' all that (Ah-ah)\nMade to fall back (Ah), made to sit back\nMy days don't mean that much no more\nRemember when I wanna ride that sto'\nLittle Black boy bang Glock, let's go\nBig bro had the whole block on froze\nAll pink everything, I think I'm Cam'ron\nPlaying Bloody Mary, keep my lamp on\n\n[Chorus: Kevin Abstract]\nPull up, Chevy truck, with the pump and some yellow stones\nSee my homie here, but tomorrow, yeah, they not around\nThat's something that I know, but I won't stand my fucking ground\nLose my world, my mind, all the time, I'm a fucking child\nPull up, Chevy truck, with the pump and some yellow stones\nSee my homie here, but tomorrow, yeah, they not around\nThat's something that I know, but I won't stand my fucking ground\nLose my world, my mind, all the time, I'm a fucking child\n\n[Verse 2: Matt Champion]\nRed lips is drippin' like, ooh\nFingertip, grippin' that, ooh\nFind me on top of the roof\nFuck you right under the moon, ahhhh\nBitch speaking French on the phone (Brrrp!)\nColors of my body looking vibrant (Vibrant)\nI got a thotty on vibrate (Vibrate)\nShe hit me on the phone, no vibrate, lightweight\nWhen she see what's inside, wait, like you know\nSocks rolled up, powder rocks in the Nikes\nEyelids low, skirt in the clouds\nBetter fuck her on the driveway, top on the highway\nOh my God, don't come 'round here\nThe Sun 'round here, the fun right here\nOh my God, what the fuck you do with it?\nTry to come through with it, baby, I'm true with it\n\n[Bridge: Matt Champion]\nOh my God\nOh my God\nOh my God\n\n[Verse 3: Ameer Vann]\nUgh! Rockstar with the top down (Damn)\nOn my sixth shot, call me Mike Brown (Goddamn)\nWear the name like a thorn-crown\nLet go and see the white now\nLittle boy from the H-Town (City)\nRaised in the sewers in the city of the syrup\nSkype call to Europe like brrrp!\nMoney come fast when you born like this\nWith that flow so crisp\nNigga been lit since high school\nWhere I learned to trap with them white dudes\nWhat that white do? Nigga, you don't know\nI done paid my dues, I don't fuck with you\nI wear Marvin Blackman tennis shoes\nAnd all year round, that mink coat to match\nAnd wood on the dash of my candy 'Lac\nAll this shit I ain't supposed to have\nWith my selfish ass, I've been living lavish\nHead so big that the roof is absent\nChain so big that my neck been cracking\nWhip so slick that I slip through traffic\nSame old shit from when they brought me here\nAnd the smoke's too thick to see my fate is clear\nI might disappear and then reappear\nBecause I'm mostly smoke and I'm always dope\nNever going broke and never did before\nDoing pretty good far as geniuses go\nKnow they want a thug but they needed some more\nMost know about Slim, they don't know about Ro'\nThey don't know about chrome, they don't know about po'\nThey don't know about the Screw, they don't know about the mo'\n281-330-8004\nHit Mike Jones up on the low, because Mike Jones about to blow"}], "artist": "Kevin Abstract"}