{"artist": "Booba", "songs": [{"album": "Futur 2.0", "title": "Billets verts", "year": "2012-11-26", "lyrics": "[Intro]\nBack to the future\nIzi\n\n[Refrain]\nDerniers gamos, dernières tes-pu, dernières pes-sa\nMC tu donnes ton cul, ta monnaie pue d'la tte-cha\nBrrr! Machine à billets, billets verts\nTout, tout pour la monnaie Brrr! Brrr! Billets verts\n\n[Couplet unique]\nJ'suis sûr de gagner, comme Barça-Lorient\nMon flow est kalashé, swag Moyen-Orient mieux que Kanye\nTrès courtes relations, j'n'aime pas qu'les putes me questionnent\nViolente est ma narration, rempli de haine, j'n'ai que de l'amour pour quelques personnes\nApprécie le bling, te demande pas combien ça a coûté\nSalopes en string autour de moi, ces putes sont maraboutées\nJ'suis B.O.S.S. donc j'baise la patronne\nOù je me trouve ? Dans l'coeur des youvs, dans l'cul d'la matonne\nLa mafia n'oublie pas, mais elle te pardonne\nGallardo noire tout en carbone\n92i, on parle d'eux de M.I.A à Montigny\nFuck les stups du 9.2, fuck la crim' de Bobigny\nTrop de lances-ba mais tout se paie, on the rocks mon Hennessy\nQuand on n'sait pas on se tait, quand on sait on s'tait aussi\nOui, oui monsieur j'fume que du meu-se\nSi le game ou un rappeur me recherche dis lui qu'j'suis sûrement dans l'cul d'sa reu-se\nJ'vais cracher, ouvre la che-bou\nNégro parano, calibré même sous la che-dou\nBalaise comme Shrek il m'faut ma Fiona, 2-3 chèques puis petit sauna\nT'as ceci, t'as ceci-cela donc l'équipe te saucissonne\nPas toujours l'temps d'faire de la promo\nBakel dans les chromosomes, 0 à 100 en 3 secondes chrono\nZoome sur mon flag, impacts de balles forment mon logo\nZoome sur mon flag, impacts de balles forment mon logo\nB2o\n\n[Refrain]\nDerniers gamos, dernières tes-pu, dernières pes-sa\nMC tu donnes ton cul, ta monnaie pue d'la tte-cha\nBrrr! Machine à billets, billets verts\nTout, tout pour la monnaie Brrr! Brrr! Billets verts", "image": "https://images.genius.com/697af4d75e2024030b44cdca023b8bfb.1000x1000x1.jpg"}]}