{"songs": [{"title": "Shoeless Joe", "image": "https://images.genius.com/f2cb28c772fe54a0b546ca701e04f426.640x640x1.jpg", "lyrics": "[Hook]\nThink you wanna walk in another man's shoes\nThink you wanna do what he do\nThink you wanna be where he's at\nThink you wanna be where he's at, huh?\n\n[Verse 1]\nI ain't gonna tell you nothin' new\nAnd to the best of my ability every word is true\nTell you my story but I'm not the only one\nAs you sit back lookin' at the things that I've done\nHow y'all already promised that I wasn't gonna lie\nSo while I rap these words you can look me in the eyes\nI'm not a perfect man\nLet's get that out the way\nBut that's not a good reason to stray\nIt's not an excuse when I lose my way\nThese are choices I live with on each new day\nWhen I say I'm a blessed man\nI'm being sincere\nBut don't assume it was easy for me to get here\n\n[Hook]\nThink you wanna walk in another man's shoes\nThink you wanna do what he do\nThink you wanna be where he's at\nThink you wanna be where he's at, huh?\n\n[Verse 2]\nIt's never enough\nNever satisfied unquenchable thirst\nWhen the supply is plentiful\nThe workers are few and the sky is heavenful\nFull of heaven, full of God's majesty shining forever more\nThe more we hold back the more the tension grows\nThe more we keep our eyes on the temporal\nPermanent residence of the soul is the place of reverence\nAnd grace is the evidence that we will face his excellence\nWith faith that's measureless\nPaved by the footsteps of Christ as he walked to his death\nBefore we resurrected I strive to be intrepid\nLay me fear at his feet till the day I'm perfected\n\n[Hook]\nThink you wanna walk in another man's shoes\nThink you wanna do what he do\nThink you wanna be where he's at\nThink you wanna be where he's at, huh?\n\n[Verse 3]\nBut he said to me \"my grace is sufficient for you. My power is made perfect in your weakness\"\nTherefore, I will boast all the more gladly about my weaknesses\nSo that Christ's power may rest on me\nThat is why for Christ's sake I delight in weaknesses\nIn Insult in hardships in persecutions in difficulties\nFor when I am weak then I am strong", "year": "2010-04-27", "album": "Weapon Aid"}], "artist": "Braille"}