{"songs": [{"album": "Scriptures", "image": "https://images.genius.com/fc08a4018680b3979b913a15b46cd21b.1000x1000x1.jpg", "year": "2019-06-07", "title": "Heroes", "lyrics": "[Intro]\nOoh, ooh, ooh\nAy, my heroes weren't Batman and Superman and Spiderman, bro\nI had some different type of heroes, my nigga\nLet's talk about 'em\n\n[Verse 1]\nAll my idols on the motherfucking fed list\nAll my opps on the motherfucking dead list (R.I.P. 'em)\nIf I pick my money up, I might as well deaD lift\nCaught your brother on a killer, now he dead, bitch\nP.S.A. to all these niggas, y'all can't fuck with me (Y'all can't fuck with me)\nWhen we chilling, bitch, don't bring no niggas up to me\nAy, I'm in the Bay but I'm on Texas\nYeah, I send that backend, catch it\nShe hit me like, \"Why, you ain't answer?\"\n'Cause I'm with my bitch, ho, text me\nThese Gabbana, these ain't no Margiellas\nWhen she with me, that's when she get the wettest\nStyrofoam cup and that's Codeine infested\nDrinkin' the syrup like I'm under the weather (Ooh, ooh)\nI put you niggas on, give me my credit (Ooh, ooh)\nCondo in LA, it's gettin' developed (Ooh, ooh)\nShe woke up, she ate me for breakfast (Ooh, ooh)\nBoy, who you talking to? Don't get embarrassed\nWe can get far from all that Gucci in Paris\nYou won't see this in no stores, the rarest\nDon't make us get on that car, we gon' air it\nWe live by that gang, and that beef, we inherit\nOoh, ooh, them niggas robbed you because you let 'em\nOoh, ooh, I got twenty choppas, I feel like Tip Harris\nMy shit authentic, their shit generic\nI'm the founder, I'm not your chairman\nDon't play with the Boogieman, shit'll get scary\nAnd I'ma be quiet like this a library\nI send them killers to get 'em, I flip 'em\nWhen they pull up, you know they gon' rip 'em\nSoon as he gone, his niggas gon' miss him\nAfter a month, them boys gon' forget him\nAy, if he got bitches, they better kiss him (Ooh, ooh, ooh)\nAy, 'cause this' they last lil' couple days with him\nI go throw with that K in a Sprinter\nPut on my jewelry, it feel like the winter\nBitch, I'm a boss, refer to me as mister\nGet it from the bank, printer down, I'ma kill him\nMy bitch bad, don't need no filter\nEvery time I hit her gotta leave kids in her\n\n[Outro]\nChanel boy bag, gotta get in my Floyd bag\nAt the clearport, on jets where we deploy at (Deploy)\nAt the traphouse, that's where I was employed at (Employed)\nBut I don't glorify that life, I didn't enjoy that\nBut I don't glorify that life, I didn't enjoy that\nBut I don't glorify that life (I don't glorify that life)\nNo, I don't glorify that life (No, I don't glorify that life)\nWe at the clearport, got a flight (We at the clearport, got a flight)\nWe at the clearport, got a flight (We at the clearport, got a flight)\nWe at the clearport, got a flight\nAnd I don't glorify that life\nWe at the clearport, got a flight\nAt the clearport, got a flight\nI should be there, nigga, tonight"}], "artist": "Tee Grizzley"}