{"artist": "G Herbo", "songs": [{"title": "Bought a Tool", "album": "Still Swervin", "year": "2019-02-01", "image": "https://images.genius.com/c9afa7b8044e0a1dd4a8eba6baf78768.1000x1000x1.jpg", "lyrics": "[Verse]\nIn the streets, I caught the blue\nI got shot, it caught the news\nFlipped a seven, I bought a tool (Bought a tool)\nIf we gon' slide on opps and true\nWhich one of these niggas we ’bout to do\nWe ain't never know nothin' ’bout the schools\nAnd that's why it's EBK, we ain't never care 'bout the rules\nMy mama ain't want me to go to Rock funeral, I snuck out of school\nI was already knee deep in the streets shit\nWent to school every day, wasn't tryna be shit\nFoenem eventually made me quit\nPicked me up every day with like two, three glicks\nAnd we might do a hit, uh\nWe just gon' ride a bit, uh\nWe just gon’ ride and keep gettin’ high\nWe gon' decide who we see outside\nShootin’ already, now I just spin it one more time\nThis Glock 45 stay right by my side\nWe in the front and the back in the van\nThe slide just stay on the left, I hop out on the right\nWhy you fold? Look me in my eyes\nNigga, how you told? Look me in my eyes\nAnd we ready to go\nSoon as I get that money, I'm ready to go\nAnd we ready to blow\nTweak on the road, they gon' think 'bout takin’ your soul\nLong live Pistol P, that's on my soul\nI remember white folks said that we were on the fours\nRock know he couldn't hustle, why the fuck you sell him blow?\nI was rollin' bummers, back when Real was sellin' dro\nSpent a hundred summers totin' that OK Thunder\nWe just ride them cars to get there, hop out, run up on 'em\nAnd I spit that street shit for my niggas out here on defense\nStand your ground and defend it\nNigga, if you made that bed then sleep in it\nStill out here on that street shit\nJust for everybody said I wasn't gon' be shit\nAnd I spread the love (Spread love)\nStill blessed, niggas ain't never gave me shit\nAnd I ain't stressin' shit no more, I'ma let shit be shit\nStill gon' stay down on that G shit\nStill fresh as fuck, I don't rock that cheap shit\nWho you know rock Mike Amiri like me? Shit\nShit, nobody, not me, shit\nI been buyin' this bitches for three years\nWalk in Barneys, get at least like three pairs\nSometimes I be off like two or three pills\nI wan' feel like he feel\nBy the end of the end, need at least another three mil'\nI want a Ghost like Meek Mill\n16, I was ridin' with totes\nWe ain't care where you from, nigga, we want smoke\nGive no fuck, I'm ridin' with folks\nAnd I ain't shoot 'til I got close\nAnd we seein' the oppers from afar, out my lil' ho car\nSkeet off, bail out, throw the shells out\nAnd I did some shit with bro I ain't gon' tell you 'bout\nAin't take advantage of me no more, I ain't gon' bail you out\nHad a grown bitch, like 24, used to come and get me out\nI was too young to bail out, go to her crib, then wear it out\nThat Glock was like my shirt, cock that bitch and wear it out\nAsk your homie them, \"Do it work?\" Cock that bitch and air it out\nGoin' to jail every damn summer, I just ain't care about\nNow you gotta be somebody to know my whereabouts\nClap shit up, they ain't hear about it, they heard about us (Nigga)\n2AM, we ridin', mamas worried about us\nIn this bitch, it's lookin' like we robbed Cabela's\nRidin' with ladders, these bitches gon' sound like propellors\nYou pussy and I smell it, coke, I used to sell it\nI can't believe that you would tell it\nRoll the Runtz, inhale it\nRemember I was waitin' on them to mail it\nPourin' pints up in my belly\nThey tryna throw me on probation, I can't piss test, I'ma fail it\nI might never see Toronto 'cause I might end up a felon\nSat in county for a week, I'm givin' pizza to my sellers\nAnd Cap know he took a piece of me when that nigga left me\nAnd he know he's 'posed to be with me, I let that been a lesson\nThat just mean we 'posed to stick together, add some more Smith & Wessons\nMore niggas on security, that's just more niggas to stretch you\nWopskino stay on security, 'cause I stay with all this jewelry\nAnd we stay away from the fuck niggas, 'cause we ain't with all of that fooleries\nAnd we ridin' with fullies, and we all some bullies\nWe ain't got on no mask, but we all in hoodies\nAnd we don't give no fuck who you is, nigga, book me\nNiggas just send that forty, we gon' pull up smokin' Zuki\nWhat it is, nigga?"}]}