{"artist": "50 Cent", "songs": [{"album": "The Big 10", "image": "https://images.genius.com/ebcbd791d9dec323345c03a3341cac73.320x285x1.jpg", "title": "Nah Nah Nah", "lyrics": "Got the shotgun\nGot the handgun\nGot the paper in my nike box\nBurn the haze up\nYou better raise up\nBefore you get ya punk ass shot\n\n[Hook]\nWe hunt them down\nWe gun them dowm\nCut em down to the floor, nah nah nah\nDont fuck around, the tre pound\nThats 6 rounds for the raw, nah nah nah\nWe on the trip, fuck up a flip\n100 grams of the raw, nah nah nah\nWe on this shit, we spit a clip\nThat your whip home boy? nah nah nah\n\n[Verse 1 - 50 Cent]\nYeah I run the town like a marathon\nTrackstar, trapstar\nTeflon shock plate, front and back hah\nP90 Ruger talk, .38 Special flow\nHollow tip, hottest shit, flyest nigga in New York\nC-4 in the function in the bomb, niggas fronting\nI got it like they want, so they hating when Im stunting\nI'm hot now, I'm bigger than the block now\nRolls drop, top down\nLambo, top down\nViolate, get shot down\nI live by the codes you follow\nI jooks some nigga 'fore I beg or borrow\nI come from the street where there's strong and there's weak\nAnd when the strong hungry, the weak something to eat\n\n[Hook]\n\n[Verse 2 - Tony Yayo]\nThis rap shit is fake if you really wanna ask me\nI'm in the projects with a bitch like Cassie\nDrop top Mayback, the roof all glassy\nLevel two vest on cause niggas wanna blast me\nI'm a menace to society, that's what the judge said\nMy kinda money leave the DA and the judge dead\nShorty turned 5 and he rep that 5\nShorty just turned 6 and he rep that 6\nI got my crack and my four four\nThe four in the morning\nGas up the truck, fuck global warming\nMy money be foreign, my cars be foreign\nIts pedal to the metal in them Air Force Jordans\n\n[Hook]\n\n[Verse 3 - Tony Yayo]\nYeah\nFour bitches in the european whip\nSet it off like Cleo\nHaitian bitches talking Creole\n?Rappers is feeding them all\nTriple header, christmas day\nNavy blue Phantom Ghost\nBox for the pistol play\nWhy comrade Mary overdose on MJ?\nWhy Big ain't have a bullet proof truck like me?\nWhy the club shot up?\nWhat the fuck you expect?\nThey don't search niggas buying bottles at Juliet!\nYeah I just left Southside, I'm to the borough west side (??)\nMoney team to the dream, haters trynna strategize\nWe work hard, they say it come easy\nBitch blow me in the coupe, yeah I cum easy\n\n[Hook]", "year": "2011-12-09"}]}