{"songs": [{"title": "Dream Chasers", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "[Intro: Lil Wayne (Sampled)]\nWhy you drive so fast? Because I'm chasing a dream\nAnd when I catch that motherfucker, I'ma rape it and leave, yeah\nWhy you drive so fast? Because I'm chasing a dream\nAnd when I catch that motherfucker, I'ma rape it and leave, yeah\nWhy you drive so fast? Because I'm chasing a dream\nAnd when I catch that motherfucker, I'ma rape it and leave, yeah\nWhy you drive so fast? Because I'm chasing a dream\nBecause I'm chasing a dream, because I'm chasing a dream, and yeah\n\n[Verse 1: brandUn DeShay]\nAt night, before I close my eyes\nI close my hands towards the skies\nI know I never chose this life\nBut while I got mine, I'm gonna hold this tight\nI thank God for being here now\nI thank God for being there then\nI can try, but I will never know how\nThe earth still spins when every soul full of sin\nBut while we here\nI'd like to take this time out to let them know that someone still cares\nLet them know there's someone who still fears you\nWhen you speak, Lord, someone still hears you\nI know it seems like I strayed from my path, Lord\nBut you still give me everything I ask for\nYou know me better than I know myself\nIf not for my parents, then I'll owe myself\n\n[Chorus 1: brandUn DeShay]\nJust follow your dreams\nKnow that what you see is always more than it seems\nLife is not about finding out what it means\nJust find out what it means to you\nAnd remember to... just follow your dreams\nKnow that what you see is always more than it seems\nLife is not about finding out what it means\nJust find out what it means to you\n\n[Verse 2: brandUn DeShay]\nI know it might be hard to perceive\nBut when I'm awake, I see my dreams\nAt night, I find it hard to sleep\nInside, I know where I'm supposed to be\nIn life, you only get two options\nHooked on Rojo or toxins\nMove towards one, the other one stops\nThen you're forced to choose which one you'd push stock in\nBecause you can be the person that you should be\nOr you could be the person that you couldn't be\nYou'll never find out what you would be\nUntil you've already become, but that's a good thing\nIn life, you're only promised one thing, that's death\nSo I suggest, while you're here, give it your best\nAin't nothing like living life with regrets\nBefore I die, I'm trynna live it 'til there's nothing left\n\n[Chorus 1: brandUn DeShay]\n\n[Verse 3: brandUn DeShay]\nIf you could take a trip through my mind\nThen you could see the world through my eyes\nThen you could see the stars in my skies\nYou would understand why I pray just to take flight\nI give the feel of life right before sunrise\nIf only I can do it, man, just one time\nFly away and as soon as I touch clouds\nI'll make a vow that I'm never ever coming down\nI'ma fly around the world for a whole day\nAnd at night, take flight out to the Milky Way\nGalaxies around me, no way\nI finally see, there's no bars to this cage\nIt's like this whole time, I could take flight\nAnd everything I dreamed, it was real life\nIf you could build a dream, it could build you\nNo one can tell you what you can and what you can't do\n\n[Chorus 1 (2x): brandUn DeShay]\n\n[Chorus 2 (2x): brandUn DeShay]\nAnd remember to... just follow your dreams\nKnow that what you see is always more than it seems\nLife is not about finding out what it means\nJust find out what it means to you\n\n[Outro: brandUn DeShay]\nAnd remember to... just follow your dreams\nFollow your dreams", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}