{"artist": "Percee P", "songs": [{"album": "Perseverance", "title": "Ghetto Rhyme Stories", "image": "https://images.genius.com/ce649afd74decf4c7b154d15232f1b93.640x640x1.jpg", "lyrics": "Uh\n\nThis a message going out to all you thugs and gangstas\n\nBlack males who pack jails\nYou 'ain't gotta go out over crack sales and murder\nJust act well\n\nPeep the message\n\nIt's gory\nA story about my man from around the way\nWho's not around today\n'cus I didn't know if you'd hung out with me\nHe'd forget me if he got strung out\nOn the hoe that goes to record parties\nEvery week the type of freak that sneak and sleep with everybody\n\nWe used to hang and hope we'd see chicks\nAround this town with that OPP shit\nWe met two at the club\nThe same night we heat em, we did em because we kick our game right\nThe girl he met? had a lot of shit\nShe gave him a lot of cash and a lot of ass but got him whipped\n\nDriving around in a BM and for weeks I didn't see him\nThen people would come round sayin'\n\"that chick your boy's fuckin' with? that bitch 'a get you gunned down\"\nAnd tell me her man sells crack\nA known drug dealer, a thug killa' who just got out of jail, black!\nI tried to tell him but he didn't listen\nI was burnt up.. until he turned up missin'\nI stayed up till they found his weight up\nBrotha' struck in by a mother-fuckin' Uzi, all laid up\n\nThrown in a ditch\n\nYeah\n\n(CHORUS)\nOver a B.I.T.C.H\n\n\nHey yo, you know whats the funny shit?\nWhat son?\nNow honey dip is back on money's tip\nThat chick 'ain't shit yo\nMy nigga died from the trigger\nI had it figured from the get go\nNow somebody gots' ta' go\nThat chick or the cat that matched the hole\nI'm 'a get me an infrared scope\nLeavin' him for dead with a bullet in the head\nFor killin' my man over a female\nOn the DL, it's gonna be hell\nHe won't see jail but see shells falling from my Glock 9, I got mines\nTuck and won't give a fuck, I'll buck anyone who drops dime\nBrains will get blown out, Pop!\n'cus it feels me that's the way he'll be goin' out\nI'm 'a ride until I commit this homicide, then I'm 'a hide\nI got the 9 on my hip, gripped, ready to flip on this pussy whipped dick\nWho tripped over this B.I.T.C.H\n\n(CHORUS)\n\nDrivin' around with my window down when I spotted him\n'shotted him, makin' him go down\nGotta get to the bus port, I'm wanted son\nOn the run with a body on the gun that I just bought\n\nCaught in arrival by 5-O when I got here\nNow I rot here behind bars kickin' this true shit\nSounds crazy but maybe fit the chick that you with\nSo look out for them honeys that nicely built\nWanting to get laid like a pro might get you killed sonny\n\nWord\n\nNot the ladies\n\n(CHORUS)", "year": "2017-09-18"}]}