{"artist": "C-Rayz Walz", "songs": [{"title": "I Love New York", "album": "Who the F%@k Are You?", "year": null, "image": "https://images.genius.com/cbf6adcac105ff732aafdacf50af8e88.600x600x1.jpg", "lyrics": "[Chorus] [C-Rayz Walz]:\nI'm talkin' 'bout the city\nShe got rotten milk in her titty\nBut her nipples look good and if I really could\nI would bag me the State of Liberty\n\n[Verse One] [C-Rayz Walz]:\nFright night like Dwight Gooden I'm dope\nShop a Strawberry, raw ready, pinstripe folks\nWith Bernhard Goetz kids, you lovin' that left hit\nWe're not underground, we the crack in the crevice\nSubway performers, donations accepted\nProbation detected\nSlow patient infected\n80's crazy, Larry Davis baby\nLive from the meadow lands, harpoons Haiti\nSlugs blastin'\nMad drug trafficin'\nSpanish mami's with the booties of Africans\nTrue pinstriper, trap hanger for lifer\nClap bangers we hyper\nRap halos and ciphers\nThe iron horse galaxy, we stay ridin'\nNo gold, the streets is paved in trident\nBubble goose your orbit, can't go pop here\nRest in peace Coney Island, life is not fair\nA small world of hip hop the scene is huge\nWe got power from the streetlight, then blew the fuse\nWhere the worm is\nYou never forget once you've been\nNew York in the house, how much is the rent?\n\n[Verse Two] [Karniege]:\nKarniege is chillin'\nMos def I'm New York like Frank Sinatra\nSoul in the hole, control hip hopera\nIt started here, then became popular\nAll over the world, New York is poppin' up\nHome of the rotten apple, cops will cap you\nNot like a fitted; pistol or body bag you\nFast slang talkers? That's New York shit\nRobbed in the mornin'? That's a New York vic\nSong bang awesome? That's a New York hit\nMommy body gorgeous? That's New York chicks\nRide the iron horse, visit our boroughs\nWe still dispute about who the most thorough\nTourists take pics, amaze how we livin'\n9/11 scenery, we won't forget it\nSkyline, parkways, tunnels, bridges\nKeeps us grindin', New York get busy\n\n[Verse Three] [Vast Aire]:\nI'm lookin' at cats like, \"Who do you think you are?\"\nI'm a New York star\nMighty Jo, watch the flow\nYou be a nation of gods, it's possible\nB.K.N.Y., to uptown niggas\nTo the downtown thugs with the ill figures\nShawty in the park with the ill figure\n(Yo Vast that's my niece)\nGo figure\nI'm about to smash\nThen I gotta hustle and stand on the corner and count my cash\nIt's a New York thing\nA New York swing\nI was born in Mt. Vernon, a New York king\nI started, rhymin' in Queens\nI spit a light beam to wreck the scene\nWe them New York kids that don't grin\nCause every year we want the Knicks to win\n\n[Verse Four] [Access Immortal]:\nI love the Yanks, I ain't never been a New York Mets fan\nLivin' in Gotham City but the world ain't Batman\nSeem like everybody reppin' here got rap plans\n? master fitted or headband\n? when I was hustlin' my life story\nI grew up on the block, seekin' the mic glory\nSittin' in class, folks barely did a thing for me\nCouldn't stop the fact I'm always leakin' from my brain stormin'\nNew York days are more than New York nights\nTourists always fascinated off of Time Square lights\nI know hustlers in Brooklyn that'll cook up white\nDrink the bottles, gettin' blunted in the project flights\nOn the real, most ghettos that I know is a coffin\nAnd murders, many happen in my city too often\nThis ain't a place an enemy would want to get lost man\nThe Hudson is a river that you'll likely get tossed in\n\n[Chorus] [C-Rayz Walz]:\nWe're talkin' 'bout the city\nShe got rotten milk in her titty\nBut her nipples look good and if I really could\nI would bag me the State of Liberty\nWe're talkin' 'bout the city\nShe got rotten milk in her titty\nBut her nipples look good and if I really could\nI would bag me the State of Liberty\n\n[Verse Five] [Poison Pen]:\nNew York denizen\nNew York tenement\nNew York citizen\nNew York militant\nNew York sentences\nNew York fitted man\nNew York nemesis\nNew York sentences\nAlbee Square Mall is gone\nMoment of silence\nKenmore Theater of violence\nGet popped on while you get your popcorn\nOn the ave, my favorite number spot gone\n? Hospital, metropolitan and church\nThe new New York don't work\nI'mma form my team, you call us a gang\nRun us through the system again and again\nCaught the BX, criminal court bitch\nTrade Gameboys at Coliseum\nSee if these fronts fit\nGame room ?\nPass my pool stick\nCall my chick Apollo, she walk with a two fifth\n\n[Chorus] [C-Rayz Walz]:\nDon't talk 'bout the city\nShe got rotten milk in her titty\nBut her nipples look good and if I really could\nI would bag me the State of Liberty\nDon't talk 'bout the city\nShe got rotten milk in her titty\nBut her nipples look good and if I really could\nI would bag me the State of Liberty"}]}