{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/af1095236547a91c6b3ec8b13586c198.190x190x1.jpg", "title": "Reagan", "year": "2012-05-15", "album": "R.A.P. Music", "lyrics": "[Sample: Ronald Reagan]\nOur government has a firm policy not to capitulate to terrorist demands. That no-concessions policy remains in force, in spite of the wildly speculative and false stories about arms for hostages and alleged ransom payments, we did not, repeat, did not trade weapons or anything else for hostages, nor will we\n\n[Verse 1]\nThe ballot or the bullet, some freedom or some bullshit\nWill we ever do it big, or just keep settlin' for li'l shit?\nWe brag on having bread, but none of us are bakers\nWe all talk having greens, but none of us own acres\nIf none of us own acres, and none of us grow wheat\nThen who will feed our people when our people need to eat\nSo it seems our people starve from lack of understanding\nCause all we seem to give them is some ballin' and some dancin'\nAnd some talkin' about our car and imaginary mansions\nWe should be indicted for bullshit we inciting\nHandin' children death and pretendin' it's excitin'\nWe are advertisements for agony and pain\nWe exploit the youth; we tell them to join a gang\nWe tell them dope stories, introduce them to the game\nJust like Oliver North introduced us to cocaine\nIn the 80's when the bricks came on military planes\n\n[Sample: Ronald Reagan]\nA few months ago I told the American people I did not trade arms for hostages. My heart and my best intentions still tell me that's true, but the facts and the evidence tell me it is not\n\n[Verse 2]\nThe end of the Reagan Era, I'm like 'leven, twelve, or\nOld enough to understand that shit'd changed forever\nThey declared the war on drugs, like a war on terror\nBut what it really did was let the police terrorize whoever\nBut mostly black boys, but they would call us \"niggers\"\nAnd lay us on our belly, while they fingers on they triggers\nThey boots was on our head, they dogs was on our crotches\nAnd they would beat us up if we had diamonds on our watches\nAnd they would take our drugs and moneys, as they pick our pockets\nI guess that that's the privilege of policin' for some profits\nBut thanks to Reaganomics, prison turned to profits\n'Cause free labor's the cornerstone of US economics\n'Cause slavery was abolished, unless you are in prison\nYou think I am bullshittin', then read the 13th Amendment\nInvoluntary servitude and slavery it prohibits\nThat's why they givin' drug offenders time in double digits\nRonald Reagan was a actor, not at all a factor\nJust an employee of the country's real masters\nJust like the Bushes, Clinton, and Obama\nJust another talking head telling lies on teleprompters\nIf you don't believe the theory, then argue with this logic\nWhy did Reagan and Obama both go after Qaddafi?\nWe invaded sovereign soil, going after oil\nTaking countries is a hobby paid for by the oil lobby\nSame as in Iraq and Afghanistan\nAnd Ahmadinejad say they coming for Iran\nThey only love the rich, and how they loathe the poor\nIf I say any more they might be at my door\n(Shh..) Who the fuck is that staring in my window\nDoing that surveillance on Mr. Michael Render\nI'm dropping off the grid before they pump the lead\nI leave you with four words: I'm glad Reagan dead\n\n[Outro]\nRonald Wilson Reagan\nRonald Wilson Reagan\nRonald (6) Wilson (6) Reagan (6)\nRonald (6) Wilson (6) Reagan (666)"}]}