{"songs": [{"image": "https://images.genius.com/ff321b7b11c499b6ffbd311c2022b0d4.1000x1000x1.jpg", "title": "Little Sister", "album": "The Art Of Chill", "year": "2014-05-23", "lyrics": "[Intro]\nYeah, Uh-huh\nYeah, Uh-huh\nAyo this for Leia, Samantha, [?]\nAll my siblings man, I love y’all\n\n[Verse 1: Nitty Scott, MC]\nUh\nWhat up young girl, I know it's been a minute\nSince you've got the chance to see yourself in other women\nEverything is driven by your given image\nThe illusion is confusing and your head is spinning (Uh)\nBut listen this ain't feminism\nI just want to talk to you, I ain't competition\nDon't want to take your man\nDon't want to flash the glam\nAin't here to tell you that I'm better, let your mind expand\nYou see I come in peace for my niece\nAnd all my little sisters trying to make it in the streets (Yeah)\nYou ain't limited to posing on a car\nSo open up and show them all the Venus that you are\nCause in your eyes lies a beautiful surprise\nRealize it and keep reaching for the skies\nIf God is willing and the creek don't rise\nOne day it won't be about the heat between our thighs\nBut in the mean time just hit a sweet rhyme\nAnd empower you power in these unique times\nThought it was a fairytale dream\nBut baby girl you are real life queen\nA real life queen\n\n[Chorus: Sam B]\nWho are we?\nFamily\nIf you need me\nKnow you got me\nAll your life (Forever)\nJust want to see you shine  (Forever)\nLike you’re a star\nCause you’re a star\nAnd you deserve everything\nAnd you deserve everything\nYeah Yeah\n\n\n[Verse 2: Rapper Big Pooh]\nYo, I wrote this for Keke, ‘Drea, Bailey\nEven though your uncle make moves like Alvin Ailey\nHitting in out of state, adding acres to estates\nI do what I do to ease the burden on your plates\nYou're my queens, supreme human beings\nNever let a man tell you that you need him\nCause you have a father if you need something\nAnd then you have an uncle if you want something\nI want to raise you up like royalty\nThe less fortunate will call you spoiled. See, (that’s what they do)\nI know how this game go (how it go)\nI just want to provide you different angles\nLittle angels, wishing that you could stay this way forever\nBut forever's never long enough\nNo, forever don't belong to us\nI know you want to grow up, but there's no need to rush (slow down)\nI take you to a restaurant, we sitting down\nWe getting in the car, open doors how?\nAny man would ever treat you less then\nWhen you've been shown love by your own kin\n\n[Chorus]\n\n[Verse 3: Nitty Scott, MC]\nUh, uh\nAnd it’s okay, it’s okay\nI know you gotta find your own way, your own way\nBut baby girl, why they focus on your gender?\nIt’s cool like December, find your center and remember\nTo love your body, it was yours from the start\nSuch a perfect vessel, view it as a work of art\nUh-huh, don’t mind the faces or the races that you came with\nCause your confidence will be a fashion statement\nNever let a man abuse you or use you\nHe reduce you? Well then he gotta lose you\nKiss your grandmother, and your mother too\nCause its love for you that make ‘em want to smother you\nUh, and make that money for yourself, love\nGet your own, don’t depend on no one else, love\nFurther life cycles when you bloom\nDivine in your design to carry life in your womb\nLittle sister\n\n[Chorus]"}], "artist": "Nitty Scott"}