{"songs": [{"title": "Dogg Market", "image": "https://images.genius.com/ba5e0eb6b2a9751eafc012365bd32cd8.710x716x1.jpg", "lyrics": "[Snoop]\nI'm in a murderous-mental mindstate\nMonopolizin’ on 'em, enterprise with homicide\nRock this dope and cut them corners worldwide\nVisualize two young killas on the rise\nAin't that a bitch? Snoop Dogg and Brotha Lynch\n\n[Lynch]\nAnd we remain bombed out (what), no doubt\nEat niggas up with sauerkraut (what up), haul 'em out\n'Bout to open my own business, Siccmade Meats\nWhere you gonna get your product from, nigga?\nSacramento streets (WHY), gotta be\n‘Cause these niggas be trippin’\nI'm dippin' in and out the city with the Frank Nitti (With with what?)\nWith no pity, dingy, dirty, grimey and gritty, get me\n\n[Snoop]\nI had a bundle of bitches before I had a bundle a dollars\nA fist full a problems while I'm poppin’ my collar (ay, ay, ay)\nSockin’ bustas, frontin’ hustlers with they work on the streets\nFrom the streets, to the suites (To the what?)\nTo the slugs, to the heats (Bang)\nPlease believe, let me holler at you, nephew\nWhat you do and what I do, I'll make you wan' act a fool\n\n[Lynch]\nAlright, wait, wait, wait, hold up\nAbout 8 million lies up in the city\nSmashin’ with the 50 slug, no love\nLeave ya layin’ down lookin’ at the stars above (‘Cause what?)\n‘Cause everything fade to black, like a scene change\nAin't it strange?\nIllegal procedure, you out the game\nLet ya nuts hang in the rain (rain)\nOn them roaches like Raid spray, laid 'em up with the hay\nThey, found the body three months later as I hit him with the potato\nAte up his midsection, recollection, murder on my mind (Ay, what)\nGot me chin-checkin, and they said (He ain’t real)\nHeard it all the time\nThat's what these muthafuckas think about me, they ain't made it\nMad ‘cause niggas be tryna sprout trees\nAnd smoke weed every day, best believe, every day\nAy you, you niggas tryna stop progress, move out my way\nBet you never see me in black clothes\nCreepin’ out the backyard hard-boiled with lead toes\n\n[Snoop]\nI got so much to do with so little time\nMy folks smoke dope that'll blow ya mind\nI bust a bitch about a quarter to nine\nSo by 10:15, I got my dick on her spine\nRelax, recline, roll somethin’, nigga\nHit this shit, blaze it up, now raise it up\nThe grip and the bitch, yeah, stays with us\nNow, a lot of y'all niggas be talkin’ 'bout y'all livin’ it up\nAnd give it up\nBut let me take it back to the essence and shit\nMeditate and drop a message and shit\nYou crumb-snatchin’, no rappin’ peasants\nThe big dog want it all, I came back to snatch all y'all presents\nDippin’, slippin’, slidin’ away\nFrom the Sac-town to the L-B, we do this shit like every day\nDo you feel me? I'm the untouchable\nFuckin with the reputable, unquestionable, remarkable\nFabulous and all that shit\nYou know, I'm the original, biatch, the original, biatch", "year": "2000-06-27", "album": "EBK4"}], "artist": "Brotha Lynch Hung"}