{"artist": "Cam’ron", "songs": [{"title": "Fantastic Four", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "You never hear that we buckle\nBeef? we chuckle\nScuffle over a game of pinochle\nAnything up on my money, man, I gotta see double\nUnless you want trouble\nOh, you realer now?\nI'm the kind to cut a peace of soap, put it on the imbecile\nCrack the hen rock style, give me the foul\nGirls grope then I smile\nThat's when they fall cause they met my balls\nRight after I played ball\nNo wash-up, no nothin'. hear what I say y'all?\nO.k. y'all. ask aj y'all\nI'll turn the baddest bitch gay y'all\nLike stacy, damn, she was eatin' tracy's ass\nAt this other lady's pad\nTo get it on I had to call up desert storm\nMy cut-throats scar y'all, while you hope the don fall\nBut I'll come inside the tunnel, nigga, wit pope john paul\nYo, them niggas on the wall frontin', they ain't no harm y'all\nMy crew'll break each shoulder\nI'm that nigga they talk about on street soldiers\nCause my street soldiers are heat holders and weed rollers\nWe keep two bones and two phones in each rover\nWe all relaxed and any beef we over-reactin\nPeace to lorey actins, but I get buck wild like corey jackson\nPlayin' is called off, cause y'all about to get hauled off\nY'all all soft from smokin nicholi nigga, like volkof\nKnow what I mean yo? notice the cream grow\nI fiend though, I'll come fuck up your whole town like el nino\nI'm the hottest nigga you've seen though\nJumpin outta lex coupe\nWith jimmy jones right next to me in the benz truck too\nFuck all y'all non-believers\nI roll wit god, the squad and ts\nOut wit the b.s\nWe platinum, they even doubted jesus\nNiggas is 85%, I'm 400 solid\nBrainbolic wit knowledge, cock-diesel scholars\nHoldin' it down, walkin' around wit gold by the pound\nFrozen down wit diamond bolders all in the crown\nTalk of the town\nSoakin' you down wit the toast 'til you drown\nGhost you and put your corpse in force that'll open the ground\nSave the jokes for the clowns\nI'm on a serious tip\nYou keep playin' and I get furious quick\nAnd now I take you for a walk in the ghetto\nEven spark your metal and get outlined in chalk by the devil\nI rep the borough that mothered this rap shit\nI used to clap shit\nNow I just lay back and mack on some mack shit\nI used to have to pack a mack in the back of the acura\nNow I relax and stack platinum plaques in my shack\nIt's like that but don't think I won't counter act\nMy niggas is strapped and quick to lay a bitch on his back\nI'm swift with the mack, quicker than kung fu\nWith the reflexes of a cat and the speed of a mongoose\n?Talk about huh? that's what we talk about thug shit\n?Talk about huh? that's what we talk about thug shit\n?Talk about huh? that's what we talk about thug shit\n?Talk about huh? that's what we talk about thug shit\nNow it's a symphony\nWithout me on it, it ain't a symphony\nMy crew shit on cats without tiffany\nN-o-r-e, I just lace the heat\nI don't complain about the track, give me any beat\nI get he'd in the wip on any street\nI fuck wit clue, other cats is snakes\nI've been fuckin' with clue since he made 60 minute tapes\nWe copped mad bottles and crushed many grapes\nWe from the hood and they from the hood\nThe difference is we get plaques, they go double wood\nTook the game right over at the time they could\nThem niggas silly though, knowin' nore lay pretty low\nBut them niggas ishomos like the maxwell video\nI got 2 albums and 2 cars\nNow bitches on my dick cause of chico debarge\nThugged out's 1st lady (let's go half on a lady)\nYa motherfuckers ain't live, don't control the streets\nI sold 163 thousandon my 1st week\nThat means I got more fans than you\nBigger plans than you\nWe buy real coke, your grams is blue\nAi yo, the president is like me, he smoke weed too\nDon't really like to fuck, he just get he'd too\nStick a broom in your butt, tell you, go head boo\nThugged out motherfuckers like the rest of the crew\nCanibus, cam'ron and punisher too\nAnd the beats are usually done by duro and clue\nWho in the hell wanna battle, the I'll mathematical?\nMy motherfuckin' brain is IBM compatible\nTechniques are foreign\nFar from being borin'\nMy style is hard like cancer without mccorman\nI run threw your crew like the flu when I bomb it\nMy styles like aids cause don't nobody want it\nNiggas frontin' like they hard\nBut I'm a street fighter like jean claude\nAnd I'll split your shit, god\nRight down the middle\nPlay you like a riddle\nI got a fetish for titties, I nibble on the nipple\nThen trespass on your property like monopoly\nSubdue your crew and beat that ass properly\nWelcome to the desert storm annual extravaganza\nClue rolls deeper than the cart-rides on bonanza\nI feed off weed, natural energy sources\nLyrics with more power than the horses they put in porches\nCan't be tested or f'ed wit\nI'm too reckless\nI chop off heads just to take the necklace\nThe type of canibus that's side effectless\nThe type of shit that get the question-mark man arrested\nTake evasive action\nFlip like reciprocal fractions\nTurn the heat up on mcs to watch their meat blacken\nYou try get fly, you get electrified and fried\nFuck around and get your mouth slapped dry\nYou could battle me and possibly survive\nBut you could never see me and walk away without a black eye\nWord up hop, clueminat call the cops\nAnd if the cops ain't tryin' to see me, then the cops call swat\nScar your whole squad with bullet scars\nNo holds barred\nI'll even hassle the national guard\nReady or not like the fugees\nCrews be steppin' to me\nBut I wipe em' all out like booty\nI'm so unruly, the police don't say nothin' to me\nIt don't matter whether they on or off duty\nI murder you brutally when I spit at you\nMy actions are unforgivable\nLook at what clueminati did to you\nThe maximum lyrical\nNigga you minimal\nThere's a big hole in the desert, I told the men in blue to dig for you?\nMotherfucker clueminati 98'"}]}