{"artist": "Problem", "songs": [{"album": null, "title": "On the Way", "image": "https://images.genius.com/c4005e254f231b7ae838ab00e001de5f.421x421x1.jpg", "lyrics": "[Intro]\nIt's on the way\nBaby it's on the way\n(D-d-d-diamond Lane)\nIt's on the way\nBaby it's on the way\n\n[Verse 1]\nProblem!\nReal nigga back\nUgh, say it one more time\nReal nigga back\nLet the mark be me picture that\nY'all know it ain't going down\nY'all know it ain't going down\nL game best show in town\nJäg shots going 'round\nTurn't in this bitch\nHeat close bet a nigga get burn't in this bitch\nIf he go somebody book a hurt for his clique too\nLunatic, rich, big dick, and I lick too (Big who?)\nMoney on my mind like the rich do\nSix shoot, coughing that shit get a whiff boo, ohh\nI got that stank\n[?] smell shout-out to young stank\nYea, that's my little brother\nGrind from the gutter\nFuck what Wayne does I don't st-st-st-stutter\n\n[Hook]\nYou lookin' for some molly\nMy nigga on his way\nYou lookin' for some bitches\nMy nigga they on the way\nYou lookin' for  my new shit?\nMy boy it's on it's way\nAny nigga wanna trip on God\nIt's on its way\nBe patient bro!\n\n[Verse 2]\nDiamond laners about winnin' we ain't got no options\nIf it's war then I'm vomit I ain't with the talkin'\nDo my stuff, hit the gas, all you see's exhaustion\nFour pipes, brake lights, 'til the shot is off em (Bars)\nMaybe I'm just different from these other niggas\nIf I ain't met your momma I ain't fuckin' with ya\nHit bitches with this dick and they be going crazy\nI inspired these niggas now they want to hate me\nI'm speaking what I know not just what I heard\nIf it wasn't true it wouldn't have struck a nerve\nWhatever that was said they heard my niggas callin'\nThey like \"Why you didn't respond?\" Cause I'm too busy ballin!\nLike I just moved in the stable\nDon't need a jersey on still break a nigga's ankles\nFuck a nigga's bitch have her panties by her ankles\n(Yeah) P Lo you the nigga for this beat\n\n[Verse 3]\nI dick pretty bitches\nAnd that's pretty much how it goes\nI don't give a fuck about your race\nI'm much more concerned on how good you taste\nI'm nasty, ahead of my time brother the future couldn't pass me\nThuggy as fuck but the bitches love my ass, We\nGot the Pan-America made the movie on the avi\nBut that was 2010, let me begin\nOn God I'm going crazy, taking shots like Navy\nTryna play me I put a baby in your baby boo\nA lot of these niggas gon' hate me, coo'\nThat's fine, it makes no sense so don't pay me no mind\nI'm just doing my thing Diamond Lane is the gang forever\nOut in the Bay HBK we gon' reign forever\nBeing friends don't make ends so I aim wherever\nShots on to the clock dies (Diamond)\n\n[Hook]\nYou lookin' for some molly\nMy nigga on his way\nYou lookin' for some bitches\nMy nigga they on the way\nYou lookin' for  my new shit?\nMy boy it's on it's way\nAny nigga wanna trip on God\nIt's on its way\nBe patient bro!", "year": null}]}