{"songs": [{"title": "Guilty Finisher", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "Yeah, brandUn DeShay\nBeatbox station, let’s go\n\n[Verse 1: brandUn DeShay]\nThis here could be destiny\nI’m in a footprints left of me\nAm I feeling you right now? Definitely\nHollering “A Bay Bay” like the Chesapeake\nI try to not to let the speakers speak\n‘Cause my actions so loud\nI know these other guys act foul\nBut try not to trip ‘cause when I put in the script how they gonna act now\nWow, feel bad dropping this line\nNervous, you got me going out of my mind\nTelling you about the guys that have waste your time\nIf you wanna go [?] like Optimus Prime\nWell, I’ll be your beast if you want to be my beauty\nI know I’m far from the saint-like [?]\nBut I just want to be your man\nI’ll kiss you on the brain in the shadow of the train\nOver the light of the full blue moon\nAnytime you leave, it’s too soon\nI can’t think of nothing better that me and you together\nOh, you too?\n\n[Hook: Yah Sed]\nRound and round and round we go\nIt’s hard to tell us, carousel is\nSpinning high, fast and slow\nWhen no one’s waiting while it’s spinning round\n\n[Verse 2: Aris P!]\nCan’t wait the moment of words will only take a second\nI know I’m sad, least still blessed by your presence\nJust by your essence, you put me in a trance\nBe glad when God bless me to put me in your plans\nMan, your voice is my favorite song when I hear it\nIn fact, the [?] in my tongue is a lyric\nI’m obsessed with the spirit, trying to see the blame\nWhy you don’t know this? Even science can’t explain\nHow I feel, I would love to carry you away\nToo afraid to talk, for the fear of scaring you away\nSo, I think about, “what should I say now?”\n[?] situation just to play out\nI keep telling myself, “some other time”\nBut hate seeing you walk away with some other guy\nSo, if I want to begin to finalize, then\nI got to make a move to stop this fantasizing\n\n[Hook: Yah Sed]\nRound and round and round we go\nIt’s hard to tell us, carousel is\nSpinning high, fast and slow\nWhen no one’s waiting while it’s spinning round", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}