{"songs": [{"image": "https://images.genius.com/29945bf84176151836dcda7f99aa32bb.600x576x1.jpg", "year": null, "lyrics": "Nigga youse a..\n\n[AMG]\nUh uhh!  Yeah, uhh\nUh, uhh, uhh\nOne time for you mind\nUh, uhh, uhh\nYouse a.. sucka..\nYeah, yes\n\nI once met a nigga who was cool and shit\nSo what?  So I let him hang with my click\nSaid he pimped hoes, and he knew how to make ends\nSaid he even had a Benz\nAnd a house in Atlanta, G-A, and in L.A\nAnd he fucked different hoes every day-ah\nI said, \"Nigga since we all in the same game\nMight as well let our motherfuckin nuts hang\"\nBut shit got funny when it came down to makin money\nFound out he was a dummy\nAnd the pussy made him sway\nAnd it wasn't no different hoe each and every day\nBut trip, that ain't it, he went out like a bitch\nSayin my shit was his shit (nah)\nNow he's on the way to player's court\nGettin charged for fakin the funk\nYou little punk, youse a sucka\n\n[Chorus]\nNigga, youse a sucka for love\nNigga youse a sucka for love (nigga youse a sucka)\nNigga, youse a sucka for love\nNigga youse a sucka for love (punk youse a sucka)\nNigga, youse a sucka for love\nNigga youse a sucka for love (check this out)\nNigga, youse a sucka for love\nNigga youse a sucka for love..\n\n[AMG]\nI got a homey who calls me a captain\nCause I get a lot of hoes from the rappin\nBut I ain't no trick, I'm into hoe hoppin\nBut guess who I see in the mall shoppin?\nDiggin way down deep in them Kani sweats\nSpendin dough on a hoe that he ain't bumped yet\nAnd he don't wanna see me, but I make it known\nCause the hoe that he with I already boned\nAnd the bitch actin like she don't know a brother\nAnd this nigga holdin on to her like he love her\nI looked him dead in the face and said, \"Whassup Trace?\n(Nigga) Ask you girl how my dick taste\"\nAnd he wanted to fight, talkin bout I ain't right\n(Nigga please) Nigga flyin like a kite\nNow he got two babies by her and he still\nCallin me a liar, she's his wife and he's a sucka for life\n\n[Chorus]\nNigga, youse a sucka for love\nNigga youse a sucka for love (nigga youse a sucka for life)\nNigga, youse a sucka for love\nNigga youse a sucka for love (sucka youse a sucka for life)\nNigga, youse a sucka for love (for life)\nNigga youse a sucka for love .. (for life)\nNigga, youse a sucka for love (and y'all hoes out there..)\nNigga youse a sucka for love..\n\n[AMG]\nNow in ninety-fo', hoes gettin lucky\nLike a four leaf clover, but I'm still a Rover (woof)\nAnd it's kinda strange, when you see 'em rollin in the Range\nWith a coach bag full of cash\nWearin Donna Karan but I ain't sharin my money witcha freak\nYou can call me cheap\nOr you can call me crazy, whatcha gonna do\nWhen your ass get fat and lazy, house full of babies\nAnd don't blame it on your baby's daddy (uh uhh)\nCause you let him buy ya, then you let him try ya\nAnd when he left you was broker than a joke (uh uhh)\nLookin for another, so you can pucker\nUp your lips, and kiss him on the thang thang\nWhip it on him real good, and it's the same game\nSo who you tryin to fool and clown\nI'ma hound from my head to the ground\nBeitch, so bitch get a sucka\n\n[Chorus]\nNigga, youse a sucka for love\nNigga youse a sucka for love (you better get a sucka)\nNigga, youse a sucka for love (hoe)\nNigga youse a sucka for love (bitch get a sucka)\nBitch, youse a sucka for love\nBitch youse a sucka for love (uhh)\nNigga, youse a sucka for love\nBitch youse a sucka for love..\n\n[AMG]\nAoww, niggas out there, playin trick or treat\nAnd hoes out there\nTryin to rob a nigga for his ends\nEat a dick up..\nYeah, cause nigga youse a sucka for love\nIf you're fallin for that\nYeah..\nYeah, welcome to the A.M. y'all\nUhh..\nAnd no can do hoe\nBitch, get a sucka for love", "title": "Sucka For Luv", "album": "Ballin’ Outta Control"}], "artist": "AMG"}