{"songs": [{"year": "1999-07-20", "image": "https://images.genius.com/2561cbbf1a3c2518ad6a82dc5d614235.197x197x1.jpg", "title": "Who Is a Thug", "album": "Whiteboys (Original Motion Picture Soundtrack)", "lyrics": "[Big Punisher]\nYeah.. 6430.. Ty Fyffe where you at?\nAww shit.. smooth it out\nWhere my chick tonight? Thug style\nKnock em out Pun!\n\nI pull your motherfuckin plug like a thug's supposed ta\nHold a loaded toast, who want the pistol smoke\nCause I'll initial on my shoulder holster\nYou know the culture when it's East coast, we run the streets most\nWho want beef? Turn your peeps into meatloaf\nYou know the steez, when it's murder in third degrees\nWe reserve the breeze, and move with the wind like birds and bees\nWord to G's, Christ I'm nice, g'head roll the dice\nYou know the price, your kid and your crib, like I'm +Poltergeist+\nI'm cold as ice, control your life with the mic\nAnd then take your crown, break you down like liquid nitrogen\nInvite your men, I strike your chin while you rappin\nIf you're on some thug shit, fill my clip and start clappin\nMake your heart flatten, stop actin retarded\nAll you flea hearted villains, build your rhythm over restart it\nThe streets are God and heavenly, where the vinyls doubles\nForty-fives and shovels ready in the five livest boroughs\n\n[6430] Who is a thug? Are you for sure?\n[Pun] Big Pun baby, I'm a thug for life\nI'm a thug for life, I'm a thug for life\n[6430] Who is a thug? Are you for sure?\n[Pun] Aiyyo my word is bond, long as I'm alive I'mma put it on\nCoulda gone legit shit, thug nigga til I'm gone\n\n[Big Punisher]\nYo, I'm a thug to the heart, bugged from the start ever since a child\nI've been livin wild, chillin with illest crowds\nSplittin thous' on my connect in the street\nTwenty-percent protection, expected at the end of the week\nNever we sleep, a thug doesn't rest\nCause a wise man said, it was a cousin of death\nIf it wasn't the stress, it was one to your chest\nThere's many ways to die, in the slums when you stressed\nBut not me, Big P, cause I'm the son of the devil\nRun up in your cribbo and suffocate your son with a pillow\nYou know I'm comin to kill you when you hear the heavy breathin\nGive you a wedgie deep in your deep end with a butcher machete greetin\nThinkin of Madison Square, I'll battle you there\nCarry you clear 'cross the planet just to challenge you here\nEmbarass you where it hurts, and sandwich you in a hearse\nGod sent you with a curse, that's why your parachute didn't work\nDead in the dirt (yup) with the bugs and the mice\nThat's the price, frontin like a thug for life\n\n[6430] Who is a thug? Are you for sure?\n[Pun] Big Pun baby, I'm a thug for life\nI'm a thug for life, I'm a thug for life\n[6430] Who is a thug? Are you for sure?\n[Pun] Aiyyo my word is bond, long as I'm alive I'mma put it on\nCoulda gone legit shit, thug nigga til I'm gone\n\n[Big Punisher]\nCuban Link -- you a thug like me\nMy nigga Funk Flex -- you a thug like me\nMy man Sunkiss -- you a thug like me\nCrazy Roland -- you a thug like me\nMy niggas RMS -- y'all thugs like me\nMy girl Big Lils -- you a thug like me\n\nYo, me and my man are plannin to handle these two broads\nThought he was Rambo a vandal his brand a Lambor' Countache\nWith ammo that scrambled his brains and luxury ducats\nHarder with somethin hard to sharpen\nIn the driver's box of the glove compartment\nRotten lowdown dirty sheisty kind of conniver\nEx nine-to-fiver, ready to die as long as I'm the driver\nSupplyin buyers of flyers in bundles stacked dope\nHumble prices on ices twice as nice as crumbled crack coke\nI hope it lasts long, word bond, I bring my brothers with me\nDefinitely, and start off my own thug committee\n\n[6430] Who is a thug? Are you for sure?\n[Pun] Big Pun baby, I'm a thug for life\nI'm a thug for life, I'm a thug for life\n[6430] Who is a thug? Are you for sure?\n[Pun] Aiyyo my word is bond, long as I'm alive I'mma put it on\nCoulda gone legit shit, thug nigga til I'm gone\n\n[6430] Who is a thug? Are you for sure?\n[Pun] Big Pun baby, I'm a thug for life\nI'm a thug for life, I'm a thug for life\n[6430] Who is a thug? Are you for sure?\n[Pun] Aiyyo my word is bond, long as I'm alive I'mma put it on\nCoulda gone legit shit, thug nigga til I'm gone\n\n[6430] Who is a thug? Are you for sure?\n[Pun] Big Pun baby.. Big Pun baby..\n[6430] Who is a thug? Are you for sure?\n[Pun] Aiyyo my word is bond, long as I'm alive I'mma put it on\nCoulda gone legit shit, thug nigga til I'm gone\n\n[6430] Who is a thug? Are you for sure?\n[Pun] ..\nBig Pun baby..\n[6430] Who is a thug? Are you for sure?"}], "artist": "Big Pun"}