{"songs": [{"year": null, "album": "Firestarter Vol. 1: Quest For Fire", "image": "https://images.genius.com/f6f885c3d00c65449de2c329c1e1c250.453x453x1.jpg", "title": "Ol’ Time Killin’", "lyrics": "INTRO (Korry Deez)\nE'rebody ah talk 'bout sound killing\nWhen they dun know, we are original sound killer\nFassyhole you know we\nAnytime we start dance-dance a fi lock\nGirl follow back a we\nYuh know seh we have we ting pon cock\nCan't chant to me\nWe start dance from 19-how-long\nTink a only 45 we collect?\nA dub plate we have!\nAnytime we drop Kardinal, IRS and Wio\nA bloodclaat big tune dat\n\n(Kardinal Offishall)\nYes\nOh me oh me oh my (why)\nThem a try run Mr. Kardi-ni, flavours you can't deny (why)\nCause them Circle cats rap so fly\nThem tracks stay do or die and (why) ask (why)\nWhen dem man dem murder song before a dance\nCan't turn around and jump and begging for a bligh (why)\nLick off a style, me-a-fi put dem all back\nRap from T-dot to the Bronx and Brixton and come back\n(Will you wake me up?)\n\n(Wio-K)\nIf an emcee step outta line,I feel them affi get cut up\nBut up, lick up, fist up, sound get brek up\nBeat up and kick up until they boy start hiccup\n(Girlfriend what's your name?)\nHow ya look, so sweet with your horse legs acting like you're strange\nIt's full time, now you come off on dat range\nMy name's Wio, bareback rhyming in the plains\n\n(Allistair)\nBlessin' this, effortless, mess with this, eff with this\nIf you think you got a chance to dance with your devilish messages\nStressing this can only lead to battery\nYou rattle me, request to battle me I take as flattery\nI see ya, grip your bible,I'm the lyrically homicidal idol\nWho's liable to take your title with a single recital, it's vital\nYou respect the steez, I get vexed with ease\nDon't make me ask you to respect me please\n\nCHORUS (Jully Black & BlackKat?)\nIt's an old time, ol' time killing\nWe a deal with, run and get your money clip\nFor another day in another way\nDe man dem, nuh take the rae rae\nWe are a murderahs\n\"The MC...\" -- KRS-One\nKillas...murder\n\"Murder she wrote\" -- Chaka Demur & Pliers\n\"Murderers\" -- Barringon Levy\n\"When time it come to my sound which is de champion sound\" -- Major Mackrel\n\n(BlackKat)\nYo, 1-8-7\nCold blood I meant to do it ruthless\nKnew it was murder since Da Grassroots produced it\nNow we got some ax-murderers upon the track\nBurning murder onto wax\nSo you can witness the attack, it's Black... Kat\nThe nigga who writes to burn flavour\nSo hype the Source should give us 5 mics and 2 turntables\nWe spitting this with beats so ridiculous\nAnd rhyme style limitless, let's see if they can get with this\n\n[Kardinal Offishall]\nWio - you're crazy, your tough talk don't amaze me\nImaginary gats busting just don't faze me\nLick a shot, wave your flag, gunfinga in the air\nHeadstone on your 12\" says Mr. Kardinal and the Monolith was there\nFrom '94 to now, the beats run wild in the East\nLeaving nuff man decease, I got two middle fingers that's made for 5-0\nBabylon fi get dust and let my people dem go\n\n[Chorus]\n\n(Kardinal Offishall)\nCall me a sound (killa), gut (filla), rhyme (spilla)\nDon't date vanilla, hip hop guerilla\nMind (chilla), don't drink Miller Lite\nNight thrilla, spite might fill ya\nBite and you invite with a recite to kill ya\n\n(Wio -K)\nThe tox licker, shot licker\nGirls flock quicker, since my crop got bigger\nGet yanked like a Glock trigger, just to make the plot thicker\nGirls got thicker, I'm run up in the spot quicker\n(Don't let them watch me so)\nI'm the nigga your son really wants to chill with and know\nYou must think it's me that make that nigga act so\nVexed cause your church friends gossip on the low\n(Wio - let me say)\nNow for the people who don't know what's gwaning\nThey sleeping on the whole city, stretching in your heart\nNot knowing that T-dot's about to shake your ass out your dreams\nSo (wake up) before you end up in a pine box\nSeen\n\n[Chorus]\n\n\"When time it come to my sound which is de champion sound\" -- Major Mackrel\nYou better run go and get your money clip\n\n(Jully Black)\nRun go get your money clip\nRun go get your money clip\nThe emcee killa, killa killa"}], "artist": "Kardinal Offishall"}