{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "[Verse 1]\nStarted in the Bay then it spread to LA\nThen it bounced out all way to the A\nNYC the PHILA, I'm a cannon with a cannon bitch like L way\nBitch I'm the ball, I ball like MJ\nI'm a D-Boy paperbag full of (gizzay?)\nIn a league of my own step your gizzame\nY'all can't fuck with me such as shenzei\nMy flow is nice cold as ice Rick James\nPoltergeist ghost at night switch lanes\nMy dough is right frozen ice, sick name\nI am the shrink my watch is insane\nI'm a pimp so a ho is my 9 to 5\nThat means your bitch is mine if I decide\nGet on top of the boy get the highest high\nBut you gotta be this tall to ride the ride, what's good!\n\n[Hook]\nEverywhere I go the same old shit\nThey already know that I'm no bitch\nOnly thing I own is this four fifth\nTen in the clip I let 'em go quick\nEast side they know what it is ay\nWest side they know what it is ay\nNorth side they know what it is ay\nSouth side they know what it is ay\n\n[4x repeat]\n(Takin' Ova) One city at a time, one city at a time, this city is mine\n\n[Verse 2]\nFloss, that's what I does, I cop whip after whip I'm such a thug nigga\nToss, that's what I does, I fuck bitch after bitch they all in love\nThis is my house shoes off at the door map\nI like you I like sex I'm bored and\nI even whip, I like neck I'm for that\nNiggas hate all damn day I ignore that\nMad cause the ho see me and take Codex\nMad cause I find the dough I'm like Jowjack\nBoy got towels and hoes I'm like Bo Jack\nCall my mouth Walt Disney I froze that\nFreeeeze! Rich Boy on on D's\nOne let her over bitch I'm on E'S\nNo I'm never sober bitch I smoke trees\nSo I'm high all the time, Get like me!\n\n[Hook]\nEverywhere I go the same old shit\nThey already know that I'm no bitch\nOnly thing I own is this four fifth\nTen in the clip I let 'em go quick\nEast side they know what it is ay\nWest side they know what it is ay\nNorth side they know what it is ay\nSouth side they know what it is ay\n\n[verse 3]\nI'm back better ease back\nAll the rap niggas fake pull the sheets back\nNiggas talkin' bout guns never seen that\nNiggas talkin' bout drugs where your CREAM at?\nWhere your team at?\nI don't give fuck I run these streets\nI am the west coast who want it with me?\nThe blades, the knives, the guns is with me\nThe block, the hood, the slums is with me\nDolce&Gabbana, her not me\nShades on my face, Versace\nGangstas, Hustlers, just like me\nWankstas, Bustas, don't stop me\nYou are what you eat, pussy not me!\nRapper you soft, and good she not me\nAin't tryna be you, I'm tryna be me\nHeard the \"Touch it\" remix now I'm tryna be free\n\n[Hook]\nEverywhere I go the same old shit\nThey already know that I'm no bitch\nOnly thing I own is this four fifth\nTen in the clip I let 'em go quick\nEast side they know what it is ay\nWest side they know what it is ay\nNorth side they know what it is ay\nSouth side they know what it is ay\n\n[4x repeat]\n(Takin' Ova) One city at a time, one city at a time, this city is mine\n\n[Verse 4]\nIt's Ya Boy lil daddy, ask around\nIf you want beef, my mask is down\nHip Hop, I'm tryna hold the crown\nAll the young niggas know I hold it down\nFor every borough block war that's on in town\nPrecise Gang my niggas hold the pounds\nI gave rap breath y'all owe me now\nSittin way at the top feelin' lonely now\nArggh! I am the freak, I love brain and she loves me\nI have aim, I shoot for three\nI complain if she use teeth\nBitch I came you must repeat\nLock on (babe?) and don't release\nWhile I'm drivin' the range this girl's a freak\nAlmost crashed the range I'm bout to skee\nNow turn around ma and just might do ya\nThings' so long might go right through ya\nCall me Ya Boy and call him Junior\nWe bring joy Halleluja\nShe wants to ride call me scooter\nBut I want more brains okay miss Tuda\nThey want war then I cop the Uza\nAnd put a whole through you losers, ya dig", "title": "We Takin Ova"}]}