{"artist": "Papoose", "songs": [{"album": null, "title": "Chess", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Intro - Samuel L. Jackson in \"Fresh\"]\nNow what kinda player am I? Am I an offensive man or a defensive man? That's right, I'm neither. I play my opponent\nIf he likes to attack, I force him to defend himself. If he's a cautious man, I draw him into dangerous waters. See, you get so frustrated playing defensive positions. You make stupid moves you would never make if you were thinking. When you come here boy, check that shit at the door\n\n[Bridge]\nI'm at the top of my game, cut the check\nSomebody better king me, I'm the best\nLet's play a game of checkers, better yet\nThe game don't love nobody, let's play chess\n\n[Hook]\nI keep forgettin' we're not in love anymore\nI keep forgettin' things will never be the same again\nI keep forgettin' how you made that so clear\nI keep forgettin' things will never be the same again\n\n[Verse 1]\nI got street knowlege, that's why I outsmart em all\nGotta play chess in the streets, it's the art of war\nRapper get robbed, they took the jewels off your neck\nYou call the person who you payin' to protect\nHe got all your jewelery back, more or less\nBut now you owe him even more, you in debt\nGuess who got you robbed\nWhy don't you take a wild guess\nThe person you pay to protect you, he playin' chess\nOil price high, buildings fall, government stressed\nThey need somebody to blame for all this mess\nCapture Sadam but ain't captured Bin Laden yet\nThat's cause he doesn't exist, they playin' chess\nA DJ, he helps artists progress\nBut as soon as they get in position, they forget\nSo now he got his own artists on the set\nThey risin' straight to the top, they playin' chess\n\n[Bridge]\n\n[Hook]\n\n[Verse 2]\nLife is like a game of chess, get it straight\nYou cheated on your wife, called it a mistake\nI told her I hate to see a heart break\nYou feelin' bad, lemme take you on a date\nI just took your queen right in front of your face\nNow it's easy to get to the king, checkmate\nOne man's pain is another man's pleasure\nHe treat you like trash, I could treat you way better\nCause one man's trash is another man's treasure\nThis is chess not checkers, chess not checkers\nShe don't love you no more, eat dinner out the fridge\nWhen a woman's fed up, you see the difference kid\nYou try to deny it but you admit what you did\nShe know you better than yourself, there it is\nFemales are intelligent, that's the wisdom kid\nThey're built from the top down like a pyramid\n\n[Bridge]\n\n[Hook]\n\n[Verse 3]\nLife is like a game of chess, get it straight\nI made my first hit record, checkmate\nI'mma do numbers on my release date\nHere's another hit record, checkmate\nYou sold millions of records, but what's next?\nYou need a couple of bombs from funk flex\nA diss record'll make everybody upset\nBut that'll make you hot, you playin' chess\nUsed to be an artist, but now you an exec\nYou signed a buncha wack artists at your desk\nYou make sure they wack so you can sound fresh\nI guess they just your pawns, you playin' chess\nRecord labels, y'all signing acts right and left\nHe pop bottles and celebrate his success\nY'all put him on the shelf but told him he was next\nHe just a tax write-off, yall playin' chess\n\n[Bridge]\n\n[Hook]\n\n[Papoose]\nI got my rooks on the chessboard, uh\nI got my knights on the chessboard, uh\nI got my bishops on the chessboard\nIf you play your cards right you can get yours", "year": null}]}