{"artist": "Phora", "songs": [{"album": "Still a Kid", "title": "Living Proof", "image": "https://images.genius.com/98a5adc4fa74d377810f8c390ea44183.1000x1000x1.jpg", "lyrics": "[Hook]\nI'm not ballin', but at least I'm still breathin'\nAin't heard of me mothafucka?\nYou sleeping\nI'll be here til' I'm dead, I ain't leaving\nSo you better get use to me\nI'm not ballin', but at least I'm still breathin'\nAin't heard of me mothafucka?\nYou sleeping\nI'll be here til' I'm dead, I ain't leaving\nSo you better get use to me\nI'm not ballin', but at least I'm still breathin'\nAin't heard of me mothafucka?\nYou sleeping\nI'll be here til' I'm dead, I ain't leaving\nSo you better get use to me\n\n[Verse 1]\nYo, before I take my last breath\nI wanna make it clear I give my all, I'll never half step\nAnd I don't dwell what I can't get\nInstead I put my time and effort into everything I have left\nI want the dream that's why I can't rest\nShit I just wanna live my life I never hope on any mans death\nI know they want me dead and I don't blame 'em nigga\nCuz am the only rapper fighting for a change my nigga\nAnd I ain't bragging I'm just being honest\nI'm seeking knowledge everybody else is rapping for the fame my nigga\nI do it for the love strictly for the L.O.V.E\nI try to stay above everything they yell on TV\nCuz they just got us killin' each other\nAnd the fiends never think twice they quick to steal from they motha\nPlease don't try to put me down if you ain't feeling me brotha\nNah, make yo own moves, I don't play by no rules\nNo dude coulda last a fuckin' day in my shoes\nJust like I coudn't pass the 11th grade in high school nigga\nFuck what you heard unless you heard it from me\nCuz honestly I give a fuck about the word on the streets\nMotherfuckers got it twisted all up in a nigga's business\nSpeakin' on some shit that ain't even concerning you G\nLook its all good tho, we all know you hood bro\nBut when you die is anyone gonna know what you stood for\nNow a days niggas die for the G-code that's the very thing that's killin' me and my people\nIt ain't politics its not Obama, it's niggas like you starting problems and causin' drama\nClaiming the streets that you dont even know\nWilling to die for a nigga that woundn't throw you a bone\nAnd you wonder why you stuck on \"Yeah am sellin' drugs\"\nCuz all you wanna do is fuck hoes and be a thug\nOn some real shit I ain't even tryna diss\nCuz what I wrote goes out to most of the katts that I kick it with\nAin't tryna put you down but I ain't sugar coating shit\nWatch for the girls you fuck, watch who you rolling with\nI'm trying guide you from the darkness to the sunshine\nWe all gotta go some times\nI'm trying guide you from the darkness to the sunshine\nWe all gotta go some times\nAs I take my last breath\nAs I take my last breath\nAs I take my last breath\nAs I take my last breath\n\n[Hook]\nI'm not ballin', but at least I'm still breathin'\nAin't heard of me mothafucka?\nYou sleeping\nI'll be here til' I'm dead, I ain't leaving\nSo you better get use to me\nI'm not ballin', but at least I'm still breathin'\nAin't heard of me mothafucka?\nYou sleeping\nI'll be here til' I'm dead, I ain't leaving\nSo you better get use to me\nI'm not ballin', but at least I'm still breathin'\nAin't heard of me mothafucka?\nYou sleeping\nI'll be here til' I'm dead, I ain't leaving\nSo you better get use to me\nI'm not ballin', but at least I'm still breathin'\nAin't heard of me mothafucka?\nYou sleeping\nI'll be here til' I'm dead, I ain't leaving\nSo you better get use to me", "year": "2012-11-18"}]}