{"songs": [{"title": "Open Tumblr Letter on Racism", "album": null, "year": null, "image": "https://images.genius.com/4fff53f85a4f6704ecb471ac0c617cfe.446x446x1.jpg", "lyrics": "The concept of reverse racism is flawed, if not absolutely ridiculous. Most, if not all of the negative responses from people of color toward white people, are reactions to the hatred, violence, cruelty and brutality that they were shown by white people for centuries. Much of the foundation of the modern world was built on the forced free labor of black peoples. The African Slave Trade, the institution of slavery, colonialism, its derivative systems, and the multiple holocausts throughout history, where whites used race as the defining reason to justify their oppression, conquest, and brutal treatment of non-white peoples, are how race became such a factor to begin with.\n\nThe initial claim by the oppressors, followed a moral imperative (so they said) that people outside of Occidental and European birth were in savage and cursed conditions, and that God justified the captivity of these people, and the rape and pillage of their lands.\n\nIronically, these oppressors would try to discard this same God, who supposedly justified this brutality, in the name of Darwin, whose famous line ‘survival of the fittest’ was used to justify criminal behavior once the Bible could no longer be used as a hiding place for economic domination and evil intention.\n\nSpirituality and morality were replaced by capitalism, and with it a conscious shift of focus toward the exploitation of the vulnerable.\n\nIn order to justify reverse racism one would have to first create an even playing field, undo the generations of torture, terror, and brutality, and then judge whether or not a non-white person is in fact a racist. This approach would require people to examine the need/addiction to feel superior to someone else for no justifiable reason, and the myriad policies: Spiritual, political and social, that it bore. True dominion is self evident and not the result of sabotaging another in order to achieve it. That would be an illegitimate as well as a fleeting position. The Universe, will eventually seek to right/balance itself.\n\nOf course there are white people who live transcendent lives, not exploiting ill-gotten privilege or perpetuating the sins of their ancestors who used violence and deceit as a means to gain advantage over others. Humanity in proper order is obligated to acknowledge the Truth, whoever it comes from, be they Black, White or other. Righteous indignation is simply a response to long-standing evil.\n\nMuch of the world is still reeling from the abuses of Imperialist selfishness, misunderstanding, ignorance and greed. Black people remain in many ways a shattered community, disenfranchised, forcefully removed from context and still caged in, denied from making truly independent choices and experiencing existential freedom. Their natural homes, just like their natural selves, raped and pillaged of the resources and gifts God has given to them. Interpreted through someone else’s slanted lens and filter, they remain in many ways, misrepresented. Taxation without proper representation, might I remind you, was the very platform of protest that began the Revolutionary War, which gained this country its independence from England. Anger is not only the natural response to the abuse of power, but is also appropriate when there is no real acknowledgment of these abuses, or deep, meaningful and profound change.\n\nIf we took all of what we deem horrible regarding the criminal abuses that black people have committed over this country’s history, and add it all up, it still does not compare to the hundreds of years of terrorism, violent domination, theft, rape, abuse, captivity, and beyond that black people have suffered under the ideologies and systems of white supremacy, racism, and slave based paradigms. I say this only to say that abuse unresolved begets or creates abuse. How then does the chief offender become the judge? Might does not necessarily mean right. Right is right. People forcibly reduced to sub-human existences, so that they behave in sub-human ways, helps a system to justify itself or feel less guilty about its blood saturated foundation and gross crimes against humanity. People, like plants, grow where the light is. When you enclose a plant and limit its light source, it will bend itself toward the light, for the light is necessary for its survival. This same thing happens to people locked in communities where little light and little opportunity is allowed them, survival then forces them to twist and/or bend toward the only way of escape.\n\nThere is good. And I both acknowledge and encourage the good. Instead of throwing out the Baby with the bath water, we do well to expose the intentionally poisoned water the Baby has been forced to soak in since its origin in these lands. America’s particular brand of hypocrisy is gross (double entendre).\n\nI shuddered during sentencing when I kept hearing the term ‘make the IRS whole’… make the IRS whole, knowing that I got into these very circumstances having to deal with the very energies of inequity and resistance that created and perpetuated these savage inequalities. The entire time, I thought, who has made black people whole?! Who has made recompense for stealing, imposing, lying, murdering, criminalizing the traumatized, taking them against their wills, destroying their homes, dividing their communities, ‘trying’ to steal their destinies, their time, stagnating their development, I could go on and on. Has America, or any of the nations of the world guilty of these atrocities, ever made black people or Africa whole or do they continue to sit on them, control them, manipulate them, cage them, rob them, brutalize them, subject them to rules that don’t apply to all? Use language, veiled coercion, and psychological torment like invisible fences to keep them locked into a pattern of limitation and therefore control by others. You have to remain focused to cease from rage.\n\nThe prosecutor, who was a woman, made a statement during sentencing about me not doing any charity work for a number of years during my ‘exile.’ A) Charity work is not a requirement, but something done because someone wants to. I was clearly doing charitable works way before other people were even thinking about it. And B) Even the judge had to comment that she, meaning I, was both having and raising children during this period. As if that was not challenging enough to do. She sounded like the echo of the grotesque slave master, who expected women to give birth while in the field, scoop the Baby up, and then continue to work. Disgusting.\n\nWhen you are beaten and penalized for being independent, or truly self reliant, then you develop a dysfunctional relationship with self-reliance, and a fear of true independence. When you are beaten or threatened with death for trying to read a book, then you develop a dysfunctional relationship with education. When families are broken up by force and threat of violence, then the family structure becomes dysfunctional. When men who would naturally defend their women and families are threatened with castration and death, then this natural response also becomes dysfunctional. When looking at the oppressor is punishable by violence, then examination of him and his system becomes a difficult and taboo thing to do, despite every bone in your body demanding it. When questioning or opposing oppression is punishable by death, imprisonment, or economic assassination, then opposing systemic wrong in any or all of its meta manifestations is a terrifying concept. Anyone forced to live so incredibly diametrically opposed to that which is natural to themselves, will end up in crisis if they don’t successfully find a way to improve or transcend these circumstances! All of which require healing. It is only by the Grace of God and the resilience of the people that things haven’t been worse.\n\nMuch of my music, if not all of it, is about Love, a therapeutic resolve created in response to the lack of messages encouraging people like me toward free moral agency. Helping to ameliorate this condition has never been addressed through the political arena alone. It is a sacrificial work that doesn’t simply happen between the hours of 9 to 5 or Monday through Friday, but when inspiration leads us to avail ourselves for the Truth that needs to be said. Unlike the system too often contrarily demonstrates, we believe that people can be and should be helped, and that trauma should not be criminalized but acknowledged, healed and dealt with. This takes awareness, sensitivity and a level of freedom in my opinion the system lacks. And if we don’t know or understand how to do it, then we humbly refer to a higher authority.\n\nWe have no desire to create humanoids, turn people into machines, or dumb them down so that they remain dependent longer than necessary to an antiquated system in denial of its many inadequacies and need to evolve. Instead we seek to educate and shed light on the snares, traps, and enticements that people set up in the name of business that are intended only to catch the sleeping and/or uninformed.\n\nWhy would a system, ‘well intentioned’, wait until breakdown or incarceration to consider rehabilitation, after generations of institutionally inflicted trauma and abuse on a people? To me it is obvious that the accumulation of generational trauma and abuse have created the very behaviors the system tries to punish, by providing no sufficient outlets for the victims of institutional terror. Clearly, the institution seeks to hide its own criminal history at the expense and wholeness of the abused, who ‘acting out’ from years of abuse and mistreatment, reflect the very aggression that they were exposed to."}], "artist": "Lauryn Hill"}