{"artist": "E-40", "songs": [{"title": "Blossom", "image": "https://images.genius.com/69888735950c51a30bd2a1f03289f53d.1000x1000x1.jpg", "album": "Practice Makes Paper", "year": "2019-07-26", "lyrics": "[Intro]\nReece, take 'em to church\n\n[Chorus: Rexx Life Raj]\nMakin' a way out of no way, I did that, ayy (Did that)\nThey gon' try to take your soul by any means, mine still intact\nI rose from where roses don't grow\nStill flourish and blossom though, yeah\nStill stuntin' on them niggas who doubted\nWhy you hate on me?\n\n[Verse 1: E-40]\nThey doubted me, outed me, didn't want me to flourish\nI come from the ghetto where we was famished, malnourished\nWhen people first heard me, they thought that I was a fluke\nBut I'm a real nigga like Kunta Kinte from Roots\nI'ma keep runnin' even without any shoes\nGot family in Louisiana, out there in the boot\nMy niggas be huntin' and they'll give you the blues\nThey don't do music but they some Pros with the Tools\nBroken towel racks and toilet tissue holders\nUsed to keep the bacon fat up in a can of Folger's\nAnd if the heater ain't workin' and it's freezin' cold\nWe open up the oven and turn on the stove (Uhh)\n\n[Chorus: Rexx Life Raj]\nMakin' a way out of no way, I did that, ayy (Did that)\nThey gon' try to take your soul by any means, mine still intact\nI rose from where roses don't grow\nStill flourish and blossom though, yeah\nStill stuntin' on them niggas who doubted\nWhy you hate on me?\n\n[Verse 2: Boosie Badazz]\nThey doubted me (Yeah)\nBoosie on death row with Manson, they clowned me\nCome from the gutter, no cap, the real gutter (Gutter)\nOne of the few who made somethin' outta nothin' (Gutter)\nI learned how to cook cocaine from my uncle in the game\nHe was a dope dealin' nigga wit' a name\nStruggle all winter, broke all summer (Man)\nRemember only fuckin' two hoes all summer (Man)\nMama showed pain when I cried to the Lord (Lord)\nDaddy bang a needle, on game, swear to God (Swear to God)\nKeep on the water on the stove, make it hot, shit was real\nNow a nigga livin' on the fuckin' hill\nThat's what it is\n\n[Chorus: Rexx Life Raj]\nMakin' a way out of no way, I did that, ayy (Did that)\nThey gon' try to take your soul by any means, mine still intact\nI rose from where roses don't grow\nStill flourish and blossom though, yeah\nStill stuntin' on them niggas who doubted\nWhy you hate on me?"}]}