{"songs": [{"image": "https://images.genius.com/639af7c3779547263444a0acdd2ffcde.1000x1000x1.jpg", "title": "Blaxploitation", "album": "Room 25", "year": "2018-09-14", "lyrics": "[Intro]\nWhat happened to my hundred dollars Joe?\nNigga, did you take my money?\nHeh-heh, that's right lil bitch!\n\n[Verse 1]\nPenny proud, penny petty, pissing off Betty the Boop\nOnly date niggas that hoop, traded my life for cartoon\nDance monkey dance, cathedral gon' pay me good tonight\nEating Chick-Fil-A in the shadows, that taste like hypocrite\nMmm, yummy tasty, mmm, mmm, yummy tasty\nWaffle fry my empathy, bitches just really lazy\nMaybe I'm a hypocrite, maybe I'm hypochondriac\nI'm struggling to simmer down, maybe I'm an insomni-black\nBad sleep triggered by bad government\nWrite a think piece in the rap song, the new age covenant\nIf you really think I'm cooking crackin, pass me the oven mitts\nCaptain watch a lil bitch go crunch and wonder how everything happen\n\n[Bridge]\nMy people started running a long time ago\nAnd they are still fighting\nRevolution was never meant to be easy\nThis is not your fight, black man\nWhat is this to you?\nIt's not a matter of color\nFreedom is everybody's business\n\n[Verse 2]\nUh, yeah, anti-political mythical in the picture\nYour nigga just moved to Wicker\nYour mammy stay on the south side\nShe paid to clean your house, power of Pinesol, baby\nShe the scrub tub lady\nShe that naked bitch in videos, that drunk club lady\nImmortalized all '80s and then she real, real nasty\nKeep the hot sauce in her purse and she be real, real blacky\nJust like a Hillary Clinton, who masqueraded the system\nWho chicken-boned, watermelon-ed\nTraded hoodie for hipster, infatuated the minstrel\nWhen we cool, they cool, we die as coon\nWe supa fly indigenous, now hop to the moon\nWho wrote the movie to America? It's still coming soon\n\n[Outro]\nDo you hear me man?\nDo you understand? I am Black\nI'm a nigga, do you understand me?\nI was born black, I live black, and I'ma die probably because I'm black, because some cracker that knows I'm black better than you, nigga, is probably gonna put a bullet in the back of my head"}], "artist": "Noname"}