{"songs": [{"image": "https://images.genius.com/2d7b73379057607ed4c1a8637d31c15b.400x400x1.jpg", "title": "Hell Yeah", "album": "Pink Friday: Roman Reloaded - The Re-Up", "year": "2012-11-19", "lyrics": "[Hook: Parker Ighile]\nWhat we do when we go high?\nWe doing it all night\nOoh the girls, they wanna vibe with us tonight\nI'm in the middle of the club with my niggas and we all fucked up\nScreaming hell yeah, hell yeah\nWhat we do when we go high?\nWe doing it all night\nOoh the girls, they wanna vibe with us tonight\nI'm in the middle of the club with my niggas and we all fucked up\nScreaming hell yeah, hell yeah\n\n[Verse 1: Nicki Minaj]\nYeah, yeah\nI ain't see you on the Forbes yet,swear to God, I ain't see you in the stores yet\nDonatella on the corset\nPretty Gang, in the back of my corvette\nCopped my best friends Rangers and Benzes\nPlus all my menses, Louie V lenses\nThis is how it feel, when you winning\nMan, they been rocking with me since the beginning, inning\nThis is where the stress ends\nFeel ill, when you never gotta stress ends\nAlways in the press when\nPaparazzi in the bushes, with the stretch lens\nSay cheese to that, pull up on the double R,pop clutch on them\nNo, them strippers ain't mad, when I touch on them\nRussell Simmons shoe game, put a rush on them\nSend a GT vodka, sitting on top of\nMafia money, eating seafood pasta\nVMA's, I was good there, front row, yeah, always in a good chair\nThe bad gon' boo, but the good cheer, that's why my pockets on blimp, like the Good Year\nYeah, yeah, yeah\n\n[Hook: Parker Ighile]\nWhat we do when we go high?\nWe doing it all night\nOoh the girls, they wanna vibe with us tonight\nI'm in the middle of the club with my niggas and we all fucked up\nScreaming hell yeah, hell yeah\nWhat we do when we go high?\nWe doing it all night\nOoh the girls, they wanna vibe with us tonight\nI'm in the middle of the club with my niggas and we all fucked up\nScreaming hell yeah, hell yeah\n\n[Verse 2: Nicki Minaj]\nBut, you're boring as fuck though, why these bitches in the game so cutthroat?\nWhy they can't just let Young Nicki live? Why they gotta feel the wrath, to know Nicki is -\nNot playing? Boss for real, when they go against The Kid, it's gon' cost for-real (Pharrell)\nCame straight from the hood, with the cross appeal\nThat's why these big names, wanna toss the deal\nOkay, I'll take it, sign on the dotted line, but I'm quick to check a bitch if she outta line\nShout out Mike Darnell and Nigel, why these bums so mad that the queen on Idol, huh?\nSay cheese to that, when they see me on the screen, check E! for that\nBitches lying on the kid, I won't leave for that, intimidated by my aura, where Rita at?\nSend a GT vodka, in a helicopter, me and my Japanese bitches\nIn Osaka\nBET, I was good there, front row, yeah, always in a good chair\nWhy the fuck would I leave, when I'm good here?\nLet me send a Twitpic of my good hair, yeah\nYeah, yeah\n\n[Hook: Parker Ighile]\nWhat we do when we go high?\nWe doing it all night\nOoh the girls, they wanna vibe with us tonight\nI'm in the middle of the club with my niggas and we all fucked up\nScreaming hell yeah, hell yeah\nWhat we do when we go high?\nWe doing it all night\nOoh the girls, they wanna vibe with us tonight\nI'm in the middle of the club with my niggas and we all fucked up\nScreaming hell yeah, hell yeah"}], "artist": "Nicki Minaj"}