{"artist": "Ice Prince", "songs": [{"title": "Oleku", "lyrics": "[Hook]\nOleku, tell me something wey I no fit do\nMi o gbopo gbopo gbopo malotuu\nMo ni ni mo ni ni, Odeji, Modeji\nI hope you ready, cos it's oleku\nShe feeling the boy, she feeling, she feeling the boy\nYeah, yeah, yeah, yeah\n\n[Verse 1]\nOkay, I'm so interesting\nIt's why they say that I'm the next thing\nSo even on features I'm impressing\nPeople do hate but I'm a flexing\nYeah, I learned the lesson\nThey throw me shots but I’m a chesting\nI'm far from pop my pop is resting\nMy flow so bad my tongue is vexing\nYeah\nNo one is testing, I'm best by far is what I'm guessing\n1 2 3, I win like wrestling\nHow can I loose I'm with the best team\nYeah, I'm the boy with the fire\nDJ's gimmie more spin than a tyre\nSeen it all, done it all sang in the\nChoir\nFeeling like I'm tenor here only go higher\nYeah!\n\n[Hook]\n\n[Verse 2:]\nOkay, its so exciting\nThe game's been dull, but I'm igniting\nPositive flow I'm so attracting\nWhether freestyles or even writing - yeah!\nI put my life in, the bread don't cut, I put\nThe knife in, my left hand weak, I put the right in\nAnd take my bars from J to Brighton\nI see the lightning, I know sometimes the rain is\nFrightening, no matter how hard the seed is ripening\nSo when you hear Ice prince say hyping - yeah!\nI don try plenty, I dey rap, I dey sing, I dey come M.C\nIt's too many songs and I'm never empty\nNow you chop stone if you want tempt me - ah, ah!\n\n[Hook]\n\nOkay, I'm so contagious, and no one done this good in ages\nI put my foot in hell, courageous\nToo many verse like bible pages - yeah!\nAnd I hit their playlist, so I can grow up from low\nTo apex, until my account is fat and shapeless\nToo many songs but mine is latest - yeah!\nSo love or hate this, I'm getting my cake, I'm on the cake list\nBeating my chest, I'm on the Ape list\nYou should be honoured and bow to greatness - yeah!\nSee my name's getting famous, my team's fire men you cannot flame us\nNa Baba God work, you cannot blame us\nIt's in vain when haters try 'n aim us - yeah!\n\n[Hook]", "image": "https://images.rapgenius.com/0fc933cf9a747c90dfd6ea81b6016c8e.342x307x1.jpg", "album": "E.L.I (Everybody Loves Ice Prince)", "year": "2010-06-08"}]}