{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f1ce17fdad92806e2e9b19241838f42f.1000x1000x1.jpg", "title": "R.A.P. Music", "year": "2012-05-15", "album": "R.A.P. Music", "lyrics": "[Intro]\nI've never really had a religious experience, in a religious place. Closest I've ever come to seeing or feeling God is listening to rap music. Rap music is my religion. Amen\n\n[Verse 1]\nWhat I say might save a life, what I speak might save the street\nI ain't got no instruments, but I got my hands and feet\nHands gonna clap and feet gonna tap, El-P beats to make that snap\nAnd I ride 'em with my raps and they all tight as my naps\nAnd my naps is all I got and this beautiful ebony skin\nAnd the music in my heart and the words put in the wind\nAnd the words put in the wind comin' back like a boomerang\nWhen I take this microphone, point it at the crowd, they start to sing\n\n[Hook x2]\nThis is jazz, this is funk, this is soul, this is gospel\nThis is sanctified sick; this is player Pentecostal\nThis is church; front pew, amen, pulpit\nWhat my people needin'? The opposite of bullshit\nThis is jazz, this is funk, this is soul, this is gospel\nThis is sanctified sick; this is player Pentecostal\nThis is church; front pew, amen, pulpit\nWhat my people needin'? The opposite of bullshit\n\n[Verse 2]\nIt's that Robert Johnson, that Muddy Waters\nThat James Brown, Augusta, Georgia\nThat Ray Charles, that Stevie Wonder\nThat Mayfield, that Superfly\nThat Willie Hutch and that Mack\nIt's that blues man, that soul man\nThat OutKast, that Southernplayalisticadillac\nIt's that Jimi Hendrix, that George Clinton\nI feel it in my bones\nAretha Franklin, that Shirley Caesar\nMiss Nina Simone\nThat Sade, that Love is King\nThat Coltrane, that Love Supreme\nThat Miles Davis, Bitches Brew\nThat \"beeeyotch\" said by Playboy Too\n\n[Hook x2]\n\n[Verse 3]\nI got things to do, before I meet that glory in the sky\nAnd my baby girl b-day six months away, she gonna be five\nSo I pray to the Lord he spare me, and I make it by and by\nAnd I help souls stay out of Hell with what I testify\nAnd maybe when I grab that microphone and never lie\nThat'll merit that he spare me, I won't have to feel that fire\nSo Killa Kill gonna spit that real on each and every song\nAnd each and every poem, until the good lord call me home, gone!\n\n[Hook]"}]}