{"artist": "Problem", "songs": [{"album": "Welcome to Mollywood 2", "title": "D.R.U.G.S", "image": "https://images.genius.com/b1ed996e39c23e18263557323484529a.500x500x1.jpg", "lyrics": "[Hook: Problem]\nDrugs, drugs, bitch I’m on drugs\n\n[Verse 1: Problem]\nMolly and the weed tho, that’s all I gotta say\nWhen I put my dicks in this hoes\nI hope they high as me\nProlly not, fuck it, taxi all in public\nNever wanna use it, prolly don’t\nIf she let me fuck it\nHella burnt turnt like a car going 'round the corner\nWon’t change like the coin machine is fucking out of order\nNever ever follow orders I make orders follow me\nRiding in the ghost got me hella booze\nHalloween, me and that clown, no make up\nRed velvet in the sky, my cake’s up\nBitch booty sittin high, her cake’s up\n2 words I can’t stand lace front\nHa, I'm playing girl you know you fly\nBlow me bitch don’t blow my high, what?\n\n[Hook: Problem]\nDrugs, drugs, drugs\nBitch I’m on drugs, huh?\nDrugs, drugs, drugs\nBitch I’m on drugs, huh?\n\n[Verse 2: Clyde Carson\nZoner, get owner, all cash pink slip, and a loaner\nNeed something in your mouth I’m a donor\n35 racks in my cup holder\nFeels for deals my voice give her the chills\nI blow a kiss to molly, then she give me the thrill\nIt’s like a high, just can’t quit\n6 in the morning, a nigga still lit\nTell them that I’m living a life you want in\nYou can mob, long as you understand this and do your job\nSun coming up man she still wanna ride\nI don’t like shit but I still wanna drive\nMoving lane to lane I got the coupe 2 stepping\nHop out like a young black Hugh Hefner\nFly, fresher, hella weed, bunch of sour on the dresser, huh?\n\n[Hook: Problem]\nDrugs, drugs, drugs\nBitch I’m on drugs, huh?\nDrugs, drugs, drugs\nBitch I’m on drugs, huh?\n\n[Verse: Berner]\nWake up in the morning, hit the kesha\nRight before I head to the weed spot\nI dump all 10 then I recup\nMy liver too shine, need a detox\nWhy you clear, you that’s coke and criss\nI get her drunk as hell then let her choke on dick\nI’m breathing slow, heart beating fast\nI got cookie for days, your weed is trash\nI used to be at school on the jail tab\nI made a quarter mill off a meth lab\nI brought a 10 pack on the grey hound\nI used to be along with the grey pound\nI'm on one, xans and a bottle of gyn\nThrow a molly in the glass\nMake her suck all my friends\nReal talk no time for games\nI smoke DMT and now I’m seeing thangs\nI’m on drugs\nDrugs, drugs, drugs", "year": null}]}