{"artist": "A$AP Rocky", "songs": [{"title": "Back Home", "image": "https://images.genius.com/3054c642a320e82b70b35c53ad1cc8d5.1000x1000x1.jpg", "album": "AT.LONG.LAST.A$AP", "lyrics": "[Intro]\nGotta find my way back home\nI've been away too long\nGotta find my way back home\nI'm moving...\n\n[Verse 1: A$AP Rocky]\nWar Lords, we all Lords, but we your Lords\nTryna find home, next stop is the Waldorf\nPast the racism and fake-ism\nType of hate that make you feel worse than a rape victim\nRaw dogs, you other niggas mad soft, mad I rap my ass off\nThey throwin' mad salt 'til I go bath salt\nOn wax, spitting heat to melt the wax off\nI'm Mr. Miyagi in Issey Miyake\nAsshole flow, fuck name brands, past logos\nNow I'm onto grand raps, hands so low, uh\nIt's like my fashion style is the life saver\nGuess she wasn't satisfied with titties that Christ gave her\nBragging that her new ass shots is a life changer\nHead is so good on that girl that I might pay her, or nah\nSuper laid back cat, opposite of fat black, Al Capone\nTell them lil' niggas Flacko home\n\n[Chorus: Acyde]\nGotta find my way back home\nI've been away too long\nGotta find my way back home\nI've been away too long\nGotta find my way back home\nI've been away too long\nGotta find my way back home\nI've been away too long\n\n[Verse 2: A$AP Rocky]\nUhh, Father, Lord forgive me as I load up the semi\nRoll through the city, that chose to resent me\nHold it, don't load it, reload it on plenty\nAny foe or a [beep] that ever voted against me, dissed me\nPissed me off then tried to hold it against me\nOr wish we off the worst of luck that ever hated\nNever hesitated, the designated, all of the wrong that they did me\nIs stored in my memory all of the thoughts that I thought of\nMeans more for my enemies\nSippin' holy water like it's bore from my kidneys\nLoad the smoke like a chimney, make a toast for the memories\nMake a toast for the Henny, it's the best for the remedies\nEnergy, synergy, frienemies, industries\nFinna get advantage on him and his nemesis, bitches been sniffing\n(Flacko Jodye Season bitch!)\nIf I, if I ain't the greatest, bitch I'm one of em\nHow in the fuck could you front on 'em?\nMy old ho beefing, my ex won't be friends\nBronson told me not to eat ham, rest in peace Yams\n\n[Chorus: Acyde]\nGotta find my way back home\nI've been away too long\nGotta find my way back home\nI've been away too long\nGotta find my way back home\nI've been away too long\nGotta find my way back home\nI've been away too long\n\n[Break: A$AP Rocky]\nRest in peace Yams, RIP A$AP Yamborghini\nWe gon' take it uptown one time\nWe gon' take em back home, show 'em how me do\nThey call me Pretty Flacko ladies and gentlemen\nI'd like to introduce Pretty Flacko Sr\nYasiin Bey\n\n[Verse 3: Yasiin Bey]\nMagnum spectacular, black man megalas\nShine amethyst, fly champion, it's like that again\nWhat's happening? Mathematics master blin'\nFlacko season, all day, erryday\nAsk me how it's going, I tell em on and on and on and on and\nYou led me out to Arizona, steady flowing, staying golden\nSand cover, ready rover, Flacko glowing in that Owens\nThat's how it's going (Gotta find my way back home)\nHuh, awareness to the areas, familiar with the routes\nTravellin' man, moving through places\nSpace and time, in a country called Earth\n\n[Outro: A$AP Yams]\nNah'mean? These tacky ass muh'fuckers be in the pictures\nWearing all types of motherfuckin' red and green stripes\nOver accessorizing out this motherfucker\nWe from Harlem, we gave y'all motherfuckers this wave\nGrab y'all surfboards, cause y'all got your boogie boards right now out this motherfucker\nY'all just gon' keep watching us at the beach shore\nWith your motherfuckin' khakis rolled up\nWith your chancletas in your hand\nAnd we just gon' keep surfing on this motherfucker\nStraight up! It's ya' boy, A$AP Yams, Yamborghini\nYo Rock man, let these motherfuckers know what it is\nOut this motherfucker, A$AP, bitch!", "year": "2015-05-26"}]}