{"artist": "G-Eazy", "songs": [{"title": "Friend Zone", "album": null, "year": "2015-09-16", "image": "https://images.rapgenius.com/2cea3c4fcb7fccfeae8e68ddca3af309.730x730x1.jpg", "lyrics": "[Produced By Nic Nac]\n\n[Hook: Marc E Bassy]\nWe’ve grown too close for that\nFuck a friend zone I know I ain’t perfect\nI wonder what you’ve been on\nIs you doing what I’m doing?\nIf you doing what I’m doing I can’t deal with it\nIs you moving how I’m moving?\nIf you moving how I’m moving, I can’t live with it\nOh no, fuck the friend zone\nOh no, motherfuck the friend zone\n\n[Verse 1: G-Eazy]\nWe’re still fucking every time I’m in town\nHoes come around but you really been down\nHeard through the grapevine you’re seeing him now\nLooking for the one and you think he’s been found\nNot true, that is not true\nThey could never understand what we’ve been through\nUp at night thinking so I sent the text though\nI’m just checking in like I hope you’ve been cool\nFinishing school? that’s cool my congrats\nMaybe we can finally do this at last\nBut these days the pace that I move at is fast\nMaybe I’m just chasing what I knew in my past\nMaybe this is pointless and I should probably leave you\nRealize you’re living at a-whole-nother speed too\nMaybe I just realized I really fucking need you\nOr maybe I’ll just tell you all about it when I see you\nUntil then\n\n[Hook: Marc E Bassy]\nWe’ve grown too close for that\nFuck a friend zone I know I ain’t perfect\nI wonder what you’ve been on\nIs you doing what I’m doing?\nIf you doing what I’m doing I can’t deal with it\nIs you moving how I’m moving?\nIf you moving how I’m moving, I can’t live with it\nOh no, fuck the friend zone\nOh no, motherfuck the friend zone\n\n[Verse 2: G-Eazy]\nAnd we both know we should let go\nIt doesn’t change the fact we keep on having sex though\nSince the last time I guess if it helps though\nBut you’re really only lying to yourself though\nCan’t resist you cause you got all the right stuff\nIf we was on the same page then I might cuff\nThey say relations don’t work for people like us\nBut then again we’re that crazy so it might just\nAnd I know I still got some growing up to do\nBut you already know the deal this is nothing new\nYeah, you know I treat you better than most others do\nI’m something different than the rest, even your mother knew\nShe asks about me to the point she almost smothers you\nYou can’t sleep you’re still up at two\nSo you decide to call me, I bring those rubbers through\nCause we can fuck it’s all good if you want, it’s just up to you\n\n[Hook: Marc E Bassy]\nWe’ve grown too close for that\nFuck a friend zone I know I ain’t perfect\nI wonder what you’ve been on\nIs you doing what I’m doing?\nIf you doing what I’m doing I can’t deal with it\nIs you moving how I’m moving?\nIf you moving how I’m moving, I can’t live with it\nOh no, fuck the friend zone\nOh no, motherfuck the friend zone\n\n[Outro: Marc E Bassy]\nMotherfuck the friend zone\nMotherfuck the friend zone\nMotherfuck the friend zone\nMotherfuck the friend zone\nMotherfuck the friend zone"}]}