{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/0e825d5daf35800f4be503b4ff58164c.640x640x1.jpg", "title": "Let Me See U Bounce", "album": "Weekend Warrior", "lyrics": "[Elephant Man]\nBiz Markie and Elephant Man, we sensei\nBump fair ladies like Sean Paul, okay, c'mon!\n\n[Biz Markie]\nLadies and gentlemen, how do you do (a do)\nIt's been a long time but without further adieu (adieu)\nThe Diabolical came to get the job done\nCause I'm the, Woogie Boogie and the master of fun\nIf you're ready to rock, and ready to get down\nThe grand groovin here to prove a different sound\nI gotta get funky for the Y2K\nEach and every time I know what to say\nEast West Midwest and the Dirty South\nAlways love the way that I be rockin the house\nAll the ladies, in the new jeans\nLike Steve Arrington, you make me weak at the knees\nI'm glad to be right here with y'all\nLet the players play, and ballers ball, so\nChant, if you like the song\nC'mon baby doll just sing along\n\n[Hook - repeat 2X]\nGirl, let me see you bounce\nLet me see you bounce\nLet me see you bounce\nBounce\n\n[Elephant Man]\nEvery ting be a bounce, make me see girls a bounce\nMake me see boots a bounce, make me see party a bounce\nDisc jockey be a bounce, raise the stage up and bounce\nHopin dat de club a bounce, if ya irie a bounce\nAll de funkers a bounce, bartenders a bounce\nSoul people a bounce, all dese people a bounce\nEVERY TING A BOUNCE, ju know!\nBouncy bouncy bounce bounce, she no care\nBouncy bouncy bounce bounce, anywhere\nWhat kind of booty dat she have {?} in de air\nJust a bouncy bouncy bounce bounce, she no care\nBouncy bouncy bounce bounce, anywhere - ju know!\nC'mon\n\n[Hook]\n\n[Biz Markie]\nYes, I'm here to confess\nThat I took the S off Superman's chest\nHe got mad cause I felt, Lois Lane's breasts\nI asked her could I touch 'em and she said yes\nSo I guess, that I got the most finesse\nCause I wear {?} Fila, Ecko, Akademic and Guess\nWhen I watch cartoons I watch Johnny Qwest\nI wake up in the mornin and shower with Zest\nI hope you understand the rhyme I express\nAnd that you know, poppa don't take no mess\nYou're rockin with the best, so forget the rest\nCause you know that the Biz always pass his tests\nLike if I was in high school sittin at a desk\nStarin at a teacher, lookin up her dress\nYou gotta admit that the rhymes are fresh\nRight about now I gotta take recess\n\nSo uhh, ahh, uhh, ahh\nUhh, ahh, uhh, ahh\nMake it sexy, sexy baby\nMake it sexy, sexy baby\nMake it sexy, sexy baby\nSo shake it baby just shake it baby\nSo sexy, sexy baby\nMake it sexy, sexy baby\nMake it sexy, sezy baby\nJust shake it, shake it\nShake it, don't break it\nDon't fake it, don't break it\nJust shake it, don't break it.. {*fades out*}"}], "artist": "Biz Markie"}