{"songs": [{"title": "Pull It Off", "lyrics": "They say to play with a man's money is to play with a man's life\nAnd to play with a man's life means you playin' with your life\nAnd like that nigga fay say\nMotherfucker, play with your life, motherfucker\n\n[Verse 1]\nNah-nah-nah\nIf it's a cost to be a boss I be hustlin' high\nWithout a doubt I'm in and out through my puzzling eyes\nYou can see I, through chain promise\nPredicted but it gets wicked for real\nI'm back up on the hill ho\nHollerin' if you ever play the game you know\nThe love I'm speakin' of\nFace to face they wanna analyze young thug\nBone in it, swung in it\nDon't get it about my papers, see I\nMoney makes the caper, money makes 'em player hate ya\nSo watch your back, but there's your aphrodisiac\nCognac and fast sex, ol' black ass nigga you\nNigga who? Really, really wanna\nIf they catch you when sleepin' you's a gonna\nBoo-ya! Stuck off in a corner\nPerpendicular, perplexed, and paralyzed\nFrom the waist down, you shoulda recognized\nDon't make me tie-tie you\nMy nigga, thank you!\nBut if you ever disrespect me I'ma bank you!\nNigga ha-ha, that's how the games goes\nI'm in the same clothes I wore yesterday\nTryin' to take the stress away\nSmokin' on some hey-hey\nMy nigga then, whatchoo wanna do?\nI got more love than in our lives, so it's on you\nTo the east, that beat\nMy nigga be, hey, nigga\n\n[Hook]\nWhen you tryin' to get your grip pull it off\nWhen them niggas set trippin' boy pull it off\nWhen you ain't got no confetti and your palms is gettin' sweaty\nGet your whole clique ready to pull it off\n\n[Verse 2]\nNow even though shit ain't worked out, how a nigga discussed it\nAin't no sense in sittin' around lookin' broke and disgusted\nMama told me there'd be days like this\nShe also told me ain't got time to sit and cry like no bitch\nThat's for phonies\nIf you have to, you have to nigga make that bitch bleed\nIf they had love for thugs, they know the thug in me\nNow look here, blood, I ain't your Pappy\nDon't care 'bout you bein' unhappy\nAll that whinin' like a bitch gonna make me slap ya\n(Punk motherfucker)\nUtilities and rental fees, all this killin' stressin'\nFalse promises just like I figured get you disconnected\nTime to let it go, it ain' the first but I know it's comin'\nAny nigga in my way I'm straight dumpin'\nTime for a T.K.O. fa' sho, it's just your stack\nThey already on the floor, I'm already at the bank\nWhat you can't think\nTwo loaves of a bread and two sticks of butter\nEquals four niggas deader than a motherfucker\nBut the bills paid\n\n[Hook]\nWhen you tryin' to get your grip pull it off\nWhen them niggas set trip boy pull it off\nWhen you ain't got no confetti and your palms is gettin' sweaty\nGet your whole clique ready to pull it off\n\nWhen you tryin' to get your grip nigga pull it off\nWhen them niggas set trip boy pull it off\nWhen you ain't got no confetti and your palms is gettin' sweaty\nGet your whole clique ready to pull it off\n\n[Verse 3]\nNow get your grip nigga, shiver and moan\nGain the strength to be strong and I'm gone when the rope swings\nWish is to sling everything off attempting to grasp\nAnything come false on this money-makin' path\nThey put my back to the wall\nIf I fall dark skies, eternal light if I rise\nRide, nigga, with a hop\n'Cause now they all around with they gaze on\nTryin' maze a nigga life watchin' through the strife\nStruggle and fight, the plight to excel\nGot me gainin', nigga ain't fall time aimin'\nAt the box, straight headshots\nThrow them all at you, get it?\nAt the rope, I shall rip at your throat 'til the hole broke\nI got a thick special cream if you know what I mean\nIn a country full of junkies and river queens\nRunnin' around this beyotch with the pipe in they mouth\nI don't know why, but time tryin' to put moms in the house\n\n[Verse 4]\nHere comes that five-ten walkin'\nBlack man nigga staller\nEverywhere I go gotta pack my forty-four revolver\nI'm a baller, that's tryin' to protect my paper from them haters\nAll you ignorant and nasty ways, it'll never make ya greater\nIt'll break ya, plus take you for a nigga where you live\nSo pay attention to life, don't get it wrong\nThere's a chance you might get killed\nOn the real my nigga, watch your everyday move 'cause these niggas wanna see you lose\nBut me, myself, and I\nEver since the day of birth gotta pay my dues\nGotta watch them food stamps, livin' in trailer life\nGotta head up the righteous path\nThey got niggas committin', even tried to play me out\nBut I leave them all left to style\nFrom what I see in society, sell niggas a dream\nGet the peaches and cream, but it ain't all that it seems\nTryin' to tell you my nigga that you can trust in this song\nFrom the day you're here, then the next day you're gone", "album": "My Balls and My Word", "year": null, "image": "https://images.genius.com/1613c69d81c9bbfbbbbe477f2130bb6f.500x500x1.jpg"}], "artist": "Young Bleed"}