{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/c0aa03a655ce1263d1cf9dd0b975fc25.950x950x1.jpg", "title": "Good Idea", "year": "2015-12-25", "album": "Summer In The Winter", "lyrics": "[Intro: Kid Ink]\nI think that it's a good idea (it ain't wrong)\nI think that it's a good idea (you ain't home)\nI think that it's a good idea (still you)\nI think that it's a good idea (came through)\n\n[Verse 1: Kid Ink]\nIn fact, it's a good idea\nYou can bring that ass here\nActing like you had that pill\nWhere your cup? When the last time you had refill?\nYoung gunner on that can't stop, won't stop\nGreen light, running through the city like contra\nSeem like we the only niggas in the street with it\nBees like honey chain about the beehive\nI think I'm going loco-motion\nFlying 'round the world, no loco-motive\nSaying you the man only locals-notice\nMake the bitches disappear hocus-pocus\n\n[Hook: Bïa & Kid Ink]\nSee you don't normally do it, but you gon' do it for me\nHe don't know it mean more for me\nIf you whip that shit, go ahead flip that shit\nI think it's a good idea, we get up outta here\nGet up! (Get up!)\nGet up! (Get up!)\nI think that it's a good idea (Get up!)\nGood idea, we get up outta here\nGood idea (Get up!)\nI think that it's a, good idea we get up outta here\n\n[Verse 2: Kid Ink]\nUh, I need a pick in the post\nIt feel like I'm always picking the pose\nBecause everybody want a picture of the boss\nJust don't ever picture me broke\nI be trying to move this, silence\nFee-fi-fo, but I walk like a giant\nNiggas say I'm late but it's perfect timing\nThen pull up but I pull off in sirens\nM I A in this winter\nOut in LA feel like summer in the winter\nIt feel like somebody is watching\nI look around and it's the whole fucking party\n\n[Hook: Bïa & Kid Ink]\nSee you don't normally do it, but you gon' do it for me\nHe don't know it mean more for me\nIf you whip that shit, go ahead flip that shit\nI think it's a good idea, we get up outta here\nGet up! (Get up!)\nGet up! (Get up!)\nI think that it's a good idea\nI think that it's a good idea (good i)\nI think that it's a good idea\nI think that it's a, good idea we get up outta here\n\n[Verse 3: Kid Ink]\nI think that it's a good idea you get your ass involved\nEven if you ain't got no ass at all\nPoint guard players then I pass them off\nAnd by the way could somebody get your ass [?]\nIt's a movie up in here, tryna cast the role\nAll these bitches call em casserole\nLookin' like Miley with your cameltoe\nAll the Victoria Secrets I ain't told\nJust talkin' about groceries, baby, what's for dinner (good idea)\nOut in LA, feel like summer in the winter\nIt feel like somebody is watching\nI swear you niggas is worse than the paparazzi\n\n[Outro: Kid Ink & Bia]\nI think that it's a good idea, good idea (Get up!)\nI think it's a good idea that we get up outta here"}]}