{"songs": [{"title": "Face Down", "lyrics": "Lay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down.\nLay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down\n\nIt amazes me, all the things that we’ll do to get it\nTalk about it a little, next thing forget it\nIt’ll rule your whole life if you let it\nI don’t believe that it’s only every 6 seconds\nConstant drones for those with testosterone\nYou know that a dog's gotta chase his bone\nWherever it’s thrown, however far from home\nYou need to lay down, face down\nOnce blood starts flowin’, and hair starts growin’\nAnd curves start showin’, and we get our toe in\nJump in with both feet, so deep we nearly drown\nGot nothing to say unless it’s around\nChasin’ it, gettin’ it, tastin’ it, excellent\nLook how I’m flexin’ it\nEvery endeavor becomes just another clever way to lay down, face down.\n\nLay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down.\nLay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down\n\nI’m not sure if women know the things men do\nMaybe you do and you’re just the same too\nBut it’s the only reason we go to the gym\nGet a trim, and try to better him\nIt’s why we study, just to get money\nSo when we step to you, you won’t look at us funny\nEven the stealin’ and drug dealers\nThe pressure to just look appealin’\nSo you can look our way and we can get the feelin’\nAnd what do you think is the motivation?\nWhy a man will take another man’s nation?\nSame struggle, just on a bigger level\nFor us fellas, this is our peacock feathers\nAnd I’m not saying that women are to blame\nI’m just sayin’ if you didn’t give us any less to change\nWe’d change very quickly\nBelieve what I’m sayin’, maybe you’re the same\nIt’s always on the brain.\n\nLay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down.\nLay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down\n\nAnd don’t get me wrong, I ain’t knockin’ a bit of fun\nI’m just sayin’ when you’ve got a million sons\nAll over the gaffe and you don’t see one\nYou have to ask yourself, is it really fun?\nHow many homes you broke\nBecause the little head was stronger than the bigger head?\nAin’t enough we gotta get a bigger bed?\nAnd I ain’t sayin’ I’m better, fellas I’m never\nI’m sayin’ imagine we use that energy instead of just-\n\nLay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down.\nLay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down\n\nAll of the things that we will do\nIs all we try to get with you\nAnd all the nonsense that we say\nIn the hope that you will look our way\nAll day every day, it’s on our mind\nAnd when we stray we pay the price\nBut we take a chance and roll the dice\nAnd we just end up\n\nLay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down.\nLay down, face in the dirt\nFrom the waist down, chasin' the skirt\nSince the playground, sucka for a flirt\nNow ya lay down, face down", "year": null, "album": "DoubleThink", "image": "https://images.genius.com/1d372a1e5ce6759370053ad0e1be955f.1000x1000x1.jpg"}], "artist": "Akala"}