{"artist": "Wale", "songs": [{"title": "Everyblue Moon Open Letter", "year": "2014-01-22", "lyrics": "Where have I been?\nMan, I been everywhere. Everyday trying to get a better understanding of myself and this crazy game I have given my life to\nWhat I’ve come to grips with is the fact that I am not superhuman, BUT super human.  I think our culture has made it almost a prerequisite to be “too cool” or “swagged out” carrying a “nothing can phase me” image. It’s to the point that the ones who show they care, get attacked the most. Who ever thought we’d see a day when somebody used the word “poetic” as an insult? I certainly never thought that.  “I can’t fuck wit Wale ‘ol poetic ass.” Really? These are the same people who probably have every Pac album embedded in their head. But, I digress. I took an absence from Twitter because I started to care tooooo much. I still don’t know the root of what makes me care THAT much, but I’m quite sure it started by wanting to lead people in a direction that wasn’t as cliché as some of my peers\nI’m no saint. I fuck with ratchet bitches. I say bitch. I bitch about things my damn self. But, I can honestly say, that I try to use my “human” traits as a means of relating to other humans.  If I can bare my insecurities and flaws before you, maybe you won’t feel so insecure and flawed\nThere came a point where people went out of their way to remind me that I’m missin my mark. Albeit, I made myself a target to slander and criticism. I think it became a trend to fuck with anybody that cared about people’s opinion. I’m not one of those people who make music for material things. I strive to make music for a public that appreciates raw emotion. And I will continue to\nI went through stages of frustration in my career with publications because of my own selfishness and sense of entitlement. I admit that. Nevertheless, I think if we calling a spade a spade, some media outlets be on they bullshit with me for reasons outside of music. But, my goal moving forward is to focus less on THEM and more on US.  We all have goals and mine is simple. Empower the people. Empower MY fans and focus on MY fans and their energy . I don’t think it’s humanly possible for me to appease some of these outlets no matter what I create. It burns my soul to hear there’s no message tho. So knowin that I may have fell short of connecting with some of them,  I’ve decided to use my energy on US. The guy with all the mixtapes. The guy who listens to every song twice because they know there’s things hidden in there. The girl who can’t wait to hear “Ambitious Girl 3” (Oh, it’s coming). The girl with the “Ambition” tattoo, who gets dressed to “Illest Bitch Alive” every morning . The ones who understood my frustration, hated my rant but understood it nevertheless . I may never be the biggest rapper in the world (still one of the best doe) but, I’ll be the most dedicated to my fans and it starts with this right here. This is rare. This is REAL. This is about us. This is about the music again. My ReRE -Dedication to greatness. What we got doesn’t happen often, nor with too many people. This is an rare occasion when a rare bond… Happens\nEverybluemoon\n-Folarin", "album": null, "image": "https://images.genius.com/e0cde0eabe61c1ddca97cce2386792d2.421x421x1.jpg"}]}