{"songs": [{"image": "https://images.genius.com/6a5eb3b5745cef33a6eef1853f31cf28.737x426x1.jpg", "year": null, "title": "Jermaine Dupri Diss", "album": null, "lyrics": "[Xzibit]\nLadies and Gentlemen!\nThis is dedicated to the man we all love to hate\nTattoo a.k.a The Leprechaun a.k.a. Mr. Jermaine Dupri\nCome on ladies and gentlemen, sing a long\n\n{Randy Newman - Short People Sample)\n(Short people got) What! (no reason) Yeah!\n(Short people got) What! (no reason) Come On!\n(Short people got no reason to live)\n\n\nHaha fuckin' faggot...\n\n[Xzibit]\nIf ya So So Def then bitch get a hearing aid\nAin't worth ya gauge ya heart pumping lemonade\nHook, line and sinker ya took the bait\nAct ya age, not ya size, not ya weight\nEvery time you professional making hits\nWhy it always gotta sound like the next men shit?\nWent from Big to Puff to Snoop to Jay\nHey Jermaine who's dick you gon' ride today?\nCouldn't wait to get the green light from Dr. Dre\nNever liked ya fuckin' ass any goddamn way\nAnd I could care less if we label mates\nYour style been dead Columbia should drop the weight\nI got love for Da Brat get off Bow Wow back\nFuck you, fuck ya niggas that's writing ya raps\nWhat up lo get ya L.A. pass revoked\nDon't get me wrong Papa Smurf you won't get smoked\nBut ya might get robbed and choked\nOr you might disappear, kidnapped with no ransom note\nOff the leash, off the hook, off the chain\nFuck Jermaine you ain't gotta say my name\nSpeak now or forever hold a dick in ya mouth\nYou ain't the mayor, you don't run shit in the South\nScarface run the South, mafucka you a peon\nThe underage bitch in the Kelly tape getting pee'd on\nCock-eyed midget with a Napoleon complex\nNickelodeon fetish you represent nonsense\nHarlem Shake to that, high jump to hell\nYou the best in the business, I can't tell\nToo late to apologize kiss my ass\nWe about to cut your whole sound scan in half\nGot to keep your hands up homie protect yo'self\nStop fucking with the West nigga respect yo'self\nIt's a short ride to the top and a long way down\nLook Man vs. Machine about to drop now\nThis ain't no beef it's more like lunch meat\nLoss caliber heat let's take it to the street, mafucka\n\nHa ha...ha ha....ha ha.....ha ha ha ha ha ha....haaaa ha ha ha ha ha\nOh my god...yeah, yeah"}], "artist": "Xzibit"}