{"artist": "Westside Gunn", "songs": [{"year": "2019-02-20", "lyrics": "[Skit: Reporter]\nLegendary, iconic, and instantly recognizable\nFew people have dominated an industry the way Karl Lagerfeld has dominated fashion\nGriselda\nHis leadership of some of couture’s best known brands has established him as one of the most successful and charismatic designers of modern times\n\n[Intro: Westside Gunn]\nBrr\nKarl Lagerfeld\nTryna get money like that, nigga (Ayo)\nKarl Lagerfeld\nTryna get money like that, nigga (Ayo)\n\n[Verse 1: Westside Gunn]\nWoke up, bad, ‘Chine Gun pissed again\nShoot-outs broad day, fuck niggas missed again (Brr)\nAllahu Akbar, Allahu Akbar\nAllahu Akbar\nAyo, you ever had to taste it just to make sure it’s there? (Ah)\nWhole face numb, OT, 35 large, what’s the safe numbers?\nBroke it down, got the AP flooded\nFour in the baby, turned to nine, this shit made of tusslers\n5-Series Bimmers (Skrt), Pyrex beakers\nThe dogs might fall out if they sniff the speakers (Sniff)\nAll you heard was shots, you niggas screamed to Jesus (Brr, brr, brr)\nJesus!, blew his brains out, lord, nice to meet ya (Boom, boom, boom, boom, boom, boom, boom, boom, boom, boom)\nBlew his brains out, lord, nice to meet ya (Boom, boom, boom, boom, boom, boom, boom, boom, boom, boom)\nIf you see me, it’s a Gunn here (Ah)\nThe whole hundred shots, we go dumb here (Doot, doot, doot, doot, doot, doot, doot, doot, doot, doot, doot, doot, doot, doot, doot, doot)\nI’m from a city, ain’t no love here\nBut everybody know I love here\nUsed to steal out of Murphy’s up at Central Park\nIf we make a dime, rich lord, we ain’t getting court\n\n[Skit: Man 1 & Man 2]\nWhat if I was to tell you now that Jesus really don’t exist?\nThe fuck-, yo, what the hell you talking about?\nI just want you to calm down and talk to me\nWhat is you talking about, man?\nWhat the fuck you mean Jesus don’t exist?\nMan, it’s, what’s wrong with you, man?\nWhat’s wrong with you? What?\n\n[Chorus: Tiona D & Westside Gunn]\nSome shit never gets old\nYou know how the story goes\nKick your door and pour a large amount (Ah)\nTrash bags catch the shells from the pole (Brr)\n\n[Interlude: Westside Gunn, Man 1 & Man 2]\nBrr (What the fuck you mean Jesus don’t exist?)\nBrr, boom, boom, boom, boom, boom, boom, boom (What’s wrong with you? What the-?)\n(That was a trick by the white man)\nBrr, brr, brr, boom, boom, boom\n\n[Chorus: Tiona D & Westside Gunn]\nSome shit never gets old\nYou know how the story goes\nKick your door and pour a large amount (Ah)\nTrash bags catch the shells from the pole (Brr)\n\n[Interlude: Westside Gunn, Tiona D, Man 1 & Man 2]\nBrr, brr, brr (What the fuck man? Didn’t I tell you there’s something wrong with you, man?)\nDoot doot doot doot doot doot doot doot doot doot doot doot (’Cause Jesus always exist)\nTrash bags catch the shells from the pole (How the- how the hell you think all these people get like that?)\nBrr, ooh yeah (You think Jesus had something to do with that?)\nTrash bags catch the shells from the pole, ooh yeah (Christ, he made man, he made baby)\n\n[Verse 2: Keisha Plum]\nListen to this west side story\nRoots go back to Langston Hughes and Billie Holi-days of glory\nStarter jackets with gold around the neck all crazy\nWent from ‘90s Wu-Tang to Dipset, Purple Hazing\nMoney hungry villains on those hot summer blocks\nOur heart melted, mixing with the blood on the pavement\nShorty was turning tricks in her grandmomma basement\nTen years later, he did marble floors in her basement\nDapper Dan, YSL, matching 38s in the closet\nWhatever she could think of, he bought it\nHaikus hidden within the palms of man\nBuffalo’s story was always part of God’s master plan", "image": "https://images.genius.com/d6c49042f3cd32cffb7576f1fdfd9e65.500x500x1.jpg", "album": null, "title": "Karl"}]}