{"artist": "E-40", "songs": [{"title": "Bitch", "image": "https://images.genius.com/43cc1955c01c5556fda9d51868d1f070.499x449x1.jpg", "album": "Revenue Retrievin’: Day Shift", "year": "2010-03-30", "lyrics": "[Chorus: Vincent Tolan]\nNigga, don't act like a (BITCH!)\nThat's why I don't got love for a (BITCH!)\nOh, that's why Too $hort and E-40 say (BITCH!)\nSo homey, please don't marry that (BITCH!)\nAnd that's why I'll never be a (BITCH!)\n[E-40 - over last two lines]\nDon't do it!\n$hort holla at 'em\n\n[Verse 1: Too $hort]\nSee me, I get everything I wanna get\nI have some fun with it, and make her momma trip\nCause if I'm in her life, it's a problem\nA real player's at your girl, you better stop him\nTurn your back on the bitch she ain't actin right\nHe hit it way before you now he's back in her life\nWhat'chu gon' do when you lose her?\nShe got a nigga on the side just to use her\nIf it's me, I'm parkin at the front do'\nAnd you be knockin on her bedroom window\nYou see the shadows, you hear the sounds\nBut you don't do nothin you just turn back around\nLike a (BITCH!) Feelings hurt, ready to cry\nYou cain't believe, everything she said was a lie\nShe got a lot of bitch in her but not more than you\nI never underestimate what these whores'll do\n\n[Chorus: Vincent Tolan]\nNigga, don't act like a (BITCH!)\nThat's why I don't got love for a (BITCH!)\nOh, that's why Too $hort and E-40 say (BITCH!)\nSo homey, please don't marry that (BITCH!)\nAnd that's why I'll never be a (BITCH!)\n\n[Verse 2: E-40]\n40! Never sippin and slippin and skippin and drippin and missin (missin)\nThese cats that I be hangin around don't listen (don't listen)\nI be hippin and sippin and smokin and drinkin and spittin (spittin)\nAnd these musty mouth broads they be trippin (they be trippin)\nI mean the bitch thought she was bad (bad)\nI knew what that batch was thinkin\nWhen she thought what she was thinkin, but she shouldn'ta thought that\nI told her the money costs too much and I ain't got a dime\nYou got to pay me (pay me) or pay me no never mind\nI (I) don't sit on the toilet when I go piss (piss)\nYou (you) got feminine tendencies like a bitch (bitch)\nMe (me) I'm solid and concrete I keep it funky (funky)\nWe (we) we pull up in somethin, actin a donkey (donkey)\nShe (she) she liftin her dress up showin her monkey (monkey)\nSee (see) he trippin, he trickin, throwin her money (money)\nB (B) I-T-C-H, all in her face (face)\nE (E) 40 so laced, stay on the case\n\n[Chorus: Vincent Tolan]\nNigga, don't act like a (BITCH!)\nThat's why I don't got love for a (BITCH!)\nOh, that's why Too $hort and E-40 say (BITCH!)\nSo homey, please don't marry that (BITCH!)\nAnd that's why I'll never be a (BITCH!)\n\n[Verse 3:]\n[40] 40 Water, 40 Water\n[TS] Too $hort, Too $hort\n[40] Too $hort\n[TS] Short Dawg in the house\n[40] 40 Water!\n[40] Ay Sho't, you know what I been noticin?\n[TS] All bitches ain't women?\n[40] Mayne! All bitches ain't women mayne\n[TS] Nah nah\n[40] Some of these niggas man be actin like bitches mannn\n[TS] Yeah!\n[40] Female puppies man\n[TS] You already know\n[40] Look, get a real one in your life man\n[40] Get a real one in your life - that's what I tell a bitch\n[40] BEATCH!\n[TS] That's how we do it\n[40] Uhhh\n[TS] Fa'sho'\n[40] Niggas be actin like bi-tchess\n[40] Be-itch!! Female puppies mayne\n[TS] You bitch!\n\n[Chorus: Vincent Tolan]\nNigga, don't act like a (BITCH!)\nThat's why I don't got love for a (BITCH!)\nOh, that's why Too $hort and E-40 say (BITCH!)\nSo homey, please don't marry that (BITCH!)\nAnd that's why I'll never be a (BITCH!)"}]}