{"songs": [{"year": null, "title": "Damage", "image": "https://images.genius.com/8b24619eca032daebf0caa5c44aa746d.512x341x1.jpg", "lyrics": "(Chorus)\nI'm doing Damage (uh), Damage (uh), Damage (uh), Damage (uh)\nDamage (uh), Damege (uh), Destruction (terror), Motherf**ker say WHAT?\n(ONE) something's got to give\n(TWO) something's got to give\n(THREE) something's got to give\nRrrAArrrrrggghhhhhhh...\n\n(Verse 1)\nSage Francis is out of it. He done switched his tone\nCloset Alcoholics Anonymous, bitch, I drink alone\nNobody knows so I press on..\nI go to Fugazi shows requesting Minor Threat songs\nDrunk driving for Exxon. Don't slalom the icebergs\nIt's smooth sailing til the boat bottom bites curbs\nNo problem, but my sight's blurred. Don't serve me drinks\nBecause I'll write the words that make this whole world sink\nI'm bitter, sweet and sour, shit, I need to shower, shit and shave\nStuck to the TV and completely out of it these days\nI've got a CD. F**k the counterfeit DJs\nWho first fronted on our vinyl then bought Bounce off EBAY\nI'm sick of headwraps...they meditate on rhymes\nSwing lead bats...to elevate their minds\nGet back...Emcees ain't f**king righteous\nCraig Mack ain't never got his meat lumped like this\n\n(CHORUS)\n\n(Verse 2:\nI am a nightmare walkin', psychopath stalkin'\nNatalie Portman with a blank tape in my walkman\nTalkin to myself over instrumental cassettes\nThe essential steps of having graphic, telepathic mental sex\nMind f**k me or get the hell off of my head case\nSuck it up or spit it out. How's that medicated bed taste?\nI replaced the sheets. I love ripping off pillow cases\nBreaking teeth, shoving lip glass in your little faces\nLike that! \"Do you like that?\"\n\"If you had hands attached to your arms would you fight back?\"\nI hijacked your daughter's school bus\nDismantled ridiculous religions that supply Gods that you trust\nWhose plush style of living and senseless spending\nIs eh-heh-heh-heh-endinnnnnnng\nSage Francis manages bandages on cancerous mannequins\nStanding in pajamas with bananas and candid cameras\n\nDamage (Damage) You know what I'm saying\n(Damage) (Damage) Yeah, do it with me! (Every chance I'm doing damage)\nCome on y'all! (Damage) You know the damage (Damage) (SMILE FOR ME! - BRUISE YOUR FACE AND DANCE!)\n\n(Verse 3)\nThis music's got abusive roots, fists hit my face on rough nights\nYou think bruises are cute but, trick, you ain't my blood type\n\nSome strike the wrong nerve (the way they converse is weak.)\nOthers write with strong words (they can't build the nerve to speak.)\nVerbally inept except when subjects are expected\nPreconceived conversation styles. \"That small talk shit was written kid!\"\nCaught me. Watch me freestyle this bowel movement\nYou won't hear no \"ooohs\" or \"ahhhs\" when I choose to use no vowels STUPID!\"\nThought I was kidding when I wasn't, bitch?\nShit is HOT. Plumbers unclog my toilet wearing over mitts\nYour mommy thinks I'm dope...there's no pretending I'm not\nPut hockey sticks in your throat...from the penalty box\nEnemies jock while their girl shows athletic support\nHaving sex for the sport of it on basketball courts\nMaintaining my composure when game night is over\nAnd I don't strike a pose...I strike a poseur. Doin' DAMAGE\n\nI'm doing Damage (uh), Damage (uh), Damage (uh), Damage (uh)\nDamage (uh), Damege (uh), Destruction (terror), Motherf**ker say WHAT?\n(ONE) It's nothing wrong with me\n(TWO) It's nothing wrong with me\n(THREE) It's nothing wrong with me\nRRRAArrrrrggghhhhhhh..\n\n(Verse 4)\nI quickly enter your honey dip, strip ends from your money clip\nJoe Beats you to death with the shit end of his ugly stick\nFighting drama queens in the white college scene\nWiping pockets clean when we make them run their shit like soccer teams\nAfter they're chased with an axe...half of their face'll collapse\nYou ain't copped it when Non-Prophets dropped bass on wax?\nWell, I'm your typical hiphop political figure\nBut I'm not left wing OR right wing. I'm the middle finger\nAnd Joe's a sick, demented, jaded mind reader\nWho shoots the shit with a nickle-plated 9 MiliMeter\nWhen it's time to rock SHUT THE F**K UP\nI never had writer's block and Joey's never been in a production slump\n(Jump, Jump) It's totally worth it now\n(Jump, Jump) Don't listen when they say it's not\n(Jump, Jump) It always hurts coming down\nThis is MY house, you don't like it? Get the f**k off of my rooftop\n\n(Yeah, yeah, cousin? coming through your area, we're Non Prophets\nSage Francis on the lyrics, Joe Beats on production\nAnd my man DJ Mek-a-lek on the cut, bring it!)\n(ONE) It's nothing wrong with me\n(TWO) It's nothing wrong with me\n(THREE) It's nothing wrong with me\nRrrAArrrrrggghhhhhhh..\n\nI do damage\nEverychance I do Damage", "album": null}], "artist": "Sage Francis"}