{"songs": [{"image": "https://images.genius.com/6d9b19d023bc1a4aaf747cabf6d78531.467x467x1.jpg", "title": "Eghck", "album": null, "year": null, "lyrics": "[Verse 1 - Pusha T]\n\nIt go hot waist - Desert taste, four pounds of metal, tri-angle faceHesi-tate? Never, I'll put hole in whoever\nDon't make Push' Russian Roulette ya\nGamble with ya life\nChange came from cocaine I've measured\nWhite was the treasure, comfort was the steelI pedal to the corner like a child on a big wheelFlow more sicker, so much shake in the street\nThey measure my weight in Richter\nMake no mistake, I rhyme for the public\nBut still I push yay that make the ghettos quakeBy all means I've seen I've lived\nBy 22 years old, 50 thousand dollar vehicles I rimmedMy dreams start over the stoveI ran over the globe and back again\nYou seen em, five-ten, hair swingin, dark skinned\nGun on my hip like a sergeant\nWrist Green Power, Chris Tuck' in my watch\nAnytime the small hand move, it's Rush Hour\n[Hook]\nHomie you don't want no probs wit us\nCause we the type of dudes who don't think when we bustYou die (Eghck!)\nWhen you come close to\nAnd you get held back cause you're not supposed to\nYou die (Eghck!)\nWhen we roll up on dubsAnd get VIP all up in the club\nYou die (Eghck!)\nHomie I am a star\nAnd you might get hurt walking up to my car\n\n[Verse 2 - Malice]\n\nI offer y'all, 24 bars of rawLike eight balls in hard or soft\nTime I, push em off, they need help now\nCause I, flood the street with straight melt downAnd I'm not proud, in fact I hate this route\nThis the same game got my brother strung out\nSo I, count the ways that it fucked up his life\nSo I don't have a problem with upping my price, uhAnd who said the game ain't fair?\nA God damn loser!\nLook, just like chicks, them cats they be runnin' they lips\nWorried to death am I still in the Clipse\nWell, here's a secret bout me and the Clipse\nEven in my absence I'm still the shit ya dig?!\nEverything doing it big, from the cars to the home\nFrom the cash to the chrome, they can't say the game ain't grown\nDid they tell you bout the nine? I keeps me that\nAnd I don't ever fall off like Adebisi HatWhen times get tight, the coke game like riding a bikeYou heavy as me? Not in your life. Hang it up\n\n[Hook]\n\n[Verse 3 - FAM-LAY]\n\nSee me in a gold Hummer\nWith two ??? bitches that makes ???\nSomebody touch them, then I'm a bust them\nBoth hoes is accustomed\nTo getting coke through customs\nThey ain't' the average women would cut them\nTrey Eighters out the leather blazerPoint 'em at your Chevy BlazerThen bust holes in your Pelle blazerYou 'bout to ride in Hell's elevator\nYou got somethin' else to say to God?\nYou gonna have to tell him later\nTime is money\nDoubt none of y'all find this funny\nSee I ain't got time for dummies\nSo I keep the Nina Ross right beside the tummyAnd I'm leavin' with the scratch and the finest bunnyI'm so far from a million dollars\nIf y'all feel me, holler\nPut your drinks in the air, then peel your collar\nChrome wheel Impalas\nMake 'em bounce for FAM-LAY\nCuz your drunk ass might get killed tomorrow\nNarcs jumpin' out of U-Haul trucks\nLeavin' you all stuck\nBehind a park bench, balled-up\nSo I sleep all day, hustle all night\nLike a vampire\nBut I don't suck blood, I bust slugs\nLiquor got me trigger-happy\nI can tell that you a hater how you lookin' at me\nYoung boy, but I'll pop\n16 from a magazine\nWashing machine\nKill the first\nCop on the scene\nI'm stupid"}], "artist": "Clipse"}