{"artist": "Kid Capri", "songs": [{"image": "https://images.genius.com/3ab7e648317c8fc3f7e94ef00586a381.400x400x1.jpg", "title": "Billy", "year": null, "album": "The Tape", "lyrics": "We interrupt this program to bring you a special report\nWe are looking for a man named Billy\nWho has just been accused for use of fake credit cards;\nUse of UPS trucks; and trying to sell crack\nTo an undercover token clerk\nWhat is this world coming to?  Well I'll tell you\n\nYeahhh his name is Billy\nNow let me tell you about this guy right here\nBust it\n\nA brainiac, con artist to the 'T'\nAble to geese, you and me\nTalks like a psychotic pimp, walks with a limp..\n.. but he's a wimp!\nMastermind of the computer world, he lives\nWith his wife and a cute little girl\nNow this is the story of a family\nAnd the man of the family, huh, his name was Billy\n\n\"Yeah you know that guy named Billy\nHe was always conning somebody\nHe was always getting away with murder word\"\n\nHis name was Billy!\n\n\"He tried to have Moet tossin Olde E money\nI ain't tryin to have that\nBut let me tell you about this\"\n\nOhhhh, Billy Billy Billy, whassup for today?\nHa ha!  Tell me, did you ever find a way\nTo make that money real quick - well I got an idea\n\"So what's the idea?\"  Computer chip!\nHere's a job, some numbers, two credit cards\nWe'll split it even, but here's the odds\nTwenty to one, Who's Harry Crumb?\nHe's a big fat man which he carries a fat gun\nNow Billy, a smooth operator\nSneaks out his door, a to the elevator\nGets on the sixth, and gets off on the fifth\nThen heads out the building with\nHis little pocket knife in his hand\nShow em you're a man Billy.. understand?\nA few people try to mug him, crack dealers love him\nDelivery boys think highly of him\nUnited Parcel, very colossal.. UH!\nSometimes he get a bit hostile\nDon't even care, if people stare\nHe gets his package look around, then he's outta there!\nWell a-nother day, a-nother dollar\nDon't wanna do it, boy but he's gotta\nA diamond to sell, three point one carat\n\"So what he did?\"  Sold it to the first floor faggot\nNo real money, one and a third\nBut the brother's gonna get, as high as a bird\nBell bottoms, yes the man invented the slacks\nOld fashioned turn them naked pointy shoes with spats\nHe got the limp to his walk, hat cocked just right\nWalkin down the block, lookin like, Willy Dynamite!\nThis man is amazing, he does a lot\nHe can tell you what he can do, and what he can not\nHe get you radios or TV's, clocks and beds\nHe's gettin, twenty to life once he's caught by the feds\nHis name was Billy\n\n\"Yeah my man went and got her credit card\nBought my man a Pathfinder Jeep, word up\nI ain't actin like we ain't been down\nKnahmsayin?  He never get love from me\nAlways tryin to con me but I ain't goin for it\nWord\"  BREAK IT DOWN!\n\n\"Tell em what you want Kid Capri\"\n\nMan I need a VCR, really (really, really)\nI thought you was going to lookout, BILLY\nYou told me to be here six o'clock\nBy that time, you said you'd be ready to make the drop\nWell I guess you're fronting again\nWhen you gonna be on the up and up my friend?\nYou keep conning, you better chill!\nCause a brother like me will squeal.. on Billy!\n\n\"He did it, he did it!\nWord up man I'm squealing on him man\nHe tried to front on the Kid Capri, word\"\n\nHis name was Billy!\n\n\"Ain't no way in the world I'ma let that go\nLords of Funk ain't tryin to have that!\nKnowhatImean?\"\n\nHis name was Billy!\n\n\"Man you need to grow up before you blow up\nYouknowhatI'msayin?\nStop tryin to play high post with a low income\"\n\nHis name was Billy!\n\n\"I ain't havin it..\nNow before you think about doin it\nLet me tell you this!\"\n\nDon't mess with Bill (no no-no no)\nDon't mess with Bill (uh-huh)\n\nHis name was Billy!\n\nUh-huh, mmhmm, ah-hah, mmhmm\nAh-hah, mmhmm, mmhmm, mmhmm\nAh-hah, mmhmm, ah-hah, mmhmm\nAh-hah, his name was Billy\n\nI think Billy learned his lesson\nJust leave that crack alone!\n\nI'm outta here"}]}