{"artist": "Knoc-turn’al", "songs": [{"image": "https://images.genius.com/6fade8c4fc0be289776bb35d74635cf6.640x640x1.jpg", "title": "What We Do", "year": null, "album": "The Way I Am", "lyrics": "[Xzibit] [Hook]\nYeah\nWelcome!\n\nSummertime in sunny California\nYeah, palm trees, the beaches, the bitches\nIf you from outta town, we got rules and regulations\nYou follow these rules and you go home fine\nYeah, until then, enjoy yourself\n\nYeah, it's how we do\n\n\n[Xzibit]\nFor My nail shop Bitches\nMy hair shop bitches\nThat don't come outside until they look vicious\nMy blue rag niggas, my red rag niggas\nLet's all unite and make the west coast bigga\nBring your chrome out, shine it up\nEscalades to Impalas, Line 'em up\nLet's bounce to the beach with a bitch or two\nYou can ride my shit, let me spit for you\nThis California livin' is the best on earth\nThrow your hands up, represent your turf\nOpen bar, all night drinks for free\nJust sing Knoc-Turn'al from LAC\nBig D, in a brand new SUV\nNate Dogg got the bomb that he passed the G\nLike it's supposed to be\nLike I'm close to me\nLike it's planned to be\nLike a Family\nCome On!\n\n[Nate Dogg] [Hook]\nWhat we do (What We Do)\nEvery day (Every day)\nThey try to (They try to)\nBut they can't (But they can't)\nSame bullshit (Same bullshit)\nDifferent Day (Different Day)\nWarren G (Warren G)\nCan You Come Back To Me\n\n[Warren G]\nSometime it's hard to get a grip on what's really goin' on\nWhen your days getting dark and your nights gettin' long\nAnd everyones tryin ta hit a piece of these streets\nI got beef wit OG's, my PO and Police\nPlease - how can I explain to these suckas\nHow I made motherfucker, come off nuthin\nIt wasn't my fault I went platinum off the gate\nLookin at me, I'm...?\nNiggas better practice patience\nFall back and step with all that act and anxious\nThank You\nAnd you can see it on the face of the kids\nWhen they recognize me for all the hits that I did\nWho do we love, Nigga\nG Dubb Nigga\nCan't stay away I make a hit each day\nAnd just so you know nigga the hits won't stop\nSo I'm putting in work till I fill my spot\nCome On!\n\n[Nate Dogg] [Hook]\nWhat we do (What We Do)\nEvery day (Every day)\nThey try to (They try to)\nBut they can't (But they can't)\nSame bullshit (Same bullshit)\nDifferent Day (Different Day)\nKnoc-Turn'al (Knoc-Turn'al) (yay)\nCan You Come Back To Me\n\n[Knoc-Turn'al]\nEverybody want to know what's crackin wit Knoc-Turn'al\nGhetto Street narrator with an LA journal\nNiggas Got 6 4's hot enough to hop hurtles\nOn G's it's the colour purple with a tight circle\nDifference is in the have and have nots\nWe have eaten, you have not\nBlast and stuff Glocks back and stash spots\nAss, tits, and hips, she got a whole lot\nKnoc ain't never dropped the dime info or ho\nWhether I know or don't know an info\nEven if I know where kilos of coke flow goes\nI ain't never told a soul, my soul for no dough\nWe gangsta, fuck pop and go-go\nI'm a bow-low, any man woman or beasted bro's against the west coast\nLAC, Handle 'em\nI don't need shit but I might get some magnums\n\n[Nate Dogg] x2\nWhat we do (What We Do)\nEvery day (Every day)\nThey try to (They try to)\nBut they can't (But they can't)\nSame bullshit (Same bullshit)\nDifferent Day (Different Day)\nWarren G (Warren G)\nCan You Come Back To Me"}]}