{"artist": "Casey Veggies", "songs": [{"title": "R.I.P.", "album": "Live & Grow", "year": "2015-09-25", "image": "https://images.genius.com/e4635c8f2676255ecd4610e6ea16dd52.1000x1000x1.jpg", "lyrics": "[Verse 1: Casey Veggies]\nTake a drink, take a toke, young niggas ain't got no hope\nOr maybe it's deep inside but they just too blinded to know\nR.I.P. my nigga ghost\nLivin through that Live & Grow\nGrew up on Centinela & Beach, yeah right there by that corner store\nRight there where them niggas post, drug dealin and blowin drow\nPo-Po come we gotta go, we no-no talk to five-o\nBut as a young black male dude tryna dodge a cell\nBut I'm always followed by them cops lights\nThey got me livin' in a cell, tryna put me in a box\nBut I'm bout to break out this shit is not right\nMy nigga Tyler told me now we in the spotlight\nThe time is now and nigga tell em what your life like\n\n[Verse 2: Tyler, The Creator]\nIt's great, I'm just bein' honest\nWhen the green is coming like I’m mowing the lawn\nFuck the censor nigga you could use some commas\nThe numbers don't add up boy you want greatness\nDr. Right now mothafucka we hate patients\nNow put your hands up like them niggas that didn't make it\n\n[Hook: Tyler, The Creator]\nI can't deal with the fact that you gone\nMomma cryin family stayin strong\nI can't deal with the fact that you gone\nMomma cryin family stayin strong\nRest in Peace my nigga\nRest in Peace my nigga\nRest in Peace my nigga\nRest in Peace my nigga\n\n[Verse 3: Casey Veggies]\nPNC the recipe\nThank God that we blessed the streets\nCarrots and the Peas is gone but I continue the legacy\nIt's some niggas still alive but in my eyes they dead to me but I forgive and I forget and now they distant memories\n\n[Hook: Tyler, The Creator]\nI can't deal with the fact that you gone\nMomma cryin family stayin strong\nI can't deal with the fact that you gone\nMomma cryin family stayin strong\nRest in Peace my nigga\nRest in Peace my nigga\nRest in Peace my nigga\nRest in Peace my nigga\n\n[Outro: Casey Veggies]\nThis song is dedicated to anyone who's lost their lives\nWhether it be the police brutality, gang violence, brothas killin brothas\nMoment of silence for Trayvon Martin, Mike Brown, Oscar Grant\nRest in peace\nMay you live forever"}]}