{"songs": [{"year": "2004-10-19", "image": "https://images.genius.com/d6fd033db31db720da7b9183bf57cc98.591x591x1.jpg", "title": "Hey You", "album": "Colton Grundy: Tha Undying", "lyrics": "\"Hey!, Hey bitch! What the f**k?! You can't hear or something?! Hey look ho, you looking for a motherf**king thug?\"\n\n(Chorus 2x)\nHey you (Who me?)\nThat's right (What's up?)\nLet's go someplace, so I can lace you up\nI need a thug bitch, about as raw as they come\nHold me down, hold my dick, cover my shit, it's on\n\n(Blaze)\nHey love, do them titties got a name\nThis is dead body game let me see you shakin' something\nI ain't impressed by hoes with attitudes\nI'm impressed by the way them hoes is mad at you\nI ain't spending honey real G's don't shed funds\nI ain't sensitive like Brian McKnight, I'm tryin' to f**k\nRemy and Coke, dick all in and out of your throat\nUntil that bitch started to choke, no joke\n\n(Chorus 2x)\nHey you (Who me?)\nThat's right (What's up?)\nLet's go someplace, so I can lace you up\nI need a thug bitch, about as raw as they come\nHold me down, hold my dick, cover my shit, it's on\n\nHey bitch, do your momma know you outside\nHanging in the passenger window, of my hoo-ride\nAnd I can barely see the ass, stacked off in the pants, and she talking real fast\nThe bitch kinda smelt like fish and chips\nBut boy did she have a set of dick sucking lips\nTold her what she wanted to hear, so I could get all in her cat\nDead homie all up in her cat, now picture that\n\n(Chorus 2x)\nHey you (Who me?)\nThat's right (What's up?)\nLet's go someplace, so I can lace you up\nI need a thug bitch, about as raw as they come\nHold me down, hold my dick, cover my shit, it's on\n\nHey bitch hoe, I need a thug bitch hoe\nWhat's you say you let me keep a hold of all your bankroll\nI won't spend it all in one place\nAnd I can shoot a load to cover your whole waist\nAll up in your face like a true thug\nAll in your shit, in my eyes you only worth what you come with\nI want shit like your pockets\nBut what about the 'dro?\nCome on you know I got um\n\n(Chorus 2x)\nHey you (Who me?)\nThat's right (What's up?)\nLet's go someplace, so I can lace you up\nI need a thug bitch, about as raw as they come\nHold me down, hold my dick, cover my shit, it's on"}], "artist": "Blaze Ya Dead Homie"}