{"songs": [{"year": "1996-09-16", "image": "https://images.genius.com/64198f65a7d361887099b56d559b01b6.600x600x1.jpg", "title": "Recognize and Realize", "album": "Episodes of a Hustla", "lyrics": "Intro:\nExtrordinary. Extrordinary. Yo (alright)\n\nBig Noyd:\nThe trife life of living famous bustin' shots live it's dangerous\nIn midnight we do it right in clear blue light\nThe trife life rough wearin' handcuffs like bracelets\n25 to life we faced it\nGot on the run and got wasted\nMad agony havin' me more vexed\nGot me pullin' out techs on opposite sex (uh)\nThe cream got me fiend (fiend) for masterville scheme (scheme)\nLike doin' drivebys in stretched limozeens\nI got tons of guns (uh) my niggas on the run pack the nickel plated ones\nGet the cheddar however dun cause niggas got dreams\nPainted king the drug sling got they brain drained\nJust to sling cocaine continusly seriously\nMy brain blunted the lye done it\nWe makin' hundreds that's all we wanted\nTo see my ill mean team seein' cream\nThe Infamous comin' outta Queens\nYo check it check it\n\nProdigy:\nYo it's the Pee me and the N.O.Y.D\nWe put the chedda togetha so we can double the o.z.s\nIt grows like some family trees and beanstalks\nSome hustlers naturally born with street smarts\nYo Karate it's you and Gotti y'all lift the weight\nMe and Noyd'll Gem Star it down on a plate\nThe Mobb niggas living wild inside of New York state\nThe five gates, if a nigga is shook let him shake\nWhile the coke back\nChef trip cook a boulder over the shoulder\nWith the wonders with they hands in pot holders\nSoloist get rolled over\nRappin' Noyd takin' over you crossed over\nThen you bucked in October\nNovember, December came out the hospital keyed up\nParalysed from your feet up now slow ya speed up (uh)\n\nHook:\nBig Noyd:\nSo recognize and realize I'm not the nigga lied\nOn the side of me Prodigy on the strength of who he be\n\nProdigy:\nSo recognize and realize I'm not the nigga lied\nB.I.G. N.O.Y.D. he rip it constantly\n\nBig Noyd:\nI stay cool and causous with extra sources my nine Taurus hit bosses\nLuitenents who's ever in it\nOnce the main man drop I got it locked to take it all why not?\nDon't let that nigga Noyd get the drop I'm comin' steady heavy\nReady to murder pullin' triggers (triggers)\nSoon to be famous dangerous type of nigga\nI'm type crucifix definatly true to this\nThe natural born hustler Noyd finessin' it\nUse to hustlin' tustlin' bustin' niggas wide open\nNo Jokin' like Rakim you must be smokin' (uh)\nTo fuck around with this you try to compare you didn't hear?\nThat nigga Noyd is extraordinar nigga what?\n\nProdigy:\nPioneer this extra ordinary rap flow\nSneek peek my Mobb style we clapped at your rap show\nWe formulate juxes, debatin' like some politicians\nAnd come together like some coalitions in position (wooo)\nMy team'll huddle, your scheme was too subtle\nOur crews cross paths, your whole squad face get bubble\nLookin' for trouble, afraid so you found a couple\nMe and rappin' Noyd blastin' off like NASA space shuttle (uh)\nProdigy my powers refined now they erupt in time\nFor climax you small cats what is you touchin'?\nWe complex, your man got slapped just off of reflex\nLearn from his mistake so avoid from being next\nHoliday thugs occassionally act like thugs\nBattery backs with Alkaline and Duracell mugs\nA-yo Noyd these niggas must be on some powerful drugs (crazy son)\n(word up) Don't fuck kid word up\n\nHook (x2)\n\nOutro:\n(Word up) No doubt nine pound, we get down (the rappin' Noyd) Prodigy on\nThe side of me (the rappin' Noyd) uh uh (the rappin' Noyd) Prodigy (the\nRappin' Noyd) on the side of me. Prodigy, on the side of me. Yo we out"}], "artist": "Big Noyd"}