{"songs": [{"album": "Shut Up And Rap", "image": "https://images.genius.com/22af45710b74abb23f51b1a75a855114.1000x1000x1.jpg", "year": "2014-12-09", "title": "I’m Good", "lyrics": "[Hook: Kanye West (Scratched)]\nLike we always do at this time\n\n[Verse 1: Michael Christmas]\nI said squaaaaad the fuck up\nHit my nigga [?], tell him pull the truck up\nFinna fuck that bitch that said I couldn't do it, actin' stuck up\nMy niggas put the drugs up, we used to put our lunch up\nBettin' on the Pokémon battle or wrestling matches\nFoggy glasses, I step off the stage, proceed to laugh\nHow I get this far? Give a year, how you get this cough?\nSeventh grade, how you get them bars?\nI am confused, I hate these dudes that ask questions\nLeather pants kickin' birds out feather vans\nWatch quadruple Ks, Keenan, Kel and Kim Kardashian\nAnd fucked her man, and fuck your fans, and fuck your friends\nI'm with some old bitches tryna fuck again\nCause I'm a different nigga, I got a different plan\nTomorrow never promised me nothin' but bein' broke\nAnd all I ever wanted was extra sleep and some dome\n\n[Hook]\n\n[Verse 2: Astro]\nWhile y'all fad follow, I'm tryna up my dough\nSuch a star, I'd probably get boo'd at the Apollo\nI spit sick swallow, then dro'd up\nI know when you know I'm pullin' cards like Uno\nCrew so real that we ain't gotta deal\nLong as the block think it's hot then we got mass appeal\nPut a fork in the pitch and if y'all ain't with it, we ain't bitchin'\nSome only feel the heat when it's money in the kitchen\nRippin' tracks like it's for my freedom\nThe don, what you thought, y'all could beat him?\nIf rap's a sport, I [?] like Derülo\nSharp like a vato, lines over your culo\nI kick shit 'til the flavor is good\nY'all spit rich shit but still live in the hood\nI don't own leather pants, never dance\nThe Nae Nae's a no no, I might hit the Shmoney on the low though\n\n[Hook]\n\n[Verse 3: Termanology]\nIt's the sultan, sittin' on the throne made of diamonds\nPolyester robe with the linen in the linin'\nGold microphone trap the words I'm designin'\nYour girl give emoji red hearts when I'm rhymin'\nHelicopter rise with my Js swingin' in the wind\nIf I'ma make it rain, it's for the kids in the tenements\nWe givin' out turkeys in the winter\nRap Robin Hood, make sure every lil' kid get a dinner\nThe Mustang peel out, smoke like 9-11\nRhymin' legend, time again and time again the comp is shredded\nFeelin' like Kane in '87, the greatest ever\nGrew up in the '90s, to me that was the greatest era\nGive me a mic, some turntables and some speakers\nFor me it's like a fully packed church to the preacher\nKnowledge reigns supreme, 'Ology the new teacher\nAnd I brought some new killers with me rhymin' on the features\nJesus\n\n[Hook]"}], "artist": "Termanology"}