{"songs": [{"title": "Insert Truth Here", "lyrics": "[Intro: Akala]\nTruth\nWho knows it?\nDefinitely not me\nAnd they say they do?\nThey ain't said shit\nLook at their attitudes\n\n[Verse: Akala]\nWho Knows what the truth is\nCos when im stupid enough to claim the exclusive\nRights on nulling of the facts, bullshit\nIts just another attack, causing\nYou to be pushed to the back, move it\nIf you accept that you lack, prove it\nSkill's of your own\nAre you groaning\nYour tone\nIn your phone\nGonna add your pay to poem? homes?\nAccept my definition\nOf yourself then your in my prison\nWhos reality's\nGradually\nHaving me\nCasually\nCan you fathom the insanity\nOf believing the truth is held by a few\nAnd it ain't me or you\nAin't no truths just points of view\nIf it ain't known then is it still true\nAnd If God made scriptures?\nCan you tell me?\nWhat language did she write in?\nAnd if she picked one, out of the thousands?\nHow is that enlightening\nFor those that dont speak the language\nHow they gonna understand it?\nOr is god that underhanded\nThat he'd act just about as dumb as man is\nPeople just wanna feel important\nReporting ideas of the truth extorting\nThose without nothing are the ones that brought in\nLook at religion its almost deporting\nHard to admit that the world we're brought in\nWe ain't got a clue what the fuck the force is\nThat makes uncountable stars in the cosmos\nEasy like a painter doing odd jobs\nAccept that we dont know whats what\nAll gonna die anyway so whats lost\nGood, bad, heaven, hell\nJust ideas that are sold so well\nBy all the people with power and privilege\nTo trap us in fear, living like invalids\nC'mon look at the BASTARDS like\nTelling you to wait for the afterlife\nThey Ain't gotta live with half the strife\nFuck turn the other cheek, hardest strike\nFor anyone that tries to take your power\nAnd use it in their way selfish\nNah,  fuck these cowards\nYou're as divine as anybody else is\nAnyone that tries to trouble your loved ones\nThat is the time and the place that you can buss guns\nNumb fucks livin' off trust funds\nGot us down hear struggling for nuff crumbs\nPeople end up dumb, killing over lump sums\nLook how quickly we become accustom\nTo picture the paper that's pretty\nThe price of a tenant to live in the city\nLife were defending has ever been shitty\nThey write all the endings and never been with me\n\nLook what they feed us, leaders\nProphets a profit, think that they're Jesus\nDid Jesus ask for a church collection?\nOr drive a rolls royce with a turbo engine?\nLines in my voice and the words i mention?\nInspired by choice that of false pretension?\nBlinded by noise of the poise of pension\nSang with my boys we are music henchmen (?)\nSee? the truth i mention\nBeyond my own comprehension\nSee? the truth i mention\nBeyond my own comprehension", "year": "2012-05-01", "album": "Knowledge Is Power Vol. 1", "image": "https://images.genius.com/95f4dbc07c7455e0bbf14b55f99cc7a0.918x1000x1.jpg"}], "artist": "Akala"}