{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "Overstand Me", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "[Hook: Pimp C]\nEverybody rapping like they ballin and they rich\nI see 'em in the streets, I ain't believing they shit\nEvery-everybody rapping like they ballin and they rich\nI see 'em in the streets, I ain't believing they shit\nEvery-everybody rapping like they ballin and they rich\nI see 'em in the streets, I ain't believing they shit\nIf they diamonds ain't shinin and they rollin K steel\nWhile I'm grippin on the grain, sippin lean, and poppin pills\nEvery...\n\n[Pimp C over Hook]\nCheck one two, one two, bitch!\nI see your lips quivering but I don't hear nothing!\nKnalmtalkinbout!?\nMan these niggas is Mr. Magoo man\nUh!!!\n\n[Pimp C]\nEverybody wanna be on some \"Superfly\" shit (shit!)\nBut I'm the closest thang to Priest that you gon' see bitch!\nI'mma pretty yellow nigga, keep my finger on the trigger (trigger!)\nY'all know the score, Polo FUCK HILFIGER! (fuck Hilfiger!)\nI see you niggas on the slab, ya jewelry lookin funny (uh!)\nY'all ain't seeing no rap or no +Dirty Money+ (Dirty Money!)\nI be in the streets lettin my nuts hang (hang!)\nBoys wanna 'bang bang', nigga it ain't no main thang (main thang!)\nCoward niggas makin death threats (death threats!)\nI leave ya pussy and ya chest wet (wet!)\nI ride around in P.A. one deep in a Bentley (uh!)\nBitch if you 'bout it, come and fuck with me (fuck with me!)\nBut bitch you better bring an arsenal (uh!)\nBecause if you miss me you ain't gon' make it to the hospital! (bitch!)\nAnd if ya hit me, they gon' kill ya family\nPussy nigga ain't gon' win, bitch do you overstand me?\n\n[Hook]\n\n[Trae]\nEverybody actin like they ballin in this bitch\nUntil a nigga get up outta the drop and simply fallin on that Benz\n83's, I'mma swang a swanger, with ice the price of a house\nAnd I'm the truth, muthafuck the rest, look at this 30 in my mouth\nYou in the presence of a playa, keep yo' cool cause I might go off\nWhen I hop out, suicide roaring Gators, fuckin yo' toes off\nAnd I walk with a attitude like, \"Fuck them niggas, they can't see me\"\nI guess they love to ride my dick cause they watchin me like I'm TV\nWhile these niggas out here rapping and capping 'bout what they got\nOr be the reason they get punched in the mouth and ran off the block\nI ain't gotta say I'm ballin, bitch you see it on my wrist\nGrippin grain, VVS on my fist and these haters pissed\nThey ice don't even shine like the watch that I got\nThen again they never seen the size of the rocks that I got\nNow getcha mind right, nigga you a simp\nReal recognize trill, so I'm fuckin with the Piiimmmppp!!!\n\n[Hook]\n\n[Chamillionaire]\nI ain't believing that... knalmtalkinbout, let's handle business baby!\nYeah... grippin on the grain (you know what it is!)\nGeyeah!!\n\nYou ain't the truth and I'm talkin to you, ya jewelry sho' actin funny\nGet it appraised for less than me when I'm wearin no ice ya dummy!\nBetter not think ya thinkin of ballin cause ya showed up at Johnny\nWrappin them hundreds on top of ones like it's a whole bunch of money\nMy golds white and sunny, you equivalent with \"it depends\"\nWhether or not you knows the seventy thousand dollar difference\nFix ya lens, getcha spend, ya game been up and still pretend\nThat ya spend, dividends, don't pretend that yo' whip's a Benz\nYou talkin 'bout they slang and even got no thang\nNiggas be talkin 'bout they swang and even got no swangs\nSpent my broad, leave a complaint, I ain't gon' charge her to the game\nTellin that ho to release a Visa, then I'mma charge her for a ring\nMe and Pimp be ridin candy 'llac, that's a Cadillac my nigga, matter fact\nAnd I sold it to 'em, plus he had a track\nSo he grabbed the deck and then he added that\nThem boys was frontin like they had the stacks\nSo my nigga told me that they had the Jag\nI picked the phone up and I handled that\nThat's multi-jewelry, let 'em have it back\n[Hook] - repeat 'til fade", "year": "2006-07-11"}]}