{"artist": "Andre Nickatina", "songs": [{"title": "Mind Full Of Hatred", "album": "I Hate You With a Passion", "year": "1995-04-19", "image": "https://images.genius.com/caf6d8331e5ef8bd79cb75fa64fb6144.1000x1000x1.jpg", "lyrics": "I don't wanna cry no mo so it's on\nU caught up in the mode of the new Jim Jones\nProblems in the world make mary jane a hit\nYoung mothafuckas gettin raised like pits\nNigga can you feel the hatred, I want you to die\nCreepin bolo, always solo, chewy got me high\nMy eyes are low, my heart is cold, my stare will cause you pain\nMy niggas, man they want the dank, these white girls want the caine\nProblems in the world make niggas wanna kill\nSo I slang my rope just to make a joint to break you off the real\nFoul rat daddies make my mind go smash\nNiggas smoke all day, but still about they cash\nAre u a killa, or are you a fake ass nigga (nigga)\nDirty like a worm (worm), slimy like a caterpillar (caterpillar)\nMind full of hatred... killa! (killa!)\nAnd if they don't come, go n get em! (go get em!)\nIt's like world war 3 in the mothafuckin zone\nAnd anything goes when street lights come on\nAnd I'm sweatin, every nite sleepin no noise\nAlways mad, never glad, indo brings me joy\nSo lay down to your mothafuckin nemesis (lay it down)\nYou say u caught me? then I'm a ask for witnesses (witnesses)\nIt's like enter the dragon, I creep like bruce\nCallin all cars, cop/got killa on the loose\nOnce in my scope, there ain't no hope, cause I don't care\nYou walkin now, but when u see me, picture wheel chair\nBecause my bear hug be fuckin off your vertebrae\nAnd now you lookin like a cat on the freeway\nYou start actin like a child and I'm a call you 'son'\nYou try to play me like a bitch and I'm a cut yo tongue\nAnd I ain't ever met a nigga that ain't lied about pussy to this day\nBut I ain't trippin, mothafucka roll a J\nCause I don't give a fuck, nigga what's the score\nI got mines and nigga, I want yours\nThey rat head mothafuckas get government cheese\nAnd get the full extent of punishment by any fuckin means|\nSo I'm livin like a dope dealer poppin in his prime\nAnd example mothafucka that had dope came in '89\nIt's like FUCK YOU MANE, CRACK COCAINE!\nThat one hitter quitter done got yo brain\nNow it's only poppin, there ain't no stoppin\nMoney comes first nigga bodies start droppin\nNiggas get hit like they comin across the middle\nCause I ain't got no time for no mothafuckin riddle\nCause bullshit walks, and money talks loud\nSmilin shows weakness, so niggas don't smile\nMind full of hatred, gone off dank white\nNigga I'm head huntin, mothafuck yo life!\n[VERSE 2]\nIt's like peeka boo peeka boo, nigga I see ya\nBut what I got for ya foo, I wouldn't wanna be ya\nThe 6'6 killa whale's in the cuts, like starsky n hutch\nAnd I'm puffin on skunk. so nigga knuckle up and your grill u better guard\nCause I'm a try to stick you like a snitch on the yard\nI walk my walk I talk my talk and sometimes I mite give orders\nDeceptacons, get ready to roll on all these transformers\nCause niggas don't care, they takin chewy to the brain\nMind full of hatred, off that caine to the face\nBow down u little bitch here to taste\nRespect gets? like staggitory rape\nAnd it's on, voices goin off in my dome\nSteady gettin high in my caddy all chrome\nCHIT CHATTA! mothaf*ckas really don't matter\nNiggas get beat like pancake batter\nCracked like egg, fried like pork\nI got niggas runnin east, west, south, n north\nLike a compass, yo life don't mean shit to me, f*ck it\nMind full of hatred smokin chewy in a bucket\nThese cockaroach f*cks get eat like fish\nSkinned like shrimp, beat then lynched\nCause foolin ona reef shit n foolin ona bird shit\nAnd all that other bullshit Dre Dog is not concerned with\nF*CK EM\nF*CK EM"}]}