{"artist": "A$AP Ferg", "songs": [{"title": "How To Rob The Mob", "image": "https://images.rapgenius.com/b8fd85fa80c96f1f68105634826d85bf.500x500x1.jpg", "album": null, "lyrics": "[Verse]\nFeel like Fifty after them bullets had a party\nAll I want is revenge, these rappers getting hommied\nWe could get it shaking like Muhammed Ali\nMight take a shot at myself like Pac in the lobby\nBut I will never shoot myself, no Cheddar Bobby\nBut I’m getting cheddar ‘cause my flow crack like Bobby\nNot from Miami, but I roll with a shower posse\nTeena and Kalani who’s pussy you’ll get Dasani\nTwo credit cards scheming bitches from Brooklyn, kinda grimey\nTheir pussy’ll get wet if you’re even talking about money\nFlatbush finest, your royal highness\nWe supposed to be scheming, but them bitches stay the highest\nBitch, why don’t you pay attention to the plan?\nFirst you can get Nast ugly ass then go after Yams\nAnd Addy think he a gun boy so I’m gon’ watch his hand\nAnd Dominic Lord was his best friend so I’m gon’ watch his man\nHe got kicked out of A$AP early on ‘cause he was schemin’\nTelling record exec’s he started this, you wouldn’t believe it\nI stay on top of my game, my foot stay in the pivot\nAnd Bron Bron still a don you other niggas was cheatin’\nBumping y'all gum, you little niggas is teethin’\nSpit Miami Heat and you little niggas is steamin’\nTell Rocky that I’m cocky, I’m going off for no reason\nTwelveyy going off for no reason\nY’all might hate me, I’m going out with no treason\nNo, I don’t smoke, don’t hand me no trees then\nDon’t care about molly, don’t give a fuck about leanin’\nJust wanna throw bullets, I’m feeling like Willy Beamen\n\n[Outro]\nFerg, Ferg, Ferg, Ferg (chant)\nAy listen, I do this shit for a living, you know what I’m saying?\nI went to Art School and shit\nGrew up in the hood, the gutter, you know what I’m saying?\nMy pops was that nigga\nI’ll write for anybody\nI’ll write for a girl, the niggas, whatever, I don’t care\nI do this", "year": null}]}