{"songs": [{"image": "https://images.genius.com/6aeff215c84a7c7d4b7e8de5b9f5c4c2.480x360x1.jpg", "lyrics": "[Intro]\nOkay, now i'm offended\nDid you just say you can't sing along to triple F tits?\n'cause that's bullshit. Check it out\nGirls with triple F tits need love too\nAs long as they're real like the Moon Landing\nAnd they are not fake like Kung fu\nJoe, next time i'm in LA, you will have to let me come through\nCome on baby, we gotta do another podcast together\nThe streets need this\n(Triple F's!)\n\n[Verse]\nI'm flipping a fuckin' fast flow for Ari & Joe\nMy flow is freezing and it's frigid like it's forty below\nFatally fucking famous figures up like Fentanyl\nIn four doses\nI finger fuck a French freak in my Ford Focus\nIn February, I fap to fitness females\nFuck foodstamps, you're fat from fixing free meals\nFour thousand first place finishes in Fortnite\nI finished Floyd in the first, I'm just being Forthright\nFREAK PARTY Fool, Fly the flag with the fifty thieves\nFFF flow\nI hit harder than GGG\nFly to France and feast on fried flounder\nIn the forest with a florist named Florence\nWhen I found the floozy floatin'\nHer fanny fragrance was funky like a fish\nMade her scream like Francis Ngannou fucked her with his fist\nFlavor like fried fowl\nFlossy/Foxy\nFoster French fist fighters like Firas Zahabi\nFast like a Ferrari Fiorano, when i'm flicking the finger\nFornicating with a freedom fighter in the front seat\nFreestyle flawless and festive flows\nThat feel fantastic like fellatio with no front teeth\nI'm Futuristic when I forge a formidable\nFireball from the furious fission of Fukishima\nYou fool, this ain't even my final form\nFucker, my flow is a fusion of Goku and Vegeta\nThat's enough f-words, the song's 'hella tight\nSaying Mac Lethal ain't strong on the mic\nIs like saying Bryan Callen could blindfold himself\nAnd fuck up Brendan Schaub in a fight, uh\nYoung Jamie is a desperado\n\"Look into it\" like Eddie Bravo\nMy flow's in rehab\n\"Blue cheese with wings or go fuck your mother!\"\nLike Joey Diaz\nDoes Mac Lethal got a tight flow to get rich?\nWould Jon Jones send a white girl a dick pic?\nThat's enough of the gold flow I drop fast\nPeace to the Joe Rogan Podcast (bang!)\n\n[Outro]\n(Come on Joe, I'm coming back on the show man, I'm gonna perform this, I'm gonna do a bunch of fast raps on the show, I didn't perform last time. Everybody tag Joe, tell him i'm coming back, we're gonna talk about alien pussy!)", "year": "2018-07-01", "album": "YouTube", "title": "Insane Fast Rap (Joe Rogan DISS)"}], "artist": "Mac Lethal"}