{"artist": "Pusha T", "songs": [{"album": "King Push – Darkest Before Dawn: The Prelude", "title": "Intro (Darkest Before Dawn)", "image": "https://images.genius.com/456d2c1e7b1dc2d52a08c5840820861b.1000x1000x1.jpg", "lyrics": "[Produced by J Gramm Beats]\n\n[Intro]\nEspera, ven aquí, who you wanna be? Drug Dealer? Demon? Rap nigga? You tryna save the culture? Ay Dios mío. You gotta pick one, daddy\n\n[Verse]\nLeave your conscience at the door\nWe done hid the monsters in the floor\nI speak to the trap lords\nAnd niggas wit their hands in the white like blackboards\nI done been black balled \nAnd never gave a fuck ‘cause I’m Jack Frost\nOf sellin’ that blast off\nI’m on a crash course\nWhere talent meets timing\nChristopher Wallace, Think Big, keep climbing\nReasonable doubt, drug era, keep climbing\nI’m my brother’s keeper, Lord Willin’, keep grindin’\nAs a God amongst men\nRinsed drug money, I done paid for my sins\nBooks and the lawyers, I done paid for my friends\nStill held back, I done paid with my skin\nThe only thing missing is a cape on me\nYou niggas wanna tag a late, great on me\nPut the fears in my peers, heard my footsteps coming from the rear\nNow it’s murder was the case homie\nI’m watching this three ring circus \nOld lions don’t roar, so the clowns ain’t nervous\nEven you fools serve purpose \nLet ‘em run amuck until the king resurface\nThen it’s off with your heads\nWear your little jewels, you could floss when you’re dead\nThey take samples of ‘em, I make examples of ‘em\nIt’s the thrill of the hunt, I keep my mantle covered\nAsk ‘Ye who’s loyalty more realer\nAsk P, who’s core’s a drug dealer\nMe and Tim, it's coming, it’s gonna kill ‘em\nThe only great I ain’t made better was J. Dilla\nNow we breaking new ground\nGet ready for the placing of the crown\nKing Push nigga!\n\n[Outro]\nA Pablito le dieron pa’ bajo, but I’m still here, y el otro tipo? he’s running, but I’m still here, I don’t even know why you doing this loco, yo ni se pa' que, but always still right here. You wanna be like them, don’t you huh? you’re not like them… Y definitivamente, they’re not like us", "year": "2015-12-18"}]}