{"songs": [{"album": "Route of Evil", "year": "2012-06-25", "title": "Slimetime", "image": "https://images.genius.com/49699219c57f3d579fccb266aff48aad.442x442x1.jpg", "lyrics": "[Intro]\nWe in the time of our life\nEast Atlanta, yeah\nWord to Casey, yeah\nTurn the music up\nPrimetime\nThat nigga Smoove will say Slimetime\nI'ma call this shit Slimetime\nUh\n\n[Verse 1]\nSavage JID, a maverick\nI grab a bitch up 'til I have somethin'\nShe said, \"Can you make the bed rock?\"\nI do on my yabba dabba shit\nBut now I got the abracadabra\nFind these funny actor rappers\nMigo told me to chill, you could easily beat 'em\nShit, JID, don't feed into the bull\nThe rage of a bull with cajun eyes locked in a cage\nFilled with hatred and you hatin', speakin' this fugazi\nAnd thinkin' it's gon' phase me?\nFuck nigga, no pressure\nI'm fly in my G6 but there is no Ke$ha\nI'm 'bout to hit the homerun, where the fuck is the catcher?\nI got beef with a burger, mustard, ketchup\nFive mixtapes in, please niggas catch up\nPlease niggas step up, p-please niggas step up\nAnd not to imitate ya, I ain't the DJ for Justin Bieber\nDid two of my mixtapes so I can make you a believer\nIf you don't know, been where you wanna be\nI'm in where you won't go\nThe little nigga cry wolf, but the wolf won't show\n'Til it get time and that wolf get hungry\nNow yo ass screamin' wolf, but nobody ain't comin' muthafu-\nPrimetime, my nigga Smoove will say Slimetime\nAnd when you turn on the tube, I'm like Bron Bron\nA nigga turn on some tunes, he like, \"Momma don't cry\nI be back in a while.\" That nigga feelin' like I\n\n[Refrain]\nAy JID\nNiggas out her fakin' and paper macheing\nGovernment issued social security checks\nOut generation, bruh\nHatin' niggas never prosper\nNiggas takin' shots?\nYou done fucked around and shot yourself, bruh\nDamn, career suicide\nIt's over\n\n[Verse 2]\nOrigami, original game guru\nDestin Route's the name, JID there the voodoo\nI'm too cool and smoother than a woodgrain Ruger\nIt'll put your ass to sleep so soothin', it's not no movie\nNo cameras shootin', cameras watchin'\nFeds and paparazzi\nI make his girl give me some head and say grazi\nAnd more shot like a Nazi\nSo confident plus cocky, I don't give a fuck\nI'm knockin' boots with the hottest of hottest\nAnd we go to dinner, she only order broccoli\nShe workin' on her diet, I'm like why?\nWith that ass, you like a buck-0-5\nAnd I'm so high, I could eat up everything in the sky\nNow that's funny, I could buy up everything in the store\nNow that's money, and money that's comin' but I ain't seen yet\nAin't really got a team, just a couple niggas I fuck with\nAnd a million bitches that fuck with us, nigga don't fuck with us\n\n[Outro]\nSee, the problem is\nNiggas wanna take shots\nVia social networks\nNigga who the fuck you supposed to be, Zuckenberg?\nYou ain't got racks\nYou ain't got millions\nAll you got is a pack of newports, short!\nNigga that's what your money is\nGet right"}], "artist": "JID"}