{"songs": [{"year": null, "image": "https://images.genius.com/1b31ad67295bb0511098a70dac4665f9.700x700x1.jpg", "title": "You Fucked Up", "album": "Rewind: Deja Screw", "lyrics": "[Man and Blaq Poet]\nYo yo yo yo Poet man yo Poet. You hear me son?\nDamn son man. I'm in some real live shit right now dun (Damn)\nShit is real right now son. I just took this bitch to Poconos man\n(Right, Right)\nJust got back you, know what I'm saying. Yo son man..\nI'm in some shit man. Niggas is calling me. Pager keep going off (You fucked up)\nI fucked up son\n\n[Blaq Poet]\nYou fucked up nigga\n\n[Blaq Poet]\nNow where the fuck did all that coke go?\nStop looking stupid, nigga, like you don't know\nOh, I heard you took that ho to Poconos\nWith so much shit they renamed it Cocanos\nGot niggas calling you and paging you\nBeen there before nigga, it's like deja vu\nBut the niggas you owe, they owe some niggas too\nEnough of that bullshit, they coming body you\nHad too many changes, had too many shots\nNiggas heard it all from stick-up-kids to cops\nNow you in a jeep, moe, smoking bogie after bogie\nLike they going to forget\nNigga, you're in some shit\nBetter get that money up before they chop off your cabbage\nBetter hurry up before them niggas let you have it\nAnd that what you get for trying to live lavish\nFucking up niggas money, stupid bastard\n\n[Hook] x2\nYou fucked up and don't know what to do\nYou fucked up, got niggas looking for you\nYou fucked up and don't know what to do\nYou really fucked up this time\n\n[Blaq Poet]\nNigga you knew better\nWith that motherfucking cheddar\nTrying to run around like you're cash money Jigga\nYou're about to get your whole shit peeled\nYour man getting stabbed and that bitch getting killed\nNigga what the deal\nYou better get your steel\nI've seen a black car with four niggas looking ill on the hill\nShit is about to get real\nLooks like you need the nine mill, I got your back with the mac-mill\nStupid motherfucker got me in this\nFucking with you I might get my whole shit twisted\nBut we go way back, did many hood crimes\nWe watched Janet play Penny on Good Times\nI always had your back, you always had mines\nI know you bust for me, you know I bust mines\nCall them niggas back, tell them that they're dead\nOr meet you on the southside if they want their bread\nMake sure that you got the full clip\nAnd let the click know it just might be some bullshit\nSend the chickens to the store, ?pour Henny in the raw?\nYou fucked up, now we got to raw\n\n[Hook]\n\n[Blaq Poet]\nNow we on the block drinking\nGetting drunk, playing with guns\nLook up in here there they come\nThey came to kill my dun\nCreeping, posting up on me\nNiggas behind the tree\nTaking aim on one knee\nThey got me\nThey got to drop\nI turned up hop\nWe lit up the block\nWhen the smoke cleared niggas was shot\nI'm on the bench with the gatcock sizzling hot\nTwo duns dropped dead right then on the spot\nHad to flee because we heard the motherfucking cops\nNiggas is dead beacause you fucked up, ?mountains of rocks?\nGet out of here, I don't want to see you no more on the block\nYou're exiled, nigga\nBetter bounce now, nigga\nYou fucked up"}], "artist": "Blaq Poet"}