{"artist": "Andre Nickatina", "songs": [{"title": "Pick-Cha", "album": "Conversation With a Devil - CR3", "year": "2003-04-22", "image": "https://images.genius.com/7af39c6c556f9aa9a3e8de7ac158203b.1000x1000x1.jpg", "lyrics": "(Long live the King)\n\nYo picture God a perfect cut diamond\nOr bein the motha fucka man without even tryin\nLivin like im dead to the world with tickets yo and refferals\nMy hair is in a perm so i can never have a curl\nMan its a bluebird on my shoulder can i kill it?\nMan wakin up the bacon toast and eggs up in the skillett\nMan can you feel it?\nI cut you down like a midget\nAnd when you see me make you feel just like a prision visit\nIm such a (lizard?)\n\nI want the flames in the fire\nSo there it is paint a picture fuck up my desire\nYou said you want style ill give you style with drug lord flava\nI make a pimp dance yeah by shottin at his gatas\nPickin up the nickles n dimes like Jackal and Hide\nThe bounty is waitin for me up at Mt. Zine\nIts primetime whos gon shine from the raw rhyme\nPicture a rollercoaster up in a boss mind\nReal playboys have wings in the sky\nSilently cryin out man please dont die\nMan gettin to the thick of it all\nMan picture the brods\nMan tellin ya call\nBut hopin ya fall\nSayin my name like King James no pad adriatic\nIm paranoind but really dont panic\nThe life afta they say its colder then the packers\nAll and the damn money in the world is not a factor\nMan true indeed\nUpin the game with a mouth ta feed\nI make a 360 spin homie rollin the weed\nRoll the weed\nRoll the weed\nLong live the king\nWe take a sertain situation to run an organizarion\nMan bustin like a (?) patient\nCooperation man seven years is what hes fakin\nNow hes even more gangsta cuz hes rollin wit da nation\nNow (?) yourself\nThen i will talk like greedy Gretchin\nMan hear the confession of my priffesion\nIs Secession of illegal weapons\nUp in a dot daytona\nMy mexican girl she drank two coronas\nAnd she know about the ayatolah\nIm movin through the clouds\nYoud better hold me down\nIm smokin weed and im g'd and ready ta clown\nI love ta see you drown\nYou know I spit it\nTo get it\nTo flip it\nTo sell it\nTo air mail it to yo town\nIm like electical current\nThe playa reffereant\n(??) councourent\nBecause its gonna hit the furnace\nMan pitches the pictures of me\nPicturin the bitches\nAnd all up here sayin write the scriptures\nIt gets worse\nCuz mentally youre cursed\nYoure livin in a verse\nSometimes it hurts but baby yeah you know it works\nLong live the king\nLong live the king"}]}