{"songs": [{"year": "2016-12-09", "image": "https://images.genius.com/595a5c53c72195068baa3a2331acf4ef.1000x1000x1.jpg", "title": "Assassine", "album": "Imperator", "lyrics": "[Part 1]\nDie Kippe brennt, ich blas’ den Rauch in die Luft\nBin müde von dem Struggle und dem dauernden Druck\nDer sich staut in der Brust, ah\nMüde vom Chef, der mir sagt, dass ich zur Raucherpause ausstempeln muss\nMüde beim Anblick meiner Lohnabrechnung\nBin müde nach der Schicht, doch hole Dope am Brennpunkt, tick’s im Großstadtzentrum\nAn Bonzen in der Disco\nDas Risiko ist hoch, aber mein Konto ist im Dispo\nVielleicht kommt demnächst die Kripo\nAh, ich bin müde von den Drogentrips\nUnd nächtelangem Songsaufnehm’n mit Rizbo\nBin müde, Props zu kriegen, doch kein’n Labeldeal\nBin müde, mich über Wasser zu halten wie ein Navyseal\nMüde von der Gegend hier\nMüde, hier zu leben, aber dann in Texten zu erzähl’n vom dekadenten Lebensstil\nMüde vom täglichen Stress, dem wenigen Cash\nMüde von all den austauschbaren Ladys im Bett, geh’ ohne Basey nicht weg\nMüde, wenn sie aus der Gegend draußen steh’n\nMich auszunehmen und mir aufs Maul zu geben\nIch bin müde da immer wieder rauszugehen, die Faust zu heben\nUnd es mit jedem von ihn’n aufzunehmen\nMüde, mich mit der ganzen Welt zu schlagen\nMüde, meiner Fam den Halt zu geben, den ich selbst nicht habe\nImmer dieselbe Lage, ah\nIch schwör’, eines Tages buche ich die ganze scheiß Hoteletage!\n\n[Hook]\nKapuze im Gesicht wie ein Assassine\nIch geh’ auf die Straße, der Himmel anthrazit\nIch bin müde von dem Hustle, müde von dem Struggle\nDoch gebe niemals auf - meine Psyche ist ’ne Waffe!\nKapuze im Gesicht wie ein Assassine\nIch geh’ auf die Straße, der Himmel anthrazit\nIch bin müde von dem Hustle, müde von dem Struggle\nDoch gebe niemals auf - meine Psyche ist ’ne Waffe!\n\n[Part 2]\nIch zünd’ den Blunt an, atme das Haze ein\nNoch zwei Interviews zwischen Soundcheck und Stagetime\nMit Clubshow zur Latenight\nIch bin müde, doch muss Poster und CDs sign’n, posen mit ’nem Fakesmile\nIch bin müde, müde vom Showbiz\nMüde, weil immer etwas los ist; müde von Roadtrips\nDen Aufnahmesessions\nBin müde, doch im Backstage bei lauwarmem Essen, immer dauernd am texten\nSeit drei Tagen wach, nicht leicht, mich zu motivier’n\nWenn ich die Stage verlass’ und Mails en masse erschein’n im Homebildschirm\nJeder will sich profilier’n, ich check’ jedes Demotape\nUnd bin müde vom Luftgemisch aus Tourbus und Deospray\nMüde von den Aasgeiern, Biter, die mir nacheifern\nUm sich paar Scheiben abzuschneiden wie ein Glasschneider\nIch geh’ nicht in Bars feiern, lass ma’ stecken, ich bin müde\nUnd nach zwei Gigs am Tag heiser wie ein Marktschreier\nHab’ kaputte Stimmbänder, bin müde von jeder famegeilen Bitch\nDie sich aufspielt wie ’ne fucking Princessa\nUnd ich versuch’ nicht gleich hochzugeh’n wie Blindgänger\nWenn die Securitys wen cashen mit ’nem Springmesser\nBin müde von den Typen, die mich angreifen und hassen\nDie mich anschrei’n, doch dann feige Anzeige erstatten\nNicht die Bandbreite erfassen\nJa, ich bin zwar müde, doch ihr habt nicht mal ansatzweise meine Spannweite ihr Spasten\n\n[Hook]\nKapuze im Gesicht wie ein Assassine\nIch geh’ auf die Straße, der Himmel anthrazit\nIch bin müde von dem Hustle, müde von dem Struggle\nDoch gebe niemals auf - meine Psyche ist ’ne Waffe!\nKapuze im Gesicht wie ein Assassine\nIch geh’ auf die Straße, der Himmel anthrazit\nIch bin müde von dem Hustle, müde von dem Struggle\nDoch gebe niemals auf - meine Psyche ist ’ne Waffe!"}], "artist": "Kollegah"}