{"songs": [{"year": "2006-01-01", "title": "Eternally Yours", "image": "https://images.genius.com/4efe3d7de04a343b34f1b0ddcfbc7bf4.1000x1000x1.jpg", "lyrics": "[Intro]\nThat's right, Great 'Dat X\nMan's man, throwing it how I'm throwing it\nSee right now\nI'll probably hit you up with something\nThis is like, you know something to think about\n\nThings that I done, and do\n\nIt's a long ride that I been on\n\n[Verse 1]\nNow when I first was fucking with shows\nIt was about hoes, and buying a lot of clothes\nAnd being a fly-ass nigga (fly-ass nigga)\nBuying expensive weed packages, and seen on the mean street\nWith the whole hood, understood?\nStood with the real bosses, a real good time for grime\nWhen the gods built, you could get a bird on the arm (that's right)\nAnd e'erybody ain't dealin'\nWasn't as cold as the winter\nRemember the center, when you was young\nAnd shorty had you strung out, with that little thing you bring out\nWas the self-starter, to a bigger and brighter future\nAnd somebody ain't shoot yer!\nI probably go about a few years more, and more\nSome niggas try to make this game as war\nTactical wizards, but they can't hold it the first sign of the bombing\nThink I ain't charming? e'erybody's a little nervous\nYou should never disservice, the Manimal, the great 'Dat\nNow see what I got, and what I got for it\nBut can I look toward?\n\n[Bridge]\nYou know, like take me\nLike I been all over the world, on the low\nYou wouldn't know\nYou know, I'll quickly hop on the bird\nMy passport is stamped, whatever, you know\nI'm risking something right now\nRisking my freedom for a little while\nBut, um, I gotta make do, you know\nI'mma come out\nI'll definitely come up out of it\nCan't stop the god\n\n[Verse 2]\nI been to the Mom and Pop shops, Cop shops\nSold out shows, to venues that flops\nSeen the black beads, to the gang needs\nI'm still a beast, I still make a nigga cease\nMy writing time is minimal, record-breaking\nShould do a lot more wrecking, baking\nMy dudes\nWhen have I not ever hit y'all with foods and brainwaves?\nA lot of my dudes is in graves\nBeen in apartments that's caves, with reinforced doors and floors\nShe was high-class, her sister ran with crack whores\nUsed to break in the back of stores in New Rochelle\nBrought Macy's to its fours, 40 calibres and sores\n\n[Verse 3]\nNow if I took you out the Orchard, would you let me paint your portrait?\nThick-like, sick-like, body-wise\nRun through your fabrics like the Mavericks fans Break more money to make\nAnd good karma, and the armour\nAnd the strong drive for fortune, make a reliable team\nAnd make the realisation a dream\nI'll admit my dudes'll scheme, snatch the Pope\nBut they was friendly last time y'all spoke\n\n[Bridge]\nA lot of people say my dudes is grimey, you know\nMaybe they not grimey to me, cause I know them maybe\nYou know, I we came up together\nBut I tell you, if you front they will get at you\nThey grown men, you know\nAnd take it for what it is, they grown men\nThey live this every day\nThey like real wolves out there, I'm telling you\n\n[Verse 4]\nI'm condemned only by God\nThat's why I go everyday hard\nFor eight months I'mma be barred\nFrom reaching y'all New Yorkers\nMy daughter, people across the water\nNahk from the Ack store, Can I get a loose?\nHold on with that, I need a juice\nEQ my voice flat, make my ad-libs do them\nYou knew them? (them snitch niggas!)\nYou get my share, treat me fair, and we easy\nI'd rather lay up with my girl, than be involved in the bullshit\nNiggas high and pull shit, and then be inside\nEveryday for me is a ride (every day)\nI understand the DVD sales, and how radio prevails (I know, I know)\nMe and you is using different scales\n(I am the)\nI am still the untraceable, Pre-cog read the blog!\nThe true and living, and I'm still giving\n\n[Outro]\nStill giving, you know\nI'm international, I'm worldwide. Brazil, you know\nHungary, Budapest. Madrid, I like Madrid, you know. Tokyo. In Tokyo I'm Sadako, Tokyo\nWorldwide all the way back up town\n157th and Riverside Broadway, you know\nOn up the block to Amsterdam, over the bridge\nOn up to New Ro' 95, you know\nBack down again, through the BX, where they still call me DX\nRight behind Yankee stadium", "album": "Black October"}], "artist": "Sadat X"}