{"songs": [{"title": "Feeling Good Today", "album": "Mr. Midnight", "year": null, "image": "https://images.genius.com/6659527e1d927b401e994eff3a8867ac.1000x1000x1.jpg", "lyrics": "[Intro]\nNigga, I done fucked around and linked up with my nigga Cardo, nigga, God damn\nSock it to me\nGood job\nNumbers\nUh, uh, uh, uh, ayy, ayy\nUh, uh, uh, uh, ayy, ayy, oh-oh\n\n[Verse 1]\nIt was a clear afternoon, the hoes was out\nSlidin' up, cashmere, bro just got out\nBought him shoes and clothes, a zip of 'dro\nA couple hundred dollars then he knocked him a go\nI'm mackin' on a bitch 'cause it's necessary\nShe bought a nigga Gucci and Cartier\nI'm tryna go to Boston, there's money there\nI'm rollin' up a chop in the barber chair\nSprinter van with a TV\nEvery real P need one of these\nI'm from the slums where shit can get real\nYou got a be from The Bay to know how I feel\nI'm not famous, I'm just a real-ass nigga\nWho needs a record deal when you know how to get it?\nThey tryna book Uncle Larry overseas\nBut for that, bitch, I need twenty Gs\n\n[Chorus]\nSmokin' on a chop with the top down\nI'm coolin', I'm feelin' alive\nDon't be callin' my phone tryna kill my vibe\nBitch, I work too hard to get this fly\nI'm feelin' good today, I don't want no drama, ever\nI'm feelin' good today, so keep all that far away, far away\n\n[Verse 2]\nI make songs for niggas that live like me\nAnd that bad-ass bitch that get off at three\nTake a nigga number then call me sometime\nHow I make it out the trap? I be thinkin' sometimes\nBaby came through with chicks for days\nFuck my morals, I'm hittin' today\nThen she blew a nigga phone up, these hoes is mainy\nI was just tryna smack, I ain't need no lady\nPut my Nikes on then I grab my keys\nLet me roll up a fat-ass chop before we leave\nSittin' on my couch playin' D'Angelo\nMy candle cost eighty dollars for the little one\nThirty K, all stock, this the real one\nNo Ds in the wash, still killin' em\nI'm livin', life is cool\nMatter fact, bitch, my only problem is you\n\n[Chorus]\nSmokin' on a chop with the top down\nI'm coolin', I'm feelin' alive\nDon't be callin' my phone tryna kill my vibe\nBitch, I work too hard to get this fly\nI'm feelin' good today, I don't want no drama, ever\nI'm feelin' good today, so keep all that far away, far away\n\n[Outro]\nAy, ay, ay, ay, ay, ay, ay, ay"}], "artist": "Larry June"}