{"songs": [{"year": null, "image": "https://images.genius.com/36110f13909ff51d0b79011a134c3a5e.640x640x1.jpg", "title": "Bumpy Road", "album": "Kuntry Livin’", "lyrics": "Hop on in, Baby Girl. Let's go\nSlide on over, and hold me close\nClimb on top, cause we about to roll\nDown a bump, bump, bumpy road\nGot the music cranked up, and the beat down low\nSittin' real high and ridin' real slow\nSippin and smoking with your boy Big Smo\nDown a bump, bump, bumpy road\nOh yeah, the sweet summer night;\nThe sky's wide open, and the moon's just right\nMy Chevy's sittin' tall, covered in mud\nAnd I'm thinkin' bout you and a six-pack'a suds\nOn an old back road where the blacktop ends\nDon't tweet this, girl. It ain't for ya friends\nNow, ride around the corner where the creek bed bends\nIt gets a little bumpy, no time to buckle in\nHold on tight, hell slide a little closer\nYou're rollin' wit a big boss, girl. Climb over\nLet the bump bu-bu-bumps just jiggle ya guts\nNow drop it on me baby, while I steer through these ruts and...\nHop on in, Baby Girl. Let's go\nSlide on over, and hold me close\nClimb on top, cause we about to roll\nDown a bump, bump, bumpy road\nGot the music cranked up, and the beat down low\nSittin' real high and ridin' real slow\nSippin and smoking with your boy Big Smo\nDown a bump, bump, bumpy road\nHell, I'm as country as cornbread, taters, and hog-jaw\nWild as a billy goat, slick as a bullfrog\nBuck as a whitetail, rippin' them trails\nSmashin' in my side-by-side, and raisin' hell\nPickin' chicken to the women and they're ready to go\nYou know them mud bog mamas that are willin' to roll\nThe bumpier the road, the funner the ride\nShe love it when the motor vibratin' her thighs\nMy shocks get to jumpin' when the bumps get to bumpin'\nGot the throttle wide open, try'na do a little schuckin'\nAt the back of the bog, where the trails get rough\nYou'll find this ol' country boy rippin' it up. C'mon...\nHop on in, Baby Girl. Let's go\nSlide on over, and hold me close\nClimb on top, cause we about to roll\nDown a bump, bump, bumpy road\nGot the music cranked up, and the beat down low\nSittin' real high and ridin' real slow\nSippin and smoking with your boy Big Smo\nDown a bump, bump, bumpy road\nHop on in, Baby Girl. Let's go\nSlide on over, and hold me close\nClimb on top, cause we about to roll\nDown a bump, bump, bumpy road\nGot the music cranked up, and the beat down low\nSittin' real high and ridin' real slow\nSippin and smoking with your boy Big Smo\nDown a bump, bump, bumpy road\nPlay that country music, white boy\nJust let that country music take you home\nI say\nPlay that country music, white boy\nJust let that country music take your soul down that bumpy road"}], "artist": "SMO"}