{"songs": [{"album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "title": "Get It", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg", "lyrics": "[Intro]\nGotta get my groove back, you know?\nIt's been a little minute\nYeah\nYeah\nUh\n\n[Verse: 1]\nLabel me greedy, but see me finish what Peedi started\nFrom Carolina where niggas spray like graffiti artists\nThe south nigga, niggas used to think we retarded\nAnd slow as hell, but well well, now we regarded as the niggas (yea)\nI fuck with non rapping niggas, non clapping niggas\nNiggas is real, y'all is action figures (Ha)\nAin't into acting bigger than I really am\nAin't no two ways around it, motherfucker I'm the man\nWhere the beef at?\nBack in the days I ain't even go out for recess\nA nigga don't play, man, I been living okay\nBeen up in Queens where they 'rid of those foes\nAnd niggas GATs got bodies like video hoes\nIt's J.Cole, you not fucking with just any old flow\nI'm like the '95 Penny, you like Penny '04\nNo disrespect to my favorite player\nNiggas praying a nigga never see the day a nigga rich\nSo I'm slaying niggas, yeah\n\n[Hook]\nThis is for my niggas tryna make it\nWatch out for them evil ass niggas tryna take it, uh\nThey love to see a nigga dead up, in jail\nLiving in a world where we set up to fail\nBut I'm a get it, nigga I'm finna to get it\nI'm a get it, nigga I'm finna to get it\nYeah\nI'm a get it, nigga I'm finna to get it (yea)\nI'm a get it, nigga I gotta get it\n\n[Verse: 2]\nNiggas in the streets, no\nNiggas blessed beats\nI got that priest flow, heavenly\nYou gonna cross over if he reach for the rock\nJust a figure a speech for the Glock\nFrom the Ville, where police know the heat flow a lot (Yeah)\nLike a beach yo, it's hot\nNiggas laid out\nCaught a fake nigga centerfield it's cause they played out\nWatch our boys fade out, niggas tryna hate\nIf he only knew my dick's in his dame's mouth\nJust made out, came out the wood-works\nNow they tryna peep a nigga footwork\nI'm getting real green, y'all niggas playing on some good turf\nFake money, scared money, never make money\nAnd a nigga never fear nothing but God\nFuck a facade\nI'm just focused on stuffing my pockets up with them wads and shit\nHundred thousand dollar deposit shit\nBeen dreaming 'bout millions since a nigga was five or six\nAnd so I strive, I'm the God, this some bible shit\nNigga I\nYeah\n\n[Hook]\nThis is for my niggas tryna make it\nWatch out for them evil ass niggas tryna take it, uh\nThey love to see a nigga dead up, in jail\nLiving in a world where we set up to fail\nBut I'm a get it, nigga I'm finna to get it\nI'm a get it, nigga I'm finna to get it\nYeah\nI'm a get it, nigga I'm finna to get it (yea)\nI'm a get it, nigga I gotta get it\n\n[Verse 3]\nTell 'em Geppettos my niggas in ghettos with Scarface dreams\nOn the block with the hard hate, that's all they seen\nNiggas killing niggas in broad day on all they screens\nWatching cops loving car chase scenes\nNiggas arrested\nTreat us like roaches, the prison's nigga infested\nThey hate to see the day we ain't slain, niggas invested\nAll created equal looks like equal to a less than\nDepending on your race, or depending on your address, man\nI've been blessed, was given less and but still progress, man\nI hate to see the position my niggas left in\nSling dope or nigga you slave for minimum wage\nAshamed\nBut we living in the cage, so nigga get paid, shit\nHow could I tell a nigga not to hustle?\nYea it's a better life my nigga, but it's not for us though\nInstead they wanted us to break\nThey never wanted us to make it, yea\nTo my niggas smart enough to be smart enough to take it, nigga"}], "artist": "J. Cole"}