{"songs": [{"image": "https://images.genius.com/add6727f4d54bc1d0e5aa7d9bba33489.1000x1000x1.png", "lyrics": "[Verse 1]\nSo you wanna know about my politics?\nYeah I could show you things that could make you sick\nThere's a satellite above me that's taking pics\nAnd an army from the west have started sending mix\nAnd I'm sat in America doing tricks\nSo the army's looking on me like I'm a bitch\nAnd I'm thinking bout the babies lying in the ditch\nThinking if they had a kite phone you'd see this shit\nAnd what you see on MySpace just a little bit\nAnd the stories always fucked by the time it hits\nWhy the hell would journalists be thick as shit?\nCause lies equals power equals politics\n\n[Chorus]\nI'm a sinner, never said anything else\nI didn't lie to you, thinking of somebody else\n\n[Hook]\nHater, ain't time for that\nHater, ain't time for that\nHater, ain't time for that\nHater, ain't time for that\n\nI'm a—\n\n[Verse 2]\nYour ego and hate is your burning brick\nYou live in your mansions, stealing from the sick\nDid my tsunami money go to your chicks?\nFor her Bentley, is she riding your dirty dick?\nYour son can go to Harvard to learn the tricks\nLike economics eats the poor like a Twix\nIn the third world sticks would sniff you out like Vicks\nYou write your own reviews to get away with it\nYou can talk shit to me, I'm used to it\nYou make me hard with the wounds that I have to lick\nYou can pick on me and I can see it at a click\nYou're a racist, I wouldn't trust you one bit\n\n[Chorus]\nI'm a sinner\n(by their self, by their self, I live by the river)\nNever said anything else\n(make and take and you take a chance and you know that I'm a winner)\nI didn't lie to you\n(by their self, by their self, I live by the river)\nThinking of somebody else\n(make and take and you take a chance and you know that I'm a winner)\n\n[Hook]\nHater, ain't time for that\nHater, ain't time for that\nHater, ain't time for that\nHater, ain't time for that\n\n[Outro]\nHater, ain't time for that\nHater, ain't time for that\nHater, ain't time for that\nHater, ain't time for that", "year": null, "album": null, "title": "Haterz"}], "artist": "M.I.A."}