{"songs": [{"title": "31 Summers", "image": "https://images.genius.com/2e41cdcd316e28fb0992352f0da12af8.1000x1000x1.jpg", "lyrics": "[Intro]\nMm-hmm\nYeah (Uh)\n\n[Chorus]\nI was born in the summer\nI been here every summer\nAnd when they ask me how to come up\nI tell 'em, \"Grind for thirty-one summers\nSpit and shine for thirty-one summers\nGrit and grind for thirty-one summers\" (Yeah)\nWhen they ask me how to come up (Grr)\nI tell ’em, \"Die for thirty-one summers\"\n\n[Verse 1]\nNiggas don't wanna get it, I'm harder then penetentiary steel\nFor my niggas locked down in the penetentiary still\nI wasn’t meant to be killed, I was mentally ill\nI needed medicine, your head'll get injured, it will\nBetter yet, Excederin, murder, et cetera\nYou fuckin' with a psycho, nigga, you better run\nPray before I put you in the grave most likely\nYou met a lot of rappers? Well, none of 'em like me\nRipped the rap game sorta like Ice-T\nOne little chain, I don't need to be icy\nOh, I see, y'all niggas wanna get cut up\nReally wanted to nut-up, brains dipped in butter\nGuts in the gutter, my nigga, I'm that vicious (Vicious)\nPut me in a circle of rappers, I handle business (I handle business)\nScandalousness, nigga, what up?\nNiggas'll die for thirty-one summers (Nigga)\n\n[Chorus]\nI was born in the summer\nI been here every summer\nAnd when they ask me how to come up\nI tell ’em, \"Grind for thirty-one summers (Grr)\nSpit and shine for thirty-one summers\nGrit and grind for thirty-one summers\" (Yeah)\nWhen they ask me how to come up\nI tell ’em, \"Die for thirty-one summers\" (Yeah)\n\n[Verse 2]\nShittin' on you niggas like diarrhea, don’t try and see him\nI'm busy eatin' up human beings and you can see it\nYou could be it, that nigga that nigga you see me eatin'\nHop in a circle and I’ll chop you up to little meatlets\nYes, grr, gun in the dresser, my pleasure\nHuman meat in a crock pot, that's my treasure\nPut the seasonin' salt, I don't have to measure\nGet your fuckin' hands out the pot, nigga, you better\nI'm a genius at makin' em eat red meat\nKnee-deep in it, for each ten-inch, you'll get a heat lift\nFacelift, I'm Jason, put a leak in it\nA lot of blood on the ground and you gon' sleep in it\nAll niggas is dyin' before he finish\nRip the guts out of niggas before I replenish\nWho's next? Give 'em a suplex\nTake over his duplex and give her the new sex\n\n[Interlude]\nGrr\nMotherfucker\nGon' light me a cigarette\nWhere my fuckin' lighter at?\nYeah, nigga\n\n[Chorus]\nI was born in the summer\nI been here every summer\nAnd when they ask me how to come up\nI tell 'em, \"Grind for thirty-one summers (Grr)\nSpit and shine for thirty-one summers\nGrit and grind for thirty-one summers\" (Yeah)\nWhen they ask me how to come up (Grr)\nI tell 'em, \"Die for thirty-one summers\" (Yeah)\n\n[Outro]\nKevlar, nigga\nGrr", "year": "2019-02-22", "album": "Torment"}], "artist": "Brotha Lynch Hung"}