{"songs": [{"image": "https://images.genius.com/ad80c99eba73ffa250aee13481cdba62.500x500x1.jpg", "title": "I Got Love", "album": "Music & Me", "year": "2001-12-04", "lyrics": "[Produced By Bink!]\n\n[Nate Dogg]\nI got love... I got love...\nI got love... I got love...\n\nI got love - I, got, love, for, my homies who be rollin wit me\nPlay no game - play, no, games, cause, ain't nobody playin with me\nI got love - I, got, love, for my niggas on my family tree\nI got love - love for the ghetto, down for whatever\nIf you was down before, then you still gon' be down with me\nI got game - I, got, game, cause, the game was given to me\nSay my name - say, my, name, cause, ain't nobody tighter than me\nGive it up - give, it, up, if, you like the way I'm rocking this beat\nI don't know - know nuttin better, chasin my chedder\nIf you in love with a whore -- you ain't never listened to me\n\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh\n\nCaptain save - cap-tain, save, a, hooker cause she hangin on me\nShe can't hang - she, can't, hang, cause I ain't lookin fo' a wifey\nJust in case - just, in, case, I, better take a weapon wit me\nAnd these hoes - hoes keep cover, down for whatever\nIf she stress me some more, I have to leave her dead in the street\nRun me how? Run, me, how? Cause, haters they be all in the mix\nAnd they know - where, they, go-in, ain't gon' get no better than this\nCan't they see? Can't, they, see, we, ain't some niggas they wanna diss?\nD.P.G. - though I'll love a trick never, treat a bitch never\nI told you before, so you better not be fuckin with me\n\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\nWah-ooooh, ooooh, oooh, oooh oooh oooh oooh oooh\n\nPlatinum chains - plat-inum, chains, is, all you ever see on my neck\nDiamond ring - dia-mond, rings, as, long as I can keep her in check\nAll the same - all, the, same, as, long as you don't ever forget\nI was taught in the ghetto, wear the tight bellow\nIf she head for the stash, I always got this pistol with me\nConstantly we bustin' to a hell of a beat\nThen we came - then, we, came, cause, the bass'll knock you off of your feet\nJust that deep - just, that, deep, I, betcha we be movin ya feet\nVoice kinda mellow, place from the ghetto\nIf you still want some more, go and get the fuckin CD\n\nI got love... I got love...\nI got love... I got love...\nI got love... I got love..."}], "artist": "Nate Dogg"}