{"songs": [{"year": null, "album": "Too Much Too Soon", "image": "https://images.genius.com/1091d04cdf3371959e44d5abb6c40556.1000x1000x1.jpg", "title": "Four 4 Four", "lyrics": "[Hook: Ellie]\nA force of nature is what I am these days\nOut of the dark, I came like a hurricane\nThis force of nature brews inside of me\nAnd now I own the dark, I own the dark\n\n[Verse 1: Kent Jones]\nThere's seven different levels of devil worshippin'\nUsed to wonder why they used to all curve me then\nGod said he called but I had bad reception\nHope he know that's the reason I didn't hurry then\nYou're breaking all the rules that you don't deserve to bend\nDon't make me feel bad for that time I curved your friend\nShe say she rushin' so that's why she hurryin'\nShe say she Russian so that's why she hurryin'\nIt's we the best, who? We the best truce\nShit these beats I chew, they be like bless you\nYou still kickin' your seat up, you fightin' for leg room\nFuck first class I need me a bedroom\nYou still kickin' your seat up, you fightin' for leg room\nFuck first class I need me a bedroom\nFuck first class I need me a bedroom\nAnd a thick flight attendant to take to the restroom\nThey said \"Kent why you had to play us all as fools?\"\nDon't Mind was super cool but the bars super curle\nNo crime scene until it's a crime seen\nWhere you see a nigga leakin' a tape like YesJulz\nI should have said yes the last time I saw her\nI knew she was a freak, I'm glad somebody caught her\nLeast her future husband know where to head before the altar\nThey call her everything in the book, I don't know what to call her\nBut the dick's so good she might tell me to call her often\nThe dick's so good she might tell me to call her often\nYou'd think I made the news, I just see it how I call it\nYet the media insists that I never do enough talkin'\nNever take enough pictures, never do enough smilin'\nI just popped an Adderall, they seen the back of my eyelids\nJust left the studio and then I jumped right on a plane\nLabel booked twelve hours, guess I'm goin' over it again\nHad a dream, Jesus grabbed the wheel in the brand new Camaro\nAfterwards he gave it to me just to make me feel special\nI gave thanks and I took that bitch on a test drive\nHad to trade it for a Wraith cause the seats was too narrow\nNow they heard I sold my soul, I'm wearin' designer shoes\nPriority on my pass, ain't waitin' in line with you\nThey say I sold my soul but that ain't nothin' new\nI was playin' rhythm and blues on Sunday with gossip groups\nJudged by old traditionals, they about to be fossil fuel\nHow you forget the blues was the birth of gospel tunes?\nHow you forget the youth but you the first to watch the news?\nHow you can't feel the shoes but still want God to walk with you?\nHow you ain't got a blender when it's time to make my drink?\nCoulda sworn that I was at the fuckin' W\nYou said you make songs that sound bigger in the club\nI said I write bars that are bigger than your buzz\n\n[Hook: Ellie]\nA force of nature is what I am these days\nOut of the dark, I came like a hurricane\nThis force of nature brews inside of me\nAnd now I own the dark, I own the dark\nA force of nature is what I am these days\nOut of the dark, I came like a hurricane\nThis force of nature brews inside of me\nAnd now I own the dark, I own the dark"}], "artist": "Kent Jones"}