{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Spitten Venom", "album": "The Unforgiven Volume One", "lyrics": "[First Verse]\nIf it's on I'll kill my own like a Civil War\nThis EBK, what the fuck should I be civil for?\nIt's over, pour into my bullet tips\nSplit you open like a pinata cuz you full of shit\nManana nigga I'ma do you non-believers bad\nWith heavy artillery like Sigourney Weaver had\nCuz you an alien or foreigner up in the town\nEither you or I, do or die about to shut you down\nBout to hunt you down like elk in the woods\nIn the hood nothin' else expected\nAccept it, it's what I protected\nNo excuse, nothin' else respected\nKnown to shoot whenever we tested\nShit is about to get hectic, Chaos!\nYou gone need the sounds to bring you back from where you rested\nMay God Bless it\nI'm agnostic so keep that!\nPure toxic up in your eyes, nigga peep that\nWe know where you sleep at\nAs we speak my peeps is mashin'\nAnd we know that you weak ass bunglin' bitches is who we snatchin'\nShe catchin' hollow rounds\nShots to the head make a hollow sound\nGot away with murder, PARANOID!  I push this bottle down\nOne sip put the bottle down\nAnd blaze a blunt this one's for you\nNow you rest in peace, no hard feelings bitch I swear it's true\nIf it's necessary Black Market do what's called for\nAnd best believe when it's time for war we all go\nAnd we all know nothin' comes before this chessboard\nTwo knights and kings fightin' screens, yes Lord\n\n[Chorus]\nI'm spittin' venom like a moccassin\nGrab a Glock, CHAMBER, droppin' men\nDANGER, in my RANGER, and I got to win\nDELUSION, no ain't no killin' X-Raided cuz I refuse to\n\n[Second Verse]\nBet all them fools'll know, funk if they want it they got it\nAll my proponents is riders committin' murders sporadic\nWe quick to get up inside ya blow out your thigh boy\nPsychotic shootin' while yellin' \"You got to die Boy!\"\nNever should've crossed me, flossy glossy like fresh made varnish\nWith a reputation too solid to be penetrated and tarnished\nHarness rage, it's strong, let it loose and you flagrant\nProduce a strap from my draws, introducin' slugs to the vagrants\nStatements was made so foul, niggas is funny style\nTell a hundred niggas you hate me but when you see me you smile\nBut all the while, you thinkin' muthafuck X-Raided\nBut in your heart, you never really felt you could fade it\nDebate it, what I represent nigga, this G.B.C\nNorthern Cali freeway from the Sac-Town back down to the M.S.G.'s\nSo hit the freeway, no lee-way cuz this ain't your zip code\nYou keep your lip closed\nOr you get those lips swole\nWe got your shit exposed, stay the fuck away from us\nWe'll light you up and disappear like we vaporous\nMy cavaliers, wearin' battle gear, run up in your fort\nPut bullet holes in your shorts\nLeft you dead on your porch\nThen we torched your spot, my cohorts got counts calculated\nShout out you hate it\nThat's what you get for doubtin' X-Raided\nDeport your corpse in where the cops'll never bother to look\nRigormortis decompose you, served ya, bored, and now it's over\n\n[Chorus] (2x)"}], "artist": "X-Raided"}