{"songs": [{"year": "2017-12-25", "image": "https://images.genius.com/cb8c3dc931510ad14cb4c9556bd62452.800x800x1.jpg", "title": "Anéis, Brincos & Terços", "album": "The Bob Show EP", "lyrics": "Letra de \"Anéis, Brincos & Terços\" por Bob (Contra Corrente)\n\n[Intro: Bob]\nAí Slim, saca só\nAí, ah...\n\n[Verso 1: Bob do Contra]\nE eu num me entendo há tempo\nAliás não tô entendendo ninguém a tempo de perder\nTodo mundo é tão clichê e inovador, ódio e amor\nVê lá qual que cê vai escolher\nColher pra prato raso, isso é mais profundo\nCaminham pro fundo a passos largos, larguei na frente de todo mundo\nCavalo dado não se olha os dentes: eles tão de aparelho\nBob é do Contra, mas contra as correntes que te deixam preso\nEssa gente é tão segura quanto shopping ou um banco\nOnde parece ser impossível mas continuam assaltando\nEu vejo suas mentes e seus truques e tudo que atrai\nNosso medo é ser Luke e ter que desafiar nosso próprio pai\nÓ pai, me mostre como enfrentar o ego (Vai)\nCê já se olhou no espelho? (Aham)\nArrumem um quarto ou fiquem quietos, ou façam 1/4\nEla deixou 1 brinco, 2 anéis e 1 terço\n\n[Ponte: Bob]\nEntão falar que num me viu\nCê ainda sabe quem eu sou\nFalar que num sentiu\nÉ que seu rap num tem soul\n(2x)\n\n[Refrão: Bob]\nUm quarto, um drink, anéis, um brinco, um brinde, um terço\nUm maço, um vinho, um jazz, então façamos do seu jeito\nUm quarto, um drink, anéis, um brinco, um brinde, um terço\nUm maço, um vinho, um jazz, então façamos do seu jeito\n\n[Ponte 2: Tiago Mac]\nCê vai conhecer meu pior\nMeu pior\nEu tento ser melhor mas você não ajuda\nCê vai conhecer meu pior\nMeu pior, meu pior\nMais denso do que Belchior\n\n[Verso 2: Tiago Mac]\nHá anos eu tô na barreira e vendo vocês cobrarem falta\nOntem se foram no vento e hoje vocês não fazem falta\nAvisa pra esses fake niggas que agora acabou o amor (Acabou)\nFoda-se rádio e coração! Eu vim pra tocar o terror\nMas o que cê tem nesse coração?\nCalma, não maltrate meu coração\nMúsica é arte de se expôr e eu tô que nem Adão\nÉ uma confusão, cada passo em vão é uma frustração\nE de acordo com a pulsação, não tem melodia\nNão tem visão, hoje não é seu dia\nNão tem refrão\nFiz um EP pra ela e ela nem ligou\nVou fazer história e cada vitória eu dedico a ela\nSó que, Cinderela\nA sandália quebrou\nMas daria um filme, daria um filme\nDaqueles clássicos que não existiu\nGangsta amoroso e Ana Lice, patrícia de Beverly Hills\nSabemos que não é na força, é no jeito\nJoga no meus peito que eu faço direito\nO mal do século é fazer mal-feito\nE se ficar ruim vai dizer que é conceito\n\n[Refrão: Bob]\nUm quarto, um drink, anéis, um brinco, um brinde, um terço\nUm maço, um vinho, um jazz, então façamos do seu jeito\nUm quarto, um drink, anéis, um brinco, um brinde, um terço\nUm maço, um vinho, um jazz, então façamos do seu jeito\n\n[Verso 3: Sant]\nSeco, igual meu coração\nPeco quase por condecoração\nVim pra viver e aprender até que o corpo se separe desse som\nEco\nÉ que meus olhos sempre vão de encontro aos seus\nSou a água que escorre após\nPerco certo de que o destino de um covarde é passar tempo a sós\nPra lembrar que é tarde pra reatar nós\nDivino karma desse solo\nVoar em sonho e acordar no mar, sem força\nAmar é fogo, ouço\nMedito e de mim tomo uma coça\nParece que o mundo ficou raso ao fugir pro fundo\nCaiu pro acaso\nAguardar o ocaso e seguir sem rumo pra que a Lua abra a flor\nQue mais consumo noutro vaso\nVácuo da minha mente é meu cárcere, meu caso\nSumo, fraco demais pra ser só o que querem que eu seja num prazo\nÓbvio que vai ser um atraso\nAtrás de um motivo que eu não viso e não ter mais o que preciso no sorriso\nÉ caro! Desilusão de muitos, não ver o que é raro\nAssumo, não foi minha intenção ser claro\nPersuasivo, sigo doente e quem vem dizer que entende\nMente, nunca sentiu o que eu sinto na merma proporção que o inverso é coerente\nUno versos que voam pra longevidade que tá presente\nVai correr do eterno? Céu tá nebuloso, igual seu caderno\nE me parece que somente é transparente esse meu Inferno\nGrito do silêncio cobra o que devia e eu escutei tudo em poesia\nDesfrutei cada erro feito em nostalgia\nArrependimento é só o que apelidaria\n\n[Ponte 3: Sant]\nNum quarto de hotel faço um blues antigo e penso:\nO mais importante disso é nós tá junto ano que vem\nTá ligado, não? Anéis, Brincos, Cordões e Versos\nCompromisso que nos mantém lembrança à quem virou exemplo\nSANT!\n\n[Ponte: Bob]\nEntão falar que num me viu\nCê ainda sabe quem eu sou\nFalar que num sentiu\nÉ que seu rap num tem soul\n(2x)\n\n[Refrão: Bob]\nUm quarto, um drink, anéis, um brinco, um brinde, um terço\nUm maço, um vinho, um jazz, então façamos do seu jeito\nUm quarto, um drink, anéis, um brinco, um brinde, um terço\nUm maço, um vinho, um jazz, então façamos do seu jeito"}], "artist": "Bob do Contra"}