{"artist": "Yung Joc", "songs": [{"album": "Coffee Shop ’12", "image": "https://images.genius.com/22499e1de4fddec5dee3a6c7062bbea4.420x420x1.jpg", "year": null, "lyrics": "[Intro]\nWelcome to Starblocks\nIt's Young Dirty\nWho's this?\nIt's Young Dirty!\nOh okay, what you need?\nAy, I need some of dem thangs man\nHow many of 'em?\nTwo of 'em, give me two\nI got you, pull on around to the window pimp\nAight shawty\nAy ay ay Joc! {Whattup Pak Man}\nCu-cuz out there say he need two of dem thangs\n{Oh yea he want TWO of 'em?}\nYeah {Aight}\nAy Joc {Whattup?} You know the motto! {Yo}\nHustle by any means, nigga~!\nHAAAAAH! (Don Vito)\n\n[Hook]\nFirst I take they order like the coffee shop (HEY)\nThen I steam it up and cook it like the coffee shop (HEY)\nAnd then I sevre it out the window like the coffee shop (HEY)\n(Got the work comin in, got my rims sittin real big)\nAnd it ain't no returns at the coffee shop (HEY)\nMan I make that paper stack up at my coffee shop (HEY)\nOne hit and they'll be back to the coffee shop (HEY)\n(Got the work comin in, got my rims sittin real big)\n\n[Yung Joc]\nHey hey, ayyy, okay\nIt's just another day at the coffee shop\nI grab them coffee beans, time to heat them coffee pots\nTurn the lights on, J's rush the parking lot\nThis the neighborhood's number one stop 'n shop\nNo regular, we only serve the best\nFo' the low-low, cheaper than the rest~!\n\nI'm takin orders, tell me who's nextOnly cash, no credit, no checks\nWhen your car stop, welcome to Starblocks\nYou wanna triple your knot? Invest in our stock\nAnd now we doin numbers, just like the close-out\nMake sure to shop with me, before it's sold out\n\n[Hook]\n\n[Gorilla Zoe]\nWe cook it in the mornin, sell it during the midday\nWhip the cream, same color as ya latte\nI tell em vamanos, that's rapido\nYou need some mo' {?}, you go call Gorilla Zoe\nYou can get the co-ca, if you got to get it green\nColumbian, and I ain't talkin coffee bean\n12 to 12, there's always someone on the scene\nStarblocks, we get it out by any means\nCoffee shop, the drop spot, hand the ham, get my gwap\nPocket stale, ounce for ounce, decaffinated off the top\nRockstar, rollin rocks, piano keys work the block\nWelcome to Starblocks, we chop like the coffee shop, let's go\nSee...\n\n[Hook]\n\n[Yung Joc]\nHa, ah-ha, okay\nEverybody on the block know my nickname\nWhen you drop by, just ask for whip game\n\nAnd all my money get counted when the shifts change\nThen get 211 left by fo'-fifth manye\nIf you need the number 1-800-Starblocks\nCoca latte, damned to make yo' heart stop\nAnd now the haters hot, so they run and tell the cops\nSo they shut this down, we'll set up shop on another block\n\n[Hook]\n\n[Outro: Yung Joc]\nAy Pat (pimp whattup)\nIn the South where they can find this at\n(You ought know - coffee shop)\nWhen we on the West coast where they gon' find us at\n(At the - coffee shop)\nWhat about up top shorty, where they gon' find us at\n(At the - coffee shop)\nAy kids, please don't do drugs\nJust bring 'em to me, and I'll get rid of 'em at the - (coffee shop)\n(HA-HAH, Joc you stupid!)", "title": "Coffee Shop (Dirty Version)"}]}