{"songs": [{"year": "2012-10-03", "title": "Feet On The Ground", "image": "https://s3.amazonaws.com/rapgenius/1374583262_saigon.jpg", "lyrics": "[Hook]\nI feel like I’m going crazy, love me or hate me\nWho’s gonna save me from myself?\nWhen I feel like there’s no one else\nWhen it feels like there’s no one left\nTo keep my feet on the ground...\n(Going, going crazy\nFeel like I’m going crazy)\nCause I’m happy now, but I’m crashing down\nWho’s gon' save me from myself?\nTo keep my feet on the ground...\n\n[Verse 1]\nI’m a vigilante, I do some shit if a nigga dare me\nI got no friends and even less that I consider family\nMy attitude is fuck 'em, I buck em if they come close to me\nAnd I don't use codefendants nigga, it's just the toast and me\nI watched First 48, see how niggas get caught\nIt’s hardly ever the killers, some snitch is always at fault\nAnd we was taught not to talk, soon after we learned to walk\nYou tattletale on your sister, your ass is getting the bulk\nOf her ass whipping, we slipping, raising our kids different\nI try to tell these niggas but why the fuck won’t they listen?\nIt’s a lot of poetical prowess in my position\nBut it seems like the riches and bitches blinding they vision\nSo fuck them and fuck whoever don’t understand\nI’m a man, a man with the courage to take a stand\nI might run in the precinct with a gauge in my hand\nBe front page with a grenade in my hand\n\n[Hook]\nI feel like I’m going crazy, love me or hate me\nWho’s gonna save me from myself?\nWhen I feel like there’s no one else\nWhen it feels like there’s no one left\nTo keep my feet on the ground...\nCause I’m happy now, but I’m crashing down\nWho’s gon' save me from myself?\nTo keep my feet on the ground...\n\n[Verse 2]\nYou sit with the angels, you don’t look at life from a perpendicular angle\nFucking with these strangers'll get you strangled\nI mingle amongst the murderers, grew up amongst the dealers\nAnd real niggas laughing, cause y’all diduntdidunts to killers\nI might option to just go back to the old Giddy\nWhen I was roaming the city with that chrome 4 fitty\nSo pretty, pearl handed, the blickidy blick blicky\nIt used to come so in handy, when situations got sticky\nI’m picky and I don’t like this new generation of rap\nAnd I am hating, in fact, I hate the fact that it’s wack\nSlap, the living shit outta anybody come back\nMy niggas ready for war, y’all only ready to rap\nI’m an old head, that probably used to beat up your biological\nBack when they had The Wiz and the Biz was diabolical\nBut now I’m ready to do it, it’s me against everything\nPain is love motherfucker, here, here go a wedding ring\n\n[Hook]\n\nI don’t think y'all understand how real it is out here\nYou know what I’m saying?\nYou believe these little rappers, they talking bout this glamorous lifestyle\nBut in the streets it’s still real, it’s still real in the streets\nThey don’t got Bugattis and Lambos and Murcis\nThey don’t got that, they got hoopties\nThey still out there shooting and killing\nOver some crumbs, let’s get real man, fuck it!\n\n[Hook]", "album": null}], "artist": "Saigon"}