{"songs": [{"title": "Eski Shells", "lyrics": "[Verse 1: AJ Tracey]\nIt could all go wrong on a grim day\nRuin man's day, give a fuck what his ting say\nDon't get pumped cuh your chick's in sight\nCuh the 44 long looks thick like Kim K\nDrama like a goal in the 90th\nIn the dance, wapped up, I'm a 90s kid\nGrab a bitch, spilling yak when I'm wavy\nRed Bull all on her chest, that's hyper tits\nSee, it's hot in my bits\nSee, in my bits, let sticks pop in my bits\nYoung Gs with a flick and a rock in my bits\nMy niggas are on tops in my bits\nIn my bits, don't come to my block\nDial in man for the bits on the blocks\nYou're a sideman, Lonsdale all on your top\nAnd you cat for the dro when you don't have gwop\nArmani man bags, not here for the fashion\nOne hand in if a yout starts gassing\nHeadstart, run but the T will catch him\nNo encore, see the snub start clapping\nThere's bare machines like Maplin\nHe left his iPhone in the seat that he sat in\nGirls try run all over the set\nBurst tryna dodge bros and the shots start flapping\nInsta drop man, no iPhone apping\nFriends get snapped so they wanna start backing\nBare change pots, I'm Django jacking\nUPS goons cuh the team's all packing\nGet banged for the greaze they are chatting\nGunman? Who? What rifle you clapping?\nStill clingfilm that I keep rapping\nTemper tantrum in the trap, I'm stamping\n\n[Verse 2: Mic Ty]\nI don't think they can handle the guy\nLike \"how we gonna take his lines in the night?\"\nThat's mad, that's facts\nWhen I'm gassed, there ain't no drought when I sight\nI'm pulling off shots, I am fully on job\nI ain't talking white as in white\nI'm talking grime as in grime\nYeah, the name's Mic to the Ty with the livest of vibes\nSince this guy has arrived\nSince this guy has arrived, they strive off the hype\nThat's normal, so\nShell this shit on the normal, bro\nGet my bread, that's normal dough\nTruth be told, your corpse is owed with your awful flows\nI'm on set and you've said two bars\nWith your Beckham tekkers, it's best you pass\nThat's real, these were bedroom bars\nNot a year ago, these were bedroom bars\nNow I guess Déja is the bedroom, darg\nI talk stuff, talk, cuz, you talk crud\nBut talk up when I tool up, your talk's done\nYou still don't get it, you can mark me out the game, cuz\nYou still won't win it\nI'm Suarez, you're a bit-back\nIf you didn't get that, you're a bit-back\nNew fresh of breath like a Tic Tac\nAnd the flow is nice, it's mad, you get that\nYou'll get left back if you don't Patrice Evra\nSorry, if you don't practice ever\nSpecially if you're not match-fit, brother\nCan't match me, brudda, score hat trick, bruddas\n\n[Verse 3: AJ Tracey]\nNo greaze bars in this one, no lie\nI collect art, so I'm on an artsy vibe\nSo forward that I can't rewind\nMan, I'm so cashed out that I can't decline\nYou man are broke and you're hating\nNo bra for bruddas that get weighed in\nYou man are haps cuh your jeans cost two bills\nFam, I spend that on a frame for my painting\nSB.TV, Rinse, BBC 1Xtra\nI've had a whole bag of airtime\nI've got bare sick bars, can't air mine\nI heard man's send, but where is it?\nIt must have got lost like a Malaysian airline\nI'm on point like a Caucasian hairline\nYou man are wank cause you wank in your spare time\nMe, I just vibes, write bare lines\n\n[Verse 4: MicTy]\nMurking again and it must be told\nAin't gonna lie, man, I love it loads\nI'm just getting my bread up, we touching loafs\n[?] gone, I'm coming home\nMight see me in Greengate with a few team mates\nYeah, let's go now\nThey replaced the pub with a Tesco now\nIt's still a place where the mess goes down\nDown, MicTy will dead your sound\nDon't wow, you see him as a threat, no doubt\nLet's see how long the best holds out\nWhen I'm breathing down his neck for a while\nName's MicTy, got a next profile\nCome against me? Need Jesus, bro\nYeah, yeah, your team is jokes\nYou've got no chance just like England's hopes\n\n[Verse 5: AJ Tracey]\nWho's this yout tryna stunt on the back roads?\nHe'll get wet like Kelly from BangBros\nYeah, I drive through, hit it back, then I slang Os\nNo COD 4, wig shot for the tangos\nHe's tryna screw, getting fucked up\nHe'll get wet like a ting getting touched up\nCuh he weren't saying that much when we bucked up\nNow your wife's all on the phone like 'tut tut'\n\n[Verse 6: MicTy]\nWhere I'm from, manor is mental\nDon't get man ah man ah mental, dem man ah man ah mental\nWatch your manors, are you mental?\nRun up on your flat and your manor, that's mental\nWhere I'm from, manor is mental\nDon't get man ah man ah mental, dem man ah man ah mental\nWatch your manors, are you mental?\nRun up on your flat and your manor, that's mental", "year": "2015-04-08", "album": "Left Back", "image": "https://images.genius.com/a79cca7703972aaed6c2cdee639d33b1.500x500x1.jpg"}], "artist": "AJ Tracey"}