{"artist": "Ice-T", "songs": [{"title": "409", "lyrics": "It's time to start the party if ya'll don't mind\nMe and E clean our Adidas with 409\nHe rocks the highs, I dog the bass\nYa wanna hear us rock? Here's a taste!\n\nEvery day I make a sandwich with ham and cheese\nUse miracle whip, I don't like mayonnaise\nI eat a can of beans, good for my heart\nAbout 1 PM, I always...\nFar from me to bite another's rhyme\nThey're just too easy to write, I do 'em two at a time\nLike doggin' the wax and ya don't quit\nAnd if you didn't like that then suck my...\nDictations how I write my raps\nCold maxin' with two freaks upon my lap\nChillin' on the phone, bookin' more def shows\nAnd if the freaks get illy, I smack the...\nWhole days of my life are spent inside my bed\nJust maxin' and relaxin' like I'm at club med\nYa say you like this record, you think it's fun?\nParty people get stupid, we just begun!\n\n(Break)\n\nYou're get, get, gettin' real stupid\nAs the beat hits your body (get ill)\nYou ain't dumb, you paid your dollars to party (go off)\nThe girl you're dancin' with has got great hips (bug out)\nGo on, homeboy, and grab her...\nTape recorder, turn up the bass\nNo time to waste, just dog the place\nR-R-R-Rocket like a missile in space\nEvil E keeps his 1200s in an anvil case\nWe fly T.W.A., Pan Am, P.S.A\nTo places close to home, far away\nL.A., New York, Detroit, Miami\nIf I see a girl and like her then I let her see my...\nJam rockin's how I got my fame\nIce capital T, Evil E's his name\nIf you can't see who's rockin' you must be blind\nYou better clean your gazelles with some 409!\n\nGo, Ice, get busy\nGo, Ice, get busy\nGo, Evil, get busy\nGo, Evil, get busy\n\nTurn up your stereo, equalize treble\nBass be kickin' stupid hard as metal\nOn the mic tonight, you're right, your rhyme opponent\nM.C. Ice T just microphonin'\n33 and 1/3 revolutions per minute\nThis record is def because my heart is in it\nVocals laid by the Ice, tempos tight and precise\nSpecial effects will be created by an editor's splice\nThe funk is in it, ya dig it, so stop that frontin'\nBust a move to my groove, work your body, do somethin'\nNo way in the world that you can deny my method\nAs my record rotates, my words get more impressive\nI'm an M.C., Evil's my DJ\nOn Sire Records not M.C.A\nC.B.S., Capitol, cause they move too slow\nNow Sire/Warner Bros. (clocks all the dough)\nAs the record revolves money's gettin' made\nA.S.C.A.P. pays me every time it's played\nI chill in def leathers pure silks and suede\nAnd the gold around my neck will never fade\nDown with my Syndicate organized rhyme\nKickin' def tempos that I design\nAnd if you can't hear 'em, that's such a crime\nYou better wash your dirty ears with some 409\n\nI always rhyme elite, stay on beat\nI travel in a posse when I walk the street\nI loved to say my rhymes when I used to max\nNow I don't speak much, I save my words for wax\nI just wanna make a little point in this song\nWith a little nonsense we can all get along\nAnd on and on till the break'a break of dawn\nThis jam will never play out because the groove's too strong\nGuys grab a girl, girls grab a guy\nIf a guy wants a guy (please take it outside)\nI wanna make ya enjoy yourself\nOn the mic tonight (Ice T!) Who else?\nEvil's on the cuts, Henry Gee's shot gun\nIslam's my producer, Bambatta's son\nBronx Style Bob's cold watchin' my back\nMelle Mel's just layin' for some punks to act wack\nGrandmaster Caz and Donald D\nScott La Rock, Red Alert, Chuck Chill Out\nIf you're down with my crew, you will be fine\nBut if you ill we'll get dirty, bring your 409!\n\n(Break)\n\n409", "image": "https://images.genius.com/4087bd0151e7fc336a1bdb7aca3ef257.1000x1000x1.jpg", "album": "Rhyme Pays", "year": "1987-11-04"}]}