{"songs": [{"album": "Gravitas", "image": "https://images.genius.com/54775ab17c42667fc0aa1f24ca5154f5.500x500x1.jpg", "year": "2013-12-15", "title": "Demonology", "lyrics": "[Intro: Talib Kweli]\nI see 'em, I see 'em\nYou don't see 'em?\nFor real?\nLook around, son\nLook around, son\n\n[Verse 1: Talib Kweli]\nTake a trip, I got you floating on this real spit\nI rock the boat so much you get nauseous and start to feel sick\nToo many house niggas, I'm taking 'em on a field trip\nYour fate is sealed: a life that come with a kill-switch\nMy wife said I've got demons I've yet to deal with\nBut I ain't trying to hear her though, my music is my mirror though\nThey like to put me on a pedestal for conscious rap\nMy flesh is edible, it's hard to keep the monsters back\nThe polar opposite of too emotional\nGot feelings and emotions, just hoping I don't overdose\nAnd miss the moments trying to control 'em til I'm on overload\nOr hard to handle, we get dismantled and now I'm home alone\nI power trip like I'm sampling Hubert Laws no more\nI got honor, face my karma like a Buddhist law\nI got my own demons, what I'm supposed to do with yours?\nI got my own demons, what I'm supposed to do with yours?\n\n[Chorus: Talib Kweli]\nToo many demons in the dance hall\nAnd they stomping on what you stand for\nDorothy Parker in the tub with her pants on\nReady for a night at the opera with the phantom\nThey live in the shadows of the angels\nThe punchlines of the rap battles to entertain you\nProof that evil words can maim you\nProof that evil words can maim you\n\n[Verse 2: Talib Kweli]\nDemons want a pound of my flesh, it's quite accurate\nIt's tragic when you feel like your lawyer the devil advocate\nLegal-ese ain't a language, they made it up\nNo wonder I'm losing blood, everybody taking a cut\nSpeaking in tongues, they depleting your funds, beating the drums\nOf war to fry lines to your fortunate sons\nYou think boys point guns when they run to the sun?\nA decoy, Pink Floyd, cause they're comfortably numb\nWord, wrapping ourselves in denial like it's a warm blanket\nTrying to go native like faces that get war painted\nPac shot in Las Vegas of all places\nFighting dark sides of the Force like he was Lord Vader\nY'all haters develop and lead the role\nWhen they start to give 'em parts of your life and feed the trolls\nI got my own demons, what I'm supposed to do with yours?\nI got my own demons, what I'm supposed to do with yours?\n\n[Chorus: Talib Kweli]\nToo many demons in the dance hall\nAnd they stomping on what you stand for\nDorothy Parker in the tub with her pants on\nReady for a night at the opera with the phantom\nThey live in the shadows of the angels\nThe punchlines of the rap battles to entertain you\nProof that evil words can maim you\nProof that evil words can maim you\n\n[Verse 3: Big K.R.I.T.]\nThis feel like church, save that soul\nThat cry \"good God, oh me, oh my!\", I got to save them\nAll. Pray the Lord forever call on him\nFor setting the screen for evil things, then letting me ball on them\nPick and move, or you could die, nigga\nChuck and jive to stay alive, nigga\nPropane flames burn your boots like strange perms\nSome think \"Don't take, will\", but fuck it, you live and learn\nBeware of the roots and salty looks\nVoodoo they put on you, baby doll could leave you shook\nPens and needles, hoes and blokes\nWhen it cracking, come snapping out even, kept them feelings afloat\nI know, cause my folks lost souls off coast, never found\nThe triangle ain't just an ocean, it's on the ground\nTake heed of the sign, dodging demons that find forgiveness\nYoung Krizzle\n\n[Chorus: Talib Kweli]\nToo many demons in the dance hall\nAnd they stomping on what you stand for\nDorothy Parker in the tub with her pants on\nReady for a night at the opera with the phantom\nThey live in the shadows of the angels\nThe punchlines of the rap battles to entertain you\nProof that evil words can maim you\nProof that evil words can maim you"}], "artist": "Talib Kweli"}