{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/a8906126ae46a874605d38c7d1e89e9e.1000x1000x1.jpg", "year": "2011-05-10", "album": null, "lyrics": "[Intro: Yelawolf]\nWe’re gonna move from Yami, Miami to atlanti, all the way to Bami\nIts Yelawolf, Catfish Billy, featuring none other than the greatest, Jim Johnson, B.o.B\nMixtape for you bitches!\n\n[Verse 1: Yelawolf]\nIt’s B.o.B. and Yeller\nAnd this here is my feller\nFrom Bama to Decatur\nWe slamming posing players\nThose sounds are fucking haters\nI see 'em on the ground\nThey get chopped up like a grass blade\nWhen the lawn mowers running out\nGet weed eated, mistreated\nThis heat with this MC\nIt is a blessing to behold\nSo hold this Bible, hoe!\nOut of control, out of my head\nAnd when I roll up out of my bed\nI could put a bitch on total freeze\nWhen I give her my morning breath\nThat's right hooker, get the up out of here\nYou ain't gotta love me, just get hell up and get me a beer (Another beer!)\nWe're drunk, Jim Johnson put more in the trunk\nLet it bump, 12 inch thump, pulling up to the southern club\n\n[Chorus: Yelawolf]\nIt's a party\nOh oh oh (It's a party)\nOh oh oh oh (It's a party)\nOh oh oh oh (It's a party)\nOh oh oh oh (It's a party)\n\n[Verse 2: B.o.B]\nIts B.o-bizzle in this bitch, somebody roll up a spliff\nI got a big ol' bottle baby, come here here and get you a sip\nSomebody must have told that girl that I be digging thick hips\nAnd God must like big booties too, or else they wouldn't exist\nNow somebody tell me what in the hell im gonna do with all that ass\nI seen this girl she looked kinda cute, so i gave her 20 in cash\nShe winked her eye, she sat me down, she said \"now just relax\"\nI said \"you'll have to stand with that, if you dance you'll break my lap\"\nDamn, that thing can't be real, can it?\nGot a nigga speaking Spanish, like no hablo English\nGirl i ain't complaining, I'll keep making payments\nIf you keep that thing swanging by my way, damn it\n\n[Chorus: Yelawolf]\nIt's a party\nOh oh oh (It's a party)\nOh oh oh oh (It's a party)\nOh oh oh oh (It's a party)\nOh oh oh oh (It's a party)", "title": "It’s A Party"}]}