{"songs": [{"year": "2015-10-26", "image": "https://images.rapgenius.com/ec6a789cde0314664430807d294e02c6.500x500x1.jpg", "title": "Guillotine Flow", "album": null, "lyrics": "[Hook: Big K.R.I.T.]\nYou geekin’ huh? You geekin’ huh?\nYou geekin’ huh? You geekin’ huh?\nEh nigga this that guillotine flow\nI’mma cut them niggas down, shorty, anything goes\nWasn't none of them niggas around, shorty\nNow I’m on my king shit, C.R.E.A.M. shit\nEagle wing shit, bubble a high beam shit\nGive ‘em that dope that fiends get\n\n[Verse 1: Big K.R.I.T.]\n5 star flow, been a while since I done bossed up\nRound table talkin’ I’m seasoned so put the salt up\nGet crossed up, I’m Crawford, you awful, give the ball up\nWe all in, no fallen’, from that platform, got tossed up\nLike [sit here?] don’t worry about these others\nIf I let you push that foreign with fins that mean I love you\nPut that shit to heart, played my part, 'til my closet's Noah’s ark\nGator toes, fox and furs, matching belt, life is hard\nSo I hit the strip money making KRIT\nUsed to bang for a block, now I’m on my acre shit\n40 and a mule, anything else minuscule\nI ain’t asking for your plate, I just wanna be full\n\n[Hook: Big K.R.I.T.]\nShorty cause this that guillotine flow\nI’mma cut them niggas down shorty, anything goes\nWasn't none of them niggas around, shorty\nNow I’m on my king shit, C.R.E.A.M. shit\nEagle wing shit, bubble a high beam shit\nGive ‘em that dope that fiends get\nYou geekin’ huh? You geekin’ huh?\nYou geekin’ huh? Yea you geekin’ huh?\n\n[Verse 2: Big K.R.I.T.]\nServe it like some hubbers on the corners\nTo them geekers and them freakers and them stoners\nThat fiend for that very moment\nBrakes were screeching like sneakers but the speakers\nWas beating so loud nobody could peep it\nThey double back like “what you sold me?”\nThis shit here OG for the low-low, I can’t go forth without\nPaying you more though cause I’m oh-oh-oh-oh-oh so high\nThat’s what I hear a lot but my product is real rock\nNirvana with the ear throb, if you need more you should try\nNever stepped on upper echelon with the fire\nNow run along, keep the line moving\nCause there’s more folks that wanna buy\nAnd we got that, never sold out, can’t hold back supply\nUnless you searching for that wack shit, I ain’t that type of guy\n\n[Hook: Big K.R.I.T.]\nShorty cause this that guillotine flow\nI’mma cut them niggas down shorty, anything goes\nWasn't none of them niggas around, shorty\nNow I’m on my king shit, C.R.E.A.M. shit\nEagle wing shit, bubble a high beam shit\nGive ‘em that dope that fiends get\nYou geekin’ huh? You geekin’ huh?\nYou geekin’ huh? Yea you geekin’ huh?\n\n[Verse 3: Rapsody]\nRapsody, show me off like a trophy\nFive finger rap a nigga but now I’m Kobe\nI been lying low key but niggas been in the media\nI know your life story without looking up Wikipedia\nIt costs a lot to be famous\nWords don’t break bones but that don’t mean they ain’t painless\nSteel sharpen steel but I don’t know if it’s stainless\nConversations with the older guys laying the game thick\nCame in the game like Jameis on some fucker shit\nNiggas ain't immortal, but living like fuck a bucket list\nBecame famous, get money, spend it on rubber tits\nThe real niggas I know all respectin’ the real shit\nThat’s the media, mama ain’t raise an idiot\nHollered at the Doc and my niggas is like “is you kidding me?”\nYea, game respect game, just promise when the fame come nigga, you won’t ever change\nI’m in this Cam’ron pink, I look good in these streets don’t I?\nNiggas talk shit like a nigga won’t pull up on ‘em\nYou know where I be, talkin’ Common rappin’ bout corners\nI’m the black storm trooper all the whites folks mad at\nDon’t like female rappers? You only mad you can’t bag that\nFuck you and your homeboy, security got ‘em\nYou want a rebound you better holler at Rodman\nNeed a dentist for that bullshit you talkin’ homie\nYou know I keep a new flow if you feelin’ tender on it\nHotline bling and ain’t nobody answering your calls\nHow meek of you niggas not to answer me at all, I feel a way\nBut the album comin’ so I’ll save it for another day\nCalling me Rapsody, ain’t no Tigger though\nShouts to my left coast niggas out on Figueroa\nTo make it spark I ain’t need a trigger or a milli yo\nAll I ever needed was a trill guillotine flow\n\n[Hook: Rapsody]\nShorty cause this that guillotine flow\nI’mma cut them niggas down shorty, anything goes\nWasn't none of them niggas around, shorty\nShorty now I’m on my queen shit, C.R.E.A.M. shit\nEagle wing shit, bubble a high beam shit\nGive ‘em that dope that fiends get\nYou geekin’ huh? You geekin’ huh?\nYou geekin’ huh? You geekin’ huh?"}], "artist": "Big K.R.I.T."}