{"songs": [{"lyrics": "[Intro: Jay-Z]\nUh, uh, uh, uh\nIt's not a diss song, it's just a real song\nUh, you feel me? Uh\n\n[Verse 1: Jay-Z]\nI heard motherfuckers sayin' they made Hov\nMade Hov say, \"Okay, so, make another Hov!\"\nNiggas wasn't playin' they day role\nSo we parted ways like Ben and J-Lo\nI shoulda been did it but I been in a daze though\nI put friends over business end of the day though\nBut when friends' business interests is Day Glow\nAin't nothin' left to say though\nI guess we forgot what we came fo'\nShoulda stayed in food and beverage\nToo much flossin', too much Sam Rothstein\nI ain't a bitch but I gotta divorce them\nHov had to get the shallow shit up off him\nAnd I ain't even want to be famous\nNiggas is brainless to unnecessarily go through these changes\nAnd I ain't even know how it came to this\nExcept that fame is the worst drug known to man\nIt's stronger than, heroin\nWhen you could look in the mirror like, \"There I am\"\nAnd still not see what you've become\nI know I'm guilty of it too, but not like them; you lost one\n\n[Hook: Chrisette Michele  & Jay-Z]\nLose, one, let go to get one\nGet, one, lose some to win some (you lost one)\nStory of a champion\nSorry, I'm a champion\nYou lost one\n\n[Verse 2: Jay-Z]\nI don't think it's meant to be, B\nFor she loves her work more than she does me\nAnd honestly, at twenty-three\nI would probably love my work more than I did she\nSo, we ain't we, it's me and her\n'Cause what she prefers over me is work\nAnd that's where we differ\nSo I have to give her free time, even if it hurts\nSo, breathe, mami, it's deserved\nYou've been put on this Earth\nTo be all you can be like the Reserves\nAnd me? My time in the army, it's served\nSo I have to allow she her time to serve\nThe time's now for her, in time she'll mature\nAnd maybe we can be we again like we were\nFinally, my time's too short to share\nAnd to ask her now it ain't fair, so yeah, she lost one\n\n[Hook:  Chrisette Michele & Jay-Z]\nLose, one, let go to get one\nGet, one, lose some to win some (oh yeah, she lost one)\nStory of a champion\nSorry I'm a champion\nYou lost one\n\n[Verse 3: Jay-Z]\nMy nephew died in the car I bought\nSo I'm under the belief it's partly my fault\nClose my eyes and squeeze, try to block that thought\nPlace any burden on me but please, not that, Lord\nBut time don't go back, it goes forward\nCan't run from the pain, go towards it\nSome things can't be explained, what caused it?\nSuch a beautiful soul, so pure, shit!\nGonna see you again, I'm sure of it\n'Til that time, little man, I'm nauseous\nYour girlfriend's pregnant, the Lord's gift\nAlmost lost my faith, that restored it\nIt's like havin' your life restarted\nCan't wait for your child's life to be a part of it\nSo now I'm child-like, waitin' for a gift\nTo return, when I lost you, I lost it\n\n[Hook: Chrisette Michele & Jay-Z]\nLose, one, let go to get one\nGet, one, lose some to win some (Colleek, I lost one)\nStory of a champion\nColleek, you're a champion\nI lost one", "title": "Lost One", "image": "https://images.genius.com/4969685d350c792424aafc7db0223472.295x296x1.gif", "year": "2006-11-21", "album": "Kingdom Come"}], "artist": "JAY-Z"}