{"songs": [{"album": "K.O.D.", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg", "year": "2009-10-26", "title": "Blackened the Sun", "lyrics": "[Intro]\n(As the sun falls, darkness shall come)\nI went out of my way, to do music for you!\nI did shit with E-40, Scarface\nEverybody, all your heroes, nigga, Yukmouth!\nModest shit! Now I'm 'bout to do it my way!\nI don't give a fuck what y'all think about me!\nCall me devil worshipper, nigga\nYou think that shit was bad? Listen to this, motherfucker!\n\n[Verse 1: Tech N9ne]\nHow do I describe my pain?\nIt just rains and it brings at the same time flame\nI am bane, insane in my veins\nNo restraints can chain or contain me, I'm dangerous\nWhen I gave you my light it was wrong, wasn't right\nAnd no love was in sight when I need it\nSo I run with the night and the songs that I write\nIt be vile and it won't be defeated\nIt's jet black in my brain\n'Cause the hatred you gave me has turned me to twisted\nYou don't like this – suck my dick\nAll the kids with the sickness been waiting for this shit\nI wanna get into the mind of your youngest\nFill it with fungus and grow it 'til it's humongous\nPsycho alumnus, the tip of the tongue slit\nUrging the punk bitch: Eat shit from your dump pit!\n\n[Hook: Krizz Kaliko]\nEveryone, are you ready for doom?\nBecause I've blackened the sun and I've bloodied the moon\nI bring gloom when I step in the room\nWith the fumes of a tomb I consume all the light in the day\nEveryone, are you ready for doom?\nBecause I've blackened the sun and I've bloodied the moon\nI bring gloom when I step in the room\nWith the fumes of a tomb, flowers bloom when I'm taken away!\n\n[Verse 2: Tech N9ne]\nI've got this cloud inside, it's consuming my mind\nAll the brown in my eyes are dissolving\nInto the whites of my eyes, now the night will arise\nAnd I'm hyped 'cause the beast is evolving\nStep into my dreams, lot of bleeding and semen and green rotted demons\nAnd they feed their seeds collard greens\nFull of feces and cheesed pieces of human cerebrum this evening\n(Stay away) 'Cause everything I touch turns to mold!\n(If you want me) Everything I fuck straight explodes!\nAre we there yet? Are you scared yet?\nYou got a pussy in your pants, wanna share that?\nLet me in, I'mma rip it then I'mma tear it out\nI'm tryin' to eat a bitch, where her motherfucker hair at!?\n\n[Hook: Krizz Kaliko]\nEveryone, are you ready for doom?\nBecause I've blackened the sun and I've bloodied the moon\nI bring gloom when I step in the room\nWith the fumes of a tomb I consume all the light in the day\nEveryone, are you ready for doom?\nBecause I've blackened the sun and I've bloodied the moon\nI bring gloom when I step in the room\nWith the fumes of a tomb, flowers bloom when I'm taken away!\n\n[Verse 3: Tech N9ne]\nHeat swells, details\nEverybody eat nails, sleep well\nHeld a gun, I come to attack everyone\nYou little crumbs, all are done, I'mma blacken the sun\nI'll banish it, damage it, can you manage to vanish?\nCut you like Anakin, manic man, damn it, and it's no panicking\nWhen I eat your soul, he's north pole\nThat means I'mma be more cold, freeze more soul, 40 below\nPiss, Lav, and Cuervo, plus habenero, now chug it!\nBurn their head to their toes!\nI will not spare those, I love it!\nThis is the result of you, thinking unclear, callin' me weird!\nThinking I'm a devil so you niggas don't cheer!\nI don't give a fuck what you think of Tecca Nina this year!\n\n[Hook: Krizz Kaliko]\nEveryone, are you ready for doom?\nBecause I've blackened the sun and I've bloodied the moon\nI bring gloom when I step in the room\nWith the fumes of a tomb I consume all the light in the day\nEveryone, are you ready for doom?\nBecause I've blackened the sun and I've bloodied the moon\nI bring gloom when I step in the room\nWith the fumes of a tomb, flowers bloom when I'm taken away!\n\n[Outro]\nThis fun house is crazy\nThere's through doors here\nYou guys go through those doors and I'm gonna go through this one and I'll meet you on the other side\nWow, a big red music box, I gotta see what's inside"}], "artist": "Tech N9ne"}