{"songs": [{"album": "50 Bodies Pt. 2", "image": "https://images.genius.com/6ba79fc48a8e0d59d188e77f9da8bbae.500x500x1.jpg", "year": null, "title": "The Music Industry", "lyrics": "[Scratches]:\n\"How far must you go to gain respect, ummm\" - A Tribe Called Quest 'Show Business'\n\n[Verse One]:\nBefore the internet intervened and the sales we expected to see overseas\nAnd the states and the regions we locked in a previous time\nWe believe you can shine and exceed if you rhyme with a team\nAnd a rhyme and a beat that was fly on the scene you was liable to see\nAnd account full of G's that amount to the cheese\nYou could count on the streets in a drought with them keys\nAnd they spit with a passion, a mission of rappin' was gettin' it lastin'\nNo Cris' in the glass and no spittin' a rachet, a fistful of cash\nAnd now it's in a casket, I miss it, what happened?\nIt's cold but it changed to a whole 'nother lane where the pros are the lames\nAnd the songs are the same and the labels are wack\nCause we make all the tracks and they cake off of that\nI wish we could go back\n\n[Scratch Hook]:\n\"From DJ to DJ\" - DJ Shadow feat. Q-Tip 'Enuff'\n\"This is for all y'all\" - DJ Shadow feat. Q-Tip 'Enuff'\n\"It isn't easy\" - - DJ Shadow feat. Q-Tip 'Enuff'\n\"Respect ummm\" - A Tribe Called Quest 'Show Business'\n\"Industry rule #4080, record company people are shady\" - A Tribe Called Quest 'Show Business'\n\n[Verse Two]:\nThis record here might never get play\n(Why?)\nCause they won't make cheddar that way\n(Ahh)\nRadio ain't stretchin' my way\n(Nah)\nShit man it's prolly better that way\n(Ha)\nSo what about the club?\nWhat about the club?\nThey don't play the shit real hood cats love\nThey ain't tryin' to see the east coast come back\nNow they snap and lean and do all-a-dat\nSo what's hip hop?\nI don't know man\nI guess it's whatever the DJ's program\nWho in charge of that? Not the DJ\nHe play whatever the list say he play\nSo what you sayin' is that he ain't a DJ\nHe's just doin' his job, that what he say\nWell I ain't mad at that, he just tryin' to get his bread\nI guess Nas was right, yo Hip Hops Dead\n\nScratch Hook]:\n\"From DJ to DJ\"\n\"This is for all y'all\"\n\"It isn't easy\"\n\"Respect ummm\"\n\"Industry rule #4080, record company people are shady\"\n\n[Verse Three]:\nYeah, wax turn into MP3s now\nYoutube is the MTV now\nInternet is the new magazines now\nEverybody wanna be an MC's now\nRobots is the new DJ's now\nAin't nobody playin' what they wanna play now\nEverybody up on Myspace now\nTryin' to lay their game down\nTryin' to get a name now\n\n[Scratch Chorus]:\n\"It's isn't easy\"\n\"All y'all\"\n\"How far must you got to gain respect ummm\"\n\"Industry rule #4080, record company people are shady\"\n\"This is for all y'all\"\n\"Shady\""}], "artist": "Termanology"}