{"songs": [{"lyrics": "[Intro]\nIt's the Roc! Wooo!\nNike Airs is right (check)\nMy bucket is low (check)\nMy Rocawear is fittin' incredible\n\n[Verse 1]\nFuck it, I guess I got my swagger back\nMama, they said I killed a man\nWell, I guess I got the dagger back\nIt's the Roc, bastards, we are BACK!\nIn the heezy\nJigga Man, B. Sige to M-Easy (what up, fam?)\nOschino and Sparks and Freeweezy (holla!)\nMickey, Mallory, Chris and Neef, hey!\nAll I need is the love of my crew\nThe whole industry can hate me, I thugged my way through\nAnd all, I, need is a chick that hold a jammy\nLike Meth and Mary, like Marvin and Tammi, uhh\nNow understands we can't be stopped\nFrom blowin' Swisher Sweets outta candy drops\nLike we underground kings, ridin' dirty\nA nigga been focused since I said hi to 30 (what up?)\nYoung niggas, y'all can't hurt me\nBetter watch and observe me\nAnd learn how to earn better, I burn cheddar\nI set fire to your empire\nI blow smoke in your face, burn rubber off of rim tires\nYes I-ah, Jay I-ah...\nDouble G-A, livewire nigga, holla back!\n\n[Chorus]\nAll I need...\nRocawear... (check)\nNike Airs... (check)\nMean bucket... (uh huh)\nArmadale in the club, couple of duckets (yeah)\nCouple chicks by my side, let's ride\nAll I need...\nThat new coupe (got that)\nA doo-rag and a pocket full of loot (got those)\nA sunny day, some chicks they wanna play\nAnd I'll be on my way\n\n[Verse 2]\nCome on… now\nAll I need in this world of sin\nIs me and my girlfriend! (ha ha)\nI got a little two-two, I call her Peggy Sue\nWhen I'm off in the club she fit right in my shoe (wooo!)\nGotta switch her to my waist, just in case (uh huh)\nA clown wanna flip, gotta reach for my bitch\nWanna act out a movie, I could give you a clip (buck!)\nBut no ad-libbin', nigga, stick to the script\nNow all, I, need is a high-priced lawyer\n'Cause it's foul ways nowadays, everybody saw you\nAnd they comin' to court too, I thought you knew\nCan't even steal on a nigga, muh'fuckas will sue\nIn this time and age, what's a real muh'fucka to do\nWhen I'm surrounded by squeal muh'fuckas like you?\nBut real niggas don't fret 'cause the number one crew\nR to the O to the C comin' true\n\n[Chorus]\nAll I need...\nRocawear... (check)\nNike Airs... (check)\nMean bucket... (uh huh)\nArmadale in the club, couple of duckets (yeah)\nCouple chicks by my side, let's ride\nAll I need...\nThat new coupe (got that)\nA doo-rag and a pocket full of loot (got those)\nA sunny day, some chicks they wanna play\nAnd I'll be on my way\n\n[Verse 3]\nListen, the cream too long, my team too strong\nBleek is too hot, Beans is gone\nY'all niggas in the crosshair, the beams is on (see y'all)\nY'all whole block deserted, y'all fiends are gone (bye bye!)\nThe whole Roc is jumpin', we reached our zenith\nGot fiends throwin' up on themself like Willie Beamen (hehe hehe)\nAny given Sunday gunplay's optional\nHowever niggas want it like Soul II Soul (however do you waant it?)\nWhoever got hops get blocked, go to the hole\nDikembe Mutumbo of this rap shit\nPlus the jab is sick, and it's Zab quick\nLeft hand'll lean 'em like a little past six\nNow run along wit'cha little-ass hits\nRead my rap sheet, nigga: three classics!\nShut your bumba', I got A-Rod numbers\nAll you muddaskunks get buried in the trunk\nWhen I blast the pump\nI leave you relaxed in the hospital, lookin' at M*A*S*H for months\nThen I dumps dough on the D.A. desk\nAnd I flee scot-free and pee-pee on the steps\nWe've got no respect, no law or governin'\nWhy you fuckin' with him?\nMatter fact, why you fuckin' with them?\nAll y'all need is the R-O-C, baby\n\n[Chorus]\nAll I need...\nRocawear... (check)\nNike Airs... (check)\nMean bucket... (uh huh)\nArmadale in the club, couple of duckets (yeah)\nCouple chicks by my side, let's ride\nAll I need...\nThat new coupe (got that)\nA doo-rag and a pocket full of loot (got those)\nA sunny day, some chicks they wanna play\nAnd I'll be on my way\n\n[Outro]\nListen\n(All I need)\nRoc-A-Fella Records\nFreeway, Oschino and Sparks, Chris and Neef\n(All I need)\nMickey and Mallory\nBroad Street Bully\nM-Extra Money, ha\nYoung! (All I need) H to the izzo\nClue! Rell\nUh-huh, yeah, yeah\n(All I need)", "title": "All I Need", "image": "https://images.genius.com/1aebfd816914351eb7010bd441822da8.1000x1000x1.jpg", "year": "2001-09-11", "album": "The Blueprint"}], "artist": "JAY-Z"}