{"songs": [{"year": "2011-03-28", "image": "https://images.genius.com/ae59ac20cf16e3a440904aa06dd710ac.1000x1000x1.jpg", "title": "Amtrak", "album": "Return of 4Eva", "lyrics": "[Intro]\nNow won't you chucka chucka chucka chucka chucka? (X4)\n\n[Verse 1]\nI know you hear this train coming rumbling down the track\nDon’t miss out on this pimpin shawty, it ain't coming back\nI'm steamrolling no controllin', while I whippin'\nSmoke stacking, seal cracking while I'm switching\nGears. It makes it hard to hear with 15s in the caboose\nI'm more southern than Norfolk bitch that's why they love what I do\nCaution, danger, when I'm on my shit there ain’t no slowing down\nPicking up the loners that's horny whenever I am in town\nThem yellowbellies, them, them, them coco browns\nThey love to give me that, that chu chu chu chu sound\nI toot my horn to all them haters bumpin, bumpin\n\n[Pre-hook]\nCause I know they hear this train coming\nYeah, bitch I know you hear this train coming, aha\n\n[Hook]\nYou know you want to ride on my locomotive\nAnd I bleed the brakes off the train till you can't control it\nNow won't you chucka chucka chucka chucka chew it? (X4)\n\n[Verse 2]\nI know you hear this train coming you best grab your bags\nDon’t worry about your partners and them just bring your ass\nNow let me break it down (down) before we go\nDon’t hold back what the good lord gave you, let it show\nNow all aboard for all of those that claim they down to get it\nI advise you to exit right now if you ain't down with it\nReally, I am just trying to free your mind from this prison\nI show you how to get out if you just listen\nYou’ll never want to leave ya if you just visit\nThis ain’t no more cars coming calling the time is ticking\nYour homegirl just aight, I'm kind of picky\nBut you a booming business, I hope she got a ticket\n\n[Pre-hook]\n\n[Hook]\n\n[Outro]\nLet me see your ticket\nWhere you tryna go down? Hmmm I dont think this gon' get you there. Yeah I can take you though. If you really wana go there\nYou gotta be just my type, shawty... Because"}], "artist": "Big K.R.I.T."}