{"songs": [{"title": "Million Dollar Mansion", "album": "Long Live Mexico", "year": "2019-06-14", "image": "https://images.genius.com/4edfd3dc0dc69a467c68ebd239be7456.639x639x1.jpg", "lyrics": "[Intro: Lil Keed]\nYeah\nYeah, yeah, yeah\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\nWoo\n\n[Verse 1: Lil Keed]\nThey think they all fly (Yeah), we a different fly (Yeah)\nYeah, we private flight it (Yeah), no need for autopilot (Yeah)\nKnow we get the highest (Yeah), know y'all all dyin' (Yeah)\nLift the doors up (Yeah), my wrist is froze up (Yeah)\nMy neck get colder (Yeah), thought I told ya (Yeah)\nWe in the fast lane (Yeah)\nIn a Hellcat (Yeah), or in a Mulsanne (Yeah)\nIf he bounce back (Yeah), a hundred shots ring (Yeah)\nAin't got no dogtag (Yeah), how you gangbang? (Yeah)\nHe not 'bout that (Yeah), he ain't insane (Yeah)\nGive him thirty shots (Yeah), shoot him Curry range (Yeah)\nFinger flooded (Yeah), cost more than Audi rings (Yeah)\nYeah, we bossy (Yeah), shit be saucy (Yeah)\n\n[Verse 2: Young Thug]\nCosty\nYou said you want a wedding ring, that's when you lost me (Lost me)\nGo big on big, I'm irritated with your mouthpiece\nI drove a G63 Benz to the nosebleeds (Skrrt)\nYeah, I'm her boss, see, see I'm so flossy\nLil' mama said she want a Benz with the Rolls seats (Want a Benz)\nI took a helicopter down to the show freak\nI told her private jet, we goin' shoppin' overseas\nI can go brazy like a shotta, ayy (Brazy like a)\nI got some Mansions on the Southside, ayy (I got some mansions on the South)\nI'm servin' chicken, but not Popeyes, ayy (I'm servin' chicken, but not Pop')\nPay the tuition, not a shotta, ayy (Pay the tuition, not a shotta)\nI told lil' mama, \"Bitch, it's our time,\" ayy (Our time)\nWe got the juice, we got the Wi-Fi, ayy (Wi-Fi)\nWe fuckin' on top our Carter, hey\nI just might pass her to my brothers, hey (Just might pass her to my brothers)\nHundred bands on a seat (Hundred)\nHow the fuck I make a half a million in a week? (How? How? How?)\nYeah, shawty suck me out my sleep\nI don't know just how the hell I woke up with a freak (How? How?)\nGoddamn, I got millions with no piece (Damn)\nDifferent bustdown every fuckin' day of the week (Fuckin' day of the week)\nLivin' easy breezy, we fuck on designer sheets (Woo)\nI had me some Henny with my Act', now I'm deceased (I'm deceased, nigga)\nMillion dollar nig', whip a Maybach out of town (Skrrt, skrrt)\nPatek worth a mink, up in the Benz right now (Skrrt, skrrt)\nKeep designer kicks on my bitch all the time (Skrrt, skrrt)\nParis Hilton mansion in the hills, I see stars (Skrrt, skrrt)\nAbercrombie birds with the doves, we get money (Skrrt, skrrt)\nLambo' hit the curb, when it dark, it look sunny (Skrrt, skrrt)\nI put neon lights in the penthouse for my mommy (Skrrt, skrrt)\nWake up, take a piss, drink a seal every morning\n\n[Verse 3: Lil Keed]\nSpendin' all these goddamn funds\nI just put some slimes and some bands on your son\nChoker shackles outshine the goddamn sun\nJohn Wick shooters, we not scared of James Bond (Woo)\nTalkin' game to get out her panties\nDifferent Chanel, different occasions\nI got hood ratchet shit and she Asian\nWhippin' slime Lam' truck, it's Caucasian\nY'all cat, Tigger\nSee y'all damn whiskers\nHer ass soft as pillows\nGive her nut like brittle\nLouis duffle bag, F&N and bands in it\nYeah, I wore it, left the tag on my expensive drip\nShe not talkin' bad, I go pimp and pop them lips\n\n[Outro: Lil Keed]\nOh yeah, oh yeah, oh yeah\nOh, oh, oh"}], "artist": "Lil Keed"}