{"songs": [{"lyrics": "[Intro: Jay-Z & Rell]\n(We're the ones with the flame) Yeah\n(We're the fire that remains) Turn Rell up a lil bit\n(We're controllin' the game from now on) Huh\nYeah! It's the world-renowned, internationally-connected\nLocally-accepted, Roc-A-Fella Records\nDon't get it confused (Roc, baby)\nDoin' what we do (It's the Roc, baby)\nB. Sig., Rell, Peedi Crakk\nFree, Young H-O, Bleek (You understand)\nAnd introducin'\n\n[Verse 1: Young Chris (Neef Buck)]\nIt's Young C (Young C!), home of Philly, young and hungry\nAll the girlies wanna fall in lust with me\nAnd every hood in the world discussin' me\nI hit it once, then I'ma give it up to Neef\n\n[Verse 2: Neef Buck (Young Chris)]\nIt's Neef Buck (Neef Buck) out the cut (out the cut)\nAll the haters wanna claim that they fuck with us\nIt ain't a game, niggas know that they Toys R Us\nThey can't fuck with us (AAAWWWWWW)\n\n[Verse 3: Omillio Sparks]\nI'm the one, man I'm money, hoes, clothes and shows\nTo do with your ho all wrapped in one, I'm not done!\nMan, I'm the shit after its all said and done\nThe one to cop one, come back for another one\nQuick fast, like rapid refund\nI'm the grrrrrrr, mean green out the money machine\nI'm not done! I'm Omillio\nAnd interviews thought you could hold Sparks in the hood\n\n[Break: Jay-Z & Young Chris]\nAnd you like it\nAll those haters talkin shit we don't like it\n\n[Verse 4: Beanie Sigel]\nWe love it, that black mask, black glove shit\nRoll up on him don't budge, bitch\nWith my MAC, and my TEC, and my vest, just like that\nFor them niggas thinkin' Mack Milli not really from the streets\nI'm that gallstone trapped in the belly of the beast\n\n[Chorus: Rell]\nThose seen here will lead you forever\nAnd we will not leave you, never\nAnd our voices will ring (rrrring!) together\nAs one (AAAWWWWW)\n\n[Verse 5: Freeway]\nIt's young Free! Move, workin' the wheel, hand jerkin' the V\nBusters know if you cross the line, thinkin I'm off my job\nBut I'm on like Chris when he popped his cuz\nThinkin them slugs'll fly\n\n[Verse 6: Peedi Crakk]\nCall me P.C.! Tempers spillin', I peel, look how I'm killin' the wheel\nThe fitted tilt to the left, the shirt blend with the sweats\nYour girls skirts and veils, she undressin', don't stare\nTake a picture, nigga, packin' the bills\n\n[Verse 7: Jay-Z]\nI'm the one! Young H-O, a game of none\nWhat you think I'd do to the brain of that dame you brung?\nListen hon! Twist up one, this is Armi, sip some\nIt's only 40 proof, it feel like 151\nWhen I'm done! Make a run with The Roc\nRock Air Force 1's, rock a bun, hide shit in her hair\nWhen I come! Through customs, cops can't bust him\nIt's Hov' the Hustler, I'm having one hell of a run!\n\n[Break: Jay-Z & Young Chris]\nAnd you like it\nAll those haters talkin' shit we don't like it\n\n[Verse 8: Memphis Bleek]\nNo, we love it, I got a mami with a body\nDon't touch it, you can't fuck with\nYoung Easy, up on the Just Blaze production\nYou get nothin', we get enough spins\nCan't stop us from coppin bottles while we clubbin'\nIt's the R-O-C forever, tell the public, huh!\n\n[Chorus: Rell]\nThose seen here we'll lead you forever\nAnd we will not leave you, never\nAnd our voices will ring (rrrring!) together\nAs one (AAAWWWWW)", "title": "As One", "image": "https://images.genius.com/bbaaa25ac55d3bc2008448e1647d3b54.720x631x1.jpg", "year": "2002-11-12", "album": "The Blueprint 2: The Gift & The Curse"}], "artist": "JAY-Z"}