{"songs": [{"lyrics": "[Dr. Dre]\nThe motherfucking saga continues\n\n[KMG]\nAll hail to those believin in the real gangsta shit\nCause when it comes to the real niggas\nIt makes the shit that much harder to deal with\n\n[Cold 187um]\nYeah, Above The Law up in this motherfucker\n\"Black Mafia\" for life\nDown with the real niggas for life! Ha ha\nYo Sweet Talk, tell 'em what the fuck we here for!\n\n[Kokane]\nWell alright y'all, USC, Compton, Watts\nThe Woods! All across the motherfuckin USA\nYe though I walk through the the valley of real niggas\nI should fear no man or motherfuckin Klan, hear me one\nCause I been to the mountaintops, y'all\nAnd I done seen through the eyes of a real nigga\n(Yo, what you think about the real niggas 187?)\n\n[Cold 187um]\nYo, they make some of the coooooooolest shit I done never heard!\n\n[Km.G]\nYo, for me Km.G I must give it up\nTo the Ruthless motherfuckin gangsters\nFear no mob!\n\n[Admiral Dancehall]\nBecause you're scared mon, you're scared!\nDem de pussy runnin at y'all scared mon\nBend dem silly bumba claat barber 'til de pussy claat run\nBO! BO! BO! BO! BO! Keep Baby-lon on the run, seen!\n\n[Verse 1: MC Ren]\nThe real niggas is back, cause there's too many bullshit records out\nNiggas fiendin for what we put out\nBut you don't have to wait no longer\nBecause the new album is out and the shit is much stronger\nSo many groups made three albums or more\nAnd that weak-ass shit is still sittin in the record store\nThey wonder why it never sold\nNiggas rappin since the 70's and still never went gold\nOur first record sold two million copies\nThat's because you other motherfuckers are sloppy\nYou came out street and crossed over\nAnd after that your career is fuckin over\nBecause of that you're not around\nSo shut the fuck up and witness the sound of some real niggas\n\n[Interlude: Eazy-E]\nYeah, motherfuckers!\nKeepin' all you busters on the run in '91\nKick that shit, Ren\n\n[Verse 2: MC Ren]\nMost niggas can't understand\nAnd never will if they ain't part of the Ruthless mafia clan\nNiggas is dedicated to the streets\nWith hype fuckin lyrics and the dope-ass beats\nThe songs will never come soft, because I come off\nSo don't get in my way cause motherfucker you'll get cut off\nAnd it's somethin you can move your lips to\nTo wrap around my dick and suck if it fits you\nAnd let me now if you wanna ride the D-I-C-K\nAll day that's with no play\nCause ain't no rap group out that I know\nThat make me wanna listen to the radio\nAll I hear is motherfuckers tryin to make a comeback\nWith lovesongs, and that shit is wack\nAnd that's why your ass ain't around\nCause you don't have the motherfuckin sound\nOf a real nigga\n(YEAH MOTHERFUCKERS!!!!)", "album": "Efil4zaggin", "year": "1991-05-28", "title": "Prelude", "image": "https://images.genius.com/378262f83025b434fc5375a332bd1a1f.800x800x1.png"}], "artist": "N.W.A"}