{"songs": [{"title": "Bullshittin", "album": null, "year": "2010-04-13", "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "[Verse 1]\nOkay I say that shit again, I said it once before\nI just, I just, I just, I just want it all\nI glist and shine with Miss Fine\nModel chick, big behind\nBad enough to skip the line, but to me she just a nine\nI hop up out that double O, you can call me Mr. Bond\nBitch I am a monster, I belong on District 9\nCatch me in my office doin' business\nThe fuck you doin'? Bullshittin'\nI get all the eyes when I step inside and\nThey all arise when I am arivin'\nBring out the Rozay and the Ciroc and\nBring out the OJ like Johnny Cochran\nI guess they on son cause my neck look like horizon\nJust a million people behind me and I don't have Verizon\nMan I'm chillin' wit my niggas, nigga\nAnd a couple cool bitches\nWhat the fuck you doin'? Bullshittin'\nMe and my niggas, Say It Ain't Tone\nHundred pretty girlies singin' our song\nYeah I kick my feet up you can't say that I ain't home\nAnd I be blowin' on that reefer you can't say that it ain't strong and\nShe just, she just, she just, she just want a long dick\nI put it in her mouth and now that bitch look like a Conehead\nWhen I'm done go ahead\nWhat the fuck this is?\nWhat the fuck you doin'? Bullshittin'\n\n[Verse 2]\nI hear, I hear, I hear man but that shit just don't compare\nI tell you you the best, when I'm lookin' in the mirror\nBy the time y'all over here, I'm prolly over there\nAnd by the time you ridin' what I'm ridin' on, I'm in the air\nNo wonder why my mind is so cloudy, I'm drowsy\nMy frequent flyer miles is in the thousies I'm outtie\nSomewhere chillin' in Maui swimmin' with the scuba fishes\nWhat the fuck you doin'? Bullshittin'\nNigga I be splargin\nI beg my pardon\nCause y'all niggas is starvin'\nLookin for a bargain\nGone and roll that weed yeah I think it's time to spark it\nCause I be runnin' through them trees, niggas call me Tarzan\nWhat you think we won't stop gone stop?\nSilly ho I'm living out my dreams don't you dare hit that alarm clock\nI'm laid up with yo' girlfriend you knockin' like what you doin' nigga?\nI'm like fuck you doin'? Bullshittin'\n\n[Outro]\nI hit you with a AMC, my nigga that's a full clip\nAnd you could be like me if you just quit with all the bullshit"}], "artist": "Big Sean"}