{"songs": [{"album": null, "year": "2010-10-30", "title": "Coming Home", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "[Hook: Skylar Grey]\nI’m coming home\nI’m coming home\nTell the World I’m coming home\nLet the rain wash away all the pain of yesterday\nI know my kingdom awaits and they’ve forgiven my mistakes\nI’m coming home, I’m coming home\nTell the world I’m coming\n\n[Bridge: J. Cole]\nBack where I belong\nI’ve never felt so strong eh\nFeeling like there’s nothing that I can’t try\nAnd if you feel me put your hands high, high, high, hey\nAnd if you feel me put your hands high, high, hey\n\n[Verse 1: J. Cole]\nThis is my story this is my song\nIf you ain't got the heart, don’t attempt to try this at home\nIt’s just a poem from a man once living wrong\nNow I’m in the zone, tell the World I’m coming home\nBeen a long time coming, been a long time coming\nThis song feel like the greatest of all time coming\nCause I do it B-I-G, I remember we would be high\nWho’d have thought we’d be running rap when we was knee high\nTo appreciate the sun you gotta know what rain is\nOr cause I’m famous you don’t gotta know what pain is\nBut I bounce back, would ya look at that\nI take my spot at the top and I ain't looking back\n\n[Hook: Skylar Grey]\nI’m coming home\nI’m coming home\nTell the World I’m coming home\nLet the rain wash away all the pain of yesterday\nI know my kingdom awaits and they’ve forgiven my mistakes\nI’m coming home, I’m coming home\nTell the world I’m coming\n\n[Verse 2: J. Cole]\nHey, confusion like I was losing my mind\nBut one thing I never lose is my grind\nMy closet need a lot of cleaning now\nI can’t sleep cause I dont like the shit I dream about\nHey Dear Lord please help me get the demons out\nAnd then help me get my genius out\nAnd get back to what I had\nIf my good’s outweigh my bads, do you think my mistakes is gon even out (even out)\nI guess try and see, it’s on my diary, I’m living for my kids\nNow they is just as fly as me\nTalk well, wonder if Andre Harrell knew how great I would be when he fired me\n\n[Hook: Skylar Grey]\nI’m coming home\nI’m coming home\nTell the World I’m coming home\nLet the rain wash away all the pain of yesterday\nI know my kingdom awaits and they’ve forgiven my mistakes\nI’m coming home, I’m coming home\nTell the world I’m coming\nI’m coming home\nI’m coming home\nTell the World I’m coming home\nLet the rain wash away all the pain of yesterday\nI know my kingdom awaits and they’ve forgiven my mistakes\nI’m coming home, I’m coming home\nTell the world I’m coming"}], "artist": "J. Cole"}