{"artist": "Ice Cube", "songs": [{"title": "If I Was Fucking You", "lyrics": "[Intro: Big Worm]\nYeah that's cool\nEr, everything closed so we just\nWe might as well just go straight to the hotel\nAnd just get some rest\nLet me slide this dick up on in ya\n\n[Verse 1: Ice Cube]\nIf I was fucking you right about now\nYou'd have a dick stuck in you (yeah)\nHave to go brag to your fucking crew\nOn how this rap nigga dick you down\nTenderized them guts and didn't have to kick you down\nWho this bitch nigga wit' you now?\nDo we know about your X-files?\nAnd your sex styles?\nAnd all the niggas that you think about fucking\nAnd the shit you know you really wanna do when we buzzin' (hahaha)\n\n[Verse 2: K-Mac]\nIf I was fucking you, shit, it'd be like drama (yeah)\nAnd you might get tripped on by my baby mama (hey mac)\nSo do what I tell you and everything'll be alright\nYou're cute as fuck, plus that ass is tight (hype)\nGet the fuck on 'fore these niggas start to fight\nI can see it in your eyes, you wanna fuck tonight\nGive head and everything, she got a fool in love (fool)\nGave it up to me, a gangsta, after the club\n\n[Verse 3: Mr. Short Khop]\nIf I was fucking you, I'd be pakin the piss\nThe horny weight dick gettin' laid is for chips\nBitch I'm tryina' make grips\nHim in with the trojan pack 'o six\nHin the gin and juice the mix\nNo time to pause, gots to drop draws\nPrep though a ass-spanking', breakin' down walls\nWith tactics, nigga used two prophylactics (double-up)\nHit the twat chopper style\nBang it up back (echo)\n\n[Chorus]\nIf I was fucking you (echo)\n(overlapping) ooh, oo, yeah, a, ahh, uhh, uh, come on\nIf I was fucking you (echo)\n(overlapping) ooh, oo, yeah, a, ahh, uhh, uh, come on\n\n[Verse 4: Ice Cube]\nIf I was fucking you, you'd be like fuck everybody\nCube, this pussy yours\nWashin' dishes, rubbin' floors\nDoin' chores for a nigga\nOpen doors for a nigga\nRidin' shotgun, holdin' forty-fours for a nigga\nAt the motelly, got you on your belly\nIn come morcelli\nNiggas calling K-Mac, bitches calling Kelly\nDo it like Arthur Fonzarelli, hit the lights\nSo we can try to reform these potential dykes\n\n[Verse 5: K-Mac]\nIf I was fucking you, you'd be spendin' all your dough (yeah)\nBuying nigga shit, that you don't even know (mm)\nCredit card maxed-out\nBank account tapped-out\nWritin' bad cheques (hahaha)\nWhen I call you break your neck\nYou do whatever please me, runnin' burs while I take it easy\nWill as you do whatever, live your life just to please me\nThese buster-ass niggas make the shit so easy\n(He was fucking me?) for sheazy\n\n[Verse 6: Mr. Short Khop]\nIf I was fucking you, I'd let the homies fuck too\nRun up in the guts, bust nuts and we're through\nHave you fiendin'\nCooch screamin, needin' cleanin'\nCreamin', tag-teamin', suckin' semen\nKeep it low, put it in your grill cos you love me\nWith video footage of you giving nigga scully (got you)\nHold it till you choked off the bitch then got gut\nAnd roll one to smoke, grab my shit and shake my spot\n\n[Chorus]\nIf I was fucking you (echo)\n(overlapping) ooh, oo, yeah, a, ahh, uhh, uh, come on\nIf I was fucking you (echo)\n(overlapping) ooh, oo, yeah, a, ahh, uhh, uh, come on\n\n[Outro: Big Worm]\nNineteen inches of complicated funk. hahahaha\nAngo urgin', probably be vomiting dick for a week though\nSuckin' on semen, hahahahahahah...\nHmmm... be careful what you wish for, you just might get", "image": "https://images.genius.com/9a92bffe36c691d91a9dd7116941cd17.1000x1000x1.jpg", "album": "War & Peace Vol. 1 (The War Disc)", "year": "1998-11-17"}]}