{"songs": [{"year": "1999-10-26", "title": "The Hit List", "image": "https://images.genius.com/9841a200e7b94485d7e2a91b3dbd2520.700x700x1.jpg", "lyrics": "Intro:\nHuh yeah yeah. Saafir in the house youknowhatI'msayin'? Layin' it down with\nMy nigga Sonnie Black. About to spit this shit to you. You might be on this\nMotherfucker man. You know?\n\nSaafir:\nSince the death of the first two icons I be wonderin'\nWho's gonna be the next to plummet in the dirt\nSomebody is puttin' in major work\nAnd drop the line of these top the line rhymer you know who was the first\nAnd the second MC\nThe shit temps me\nTo keep practicing my aim at the shooting range\nAnd keep my vest\nIn close range to my chest\nSay a prayer to the game\nCause she won't be the same after this\nI heard they\nWho is they?\nI don't know\nBut you know what they say\nDon't believe it till you see it\nBut now I peep the Ebony special Big Daddy Dane or Super Nat\nDeath's comin' three and the shit is startin' to worry me (why?)\nCause this shit got to be connected to a much deeper plot\nMaybe the government is fillin' it\nSince they see them taxes of these millionaire black men rappin'\nImagin' if they got fed up and attached a contract\nTo touch these pathetic lips\nBelieve me\nIt would be called\n\nHook:\nThe Hit List\nBut it never happens to you if you're hitless\nSo you better stay sharp in you mental fitness\nAnd always holla at your follies about business\nWhat is this? The Hit List\n\nSaafir:\nThe newspapers read\n\"De La Soul Is Dead\"\nThe Stakes Is Higher than Hell fire\nShocking news travels like a live wire\nTo the Mississippi connect\nBrought in from a club bathroom\nBartender slipped him a Mickey\nEverybody in hip hop is trigger itchy\nOne of the Pharcyde got smoked in a hotel in Perkipsey\nUpstate with no backin' I'm packin' heat\nLike an immigrant work Nike factory\nI feel like somebody is watchin' me\nI got eyes in the back of my head and under my balls\nCassette from outside bathroom door stall\nWatchin' my back without a pause\nScarface in Houston tryin' not to catch a bullet scar\nRidin' to the studio in bulletproof cars\nATF had a shootout ? wait with FaceMob\nA cashier worker and a grocery bagger was tagged up\nBody bagged up\nPedestrians meeting the concrete\nGettin' faces and body parts scrapped up\nFace Mob swervin' through as they may ? (screeching)\n\nHook\n\nSonnie Black:\nWhat is this the Hit List\nThe Hit List some sick shit over glove shit\nMr. Sonnie Black the fly ass tracks jack\nYou slippin' like bait on a fishing rod\nI'm tryin' to manipulate your fate\nI'm tryin' to get you God\nCause you tailored my made me good and plenty\nYour soldiers turned GI Jane more (Moore) than Demi\nKeep your hustle on kinko\nGod got blessings to give me\n\nSaafir:\nOn Remy and a night chair\nSpit my plot to my partners and hoes sittin' around in nightwear\nCrackin' a window a slight air\nA nigga feel twisted\nThe story\nThe Hit List", "album": "The Hit List"}], "artist": "Saafir"}