{"songs": [{"year": "2017-09-28", "title": "Focused", "image": "https://images.genius.com/1e02982c413c34259cdc75b47211365d.500x500x1.jpg", "lyrics": "[Intro]\nAll I have in this world is my balls and my word and I don't break 'em for no one, you understand?\n\n[Verse 1]\nLookin' in the mirror and I'm liking what I see\nThought I told ya'll once before, can't nobody fuck with me\nI was raised in B-A-Y but was made in S-A-C\nMan the glo up been too real, bet ya'll likin' what ya'll see\nYeah, my mama is a soldier and my daddy is a G\nWhen you put them two together, what you think that made me?\nShe had me at 17, made it work, she did her thing\nYeah, you did it, love you mama, look how I turned out to be\nI did two years in Diego and did three at USC\nThat's a beauty, that's a beast, I bet her brain is so OD\nSaid a prayer to the Lord, keep me safe from enemies\nThen I start losing friends, I thank God for clarity, uh\n\n[Chorus]\nFocused, keep me focused\nAll these little things man, they keep me focused\nFocused, keep me focused\nAll these little things man, they keep me focused\n\n[Verse 2:]\nAny nigga play or disrespect me, he regret me, wish he kept me\nPeople question how they lost me, make it hard, they can't forget me\nWasn't she with so and so? Now she out with who and who?\nNiggas hate when you go do what they would do if they was you\nI said I'm married to the game 'cause the blood that's in my veins\nNo, my father ain't no pimp but he taught me the pimp way\nCan't no nigga disrespect you, keep these hoes up in they place\nYou know you doing something right when they love you out of hate\nI said my father ain't no pimp but he taught me the pimp way\nCan't no nigga disrespect you, keep these hoes up in they place\nYou know you doing something right when they love you out of hate\nYou see I read between the lines, I know yo' praise was really shade, nigga\n\n[Chorus]\nFocused, keep me focused\nAll these little things man, they keep me focused\nFocused, keep me focused\nAll these little things man, they keep me focused", "album": null}], "artist": "Saweetie"}