{"artist": "Angel Haze", "songs": [{"title": "No Church In The Wild Freestyle", "image": "https://images.genius.com/94752f8107601b005d0ccd537b1f7727.500x500x1.jpg", "album": "Voice - EP", "lyrics": "Whats a king to a god?\nWhat are humans to the king of the skies this pride that I'm wearing and this things on my mind\nGot me dressing up my wounds but the seams of disguise can't let em see me hurting can't let em think they on top of me\nTell em all I'm Pass Go Mrs. fucking Monopoly\nSmall town bred girl lyrically a metropoly been runnin' the game african name\nBasically ain't no stoppin me living a nation of rich niggas animal planet and ditch diggers\nSmooth talkers and shit pitchers do whatever it takes to get niggas\nIt's all sad it's really a shame the ones we look up to are really the same is corruption really to blame?\nThe shit that they talking is really the same was really the aim to get you to listen and you payin' attention you notice the difference\nYou notice that the end is closer to the beginning but let me talk a bit slower for you dumb it down kids making the bar a bit lower for you\nA dumb kid is just a kid you can't teach the sky's no longer a limit just somewhere you can't reach ahh\nHow it feel to know ya own niggas laughin' at you and the niggas from your hood keep clappin' at you\nYou tryna run but the pain keep growin' and the past is repeated so the stains keep showin'\nAnd the world is a cold place, maybe the wrong place, and your friends tell you stay hard like stone face but\nA lot of shit you can't understand like where you come from in the motherland, or why Columbus stole my mothers land\nOr why they dealing us the underhand? Why the fuck we don't get no say so and whenever we say so they just wanna say \"grow up\"\nA lot of shit we can't get past like dark and light skinned when it's just black or whether free men are really just that and\nWhy these asians can't just rap why the fuck all our roads pre assigned to us? why they tryna make the past be the bind to us?\nNigga open up your mind be the blinds for you don't let these mother fuckers be your fucking blind folds\nYou think your favorite rappers are just coincidence? You think the sound change was just the instrument?\nYou don't get the undertone they trying implement? Shit, I guess you really don't get it then\nSee this world has been designed for the guppies and niggas in highest power are really the biggest puppets\nAnd know that I don't believe in the curses of generation just know that the fucking past is only intimidation\nJust know that it's a reminder that only hinders your greatness and know that the fucking devil is in the form of these haters\nWho are in the form of these majors and know that your fucking speech is the biggest form of betrayal and\nSince life is merely a conversation pay attention to the words and the lyrics that they be sayin'\nPay attention to them sayin' the realest is what they claimin' then look behind all they words and see what they all displaying\nIs nothing really real huh? They ain't got shit that you can feel huh? 'cuz none of it is tangible no church in the wild\nWe goverend by fucking animals hello Mr. Obama, Comma Mrs. Obama, comma future elections, hello Hillary Rodem\nTell me what are the stakes boiling pot to the plate you can kill some steal some what the fuck does it take\nThen tell 'em you're just a face to present the choices they make and then tell 'em they don't make changes only bigger mistakes\nAnd tell em I said fuck 'em thanks for bunches of nothing land of the fucking free and home of the short comings\nWho put the guns in the palms of the ghetto introduced the colored kids to the psalms of the ghetto\nWho made it just a medal for the seeds of the souls of the slaves of the pasts that they ain't let go\nI talk to god but I swear it's so different 'cuz the pain's so loud that I can bet he won't miss it\nBut the rain slow down I regain my old vision and the blur from the pain and the craze go missing ah\nNeed a sign just one time they don't want you when you real they don't accept your kind\nBut the struggle leads to greatness life is not just a given this shit is what you make it ah", "year": "2011-01-11"}]}