{"songs": [{"album": "Para Tu", "year": "2013-06-26", "title": "Liverpool", "image": "https://images.genius.com/7eee6dd3e21895d3b7efbd8f0ac69d8b.566x566x1.jpg", "lyrics": "[Intro]\n\"You gotta work for greatness, man, you gotta work\nYou gotta work hard just to be good\nFuck being great, so imagine greatness, we gon' be great.\"\n\n[Intro: Johnny Venus]\nI told that bitch to get with me cause I'll be 21 forever\nSkippin' cross the globe, baby girl, what the fuck is bad weather?\nOh, oh, oh, oh, oh\nHe jumped up out the hood, what, you thought he ain't wan' go?\nI told the motherland I'll be back, you ain't know?\n\n[Verse 1: J.I.D]\nSkate, open the drapes\nSilhouette, not a face approaches\nWith a plate full of crepes, grapes with the blunt to chase\nTeeth paste, lay waste, lay pipe\nSay grace, regular George would say that's dynamite\nJJ damn kids, Bebe, damn J.I.D\nAte the whole state, put the straw in the great lakes\nFuck these steaks, tryna get overseas\nTalking shit over trees, bumping Maurice king's treason\nThieves in the night if you readin' it right\nWe breed kings and knights, I'm still peepin' the sights, huh\nFlabbergasted over the lights\nSeen these niggas swagger jackin' over the night\nThat old shit you keep, but this time won't be nice\nYou hit me one time, second time gon' be like\nThe worst death since Michael, shots say Columbine\nShoppin' at boutiques in Niece, I gotta find\nThe dopest unique that speaks what's on my mind\nFeelin' like I left my cleats, I gotta climb in 'em blind\nPlease show me how to get to, or maybe where to find, oh gladly\nMy London gal call me her American daddy\nReflex, no gaggy\nShe fuck with the mind, the tattoos and the swaggy\nI gladly give her the whole bone like Lassie\nBut if she fuck another fella, she dead like Old Yeller\nShe deader than Helen Keller\nI kill her, I really kill her\nI'm chillin', I'm really feelin' myself and I'm really spillin'\nI'm spillin' the whole cup, tell me, have you rolled up?\nJ.I.D got the alligator grip on your whole butt\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nNo, bruh, I'm ready to get this money\nI need more with these White girls who snort lines like they don't need noses\nSpill' Ville billboard's posters\nNeed notice, notification of bosses\nLike Meyer Lansky, you fancy pants fans can't stand me\nJ-I-D, baby, in the eyes for eye candy\nY'all don't understand me\nThis is for my niggas who say \"Fuck understanding\"\nStanding under rain with my toes in the sand\nLightning playin', this shit sound like Coltrane\nYou gotta snatch this mic from my cold dead hands\nAnd probably still have to fight the old dead man\n\n[Verse 2: Johnny Venus]\nI told that bitch to get with me cause I'll be 21 forever\nSkippin' cross the globe, baby girl, what the fuck is bad weather?\nOh, oh, oh, oh, oh\nHe jumped up out the hood, what, you thought he ain't wan' go?\nI told the motherland I'll be back, you ain't know?\nNow usually I don't do this\nUsually, I be tucked off in the corner looking foolish\nHave everybody saying \"Man, who, who, who, who this?\"\nTryna' stick to myself like some praying hands\nOr some crashed aliens\nAnd I dance it like Zendaya dance\nWoo, holy ghost don' got me shiverin'\nTilted with the top with just a little off his rocker\nHe tryna paint his life, his future brighter than his father's\nCrazy, how could they start him?\nJFK with the pardon\nListen, I play it often, it whistles on through the dark\nSee, we be def starring your clan, missing the mark\nI be waiting on ya early like I'm 'posed to play the organ\n\n[Verse 3: Doctur Dot]\nCleaner than a rubber duck, what the fuck?\nMommy suck, daddy yelled \"Please, oh, please! Please, oh please!\"\nSo we can find it, and it's hard to stay with us\nWe just bleed, we just bleed out the eyeball radius\nThe crimson tears of growing up\nI'm super lifted off that Eucalyptus\nWatching all my foolish visions come into fruition\nWhile you losin' business, you stupid nigga\nThem copy-cat maneuvers ain’t conducive to your movement, nigga\nEating cooch for dinner while she do the dishes\nDirect a choir in my sex attire\nLook at your neighbor, tell your neighbor \"Pull her dress up higher\"\nJust like Elijah when I profit, ain't no bush on fire\nStill ain't believing what he's leaving [?]\nIs he a 5 percenter? Kinda hard to Identify when he’s high, spittin' and his eyes flicker\nThen the sky opened up and that lightning hit him\nI'm like \"Damn, I might actually sound alright on this one\"\nWe camping realer than a jungle in the night on this one\nAnd I’m just chillin', imagine me off of my prescriptions\nBring your camera, your brain might deny your business\nSaid bring your camera, your brain might deny your visions\nSpillage Village! I have no life\n\n[Outro: J.I.D]\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up\nLet me, let me hold up"}], "artist": "JID"}