{"songs": [{"title": "Trapspot", "album": "Free Crack 4", "year": "2017-03-23", "image": "https://images.genius.com/db8fe60ae9d2fba6a2ff5ecaf2749d85.355x355x1.png", "lyrics": "[Intro: Lil Bibby]\nBibby frank, why they tried to rob her?\nI got a job for you, meet me in the lobby\n\n[Bridge: Lil Bibby]\nTake my card\nTrapspots, I got trapspots (I got trapspots)\nTurn my momma house into a trapspot (to a trap, ay)\nIn my hood, shit like Black Ops (shit like Black Ops)\n[Female]\n(*oh my god, what is this? an L beat?*)\n\n[Hook: Lil Bibby]\nLook!\nShootouts in my hood, shit like Black Ops\nTurn my momma house into a trapspot\nAy, trapspot, I got trapspots\nLook, trapspot, I got trapspots\nLook, Margiela all kinda flavors (Maison Margielas)\nYou ain't tryna fuck, bitch I'll see you later! (I'll see later!)\nAyy, look. Keep a Gat, that's a fact (that's a fact)\nAy, turn my momma house into a trap, ayy\n\n[Verse 1: Lil Bibby]\nYou know I like a hood bitch, extra boujie\nTook her from McDonalds, got that lil bitch eating sushi\nMake her hold my toolie, we ain't going to no movies\nTell em even if you pay her, she ain't fucking with no goofy\nLook, cooling with my pluggie sniffing raw (sniff that shit, ay)\nLeaning with my shooters sipping raw, ayy\nLil shorty 19, I like her jaw. ay (I like her jaw)\nSwear she swallow everything, man shorty raw. ay (she got a gift!)\nMy young-ins thirsty waiting on that call (on that call, ay)\nI nod my head and they gon' knock ya off, ay (knock ya off, ay)\nShorty got an ass and it soft, look (and its soft, ay)\nAnd she gon give her last to a boss, ay (to a boss)\nOn the e-way I'm just thinking about the past, how...\nLiving with my momma I was fucked up on my ass, how...\nI was out of town, I made my momma sell my bags out\nBout to buy her that new whip, I know you like that Jag, ma\n(get that whip, ay)\n\n[Hook: Lil Bibby]\nShootouts in my hood, shit like Black Ops\nTurn my momma house into a trapspot\nAy, trapspot, I got trapspots\nLook, trapspot, I got trapspots\nLook, Margiela all kinda flavors (kinda flavors)\nYou ain't tryna fuck, bitch I'll see you later! (later!)\nAyy, look. Keep a Gat, that's a fact (that's a fact)\nTurn my momma house into a trap, ayy\n\n[Verse 2: Lil Bibby]\n(cookin') (cookin')\nCooking Ramen noodles out the crack pot\nTell me why I get harassed by the black cops\nYou could keep that, take my young-ins like them black Glocks\nGoofy capping out the oneway, then he got shot\nNiggas sending threats but never see it through\nRiding through the night, they start shooting at my vehicle\nMy young-ins need some work don't make me put a key one you\nPull up with them sticks now candles lit\nMan, R.I.P to you\n\n[Hook: Lil Bibby]\nShootouts in my hood, shit like Black Ops\nTurn my momma house into a trapspot\nAy, trapspot, I got trapspots\nLook, trapspot, I got trapspots\nLook, Margiela all kinda flavors (kinda flavors)\nYou ain't tryna fuck, bitch I'll see you later! (later!)\nAyy, look. Keep a Gat, that's a fact (that's a fact)\nTurn my momma house into a trap, ayy\n(trap, ayy) (trap, ayy) (trap, ayy) (trap, ayy)"}], "artist": "Lil Bibby"}