{"songs": [{"title": "DPG Unit", "lyrics": "[Supafly]\nDoggy struck a match and the match went out\nG-Unit, is in the motherfuckin house\n\n[Snoop Dogg - *echoes*]\nOh shit! (DPG) Yeah, haha\nIt's the motherfuckin DPG G-G-G-G Unit!\nCan you believe it? (believe it)\nOn some gangsta shit, y-yeah\nOn some gangsta shit, straight up nigga\nCheck this out right here though\nCheck it check it out, check it check it out\n\n[Interlude: Snoop Dogg]\nDoggy struck a match and the match went out\nG-Unit is in the motherfuckin house (DoggHouse)\nYou keep talkin shit I'll put my gun up in your mouth\nMy gun up in your mouth, I'll show you what I'm 'bout\n\n[Snoop Dogg]\nSit back, kick back nigga 'fore I click-clack\nDig this, I did that but I can't admit that\nNiggas want some get back, I know it so I get strapped\nSuckas took they laws off, these hoes want my draws off\nCuz tried to foul me, but I had to steel back\nIn fact when I hit him he was bloody in the bilz-nack\nHis buddy tried to peel back, but I had to kill that\nReal niggas from the turf, shit I know y'all feel that\nWe won't talk, ain't no need for that (fuck that)\nThe word on Snoop is I'm a G for that\nA 'G' for what? Fuckin niggas up with no talkin\nSee the best way to leave a nigga's off in a coffin\nAnd now I'm back on the set and I'm walkin\nI done it so clean ain't nobody even talkin (shhhh)\nIt's like flippin a bitch, I'm Crip'n with this\nI'll fuck around and have you niggas missin and shit\n\n[Hook: Snoop Dogg] + (Daz)\nDoggy struck a match and the match went out\nG-Unit is in the motherfuckin house (Motherfuckin house!)\nYou keep talkin shit I'll put my gun up in your mouth\nMy gun up in your mouth, I'll show you what I'm 'bout\n\n[Daz Dillinger]\nYeah, yeah, yeah, yeah\nI here to replenish opponents, you gangstas\nAin't nothin goin on but the crazy DPG Unit, BA-BAY!\nWho that nigga you love to hear from?\nI'm comin back with the full artillery, comin back with them full drums\nI'll beat yo' ass and I'll stomp you out\nWith Buck, Banks, 50 comin just to stomp you out\nSnoop and Supa, Daz C-walkin again for the cash\nWe came from playin them fuckin games so raise up the flags\n\n[Supafly]\nYeah, yeah, yeah\nNow keep talkin bitch nigga, lay your body in chalk\nG dippin, we Crip'n, Dogg Pound Gangsta mission\nBlastin a straight assassin flashin the heat\nMashin with G-Unit, we do it, nigga please move it\nDon't make me cock cause I won't stop\nI got you scoped in my infra, fuck up and I'll getcha\n(Givin death to a nigga tryna fuck wit a G)\nI got my 9 in my pocket bitch, kick off an apocalypse\n\n[Hook]\n\n[50 Cent]\nNigga now gotta let me break it down for you how it's gon' be\nYou don't wanna fuck with Snoop cause then you gotta fuck with me\nG-Unit, DPG - go 'head\nStart some shit, I got my strap with me\nWatch how niggas get to duckin when I get to bustin\nIt's nothin, I'll touch him for talkin too much I'll cut him\nPush my knife in then fuck him\nMan, pussy niggas don't deserve to breathe\nThe strong survive, the bitches perish nigga you'll see\n\n[Young Buck]\nAin't nothin like the smell of gun powder, the shells hittin the pavement\nEven the paramedics couldn't save him\nI gave him one to the chest, and sixteen to the face\nGot knocked then call Cochran to get me off the case\nWe on deadly grounds, I done been to hell and back\nI had to stand out in the rain just to sell my pack\nHangin outta the back of the black Cadillac window\nAdrenaline pumpin, the infra-red on his temple\n\n[Hook]\n\n[Lloyd Banks]\nI'm straight outta Southside Jamaica nigga\nI'm 'bout my paper nigga, your words won't make or break a nigga\nI'll put yo' bitch on a track, make her break a nigga\nGot rings like a Los Angeles Laker, nigga!\nWe smoke more than you can handle\nSo on my regular day I burn longer than a Rest In Peace candle\nAnd my neck piece is a anchor\nA G-Unit gorilla's equivalent to a Dogg Pound Gangsta\n\n[Hook]", "album": "Straight Outta Ca$hville", "year": "2004-08-24", "image": "https://images.genius.com/c4f8631214daf9f3357f633e0f045d6c.1000x1000x1.jpg"}], "artist": "Young Buck"}