{"artist": "Casey Veggies", "songs": [{"title": "Can’t Get Enough", "album": "Customized Greatly Vol. 4: The Return of The Boy", "year": "2016-05-20", "image": "https://images.genius.com/daa24ddfd6ad9746ffe4aa4808772701.512x512x1.jpg", "lyrics": "[Produced by Megaman]\n\n[Intro: Casey Veggies]\nYeah, Young Veggies aw man, yeah\n\n[Verse 1: Casey Veggies]\nWhat's your name girl? Where you from?\nI just want you to dance girl, this your song\nWho made your pants girl, I like the cut\nI got my own brand girl, I look at that type of stuff\nWhat type of things are you into, tell me what's your zodiac\nDo it like all your tires flat, put it in neutral push from the back\n[?] might be [?]\nStart going hard, turn it up a notch\nI met one side of her then at night time she showed me someone else\nI can't get enough of that, girl rewind and run it back\nI need a chick that's bout a hundred stacks\nI'm swagged up, I'm a heart attack\nYoung Veggies I'm good for that\nGirl didn't your momma tell ya\nReal recognize real, that's why I'm looking so familiar\nIt's Peas N Carrots fresh and frozen, put you onto something new\nI been working super hard like five years trapped up in the booth\nPulling up on in an Audi Coop, I just caught that alley oop\nAin't no telling what I might do\nGirl bring your friends when I invite you\n\n[Hook: Tory Lanez]\n[?]\n[?] singing the [?]\n[?]\nAnd I want it all, I want it all\n[?] I can't get enough\n[?] I can't get enough\n[?] I can't get enough\n[?] just can't get enough\n[?] can't get enough\n[?]\n\n[Verse 2: Casey Veggies]\nIt's like [?] when I ride\nYoung Veggies gettin' known, got winners on the squad\nI be doing my stuff, can't get enough\nGot a girl run track, know she got a nice butt\nHitting weights I'm buff, youngest nigga in the club\nPull up in a truck, she was tryna see what's up\nShe be falling in love like a chick in a Benz\nEverything that I spend get it back when I win\nCan't get enough, can't get enough\nCan't get enough, can't get enough\n[?] got that\nI think it's nuts\nBout that life\nAnd she's rolling with us\n\n[Hook: Tory Lanez]\n\n[Verse 3: Casey Veggies]\nWe all gon' drink and we all gon' smoke\nYeah we all got problems but we all gon' grow\nI can free your mind, I wanna free your mind\nGot hoes on my line, she like boy wanna ride\nI could take you all the places that you wanna go\nFront row to the people that you wanna see\nIf you give me that chance I could free your mind\nJust make your mind up what you wanna be\nTold her I need that so she give it up\nGive me some feedback, let me know what's up\nSpend your whole life tryna get it off\nWhen you finally got that could you get enough\n\n[Hook: Tory Lanez]"}]}