{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/3ae84b594a511297bd256cc5b9c33afa.600x600x1.jpg", "title": "Thornhill Dr. (Us Vs Them)", "year": null, "album": "44108", "lyrics": "It's a war going on outside\nShit is going down on Thornhill Drive\nIt's a war going on outside\nShit is going down on Thornhill, nigga\nIt's a war going on outside\nShit is going down on Thornhill Drive\nIt's a war going on outside\nIt's a war going on outside, nigga\nThornhill Drive\n\nFlying down Thornhill Drive\nPolice flying down Thornhill\nBitch I'm from for Thornhill, nigga\n\nLo and behold, runnin' parallel to Eddy Road\nWhen niggas around my hood can't take it no more, they taking your soul\nNiggas be ready for war, they ready to go, they out of control\nChopping them down, damn, the ammo is low, we gotta get more\nThousand niggas outside, it's too many yappers, can't nobody stop us\nTrained gorillas we busting them coppers, busting their helicopter\nUp in the field, niggas is all in the parking lot\nHolding the street, my nigga, we deep, hold this piss cause I got them hipped to all the deceit\nThe lies, drag the God stones, they wanna us all dead, they wanna start over\nNo, not in my zone, we SK, then AK'd up, my nigga not giving no fuck\nThank God we unified, thank God we fucking them up\nCleveland niggas arriving, they train ahead, the ammo and blunts\nHow ironic that we using them all on the people they came from\nEvery member of your SWAT team is dead\nChristopher Dorner, he was an animal, you get some monster, that's to your head, what!\n\nIt's a war going on outside\nShit is going down on Thornhill Drive\nIt's a war going on outside\nShit is going down on Thornhill, nigga\nIt's a war going on outside\nShit is going down on Thornhill Drive\nIt's a war going on outside\nIt's a war going on outside, nigga\nThornhill Drive\n\n(Us vs. Them)\n\nYeah\nMe and my niggas is up in this thang\nBest believe these nuts gon' hang\nLookn to the left see the [?] young thang\nWith the ass too fat and the [?] ring\nHo-pin that she know what to do\nGotta choose me cause uh nigga won't choose\nEver seen a nigga hard then you know I won't choose\nNow we up in the mall, \"Do you like those shoes\"\nWhat about the loot, \"Do you like that too?\"\nWhat about your friends, invite them through\nWe can do everything that you might wanna do\nEverything that you probably wanna do\nNow we up in the crib with the lean and the weed\nEverybody DTF indeed, gotta be the fliest nigga that you ever seen. Promise I can give you everything that you need, but I won't give you everything that you want. Bitch give me head while I'm blazin the blunt, Bitch let me hit it any way that you want. We up in the Lex, with the bang in the trunk. if a nigga run up on us we blazing him up. Riding through the ghetto lazy as fuck"}]}