{"songs": [{"title": "I’m Juggin", "lyrics": "[Produced by Sonny Digital]\n\n[Intro]\n\n[Pre-Hook: Cap 1]\nI don’t trust these bitches\nI don’t trust these niggas\nI just broke the money counter\nI say my nigga we getting it\n\n[Hook: Cap 1]\nFuck you doing? .. I’m juggin nigga\nFuck you doing? .. I’m juggin nigga\nFuck you doing? .. I’m juggin nigga\nIn the kitchen let me cook it with you\n\n[Verse 1: Young Dolph]\nRunning through all these twenties I done broke the money counter\nYour bitch pussy so wet boy I call that bitch water fountain\nI been juggin’. I been counting. I been trapping like a bitch\nTell [?]\nI got pounds in the dresser and I got PTs in the fridge\nHell no I don’t eat pork cause I don’t get along with pigs\nFuck these niggas. Fuck these bitches\nCause these niggas they act like bitches\nAnd these bitches they ain’t shit\nI get em high feed em dick\nDamn right you can’t tell me nothing\nYeah I think I’m the shit\nRemember I came home sixteen years old\nGrandma said, “you selling that shit”\nCouldn’t do nothing but look down\nShe smack me, she put me out\nI had to trap it out and went got me a spot out in Canyon\n\n[Pre-Hook]\n\n[Hook]\n\n[Verse 2: Cap 1]\nFuck you doing? .. I’m juggin nigga\nJust cut the tape so I can see the picture\nBlowing on that strong weed we just smoked an extension\nMoney counter broke just ran through all these fifties\nBaking soda odors in my new Givenchy\nSnake skin Giuseppe’s just sent me 1260\nRed bitch with me, she look picture perfect\nNigga want a half of bird I sent my bitch to serve him\nPowder stuffed all in my pocket\nGot guns and dope all on the counter\nIn the kitchen going crazy nigga trying to whip up a Phantom\nGot lean in my Phantom\nRun through these streets of Atlanta\nPicking up a check fucking niggas bitches got your ho dancing on camera\n\n[Pre-Hook]\n\n[Hook]\n\n[Outro]", "album": "High Class Street Music 4 (American Gangster)", "year": null, "image": "https://images.genius.com/88d68dee215ec2164b13f0bf5d3e8321.1000x1000x1.jpg"}], "artist": "Young Dolph"}