{"artist": "Cage", "songs": [{"title": "Summer in Hell", "album": "Weatherproof", "year": "2003-07-29", "image": "https://images.genius.com/fee65d811c41738bdfccdf4a1f22ad15.400x395x1.jpg", "lyrics": "Weathermen.. president is in the building\nThose who came for my life need to get in line\nThe suicide by cop sweater is on!\n\nFucked up out my mind, the gun in my belt\nFaintest of voice yells out, 'enjoy your summer in hell'\nDead friends and family surround me where they found me\nAn apparent suicide, I had a bounty on my spirit\nHigher than I ever been, overlookin my wake\nA closed casket, cause I had took off the face\nCause I ain't never like nobody starin at me\nI'm feelin sappy, made a few people sad, but more really happy\nMy crew standin there with shovels just grinning\nWhen the sun drop and the clients stop it's back to the livin\nCause y'all ain't really think I'd go out like Kurt did you?\nBeat GG Allin to the punch and do it at a venue\nHopped out the coffin like David Blaine\nI hit y'all with a decade of verses, I guess for baby fame\nYou want a plug? Stick this underground shit so far up your ass you stutter\nNow, keep lickin the cover\nHow the fuck did rap turn into Big and Pac karaoke\nBack in the 80's they did shit but kept it very low key\nI know I'm speakin to less than one percent of the public\nBut this is for the people that copped Movies and loved it\nYa'll better hope I don't catch AIDS or the big C\nCause the day they say I'm goin is in the week y'all comin with me\nFrom the smallest of riffs to the biggest of beefs\nI'mma be the first rap serial killer in the streets\nI'm caught somewhere between a thug and intelligent\nI bug off a elephant acid scrapped off the elephant\nAlong with the rest of the insect nation\nStandin there with bloody arms like it's an hallucination\nThis could be the last you'll ever know of I\nCause my spirit and physical just can't coincide\nUsed to write patterns now they write for their selves\nIf you ain't into death, step back, when I'm lightin up L's"}]}