{"artist": "Pusha T", "songs": [{"album": "My Name Is My Name", "title": "Nosetalgia", "image": "https://images.rapgenius.com/3793db0cb7a193e5435bfc7a24019c2e.504x504x1.jpg", "lyrics": "[Produced by Kanye West and Nottz]\n\n[Verse 1: Pusha T]\nTwenty-plus years of selling Johnson & Johnson\nI started out as a baby-faced monster\nNo wonder there's diaper rash on my conscience\nMy teething ring was numbed by the nonsense\nGem Star razor and a dinner plate\nArm & Hammer and a Mason jar, that's my dinner date\nThen crack the window in the kitchen, let it ventilate\n'Cause I let it sizzle on the stove like a minute steak\nNigga, I was crack in the school zone\nTwo beepers on me, Starter jacket that was two-toned\nFour lockers, four different bitches got their mule on\nBlack Ferris Bueller, cutting school with his jewels on\nCouldn't do wrong with a chest full of chains and a arm full of watches\nWhat I sell for pain in the hood, I'm a doctor\nZhivago tried to fight the urge like Ivan Drago, if he dies, he dies\nLike Doughboy to Tre, if he rides, he rides\nThrowing punches in his room, if he cries, he cries\nWe don't drink away the pain when a nigga die\nWe add a link to the chain, inscribe a nigga name in your flesh\nWe playin' on a higher game of chess\nOnce you delegate his bills, who gon' fuck his bitch the best?\nA million megapixels of the Pyrex\nStarted on the scale digital, my only Timex\nNigga, this is timeless, simply 'cause it's honest\nPure as the fumes that be fuckin' with my sinus\nNigga, this is Simon Says, Simon red\nBlood on your diamonds 'til you dying – dead; yuugh!\n\n[Samples]\n\"You better change what comes out your speaker\"\n\"Dee-dee-dee, dah-dee, dah-dee, dee-dee, dah-dee, day-ah\" (What is it?)\n\n[Verse 2: Kendrick Lamar]\nYou wanna see a dead body?\nInstrumentals from my momma's Christmas party\nTrouble's on my mind\nI still smell crime, my little brother crying\nSmokers repeatedly buying my Sega Genesis, either that\nOr my auntie was stealing it, hit the pipe and start feeling it\nOoh, wee, cut me some slack, weed never did that\nThis was different, geez, Louise, please help me relax\nQuantum physics could never show you the world I was in\nWhen I was ten, back when nine ounces had got you ten\nAnd nine times out of ten, niggas don't pay attention\nAnd when there's tension in the air, nines come with extensions\nMy daddy turned a quarter piece to a four and a half\nTook a L, started selling soap fiends bubble bath\nBroke his nails misusing his pinky to treat his nose\nShirt buttoned open, taco meat laying on his gold\nI said, \"Daddy, one day, I'ma get you right with 36 zips\n1000 grams of cocaine, then your name will be rich\nNow you can rock it up or sell it soft as leather interior\nDrop some ice cubes in it, Deebo on perimeter\"\nHe said, \"Son, how come you think you be my connect?\"\nI said, \"Pops, your ass is washed up, with all due respect\"\nHe said, \"Well, nigga, then show me how it all makes sense\"\nGo figure, motherfucker, every verse is a brick\nYour son dope, nigga!\nNow reap what you sowed, nigga!\n(Please reap what you sowed, nigga)\nI was born in '87, my granddaddy a legend\nNow the same shit that y'all was smoking is my profession\nLet's get it\n\n[Samples]\n\"You better change what comes out your speaker\"\n\"They must be on the dick of who?\"", "year": "2013-10-07"}]}