{"songs": [{"year": "2007-11-16", "image": "https://images.genius.com/1f9f4191522a2735ac0273b4bc4c6d19.1000x1000x1.jpg", "title": "Der Boss hängt voll Gold", "album": "Alphagene", "lyrics": "[Hook]\nEy der Boss hängt voll Gold und das Volk folgt Kollegah\nSo wie Demagogen mit Megaphon, folgt ihm auf dem Weg nach oben\nDer Wannabes-killende Gee, sogar bei Minusgraden sonnenbebrillt\nAlso wenn du lieber was zu lachen haben willst, dann kauf dir bitte Kinokarten fürn Comedyfilm\nDer Boss hängt voll Gold und das Volk folgt Kollegah\nSo wie Demagogen mit Megaphon, folgt ihm auf dem Weg nach oben\nUnd all die anderen frustrierten Idioten in der Szene\nDrücken sich nur Schore in die Vene, weil sie überboten sind wie Segel\n\n[Part 1]\nEy ich bin der Rapperking und komm'\nMit Butterfly wie'n Schmetterlingskokon\nUnd es ist scharf wie ein Pfefferminzbonbon\nKuck auf die schimmernden Weißgoldketten\nDeine Arme gleichen stark dem Inhalt von Streichholzpäckchen\nDeine Freunde kippen sich bei der Barfrau Drinks rein\nMachen dann hart auf Pimp, ein\nGezielter Schlag aufs Kinn reicht, sie sind daraufhin leise\nUnd was ihre Kinder angeht, möchte ich darauf hinweisen\nSie sind daraufhin Waisen\nWer hat’s drauf? Wenn's sein muss engagier ich paar Ostblockstaatler\nDie alles wegboxen für ca. 4-5 Flaschen Moskovskaya\nKid, ich bedroh deine sichtlich blassen, Pfadfinderfreunde am Lagerfeuer\nUnd es macht 'klick-klick-klack' wie Warnblinkerleuchten\nWas willst du mit japanischer Kampfkunst machen\nGegen ne germanische Kampfhundstaffel?\nDeine Bitch kommt zu meiner Show nur mit der Absicht mich einmal in ihrem Leben anzufassen\nDas ganze Land ist voller billiger Imitatoren, die versuchen sich meinem Style anzupassen\nDoch ey ihr habt nicht mal Schampusflaschen, ihr habt höchstens Shampooflaschen\n\n[Hook]\nEy der Boss hängt voll Gold und das Volk folgt Kollegah\nSo wie Demagogen mit Megaphon, folgt ihm auf dem Weg nach oben\nDer Wannabes-killende Gee, sogar bei Minusgraden sonnenbebrillt\nAlso wenn du lieber was zu lachen haben willst, dann kauf dir bitte Kinokarten fürn Comedyfilm\nDer Boss hängt voll Gold und das Volk folgt Kollegah\nSo wie Demagogen mit Megaphon, folgt ihm auf dem Weg nach oben\nUnd all die anderen frustrierten Idioten in der Szene\nDrücken sich nur Schore in die Vene, weil sie überboten sind wie Segel\n\n[Part 2]\nDie Leute fragen mich „Ey läufst du immer so rum, den ganzen Leib voll Weißgold?\"\n„Nein, manchmal auch Gelbgold, goldgelb wie Maiskolben\"\nK zum O, erbarmungslos wie Tschetschenenrebellen\nUnd deine Ex dreht in Hotels Sexszenen für Geld\nEy erklär mir mal bitte, was sind das hier für Zeiten für Rap?\nKeinerlei Action und sogar Vertreter des weiblichen Geschlechts\nWerden zum Freestyler, das seh' ich nicht gerne\nDenn die Weiber gehör'n in die Nähe von Herden wie Viehtreiber\nEgal wo ich bin, egal wohin ich geh, ich seh' nur Kids am Biten\nSoweit der Blick reicht, billige Imitatoren mit meinem Style\nKollegah-Kopierapper überall ich habe für sie nur Mitleid, weil\nDiese miesen Biter sind albern wie der Sänger von „It's my life\"\nRaus aus der Muckibude, rein in die Guccischuhe\nFreitagabend ich schreite erhaben durch den Club und rufe\n„Wer will Stress, kuck mich an. Kuck, aber fass meinen Schmuck nicht an\nKuck, oder ich spuck dich an, Mutterficker renn davon\" denn es ist\n\n[Hook]\nDer Boss hängt voll Gold und das Volk folgt Kollegah\nSo wie Demagogen mit Megaphon, folgt ihm auf dem Weg nach oben\nDer Wannabes-killende Gee, sogar bei Minusgraden sonnenbebrillt\nAlso wenn du lieber was zu lachen haben willst, dann kauf dir bitte Kinokarten fürn Comedyfilm\nDer Boss hängt voll Gold und das Volk folgt Kollegah\nSo wie Demagogen mit Megaphon, folgt ihm auf dem Weg nach oben\nUnd all die anderen frustrierten Idioten in der Szene\nDrücken sich nur Schore in die Vene, weil sie überboten sind wie Segel\n\n[Part 3]\nEy mit Tunnelblick wie Arbeiter im Bergbauschacht\nBetracht ich dich abfällig wie ein Herbstlaubblatt\nUnd deine hässliche Crew bemerkt es jetzt, Bitch, ich suche ärger\nUnd ist nur noch mit Beten beschäftigt wie Blumengärtner\nSieh dich mal an, du bist ein waschechter Hippie\nSogar deine Eltern sagen zu dir „Wasch dich mal, Hippie!\"\nKid, ich traf deine Crew und sieh Bitch, ich schlug sie hart\nNun liegen sie blutig da und sind am kriechen wie Tunikas\nIhr sauft in Bierzelten rum? Ich lauf in Tierpelzen rum\nDie hab' ich mir mal irgendwann gekauft für vierstellige Summen\nStell dich nicht dumm und verneige dich bitch, jeder weiß ich bin der Beste\nIch trag' keine weiße Weste, ich trage Weißes in der Weste\nDu bist bloß Pimp in deinem Kuhdorf\nWo man der King ist schon als Schulsportschwänzer\nUnd hast dir jetzt Bling geholt wie New-York-Gangsta\nAber leider ging das nach hinten los wie Moonwalktänzer\nDenn du siehst mich mit den dicksten Ringen so wie Sumokämpfer"}], "artist": "Kollegah"}