{"artist": "Pimp C", "songs": [{"album": null, "title": "Tell ’Em I Said That", "image": "https://images.genius.com/755227370d0d3fffabe599d486856318.960x960x1.jpg", "lyrics": "As seen in XXL’s October 2007 issue (#96)\n\nInterviewer: \"You’ve conducted some interviews recently that expressed some pretty offensive opinions, but you only apologized for your “Atlanta ain’t the South” statement. Any other apologies you wanna make?\"\n\nPimp C \"Let me say this: That statement about Russell Simmons had nothing to do with his sexual orientation. It had more to do with a disagreement [we had]. I don’t know if the man likes Martians, squirrels or whatever, so I ain’t gonna speak on something that I didn’t see. It’s no gay-bashing with me. It’s just, be proud of what you are, instead of hidin’ in the closet. And if ya fuck boys in the ass, then don’t be tryna fuck with the girls, too, poisoning the pussy population wit’ ya shitty ol’ dirty-ass dick.\"\n\nInterviewer: \"So Pimp C is not a gay-basher?\"\n\nPimp C: \"I’m not a gay-basher, because gay people buy my records. Why would I be offended by your sexual preference, unless I’m in the closet? If ya like boys, go get all the boys ya want. And whatever you did that you ashamed of, don’t do it no more.\"\n\nInterviewer: \"Do you ever feel any compassion for Bun B, for being in a group with a man like yourself, who is unfiltered and can be bullheaded in his ways?\"\n\nPimp C: \"You been programmed to think I’m bullheaded. I just know what the fuck goin’ on. I know who’s a faggot, I know who lettin’ them girls fuck ’em in the ass with them dildos, I know who really sold dope, I know who didn't. I be in Houston. The only nigga I see [in Houston] goin’ to the mall by himself is Slim Thug. Other niggas, when I see ’em, they got bodyguards around ’em. How you gonna be scared of the neighborhood you supposed to be reppin’? All them [Houston rappers] that think they stars, guess what, bitch? Ain't no stars down here. Only stars is in the muthafuckin’ sky!\"\n\nInterviewer: \"So the only Houston rapper you’re acknowledging is Slim Thug?\"\n\nPimp C: \"I didn’t say that! I said, again, the only nigga I see at the mall by himself is Slim Thug. You magazine muthafuckas need to have more responsibility for what you write and put on your goddamn covers. I couldn’t get on a Source cover ’til I went to prison. I had to go to prison to get on the cover of yo funky-ass magazine?\"\n\nInterviewer: \"But, Pimp, you do know this isn’t a Source interview, right?\"\n\nPimp C: \"I know this ain’t The Source. I’m riding on them in yo book! So if [they] wanna give promotion off the negativity, then eat my whole dick and nuts at the same time. I’m not talkin’ to you, but, like, you gotta ask the hard questions. I gotta answer the hard questions in a hard-type manner.\"\n\nInterviewer: \"Anything else would be uncivilized. In your Ozone interview, you referenced rappers lying about their drug rep—specifically, Mr. 17.5, which is Young Jeezy’s nickname. Why did you call him out?\"\n\nPimp C: \"So that’s your opinion? You’re basing your opinion that I went after Jeezy ’cause the same number that he calls himself is the same number that I used in my interview?\"\n\nInterviewer: \"Uh, yeah, he’s the only person I know that calls himself Mr. 17.5. So, yeah, I guess you can say I assumed that’s who you were referring to. But was I wrong?\"\n\nPimp C: \"First of all, Jeezy is a cold muthafucka with a microphone who, in my opinion, gotta have something in him that’s street or somebody street around him that’s instillin’ something in him. Now that I gave him his compliment, let me go on. Don’t single out Jeezy, because he ain’t the only one that’s kickin’ numbers that don’t match. Have you ever sold drugs?\"\n\nInterviewer: \"Excuse me?\"\n\nPimp C: \"Well, you do know there’s no water around Atlanta. So all the drugs in Atlanta either come from Miami or Texas. Ain't no way those prices match up. If work in Texas is $15,000 to $16,000 a ki, you gotta pay a muthafucka $2,000 to $2,500 a bird to bring it back to your city. How you gonna sell it for lower than you got it? A muthafucka might be cold and go down to San Antonio to buy it straight from the muthafuckas that get it across the border for $10,000. But news flash: I know you muthafuckas ain’t comin down here to get it, ’cause we woulda saw ya. See, real niggas don’t swap it out. We get ya on the next batch. But Young Jeezy is my brother. I done made records with the nigga. I’m not gonna side with the media against my brother. It’s just that these dope prices… It ain't even just the South. It’s a bunch of niggas lyin’ on records. Y’all ain't gettin’ it like this on the East Coast, neither. Just stop, ’cause y’all know y’all gotta come get this work from us. Chuuch.\"", "year": "2007-09-07"}]}