{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/156826eec8abcbfc5b1bc92593d06634.640x640x1.jpg", "title": "Nah Bruh", "year": "2016-12-25", "album": "Jonah", "lyrics": "[Verse 1: KJ-52]\nI’m not the lame broken down child\nOne thing on his mind and his brain\nI’m not the same, I’m not the guy\nWho was living to die for the fame\nMy life is changed I found the way\nAnd the truth and life when He came\nAnd I got to say, never return to the man\nI was back in the day\nI'm on my way, I'm on my way till He calls me away\nI'm not ashamed, I got an army about to invade\nMy God is great, forever and ever and ever He reigns\nAnd all I can say whatever, whenever, whatever I face\nWhat you think, I’m giving up? I ain't giving up (like nah bruh)\nWhat you think, I had enough? I ain't had enough (like nah bruh)\nWhat you think, I’m finished up? I ain't finished up (like nah bruh)\nThey be just like (nah bruh)\nWe be just like (nah bruh)\n\n[Hook: Canon]\nIf you ain't bout that action get up out my face\nI keep coming right back just like a holiday\nThey looking up at me like I'm out of bounds\nI'm rolling with the One I know Who hold me down\nThe ball in my court and errybody going\nThe ball in my court and errybody going\nNow all my soldiers bout to sound off\nSo come and try to block, we be like nah bruh\nEh brah, eh brah, eh brah, we be like nah brah\nEh brah, eh brah, eh brah, we be like nah brah\n\n[Verse 2: KJ-52]\nA life filled with pain\nRunning the streets while I'm watching the train\nWishing I’m free but I’m locked in the game\nLooking for peace but I’m doomed to the flame\nI was speaking Your name\nSpoken in vain I was going insane\nBut I broke out the chain the moment You came\nMy loss is a gain\nI'm back from the dead, hear me I'm back from the dead\nYou hearing the facts that I give my passion to live\nIs from all that He did\nAnd I'm not the kid I ran and I hid, that's the man that I been\nBut he's buried and dead never returning to live\nNever see him again\n\n[Hook: Canon]\nIf you ain't bout that action get up out my face\nI keep coming right back just like a holiday\nThey looking up at me like I'm out of bounds\nI'm rolling with the one I know who hold me down\nThe ball in my court and errybody going\nThe ball in my court and errybody going\nNow all my soldiers bout to sound off\nSo come and try to block, we be like nah bruh\nEh brah, eh brah, eh brah, we be like nah brah\nEh brah, eh brah, eh brah, we be like nah brah\n\n[Verse 3: B. Cooper]\nLet me tell you the story of how I met up with the Glorious\nI hope you were recording this\nGot me stretched out like accordions\nGet down to the core of us like apples, MacBooks on a tour bus\nGremlins the water we found make more of us\nCrazy how my life changed creation that’s right brained\nGod of the whole universe\nCame down to earth and took my pain (my pain)\nHallelujah (Hallelujah) this a new life\nWalked away from death, there’s no way that I can lose right?\n\n[Hook: Canon]\nIf you ain't bout that action get up out my face\nI keep coming right back just like a holiday\nThey looking up at me like I'm out of bounds\nI'm rolling with the one I know who hold me down\nThe ball in my court and errybody going\nThe ball in my court and errybody going\nNow all my soldiers bout to sound off\nSo come and try to block, we be like nah bruh\nEh brah, eh brah, eh brah, we be like nah brah\nEh brah, eh brah, eh brah, we be like nah brah\n\n[Outro]\nEh brah, eh brah, eh brah, we be like nah brah\nEh brah, eh brah, eh brah, we be like nah brah"}]}