{"songs": [{"image": "https://images.genius.com/4e938672ba331b168f4f463f35fdd247.637x637x1.jpg", "year": "2000-12-12", "title": "Best of Things", "album": "Restless", "lyrics": "[Verse 1]\nI was voted most likely to have a psychiatric evaluation\nLet's start the process of elimination\nThis dedication is for niggas with the green buddha\nThe bandula, six-shooter to your suit coolers\nNow how this feel? Cold black steel up in your grill\nThis hollow point lead gon' be your last meal\nSay your prayers, say your graces\nPieces of your face is found in a hundred different places\nHuh, so what we lookin like? We tryin to see some hoes to fuck tonight\nAnd you just tryin' to see the afterlife\nMake a decision before we have a head-on collision\nMakin me spend the rest of my life in prison\nSee I can only play the cards I was given\nMultiplication division whatever you got to break mines off\nLike the U.S. government did to Microsoft\nLike Xzibit in some pussy with the lights turned off, it's like\n\n[Chorus]\nI'm just livin' to fulfill my dreams\nI'm just tryin' to have the best of things\nNone of y'all can't take shit from me\nLife's a bitch she ain't fuckin for free\nSo I'mma ride 'til the wheels fall off\nWhile all the rest get weak and go soft\nYour petite style, can get you beat down\nMy heat's loud, have you huggin' on the street now\n\n[Verse 2]\nNiggas keep askin me how does it feel\nHow does what feel? Not havin to scrape for a meal?\nNot bein locked down to a fucked up deal?\nThe biggest man in Los Angeles is not Shaquille\nWe had to reinvent the wheel, draft new blueprints\nMade a whole album, spent half what you spent\nThen sent the rest to my people to invest with it\nCustom fitted, if you want it nigga, come and get it\nAnd I suggest you bring a million niggas runnin' wit it\nSplit it, feel it, hit it it's hot, look\nI ain't gon' stop 'til everybody's shot\nMuammar Khadafi's the dot, X mark the spot\nWith an infrared to your head, left for dead\nFuck the feds, flee the country then grow some dreads (ya mon)\nI suggest you keep your distance, for instance, the same distance\nIt takes to get to the next solar system, motherfucker\n\n[Chorus]\nI'm just livin' to fulfill my dreams\nI'm just tryin' to have the best of things\nNone of y'all can't take shit from me\nLife's a bitch she ain't fuckin for free\nSo I'mma ride 'til the wheels fall off\nWhile all the rest get weak and go soft\nYour petite style, can get you beat down\nMy heat's loud, have you huggin' on the street now\n\n[Verse 3]\nStrike one, when a nigga talkin shit with his hands down\nStrike two, gettin caught in the wrong place with your pants down\nStrike three, tryin to fuck with the D-O-double-G\nD-R-E, or any of my Alkaholik family\nHuh, Xzibit turn your vital signs to a straight line\nNever seen a dog bite and bark at the same time\nRestless, rugged, never relaxed\nPermanently owe you motherfuckers backs like tax\nBaseball bats and bricks upside of your head\nHomey still gettin swole off water and bread\nI got this, retaliation, for any situation I'm facin'\nAnd leave the stage with a standin' ovation, it's like\n\n[Chorus]\nI'm just livin' to fulfill my dreams\nI'm just tryin' to have the best of things\nNone of y'all can't take shit from me\nLife's a bitch she ain't fuckin for free\nSo I'mma ride 'til the wheels fall off\nWhile all the rest get weak and go soft\nYour petite style, can get you beat down\nMy heat's loud, have you huggin' on the street now\n\n[Outro]\nWhat's the name of the suspect?\n40-2-40 I got shots fired here, send me another unit"}], "artist": "Xzibit"}