{"artist": "G Herbo", "songs": [{"title": "Jay-Z (Outro)", "album": "Strictly 4 My Fans", "year": "2016-11-25", "image": "https://images.genius.com/3348976e258ad8eb002cb2363f17e9d3.630x630x1.jpg", "lyrics": "[Intro: Jay Z]\nI mean that boy sound real to me, really real to rap, you know. It's like the diaries of me, you know? It's like the chronicles you know of what I've been through. So they can't say that's nothing and I'm the only to live my life the way I live it, you know? And we just moving, you know tryna teach the people, all the people that showed us love. That album gold, we pushing platinum so we just tryna reach out and go to shows, do our thing, touch all the people that showed us love and supported us\n\n[Interlude]\nYou know I brought my pain, my good and band, my happiness, my sorrow, and brought life to my fans and everybody else in the world listening to G Herbo\n\n[Verse 1]\nUsed to wonder, will I ever count a million or obtain 100?\nAnd every time when I went broke I still remained 100\nSupported niggas doing good, I never changed or nothing\nBut why they hate on me? Try to close the gate on me\nWhy do niggas wanna throw they extra dead weight on me\nStill gon' ride until the wheels flat, until my tank on E\nWhen I was the underdog, still I put the bank on me\nWhat was there a handful? You ain't drop no damn jewels\nI ain't get no motivation, they ain't wanna see me prevail\nThey ain't wanna see me in there, they'd rather see me in jail\nThey don't want me to be with fans, they'd rather see me with mail\nWhen I grind, I stick to that, now they just see me and yell\nRiding Aston-Martins, Vanquishers, flying '72 Chavilles\nFlashing money everywhere just so they see me with bail\nAll the guns I had to load, all the weed we used to sell\nShoulda been a man of Harvard, coulda went to school at Yale\nBut I chose my own fate, so I may see you in hell\n\n[Interlude 2]\nAnd you know I tell 'em all the time man, that's all I ever wanted to do is just be the real me and bring my real life to the audience man, whether they like it or not. And not for me to be judged or looked at any type of way cause I know that one day they love you for your own reasons and the next day they hate you for a decision you made that only affect you. And I still rap and do everything I do for my niggas man and of course my family too but they'll tell you the shit that I say to y'all I say to them. No side of me I don't show y'all through the music and none of that, I still get the same motivation, my same motivation. I love my fans, they know I love 'em man, they love me because I bring them me, the real only me, nothing else\n\n[Verse 2]\nThey remember I was gang banging in the gang way\nSo don't try me if I'm anywhere, I'm still the same way\nNigga you still'll get flamed up for bringing my name up\nSometimes I be cuckoo, still shoot you when I'm famous\nAll my niggas dangerous, never got my chain tucked\nAlways got my Rollie on, even when I'm all alone\nDraco drum go on and on\nBreak all of your dollar bones\nI ain't tryna work shit out\nAin't no peace, don't call the phone\nI ain't really into that, save the stress, I'm tryna go home\nJump right in the game scoring, pacing though, I'm tryna go long\nThey really tryna chase it here\nFour years then be lit\nWhen I die, them folks forget\nMan I know this life a bitch\nI'm just tryna plan it out\nHit that dough and spread it out\nFuck it, cop my bro a whip\nThen go buy my mans a house\nKnow it come with the gang in it\nKnow it comes with the things in it\nBaby mamas and mans in it\nKnow you can't be a lame in it\n\n[Outro]\nHumble beast man, G Herbo, Swervo. You know it's strictly for my fans man, that's what, that's really where my brain at, you know? I get the motivation from my fans and just everybody, just I don't know this might sound crazy for me to say, I wish everybody brain operated the way mine do but really just for people to understand me. Really the people on the outside, my fans, theres people that can't understand me, understand shit on a level (?). Strictly for my fans, my family, for my niggas. Swervo"}]}