{"artist": "Anybody Killa", "songs": [{"title": "Hey Girl", "image": "https://images.genius.com/043a960c080afdd5e266d49e02eee1a3.500x500x1.jpg", "album": "Medicine Bag", "lyrics": "[Intro]\nI'm in love! Have you ever been in love?\nHave you ever been in love so bad that it makes you wanna kill?\nMakes you wanna collect the bitches toenails and finger nails and hair samples and... blistered skin from her hand, running away from you all day\nMAKES YOU WANNA JUST KILL DOESN'T IT?\n\n[Verse 1]\nI can't believe she's into me\nI had my eyes on this girl for a long time now\nI can't believe she's into me\nEven if she acts like she doesn't want me around\nI can't believe she's into me\nThe only contact i have in my little black book\nI can't believe she's into me\nShe might say that she ain't but i know her look!\nI can't believe she's into me\nSince grade school i had her...?!?!?!?\nI can't believe she's into me\nAnd when my homies tell me that she's not, it's just uncool!\n\n[Pre-Hook]\nI can't believe she's into me\nYES SHE IS! (no she's not) x4\nI hope she is\n\n[Hook]\nHey girl, what's up?!\nHow you doin?\nHey girl, what you been up to?\nHey girl, what's up?!\nHow you doing?\nHey girl, i've been watching you\n\n[Interlude 1]\nGirls: Hey you know that ABK kid?\nYeah?\nHe fucking stalks me like everyday!\nWhat a freak!\n\n[Verse 2]\nI can't believe she's into me\nShe's the sun shining right and i'm her knight shining armor\nI can't believe she's into me\nEven though she calls me crazy she knows i will never harm her\nI can't believe she's into me\nThat's why i follow her everyday so she's ok!\nI can't believe she's into me\nSO I DON'T GIVE A FUCK WHAT THE POLICE SAY!\nI can't believe she's into me\nMust be hard for her to hold in all her desperation\nI can't believe she's into me\nSo i hope this girl really knows my love occasion\n\n[Pre-Hook + Hook]\n\n[Interlude 2]\nGirls: Oh my god! He won't leave me alone!\nWhat?\nIt's really starting to freak me out!\nReally?\nFor real!\n\n[Verse 3]\nI wanna be with this girl, I wanna treat her the best\nLet her know that i'm here and that i have no regrets\nOf all the things that i did just to get her attention\nWhen you said that you hated me, I know you were pretending!\nGirl, when can we be together i'll wait a lifetime\nI think about you in my dreams like you were all mine\nI always said that you were into me, so together we will be 'til we rest in peace, I love you...\nTogether we will be 'til we rest in peace, i love you!\n\n[Pre-Hook + Hook]", "year": "2010-10-19"}]}