{"artist": "Ace Hood", "songs": [{"title": "Right On", "album": "Trust the Process II: Undefeated", "year": "2018-05-11", "lyrics": "[Chorus: Slim Diesel]\nI ain't give in 'til I gotcha'\n'bout to break you off somethin' proper (haha)\nFlow so sick need a doctor (oh yeah)\nIf you feeling like the man, can't stop ya'\nYeah, brother, right on!\nNigga, right on!\nYeah, brother, right on! (what you say?)\nNigga, right on!\n\n[Verse 1: Ace Hood]\nEmerging from the cellar to rocking them gold medals\nI'm the only legend that's livin' ain't at Coachella\nSmokin' on some ganja, the leaf is made of vanilla\nChillin' with a queen, \"what the fuck is a Cinderella?\"\nI got 'em, hailin' outta the bottom, I had to blossom\nHitters outside of your crib, they playin' opossum\nTap you on your shoulder to quickly diffuse the gossip\nAce get on the beat and he turn it into Irving Plaza\nI silence the noise, I'm swifter than Floyd\nMade it out my situation, I gotta rejoice\nYeah, yeah, landed on my feet and I never scuffed my Adidas\nI been hardly jogging, I'm trying to give ya'll a breather\nNoise overcrowded, it's hard to hear from the bleachers\nEverything I know, I could never pledge of allegiance\nA man of my word\nEmotionally reserved\nGet upset and I am likely to enter the purge\nLot of shit going on in the world today\nA black man got shot for his skin today\nAnother cop probably tryin' to wash his sins away\nI did the Yeezy with the joggers, I'm super straight\n\n[Chorus: Slim Diesel]\n(Lord have mercy)\nYeah, brother, right on! (right on)\nNigga, right on! (right on)\nYeah, brother, right on! (what you say?)\nNigga, right on!\n\n[Verse 2: Ace Hood]\nLoungin' in the suite, watching Belly, we at the Ritz\nI been on my healthy, this vegan shit is the lit\nFocus on your wealth and invest it into your shit\nYou just rather look it than actually being rich\nOh, I got it\nIndependent, I'm solid, you not inspired, I'm sorry\nManifest then we started, I try my best to work harder\nI'm 'bout them decimals, comma, I'm feeling jiggy\nNever second guess if the energy kinda iffy\nI'm not into secrets I leave that shit up to Vicky\nTaylor made suits in this glory, it's how it fit me\nI'm changin my ways, I'm boujee today\n\"You don't think I worked this hard to keep it the same?\"\nFoundations never work if it's weak in the frame\nDon't you say I never taught you a couple of things (woomp)\n\n[Chorus: Slim Diesel]\nYeah, brother, right on! (right on)\nNigga, right on! (right on)\nYeah, brother, right on! (what you say?)\nNigga, right on!", "image": "https://images.genius.com/b3d629c95fe2a0b0f4f3d20998c37c61.1000x1000x1.jpg"}]}