{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/64ed7839fb678eff8d7d8a74bb2e3755.395x395x1.png", "year": "2019-07-23", "album": "The Lost Boy", "lyrics": "[Chorus: Anderson .Paak]\nOne of y'all niggas gon' be fuckin' with me\nI got two bad bitches gon' be rubbin' my feet\nI got three young niggas down to bust out the heat\nAnd all y'all ain't got nothin' on me\nOoh, not one of y'all niggas gon' be fuckin' with me\nI got two bad bitches gon' be rubbin' my feet\nI got three young niggas down to bust out the heat\nAnd all y'all ain't got nothin' on me\n\n[Verse 1: YBN Cordae]\nUh, okay, put your fucking hands up, this the fucking anthem\nSmiling 'cause I'm young, rich, black, and I'm handsome\nNot to mention wealthy, ass on her healthy\nYoung millionaire, what the fuck can you tell me? Smell me?\nNigga, that's Chanel cologne\nI'm in Europe with the tourists with no cellular phone\n\n[Verse 2: Anderson .Paak]\nLike ooh, sound like rich nigga problems\nI hit a bad bitch with a fistful of condoms\nAnd the randomness of risky ménages\nLike get the head right, she can get what she wanted\nThe spits, then flaunt it, my drip like a faucet\nShe told me she was prego, I ain't even take the motherfuckin' dick out my pocket, yeah\n\n[Verse 3: YBN Cordae]\nThe opposite\nShe want me to fly her, so I copped a jet\nMust be thinkin' I'm a one way ticket on a runway\nDrippin' in my feng shui, sippin' on a sundae\n\n[Chorus: Anderson .Paak]\nOne of y'all niggas gon' be fuckin' with me\nI got two bad bitches gon' be rubbin' my feet\nI got three young niggas down to bust out the heat\nAnd all y'all ain't got nothin' on me\nOoh, not one of y'all niggas gon' be fuckin' with me\nI got two bad bitches gon' be rubbin' my feet\nI got three young niggas down to bust out the heat\nAnd all y'all ain't got nothin' on me\n\n[Verse 4: YBN Cordae & Anderson .Paak]\nI bought a Moncler coat for the times we were broke\nI'ma wear it in the summer on LeBron James boat\nFront row? Duh, bro, we don't sit on nosebleeds\nAin't your pockets obese? They won't fit in those seats\nAyy, we like a cold team, nigga, Shaq and Kobe\nLike back in '03, I was only like 6\nShit, I was like 16, but I can give a sixteen\nI can make a bitch scream, that's a bit extreme\nI got a thick bald bitch, I call her Ms. Clean\nMy drip frosty like Halls and Listerine\nWe all all-stars, you hardly sixth string\nYeah, I had to ball hard to harvest these dreams\nSwear to God, me too, no Harvey Weinstein\nThe coupe was lime green, my wrist was blinding\nWe party in South Beach, Ferraris and blue cheese\nFuck does that even mean? Nigga, just let the hook sing\n\n[Chorus: Anderson .Paak]\nOne of y'all niggas gon' be fuckin' with me\nI got two bad bitches gon' be rubbin' my feet\nI got three young niggas down to bust out the heat\nAnd all y'all ain't got nothin' on me\nOoh, not one of y'all niggas gon' be fuckin' with me\nI got two bad bitches gon' be rubbin' my feet\nI got three young niggas down to bust out the heat\nAnd all y'all ain't got nothin' on me", "title": "RNP"}]}