{"artist": "Pharoahe Monch", "songs": [{"album": "Internal Affairs", "title": "Queens", "image": "https://images.genius.com/3f6b75e56c302232d6cdbcbfbb1501c3.1000x1000x1.jpg", "lyrics": "[Hook]\nThere's a place I know where the bitches go\nWhere they rob you for your dough and chill on the low\nIn Southside... Queens, Queens\nWhere if you say, \"The Ave\"\nPeople automatically know the path\nYou don't have to do the math\nIn Southside... Queens, Queens\n\n[Verse 1]\nI knew this nigga named Donovan\nAstonishin' the way he used to handle the pill, God (word)\nLet me speak about the way he used to dribble off his knees\nAnd in the middle at the same time guzzling a beer\nLike a puzzle or a riddle, discovering his path to the hoop\nScoop, shot, tipped up the backboard, oops\nSon got hops, never knew he would've grew it\nCool nigga, when it came to school, he blew it\nA scholar in acute nigga-risms and metropolitans\nKids hollering, \"Yo, Donovan, hey, come around the block\"\nYoungest of three sons, fucking with coupons and refunds\nFood stamps and still he was a champ\nTime to get loot for boots and kicks now\nFuck hoops, gotta impress the chicks now\nHis momma said, \"Donovan, why are you\nOn the corner of Linden and Guy R. Brewer?\"\nHe said, \"Momma, listen close, I'mma tell you one time\nYou're killing my high, plus I got a nine\nAll I be doing is putting in work\nSo you can get a brand new dress for church\nI know the Devil lurks outside, man, it's cold\nBut I don't wanna get paid slow and grow old like Poppa\nPlus I'm on parole, I gotta\nGet paid off the streets to make ends meet\"\nWith the back of her hand, she smacked him in the face\nWalked out of the crib-piece, pissed with no chase\nThat night, rocking Nikes, eating Mike and Ikes\nSlapboxing with a dyke on a bike too small\nThinking, \"This time, next year, Mom'll be able to– ohh!\"\nShit from across the streets, niggas approach slow\nWell, get the metal out, too late, the guns flash\nIn the melee they wet him like Reggae Sunsplash\nSon dashed with the quickness, back into the ride\nWith a smile on his face, the picture of pride\nBlood coming from his mouth, now I'm at his side\nKneeling over Donovan's body before he died\nEyes fluttering up and down in his head\nAnd with his last breath this is what he said\nHe said, \"Why? Why?\"\nThen I closed his eyes\n\n[Hook]\nThere's a place I know where the people go\nWhere they rob you for your dough and chill on the low\nIn Southside... Queens, Queens\nWhere if you say, \"The Ave\"\nPeople automatically know the path\nYou don't have to do the math\nIn Southside... Queens, Queens\nAnd if you got a Glock, you could bust shots\nLike [?], when the block be hot\nIn, what we talking 'bout? Queens, Queens\n\n[Outro]\nUhh, c'mon, uh\nC'mon, uh, uh\nI know where people go\nWhere you can cash dough and chill on the low", "year": "1999-10-19"}]}