{"songs": [{"image": "https://images.genius.com/dd4702b67b8df5a6d15413c2a9f2117c.700x700x1.jpg", "lyrics": "Intro:\nHello. (Hi.) You know what? I think everyone should adopt a waitress from their local bar. And then you call up Lazerbeak, make him nice, and say--\nGive me drums!\nKansas Santa Claus, baby!\nRedneck Santa Claus\nKick your goddamn bips\nLet's roll\nYo yo, look man\n\nVerse 1:\nSometimes I feel like my onlyfriend is me\nYou feel the same too, don't you disagree\nI got gin, I got a gust of wind to ride\nMy little lady put a puncture in my pride\n(Hello?)\nI'd rather call on my fans\nLet me see the goddamn palms of your hands little man\nTell your girl that I'm confidently ugly\nLet me blow steam, let me talk a bit, I'm grumpy\n(But Mac, you look so lovely, you look so lovely!)\n\nI don't give a damn if you want me, but when you do\nThen I don't have to sit sifting through\nThe little increments of bitch in you\nAnd you don't misconstrue\nThe simple fact that I don't sing haiku\n(You what?)\nI coo like a pigeon, I chew through the system\nDo voodoo a rhythm, listen I got your city hippie flippin'\nWith my disposition, with this sick wisdom, astigmatism\nSplit vision, suck human, chick limpin'\nSlick pimpin', suds gooin', butts movin' in prison\n(But the fact that you sound like a white boy?)\nFuck y'all critical punks, I am white (Right?)\nYou know we gettin' rowdy and then some\nIt's Mac Lethal pounding the kick drums\nI want love\nLet me build, not destroy\nIs everybody with me?\nFear not my boy!\n\nHook:\nThis is what it looks like when a black clover blooms\n'Cause the world seems so consumed with just\nThe boom of the drums and the sound of the bass\nWe can knock the party out of place (We can knock the party out of place)\n\nThis is what it looks like when a black clover blooms\n'Cause the world seems so consumed with just\nThe boom of the drums and the sound of the bass\nWe can knock the party out of place (Okay!)\n\nVerse 2:\nTwenty-four gun salute me\nOne for every year I haven't let these silly military bastards recruit me (Bastards)\nAnd I'mma have me a percoset and peanut butter sandwich\nAnd splatter malt liquor on the canvas\nI'm from Kansas\nSo I'mma handle this mic like an art jerk\nAnd do a little farm work\nGive me a straw hat, give me a beer mug\nI'm 'bout to play now, y'all need some earplugs? (Yeah)\n\nI don't give a damn if you listen, but if you will\nI wouldn't have to sit pissed with bills from\nEvery rotten-ass business deal\nSlamming fingers in the window sill\nLike I'm a modern day John Wayne (What)\nGot a hot brain (What)\nFull of drugs that are making people not sane (Yeah)\nI got a couple million dollars on the Kansas City Chiefs\nWe're never gonna lose again bee-yotch, peace\n\nHook:\nThis is what it looks like when a black clover blooms\n'Cause the world seems so consumed with just\nThe boom of the drums and the sound of the bass\nWe can knock the party out of place (We can knock the party out of place)\n\nThis is what it looks like when a black clover blooms\n'Cause the world seems so consumed with just\nThe boom of the drums and the sound of the bass\nWe can knock the party out of place (Okay!)", "year": null, "album": "The Original 11:11 Sessions", "title": "Bloom"}], "artist": "Mac Lethal"}