{"artist": "C-Murder", "songs": [{"title": "Forever TRU", "album": "Trapped in Crime", "year": "2000-09-05", "image": "https://images.genius.com/415d3692989ebe9e5966bfe9f80905c3.500x500x1.jpg", "lyrics": "[Taken from Martin Luther King Jr's speech]\nThough we come to cash this check\nA check will give us a fund demands\nA riches of freedom and the security of justice\n\nChorus [C-Murder]\n\nForever TRU, 'til I'm dead (Do you still love me?)\nThis be the TRUest shit I ever said\nI'm forever TRU, 'til I'm dead (Do you still love me?)\nThis be the TRUest shit I ever said\nForever TRU, 'til I'm dead (Do you still love me?)\nThis be the TRUest shit I ever said\nI'm forever TRU, 'til I'm dead (Do you still love me?)\nThis be the TRUest shit I ever said\n\n[C-Murder]\nMe and my nigga knew we ride, and vibe\nAnd smoke weed, and get high and talk about my niggas that died\nNo Limit Records opened doors for niggas\nBut they rebelled, turned Bendict\nDon't make me get up in your shit, bitch\nAnd let me tell you something you alredy know\nFucking with me, is like fucking with the whole yole'\nI'm still depressed about my nigga Mac\nI let him roll with some bitch ass niggas, but I'ma handle that\nAnd to much drama for my baby momma\nThem niggas tapping my phone, they wouldn't safe at home\nI need a ride or die, stand by my side, from the projects\nMy baby boo be the realest chick I ever met\nI let that Cash Money shit slide but it's cool\nBut next time I'ma have to act a fool\nI keep it street, and them real niggas love it\nForever TRU til I'm dead, cause I'ma die thuggin', ya heard me?\n\nChorus [C-Murder]\n\nForever TRU, 'til I'm dead (Do you still love me?)\nThis be the TRUest shit I ever said\nI'm forever TRU, 'til I'm dead (Do you still love me?)\nThis be the TRUest shit I ever said\n\n[C-Murder]\nBe runnin' outta clubs, as nigga be rasing flags\nYou only get nine lives I murder that ass\nIt's the world's most dangerous crew, TRU Records\nMy crew stay behind bars, we ghetto superstars\nBeen droppin' bars in studios, and finger fuck pretty hoes\nAnd got a pad in every ghetto\nNiggas wanna be a pimp, that's a lie\nThe tank dumpin' niggas like Kemp, then they die\nIt's on now nigga, I'm ready\nYou see my face up in your dreams like Freddy\nSo bow down, all you motherfuckers leaving my crew\nBow down to a TRU nigga greater than you\n\nChorus [C-Murder]\n\nForever TRU, 'til I'm dead (Do you still love me?)\nThis be the TRUest shit I ever said\nI'm forever TRU, 'til I'm dead (Do you still love me?)\nThis be the TRUest shit I ever said\n\n[C-Murder]\nForever TRU baby, you know what that means?\nI'm with this shit 'til I'm dead, you dig?\nNo Limit, TRU, forever\nDo you still love me?"}]}