{"artist": "Peedi Crakk", "songs": [{"album": "State Property Presents Vol. II: The Chain Gang", "title": "G.A.M.E.", "image": "https://images.genius.com/b8f3c4ec490e644cd39e2f7945dd80d9.400x400x1.jpg", "lyrics": "{Verse 1- Peedi Crakk]\nG.A.M.E, so please don't tempt me!\nYo that 4-5 keep holding your boy down\nWon't leave nothing alive but everything in the ground\nAnd I ain't trying to brag, but the S5 pound\nKeep shitting on her ass every time I flex round\nNow I got my moms still thinking her boy good\nI kiss her before I leave, then hit you up in the hood\nA nigga gonna bleed if Peedi don't eat good\nAnd I'm G.A.M.E. so please don't tempt me!\nThis one is for my hood, my gun ain't under the hood\nIt's sitting here on my lap, my cap is under my hood\nGood! My aim's good, I'm doing this like I should\nAnd I'm G.A.M.E. so please don't tempt me!\nSee they up in the hood with Cease and Indy Loc\nL.D. took the scooter, he's coming back with the smokes\nSee niggas in the hood, niggas baking and niggas early!\nG.A.M.E. so please don't tempt me!\n\n[Verse 2- Lil Cease]\nAyo I roll with Peedi Crakk, I drink booze with Free\nSmoke a pound with young gunner, plus I mack with Beans\nNow it's State P, masks out Mafia gang\nAnd them slugs gon' stain, crack your skull and your brain\nThen sing your ass a lullaby\nNigga more money, more problems, more murder, more homocide\nBang Bang Mafia Gang, we let the drama ride\nG.A.M.E. so please don't tempt me!\nI'll pop you because I'm high and paranoid\nSometimes I feel like my niggas is Hammer Boys\nBeat you to a pulp like Suge did Danny Boy\nG.A.M.E. so please don't tempt me!\nI'ma squeeze until my clips on empty\nEmpty every piece of slug all in your Bentley\nSo don't tempt me, nigga I gets busy\nG.A.M.E. so please don't tempt me!\n\n[Verse 3- Beanie Sigel]\nWell they call me B. Mack, but today I got the K\nI got the S, I got the A, I don't think you want to play\nOK? My chopper clips hold a hundred copper sticks\nAnd I'm G.A.M.E. with them things on safety!\nI play the hood, usually up to no good\nKeep my vest on my chest under my S.P. hood\nI'm good! I'm laying low and my squad will burn them woods\nAnd I'm G.A.M.E. so please don't tempt me!\nIt ain't no thing for me to swing around your block\nWith them machines that go ROCK\nGet off the scene before the cops\nAin't nobody seen squat\nAll they did was heard the shots\nAnd I'm G.O.O.D. like you don't know me!\nOr know where I stand on ya\nGrown man on ya\nA hundred shot can on ya\nPlaying block, blam on ya (blow!)\nAnd blast the steel all greasy on you\nIt ain't shit to lay a half a mil easy on you\nYou want a blockbuster? I'm up the block busters\nState Prop fucker, I know you cocksucker\nCocksucker I see the bitch all in your face\nI'm G.A.M.E. to piss all in your face!\n\n[Verse 4- Young Chris]\nWell they call me Young Gunner but today I'm Mr. Chris\nGot the 357 with the speed 30 kick, you're hit\nMy three fifth make you niggas shit and piss\nI'm with the D.A.N.G. G.A.N.G. (yeah!)\nMy boy Sig and Mafia boy Cease (Cease)\nAnd Peedi gonna bring the Property more cheese (please!)\nWho gonna stop it, then drop it, and say bet\nAnd I'm G.A.M.E. you P.E.S.T\nPeedi in check, Sigel in check\nSigel got that eagle, Cease-A-Leo got them techs\nI know Freewizzle got his thizzle in his vest\nAnd we G.A.M.E. we can B.A.N.G.(now!)\nY'all ain't a threat, y'all niggas is our pets\nYou mutts go in the bars, y'all younguns go play fetch\n(Say What!) I play the (?) throw something all in your chest\nYou gon' R.E.S.P.E.C.T. me, now!", "year": "2003-08-12"}]}