{"songs": [{"image": "https://images.genius.com/d51e86578df25f696ad430beed4f0415.500x500x1.jpg", "year": "2008-11-01", "title": "2 Minutes 2 Far", "album": "40 Days & 40 Nights", "lyrics": "[Verse One] [XV]:\nSometimes it just gets too much\nWhen your Ipod is the only thing you Touch\nTelling my mom \"Nah, I can not do lunch\"\nIt's sad but it's true when you live like such\nI don't wanna say that my life sucks\nCause I could wake up and sleep what ever time I want\nBut I don't sleep\nCause I heard about a cousin\nAnd at this point I don't wanna have that discussion\nSo I'm living high on a plane zipping by\nSitting back when I was dissing people and they silly lives\nI can go back to when I wasn't getting by\nHad the whole McDonalds menu memorized\nI remember I\nWas a little guy\nGetting pushed around, now they wanna be friends of mine\nSometimes I go on vaca in my mind\nThere's a place I can go away anytime\n\n[Hook] [Zoot Woman]:\nCause it's a holiday home\nTwo minutes too far away\nWhat can you tell the other one?\nDirty fiction can you call my name?\n\n[Verse Two] [XV]:\nSee, I've had enough Thundercat hoes, now where's my lioness?\nLike Cheetara she keeping up with my flyness\nDon't smoke weed but they call me, \"Your highness\"\nNon-fast niggas wanna roll like tires\nThey like, \"Your car should be the fliest\"\nWhy's that?\nIt ain't like I drive it\nI don't know, that's just how I react\nMom think I'm an agoraphobia insomniac\nHaha\nBig words, I should've went to Pratt\nWorking on my first album, I never went to class\nI tell ya\nI should have been a bank teller\nHow I got money sitting on my ass\nCause then the music started picking up awfully fast\nAnd if I wanna have a future I can't let that pass\nGirls say I look like Buddy Holly\nProlly, but all the commotion make me wanna just crash\n\n[Hook] [Zoot Woman]:\n\n[Verse Three] [XV]:\nTrying to be able to get a stable full of horses\nFerrari's, Mustang's and Porsche's\nRed carpet model chick looks so gorgeous\nMake sure we get it as a portrait\nFlick\nGotta get a pic cause I never go out\nOnly roll with a clique/click when I'm using my mouse\nCause I'm always in the stu\nShut the booth for a room filled with video games or a Play.Net zoom\nSoon\nI'mma get me a house\nInside of my mind I can tune it all out\nHaha\nA little place I can go to\nWhen I don't wanna be so vocal\nAssembly required but no Pro-Tools\nAnd taking it higher only got me hopeful\nSo when the home inside of my dome is local\nDon't think I went loco\n\n[Hook] [Zoot Woman]:"}], "artist": "XV"}