{"artist": "Prince Paul", "songs": [{"album": "Psychoanalysis (What Is It?)", "title": "Dimepieces", "image": "https://images.genius.com/2e62c87c2fc12d70ea466dbe46b314e0.599x599x1.jpg", "lyrics": "Intro: Mista Wells\n1-2-3! In the place to be!\nAs it is plain to see, we be the MC's!\nOn the microphone, and I do it swell\nI go by the name of Mista Wells!\nStandin' next to me, on the M-I-C\nIs my main man, Smile-Lee!\nStandin' next to him, he do what he like\nHe go by the name of Nephew Mike!\nAnd last but not least, number one in the crew:\nHe goes by the name of Howard Who!\n\nVerse 1\n[Wells] I know this chick named Tammy, a real fly shortie\nShe gets real naughty when she sips on a 40\nAnd when she gets tipsy, she acts like a stunt\nCause a 40 and a blunt, that's all she really wants\n[Smile] I know this freak named Bertha, the town cum-slurper\nI fucked her in the ass till she screamed bloody murder\nAnd if you see Bertha, tell her I'm gonna hurt her\nCause she gave me some shit that my doctor never heard of\n[Mike] I met this honey named Anna at the Copacabana\nSippin' Tropicana in a calm-like manner\nJust like a hammer, I really tried to slam her\nMan, oh man, she drained my stamina!\n[H. Who] I know this dip named Jessica; Bimos used to mess with her\nIt really didn't matter, so I still slept with her\nIt was all good, in that she gave up the kitty-cat\nAnd when I was done, I said, \"Good lookin' black!\"\n\nVerse 2\n[Smile] I met this chick named Nessa, who favors Uncle Fester\nI beat the bitch bloody cause she stole from my dresser\nBruises, knots, and multi-lacerations\nI almost killed the bitch; my lawyer got me probation\n[Mike] I met this girl named Kim at the all-natural gym\nTryin' to push up was this guy named Tim\nWho will win, is it me or him?\nGave her a grin and I was IN!\n[H. Who] Check it, I know this dip named Chiniqua, she lives in Masapequa\nGot a body boomin' like a JBL speaker\nI tried to get her, my nephew had hit her\nSo instead, I bagged her sister!\n[Wells] I know this honey named Brenda, she lives Down South\nTook her in the alley, put my nuts in her mouth\nAnd when she got finished, I bent that ass over\nPulled up her skirt and proceeded to stroke her!\n\nVerse 3\n[Mike] I know this shortie named Judy with a really big booty\nGot howdy-doody in my jacuzzi\nThe shorty got moody and that really didn' suit me\nSo now I'm tutti fruitti with her friend named Susie\n[Wells] Now there's Christine, the freak of my dreams\nWho gets real freaky with a can of whipped cream\nTook her to the crib, I had to do it quick\nAnd when I got finished she was jockin' cool dick!\n[Smile] I met a chick named Irma, no ass firmer\nWhen it came to suckin' dicks she was a real fast learner\nShe packed an automatic, she always had static\nPeople call her Irma, but I call her Hump-a-matic\n[H. Who] I know this dip named Tasha, she worked at Red Lobster\nShe wanted to get nice so I bought her some Vodka\nGave her a joint, went to Huds Point\nThen I drove her wild like AJ Floyd\n[Smile] I know a freak named Lucy, her lips were mad juicy\nShe got sent away because she ate a baby's coochie\nShe was a real hottie, she acted kinda snotty\nShe worked at the mall, but she stole a dead body\n[Wells] There's this honey named Angie with a fat ass-crack\nKilling Me Softly, like Roberta Flack\nBut when I saw her sister, it really didn't matter\nSo I had to step off, cause the booty was FATTER!!", "year": "1996-06-25"}]}