{"artist": "Gangsta Boo", "songs": [{"title": "Love Don’t Live (U Abandoned Me)", "album": "Both Worlds *69", "year": null, "image": "https://images.genius.com/05275b2a5cae3f310f25e06511aa2191.400x400x1.jpg", "lyrics": "[Chorus]\nYou abandoned me\nLove don't live here anymore\nJust a vacancy\nLove don't live here anymore\n\nThis is dedicated to all of my ladies in relations\nPeep this out\n\n[Verse 1]\nI'm a lady who be keepin' it real, you don't care\nTake time out, see how I feel\nWhen I be ridin' in the SUV, I'm thinkin' of you\nWhen I be rollin' up a fat one, boy I'm thinkin' of you\nYou got me goin' like uhh\nI'm feelin' the rush, I like to fuck\nLet's get buck in the back of the truck, so boy what's up?\nIt's whatever when it comes down to you\nWell it was, until you made it clear that I ain't for you\nYou just abandoned me, you left me strandedly\nHeart broke, constantly\nHearin' love songs on the radio, that remind me of you\nThey say a gangsta ain't 'posed to cry\nBut I'm sheddin' tears and I'm a gangsta until I die\nI'm tellin' you boy, they say no pain then no gain\nNow they call me playa' because you teachin' me all yo game\nI say I ain't change, but then again just peep me out\nAy yo, I don't think this shit is gonna work\nI'm ready to leave you, get out\n\n[Chorus]\nYou abandoned me\nLove don't live here anymore\nJust a vacancy\nLove don't live here anymore\n\n[Verse 2]\nJust be a man about it, you don't have to lie to me\nPlaya' leave my house, you can go on away from me\nPlaya' get yo' car keys, here are yo' clothes too\nMan, that's my credit card, hold up that's my bank book\nWhy you out here cheatin' on me, I'm gettin' my own creepin' on\n(Ay girl, why you ain't answering that phone?)\nHuh, why because, I was gone\nBlew about a whole kilo, pay my own light bill\nI don't need you, got a new man for my pleasure, still\nBaby, I'm a mack, mista' you ain't heard my real name?\nMrs. Pimpin' Thang, dissing suckas who approach me like\nIf you wanna play, get in the shower stroke yourself\nI ain't the one to be messed with, pimpin' to my death\nGet in it, get out, remember how that used to be?\nI would get so pleased when you'd come and bring your love to me\nBut, that's the past now, no more freaky tail nights\nNo more sexy this, or some X, no more late nights\n\n[Chorus]\nYou abandoned me\nLove don't live here anymore\nJust a vacancy\nLove don't live here anymore\n\n[Verse 3]\nI ain't tryina get caught up in yo games\nPersonally, I think that you are lame\nWhachu' doin' there, now and then when you wanna hit\nI ain't givin' you a bit, you'll be just another trick\nOn my list of busta's, diamond clusters\nRings, old game used to be so not told\nWith yo' frozen heart, boy you tore my soul apart\nMy first ex partner, falling heavy from the block\nWith yo' seven carat wad, give it to me don't you stop\nI keep fallin' for you, hypnotized doubt you get my props\nBut now I'm single, laid back, tight\nI ain't tryin' to date a gigolo, men ain't right\nHe wanna' cut now, he wanna' cut later\nHe ain't call you then, he ain't call you later\nThat's how it goes, I'm out the door, holla back\nHit me on my 2-Way when you ready\nThat's that on that\n\n[Chorus]\nYou abandoned me\nLove don't live here anymore\nJust a vacancy\nLove don't live here anymore"}]}