{"artist": "C-Rayz Walz", "songs": [{"title": "Jello", "album": null, "year": "2004-03-09", "image": "https://images.genius.com/8a9e05873e5313c8cbfdc3418a9376a7.646x431x1.jpg", "lyrics": "The proof was in the pudding neighborhood called her Jello\nMy man thought she was thorough - poor fellow!\nShe fucked more niggas than legal aid in each borough\nFavorite color yellow; cheesy racked tendency profound mellow\nThe role of a serene sister, I miss her\nUndercover gossip put her world in a twister\nThe setting is a sinister slum where sex ain't sacred\nBy thirteen she was pro-active and naked\nHad a gift to give but she would tend a path not taken\nTwenty years old she wishes she was in The Matrix\nYears passed mad relationships ain't last\nHer esteem was the small amount of sand in her hourglass\nI told her she was beautiful she felt the opposite\nHad the pieces to the puzzle couldn't find a proper fit\nEach time we spoke she said, 'Something gotta give\nI'm glad I ain't got a kid 'cause I don't even want to live!'\n\nMommy, my sister, her, she\nGrandma, auntie, my daughter, my niece\nMy cousin, my wife, another part of me\nIs where it all started see\nBut now we got chicken, slut, whores, tricks\nSkins, ass, pussy, bitch\nHooker, hoodrat, that shit sounds sick!\nYigga-yigga-yo watch your lip!\n\n\"Get out my mind!\" she tells herself time after time\nIgnorin words spoke by the most high divine\nIn her own eyes she was less than prime\nSo sublime her smile upside down would decorate her lip line\nWords note this cry for help by a wise man\nReal short attention span, you know man\nParties in her head leave her eyes jam\nTears ran down cheek lane hell she would keep flings\nGave it up for fake things, street gangs, and cheap chains\nSlept on the beasts who fiend for sweet dames\nTake her stride with guys but yo they was lame\nHijacked a seat on my mental plane\nShe wanted dedication but kept finding debt bills\nNo skill, and life ills helped her to strip\nShe would diet, crying, but didn't notice\nPretty flowers get devoured, now know this\nIt's like Lauren (flippin in the ghetto on a dirty mattress)\nDreams of being nurse, a school teacher, or an actress\nSurrounded by self hate happiness pursued by the sadness\nShe committed suicide on the Sabbath\nYoung queen lost she was no longer a girl\nKilled by lack of understanding in an ignorant world\nShe played the roll, but yo her supporting cast\nWas every man that lied to her just to get in the ass\n\n(whispered)\nMommy, my sister, her, she\nGrandma, auntie, my daughter, my niece\nMy cousin, my wife, another part of me\nIs where it all started see\nBut now we got chicken, slut, whores tricks\nSkins, ass, pussy, bitch\nHooker, hoodrat, that shit sounds sick!\nYigga-yigga-yo watch your lip!\n\nMommy, my sister, her, she\nGrandma, auntie, my daughter, my niece\nMy cousin, my wife, another part of me\nIs where it all started see\nBut now we got chicken, slut, whores tricks\nSkins, ass, pussy, bitch\nHooker, hoodrat, that shit sounds sick!\nYigga-yigga-yo watch your lip"}]}