{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "What U Got (The Demo)", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[DIALOGUE]\nTRU: Yo, didn't Kane use that?\n\nTARIQ: Yeah, but he didn't flip it like this though!\n\nTRU: Yo, you know what you got to do, though? You got to set this motherfuckin track on fire, though, man!\n\nTARIQ: No doubt, man, this is me, I'm sayin!\n\nTRU: Aight!\n\nTARIQ: You know?\n\nTRU: Yo, so yo yo yo, let me— Let me feel this shit, and see what you gon' do with it\n\nTARIQ: Oh! Aight, yo, bust it. Ayo! I'ma freak it like, yaknahmsayin? Kinda like how he started it, but bust it, yo, bust it!\n\nTRU: Aight!\n\n[Verse 1: Breeze/Tariq]\nRuff, rugged, and real, you love it, or feel\nThe shove of the steel in your ass, then at last\nRespect for certain, your neck was certain\nFrom the mic movements, shit aroused\nThey be like, \"You got a groovin hittin sound\"\nCasey Kasem, callin a truce, but fuck that\nYou crazy? Blaze him, slaughterin you with love taps\nWell no prob the flow robbed you and your world\nLike when your girl's just my pal, bust my style\nOn my grill, sportin the illest bizarre smirk\nI gave your girl some Chloraseptic, cause yo, she's a hard worker\nYou scarred her, but you ain't tryin to tangle with the force of\nYellin, \"Yo, fuck you lookin at?\" You're frontin like you crosseyed\nOf course, why? You like breathin, with aggression\nI strike, leavin this a question, in a session\nComparison B, you're through, the ratio for workin shit\nEmbarassing, me to you, fellatio to jerkin it\n\n[DIALOGUE]\nTARIQ: No doubt, like that, you know?!\n\nTRU: Yeah, yeah!\n\nTARIQ: Then I'ma freak it, I'ma have this, yo— I'ma have this girl singin: \"You wanna be startin...\"\n\nTRU: Word?!\n\nTARIQ: Like that joint, y'know, Michael, word?\n\nTRU: Yeah!\n\nTARIQ: Yo, she— She look like Mary with big titties!\n\nTRU: Mmm, dang!\n\nTARIQ: That's my word yo\n\nTRU: Yo, Big, that's what I'm sayin!\n\nTARIQ: So yo, you feelin this joint?\n\nTRU: Yeah I'm feelin this shit!\n\nTARIQ: You don't sound enthused, yo, what's the deal?\n\nTRU: Yo yo, no, I'm feelin this shit, man!\n\nTARIQ: Wassup? Lace your man! Lemme just hear how your joint sound\n\nTRU: Yo, you know I don't do that shit no more, son\n\nTARIQ: C'mon son, this is me, your man\n\nTRU: Yeah, alright, aight, fuck it! For you, I'ma do it\n\nTARIQ: Aight, no doubt\n\nTRU: Knahmsayin? Start up a little something, like\n\nTARIQ: Yeah\n\n[Verse 2: Sha/Tru (Breeze/Tariq)]\nI have sound waves, that'll touch you in many places\nWhile I raze your faces, even number traces in some places\nAbove Jordan, the list of the twisted\nMy mind's enlisted, I guess that's why I'm sadistic\nCause you don't know the shit you been startin\nMy heart done hardened, ready to put the world\nOn a milk carton, fuck it, no one else deserve to live\nI done gave all I got to give and still ain't got shit\n(What?!) So who mad? You grab and ransom\nAnd I'ma pierce his soul and touch the heart of his grandson\n(Oh shit!)Cause my lyrics are like being food poisoning\nInjected through the ear, fuck what you heard\nThis is what you need to hear\n\n[DIALOGUE]\nTRU: KnahwhatI'msayin? A little somethin like that\n\nTARIQ: What?! Yo. you still got it, old-timer!\n\nTRU: Yo, good lookin, good lookin new-school!\n\nTARIQ: Lil' rusty, but you got it! Word, no doubt\n\nTRU: Yeahhh!\n\nTARIQ: Yo, ayo, son! Yo, 'po-nine!\n\nTRU: Dang, damn\n\nTARIQ: Yo, son, behind you, yo, slow down, son! Slow down, son!", "year": "1999-02-23"}]}