{"songs": [{"image": "https://images.genius.com/4ca57e4ceb5f85f4c1d5b5fd347cab28.500x500x1.jpg", "year": "2008-07-08", "title": "Farewell", "album": "Planet Squaria: The Square in the Circle", "lyrics": "[Intro]\nAll we have is now...(2x)\n\n[Hook 1]\nAs logic stands, you couldn't meet a man who's from the future\nBut you and me were never meant to be part of the future\n\n[Verse 1]\nSee, I had good cause when I lifted off\nJust wanted to go up and see the stars\nJust wanted this robe off to see your bra\nStrap yourself in we can't get off\nNow I've fallen down and I've fallen far\nAmongst the same stars that I've wished upon\nSpaceship, spaceship take me home\nNow I'm hearing alarms\nHere comes the storm\n\n[Hook 2]\nWe're no gonna make it...(We're not gonna make it) (3x)\nNow...\n\n[Hook 1]\n\n[Verse 2]\nI know\nThey said this world was never ready for you\nYour girl was never ready to move\nYou tell her you weren't ready to prove\nNow it's you verse the world are you ready to lose?\nIt's you or them are you ready to choose?\nI'm fighting with myself already the blues\nI get out and I ready the fuel\nAnd turned on the radio and that's when I knew\n\n[Hook 2]\n\n[Hook 1]\n\n[Verse 3]\nIts funny how bad you want something til you get it\nSave a bunch of pennies just to turn around and spend it\nYou never know its ending until its ending\nCredits start rolling and your name ain't in it\nThe fat lady starts pulling out her lyrics\nYou don't want her to sing it, so you don't want to hear it\nThe shoe fits perfect but you don't wanna wear it\nYou rather just lie in the form of appearance\nAnd you won't make it!\nGet reported to the deck\nAnd I face it\nLike a body with no neck\nThose are words that I probably won't forget\nWhen I return to Earth to see your faces after this\nEverybody's drowning cause they can't sale\nStayed on my own two dog I ain't fell\nBut this world ain't for me I could tell\nSo I'm gone, Farewell\n\n[Hook 3]\nYou and me were never meant to be part of the future (5x)\n\n[Outro]\nAll we have is now...(2x)"}], "artist": "XV"}