{"songs": [{"year": "2014-07-13", "album": "YouTube Promotion Tracks", "image": "https://images.genius.com/d22dab44518982eea6d1dd56dae8f38c.600x600x1.jpg", "title": "Famous", "lyrics": "[Intro]\nSeem my dreams won't go away\nSo it's more like a nightmare\nKeeping me up all night\nLike a nightmare\nIt's taking over my mind\nMy desire\nBurns inside, like a flame\nAnd it can't and it won't be contained\n'Cos I gotta be... famous\n\n[Chorus]\nYou don't really want the fame though\nYou don't really want the fame no!\n\n[Verse 1]\nThey heard a shot fired\nAnother shot fired\nYou driving in a race, spinning with a popped tire\nAnd you've been pushed by the radios element\nI'm the first fucking rapper to make the radio irrelevant\nFuck the mainstream, I don't need a handout\nThere's something about the aura of the Kers because I stand out\n4 cunts cruising high in a range rover\nYelling ABK, tell these rappers game over!\nI've been working, probably find me in the studio\nAt the top, and my whole fucking crew can flow\nThe proof is there, we the team at the top\nI'm a sniper with the raps so you [?] to pop\nI've been killing shit for years\nYou know spitting insane raps\nFrom a town where cunts are on the rocks like the train tracks\nIf time moves quick, shouldn't life try to keep up\nInstead of being slaves to the system you in deep fuck\n\n[Chorus]\nYou don't really want the fame though\nYou don't really want the fame no!\n\n[Verse 2]\nAnd here's a picture with words look\nHe at high school, he started year 10\nThings a little different this year, he don't fear them\nPeer pressure play a part, started seshin' in the park\nGirls undressing him to fuck, introduce him to the glass\nAnd shit he going down hill\nLast night he had a puff and some brown pills\nEverything in life has gottin' him feelin' irrelevant\nIt's fucking with his mind and yet his brain is not developed yet\nThis the story of the victim\nOf the suburb, and it's sad 'cos I can pick from them\nMeet 'em all the time, kinda crazy with the crime\nGot them play with my mind, 'cos they keep saying my rhymes (It's King Kerser)\nBut it's not want it's is\nLike a shoulda started different with a positive twist\nAnd they say I'm saving lives, I'm just giving you mine\nAnd in the process, hopin' somehow you can live through my rhymes - The King\n\n[Chorus]\nYou don't really want the fame though\nYou don't really want the fame no!\n\n[Verse 3]\nAnd if I ever get knocked, there'll be riots the next day\nThe Nebulizer caused commotions as soon as they pressed play\nBuds in the sadie, got some raps for the next night\nWith a fucking xani so I'm sleeping on the next flight\nIt's fucking crazy, I'm your everyday cunt\nBut there's something special 'bout me\nI'm a legend, what's up? Shit\nThere's that arrogance they tell me they hate that\nThe rawest rapper on my level, cannot debate that\nSomebody said I fluked it, I'm fluking what?\nThe 10 year of blood and sweat? I never choose to stop\nI was rocking gigs with my mates in the crowd\nBroke as fuck, on the train. I had to make it, but how?\n'Cos these labels didn't want it, I'm too raw for the air\nI made it to the top, now they scratching their heads\nWait.. How'd it happen? I'm a weapon in my own right\nYou can be inspired, do your thing but don't bite\nIt's Kers 1\n\n[Chorus]\nYou don't really want the fame though\nYou don't really want the fame no!\n\n[Outro]\nMe and Nebs have that new album cooking\nReady November 7th\nReady to fucking shit up again\nTaking over the game\nAnd um... we out"}], "artist": "Kerser"}