{"artist": "Ace Hood", "songs": [{"title": "Have Mercy", "album": "Trials & Tribulations", "year": "2013-07-16", "lyrics": "[Intro]\nLord forgive ‘em, for they know not what they do\nAs I walk through that Valley of the Shadow of Death\nSee no pussy…\n\n[Verse 1]\nSo I guess we finally meet again\nShould I kill ‘em? Well, that all depends\nDue to success I started losing friends\nNigga sleepin’, only reason he don’t follow trends\nNever was a gimmick, the realest in it, come bear witness\nAnd I see them rappers is actors, boy, they so Robin Givens\nI kept it humble, my stomach grumble, my Rollie tickin’\nThey did me dirty, I may forgive ‘em, but won’t forget it\nAnd not to mention, they wasn’t worthy of what I’m spittin’\nIt’s God’s will, and them haters just pray they could prevent it\nI’m so addicted to gettin’ it, I need intervention\nThe hottest spittin’, your favorite rapper scared to admit it\nHave mercy, let me bow my head\nI count a million up, that’s daily bread\nAin’t no more humble in me, shit is dead\nTell them pussy niggas I ain’t never scared\nPoor niggas hate to see a nigga win\nSay you comin’ for me? Pussy nigga, when?\nI been coldhearted since I lost a twin\nI swear I love it when they hate, I made a hit again\nI did this before my niggas, then\nUse your bitch whenever like a membership\nNever bothered over Twitter beef\nWe’ll probably never meet up where the money be\nMe and Kiko on the wood, yeah, the money seats\nFive grand just to see him hit a three\nBalenciagas on a nigga feet\nDeath to the competition, may they rest in peace\n\n[Hook]\nI know my mama prayin’ for me, I hope your mama prayin’ too\n‘Cause me and my niggas gotta eat, we’ll die over these canned foods\nHave mercy on a real nigga, ‘cause I’m sinnin’ every day, Lord\nHave mercy on a real nigga, ‘cause I’mma ride for my niggas, dog\n\n[Verse 2]\nWhat the fuck these niggas talkin’ ‘bout?\nLoad the choppers, bring them problems that they talkin’ ‘bout\nRoll the reefer, no Khalifa, you gon’ ride or die\nNo homicide, it’s suicide before I testify\nThat’s on my daughter, I’m runnin’ Florida, no kinda, sorta\nAnd I hear ‘em talkin’, that money callin’, them out of order\nYeah, nigga – fuck all that talkin’, be ‘bout it, then\nA lot of small talk, there they go runnin’ their mouth again\nBold nigga, ‘til they meet them gorillas\nFuck a cavity, my niggas ain’t got no fillings\nMoney is the motive, family is the reason\nOn my mama, ain’t nobody ever came between it\nAnd they never will, streets got me grippin’ steel\nThese scared niggas need to go to church or either Dr. Phil\nI tell ‘em look me in my eyes, we are not the same\nLion-hearted nigga, gunpowder in my veins\n\n[Bridge]\nHave mercy on ‘em…\nBow your head…\n\n[Hook]\nI know my mama prayin’ for me, I hope your mama prayin’ too\n‘Cause me and my niggas gotta eat, we’ll die over these canned foods\nHave mercy on a real nigga, ‘cause I’m sinnin’ every day, Lord\nHave mercy on a real nigga, ‘cause I’mma ride for my niggas, dog\n\n[Verse 3]\nPussy niggas still hatin’ hard\nBitch, I just went and bought the boulevard\nBitch, I just went and blew another check\n‘Bout my money, catch a bullet tryna intercept\nJumpin’ up out that whip, I let my chain swing\nBlood up on my sneakers like I gangbang\nEvery day’s a struggle tryna maintain\nAnd free my real niggas in the chain gang\nI hear them broke niggas still talkin’\nWatch your words, do be very cautious\nYou threaten mine, you can pick a coffin\nAin’t no talkin’, tell ‘em shock it once it go to sparkin’\nSelf-made Rollie and a pair of Js\nHood nigga livin’ like I’m Bruce Wayne\nNew Ferrari kickin’ like it’s Liu Kang\nReal nigga, ain’t it true? 2 Chainz\n\n[Hook]\nI know my mama prayin’ for me, I hope your mama prayin’ too\n‘Cause me and my niggas gotta eat, we’ll die over these canned foods\nHave mercy on a real nigga, ‘cause I’m sinnin’ every day, Lord\nHave mercy on a real nigga, ‘cause I’mma ride for my niggas, dog", "image": "https://images.rapgenius.com/7971f0453120214b866dd52bb2d98608.500x500x1.jpg"}]}