{"songs": [{"image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg", "year": null, "title": "Likwit Rhyming", "album": null, "lyrics": "[xzibit]\nFrom now and forever it's the likwit emcee\n\"from now and forever it's the likwit emcee\" -scratched by tony touch\n[defari]\nDanger danger, wild west ranger ranger\nRearrange'a the mark ass stranger\nBehold, the look on my face stone cold\nWith a rare cowboy style that never grow old\nI'm the golden state bear with a rough flare, plus debanare\nTime for me and mine, but for any kind I can't care\nStormy weather rain liquid\nDefari con tony toca, tash, and xzibit\nBreak necks bounce with it when I spit it\nKnockin this jam is a form of calastenics\nLet it knock when you mashin down the block\nRims spank with the car wash\nWatch the bitches stop\nAn look, always stay five steps ahead\nHard at work, while you tricks lay in bed\nDead to the world but ? hayru? he be the sun\nAlways burnin, ''cause my job is never done\nRun from one time I rather dump an ak\nThats for all the black and brown that got carried away\nTo the morg, when I look in the mirror I see the lord\n\"oh my god\" -scratched by tt\n[tash]\nSince niggas wanna set trip\nIt's time to start the checklist\nTash the likwit rhymer runnin through your city reckless\nBlame it on the hennisey, we drink that shit for breakfast\nMy style be standin out like my homie tony's necklace\nThis is flawless raw'less for ya ballers\nNah, fuck y'all, this is for all my drunken alcoholiks\nNah, fuck dat, this is for my homie tony touch\nI told ya homeboy we come through in the clutch\nNew york, l.a. it's not the same thing\nY'all niggas rob, out here we gangbang\nGuns to the ammo, niggas think they rambo\nStandin on the corner with they khakis and they flannel\nDang yo' flow sound just like d's\nWho wanna battle three g's for t's\nPlease, read it off the lips of the alki-bumrusher\nFuck you up so bad, tony wouldn't wanna touch ya\nSay what?\nSay what?\nSay what?\nSay what?\nSay what?\nSay what?\nI'll fuck you up so bad, tony wouldn't wanna touch ya\nSay what?\nI'll fuck you up so bad, tony wouldn't wanna touch ya\n[xzibit]\nLets get upclose and personal, malicious, sid vicious\nI bang bitches, you might find yourself missin tonight\nRapper's delight, keep it at the house but ain't fuckin it right\nGot'choo stuck in the headlights, can't move\nImpact is all of the sudden, vehicular homicide\nBut I ain't stoppin for nothin\nMe and my cousin, strong buzzin, and playin a dozen\nPushin and shovin', leads to gettin sucked and rolled up\nLike a nigga with a mask and a gun, hold up\nRappers act like they ain't gon' die for small fry\nTry to reply, don't touch what you ain't gon' buy\nI ain't gon' lie, motherfucker love to get high\nBarely get by with scraps and pennies\nNow we winnin grammy's and emmy's\nAnd party with the henni and remi\nGot a big bang theory nigga keepin it hot\nIts the art versus ? ? ? or not\n[scratched by tt]\n\"let me show some off me skills here\"\n\"alright....that does it\""}], "artist": "Xzibit"}