{"artist": "Watsky", "songs": [{"year": null, "lyrics": "[Verse]\nO, hai! I’m that guy, built so fly in a silk bow tie\nDon’t know why I’m built so fly\nBut I am, no lie—oh my!\nRolled by on a lowride Huffy\nSitting on the pegs, shelltoes puffy\nCuff rolled up to my calf\nClass out the ass, bad with the swag like Buffy\nGotta be the one to bite the bullet\nI’m a sinner, but I bet I could've been a better man\nI wanna be Zen, but I go sippin' on some medicine\nInstead of meditating, but I get it when I can\nI don’t wanna wind up in the gutter with a bottle of malt\nLiquor, bitter ‘cause I never got a call\nTelling me that it’s all figured out\nI’m sick of doubt, but I’m looking at the wall\nPart of me was hoping to be caught up in the moment\nAnd be open to the good and the God in me\nBut I got a lobotomy\nAnd I get that I oughta become a bit of an oddity\nWhen somebody gets offended by the thought of me\n\"Who’s he?\" …You gotta be kidding me!\nDo me like Gabourey Sidibe\nIf you see me with a chickadee\nNo diggity, it’ll be giggity giggity giggity\nGonna send it like a letter from above\nWith a woman that I love, ‘cause I get it like I live\nBut if my baby’s gay, I’ll say: \"You go, gay baby\nWork that crib! Work that bib! Burp that kid!\nScrew police! Flip that car!\"\nI don’t want a Jesus piece\nBut I want a Reese’s Piece and a Kit Kat Bar\nI want everybody focusing on getting me to Letterman\nTo kick it for the betterment\nOf innocent Americans who never want to settle\nFor their pop… or not, ‘cause my bedroom rocks\nAnd the beat still knocks when I sort my socks\nI'm five-foot-eleven of sex\nFrom the tip of my head to my gorgeous... knees\n\n[Outro]\nWho is that boy? How does he rap so good?\nI don't know how that pale boy raps so good\nHow does he do that? Do that?\nMeow, meow, meow, meow, meow, meow, meow", "image": "https://images.genius.com/d115f9afc68bd8acb901515a810e78b6.1000x1000x1.jpg", "album": " Live! from the Troubadour", "title": "Pale Kid Raps Fast"}]}