{"artist": "Beanie Sigel", "songs": [{"lyrics": "(feat. Scarface & Raheem DeVaughn)\n\n(Chorus:)\nWhen the clouds turn gray behind sunstage, you got to experience the storms like me in the... Rain, bay don't worry if it... Rains, To experience joy you got to feel a bit of pain, holmes things goin get better tell me can you stand a little bit of... Rain, I be your bridge when it... Rains\n(Raheem:) I'll be your bridge\n\n(Beanie:) I'll be your bridge. (Repeated Several Times)\nSo you can... Take Cover\n\n(Beanie:)\nThey say lightning don't strike in the same place twice, well my man he doin life for the same case twice, chance for the pill thinner than a 10th speed wheel? What can I do but pray for em & keep things real, when the world start to neglect ya, & ya calls don't get accepted & the work you put in for years get disrespected, ya baby mama reckless out there fucking them niggas & ya brother comin short with them digits you can count on my visits, I take you round the world in my pictures, I seen you on tour with some bitches, you my nigga, if ever you need that shoulder soldier I understand cry your river I'll be your bridge to dry land my man\n\n(Chorus)\n(Scarface:)\nI been down some bad hands some niggas will probably fold, shits been cold another story left untold, from a kid to a nigga grown life goes on but I won't shed tears nigga life goes on, seen blood shed for nothing they came trough buzzin when it struck em we charged to the game like fuck it, now get back ya bitches? When we hit we relentless, with murderers intent I attack you defenseless It's senseless, I've been prayin for better days when in the cold dog, world like this you let it stray? By the money, the bitches the flushed out 6's the sickness that came from me killin my mamas son kept?, my mama, my brother he had a gun I got a witness & that's how I was taught to handle business, them burnin bridges in my path like the night while the rain drops fall from the sky like It's ice\n\n(Chorus)\n(Raheem:)\nI Got... ? My man he hold that, & that's the life of my blood you my homie from way back, from the age of yay high you was in grace to show? from the kitchen to the block we used to get that loot so if you need to call me you know what it is, I've always been a soldier so I'll be your bridge, If the drought should come well I'm goin front ya, any day of the winter any thirsty summer, I'll be your bridge\n\n(Chorus)", "image": "https://images.genius.com/356ca6b0db6d8d8b7be50568bdfb53c0.700x695x1.jpg", "year": null, "title": "Rain (Bridge)", "album": "The Solution"}]}