{"songs": [{"image": "https://images.genius.com/40c361449dc1fdd2484d9430c07b8380.500x500x1.jpg", "album": null, "title": "Allergic Reaction to Broccoli (Broccoli Bars 1)", "lyrics": "I'm the biggest prick in this town\nThe British Chris Brown\nVisit your award ceremony\nAnd just sit down\nI'll slash your tire just cause I enjoy the hiss sound\nDisagree with this, my sleeves'll slip down\nFists out, swingin' 'till the 56th round\nI could beat you with my wrists bound\nHa\n\nI list my inspirations in roughly this order:\nFather Christmas, Satan, and Chris Dorner\nI'm spreading disorder\nI diss all the rappers who I asked to collaborate and got a missed call off\nRap's Piers Morgan\nBut with a pierced organ\nToo much information?\nToo bad, that's the beer talking\n\nI sit too near broads\nAnd make them feel awkward\nRandy as Ramsay\nNow cook me a meal, Gordon\nNow here's the point where you might think\n\"Why's he still talking? Slimey limey\nWhy should I see the appeal of him?\"\n\nAnd that's the point\nI travel through the camera\nAnd slap you 'till you're black and blue, Rihanna\nAlicia Keys needs to improve her grammar\nI'll take a hammer to her new piano\nNow you've had a glimpse inside the ill mind of Dan Bull\nTry to get out, I doubt you will find the handle\n\nMy lines are angle grinders\nThey mangle rhymers\nI rap into the sky\nAnd the air force scrambles fighters\nSpit fire\nYou stink like a lit tire\nI'll bring you down to the ground\nQuick as a zip wire\n\nListen to this: My dick is thick and it's large\nSo get onto Twitter and tell Nicki Minaj\nAmerica's gone shit since you had Britain in charge\nAnd fuck off if you think that's a little bit harsh\nI'll stick a petard up in your doors of perception\nSnipping the wires, no phone call for protection\n\nI get dressed in my Sunday best\nAnd I still look less fresh than Kanye West\nSo, give me the hand lotion\nAnd phone Frank Ocean\nI want to know his exact man-to-man quotient\nI'm loopy, that's limey for \"so loco\"\nI run and rub my crotch upon an old hobo\nWhilst shouting over my shoulder \"No homo!\"\nBecause fuck it, you know, \"YOLO!\"\n\nRighty ho, that's Drake's act copied\nWho am I body bagging next, A$AP Rocky?\nI suppose I could, but I ain't that cocky\nI've already had two chains snatched off me\nIt's time for payback, probably\nI pack a nine-inch winky, they attract totty\n\nAnd occasionally, I may strap shotties\nBut usually I'll do a drive-by screwface at posses\nSneeze and leave the seats of my Maybach snotty\nGreen windows looking like they're made of stained glass, Gothic\nI'm a misanthropic proper maniac, potty\nI got crunk off a straight black coffee\nIt was a bad idea to take that straitjacket off me\nYou just don't have the power to restrain that, Scotty\n\nI rap with an ill mind, \"Hey, that's Hoppy!\"\nI'll tear his fucking face off, take that, Robbie!\nYour production quality is way bad, sloppy\nOr is your wave compression rate that lossy?\n\"How can Hopsin be the one that he's dissing?\"\nI'm just showing I can do this and still win the competition", "year": "2013-03-10"}], "artist": "Dan Bull"}