{"artist": "Watsky", "songs": [{"year": "2012-10-25", "lyrics": "[Hook]\nI was just thinking that I really like you\nAnd I was just thinking I really like you\nAnd I was just thinking if I kidnap your boyfriend\nCould I be your boyfriend?\n\nVerse 1\nI've gotta time it right\nI've gotta plan it through\nYou're a stick of dynamite\nHope that I can handle you\nYou're a whole new animal they couldn't hold a candle to\nSo I demand a candid answer, what's a man to do?\nCould pay a camera crew\nGet an editor set up in his kitchen with the video and kid and put his ass on Catch A Predator\nCall his creditor\nTell em he's in heavy debt and with fed on red alert\nI plant a care package, a bear trap with the teeth padded\nAnd when he grabs it, then I beat it like Br'er Rabbit\nOr I could lock him in the liquor cabinet\nDrinking, thinking, sad until he kicks the habit\nAnd if he gets lovey dovey\nI'll take a kindergarten keep him in the cubby\nWhen we leave for winter break and someone gets the pet I'm gonna pawn him off on little Betty like he was a guppy\n\n[Hook]\n\nVerse 2\nIt's a minute to midnight and\nThat's my cue to pull up in my big white van\nBeckon him with my charisma\nChucking snickers at him like it's his Bar mitzvah\nAnd if someone heard that racket\nBetter bet I'm gonna bag him in a burlap sack\nYour dude's whack\nHe lacks the X Factor\n(Bookmark boy) I can be the next chapter\nWhat do I do for the women who tell me they want me?\nThat when I got over the one who steadily haunts me\nIf I get over the one\nThen I'll be ready to party\nThen I'll be looking at Blondie\nOn me get up and calmly walk away\nIt's pretty pathetic\nI get it, but not today\nYou wanted to play\nYou want me to act tough?\nSpend every dime\nBut I won't go bankrupt\nI said to be easy\nCould you please back up\nAll these Jenga beezies they just don't stack up\n\n[Hook]\n\n[Verse 3]\nBut if I'm too blunt, I can mask it\nIf time's a blunt, I can pass it\nI'd rather pass with the passenger\nShotgun the messenger\nCall off the massacre\nYour dude is cool\nI wish I didn't have to mess with him\nTo tell the truth\nI want the very second best for him\nI'm positive I'm not pessimist\nI'm not jumping\nI'm just pissing off the precipice\nIf I deafen to the definition and I never getcha\nGod I betcha I'll be better cause I metcha but be I'm missing always waiting for day you'll be available\nYou keep on stating who you're dating ain't debatable\nBut baby, maybe we could pick up when this shit ends\nMy sixth sense says we're clicking like we're Bic pens\nI don't wanna read the writing on the wall if it's only gonna end like Annie Hall", "image": "https://images.genius.com/c29f84b2362a2e43218c9c9f8eb13126.500x500x1.jpg", "album": "A New Kind of Sexy", "title": "Kidnap Your Boyfriend"}]}