{"artist": "A$AP Rocky", "songs": [{"title": "I Really Mean It Goblin/ Yonkers Freestyle", "image": "https://images.genius.com/84260afdfa02f8cba4117c80ac6c847b.1000x1000x1.jpg", "album": null, "lyrics": "London town, I came to shut it down\nI'm the king of the underground they call me A$AP Rocky baby\nLet's do it! Oh we 'bout to spit for real\nI be that trill kid, that pretty mother fucka you know\nWorry about who hot, talk about who hotter\nHarlem globetrotter, his shirt stay Margia\nBlack harry potter, couldn't get with me like your father\nGreen coop looking like guava\nCouldn't get with me, look its Spike Lee on the scene\nAnd I'm balling out of my league\nCamoflauge on cause I came up fly guys\nSo I do dirty money, hand sanitize fries\nWhat's that you eating? Throw some salt on it\nYou know they like pigs throw the pork on it\nAnd I see them in the road throw a fork on it\nAnd I, rest in peace throw the corpse on it\nI can floss on it word to ?\nAnd I stick them in the gutter and I get at your lil brother\nNever start a ? coming at your mother\nAnd you know me and A$AP we gon' just ride for each other\nWhat's up?\nLike a goblin, tell them keep slobbin' on my knobbin'\nI don't give a damn because I'm mobbin'\nWith my crew came down to London town, shut it down\nGive me the crown I got the sound, whatever\nI come through with the lever and I hit you with the mother effer\n?\nAnd you know I'm like a marksman with the Glock 10 and I put it to your cartman\nAnd I bring it to your door, give it to you raw\nODB, shimmy shimmy shimmy ya ooh!\nAnd my hat say \"calm the f down\"\nCame to London town, came to shut it down\nThis is off of the tippity top and the dome and I'm comin'\nIm creamin' and niggas know that I singin it and I come through in it\nGot these niggas singing it oh!\nNo curses on the verses whats worse?\nPut them in the hurst, bad bitch red skirt\nYou know that she flirt, I'm smoking on that purp\nAnd I like that purple drank, I would put you in the dirt\nNever talk never chirp, use a bird\nDon't want it with me kick them chickens to the curb\nGirls got nerve and the fiends got served\nAnd you know the D's on me cause the D's got served, word? Ok\nThis is off of the top and\nA$AP Rocky came off of the block\nBandana around my neck, money signs on the grinding\nYou already know Harlem world we shining\nI day dream pretty women out in Beijing\nParis say ling hop up in the saline\nI chase dreams, man white but the face green\nSame thing everyday, everything green\nF my reply, ? through the statements\nHelp me with my statements, I was saving in my savings\nFrom a three bedroom shack I was raised in, the condos out in Jersey full of J. West paintings\nTalk to the boy how you talk the lord, talk to these broads how I talk to my dog\n? plates, Margiella rugs, my boys make smores out you marshmallow thugs\nHop up out of first class, hop into that E-Class\nCut raw cut school I ain't ever see class\nIf so I was cutting in my nigga Steve's class\nSchool of hard knocks graduated with a G Pass\nG Code, Street Code, Fake niggas, cheat codes\nNiggas trying to turn fake shit green cheap gold\nI don't know how they do it for the freak shows\nBut I ain't gonna be smoked, so we toast\nA$AP, A$AP\nYo we could do this all day alright?\nYo I could do it all day I could keep going man\nLet me know whats up\nKeep doing your thing!\nYo I'm on to the next-ist, you looking at the bestest\nMarried to the game treat you niggas like my step-kids\nPull up in the Porsche, niggas feel nausea\nDidn't write the rules but my status like the author\nJust crashed the Range, so I pulled the Bent out\nProbably getting brains, chilling in my penthouse\nSlackin' on your mackin' and I'm bout to lay my pimp down\nChristian Louis Vuitton red bottoms come in mens now\nOn to the next one, skinny jeans fitted\nPull up to these shows and these hoes know to get in\nSaid they like my fitted clothes down to my split ends\nLittle do she know I got a big ego\nOn the next and gotta order a protection\nKillin' feelin' all these records so my charges is molesting\nAnd assault with deadly weapons so these rappers feeling threatened\nThey the hip hop patron, I'm a hip hop felon", "year": null}]}