{"songs": [{"title": "Got 5 On It", "lyrics": "(feat. Lil' Flip)\n\n[Whoo Kid: talking]\nWelcome To The Hood Volume 1\nI don't need a scale nigga I know how much that is\nHey Flip pass the weed nigga\nWhy you talkin about 5 500 hundred nigga we buyin dro\nNigga you know what it is nigga\nWhat you smokin' on nigga?\nI'm smokin' on that fresh shit\n\n[Chorus:]\nI got 5 on it\nSmokin' on that Endo weed\nI got 5 on it\nSmokin' with them Clover Gees\nI got 5 on it\nTwist it up and smoke the sack\nI got 5 on it\n[Lil Flip:] yeah now puff puff pass nigga lets get high\n\n[Verse 1: Lil Flip]\nThe block too hot these niggas ain't playin in fact they die over greed\nWhile I smoke weed\nWith red here\nYa'll niggas know I flip them bizzirds\nYa'll niggas know I sip that Sizzurp\nI comin' from Houston the home of Face boy\nI'm a bad boy like Puffy and Mase boy\nThe bigger the pistol the bigger the bullet bitch\nDon't play with me cause I'm eager to pull it trick\nWhat you about that purple haze?\nI smoke that shit that'll make you miss work for days\nI got bricks of coke and pounds of dro\nAnd I don't discuss business around them hoes (oh no)\nI ain't tryin' to be that nigga gettin cuffed up\nRule number one don't ever talk much\nRule number two keep them niggas out ya crib\nCause you just can't show everybody where you live\nNiggas think I changed\nCause I got a little change\nBut the money and the fame\nCame along with the game\nNow you wonder why we get high\nJust to get by motherfucker!\n\n[Chorus:]\nI got 5 on it\nSmokin' on that Endo weed\nI got 5 on it\nSmokin' with them Clover Gees\nI got 5 on it\nTwist it up and smoke the sack\nI got 5 on it\n(Lil Flip:) yeah now puff puff pass nigga lets get high\n\n[Verse 2: Young Buck]\nWhat you know about that Blueberry Kush, Strawberry Haze?\nThat shit that have a nigga ass high for days\nMy eyes bloodshot red I'm tryin to stay in the fastlane\nThe blunts still burnin' and the police on my ass mayne (fuck ya'll)\nI don't pay for weed my white boys show me love\nThey be like \"Here Buck, dog I brought some bud\"\nAin't nothin' like that California marijuana\nYou wake up the next day the smell still on ya\nPass the ganja and\nLight ya lighters man\nRaise your hand if you a true Bob Marley fan\nCan't get enough of Ms. Mary Jane\nWhen I leave the bitch she keep callin' my name\nWhenever I come around\nShe says I break her down\nShe brought half of her friends and she bringin' a pound\nEverybody gettin' high thats how its supposed to be\nIf you got that real shit come and smoke with me Young Buck!\n\n[Young Buck: talking]\nAnd I ain't talking bout no motherfuckin' brown weed neither nigga\nI know alot of ya'll niggas out there think ya'll smokin' dro\nBut ya'll smokin' pretend-o (get it?)\n\n[Chorus:]\nI got 5 on it\nSmokin' on that Endo weed\nI got 5 on it\nSmokin' with them Clover Gees\nI got 5 on it\nTwist it up and smoke the sack\nI got 5 on it\n[Lil Flip:] yeah now puff puff pass nigga lets get high", "album": null, "year": null, "image": "https://images.genius.com/787eb0fed4a05aa802dee3238c64431a.792x792x1.jpg"}], "artist": "Young Buck"}