{"songs": [{"album": "Eardrum", "image": "https://images.genius.com/36dc52e92a9d27102149cf08b1a7f326.936x936x1.jpg", "year": "2007-08-21", "title": "Country Cousins", "lyrics": "[Intro: Raheem DeVaughn]\nDown cousins.. across the border\nI got cousins.. country cousins\nI got cousins.. country cousins\nWHOO!\n\n[Talib Kweli over Intro]\nYo son, what the deal son? What's really hood son? (what's really hood?)\nWord is born, shit is real, shit is real\nYo son, this block is def\nNigga need to go over here and pop off real quick\nI gotta get that gwop by all means, you know what I'm sayin son\n\n[Verse 1: Talib Kweli]\nGrowing up in Brooklyn, shit I thought that everybody talked this way\nRaised on Rakim and Run-D.M.C., so I thought that everybody walked this way\n\"We fresh, we chill, we def, we ill,\" it's just some things that was taught to say\nAnd every Saturday morning, I watched cartoons with a bowl of Frosted Flakes\nThen.. the puberty came, started hitting them cuties with game and the truancy came (uh!)\nStarted cutting in not just class, I was comin all fast, I was new to the game (uh!)\nUsed to playin on T.V., courtesy of video music box\nPlus! Knew a lot of hustlas, goin O.T., comin back with the new hip-hop\nLike! E-40 holding down the yay (that yay), N.W.A. in L.A\nOutKast from the A-Town, way down in Houston they play the UGK\nI walk and talk kinda fast and thought of as a New York kinda rhymer (word is born)\nBut must New Yorkers got family in South and North Carolina (come on!)\nL.A. is little Alabama, they walk and they talk with a country grammar\nNew York think everybody else sound country, so they get started, started callin 'em 'Bamas\nDown south where we buy them hammers, down south where we sell them drugs\nDown south where life is cheap, where they quick to fill you with them slugs\n\n[Hook: Talib]\nIt's nothin, I'm from New York but I got country cousins\nIt's nothin, we stay connected by the slang we bustin\nWant it simply put? You can't pin me when I spit gotta set everyone free\nI'mma underground king, nigga Pimp C free\nWord up to my man Bun B what?\nIt's nothin, I'm from New York but I got country cousins\nIt's nothin, we stay connected by the slang we bustin\nThe thing we bustin, the game we hustlin, the things we cuttin\nThe flame we cuppin, the lames we snuffin, your name is nothin!\n\n[Verse 2: Bun B]\nGrowing up in P.A., I knew nobody out there talked like us\nNothin but that county slang, \"What up dog? What up cuzz?\"\nLate night you see us guzzling 40's, menthols, wine, and weed\nSitting on the back porch, getting zooted, feeling fine indeed\nListening to Eric B. and Rakim or EPMD\nCool C and Steady B, plus that Public Enemy\nNot to mention N.W.A., DJ Quik, and MC Eiht\nDown south we listen to it all, we didn't discriminate\nThen along came Geto Boys, Raheem, and the Royal Flush\nRap-A-Lot Records based out in Houston, represents for us\nO.G. Style, The Convicts, Def IV and Too Much Trouble\nOdd Squad and Ganksta NIP put it down for H-Town on the double\nSo I said, \"It's time to hustle,\" got down with my brother C\nPut together UGK and shit the rest is history\nWe make hits by the dozen, put it down when they said we wasn't\nTrust me it's nothin, just another day in the life of your country cousins\n\n[Hook: Talib]\n\n[Verse 3: Pimp C]\nIn Brooklyn, New York I'm down with Lord Jamar\nBack in P.A.T., man we be sippin the barre\nI'm down with J. from Houston and I think it should be\nBut when I'm out in L.A. I fuck with Ice-T\nShort Dog is my O.G., we been down forever\nTaught me the game, lane to lane, and keep my pimpin' together\nNiggas don't understand by far back in the day\nIt was Mase and then my brother put me up on Black Star\nStarving blacks often lose our way\nCause we isolate ourselves and give our ghetto pass away\nMy niggas pass away in an unreal way\nThey mommas depleted, I'm just tryna make sure that their kids straight\nI'm on the chitlin' tour with my mic in my hand\nShittin' on these jealous niggas in the new world clan\nI wouldn't trade it for nothin, only a crazy man would\nI represent for the whole South, but mainly just for my hood\nThe pimpin's good...\n\n[Raheem DeVaughn]\nI got cousins (I got cousins), country cousins (country cousins)\nLike blood that's thicker than water (it's nothin), down dirty 'cross the border\nI got cousins (I got cousins), country cousins (country cousins)\nLike blood that's thicker than water (it's nothin), down dirty 'cross the border\nThey're my country cousins!"}], "artist": "Talib Kweli"}