{"songs": [{"title": "3, 2, 1, GO!", "album": "I Need Mine $$", "year": null, "image": "https://images.genius.com/ec6fd0ec1dc958208ad742d28e069f81.800x800x1.jpg", "lyrics": "(Intro, Juicy J & [Lil' Flip])\nDJ Paul, Juicy J Productions\nHypnotize Minds\nSHUDAFUCKUUUP!\n[Let's do it, nigga]\n[Pay attention]\n\nBring it back\nBring it back\nBring it back\nBring it back\nBring it back\nBring it back\nBring it back\nBring it back\n\n(Pre-Verse, Lil' Flip & [Three 6 Mafia])\nNow if I front you a O [Bring it back]\nAnd once you make all ya doe [Bring it back]\nAnd if you steal from me nigga [Bring it back]\nCause my homies kill for me nigga [Bring it back]\nWe'll cut off ya head [And bring it back]\nDuct-tape it to ya leg [And bring it back]\nAnd yo partnas can get it too [Bring him back]\nNow they pumpin on his chest, cause they tryin'a [Bring him back]\nI told y'all niggas, you supposed to [Bring it back]\nBut that's what you get when you talk behind my back\nSo tell my foes they can get it anytime\nCause when I'm on that shit, yeah I got it on my mind for real\nHere we go\n\n(Hook, Lil' Flip)\nThree, two, one, go!\nI'ma let'chu know, these rap niggas hoes\nLook you don't wanna fake\nCause I'll break yo shiiit\nAnd you don't want drama with the Clover G clique, yeah!\nThree, two, one, go!\nI'ma let'chu know, these rap niggas hoes\nLook you don't wanna fake\nCause I'll break yo shiiit\nAnd you don't want drama with the Three-6 clique, bitch!\n\n(Verse 1, DJ Paul)\nSee nigga, this dope is cut-less\nFlippin iron n' weight out my black Cutlass (Cutlass)\nShiny paint, with the quarter-top rag (Rag)\nGot it for cheap, but we can't brag (Can't brag)\nHaters playin, but they better have a plan-B\nI got a Glock everytime that they see me\nAnd I'ma bust til' my clips out of business\nAnd that won't be til' I down all that witnessed\nSee I'ma do you bitches clean, by the book\nWith no murder weapons or talkers, then I'm good\nSee I ain't no trouble maker, just love to smoke wood\nBut'chu Three-6 wanna-be's got me mis-understood, bitch!\n\n(Hook)\n\n(Verse 2, Juicy J)[Left! repeats on beat throughout verse]\nYes sir\nWhen you make a little cheese, then these niggas start to hate\nFor just rappin, or a jackin, or a dealer pushin weight\nDon't get mad at the Juice, cause I hustle til' it's late\nAnd you somewhere passed out, wit'cha face off in a plate\nHeard you never get no pussy, so you hold 'em down and rape\nRidin 'round in rental-cars, like you head of the state\nTryin'a cut niggas deals, in the trunk he got the ba-kin soda\nThought I told ya, he'll get'cha cause he fake\nSince I rap, don't be thinkin I can't leave yo body stinkin\nYes, we do a lot of drugs and a whole lot of drinkin\nIn this business, yeah it's gangsta\nBut this hatin, I'm gon' finish\nHit'chu in yo fuckin mouth, send you back to the dentist (Nigga!)\n\n(Hook)"}], "artist": "Lil Flip"}