{"artist": "Yukmouth", "songs": [{"album": "Godzilla", "image": "https://images.genius.com/06ce9a2ae3e7a9474fcfc10e00a00df9.500x494x1.jpg", "year": null, "lyrics": "[C-Bo]\nC'mon niggas\nYeah\nThe Thug Lordz in this bitch\nGet up... salute nigga, 21 salute nigga holla..\nTHUG... LORDZ!\nNiggas that ride or die for their coast, nigga\nYeah, put ya head to the street\nPut ya head to the street nigga, holla...holla\nTHUG... LORDZ!\nThug Lordz in this bitch\nRegime niggas\nWest Coast Mafia niggas\nYeah, untouchable niggas man\nC'mon niggas, C'mon niggas. Ha\n\n[Verse 1: C-Bo]\nCheck, my Uzi weigh a ton I hits 'em up an I run\nI'm loco, I keep a guns caulked in the lo-lo\nI'm King Tut of the hood\nCuz everytime I drop a record dog\nShit I bring it to the gut of the hood\nAn I ain't never backed down, so don't test me dog\nCause I'm a nut, an keep a Smith & Wesson pressed in pause\nAll these faggot ass rappers keep yappin they jaws\nYeah they the shit cuz when they see me they just crap in they drawers\nYeah that nigga 50 he hot, but I heard he's a snitch\nAnd he ran up under that white boy, I heard he's a bitch\nAn I ain't seen him in the hood, no where in the Valley\nNo House of Blues, or Peanuts, he scared of them alleys\nHeard he copped his rims and Big O Tires in the hood\nSurrounded by police, wearin wires in the hood\nHeard they ran him outta New York, and he's comin to Cali\nNo Glocks and Sigs, just lots of pigs\nEh nig, your rap career will not outlast Pac and Big's\nYeah you fuckin wit some kids that ain't scared of the bricks\nYou in there, four-fifth kick dead in the bricks\nThug Lordz'll have ya hit, split dead in a 6, c'mon\n\n[Chorus: C-Bo]\nTHUG... LORDZ!\nGettin this money like a motherfucker ready for war\nWe'll never snitch\nNever flip\nNever quit my click was heaven sent wit Mac-11's to\nHit when we dip they holla..\nTHUG... LORDZ!\nGettin this money like a motherfucker ready for war\nWe'll never snitch\nNever flip\nNever quit my click was heaven sent wit Mac-11's to\nHit when we dip they holla..\n\n[Verse 2: Yukmouth]\nYeah..\nIf the boss wants you dead, then it's off wit ya head\n'specially a bitch nigga that talk to the feds\n'specially a bitch nigga that walk wit the feds\nTo award shows cause niggas bout to toss him some lead\nYou niggas think the West coast is just Dre an Xzibit\nThey aiight, but pay attention Thug Lordz handle they business\nWe the realest from the Gardens to the Village\nMake the hardest niggas feel this\nMake the Sergeant want to kill us\nRegardless Godzilla will murda you nigga\nI twist ya cap like a Schlitz malt liquor for that slick talk nigga\nIf ya nigga gang bang, don't crip walk nigga\nWearin a big chain will get ya ripped off quicka\nWe the only Thug Lordz bitch\nAfter all big faces like Mount Rushmore, you don't want war bitch\nThat'll get you pistol whipped an extorted\nYou lucky I wasn't on Face shit, I woulda destroyed it\nYou better run like Forrest Gump in Air Forces\nCause our guns look like torches, bustin from drop Porsches\nOr the drop Ferrari, hotter than a hot tamale\nThe T-H-U-G-L-O-R-D'z holla..\n\n[Chorus]\nTHUG LORDZ!\nGettin this money like a motherfucker ready for war\nWe'll never snitch\nNever flip\nNever quit my click was heaven sent wit Mac-11's to\nHit when we dip they holla..\nTHUG LORDZ!\nGettin this money like a motherfucker ready for war\nWe'll never snitch\nNever flip\nNever quit my click was heaven sent wit Mac-11's to\nHit when we dip they holla (they holla)", "title": "Thug Lordz"}]}