{"songs": [{"album": "ET: Extra-Terrestrial Musik", "year": null, "title": "Here I Am", "image": "https://images.genius.com/fac370709daaebdfa08cba4db73b3462.500x500x1.jpg", "lyrics": "[Verse 1: Fred Money]\nWoke up yawning from a sour nap\nSlept for a hour and I'm proud of that\nHit my nigga Kwon, he inside the trap\nTold him I'm on my way, get the slime from Mac\nHit the shower and recite a rap\nThrow on some get fresh, outie in a hour flat\nBig boy mom, smelling like a sour pack\nKryptonite, ask Superman if he want his powers back\nAround the scratch like I got a itch\nIn the 'jects with my scrap, and he gotta pitch\nTake him across the map whenever I got a trip\nDon't gotta trip, we gon be rich with a lot of chips\nI'mma spit for them niggas that can't\nBut wish that they could, so they can ball and sit in that paint\nTry to change a nigga's ways, all you get is restraint\nAnd once you get a nigga paid, all his feelings is blanked\nReal talk -- I seen steel spark\nBodies on the floor, outlined real chalk\nSqually knocking down doors when them deals talk\nYou ain't a pig, what you squeal for?\nShit is messy zoo, how this speci' do\nTurn a close friend to a vegetable\nGot my man doing time, and it's Federal\nIf he said he do, then I bet he do\nLook\n\n[Verse 2: J.R. Writer]\nI got that type of raw you bubble that'll get us all in trouble\nI do it for the hood where the only choice is hustle\nRawest boy in the world, come and snort a couple\nI got that boy and that girl, come and snort a couple\nI was born to ball; nigga, you ain't known at all\nFollow protocol? Well, I'm the pro to call\nWhen you need someone to tighten up a rookie\nYou gambling with your life -- I'm surprised you ain't a bookie\nCut the foolery, cause obviously you pussy\nAin't no schooling me, you'd think the guy was playing hooky\nLive-r than I should be, you looking at a spitter\nTrying to see a wussy, then look into a mirror\nNigga, I'm the answer; how could you be a killer?\nLast time you had the hammer, you was putting up a picture\nTalk about you got work on the block\nThat don't cut it -- here, you must work at the shop\nIt ain't worth it, so stop\nYou really hurting the pots\nI done dealt with so much bricks that I should work on my shot\nYou ain't never wait in the hall with weight in the hall\nGo into a sneaker box just to make a withdrawal\nYou ain't never creep the block when they take it to war\nIf I ever squeeze a shot, you'll go straight to the law\nSo, dog, what you trying to sell?\nYou know Writer well\nYellow Rollie on, only time will tell\nI ain't with the foolery you spitting\nI took a listen -- you's a waste of studio equipment\nWho got a swag excellent as me?\nI should put you in a bag, you'll never be a g"}], "artist": "J.R. Writer"}