{"artist": "Kid Capri", "songs": [{"image": "https://images.genius.com/3ab7e648317c8fc3f7e94ef00586a381.400x400x1.jpg", "title": "Hang ’em High (feat. Dee Joseph Garner)", "year": null, "album": "The Tape", "lyrics": "(news reporter)\nGood evening, this is Dee Joseph for WBIZ radio\nThis just in -\nPolice officials report that a six year old girl was found raped today\nThe girl's stepfather is the key suspect in the case\nDetails are still sketchy at this time\nNow back to the Kid Capri radio show\nHow do you feel about it.. Kid Capri?\n\n(Verse One)\nHang 'em high, let him suffer, before he die\nCause in my mind I see that little girl cry\nShe was abused, misused, and even sodomized\nShe didn't know - all of this was a surprise\nSo now she's scarred for life, nothin can change that\nBeing treated like some dog by some maniac\nWhat type of man would want to do that to a six year old\nOut of all of these women that the world hold?\nYou coulda went to a nightclub and met a chick\nBlack or white, Puerto Rican, you coulda picked\nBought her a drink, took her home, and maybe got some\nBut you'd rather rape a baby and you think it's fun?\nNow you're goin to jail, death row I hope\nBefore the rope when you get there, your boots'll smoke\nI got somethin, to say to ya before ya die..\n.. hang 'em high\n\n(Verse Two)\nMy name is Kid Capri I wanna say this to y'all\nAny man that rapes a woman is not a man at all\nEspecially a little girl that don't know nothin about that\nRape, man you're a maniac\nSo now you're locked in a cell, what good are you now?\nNo friends, no freedom, and no style\nWord to duke you're gettin stuck like a blister\nJust for instance, that coulda been my sister\nOr my moms, my girl or my daughter Lou\nBe glad the cops got to you before I got to you\nIt's a shame for a girl to be so scared\nThat when she walk down the block, her life is dead\nCan't jog down the street, after dark\nTake a look at what happened, in Central Park\nA girl is runnin, while some bum is bummin\nThe only thing he's thinkin about is cumin\nHe gets his rocks off, now he feels like a man\nThen he kills her, and steps off, but understand\nWhat goes around, comes right back around\nAnd when he's found, he's gonna get a beatdown\nHe tried to skip town, headed for the Northbound\nGot no money so he steals and gets shot down\nBut don't die, so now it's gonna get rougher\nBefore you execute him - LET ME SEE HIM SUFFER\nGive him the chair, shoot him down, let him die\nBetter yet, huh, hang 'em high..\n\n(news reporter)\nThis just in - police officials report\nThat the suspect in the rape of a six year old girl\nHas been apprehended, and has confessed to this outrageous crime\nLet's hope they really hang this guy\n\n(Kid Capri)\nKid Capri, Silver D and Money Mark - hang 'em high!\nOut! {*echoes as it fades*}"}]}