{"artist": "Angie Martinez", "songs": [{"title": "Live Big Remix", "image": "https://images.genius.com/fa4abffe2c6164a010ae6b833f491d67.1000x981x1.jpg", "album": "Animal House", "lyrics": "[Angie Martinez] Oh!\n\n[Sacario]\nI don't think y'all ready [Angie Martinez Laughing]\nIt's what the world's been waitin for, live big, car keys the remix\nI go by the name of Sacario\n\n[Fat Joe] Yeah!\n[Sacario] Angela, Joey Crack\n[Fat Joe] Pick the music up man\n[Angie M] Let's do it\n[Sacario] We 'gon keep doin this\n[Fat Joe] Gangsta\n\n[Verse 1: Fat Joe]\nYo! We leak heat on the streets, still they doubted it\nWhen I could easily eat any emcee who think he 'bout it\nFlows sickenin, either your under a rock\nOr ya mothafuckers is just not listenin\nAnd I don't me to sound hard or calice\nBut if you keep sleepin on Joe it just could result to violence\nA couple of shots a clear the place\nBrrrrraaaappppp! Cocksuckers we here to stay\nIt's the cook coke man, one 'mo gain\nHow the fuck you gettin dough when you look broke man?\nIt's the mink coat man, cost me nothin\nSee me jumpin in the pool with it just for frontin\nAnd the chicks love the fat guy, I wish it's cause of the dick\nBut I bet it's cause of the chips and the fast life\nMe and Ange livin big forever\nThink a click fuckin with this man whatever\n\n[Chorus: Sacario]\nLive big all my shorties you know who you is\nSpend that dough, you don't need a nigga that trip\nAnd everybody with car keys only big car keys\nPull out your car keys everybody please\nLive big all my shorties you know who you is\nSpend that though, even on a remix chick\nAnd everybody with car keys only big car keys\nPull out your car keys everybody please\n\n[Verse 2: Angie Martinez]\nOh! It's just me the O.G\nAnd since this live big let's start with B.I.G\nAnd rep it for Big Pun and do it for Big L\nAnd since I got a big truck you know I live well\nOn the remix, other stations I can't agree with\nI been here for ten years ain't never leavin\nIt's been clear I went there so you could see shit\nLet them fear we not scared it ain't a secret\nHope you prepared in the streets get ready\nCause we keep this steady, Animal House piece is heavy\nDo more hotlines than hot nine\nKeep your hand on your mouth cause we get very\nUgly out there, trust me out there\nThey love me out there, from Miami back to here\nIt's a new day I'm battin up, with homeruns\nSacario four album and I'm droppin this summer\n\n[Chorus: Sacario]\nLive big all my shorties you know who you is\nSpend that dough, you don't need a nigga that trip\nAnd everybody with car keys only big car keys\nPull out your car keys everybody please\nLive big all my shorties you know who you is\nSpend that though, even on a remix chick\nAnd everybody with car keys only big car keys\nPull out your car keys everybody please\n\n[Verse 3: Sacario]\nMr. Guantalo ay still eat where you won't be seated\nStill shop where you won't be greated\nSince the double XL there ain't a spot that they don't be peakin\nAnd live big number one record northeast region\nSo stop breathin, I'll let you shop for scraps soon after I eat\nThis is the remix back with the beat\nClowns, take them scraps home don't be proud\nCristal don't make tops so we don't drink we pour our\nI know I make you sick so call out\nLike my soles latino crowds stomp the floor out\nSacario crew, still tigre out\nSixty deep at Jimmy's and I got the technicians with me\nI'm just here to take all y'all chicks\nTo make all this money and drive all y'all sick\nAnd I never, 'gon, stop remix\nMy own shit is problems whenever I drop\n\n[Chorus: Sacario]\nLive big all my shorties you know who you is\nSpend that dough, you don't need a nigga that trip\nAnd everybody with car keys only big car keys\nPull out your car keys everybody please\nLive big all my shorties you know who you is\nSpend that though, even on a remix chick\nAnd everybody with car keys only big car keys\nPull out your car keys everybody please\n\n[Outro: Angie Martinez]\n[Laughing] It's the remix baby, Animal House, Angela, Sacario, Joe Crack\nIt's a new day", "year": null}]}