{"artist": "Willie D", "songs": [{"year": "1989-12-21", "lyrics": "[Intro:]\nYo D man, check this shit out\nI got my piece with me, right?\nWe going to bust a cap in a mother fuckers ass tonight!\n[WILLIE DEE:] Man shut your stupid little ass up\nThis what you're mother fucking ass need to do!\n\n[Verse 1: Willie Dee]\nPut the fucking gun away, take up karate\n'Cause you don't want to shoot no-goddamn-body\nPut up the mother fucking steel and chill\nBefore that high-cappin' shit get you killed\nIt's time for your kind to get realistic\n'Cause people like me making y'all statistics\nYou don't want to step with that ho shit\n'Cause I draw and I bar no son of a bitch\nThat means your momma, your daddy, your sister, your damn brother\nYour aunt, your uncle your slow-walking grand mother\nAnd any other that gets in my way\nYou want to see another birthday? Put the fucking gun away!\n\n[Hook:]\nHey!\nIf you want to live mother fucker\nIf you want to live you better put the fucking gun away!\nYou don't want to shoot no-goddamn-body\n\n[Verse 2: Willie Dee]\nPut the fucking gun away, I done told ya\nYou've been warned by a ghetto soldier\nWho ever ever said they took me as a liar\n'Cause I've been kicking ass since my first pacifier\nI never felt the desire to follow rules\nI'm genuine old-school damn fool\nSometimes you don't make it to the trunk\nI don't rely on the punk 'cause I love to chunk\nToe to toe against any hoe\nThey don't make my kind anymore so\n\"Put the fucking gun away!\" is what I told one sucker\nBut he was a hard-headed fucker\nHe was flashing a .357 at me\nHe didn't know I had a motherfuckin' Uzi\nIf he took another step I couldn't refuse\nTo put his ass on the ten o'clock news\nHe took it and that's all I gave him\nThat's when I sprayed him and sprayed him and sprayed him and sprayed him and sprayed him\nWent for his pockets 'cause I knew he sold dope\nI took his money and a juicy-ass rope\nI don't give a fuck about no mother fucking witnesses\nYou better listen when Willie says, \"Put the fucking gun away!\"\n\n[Hook:]\nHey!\nIf you want to live mother fucker\nIf you want to live you better put the fucking gun away!\nYou don't want to shoot no-goddamn-body\n\n[Verse 3: Willie Dee]\nYo man, I was at this party on the south side of town\nI saw this pussy-ass punk I had to beat down\nHim and his posse was standing near and drinking\nThat's when I knew the shit was finna start stinking\nI wasn't about to be a bum rush victim\nHad to think of something quick that tricked him\nI went to the John and got a dollar tone\nCalled my troops on the portable cellular phone\nBefore the punks could get suspicious\nI returned and mingled with the bitches\nAfter drinking a bottle of wild Irish Rose\nI said, \"Suck my dick, it ain't enough of you hoes!\"\nThe music stopped somebody said, \"Get him\"\nThe first punk came wit him, I hit him\nAnother voice said \"Hit the flo'\"\nI turned around it was Chuck, scrapped down like Rambo\nHe had the 5th Ward posse in effect\nThey didn't know they was fucking with\nChop pistol, was the first mother fucker that rose\nHit him in the face and broke his goddamn nose\n(\"Call the doctor, call the doctor!\")\nDamn 'em! We started slammin' mother fuckers at random\nI heard a bitch scream, \"He's got a gun!\"\nI didn't know which one so I said bar none\n(*gunshots*) That's all you heard\nWhen the smoke cleared, all my boys were worried\nWe served 'em up on a meat-wagon platter\nIt wouldn't of happened if he had a-put the fucking gun away!\n\n[Hook:]\nHey!\nIf you want to live mother fucker\nIf you want to live you better put the fucking gun away!\nYou don't want to shoot no-goddamn-body", "image": "https://images.genius.com/03c2b50829c5f112b3f64d1ceaa1bce1.700x700x1.jpg", "album": "Controversy", "title": "Put the Fuckin’ Gun Away"}]}