{"artist": "​iLoveMakonnen", "songs": [{"title": "Sound Like Who? (Remix)", "lyrics": "[Hook: ILoveMakonnen]\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\n\n[Verse 1: ILoveMakonnen]\nNigga I hit the club, all these fucking songs\nSound the god damn same, what the fuck these niggas on?\nBoy these niggas lame, out here rapping the same shit\nAnd when I pull up on these niggas, they never have no bricks\nOr no weed, or no molly, or no motherfucking coke\nMan this shit is not fun, these niggas ain't even got no jokes\nBoy they broker than a joke, I'm out here really selling that dope\nAnd I'm talking on tracks, niggas speaking these facts\nAnd my dope is fucking art and nigga, my art is dope\nSo please don't misconstrue my dope for meaning I'm here selling coke\nCause I do not sell no coke, unless it's Coca Cola\nDasani water products, no, nigga on us, fucking get a sponsor\n\n[Hook: ILoveMakonnen]\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\n\n[Verse 2: Lil Yachty]\nHold on, hold on\n[?] just started\nBoat from the six, god these bitches are horny\nAye these bitches tryna fuck, cause my money is longer\nAnd my change is real, nigga you get the feel\nHold on\n36 diamonds are shining too bright, you can get you a picture\nWhoa, bitch from the pic got an ass like a [?] but she can't roll like a Swisher\nGimme them racks, I'ma pull up too clean, pull up in a fisker\nI might pull up, I might pull off, pull off with your sister\nDiamonds they dance like Meechie, Saint Laurent [?]\nNew Balance on like I'm Gleechie, bow to your knees when you greet me\nWhoa, new [?], all these pussy niggas cheesy\nDamn, I spent my whole check on my wrist, now my wrist lookin' freezy\nAll these pussy niggas greasy, that's why I stay with the same niggas who I been with, before I had that, now I got that, and I'm on now\nBitch tried to call my phone, said that she need some, better go now\nBout to go and cop a crip, with a new Italian bitch, up in Rome now\nBout to cop a new [?], that's a foul shot\nBalling hard like I'm A.I., pussy nigga don't you dare try\nI heard your new song and it sound like pure shit, and you're a lyricist\nBroke nigga ain't got a pot to piss, talking bout the diamonds in his wrist\n\n[Hook: ILoveMakonnen]\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\n\n[Verse 3: Larry League]\nCoke white whip, call that shit Scott Storch\nHopped up off the porch, Johnny Storm with the torch\nI might take off with your bitch, like I'm Clark Kent\nTippin' on .44's, hoe I'm leanin' and I'm bent\nYou got hits, boy, who you tellin'? I'm so dope they wanna sell me\nFlexing pennies, boy you petty\nI went through that already\nYou need to stop like a octagon\nSee you in the scope bitch I'm lockin' on\nAin't talking money, ain't no response\n[?] like Lil Jon\nRandy keep the Nino like a fucking nightcrawler\nSippin' baby bottle, but I ain't a fucking toddler\nGot that bitch in my palm, I got the world in my hands\nBitch get caught hangin' 'round the gang, cause you's a motherfucking fan\n\n\n[Hook: ILoveMakonnen]\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?\nThem niggas tryna sound like who? Us?", "image": "https://images.genius.com/ec02efc692cd2274b85d5e771ec83d76.500x500x1.jpg", "album": null, "year": "2016-05-23"}]}