{"songs": [{"year": "2011-05-17", "album": "Who Is KB?", "image": "https://images.genius.com/cc0b72e73e609b19ba9fe03fa5eac73b.757x759x1.jpg", "title": "Don’t Waste Your Life (Remix)", "lyrics": "[Intro: KB]\nSame as don't waste your life, man\n(HGA)\n\n[Verse: KB]\nI know a lot of people man, they scared they gon' die\nA couple of 'em think they be livin' in the sky\nWhile I'm here livin' man I gotta ask why?\nWhat am I here for? I gotta figure out (waste my life)\nNah, I gotta make it count\nIf Christ is real homie, what am I gonna do about\nEverything in Luke 24:32-36? You really gotta go and check it out\nBut if you know I gotta take every opportunity that I get to witness for that testimony of the one Christ\nIf anybody was every waitin' for me to talk about another person my question would only be why\nIs there, anybody like Him?\nMakin', you give something that's already His\nBetter than pretty women, sinnin' for a minute\nLivin' for His glory cause my sins have been forgivin'\nSee I started college at age sixteen\nTurn eighteen with a college degree\nGo to any school in the state that I please\nAmerican dream, man that was so me\nCute wife who watches her calories\nBy the pool type, bangin' salaries\nGot saved, everybody got mad at me (I threw it all away)\nCause I went to Bible college for theology\nThey say livin' for Christ is to limit your life\nBut when did we start takin' sinners advice?\nShould we consult the dead on behalf of the livin'\nWhen they don't know what livin' is like?\nYou wanna pass the baton, with a faith that acts like the book after John\nRegenerated, graft indicated, debated and hated baby, but I never wanna waste my life\n\n[Outro: Cam]\nLife, life, life\nDon't wanna waste my life, life, life\nDon't wanna waste my life, life, life\nDon't wanna waste my, don't wanna waste my\nDon't wanna waste my life, life life\nDon't wanna waste my life, life life\nDon't wanna waste my life, life life\nDon't wanna waste my, don't wanna waste my\nDon't wanna waste my life"}], "artist": "KB"}