{"songs": [{"image": "https://images.genius.com/8acc2c921ff6defb4a5463597263ff0e.750x750x1.png", "title": "Cut it Out", "album": null, "year": null, "lyrics": "* originally slated for \"Brass Knuckles\"\n\n[Intro: Sean P]\n(P-I) Yeah, ay, whassup c-c-cuz?\nIt's goin down, Eastside, yeah\nYa boy Sean P, Nelly, Pimp C, ay\n\n[Pimp C]\nMy paint too wet bitch, never pay my set bitch\nBlue and red make green, just cash the check bitch\nWent to the car lot, bought me a Vanquish\nNever trick my money in the club with a skank bitch\nBig shrimp on my plate, look like dolphins (dolphins)\nPushin cookies in the soft ones\nI can do better by myself, not bad (bad)\nGirl ate the whole thing if she call me Chad (Chad)\nThe records ain't sellin up there, they mad (mad)\nRappin like us gotta hit but you a fag\nI'm a young country nigga, uncut like snow (snow)\nMake them young girls get down on the flo' (flo')\nMake them young niggas put candy on the 'Llac\nYou got clouds in them diamonds, take that monkey shit back\nCause I'm smokin out, throwin up, keep that lean off in my cup\nSmokin out, throwin up, keep that heat off in our truck\n\n[Hook: Nelly, Pimp C, Sean P]\nWhen I hit the parkin lot, and the fifth wheel drop\nYou know damn well (you don't wanna see me, all eyes on me!)\nWhen I'm fresh from the jeweler and it's sunny outside\nYou know damn well (you don't wanna see me, all eyes on me!)\nWhen I'm creased up, J'd up, E's and my K's up\nYou know damn well (you don't wanna see me, all eyes on me!)\nFrom all them niggas that's trill to them niggas unreal\nYou know damn well (you don't wanna see me) uh-uh\nSo quit it mayne (lil' boy) cut it out (look here)\nQuit it mayne (lil' boy) cut it out (look here)\nQuit it mayne (lil' boy) cut it out (now go 'head)\nNow watch my fingers (lil' boy) cut it out (hold up!)\n\n[Nelly]\nI ain't choose yo' chick, yo' chick chose me\nI ain't gotta pick one, I'mma take all these\nFor every hundred you got, I'mma peel off three\nHey, don't worry 'bout it lil' boy, that bill on me\nEight years now, you can call me a vet\nThat money you grossin, call that a fourth of my neck\nWe don't call paint shiny, we call paint wet\nA Darryl Strawberry colored Coupe, call that a Met\nGot a few rides already, got a few more to cop\nGot a blue one that's hard, got a black one that dropped\nGot a Buick that's green, the same color my snot\nLil' daddy you ain't the shit, you might as well get off the pot\nThat's some new St. Louis shit, yeah that's funny\nBut I'mma stick with the old, the new don't make enough money\nSo when I'm on (wipe me down) when they dirty (wipe 'em down)\nYou think I showed my ass befo', sit front row (and watch me now)\nCause my grandmomma hate it, but my lil' mama love it\nSaid my grandmomma hate it, but my lil' mama love it\n\n[Hook]\n\n[Sean P]\n28 inches sittin tall, it's ridiculous\nWith a slum yellow bitch cause that's the type I kick it with\nRide with a stupid pack, and a couple stupid cats\nThey call us the Goon Squad, so you know we stupid strapped\nShuttin down the parkin lot, we doin the moonwalk\nI ain't stuntin ass ho, cause I'm tryin to pillow talk\nI be where that work at, where niggas get murked at\nEarth is spread, then we mounted up and drop the purp' back\nCan't you tell I'm hood rich? You ain't from my hood bitch?\nDon't you see the leather seats? The way we grip the wood pimp?\nGoin hard on 'em (goin hard on 'em) rocks shined on 'em (rocks shined on 'em)\nSponsored by the hood, this is our grind money\nIf we pop the bands on 'em (pop a band) throwin grands on 'em (throwin grands)\nNelly grab the wheel and make the Chevy dance on 'em\nI'm a block star (block star) ain't a phony nigga (nah never)\nA phone call'll have them youngsters all on ya nigga\n\n[Nelly]\nSo don't start no shit, won't be no shit!\nDon't start no shit, won't be no shit, boy!\n\n[Hook]"}], "artist": "Nelly"}