{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "I Get Money (Remix)", "lyrics": "[Hook: 50 Cent]\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (Yeah)\nMoney, money I got, money, money I got (I run New York!)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (I, I get it)\nI, I get money, money I got (Yeah, yeah)\nMoney, money I got, money, money I got (I run New York!)\n\n[Verse 1: 50 Cent]\nI took quarter water sold it in bottles for 2 bucks\nCoca-Cola came and bought it for billions, what the fuck?\nHave a baby by me baby, be a millionaire\nI write the check before the baby comes, who the fuck cares?\nI'm stanky rich, I'mma die trying to spend this shit\nSouthsides' up in in this bitch\nYeah, I smell like the vault, I used to sell dope\nI did play the block, now I play on boats\nIn the south of France baby, Saint-Tropez\nGet a tan, I'm already black, rich, I'm already that\nGangsta, get a gat, hit a head in a hat\nCall that a river rat, shit, fuck the chitter chat\nThe baker, I bake the bread; the barber, I cut your head\nThe marksman, I spray the lead, blood clot, chop your leg\nDo not fuck with the kid, I get busy with the Sig\nI come where you live, ya dig?\n\n[Hook: Eminem]\nI, I get money, money I got (Yeah)\nI, I get money, money I got (Yeah)\nI, I get money, money I got (I Get It)\nMoney, money I got, money, money I got (I run this rap shit)\nI, I get money, money I got (Now guess who's back)\nI, I get money, money I got (You thought I left you)\nI, I get money, money I got (Now why would I do that)\nMoney, money I got, money, money I got (One, Two, Three)\n\n[Verse 2: Eminem]\nThey keep on sayin' the same rappers are the best\nJay-Z and Kanye West, maybe they're just tryna distract it\nFrom the fact that I'm comin' back\nOr maybe it's cause I ain't black, maybe it's because of that\nMaybe it's because I'm the highest sellin' artist in rap\nWhile I'm sittin' back in my office jackin' off to my plaques\nI'm still sick, how can I be sick this long\nAnd I'm still alive, Magic Johnson arise\nI thrive on makin' my opponents think that I've died\nThat's when I just pop up outta nowhere, oh yeah, there we go there\nDamn I forgot how much money he got\nOn the beach of St. Tropez, but your man don't lay\nIn the sun cause I don't tan, I burn, blood clot\nWhen you gonna learn how much money we've earned\nHow does it feel to know I came in this game at 25\nAnd coulda retired at 29 in my 20's still\nAnd Fif' here to lick on that Coca-Cola shit\nAnd he ain't even gotta look at coke to even hold a brick\nNo more, oh boy, goddamn did he score\nTo go from sellin' bags to bottles right out the store\nAnd Shady hit the box office man, he knocked the socks off us\nMy ex-wife is set for life, you profitless cocksuckers\nSo stay the fuck off us, we make pay\nI'm just a super easy modest MC, okay?\nTil I hear the word has been, that's when I start spazzin'\nSmart asses, kiss a smarter ass then\nI'm the best thing that ever happened to rap, bastards\nI'm a blonde Dre, now gimme Kanye's glasses!\n\n[Hook: 50 Cent]\n\n[Verse 3: 50 Cent]\nYou can call this my new shit, but it ain't new though\nI got rid of my old bitch, now I got new hoes\nFirst it was the Benzo, now I'm in the Enzo\nFerrari, I'm sorry, I keep blowing up\nThey call me the cake man, the strawberry shake man\nI spray the AR, make your whole clique break dance\nBackspin, head spin, flatline, you're dead then\n9 shells, Mac-10, \"who wanna get it cracking?\"\nI was young, I couldn't do good, now I can't do bad\nI ride, wreck the new Jag, I just buy the new Jag\nNow nigga why you mad? Oh, you can't do that?\nI'm so forgetful, they calling me cocky\nI come up out the jeweler, they calling me Rocky\nIt's the ice on my neck, man, the wrist and my left hand\nBling like bloaw, you like my style\nHa ha - I'm heading to the bank right now\n\n[Hook: 50 Cent]\n\n[Verse 4: 50 Cent]\nYeah, I talk the talk, and I walk the walk\nLike a Teflon Don, boy, I run New York\nWhen I come outta court, yeah, I pop the cork\nI keep it gangsta, I have ya outlined in chalk\nIn the hood if ya ask about me\nThey'll tell ya I'm about my bread\nRound the world if ya ask about me\nThey'll tell ya they love the kid\n\n[Outro: 50 Cent]\nWhoa, hey (I-I get it)\nWhoa, hey (I-I get it)\nWhoa, hey (Yeah)\nWhoa, hey (I run New York)\nWhoa, hey (I-I get it)\nWhoa, hey (I-I get it)\nWhoa, hey (Yeah, yeah)\nWhoa, hey (I run New York) whoa\nI get money, money I got\n(I'm back on the streets, man)\nI get money, money I got\n(I'm bringing the heat, man)\nI get money, money I got\n(I'm on my grind)\nMoney I got, money I got\n(Like all the time)\nI get money, money I got\n(Trying to stop my shine)\nI get money, money I got\n(I'll cock my 9, don't get outta line)\nMoney I got, money I got\n(I said don't get outta line\nI-I get it, I-I get it\nYeah, yeah)", "year": null}]}