{"songs": [{"year": null, "image": "https://images.genius.com/6da49ff0e6d6b69f4a78bfd5f4fc60ed.626x626x1.jpg", "title": "I Miss You", "album": null, "lyrics": "Bizzy Bone-(Sho Shot)-\n(I miss you) See this is Tru Life\n\n-Sho Shot-(Bizzy Bone)-\nI miss you, I miss you/ Yes, I do (For all my folks on lock) For my G's that are locked down, we're gonna lace it for you, yeah (Thug Luv)\n\n-Tru Life-\nYo' this heres to the homie P, dreggin' they chrome/ Hold your head, stay outta trouble and just to grow up/ I put it down with Bizzy Bone, so you know that it's on/ I miss y'all niggas to death, I put my heart in this song/ To make the biggest niggas drop tears way up in Attica, sittin' in they cells, doin' push-ups, I ain't mad at 'cha/ I'm tryin to get this money up to free ya Cuz and unite all of the thugs, Latin Kings, Crips, Bloods/ Hey yo' Blas, what up nigga? You's a wild-ass cat/ If I had a penny for every time you got knocked, I'd be rich, black/ It's time to come home, settle down, and switch that, and find a new life, and walk in the path of Allah/ Robert Jane and Mike Motorson, I really miss ya'll/ I really miss ya'll man\n\n-Sho Shot-(Tru Life)-Chorus-\nI miss you (I miss ya'll niggas baby) There's no other way to say it (Word to the mother man. I can't live without ya'll man) and I can't live without you/ I miss, I miss you (Ya'll niggas hurry up and get home, man. I need ya'll home man) For all my G.I.'s that's locked, we laced it (I love ya'll.) And I can't live without you\n\n-Bizzy Bone-\nShe tellin' me 'Ooh, what we gon' do?' Get out the county, my celly was yellin' so loudly/ The sky was so cloudy when I just made bail and I'm outtie/ But daddy was doped up, loc'd up on the police/ 138 snub and a drugged out thug, hopin' to detox, instillin' no love to be locked down/ Lookin' down these hilltops, drink Hennessey, feelin' my tears drop/ We're not cryin' cause we're dyin'/ We're cryin' we don't know who's next, but fear not/ Political prisoners and lil' niggas, ya'll all scared nigs/ Somebody start a riot, killas I came up with and dealers I know who stay quiet/ No letters, but big boxes, pictures of her naked, she's a fox/ Hope you like it/ Pass it around and get some contraband and set up your shop/ Set up your shop/ Set up your shop/ Set up your shop (Sellin' weed brownies and hooch) Clock some money, keep your cock to yourself, watch out for the haters, there's my lock down love/ Papa'll tell/ Papa'll tell/ Two Double-8 that Double-8 Zero/ We low key thuggin' Lil' Gambino, you know\n\n-Sho Shot-(Bizzy Bone)-Chorus-\nI miss you (Robert Ullyses Flores) There's no other way to say it (Timothy Combs. White Boi Roy, haha. Tai.) and I can't live without you/ I miss, I miss you (St. Clair. Homie keep thuggin' keep thuggin') For all my G.I.'s that's locked, we laced it (Locked down love) And I can't live without you\n\n-Tru Life-\nYo' every night before I go to bed I pray for my niggas that's locked down in maximum prisons doin' crazily years/ Like my cousin Jewel, who ain't touched the streets in years/ I miss him to death and can't wait till he touch ground/ Especially now that Joey Handz gave us a chance to tour across the land, get rich and cop Lex Lan's/ Damn, I wish you was home to help me blow my advance/ Soon as I get some real paper I'm a take care of your seeds/ Son, that's worked to achieve, you ain't got to worry/ I'm a hit you with about 20 G's in commersary/ Son, I know I haven't been there throughout your whole bid cause I was always broke, stressed out, depressed and shit, but I always thought about you and the things you did/ You was a wild nigga, probably the wildest in the crew/ But I bet if you could go back you wouldn't of bodied Duke if you knew pullin' that trigger was killin' yourself too/ And leavin' me and the world and the fam. just missin' you\n\n-Sho Shot-(Tru Life)-Chorus-\nI miss you (Word up Cuz. I miss you baby. I miss you man.) There's no other way to say it (I don't even know how to say it man) and I can't live without you/ I miss, I miss you (I miss all of ya'll that's locked up man. Blas, Raul, Mike all ya'll niggas man) For all my G.I.'s that's locked, we laced it (Word up, what's up baby?) And I can't live without you\n\n-Tru Life-Outro-\nTo all my motherfuckin' South Central niggas out there, in the Pen, somewhere, thinkin' about this shit here. (We miss ya'll baby.) I miss ya'll niggas man. My nigga Lil' GC, uh. You did about 18, time to come home nigga. Yeah. Rest in peace Duke, boi. (What up baby? Dig that.) Sick ass niggas baby. (We out.) I'm a get ya'll niggas. Uh. Tru Life. Sho Shot. Bizzy Bone. You know, mojo, ya heard me? Doja"}], "artist": "Bizzy Bone"}