{"songs": [{"image": "https://images.genius.com/02543f01dfa688d0e7de36632a1cd58b.1000x1000x1.jpg", "title": "Remember This", "album": "Perception", "year": "2017-10-06", "lyrics": "[Chorus]\nYeah, they say when we grow up\nYou'll understand when you're older\nGuess I'm still a kid, I don't know if\nIf I'll ever let go of this (Yeah)\nSay goodbye to the old me\nWe ain't friends anymore, you don't know me (Real music)\nI know I could die any moment\nIf I do just remember this\n\n[Verse 1]\nYeah, handouts create lazy people I'm not impressed with\nYou want something in life, then why don't you go and get it?\nActions speak louder than words do, it's pretty quiet, isn't it?\nLook at the world we live in, defined by comment sections (Whoa)\nSurround yourself with people that challenge how you think\nNot people that nod their head and act like they agree\nThose people will cut you open just to watch you bleed\nAlways be yourself, not the person that you pretend to be, no!\nThese people gon' tell you that you won't ever make it\nThen when you do, they gon' say they knew you were goin' places\nThat's just how it works, next thing you know you'll be overrated\nHearing people say they miss the \"old you,\" it's crazy, ain't it?\nAnd perfect people don't exist, so don't pretend to be one\nI don't need pats on the back from people for my achievements\nWhen I die I wanna know that I lived for a reason\nAnyone can take your life, but not what you believe in; no\n\n[Chorus]\nYeah, they say when we grow up\nYou'll understand when you're older\nGuess I'm still a kid, I don't know if\nIf I'll ever let go of this\nSay goodbye to the old me\nWe ain't friends anymore, you don't know me\nI know I could die any moment\nIf I do just remember this\n\n[Verse 2]\nYeah, don't take opinions from people that won't listen to yours\nIf money's where you find happiness, you'll always be poor\nIf you don't like the job you have, then what do you do it for?\nThe cure to pain isn't something you buy at liquor stores, nah\nThe real you is not defined by the size of your office\nThe real you is who you are when ain't nobody watchin'\nYou spend your whole life worried about what's in your wallet\nFor what? That money won't show up in your coffin, woo!\nYeah, anger's a liar, he ain't got no respect\nI fell in love with my pain and I slept with my regrets\nHappiness saw it happen, maybe that's why she up and left\nJoy called me a cheater, said she ain't coming back\nI've always had a problem with relationships\nBut that's what happens when you see the world through a broken lens\nMistakes can make you grow, that doesn't mean you're friends\nWho you are is up to you, don't leave it up to them, no\n\n[Chorus]\nYeah, they say when we grow up\nYou'll understand when you're older\nGuess I'm still a kid, I don't know if\nIf I'll ever let go of this\nSay goodbye to the old me\nWe ain't friends anymore, you don't know me\nI know I could die any moment\nIf I do just remember this\n\n[Verse 3]\nYeah, they say you got into music, you signed up to be hated\nThat's kinda weird 'cause I don't remember signing my name up\nComing from people that give advice but never take none\nI like my privacy, but, lately, I feel it's invaded\nI heard that life's too short, don't let it pass you by\nWe waste a lot of time crying over wasted time\nIt's not about what people think, it's how you feel inside\nMy biggest failures in life are knowing I never tried, woo!\nI look at the world from a different angle\nPeople change; even Satan used to be an angel\nThink twice before you're bitin' on the hand that made you\nDon't believe what you believe just 'cause that's how they raised you\nThink your own thoughts, don't let them do it for you\nSay you want a drink, don't wait for people to pour it on you\nCut out the liars, stay close to people you know are loyal\nGrab your own glass and fill it, don't let your fear destroy you, woo!"}], "artist": "NF"}