{"artist": "Problem", "songs": [{"album": null, "title": "All Year", "image": "https://images.genius.com/5b6aa3cbe96303b880f8d9fe5a0dee1f.300x300x1.jpg", "lyrics": "[Intro]\nThis that ball droppin' music boi!\nI like this tag comin up (Better check your resources)\nCause our shit good!\nWinter, Summer, Sprall, Fall, Whatever!\n\n[Chorus]\nWe gon' run thang all year, all year\nWe gon' run thang all year, all year\nFuck you talkin' bout it's y'all year? Y'all year?\nWe gon' run thang all year, all year\nWe gon' run thang all year, all year\nWe gon' run thang all year, all year\nWatchu talkin' bout it's y'all year? Y'all year?\nWe gon' run thang all year, all year al-all year\n\n[Verse 1]\nLet's get straight off the rip (Get it straight off the rip)\n\"Woo woo!\" to the Bloods talkin' [?] to Crips\nHunnit shots in the vip, and it leaves a hunnit more in the clip!\nThis that shit they [?]\nStill fuck a nigga bitch if I have to\nPut any nigga on the track bet I'll lap you\nPut some niggas on the map that i didn't have to\nAnd what for you lookin crazy I done slapped you\nBut nowadays I gotta choose what i react to\nCause gettin money is the only that move me gotcha boppin' my jacuzzi, want drama? No still got the lil' uzi (Yup!)\n\n[Chorus]\nWe gon' run thang all year, all year\nWe gon' run thang all year, all year\nFuck you talkin' bout it's y'all year? Y'all year?\nWe gon' run thang all year, all year\nWe gon' run thang all year, all year\nWe gon' run thang all year, all year\nWatchu talkin' bout it's y'all year? Y'all year?\nWe gon' run thang all year, all year al-all year\n\n[Verse 2]\nB Boy fresh every time you see him\nBad bitches, real niggas wait in line to see him\nIt ain't about being hot, it's who lasts the longest\nYou can be these niggas favorites, Whose cash the longest? (Mark!)\nCause the last time I muthafuckin checked\nMe and Bird just split another fuckin check\nRap nigga hate cause I'm a muthafuckin threat\nIn and out the booth I'll bring it to they muthafuckin neck! (Yeeeaah!)\nOn momma, and grannies too\nI let you niggas beat me, then my family through (But no!)\nThat ain't how my family do\nNow lemme show you how Cali move (Really)\n\n[Chorus]\nWe gon' run thang all year, all year (I mean really tho)\nWe gon' run thang all year, all year (Y'all done seen it)\nFuck you talkin' bout it's y'all year? Y'all year? (But y'all ain't seen it)\nWe gon' run thang all year, all year (Whaaat!)\nWe gon' run thang all year, all year\nWe gon' run thang all year, all year\nWatchu talkin' bout it's y'all year? Y'all year?\nWe gon' run thang all year, all year al-all year\n\n[Verse 3]\nChachi check the check, Chachi on the loose (Woo!)\nChachi on his tip, Chach don't want a truce\nChachi on the bread, Chachi on ya girl\nAlready got the city, Chachi want the world! (Whaaat!)\nChachi in the hood with no bodyguards (Facts!)\nChaster hit the hood in all kinda cars\nChachi put his dick in all kinda stars\nThen brought em to the hood where all the homies are! (Facts!)\nSo y'all gon' respect my name, y'all gon respect my game\nGet to the exit cause this is the Diamond Lane\nWith or without my big homies 'round\nStay on your side cause if not then its goin down\n\n[Chorus x2]\nWe gon' run thang all year, all year (I mean really tho)\nWe gon' run thang all year, all year (Y'all done seen it)\nFuck you talkin' bout it's y'all year? Y'all year? (But y'all ain't seen it)\nWe gon' run thang all year, all year (Whaaat!)\nWe gon' run thang all year, all year\nWe gon' run thang all year, all year\nWatchu talkin' bout it's y'all year? Y'all year?\nWe gon' run thang all year, all year al-all year", "year": "2017-01-20"}]}