{"artist": "Yung Ro", "songs": [{"album": "Welcome to Nobody Land", "image": "https://images.genius.com/a3621ce8171d94bca6d1e12de28ce669.389x389x1.jpg", "year": null, "lyrics": "[Yung Ro]\nAnd a one and a two and a three, nobody!\nWho fuckin' with us in this motherfucker, nobody!\nWe young and focused, determined and thick\nWe got our mind right money right, we running this bitch\nYung ro nobody, think about don't do it\nThis is not just music, cause look theres nothing to it\nHow I talk about my structure, how I punish motherfuckers\nPunchin' lines without no knuckles, cock back-\n\n[O.G. Ron C - Mixing]\n\n[Yung Ro]\nAnd a one and a two and a three, nobody!\nWho fuckin' with us in this motherfucker, nobody!\nWe young and focused, determined and thick\nWe got our mind right money right, we running this bitch\nYung ro nobody, think about don't do it\nThis is not just music, cause look theres nothing to it\nHow I talk about my structure, how I punish motherfuckers\nPunchin' lines without no knuckles, cock back blucka blucka\nGyeah, and I'm just getting started, but I'm struggling the hardest\nSo I'm hustling the hardest\nYou think I won't, but I can and would\nFuck a beat, mac say I can rap and make the wind sound good\nNow let me explain why I'm the hardest dog\nI never sleep, sometimes but hardly naw-\nNow let me explain why I'm the hardest dog\nI never sleep, sometimes but hardly naw-\nNow let me explain why I'm the hardest dog\nI never sleep, sometimes but hardly naw\nAnd I don't waste no time chilling with shawty gaw\nI go get this cash, and you go party girl\nI'm tryna rock some re-runs of marty mob\nBut boys playing games with me, oh lawdy lord\nMarcus pop that daddy, and just record it dog\nNow I'm seeing why Jigga laugh, nigga hawdy haw\nOther teams are nice, but nigga are's is hard\nWe spit it all, from pain, street shit, to cars and brauds\nPausin' star, homie focus just listen\nNow I'm about to teach and define Paid In Full edition\nTwo plus One, and later on another one\nPaul Wall, Koopa, Fifty and your's truly yung yung\nDumb dumb, boy! I'm in it to prove\nI race the clock and pass it up, every minute it move\nI'm that young nobody, with a venomous crew\nGet the mic hot make ?? C put a bent in the booth\nMe and Twin get high, and show you what menaces do\nThen you got Koopa to deal with, when we finished with you\nLil E put ten in a dude, he put ten and he cool\nHe a fag, a coward, a man who's feminin ooh\nAnd any of them dudes, that give me the clues\nThey fixing to move, I merk 'em on site (pow!) now give me a coo\nI'm skinny and rude, with a semi or two\nWith plenty of mood- swings, and I pity the fool\nLook I'm on remy and goose, the gin and the juice\nHenny and woo, stressed on the edge not friendly or cool\nSlow daddy! we finished with you\nCocky koopa invest flip cash, and spending it too\nWe got them swangers and vogues, but we spinning them too\nThe paint change color four times shine, and blending the tool\nLin is my new, protege on the nobody roster\nWe the hottest niggas out, and got a lot to offer\nYou got plex you better think boy, and pipe pipe dine\nFuck with Ro I play it cool, and wipe boys dine\nWon't hesitate to squeeze the hammer\n??? I pack and bake the powder, like arm and hammer\nI'm on this bammer weed, in my home in Atlanta\nPapperazzis and fast flashing when we on the camera\nBut on the channel, true you won't ever see me\nI reup remain focused, cut throat and flee\nI gotta payroll rotation, keep me mob style protected\nI got workers watching workers, mob style connected\nMe and Twin face to face, mob style reflected\nI got a lot of love for niggas mob style in Texas\nYung Ro nobody, you still ain't convinced\nMy arms folded hands shaking, and my eyes is squinched\nGyeah, you know who running the game\nPaid In Full, them waterboys, Nobody and Color Change\n\n[Slim Thug]\nBoss Hogg Outlawz\nI represent the Boss Hogg Outlaw gang\nWe one of the rawest clicks, that ever came in the game\nBesides the fame, me and my boys on these streets\nBest believe the truth spoke, when we on these beats\nAll that balling and ice, I really love that life\nWhen people see the boss, they say it must be nice\nTo have a house that price, drive a car that price\nI got four or five dimes, what I want with a wife\nI done seen enough green, to pay for both our dreams\nAnd done so much dirt, I can't afford to be clean\nI been all around the world, lived fantasies with girls\nGot everything I wanted, including diamonds and pearls\nIt's kind of scary, make a nigga wonder what's next\nIs it normal for one kid to be so blessed\nI'm impressed by what the lord gave me\nAnd I'm thankful because the lord saved me\nAnd he made me, the man I am\nSo maybe, that's why I am what I am\nSo why you other cats, trying to take my position\nIt's out of ya hands, man keep on wishing\nAsk around what the click running the north is\nAsk around who the mother fucking big boss is\nIt's like this, if ya hot ya hot\nBut on the other hand, if ya not ya not\nNigga\n\n[O.G. Ron C - Mixing]", "title": "Two of the Realest"}]}