{"artist": "Casey Veggies", "songs": [{"title": "Flyin High", "album": "Customized  Greatly Vol. 2", "year": null, "image": "https://images.genius.com/1a029e524a5e116fb4512ade4b883627.756x720x1.jpg", "lyrics": "[Sample]\n\n[Intro: Casey Veggies]\n\n[Verse 1: Casey Veggies]\nMy sneakers for 385 dreams\nGot me plotting on ways for making my cream\nI see through a nigga when he faking for the screens\nI'm realer than a pimp bout his [?]\nThey call me Young Veggies and I'm all about the green\nWhere the money at\nThese funny cats be talking about how they count stacks\nBut they be on the same shit, you don't speak my language\nIn my city I'm famous niggas know what the name is\nSay it for me, I don't pull a girl\nI put her on my team, she playing for me\nAnd hit the jumper\nI will take your girl then get her number\nThen ask her [?] because I really want her\nMan I'm on, one one or maybe two though\nEvery time I hit the spaceship, I be up on Pluto\nYeah, looking and learn something new yo\nI'm flying real high, I'm feeling [?]\nYeah, I'm flying high\n\n[Hook]\nFly high\nYeah, yeah, I fly high\nFlying high\n\n[Verse 2: Casey Veggies]\nFreshest niggas out there, or out here\nI don't fear no man in my city\nYou feel me my nigga that's where I live at\nI been here [?] one of the young and freshest in here\nI'm on the beach with my swimwear\nMy girl just chilling, she don't care about much\nI touch her and kiss her just to show them girls I'm with her\nThe same girls be texting me like \"Casey, are you with her?\"\nI'm like just stay up in your place\nBaby [?] in your face ain't what it's cracked up to be\nBut I know you love CV you know I can't do much\nI just do me, yeah do me and spit that new stuff\nThere's niggas in my hood on that blue, that's all they see that [?]\nWho us? [?] it up\nYou ain't see my face that much\nCause I'm bout that paper son, so I'm on the low\nJust grinding, just tryna make this one\nI call this shit flying high\n\n[Hook]\n\n[Interlude: Casey Veggies]\nAre you flying?\nAre you flying?\n\n[Verse 3: Casey Veggies]\nThe freshest in the world, I swear\nWhy you niggas hating man, there's girls in here\nI guess because when I walk in and all them girls stare\nAnd them girls shouting out \"The champion's here\" Yeah\nThe girls you want, I been had 'em\n[?] chick I pick 'em up and then I bag 'em\nAsk 'em \"Who is that? Yeah, yeah, who is that?\"\n[?] I spit them stupid raps\nRiding down the [?] with the roof topped back\nMan top that, niggas that be fronting [?]\nI ain't in the function man I ain't with that\nWith the homies and we counting them stacks\nShaded up with my girl on my lap\nSometime a girl don't even act like she need to\nIt's a well known but I ain't tripping though, we all know that\nPeople gon' do what they wanna do\nWanna do, wanna do, wanna do\nGone\n\n[Verse: BrandUn DeShay]\nMy boy Casey told me do a verse about making it\nBut I don't know much that, I'm used to taking it\nCause niggas never gave me shit, not even a chance\nFreshman year homecoming, girls ain't give me a dance\nBut I ain't giving a damn, see I can be selfish too\nI learn from the best, now give it a rest\nI hear y'all talking about your hopes and your dreams, how much it means\nMy nigga this ain't a game, ain't no shooting for teams\nI eat, sleep, and breathe this\nIt might as well be oxygen cause I need this\nBut all this stressing and bullshit I don't need this\nMore than a plane ticket to leave this\nBut [?] told me to somehow, someway\nWe gon' make it up out the hood someday\nFor me the road to success is more like a one way\nBut I'ma make a Ferrari out this Hyundai, I promise\nBrandUn DeShay"}]}