{"artist": "Cappadonna", "songs": [{"title": "Spit That G", "album": "The Sting", "year": "2002-03-12", "image": "https://images.genius.com/298d5b6c65bf8acac98842b49097e653.300x300x1.jpg", "lyrics": "[Cappadonna]\nUh-huh, ye-yeah, it's like this\nIf you got big dollars, Spit That G\nKnowwhatImean? If you got mad honies, Spit That G\nIf you gettin dough or whatever\nWhips, phats cars, new kicks, Spit That G\nThis is how we do it\nWord up, it's like this, check it out\nCheck it out, yo\n\n[Chorus: Cappadonna (all)]\nIf you got ladies (Spit That G)\nIf you got endo (Spit That G)\nIf you got currency (Spit That G)\nW.T.C. (Spit That G)\nSay Spit That G (Spit That G)\nSay Spit That G (Spit That G)\nMore sex and money make the world go round\nDumb Diddy snatch ya chick up, hit the floor now\n\n[Solomon Childs]\nWant money? I need bodyguards, as big as stiff worker, R.C\nMe mega-poverty, New York City, dollar signs prevail\nFive place love, exclusive, nine millimeters\nMy voice box run through tracks like wild cheetahs\nChampagne and catfish at the club, Geda's\nJanet Jackson figures, I'm on now\nGucci sweaters for all of my niggas\nCalm braided, chrome rims\nGhetto birds with pink Timb's\nA box of shells for the Cola for Kim's\nSponsored by the Clan, see\nPop more vanilla cherry than Luke Perry\nNow tell me this ain't the thug life\n\n[Hook 2X: Suga Bang Bang]\nTalkin bout the good life\nLivin in da ghetto, wild\n\n[12 O'Clock]\nWhat happened to the fist fights, the MC battles, nigga?\nSlingin newspapers on the Verrazano Narrow\nGettin off the fifth train on Carol to get wet\nSummertime sweat got me rockin short sets\nFrom the loaf tops, no socks, Hawaiian suits\nTied nicely with the wooden spoon for the scoop\nYoung girls playin double Dutch and hoola-hoops\nCap'n Crunch and Fruit Loops, camels and goose boots\nIt was the FUBU, the stripped Lee's, the Hoopty's\nFive dollar bag of weed's a real bag of weed\nA ki was at twenty g's, hurled one at dope fiends\nO.D., niggas throwin bricks at my click\nNow Giulianni got the state N.Y. locked like cuff\nBlack Bad Boys gettin rich like Puff\nThe Excursion truck need two spots on the parkin lot\nA stash box for the top, the lock\n\n[Prodical]\nBrook-nam, grace and charm, remain calm with chron's of Lebanon\nBlack man author, green Leprechaun from Lexington\nP. Sunn, I crack ya face with the gun\nSmack the taste outta ya dunn, ya fam's on the run\nNow y'all respect Sunn, shine all type direction\nHype discretion with the right connection, recitin lessons\nBut my wea-pon reign automatic projection\nBlow out ya reception, hose through ya reflection\nOld gold complexion, Sunn I'll swoll to perfection\nDid a fifteen, me and my team, supreme legends\nTwenty-one-two, I get that money with the Wu\nUp in the Cayman Islands, bitches sweeter than honey dew\n\n[Hook 4X]\n\n[Interlude: Prodical (Timbo King)]\nEh-yo, let's talk about it (Let's talk about it)\nEh-yo, we be about it, be about it\nYo, we be about it (Killa Beez)\nWe all about it, yo we all about it\nWe all about it, we be about it\nKilla Beez, yo we all about it\n\n[Timbo King]\nYo I slap money for the love of rap money\nRock gully, high cop that bag of bomb\nThis grown man talk, I could bag ya mom\nWatch and learn, block got lots of germ\nStraight like that, bake cake, ate like that\nLove to kill, I just hate like that\nYo these guns yap bodies on it, ain't nobody want it\nWide body six-hundred, brand new papers on it\nFront roast up, corner thugs roast up\nMix the black with green, watch me mack the scene\nAs a matter of fact, them caps gon' bang\nBrook-lawn pack those things, crack/cocaine\n\n[Chorus]\n\n[Hook 2X]"}]}