{"songs": [{"title": "Devil in Disguise", "album": "Church Clothes 2", "year": "2013-11-07", "image": "https://images.genius.com/dccansnhx7yt6kfhs6fgcadrb.540x540x1.png", "lyrics": "[Spoken Intro]\n\n[Verse 1: Lecrae]\nWhere am I going? What I'm living for?\nI rolled the dice on life so tell me what they getting for it\nI'm three shots in, probably depressed\nBut crying about my problems ain't gonna get me out this mess\nRide around playing Scarface, I'm a hard case\nI want to die, but I'm scared of looking in God's face\nPopping pills and powder, trying to kill some hours\nCause when I'm sober, man I promise I can feel the power\nOf death eating me slowly I'm on my way\nHeaven or Hell? Well that's only for God to say\nI lost some people but I never like to talk about it (nah)\nHard time, we go through 'em we don't walk around 'em\nI'm too mature to go listen to Black Hippy\nGet trippy, smoke on the sticky, and find a Britney that's pretty, naw\nI know that only pacifies my problem\nThere's something deep inside me and I can't seem to resolve it\nMy worst days, man I just want to revolver\nMy best days I'm blinded by all this fog, huh\nI'm in the ride looking mean, money in the jeans\nLadies all cling to the fabric like static\nBut in the end, you know it's all a bad habit\nStrangers on my Craftmatic, man we all some addicts\nPurpose junkies trying to find who we really are\nHypnotized by the rims on a pretty car\n\n[Hook: Kevin Ross]\nWhy?\nLord I know the truth, but I'm good in my lies\nIf loving this is wrong I don't want to be right\nIt keeps pulling me down, so I look to the clouds\nThere is the devil, the devil in disguise\n\n[Verse 2: Lecrae]\nThey brag about a million dollars like that's supposed to make us whole\nI know better, I seen Jay chase a hundred more\nIf he ain't satisfied with it, what's the point in running?\nJust sit here with a blunt and watch these rappers try to stunt\nAnd break necks for paychecks, if I ain't broke\nI'm still broken; tie a noose into this tightrope\nThen I walk and feel the hellfire on my heels\nBut I ain't hurt enough to heal, I don't want to kneel\nIf God's real, I believe he became a man\nOtherwise, ain't no other way to understand\nWhat it's like to be me\nWhat it's like to be an outcast tempted by all the devil's diseases\nSo if it pleases Him to rescue a fool\nI'll be drowning in a pool of liquor to keep cool\nSmoking a Kool, like the old heads do\nCall me Nat King Cole, like I'm gonna spread blue\nPain a pest, I been trying to smoke it out\nBut it never seems to die when I choke it out\nI try to drink it away but my stomach swell\nAnd what I'm drinking on earth, I'll probably throw up in Hell, well\nJesus they say You'll take away my cancer\nAccept the mess of a man that I am and give me answers (please)\nThey say You died for the selfishness that I'm pursuing\nBefore I head to my ruin, turn my eyes to you\nSix shots in and half past sober\nI pray when I wake up the darkness will be over\nGod, I'm six shots in, half past sober\nPray when I wake up the darkness will be over\n\n[Hook: Kevin Ross]\nWhy?\nLord I know the truth, but I'm good in my lies\nIf loving this is wrong I don't want to be right\nIt keeps pulling me down, so I look to the clouds\nThere is the devil, the devil in disguise"}], "artist": "Lecrae"}