{"artist": "Immortal Technique", "songs": [{"title": "Black Vikings", "lyrics": "[Skit from 'Planet Of The Apes']\nBeware the beast man, for he is the Devil's pawn. Alone among God's primates, he kills for sport or lust or greed. Yea, he will murder his brother to possess his brother's land. Let him not breed in great numbers, for he will make a desert of his home and yours. Shun him; drive him back into his jungle lair, for he is the harbinger of death\n\n[Poison Pen]\nYeah! Immortal Technique! SP the Ghost! Poison Pen! Vinnie Paz!\n\nWe gonna stomp em out, run them out, run them out, call your number out, send your uncle Ruckus out\nWe gonna stomp em out, run them out, run them out, nigga ain’t nothing civilized about no uncle ??? nigga, you feel me? Don’t bring no uncle ??? out nigga, fuck outta here\n\n[Immortal Technique]\nAll troops in formation? Let the siege commence!\n\n[Verse 1: Immortal Technique]\nBack like I was locked up, putting in work\nBurning through books like Nazi's in a Catholic church\nI'm cursed like Cain when he murdered his brother\nCut your face off and wear it while I'm fucking your mother\nI'm Mars Ultor, the avenger, the god of war\nAnd if you don't believe in me, I doubt you believe in God at all\nI breathe smokeless fire, the Jinn type\nThat'll make you hate the way that Allah made you to live life\nLike Hindu, niggas that be bleaching their skin white\nOther people's teeth in my hands after a fist fight\nI was born with a sixth sense and a swift right\nSkinned werewolves and rape demons at midnight\nSell your kids into slavery after we murder you\nOr sacrifice them in the same fire we burnin' you\nBarbarian funeral, nigga, you wanna know?\nDamn the river, bury me, and let the water flow\n\n[Hook: Poison Pen]\nChaos, mayhem, bang outs, slay them, uprise, rape them, raid them\nCage em, pandemonium, insurgent, death merchants, commit the best murder\nPillage, Kill them, erase history, make them a mystery\n\n[Verse 2: Styles P]\nCut the nose off, the ears off, the whole head\nImmortal and Ghost coming, code red\nYou never seen a black barbarian\nWarrior, warlord, pussy, cut your balls off\nMore bodies come, more bodies hauled off\nWhat you want the sword and get shit sawed off\nYour throat need an axe in it\nAnd I'm breaking your back because your spine needed a crack in it\nYou bugging me, I'm coming to fumigate\nThe Wolverine, the Sabretooth, the way that I mutilate\nI'm like the viking in Valhalla Rising\nExcept I got black skin and both of my eyes in\nDon't test him, please don't stress him\nHe'll hang you from a tree with your own intestines\nHow you wanna die? Make your own suggestion\nNow talk to the lord and make your own confession\n\n[Hook]\n\n[Verse 3: Vinnie Paz]\nYou pussies living in a movie theatre\nPut the motherfucking spell on you like brujeria\nChop his motherfucking head like a ruthless leader\nGuns drawn in a church service, shoot the preacher\nYou need to be godly to know Allah\nAin't no rappers eating around me, like a broken jaw\nIt ain't ever been a day that I ain't broke the law\nWhat you think I hold a motherfucking toaster for?\nI ain't going there, there's police in that room\nAnd Vinnie walk around with bags of dust like a vacuum\nBury you under the earth inside a black tomb\nMy body covered in Dashiki and stab wounds\nI'm a guerilla, barbarians is my ancestors\nThat's a part of my neurological transmitters\nWe Islamic and brought the story of shem with us (Al hamdu Allah!)\nWhile we brought the motherfucking blam blam with us\n\n[Hook]\n\n[Outro]\nThe walls have been breached! ANFALL!!!\nWe came in the name of peace and brotherhood, you wanted us bound in slavery, poisoned our water, changed our names...\nBurn their homes, take their jewels, skin them alive!\nHold on, hold on, hold on...\nNo one will know these people ever existed, and all that will be left is what we build upon their ruins...", "image": "https://images.genius.com/d17ee30cab427a6ea7fa3bfa64561580.400x400x1.jpg", "album": "The Martyr", "year": "2011-10-27"}]}