{"songs": [{"album": null, "image": "https://images.genius.com/c0c76671b93488acae20df28eae19f3d.1000x1000x1.jpg", "year": "2009-03-06", "title": "Transformers", "lyrics": "[Hook]\nYou can see the way I can I changed, new swag new talk new frame. Not who I used to be. Transformed now you should get used to me. X2\n\n[Lecrae]\nYea. A new swag new walk new focus. It's all Christ not me no boastin. And let me show you how to do this son, if you follow the old me you's a foolish one. Was a decepticon, or a decept and con. I get you for your last dollar then an extra one. Christ changed that you should spit change rep bout how I'm getting change, now I'm doin it to change cats. Folks see me and they like \"He a thug\" but I tellem look closer cuz I'm covered in His blood. I'm transformed I don't do that there, ya might see me in the street like \"Who that there?\" I walk in the spirit full of peace, full of love. Full of truth, full of Christ, payed the price with his blood. Now I'm all up in the word usta be up in the herb. I'm a F-A-N-A y'all know the word\n\n[HOOK]\n\n[Tedashii]\nYessir, I'm right back in my second home. Feel the.. tick tock like a metronome. Beat knock, is anybody home, transformed so homie lets get it on (get it on). Cuz man I ain't the sizame {same}, since the substitute took my place in the gizame {game}. Made me brand new and did it all in His nizame {name}. Claimed me on the altar to alter the way I thizank {think}. So baby what is do man this is really insane, a sinner in my crew till the lord did His thizang {thing}. Went from dark to light like mike without the pizane {pain}.You might think it's me be but lil homie know that it ain't. So please believe the old me, he dead. See in me to seek him instead. He's the king of kings so ever knee and head will need to heed and concede He's head\n\n[HOOK]\n\n[Trip Lee]\nOh yes, I used to live life all in the flesh, with J's and the cash what that's a mess. With clothes that I bought thought I was fresh, but I wasn't fresh at all, I was lost. Hollerin at them girls in the school house halls, tryina ball, ignorant to my flaws. Up until the Lord put all that on pause. Yes I blessed to fall at His cross. I, wasn't a dangerous cat, tryina aim things point blank range on cats, no sir, but still things was wack, man let me get some things off my chest like my chain was snatched, yea, I'm one of His kids you can be today, he covered any sin, we can flee away. Cling to his cross believe that He raised, see the truth, see the life, you can see the way (yea you can see the way)"}], "artist": "Tedashii"}