{"artist": "Phora", "songs": [{"album": "Yours Truly Forever", "title": "In My Eyez", "image": "https://images.genius.com/358d401afbd509d000a77d9819b74fe2.1000x1000x1.jpg", "lyrics": "[Verse 1]\nHe just wanna be recognized by the OGs\nAnd spray paint in the alleyway while he smokes weed\nMiddle finger up like, \"Fuck the judge and the police\"\nRunnin' through the streets late nights, so we don't sleep\nHe went to work, stashed his Glocks, said, \"Look out for the cops\"\nAll he ever knew was the streets, always out on the block\nAs he pours a little liquor for his homies to pass\nHe starts to wonder how long it'll last\nHe never pray to God 'cause he ain't get no answer\nAll he feels God did was give his grandma cancer\nOnly faith he had left was his Glock 9\nHustled on the corner, tag his name on the stop sign\nNo mercy for his enemies\nAgony and ecstasy\nThe only thing that ever made his heart warm was the Hennessy\nHe sipped from the bottom until the last drop\nAnd he says, \"Sorry mama, but I just can't stop, I can't stop,\" look\n\n[Verse 2]\nYeah, he ran the streets stuck in one time\nR.I.P. tat for his homie who just died\nHe done went to 16 funerals by 17\nOne his 18th birthday all he needed was one 9\nWith 20 in the clip, that's how you survive in the streets he was from\nOnly way to stay alive just tryna see 21\nFor his homies, he'd ride for 'em\nHis homies, he'd die for 'em\nAin't scared of death 'cause he knows eventualy it'll come\nFlowers and candles, filled a memorial on his street\nIn memory of his boy that got shot last week\nHe left behind two little girls\nHe had a family—they'd gather here every night in hopes that God might speak\nThe whole time he had—murder on his mind\nAll he thought was payback and loaded up his 9 and\nGot with his boys, and he hopped inside the whip\nWent to an enemy spot and started shootin' out the ride and\nIt's hard to say if it's wrong or right\nAnd now he's behind bars with a case to fight\n'Cause in the end, nobody wins\nNo matter what situation, it's never your job to take a life\n\n[Verse 3]\nI had to visit you 'cause your moms don't wanna see you this way\nI pray to God every night to fight your demons away\nI just feel like I'm losin' you, homie\nCan't you see what they doin'? They just usin' you, man, they foolin' you, homie\nThe streets don't love us, man, they never did\nAlways so worried 'bout death that we can't ever live\nSee, the streets got you brainwashed, they fuckin' with ya head\nThat's when he looked at me and said\n\"I lost my only two brothers to the streets that I rep\nBesides, my mom is the only fam I really got left\nThe only family I ever had\nThey treated me like a son, I ain't have a dad\nSee, the streets taught me loyalty, respect, and how to live by a code\nThey never taught me no different, this is all that I know\nEven though your pops was crazy and he wasn't always there\nEven though he made mistakes, homie, that motherfucker cares\nSee, I can't say the same about mine, homie\nReally I could give two fucks if he died, homie\nAfter the way that he beat my mother, he ain't never love us\nThat motherfucker's already dead in my eyes, homie\"\nI told him, \"A real man stands up on his own\nAnd doesn't need a fuckin' gang to have his back 'cause he's grown\nI know you think nobody cares, but man, that ain't true\nYour mom's already lost two men, she can't lose you\nYou think these cats would do the same for you?\nThink they'd take the blame for you?\nThink these motherfuckers would put they family through pain for you?\nWhere is your hood at when it's all said and done?\nYou ain't pull a trigger when that bullet shot from that gun\nTakin' the blame 'cause you don't wanna snitch, dog, is you dumb?\nTakin' care of your moms makes you gangster, not where you from\nDog, is you dumb?\nTakin' care of your moms makes you gangster, not where you from\"\nHe said, \"It's kill or be killed, understand that shit\nI got accessory to murder, dawg, they planned that shit\nHow dare you come visit me and act like you better\nMotherfucker, we from the same place, I can't stand that shit\nYou always preach God, but do you really believe in Him?\nIf we all sinners, man, what the fuck do we mean to Him?\nEither He don't exist or the Devil is beatin' Him\nWhen my grandma was down, where was God when she needed Him?\nYou can go your own way, but this the life for me\nDon't call, don't visit, and don't write to me\nWe all sin, you know better than the next man\nYou ain't God, you can't tell me what's wrong or right for me\nSome people meant to win, I was meant to fail\nSome people meant for Heaven, I was meant for Hell\nSome people meant to live and be free, but not me\nBeen in this system since 7, I was meant for jail\nI guess nobody is perfect\nTell my mama, I'm sorry, but there's no way to reverse it\nI guess nobody is perfect\nTell my mama, I'm sorry, but there's no way to reverse it...\"", "year": "2017-08-18"}]}