{"songs": [{"image": "https://images.genius.com/c1c26fb6b4aaff630fc88b2a63fa5a54.600x600x1.jpg", "album": null, "title": "Thiago Silva", "lyrics": "[Intro]\n1-6-6\n\n[Verse 1: Dave]\nSantan from the V-V x AJ\nMad mystic with the pen like J.K\nTrue say, I ain't really a drinker\nBut I got love for brandy like Ray J\nChampagne popper, .44 chopper\nIn the black Nike bomber, heartbeat stopper\nHalf-heart MC dropper\n.45 wapper, leave you in the states like Kaká\n\n[Verse 2: AJ Tracey]\nAJ from the l-l x Santan\nMan's got style on the riddim like Gangnam\nTwo young bruddas tryna eat off of music\nBut we used to eat off of pebs and the sand bags\nNow we get money, music money\nMoney that could put your girlfriend in a handbag\nWhite tee, Balenciagas, man bag\nLeft-winger with a long stick like a granddad\nAJ Tizzy from T-H-E lizzy\nAnd I'm all out for the Lizzy\nI don't wanna look like you, you're broke\nAnd I've been telling broke bruddas \"move\" like Grizzy\nStill brandy but the hand ting fizzy\nProbs be in bin if a man weren't busy\nI'm a mic king, I'm a king on the mic\nAnd I'll spin bruddas til the whole scene gets dizzy\n\n[Hook: Dave & AJ Tracey]\nWalk in the rave, smile on my face\nDrink in my cup, hand in my jeans\nMan talk tough, man look up, down, left, right\nStraight to a bang in the teeth\nMan still talk tough, man saw man in the flesh\nNow man's tryna talk to my Gs\nNah, none of that, none, .45 drum\nRun you right out of your street\nWalk in the dance, chicks wanna glance\nHand on my hip, shank for the dip\nIf I shout \"oi\", them man there best skip\nBetter tie up your laces tight and don't trip\nTrip, get splashed\nCouldn't care less about my man's gang\nWe're not fam, we're not friends or bredrins\nYou'll get tanned and binned, cock, then blam\n\n[Verse 3: Dave]\nSantan Dave from the Vale and Tracey\nDuck man down on the road, I'm pacey\nTwo lighties on the phone, so facety\nOne named Jordan and one named Stacey\nS with the S from the S, ask Showkey\nDust man down with a mask like Tobi\nTell a boy cotch, my man's telling me lots\nBut we are not Gs so don't watch my face\n\n[Verse 4: AJ Tracey]\nLadbroke Grove is where I re- who?\nMan get burst up in the G- who?\nCame back with a fresh one, it's new\nDon't come around for a two of the blue\nI don't give a fuck if you're old or new\nI'll just yawn like \"blackball who?\"\nPut a couple dead MCs in the grave\nTrust me, darg, you can go there too\nTrust me, darg, you can go there free\nI don't ever watch F-A-C-E\nAJT from MTP\nNikeLab tracksuit, Nike ID\nMan got overly fucked in the beef\nPretty sure I landed a bang to his teeth\nMan will get banged in the face by me\nNot my bredrin, banged in the face by me\n\n[Verse 5: Dave]\nAnd me\nMan talk tough, we'll see\nHit him with the left-right, left-right, left-right-right\nOne jab, then I duck, then weave\nCome like Trevor from GTA\nIf I bang man's face, man bop, then lean\nKun Aguero, man dropped the shoulder feint once\nQuick kick then I drop man's G\nFirst time I link her, Nando's, sweet\n£9.95, I swipe, then eat\nI one-two rap, she don't give hat\nThiago Silva, man block, then skeet\nHad man screaming \"look, there's my man\"\nHand in my pouch like \"where? It's not me\"\nHand in my pouch like \"where? It's not us\"\nTurned to my G like \"where? It's not we\"\nSo if you get boom with the .45 long\nIt's a critical hit, no chance to repeat\nAnd if you see Arge in the cut with the dip\nYou're pissed so quick your team should retreat\nBut if you see Juss in the cut with his right hand tucked\nYou're fucked, your team should leave, G\nIf you see Rapz in the back with his hand in the bag\nIt's mad, we came to see Ps\n\n[Hook: Dave & AJ Tracey]\nWalk in the rave, smile on my face\nDrink in my cup, hand in my jeans\nMan talk tough, man look up, down, left, right\nStraight to a bang in the teeth\nMan still talk tough, man saw man in the flesh\nNow man's tryna talk to my Gs\nNah, none of that, none, .45 drum\nRun you right out of your street\nWalk in the dance, chicks wanna glance\nHand on my hip, shank for the dip\nIf I shout \"oi\", them man there best skip\nBetter tie up your laces tight and don't trip\nTrip, get splashed\nCouldn't care less about my man's gang\nWe're not fam, we're not friends or bredrins\nYou'll get tanned and binned, cock, then blam\n\n(169)", "year": "2016-05-13"}], "artist": "Dave"}