{"songs": [{"image": "https://images.genius.com/89026ea1dc7518eef373c3891314768f.300x300x1.jpg", "year": null, "lyrics": "* Jewely, M.K., Penelope, Kujo, Mic Checker, Boogee Mann, Suga Chi\nKing Jacob, Iceberg, Foundation, Storm, West Stone, Goobee Thug & Fister\n\n(Intro: Ali)\nCheck it out, my name is Ali\nI roll with them Lunatics\nYou know us, know what I'm sayin'\nBut what you might not know\nIs we got a lot of MC's in St. Louis\nSo we gon' do it like this\nFirst up we got my man Jewely!!!\n\n(Jewely)\nNow what's a grand finale\nIf you ain't drinkin' grams in Cali? El Caminos on toners\nHotel Nico with Mona, weed from Pamona\nAnd any ghetto catch this St. Louis nigga on the corner\nMy persona known to leave rappers in a coma\nSo faggotts stop the grinnin', them chrome rims reflect\nThe hate in your face as you see em spinnin'\nMC's are screamin', \"No mo' shoutouts\" through nine innin's\nI'm drama, like two baby mommas and one pendin'\nThis here rapper split up your vest, cause the shit I'm packin' Dawg'll\nKnock your heart out your chest\nRappers suffer from cardiac arrest\nIf I'm uncomfortable I dump a few\nYou niggas are actin' like, I won't send em to the afterlife\nThis is Judah Zor, a hard act to follow\nMurderous clique nigga, known as desperado\n\n(Ali)\nUp next, Hillsdale representative\nMy nigga M.K.!!!\n\n(M.K.)\nYou knew what time it was soon as you stepped in the door\nBitches gigglin' and pointin', and whisperin', \"There he go!\"\nWhere he go? Me I be loungin' between the ice\nSippin' Don P with a dime piece right!\nWhisperin' in my ear about menage a trois\nUs and her partners, El Passe panties and bras\nFreaky deaky baby I'm lovin' that\nDig the way that you think, them your partners?\nGet them a drink, shit one bitch was strippin'\nCause she didn't get picked, but baby\nWe roll with time, it's only rippin' the six, trick\nMinutes later nigga rollin' four deep\nThem bitches tonguin' in the back\nI'm gettin' some head up in the frontseat\nShe like, \"I got this\" you control the cockpit\nWhile her partners in the back sixety-ninin' tradin' cock spit\n\n(Ali)\nUp next, we got that hazel-eyed heartthrob\nMiss Fo' Reel, Penelope!!!\n\n(Penelope)\nHot like fire, makin' these niggas yearn\nDon't be stressin' me dirty, you got shit to learn\nHow to keep these seven zeroes that's my only concern\nPut a torch to these hoes, make these bitches burn\nStern, as I handle my grit, talk mo' shit\nSpit, and let my fo-fo rip, so bitch don't slip\nDon't make me put a lump on your lip\nA dip in your hip, I'm snatchin' your shit\nI want it all so give me it\nAm I a Luna-chic? Uh huh, I'm a looney bitch\nMore deadly than the venom that some anacondas spit\nThe Marilyn Monroe, of the ghetto\nI'm a sucker for cornrows, niggas in Timbos hey\n(I got old Timbos mama, let me, let me, can I hit that?)\nOh Lord, look nigga (C'mon mama let me hit that)\nGet the fuck on out of my face talkin' all that\nOld silly ass bullshit\n\n(Ali)\nUp next, Kujo!!!\n\n(Kujo)\nNiggas hate me cause I'm nice in the game\nAnd got a style priceless like ice in the chain\nAiyyo so who am I? I'm the best to ever spit\nI got that, \"Hot Shit\" like I'm Nelly and the Tics\nI pop a hot block dodge the cops and the dics\nCause they want me gone, been in the game too long\nHere's how you want it, you come with guns nigga\nWe cock two, got work? I comp too\nBlock one, we pop two\nFor the love for my family, and my seed\nMakin' sure them records live on, from now until infinity\nI'm from the 34, live in 3D\nSouthsiiiiiiide, hot boy like I'm Figi\nSpit the truth til I die, give a fuck you niggas sick of me\nNo matter what the fuck you faggotts do\nYou can't get rid of me\n\n(Ali)\nPeace, to my cousin Trife, up next\nThe one and only Mic Checker!!!\n\n(Mic Checker)\nSt. Louis, what you know bout high-grade we wastin' it?\nWhat you know bout 76 pounds to break down in the basement?\nWhat you know bout chances enough Air Course\nSuitcases and pretty pictures out in Lambert Air Port?\nWhat you know bout losin' count cause there's so many stacks?\nHow many niggas can say shit like this\nBut there's truth in the tracks?\nWhat you know bout clicked up nigga? Out the country whilin'\nHow many you niggas done had pussy from the Virgin Islands?\nWhat you know bout your broad beggin' to be my mama?\nLunatics and Skunk dick player up in Trulany\nWhat you know bout mo' bail? We brolic like Brutis\nCome for them, everyday and my clique's all exclusive\nWhat you know bout Spanish Town? Amongst the gun clappers\nBuff they penis soup head still on my red snapper\n\n(Ali)\nOne love to PL-Spin\nNaw you know, up next Boogee Mann!!!\n\n(Boogee Mann)\nWell Mr. B-double-O-G what? M-A-double-N\nI smoke joke and grin, and fuck your best friend\nOnly if she a ten, then I slide right in\nBoogee and DJ Spin, be thunder and lightenin'\nDamn that's frightenin, so tuck your vest in\nMy lyrical Mack-10, spit flows that kill men\nIt's the Midwest y'all, we aimin' at all y'all\nWe the ball til we fall or it's nothin' at all\nSo just warm up the water, cause we Blink like Trotter\nHalf-baked half slaughter, comin' like Vince Carter\nHow you want it head or cut? We in the back of the truck\nTryin' to see if baby girl can make me bust this nut\nCause I'm 24 inches above the gun creek\nGet these hoes deep, so you pack yo heat\n\n(Ali)\nWhat up Spud? Up next representin' V.I.P\nKing Jacob and Suga Chi!!!\n\n(Suga Chi)\nMicrophones I burn bitches to whom it may concern with this\nGotta learn this is to all my foes\nThem baby mommas swervin' Neons and Geos\nCause they nigros to peep my steelo\nIn a ??? ready for war, suited and booted\nUndisputed dame, been the same, in the game\nSince my Tenants had fat laces, smack faces\nWith Tipsy (Ouch) intoxicated feel it bitch\nYou gettin' thrown out of clubs ever time you see me\n\n(King Jacob)\nUugh, everybody want to be street\nGuaranteed they bring the most heat\nAnd swear to God ain't nothin' sweet\nI agree, but I also feel I ain't got to prove shit\nTo do it to them punk ass niggas from your click\nI fuck hoes that be so thick, when I roll you know this\nAnd them twenty inch chrome rims sit so sick\nMotorola shit for communication, this is to aid my flows\nTake over the whole nation\n\n(Ali)\nIceberg!!!\n\n(Iceberg)\nIt's the nigga the player that keeps it duplicated\nOr faded in no type of way, hate it if you like\nBut you can't stop us gettin' paid\nUnless you sabotage the stage, or drop us in a place we stand\nAnd then you have to worry bout your whole state\nWe made it now the legacy's forever more\nStyle be forever raw, heaven or hell\nI'll stay forever S-T-L\nCatch me down down baby, in a black Humvee\nComin' to get my fuckin' corner back for Nelly, (E.I.!)\nMy fuckin' record sales were barely, (Uh Ohhhhhhhhh!)\nNow there's nothin' they can tell me\nWhat I do is always too late, for the Louie\nSee how you fools respond to these bomb frees\nBigger Big Lee released all these beats\nAnd everytime we do what's fuckin' million ???\nAnd come to answer their question of how come I-C-E-B-G\nGon become part of this Alumni nigga\n\n(Ali)\nAll the way from the Cle-Town we got my man E\nHella (Louie Town) Foundation!!!\n\n(Foundation)\nYou never met a four, better with metaphors\nMetal for whores, like Tiger's metal four\nShit, that's what I met her for, strictly city\nThick cliques mixed with Big Lee\nCan't disturb, stand clap hands dance and swerve\nFor the spot where nobody else should fix a hand or word\nE-Perior bless, since we all wreck mic checks\nYou guess me on, Midwest be songs, and testin' Jones\nF with the best be gone, no quest-ion\nSchool yard parties, fourty-four-four\nSeventy West and East, don't get it F in streets\nStyle shows like sandals, pumps get handled\nDismantled, St. Louis is Tony Soprano\nNo two, heffers with blow poor, ghetto mo' gurr\nBlow bolo get fooled around the clock\n\n(Ali)\nUp next, we got two live MC's\nMy man Storm and his home' West Stone\n\n(Storm)\nYou can't fuck with Storm, six niggas in the truck with Storm\nYou want to jack him, but you won't got no luck with Storm\nMy dirty run with dirty niggas and he from St. Lou\nPlus he know Kung-Fu, and he got guns too\nThat big dick dude, that flip kick fools like Tom Cruise\nYou don't wanna battle me dude you gon' lose\nHit you with one-two's, your lungs bruised\nMy foot in the butter so many crews call me doo-doo shoes\n\n(West Stone)\nYou know Stone is known to break them bones\nMeet your chick and take her home\nGet one chick and make her moan\nAnd you wonder why these niggas hate the Stone\nBroke their backs, when I wrote the raps\nNigga don't drink I'll smoke to that\nNiggas hopin' that, I'll take a bow\nWant to take my life? Better take it now\nI'm still alive let me break it down\nTurn this shit to the O.K. Corral\nGet to blastin', whippin' asses\nForget that talk shit, I'm with the action\nWant to make it hot? I'ma bring the heat\nAin't no nigga that can hang with me\n\n(Ali)\nUp next we got Goobee Thug\nThe rhyme spitter!!!\n\n(Goobee Thug)\nWe gon' get two seats recline and lean harder\nX, smoke green, and buy the spring water\nY'all niggas polish your jewels to bling harder\nI cock the fifth, y'all drop your shit\nType of nigga rob you to cop the whip\nCatch me, on 23's with a boxter-twist\nSee the rocks twinkle twinkle right in front of your eyes\nI shine brighter than the sun in the skies\nGot a gun on my waist, got one in your eye\nAnd I stays blowin' haze and that Chocolate Thai\nY'all smoke swag weed that's brown with seeds in it\nI hustle from first to first through seasons\nAnd you gotta accept this, I ball like the Celtics\nA. Walker, shake you up\nAnd I have Ted Foster to make you up\n\n(Ali)\nUp next from the Rawkus Crew\nMy homeboy Fister!!!\n\n(Fister)\nI'm the man before time, move hands before time\nLike Don Bluth I made The Land Before Time\nSome MC's think they're nice, but not hardly\nThat's what they \"Say Say Say\" like Paul McArtney\nAnd Michael Jackson, I cypher the action\nTo anyone who assists like John Packson\nWho these kids think they is tryin' to act all wild\nThey temporary like members of Destiny's Child\nI'm spottin' the top Feds, poppin' the hot lead\nAll in his pothead, makin' him drop dead\nCall me Shanksoon, lyrically snatchin' your soul\nYour squad's useless, like the right arm on Bob Dole\nBehold, the manifold of a black Aristotle\nRoadkillin' MC's, with my hand on the throttle\nSmashin' em all, mashin' em all, bashin' em all\nPicked up my Friday check cashin' em all", "title": "St. Louis Alumni", "album": "Heavy Starch"}], "artist": "Ali Jones"}