{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Movie Dialogue]\n\"Dr. Harrah, is Mr. Kane loose in this hospital?\"\n\"In the morgue I think, doctor.\"\n[Sigh] \"I specifically told Dr. Riley to suspend him!\"\n\n[Intro]\nAhh yeah\nWe gon' pump this up one time\nAs we set it off a little like this, kick it!\n\nPump it up now (it's a Big Daddy thing)\nAs we send this out to New York City\nCan't forget the posse down in Philly\nAlso in Detroit (it's a Big Daddy thing)\nChicago, Atlanta GA\nSendin' this out to Miami (it's a Big Daddy thing)\nTampa, can't forget Virginia and North Carolina\nL.A. and Oakland (it's a Big Daddy thing)\nAnd the rest of the world as we go a little somethin' like this\n(it's a Big Daddy thing)\n\n[Verse One]\nLet it rain, let it rain, to be put it pain\nWith nothin' to gain under the Wrath of Kane\nCause you can't maintain, I drained every brain\nTo leave a stain plain to remain in my lane\nOr path or road, until the next episode\nLet the B-I-G, D-A-double-D-Y explode\nJust like a bomb in Vietnam, so hit the alarm\nOr be funky like a underarm\nAnd allow me to show how the microphone should flow\nNow, competition bow, to me like a Buddha\nThe teacher, the tutor\nThey come a dime a dozen but the Kane look cuter\nAnd I ain't about that slouchin' or crabbin'\nSo save it -- cause that's one thing I ain't havin'\nBecause the purpose I serve is to please ya\nRhymes will ease ya, like Milk of Magnesia\nSo bust a pimp without a limp\nAnd I crush any wimp that would try to attempt to umm\nGet loose, now put a boost and used to chill\nThe comp to Kane, I picked Beetlejuice\n\n\"Big Daddy thing\" (2X)\n\n[Verse Two]\nI'm just that ruthless, to leave ya toothless\nCause you're useless, makin up excuses, excuses\nSo never touch, tap, tangle or tamper\nA fearless fly foe'll get slapped with a Pamper\nCause I can dig in your face like root canal\nBut I'mma chill, won't even dispute you now\nActin wild just ain't my style\nCause only the live will be movin the crowd but see\nQuiet as kept, not like a star to you\nBut I can roast an MC like a barbecue\nIn the Dead Zone, you shouldn't have left home\nSteppin' to the man, now get the head flown\nI bring the terror, horror, there's no tomorrow\nChild you shouldn't even bother\nTo press up, and get broken like a Lee nail\nSo let me school ya plus scoop your female\nJust like a jiggalo but I'm much bigger though\nI'm like a hitman, pullin the trigger slow\nAnd smooth to the groove with lyrics that soothe\nAnd improve with every move, that's why you've\nBeen enhanced by the mentally divine\nSo play football, and let's go the nine\nShorts I take none, cause I ain't the one\nIn '89 there's damage being done\nAnd for you to diss me, will be very risky\nCause I make this be, as strong as whiskey\nTo break and make my foes dispose and fall\nSo y'all can see how me the Kane will just reign\nSuperior, cause I ain't even hearin' ya\nSave the yang, cause it's a Big Daddy thang\n\n\"Big Daddy thing\" (4X, then cut and scratched to end)\n\n[Outro]\nAnd this one here goes out to my man Mad Money Murph\nCan't forget Big Sha, Big Therm\nAnd also I got to say whassup to my man Horace\nGot Nice and Smooth in the place to be\nMack Daddy Nick, know what I'm sayin?\nCan't forget my man Ant Live\nAnd of course the one and only Prince Paul, peace!", "image": "https://images.genius.com/e5112b31d8bd715b9e736175eff672d9.1000x1000x1.jpg", "year": "1989-09-19", "title": "It’s a Big Daddy Thing", "album": "It’s a Big Daddy Thing"}]}