{"artist": "Ant Banks", "songs": [{"title": "2 The Head", "image": "https://images.genius.com/992e30f2e51c18bd369b9f8badc632a5.772x768x1.jpg", "album": "Sittin’ On Somethin’ Phat", "lyrics": "For the funky beats I made I get for my grade\nI'm from the Dangerous Crew, I can't hang with you\nCause I'm from Oakland, bitch, where the game is true\nYou don't belive me? Well, come on slide through\nBecause the city of dope will give you somethin' to ride to\nPut my tape in your deck and do some damages\nBut the six by nines, they can't handle this\nI'm twenty-three so I'm far from a young buck\nThis gin and juice is gettin' me pumped up\nFake rappers get chumped up\nYou wanna slang'em, watch your face gettin' lamped up\nWell, what's my name? You can call me Banks for short\nYou wanna book me? You're about to see a gangsta show\nCause I be tighter than tight, give me a brew and the mic\nAnd it will be on like chickenbone, you know that's right\nSome mothafuckas didn't belive that I can do this shit\nKick some funky ass rhymes with some beats that hits\nNow I'm provin' them wrong but still suckas wanna clown\nBut you jealous mothafuckas ain't bringin' me down\nI kept faith in myself, that's what I had to do\nTo make it out here and stop fuckin' with you\nI'm 2 the head...\n\nYeah! Now all you fake niggas: get the fuck off my nuts!\n\nI got my shit rollin' so now I'm like a mack in town\nAnd when I'm ridin' through, the hoes be flaggin' me down\nI'm just a player kickin' funky shit with the Dangerous Clique\nAnd all these bitches, they out to get some famous dick\nBut I ain't trippin', girl, you can bring that ass on\nCause all this jockin' shit ain't guaranteed to last long\nBut while it's happenin' you know I'm straight lovin' it\nYou put your pussy in position and I'm pluggin' it\nBut if you're lookin' for a nigga with a touch of affection\nYou better take your ass to the love connection\nCause, ho, I ain't got no trust in you\nCause if another rapper comes you'll be fuckin' him too\nAnd that's real, save the love for ?????\nCause it's all about mackin' in 92\nOne love, I ain't goin' that far\nI'm better known as a gigolo rap star\nI like to fuck groupie bitches cause it's fun too\nAnd I never get played cause I'm young true\nHoes wanna be mine but that's a no no\nGet the fuck off my face, bitch, I'm 2 the head, ho\n\nNow for verse three, you know it never quits\nCause Ant Banks is in the house makin' hits\nAnd since I'm doin' this I gotta deal with jealous punks\nMad cause my shit like pumps in the trunks\nAnd when I'm ridin' I gotta roll strapped in my 500 Benz\nCause it's sittin' kinda phat, fake niggas smile on my face\nBut they ain't bold ones\nTrippin' out cause they ain't ridin' on gold ones\nI know you're envies, that's hell of dumb for me\nCause the shit I got, it didn't come for free\nLate nights at the studio bustin' my ass crack\nTryin' to make hits, man, but where was your ass at?\nProbably at the corner drinkin' Old E, slangin' D\nSee, you was sleepin', now everybody's know me\nI guess hard work pays and doin' nothin' is off\nLazy niggas like you were once fuckin' us off\nStop talkin' about me and get a J-O-B instead\nBitch ass nigga, I'm 2 the head...\n\nYeah and this goes out to all you shit talkin'\nBandwagon ridin' mothafuckas: get off...", "year": null}]}