{"artist": "The Game", "songs": [{"title": "All I Know (Q.B. 2 Compton)", "album": "Q.B. 2 Compton", "year": null, "image": "https://images.genius.com/fa91cff72cfd37fd6ea86da4dde45a21.300x300x1.jpg", "lyrics": "[Verse 1: The Game]\nLive now, die later, flood or clock the shit out of haters\nGot niggas tryin to \"Kiss the Game Goodbye\" like Jada\nGet your shit pushed back like Jada's CD\nI'll put your brains on that Kenwood TV\nSo you can see hell in 3D, it's right there dog\nAnd the Game behind the Desert is a nightmare dog\nIf it's pussy, I might share it dog, beef I'm right here dog\nI'm on the block, white Nike Airs on\nGucci check, Coogi sweat, they wanna know\nIf 22's on the truck, give me coochie yet\nBut I come through in the new GS with two, three tecs\nGot niggas Harlem Shakin like the new G. Dep\nTryin to read my whole script, but ain't seen the movie yet\nBetter have that Glock stuffed tonight\nI'm comin through with Young Noble, and we, gon', make, it\nA block bust tonight\n\n[Hook 2X: The Game]\nGetting American Money Easy, all I know\nThe Gangsta All Motherfuckers Envy, all my dough\nIt's a West coast knot, watch, let it bang out\nShots range out, for all the gangsta hangouts\n\n[The Game]\nLace your tips, polish your gators, we like odds in Vegas\nYou can't ball? Then it's probably the haters\nCan't breathe then it's probably the Desert, if you a gangsta or not\nI give a fuck dog, bullets is hot\nAnd every nigga gon' cry when he hit, the more pain\nThe more blood drain, he ain't survivin shit\nAnd your niggas ain't gon' ride for shit, they know\nIf they came through everybody in the X-5 is hit\nRed rag or blue rag, niggas die for this\nThe Game the reason all these niggas on that \"Cali Love\" shit\nCompton niggas get grimy too, pull you out of that 6\nFuck you up like one time'll do\nAnd I dare y'all to stop on the 'Shaw, and King Boulevard\nComin hard, Doogie Howser pullin bullets out your jaw\nTurn your round trip into a one-way ticket\nYou can visit, but you can not lie and kick it\n\n[Hook:]\n\n[Verse 3: Young Noble]\nAiyyo, we left a stain on your block, you came with a cop\nPointin fingers at them niggas, that kept shit hot\nNext to 'Pac, I'm the hottest thang out, homey we can bang out\nOutlaw air it out, box 'em in, square it out\nLearn about your whereabouts and we right there\nMe and Game have you left right there\nN-O-B-L-E, O-U-T-L-A-W-Z\nWe bubble with ease, and I double my cheese\nI got niggas out in Compton that'll find yo' ass\nI got niggas out in Jersey, that'll hide yo' ass\nFor a long time if you ever fuckin with mine\nIt's a thin line dog between the real and the fraud\nWe killin your squad, my homeboy still in the yard\nYou the type of motherfucker standin next to the God\nThe Game is deep, you motherfuckers ain't the streets\nYoung Noble and the homey Game flamin heat, c'mon\n\n[Hook:]"}]}