{"artist": "Pharrell Williams", "songs": [{"album": null, "title": "Happy (Remix)", "image": "https://images.genius.com/aa964e94a21e7b893801ed3a2bd389b8.1000x1000x1.jpg", "lyrics": "Verse 1 [J.ReaL Hip Hop]\n\nSomething about this morning got me up high/\nLike I'm up 3 stories floating & I'm not falling out the sky...I...might...just/\nTake a walk around the clouds, jump down, then say \"Hi!\"/\nHow are you? Can I just say that I feel like I feel off of the bedroom's right side...Um...I/\nDon't know what it is, or just what I did to get me on this level/\nBut I like it! I'm so excited! I might need to settle down a bit/\nNah, don't think that's happening captain! Put this down, I can't dream it! Beaming!/\nShining down, all around this town, I hope that you're seeing this! Greetings!/\nAnd I open with season's greetings! Oh, oh, I'm pleased to meet cha'!/\nHopeful & peaceful feelings! Swinging so low, I'm reaching ceilings!/\nAnd I'm solo, but we just chilling! Roll slow & keep it wheeling!/\nWe lending them some time, to keep it kosher & keep it le-git!/\nDon't know if I need a reason, but I fo' sho believe I'm winning!/\nAnd my whole home got season tickets, seen me get it, keep the vision/\nGreen & lemon, pink & lime & gold & silver, opal, yellow/\nFocused! Peeling back the colors of my mind & throw em' here/\nAnd there! And anywhere that I care to do it! I'ma share the love!/\nGive it up! Live it up! Living lush & wonderous!/\nWondering what's next, but no matter what it is, I'mma be on that job!/\nCause I'm down for a minute, and I'm really gonna feel it the minute I get inside of that vibe! Nah!/\nPut me up in that ride! Riiight! Turn me up on that dial! I'll...!/\nPut you on to my style! While, you hook me up with your wildside!/\nBlasting out that sound! Now, jump around in that crowd! Oww!/\nShowin' up & show out! Get a little bit hype then bounce around, bow!/\nSo what you wanna do now? It's always looking up, whenever we get down!/\nWatch me feet then watch my smile! Keep that head up, ain't no frowns!/\nThere's shadows or black clouds! No bad news around for miles!/\nIf you see some take em' out, on a date & meet the Mom!/\nAhh! I feel so the bomb! Blowing up, right on time!/\nAnd the stuff I pack inside, probably make you lose your mind!/\nAnd the new one you will find, hopefully, is just like mine!/\nThat's a whole different kind! Enjoying bliss & being kind! My!/\nHope that no one minds I remixed this instrumental/\nAnd I grabbed my pens & pencils and went mental just to give you something/\nThat can make you giggle, dance & jump & skip when you feel crappy!/\nIn conclusion, I'm J.ReaL & God is good! Feel happy!/\nBlue Monkey./\n\n\n[Bridge x2]\nBring me down\nCan’t nothing bring me down\nYour love is too high to bring me down\nCan’t nothing bring me down\nI said...\n\n\n[Hook x2]\nBecause I’m happy\nClap along if you feel like a room without a roof\nBecause I’m happy\nClap along if you feel like happiness is the truth\nBecause I’m happy\nClap along if you know what happiness is to you\nBecause I’m happy\nClap along if you feel like that’s what you wanna do", "year": "2013-11-25"}]}