{"artist": "Ice Cube", "songs": [{"title": "24 Mo’ Hours", "lyrics": "[Ice Cube]\nPut the whoop on 'em (Ice Cube, a.k.a. Don Mega)\nPut the whoop on 'em (a.k.a. Poppa Don)\nPut the whoop on 'em (a.k.a. the Big Fish)\nPut the whoop on 'em (a.k.a. Brainiac)\n\nKeep it gangsta y'all, Keep it gangsta (uh huh)\nKeep it gangsta y'all, Keep it gangsta (Keep it gangsta)\nKeep it gangsta y'all, Keep it gangsta (all my life)\nKeep it gangsta y'all, Keep it gangsta (all my life)\n\n[Verse 1: Ice Cube]\nEveryting is real on this concrete and steel\nNiggas peel your cap for a happy meal\nI got to deal with this wall of confusion, world of illusions\nWe ain't losin' playa (never), we's winnin'\nPlayin' every night when we sendin' paper chasing, grinin'\nWhile you still chasin' women 'round tables no lieutenants\nUse your own man grown, (hook it up)\nIt's Ice Cube and the family stone\nBreakin' bread every night in L.A\nAnd I pray, for one more day that's unate (check it)\nIt's 90 degrees no enemies in sight\nEven the Don gotta fall to his knees every night\n\n[Hook]\nCan I get 24 more hours (can I get get)\nWithout dealin' with these killers and these cowards (can I can can)\nI don't wanna lose, all I wanna do is win\nI fucked up today, can I try it again?\n\n[Verse 2: Ice Cube]\nI'm lovin' every breath like a cold sip of soda\nWhile I'm bankin' down these back streets, thanks for lookin' over\nDamn sure nice to know ya, fuck a four leaf clover\nAnd thanks for this range rover\nWe gets down with this underground gangsta shit\nPolitians and parents, always havin' a fit\nEverybody wanna know \"who you with?\" \"where you from?\"\nWhy you lookin' at me dumb?\nHere's a bullet cause you number one\nNobody knows, the fate of a platinum rap star (nobody knows)\nWe gotta wait until tommorow\n(yeah yeah)\nAnd I'm a nigga like you (yeah yeah)\nYou know I got the bar\n\n[Hook]\nCan I get 24 more hours (can I get get)\nWithout dealin' with these killers and these cowards (can I can can)\nI don't wanna loose, all I wanna do is win\nI fucked up today, can I try it again?\n\nPut the whoop on 'em (look to Allah)\nPut the whoop on 'em (pray to your God)\nPut the whoop on 'em (I look to Allah)\nPut the whoop on 'em (pray to your God)\n\n[Verse 3: Ice Cube]\nMister prosperity, these niggas wanna bury me\nYour bitch wanna marry me\nRollin' more than a cherokee\nDon't, I drive what I want, and what I ain't drivin' I don't want\nLet it be known (let it be known)\nPermits hit the conk in the reagal\nBut weez legal niggas dollars got bald eagles nigga\nYou can't undermine Mister Grime\nYou rappin' 'bout the same shit I rapped about in '89\nTryin' to be the new fiend (never), with raps complex\nThey love you one minute and they hate you the next\nPush my lex thru the california sunshine\nLook back on my life and say \"damn I've done fine\"\n(damn) (I've done fine)\nMister Ice Cube, I'm always on the grime\n(always, always)\nThe Don Mega Mega Don, Don Mega Mega Don\n\n[Hook]\nCan I get 24 more hours (can I get get)\nWithout dealin' with these killers and these cowards (can I can can)\nI don't wanna lose, all I wanna do is win\nI fucked up today, can I try it again?\n\nKeep it gangsta y'all, Keep it gangsta (keep it gangsta)\nKeep it gangsta y'all, Keep it gangsta (everybody)\nKeep it gangsta y'all, Keep it gangsta (Keep it gangsta)\nKeep it gangsta y'all, Keep it gangsta (all my life)\n\n[Outro]\nI know we can make it, I know that we can\nI know damn well that we can work it out\nI know we can make it, I know that we can\nI know damn well that we can work it out\nI know we can make it, I know that we can\nI know damn well that we can work it out\nI know we can make it, I know that we can\nI know damn well that we can work it out\n\nAnd we can work it out, we goan work it out\nMy niggas work it out, help us work it out", "image": "https://images.genius.com/b41b30150e61b258f8624ead118328fe.1000x1000x1.jpg", "album": "War & Peace Vol. 2 (The Peace Disc)", "year": "2000-03-21"}]}