{"artist": "Wrekonize", "songs": [{"lyrics": "HOW DAT SOUND FREESTYLE\n\nI got two tones for your head nod got some for the harder days\nStill sipping that egg nog leftover from the holidays\nSpoiled milk half sour feeling lazy couldn’t stack\nWhen it’s PC everything that’s the way these pussies act\nGot a gold plaque but it’s getting lonely\nNeed more for the epilogue\nYa’ll act real ya’ll should get a Tony\nI was not aware that I met the phonies\nHalf past on a second stogie\nCracked Scabs acting like you know me\nBlack flags fly up the pole-y\nBitch I’m your master of ceremony\nGot 50 more to complete the task\nAnd I’m spitting bars like I need a mask\nOh who I am if you need to ask?\nWell you can kiss my over achieving ass\nGot a strange crew that can all spit\nBreaking in like the locksmith\nTalk sick like we toxic\nAn leave hostiles up in the hospice\nI don’t need to do this i free for fun\nUsed to off the top back when we were young\nBut now when dudes are like \"wanna freestyle?\"\nI’d rather lay back and drink demons cum\nMusic business is steaming dung\nOn fire but Its dreamy huh?\nLooking back to where we begun\nI’ve earned everything that I’m redeeming bruh\nStep back pay homage\nWrek’s back to filet sonnets\nSimpletons go to pray on it\nI’m alt that Paganonmics\nI be switching the rhythms they know I been killing them\nRiding my jock and coming up off the rod like branch dividIans\nDon’t give a fuck about billions\nMoney is nothing but dividends\nLegacy’s all they remembering\nSo look at the circles you living in\nI look at mine it’s all go gotters\nPro fresh mic phone rockers\nHope hoppers globe trotters\nElite like Tech said when it comes to us Bar None\nWhile rookies out on the fleek beat\nAre having trouble penning a bar one\nGary Larson the far one Barry Bonds all star gun\nYou see how long I been rocking here\nY’all know where the fuck my hearts hung\n#WrekWednesdays have returned\n2 down I want 50 more\nWeek 2 pull cartridge out\nShut down Wrek's 64", "title": "How Dat Sound Freestyle", "year": "2019-01-09", "album": "#WrekWednesdays", "image": "https://images.genius.com/830413802cc7b1a2282d8b1cd51cff3a.1000x1000x1.jpg"}]}