{"artist": "Wrekonize", "songs": [{"lyrics": "[Verse 1: Wrekonize]\nIf I, believed in God I'd be praying to him now but\nThis life, seems odd and I can't put my finger on how but\nI've been walking all around looking off in the clouds with a flask in hand\nSipping on Jack 'til I cannot stand\nWhere the fuck am I? Goddamn it man\nShit. At peace with the past looking out into the future\nI know what I'm here for but damn it can happen just a little bit sooner\nI need to make more moves or, I need to work a bit harder\nDo things just a little bit smarter instead of being my own personal martyr\nTake another sip of the whiskey please\nAnd if you feel the need, um, we can even split these trees but\nShit, I ain't gone lie, I don't even smoke that much no more\nI get so annoyed that my throat gets sore\nI be looking back at me like \"why you toking for?\"\nBut I get so bored and I get so brave\nNeed a change of pace, um, please queue my altered state\nI wait? to the same windows some days it's the same old rain\nI look to the clouds and I say to myself man \"I don't think shit heres ever gone change\"\n\n[Hook]\nI know something about the pain, the suffering\nIt's the game, it's nothing\nNearly every single one of y'all are trying to end me\nThen just acting friendly\nOh I've had one too many\n\nBy the pain, the suffering\nIt's the same, it's nothing\nNearly every single one of y'all are trying to end me\nThen just acting friendly\nOh I've had one too many\n\n[Verse 2]\nDown one, down two, down three shit\nI don't even know who's down anymore\nSip crown spin round gimme raw shit\nA couple more and I'mma be down on the floor\nLooking round for a cure, shit what the hell happened to me?\nWell it musta been a drink right? But I know it wasn't actually\nGood thing to blame, I like to say that it maybe instigates\nAll the things that I know I get from fame\nBut I keep on drinking like it lifts the strain\nHey Jane, Make me king of a land with no problems\nCare free with an empty goblet , get us all away from these Goddamn goblins\nComin' out of my god damn closet\nSkeletons in boxes, I told these fools to lock it!\nIt's crazy cause I keep on waking up to the rain\nWondering when the shit gone change\n\n[Hook]", "title": "One Too Many", "year": null, "album": "The Rooftops Mixtape", "image": "https://images.genius.com/88e068903a4f33a883dd03382fcde905.700x700x1.jpg"}]}