{"artist": "The Game", "songs": [{"title": "100 Bars (The Funeral)", "album": "Let The Game Begin", "year": null, "image": "https://images.genius.com/61dff7c3fb23bde1cd8ec8438232e3c9.477x500x1.jpg", "lyrics": "[Intro]\nI'm baack... Haha! Niggas can't fuck with me, man\nNiggas is crazy, dog\nI run this underground rap shit, and the mainstream, nigga!\nI'ma do like Boo-Boo: diss niggas right when they fuckin' album come out... and kill 'em!\n\n[Verse 1]\nHear the breakdown, time to separate the men from the boys\nTake it straight to the bank; call it Christopher Lloyd\nCall it momma's little boy, or 50's little bitch\nThe Rotten Apple or the protégé of a snitch\nThe protégé of a bitch, nigga softer than a Tae Bo Kick\nYou Billy Blanks on them porno flicks\nWith no porno chicks, only porno dicks\nYou Ty Lattimore whore with them g-string drawers\nAnd so therefore, I declare war\nOutside violator, meet me at four\nYoung Buck, stay back; Banks, put this autograph\nA Jorge Posada glove on, and let's play catch!\n\n[Hook 1]\n(Gunshot) That's for your one platinum plaque\n(Gunshot) That's for the niggas ridin' in the back\n(Gunshot) Tryna reach for that shit on your lap\n(Gunshot) That's for your boss sayin' he write my raps (Gunshot) I'm a killa, Blackwall Gorilla\nThat pine-box sealer, G-Unit cap peeler\nI'm realer, 40 oz. spiller\n40 Glock killer, 40 Glocc killer!\n\n[Verse 2]\nAsk Spider, I be creepin’ and crawlin’\nSpinnin' webs around you niggas\nStackin' bread around you niggas\nEvery time you roll up, the feds around you niggas\nI used to watch everything I said around you niggas\nTwenty niggas on the squad, twenty niggas in the can\nThat's twenty witnesses, twenty niggas on the stand\nGoddamn, can someone tell them the street code?!\nThe Game is to be sold, and not to be told\nThis ain't Dre and Suge or Beans and Hov\nThis is one bullet, one head, and one lost soul\nWipe my fingerprints off\nAnd the gun is tossed in with the fishes\nLike Q in Juice, I'm comin' for Bishop\nI'm gunnin' for Bishop, I'm the king of this L.A. shit\nTell me, homie, is you Blood or Crip?\nIs you thug or bitch? ‘Cause the ese's say\nThey don't never see holmes runnin' around L.A\nFake-ass ghostwriter, get your lil' flow tighter\n'Fore I put you in the trunk of this fuckin' low-rider\nNigga, you ain't nothin' but Hittman in quicksand\nGot a deal, ‘cause you sucked a couple dicks, and\nTurned your back on Delany and Jimmy Henchman\nJust take this as a warning; don't flinch, man!\nWhere your rag? You from 1-9-0? No!\nYou know Pap, do you bang East Coast? No!\nHave you ever hopped 1-6-4? No!\nDo the hood feel your wack-ass flow? No!\nSo sit your lil' ass down somewhere\n'Fore I have them niggas sit yo' ass down somewhere\nIn the ground somewhere, outta town somewhere\nBreaking news: body has been found somewhere\nNow back to the video, look at these silly muh'fuckers\nY'all some silly muh'fuckers\n\"I say, hands up, shorty wanna kick it with me.\"\nGet that wack shit of BET\nTurn the channel, all Black Lambo, red and black flannel\nSpeakers in the trunk, with more humps than a camel\nMan, I'm sayin', I ain't playin', I'm sprayin'\nAny nigga in your clique that ever yelled that shit\n\n[Hook 2]\n(Gunshot) Muh'fucker, that's for Yayo and Buck\n(Gunshot) That's for Hot Rod promotional truck\n(Gunshot) That's for Kanye, and beefin' with Puff\n(Gunshot) Tell the nigga that's behind you to duck!\n(Gunshot) I'm a killa, Blackwall Gorilla\nAny clip filler, Mobb Deep cap peeler\nI'm realer, the hollow-tip driller\nThe rap Godzilla, the Lloyd Banks killer! (Gunshot)\n\n[Verse 3]\nIn the diablo, under the tent\nNigga, I'm about a dollar, what the fuck is 50 Cent?\nWhen Jay said it, I didn't know what it meant\nNow I understand, it's startin' to make sense\nNow the whole world know why I took the I out of G-Unit\nAnd replaced it with a mothafuckin' O\nRemember when you told me meet you on the top, nigga?\nCheck the soundscan, guess who on top, nigga!\nFake-ass king of New York, you need to stop, nigga\n‘Cause you not Big, not Nas, not Jigga\nTake your steroids, show me what you got, nigga!\nYou ain't had a bitch since Vivica Fox, nigga\nLast I heard, you sucking on cocks, nigga\nNobody know, ‘cause they don't see you on the blocks, nigga\n‘Cause you be in the precinct with the cops, nigga\nYour whole staff, with a badge and a Glock nigga\nMid-town Manhattan, tryna stop niggas\nOn the subway, chasing down shop-lifters\nAll in the streets, talking 'bout you shot niggas\nThen you in The New York Times, takin' cop pictures\nI exposed you niggas and put out \"Stop Snitchin'\"\nWhen the last time you seen him with some hot bitches?\nSee what he say when you ask him, \"Where the hot bitches?\"\nCheck the adam's apple, nigga, them is not bitches\nYou're reign on the top was shorter than the legs on a leprechaun; just bow down, nigga, accept the Don\nNobody wanna be a hero when the TEC is drawn\nThey're transformers, folding up, like decepticons\nNiggas bust like pipes when the pressure on\nSee that light flash when the Desert Eagle at your dome\nEvery rapper know, from now I'ma set the tone\nNiggas real hard body 'til they head is gone\nHere come them demons\n‘Cause they know that you dead and gone\nSome niggas just don't get it 'til you at the throne\n\n[Outro]\nNiggas can't fuck with me nigga! 100 Bars, nigga!\nI do 100 bars every mothafuckin' day of the week, nigga!\nThat's 700 bars a week, nigga!\nOn this fuckin' underground rap shit, nigga!\nI can't be fuckin' stopped—period, nigga!\nThe Game, nigga! West Coast Don, Black Wallstreet, nigga!\nI'm ready to get down when you ready to get down\nMothafuckas! I'm talkin' to all you niggas!\nI can't be faded, nigga! Niggas don't want it with me, nigga!\nIt's just me, mothafuckas! And I'm pissed off\nGot me all on the front of the motherfuckin' mixtape\nIn a fuckin' stripper outfit, nigga, with some G-string's on\nThat ain't me, mothafuckas! This is me, mothafuckas!\nYeah! Doctor's Advocate, in stores November 7th\nCop it when I drop it, nigga!\nG-G-G-G-G, G-G-G-G-G-G-Unot! (Gunshot)\nG-Unit is now officially over. You can mail back your CD's, apparel, headbands, G-Unit spinner replicas and G-Unit shoes to 1548 South Ardmore Drive, Los Angeles, California, 90743. Thank you, have a nice day!"}]}