{"artist": "Cam’ron", "songs": [{"title": "Got it For Cheap", "album": "Crime Pays", "year": "2009-05-12", "image": "https://images.genius.com/92496cfcc2e09bf599c5704239d3db57.1000x1000x1.jpg", "lyrics": "[Verse 1: Cam'ron]\nWe hit too many left turns to make it right\nMy black fist and a peace sign, I say goodnight\nBut I'ma stay the fight, laser light with you're a-alike\nHere's an order black: be a quarterback, take a hike\nHut one, hut two, hut three, your family tossed\nCalico, 81 to your chest: Randy Moss\n\"How much the candy cost?\" Then I'm explaining to folks:\n\"It's terrific, but be specific: the paint or the coke?\"\nI refrain from the hoax, lame, this game is a joke\nBut hit the hotline, got mine the Range to the Rover\nI move the work from New York to New England\nNew Hampshire, New London, New Jersey, New Zealand\nHop out like \"Who dealin'? Who slingin'?\"\nBrick looking like \"Who wheelin'? Who blingin'?\"\nThen I handle weed and tell 'em how my parents eat\nThey got the work, it don't work? Your money back, guaranteed\nBut I guarantee money with your money you'll be after me\nFuck it up? Huh, a disaster B\nCasualties actually, but I move casually\nYou're vulnerable, not a judge but call me your honorable\nGo head and vomit fool, bomb the unbombable\nWe beef like a farmer do, my jewelry is a carnival\nHeard the goddamn chain, it's like a ferris wheel\nYou fuckin' with Sosa, you won't find a better deal\n\n[Hook: Cam'ron & Skitzo]\nWhere you at? Who you with?\nGet your gat, hit a lick\nFlip a pack, flip a brick, man\n(And we got it for cheap)\nLouis hat, Louis kicks\nToolie strapped in the mix\nMooley move back cause\n(Yeah we got it for cheap!)\n(Yeah we got it for cheap!)\nYeah we got it for cheap!\n(Man we got it for cheap!)\nMan we got it for cheap!\n(Man we got it for cheap!)\nMan we got it for cheap!\n(Yeah we got it for cheap!)\nWe got it for cheap!\n\n[Verse 2: Cam'ron]\nI sold the jums and the rock, filled the guns to the top\n40th nigga, smoke a blunt with Barack\nPut your heart in your stomach, your lungs in your socks\nYour girl in my bed, your son on my block\nYeah, they stole my style trife, but this the jungle\nWelcome to the wild life, \"Damn you got a foul wife\"\nI picked her up from karaoke and pilate class\nShe like to deepthroat, me I call it lollygag\nY'all niggas probably fags, not a body cast, a body bag\nFuck his toe, leave his whole body tagged\nPrimo give me bricks, I give papi cash\nBurglars hit them licks, he'll let the shotty blast\nAt nine years old, ya'll was watchin' goof troops\nMe the only fifth grader with the troop suit\n20 years later, bitches boof it up in Gucc' shoes\nFor a month rent, a fly purse and some new boots\nYou out the loop lou, me I'm in the crew coupe\nTruck boat, tough coke, same color as Dove soap\nNiggas needin' favors, believe I'm major\nStraight out the hood, but you should see my neighbors\nYou say a hundred dollars, he say a piece of paper\nYeah we own our cars, you still leasin', hater?\n\n[Hook: Cam'ron & Skitzo]\nWhere you at? Who you with?\nGet your gat, hit a lick\nFlip a pack, flip a brick, man\n(And we got it for cheap)\nLouis hat, Louis kicks\nToolie strapped in the mix\nMooley move back cause\n(Yeah we got it for cheap!)\n(Yeah we got it for cheap!)\nYeah we got it for cheap!\n(Man we got it for cheap!)\nMan we got it for cheap!\n(Man we got it for cheap!)\nMan we got it for cheap!\n(Yeah we got it for cheap!)\nWe got it for cheap!"}]}