{"songs": [{"image": "https://images.genius.com/4e938672ba331b168f4f463f35fdd247.637x637x1.jpg", "year": "2000-12-12", "title": "Double Time", "album": "Restless", "lyrics": "[Verse 1]\nWatch me, watch me, bonafide hard copy\nHip-hop nazi dispose of the Liberace's\nExtra extra, enjoy the lecture\nFrom Hannibal Lector, now rewind selector\nBounce it bounce it, smoke by the ounces\nTan leather couches, niggas that own houses (yeah)\nTesting testing, treat you like a nigga\nLocked down for child molesting, I'll fuck you up punk (yeah)\nListen listen, never ass-kissing\nToo much ambition, I'm hotter than Hell's kitchen\nEnter enter, the rhyme inventor\nFront and center, bypass that ass like a sprinter\nGet it get it, custom fitted\nDedicated to Pun one of the best that did it, huh\nTerror terror, trial and error\nMaking my name reign supreme and live forever\n\n[Hook]\nKeep it movin movin, keep it goin goin\nKeep it movin movin, keep it goin goin\nKeep it movin movin, keep it goin goin\nKeep it movin movin, keep it goin goin\nIf y'all ain't giving a fuck\nLike Xzibit ain't giving a fuck then just throw your hands up\nDouble time, two times for me\nBring it live from the L.A.C., Mr. X to the Z\n\n[Verse 2]\nLiar liar, pants on fire\nI won't stop rockin 'til I retire\nGolden, golden, State dominate this\nDestroy the Matrix, that forever in the crate shit\nLight it, light it, please don't fight it\nYou're all invited, when we kick off the next riot (Welcome)\nBust it, bust it, get your crops dusted\nEverybody off of the bus that ain't fucking, now\nSpin it, spin it, all up in it\nFor sale, one female, slightly dented (yeah)\nNiggas niggas, political figures\nProblem givers, fuck all those that ain't wit us (heh)\nRebel, rebel, shouting at the devil\nMe and you faggot got some shit to settle, then\nKill 'em, kill 'em, let slugs fill 'em\nSmash through the club in Meoshe denim, yeah!\n\n[Hook]\n\n[Verse 3]\nDeadly deadly, bump this deadly medley\nIn whatever you rolling, even if it's stolen\nTaking, taking, your spot is the X man (YEAH!)\nThe heavy hand give a fuck about the next man\nDigital, digital, high tech respect\nWhile the rest regress, burn out like a cigarette\nBreak it, break it, stripped down naked\nTied up in a trunk on the way to Las Vegas (yeah)\nChoking, choking, you need to stop smoking\nMotherfuck on that! Blaze a sack!\nRolling, rolling, folding bank\nMy first show was in the motherfucking holding tank, c'mon\n\n[Hook]"}], "artist": "Xzibit"}