{"songs": [{"title": "Count Jug", "lyrics": "[Hook]\nCount Jug, Count Jug\nMake sure all your pockets full\nGet you sack right\nYou got kids, just make sure they good\nCount work, count work\nPut up your bond money first\nAnything can happen, so prepare yourself for the worst\nAnd Jug Jug Jug, young nigga keep Juggin'\nJug Jug Jug, this for my OG's still juggin'\n\n[Verse 1: Young Scooter]\nShit fucked up right now in every hood\nMy face hot in Edgewood and Kirkwood\nAin't worrying about this rap, they want me for them jug\nThe streets talking, they say they know the moves I pull\nWhite chalk shit I say the word they'll do it\nBut we don't want no problems all we do is jug\nJuggin' out them Section 8 houses in the hood\nI love all my niggas they make sure I'm good\nAnd I make sure they good\nWe all bosses, a couples losses, but no crosses\nYeah!\nI can't stop counting that money\nI gotta keep counting, keep juugin'\n\n[Hook]\n\n[Verse 2: Rocko]\nSelling gas, smoking weed [Jug]\nEverybody trying to pour up, buss a lean [Jug]\nCodeine promethazine [Jug]\nYou can keep that coke, something to drink that's all they need [Jug Jug]\nCash it out, Yeah count it up, [Work] Jug that right back count it up [Jug]\nATL we got them Falcon, favorite move, that green [Jug]\nLearned how to count when I was 3 before I learned to read [Jug]\nBefore you know it I was right, I took flight, in the city near you picking up a bag erry night [Jug]\nCounting all this cash watch me make the cake [Jug]\nThat's why we call it brag cuz we bake it just to make it\n\n[Hook]\n\n[Verse 3: Young Scooter]\nI know a OG 60 still getting to it\nMy uncle was born in the 50's and he still jug\nSo I respect the real OG's of every hood\nYoung niggas 15 juggin' getting to it\nThem '90 babies, Them '80 babies\nIn every state around the world right now they juggin' crazy\nI go hard 'bout my checks Scooter too impatient\nSmoking, Riding, in my head doing calculations\nThinking 'bout why the Feds keep on talking crazy\nCuz all the snitches saying jug and that word I made it\nCount Up!\nYeah young nigga keep working\nSalute all the real OG bosses\nYeah!\n\n[Hook]", "album": "Street Lottery 2", "year": "2014-01-01", "image": "https://images.genius.com/09560325477a0d5a74833ecc483c40cf.595x595x1.jpg"}], "artist": "Young Scooter"}