{"songs": [{"year": "2001-09-21", "image": "https://images.genius.com/3749c060f89eca4eb3dac2193a559a45.991x1000x1.jpg", "title": "At Your Convenience", "album": "Be Yo Self", "lyrics": "*phone rings*\n[Syke]: What's up baby?, what you doing?\n[Woman]: I'm just in the kitchen cooking you dinner\n[Syke]: Hey?, you know what?, I ain't even gon' be able to make it\n\t  I got to take care ah some business\n[Woman]: What, what the fuck is your problem?\n\t   I'm tired ah this shit, I can't believ this shit...\n\nVerse 1:\nI was so in love with you\nDid everything you want me too\nTry my best to turn away\nThe temptation got ya here today\nI really wanna let you go\nBut my mind and body's telling me no\nIt's at your convenience\nSo I spend all my time waiting on you\nIt's at your convenience\nSo I don't know what to do\n\nVerse 2: Big Syke\n\nBaby I'm bout my money and family and a woman that stands by me\nSo don't get upset when you can't find me\nDon't tie me down\nI'll come around when my business is through\nI know you had plans and things for us to do but maybe you\nThink I'd rather be someplace maxin'\nI'd rather be at your place relaxin'\nCan't be no everyday quality time playa\nI got bills and things to do so I'll see ya later\nWit you it's cool I'd be a fool not to get paid\nLay up under you and not pursue what needs to be made\nParlayin' ain't possible responsible for carryin' the weight\nWho you lookin' at when the bills late, oh wait\nWhat about the trip you wanna take to the Bahamas\nAin't gon' be no trip wid all this drama\nAsk your momma, about a man always around not wantin' nothing\nGot to separate to get something\nIt's at whose convenience?\n\nChorus:\n\nIt's at your convenience\nI spend all my time waiting on you\nIt's at your convenience\nAnd I don't know what to do\n(2x)\n\nVerse 3:\n\nMy girlfriends say I'm crazy\nFor wantin' to have your baby\nI tell 'em money's not the issue\nIt's all the time that I miss you\nI wanna know why ya friends come before me\nAll the free time you get you ignore me\nBreaking dates, you're always late\nYou're making my love turn into hate\nWhy does it have to be this way\nI thought it was forever and a day\nI want it all now\n\nVerse 4:\n\nSo much trouble in the world baby\nCan't nobody feel my pain\nThe strain and pressure in life you had to sacrifice sometime\nTo stay on point on a thin line\nFind the closest denominator to stay together\nWhatever choice may be, I'm ready for whatever\nCause I slept alone and been alone many a nights\nWid no woman, why we argue over petty fights?\nAlright I'm feelin' what ya sayin' okay\nRemember we did it in the Caddy on the highway\nMy way, I been used to for a long time\nSouls are hard to combine, it takes time\nMe and my homies have a bond and a plan\nI'm your man, it's just some things you don't understand\nCan we work it out and try to find a way?\nOr never let it out and go our separate ways?...\nI don't know, huh-huh, but I can handle it baby....\n\nChorus (2x)"}], "artist": "Big Syke"}