{"artist": "King T", "songs": [{"image": "https://images.genius.com/c723068047c0d910e1d247c3b27d3244.640x640x1.jpg", "title": "Take You Home", "year": null, "album": "At Your Own Risk", "lyrics": "( *yawns* )\nAh man\nSuckers bite my stuff, man\nCan't get no sleep, man\n\nYo, what's up, DJ Pooh?\nNice to see you back, man\nFor 1990, right?\nFinna do it up\nBut I want you to do somethin for me, Pooh\nYou could do me a favor right quick?\nW-won't you pump up the beat a little bit right here, come on, right here\n\nSuckers\nSuckers\n1990, y'all\nKing Tee back on the map\nAnd we gon' tear it up like this\nI wanna dedicate this song to all the L.A. rappers out there\nCheck it out\n\n(Don't turn away, I think you should listen) -- ] MC Lyte\n\nWell I'm the one for my treble, two for my bass\n3, 4, 5 just to stay on pace\nNow that I got your attention you'll be happy to know\nThat they call me Tee the King but King Tee's how it goes\nSo suckers, get your shit and get packed\nCatch the next boat out, supreme Tela's back\nAnd I'm funky once agaian, so run and tell a friend\nThey said I wouldn't last but I'll be here until it ends\nYo, I'm the king at being cool but get a load of this\nThey wanna label me best L.A. soloist\nI couldn't be like that, but then again I could\nCause half of you MC's ain't no good\nAnyway, hey, I got somethin to say\nDirected to every MC in L.A\nYou run up on the King - huh, how dumb\nYou knew from the beginning you shoulda brung a gun, son\nCause I be shootin the gift like it's a gift\nTake the punk, slide em up just like a spliff ( *inhales* )\nThen everything's cool and copastetic\nI wrote the book on being cool - oh, you read it?\nHow'd you like the part where I tell you how to walk\nThe kinda clothes to wear, the use of slang in your talk?\nNo need to look around cause there ain't no clone\nKing Tee came to take you home\nCome on\n\n(You can make it)\n(Don't turn away, I think you should listen)\n(You can make it)\n(Don't turn away, I think you should listen close)\nI came to take you home\n(You can make it)\n(You can make it)\n(Don't turn away, I think you should listen)\n(You can make it)\n(Don't turn away, I think you should listen)\n\nNow this tune right here allows you to get funky\nLiterally you can do what you want, see?\nI'm more like the pilot or the driver of the scene\nOr somethin that you usually dream\nYeah, I'm manufacturin the sickest metaphor\nLyrics you're not ready for\nHear it, I keep a steady score\nOf suckers and muthafuckas who like to suffer\nI wear big ropes in clusters\nAnd I execute, never wore a sexy suit\nI wear khakis with a t-shirt and hiking boots\nA rare fashion with the gangster touch\nBecause Ballys don't mix and turtlenecks suck\nBut hey, I be crashin, throw in a accent\nMaxin while I'm waxin the boots with passion\nHappens to be one of my favorite attractions\nThe name's King Tee, but the T's for taxin\nPhoney MC's, them sucker punks wanna riff\nJust because I wanna give the party a lift\nYou know, build your spirits expand your horizon\nThis particular production is mine's\nAnd E-Swift's, the DJ E-Swift to be exact\nHolds a hypnotizin scratch, make the others look wack\nSo look all you want cause there ain't no clone\nKing Tee came to take you home\nCome on\n\n(You can make it)\n(Don't turn away, I think you should listen)\n(You can make it)\n(Don't turn away, I think you should listen)\n(You can make it)\n(Don't turn away, I think you should listen close)\n(You can make it)\n(Don't turn away, I think you should listen)\n( *E-Swift cuts up* )\n(I think you should listen)\n(I think you should listen)\n(I think you should listen close)\n(Don't turn away, I think you should listen close)\n(Don't turn away)\n(Don't)"}]}