{"songs": [{"title": "F.I.L.A. (Forever I Love Atlanta)", "album": "The King of Crunk & BME Recordings Present: Lil’ Scrappy", "year": null, "image": "https://images.genius.com/6851a699ae4a0e7001aafbfb7d5bc40c.1000x1000x1.jpg", "lyrics": "[Intro: Lil' Jon (Lil' Scrappy)]\nYeah! Yeah! (I'm just BME)\nYeah! Yeah! (I'm just BME)\nThis ya boy Lil'Jon (I'm just BME)\nYeah! BME Click\nA lot of y'all niggas be talkin' 'bout Air Force Ones and shit (O-k-k-k)\nA lot of y'all niggas be talkin' 'bout Adidas and shit (O-k-k-k)\nBut me and my niggas we rock the mothafuckin FILAs (O-k-k-k)\nThats what we got on our feet (O-k-k-k)\nScrappy what's up?\n\n[Hook: Lil Scrappy (Lil Jon) 2x]\nForever I love Atlanta\nForever I love Atlanta (what!)\nForever I love Atlanta\nForever I love Atlanta (what!)\nForever I love Atlanta\nForever I love Atlanta (what!)\nForever I love Atlanta\nForever I love Atlanta (Fila nigga)\n\n[Verse 1]\nI'm a Grady baby, ATL\nAnd all my life the A been so crunk as hell\nYou don't wanna step too close or go too far\nCause where I'm from, shawdy, niggas a beat you down wit they car\nFila, Prada, from my head to my feet\nNiggas on the block with the rock they don't sleep\nMan, South Dekalb Mall be the crunkest shit\nOr you can roll through Buckhead and go fall on a bitch\nI'm a giant ass playa, I'll stomp on a hater\nI'mma pop this shit off from Zone 3 to Decatur\nWe can gon' back down to where my grandma stay\nDepending on the area you better watch what you say\nAnd I don't care if you over there lookin all crazy\nWhen I get locked up man them broads they wanna save me\nThis the home of the ass wit the biscuits in it\nAnd the Janes on the street charge mo' than a penny, A!\n\n[Hook 2x]\n\n[Verse 2]\nWhen it's grind time let my A shine\nWhen I'm bustin rhymes, smokin pounds\nMy blood seepin wit Georgia Wine\nAnd niggas don't love the A like I love the A\nI just love the way the A smell everyday\nA town to yo' town yeah this how it go\nSmokin dro' fuckin' hoes on the city road\nWhen I stomp that bastard I left him with a bruise\nGot Fila on my feet so it had to be a shoe\nI live for the A, I die for the A\nI ride for the A, so fuck what you say\nWhat you know about I-20 to 285\nGot a fine atlanta bitch givin head in the ride\nG's up, get yo cheese up, in the classroom crunk\nGot bidness 'bout my shit, so I stay super drunk\nRidin' downtown with a shot of tequila\nJon introduced me to the game, I'm hot like reefer\nA!\n\n[Hook 2x]\n\n[Verse 3]\nCarry the A on my back like a torture rack\nI'mma represent it if you scared to go handle that\nDrankin' on crunk, reminiscin' on crunk years\nIt's the city of crunk where I shed my tears\nThrowin the peace sign up then upside down\nA-town off the rip hell yeah I'm proud\nGet crunk all day we don't sleep at night\nAnd if you fight one shawdy then we all gon' fight\nDon't nobody get crunk in the club like us\nAnd if security trippin on pimpin we all gon' rush\nEven though other niggas think they hard\nAin't nan harder than Stone Mountain, I swear to God\nYeah y'all love our hoes, you love our gold\nMartin Luther King from the A, so I love my home\nWestside to Scottdale we all cut hammers\nYou can catch kids skippin in Underground Atlanta\nYeah\n\n[Hook 2x]"}], "artist": "Lil Scrappy"}