{"artist": "Warren G", "songs": [{"year": null, "lyrics": "[Hook: George Clinton]\nSpeed Dreamin'\nSnoozin' in the fast lane\nSpeed Dreamin'\nNow I'm in overdrive\nSpeed Dreamin'\nNappin' in cruise control\nTrying to get back to where I should have been by now\nCadillacs stand in the tree line\nI'm making them be like\nSwerving to the curb\nTires squealing, rubber peeling\nPull up to a halt\nBut then we're thinking someone ought\n[To talk in line the freeway of the mind?]\n\n[Warren G]\nI got funk for all yall from me to the bid dogs\nGet your asses up pass the blunt\nSmoke som', after this go and poke som'\n[Mista Grimm]\nUm, excuse me Warren I got something about substance abuse\nRoll a half ounce up jump in my shit\nHit a switch watch it bounce up (GOOD GRIEF)\nMeet me in the Elco with gold leaf (WHO)\nGrimm big pimpin' like Filmore Slim\n[Warren G]\nTilted brim Mista Grimm rollin' shotgun hop one\nDrop one, nigga hit 'em with the Bop Gun\n[Mista Grimm]\nYeah I got the chronic its ferocious\nYou can feel it in your bones like osteoporosis\nWest coast shit, Im grabbin my gonads\nAnd slangin' gangsta vocabs straight of the notepad\n[Warren G]\nAft the dope sack quote that gangsta funk\nWarren G, what y'all thought?\nBringing the funk\n\n[Hook (1/2)]\n\n[Mista Grimm]\nYou listening to G rhymes and I'm here to drop lines\nI got that funky fly shit that you wanna hear all the time\nAll in your system like menthol, yes y'all\nJust remove cd from package then install\nIn your stereo here you go\nNew material grand imperial\nEat your Mista Grimm cereal\nHit the floor whats rough rugged, twenty four karat nugget like the microphones I carry in my Gucci luggage\nI'm Thuggish Ruggish\nTo the bone marrow and soak in linen apparel talkin the double barrel\nBlack super hero rhymin'\nRappin sittin busting like its nothing still puffin' coughin chokin\nWild up in the fan's in Oakland floatin\nSwerving, taking the dirty version between Persians\nSippin burbon brand new Excursion\nMessage: Salt kills snails (Saaaaalt)\nNah playas its that West Covina rhyme sayer, yeah\n\n[Hook (order of lyrics switches)]\n\n[Warren G]\nMista G.R.I.M.M. we done dropped one\nWith my Uncle George we done lock one\nAtomic Dog, Knee Deep, in the fast lane\n[Mista Grimm]\nWith the 454 engine block burnin' rubber for a block\nPsycho like a Hictchcock flick\nTrick, sinister thoughts streamin' while let'n out shots adrenaline pumpin'\nG Dub say somethin'\n[Warren G]\nSupercalifragilocus you could quote this off that purple\nYou can blow this\nLight up pass it around\nWe make the world go round like the G Funk sound\n[Mista Grimm]\nI keep the pedal to the medal\nSpeed dreamin', slidin', dip n glidin'\nChocolate Thai high\nCome on, jump in, let's ride, hop in the Mothership\nAnd dip with Mista Grimm and Warren G\nWe got that shiznit\n\n[Hook (1/2)]\n\n[George Clinton]\nHeres to that someone who can't take the pressure\nMercy for that poor fool who made the news\nWho feel pissed on that insist on killing all men\nCan't take the sorrow of the horrors of his abuse\nIt ain't worth the sorrows to cause the death ......all men\nHe's a disgrace to the species in to his face with some feces\nBig nose mothafucka got it comin'\nHow many licks does it take to get to the center of a sucker?\nHow late do you have to be before you get absent?\nWarren G with the P you beta step aside, I'll stick my foot so far up in your ass\nThe water his knee will rise above your head and drown before you get your ass kickin'\nStop stepin' in footsteps hard to keep up with\nWarren G stepin' hard but it ain't as hard as it gon' get", "image": "https://images.genius.com/0b2cb81a248357890a0f837ed5dc331a.1000x985x1.jpg", "album": "Return of the Regulator", "title": "Speed Dreamin’"}]}