{"songs": [{"year": "1993-06-02", "image": "https://images.genius.com/9703d795ec6c8c350b9674639f3fa5b8.500x500x1.jpg", "title": "Let Me Turn You On", "album": "All Samples Cleared", "lyrics": "[Biz Markie]\nEverybody just clap your hands {\"no stoppin\"}\nUptown {\"no stoppin\"}\nBrooklyn {\"no stoppin\"}\nQueens {\"no stoppin\"}\nThe Bronx {\"no stoppin\"}\nLong Island {\"no stoppin\"}\nNew Jersey {\"no stoppin, say no stoppin\"}\nYo V, bring it in\nAight, this this a special dedication\nTo my man DJ Hollywood\nBecause he was one of the first ones out there\nAnd I-I-I'd like I'd like to sing a little song\nA little something like this\nTo all the ladies out there, this goes out to you now\nCheck it out\n\n[Verse One: Biz singing]\nOoooh, whoa-whoa\nNo wayyyyyyyyy, no wayyyyyyyy\nFor you to stop me now\nI'm the kind of guy that could really turn you on\nGive you so much lovin, and treat you on\nJust hold me close and hold me tight\nAnd let's make love tonight\nAnd I swear to you baby, I'll treat you right\nIf you're the kind of girl that I've been lookin for\nBe real good to me baby, let me be adored\nI don't stop the way I'm feelin\nJust keep on turnin me on\nAnd I swear to you baby, I'll love you all night long\n\n[Interlude One]\nSomebody say well (well) - WELLLLL! (WELLLLL!)\nThere ain't no way to stop me now, come on\nLet me here you say welll (welll) - oh well (oh well)\nWELLLLLLL-LLLLLLLL-LLLLLLL\n\n[Verse Two: Biz singing]\nDid you ever see a girl, and thought she didn't care\nDid you ever feel like cryin, and think you'd get nowhere\nDid you ever see her comin, when the lights were down below\nDid you ever whisper GOD I LOVE HER, but how much you never know\nDid you ever look into her eyes and see a little prayer\nCould you sew a spot, flow to her heart\nAnd think that you were there?\nDid you ever wonder where she is, or wonder if she's true?\nOne day you'll be happy\nBut that next day you'll be blue\n\n[Chorus]\nThat's why I say well (well) - it feels so good to me\nWELLLLL (WELLLLL) - you know just how to set me FREEEEEEE\nSay LET ME LET ME LET ME LET ME\nLET ME LET ME TURN YOU ON, ooooooooohhhhh\n\nWhenever I see her face (where you goin brotherman?)\nI take a trip to a beautiful plaaaaaaaaace\nSay LET ME LET ME LET ME LET ME\nLET ME LET ME TURN YOU ON, ooooooooohhhhh\n\n[Interlude Two]\nWhenever we're up close\nIt's your perfume I love the mooooooooooost\nSay LET ME LET ME LET ME LET ME\nLET ME LET ME TURN YOU ON, ooooooooohhhhh\n\n[Verse Three: Biz singing]\nWhen all the other fellas try to run that game on you\nI wanna show you baby a love that's true\nA love that's good, and a love that's fine\nSomethin to blow your mind\nTalkin bout a love of the freakiest kind\nBecause you got eyes like a-water\nLips so rosey red\nEverytime I see you really turns my head\nAnd I'm the kind of guy, that love you all for me\nAnd everybody know my name is (BIZ-MAR-KIE)\n\n[Chorus]\n\n[Biz singing]\nSay, well, WELLLLLLLLLLLL\nWell, well well welll\nWell, well, well!\nLet me let me turn you on, ooooooooohhhhh\nLet me.. let me turn you on\nPlease baby, let me turn you on\nWelll welll welll welll welll welll\nLet me let me turn you on, ooooooooohhhhh\nYeah, yeahhhhh\nYeah, yeah yeah yeah\nPleeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeease\nLet me let me turn you on, ooooooooohhhhh"}], "artist": "Biz Markie"}