{"artist": "Vast Aire", "songs": [{"title": "The Dynamic Duo", "year": null, "lyrics": "(Intro)\nHoly vanilla blunts it's Vast-Man\nThe Jokers kidnapped Hip-Hop\nWhat's you gon' do?\n\n(Hook) Vast Aire\nNigga please, you is sucka emcee\nI'm VAST-MAAAAN\nMe and my crew is running the streets fo'real\nVAST-MAAAAN\nHip-Hop is Dead it looks like a job for...\nVAST-MAAAAN\nLXG is the family and I'm...\nVAST-MAAAAN\n\n[Geechi Suede]\nRemember in Nikes to the Batmobiles\nWe burning with the gamma ray lasers, electric eels\nCaped Crusaders falling from off glaciers\nLanding under water then shooting micro-lasers\nAll we do is make the facility melt\nNumber one villian that's felt\nPull up the utility belt\nIt went - *boom-blam-zoom-zap*\nCrash the canvas with the cobras hissing at the bottom of my straps\nLeap buildings, fly flying saucers\nDissolving inside the forrest when the radar lost us\nTorpedo glare thru the Vast Aire\nWith the cashmere, cat burglar blast from last year\nSuper hero DeNiro, Beretta Bronson\nKeep Wonder Woman on her knees getting Johnson\nVaporize them costume kit and disguise\nI'mma have to detach 'em from life with the shake equalizer\n\n(Hook) Vast Aire\n\n[Vast Aire]\nLife's a card game of the illest poker\nAnd I ain't gonna fold until I get the Joker\nA Dark Knight like Bram Stoker\nAnd when I see the Catwoman, I'mma stroke her\nAnd tell Super Boy he's a super toy\nI'm Theodore Wayne - the real McCoy\nIt's a bird, it's a plane!\nNo it's Lois Lane giving me brains\nShe game to Gotham to write a story\nI told her 'Put the pen down, show me the panties'\nPeter Parker can't do shit to me\nI'm Vast Man with a capital V\nBut to my avail there was Vicki Vale\nTryna seduce me\nDoing the Vast twosie\nI told her to slow down\nShe wanted to sleep like a bat - upside down\nWell, I can arrange that\nAnd that's when the Riddler started to clown\nHe was like 'It's my time'\nBut the crowd didn't know I co-wrote his rhymes\nThe Green Hornet is always smoking me out\nBut I keep my space cuz he's a Two-Face\nI'm smacking the Penguin when he gets greedy\nJust flash LXG when you need me\n\n(Hook) Vast Aire\n\n(Outro)\nWill the Dynamic Duo triumph over the Jokers evil\nWill Cat Woman finally give Vast-Man the panties?\nStay tuned, same Vast time, same Vast channel", "album": "Dueces Wild", "image": "https://images.genius.com/eb42f00f56a165e0e57e8f51a829caad.536x536x1.jpg"}]}