{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "Bad Night", "lyrics": "[Intro: Kanye West]\nAyy, uh\n\n[Chorus: Kanye West]\nSomebody\nGotta be the bad guy\nI had a bad day at work\nDon't wanna have a bad night, ayy\n\n[Verse 1: Tyga]\nWoo! Told my wife I need a threesome\nWoo! Be out all night until three somethin'\nWoo! Yeezus Christ, I need three nuns\nWoo! They gon' suck me off like a Capri-Sun\nHaan? You see this coat? Mothafucka ask where I got the fleece from\nLookin' for the competition, I don't see none\nThey tell me be humble, tell 'em be somethin'\nMy two balls make her bust three nuts\nDrink it out the bottle then I poured it on her D-cups (haan)\nBall so hard, went D1\nJumped over the Jumpman, just stumped the tree stump (woo)\nBreakfast at the SOHO, give her FOMO like a mofo\nOoh, say she want gold, though what would she do for some logos?\nBlack girl want me for my Benz\nWhite girl want me for my skin\nYeezy Season resurrected again\nWho you with when it's me verse them, haan?\n\n[Chorus: Kanye West]\nSomebody\nGotta be the bad guy\nI had a bad day at work\nDon't wanna have a bad night, ayy\n\n[Refrain: Young Thug & Kanye West]\nI ain't new to this shit, fuck-nigga\nI'm trappin' from the other side\nSo get outta your seat, stand up (wooooo!)\nStand up\nA fuck-nigga hate me while his old lady participate\nPlease tell that lil' nigga man up (lil' nigga, stand up, woo)\nStand up (lil' nigga, stand up)\nStand up (hey, hey)\nHey, hey, stand up, stand up, stand up\n\n[Verse 2: Young Thug]\nFirst of all, let me tell you somethin' (what?)\nI don't give no fuck 'bout no niggas (woo)\nI don't give no fuck, I'm not givin' two fucks (woah)\nRoll up and pop one of these niggas (blat)\nI do this shit for my woadies (woo)\nYou do this shit for your shorty, you bitch\nShut the fuck nigga, fresh out of the bottle\n[?]\nI'ma watch the nigga nose shatter like a picture\nI'ma fuck his ho like [?] missile\nI'ma keep a whole lotta lead for these pistols (what?)\nAnd my money long like the nose on a [?]\nBut she a [?], she write, no pen\nBut you know I'm gon' suspend her\n\n[Refrain: Young Thug]\nI ain't new to this shit, fuck-nigga\nI'm trappin' from the other side\nSo get outta your seat, stand up\nStand up\nA fuck-nigga hate me while his old lady participate\nPlease tell that lil' nigga man up (lil' nigga, stand up, woo)\nStand up (lil' nigga, stand up)\nStand up (hey, hey)\nHey, hey, stand up, stand up, stand up\n\n[Chorus: Kanye West]\nSomebody\nGotta be the bad guy\nI had a bad day at work\nDon't wanna have a bad night, ayy\n\n[Refrain: Young Thug]\nI ain't new to this shit, fuck-nigga\nSo get outta your seat—\n\n[Verse 3: Tyga]\nI might have to jump from the three-point line\nI might take a piss on the Hollywood sign\nShe always bite her lips every time she lyin'\nShe bite her lips every time she say she mine (woo, sheesh)\nCan't be my baby with no \"Maybe\"\nI'm always more truthful when I'm angry\nI can't go to dinner with my lady\nThis fame shit's crazy\nNigga got more whips than slavery\nMy shit in Barney's sellin' like it's Macy's\nBeen two months since I talked to Jay-Z, this fame shit's crazy"}], "artist": "Kanye West"}