{"songs": [{"year": "1999-10-26", "title": "Slip Into My Eyes", "image": "https://images.genius.com/9841a200e7b94485d7e2a91b3dbd2520.700x700x1.jpg", "lyrics": "Saafir talking:\nYeah comin' wit that heat\nI can't hear the beat\nAyyo Tone whats that man?\nTurn that up\n\nSaafir:\n\nNow these r the eyes of a player\nTrue to the layers of the game it's plain and simple\nAn instrumental in life\nDriven' to keep my mental tight\nRefined and chain and caged in pain\nIts microphone season, hey!\nI can shock the rain\nI exercise my extra eyes to keep my bones breathing\nGhetto bred but balanced to keep from falling off the ghetto edge\nI got my eyes from hustlers who made scratch from snatching lakes\nAnd could peep all your flavor before the after taste\nThey never taste they eat.but never words in they speech\nAlways embrace whats deep\nTweaking off your paper this entices freaks its unheard of\nSo in this herd of cattle I prattle prime beef\nI see millions politic with reef through the revolution\nDry land flows, scandalous type\nQuick to spot a snitch trapped in the pitch black\nFeel the intro, peep the playalistically divine and slip into minds\n\nChorus\nSaafir: Slip into my eyes (3X)\nLadies Singing: Slippin' away,U got me slippin' away (3X)\n\nSaafir:\n\nAnd you will if your optical skill is low level\nThen lay back in this cold ass world of colorblind gray cats\nAnd vivid pictures I see the sick getting sicker\nNiggas dissin they own blood just to get richer\nSnail Niggas wit the escargot rhyming style.. ugh!\nReal rappers coming out ain't no more rhyming foul\nIll be hurt when I see my real folks snorted out\nBlowing all the work till u broke\nLook now you done it\nTwisted in jail with diverging\nWith a monkey in your stomach\nBail way more than 800\nThree striking out, trynna win with the bullpen of gorillas\nPimps killers and Niggas that say open your mouth\nAnd stick a tool in it\nFreaks that never speak and stay wetted\nWith the fetish rabbit ass.hoes that sell their souls for cabbage\nYou can ask tone like a grandfather\nHolding eyeglass frames I'm serious\nSlip into my eyes if you feeling dis\n\n(Chorus)\n\nSaafir talking:\nThese are the eyes of a player\nTrue to the layers of the game\n\nSaafir:\n\nI'm an image without an image but you can't see that\nI know its hard, When you trynna get a cameo from the start junkyard\nTrynna fulfill your character with the self came fill\nNo skill.trynna get a meal ticket, But you ain't wicked\nU ain't paid the price, I'm trynna have more days\nThan the first and fifteenth fuck paradise\nI'm paradise is being shaken (rattling noise)\nEvery time the president awakens in the winter\nConnect with my weather team\nFrom Oakland to LA to Mount Verna-Lini\nWho I never scene, a murder scene\nYellow tape reshapes my fate\nFaces racism my own sisters, setting me up\nCuz they love the taste of sums gism\nAncient ass 5-0-1 denim devil blues\nVisions through the prism of another level fool\n\nChorus (5X)\nSaafir in background saying, slip into my eyes..imma hustla!\n\n(Fades)\nSlippin away\nU got me slippin away!", "album": "The Hit List"}], "artist": "Saafir"}