{"artist": "Yung Joc", "songs": [{"album": null, "image": "https://images.genius.com/22499e1de4fddec5dee3a6c7062bbea4.420x420x1.jpg", "year": null, "lyrics": "Yung Joc\nInny meeny miny mo\nHow many bitches from the club won't go\n(I know you see it, I know you see it)\n\nMs. B\nI'm like inny meeny miny mo\nHow many niggas in the club won't go\n(I know you see it, I know you see it)\n\nYung Joc\nNow you can call me tipdrill, they playing my song\nThrow a couple ones, then she throw away her thongs\nWhen she bust it open, take a picture with my phone\nShe love my cologne, call it perk body zone\nNow she pussy poppin', it's goin' down\nSlap the waitress on the booty, tell her \"get another round\"\nAnd when I make it rain, money all over the ground\nFresh force ones, Sean John button down\nAnd then I'm like \"oh boy, a clique fulla stars\"\nBig four fifth, big dick, and big cars\nAt the end of the day, when it's all said and done\nI need four freaks 'cause I need more than one\n\n(Chorus)\nYung Joc\nInny meeny miny mo\nHow many bitches from the club won't go\n(I know you see it, I know you see it)\nI'm like bim bam, I know you want some\nShe chewing on the dick like a piece of bubble yum\n(I know you see it, I know you see it)\nMs. B\nI'm like inny meeny miny mo\nHow many niggas in the club won't go\n(I know you see it, I know you see it)\nThen I'm like bim bam, I know you want some\nYou chewing on the pussy like a piece of bubble yum\n(I know you see it, I know you see it)\n\nMs. B\nI ain't never been the type to show off in the club\nReal laid back poppin' plenty bottles of\nBub, don't smoke but I got much purp\nGet that nigga real high, make him slurp it then burp\nCould you be a groupie? I hear you singin' my song\nLike I see you, lemme feel your tongue\nIt's me, Ms. B. nigga, let me get you laced\nTake a step back, blow the pussy in ya face\nI ain't talking cush nigga, talking a rat race\nSo many to choose from, give 'em all a little taste\nGotta house fulla pussy, the madam of hip hop\nMy bitches are superstars, so gushy you need a mop\nYea\n\n(Chorus)\nYung Joc\nI got stacks on deck, snowflakes on my neck\nNew J's on my feet, make my outfit complete\n(I know you see it, I know you see it)\n\nMs. B\nI got stacks on deck, niggas love my flow\nGot a mohawk blowin', air forces that glow\n(I know you see it, I know you see it)\n\nYung Joc\nInny meeny miny mo\nHow many bitches from the club won't go\n(I know you see it, I know you see it)\nI'm like bim bam, I know you want some\nShe chewing on the dick like a piece of bubble yum\n(I know you see it, I know you see it)\n\nMs. B\nI'm like inny meeny miny mo\nHow many niggas in the club won't go\n(I know you see it, I know you see it)", "title": "I Know You See It (PO clean edit)"}]}