{"songs": [{"year": "2009-10-06", "title": "Fatherhood (Rayne Dior)", "image": "https://images.genius.com/ba2ca8f14b0677073955b40f4f7a416f.1000x1000x1.jpg", "lyrics": "[Intro – Saigon]\nIt’s crazy ‘cause… When I look at you, it’s like… It’s like, it’s like… It’s like I’m looking at me…  It’s like I’m looking at me…  Saigitty\n\n[Verse 1 – Saigon]\nYou got your father’s lips.  You got your father’s nose\nYou got your father’s eyes—a nice surprise, that’s the part that glows\nCan’t wait to watch you grow—so much I can’t sit still\nCan’t wait to teach you to fly a kite and ride a bike without them training wheels\nYou’ll see some things that’s real.  Life—it can be so cruel\nBut I’ll be right there every step of the way—yes, baby, I promise you\nI’ll be the dad that mom wasn’t.  Gotta be responsible and I does it\nIn the hospital, the chord—I cut it.  The more I live it, the more I love it (What’s that?)\nIt’s fatherhood.  Do everything that a father should\nPromise to raise you well from through K through 12, then you run off to college—good\nAnd if you happen to come home from prom late (What?!?)\nYou know daddy gonna pick up your prom date\nAfter he swear on his life he [?] get a kiss, I’mma hit him in his lip and I’m straight\nYou got your father’s cheeks.  You got your father’s feet\nI know you got your father’s heart, so it’s the hardest beat\nI wanted a boy, but you came.  But no pleasure measure the joy you bring\nI wanted a boy, but you came.  But no pleasure measure the joy you bring, Rayne\n\n[Chorus – Lokz]\nRain on me\nThere will be sunshine\nJust rain on me\nI’ll be there for you\nJust rain on me\nWait for the sunrise\nThe rain’s gotta fall—I’ll be there through it all\nThe pain—I’ll be right by your side\n\n[Verse 2 – Lokz]\nApologize.  I’m caught up in my ways\nBut I just gotta hustle babe—so you don’t have to\nSo many things that I’ve been tryna change\nSo I can be the man you look up to\nYou might not be aware\n[?]\nI’ll show you I care\nWhen someone breaks your heart, I’ll be right there\nIf they try to hurt you, just remember: ain’t no man who deserve you\n\n[Saigon]\nI’mma be the only man you need, baby girl.  I promise…\n\n[Chorus – Lokz]\nRain on me\nThere will be sunshine\nJust rain on me\nI’ll be there for you\nJust rain on me\nWait for the sunrise\nThe rain’s gotta fall—I’ll be there through it all\nThe pain—I’ll be right by your side\n\n[Verse 3 – Saigon]\nRayne Dior—you’re my savior\nThe second that you was born, I swore the tree shakes better than it did the day before\nLet me slow this down.  I need for you to know this now\nI’ll rap, rob, shake, bake—whatever it may take to hold us down\nAnd it might sound cliché, but I’m loving you much more each day\nEven though me and mother don’t click, if it benefits you, I’ll do whatever she say\nThat’s fatherhood.  You my proof that God is good\nAnd when the day turn gray, I ain’t staying away—I’m just praying to God it would\n\n[Chorus – Lokz]\nRain on me\nThere will be sunshine\nJust rain on me\nI’ll be there for you\nJust rain on me\nWait for the sunrise\nThe rain’s gotta fall—I’ll be there through it all\nThe pain—I’ll be right by your side", "album": "Warning Shots 2"}], "artist": "Saigon"}