{"artist": "Pras", "songs": [{"album": "Win Lose or Draw", "title": "Mr. Martin - 37650", "image": "https://images.genius.com/e86c37e94a9221052cd1f57601afc795.500x500x1.jpg", "lyrics": "[Akon]\nConvicts, it's the convicts\nTesting one two three, we come\n\n[Chorus: Akon]\nI said call Mr. Martin, tell 'im to build a coffin\nToday is death season, a hundred MC's a get murderin\nI said call Mr. Martin, tell 'im to build a coffin\nToday is death season, a hundred soundbwoys a get murderin, yeah\nLay flat, lay flat, lay flat, lay flat\nCame with a full clip I got one shot left\nEverybody lay flat, lay flat, lay flat, lay flat\nCame with a full clip I got one shot left\n\n[Pras Michel]\nEverytime I BREATHE I feel like they're killin me\nIt seems death my only way to my destiny\nYou see crazy the bwoy that go against my rap\nI'm like Moses when I strike down my staff\nSee my wordplay, is like arts and craft\nAnd my gunplay will blast any Babylon in my path\nWin lose or draw, the bloodiest bath\nFifth to the fist is the cruddiest jab\nEver seen, pocket stays ever green\nLike Christmas trees I dismiss these\nFool slide, close my eyes, lead the blind\nDecapitate you, ease your mind\nHaitian homes, lethal lines, it's my time, to shine\nI resurrect like Lazareth\nBaby I'ma cancel death\nGot to survive in this main maniac depression\nFuck y'all, 'scuse my expression\n\n[Chorus] w/ ad libs\n\n[Akon]\nTicky ticky tock on my golden hen\nShe layin next to this gentlemen\nSometimes Glock 9, sometimes mac-10\nHooooo...\nYou see whenever she lay down she cock an alarm\nCock cock cock, cock me lay down\nTime to lay low (time to lay low)\nTime to lay low (time to lay low)\n\nTick-a-tick-a-tock, tick-a-tick-a-tick-a-tick-a-tick-a-tock\nTick-a-tick-a-tock, tick-a-tick-a-tick-a-tick-a-tick-a-tock\nLet me tell 'em, yo\n\n[Pras Michel]\nAiyyo this life ain't for livin it's for, fightin wars\nNo matter what the truth is, hold on to what's yours\nNever forget the day they crucified Jesus Christ\nAnd the day they turned their backs on the civil rights\nLyrically, we trained to assass' y'all\nStash flat irons, thinner than plasmas\nCardiac arrest, give a big man asthma\nRun for ya life if you think you got stamina\nCaught an ounce of lead, watch how Babylon spreads\nYou know the type that'll run to the feds\nNever ran, never real cop Port-au-Prince\nIt's an avalanche, homey you don't stand a chance\n... ants in your pants\nYou wanna rock, these bullets'll make you dance\nHomies thought I'd be driven away in a black hearse\nBut the first shall be last, the last be first\n\n[Chorus] w/ ad libs", "year": null}]}