{"songs": [{"year": "2016-10-29", "image": "https://images.genius.com/d63c8252bb2773de02ecfd5c90d5d29c.640x640x1.jpg", "title": "Fire In The Booth", "album": null, "lyrics": "[Intro]\n(You know what time it is when you hear this right)\nLet's get it New York, let's get it\nWe got one, let's get it\nWe all the way out in London with the one time\nLook\nGlobal not local\nCheck this shit\nYo, look, look, I said\n\n[Verse 1]\nThis is the stage that I've waited for my entire life\nSwear these nigga tired, I'm bringing fire and all the light\nThey be like 'This youngen right, to all the others, it's goodnight'\nWe gon' keep 'em slept on and tuck 'em in hella tight\n[?] going up like a kite\nCan't give attention to bitches, they riding with the hype\nWe don't even care to see your face, na this isn't Skype\nAnd niggas keep saying they fresh, then I guess that I'm right\nIn the hood tryna get out like it's three strikes\nShark mind so I swear it's nothing when I hear the pike\nComing from the land where they scammed since stolen bikes\n[?] switch to cheques like it's old Nikes\nNow it's cards, they go swipe\nSo the hoes want pipe\nThey just love the image, when the gimmick switches, you'll be dropped\nThat's the reason why I do me as if I was a type\nLiving care-free from to go like [?]\nIt's hard in the streets but hot when I'm by the mic\nIn the booth, Nehru's the truth, other dudes are aight\nYou can't do what I do so don't even try\nHow're you the man? You can't even look me in my eyes\nSick and tired of all the lies\nThinking I won't recognise\n'Cause I'm what not but this young boy very wise\nKnowing every chick is an actress, it's just in disguise\nHalle Berry's playing [?], all for a rise\nI play Clinton, still get my wood between her thighs\nAfter that, it's another Dutchie, heading to the sky\nI don't run out like an unlimited supply\nI do this for me 'cause I know nobody by my side\nThey all want a piece or they tryna hit your ride\nSo I never care about a chick or a nigga, why?\n'Cause I know both of them can switch right before your eyes\nBeen at it for a minute, how you mad? I got a price\nThe flow's ongoing"}], "artist": "Bishop Nehru"}