{"songs": [{"lyrics": "[Intro: Beyoncé]\nDeliver me from my enemies, oh God\nDefend me from all that rise up against me\nDeliver me from the work of iniquity\nAnd save me from the Bloody Men\n\n[Verse 1: Jay-Z]\nLook.. mind state of a gangster from the 40s\nMeets the business mind of Motown's Berry Gordy\nTurned crack rock into a chain of 40/40's\nSorry my jewelry's so gaudy\nSlid into the party with my new pair of Mauris\nAmerica, meet the gangster Shawn Corey\nHey young world, wanna hear a story?\nClose your eyes and you can pretend you're me\nI'm cut from the cloth of the Kennedies\nFrank Sinatra, having dinner with the Genovese\nThis is the genesis of a nemesis\nMother America's not witnessed since\nThe Harlem Renaissance birthed black businesses\nThis is the tale of lost innocence\nAs the incense burn and the turntables turn\nAnd that Al Green plays\nI see my mother's afro\nAs Mama taps her toes, as she rolls her J's\nAnd my papa just left the house\nIn search of the killer of my Uncle Ray\nAnd she's trying to calm her nerves\nAs I observe this is just one day\nAnd what tomorrow has in store\nWe can never be sure, so all we can do is... pray\n\n[Break: Beyoncé]\nBecause of your strength\nWhile I walked upon thee\nFor God is my defense (pray for me!)\n\n[Verse 2: Jay-Z]\nAs I head to my homeroom\nI observe the ruins, dope needles on the ground\nI hear a car go, \"Vroom\"\nDrug dealer in the BM with the top down\nAs the girls start to giggle\nI ask, \"Why you laugh?\", they say, \"You're too little\nOne day you'll understand when you become a man\nAbout things you have to get you\"\nFast forward, freeze frame on my pistol\nFistful of dollars, ignorance is so blissful\nI didn't choose this life, this life chose me\nAround here it's the shit that you just do\nI just left school\nThe same BM is pulled over by the boys dressed blue\nThey had their guns drawn, screaming, \"Just move!\"\n\"Or is there something else you suggest we can do?\"\nHe made his way to the trunk, opened it like, \"Huh?\"\nA treasure chest was removed\nCops said he'll be back next month\nWhat we called corrupt, he calls paying dues\nNow when the rules is blurred\nAs they is and were, what am I to do?\nBut pray? Pray the Lord forgive me\nPray He guides me by for what I'm 'bout to go through, pray\n\n[Break: Beyoncé]\nDeliver me in thy righteousness\nAnd cause me to escape\nAnd climb thine air unto me\nSave me thine Lord (pray for me!)\n\n[Verse 3: Jay-Z]\nGeah.. anywhere there's oppression\nAnd the drug profession\nFlourishes like beverages, refreshing (ahhh!)\nSweet taste of sin\nEverything I seen made me everything I am\nBad drug dealer or victim, I beg\nWhat came first? Moving chickens or the egg?\nThis is why I be so fresh\nI'm trying to beat life 'cause I can't cheat death\nTreat shame with shamelessness\nAim stainlesses at anuses, you know the game this is?\nMove coke like Pepsi\nDon't matter what the brand name is\nI stand behind mine\nEverything I do, I'm a man behind mine\nI'm not an angel, I'm sure, but every night before I lay\nI drop my knees to the floor and I pray\n\n[Outro: Beyoncé]\nThe name shall endure forever\nThe name shall be continued as long as the sun (pray for me!)\nMen shall be blessed in Him\nAll nations shall call Him blessed\nIn your name I pray... (pray for me!)\nLord bless us", "title": "Pray", "image": "https://images.genius.com/778c1892b8a2f5aee554c4c797ca8915.1000x1000x1.jpg", "year": "2007-11-06", "album": "American Gangster"}], "artist": "JAY-Z"}