{"songs": [{"lyrics": "[Intro]\nHey, mama (mama), I'ma tell you why (I'ma tell you why)\nI can't go to Horace Mann Junior High\n\n[Verse 1]\nRaymond Elementary was all good, 'cause it was in the Eight-Trey neighborhood. Horace Mann Junior High was all bad, so many Rolling 60's it made me mad. The Rolling 60's, the rival gang, swamp water deep doing thay thang, Horace Mann Junior High two blocks from my house, no Glocks. I had to run like a mouse, a lot of Trey's died and went to the pen, claimin' Rolling 60's was a popular trend. Salt and Pepper came out from the polygram camp with a song named \"Tramp\". The Rolling 60's called the Eight-Trey's Tramps. They bumped Salt an' Pepper with major amps, the Eight-Trey's called the 60's sissies, even since the 60's\n\n[Hook]\nI can't go to Horace Mann, I can't go to Horace Mann\nI can't go to Horace Mann, You don't understand\nI can't go to Horace Mann, I can't go to Horace Mann\nI can't go to Horace Mann, You don't understand\n\n[Verse 2]\nHorace Mann, 2 blocks from the gansta's ride, but they bustin' Rolling 60's from the west side. My hood is close but the O's (?) are deep. One wrong move and they'll play me cheap. I really didn't bang but then again the Tramp talk was gettin' under my skin. One day before my homeroom class, this dude hit up every person he pass, he got to me, I said \"ETG\", He said \"OK, We'll see\". I thought we were going to fight. But he wasn't trippin', he just sat tight. Lunch time came I was grabbin' a bite, I spotted homie tellin' every 60 insight, where I was from and who I was. I can't go to Horace Mann, cuz\n\n[Hook]\nI can't go to Horace Mann, I can't go to Horace Mann\nI can't go to Horace Mann, You don't understand\nI can't go to Horace Mann, I can't go to Horace Mann\nI can't go to Horace Mann, You don't understand\n\n[Verse 3]\nI went to school the very next day. On alert, 'cause I'm from Eight-Trey. Bust Six-O, I was outside my class, Starched up Khakis hangin' off his ass, he said, \"cuz, I heard you was a Tramp\", I socked him six times like a boxin' champ. I ran, I left Horace Mann, runnin' fast as I can, please understand, it felt like a track meet down on sixty ninth street, just a little kid tryna keep from gettin' his ass beat. All the rolling 60's saw what I did, the whole school chasin' that Eight-Trey kid, when I got to western they let me go, all the Eight-Treys at the liquor sto'. I crossed the street, they shook my hand, I said \"Cuz, I can't go to Horace Mann\"\n\n[Hook]\nI can't go to Horace Mann, I can't go to Horace Mann\nI can't go to Horace Mann, You don't understand\nI can't go to Horace Mann, I can't go to Horace Mann\nI can't go to Horace Mann, You don't understand\n\n[Verse 4]\nBack to school, day number three, everybody know I'm from ETG, so I stay low-key and on my toes watchin' out for the Six-O's. No Rolling 60's the coast was clear, I hit the bathroom and unzipped my gear, it took so long to drain my donkey-kong, I felt something was wrong, see for I could finish relieving myself I looked and I wasn't believing myself, eighty-three Rolling 60's walked on in, now the rat-pat was about to begin. I heard a loud noise, I heard it a lot to tell you the truth I thought I got shot, I was layin' in bed and told my wife, \"The North-Ridge earthquake saved my life\"\n\n[Hook]\nI can't go to Horace Mann, I can't go to Horace Mann\nI can't go to Horace Mann, You don't understand\nI can't go to Horace Mann, I can't go to Horace Mann\nI can't go to Horace Mann, You don't understand\n\n[Outro]\nHey, mama, I'ma tell you why\nI can't go to Horace Mann Junior High\nYou don't understand", "title": "I can’t go to Horace Mann", "album": null, "image": "https://images.genius.com/43fe0c1710df257aed488ceb8117b825.336x498x1.jpg", "year": "2013-07-12"}], "artist": "Afroman"}