{"songs": [{"image": "https://s3.amazonaws.com/rapgenius/necro.jpg", "title": "Robbery ’95", "album": null, "year": null, "lyrics": "Robbery\nRobbery\nRobbery (Run)\nRobbery (Give it up)\nYour destination is a casket, when I put on my mask kid\nMy task is seeing green, killing you without being seen\nThat's the plan, you get swollen up when I stick G\nYour shits getting stolen, I'm rolling up on you quickly\nI'm taking your Tommy Hilfiger coat\nClothes line from behind\nPut the razor to this niggas throat\nStand still – don't make my hand kill\nFuck around, end up in a land fill all over a grand bill\nMoney's something you should have gave up\nNow your family has to dig a grave up – If your one of them bitch\nNigga rich, nigga with fancy clothes\nYou'll get attacked by a mental case faces covered with pantyhose\nI'm blasting anyone that has a frown, get messed up with a pound\nBy a man dressed up as a clown\nYou'll be dripping magenta lively, with no justice you'll die G\nCuz you can't identify me\nRobbery (Kid running)\nRobbery (Give it up bitch)\nRobbery (Hand it over Fuck)\nRobbery\nRobbery (Give it up)\nI'm attacking you dressed up like the villain from Cobra\nUnsober\nWearing a mask like it was the end of October\nYour life is over\nIn your pants you're peeing when I pull out my fucking\nThree pound and represent like I'm skiing\nI've done more shit than you, you wanna see I'll rehearse it on you\nTry to fucking rob me I'll flip it kid and reverse it on you\nEven if you're only seven you'll become a victim quicker than Sonja Preven\nYou'll get sent to the lonely heaven\nDon't go around on places I lurk, whore\nCause I go berserk, FOR, everything you fucking work for\nDon't think I won't cut your wench throat\nI got the shotgun under the trench coat\nPlus when I get greedier, the media eats it up and you\nFucking reporters get boners when Necro slaughters store owners on video recorders\nWhen I'm vickin' there's always a face I must bash\nAnd if I'm seen takin' the green then I'm shaving off my moustache!\nRobbery (Run in her)\nRobbery (Put it in the bag punk)\nRobbery (Give it to me bitch)\nRobbery (Empty your pockets and die son)\nRobbery\n(talking like an old woman)\n\"Oh! They stole my wallet! They took my pocket book\nPolice? He took my money. That white man over there\""}], "artist": "Necro"}