{"songs": [{"album": "Fuck A Mixtape", "image": "https://images.genius.com/6f08c14dfef32114f3f4458805c96968.500x500x1.jpg", "year": null, "title": "Celebration", "lyrics": "Everybody hope for soul force let 'em hate\nCut the day now let em' do but celebrate\nHey! It's a celebration bitches!\nHey! It's a celebration bitches!\nBank rolls out take the rubber bands off\nAnd let the girls have fun\nKeep the champagne popping!\nHey, hey! It's a celebration bitches!\nHey! It's a celebration bitches!\n\nI got a new swag, and it's a new day\nThem suckas hate let 'em hate I'mma celebrate\nAnd I ain't finna be polite, I do it in they face\nGet myself twenty thousand ones threw it in they face\nAye I'm the hottest nigga in the A anyway\nThey got they mind on me I got my mind on gettin' paid\nSour niggas give me lemons I make lemonade\nHahahh and it ain't much to it\nContinue to get rich the way Jay and Puff do it\nGet it from the club, obstruction of the music\nWent from gettin' front of drugs to gettin' millionaire movies\nIt's over for the hustle man them bustas just knew it\nT.I. got caught with what!? Grand hustle just blew it\nOh so you thought so quite contrarily\nThat's why I made the point to ball on ya some terribly\n\nEverybody hope for soul force let 'em hate\nCut the day now let em' do but celebrate\nHey! It's a celebration bitches!\nHey! It's a celebration bitches!\nBank rolls out take the rubber bands off\nAnd let the girls have fun\nKeep the champagne popping!\nHey, hey! It's a celebration bitches!\nHey! It's a celebration bitches!\n\nHey, let them hate once, then they hate twice\nI just ball hard, then celebrate life\nOn the highway flyer than I used to be\nBefore I rap I'm ranked higher than I used to be\nI've been through everything nothing you can do to me\nThey hate on everything I do, I'm still doing me\nYou see me everywhere, drinkin' Louis V\nAye you don't like it I don't care start suing me\nParty like Rick James Charlie Murphy them\nA lotta niggas talk shit but you ain't heard of them\nGod sat me down told me he ain't worth it TIP\nNever mind remember ain't nobody perfect pimp\nYou work hard live well you deserve it TIP\nSo they hate you for it, now the nerve of them\nHey if it weren't for you, and it weren't for them\nThey ain't gon' like it ain't nobody on the earth exempt\n\nEverybody hope for soul force let 'em hate\nCut the day now let em' do but celebrate\nHey! It's a celebration bitches!\nHey! It's a celebration bitches!\nBank rolls out take the rubber bands off\nAnd let the girls have fun\nKeep the champagne popping!\nHey, hey! It's a celebration bitches!\nHey! It's a celebration bitches!\n\nHey all jokes aside, I mean real talk\nYou ain't got it like me I'mma still ball\nEven if I had to take a couple years off\nUpon my return, hey I'mma still flaw\nEven harder though, so let the robber know\nHaters do ya thing I'mma shine regardless though\nWhen you say it like it's over I'mma make a way\nBy whatever means, you better tell 'em Jay\nMy hearts consumed with determination safe to say\nHey what we got today they can never take away\nSo let 'em bo guard, we just go hard\nShow 'em how to ball, we gettin' no charge\n\nEverybody hope for soul force let 'em hate\nCut the day now let em' do but celebrate\nHey! It's a celebration bitches!\nHey! It's a celebration bitches!\nBank rolls out take the rubber bands off\nAnd let the girls have fun\nKeep the champagne popping!\nHey, hey! It's a celebration bitches!\nHey! It's a celebration bitches!"}], "artist": "T.I."}