{"songs": [{"album": "Anghellic", "image": "https://images.genius.com/365df4b783df60dc1a28c15c531795e6.1000x978x1.jpg", "year": "2001-08-28", "title": "Einstein", "lyrics": "[Intro]\nWhat? Two thou style\nMidwest side\nTech N9ne\nThe anthem, nigga\n\n[Verse 1]\nIf you got scratch, nigga, get the fuck up\nThrow your hands up if you hella fucked up\nEinstein, Tech N9ne, two triple zip\nCrack a jaw, whip 'em all if they wanna trip\nLadies with the bar codes, meet me after this\nMaybe you can show me the meaning of abyss\nEverybody on the wall, momma is a bzzz\nHad her at the Budgetel stroking on my dzzz\nThis ones for the psychos, gang bangers and sluts\nBumbs holding the pipe those college graduate fucks\nI feel for no foes, I kill 'til I close my trap\nI'm ill when I flow and you never doze when I rap\nTech Tech, give me women and much alcohol and I'm straight\nEat drink and be merry, yo, come tomorrow might be your fate\nYo, look, look over there\nIt's that nigga with the hair\nTECH and Juan, what a pair\nThe rest equals MC squares\nWhat?\n\n[Hook]\nWho got this motherfucking house on lock?\nEinstein, Tech N9ne, dwamn\nWho keeps it sizzling? Who keeps it hot\nEinstein, Tech N9ne, dwam\nKC, MO, Roll\nKC, MO, Roll\n\n[Verse 2]\nEverybody witness, my soul sickness\nIf you dig Tech when he's twisted, then go get this\nBringing the house down when I rip shit like the plates shifted\nAngels come in many shades either drunk or lifted\nThe Einstein, meaning gifted, too slick to get with\nTwo years ago, my shit was broke, but now I fixed it with the quickness\nYou missed it when I used to roll with misfits and Nitwits\nBut now who I do biz with ain't none of yo business\nBlood thirst in the church now, the earth's the worst\nClutch your purse when we lurk cause we cursed from work\nTrying to party like a motherfucka, broke as a joke\nDon't hire me, but you arrest me when I'm selling my dope\nSo who's the Einstein in N9ne N9ne, Tech N9ne I'm\nCrime mind in my prime rhyme time\nI'm mixing one fifty-one with Malibu rum\nAnd pineapple juice among all my angels and wicked ones\n\n[Bridge]\nWe're the party people night and day\nLiving crazy is the only way\nEinstein, get you where I got you when I'm on it\nEinstein, rock it like you mother fuckers want it\n\n[Hook]\n\n[Verse 3]\nWhat do we say to haters off top?\nHaters got beef, they thinking we got\nWe gonna get postal if it don't stop\nYou can get ghost or you can get shot\nGeneration X gon' party 'til the death\nAnybody tripping getting greeted with a stretch\nTaking everything and we're leaving nothing left\nDemons gotta die have 'em breathing last breaths\nI feel that I got will and I'm gonna bill 'til I'm killed\nBell 'til I bail, if I fail, then I'm gonna steal what I will\nTech is a realist, running with killers, you better vill this\nBe the witness to the coldest\nWhen I hold this dick, they break camp when I flow this\nEinstein go the ill route\nThrow up your hands if you're villed out or if you're real sauced\nI told you all I'm cold dog I flows, all heat\nI'm representing Rogue Dog, Rogue Dog, 57th street\nWhat?\n\n[Hook]"}], "artist": "Tech N9ne"}