{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/0e825d5daf35800f4be503b4ff58164c.640x640x1.jpg", "title": "Turn Back the Hands of Time", "album": "Weekend Warrior", "lyrics": "[Verse One: Biz Markie]\nThis is a story about without a doubt\nWhen I'm done, you will all scream and shout\nThey always say time is on our side\nIf it is, why is it a rough ride?\nIf I could save time or return to the past\nI would bring back the good times, hate to last\nLike when I was the size of Jay-Z\nBack when Ra was still with Eric B\nRemember when friends was friends, and LL had a Benz?\nAnd cell phones and beepers was the new trends?\nWhen Koch was the mayor and Reagan was the Pres?\nWe listened to what other enemies said\n\n[Chorus: Lil' Kal]\nI wish there was somethin made, or somethin designed\nWhere I could turn back the hands of time\nI wish there was somethin made, or somethin designed\nWhere I could turn back the hands of time\n\n[Verse Two: Biz Markie]\nI know y'all remember goin to Great Adventure\nOn Labor Day on the Beach in Virginia\nThe beginnin of the summer, at Jones Beach\nWhen t-shirts, were ten dollars each\nDidn't matter if you had a Lex, Beamer or a Benz\nAs long, as you had room for, all of the friends\nMr. Softee came through, or the Good Humor truck\nWhen ice cream, was less than a buck\nIf it was up to me and I could turn back the clock\nI'd bring Masterdon, Buffy, and Scott LaRock\nSo - please listen to my song and rhyme\nIf I can turn back the hands of time\n\n[Chorus] w/ ad libs\n\n[Verse Three: Biz Markie]\nIf I could turn time back in a rhyme\nI'd bring back Bird, Magic, Jordan - in their prime\nRemember the days OH, remember the days\nWhen they had the high-top, fade craze\nWant back Big Daddy Kane, Fresh Prince and Kid & Play\n\"Ohhh, what a beautiful day!\"\nWhen parties was parties, and clubs was clubs\nYou could tell the real MC's from all the scrubs\nWhen havin your own style and originality\nAnd your character and real personality\nBut I have to go, and off I sign\nIf I can turn back the hands of time\n\n[Chorus] - 2X w/ ad libs\n\n[Biz Markie]\nI wish there was somethin made\nBring back Aaliyah! (Jam Master Jay)\nI wish there was somethin made to bring back Biggie and 2Pac\nI wish there was somethin made to bring back Scott LaRock\nI wish somethin bad, I wish there was somethin made\nTo bring back, Left Eye (Barry White)\nI wish there was somethin to bring back my man Dahsil Masterdon\nI wish there was somethin made to bring back my man Keith Cowboy\nMy man B.O., my man Step from Baltimore\nI wish there was somethin to bring back\nAll the strange people that I knew that, was a part of my life\n(For all of our loved ones that have passed away)"}], "artist": "Biz Markie"}