{"songs": [{"title": "Dancin’ Girl", "album": "The LP", "year": null, "image": "https://images.genius.com/51783bd9801aa4b7b68f22b4f6fd7db5.1000x1000x1.jpg", "lyrics": "[Verse 1]\nI'm watchin’ you through the zoom lens view\nYou a star, the most beautiful by far\nDoin' your dance over by the bar\nFlowin', not knowin’ where you'll go tomorrow\nCome on, girl, give me a swing or a twirl\n'Cause I'm just a man trapped up in your world\nFor now, and can't help but to wonder how\nYou manage to rock harder than a whole crowd\nOf people that like, got ya lookin' outta sight\nAnd even when dim, you look fit, firm and trim\nI can't front, sexy, I'm like Heavens to Betsy\nAnd that’s not your name, but I’m glad that I came\n'Cause for me, you are like the ill inspiration\nAll on your own, just you against the nation\nOf many that come, from live to humdrum\nIn search of a good time, lookin’ for some\nSo many fellas to like, in ya head's high life\nSo this song today is for you, alright?\n\n[Background vocal]\nDo ya thing, baby, keep it raw now\nOn the floor now, ya know?\n\n[Repeated during the hook]\nDo ya thing, baby, on the floor now\nKeep it raw now\n\n[Hook]\nShe's my Dancin' Girl\nShe’s my Dancin' Girl, check her out, y'all\nShe's my Dancin' Girrrrrrl\nBeyond a shadow of a doubt, y'all\nShe gets busy\nShe's my Dancin' Girl\nMy Dancin' Girl, word up\nShe's my Dancin' Girrrrrrl\n\n[Verse 2]\nYou're never afraid to hit the floor and get paid\nThe rush of it got ya goin' strong for the trade\nSo go on, girl, I can dig it\nThe way you just flick it makes all the guys wanna stick it\nTo you like glue, maybe your nickname's Boo\nOr mystery, I want you to know that this could be\nA tribute to you with much respect due\nFrom your man Extra P. of the highest degree\nFrom the Queens Lounge family, kid, roll deluxe\nWalk in the joint, holdin' mega ill wild bucks\nFlippin' the script on all the so-called\nSo come and have a seat so we can both have a ball\nWe only have one life to live, so let's live it\nAnd dance all night until we both can't give it\nAnother bit of energy, get down and do it\nThe same exact time next week to EQ it\n\n[Background vocal]\nDo ya thing, baby, keep it raw now\nOn the floor now, ya know?\n\n[Repeated during the hook]\nDo ya thing, baby, on the floor now\nKeep it raw now\n\n[Hook]\nShe's my Dancin' Girl\nShe's my Dancin' Girl, check her out, y'all\nShe's my Dancin' Girrrrrrl\nBeyond a shadow of a doubt, y'all\nShe gets busy\nShe's my Dancin' Girl\nMy Dancin' Girl, word up\nShe's my Dancin' Girrrrrrl\n\n[Verse 3]\nWell, it's the end of the night and we both are at a hype\nFor the max, it's time to cool off and just relax\nGo home and watch cable 'til the sunlight shine\nI never seen a Dancin' Girl run like mine\nThrough the whole night, dancin' for me and to the T\nI'm never frontin' on her just as long as she be\nMy Dancin' Girl, the one I do adore\nThe minute she hits the *chi-ka-chik* dancefloor\nShe lights up the party for mostly everybody\nSo go on, girl, illuminate the whole party\n\n[Background vocal]\nDo ya thing, baby, keep it raw now\nOn the floor now, ya know?\n\n[Repeated during the hook]\nDo ya thing, baby, on the floor now\nKeep it raw now\n\n[Hook]\nShe's my Dancin' Girl\nShe's my Dancin' Girl, love her\nShe's my Dancin' Girrrrrrl\nNever be another, she gets busy\nShe's my Dancin' Girl\nMy Dancin' Girl\nShe's my Dancin' Girrrrrrl\nShe's my Dancin' Girl, always rock the show\nNever afraid to hit the flo' with Large Pro\nShe's my Dancin' Girl\nShe's my Dancin' Girrrrrrl\nShe's my Dancin' Girl\nShe's my Dancin' Girrrrrrl\nShe's my Dancin' Girl"}], "artist": "Large Professor"}