{"songs": [{"image": "https://images.genius.com/97411d3fc45b9186a8e5643fe1e29183.500x500x1.jpg", "lyrics": "[Intro]\nCheck, 6:26 in the morning I just made this beat because I realized I enjoy playing the piano\nAh you know, fuck you. No one is in the room with me right now so I'm gonna to record myself\nI'mma try and do this all in one take, there's not a lot of editing because I'm to drunk to edit. And that's just the truth of the matter\nAlright let's go\n\n[Verse 1]\nI said raps is cold about 20 below\nI just realized I don't give a fuck any mo'\nUsed to look into the mirror asking where would this go?\nGot big quick kinda wish that I was taking it slow\nIt takes balls to go break from the mould\nI guess I did that\nI still got some dumbass fans who want K.I.D.S. back\nAnd I forget that they're twelve years old, I must accept that\nShould probably stop thinking so much and just rap\nI wish life was kinda easier to figure out\nI wish it was like Ferris Bueller singing \"Twist and Shout\"\nGot a couple reasons that I'll stick around\nBut for the most part this shit is foul\nI place my hand on a stove top to see if I'm awake\nI heard you taking bath salts and eating people's face\nSaw the people I know personally\nSee they act a certain way because they working for me\nAnd if you take that as a diss, that means I'm talking to you\nKnow I never look down I got knots in my shoe-\nStrings, made some money, went and bought me a few things\nThis ain't shit I'm just doodling (ahah)\nI'm sick of going to the movies and people looking at me\nInquire 'bout some shit that they know they shouldn't ask me\nHollywood got every girl around the world fasting\nLike eating was a sin when really beauty lie within\nGuess I wouldn't fuck me a fat bitch\nI just disagree with you, determining fat is\nWanna go to Israel to see if there's a God there\nFor now I'm bout to smoke some blunts and post in this lawn chair\nCould of been the mayor because I'm excellent with politicking\nPeople never say what's on their mind because they're on a mission\nWho do you think you are?\n\n[Verse 2]\nAnd may God damn your soul if you forgotten tradition\nLocked inside a box, a prison\nSomewhere there I saw a vision\nMet this girl with innocence\nAnd stole it while on top of linen\nRocket, word to Roger Clemens\nThat don't mean a thing\nI'm in love with making melodies but scared to even sing\nFor you judgmental fuckheads talking 'bout my life\nYou don't know me and if you did you'd say I'm nice\nEveryone I see always has some cool advice\n'Bout what they do if they were me and all the issues they would fight\nYou could never fathom what this shit is like\nAnd I hope you turn your bitch to dyke\nMy kryptonite is me", "year": "2012-12-17", "album": null, "title": "Doodling In The Key Of C Sharp"}], "artist": "Mac Miller"}