{"songs": [{"image": "https://images.genius.com/fc1e7b55dd334792b98cf2838650ddb9.1000x1000x1.jpg", "title": "Change (4 Freedom)", "album": "4Respect 4Freedom 4Loyalty 4WhatImportant", "year": "2018-08-30", "lyrics": "[Intro]\nMyself, myself\nOh well, no way, yeah\nWhy?\nWhy?\nWhy'd it have to be me?\nYeah\n\n[Chorus]\nAnd I fuckin' hate myself (Myself)\nAnd all of these choices I have to make (Yeah)\nAnd I don't want no one else (No one else)\nBut I have to be all alone for the change\nAnd I don't want to hurt myself (Myself)\nBut I have to make up my wrong for the change (Yeah)\nI swear I don't want no one else (No one else)\nBut I have to change for the heal of my pain\n\n[Verse]\nAnd I don't want cut off nobody (Nobody)\nBut I'm startin' to see that they all are the same (Are the same)\nAnd I don't see myself with nobody (Nobody)\n'Cause you the only one that can heal my pain\nSome say I'm crazy 'cause I don't want to live\nThey say I wanna go to jail 'cause I won't do what they say\nNo, I won't never take her name off my face\nI'm so deep up in your love, that my mind's in a Wreck\nThey gone clown me, try to down me\nAnd they probably tryna send me back to where they found me\nI don't want to pay for love, I don't want 'em 'round me\nHurt me once, your damage done, now they tryna drown me\nWill they still be around me if I didn't have no money?\nWould you look at me the same if I was regular and bummy?\nTried to share what I accomplished, you ain’t never give me nothin'\nI just hope you stay the same if I wasn’t around for something\nAnd I, yeah\n\n[Chorus]\nAnd I fuckin' hate myself (Myself)\nAnd all of these choices I have to make (Have to make)\nAnd I don't want no one else (No one else)\nBut I have to be all alone for the change (For the Change)\nAnd I don't want to hurt myself (Myself)\nBut I have to make up my wrong for the change\nI swear I don't want no one else (No one else)\nBut I have to change for the heal of my pain, yeah\n\n[Bridge]\nI'm insane now, I'm insane now, I'm insane now, yeah, yeah\nI'm insane now, I'm insane now, I'm insane now, yeah\n\n[Chorus]\nAnd I fuckin' hate myself (Myself)\nAnd all of these choices I have to make\nAnd I don't want no one else (No one else)\nBut I have to be all alone for the change\nAnd I fuckin' hate myself (Myself)\nAnd all of these choices I have to make\nAnd I don't want no one else (No one else)\nBut I have to be all alone for the change"}], "artist": "YoungBoy Never Broke Again"}