{"songs": [{"title": "Stop That", "album": "Normal Backwrds", "year": "2018-10-19", "image": "https://images.genius.com/b462bb29b510afd6b4d39f0468b15b8f.1000x1000x1.png", "lyrics": "[Intro]\nI tell that bitch go crazy\nGang Gang\nNah for real though, GetBackGang\nReal GetBackGang shit\nWho into with us?\nWho want smoke?\nToo much talkin', you ain't really street (nah)\nToo much talkin', you ain't really street\nYou ain't really street (nah) (nope)\nYou ain't really street\n\n[Verse]\nToo much talkin', you ain't really street\nGrowin' up, ain't a nigga that I wanna be\nI don't fuck with niggas, and that's just me\nCircle small, you can't get with me\nKeep a few thorough niggas with me\nMost niggas gon fake it to the tee\nPlay games, get put up on a t'\nI don't want a goofy ridin' with me\nKeep your distance, don't ask 'bout me\nBein' real, that shit so simple\nIt ain't hard, that's what you wanna be\nI'm me, I don't give a fuck what you think\nSo high, I can't even think\n4:40 AM, I'm blowin' out the P\nCan't touch what you really can't see\nIf I ain't been with you, nigga you don't know me\nStop tellin' people \"yeah\" you know me\nYou an old ass header in the streets\nKeep it real, man that's how it's gon be\nNeed a break, gotta get to the cake\nCircle small, man I can't even play\nI done seen it in a lot of niggas face\nYou ain't made for it, boy yo ass gon break\nIt remind me of First 48\nMomma been warned me 'bout the fake\nI was just hardheaded everyday\nSat back, thinkin' \"we gon be straight\"\nJust gotta stay away from the fake\nIn the club, I done snuck in snub\nLet a goofy try to act like a thug\nLot of goofies tryna to act like thugs\nAll that hatin' nigga, ain't no love\nHad to fall back from a lot whole of stuff\nCatch him by himself, he ain't so tough\nNow you on the internet actin' tough\nI ain't gotta pay a nigga, they gon ride for none (for free)\nThey love they get from me, nigga, that's some\nKeep it real with my day ones and stuff\nA nigga say he don't fuck with me? That's some\nBut to me it ain't none\nI done seen niggas switch up for that cheddar\nEvery day we together\n\n[Chorus]\nFake love ain't gon get you nowhere (nah)\nStop that (stop that)\nFake love ain't gon get you nowhere (nah)\nStop that (stop that)\nAll that hatin' ain't gon get you nowhere\nStop that (stop that)\nPussy nigga actin' like they on some (on some)\nStop that (stop that)\nPussy nigga flexin' for these hoes (for these bitches)\nStop that (stop that)\nI'm gettin' money nigga, every day (every day)\nStop that (stop that)\nStop that (stop that)\nStop that\nStop that"}], "artist": "Lil Reese"}