{"artist": "YNW Melly", "songs": [{"image": "https://images.genius.com/8069f2884c77c4fe16b2dd68650f9e56.600x600x1.jpg", "year": "2019-02-08", "album": null, "lyrics": "[Intro]\nI know\nTell me now, no, oh-ohh\nLet me get n my Michael Jackson shit, 'cause really\nI'm hot as fuck in this jacket (Woah)\nGetting hotter than a bitch in here\nI ain't really with the shits, yeah bih\nShawty drunk as fuck, I think she did a beer\nI don't want that ho, she from last year\n\n[Chorus]\nGang, gang, gang, gang\nGang, gang, gang, gang (I ain't really with the shits, yeah bih)\nGang, gang, gang, gang, gang, gang\nYou know a nigga run that\nGang, gang, gang, gang, gang, gang\nYou know a nigga run that\nGang, gang, gang, gang, gang, gang\nYou know a nigga really\nSlime, slime, slime, slime, slime, slime\nYou know a nigga really\nRidin', ridin', ridin', ridin', ridin', ridin', ah\n\n[Verse]\nFuckboy get tucked in a muthafuckin' pamper\nLeave you shitted out, fuckboy, what's the answer?\nCalled them niggas but they ain't answer\nBallin' on niggas like I got bancer\nBallin' on niggas like I got cancer\nHoppin' on that dick, that lil' bitch, that name should be Prancer\nHoppin' on that dick, that lil' bitch, that should be a dancer\nShe don't wanna be a stripper so I cannot tip her, uh (Tip her)\nThick yellow bitch and she grabbin' on my zipper (On my zipper)\nCatch a pussy nigga, shoot 'em like I play for Clippers, uh (Clipper)\nOops, I meant the Blippers, baby girl, you know I'm slimy (Slatt)\nFuckin' on yo' thot, I'm like the Grinch, I'm super grimy (Slimy)\nSlimy, green, ooh yeah (Yeah)\nThink the bitch the Grinch, she keep eatin' on glass (Glass)\nFuck yo' thot and I won't go mad (Mad)\nYou love that bitch so much, you even ate the ass (The ass)\nHop in the coupe with my young slimes and then I spaz (Spaz)\nFuck on yo' thot, I'm from muhfuckin' Trinidad ('Nidad)\nI'm just playin', you know a nigga from the G (The G)\nI got racks, you know them bitches all on me\nAm I cute? Am I cute? Yay or nay? (Yay or nay?)\nEat that dick, drink it up, Gatorade (Gatorade)\nYo' nigga hatin', think he need some Haterade (So hard)\nFuckboy, I don't play no ace of spades (Go hard)\nI keep my weapon deployed (Oh)\nThey want the boy to be destroyed (Oh)\nFuckin' on yo' thot, I'm like, \"Ugh\" (Ugh)\nOn my heirs, she fuck on her, I'm a boss (Woah)\nI'm a rich skreet nigga, ya dig that?\nPull up on yo' ass, you get yo' wig snatched\nLike three bitches in the line fighting for, uh\nTracks (Slatt, slatt)\nTracks (Gang, gang)\nHoppin' out the coupe with the MAC (With the MAC)\nTell a pussy nigga back, back (Back up, back up)\nWait, tail a pussy nigga bike, bike (Bike, bike)\nBih ride on the dick just like a bike (Like a bike, man)\nI am not no motherfuckin' dyke (Fuck you, pussy)\nFuck that boy, I'll shoot up, why? (Why, why)\nHuh, I would take yo' mothafuckin' life (Take your life)\nShut the fuck up, you ain't take nobody life (No cap)\nAnd you know a nigga got a couple stripes (Strapped, strapped, strapped)\nPussy bitch, you know I like them egg whites (Energy)\nBig titties on the front of her chest (That back)\nBig titties, five bands I'll invest (I'll invest)\nFuckboy, put you in cardiac arrest (Arrest)\nYour heart broke, you can't even say yes (Yes)\nYour heart broke, you can't even say no (No)\nYou make me Melly pose (Woah, oh, ohh)", "title": "Gang"}]}