{"artist": "Watsky", "songs": [{"year": null, "lyrics": "[Verse 1]\nMy head's up in the sky it's higher than the clouds are\nI like to look up at the stars and wonder how far?\nFrom what I hear, about a billion babies are delivered\nEveryday and so it's like the planet is a clown car\nI know it probably shouldn't work, but we all fit\nLike a Micky D's Play Place ball pit.\nSo look at me! I'm about to jump up in it\nAnd be swimming through syringes like a motherfucking dolphin\nI could have an outburst. There's a lot of freaky people\nOn the planet and it makes me want to crowd surf\nEverybody, everywhere dig downwards\nThat's what we work for. Party at the Earth's core\nDon't know where to go to go far\nBut if I go then I know I should go hard\nAnd if I go and I never come back\nThen I'll send a post card and a couple thumb tacks\n\n[Hook]\nSaid I'm looking...\nI'm looking...\nI'm looking for energy everywhere\nI'm looking...\nI'm looking...\nI'm looking for energy\n\n[Verse 2]\nTeacher said this party started with a loud bang\nThe waymy ears are ringing I don't hear sound, man\nI'm steady looking at the crowd like a proud dad\nFor coming out instead of clicking on a mouse pad\nSteal a bounce-house. Fill it full of helium\nRide it like a blimp. I think that it'd be really fun\nTo do a triple flip in zero gravity\nWhile puffing on a Philly blunt and shooting stars with a BB gun\nTonight I'm looking at something that I've never seen before\nI might even paint graffiti on a meteor\nCause I can reach it, homie. Veni vidi vici\nIt's all peachy, got a vision of the future on a Ouija board\nDidn't believe it I, though it was CGI\nWhy don't you decide, if we're computerized?\nAssuming you and I - are alive\nAnd tomorrow is the rapture I wonder what you want to do tonight\n\n[Hook]\n\nI don't wanna. I don't wanna. I don't wanna. I don't wanna\nI don't wanna end up as an anybody-everybody\nIsn't anybody made of arteries and antibodies\nAnd you never get to see confetti without getting bloody\nIf you read ahead, you'd all be surprised\nSpoiler alert – we're all going to die\nBut I'll be hooping in the drive way in the clouds\nShooting fouls with that big orange ball in the sky\nWhen I die. When I say 'well I made it', I'll be way\nCelebrated, or remain as a staple\nIf I stay hella faded, then I'll fade, and my fate will be the same\nAs the fakers with the chains on the labels\nShame people do it for the fame and the cash\nNot the flame and the passion. I train through the pain\nAnd I frame every passage as a way to stay fit\nCause an 808 kick is my Gatorade drink", "image": "https://images.genius.com/15b416d55e0958076696e8b871573bd9.500x500x1.jpg", "album": "Nothing Like the First Time", "title": "$$"}]}