{"songs": [{"album": "Who Is Rickey Wayne", "image": "https://images.genius.com/4f017c2b44a3cb78851d3cf4f6828a71.500x500x1.jpg", "year": "2015-05-01", "title": "LowKey", "lyrics": "[Hook]\nGirl I know you really want to ride with me\nYou know that I ain’t tripping, got to be low key\nIt ain’t nobody’s business, it’s between you and me\nThey ain’t got to know girl, just be low key\nLow key, low key\nIt ain’t nobody’s business, it’s between you and me\nLow key, low key\nThey ain’t got to know girl, just be low key\n\n[Verse 1: T-Wayne]\nLow key, you know me\nIf you really bout it you gone have to show me\nThey was hating but you know they so weak\nSaid you got a man but he don’t come before me\nBaby what you got, I know what you looking for\nLove and affection plus more\nJust hit me on my line and I’ll be right at your door\nAin’t no competition, baby you know you a perfect score\nYou know what I been searching for\nAnd I been feeling the way that you down for me\nI was on the road, you stayed around for me\nDon’t worry if they ever judging you because you perfect to me\nIt ain’t nobody’s business so we got to be low key\nYou dig?\n\n[Hook]\nGirl I know you really want to ride with me\nYou know that I ain’t tripping, got to be low key\nIt ain’t nobody’s business, it’s between you and me\nThey ain’t got to know girl, just be low key\nLow key, low key\nIt ain’t nobody’s business, it’s between you and me\nLow key, low key\nThey ain’t got to know girl, just be low key\n\n[Verse 2: Lil JP]\nGirl I know you really want to ride with JP\nFrom that field where we don’t play no G A M Es\nI know you got a nigga but you know I’m tryna keep\nI heard you was a freak, yeah you know I’m tryna beat\nYou ride for a nigga, die for a nigga\nHis and hers, get fly with a nigga\nYou know I’m a player with the trial little nigga\nYou don’t need smoke, get high with a nigga\nWhen it’s time to run would you run with a nigga?\nWhen it come to drama would you kill for a nigga?\nHold that work, hold the pills for a nigga?\nGet pulled over, catch a case for a nigga?\nLooking for a rider, would you ride with me?\nHop up in the coupe, take a ride with me\nIf she got her own, she ain’t got to ride with me\nHit all of them tricks when she ride that dick\n\n[Hook]\nGirl I know you really want to ride with me\nYou know that I ain’t tripping, got to be low key\nIt ain’t nobody’s business, it’s between you and me\nThey ain’t got to know girl, just be low key\nLow key, low key\nIt ain’t nobody’s business, it’s between you and me\nLow key, low key\nThey ain’t got to know girl, just be low key"}], "artist": "T-Wayne"}