{"songs": [{"year": null, "album": null, "image": "https://s3.amazonaws.com/rapgenius/keith-murray-e1302009751237.jpg", "title": "How’s That (feat. Erick Sermon & Redman)", "lyrics": "Intro: Redman\n\nHuahhhhh!\nHa ha, ayyaah, owww owww\nFunked out, word is bond, word is bond\nThen you ayyyayyyah ha\nIn the mother, in the motherfuckin house\nWith a dick in your mouth\nWord is bond, word is bond\n\nVerse One: Erick Sermon\nI freak a technique Goin Way Back like Just-Ice\nAnd don't think twice because I'm nice\nI come from the Mothership unknown to man\nWith a blunt in my hand, a mic in the other hand\nGod damn I slam I jam like this\nSure nuff, my rap style is Cold Crush\nAnd plus, I tears the roof off the mothersucker\nMy brother, fly shit that makes Stevie Wonder\nHeyyyy, who can it be now watch out\nIt's the E live in 3-D with Keith and R-E-D\nI gets down for my troops\nAnd I ahh... get-it get-it get-it like Luke\nFor those, who don't believe my skills get these\nI got mad expertise, for all you duck MC's\nI'm funky like G Thing my nigga\nI wanna know who's up in here, before I pull the trigger\n\n(Is New York up in here? HELL YEAH\nIs Def Squad up in here? HELL YEAH\nIs NJ up in here? HELL YEAH\nThe Green Beret's up in here! HELL YEAH)\n\nVerse Two: Redman\nVerbally, I sew the brains up like Trapper\nJohn M.D. got nine millis made of lacquer\nCount Dracula, back with the, tow-truck with the\nGet Biz like Mark fuel-injected like Maximus\nMy style sicker than an AIDS victim drinkin forty-five malt liquors\nI roll the spliff up\nThe underground, slam, shock like Shazam\nCheck my Jams get Def when I kick Methods like Man\nComputerized Robocop sounds I drop in sequence\nFunky to death so ask that old bitch where the beef went\nWhen I do em, I glue em, stick em like Patrick Ewing\nMy shit bumps like Puerto Rican people moved in\nNext door, I get raw with the grrrahhhh!\nCall four-one-one cause I'm Ghetto Red Hot\nBo bo bo! Funk Doctor Spock catch a bruisin\nMy style gets respect fifty Muslims\nYou hang on strings like loose ends, with my hands on the nine\nWatch yo nugget bitch, I get busy with mines\n\n(How's that? (cause I gets busy with mines)\nHow's that? (cause I gets busy with mines)\nHow's that? (cause I gets busy with mines)\nHow's that? (cause I gets busy with mines\nIt's Keith Murray))\n\nVerse Three: Keith Murray\nI come rollin in when I see that low flow\nHeckuva foe, heard a gun and settled for a metaphor\nI'm naive between the sleeves of the sheets\nMurderin, who should ever try to fuck with me\nMurray word is bond gets it on\nAnd ready to blow any nigga out the cypher of the sniper hype at dawn\nLong live Def to the Squad\nAnd we smokin everybody out there, shit it ain't that hard\nI brings classic drama microphone enbalmer\nHave your momma beg behind bars for your kidneys tomorrow\nMy murderous apprentice E Dub\nMakes hard funk beats that I become part of\nWhen I be like A-E-I-O-U or battle\nNiggas be like who who who who who like night owls\nThe most beautifullest thing in this world\nIs I shitted, and y'all was with it dig it"}], "artist": "Keith Murray"}