{"artist": "Iamsu!", "songs": [{"title": "Eyes On Me", "lyrics": "[Hook: Rome Fortune]\nI've been smoking\nI've been drinking\nA little paranoid so I might be holin'\nUp all night like I'm sippin' on Folgers\nI don't really care if the whole world notice\nI got eyes on me, on me\nI got eyes on me, on me\nI got eyes on me, on me\nI got eyes on me, on me\n\n[Verse 1: Su!]\nLights on, lets rock\nOne night, on to the next stop\nSold out, turn up\nHot boy, every stage get burnt up\nShit crazy, now I'm solo\nEverywhere I go I see the Heart Break logo\nHands up, make 'em swang\nI just wanna do my thang\nMake the whole world claim HBK\n\n[Hook: Rome Fortune]\n\n[Verse 2: Show Banga]\nAll eyes on me when I come through\nI got your bitch and her friend, too\nShmop boy, hot boy, I got my city on\nIf it ain't about cake please just leave me 'lone\nI called 'em I showed 'em\nWent from local to global\nTrick, I came from the struggle\nMy whole team from the bubble\nOnly trill in my huddle\nAnd that's just how I keep it!\nOne of the nicest with this flow\nAnd oh and I just speak it, eh?\n\n[Verse 3: Dave Steezy]\nThey looking at me I'm not your 101\nI come through, get high with you\nShut it down, let 'em know wassup\nConverses 'bout women, tryin' to see where they be at\nYou know I put on for that area, the Bay we back\n[?Stacking bread, receiving head, get money fastly\nSwitchin' up the style\n\"Where I get it?\" Don't ask me\nPounds of the flavor\nMan, these joints give me ash me\nThe cameras keep flashing, I think that I'ma dab me\n\n[Hook: Rome Fortune]\n\n[Verse 4:]\nI'm the new kid, like some new threads\nAnd [?] said with the \"Who 'dat?\"\nAnd an ounce on my lip\nWhere's your camera\nNot a fan of the starin', uh\nMan, shoot the focus in your motherfucking lens\nYou die with my [?] right now, wow\nAt the round table with my nigga Su\nWe got them hoes tryna shoot a movie\nThat's a bit of Pow Wow\nAnticipate the crown\nBow on my [?]\n\n[Verse 5:]\nDon't pretend that you lyrics are on the fence\nWCW Title was really all [?]\n[?], boy, all my caters are calling me Rick\nMailing and telling them that I'm supposed to whip\nDifferent city, my zip code needed me more\n3rd period doin' states, you told us you'd be on tour\nJust notice that you been calling [?]\nMy life's been surround vision\nMy shooters just hit record\n\n[Hook: Rome Fortune]\n\n[Verse 6: Chris Miles]\nI got eyes on me\nGirl, that booty round like the iPhone 3\nI don't really talk just to stay low-key\nYou know it's HBK the Gang, T3MG\nI'm from the 631, that's my hometown\nIf you didn't know about me then, well you know it now\nYoung Danny Tanner at the venue got a Full House, wow\nTell the world that it's going down, Mr. Miles\n\n[Verse 7:]\nWord through the grape vine, on the break time\nGet the brace out of a pussy, let me get it break down\nAnd she dressin' like a [?], give a nigga shake down\nThrough smoked the Os up, all we got is [?] now\nBitch love it, niggas be like \"man, I think she love me\"\nGet her with the flex, got her own 50 shades now\nListenin' to [?], get her fit, 50 made now\nSchemin' 50 ways to get paid now\n\n[Hook: Rome Fortune]", "image": "https://images.rapgenius.com/e307ebb7eb875c0376aad492d503eabf.500x500x1.jpg", "album": null, "year": "2015-04-06"}]}