{"songs": [{"image": "https://images.genius.com/87ee57604e02647a0536025394b9daf2.300x169x1.jpg", "year": "2011-01-25", "title": "H.A.M (Heroes Amongst Men)", "album": null, "lyrics": "[Verse 1: XV]\nWell, here's ya favorite Martian\nBill Bixby, I'm lane switching and wheel twisting\nRubber burning, paper rolling, why y'all kill switching?\nAll about my capital, hold it down, shift keys\nMiss me, let’s see, I'm Dr Evil, I'd done ball forever\nTake it easy ‘cause these niggas will draw on whatever\nAnd rest in Peace to Aaron Hobson and the nigga ain’t violent\nBut I carry options ‘cause these niggas be wilding\nBelieve me bro, cold ass flow is three below\nAnd I got it made without a cleaning ho\nNo freestyle but this joint is a freebie yo\nI dead mic's, no CB4, I'm dead nice\nYou meanies Joe, where do all the heroes go?\nThe g-est thing about you is your email bro\nCC me with dough that you will forward and I reply with the details yo\nBut everything else is just considered spam\nThrow it in the can when I land ‘cause a nigga going ham\n\n[Hook]\nHeroes amongst men, hand me any mic\nBut have your army manned ‘cause you know I go ham\nHeroes amongst men, hand me any mic\nBut have your army manned ‘cause you know I go ham\nHeroes amongst men, high as a mountain while I'm flying by the fans\nGoing ham, heroes amongst men, yeah, that’s what I am\n\n[Verse 2: XV]\nSkinny denim jeans and a fitted low, brim action\nAll white vans, you would think that I'm kidnapping\nLyrics cut deeper than my blades in my hands wrapping\nCall that flow Hugh Jackman back when I was boom bapping\nShawty came to say is you moving ’cause you packing?\nWhat we need to go ham? A handy cam, a few napkins\nDon’t go slower than dancing to a ballad\nUp in chains like Alice, getting dressed up by a stylist\nAnd Mr. Chows giving my order, the whores who doubt it\nLike I heard you blowing up, Vizzy tell me all about it\nWell I got a Caesar, hit a thousand islands and blue cheese\nCan you please at least put some dressing on my salad?\nConfess and someone tell Clark Kent I'm ‘bout to steal his frames\nFlash Gordon shoes and Professor X's plane\nDare Devil sunglasses, Spider-Man first week is what I'm trying to do\nWhen I hit the streets ‘cause my album go ham\n\n[Hook]\n\n[Verse 3: XV]\nYeah, Year of the Squarian, zeroes that's prepared to win\nHeroes we keep burying, burn up the charts, this is Nero on the violin\nBetting on X is like seeing the whole card deck before buying in\nSo get your money up, the new cat that be running rap was like a runner up\nGuess directions fucked him up, I'm four words that make you\nBring the track backwards on my tape and repped him in\nSo heavy that no other sideways so 316′s up but I be 619′ing\nCome off the top then grab the pen and the crowd is wilding\nI make them stand from the floor to the stands\nNo matter where I am, I promise fam, I'mma go ham\n\n[Hook]"}], "artist": "XV"}