{"artist": "G-Dep", "songs": [{"title": "Let’s Get It (feat. P. Diddy & Black Rob)", "album": null, "year": null, "image": "https://images.genius.com/e809032be49dc1abed1b3b49bf50e014.620x400x1.jpg", "lyrics": "[Black Rob - almost mumbling]\nThey said that I'm a Rottweiler\nAnd I'm from the Rottweiler house, the Rottweiler New York\n\n[G-Dep]\nReally, get smacked silly, you get smacked silly\nFucking with these niggas from the, what you gon' do\nWhen you ready? Shit I was born ready\nAnd I was already on fish and spaghetti\nCreep with the culture, rap I can coach ya\nAttack like a vulture, see what I told ya?\nSaid I'd get'cha, wear it if it fit ya\nY'all thirteen inches, I see the big picture\nIf it's to get richer, I'd probably get wit ya\nIf not burn it, get hot like a furnace\nShoot the video, motherfuck city permits\nWe own the city, on the phone with Diddy (*phone sounds*)\nRed bone pretty, when she get aroused\nLike to suck her own titty; put it in the video\nYa want to holla got to follow nigga here we go\nGet you ticket, the train, don't miss it\nWon't reach out, and ya bet I won't visit\n'til my whole wardrobe is-it, now listen\n\n(Chorus)\nMake this money, take this money (Let's get it)\nAin't no way you can take this from me (Let's get it)\nAin't shit funny (uh) shake it honey (Let's get it)\nTake it money.. now let's get it (Let's get it)\n\n[G-Dep]\nCreep with your people\nThough my shit is Sweet and Low it's no Equal\nFront but you lookin\nOnce I throw the hook in proceed to get cookin\nWith the game when I sewed it\nSince you came thought I owed you one\nWide big Lincoln, why's this guy on the side for the stinking?\nWatch task force dash forward lookin marveled\nIt's a big chance, big pants, might guard him\nWith my man's type proper\nBetter learn quick, cause my clique don't argue\nYou ain't my crew, who are you? Beat it\n'fore we take off make sure you all seated\nIn Billboard read it, believe it\n\n(Chorus)\n[G-Dep]\nSoul Controller, rap Ayatollah\nKids hate me when they older I put cracks by the stroller\nI'm registered voter, motherfuck a quota\nGive some bakin soda and a quarter\nBet I flow straight up out the water\nI'ma wreck the game 'til it say \"out of order\"\nPut the high score up\nThen tear the floor up\nOn the world tour with your whore out in Europe\nHead on the tour bus\nDo what them niggas in the drop thinks cooler\nCalled up five reporters to thank my supporters\nHittin wives and daughters\nBrought 'em neck spray from Estee Lauders\nCall Puffy to order\n\n[P-Diddy]\nAiyyo, call me Diddy - I run this city\nSend the cops, the D.A. and feds to come get me\nCats want to leave me for dead you comin with me\nGettin head in the Bentley red at one fifty\nStraight lose it, love two things my family my music\nMight co-write and produce it\nDrop mine, hot 9 exclusive\nGot y'all Hawkin like Yusef\nCause I can, break backs and stacks it's no problem\nMake raps and tracks and go Harlem\nI get worldwide coverage\nGot so many spots I don't even buy luggage, ya love it\nMake moves major, hide out in Asia\nIf your girl keep comin around them I'm a blaze her\nI'm the Bad Boy flavor, light blue gators\nNOT GUILTY, and I'm filthy, c'mon\n\n(Chorus)\n[Black Rob (Puffy)]\nI be the Eastside Soprano, Rob Marciano\nFlow in e'ry channel with the Iverson handle\nForty-five sparks turn your day gray flannel\nSnatch the yay of the mantle, then proceed to dismantle\nCan't slay Rob\nHow many niggas done tried to play Rob, quit they day job\nTired of putting broke niggas under the wing\nIf I go to jail again I'm goin under the bing\nAct like you gon' pull that thing thing\nYou the only one that always get stuck for bling bling\nI represent \"A\" block in Sing Sing\nAlmost caught a buck fifty for fuckin a Latin King's queen\nMoves for paper, booze no chaser\nBullets out the blazer four-fifth with the laser\nCome and get your shit splitted, newspapers said I did it\n(He ain't do it) Now let's get it (Let's get it)\n\n(Chorus) (x3)"}]}