{"songs": [{"title": "Rough Rugged & Raw", "album": "Necessary Roughness", "year": "1997-06-24", "image": "https://images.genius.com/8a8ce5a8496c3ddac8a601ced134030b.600x600x1.jpg", "lyrics": "[Snoop]\nRage... what does that word mean, Rage?\nOut-Rage-ous, vindictive... conspicuous\nAll about it, got to have it\nThe big bo-ty girl\n\n[Rage & Daz together]\nYou don't know what you in store for\nRough, rugged, and raw (raw hardcore)\nRough, rugged, and raw (raw)\n\n[Snoop, trading off with Rage]\nHey yo Robin (whassup?) I feel like squabbin (what?)\nAnd if you wit me (uh-huh) I know that you're mobbin (c'mon)\nIt ain't no thang (uh-uh) it ain't no problem\n(And if it was?) Mmm, I know that we could solve em\n\n[Daz & Rage together]\nYeah, rough (rugged and raw)\nRugged (rough, rugged, and raw\nHard-core (rough, rugged, and raw)\nRugged (rough, rugged, and raw)\n\n[Dat Nigga Daz]\nAhh, kick shit off so tight, kick rhymes\nI kick real shit when I recite\nThe poetry lethal as ?Moe Brown?\nI got you hoppin with a new sound\nDat Nigga Daz showin up to put it down\nWho's the example, who tried to come and make my fear\nMC's come around and kick the shit that's real\nKnowhatImean? Get steamed, the pressure in, to the extreme\nIt ain't a dream, real shit from real MC's\nI can't complain or explain it I run you over like a train\nBang and hang, box rhyme skate, then swang\nIt ain't a thang, cover quarter artificial rappers\nB-boys and MC's, what's happenin\nCheck it, tell me, nuthin could save ya\nYou better watch out, cause nuthin could save ya\nI blast you lay you down surround you with the hypnotical sound\nThe Lady of Rage and the Pound for life\nI keep it underground, no matter where I'm from\nI keep it real with a sound, you better watch it\nFor the battleground, for instance, I spray your\nWhole god damn crew put you out of commission, fool listen\nWise up and pay attention, and take heed\nTil you get driven, into the floor\nUntil you don't want no more, I can't stop repeatedly\nYou heard shots (pop pop pop) turn on the six o'clock\nAnd who'd you see, who I popped, is it you? Or is it him?\nIs it one of your parents, is it your friend?\n\n[Rage & Daz]\nRough, rugged, and raw (hardcore)\nRough, rugged, and raw, hah (hardcore)\nRough, rugged, and raw (hardcore)\nRough, rugged, and raw\n\n[The Lady of Rage]\nNow check this\nThe key in the game is to be in the game\nIt's all about the fortune, motherfuck the game\nIt's not the same, I ain't tryin to make me no names\nLive on stage, it's the Lady of Rage, I don't\nFollow no fads, the Lady of Rage is bad\nBad down to the marrow keep your eyes on the sparrow\nPure raw rough rugged and hardcore, Robin's on the soar\nThe deadliest to take flight\nThe bomb rhyme condor, rhyme conniseur in my castle\nYou don't want no hastle, you don't wanna battle\nSkeedaddle, be on your merry way (cause what?)\nCause on this very day you're Going Down like Mary J\nWhip you like cream it's the cream of the crop, the top notch\nTo win the wars without tecs and Glocks, Rage rocks\nAlways and forever to the casket bruh\nAll up in that ass til you had enough\n\n[Snoop Doggy Dogg]\nCause she's the queen of the hip-hop game, you know her name\nShe sent on a mission so I gots to handle things\nI can't let her down, I gots to represent the Pound\nWith the hardco' rough rugged, for yo' nugget\nYou love it, you dug it\nThe shit on tape young nigga, so hurry up and dub it\nHey yo Robin (whassup?) I feel like squabbin (what?)\nSo if you're wit me (uh-huh) I know that you're mobbin (c'mon)\nIt ain't no thing (uh-huh) it ain't no problem (uhh, and if it was)\nUhh, you know that we could solve em\n\n[The Lady of Rage]\nNow everytime I step into a room, KA-BOOM!!\nHere comes the heavyweight masha, in any shape form or fashion\nRip the roof off the mother kick the frame out this fucker (hayyyy!)\nCause Rage shit, pops with extra butter\nHotter than the 4th of July, I tell you no lie\nTil the, uhh, day I die, I be fly Robin fly\nSmackin with the swiftness, witness this comin\nI'm wipin suckers out, so you can call me ahh the clean up woman\nBut I gots, better things to do like making, cheddar with my crew\nLike shaking and baking rookies like cookies and umm veterans too\nI got beaucoup flow, who you know that can go toe to toe\nI'm the heavyweight champ, hah, you'll get stamped\nSend it, I'm hittin hard enough to dent this, I'm relentless\nI leave your whole camp tentless, so bow down in repentance\nOr pay the Price like Vincent, smack that ass like infants\nPeriod end of sentence, this is how I end this, hayyyY!\nBreak it down"}], "artist": "The Lady of Rage"}