{"songs": [{"year": "2015-05-25", "title": "Red Rag, Blue Rag", "image": "https://images.genius.com/38af6f15c4c3af0551bde5b9ee778d6e.889x889x1.jpg", "lyrics": "[Verse 1 : Yung Booke]\nI Be in the jungle with the Lions and gorillas\nGive me a butter knife i bet I make them chinchillas\nFuck you got that pistol? You ain't even kin to no killer\nAll my niggas banging throwing up signs in there pictures\nPopping percs got 10 cups, tryna get my bitch friend to fuck\nHop out bust a nigga then what, you better not flee chuck ya chin up\nWhere I'm from retaliation is a must, 40 Clip longer then a bus\nTurn ya Women Crush into a Slut\nBooke steph Curry in a Clutch, who the fuck said they want war with us?\n90 Set all I know is 21 Montana murder shit for fun\nThey just sit around and waiting getting some\nYou a hoe you talk too crazy you gong six 30\nShouldn't let a fuck nigga walk, now they investigate\n\n[Hook: 21 Savage]\nRed Rag, Blue Rag, Nigga what ya banging?\nI pour me up a 4 and then I pop me a xanny\nHate to break the News, Your Favorite Rapper is a Faggot\nAnd ever since a youngin i been motherfucking trappin\nI pull up in a Fisker  and your bitch gonna drop them panties\nI ran off from my plug and then I went and bought a mansion\nSaid you know 21 like bitch you know we havin\nMiss me with that sucka shit I’m not your baby daddy\n\n[Verse 2 : Freaky D$MG]\nDedication to my situation\nGot me concentrating on my transformation\nMaking preparations for some bigger shit\nI wany the destination to them figures bitch\nJust trynna get it hoe I gotta have it\nTell me how run and get some\nThat a savage nigga for the money\nMet up with another savage\nWith a funny way of always have shit\nJust the confirmation of always having shit\nHow we offing niggas swear we offing niggas\nNiggas ain't talking smoke but we coughing niggas\nSee this tragic nigga never magic nigga\nHow we make a nigga disappear\nWhen niggas make mistakes\nTry to interfear the shit\nDon’t let me overhear you coming over here\nI be the volunteer to finish your career\n(I put that shit on my set set set)\nYou fuck with my niggas we going gorillas\nHoe we at your neck\nIm killimg niggas that’s my only hope\nGot 21 hundred niggas\nThat’ll murdaa every nigga you know)\n\n[Hook: 21 Savage]\nRed Rag, Blue Rag, Nigga what ya banging?\nI pour me up a 4 and then I pop me a xanny\nHate to break the News, Your Favorite Rapper is a Faggot\nAnd ever since a youngin i been motherfucking trappin\nI pull up in a [?]  and your bitch gonna drop them panties\nI ran off from my plug and then i went and bought a mansion\nSaid you know 21 like bitch you know we havin\nMiss me with that sucka shit I’m not your baby daddy\n\n[Verse 3: 21 Savage]\nRan off on my plug , and then went and bought a mansion\nI just poured a 4, i swear it taste like cotton candy\nThought he had a brick, he bust it open and it was plastic\nYeah im with that taking shit, Cause bitch im bout that action\nI pull up in that Aston [?] Jackson bitch im flexing\nRun off with ya money I'll be gone in 60 seconds\nBitch I'm on the Percocets about to lose my breath\nPlayers in my sections, pussy nigga get the stepping\nBitch you know I'm Blood, but i still be with them 60s\nAll these Hoes love a young nigga cause im dripping\nI got Gas bags 33, Scotty Pippin\nI'm on papers I can't smoke with you\nI'm Geeking like a hippie\n\n[Hook: 21 Savage]\nRed Rag, Blue Rag, Nigga what ya banging?\nI pour me up a 4 and then I pop me a xanny\nHate to break the News, Your Favorite Rapper is a Faggot\nAnd ever since a youngin i been motherfucking trappin\nI pull up in a Fisker]  and your bitch gonna drop them panties\nI ran off from my plug and then i went and bought a mansion\nSaid you know 21 like bitch you know we havin\nMiss me with that sucka shit I’m not your baby daddy", "album": null}], "artist": "21 Savage"}