{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "Bobby & Whitney", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "[Verse 1: Pimp C]\nI know you hoes on a mission to steal my dick\nBut Pimp Chad ain't goin for the Georgia, bitch (Georgia, bitch!)\nIt wasn't nuttin when I saw ya bitch (saw ya bitch!)\nShe knew that I was on some millionaire shit\nEverythang I say is the truth (is the truth!)\nI need five funky hoes for one prostitute\nJust cause you sell pussy don't make you certified\nYou ain't in it to win it, I can see it in yo' eyes\nWWW dot, \"Wonder why I'm quickly gettin exposed\"\nBreakin tricks for they money like a female is supposed ('posed!)\nI'm out in Neptune, on some Space Age shit\nAll my diamonds got paper, Emmitt keeping me legit ('git!)\nWhen the welfare was over, I be sellin cocaine ('caine!)\nI'm out in Las Vegas, takin over bitches' brains (brains!)\nTony Snow don't sniff no blow (sniff no blow!)\nPimp hard on a cracker but I love me a crow (love me a crow!)\n\n[Hook: Pimp C] - repeat 2X\nI gotta big truck on some big rims\nI get my dick sucked, when I pull out the Bent'\nThese hoes jockin me, they wanna ride with me\nThey gotta be down ho! Like Bobby Brown and Whitney\n\n[Verse 2: 8 Ball]\nLife is a game of inches\nYou move up little by little to the fame and riches\nLife be a game and a broad of visions\nSome niggas is hoes and all women ain't bitches\nAnd your reach? Keep the heat near\nGames, I don't play , I'm tryna make it clear\nYou don't hear me nigga? Open up ya ears\nIf you movin too fast, slow down and switch gears\nP.A. somethin, ya life give ya nothin\nThe streets ain't pokin, you can get shot bluffin\nCash rule everythang, keep that on ya brain\nGet rich quick, let pimpin do the blame\nMidnight blue with the peanut butter guts\nChrome on my feet and bump in the trunk\nBall cap popped up, raised to the back\nKush in my rillo, rollin big like Shaq\n\n[Hook] - repeat 2X\n\n[Verse 3: MJG]\nI'mma pimp, sellin hoes to a chick on the track\nMake my money, bend her or over, slap the dick on the back\nThey call me M (Jayyy!!!) G, I'm the man in charge\nIf you read this application, you'll change ya job\nI gotta order motherfuckin rappers, teachers, preachers, and athletes\nAll make a personal visit or to the backstreets\nI even gotta ho, play away\nWith one rule, 'til ya gray, nigga stay away\nSee I'm the reason why ya letcha girl stay at the house\nAnd beat her up cause my name couldn't stay out her mouth\nAnd I don't need to know if she just wanna join the team\nGet down and kiss all my royal marines\nI keep a Cadillac and I select a few in my car\nIf you don't own one, then you ain't got shit in ya garage\nI go hard, you motherfuckas ain't breakin a ho\nYou just flyin bitches in, showcasing a ho\n\n[Hook] - repeat 2X", "year": "2006-07-11"}]}