{"artist": "Westside Gunn", "songs": [{"year": "2015-05-06", "lyrics": "[Intro]\nSo there's no use in asking\nYour point of view [x2]\n\n[Verse 1: Westside Gunn]\nAye yo, the drop pair cherry red\nRed bottoms, Mack Elev, we will clap your head\nMedusa head locs, loft kitchen reek of coke\nCocaine Carreras, parlayin'  me and Sos\nBricks for what? Get ten of 'em\nGet Killa Tone a Bushmaster, he'll flip somethin'\nBig chains on, I'm lookin' rich\nBust the duct tape, it smelled like piss\nKTZ sweatsuit down to the kicks\nStepped on the dope twice\nAll black oyster, P roll with the pink ice\nMink white, 50 shots before he can blink twice\nGot his brains leanin' to the side like some cheap Nikes\nEasy come, easy go, wack him for his Yeezy 1's\nEazy-E Raider snap back that match the joints\nLookin' like Schoeder kid, hold up\nMix the cryonite with the China white, bet my niggas blow up\n\n[Hook]\nRolls Royce rolled up\nThat nigga did 20 flat, nigga so what?\nWe them new niggas hangin' out the roof, the truth\nMix the Pérignon with the grapefruit\n\n[Verse 2: Westside Gunn]\nMoschino gloves on the hammer\nShot his man up at Barney's choppin' grams up\nWorld premiere, hang that nigga from the lid\nRocks clear, choppers swingin' from the chandelier\nThe flyest nigga on this mic, shit, I swear\nWhen I got my first brick I dropped tears\n12-12 A resumes with cooked flake\nI was fucked up, I got a back off of big gate\nAdolf Versace plates\nMalcolm X Prada frames analyze the snakes\nHuman made joggers cuz they sweatin' me\nIt's got an apron on flexin' the recipe\nAll this gold on might be the death of me\nThe six kilo Cuban link especially\nCoke on my sweatshirt like Heavy D\nChanel mask on baggin' heavy D\n\n[Hook]\nRolls Royce rolled up\nThat nigga did 20 flat, nigga so what?\nWe them new niggas hangin' out the roof, the truth\nMix the Pérignon with the grapefruit\n\n[Interlude]\nSo what have you got for me?\n\nJohn Doe. Between 25-30 years of age. Cause of death looks like OG\n\nOver gold. Any signs of foul play, Ronnie?\n\nNo, sir. Looks like a case of just too many gold chains", "image": "https://images.rapgenius.com/b98d2055fb8e5a2028bbd05d0a04d9fd.1000x998x1.jpg", "album": "Hitler Wears Hermes II", "title": "City, Sos & Me"}]}