{"artist": "E-40", "songs": [{"title": "Catch a Fade", "image": "https://images.genius.com/7da108e257a86c75f207873e9454a951.500x500x1.jpg", "album": "The Block Brochure: Welcome to the Soil 3", "year": "2012-03-26", "lyrics": "[Chorus: Kendrick Lamar]\nJumping off the front porch with a new approach\nDon't approach me with the bullshit\nI remote to a location where the broom sit\nHere I go street sweeper Monday through Friday\nIf not go we can catch a fade, catch a fade, catch a fade\nCatch a fade, catch a fade, catch a fade, catch a fade\n\n[Verse 1: Kendrick Lamar]\nPulling up and hopping out\nShell, catch it poppin' out\nAnd I ain't never been a Tom or a Jerry\nPussy or a Rat, pussy on my nutsack\nCarry plenty Kenny tats, give me that, give me plenty fetti\nFederales on my back, pack them in the cemetery\nSend a scary hit out on your messenger\nI'm ignorant to wrestle a gorilla in the center of an Acura Integra\nI'm pissed off, so I piss off rooftops\nDrinking through a straw, fuck a rent-a-cop\nI'm hot, I'm napalm when the beat slap like eight palms\nAnd I wear eight charms, every airport alarm\nGo off till they tackle me, what I do wrong?\nNigga it ain't 'bout the chain, nigga you the fucking bomb\nBomb on a bitch nigga then his bitch later\nPut the tips on the bitch, nigga you a fucking waiter\nI don't even want a favor, I just want a fair one\nAnd it's like that till the sheriffs come\n\n[Chorus: Kendrick Lamar]\nJumping off the front porch with a new approach\nDon't approach me with the bullshit\nI remote to a location where the broom sit\nHere I go street sweeper Monday through Friday\nIf not go we can catch a fade, catch a fade, catch a fade\nCatch a fade, catch a fade, catch a fade, catch a fade\n\n[Verse 2: Droop-E]\nDroop-E, look\nProblems we solve them, 'bout that action\nOne less sucker nigga, that's subtraction\nHis boss is, factors on the team\nReal niggas, no actors on the team\nNot you, who Droop? He a good dude\nPut him in a bad mood, he turn you into goon food\nI'm in the party, feeling like me\nS-I-C-K with TDE\nYour bitch want sex and my ear like wax\nAnd this Landy got her ready to get it hit from the back\nShe shows up chump, salute give daps\nGet your face flat, you don't want that\nGet your nose tapped, you don't want that\nGet your life fucked up all over a batch\nGet cropped, get chopped on your head like a barber shop\nHave it out in the parking lot\n\n[Chorus: Kendrick Lamar]\nJumping off the front porch with a new approach\nDon't approach me with the bullshit\nI remote to a location where the broom sit\nHere I go street sweeper Monday through Friday\nIf not go we can catch a fade, catch a fade, catch a fade\nCatch a fade, catch a fade, catch a fade, catch a fade\n\n[Verse 3: E-40]\nStay turned, super charged up, stoned\nGhetto pass never revoked\nMouthpiece faster than a speedboat\nKeep it one hundred like a C-note, pea coat\nPo-po tryna decode lingo\nNot drunk but I'm finna be hella twisted\nLifted like a toilet seat, grown ass kid\nMy bitch always telling me, I ain't shit\nShe hate me, but she love my dick\nTrapper factor macker having money like a rapper\nBumping local talent pulling up with the blabber\nPatna wanna challenge 'cause my pockets hella fatter\nBut he gone be unlucky like walking under a ladder\nPut hands on a man, fuck unity\nAin't nothing between us, but space and opportunity\nNever been a sucker, never been a lame\nStay in your lane, you can't see me like a stealth plane\n\n[Chorus: Kendrick Lamar]\nJumping off the front porch with a new approach\nDon't approach me with the bullshit\nI remote to a location where the broom sit\nHere I go street sweeper Monday through Friday\nIf not go we can catch a fade, catch a fade, catch a fade\nCatch a fade, catch a fade, catch a fade, catch a fade\n\n[Outro]\nWhere you from Droop-E? (The West)\nWhere you from Kendrick? (The West)\nAye 40 where you from though? (The West)\nWho bring it to their front door? (The West)\nAnd where they get their game from? (The West)\nAnd where they get their slang from? (The West)\nAnd where they get their strains from? (The West)\nAnd where they get their grapes from? (The West)"}]}