{"songs": [{"image": "https://images.genius.com/8a6d212c44ae5c3db53de0e693e5dba7.1000x1000x1.jpg", "lyrics": "[Hook: U-God (MC Eiht)]\nI'm a bonified g, g, g, g, g, g (Chea, chea, chea, chea)\nI'm a bonified g, g, g, g, g (Chea, chea, chea, chea, come on)\nI'm a bonified g, g, g, g (Where ya at? East coast, west coast)\nVicious, vicious, viciously (come on!)\n\n[Chorus: U-God]\nGet down, get down, brah', I'm in your town, brah'\nThat's how we do it, I'm a stone cold rider\nAnd now, I bust a round off, I'm a survivor\nThis is how we do it, for you snake ass conivers around\n\n[Boo Kapone]\nFor you conivers, bust a round\nLook around, lay ass down with the fo' pound\nShady spots for eighty blocks\nI keep a bitch eyes closed like Jamie Foxx\nOff the chain, niggas saw I'm off the chain\nNigga, stay in ya lane, so I'm off your face\nIt don't stop, I'm on the block\nLickin' shots, with the twelve gauge\nHit a nigga up, have you rapping for the front page\n\n[Chorus]\n\n[Squeak Ru]\nWhen them 24's park, them big dogs bark\nYou don't wanna get down when them big dogs start\nMoving through the crowd, making Glocks get loud\nLettin' suckers know we'll take yo town\nFlip a little ass, stack a little cash\nQuick on the smash, I'm always on the smash\nWhat these niggas gon' do with the Wu and the Ru\nThem Timbs and them chucks, gon' put it on them dudes\n\n[Chorus]\n\n[U-God]\nI'm down for the get down, earnin' my stripes\nHillside, real guys, burn burners for life\nPut slugs through yo vest, or blood on my knife\nYo I'm up in here, where it at? Throw the dice\nThe chrome device, still layin' on my hip\nLettin' my nuts swing, we bang for the strip\nI'm up in this bitch, I bounce around the west coast\nHollerin' at hoes, lookin' for the best smoke\n\n[Chorus]\n\n[MC Eiht]\nI'm a gangsta-gangsta brah', straight up menace\nAnd I don't stop shootin' til the clip is finished\nYa'll ain't heard about me, still a boy in the hood\nAK in the trunk, brah', it's all good\nOne time try to gaffle, the work, no hassle\nC.P.T., kingpin of the castle\nIt's Compton, you see the bulge in the waist\nT-shirt go up, y'all about face, chea\n\n[Chorus]\n\n[Hook w/o MC Eiht]", "title": "Get Down", "year": null, "album": "Mr. Xcitement"}], "artist": "U-God"}