{"songs": [{"album": "Revenge of the Dreamers ", "year": "2014-01-28", "title": "Crooked Smile (Original)", "image": "https://images.genius.com/a672d085777f459db6e18f274036a084.500x450x1.jpg", "lyrics": "[Verse 1]\nThey tell me I should fix my grill cause I got money now\nI ain't gon' sit around and front like I ain't thought about it\nA perfect smile is more appealing but it's funny how\nMy shit is crooked look at how far I done got without it\nI keep my twisted grill, just to show the kids it's real\nWe ain't picture perfect but we worth the picture still\nI got smart, I got rich, and I got bitches still\nAnd they all look like my eyebrows: thick as hell\nLove yourself, girl, or nobody will\nOh, you a woman? I don't know how you deal\nWith all the pressure to look impressive and go out in heels\nI feel for you\nKilling yourself to find a man that'll kill for you\nYou wake up, put makeup on\nStare in the mirror but its clear that you can’t face what’s wrong\nNo need to fix what God already put his paint brush on\nYour roommate yelling, \"Why you gotta take so long?\"\nWhat it's like to have a crooked smile\n\n[Chorus]\nA crooked smile\nA crooked smile\nThis crooked smile\n\n[Verse 2]\nListen\nI got a story for ya, when I was seventeen\nI had a name, was far from lame and that meant everything\nI hit the club with my nigga Ced. ain't nuttin' new\nBut on this particular night that we was coming through\nNiggas was on the stage, battlin' babblin'\nGoing nowhere, I figured, \"Fuck it, there's a couple hoes here\"\nI might as well sign up and climbed up the stage\nI went first, I kicked my verse, spit like a lion out the cage\nThe crowd feeling my rage, I aired the nigga\nTossed the mic right to 'em like I dared the nigga\nThought I scared the nigga, DJ started the beat\nHis heart started to beat fast, the part of defeat\nThe nigga verse was weak, that is until he said this\n\"You ain't So So Def, your teeth just got Jagged Edges\"\nDamn, that was the dagger that killed my swagger\nI never hit that stage again, I begged my mom for braces, then I had a\n\n[Chorus]\nCrooked smile\nA crooked smile\nA crooked smile\nA crooked smile\n\n[Verse 3]\nGrowing up was just a young knucklehead running wild\nMomma youngest, e'erybody knew I was the problem child\nFront teeth missing in my smile, snaggletooth nigga for a while\nLiftin' up my pillow, tooth fairy never came around\nDamn, we was po', but I ain't know\nMouth open at the mirror daily, look and wonder how my teeth'll grow\nThey came slow and out of line, I couldn't comprehend\nThe significance at the time, this crooked smile\nWas just another sign saying life ain't fair\nSome niggas had the perfect smile with the nice wave hair\nOh yeah, remember Brandy? Loved her like candy\nShe went with my nigga, Sosa, I was scared to approach her\nThat nigga had the fresh new gear, J's drop\nHe got a fresh new pair, and there I was with hand-me-downs\nTurn into the class clown, teachers couldn't stand me now\nDefense mechanism, lookin' for attention\n\n[Chorus]\nWith this crooked smile\nThis crooked smile\nThis crooked smile\nThis crooked smile\n\n[Outro]\n\"Crooked Smile\". You know what it is. This is for those that's—that's not picture perfect, but we still worth the picture, you know? As I sit here and sip this Corona. Ayy, shout out to Brandy, man. I—I still got love for ya. I'll never forget, we was in the fifth grade, maybe it was later than that, but remember we was at the [?] we had the orchestra thing and you told—you told a white girl, you told her to tell me that if I went and got some braces that you would go out with a nigga [?] shit. Ah, those were the days. I still got love for ya. You know shit like that made a nigga tough"}], "artist": "J. Cole"}