{"songs": [{"image": "https://images.genius.com/a69b6ff9152c67baee9402cf5ffdff26.1000x1000x1.jpg", "title": "6969", "album": "Attitude City", "year": "2015-07-17", "lyrics": "Part I: Prologue\n\n[Narrator] Somewhere deep in the slow, eternal dance of the heavens drifts a planet called simply \"Earth\"\nAnd among the otherwise unremarkable population of this planet are two incredible heroes, destined to save the future from itself\n\n[Danny Sexbang] Hey Ninja Brian, I made a time machine spaceship. You... wanna go on it?\n[Ninja Brian] ...\n[Dan] Yeah, okay cool\n\nPart II: A Rainbow Of Time\n\nSoaring through the galaxy, the stars and sky align\nThe speed of light's for pussies; we're going at the speed of Brian\nFlying towards the sexual peak of history and time\nComputer, set a sexy course for the sexiest year\n(UHN!)\n\nSixty-nine\nSixty-nine\n(Sixty-nine) I've got my space suit\n(Sixty-nine) And ninety pounds of space lube\n\nCrossing through into a fuckin' worm hole beyond the Milky Way\nThat shit's far\nTo a time on Earth so far into the future where everyone gets laid\nTwice as hard\nWe're noble knights of honor on a fierce and sultry butt crusade\nHere we are!\n\nOpen the bay doors and let's live the dream\nGive the world a double team\nI bet it's a billion person orgy in an ocean of whipped cream\n\nWait, this place isn't sexy at all!\nAnd this robot sign says human touch has been outlawed\n\nI can't believe my eyes, but it's a world without sex\nEveryone here just wears full length pants and loose fitting turtlenecks\nMen and women wave to each other from a respectable distance\nWithout the thrill of boning, what is life?\nWe must speak to the Council of Dick Elders tonight\n\nPart III: To Sleep, Perchance To Cream\n\n[Dan] Excuse me, Dick Elders?\n[Dick Elder Michael Starr] What do you want?\n[Dan] I know it's most unusual to come before you so\nBut the planet Earth sucks balls now that no one's allowed to bone\nWe've come from the past to introduce you to ass\n[Dick Elder] Wait! You're Ninja Sex Party! You will ruin our plans!\nGuards! Sound the alarms!\nIf people have sex, they’ll break our thousand-year spell\nThere will be a revolution, and they'll think for themselves\nWe control this planet of unsatisfied wood\nWhy does being evil always feel so damn good?\n\n[Dan] Fuck that bullshit, we'll make it right\nGet ready for a sexy fight\nMy dick's the spark of hope and a revolution shall ignite (tonight)\nWe're taking flight, we have to find a girl\n[Dick Elder] Shoot the fucking lasers!\nShoot the fucking lasers at 'em!\n[Dan] Show her what it means to love, and fix this broken world\n[Dick Elder] All the fuckin lasers!\nAll the fuckin lasers at 'em!\n[Dan] A new sex king will rule; let the boner banners be unfurled\n\n[Dan] Ninja Brian, look at that girl with the sad eyes and the beautiful blonde hair. I'm immediately in love!\n\n(Sixty-nine) She spent her life all alone\n(Sixty-nine) Wanna take her to the bone zone\n(Sixty-nine) Make her feel the pleasure\n(Sixty-nine) Of my naughty treasures\n\nPart IV: Grand Reckoning At The Castle Of Infinity\n\nI can't believe my eyes, but you're the girl of my dreams\nLet's both tear all of our clothes off like two pants-hating wolverines\nThe love we make will save the Earth from this oppressive dick regime\n\nWe're having sex now\nTo change the world!\nYou brought three friends now\nOh shit, they're girls!\n\nI think it's obvious that people liked our sexy show\nMulti-billion person orgy has broken out all across the globe\nThe human race, much like my junk, will now be free to grow\n\nBut what about the Elders?\nWe tore their world to shreds\nMaybe they'll be cool with it\nOh hey, Dick Elders! How's it goin'?\n\n[Dick Elder] You two are fucking dead!\n\n[Dan] So much for that, it's time to put on pants\nAnd run away from their Death Army which is starting to advance\n[Dick Elder] Shoot the fuckin' lasers!\nWay more fuckin' lasers at 'em!\n[Dan] We can't die, we are way too young\nAnd there are so many girls to ball\n[Dick Elder] Shoot the fuckin' lasers!\nWay more fuckin' lasers at 'em!\n[Dan] But now we're cornered with our backs against the wall!\n\n[Dick Elder] It's over, Danny Sexbang! Your time has come!\nBut first, we're gonna take care of your ninja friend, here!\n(Slash) Aaaaaaahhhhh!\n[Dan] Goddamn, Brian, you killed them all\nNow the empire will fall\nI have to say in retrospect that was easier than I thought!\nOh yeah!\n\nPart V: Peace, At Last, Peace\n\nOur work here's done, the future is secure\nBut my girl and I have one last farewell slam just to be sure\nFor underneath those rockin' boobs lies a heart that is so pure\nTake care of this world for me, my darling, I will always love you\n...What is your name by the way? Kristen? Ah, a beautiful name\nUntil that glorious day when we meet again, Katie, farewell!\n\nNow let us fly into the night sky\nAnd we'll raise a glass to ass in a final goodbye\nTo sixty-nine, sixty-nine\nSixty-nine sixty-nine\n(Sixty-nine) Let us be gone\n(Sixty-nine) Our quest is life-long\n(Sixty-nine) It's a sexy destiny so lets rock the fuck on\n\nPart VI: Yay\n\nFuck yeah\nFuck yeah\n\nChimes fade out"}], "artist": "Ninja Sex Party"}