{"songs": [{"year": null, "title": "Our Babies 2 (Crazy World)", "image": "https://images.genius.com/97e5f72432c5b33084c28f136249f9b1.442x442x1.png", "lyrics": "It's a crazy world out there\nKids are getting shot at school\nPeople are dying\nI'm just trying to make it through 7th grade!\nWith all these wars going on\nWhat am I supposed to do in this world of trouble?\nYeah, I don't know, man\nIt's getting crazy\nIt's a crazy world out there man, for real!\nIt's a crazy world!\nBread and circuses, google it\nIt's a crazy world, it's life we live\nIn a crazy world!\nSo crazy, the things you see, man\nYou turn the television\nYou look outside your window\nIt's a crazy world out there, man!\n\nLook, the other day I seen a girl acting like a boy\nThen I seen a little boy acting like a girl\nPeople try to tell me it's just a way of the world!\nIt's a crazy world!\nShit make you wanna hurl\nBlack boy shot cause he was wearing a hood\nNobody riot even though that we know we should\nToo afraid of dying, cause of what we was and we would\nIt's a crazy world!\nThought that you understood\nAlcohol killed more people than all\nSo called illegal drugs put together for sure\nSo why is it something you could just buy it at the store?\nIt's a crazy world!\nIt's something I can't call\nThey killed Bin Ladin and everybody just smiled\nIf he did what's alleged then yeah that maggot is foul\nQuestion I ask you is what happened to his trial?\nIt's a crazy world!\nWow, we represent war, the first thing you hear\nIt's in the Star-Spangled Banner the verses is clear\n\"the rocket’s red glare, bombs burst into air\"\nMake it harder for peaceful people to persevere\nBut we was raised here, this is all we know\nIt's a crazy world, so you know how it's gonna go!\n\nIt's the life we live in a crazy word\nIt's enough to make a nigga go crazy, go crazy!\nGo crazy, make me go crazy!\nGo crazy, make it go crazy!\nIt's a crazy world\nEnough to make a nigga go crazy\nGo crazy, make you go crazy!\nIt's a crazy world!\n\nMy man hit his cousin in the head with a crowbar\nJust so he could take the shit and put it on World Star\nThis other motherfucker drink a whole thing of Smirnoff\nIt's a crazy world!\nBit his homeboy ear off\nWhite man came and told us of Joseph Kony\nFirst we thought he was real, but now we know he's a phony\nCaught him the next week in the park beating his meat\nIt's a crazy world\nIt's just a bunch of baloney\nAnd back to the subject at hand\nI wondering if this was God’s plan or just the law of the land\nA lot of niggas in college, even more in the can\nCops got the block hotter than the Florida sand\nDamn, I just had a baby girl!\nIt's a crazy world!\nWhat's gonna happen to her?\nThis life we live\nIn a crazy world, it's enough to make a nigga go crazy!\nGo crazy, make you go crazy!\nMake you go crazy, and crazy, and crazy!", "album": "The Greatest Story Never Told 2: Bread And Circuses"}], "artist": "Saigon"}