{"songs": [{"image": "https://images.genius.com/294a7b3b0009e710be0cc01db8c6fa70.874x874x1.jpg", "title": "Creep", "album": null, "year": "2012-08-13", "lyrics": "[Intro]\nYeah\nFresh back from N.Y\nBack on my leak shit, you already know, iHustle.com\nLet's get it, uh, look\n\n[Chorus]\nI like bitches, that like bitches, that like bitches, that like bitches\nI like bitches, that like bitches, that like bitches, that like bitches\nI like bitches, that like bitches, that like bitches, that like bitches\nI like bitches, that like bitches, that like bitches, that like bitches\n\n[Verse]\nLook, young Hussle on that bullshit\nHoppin' out the Regal, burner with the full clip\nSummertime, murder gangs going back to back\nFly crippin' so my belt cost half a stack\nI’ve been ballin', nigga, reach, I'ma handle that\nBack when me and F and J Stone was selling candle wax\nI’m the motherfuckin' truth, nigga, that’s a fact\nAnd if I fuck your baby mama, can you handle that?\nLook, the West? Nigga, that’s a wrap\nYou ain’t eating with us, you gon' have the scraps\nStruck out, nigga, every time you at the bat\nNiggas can't compete with us with them type of stats\nNiggas can't compete with us with these type of racks\nFiends tend to blow your beeper up for this type of crack\nYeah, niggas trying to get their license back\nMe, I’m trying to get my lifers back\nNiggas couldn’t keep the chopper on the rifle rack\nI’m a driver and a shooter, still, in spite on that\nLight bulb, hustle, look you might could rap\nNightclubs, I know a couple that we might could pack\nTry and fail, go to jail, quick to wife a rat\nRhetorically I ask myself \"What type of life is that?\"\nNah, you knew better, but you settled\nI stepped it up a level, double up on my endeavors\nSo I'm broke never, i’m a Rich Rollin' rebel\nClever as the devil, pull strings like Geppetto\nI've been real from the get-go\nYou’re green like a gecko\nWhen your name gain weight your ex hoes can’t let go\nHello? Hanging up when you say your name\nPlay it too much to not know the game\nHeartbroken, Frank Ocean on that novocaine\nYou know this change, but I won’t explain, look\nNip the Crip that flipped the blueprint that Hova laid\nTen thousand cash, no tickets, no overlay\nAnd I’ll be in your city with the bros today\nPresidential car service with the motorcade\nRoad to the riches, now you know the way\nRun this money marathon at a owner's pace\nYou ain't a real nigga without a goal to chase\nAnd a yellow bone bitch with some toes to paint, oh\n\n[Chorus]\nI like bitches, that like bitches, that like bitches, that like bitches\nI like bitches, that like bitches, that like bitches, that like bitches\nI like bitches, that like bitches, that like bitches, that like bitches\nI like bitches, that like bitches, that like bitches, that like bitches"}], "artist": "Nipsey Hussle"}