{"artist": "G Herbo", "songs": [{"title": "Frankie Lymon", "album": null, "year": "2014-10-08", "image": "https://images.rapgenius.com/8115affe6b00d4133eaa6395a722e3a7.500x500x1.jpg", "lyrics": "[Produced by C-SICK]\n\n[Intro]\n\"I'll call the cops!\"\n\"Yeah baby, you call the police and tell them we got two imposters up here running a scam because I'm Ms. Frankie Lymon!\"\n\"I'm Mrs. Frankie Lymon!\" \"I am Mrs. Frankie Lymon\"\n\"Jesus Christ, it's a God damn game show!\"\nGang! Ballin' Like I'm Kobe the mixtape\n\n[Bridge]\nThey like \"Herbo you so fly\", that's everywhere I go\nThey like \"Herbo you so high\", and I'm like \"yeah I know\"\nI keep .45 on my side, man you know I can't go\nNiggas plotting, I know they mad cause I got all these rolls\n\n[Hook]\nAll these hoes, all these clothes, all these jewels\nAll these drugs, all my niggas, all these tools\nAll these bitches over me, they don't want you\nHunned-fifty with me, run up, they gon' shoot\nAll my diamonds, I be shinin'\nPresidential Rollie, it say timeless\nAll I know is hustle, I be grindin'\nIf you looking for me, you can find me\n\n[Verse 1]\nIf you looking you can find me on the 8 block me and all my niggas grindin'\n\"Herbo, whats been happening since the tape dropped?\" Me and all my niggas shinin'\nWrist cost me bout a brick still look on my phone to see what time is\nAnd my fit cost a couple G's, I can see a deal before I sign it\nAll these bitches over me, I feel like Frankie Lymon\nI'm so high, I may O.D, I feel like Frankie Lymon\nI might spend a couple grand a week and stack enough to buy a couple diamonds\nI might buy my sis a couple 'fits if she get an A on her assignment\nI'm a young nigga, I'm a businessman, I take care of business, man\nAnd I and a slap a bitch in a minute, man, so yes, I'm a minuteman\nKeep my pistol on me everywhere I go, don't give a fuck about no sentence, man\nOff the drink you know it got me moving slow, I'm leaning like I'm trynna kick a stand\n\n[Bridge + Hook]\n\n[Verse 2]\nSippin' drank, smokin' pack, wishin' I could get my niggas back\nRollin' up the thrax, pour a hi-tech, but I really miss the act\nFuck a nigga bitch, then I give her back\nDon't want her to get attached\nA nigga shoot at me, bitch I'm shooting back\nMake sure you remember that\nI don't gotta worry bout who finna' blow, all my niggas into that\nI don't look at tags, while I'm in the store, all I do is spend a sack\nI don't trip about it, I'm a hustler, I know I'mma get it back\n20's, 50's, 100's, Herbo thumbin' through a check\nWant a feature? Hit my jack, I ain't hoppin' on it if it's wack\nFuck a industry catch me in the streets, might not send your money back\nAnd my gun up on me if a nigga run up on me, he ain't running back\n\n[Bridge + Hook]"}]}