{"songs": [{"title": "Blind Bard’s Vision", "lyrics": "[Hook x2]\nWhy is the story told? What is the teller's mission?\nWhat is the ultimate source of our deepest intuition?\nWhy does the audience come and why did they listen?\nThe blind bard's vision\n\n(Verse)\nThe sweetest siren call, that spans time and distance\nThe poet speaks the building blocks of our existence\nWho said it's master masons that build the base of nations\nWithout the word there's nothing else, you can't replace it\nWhen all the towers fall, and all the powerful\nKings crush into dust, things left there to rust\nIt's the word, the word, the word carries on\nAnd our thirst give birth to the search that we on\nSeeking solace with myths that promise\nIf we just give our attention it will astonish it\nA bit of politics, splash of the supernatural\nStitched together by syllables, weave a tapestry\nThat's broad enough to span minds and generations\nStill it cannot be touched by much but contemplation\nYou want to make a statement? Better you write a verse\nWant to create a nation? Better recite it first\nPreferably epic with no pen, let the mind collect it\nPractise it hundreds of times until it's time\nPerfected by the time they write it down\nThey'll doubt that you're real\n'Cause we're great at questioning other people's skill\nYet we seek it still, the Mahabharata\nVirgil, Milton, Lucretius, the epic of Sundjata\nGilgamesh Committed coffin text, yeah\nIt's the blind bard we know best\nIs it 'cause your word was twinned to empires' wings?\nOr that we touched something deep within?\n'Cause when you boil it down beyond mythology and God\nYou find something That is just so human, do you not?\nA son in search of a father that he has lost\nA father trying to get back to his family at any cost\nA woman that's besieged by men with bad intentions\nAnd she does not want to be with them, but they won't accept it\n'Cause there's men and gods, the pen and its gob\nThere's a mind and a mouth that spout where you dare not\nThe poet sings and speaks from streets to ancient Greece\nDefeat, then is what you meet if competing is what you seek Whether the beat or lyre strings\nWe are leviathans that speak sagas of this great species of hirelings\nPosing like we're highest kings\nTo get as high as wings of God but we do not\nDo nothing but try a thing\nThe poet sees how the falcons sees a view from the balcony\nNo doubting he Pages are a alchemy\nAnd the magician is politician and prophet\nPremonition we got it\nTelevision and pocket couple queens\nThat will keep us going flowing\nYeah, we eat from poems\nIf the teacher don't speak, how could we keep on knowing?\nWhat these questions to these answers are\nCurses and our blessings\nConfessions are just how deaf we are\nAnd obsessed with death, despite all our best attempts\nThe Odyssean Underworld is the best we're left\nThe same one from the book of the dead\nWho the myths, millennia hasn't put them to bed\nPhilosophy is not the laws of motion, logic can't explain emotion\nSo it makes sense, we come up with some other type of notion\nA myth is not a lie, it's a disguise from the truth\nSo the wise can recite to the youth\nIf the lines in our rhymes are to find any use\nIt's the tries of our mind to decipher the clues\nGive my mind this thing called living\nSeason the riddims, turn of the earth to announce the beginning Look how we bounce on the riddim\nMan could rap about all of the family\nWhole of your humanity, whole of the galaxy\nYou want to talk about cars, that's fine\nYes, you could say it is a chariot\nCarried on the wings of the night, even Zeus don't attack the skies\nWhere the truth in the chapter lies\nI don't know, it's just a fact of life\nThe search of the journey, permanent purgatory\nDriven a Finca from Inca to Germany\nSo what you gonna do? You gonna search?\nOr gonna stand on the side and rehearse?\nThere's finding the time since your birth is so insignificant\nThere's barely any worth\nYeah, the heroes, faces are thousands\nIf you listen you will hear what they're shouting\nThey ain't telling you to listen to the doubting\nThey're trying to get us ready for the outing\nBut you would swear poets are mortal\n\n[Bridge]\nBut we're not the same I assure you\n'Cause we make words and portals\n26 letters and we will teleport you\nWe're not the same, I assure you\n26 letters and we will teleport you\n\n[Hook x2]\nWhy is the story told? What is the teller's mission?\nWhat is the ultimate source of our deepest intuition?\nWhy does the audience come and why did they listen?\nThe blind bard's vision\n\n[Outro]\nThe blind bard's vision\nThe blind bard's vision\nThe blind bard's vision\nBlind bard's vision...", "year": "2018-02-18", "album": null, "image": "https://images.genius.com/8e81ba232aa924eaedfa23689ffb8390.640x360x1.jpg"}], "artist": "Akala"}