{"songs": [{"year": "2015-03-16", "album": "To Pimp a Butterfly", "image": "https://images.genius.com/ffb1a13cfda120ba85ab9e2a83a4e158.1000x1000x1.jpg", "title": "For Free? (Interlude)", "lyrics": "[Produced by Terrace Martin]\n\n[Intro: Darlene Tibbs]\nFuck you, motherfucker, you a ho-ass nigga\nI don't know why you trying to go big, nigga, you ain't shit\nWalking around like you God's gift to Earth, nigga, you ain't shit\nYou ain't even buy me no outfit for the Fourth\nI need that Brazilian, wavy, twenty-eight inch, you playin'\nI shouldn't be fuckin' with you anyway\nI need a baller-ass, boss-ass nigga\nYou's a off-brand-ass nigga, everybody know it\nYour homies know it, everybody fuckin' know\nFuck you, nigga, don't call me no more\nYou won't know, you gonna lose on a good bitch\nMy other nigga is on, you off\nWhat the fuck is really going on?\n\n[Verse: Kendrick Lamar]\nThis dick ain't free\nYou lookin' at me like it ain't a receipt\nLike I never made ends meet\nEating your leftovers and raw meat\nThis dick ain't free\nLivin' in captivity raised my cap salary\nCelery, tellin' me green is all I need\nEvidently all I seen was Spam and raw sardines\nThis dick ain't free, I mean, baby\nYou really think we could make a baby named Mercedes\nWithout a Mercedes Benz and twenty-four inch rims\nFive percent tint, and air conditioning vents?\nHell fuckin' naw, this dick ain't free\nI need forty acres and a mule\nNot a forty ounce and a pit bull\nBullshit, matador, matador\nHad the door knockin', let 'em in, who's that?\nGenital's best friend, this dick ain't free\nPity the fool that made the pretty in you prosper\nTitty juice and pussy lips kept me obnoxious\nKept me up watchin' pornos in poverty; apology? No\nWatch you politic with people less fortunate, like myself\nEvery dog has its day, now doggy style shall help\nThis dick ain't free\nMatter of fact, it need interest\nMatter of fact, it's nine inches\nMatter of fact, see our friendship based on business\nPension, more pension, you're pinchin' my percents\nIt's been relentless, fuck forgiveness, fuck your feelings\nFuck your sources, all distortion, if you fuck it's more abortion\nMore divorce courts and portion\nMy check with less endorsement left me dormant\nDusted, doomed, disgusted, forced with\nFuck you think is in more shit?\nPorcelain pipes pressure, bust 'em twice\nChoice is devastated, decapitated the horseman\nOh America, you bad bitch, I picked cotton and made you rich\nNow my dick ain't free\n\n[Outro]\nI'ma get my Uncle Sam to fuck you up\nYou ain't no king"}], "artist": "Kendrick Lamar"}