{"songs": [{"lyrics": "[Produced by K Rob]\n\n[Intro: Jay-Z]\nYeah, is y'all niggas finished, yo?\nIs y'all niggas finished?\nGot your little radio play, your little BDS, huh\nYou finished nigga? Huh huh, y'all finished\nCan I live, huh\nCan I live, you're being stingy with the fucking music again yo\n\n[Verse 1: Jay-Z]\nYo, yo... yo I blacks out, I pulls the MAC out\nScream \"what's that about?\", then I clap out\nI get my plot on and my drop on, through the rotten\nDon't even hate on those who hate me, I got Pac on\nFeeling it (feeling it), chickens are ice grilling it\nCops pulling it over, Jigga react militant\nSpeed off, officer told me turn the beat off\nI turned it a level higher, then return the devil's fire\nI'm raised different, react in situations niggas lay stiff in\nRookies blame it on the age difference\nMy subliminal flows, create criminal odes\nSing along if y'all with me, til the end of the road\nI'm cynical, when in the view of the public\nAnd this is because, I'm defensive when I'm in interviews\nThe percentage who don't understand, is higher than the percentage who do\nCheck yourself, what percentage is you?\n\n[Refrain: Jay-Z]\nCan I live, for all my niggas with all white Air Force Ones\nAnd black guns, stack ones yo\nCan I live, for all my chicks pigeon-toed\nStand bowlegged like a bulldog, know what I mean, huh?\nCan I live, to all the cee-lo champs\nTwo green dice and one red stop the bank and roll, heads, yo\nCan I live, to all my niggas who drink Hennessy straight\nCop mixtapes and sell weight, niggas\n\n[Verse 2: Jay-Z]\nI got the Feds sending me letters, 'cause I'm schooling the youth\nBut they can't lock me down, 'cause my tool is the truth\nYeah I sold drugs for a living, that's a given\nWhy is it? Why don't y'all try to visit the neighborhoods, I live in?\nMy mind been through hell, my neighborhood is crime central\nWhere cops lock you up more than try to defend you\nI push you to the limit when I'm needing the wealth\nAnd all I see is life cycle just repeating itself\nRan into shorty bopping down the ave\nOn his way to clocking math then\nHe proceeded to show me a block of slab and said\n\n[Verse 3: Memphis Bleek]\nAyo there's money out there I just got to have\nWhen I catch up to these fiends I'ma knock 'em on they ass\nNot to brag, sometimes I look at my life and laugh\nHow I think about school and it taught me not to grab\nWhen I backed out, let one out, let the barrel turn\nHolla at you faggots that it's my block to burn\nThat credit you dead it\nI know heads getting annoyed and knew all\nAbout a dope fiend before reading Donald Goines\nFlipping boy and, using the right cut\nOne thing that's fucked up is bad dope that I can't pump\nThis slab gotta re-up and re-bag\nBlend it in with the raw, bubble it fast cop more\nOnce I get it I got it I lock it, nobody pop shit\nSelling twenties on my block, bitch, on some blacktop shit\nWhat you want nigga? What you want nigga?\nWhat you want, what you want nigga?\n\n[Outro: Jay-Z]\nCan I live...\nTo all my niggas that hold coke in they bubble coat\nTrying to win with the construction Timbs yo\nCan I live...\nYo USA, all my chicks that strip\nBoos go to the store with the doobie pins still in\nAll my chicks with the credit card scams\nTwo kids, one job, and no man\nAll my chicks getting that washing set with their welfare check\nHaha, all the mamis dame un beso, alright\nAll my niggas rocking them fitted caps\nTrying to get at this rap, know what I mean\nAll my cats with open cases, big cars, and no license\nI like that shit, I see y'all\nAll my niggas that say pause after they say some fucked up shit Hahahahaha, rock on and uh, Jigga shit, Roc-A-Fella forever yo\nUhh, Major Coins, yeah, uh-huh\nMemph Bleek nigga, uh-huh uh", "title": "Can I Live II", "image": "https://images.genius.com/18040c4f503942a16d6577d9820644cb.1000x1000x1.jpg", "year": "1996-06-25", "album": "Reasonable Doubt"}], "artist": "JAY-Z"}