{"artist": "3rd Bass", "songs": [{"lyrics": "[MC Serch]\nAyo, man, my labelmate, Don Newkirk\nMan, step to 'em\n\n[Don Newkirk]\nThanks, Serch!\nAnd now... for the Prime Minister...\nSinister... Pete... N-hi-hi-hi-hi-hi-hice!\nNice, Nice, Nice\n\n[MC Serch]\nKick 'em in the grill, Pete!\n\n[Verse 1: Pete Nice]\nGas—past tense, made facially\n3rd Bass'll express, KMD\nThree blind mice on sight\nZev Lover, gave it the first light\nA grin shows a trick up a sleeve (HUAHAH)\nWhat a tangled web they weave\nDeceivers, stupefied through fable\nSay Let's Make a Deal at the dinner table\nPut you on tour, put your record on wax (\"Trust me!\")\nSign your life on the X\nYou exit, x-off, but what you really get:\nA box of Newports, and Puma sweats (\"Damn!\")\nTex feeds and frowns upon Emis\nTo give up Gas Face he drinks from a Thermos\nSub Roc cut at you with a clipper\nGas Face given, I beg to differ\n\n[MC Serch]\nPete that was real def, man, but I gotta get serious now\nAyo, Don, step to 'em again\n\n[Don Newkirk]\nEverybody... MC Serch!\n\n[Verse 2: MC Serch]\nBlack cat is bad luck, bad guys wear black\nMusta been a white guy who started all that\n(Make the Gas Face!) For those little white lies\nMy expression to the mountainous blue eyes\nThen form a face, and shake my skull cap\nDismiss the myth, that evil is not black\nBut opposite spectrum, this done by red man\nWith horns on his head, laid down the ill plan\nGot all his helpers, said, \"Make it snappy!\nTell all the people that their hair can't be nappy!\"\nBlonde and blue-eyed, or dark-skinned heffer, G\nA disease, created by leprosy\nDon't speak of bleach, bend them to right\nSay it was night WAY before the light\nPut aside spooks, Serch leaves a trace\nI've set em correct with the effect of the Gas Face\n\n[MC Serch]\nNext up, Don?\n\n[Don Newkirk]\nA special appearance by KMD's Zev Love X!\n\n[Verse 3: Zev Love X]\nA Gas Face can either be a smile or a smirk\nWhen appears, a monkey wrench to work one's clockwork\nPerkin his brim to the rim of my cup\nDon't tempt me, you're empty, so fill'er up!\nIs I'm talkin coffee or cocoa, is you loco?\nCash or credit for unleaded at Sunoco\nKMD and 3rd Bass is just ace in the hole\nI mean soul, so make the Gas Face (HUAHAHA)\nDamn, if looks could kill\nYou look like host was a ghost from your grill\nBut still, what's the new fed, to recollect\nTo our passing phase to facades to '80-deca\nFor my label reads Hood, street might have a tattoo\nDon't pick any card or no rabbit from my hat\nNever a magician if I ever tricked em\n\"Oh shit!\" Another Gas Face victim\n\n[MC Serch]\nThere it is, yo fellas man\nWhy don't you step to the mic man?\n\n[Zev Love X]\nThat's how I kicks it, for 80-deca\n\n[MC Serch]\nAyo, good lookin' out Don, man, peace\nPunji, yo, who gets the Gas Face?\n\n[Punji]Little Vic for the Gas Face\n[Serch]Tony Dick, gets the Gas Face\n[Zev X]No Gas Faces for Plugs One Two and Three\n[Serch] No Gas Face for Professor Prince Pa-paul!\n[?]My friend Tina gets the big Gas Face\n[Zev X] No Gas Face for DJ Subroc\n[Serch]No Gas Face for KMD\n[PNice] Hammer, shut the fuck up! Gas Face! AHUAHAUAH!\n[All]WHAHAHAOAHH\n[PNice]What do we think about Hammer? HAOWAHWOHAHBHABHAHBHAHBBHB\n[?]G.Y.P\n[Serch]Get Yours Posse does not get the Gas Face\n[Serch]But P. W. Botha gets a Gas Face\n[All] WHOAHBLBLAHBHA-WHOO!\n[?]Dante Ross gets the Gas Face\n[Serch]Yo stop dissin Dante on records y'all!\n[Serch] Elroy.. Elroy.. Elroy Cohen, gets the Gas Face!\nHAHAhahahahahaha, that's all..", "image": "https://images.genius.com/dd468a64eb9e882b30b689b9a7116ed4.594x593x1.jpg", "album": "The Cactus Album", "title": "The Gas Face", "year": "1989-11-14"}]}