{"artist": "G Herbo", "songs": [{"title": "Everything", "album": "Humble Beast", "year": "2017-08-24", "image": "https://images.genius.com/4b77b2be1990b4465e5557e0268b1c27.400x400x1.jpg", "lyrics": "[Intro]\n808 my crew!\n\n[Verse 1: G Herbo]\nHit the scene, so fresh, so motherfuckin' clean\nAnd my car so fast, it's leaving everything\nI love you so momma, and thank you for everything\nAnd you know momma, I was doing everything\nUsing guns, ecstasy, I'm on extra lean\nIn the hood I'm selling molly, raw, everything\nHeroin, we crushing Tylenol, everything, weed, soft, everything\nHit the mall, 50 G's, and I ball, everything\nPlug just like Tom Brady, boy, I caught everything\nMy Uncle a gangster, I'm the one he taught everything\nYou can't be my lady, sneaky bitch, I saw everything\n\n[Chorus: G Herbo]\n\"Herbo, what you do for fun?\" Bitch, everything\n\"What you gon' do with that gun?\" Bitch, everything\n\"What kind of drugs you wanna run?\" Bitch, everything\n\"If you die what you gone leave your mom?\" Bitch, everything\n\n[Verse 2: G Herbo]\nEverything on you phony\nNiggas lie 'bout everything, put it on they homies\nHating ass nigga, you want everything on me\nSwervo saucy, everything got double G's, don't it\nItalian beef with everything, extra cheese on it\nI done iced out everything, them VVS on it\nI done tried everything, except coke and dope\nI done fired everything, .40's blow the most\nSeen dead bodies, everything, so I drove the Ghost\nTold that bitch take off everything, I ain't need clothes\nTook everything in me not to close your fuckin' door\nBarney's on me, everything, everything boss\nEverything exhaust\n\n[Chorus: G Herbo]\n\"Herbo, what you do for fun?\" Bitch, everything\n\"What you gon' do with that gun?\" Bitch, everything\n\"What kind of drugs you wanna run?\" Bitch, everything\n\"If you die what you gone leave your mom?\" Bitch, everything\n\n[Verse 3: Lil Uzi Vert]\nYuh, everything\nMy new whip, that bitch, it came with everything\nI'ma turn that boy into a heavy stain\nWhipping up that dope, yeah, that's that heavy cream\nI been fucking on your bitch since I was 17\nEven though my Glock hold 30, this a 17\nChop it up, whole thing from the Medellín\nMy old gun, that shit was dirty but I kept it clean\nMask off, remember me\nExtra button on the back cause my uzi a lemon squeeze\nGucci, Louis, Fendi, Prada, swag swag swag, that's my disease\nFuck her once, I gotta leave, smoking dope, I'm Japanese\nFucked her in the master suite, I ball like an athlete\n\n[Chorus: G Herbo]\n\"Herbo, what you do for fun?\" Bitch, everything\n\"What you gon' do with that gun?\" Bitch, everything\n\"What kind of drugs you wanna run?\" Bitch, everything\n\"If you die what you gone leave your mom?\" Bitch, everything"}]}