{"songs": [{"title": "Bigger Than Me", "album": "I Decided.", "year": "2017-02-03", "image": "https://images.genius.com/15fe74f551404783e7b7cb1a8ba102e9.1000x1000x1.jpg", "lyrics": "[Intro: Big Sean]\nDo or die\nLook, all I wanna do is make the city proud, yeah\nWishing all the OGs could see me now, now, yeah\nAnd when you feel something you can't see\nBut you know it's meant to be\nYou gon' realize that this is bigger than me yeah\nBigger than me, bigger than me\nWhen the whole family depend on you to eat\nAnd at night you can't sleep\nYou gon' realize that this is bigger than me\n\n[Verse 1: Big Sean]\nGet it, get it, get it\nI pray that you get it even if I can't get it with cha\nI pray to God you never let the little things in life distract you from the bigger picture\nEverybody in the city to me like a distant cousin, brother, little sister\nI see myself in the young ones\nWhen I look in their eyes it feel like a mirror\nCorleone all on my own (Don)\nCartier all on my arm\nAll I hear is sirens  and car alarms\nNiggas going to war with no armor on\nFirst time I seen a dead body I was 14\nAnd I felt the pressure\nLike if I don't get it, I might end up next to him\nI'ma take the dice and I'ma roll a 7\nSeven, seven, seven, 7-11 it's 911 getting called around\nThe hood America's lost and found\nWhere niggas get lost and never found\nAll I ever wanted was to turn these Gs into Ms and a Mercedes key\nGot it and I still felt incomplete\nThat's when I realized this shit was bigger than me\n\n[Chorus: Big Sean & Flint Chozen Choir]\nBigger than me\nWhen the whole town on their feet\nAnd they all just waiting on you to speak\nThat's when you realize that this is bigger than me\nAll I wanna do is make the city proud, yeah\nWishing all the OGs could see me now, now, yeah\nOhhh ya ya yeah\nOhhh ya ya yeah\nYou gon' realize that this was bigger than me\n\n[Bridge: Starrah]\nUsed to want that foreign\nGot that foreign, now it's boring\nStarted touring\nSwear to God that's when I realized this shit was bigger than me\nFlex on niggas with a Rollie\nGot that Rollie with the shine\nBut lost my time\nThat's when I realized this shit was bigger than me\n\n[Verse 2: Big Sean]\nI seen people in the same place 10 years later\nMan that shit pathetic\nGod talking to me telepathic like it only happen if you let it\nI can't spend my whole life looking at the same ceiling fan\nWhen I feel like I ain't got no ceilings man\nIf I ain't special why I feel it then?\nI gotta get on the road\nI gotta be the one chose\nI gotta come back and tell the greatest story they never told\nThis must be the feeling that you get when you know you close\nAnd you know it's a way in even when the doors are closed\nAnd realize this shit is bigger than me yeah\n\n[Chorus: Big Sean & Flint Chozen Choir]\nBigger than me\nWhen the whole town on their feet\nAnd they all just waiting on you to speak\nThat's when you realize that this is bigger than me\nAll I wanna do is make the city proud, yeah\nWishing all the OGs could see me now, now, yeah\nOhhh ya ya yeah\nOhhh ya ya yeah\nOhhh ya ya yeah\nOhhh ya ya ya ya ya ya ya\nOhhh ya ya ya ya ya ya ya\nOhhh ya ya ya ya ya ya ya\n\n[Outro]\n[Myra Anderson:] Well no matter what, I'm proud of you. Even when you do stupid things that I have warned you about. You must get that from your daddy. I'm just kidding, you know I love you. You listening?\n[Big Sean:] Yeah yeah, I'm listening. I love you too\n[Myra Anderson:] In a way I feel like I'm living through you. Sometimes it feels like I got another chance at everything\n[Big Sean:] Man that's deep to feel like that. I kinda feel the same way though sometimes\n[Myra Anderson:] Yeah\n[Big Sean:] With all the work that's goin' on I feel like this is like my second time doin' it so I know that sound crazy but, you know I just I don't know why I always imagine myself as like someone who failed at everything he ever did at life you know and I got to the end of life and just regretted it all and somehow, this is my chance to go back and get it all right. And when I wake up, with that mindset, you know, it completely changes my hunger, how I approach the whole day. I mean you decide to live your life like that then pshh, man I guarantee we'll live life to our best potential\n[Big Sean (future self):] It's that simple. It's all about living in the moment. Period"}], "artist": "Big Sean"}