{"songs": [{"image": "https://images.genius.com/fbd85f5ede25df6fde4ff0e6876d89ac.350x350x1.jpg", "lyrics": "[Hook]\nShit happens, niggas want me to talk about it\nThey love gossip, bitches want me to talk about it\nIt's all over the Gram so I'mma talk about it\nYou heard what happened? Niggas want me to talk about it\nShit crazy, niggas want me to talk about it\nYou heard what happened? Niggas want me to talk about it\nShit happens, niggas want me to talk about it\nFuck how y'all niggas feel, I'mma talk about it\n\n[Verse 1]\nNiggas in Paris, Kanye, Jay Z\nNiggas in paris robbed Kim K, B\nYe mad he ain't got a call from Jay Z\nJay like niggas get robbed every day, B\nJ. Cole kicked you while you was down\nHe knows controversy sells, he got an album out now\n\"False Prophets\"\nDamn, Ye, the people don't trust you\nBush don't like black people, but you think Donald Trump do\nDon't meet with Donald Trump and talk about us, Ye\nYou ain't got the answers just like you told Sway\nIt's the truth, I ain't talking greasy, Ye\nJust know them streets still rock with the Yeezys, Ye\nBut Rihanna ain't rocking with Travi$\nSomebody should've told him that she was a savage\nHe like \"pick up the phone, baby, I know you home, baby\"\n(Stop calling)\nIt's a dub, nigga, no more dates\nShe ain't pick up the phone 'cause she was creeping with Drake\nYou was just another dude on the hit list\nEven Mad Skillz gotta like how I flip this\nFuck it if he don't, yeah, I Deebo'd his shit\nHeard you last year saying that slick shit\n(I heard you)\nTook a meeting with 50, deal done in an hour\nI'm G-Unit now, you might see me on Power\n(50, what up?)\nIf 50 got beef, I'm involved\nWe can semi automatic or trey 8 revolve'\nHad to dream big, told me get Lil Yatchy wrong\nCam and Jim Jones still got problems\nCam told Angie Jim ain't from Harlem\n\n[Hook]\nShit happens, niggas want me to talk about it\nThey love gossip, bitches want me to talk about it\nIt's all over the Gram so I'mma talk about it\nYou heard what happened? Niggas want me to talk about it\n\n[Verse 2]\nMan, that Game beef verse Meek Milly\nGot my nigga Beanie Sigel knocked out in Philly\nTroy Ave at the club on camera letting it clap\nTroy got shot, got up, start shooting back\nAnd now Troy Ave fighting a case\nGot shot again on Christmas, he can’t get a break\nBobby took 7 so Rowdy could get 7 years\nHe could've took a plea, been home in a year\nAyo, Bobby, we salute you\nDesiigner got famous for sounding like Future\nGucci came home, ready for marriage\nDrake bought a Ferrari for 21 Savage\nMan, I think he did that to get Meek mad\nDrake's still got mainstream on their kneepads\n(He winning)\nI mean, you see he did a milli in his first week\nJeezy outsold Meek Mill in his first week\nJ. Cole did half a milli for his first week\nTrump need to get killed in office his first week\nYeah, I saw Tiny dancing on Mayweather\nFor the kids I hope her and T.I. stay together\nI watch they show, I like they chemistry\nIf he cheat Tiny cheat back, but not with the enemy\n(not with the force)\nKodak Black fighting the rape charge\nI think the nigga did it, nah nah, I'm just playing, y'all\n(Kodak innocent)\n\n[Hook]\nShit happens, niggas want me to talk about it\nThey love gossip, bitches want me to talk about it\nIt's all over the Gram so I'mma talk about it\nYou heard what happened? Niggas want me to talk about it\n\n[Verse 3]\nWho was on Shade Room? Who was on Baller Alert?\nWho was on Akademiks? whose feelings you want me to hurt?\nAdrian Broner talk about suicide\nNiggas on the Gram is like \"hurry up, do it and die\"\n(Hurry up)\nSoulja Boy beefing with Quavo, got locked up\nLucky they ain't find a Draco\nThat boy got more beef than a burger\nOn Instagram he pulled out the purple burner\nThat's a good gun to pistol whip Lil Yachty with\nLike, that's for Biggie, that's what you get for popping shit\n(Watch your mouth)\nAnd tell Lil' Kim I'm mad\nFor bringing Rich Homie Quan out, making Biggie look bad\nHe was fucking up the words to a classic\nThe way that he dancing niggas think the nigga a faggot\nRest in peace to the greatest, Muhammad Ali\nMister \"float like a butterfly, sting like a bee\"\nDave Chappelle came back, got 60 mil\nMan, rest in peace to Prince, he overdosed on pills\nRemember Purple Rain had that vibe\nDamn, Tommy from Martin with no job died\nLeBron did it for Cleveland and got that ring\nBernard Hopkins got knocked out the fucking ring\nNo Durant, Russell Westbrook doing his thing\nDurant dickriding Golden State to get a ring\nCan't beat 'em so you join 'em, right?, You a traitor\nFuck cancer, rest in peace to Craig Sager\nFuture said \"Fuck Diddy\", Diddy ain't give him no Ciroc\nHe fucked Scottie Pippen wife in some Gucci flip flops\n(Jordan, what up?)\nKobe scored 60 his last game\nA.I. got inducted in the hall of fame\nBaby still ain't pay Lil' Wayne\nTold the Breakfast Club put some respek on his name\n(All three of y'all)\nYoung M.A. getting that money\n\"Ooouuu\" hottest record in the country\nMary J. Blige don't want no more drama\nGoing through a divorce, her husband tryna' rob her\n(He a bum)\nBlac Chyna a Kardashian\nShe had a baby with Rob Kardashian\n(She came up)\nTook the baby then left that fat fuck\nNow he on the Gram like \"she left me and took her stuff\"\n(Good for you)\nShe ain't love you or like you like that\nShe use you to get popping and pay Tyga back\n(Sucker)\nShould've peeped that from the beginning\nAmber Rose had a TV show, these hoes winning\n(They lit)\nKhloe still can't keep her legs shut\nIf you a rapper or a ball player she'll let you fuck\n(For real)\nEvery 6 month she switch 'em up\nI wanna put my thumb in Kylie Jenner butt\n(Ew)\nI'm just playing, but 21 Savage ain't\nHe wanna fuck her, he think Tyga a sucker\n(Me too)\nPolice surrounded Chris Brown crib\nCause some white chick lied about some shit he did\nKatt Williams got choked out by a little kid\nMichel'le showed that's what Dr. Dre did\nHe was looking like a young Ike Turner\nHe ain't just beat her ass, he shot at her with the burner\n(That's a nigga with an attitude)\n\n[Hook]\nShit happens, niggas want me to talk about it\nThey love gossip, bitches want me to talk about it\nIt's all over the Gram so I'mma talk about it\nYou heard what happened?\n\n[Verse 4]\nPolice shooting at cars while kids in the back\nMan, not even Scarface would've did that\n(No women or kids)\nWe catch it on camera and nothing done happened\nCops got killed in Dallas, that needed to happen\n(Payback)\nBlame the government for that, that's they fault\nPolice kill us, get probation in the same court\nThey give us life then we catch a body\nCause they got the power, yeah, they white like Tommy\nAmerica is racist and they ain't hiding it\nTrump won, the KKK is out of retirement\n(They out)\nYou know them crackers don't like our skin color, they hate us\nRest in peace to 2Pac mother, dear mama\nGod bless Afeni Shakur\nShe would've liked Kaepernick for kneeling down on the floor\nWhen the national anthem played they don't respect us\nThey kill us and lock us up, they don't serve and protect us\n(They don't)\nTrump the new president, what you mad for?\nHow long y'all thought the president was gon' be black for?\nBarack Obama did his thing\nBut he was just another puppet on the government string\n(I'm just saying)\nThis year we had a lot of deaths\nWe lost Shawty Lo and Bankroll Fresh\nPhife Dawg and Big Kap passed\nFlex said Lil' Bow Wow music trash\nAnd he said Lil Yachty got that mumble rap\nIt's them little kids that pop molly that fuck with that\nNah, we don't fuck with that, culture vultures\nNew York finally sounding like it's supposed to\nSounding like Timberlands and Champion hoodies\nSalute to Dave East, Don Q, and A-Boogie\nPlay this for Mad Skillz, he gon' hate it\nFat Joe and Remy Grammy nominated\nRemy and Nicki taking shots at each other too\nRap is a sport, man, that's what they 'posed to do\nYeah, that's that essence of hip hop\nDJ Drewski on Love and Hip Hop\nDrake with J. Lo on some Puffy shit\nMariah never heard of J. Lo, that's some funny shit\nMan, I'm off this, enough was said here\nWonder who I'mma throw under the bus next year\n\n[Hook]\nShit happens, niggas want me to talk about it\nThey love gossip, bitches want me to talk about it\nIt's all over the Gram so I'mma talk about it\nYou heard what happened? Niggas want me to talk about it\nShit crazy, niggas want me to talk about it\nYou heard what happened? Niggas want me to talk about it\nShit happens, niggas want me to talk about it\nFuck how y'all niggas feel, I'mma talk about it", "title": "Rap Up 2016", "year": "2016-12-31", "album": "Rap Up Series"}], "artist": "Uncle Murda"}