{"songs": [{"year": "2015-03-09", "album": "Tomorrow We Live", "image": "https://images.rapgenius.com/55ff246e24b5526eeabcd88ffce56bc3.600x600x1.jpg", "title": "Crowns & Thorns (Oceans)", "lyrics": "[Chorus: Taya Smith & KB]\nSpirit lead me where my trust is without borders\nLet me walk upon the waters\nWherever you would call me\nTake me deeper than my feet could ever wander\nAnd my faith will be made stronger\nIn the presence of my Savior\nSpirit lead me where my trust is without borders\nLet me walk upon the waters\nWherever you would call me\nTake me deeper than my feet could ever wander\nAnd my faith will be made stronger\nIn the presence of my Savior\nI am yours, and You are mine\n\n[Verse 1]\nFor Jesus, let me tell you 'bout me (Me)\nI'm not impressed easily\n'Cause I've never been a place that my God don't reign\nNo way, no way, HGA to the grave\nGave all Himself\nAll I wanna do is give Him all of me, all of me, all of me, all of me\nStruggling, oh, I be struggling\nMy idols are mimickin' Jesus\nI bury my sin, in three days, it's back up again\nIn the beginning we, in the beginning we, we would give anything\nValue for ministry, missions, and bigger things\nYou could take everything, you just give me the King\nBut the fire faded\nI just wanna retire with savings\nAre you the safest when the world loving you\nOr had enough of you?\nWho's in more danger, the persecuted or the comfortable?\nGive us a crown\nYou can hold onto them thorns\nI don't want them having more, nobody will suffer no more\nOnly say things that will end with applause\nDon't offend no one except for the Lord\nNo más, you are too good to be throwin' your cross\nI'm at the cross, do what you want!\n\n[Chorus: Taya Smith, 8x8 & KB]\nTake me deeper than my feet could ever wander\nAnd my faith will be made stronger\nIn the presence of my Savior\nI am Yours and You are mine\nI am Yours and You are mine\n\n[Verse 2]\nHow does a man stay on top? Become the servant of all?\nWhen you the servant of all, no competition's involved\n'Cause who is knocking you off? There's nowhere left to fall (Uh)\nProgressive with the flow, that's a little one\nAs I'm insured, I'm sure you're missing these little puns\nI'm insured, yeah, the settlement is finna come\nHe's still shining if I'm jacked for every nickel, son\n'Cause no way I'ma die slow, no way I'ma die slow\nWon't break, I will not fold, cancel my tour, not my soul\nI'll go blindfold in and out of time zones\nI'm in my zone, put it up on your iPhone\nLeaving your mind blown, looking for His arrival\nI can see Him ridin' down all on that white horse\nLooking like OJ in the bronco, uh\nAnd I'm learning when I've flown\nFlights make my respect much stronger, uh\nThe higher that I go in grace, everything below is smaller\nI'ma steward this well\nHe holds my airways, I breathe with a heavy flow\nForevermore, yes I'm willing and able like I'm sittin' in an exit row\nI gotta make an exit though\nWhat will they remember though?\nHow I was born? How 'bout my metaphors?\nMan of war standin' in truth and I was serving strong\nBring it, they can throw violence\nI'm in the back grinnin' like Joe Biden\nHe rose the ocean, Poseidon\nTo be frank, no ocean I won't dive in\n\n[Chorus: Taya Smith]\nSpirit lead me where my trust is without borders\nLet me walk upon the waters\nWherever you would call me\nTake me deeper than my feet could ever wander\nAnd my faith will be made stronger\nIn the presence of my Savior\nSpirit lead me where my trust is without borders\nLet me walk upon the waters\nWherever you would call me\nTake me deeper than my feet could ever wander\nAnd my faith will be made stronger\nIn the presence of my Savior"}], "artist": "KB"}