{"songs": [{"title": "Boyz N The Hood", "lyrics": "[Intro]\nWoke up quick at about noon, big strap gotta be in North Memphis soon\nAw, there go my shit nigga\n\n[Verse 1: Yo Gotti]\nHey!, Boyz in da hood is always hard\nNorth Memphis come around you gone get robbed\nWas the first young nigga with a 50 pack hard\nServing drugs and running back and fourth to cars\nNiggas playing games then gone get shot, (bang)\nTell LA Reid when my new shit drop\nIf ion go platinum then im callin’ my plug (hello)\nCause ion like rappin’ rather be sellin’ drugs\nFree Bobby Shmurda and the GS9 (my niggas)\nI feel like its my job to get these street niggas signed\nI feel like its my job to tell these niggas the facts\n15, 20 million dollars no plats\nCruisin’ down the street in my new lambo\nBad bitch big pussy that’s my MO (gotti)\nIf you run up on this car\nI’ll send ya to god (blat blat)\nTruth is none of these rappers are hard\nAnd everybody gangsta when they come to ya city\nAlways calling niggas hold em’ down in your city\nIm always with the gangstas when I come to ya city\nYou say you run the town but you never in the city\nIon. Ion give a fuck when they come to my city (Memphis)\nNorth its the King ima give ya the business (bang)\nPride to the side boy Im still on a mission\nHanging out the window lat lat till I get it\nRappers in the game is fake as hell\nI done seen niggas lie make up stories to sell\nI done seen real niggas stay real and fail\nTell they stories through music and end up in jail (damn)\nIan signed to no label\nIm signed to myself\nSo if my album come out late\nIm finding myself\nNo money or ya head or ill down ya myself\nWhy clown a nigga when he clowning his self?\nStreets miss Eazy and NWA\nOld school Chevy bumping beats by Dre\nCMG the label we was built off Yay\nOn that Ice Cube today was a good day\nBoyz In the hood are always hard\nCome with that high price you gone get robbed\nKnow nothing in life but to be legit\nDon’t quote me boy cause I ain't said SHIT!\n\n[Outro]\nArt Of Hustle yeah, yeah (3x)\nRIP to Eazy", "album": "The Return", "year": "2015-09-11", "image": "https://images.genius.com/9879d574677bd3d25f853b30ff0264d7.1000x1000x1.jpg"}], "artist": "Yo Gotti"}