{"songs": [{"title": "APB", "album": "Church Clothes", "year": "2012-07-03", "image": "https://images.genius.com/dac6127bb6a5a6cb9a45121946eb86ef.500x500x1.jpg", "lyrics": "[Intro]\n(Police Officer) Ten-Four Charlie\n(Charlie) Go ahead\n(Police Officer) Yeah I think we got a problem\n(Charlie) Yup. That boy right there gone\nG-G-G-Good work, Charlie, hahahaha\n\n[Chorus: Lecrae and Thi'sl]\nTen-Four Charlie I think we got a problem\nThat boy right there gone put an APB out on him\nYou seen him, he gone\nYou seen him, he gone\nYou seen him, he outta there\nYou seen him, he gone\n\n[Verse 1: Thi'sl]\nSaint Louis my city dog, west side, was the block\nWhile you was in the crib playing with Legos\nI was out there trying to get blocks\nMomma gone, daddy gone, just me and my hood, dawg\nSuWooping, beaned up, like I'm bout to go play baseball\nBefore you ever heard about Jeezy boy I was already on some Trap or Die\nWas a goon, 'fore it was cool, You can still see the pain in my eyes\nWhat you know about sitting in a jail cell, felonies, murder case\nBest friend, rolled on me, take the stand, turned state\nI am a felon, I tell no lie\nHand on the Bible, hand to the sky\nI wanna live, I ain't wanna die\nWhen they rolled upon me and let them bullets fly\nThat could have been the end, dawg\nOne way, Hell's gates\nBut the Lord stepped in, chose to show grace\nCould have been laid in the box, dawg\n6 of my homeboys carry me\nBut I'm alive and the old me gone\nCause everyday dawg I bury me\n\n[Chorus: Lecrae]\nTen-Four Charlie I think we got a problem\nThat boy right there gone put an APB out on him\nYou seen him, he gone\nYou seen him, he gone\nYou seen him, he outta there\nYou seen him, he gone\nTen-Four Charlie I think we got a problem\nThat boy right there gone put an APB out on him\nYou seen him, he gone\nYou seen him, he gone\nYou seen him, he outta there\nYou seen him, he gone\n\n[Verse 2: Lecrae]\nOk, hydroponic lungs, top shelf liver\nLimb a lil' tender, I can chop down timber\nI was no pretender, certified offender, never know surrender\nMy amnesia's circumstantial, though some things I can't remember\nThose who knew me be like \"who he?\", they tripping off the new me\nThey like \"Man, where the old 'Crae? You crazy, you can't fool me\nI would party so hard that the law was tryna find me\nI pray to God they ain't find me But then I hear the {WHOOP-WHOOP}\nLook up in the rear view and they're right behind me\nRoll down my window- \"Boy what's your name?\nCause you was doing 85 in the passing lane with no traffic, man\"\nThen I gave them my ID, and guess what they say\n\"This boy here crazy, naw that's just Crae\"\nMan I was psycho, wild as the hundreds\nI do like the Chi, doing whatever I wanted\nUntil I was confronted, heard about Jesus and I changed\nThey like \"man what you do? Something 'bout you just ain't the same\"\nI was dead. The old me was nothing but a sucker\nSucked the life out of my mother, just to get the stuff I wanted\nNow I'm milk carton status and \"different\" can't explain it\nPut the APB out on me, if they find me that's amazing\n\n[Chorus: Lecrae]\nTen-Four Charlie I think we got a problem\nThat boy right there gone put an APB out on him\nYou seen him, he gone\nYou seen him, he gone\nYou seen him, he outta there\nYou seen him, he gone\nTen-Four Charlie I think we got a problem\nThat boy right there gone put an APB out on him\nYou seen him, he gone\nYou seen him, he gone\nYou seen him, he outta there\nYou seen him, he gone"}], "artist": "Lecrae"}