{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/7e8707e6b431e1efcbbd7d7e6cd95c9c.474x450x1.jpg", "title": "What’s More Realer Than That? (Original Mix)", "year": "2008-02-05", "album": "Half a Klip", "lyrics": "[Hook]\nNiggas planned to spray up my man's wake, I filled it with gats\nHomie, what's more realer then that?\nWhen Jake was at the front door knockin, I cocked them shits back\nYeah, what's more realer then that?\nHad me trapped off, got the drop on me, just stared at the gat\nTell me, what's more realer then that?\nPick up the Paid In Full album cover, look in the back\nDog, what's more realer then that?\n\n[Verse 1]\nYeah, make way for the R rated, armour plated\n5 Fam, we rep this shit like we are related\nYeah, some of the click dead, some incarcerated\nLower the crop, you know them blocks gettin hard laboured\nI let the dogs out the kennel, watch 'em form and assemble\nGet the chef and the pots like I was born with utensils\nMe and dollar schemes brainstorm in the middle\nThe war get to poppin, all stages for the bread\nKnow a couple of dudes that got pages in the Feds\nKnow a couple of dudes that got cages in the Feds\nMy grind can blow your mind like 12 gauges to your head\nSo I copped a Soviet AK for the spread\nNever know when the past can come back to haunt you\nNigga lose his script, the wolves creep up and corner you\nWhen it rains it pours so you knowin what the storm'll do\nNiggas turned cold blooded, bring the body warmers through\n\n[Hook]\n\n[Verse 2]\nYeah, dude been stuck to this throne, nobody movin me out\nWhen I ran with a click niggas made movies about\nNiggas be swearin shit again till that Uzi come out\nBeen subjected to the wild life since I was young\nSixteen when I first got pissed in the slum\nPlenty bitches, drugs and money, won't mention the guns\nMake a chick take the gum out her mouth, replace it with cum\nJake raided, I'm in the bed with a bitch, an inch from a Glock\nATF with a fuckin punk that's sent from a cop\nMy dog got tied up and whipped in the spot\nFace covered to get 'em, rape the bitch with 'em\nNiggas in your crib speed up your heart pace rhythm\nLife to me is doin dames that'll soothe the growin pains\nCan't be mad that a nigga tryna grow and change\nShots at another nigga face like it's Novakane\nGet it right big par, KGR you know the name\n\n[Hook]"}]}