{"songs": [{"title": "Free Young Buck (Freestyle)", "lyrics": "[Intro]\nYeah let's take this shit back, uh\n(Whoo Kid!) Y'all remember that right?\nThis Buck, Cashville, y'all know\n\n[Verse 1]\nUh, way back in the day\nDeep, deep down south where the nigga had a lil pack of yay\nCause the nigga with the big AK\nTryna rob everybody round here where I stay\nBack then I was at your house party\nHad your little sister on the walk in loose\nPour a little Hen in the punch in the juice\nUsed to take a one on one back then for a boost\nCouldn't step in the booth\nTalk that shit, nigga had to know you was the truth\nCouldn't lie what your life bout\nHad to tell these folk what you really goin' through\nThe rap game on some other shit\nThey ain't tellin' what they doin', tellin' what they gon' do\nGet caught up with a couple bricks\nAnd guess what nigga, they tellin' on you\nSee I'm still on this Scarface shit\nGotta kill these niggas, you tellin' on who?\nI can't just turn my back on the trap\nI'm out here sellin' it too\nI'm connected all in Cali\nPounds of the kush, we lettin' it through\nAnd a nigga tryna spread the love\nSo what y'all niggas really ready to do?\n\n[Hook]\nI'm just tryna bring it back to the Master P days\nMake the pot say, ughhh\nMake the pot say, ughhh\nI can bring it back like, ughhh\nI'm just tryna bring it back to the Master P days\nMake the pot say, ughhh\nMake the pot say, ughhh\nI can bring it back like, ughhh\n\n[Interlude]\nYou bout it? Yeah\nI'm bout it, bout it, you know\nAy where you from homie?\nYou know that dirty south gangsta shit, ay put your hood up\n\n[Verse 2]\nI represent, it's G-Unit gang\nCountry nigga all in Queens sellin' cocaine\nI fuck that white girl, I push that dog food\nI know ways to make sure we get it all through\nI fuck with gang members that's gon' die about it\nI fuck with lean sippers that's gon' die without it\nYou got it? Cause I got it, got it\nI roll with the windows up, cloudy, cloudy\nShit chill, I got bricks here\nSellin' dope out the house and I live there\nSo many came to the South think I kill here\nI'm just tryna figure out why I'm still here\n\n[Interlude 2]\nAy let me hit that\nI'm bout to elevate, elevation\nTryna elevate on you niggas\n\n[Verse 3]\nSwitchin' positions in this (?)\nI'm all in Tucson\nTryna meet this Cuban\nHe not the plug but he said he knew some\nYou're gonna have to keep your mouth closed if I let you come\nIf I get you this I'm gon' have to kill ya if you run\nPosted in the front of the church pew with two guns\nPrayin' that the Lord let me make it through with these 2 tons\nKnowin' niggas with me just to see if I give you one\nFunny how when you get rich niggas think that you dumb\nWhere you from?\nWhere I'm from murder's always the outcome\nYour strap is like your everything you can't leave home without one\nMan they got me puttin' my gun in the hand of my son\nSomebody come in this house then y'all gon' see what I done\nWhy I'm keepin' so much reefer now in my lungs\nI tell 'em I've been pissin' on probation for the last three years\nYou ask me if we hot right now, yes we is\nIs 2Pac missed nigga? Yes he is\n\n[Interlude 3]\nHey man I never seen\nSeen so many people this point man in my life homie\nI'm one of those people\nIt's all the real niggas that's not here no more\nRest in peace\n\n[Verse 4]\nFirst you here, before you know it, it's too late y'all\nClose your eyes then you think about Nate Dogg\nLil Flat, Lord Infamous, they died real\nDJ Screw, Fat Pat, Pimp C died trill\nSoulja Slim, Doe B\nNow all the ladies drop Left Eye left tear\nBig Pun, Biggie Smalls, A$AP Yams too\nEazy-E, ODB, man this can't be true\nGang Starr, Mac Dre, Jam Master J\nHeavy D, Slim Dunk, and he was from the A\nStatic Major, Lil Wayne had him on his way\nLil Snupe, I seen him with Meek just the other day\nIt's okay y'all the truth here\nI know Eminem feelin' like me, we wish Proof was here\nObituary like a souvenir\nWe just look at 'em and reminisce about when you was here\n\n[Interlude 4]\nSomebody pour up, yeah\nI ain't fuck with that old fake ass purp they got out here right now\nGive me the red Hi-Tec, shit ain't no Actavis\nYessir, Three 6 Mafia featuring UGK up in this joint\nWe about to sip on this sizzurp\n(There's about to be a whole lotta sippin' it up\nPourin' it up, drankin' it up\nGoin' on round here in the EST boy)\nY'all know how we do it\n(Now pour it on up)\nOh and I fuck with the yellow too\n\n[Bridge]\nSippin' on some sizzurp\nSip, sip, sippin' on some sizzurp\nSippin' on some sizzurp\nSip, sip, sippin' on some sizzurp\nSippin' on some sizzurp\nSip, sip, sippin' on some sizzurp\nSippin' on some sizzurp\nSip, sip, sippin' on some sizzurp\nSippin' on some sizzurp\nSip, sip, sippin' on some sizzurp\nSippin' on some sizzurp\nSip, sip, sippin' on some sizzurp\n\n[Verse 5]\nI'm still poppin' these pills, I ain't new to this\nI put yellow tuss and ex on big old blunts of cannabis\nI sip Hi-Tec by the pint tryna see just how high I can get\nIt's an embarrassment just to hear a nigga say \"I quit\"\nYeah that Actavis I like but I can't pay for that fake shit\nDon't know what's that in your Sprite, woah purp niggas make me sick\nShe said \"Buck you takin' flight\" least that molly got me right\nPlus these niggas doin' all this snitchin' baby I've been outta (whoo)\nI've just been sippin' on some sizzurp\n\n[Outro]\nYeah you know they was countin' me out\nI was so well countin' up and\nNow the whole world countin' on me\nIt's Buck, yeah (Whoo Kid)\nHaha, yeah", "album": "The Lost Flash Drive", "year": "2016-08-30", "image": "https://images.genius.com/2ced1afbb09f3175cd7f494e97386794.800x800x1.jpg"}], "artist": "Young Buck"}