{"artist": "Yung Bans", "songs": [{"album": "MISUNDERSTOOD", "image": "https://images.genius.com/96f7e4381a7e85c9840d3d332b3496f5.1000x1000x1.png", "year": "2019-07-24", "lyrics": "[Intro: 03 Greedo]\nReady, set, go\n(You have 937 messages)\n03, Yung Bans on these hoes\n(Goose with another one)\n\n[Pre-Chorus: 03 Greedo]\nReady, set, go\nWe gon' get back on\n03, Yung Bans on these hoes\nLet these bitches know\n\n[Chorus: Yung Bans]\nLike ready, set, go, ready, set, go\nReady, set, go, ready, set, go\nReady, set, go, ready, set, go\nReady, set, oh, ready, set, go\n\n[Verse 1: Yung Bans]\nYeah, diamonds on me white on white like Ku Klux, yeah\nI'm on house arrest, but I still blew up\nYeah, my watch man changed my rings, cost a cool hundred\nHey, bitch, I came from nothin', turned it into somethin', yeah\nTurned it into somethin', now your bitch is fuckin', ayy\nLate night bustin', uh, pussy wet, gushin', ooh\nMe and Greedo stuntin', huh, niggas lame, fuck 'em, uh\nStrapped up, rubber, yeah, draped in Undercover\n\n[Verse 2: 03 Greedo]\nReady, set, go, Ksubi on my clothes\nBalmain on my toes, I can't trust these hoes\nI can't do these numbers, I can't trust these 304s\nMr. 103, yeah, I'm from the West Coast\nBut I don't rep that shit, East Side, we Crippin', bitch (Baby Loc)\nI can't touch this bitch, you should get tested, bitch (Kitty too strong)\n'Cause I smell that stench, yeah, bitch, I smell that stench (Gotta go)\nBitch, I'm on the mound, I'm just tryna make a pitch\nReady, set, go\nI was in the club, VIP, went to his show\nSay he like my flow\nTold me I was ready, we should hit the studio\nGrew up off the legends, now I'm a legend for sure\nMe and Yung Bans got that money but it's old\nWe can't trust these hoes, we can't trust these 304s\nReady, set, go, better use your feet, bitch\nUse your tiptoes, bitch, go\n\n[Pre-Chorus: 03 Greedo & Yung Bans]\nReady, set, go, go\nLeave you 'til the sun out, do it at the show\nReady, bitch, go\nReady, set, go\nMake that bitch pose\nMr. 3-0\nThat's what she told\nHey, get it out the mud\n\n[Chorus: Yung Bans]\nReady, set, go, ready, set, go\nReady, set, go, ready, set, go\nReady, set, go, ready, set, go\nReady, set, go, ready, set, go (Ready, set, go)\n\n[Outro: XXXTENTACION & Yung Bans]\nI was just callin' you to let you know I'm finna do the song\nAyy, bruh, bruh, do it, do it, and then call me, nigga\nAlright, I got you\nI'ma see you back in Miami\nAlright, bro\nGang\nReady, set, go, ready, set, go\nReady, set, go, ready, set, go\nWanna hear somethin' fire?", "title": "Ready Set Go"}]}