{"songs": [{"title": "Can’t Keep Livin", "lyrics": "Ay let me get that ski-mask D-Tay\nPriest, load up the strap mayne\nLet me go get some money mayne\n\n[Young Buck]\nLife ain't 'posed to be like this, robbery and poverty\n24 hour shifts to keep this cocaine off of me\nY'all ain't livin how I'm livin, one mo' week I'm seein prison\nCause to get what I'm after, a nigga might be missin\nI ain't listenin to shit, hit the Sweet and load the clip\nCause if crime didn't pay, then I'd be still on the strip\nYou niggas still runnin yo' lips, I be runnin them zips\nUp and down the interstate, makin ten G's a trip\nA hardheaded nigga, do whatever it takes\nTo go and get that bread nigga, heard what I said nigga?\nBeen misled for a long time, waited in a long line\nFinally I'm here, now this rap game is mine\nKeep the herb burnin, ain't nuttin changed cause I'm worth somethin\nY'all know the Young Buck, I'mma leave this earth bluntin\nBut still carry, the chrome Dirty Harry\nCause your boy got to have that, by any means necessary\n\n[Hook: repeat 2X]\nHey - I can't keep livin this way\n'Bout to load up my fuckin AK\nMy mission is to go and get paid\nGet paid\n\n[Young Buck]\nAin't no nigga out here heaven-sent, not on these streets\nE'rybody want the Presidents cause niggas gotta eat\nSo I try to leave no evidence and come when you sleep\nIn your residence nigga until my mission's complete\nStay draped in my heat, paranoid like that\nYou kill me? R.I.P. I got boys like that\nWho said they needed a white pack to strike back, shit\nJust give me the right mac and nigga I'll be right back\nHardcore, and show these niggas they don't want war\nYou want more? Well gimme what I'm here for\nY'all know I been raw, from day one\nThis teenager with the big boys, gettin the job done\nGot a daddy, but he ignored both of his sons\nHad to pay for my own way, as a child on the run\nI ain't scary, the AK-47, I married\nCause a nigga had to have that by any means necessary\n\n[Hook]\n\n[Young Buck]\nLook what y'all done to me, forced a nigga to this point\nWouldn't feed me when I was hongry, I couldn't ignore it\nBut I stay to my - lonely, and didn't show it\nSo when I killed you and your homies, you wouldn't know it\nCristal I let you po' it while I fuck with the Hennessy\nAll this time I'm the nigga that you pretend to be\nTables done turned now I'm like \"Remember me?\nThe same lil' nigga you overcharged for a ki\"\nTimes hard on a G, you was larger than me\nYoung, but I ain't dumb, you ain't smarter than me\nGive niggas a inch, and they takin the whole mile\nSo I hop out the 6, and I takin they whole pile\nUh-uh whoa now, how many niggas see this grown child\nShit gettin hectic then you shut 'em down\nTennessee to Uptown, niggas is thuggin, mean muggin\nAin't no stoppin I'm hot, and the game is what I'm lovin nigga\n\n[Hook] - 2X w/ ad libs\n\nGet money nigga!", "album": "T.I.P.", "year": null, "image": "https://images.genius.com/d018174ecb7b887477659509ddf44ca3.499x499x1.jpg"}], "artist": "Young Buck"}