{"songs": [{"image": "https://images.genius.com/826c5df8eea3fb88d213c3fb10f319a8.1000x750x1.jpg", "lyrics": "Dude, I'm starting to realize it's not my fault that I can't have a good time when I go out\nWhen I leave the house for that matters. Yo\nFor the chicks in expensive clothes\nLooking for a place to stick their nose, standing there in a bitchy pose\nWith your arms crossed acting like you're too beautiful\nTo have a good time... NOBODY LIKES YOU!\nTo Gregory, the guy of my job\nThe two-faced snob, that will stab you in the back for a raise\nAnd he starts another workroom on every other day\nMan fúck him and say NOBODY LIKES YOU!\nAnd to the frab boys\nRacist; rowdy; violent; toxicated; acting real childish\nDaybreak drugs, abercrombie, co-add\nThey get Dave Matthews band-fanshirts NOBODY LIKES YOU!\nTo the white girls that act like gangsters, and talk like:\n\"Aww hell no girl, that bitch keep looking at me\nI'm a go get my motherfúcking shotgun out the trunk\"\nYeah yeah yeah yeah yeah shut up. NOBODY LIKES YOU!\nI'm gonna die but it's not my time\nI got a warm ass heart that I cannot find\nBut the pressure in the world is gonna break my spine\nSo I gotta let it out right now\nLike F*CK YOU ALL!\nThere's a club in my city called \"Blonde\"\nIt's like a freaking nightclub version of Bed Bath & Beyond\nYou got a fake tan 'til your skin turns bronze\nIf you wanna get in but uh NOBODY LIKES IT!\nCool man you got a new car\nIt's got a nice stereo in it. All the windows are tanned\nYou got leather seats and the rims were expensive\nBut shut the up about it: NOBODY LIKES IT!\nTo the guys, that manufacture XTC, thank you\nIt dehydrates you and fills your head with brain goose\nSomebody created techno music on your dumb synthetic drug man\nNOBODY LIKES IT!\nEvery four years the presidenticy could be different\nBut everybody's lazy and no one wants to listen\nThere's powers and numbers but people wanna play videogames\n'cause man fúck voting. NOBODY LIKES IT!\nAh, club sive\nEy yo yo yo yo\nHey man, complaining that you don't hear good music on the radio and you don't see good music on mtv and shit. It's like complaining that you can't get a good f*cking steak at T.G.I. Friday's. Which you can", "year": null, "album": null, "title": "F*ck You All"}], "artist": "Mac Lethal"}