{"artist": "Benzino", "songs": [{"lyrics": "[Teddy Riley]\nUh, Check it out\nHere it goes\n\n[Mr. Gzus]\nStep up in the club, what did I see?\nB double O double T double E\nAll 'round me\nDuckin the tricks around me\nLook it's soft as Downey\nNever wait for the plug, she found me\nAs I nod to the beat, and down some Re-mi\nGettin tit-ty, smokin minty, gettin crispy\nDimes in line from the shine, they can't miss me\nI rep the 3, Benzino and Twice G\nI rep the Bean, I hold it down for my team\nMake no mistakes, I wanna rake that backyard\nKeepin mad links in the 'yac (?)\nLord, Lord, check the design\nJoe Dash but I'm tryin to make that ass mine\nPlayer always on the grind scopin some take home\nCreepin, bonin, see you in the mo'nin\n\n[Chorus - Teddy Riley]\nBooty, booty\nBooty, booty\nI see booty\nI see booty\n\n[Teddy Riley]\nUh, aiyyo, it's time to shake that ass baby\nWiggle it and make it last baby\nTake it off and I'll give you a little cash baby\nBooty bangin like the bass in the cape, uh\nCall your friends, come and hang with my click, uh\nCome to the mansion with that think and them tits, uh\nYou can get it if you slimmer your thick, uh\nAiyyo it's T.R., I be the dude from the east\nCollaboration with the Made man, movin ya feet\nAiyyo my party people dance to this (uh)\nGet ya roll on, wave ya hands to this (what)\nLadies show ya thong, drop ya pants to this (wha-what)\nHop inside the Benz and get tampered with\n\nYou can get it even if your glamourous, feel me, feel me?\nThe way you shake that ass it's like you tryin to kill me\nI'm with the sex you need, so baby heal me\nTeddy Ted and Made Men, what you forgot me\n\n[Chorus]\n[Benzino]\nBoottee ass niggas that's there for blastin\nSmith and Wesson turn ya into ashes\nAssassin, that's me if ya askin\nGet ya frame bent up, wrapped in plastic\nWho got the game mastered? Benzino, bastard\nI lasted, stepped the game up and passed it\nBoottee ass niggas wanna do this thug shit\nFlash all night but your jewels are busted\nWe cop bottles, flocks, my motto's\nBenzino's 'bout to drop, and that's a problem\nMatta fact, that's a promise\nYou spit trash, your man is garbage\nI whip cars, fast and forty\n7 Class, six sedans aboard us\nBoottee ass niggas wanna please the ass man\nFake copin whips, no cash protection\nGet outta here!\n\n[Chorus]\n[Benzino] 3x\nRidin thru these streets in my Range, and all I see is..\n(Booty, booty, booty, booty)\nPull up to the club on dubs, and look at here\n(Booty, booty, booty, booty)\nBitch type niggas try to creep, they whole crew..\n(Booty, booty, booty, booty)\nDon't cock block, stick a dime in the G for the..\n(Booty, booty, booty, booty)\n\n[Teddy Riley] 8x\nI see booty, I see booty", "image": "https://s3.amazonaws.com/rapgenius/91e679c8210dab2c79d0611be49e28ef.jpg", "year": null, "title": "Boottee (remix) (a cappella)", "album": null}]}