{"artist": "C-Rayz Walz", "songs": [{"title": "Nann God", "album": "The Prelude", "year": "1999-12-31", "image": "https://images.genius.com/ec963359d22a35a29c442701ff7a7d34.500x500x1.jpg", "lyrics": "[Intro]\n[MINdDitect]\nWord is bond.  I’m tryna talk to the God, C-Rayz.  He over there, smelling like frankincense and myrrh.  I’m saying, “Shorty is shining.”\n[C-Rayz Walz]\nYeah?  So you saying I always nice, right?  Yo.  Hey, hey, hey, hey, hey, hey!\n\n[Verse 1: C-Rayz Walz]\nYou don't know Nann God that live the truth like me\nShow and prove like me, cook vegetables, eat fruit like me\nAnd you don't know Nann God that elevate they flow\nWhile others strive for dough, I live my culture and say so\nYo, you don't know Nann God that don’t act like a slave\nPlus, my degrees ain’t trained—I bring sunshine with the rain\nAnd you don't know Nann God that’ll understand your jewels\nWithout pride or ridicule.  Take trips in the mind and visit you\nYou don't know Nann God with energy like C\nRayz Walz make a slave get free and live your true identity\n‘Cause you don't know Nann God.  Earth, earth\nYo, you don't know Nann God.  Yo, yo, yo\nYo, you don't know Nann God that preserve theyself like me\nAnd you don't know Nann God that got more [?] than I do, queen\nAnd you don't know Nann God.  I don’t care what name they wear\nUse black soap to wash my hair, choose rap coats to rock all year\nAnd I don't know Nann Queen that bless the king like you\nQuestion everything like you.  Shorty, guess what?  I like you\nAnd I rock the mic like you.  For life, I got to fight like you\nUse true light to see right through all them things them devils do\n‘Cause they don't know Nann God.  Earth, earth\nYo, they don't know Nann God\n\n[Bridge]\n[MINdDitect]\nYou saying I’m water, son.  You know’m saying?\n[C-Rayz Walz]\nWhat, what?  Yo, you don't know Nann God\n[MINdDitect]\nDon’t mistake me for someone that don’t got knowledge of self.  You know’m saying?\n[C-Rayz Walz]\nYeah.  Aight, I hear that\n[MINdDitect]\nNah, do you hear me for real?\n[C-Rayz Walz]\nDo the knowledge.  That’s peace\n\n[Verse 2: MINdDitect]\n‘Cause you don't know Nann Queen who’s head wrap ain’t a trend\nCrush the walls of ignorance, got more going on than just the rent\nNah, you don't know Nann Queen who can cook the tofu like me\nClean your system out with green tea.  Don’t memorize, live 120\nNow you don't know Nann Queen who cherish truth like me\nAnd you don't know Nann Queen who can only deal in equality\nNah, you don't know Nann Queen who can make the universe split\nRip the mic and straight rip that shit, flood you out with every time I spit\nNah, you don't know Nann Queen who loves the Gods like I do\nFeeds off high energy foods, meditate to keep us in tune\nNah, you don't know Nann Queen who love to build all the time\nOne whose thoughts is clearer than mine—shine so bright, I give sight to the blind\nNah, you don't know Nann Queen, God.  See?\n‘Cause you don't know Nann Queen, God.  See what’m saying?\n\n[Bridge 2]\n[C-Rayz Walz]\nNope.  Oh.  So if you the queen, we got to be a queen and king together, understand?  We no Nann, make this universe expand.  Hold hands for the whole universe\n[MINdDitect]\nYou know’m saying?  I’m saying I’m shining, you shining.  Why don’t we just shine together?\n[C-Rayz Walz]\n[I don’t get the?] queen here\n[MINdDitect]\nI’m saying.  You see the [?]\n\n[Verse 3: C-Rayz Walz]\nYou don't know Nann that admit when they don’t know\nClean the house, cook, wash the clothes, make the bed and mop the floor\nYou don't know Nann who [?] reflections of Allah\nDrinking water at the bar, returning home like Jafar\nYou don't know Nann that be looking good like me\nMy spirit is beauty.  And that’s truly what you see\nWho say, “Peace,” and mean it like me\nRayz receive equally\nWear fatigues, drink green tea\nDitect MINd.  Earth, you don't know Nann\nYo, you don't know Nann"}]}