{"songs": [{"title": "Earth", "album": "LD2", "year": "2019-04-18", "image": "https://images.genius.com/92258203457dab98b5e2de0924837c00.1000x1000x1.jpg", "lyrics": "[Intro: Lil Dicky]\nWhat up, world? It's your boy, just one of the guys down here. Well, I could be more specific. Uh, I'm a human, and I just wanted to, you know, for the sake of all of us earthlings out there, just wanted to say:\n\n[Chorus: Lil Dicky]\nWe love the Earth, it is our planet\nWe love the Earth, it is our home\nWe love the Earth, it is our planet\nWe love the Earth, it is our home\n\n[Justin Bieber]\nHi, I'm a baboon\nI'm like a man, just less advanced and my anus is huge\n\n[Ariana Grande]\nHey, I'm a zebra\nNo one knows what I do, but I look pretty cool\nAm I white or black?\n\n[Halsey]\nI'm a lion cub, and I'm always getting licked (Meow!)\n\n[Zac Brown]\nHow's it going? I'm a cow (Moo!)\nYou drink milk from my tits (Moo)\n\n[Brendon Urie]\nI'm a fat, fucking pig\n\n[Hailee Steinfeld]\nI'm a common fungus\n\n[Wiz Khalifa]\nI'm a disgruntled skunk, shoot you out my butthole\n\n[Snoop Dogg]\nI'm a marijuana plant, I can get you fucked up\n\n[Kevin Hart]\nAnd I'm Kanye West\n\n[Chorus]\nWe love the Earth, it is our planet\nWe love the Earth, it is our home\nWe love the Earth, it is our planet\nWe love the Earth, it is our home\nWe love the Earth\n\n[Adam Levine]\nBa-dum-ba-dum-dum, ba-dum-da-di\nWe are the vultures, feed on the dead\n\n[Shawn Mendes]\nWe're just some rhinos, horny as heck\n\n[Charlie Puth]\nI'm just a giraffe, what's with this neck?\n\n[Sia]\nHippity-hop, I'm a kangaroo\nI hop all day, up and down with you\n\n[Miley Cyrus]\nI'm an elephant, I got junk in my trunk\n\n[Lil Jon]\nWhat the fuck? I'm a clam!\n\n[Rita Ora]\nI'm a wolf. Howl!\n\n[Miguel]\nI'm a squirrel, lookin' for my next nut\n\n[Katy Perry & Lil Dicky]\nAnd I'm a pony, just a freak horse, heh-heh-heh\nBut, uh, c'mon, get on (Get on, yah!)\nGiddy up, let's ride\n\n[Lil Yachty]\nI'm HPV, don't let me in\n\n[Ed Sheeran]\nI'm a koala and I sleep all the time\nSo what? It's cute\n\n[Meghan Trainor]\nWe love you, India\n\n[Joel Embiid]\nWe love you, Africa\n\n[Tory Lanez]\nWe love the Chinese\n\n[Lil Dicky]\nWe forgive you, Germany\n\n[Chorus: Lil Dicky, (Snoop Dogg), Meghan Trainor, Lil Dicky & Sia, John Legend]\nEarth, it is our planet (It's our planet)\nWe love the Earth (We love the Earth), it is our home (Home)\nWe love the Earth, it is our planet (It is our planet)\nWe love the Earth, it is our home\nWe love the Earth\n\n[Verse 3: Lil Dicky]\nI'm a man (Hello?)\nCan you hear me? (Anyone out there? Hello?)\nI've trudged the Earth for so damn long\nAnd still don't know shit (What's going on?)\nI hope it's not a simulation (Huh)\nGive each other names like Ahmed and Pedro\nAnd, yeah, we like to wear clothes, girls still look beautiful\nAnd it covers up our human dick (Woo), eat a lot of tuna fish\nBut these days, it's like we don't know how to act\nAll these shootings, pollution, we under attack on ourselves\nLike, let's all just chill (Hey), respect what we built (Hey)\nLike look at the internet! It's cracking as hell\nFellas, don't you love to cum when you have sex? (Ayy)\nAnd I heard women orgasms are better than a dick's (Uh)\nSo what we got this land for? What we gotta stand for?\nLove, and we love the Earth (The Earth)\n\n[Ariana Grande]\nOh, yeah, baby, I love the Earth\nI love this planet\n\n[Lil Dicky]\nHey, Russia, we're cool\nHey, Asia, all of you, c'mon\nEvery one of you from the plains to the Sahara\nLet's come together and live\n\n[Choir]\nHum-dum-dum-dae-dum, hum-dum-dum-dae-dum\n\n[PSY]\n우-우-우리는 지구를 사랑해요\n\n[Bad Bunny]\nAmamos la tierra\n\n[Kris Wu]\n我们爱地球\n\n[Outro: Lil Dicky, Ariana Grande & Justin Bieber]\n(We love you, we love you)\nC'mon everybody, I know we're not all the same\nBut we're living on the same Earth\n(We love you, we love you)\nHave you ever been to Earth?\nEveryone who is listening has been to Earth, Ariana\n(We love you, we love you)\nWe're not making music for aliens here\nAre we gonna die?\nYou know what, Bieber? We might die\n(We love you, we love you)\nI'm not going to lie to you\nI mean, there's so many people out here who don't think global warming's a real thing. You know? We gotta save this planet. We're being stupid\nUnless we get our shit together now"}], "artist": "Lil Dicky"}