{"songs": [{"image": "https://images.genius.com/f8261fdc999cab53896c0ed981b75638.500x500x1.jpg", "lyrics": "{Cooch ad-lib]\nOh man!\nAy yo Murda!\nWe got these niggas scared!\nThese niggas is scared son! (ha ha!)\nYou niggas don't want it with us!\n\n[Uncle Murda ad-lib]\nBrooklyn! GMG! Banger music! GMG!\n\n[Hook:]\nWhen I check niggas I be putting bullets in their face\nYeah it's black and yellow, black and yellow, black and yellow tape (bang!)\nWe don't tell on ourself this ain't the first 48\nYeah it's black and yellow, black and yellow, black and yellow tape (yeah!)\nMy fully loaded calico put niggas in their place\nYeah it's black and yellow, black and yellow, black and yellow tape (oh!)\nThe crime scene getting investigated by the jake\nYeah it's black and yellow, black and yellow, black and yellow tape (huh)\n\n[Verse 1:]\nIf I don't spit the hottest bars you ever heard (what?)\nThen Big Meech wasn't flipping no birds (damn!)\nBob Marley wasn't puffing no herb (cough)\nAnd them pappies in Harlem don't stand on the kerb (ha ha!)\nIf I ain't the definition of keeping it real\nThen Eminem ain't nice he don't got no skills (oh!)\nOn some G shit (what that?), if I'm beefing with 'em\nMy hooligans is killing whoever eating with 'em (go 'get em!)\nHe a business man they killing who in the meetin' with him (he in a suit?)\nHe at the hotel kill the chick that's creepin' with him (she cute?)\nGun smoke, bullets flyin', his funeral 4 days later, his fam cryin' (ah!)\nMy little major hype I call him the beretta kid (Nemo!)\nHe like yo let me go and kill his relatives (yeah!)\nHe said that when we drove past the way\nI start laughing, like not now nigga wait (ha ha!)\n\n[Hook:]\nWhen I check niggas I be putting bullets in their face\nYeah it's black and yellow, black and yellow, black and yellow tape (yeah!)\nWe don't tell on ourself this ain't the first 48\nYeah it's black and yellow, black and yellow, black and yellow tape (bang!)\nMy fully loaded calico put niggas in their place\nYeah it's black and yellow, black and yellow, black and yellow tape (Brooklyn!)\nThe crime scene getting investigated by the jake\nYeah it's black and yellow, black and yellow, black and yellow tape\n\n[Verse 2:]\nIf I ain't the realest nigga spittin' (what?)\nThen Jordan wasn't the best it was Scotty Pippin (huh!)\nIf I ain't the prophecy of all of the thugs\nThen them Mexicans don't know nothing 'bout drugs (esse!)\nAnd The Game n Lil Wayne, ain't blood (soo-wee!)\nAnd that nigga snoop dogg, ain't cuz (wee!)\nOn some G shit, when it's time to ride\nAnd my gun bang! Homicide (bang!)\nI'm on point (yeah!), fully prepared\nThey breathe the same air as me, I'm never scared (never!)\nI put the burner on the dresser\nThen pick it right back up after I sex her (shorty!)\nMy chick want smell my dick before she suck it\nI wiped it all good, she can't tell I was fucking (ha ha!)\nIf I ain't the truth, then Malcolm X ain't ever\nHave a chopper up by his window ready to shoot (damn!)\n\n[Hook:]\nWhen I check niggas I be putting bullets in their face\nYeah it's black and yellow, black and yellow, black and yellow tape (yeah!)\nWe don't tell on ourself this ain't the first 48\nYeah it's black and yellow, black and yellow, black and yellow tape (we gon'!)\nMy fully loaded calico put niggas in their place\nYeah it's black and yellow, black and yellow, black and yellow tape (bang out!)\nThe crime scene getting investigated by the jake\nYeah it's black and yellow, black and yellow, black and yellow tape\n\n[Uncle Murda ad-lib]\nThese niggas is square, lames\nIt's a wrap y'all (it's a wrap y'all!)\nThis for the niggas that getting money and bang\nI'm back y'all (I'm back y'all!)\nThey don't want me in, they want me out\nI know this (I know this!)\nBut I'm a shut them down, 'cause I could\nI'm focussed (I'm focussed!)\n\n[Hook:]\nWhen I check niggas I be putting bullets in their face\nYeah it's black and yellow, black and yellow, black and yellow tape\nWe don't tell on ourself this ain't the first 48\nYeah it's black and yellow, black and yellow, black and yellow tape\nMy fully loaded calico put niggas in their place\nYeah it's black and yellow, black and yellow, black and yellow tape\nThe crime scene getting investigated by the jake\nYeah it's black and yellow, black and yellow, black and yellow tape", "title": "Black and Yellow", "year": "2013-01-24", "album": "The First 48"}], "artist": "Uncle Murda"}