{"artist": "9th Prince", "songs": [{"album": "Prince of New York", "lyrics": "[Intro: 9th Prince]\nWord up, some laid back, type Killa raps\nYo...\n\n[Chorus 2X: 9th Prince]\nI'm a writer, rhyme ignitor\nLyrical sniper, shoot up your rhymin' cypher\nMushrooms get me hyper, face the piper\nRich niggas do a drive-by in a Dodge Viper\n\n[9th Prince]\nAiyo, I move like the Bionic Man, built like The Incredible Hulk\nThe streets listen when I talk\nYou just a devil in disguise, with a mic as a pitchfork\nCome against the lyrical lord, we can take it to the guns and swing swords\nSo look deep into the eyes of a killa, Gaten Island, cap pealers\nRaps is realer than silver back gorillas\nWe thugs from a great complex, lyrical Nat Turner\nStaten Island money earners, 9th Prince with the burner\nWhether inspector's, wanna search my bulletproof Lex Coupe\nDesert Eagle stashed in my fireman's boots\nRunnin' with four hundred Brooklyn troops\nDressed in all suits like the Nation of Islam\nShoot somethin' in your veins and watch you die calm\nLike a dope addict, my automatic'll lift your back like Craftmatic\nLike a cellphone with no signal, givin' niggas static\n\n[Chorus 2X]\n\n[9th Prince]\nDon't get caught up in the hot jam, shit is a scam\nPredictable like the Wu not invited to Summer Jam\nI'm sick of niggas trynna sell me a dream with weak schemes\nKillarm', the 18, rap guns is like M-16's, everybody flee the scene\nNo matter the producer, I still get looser than Medusa\nNeptunes or Dr. Dre, my lyrics, the beat's executioner\nInspired by The RZA, I'm calm like James Bond, city slum scramblers\nI was raised in the ghetto slammer\n9th Prince is like Max Payne and Jack's Hammer\nI'm known to be the flow'er, but now call me Thor, let it flow like Noah\nShoot you in your shoulder leave you with a handicap composure\nMadman exposure, got niggas movin' like doljias\nAnd it's over, it's over, it's over, straight over\n\n[Chorus 2X]\n\n[Outro: sample from \"Patton\"]\nYou know what the poet said:\n\"Through the travail of ages, midst the pomp and toils of war\nHave I fought and strove and perished countless times upon a star.\"\nThe age-old strife I see? Do you know who the poet was? Me", "year": null, "title": "The Writer", "image": "https://images.genius.com/5491ced6515f8b9c5af8dbaefebec9df.300x300x1.jpg"}]}