{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Liquor, Niggaz And Triggaz", "album": null, "lyrics": "[X-Raided]\nNigga recognize, I'm that muthafuckin loc\nOl' E drinkin got me high, Givin head to my. 44\nThey can't blame me for the actions I'll take\nIn the sick state of mind, I premeditizzate\n51-50 as my brain liquefies\nEvery swig a nigga take, Crazy thoughts intensify\nI'm ready to ride\nI'm Mr. Hyde but murderin Dr. Jekyll\nYou ain't fuckin with a psycho no more\nX-Loc is goin Kleptomaniac\nStealin your life cause I gives a fuck sbout ya\nThat why I'm using that. 44\nTo blow them brains up out your dome\nSlick green shit hittin the concrete\nFool, you's a victim if you saw a nightmare street\nI'll shoot in the head and let that ass decay\nYou been layin in the street so long\nYour brains is turnin grey\nYou niggas can't deal with a fool\nThat's full of that Ol' E liquor shit\nI'm runnin around town with a badass attitude and two extra clips\nBut A. 44 automatic, nigga you know you gotta duck\nEither that or be another victim of a muthafuckin slaughter\nPest better hold his chest\nThe. 44 Magnum got me stressed\nMy mind was tellin me no but the 40 oz. Kept tellin me yes\nHe had on a vest but I still managed to leave that ass for dead\nCause there ain't one muthafucka in the whole wide world\nWith a bulletproof forehead\nSo when you see me swiggin that Ol' E liqour\nHold your breath, I'm slammin the bottle upside your dome\nWhere there ain't nothin left, cuzz\n\n[Hook: Brotha Lynch, (Sicx)]\nCause I don't love you hoes, I don't love you niggas\nAll I'm givin a fuck is about my liquor and my triggaz [2X]\n\n(Yeah, When I'm off that Ol' E)\n(When I'm off-When I'm off that Ol' E)\n(Loc, Better watch yo back on nervous mode)\n(For really though-Really though, Yeah) [2X]\n\n[X-Raided]\nI'm chewin on slugs, Eatin 'em up\nDrinkin your blood like liquor\nIt's all because I'm given a fuck\nAnd I got no love for you niggas\nI'm leavin it up in the house\nWhen it's time to ride and create some death\nOnly thing I got with me is a 40 of E\nAnd the dank and a vest\nFor me to be pourin it out for the next muthafucka restin in peace\nI love my Homies and G's\nBut it's ebk when they trigga with me\nFor those who don't know, It's Every Body Killa\nStep on back, Ain't no time to try to be cute G\nWhen the funk jumps, I'm peelin that cap\nAny reason to murder\nIs enough for me to put some of these hot ones on ya\nNigga run on up, go ahead\nYou could be a victim if you wanna\nAin't no thang to me\nWe can do it anyway you wanna do it\nIt'll hurt you more than it'll me\nWhen I put these bullets to it\nBlow them brains up out yo dome\nWith A. 44 Caliber Magnum Chrome\nOnly thing at the scene is 40 oz. Bottle but all of the liquor's gone\nThey lookin for a muthafucka\nBut fool, They'll never find a loc\nYou get in the shower\nI'm asshole naked and right behind your door\nSick like Norman Bates, I'm murderin like a muthafuck\nWith a gun in one hand, A 40 in the other\nI'm tore up and hella drunk\nLike Jimmy Jones and David Koresh\nI'm havin them fools stressed\nDrinkin Cyanide, burnin they selves up\nTryin to get the fuck away from the X\nBut ain't nowhere to hide\nLet me play that Jack Kevorkian\nI'm Dr. Death, Assistin to suicide\nWhen I put in my clip, It's click\nI c*** it back, It goes clack-clack\nThat's one in the chamber\nOne for your nuts and one for your bitch's kat\nI'll swig my 40 to that\nBut fool, I ain't pourin out not one drop\nStraight sick in the dome\nI thought you knew, my nigga\nThat's on the Blocc\n\n[Hook: Brotha Lynch, (Sicx)]\nCause I don't love you hoes, I don't love you niggas\nAll I'm givin a fuck is about my liquor and my triggaz [2X]\n\n(Yeah, When I'm off that Ol' E)\n(When I'm off-When I'm off that Ol' E)\n(Loc, Better watch yo back on nervous mode)\n(For really though-Really though, Yeah) [2X]\n\n[X-Raided]\nWhen I die and it's time for autopsy\nLet my homies do it\nThey could pump me up with Ol' E gold\nInstead of Embalmin Fluid\nAnd when you bury me\nPut a 40 and a gun in the casket with me\nSo I could be buzzin\nWhen my cousins come to hell to get me\nI'm givin up nothin\nSteadily bustin caps all over the place\nI got the devil so high\nHe told me to get the fuck out his face\nSo now I'm back and ready to motivate this old shit\nSpit G'sterism loc\nI could cut off the dick like a circumcision\nI pick up the 4-0\nMore goes down my throat and hits my tonsils\nI look up and throw up the Blocc\nI'm tore up and can't be held responsible\nThree strikes is givin out life for traffic tickets and petty shit\nSo I'm goin out\nMakin everybody go and look like that spaghetti shit\nStay out my, Unless you wishin to get your life took\nMuthafuck your little hit list, I got a big ass hit book\nFor that serial murderin. 44 Magnum\nThat'll take him off his feet\nAnd put him in the grave with a hole in the head\nAnd slay for the reefer he took in the meetin\nAnd I'm that one drunk muthafucka that's at your funeral home\nDick whipped out, Takin a 8-Ball piss all over your grave stone\nSo when you see me swiggin that Ol' E liqour\nHold your breath, I'm slammin the bottle upside your dome\nWhere there ain't nothin left, cuzz\n\n[Hook: Brotha Lynch, (Sicx)]\nCause I don't love you hoes, I don't love you niggas\nAll I'm givin a fuck is about my liquor and my triggaz [2X]\n\n(Yeah, When I'm off that Ol' E)\n(When I'm off-When I'm off that Ol' E)\n(Loc, Better watch yo back on nervous mode)\n(For really though-Really though, Yeah)\n(When I'm off that Ol' E)\n(When I'm off-When I'm off that Ol' E)\n(Loc, Better watch yo back-Better watch yo back on nervous mode)\n(For real though)\n\nCause I don't love you hoes, I don't love you niggas\nAll I'm givin a fuck is about my liquor and my triggaz [4X]"}], "artist": "X-Raided"}