{"songs": [{"year": "2005-09-13", "image": "https://images.genius.com/8f42b22ec5549467826fbd0c750ab571.450x450x1.jpg", "title": "Who’s Hard?", "album": "Who’s Hard: Gang Starr Presents Big Shug", "lyrics": "[Chorus]\nWho's hard?\nIs it you? Is it me?\nIs it the fact that you had your own faculty?\nIs it the fact that you choke the double triple threes?\nAll of that don't mean shit to me\nFor real\nWho's hard?\nIs it you? Is it me?\nIs it the fact that you had your own faculty?\nIs it the fact that you choke the double triple threes?\nAll of that don't mean shit to me\nFor real, for real\n\n[Verse 1]\nI been in this Hip-Hop game for mad\nI sat back and watch cornballs go for bad\nSorta sad, actually, a damn shame\nWhat the fuck ever happened to the game? Simple and plain\nMost of the real are locked up on main\nThe while, more or less seem tame\nNot want to name names\nBut you know who the fuck you are when you fake the game, word up\nNow it's time to meet your maker, move faker\nLike a Cee-lo game, I swear to god I'ma break ya\nTake ya to the fourth then drop you off\nAnd let them Brownfloor niggas take your fuckin' head off\nAnd you'll be screamin' for CO\nWith a half a broken back and a bloody ass nose\nI suppose this what happens when you fake to all\nSomeone from the yard always pulls your card\n'Cause your persona knows no way\nAnd faggots like you always jump the gate\nLet's set the whole world straight\nBefore you meet your death and it's too damn late\nWhy do you wish to perpetrate, when there's other jobs to do?\nLike tables to wait, that better suit you\nAnd I advise you to step two\n'Cause when I bring the pain there'll be nothing you can do\nYou never did a bit in your life\nImagine you being another mans wife\nYou probably wait to late at night\nAnd slit your wrist and take your own muthafuckin' life\nFor real (for real)\n\n[Chorus]\nWho's hard?\nIs it you? Is it me?\nIs it the fact that you had your own faculty?\nIs it the fact that you choke the double triple threes?\nAll of that don't mean shit to me\nFor real\nWho's hard?\nIs it you? Is it me?\nIs it the fact that you had your own faculty?\nIs it the fact that you choke the double triple threes?\nAll of that don't mean shit to me\nFor real, for real\n\n[Verse 2]\nStill wanna be gangsta, still wanna claim thug?\nMy boxcutter flow make eyebrows spit blood\nFake gangsta get shot in the mug, wrapped in a rug\nWeeks later your body discovered covered with bugs\nLet's face it you ain't gangsta you straight up bitch\nReal gangstas don't eat shit or drink piss\nThey fight for they right all day and all night\nBut the main thing is to keep they game tight\nNew jacks come around wanna take my spot\nBut on my block I'm the cock so you must be the twat\nBig Shug, feel me like forebearer hands\nOr get punched in your mouth and earth slammed\nOr get shot in the ass and stuffed in a trash can\nWord life, I'm reppin' it hard for Murdapan\n\n[Outro]\nYeah yeah there's too many you niggas out there fakin'\nYou understand we watchin' all of y'all\nAnd personally, I'll slap the jack rabbit bunny hoppin' shit out of your punk ass\nDon't think twice about it, you understand?\nAnd all them fake corny niggas you rollin' with\nI don't trust 'em\nSo when they make moves I'ma bust 'em\nThat's how I'm feelin'\nFuck it, we keepin' it real, we keepin' it underground\nYou niggas ain't hard, the fuck outta here\nFor real, for real"}], "artist": "Big Shug"}