{"artist": "Wiz Khalifa", "songs": [{"year": null, "lyrics": "[Hook]\nSee we ain't worried 'bout damn thing, damn thing\nYou talking it but you not about a damn thing\nSo what 'chu doing about it? not a damn thing (damn thing)\nKeep it moving , I'm overdoing my damn thing (damn thing)\n\nYou see I'm here now. that's right you not the man\nThey say I spit coke, supply the block with grams\nAnd I ain't lift waiting, I'm taking lots of grands\nCuz I ain't got patience, I'm not a doctor fam\nMy niggas get it crunk, chump rep the side you from\nSmokin' somethin nigga, light ya blunt\nAin't got 'cha gun you better find you one (why?)\nCuz this is Pistolvania. where them apes crawl\nBunch of shorties on the the corner, pocket full of  8 ball\nAnd you never really see one of my niggas until they cake long\nAye what 'chu mean man? something like the Great Wall\nAs far as rap go, yeah its in the bag\nOf course the haters wanna do me bad\nProlly mad because of the shit that I have\nI never let them slow me down dawg I'm living fast\nSo as long as the chick want to get with the young\nAnd it's all about making this cash\nI'm still a young'n but niggas respect the flow\nAnd don't check me, ya better check ya ho\n\n[Hook]\n\nI'm in the studio, making classic keep\nYou niggas mad at me, this cash I have to see\nAnd you chumps can amount out for the ones\nAnd I'm bout done with you punks\nAnd you clowns wanting to come for the crown\nI hear alot of talk, I gotta let them know\nI put the bussiness on a nigga, really feeling nutty when he come\nAnd try to touch the flow\nCause I'm not for the game, opt you will not do a thing\nSee I was taught you gotta walk & you talk if you sane\nAnd its 4-1-2 till I fall to the grave\nThey'on know what to do with the ball to this game\nCause I'm always pimpin' if you hear my voice it attract the whole world gone listen\nSome niggas might can hate, but you can say\nI get away with murder like o j simpson\nI'm into all day grinding, dont knock or come near\nSee im putting the time in. the young'n keep rhyming\nSo one day I can sit back & reclining\nI see you stressed out, man we do this shit for fun\nCall me the best out, khalifa get it done! (yes!)", "image": "https://images.genius.com/2ba15f623d81eda09cdc07f50dde02ad.400x400x1.jpg", "album": null, "title": "Damn thing (Show & Prove) (2006)"}]}