{"artist": "6ix9ine", "songs": [{"year": "2014-12-10", "title": "Fuck Is You", "album": null, "lyrics": "[Intro]\nScum Gang!\nSuperstaar Beats\n\n[Chorus]\nBitch, it's Wallah fuckin' Dan, who the fuck is you? (You)\nYou ain't my mothafuckin' mans, who the fuck is you? (You)\nBrought the cannon to the jam, who the fuck is you? (You)\nWho the fuck is you? (Nigga, who the fuck is you?)\nDon't give a fuck what you sayin', who the fuck is you? (You)\nWe don't know, you better scram, who the fuck is you? (You)\nScum Gang my only fam, who the fuck is you? (You)\nWho the fuck is you? Nigga, who the fuck is you? (You)\n\n[Bridge]\nTekashi69 from that Scum Squad\nY'all niggas don't want no drama (Don't want no drama)\nFirst nigga act tough gettin' WorldStar'd (WorldStar!)\nAnd I put that on my mama (On my mama!)\n\n[Verse]\nCan't be where I'm at, I don't know you (Bang)\nBet my little niggas run up on you (Baow!)\nThey'll leave a nigga flat, no warning (Woop!)\nScum Gang, bitch, we on it, trust me 'cause you don't want it\nYou can try 6ix9ine if you wanna die\nA-A-All my niggas down for that homicide\nYou'll be on a shirt, you'll be in the church\nDressed up in a box with your mama cryin' (Ah!)\nShe kissing your corpse\nI don't know who you is and you pissing me off\nI aim at your heart, bullets rip through your cross\nRip you apart, stitches can't fix it, it's straight to the morgue\nBetter hope you don't slip and get lost in these parts\nWalk through the park after dark, catch a spark\nTen o'clock news, you'll be out on the charts\nScum to the Gang, praise to Allah\n\n[Chorus]\nBitch, it's Wallah fuckin' Dan, who the fuck is you? (You)\nYou ain't my mothafuckin' mans, who the fuck is you? (You)\nBrought the cannon to the jam, who the fuck is you? (You)\nWho the fuck is you? (Nigga, who the fuck is you?)\nDon't give a fuck what you sayin', who the fuck is you? (You)\nWe don't know, you better scram, who the fuck is you? (You)\nScum Gang my only fam, who the fuck is you? (You)\nWho the fuck is you? Nigga, who the fuck is you? (You)\n\n[Outro]\nFuck outta here\nWho the fuck is you?\nIt ain't gon' be nothing nice\nWho the fuck is you?\nYour heart don't beat like that, tell you that\nWho the fuck is you?\nI don't care\nNigga, who the fuck is you?\nI don't care, I don't go no feelings", "image": "https://images.genius.com/1dbf703c74a302afd77a82219458c1c8.1000x1000x1.png"}]}