{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/21af1b75150287897aef54312f0bc97a.500x500x1.jpg", "title": "The Horrorshow", "year": "2010-08-01", "album": "Xerxes the God-King!", "lyrics": "[Verse 1]\nI welcome you to a room full of blood and intestines\nLove and rejection\nSon I'm a reverend\nYelling there is no heaven and little Helen\nIs gonna suck Kevin's dick, she is eleven\nKevin is thirty-seven, molesting Helen until she wets the bed\nNow get ready for the beheading\nThen I'll head west and shave my face and chest and head and hope that nobody notice me\nHopefully John Walsh is a dead man\nWanted by America\nHungry and I'm scared as fuck\nHit a rural area, find a family and bury em\nBut the daughter got away, you know what this could mean\nFinally, chase a white blond bitch through the wood scene\nLike yes, you can lace up your left boot and let's scoot\nYour so cute and yet foolish, every move accepts useless\nYou know your gonna fall\nWhy even try at all?\nTake her back to the cabin and eat her ass until it's gone\n\n[Hook]\nHey what up Juggalo?\nWelcome to the horrorshow!\nYou say you got some kush to roll?\nWell welcome to the horrorshow!\nYou say your girlfriend's a ho?\nWell bring her nasty ass down to the horrorshow!\nYou said you never heard of King Gordy before?\nJust buy you a ticket to the horrorshow!\n\n[Verse 2]\nI'm an anomaly, obviously probably involved in sodomy\nSo logically I'm a be all that I can be aside of the assholes\nI pray they'll pack your ass with some glass yo\nYour girl want us to fuck her fast though, with masks on\nHolding a whip, blowing her shit out til we swolling her lips\nControlling her hips, nose broken and both of her ribs open\nWe keep stroking, her hole is so soaking, wet\nI bet I broke it from Hoboken to Oakland\nI'm joking, I only want to cut her throat open\nThen throw her off a boat and watch her float in the ocean\nMurder or Rape?\nBurger or steak?\nYou take the pick\nBurn up your face\nTurn into Jason and shake a bitch\nComing live from Camp Crystal Lake, we'll catch, kill, fillet\nYour cap's peeled today but I feel okay\nI've been shot a million times, thank God I'm still alive, disfigured but the mask conceals my face\n\n[Hook]\nHey what up Juggalo?\nWelcome to the horrorshow!\nYou say you got some kush to roll?\nWell welcome to the horrorshow!\nYou say your girlfriend's a ho?\nWell bring her nasty ass down to the horrorshow!\nYou said you never heard of King Gordy before?\nJust buy you a ticket to the horrorshow!\n\n[Verse 3]\nI'm an armed assassin, the last card's to crash em\nI am causing panic, my flying saucer landed\nRight in the Midwest and yes I guess I am standing right on this kid's chest, til this bitch is near death\nI'm a have a great night at this cabaret right?\nTil I got in eight fights then I got my face sliced\nSo I'm shooting up this cabaret twice\nThis Saturday's quite violent, got to wiling on these fagot made dikes\nI ain't lying, got to firing, let the magnum play dice\nGamble with your life, bullet will have em laying right\nIn the middle of Van Dyke, this ain't no scary movie\nNo hockey mask or knives, bitch we carry Uzi's\nAnd there is no sequel, just blood on your clean clothes\nBut no sneakers on, sorry my nigga but we keep those\nShit he's froze, what's he need some shoes on his feet for?\nNow bring on Gordy with this gory ass king show\n\n[Hook]\nHey what up Juggalo?\nWelcome to the horrorshow!\nYou say you got some kush to roll?\nWell welcome to the horrorshow!\nYou say your girlfriend's a ho?\nWell bring her nasty ass down to the horrorshow!\nYou said you never heard of King Gordy before?\nJust buy you a ticket to the horrorshow!\n\n[Outro]\nWe want the horror!"}]}