{"songs": [{"title": "Another Reason", "lyrics": "[Verse 1:]\nWater cuts rock, so which has more force?\nAs water shapes the land, it's still willing to change it's course\nSo can't even change your own minds? Usually change nothing\nCan't ever blame your own mind? Always blame something\nBut in failure, hides opportunity\nIn divided communities still residing is unity\nWaiting to show itself soon as we're ready to see it\nTruth is always there, soon as we are ready to be it\nSo we can keep pretending what's real is just the senses\nBut it is all the same when you're looking with stronger lenses\nSo concerned with images, but it's there in the words\nImages are just imagination, thats whats so absurd\nHave you heard the Pig now knows it's fat?\nAnd the Zebra is confused because it's white and it's black?\nSo what's fact, right and exact when everything changes\nChange the way you look at the world, the world changes\n\n[Hook:]\nInstead of reasons to die, find a reason to live\nInstead of reasons to fight, find a reason to give\nInstead of reasons to talk, find a reason to sing\nInstead of reasons to take, find a reason to bring\n\nInstead of reasons for I, find a reason for we\nInstead of reasons to try, find a reason to be\nInstead of reasons to look, find a reason to see\nPeople, I am pleading, find another reason\n\n[Verse 2:]\nWe are so busy noticing money don't grow on trees\nWe forgot that food does and that it's the food that we need\nYou see, I done traveled all over the Isles\nAnd seen the poorest people with the wealthiest smiles\nSo what is Rich or Poor, Less or More?\nWhat's victory? What's defeat? And who keeps the score?\nWho sleeps more soundly, the Prince or the Pauper?\nWho speaks more profoundly, the Professor or just the talker?\nThe walker or the driver, who travels the furthest?\nThe explorer or the pirate, who is providing a service?\nWho decides what is worthless, versus what has a purpose?\nDid the so-called civilized world not think the earth a flat surface yesterday?\nSo, who knows what tomorrow brings?\nIt often is the oddest of songs that tomorrow sings\nLook back through the ages, everything changes\nChange the way you look at the world, the world changes\n\n[Hook:]\n\n[Breakdown:]\nWe find all these reasons\nTo never be the person we want to be\nBecause I'm still healing\nAll these wounds that are burned\nSo deep inside of me\n\n[Verse 3:]\nWe think that we're smart and that makes us dumb\nThink that we feel the most and that makes us numb\nWeak because we’re convinced that we have the power\nBecause we can make buildings and guns, but not a single flower\nWe're just waves but think we're the ocean\nBecause it's easier then admitting\nWe don't know where the current is going\nWe're just flowing\nWhy do we feel it needs controlling?\nWaves just rolls with the ocean until they reach the sand\nSo let's roll with our part, until we reach our land\nAcknowledge that the fear in our hearts, totally in our hands\nIt's not a thing, we just think\nImagine the Earth decided that it was afraid to spin?\nSo don't be afraid, to sing with your voice\nThat's what it is for\nThe more we run from truth, the closer it gets to your door\nLook back through the ages, everything changes\nChange the way you look at yourself, the self changes\n\n[Hook:]", "year": null, "album": " The Thieves Banquet", "image": "https://images.genius.com/acaf5708a18660f33365d7d63e4937b7.500x500x1.jpg"}], "artist": "Akala"}