{"artist": "Willie D", "songs": [{"year": "1989-12-21", "lyrics": "[ DJ REDDY RED ]\nYo, what's up Dee?\n[ Willie D ]\nMan Reddy Red, where the fuck you been, man?\n[ DJ REDDY RED ]\nBut I been stickin this dick to this bitch in this car, man\n[ Willie D ]\nOh boy, that's misdemeanor shit\nI'm on that other level\n[ DJ REDDY RED ]\nFuck you mean by the other level shit, man?\n[ Willie D ]\nMan, check this shit out\n\n[ VERSE 1: Willie D ]\nI fucked on floors, I fucked outdoors\nOn the filthy-ass ground and don't get sores\nGettin head while drivin ain't nothin new\nDon't laugh at me cause you done done it too\nI know you fuck good when you listen to soul\nBy try doin it when your dial's on rock 'n roll\nYou come a little faster, the mood is even greater\nAlthough my dick's sufficient I pull out a vibrator\nI'm a kinky muthafucka\n\nWillie Dee is my name\nI'm a kinky muthafucka\nBut ain't no shame in my game\n\n[ VERSE 2: Willie D ]\nNow I ain't scared to say it, I love to fuck\nMy dick is harder than a armored truck\nBut don't ride my pride when I'm mad\nOr I might just bust your pussy in half\nSuck yo titties, I'm with it, from left to right\nI tell ya, my skills are out of sight\nMake you feel so good when I fuck\nThat yo muthafuckin pussy hairs curl up\nI'm a kinky muthafucka and I ain't ashamed\nTo let you bitches run a train\nY'all can take turns lickin my dick\nWhile I sit back and watch a porno flick\nWe can do all kinds of kinky shit\nLike puttin cold whipped cream on my dick\nI'ma rub it all over my legs\nAnd watch you hoes scramble for it like eggs\nCause when I can't take no mo'\nI'ma spread your legs open and even the sco'\nLay ya all down in a line\nAnd go up in ya from behind\nYou think your man know how to fuck\nShit, you're shit out of luck\nLet me tell you what's up\nHe can't fuck with me cause he's a Now&Later\nBut I keep on goin like a goddamn vibrator\nI fucked at school every day\nIn the girls bathroom and under the stairway\nMy teacher caught me doin the do\nIt wasn't nothin cause I ended up fuckin her too\nI love a bitch to lick my booty\nAnd blow my dick like the wind before she screw me\nLick my shit nice and hard\nSo when I fuck her I know she's gonna make some noise\nI make you fall in love with this ding-a-ling\nEach time it's a different routine\nBut it's the same old thing with any other\nBut you never know what to expect\nFrom a kinky muthafucka\n\n[ DJ REDDY RED ]\nMan, you gon' have me listen to all this shit you been talkin about?\nYou ain't no kinky muthafucka\nYou'se a nasty muthafucka, man\n[ Willie D ]\nMan, fuck you\n[ DJ REDDY RED ]\nYou ain't fuckin me, partner", "image": "https://images.genius.com/03c2b50829c5f112b3f64d1ceaa1bce1.700x700x1.jpg", "album": "Controversy", "title": "Kinky"}]}