{"artist": "Young Thug", "songs": [{"year": "2015-04-17", "lyrics": "[Intro]\nSticky kush, sticky kush\nTell me your name\n(Wheezy Beats)\n\n[Verse 1: Young Thug]\nNigga have you ever dreamed?\nI was the man and you a thing\nOne and two\nAnytime I get mad, I can goodbye to you\nGod damn, who the hell let rats in the house?\nKing of lions, who let these cats run out of the house?\nHouston, Texas when I'm on land, I lean back like a couch\nI'm not playin', I want it bad, call shots like a spouse\nWe roll that kushy up, we eat that pussy though\nSuck it til you're throwin' up, my Phantom grey, no hound\nI lost a Lear, no bucks, still waitin' on that Bentley truck\nStop playin', lil' bitty boy, you a duck\nHe ain't YSL, nigga, he ain't in the hut\nI might stop by and let that little bitch lush\nI pull up and chop at your cousin, your bus\nLittle nigga, you know what it was\nYou know what it is, you know what it does\nI'm makin' your old lady shake it\nShe suckin' too slow, I'm impatient\nMy diamonds so wet like a basin\nDon't know where to go, I'm amazin'\n\n[Chorus: Jacquees]\nWhat's amazin'? I don't know\nWhat's amazin'? I don't know\nWhat's amazin'? I don't know\nWhat's amazin'? (Amazing is a grateful thing)\nI might accept your apology\nI mean you throw L's up if you ain't followin'\nI am a beast, your life I'll be swallowin'\nAnd I've been drinkin', I need to bottle this\n\n[Verse 2: Young Thug]\nMan I'm so tired of these niggas man\nI am so tired of these bitches\nI'm so magnificent, studio workin'\nI'm wearin' a top like I'm pimpin'\nYour bitch want my milk\nI'm sittin' at the top lookin' down at these wimps\nThese hoes just roll me a blunt\nAnd you know that they stuff it, it cannot be imps\nI never had cutlass and donks\nI based up my bankroll then based out my trunk\nI might fuck that lil' bitch in the mornin'\nI might put her out and call Tyrone\nSnoop Dogg, I might go ahead and bone\nI'm big ballin', bitch put me inside the dome\nI'm wearin' Maison Margiela (The tight way)\nI'm wearin' Maison Margiela (The right way)\nI'm wearin' Maison Margiela (The scary sight way)\nI'm wearin' Maison Margiela (The goodnight way)\nTake some sand to the beach\nParty with a couple foreign freaks\nKim K lookin' ho, Yeezy\nFlorida livin' nigga, Pork N Beans\n\n[Interlude: Jacquees]\nYeah, and I'ma ride this bitch tonight\nAnd I just might ride this bitch tonight\nPork N Beans where you at baby?\nPork N Beans where you at baby?\n\n[Verse 3: Young Thug]\nBrown sugar on that bitch\nPull up with a ho and she know I'm ready to\nBust her, pay her, leave her, fuck her\nI don't wait up, hold up, let me check my mail\nHe broke, he servin' his squad with a scale\nI make it rain, I hope all is well\nI pull off deep like what in the hell?\nHo give all my niggas some bails\nWait I'ma lay down 'fore I'll tell\nPull up in old school Chevelles\nI don't save pictures, they might get revealed\nHow many times have I asked are you well?\nHow many times have I popped a perc pill?\nHow many homies at home on the bail?\nHow many times have I told you you shell?\nHow many meals have I ate until I burp?\nDropping the top on the Mulsanne ain't no hot top on merchs\nHey I worked so hard to get out that dirt\nHey I was thinking this is not that work", "image": "https://images.genius.com/084203fc03bd5fad8a33a46d02f4a265.1000x1000x1.jpg", "album": "Barter 6", "title": "Amazing"}]}