{"artist": "G Herbo", "songs": [{"title": "All My Niggaz", "album": "Welcome To FazoLand", "year": "2014-02-17", "image": "https://images.genius.com/1f0957bcc4e5ed11a4b06a390e8f44b0.500x500x1.jpg", "lyrics": "[Intro]\nGang\nNLMB Rock Block shit man, L's\nAll niggas you see wit me man, these my niggas man\n150 Rock Block shit man\nNLMB, R.I.P. all my niggas man, free all my niggas man\nBall like I'm Kobe man, Pistol Gang bitch\nSquad\nL's\n\n[Hook]\nAll my niggas on point\nAll my niggas gon' shoot\nAll my niggas got money\nAin't none of my niggas with you\nIma put all my niggas on\nRIP all my niggas gone\nAll my niggas 150\nAin't none of my niggas gon' fold\n\n[Interlude]\nR.I.P. all my niggas man\nKobe, Vito, Chico, Fazo all my niggas man\nFree all my niggas man\nFree Jock, free Lil Boos, free Crazy Jays, free B Gills man\nFree all my niggas man, squad\n\n[Verse 1]\nBall my niggas, seem like I lost all my niggas\nRIP Lil Roc, Vito, Fazo can't believe yall gone my nigga\nAnd it's real fucked up how it's good one day next day go wrong my nigga\nBut I gotta stay strong my nigga\nSo I wrote this song my nigga\nRemember all them nights we was out in that field, had to tote that chrome my nigga\nThen it all went wrong, What the fuck Kobe why you couldn't get a ride home my nigga\nWhy yo name in this song my nigga\nBut dont trip cuz it's on my nigga\nPut it on my soul you ain't gon' be the only one with a headstone my nigga\nI lost a lot of my niggas\nSo you get dropped for my niggas\nWe got Glocks with hair triggas\nSplit a nigga wig when I tap the hair trigga\nHollows in the scene now the top of his head missing\nCatch me in the field, gotta move with the steel\nTill the day I get killed or the coppas come get me\nOnly 17, but them choppas hold 50\nYea them choppas hold 50\nWe'll turn a nigga block to yo city\nSeem like im the man\nI be shopping, bitches saying \"Lil Herb you on the top of yo city\"\n\n[Bridge]\nAnd I love my niggas\nAnd all my niggas love me\nSo you will get killed for my niggas\nAnd they'll kill a nigga for me!\n\n[Hook]\nAll my niggas on point\nAll my niggas gon' shoot\nAll my niggas got money\nAin't none of my niggas with you\nIma put all my niggas on\nRIP all my niggas gone\nAll my niggas 150\nAin't none of my niggas gon' fold\nAll my niggas, all my niggas\nFor all my niggas, I love all my niggas\nAll my niggas, all my niggas\nAll my niggas, ball my niggas\n\n[Verse 2]\nNo Limit MB\nFazoland Roc Block We a hunned-fifty\nCan't a nigga flip me\nIts a gun on every single nigga with me\nMotherfuck a bitch nigga\nI'm just tryna get rich then I'm tryna get richer\nWorry about shit nigga\nCuz they pussy in this 40 cal make my dick bigger\nBet I won't miss nigga\nGreen beam on a nigga make you take a sit nigga\nAnd I don't forget nigga\nRemember he was talking slick now he don't exist nigga\nAnd all we do is switch nigga\nPass lil bro the semi, that's a assist nigga\nAnd yeah you a bitch nigga\nCouple shots to the stomach now he walking shit nigga\nIma real ass nigga I need real cash\nI need it real fast nigga\nBandz in the stash nigga\nIf he try to rob me he a stupid ass nigga\nSpend it like my last nigga\nWhole 5 nigga for you end up like the last nigga\nAnd for Lil Roc i'll spazz nigga\n10 year niggas you can have my last nigga\nSee you muggin when i ride past nigga\nYou know this foreign got a lot of cash In it\nAlot of guns in it too and a whole lotta savages\nThey'll leave a nigga in the past nigga\n\n[Bridge]\nAnd I love my niggas\nAnd all my niggas love me\nSo you will get killed for my niggas\nAnd they'll kill a nigga for me!\n\n[Hook]\nAll my niggas on point\nAll my niggas gon' shoot\nAll my niggas got money\nAin't none of my niggas with you\nIma put all my niggas on\nRIP all my niggas gone\nAll my niggas 150\nAin't none of my niggas gon' fold\n\nSQUAD!"}]}