{"artist": "Inspectah Deck", "songs": [{"title": "Gotta Bang", "lyrics": "[Intro: ?]\nYo man, like you see all of them creeps over there man?\nAnd you know they ain't cool cuz you know they gonna want some static\n\n[Kurupt]\nI just might slap ya bitch and strip her clothes\nFor fun, and pull out guns like Axle Rose\nUndermine me, and see your future dissipate\nRight in front of yo eyes, ain't no surprise\nCuz I leave you fucked up, laid out, dilated\nPupils, everybody you with, all pupils\nPoodles to pit bulls, quiet as cougars\nManeuvers, silent, violent shooters\nGet involved in this tangle, try me mane\nAnd I'mma hit you so many times I'll be damed\nIf your homies don't feel it, yo mama too\nI kno about your block and where we bring the drama to\nI'm more than set, I'm set and more\nAnd I said it before with the choppers, I'm war\nThug illegal for a ??? to start poppin them thangs\nBefore you say another word, tryin to talk and explain\n\n[Hook: Inspectah Deck]\nNiggas wanna shout my name, best believe we got to bang\nSqueeze off, pop them thangs, yes indeed we bout them thangs\nI walk my talk, I'm a boss, I leave you out your frame\nHaters wanna block my game, don't twist it, it's not no game\n\n[Inspectah Deck]\nYo, I'm still on top of the game, nd the thrill's still hotter than flame\nWhat I spill cause drama to brains, and I ?still drop bombs on ya lane?\nKilla Hill, still honor the name, the drill's still more of the same\nMore portion to gain, I'm rock bottom, no problem to bang\nBeyond locks, son got em in chains\nHe knock on them chains, he on the block where they're poppin them thangs\nSix figure wide ride, broads be flier than dimes\nShe like the iron, she be right be my side\nReason why she be liver than guys\nNiggas plot your demise\nShake your hand, look you right in your eyes\nI only fuck with heads I can trust\nThe usual suspects, the next up, Deck and Kurupt\nGet your neck cut messin with us, the weapons'll bust\nYour best bet, just step to the cut\n\n[Hook]\n\n[Billy Danze]\nYo, why would I change my persona, nigga, if it helped me to grow?\nHelped me to glow, helped me to help you niggas know\nHelped me to show you niggas I'm the same OG\nFrom when the Wu came through like (suuuuu) in the streets\nWhen Tha Dogg Pound drops sounds that you couldn't believe\nI'm on the grounds, lead spray painting M.O.P\n(What now?) We ghetto mosh pit in this bitch\nNigga I don't gang bang, but I'll bang a gang you you mothafuckas\nI'm tryin to tell you why I'm legit\nNigga I will bang bang until I break a spring in the mothafucka\nI'm with it all day, I get love from Brownsville\nFrom Stapleton to Crenshaw to Long Way\nSo nigga ya'll play and you'll get tossed around\nCuz I'm focused now and I'm with the bosses now, put your pocus down\nAnd if a faggot bitch get one in his abdomen, you know I'm back around\n\n[Hook]\n\n[Outro: ?]\nAnd they jumped me, you understand?\nI didn't see any niggas, they all crawled up on me\nYou understand? Fuck it, You're ???\nCuz I don't wanna get stabbed in my back or nothin\nAll niggas get stabbed or shot in my back\nBut dig this, I want em got, I want em layin out", "image": "https://images.genius.com/82c9b14e7d1772e390a21fe67e28ad6e.800x800x1.jpg", "album": "Manifesto", "year": "2010-03-23"}]}