{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/026af4624fc7a5d281b93f8ccaf11259.650x650x1.jpg", "title": "Belly of the Beast", "year": null, "album": "Sunday Morning Massacres", "lyrics": "[Charles Manson talking]\nYou've got it stuck in your brain that I murdered somebody. What do you want to call me a murderer for? I've never killed anyone. I don't need to kill anyone. I think it. I have it HERE\n\n[Killer Mike]\nI got hate in my heart, hate in my stomach\nCO's make me vomit\nI'm in the belly of the beast\nAnd it made me a beast, it's too much to stomach\n\n[Charles Manson talking]\nMaybe I haven't done enough. I might be ashamed of that, for not doing enough. For not giving enough. For not being more perceptive. For not being aware enough. For not understanding\n\n[Killer Mike]\nUnderstand that a trap's just a trap\nAnd when the government get you it's a wrap\nI entered the facility a drug dealer\nOne month in a nigga tried me now I'm a killer\nNigga tried a nigga manhood\nSo I load a pillow case up with some canned goods\nCouple locks, couple D-batteries\nBeat that motherfucker way past assault and battery\n(Savagely) Beat his ass to a casualty\nSent that prison punk to his mom's in a casket, G\nNow the prison chaplain want to chaplain me\nTold me confess sins it'll be alright\nI told him fuck him, the warden and his white Christ\nCalled him a faggot, said he ain't living right\nWhat kind of re-ligion don't allow man a wife?\nYou a boy lover father, that ain't right\n\n[Charles Manson talking]\nThe street is my world. I don't pretend to go uptown and be anything fancy\n\n[Killer Mike]\nUnh-unh\nOutlawed by birth\nAnd I'm an outlaw every day until they put me in the dirt\nMy skin is my sin, every day I'm called nigga by a couple white men\n(NIGGER!)\nCOs: undercover Aryans\nBeat blacks to a pulp like a Barbarian\nI told that Nazi \"Don't hit me!\"\nHe  did it anyway so I shanked him in his kidney\n\n[Charles Manson]\nYou people have done everything in the world to me\nDoesn't that give me equal right?\nI could do anything I want to you people\nAny time I want to\nBecause that's what you've done to me!\nIf you spit in my face,  slap me in my mouth\nThrow me in solitary confinement for nothing\nWhat do you think I'm going to do when I get out of here?\n\n[Killer Mike]\nI carved that guard, more years I'm facin'\nNow the inmates call a young nigga Satan\nSomething like Malcolm before he joined the Nation\nBack and forth in solitary, I'm pacin'\nFive in the morning, I hear the Muslims praying\nSix in the morning, the guards congregating\nSeven in the morning, they beat me, bones breaking\nLeft me in the middle of the cell, cold, shaking\nLeft me in the hole, near death for a week straight\nWhen they came back I knocked the piss and shit in their face\nCause I rebelled, they Guantanamo Bay'd me\nBeat me till I cried like a motherfucking baby\nInsane membrane, prison got me crazy\nSent me a nurse and I spit at the lady\nShit, this place made me devilish\nMy homies don't visit, plus my girlfriend  suckin' dick\nThe pain is too much to take\nLike the boys that kill themselves after they're raped\nCalled her a cheap bitch when she visit me here\nBecause of that I ain't seen my kids in a year (I'm sorry)\nThe damn pain's unbearable\nGot a motherfucker wildin' out like an animal\nGladiator school for the sadists\nWith the killers and the rapists is where I graduated\n\n[Charles Manson talking]\nThe latrine is my world. I don't pretend to go uptown and be anything fancy.  I can, but I find more real in the world that I'm in,  than I do the tinsel, and the real world is the one I have to deal with everyday.  Believe me, if I started murdering people... there'd be none of you left\n\n[Killer Mike]\nBrutalized, institutionalized, in the belly of the beast in an inmates' eyes (2x)\nAsk the public do you know what you're creating when you send the boys to the belly of Satan?\nAsk the judges do you know what you're creating when you send the boys to the belly of Satan?\nThe politicians do you know what you're creating when you send the boys to the belly of Satan?"}]}