{"artist": "Wiz Khalifa", "songs": [{"year": "2015-05-25", "lyrics": "[Intro]\nFor real man, we need that whip\nThat's the car I need\nMotherfucker hit a plane and the plane blew up\nUgh, yup\n\n[Verse 1]\nStanding in the mirror\nMy vision of that money getting clearer\nScratch that, it's getting nearer\nSome of this actually happened\nI was weed nappin'\nWasn't shit\nNow they pay us for the raps we kick\nMy hotel smell like confidence\nThey hate us but that weed smoke bring on compliments\nSo roll this paper\nTell the waitress - get my drink from off the coaster\nBring the bitch that love to smoke and get the weight from off my shoulders\n\n[Interlude]\nYeah, I be flying everywhere nigga\nSometimes I don't even know where the fuck I'm at\nI be waking up, random motherfuckers be knocking on my door and shit\nLike \"who the fuck is that?\"\nNosey ass cleaning lady\nYou wanna hit this weed?\n\n[Verse 2]\nStains from your make-up\nRoll me up a joint soon as I wake up\nYoung nigga, but got my cake up\nNow I'm hoppin' off of the plane\nSmelling like the sweetest scent, weed is lit\nLook at my bitch, we the shit\nProbably high - what they say when they see us\nBut they never say that we broke\nKush in every J that we smoke\nPutting rings on every finger\nNever put 'em out, just let the smoke linger\nChampagne for the girls, straight shots for my niggas\nStarted small but now the money getting bigger\nIt all get better with time\nRather go hard instead of unwind\nAnd play your part and I'mma play mine\n\n[Interlude 2]\nFeel me?\nMotherfuckers always speakin' out of turn\nThey don't know nothin' about this shit\nThat's why I'm me and you're you\nMatter of fact, fuck that\nThis Taylor Gang\nT.G.O.D. nigga\nAin't shit changed gang\nWhat up Ricky P\nRichard\nDon't smoke that pound without me Richard\nDon't eat your dinner in the bathroom\n\n[Outro]\nJim Brown smash baby\nOh shit! We get to see the tits?\nHere we go!\nGet her Jim! Get her Jim!\nOh shit!\nI don't get no sleep\nI'm fresh off the plane\nI don't get no sleep, God damn", "image": "https://images.genius.com/e168a843af4516427b50fafd226984ee.990x990x1.jpg", "album": "28 Grams", "title": "Comb Over"}]}