{"songs": [{"lyrics": "[Intro: Leonardo DiCaprio]\n\"My life has got to be like this, it's got to keep going up.\"\n\"I've been in several things, I was in the drug business, then I was in the oil business, but I'm not in either one now, you understand?\"\n\"I had my own little business on the side, a sort of sideline... a rather confidential sort of thing... but you might make a nice bit of money.\"\n\n[Hook]\nHundred dollar bills\n\n[Verse 1]\nBenjamin Franklins filled, fold it just for the thrill\nGo numb until I can't feel, or might pop this pill\nStock markets just crash, now I'm just a bill\nHistory don't repeat itself, it rhymes, 1929, still\nWrite like Mark Twain, Jay Gatsby, I park things\nYellow cars, yellow gold like Slick Rick, still tip\nOn four-four's (Who?) Four-four's at the 4-0 (Wait) for O\nDollars fall on the skin, some might call it sin\nPoliticians all move for money, what the hell are we calling 'em?\nLow life, I'm crawling out, 911, I Porsched it out\nY'all niggas all hypocrites, y'all know what this shit is all about\nHunnid, dolla, hunnid dolla bill, real, uh\n\n[Interlude: Leonardo DiCaprio, Joel Edgerton]\n\"Her voice is full of money.\"\n\"He's a crook, George. He throws those parties the papers are always talking about.\"\n\"I didn't want you to think I was just some nobody.\"\n\"We were born different. It's in our blood.\"\n\n[Verse 2]\nNew heroines, new Marilyns, move coke through Maryland\nThrough Easton, oh, you beasting\nMove fat packs, Jack Gleason\nThe honeymoon's over with the streets shit\nLeast see my kids on the weekend\nCarter, new Kennedy\nNo ordinary Joe, you'll remember me\nNo prohibition for my coalition\nColin Powell, general admission\nYou're all welcome, new Malcolm, of the talcum\n\"By any means,\" AK lookin' out the window screen\n\"Let's Get It On,\" new Marvin\nWho wanna become my 100th problem?\nSemi-automatic or revolver, semi-automatic I'll solve em\nEinstein, my mind, this MC move white squares with my relatives\nThat cheese made us constipated couldn't tell us shit\nTook that Taylor Swift to a hundred fucking million, bitch\nI'mma let y'all continue but... ha-ha...\n\n[Interlude: Leonardo DiCaprio & Tobey Maguire]\n\"It's called greed, old sport.\"\n\"That's right!\"\n\"Who is he anyhow, an actor?\"\n“Meyer? No, he’s a gambler. He’s the man who fixed the 1919 World’s Series.\"\n\"Fixed it?\"\n\"Fixed it.\"\n\"Well, how'd he manage that?\"\n\"Oh... saw the opportunity, I suppose.\"\n\n[Outro]\nI need a hunnid bricks on them hunnid blocks\nI got a hunnid drops, took a hunnid cops, uh\nA hunnid blocks, I need a hunnid bricks on them hunnid blocks, uh\nDecade of decadence, ill reverence, irreverence\nDecade of decadence, ill reverence, irreverence\nUh, young, uh\nI need a hunnid bricks on them hunnid blocks\nI got a hunnid, I got a hunnid drops\nNeed a hunnid, got a hunnid\nGot a hunnid, hunnid, uh\nHunnid, dolla, bill, real", "title": "100$ Bill", "image": "https://images.genius.com/710ebd7ef7bb544215bd8dc64c72bced.1000x1000x1.jpg", "year": "2013-05-06", "album": "The Great Gatsby (Music from Baz Luhrmann’s Film)"}], "artist": "JAY-Z"}