{"songs": [{"image": "https://images.genius.com/ccc2c82be26cb3e23bcaa0b4c5fac919.1000x996x1.jpg", "title": "Pussy", "album": "Barbershop 2: Back in Business Soundtrack", "year": "2004-02-03", "lyrics": "[Hook: Pusha T, Pharrell]\nI ain't in to fat lippin, I'm in to gat grippin\nA cat's slippin, is a cat drippin\nWhy I say that? the cat's slippin, the Mac's spittin\nThe cat drippin, look in the mirror you's a fat kitten\nPuuusssssssssssssyyyyyyyyyyyyyyyyyy-ah\n\n[Verse 1: Pusha T]\nAll I wanted growing up was remote controls\nNow my whole life remote control, hit the block dope controlled\nGot ghetto corners choking slow\nGrandmama go to church trying to soak my soul, oh!\nThis one's for my foes\nFind yourself, in a hopeless hole trying to go against him!\nI puppet you Pinocchios, flows on strings\nIt - is what it seems, just call me Geppetto\nA Young Stock Market, put money in your pocket\nCause when Pusha talk it is the object then I drop it\nI rose gold ya, huh? pink diamond ya, hah?\nSet it in a rhyme now the industry got pink eye\nContagious, flows high demand, like the new Lou Vuitton Monogram\nPastels is cute; How you niggas follow suits so well?\nThese barrels encompass the heat from hell\nNigga the Franchise of Star Trak sales, uh!\n\n[Hook: Pusha T, Pharrell]\nI ain't in to fat lippin, I'm in to gat grippin\nA cat's slippin, is a cat drippin\nWhy I say that? the cat's slippin, the Mac's spittin\nThe cat drippin, look in the mirror you's a fat kitten\nPuuusssssssssssssyyyyyyyyyyyyyyyyyy-ah\n\n[Verse 2: Malice]\nThey rather see me not breathing, than see me achieve\nHave my mama grieving, crouched to her knees\nJealous hearted niggas, y'all wear it on your sleeve\nLike a scarlet letter, for the world to see\nCan't hide the truth, decendents of Cain\nSo y'all get exposed like the sons of Hussein\nMy game way grown, this is known fact\nWhen cats was Ac coupe, I was Cadillac Brougham\nI'm not these rap kids, with childish antics\nWho make diss records, who rock hat backwards\nThese are higher stakes, this is not average weight\nThis is not pinching penniess bitch, this is carrot cake\nThis is the difference 'tween rookies and the pros\nThey pattern after me, they cookie-cut my flow\nBut so (so, so), I'm never one that be jeal'\nDo as I do so I can say, \"Papa raised you well\"\n\n[Hook: Pusha T, Pharrell]\nI ain't in to fat lippin, I'm in to gat grippin\nA cat's slippin, is a cat drippin\nWhy I say that? the cat's slippin, the Mac's spittin\nThe cat drippin, look in the mirror you's a fat kitten\nPuuusssssssssssssyyyyyyyyyyyyyyyyyy-ah\n\n[Verse 3: Pusha T]\nThey say the Lord closes windows, to open doors\nNigga don't make me open yours\nSeen hearts beat through, open sores\nSubliminal rap shit, so immature, that's why I ignore\nPunchline niggas on front time, silly ho shit\nHe who questions I is unfocused\nCopperfield flow yes! I'll make careers disappear\nLike hocus - pocus - no joke, it's Push'\n\n[Verse 4: Malice]\nMercy, mercy! Oh Lord who is he?\nWho curse me, curse me? But doing me\nIt hurts me so, puts me through changes\nSo I got Porsche's and Hummers to deal wit the anguish (oh, oh!)\nAsk Liva, but only if you speak the language\n...And the rest is Comic View\nStar Trak The Movement, who you pay homage to?\nYou don't want it with them boys, this I promise you, you pussy!\n\n[Hook: Pusha T, Pharrell]\nI ain't in to fat lippin, I'm in to gat grippin\nA cat's slippin, is a cat drippin\nWhy I say that? the cat's slippin, the Mac's spittin\nThe cat drippin, look in the mirror you's a fat kitten\nPuuusssssssssssssyyyyyyyyyyyyyyyyyy-ah"}], "artist": "Clipse"}