{"artist": "Professor Green", "songs": [{"album": "Alive Till I’m Dead", "title": "Falling Down", "image": "https://images.genius.com/03dd13269b9289e452bde3eb7d1a6577.1000x1000x1.jpg", "lyrics": "[Intro]\n\nYogi man\nI'm sick of this shit bruv\nSwear down\nJust as things start looking up\nIt all goes to shit again\nStory of my fucking life!\n\n[Verse 1]\n\nI don't wanna live my life this way..\nNo!\nPicture me behind a desk\nPicture that a nine to five I ain't into that\nI'm into rap\nAnd I don't see me getting an office job with these tat's\nSo what choice do I have man?\nDo I sign on or do I bag grams?\nLong signing for dole\nI wanna get signed for my flow\nAnd my rhymes\nI'm a pro and I'm nice I know\nIf I grind then I'll blow\nSo why am I wasting time on the roads\nNow Mike's interested\nI should probably give it a rest before I get arrested\nBut then I got arrested, whoops\n\n[Hook: Lee Bailey]\n\nWhy don't I learn from my mistakes?\nWhy oh why oh why..\nAll I want's to change my ways\nWhy oh why oh why Do I always end up back here\nStuck on the wrong side of town\nWith my head spinning, I keep on falling down\n\n[Background Hook: Professor Green]\nNever been arrested for so much as an eighth of weed and I get arrested for kidnap, blackmail, false imprisonment and possession with intent to supply. Typical of my fuckin' luck really innit, just as I'm about to sign a deal with Mike I might be doing a fucking bird\n\n[Verse 2]\n\nI don't wanna sell weed no more\nHated the cycle but I kept peddling\nNan just found food under my bed again\nI'm a let down again\nAnd she's screaming \"get this shit out of my house\" again\nThere's no curving the truth\nThe bags too big to be for personal use\nThere's no excuses\nShe knows what the truth is\nI do flip Keys of green to get me a few quid\nShe's looking at me so disappointed\nAll I can say is I won't do it again\nBut she knows I will..\n\n[Hook: Lee Bailey]\n\nWhy don't I learn from my mistakes?\nWhy oh why oh why..\nAll I want's to change my ways\nWhy oh why oh why Do I always end up back here\nStuck on the wrong side of town\nWith my head spinning, I keep on falling down\n\n[Background Hook: Professor Green]\nNever learn man.. There's no plan B for me, I ain't got shit to fall back on! I left school in year 8 I don't have an education, selling weed and writing lyrics is all I know\n\n[Verse 3]\n\nI got arrested and raided\nThen I got signed\nAnd I bust case\nSo now everything's fine\nBut now everything's not\nNot only did I get dropped\nThe whole label did\nAnd I wasted my advance so I ain't got shit\nI'm stuck at warners and them pricks won't push my album\nBut it's cool\nAs soon as I'm free I'm gonna do it without them\nEight months later I'm still stuck in my deal\nIn debt with my lawyer time to get back on this ferris wheel\nI'm stuck on this carousel\nWhen will this ever end?\nThis is hell for me I'm back at the beginning again\nSomebody please get me off this circus ride\nThe horse that I'm riding is hurting my thighs erm..\n\n[Hook: Lee Bailey]\n\nWhy don't I learn from my mistakes?\nWhy oh why oh why..\nAll I want's to change my ways\nWhy oh why oh why Do I always end up back here\nStuck on the wrong side of town\nWith my head spinning, I keep on falling down\n\n[Background Hook: Professor Green]\nAnd before some funny guy tries to make a joke about me riding a horse, it is a metaphor! What I mean is I am sick of hustling, I am sick of the grind, I am sick of things going to shit, Just when things are looking up! I don't know if this shit is ever gonna work for me. I swear down blud I am so fed up Yogi, I cannot be dealing with it anymore", "year": null}]}