{"artist": "Vado", "songs": [{"title": "Snapped", "year": null, "lyrics": "[Vado]\nUhh...\nUhh... U.N., Vado man\nLight a 50, sit back in the cranberry 550\nMy slimes with me, this chick money hungry just like Whitley\nFrom +A Different World+, she's a different girl than others\nDifferent furs in colors\nBorn with cake though, cabin the woods upstate low\nSlept with a lot of known niggas, a straight ho\nHer shape so put me on with ways to make dough\nShe got profiles, I make checks, we went bank flow (let's go)\nPonytail, face low, want me to fuck her mouth\nSuck me on the couch, her slurp game got me buggin out (damn)\nOne day seen a ring on her like \"Yo what's that about?\"\nShe replied \"What you chat about? Like let's not go that route\"\n(HA~!) Then she tells me on some G shit\nI got a secret, I'm with a dude I don't wanna be with\nSo peep it, I took him to court, but was defeated\nCause I don't see none from pre-nup from when he cheated\nCould you believe it? In other words, she still with him\nBut he ain't never around, so what's the deal with him?\nHe out of town mostly is what she told me\nNo kids by him, big mansion, she be lonely\nNot only that, he cheap as fuck but filthy\nToo tight for banks, he keep it tucked, you feel me? (I do)\nLike a heartbeat, it's in the crib you tellin me\n'Round the amount about three mill', definitely\nThe only thing, he's in town for a couple weeks\nGood! We can do it tonight, run in while he sleep\nCause it'll be easy if he take us to the cabbage\nLong story short, he had that cake up in the attic\nThe rest bitin and pickin up, money wipin it\nDope vitamins, coke wifey screamin he triflin\nWith the gun aim all set, we done banged\nTurned around hit the stairs bang I hear one rang\nHuh? I just stared at her, this bitch ill (ill)\nAll that cause his life insurance is six mill'\nI reacted, laughin, it's on some snap shit\nI ain't snappin, but what the fuck just happened?\nShe start cleanin, I'm thinkin of start squeezin\nGrab both duffles out of couple and start breezin\nIt wouldn't make sense to leave her breathin\nIt's a matter of time they catch up to her she start speakin\nBelieve it", "album": "Slime Flu", "image": "https://images.genius.com/450bb04055170c173165f2ba8510a395.200x200x1.jpg"}]}