{"songs": [{"title": "First in Existence", "album": "Pure Righteousness", "year": "1988-06-15", "image": "https://images.genius.com/732d84201eb8ac0c8f96f482c23f88e9.600x600x1.jpg", "lyrics": "[Verse 1]\nJust name the time, the place, a date, I'll be there\nReady to square off, never late, on time, never tardy\nMy name is not Harvey yo, you can't scar me\nBecause [?] one intelligent brother mentally well as physically\nGo against me? You must be living miserably\nYou wanna battle? You better disperse and fade\n'Cause when I'm finished, you're gonna need first aid\nYou see I'm chic, unique, the first class man\nPolice - a beast, I hate harassment\nThe mic is sizzling, the rhymes are drizzling\nAnd this is what I do girl to get you in the mood\nA conscious state of mind, the last phrase I used was just divine\nI'm infinite, different, can you deal with it?\nI'm a general and you're just a lieutenant\nMy lyrics are monsters by the size of a mountain\nAnd yours sound like they come from a fountain\nOf youth, little phrases are nothin' but utter trash\nIlliterate garbage is gonna get clobbered and smashed\nBy me - the one who will guide you on a path that was written and given by Elijah\nSo take heed, observe and keep listening\nTo the knowledge I spread 'cause I'm first in existence\n\n[Verse 2]\nSee I'm first in existence, in existence I'm first\nThey challenge the expert, they get their feelings hurt\nAs the rhyme flow it gets raw and deffer\nI'm the real thing, you're just a replica\nI'm [?] Clarence 13X Smith [?]\nA lotta brothers out there, they're tryin' to get with\nYou think you ready to try and step to this?\nNine times out of ten I leave them breathless\nI got flavor, save your bull, I attract those who lack with my magnetic pull\nI'm fresh and I spoil rhymes won't bounce a coil\nWhen I'm hot I unfold, and scold and boil\nRhymes - I pound them then I astound them\nIgnorant savages - I exile 'em\nBlack on the outside, white on the inside\nBro what's up with that? You're just an Oreo!\nThat ain't a way to be, but some are like that\nAnd if they come my way I just might smack\nThese wise words of wisdom and they [?] purify your [?]\n'Cause I mastered this, I'm product of Yakub\nYour name is Nimrod, you better acknowledge the God, I'm out to get mine\nTake heed, observe and keep listening\nTo the knowledge I spread 'cause I'm first in existence"}], "artist": "Lakim Shabazz"}