{"artist": "Ice Cube", "songs": [{"title": "Enemy", "lyrics": "Intro:\n\nEvery January 16th, it's \"The Dreamer, The Dreamer.\"\nAnd all of you say, \"I have a dream; The Dreamer.\"\nAnd what did he dream?It stuck him right there\nAnd little black boys, and little white girls\nWill one day hold hands together\nShit\nIs that where it's at?Is that where it's at now?\nThem little blacks hands are yours\nYou can't hold the black brothers' hands?\nBut you gonna grow old holdin' crackers' hands\nBefore you hold each other's hands?\nYou gonna walk with your enemy\nBefore you learn to walk with one another?\nHow sick can you be?\n(Enemy)\n\nVerse One:\n\nWhere you gonna go when the brothers wanna bust a shot\nWhere you gonna go when I wanna kill bloodclot\nSupercat said that the ghetto red hot\nBust a gloc, bust a gloc, devils get shot\nNappy-headed, no-dreded look where ya read it\nBuck the devil, buck the devil, look who said it\nListen what I say after 1995 not one death will be alive\nGod will survive, him protect the civilized\nWho really cares if the enemy lives or dies?\nNot me, not me\nMe never eat from the tree with the apple\nI'd rather have a Snapple\nDo you know where you're going to\nDo you know where you're runnin from\nScared of the sun\nI live in the sun\nYou shrivel up like a raisin\nAnd burn like the blunt that I'm blazin\nKu Klux Klan scared of my nutty beats\nCause them nutty beats equal bloody sheets\nOut number you somethin like 15 to 3\nSee, don't love your enemy\n\nChorus\n\nEnemies, enemy runnin from the G\nEnemies, enemy, you're my enemy\nEnemies, enemy, when will I see?\nEnemies, enemy R.I.P\n\nVerse Two:\n\nWhere you gonna run when God wanna do ya?\nJ. Edgar Hoover, I wish I woulda knew ya\nWith the boom ping ping is the ring from the fire\nMe not afraid, cause me know Elijah\nGoin to the East but straight from the Westside\nSwing down sweet chariot nad let me ride\nThrough the fire, through the fire that will please us\nI know that Farrakhan is your baby Jesus\nDevil don't you know I'm a soldier?\nIn God's name and the baby claim I'm gonna hold ya\nLike Folger's Crystals feds\nI'mma pick your ass like Juan Valdez\nYou don't care if me die from the cracka\nYou don't care if me have a heart attacka\nYou don't care if me get car jacka\nYou don't care cause you're nothing but a cracka\nNow it's Judgement Day, and Allah'll never play\n\"freedom got an AK,\" them Guerilla say\nBobby Seale said, \"please make it rough, bro\"\nWhen God give the word, me herd like the buffalo\nThrough your neighborhood, watch me blast\nTribe of Shabazz\nYou shoulda took heed of my word and became a friend of me\nNow you're just a enemy\n\nChorus\n\nVerse Three:\n\nNow I change my style up, my style up,bodies pile up\nJust to trouble you, throwin out the W\nSent me a subpoena\nCause I kill more crackas then Bosnia, Herze - govina\nEach and every day out a siz-tre Chevrolet\nWith the heavy A to the muthafuckin K\nNow you treat me like a germ\nCause your scared of the su - per sperm\nPlease don't bust til you see, the whites of his eyes\nThe whites of his skin, the whites of his lies\nNappy head nigga with the bone in his nose\nYa scared I'mma put this bone in your hoes\nBut I don't wanna, I've been to cona\nFrom the cavebitch with the nasty persona\nHit me with the big black billy club\nCause you white and your ho than a silly nub\nThree men in the tub, rub-a-dub-dub\nAnd it's really scary, now they're in the military\nSodom and Gomorrah, devil read your Torah\nBible, Holy Qur'an\nOnce again it's on, got the hollow point teflon\nAnd the brother Ron 2X, so who's next?\n(devil)\nWith Dub C, Brother G\nCrazy Toons is a crazy coon ready for the enemy\nHigh off the Hennesy\nHundred ten degree, no it's not Tennesee\nWest L.A., what the hell can I say?\nNiggas wanna play, each and every day\nPass me the pill, a nigga shoot the J\nRougher than the roughest rough muthafucka, had enough muthafucka?\nHandcuff this muthafucka with the duct tape, tie it to the bumper\nGrab his bitch, dump her, cause nobody wanna hump her\nThey call me Thumper cause I thump til it hurt\nKnock your dick in the dirt, puttin in work\nMaster Farad Muhammad comin like a comet\nWhen they see em, they all start to vomit\n1995, Elijah is alive\nLouis Farrakhan, NOI\nBloods and Crips and little ol me\nAnd we all gettin ready for the enemy", "image": "https://images.genius.com/7130347bb47a4a618915a6de2818699a.1000x1000x1.jpg", "album": "Lethal Injection", "year": "1993-12-07"}]}