{"songs": [{"lyrics": "[Verse 1]\nMy first brick did it\nI knew I was addicted when I flipped it to four\nThen I whipped it to more\nAnd it's like the streets call you:\n\"How could you leave me after all I done for you?\nWho else would employ you? I made you feel royal\nAll it took was some oil, some water\nSome baking soda to make you Hova\"\nMy first taste of power, I'm numb off the feeling\nI'm done off, niggas, I can't stop dealing\n\n[Chorus]\nI'm addicted to the game\nThe shit keeps calling my name\nI need to shoot\n\n[Verse 2]\nAin't you afraid to go to jail? God\nWell use your brain, are you sane?\nBut like Dale Earnhardt, the game is racing through my veins\nAnd I crash every time, but like I never hit the wall\nI need the K's like Pedro so I'm back pitching raw\nAnd when the bases are loaded and cops try to squeeze play\nThe game ain't cold enough to ever freeze Jay\nAnd I, need the green like fiends need yay'\nAnd they, say it ain't right but it's the game of life\n\n[Chorus]\nI'm addicted to the game\nThe shit keeps calling my name\nI need to shoot\n\n[Verse 3]\nI rap now, I eat good\nI smoke good, drink good\nMulti-millionaire but still I think hood\nBelly full, I can't shake it\nThe hunger in my belly has been replaced with other forms of starvation\nI guess it's just the need to be heard\nI need niggas to say, \"I can't believe ya words\"\nI'm just an addict, addicted to music\nThoughts is sporadic, I gotta unconfuse it\nSort of like a Rubik's Cube is\nEvery album's a color, but I fuck up the other, color\nHa, I guess I'm more like\nA bitch with a belly but her ass is right, haha\nY'all don't understand me still\nI'll never enjoy my success but my family will\nAnd I'm alright with that\nSo the rap Jerry Rice is back\nTo fulfill the need, though I lead the league\nI pray everyday, I travel at God's Speed\nNot a minute slower 'cause the minute you Hova\nEverybody's praying for your spinach to slow up\nIt's sad but it's true, but niggas ass gon' turn blue\nHolding your breath 'cause the force that's controlling my step\nWon't let me lose it, 'til I'm undisputed\nUntil I'm one with the music\n'Til I'm dead and gone, in search of the perfect song, mon mon\n\n[Chorus]\nI'm addicted to the game\nThe shit keeps calling my name\nI need to shoot", "title": "Addicted to the Game", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}