{"artist": "Big Boi", "songs": [{"lyrics": "[Verse 1: Big Boi]\nWith one stroke of the pen\nI tune in to your satellite radio or FM station\nI've been patiently waiting to weigh in\nBeen under construction for two years\nBut now it's 'bout that time I double-dutch my way in\nLeft foot, right foot, steppin' over biters\nIt's like the game is haunted 'cause there's so many ghostwriters\nMe, see, I'm a lifer with supply that may seem endless\nStraight rider like a biker on a chopper with a hit list\nWitness the nigga that spit that vicious\nPit bull attack shit when it comes to this rap shit\nDaddy Fat Sax, bitch, follow us\n\n[Hook: Neil Garrard]\nFollow us, now\nTry to all the way, now\nIt's not another let down\nGot somethin' to say right now\nFollow us, now\nTry to all the way, now\nIt's not another let down\nGot somethin' to say right now\n\n[Verse 2: Big Boi & Neil Garrard]\nI know some of y'all done wrote a nigga off\nLike the leases on these cars and these homes you niggas thought\nYou stayed in, with so many bosses, why are they still\nLayin niggas off they job? Nigga, for real?\nGon' give a nigga a gig then\nHelp a brother get up out this pigpen\nBut nobody wants to keep it pimpin' or a hundred and ten\nSo with this pen I begin to illustrate from within, boy (boy)\nPaint a pretty picture like I'm chilling with my friends\nEverybody's got a pocket full of ends to spend\nSee Picasso couldn't blend, put it all together or fit in\nI'm like a crocodile walkin' 'round with alligator skin\nYes I'm is the product of the ghetto where I lived\nCall me Spongebob, boy, soaked up game as a little bitty kid\nAnd never been a lame, before the fame I was the shit\nAnd now I'm just Big, ya dig?\n\n[Hook: Neil Garrard]\nFollow us, now\nTry to all the way, now\nIt's not another let down\nGot somethin' to say right now\nFollow us, now\nTry to all the way, now\nIt's not another let down\nGot somethin' to say right now\n\n[Bridge: Neil Garrard]\nWhy don't you come and find out\nWhat this is all about?\nI will only say this once\nSo come and follow us\n\n[Verse 3: Big Boi]\nSee we not even gonna play with 'em either\nWe gon' la-la-lay it down every fucking time we see 'em\nMake the club get crunk, yeah, we them type of people\nBut wait, it's not a sequel, no wait, it's BB's prequel\nThe beginnin' before the beginnin', spend it how you spend it\nThen, if you sell dope nigga stack it when you get it\nCan't trick it, or spend it until it's gone\nThat's slippery business homes, go get you a business loan\nC'mon!\n\n[Hook: Neil Garrard]\nFollow us, now\nTry to all the way, now\nIt's not another let down\nGot somethin' to say right now\nFollow us, now\nTry to all the way, now\nIt's not another let down\nGot somethin' to say right now\n\n[Outro: Big Rube]\nNow I lay you niggas down\nYou already sleep so bitch rest in eternal peace\nYou still scared of the Boogeyman?\nI know you hatin' but you know you was a 'Kast and a Goodie fan\nAin't no nightlight, it's lights out\nI put these lyrics up your ass so far you never get the mic out\nI know who you wanna sound like\nWith that Fruity Loop bullshit, fuck nigga night-night", "image": "https://images.genius.com/e30cece71cf2f39d49738429771fb84e.800x800x1.jpg", "year": "2010-07-06", "title": "Follow Us", "album": "Sir Lucious Left Foot... The Son of Chico Dusty"}]}