{"artist": "Angie Martinez", "songs": [{"title": "Jay Z vs Nas (Excerpt from My Voice)", "image": "https://images.genius.com/73a7b200aa7497d9ef5f014d6a487596.630x630x1.jpg", "album": null, "lyrics": "When Flex debuted \"Super Ugly\" on the radio, he played it and \"Ether\" all night back-to-back over and over. The phone lines were going crazy; people were eating it up. Not only in New York, but we were getting calls from all over the country\n\nAt this point Flex wanted to make sure that we made the most of this moment and that, as a station, we owned it: \"We're gonna bring Battle of the Beats back, Ang!!!! We're gonna let the city decide who wins this!!! And we're gonna do it on your show tomorrow!\"\n\nMy show? Why?! Flex said my voice was one of authority, and the contest could start at night with his show and could go into the day and end with me in the afternoons when I would announce the winner. The thought made me uncomfortable, but Flex convinced me that with Power looking to capture our audience it was important to remind people that if it happens in hip-hop, it happens here. And he reminded me if we didn't do it, someone else would. So I agreed. Although I didn't know how the vote was going to go, you could feel the Nas wave building\n\nIn all this, Nas was being portrayed as the real MC, the underdog. What I've noticed in our culture is that everybody roots for the underdog, myself included. The only thing about the underdog theory that bothers me is for some reason we feel the need to knock somebody down to build someone else up. In general, this is something that has always irritated the shit out of me. It's such a terrible, dysfunctional way to treat anyone successful who comes from where we come from. I have always made it a point not to subscribe to that mentality. We should celebrate success and be inspired by it, even while we're championing someone new. But nobody wants to hear that shit when you're in the middle of a battle\n\nWe sat there and hand-counted the votes until the winner was clear—sixty percent of our listeners chose \"Ether\" over \"Super Ugly.\" As much as it irritated me to hear the venom toward Jay, I agreed that \"Ether\" was the better of the two records. I'm literally getting ready to announce the winner when I look into the hallway of the station and see Jay Z walking into my studio. \"And the winner is 'Ether.'\" I had to deliver Jay that blow while he was standing right there\n\nTo say he was uncomfortable is an understatement. I couldn't really figure out why he'd agreed to be interviewed in this moment. But evidently he had been under pressure. Like I said, a lot of people felt he had gone too far. Even his mother felt that way. She was the one who suggested that he apologize for getting a woman and a child involved by even mentioning them\n\nI can see him sitting there like it was yesterday—defeated. I had never seen him like that before. He's somebody who's always so big and confident. And I hated to see him down. This is a friend, and I was a part of the machinery that brought him to this point\n\nAfter the interview, we walked outside the studio to talk alone. \"Yo,\" I said. \"Are we okay?\"\n\n\"Of course. I don't blame you for this,\" he said. \"This was just something that you kind of got sucked into. I'm clear. It's cool.\"\nFrom MY VOICE: A Memoir published by arrangement with Celebra, an imprint of Penguin Publishing Group, a division of Penguin Random House LLC. Copyright © 2016 by Media Noche Productions, Inc\n\nYou can purchase MY VOICE: A Memoir on Amazon", "year": "2016-05-17"}]}