{"songs": [{"lyrics": "(What's up this is Aesop Rock for WKCR)\n\nI traded my title as bent pedestrian for passenger status to coast muted\nFinding the night train mildly therapeutic\nRugged hacker flashing mood full of swings\nBeneath this puppet master pulling my strings\nLeaking smoke rings singing [your despite what measured honestly magnificent]\nSyndicate sold to children building homes for my omnipotent platoons\nNah I don't think the blueprints drafted tilted in the tombs\nTampering hampered scampered well beyond the dooms\nWe bloomed? the matter down to those most beautifully discrete\nApplying yesterdays models stand obsolete amongst colossals [amongst colossals]\nComply not to enforce us aborted claiming they came off\nSort of stabbed them with the capital 'A' that sets my name off\nSick of it all\nSick of the stalls\nSick of the thick brick in the wall sob stories the falls the tragic hate calls\nShaking like magic eight balls pausing to watch the vapors crawl\nMy clique heeds lessons I'll be noted from kids sisters paper dolls\nWe lining up along against these great walls\nCircling analytical\nRhetorical inquiries yet x is not applicable kid\n(Your flash minor we as orphans repeated)?\nYou're talkin' concrete examples with glass bottoms cause defeated kid I'm heated\nIts flight of the intruder and we all fall down\nConditions of never blends science with religion\nCut my character cleansed in esoteric opulence\nBut finding no intrinsic merit in your sense\nWell isn't that bewildering\nDrunken distortion and spit the filter in\nMic sweltering measures like melting my rings together an you never\nSeen I Aesop Rock flop for the love of eighty-nine point nine\nI'm here to ride upon the night train\n\n[Yeah WKCR 89.9 . . . here for the night train . . . whats up to my man\nApex, kinetic, dj ely, baz, my man Dub-L on productions, the mighty ger, my\nMan Patrick, Blockhead, Mr. Roper, Omega One, my man hates one, Percee P\nAndre . . . stay up . .. its like that . . . it's big Aesop Rock signing off . .]", "title": "89.9FM Nighttrain Promo", "album": "Music for Earthworms", "image": "https://images.genius.com/355a2e1156bc79b1e8d0997024f4cc06.300x302x1.jpg", "year": null}], "artist": "Aesop Rock"}