{"artist": "WC", "songs": [{"year": null, "lyrics": "*Car speeds off*\n\nLast man standin', I'm shot\nBut I can't fear bleedin'\nMy nigga's face down, stretched out, no longer breathin'\nI'm speedin', I'm beaten, swervin' in the G and\nRed and blue lights and squad cars is all I'm seein'\nI told you motherfuckers \"No moves, no altercations\"\nNow it's half a tank a gas and a hostage situation\nI'm facin', 25, with the 'L' so I'm stompin'\nI can't shake One-Time bitch, I swear I'm dumpin'\nHelicopters trailin' my ass, no surrender\nOnly thing I'm givin' up is hollow points and middle fingers (Fuck y'all!)\nWhoever set this shit the fuck up, done got us fucked up\nRunnin' outta time, and shit outta luck\nTake that! *Gunshots*\nI ain't goin' down mothafucka'\nTake this *Gunshots*\nMy car roof could suck my dick!\nI'm on a high-speed chase, with two money bags, *Woman screams* and a screamin' ass bitch\nIt's all bad!\nIt's all bad!\n\n\n\"Possible 211 suspect driving southbound on the 215 driving an '84\nCutlass Supreme. Believed to be armed. Please proceed with caution. repeat, proceed with caution\"\nIt's all bad!\n\"Everyone proceed with caution, suspect is believed to be a black male carrying female hostage. We got a runner fellas.\"\nIt's all bad!\n\n\nThey tryna cut me off against the gutta' lane\nTryna run these motherfuckers to the border man\nSide-swiped the mothafuckin' El Camino\nTryna get my black ass up outta San Bernadino\nI catch the 215, to the 405\nI'm catchin' hell tryna make it to the four firing line\nThey cut me off again I got to go the weather way\nChannel five in the sky we'll take *Helicopter sounds* 'em through L.A\n*Woman screams*\nQuit screamin' bitch (Shut the fuck up!)\nHo' you slowin' me down, they ain't thinkin' 'bout yo' ass shut the fuck up now!\nThe bitch didn't budge, so I shot her, \"Bla! Bla!\" *Gunshots* (Stupid! fuck, take a look at you now!)\nI kicked the door open *Door opens*, threw her body on the freeway\nContinued the chase, wiped the blood *Door closes* off my face\nLookin' for an exit as soon as I reloads my mag' *Reloads mag*\n*Car horns throughout*\nStuck in heavy traffic\nNigga, It's all bad!\n\n*Car horns and helicopter sounds*\n*Garbled static*\n\"Suspect has just thrown female hostage on the side of\nThe 605 freeway. We now have him in heavy traffic on the 105 heading westbound.\"\nIt's all bad!\n\"Looks like he's trying pulling 1-8 10 and Central. He might try and\nMake a run for it. Don't let him get away. Take this fucker.\"\nIt's all bad!\n\nNow it's time for me to make my getaway!\nFuck a hostage, I'm doin' this the nigga way!\nI jumped out the car, and started squeezin' the trigga'\n*gunshots* (Bla! bla! bla! bla!)\nAnd duckin' at 'em, I'm bustin' at 'em, laughin' at 'em, tryna splat 'em, cussin at 'em, like a true fuckin' G is supposed to\nI'm bustin' at the helicopter as I get closa'\nTrynna shake 'em off my tail\nI make my way to the side of the freeway\nNow I'm climbin' over the guard rail\nI'm a felon, I can't take no shorts\nI'm runnin' down Imperial past Imperial Courts\nStop to catch my breath 'til I heard the dogs barkin'\nNow a nigga's runnin' past the Nickerson Gardens\nI hear the helicopter closin' in, yellin' \"freeze\"\nBut I'm yellin' back \"fuck you!\", hittin' 'em up with C's (Fuck yaa'll!)\nA beautiful day for dyin', nigga I'm hearin' sirens\nOn sight, no warning shots that these coward's 'll be firin'\nI made my way to Avalon\nPeepin' any, get in the corner\nI gots to think quick, or I'm a goner\nSaw this nigga slippin' in a '98 Ac-Right\n*Gun cocks, followed by a gunshot* (Get the fuck out!)\nLeft him bleedin' at the light!\nNow it's back on, the money bag full of riches\nFuck One-Time, that get in my way, I'm killin' these bitches\nI'm doin' 85 loc, these fools can't touch me\nCame across Western, hit the back at Kentucky\nFishtailin', mashin' on my brakes I had to stop\nAwww fuck! Ain't this a bitch? A road block!\n\n\n\"Get out the car now I say, keep your hands up!\nGet out the car now or I'm forced to shoot!\" *Gun cocks*\nFuck that\n\"He's movin'!! He's movin'!\"\n\n*Car speeds off*\n\n*Gunshots*\n\n\"Cease fire! Cease fire dammit!\"\n\nIt's all bad!\nDead on arrival!\nNigga, It's all bad!\nDead on arrival!\nIt's all bad!\nIt's all bad!\nNigga we all, dead on arrival!\n\n*Helicopter flies by*", "image": "https://images.genius.com/e3cb3b767a7c4236e1df057692fb01b0.402x400x1.jpg", "album": "The Shadiest One", "title": "It’s All Bad"}]}