{"artist": "BewhY", "songs": [{"lyrics": "[Verse 1]\n대한민국 래퍼 중 제일 한심한 놈\n지금 앉아 있는 그 자리가 너의 순수한 실력으로 온 것 같으냐? No\n$exy $treet, C Jamm 인맥빨이야 넌\n변명하기 바뻐, 이제 하지 말어, 말이 많은 니 주둥아리 닫어\n알았냐, uh? 나이가 젊다는 건 말이여 니 인생 안에서의 선물\n시간을 아껴야 할 땐데 또 쓸 데 없는 짓거릴 하는 너\n그런 너보다 세상을 따러야 하는 걸\n왜 이젠 있지도 않은 가능성을 만들어? 이제 이 짓은 관두렴\n야망과 소망은 전부 거짓된 것, 현실에게 가려지게 될 거야\n피할 수 없어 넌, 꿈이 아닌 현실 가운데 살기에\n너가 음악으로 성공한다는 것은 말야 신이 존재한다는 증거\n말 그대로 그냥 존나게 말도 안 될 불가능한 증명\n꿈은 이뤄진다는 말 이 말의 뜻은 말야 바로 현실과 손 잡기\n소망의 성취 따윈 존재 안 해, 내 조언을 듣고 벗어 꿈의 콩깍지\n너란 존재는 지구 밖에서 보면 절대로 보이지도 않아\n가치를 매긴다면 그저 그냥 수많은 점들 중에 하나\n지금 니 꿈과 열정은 한낱 스쳐 지나가 사라지는 바람\n편하게 생각해, 과거의 추억으로만 남을 테니 말야\n\n[Chorus]\nFake, you fake\nYou just fake\nYou fake\n\n[Verse 2]\n니가 숨기는 과거 숨겨 봤자 들키는 건 시간 문제\n니 열등감은 선천적인 것, 내가 볼 땐 평생 해결 못할 숙제\n아무도 안 알아주는 니 첫 mixtape\nC Jamm의 랩에 묻힌 니 beat and rap\n한 길 파기도 바쁜 세상에서 뮤지션과 학생으로서 위치해\n한심한 처지 fucking 병신, 내가 갖는 맘은 오직 동정과 연민\n2년 반 동안의 낭비된 시간과 돈, 그에 따라서 사라진 자유한 몸\n그 꿈은 헛된 것, 니 과거들을 돌아봐 보면 잃은 것 뿐\n너가 원했던 것 그리고 소망하는 것 중 너가 대체 이룬 것은 있냐?\n꿈을 찾는다면서 쓸 데 없이 가는 대학교\n부모 등골 파 먹는 문제아죠\n학교를 가는 이유에 대한 대답도 못 하는 수동적인\n따까리 멘탈로 끌려 다니기 바쁜 절대 리더는 못될 놈\n자기 주장 못 펼치고 또 센 척, 쿨 한 척 하는 그런 놈이 너잖아\n제발 좀 솔직해져\n학교 다닐 돈을 차라리 자신에게 투자해, 부모를 위한다고?\n만일 너가 랩을 안 하고 학교만 다녀도 성공할 가능성은 아마도\n랩을 해서 성공할 확률과, uh, 도토리 키 재기\n그냥 다 포기해, 안 그럼 더 자랄거야 남에 대한 열등과 시샘이\n\n[Chorus]\nYou fake\nYou just fake\nYou fake\n\n[Verse 3]\nFuck the christian, fuck the christian\nFuck 니들 예수가 주신 free life\n다 거짓말, 자유와 진실은 나 자신과 자아에 있다\nReal life? 그건 내가 내 삶의 주인이 돼 내가 하고픈 대로\n하면서 살아가는 거지 뭐, 신은 존재하지 않아 절대로\nWake up, stand up yellow, 애써 보이지 않는 걸 믿으려 해?\n넌 왜 또 진짜 내가 볼 때는너무 우스워서 배꼽 잡게 만드네, fuck\n너 같은 놈이 hip hop 하는 래퍼? 예수? 뭐 허구적인 얘기는 됐고\n남들이 좋아하는 내용이나 제발 뱉어, 에휴, 정신 챙겨\n예수를 위해서 거룩 코스프레 fuck, suck ya dick asshole\nFuck life for Jesus yo, 그 어떤 기적도 너에겐 1퍼도 없어\nB-e-w-h-Y, 너가 믿는 건 사실로서 증명 된 건 zero\n모든게 니 비교 의식으로 나타난\n우울함의 해결을 위한 거짓 우상일 뿐\n만일 니가 믿는 예수가 있어도 니 안에 든 그 악의 위선은\n평생 간직하게 될 거야, 넌 죄인이니까요\n아무리 니가 저 예수님이나 저 하나님이나\n무언갈 믿는다 한들 그 죄가 씻긴다는 건 불가능해\n죄의 더러움은 거룩하신 신께서 보지도 않으시지\n그 분은 너무 거룩해서 더러운 너를 피했어\n\n[Chorus]\nFake, you fake\nYou just fake\nYou fake", "image": "https://images.genius.com/3560c2300fce3debfcfc727410371801.500x500x1.jpg", "year": "2015-03-10", "title": "자화상 (Fake)", "album": "Time Travel"}]}