{"songs": [{"image": "https://images.genius.com/c36e5c7db2006588050516faa9963739.316x315x1.jpg", "title": "Hero", "album": "The Nigger Tape", "year": "2008-06-23", "lyrics": "[Intro: Polow da Don]\nQB… where the fuck y'all at?\nHa... YEAH, let's go\nGETS MONEY!\n\n[Chorus: Nas & (Keri Hilson)]\nChain gleamin', switchin' lanes, two-seater\nHate him or love him for the same reason (fresh)\nCan't leave it, the game needs him\nPlus the people need someone to believe in (yes)\nSo in God's Son we trust\n'Cause they know I'ma give 'em what they want\nThey lookin' for a (hero)\nI guess that makes me a (hero)\n\n[Verse 1: Nas]\nAnother chapter of the cleanest rapper, distinguished gentlemen\nCrooks & Castle on his back, Maybacher\nExotic lady eye-catcher, holla at ya, call me the chiropractor\nWorkin' like Muay Thai class, get perspire out ya\nAnd of course I've been the boss since back when\nRockin' D Boy, Fila velour in one-ninety black Benz\nNow they shut down the stores when I'm shoppin'\nUsed to be train robbin', face covered in stockin'—I'm him\n\n[Chorus: Nas & (Keri Hilson)]\nChain gleamin', switchin' lanes, two-seater\nHate him or love him for the same reason (fresh)\nCan't leave it, the game needs him\nPlus the people need someone to believe in (yes)\nSo in God's Son we trust\n'Cause they know I'ma give 'em what they want\nThey lookin' for a (hero)\nI guess that makes me a (hero)\n\n[Verse 2: Nas]\nRubber-grip-holder, reloader\nCome at me, I'ma rip your soldiers in half\nSilverback ape, nickel-plated mag\nYoung, rich and flashy; young bitch, I'm nasty\nAll black clothes 'til ice lay on me so classy\nAnd every time I close my lids\nI can still see the borough, I can still see the Bridge\nI can still see the dreams that my niggas ain't never lived to see\nTell them angels open the door for me\nFrom nine Berettas and movin' raw\nTo chillin' in wine cellars, sticks and humidors\nThat's what I call mature\nThat's what I call a G, that's what I call a pimp\nThat's what I call a gangsta, to the fullest, shit\nI try to make more cream\nBy every September 14th, that's my dream\nSo I can be more clean, as I grow yearly\nI can see things more clearly, that's why they fear me (let's go!)\n\n[Chorus: Nas & (Keri Hilson)]\nChain gleamin', switchin' lanes, two-seater\nHate him or love him for the same reason (fresh)\nCan't leave it, the game needs him\nPlus the people need someone to believe in (yes)\nSo in God's Son we trust\n'Cause they know I'ma give 'em what they want\nThey lookin' for a (hero)\nI guess that makes me a (hero)\n\n[Verse 3: Nas]\nThis universal apartheid, I'm hog-tied, the corporate side\nBlockin' y'all from goin' to stores and buyin' it\nFirst L.A. and Doug Morris was ridin' with it\nBut Newsweek article startled big wigs\nThey said \"Nas, why is he tryin' it?\"\nMy lawyers only see the Billboard charts as winnin'\nForgettin' Nas the only true rebel since the beginnin'\nStill in musical prison, in jail for the flow\nTry tellin' Bob Dylan, Bruce or Billy Joel\nThey can't sing what's in their soul\nSo \"Untitled\" it is\nI never change nothin', but people remember this\nIf Nas can't say it, think about these talented kids\nWith new ideas bein' told what they can and can't spit\nI can't sit and watch it, so shit, I'ma drop it\nLike it or not, you ain't gotta cop it\nI'm a hustler in the studio, cups of Don Julio\nNo matter what the CD called, I'm unbeatable y'all, let's go!\n\n[Outro: Polow da Don]\nYeah, Nas, Polow da Don"}], "artist": "Nas"}