{"songs": [{"title": "Get to You", "album": "The Bigger Artist", "year": "2017-09-29", "image": "https://images.genius.com/7d94aecd396a79046cef20ef7fdead34.640x640x1.jpg", "lyrics": "[Intro: A Boogie Wit Da Hoodie]\nMetro Boomin' make it boom\nYeah, Metro Boomin' make it boom, make it boom\n\n[Chorus 1: A Boogie Wit Da Hoodie]\nDon't be telling me you're through\n'Cause I be thinking, that it's true, that it's true\nTelling me about your new boo\nWhen I don't wanna face the truth, if it's true\nI just wanna get to you\nAnything to get to you, get to you\nI just wanna get to you\nAnything to get to you, get to you\n\n[Verse: A Boogie Wit Da Hoodie]\nI always had you in some new Loubs\nNever let you complain about your shoes, 'bout your shoes\nWhen nobody would listen to me\nI know, that I can talk to you, talk to you\n'Cause everybody else is clueless, no excuses\nKeep on saying they gon' do shit, never do shit\nShe keep saying she gon' use me, I'ma use her\nI got on so many jewels, I feel like a jeweler\nI pulled up in a Patek, you pulled up in a Muller\nDouble wedding band ring, she pulled up in a new fur\nMetro Boomin' on the beat, I feel like I'm cheating\nShowing me that nipple ring, I feel like you teasing\nYou keep begging me to eat, girl, why you beasting?\nCan I take you to my suite? Yeah, for a weekend\nCan you come and give me brain? Make me a genius\nI could make that pussy beatbox, while I'm singing\n\n[Chorus 2: A Boogie Wit Da Hoodie]\nBut when you tell me you're through\nI start to think, that shit is true, is it true?\nTelling me about your new boo\nWhen I don't wanna face the truth, if it's true\nI just wanna get to you\nAnything to get to you, get to you\nI just wanna get to you\nAnything to get to you, get to you\nI just wanna get to...\n\n[Verse 3: A Boogie Wit Da Hoodie & Future]\nI need to care to you, carefully, carefully\nI'm moving carefully, iggin' me, iggin' me\nIt don't make sense to me, send for me, send for me\nNeed you to win for me, care for me, care for me\nAnd if you care, make time for me, make time for me\nAnd when you lie to me, it just be killing me\nYou're acting differently, I need to get to you\nI need you there for me, I need to get to you\nI need to get to you, carefully, carefully\nI'm moving carefully, iggin' me, iggin' me\nIt don't make sense to me, sin for me, sin for me\nNeed you to win for me, care for me, care for me\nAnd if you care, make time for me, make time for me\nAnd when you lie to me it just be killing me\nYou're acting differently, I need to care to you\nI need you there for me\nIf Young Metro don't trust you, I'm gon' shoot you"}], "artist": "A Boogie Wit da Hoodie"}