{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/1934a1107b759549c286680bb18eb64a.500x500x1.jpg", "title": "Amerikaz Most Wanted", "year": null, "album": "Independence Day", "lyrics": "[Intro]\nKristen Modaferri didn't waste any time when she arrived in the Bay Area. Through the internet she found a place to live in Oakland. Three days later, she already had a job across the bay in downtown San Francisco (Yo this is crazy). Kristen worked at Spinellis' Coffee Shop at the Crocker Galleria. \"She called a couple of days before she disappeared to tell us what a great time she was having and how wonderful San Francisco was. And all of a sudden she goes to work, clocks out at 3PM, and that's it. We don't know what happened\n\nI don't know what I'mma do (Shout out to the homie Lil' B)\nWhat did I do (Oh West Coast)\nI can't believe this (Chip gone crazy for this one. Let's go!)\n\n[Verse 1: Lil' B]\nStarted off daylight cool scenes, same flight\nNext to my love nodded, and then I bossed up\nLanded in Paris, got off the plane and\nAin't no Ferris, looking at my queen like\nShe's the real Harris, go to the hotel\nShower in the hotel, white make your nose swell\nLouis V bag, Coach bag with the coattail\nSit down girl, I'mma show you that my dough real\nYou ain't ever met a dude that's crazy like me\nI can see how you looking, just relax girl you shook\nI done took you on a trip and you don't have to pay shit\nAnd now I'm in control and you owe me a little something\nI'm in the game hustling, you in the Bay hustiling\nAnd I took you from your home, and your name is meaning something\nLook me in my face, I ain't playing games cousin\nYou my main bitch, and I dare you to say that you wasn't\n\n(He had a sense of flair, he had money. He had looks. Money was no object. And he also had a vocation or avocation which was quite different than the normal fare)\n\n[Lil B]\nI'm America's most wanted\n\n(He didn't work. His family was well overdue, and they supported him, and he was a free spender. He was flashy. He liked the nightlife. He liked to go clubbing. He was described as a very handsome individual. One that all he had to do was snap his fingers and all the girls would go to him.)\n\n(You put two of America's most wanted together. You get classic material and that's what this is. West coast all the way to the midwest. We run this. Here we go!)\n\n[Verse 2: Chip tha Ripper]\nWhat do you mean you have to leave\nWhat do you mean you lost your keys\nShe opens up her purse to look\nDiscovers that there's no pocketbook\nI'm not a crook, relax a bit\nI'm just a persistent man\nEverything can flow just fine\nBut soon as you start to resist me then\nAnother side of me comes out\nSwear it's not what I'm about\nPromise that I don't like to shout\nAnd pull these knives and shotguns out\nYou cry, you pout, you wanna go home\nBut what about me, then I'll be alone\nI just need someone like you\nPromise me now that you will stay true\nFuck the world, just me and my boo\nDon't make me do what I don't wanna do\nCome on, I'm running away with you\nGo somewhere and play with you\n'Cos all I can think about is you\nYour smell, your smile, your beautiful skin\nTold your mother you'd be home at 10\nLook at the clock, oh what a sin\nWhy did you lie, to her at least\nCome and lay down, you deserve some sleep\nPlease don't be timid or nervous sheesh\nYou acting like I'm some sort of beast\nI just need love, I just need hugs\nHere loosen up, would you like any drugs\nLife is rough, I just need help\nLike any food, I cooked it myself\nLooking for wealth, found it fast\nLooking for love, no luck for my ass\nUntil I met you, now how about some kids\nTurn me down and be regrettin you did\nAm I that bad, maybe so\nLook what I done, I've been a ghost\nYou made me do what I did before\nBut every time it's love for sure\nOh\nShe made me do what I did before\nBut every time, it's love for sure\nOh no\nLet it go\n\n(He was only 22, but friends say he was already a star. He played the hottest clubs in Miami.)\n\n[Outro: Lil' B]\nI'm Amerikaz most wanted (I'm a felon)\nI'll be grateful if I get away\nI'm hiding, I gotta go\nI'm America's most wanted\n\n(But first, the case of a man wanted for murder. \"He went first class.\"\n\"Two counts of homicide, kidnapping, and recklessly endangering another person.\"\n\"People are making him out as somebody who lived his life getting in trouble all the time and basically a bad kid, but he wasn't a bad kid.\")"}]}