{"artist": "Ice-T", "songs": [{"title": "Body Count", "lyrics": "[Intro: TV Interviewer]\nIce-T, after your tremendous success on your past album\nSome have said; you have sold out\nBecause of the use of rock'n'roll in your music\nHow do you reply to that?\n\n[Ice-T replying]\nYou see, a lotta people don't realize that, you know\nRock'N'Roll is truly black music\nIt was created by Chuck Berry, Little Richard\nEven black people like that, who started it off back in the day\nYou know, and as far as I'm concerned music is music\nI don't look at it as Rock or R&B all that kind of stuff\nI just look at it as music, you know\nAnd anybody who said that I've sold out, they can basically suck my dick\nCause I really don't give a fuck about that shit, you know\nBut uhh.. I do what I like, I happen to like Rock'N'Roll\nAnd uhh.. I feel sorry for anybody who only listens to one form of music\nYou know, right now, I got my own Rock band, it's got to jump off\nIt's really black hardcore band called Body Count\nAnd uhh.. on some of the records I'm like laying some vocals on it\nAnd uhh.. I got a tape of it right here, yo, check it out\n\n[Song's Intro: Ice-T]\nYou know, sometimes I sit at home, you know, and I watch TV\nAnd I wonder what would be like to live in some place like\nYou know, The Cosby Show, Ozzie and Harriet\nYou know, where Cops come and got your cat outta the tree\nAll your friends died at old age\nBut you see.. I live in South Central, Los Angeles\nAnd unfortunately... SHIT AIN'T LIKE THAT!!\nIt's real fucked up!\n\n[Verse One: Ice-T]\nGod damn, what a brother gotta do\nTo get a message through\nTo the red and white and blue\nWhat? I gotta die before you realize\nI was a brother with opened eyes?\nThe world's insane while you drink champagne\nAnd I'm living in black reign\nYou try to ban the A.K\nI got ten of them stashed\nWith a case of hand grenades\n\n[Hook: Body Count]\n(Tell us what to do?) Fuck you!\n(Tell us what to do?) Fuck you!\n(Tell us what to do?) Fuck you!\n(Tell us what to do?) Fuck you!\n\n[Verse Two: Ice-T]\nYou'd know what to do\nIf your kid got killed on the way to school\nOr a cop shot your kid in the back yard\nShit would hit the fan motherfucker and it will hit real hard\nI hear it every night, another gun fight\nThe tension mounts, on with the Body Count\n\n[Break: Ice-T]\nYo Beatmaster V, take these motherfuckers to South Central\nHa ha ha, yeah, fuck that\nI hear it every night, another gun fight\nThe tension mounts, on with the Body Count\nLast weekend thirty seven kids killed in gang warfare in my back yard\nNO!!, NO!!, NO!!\nYo Ernie C, take these motherfuckers home, yeah\nYo, we're in the house, Body Count fool, 1991 motherfucker\nI hear it every night, another gun fight\nThe tension mounts, on with the Body Count\n\n[Verse Three: Ice-T]\nGod damn what a brother gotta do\nTo get a message through\nTo the red and white and you?\nWhat? I gotta die before you realize\nI was a nigga with opened eyes?\nThe world's insane while you drink champagne\nAnd I'm living in black reign\nDon't you hear the guns?\nYou stupid, dumb, dick sucking, bum politicians!!\n\n[Hook: Body Count]\n(Tell us what to do?) Fuck you!\n(Tell us what to do?) Fuck you!\n\n[Outro: Ice-T]\nThe tension mounts...", "image": "https://images.genius.com/8ba43671bb57813daf61c8431aebd0ea.1000x1000x1.jpg", "album": "O.G. Original Gangster", "year": "1991-05-14"}]}