{"artist": "YG", "songs": [{"image": "https://images.genius.com/46b3a8826081b1d6675c55e03a09a50e.672x672x1.jpg", "year": "2014-12-15", "album": "Blame It On the Streets", "lyrics": "[Intro: YG]\nGirl you know I love you, baby. You know I love you. I be callin' your mama house lookin' for you, some more shit. All them fuckin' letters you sent to the county, I love them letters, baby. Ay I'ma buy you roses and some more shit, flowers, everything, baby. When I get out, when I touch down I'ma buy you everything, some red bottoms and some more shit, baby. SIKE!\n\n[Verse 1: YG]\nIf I gave a fuck about a bitch, I'd probably have a baby by now\nI'm always tryna see if it's my child\nNever bow down, never confess\nCould've swore I shot blanks, I'm gettin' a blood test\nYou know why I can't trust no bitch?\nI mention a blood test and the whole conversation switch\nYeah, she ain't have nothin' to say at all, nigga?\nNope, nigga these hoes ain't shit\nI don't support child support, I won't show up to court\nYour intentions was Mickey from the jump, what we was fuckin' for\nGirl you know I don't play that shit\nI'm the captain with no cape, I don't save no bitch\nI just give 'em dick and dip, you can call me Diplo\nHer plus me with two homies, she was with the flip mode\nAnd that was like 2 in the morning\nShe was home and laid up with her nigga, man these bitches be ho-in'\n\n[Hook: YG]\nIf I ever gave a fuck about one bitch, nigga I would be dumb\nIf I ever gave a fuck about one bitch, nigga I would be dumb\n\n[Verse 2: TeeCee4800]\nIf I gave a fuck about a bitch, I'd always be broke\nI'd never have no mothafuckin' endo to smoke\nAsk TeeCee the loc, you don't know by now?\nI'm that ganged up nigga with that midtown sound\nHit the club in my Dickies on some gangsta shit\nShe bad, I give her this gangsta dick\nRide slow down your block in that gangsta whip\nExtra clips, if you run then you better not trip\nNow she blowin' up my phone tryna get that ring\nHold up, bitch, that nigga just got hit\nYou can talk to the boss, shit I ain't gon' trip\nAll that talkin' out your mouth, you can suck this dick\nAll my life, all my life\nStack this money, I don't need no wife\nAll my life, all my life\nFucked you once, might fuck you twice\n\n[Hook: YG]\n[If I ever gave a fuck about one bitch, nigga I would be dumb\nIf I ever gave a fuck about one bitch, nigga I would be dumb]\n\n[Verse 3: Charlie Hood]\nAnd know it ain't no fun if the homies can't have none\nCharlie Hood, I'm goin' hard on a bitch\nShe fakin' that nut to keep her relationship\nNow ain't that some shit, never loved no trick\nThat's why I'm fuckin' bitches, ballin' hard, James Worthy\nPut her on the team and now she tryna rock my jersey\nSayin' that she loyal but she's really thirsty\nSuck a nigga dick cause I don't show her no mercy\nOne for the money, two for the show\nHangin' out the window like, \"mothafuck a ho\"\nGettin' money every day cause that's all a nigga knows\nStash spot got the heat, cause all my niggas trained to go\nAnd that's for them hoes, yeah I'm through with it\nThere's nothin' left to do with it, pass it to the bro\nNow you hit it, cause she ain't nothin' but a bitch to me\nAnd y'all know that bitches get flipped by me\n\n[Hook: YG]\n[If I ever gave a fuck about one bitch, nigga I would be dumb\nIf I ever gave a fuck about one bitch, nigga I would be dumb]", "title": "If I Ever"}]}