{"songs": [{"year": "2018-07-18", "lyrics": "[Intro]\nAye, the money come and go, the money come and go\nMoney come and go, that money can go, yo\nMoney come and go, oh, oh, oh, yeah\n\n[Chorus]\nOoh, if you gotta check in your name\nFor a hundred thousand dollars\nHonestly, what would you do? (what would you do?)\nOoh, what would you do? What would you do?\nOoh, if you got that check in your name would you try to\nSolve everyone's problems with dollars\n'Cause, what's it to you? What's it to you? (what's it to you?)\n\n[Verse 1]\nNow, I'ma start this off sayin' a hunnid racks (hunnid racks)\nDoesn't mean you're rich, please know this as a fact (that's fact)\nI wish there was somebody that had told me that (told me that)\nAnd if they did, I'm sorry for opposin' that (damn)\nWhat would you do is what I'm askin' since you know it all right? (nah)\nYou say save but really wanna blow it all in four nights (damn)\nYou really wanna chain, don't you? (uh-huh) and a Rollie\nVacation, first class for you and the homies\nBitch on my moms, you go broke like that (like that)\nThey only helped y'all to help smoke yo' packs (that's fact)\nEverybody eats if everybody works\nI don't want you on the streets, but at least be on the curb\nAnd they gon' say 'we' to include themselves\nGo on all types of rants tryna prove themselves\nPut it on pause, stop that shit from goin' on\nIf they show you empty pockets, you gon' find them niggas\n\n[Chorus]\nOoh, if you gotta check in your name\nFor a hundred thousand dollars\nHonestly, what would you do? (what would you do?)\nOoh, what would you do? What would you do?\nOoh, if you got that check in your name Would you try to\nFix everyone's problems with dollars\n'Cause, what's it to you? (what's it to you?) What's it to you? (aye)\n\n[Verse 2]\nNow, let me tell you this lil' story 'bout mine ('bout mine)\nTowards Summer '15, what month, start of July (July)\nI got me a check just short of 150 (150)\nOr north of 130 (what?) Or one-thousand Benjie's\nYeah, I threw my momma I think like twenty-five\nFuck them college loans, 'cause twenty-two isn't right\nTwenty-five in Airbnb alone, that's no lie (damn)\nBut, I still had to provide\nPlus, I had paid all my dealer's best (dealer's best)\nWho let me slide? 'Cause it be's like that (be's like that)\nATM knows where yo card, it turned off\nWhen I had a job, I was not seen at all\nI was still drivin' on E, no gas (no gas)\nNothing but lint in my jeans, low cash\nHadn't seen a bank in like fifty-eleven years (seven)\nHavin' others work the stove, sharin' one forty ounce here\nStraight outta no cash, them boom, oh my\nSunshine my forecast, brighten my sky\nI tried to make it flip, like old metal jam years\nStill payin' high rent, thank God I'm still rich\n\n[Outro]\nOoh, if you gotta check in your name\nFor a hundred thousand dollars\nHonestly, what would you do?", "title": "WWYD?", "album": "That’s A Girls Name", "image": "https://images.genius.com/4311bb7e39cbb67a2c30c926fab351c3.1000x1000x1.jpg"}], "artist": "DRAM"}