{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/da732ae2fff001033c5054aeffc0ef78.1000x1000x1.jpg", "title": "Jackson Pollock", "year": null, "album": "O.K. ", "lyrics": "[Hook]\nGirl, let's get wasted and then get naked\nI have you like \"Oh\"\nI mean, white boy wasted, straight shit-faced an'\nI have you like \"Oh\"\nI want a becky with braces but that's so racist\nOh, oh, oh\nWhere the hell is my flip-cam? I should've taped it\nDamn\n\nDo a little dance\nMake a little love\nOh my god, what the fuck? Oh my god (x2)\n\n[Kool A.D.]\nPeace to Ragazino, Mr. Tambarino\nSippin' vino, I'm Al Pacino, (?)\nItaliano (?) go \"Bada-bing!\"\nHeat fuses circuit together like soldering\nPosse on Broadway, Mama, I Want to Sing!\nSwerved after mama wanna sure shot karma\nKarma chameleon there, Sicilian hair\nBrazilian there on her pussy lips\nHair on the weed stay orange like Snooki get\n\"Aw, sookie sookie\", quick riddle me this\nRookie, what's tougher the cookies or tits?\nSo En Vogue, you never gonna get it\nSpots get licked like shots peace kinetic\nSee me said it, and knock it too\nTell me who to sock it to\n(?)\nSome say \"No way Jose\"\nMe say \"Yes way\"\nSee me make a G in a fresh way\nAnd not a sleazy way\n\n[Hook]\n\n[Maffew Ragazino]\nOh I think she like me\nYoung flounder flipped and I scale her she's a Pisces\nSomething something something\nYeah she dig me in my white tee\nJordans Spizike Nikes\nSnapback flipped like Mars on \"Do the Right Thing\"\nBitch, I'm the senior, citizen\nSome people will live in fear, I will never visit it\nYou live with ya lady, you's a lover I be visitin'\nWe get it in and I get out\nRight before you usually be gettin' in\nKing Stampede sweater from '05\nTwo shorties and two forties, a 45\nBlood alcohol point five so shortie drive\nEyes rolled in back of my head, Poltergeist\nI need a clueless blonde, that's so basic\nAss like that girl was black\n\"Man that's racist\"\nAnd her waist is miniature\nNo miniature golf\nHole in one\nNicholson\nMini Cooper\nVolkswagen Beetle\n\"Ragazino\nPretty pretty please don't quit, the game needs you\"\nYou been looking for a needle in a haystack\nYour whole career, so give it up\nASAP\n\n[Heems]\nEveryday I wanna quit rap, everyday keep going\n\"Yo, I'm finna quit rap\"\n\"Chill Heems, keep going\"\nYo, life is a bitch, but I ain't Lil' Wayne\nSo I'mma maintain mane and do my fucking thing\nIt's Heems from Queens, people say I'm on some hipster shit\nSay I'm different\nNah homie, I'm indifferent\nIlliterate immigrant tryna collect dividends\nThe Bay Brownsville in Queens is getting it\nDo the green nines\nBooger-green sweater from Bombay\nRocked him with pants from Conway to John Jay\nHe came a long way from the Pergament\nThe Genovese, the Woolworth, The Wiz, some other shit\nShoutout to all the biddies that service him\nBiddies be servicing\nHerman a nervous wreck\nHalf Geronimo, half Mic Geronimo\nIn Guantanamo, I'm an animal\nYo, I'm on your college campus with a baggie full of Adderalls\nOn my college campus with a baggie full of Adderalls\nIt's aii'ght though doggie, nothing matters at all\n\n[Hook]"}]}