{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": "2013-04-30", "lyrics": "[Intro]\nIt's a jungle out there, you gotta have\nIt's a jungle out there, you gotta have\n\n[Verse 1: R.A. the Rugged Man]\nYo, I'll put my dick out and I'll pee on your property being a mockery\nI'm abusive cheating never believing in monogamy,  mediocrity\nPockets full of singles at the strip club, cash dropping, no class ass riding\nI'm heinous, atrocious, repulsive, I'm past shocking\nRappers is speaking with no heart, don't start, it don't matter\nI can slay you to Bach, Bethoven, Amadeus Mozart\nAt the dinner table cursing wiping cum on your curtain\nI'm a poverty pirate, a poor penny pinching pitiful person\nI'm from the 80's where we were skeezing and pleasing the skeezers\nThieving and popping and shooting and robbing and boosting and stealing your sneakers\nWon't be in Forbes mag on no Forbes listes, but my life is parties\nAnd gambling, hookers, whore houses and porn bitches\nHotel orgies with groupies, we rock stars, heart throbs\nOn the roof throwing cinder blocks from the hoods at cop cars\nI'mma disrespect you to pigs, you was squealing too, they didn't protect you\nLiving and learning and losing listening to the lecture, hitting it and giving it extras\nSnatch your prom date, rip the cunt hole, I'm the bully, get your lunch stole\nHouse parties, stick my balls in the punchbowl, come on, sing it\n\n[Chorus: Ruste Juxx]\nIf you sick twisted, disgusting\nIt's a jungle out there, you gotta have\n(Hits, hits, hits, nigga, hits hits hits\nHits, hits, hits, nigga, hits hits hits)\nYou gotta have\nIf you sick twisted, disgusting\nIt's a jungle out there, you gotta have\n(Hits, hits, hits, nigga, hits hits hits\nHits, hits, hits, nigga, hits hits hits)\nYou gotta have\n\n[Verse 2: Hopsin]\nYo, it's Rugged Man and Hop, we never get handed props\nWe keeping it dope and underground as the planet watch\nIf you want some bullshit, we spitting lyrics, then dammit stop\nTalking like you the hardest artist and you just can't get knocked\nSo keep thinking that, take this track and play it back\nJust to remind you that everything you fucking say is wack\nBut don't get mad and start cussing at us\nCause we just finally fixed the shit cause you was fucking it up\nYo, I'm sick of the game and everything it deals with\nYo, R.A. come over and bring the kill switch\nOur brains are real sick, insane and filled with\nA gang of ill shit, we can't be killed, bitch\nWho want it with us? We never tow and get up\nDon't try to step up cause I promise that you'll only get bucked\nEmcees are scared running as we slowly erupt\nWe was born for this, yo, it's time to bring the chorus in\n\n[Chorus: Ruste Juxx]\nIf you sick twisted, disgusting\nIt's a jungle out there, you gotta have\n(Hits, hits, hits, nigga, hits hits hits\nHits, hits, hits, nigga, hits hits hits)\nYou gotta have\nIf you sick twisted, disgusting\nIt's a jungle out there, you gotta have\n(Hits, hits, hits, nigga, hits hits hits\nHits, hits, hits, nigga, hits hits hits)\nYou gotta have\nIf you sick twisted, disgusting\n[?] then why don't you go? (underground hitz)\nIf you [?] society [?], why don't you go?\nUnderground hitz", "title": "Underground Hitz", "image": "https://images.genius.com/c839ae29cd32413eb20a1c6585d7d604.1000x1000x1.jpg"}]}