{"songs": [{"image": "https://images.genius.com/c0563c9032200258584576466a5d6d53.395x395x1.jpg", "album": null, "title": "No Hook", "lyrics": "[Verse 1]\n\nCheck!\n\nI'm so what's-upper\nWhen I hear a beat it's like mommy saying \"Time for supper\"\nI guess that means the studio is my diner\nYour chain hang like tampon strings out vaginas\nSo nigga you pussy, Wrap that kushy\nYour girl wanna suck it like 7-11 slushie\nSo give me that gushy, funky, nasty stuff\nIsrael like Nazareth, meaning he is real\nNigga your beat's like a cheap x pill\nMean nothing to me like a lonely cheap thrill\nTrue plus real equals a trill, and minus your bitch ass\nBound to drown like toddlers in advanced swim class\nDrink a bitch quick like fat hoes do Slim Fast\nAll my bitches ballin' in the D like Swin Cash\nAnd she brings that paper\nShake that ho like ultimate warrior do the ropes\nIf she moves slow with the dough\nFire that bitch, hire a new ho\nDanny Brown a hybrid\nSort of like a pirate off acid, bangin' Primus\nSmoking that cough that'll fuck up your sinus\nHeater with me sorta like that blanket and Linus\n\n[Verse 2]\n\nAnd I don't need a hook for this shit\nCuff my balls, Suck my dick\nNigga I'm the shit, call me Pull-ups\nAnd when the hoes see me, they all pull up\nThey take a flick with me, My pic in her iPhone\nTen seconds later, my dick in her jaw bone\nAnd she say \"Ow, it feels good\"\nShe says \"Brown, you're so hood\"\nSo what's good? Whatcha don't know?\nI like my ho fast that ride dick slow\nBitches online, I call 'em free throws\nShoot it on her like Jordan on Craig Ehlo\nNigga no homo, Nigga I'm him\nRap like Three Stacks mixed with Em, where's Kim?\nProbably in the D just like me\nIf you fight like Bruce Lee, I'mma kill you in your sleep\nCause I'm your favorite rapper, favorite rapper, favorite rapper\nYou're fake candy bars get tossed like the wrapper\nHo no kiddin' , Bitch are you trickin' ?\nBrown a slim thug, but I'm not still tippin'", "year": null}], "artist": "Danny Brown"}