{"artist": "G-Dep", "songs": [{"title": "Keep it Gangsta", "album": "Child of the Ghetto", "year": null, "image": "https://images.genius.com/bddcce4afa23dd703cfaf4bd2ea9dfe7.300x300x1.jpg", "lyrics": "[Verse 1: G. Dep]\nI got enough flows to spit, the coldest shit\nGive you what you supposed to get, to close ya lip\nI got enough O's to get, and hoes to hit\nTry to stick ya nose in shit, get froze and stiff\nTalkin' 'bout load ya clip, and O's you flip\nWhen you ain't holdin shit but droze and dick\nRoll the spliff, take the toke\nYou either gettin cake or broke, you can stay awake or croak\nTake a note, take a vote\nBy a landslide, tell ya man slide or I'll shake ya boat\nTake ya toast, this rap shit I make the oath\nTo get cake or estates by the lake or boat\nBad hoes, insatiable\nSee the snake, eat steak, leave faith they hate to go\nYo, its to late to blow\nYa run around pay for hoes, that's why ya paper low\n\n[Hook: Shyne]\nWe them niggas with big guns and big dicks\nFlood ya block, and keep it gangsta\nWe them niggas with big guns and big dicks\nCoke them rocks, and keep it gangsta\nWe them niggas with big guns and big dicks\nDrop the top, and keep it gangsta\nWe them niggas with big guns and big dicks\nWylin, stylin, keep it gangsta\n\n[Verse 2: Shyne]\nShyne Po, I keep it gully like im supposed too\nIn a hard top something frontin\nI must of fired, died, came back as a rapper\nScarface, smith and eights, in my life after\nBone crushers on my hip, cause shit get thick\nIn the mist of killas tryin to get rich\nI'm two shells from hell tell 'em I'm made for this life\nDistrict attorney, tryin' to indict\nBut I don't give a fuck, cause I'mma do me\nTill them hollow points, rip through me\nI was born to die, live for what?\nPlush slut, bucks, guns and dust\nSpent late nights in the kitchen, wishin'\nWatchin the pot boil, mixin, sniffin\nKeepin America high, and why wouldn't I?\nGangstas don't talk, we beat the case and walk\n\n[Hook: Shyne]\nWe them niggas with big guns and big dicks\nFlood ya block, and keep it gangsta\nWe them niggas with big guns and big dicks\nCoke them rocks, and keep it gangsta\nWe them niggas with big guns and big dicks\nDrop the top, and keep it gangsta\nWe them niggas with big guns and big dicks\nWylin, stylin, keep it gangsta\n\n[Verse 3: G. Dep]\nYo, I got wild fed to earn, lead to burn\nSlot time, dead ya turn\nLotta cats gotta wait til they dead to learn\nPastor Rev. Sermen, ya learnin'\nI'mma wild card to play, guard ya pay\nGoodbye's hard to say, cause ya moms to pray\nYa lookin odd and gay, I'm modern day\nI'mma rep till im hard and gray, pardon me\nI'mma make it hard today, bombs away\nLaunch grenades, at your entourage and blaze\nCalm ya rage, I ain't even on ya page\nYa see-thru like lingerie, guns in a large array\nHit the door, kick the raw, spit that law, then spits some more\nEverybody hit the floor, I'm quick to draw\nFlows like hittin bitches raw, to sick to cure\n\n[Hook: Shyne]\nWe them niggas with big guns and big dicks\nFlood ya block, and keep it gangsta\nWe them niggas with big guns and big dicks\nCoke them rocks, and keep it gangsta\nWe them niggas with big guns and big dicks\nDrop the top, and keep it gangsta\nWe them niggas with big guns and big dicks\nWylin, stylin, keep it gangsta"}]}