{"artist": "A$AP Ferg", "songs": [{"title": "4:02", "image": "https://images.genius.com/6a2f58fb40c2a44463c586658c8fc9ae.1000x1000x1.jpg", "album": "Trap Lord", "lyrics": "[Intro]\nDamn who knocking on the fucking door like that? Shit. I think that's our little friend. Hold on man, let me get that. Damn. Took forever, step on in, let me holla, yeah. Put your coat right there. Little mama say what's up to my baby, get acquainted. Here's your new best friend. Damn, lay down right there. Chocolate and caramel, best of both worlds. She got nice lips. She got a body on her right there. That's why I chose you, baby, touch me right there\n– Right there? You like that?\n– Oh shit. Now mama, let's see what mama taste like. Tell me what she taste like. Damn\n\n[Verse]\nSipping on that Henny got me going crazy with two ladies\nLooking so good, don't you want to be my baby\nYou lay it down, don't play around, don't make a sound\nLet me see that ass bounce, yeah\nAnd I want you to kiss her, and I want you to kiss her back\nOoh, girl, just move girl, and I want you to move it just like that\nDamn baby, you movin' it so good\nI like the way you talk, I like the way you move\nI like the way you scream, I like the way you do what you do\nThe way you talk to me, the way you talk\nThe way you talk to me, the way you talk\n\n[Outro]\n– Hello\n– Bitch, where you at?\n– Minding my mothafuckin' business\n– Where your broke ass at?\n– Fuck does it sound like you crying? Is that bitch nigga 'bout it?\n– Bitch, you better not be with that nigga Ferg\n– Shut the fuck up! Nigga, stop crying like a little bitch!\n– Come to the streets, nigga\n– Fuck outta here, that's why you fucking crying like a lit-... I'm fucking you bitch, nigga\n– Please, don't leave me\n– I fucking your bitch nigga, yeah\n– Please, don't leave me, please, I need you\n– I'm fucking you bitch. And she with my bitch. I'm fucking both of them bitches\n– Hello? Hello?\n– Fuck you, bitch!", "year": "2013-08-20"}]}