{"songs": [{"year": null, "title": "Locksmith", "image": "https://images.genius.com/c91c4b7e3aa8a9503855d1070f1f85cd.640x640x1.jpg", "lyrics": "[Male & Female Computer voices] [x2]\nI. Feel. A. Little. Apprehensive. Talking to\nYou you. About. My. Life. With. My. Own. Voice\n\nAlthough. I. Think. People. Will. Relate. And. Understand\n\n[Verse One]\nDade County\nMiami\n1976\nA baby boy, livin' in a hotel with his parents\nMommy was a maid there\nDon't really know what pops did but\nHe was trainin' to be a locksmith\nWe moved up the coast\nBack to where the grandparents lived\nPerhaps for cash\nI didn't think to ask as a kid\nAnd I don't where pops went, but things seemed stable\nEven when he left his keys on the table\nMy single mom\nShe was able to make it without relationships\nEvery so often, pops would show up and babysit\nIt never made me think about his day job a lot\nUntil the day when my mom's changed the locks\nIn those days\nWhen he watched me, when I think back, in some ways\nMade up of coffee, six packs and gun play\nPornography and projects, step siblings and half relatives\nBut havin' kids is bad for business\nGirlfriends were the rage then\nBabies in the playpen\nToddlers were forgotten in front of television stations\nIt wasn't just one way to say things\nBetween the two households\nI out rode all types of combinations\nBreakin' these codes and peekin' through key holes\nFinger on the pulse, stethoscopes broke the needle\nPut my ear to the ground, you hear the pins drop\nGears in the clock\nTurned like my stomach turned like the dial on a padlock\nRhode Island was the backdrop\nThe world was the oyster\nCrack the shell, hand the pearl over to the lawyer\nIn family court I make judgments\nI'm a product of my father's trade and my mother's substance\n\n[Male & Female Computer voices] [x2]\nI. Feel. A. Little. Apprehensive. Talking to\nYou you. About. My. Life. With. My. Own. Voice\n\nAlthough. I. Think. People. Will. Relate. And. Understand\n\n[Outro]\nThat kid weighs twelve pounds WITH my dick in his mouth", "album": "Still Sickly Business"}], "artist": "Sage Francis"}