{"songs": [{"year": "2016-01-13", "title": "GPS", "image": "https://images.genius.com/fd18d90f88a239743c1ad2caf0ed2a60.496x497x1.png", "lyrics": "[Intro: Saba]\nOh, oh, oh\nOh oh oh\nOh, oh\nOh\n\n[Chorus: BJRKNC & Chandlar]\nWhere's your head?\nWhere's your soul? Your heart?\nWhere's your love? Your care?\nWhere's your life? Your scars?\nYou're lost\n\n[Verse 1: Saba]\nAh, ah, ah, look\nEarth can be so lonely, glad we're all in heaven\nBet he can count a dollar, couldn't count a blessing\nAyy, where's your head? You neck-less for a fuckin' necklace\n(Fuckin' necklace)\nOoh, put that shit on record, bet they get the message\nJust like after the beep, wear my rap on my sleeve\nWear my heart on my tongue\nWhere you think that I speak from its blood on my teeth\nLike a opp nigga, we opposed\nI'm at the crib playin' neo-soul\nDropped out, I don't need a loan\nThat same school bookin' me a show\nDroppin' college collect like an audit\nI'm a artist problem, what you call it?\nI'm an honest artist so they honor\nOr we fightin' fans like Ron Artest\nI'm the coldest out, I'm so arctic\nAnd I'm from the same place the solids come from\nAnd I run shit like Sonic\nWith my songs and all of my sonnets signin'\n\n[Chorus: BJRKNC & Chandlar]\nWhere's your head?\nWhere's your soul? Your heart?\nWhere's your love? Your care?\nWhere's your life? Your scars?\nYou're lost\n\n[Verse 2: Saba]\nOoh, ooh\nFood can make you forget that the world is famished\nThey on me like the new kid, this my college campus, ooh\nAll these women want me like my name was Channing\nTatum, I don't even take 'em, y'all can all still have 'em\nLike I got my own, greed kill man, man still'll want more\nNiggas spoon fed, talkin' bout they poor\nNiggas be broke talkin' like they on, on\nI don't really care what oppers say though\nThey change they self for compensation\nLast year I just had to lay low\nNow pass the torch like hot potato, aheh\n'Cause I'm on it, take the green line out west to Austin\nDropped the best project since The Chronic\nLike a nerd freshman how I'm locked in\nI been, aheh, off that, dub, a nigga then I don't rematch\nGrind mode, nigga I don't relax, ayy, go ‘head, play this back\nSab\n\n[Chorus: BJRKNC & Chandlar]\nWhere's your head?\nWhere's your soul? Your heart?\nWhere's your love? Your care?\nWhere's your life? Your scars?\nYou're lost\nWhere's your head?\nWhere's your soul? Your heart?\nWhere's your love? Your care?\nWhere's your life? Your scars?\nYou're lost\n\n[Verse 3: Twista]\nI tell 'em\n\"Pop that trunk, 'cause sound deaf\"\nGot kush and I smoke that blunt 'cause I'm blessed (Woo)\nFlow with the funk then I'm fresh\nAnd I got that 'cause I come from out west\nI was raised around thugs and ballers\nSomethin' was happenin' whenever I come through\nHangin' with the gang or with the crew\nAnxious just to show what I could do\nAnd though the gas will spark, when it got real dark\nWe were gon' take it to Garfield park\nTo the holy city, yeah K-Town\nAnd go downtown so I can show 'em that I'm real sharp\nAin't nobody fuckin' with us\nCircumstances hurt your chances when you see how we comin'\nOn my mama, Saba when he got the OG on me\nHomie, no wait, we don't want nothin'\nBreakin atoms if we causin' destruction\nMakin' patterns if we causin' eruptions\nSecond thoughts if you see us in the functions\nSmokin 'weed if you see us into somethin'\nDo ya thang and make ya money, stack ya paper\nGo ahead, represent ya crew\nAs long as you respect the west side of Chi'\nDo what the fuck you wanna do\nTwista\n\n[Chorus: BJRKNC & Chandlar]\nWhere's your head?\nWhere's your soul? Your heart?\nWhere's your love? Your care?\nWhere's your life? Your scars?\nYou're lost\n\n[Skit: FRSH Waters]\nComin' from one of them avenue babies, hailin' from the west side, nigga tryna make it to the Grammy's, at least somewhere. Somewhere more than where a mothafucka been. Bucket list means something like, ya know you ever set up and dream and dreamed a dream and that dream done came true? Ha ha ha ha ha...chuuuuuuch", "album": "Bucket List Project"}], "artist": "Saba"}