{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Intro]\nPE number 1, still public enemy\nThe revolution will be televised\n\n[Verse 1]\nPardon me as I vent\nI do this for the babies that's bathin' out in Flint\nThe signs of the times got me spent\nI'm thinkin' bout the crimes on Price\nThe recent chain of events\nA plot that's designed by lynch\nMartial Arts on defence\nBlue blood spills as the black's still clenched\nBlack deaths get paraded in the news\nWhite sheets get traded in for blues\nThe poor and righteous are gunned down by polices\nThey terrorize, they should terrorize the foreign ISIS\n100 shot drum filled with K Rounds\nHunting down the crack of the gun on trinidad\nIt seems they only respect violence\n10 hit, 3 down out in Dallas\nYea, respect my color\nIt's like, fuck the police\nDo you respect my brother?\nI mean, fuck Paula Deen\nDo you inspect my mother?\nThis shit never gon' seize till you respect my suffer\nThe hour is here\nLet the casket in, are you scared?\nFight the power, I declare\nA war on the new world order, with no fear\nFor the babies they bombed out in Birmingham\nThey gunned down Mike Brown in Ferguson\nSent 41 shots through the eye lobe\nTell me, which 48 laws do you follow?\nDo you never try to outshine the master?\nOr, strike the sheppard in the sheep of scatter?\nOr, turn the other cheek, march, sail or speech\nThey're pluggin' us off about a week\nMore important\nWho's payin' for the coffin they brought Alton?\nOr them kids the pigs just orphaned\nThe revolution shall be televised\nEven tho' the television stay tellin' lies\n\n[Sample Speech]\n...That we who have been the victim of so much violence\nNow whites fear violence from us\nWe do not have a history of killing white people\nWhite people has a history of killing blacks...\n\n[Verse 2]\nYea, a hundred miles runnin', where my raiders at?\nCrack babies, a product of the Reagan act\nWelfare, section 8, yea, they gave us that\nProject housing and an enslavemant trap\nIt's plain to see, you can't change me\nCause I'ma be a nigga for life\nIt's plain to see, it's fuck the police\nSo I'ma pull my trigger on sight\nIt's time to raise hell for Castile\nSend 'em 50 shells for Sean Bell\nThey hung poor [?] in a jail cell\n[?] cash bell\n\"Black lives matter, \" is what they told us\nBut black lives don't matter, is what they showed us\nThey still call us niggers\nGot a 100 in this clip, bitch, huntin' down a Zimmerman\n\n[Sample Speech]\n... That you are afraid\nThat we if we ever come to power\nWe will do to you and your father\nWhat you and your people have done to us\n\n[Sample Video: Diamond Reynolds]\nThe police officer stopped us for a busted tail light that was not busted\nThey pulled us over on the side of the road, asked for lisence and registration\nAs he was reaching for his license and registration, he told the officer that he was licensed to carry and had a firearm\nAs he got back, comfortable\nThe police took four or five shots into him for no reason\nThey took his life for no reason\nThey did this to my daughter and they did it to me\nAnd I want justice", "image": "https://images.genius.com/c6ca755b5189878f5880a9cb45778456.500x500x1.jpg", "year": "2016-07-19", "title": "#StillPublicEnemy", "album": null}]}