{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/c347081c7afabbcba96aea0847886344.758x738x1.jpg", "title": "Foul Cats", "year": "1998-10-20", "album": "Roots of Evil", "lyrics": "Intro/Outro: repeat 2X\n\nFoul cats schemin up the setup\nTryin to leave me and my team wet up\nTwo in the head, leaded up\nCall the coroners to make they bed up\nInfrared shit from neck up\nBefore they got to lift the tec up\n\n[Kool G Rap]\nIt was a setup, my nigga got hit, they blew his chest up\nThe hollow tips ripped his vest up, son is messed up\nAnd blessed up; call my cast up -- it's time to dress up\nFour-fifth and Smith-n-Wessed up, ready to press up\nAnd fuck their nest up, the enemy is Hennessey to sessed up\nActin up, hit my motherfuckin man up\nNever again will he stand up, yo Big Jan hook the plan up\nPull the masks, pull the van up\nThese niggas tryin to hit the fam up; these small times cats\nYo fuck that, I can't see that, where them niggas be at?\nWhere they hang at? Where they live at? Where they slang at?\n(Aiyyo Son one is a known cat, he walk around with the chrome gat\nThis hoodrat know where the nigga home at)\nWell here's a quarter baby, go and phone that\nThis motherfucker bout to get his shit blown back\nHis whole dome clapped, we cock back the gats and started cruisin\nUp the boulevards and avenues-n, I'm short fusin\nAnd two biscuit usin; mad hot but, not in the mood for losin\nWe hit the strip pickin up clues and\nWe on the heels of this nigga shoes and\nOut the blue when, we see the chick the nigga screwin\nPushin his whip with the ice cuban\nHemmed her up sweet, put heat to her wig piece, the Sig piece\nTo this nig's beefs, this bitch named Charise\nFrom East New York, listen bitch, you better talk\nOr get your whole frame surrounded, with white chalk\nPulled her out the back of the van, bitch we don't want you\nWe want your man, you understand?\nThe ho said, \"Please, I got his house keys, the nigga got\nFive kis and mad cheese, a hundred G's\"\nLie to me bitch you gettin one of these\nFour-five C's in both knees, she said, \"Honestly I promise G\nI'm not lying,\" then the ho started crying\nWe hit the road me and my niggas flying\nTo the crib in Jackson Heights, the nigga live three flights up\nHe type buck, but I ain't givin a fuck\nGrab his bitch up, make the ho go first in case\nThe nigga buck, open the door up, and put the stunt in front\nThen we all started creepin, he stretched out\nUp on the sofa sleepin, yeah me and my cats standin there\nJust peepin, money's about to get laced\nMy nigga Ty threw a glass of whiskey in his face\nBig Jan ready to blaze the place; he on his way\nTo Amazing Grace -- nigga woke up and saw the big guns\nMe and my two sons, he knew he was done\nYou hurt a loved one, step back about to let him have one\nYo fuck that, aiyyo black, where the sack of heroin at?\nI'm bout to give cat some motherfuckin railroad tracks\nWe dumped the whole bag inside a spoon and left the room\nTo heat that, and came right back, yo grab the nigga arm black\nPut raw shit in the nigga vein, watch the needle drain\nWent from being restrained to mad tame\nLess than a moment nigga started zonin\nHis mouth foamin, lookin like he posessed by The Omen\nHis bitch was reachin for the phone and, I had to smack her\nWith the chrome and, left her on the floor moanin\nCocked back, I had to finish this, know my stee'\nWe leave no witnesses, shot and got the fuck out the premises\n\nOutro"}]}