{"songs": [{"image": "https://images.genius.com/b256017f3b831150266cf5131d761bfe.600x599x1.jpg", "title": "Dilly Dally", "album": "Playtime is Over", "year": "2007-07-05", "lyrics": "[Intro]\nOkay. Okay. Nicki Minaj. Dirty Money. I don't think ya'll understand what I'm about to do, I'm 'bout to master these bitches, man. Chea! Chin checker\n\n[Verse 1]\nI used to dilly dally, now I dilly to Cali\nUsed to push a pink Denali, now it's Chevy Impalis\nI used to be broker than them niggas in alleys\nNow I get my work it out like Biggity-Bally\nI used to go hard, used to cock the brim\nUsed to take the dollar car, used to shop at Vim\nNow I take it real easy, the hood believe me\nI don't mean Cover Girl when I say \"easy breezy.\"\nJiminy Cricket, let the master in\nWhen it come to bad bitches, I'm the last of kin\nI'm bringing S-E-X-Y B-A-C-K\nIf Nicki ain't the best, suck a D-I-C-K\nI'm Young Nicholas, my style ridiculous\nI heard your money funny, and mommy, I'm ticklish\nI gotta laugh. I gotta laugh at it\nI always got crack, I guess I'm a crack addict\n\n[Interlude]\nI don't know man. I think these bitches is real scared right now, like. Damn. I got these bitches shaking in they boots, man. Dirty money. Ayo, Pre'. Bring the next verse in, my nigga. Chea! Chea! Chea! One time\n\n[Verse 2]\nI used to make a dollar stretch like a Pilate\nNow I gotta play the potty in Giuseppe Zanotti\nGotta push the Maserati, candy paint on the body\nMaking money off the hobby, taking flicks in the lobby\nLook, I'm in the future, I'm ahead of my time\nAnd you can't duplicate it, I'm a one-of-a-kind\nThey think I'm making fun of them, when I be like: \"Na-Na-Na-Na!\"\nThat's the track, little mama. Look: \"Na-Na-Na-Na!\"\nDo what I do it, like I do it for the T.V\nBitches must be blind, cause these bitches can't see me\nDo it all for GP, tell 'em to suck a pee-pee\nMonday, LA, Tuesday, I'm in DC\nGet a ticket, or you only get a snippet\nIf you write your lyrics,  little mama, I can dig it\nI show you how to do it, what I do is really magic\nAbracadab' tricks are for kids, silly rabbit\n\n[Outro]\nYes sir. If I ain't the one, who is, nigga? I mean damn, I don't mean to toot my own goddamn horn, but toot-toot, nigga! Fuck! I'm that bitch. Nicki Minaj. Dirty Money. Yes sir. Uh-huh. Uh-huh"}], "artist": "Nicki Minaj"}