{"songs": [{"lyrics": "[Produced by The Alchemist]\n\n[Intro: Action Bronson]\nYo pass me the ball fool\nYou better fuckin' pick me, ya\nStraight the fuck up, I roof this shit\nFuckin' 360 on this pussy\nI don't give a fuck\nI'll kick this motherfucking ball over the fence\nNo shoes on\n\n[Verse 1 : Action Bronson]\nI know you see me on the TV, lookin' like a hunk of beef\nWhen I smile your baby mama shit her dungarees\nSomebody get the kid a deal he sound like me\nBut nah, dunny don't get down like me\nThe falcon flies back to the glove when I whistle\nDon't try to put me in the box like a tissue\nCause I push you in the box with a pink suit\nFuck around and have some squid ink soup, bitch\n(Ah man there's so much fuckin' hash in this joint right now son)\nUh, you ain't a legend like Yanni\nI'm so Queens like a Roy Wilkins T-shirt\nWith one arm shredded, and one arm missing\nDog, I was born with Allah's vision\nI learned quick I couldn't follow suit\nCause the Devil put the pork inside the dollar soup\nNow I'm sittin' in first class with a hard dick\nListenin' to German guitar riffs, what a life\nI was made like the beginning of Jurassic Park\nWhen they took the fucking blood from the mosquito with a dope needle\nThen they shot it in a wild lion, 1983\nI popped out holdin' an iron with a visor on\nYeah, uh huh\nYo, the videos are like a Jewish summer camp promo\nYour ideas lack Adobo\n\n[Verse 2 : Meyhem Lauren]\nYo, silk cinder blocks, cinnamon socks\nOn the low like a whip without shocks\nI bag bitches in flocks\nRepresentative for everything official\nYa'll niggas can't live, so it's officially an issue\nWaterproof penmanship, padded on a rugby\nHammer in the hamper 'case a nigga try to thug me\nI'm a idol, my wave is tidal, forget survival\nTreat the last record I broke just like a rival\nUh, I'm New York before it turned into a bike lane\nNever had a light fame, split the pipe cane\nIt was written but I wrote it\nPut religion right on my neck and then I froze it\nLaurenovitch, yeah\n\n[Outro: Big Body Bes]\n3:36 in the morning\nLocation: a drug infested area, Brooklyn, New York\nWhat am I doing? Standing on an unidentified corner\nWith a Latin individual, corn rows, foamposites;\nAll sorts of a felony in his waist\nBut who are you? She only loves me when I'm naked", "title": "Falconry", "album": "Mr. Wonderful", "image": "https://images.genius.com/3f40c65495de257e6acc2dabe3749b6b.800x800x1.jpg", "year": "2015-03-23"}], "artist": "Action Bronson"}