{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/9ea81135585d80ab8813a2b9becbd61d.1000x1000x1.jpg", "title": "Hey Mister Mister", "year": null, "album": "The Veteran", "lyrics": "[Kool G. Rap]\nLast week I beat my bitch up in the street for lyin to me\nShe thought she caught a cutie but didn't know the nigga knew me\nHe said he had but one or two affairs with the booga bear\nAll a nigga could do was try to act like he don't fuckin care\nI was about to drop the hammer on this nigga\nTill grip pulled out his wallet and he had my bitch's pictures\nThat undercover lover bullshit was now discovered\nCan't wait to see this bitch cause I'mma beat her ass in public\nI went to her sister's house, drove by her momma's\nI even stepped to poppa duke's house to bring the drama\nLookin up the block, yeah hold up, yeah there goes that bitch\nFrom a mile away yo I could tell my bitch is switched\nSo I ran up on her, hey wassup bitch I got a question\nIf you lie, this Smith and Wesson gonna teach ya ass a lesson\nYou ever fucked around on me before? \"Hell no!\" *smack*\n\"Yo what you hit me with that gun for?\"\nBitch why you lyin, bitch you've been cheatin\nNow I gotsa to give your motherfuckin ass a beatin\nI punched her in the ribcage and kicked her in the stomach\nTake off all my motherfuckin jewellery, bitch runnin\nI stomped her and I kicked her and I punched her in the face\nSome people crowded around but nobody got out of place\nDon't want heroics, \"Hey buddy\" - aiyyo money don't get in this\n\"Hey miss you alright?\" - motherfucker mind your business!\nI'm bashin her with the nine, inches away from pullin the trigger\nBut a nigga got to hit her till I see her face get bigger\nI'm sick of all the bullshit, tired of all the nonsense\nSo I pistol whipped the bitch till her ass fell out of conscious\nNow she's all bloodied up, layin in that red shit\nBitch press charges, I guarantee you she's a dead bitch\nThe first time you play me is your last\nSo yo don't interrupt me when I'm whoopin on my bitch ass\n\n[Chorus]\n\"Hey mister mister, what the fuck you doin?\"\n\"Hey mister mister\" - keep walking past!\n\"Hey mister mister, what the fuck you doin?\"\nDon't interrupt me when I'm whoopin on my bitch ass!\n\n[Kool G. Rap]\nI'm baggin up mad shit, puttin it on the street\nI never snorted but I find myself shorted every weekend\nShit is disappearin and I'm lookin for the logic\nOf why my shit gets lower every time I count the profit\nIt never fails again, these bitches drawers they go back up\nOne hundred here, two hundred here, but all that shit adds up\nSo I'm layin for the traitor\nSo I can put foot in they ass cause I'm a motherfucking bitch hater!\nSo I'm peepin out the spot for a week\nIf I catch one of these bitches stashin bread she'll be dead meat\nI took one to the bath and tried to knock it\nFeelin on her ass, hey yo bitch what's this in your pocket?\nAha finally caught your ass!\nThe bitch had my cash, I rolled up inside her stash\nShe started coppin a plea but I ain't really tryin to hear her\nI snatched her by her hand, bashed her face up in the mirror\nI threw her right on the ground and then her skirt revealed her panties\nNow a nigga's ready to shove his dick up in her fanny\nI hit the bitch like one more time and then I just said fuck it\nPulled my zipper down, whipped out my dick and made her suck it\nI'm rammin my dick inside of her mouth and tryin to make her choke\nThen I grabbed the back of her head and shot come down her throat\nI beat her and I dissed the bitch for tryin to steal my cash\nSo yo don't interrupt me when I'm whoopin on my bitch ass\n\n[Chorus 2X]"}]}