{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/101ec9acebacbc3b7d2c51ebd7abe4b6.960x960x1.jpg", "title": "Lowrider (on the boulevard)", "year": null, "album": null, "lyrics": "Yeah\nCome on\nTake a little trip with the Frost\nWe about to go lowridin\n(A lowrider)\n\n[ VERSE 1: Kid Frost ]\nOh yeah, another night on the boulevard\nCruisin hard, and everybody's lowridin\nTake a little trip with the Frost\nAnd you know what, man?\nEverything is gonna be alright\nYeah, bumper to bumper's all eyes on me\nRollin a Chico G '63\nConvertable rag-top, and the rag-top's down\nOn the killer Daytons with the big boom sound\nLift it front to back, pancake from the bottom up\nAnd when we rollin on 3-0, vato, what's up?\nHere comes the homeboys cruisin down the loma\nHittin the switches in a 39 bomba\nHa-ha-ha\n(Take a little trip)\n(Take a little trip)\n(Take a little trip and see) -- War\nYeah, lowridin\nAll my homies roll lowriders\nHey\nA lowrider is a little flier\nHey\nAiyo ALT, man\nWhat you doin on the boulevard, loco?\n\n[ VERSE 2: ALT ]\nCruisin, the bass escapes from the window\nI'm rollin real slow and low, it's Sunday, I gotta go\nYo, you can hear the bass of the rap jams' old breaks\nA fly-ass Impalla thump, paint got the gold flakes\nKickin back, and yo, I'm soarin like an eagle\nFrost in a jeep, and Ralph M's in a Regal\nWe're lookin at the fine ladies bumpin the fresh tapes\nSeein the sparks from my car when the frame scrapes\nGirls from blocks and blocks, they come in flocks and flocks\nReady to box, cause my '64 rocks\nWe call it a caravan, and yes y'all, we're rollin hard\nA single file line - on the boulevard\n(Take a little trip)\n(Take a little trip)\n(Take a little trip and see) -- War\nAll my homies roll lowriders\nHey\nA lowrider is a little flier\nHey\nAiyo Mellow, man\nWhat's that you're bumpin in your ride, man?\nWhat's that you're bumpin in your ride, homes?\n(Ain't got... baby)\n\n[ VERSE 3: Mellow Man Ace ]\nI been chasin hotties as a hobby\nMellow's on the bully and I'm out here gettin irie\nOh baby, that's the things that I be doin\nI think I like to do it more than I like screwin\nSo get me in your car, honey, I wanna cruise it\nI got a jimmy hat in my pocket, I wanna use it\nSo take me through the canyon of love, I wanna getcha\nYo baby, it don't matter if I just metcha\nJust say yeah, cause you got the Jim hard\nBut that's the price I pay for bein on the boulevard\nHoneys out here teasin, some be out here pleasin\nBut some just rub the Jimbrowski for easin\nOn the boulevard\nYeah\nUp on the boulevard\nYou knoww what I'm sayin\nWhen you're out there cruisin\nGirlies wanna be usin\nJimbrowkisssssss....\nAll my homies roll lowriders\nA lowrider is a little flier\nAnd you know it's fly, ha-ha-ha"}]}