{"artist": "Fat Joe", "songs": [{"year": "2005-05-29", "album": "All or Nothing", "image": "https://images.genius.com/b0550eb8427250a0ecee59eba9acbb5c.1000x1000x1.jpg", "lyrics": "[Fat Joe]\nCrack! Yeah, Scott Storch y'all\nDirty, Crack! C'mon\n\n[Hook 1: Nelly]\nIt's two up in the mornin girl, and the DJ playin that song\nNow what'chu gon' do? (I'mma get get get it poppin)\nNow what'chu gon' do? (I'mma get get get it poppin)\nI said it's two up in the mornin girl, and the DJ playin that song\nNow what'chu gon' do? (I'mma get get get it poppin)\nNow what'chu gon' do? (I'mma get get get it poppin)\n\n[Verse 1: Fat Joe]\nI got that plat no-limit American Express card\nMami you can get whatever you like\nPlus I got that all-black Phantom it's tinted on four sides\nGo 'head kiss it, they can't see us inside\nMami tell me do you like - it, I know you like - it\nIt's written all over your face don't fight - it\nYou like - it, more than I like - it\nSo put it all over your face don't bite - it\nFrom rags to riches, club packed with bitches\nHad to bag them digits, her head game was vicious (muah)\nAnd we can get it poppin' in the bathroom\nDon't be selfish ma, go ahead and pass it to him\nThen we can all fuck\nIt's like a million on my neck, got all of these bitches awestruck\nAowww! We pissy drunk off of Seraphin\nI'm up in V.I.P. and these bitches are screamin \"Let me in\"\n\n[Nelly]\nUh, uh, uh, uh\n\n[Hook 2: Nelly]\nIt's two up in the mornin girl, and the DJ playin that song\nNow what'chu gon' do? (I'mma get get get it poppin)\nNow what'chu gon' do? (I'mma get get get it poppin)\nIt's two up in the mornin now, and I'm tryin to go home wit'chu\nNow what'chu gon' do? (I'mma get get get it poppin)\nNow what'chu gon' do? (I'mma get get get it poppin)\n\n[Verse 2: Fat Joe]\nHa ha, yeah, uhh, yo, uh\nGet it poppin, go 'head and drop it\nIt's written all over your face, don't stop it\nJust drop it, more like it's hot, miss\nKick in the do' with the fo-fo messin' with Joe\nNow this chick got an ass so fat in fact I\nPut a drink on it and I came right back\nShe would never talk to a lame like that\nIn my ear screamin how you got a name like Crack\nCrack - similar to Mike Jones\nHear my name enough, then I'm takin you home\nAowwwwww! You know I walk with I talk with\nI sleep with the chrome, one squeeze and you're gone\nWhat I look like, not takin at least\nThree to six women out the club with me\nNow we back to the fuck pad, call it the fuck pad\nCause all these bitches fuckin with me, talk to 'em dirty\n\n[Nelly]\nUh, uh, uh, uh\n\n[Hook 3: Nelly, Fat Joe]\nIt's two up in the mornin girl, and the DJ playin that song\nNow what'chu gon' do? (I'mma get get get it poppin)\nNow what'chu gon' do? (I'mma get get get it poppin)\nWell it's two up in the mornin and, them niggas try'n hate on your crew\nNigga what'chu gon' do? (I'mma get get get it poppin)\nYeah what'chu gon' do? (I'mma get get get it poppin)\n\n[Verse 3: Fat Joe]\nNow when them doors swing open with that awkward motion\nWhat'chu call it - suicide, it's a suicide\nAnd if them niggas talk shit cause they drunk off that potion\nThey commitin - suicide, it's a suicide\nLet's get it poppin my niggas (Cook, yo)\nI got a shotty my niggas (oh, Lord)\nI feel sorry for your mudda, give a fuck what you say\nSpin your head back, promote you on a videotape\n\n[Hook 4: Nelly]\nIt's two up in the mornin girl, and the DJ playin that song\nNow what'chu gon' do? (I'mma get get get it poppin)\nNow what'chu gon' do? (I'mma get get get it poppin)\nIt's four up in the mornin now, and I'm tryin to go home wit'chu\nGirl what'chu gon' do? (I'mma get get get it poppin)\nWhat'chu gon' do? (I'mma get get get it poppin)\nC'mon\n\n[Fat Joe]\nYeah, it's Crack! (What'chu gon' do)\nCafe {?}, all my people in there partyin\nAll the party people across the world\nLadies, \"Things of that Nature\"\nAowwww!", "title": "Get It Poppin’"}]}