{"songs": [{"title": "It Ain’t Easy", "image": "https://images.genius.com/0d6839530413c8ca4d5d4da399f117ee.640x640x1.jpg", "lyrics": "[Intro]\nI did it again, huh? Yeah I know\nI'm writing you a song though\nIt goes something like this...\n\n[Verse 1]\nYou said one love, you can't unlove\nI don't know what it is you're trying to run from\nLike you just, you tryna unfriend me in real life?\nI want it all real, nothing fake please\nI don't want to wonder what your handshake means\nI don't need to say everything I think I must\nMy ego's trying to ruin everything I touch\nWhat I mean though or what my point is\nThat you're much more important than my point is\nIf I win an argument and lose your heart Lord\nHit the bullseye on the wrong dart board\nWant to thank everyone for being patient with me\nIt's a journey that I'm on, I pray you take it with me\nAnd to quote myself that's what this is about\n\"We live learn and figure it out\"\nOh my God now...\n\n[Hook]\nIt ain't easy when it's real\nJust don't leave because I still need your patience\nAnd hear me when I say this\nIt ain't easy when it's real\nIn my heart you know I feel\nAll your greatness and baby we can make it\n\n[Verse 2]\nI want the real love, not the false kind\nNot the one that need perfectness at all times\nWhen it seems most difficult to keep me close\nIs probably the time that I need you most\nI let you down though, I didn't mean to\nEven the people who try, we get weak too\nAnd when you said we were family, I believed you\nBecause I needed so bad for it to be true\nNow is my heart that way? Would I try to betray?\nIs there any such thing as an honest mistake?\nIf what you need and what I have don't match\nThat's when we need the love thing to fill those gaps up\n\n[Hook]\nIt ain't easy when it's real\nJust don't leave because I still need your patience\nAnd hear me when I say this\nIt ain't easy when it's real\nIn my heart you know I feel\nAll your greatness and baby we can make it\n\n[Verse 3]\n(You tryna save the world, right?)\nYo I'm a hot mess and if I'm honest\nIt's not just one event but a process\nIf I'm tryna get out here and protest\nLet me first save the world from my foolishness\nLet me guard my heart from it's harshness\nTry to rid my truth of it's falseness\nIf your beauty is closer than an arms length\nYou'd be hard pressed to tell me that it's far fetched\nI know I hurt you though, you took it personal\nBut what's love if the essence isn't merciful?\nAnd I see no need for us to live with regrets\nI'd rather just forgive and forget\nOh my God now\n\n[Hook]\nIt ain't easy when it's real\nJust don't leave because I still need your patience\nAnd hear me when I say this\nIt ain't easy when it's real\nIn my heart you know I feel\nAll your greatness and baby we can make it\n\n[Outro]\nI was thinking maybe not debate politics in the pool\nNah, just because it's your daughter's birthday party I just.. You  know\nNo, I feel you\nYeah, word up, email me about that\n\nYou said one love, can't unlove\nI don't know what you think you're tryna run from\nYou said one love, can't un-love, tryna run from\nSaid one love love love\nSaid one love love love\nSaid one love love love", "year": "2017-05-05", "album": "All the Beauty in This Whole Life"}], "artist": "Brother Ali"}