{"artist": "Beanie Sigel", "songs": [{"lyrics": "(mixed and scratched sample)\nP-H-I-L-L-Y, North, West, Southwest South side\nP-H-I-L-L-Y, Give it to them bitches and niggas who stay fly\n\n[Verse 1 - Beanie]\nYou know my flavor\nLow linen double s gators\nJeans ripped on purpose\nMoure written in cursive\nTool shirt with the belt to match\nFour pound send shots through your Celtics cap\nYou know me, B. Sigel with that lethal spit\nFuck around and get your people hit\nTek 22 see through clip\nNiggas know who I creep through with\nMajor niggas, you know, Major Figgas\nI roll them corners and drop four birds with four words\nNiggas get the flippin\nBefore niggas get the missin\nI'm known for that duct tape, rope and pistol whippin\nBack door, dope and coke from when boat ship in\nIt ain't no tellin what I do for a trunk of crack\nTold y'all dudes that I'm quick to trunk a cat\nYou know my tools, either the pump or the mac\nCatch me at your kids school playin Uncle Mac\n\n[Verse 2 - Journ]\nYo what you think I couldn't shine on you cause your chain glistenin?\nWhen they said the name Journalist you wasn't listenin\nChange the condition of the Range that you sittin in\nPull out the pistol in, shoot out your Michelins\nLeave you in your boy Rover with a poor odor\nJourn, slim bulldozer with the broad shoulders\nWeek into your tour I'ma call your broad over\nBefore she hit the salon, bustin the whore rollers\nYou tryin to play the fast role\nDawg you an ass hole\nYour chick gave me your cock, cigar and your bath robe\nTest the circle, beat you till your purple\nThen have my man search you from your hat to your workboots\nFam fuck you and the cats that co signed you\nCatch you while you on your Ducotti and clothesline you\nTryin to cop a spot like the one they shot Tony in\nJournalist for Doo Wop, the true Mitronian\n\n[Bridge - Dutch]\nP-H-I-L-L-Y\nWhy should we tell y'all why?\nWhere why and how we ride?\nP-H-I-L-L-Y\n\n[Verse 3 - Gillie]\nA'yo rap cancer, flow sick I flow iller\nMy goal is to move more units than Thriller\nIts G-D-K slash God damn killer\nSlash Gillie Da Kid\nNigga can I live?\nGuns keep, never get rid\nDid a minor bid\nOnly for one week\nA Thug let his gun speak\nReal player, never fall in love with a freak\nMy raps is like crack, I distribute to the street\nO's in the form of flows, China Whyte\nYou say I'm okay, your chick think I'm dynamite\nShe love my flow, she love my clothes\nWhen it come to them, I'm like Snoop \"I don't love them hoes\"\nSee my niggas cop cars, watch flooded with stones\nKnowin that my voice'll probly sell a million alone\nNigga bout robbin Gillie? Un uh, pullin the chrome\nAimin straight at your face then I'm killin you holmes\n\n[Verse 4 - Dutch]\nMF it don't get no realer than that\nSee the jails got my niggas I'm takin em back\nServe em out for any smoker who got taste for the crack\nI'm takin it all, whether its a safe or a pack\nI'm layin you down, whether its a eight or a mac\nSee I love to bust guns, but I hated the sound\nAnd I muzzled em up dawg just to quiet em down\nWhere my West coast niggas at? Shots to the ground\nWhere my East coast niggas at? Safes's and pounds\nI got, pimp in my walk nigga, pimp in my talk\nDawg I bust you niggas first before my players fall\nI'm already called it quits, don't want it in no more\nPut the gun to my head, blaow say fuck it all\nYou can't get no women player, they don't want a war\nYou can't sell no cane dawg, you too damn soft\nMe I sell it all player, from the hard to soft\nYou just a boss player, tryin'a roll with boss\n\n[Bridge]\n\n[Verse 5 - Bump]\nSeems like you don't know how much life is left\nTill I revolve six in your chest\nStart at your vest\nSend you into cardiac arrest\nChokin, weezin\nWhat gave you the idea that Bump wasn't squeezin\nBump ain't packin? Bump ain't holdin?\nBump won't put it in your face leave it swolen?\nDo it for the paper, yeah players hate my hustle\nYoung nigga, chrome 38 I hate to tussle\nSix hundred platinum skates from the muscle\nKeep work on the strip, shit I live to the hustle\nStep my game up to a bird from a bundle\nFootball shit, cook wrong nigga fumble\nBlocks on the shoes, twelve on the wheel\nCris till I spit in the club with the steel\nI hope you niggas thinkin Bump J won't kill\nYou be dead on arrival\nNigga no survival", "image": "https://images.genius.com/ca482029f1aca4d2f2a6dec2d36da526.730x730x1.jpg", "year": null, "title": "Philly’s Finest", "album": null}]}