{"songs": [{"image": "https://images.genius.com/b7bcbd18f4df90fee8a1067f0b2b3a7b.1000x1000x1.jpg", "title": "Lost in the Moment", "album": "Therapy Session", "year": "2016-04-22", "lyrics": "[Intro: Andreas Moss]\nThis may be the last sunset I'll see\nSo I'll take it in, I'll take it in\nThis may be the last air that I'll breathe\nSo I'll breathe it in, I'll breathe it in\n\n[Verse 1: NF]\nI heard that pictures don't change\nJust the people inside of 'em do\nWhoever told you that life would be easy\nI promise that person was lyin' to you\nYou got a problem with followin' through\nThat's why I got a problem with followin' you\nYou keep lookin' at me like this problem is new\nBut we've been here before, what you tryin' to do?\nDon't talk to me like I don't know what you're feeling\n'Cause I was there with you back in the beginning\nQuit looking away when I talk, let me finish\nI'm tryna be honest, you're tryna forget me, ugh\nWhat's wrong with you, hey?\nI know that you got a lot on your plate\nYou keep telling me I should get out of your way\nBut I can't see how you gon' lie to my face\nDon't tell me you're fine\n'Cause I know you're not, so don't even try it\nAnd what we gon' live for in this life full of pain\n'Til we're eighty and one day we'll get up and say we regretted our lives\n'Cause that's where we're going\nAnd do not pretend like you don't even notice\nThe funny thing is that you already know it\nI'm starting to think that you like how it feels to be lost in the moment\n\n[Chorus: Andreas Moss]\nLost, lost in the moment\nLost in the moment, lost in the moment\nAnd get lost, lost in the moment\nLost in the moment, lost in the moment\n\n[Verse 2: NF]\nYeah, they told us that time flies, didn't know what it means\nNow I feel like we're just running around tryna\nCatch it and hoping to cut off its wings\nBut that ain't gon' happen\nJoy, when was the last time we had it?\nI don't remember 'cause all that we do\nIs go backwards, but that's what you get\nWhen you live in the past\nAnd I know we're breathing but we're not alive\nReally, is this the way we wanna die?\n'Til you got everything bottled inside\nIf they only knew what goes on in our minds\nI know what you're thinking so don't try to hide\nWhy do you look at me like you surprised?\nIf you really mean what you write in these lines\nThen why don't you fix it, 'cause I'm getting tired!\nYeah, I can no longer do this\nEver since you fell in love with the music\nSee? You find a way to express what you feel\nBut the moment that you get away from the mic, you don't know what you're doing\nIs it clear to you yet?\nI don't know what's going on in your head\nBut eventually, you'll have to deal with the things\nThat you talk about yeah, but I guess until then, we're lost!\n\n[Chorus: Andreas Moss]\nLost, lost in the moment\nLost in the moment, lost in the moment\nAnd get lost, lost in the moment\nLost in the moment, lost in the moment\n\n[Outro: Andreas Moss]\nYeah, oh, yeah, oh lost\nOh, yeah, oh, no no\nThis may be the last sunset I'll see\nSo I'll take it in, I'll take it in\nThis may be the last air that I'll breathe\nSo I'll breathe it in, I'll breathe it in"}], "artist": "NF"}