{"songs": [{"title": "Dark Corners", "lyrics": "[Verse 1:]\nGangster, The Revolutionary, A Rape Victim, Random Accident\nDrug Addict, A Politician\nWhatever our self, or worldly definition\nWe can’t escape the chariot of transition\nSome characterise it as the judgement of the sinners\nOthers spiritualise it and they say: 'There is no difference.'\nEnergy ain’t created or destroyed it just changes form\nOnce we play the song the sound just travels on\n\n[Chorus:]\nDark Corners\nThe Dark Corners are the place where we look death in the face\nAnd we let it give us chase but it always gets away\nDark corners are the place where we’re running out of luck\nAnd we cannot back it up. Death always catches up\n\n[Verse 2]\nAs the needle plunged into the vein and blood was exchanged\nFor dosing around Afghan something was strange\nThis time the substance he injected was pure\nEverything he had before had been cut never raw\nLike all users he had used to make the pain disappear\nAnd it was the only time in life that his mind had felt clear\nHe had struggled with the sickness ever since fourteen\nWhen he remembered the hand that touched him understood what it means\nAfter even longer struggle he finally got clean and met a girl that made it worth pursuing his dreams\nThey had plans to start a family with a wedding in June\nHe didn’t know he was so conventional but yeah it was true\nSo when the news came about Michelle he just lost it\nRan straight back to the same block where he used to cop it\nHis old connect came up in the world who’d supply a grade much higher\nWent and he hit it straight fire\nHis skinny body went into shock and fell asleep\nHis brains forget to tell the lungs that he needed to breathe\nDark corners. Now he’s in them dark corners\nWhen we hit them dark corners we can’t see\nBut dark corners\n\n[Verse 3]\nA good girl, a normal girl that was everybody’s view and though this annoyed her\nShe couldn’t deny that it was true\nWhatever conventional was she was it\nGrew up with both parents nice house in the Sticks\nThough they had never been rich they certainly did prosper\nParents from Nigeria and both of them doctors\nChurch every Sunday, she had never missed a week ever\nSchool she was top of the class yet they demanded better\nWent straight to Cambridge, studying law\nBut had strange dreams of justice and helping the poor\nMaybe that was part of why she chose him, didn’t know what in her mind\nBut he was clever and kind of a little troubled inside\nHer parents wanted for her a nice Yoruba boy\nSo when they found out he was English they were slightly annoyed\nBut when they found out he was addicted to drugs it was too painful\nSaid they ‘wouldn’t come to the wedding it was totally shameful.’\nMichelle left the house in a storm\nIt was a rainy night she never saw the truck before it ended her life\nHer parents had decided that they would apologise\nBut they never got the chance in the end\nWe live on borrowed time and when them dark corners come\nNo, you cannot run\nNo longer shall your skin bathe in the sun, that’s right. When them dark corners come\nNo, you cannot run. No longer shall your skin bathe in the sun\n\n[Chorus]\nDark Corners\nThe Dark Corners are the place where we look death in the face\nAnd we let it give us chase but it always gets away\nDark corners are the place where we’re running out of luck\nAnd we cannot back it up. Death always catches up\n\nDark Corners are the place where we look death in the face\nAnd we let it give us chase but it always gets away\nDark corners are the place where we’re running out of luck\nAnd we cannot back it up. Death always catches up\n\n[Verse 4:]\nBorn of Old Money, yeah, born into wealth\nBut how well did he play with the cards he was dealt?\nIn his life on this Earth trip\nThe family confessed, even his father was slightly jealous of what he accomplished\nBecame an icon\nProducts became the symbols of the age\nEach time they were released you should have seen all the craze\nSeen as an innovator\nThe great creator but beneath all the shine and the sheen was the slave labour\nAnd of course, there was that war they were funding to keep\nThe minerals flowing from the African Republic when the products they released\nEver came of the scrutiny\nThe scientist that authored the report disappeared\nThus, the message is clear, as power is old\nIt’s blood nourishes soil in which powerful grows\nPower changes reality and this CEO had enough leverage that the media only painted him as gold\nBut despite all the wealth and the things that he owned\nOn his deathbed he couldn’t find comfort for his soul\nAll he could see is images of death [?]\nVictims of mercenaries that this government had trained, died in a cold sweat\nDrowned him in shame\nBillions couldn’t buy him another day or numb the pain\n\n[Chorus]\nDark Corners\nThe Dark Corners are the place where we look death in the face\nAnd we let it give us chase but it always gets away\nDark corners are the place where we’re running out of luck\nAnd we cannot back it up. Death always catches up\nDark Corners are the place where we look death in the face\nAnd we let it give us chase but it always gets away\nDark corners are the place where we’re running out of luck\nAnd we cannot back it up. Death always catches up", "year": null, "album": "Knowledge Is Power II", "image": "https://images.genius.com/7c518a58eebfd479e5ad2216b0cd1a85.1000x1000x1.jpg"}], "artist": "Akala"}