{"songs": [{"title": "Get Dripped", "album": "Nuthin’ 2 Prove", "year": "2018-10-19", "image": "https://images.genius.com/c33c41089b606967d5a188e8633bc81c.1000x1000x1.jpg", "lyrics": "[Intro]\nEarl on the beat\nLousy\n\n[Verse 1: Playboi Carti]\nRun in, lil' bitch, you get hit (Boom, boom)\nCame in that bitch with that stick\nCame in that bitch with Lil Keed\nI got that money like blow (What?)\nI'm in this bitch with Lil Meech\nI do this shit in my sleep (Yeah)\nShawty suck me, she so geeked (Yeah)\nShawty fuck me, she so geeked (Yeah)\nI'm in this bitch and I'm fleek (Uh)\nI put VVS on my links\nShawty can't wait 'til we link\nFuck with Lil K, you get—\nGet laid on your ass, you get—\nI play with that 30, lil' bitch, yeah\nI need a mask for this heat, yeah\nI need a gas for my bitch, yeah\nYou know that choppa don't miss\nYou know that choppa don't miss\nI get this mothafucka lit, yeah\nDouble C all on my shit, yeah\nDolce Gabbana my bitch, yeah\nChristian Dior, I pop shit, yeah\nShawty gon' fuck on my drip, yeah\n\n[Chorus: Playboi Carti & Lil Yachty]\nShawty in love with my drip, woah\nI get that drip, you get dripped, yeah\n220 all on that rear, ayy\nI get the drip, you get dripped (Ay)\nI fucked that bitch, I'm a pimp (Ay)\nI'm with Lil Boat, we not simp, yeah\nI fucked that bitch, she get bent, yeah (Ay)\nWe in this bih with no tint (Ay, ay, ay, ay okay, yeah! yeah! yeah!)\n\n[Verse 2: Lil Yachty]\nUh, thugger lil' bitch speak Ebonics (Ayy)\nShootin' that Glock, supersonics (Baow, baow)\nI drop a dub at Onyx (Ayy)\nToot, toot that thing up (Toot)\nBeat from the back, she runnin' (Bih, bih)\nPink Prada bag, I'm thumbin' (BIh, yeah)\nF&N, 30 round gun you (Baow)\nFuck what they sayin', they pussy (Fuck 'em)\nMy shirt vintage Stussy (Yeah, yeah)\nI put them niggas on gang (Ayy)\nThey started snitchin'\nOops, back at 15 I was swipin' (Uh! Ay!)\nOops, beat up that pussy, I'm Tyson\nOops, niggas is reckless, triflin' (Yeah)\nThree cell phones, don't call me (Grr)\nRich white money, Mike Lowry (Mike Lowry)\nKeep one joystick like Atari (Like Atari)\nV on my back like Bari (VLONE)\nYeah (Yeah), yeah (Yeah)\nMe and Cash Carti go way back (Ayy, Carti)\nNigga don't like me, then say that (Okay)\n20 years old in a Maybach (Skrt)\nHoo! flexin' (Fuck it up, damn)\nYoung nigga flexing no 8 pack\n\n[Chorus: Playboi Carti]\nShawty in love with my drip, woah\nI get that drip, you get dripped, yeah\n220 all on that rear, ayy\nI get the drip, you get dripped\nI fucked that bitch, I'm a pimp\nI'm with Lil Boat, we not simp, yeah\nI fucked that bitch, she get bent, yeah\nWe in this bih with no tint\n\n[Outro: Lil Yachty]\nDamn (Ay)\nDamn (Ayy, ayy, ayy, ayy)\nBow, bow"}], "artist": "Lil Yachty"}