{"songs": [{"image": "https://images.genius.com/e6951472bdf7074eced144472c3b71c0.1000x1000x1.jpg", "title": "Favorite", "album": "The Pinkprint", "year": "2014-12-12", "lyrics": "[Intro: Jeremih]\nI don't want no drama\nI just wanna be your diamond, babe\nGuaranteed  to be a problem\nEvery time I get around you, babe\nI just want you to need me\nYou might really wanna try me, babe\nAll I know I want a rider\nAll I know I want a rider, babe\nYou know that you need a rider\nYou know that you need a rider, babe\nYou know that you need a rider\nYou know that you need a rider, babe, ah yeah...\n\n[Verse 1: Nicki Minaj]\nYo, I just wanna be ya rider, you should pull up in that Spyder\nYou should let me hit the mic, and I ain't talking about the fighter\nGet it lit without a lighter, let's pull an all-nighter\nTell me-tell me what you need, got the weed, I'm a bad little bitch and I never indict her\nGet locked, I'ma write ya, you on the road? I'ma Skype ya\nI don't wanna hype ya, but you a lucky nigga if my mean ass like ya\nYou ain't never have a bitch understand you, most of them wanna use you when they ran through\nI just wanna be somebody that can add to, your wife, be a friend, be a teacher and a fan too\nI just wanna listen, when you leave I say \"damn, I fucking miss him\"\nI just wanna be your vixen, give you something real wet to put your lips in\nI wanna be the only one that can check you, and still respect you\nCause it's you I would change for, you always make sure\n\n[Hook: Jeremih]\nI just wanna be your favorite\nI just wanna be your favorite\nI just wanna be your favorite\nI just wanna be your favorite\nWon't you let me be your favorite?\n\n[Verse 2: Nicki Minaj]\nAyo, I just wanna be your first go to, do you like a real one supposed to, livin' bi-coastal\nScoop me in the truck, late night on a humble\nMeet me out in Queens, where the city want a sundown\nYou could put your gun down, you could have fun now\nYou could tell you niggas that you won now, one down\nRun through the clubs with the baddest, bitches is the maddest, nothin' else matters\nAnd they say Birkin where the bag is, got a lot of bags, but we never got baggage\nWinter Wonderland on my hands, call me Alice, balance\nI'ma have you coming in my palace\nLondon, Tokyo, Paris, let me update your status\nCause it's you I would change for, you always make sure\n\n[Hook: Jeremih]\nI just wanna be your favorite\nI just wanna be your favorite\nI just wanna be your favorite\nI just wanna be your favorite\nWon't you let me be your favorite?\n\n[Outro: Nicki Minaj (Jeremih)]\nYou should already know\nYou should already know\nYou should already know\nYou should already know\n(You know that you need a rider\nYou know that you need a rider, babe\nYou know that you need a rider\nYou know that you need a rider, babe, ayy\nI just wanna be your favorite\nI just wanna be your favorite)\nYou should already know, you should already know\n(I just wanna be your favorite)\nYou should already know, you should already know\n(Won't you let me be your favorite?\nWon't you let me be your favorite?)"}], "artist": "Nicki Minaj"}