{"songs": [{"title": "Good KanShay West", "image": "https://images.genius.com/d39be70f638c88c431339e037c0e69e2.1000x1000x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nThis is about, like...\nAs classic hip-hop as it gets for my era and shit\nYou know\nI'm gonna do some real shit on this one\nTake a little breather\nIt's a true story\nI learned my lesson\nI'm sorry\n\n[Verse 1: brandUn DeShay]\nThere must be more good women than men, percentage-wise\nI steady run through my mind, but shorter than finish line\nWhat they fail to realize is I'm not that kind of guy\nSo I try to feed them lies when I look them in their eyes\nCompliment them on their size, tell them I'm on the rise\nWorking with Kanye, Lupe, and Do or Die\nThen tell them it's cool to rise, so why don't you come inside?\nThen tell her I love her while lovemaking, then cum inside\nThen later she let me drive inside her G35\nTrying to come clean by telling her dirty lies\nAnd telling her that she the shit, baby, you're native flies\nTook her to expensive restaurants and made her buy\nAnd somehow I made it by, funny she never tried\nTo ask for that cash that I owed her since last July\nTrusting me as if I was the guy I idolized\nAnd gave me more hype than a champion title fight\nI guess there's more good women than men, percentage-wise\nA lot of men get women because, really, they're killing time\nI guess that's why a lot of girls say they ain't into guys\nAnd focus on their view full-time to improvise\n\n[Hook (2x): Sample]\nWe ball until we fall, hit the mall\nAfter we hit, don't call\nWe fill your lives with nothing but lies\nAnd I would like to apologize\n\n[Verse 2: brandUn DeShay]\nFor the men who try to put your life in a vice\nPressuring you to get them implants and make you diet\nNot saying it's not right, but do it at your time\nWhenever you feeling that confident about your size\nBecause, baby, limit's the sky, you need to limit these guys\nShouldn't wear a disguise just to beat the truth in his eyes\nHe's going out every night? Try not to hold him tight\nEspecially if he ain't rolling right like loaded dice\nDon't gotta give him fifty-thousand chances to show you right\nBecause honesty's the best policy, show you right\nLove shouldn't be overpriced, shouldn't have to spend your life\nSearching for something and end up with nothing, that's my advice\nI guess there's more good women than men, percentage-wise\nA lot of these guys making it hard to empathize\nI guess that's why a lot of women say they get tired of guys\nGuess we gotta lose them all first before realize\n\n[Outro: brandUn DeShay]\nGot niggas over here\nInstant messaging me and shit\nI'm trying to reminisce on my dark days and shit, whatever\nThey asking me about, \"when the mixtape gonna drop?\"\nI'm still recording it and shit\nIt's all good, though\nIt's all good\nNext...", "year": "2009-12-25", "album": "Your Favorite! MixTape"}], "artist": "Ace Hashimoto"}