{"songs": [{"image": "https://images.genius.com/093524f55308e0c3a99f8d6f7746a3bf.1000x1000x1.jpg", "title": "Mansion", "album": "Mansion", "year": "2015-03-31", "lyrics": "[Chorus: Fleurie]\nInsidious is blind inception\nWhat's reality with all these questions?\nFeels like I missed my alarm and slept in\nSlept in\nBroken legs, but I chase perfection\nThese walls are my blank expression\nMy mind is a home I'm trapped in\nAnd it's lonely inside this mansion\n\n[Verse 1: NF]\nYo, my mind is a house with walls, covered in lyrics\nThey're all over the place, there's songs in the mirrors\nWritten all over the floors, all over the chairs\nAnd you get the uncut version of life when I go downstairs\nThat's where I write when I'm in a bad place and need to release\nAnd let out the version of NF you don't wanna see\nI put holes in the walls with both of my fists till they bleed\nYou might get a glimpse of how I cope with all this anger in me\nPhysically abused, now that's the room that I don't wanna be in\nThat picture ain't blurry at all, I just don't wanna see it\nAnd these walls ain't blank, I just think I don't wanna see 'em\nBut why not? I'm in here, so I might as well read 'em\nI gotta thank you for this anger that I carry around\nWish I could take a match and burn this whole room to the ground\nMatter of fact, I think I'ma burn this room right now\nSomehow, this memory, for some reason, just won't burn down\nYou used to put me in the corner, so you could see the fear in my eyes\nThen took me downstairs and beat me till I screamed and I cried\nCongratulations, you'll always have a room in my mind\nBut I'ma keep the door shut and lock the lyrics inside\n\n[Chorus: Fleurie]\nInsidious is blind inception\nWhat's reality with all these questions?\nFeels like I missed my alarm and slept in\nAnd slept in\nBroken legs, but I chase perfection\nThese walls are my blank expression\nMy mind is a home I'm trapped in\nAnd it's lonely inside this mansion, inside this mansion\n\n[Verse 2: NF]\nYo, my mind is a house with walls, covered in pain\nSee, my problem is, I don't fix things, I just try to repaint\nCover 'em up, like it never happened, say, \"I wish I could change\"\nAre you confused? Come upstairs and I'll show you what I mean\nThis room's full of regrets, it just keeps getting fuller, it seems\nThe moment I walk into it's the same moment that I wanna leave\nI get sick to my stomach every time I look at these things\nBut it's hard to look past when this is the room where I sleep\nI look around, one of the worst things I wrote on these walls\nWas the moment I realized that I was losing my mom\nOne of the first things I wrote was, \"I wish I woulda called\"\nBut I should just stop now, we ain't got enough room in this song\nAnd I regret the fact that I struggled trying to find who I am\nAnd I lie to myself and say I do the best that I can\nShrug it off like it ain't nothing, like it's out of my hands\nThen get ticked off whenever I see it affecting my plans\nAnd I regret watchin' these trust issues eat me alive\nAnd at the rate I'm goin', they'll probably still be there when I die\nCongratulations, you'll always have a room in my mind\nThe question is, will I ever clean the walls off in time?\n\n[Chorus: Fleurie]\nInsidious is blind inception\nWhat's reality with all these questions?\nFeels like I missed my alarm and slept in\nAnd slept in\nBroken legs, but I chase perfection\nThese walls are my blank expression\nMy mind is a home I'm trapped in\nAnd it's lonely inside this mansion, inside this mansion\n\n[Verse 3: NF]\nSo this part of my house, no one's been in it for years\nI built a safe room and I don't let no one in there\n'Cause if I do, there's a chance that they might disappear\nAnd not come back, and I admit, I am emotionally scared\nTo let anyone inside, so I just leave my doors locked\nYou might get other doors to open up, but this door's not\n'Cause I don't want you to have the opportunity to hurt me\nAnd I'll be the only person that I can blame when you desert me\nI'm barricaded inside, so stop watchin'\nI'm not coming to the door, so stop knockin', stop knockin'\nI'm trapped here, God keeps saying I'm not locked in\nI chose this, I am lost in my own conscience\nI know that shuttin' the world out ain't solvin' the problem\nBut I didn't build this house because I thought it would solve 'em\nI built it because I thought that it was safer in there\nBut it's not, I'm not the only thing that's livin' in here\nFear came to my house years ago, I let him in\nMaybe that's the problem, 'cause I've been dealing with this ever since\nI thought that he would leave, but it's obvious, he never did\nHe must have picked a room and got comfortable and settled in\nNow I'm in a position, it's either sit here and let 'em win\nOr put him back outside where he came from, but I never can\n'Cause in order to do that, I'd have to open the doors\nIs that me or the fear talking? I don't know anymore\n\n[Outro: NF & Fleurie]\nIt's lonely\nInside (Inside), inside (Inside)\nIt's lonely (It's lonely)\nOh, yeah, it's lonely\nInside this mansion"}], "artist": "NF"}