{"songs": [{"year": "2016-11-04", "image": "https://images.genius.com/276f9ce7db4fdfcb8518ab6ab64cfd4a.500x500x1.jpg", "title": "Quasars", "album": "H.O.G.", "lyrics": "[Intro: Makzilla & Big Scoob]\nScoob, I feel what you saying, bro but, man, you always talking about Moon, stars, quasars. I mean, man,  you sound like Elroy Jetson or some shit, bro\nI'm saying though, like, there's more to me than just gold tooth gangsta shit, you dig?\nI feel you\nLike, like I'm on some enlighten the world Like teach these young niggas something, know what I'm talkin' 'bout? Let a muthafucka that there's more to life, man\nAin't nobody teach me shit\n\n[Verse 1: Big Scoob]\nSick of the truth, searching for proof\nWho do I ask? Who's in the loop?\nLocked away answers, I need the key\nIt has to be something y'all keeping from me\nAshes to ashes, dust to dirt\nWalking this Earth, but what am I worth\nBreath in this body and blood in these veins\nThe body's a rental, how long am I staying?\nScatter my mental, I'm kinda resentful\nAll of these lies, it could've been simple\nWhatever I make it, acknowledge and growth\nOut of this matrix, I'm out of this hole\nRotting away, it's eating my soul\nHungry for knowledge and eager to grow\nTruth in the lies and I realize\nI must go get it if I want to thrive\nPush it aside, I feel it inside\nI'm wasting my time if I'm meant to fly\nBut who am I? Help me define\nThe man in the mirror with pain in my eyes\nTrapped in the struggle and fighting the fire\nEvery desire's the way that I'm wired\nAsking for passage, show me the light\nChase it, embrace it with all of my might\n\n[Hook: Big Scoob]\nI'm looking at the Moon and stars\nAmazing how they fill the sky\nGazing out the sunroof\nTripping off of God's design\nI don't even smoke weed\nFeel me? I ain't even high\nCan't sleep at night, my brain got me asking questions - why?\n\n[Post-Hook: Stevie Stone]\nWhere do we come from?\nQuasars up in my eyes\nTruth behind God's design\nGot me asking questions like\n\n[Verse 2: Krizz Kaliko]\nWhy do what I do when I was raised right?\nAnd how I'm watching Pornhub on the late night?\nMomma praised the Lord, maybe I ain't pray right\nI been searching for my soul in the dark, but in the daylight\nAin't supposed to look at niggas like I look at 'em\nHold my finger and shook at 'em\nCops is popping 'em all through, then bookin' 'em\nPeople ain't seeing no good in 'em\nIn God we trust and He's in us\nAnd ain't no Heaven above\nPray while I'm still breathing that people seeing that the Heaven is love\nSee that's what I think\nI don't sleep at night, I just blink\nWill I ever get rich off this while I'm just stressing and losing my hair in the sink\nOur mind is a gold mine that I think we just sitting on\nOn this planet we living on\nThey say for my seed's speed is too fast for roots to slither on\nAnd can't forget that I was stolen\nBrought to this land that we living on\nWhy their descendants is loving me?\nIn prison, whatever I'm spitting on\nWhich way do I go?\nI need to know, Father, before I die\nAin't got no manual to this shit\nSo I'm still asking \"Why?\"\n\n[Hook: Big Scoob]\nI'm looking at the Moon and stars\nAmazing how they fill the sky\nGazing out the sunroof\nTripping off of God's design\nI don't even smoke weed\nFeel me? I ain't even high\nCan't sleep at night, my brain got me asking questions - why?\n\n[Post-Hook: Stevie Stone]\nWhere do we come from?\nQuasars up in my eyes\nTruth behind God's design\nGot me asking questions like"}], "artist": "Big Scoob"}