{"songs": [{"year": "2012-04-10", "image": "https://images.genius.com/bdb1ca23b418b0572caba92910aaa741.600x600x1.jpg", "title": "DMCA", "album": "History Will Absolve Me", "lyrics": "Police and thieves in the street, perched in trees to beat the heat\nBut for that gold & green who wouldn't Lamebeau Leap\nAdmittedly Sambo but a Man's gots to eat\nAnd it's Jolly Roger on high seas when the album leak\nJamaican piracy, jacking for beats\nO'Shea Jackson rapidsharing your masterpiece\n\n[Interlude]\nYeah, I heard it. It was OK but I liked the mixtape better\nYeah, their older stuff was awesome.  I already deleted this one\nYeah, I put a couple of songs on my iPod though\n\nFuck thirty days, if you lucky, flavor of the week\nThe OG reek from the podium during my concession speech\nWhat considerate rapists, keeping jellied petroleum within easy reach\nHigh Pressure Sodium. Organic Hydro, life's a Beach\nDigital Robinson Crusoe, the seeders seed, the leeches leech\nAnd don't nobody aboard know the time, cause they flooded the timepiece\nSound asleep under high thread count sheets\nIt's a whole 'nother world in these first class seats\nRingtones on phones and video game licensing fees\nI don't know much but got some educated feets\nGladly buck dance and show teeth for that kinda paper, you crazy?\nGoddamn right I'll sign the release!\n\nBig budget videos to career stalled\nNow you mad at the Canadian with the fake southern drawl\nI laugh at y'all, having fun in prison like Cuban baseball\nOld rappers trying to learn how to skateboard\nObama rob Peter just to pay Paul, I can dig that\nSymmetrical, like stickup kids getting jacked\nOr she spread wide with the fresh Brazilian wax, spit polish\nLittle Lebowski Urban Achiever plaque\nWe only here cause some crackers ain't want to pay taxes\nOn they Earl Grey but see nothing wrong with owning slaves\nSo fuck a sample, I don't gots to pay\nWhen I take your shit, that's the American Way. Downpour torrential\nTorrents have your whole album and the instrumentals\nIt's like writing a fucking novel in pencil\nStill saute the track, plate with market greens and lentils\nBlack garlic, green onions, snow pea tendril\nPuget Sound, blowing Sonic out the Gill like Kendall\n90% of the game is half mental, but after seeing how you suck a dick...\nI'd say you got a lot of potential"}], "artist": "​billy woods"}