{"songs": [{"lyrics": "{*scratched: \"kick the science\"*}\n\n[D-Nice]\nSo what's up? I hear you've been lookin for the Nice\nBut now I'm here, standin clear in your sight\nOr your vision, I only recommend to your visual\nMess around and this becomes critical\nEasily, cause any rapper I ruin\nYou're talkin bout foolin me? What could you do to me?\nNothin, you're frontin, it'll be your last\nMess around punk, and get a foot in your {ass}\nCause my voice on wax, gettin paid in stacks\nYou tryin to diss? Well you might get smacked\nIn fact I might stomp you straight in the ground\nSo kill that talk and have a Coke and a smile\nOr else have a glass of milk, and a cookie\nCause to me you're just a rookie\nIn my world, playin my game\nTo hang with the Nice you must be insane\nI reign/rain like a shower, with power\nServin MC's every hour on the hour on a platter\nWatchin you shatter, like glass\nFallin by the mass, I'm trainin by the class\nAnd last, I'm here to cold tear you up\nNow you know what I'm sayin, so just SHUT THE HELL UP\nCause if not, you better throw your hands in the air\nAnd prepare, to go to war with this here\n\n{*scratched: \"kick the science\"*}\n\n[D-Nice]\nI'ma - microphone teacher, plus the Black Caesar\nTalk about your crew, right down to your skeezer\nSo just ease off, or else decline\nTakin you out ANY season, not just summertime\nSo choose your season to tangle\nI can strangle, with my microphone cable\nThen I played you\nNo matter what, you suckers STILL \"Crumbs On the Table\"\nSo be able to hold your own weight\nBut do not make the mistake and come straight to my face\nSayin I'm too young for this\nPlease, huh, cause I'll fry you like fish\nBut just in case you misunderstood\nOr can't comprehend then boy you should\nPick up the telephone, and \"Call Me D-Nice\"\nArea code eight-oh-eight, and I might\nTeach you how to rhyme on beat\nTeach you that dog don't rhyme with skreet\nShow you how to tell a real hit from a flop\nAnd teach you what's wack don't rise to the top\nStop - but let me tell you somethin\nSteppin to me is like \"Self Destruction\"\nI don't malfunction, nor do I get high\nBefore you disrespect, you better buy my album\nBetter yet, the first chapter\nPeace to Red, D-Square and Blastmaster\nAnd any rapper, who tries to disrespect D\nHuh, it's all about me\n\n{*scratched: \"kick the science\"*}", "album": "Call Me D-Nice", "year": null, "title": "It’s All About Me", "image": "https://images.genius.com/eb0cb470ed0037a539adc0b84eb90ebd.432x432x1.jpg"}], "artist": "D Nice"}