{"artist": "Z-Ro", "songs": [{"album": "Heroin", "title": "Do Bad On My Own", "lyrics": "[Verse 1:]\nI remember situations as an adolescent\nI couldn't roll with the homies they'd rather see a nigga steppin'\nWas it cause I was a \"school boy\" tryin' to get my grades together?\nStayed on the same block but we never played together\nAll of a sudden, why they wanna come and kick it with Ro?\nThinkin' they can get free cd's and free ticket's to show's? no!\nPay at the door or you stuck out\nAnd if you get in, don't ask for nothin' or get escorted the fuck out!\nAnd say lil' mama I ain't tryin' to go to bed with ya\nYou smokin' thinkin' I'm about to be breakin' bread with ya\nKeep my money in my pocket, never leave it with ho's\nPut a ring on my own finger cause I sleep with zero\nI love my enemy's more than friends that's why I treat'em so friendly\nCause they let you know they hate you, but a friend hides his envy\nAin't no use in flaggin' me down while I'm out on a creep\nIf I'm stoppin', my gun's cockin' you droppin'\nI live and die one deep!\n\n[Hook:]\nI don't need no help, my nigga,I can do bad on my own\nAnd I don't need no company lil' mama, stop ringing my cellular phone\nWhen I be down and out, nobody wanna come and kick it\nI'm a nobody until I can shine\nSo when the money is long, I don't need nobody to visit\nLeave me lonely like you did last time\n\n[Verse 2:]\nIt's the same, every day. every day is the same\nDealin' with fraud ass fellas I swear it ain't gonna ever change\nEven speakin' on the hood, nigga the hood ain't shit\nSo when you see me I'm a speak, but that's as good as it gets\nBut ain't no ridin' with me, gettin' drunk, or gettin' high with me\nTen out of ten I bet you would never ride and die with me\nAll my drugs are for personal use cause I be stressin' bad\nPoverty and pain is all I've ever had\nI remember I was down in the dumps no one lifted me up\nNiggas said I would never make it in music cause i wasn't gifted enough\nSo why the hell would I chill with y'all?\nI'd rather deal with felony charges before I have to deal with y'all\nIt's one cup, one sweet cause it's Z-ro only\nForever lonely I don't need no phony homey's all up on me\nCause when niggas get to trippin' with their and shit\nFor me, I bet my homey's won't empty a clip\nI live and die one deep!\n\n[Hook]\n\n[Verse 3:]\nIt was hard to dream when I was hooked on codeine\nKillin' myself slowly on purpose cause humans made me nervous\nAnd I knew I'd have to kill one, one day\nThen how could I sit up in front of the Lord come Sunday?\nThat's why I eat by myself and I sleep by myself\nI'm alone twenty-four seven I'm out here on my own\nPlus I'm confident that I would never jack myself\nFor all I know, homicides are homey's watchin' as I stack my wealth\nWhen I was trippin' with my steel pointed dead at my grill\nAll my \"real niggas was laughin'\". didn't try to tell me to chill\nI ain't ever had a friend like Joseph\nCause he don't give a damn if I ever was on a poster\nA skinny ass never had a penny ass nigga, treated like a food stamp\nTill I dropped a few jams now they diggin' a nigga\nIt's plain and simple to witness\nIf it wasn't for rappin' who'd give a fuck about my business?\nLet me live one deep!\n\n[Hook]", "year": "2010-06-21", "image": "https://images.genius.com/6c6f6b9a74e666243f96b121e467b3e8.640x640x1.jpg"}]}