{"artist": "Porta", "songs": [{"album": "Equilibrio", "title": "No Hay Truco 1.5", "image": "https://images.genius.com/aa27426d55342fc5e77da95dffc19068.799x799x1.jpg", "lyrics": "[Intro]\nTodo lo que oigan en este trabajo musical\nTodo lo que perciban\nEs producto de su imaginación\nNada es real\n\n[Verso 1]\nAquí no hay truco, discrepo con tu magia de instituto\nPon las cartas en la mesa, ni me inmuto\nDio fruto mi esencia, ahora la diferencia es basta\nDisfruto como un niño cuando prueba su primer canuto ¡y ya está!\n\nParto en el acto tu hardcore blando, soy Donnie Darko\nVas de narco, con el poder de Parker practico Parkour\nMira groupie, dile a papi, no escondo nada en las mangas\nBaila este tango conmigo, luego te quitaré el tanga\n\nHaces trampas, trucos de distracción baratos\nYo sigo haciendo rap gordo aunque tu me veas flaco\nMetí el rap en tu saco, mira, nada en la chistera\nMe mostré tal como era, ahora llámame toyaco\n\nPonme un bombo una caja y y tu cuello hara ¡crack!\nHice que mi voz se oyera y no hicieran caso a la edad\nHoy tenemos una cita, sé bien que es lo que te excita\nVoy a mostrarte la magia que sale de mi “varita” ¡es rap!\n\nA mi no me joden, lo intentan\nNo hay comentarios tontos, pero hay mucho tonto que comenta\nNo tienes ni puta idea, pero has de dar tu opinión\nMe faltas sin ni siquiera escuchar una canción\n\nSoy como David Copperfield, valgo más que el marfíl\nCreí en mi, cogí un boli bic, un mic y lo rompí\nTu abra kadabra son palabras que ladras sin más\nVa, Bibidi, Babidi, soy el Majin Boo del rap\n\n[Estribillo]\nNo es Cuestión de Edades, se vio a un Mc diferente\nNo Hay Truco pa’ estar En Boca de Tantos de repente\nTuve un Trastorno Bipolar y a Resetear mi mente\nAlgo ha cambiado, el Equilibrio está presente\n\nNo es Cuestión de Edades, se vio a un Mc diferente\nNo Hay Truco pa’ estar En Boca de Tantos de repente\nTuve un Trastorno Bipolar y a Resetear mi mente\nAlgo ha cambiado, el Equilibrio está presente\n\n[Verso 2]\nSoy el Messi de los Mc’s podéis llamarme mesías\nMi rap nunca morirá y yo resucitaré en tres días\nDe verdad, soy un crack aunque te joda\nToma, coma, Soma en el beat, dale el repeat, “this is mi shit” ¡No es broma!\n\nTu mierda LP no se encuentra en el top manta\nEstá en mi papelera de reciclaje, me encanta\n¿Eres escéptico? Yo voy a hacer que creas\n¿Te gusta lamer culos? te voy a poner correa\n\nNo hay truco, sueno brusco, este rap bruto es magia negra\nEs rap que viene directamente de una mente enferma\nNo todo tiene explicación, toma precaución\nEnséñale esta canción, le gustara hasta a tu suegra\n\nOs cierro la boca, no sois pocas las que babeais\nAntes mucho bla bla bla y ahora tartamudeáis\nFuck Universal, soy como Anthony Blake\nOs falta originalidad, porque sois unos fakes\n\nEn el palco de honor estoy B-Boy ¿No quieres darte cuenta?\nQue no soy yo sino mi música la que está en venta\nSin pelos en la lengua como Mou, duro como Spawn\nTe dejo K.O no como Mcweder con Pakiao\n\nEsto es un puzzle y a lo saw dejo mi seña\nLos niños duermen mientras mi mente diseña\nPor mucho que te empeñes no me raparé las greñas\nYo soy el ejemplo de que puedes cumplir lo que sueñas\n\n[Estribillo]\nNo es Cuestión de Edades, se vio a un Mc diferente\nNo Hay Truco pa’ estar En Boca de Tantos de repente\nTuve un Trastorno Bipolar y a Resetear mi mente\nAlgo ha cambiado, el Equilibrio está presente\n\nNo es Cuestión de Edades, se vio a un Mc diferente\nNo Hay Truco pa’ estar En Boca de Tantos de repente\nTuve un Trastorno Bipolar y a Resetear mi mente\nAlgo ha cambiado, el Equilibrio está presente\n\n[Verso 3]\nSon déjàvu’s ¿o aún te follas a tu exnovia?\nMe tienen rabia, fobia, sin más, me amas o me odias\nSé que aún tengo fama y porque muchos me parodian\nTú un cuerpo danone pero mi rap ha hecho historia\n\nSolo en las mejores salas, no es cuestión de edades\nPuedo para balas y hacer juegos palabrares\nSoy como la pólvora y tu ardes\nTu apodo anónimo es sinónimo de cobarde\n\nSolo pasen y vean y aunque se lo crean\nSus raps son menos complejos que un mueble de Ikea\nMiren mi pelo Pantene, mi estética se hizo viral\nEres el primero en perder, un segundón muy “real”\n\nNo hay truco pero trato todos mis temas con mimo\nPido voluntario, lo haré desaparecer mientras rimo\nNo me importa lo digas, lo que inventas\nYo soy fan de Porta y te cerré la puta boca, ¡date cuenta!\n\nSe escuchan los gritos si hago acto de presencia\nNo me hacen ni sombra aunque se creen mi competencia\nYo soy elegante aunque se agote mi paciencia\nMe nombran en temas y yo muestro indiferencia\n\nNo tengo fecha de caducidad, ni sustituto\nDile a tu papá que esto es rap, yo no educo\nSon diez años ya y aquí está mi tributo\nVuelvo para demostrar que detrás de mi rap no hay truco", "year": null}]}