{"songs": [{"image": "https://images.genius.com/246e4408dbf779ecc2275ceef46c850e.453x450x1.jpg", "year": "1992-04-16", "title": "Call Tha Guardz", "album": "Psycho Active", "lyrics": "{Verse 1}\nI lied when I said you wouldn't get smoked\nEyes examine the barrel as I watch you choke\nTake a deep breath, cause it's your last, nigga\nGot any last words? (Sicx): Fuck that pig, pull the trigga!\nAnd that's a present from me\nFor helping me out the motherfucking penitentiary\nLabel me insane and the dope dealer\nNow add this to your list: a cop killer\nYou can go on and on, fool\nBut you won't catch the X when I'm mashin' in the old school\nLike someone's pedal mashed to the floor\nAnd passed the hundred and flipped back to zero\nHit 99 and I'm Southbound\n30 miles out to get to Sac-Town\nI saw a brown Monte Carlo OnStar\nTo hit the sirens, time to ditch this cop car\nGrabbed the gauge off the dash\nI said \"Get out the shit, or I'm a blast\"\nNigga didn't ask no questions\nI had a gat, so he followed my suggestions\nFace down, on the concrete\nAll he saw was the streaks that I left in the street\nNow all I need is a drink\nBut I don't got no cash, so let me think\nWill I walk in the store and steal on and shoot the clerk?\nFuck it, a beer run that'll work\nGot off the freeway, on Foreign Row\nFood and Liquor Market, here we go\n(Cashier): Can I see some I.D., please?\n(X-Raided): Nah, let me get it out the car\n(Cashier): Uh, can you leave the beer here?\n(X-Raided): Nah, I'm outta here\n(Sound of car driving away)\n(X-Raided): Ha, stupid motherfucker\n\n{Hook}\nIce Cube: Never should've been let out the penitentiary\nEazy-E: Tired of the motherfuckin' jackin'\n(Repeats Twice)\n\n{Verse 2}\nRolling down Foreign with a forty in my lap\nGripping a nine, and I'm eager to peel a cap\nI'm broke and saw a bitch at the bank teller\nI need some cash, how to get her?\nPulled into the lot and found an unlit space\nI can't let the bitch see my face\nSo I crept up slow in the dark\nI said don't breathe, unless you wanna see my nine spark\nJust like I thought, the bitch panicked\nI put the gat to her head, took her cash, and let her have it\nWatched her body drop, and then I mashed\nCellmate reached out his hand and said he wanted half\nX-Raided just laughed\nLooked at him crazy, and said you can't have no cash\nAnd then the nigga got mad\nWhipped out the nine on his ass and went blast\nToo much cargo in the first place\nNigga wasn't doing shit, but taking up space\nHe was my celly for a year or two\nSo to kill his ass was something I'd been wanting to do\nHe wasn't nothing but a cracker\nDoing time in the pen with the Garden Blocc Jacker\nThe motherfucker didn't know\nAnd now he's dead in the car, fucking with a psycho\n\n{Hook}\n\n{Verse 3}\nMy dick's on hard from all the drama\nSo I'm headin' to the garden to fuck my baby's mama\n24, the streets I know well\nWhen she see me, she gone be shocked as hell\nI knocked on the door and she answered it\nI saw another nigga sitting on the couch and shit\nI walked in, the nigga tried to act Loc\nThat made my day, another fool I have smoke\nI let him have it, the nigga straight dropped\nThen it was time for my bitch to get mobbed\nI didn't tripped though, I got my fucking zone\nFall asleep, woke up, and the bitch was gone\nGrabbed the gauge, cause I got a weird vibe\nPeeped out the window and the cops was outside\n(Police): \"Come out with your hands up!\"\nI said \"Fuck you pig, and you can suck my left nut!\"\nCocked the motherfucking 12-gauge\nJumped out the window, and went on a rampage\nBlasting as I hid behind a car\nHavin' visions of the mothfuckin' cell bars\nI'd rather die than go back, so take that, bitch\nI pulled the trigger and went out like a lunatic\nLots of lead from my gauge got discharged\nThey need help so Call Tha Guardz"}], "artist": "X-Raided"}