{"songs": [{"lyrics": "[Hook] {x4}\nGhetto girl\nAll over the world, all over the world! C'mon!\n\"All you want is love and affection\" - Eric B & Rakim 'Eric B Is President'\n\n[Verse One]\nTo all the ladies looking fly with their hair done and their nails done\n8-Off The Assassin is representing\nTrue love\nStraight from the heart to come see\nDon't sleep\nI'll have you weak under the sheets I'll make you feel good\nLike you never ever felt before\nFrom the living room to the bed room then on to the kitchen floor\nFlex with me, just sit next to me\nThe only thought running through your mind is just to have sex with me\nSqueeze ya tight, I'll make it right\nI'm the type to dim the lights and freak you all night, aiiiiight?\nAnd if you smoke lah, we can spark\nI still be with it if you let me hit in the park after dark\nCan we have sex on the swings?\nGirl, time to let you know 8-Off got a good thing\nBottom line is you are the world\nNever phony, my one and only ghetto girl\n\n[Hook]\n\n[Verse Two]\nI'm guaranteed to get you sprung With the tip of my tongue\nWhether you're old or you're young girl I get the job done\nI got you on the run\nSearching for 8-Off to make you cum\nIf I was to go raw baby you would be the one\nGirl you know it's true, all I want is you, yeah me and you\nTogether forever a real nigga will take care of you\nBuy you clothes when you need and give you food when you want it\nI always kept it real I never fronted\nWhen it comes down to making it right\n8-Off The Assassin will make it through the night so hold me tight\nTighter than [?] bear hug\nI know sex is addicting like a new drug\nYou got a boyfriend but like you said he just a boy\n8-Off can bring you much more than joy\nRespect\nCheck the tech'\nI'll make you wet then light your cigarette so girl don't forget you're my...\n\n[Hook]\n\n[Verse Three]\nWhen I look at you, sometimes you have me zoning\nFiending to get you naked and at the mouth I'm foaming\nSo let's start the boning cause it's too late in the night\nPlus I wouldn't mind if you wanted to rock a mic\nSo instead of a wet dream, get a cherry and whip cream I'll make you scream\nAs long as the punnany's clean\nI even do the R. Kelly on your belly\nBut I ain't gonna be messing with a chicken if the nappy dugout dirty\nOh well, time to search for another fish in the sea\nI ain't trying to get my heart broken baby\nMaybe we could have a family in this crazy world\nNo doubt, this goes out to the...\n\n[Hook]", "title": "Ghetto Girl", "album": null, "image": "https://images.genius.com/5fd4dae14b923634a5ef42b92773dc08.600x925x1.jpg", "year": "1994-01-01"}], "artist": "Agallah"}