{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legendary Classics Volume 1", "year": "2005-10-18", "lyrics": "[Intro]\n(Give it up!\nBut it's just no use!)\n\n[Hook: sample]\n(Give it up! Oh Lord\nGive it all to you\nI try, but it's just no use!)\n\n[Verse 1: R.A. the Rugged Man]\nHey yo, give it up, buss you up, no fuss, blood gush\nCuss much, Russ Meyer bust nuts, crunch crush\nGuts bust, what's what? The white King Tut\nOut in Suffolk, look who they dug up, yup, it's the Rugged\nOn a record with J-Live, I could hardly believe this\nI never thought I'd be rapping on no record with school teachers\nPamphlets from the eighties, library, lies buried\nTV, tell lies visually, kid you with me, hostility\n\"Humility, hillbilly, gorilla, he mentally ill, he silly\nIs he actually? Will he kill me really?\"\nAll that stuff you heard about me, is probably true\nHeard I got the AIDS virus, I probably do\nAmmunition spitting isn't missing, isn't you listening?\nSlithering, ridden in sin, slipping, sin delivering\nI'm sickening with sinning, sizzling rhythm, verbally hit him\nDid he did it, or did he didn't admit it?\nPretend he ain't offending the men and women\nEvery minute he in it, only\nEvery illiterate ignorant critic will diss it\nEvery idiot that ain't live it, they talking shit\nI'm R.A. the Rugged Man, get off, my dick\n\n[Hook]\n\n[Verse 2: J-Live]\nGive it up, for the Gods & the Earths, ladies and gentleman\nAll the human families, the wicked can't stand me\nThe righteous man hands me the mic, it's uncanny how\nOne man's penalty, is another man's reward\nThe label pun's ironic, courtesy of this sport\nStill can't stop a grown man from pressing record\nA free man can either be freedom or free label\nWhen you spent, what you make, to keep making, you can't save\nA damn thing, no savings, that's how life will enslave ya\nThat's why I strive daily; to be my own savior\nI know when shine glows and reflects in my behavior\nSo caught in between checks, I still demand respect\nSo give it up, if your mission's belittling my position\nAs a microphone physician, making you listen\nMe and Rugged Man relate, through a previous poem\nLike he said, I'm mad famous, for being unknown\nOn records for ten years, I can hardly believe it\nNever thought I'd be perceived, as just some rapping school teacher\nJust some dude, that can cut and rhyme, same time\nJust some conscious kid, that's trying to save the world through rhyme\nJust another underground, hand-to-mouth microphonist\nStop in mid rap, just to stop you in your tracks\nThis will stomp you on your track, justice is not just\nAnother ordinary rapper, I'm the Crown Royal block\nWith a velvet bag, matter of fact, and since the swagger is back\nAnd backed by, a whole nation of millions\nYou can't hold me, my new floor is my old ceiling\nThat's why I'm guaranteed to leave you with something you lack, so just\n\n[Hook]", "title": "Give It Up", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}