{"artist": "Anderson .Paak", "songs": [{"title": "Trippy", "album": "Oxnard", "year": "2018-11-16", "image": "https://images.genius.com/f86cd94b8dc54301943533fa84ca4350.1000x1000x1.jpg", "lyrics": "[Intro: Rodney Dangerfield & Johnny Carson]\nAh, that's right, doll\nBut everyone wants love\nLove, is the answer, Johnny\nEveryone is lookin' for love, deep love\nA lifetime of deep love, you know?\nI'm lookin' for a shallow half hour, you know?\nDon't you have luck with women?\nI never had luck with women\nI'm no ladies man, I know that, Johnny\nAnd I never got girls when I was a kid in show business either, you know?\nOne girl told me, \"Come on over, there's nobody home\"\nI went over, there was nobody home!\n\n[Pre-Chorus: Anderson .Paak]\nYou and I will always meet somewhere in between\nYou and I will always meet somewhere in between\nSweet Trippy, I'm yours for the gettin'\nTalkin' foolish at the moon, I was gone, 1800, sippin'\nI can't get rid of you, all the places that I used to go and kick it\nAll this weight that I'm liftin', trippy\n\n[Chorus: Anderson .Paak]\nCome meet me in the middle, right there where you always be\nSomewhere in between, you and I will always be\nCome meet me in the middle, right there where we always be\nSomewhere in between, you and I will always be\nCome meet me in the middle (I'll meet you in the middle)\nCome meet me in the middle (Somewhere in between)\nCome meet me in the middle (You and I will always be)\nRight there where we always be (Somewhere in between)\n\n[Verse 1: Anderson .Paak]\nWithout a space I could feel, in the words to define\nPick it up, if you will, heavy weight on my mind\nJust a pretty brown thing wit'cho head in the clouds\nWhy don't you put the round thing in the palm of my hands\nUp enough for the thrill, over over you spill\nOpen up, I could tell\nI could see when it's real\nAnd as soon as I grab a hold of ya, I'ma have to let go of ya\n\n[Verse 2: J. Cole]\nCame down the block, somethin' sick, but it's rented\nI don't give a fuck, bitch, either way, I'm in it\nI ain't gotta prove to you that I got bread\nNiggas talkin' money but be broker than the bed\nThat I slept on back in Mohammed crib\n'Member fuckin' hoes leanin' all to the left?\nDon't know why they rock wit' a nigga, but they did\nDamn sure wasn't the money, maybe it's the kid?\nUsed to have a honey that I loved when we was younger but somehow got disconnected before Facebook got so big\nI used to search her name hopin' we could reconnect\nBut if I sent the message, would she still be on my dick?\nWhen I couldn't find her, had me feelin' mad lame\nMaybe she got married and she changed her last name\nMaybe she just ain't up on the latest of the internet and ain't got into that\nBut give her time, that'll change\nBingo, what do you know?\nYears later, late night after a show we here laid up\nBrown skin, love how it glow, your hair tied up\nAsk, \"Is it cool if I smoke?\" Go 'head, light up\nHigh from your fragrance, I love, you smell purrty\nKnow I got it straight from the mud, my nails dirty\nIf somehow we both lose touch, I won't lie, ya got me open way too much, I'm gon' find ya\n\n[Pre-Chorus: Anderson .Paak]\nSweet trippy, you’re lost in the deep end, like water to a fish scale\nLove to watch you swim\nI can't get rid of you, all the places that I used to go and kick it\nAll this weight that I'm liftin', trippy\n\n[Chorus: Anderson .Paak]\nCome meet me in the middle, right there where you always be\nSomewhere in between, you and I will always be\nCome meet me in the middle, right there where we always be\nSomewhere in between, you and I will always be\nCome meet me in the middle (You and I will always be)\nCome meet me in the middle (Somewhere in between)\nCome meet me in the middle (You and I will always be)\nSomewhere in between\nYou and I will always be"}]}