{"songs": [{"title": "Work with That", "album": "In My Own Lane", "year": "2017-03-03", "image": "https://images.genius.com/981b0f303160b4ab4a939dc6490c72c1.1000x1000x1.jpg", "lyrics": "[Intro]\nYung Felix\n\n[Verse 1]\nI got 99 problems in this bitch now\nMoney ain't an issue 'cause we rich now\nGotta bunch of new bitches on my shit now\nAin't it funny how these hatin' bitches switch now\nI ain't trippin' on you bitches on the side line\nAll these ugly mothefuckers on my timeline\nMade something out of nothing while these bitches frontin'\nBlew a grand from pitching on the hot times\nBaby, I can be your motivation, behind your business\nAin't no hustle then it's no relatin', crime for instance\nIf it gets you, so we know we kick it, yeah, we kick it\nAll we're doin' ain't no overstatin', ain't no fakin'\nKeep my dollars circulatin' like a ceiling fan\nI done shitted on you bitches and you're still a fan\nAnd this ass top a saddle, I could kill a man\nSold out shows on you hoes 'cause I'm in demand\nLike that? That? Like that?\n\n[Chorus]\n(Woohoo)\nI could work with that\nI drop it low then I flip it\nYeah, I'm workin' that, you digg?\nI can work with that\nTurned a gram to a grand\nI can flirt with that, you digg?\nI can work with that\nIf I throw the thang on you\nThen I'm hurtin' that, you digg?\nI can work with that\nYeah, I can work with that\n\n[Verse 2]\nHoe I work that shit like a 9-to-5\nThrow it back on his lap so it's on a rise\nIf it ain't about the money then it's no replies\nOnly kushy on the paper so you know we high\nBitches started with a dream, made a meal ticket\nMe and my day-one bitches, yeah, we still kick it\nWhen you poppin' bitches hatin', yeah, they feel with it\nI ain't worried 'bout the drama, bitch, you deal with it\nBut when I come around I can hear you whisper\nPussy made, I'm just looking for your whiskers (Uhh)\nWhere them bitches tryna diss us\nI got the game wrapped up, Christmas\nBlowin' kush, clouds comin' out the window\nShould be knockin' bitches out, call it Kimbo\nFrom the windows to the wall\nI'm poppin' bottles 'til they yell last call\nYou know, you know\n\n[Chorus]\n(Woohoo)\nI could work with that\nI've drop it low then I flip it\nYeah, I'm workin' that, you digg\nI can work with that\nTurned a gram to a grand\nI can flirt with that, you digg\nI can work with that\nIf I throw the thang on you\nThen I'm hurtin' that, you digg\nI can work with that\nYeah, I can work with that"}], "artist": "Lil Debbie"}