{"songs": [{"year": null, "lyrics": "[Produced by Ryan Hemsworth]\n\n100s, let's do it\n\nNigga, it's the bowtie killa\nLeather Jacket Mike Jack Thrilla\n\nLicensed dick dealer, Miller cap peala\nBlowin hundreds in the presence of niggas that rap, killa\nLate night hunts for cunts, hoes, and dick feelers\n\nNigga, it's the one double O, what the shit do? (100s)\nYou don't know a nigga name, but ya bitch do\nAnd she ain't even 'forty-two' when I slid through\nNow the bitch'a line up on the page I done flipped through\n\nNigga, I'm raw like the night you fucked up\nWhat you left up in that bitch' that she shoulda sucked up\n\nBad hipster hoes shoppin' at the thrift store\nSkinny nigga permed up, ashin' out the window\n\nOne laced up, niggas asked me how I learned that\nFuck 'em from the back, and when I'm cummin tell her \"turn back\"\n\nNigga, I'm a cold mack, get it how how you live, huh\nBut I never slip they tryna have a nigga' kid, huh\n\nBad hipster hoes shoppin' at the thrift store\nSkinny nigga permed up, ashin' out the window\n\nBut I never slip they tryna have a nigga' kid, huh\n\n[Outro: Scene from the 2010 movie, \"Due Date\"]\n\n(In order of appearance: Zach Galifianakis as Ethan, Juliette Lewis as Heidi, and Todd Phillips as Barry)\n\nETHAN: \"Nice perm, man. Well done, well done on that perm.\"\nBARRY: \"Aw, thanks bro, it's not a perm, it's natural. Who gets perms anymore? Don't tell me, is that a perm?\"\nETHAN: \"Yeah.\"\nHEIDI: (laughs) \"Oh my God you did not perm your hair!\"\nBARRY: \"Where do you even get those anymore?\"\nHEIDI: \"Yeah, I know! I was like-\"\nETHAN: \"I was just kidding about- this isn't a perm.\"\nBARRY: \"Excuse me?\"\nETHAN: \"Th-This is not a perm, I was joking.\"\nHEIDI: \"Oh my God! Thank God! cause-\"\nBARRY: \"You got us.\"\nHEIDI: \"I was li-\"\nBARRY: \"You got us both.\"\nHEIDI: \"You know all these fucking jerk offs get perms.\"\nBARRY: \"That was good.\"\nHEIDI: \"That was hilarious.\"", "album": "Ice Cold Perm", "title": "Hemsworth Outro", "image": "https://images.genius.com/98d3e3369facf82ee69688c5e541f1f3.1000x1000x1.jpg"}], "artist": "100s"}