{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/da74b73cefd6be6333ed5bdf76d8bc1b.1000x563x1.jpg", "title": "Christmas in Miami", "year": "2018-12-23", "album": null, "lyrics": "[Intro]\nAyy, I don't know if I wanna call this detox ’cause I'm like... I'm puttin’ away a lot of old shit just so I can be with this one individual, but at the same time, all I really want for Christmas is her\n\n[Verse 1]\nI put the Glizzys down so I could be with you\nI put the Remy down, I don't want no more of this juice, yeah\nI put the Henny down, I'ma throw away the Goose, yeah\n'Cause I be showin' out, another side of truth, yeah\nIndia, I had loved you like you mine, babe\nYou was runnin' all through my head, you gave me migraines, mmm\nI cannot lie and say that I'm fine\nTook another sip to write this rhyme, ooh\nI cannot lie and say that I'm fine\nTook another bitch to ease my mind, ayy\n\n[Chorus]\nNow I’ma spend my Christmas in Miami\nI’ma be in Miami, I'ma be in Mi—\n\n[Verse 2]\nI’m from Broward, but my lady from Miami\nI'ma hit her with no Jim Beam, show her to my family\nThey so curious, but we not into y'all\nShe say, \"Period,\" I be like, \"Periodt\"\nShe can have any nigga, I can get like any broad\nShe don't be milkin’ me, but she be milkin' y'all\nI know you prolly dealt with a few celebrities\nBut I don't even care, I need you next to me\nCan you see the best of me? Want you to marry me?\nWould you say yes to me? Want you to marry me this year\nEven get down on my knees, pull out that carat ring\nAnd don't embarrass me, want you to marry me this year\nAm I movin' too fast? 'Cause I'll slow it down\nYou the only reason I felt like puttin' down my four pound\nYou the only reason I ain't runnin' 'round with them hunnid rounds\nSlidin' 'round in an opp's town, you the only reason I ain't locked down\nI just wanna love you, baby, just don't make no fool of me\nI know on your birthday I ain't gotta buy you jewelry\nI know on your birthday I ain't gotta splurge you\nJust because it's Christmas, you don't need a Birkin\nAnd you all I want for Christmas\nYou all I want for Christmas\nYou all I want for Christmas (It's you, love)\n\n[Outro]\nIt's you\nIt's you\nI know it, I know it's you"}]}