{"songs": [{"year": "2015-10-29", "album": null, "image": "https://images.genius.com/d5f2518d05e1e268519d4855ae3d5889.429x429x1.png", "title": "Back to Back (Remix)", "lyrics": "[Intro]\nOh lawd, oh lawd, oh nah!\nOh lawd, oh lawd, oh nah!\nKnowledge, oh lawd, oh lawd, oh nah!\nLawd!\n(Nineteen)\n\n[Verse 1]\nNow tell 'em all i'm educated\nI don't make assumptions\nOr come to conclusions\nIllusions are for the uninformed\nYou endorse and you idolize\nI was torn and I finalize\nConnoisseur for these final rhymes\nI'd outsource 'em but I need some time\nEither ride but I'm in inside\nSee the lies that you finish\nThese, other guys a bit timid\nNo, different mind could've did this\nI'd, terrify 'em these sinners\nThat, victimize with a vengeance\nVandalize what my image is\nTantalize with a temper\nTo, -talitarian entity\nMy energy and my intents\nAre at a crossroads\nIn this current moment\nI feel alone I got no companion\nBut the dis- demand\nWith a fist of fury I'ma lift ya spirits\nAnd you're hard of hearing\nI'ma start revering\nThis flow is searing it's a truth serum\nYou could take it in and try to accept it\nLongevity and that's no exceptions\nI stay impressed I'm with the fuckin' exit\nIf I spit it quicker they won't get the message\nI'ma steady blessin' or a convalescence\nAnd a concession with a commodore\nCall Lionel Richie got a minor issue\nIn a mausoleum with a citadel\nAnd I wish ya well but I must admit\nThat I'm a son of a bitch\nI brought vocab and I need help\nBut no new opinion\nThey get an event and I'm packin' a pen\nSo for the cynical answer with a seminal vantage\nAnd a blank canvas go past the vapors\nWith a master maker and a mastermind\nI put the past behind me in a pathfinder\nAnd I pass a rapper with a fast cadence\nI'm a pissed tyrant and a bad giant\nBut I made it possible to make it real\nI put it on a page 'cause that's the way I feel\nThere's no major deal that's gon' satisfy me\n'Til the rest of y'all can see the real truth\nAnd there's a nice view that I chose for instance\nCome and witness, there is no forgiveness\nPlay 'em on position murder opposition\nAnd the competition in my composition\nYou could feel the pain and I done been insane\nI got a lot to gain and not much to lose\nAnd I am out of control with my reckless moves\nThis blasted femur is a dead man\nBut I lost faith in my own religion\nGain false repentance with a palm of pennies\nOn Psalm Sunday but the congregation\nEverybody's sinning but it's so salacious\nSo the motivation for the rest of them\nAnd I been wrestling with my sanity\nSo sad to think, don't pity me\nThe epitome of putting work first\nI be going in it 'til I'm in the dirt\nI took a lot of pride in writing every verse, lawd!\nW-W-Woo child, errybody lie, errybody lie\nTell me how the fuck do you believe 'em\nNigga, you believe 'em, said the devil is alive\nDoin' well, takin' souls, I can feel that evil nigga breathin'!\nAttack the track I got a wob effect and I emaciate 'em\nWith a minor lecture, and the kinda texture\nWith a fine example of a [?]\nAnd the poorer chances of a peaceful poet\nTakin' losses, decomposin'\nDedicatin' it to show ya focus and regulate it\nTo evade the vultures and I made the most of my situation\nNo time to waste or procrastination\nNever speak of favors, can't hesitate\nI gotta work a lot and give a better effort\nThat's the only way that I'ma be remembered\nDismember beats and detach the retina\nI'ma suffocate 'em with the visceral language\nAnd I mutilate 'em with the minimal madness, lawd!\nI think it's funny tell me where they focus at\nI see social injustice, they wonderin' who wrote a rap\nThe poster child for loneliness opposing what reciprocity\nElimination of this nefarious negativity\nSome LSD in my pineal gland\nFluoride inside of the water we drinkin'\nIf you understand what the fuck that I'm sayin'\nThat would make you part of a smaller percentage\nOf people that live with a heightened awareness\nIf I did not have it I would be embarrassed\nI see the agenda to murder our consciousness\nI am convinced, goddamn, lawd! (Lawd)\n(Eh, oh lawd, oh lawd, oh lawd, lawd)\n(Oh lawd, oh lawd)"}], "artist": "K.A.A.N."}