{"artist": "Canibus", "songs": [{"title": "2000 B.C. (Before Can-I-Bus)", "album": "2000 B.C. (Before Can-I-Bus)", "year": "2000-07-18", "image": "https://images.genius.com/d82e864dd2818cb9fa427598151c5f52.266x270x1.jpg", "lyrics": "[Verse 1]\nMy offense is a mixture of Mike and Muhammad\nKnock a nigga unconscious and talk shit\nIn bare-knuckle boxin', speed is the object\nWeavin' and dodgin' with defensive blockin'\nSo in the ring, you cannot win\nThe top ten become nine dead if I ever decide to hop in\nWith the one-two, one-two shot to the chin\nKnock you out, like ten shots of vodka and gin\nThe beautiful blend of power and strength\nFrom the top of my head, down to where my toe cuticles end\nI verbally burn a nigga, lyrically hurt a nigga\nPut a voodoo verse on a nigga, Kennedy curse a nigga\nWho can spit the words quicker than the average man?\nWho can embarrass a man? Bite you with fangs\nAnd mangle your hands on candid cam? The Canibus can\nThe Canibus can, with the stamina to damage a man\n\n[Hook]\nIt's been a long time, I shouldn't have left you\nWithout a strong rhyme to step to\nI told y'all, (C'mon!) I roast y'all, (C'mon!)\nSo come on, (Hold on!) hold on!\nIt's been a long time, I shouldn't have left you\nWithout a strong rhyme to step to\nI told y'all, (C'mon!) I roast y'all, (C'mon!)\nSo come on, (Hold on!) hold on!\n\n[Verse 2]\nYo, I spit for it, rhyme for it, live for it, die for it!)\nBack out the 9, commit a homicide for it\nIf I'm handcuffed with the right to remain silent for it\nI'ma blow trial and do the federal time for it\nYou mad at the last album, I apologize for it\nYo, I can't call it, motherfuckin' Wyclef spoiled it\nBut this time for '99 I got 5 on it\nYou should double up and put a dime on it\nMatter of fact, triple your nickel and put 14.99 on it\nI'ma shine on it, watch Flex drop the bomb on it\nAbout ten times on it, watch people call a request line for it\nCipha Sounds keep pushin' rewind on it\nLook out for the album with the Canibus design on it\n12 o'clock in the morning you'll be standing on line for it\nI'm a live poet, with a sharp ear and eye for it\n‘Cause I tear down mics and put a out-of-order sign on it\n\n[Hook]\nIt's been a long time, I shouldn't have left you\nWithout a strong rhyme to step to\nI told y'all, (C'mon!) I roast y'all, (C'mon!)\nSo come on, (Hold on!) hold on!\nIt's been a long time, I shouldn't have left you\nWithout a strong rhyme to step to\nI told y'all, (C'mon!) I roast y'all, (C'mon!)\nSo come on, (Hold on!) hold on!\n\n[Verse 3]\nYo, I rip shit with the ballistic characteristics\nOf a hollow-tip at point-blank distance\nI flip shit when I spit shit; Father, forgive Bis\nI just snatched the Jesus piece off some Christians\n‘Cause they sounded like idiots\nThey went from silver to gold to platinum\nAfter the millennium they'll probably be wearing Iridium\nThey so gassed, if a bitch sucked they dick\nThey'd probably cum helium\nY'all niggas can't be serious, I was nice before ice\nBefore Christ, before the words, \"Let there be light\"\nAnd a light took over the night, I was born with a mic\nLord of the mic, before all plant and animal life\nTook this rap shit to new heights\nBefore the Wright brothers took flight\nBefore dog fightin' and aerial strikes\nBefore MC's picked up pens and started to write\nBefore promotional marketin' and posterlights\nThe Can-I-Bus'll bust up mics, punch out lights\nPunch out your motherfuckin' eyesight, for the title bout fight\nAsk Ty Fyffe, I snatch the track for half price\nThe Canibus is too nice; give me that mic!!\n\n[Hook]\nIt's been a long time, I shouldn't have left you\nWithout a strong rhyme to step to\nI told y'all, (C'mon!) I roast y'all, (C'mon!)\nSo come on, (Hold on!) hold on!\nIt's been a long time, I shouldn't have left you\nWithout a strong rhyme to step to\nI told y'all, (C'mon!) I roast y'all, (C'mon!)\nSo come on, (Hold on!) hold on!"}]}