{"artist": "AZ", "songs": [{"title": "Can’t Stop", "image": "https://images.genius.com/f7164c7711f98cbf75acb3b0f523d851.744x728x1.jpg", "album": "A.W.O.L.", "lyrics": "What's the use of me of me foolin myself?\nNo matter what I keep tellin myself...\nWhat's the use of me of me foolin myself?\nNo matter what I keep tellin myself...\nWhat's the use of me of me foolin myself?\nNo matter what I keep tellin myself...\nWhat's the use of me of me foolin myself?\nNo matter what I keep tellin myself...\n\n(I don't believe this... I'm makin all these moves.. for\nWHATT???)\n\n[Verse 1]\nI do me for a G Note, niece, she's yellin Nemo\nMama bear, she there, losin hair cause of the chemo\nEvery door buzz, little cause see at the peek hole\nSwearin he holdin heavy, hidin out from the RICO\nCoke sold by Chico out the corner bodega\nHim n Bobbito... la familia now finito!\nIt's deep tho, its like my soul was stole by the repo\nResowed in Carlito, and retold on Tivo\nIce cold wit a ego, dice rolled and somebody's Deebo'd\nTrios expose dikes on the D' Low\nIt's love wit my amigos, other niggas they freeload\nYeah he hold, but my homeys only unload torpedoes\nSo please yo, I'm from the killa cap of the kilos\nWhere niccaz clap, and fat bytches get yapped for\nTheir cheetos, its re-al\nBut still blocks is hot like veal\nSo cock block, or cop shot, nothin stops the P.O\n\n[Hook]\nWhat's the use of me of me foolin myself? (lalalalalaaa\nLalalalalalalaaaaa)\nNo matter what I keep tellin myself... (Won't Stooooopp\nCan't Stooooooop)\nWhat's the use of me of me foolin myself? (lalalalalaaa\nLalalalalalalaaaaa)\nNo matter what I keep tellin myself... (Can't Stooooopp\nWon't Stooooooop)\nWhat's the use of me of me foolin myself? (lalalalalaaa\nLalalalalalalaaaaa)\nNo matter what I keep tellin myself... (Won't Stooooopp\nCan't Stooooooop)\nWhat's the use of me of me foolin myself? (lalalalalaaa\nLalalalalalalaaaaa)\nNo matter what I keep tellin myself... (Can't Stooooopp\nWon't Stooooooop)\n\n[Verse 2]\nWifee want an abortion, her parents divorcin\nGranted, I understand it, but my mans in a coffin\nWho planned it? I guess they panicked, cause they left him in Boston\nHe died.... for a pie, identified by his porcelains\nIt's caution, Unc just got a chunk of some fortune\nBossin, I guess the paper supportin extortin\nTossin it to them dealers, takin it like Lakers did Portland\nCases is costin, so faces won't make it for talkin\nIt's basics, they mistake once they replace it for flossin\nIt soften, never high when dividin my portion\nWhy forever fly till I die, dry from exhaustion\nMove accordin, like they keys on a organ\nNo sneezin or coughin, I weeze when I'm walkin, indeed\nWe under siege from those D's cause they stalkin\nCars is auctioned, homes is seized\nOG's extortin the seeds, now its the new breed absorbin\n\n[Hook]\n\n[Verse 3]\nThe names is changed, the games the same\nIt's playin fair, but years of Nightmares, like Dana Dane\nIt ain't clear, but I'm right here still and sayin the same\nRefusin to shed a tear, tho the pain done came\nProvin I played the game, from cocain to fame\nFrom rope chains, gazelli frames, I remain to blame\nIt's deep, but never speak certain names in vein\nI know beef, and when it peak, it can strain the brain\nNo police, its just creep creep, bang for bang\nNo grief, brothers deceased, others arraigned and hang\nNone of us just eatin, maintain the strains\nThe streets is just the streets, when it rain it rain\n\n[Hook]", "year": "2005-09-06"}]}