{"artist": "ILL BILL", "songs": [{"title": "Metal Music", "lyrics": "El Gant, Ill Bill\nYeah, ?\nIt officially starts now\nEl Gant and Ill Bill, ha\n\n[Verse 1: El Gant]\n\nI’m giving you something you’ve never seen\nListen close, this is not a dream\nWake up from surgery, feel the doctor poke at your spleen\nI’m from a place cause a racist cop will choke out a teen\nThen leave him slumped in the street and beaten\nThat’s how it seems\nYo, what the fuck you mean? This life ain’t natural\nDon’t make touch on government, the streets are like the capital\nAnd Christianity is magical, they make you think\nThat you cannot finish a date without smoking, I’ll take a drink\nThis is not a story, some think it’s all a game\nMost of us sold to the Devil just for a taste of fame\nAnd so they pull something heavy, metal splatter your brain\nIt’s not a game when you watch a pistol shatter your frame\nIt’s pain and pleasure, you mix a little together\nThen let it rise to the top and then popping, you get the measure\nThe president is a veteran sodomizing his people\nTo make you believe the words that he’s speaking\nNaturally evil\n\n[Hook]\n\nThis is that heavy metal shit\nDon’t even meddle with\nI keep a four just in case yo I gotta settle shit\nYou ain’t a veteran, I got some medicine\nDon’t even act like you’re tough, homie\nYou’re better then\nAnd this ain’t for the radio, don’t even play it, ho\nThe metal music to lose it, you know it’s crazy yo\nAnd this is how it’s going down, let off a hundred rounds\nOf metal music now can you hear the sound?\n\n[Ill Bill]\n\nI’m giving you heroin for your ears\nListen close, homie. This is dope\nGet your adrenaline pumping like you was sniffing coke\nRide the lightning, cult leader my mind’s frightening\nI drink blood from a human skull like a Viking\nTo toast the death of my enemies\nI command an army of blood thirsty murderers with heads like machines\nI’m the future of this piece of shit scene\nAbandon all hope and these fake fucking faggots\nI’mma snatch up all their bling\nGot you stuck in the moment, zoning advanced but fucked up like cloning\nI’m the evolution of super soldiers\nHuman vultures, better yet I’m exploding like super novas\nMoving in circles of tyrannical goons with toasters\nThe face of the Devil, chased by the bass and the treble\nThe gunfight erupts amongst fallen saints in the temple\nThis is Ill Bill making the metal bang like Slip Knot\nWith twin Glocks, thirty-six shots, you get your wig popped\n\n[Hook]\n\nIt officially starts, the takeover, the takeover\n\n> > Lyrics posted by heroin4yourears < <", "image": "https://images.genius.com/99ff63951f21bd5532d81bd64d3cbd69.800x800x1.jpg", "album": "ILL Bill Is The Future Vol. II", "year": null}]}