{"songs": [{"year": "2010-10-22", "album": "G.O.O.D. Fridays", "image": "https://images.genius.com/563716f20ff9212ae1281fc81940314d.946x946x1.png", "title": "Don’t Look Down", "lyrics": "[Hook: Mos Def]\nDon't look down, it's an impossible view\nFly like an eagle, whatever you do\nDon't look down, it's an impossible view\nSpread your wings, aerial\n\n[Verse 1: Lupe Fiasco]\nHead's in the sky, wings raised and\nShe's about to fly, and take her place in\nOut there in the stars, when she leaves the ground\nShe'll see a broken heart, if she turns around\nBut ain't no going back, this is how it must be\nHe told her she'll be burned alive, she just told him, \"Trust me\"\nIf funerals are beautiful, this ugly\nKnowing this, he told her, \"You won't leave me if you love me\"\nAnd he knows that, because he knows her\nHard to hide his feelings, as it engulfs her\nNow she's a bright blaze, light rays\nA shooting out, a phoenix on fire burning up the nightscape\nSo let's hear it for our heroine\nApplaud as her spirit just flies into the never-end\nOne closed chapter, it opens up another part\nSo this is more like, \"The end, question mark\"\n\n[Hook: Mos Def]\nDon't look down, it's an impossible view\nFly like an eagle, whatever you do\nDon't look down, it's an impossible view\nSpread your wings, aerial\n\n[Verse 2: Kanye West]\nDon't let me hold you back, I only hold you back\nWe're on a dead-end street, this block has got a cul-de-sac\nSo fly baby, my baby so high\nSometimes it's so hard to say bye\nWe made it from the alley, straight up to the valley\nWe pulled up at the valet, we'll teach our daughter ballet\nWe'll raise us a Beyonce, maybe she'll be a Halle\nYou woulda been the best mom, I woulda been the best 'Ye\nYou see it all in my veins, like varicose\nI know that's very gross, but we getting very close\nTo our end, though I kill most with a pen\nSoon as this flow end, I'ma let Mos begin\n\n[Hook: Mos Def & Kanye West]\nDon't look down, it's an impossible view\nFly like an eagle, whatever you do\nDon't look down, it's an impossible view\nSpread your wings, aerial\n\n[Hook: Kanye West & Big Sean]\nDon't look down, it's an impossible view\nFly like an eagle, whatever you do\nDon't look down, it's an impossible view\nSpread your wings, aerial\nDon't look down, it's an impossible view\nSpread your wings, aerial\nDon't look down, it's an impossible view\nHow could you do it? How could you do it?\n\n[Verse 3: Big Sean]\nOkay now baby here we go, we go, no baby, me go\nYou got my heart, baby this what it beat for\nI give it all, walk as far as my feet go\nWhat you mean \"me go?\" Why can't it be \"we go\"?\nWhat happens when people turn to tears? (huh?)\nDreams turn to memories and weeks turn to years, huh?\nBeen standing in the same spot for a couple of weeks\nGive me my feelings back, wish love came with a couple receipts\nMan, our vacation was coming next week\nGirl, I swear you was a trip, let's make it a couples' retreat\n(Do it!) How could my girl do this to me?\nWoke up to a note saying \"The world did this to me\"\nNow I'm testing, one-two, reporting live from the rubble\nDrinking all I can so I can turn to fire when I hug you\nOne, two, three, four, five models on the double\nGive me head all at once, look like they lying in a huddle\nBut it's not even half the feeling\nAs hearing your \"Seans, you know I love you\"\nShedding tears everyday (I know you do)\nAnd I'm tired of lying in these puddles\nI ask \"Why?\" sometimes like a fucking vowel\nBeen hitting trees everyday like a fucking owl\nTrying to get high enough to cut the clouds\nOf the Phoenix Sun and Nash it out\nI mean ash it out so I could see you smile\nI-I know you can see me now\n\n[Hook: Mos Def]\nDon't look down, it's an impossible view\nFly like an eagle, whatever you do\nDon't look down, it's an impossible view\nSpread your wings, aerial"}], "artist": "Kanye West"}