{"artist": "AZ", "songs": [{"title": "It’s a Boy Thing", "image": "https://images.genius.com/35afe30eb73450ff393ecfb0e427ce61.500x500x1.png", "album": "Pieces of a Man", "lyrics": "[Produced By Trackmasters]\n\n[Verse 1: AZ]\nYeah...Where's it at?\nFrom Coke to Dope, gettin' it on the outta state strip\nStar Trek was the stamp pass some outer space shit\nIce the bracelet, 3 karats, custom made shit\nLove or hate it, had two bitches playin' day shift\nKept a cheese line, security, holdin' three nines\nI'm tryin' to see mines, knowin' diesel's on the decline\nWhip the work up, more than traffic, who's the first up?\nSee them young cats fuck wit that Crack, but be the first stuck\nToo many on the same block, same talk\nIn fact they all probably cop from the same spot\nI'm heavy in it, every car got the celli in it\nDash board Armor Alled up, cherry scented\nTrees mixed wit it, different pagers every minute\nPlay the block smell like Issey Miyake, I'm buried in it\nIt's boss playin', respect the lifestyle I'm portrayin'\nPlay the streets wit a freak up in my loft playin'\nNickel nines, my prime young duns'll stick you blind\nTold the only way to get doe is if you grind\n\n[Hook: Nature]\nSome thugs have all the luck\nWhile some thugs feel all the pain (Feel that)\nLocked up doin' major time, or on the block still caught in the game\nIt's a boy thing (Morphine, Quine Nine...Yeah)\nIt's the dope game (Bonita, Thiedga, shoot it, sell it, snort it)\nSome thugs have all the luck (We got this)\nSome thugs have all the fame\n\n[Verse 2: AZ]\nSo now it's platinum, diamonds, and gold, we all hold\nCars we all drove, hoes we all know\nShorts in the summertime, minks for the snow\nBitch ass niggas got back snitched on the low\nIt's funny how the Feds always knew where to go\nIt's our price, dope & vice, watch me blow\nIt's real shifty, brought fam to get ill wit me\nToo many 50/50 niggas tryin' to chill wit me, build wit me\nPlus my connects still hit me\nWhat nigga? Nine on the cut, shit is crispy\nWhat makes a man? Most y'all niggas fakin' y'all hand\nWrong shit up in you cake mix takin' your grams\nIf you a hustla do it like the hustlas do\nClientel first before you try stretchin' your stew\nBig boys play for large sums\nStack up, strategize, watch the cars come\nIt's all a game, never get caught in the fame, or short your change\nBoy is a slang for Dope, girl is Cocaine\nYou no name, knock a Ki of work in a week\nThrough word of mouth came the clout, now I'm hurtin' streets\n\n[Hook]\n\n[Verse 3: AZ]\nControl all the mad money, 98 Jag money\nBrag money, the type killas wanna bag from me\nName ringin' medallion on my chain swingin'\nWe mastered, soldiers even in the rain slingin'\nTurkeys on Thanksgivin', lovin' the chips\nSeven day trips, bitches just lovin' the dip\nCan we live? No more safe boxes in the cribs\nJust bank accounts, different ammounts, fuck a bid\nWe slow grindin', lady friends co-signin'\nLegit jobs, houses, & cars, but no shinin'\nLife or death, learnin' new steps, right from left\nPreciseness, where I end off you bite the rest\n\n[Hook x2: Nature]\n\n[Outro: AZ]\nGame don't stop... Wha... You know the kings, we know the kings, it's Like this y'all...VIP... Ved bag, dope thinkin', niggas gnawin' off this shit, huh, 98, huh, ya hear? Ghetto Fabulous baby, What the fuck? We out", "year": "1998-03-26"}]}