{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "Macula’s Theory", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Intro: Big Daddy Kane/Count Macula]\nAight, tell me this:\nIf you got 36 prostitutes, and 30 cents in your pocket\nWhat you got?\nProof that hoes come a dime a dozen, baby\nUh huh, yeah\n\n[Verse 1: Big Daddy Kane/Count Macula]\nI mastered the craft on the way to keep em strung\nThe niggas wanna keep my name from off they girls' tongue\nSo many brag and boast and like to play high quotes\nAlways promising Thomases and can't cook toast\nThinking that the macking game is just a fashion show\nNot realizing that the rulers get the cash and go\nPull up a chair young and notice that the lesson that I'm telling, B\nHow to Be a Player better than Bill Bellamy\nMy tongue commits the felony, here's how I gotcha\nTo do the things your momma told you not ta, I shot ya\nCollect as much product as my mouth'll get\nAnd plus, I keep my game in order like the alphabet\nMr. Spectacular, better known as Macula\nAt this pimpin', a Legend just like an Acura\nI lay down the law at the door moment that I get wit her\nThe female predator, et cetera, et cetera\nBetter to come on in, the hustle's good, so why knock it?\nThen watch the way I lock it, straight ballin, corner pocket\n\n[Chorus: Big Daddy Kane/Count Macula]\nAnything goes when it comes to hoes, cuz pimpin ain't easy\n(\"What you see is what you get\")\nAnything goes when it comes to hoes, cuz pimpin ain't easy\n(Macula, he done struck again)\n\n[Verse 2: Big Daddy Kane/Count Macula]\nYa stepped into the playin field, I don't know what you're thinking\nCuz game can smell game, and right now, your ass is stinking\nMaking my presence known, see, I only do it vague\nNowadays, playa-hating's going around just like the plague\nBut re-gardless, I'm on some play-hard shit\nMy body's used to all them, I was on the graveyard shift\nSurvival of the fittest, now all you niggas try to get this\nWhile y'all making love, I'm making love into a bid-ness\nNow, what's the matter, no confidence within your data?\nI seen you tripping since I first started lookin at her\nAnd if she peep, you know that she'll creep\nAnd if you sleep, then that'll be just one you won't keep, uh\nNow, boy, you know you need your ass whipped\nFor holding on her hand as if ya goin on some 1st grade class trip\nYou feel unable, to keep her in your stable\nAs she listens to the bubbly that's poppin at the next table\nLife's finer things, victory is mine again\nYa tryin to win, but gotta come way better than those Heineken's\nShe feel amazed by the game that I be usin', and now she choosin\nAnd you done came up as the one that's losin\nThe smooth crimin-al as I muscle in\nGrand theft hustlin, Mackula, he done struck again (\"Oh Lord!\")", "year": "1999-02-23"}]}