{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/bff1176ed6deb6d256cc9e04734b0136.365x365x1.jpg", "title": "Sick", "lyrics": "[Intro: Bounty Killer]\nHuh!!! From J.A. to T Dot, huh!!! respect big you should see that\nAy Yo!!! Yallo!!! Huh!!! It's Bounty Killer and Kardinal\nAy yo!!! Yallo!!! Look at dat lord mi gal\n\nK: Huh! And we do it like huh!!!\nB: They should know\nK: Oh!\nB: That's right!!!\nK: Yeah, ok, a yagga yagga yagga yagga yo yo!!!\nB: Lord have mercy\n\n[Kardinal Offishall]\nHuh! Yeah! A yagga yagga yagga yo yo yo\nIt's Mr. Kardinal comin through my niggas, good morning!!!!!\nAre you ready, ok, here we go\n\n[Bounty Killer]\nLord have mercy\n\n[Verse 1: Kardinal Offishall]\nMi sing seh, Kardi Kardi, he likes to party\nHe cause nuff trouble, drinks a little bacardi\nHe's, just the man who's on the mic\nAnd when he's walkin through a club he likes the skins tight\nFor all a y'all thinkin he rhymin well\nIt's just to see you smile and enjoy yourself\nCause it's cool when you cause a Kardi condition\nTo spread peace and love ay yo that's my mission\nSo a listen, a to what we say\nSilverhouse makes the funky rhythms everyday\n(Bounty Killer: That's Right)\nI, wake up around eight O' clock in the morning\nPractice all my verses cause we soon on tour and\nGo to the bathroom to wash up\nThinkin 'bout the last female who just got stuck\nAnd say, mirror mirror, on, the wall\nI know I'm type fresh am I fresher than the mall?\nYes yes y'all, five minutes it lasted\nMy girls got my money like I'm Old Dirty Bastard\nThe vibe I spread not just for show\nI get ew Kardinal steady runnin things, still\n\n[Chorus: Bounty Killer]\nMi sing seh, when rudebwoy inna di place\nNot a funny man can't chat inna mi face\nStand up for di people represent fi every race\nRockin to di rhythm and we bangin to di bass\nMi sing seh, Killer Kardinal inna di place\nWatch how di hot gal dem a whine up dem waist\nAnywhere dem legal mi a follow di trace\nSoap man a soap out fi deal with dem case\n\n[Verse 2: Kardinal Offishall]\nYo! Yo! Yo! Bust the ill gramatics hip hop fanactics\nPorno stars couldn't cd my tactics\nY'all might see me up on your MTV\nSo then F the president the government and the beast\nWe do the biznass while dealin with business\nDoin pushups at your wife's house for fitness\nAnd say I never been there and swear on the goodness\n(Bounty Killer: That's Right!!!)\nSome chickens callin me the royal hoodness\nPut these rhymes in your magazine for measure\nThe triple XL wrapped strapped to give ya pleasure\nDroppin some conscience thoughts and at leizures\nTwistin theoretical thought patterns to seizures (Word)\nManeuverin mic mishaps to make some, classic type content\nCleanin up the fake out the average listener, lookin for the cursor\nLook here, do I look like the average person?\nSix foot four mom said don't talk to whores\nSkettles are floozies my attitude's choosy\nSo speak up when your addressin the name\nAll I want the assets y'all keep the fame, still\n\n[Chorus: Bounty Killer]\nMi sing seh, when rudebwoy inna di place\nNot a funnyman can't chat inna mi face\nStand up fi di people represent fi every race\nRockin to di rhythm and we bangin to di bass\nMi sing seh, Killer Kardinal inna the place\nWatch how di hot gal dem a whine up dem waist\nAnywhere dem legal mi a follow di trace\nSoap man a soap out fi deal with dem case\n\n[Verse 3: Kardinal Offishall]\nYo yo yo yo!! Curse if you must cause my whole crew buss\nSo big that the streets nickname my mic notorious\nGirls rush to try to blow us like dust\nBut we avoid the lust and remain like Cold Crush\nMy whole team victorious, old school like Amadeus at the Apollo\nPop lockin for Rollo sippin on the white bottle\nRight from T Dot or peace tommorrow\nBut no squabble just necks gettin throttled\nYou thought it was a bottle it was just self control\nFrom me knockin you the fuck out layin you out cold (God Damn!!!)\nStop talkin let your records do the walkin\nWhile I'll be laid up in jamdown sylarkin\n\n[Bounty Killer]\nFrom Jamaica back to T Dot\nKiller Kardinal a rip di place tell dem a we dat\nGirls a scream and gallang like dem a idiot\nWe have dem weak and everybody see dat\nPerfect lady mi a wonder if a she dat\nWoman a mi dream this girl wanna be dat\nPhat in her jeans Kardinal him would a squeeze dat\nPut on di ring and di Killer nah go leave dat\nI'm fallin, could you believe dat?\nEverything she have fi offer mi waan retrieve dat\nFashion and mi love you know seh she gwaan receive dat\nLegacy mi real estate she a achieve dat, you must believe dat\n\n[Outro: Kardinal Offishall]\nFire!!! Yeah! Niggas is gettin nerrrrrrrrrrrrrrrrrrrrrrvous!!!!!!"}], "artist": "Kardinal Offishall"}