{"artist": "Watsky", "songs": [{"year": "2009-10-14", "lyrics": "[Intro: Justin Bieber]\nOh whoa\nOh whoa\nOh whoa\n\n[Interview: Watsky & Justin Bieber]\nHey! Justin! It's great to see you again, man!\nWhat's up, how are you?\nSo, today...uh... We're going to talk about love\nIs that cool to you?\nI mean, I'm not -I'm not a expert about love or anything\nI'm still learning, I'm still... trying to get the process\nWell... When was the first time that you fell in love?\nIt was at, like, church\nYou fell in love with Jesus?\nUhh, no\nBasically, this girl, who was dating this guy\nBut broke up with her so and she... I want to make her\n'Cause she was lonely, \"one less lonely girl\", and da-da-da\nAnd... yeah. Or in a car\nNow see, I'm talking about love and you're talking about something carnal and raunchy\nUhm...\nI mean, what is love to you? Why do you think that love is so special?\nI think it feels good\nYou are so young...\nAlthough I will say that I'm like...\nImpressed and I don't really get how you find a time with your career\nUm, what do you mean, like, when do I do it and when do I find time?\nLike, I just do whenever I fit in space, but, like...\nOh, you're a quickies man\nYeah\nAlright, back to the car story\nThis just feels so weird, we're in the back of a car, uhm....\nSo, so... At that point...\nYou're in control, but...\nYou have to make her feel like you're uncomfortable, because...\nThat's your image\nI'm a beast. Sweat machine\nAnd that's when you take your shirt off\nThis one in, I just want in's!\nYou just need practice\nI mean, I'll go out with anyone I really fall in love with, I guess\nYou're... A bit of a tramp\nYes, you're gonna write single and write it mingle. Down there\nI think you're going to be alright man\nYeah, I'm just looking forward to, uh, just...\nBeing successful in whatever I do\n\n[Outro: Watsky]\nThis... Is for those among us who got enough play\nFor twelve grades to carry on a upside down teaspoon\nFor every kid who could've counted their highschool\nHook ups on two hands tied behind their back\nFor every wall flower \"say on's\" master\nWith both palms on a crystal ball chanelling\nThe collective romantic prouds of Steve Urkel, Al Gore, Richard Simmons, Bill Gates and Screech\nFrom \"Saved by The Bell\", this...\nThis is the anthem for those among us\nWho got none in our formative years and this poem\nIs for every high school virgin who wouldn't have had it any. Other. Way!", "image": "https://images.genius.com/3433966a73a598eca7e6120b7f0cbab3.1000x1000x1.jpg", "album": "Guilty Pleasures", "title": "A Conversation With Bieber"}]}