{"songs": [{"image": "https://images.genius.com/7600dcfbffef8659f06c125c84cacd41.947x947x1.jpg", "title": "Monster Freestyle", "album": null, "year": null, "lyrics": "[Hook]\nStop it! Stop it!\nNitty just stop it!\nEverybody know you a mothafuckin' Monster\nEverybody know she a damn impostor\nEverybody know, everybody Go!\n\n[Verse 1]\nI'm a lady rapper complex like origami\nAnd honestly got more to talk about than my poonani, mommy\nI dislike these vaginas with mic's\nCaught sight, they bobbin they heads like \"It's alright.\"\nI put a noose to that mothergoose you mass produce\nYou ain't Zeus you just tipsy off that industry juice\nThis is lies versus truth and I ain't callin' a truce\nSo put your fingers to your lips while the lab is in use\nPerfectly packaged, flashier fashion\nNever took the time to mind the lives your rappers impacting\nNaw! You just attracting dollars pretty in pink\nLeaving me to put the passion to this paper and ink\nListen rook read a book it's a much better look\nI terminate the talent books and list the industry crooks\nOf this game, such a shame how you rhyme without a cause\nPartying in cars superficial super stars\nI'd rather have the college kids studying my bars\nReflecting and connecting with these ghetto battle scars\nAnd I ain't disrespecting just protecting what is ours\nLike a new vaccine they injected in they arms\nI go proactive on these Hip-Hop pimples\n\"Money over everything?\"; you creatures are simple\nI keep the company that run as deep as my dimples\nFlow so irregular now watch how it ripple\nIt's critical, you deserve an Oscar not a Grammy\nI make music that a Thug could bump in front of his Granny\nMy mind is uncanny I ain't playing the ass card\nCause I'm a dictionary and you more like a flash card\nI see you and your team always backing your trash hard\nBut I can get it poppin in the suite or the back yard\nYou got swag, I got soul\nI told Jules I'm goin in and doing damage control\nAll these models going rapper and these rappers got dance moves\nBut life is real over here and I ain't in a dance mood\nI was never to concerned with the fame\nI show more interest in the people I can save\nAnd you ain't resurrect shit you just diggin up the grave\nI'm slavin' in the kitchen while you pop it in the microwave\nCause only certain women servin lyrical hot plates\nI'll be the first to tell you criticism is not hate\nEducate the listener plan to help you see\nFeed em what they need not that ignorance you breed\nClassy is my creed and spittin is my knack\nMade in 1990 but I bring the 90's back\nNitty Scott is back, say no to kiddy flows\nThey don't listen they just love the glisten in your videos\nSo I am just what happens when the glitz and glitter goes\nA rose in the Concrete Jungle that still grows\nThis is a dedication as far as abominations go\nStraight devastating every station on the radio\nUH! I do this for the Cold Crush brothers\nAfrika Bambaataa and Biz Markie\nGrand Master Flash and Run DMC\nPublic Enemy, Melly Mel, and Ice-T\nNow if someone gave you a mic to speak to the masses\nWould you talk about fat asses and Louis V glasses?\nOr would you talk about all these people that's passin\nPolitical assassin's and prisons we gassin'\nNiggas who load clips, hustlers who move bricks\nBabies with no kicks and women who get pimped\nHustles with hard livin, stories of thanksgiving\nMy story is all writen but glory was not given\nThese sucka MC's have no use to me\nSo stop spittin like you sittin 'in a booster seat\nA'ight\n\n[Hook]\nStop it! Stop it!\nNitty just stop it!\nEverybody you a mothafuckin' monster\nEverybody know she a damn impostor\nEverybody know, everybody Go!"}], "artist": "Nitty Scott"}