{"songs": [{"image": "https://images.genius.com/1347c8a031c29a20889e17df64f84846.300x300x1.jpg", "title": "In Jail (Bidding)", "album": "DJ Clue Mixtape", "year": null, "lyrics": "It's like a torn ligament, a long cigarette\nSplit three ways, state pen, law, sentencing\nGates open, young thug approaching the bench\nPicture your whole life spent over the fence\n55 years for a faggot assault\nWith no views behind Attica's walls\nNew inmates will challenge yours for a carton of Kools\nYou get jigged in the yard thru your heart wit a spoon\nNigga hold that\nCaught him on the pull up bar, whudddup god\nHis whole grill was full of scars\nStay carrying, brotherhood be muslim or arian\nOnce the blood shed cats is scatterin\nCatch him at chow, better yet the visitin floor\nRight in front of they seeds be a vision of war\nThe nigga cried out\nRipped from his side to his eyebrow\nLeakin like a bitch left him semi-blind now\nBubbled his skin, when theres trouble cops pull the pin\nThey throw you in the box, 12 month stops\nBack in population a new jail with a year to my board\nHow man tier threes can I afford\nGod knows how many hoes I miss, waitin to toss\nEvery now an then fam send the latest source\nTo the day room, listen to my favorite tunes\nNeed it more, jail will make a nigga beat off\nIf I did it too I'd be wrong I couldn't live with it\nThe shit niggas be doing when the bidding\n\nIn Jail, 1-3, 2-4's, 3-6's\nSome turn tough, some turn bitches\nNiggas wanna know how do you roll\nDon't let the penile swallow you whole\n\nNow who da fuck are y'all tell me when to use the phone?\nWe in the pen dunn, the rules are gone\nBloods and kings, thorizine turn thugs to fiends\nLittle niggas using drugs and things\nPlaying sick call, everyday withdrawl\nThe shisty cats, write friends that dont write me back\nWhere my kite be black?\nFuck the pictures of your ugly daughter\nGo to store in two weeks dunn please drop a money order\nMake it out to the god, 92R7478 me the one they call Nate\nIt's the all state called crap stars with green slacks\nDouble bunks and dorms wit dudes that need bathes\nWhere da weed at? guns is knives, sons is wives\nPlaying PC spreading hundreds of lies\nSaid I'm free, the A-L's M-Z's\nMisdemeanors and the felonies\nOpen the cage, none of my peers close to my age\nOG's with afro's showin most of they grey's\nTakin showers with snakes and cowards\nFuck eigth sacks, space for hours\nMe and Manuel, three in a cell\nSee I'm coked up secret to tell\nI'm getting higher niggas\nWhy the fuckwork release keep denying niggas?\nGrown men cry\nMind your business when you happen to see\nThe same shit once happened to me\nI did a bid and came back on my feet\nLive some more makin hits\nWhile y'all niggas gettin hit at the board"}], "artist": "Nature"}