{"artist": "C-Rayz Walz", "songs": [{"title": "A.W.O.L.", "album": "Limelight (The Outroduction)", "year": "2001-01-01", "image": "https://images.genius.com/1b563111b567ea9351c71147ac79f45a.595x595x1.jpg", "lyrics": "[Intro: C-Rayz Walz and (M-1)]\nAbsent without leave.  (Absent).  Salute.  (Salute).  (Let me out!).  Let me out!  (Aah!).  Aah!\n\n[Verse 1: C-Rayz Walz]\nI’m Shaka Sankofa, a reincarnated soldier\nThe eyes of Mumia staring at you through a poster\nOn the move like John.  Africa on my arm\nI hate America!  The stage is Saigon\nWhere they holding me?  Like the Angola Three\nParasites patrolling me—microchips in your groceries\nWe’ve been crossed, hoodwinked, bamboozled\nKlans noose you for the brown skin [?]\nDon’t let scams confused you—we ain’t free here\nSoon, they’ll charge you to breath air\nSo I’m going A.W.O.L. with a spray can and slay all\nBlackface on the dark side like Vader\nYou could vote for Bush, push Gore or Nader\nThey all hate us culprit communicators\nTalking demon crap, they Republican\nAnd you go to school and got to fight a tank to get in\nInstead of phonics, they’re hooked on prison economics\nIncarcerate y’all, make a bigger profit\nDamn.  Attica [?], Comstock\nAnd when you make a MOVE, they fly through and bomb your block\n\n[Hook: M-1 and (C-Rayz Walz)] (x2)\nRunaway slave watching the North Star\nShackles on my forearm.  Running with a gun in my palm\n(I’m A.W.O.L.!).  Running with a gun my palm\n(What?!?  I’m A.W.O.L.!).  Still running with a gun in my palm\n\n[Verse 2: C-Rayz Walz]\nIn the belly of the beast, heart of the demon\nFire-breathing.  You listen to liars all evening\nTVs deceiving.  Red tears, eyes bleeding\nLooking for leaders, who you believe in?\nMarx and Lenin. Shot hit men and women\nSharks fish where you swim in, kiss snakes, sip venom\nI wanna shoot five with a cop on my block\nWhile his partners and my people watch\nSpot him ten points, let him use his Glock.  He still can’t win\nMy knuckle guns give headshots to blue chins\nYou in my camp—none run when shit’s on\nAnybody snitch get flipped on\nBy a worker ant.  Someone disturbing camp\nI spit kerosene, burn street lamps when I get amped\nIn a planned hood clean guns, steal canned goods\nGive ‘em to my peeps to eat—we all should\nFree to land, they homeless.  Ain’t we all?\nParachutes rip, slugs hit, we freefall\nAnd drop quick.  Unarmed comrades got hit\nIn the hood on some 41 shot shit\n\n[Hook: M-1 and (C-Rayz Walz)] (x2)\nRunaway slave watching the North Star\nShackles on my forearm.  Running with a gun in my palm\n(I’m A.W.O.L.!).  Running with a gun my palm\n(What?!?  I’m A.W.O.L.!).  Still running with a gun in my palm\n\n[Verse 3: C-Rayz Walz]\nLet’s get free, y’all (Free, y’all).  Grab a uniform\nLet’s go A.W.O.L. (See, y’all?).  We in Desert Storm\nBlack helicopters hover the hood and watch us\nSteal natural resources like we in Chiapas\nTest your sin.  Veterans condemn\nContention workers going out like Mexicans (Ándale, ándale, ándale)\nWe crossed the borders, but we now here\nNow fear a war on USA like Algiers\nShit’s popping off—smart missiles, Molotovs\nSons take over when the father’s lost\nFree Fred!  I rode the beat like the back of a paddy wagon\nIn deep thought, not knowing what could happen\nDropping knowledge, growing seeds of wisdom\nUnderstanding the youth of the song’s rhythm\nThe gutter’s the information given to arm you\nAnything else could be bad for your health and harmful\nI’m a welfare poet, freedom fighter, activist\nMy art of war is more than some rapping shit!\nFeds go P-O-W (Bust you), leave you in a vacant stance\nLost focus when you left your concentration camp\nLet’s go A.W.O.L.!\n\n[Hook: M-1 and (C-Rayz Walz)] (x2)\nRunaway slave watching the North Star\nShackles on my forearm.  Running with a gun in my palm\n(I’m A.W.O.L.!).  Running with a gun my palm\n(What?!?  I’m A.W.O.L.!).  Still running with a gun in my palm\n\n[Interlude: M-1 and (C-Rayz Walz)]\n(A.W.O.L.!).  I’m out of this bitch.  (What?!?  I’m A.W.O.L.!)\nFreedom first—then we get rich.  (What?!?  I’m A.W.O.L.!)\nTrigger finger starting to itch.  (What?!?  I’m A.W.O.L.!)\nStick the president’s bitch.  (What?!?  I’m A.W.O.L.!)\nUh.  (What?!?)\nNah mean?  People Army.  Still out of this bitch.  (What?!?  I’m A.W.O.L.!)\nHuh?  (Aah!).  Who with me?\nStill running with a gun in my palm (Wait)\nStill running with a gun in my palm\nStill running with a gun in my palm\nStill running with a gun in my palm\nStill running with a gun in my palm (I’m A.W.O.L.!)\n\n[Hook: M-1 and (C-Rayz Walz)] (x2)\nRunaway slave watching the North Star\nShackles on my forearm.  Running with a gun in my palm\n(I’m A.W.O.L.!).  Running with a gun my palm\n(What?!?  I’m A.W.O.L.!).  Still running with a gun in my palm (What?!?)"}]}