{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "MC Hustler", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Hook: Superstar]\nJust an MC hustlin, hustlin\nJust an MC hustlin, hustlin\nI'm just an MC hustlin, hustlin\nJust an MC hustlin, hustlin\n\n[Verse 1: Superstar]\nI'm a general, in this hip hop army, yeah\nHighly ranked, thick like a tank\nWell-equipped for niggas poppin shit\nRapifier, now plug the wire let's get down to it\nI'm frustrated, uh, filled with anger\nFeel like jumpin in the wash and just chill on the hanger\nBut uh, mama didn't raise no quitters\nSo uh, what you want and what you need I deliver\n\n[Hook: Superstar]\nI'm an MC hustlin', all I am\nIs an MC hustlin', so whatchu want?\nI'm an MC hustlin', all I am\nIs an MC hustlin', so whatchu need?\n\n[Verse 2: Mike Teeluxe]\nMass confusion, boozin, drug using\nGot some winning some losing, is it real or an illusion?\nI guess it's all a test, stress to paranoia\nSlip, go get a lawyer, make him prove nobody saw ya\nThe clock struck the midnight hour, I hit the beam\nI see my man Infinite pimpin shit for the team\nThe millionaires club, Republicans make it difficult\nKill or be killed's the result, I'm rollin up\nThe Garcia Vega short, drinkin quarts, talkin sports\nHerb smoke stimulates my thoughts, it took me deeper\nThan the reaper's domain, to make it plain as hell\nI left my spirit to dwell, but let my lyrics rebel\nDocumented on record to spark my C-brain cell\nI kick a style like Bruce, rockin this rotten metropolis\nDrugs, thugs and slugs, the scene, it's so monotonous\nOne day it dawned on me as the time rolls by\nThat the same thing that makes you laugh makes you cry\nSometimes I feel I'm winnin, sinnin, sittin back\nIn the MP, elax, talkin bout a new beginning\nYou see, I'm just an MC, I'm just an MC\n\n[Hook: Mike Teeluxe]\nI'm just an MC hustlin, hustlin\nI'm just an MC hustlin, hustlin\nI'm just an MC hustlin, hustlin\nI'm just an MC hustlin, hustlin\n\n[Verse 3: Superstar]\nI gotta get over, before I go under\nI gotta get over, before I go under-privileged\nTrapped deep beneath the sewage\nI attend the University of Making Money\nFive makes ten, ten makes twenty\nGood n' plenty, keeps pockets from getting empty\nBlunts get pulled, different day same bull\nShit, you can't own it, 'til you manufacture it\nTake away profit now tell me what you get\nI got a size eight, a fried chicken dinner plate\nI'm sellin dreams, you know, rhymes by the weight\nTen years of hustling, brung home the bacon, man\nMore scramblin than Moon and Cunningham\nYou know, money for the makin, maintaining\nHustlin, what the president, calls campaigning\nI'm just an MC, what I be?\n\n[Hook: Superstar & Mike Teeluxe]\nI'm just an MC hustlin, hustlin\nI'm just an MC hustlin, hustlin\nI'm just an MC hustlin, hustlin\nI'm just an MC hustlin, hustlin\n\n[*car driving noises*]", "year": "1999-02-23"}]}