{"artist": "Will Smith", "songs": [{"year": "2005-08-02", "lyrics": "[Intro]\nBig Willie!\nGet on the floor!\n\n[Hook]\nOhh! I'm the party starter\nYou might have a good time but we party harder\nSo, tell the DJ to play my song\nAnd we can dance all night to the early morning\n\n[Verse 1]\nDance, an afrodesiac\nWomen gyrating, simulating sensual acts\nTo stimulatin musical tracks\nI thought I was just gon' come out at night and get a brew and relax\nBut no! Uh-uh, when you the party starter\nIt's like, you on call, you what the doctor ordered\nIt's like you gotta block the border to the door and\nShock 'em when it's boring, get on the floor!\nUhh, it's the groovicide bomber\nMic in my vest tight, strapped to my chest like\nI'm a run up in the party holla and\nBe like, oh! Fulfilling my calling\nBig, Will, that's my name\nWriting, rhymes, that's my game\nAsk me again and I'll tell you the same\nLook, just write your number right next to your name girl\n\n[Hook]\n\n[Verse 2]\nHe was raised in the days when the roof was raised and\nEvery rap occasion, new and amazing\nThe back of the stage is amazed and gazing\nPraying for the day they can one day praise him\nStudied the ways of the game and made it\nCame through the maze and the haze and played it\nPerfect, dazed any person hated\nAnd cursed 'em, he was unfazed, he waited\nIt was worth it, he never retaliated\nHe saved it, slaving, on the road blazing\nDazed when he was low, nothing could raise him\nAnd came to the show and something uncaged in him\nLike the pope of this party crusade\nI'm like braids, that's never gon' fade, ya heard?\nI'm like, 23's on an Escalade\nThrow me into the rave like you threw a grenade, boom!\n\n[Hook]\n\n[Verse 3]\nI call for the days of the unadulterated\nWhen the artistry was cultivated\nYou know back when rap was smart and multi-layered\nWe can rap without A&R's and ultimatums, damn!\nNow today I say the praise, I long for the good old days\nWhen the party was all about partying\nI was a mini-party starter then\nMy mind bends when I call my pen\nThe big question, should I run to mine a vittle\nFood for thought or, dumb the rhyme a little?\nBut Will if you come too high\nThat'll alienate folks, and they won't buy it\nYo, look, people getting trapped in the track\nAnd they be clapping, even when the rappin is wack\nAnd what happened? When did we get happy with that?\nHe old-fashioned? Yup! Well let's be happy he back, ya heard me?\n\n[Hook]", "image": "https://images.genius.com/b6862accc0e70d12f7d4a50c2aee85da.1000x1000x1.jpg", "album": "Lost and Found", "title": "Party Starter"}]}