{"songs": [{"image": "https://images.genius.com/d7cb8616465549cc89d5e8bfc9ba7e99.640x640x1.jpg", "year": "2018-08-31", "lyrics": "Songtekst van Sevn Alias – \"Begrijp Je\"\n\n[Intro]\nGewoon rustig doen man, begrijp je?\nZo ga ik deze noemen, Begrijp Je\nEsko\n\n[Verse 1]\nZe zagen geen licht in m'n toekomst\nMaar nu schijn ik als een lamp\nSchijnbeweging schud je af\nIk neem de benen net als kramp\nZal het mooi voor je verwoorden broer je wil geen trammelant\nBen scherp als een bijl, ik maak af met de hak als Bergkamp\nHeb een arsenaal aan barz, dus ik hou lang stand als Wenger\nSkinny nigga super tenger, maar vecht toch niet ik heb bangers\nKom niet praten over real, je bent niet eens real met jezelf\nBen je fake kan je niet hangen ik kom je knippen net als hennep\n\n[Hook]\nBegrijp je?\nCome on\nListen\n\n[Verse 2]\nIk heb barz zat, soms ben ik barz zat\nNeymar, ga naar France met een shirt van PSG aan\nRugnummer 7, maar ik moet op nummer 1 staan\nSwitch lanes, maar rij vaak links het liefst één baan\nJij-Jij komt niet in m'n buurt je doet me niet na\nWie heb ik aan de lijn; het is de plug hij zegt me 3K\nTijden zijn gevaarlijk, young boys denken niet na\nZe loungen niet eens meer je wordt gesmoked net shisha\n\n[Hook]\nBegijp je?\nTu du\nDom\n\n[Verse 3]\nSwitch flows, domme barz, praktijkgeschiedenis\nDit moet de boeken in, aptijt\nVerdien je niks, hoor je niet in m'n vriendenkring, afscheid\nWat ik van je neem, ik sla je om net als een bladzij\nSranangmang Alias, ben Surinaams net pastei\nZij wilt jou niet meer vandaar dat ze zichzelf afprijst\nZe eet me net funchi ben ook Anti dus ze mag mij\nIk geef je bitch instructies tijdens seks alsof ze afrijdt\n\n[Hook]\nEy\nBegrijp je?\nDom\nListen\n\n[Verse 4]\nWordt het tijd voor een vrouw? Uhu, misschien\nMaar er zijn zoveel hoes, kan geen vrouw meer door de mist zien\nStrictly, heb die shit gezien non-fictie\nZe zegt ze heeft een man maar komt me samen met haar nicht zien\nDat is best gek, maar ik vind gek best\nLate night, phone licht op ik legde net weg\nSnapchat, ik zie d'r body wazig door die S6\nEn zij is echt gek als ze denkt dat ik haar back snap\n\n[Hook]\nBegrijp je?\nBegrijp je?", "title": "Begrijp Je", "album": "RECASSO"}], "artist": "Sevn Alias"}