{"songs": [{"year": "1993-06-02", "image": "https://images.genius.com/9703d795ec6c8c350b9674639f3fa5b8.500x500x1.jpg", "title": "Bad by Myself", "album": "All Samples Cleared", "lyrics": "[Intro]\nYeah yeah yeah\nOooooohh\nYeahhhhhhhhhhhhh, yeah yeah yeah\nLet me tell you a story now\n\n[Verse One]\nI was in front of the Apollo on Amateur Night\nIt was after the show, and the moon was right\nThe {?} was really perked off the Red Zone\nI was in my MPV, I was all alone\nA lot of out-of-town people askin me for\nMy John Hancock or my signature\nI gave it to, all of them cause I was down to earth\nAnd plus the Apollo is my home turf\nSo I walked across the street 'til I'm on, 125\nI saw this pair of shoes that was really live\nIt wasn't just a pair of shoes, that was on her\nFrom the ground up, she looked like a plate of lasagna\nI said, \"Hey shorty, not you, your hair\"\nShe turned around slowly and started to stare\nShe said, \"Why don'tcha take picture, it'll last a lil' longer?\"\nMe likin you grew a little bit stronger\nShe asked me what's my name I said, \"Emmezah emmezah\"\n\"The name that your momma gave ya is what I prefer\"\nShe asked me what am I drivin, and how is my health\nI know what you're really thinkin baby, LET ME TELL YOU!\n\n[Chorus One - Biz singing]\nI can do bad by myself\nI don't need no help, to starve to death\nI can do that alone\nI can do bad by myself\nI don't need no help, to starve to death\nI ain't tryin to be funny honey\n\n[Verse Two]\nShe started arguin with me, and say she's not like that\nI know who you are, I don't care if you're livin fat\nBecause I have a mother and father that take care of me\nAnd I'm livin in Long Island with a J-O-B\nOkay okay I got you wrong, I must admit\nI'ma give you a little time to see if you're legit\nSo we started goin out on a regular basis\nI was takin her to the movies and my hangout, places\nLike the Q Club, The Scene, or The Arcade\nI thought this relationship was tailor-made\nCause she was sweet kind considerate I, was hypnotized\nNever thought she'd try to pull the wool, over my eyes\nAfter I smacked it and flipped it, she thought I was whipped\nI know she is like a knockout but I'm not gettin bullwhipped\nShe asked me why I am so stingy I know you got the ends\nBecause you got two MV's, two BM's, an SL Benz\nWhat are you my accountant or the IRS?\nWhy ya clockin everything that I posess?\nShe want me to waste everything and be small as an elf\nLet me tell you somethin baby, let me tell you\n\n[Chorus Two - Biz singing]\nI can do bad by myself\nI don't need no help, to starve to death\nI can do that on my own\nI can do bad by myself\nI don't need no help, to starve to death\nI ain't tryin to be funny honey\n\n[Verse Three]\nNow all her friends boosted her, to get my dinero\nLike if I was a drunk Mexican, wearin a sombrero\nI knew she had a boyfriend on the side\nShe told me, yo, she didn't have to hide\nShe said she cut him because he was too jealous\nHe always thought I was tryin to talk to other fellas\nIt's now the present, and that was the past\nFrom now on bein with me, is gonna be a blast\nI know she thought in her mind, it's gonna be great\nJuicin and reducin everything I make\nWith her Victoria's Secrets neglice\nShe tried to seduce me in every way\nShe would come out to Jersey rain sleet or snow\nShe acted too true blue to be after my dough\nMy man, Jeff told me but I didn't wanna listen\nI was too hooked, and strung out, I thought he was dissin\nThen she popped the question, and asked me for some dough\nI looked her in her face and said, \"HELL NO!!!\"\nYou're a head nurse and you want my wealth?\nYou must be CRAZY AS HELL, cause\n\n[Chorus One]\n\n[Biz singing]\nLet me tell you know\nAll day long, you been talkin on the telephone\nBraggin to all your friends, about all the cars that I own\nBut YOUUUUUU don't tell 'em, that I'm the one doin it all\nWhile you're out there livin it up, and havin yo'self a ball\n\n[Chorus Two]\n\n[Biz singing]\nUmmm, whoah-whoah, yeah-yeahhhh!\nI can sing-ing-ing-ing.."}], "artist": "Biz Markie"}