{"songs": [{"title": "No Pity", "lyrics": "[Chorus: Modesty Lycan]\nWhen it comes my time\nWill the Heavens know my name, or will they run and hide?\n(?) Or will they understand? I'm just trying to be the man\n\n[Verse 1: Young Chris]\n5th gear, I push it to the needle\nDope boy, they push it through the needle\nHustle out of the Regal like it's legal\nThe love of the root of evil\nGotta bring back the structure, these suckers'll fool the people\nAs I pull the Diesel, take a swig of Tequila\nMac Milly too big to conceal her\nOne room apartments, dreams of a Villa\nBroke down the palace, with dreams at the dealer\nKeep it Jungle with Gorillas, the streets lit up like Thriller\nSmoking on that Reggie, they shooting shit up like Miller\nYoung nigga with a Trapsoul; Bryson Tiller\nHad to pay the price of death, (?) life of killers\nLiving out the Bando, I ain't been out there with Babe\nSame clothes for days, I ain't been in the bathe\nBitch, I'm chasing a bag, I ain't minimum wage\nWe just dodging the cage, dodging an early grave\nI pray to God that I don't make it to the front of that page\nGot dreams, I'm trying to make it to the front of that stage\nAnd perform, that's on my momma\nEveryday I get going to put on, not letting up once I get my foot on\nI fell back and let it stack while ya'll niggas' drawn\nCrack of dawn, selling crack while ya'll niggas' yawn\nBad bitches with pill addictions, sipping slow like Peno\nOnce they pop, can't stop like Pringle, appetite like Oschino\nFish-scale, cook well, who looking for Nemo?\nFor the love of Deniro, crack your heads to Casino\nBlood draw so for sure, I'm taking it personal\nRetaliation nigga, death to your sons, I merc you\nCall the coroner, tell them we got a massacre\nMaking it hotter than Africa, assassinating their character\nBlasting your Cane, Cousin Harold, your driver and passenger\nMore bodies to ashes, or pallbearers to bury you\nBring your heat out the cold nigga\nWhile jungle, snatch your heart out of your soul nigga\nTell them bastards that we handing out caskets, bitch asses\nBall players getting taxed, we robbing their rich asses\nAin't no love in the heart of the city, it's gritty\nBottles of blood, white chalk, for the love of the icky\nEven some of my darkest nights when I'm under the Gun\nI shine bright like I'm under the sun\nIn love with the industry, I'm right back to give it 1 more run\nIt's time to make a better future for my unborn son\nI'ma teacher, can't make you think\nI could lead you the well but can't make you drink\nI can show you the way, can't take you every time\nI can show you the hustle, can't make you every dime\nIt's all apart of the grind, young\nBut I can't make up your mind young\nIt's your decision and your vision, read the signs young\n\n[Chorus: Modesty Lycan]\nWhen it comes my time\nWill the Heavens know my name, or will they run and hide?\n(?)\nOr will they understand?\nI'm just trying to be the man", "album": "The Network 4", "year": null, "image": "https://images.genius.com/5f02431fece601b79f34985a5cf5973b.1000x1000x1.jpg"}], "artist": "Young Chris"}