{"artist": "Pusha T", "songs": [{"album": "King Push – Darkest Before Dawn: The Prelude", "title": "Crutches, Crosses, Caskets", "image": "https://images.genius.com/456d2c1e7b1dc2d52a08c5840820861b.1000x1000x1.jpg", "lyrics": "[Intro: Pusha T]\nYeah\nUh-huh\nBeautiful evils\nYeah\nCheck me out\n\n[Verse 1: Pusha T]\nCrutches, crosses, caskets\nCrutches, crosses, caskets\nAll I see is victims\nMy young niggas sic' ‘em\nI don’t get ‘em\nI just get back their jewelry if I’m fuckin’ with ‘em\nYour man crush Mondays be owin’ niggas\nMy skin is triple black, I’m the omen\nYou can’t kill a God like the Romans, uh\nTake my time to craft shit\n‘Cause I don’t like back and forths with Puff about rap shit\n\n[Verse 2: Pusha T]\nCrutches, crosses, caskets\nCrutches, crosses, caskets\nAll I see is victims\nRappers is victimized at an all-time high\nBut not I, you pop niggas thought I let it fly\nI’m Yasiel Puig, I’m in another league\nI defected, only thing we have in common, niggas bleed\nIn ya thousand dollar joggers as you rhyme about ya dollars\nIs there shame when a platinum rapper’s mother lives in squalor?\nMildred’s in the Bahamas for the month\nShe’s probably sitting in her pajamas having lunch\nSwordfish, my reality is more fish\nBanana clips for all you Curious Georges\nOld niggas slapping young niggas\nHa Imagine that, where you from nigga?\n\n[Verse 3: Pusha T]\nCrutches, crosses, caskets\nCrutches, crosses, caskets\nAll I see is death by the masses\nThe only asterisk is the change of address\nMy infinity pool as long as Magic’s\nYeah I let Zillow change my pillows\nThe home is so inviting, the Porsche is the armadillo\nThe silhouette\nThe pop, pop, pop; the chop, chop, chop\nThe throwaway TEC's got Tourettes \nIt’s more than this drug money, I love money\nI speak to your soul and that’s above money\nThis the ministry of street energy \nThe church of criminology, teaching my chemistries\nWoo I’m the L. Ron Hubbard of the cupboard\nTo some certain motherfuckers gotta love it\n\n[Outro]\nCrutches, crosses, caskets\nCrutches, crosses, caskets\nAll I see is victims\nCrutches, crosses, caskets\nCrutches, crosses, caskets\nAll I see is victims", "year": "2015-12-11"}]}