{"artist": "E-40", "songs": [{"title": "Back In Business", "image": "https://images.genius.com/43cc1955c01c5556fda9d51868d1f070.499x449x1.jpg", "album": "Revenue Retrievin’: Day Shift", "year": "2010-03-30", "lyrics": "[Intro: voice samples off a movie]\nThis sounds like the Jackpot\n\n[Chorus 1]\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\n\nThe time comes that a man's gotta stop running away and face things\nThe time comes that a man's gotta stop running away and face things\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business*\n\n[Verse 1]\nUH! Prepared for the hatred with my problem solver, my patriot\nGoon up or get tuned up, rubbed off, erased-ed\nStay dedicated and faithful to my camp (What about your camp?)\nTouch any of my loved ones and get stamped (Stamped)\nStapled, removed, soil tested and block approved\nReally a good dude (Dude), but he can get true\nFrom the school of hubba rocks and life savers up in his socks\nSprintin' and runnin' from the cops (Cops)\nThe cherries (Cherries), the sirens (Sirens)\nThe po-po penelope one time (One time)\nThe alphabet boys, the letters (Letters)\nThe sophisticated dog trainin' tactics, the K9 Shepherds (Shepherds)\nIn order to do some right you gotta do some wrong (Wrong)\nGot hella shit goin' on (What else?)\nThe dusty (Dusty), the dirty (Dirty), the smirkish (Smirkish)\nUH! I ain't paranoid, I’m prepared, I ain't nervous (I ain't nervous)\nWhen you cookin' birdies in the kitchen\nCan't be slippin' like a transmission\nGotta be on your peas and toes\nIt's hard to make an honest livin' when your kids ain't got no clothes\nBIATCH!\n\n[Chorus 2]\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\n\nI'm interested in picking up a few hot dollars\nI'm interested in picking up a few hot dollars\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\n\n[Verse 2]\nPlayin' the game how it was meant to be played\nThe way it's supposed to be\nMoney hungry and zany (Zany), soil savvy and brainy\nHard-headed and mannish, me and my Filipinos and Hispanics\nGuamanians and Asians, Samoans, Tongans and Caucasians\nCalifornia Bears, not no California raisins\nAll of us is fools (Fools), all of us is patients (Patients)\nEthiopians, Afghanis and Eritreans (Eritreans)\nAfricans, Jamaicans and Indians (And Indians)\nUh, ave animal, we some hood hysterians\nYou can tell by the way I carry it that I'm a block barbarian\nA goon with the spoon, wrist game sick\nPaid the neighborhood chef to teach a nigga how to whip (Whip)\nA nigga how to whip (Whip), a fixture how to mix (Mix)\nCounterclockwise twistin' it, drop it off, deliver it\nNever half-step (Step), go for the jugular (Jugular)\nGet yo money, mayne, don't be no couch potato hustler\n\n[Chorus 3]\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\n\nWhat I don't know I don't trust\nWhat I don't know I don't trust\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\n\n[Verse 3]\nUH! Family, you a solid dude, your name just came up\nBruh, you gon' live a long time, we just talked you up\n\"Well, what was the subject about? Was the subject good or was it bad?\"\nThe subject was about how you made them suckaz back up like sea crab\nWhen they raised the white flag, too many drinks they had\nDisrespecting the boss, that's how you got fucked off\nYou mean something, you somebody, you really stand for something\nThey got big ass N on they chest (For what?)\nFor nothing\nYou know my homie with the two-toned Lex (What about him?)\nHe fuckin', a couple of them niggas' broads\nThey licked his sweaty balls\nThese hoes nowadays is dogs (Dogs), givin' up them drawers (Drawers)\nDo anything for the cash (Cash)\nWipe their coochie off with a napkin and take a hooker bath (Bath)\nAin't none of my niggas captains, they gotta pay our mackin' ass\nWe be slummin' it, we be trappin'\nIn the slow lane and the fast (Fast)\nMoney, hugs, fame, and kisses (Kisses)\nAlcohol, weed, and bitches, mayne, we back to fuckin' business\nBIATCH!\n\n[Chorus 4]\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business\n\nThis sounds like the Jackpot\nThis sounds like the Jackpot\nWe're back in business, boys, we're back in business\nWe're back in business, boys, we're back in business"}]}