{"artist": "WC", "songs": [{"year": "2002-10-22", "lyrics": "[Verse 1: WC]\nWho wanna roll with a real nigga? - itchy finger, wine hitter\nWaiting at the back of the club sipping liquor with Don figures\nDiamonds on my bedazzles and bandannas is my apparel\nTrying to take these whores to the next level\nJust off on parole, pocket full of dough\nBlowing Blueberry in V.I.P with X.O\nI know it's hard to believe, you ain't never seen a rider\nWith so many rocks in this flea color (BLING! BLING!)\nThe ghetto Michael Jordan of Rap penetrating\nStepped up away from the game and came back like retaliation\nNow it's on til they bury me (COME ON!!) Get them up, hit them up\nBack balling for life, living it up\nUsed to wear a Ski Mask where the cash be\nNow I'm 'Rich Rolling' with girls, riding this black Ashy\nIt's 'Cash Over Ass' - you know what I'm saying?\nThey need to bending over, I'm paying\n\n[Chorus: Black Chill & DJ Crazy Toones X2]\n[DJ Crazy T.:] BITCH GET OUT!!\n[Black Chill:] If we ain't fucking tonight, if we ain't fucking tonight\n[DJ Crazy T.:] BITCH GET OUT!!\n[Black Chill:] If you ain't sucking tonight, if you ain't sucking tonight\n\n[Verse 2: WC]\nLove me or love me not, Dub gonna stay on the tattle\nMaking Chicken Heads swallow\nI know all of y'all trying to get paid for the Sex play\nBut I see through these jams like X-Ray\nSwerving on the highway with the knight vision\nFrom South Central to Down South that's my mission\nOn my way to the Strip Club to spend a little bit\nDon Bacardi, Party and Bullshit\nChop dirty money on the Wood Grave with my out of town players\nCause Game Recognize Game, chasing cheese\nLacing up pieces of presidential with sweet hits\nSwitching whores like leases, all weekend\nGot them tricks spreading them ass-cheeks and\nBox Springs and Mattress is squeaking; Pimps up, whores down\nAnd if you ain't fucking, don't bring your ass around\n\n[Chorus: Black Chill & DJ Crazy Toones X2]\n\n[Verse 3: WC]\nYeah, roll that shit, light that shit\nThrow that there, Bitch! put something in the air\nI got more humps and four pumps to make your crew jump\nEight times, threw in the chumps\nAnti pretty nigga, greedy nigga - Fuck the industry nigga\nRoll my penitentiary Tennessee nigga in jail clothes\nWith balls big as shell toes\nTrying to see naked butt assholes and elbows\nOut for Skrilla, pimp the game like a gorilla\nStill a banger, lap dance nipple filler (Nigga)\nLoaded, Arm One, squatting down low and taking flicks\nCorrectional Facility posing, came up the hard route\nBut now I'm hood Start-out\nPull a card out, we're about to buy the pour-out\nDrunk a lot, touched the cot\nBitch! we ain't play with it, we just fuck a lot\n\n[Chorus: Black Chill & DJ Crazy Toones X2]\n\n[Black Chill:]\nBITCH GET OUT!!", "image": "https://images.genius.com/9dca4fc634fb841debe25e0b0a92d67b.503x500x1.jpg", "album": "Ghetto Heisman", "title": "Get Out"}]}