{"artist": "Vast Aire", "songs": [{"title": "Posse Slash", "year": "2004-04-27", "lyrics": "[Hook: Samples with DJ Cip One Scratches]\n“Rap representing” - Sample from [?] (x4)\n\n[Interlude 1 (Overlapped with Hook): Karniege]\nYo.  Hah.  Karniege.  Listen\n\n[Verse 1: Karniege]\nWhat you hear now is not a one-hit wonder (Uh uh)\nOne hit, wond-e-rous things happen (Look)\nWe slide out, it’s like Crunch, Captain\nNot the cereal but suited like generals (Let’s go)\nGripping the mic and moving any rooms\nSee Mighty Jo swing, smack from the bush\nGrimy flow kings rap out the wood\nWork when a boy twerk lines this good (Uh huh)\nWho say we hiding in the hood, playing Holly games?\nWe drop hits here at the party, mayne\nListen, woman or child, the hood’s in the house\nNow start looking around for me, Brooklyn-bound (Look)\nQueens all-city, the kid putting it down (Look)\nProbably in another town, unhooking her blouse\nShe waving in the air, saying, “Looky, meow”\nPosse cut bodied her.  You better watch it, son\n\n[Verse 2: Breez Evahflowin’]\nYo, I ain’t trying to battle no more.  That shit is getting boring\nThe comp sucks.  My new hot stuff should get to touring (Hit the road)\nWords are like weapons soaring, leaving sets unplugged\nDisrespecting, it gets to you like Lauren\nShit’s hard.  Smoke grass to let it off\nMe and Vast need cash, so we smash like ghetto raw\nStraight beating the fuck out this verbal session, stressing this bitch\n‘Til she’s screaming like [?].  With herbal essence, I\nSpit a TEC at the mainstream, aiming at\nFake niggas who gang clean, ain’t seen jack\nHip hop is much bigger than rap.  You going for mines?\nGet off the crack.  Bet on your ride?\nI break your prize, leave you walking back\nFor the green, I’m a scene from the Hulk attack\nI’m a vet.  You pose no threat.  You pussy\nOn the set like commercials with talking cats\n\n[Verse 3: Poison Pen]\nMy jersey been in the rafters.  Peep this towel-mouth\nBrooklyn monster.  Knuckle up, speedbag your tonsils\nPoison Pen’s name’s hitting in the street\nAll I do is threaten dudes to the rhythm of the beat\nBranch Davidians trail me.  Got a cult following\nTungsten for tonsils, low blows spit halogen\nThought your block was wild?  Watch out.  It’s really off\nPoliticians pop off, turn the city hall to a city morgue (We want it all)\nIf there’s a brawl, really, dog, it’s prolly us\nTour bus boys ain’t stalled working on a posse cut\nAyyo, lips on your face don’t work.  Just like I’m\nOn the desert, baby.  The same as gamma-ray-strong birth\nBitch!\n\n[Hook: Samples with DJ Cip One Scratches]\n“Rap representing” - Sample from [?]\n\n[Verse 4: Aesop Rock]\nY’all know the name:\nAesop fucking Rock.  Ain’t a damn thing changed\nClubbed up in a property in helicopter hell\nWhen all he wanted was to drink copper, crawl out of well\nJumping Jiminy in a gimme-gimme industry\nNew York bleed bricks, piss huts, and shit liberty\nBriefing lizards, he sleeps the winters away\nWeight flips snarky out in demos.  Let him keep the scissors\nAnd all that good-good.  Smoked out and mobile\nWhen his tummy growls in vowels, shit almost looks remotely simple (Oh)\nSlumped on every portly mobile.  Porky ogre ace ignored\nA forty focal.  Folk adored a forgey quirksy motor\nFuck what I’m gon’ be.  This luck of the ugly\nAnd I’m half-man, wormy, flunked, fucked.  What?  Dirty\nFrom the dump, suck dump truck.  Let the peril fester\nRight?  Curb your little ninjas and we’ll all break bread together\n\n[Verse 5: Vast Aire]\nI know niggas in the street who delete oxygen\nIf you ain’t really ‘bout it, don’t box him in (Don’t do that)\nThere’s no water but you gonna go swimming\nWe don’t like y’all.  We like women (I like girls)\nYou lie sweet but the truth’s like lemon\nIf you touch her right, she’ll start grinning (She’ll start grinning)\nI got something if you want to touch hands\nSucker emcees better change they plans\nPass the baton.  I’ll end the dash (End the dash)\nThat ain’t all the herb.  It’s only the stash\nAnd this ain’t a posse cut.  It’s more of a slash\nPart of the hurricane—only the splash\nStyles upon styles upon styles is what I have\nYou trying to grab the Aire?  You don’t know the half\nHah.  You better off up north\nAnd when you thinking we got you, the lights go off", "album": "Look Mom... No Hands", "image": "https://images.genius.com/ec5e65a416584a208b3230e59ddbdd2f.600x600x1.jpg"}]}