{"songs": [{"title": "BBQ", "album": "GetBackGang 2", "year": "2019-07-26", "image": "https://images.genius.com/ba69be12416de91a9038d42e6739d42b.728x728x1.jpg", "lyrics": "[Intro]\nSkrrt, skrrt (Skrrt, skrrt)\nSkrrt,  skrrt (Skrrt, skrrt)\nSkrrt,  skrrt (Skrrt, skrrt)\nSkrrt, skrrt (Skrrt, skrrt)\nSkrrt, skrrt (Skrrt, skrrt)\nBeat  was for Tadoe\nHe  ain't do it, though\nGuess who got it now\nAyy,  ayy, ayy, ayy, ayy, ayy, ayy, ayy\nAyy, ayy, ayy, ayy\n\n[Verse 1: Chief Keef]\nWhatcha talking 'bout, Willis?\nI can't wear my white Amiris, I got cheese on my fingers (Ayy)\nSmoking  dopey-dope dope\nDone, done, done is weed man, but I be with my villains (Bloods)\nSkrrt-skrrt, I'm peelin'\nFinna pull up, mark the spot, this ain't no fuckin' R Chronic (Bang)\nOkay, since we cookin' beef\nOkay, since we cookin' beef, I'ma need a large skillet (Ayy)\nIf he a dog, then we China\nThirty five shots, that's Cinco de Mayo, ayy\nNamed both guns, David and Goliath, ayy\nWho tryna get high? My old head fire, ayy\nYou ever seen a XO spit out fire?\nTold her hold on, exhausted, bitch, I'm tired, ayy\nShe gave me a gram, told me J.R. Rider, ayy\nI beat 99 and they all light up\n\n[Chorus: Chief Keef]\nTurn his brain to some barbecue\nShe asked me what I like, baby, I pick you\nAnd he live with his mama but he telling you\nThat his pockets is filled and his garage is too\nWho is these niggas? I don't know you\nDonald Trump building a wall, go run into it\nRollie on my hand and a gun is, too\nBitch, I feel like Waka Flocka, \"Oh, let's do it\"\n\n[Verse 2: Lil Reese]\nI pull up with them young foolies aiming at you\nToo many niggas riding, they knowin' what it do\nJust blew fifty thousand, made it back times two\nI put them shooters on your ass, you ain't knowin' who (Nah)\nThat GetBack have 'em blue (Blue)\nNiggas better pick a side, niggas better choose\nMy side, we don't lose (Lose)\nMy side pack them tools (Tools)\nIf he with the opps, then he a opp, we gon' show him what it do\nFuck around turn his brains to some barbecue\nI'm like hold on bro, stand down, let me get him, let me shoot\nSosa got GetBackGang with him, too\nAll my niggas they gang, it ain't no fufu\nNiggas killin' hoes, that's so fu\n\n[Chorus: Chief Keef]\nTurn his brain to some barbecue\nShe asked me what I like, baby, I pick you\nAnd he live with his mama but he telling you\nThat his pockets is filled and his garage is too\nWho is these niggas? I don't know you\nDonald Trump building a wall, go run into it\nRollie on my hand and a gun is, too\nBitch, I feel like Waka Flocka, \"Oh, let's do it\""}], "artist": "Lil Reese"}