{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/2f986d65224768b523b5044b28981fa9.500x500x1.jpg", "title": "Blackout", "year": null, "album": "Daydreamer", "lyrics": "[Chorus: Kid Ink]\nAyy girl, I see you with your friends and your ass out\nJust left stage, 'bout to cash out\nOne more drink and I'ma pass out\nCan’t nobody see me? It’s a blackout\nBlackout, blackout\nCan’t nobody see me?\nBlackout, blackout\nIf you getting money, pull your cash out\n\n[Verse 1: Kid Ink]\nI said I'm turned up, maxed out\nNew money, but I just pulled a stash out\nHuh, couldn't see me in a glass house\nAnd my bitch way better than my last spouse\nHey, so tell me what you wanna do\nBig bank take little bank, I'm Chase and bitch you are WAMU\nI'm on some other shit, so can you please get off my stool?\nI am the man up in this bitch, I do it big, give me my room\nOr I could give the business, but this right here is none of y'all\nNobody could fuck with me, it must be the nuin y'all\nWatch me throw it up, throw it up 'cause I can’t stomach y'all\nI'm 'bout to take your bitch nigga and this is how I cum in her\n\n[Chorus: Kid Ink]\nAyy girl, I see you with your friends and your ass out\nJust left stage, 'bout to cash out\nOne more drink and I'ma pass out\nCan’t nobody see me? It’s a blackout\nBlackout, blackout\nCan’t nobody see me?\nBlackout, blackout\nIf you getting money, pull your cash out\n\n[Verse 2: Meek Mill]\nDiamonds in my chain, Whoopi Goldberg, black as shit\nBlack Breitling all on my wrist, bitch I'm Bernie Macking it\nGet some GEICO for that ho, before it be a accident\n'Cause I be shitting on these niggas, like I took a laxative\nI break a bitch down, like I break a brick down\nChopper with a drum, ho eighty six rounds\nI could make it rain and make a hater sit down\nAnd I ain't tryna save no chick, I'm tryna make a bitch drown\nAnd I be swimming all in that money, diving all in that paper\nBlack phantom with no tint, styling all on them haters\nYour team versus my team, Cavaliers versus Lakers\nI make a movie all on your bitch, scream, \"Free tip\" I take her\n\n[Chorus: Kid Ink]\nAyy girl, I see you with your friends and your ass out\nJust left stage, 'bout to cash out\nOne more drink and I'ma pass out\nCan’t nobody see me? It’s a blackout\nBlackout, blackout\nCan’t nobody see me?\nBlackout, blackout\nIf you getting money, pull your cash out"}]}