{"artist": "Wiley", "songs": [{"year": null, "lyrics": "[Verse 1: Wiley]\nYo\nWhy'd you think that you're hyper?\nMy flow's hench like Hyper\nEskiboy, R6 bike rider\nI'm on the roads, I'm the east-side rider\nIn the dance, your girl, I'm behind her\nAnd I'll give you a grand if you find her\nIt's all good brother, she ain't a minor\nI won't get hurt, I'm a ten-timer\nI'm the prince of one-liners\nAnd I push my body in vaginas\nE3 kids, we're the finders\nOriginal tree climbers\nYoung fighters, autograph signers\nYou can say I'm one of the hardest grinders\nI run rings around old timers\nI ain't sleeping, can't you see I'm peaking?\nWiley's one of the greatest rhymers\n\n[Verse 2: Rage]\nSee I'm not on a joke ting\nNowadays it's a cut your throat ting\nThink I'm joking? Run your boat here\nEverybody in the ocean floating\nRage on a long ting? Keep on dreaming\nOther MC's try provide the style like I\nBut they know they're losing\nChat shit, then you're gonna hold a bruising\nBody keep moving\nStop that screaming\nThugged-out, no place for a weakling\nMy crew just keep on beefing\nDun know, big mans we're eating\nSend your wife to my house in a G-string\nPree this that we weren't just sleeping\nAs you grind all night, she was riding\nDid you know that your girl was shining bright like a diamond?\n\n[Verse 3: Esco]\nHe's not the guy, I'll show you why\nI'll jack man and push keys like Lewi White\n.33 in the fist believe me I wouldn't lie\nI'm gonna merk this quick as a beat I kinda like\nLevel is the east postcode that man a ride\nLeytonstone but I rep for certain, Leyton guys cuz\nIf you knew half wagwan you wouldn't hide\n'Cause you know I wouldn't take your line\nCan't you see this? East is where the greaze is\nDucking police and bucking heaters\nI got teams that'll run up on your dealers\nFor boxes and headlocks and three or four eediats\nNot a big cheese prick, you don't see shit\nI tug lines and block half a beefing\nWith some full tints so you don't see in\nBack in the game and I'm raising\nYeah\n\n[Verse 4: Jammer]\nAll that badman talk, that's air man\nWhat you really think that's gonna scare man?\nEvery morning I say a prayer man\nSo if you wanna shoot me, I'm here man\nI don't care man\nI just go to the rave with bare man\nI done the tune of the year man\nEven though you don't wanna hear man\nDon't ever try chat shit when I'm 'ere man\nI'm tryna make it clear like glass\nDon't come around here and play the arse\nCock back the ting and blast\nAnd your whole body will be covered in casts\nCan't eat no food, you have to fast\nNow your rudeboy career's in the past\nSome fake badboy what's wearing a mask\nYou failed the badboy task\n\n[Verse 5: Scorcher]\nYeah, what\nYou flip which bit? Which box? Which half?\nYou think you shot, stop making me laugh\nI ain't wearing a badboy mask\nTry it with me you will see who's the badboy last\nYou're a popstar\nDon't sit around like a rockstar\nFronting like you let the shotty blast\nOn stage with a hundred bodyguards\nI move solo, holding something that will slip through body parts\nDon't push me, we ain't cushty, I'm like shh please\nFronting like you live the road life\nYou ain't stabbed, clapped or freed up in your whole life\nIf I heard you was shotting no mash I'd just run up on man with the cold pipe\nYou got a badboy mask but it's so tight\nAct rough 'cause you got a little road hype\n\n[Verse 6: God's Gift]\nNuff man a rate me, but nuff wanna hate me\nTrue their girlfriends wanna date me\nTruly they hate me\nWhen you see me just say it to me\nDon't see me and say \"safe\" to me\nBut you're afraid of me\n'Cause what you say to your girlfriend\nWhen you see me you don't say it to me\nShe wants to lay me\nSo I will find out what you said 'cause I'll hear it through the grape tree\nI heard something lately, I heard man wanna blaze me\nI heard man really wanna grave me, but it's all gravy\n'Cause  nothing don't phase me, I roll with the baby daily\nIt's right where my waist be, and it stays off safety\nAnd I only aim where your face be\nSo don't get feisty\n'Cause you'll D-I-E, no ifs, no buts, no maybe", "image": "https://images.genius.com/740efa825fbd96cd7e07044217f6bc55.450x450x1.jpg", "album": "Tunnel Vision Vol 1", "title": "16 Bar Rally"}]}