{"artist": "Ice-T", "songs": [{"title": "Freestyle/Zip-lock", "lyrics": "* originally performed in Montreux, Switzerland 1995\n\n[Intro: Trigger Tha Gambler, M.O.P.]\nCOME ON SWITZERLAND!! JUMP!! JUMP!!\nCOME ON!! JUMP!! EVERYBODY JUMP!!\nEVERYBODY JUMP!! EVERYBODY JUMP!!\nEVERYBODY LET ME HEAR YOU SAY YEAH!! (YEAH!!)\nSAY HELL YEAH!! (YELL YEAH!!)\nSAY HELL MOTHERFUCKING YEAH!! (HELL MOTHERFUCKING YEAH!!)\nNOW, SCREAM!! (AWWWWWWWWWW!!)\nSWITZERLAND!! (AWWWWWWWWWW!!)\nCOME ON SCREAM!! (AWWWWWWWWWW!!)\nYo T, let's do this shit baby, dog\n\n[Verse One: Ice-T]\nIs it new year God? I'm coming back mad hard\nMoving harder than a convict with a shack in the yard\nNew Jacks wanna hear me rap, begging for freestyle skills\nI've served so many rappers, I can make a land field, fool\nYou've doubt for a mic dude, the Ice is a jewel\nFuck rules, I got more pool than a mule\nMatter of fact, you never comprehend the styles I sin\nI keep breaking to annihilate fakes and teens\nThe Yellow nigga from the Westside cheered, I peel libs\nWhat praying that you do, yo when I all ready did\nLike your girl gotta admit she was a sexy bitch\nBut I hit it with the Jimmy so my nuts don't itch\nSo just check as I pore for the mic core\nTHE NIGGAZ!! THE NIGGA!! THE NIGGA!!\nSix ounces, squeeze the trigger\nFor you hardcore motherfuckers that's been dying for.. this gangster shit\nTime to squab and rob and fight, hit til you through\nI got a strain in my brain like pain\nBut niggas sucking up my shit like I'm some crack cocaine\nTo you white kids, you better watch your head\nAs you popping down the street by these words I said\n\n[Break: Trigger Tha Gambler, M.O.P.]\nMONTREUX MAKE SOME GODDAMN NOISE!!\nYEAH!! COME ON!! UHH!!\nGET THEM UP Y'ALL!! YEAH!!\nCOME ON MAN, LET'S RIP THIS SHIT!!\nRIP THIS SHIT UP!!\n\n[Verse Two: Ice-T]\nOnce again I'm back in the place to be\nThe I, the C, the E, the T\nI'll never get a Grammy, so fuck the G\nAll I need is crowd, and a M-I-C\nGot a gangster ass DJ named Evil-E\nMy record label's called Warner B\nWilliam Morris is my agent\nI'll never go broke, I got property\nGot a dope pitbull named Felony\nGot four gold albums, so what you're telling me?\nPower was two, Iceberg was three\nThis one here shipped five hundred G\nNow when I roll, I roll stupid deep\nBenz's, Bemers, and booming Jeeps\nI'm always strapped, cause my money I keep\nYou move on the Ice, and you're going to sleep\nBut when you see me walking down the street\nYou say, \"What's up Ice?\" -- what would I say, \"Peace!\"\nYou give me a dap, I give you one back\nCause I ain't souped, so forget about that\nWe might take a picture or sign an autograph\nKick a little flavor to have some fun and laugh\nBut step to me wrong, you might get shot\nAnd wind up looking out a ziplock!!!\n\n[Outro]\nYEEEEEEEAAAAAAAAAAAHHHHHHHHHHH!!", "image": "https://images.genius.com/705092b6df1c9ba34be13d3bca83d107.926x926x1.jpg", "album": "Gang Culture", "year": null}]}