{"songs": [{"title": "What is Real?", "lyrics": "Will you you talk about being from the hood, like we're glad\nWear it proud, like it's a badge\nBut I'll be damned if, when I'm a dad my kids don't have more than I had\nPlease don't confuse your situation, with identity, it's not the same thing\nYou were pharaohs and scholars, long before the day you were armed robbers\nBut, whatever, it's dumb to be clever, better to act like your brains been severed\nLike these Americans so called “artists” boasting about their latest garments\nBut the same labels make it very clear, they don't make clothes for dark skin\nCan't you see they're laughing? The question that I'm asking\n\nReal\nIs it real, really?\nNow is it real really?\n\nReal\nIs it real, really? (Is it real really?)\nI doubt it's real really\n\nReal\nIs it real, really? (dolla dolla bill y'all)\nNow is it real really?\n\nReal\nIs it real, really?\nI doubt it's real really. (uh, get money)\n\nPop champagne got my chain, act like you got no brain\nPop champagne got my chain, act like you got no brain\nPop champagne got your chain, act like you got no brain!\nCome on let's pop champagne!\nCome on let's pop champagne!\n\nSorry, if I don't dance enough for the radio to play my stuff\nAnd got no girls in the video playing the city ho loco shakin' their butts\nI thought that rap was about content, I see now that's just nonsense\nWe judge MC's by the Bentleys, and how much they can have no conscience\nHow many chains can you wear, and not care, the cost was a village somewhere\nStones of begets, slowly forget, this ain't the first time there were chains on your neck\nIt was much worse, choose to accept, but now vexed, just perplexed\nOf course that's all us people do all day, is pop champagne and have sex!\nWhy am I lying, I can't stand it, Chip on my shoulders the size of a planet!\nI organic on the mike and the flames I will fan it\nTo burn down the galaxy I'm up to the challenge\nBurn down the fallacy, scorch it with talent\nBurn down the anarchy, restore the balance\nI am the war with New York to Paris\nNo fun now around me, I'm far too savage\nYeah, hittin with knowledge, 'cuz we import it, ignoramus\nYou're playin' the stereotype, so of course you're famous\nIf for just one second you took your head from out your anus\nYou would see the motivation for your elevation\n\nWhat is real?\nIs it how much you make in the dollar bills?\nWhat is real?\nIs it how many you say you're gonna kill?\nWhat is real?\nOr is it something that I can truly feel?\nPlease tell me, please tell me, please tell me\nWhat is real?\n\nWhat is real?\nIs it how much you make in the dollar bills?\nWhat is real?\nIs it how many you say you're gonna kill?\nWhat is real?\nOr is it something that I can truly feel?\nPlease tell me, please tell me, please tell me\nWhat is real?\n\nStill, I got love for you, though it's very clear that you hate yourself\nI'm just saying don't food for the crap, being from the ghetto don't make you more black\nAlso the fact: this is bigger than the color of your skin\nIt's a matter that we're all in\nDumber you act, the bigger the cheer\nThe bigger the fool, the bigger career\nIt's about playing a role, the educated can't be controlled\nIt's about playing a role, the educated can't be controlled\nSo by keeping yourself dumb, keeping yourself under the thumb\nBy keeping yourself dumb, keeping yourself under the thumb\n(Feeding your face on the foods that are?) dumb, keeping yourself eating the crumbs\nElevating some fool with a gun, keeping ourselves numb\nSo we can fit in in a world where the price of life is less than the cost of living\nSo we can fit in in a world where the price of life is less than the cost of living\n\nHave you forgotten what is real?\nClose your eyes and don't believe that all you see is all you feel\n\nGot few tattoos, few bullet wounds? Silly songs? Deliver the tunes?\nThat tattoo may as well say coon, may as well grunt just like a baboon\nThat's what people see when they look at me, though they may applaud my stupidity\nIt's like sharks in a shark tank, watch them tear each other apart\nFind the sharks entertaining, but that don't mean that we think they're smart\nOr are for that matter, you maybe call yourself a rapper\nDisrespect women, but, but you are the one who is a slapper\nYou get paid to degrade yourself, publicly castrate yourself\n\nWhat is real?\nIs it how much you make in the dollar bills?\nWhat is real?\nIs it how many you say you're gonna kill?\nWhat is real?\nOr is it something that I can truly feel?\nPlease tell me, please tell me, please tell me\nWhat is real?\n\nWhat is real?\nIs it how much you make in the dollar bills?\nWhat is real?\nIs it how many you say you're gonna kill?\nWhat is real?\nOr is it something that I can truly feel?\nPlease tell me, please tell me, please tell me\nWhat is real?\n\nWe all play our positions, convinced that we are so different\nAccept these doctrines, and this nonsense, and we take these options\nWithout one second, never questioning just what the cost is\nYou're not a hater, you can't relate to the lowest denominator, dominator!\nNo, I don't wanna read the Source, I'd rather read some of Plato's thoughts\nOf course, let us not ever forget, the place in which where he was taught\nSo if it ain't clear, none of these clown rappers could be my peers\nIt's philosophical, historical, speculations that I thought were rhetorical\nLike what's real, is it my face if an atom is nothing but empty space?\nWhy the rock feel solid when I'm on it and a comet could collide with the Earth and dislodge it?\nOr maybe sonnets, metaphoric, promises the tonic for all that (is chronic?)\nIllness, apathy, ignorance tapestry that they weave to turn us into batteries\n\nWhat is real?\nWhat is real?\nWhat is real?\nPlease tell me, please tell me, please tell me\nWhat is real?\nPlease tell me, please tell me, please tell me\nWhat is real?\n\nHave you forgotten what is real?\nClose your eyes and don't believe that all you see is all you feel", "year": null, "album": "DoubleThink", "image": "https://images.genius.com/1d372a1e5ce6759370053ad0e1be955f.1000x1000x1.jpg"}], "artist": "Akala"}