{"songs": [{"year": "2016-10-21", "lyrics": "[Intro: D.R.A.M.]\nHey\nLooking, oh-whoa, hey\n\n[Verse 1: D.R.A.M.]\nI know you working hard\nBut how you gon' figure me out? Hey\nHuh, always running your mouth\nNever knowing what you talking about, hey\nLook, what's there to figure?\nWhen you speak of that nigga that you can't understand\nHey, and now I'm all on the road, huh\nRunning 100 miles an hour, not even which way to go, huh\nLook, if I don't know myself\nThen tell me how do you know? Huh\nI've come to prove and show you niggas\nThat I'm trained to go, look, uh, hey, uh, uh\nBut what's there to figure?\nWhen you speak of that nigga, you don't understand\n\n[Verse 2: Young Thug]\nBut fuck it, I flood this ho with these bands\nDo a drive-by, fly-by, leave him where he staying\nI just bought an AP, it's cleaner than stainless\nI wish I could tell him but he duckin' dangerous\nHe ready for popping off and all he ain't scared of us\nHe say he ain't no snitch but he tired of tellin' us\nI flood that bitch with Gucci she stand from the ceiling up\nFuck the cops, they killing us, they kids are not real as us\nBut what's there to kill about?\nWhen these bitches and niggas, they won't just understand\nDat-dat I can fuck any bitch in here without paying\nHey, where my phone at? Call up Tar, I need some Xannies\nI want these poor niggas to complain\nI want these fake robbers to keep laying\nAnd he ain't want these fake bitches to keep singing\nThink they baby is mine like they gon' get a dime\nWe'll work it out with time\nI want yours cause you got mine\nYeah-yeah-yeah-yeah, it ain't nothing to talk about\nSo I'm like what's there to kill about?\nWhen these bitches and niggas, they won't just understand\n\n[Verse 3: D.R.A.M.]\nAs I revisit what I made for you to listen to\nI get into my zone and let go, that's the ritual\nAsk but when I mention you, not having clues and being fooled\nDarling to this one trick pony, thought \"I'm not the dude\"\nAnd you can be a local heathen to the son of Satan\nI give it up to him who praises and that's all I'm saying\nI made a killing for a better life\nRemember once and I'll forget it twice\nTook advantage over night\nI pray to God and hope I'm moving right\nI pray on y'all to quench my appetite\nTold you that my screws ain't tight\nI had to buckle down and focus cause I almost lost it\nI was hemorrhaging in the red and I could not afford it\nNiggas tried to appropriate me, I could not go for it\nI'm talking mine, I'm claiming mine, bitch I go Narcos for it\nThey gon' make me glow up, I got no choice I'm saying\nBut what's the point of saying if you still won't understand?", "title": "Misunderstood", "album": "Big Baby DRAM", "image": "https://images.genius.com/a01101e6d0af1e6a6c6bd062579f30f8.1000x1000x1.jpg"}], "artist": "DRAM"}