{"artist": "Kool A.D.", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/1362185468_Kool-AD-Okayplayer-interview2.jpg", "title": "Fatwa", "year": "2016-12-30", "album": null, "lyrics": "Yes yo and you don’t stop\nHa real hip-hop and you don’t stop\n\nYo, fuck the police ha\nPraise Jah, Allah\nI put the fatwa on all of your fake rappers\nA lot of y'all never saw drugs and is fake trappers ha\nBut really though legalize drugs\nTake back the blackman enslaved by the prison system\nMan, it’s plain as day - shit ain't right\nYou drink the pain away, smoke the pain away\nFuck the pain away\nWalk through the west side 'oast ghosttown\nFuck the chain away, I mean tuck the chain away\nOr either way either or [Hunters Point p hill fruitvile ESO] stand up\nLife is just a series of electric signals\nFuck the world grab 'em by their pig tails\nThe [sithfrile] demons relinquish their crippled claws eventually\nHa, Babylon fall, dog its meant to be\nLove joy hope faith peace less reality\nEverything is everything\nUnderstand the earth in its wild true energy\nGrow up, visually blow up\nSpitting like the [?] two color throw up\nBoys like [Dylone] picture up [the nylone] ...what? picture of...\nI mean picture of [the nylon] thats whats up\nAait yo look at all the beautiful music that I style on\nStyles on top of the mars roof with the tiles on it\nYour boy at ema style so incredible sincretical heavenly\nMan look this is the ill reality transcender the spoon bender\nThe soul cinema replicates itself within the mind\nThe light war, the healing procesees, the various conflicting prophesies\nI speak with no notion to convince you of anything\nAll of your knowledge is subjectively true and I'm you anyway\nIf you're not thinking what I'm thinking you will one day or maybe you already did?\nEverybody knowledge is in constant flux, everybody wisdom grows their knowledge to an understanding\nOver-stand that culture of freedom is for fall magnanimus\nMen is only existent via networks of power\nBut who cares refine your mind to a new elevation equality\nThats the true relegation the god style - build and destroy\nWorlds born and the cypher complete\nSee the mathematics refracting the prism right\nThe prismatic prison light, abolish all prisons, right?\nYou, the vision high, priestesses, swinging their little incenses\nThe nature of existence is smoke,understand we live in the worlds untouched by\nOur own notions of mystery, all of that resides in peripheries\nBarely understood but felt\nA lot of y'all cats hella soft like filth\nIma boss like Nelson Mandela\nFuck the part time - art life, like I said before\nI'll say it again, fuck it\nNo thing under the sun is any different from the infinite flux your boy giving a fuck"}]}