{"songs": [{"year": null, "album": "Trapped in The Dollhouse", "image": "https://images.genius.com/553e27f554917e052bdcdd80acf27877.600x600x1.png", "title": "Summer Sixteen", "lyrics": "[Verse 1: Kash Doll]\nI’m out here tryna get them m’s\nYeah, all summer ‘16, all summer ‘16\nAnd my whip so clean\nAnd I’m getting this money like I own a football team\nAnd my ass so fat, and my head game mean\nI’m out here tryna get them m’s\nDon’t make me pull up on hoes\nThe way that I flex on this bitches\nIs like I pull up on hoes\nSteph Curry with the shot\nI might just pull up on hoes\nAnd I’m your fairy boss mother\nI should put pull ups on hoes\nI don’t give a fuck about a hater\nAll I wanna do is get this paper\nAll I want to do is get a check\nWhen I see a hater, see you later!\nHaha, bitches be making me laugh\nBut you will never be Keisha\nDifference is I count up the cash\nI went and bought an Audi, this bitch bought a Honda\nHer shoe game is broke! I’m wearing red bottoms\nI’m flying first class, these bitches flying coach\nMy bag is Chanel, her purse came from Coach\nMan get the fuck out of here!\nYeah, Ms. Twerk Something with the dance moves\nRicky Ross with the moon walk\nChief Keef with the goon talk\nYoung Thug with the swag shit\nGetting money I’ma brag bitch!\nRi-Ri made the niggas work\nBlac Chyna, I’m a bad bitch!\nYeah, I’m in a pink foreign with the roof gone\nBaby cop a feel with the coupe\nHit a button now the roof on\nOnly fucking with the bad bitches\nOnly fucking with the real niggas\nMiddle fingers for these mad bitches\nFuck you and all your ugly friends\n\n[Bridge: Kash Doll]\nI’m so fucking tired looking on my timeline\nNo this gotta be said, these bitches getting all this work done\nBut you still ugly, you still ugly\nLook at this point\nFix your weave out\nBefore you come for me\nYou know what, at this point put some respect on my name\nHaha\nIs she done?\n\n[Verse 2: B. Simone]\nBitches be thinking that I worry ‘bout ‘em\nHonestly I don’t give a fuck about them\nHonestly I can really do without them\nI took your man, pull um in his phantom\nI’m tryna go vegan I’m good on the beef\nYour nigga be creeping, work until you see\nBitches is fake, I don’t let ‘em leech\nIf I run a man, he never gon’ leave\nI get my sun no astrology\nThese bitches they need to acknowledge me\nThey are my sons, not biologically\nBut mommy deserves an apology\nI’m at the top and you can’t get on top of me\nNiggas play games so I call them Monopoly\nI am for sure bitch and your just a probably\nFucking with me, getting money, he gotta be\nOoh!\nDamn, you ain’t my dude so why is you tripping (what?)\nNigga stop bitching I just let you eat up the kitten\nGive me good too, and then it’s good riddens\nKilling these bitches like fuck a civilian\nSwear you the bomb I never heard you ticking\nBitches talk shit, and then they go missing"}], "artist": "Kash Doll"}