{"songs": [{"lyrics": "[Intro: MC Ren + Dr. Dre]\nThe world's most dangerous group\nOnce again beating on your motherfucking eardrums\nDoing much damage for all you slutty ass ho's\n\n[Verse 1: Dr. Dre]\nYo, there was a bitch I knew on the avenue\nShe was good to G-O for a nut or two yo\nI think her name was Clara\nAnd she was guaranteed to give a motherfucka whatever he needs\nTo be perfectly honest, she was a hooker\nSo I took her a hundred yards, to the boulevard\nI told her \"I'll take care of you, you take care of me\nYou've got a P-I-M-P and all I want is the money\"\nShe went to work and the niggas were fiendin'\nYo, she had the biggest ass that you ever seen\nIn fact she was like Medusa, with titties full grown\nOne look and your dick turns to stone, yeah\nKeepin' in mind that she was the kind that would find the time to get mine\nBecause she knows I'm not to be fucked with\nShe ain't crazy\nFuckin' with Dre, she'll be pushin' up daisies\nShe was the perfect ho, but wouldn't you know\nThe bitch tried to gank me, so\nI had to kill her\nYeah, straight hittin'\nNow listen up and lemme tell you how I did it\nYo, I tied her to the bed, I was thinking the worst\nBut yo, I had to let my niggas fuck her first yeah\nLoaded up the forty-fo', yo\nThen I straight smoked the ho\nCause I'm a real nigga, but I guess you figure\nI was soft and she thank me\nCoughed to the boss and got tossed\nOne less bitch you gotta worry about\nShe's outta here and that's how it turns out\n\n[Verse 2: Dr. Dre]\nNow Vicky Vicky Vicky, she's very tricky\nShe put her hickey on top of my dick, sick bitch, see?\nShe told me she loved me and she wanted to keep me\nIf only she can have the dick weekly\nI said I'm with it but baby you gotta hold up\nIf I was happy with somethin' that I could fold up\nWe can do this - she said her husband was rich\nThen I knew I had the bitch\nYo she wrote a check, many a check\nIn the name of a bitch who was strugglin' at the same game\nAll I wanted to do was get P-A-I-D\nJust a little somethin' for fuckin' me\nYo Everything was cool but Vicky concerned me\nHer husband was the District Attorney\nSo, before he found out he was crossed up\nBy his bitch I was fuckin' I had her tossed up\nAnd put to sleep, so a nigga never forgets\nA dead bitch can't tell a nigga shit\nOne less bitch you gotta worry about\nShe's outta here and that's how it turned out\n\n[Hook: MC Ren]\nOne less\nOne less\nOne less bitch you gotta worry about!\n\n[Verse 3: Dr. Dre]\nThinkin' about money, and lookin' at a prostitute\nThe bitch was cute, so now I had to execute\nAnd shoot game like a real nigga\nWith a steel trigga\nConvince her to move up to somethin' bigga\nI think I had a flashback though\nCause I said \"fuck it\"\nLoped and choked and smoked to the ho' like this:\n\"Bitch, it's all about Dre\nThe money, money, money and this all I gotta say\"\nOf course she came with me and remained with me\n'Till the bitch felt lamed and ashamed to be\nWorkin' that trick shit\nCause niggas knew that she was short one\nA little later though she caught one\nIn the chest and I knew that it was commin'\nBy who and how the all act would be done?\nSo what? One less bitch I gotta worry about\nBut that ain't how it turned out..\n\n[Verse 4: MC Ren]\nYo, there was a bitch named her out and shot her\nStraight to the muthafuckin' trigger and said \"I got her!\"\nBut I had better plans to give her the blues\nLike dumpin' her in the river with cement shoes\nI knew my money was comin' up short\nAnd the thought that the stupid bitch thought she'd never get caught\nCame home early and straight bust her ass\nOn the couch with her other nigga countin' my cash\nI should've known she was like them other hoes\nI told the two motherfuckaz to take off their clothes\nButt naked, nothin' left but the shoes\nI had up a nine so they couldn't refuse\nI shot the nigga, he was outta there\nAnd tied up the bitch to the motherfuckin' chair\nNow there's one less bitch I gotta worry about\nEverybody out, that's how it turns out\n\n[Hook: MC Ren]\nOne less\nOne less\nOne less bitch you gotta worry about!\n\n[Outro: Eazy-E]\nIn reality, a fool is one who believes that all women are ladies\nA nigga is one who believes that all ladies are bitches\nAnd all bitches are created equal\nTo me, all bitches are the same\nMoney-hungry, scandalous groupie hoes\nThat's always ridin' on a nigga's dick, always in a nigga's pocket\nAnd when the nigga runs out of money the bitch is gone in the wind\nTo me, ALL BITCHES AIN'T SHIT!\n\n[Hook: MC Ren]\nOne less\nOne less\nOne less bitch you gotta worry about!", "album": "Efil4zaggin", "year": "1991-05-28", "title": "One Less Bitch", "image": "https://images.genius.com/378262f83025b434fc5375a332bd1a1f.800x800x1.png"}], "artist": "N.W.A"}