{"artist": "Cam’ron", "songs": [{"title": "Get Ya Gun", "album": "Killa Season", "year": "2006-05-16", "image": "https://images.genius.com/82f464ee78c43b9e36f93d5d33f24db9.1000x1000x1.jpg", "lyrics": "[Verse 1]\nThat's my word (word!); I flip herb, birds\nCoke, crack, dope, smack; oh, snap! Heard, herb\nShould talk in sign language, y'all don't deserve words\nI get my serve swerved; may leave 'em 1st, 3rd\nStop lyin'? Lie for what? Steer a whip, drive it up\nSteer a brick, pie it up; supply the stuff, fly as fuck\nSaid word, (word!) nigga; just observe, I disturb\nFrom New Jerse to the curb, make absurd figures\nStop lyin', picture me poutin'; dog, could you fish in a fountain?\nBad bitch switchin' and bouncin' (in what?) in that Christian Louboutin\nWord, on everything, on everything, you still in spinners\nKnow what I feel in the winter? 80 degrees, deal with a winner\nI know some rowdy rowdy niggas that rock a Audi proudly\nOne thing 'bout me: doubt me, bounty Saudi shout me\nI'm sprayin' it well, I'm playin' the sell\nFifty mil like David Chappelle, my paper propel\nWon't lay in a cell; you takin' a L\n\n[Hook]\nThis is fun, nigga; you should run, nigga\nGet ya, get ya, get ya, get ya, get ya gun, nigga\nThis is fun, nigga; you a dumb nigga\nGet ya, get ya, get ya, get ya, get ya gun, nigga\nWhat let's go to the car, what let's go to the car\nGet ya, get ya, get ya, get ya, get ya gun, nigga\n\n[Interlude - Beth Melillo]\nDid you know that a 3 year old has the physical strength to shoot a gun?\nJuvenile gun possession is a problem\nIf a child obtains an improperly stored gun\nThe adult owner is criminally liable (killa!)\nThe restrictions are endless\n\n[Verse 2]\nYo, sell you crack for a dub, it's a package of love (it's all love)\nThe car's far, I'm at the bar, got my gat in the club (poppin' Sizzurp)\nAnd my ratchet is snub (snub), just for you actin' a thug\nYou will get smacked with some bub, I got my mask and my glove\nYup, we wildin' again, the cops you dialin' again (what)\nGuns matchin' my jeans (what's that?) I'm just stylin' my friend\nI better get squashed (why?)\nWhen that telly is ready, I medley a deadly, a sauce\nThat'll petty a steady already get heavy and hard\nAnd I got them mami's screamin', \"Dammit, man!\"\nReally, \"Dammit, Cam!\", hand in hand to a Phantom tan (God Damn)\nPam pam man, no man or land could jam with me (nope)\nDamn fam a jamboree, posse gangs and family (where we at)\nIn front of the corner store under the canopy\nChick wanna stand with me, she gotta drink a can of pee (here, drink this)\nThat's a pineapple soda (what's this) this a pineapple Rover (what happened?)\nDon't sit on the hood, time after time I done told ya"}]}