{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "Leaving Interscope", "lyrics": "After battling with his major label for years, 50 Cent has decided to become an independent artist.\n\nThe rapper announced Thursday that he's leaving his longtime record label, Universal Music Group's Interscope Records, and Eminem's imprint, Shady/Aftermath.\n\nThe Grammy winner and his G-Unit Records have signed a distribution agreement with Caroline, the independent label at Capital Music Group. Capitol is one of the many labels that are part of Universal Music Group.\n\n50 Cent launched an ultra-successful, six-times platinum debut with \"Get Rich or Die Tryin'\" in 2003, when he burst on the music scene with Eminem as his mentor. His sophomore album, 2005's \"The Massacre\" was almost as successful, but other albums didn't match his previous efforts and he expressed his unhappiness with his label. 50 Cent had been planning to release a fifth album on the label, but it was set with multiple release dates and singles, and eventfully didn't see a release.\n\nHis last album was 2009's \"Before I Self Destruct,\" which also had several release dates.\n\n\"I have had great success to date with Shady/Aftermath/Interscope and I'd like to thank Eminem and Dr. Dre for giving me an incredible opportunity,\" 50 Cent said in a statement. \"I've learned so much from them through the years. I am excited to enter this new era where I can carry out my creative vision.\"\n\n50 Cent had a plethora of hits early in his career that dominated the pop, rap and R&B charts, from \"P.I.M.P.\" to \"Candy Shop\" to the anthemic \"In da Club,\" which introduced the young rapper aside Dr. Dre and Eminem.\n\n\"Both myself and Shady Records are grateful to have had the chance to play a part in 50's career,\" Eminem said in a statement. \"Shady simply would not be what it is without 50 Cent. I've developed a great friendship with 50 over the years, and that's not going to change. We know 50 will have success in his new situation, and we remain supporters of both him and G-Unit.\"\n\nThe rapper, born Curtis Jackson, has also been a success outside of music, from film roles to fashion to books.\n\n50 Cent's new album, \"Animal Ambition,\" will be released June 3. Caroline has recently distributed albums by Korn and rapper E-40.\n\n(Report by ABC News)", "year": "2014-02-20"}]}