{"songs": [{"year": "2010-07-16", "album": "The School Bus Chronicles", "image": "https://images.genius.com/cda5596063e88290d985987fb350a07a.342x342x1.jpg", "title": "Best I Ever Had", "lyrics": "[Intro]\nYeah, alright, headphones up, know what I'm saying?\nCheck! Yeah, alright\nKirk with me on this one\nKnow what I'm saying? Yeah\nDrop this beat\nAlright, Dre, Dalvin\nCheck it\n\n[Verse 1]\nDedicated to you, and baby, you only\nQuit messing with the lames, I swear them boys phony\nAnd if they ever hurt you, I swear you can phone me\nBut until then, I'ma wait by the phone and be lonely\nYou know me, you know me\nNever ever change\nNumber still the same, style still plain\nBut flyer than a plane, move faster than a train\nJust for you, man, put that on everything\nPut that everything, and I'm never really sane\nBut everything can change when I see your name\nWhen I see your name, oh, when I see your name\nWhen I see your name, yeah, yeah\nAy, I bring it back for the one in the crowd\nThe one screaming super loud for the child\nWell, that is only in my dreams\nLife ain't how it seems, full of tricks and schemes\nFighting the screams, I love you in them jeans\nLove is not for teens, freshest on the scene\nSaying that your girls flyer than pluto\nIf you ain't 'bout me, then who so?\nCause I know I'm better, I know I'm so clever\nSo whoever you really wanna do it with, it's up to you\nBoo, I got shot by a cupid\nI don't wanna look stupid if I ask you out\nIf I find out my luck's run out\nI guess I'm screwed, and I guess I lose\nIf I ain't got you, then tell me who do\nNah, if I ain't got you, then tell me who do\nAnd she hold me down\n\n[Verse 2]\nIf I ain't got you, then tell me who do\nDo I know the dude? I probably do\nJust tryna play a player on the crew?\nAnd if you are, I swear it's cool\nI'll just stay away from you, that's the best I can do\nI guess my loving's to be test, yes\nThat is fine with me\nLyrical, spiritual, rising MC\nIs what I'm tryna be\nIf you ain't with it, then I'll move on\nJust this fantasy life and my fantasy mic\nWith a real time mic in the real time lights\nIn real time life\nStars come out in the night, that's what I heard\nThe words that I drop when I'm cruising down the curb\nYou see me, try to be me, the best\nYou can't defeat me, I'm dreaming"}], "artist": "Kevin Abstract"}