{"artist": "Ice Cube", "songs": [{"title": "Hello", "lyrics": "[Bridge]\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes\nHello\n\n[Chorus: Dr. Dre & MC Ren]\nI started this gangsta shit\nAnd this the motherfuckin thanks I get?\nI started this gangsta shit\nAnd this the motherfuckin thanks I get?\n\n[Verse 1: Ice Cube]\nThe motherfuckin world is a ghetto\nFull of magazines, full clips, and heavy metal\nWhen the smoke settle..\nI'm just lookin for a big yellow;\nIn six inch stilettos\nDr. Dre, Hello, perculatin keep em waitin\nWhile you sittin here hatin, yo' bitch is hyperventilatin'\nHopin that we penetratin, you gets natin\nCause I never been to Satan, for hardcore administratin\nGangbang affiliatin; MC Ren'll have you\nWildin off a zone and a whole half a gallon\n(Get to dialing) 9 1 1 emergency\n(And you can tell em) It's my son he's hurtin me\n(And he's a felon) On parole for robbery\nAin't no coppin a plea, ain't no stoppin a G\nI'm in the 6 you got to hop in the 3, company monopoly\nYou handle shit sloppily I drop a ki properly\nThey call me the Don Dada\nPop a collar, drop a dollar if you hear me you can holla\nEven rottweilers, follow, the Impala\nWanna talk about this concrete? Nigga I'm a scholar\nThe incredible, hetero-sexual, credible\nBeg a ho, let it go, dick ain't edible\nNigga ain't federal, I plan shit\nWhile you hand picked motherfuckers givin up transcripts\n\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes (Hello)\n\n[Chorus: Dr. Dre & Ice Cube]\nI started this gangsta shit\nAnd this the motherfuckin thanks I get?\nI started this gangsta shit\nAnd this the motherfuckin thanks I get?\n\n[Verse 2: MC Ren]\nVillain blows up yo' spot\nTake yo' notebook yo' bitch and yo' Glock\nThis motherfucker thought the coochie had a padlock\nYou slapped her ass that's alarmin\nCause she want my Worm like Carmen\nWe chin check niggas, them thin check niggas\nRun trains on gold diggers beware these fo' niggas\nScarin motherfuckers like Stephen King flicks\nMakin' niggas clear the room like a dyke fleein' dick\nMakin 2nd II None shit, nigga like Quik\nSo when I bomb first nigga who you rollin with?\nFuck that ice on your wrist, fuck yo' fine ass bitch\nCause you could lose it in a tussle nigga watch me hustle\nWatch niggas kiss my ass without flexin a muscle\nBitches - all in the back they knees waitin to buckle\nSame time same channel don't change the dial\nNiggaz4Life, fuckin your wife, these niggas wild (Hello)\n\n[Chorus: Ice Cube & MC Ren]\nI started this gangsta shit\nAnd this the motherfuckin thanks I get?\nI started this gangsta shit\nAnd this the motherfuckin thanks I get?\n\n[Verse 3: Dr. Dre]\nDid I fall off? - Got you in your room\nRippin every \"Chronic\" poster on your wall off\nJust cause I put away the sawed off\nNow I got you sittin back with a smirk;\nListenin with your arms crossed\nQuestionin Dre's credibility (What?)\nWondering if it's still in me to produce hits;\nY'all be killin me\nAs if I need to make mo' - I got a mansion\nAnd six cars that are paid fo' - suck my dick! (Hello)\nWe came a long way from not givin a fuck\nSellin tapes out of a trunk to movin this far up\nNow we got the whole world starstruck\nMade a million plus and still don't give a motherfuck\nMotherfucker I'm Dre - I don't need your respect\nI don't need to make another album bitch I don't gotta do shit\nI do it because I want to not to stay in the game\nFuck the fame, I'm still stayin the same, lil' bitch! (Hello)\n\n[Chorus: Dr. Dre & MC Ren]\nI started this gangsta shit\nAnd this the motherfuckin thanks I get?\nI started this gangsta shit\nAnd this the motherfuckin thanks I get?\n\n[Ice Cube]\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes (Hello)\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes\nLook at these Niggas With Attitudes..", "image": "https://images.genius.com/1748d50e44b272a67efde5b25bbea9c7.899x780x1.jpg", "album": "War & Peace Vol. 2 (The Peace Disc)", "year": "2000-01-15"}]}