{"artist": "E-40", "songs": [{"title": "Be You", "image": "https://images.genius.com/7da108e257a86c75f207873e9454a951.500x500x1.jpg", "album": "The Block Brochure: Welcome to the Soil 3", "year": "2012-03-26", "lyrics": "[Verse 1: E-40]\nUh\nThey was wrong when they said ain't nothing new under the sun\nCause everything under the sun has not been done\nWhat they shouldn't miss? Don't miss yo call\nThe biggest chance you can take is not taking the chance at all\nLike who you wanna like, love who you wanna love\nKiss who you wanna kiss, hug who you wanna hug\n?, white, black\nFat, tall, small\nOpposite the tracks, whatever it's on ya'll\nI came in the game, with a hope and a wish\nWith no bait on my hook, tryna catch a fish\nTryna have meals, four course\nGot hella ideals, but no resources\nDon't let them knock your motivation, keep tryin'\nYour probably just ahead of yo time\nLike me, they told me I'd never progress and\nBe-become what I am today, them niggas dead wrong\n\n[Hook: J Banks] x2\nYou gotta be original\nJust be you\nJust be you\nTake a chance and show the world you\nJust be you\n\n[Verse 2: Too $hort]\nWe Gonna Hop In The Ride And Let The Rims Roll\nGotta Hundred Pair Of Nikes No Timbos\nAnd No I Never Had No Afro\nBut I Still Keep Everything Natural\nSo Many People Wanna Look Alike\nAnd Act The Same, But What's The Price\nWhen You Got No Game, They Won't Let You Play\nYour Too Stingy, You Shouldn't Act That Way\nCause Your Goin Have To Pay, If You Don't Speak Your Mind\nYou Been A Follower A Long Time\nStop Lying And Just Be Yourself\nAin't Nothin Wrong With That\nYou Got Racks, You Must Be On Some Crack\nCause The Last Time I Checked You Was Struggling\nHad A Whole Lotta Bad Luck Drug Dealing\nNow Get Back On Track Like You Need To\nStop Following The Crew And Be You, Nigga!\n\n[Hook: J Banks]\n\n[Verse 3: E-40]\nDo What They Don't\nWhen It Come To Follow Trends, You Won't\nYou Got Your Own Mind And Your Own Ideas\nRefuse To Be Like Everybody Else, (For Realz)\nSo Original, (Like Who?), Like Me\nCreative And Unique, People Love The Way I Speak\nThey Hatin On The Son Of The Man Up Above\nAnything Different They Afraid Of\n\n[Verse 4: Too $hort]\nWe Comin' Through Hard Again\nWe Got Chains And Pieces, New Car And Rims\nIt's E-40, Short Dogg And Them\nAlota Hustlers, Gangstas, All The Pimps\nIt Sounds Good When You Turn It Up Loud\nDo It Your Way And Rock Your Style\nYour Hair Your Clothes Even Your Smile\nThey Goin Love You Cause Your So Original\n\n[Hook: J Banks]\n\n[Speaking: E-40]\nStop Being Somebody Else When You Can Be You Mane\nBe You\nYou Mane\nBe You\nWhen You Can Be You Mane, Be You\nStop Being Somebody Else When You Can Be You Mane\nBe You\nYou Mane\nBe You\nWhen You Can Be You Mane\nBiatch!"}]}