{"songs": [{"image": "https://images.genius.com/26492136e5e9457b3426488e6702d9ad.1000x1000x1.jpg", "title": "A Miracle", "album": "Mailbox Money", "year": "2014-12-31", "lyrics": "[Intro]\nIf what I believe\nIs proved to be wrong\nThen I guess I'm a miracle\n\n[Chorus]\nI was been supposed to change up\nI was been supposed to fold all this pressure\nI was been supposed to change up\nNigga, what would I look like? I come from the hood\nI represent the only way up\nHad to hustle, boy, I'm tryna touch a toy\nI'm tryna fuck these L.A. streets up\nThink it's safe to say I did it\nLook nigga, uh\n\n[Verse 1]\nAll black everything and my diamonds all love like Vera Wang\nLook, blue rags in the south of France\nThere's some things in life that won't ever change\nMe? I'm a nigga that's supposed to ball\n'Cause I'm a street survivor and they mold us wrong\nBefore rap we was rollin' stones\nI drove a Cutlass coupe, would cop a quarter zone\nFront of the buildin' on my mobile phone\nI'm thinkin' pace myself 'cause you could overdose\nNot on the drugs but the life you chose\nBy hangin' niggas, I don't like the row\nNo such thing as they might parole\nThey putting cameras up in microphones\nThey got me sandwiched in, I want a nicer home\nThey know I take the risk, I don't know right from wrong\nPlus any given day you might be gone\nNo cliché where the lines get drawn\nCome on the block, it's a riot zone\nFor the loot niggas stoop into pirate mode\nPaint with less strokes and divide you, dawg\nGuns get drawn, niggas lives get lost\nNever was entitled, had to fight for raw\nNecessities in life, you see the reason, right?\n\n[Chorus]\nI was been supposed to change up\nI was been supposed to fold all this pressure\nI was been supposed to change up\nNigga, what would I look like? I come from the hood\nI represent the only way up\nHad to hustle, boy, I'm tryna touch a toy\nI'm tryna fuck these L.A. streets up\nThink it's safe to say I did it\nLook nigga, uh\n\n[Verse 2]\nAll black everything in my 600 Benz with a heavy chain\nLook, you deserve a real nigga with money\nThere's some things in life that won't ever change\nMe? Fell in love with a cutie\nA celebrity herself, prolly fuck with her music\nShe the one that the shoe fit but I can't stop for love\nLook how the game has seduced us\nBenihana's or the Ruth's Chris\nA lot of new responsibilities with all of this influence\nSpendin' racks, therapeutic\nSo I snow flake the face like A.C.s in my new shit\nOne button, where the roof went?\nTMZ takin' shots, say cheese for the news clips\nDope boys and them boosters\nGangbangers and hoopers\nMy style is inclusive, the streets is abusive\nBut it's life, my nigga, wanna survive, gotta shoot shit\nHella thick skin, never bruise quick\nYellow wrists and some 7-speed shit\nI talk to you on some suck a D shit\nAll visual, nigga going digital, nigga\nNot the smartest nigga but its visceral, nigga\nMy understandin' on a level kinda different, my nigga\nEvery time I drop, the city a feel it\nEvery time you hate, you gotta be kiddin'\nEvery time I pull up, the foreign is kitted\nAnd I can't even really walk through the Beverly Center\nHudson jeans on, ain't the regular demin\nI bought the 600, not the regular Benz\nFamous without a deal, that ain't regular nigga\nTired of tellin' you niggas I'm not a regular nigga, no!\n\n[Chorus]\nI was been supposed to change up\nI was been supposed to fold all this pressure\nI was been supposed to change up\nNigga, what would I look like? I come from the hood\nI represent the only way up\nHad to hustle, boy, I'm tryna touch a toy\nI'm tryna fuck these L.A. streets up\nThink it's safe to say I did it\nLook nigga, uh"}], "artist": "Nipsey Hussle"}