{"artist": "Angel Haze", "songs": [{"title": "Exposed", "image": "https://images.genius.com/a5a273b369e9716812075c0771b06c4b.600x600x1.jpg", "album": "Back to the Woods", "lyrics": "[Verse 1]\nSince '91 I been a menace, for real\nBorn rotten and exposed\nA rose in a garden full of hoes\nA flowerbed of souls\nWhere the flowers never learn\nThey can go, they can grow, they can—\nThey can be something\nI'm a bird, I'm a bird—\nLook at me fronting\nBeen confused and obtuse, gotta mean something\nI don't feel, I don't feel, I mean nothing\nMama look around, what you gotta say?\nYou probably never gave a fuck about me anyway\nI know I'm foolish, 'cause I love you with my whole soul\nBut I keep running so, I ain't gotta home—\nI don't wanna go home\nRunnin' from the fire in my brains, in my ozone\nRunnin' from the pressure 'till I cave in my own home\nYou don't understand the obsessions that I got\nI need love, I don't feel that shit a lot, nigga\nBeen alone from the motherfuckin' jump, man\nEvery battle, every hurdle, every hump, man\nBitches either feel it or they motherfuckin'\nDon't, man\nTime to draw the line and do the motherfuckin'\n*Snort*, man\nMan, listen, I don't talk about myself, nigga, oh no\nYou don't get it, you don't feel it, nigga, oh no\nWhere I'm from is a nightmare, not a smoke show\nNiggas never make it there, they never make it, oh no, nigga\n\n[Instrumental]\n\n[Verse 2]\nI'm from the generation of the scarred and abused\nFor real, man\nYou're either dead or you're dyin' or you doomed\nAnd what's worse is nobody's got a clue\nOf what the fuck that I go through in my brain\nThat there's a fuckin' beast of the motherfuckin' chain\nThat I be having dragons in my heart being slain\n'Till I'm broken and too vulnerable again\nLove—nobody ever showed me what it was, my nigga\nFor real\nI've been beggin' since a youngin', since a cub, my nigga\nFor real\nSaw into your pretty blue soul like the rainbow\nMy third eye saw your devil and your angel\nWe tried to love each other from a different angle\nUnfortunately, we still got strangled\nI don't even know if I'm-ma make it to the next day!\nEvery day, I wake up and I feel like it's my deathday!\nYou can see inside me like a motherfuckin' x-ray!\nLosin' to my demons in a motherfuckin' chess game!\nIt's a hard life I choose to lead\nThe memories' so lucidly\nI'm just speakin' truthfully\nIt's hard to breathe, it's hard to breathe, damn", "year": "2015-09-14"}]}