{"artist": "Big Boi", "songs": [{"lyrics": "[Chorus: Big K.R.I.T. & Big Boi]\nShe said her name was Tangerine, damn the American dream\nShe all about her fuckin cream, so shake it like a tambourine\nShake it like a tambourine, she shake it like a tambourine?\nShake it like a tambourine, she shake it like a tambourine\nShe said her was Billie Jean, said she wanna show me things\nI pulled out a stack of green, shake it like a tambourine\nShake it like a tambourine, shake it like a tambourine\nShake it like a tambourine, shake it like a tambourine\n\n[Verse 1: Big Boi]\nOnce upon a rhyme I knew this girl and she was fine\nAs everything outdoors, the kind of girl I describe her like-like-like\nMichael Jordan when he's froze in a pose of a Jumpman\nTop flight security on these hoes man\nShe drop it low only for me to pick her up\nWhen she's liquored up I'm leavin my fingerprints on her butt\nA ten-hut, at attention as we stand for this woman\nGeneral Patton, boy stop, we think she cummin\nLovin the way that I'm dickin her down, Boi you bluffin\nNothin but a nigga like me be straight up royal flushin\nBut this ain't 'bout playin no cards dummy\nHer give me open mouth sugar and she go hard for me\nEven take a charge for me, if the coppers caught us ridin\nTo get a tray of fruit, and a pack of 1-point-5's and\nI'm all the way on them papers, she all the way on my team\nWe burn it down like California trees in the breeze\nFire!\n\n[Verse 2: Rick Ross]\nSmoking like a big chief, fried like a six-piece\nStyrofoam cup, sipping on that fish grease\nUnhh! Got Pocahontas on my Yokohamas\nA lot of chrome, top open, smell that marijuana\nYeahh, I’s a playa by nature\nAll the ladies catch feelings, fuck niggas catch vapors\nModern gaze, Marvin Gayes (unhh!)\nUpgrade to G6, avoid the planes (yeahh!)\nYou not avoiding in my circle\nThe Audemars Pearl got ya girl face purple\nMCM jacket in my throwback\nGet head, and I never get a throw back, unhh!\n\n[Hook 2: Big Boi & Khujo Goodie, & Fabolous]\nShake it like some Texas Pete dropping on your collard greens\nMake it hotter and she want a dollar do you follow me?\nShake it like a tambourine, shake it like a tambourine\nShake it like a tambourine, shake it like a tambourine\nSmelling like some tangerines, rolling like she on some beans\nGarter belt full of green, booty busting out the seams\nShake it like a tambourine, she shake it like a tambourine\nShake it like a tambourine, about to shake it like a tambourine\nBig Boi, what’s up? Unh!\n\n[Verse 3: Fabolous]\nShe don’t even walk, she wobble past\nIf she was a dog, she’d be a bobble-ass\nI slap cheeks like Pimp, so I probably has\nLoso, and rhinestones on the goblet glass\nIt’s me and you with our “Batman & Robin”-ass\nIn a two-seater, lettin’ steady Marvin blast\nMan, fuck these niggas\nThe Hater Hall of Fame should induct these niggas\nI know a girl think it’s White Castle shakes\nShe jerk it back and forth, so we call her “Masturbate”\nAnd she’ll dance for you if you got the cash it takes\nIf you ain’t got no money, she ain’t got no ass to shake\nThey say, “What it’s hittin for?” I ask em “Is it worth it?”\nWe in Club Perfections, but ain’t nobody perfect\nWh-Wh-What you got, it’ll get you what you want\nThey gon’ talk behind ya back\n‘Cause they ain’t with you in the front\n\n[Hook: Big K.R.I.T.]\nShe said her name was Tangerine, damn the American dream\nShe all about her fuckin cream, so shake it like a tambourine\n\n[Verse 4: Bun B]\nShe came around the corner like a big-body slab\nWith a top you wanna touch and a bottom you wanna grab\nThicker than a Snicker, man, and cuter than a button\nWith a face from out of Vogue and a body from straight stuntin’\nBackside 45-36 double-D\n26-inch waist (man!); she bout to trouble me\nBody like an angel, got me fiendin’ like a demon\nIf I was a single man, I’d make her a Mrs. Freeman\nSkin soft as lotion, walking slow-motion\nSmell her perfume? It was Love Potion\nNumber 9 (9), think it’s “stop and get ya number” time\nBaby, who you for? ‘Cause you damn sure ain’t one of mine\nSo cold, make it snow up in the summer\nGirl, go’n’n jump yo big fine ass up in this Hummer\nAin’t no use in wondering how trill life be\nRoll with the Trill OG and keep it trill like me\n\n[Hook: Big K.R.I.T. & Big Boi]\nShe said her name was Tangerine, damn the American dream\nShe all about her fuckin cream, so shake it like a tambourine\nShake it like a tambourine, she shake it like a tambourine?\nShake it like a tambourine, she shake it like a tambourine\nShe said her was Billie Jean, said she wanna show me things\nI pulled out a stack of green, shake it like a tambourine\nShake it like a tambourine, shake it like a tambourine\nShake it like a tambourine, shake it like a tambourine\n\n[Outro: Big Boi]\nShake shake it, shake shake it, shake shake it, shake shake it\nShake shake it, shake shake that ass\nShake shake it, shake shake it, shake shake it, shake shake it\nShake shake it, shake shake that, shake that\nWork, work, work, work, work, work, work, work\n(And all my ladies go to)\nWork, work, work, work, work, work, work, work\n(Shake shake it, shake that ass)", "image": "https://images.genius.com/6ab5c816aabfeaaf6d9419aff7e1e84c.1000x563x1.jpg", "year": null, "title": "Tangerine (Gentlemen’s Club Remix)", "album": null}]}