{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Intro]\nYo, we back in Germany and shit?\nThis is fucking dramatic\nYou ain't playing, yo\nRoy Markie, motherfucker\nRoy Markie\nThe German\nAll this fucking German pussy up in this place\nR.A. The Rugged Man\nGerman pussy\nHow much pussy can one white man eat in one night?\nLet's see\nHow much pussy you think I can eat, bitch?\nYo, check this, check it out, yo, check this\n\n[Verse]\nDon't you know us? Underground rap legends\nWe gon' dig up in their stomach, we rip out their intestines\nI'm sure you see what's happening, don't need to ask no questions\nWhat should I do to these faggot fucks, do you got any suggestions?\nBin ich Berliner, escaped from Deutschland with mein Mutter\nPeep the production, it's The Rugged Man producer\nLet's move it, mach schnell, we gotta make these shits bang\nThe Testament of Dr. Mabuse, Fritz Lang\nRugged Man, fotzenlecker\nIn English, that mean I eat the pussy\nI'm 'bout to flip, don't push me\nWarum bist sich mach mich toll? Why you hate me?\nWhy you want me dead? You can't kill me, get it through your head\nIt's bloodshed forever, New York to Cali\nI woke up in the cabinet of Doctor Caligari\nMental patient, straight jacket\nYou talk shit, you better back it, every fat slob unattractive\nThe rugged, Roy Markie, pick me up in Frankfurt\nTake me to the red light, I'm sick of jerking off, my hand hurt\nMake sure the cordercam work, camcorder\nLandlorder, manslaughter\nDouble team the bitch, she want me and my man torn up\n\n[Interlude]\nYo, come here, bitch\n(I like it, I like it when you hit me)\nNow let me smack the fuck out of you, bitch\n(I like getting hit, oh, I like that)\nCome here, bitch\n\n[Verse]\nThe German, ich liebe dich, mami\nWhy these faggots wanna stop me?\nIch weiss den nicht, ich mag, alles ist gut\nIt make me wanna hurt somebody\nJohn the beast Mugabi, Jack Nicholson, here's Johnny", "title": "German Pussy Freestyle", "image": "https://images.genius.com/db5f1be160a3b09ca4a61618f595fe41.400x396x1.jpg"}]}