{"songs": [{"title": "Here", "image": "https://images.genius.com/c8f633b4a8bcbf1c3e4d297a72000ed9.640x640x1.jpg", "lyrics": "[Hook] {X5}\n\"Are you here to confuse me?\"\n\n[Verse 1]\n\nWoman I'll give you the grand tour\nThere's no reason for you to look closer but you do so I show you\nIt ain't pretty here now but it will be\nOne day I promise when the sun rays are honest\nI chip away at the tint on the windows\nStain on the glass it's a pain in the ass\nI scrape and I scratch 'til my arms grow weary\nMeanwhile I warn you not to stand near me\nI think I built the fence a little late\nThe demons were already in now they can't escape\nI been toe to toe with most of em' though\nAs a whole they must parish in order for me to grow\nHuddled in the gloomy little cracks that they inhabit\nThey pass away the day I deactivate my habits\nEach one gets buried in the back yard\nIn tiny little graves marked only by a black scar\nKindly watch your step\nThe silence isn't finished being awkward yet\nTrophies lay in the basement to stay safe\nToday's mistakes are in a lighted trophy case though\n\n[Hook]\nAnd I want you to know\nI only invited you cos I ain't thought you would show\nBut I'll be damned if you ain't grab my hand\nAnd presented yourself on the threshhold of the Heartland\n\n[Hook] {x2]\n\"Are you here to confuse me?\"\n(I don't mean to confuse you)\n\n[Verse 2]\nYou'll notice antique swordes adorn the walls\nThey're really not there for decoration at all\nI saved them shits from old relationships\nAnd I swing'em at you later if you stay in the mix\nDon't you realise nobody's really been inside here\nSince it was last drenched in dried tears\nDecorating was a senseless idea cos only the blind lonely prince resides\nHere\nWe dine here on a balanced diet\nEgo when it's loud self hatred when it's quiet\nInside the castle this is what the life is\nSign here after you read the fine print\nIt's not much but all of it's yours\nTake great caution if you wanna explore\nWatch your head when you opening the doors\nAnd always remember that the choice was yours\n\n[Hook]\n\n[Hook] {x4]\n\"Are you here to confuse me\"\n...Are you breathing?", "year": null, "album": "The Undisputed Truth"}], "artist": "Brother Ali"}