{"artist": "Inspectah Deck", "songs": [{"title": "Lovin’ You", "lyrics": "[Intro: Inspectah Deck]\nWhat is love? Love is love\nWhat is love? (Loving you)\n\n[Verse 1: Inspectah Deck]\nYo, examining her hourglass frame\nExotic name, passion, splashing the fly fashions\nOn the 2 Train, words soothing her brain\nThere's the cue, cross the platform, she 'bout to exchange\nShe wooed slowly in planning a kiss\nAnd in the same motion, bounced off with the switch\nCouldn't let here go, before the train pulled off\nShe gave me a look that described my thoughts\nAnd I was hypnotized by her ebony eyes\nShe wised to my scheme, made her temperature rise\nHours later, still zoning off the moment\nHappened so fast, it's over with\nAnd now you're gone, like the same short time\nBut stay so heavy on my mind, I'm... *loving you*\n\n[Verse 2: La The Darkman]\nYo, I met a bad chick, model actress\nSoft as a mattress, said she was catholic\nPhysically attractive, earth-toned skin\nThick but thin, looked like she just came off an island\nRolled in Porsches, lady was gorgeous\nI'm trying to ram bar down her mental fortress\nLoved my name, La song, how'd you like to have my 4th born?\nI'm the God, I'll be your umbrella in a storm\nWe can smoke, parlay, see a ghetto matinée\nDon't worry about me, young thug, 'cause I'll stay... *loving you*\n\n[Verse 3: Inspectah Deck]\nDana was a girl I knew, she was true\nTwist Ls with the crew, bust the gat, too\nHad the stash labbed for when the Jake rushed\n'nuff head to grab, razors in bags\nLetting me rest my head, wild fugitive\nAccepting all collect calls throughout the bid\nLike a big sister, I've got major love\nShe waved my hair, plus hold a gun in the glove\nWhile you girls move like slippery eels\nYou the diamond in the rough that been keeping it real\nThat's why you're closer to me than most I roll with\nSmoked bones, rolled dice and made dough with\nAnd now you're gone like the same short time\nBut stay so heavy on my mind, I'm *loving you*\n\n[Outro: sample]\nLoving you", "image": "https://images.genius.com/19b06abfed788ae492f578fa0afb063f.1000x1000x1.jpg", "album": "Uncontrolled Substance", "year": "1999-10-05"}]}