{"songs": [{"title": "Keep it Tight", "album": "DJ Skribble’s Traffic Jams", "year": null, "image": "https://images.genius.com/462f588f1e4fc3602c8fee336874a8c3.297x300x1.jpg", "lyrics": "[Intro:]\n\"Every man has the technique; and they're all different. But when you know mine, you'll be DEAD\"\n\nYo... (Can I see you?) Lauryn Hill on the track...\n(In the morning) New Ark got my back...\nDJ Skribble, just relax, haha! I'm a get you the joint! haha!\nUh Huh, Uh Huh, Uh Huh, Uh Huh, Uh Huh, Uh Huh!\n\n[Verse:]\nAs I span the cosmos\nMahogany travel at the speed of sound\nSpan the mainstream but still esteemed underground\nMy parameters, and wrap up contaminants\nTravel twice Earth's diameter, intimidating amateurs (what?!)\nAt the Apollo, I played the shepherd, sheep followed\nChicks try to model after me like I'm Tyra\nBanks; wanna thank me 'cause my statements are prodigious\nStyles so prestigious, make a sinner act religious\nStreet academics, seen alot of girls mimic (Huh)\nBut when it's all over you can tell who's the gimmick\nL slang-bangs like a dub plate (Bing!)\nJericho Sound System, mash up your club dates!\nSweeter than a cherry on a fruit cocktail\nWhenever, Wherever, Whatever like Maxwell (Unh)\nMy pentium makes more chips than Intel (Intel)\nI didn't mean to turn you on like Cherrelle!\nKids move they body like they're tripping off of acid\nAnthony, not even fantasy can surpass it\nOnce you blast it, one starts to feel kinky\nI think he, goes by the name of Young Slinky\nAnd just when you thought it was safe to relax\nL-Boogie spits with perfect syntax!\nThen, DJ Skribble make you dribble on the wax (What?)...\nDJ Skribble make you dribble on the wax!\n\nCan I hear you in the morning\nLike I hear you late at night?\nChance to hear you, amp the party\nDJ Skribble, keep it tight!\nJust a short time in the morning\nLike I hear you late at night\nChance to hear you, amp the party\nDJ Skribble, keep it tight!\n\n[John Forte: ]\nL' Boogie"}], "artist": "Lauryn Hill"}