{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/d5ca9af5c4e393052b4d230aff021b84.597x597x1.jpg", "title": "Diamonds And Pearls", "year": "1999-08-31", "album": "That Was Then, This Is Now Vol. 1", "lyrics": "Baby.. I can give you the world..\nBaby baby baby - even diamonds and pearls\nDo you want it?\nBeen around the world once, met every girl twice\nNever seen nobody that was so damn tight\nNone of them come close to you\nI'm bouts to take you on a rendezvous\nLet me set you out with platinum ice\nGive me all that sugar and spice\nTake a chance with me, roll the dice\nSo let's step baby, live the life\nBaby, you got me feelin all shy\nGot a stomach full of butterflies\nWanna get down, but not on the first night\nNigga tight, got five on the gas\nCan I ride with you? Wanna be your Boo\nLike the things you do\nWanna take it slow when I do the do witchu\nCan't no other girl do what I'm about to do to you\nWay SexyCool\nBaby.. (baby)\nI can give you the world (ooh give you the world)\nBaby baby baby (ooh baby) even diamonds and pearls\nDo you want it?\nLet me lick it up and down (all up and down)\nLet me see you move that body round and round (all around)\nBaby now let me know if you're really down (oh really down)\nC'mon let me know if you want it (oh yea I want it)\nGive you the world, and everything in it\nDiamonds and pearls, my world so exquisite\nP&J Polo with the the chain to match\nCartier no strings attached\nBe my lady I'll rub your back\nNeed a Benz? I'll pay for that\nKeep it comin girl, turn me on\nAnd we gon' sex til the break of dawn\nIt's a match, not a mismatch\nWant you to get attached to the black cat\nI can look into your eyes and see you want that\nI ain't nuttin like the next biatch\nLet me show you where my head at\nShotgun in an Northstar Cadillac\nSweet black diamond hit it from the back Jack\nOoh baby, youse a star\nBreak me off a piece of that Kit-Kat bar\nBaby.. (babyyyy)\nI can give you the world (ooh give you the world)\nBaby baby baby (baby baby baby baby) even diamonds and pearls\nDo you want it?\nLet me lick it up and down (all up and down)\nLet me see you move that body round and round (all around)\nBaby now let me know if you're really down (I'm so down)\nC'mon let me know if you want it (yea I want it)\nYou want me, bring it over now\nTake my clothes off Mista Baby hit the ground\nHear that clappin sound?\nTime for me to break you down\nBe cryin in my nicky now\nMake your head spin round and round\nWhen I first met you you had a frown\nBut look at you now, got a big smile on your face\nWanna take me place to place\nDip me down in satin and lace\nFancy clothes and diamond rings\nAre the things that money do\nCheap wine, Moet, and Cristal\nApartment houses to the penthouse\nCover me in fur from the neck to my toes\nWhile I postpone when the nights is cold\nDedicate you a cut on the radio\nBout to put this love thang into cruise control\nGive it to me girl damelo\nPenthouse is the Vallagio\nPlushed out with the matchin robes\nCeleb jet when it's time to roll\nBig ball and that's all I know\nV.I.P. that's how I G\nVersace that's all I see\nMe and you we was meant to be\nDo a show bout a quarter to ten\nTake your keys to the Range or Benz\nYou can floss, bring all your friends\nAin't nuttin but a money thing, major ends\nBackstage and it's off the hook\nAll my homies is G's and crooks\nSuited up and the party's live\nDiamonds and pearls, won't you step into my world\nBaby.. (baby)\nI can give you the world (come on and give me the world)\nBaby baby baby (ooh baby) even diamonds and pearls\nDo you want it?\nLet me lick it up and down\nLet me see you move that body round and round\nBaby now let me know if you're really down\nC'mon let me know if you want it\nYeah\nThis record right here is dedicated to\nOne of the biggest influences on hip-hop, and R&B\nThe late great, Roger Troutman\nRest in Peace homey, yeah..\nYou can show me that you want it\nIf you put some diamonds on it\nI will let you come into my world..\n(diamonds and pearls)\nYou can show me that you awnt it\nIf you put some diamonds on it\nI will let you come into my world..\n(diamonds and pearls)\nOoh yeah\nBaby!"}]}