{"songs": [{"image": "https://images.genius.com/0c18a75acfcf19165852eabf1a1fe910.1000x1000x1.jpg", "title": "Invisible", "album": "I’m Free - EP", "year": "2012-05-01", "lyrics": "[Intro]\nYeah, I don't know\nI guess I feel like—when I'm around you—that I'm invisible\nIt's like you don't even see me\nAnd I'm standing right in front of you, yeah\n\n[Verse 1]\nYeah, I feel invisible, I knew this wasn't easy\nI'm standing right in front of you, but you don't even see me\nI pass you in the hallway, but you don't even glance, so\nI just kinda walk by like I ain't never passed you\nI do my best to pretend that I don't notice you\n'Cause you don't ever notice me, so what am I supposed to do?\nWhat, I gotta yell it in order for you to see it?\nGot it written on my face, it's pretty easy to read it\nBut you choose not to, so that's what I'ma have to do\nMy heart is getting tired; I'm tired of running after you\nI try to talk, but you just keep ignoring me\nPretending that you listen—you don't listen; you're destroying me\nSee, I look up to you, but you keep looking down on me\nYou never say you love me or you care or that you're proud of me\nIn other words, you're drowning me\nI get on my knees and I pray\nPretty pathetic, but you make it pretty easy to say\n\n[Chorus]\nI swear, I must be invisible\n'Cause you never see me anymore\nAnd I swear, I must look miserable\n'Cause you never hold me anymore\n\n[Verse 2]\nYou like a nightmare, every time I'm dreaming\nThe longest conversation that we had was when we're screaming\n\"And what you say?\" \"What you say?\" There's nothing else to talk about\nBefore I even say a word, it's like you're already walking out\nYou keep making promises, but you don't ever keep 'em\nAnd then look at me stupid when I say I don't believe 'em\nYeah, that's right I don't believe you, and how do you expect me to?\nYou don't show respect to me, but I should show respect to you?\nGosh, you're such a hypocrite, I doubt you're even listening\nThings have got so bad, you don't even pretend you're interested\nAnd every time we hug, which isn't very often\nThe thing I used to love has now become something that's awkward\nYou put that smile up on your face, but I can tell you're faking\nYou look me in the eyes and you tell me I'm amazing\nBut all your words are wasted, 'cause I swear that you make it up\nAnd I'm so sick of chasing love; I guess my pace ain't quick enough\nI hate it, 'cause\n\n[Chorus]\nI swear, I must be invisible\n'Cause you never see me anymore\nAnd I swear, I must look miserable\n'Cause you never hold me anymore\n\n[Verse 3]\nI'm full grown now, moved out, I thought it was best\nThe sad thing is, I doubt you even noticed I left\nI quit calling 'cause you ain't ever answer the phone\nSo the last time we talked, I told you, “Leave me alone”\nI'm supposed to open my arms and hold you now?\nHold you? Wow. You ain't never held me; how—\nDo you expect a kid that you never raised to do right—\nTo break the walls down and make you a part of my life?\nBut hold up, here comes a call from the hospital\nThey told me I should come and see you if it's possible\nI got my shoes to go, I threw my pride on the floor\nSaw a real smile on you when I walked in the door\nThe doc told me you ain't got more than a day\nI just got you and this cancer gon' take you away\nYou say you love me, you can see me, everything's okay\nFor some reason, I no longer feel the urge to say\n\n[Chorus]\nI swear, I must be invisible\n'Cause you never see me anymore\nAnd I swear, I must look miserable\n'Cause you never hold me anymore\n\n[Outro]\nI swear, I must be invisible\n'Cause you never see me anymore\nAnd I swear, I must look miserable\n'Cause you never hold me anymore"}], "artist": "NF"}