{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/35be8383816371850b972388fcd1af5e.800x800x1.jpg", "title": "Institution", "year": "2015-12-25", "album": "Institution", "lyrics": "[Intro]\nInstitution\nBaby girl, damn, yeah, what it is girl\nWhat it is\nHow you doing? (shit)\nI think I wrote you a letter\nSend me a kite back\nSend me one back asap (asap)\nYou know you keep a nigga grounded\nMan, you keep my head right\nFor real, I like dat\nLook\n\n[Chorus]\nI'm missing you, I'm like what you doing?\nWhat you getting into? Baby who you screwing?\nI'm missing you, I'm like what you doing?\nTryna to get to you, but I'm in institution\nI'm in institution, tryna to get to you, but I'm in institution\nAye, aye, aye, aye, aye\n\n[Verse]\nI got to write you a kite, I got to keep it real\nI don't know when I'm coming home, thats how I really feel\nI know its getting to you bad, you probably shedding tears\nYou hearing rumors, they saying I caught 11 years\nI hope you understand, that it's the life I live\nAnd this what come with a street nigga, girl that's what it is\nI'm in this situation, but could you love me still?\nCuz I won't change on you, even if I get a record deal\nI'ma rip my heart out my chest, put it in this envelope\nThey got me way in Virginia, with these Virginia folks\nWithout my momma and my brothers, girl you all I got\nAnd could you send me some pictures? Cuz that would mean a lot\nI'm wondering what you doing? And, where the hell you at?\nAnd when I do get back, I hope you where I left you at\nAnd if they send me to jail, would you send me a pack?\nI'm in here writing raps, I'm in here getting fat\nBut one day I'll be back, they can't hold me forever\nOkay now write me back, I'm waiting on your letter\n\n[Chorus]\nI'm missing you, I'm like what you doing?\nWhat you getting into? Baby who you screwing?\nI'm missing you, I'm like what you doing?\nTryna to get to you, but I'm in institution\nI'm in institution, tryna to get to you, but I'm in institution\nAye\n\n[Outro]\nIf I wasn't paper chasin', I'd probably never leave your side\nAye, aye\nInstitution"}]}