{"songs": [{"image": "https://images.genius.com/a69b6ff9152c67baee9402cf5ffdff26.1000x1000x1.jpg", "title": "Samurai Abstinence Patrol", "album": "Attitude City", "year": "2015-07-17", "lyrics": "[Verse 1: Danny Sexbang]\nIn the tall skyscrapers of ancient Japan\nLived two great warriors, a dude and a man\nWho proclaimed no sex until you are married\nThey were Arin Neverbone and Samurai Barry\n500 years later, two heroes were born\nOne clothed in blue spandex, the other in scorn\nThey were Ninja Sex Party, they had but one quest:\nTo bring sex to the masses, 'cuz that shit is the best\nIn a super-hot orgy with ten girls and a mime\nDanny thrusted so hard he ripped a hole in space-time\nEach hump could be seen in the ancient night sky\nGraphic shots of Dan's nuts were in healthy supply\nArin and Barry knew they had to act fast\nThey jumped through to the future 'cuz they were dicks from the past\nThey landed two feet from where NSP was rocking\nAnd screamed \"Danny, it's your cock that we now will be blocking!\"\n\n[Chorus 1:]\nSamurai Abstinence Patrol\nTo control all our junk is their one true goal\nIt's a battle for boners and rock and roll\nNinja Brian will stab them in the soul (And the face!)\nWhat could this mean for Ninja Sex Party?\nWill our heroes be stopped from their boning spree?\nAnd will Danny get first place in his spelling bee?\nThe championship word is \"nomenclature!\"\n\nUh... N... O... C\n(buzzer noise) FUCK IT!\n\n[Verse 2:]\nThe orgy ground to a halt and they took it outside\nThe girls just went home, the mime probably died\nBrian ran at Arin while Barry started screaming\nCould we really have a future in a world without creaming?\nAll hell broke loose with the insane war cry\nArin soared through the air. Apparently, he can fly\nDanny french-kissed a girl like he was king of Versailles\nBrian stabbed some random guy with a different guy\nThe battle raged on 'til the city was wrecked\nBut the two sides began to have mutual respect\n\"God damn,\" Arin yelled. \"You must sure love to slam\"\n\"You don't even know,\" said Danny. \"That shit is my jam\"\nA union was formed between both rival camps\nAnd they both started rocking using NSP's amps\nBut the cease-fire ended and the battle resumed\n'Cuz Danny whipped out his nuts and the alliance was doomed\n\n[Chorus 2:]\nSamurai Abstinence Patrol\nNow their tale will be passed down in sacred scrolls\nThey were voted \"Most Douchey\" in a recent poll\nIndependently-conducted by Danny and Brian\nIs the story over or has it just begun?\nHas the battle for boning been lost or won?\nThe question is a deep and important one\nJust like how in God's name do you spell \"nomenclature?!\"\n\nHere we go...\nN... R\n(buzzer noise) This is literally fucking impossible!"}], "artist": "Ninja Sex Party"}