{"artist": "IDK", "songs": [{"title": "POKE POKE", "lyrics": "[Intro: IDK]\nThis that dirty, stinkin', nasty, ratchet, rowdy shit\n\n[Chorus: IDK]\nI ain’t tryna say I was a dope dealer (Dope dealer)\nIf the feds askin' questions, I don't know nigga (I don’t know nigga)\nIf you come around askin' for the smoke nigga (Smoke nigga)\nYou might get bang-bang, poke-poke\nIt ain't no joke\n\n[Verse 1: IDK]\nBoth hands on my stick, watch me stroke (Ayy, yuh)\nPut this stick on a lip, don't choke (Euh, euh)\nThey see gang comin' through, oh no (Oh no)\nIf she no longer safe, oh ho (Oh ho)\nI ain't pickin' up for her (Brrp)\nShe already had a chance, she gon' have to suffer, bro (Okay)\nShe eat it like it supper, bro (Alright)\nThen I see her friend over there, like what’s up with her?\nBitch I’m a dog, I could never be in love with her (Never be in love)\nYes I'm PG, but DC, I still fuck with them (Uh-huh, yup)\nBitch I want a big body Benz like a Tonka Truck (Skrrt, skrrt)\nGot my new and my old ho playin’ tug-o-war\n\n[Chorus: IDK]\nI ain't tryna say I was a dope dealer\nIf the feds askin' questions, I don't know nigga\nIf you come around askin’ for the smoke nigga\nYou might get bang-bang, poke-poke\nIt ain't no joke\n\n[Verse 2: Thirty Rack]\nYou don't like beef, well meet the goat nigga (Meet the goat)\nWorth a couple M's, please don't choke nigga (Please don't choke)\nTravel 'round the city, you want smoke nigga? (You want smoke?)\nFinesser of the year, you hear Gulch nigga? (You hear Gulch nigga?)\nYou hear Gulch nigga? Yeah (Gulch), you hear Thirty nigga? (Thirty)\nGot a crib to myself, young Ma-Culky nigga (Yeah)\nEighty on my wrist, why you poke a nigga? (Damn)\nThree hundred on my neck, I'm the Pope nigga (I'm the Pope)\nDon't get poked nigga, don't get smoked nigga (Smoked nigga)\nGot a thirty on a Uzi, don't get smoked nigga (Don't get smoked nigga)\nI'm the butcher of the shop, don't get chose nigga (Don't get chose nigga)\nI'm eatin' toes nigga, bone marrow on rows nigga\n\n[Chorus: IDK]\nI ain't tryna say I was a dope dealer\nIf the feds askin' questions, I don't know nigga\nIf you come around askin' for the smoke nigga\nYou might get bang-bang, poke-poke\nIt ain't no joke", "image": "https://images.genius.com/822aa0ba7bc3ed5014c626f47da8bf79.1000x1000x1.jpg", "album": "IDK & FRIENDS", "year": "2018-11-09"}]}