{"songs": [{"title": "Getcha Some", "album": "Finally Famous: The Mixtape", "year": "2007-01-01", "image": "https://images.genius.com/35094fe912ce98af36fb55bca8412d23.500x500x1.jpg", "lyrics": "[Intro]\nShit, you want my shoes?\nYou want my shirt?\nMy jewels too, nigga?\nWell you need gon' getcha some, gon' gon' getcha some\nGon' getcha, gon' getcha some, gon' gon' getcha some\nGon' getcha, gon' getcha some, gon' gon' getcha some\nGon' getcha, gon' getcha some, gon' gon' getcha some\n\n[Hook]\nFresh, fresh like I'm wrapped in plastic\nPolo, Louie to Gucci, like that's one fresh jacket\nThey looking at a nigga, like that's one fresh bastard\nI'm rich, bitch, see the shit that this cash get?\n\n[Verse 1]\nYou can't afford the price, so why the hell would you ask it?\nThese faggots try and snatch it, get they ass in a casket\nYa honey love me, she admire the fashion\nAnd I call her baby girl, just like her dad did\nThere's 100's on my paper like a smart ass class kid\nBecause I'm on top my route, like an ad lib\nAnd you should holla mamma, Dolce and Gabbana mamma\nGotta a whole lot o' mamma, Fendi and the Prada so you need to\nGon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\nBut to get boy you gotta be rich or something\nAnd my attire hard, hard like my dick or something\nI made more then ends meat\nMy nigga BIG told me he was bout the Benji's\nI'm in the lime light 'til the point my skin green\nAnd living my dreams 'til the point you should pinch me to convince me\n\n[Hook]\nFresh, fresh like I'm wrapped in plastic\nPolo, Louie to Gucci, like that's one fresh jacket\nThey looking at a nigga, like that's one fresh bastard\nI'm rich, bitch, see the shit that this cash get?\nWell you need to, gon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\n\n[Verse 2]\nIf I told you where to get it, you niggas still wouldn't grab it\nJust to pronounce it, you gotta add an accent\nAnd they ask, can they call me grocery store?\nCause my pockets full of paper and plastic\nMan, you not avoiding my Asian persuasion\nExcuse the lil Ape in ya face, it stays Bathing\nAnd when the heat blaze on high beams\nYou scream, I scream\nFor some cold ass ice cream\nYou need to gon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\nPose for the hoes, they might wanna take a pic or something\nHop up in the ride, they might wanna let me stick or something\nThere's some things, I don't like, I love them Nike's\nBut not the white on white's, forget the price tags\nCause I get what I like, and your girl looking for me\nBecause she like the pipe, ya dig?\n\n[Hook]\nFresh, fresh like I'm wrapped in plastic\nPolo, Louie to Gucci, like that's one fresh jacket\nThey looking at a nigga, like that's one fresh bastard\nI'm rich, bitch, see the shit that this cash get?\nWell you need to, gon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\n\n[Verse 3]\nDog, the fabric on my ass is satin and its sad n\nYou think you could afford this fabric\nWhen it comes to the hoes I'm the man like Shaft is\nCuz I'm clean cut and handle them like baggage\nAtheists turn Christian when I rock my True Religions\nDog, It's that real when I'm rockin pastelle?\nThese niggas wanna wonder what they have on me?\nI'm stickin to my roots like LRG\nGo n getcha some, go go an getcha some (x2)\nPose for the hoes they might wanna take a pic or somethin\nHop up in the ride they might wanna let me stick em some\nThe rag 'round my neck complement the outfit\nI'm out with brawds you be watchin from your couches\nBut I'mma need money power respect\nFind a little piece of Jesus and I threw em round my neck\nThat's\n\n[Hook]\nFresh, fresh like I'm wrapped in plastic\nPolo, Louie to Gucci, like that's one fresh jacket\nThey looking at a nigga, like that's one fresh bastard\nI'm rich, bitch, see the shit that this cash get?\nWell you need to, gon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some\nGon' getcha some, gon' gon' getcha some"}], "artist": "Big Sean"}