{"songs": [{"album": "The Off-Season", "year": "2018-08-07", "title": "Album of the Year (Freestyle)", "image": "https://images.genius.com/2b7f50bb47bc0d432e510bba63bfb4a8.640x640x1.jpg", "lyrics": "[Verse]\nYeah\nMy mind state feel like the crime in the summertime\nHigher than average\nLot of cabbage\nThank God I never abide by the established\nGuidelines that keep niggas inside of fabrics\nCommissioned by the state, I skate by the masters\nLike \"Yoo-hoo\" with a new-new ridin' passenger\nShout out Oak Cliff, I'm 'bout to fly to Dallas\nDecade from now I might just buy the Mavericks\nWhat up, Mark Cuban?\nI am only part human, half-man, half-amazing\nPlus, I'm good at math like I'm Asian\nHate to use stereotypes—but that's light compared to what a nigga get from Caucasians\nNo race-baitin'—treat the beat like Playstation\nReporting to you live from the International Space Station\nI probably vacation on Mars\nThe flow is out of this world and so is the bars\nBlow the facade right off of your squad\nLil' rappers, I love you, but you ain't shit 'til you got offers in Prague\nLook that shit up\nA book, nigga, pick that shit up\nExpand your vocab\nI'm giving out toe tags for no cash\nAll summer long plus three seasons after\nPlease CC a rapper, tell him meet me\nIt's absolutely imperative that my heat speak to rappers\nThe problem with this game is this weak sea of rappers\nI'm the answer on the low, I'm a cheat sheet for rappers\nI came up 'round AC to DC adapters\nPlug talk, what I'm really sayin' is a shame but my niggas move 'caine like HBCU Kappas\nWhole town full of CC Sabathia's\nYou think niggas gettin' fat pitchin' crack?\nNot really\nThis is not the eighties, don't be silly\nNow we push pills and sell heroin to Billy\nNow Billy momma want the judge to pardon his addiction\nHow many black addicts that got caught up in the system\nWith no sob stories on your prime time television, I can smell a blatant contradiction\nMan, listen\nDon't want to fuck up my vibe\nLet's end it on a positive note, come see me live\nKOD—album of the year, undebatably\nMy cadence be the greatest we've seen since the late MC whose name was The Notorious—\nDreamville stacked like the Warriors\nWinning back to back\nNext up to bat is my nigga, Bas\nAfter that, Jiddy-J.I.D\nThat's that New York City kid plus ATL\nMe, I'm from the 'Ville, but I know them towns well\nBefore I had a deal I was givin' niggas hell\nNow I'm givin' niggas deals and they givin' niggas hell"}], "artist": "J. Cole"}