{"songs": [{"title": "Now Y", "album": "Heist of the Century", "year": null, "image": "https://images.genius.com/29aed50e708381cab4e55222550f38fa.962x925x1.jpg", "lyrics": "[Intro: La The Darkman]\nYeah. Yeah. Yo. Yo\nYo. Trapacanti. Yo\n\n[Hook: La The Darkman]\nWhen I walk these streets, like bamboo, I'm strapped\nGet your brain tapped by fourty-four caliber gats\nIt ain't like that, cats gotta learn to relax\nIf I let the gun clap, you have no wish, you're on your ass\n\n[La The Darkman]\nIf you see at cat without his vest hangin by his neck\nThen La done it, I'm tryin to see this benz six-hundred\nWith a fly bitch, a gat and cognac gettin blunted\nReadin the tablet of my money from the kids that I fronted\nYou don't want it, shootin slugs outta an armored green lex\n]From four pounds that fuck you up like a plane wreck\nDon't gamble with a tech, car is quicker than the eye\nMy style, top secret like a Bosnian spy\nNow Y, New York have you laced in chalk\nThe South Bronx, what you thought when we let are guns talk?\nIt's bloodsport, the Darkman call it like he sees\nBeen in buildings, doin eighty in a black m3\nMedallion swingin a linx, costin bount ten g's\nN.Y.C., where killas bust cops at me\n\n[Hook]\n\n[La The Darkman]\nNew York ain't fuckin playas, we live gun sprayers\nMovin crack frm the streets of Manhatt' to the Himalayans\nAmadeus, why these Cali craps tryin to front?\nAss gotta cut ropes, tryin to bungee jump\nTight cunt, all white planes roll, we night creepers\nIn bubble coats, eight hundred beapers, force one sneakers\nI stay fly, holdin it down for my block\nWhat up ock? You could get a four-four shot\nAnd don't think it can't happen cuz you on the T.V. rappin\nI sneakin from B.X., B.K. and the Staten\nManhatten and Queens jookin kids for rings\nNew York, New York, the big city of dreams\nSome rap legends were put in jail, you thought we failed\nNow I'm back like LL, when he was rockin the bells\nTakin rap back to the days of foodstamps and tramps\nPit stains in the stair case and vise-grip clamps\nKid, I'm amped, cats try to diss the originators\nIn Land Cruisers, on Timbs, subways and elevators\nHoldin steel, you frontin niggas better get real\nI'm gettin money, blow my nose with a hundred dollar bill\nHow you feel? And fuck where you at, it's where you from\nTo that cats, that's eighty-five: blind, deaf and dumb\nRun and get your gun, I come in the name of Allah\nTo my people, the Inglewood family swine, power refined\nYou can't see, we runnin outta time\nIf the east and west kill eachother, who gon' shine?\nWe losin our mind, the rap shit is turnin into crime\nNowadays soft niggas bust techs and nines\nSo, what?"}], "artist": "La The Darkman"}