{"artist": "Boosie Badazz", "songs": [{"album": "BooPac", "title": "Don Dada", "year": "2017-12-13", "lyrics": "[Intro: B Will]\nDon Dada, you wanna roll with the mobsters?\n\n[Verse 1: Boosie Badazz]\nIt was me and you\nToo deep in the 'lac\nWe survived homicides and the verbal attacks\nI know, it hurts bad\nWe got purple for that\nAnd it was more than one nigga in our circle got whacked\nChoppa hit him in the side, he lay perfectly flat\nDirt on his cap, he be certained a nap\nWe know he, died a rat, we can't hide a rat\nI survived the trap, bitch I survived the trap\n\n[Hook: B Will]\nDon Dada, top shotta, you wanna roll with the mobsters?\nYou're like your father, but harder\nDon Dada, top shotta, you wanna roll with the mobsters?\nYou're like your father, but harder\n\n[Verse 2: Boosie Badazz]\nBrother say \"go and get a scholar\"\nI told him do his thing man, I'm gonna get a yappa\nI two way fight, he two-way head, we riders\nMore money more murder, Don Dadas and top shottas\nDrop toppers in the Summertime, red bottles we floss\nWe cancel your ass just to cancel the toll\nThey say my father used to whoop niggas\nI guess we different, 'cause I'd much rather cook niggas\nAnd gon' flip 'em, I was lost as a kid, but I did dream millions\nFrom a one-room shack, to fifty-feet ceilings\nInterrogated I'm on top of the charbroiled\nWith Boss Man written under of my photo\nWise guy too smooth, I play chess, nigga\nThe system picked the wrong card out the deck niggas\nSo I flip the ace, and I hold it to her face\nCard came home, got the wraith, boy\nI'm a\n\n[Hook: Lee Banks]\nDon Dada, top shotta, you wanna roll with the mobsters?\nYou're like your father, but harder\nDon Dada, top shotta, you wanna roll with the mobsters?\nYou're like your father, but harder\n\n[Verse 3: Lee Banks]\nOrchestrated the operation, ran like the Mafia\nCheap talk never ever bothered us\nFuck niggas watching us, the Feds prolly follow us\nIn an altercation sonny go and load them choppas up, we popping up\nPopping up the rock-runner\nStill doing dirty work\nWe will turn a nigga block into December 31st\nBody after body bag, crime scene another hearse\nBefore you get away with disrespect you will get murdered first\nMomma said our baby boy should have been a lawyer\nUntil she get that phone call, said I need a lawyer\nConvict at nineteen, it could have went farther\nBut I'm a born criminal similar to my father\nBe a brave gangsta, real Don Dada\nMobster, you choppa shotta, survivor\nRiding through the trenches with a choppa and a Bible\nMy ambitions as a rider\nBanks, pussy\n\n\n[Outro: Boosie Badazz and B Will]\nCynic and shit\nDon Dada, top shotta, you wanna roll with the mobsters?\nYou're like your father, but harder\nDon Dada\nDon Dada type lifestyle, you already know how we livin', nigga\nI went in the hood the other day, OG told me that you just like your pops, nigga\nLike your father, but harder\nYou's a Don Dada\nWe riding front the play or nothin' nigga\nBout to go get that jet money after this album", "image": "https://images.genius.com/e19ba8739ee64d71ac38c66de7d3feef.1000x1000x1.jpg"}]}