{"artist": "Westside Gunn", "songs": [{"year": "2018-06-22", "lyrics": "[Intro: Westside Gunn]\nGrr, ayo, ayo, ayo, ayo\nGrr, luxurious fly shit\n\n[Verse 1: Westside Gunn]\nAyo, heckling the tan, you flex, a nigga talking extra\nNever rode a bike in my life, Supreme Vans selected (ah)\nSelling coke, some might've stretched it, I like to keep it raw\nNigga fell out, one sniff, you can keep the straw\nFlags on the duplex crew necks, German Suplex\nThe guy come with a few checks, Perrier-Jouët\nJewels dropped in the mess hall, I had to pick 'em up\n\"When you come home?\" He said, \"Never\", I think my heart got stuck (ah)\nTen chains on his arm, can you\nRemember when Pete shot up my house, tryna hear the coop (boom boom boom boom boom boom boom boom boom)\nMona Lisa Off-White, 40 below Feigs\nFour door Ferraris with no heads (skr)\nSo lavish, my whole locker lit for a 10 o'clock count\nI'm standing rich in the JJ Vance trench\nSplash the brick on some Rob Van Dam shit\nDoors on the cran-apple land lift\nYou had your cup, whats the logic?\nPalm trees on the Mary Jane suits, load the pocket rocket\nThe feds wanna indict, give life, I'm looking rich, right?\nThe Wraith with the pinstripes, I been nice (skr)\nI swear, I hate when rap niggas claiming they king\nBlow your head off with the crown on it, make my ears ring\nTook the ace out the deck, chopped the coke with it\nAin't no business like dope business\n\n[Verse 2: Keisha Plum]\nTerra cotta, ricotta, red snapper\nGrilled lobster, and roasted lamb chops\nHe dresses his wife in Armani\nMistress in Versace, and his ho in Top Shop\nFly in his prime like Karl Malone and Karl Kani\nIn uniform like Karl Lagerfeld, Coco Chanel frills\nBlack leather on black leather\nBlack locs, black blunts filled with black smoke\nAin't no business like dope business\nIt's brutal, and time is crucial\nNever show weakness\nThink, what would Griselda do?\nWhat would Griselda do?\nShoot them before they can shoot you\nYou know what they say is true\nTrust your instincts\nTest the circle for weak links\nPlum colored minks, plum colored drinks\nEveryone wants to know what Plum thinks\nNigga told me his bitch gets lost in the texture of my voice\nShe hears my poetry and her pussy gets moist\n\n[Outro: Kanye West & Charlamagne Tha God]\nThis is... this is an Hermès level existence at this point, you know?\nLike, you look at a, a Birkin bag, the way it's made\nThe more scratches on it, the more, the more value it has\nMmm\nYou know, so all those things, those pieces of the story have...\nCreated, uh, who I am today", "image": "https://images.genius.com/a8a5e42d4ec977626772d2df25f034c5.638x638x1.jpg", "album": "Supreme Blientele", "title": "RVD"}]}