{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/101ec9acebacbc3b7d2c51ebd7abe4b6.960x960x1.jpg", "title": "East Side Rendezvous - 1276896", "year": null, "album": null, "lyrics": "(Intro - Diane Gordon)\n\n(chanting ahh)\n\n(Verse 1 - Frost)\nI just woke up thank god it's friday\nFire up the lac and hit the highway jump\nTo the carwash so we can hit them whitewall tires\nSedan DeVille sitting on L.A. Wires\nAnd it's gotta be 80 degrees\nI got a check in my pocket for 15 G's\nHit the first interstate now I'm straight\nStop at the record store to pick me up an old school tape\nBack in my ride see the spin of the tires\nKid Frost rolling bumping Earth, Wind, & Fire\nIt feels good holding 15 grand\nSo I parked the Sedan and I strolled in the green spans\nGive me a pair of your 50 30\nCascades cortes that are jet black\nHoodie headed back home got geed up fool\nIt's an eastside rendezvous yeah yeah\n\n(Chorus - Diane Gordon)\nCome on and roll with me\nOn that late night rendezvous\nCome on and roll with me\nLike them OG's do\n\nCome on and roll with me\nOn that late night rendezvous\nCome on and roll with me\nLike them gangstas do\n\n(Verse 2 - O.G. Enius)\nNow who beat that brand new daddy of the year\nI swear baby we're going to take you there\nIt's me that eastside G you never heard of\nWith A.L.T. and them folks getting much love\nThrough the neighborhoods through the city\nWoofers in the back bumping do wah ditty yeah\nDrop a line to them hookers for their info\nPack their smokes LA capping with their khackis low\nBecause we're some true playas bandits\nGot them hinas at the hotel and they can't stand it\nI got that sexual healing on them\n36 double deuce 36 and I'm feeling on them\nOoh eee I see\nShe got it going on like a true whiz gee\nBut I'm a stay true\nP-I-M-P from the eastside\n\n(chorus)\n\n(Verse 3 - A.L.T.)\nNow it's friday night and everything's all right\nSo just sit back relax and enjoy the flight\nSee A.L.T. hitting corners in the 63\nNow I'm straight rendezvousing through the SGV\nAs the 18's blast pop the the tape in the dash\nBumping old school flues like Teddy Pendergrass\nI can feel the heat coming out from underneath my seat\nI never heard the word defeat\nIt's the middle of july so it's hot\nI think of Kid Frost he's been courting at the G spot fool\nFrost said I hope the one time don't stop ya\nI don't give a damn I'm sipping Malibu and Vodka\nI'm on that San Bernardino\nIn the fast lane because baby got some hinas out in Chino\nAnd you know that I'm a G'd up fool\nIt's an eastside rendezvous when I loud\n\n(chorus)\n((chanting ahh))"}]}