{"songs": [{"lyrics": "We gonna get high baby, we gonna get real high..\nWam, Bam, Thank you mam'\nAirport stress, the name of this jam\nJust keeps on bumpin\nBlunts i'm sparkin\nThree hours early can't find no parkin\nTicket agent mad cuz I'm flagrant\nHostile.. Smoke comin out my nostril\nSick of paying airlines to disrespect me\nLet me guess, did the FAA select me\nI ain't caring man\nFAA stands for Fuck African Americans (Really though)\nI don't plant no bombs on children (Really though)\nI don't fly no planes into buildings (Really though)\nMy luggage is the first you grab\nBut what about this arab?(Calm Down)\nTake off my shoes\nI suppose that's fine\nBut it's your nose, not mine\nMan i'm sick of the -\n\n(Chorus)\nAirport, The way i travel round (Bagcheck)\nWish I, could keep my feet on solid ground (Random Search)\nAlways, wanted to be a super star (Spread Your Legs)\nNow I, rather go home and drive my car (Check it again)\nThe pilot, is a pencil neck geek\nThe stuckup stewardess, never speaks\nLook honey, don't start no shit\nYou don't like your job? Quit\nI take a world, a cover\nDon't talk no job\nHave colt 45 next time i arrive\nPretzels, Peanuts, Carrots, Cabbage\nDude, who came up with this food\nSittin in the middle is harmless\nUnless the fat people don't share the armrest\nAm i scared? A little, man\nEspecially when im flyin on a, little plane\nShiverin Shakin\nQuiverin Quakin\nStaggerin Stoppin\nNo warnin just droppin\nGet more thoughts on my casket yall\nBounce down the runway like a basketball\n\n(Chorus)\nIt's on your face\nYou can't hide it\nYour bag don't fit in space provided\nSir! you need to check that in\nWalk through security once again\nThe plane parked at the gate\nPeople jump up cuz they just can't wait\nEverybody can't make it to the aisle\nSo they stand underneath that uh for a while\nI just sit in my seat and think\nOh my lord\nI really feel sorry for your spinal chord\nMoney, Greed, Creates the need\nFor people to travel with speed\nSave more time\nMake more cash\nBut what good is the cash\nIf the airplane crash\nFlyin is faster, but i don't care\nI got the rest of my life to get there\n\n(Chorus)(Modified)\nCadillac, the way I travel round\nMovin and groovin to the sound\nIf I go over seas I will choose\nThe love boat, and take a fucking cruise\nSo they gonna random select me about three or four times\nAt the counter, at the security check point, and at the gate\nThen, naw, it get better, it get better\nThen, they got like these undercover airport cop\nThat just come out the blue and just empty yo bag out right in the middle of the aisle.....", "title": "Airport", "album": "Afroholic: The Even Better Times", "image": "https://images.genius.com/c4fd850563348aed762e3d484ea76e19.500x500x1.jpg", "year": null}], "artist": "Afroman"}