{"songs": [{"year": "2018-02-05", "album": "Real Migo Shit 4", "image": "https://images.genius.com/3363ded150c49e6039dbc0181268b066.1000x1000x1.jpg", "title": "Run It Up", "lyrics": "[Chorus: Kap G]\nYeah, ayy, uh, yeah\nI'ma just run it up, ayy, yeah\nOh you wanna be with us? uh, nah\nGuess they heard we up, uh, yeah\nI'ma just run it up, ayy, yeah\nI'ma just run it up, ayy\nI was down, they ain't show me love\nUh, yeah, I'ma just run it up\n\n[Verse 1: Don Ace]\nI fucked the bitch and forgot I hit her\nI'll catch a body like Brian Nichols\nI'm from the 6, I ride with the stick\nFuck the police, bitch I'm riding with 'em\nI keep the thirty I'm not throwing bows\nAll of my niggas strapped up like Gibo\nGot a white chick, let her play with her nose\nFuck these lil bitches then we let 'em go\nHit the lil bitch then I'm out of there\nCan't hit from the front, hit her from the rear\nLight up your block like a chandelier\nI'm fly as fuck when I walk in here\nIf I pull up, I'm snatching her soul\nLand the dick right on her face like a mole\nThese bitches know I'm the shit, no camole\nFucked her now I'm on the block with my bros\nYou know my niggas they never gon' fold\nGot in a situation, never told\n\n[Chorus: Kap G]\nYeah, ayy, uh, yeah\nI'ma just run it up, ayy, yeah\nOh you wanna be with us? uh, nah\nGuess they heard we up, uh, yeah\nI'ma just run it up, ayy, yeah\nI'ma just run it up, ayy\nI was down, they ain't show me love\nUh, yeah, I'ma just run it up\n\n[Verse 2: Kap G]\nYeah, yeah, they ain't having more drip than us, ayy\nGot your bitch in the VIP with us, ayy\nGotta be family just to sit with us, ayy, yeah\nI want that Bentley truck (skrrt)\nGuess what I got in my cup (drank)\nYou ain't talkin' money then hush (shh)\nAnd I been the shit no flush (flush)\nRemember we used to ride that bus (skrrt)\nNow I bet the house on us (for real)\nNow they want to count on us (what?)\nI just want to count it up (woah)\nI just want to count them bucks (racks)\nNow everybody poppin' up (what?)\nWhen I don't even rock with 'em\n\n[Chorus: Kap G]\nYeah, ayy, uh, yeah\nI'ma just run it up, ayy, yeah\nOh you wanna be with us? uh, nah\nGuess they heard we up, uh, yeah\nI'ma just run it up, ayy, yeah\nI'ma just run it up, ayy\nI was down, they ain't show me love\nUh, yeah, I'ma just run it up\nYeah, yeah"}], "artist": "Kap G"}