{"songs": [{"image": "https://images.genius.com/e4f501fdfa584d29ce2e2706f76e3bf6.500x500x1.jpg", "title": "The Ultimate High (LP Version)", "album": "For All Seasons", "year": null, "lyrics": "[Nature]\nDo you see what I see?\nDo you smoke what I smoke?\nDo you wanna smoke?\nDo you wanna ride?\n\nYeah aiyyo aiyyo\nWhen I walk into a room, niggas feel a slight breeze\nStay a little while till they feel they might freeze\nNever understood why they never liked me\nCuz when I locked the door, they turned into to Icees\nStarin at my feet all you see is Nikes\nBet you never seen a ill pair like these\nSize ten, never find me in a tight squeeze\nAt the airport, minutes before my flight leaves\nRound trip tickets to who knows where\nStay boarding, never at least a day's warning\nPrevious plans, they spoiling\nA dollar and a dream, the theme to New York, stay Torrance\n]From St. John's to Wake Forest, wait for us\nStraight ballers, you hearin it first\nNate flawless in almost every event\nPuttin up point, while niggas like ya'll stay scoreless\n\n[Hook]\nAll my niggas from the projects, light one up\nTo my bitches from the projects, light one up\nAnd stay high, high\nAnd pass me a cup of that good shit (so high)\nWe on some hood shit (so high)\nNiggas from the projects, light one up\nTo my bitches from the projects, light one up\nAnd stay high, high\nAnd pass me a cup of that good shit (so high)\nWe on some hood shit (so high)\n\n[Nas]\nWhat's me without the hood?\nA tree without wood, a dutch wit no bud\nA cut wit no blood\nA fuck but don't nut, I be incomplete\nIf me and the street wasn't in between the sheets\nI'm a product of hard luck, the money and murder game\nHere's Nature, kill a faker, man you heard of the name\n]From the cold streets of QB, old beef to new beef\nNo peace, through the song, what I see you see\n\n[Nature]\nMad bitches wanna smoke wit me\nNiggas wanna roll wit me\nUsually in my hood, find me in yo' city\nGrimy-ette  so pretty, it's like there's two me's\nWit no favorites, I try to love both of me\nThinkin of a way where I can better myself\nSometimes I get a head of myself\nHoldin weed wit intention, frontin like I got it prescribed\nSo high I must be outta my mind\n\nChorus\n\n[Nature]\nIt's like hoppin in a glass pool, half full\nNiggas only hit the bottom when they crash through\nMash fools out like they fast food\nBon' appetit, platinum or not, it ain't no match for me\nI sum niggas whole careers up, scared tough niggas\nBluff niggas into thinkin that their year's up\nIt ain't a game, took six months off, the shit jumps off\nMini-Me's are gettin punched in they jaw\nMy dunn call this shit Animal Rap\nMe, I call it dumbin\nMy near-sighted niggas saw it comin\nMore stunnin, brand new flows to toy wit\nNeck flooded on some Hurricane Floyd shit\nBack and forth to St. Crouix kid, same plan\nPlayin Sega Dreamcast till the plane lands\nA changed man, niggas don't know, they never will\nAnd if they don't understand, then they ain't fam, simple as that\n\nChorus 2x"}], "artist": "Nature"}