{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/187549e3fd1463cf7287c92937008b28.225x225x1.png", "title": "The Gift and the Curse", "year": "2007-08-01", "album": "Cobain’s Diary", "lyrics": "[Verse 1: King Gordy]\nI'm sick of being broke as fuck every damn day\nI wish that we could open up when a band plays\nPerform our hearts out, maybe get us a fan base\nYou can love me in either a good or a bad way\nWhen I run out of rhymes that'd be a sad day\nMy life moves at a fast pace like a drag race\nSometimes I think in this industry they don't have space\nFor someone that is unique as me, I just had to say\nSee I speak freely, sometimes it leaves a bad taste\nIn the mouths of these corporate people who have say\nOf who should be signed or not, it's a damn shame\nI wanna have fame, give a girl my last name\nHow many of us hoping to get in this rap game?\nSo they can take care of they people when they chance came\nThis for my artists that do it like it's the last thing\nThey'll ever do in their lives, now I am asking\n\n[Chorus: King Gordy, (Monica Blaire)]\nAre you ready for a million fans? (Million fans)\nGirls scream when they touch your hands (Touch hands)\nYou done traveled all across the land\nBut you still don't understand (This is a gift)\nAre you ready for a million fans? (Million fans)\nGirls scream when they touch your hands (Touch hands)\nYou done traveled all across the land\nBut you still don't understand (This is a curse)\n\n[Verse 2: King Gordy]\nLife ain't so easy, is it? Might seem exquisite\nExcited by TV images\nProjecting all these false idols, we lost lives too\nOver a war of words, Biggy and Pac died too\nAll you want is people to recognize you\nFeed your family, tour the world, till the next time you\nDrop an album, but see now you riding in Phantoms\nYou had a number one hit, something you couldn't fathom\nIn over a million years, you've got a million peers\nThat get a million chill bumps when they hear your shit pump\nYou're on the cover of every magazine now\nYou are a star, you've been put inside a machine now\nYou are a sophomore, when will the jitters begin\nYou ain't broke no more, does the hunger still live within?\nWill your beats be a little slower or faster or\nWill they demand your single sounds like your last one?\n\n[Chorus]\n\n[Verse 3: King Gordy]\nThis time around, will you do as well as they're expecting?\nOr will your loyal fans close their ears and reject it\nYou were highly respected, had fire on your last record\nNominated for Grammys, you wasn't half steppin'\nI hope you were taught a very valuable life lesson\nAh baby don't stress it, diamonds are made from pressure\nI hope this gives you pleasure instead of causing depression\nThey're applauding, you're next up, step up\nThey're out of their seats, didn't have to tell em to get up\nYou charted this week​, you're number one, the pressures letting up\nYour 15 seconds continue to tick on\nA mega celebrity but inside something's wrong\nHe's never home, he's unhappy, he loves his family\nHis kids love they daddy, his girl's fussing at him\nPlus you're tryna get your group on that you came up with\nSo now you know what the price of fame will come with\n\n[Chorus]"}]}