{"songs": [{"year": null, "album": "Firestarter Vol. 1: Quest For Fire", "image": "https://images.genius.com/d1c3e48f7789c764dbfe19acbf9cb0b9.300x300x1.jpg", "title": "Powerfulll", "lyrics": "[Kardinal Offishall]\nYo, yeah yeah yeah yeah yeah yeah\nYo, yeoooow!\nYeah huh\nWake up!\nAre we awake, are we wake, are we wake\nTake it low, low low low low\nTake it low take it low, take it low\nYo!\nI said yo, I said yo, I said yo\n\nYeah\nKardinal is walkin' (yo) just how we be talking (Yo)\nFakes get they face palmed, and thrown to the floor\nShout out to the ghetto, girl's in they stilettos\nWith their tongue rings, doing tricks, sippn' on Ameretto\nFire pon a fosse-man a bad man truss me\nNot a homophobic, just a man who loves pssss\nCome here let me see you, and throw a little game\nYou can either fall in love with the hood or with the name\nExplicit lyriciasm (yo) nuff narcissism\nIs invading hip-hop, replacing escapism\nMy vision is an ism (yo) smoke it till you're high\nUnattainable goals blank to your third eye (yo)\nManeuvering high skies to low tone flows\nStraight to the five mic sight is where the flow goes\nKilling 'em with knowledge - the mind is the key\nJust sign on the dotted line and check who you be\n\nCHORUS [Jully Black] {Kardinal}\nYou {you}, me {me}, powerful {so powerful}\nWe're fighting for this goal and we ain't gonna stop\n{We ain't never gonna stop y'all}\nI said you {you}, me {me}, is wonderful {so wonderful}\nWe'll be makin' babies til our army's on top\n{'Til we standing on the top y'all}\n\n[Kardinal Offishall]\nThe funk is in the air (yo) you might suffocate\nIf you don't strap on your mack on and watch I articulate\nWe don't shake hands with cops (yo) we don't participate\nLight up an informer and make his mouth menstrate (yo)\nBlack is for Black, they can't understand that\nSo they call it \"reverse racism\" and try to pin it back (yo)\nBut if we ain't for us, who for us? them? - nah!\nIf it was up to them they would have us ridin' in the back of the bus\nIn handcuffs and other shackles (yo) check Mr. Bush\nPlant cocaine on me and call it operation push\nOur Prime Minister is actually second in command\nBending over to the star spangled-politically strangled\nSo we have to move (yo) through the underground\nEncode the funk mode and claim back the sound (yo)\nCause what's mine is gonna stay mine, word to line for line\nOff the top and all that\nPeace to magnificent rap\n\nCHORUS\n\n[Tara Chase]\nLook out\nCameras are watching you, they watching you from birth\nAnd they be killing us softly by biologically attacking us first\nDon't think that you're immune\nCause your acquired system is soon to be consumed\nFlesh eating disorder, false claims of water\nI rip through the lies so I can bare sons and daughters, and soldiers\nBuild my camp up like an army over Giza, running suicide missions\nYou can't disarm me\n\nCHORUS **no Kardinal**\n\n**Jully Black ad-libs**\n\n[Jully Black]\nMaking babies 'til our army's on top\nYeah, yeah\nOh yeah\n[Kardinal Offishall]\nWake up!\nTake it low, low low low low low\n\nOUTRO [Kardinal Offishall]\nDear Lord\nI really, I don't even know how to ax this\nYou know, I can't, this this this is not an act\nI must, from the bottom of my heart, ask forgiveness for my sins\nBut you know what\nI ask that you give me the strength to be able to reach\nAll of those peoples, on every street corner, every block, every ghetto\nAll of those people, that we sometimes think are not worthy of blessings\nThey're worthy to me\nAnd I think that as a man given the blessings you have given me\nThe opportunity to speak, that I need to speak the language\nOf those people, and I need to reach them\nYou know, beacuse there's are a lot of good people on this Earth\nBut there still some people that need a talking to\nAnd I ask you to give me the strength to reach out to those people\nYou know because I believe everybody is worthy of your blessings\nSo I ask that you give, you give me, my family, my crew, F.O.S, the circle\nAll of us, all the babies that are being born\nYou give us the strength to be able to deal with it how you see fit\nBeacuse you give all of us the power, as much as some people might not believe it\nYou give us the strength to reach out and touch a lot people\nSo Lord I ask you give me the strength to go out in the world and start the fire\nYou know, start your fire, you understand I'm saying\nLord, just please be with me, be with me\nAnd give me the strength and let me do this\nCome to you as humble man, Kardinal Offishall\nQuest For Fire"}], "artist": "Kardinal Offishall"}