{"songs": [{"lyrics": "[Produced by Clark Kent]\n\n[Hook: Jay-Z and DJ Clark Kent]\nGotta reach the top (You gotta persevere)\nCan't wait another year\nI gotta reach the top (Yo Jay, your time's near)\nI gotta reach the top; fuck that, my time is here\nYeah!\n\n[Verse 1: Jay-Z]\nI came up far so brothers can know my name\nI paid so many dues now I'm looking for change\nToo many years wasted\nToo many years on the set seeing the flavors, but I never did taste it\nI gotta reach the top before I'm done with it\nSo much hard work now its time to have some fun with it\nI got my eyes on the number one nigga\nWatch your spot on the charts, \"Here I come nigga!\"\nYou hear the footsteps, you hear the sound\nThe only way I got to go is up the only way you got to go is down\nNow relax on your laurels I ain't faking jack\nSo with your $8.99 plus tax spent on my wax\nYour Freud, paranoid\nBrothers afraid to be unemployed because Jay-Zs' ready to play with the big boys\nI gots to get it, 'til then I won't stop\nToo many years rock bottom, I gotta reach the top\n\n[Hook]\n\n[Verse 2: Jay-Z]\nI gots to give them lots of rhythm\nWhen all hell breaks loose I'm performing exorcisms\nLurking in the shadows\nReady to put work in\nA hurting on competitions is curtains\nI scheme like a coke fiend\nKeep brothers awake like codeine\n'Cause when you sleep I dream deep, right?\nBrothers better sleep light\n'Cause I keep sight on number one, so go 'head, sleep tight\nI put them out, conspire like I won the house\nThings are looking up, so brothers better be looking out\nI'm closing the gap like Heidi\nMy shits selling more than Shay Whitey\nI'm coming for your spot nigga\nAin't nothing calm about the things on my mind\nShit, I leave here sunny 'cause I won every time\nYou had your time now it's my turn to rock\nAnd let my cream rise\n\n[Hook]\n\n[Verse 3: Jay-Z]\nI just won't stop there\nI gotta maintain the status quo of being the baddest bro\nThe world is watching\nGirls clocking my rhyming\nI cracked the oyster took the pearl but can I keep it shining?\nToo much passes the flame\nToo much knowledge to ascertain\nI made a mark but can I leave a lasting name?\nWell put this in your pipe and smoke it\nAs long as I'm breathing, I keep the world open\nI skip to the lou so don't sip the soup\nThen get gassed 'cause then, damn, I gotta rip your crew\nMy format is all that so skip the small chat\nIf you're all that then reach for the stars nigga!\nI recycle them bars, hot like stolen cars\nClaim peace if anything brothers is holding off\nI got to have it till then I won't stop\nSo many years rock bottom I gotta reach\n\n[Hook]", "title": "Reach the Top", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}