{"artist": "Ice-T", "songs": [{"title": "Check Your Heart", "lyrics": "[Intro]\nYo Ice - We heard what happened man\nWe heard some niggas ran in on you man\nYeah yeah, shit was fucked up man, it was real fucked up\nDon't worry - We know who did it\nWhat're you talkin about man?\nThe shit just happened about 3 hours ago\nYeah - but we know who did it man... it was your boy\nWhat? Naugh man I'm not trying to hear that\nYo listen man, it was your boy man - He talks a lot\nI can't believe this shit man, I grew up with this nigga man\nThis motherfucker, I would've died for this nigga man\nAnd this nigga set me up?\n\nYou're now fucking with your last nigga\nQuick to blast nigga\nGauge Masturbator\nChest Plate disintegrator, rider\nI never wore no mask, wacked the witness - vestless\nI'll put you on the graveyard's guest list\nICE - cause I lack all emotions, I'm heartless\nThat's why I can't figure for the life of me\nYou'd want to start this\nMy crew is bottomless\nStreet Lobotomists\nGun slingers\nGlock cocked and diamond ringers\nHustlers\nMy nigga got shot but still alive\nHe took a full clip from another player's 25\nAnd he said he's rolling with me, if you're coming\nI told him, stay home, rest up, I got enough gunning\nHomiciders\nBallin' rag Rolls riders\nBlood letters\nMoney getters\nLife betters\nThe last thing I heard you say you said I was a dead man, bitch\nI'll put you right into gun point, you snitch\nNow I know your plans are rolling on me, late when I sleep\nWhy don't we do this man to man? Let them bitch niggas creep\nI still remember in the days when we was friends chillin\nNow it seems you going to have to be my next killin\n\nChorus x2:\nYou wanna go to war, nigga tell me why?\nPunk niggas talk shit, bitch niggas die\nI never backed down and it ain't no time to start\nLet's take it to the streets and I'm a check your heart\n\nYou must be death wishing, what's up? You know my steelo\nGot love with the illest of blacks and amigos\nYour jealousy is outta hand, I can't fuck wit'cha\nAnd all your so-called down niggas, say good luck to ya\nThey know you're off the hook and you're soon to bleed\nMy reputation states that I kills with speed\nMore drama than a rap verse\nYou'll feel the mack first\nIn your back first\nThen the black hearse\nGoddamn, I can't understand the drama why?\nTo tell the fucking truth I thought your crew was fly\nNow you're talking that shit like a bitch on the rag\nDon't give a fuck about your set or the pants you sag\nI drop a hot one in your forehead, neck and mouth\nThen rush a hospital and bank ya if you don't check out\nCause I'm a mad nigga once, a crazy nigga twice\nA cold blooded motherfucker, that's why they call me ICE\nAnd if you told me this would happen\nI would said never - no, we down forever - we flipped keys together\nNow the street talkers say you want my spot\nA lotta niggas did, A lotta niggas shot\n\nChorus\n\nIt's obvious some sucka niggas got ya gassed\nLet's see if they around you when the gunshots blast\nIt ain't nothing nice, letting off slugs under the street life\nEarly deaths, dry gags and last breaths\nI seen your time before you want - war till it's on\nHow to fuck with the king, when you're a bullshit pawn?\nI can't comprehend your stupidity, miscalculation\nWord to obstetricians show your crews anhiliation\nPredicted, Brains get evicted, Fuckin with me kid\nBullets lift your lid\nAnd watch your weak kool aid heart run down the drain\nI got the Method Man who came to bring the pain\nLet you know quick, niggas suck dick if you trip\nUsed to be my homie, now you just a punk ho bitch\nFrustration leads to aggravation and dismay\nNow you're player haten, but that's the wrong game to play\nI light your block up, kidnap your moms - snatch your woman\nYou beg for me to stop, but I'll just keep coming\nYou're fucking with the illest fool in Southern California\nI can roll with ya, or motherfuckin' on ya\n\nChorus x2\n\nYeah, I know the real nigga can feel this\nThis is dedicated to all my \"friends\"", "image": "https://images.genius.com/64f26659fd999b48a36adf8773cb8eb0.1000x1000x1.jpg", "album": "The Seventh Deadly Sin", "year": null}]}