{"songs": [{"title": "Devil In A Blue Dress", "album": "Heist of the Century", "year": "1997-03-04", "image": "https://images.genius.com/29aed50e708381cab4e55222550f38fa.962x925x1.jpg", "lyrics": "[Intro]\nWord up!\nYeah! La the Darkman, you know what I''m saying?\nWord up! takin' you on this expedition, Trafficante\nWord up! the underworld mission\nYou know what I''m saying?\nRevolution, yo\nCheck it out, yo\n\n[Chorus]\nThe La's invincible\nYou thug cats, I'ma stab on principal\nBetter off dead working with a glass forehead\nYou got star dreams on a corner drinking gasoline\nMy man threw you up in a fiend no contest\nDunn I'm blessed and you a devil in a blue dress\nDunn I'm blessed and you a devil in a blue dress\n\n[Pre-verse]\nYou know what I''m saying? Word up! La the Dark\n\n[Verse 1]\nYo, this brilliant companion piece to the original\nApproach my slang and end up in critical condition\nWhen I lick my shells, I ain't missing\nTechnician, you get stabbed back in position\nI know that money bring bitches and bitches aren't to be trusted\nSome rappers sniff coke and others be getting dusted\nCity lights, I'm in it with new books to read\nI feed my man locked down, my physicals and my seed\nI ain't got shit, while you rap niggas be playing rich\nSend you to Vegas in a ditch, making life cold switch\nI'm invincible, you get dead before you start\nMy knife is sharp, push rap spikes through your heart\nLa fight dirty, I strike first like snatching a purse\nInside my verse, take you to the edge of the earth\nAnd throw you over, son you drunk I smack you sober\nAssassin, blasting up your Range Rover\n\n[Chorus]\nThe La's invincible\nYou thug cats, I'ma stab on principal\nBetter off dead working with a glass forehead\nYou got star dreams on a corner drinking gasoline\nMy man threw you up in a fiend no contest\nDunn I'm blessed and you a devil in a blue dress\nDunn I'm blessed and you a devil in a blue dress\n\n[Verse 2]\nTriple darkness, yo, expedition\nYo, I'm from a long breed of stick up kids\nCoking hustlers, Gods\nForeign cars, strong arm Tech tusslers\nThe streets got me in a hold chin deep\nQuantum leap, a bum told me life is cheap\nMy lyrics dancing, lamping, eating fish in a Wu mansion\nAt Park Place I'ma dance and only my wiz I'm romancing\nPosted all you chicken niggas get roasted\nI read manuscripts, in 97 whips L's is toasted\nI said something, I meant it, your Benz'll get dented\nMy guns get more open than a envelope with money in it\nWhere I live it's only crack, fiends and dirty jeans\nShorties on the block with the platinum drug dreams\nEverything ain't how it seems, I got bagged at 14\nOn a highway running guns outta New Orleans\nIt's La, what you think them niggas tremble in pink\nStumbling, you a cat that turn tough when he drink\nKeeping you lifted, reminisce on what Chris did\nPull out the mac and shot five cats and a civilian\nRight in front of the building with kids playing, Shells is spraying\nOn the second floor Shelly mom's praying\nGot caught by a stray in a window in broad day\nAnd she die, fucked up it had to be that way\nIt was a drunk nigga who done it\nWord up! You know what I''m saying? Yo\n\n[Chorus]\nThe La's invincible\nYou thug cats, I'ma stab on principal\nBetter off dead working with a glass forehead\nYou got star dreams on a corner drinking gasoline\nMy man threw you up in a fiend no contest\nDunn I'm blessed and you a devil in a blue dress\nDunn I'm blessed and you a devil in a blue dress\n\n[Outro]\nWord up!\nLa Trafficante, you know what I''m saying?\nYou kids better walk straight and master your high\nYou know what I''m saying? Or you'll be the next to die\nWord up! Sending hands to Allah\nYou know what I''m saying? Word up!\nTriple darkness, Supreme, word up!\nPower, and my whole unit!"}], "artist": "La The Darkman"}