{"artist": "Yung Joc", "songs": [{"album": "New Joc City", "image": "https://images.genius.com/c8d5a7e86b7ff9f7536f527abd4fc252.500x499x1.jpg", "year": null, "lyrics": "(Everythang that glitters ain't gold baby)\n[Joc] I hear you daddy (mm-hmm)\n\n[Chorus: repeat 2X]\nI'm choppin twenty-fo's, blowin good 'dro\nYeah I got plenty Hoes (but life ain't picture perfect)\nYeah you see the ice, and I dress nice\nMake 'em look twice (but life ain't picture perfect)\n\n[Verse One]\nYeah I'm blowin on some good lime, skatin down 285\nWouldn't believe half of the shit that's skatin through a nigga mind\n745 complimented with leather and wood\nChickens on my dick, cause a nigga fresh and smellin good\nJack boys plottin for my stacks on deck\nWanna put the tech to my chest for the ice on my neck\nOh yeah it's easy to attain it all, harder to maintain it all\nIf you want a perfect picture only God can paint it dawg\nNiggas in these videos with multi-platinum projects\nCain't even get credit cards and they momma stay in projects\nHow is that? Scracth my head, somethin don't seem right\nYour teeth full of ice so when you smile I seen lights\nSeems like I'm hatin, I'm just statin the facts\nI ain't fin' ta smile in your face and put a blade in your back\nNow, now try not to get caught up on the way shit looks\nCause everything ain't picture perfect nigga listen to the hook\n\n[Chorus]\n\n[Verse Two]\nYeah I'm off in Magic City, trickin off on ass and titties\nBitches blowin me kisses, makin me wanna hit it\nI must admit it got a good chick and she been holdin me down\nBut I ain't fuck around, there's too much shit goin 'round\nLike the rims on my pickup, scared to get my dick sucked\nNigga run into the clinic even from a hiccup\nPick up the pieces to the fuckin puzzle\nI'm affiliated with niggas who murder rob and hustle\nPlus you think I'm ballin cause I'm poppin Crist' and spendin G's\nI'm just tryin to drink away the pain that killed my nigga Steve\nNigga please, I ain't shit, cookies and cream\nFeelin like Marvin, it make me wanna holla and scream\n\n[Chorus]\n\n[Verse Three]\nNow half the shit you doin already been done\nAnd that's why half my niggas dead, locked up or on the run\nThat dope money ain't sufficient, it don't last always\nNiggas trap all night, in project hallways\nAll day long, niggas front like stars\nOn them big ass rims, that cost more than they cars\nSpent three hundred on the outfit, a hundred on some Nikes\nBut his baby needs wipes diapers and Pedialite\nAnd you probably got a cousin, brother or a friend\nAnd this song sound like him from beginnin to end\nThen again it might be me, and I'm tired of the nonsense\nCain't sleep at night cause I got a guilty conscience\n\n[Chorus]\n\n[Outro]\nCan't you see? Can't you see, can't you see!\nCan't you see! Can't you seeeeeeeeeeee\nCan't you see {*repeats to fade*}", "title": "Picture Perfect"}]}