{"artist": "AZ", "songs": [{"title": "How Many Wanna", "image": "https://images.genius.com/579dc32ea6426424aac167e07908b6e9.240x238x1.jpg", "album": "9 Lives", "lyrics": "[AZ] [Hook]\nHow many chicks wanna fuck tonight? [(Amil)] Tonight\nHow many chicks wanna suck tonight? [(Amil)] Tonight\nHow many chicks wanna fuck and suck and suck?\nGet fucked and bust tonight?\n\n[Verse 1]\nLex GS, Wide body, Remy VS\nMilitants niggas see less, chrome spinnin'\nGot a lust for them grown women\nClassy skirt, work-type chicks that own linen and\nHate sneakers, only accept cellies, won't chase beepers\nUnderstand space when needed they relate deeper\nRespect hustle, pretty wit' they lewie duffle\nVia Spigga wit' the stacks over they Huey Russle\nI style wit' 'em, smile, sit 'em down, child wit' 'em\nLay it down if it's love then I'm outa town wit' 'em\nShow 'em some new shit, then give 'em some new dick\nHelp 'em really confront on who they fucking wit'\nFeel a nigga? I'm made for this, remain flawless\nI'm like the same song never change chorus\nIt's real, from the hood, but fortune and still\nLost in the hills, niggas soft in the grill\nIt's on\n\n[Hook][AZ]\nHow many chicks wanna fuck tonight? [(Amil)] Tonight\nHow many chicks wanna suck tonight? [(Amil)] Tonight\nHow many chicks wanna fuck and suck?\nAnd suck, get fucked and bust tonight?\n[Amil]\nYo:\nHow many niggas wanna stick tonight? [(AZ)] Tonight\nHow many niggas wanna lick tonight? [(AZ)] Tonight\nHow many niggas wanna stick and lick?\nAnd stick and lick and trick tonight?\n\n[Verse 2]\nEight wonder, poker face, aces under\nEmbrace the mink weather but relate to summer\nNew wardrobe, chicks wit' they waistes younger\nBig coupes kitted up, you can taste the hunger\nHang wit' me, watch how the ladies exchange wit' me\nLeavin' the club laughing like them came wit' me\nCop heavy, feel rhythmatic I rock steady\nRegardless of the pussy you can have it I'm not petty\nIt's plain, never meant for the heart but the brain\nDepart from the pain, that's the art of the game\nForgive if I ever did, involve your wiz'\nThat's no reason for niggas, not to father they kids\nI'm don, New Guinea born, city calm, with the Russian varn\nLooking pretty, all fitted strong, could see it's me\nWho else get head in a Vee?, rock red in the Pee?\nSpread hash in the streets?\nI'm gone\n\n[Hook]\n\n[AZ]\nHow many chicks wanna fuck tonight? [(Amil)] Tonight\nHow many chicks wanna suck tonight? [(Amil)] Tonight\nHow many chicks wanna fuck and suck?\nAnd suck, get fucked and bust tonight?\n\n[Amil]\nYo:\nHow many niggas wanna stick tonight? [(AZ)] Tonight\nHow many niggas wanna lick tonight? [(AZ)] Tonight\nHow many niggas wanna stick and lick?\nAnd stick and lick and trick tonight?\n\n[Verse 3]\nNothing new, understand this is something we do\nParty night, play the dance floor, once in a blue\nMe and the crew, prank jewelers, we somethin' to view\nBeyond live, we leave all that stuntin' to you\nDid the swish shit, and all the mistress\nNiggas wives wit' they wrist slit\nAnd still a nigga never did kiss\nI'm cold, cris bottles, six bottles\nSpit it like and Iceburg novel and chicks follow\nFinesse, I move off the love of the sex\nAnd if it's over you can bet my hands is huggin her neck\nAll the respect never one to try and spoil her rep\nBut if she stress gotta play the chick more to the left\nMoney or hoes? can take those from under your nose\nEyes shut like them pros, wit' both of them closed\nSo niggas what? I'm here to take back, every buck\nEvery chick, ever fucked, time to stick niggas up\nLet's go\n\n[Hook][2X]\n\n[AZ]\nHow many chicks wanna fuck tonight? [(Amil)] Tonight\nHow many chicks wanna suck tonight? [(Amil)] Tonight\nHow many chicks wanna fuck and suck?\nAnd suck, get fucked and bust tonight?\n\n[Amil]\nYo:\nHow many niggas wanna stick tonight? [(AZ)] Tonight\nHow many niggas wanna lick tonight? [(AZ)] Tonight\nHow many niggas wanna stick and lick?\nAnd stick and lick and trick tonight?", "year": "2001-06-12"}]}