{"songs": [{"lyrics": "[Produced by The Neptunes]\n\n[Intro: Jay-Z]\nRoc-A-Fella Records\nThe imperial Skateboard P\nGreat Hova\nY'all already know what it is! (Oh shit!)\nC'mon! (Woooo!)\n\n[Verse 1: Jay-Z]\nYeah, so what if you flip a couple words?\nI could triple that in birds\nOpen your mind, you see the circus in the sky\nI'm Ringling Brothers, Barnum & Bailey with the pies\nNo matter how you slice it, I'm your motherfuckin' guy\nAnd just like a b-boy with 360 waves\nDo the same with the pot, still come back beige\nWhether right or southpaw, whether pot or the jar\nWhip it around, it still comes back hard\nSo easily do I W-H-I-P\nMy repetition with wristses'll bring the kilo bidness\nI got Creole C.O. bitches for my niggas\nWho slipped, became prisoners, trees taped to the visitors\nYou already know what the bidness is\nUnnecessary commissary, boy, we live this shit\nNiggas wanna bring the 80s back\nThat's okay with me, that's where they made me at\nExcept I don't write on the wall\nI write my name in the history books, hustlin' in the hall\nNah, I don't spin on my head\nI spin my work in the pot, so I can spend my bread\n\n[Chorus: Jay-Z & Pharrell]\nAnd I'm gettin' it, I'm gettin' it\nI ain't talkin' about it, I'm livin' it\nI'm gettin' it, straight gettin' it\nGe-ge-ge-get get get it boy\nDon't waste your time fighting the life\nStay your course, and you'll understand\nGet it boy\n\n[Verse 2: Jay-Z]\nIt's '87 state of mind that I'm in (mind that I'm in)\nIn my prime, so for that time, I'm Rakim (I'm Rakim)\nIf it wasn't for the crime that I was in\nBut I wouldn't be the guy who rhymes it is that I'm in (that I'm in)\nNo pain, no profit\nP, I repeat if you show me where the pot is (pot is)\nCherry M3's with the top back (top back)\nRed and green G's all on my hat\nNorth Beach leathers, matching Gucci sweater\nGucci sneaks on to keep my outfit together\nWhatever, hundred for the diamond chain\nCan't you tell that I came from the dope game?\nBlame Reagan for making me into a monster\nBlame Oliver North and Iran-Contra\nI ran contraband that they sponsored\nBefore this rhymin' stuff we was in concert\n\n[Chorus: Jay-Z & Pharrell]\nAnd I'm gettin' it, I'm gettin' it\nI ain't talkin' about it, I'm livin' it\nI'm gettin' it, straight gettin' it\nGe-ge-ge-get get get it boy\nDon't waste your time fighting the life\nStay your course, and you'll understand\nGet it boy\n\n[Verse 3: Jay-Z]\nUhh, push (push...)\nMoney over broads, you got it, fuck Bush\nChef (chef), guess what I cooked?\nBaked a lot of bread and kept it off the books\nRockstar (rockstar), look\nWay before the bars my picture was getting took\nFeds, they like wack rappers\nTry as they may, they couldn't get me on the hook, uhh\nD.A. wanna indict me\n'Cause fishscale's in my veins like a Pisces\nThe Pyrex pot, rolled up my sleeves\nTurn one into two like a Siamese twin\nWhen it end, I'ma stand as a man\nNever dying on my knees, last of a dying breed\nSo let the champagne pop\nI partied for a while now I'm back to the block\n\n[Chorus: Jay-Z & Pharrell]\nAnd I'm gettin' it, I'm gettin' it\nI ain't talkin' about it, I'm livin' it\nI'm gettin' it, straight gettin' it\nGe-ge-ge-get get get it boy\nDon't waste your time fighting the life\nStay your course, and you'll understand\nGet it boy\n\n[Outro: Denzel Washington from  American Gangster]\nBlue Magic, that's a brand name\nLike Pepsi, that's a brand name\nI stand behind it, I guarantee it\nThey know that, even if they don't know me anymore than they know the, the Chairman of General Mills... my man", "title": "Blue Magic", "image": "https://images.rapgenius.com/57766f200c2733a655a3de328acd00a3.1000x1000x1.jpg", "year": "2007-11-06", "album": "American Gangster"}], "artist": "JAY-Z"}