{"artist": "Pharoahe Monch", "songs": [{"album": "Desire", "title": "Trilogy", "image": "https://images.genius.com/9550ab49453d639d9e2d3a07226ff0ed.500x500x1.jpg", "lyrics": "I now pronounce you husband and wife\nYou may now kiss the bride\n\n{*Act 1*}\n\n[Mr. Porter]\nCops comin', shots fired\nBabies cry, I cry\nWishin' I, could change what\nThis is just my life\n\n[Pharohe]\nGod\nWhy is my wife bleeding?\nSheet cover her face, paramedics are leaving\nBehind her clothes it's apparent she's not breathing\nI'm a little confused about what it is I'm seeing\nPlus there's a naked man on my lawn\nPolice in the living room with all of their guns drawn\nOut, and the last thing I remember is\nUh, last thing I remember is\nI received a text page from Julio who expressed that I left my cell-phone in the studio\nRight underneath the disc with the Pro Tools\nNext to a six-pack of O'Douls and some soul food\nYeah and I was on my way home\nExit the expressway to use the payphone\nBut fuck it cause my wife isn't back from her trip\nI sneak into the house cause she'll never expect it\nExcept\n\n[Hook]\n\n{*Act 2*}\n\n[Dwele]\nHe put the gun in my hand\nTold me go take my revenge\nKilling him won't make it go away\nIt's only gon' bring more pain\n\n[Pharaohe]\nI tied his hands behind his back to the night-stand fast\nRopes made bruises on his light-skinned ass\n\"See, I can play games too\"\nYeah, that's what I told him when he came to\nNow look, see what the game and the fame do?\nMade a deranged mind out of someone in your same crew\nFuck man, we grew up together\nRun-DMC, tougher than leather with the same outfits\nForty-deuce, takin' flicks like\nWhy did you fuck my wife, man?\nYou shoulda took my life man\nI switched the gun into my right hand\nThe sweat accumulated on his forehead\nI saw red, he said...\nNow was it worth it man?\nWas it everything you imagined, was it perfect?\n\n[Hook]\n\n{*Act 3*}\n\n[Pharoahe]\nTook you to be my lawfully wedded wife\nTo have, to hold, to love, to cherish but\nDeath till us part\nWhat a coincidence\nNow perhaps the police will be convinced that it was an accident\nIf I'm accurate and careful with the evidence\nThis mother fucker says passing up my residence\nAnd to believe those vile set a precedence\nFrom the start it should've been obvious it never did\nPrevalent, the wicked debauchery and decadence\nWas carried out with such masterful excellence\nAnd this is just where you rip my heart\nIt was natural to transform murder into art\nAnd the weight of my conscience would knowingly carry\nThree-sixty-five days to the date that we was married\nThoughts that I would achieve the murder would vary\nWe're closer than ever\nTogether we'll be buried cause\n\n[Tone]\nEvil eyes that bide\nHow they go you so\nWhy do we\nWhat do they see?\nI just lost control\nHad to let you go\nI cry cause slowly we try\nSo slowly we die\n\n[Pharoahe]\nBuried alive in the grave\nToo exhausted to climb out\nBefore dirt was tossed on me\nCome to find out\nNo friend of mine, she sleeping with committed the crime\nIn the past three years, switched identities six times\nAnd all the while I'm devoted to love and loyalty\nThey plotted on my publishing checks and royalties\nShe's thinking its true love\nHe's scamming her for the quop\nGot in order to devise my own intuitive plot\nPut the prose on him\nLaunched the probe on him\nNow harm him, pen him, get him exactly where I wanted him\nCornered him, now his mission is aborted\nYou are about to be professionally extorted\nGuess we all 'bout to murder tonight\nMiss pretty brown eyes while she sleeps under the moonlight\nDo it and bounce\nThe keys to the crib you'll find under the mat in the front of the house\nJust do it, what out\n\n[Hook]", "year": "2007-06-26"}]}