{"artist": "Kirko Bangz", "songs": [{"image": "https://images.genius.com/bcc2f0495800cd7bf2c97fcc249ac6d8.960x949x1.jpg", "title": "Play Me", "year": "2011-12-15", "album": "Progression 2: A Young Texas Playa", "lyrics": "[Verse 1]\nWhy the fuck you’re trying to play me\nFuck you tryna to play me?\nGirl, just cause we’re fucking, that doesn’t mean we married\nWhy the fuck you’re trying to play me?\nWhy the fuck you’re trying to play me?\nGirl, just cause we’re fucking, that don’t make you my lady\nFuck you tryna to play me?\nFuck you tryna to play me?\nYou act like you my nigga\nBut I know you nigga is shady\nWhat a fuck you’re trying to play me, dawg?\nI ain't got no time to sit around and play with y'all\nYou hate me cause I made it dawg\nI guess the right thing for me to do right now is to wait on ya'll\nNo fuck that, I’mma walk up in this mother fucker with my hands up\nWit my hands up\nMakin all these motherfuckers put their hands up\nIf they ask for a nigga from the ghetto motherfucker that'll kill motherfuckers I'mma stand up\nI know some girls that said they can't jam us\nI know some girls that can’t stand us\nBut this is because when we met, we fucked\nAnd every time they call I don’t answer\nDon’t play me\nCause you know that if I was there right now\nBitch you would try to see me\nYeah, I fucked your friends, and your fuck ass man wanna be me\nAnd Stacy I used to love her, she was there before I blew up\nBut I guess I, I just been gone too long\nOr I guess I’ve been holding on too long\nOr maybe, I’ve been putting me on too long\n\n[Verse 2]\nWhatever it is, or what it may be\nYou got a man or I been acting shady\nI enjoyed the moments, sayin girl you made me smile\nI just wish that you was here with me right now\nNah really, I’m just pissed cause you ain’t down\nLike you said you would, like you said you would\nAnd I fucked it up like you said I would\nAnd I knew I would but don’t be trying to play me\nDon’t be trying to play me\nSay don’t be trying to play me\nDon’t be trying to play me\nAnd my family, I love family\nBut the word mean more it's embarrassing\nThey been drop my name, drop my name\nTalking about that I’m about to drop that change\nI’m the same old nigga, got the same old digits\nBut everybody about to make me change on niggas\nChange on niggas, change on niggas\nAnd it's funny how I made it and these people steady callin'\nSame people didn't know me till a nigga started ballin'\nI just spent ten in the strip club\nWalk in today, and these bitches acting like they don’t know me\nKnow me, I think my new bitch really want me\nBut she with a nigga I ain’t tripping cause her homie\nKnow she wanna fuck, I ain’t really wanna fuck\nThen the bitch walked up saying don’t be trying to play me\nDon’t be trying to play me\nDon’t be trying to play me\nDon’t be trying to play me"}]}