{"artist": "360", "songs": [{"album": "Please Be Seated 3", "year": "2016-01-08", "title": "I’m Sorry", "image": "https://images.genius.com/88c1e39a08ef59af4f7539446b1fc7a4.500x500x1.jpg", "lyrics": "[Verse]\nI should be dead, maybe I got nine lives?\nSeven left cause I've already died twice\nI'm glad it wasn't bye-bye\nBecause it's my time to do it without the high-life\nWhat I'm making is really dope\nBut I needa talk about some shit that happened a year ago\nHold up, let me clear my throat\nYo I'm about to get deep but I really hope you feel it though\nSee talking 'bout it hurts\nSince when I was an addict but I was at my worst\nNo-one knew, I didn't tell one person\nCouldn't bring myself to do it cause I felt like a burden\nGive me any drug, I was chewing 'em up\nIf I have nine lives then I'm using 'em up\nNo-one knew my addiction, it was stupid as fuck\nNinety pills daily of Nurofen Plus\nI know that's extreme and I should be dead right\nBut I was so fucked up my tolerance was that high\nThat's the thing with the codeine addiction\nIt's over the counter so you don't need prescriptions\nThat's three packets in a day\nI didn't get high but I would have 'em anyway\nCause if I didn't take 'em then I'd be hitting withdraws\nAnd guess what? All of this was mid-tour\nAnd I can't play in this form\nHaving shit thoughts like I got nothing to live for\nI was a zombie, I couldn't feel nothin'\nI smashed four packets cause I just wanted to feel something\nYo, I overdosed for sure\nI was at the venue, I was going to perform\nI can't remember, see I was told in the report\nMy tour manager found me convulsing on the floor\nEveryone surrounding, no one knowing what it's for\nLiterally no one knew that I was going through it all\nI fucked up, I should be knowing this before\nI'm a fucking junkie, how am I going on a tour?\nI let down my fans and I owe it to them all\nThat's why I’m being honest and so open with it all\nIt's so hard no one knowing what is wrong\nI can't talk about it so I wrote it in this song\nWoke up in hospital going through withdrawals\nSomeone guarding my bed but nobody would talk\nNo phone there, nobody to call\nSaying \"what the fuck is going on?\" and no one would inform me\nAnd I’m not knowing whats it's for\nTubes everywhere, if only I could walk\nA man approaches \"am I alright doc?\"\nThen he tells me I'm on suicide watch\nI'm a danger to myself, I wouldn't be leaving\nI didn't try kill myself but they wouldn't believe me\nI spent a month in a hospital bed\nLiving in a nightmare and I just wanted to end\nI'm thinking to myself have I got any friends?\nOr friends who don’t use, have I got any left?\nThere's many times where I'd want to be dead\nBut we've lost too many and I don’t want to be next\nNow I’m happy that I got me some rest\nI know for sure now that I don’t want it again\nThe harder I hit the gym then the stronger I get\nThe more the devil on my shoulder hasn't got any strength\nI let my fans and my family down\nThe people standing by me are like family now\nYo I’m sorry to anyone who's a fan of me\nI understand if you wanted to abandon me\nBut if it wasn't for my family\nI would've tied the knot on the rope the devil handed me\nI gotta show ma' father and my mum love\nAnd let 'em know that it's not them that fucked up\nNow you got a quality son\nIf I say I’m gonna do it then the job'll get done\nI embrace any pain, now I’m not gonna run\nThe gym's a new addiction but a positive one\nThe battle with addiction's a battle on its own\nThe worst part is that I tried battle it alone\nSo if your hearing this and your battling at home\nTell somebody because your family should know\nI'm loving life now, I'm getting it back\nIf I can do this shit fucking anyone can\nI can't remember cause I blacked out\nBut I wouldn't change a thing cause it made me who I am now\n\n[Outro:]\nBless up\nI'm back\nThis time I'm not gonna fuck off, I'm not gonna fuck up\nI'm a different person\nI'm not just saying that\nI'm fucking loving life at the moment and I'm\nVery grateful cause I should be fucking dead\nAnd that's the truth\nThanks to anyone who's supported me lately\nIt's been insane, all the emails\nAll the DMs on Instagram, everything\nMuch love"}]}