{"artist": "Kilo Ali", "songs": [{"image": "https://images.genius.com/c8c0e4156ad694a47cf6026ffe140cc7.466x466x1.jpg", "title": "Hey Little Niger Boy", "year": null, "album": "America Has A Problem (Cocaine)", "lyrics": "[Verse 1]\nCome and take a trip through history\nNow imagine thee in slavery\nTragic, oh isn't it?\nBut what about the people that were there?\nDo you think it's fair, do you even care?\nThink that my people were treated rotten\nEach and every day in a field picking cotton\nThat hung from a tree, and forgotten\nThey brought us on a boat, but it wasn't first class\nTo make it plain and simple, they labeled us as trash\nThey gathered us up and put is in an auction\nA man on the street said \"Mmm, I'll take that one\"\nDon't talk about working, because we had to\nAnd run around the house screaming \"Yessir, master\"\nOnly rule we knew was the white man's rule\nA whip on his side, and he's enforcing too\n\n[Chorus]\nHey, hey little nigga boy, hey, hey little nigga boy\nHey, hey little nigga, hey little nigga, hey little nigga boy\nHey little nigga boy, hey little nigga boy, hey little nigga boy\n(Yeah)\n\n[Verse 2]\nThey gave us little freedom, but are we really free?\nNah, not as far as I can truly see\nWhen we scream equal rights, they really wasn't with it\nThey said \"Nigga boy, you might as well forget it\"\nNow how they change our name, from \"negro\" to \"nigga\"\nThe word got smaller instead of getting bigger\nMy brothers and sisters, don't let them hold you back\nIf you're an oreo cookie, then he's a saltine cracker\nThe way that I see it, and the way that I figure\nStand up for yourself when they call you a nigga\n\n[Chorus]\nHey, hey little nigga boy, hey, hey little nigga boy\nHey, hey little nigga, hey little nigga, hey little nigga boy\nHey little nigga boy, hey little nigga boy, hey little nigga boy\n\n[Verse 3]\nWe're adopted to their ways, they made us all a phony\nA black man name doesn't supposed to be \"Tony\"\nAnd the women, ooh all the girls out there\nWhen you ever see a black woman with real blonde hair?\nAnd the fellas, the way we treat one another\n\"What's up my nigga\" instead of \"my brother\"\nPeople roll up on me and they ask me why I'm naughty\nBut do I have to be naughty just because I rock a party?\nI start my execution like an institution\nGive me a minute, just be there\nI'll bet you the party with Lucy\nAnd then I take a tempo, taking it very simple\nAnd give me a sucker MC, or should I just call 'em a bimbo?\nI crack 'em down the spinal, termination's vital\nHard should I hit it when I'm comin' like a rhino\nDon't ever second guess me, don't pull an MC past me\nI'm the king of rock n' roll, fuck an Elvis Presley\nI ain't no joke and I ain't no toy\nAnd all that was said by a nigga boy\n\n[Chorus]\nHey, hey little nigga boy, hey, hey little nigga boy\nHey, hey little nigga, hey little nigga, hey little nigga boy\nHey little nigga boy, hey little nigga boy, hey little nigga boy\n\n[Verse 4]\nNow let's take a color, any old color\nWe might as well take a sister and a brother\nWhen a white man's running, then he's jogging\nIf a black man's running, then he's robbing\nIf a white man made it, then it's worth it\nIf a black man made it, then it's worthless\nIf a white girl said it, then she's sexy\nIf a black girl said it, then she's messy\nWhen a white man's murdered, everyone's down\nWhen a black man's murdered, no one seems to care\nWhen a white boy chillin', then they're chillin'\nWhen a black boy chillin', we gotta be dealin'\nNo matter what they say or they want you to be\nYou control your own destiny\n\n[Chorus]\nHey, hey little nigga boy, hey, hey little nigga boy\nHey, hey little nigga, hey little nigga, hey little nigga boy\nHey little nigga boy, hey little nigga boy, hey little nigga boy\nHey little nigga boy, hey little nigga boy, hey little nigga boy"}]}