{"artist": "Ace Hood", "songs": [{"title": "Light Up (Freestyle)", "album": "The Statement", "year": null, "lyrics": "[Intro - Ace Hood]\nWell alright\n(Statement)\nThere's only one way to go from here\nAnd that's up\n(Mister Hood)\nAmen\n\n[Ace Hood]\nOkay, me and them schemes got my past life jealous\nNiggas doing crime but I'm into making cheddar\nPromise to my mama you will never send me letters\nOr view me through them bars with them murderers and killers\nAddicted to the women, but she like to call them hoes\nWith them fine high heels and them super fitted clothes\nFascinated by the dough, I graduated on\nJust my salary alone I can get a bank a loan\nWith them six figure checks that just pop up at my home\nGot me flying around the world, Louis V. to carry on\nAnd what do I do? Blow a couple on a shone\nBrag about it on the phone to my niggas back at home\nGot my mama in my ear saying \"Leave the women 'lone\"\nThey don't mean you no good, they just know you by your song\nBut that's another note, I just thought I'd let them know\nMister Chili-Pepper-Flow, sick as AIDS in the throat\nMan you niggas for the show, call them Doctor Huxtable\nThis 'The Statement', I swear you rappers sign at the do'\nMister 9-5-4, blow a nigga team's smoke\nWho going to kill them in the end before the credits even wrote?\nThis a movie, niggas playing groupies\nJumping on your dick when they see you in the two seat\nClaiming that he hot, but you rappers never move me\nLike they take the action out the motherfucking movie\nBoo he, puue, nigga I'm the shit man\nBad bladder so I only wear a shit bag\nYeah, so name another nigga this dope\nIf it is, probably turn him into white coke\nBig money, bitch nigga I repute broke\nLight slow and I swear I let them all know\nI'm at your front door\nLight it up if you know you got the good smoke\n\n[Drake]\nWho would have thought\nI'd be caught, in this life?\nLet's celebrate, with a toast\nAnd get lost, in tonight\nAnd make it all light up\nWait until the sun goes down\nWe going to make this bitch light up\nEven when the sun goes down\nI'mma make it go...", "image": "https://images.genius.com/984a9fc116ba562402e834570f98dc5c.500x500x1.jpg"}]}