{"songs": [{"title": "What Thugs Do", "album": "Heist of the Century", "year": null, "image": "https://images.genius.com/29aed50e708381cab4e55222550f38fa.962x925x1.jpg", "lyrics": "[Intro: La the Darkman, (DJ Rogers & Puff)]\nYeah. Yeah. One. Two\nYeah. Yeah. Yeah. (Oh)\nTime for another cat get his money\nYa'nah'mean? Let's just stroll alone\n(Havin money, havin money)\nWord life. (Havin money)\n\n[La the Darkman]\nYo, yo, life is hard, so I dedicate to God\nMad cats sell coke, tryin not to starve\nYoung girls sell vagina from Jersey to Carolina\nSaw moms do it, she learned it as a minor\nIn poverty, life expectancy is short\nKids rob spots, push crack or play sports\nIn projects, single parents homes and techs\nIslam, bass-heads and welfare checks\nI'm tryin to eat, pushin wide-bodied whip through the streets\nMy whole fleet is wolves disquised as sheep\nIn society, the poor in America are miserable\nUntrained, starvin like the children in Israel\nFirst jewel since men spoke Hebrew\nNow niggas drink brew, guzzle Lucefer stew\nYoung E, only eleven, got a three-fifty-seven\nAnd said he sold drugs by day cuz havin cream was heaven\n\n[Chorus x2: DJ Rogers & Puff]\nWhat young thugs do for money\nWhat young thugs do for money\n\n[La the Darkman]\nYo, niggas keep eyein me, my life is like administer society\nI'm old dog, many fake thugs think of tryin me\nSorry, I'm the lion in this concrete safari\nMy Niggas been in and out of jail since Atari\nThe street life is the only life I know\nPuff trees, v12, my medallion glow\nAnd I'm always gotti, but cats don't know me\nMy peoples run the island on Riker's and the Coney\nI keep the new fresh, planned Clark's like Tony\nI'm married to my guns in holy matrimony\nWith street raps, all the bullshit, you keep that\nRhyme for my niggas on the corner that keep gats\nSince school cats, niggas incarcerated\nAll praises due to Allah cuz I made it\n\n[Chorus x2]\n\n[La the Darkman]\nYo, yo, yo, yo, as an adolestant, I grew up stressin\nWith a lust for jewelry, clothes and metal weapons\nBased on the streets, life about cream and whip\nCells with the chip, big guns and big clips\nA dime piece to strip and more bricks to flip\nGhetto novel, my lex shines like the Apollo\nLa songs, philosphies is a street Aristotel\nIt's policticians, catholics and christians\nKids who don't listen, on Riker's pissin\nLife, can't play Cee-Lo with two dice\nAnd you go through Hell just to come out right\nCuz we go through Hell just to come out right\n\n[Chorus x4]\n\n[Outro: DJ Rogers & Puff]\nThugs that get that money (get that money)\nDon't let money change you (don't let it change you)\n(no, no, no, no) Thugs that get that money (ohhh)\nMoney, don't let money change you (don't let it change you)\n(Ohh, no, no, don't let money change you)\n(I'm tellin you, don't let it change you)\n(Do you want the dollar? Got to have the money)\n(Uh, got to have the money)\n(Ain't worth the problem...)"}], "artist": "La The Darkman"}