{"artist": "YG", "songs": [{"image": "https://images.genius.com/0234c65f6d6514702072da47412b8cc3.500x500x1.jpg", "year": "2011-03-02", "album": "Just Re’d Up", "lyrics": "[Chorus]\nFirst off, this beat bang\nAsk around, I'm the motherfuckin' man\nI'm about to drop ten racks on a chain\nAnd find a pretty bitch that I can dip with in the Range\nI'm good, I put that on the hood, I'm good\nI'm good, I put that on the hood, I'm good\nI'm good, I put that on the hood, I'm good\nI'm good, I put that on the hood, I'm good, nigga\n\n[Verse 1]\nAyy, ayy, I'm so straight the cops so crooked\nClique full of soldiers like No Limit\nYG, what you doing? Bitch gimme four minutes\nAll in a nigga grill like four dentists\nRidin' 'round solo got the money in the choke-hold\nWhole head tattooed like a fucking Cholo\nNever hate the next man nigga that's a no no\nGot ya girl bouncing on my dick like a low low\nMustard on the beat, mustard get a fucking check\nI got bitches, take bitches nigga wanna bet?\nIce on my neck got ice in my ears\nHit the club niggas looking at me hella weird\nIt's YG 400, bitch, get it right\nYou at the club every weekend? Bitch get a life\nEver since she fucked with me, she never been the same\nWell, god damn, just blame it on my ding-a-lang\n\n[Chorus]\nFirst off, this beat bang\nAsk around, I'm the motherfuckin' man\nI'm about to drop ten racks on a chain\nAnd find a pretty bitch that I can dip with in the Range\nI'm good, I put that on the hood, I'm good\nI'm good, I put that on the hood, I'm good\nI'm good, I put that on the hood, I'm good\nI'm good, I put that on the hood, I'm good, nigga\n\n[Verse 2]\nI'm so froze, diamonds look so lemon\nUsed to text 'cause my phone had low minutes\nNiggas need swishers so we at the store with it\nIf you don't drop on the blunt then you don't hit it\nFlyer than a eagle, ridin' in a regale\nMoney over bitches, nigga, you don't think we know\nPockets full of c-notes, oops, I mean p-notes\nBitch in the whip looking hot like a Cheeto\nUh, Louie bag and a briefcase, bitch\nI get money like a sweepstakes\nUh, every week a nigga eat steak\nWhat's dessert? Shit, I wonder how she tastes\nI don't want her, you can get her\nBitch you ugly like yo' daddy Reggie Miller\nLike Pittsburgh bet I steal her\nAnd fuck her in the whip brand new from the dealer\n\n[Chorus]\nFirst off, this beat bang\nAsk around, I'm the motherfuckin' man\nI'm about to drop ten racks on a chain\nAnd find a pretty bitch that I can dip with in the Range\nI'm good, I put that on the hood, I'm good\nI'm good, I put that on the hood, I'm good\nI'm good, I put that on the hood, I'm good\nI'm good, I put that on the hood, I'm good, nigga\n\n[Outro]\nI'm good on the I'm the shit!\nYG 400, bitch! I'm real!\nI don't dance, nigga 2 step\nNigga, trip then a shoot, nigga with the tech\nHey, motherfucker, don't you move\nWhat...nigga...moved?\nYeah, uh huh, that's what I thought, motherfucker\nMustard on the beat, ho!", "title": "I’m Good"}]}