{"artist": "Zaytoven", "songs": [{"year": "2018-05-25", "album": "Trap Holizay", "title": "Black Privilege", "image": "https://images.genius.com/639f704df9a5ed3b3439ea264d93bcf2.600x600x1.jpg", "lyrics": "[Intro: Trouble]\nZaytoven\nYeah, yeah, say round, what it like out there today, Skoob\n\n[Chorus: Trey Songz]\nWe got money, what we finna talk 'bout?\nWe got hundreds, what we finna talk about?\nKeep that money coming in so they can't count me out\nCount me out but money coming in\nBoy that clear, get in the lear\nSound like brrrtt, when I pull up\nOnly got one life that's for certain\nTryna stay humble I'ma work 'em\n\n[Verse 1: Trouble]\nDon't do no dumb shit, bitch I'ma have a car soon (yeah)\nI'm the type of nigga fuck up a court room (fuck all that)\nI'm the type of nigga nut up, don't play wit me (he crazy)\nI be bendin' your bitch butt up, occasionally (Skoob)\nPussy all up in his feelings, we fuck the same hoe (duck)\nBut we don't get the same dough, I'm in the same clothes\nFrom yesterday like fuck a nigga, fuck a hoe opinion (fuck 'em)\nDon't wanna have no conversation less it's Ms in it\nYeah, type, slide on a nigga, get right, I got a few of those hit like\nI'ma see what the hoe hit like (smash)\nAll type of shit bih needa get right (get right)\nAll your favorite rapper dislike (swear)\nProlly bought a bitch that nigga bitch like (yeah)\nTreat you like blood and get your real right\n\n[Chorus: Trey Songz]\nWe got money, what we finna talk 'bout?\nWe got hundreds, what we finna talk about\nKeep that money coming in so they can't count me out\nCount me out but money coming in\nBoy that clear, get in the lear\nSound like brrrtt, when I pull up\nOnly got one life that's for certain\nTryna stay humble, I'ma work 'em\nUntil then I'm flex for my niggas\nBut until then I'ma flex on these niggas\nUntil then I'ma flex wit my niggas\nBut until then I'ma fuck all these bitches\nYou clear, get in the lear\nSound like brrrt, when I pull up\nOnly got one life that's for certain (thank you God)\nTryna stay humble I'ma work 'em\n\n[Verse 2: Plies]\nI'ma ride in the Uber got the stick still on me\nI been countin' dirty money, got the scent still on me\nI like to beef a lil' different, I want ya bitch lil homie\nI'ma boss, you a worker, it don't mix lil' homie\nNow what it is lil' baby, I just wanna drop nun but dick in ya baby (yeah)\nNow how it feel lil' baby, my finger in ya mouth while I give it to ya baby (yeah)\nIon miss lil' baby, Draco on a hundred, I'ma hit some baby (yeah)\nI'm wit the shits lil' baby, duck tape ya ass like I'm Big Bank, baby (yeah)\nI wanna skeet up in ya right now (right now)\nBust it open for me right now (right now)\nTalk that shit fuck me right now (right now)\nWhen I beat ya from the back, bitch lights out (woo)\n\n[Chorus: Trey Songz]\nWe got money, what we finna talk 'bout?\nWe got hundreds, what we finna talk about?\nKeep that money coming in so they can't count me out\nCount me out but money coming in\nBoy that clear, get in the lear\nSound like brrrt, when I pull up\nOnly got one life that's for certain\nTryna stay humble, I'ma work 'em\nUntil then I'm flex for my niggas\nBut until then I'ma flex on these niggas\nUntil then I'ma flex wit my niggas\nBut until then I'ma fuck all these bitches\nYou clear, get in the lear\nSound like brrrt, when I pull up\nOnly got one life that's for certain\nTryna stay humble, I'ma work 'em\n\n[Bridge: Trey Songz]\nVVVV on my wrist, they hate to see me dippin' like this\nThey hate to see me livin' like this, all up on yo TV like this\nKissin' black queens on screens, that's a hot flex\nBaby poppin' vicodins, I feel like a Viking\nSpike Lee'll do the right thing, that's the swipe thing\nBut I got that cash flow and that's exciting\nNiggas been about it, dick ridin'\nFuck a nigga sister, main girl and his side thing\nI be in it till the cops come side me (fuck 12)\nBitches love me like Al Green, yeah\n\n[Outro: Trey Songz]\nWe got money, what we finna talk 'bout?\nWe got money, what we finna talk 'bout?\nWe got money, what we finna talk 'bout?\nWe got money, what we finna talk 'bout?"}]}