{"songs": [{"album": null, "image": "https://images.genius.com/6efed4f2f043ca2d708512a157481569.720x720x1.jpg", "year": null, "title": "Forever", "lyrics": "[Intro: Young Cash and T-Pain]\nLeon County nigga!\n(Okay, yeah!)\nDuval County, nigga!\n(Okay, yeah!)\nLet's go!\n(Pizzle, yeah!)\nYoung Cash!\n(Nappy Boooooooooy!)\nWhat you wanna do, Pain?\nYou wanna rap, nigga?\nYou wanna sing, nigga?\nWe do it all, shit!\n(Hey you can take the auto-tune off)\n(I'mma just, I'mma do it like this)\n(Okay, let's go)\nC'mon!\n\n[Verse 1: T-Pain]\nLast name, Pizzle\nFirst name, Teddy\nDistributin' that R&B 'caine like Eddie\nDue to all these motherfuckers hatin' so heavy\nI done got enough bread to buy twenty more Chevies\nAll these bitches wanna suck my stick, Chick-O\nSaid I got the game wrapped up, burrito\nNiggas hatin', I'll forget about it, Guido\nAll you do is call 9-1-1, Reno\nI'd appreciate it if you didn't fuck with me\nCause I don't fuck with rats and yo' hood is a Chuck E. Cheese\nCatch that bitch in that car suckin' these\nAll the seats down cause she still on her fuckin' knees\nYeah, so you wanna hate on me on Twitter, right?\nY'all niggas is internet G's like a gigabyte\nCause @YoungCash'll get up on that kryptonite\nMapQuest your address and run up in your shit tonight\nBitch, alright?\n\n[Hook: T-Pain]\nIt may not mean nothin' to y'all\nBut ain't nobody writin' the songs for me\nThey hatin' cause I'm doin' it all\nI can do this shit forever man (ever man, ever man)\nAnd I ain't hesitatin' at all\nCause I got niggas totin' the gun for me\nAnd we can do whatever we want\nI can do this shit forever man (ever man, ever man)\n(Ever man, ever man)\n(Shit, e-e-e-e-e-e-e-ever man, ever man)\n\n[Verse 2: Young Cash]\nLast name, Galaxy\nFirst name, Joey\nRun up on a gansta, pussy nigga, you don't know me\nCall cash a virgin, I never get fucked, boy\nFire on deck and another in the trunk, boy\nDead Presidents in my pocket (plenty)\nGot goons in Georgia and all (?)\nGuns imported straight from Zamunda (City)\nWe party, party, party, get wasted (Rémy)\nAct like you don't know and I will make you a believer\nMy mama said my daddy was a G, and I believe her\nBoth of y'all dogs like a golden retriever\nYou see the apple don't fall far from the tree, bro\nLife, can't complain, but I might go to prison\nPain say he got me, dog, so really I ain't trippin'\nOnly thing I'm missin' is the money and the women\nAnd still I'mma find a way to fuck me some bitches\nJ, snitches\n\n[Hook]\nIt may not mean nothin' to y'all\nBut ain't nobody writin' the songs for me\nThey hatin' cause I'm doin' it all\nI can do this shit forever man (ever man, ever man)\nAnd I ain't hesitatin' at all\nCause I got niggas totin' the gun for me\nAnd we can do whatever we want\nI can do this shit forever man (ever man, ever man)\n(Ever man, ever man)\n(Shit, e-e-e-e-e-e-e-ever man, ever man)\n\n[Verse 3]\n{Alternating between T-Pain and Young Cash every two bars, starting with Young Cash}\n\nCash in the vert, Pain in the Bugatti\n15's in the bike kickin' like karate\n\nPussies get wet every time I say \"shawty\"\nChevy tall like a flyin' carpet, Teddy Abu Dhabi\n\nLouis on my feet, Kanye West's\nAim for the head, boy, no need for the vests\n\nTeddy protein, bitch, put it in yo' breakfast\nI'm fly as fuck like I was related to the Jetsons\n\n(?), who wanna ride with me?\nNine in my Levis, skinny jeans won't fit me\n\nEveryday my birthday, this young nigga gifted\nSeven-figure nigga still reppin' 850\n\nNow I'm at the mall, no money, don't trip\nPain got a car the color Whoopie Goldberg's lips\n\nPlus I got a gun the color of yo' girlfriend tongue-ring\nThey be like, \"Them Nappy Boy niggas is on something, this shit bumping\"\n\n[Hook]"}], "artist": "T-Pain"}