{"songs": [{"image": "https://images.genius.com/d51e86578df25f696ad430beed4f0415.500x500x1.jpg", "year": "2008-11-01", "title": "Funeral Of The Tape Deck", "album": "40 Days & 40 Nights", "lyrics": "[XV talking]\nPrimo!\nYou know I was thinking it would've been real dope if I could've just recorded this on like a dual cassette recorder. But then I was thinking, damn I can't upload it. But it's cool, I'll keep it simple though. like two track or whatever. Yeah, ya know. With Donny Goines in here. Yeeerdig?\n\n[Verse One] [XV]:\nI got my Skee-Lo single\nMy Nike box of tapes\nAa couple of new originals and De La Soul's Stakes\nIs High, and Ryan borrowed my Black On Both Sides\nWhile I'm dubbing the color and the shape\nIn the mix come on at 8:00\nIndex finger on that record button\nGrandma got me a dual deck to record something\nBlew the dust up off it, hit pause on playing tunes\nSold my bike to my neighbor, lock myself into the room\nTold all of my dudes, got my demo coming soon\nI even drew the cover\nResurrect the tape deck, man I Used To Love H.E.R\nShe was like safe sex\nIt went out around the year 2000\nI'm down for the future, that's what I do now\nBut what they did, the flame to our soul blew out\nNow everything is fusible and digital is doable\nSo please bow your heads at the tape decks funeral\n\n[Hook]:\nThe funeral of the tape deck\nThe funeral of the tape deck\nThe funeral of the tape deck\nThe funeral of the tape deck\n\n[Verse Two] [Donny Goines]:\nThe funeral of the tape deck\nMy eulogy, musically just describes how I'm missing the way it used to be\nAnd even though all the CD players ain't new to me\nUsually I just reminisce of moments old school to me\nBlank cassette in my tape deck\nRecording them break sets\nI couldn't wait to hear what they played next\nWhen I was breaking my curfew, the tape it was purple\nWay before they started playing commercials\nA lost era in time\nBack when there was rewind\nI must admit I was a fan at the time\nBut things change and it's evident that that era has died\nNow irrelevant, my sentiments I'm sharing with pride\nBecause the generation now can't see what I visualize\nWhen it all epitomized the music all criticized\nAnd now the culture of hip hop is minimized\nMay it now rest in peace\nWhy my nigga died?\n\n[Hook]:\nThe funeral of the tape deck\nThe funeral of the tape deck\nThe funeral of the tape deck\nThe funeral of the tape deck\n\n[Outro] [Donny Goines]:\nI remember playing my tape so much those motherfuckers would pop. Walking down the block to get that new Clue, that new Ron G. Y'all too young for that, y'all don't know about that. Man what up? XV. You already know. Donny Goines"}], "artist": "XV"}