{"songs": [{"year": null, "album": "Country, God or the Girl", "image": "https://images.genius.com/25be4916da9d0866a1607ed641fb8753.220x220x1.jpg", "title": "Coming to America", "lyrics": "[Verse 1]\nI came out of a killer, neighbourhood called \"River\"\nWhere life expectancy is shorter than a caterpillar\nI was once a gorilla, Mogadishu was my cage\nMy trainer was the gauge, AK was my baby sitter\nWhen we be out and looting, the whole city was shooting\nI know it's fucked up, but somehow this song became soothing\nNiggas heard African rapper and thought about Umfufu\nYou Superman 'till the real soldier boy come to shoot you\nSexual intercourse wit your ear nigga\nFuck what you heard, yeah nigga\nCome walk in the dark no fear nigga\nIt's a dry in my eyes no tear nigga\nWord to malaria, your hood can't really compare here\nGot cheese? They really love dairy uh\nCome near here, I'm daring ya\nI shit you not, ain't afraid life gave me a rotten lemonade\nBlew up my school in the 8th grade while playing catch with a hand grenade\nYup, that's a true story. This ain't Hollywood glory\nI ain't the prince of Zamunda dog, my life is too gory\n\n[Hook]\nI'm tired of always going to burials\nI just wanna live a good life\nSo I'm coming, coming to America\nI hope we gonna have a good time\nBaby thanks for letting me marry ya\nThe green card sure looks fine\nSo I'm coming, coming to America\nI hope we gonna have a good time\n\n[Verse 2]\nNow my second home city, what can I say\nIt took my fucking heart from me\nI played the judge, pardon it from larceny\nOh yeah, that mean it never got no bars from me\nT-dot O to the motherfucking dot B\nIn the Rexdale project lobby\nPuck Puck but it ain't no hockey\nWhen the cops came, they knocked me, they got me\nI had to flee. They said to bargain, I had to plea\nSo I crossed the border while they put a warrant out for me\nWhich means they never got no bars from me\n\n[Hook]\n\n[Verse 3]\nNow I know, everywhere in the world, got its problems\nEverybody got a dream of the green, it's the dollars\nBut some of us are dying in the streets, Can you figure out?\nEven in America, the hoods need a ticket out\n\n[Hook]"}], "artist": "K’naan"}