{"artist": "Post Malone", "songs": [{"album": null, "title": "Easier", "image": "https://images.genius.com/fc7e20f4fe2f7dd19a877bb5cb1677bc.937x937x1.jpg", "lyrics": "[Chorus]\nDo things ever get easier?\nSome fall hard, so fast, freeze it, yeah\nSold my bands off it, but champagne sip through\nDo things ever get easier?\n\n[Verse 1]\nCountin' up bands, and so my neck froze\nRunnin' outside and cop a mafro\nRollie on now we're back and now my neck froze\nRunnin' outside, I'm another one\nWas he all up in it, count another one\nWas he in the pussy and am I on?\nHere's enough money, let's ball\nHere's enough money, let me throw\nDrive a Rolls Royce Wraith, that's my everyday\nAnd the money, it falls, then we come away\nThere's some money now, sippin' on my ice, ayy\nThere's some money and you might just get your ass kicked, but\n\n[Chorus]\nDo things ever get easier?\nSome fall hard, so fast, freeze it, yeah\nSold my bands off it, but champagne sip through\nDo things ever get easier?\n\n[Verse 2]\nDiamonds on me water like they know the call\nAnd I want a 40 and you know the call\nIt's some in a 40 and you know the call\nIt's a money 40, that's the protocol\nAnd oh, woah, girl it shouldn't make sense\nSince I got my own 40-automatic\nAnd oh, woah, girl, it shouldn't make sense\nSend the money with the 40 on the side\nYeah, ayy, let me know, tell me how she go\nPut it on my bands and the 20 on my truck\nDon't slow me up, baby, slow me up\nDiamonds on my bed, she can see them on me matter\nYou wanna run up on me, but it still ain't happen\nWas somewhere on her body, and she's still a mack\nHe's a run up on me, but it still ain't happen\nI remember back in Stoney and I'm in a mansion\n\n[Chorus]\nDo things ever get easier?\nSome fall hard, so fast, freeze it, yeah\nSold my bands off it, but champagne sip through\nDo things ever get easier?\n\n[Bridge]\nBall out my fatty, she call me daddy\nSee mama fatty, she pop them Xannies\nI don't want nothin', see mama fatty\nIt's on my doney and on my baby\nI don't want no-one, want another one\nPistol and her pussy help me though\nI don't want no-one, that's the one I want\nI don't want no pussy, let me go\n\n[Chorus]\nDo things ever get easier?\nSome fall hard, so fast, freeze it, yeah\nSold my bands off it, but champagne sip through\nDo things ever get easier?", "year": null}]}