{"songs": [{"album": "Forest Hills Drive: Live from Fayetteville, NC", "year": "2016-01-26", "title": "Apparently (Live)", "image": "https://images.genius.com/6affcd514d0bc308d7761e9589cd9abc.1000x1000x1.jpg", "lyrics": "[Intro]\nSing, oh right, oh\nOh why na-da-da-da\n\n[Chorus]\nI keep my head high\nI got my wings to carry me\nI don't know freedom\nI want my dreams to rescue me\nI keep my faith strong\nI ask the Lord to follow me\nI've been unfaithful\nI don't know why you call on me\n\n[Verse 1]\nThis is my canvas, sing!\nI'ma paint it how I want it baby, oh I\nThis is my canvas\nI'ma paint it, paint it, paint it, how I want it nigga\nFuck you cause there, there is no right or wrong, only a song\nI like to write alone, be in my zone\nThink back to Forest Hills, no perfect home\nBut, but the only thing like home I've ever known\nUntil they snatched it from my mama\nAnd foreclosed her on the loan\nI'm so sorry that I left you there to deal with that alone\nI was up in New York City chasing panties, getting dome\nHad no clue what you was going through\nHow could you be so strong?\nAnd how could I be so selfish, I know I can be so selfish\nI could tell by how I treat you with my girl, damn she so selfless\nBut she put up with my ways 'cause she loves me like you do\nAnd though it don't always show I love her just like I love you\nAnd I need to treat you better\nWish you could live forever\nSo we could spend more time together\nI love you mama, go!\n\n[Chorus]\nI keep my head high\nI got my wings to carry me\nI don't know freedom\nI want my dreams to rescue me\nI keep my faith strong\nI ask the Lord to follow me\nI've been unfaithful\nI don't know why you call on me\n\n[Post-Chorus]\nE-e-eee, e-e, apparently\nYou believe in me, you believe in me\nE-e-eee, e-e, apparently\nYou believe in me, and I thank you for it, oh I\n\n[Verse 2]\nAnother day, another rhyme, ho\nAnother day, another time zone\nToday, I woke up feeling horny so it's only right\nI got two bitches playing on my trombone\nKeep up, never sure where the words would take me\nNiggas eat em up, and regurgitate me\nShit trump tight never slurred it lazy\nGive a virgin the urge to rape me, nigga please\nBest friends really make great frenemies\nMy watch came, niggas can't wait for one of these\nI see you nigga, this ain't no Rolex, it's a AP nigga\nI'm hot, dog, catch up to me nigga—uh, couldn't resist\nAim for the stars and I shouldn't have missed\nBut I was riding on fumes so I stopped by the moon\nNow I'm sitting on the hood of this bitch\nLike, \"Thanks for the view\", waiting on thanks from a few\n'Cause without me you wouldn't exist\nYou know that shit, gave you the blueprint, don't forget\nCole is your phone on zero percent\nGoing off, now niggas showing off\nNiggas swear they hard but they flowing soft\nI'm taking off like \"boing!\" on a big ass Boeing\nGetting head like a coin toss, too easy\n\n[Chorus]\nI keep my head high\nI got my wings to carry me\nI don't know freedom\nI want my dreams to rescue me\nI keep my faith strong\nI ask the Lord to follow me\nI've been unfaithful\nI don't know why you call on me\n\n[Post-Chorus]\nE-e-eee, e-e, apparently\nYou believe in me, you believe in me\nE-e-eee, e-e, apparently\nYou believe in me, and I thank you for it, oh I\n\n[Breakdown]\n\n[Outro]\nFayetteville I need y'all to make some motherfuckin' noise one time\nTonight, goddamn it for your motherfuckin' selves"}], "artist": "J. Cole"}