{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": "2013-04-30", "lyrics": "[Verse 1: R.A. The Rugged Man]\nAyo, ladies love Rugged, I'm a casanova\nAnd once I make love to you, baby, it's all over\nYour boyfriend beat you up, call me if you need some loving\nOr if he's corny in the bed and you just need a good fucking\nI'm living every man's dream, I'm in my mid 30's\nAnd I'm strictly fucking bitches that are barely 18\nIn bed women say ''oh, he's clever''\nWhen I'm dead chicks will probably miss me more than the late Heath Ledger\nYeah, they love me long time, it's like it's '89\nAnd I'm Christopher Williams and Al B. Sure! combined\nAnd I'll never leave 'em, man-eater, dammit, I need her, she a diva\nLend her the visa to feed her, please her, I'm eager to ease her\nTurn on your radio, chica chica, I know my voice turn you on\nTake off your panties, make love to the speaker, come on\n\n[Chorus: Eamon]\nYou know I love to fuck, tearing up that butt\nThey always make me feel at home\nNever leaving me alone, never leaving me alone\nI swear they love the dick, drip, drip\nThey don't forget my balls\nThey often long to bring me home\nNever leaving me alone, never leaving me alone\n\n[Verse 2: R.A. The Rugged Man]\nAyo, figured the way to get paid is to grab the mic rehearse, you know\nSmooth as Jermaine, so baby, don't take it personal\nSay I'm arrogant and cocky, wha, who me?\nKissing on your neck, woman, you can't refuse me\nI got a crush on that big bitch Missy Elliott\nAfter I fuck Missy maybe she can write me a hit\nYour man repeatedly cheating, I'm treating you decent, we meeting\nI'm leaving you screaming, fiending, reaching, you making your weekend\nCall me Mandingo Kenny Norton\nIt's true I'm the ugliest dude getting pussy since Billy Bob Thornton\nYou need drugs, I can get 'em a little coke for your nose\nIn the clubs that's how you get models to take off clothes\nIn high school I was the type always beating up teachers\nAnd getting head from the cheerleaders under the bleachers\nSmoother than Jeffrey Osborne, more buttery than popcorn\nBeautiful women all over the globe keeping my cock warm\nSo don't be jealous that you're stuck home with a bunch of kids\nAnd a fat wife, yeah, you wished you lived my life\n\n[Chorus: Eamon]\nYou know I love to fuck, tearing up that butt\nThey always make me feel at home\nNever leaving me alone, never leaving me alone\nI swear they love the dick, drip, drip\nThey don't forget my balls\nThey often long to bring me home\nNever leaving me alone, never leaving me alone\n\n[Verse 3: R.A. The Rugged Man]\nWomen can't handle my voice, it's so sexy and smooth\nAll I gotta do is talk and bitches get in the mood\nYou're the best at dicksucking, here's some mouthwash\nClean your mouth before you go home and start kissing your husband\nYou're insecure, you feel low? I'll give you some attention\nYou need a confidence booster, a little love and affection\nGirl, you look good enough to eat, so sweet and petite\nI'll take your shoes and socks off and I'll suck on your feet\nAnd lick your ankles and your knees and your thighs and uh\nSlowly making my way, I'mma make you cum all day\nAfter the sex it make me nervous how these bitches be acting\nThey on some rabbit in a pot shit like Fatal Attraction, I'm back\n\n[Verse 4: Eamon]\nFilthy’s my friend, sex is the term\nDifference with them, face full of sperm\nOnce I was blind, but now I see\nThese ladies want me more than I believed\nAnd I love how they love everything I’m about\nPoking that ass, bust through that mouth\nAfter we cuddle and kiss through the night\nMwamwamwamwamwamwa\n\n[Chorus: Eamon]\nYou know I love to fuck, tearing up that butt\nThey always make me feel at home\nNever leaving me alone, never leaving me alone\nI swear they love the dick, drip, drip\nThey don't forget my balls\nThey often long to bring me home\nNever leaving me alone, never leaving me alone", "title": "Luv to Fuk", "image": "https://images.genius.com/c839ae29cd32413eb20a1c6585d7d604.1000x1000x1.jpg"}]}