{"artist": "Vado", "songs": [{"title": "Same Bitch", "year": "2019-03-05", "lyrics": "[Verse 1: Vado and Dave East]\nI caught her leaving the hodgy spot\nLookin cold, but body hot\nIf we talkin bad, she got it, huh\nShit, you probably know her, you probably popped\nShe gave me head in my Karali socks\nWay too much teeth, she kept bitin down, didn't know she Maly popped\nA private stock, I heard she with it, dirty kitchen\nThat bitch like a big Vado fan, Dave East not as hot\nBro, you gotta stop\nImma just fuck her, fuck it, I got the not\nPlus, the shootin on the nuggit supposedly got her locked\nI ain't goin hard for that bustin, just want the sloppy top\nGood lookin, that's how we gotta rock\n\n[Chorus: Dave East and Vado]\nI'm with that same bitch, on Instagram she show out\nEvery night, she go out\nBaby father broke out\nGot no bout\nThat same bitch you see drippin, get thirsty\nAll she want was a far series, apartment and jerzy\nLike Usher and R. Kelly, V, I think we caught the same bitch\n\n[Verse 2: Dave East and Vado]\nLA trips, tummy tuck, her ass real, but got fake tits\nHad me in the Matrix, tryed to text, that bitch basic\nCause basicly, we her favorite\nBody shaking, and I ain't even have to stab it or taiste it\nLike, once I grab it, I break it\nI'm known to bag it and rape it\nGot her all in her feelings, she started askin for David\nI kicked her ass with some Masing\nRemembering when that bitch left\nShe rockin with nothin but Dipset\nI'm just stairin, while I get neck\nThen lift her head up, like, \"play my shit next\"\nDamb, why you lie, boo?\nYou told me you loved Slime Floo\nRemember shoe shoppin, you copped the Shanells that were blue\nRemember I got tight,cause they ain't have 'm in my size, two\nI got cash, she love it when I pull her hair, smack her ass\nI let you go, I let you go\nNiggas tryed to cuff like Alcatraz, knew you since you was bummy\nPussy was good, but your outfit trash\nNow I just see your mouth and laugh\nLook at that nigga without his cash\nRed bottom swag, no bag, but you let Vado smash\n\n[Chorus: Dave East and Vado]\nI'm with that same bitch, on Instagram she show out\nEvery night, she go out\nBaby father broke out\nGot no bout\nThat same bitch you see drippin, get thirsty\nAll she want was a far series, apartment and jerzy\nLike Usher and R. Kelly, V, I think we caught the same bitch", "album": "V-Day 3", "image": "https://images.genius.com/2d689569ebbbfed99199448113efb2ad.750x750x1.jpg"}]}