{"artist": "Benzino", "songs": [{"lyrics": "[Benzino talking softly]\nNiggas wanna try and live my life and\nBitches wanna try and run my life and (As we proceed!)\nHaters wanna try and take my life and (ha, Benzino)\nGod...\n\n[Hook]\nNiggas wanna try and live my life and\nBitches wanna try and run my life and\nHaters wanna try and take my life and\nGod! Do you really want my life then?\n\n[Benzino]\nDot hit me with the track, Diddy keep it gangsta\nWhen in the city, crime scene, no answer\nWho's Benzino? Who the fuck's Benzino?\nMatta-fact, get'cha facts straight (Say whaaat?!)\nNino Brown without the high fate\nO-Dog without the O, Nigga you don't know?\nSonny Coleon, Godfather get loose\nBulletproof, made it through the toll booth\nI don't know if you niggas want the whole truth\nStay strapped even in the vocal booth\nRob report, page 3-5-7\nRay hang 'em high, details at eleven\n\n[Hook] 2x\n\n[Benzino]\nDo you really wanna hold spots down, home town Bost-town\nVictim of 'stance, we dance with four pound\nSpit thug sound, y'all know how thugs sound\nCan't touch clowns, slow slugs down\nO.G.'s raised me, baby G's praise me\nSince I'm a G, rep 3 'til I'm swazy\nY'all cats fugazi, my shit's crazy\nNiggas can't faze me (You can't take) what God gave me\nGame stayed on top of - Fame played a part of\nChange, made a lot of - Flame in the hearts of\nMen I'm a Made one - Friends, I don't need none\nPlay it by the rules, took some, left some\nOnce was behind bars, now I'm a All Star\nI'm florid idol, takin all titles\nWhole family 'spect it, whole fam connected\nFuck off the hook, my shit's disconnected\n\n[Benzino softly speaking Hook]\n\n[P. Diddy over Benzino]\nOh, see this is the shit I'm talkin 'bout\n'Stead of a nigga doin him, he tryna do me\nAnd stop me from doin me, feel me?\n\n[Benzino]\nStress got me smokin blunts like they're cigarettes\nDon't forget, nickel nine leave you soakin wet\nNegotiate deals via cellphone\nDo shows outta town, bring dollars home\nSpread love throughout my hood, my hood love me\nLemme give you some advice, don't never trust me\nYou gonna pay the price if you ever fuck me\nIt's like rollin dice, if you try an' duck me\nWho's Benzino? Know the whole world know\nPeople always scared of shit that they don't know\nDispite the facts, still here, of course\nFuck \"Five Mics\" motherfucker, I'm The Source\n\n[Hook] 3x\n\n[Benzino talking (P. Diddy)]\nYeah, now what, (what) now what'chu sayin now (Yea)\nHuh? You don't really wanna\nHow you feelin about this now?\nHuh, Huh? (As we proceed!)\nWhat'chu got to say about this? Huh?\nYou got somethin to say, about everything else\nWhat'chu got to say about this right here? (What'chu got to say?)\nHuh? You can't say shit about this!\nHuh? You just gotta keep your fuckin mouth shut!!\n\n[P. Diddy talking]\nYou need to stop doin me, and do you - you feel me?\nIt's a simple thought, haha\nSometimes you have your mind so preoccupied on a motherfucker\nYou can't even wake your ass up\nYou too busy dreamin about me!\nYou motherfucker! I don't even know why I'm talkin to your punk-\nYa, ahhh, it's some fuckin sissy shit even talkin about this, ahh!", "image": "https://images.genius.com/ab64bde2620df28863f2c6355a1da426.600x600x1.jpg", "year": null, "title": "Who is Benzino?", "album": "The Benzino Project"}]}