{"artist": "Waka Flocka Flame", "songs": [{"year": null, "lyrics": "[Chorus：Gucci Mane]\nThese girls they be choosing\nDiamond be so sparkly they think my chain was moving\n\n[Verse 1：Just Rich Gates]\nNo id who the hell is that? Them chicks pointing that its me\nMe who Just Rich fresh up in a ralph lauren hat\nATL,South Cakk holla back we on the map this for the fly boys\nD boys hit the club then hit the trap\nI’m rocking polo your rocking gap\nI’m smoking kush your smoking bap HA HAAAAAAA!\nYour a lame lamb\nYou look shock I’m throwing stacks like I don’t give a Jean Claude Van Damn why???\nBecause bo I’m paid in full like Ricco oops I met Alpo my chain and my ring\nYea it got that mec glow lights off i’m shining like the po po them chicks on my joc\nThey love my aura swagg cowabunga on you hoes\nI’m so rad i’m so radd HA!\n\n[Chorus：Gucci Mane]\nThese girls they be choosing\nDiamond be so sparkly they think my chain was moving\n\n[Verse 2：Waka Flocka Flame]\nFlocka! You catch me in the club drinking bubbly\nTwo stepping with Lauren London\nOr too deep in Vip Flocka and Alicia Keys (popping bottles smoking kush)\nOr hanging on the block with Gs we rocking with them keys (Flocka)\nAnd 09 is our year with the whole So Icey fam\nHold on homie show me homie please stop all that flexing homie\nRob homie sorry homie not Waka Flocka homie\nSucking tities like a baby Waka Flocka you so crazy\nKnow my motto fuck you pay me\n4 Deakin rings on like its the 80s\nOne night that bitch love the excitement\n45 with me thats my hype man\nI’m foured up screwed up thats my right hand\nRolling another bean shawty can’t stop biting my neck\nPiece raining its like lighting Waka Flocka Fenna call that shit frighting\nWaka so flexin , say I’m high like the Jetson\nRoll another pill i’m not flexing\n\nChorus：Gucci Mane\nThese girls they be choosing\nDiamond be so sparkly they think my chain was moving\n\n[Verse 3：G.E. Da Pilot]\nGE, JCE, campaign whoah man\nGoons gooning out going Conan\n803 this S.C! JCE, 15 South what I’m bout shut your mouth shut it up\nOr we gonna shut it down I’m the one I’m a show em how its done\nGot ice like a blizzard lick that pussy like a lizard\nShe “ooohin” she choosing\nLook I don’t want that hoe\nI want a dime piece looking like a Ashanti\nDiamond look like what the coast is clear\nShine like car head lights yall looking like a deer\nMy flow stupid ,say I’m dumbing out\nKeep it bengie we so rad aura up aura up\nIn the club feeling like a spaceship\nOn the moon on some spaceship call me Mr. Spacely\nSprockets bout to blast off like a rocket automatic we so galactic", "image": "https://images.genius.com/2c0ce44440f772f4cebdfb4d0195df8e.836x836x1.jpg", "album": null, "title": "Dey Be Choosin"}]}