{"artist": "ILL BILL", "songs": [{"title": "Impaled Nazarene", "lyrics": "[Intro]\nYou have seen, you cannot deny it any longer\n\n[Verse 1: Vinnie Paz]\nWalt Disney was fuckin' Nazi, Illuminati killed Mike Jackson\nBarack Obama aware of all their precise action\nLook at the dollar bill, they want the fuckin' light blackened\nY’all too stupid and blind to see what might happen\nThe symbolism from beginning of recorded times\nAnd Hinduism and the spinning of distorted minds\nYou believe it when the television report the crime\nWell I believe that that’s irrelevant and falsified\nWhere was Jesus in the Bible for seventeen years?\nHe was in Tibet and India and they were his peers\nHe also lived in the Himalayas and Kashmir\nHe survived the crucifixion and lived for mad years\nThey like the idea of war between Arab and Jew\nThey like the idea of slaughter and massacre too\nKnowledge is infinite, it’s something you have to pursue\nI pray to God on the Shabbat for a pacifist coup\n[Interlude]\nTo most people who would consider themselves intelligent beings they say well that’s absurd. What’s all this doomsday stuff?\n\n[Verse 2: Ill Bill]\nBorn in the Sudan, raised in America\nAged seven in a new land, raised by the Seraphim\nLearned Islam and Mitzrayim, amongst the pyramids dragged by em\nFrom the Nile River later reminisced and drank wine\nReturn to childhood and crime\nDid an upstate bid for three years, out on parole, now the world is mine\nCreated his own movement in ‘69\nNubian Hebrew Mission had arrived, he’s alive\nChanged his name to Isa Abdullah\nMany times after that legally changed his name several times\nLevel nine, Jackie and The Starlights, made music with passion\nRolls-Royce elegant fashion ready for action\nDescendant of aliens from another planet\nThey said Christ was underhanded\nLike King Solomon with many wives\nUnder marriage many seeds many heirs to the throne\nReady to die and forever it’s told\nSimilar to this eleven year old\nAfter being gang-raped at eight memorized the testament scrolls\nFront to back he recited the Bible, word for holy word\nPassion of the Christ on arrival\nThe Branch Davidians took him in then he took em over\nClaiming the name of David from the book of Jehova\nYou’d have thought that he’s from Brooklyn how he had it all sewn up\nTill the ATF had him blown up out in Waco\n[Outro: David Koresh]\nSo you know you guys, do it your way, I do it my way. You gonna argue with me, you catch me on the side of the road somewhere, you come and argue with me. You come pointing guns in the direction of my wife, my kids, damn it I’ll meet you at the door any time. And I’m sorry some of you guys got shot but uh hey, God will have to sort that out, won’t he?", "image": "https://s3.amazonaws.com/rapgenius/avatars/medium/1358290971_142823__MG_9884-Edit%20square.jpg", "album": null, "year": null}]}