{"songs": [{"album": "Eardrum", "image": "https://images.genius.com/36dc52e92a9d27102149cf08b1a7f326.936x936x1.jpg", "year": "2007-08-21", "title": "Hush", "lyrics": "[Verse 1: Talib Kweli]\nAction and words dripping off the tongue\nSomething like the flash of a [?]\nThe glass half empty, let me pour you some\nThe glass half full cause there's more to come\nJammin' on the 1, ja-jammin' on the 1\nTake a deep breath now expand your longues\nThe breath is the life and it just begun\nI thank God for the morning, so, now look here girl\nWhere you goin'? Come here girl, let me holla holla holla at ya\nYeah, and thrown a couple dollars at you, c'mon\nI get paid baby doll I'm a star\nYou can tell by the make and the model of my car\nThat's the game these young niggas kicking\nDumb niggas tricking but some niggas listen, look\nAll that whack shit they spillin' in yo' ear\nI don't need none of that, you just feel it in the air\n\n[Chorus: Jean Grae]\nHush - Cause you're sounding like a lullaby\nYou're making me tired, so\nHush - Ya' damn game is so weak\nIt's putting me to sleep, please\nHush - Haven't we heard it all before?\nDamn from all of y'all, so\nHush - A motherfucker can only take so much\nI wish that you'd just hush\n\n[Verse 2: Talib Kweli]\nThey say it's all about your market and the best way\nTo reach the audience is to target and to profit from\nYou know I'm used to reach a higher form of consciousness\nThat still inspire dancers that's working for $20 tips\nRappers ain't pimps bruh, they acting like chimps\nNah, King Kong ain't got shit on me like Denzel Washington\nA marijuana cocktail is the drawl mixed with the chocolate\nBubbling like bong hits from white kids at college and\nYou about to knowledge the strength of street knowledge kid\nThe fact is [?] spit for everything I gotta get\nYou ain't gonna like it if you got problems well honest shit\nI don't like to break my promises so I don't fuck with politics\nThe classes [?] cause I ain't had no scholarship\nNow I come to speak, they give me honorary doctorates\nCould it possibly be that I got a degree at rocking this?\nStop it all, born and prosper like Dr. Spock with it\n\n[Chorus: Jean Grae]\nHush - Cause you're sounding like a lullaby\nYou're making me tired, so\nHush - Ya' damn game is so weak\nIt's putting me to sleep, please\nHush - Haven't we heard it all before?\nDamn from all of y'all, so\nHush - A motherfucker can only take so much\nI wish that you'd just hush\n\n[Verse 3: Talib Kweli]\nCorporate thugs selling whores and drugs\nAll up in the clubs get to fall in love\nAddicted to the life, high off the buzz\nHere now there ain't no ignorin' us\nRawkus, you feel it in the [?] and [?]\n[?] pass the [?] like pass the [?]\nTouching it with words cause a master did\nAnd plus, I ain't on the grabbing shit, it's like this, word\nIn this life every [?]'ll find the right type\nIn the mix like Jack and Coke with limelight\nFunny how we do wrong things to get the mind right\nVision blurry now but it's 20/20 in hindsight\nI don't make the singalong shit, get the rhymes right\nI'm nice, I'm sharper than any barber that get the line right\nIt's in the bag and I'm tagging em, getting markers\nIt's the shit starter on the hit artists like Chris Parker nigga\n\n[Chorus: Jean Grae]\nHush - Cause you're sounding like a lullaby\nYou're making me tired, so\nHush - Ya' damn game is so weak\nIt's putting me to sleep, please\nHush - Haven't we heard it all before?\nDamn from all of y'all, so\nHush - A motherfucker can only take so much\nI wish that you'd just hush"}], "artist": "Talib Kweli"}