{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "[Intro - Cyssero (Ya Boy)]\nAye yo, aye yo\nAye yo, tell niggas to move the fuck over, (Yeah) get the fuck on\nI'm in the buildin', Ya Boy (Ya Boy) in the buildin'\nI'm fuckin' fiiya, you fucka (Cyssero the Virus)\nLet's ride the fuck out nigga (Haha)\nWhat?! Haaa!!\n\n[Verse 1 - Ya Boy]\nYou betta' ask around, (Chyea!) my niggas packin' pounds\nI used to play with water guns, now I'm packin' ratchets pal (Brraatt!)\nWe keep Heat, you would think Wade and Shaq in town\n.357 big enough to knock back a cow (Brrraatt!)\nYa' claim to be the best, and I'm askin' how?\nYa Boy done hooked up with The Virus, call me West Nile (Chyea!)\nCall the sirens, shells flyin', hope your vest around\nShots fired (Fiiyyed), leave 'em paralyzed from the necklace down (Unh!)\nI'm talkin' reckless now, hit the booth and wreck it down (Yeah!)\nAlways made stacks, instead of crack I'm sellin' records now (Unhh!)\nI eat beef like a double decker Checkers burger (Yup!)\nI ain't scared to do a murda', I'ma weapon squirta' (Yeah!)\nI'll let the weapon squirt ya' (Yeah!), wet ya' like the effin' surfa'\nAnd we keep work, hope you nerds is good lesson learners (Get 'em!)\nTwo niggas, four burnas' like a stove top\nAim tha fif' and leave the sucka' stiff like a Blow Pop\nCock and dump, pop the trunk, stuff 'im like stove top (Chyea!)\nRolled around for two weeks and got tha Range Rove' hot (Haa!)\nI'm like Moses, how dem O's part\nMake the coke, go hard on the back of the bus like Rosa Parks (Chyea!)\nConduct keys like Mozart (Chyea!)\nWhen the fo's spark, ya' betta' be on tha lookout like a coast guard (Chyea!)\nBe quiet or we'll shoot ya' (Brraatt!)\nHave ya' hooked up to mo' wires than the back of a computer, bitch!\n\n[Cyssero talkin']\nYa Boy! Yeah!\nIt's my turn now, man (Aaaaahhh!)\nCyssero the mothafuckin' virus (Ay Ya Boy, I gotchu nigga!)\nWe takin' shit the fuck over\nI don't give a fuck about none of that veteran shit, none of that nigga (Bay Area stand up!)\nYou wann' see me nigga? (Yuh!) Then walk nigga, walk!\n\n[Verse 2: Cyssero]\nChyea!\nMovin' thru tha hood wit tha choppa on deck (Deck!)\nPounds of dat skunk burryed down in tha trunk (Trunk!)\nRed-fitted, white-T, over tha brim\nHighly-intoxicated from tha doja and gin\nRidin' like tha rolla-coasta, holdin' toasta wit him\nHollow-point, two 2-3's, loaded in a min\nSomethin' used wit wit tha scope so I can focus it in\nHit his head and dissapear, hocus-pokus wit him (Yeah!)\nI'm from tha hood where they give rock to go to tha penn'\nTha grave where a lot of em go, but jail is where most of dem been\nIt's so damn pathetic, I'm coppin' hammer after hammer\nGotta hammer fetish, beef - I'll let tha hammer get it\nIf you talkin' - I'm sparkin', him and his mayne a get it (Brraatt!)\nA head shot, numb his body like a anastetic\nI got, money on my mind and got plans to get it (Chyea!)\nBrain stormin' in a 'coupe, smokin' grams of relish\nHardest nigga out, ask - tha fans'll tell ya (Chyea!)\nI'm tha shit (Smell It!), even ya gurl can smell it (Hahaha)\nI'm mach 5 movin' - I am not human\nI'm alreadi been chosen, you can stop choosin'\nYes! I'm tha most cleaverly experienced, line-fo'-line lyricst\nPoint blank, period!!\nListin when you're hearin' it, mayne im somethin' serius\nFull beard, A.K., I move like terrorist\nGive you 36 like a square when I'm air-in it\nSo while you're still breath-in air, you betta cherish it (Chee-Yuh!)\nYou think you betta then me? I think he hillarious! (Hahaha)\nI'ma pittbull off tha leash, capiche? (Yeah!)\nNeva broke, I got work I could sell (Uh huh)\nAnd workin' wit dat workin' got me workin' wit skells\nWhere I'm from, they eitha end up in a hearse or in jail\nI spit piff, you could roll this whole verse in a \"L\"\nNIKKA!!!\n\n[Outro]\n(Yeah, Nikka!) From Killa-Cali to Killa'delphia (Ya Boy, Cyssero!)\nPussy azz nikkas!! We got tha mothafuckin' body bags readi fo' you bitches\nNikka! (Uh huh)\nIf you ain't like it, fuck you and ya momma nikka!\nDat's how we get tha fuck down nikka! (Put a make up on dem nikkas, show em\nHow fuckin' freaks they are, nikka!)\n2007's owned nikka! (East to tha West)\nA young nikka's turn, nikka (It's dat fuckin' crack musik!)\nYou old azz nikkas mayne, turn ya fuckin' microphone up mayne\nYa digg? (Huh!)\nMayne, this from tha hearth nikka, you ho' azz nikkas mayne! (Yessirr!)\nGet tha fuck out tha way nikka!\nG-Block, fuck tha hood nikka!\nSell tha pound, get tha fuck down!\nYa dig?! (Ahhh!!)\nWhole Up-town stand tha fuck up!\nWhole North stand tha fuck up!\nBay Area stand tha fuck up, nikka!!\nThis where it started! Fo' us!!\nThis where it ended fo' you, lil' fucks!\nYou got a fuckin' problem, holla at me!!", "title": "Hang Ya Self 12\""}]}