{"songs": [{"year": "2010-05-18", "image": "https://images.genius.com/1b1da653144da5c5a984e726b5af373b.450x450x1.jpg", "title": "Believer", "album": "Friday Night at St. Andrews", "lyrics": "[Intro] (2X)\nMake me a believer\n\n[Hook: Nate Walka]\nI want what I can see\nI want what I can see\nJust one thing to believe\nJust one thing to believe\nMake me a believer\nMake me a believer\n\n[Verse 1: Bizarre]\nLook at the sky, it's raining outside\nBut I got too much pride just to ask for a ride\nHold my head high, never ask why\nNever ever, ever seen a grown man cry\nThey took Bugz and they murdered P\nSometimes I ask the lord why he ain't take me\nSitting by the beach, staring at the ocean\nKicking these raps that's full of emotion\nSuicidal thoughts going through my head\nBizarre is alive, but Rufus has been dead\nI'm running out of time, I'm running out of rhymes\nGrab the tech cause I'm running out of nines\n\n[Hook]\n\n[Verse 2: Bizarre]\nAnd I believe that I'm gonna make it\nDon't ask for shit, man I just take it\nDetroit, Michigan, home of the broke dreams\nAbandoned houses, known crack fiends\nMan I'm on lean just to escape reality\nIm losing weight and I ain't counting no calories\nAin't no salary, they done close down the plants\nGreen failing parenting, I'm staying with my aunt\nWho gonna give me a ride? Who's gonna take me to school?\nWho gonna help mama out when daddy acting a fool?\nThe D, watching my people get slaughtered\nHurricane Katrina went out the water\nWho do you believe in, heaven or hell?\nCollege or jail? Bed or a cell? Who got my bail?\n\n[Hook]\n\n[Verse 3: Tech N9ne]\nMom's steady sick and it's right to the point where I need her\nTo be coherent cause Aaron's about to be blaring through speakers\nBut it won't reach her when research feed her meds to get weaker\nHow can the devil play her world when it's so beneath her\nGive and ye shall receive and yet she's the receiver\nOf seizures and fevers that's why I stay Ebenezer\nThat's why you hear sorrowful messages through your tweeters\nFeeling my pain at my show in the front row and the bleachers\nGod seek her please so she breathes deeper\nNot a preacher free be disease either\nOn my knees for weeks hurry retrieve her\nReally need your deed to make me a believer\n\n[Hook]"}], "artist": "Bizarre"}