{"artist": "Immortal Technique", "songs": [{"title": "Crossing the Boundary", "lyrics": "[Verse 1]\nI never make songs to disrespect women\nOr to judge people about the way that they're livin'\nBut the way I am is based on the life I was given\nLike them white boys, losin' my religion\nI used to be a Christian and a political pawn\nThe Bible is right and all your native culture is wrong\nNext thing you know you tellin' me 'bout makin' a song\nCome in the studio, and tell me that I'm makin' it wrong\nPissed off 'cause reality is makin' us strong\nLike the ghost of Timothy McVeigh makin' a bomb\nAyo, Marvin Gaye, what the fuck is goin' on?\nThese rap niggas made propaganda out of your song\nBut it's the Gong Show, amateur night at the Apollo\nMy dick is like my music but harder to swallow\nSo, children, follow me, like the Pied Piper\nAnd sing the chorus in the air, with your blunt and your lighter\n\n[Hook]\nYou played yourself thinkin' you're down with me\nI end your life, nigga, don't fuck around with me\nAnd if you kids can't listen, then you're bound to see\nThe way you get shot for crossin' the boundary\nYou played yourself thinkin' you're down with me\nI end your life, nigga, don't fuck around with me\nAnd if you kids can't listen, then you're bound to see\nThe way you get shot for crossin' the boundary\n\n[Verse 2]\nThe second verse is worse than the first in disrespect\nScripted specifically to keep people in check\nHarlem to Boston, real niggas spit with me\nBut Landspeed, you ain't fuckin' shit to me\nAnd underground labels know that I don't trust you\nYou're only independent 'til you're major, so fuck you!\nAnd if you're pissed off 'cause you think that I dissed you\nI'll rape your moms so we can make this a personal issue\nDance with the Devil, remember that you're not on my level\nStupid, you're not ready\nI won Disypher, Bragging Rights from Rocksteady\nAnd practically every battle that they got in New York\nAnd I still murder rappers on the street for sport\nDoctor Guillotine cuttin' you short, little man\nBut you don't give me props, 'cause I never won at Scribble Jam\nWell, fuck you! I hope someone you love dies\nSo, fuck your crew! And fuck your family, too!\nTechnique said it, bitch, what the fuck you gonna do?\n\n[Hook]\nYou played yourself thinkin' you're down with me\nI end your life, nigga, don't fuck around with me\nAnd if you kids can't listen, then you're bound to see\nThe way you get shot for crossin' the boundary\nYou played yourself thinkin' you're down with me\nI end your life, nigga, don't fuck around with me\nAnd if you kids can't listen, then you're bound to see\nThe way you get shot for crossin' the boundary\n\n[Interlude]\nYeah, wrap it up on these niggas!\nWrap it up, yeah!\n\n[Verse 3]\nImmortal Technique incinerates degenerate fags\nBurn Trent Lott wrapped in his Confederate flag\nI got the Beretta with my face wrapped in a rag\nSo put the African slave jewelry in the bag\nMotherfuckers tell me that a diamond is forever\nBut is it worth the blood of Malcolm and Medgar Evers?\nHouse niggas, get your head severed, tryin' to be thug\nYou don't concern me, I'm tryin' to hurt the people you love\nWord of mouth is I'm in the club, bein' sneaky\nI'm like the body snatchers, and your girl is gettin' sleepy\nI murder you indiscreetly, right at the source\nLike the Roman Legionnaire that stabbed Christ on the cross\nThis is about you, though; it ain't about Jesus\nAnd you shouldn't fuckin' talk about telekenesis\nNigga, please, movin' shit with your mind\nTry movin' your moms out the projects with your rhymes\nAnd next time, I'm comin' after cualquiera\nProfanity, fuckin' carajo maldita mierda!\nRoll up the hierba, y pasala, para la izquierda\nPut the price up to listen to me pop shit\n'Cause I got Martha Stewart givin' me stock tips\nUnderground money with honeys up in the whip\nBangbus.com, nigga, fuckin' your bitch\n\n[Outro]\nYeah, played yourself, nigga, fuck all of y'all!\nYou don't know shit about me\nWhy open your mouth and discuss who the fuck I am?\nI thought I told y'all niggas on Volume One\nI wasn't fuckin' around, you just slept\n'Cause you sold a few thousand units in the golden era\nWhen niggas would buy anything on the shelf\nBut those days are through, and you are through with them", "image": "https://images.genius.com/c628c98f9d53f039b060e7f0369c15b4.220x220x1.jpg", "album": "Revolutionary Vol. 2", "year": "2003-11-18"}]}