{"artist": "Positive K", "songs": [{"album": "The Skills Dat Pay Da Bills", "title": "The Shout Out", "image": "https://images.genius.com/b2d81beafa9044cc3f1c0d999d00b913.640x640x1.jpg", "lyrics": "Hit niggas off like Pepper Johnson\nOh, uh-oh, you ready L?  Aight, let's go\nUhh, uhh, uhh..\n\nLadies shout my name cause I'm sweet like sugar water\nSome call me daddy cause I treat 'em like my daughter\nThey'll rush out my name and refer to me as Posi'\nWhen I make love I come with like a kamikaze\nI don't return 'til the mission is completed\nAnd that's a treat when you're properly treated\nNow don't - say I'm conceited, say I'm convinced\nMy momma called me nasty and I was ever since\nAt school they voted me the one most likely who would\nBut never realized that I'd be so damn good\nSwift and interchangable, yet remaindable\nRhymes intoxicate ya when it spins on the turntable\nAnd get you high, higher than a skyscraper\nWhen I gets rough, it's rougher than sandpaper\nThe brother's still frontin, still front to flex\nWouldn't squeeze the trigger, on a bottle, of Windex\nUhh, and ya don't stop\nUhh, a yea yea you don't stop\nUhh, nah nah you don't stop\nUhh, yea yea you don't stop\nYou bitch ass, niggas!\nShout it out to my peeps\nA B.O.O., you're in the house yo\nA Sugar Ray yea yea you're in the house yo\nA Al G yeahh you're in the house yo\nA Bambaata, a Bambaata\nA Bambaata, you know you got ta\nA Jazzy Jay'n, a Jazzy Jay\nA Jazzy Jay yeah all the way yo\nUhh, I shout it out to the Greg Nice\nUhh, I shout it out to the Greg Nice\nShout it out yo, a to the Showbiz\nA shout it out yo uhh to the Showbiz\nUhh, to the Daddy Kane, a to the Daddy Kane\nA to the Daddy Kane yea to the Daddy Kane\nUhh, a Awesome Two yo\nThe Awesome Two's in the house they in the house yo\nA shout it out uhh, a to the Red Alert\nA to the Red Alert, he gonna make it hurt\nAnd then I kick it out to the Pepper Johnson\nA Pepper Johnson yea Pepper Johnson\nBilly Bathgate yea Billy Bathgate\nA Billy Bathgate hey to Billy Bathgate\nThe Zulu Nation yea the Zulu Nation\nThe Zulu Nation yea my mighty nation\nUhh, well if forgot anybody\nHeh, I'll see you at the Grammy's, y'knahmsayin?\nI'm out..\nAnd I'm out yo yea yea I'm out yo..", "year": "1992-11-03"}]}