{"artist": "Boosie Badazz", "songs": [{"album": "Superbad: The Return of Boosie Bad Azz", "title": "Crayola", "year": null, "lyrics": "[Hook: (2x)]\nCrayola, crayola\nI ride different colors every day\nI ain't playin' wit deez niggas, stuntin' like baby\nNiggas in the hood hollin' Boosie gon crazy\n\n[Verse 1:]\n(you might see me in a)\nWhite challenger, white rims, white hat\nBlack challenger, black rims, black gat (TRY ME)\nBlue challenger, blue rims, blue weed\nOrange challenger, that dukes of hazard up in me\nLexus coupe, drop top so you can see\nPainted candy red, bowlegged like candy red\nOn Sunday I be stuntin', I hop up in my Bentley\nThank the man up above for blessins he done sent me\nGreen charger, drop top, call it master splinter\nGlocks cocked, wildin' out hangin' out the window\nOn Wednesdays I be chillin' but be swerv-IN\nSmokin' purple in my 0-8 suburb-AN\nToo many cars, ain't no room in my yard\nI go low key and I can jump up in my bitch jaguar (I'm BAllIN!)\nFeds follow me round, they nosy tryn'a see\nBut every car got tint, how you gon' know its me?\n\n[Repeat Hook: (2x)]\n\n[Verse 2:]\nI got the lime green drop top\nCan't ride it if it's too cold, can't ride it if it's too hot\nThat thang'll make you pop\nFlat screens in our trunk we got our own movies\nSo you ain't gotta go to the theater, just call Boosie\nAnd that yellow yellow on my shit\nMatch wit my yellow watch, girls on my dick\nPeople don't understand how I floss like this\nPeople like is that a cable cord round your wrist?\nYou know we ball on the week-END\nA line of cars, bad broads tryn'a jump IN\nSame color as my whip, I'm real fly\nYellow, yellow, green, green, my self esteem high\nWhen it be rainin' man I jump in my old school\nWhen its a game its like a train when we roll thru\nYa feel me man?\nBig stacks on deck, get out the big dawg's way\nI'm like, what I'm gon' drive today?\nCrayola crayola\n\n[Repeat Hook: (2x)]\n\n[Verse 3]\nNow all through the week\nI be in the street (THUGGIN)\nLooking real flashy and my whip real nasty\nLeave church on Sunday, jump up in my Bentley\nThank the man up above for blessins he done sent me\nNow Monday I'm back stuntin', I jumped up in my Charger\nThe red one, the wet one, had them hoes like *hoooo* (BOOSIE)\nNavigation on my whip, I can't go wrong\nCandy red on that bitch, on the mirror chrome\nNight time, the right time, I be swervin'\nSmokin' purple in my 0-7 suburb-AN\nMonte Carlo all black, this Crayola shit is real talk\nAnd when I floss I let them birds out\nGave my momma my Corvette, that silver thang\nA nice house flossed out, with some diamond rings\nPeople in the hood like \"Boosie you ignorant\"\nBut daughter, like daddy, you sick with this\nCrayola\n\n[Repeat Hook: (2x)]", "image": "https://images.genius.com/f4027c3eb63958fd1ecb920bf0f8565b.500x500x1.jpg"}]}