{"songs": [{"year": "2003-01-01", "title": "Contraband (Remix) [New 2nd Verse]", "image": "https://images.genius.com/e419c674f3606427aa03bb9748a8b873.360x360x1.jpg", "lyrics": "[Verse 1: Saigon]\nFirst question for motherfuckers that's spittin' this \"I'm a thug shit\"\nYou claim you blew out a nigga brain, then what color was it?\nA) Reddish like the dark shade of oxygenated blood\nB) Brownish like water that's mixed with dirt to make mud\nC) Whitish like the man that created the virus to slay us or is it\nD) Grayish like a gloomy and rainy day is\nSecond question strictly for players, so state your biz\nTell me exactly what the definition of player is?\nA) Duke that rock links, flossin' the club and pop drinks\nB) The jail nigga that stash the mop ringers and slop sinks\nC) The rich rapper who depict the pictures of bigger sixes\nD) That broke nigga fuckin' the richest nigga bitches\nMovin' right along, question number three is for the females\nNever generalize, I'm into details\nOther than the fact chicks is too quick to strip and spread\nWhat is it exactly that make a honey a chicken head?\nA) If she'll fuck her girl man on some shady shit\nB) Go to clubs, but'll leave her mother to babysit\nC) Swap sex for materialistic objects\nD) All of the above.  Love, you fucked up\nThe fourth question's a question that still ig me\nWho do y'all niggas think that it was that killed Biggie?\nA) Southside Crips ‘cause Puffy owed 'em a grip\nB) Some crazy 'Pac fan that flipped and unloaded a clip\nC) Missiles from pistols from government officials\nD) The same cat that came back and then sang \"I Miss You\"\n\n[Hook: Saigon] (x2)\nYou never was a killa.  You never bust a gun\nYou never held the spot down, was never on the run\nYou never lived my life, you dead in the wrong\n‘Cause you never did none of the shit that you said in your song\n\n[Verse 2: Saigon]\nWith the strength of a hundred baboons\nI'll beat your eyes black as a fuckin' raccoon's\nLeave you covered with stab wounds\nDead in a public bathroom\n\nNah… dead that one.  Yo, Whoo Kid.  Hit ‘em with that exclusive shit.  The ill verse.  Yeah, the other second verse, nigga\n\nI said, “Being that I’m a real thug and you not\nEven on your block, I get more love then you got\nPlus, pop Saigon come like W-dot\nPlayed it for Jesus, I’m saved by the blood of 2Pac\nNiggas is whisperin’ in the hood like they don’t get rid of who?\nGet real.  My real, I got guns bigger than you\nWhen it’s finally said and done, y’all’re gonna thank me\nFlow so hot, potent, Shabba couldn't Rank me\nDone, I put the [?]\nI don’t need a fucking gun—I’ll ball up my fist and beat you into submission\nSo what it look like?  I’m like Mike on a good night\nIt wouldn’t be a good fight.  One *punch*.  Good night\nCouldn’t see me even if you could write\nYour life not real enough.  Your moms used to kiss you good night\nTucking you in.  I was in the pen for bucking two men\nBusting my lil’ friend—where the fuck were you then?\nWhen I was breaking the laws, you was bending the rules\nI was locked behind the bars, you was gettin’ suspended from school\nKeep thinking pretending is cool\nI fucking cock back the *gunshot* pop ten in this fool, nigga\n\nNever lived my life.  ‘Cause you never did the shit that you said in your song.  I said:\n\n[Hook: Saigon]\nYou never was a killa.  You never bust a gun\nYou never held the spot down, was never on the run\nYou never lived my life, you dead in the wrong\n‘Cause you never did none of the shit that you said in your song\n\n[Interlude: Saigon]\nNever.  Word is bond, son.  This is for all my official street niggas, you know what’m saying?  Not the fake-ass niggas playing like they thugs or shit.  Niggas that really did that shit, know what I mean?  Niggas that did bids for that shit and was really clapping up niggas, really robbing motherfuckas.  Not the fake rap niggas and shit that be fronting.  Straight up, nigga.  I got another question for ‘em, son.  I said like this:\n\n[Verse 3: Saigon]\nYo, the fifth question ain’t really a question\nShit is more like a lesson.  Better yet, a suggestion\nBefore your bring the bullshit, flexin’ in our direction\nRealize with these Ninas, we seniors—y’all freshman\nI murder him and his best friend for less than\nThe price of a gold Rolly before they put the bud-gets in\nI’m on a pedestal high as the life of Led Zeppelin\nY’all shit is low as the price of the Best Western\nYour best bet is just let us in", "album": "The Best of Saigon A.K.A. The Yardfather Vol. 1"}], "artist": "Saigon"}