{"songs": [{"year": "2015-09-22", "album": "1/12/199?", "image": "https://images.genius.com/87c7232b54898cfe6808a5d87246cbba.500x500x1.jpg", "title": "Bars", "lyrics": "[Intro]\n[?]\nWhat's that, nigga? Haha-ha\nLook — huh!\n\n[Verse 1]\nNow, I can write something that's ignorant, present it as immaculate\nThen package it for people to purchase diggin' inside your purses\nAnd pockets for profit that I know that you needed\nDon't pay no mortgage or no car, no, give them dollars to me\nI dominantly attest a system that was set in place for politics\nThe problem is, this shit is archaic – so I'll explain it quick\nOf course you need a singular image, then you're excellin'\nDon't worry about your content 'cause hatred is always relevant\nAnd prevalent; I'm sure you'll find a proper way to sell to kids\nAnd catch 'em while they're young, they'll never question your integrity\nSelectively invaded the market, your product's average\nAnd with money behind it, I promise that you'll be poppin'\nI put you on every blog and that's how you gain your respect\nWhen you're popular they assumin' you're automatically next\nAnd your catalog filled with records that sound exactly the same\nIt's insane and fuckin' monotonous all your music is drainin'\nThe energy out my body – it's crazy, I'm tryna take it back\nTo Pac and Big or Pun as I punish you with these artifacts\nRelics of what they used to be, honesty over usury\nTake a seat, come and see! I will leave you in disbelief\nNow, you baffled by my intelligence – not to mention the cadence\nBut that's aside from the fact, in the stat I'm currently stated\nJust pay attention to lyrics to see what they really sayin'\nI bet that you would be blown away, wonderin' what you listen for\nAs I propose the apropos, opposers take the higher road\nExpose their true intentions, they devious and deliberate\nDeceivin' with the statics, the average of receptin'\nAccept I'm settin' the tempo in tone, I'll take you to temple\nUn momento, let the author breathe – focusedly I dispose of thee\nKeep this kid in your memory, mention me but I need to be\nBetter than all my enemies, never sleep in my mezzanine\nWide awake I refuse to dream, flow is a methamphetamine\nMeddlin' with adrenaline, pedalin' tryna pass\nI'm gonna crush a couple Adderalls, I'm feelin' like a junkie\nNoddin' off, I need my second wind as I begin the pen\nIs now a part of me, compartmentalize the pain my father causes\nFuck that simple nigga – what the hell do you know?\nAnd apparently, I am too stupid and gullible I could never be\nAnything more than what I am currently, I should probably quit\nI'm wastin' all my time and I might as well call it off\nI guess I need to straighten up and fly right so I can be like\nMy dad, who set the perfect example on how you should live\nAnd that's degrade your wife and kids until they no longer speak\nThen you come home and 'cause 'em hell so that they never see peace\nThe place that we rested our heads ever stepped in a war zone\nWhere the tyrant that's runnin' rampant and rantin' on telephones\nTellin' anyone that'll listen that my kids ain't shit\nA bunch of worthless motherfuckers and my wife is a bitch\nLet's not discuss all of my issues, there's no need to recall the fact I'm a fuckin' alcoholic that was never involved\nOr took an interest within the children that I helped to create\nI live in a delusional world and that's not even my fault\nThe relationship I have with my kids is the one that I want\nI provided and put food on the table, that's all that they needed\nWho cares about love or compassion? Ain't no empathy given\nThat nigga never taught me shit, I learned this all on my own\nI was lonely and suicidal way before I was grown\nNow my adult years are filled with fears and animosity\nI repress my emotions so that they will not affect me\nI've done that shit for a minute but now I think I'm defectin'\nReflectin' on my regrets – I gotta find a way to deal with them\nTo get out of the darkness, become a productive citizen\nI'll never run away from my pain, I prefer to live in it\nThen document my pride in the peek of these perfect sentences\nPrayin' that people feel it, I put my poems in proper pitch\nAin't no need for support, just believe if I ever make it\nThat I'll remember the doubt when nobody wanted to help\nHad to get this shit by myself and I sacrificed all my time\nBut invested that in a craft and I broke it down to explain it\nYou'll see that it's simple math, I continue to bust my ass\nAs I work with the rarer focus promoted by segregatin'\nYou derelicts' demographic reactions, it is reality\nI attacked and I tackled totalitarian temperament\nTenant attendance attempted, but never attended\nIntended to take this metropolis, modernize it but modestly\nModifyin' monotony, mobilizin' monopoly\nMakin' it mortify you, my mind is major and massive\nThe masses made me a martyr – I managed to use momentum\nTo minimalize opinions, maniacally they were given\nI'm endin' this on a positive note, proceed with propriety\nDo it without promotion, the media notoriety\nNever exaggerate how I'm livin' is well below my means\nCreate the flawless flow for the fakers, the fornicators\nForsaken fame for I know that I'd rather really be honest\nI'm on a different trajectory, but you are nowhere near me\nI think that I'll speed it up 'cause I'm tired of speakin' this clearly\n\n[Verse 2]\nYeah, I mastered the flow and they said \"he a beast\"\nI bettered the kid as you need\nSo what do you mean? You singin' I'm all in your dreams\nThat nigga is definitely clean\nHe painted a picture, recommended scene\nYou hearin' the most niggas into one fiend\nYou know that our work is a part of the dream\nI guess that I struggle with everything\nAnd that was the reason that we have created a plan\nOf doin' it better than most of these niggas\nBut no one really understands\nI live in the stanzas, I said that I'll play in my head\nBut now that I'm given the chance\nA relevant nigga with negative stance, lawd!\n\n[Outro]\n\"Aye, bitch, half my fans bitch! Don't nobody like that shit. There's a notebook on the motherfuckin' floor. January 12th, this is it! Rappin' it the fuck up. Five tracks – no hooks or none of that shit. Bars! Five-five fuckin' songs. But enough bars for a whole fuckin' mixtape. You bitch! Tell your mother about it!\""}], "artist": "K.A.A.N."}