{"songs": [{"image": "https://images.genius.com/093524f55308e0c3a99f8d6f7746a3bf.1000x1000x1.jpg", "title": "Turn the Music Up", "album": "Mansion", "year": "2015-03-31", "lyrics": "[Verse 1]\nRed Bull in my hands (Yeah), feels like I got wings\nLotta people in my face, but I can't hear a thing\nIt's like my head's up in the clouds, head's up in the clouds\nAnd I ain't coming down, no\nJust turn the music on, just let me get lost (Hey!)\nI swear that I'ma lose it if somebody turns it off (Hey!)\nWhat are you out your mind?\nYou must be out your mind\n\n[Chorus]\nJust turn the music up, turn the music up\nTurn the music up\nTurn the music up\nTurn the music up\n\n[Verse 2]\nSnapback on my head, I'm so motivated\nNike's on my feet, understand the situation\nYeah, this is not a game, this is not a game\nYou ain't gon' bring me down, no\nYeah, I mean what I say, and I say what I mean\nYou best wipe off that hater look before you make me scream\nWhat, are you out your mind?\nYou must be out your mind\n\n[Chorus]\nJust turn the music, turn the music up\nTurn the music up\nTurn the music up\nTurn the music up\nTurn the music up\n\n[Verse 3]\nI got the adrenaline, rhyme like I'm a veteran\nFine, I've been ahead of the game, no way I'm settlin'\nDrained, but I'ma get it in; lame, this is a medicine\nHey, you get the medic kit beats 'cause I don't let 'em live\nFast, better keep pedalin', blast you with the pen again\nLaugh, but I'm ahead of them\nAct like I don't get it, then that is when I enter in rap\nUntil I never can; cash, it is irrelevant, passion is the element\nLaps around these other men; pass 'em who you runnin' with\nFacts is what I'm coming with; back, but I ain't never left\nSnap and I will never get wack, you better get a grip\nLast isn't a medal, it's glass and I'ma shatter it\nWho do you think you're battling?\nWho do you think you're laughing at?\nI am not a comedian, man, it don't even matter\nIf you don't know what I'm saying, you better do what the chorus says\nYou don't know what the chorus is?\nTurn up on the choruses!\n\n[Chorus]\nTurn the music up\nYou must be out your mind\nTurn the music up\nYou must be out your mind\nTurn the music up\nYou must be out your mind\nTurn the music up\nTurn the music up\nTurn the music up\nYou must be out your mind\nTurn the music up\nYou must be out your mind\nTurn the music up\nYou must be out your mind\nTurn the music up\nTurn the music up\n\n[Outro]\nTurn the music\nTurn the music\nUp\nYou must be out your mind\nYou must be out"}], "artist": "NF"}