{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "F*cks", "lyrics": "(Intro)\nHustle Gang\nAll them boy in the building\nOh shit, by the way\n\n(Verse)\nOkay, so niggas on the hay I admit\nI don’t give 2 fucks\nAbout money, have yo kids wish til yo baby momma get cocks\nI like raz put on my whip (pour it up, pour it up)\nEven if I run out of money\nBet I won’t run out of luck\nMy nigga ride Glock in the hood furreal\nI had dreams bout a house on the hill\nThere’s a couple fiends that we’d run from and that is pay me some bills\nBefore I fuckin die I’m gonna save a fuckin mill\nI did it for the pussy and the money and the feel\nMy nigga it’s fuck you and your opinion too if your name is not on my will\n\n(Hook)\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks\n\n(Verse)\nIf I’m in the building then I’m screwed up\nEven in the fix a mind whip true thug\nGot so many bitches I’mma need 2 trucks\nI’mma need 2 trucks, I’mma need a few trucks\nLame ass nigga just fuck my cool up\nLyin ass hoes tryna spend rumors\nA man gon lie, a woman gon lie\nSo when you think about it, who can you trust?\nNobody, nobody\nNobody, nobody\nEverybody worry bout the old Bobby\nI got 2 blunts rolled up and each a piece\nI turn yo party to a dro party\nAll about my green like a mill so Lotus\nI be comin off the top like a toll bargain\nI said I don’t give a fuck\nCan’t deal with it? That’s yo problem ho\n\n(Hook)\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks\n\n(Verse)\nMan just nigga hold up, I ain’t tryna call yo ho\nPussy prolly smell like throwup\nEverybody know er for suckin on dick til it blow up\nHer pussy hair need a lawn mower\nI show er how to go\nPounds in the front, nigga sold that\nMatter fact I don’t give 2 fuck\nDoin that slap with a flappy ass butt\nHo never would get in my trap\nShe can never get front for her will never stand up\nI’m hanging out with my ball like here nigga no\nFuck with something now you dealin with some real nigga yo\nI can show you how to get a mill in the 4\nI make a dump by the one, I need a trip by the summer\nFirst band fore you say how baby mama get a Hummer\nGet a crib fo yo mama, got to cop until it done\nIt’s a I don’t fuck around if you want a nigga\nI don’t give a fuck\n\n(Hook)\nI don’t give 2 fucks\nI don’t give 2 fucks\n(Hustle Gang don’t give 2 fucks)\nI don’t give 2 fucks\nI don’t give 2 fucks\n(Hustle Gang, we need to say we don’t give 2 fucks)\n\n(Verse)\nTrae Tha Truth Gates, young nigga rich\nWho the fuck you niggas think you talkin to bitch\nMiddle fingers up, play say eat dick\nNever gave a fuck and probably filled on bitch\nWhen I’m right up in the fleet, when I’m down I move around\nBald on the head and you ain’t see me shoot around\nWalk up out the club til money cover the ground\nAll gold chain, they weigh bout 10 pounds\nTryna find a slut that fuck for 10 rounds\nI tell her go long, get ready for 10 gowns\nBitch with my name we bringin all town\nKing of the turf, my throne is all gold\nHustle Gang bitch, my hustle is out of order\nWhen I’m done with that I get big for somebody daughter\nI don’t fuck with niggas, might tip er then got shorter out\nWhere her study is? I’m playin like a recorder\n\n(Hook)\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks\n\n(Verse)\nThese hoes prolly like no talk mkay\nShit geek’d up, eat em raw, mkay\nThese ain’t gay, these craw, okay\nThese ain’t diamonds, these rocks, okay\nCut leafs, spreadin these, we the count\nPull G’s up under this lawn\nSaid bitch I don’t give 2 fucks\nMatter fact bitch I don’t give a damn\nI’mma shoot it with a riffle\nLose mute like lipo\nI taste that bitch, she can suck my dish, tipo\nI mean she can suck my dick\nMy trap so sick\nI’m bout to call Wayne up (Weezy)\nTell me the truck might fit\nHo know where I’m at like Lay J\nDiddy, yo care bout blow back\nI don’t give 2 fucks\nBut they already know that\nI’m cool like winter freeze\nEat lunch, doin what should be\nI just saw fresh in the booty club, thirsty, the whole trap tempt me\n\n(Hook)\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks\n\n(Verse)\nIf I had 2 bitches I wouldn’t give 2 fucks\nLast week in Magic City, spit in guys we trust\n2 freaks on my chain, who the hell King Tut?\nSince the world met me now the whole globe blast up\nOh, you wanna fuck me?\nNeed at least 2 butts\nYea, you wanna smoke with me?\nYou need at least 10 blunts\nI ain’t catchin that cup less a motherfucker screwed up\nAnd I’m young and I’m getting it and I never gave 2 fucks\n\n(Hook)\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks\nI don’t give 2 fucks"}], "artist": "T.I."}