{"artist": "YBN Nahmir", "songs": [{"image": "https://images.genius.com/f840694d19602d5f0dfdd3ea5e0c3b86.1000x563x1.jpg", "year": "2017-11-23", "album": null, "lyrics": "[Intro]\nAyy\nMr. Bounce out with that .44 nigga\nAyy, gang\n\n[Verse 1]\nReal thorough nigga, I ain't never switched up (Nigga)\nCouple niggas say I changed 'cause the big bucks (Nigga)\nI ain't never change, I just see you leachin' on me (Leachin' on me)\nGot mad, now my niggas started speakin' on me (They speakin' on me)\nAyy, it's a shame how they changed, nigga (How they changed, nigga)\nRockin' baby, so I'm stayin' in my lane withcha (In my lane withcha)\nNiggas turned they back on me but you stayed with me (Stayed with me)\nOnly rocking with a few like my nigga Glizzy (Glizzy, nigga)\nNigga speaking on my name when I'm not around (Not around, ayy)\nWhen I'm around, they thinkin' 'bout how they gon' knock me down (They knockin' down niggas)\nBut it's cool, I'm thinkin' 'bout how I'm gon' get dough (Get dough)\nBy any means and that's if I gotta kick door\nYou dependin' on me, well you a man too (You niggas broke)\nGet off your ass and go and show me what that Glock do\nAyy, man this shit be so crazy (Goin' crazy, nigga)\nI ain't even no Blood, but my mind goin' brazy (Not no blood, nigga)\nAyy, damn, this shit fucked up\nMy own man shot at me and missed, so he lucked up\nThat shit hurts, cause that nigga was my ten hut (My ten-hut, nigga)\nOver a bitch, little nigga why you switched up? (Why you switched up?)\nAyy, it's so crazy how these niggas is\nLike I'm 50, I be watchin' out for many men (Many men, ayy)\nIt's niggas tryna kill me just 'cause they done seen me up (Seen me up)\nHatin' from my own city, keep that shit a buck (Gang)\nSay, on my life I'ma try to put this city on (Put it on)\nBut if I don't put it on, Clink got the throne (He got the throne, nigga)\nNiggas snakes in the grass, so my grass cut\nAnd if my time come, bitch, I was really up (Uh, nigga)\nEnd of the day, I just do it for my nigga Valley\nWhy the fuck they had to put my nigga in that Caddy?\nAyy, broken hearts leave a nigga sad (Nigga sad, ayy)\nWhen you died I wasn't sad, it just made me mad (Hate it, nigga)\nBro, we had so much shit planned out (We had it planned out)\nSkippin' states, we was thinkin' 'bout them band routes\nNiggas speakin' on yo name, tryna get some fame (Get some fame, nigga)\nI ain't worried 'bout them niggas, I got perfect aim\nLabels steady hittin' up about some signin' shit (About some signin' shit)\nIt's YBN, big brother, I ain't signin' shit\nYou always told me stay up and don't settle for less (Less, nigga)\nI only listened to you 'cause you told me the best (On my mama)\nBro, that shit is so fucked up, why you had to die? (Had to die, nigga)\nI cried a lot, now a nigga can't even cry\nAyy, no, a nigga can't even cry\nI know you here but your spirit somewhere in the sky\nBro, that shit is so fucked up, why you had to die?\nI cried a lot, now a nigga can't even cry (Can't even cry, nigga)\nAyy, now a nigga can't even cry (Ayy)\nI know you here but your spirit somewhere in the sky\n\n[Outro]\nMan, R.I.P. my nigga Valley, man\nNiggas already know how the fuck I'm coming behind my niggas\nNigga, R.I.P. Tutu, nigga, you know I'm fucking with Vallejo hard nigga\nShout out my nigga NickyBaandz, SOBxRBE, I'm fucking with the bay for real nigga\nNigga, stop playing with my nigga name before I get up with you nigga, that's on my mama nigga\nAnd, Birmingham with it, duck your mother fucking taco, bitch", "title": "Letter To Valley Pt. 5"}]}