{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[ +recorded for but not used on the \"Prince of Darkness\" album+ ]\n\n[ VERSE 1: Big Daddy Kane ]\nGive a demonstration\nTo the whole rap world rhythm nation\nAnd take a taste of this verbal vibration\nWith more color than you see on animation\nAnd bear witness to my smooth operation\nAs I give the party people a sensation\nAnd give them all a good feel of jubilation\nMe and the mic become a good combination\nTo rock the house without any complication\nThe crowd'll give the Kane a standing ovation\nThat just gives me even more motivation\nTo pick up the pace and give you more fascination\nWith the ryhmes in my rap creation\nThey show the power of the Kane's innovation\nAnd create an extravagant inspiration\nSo here I am, to give a demonstration\n\n[ Big Scoob ]\n(Give a demonstration)\n(Give) (give a demonstration)\n(G-)(give a demonstration)\n\n[ VERSE 2: Big Daddy Kane ]\nGive a demonstration\nAnd take time out for a dedication\nTo all the deejays and radio stations\nWho put my record in heavy rotation\nReprise reps for their affiliation\nOf course Warner Brothers help my elevation\nFor publicity to artist relation\nAnd Rushtown for a great three-year duration\nAnd Carol Lewis for the tour preparation\nAnd Farrakhan for the righteous conversations\nI can't forget the people all around the nation\nFrom the adults to the younger generation\nThe black, white, Chinese and even Haitian\nBecause the music ain't about segregation\nIt's a harmony to bring communication\nSo listen up as I give a demonstration\n\n[ Big Scoob ]\n(Give) (give a) (give) (give a demonstration)\n(Give) (g-) (give a demonstration)\n(Give a demonstration)\n\n[ VERSE 3: Big Daddy Kane ]\nGive a demonstration\nFor you to get a  much better illustration\nAnd give the sucker MC's an education\nBecause their style is just a cheap imitation\nIt seems you need a little bit of dictation\nBut what I'ma do for you in this situation\nIs supply a process of elimination\nServe justice by means of termination\nBecause a biter only brings aggravation\nA lotta trouble and a lotta frustration\nSo here's a little bit of useful information\nSo that you can see some acceleration\nIt's gonna take hard work and concentration\nA lotta tears and a lotta perspiration\nThat's the way that you blow up like inflation\nAnd then maybe YOU can give a demonstration\n\n[ Big Scoob ]\n(G-) (g-) (g-) (give) a demonstration)\n(Give) (g-) (g-) (give) (give a demonstration)\n(Give a) (g-) (g-)(give a demonstration)\n(G-) (g-) (g-) (give a demonstration)\n\n[ Big Scoob ]\nSo can I give a demonstration\nFor the sick people with constipation\nYou need to take a little bit of medication\nSo you can go take a dookie on the toilet\nKnow what I'm sayin?\nDo you know what I'm sayin?\nSo can we give this demonstration?\nSo yo\nMe and Big Daddy\nWe kickin it on the down low\nWord up\nWord up, just buggin in the studio\nKnow what I'm sayin?\nGivin all y'all party people out there a - little - bit of - de-mon-stration\nFor the year '91 me and Big Daddy gon' say peace", "image": "https://s3.amazonaws.com/rapgenius/1321503841_BDK%20fade.jpg", "year": null, "title": "Give a Demonstration", "album": "The Very Best Of"}]}