{"songs": [{"title": "Shay Z", "image": "https://images.genius.com/d39be70f638c88c431339e037c0e69e2.1000x1000x1.jpg", "lyrics": "[Hook: Sample {brandUn DeShay}]\nPresidents to represent me\nI'm out for presidents to represent me {always wanted to rap on this track}\nI'm out for presidents to represent me {I'm about to give it my full attention, being (?)}\nI'm out for dead (fuckin') presidents to represent me {in the meanwhile...}\n\n[Verse: brandUn DeShay]\nIt's been a pretty wild three years\nBut I'm still here, so let's give him three cheers\nLike hip hip hooray, never let a whore lay down with him\nMade sure to keep up with the ones that's down with him\nNever let down all the ones that cheered him up\nI don't drink, but I'm alcohol, I'm always in the cut\nPlaying low-key like I'm in the octave\nBut get out of line, I'll spank that ass like your first doctor\nThat wasn't too proper, but who gives a uff?\nBecause I've been looking for one to give, I've almost given up\nLiving up to the potential that I was given\nNiggas thought these was writtens, couldn't believe I was spitting\nOff the top, sort of, never wrote it down\nBut I pace around my room, just thinking for a while\nBut who gives a shit? All that matters is you love it\nThe level that you reaching, dog, I'm already above it\nIt was nothing, playing Smash Bros. with my cousins on the weekends\nMy life was like a movie with a weak end\nAin't nobody buying it when it come out to DVD\nNigga, please, I'll end this with a bang like a trigger squeeze\nSick of me, but this audio say\nTo my face and drool when I walk away\nShay will stay the same with the fame or lane\nThey tried blowing the cartridges, now I'ma change the game\n\n[Hook: Sample {brandUn DeShay}]\nI'm out for presidents to represent me {yeah, uh}\nI'm out for presidents to represent me {yeah}\nI'm out for presidents to represent me {uh}\nI'm out for dead (fuckin') presidents to represent me {brandUn DeShay-Z}\nI'm out for presidents to represent me {uh}\nI'm out for presidents to represent me\nI'm out for presidents to represent me\nI'm out for dead (fuckin') presidents to represent me {let's keep it moving}", "year": "2009-12-25", "album": "Your Favorite! MixTape"}], "artist": "Ace Hashimoto"}