{"artist": "Peewee Longway", "songs": [{"album": "State of The Art", "title": "On Dat Freestyle", "image": "https://images.genius.com/2dadbf19c08c86264460984bb5009064.1000x1000x1.jpg", "lyrics": "[Intro]\nCicero On The Beat\n\n[Verse 1]\nBlue Lagoon brick from Iceland\nPunching bags like I'm Tyson\nRedbone mighty feisty\nSippin' Hi-Tech mixed with Wocky\nKick my pimpin' like Mr. Miyagi\nForeign, Italy, trapping exotics\nAin't no slippin', pocket rocket poppin'\nYeah I'm out here catching boxes\nYeah I'm out here with the rastas\nYeah I'm out here pocket rocket poppin'\nDouble G, double C, trip to Italy\nColin Kaepernick stamped on the key\nI ain't never seen a nigga like me\nWhere he from? I'd like to meet him, I be serving in a Polo T\n50 bands to my jeweler, burr, 3-D\nIn the pan with the pure, call her Keke\nIn the shower, she fuckin' like Mimi (Go Mimi)\nOut the back door, rolling on repeat\nOn a perc pill make a bitch peepee\nHow the vert feel riding down Peachtree?\nWith a three-peat wanna go an free me\nKodak he got Kesha an' Glee Glee\nSix speed in the 'Rari goin beep beep\nSee the boogers in the Patek Philippe piece\nGot them babies in the trunk say I'm deadbeat\nWith the scale and the bales, I don't miss a beat\nGet the bales vacuum sealed so they don't reek\nGotta a lot in the area where they don't be\nYoung nigga with me sting like bumblebee\nWith the sticks they chop through your family tree\nI get geeked up and go eat at Busy Bee\nWent from 33, 23, to 18\nPlug with the ice, insert 13\nKick the front door, searching like the search team\nLean, promethazine on my kidney\nEnfamil in the trap, we got WIC weed\nJohn Wick with the shot, can't see me\nWhen I pop it they look like it's TV\nChristian Dior, Dubai 63 (Dubai)\nReal street nigga, chopper on the seat\nI do pop-ups and meet and greets, yeah\nI got clock-in and check-out sheets\nGot her skeetin' on Cavalli sheets (Cavalli)\nBalenciaga Tripper steppin' on three\nA brick of Harry Potter'll cost you a fee\nRoom full of narcs, it might make you OD\nI eat my plate and it make me obese (Yum, nigga)\n200 back to back, 5 times a week (Let's get it)\nCount up the digits, let it pile on me\nPretty little bitch let her ride on me\nNever let that bitch get you in too deep\nMicrowave new colors, nigga too street\nWalk in the club got a dope boy physique\nTook my new lil bitch on a Dior spree\nShop baby, 'till you drop baby\nI need dome on the way home ridin' inside that drop baby\nI make plays, what's your most common denominator?\nI got Cartier's on my face like Terminator\nAnd these stankin' bitches (Bitch), think they slicker than activator", "year": "2018-11-03"}]}