{"artist": "Papoose", "songs": [{"album": "Cigar Society", "title": "Likewise", "image": "https://images.genius.com/fe9456080b3cffa1c0ae0e9cb4218fd8.640x640x1.jpg", "lyrics": "[Intro]\nI'd like to welcome y'all to the Cigar Society\nGarcia Vegas with black dragons to be exact\nLeaders and followers\nBosses and workers\nPeasants and kings\n\n[Hook X2]\nDead presidents, gangstas, and civilians\nNobody wanna see a nigga make millions\nBut when you spend a hundred thousand, what a feelin'\nHarlem! Stand up! We in the building\nAiyyo Lux, you gotta great mind king\nYou like mine's, king?\nLikewise, king\n\n[Verse 1: Papoose]\nA man come outta jail, you'll give him some dollars\nBut give a man nothing when he get outta college\nHarry D. Rockefeller drug laws\nLaw and Order legislative, study your butter cause\nMastermind planning to stick up a gun store\nSqueezin on a MAC with the serial number rubbed off\nYoung niggas using their teeth to open the duck sauce\nThey don't have religion they only pray to the drug lord\nLikewise, they're ready to die in my lifetime\nCaters to Makaveli, It Was Written just like Nas\nEl Be Logos, Gucci Symbols at night time\nJewelers goin' to hell, he put diamonds in Christ Eyes\nUp in that Grandmaster flash coke, white lines\nSucking a glass dick, pulling crack through pipeline\nDon't like nobody sittin' behind me catch a Trife Bind\nRight hand man, supposed to stand on my right side\n\n[Hook X2]\n\n[Verse 2: Loaded Lux]\nI never got in this for the Heroism\nNow hurry outta the projects to Hurl with him\n[?] get it\nThorough Living\nMeryl's Lynching\nThey watching the pearls glistening with Girls listening\nThe World's Ending\nI look at life like a book to write but it should be light\nWhat you like, I could be wrong, you could be right\nWith jokes plastered all over the broke bastard\nI'm Bodacious, still gettin' my own\nIt's cold asking the hot and bother\nYou got a marker?\nYou're not the author\nYour posse talking\n[?]\nWe goin' let him have it\n\n[Hook X2]", "year": "2014-03-05"}]}