{"songs": [{"album": "Bad Season", "image": "https://images.genius.com/0fb56636df878a9df9d4417d6e65d406.1000x1000x1.jpg", "year": "2011-01-27", "title": "Curious (What Up Wit Ya Girl)", "lyrics": "[Intro: Tech N9ne & Woman]\nDamn baby, that was real good\n(Mmm, do you think they heard us downstairs, papi?)\nI think they heard us downstairs, next door to that\nAnd next door to that, y'knowmsayin'? (Hahaha)\n\n[Verse 1: Tech N9ne]\nYeah, that was good baby, puss crazy\nCould maybe you turn on the fan cause it's a good 80\nIn here right now, we were steamy like wow\nBangin' like wow, question babe, you my pal, right?\nThis might not sound right, but your girl is down right\nThis clowns type and she right below us hearin' our sexy soundbytes\nAnd Kutty is sittin' down there with her actin' like he just found Christ\nTellin' her he's married so I'm in a hurry to get her frown wiped\nListen, I'm ready to do this thing, enough of wishin'\nDo you think she would come up and get in our fuck position?\nDon't be lookin' at me like I'm crazy baby, it's just suspicion\nAnd I never had eyes for your past homies, but I does for this one\nCause she's a X, the Roman numeral for 10's a X\nAnd the last letter in sex, wanna smash and get her then press\nWhy you lookin' at me like I'm ig-nant? You should be pitchin' this\nTo your homegirl then I can do both of you like a polygamist\nSo are you diggin', it? Do you gotta get twist-ed\nTo get up the nerve to run to her and get her in this, bed?\nLooks like you're stressin' but the Scorpio in me ask the question\nI really like sexin' you but the two of you would be a blessin'\n\n[Hook: Tech N9ne] (2X)\nWhat up with you, girl? I want to enjoy\nWould you tell your girl, to get up wit ya boy\nAnd I'm diggin' on you, but I'm still curious\nYou're lookin' at me like I'm playin' but I'm dead serious\n\n[Verse 2: Irv Da Phenom]\nNow babe - I'm hoping you don't take this wrong, girl\nBut ever since you came up in here with your homegirl\nI had my eye on you, and her too\nAnd honestly I'm thinkin' that I want you both, girl\nI - know it may sound a little bit ridiculous, a little sick and twisted\nIf you ain't wit it then I would understand\nCause when I'm thinkin' of somethin' a little kinky and freaky-deaky\nYou seem kind of timid but on the other hand\nKnow what they say 'bout them shy ones, and it must be true\nLook at you sittin' there blushin' hard and you smilin'\nWhile your homegirl's sittin' right beside you\nEvery time I look up she's starin' into my eyes and I just\nWonder (Hmmm) do you ladies like to share?\nShower with each other, have you ever took it there? (Yeah?)\nTeamwork makes the dream work\nSo how about we take it to the room - you, me and, her?\n\n[Hook] (2X)\n\n[Verse 3: Royce Da 5'9\"]\nUhh, I'm so street when I speak, my speech scrape the sewer\nI don't wanna meet your girlfriend, I want you to take me to her\nUh-uh, I ain't mature\nI'm gettin' head outside of my ride when I'm drivin', Ace Ventura\nI come from mad Mitten, I move two bad chicks in\nLike \"Three's Company\" honey, I know, I'm (Jack Trippin')\nShe like to try and kiss me, she said her name was Janet\nI said call me Nickel, now let's go find Chrissy\nI'm not gon' lick the box, but I try to keep you happy\nI call my nigga Big Scooby, he'll come and eat your (Shaggy)\nI know I act bold It's just that me, you and her\nMake the perfect combination like a cracked code\nI was taught by them eaters to double yo' plate\nI'mma be cummin' 'til one of you got the Juggalo face\nWoo-woo, I'm just kiddin', though I am persistent, I got a question, listen\n\n[Hook] (2X)"}], "artist": "Tech N9ne"}