{"songs": [{"title": "Co-Sign", "album": "Church Clothes", "year": "2012-05-01", "image": "https://images.genius.com/dac6127bb6a5a6cb9a45121946eb86ef.500x500x1.jpg", "lyrics": "[Intro: Don Cannon & Lecrae]\nLecrae: Ayy yo Cannon man...\nCannon: What's up homie?\nLecrae: You know what I've come to realize is...\nCannon: What's that?\nLecrae: Everybody wanna put me in a box\nCannon: Nah!\nLecrae: They tryna figure out what category I belong in man...\nCannon: There ain’t no category for this!\nLecrae: So I figure, let me help them out a little bit, you know what I'm saying?\nCannon: I think it's about that time\n\n[Chorus: Lecrae]\nI am so authentic, I'm so authentic\nThey try to figure me out, but this is not a gimmick\nHi Hip Hop, don’t act like you don’t know me\nWe got the same momma, don’t you try to disown me\nI am so authentic, I'm so authentic\nThey try to figure me out, but this is not a gimmick\nHi Hip Hop, don’t act like you don’t know me\nWe got the same momma don’t you try to disown me\n\n[Verse 1: Lecrae]\nI'm just a mixed breed, call me a daywalker\n'Cause I walk in the sun but at night I’m a stalker\nIf you’re looking for blood, come run in my lane\nThe vein never runs dry, it's plenty of it mayne\nI speak an ancient language, they don’t understand me\nIt’s called the truth, I break it down, they try to reprimand me\nMs. Lauryn, she spoke it, they tried to revoke her\nThey drove her crazy like Morgan Freeman did to Miss Daisy\nI am not insane, product of the culture\nI'm what happens when Outkast meets the writings of Moses\nThe views are opposing, but they correlate\nAnd me and Christ don’t match, but we coordinate\nIf Wu-Tang can spit five percent gems\nI can talk about Him who died for my sins\nI’m not a gospel rapper, not a holy roller\nI’m just a product of grace, spreading hope to the hopeless\n\n[Interlude: Don Cannon]\nSee, they trying to put me in the box my whole life. But you know, I stand tall. And it seems like that box is a little too small for me. Church clothes\n\n[Verse 2: Lecrae]\nFeels like I'm *bacbacbac ratatatat*, letting off that truth in here\nThat caged, untamed, strange man, let it loose in here\nYou may have came here sane maine, with your brain in your main frame\nBut if you can’t hang man, you can lose it here\nAnd let’s be clear, I don’t want your approval\nAnd I don’t thirst for the worthless my verses will prove it\nAll these empty executives, a lame pursuit\nAnd you can tell they are just a shell from their vain pursuits\nThey say they love my music, boy they telling tales\nThey want me sign on a dotted line, but I’m not for sale\nThey want that Jay (I know), they want that Yeezy\nThey want that Lupe, they ain't hearing what you say\nI beg to differ, I think they do\nThey’re listening, cause it’s different, and some of them confused\nSo I’m leaving clues, I give directions\nI hope they stop at the light before the intersection\n\n[Outro: Don Cannon]\nThe anticipation is over, here it is. Changing lives one by one. Another classic for you all to ride to. I go by the name of Don Cannon, The One Man Army, back to back with the homie Lecrae"}], "artist": "Lecrae"}