{"songs": [{"year": "2018-12-07", "image": "https://images.genius.com/80e366d2b08e909dd44f09fc7ce98806.1000x1000x1.jpg", "title": "Cohiba Symphony", "album": "Monument", "lyrics": "[Producer-Tag]\nYou are now listening to AraabMUZIK\n\n[Part 1]\nEy, ich empfange Gäste in mei'm mega sicken Atrium\nDer Boden ist ein riesengroßes gläsernes Aquarium\nDa tummeln sich paar Haie und 'ne Schar Mantarochen\nEiner grüßt freundlich, was für'n charmanter Rochen!\nWie der Guten Tag sagt per Flosse\nWeil er weiß, du wirst gleich Haifutter nach Drücken des Glasfalltür-Knopfes\nDenn hinterm Schreibtisch mit den reingestitzten Löwenköpfen\nIst ein Button mit der Aufschrift „Haifischbecken-Tötungsknöpfchen“\nDu rufst noch schwimmend, was dein Fehler draußen war\nJunge, du kommst hier zur Bewerbung ohne Lebenslauf parat\n(AraabMUZIK droppt, Bitch) Du kriegst Schädeltraumata\nDenn der Sound ist richtungsweisend wie bei Fledermaus-Radar\nIch häng' im Schweden-Saunabad\nParallel feuern im Ghetto meine Goons aus dem Mercedes raus AKs\nMänner, fischt den Jungen wieder raus\nSetz dich hin, Junge – Cognac? Die Runde geht aufs Haus\n\n[Hook]\n(Time goes by) Cohiba-Symphony\n(From the point of no return) Immun gegen Kryptonit\n(You've gotta be strong enough to learn) Komm, Kleines, sing für mich\n(Time goes by) Cohiba-Symphony\n(From the point of no return) Immun gegen Kryptonit\n(You've gotta be strong enough to learn) Komm, Kleines, sing für mich\n\n[Part 2]\nHör gut zu, wenn der Boss dir das so sagt\nNicht vom Stoffen wirst du hart und lass die Gossensprache mal\nDu bist schlau und machst dir Pläne\nDoch willst du's zum Boss bring'n – und ich mein' nicht Laufburschen-Pakete – hör genau zu, was ich rede\nWenn du hochwillst, mach dir eins klar\nMit 'nem Lächeln kommt man weit, mit 'nem Lächeln plus Pistole kommt man weiter\nZweifel niemals und wenn, dann zeig's ihnen nicht\nWeil das Anseh'n kostet wie bei Sightseeing-Trips\nUnd das' tödlich wie ein Schuss der Forty-Five\nLieber paar schlechte Entscheidungen als Unentschlossenheit\nKlau'n sie nur 'n Hundert-Dollar-Schein, dann lass die Hunde von der Leine\nLass die Drecksschweine wegschleifen wie die Nummer von der Nine\nHalt deine Runde immer klein, trau nie der Liebe einer Frau\nSchenk ihr Schmuck zum Hochzeitstag, aber niemals dein Vertrau'n\nBrüder schwör'n dir jahrelang die Treue\nDoch die schlimmsten Feinde, die ein Mann haben kann, sind Freunde\n\n[Hook]\n(Time goes by) Cohiba-Symphony\n(From the point of no return) Immun gegen Kryptonit\n(You've gotta be strong enough to learn) Komm, Kleines, sing für mich\n(Time goes by) Cohiba-Symphony\n(From the point of no return) Immun gegen Kryptonit\n(You've gotta be strong enough to learn) Komm, Kleines, sing für mich\n„Ihr seid mir alle ganz große Nachwuchs-Geschäftsleute und Entrepreneurs. Hör ma', komm ma' nochmal her, Junge, komm nochmal her, ey! Guck ma', ich sag' dir ma' so:“\n\n[Part 3]\nWenn du glaubst, „Ich könnte wirklich jedem hier vertrau'n“\nDann bist du nicht mehr ganz dicht wie auf des Bosses Schädeldecke Haupthaar\nBist du zu nett, dann laufen die Zahnrädchen nicht mehr sauber\nDrum gib ihnen keine Winks, gib ihn'n Schläge mit dem Zaunpfahl\nUnd jetzt raus mit dir, Junge (komm, du mach dich ab, Junge)\nCohiba-Symphony\nImmun gegen Kryptonit\nKomm, Kleines, sing für mich\nDas ist 'ne andre Tonart wie Humphrey Bogart\nRauchringe sehen aus wie Dunkin' Donuts\nVery nice wie das Paradise\nLegende, so wie Barry White\nTempelgarten, Engelshafen\nMein Weg: Frank Sinatra\nVillator mit Spracherkennung\nPaten-Stellung – Marlon Brando\n\n[Outro]\nSo!\n\n[Sample]\nTime goes by\nFrom the point of no return\nYou've gotta be strong enough to learn"}], "artist": "Kollegah"}