{"artist": "Half A Mill", "songs": [{"album": "Da Hustle Don’t Stop", "lyrics": "[Intro: Half-A-Mill]\nYea, Mill Gates, yea, uh huh, (Real Thugs)\nRight, right, uh huh, to my gangstas (Half-A-Mill)\nTo my hustlers, y'all know, to my murderous\n\n[Verse 1]\nUh, yea\nI tot 9 millimeter, smoke a lot of reefer\nSell phone don't got a beeper\nTell 'em hoes \"slow your blow bitch!\"\nBetter learn how to keep up\nI feel ki's up, get G's up\nEmpty M-3 try to stick me up\nNiggas Envious me in the Bentley\nOh now you wanna hit me up\nSend pot of girls to set me up\nSex me up, then Tec me up\nGet put to rest by a slob\nI put shots in her gut\nThen my cock in her butt\nAfter she die then I bust a nut\nI'mma gangsta and I'mma hustler\nI rose put that chocolate up\nMy clique shots shit up\nAnd we shot shit up\nWe vow to not give up\nGot a join like dalla got lots of bucks and hottest trucks\nAk's, grenades, those things that fire you up\nMothafucka are you ridin or what?\n\n[Chorus: Half-A-Mill]\nReal Thugs is ridin tonight (Real Thugs, Real Thugs)\nSmokin lye gettin high tonight (Gettin high, gettin high)\nReal Thugs is riding tonight (Real Thugs, Real Thugs)\nSomebody is gon' die tonight (Gon' die, gon' die)\n\n[Verse 2]\nObserve bikes from the turn pipes\nYour livin that murder life\nWe neva hear of Christ observe the ice\nServin 'em flippin 'em them burns or white, right?\nLivin it, gettin it, spittin it, hittin it, womens that's virigin tight\nVertical types, swervin through lights\nHype, gucci frames observin the ice\nRunnin your crib wit the oozy aim\nSnatch the skirt off your wife\nYou hollerin please don't shoot me take all my merchandise\nRight, crime for your life, but little do you know\nYour gon' be dyin tonight, 20 bricks of china white\nI'm lightin that dynamite, diamond heist, a mil to jewels\nI got a lot of shine tonight\nReal Thugs deal drugs, spill blood, thats how we ridin tonight\n\n[Chorus: Half-A-Mill]\nReal Thugs is ridin tonight\nSmokin lye gettin high tonight\nReal Thugs is riding tonight\nSomebody is gon' die tonight\n\n[Verse 3]\n200 and 3, boats sellin 'round the seas\nStill got pounds in the peas\nStaffin g's, snatchin cheese\nWhile you snatch patch of of these\nSleepin on pissy mattress, I got a water bed\nBitches do back flips give me head in my bathroom\nIts sick, if peter rocks tall, check ya emails\nSmoke L while you takin a shit\nRock til I die, rappin and shit\nTook dirty money and made it legit\nYa'll niggas hate I'm escapin the six\nMill Gates, play wit the rich\nModel hoes wanna play wit the dick\n4-4, if you play wit my chips\nWaitin on 'em bricks, we slingin on strips\nSit back pourin Cris\nNiggas talk about what they wanna shit\nDawg I got all that on my wrist\nReal life thug flossin and shit\n\n[Chorus: Half-A-Mill] **repeat 2X**\nReal Thugs is ridin tonight\nSmokin lye gettin high tonight\nReal Thugs is riding tonight\nSomebody is gon' die tonight", "year": null, "image": "https://images.genius.com/cdace55ea46853fe392a282bca193979.600x600x1.jpg", "title": "Real Thugs"}]}