{"artist": "King T", "songs": [{"image": "https://images.genius.com/c723068047c0d910e1d247c3b27d3244.640x640x1.jpg", "title": "On the Dance Tip", "year": null, "album": "At Your Own Risk", "lyrics": "(Dancefloor, baby)\n\nHa-ha\nWhat's happenin?\nWhat's goin on, man?\nChillin\nFinna do somethin a lil' different, youknowmsayin?\nGot my man E-Swift in the house\nE-Swift, you wanna dance?\nAlright come on, let's dance now\nBust it\n\nGoin out on the rhythm & blues tip\nWith my man Rashad and Bronick\nWe got Bob in the house\nYeah\nAnd I'mma bust it off like this\nOn the first verse\nCheck this out\nBust it\n\nNow dancers, here's another hit for your collection\nTake a deep breath, let's start sketchin\nMoves for the dancers to get into\nI'mma wait on you, now here's your menu\nJust order what you want cause you know\nI can rock a slow or a swing tempo\nSo swing to it, it ain't nothin but a good feelin\nAnd if you're willin I'mma tell you the deal then\n\nI got to see you move it (on the dancefloor, baby)\n\nYo, that's how we doin it in 1990, youknowmsayin?\n\nI got to see you move it (on the dancefloor, baby)\n\nYeah\n\n( *E-Swift cuts up* )\n(Get funky with it)\n\nAin't it funky now\n\nHold up, hold up\nWhat I wanna do right here is talk to all the dancers\nThat call theyselves dancers but they really can't dance\nI'm finna teach you how to do it, alright?\nCheck this out\n\nNow all you gotta do is get loose\nYeah, show you got juice\nIf punks wanna jump, run em up and I shoot\nSlick, slick poetry for those who got couth\nAnd if you'll dance even if you can't dance\nEnhance a rhythm that'll glance\nUp against your body as the music just swings\nKnockin out the suckers now who's left? (Kiiiing)\nTee, yeah, that's mee, see\nThe cool gangster, the gangster, that's me\nSo just skip while I make that grip\nDon't worry about a thing, I'm on a dancin tip\n\nI got to see you move it (on the dancefloor, baby)\nYeah\nLike that, yeah, y'all doin it right\nCheck this out\nE-Swift\nI got to see them movin (on the dancefloor, baby)\nAlright, yeah\nWhere?\n(On the dancefloor, baby)\n\n( *E-Swift cuts up* )\n(Do what you want)\n(Let's have some fun y'all)\n\nNow keep on movin, better yet keep steppin\nYou know, from the right to the left and\nDance all night till your knee caps break\nYou can do the Biz Markie, then the Heavy D Shake\nIf you like to boogie from sun to the moon\nWell, cut the rug to my rhythm & blues tune\nJust remember if the phonograph skips\nDon't worry about a thing, we're on a dancin tip\n\nAnd I got to see you move it (on the dancefloor, baby)\nYeah yeah\nCome on come on come\nE-Swift\nWe got to see you move it (on the dancefloor, baby)\nYeeeeah\nPeace\nI'm outta here\n\n(Do what you wanna do)\n(On the dancefloor, baby)\n(I know you got the feeling, let's dance)\n(Let's have some fun)\n(On the dancefloor, baby)\n(I know you got the feeling, let's dance)\n(On the)\n(I know you got the feeling, let's dance)\n(On the)\n(On the)\n(Have some fun)\n(On the dancefloor, baby)"}]}