{"songs": [{"album": "The Warm Up", "year": "2009-06-15", "title": "Grown Simba", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, yeah\nYeah, uh\n\n[Verse 1]\nNow I was dreaming 'bout a deal at the age of thirteen\nI was fiending for the mills, I ain't talking Burger King\nSome of my niggas in the Ville, all they did was serve fiends\nFuck scales, I had skills, all day rehearsing\nThem pretty boys had them gals, spent they time flirting\nAll they wanted was some waves like they fucking surfing\nHold up now, don’t get it twisted, I ain't hating, do your thing\nI was like a young Simba; couldn’t wait to be the king\nNow a nigga is the prince\nHopped over the fence where the grass way greener\nLook at shorty ass, way meaner\nSomething like Serena mixed with Trina, have you seen her?\nShe fine enough to be Ms. Howard, word to Adina\nMy money like a senior, watch it graduate\nNow it's time to eat, I’m letting all my niggas grab a plate\nGravitate to real shit, stay away from phonies\nThese niggas heard about me, now they acting like they know me\n\n[Chorus]\nKeep on saying “Where you going, nigga?” (Shit)\nIt ain't no telling (Huh, yeah)\n“Ay, where you going, nigga?” (Hey)\nIt ain't no telling (Yeah)\nThey keep on saying “Where you going, nigga?” (Going, nigga, ay)\nIt ain't no telling (Yeah)\nCan’t tell you where I’m going, just know I won't stop\nGoodbye to the bottom, hello to the top, uh\n\n[Verse 2]\nPardon the interruption, a proper introduction is necessary\nWhen your shit is legendary, man\nGreedy niggas wouldn’t let me in the cafeteria'n\n'Cause they ain't believe, suddenly they Presbyterian\nThe hoes is librarians; they looking me up\nShe got to Jones like Marion, she licking me up\nThen we cut, look how she say my name\nI got her moaning \"J. Cole\", they used to say Jermaine\nI never change, I'm like a corpse in a coffin; six feet, shit's deep\nI was low, just a dollar and some hope fixed me\n'Cause I was broke, plus the weed that I would smoke would make it worser\nLord, please let my problems disappear like Ron Mercer\nI’m a star; Converses\nConversin' with them girls with them curves like cursive\nThey open like curtains\n'Cause my shit is unheard of like curses on the radio\nSame bitches used to play me though, now they yelling—\n\n[Chorus]\n“Where you going, nigga?” (Shit)\nIt ain't no telling (Huh, yeah)\n“Ay, where you going, nigga?” (Shit)\nIt ain't no telling (Yeah)\nThey keep on saying “Where you going, nigga?” (Going, nigga)\nIt ain't no telling (Yeah)\nI can’t tell you where I’m going, just know I won't stop\nGoodbye to the bottom, hello to the top, yeah\n\n[Verse 3]\nYeah, I left the city for a minute, but it's still on my back\nTold my niggas \"Ay, I'm finna put the Ville on the map\nI'll be back, and I'm coming with a deal and a plaque.\"\n'Cause I'm ill, bitch, they couldn’t make a pill for the rap\nPouring liquor for my niggas that was killed, send 'em back\nCame home, shit is real, niggas still in the trap\nHold up now, don’t get it twisted, if you slang, do your thing\nMe, I'm like a young Simba; I can't wait to be the king\nWitness the dream\nStraight out that Carolina water, I was brought up\nIn the city where the skinny niggas tryna be the ballers\nAin't no fathers, but the skinny niggas tryna hit they daughters\nSneaking in her crib, but her momma never caught us\nWhat they taught us?\nMan, them bad bitches only want the ballers, the starters\nWe hooping, now the hoes wanna guard us\nUh, okay, so play D—know what I mean?\nAnd I, I, I'll put you on the team\nMan, this life is but a dream and I need a fast car\nBad broads, fast forward; passport\nI'm a fucking rap star\n\n[Outro]\n“Ay, where you going, nigga?” (Shit)\nIt ain't no telling (Yeah)\nThey say this life is but a dream, well I need a fast car\nBad broads, fast forward; passport\nI'm a fucking rap star\n“Ay, where you going, nigga?” (Yeah)\nIt ain't no telling"}], "artist": "J. Cole"}