{"songs": [{"lyrics": "[Verse 1: Jay Z]\nUh, yeah\nYou mess around with known assassins, known for blastin' Known for carrying plastic pistols, chrome-attached\nAnd known for grossing the most\nKnown for ballin' the hardest, holdin' our own in our post\nKnown for soakin' ya folks, sendin' hoes to ya coast\nI'm down for whatever\n\n[Bridge: Jay Z]\nJigga man, ya heard\nJay Z, ya heard\nHova, ya heard\nRoc-A-Fella, ya heard\nSigel-Sigel, ya heard\n\n[Verse 2: Jay Z]\nNow everybody wanna rhyme like Hov\nCause I rhyme like I be rhymin' in the Rov'\nClimbin' in them hoes\nMy minds like the diamonds, I'll blind you at them shows\nI don't shine, I glow\nI remind you of that dough\nDon't I? Kill niggas won't I?\nMy per-sona, hustler turned rapper, smell a crack aroma\nSend shots like toma! in any language\nLeave niggas in a coma when I'm bangin' that Fifth\nGet chicks lit off Coronas and bamboo spliffs\nAnd get the camcorder to camcord their hand movements\nAnd for what? ya'll actin' like ya'll better than Hov\nYa'll cats should open up on the Letterman show\nCats is funny\nAll I do is get money and ya'll shit sound funny to me\nEverybody's talkin' like they better than Hov\nBut that shit's real funny to me\n\n[Bridge : Jay Z]\nJigga man, ya heard\n\n[Verse 3: Jay Z]\nYo, yo\nD.A. act like he had a starvin' for Jay\nIf they lock me in a cage, yo party away\nI'm still hot, I'm still S.Dot ya'll\nStill got millions buried in the sock drawer\nStill holdin' my own on the corner nigga\nWhat can't kill me can only make me stronger, nigga\nAnd when I get back home\nGet your ass up out the throne\nEverything's back to the way shit was\nI'mma stay hot no matter what my shit does\nI could drop a straight dud, I'mma stay up\nNiggas tryin' to break my will\nYou know that ain't my steel\nI'm Destiny's Child, my fate's been sealed\nYou're dealin' with a higher power\nDo 'em like Dwight Eisenhower\nMy life can move a thousand miles an hour\nReflect me folks\nAs my world turns like the wheels on a bicycle spoke\nIt's much deeper than a soap, it's a constant drama series\nAll they see is money, they want me to blind the jury\nAll this bullshit can make the mind weary\nBut my theory is the sun shines clearly\nThe sun shall shine clearly\n\n[Verse 4: Jay Z]\nYou know what I do?\nFlow sicker on every record, watch shine\nGlock nine nigga, heavy necklace\nWatch mine, about to make niggas very jealous\nIce in every letter\nUntouchable, can't fuck the dude\nDuck spit, arm shake who Juan Don play\nWith this CEO of the coke on Broadway\nNever heard so many joints from one man\nI make chickens bounce, I make the gun jam\nFlow's like sniffin' a hundred grams\nOf cocaine raw, rip ya whole brain off\nMake it real easy to rip ya chain off\nBK style, see Jay howl\nWe don't play fair, we play foul\nGo ahead stand there we spray crowds\n\n[Bridge: Jay Z]\nJigga, huh\nJigga, what\nJigga, what\nJigga-Jigga, huh\nJigga, what\nJigga, what\nJigga-Jigga, huh\nJigga, huh\nJigga, what\nJigga-Jigga, huh\nJigga, what\n\n[Verse 5: Jay Z]\nI'm a monster, I sleep whole winters; wake up and spit summers\nGhetto nigga, puttin' up Will Smith numbers\nGot money for 6's and Hummers, chickens among us\nWe just tryin' not to let this bullshit become us\n\nFlow like none other, I'm the meanest, toughest, done dotta to gun-butcher", "title": "2000 Tim Westwood Freestyle", "image": "https://images.genius.com/2c8daae92fb2d93158eb460d16a9383f.300x300x1.png", "year": null, "album": null}], "artist": "JAY-Z"}