{"songs": [{"title": "BBAF Mandela Lecture -  ‘ It always seems impossible until its done’", "lyrics": "\"It always seems impossible until its done\".\n\nInspired by that quote I have written about the force that I believe Nelson Mandela was imprisoned for fighting or 'twin forces'...Imperialism and white supremacy, so here it goes.\n\nIts often said that history is written by the winners, I am not so convinced. Whilst I dont dispute that uncountable people claiming to be historians have been educated in the sport of praising the powerful, and dont doubt the effect that dominant ideas however false have on human beings, still seems to me that its people... Everyday people, not academics or the mass media that have the final say in this thing that we call history. While wealth of Kings, and the rule of the powerful continue to fill school curriculal panels over. The combined actions of ordinary people have altered the ways in which power is forced to work, are all too often ignored indeed, functionally so. This induced historical ignorance serves the twin purposes of reinforcing the image of the all powerful and paralyzing those who dare to dream that a different world is possible. Thankfully, peoples histories, that is histories told from the perspective of everyday citizens, have emerged to combat the dusty list of monarchs and their invasions.  Its in the works of these historians that we will find a more accurate picture of how challenges to power have shaped power and forced unjust power to bend if not, unfortunately, to crack totally.\n\nThe anti-colonial struggles of the so called ‘third world’ and their successes in ending direct European colonial rule in the decades immediately following world war 2 is one such process, and was arguably the most significant change in world affairs in the 20th Century,though you would never know that examining any mainstream histories of the period. Countless individuals gave their lives, energies and their bodily safety to end what was in many cases, centuries of dictatorial imperial rule. However, western imperial power was not broken by these forces, and the naked colonialism of pre-1945 was replaced by what kwame nkrumah called ‘neo-colonialism’. One of the strangest, sadistic twists of this asymmetric relationship was seen in the fact that many countries that sent troops to fight for the liberation of their colonisers  from Nazi aggression, were then re-invaded by their ‘comrades’ when they demanded the same freedoms such as Kenya, with Britain or Vietnam by France for example. Yet somehow the cheerleaders of empire have managed to somehow mask this genocidal reign as some sort of ‘civilising mission’ in the public imagination. It is within this context of cosmic scale violence that we must place South Africa’s quest and eventual success in defeating formal white supremacy, alias: Apartheid. The last bastion of direct European colonial roar.  Its also against the general neo-colonial trend that we can examine what is left to do globally and in South Africa in particular. For those of us that believe in justice, sadly the news is not always good.\n\nYou’ll hear it said, hear it repeated, Nelson Mandela spent 27 years in prison, a life time of personal sacrifice that we in comfortable chairs can barely fathom. If a news report is even particularly ‘radical’ they may even speak of the torture and violence of Apartheid. But rarely if ever, is the system of this brutality including the imprisonment of people like Mandela served, mentioned let alone analysed. You’d almost be forgiven for thinking nobody benefited from Apartheid.  Of course this is simply not the case and much like its transatlantic  cousin, apartheid slavery used racism; or to put it more accurately, the mythology of innate white superiority, to justify treating the huge black workforce in ways that would make a human would shudder to treat cattle. With no real rights, no freedoms to travel in their own country, and no recourse to the law, with with respect to the abuses of their enslavers. This exploited black work force along with the fantastic mineral worth of Southern Africa produced uncountable fortunes for white owned corporations and some of the highest general living standards for most white South Africans. British companies were the primary investor in this system,  lest we forget. The governments of Britain and America, ever eager to pass sanctions on regimes they deem dictatorial, such as Zimbabwe or Cuba did not bow to international pressure to place sanctions on racist South Africa, lest we forget.  Given a basic understanding of white supremacy and its economic underpinnings and its service to capitalism ,  it would not be unreasonable to ask if that economical relationship between black and white,  between large transnational corporations and black labor was radically changed by the political freedom of black South Africans. If apartheid was primarily an economic system, to claim as we do that apartheid has ended there must then by inference be something resembling an economic democracy occurring over there in South Africa.\n\nBack to Nelson Mandela. Nelson Mandela as we know, as we’ve said, was imprisoned for almost as long as I’ve been breathing,  27 long years of labor of concrete floors, of beatings of everything that one can imagine goes on in apartheid jail cells. His and ANC’s choice to abandon the freedom charter must be placed within the brutal realities of world politics. That is not to say that anyone,  even Nelson Mandela cannot  be criticised, but one must be careful when viewing someone elses revolution from the comfortable seats of the back of the cinema as we are here. So when we point out the basic facts, it is not out of a presumption that we are too capable of such enormous personal sacrifice, or to poo poo what has been achieved, it is just out of a recondition of reality. The freedom charter has not been fulfilled.\nThe note Nelson Mandela wrote from prison in 1990 re-stating his commitment to the nationalisation of certain sectors of the South African economy; most notably banking and mining, has not been anywhere near close to being delivered upon. To understand why we must look closer at what actually was  agreed during the Apartheid…’handover’. After the Apartheid handover it was agreed that the South African central bank would become virtually an independent entity, unaccountable to the elected government and run by the same man it was was run by under Apartheid, Chris Stalls.  Derek Keys, (Apartheid finance minister) also kept his position, massive pensions were paid out to former Apartheid civil personnel, and not one single corporation was forced to pay reparations to the victims of murders and other abuses carried out  under apartheid to benefit them.  Even the debt, incurred by the dictatorial apartheid regime had to be serviced by the newly elected ANC to the tune of 4.5 billion US dollars per year; this would be laughable if it were not so sickening. A newly elected black government agreeing to pay back loans taken out with international ac-creditors by a white supremacist regime, there is here one of the clearest legal cases for odious debt anywhere in the world. But no doubt well aware of the constant threat of capital flight and other economic weapons wielded by the international community, defaulting on the debts. of their oppressors has been something the ANC has chosen not to do. In addition, post apartheid South Africa, had to repay these debts (of the apartheid reigiem), at a significantly higher rate than the UK or even post Nazi Germany where asked to pay their Debts for World War 2, pause on that. Reflecting the general trend of unequal treatment of poor countries by international creditors. To this day, whites who are just 10% of the South African population continue to control the overwhelming majority of the land, and almost all of attended wealth extracted from it. Rapists and killers were not imprisoned as would be the usual fasion but were rather invited to confess their crimes and walk free during a process called ‘Truth and reconciliation’ this was not justice! This was not the end of apartheid, but rather its morphing from a system that was unapologetically racist to one that now, like the rest of the globe…unapologetically economically unjust; and by logical product of South Africa's history and the worlds history, still racist if not explicitly, by implicit. This legacy has lead us to the Lonmin massacre,  on the 16th of August 2012 at Marikana, where 34 striking miners were shot dead by the South African police force, the single largest public execution in South Africa since the infamous Sharpeville massacre. In post Aparthied South Africa, the message is still clear, that black life is expendable in the pursuit of white profit.\n\nAgain I must re-state because I don’t want what I’m saying to be deliberately misused, the ending of political Apartheid is to be celebrated. Majority rule, however flawed, is always preferable to a racist minority rule, and the ANC have made some positive geopolitical moves, that we know their racist predecessor government would not have made. Such as refusing Britain's (overtures?) to help this nation invade Zimbabwe , and being the only government to send arms to the democratically elected Lavala's party whilst their democracy was being destroyed, by Haitian elites and their United States backers. None the less the fact simply is that Apartheid did not end, it was altered but not shattered.\n\nThe public spirit of triumphalism that was attendant at the end of Apartheid along with the reality of continued oppression for those with whom we claim solidarity, has obvious historical parallels. When Trans Atlantic slavery ended for example, in the US, in the British and other European colonies,  Africans were given non economic emancipation. i.e, no compensation, no tools from which to build the fabric of a new life. In fact in Britain it was the slave owners who were compensated by the British Government to the tune of 20 million pounds in 1807 for the loss of their ‘property’.  Even after Haiti had won its independence by staging the first successful slave revolution in human history; defeating the army of France, Spain and England, the French in 1825 under the threat of re-invasion managed to extort 91 million francs from a loss of property from the newly independent nation of their former slaves. Generations of Haitians labored to pay this debt until 1947. The point is that these abuses are endemic to, rather than an abhorrence within capitalism and you don’t have to be a Marxist to see that. When the luxuries of private individuals are put before the basic necessities of millions it gives us such enlightening historical events such as King Leopold’s reign in the Congo, where a piece of land eighty times the size of Belgium can be awarded to one man by the governments of Europe and America, and subsequently 10 million humans can be killed to generate fantastic private wealth for that one Belgian man. The fact that he had the cheek to call his possession ‘the Congo free state’ only reveals the sadistic comedic tastes of Imperialists. The Congo is still blighted by violence to this day and the execution of its first democratically elected leader with the active connivance of Western intelligence agencies has played no small role in the ensuing tragedy. A system that privileges individual luxury over the basic needs of billions, has brought us to a place where a billion people in this modern developed world do not have access to the basics of life not by accident but by design. Where one American man has as much wealth as 150 million of his national compatriots, and where many of the largest economies in the world are companies, not countries. Of course, anyone who dares to question a system that has produced such mind numbing injustice is dismissed as a Utopian fairy, hell-bent on destroying the free market. Free for whom, and to do what exactly one might ask.\n\nToday, the neo-colonialism Kwame Nkrumah predicted  has the so-called Third World literally paying for the lifestyle of billionaires. For example, Susan George in her 1992 book, ‘*Debt Boomerang: How Third World Debt Harms Us All*’ calculated that a net of 418 billion dollars of borrowed funds flowed right back north between 1982 and 1990. This is more than double what was spent to rebuild Europe after World War 2. Add to that, the fact of structural adjustment, where unelected institutions such as the IMF and the World Bank, US controlled, make it a policy to force poor countries to cut back spending on health, education, water supplies and to often privatise these very essentials as part of this re-payment.  This is to say nothing of the unimaginable tonnage of mineral wealth sucked out of the third world each day at bargain basement prices thanks to commodity cartels, and currency fluctuations. Yet we ask ourselves in all sincerity, why is the third world still poor? Or even worse,  fame charity towards them, the poor teaming brown and black masses who cant quite figure out how to feed their children. We could ask, why don’t poor nations just default on these loans since these neo-colonial debts of their oppressors are literally killing millions of people a year and represent only one percent of global debt. The answer is multi-faceted.\n\nFirst and most obvious  being that the global south is not free of class division, and a great many of the rich in India, in Nigeria, in Jamaica and such, really just don’t care what happens to poor people in the nation’s. Many of these people benefit directly from this scenario, they are its accomplices. But more scary than this predictable greed is in the frequency with which leaders in many cases democratically elected have been ousted or killed with the omitted connivance and military might in the United States and its allies over the last half a century. It is worth noting that the vast majority of these murdered or ousted leaders were those that wish to chart an independent economic path for their nations. This has surely sent a message to all would-be third world revolutionaries, here i'm speaking of Lumumba, Allende, Mosaddeq, Cabral, Michelle, Sankara, Roldos, etcetera, etcetera, etcetera, right up to the present time of Jean-bertrand Aristide in Haiti. In this context is South Africa a pariah or a reflection of 21st century civilisation? What is the fate of the most impoverished darkest skinned human in India, in Brazil, in Obama's United States and even here in this United Kingdom. Has the mythology of white superiority and all its attendant abuses vanished into thin air as black humans marched into the promised land on the backs of the media sanitised Dr Martin Luther King, a post imprisonment Mandela and of course, the white house’s smoothest talking son.\n\nLets focus on the United States briefly, the world’s policemen and self-appointed captain democracy, (along with  Britain of course). A nation with more military bases more widely dispersed around the globe than any other in history. A nation with more humans in prison than any other, both by ratio and as a percentage, a nation with by far the highest murder rate in the developed world. A nation that everyone seems to have forgotten, makes a sport of invading such militarily insignificant threats such as Grenada, Haiti and Panama, to say nothing of Iraq and Vietnam. These  abuses have occurred against the will of much of the American population and of course against popular opinion globally. So much for the ‘international community’. It’s in the US prison population we find perhaps the most depressing internal manifestation of Americas racial and class history.  Today the United States of America imprisons a higher percentage of its black population than in South Africa at the height of Apartheid. More of these people are locked up for nonviolent drug possessions offences, than for rape, armed robbery and murder put together. It’s beyond the scope of this 15 minutes, but to understand how slavery and its pretend abolition, led to convict leasing, then chain gangs  and then logically to todays often privately owned, for profit prison industrial complex, I suggest the works of Michelle Alexander  and/or Douglas Blackmon for starters. Their works show clearly that this treatment along with the continued racial disparagement in every major area, housing, health care, access to credit, life expectancy, both within the US and globally, are the calculated outcome of a profoundly racist machine whatever racially neutral language it is dressed in these days. What of Kenneth Chamberlain, Rica Boyde, Romali Graham, Oscar Grant and the countless other unarmed African Americans executed by law enforcement in Obamas America without making a peep in international news. That is to say nothing of the brutality of ghetto living. And here we are, our government, the primary business Partner to the Anglo-American Empire, feeling rather smug as our relative comfort, temporarily shields most of us from the injustices committed in our name.\n\nSo what can we do? I obviously don’t have the answer, but I began speaking about the teaching of history, and it is on this point I wish to conclude. Teaching impressionable young minds: to idolise murderers, to sanitise revolutionaries,  to ignore the contributions of ordinary people like themselves and to worship imperial conquest as is being done today is an extraordinarily violent act, we can start here. The way we view and understand past injustices unquestionably colours the way we perceive and thus interact with today’s politics; and by exalting the resistance of everyday people, instead of colonisers by making plain, that unspeakable brutality of the world, we can push these same young minds to interact hopefully in ways that are less complicit with injustice. A modest but practical aim that all adults with access to a library and young ears that will listen can partake in, who knows what fruit it will bear.\n\nIt always seems impossible until its done.\n\n(Round of applause)", "year": null, "album": null, "image": "https://images.genius.com/3222ca5815132f2ac56b73bacb186bf1.1000x672x1.jpg"}], "artist": "Akala"}