{"artist": "​iLoveMakonnen", "songs": [{"title": "Being Alone With You - Traduction française", "lyrics": "[COUPLET 1]\nIl faut que j'aille dans la zone, pour choper au prix bas\nJe me demande où je serais si je ne faisais pas tous ces concerts\nJe me demande si elle m'aimerait encore si elle savait pour mes pétasses\nJe me demande si elle serait là si je ne donnais pas de concerts\nJe plane dans les airs, continue d'être sur mon portable\nJ'essaie de l'appeller, je la rappelle chez elle\nMais elle s'en fout de ça, non rien à foutre\nElle veut juste que je rentre, mais je ne rentre pas\n\n[REFRAIN]\nEt il n'y a rien de meilleur\nIl n'y a rien de meilleur\nIl n'y a rien de meilleur\nIl n'y a rien de meilleur\nQue d'être seul avec toi\nQue d'être seul avec toi\nQue d'être seul avec toi\n\n\n[COUPLET 2]\nJe ne vais même plus au centre commercial\nJe fais du shopping à la maison\nJ'achète des conneries en ligne comme si je préparais un mariage\nJe jure de rester discret comme si j'étais une souris\nMais la trap appelle à chaque fois que ce jeune garçon sort dehors\nJe fais genre \"merde il faut qu'je ralentisse\"\n\"Attends laisse moi en rouler un!\"\nSi mon frère a du lean\nAlors \"merde laisse moi boire un coup!\"\nQui pourrait nous arrêter?\nIl n'y a personne qui nous vole\nJe traîne avec les gars de chez moi qui deviennent ces voleurs\nOh merde, on est légitimes\nDehors à baiser toutes ces pétasses\nUn négro pourrait de piquer ta meuf, dehors dans n'importe quelle ville\nPourquoi devrais-je me barrer quand ma meuf persiste à m'appeller\nElle fait genre \"Je jure que je me demande si tu tombes pour une autre\"\nNon, je ne tombe pour aucune de ces filles\nJe suis dehors à faire cet argent pour qu'on puisse traverser le monde\nJe te jure que je pense à toi tout le temps\nDonc pense un peu à mes objectifs\nMais en même temps bébé ...\n\n\n[REFRAIN]\nEt il n'y a rien de meilleur\nIl n'y a rien de meilleur\nIl n'y a rien de meilleur\nIl n'y a rien de meilleur\nQue d'être seul avec toi\nQue d'être seul avec toi\nQue d'être seul avec toi\n\n\n[COUPLET 3]\nJe me demande si elle est toujours là\nJe me demande si elle pense toujours à moi\nT'as dit que j'étais ton Teddy Bear, bien alors est-ce toujours le cas?\nLaisse moi comme ton vieil ours en peluche à la cave\nMaintenant tu sors le soir, j'ai entendu que tu as trouvé un nouveau remplaçant\nUn jeune garçon qui a des bretelles et te traite mieux que moi\nTu dis qu'il a bien plus d'argent, il aime dépenser de grosses sommes\nDans ces choses raffinées, te donnes toutes ces bagues en diamant\nMais il ne t'aime pas comme je t'aime\nEt ne peut pas chanter comme je chante\n\n\n[REFRAIN]\nEt il n'y a rien de meilleur\nIl n'y a rien de meilleur\nIl n'y a rien de meilleur\nIl n'y a rien de meilleur\nQue d'être seul avec toi\nQue d'être seul avec toi\nQue d'être seul avec toi", "image": "https://images.genius.com/01cf3d4f5eba24a569d6453ed4924266.397x397x1.jpg", "album": null, "year": "2015-11-20"}]}