{"songs": [{"year": null, "album": "The Appearances of Keak da Sneak", "image": "https://images.genius.com/acf8036f9dda6e2737ed0577ff07c81d.500x490x1.jpg", "title": "Mobb Shit (feat. Luniz)", "lyrics": "Uh uh uh. Still ain't ready yet\nUh uh uh. Niggas still ain't ready yet\nUh uh uh\n\nI hits the corner on three Daytonaz\nWit a bad ass bitch brought up in Gardena California\nUh she started tuggin' an rubbin' on the Swoop\nI'm wastin' my drink swervin in my rag 6 duce\nUh you didn't know I keep it real from head to toe\nI hit that savings and loans when I was just a baby loc\nWent to Mexico, traded it for the pecos\nCame back to California now it's time to roll\nI was sixteen mane, sellin' quarter keys of dank\nMy uncle was a balla from around the way\nSo I had the hook up\nWhole keys I cooked up\nNow all my niggas, makin' major figgaz\n\nMobb shit, the type of shit you out committin' a lick\nPistol whip them nigga to death and have a kick\nAnd the twist 'cause niggas be havin shit\nLike bitches on Set It Off, dank\nNiggas be sniffin' dark bank\nMission accomplished boss crack\nHard or soft livin' boys and girls packin' yo shit\nLet it off\nNiggas who floss out here be takin' a loss\nIt cost to be the mutha fuckin' Boss Playa\nTalks to throw away gats in the air\nFor makin yo scratch like that there Boss Playa\nNiggas beware\nThe ganga-gangsta type of Luni hoolum atmosphere\nFo rappin' about the clothes you wear, I represent welfare\nNo happy-happy, joy-joy\nIt's these boys\nRunnin' from decoys, pimpin' mo bitches than Dr. Detroit\nIt goes down\nMr. Smoke-A-Lot turnin' pounds into ashes\nBlack ski maskes\nNiggas be gettin the pumpkin head like Cashus Clay\nThe Yay\nArea smoke greenery malacious all day\nEh, eh blaze\n\nBack in the days, when I was raised\nNiggas got sprayed wit A's and K's\nI prayed to my Lord that head won't take\nMe over, we soldiers to fold ya like Motorola's\nAnd hit the corners\nI told ya the 4-4 flow will fuck yo face and leave you frozen\nBitch you was chosen\nThat's how it's goin the Mobb fa sho-ness\nMo killaz and shady niggas to keep the click-ulation flawless\nFuck all that other\nBury yo brother\nLeave yo family mad at the fact the Mobb took me under\n\nBash 'em other sucka, likely struck wit G's\nFor tryin' to brace\nCough drops laced and you'll be laid out stunned by zae's\nPlace the cover in a maced\nATF lookin for this arsonist, lettin off conscience\nHot traces, suicide so you really can't fuck this\nBringin' mo heat than Rapper Bernard\nLookin', micro woof tickets, bout how much to kick it that nigga hard\nOh, from a sucka\nFo them niggas that press they luck there\nIn a game fucka\nParalyzed caught one in the ass, punk ass\nCouped up in an send 'em, an jive\nMake niggas remember the Mobb\nThem other niggas ain't no kiddin' 'em\nAn it best be a bounce off Mista, Mista\nHit ya, get ya, split ya\nThat's how we shit ya\n\nParafanalia to some Mobb members unpredictable\nNiggas get dropped, we call the shots, smashed on sumpthin pitifull\nThey see us comin they clear the block, our faces unforgettable\nThe world is a ghetto, and life is a plot\nI'm surrounded by nimphos\nGivin' up info\nOn where you hide yo doe an indo\nGuess what you in for\nYou bout to find out\nThat shit we in, we all contenders\nYou don't know, you seen a nigga jumpin' through yo window\nDon't even trip\nI confiscate this money in the name of the Mobb\nIt's on yo bitch\nWe'll juss pistol whip this nigga to a coma\nJump in the get away ride and hit the corner\nYo bitch juss got mopped (the Mobb is gonna)\nYo bitch juss got mopped (the Mobb is gonna)\n\nGet ready to get yo gats out niggas\nFo all you wacked out niggas\nBitch made batched out niggas\nJaw jacked out niggas\nI'm not gonna to patch out niggas\nThese niggas don't really give a funk about yo snitch ass\nNever in yo life met a gat that blast on the streets at a lame ass\nBitch ass nigga\nNo cash gettin-er\nHustlin' pretendin' to be a gangsta\nSwitch hittin' ass, nigga too late\nHe wanted his boy to get dumped in wit a 4 chrome that nigga ain't\nDumpin' on nothin'\nMust be runnin', and duckin' and dodgin' in buckets\nThen shittin' up in yo mutha fuckin' drawls\nCoward\nThese bitches I put 'em on the Mobb we gotta get gone\nBefore a nigga cool his gun\nReal nigga runnin' from Mobb\nWill throw away Glock\nWon't pistol go drop\nNever go Mobb\nWhen the 4-4 stop\nWill a nigga get mopped\nFo restin' my knot\nTell 'em to get yo grill knocked out\nYou fuckin' wit niggas that'll have ya noddin' like ya hopped out\n3 Time for the O-A-Kiz-a\nWe folks all day\nAger, Sneek an the B.A\nPut him in the trunk wit a bump, an we Mobb throught the Bay\n\nDon't get it twisted we got restrictions\nNiggas that witnessed family beatins\nFrom family meetins\nNo family grievins\nJuss some youngstas\nGrew up around dirt an dope, an jelous\nEvil tactics\nTo shovel up caskets, and double barrell\nShotty blasted\nI'm knowin' these suckas can't catch these bodies flowin\nMurders so ancient, they faces got federal cases closed\nAnd cross the game it ain't the thang\nSwoop G plus two G's will make them niggas for you to hang\nAn try to be cool when Mobbin on them niggas as we reign\nIt's Money Ova Bitches, broke the skrilla fuck the fame\nSight of soldiers shock the world like Rodney's girl\nAnd we ain't discussin' shit\nWe bustin' clips\nTo makin' 'em hurl\nBullets makin' them bustas curl\nAn I put that on the Mobb nigga\nWe Mobb niggas\nIncludin' everywhere we go\nThat's how we do it\n\nWhen you see Num, you see Mobb\nHow happly if you need job\nEven if you be Slobb you need not worry 'cause we Mobb\nSlobb don't mean Blood\nAn Cuzz don't mean Crip\nAn Oakland is a term for broke bitches makin grip\nWhen we sip\nWe laid out, to drip-drip dry\nWe be slip-slip ride\nThrough the Town doin' high-bys\nWhen the yak hit my face it's like a hamburger kill\nWe'll be real\nWhat's the deal\nUh, uh, searchin' fo skrill, up here!\nWit these tires burnin' off like lavishly\nMakes it easier for me to dig out these hoes like cavities\nHavin' these thang is like a\nGovernment task\nM.O.B. not searchin' fo aliens we won't ask"}], "artist": "Keak da Sneak"}