{"artist": "Post Malone", "songs": [{"album": "Hollywood’s Bleeding", "title": "I’m Gonna Be", "image": "https://images.genius.com/456a385f5f9741e2202331ac8d06e1f2.1000x1000x1.jpg", "lyrics": "[Intro]\nCan you feel it?\nCan you feel it?\nCan you feel it?\nCan you feel it?\n\n[Verse 1]\nPop the top, fill my cup up, yeah\nKeep 'em pourin' 'til I'm fucked up, oh yeah\nDiamond Simon with my shirt tucked, yeah\nMink was 80K that's fucked up, oh yeah (Wow)\nHey, I'll rock the shit but not for long (Not for, not for long)\nThen I'll go cop another one ('Nother one)\nSome people think I'm livin' wrong (Livin' wrong, hey, hey)\nWe live this life but not for long, so\n\n[Chorus]\nI'm gonna be what I want, what I want, what I want, yeah (Yeah)\nI'm gonna do what I want, when I want, when I want, yeah (Yeah)\nI'm goin' hard 'til I'm gone, 'til I'm gone, 'til I’m gone, yeah (Gone, yeah)\nCan you feel it? Can you feel it?\nI'm gonna be what I want, what I want, what I want, yeah (I wanna be)\nI'm gonna do what I want, when I want, when I want, yeah (I wanna be)\nI'm goin' hard 'til I'm gone, 'til I'm gone, 'til I'm gone, yeah ('Til I'm gone, 'til I'm gone)\nCan you feel it? Can you feel it? (Uh-huh)\n\n[Verse 2]\nHey, why you so mad? (Why you so mad?)\nNever look back (Never look back)\nCan't let up the gas, we movin' so fast, yeah, let's make it last\nYeah, I'm on to you, mm-mm (Damn)\nYou're too comfortable, ayy-ayy\nWho you talkin' to, mm-mm\nAin't no time for you, ayy (Ooh)\nI do what I want, Tom Ford on the yacht, ooh (Wow)\nRichard Mille my watch, thousand dollar Crocs, ooh (Ooh)\nThey tryna tell me that it's luck\nYou probably think I made it up\nI got it all, it ain't enough\nBut I'm still gonna run it up, so (Ooh)\n\n[Chorus]\nI'm gonna be what I want, what I want, what I want, yeah (What I want)\nI'm gonna do what I want, when I want, when I want, yeah (What I want, what I want, yeah)\nI'm goin' hard 'til I'm gone, 'til I'm gone, 'til I'm gone, yeah ('Til I'm gone, 'til I'm gone, 'til I'm gone)\nCan you feel it? (Ooh) Can you feel it? (Hey)\nI'm gonna be what I want, what I want, what I want, yeah (What I want, what I want)\nI'm gonna do what I want, when I want, when I want, yeah (What I want, what I want)\nI'm goin' hard 'til I'm gone, 'til I'm gone, 'til I'm gone, yeah\n('Til I'm gone, 'til I'm gone, 'til I'm gone)\nCan you feel it? (Ooh) Can you feel it?\n\n[Bridge]\nEver since I got a taste I've been goin' (Goin')\nEvery chip out on the table, bitch, I'm all in (Ayy)\nI'm gonna be (Ayy)\nI'm gonna be (Bitch, I'm gonna be)\n\n[Chorus]\nI'm gonna be what I want, what I want, what I want, yeah (God damn, God damn)\nI'm gonna do what I want, when I want, when I want, yeah (What I want, what I want)\nI'm goin' hard 'til I'm gone, 'til I'm gone, 'til I'm gone, yeah ('Til I'm gone, 'til I'm gone, 'til I'm gone)\nCan you feel it? Can you feel it? Can you feel it?\n\n[Outro]\nCan you feel it?\nCan you feel it?\nI'm gonna be\nCan you feel it?", "year": "2019-09-06"}]}