{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/bb2a12043d5bed3ffa2d2b0d3814b69b.600x600x1.jpg", "title": "Legendary Street Team", "year": "2000-11-28", "album": "Lyricist Lounge 2 ", "lyrics": "[Billy Danze]\nHey yo we bringin you the international vibe live from Brownsville\nWhere we juggle and struggle to survive (YOU KNOW THE DEAL)\nWe rhyme, from 12 to 12, schemin\nIn the cut on the corner by the bodega with the hammer steamin\n\n[Kool G. Rap]\nFriend, forgive him for his sins (he better watch his step)\n\n[Billy Danze]\nMentally I'm home alone, and since you're deaf\n99.9 of the times I've got my mojo\nBuka-bup-bup-bup-bup-bup-bup-CLAK like whoa!\n\n[Lil' Fame]\nAiyyo I bring sorrow, you won't make it to tomorrow\nFlames spit from the nozzle, pop one up in your furrow\n(STREET TEAM) East coast up, toast up\nWe don't put posters up, we post up\nI'mma front line nigga, you don't want mine nigga\nPlay tough - and I fuck your shape up BUK\nYou have a wheelchair chaffeur with your arms in slings\nBoth legs numb from them arms an' tings\n\n[Hook: M.O.P. + G. Rap]\n[ALL] It's the legendary street team!\n[Rap] Kool G. Rap's (BACK!)\n[Fame] Fizzy Womack's (BACK!)\n[Bill] Billy Danze (AWW DAMN!)\n[Rap] That's how we do it in the ghetto\nSpit fire from the heavy metal (WHERE YOU AT?)\n\n[Repeat Hook]\n\n[Kool G. Rap]\nAiyyo - my attributes of life, never too nice, the rules are too trife\nYou lose life, hit for blue ice, dead over two dice\nMy ape click, potty chips, body shit\nShotties click on you stick you like Poli-Grip\nOne false move and your body ripped, niggas lay in they lobbies hit\nKickback of my gun is like a karate flick, Gotti shit\nMothers and hotties hit, we stash cash sellin dope'n\nCops on the rooftop be telescopin, be tryin to bust your melon open\nGates of heaven is closed, hell is open, shells are smokin\nRobots, yellow tape from four shots\nMurder plot door knocks, heads drop inside of co-ops\nGet buried in corn crops, with tall tops\nHammers drop, magnums pop, you get spotted\nOn some six o'clock shit on your Magnavox\nTaggin your knot, stab a lot, with ice pick shit, Obituary RIP shit\nIller than Pillsbury with the biscuits\n\n[Hook 2X]\n\n[Billy Danze]\nHey yo we step up in the club, in a disrespectful manner\nStomp through the crowd wavin the M.O.P. banner\nKeep fresh coppertops, in the player hater scanner\nWho am I? (WILLIAM DANZE) Right, then you don't wanna know the man\n(OHH!) The hooded soldier, one should never overlook\nIn posession of eternal life as a crook\nIt been written in the books, embedded in the streets\n[Kool G. Rap]\nYeah, pushed out of crack spots\n[Billy Danze]\nAnd bumped out of jeeps!\n\n[Lil' Fame]\nI'm from a place where cats look conspicuously raw\nFitzroy, P-Noid, stickin to his arms\nCatch you at a pay phone, kickin it to moms\nLift your +Face/Off+ like Nicholas and John\n(WAVE YOUR FLAG PARTNER!) put a hole where you thin\n(BAM BAM!) Pop a hole in your mink hat\nBrownsville motherfucker it's so true\nPut that ass in a three-piece suit with no shoes\n\n[Hook 2X]\n\n[Kool G. Rap]\nY'all niggas act like y'all know\nFirst Family, Black Guerilla Family, united, y'know?\nIt's a Queens and B'Ville thing, word up\nY'all niggas come scrap witcha'll heat\nOr get laid the fuck down, word up, no games\nY'all niggas know\nBitch-ass niggas"}]}