{"artist": "Willow", "songs": [{"year": "2014-01-13", "lyrics": "[Verse 1]\nCan you feel the breeze?\nThe clouds are talking loud, I’m talking low for me\nCan you touch my face?\nAnd we gon' leave the memories outside in place\nI woke up one day\nThinking 'bout this earth was just a book and gameplay\nI guess I took my chance\nI guess I took my chance\n(It’s all about her)\n\n[Chorus]\nI saw the ocean when I saw you\nIn my sky, that’s where I climb so high to see you\n(It’s all about her)\nCan you see the words rolling off my tongue?\nYou’ve got the touch baby cause you’re the one\n(It’s all about her)\nI can taste the smoke rollin off your lips\nI inhale, see the stars and then I smell your kiss\nShow me, show me your galaxy\n(It’s all about her)\n\n[Verse 2]\nYou dreamt me up, you put me here\nBehind your eyes, inside your mind\nI hear your thoughts, you took me there\nI tend to stare in your eyes\n(It’s all about her)\nThey’re black as night, when they roll on by\nOur bodies shine while our souls ignite\nFollow me and my broken lead and we’ll paint the sky\n(It’s all about her)\n\n[Chorus]\nI saw the ocean when I saw you\nIn my sky, that’s where I climb so high to see you\n(It’s all about her)\nCan you see the words rolling off my tongue?\nYou’ve got the touch baby cause you’re the one\n(It’s all about her)\nI can taste the smoke rollin off your lips\nI inhale, see the stars and then I smell your kiss\nShow me, show me your galaxy\n(It’s all about her)\n\n[Verse 3: Jaden]\nI hate the fact you smoke cigarettes\nBut girl let’s just stick to kissing\nAnd work out our differences\n'Cause girl I've been listening to your problems\nAnd lately I do not got none\nAnd girl I'll stop when the cops come if they ever do\nLet’s get back to the residue\nLet’s get back to the cuddling\nLet’s get back to the huddle\nAnd let’s get back to that puddle\nWhen Jaden was rappin subtle\nWe went to blast in a shuttle\nOff out into space and then bury lies with a shovel\nLike am I really that lost? That off in my head\nI used to kickflip in my Kostons now rap awesome instead\nThrow a ketchup bottle at you\nThat’s some freaking flying sauces\nAnd go to Mars and show you flying saucers\nMan we gotta off of this\nWe don’t have no parents, all the MSFTS are foster kids\nAnd we don’t have no friends\nCause all you fakies and narcissists\nA group of individuals, we kinda like sausages\nHomie I’m off of this, what I will do is offer this\nIntellect, my extension to enter that\nBuy a Ralph Lauren vintage deck without a sending check\nIn a sec I’m bout to intersect in what you sayin\nSo I could show the whole world what my penmanship\nI ain’t finished yet\nWindows tinted, yeah I like to look at all the women\nGet hot, when the sun is on I’m summer sun in summer\nAutumn, winter, spring\nSummer, autumn, winter, spring\nSome would like to hear me sing\nI’ll buy you diamond rings and store them in my dreams\nAnd we were all a part of one, forgot our teams\nAnd had a phone that never rings\nLove that freakin phone", "image": "https://images.genius.com/409c2730f7d124772542e6daad0459c3.500x500x1.jpg", "album": null, "title": "5"}]}