{"artist": "Cappadonna", "songs": [{"title": "Pain Is Love", "album": "The Struggle", "year": "2003-10-23", "image": "https://images.genius.com/f7a7e9bd3d16cfdfd266ae989d07c7b8.500x500x1.jpg", "lyrics": "[Chorus: Cappadonna]\nPain is love, that's what this nigga told me\nI keep washin' my face with blunts and O.E\nMix coke with dust, still can hold me\nWhat made ya muthafuckas think you control me?\n\n[Verse 1: Lounge Mode]\nStaten Island been wildin', so Osama's nothing\nAnd my niggas out in Brooklyn said Saddam was frontin'\nGotta squad, what you think, it ain't no guns or something?\nPicture Me Rollin', holdin' less than a one or somethin'\nYou fake faggots, yeah we got that big automatic\nLike, Bruce Willis and the Jackal type, yeah, right\nYou wanna see it? Then get on my nerves\nOh you live, and I'm gettin' money spit on my curb\nIn the hood where it get no harder, only tougher\nCrack fiends suffer, baby moms, baby brother\nHustlin', still forty off a hundred packs\nI'd rather lounge in the back of the bar\nMe and my dog throw crack in the jar\nListen to this rap star, while I sit back in the car\nAnd I told ya'll niggas how the Staten rock\nWe don't, trick on chicks, yo we clap them shots\nYou get caught if you ask a lot, like you don't know\nAnd where you at, then ya ass is got\n\n[Chorus: Cappadonna]\nPain is love, that's what this nigga told me\nI keep washin' my face with blunts and O.E\nMix coke with dust, still can hold me\nWhat made ya muthafuckas think you control me?\n\n[Verse 2: Solomon Childs]\nWe bringin' back the Twin Towers, 20-0-3, crack game electronic\nConceived with slow jams by The Delfonics\nAt a level that you should of been years ago\nResponsible usually for coke traffic, usually for broken bone tragic\nRest in peace, to Mayor Guliani's term\nThey say I'm wrong, shit\nI'm try'nna see 26, with my daughters at the Emmy Awards\nAll around the ball glowin', they got the weed flow droughted\nOr maybe niggas in the hood just ain't 'bout it\nTalkin' Hercules, and ain't nothin' but dog food\nStaten Island, New York City drools\nCrazy glue on my fingerprints\nName on the concrete of my hood, what's really good?\nVendetta's with these rap stars\nFrontin' like this crime and the pet is they cars\nBelieve I was God in my last life\nWhat if it was your knife? What if they was your gloves, nigga..\n\n[Chorus: Cappadonna]\nPain is love, that's what this nigga told me\nI keep washin' my face with blunts and O.E\nMix coke with dust, still can hold me\nWhat made ya muthafuckas think you control me?\n\n[Verse 3: Cappadonna]\nAiyo, I came into this game on some real love shit\nAnd ya'll bitch ass niggas, ya'll wanted me to quit\nBecause the way I dress ill and the way that I spit\nBut I ain't never gon' stop, droppin' these joints\nAnd ya'll fake ass niggas, ya'll ain't gettin' no points\nDon't try to sabotage me, cuz you just can't do it\nYou had me in the Square, last year, but you blew it\nBig Donna from the group home, that's my word\nSplash shots at your whip, splash shots at your bird\nLeave your brains and your Gucci boots up on the curb\nPillage for life, Allah's will be the most superb\nSmoke weed with the cannon, smoke the herb\nSo bow down, all you crab ass clowns you can't live\nMy gun's on empty, but it's more shots to give\nI pop you like a slave cop, run in your crib\nThrow darts at your wife, throw darts at your kid\nLeave your house flooded with hits like O.J. did\nEscapin' the crime scene and you love how I slid\n\n[Chorus: Cappadonna]\nPain is love, that's what this nigga told me\nI keep washin' my face with blunts and O.E\nMix coke with dust, still can hold me\nWhat made ya muthafuckas think you control me?"}]}