{"songs": [{"album": null, "year": "2015-09-04", "title": "Reloaded", "image": "https://images.genius.com/6109529eb991128492017c43b6a7bd20.500x500x1.jpg", "lyrics": "[Verse 1]\nUm, give me a sec\nI'm just adjusting the proper presets to set the tone\nSettle down, set in stone\nGather round, cop a squat\nYou should have an idea what this about\nI was tryna be a little better than before I was\nThe king that I am before I was\nThe guy I is to-now, tonight, to-now\nTo write, to verbs, to fuck, to curve, to live, to die\nTo seize the day, to ease the pain, I breathe a J\nTo live, to love, to life you lay,  you lie, you down, you suck, you flesh, you fucked, it's cool, I'm fed, i'm up\nI shed my tusk, you touch my ting, get bled and bust, get fed and bruh, you gotta chill with the extra\nBoy, I'm gettin hungry and the rap game a restaurant\nTummy hurting now, where the restroom?\nSneeze, cough, fart, nigga bless you\nCall all of my white friends 'nigga' because I'm ethical\nEver got beat with a bat until you turned vegetable?\nHad some beef now he broccoli inside the medical\nAll over jokes and ridicule\nThe pedestal set, incredible shit, the belly was sick, his mind was glitched, he let off a clip\nHim hit, Him miss, Him hit, Him spit this chick beautiful, bystanding witness\nDamn all on some bitch shit\nNigga came from poor, can I have some more? on my Oliver Twist shit\nOliver Twist spliffs cuz he fuck with the big shit\nWhippin' a Bisquick for a sniff of the lit lit\nMy nigga change drugs now he change drawers\nAlso from winter to fall, you got a cough? He slang Halls\nI bought one of them thangs that bring coffins\nFox 5, my nigga, coffins\n\n[Pre-Hook]\nOk now what makes a motherfucker gangster?\nPull up on the scene with the banger, no please and no thank you's\nOr is it that strong nigga that take care of his family?\nFuck the scene up and then take care of the damages\nShoots ring out, the whole spot start scrambling\nThey got range, them bullets Anthony Hamilton\nWith bad aim, them killers from off of Candler and Campbellton\nFrom the East to the West, long trip in the ambulance\n\n[Hook x2]\nThat's a long trip, a long trip in the ambulance (Eastside to Stone Mountain)\nThat's a long trip, a long trip in the ambulance\nThat's a long trip, a long trip in the ambulance (Cascade to Bouldercrest, a long way)\nThat's a long trip, a long trip in the ambulance\n\n[Verse 2]\nI say hakuna matata\nNot worried, you can do nada\nI dip my shoters in Prada, you can get dropped in that Aquafina\nFela in my speakers, I'm so surprised you can see us\nSee us, see it from afar, don't throw a rock at a star\nIf I'm Aladdin, I would've just pulled the Glock on Jafar\nI'm hittin licks and I'm flippin it, come and shop with the boy\nShe doing dicks and she pretty lit but I'm straight on it tho\nYou make a living, you cool with it, I can't hate on it tho\nY'all niggas need to get your motherfucking mind right\nNigga light me, hit you from the blind side\nToss 3, get clipped like a mine site\nDon't drip blood on concrete\nDamn, gin drop by the sunlight\nBeen a long day and a long night\nDamn, always something, right?\nNever chill, can't relate\nDo it again, back to back\nBack to back, back to back\nI love practice, practice crack but the shit I do, you can't practice that damn\nDamn did it again\nThere I go, shitted again\nGo places I shouldn't have been\nThen again\n\n[Pre-Hook]\nAlright now what make a motherfucker gangster?\nPull up on the scene with the banger, no please and no thank you's\nOr is it that strong nigga that take care of his family?\nFuck the scene up and then take care of the damages\nShots ring out, the whole spot start scrambling\nThey got range, them bullets Anthony Hamilton\nWith bad aim, them niggas up off Candler and Campbellton\nFrom the East to the West, long trip in the ambulance\n\n[Hook x2]\nThat's a long trip, long trip in the ambulance\nThat's a long trip, long trip in the ambulance\nThat's a long trip, long trip in the ambulance\nThat's a long trip, long trip in the ambulance"}], "artist": "JID"}