{"songs": [{"year": null, "image": "https://images.genius.com/9c7203e565e56a244f10c1741d29f204.640x640x1.jpg", "title": "A Song For You", "album": "A Song for You", "lyrics": "Bizzy Bone It's the Dog, Bizzy Bone\nGot the Dog\nYou got Bizzy Bone ya man\nUndisputed champion boy\nHere's how it's done aight\n\n[Hook]\nI love you in a place, Where there's no space or time\nI love you, for the life, You're a friend of mine\nAnd when my life is over, Remember when we were together\nWe were alone, and I was singing this song to you\n\n[Bizzy Bone]\nFully-Automatic, Whateva you want to know\nWe got's to cry, That I\nStand in the back and ready, Attack\nAnd ready for combat, I\nHeavly heated, Weeded, Beat it, Need it, See it\nGet it, Get it, Get it, Good, Don't get it missunderstood\nMy homey, Only homey, Walking and we talking fo' sho\nAnd I'm a be with him in the end with forgiveness, No more\nAnd remember the words are (herb?) perfict, How could I be worthy\nAnd when I feel so dam dirty, Dirty\nBy leaning on a leer jet, Baby ain't here yet\nHenny, Caffeine, & nicotine, Notice I left out the green\nNotice I never brake a set, Who's that Fuck it\nI don't even know the chick, I don't even know that shit\nEx me, Perplex me, Flex on decks man\nChastment, Investment, Quiet as kept\nI say now, (Man, Man, Man, Man)\nEx me, Perplex me, Flex on decks man\nChastment, Investment, Quiet as kept\nFair\n\n[Hook]\nI love you in a place, Where there's no space or time\nI love you, for the life, You're a friend of mine\nAnd when my life is over, Remember when we were together\nWe were alone, and I was singing this song to you\n\n[DMX]\nMad stressed, that I can't even sleep were I rest\nSo now I were a vest, but what if I don't catch it in the chest\nThen I'm out, just like the light when the powers gone\nAnd there's another tombstone, the childs putin flowers on\nLong live the dream, of making enough cream\nWere I won't have to skeem, or roll aroud with the team\nAnd niggas I can't trust, and I mite have to bust\nOver something dumb, know where I'm coming from fuck the fuss\nIt's to much to bare, and everyday is getting worse\nGot me plotin on my peeps, and how to get'em first\nIt's something to make a nigga strive, and {Stay alive}\nSo I wach my own back {With a black 45}\n\nAre thay coming? Thay coming to get us\n\"I'm ready For eva\", they never defeat you\nThay'll never deceipt ya!\n\n\"WHAT!, Come on\"\n\nAnd were are thay coming? Thay coming to get us\n\"I'm ready For eva\", the love of the future\nThay'll never defeat ya!\n\n\"YEAH!, Come on\"\n\nI love you in a place (I love you), Where there's no space or time (Time)\nI love you, for my life (I love you), You're a friend of mine (Mine)\nAnd when my life is over, Remember when we were together\nWe were alone, and I was singing this song to you\nTell me do you remember, Cause Baby I Remember\nWe were alone, and I was singin my song\n\nMy homey, Only homey, Walking and we talking fo' sho\nAnd I'm a be with him in the end with forgiveness, No more\nAnd remember the words are perfict, How could I be worthy?\nAnd when I feel so dam dirty, Dirty\n\nI love you in a place, (I love you) Where there's no space or time (Time)\nI love you, for my life, (I love you) You're a friend of mine (Mine)\nAnd when my life is over, Remember when we were together\nWe were alone, and I was singing this song to you\n{Donny Hathaway} I was singin my song {Rest In Peace, Baby}\nTo you and only you, baby"}], "artist": "Bizzy Bone"}