{"artist": "60 Second Assassin", "songs": [{"title": "War Zone (Remix)", "album": "Remarkable Timing", "year": null, "lyrics": "[Intro: dubbed voice]\nThere's some sick shit goin' on in here\nA bunch of niggas is goin' crazy\nY'nahmean? Straight up and down\nWhat the fuck is goin' on yo?\nI can't believe it\nNiggas is the nicest y'all\nDivision/CCF, Darkman\n\n[La the Darkman]\nYo I flash jewels, wear no tattoos\nI'm hard like statues, thirsty for Cash Rules\nSon I send a wild dime piece to lick you\nThen wid your pants down nigga I stick you\nClever, so I tell poems quick, Cellphone flips\nBeside sellin' grams I sell you a whole brick\nPlus my flow's sick, then a bitch with AIDS\nAnd my bullets twist niggas like Spreewell braids\n\n[Prodigal Sunn]\nStreet slug incinerator, Brooknam generator, fuck haters\nDesign with the rhymes to shine across the equator\nSpit gravitation, these bitch niggas stay fakin'\nGot no time for playin, guns sprayin', bodies layin'\nMy son's pockets achin', an everyday hood situation\nWe live on revelations, fuck contemplatin'\nAnd yeah, many hung in the jungle\nStamina black panel I jack with the hammer attack\nNow where your sons at?\n\n[Chorus: Free Murda (ShaCronz) {*with 60 \"aww\"ing in the background*}]\nGet off my niggas, shit on your niggas\nClick on your niggas, get off my niggas\n(Yeah yeah yeah yeah yeah) Hatin' Don't Pay\nYou wanna live off our riches?\n\n[ShaCronz]\nIt was devil one great in 7-1-8, let it be him\nState rapper insest, corporate DMs\nIn the Lex or the BM, niggas get stress when they see 'em\nBust Techs in the BMs, sex, European checks\nOr Koreans wrap tight like durags\nCrackin' white and blue bags, about to cop the new Jag\nOff the lot or on the spot, I rap for Ju-maicans\nAnd pawn shops, Cronz hot, I got the block on lock\n\n[Break: Terra Tory] + (RZA)\nAiyo Cronz, Cronz I told you my nigga\n(What up, we got The RZA, Zig Zag Zig Allah, right here\n60 Second Assassin, ain't nothing changed\nYo, a minute to par, cue them up for one minute\nAiyo, 60, spit that fire, son\nShow them why you're the 60 Second Assassin)\n\n[60 Second Assassin] (Free Murda)\nRhyme spit (it's a), it's a Time to click (gotta)\nComin' out your pocket with your money plus lint (gimme that)\nI got a .22 and a .25 spit (what you spittin')\nI'm lookin' at a potential slip (I wanna flip)\nGo 'head my nigga go 'head and flip\nAlready done, emptied the clip (I'm gonna)\nCatch a tour and then split (yeah), I got 20 years in head of this shit\n(You just a..) international pimp (60), every verse in the script (yeah)\n\n[Timbo King]\nShoot a fair one, you need help shoot a flare gun, blap blap blap blap\nEmergency, my team emerge with me\nI got the game on DVD, so watch me now\nThe sharper the metal the deeper the wound\n'Bout to pop somebody's balloon up in this room\nPuncture, internal bleedin', let the horror begin\nEnd of the world is here, men followin' sin\n\n[Terra Tory]\nTerra Tory shatter your dreams as bad as it seems\nThe only thing that matters is that the cabbage is green\nSplatter your team, Jack of all trades in the shadow of Kings\nSnakes in the grass rattle for schemes, all out battle for CREAM\nEverybody seekin' national gleem\nActual facts is seen, display stats on screens\nBeat competition by a wide percentage\nCreate more rackets than tennis\nThis rap menace attack the track 'til it's finished\n\n[Chorus x2]\n\n[Outro: dubbed voice]\nHahaha, yeah yeah\nLike I told y'all\nIt's some shit goin' down\nRespect this straight up\nCCF and Division\nOne", "image": "https://images.genius.com/1d2892cda7088abed9797fd13ab159e5.500x500x1.jpg"}]}