{"artist": "YG", "songs": [{"image": "https://images.genius.com/6d9597606099b223fdd3ad68fa232887.1000x1000x1.jpg", "year": "2016-06-14", "album": "Still Brazy", "lyrics": "[Intro]\nGimme this, gimme that, gimme a lot\nNigga Gimmie got shot, hold up\nGimme this, gimme that, gimme a lot\nNigga Gimmie got shot, uh\n\n[Verse 1]\nGimmie wanted a lot\nGimmie wanted some money, Gimmie wanted a Glock\nGimmie wanted a spot at the top but he ain't work for it\nGimmie'll drown in that water without a surfboard\nAnd I'm tired of that gimme shit\nCause my whole life ain't nobody gimme shit\nGimmie getting evicted on the first\nAnd who did Gimme call? Nigga I was the first\nGimmie got handed everything he wanted when he wanted it\nIf he lost it, he wouldn't know how to recover it\nGimmie gon' fuck around and be a nigga who's homie made it\nOut the streets but he was on bullshit so he ain't come with him\nNiggas be like \"Give me a hand out\"\nYG be like \"Why your grown ass hand out?\"\n\"Uhhh, fucked up my money, uhhh, shit got ugly ma\nMy baby mama was on me, damn man, we real homies?\"\n\n[Hook]\nNiggas be like \"Gimme this, gimme that, gimme a lot\"\nNigga Gimmie got shot\nNiggas be like \"Gimme this, gimme that, gimme a lot\"\nNigga Gimmie got shot\nNiggas be like \"Gimme this, gimme that, gimme a lot\"\nNigga Gimmie got shot\nNiggas be like \"Gimme this, gimme that, gimme a lot\"\nNigga Gimmie got shot\n\n[Verse 2]\nSoft early, get Gimmie what Gimmie was asking for\nCouple months later, Gimmie start asking for more\nGimmie said he going through it, life hitting, he be starting to lose it\nBut every time I give him cash, he buys dro, he a doofus\nSo I say no and Gimmie took it how he took it\nI said no for a reason, but he ain't asked, he said said \"Fuck me\"\nAnd guess what I found out? Nigga what you find out?\nGimmie and my ex bitch was fucking\nOoh, ah, it touched me\nFuck do I press him? Do I pop him? I need advice Father\n\"Uhh, I thought you ain't love me no more my nigga\nI didn't know what to do man, I had to fuck one of your bitches\"\nSee Gimmie all along was a cold nigga\nDidn't give him what he wanted so Gimmie stole from niggas\nAnd that's when I pulled out my Glock\nNow everybody know how Gimmie got shot\n\n[Hook]\nNiggas be like \"Gimme this, gimme that, gimme a lot\"\nNigga Gimmie got shot\nNiggas be like \"Gimme this, gimme that, gimme a lot\"\nNigga Gimmie got shot\nNiggas be like \"Gimme this, gimme that, gimme a lot\"\nNigga Gimmie got shot\nNiggas be like \"Gimme this, gimme that, gimme a lot\"\nNigga Gimmie got shot\n\n[Interlude]\nGimmie, Gimmie, Gimmie, Gimmie\nGimmie, Gimmie, Gimmie, Gimmie\nGimmie, Gimmie, Gimmie, Gimmie\nGimmie, Gimmie\nGimmie, Gimmie, Gimmie, Gimmie\nGimmie, Gimmie, Gimmie, Gimmie\nGimmie, Gimmie, Gimmie, Gimmie\nGimmie, Gimmie\n\n[Outro]\nGimmie wanted some money, Gimmie wanted a Glock\nNigga's be like \"Give me a hand out\"\nMy whole life ain't nobody gimme shit\nG be like...YG be like, G-G-G-G be like, G be like\nMy whole life ain't nobody gimme shit", "title": "Gimmie Got Shot"}]}