{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "Don’t Like", "lyrics": "[Hook - B.o.B]\nWe don’t get down like y’all\nNa, na, na, na\nNa, na, na, na\nWe don’t get down like y’all\nSucka nigga, we don’t get down like y’all!\n\n[Verse 1: T.I.]\nIt’s been a lot of back and forth over this and that\nSo I don’t pick the bobo no more, I just get it, Fact!\nListen, pimpin’, let me tell you what the business here\nY’all know some so I’mma tell you what the difference here\nSee, we’re old school, you’re just old news\nWe used to move blow, and you just blow dude\nSee we the talk of the town, me and my whole crew\nYou run around town gossip, like the hoe do\nSee you name-drop when nobody knows you\nWe get the lames out our sector, like we ‘posed to\nMy crew, we cop the bentley, Brooklyn and the Rolls too\nYou give her roses I’m the one she bring the rose to\nSo you say you’re shining, well I guess I’m shining more\nSo high up, I’m soaring, thirty I’m like a dinosaur, carnivore\n(Meat) Me year, G they respect\nMe to you like a comparing a vet to a cadet, nigga\n\n[Hook - B.o.B]\nWe don’t get down like y’all\nI ball, I do, you talk\nI’m real, you flaw\nListen nigga, we don’t get down like you!\nSucka nigga, we don’t get down like you!\n\n[Verse 2: T.I.]\nDon’t call it the comeback\nGetting right? being from the fed pen\nPull up on them suckers, pop the trunk and tell ‘em get in!\nI thought I lost well guess again\nBack to balling, getting bread, bring the checks in\nYeah, like we did on my last case\nI show you how to make a blessing out of bad breaks\nHey, let me set you niggas ass straight\nHoe want there clothes back, loosen up fagbay!\nThem hotpants bad for your prostate\nLime green high, pink up dragqueen, hotdate\nAt stores asking for the same size the bitches buy\nThey say is hip, but where I’m from we call it sissyfied\n\n[Hook - B.o.B]\nWe don’t get down like y’all\nI ball, I do, you talk\nI’m real, you flaw\nListen nigga, we don’t get down like you!\nSucka nigga, we don’t get down like you!\n\n[Verse 3: T.I.]\nBefore us there was none, after us no more than ever be\nThis is the greatest show on Earth you ever seen\nI still do it for my nigga in the streets, getting into\nBlowing money like my nigga, Big Meach just to do it\nSay we’re blowing money fast, big old money bag\n3 /400 cash just to make them suckers mad\nBack in the saddle the winner of every battle\nBeen the best since I was rapping in the rattle, world travel\nAs you comment on the rumors of what have you beware, dude\nPrayer can’t prepare you, how dare you?\nDisrespect my presence peasants, I will tear you\nA new one, I poop on, your ego is ?\nRolls Royce back seat, no great coupon\nA true don, Three piece cashmere suit on\nPion, see it ain't no neon on my new ones\nHear the truth on every song I spew on, Bloaw\n\n[Hook - B.o.B]\nWe don’t get down like y’all\nI ball, I do, you talk\nI’m real, you flaw\nListen nigga, we don’t get down like you!\nSucka nigga, we don’t get down like you!"}], "artist": "T.I."}