{"artist": "The Weeknd", "songs": [{"year": "2016-11-23", "lyrics": "Scenes[Intro]\nThe title, \"M A N I A\", appears in bold, red capital letters.\n\n[1: \"All I Know\" Scene]\nMurphy the leopard is in the center of an arena-like area. A white light is flashing to the beat of the song. Murphy glares up as saliva dribbles from his mouth.\n\n[2: \"Sidewalks\" Scene]\nAbel is seen riding in his McLaren P1, singing along to the song. There is a slow motion clip of Murphy running. Abel continues singing along to \"Sidewalks\" in his expensive vehicle. Cut to a view of a mountain in the distance.\n\n[3: \"Secrets\" Scene]\nThere is ambience in the background. Abel, wearing a blue baseball cap, gets out of his P1. He walks into the nightclub. \"Secrets\" begins to play and Abel sings along. Everybody in the club is dancing. There is a young woman dancing seductively in the middle and Abel has his eye on her.\n\n[4: \"Die For You\" Scene]\nUnder a fading blue light, Abel and the woman from the previous scene are becoming extremely close and dancing slowly and romantically with one another. A man is watching them from a distance with jealousy. The music fades and Abel is seen in the bathroom using water to make sure his hair looks perfect for his newly found woman of interest. The jealous man walks up to him from behind as he washes his face in the sink. He then lunges for Abel with his knife and blood spurts everywhere. The music stops and Murphy roars.\n\n[5: \"Party Monster\" Scene]\nAbel is covered in blood. The man lays dead on the floor, still bleeding. The woman from earlier is stood above his body in an all-black outfit. She presumably saved Abel from being knifed. The scene cuts to the nightclub and Abel, who still has a trail of blood on the side of his face, is dancing with his woman and mouthing along the lyrics to the song  as it plays in the background. Cut to flashing blue lights.\n\n[6: \"I Feel It Coming\" Outro Scene & Credits]\nAbel is singing to the track. Him and his girl are seen stood where Murphy the leopard was sat in the area from the first scene.\nSongs Appearing In The Visuals1. \"All I Know\" ft. Future (0:00-0:42)\n2. \"Sidewalks\" ft. Kendrick Lamar (0:43-2:26)\n3. \"Secrets\" (2:54-4:31)\n4. \"Die For You\" (4:32-6:10)\n5. \"Party Monster\" (6:15-8:40)\n6. \"I Feel It Coming\" ft. Daft Punk (8:42-12:00)", "image": "https://images.genius.com/e0e93849cdd69f8dc247a1c97f2b8f98.700x700x1.jpg", "album": "Video Breakdowns", "title": "M A N I A"}]}