{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C. Pt. 2", "title": "Dirty New Yorker", "image": "https://images.genius.com/e25277b4e30e7ff6801bccf445a029d8.499x499x1.jpg", "lyrics": "[Intro]\nYeah, yeah, yeah, yeah\nUh, uh, uh\nYeah...\n\n[Verse 1: Prodigy]\nBaby mama let's roll, here we go, Cheerio, serial\nKilla with the flow and the blow and the dro'\nAnd the gun go ring, hit 'em all in a row\nAK-47, .40-Glock, .44, let 'em know from the door\nHow it go, it's not a joke, there's gon' be a homicide\nI'mma ride, I'mma rep me a nigga up in the box\nAnd send 'em to his folks, his bloods, his kin\nThe drama it don't end, bust a gun\nBust a nigga's face open with the hand\nTell 'em go tell a friend, tell a cop, tell the FEDS\nI don't give a mothafuck, you niggas and the pigs\nI'mma let the world see you, you're a bitch, you're a snitch\nI'mma Mobb Deep gangsta, Infamous soldier\nIf you got a cold heart then my shit just froze over\nRange Rover, Chevy Suburban, the bullet proof trim\nThe windows on the crib, bullet proof them\n\n[Hook: Prodigy]\nYou're fucking with a Dirty New Yorker\nQueens in this bitch fall back or get roped up\nYou're fucking with a Dirty New Yorker\nQueens mothafucka, move and get smoked up\n\n[Verse 2: Prodigy]\nAy' baby mama let's slide on the floor\nI'mma pro with the flow\nI can go on forever tell me when to stop yo\nMy first album Head Nigga in Charge it went gold\nWith my next shit I'm just trying to seel a lil mo'\nI won't be mad if it's less, I'm still filthy rich\nWe going on a permanent tour and never coming back\nI'mma vet not a pet, you gon' see when I flip\nNiggas trip fall on their face and bust their own shit\nCome for me you gon' run up to a wall of cement\nCertain niggas not to be touched and I'm one of 'em\nPop to bub me, crack open the Goose and the Gin\nYou gon' get real fucked up in memory of them\nI'mma cop some more ice, houses and whips\nWhy they mad? Cause they can't spend money like this\n180 on the wrist, 190 on the six-speed\nPorsche with the turbo and shatter proof tenth\n\n[Hook: Prodigy]", "year": "2008-04-22"}]}