{"songs": [{"image": "https://images.genius.com/80b3bffcce799c7f5c2fceeacf7c8a41.1000x1000x1.jpg", "title": "Hate It or Love It", "album": "Crenshaw", "year": "2013-10-08", "lyrics": "[Verse 1: Nipsey Hussle]\nMy face fat, that means I'm eating — where your steaks at?\nWhere your real dogs that love you, not them fake cats?\nWhere them girls that got your name as a face tat?\nKnow you by your first, can't replace that\nBeefin' with your niggas, so you stay strapped\nBelieve me it's religious, where your grace at?\nJumping off the porch, where your faith at?\nWhere the blocks where you made your plays at?\nI put Slauson on the map, you gotta face facts\nKept it hood like six braids and blue wave caps\nSaid I couldn't but I did, you can't change that\nYou can hate it, you can love it, I don't change, jack\n\n[Chorus: Teeflii]\nHate it or love it\nHate it or love it\nI will never let you stop my grind\nI came too far to look behind\nYou said I couldn't — I did it, I did it\nYou said I wouldn't — I did, I did\nAnd you can't stop me, you can't stop me\nYou can't stop me, no\n\n[Verse 2: Teeflii]\nHaters tryin' to fuck with my mind\nKeep on talking from behind\nI ain't got no worries at all\nNigga, I grind for this (That's right)\nHomie, I'm made for this\nThis is too my exes that be sayin' we don't get along\nThey can hate but I know they gonna hear this song\nOh, and you ain't ever found a young nigga like me, no\nYeah I did what you said I wouldn't do\n\n[Chorus: Teeflii]\nHate it or love it\nHate it or love it (Hate it or love it)\nI will never let you stop my grind\nI came too far to look behind\nYou said I couldn't — I did it, I did it\nYou said I wouldn't — I did, I did\nAnd you can't stop me, you can't stop me\nYou can't stop me, no\n\n[Verse 3: Nipsey Hussle]\nLook, from one way bus stops, bustin' ‘til the gun stop\nTo pulling up in young drop, and parking front of drug spots\nLook at how your young popped, look at how these youngs flock\nLooking out my living room, like, \"Hell no, I won't stop\"\nAll I need is one shot, that's just how we was taught\nSitting in a circle all silent, that's 'cause funds talk\nDesperation rubbed off, found myself, I was lost\nSketched it out, architect, the blueprint of a young boss\n\n[Chorus: Teeflii]\nHate it or love it\nHate it or love it\nI will never let you stop my grind\nI came too far to look behind\nYou said I couldn't — I did it, I did it\nYou said I wouldn't — I did, I did\nAnd you can't stop me, you can't stop me\nYou can't stop me, no\n\n[Verse 4: Nipsey Hussle]\nYeah, sometime I think, that\nAll I do is break hearts, all these nigga fake hard\nI ain't catch a state charge, so I just wanna thank God\nSee me in that new car, see me with that new broad\nEverything I've been through, tell me I went too far\nI ain't done enough, nigga — screaming out, \"Fuck niggas!\"\nThis ain't good luck, nigga — another good run, nigga\nI'd done had two or three, and between you and me\nI don't hate none of y'all 'cause jealousy ain't new to me\n\n[Chorus: Teeflii]\nHate it or love it\nHate it or love it\nI will never let you stop my grind\nI came too far to look behind\nYou said I couldn't — I did it, I did it\nYou said I wouldn't — I did, I did\nAnd you can't stop me, you can't stop me\nYou can't stop me, no\n\n[Outro: Nipsey Hussle]\nI think it's stronger than faith at this point\nIt's like a constant, it's like gravity, you know\nYou don't have faith in the ground\nYou just know when you put your feet on it it's gon' stand solid\nAnd that's how I feel about music"}], "artist": "Nipsey Hussle"}