{"artist": "Pouya", "songs": [{"album": "Underground Underdog", "title": "Scrubs", "image": "https://images.genius.com/1ebef3a98533a50c31711542c8814880.640x640x1.jpg", "lyrics": "[Verse 1: Shakewell & Pouya]\nBitch, I've been a scrub since day one\nScrubbin' under toilets till the pay come\nPopping ten pills 'til the pains numb\nI can feel all the hate from my day ones\nClaiming the clique like they into it\nReally wishing I fail, you my enemies\nI ain't pay for no ho, I'm just feelin' it\nWhere in the fuck were you at at my sentencing?\nWhat the sentence is, said the judge as he sentenced me\nTo the pen where he 'ready sent many men\nFirst time offender to felony, can't feel resentment for crimes\nI'm just putting in, work for the set that I'm reppin' in\nBut what happens when sets start to cavin' in?\nI pray the fuck boy don't get popped\nThey get picked up, picked on 'til they speak to the cops\nI can hear squealing like some pigs in a pot\nSo I'm still prayin' that the case get dropped\nAyo, Pouya (Yuh?), I've been praying a lot\nBut I don't know who's talking back, is it Satan or God?\nCould be the voices in my head since I been kicking the ox\nAll I really need is beats so Getter passed me the aux\nWrap the cable around my neck and then I stand up on top\nKick the chair from under my feet, now that should tighten the knot, damn\nMy verse snappin' harder than a noose did\nSorry shorty, can't fuck with you, you got them loose lips\nFunny thing about loose lips is how they shake shake\nCatch me on the western and franklin I got the deuce lit\nDoublin' up my cup, but no quali I got the deuce red\nCooling at the crib with some groupies they really cool with\nNo shame when I claim it or rep it I got a rude clip\nPimping hoes in no ho\nI'm shameless to get my crew fed\n\n[Verse 2: Pouya]\nKeep my mind preoccupied, work on myself\nCan't let nobody get into my mind or get intimate with me\nI enter my stealth, playing dip down the block\nGlock cocked way back (Yeah)\nBlood stains dripping all around the face mask (Yeah)\nThrow it in the river now where your case at? (Yeah)\nDevil in my eyes telling me to face that (Yeah)\nI cannot comply to the feds laid back\nFucked up in the head and I bust in her legs\nSo sick to my stomach, laying down in my bed (Bitch)\nContemplating the suicide, thinking like, \"Who am I?\"\nYou from the gutter, bitch I'm from the sewer side\nGot a lifetime in a hard drive\nA hundred racks and it's all mine, can't go for the minimum\nYeah, Yeah, Yeah, whippin' the maximum, maxi pad pussy\nYou drippin' blood out of your ovaries\nTell your ho please to get over me\nKnow it's me when I pull up in the Caddy and hoes wanna photo me\nFollow me, I can show you what you posed to be\nI run my coat, never ride on no coattail\nHoes sell pussy on wholesale (Yeah, yeah, yeah)\nThe cost go low when you desperate\nThe cops ride slow like they creepin' on yo necklace\nI got the block together with no Tetris\nBump this ho right here when you feeling real helpless\nKeep the Glock somewhere near my pelvis\nIn case I gotta get my vengeance, yeah\nThe Lexapro, it can't help me", "year": "2016-05-04"}]}