{"artist": "Young Thug", "songs": [{"year": "2018-12-11", "lyrics": "[Intro]\nAy, the season\nYeah, that's what this is, the season, know what I'm sayin'\nI don't know which one it is though, know what I'm sayin'\nI don't know if it's four, five, six, seven, eight, nine, or fucking ten bitch\n\n[Chorus]\nShe hate me, she bash me (hate me, she bash me)\nThem racks on the backseat (backseat)\nWhat color's the casket?\nWe shootin' 'em and dabbin' (boom boom boom boom)\nWe fed 'em some bath salts\nHis wife on the backseat (bitch)\nThe watch is by Jacob\nWe ridin', we hotter than kerosene (woo)\nDeep inside a nigga bush, who is next? (who?)\nMy jewelry water like a Swisher, Bowflex (swish, swish)\nSlip 'n slide in it, eagles landin' (eagles landing)\nAlka-Seltzer Plus, serve ya granny (serve ya granny nigga)\n\n[Verse 1]\nShe's a slut (bitch)\nShe made me nut (hoe)\nShe runnin' 'round town and she actin' a clown, a lil danger but (ha)\nShe know not to stop a nigga, man she know what I'm kickin' up (kick shit)\nAnd I put it on my baby, man she gon' suck some dick and nuts (dick)\nBitch is you fucking me?\nMade the promise to put you in luxury\nFirst no watch, now your Rollie so close to me\nDidn't I tell you they gon' be ya wannabe?\nYes, you told me that they was gon' honor me\nI got some racks, what you wanna see?\nMake that bitch give me threesomes in DoubleTree\nBetter get yo heart back, ain't no lovin' me\nIf you don't got no rubber, don't fuckin' tease it\nShe get on the top and she fuckin' me\nYou would think she the boy how she fuck and leave\nNo leavin' tomorrow, just fuckin' leave, yeah\nPullin' my pants up and get gone-one, I don't know it yet\nI know some niggas that's never gettin' married and they ridin' with a check\n\n[Chorus]\nShe hate me, she bash me (hate me, she bash me)\nThem racks on the backseat (racks)\nWhat color's the casket? (color's the casket)\nWe shootin' 'em and dabbin' (boom boom boom boom)\nWe fed 'em some bath salts\nHis wife on the backseat (wife on the backseat)\nThe watch is by Jacob\nWe ridin', we hotter than kerosene (SKRRT)\nDeep inside a nigga bush, who is next? (who is next?)\nMy jewelry water like a Swisher, Bowflex (swish)\nSlip 'n slide in it (slip), eagles landin' (hey)\nAlka-Seltzer Plus, serve ya granny (serve ya granny nigga)\n\n[Verse 2]\nI put some beanbags under her eyes, she can't disguise it (ooh)\nKeep that bitch, stop tellin' lies, he's just a fraud guy (ooh)\nBig trailer park, mob ties (hm)\nI got some Muslim brothers, no bean pies\nI'ma pull up to the 'port, go get the baggage\nI'ma drink lean 'til I snore, snore like ya granny\nI been inside the streets, no I can't panic (yeah)\nDo it for my six babies, includin' they family\nI get it and dish it out, yeah\nSmokin' on girl scout\nI pull all her hair out (then what?)\nI go buy another scout for her\nI finally got bands in (bands)\nMy bitch do ya nasty\nBlue bags what my cash in (blue bags)\nFront up in them backends (ya dig?)\n\n[Chorus]\nShe hate me, she bash me (hate me, she bash me)\nThem racks on the backseat (racks on 'em)\nWhat color's the casket? (color's the casket)\nWe shootin' 'em and dabbin' (boom boom boom boom)\nWe fed 'em some bath salts (heh)\nHis wife on the backseat (heh)\nThe watch is by Jacob\nWe ridin', we hotter than kerosene (SKRRT)\nDeep inside a nigga bush, who is next? (who is next?)\nMy jewelry water like a Swisher, Bowflex (swish)\nSlip 'n slide in it (slip), eagles landin' (hey)\nAlka-Seltzer Plus, serve ya granny (serve ya granny nigga)", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png", "album": null, "title": "Back Seat"}]}