{"artist": "Porta", "songs": [{"album": "Equilibrio", "title": "Imperfecto", "image": "https://images.genius.com/aa27426d55342fc5e77da95dffc19068.799x799x1.jpg", "lyrics": "[Estribillo: Kesha]\nI know I'm not perfect\nI know I got issues\nI know that I've got a sordid past\nAnd, yeah, some bad tattoos\nI'm not a model\nI'm not a saint\nI'm sorry but I am just not sorry\n'Cause I swear and 'cause I drink\n\n[Verso 1]\nPero te doy mi palabra que he intentado serlo\nTengo  errores porque estoy pa’ cometerlos\nLlevaba una venda quizás no quería  verlos\nY aquí estoy para cambiarlos, sé bien que yo puedo hacerlo\n\nSiempre compitiendo porque este quiso ser el mejor\nSin pensar en que pensaba el que estaba a mi alrededor\nCuenta cada contra, cada pro, pero yo solo\nSolo soy otro fallo más de Dios\n\nY está claro que no soy ningún santo\nPero caigo y levanto, me ha enseñado el dolor\nAhora ando pensando, el tiempo que perdí odiando\nMe estuve envenenando y olvidando el amor\n\nAhora lo veo desde otra perspectiva\nHe sido un hombre débil, pregúntenle a la sativa\nLa impotencia de buscar y no encontrar salidas\nPero a veces te dará otra oportunidad esta vida\n\n\n[Estribillo: Kesha]\nI know we're all different\nBaby, that's life\nBut all of these differences\nThey make me feel alive\nAnd I've got this question, yeah\nBeen burning through my head\nCan't we all get over ourselves\nAnd just stop talkin' shit?\n\n[Verso 2]\nTengo miedo como todos pero no soy un cobarde\nSiempre  demostré que tengo un par de…\nPerdí el norte, por este arte, me cuesta perdonar-\nMe dicta el tictac, mi vida un Kit-kat punto y aparte\n\nNo todo es cosa de suerte,  si este apuesta no abandona\nCuando sé que quiero verte y el orgullo no perdona\nPuedo desearte la muerte en caliente y me decepciona\nMi mente es fuerte y me grita ¡Joder Christian Reacciona!\n\nNo siempre soy buena persona, lo sé\nPor todo lo que no dije y lo que nunca me callé\nPor esas veces que acabe a golpes sin saber porqué\nPerdónenme, yo sé… Sé bien que me equivoqué\n\nEnamorarte es vivir y compartir un trayecto\nQue a veces tiene fin, yo no me leí el  prospecto\nSi me idealizas por mi aspecto o solo por lo que proyecto\nVete a soñar a otra parte porque yo no soy perfecto\n\n[Estribillo: Kesha]\nI know I'm not perfect\nI know I got issues\nI know that I've got a sordid past\nAnd, yeah, some bad tattoos\nI'm not a model\nI'm not a saint\nI'm sorry but I am just not sorry\n'Cause I swear and 'cause I drink\n\n[Verso 3]\nDejé de apostar por mi, acomodado\nMe quedé  sentado, esperando de brazos cruzados\nSin luz, esa fue mi cruz y aún no lo he olvidado\nLucha por ti, porque no lo va hacer el de al lado\n\nSoy frío y desconfiado por instinto\nMe sobran defectos ¿ves? No somos tan distintos\nCelos por naturaleza que creía extintos\n¿No pensarías que solo es belleza lo que  pinto?\n\nY tú puedes meterte con mi físico\nLa presión social no va a acabar con este músico\nDime tú quien eres pa' juzgarme, va men recuérdamelo\n¿Como vas a conocerme, si aun no me conozco yo?\n\nY aunque siempre intento ser sincero\nNo siempre lo soy tanto, salvo con los que mas quiero\nA veces soy un nueve pero otras un cero\nY casi nunca cumplo las promesas que me hago en enero\n\nTemo decepcionarte, vivo en constante presión\nAún no sé controlar mi carácter en alguna ocasión\nMe acomodé pero acepté la situación\nEl problema fue que siempre intenté retratar en mi la perfección\n\n[Estribillo: Kesha]\nI know I'm not perfect\nI know I got issues\nI know that I've got a sordid past\nAnd, yeah, some bad tattoos\nI'm not a model\nI'm not a saint\nI'm sorry but I am just not sorry\n'Cause I swear and 'cause I drink", "year": "2016-10-21"}]}