{"artist": "Yukmouth", "songs": [{"album": "Thugged Out: The Albulation", "image": "https://images.genius.com/6dcb01d30774cfc257eef87de8bad453.500x500x1.jpg", "year": null, "lyrics": "Verse 1\n\nDear Lord, why did you take my mama?\nThere's so much drama in my life, didn't have to take my mama\nTo make me right\nNow the only time that I can see my mama\nIs after life\nI give up everything to see my mama\nCome back to life\nI even Sacrifice My Life fo mama\nLets reunite\nFuck my wife, fuck this marijuana\nI die tonight\nJuss to get my last sight of mama\nUp in the sky\nMy lil son, he look juss like you mama\nDon't be surprised\nOn the other side he got my fathers eyes\nJesus Christ apologize to my baby son at night for takin his grandmamas\nLife\nMy mama was sweet when we didn't eat\nShe could still make us laugh\nEven though our ass was livin out on the streets\nCryin for weeks prayin to the Messiah\nWhile the evil get, 25 to life fo' mama dyin in fire\nTrapped in a house\nTortured in the worst way\nI got her name tatted across my chest for her birthday\nBut, Lord....\n\nChorus *(Yukmouth)*\n\nI sacrifice my life, juss to bring my mama back to life\nHear me, Lord\nI sacrifice my life, juss to bring my mama back to life\nAll alone in this, world\nI sacrifice my life, juss to bring my mama back to life\nHear me, what?\nI sacrifice my life, juss to bring my mama back to life\n\nVerse 2\n\nDear Lord, why did you take my father?\nThere's so much drama in my life, and now you take my father\nThat shit ain't right\nAll he wanted to do was be a balla\nSniff China white\nAfter, after hours of other ballas\nBettin on the dice\nGive up my life juss to see my father\nLets reunite\nHe was my friend, I was his little potna\nBig brother type\nDidn't give a fuck what my mother like\nWhen y'all broke up\nMe and my father was so fuckin tight\nShe had to show love\nI never knew when I grew up that I be juss like you\nSmokin bud\nSellin drugs, and hustlin juss like you\nNigga I'm a Terminatior 2 of you though\nYou in a grave\nDied from AIDS, some man made shit, an still they hate I'm gettin paid\nI miss my father and my mother\nSo do yo sisters and yo brothers\nMy son he miss his grandmother\nCan't even sit on his grandpas lap for Christmas\nI got the riches\nBut got nobody to share my shit wit\nWhat is this?!\n\nChorus\n\nLord\nI sacrifice my life, juss to bring my father back to life\nHear me, Jahova\nI sacrifice my life, juss to bring my father back to life\nOne mo time. Uh\nI sacrifice my life, juss to bring my father back to life\nGod\nI sacrifice my life, juss to bring my father back to life\n\nVerse 3\n\nWhy did you take my grandma off this earth?\nShe had to be the sweetest woman to ever walk this earth\nIt sho hurts\nMy whole earth, Queen of the Universe\nThis the first time we don't get to celebrate Thanksgiving dinner at\nGrandma's church\nSee, when my mama died she took me in\nEven when my mama was alive she took then, straight put me in\nA spare room in the house to live wit her\nYoung dirty nigga didn't have no money or nothin to give to her\nBut still I lived wit her for 6 years\nThen she died now it's juss tears\nIt seems like I'm the only one in the family left here\nTrapped in this cold-hearted crazy world\nMe, my wife, and my son\nI'm parinoid to have a baby girl\nCuz life is fucked up, because of your prayers, I lived up\nBecame successful\nNow that I got the money it seems that I stress mo'\nSometimes I wanna let go\nIn my life, do Heaven really got a ghetto?\nSacrifice my life\n\n*(Chorus)*\n\nGod\nI sacrifice my life, juss to bring my grandma back to life\nHear me, Lord\nI sacrifice my life, juss to bring my mama back to life\nAll alone in this, world\nI sacrifice my life, juss to bring my father back to life\nYa hear me, God?\nI sacrifice my life, juss to bring my dead potnas to life\n\nOne love\nUh\nFo all my dead potnas (yes)\nFo my relatives, (rest in peace) my mom's, my pop's\nMy grandma (I love you)\nI'ma see y'all when I get there, at the Pearly Gates\nI do this fo my nigga... from the S. and V\nMy nigga SEAG, and my nigga Rappin' Ron\nMy nigga Tupacalypse\nAnd my nigga Biggie Smalls\nEverybody that lost a loved one.... Sacrifice your life\nTo bring 'em back to life\nSacrifice your life\nWe gone see 'em, don't worry\nEternal life.... we see 'em in the next life\nDone deal", "title": "Sacrifice My Life"}]}