{"artist": "E-40", "songs": [{"title": "Big Ballin’ With My Homies", "image": "https://images.genius.com/841113c618ea11b5cbd44a43565e925e.788x768x1.jpg", "album": "Charlie Hustle: The Blueprint of a Self-Made Millionaire", "year": "1999-11-09", "lyrics": "[Chorus]\nBig ballin' with my homies!\nBig ballin' with my homies!\nPosse up!\n\n[Verse 1]\nMe and my Click-alation, at home away from home\nIn the Black Bentley Azura, with the faulty chip phone\nI'm callin up the Mossie, it's time to get bent\nShowcasin and collarpoppin, campaignin like the president\nC-notes, hundred dollar bills\nPlayaz wit bread ridin houses on wheels\nJewels sparklin glistenin gleamin flossy crystal clear\nBaguettes -- hangin from my fist like a chandelier!\nFelines holler, scream, \"Oooh he got the BUMP!!\nSoundin like Godzilla tryin to get up out the TRUNK!!\"\nJealous mark fuckin suckers wanna battle -- that ain't sharp\nWig-splitters that'll comb yo' natural, on my squad\nFuckin em up like that mayne, you know, my.. PANTS saggin\nLook like I done dookied on myself\nBandana, tatted, swingin em sideways\nLivin lavish -- big ballin on tycoon status, BEOTCH!\n\n[Chorus]\nBig ballin' with my homies!\nBig ballin' with my homies!\nPosse up!\n\n[Verse 2]\nKa-ruise... cruuuuuise...\nCruisin' Magazine, a Cutlass on them socks\nRap accumulated papers, so no more slangin rocks\nWe don't walk around like peons, instead we's bout our scrill'\nThe Click-alation family, straight up out The Hill\nEverytime we do this, Cutlass candy on spoke\nPo-Po billy club us cause they think that we sell dope\nI told em that I rap, I told em that I spit\nE'ry year we ship our cars to the Freak-a-Nik\nThugs, timers that own barbershops, tow trucks, and clubs\nHomies, that open up they liquor stores on Sunday\nFor me, bo-nitch, BOOTCH\nHood trojan's boss, players from the sticks\nPocket stuffin, some of the homies hustlin\nSome of my playaz is pimps, some of the homies strugglin\nBut none of my folks are simps, marks, nothin of that there magnitude\nSaps, sarches got me twisted, what ch'all do?\nGot me twisted with your dude BEOTCH, BEOTCH!\n\n[Chorus]\nBig ballin' with my homies!\nBig ballin' with my homies!\nPosse up!\n\n[Verse 3]\nRrrollin with the Mossie, we never get bored\nThere's not another Click, with more points scored\nThe breezies by the college, was lookin for a lift\nTryin to ride in first class and them haters wanna TRIP\nCause I never liked a sucker, who beat up on they broad\nIf you're lackin on your mackin then she's rollin with the squad\nMossie to the house party, girlies come in twos\nNo conversation needed, automatic pick and choose\nTalkin up under your brisneath, hot air?\nComin off like you some sort of hellafied ass ninja - but youse a square\nWhatchu doin Charlie? Just videotapin myself grindin, Candid Camera\nCoonin' wit mo' scratch den dandra turf boomin'\n\n[Chorus]\nBig ballin' with my homies!\nBig ballin' with my homies!\nPosse up!"}]}