{"artist": "Will Smith", "songs": [{"year": "2002-06-25", "lyrics": "[Verse 1]\nYo, yo forget the club\nToday we play in the block\nIt's goin' down and it's blazzin' hot\nJeff pop the new CD turn tables joints\nYou just got to get the amps from Boogie\nGet the van from Rock and then\nCall up Ishkabibble's, Jim's and Pat's\nAnd tell 'em we need cheese steaks for like, 300 cats\nAnd yo, make sure it's hot or else I'm sendin' 'em back\nAnd get my mic right\nIf I get hyped, I might rap\nThen take the speakers find a good spot\nSubs on the bottom, tweeters up top\nYo, you know where little John lives on the corner\nThe extension cord'll run perfectly to his crib\nAnd then tell Officer Mike to barricade the block\nRegardless what car you got, leave it up top\nYou wanna come, you got to come on your feet\nAin't nothin' like havin' a party\nWhen it's out in the street, come on\n\n[Hook- Tra-Knox]\nNine o'clock I'mma call my crew\nAnd ten o'clock we gonna roll on through\nI don't know what you gon do\nBut whatever you do, hit the block party tonight\n\nAll the ladies rollin' up with friends\nAnd don't be late or you won't get in\nOur party's packed from begining to end\nEverybody tell a friend that the block party's tonight\n\n[Verse 2]\nIt's ain't nothin' like\nHavin' a party on the block\nWhen everybody know everybody on the block\nAnd everybody on the block\nCome to the party on the block\nAnd when the sun drop, (we don't stop)\nFunny how fast they travel the word\nA dozen divas from North Philly drove in when they heard\nThat it's a block party down in West Philly\nCome block party with Jeff and Big Willy\nStand back, everybody come to see the man rap\nJeff got it... jam packed\nEverybody, hands in the air\n(Just get your hands in the air!)\nYo Philly! (dat's where the party's at!)\nUuh, D.C. y'all! (dat's where the party's at!)\nA-T-L (dat's where the party's at!)\nWest side! (dat's where the party's at!)\nMid-west y'all (dat's where the party's at!)\nDirty South now (dat's where the party's at!)\nYo, I can't hear y'all! (dat's where the party's at!)\nWhere ever we at! (dat's where the party's at!)\n\n[Hook]\n\n[Verse 3]\nYo, yo and when the sun drop\nBack in Philly that don't mean that the fun stop\nAll it mean is that it's time to turn the lights on\nAll day long I been plottin' on this nice john\nIt's ten o'clock now Jeff is tryin' to hype me\nWill the Fresh Prince come up to the mic please?\nHear the crowd cheer, broguht a little smile out\nMic check, one, two- I'm 'bout to wild out\nI know he's old, but\nMabye it's a slight chance\nI could get my brother hype\nMake him break dance- ha, maybe not\nLemme get the crowd jumpin'\nLet me him 'em with the brand new funk or something\nI'm like Rob Base- I wanna rock right now\nY'all know who run the block right now\nAll we need is a mic and a beat\nAnd a couple of speakers\nAnd some turn tables out in the street, come on!\n\n[Hook]", "image": "https://images.genius.com/76048d37e73e3e383749923c401de4f0.1000x1000x1.jpg", "album": "Born to Reign", "title": "Block Party"}]}