{"songs": [{"album": "Jay Stay Paid", "year": "2009-06-02", "title": "Blood Sport", "image": "https://images.genius.com/55b48c8489e563b502b5eabc72839d31.1000x1000x1.jpg", "lyrics": "[Intro: Pete Rock]\nFM, Jay Stay Paid\nThe hottest hour in hip-hop, you know who it is baby\nThe boy Pete Rock\nAnd it's the revenge of Pay Jay Productions muh'fuckers\n\n[Lil' Fame]\n{*scratched in background: \"Yeah!\"*}\nAnd you don't stop\nLil' Fame in the house, you don't stop\nJ Dilla rock on you don't stop\nYou don't stop, and you don't stop {*BOMB!*}\n\n[Chorus: Lil' Fame]\nLil' Fame in the house, you don't stop {*BOMB!*}\nJ Dilla rock on you don't stop {*BOMB!*}\nYou don't stop {*BOMB!*} you don't stop {*BOMB!*}\n\n[Lil' Fame]\nIt's like that and uh, it's like that and uh\nUh-huh~! You fuckin with the Marxmen, and uh\nYou fuck around and get left popped, in your bandana\nThis is Mo. P's, A-B-G, Any Body Get-It\nFrom the moment I walked in (we go off top)\nMy presence is felt, I'm light years ahead of myself\nSee that ground that you stand Duke I'll put you under that\nCalm the fuck down homeboy you ain't a Thundercat\nThink you the illest nigga, I'ma tell you Fame realer\nFame iller, now \"Ante Up\" bitch and pay Dilla\nCause if heaven was a mile away (yeahhhhh)\nI'd jump in the V to come see ya, me and Termanology\n(That's whattup though!) And you don't stop {*BOMB!*}\n\n[Chorus]\n{\"Too damn dough! Yeah\"} Dilla\nYeah, J Dilla whattup... WHATTUP~?!\n\n[Interlude]\nHolla look back at your mans dog, 3-1-3, 4-4-4-4\n4-2-8, peace\n{\"Hands up\"} Get up! {*scratched*} C'mon!\nC'mon kid, c'mon kid, c'mon yo\n\n[Lil' Fame]\nFor the year two thousand and nine\nIt's the same old shit, niggas out here out on the grind\nI run with them big shots, who let off four shots\nLet a full clip go as soon as soon as the ball drop\nIt's a Marxmen Cinema team that's, seen this\nHit a nigga with a package quick fast, sling this\nWe'll, break yo' ass up, stomp you down\nIt's Brownsville motherfucker we don't compromise\nWe handle them bats like A-Rod, go 'head and play hard\nAnd find out what kind of bullshit we on\nIt's the world's, most, dangerous\nGlorious victorious warriors from the left lung of the 'Ville\nChill, before we send that forth back at ya\n{*ka-klow, pow*} Couple of slugs tossed back at ya\nCause y'all know, like I know, who game realest\nIt's the Fame and the Glory, but first pay Dilla\nMotherfucker! {*scratched: \"Hands up\" to end*}"}], "artist": "J Dilla"}