{"songs": [{"image": "https://images.genius.com/b004781b362cd21da695699a9328946c.600x600x1.jpg", "year": "2019-06-21", "title": "Every Time You Go", "album": "The Dude with the Strap Back Dad Hat", "lyrics": "[Intro]\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\n(REPEAT)\n\n[Verse 1]\nFrom the bus, to the car, to the jet way\nIn a rush, I be gone, til' the next day\nCan’t say, I'll be here for long cuz I can't stay\nI gotta run, gotta soar, like it’s Leg Day\nYes Way! No Shot! Won't Stop\nDon't waste time, judges give out a whole lot\nSome people globe trot, just for the back drop\nGotta take a snap shot, flickin' EVERY TIME YOU GO\nYeah, I know, Emoji With The Eye Roll\nWhen I say I miss you but I'm missin' where did I go?\nShe already stressed, and I ain't tryna fight\nBut when she think you left, it's hard to make it right\nThey brake at yellow lights I’m running em’\nYa'll throw shade and it be night, I’m sonning em'\nCuz I'm like none of em', you already know\nAnd she say it just ain’t the same, EVERY TIME YOU GO, NO!\n\n[Chorus]\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\n\n[Verse 2]\nFrom the curb, to the interstate express way\nTo the top, I'm only taking my best traits\nPutting light on what I got inside, that's a X-Ray\nX-Games, she on board, might get a leg sprain\nTryna give me a night to be rememembered, So that\nBefore I leave I might just reconsider\nShe told me she sent a video to my phone\nYou can watch that alone, baby, (EVERY TIME YOU GO)\nWoah! My mind might've changed\nIf only I didn't have my mind on my change\nWit' my eyes on the game, I was raised sitting court side\nUsed to reside on the Koch Arena Northside\nNow it's NYFW with the Bowtie\nSo Fresh, So Fly, wit' the Blow Dry\nJust keep showin' real ones love\nLet em' know where you from! (EVERY TIME YOU GO) Yeah!\n\n[Chorus]\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\nOh oh ohohoh\nOh oh ohohoh\nEvery Time You Go\n(REPEAT)"}], "artist": "XV"}