{"songs": [{"album": null, "image": "https://images.genius.com/edd799e93c33bcfaf402b8c8074f87a3.500x500x1.jpg", "year": "2018-02-28", "title": "Kash", "lyrics": "[Introduction: therealjovanchy]\nWe live from the pits, ya' dig?\nIt's Jovanchy in this bitch with Tay-K from the mothafuckin' Boof kids\nAKA Daytona Boyz Fast Life\nNyewm, nyewm, nyewm\nPew, pew, pew\nPffft, eeeeee!\n\n[Hook: Tay-K]\nI get the cash, I get the cash, yuh\nI get the cash, cash, I get the cash, yuh\nI do the dash, ice on my splash, I find ya' stash, yuh\nBallin' like Nash, I get the cash, I get the cash, yuh\nI get the cash, I get the ca-ca-cash\nI get the cash, I get the ca-ca-cash\nBallin' like Nash, I found ya' stash, I get the cash, yuh\nI do the dash, I do the dash, I get the cash, yuh\n\n[Verse 1: Tay-k]\nGo get the bag, in here the strap, don't get attacked (yuh)\nI know that he scared, I look at his eyes, I looked at his lash (I look at his lash)\nI might just shoot, I might just hit, and never look back (yuh)\nI just might buy, I just might jug, or I just might jack (yuh)\nI'm at the trap, I'm in the back and I'm wearing them sacks, yuh\nShe's calling my trap phone, she's calling my iPhone, she want to have sex (yuh)\nI can't even flex, yuh, ballin' like Nash (yuh)\nI need the racks, I need the racks, I need the cash (yuh)\n(I get the what?)\n\n[Hook: Tay-K]\nI get the cash, I get the cash, yuh\nI get the cash, cash, I get the cash, yuh\nI do the dash, ice on my splash, I find ya' stash, yuh\nBallin' like Nash, I get the cash, I get the cash, yuh\nI get the cash, I get the ca-ca-cash\nI get the cash, I get the ca-ca-cash\nBallin' like Nash, I found ya' cash, I get the cash, yuh\nI do the dash, I do the dash, I get the cash, yuh\n\n[Verse 2: Jaymoney]\nCountin' the weight, ya' niggas ain't safe, I'm hittin' the safe (who hittin' the safe?)\nYou niggas ain't strap, stay in your place, don't come out the gate (don't come out the gate)\nNo face, no case, you made a mistake, call and I wait (hahaha)\nIt ain't no debate, we need pay, today ain't your day (nah)\nRacks in my pocket, just blew 20K\nBeen flashing all day, what you trying to say?\nKnow we did it the hard way, know we did it our way\nBallin' like Penny Hardaway, Bruce Wayne shit the hard way\nPlay your part today, his cash card is ayy\nPassing the gas, I'm spazzing yo' ass\nHop out the coupe, get dead on his ass\nPass me the bag, or pass me the mag\nYou know where he at, you know all he had\nWhere was the cash? That paparazzi was dead on yo ass\nSee cameras flash, just for a band\nThat was the end, and that's all I'm sayin'\nBands, bands bitch, bands\nBands, bitch, bands, bands, bands"}], "artist": "Tay-K"}