{"songs": [{"image": "https://images.genius.com/8ab5eeecff25b17cb0aada47b6f1cc02.600x600x1.jpg", "lyrics": "[Intro]\n\n[Hook]\nThese are the things that I think\nWhen I've had a bottle of red wine to drink\nAnd I hope another dream don't have to fall short\nJust lounging in my basketball shorts\n\n\n[Verse 1]\nLook, I've finally married someone, I'm in love, I'm not alone\nBut marriage has some struggles of its own\nAnd that creates a problem cause if I go and put that in my lyrics then my wife will be the first person to hear it\nI married my best friend. I've got the best friends and a stack of photos covered in some dust particles and some dead skin\nSometimes I think about the baby that I used to be and how it's all just ultimately leading to my eulogy\nYou see, life hurts like a bitch sometimes. I mean sometimes, I hate the fuckin' sunshine so I go get enough wine at one time to hide up in my confines and unwind while vibin' to some Sublime\nI just want to take my mind off all this angry fan mail accusing me of selling out, telling me I ran stale\nGetting hurt by people that I'm trying to please, apparently I need to rap while on the flying trapeze\nJeez, I bought another lottery ticket tonight and out the six numbers I picked not one single digit was right\nBut life's been so stressful that I'll be honest, the last thing I need is a hundred million dollars\n\n[Hook]\nThese are the things that I think\nWhen I've had two bottles of red wine to drink\nAnd I hope another dream don't have to fall short\nJust lounging in my Jayhawks basketball shorts\n\n[Verse 2]\nThese days my dad is my friend\nI mean last night at the we had martinis with gin and he told me that he thinks Beyonce is a 9.5- maybe a 10, and she has really pretty skin, and I smiled\nI like smiling. I like fantasizing about the day I'm gonna own my own island\nI like fantasizing about the day that this anxiety won't constantly be turning all my skies gray\nOver-analyitcal, constantly self-critical, I don't need three wishes, just one: make me invisible\nCause I remember days I'd get on stage to a crowd of twenty\nPeople and only seven of them paid\nRich kids with college degrees coming up and saying, \"Fuck fame and money. Never follow 'em please\nI love your music, I downloaded all of it free. Why would you care? You're a rap star, your profit is deep.\"\nJeez, life hurts like a bitch but sometimes I love it. Seriously, sometimes I look at my life and straight love it. But only on the days I close my eyes and say fuck it\n\n\n[Hook]\nThese are the things that I think\nWhen I've had two bottles of red wine to drink\nAnd I hope another dream don't have to fall short\nJust lounging in my Jayhawks basketball shorts\n\n\n[Bridge]\nAnd I'm hoping for and I'm hoping for tomorrow\nCause paradise is found in a bottle\nParadise is found in a bottle, yes it is\nAnd the woman on the plane in front of me, she keeps farting and it smells so bad that I can't take a nap\nI think she's gotta take a crap but that's neither here nor there\nHere we go\n\n\n[Verse 3]\nLook man, I'm just searching for a pot of gold\nI fear the day that people say my heart has gotten cold\nStaring at my friends at Guitar Center, I am your broken-hearted, scarred, mentor\nOh shit, I'm gonna have a baby in like ten days\nHe's gonna be my little prince, I can't wait\nLife is intense and you know I'm gonna take a knife when I glimpse\n\n[Hook ]\nThese are the things that I think when I've had a bottle of red wine to drink\nAnd I hope another dream don't have to fall short when I'm lounging in my basketball shorts\nWait, no, no\nThese are the things that I think when I've had two bottles of red wine to drink\nAnd I hope another dream don't have to fall short when I'm lounging in my Jayhawks basketball shorts. That's KU, by the way\nThese are the things that I think when I've had three bottles of red wine to drink\nAnd I want a couple LA tacos and some motherfucking Roscoe's, always\nThese are the things that I think when I've had five bottles of red wine to drink\nAnd that's way too much wine to drink\n\n[Outro]", "year": "2014-01-16", "album": "Postcards From Kansas City", "title": "Basketball Shorts"}], "artist": "Mac Lethal"}