{"artist": "Problem", "songs": [{"album": "The Separation", "title": "Get Naked", "image": "https://s3.amazonaws.com/rapgenius/Problem_The_Separation-front-large.jpg", "lyrics": "[Intro:]\nAye Problem\nI don't really be hatin on the club in LA like that\nHuh? What?\nNigga I run that shit\nI'm just fuckin with you\nWhat?\nI know exactly what to say to get you hot though\n\n[Verse 1]\nNigga you's a bitch, that's on my grandpa\nBitch nigga go change yo tampon\nYou forgetting it, nigga put some money up\nAin't worked out in weeks but I'm still in the club\nWith my tummy out like fuck it... I'm the nigga\nMy dick bigger, he ain't all in my level\nWeed flowin through my brain\nFingers in the sky, bangin my game\nNigga like what? Get like this\nThat means I'm either on the radio or in your hoe\nLove my squad, love getting paid\nLining up fades, sock a nigga out his J's\nThis for the hood, this for my babies\nAdidas and a beeper, this is for the 80's\nThat's just on the reefer, VIP blazing\nAsian eyed, who wanna type this ride? What?\n\n[Hook]\nGet naked\nBitch get naked\nGet naked\nBitch get naked\nBitch get naked\n\n\n[Verse 2]\nFuck it, I'm a come in on the claps\nHit hit her bare doggie, and shot it on her back\nAnd bounced like a froggy, and dipped like a mac\nThis molly here and smack, got me rollin like a Lac\nI need a TD, goin too hard\nBut like a CB, you goin off 2 bars\nWhere pon at, I know you probably drunk\nMy ex just texted me, and I know she wanna fuck\nAnd really I don't blame her cause bitch I do it\nD2B, bitch I know it\nIn the spot posin, feelin like I am that nigga\nHoe, pull out yo phone, Instagram a nigga\n\n\n[Hook]\n\n\n[Verse 3]\nYea I got a gang of kids, fuck it\nI take care of and they badass\nShout out to my baby mommas with they mad asses\nThanks for putting up with me and all my bad habits\nNow fuck that nice shit, back to the business\nKeep my back to the haters, only after the riches\nBout the dollars round here, all her actions are sick\n'Cause all my niggas round me was with me in them trenches\nWuddup?\nWaiting for the jury and the flight\nYou shooting dice, try to get em tonight\nCruise sure feels, just go ahead and push the button\nLyin to these hoes, sayin anything to fuck em\nCompton California, don't ever disrespect it\nLove my city, I'm a yell in every record\nLove my gang I'm a yell in every record\nYou know we the niggas so bitch get naked", "year": "2013-06-13"}]}