{"artist": "Bas", "songs": [{"lyrics": "[Intro: Sample]\nDo you still believe in love?\nOr do you like drugs?\n\n[Verse 1: Bas]\nRan into a night owl rollin' White Owls\nGirl it's been awhile since I hit a White Owl\nI'm with it though, she a centerfold\nBig ol' blunt look like tentacles\nShe strip in Europe, Interpol\nDon't remember her in her clothes\nI fucked her friend, damn they was close\nLet's reunite, let's get em close\nHit 'em twice in a row, hit a flight, and I'm ghost\nThat's the last time I seen her though\nShe be gettin' too eager, ho\nStamp it like it's my visa\nCheefin' off of these berries\nWhen the world gets heavy and it hurts to carry\nI'm her Midnight Mercenary, Fiend\n\n[Chorus: Bas]\nIt's lit, feel the buzz?\nThat's a half? Shit it was\nIt's lit, feel the buzz?\nIt's lit, feel the buzz?\n\n[Verse 2: Bas]\nShe take me to a place that I never would discover\nMight never have another, so I had to fuck her\nReach into my pockets, damn I ain't got a rubber\nSee my nigga Ron like L. Ron Hubbard, he be outta space\nSay he got a case of straps at the back of the hotel cupboard\nRoom 508, check by the safe, she say \"Boy you got it made\nDo you got a cape?\", I ain't with the games ma, do I gotta wait?\nI'm quite impatient, intoxication got me feelin' like procreating\nGirl I'm the baker, you surely caking\nStand back, catch my amazing graces\nPhoto finish and fornication\nPhoto finish and fornication, fiend\n\n[Chorus: Bas]\nIt's lit, feel the buzz?\nThat's a half? Shit it was\nIt's lit, feel the buzz?\nIt's lit, feel the buzz?\n\n[Bridge: KQuick]\nFeel the buzz\nCan you feel the buzz?\nFeel the buzz, ohh-whoa, yeah\nDo you believe in love?\nWhat's your drug? What's your drug?\nOhh-whoa\n\n[Interlude: J. Cole]\nTake it all the way from the beginning\nYea, yea, yea\nNow comes the question of which intro do you use?\nDo you use this intro or the other intro I was talkin' on?\nBut, then that lets people know I had more than one take\nSo maybe we should just not use this and use the other intro\nSo people would think I just took it straight through\nYea, let's do that...\n\n[Verse 3: J. Cole]\nYou'd be surprised how many truths you can hide in flows\nI'm listenin' to this beat with my eyelids closed\nThoughts keep flashin' and I keep laughin\nI never thought that I would fuck Irish hoes\nMaybe Asian bitches or Caucasian bitches\nRemember when I got to New York I was lost\nBecause all I ever saw was Jamaican bitches\nI ain't barely know what Jamrock was\nLil' country nigga God damn I was\nTo you niggas talkin online until you make it this high\nThen you could never understand this buzz, well\nMaybe if you put yourself in the shoes\nOf a nigga comin' straight out the South\nNo gold grill just a east coast feel\nAnd a set of crooked teeth in his mouth\nMake them hoes bounce, that can't get enough\nNiggas say I made it I ain't make it enough\nMan hang that nigga, you a real lame ass nigga\nIf you ain't got my tape in your truck\nCole, um world don't you forget that\nI think I lost my mind round the same time I lost my six pack\nBut no sit-ups for me, long as my dick still get up for me\nLong as a ho still give up for me\nShe usually charge but she get us for free\nWoah, that's TMI, lil' something like TMZ\nScared of the days you'll be seeing me\nCause my girl do not play, coach DNP\nThat's something for the hoop fans\nJust copped her the coupe man\nNo drop top but a slot on the roof that can slide out\nAnd get a little sun while you ride out\nCed on the beat let me vibe out\nWe was 15 with a ASR up in my house\nWritin' rhymes out, momma made it happen\nCould've been a lawyer but I made it rappin'\nHe made it rappin', now at the shows he the main attraction\nAnother shot of Henny so I'm faded askin'\nHow long do this drug called fame be lastin'?\n(It's lit, feel the buzz?)\nAnother shot of Henny so I'm faded askin'\nHow long do this drug called fame be lastin'?\nThat's deep\n\n[Outro: Bas]\nFeel the buzz?\nIt's lit, feel the buzz?\nFeel the buzz?", "image": "https://images.genius.com/39c68731f53df590ac095e6694ceb1c8.500x500x1.jpg", "year": "2013-06-17", "title": "Lit", "album": "Quarter Water Raised Me Vol. II"}]}