{"songs": [{"image": "https://images.genius.com/43337b48a7c24e79508404e83578e1c0.500x500x1.jpg", "lyrics": "[ VERSE 1 ]\nI been tryin to flip the script and take this rap thing to the next page\nBut the federalies got me travellin on _Con Air_ like I'm Nicholas Cage\nDid 4 years, 4 months in the feds, but couldn't get no peace\nReleased from the belly of the beast, but the 'ralies put a nigga on a leash\nThe rules and regulations they inflicted, had me restricted, paroled\nKept me from blowin bomb, knowin I'm hooked and addicted for sho'\nAnd how am I to be an MC when I can't get my travel on?\nCan't bring no babby home, 'cause every morning I'm gettin sweated by Babylon\nThe only way out is to max out and give these fools back they lease\nFuck parole, probation, piss test and supervised release\nI'mma bring a calendar, bounce, blow up like Chernobyl\nKirk out and get mobile and do this thing global\nWorldwide rompin', stompin' in other nations\nBlowin' bomb with Jamaicans, and sippin' Dom with them Haitians\nKickin' major flows, have Asian hoes, playin' the Romp like it's for eternity\nKick gravel, travel, see what they know about me in Werbach, Germany\n\n[ Hook (Repeat 2X): Dubee ]\nWe be global\nTouch land in that sand over the seas\nBlew off a couple of G's, releasin' verbal telekinese, for sheez\nClickalate with players, under the stairs, to the Himalayas\nKinda thick, layer for layer\n\n[ VERSE 2 ]\nSometimes I sit and reminisce about life in '87\nWhen I was doin' my thug thang, brain ten miles higher than heaven\nOne-track minded, blinded by the game and quick change\nNot knowin across the way-way niggas were doin' big thangs\nAnd it's a shame\nCause before I hit the F-E-D's\nI didn't know about them niggas in Cuba and them sisters in Belize\nNow I'm curious: Is Belizan pussy the bomb?\nWhen they blow, do they hum, and how quick do they come?\nBoy, it's time to hit the friendly skies and fly like a seagull\nPost up in spots where the pot's good and legal\nEat tacos in Mexico with cats named Flaco\nAnd catch a red-eye flight the same night to Morocco\nTop-nacho, chasin' superbad scrilla fiends\nThen bounce to the Phillipines and get mo' head than guillotines\nBoy, life ain't nothin but fat checks and head sex\nSo I'mma get mobile, stay global like FedEx\n\n[ Hook ]\n\n[ VERSE 3 ]\nI was a cell dweller, eatin' Top Ramen and sardines\nNow it's Taiwanese Japanese cuisine\nBarefooted, fitted, sippin' on sake\nBlow on big hashish while I feast on teriyaki\nInternational is how I'm smashin', hoe\nA cutthroat nigga that will blast and roll\nI took a trip to Queens to see Jazz and Preme\nThey had a nigga blowin' brown, said it wasn't no green\nBut that ain't no thang, cause in Tacoma\nI blew bomb 'til I was in a coma\nAnd in Seattle my partner Chilly Chill\nGot that purple leaf dank that really real\nI'm global, boy, I be travellin'\nGettin' further in the air like a javelin\nChirpitch, kirkitch, finna bounce to St. Croix\nMac Dre, global, holler at your boy\n\n[ Hook ]", "year": "1999-09-28", "album": "Rapper Gone Bad", "title": "Global"}], "artist": "Mac Dre"}