{"artist": "G Herbo", "songs": [{"title": "Fuck It Tho", "album": "Strictly 4 My Fans 2: Road To Humble Beast Playlist", "year": "2017-09-15", "image": "https://images.genius.com/af4a4a1c477497275ed0710c993ab714.710x710x1.jpg", "lyrics": "[Intro]\nI've Just Been Waking Up To All My Problems And Shit\nJust Like Fuck It, Fuck Everything\nNot Even On No Nonchalant Shit. Just Like Alright, I'm A Let Life Deal With Itself (Fuck that Shit Man)\nI Ain't Forcing Shit (You Know)\nIt Is What It Is\n& Everything Happens For A Reason If You Ask Me\nG Herbo, Check It\n\n[Verse 1]\nLife Priceless, Life Precious\n100 Fuck Ups From My Decisions Taught Life Lessons\nIt Ain't Genuine & Authentic. No I Don't Respect It\nIf That Man Action Raises Suspicion, Don't Neglect It\nTranslate My Situation So You Get The Messages\nLet It Digest\nYou Might Just Feel The Anger In My Chest\nSo Much Stress\nI Just Play My Game Like Chess\nStay Humble And Bless\nGod Handle The Rest, But I Still Keep The Weapon on Me\nNone The Less\nSo I'm I Still Able To Say I'm Watch By The Eyes Of The Lord?\nMight As Well Put Up A Fight If I'm Gon Die By The Sword\nIt's Roll Or Get Rolled Over And The Street Choice Is Yours\nThat's The Drama I Been Tryna Avoid\nBut Fuck It Though\n\n[Hook]\nBlew A Quarter Ticket 'fore I Turned 20, Fuck It Though\nFuck Up 20, 30 Grand Wit My Mans, Fuck It Though\nAnd Of Course I've Seen My Last, Bounce Back Like Fuck It Though\nTryna Run My Bands Up And Always Go Fucking Broke\nMy Mother Ran Them Bills Alone Like Ak But Fuck It Though\n20, 30k A Show Did 8 Straight Got 30 More\nMaking Love To The Money, Count It Up And Fucked It Though\nAnd she Say She Like Me As A Person, I Don't Trust Her Though\n\n[Verse 2]\nSpend A Check Like Fuck It Though\nBut I Can't Lie, I Love It Though\nHad 200, Made 250, Got 300 More\nStarted Rapping I Was 15, I was 18 On The Road\nI Remember I Had Funny Money, It Was Running Low\nI Can't Lie On Any Track I Rap, No I'm Not One Of Those\nIt Was Nice Thought To Myself I Felt Like I Was Running Cold\nMama Bills And Auntie Bills, Still In The Field, Not In The Hills\nHow The Fuck I'm Feeling Broke? & I Just Did A 100 Shows\nSpend Nights In The Trap Selling Coke\nMaking Diamonds In The Hood Wrapping Soap\nI'm Just Tryna Re-up Fuck It Though\nI'm Just Tryna Be Up Fuck It Though\nAnd My Grandmom Died A Year Ago Before She Did I Remember She Told Me\n\"Go Platinum, We Don't Do Gold\" Now My Heart So Cold\nAnd My Concerts Sold Nigga\n\n[Hook]\nBlew A Quarter Ticket Fore I Turned 20, Fuck It Though\nFuck Up 20, 30 Grand Wit My Mans, Fuck It Though\nAnd Of Course I've Seen My Last, Bounce Back Like Fuck It Though\nTryna Run My Bands Up And Always Go Fucking Broke\nMy Mother Ran Them Bills Alone Like Ak But Fuck It Though\n20, 30k A Show Did 8 Straight Got 30 More\nMaking Love To The Money, Count It Up And Fucked It Though\nAnd She Say She Like Me As A Person, I Don't Trust Her Though"}]}