{"artist": "Ice Cube", "songs": [{"title": "Endangered Species (Tales from the Darkside)", "lyrics": "[Intro: Female News Reporter]\n\"At the bottom of our news tonight, there's been a new animal aimed at falling off the face of our Earth. Yes, young black teenagers are reported to be the oldest, and the newest, creatures added to the endangered species list. As of now, no efforts have been made to preserve the Blacks. When asked why, a top top law official adds, 'Because they make good game'\"\n\n(A young nigga got it bad cause I'm brown)\n\n[Verse 1: Ice Cube]\nPeace? Hahaha, don't make me laugh!\nAll I hear is motherfuckers rappin' succotash\nLivin' large, tellin' me to get out the gang\nI'm a nigga, gotta live by the trigga\nHow the fuck do you figure\nThat I can say \"Peace\" and the gunshots will cease?\nEvery cop killer goes ignored\nThey just send another nigga to the morgue\nA point scored, they could give a fuck about us\nThey rather catch us with guns and white powder\nIf I was old, they'd probably be a friend of me\nSince I'm young, they consider me the enemy\nThey kill ten of me to get the job correct\nTo serve, protect, and break a nigga's neck\nCuz I'm the one with the trunk of funk\nAnd \"Fuck tha Police\" in the tape deck\nYou should listen to me cuz there's more to see\nCall my neighborhood a ghetto cuz it houses minorities\nThe other color don't know you can run but not hide\nThese are tales from the darkside\n\n[Interlude: Chuck D + sample]\nAll of us are endangered, damn!\n(A young nigga got it bad cause I'm brown)\n(A young nigga got it bad cause I'm brown)\n\n[Verse 2: Ice Cube]\nYou wanna free Africa? I'll stare at ya\nCuz we ain't got it too good in America\nI can't fuck with them overseas\nMy homeboy died over keys\nOf cocaine, it was plain and simple\nThe 9mm went (buck) to the temple\n(Buck, buck, buck) was the sound I put the bitch down\nAnd ran to the schoolyard bathroom\nLooked in the trash can, yo it had room\nSo I ducked my ass in it for a minute\nCovered with trash I had to lay back\nMad as fuck, thinkin' about the payback\nTonight the crew gonna have a little fun\nI went home and cut the barrel of my shotgun\nIt's gettin' critical - I stole a 5.0\nI let it go - drive real slow\nI yelled out \"Ice Cube, sucka\"\nThe shotgun kicked, and it murdered motherfuckers\nI told you last album\n\"When I got a sawed-off, bodies are hauled off\"\nIts a shame, that niggas die young\nBut to the light side it don't matter none\nIt'll be a drive by homicide\nBut to me its just another tale from the darkside\n\n[Interlude]\n[Sampled guitar riff]\n\n[Verse 3: Chuck D]\nStanding in the middle of war, in the middle we flex\nWhen we die, we won't make Jet\nEbony can't see to the light side\nThe term they apply to us is a nigga\nCall it what you want, cause I'm comin’ from the corner\nSame applies to a Ph.D\nWho's black - don't wanna roll - sells his soul\nWatch his head go rollin’\nWho the fuck are they foolin’?\nNobody knows, but I suppose the color of my clothes\nMatches the color of the one on my face\nAs they wonder whats under my waist\n(Standin' on the verge) of them gettin’ brown\nThat's a fact, got a fear of the bozack\nRun, run, run, their ass off, they can not hide\nYeah Cube, they can't fuck with the darkside!", "image": "https://images.genius.com/1cb382d2d9fb4a9bfa94e3074c1aa220.1000x1000x1.jpg", "album": "AmeriKKKa’s Most Wanted", "year": "1990-05-16"}]}