{"artist": "Philthy Rich", "songs": [{"album": "Fake Love (Deluxe Version)", "title": "Intro M.A.C", "image": "https://images.genius.com/4b47b68360dac3b50315c2d634ecaf4b.939x939x1.jpg", "lyrics": "[Skit: M.A.C. Blast]\nHappenin', mayne?\nM.A.C.-motherfuckin’-B-b-b-last, nigga\nYoung god built to last, man\nGo get them Political Ties and Funk Season 4, man, if you need that starter kit to that izm, mayne\n'Cause I ain't goin’ backwards\nI'm only goin' forward with this wisdom, mayne\nIf you don't know\nI'm a 100% game member, nigga\nThat's G-A-M-E member\nMy bruh Philthy, 100% pushin' the same visual and audio of the same game we standin' on, nigga\nThe game is all we know, folks\nAnd since we know the game\nWe know there’s viruses that can affect the game\nAnd one of them fuckin’ viruses is fake love, nigga\nNow it's levels to this fake love shit\nSo please excuse me ’cause this conversation's really way overdue\nYou know what I'm sayin'?\nI might get excited, you know what I’m sayin'?\nNow, we gon' start with the seed effect love\nThe fake love you niggas and bitches got for your motherfuckin' self\nAnd this motherfuckin' culture we stand on, nigga\nFake love is most definitely snitchin'\nSince our royal black blood stained these American beaches\nSnitchin' has been a fuckin' sin\nBut when you got fake love for yourself\nWhat you stand on\nIn this extraordinary culture, hmph\nYour love is no longer unconditional, nigga\nIt becomes weak\nUnloyal\nYou understand?\nYou be gettin' irrationalized, man\nFake as fuck\nBoom, fake love, game over, nigga\nYou know what I'm sayin'?\nWith no love for yourself, hmph\nYou can't have love for your folks\nYou can't have love for these motherfuckin' streets\nNow as you sit in that motherfuckin' room of choices\nThe homicide room\nWhere men either build divine character\nOr destroy they value system by bowin' down to the slave master's Frankenstein\nYour fake love gon' blossom\nUntil have you tellin' on the Underground Railroad, nigga\nAnd help indict Harriet Tubman, nigga\nAnd Frederick Douglass of the black community today, you bitch\nFake ass nigga\nKnow what I'm sayin'?\nNow that's the first level of fake love, you know what I'm sayin'?\nI'ma touch on the next level in a future interlude, you know what I'm sayin'?\nBut until then, nigga\nYou know what it is, mayne\nSem City in the house, hmph\nF.O.D. and Hustlanity, mayne\nWhere young gods BBS this poetry, mayne\nRepresent strength and loyalty, mayne\nBap bap!\nNigga, no love before fake love, nigga\nYou know what it is", "year": "2018-12-07"}]}