{"songs": [{"album": "Memoirs of a Curb Server", "year": "2012-07-10", "title": "She the Type", "image": "https://images.genius.com/23939e988367d0d69a983fe70c013d51.500x454x1.jpg", "lyrics": "[Hook: Big K.R.I.T.]\nYeah she talkin' real good, she a certified pro\nShe a monkey on the pole, she will never let it go\nTossing money in the air, once she get it off the flo'\nShe an all night, super type porno show\nShe a freak, she a bopper, she a true head popper\nShe a freak, she a bopper, she a true head popper\nShe a freak, she a bopper, she a true head popper\nShe the type that I like, pussy fine, mouth proper\n\n[Verse 1: J. Stalin]\nYou can tell the way that the bills fall, we in the buildin'\nA lot of ones on the flo', bitch they came from drug dealin'\nShe already on it, she climb to the ceilin'\nAnd she drop it back down just to show them other bitches\nAsked me \"What is ya digits?\" and nigga it was on\nShe said she gon' give me what I don't get at home\nShe said she wish she could clone a nicer version of a nigga\nI never be that nigga fall in love with gold diggers\nI knock bad bitches, I pick up the litter\nI give a dope dick, make her body quiver\nTeach her the card game, take it off from a nigga\nEnough scrilla, it'll make ya feel like you own a nigga\nAnd you can rent it, you can lease it, but it's her pussy\nGet in the middle when it's super wet and real cushy\nTen minutes to make her cum, that's all it took me\nYeah, ten minutes to make her cum, that's all it took me\n\n[Hook]\n\n[Verse 2: J. Stalin]\nMoney motivated, college graduated\nStill with all that talent, she shakin' it and she make it\nShe could have her clothes on, still make you think she naked\nSee the shit she can do, with a fucking banana\nPussy tighter than a bandanna\nGot my soldier out the kitchen like a car antenna\nWe do it and she be louder than a police scanner\nBig ol' Mississippi booty, ask K.R.I.T. and David Banner\nI would let you fuck her, but I don't think you can handle her\nMe on the other hand, I flip her like a spatula\nFeeling like a movie when I enter in the back of her\nShe get though from the swag, she fucking with a factor\nI can work yo back, like a chiropractor\nGet up in her hair, like a security code cracker\nBut at the end of the night, I'm just another rapper\nBut at the end of the night, I'm just another rapper\n\n[Hook]\n\n[Verse 3: Too Short]\nI wouldn't have it any other way\nI had a lil' fine bitch the other day\nShe looked good but she couldn't fuck\nSucked a good dick but she wouldn't shut up\nI know this other lil' freak, she ain't as pretty\nBut she got a nice ass with some big titties\nI wouldn't even take her on a date\nBut we kick it all the time cause the sex is great\nWhat's better? If she's pretty or she's sexy?\nI probably don't want the bitch next week\nIf she ain't got skills\nCause all I want is big money and cheap grills\nI give a fuck about her cute face, she loves me\nThat's so lovely, she keeps saying fuck me\nShe better not be frigid\nCause all I need is to fuck her real good, then I'm leaving\nBitch\n\n[Hook]"}], "artist": "J. Stalin"}