{"artist": "Yung Gravy", "songs": [{"album": "Sensational", "image": "https://images.genius.com/2c6d7e0ce4d7bf880dfd1b727d8460d6.640x640x1.jpg", "year": "2018-09-07", "lyrics": "[Intro]\n(Pour some Gravy on it)\nYou know, sometimes they ask me, what do I do it for?\nYou see, I do it for the Jane Fondas, the Michelle Obamas\nThe Brandi Loves, the Sofia Vergaras (Mhm)\nThe Mrs. Incredibles, ha, the Mrs. Incredibles\n\n[Verse 1]\nHey, say, I pull up in this bitch, go stupid\nHit the pussy once, now it's love like Cupid (Woah)\nI'm the youngest Minnesotan makin' movement\nYa bitch chose me cause she with the improvements (Baby)\nAyy, pull up to the function, spontaneous combustion (What?)\nGravy 6'6\", y'all a bunch of a fuckin' munchkins (Ooh)\nI ain't touch yo' bitch 'cause she smell like some onions\nAnd there ain't no fuckin' way you see me goin' near that dungeon\nAyy, bitch, I got the sauce like I'm Bob-fuckin'-Evans\nYo' bitch got the slurp like 7-Eleven\nI'm gettin' more cake than a thick bitch's weddin'\nThe beat leave you sweatin', my wrist leave you sleddin' (Ayy)\n\n[Chorus]\nAyy, I don't got the drip (Drip), I got the splash\nI don't make rap, bitch, I make smooth jazz\nI don't got swag, I got pizzazz\nYo' mama on my dick 'cause I look like ya dad\nI don't got the drip (Drip), I got the splash\nI don't make rap, bitch, I make smooth jazz\nI don't got swag, I got pizzazz\nYo' mom tryna date 'cause I look like ya dad\n\n[Verse 2]\nI'm sippin' Prosecco, I'm lookin' perfecto\nI just met a thicky, I'm tryna finagle\nShe l'eggo my Eggo (Drip) in the Winnebago\nMy bitches gettin' thick like Hansel and Gretel (Ayy)\nMenace like I'm Dennis (Ooh)\nNaked with yo' bitch playin' tennis\nStill fuckin' posted with ya dentist\nAnd I run off with yo' bitch like a run-on sentence\nNow I'm drunk jet skiin' with Ellen DeGeneres\nThis shit goin' brazy, I'm bumpin' the A/C\nThey sayin', “Hey, Gravy, why you so wavy?\nWhy you so tasty? Crispy like pastries?\"\nI don't really know but I think I'm Pat Swayze\n\n[Chorus]\nAyy, I don't got the drip (Drip), I got the splash (Splash)\nI don't make rap, bitch, I make smooth jazz\nI don't got swag, I got pizzazz\nYo' mama on my dick 'cause I look like ya dad\nAyy, I don't got the drip (Drip), I got the splash\nI don't make rap, bitch, I make smooth jazz\nI don't got steez (Steez), I got pizzazz\nM.I.L.F.s tryna fuck 'cause I look like a dad (Ayy)\nI don't got the splish (Splish), I got the splash (Splash)\nI don't fuckin rap, bitch, I make smooth jazz (Ooh)\nI don't got swag, I'm a dad\nGravy in this bitch with the fuckin' pizzazz\n\n[Outro]\nBitch\n(Oh baby, baby)", "title": "Pizzazz"}]}