{"songs": [{"album": null, "image": "https://images.genius.com/c0c76671b93488acae20df28eae19f3d.1000x1000x1.jpg", "year": null, "title": "Stand Strong", "lyrics": "Take a seat\nLets get into this\nThere's been a challenge to the truth\nBut there's defense for this (2:1-2)\nSince Paul's first letter there's been need for another one (1:3, 5, 2:1, 13, 3:1, 6)\nCause the other one was compromised by a cover up another one (2:2)\nCause some of us\nThought Paul was sending....wait (2:3a)\nSlow up, lets just start from the beginning\nFirst, Paul felt morally indebted just to give thanks (1:3)\nFor our faith and increased love toward the saints (1:3)\nFor this reason Paul bragged on us (1:4)\nBecause we all persevered through attacks on us (1:4)\nAnd these attacks are evidence of His righteous judgment (1:5, 2:14)\nProof we've been proven worthy of a righteous covenant (1:5b, 1:11)\nAnd don't sweat the hatters because God is just (1:6)\nTo punish them and give you rest so in God we trust (1:6-7)\nSo until the Lord comes back to take us home (2:16, 14)\nPersevere through afflictions baby and stand strong (1:11, 5, 2:15)\n\nStand strong in the faith\nGod called you to this thing (2:14)\nPersevere through the hate\nDo it all in Jesus name (2:15, 1:4)\nCause the Lord is coming back, yep\nThe Lord is coming back, yep (2:2)\nThe Lord is coming back, yep\nThe Lord is coming back (2:2)\nSee the Lord is coming back\nAnd he'll save us from this pain (2:2, 2:14)\nDon't get lazy in the back stay disciplined in His name (3:11, 6, 14-15)\nSo stand strong in the faith, yep\nStrong in the faith, stand (2:15)\nStrong in the faith, yep\nStand strong in the faith (2:15)\n\nNow there are some of us who have been tricked into believing\nAll kinds of rumors about the return of Jesus (2:2)\nApparently there was a letter with false intent (2:2)\nBent on contradicting the first letter Paul sent (2:2)\nSo this is Paul's response to end the myth (2:1-12)\nThat says the day of the Lord, is in our midst (2:1-3a)\nDon't let anyone deceive you I beseech you (2:3b)\nHold fast to the lessons in which we teach you\nRemember when Paul was with us he said these things (2:5)\nFirst rebellion\nThen comes the lawless man on the scene (2:3)\nThen lawlessness, all of this so man would call on his name (2:4)\nAs he's exalting his name, to where the Father's is (2:4)\nBut, at this point, we've been long gone with Christ (2:1b, 2b,I Thes. 4:15, 17b, 5:1-2, 9)\nThe rapture is a snatching not Him coming back twice (I Thes. 4:16-17, II Thes. 2:1b)\nThey're separate and the day of the Lord happens after you (2:5, 12,I Thes. 4:17, 5:3a, 4-5)\nThis is not for your calendar but to strengthen your character (2:2)\n\nStand strong in the faith\nGod called you to this thing (2:14)\nPersevere through the hate\nDo it all in Jesus name (2:15, 1:4)\nCause the Lord is coming back, yep\nThe Lord is coming back, yep (2:2)\nThe Lord is coming back, yep\nThe Lord is coming back (2:2)\nSee the Lord is coming back\nAnd he'll save us from this pain (2:2, 2:14)\nDon't get lazy in the back stay disciplined in His name (3:11, 6, 14-15)\nSo stand strong in the faith, yep\nStrong in the faith, stand (2:15)\nStrong in the faith, yep\nStand strong in the faith (2:15)\n\nVerse 3:\nFinally brothers, Paul evokes our memory (3:3)\nChrist is faithful in affliction, just be genuine inwardly (3:3-5)\nCommitted to praying daily cause we're fighting an enemy (3:1-2)\nTrying to take me out the battle by using the sin in me (3:6)\nAnd speaking of sin, Paul charges us in (3:6)\nStaying away from the lazy and rebellious idle men (3:6)\nIn hopes our actions would invoke some action (3:6)\nPaul's first letter warned and they ignored his passion (3:10, 7, I Thes. 4:9-12, I Thes. 5:14)\nNow the churches reaction has to be more drastic (3:6, 14)\nIn hopes that they grasp it/and then repent of their actions (3:15, 12, 7)\nLet's recall Paul's behavior when he stayed with us (3:7-10, I Thes. 2:9-12)\nAnd how he labored night and day and never made a fuss (3:8)\nMan Paul is our model that we should be following (3:7)\nIf a man doesn't work then that man shouldn't eat (3:10)\nTake note of those who disobey this command (3:14)\nStand strong and quote, \"I wrote this letter with my own hand\"(Paul) (3:16-18)"}], "artist": "Tedashii"}