{"artist": "Immortal Technique", "songs": [{"title": "One (Remix)", "lyrics": "[Intro: Akir + Immortal Technique]\nYo, Tech, it's the last call, baby, what's good?\nYeah, you know, a remix just feels right though\nBefore we get outta here\nYou gotta drop one last gem on them, nahmsayin?\nNo question, it's like the elders told me\nNo one person can do anything\nBut everyone can do something\nSo we gotta rep for all the niggas that ain't here right now\nThe outro tip, the One Remix, yo\n\n[Verse 1: Akir]\nOne Enterprises comprises the artist and the sound\nThe pen and paper plays my savior while I'm gettin' down\nPray for my neighbors as a favor for holdin' me down\nSlave for my papers as I savor the way that it pounds\nIt's underground, but the blatent vibrations widely found\nFacin' the nation, complacent radio stations now\nStop hesitatin' and contemplatin' the way we patient\nStart motivatin' and get them playin' the shit we sayin'\nAin't no delayin' in this war that we gettin' slayed in\n'Cause time's a wastin' while we stand adjacent to abrasions\nTheir fouls are more than flagrant\nAnd so I see the prisons cages while I pound the pavement\nLookin' for payment, sayin', \"Fuck enslavement!\"\nUsin' the tools of old ancients\nAnnouncin' my engagment to this music that we makin'\nAin't no fakin' on tracks, and we ain't never come wack\nImmortal Technique and Akir\nY'all niggas fear it's a wrap, it's like…\n\n[Hook]\nOne love, one music\nOne people, one movement\nOne heart, one spark\nOne, One, One, One\nOne gift, one lift\nOne stance, one shift\nOne way, one day\nOne, One, One, One, One\n\n[Verse 2: Immortal Technqique]\nImmortal Technique in the trenches with my nigga Akir\nOur family surived the genocides so we can be here\nAnd now we enterprise the aftermath, one in the same\nLivin' the revolution 'til we catch one in the brain\nAnd even then my spirit will return in heavenly form\nAnd wipe the chess board clean of my enemy's pawns\nThe Red Dawn Communist threat, buried and gone\nSo they invented a war the government can carry on\nIt makes me wonder if the word of God is lost in the man\nThis is for the children of Iraq lost in the sand\nThis is for the illest emcees that'll never be known\nAnd this is for all the soliders that'll never come home\nI wrote this for Mumia, stuck in the beast\nFor people who march in the streets, and struggle for peace\nFor hood niggas, born rugged, never rockin' Versace\nEddie Ramierez's cousin George, and my old friend Sashi\nChris from the block, and all my niggas stuck in a cell\nPaul Wolfowitz, motherfucker, I'll see you in Hell\nMy destiny is to show the world that the music is real\nGo back in time and play this shit for the slaves in the field\nAnd for my children in the future, that are waitin' to breathe\nPeople slowly dyin' hangin' on, waitin' to leave\nBelieve when I'm gone, and this album's on a library shelf\nI'll be one with God and one with you and everything else\n\n[Hook]\nOne love, one music\nOne people, one movement\nOne heart, one spark\nOne, One, One, One\nOne gift, one lift\nOne stance, one shift\nOne way, one day\nOne, One, One, One, One\n\n[Outro: Immotal Technique]\nYeah, Revolutionary Vol. 2 has been brought to you\nBy the type of motherfuckers who ain't scared of shit\nAnd if you playin' this album, and I'm no longer here\nAnd sometime far away from when I recorded this\nRemember that history\nIsn't the way the corporate controlled media made it look like\nRead between the lines and free your mind!\nRevolution is the birth of equality\nAnd the antithesis to oppression\nBut this is only built for real motherfuckers\nSo when I'm gone, don't let nobody I never got along with try to make songs, kissin' my ass, recyclin' my beats or my vocals\nThe shit is real over here, man, thank you for listenin'\nAnd thank you for supportin' independent Hip Hop\nThe heart and soul of our culture\nKeepin' the truth alive, goodnight, my people, goodnight!", "image": "https://images.genius.com/c628c98f9d53f039b060e7f0369c15b4.220x220x1.jpg", "album": "Revolutionary Vol. 2", "year": "2003-11-18"}]}