{"songs": [{"title": "Congratulate", "lyrics": "[Verse 1]\nStarts out with a pipe dream\nWhite T and an ice cream\nAll day on the MySpace\nMJ, trying to buy face\nI had to pay dues, had to make moves on faith\nEven got booed off stage, trying to put food on plate\nDropped a couple jewels on tape, now we got views on Base\nSo much, love\nTrust fund and Kas'lam\nBad chick in my address and she showing up with that plus one\nThrough depths and peaks, wolves dressed as sheep\nBetter protect the key while I pen this acceptance speech\n\n[Bridge]\nDo you see what it took? Is it clearer?\nWho you see when you look in the mirror?\nAll the dreams and fantasies that come together\nI'll be shining like a diamond that’s forever\n\n[Hook]\nNow congratulate me (x8)\n\n[Verse 2]\nNow this the moment I’ve been waiting for my whole life\nDidn’t believe it ’til I seen with my own eyes\nImma need a black tux and a bow tie\nDouble cup, white chucks and a strobe light\nNiggas have bad luck when they roll dice\nThe numbers add up and they don’t lie\nShowtime, my bread butter on both sides\nTook it to the champagne from the Morvite, now everybody come on\nAw’bula boot (aw’ bula boot)\nJC le Roux (aw’bona)\nThat’s all I think about, sitting up in my room (sitting up in my room)\nAw’kuze kuse (aw’kuze kuse)\nAw gin and juice (Aw’ gin and juice)\nIt’s all coming back to me like Déjà vu\n\n[Hook]\n\n[Verse 3]\nThink back to my old days\nAll I wanted was a gold chain\nSo stuck in my old ways\nNow we all household names\nWhat you know about sacrifice, flashing lights, rights of passage for bragging rights\nBad romances, packs of pampers\nAnd this ain’t time to be camera shy\nMy one homie got a gun in the cupboard\nMy other homie got a bun in the oven\nBaby mama getting big in the stomach\nPop champagne or the Four Cousins\nI think it’s time to be a man now\nI feel like moving to my gran’s house\nEverybody lined up for a handout\nReally I just wanna make my old man proud\n\n[Bridge]\n[Hook]", "year": "2014-02-28", "album": "Levels", "image": "https://images.genius.com/963ed72af6b68081dc449da63b1d2c81.1000x1000x1.jpg"}], "artist": "AKA"}