{"artist": "R. Kelly", "songs": [{"album": null, "year": null, "lyrics": "[are. Kelly]\nMmmmm.. Ohhhh, ohhhohhhhh\nOooohhh.. Ohhh no, mmmmm\n\n[Chorus: are. Kelly + (Jay-Z)*]\nYou and me, havin s**\nAfter an argument, that shit's the best\nYou and me, havin s** yeahh\nAfter an argument, that shit's the best\n(Think about it while the streets you roam\nIt's Dom P and Army in the fridge when you get home)\n\n[*overlapping R's last line]\n\nI storm in, she storm out\nIt's like the \"War of the Roses\" goin on in my house\nIt's a little seperation but I know how to fix the situation\nMami just sufferin from love deprevation\nSo I gotta give her thug reperations\nPut it in the life until love leg is shakin\nSlow and passionate, 'til we forget what happens\nThen we laughin and we back friends\n\n[Interlude: are. Kelly]\nYou don't have to fuss and fight\nWhy don't you just spend the night\nBaby let's just kiss and hug\nYou know the words girl let's make up\nSo much love to be made\nInstead of screamin, \"Who's to blame?\"\nGirl I don't wanna.. Let you go, I need you so\n\n[Chorus:]\n[Jay-Z]\nGirlfriend didn't believe me when I said I'd be back in a little\nCause I had the Chris T on with the crease in the middle\nPlus a fresh cut and the freezin icicles\nOn my wrist, on my hand, that's when shit hit the fan\nSaid, \"You never spend timey, what's up with that?\"\nTranslated it means\n[R] Hit it hard from the back\nYeah she hid my car keys\nAnd forced me to fall asleep to her heartbeat\n\n[Interlude]\n\n[Chorus w/o Jay-Z]\n[are. Kelly]\nI don't want.. Baby I don't want to fight\nI just wanna make it right (ooh yeah)\nPut out problems to the side\nLet's just make sweet love tonight (I don't want)\nBaby I don't want to fight\nI just wanna make it right (ohhhhh love)\nPut our problems to the side\nLet's just make sweet love tonight\n\n[Jay-Z]\nS** so intense, all that's on my mind\nIt ain't feel this good since the very first time\nI'm pullin her close, she's pullin away\nI'm tryin to kiss her mouth but she keeps turnin her face\nCute s** game like our very first date\nWe ain't know each other well enough, we had to wait\nBut oh! I know just where your hot spot at\nYou can not deny that, so do not try that\nI do not buy that..\n\n[Chorus w/o Jay-Z]\n\n[Chorus w/o Jay-Z (fades out)]", "title": "Break Up To Make Up", "image": "https://images.genius.com/e54b7a47c059f99afc5429a8709acf02.400x400x1.jpg"}]}