{"songs": [{"title": "Number Song", "lyrics": "AKIR - “Number Song”\n[Emcee(s): AKIR]\n[Producer(s): [?]]\n\n[Verse 1: AKIR]\nOne summer day, jumped out, dipped in a hallway\nA seed too untrained, serving ‘caine on Broadway\nHad it pouring like rain—cocaine the raw way\nThrowing rocks in the war but didn’t know what it’s for\nLaying deep in a ride while harassed by five\nIn a sick whip, stick shift, six-speed, sick shit\nHit the block about seven o’clock\nAir Forces on the blacktop, trees in my sock\n[?] fix me a plate.  It was late, but in\nMy face, I was hungry, so a nigga still ate.  Back on\nThe streets, still walking with The Beast and their nines.  Jumped in\nA ride and reclined, feeling the world was mine\nRoll a L and I picked up some wine ‘cause shorty’s fine\nLikes to have a good time, plus she knows all my rhymes\nTo all my niggas: safe journey through the world and these crimes\nThings come in due time—one—I’m out with the dime\n\n[Verse 2: AKIR]\nIn one second, three amigos ran into the store\nPushed a negro, shot the gringo with a chrome forty-four\nWith the lingo [?] commanding his people\nThrough the dirt, we’ll grow rich from this root of evil\n[?] at their ransack on Fifth Ave., stacked now\nWith a six NASDAQ.  Now they’re rich\nOne turn and revving.  The other Godbody known as seven\nThe last brethren caught his karma fast, passed to Heaven\nHe had a mill’.  This nigga stashed eight hundred\nThou’ with undisclosed account, plus in a stashed base\nHe hid it from his wife Tina, gave the codes to\nHis ho Nina when he was handling a misdemeanor\nThey ran up on Nina in a silver two-seater\nGetting bent with no cheese, looking like she\nO.D.  Here come the police.  Nina said they\nDon’t mean.  To jail they were sent ten years for intent", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}