{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/21bdd915768bba8a4230188219c45f1d.630x630x1.jpg", "title": "Hear Them Talk (Freestyle)", "year": null, "album": null, "lyrics": "[Intro]\nYou people have been chosen\nTo reveal our existence to the world\nYou will witness what happens here today, and you will tell of it later\n\n[Hook]\nYeah, Uh, Weed in the blunt, bitch in my lap\nI can hear them talk, we ain't worried bout that, though (no)\nNo, you ain't gotta front (front), had the time of your life\nYou know how that go (yeah), do it just how I like\n\n[Verse 1]\nYou-you-you know what it is on sight: Alumni batgang; up all night\nNiggas smell like pussies, act like dykes\nBetter watch yo hand cause I just might bite (Uh)\nBeat up the beat\nHook to the left, uppercut to the right\nI'm the shit, better get a wet wipe\nAnd cuff yo chick, lock down yo wife, now what?\nShoe box money, I don't need a bank\nGot a 9 millimeter, I don't need a safe\nBitch it's Up and Away, I don't need a cape\nBut I'm ready for the rapture like Anita Baker\nMolly got my face turned\nFeeling like a bad boy right before Mase turn\nBitch I'm goin' in, cutting lines, I don't wait turns\nSmoking on that Kill Bill, make her sign a waiver, then I give that ho the vapors\n\n[Voice Over]\nNow you will receive us\nWe do not ask for your poor, or your hungry\nWe do not want your tired and sick\nIt is your corrupt\nIt is your evil that will be sucked by us\n\n[Hook]\n\n[Verse 2]\nI got a bitch in the back, got a ho in the front\nTwo at the same damn time, both rolling a blunt\nTheir red eyes looking like that time of the month\nSaid money talking and these motherfuckers sound like monks\nTell them, they ain't saying much\nUp late, but it's looking like lunch\nI make in a week, in a month, in a day, what you motherfuckers make in a lifetime\nGot your girl in my eyesight, and I'm all in her iPod\nSay, she see me on HotNewHipHop \"You is a motherfucking icon\"\n\nHold up shawty\n[These are not polite suggestions. These are]\nRoll up\n[Cause of behavior\nAnd those of you that ignore them will pay the dearest cost\nThere are varying degrees of evil]\nUp and Away yeah!\n[Filth\nNot to push the bounds and cross]\nWoo\n[into true corruption, into our domain]\nJune 12th\n[But if you do\nOne day you will look]\nI said\n[You will see we three]\nHotNewHipHop what up\n[We will send you towards ever god, you wish]\nBitch!"}]}