{"songs": [{"title": "Young M.A Freestyles on Flex (2019) | Freestyle #132", "lyrics": "[Verse 1]\nThey told me to do it so I went and did it\nI said the Queen of Brooklyn, nigga, let's get it\nThat's queen with a K 'cause I'm a king too\nIt's Kings county, I'ma show you what this queen do\nListen, man, I don't do it for likes\nNine times out of ten, I do shit for a price\nI told Cas, \"If I'ma do it, I'm doin' it right\"\nLet these lil' niggas know what I do with a mic\nI got the crown like heights, oh yeah, I took this shit\nWe don't ask, we just take, real Brooklyn shit\nThis beat is real raw, I had to cook this shit\nYo, this mine now Cas, I had to book your shit\nI'm top ten and that's a Fendi fact\nAny nigga want to bet, I put my hundreds where you pennies at\nYeah I'm pretty but ain't shit pretty\nI'm from that city where it's gritty at, that click-clack, give me that\nAnd put the glizzy right there where your kidneys at\nOh that's a bustdown AP? Send me that\nYou can't flex in my city, know they gon' envy that\nNiggas hungry, they'll kill you for a fifty pack, real shit\nPolice chase us, constant discrimination\nEven the black cops is racist, no grass, just pavement\nEverybody been claimin' that gang shit\nHonestly, every hood is the same shit\nLet's change routes, different route, let's do it different\nInstead of startin' a gang, nigga, let's start a business\nEither you gang or you gainin', that's not a hard decision\nYou could still be a star without the star position\nAnd I'm winnin' 'cause my heart consistent\nStayed indy, made a smart decision\nTop notch is where my bar's positioned\nTryin' to go head-up with me, car collision\nI can murder any of you rappers from start to finish\nMy drink devil but I get high like God's position\nWhen life through me a rod, nigga I started fishin'\nMy palms started itchin'\nGot that drive like when you start the engine\nI'm a GOAT but still I'm hardly mentioned\nFuck it, man, that's all they gettin'\n\n[Verse 2]\nI see the hate, I see a lot of love\nWhy they be so mad at you, MA? Shrugs\nIs you 'cause you realer? Is it 'cause you kill shit?\nThey all in they feelings? Shit, all the above\nI don't know what they problem is, but anyway baby\nI could be your daddy if you don't know who your father is\nWe know who don't like us, we know who our target is\nKeep on shittin' on 'em like I don't know what a toilet is\nTrophies in them offices, graduated from the streets\nI don't know what Harvard is, no diploma, no degrees\nBut my chain on no degrees\nDropped a bag at the dealer, told 'em, \"Throw them keys\"\nI had a long day, baby, on your knees\nPut your face on it while I hold your weave\nAnd baby when we done, can you roll the weed?\nShe said, \"This gorilla?\" I said, \"Oh, indeed\"\nBut I would leave a bitch if she crossed me like a rosary\n'Cause even when I wasn't rich, them hoes still noticed me\nUsed to be cold-hearted, found a girl that's cold as me\nI believe what's done to me, not what's ever told to me\nMan, fuck rumors\nHow the fuck can y'all believe what's on computers\nLosers, learn life, pick me as your tutor\nCome here, let me school you, here's a pencil and a school book\nNigga, fuck a rule book, I'm disobedient\nI used to see the haters but now I see comedians\nGot rid of some niggas 'cause they was movin' devious\nNow I only move with the immediate\nGot money, repeated it, repeated it, repeated it\nEtcetera, etcetera, you know what I mean and shit\nI been layin' low lately, yeah I did some shows lately\nCan't lie, shit been movin' slower like a old lady\nBut I ain't broke, baby, I just came to get my mind right\nGet back on my bully when the time right, get back in that limelight\nHad to feed the streets like I just walked out of ShopRite\nFallin' back was not right, my apologies\nI was in a time of need, I needed some privacy\nI needed a prophecy, couldn't let my momma see\nMe at my lowest point but I guess that's just the pride in me\nNot to brag but I be doin' numbers like the lottery\nIf we speakin' honesty then honestly, who is hot as me?\nLogically, I'm still tryin' to see\nI never get too comfortable\n'Cause when you lit, that's the only time they gon' fuck with you\nWhen that bag come, that's when they come to you\nTrust me, this ain't nothin' new\nThis is how the game is, you just gotta play it right\nRemember, there's somebody out workin' while you late at night", "album": "Funk Flex Freestyles", "year": "2019-09-18", "image": "https://images.genius.com/d891a78127535cd18f61bdfdfcef28aa.1000x563x1.jpg"}], "artist": "Young M.A"}