{"songs": [{"album": "Absolute Power", "image": "https://images.genius.com/478a9ba0370b10241e03f91f6e741b36.1000x986x1.jpg", "year": "2002-09-24", "title": "Absolute Power", "lyrics": "[Intro]\n{*Tech ad libs backwards*}\n\n[Verse 1]\nAin't no way you 'bout to stop this sickness\nFrom the deepest, darkest part of Missouri\nPsycho-alpha-schizo get your chick, she diggin' me\nA-B-S-O-L-U-T-E P-O-W-E-R, see me clownin'\nLook at all you player haters frownin'\nRaw! God said: \"Kill 'em all!\" Tech's back's to the wall!\nFightin' for my life and I'ma bust back 'til they fall!\nAnd I ain't even slangin' them thangs\nI'm hollin' one-eight-seven if you trippin' with Strange\nI'm really real with it, like my homie AJ say, \"Deal with it\"\nPushin' and pullin', fightin' for the meal ticket\nIn a minute I'ma do it like a villian, I'ma get 'em in the middle of a bomb\nPut 'em on the spot 'til the funk go pop and I bet he never have another quam\nTech Nizzle! When I'm thizzled it's, \"Who be you?\"\nRolling with Dave, Trav, Violet Brown, and 3DQ\nHootie hoo, for those who not knowin' that Missouli true;\nI'ma tell you like the Swedish would say it, \"Sug min kuk\"\n\n[Hook] (2X)\nAbsolute Power! That's the only way to roll!\nAbsolute Power! They love us everywhere we go!\nAbsolute Power! Tecca Nina's 'bout to blow!\nAbsolute Power! Absolute Power!\n\n[Verse 2]\nI do hip hop! And I mix it with the hard rock!\nDesigning this rhyming for climbing\nTech N9ne he's unwinding the shining is blinding\nGreedy so we constantly grinding\nI've been in the game 16 years making rap tunes\nRaising hella havoc up in the classroom\nNow in '02 you can watch me clownin', diamonds shinin'\nWatching DVD's on the Hoshitoshi (It's all Jesus!)\nNow I keep the crowds pumpin', they jumpin'\nGet back to the telly we rollin' and stickin' somethin'\nRacing to the main line\nAbsolute Power is having Halle Berry and Juliette Lewis at the same time\nOh! That's how Strange niggas run\nListen to the villian with the gun-associated tongue\n(We're close to the end) But not done\nThe Tech's just begin, begun, beginning to begin to have fun\nThe curse is tryin' to put me in the hearse\nBut I will not tumble, first thing's first;\nTook a lot of shit and I can't take more\nFuck Jay Ferus and everybody down with him and fuck JCOR!\n\n[Hook] (2X)\n\n[Verse 3]\nThanks to Strange Music I'm comin' and all my enemies they runnin'\nNow all my haters bummin' 'cause I was summoned\nWe Kansas City players and we 'bout soul game\nWe make it so Tecca Nina is a household name\nHow many points you got? I got 50\nHere's a question to the Censorship Committee\n\"Who's the biggest gang of niggas in the city?\"\nMy villians are gritty\nBig Scoob, Txx Will, Bakarii, rest in peace Short Nitty\nFoul with the evil ways, power's what the people say\nRebel yellin' we're felons and my pockets are swellin'\nThis beat's from Berlin, Germany\nThrowin' up Mizzizzy so ain't no other city concernin' me\nI teach it and I speak it very loosely\nStamina gunnin' got player haters runnin' profusely\nNow I got the parents pissed and ready to noose me\n'Cause they know that Absolute Power corrupts, absolutely!\n\n[Hook] (2X)"}], "artist": "Tech N9ne"}