{"artist": "King Los", "songs": [{"image": "https://images.genius.com/a9bc5b4fe746b1be8d76a46edd25590e.500x500x1.jpg", "title": "Don’t Get In My Way", "year": "2014-03-24", "album": "Zero Gravity 2", "lyrics": "[Intro: News Anchor]\nThe real life Riches to Rags tale of one of Baltimore's biggest drug Kingpins\nOne of the biggest in Baltimore, according to the DEA\nTrading at least 1,000 kilos of coke, tens of millions worth, right in our area\nGarnett Smith may have made fortunes dealing cocaine and heroin, but it cost him his freedom\n\n[Verse 1: King Los]\nSee in Baltimore City we don't really give a fuck, niggas die everyday, that's way this shit go\nHow the fuck you think these niggas supposed to care when the cops ain't shit and the drugs coming slow?\nNigga need a price for this shit on the low man. It's hit a plug hit 'em and he fuck around and split\nNigga said, \"Damn that was really your plan?\"\nIf you take my money, I can take your bitch\nDamn, shit getting crazy these days (shit getting crazy these days)\nWhat the fuck is going on?\nPlaying with another nigga change had an AK spraying at your brain\nDamn\nMan I heard they ran up in his crib they took his bitch and all his purse and all his jewelry and his motherfucking chain\nHe said when I catch him I'ma send these boys a message, time to teach these whores a lesson, end the motherfucking game\nMan, nigga do you dirty, got me drop topping, brand new Glock 30\nIt's like a dark cloud always over my town and this shit get real when the sun go down\n\n[Hook: Shanica Knowles]\nWhen the sky turns night and the moon shines bright and the kids gets out the way\nWhen The Wire gets cold, all the boys run home and the beasts come out to play\nDon't get in my way, Don't get in my way\nDon't get in my way, Don't get in my way\nDon't get in my way, Don't get in my way\nIt's not so bad and you wave white flags when I'm all up in your face\nWhen you cross that line, you won't be fine 'till I put you in your place\nDon't get in my way\n\n[Verse 2: Royce da 5'9\"]\nI used to be defined by having the biggest nine\nBeing followed by a stripper chilling with a fifth of Bombay\nNow I'm just a stand up nigga looking down, dealing with the digits and the pounds, don't get in my way\nHollow head, bullets got a forehead on it looking big as Sade\nOn my way to visit yet another project chick, she living building 5A\nI be there everyday, with another chick\nThey be singing to each other \"You're all I need to get by.\"\nMary J's, John Blaze on some other shit\nNiggas wearing plaid shirts around their waist instead of weapons so this tec's playing checkers with them for the thug of it\nOn your mark (mark), nigga where your heart?\nCouldn't knock a glass of water off the table with a running start\nMy hypothesis is I'm cut from a different cloth\nGod stop, make it with a rhinoceros\nY'all ballers, nigga I'm extinct, heater by the sink, y'all in hot water\nI'm a Molotov thrower, y'all the cop callers\nWhen it pops off it's shots falling all the smoke clears after shit happened\n\n[Hook: Shanica Knowles]\nWhen the sky turns night and the moon shines bright and the kids gets out the way\nWhen The Wire gets cold, all the boys run home and the beasts come out to play\nDon't get in my way, Don't get in my way\nDon't get in my way, Don't get in my way\nDon't get in my way, Don't get in my way\nIt's not so bad and you wave white flags when I'm all up in your face\nWhen you cross that line, you won't be fine 'till I put you in your place\nDon't get in my way\n\n[Verse 3: King Los]\nBeen flexing since big body legends\nFronting like you getting it but your clique probably stressing\nMy whip got 'em guessing, my clip got the answer\nIf a prick got a question then your bitch probably pressing\nI cop, fly drops and new sneakers\nI've been top notch since high tops and 2 beepers\nYou ain't on my frequency, I frequent the Waldorf\nFreak with the drawers off, in my jeep with the doors off\nI ain't chopping the top or murkin' the tire\nCoppin' coutour on tour, you know, merch and attire\nKnow some OG's, OT that murk the supplier\nChop the whole bird up in an herb with a fire\nSlow down, show you how to earn that shit\nWhip the wheel count and money while you turn that shit\nI told a bitch, \"Look, you get one turn, that's it. Just don't get no\nLipstick on this Hermes shit.\"\nI'm from the murder, where bitch niggas murk if you crispy\nEither you pushing work or you working with the 50\nBut my circle never shifting, I copped my bitches red Birkin' bags\nAnd got 'em jumping out of purple 760's\nGot a house in the hills but I'm as hood as it get\nI feel as good as I look and I look as a good as a bitch\nI got a stack of hundreds, that say none of you niggas rapping want it\nYou fucking Photoshop bitches that look wack in public\nPasses? I'm my hood? Nigga hell no\nBenz on the arm, you can call that an elbow\nGet it? I said Benz on the arm\nMeaning what you push depends on the strength of your arm\nAnd at the same time, your elbow bends on your arm\nBut I'm really in a Bent, with the arm\nAnd I've got it bullet proof, so really I've got the whole bent armed\nSame color as baking soda with the old bent arm\n\nOld bent arm, back over the stove\nWhip it up one time for my nigga Marty Jones\nIn the feds, but he used to keep the V's all chrome\nIt's still block shit, my niggas C's came home\nProbably dig the money up and cop a fucking phantom\nWe don't know you from the streets, you mother fuckers looking random\nTalking much, you finna get a nigga yee ain't never had it\nStay the fuck up out my way that's automatic, god dammit\nWhen the sky turns night...\n\n[Hook: Shanica Knowles]\nWhen the sky turns night and the moon shines bright and the kids gets out the way\nWhen The Wire gets cold, all the boys run home and the beasts come out to play\nDon't get in my way, Don't get in my way\nDon't get in my way, Don't get in my way\nDon't get in my way, Don't get in my way\nIt's not so bad and you wave white flags when I'm all up in your face\nWhen you cross that line, you won't be fine 'till I put you in your place\nDon't get in my way\n\n[Outro]\n*Phone rings*\nYou have reached the voice mailbox of: 765-552-4053\n*beep*"}]}