{"songs": [{"year": null, "title": "Hoofprints in the Sand", "image": "https://images.genius.com/cb391d97ea1e67f146589b798b0e7b0a.306x306x1.jpg", "lyrics": "I've seen a monkey evolve into a man\nI've seen a man devolve into a monkey\nI've seen a junkie redeem himself with help\nI've seen a wealthy man melt into the snow and blow his credit on a decongestant\nThe dyslexics breathe easy\nThe people in the top tax bracket just keep looking for freebies\nThumbing their noses at those in need of handouts\nI'm talkin' panhandlers with secondhand clothes, living hand to mouth\nCamping out on Capitol Hill\nThe fat cats are still insisting reparations be a jagged little pill\nToday there's free vaccinations at the walk-in clinic\nIf you're lucky, you won't just be a guinea pig\nCall me a cynic\nI find it interesting how certain epidemics spread\nMore specifically - where they don't and who isn't affected\nYeah, I'm infected with a curious nature\nThe welcome mat said, \"God bless this home,\" not \"God damn thy neighbor\"\nThey can repeat history but can't recycle paper\nThey don't see the forest or the trees, just skyscrapers\nTowers of Babel in a town full of cattle\nWhen I question brand loyalty, the crowd is bedazzled\nBut I'll never be hoodwinked, I'm mindful of the footprints\nThe shape of the hoof, the way the path in the wood splits\nThe author of the book, the origin of the crucifix\nThe waitress looking for tips and the place where the cook spits\nThis is where I was when the bomb dropped\nHiding from the uninvited onslaught\nI've seen people who don't believe in sleep count sheep\nWith calculators that double as alarm clocks\nFrom Noah's Ark all the way to Rosa Parks\nTo black folk pushing white agendas inside of an office with flow charts\nTechnology ain't shit, we feed off the fruit\nWhen I stuff leaves of absence in my briefcase, follow suit\nSpill the liquid from your double fisted escapade\nKill kids with the drunken misfits in your Escalade\nIt's gruel for the food fight and foreign aid\nBream 'em down and build 'em back up with what you throw away\nAdministering band aids on amputated limbs\nKissing 'em with air raids, and your lips gave 'em infections\nToo many closed doors led to back drafts\nNow the spring edition of fashion catalogues feature gasmasks\nHow becoming on these lanky models\nThey can't look truth in the mirror without a pair of safety goggles\nHold the bobble head, insert the feeding tube\nEven if they stop breathing, make sure they keep eating food\nDo the Schiavo\nMouth opened wide like a perverse psycho circus side show\nForgive me not, my patterns stay impartial to apologies\nDespite a polite side of mine that says, \"I'm so sorry\"\nAdding flame infinitum for your eternal fuel tank\nMy higher power doesn't need to be thanked\nThanks anyway, that's from him to me to you\nI don't mind being the middle man, someday I might need one, too\n\nI'm at the fire\nWhere are you?\nI'm at the fire\nWhere the hell are you?\n\nI've seen a man devolve into a monkey\nI've seen a monkey evolve into a man\nI've seen it all, upside down, in-between, inside out\nIt's neither here nor there, hoofprints in the sand\nI've fallen head first into the pit of my stomach\nTaught to trust my gut, got no trust in the gutless\nSave some hope for the hopeless, but I won't show it\nShoot my load in an opus, now it's an open casket\nGoing to Hades in a hand basket\nHolding onto a dream, but lately we can't grasp it\nThere's been too much murder and not enough martyr\nWhy is it no one else wants to impress Jodie Foster?\n\n[Repeat 3x]\nI'm at the fire\nWe're at the fire\nWhere are you? Where are you?\n\nYou can't have revolution without evolution, huh?\nYou can't have evolution without velution, huh?\nYou can't have velution without elution, huh?\nYou can't have elution without lution, huh?\nYou can't have lution without ution, huh?\nYou can't have ution without tion, huh?\nYou can't have tion without ion, huh?\nYou can't have ion without on, huh?\nYou can't have on without n, huh?\n\nSeriously I know that you pray when the chips are down\nBut act different when there are atheists around\nHave suspicions that make you think you'll drown\nAll alone in the middle of a crowd\nI'd be a liar if I said I never had to beg\nDoubled over with my knees bent touching my head\nStuck in a bed, dealing with all of these evil visions\nRunning from the dead in a fetal position\nNeeding assistance from a nurse\nShe said, \"Tell me where it hurts\"\nThese words are gonna make my belly burst\nSo I mentally revert to all the enemies I've cursed\nRunning through my memories in reverse\nI said bring that beat back, man, bring that beat back\nA flash ain't enough time for me to recap\nI'm a bastard sometimes, don't think I don't see that\nLaughing at the dumb, blind, the deaf to the knee slaps\nCracking punch lines for the sake of some green stacks\nPassion for the rhyme can be cheapened by feedback\nI shut my eyes and proceed to go dream catch\nBut a troubled mind can't seem to fall asleep fast\nI cut my ties like the way that a fiend acts\nGo into overdrive and get caught in a speed trap", "album": "Human the Death Dance"}], "artist": "Sage Francis"}