{"artist": "Cardi B", "songs": [{"title": "Red Barz", "album": null, "year": "2017-04-05", "image": "https://images.genius.com/9cb01f0b14d584e5d4ff5c5811136037.400x400x1.jpg", "lyrics": "[Intro]\nUh, yeah\nSome regular degular, bloody bars\n\n[Verse]\nI swear to God, they ain't wanna see me leave the club\nGot up on my shit and now they scared to show me love\nThey'd rather see me on the pole twerkin' it for dubs\nI guess I really gotta show them what the fuck is up\nI'm on some other shit, that Cardi B gutta shit\nEvery time I catch a hating bitch, she on her stutter shit\nCan't finish her words but on Instagram thuggin' shit\nYou set yourself up, don't make it seem like I be buggin', bitch\nAnd niggas hatin' on me, really be upset\nI don't know, make me wonder what you got between your legs\nYou a real nigga mad at a bitch for getting bread?\nYou's a bitch from birth, you just grew a third leg, woo!\nBite down, bite down, it was crunch time\nYeah I skip all of them bitches in the lunch line\nI put in work, now I'm here at the front line\nReady for the bullshit, I swear it's on my bloodline\nTouch mine, getting slumped, slimed one time\nPump blind, bitches quick, then I dump mine\nPull up with the Gucci clutch, spitting clutch rhymes\nFlyer than a big big B with a Blood tie\nDon't do much, he get hard when I bust wines\nNo straws for this juice box, gulp one time\nLast nigga I was with went insane\n'Cause my head game over hills like I'm lookin' for the sunshine\nI'm a Bronx bitch birthed from the hip-hop\nFrom the block to the tick tock in the Patek watch\nQuick drop with the cash, couldn't fit the Ziploc\nGrips locked, get your shit popped in my flip flops\nWealthy now, but every dollar, I still want it all\nNow he wanna nail me, I could give your man a cure\nYou gotta mail me, but I don't check my spam at all\nNever feel what you're sayin' like I'm usin' Anbesol\nTravel all around the states getting nice checks\nI was tourin' off a tape, I had a hype set\nIs that the reason all these niggas wanna pipe next?\nI'm a creep, bitch, see his dick through his Nike Tech\nGot 'em all scared, I ain't even strike yet\nWire up jaws when I swing if the mic stretch\nI worked hard, took the right steps, had a shot\nSo I took the shit, now this game gon' need a life vest\n\n[Outro]\nUh\nI said, woo!\nHuh"}]}