{"songs": [{"year": "2010-09-14", "album": "Overly Dedicated", "image": "https://images.genius.com/9e1efc6d0a7044dbf2f0776a12ed85b8.620x620x1.jpg", "title": "Cut You Off (To Grow Closer)", "lyrics": "[Produced by Tae Beast]\n\n[Intro]\nAli, you thirsty on Twitter!\nYou boo-boo, you T'd\nYou turned down, you thirsty\nYou boo-boo!\n\n[Verse 1]\nUh, I'm tryna learn something new\nI'm tryna find myself, I'm searching deep for Kendrick Lamar\nI read about Napoleon Hill and try to know God\nThey say he the key to my blessings, and if I speak the good\nInto existence, that instant my dreams will unlock\nMoney flow like water, I'll just wait at the dock\nAnd by the way I'ma start, finding more light to shed\nLike a small garage in your backyard\nI'm back chilling with a friend of mine, she mighty fine\nBut I notice that her heart resides next to bitterness\nAlways hollering who she don't like and who she kick it with\nWho she wanna fight, who wearing a weave\nWho Dooney and Bourke bag is fake, who holding the keys\nTo the car she drove last year or who fucking on who\nAnd who need a pap smear, getting on my nerves\nBut before your negative energy curve, bitch I'ma cut you off\n\n[Chorus 1]\n'Cause every time you come around\nYou be hollering that whoop-de-whoop, blah-zay-blah\nHe say, she say, oh my God\nShut the fuck up... hoe\nEvery time you come around\nYou be hollering that whoop-de-whoop, blah-zay-blah\nHe say, she say...\n\n[Verse 2]\nUh, I'm tryna learn something new\nI'm tryna surround myself with people that inspire me\nOr at least inquire similar desires\nTo do what it T-A-K-E just to reach the T-O-P\nI'm talking ideas, motivation\nIt's more than making, enemies, my nigga\nOh, that's not ya memo? Then tell me why you constant stressing\nOn how you well connected like centipedes, my nigga\nI function with you and you flaunt your pistol\nEvery second tell me how you pressed 'em at the Monte Cristo\nWhere so and so from, and what neighborhoods beefing\nWho baby momma's a rat, and who got killed last weekend\nThat shit is mad depressing, bringing me down\nSpeak on somethin' with some substance that can get us both paid\nRather than telling me how these niggas jocking your style\nOr his rims ain't bigger, pussy nigga, I'ma cut you off\n\n[Chorus 2]\n'Cause every time you come around\nYou be hollering that whoop-de-whoop, blah-zay-blah\nHe say, she say, oh my God\nShut the fuck up... scary ass\nEvery time you come around\nYou be hollering that whoop-de-whoop, blah-zay-blah\nHe say, she say\n\n[Verse 3]\nUh, I'm tryna learn something new\nI'm tryna better my chances of becoming a star\nI'm tryna feel the vibe of Mona Lisa\nStudying art... now paint that picture\nLife behind bars, remember the very day I got caught?\nI murdered a rapper, and you filed the police report?\nSee what I was taught, family is all I need\nBut indeed them too can run me right up a tree\nConstantly talking shit 'bout the next relative\nWanting me to take sides, but I'd never give in\nEver since grandma died, everyone parted ways\nArgue on holidays, left my uncle in prison\nFor 15 years, no one paid him attention but moms\nYeah, my momma as loyal as any sister would come\nCome to my house just to yap about your own people\nDang, and if your blood wasn't running through my veins\nI would prolly cut y'all off too, yep\n\n[Chorus 3]\n'Cause everytime y'all come around\nY'all be hollering that whoop-de-whoop, blah-zay-blah\nHe say, she say, oh my God, shut the fuck up\nKeep it running, Ali\nEvery time you come around\nYou be hollering that whoop-de-whoop, blah-zay-blah\nHe say, she say\n\n[Outro]\nSo tell 'em, \"Shut the fuck up!\"\nTell 'em, \"Shut the fuck up!\"\nYeah, bitch, you boo-boo, you T'd\nYou turnt down, you thirsty\nTell 'em \"Shut the fuck up!\"\nTell 'em \"Shut the fuck up!\"\nYeah, nigga, you boo-boo, you T'd\nYou turnt down, you thirsty\nYou thirsty, you boo-boo\nYou T, you turnt down\nYou boo-boo, you T'd\nYou boo-boo, you turnt down\nYou thirsty, you T'd\nYou boo-boo, you turnt down\nYou boo-boo, you T'd\nYou turnt down, you weak\nYou weak, yo’ bitch weak\nYo- (laughs)\nYou boo-boo, you T (laughs)\nKeep all that\n\n[Interlude]\nWhat is HiiiPoWeR?\nHiiiPoWeR is the way we think, the way we live\nSee it’s known today that the human race is nothing\nNo morals, no standards\nWhat we’re about to do is raise the level of expectations\nNo, you don’t have to have a lot of money\nYou don’t have to be rich\nBut you will be rich in mind and spirit\nSome say it’s as big as a crew, some say it’s as big as a gang\nHiiiPoWeR, we stand for it as if it’s as big as a religion"}], "artist": "Kendrick Lamar"}