{"songs": [{"lyrics": "[Chorus: Amil (Jay-Z)]\n(Alright yeah)\nWould ya love me? (Uh-huh, alright)\nWould ya hate me? (Watch this yo)\nI know ya love me (Alright)\nI know ya hate me (Uh Clue)\nWould ya love me? (Brand new Duro)\nWould ya hate me?\nI know ya love me (Feel this yo, uh)\n\n[Verse 1: Amil]\nUh, uh, uh\nSee me coming through hair done just a slinging my shit\nWith something Gucci on clinging to my hips\nFronting with the StarTAC ringing in the whip\nIcy ears, neck, fingers for years\nGot the show wild with the toes out\nShit, I don't fuck with no stingy nigga\nI rock Prada, Chanel, and Fendi, nigga\nWhat I'ma do with your little blunts and Henny, nigga?\nI'ma Major Coin with a pretty Bentley, nigga\nUh, my niggas will ride for me\nYou should see all the things they buy for me\nUh, it's obvious how I spend my time\nAround ballers all day don't have to spend a dime\nCallin' up room service when it's dinner time\nGet my tan on in the tropics in the winter time nigga, uh, uh, uh\n\n[Chorus: Amil (Beanie Sigel)]\nWould ya love me? (If we couldn't cop the drop)\nWould ya hate me? (If we couldn't drop the top)\nI know ya love me ('Cause you know we pop 4 Roc)\nI know ya hate me ('Cause you know we got shit locked)\nWould ya love me? (If we couldn't cop the drop)\nWould ya hate me? (If we couldn't drop the top)\nI know ya love me ('Cause you know we pop 4 Roc)\nI know ya hate me (And you know we got shit locked)\n\n[Verse 2: Beanie Sigel]\nAyo, we gon' stop this here\nGet this clear the general of the Roc in here\nBeanie Sigel, hottest thing on the block this year\nKeep the ego, we been bound to the top ya hear\nForget about it you don't know me yo stop the stares\nI've been about it, pop you then pop ya peers\nYou know how I do six coupe, top be clear\nYou know how I play low layer Rocawear\nCatch Sigel in the kitchen balloon in the pie\nY'all cats know from whom to buy\nY'all niggas know if y'all cross Mac, y'all soon to die\n'Cause you know I bring heat like June and July\nSpit like August\nI'm the truth I'm not lying\nI'm the reason why Jay feel comfortable retiring\nI gotta laugh 'cause y'all work hard at this shit\nThink about yo I just started this shit\nJust imagine if I put my heart in this shit\nScary sight y'all niggas feel me right\nGod damn yo I barely write\nBut every rhyme be in check like a pair of Nikes\n\n[Chorus: Amil (Beanie Sigel)]\nWould ya love me? (If we couldn't cop the drop)\nWould ya hate me? (If we couldn't drop the top)\nI know ya love me ('Cause you know we pop 4 Roc)\nI know ya hate me ('Cause you know we got shit locked)\nWould ya love me? (If we couldn't cop the drop)\nWould ya hate me? (If we couldn't drop the top)\nI know ya love me ('Cause you know we pop 4 Roc)\nI know ya hate me (And you know we got shit locked)\n\n[Verse 3: Memphis Bleek]\nYo, yo, well I'm gold now\nMemph Man, Coming of Age and I'm grown now\nSittin on chrome now\nI'm the youngest gun, I get it on with anyone\nI've been in 30 beefs shit I'm barely 21\nGuns I hold 'em like offensive linemen\nBring 'em back to the streets like a brick on consignment\nInterlining of the Mark Buchanan\nSpark two hammers\nMemph Man gold marks the understanding\n\n[Verse 4: Jay-Z]\nWe don't engage in war, we elope\nOrange juice style, beat niggas to a pulp\nWe broke nigga you just told 3 jokes\nMe, Biggs, and Dame we get some things\nSee the six? Dame's\nMe and Biggs live in the Range\nMine's platinum, his Champagne\nNiggas whisper 'cause if they talk they gets slain\nY'all's was looking for me on the charts the bricks came\nLeft the same night in the morning the chicks came\nI just use rap to put shit in my name\nThe death's just a matter of time the hit's been arranged\nContracts signed the shits in your name\nListen lame rap niggas, I'm the king\nMotherfuck the ring mami kiss the chain\nI don't got game to waste on y'all\nI don't think with my dick or chase my balls\nI'm a hustla, hit me with an eighth of raw\nAnd when I get on top I'ma blaze all y'all\nKeep 'em laced some more, I know you want some things\nI drink a lot of water, mami come clean\nChicks I pump her then dump her\nCars we got 'em bumper to bumper\nRap niggas y'all days are numbered\nNobody drop nothin' next summer, yeah\n\n[Chorus: Amil (Beanie Sigel)]\nWould ya love me? (If we couldn't cop the drop)\nWould ya hate me? (If we couldn't drop the top)\nI know ya love me ('Cause you know we pop 4 Roc)\nI know ya hate me ('Cause you know we got shit locked)\nWould ya love me? (If we couldn't cop the drop)\nWould ya hate me? (If we couldn't drop the top)\nI know ya love me ('Cause you know we pop 4 Roc)\nI know ya hate me (And you know we got shit locked)\n\n[Outro: Jay-Z]\nYeah R-O-C for the 2 triple O\nYa heard me\nYou are about to witness a dynasty like no other\nBeanie Sigel, The General\nAmil-lion, Diana Ross of the ROC\nMemph Bleek, Young God\nHa, ha\nJigga Man, get ya mind right niggas", "title": "Pop 4 Roc", "image": "https://images.genius.com/16c23bf8d7a8a73a71d30d2ec47600b1.1000x1000x1.jpg", "year": "1999-12-28", "album": "Vol. 3… Life and Times of S. Carter"}], "artist": "JAY-Z"}