{"songs": [{"title": "Organic Mud", "album": "Mr. Midnight", "year": null, "image": "https://images.genius.com/6659527e1d927b401e994eff3a8867ac.1000x1000x1.jpg", "lyrics": "[Intro]\nSh, sh, sh, sh, sh, sh, sh, sh\nSh, sh, sh, sh, ay, ay, ay, ay, ay, ay, ay, ay\nCheck\n\n[Verse 1]\nTapped in with Mike, got the old school hit\nSlidin' down High Street in Oakland and shit\nSaw my old game so I stopped and wave\nDamn, I ain't seen this bitch in days\nCar wash pimpin', I'm mackin', son\nEvery time you see me, I'm stackin' som'n\nI gotta stay healthy on a bitch\nMovin', groovin' on my shit\nRe-rock, flip a lot, movin' with a six-shot\nBought it how I want it so I went and kept the whip stock\nBallin, nigga? No you not, nigga, you's a mark\nGet you some money and get up out a nigga pocket\nAskin' me questions like, \"June, where the Bim at?\"\n\"Okay, you bought the AMG, I seen that\"\nAnd I don't even trap no mo', this all rap\nEverything a nigga talk about is all fact\n\n[Chorus]\nYeah, uh, nigga had to step it up\nYeah, damn, uh, off top, out the mud\nYeah, goin' hard on a slut\nYeah, check, uh, nigga, I don't give a fuck\n\n[Verse 2]\n'Bout to make a hundred thousand in a month, gimme time\nGot a whole lotta swag, so these hoes 'bout to flock\nI don't got a fuckin' manager, manage my own guap\nShit, I made it out these streets, so this rap shit is nothin'\nAnd my son gettin' older and my pockets is, too\nSellin' woowap for the high 'cause I got the juice\nWater purified, I don't fuck around with that, boof\nWeed, drank, baby goin' stu'\nMovin' me when we hit the scene, this ain't new to me\nMovie scene when we slidin' through, nigga, yee\nYou ain't cool as me, nigga, usually I be draped up\nBirthday lay bitch, always caked up\nAnd when I'm talkin' cakin', I'm talkin' big racks\nYou stressed out 'bout the bitch, 'bout to go bad\nI'm ridin' around smokin' weed in the Jag\nThey mad, forty piece got me on sag\n\n[Chorus]\nYeah, uh, nigga had to step it up\nYeah, damn, man, off top, out the mud\nUh, yeah, goin' hard on a slut\nYeah, check, uh, nigga, I don't give a fuck\n\n[Outro]\nRidin' 'round by myself\nIt's gon' get hard, but you gotta keep grindin'\nGotta keep— hahahaha\nSh, sh\nYeah, check, nigga\nBring the kid that card, I don't wanna hear that shit\nSh, sh, sh\nAy, ay, ay, ay\nSock it to me"}], "artist": "Larry June"}