{"songs": [{"album": "Activated", "image": "https://images.genius.com/dbf64d5289adc1fb1c700f63f63dfe25.945x945x1.jpg", "year": "2018-05-11", "title": "Light", "lyrics": "[Intro]\nAyy, ayy, what's up gang\nLet me go secure the M's for the gang\nAyy, ayy, what's up gang\nThose niggas still think it's my fault\nAyy\n\n[Chorus: Tee Grizzley]\nI got that check and took off (took off)\nAlot of these niggas look lost (they though)\nThey broke they think it's my fault (fuck 'em)\nWant smoke? We blowin', no cough\nI want the bitch, she caught (she through)\nI'm drippin', I'm stuck with the sauce (good drip)\nYo bitch be fuckin' me raw (good drip)\nBut she love you don't cut yo bitch off (yo bitch)\nBrand new Givenchy, it's white (that's light)\nLimited Louis, that's light (too light)\nWraith in the city, that's light (that's light)\nLED, look at the lights (too light)\nWe the ones niggas don't like (don't like)\nBut you niggas too light (too light)\nWhy even play with yo life? (yo, life)\nBank account lookin' like yikes (Bank account lookin' like yikes)\n\n[Verse 1: Tee Grizzley]\nI went been fillin' out kites, to puttin' an M on my block (scud zone)\nNew Gucci sweater is drip (that's drip), somebody give me a mop (that's drip)\nThese niggas act like the cops (like fuzz), gossipin' more than the thots (nigga what?)\nIn jail I had stripes off the rocks (stripes), I make you count off the rocks (get the fuck on)\nThese niggas think that I made it and can't get my friends, so they wanna be opps\nIf I see no niggas who hatin' and I'm in that spaceship, I'm droppin' that top\nI get that cake like my b-day, ain't no happy belated, I'm callin' the guap (call it, call it)\nWho gave you niggas a voice? Who told you your thoughts count? (what?)\nGPS straight to the money, I put my niggas in route\nThey told me got bricks in the drop, AR with the big Mickey Mouse (Mickey Mouse)\nYou poses your lady at 12, ain't that nice seein' my dick in her mouth?\nCameras all over the mansion (mansion), you lil niggas can't shit on my house (you dig)\n\n[Chorus: Tee Grizzley]\nI got that check and took off\nA lot of these niggas look lost\nThey broke they think it's my fault (fuck 'em)\nWant smoke? We blowing, no cough\nI want the bitch, she caught (fuck)\nI'm drippin', I'm stuck with the sauce (good drip)\nYo bitch be fuckin' me raw (good drip)\nBut she love you don't cut yo bitch off (yo bitch)\nBrand new Givenchy, it's white (that's light)\nLimited Louis, that's light (too light)\nWraith in the city, that's light (that's light)\nLED, look at the lights (too light)\nWe the ones niggas don't like (don't like)\nBut you lil niggas too light (too light)\nWhy even play with yo life? (yo, life)\nBank account lookin' like yikes (Bank account lookin' like yikes)\n\n[Verse 2: Lil Yachty]\nFuck-fuck with-with me-me boy\nCut off your hands and your fingers, 100 round in your ears with a ringer\nCock it back, watch it turn to a singer, get it fightin' like this Jerry Springer\nAll of my niggas on go-go, zip the AR back like the pogo\nDon't do dirty with these niggas, they popo, had a G Wagon trap turned to rojo\nFinally gave it to us in that cold-cold, heard the hoes goin' wild down in SoHo\nOne's black and the other one's Mexican, had the hoes eatin' dick like El Pollo\nYounger than you with a Maybach, younger than you with a Bentley\nFuckin' your bitch from the back, got her head in a pillow, she keep yellin' gently\nAin't being friends with these niggas 'cause when I was down not a soul had sympathy (facts)\nThat's how I go when you're broke (fact), now a nigga up like a mistletoe\nThis bitch want Lil Boat to do coke, bitch I'm fucked up on my own\nNot get lost on these new niggas clones\nFucked that bitch and she asked for a loan\nHad to laught then I told that bitch to get on\nBitch you gon' get that shit on your own\nAnd nobody give me not a thing, so I spend 90K on my ring\nYou can see all my pain in my watch, got my ex downin' bottles of scotch\nWalkin' 'round with my hand on my crotch 'cause I'm poppin' and I know you not\nAnd I know you see just how I'm livin', you not happy with life so you sippin'\nWalkin' reeboks on Tree Tops, gettin' hella guap, got a big Benz like Sasquatch\nEverytime you see a nigga with a bitch, know it's top notch\n\n[Chorus: Tee Grizzley]\nI got that check and took off\nA lot of these niggas look lost\nThey broke they think it's my fault (fuck 'em)\nWant smoke? We blowin', no cough\nI want the bitch, she caught\nI'm drippin', I'm stuck with the sauce (good drip)\nYo bitch be fuckin' me raw (good drip)\nBut she love you don't cut yo bitch off (yo bitch)\nBrand new Givenchy, it's white (that's light)\nLimited Louis, that's light (too light)\nWraith in the city, that's light (that's light)\nLED, look at the lights (too light)\nWe the ones niggas don't like (don't like)\nBut you niggas too light (too light)\nWhy even play with yo life? (yo, life)\nBank account lookin' like yikes (Bank account lookin' like yikes)\n\n[Verse 3: Tee Grizzley]\nThe opps on IG all the time (I see you), I dare them niggas go live (I dare you)\nWagyu steak, I dine (real steak), 8 oz, $255 (real steak)\nI can't get funky with niggas, my niggas so groovy, you niggas be jives\nIf I ain't had love for Meek (Free Meek), I woulda been trying' to get Nicki Minaj (what up Barbie?)\nI need a duffle a verse, I do a hook for a dime (a dime)\nPromoters on FaceTime before I get to the club, nigga, look at the line\nMoney ain't changed my heart but I'm smarter, I guess it changed my mind\nAnd I take care of my hitters in prison, don't think it's safe inside (stab his ass)\n\n[Chorus: Tee Grizzley]\nI got that check and took off (you dig)\nA lot of these niggas look lost (you dig)\nThey broke they think it's my fault (yeah)\nWant smoke? We blowin', no cough (no cough)\nI want the bitch, she caught\nI'm drippin', I'm stuck with the sauce (good drip)\nYo bitch be fuckin' me raw (good drip)\nBut she love you don't cut yo bitch off (yo bitch)\nBrand new Givenchy, it's white (that's light)\nLimited Louis, that's light (too light)\nWraith in the city, that's light (you dig)\nLED, look at the lights (you dig)\nWe the ones niggas don't like (don't like)\nBut you niggas too light (too light)\nWhy even play with yo life? (you dig)\nBank account lookin' like yikes (Bank account lookin' like yikes)"}], "artist": "Tee Grizzley"}