{"artist": "Ace Hood", "songs": [{"title": "Body 2 Body (Remix)", "album": "The Statement 2", "year": "2011-11-14", "lyrics": "[Intro: DJ Khaled]\nAyo baby, tell your friends to get with my friends\nAnd we can be friends, this the remix\n\n[Chorus: Chris Brown]\nBaby, you don’t have to try to read my mind\nCause you know I wanna get it in\nAnd tell me why would we just think about it?\nIf you want it then I got it\nWe can be body to body, body to body\nI don’t mean to rush you girl\nBut we should be body to body\nBody to body, body to body\n\n[Verse 1: Ace Hood]\nWhat it do lil' mama, I was thinking we'd get more acquainted\nBaby this the G-mix, we get heated leave them panties ain't it?\nShe say her last was super wack, his sex was overrated\nGotta give her the good I'm liking the wood and now it's over lady\nI give her that pound game, then I slows it up\nNibbling on ya ear, she love that teasing stuff\nSee you'se a nasty girl, with yo fine ass\nIf it's wet enough I might just need a wine glass\nHa, I'm super freaky, no top on the 'ghini\nNo flaw in my diamonds, a house on my pinky\nWe body to body, I keep me a hottie\nShe kinky as hell, get it off in the lobbies\n\n[Chorus: Chris Brown]\nBaby, you don’t have to try to read my mind\nCause you know I wanna get it in\nAnd tell me why would we just think about it?\nIf you want it then I got it\nWe can be body to body, body to body\nI don’t mean to rush you girl\nBut we should be body to body\nBody to body, body to body\n\n[Verse 2: Rick Ross]\nYou only live once, tonight we do it twice\nTell by your handbag that boy don't do you right\nBirking baby, go merk 'em baby\nGot some pocket change too, now ya working baby\nGot her the Bently coupe, she call that old news\nMy Tamara Braxton, doing shows too\nPaid well, like she supposed to\nI'm a made man, I'm into old school\nNo jewels, which is rough for me\nBut she's so cool, I kiss her carefully\nEmergency room, she was there for me\nRight back on my feet, I swear I'd never leave\n\n[Chorus: Chris Brown]\nBaby, you don’t have to try to read my mind\nCause you know I wanna get it in\nAnd tell me why would we just think about it?\nIf you want it then I got it\nWe can be body to body, body to body\nI don’t mean to rush you girl\nBut we should be body to body\nBody to body, body to body\n\n[Verse 3: Wale]\nIf heaven had a height then you would be that tall but\nYa see all we got is tonight and I ain't tryna see that far\nAll we need is convenient love\nAnd I don't mean convo when I say I wanna know how deep you are\nHa, look\nFlower bomb, matter fact she on that bong\nYou could ask me all you want, but my name ain't oh my god\nPassionate in that sack, passionate with this rap\nShe scratching all on my back, jaw-like fucking up my new tats\nGirl work it out, spread it out like word of mouth\nYou know I'm tryna kill that shit, make sure that urn is out\nNow we body to body, go inside and she shaking\nAin't too fond of relationships though my hobby is relation\nI ain't really been tricking but Ms. body's persuasive\nKeep yo mind out my business, I keep yo body in labels\nAnd I'm stunting, once expired my movements Gordo\nMy Penn Stated, I ain't lying\nShout out Mr. Paterno, word up, Wale\n\n[Chorus: Chris Brown]\nBaby, you don’t have to try to read my mind\nCause you know I wanna get it in\nAnd tell me why would we just think about it?\nIf you want it then I got it\nWe can be body to body, body to body\nI don’t mean to rush you girl\nBut we should be body to body\nBody to body, body to body", "image": "https://images.genius.com/6fa5d4ea047dabc03fd8f9eabeac8677.600x600x1.jpg"}]}