{"songs": [{"album": "CakeWalk", "year": "2010-05-17", "title": "Respect My Conglomerate", "image": "https://images.genius.com/d737d032384784252b6795bbaad6ddf0.800x800x1.jpg", "lyrics": "[Intro]\nHold on Jack Swain\nI forgot the most important shout out, Jack Swain\nShout out to this mother fucking money we about to make, god damn\nShout out to all this guala guala stupid dollar bills we about to make, god damn\nShout out to everything we doing, you feel me?\nThis J.I.D, wag effortless\nShout out Tay James\nShout out to god damn my brother\nShout out to everybody I fuck with\nIf I don't fuck with you then fuck you\nJ-I-motherfucking-D\nThat shit recording? Alright\n\n[Verse]\n’Cause my True Religion jeans look better with the holster\nAnd I'ma show you mine if you get any closer\nEastside soldier, big blunt roller\nIntroduction to me, can you scoot the fuck over\nElbow room, please\nGrab the Glock, squeeze\nSorry did I sneeze, wipe it on my sleeve\nMotherfucker, I'm me to the death\nAnd the game was slowed up, so we had to kill the ref\nChoke him with his own whistle right after he take a breath\nI’m the shit, cook it up, I'm the chef, believe that\n'Cause see that the green stacks in the safe\nAnd If you fuck with me, I'ma have to go Planet of the Apes\nKing Kong shit\nMurder you then smoke out of my green bong, shit\nCut off your dick, your balls for ping pong shit\nBut we on shit, stacks on stacks\nAnd if my mixtape, it's gone be stacks on that\nAnd if that don't go well, we can come up with some tracks\nAnd if all else fails, nigga crack on tax\nStraight up, yo me and [?] been had our weight up\nI'm always doing work in my LV gators\nKeep the AK in the trench for the haters\nYou talk shit now, your ass sure will die later\nYou feel me? You feel me?\nPull up with the semi, I pull up in a semi\nI pull up and they hear me, then leave in a Bently\nI don't think they feel me and I don’t think they hear me\nThey tried to offend me and now I’m full of Remy\nMy temper [?]\nQuick, quick with the grand slam\nBitch, I'm Kenny Lofton\nOprah the flow, why does he keep talking?\nI call my heat often\nOr in, my case the money comes often\nListen up, pay attention, I’m talking\nSo listen up, pay attention, I'm balling\nAll over the court\nAll in the night time, morning keeps talking\nI keep talking, I'm hearing\nI'm tired of hearing this track\nTherefore I’m off it"}], "artist": "JID"}