{"songs": [{"year": "2000-04-04", "image": "https://images.genius.com/b70930fc56c82c3038f706c659b43fc6.500x500x1.jpg", "title": "Off Wit His Head", "album": "Yeeeah Baby", "lyrics": "[Prod. by Just Blaze]\n\n[Verse 1: Big Pun]\nI don't give a fuck! Til I die, I'mma live it up\nHit em up, nigga what what, nigga what?\nBetter watch yo' ass 'fore I pull the choppers out the stash\nAnd helicopter yo' ass, about a block and a half\nCause I'mma ride for my niggas, die for my niggas\nPuff lye with my niggas til I'm high with my niggas\nWhere you at Prop?\n\n[Verse 2: Prospect]\nAiyyo it's off with his head\nLet the blood-shed, gets all my thugs down to bust lead\nYo I rep like one of the best, my Mac numbin your flesh\nThey on tracks but they runnin from death\nWho fuckin with 'spect? Yo dog, I'm the youngest to rep\nComin correct, niggas know I blow my gun in a sec\nCause I'mma ride for my niggas, die for my niggas\nPuff lye with my niggas til I'm high with my niggas\nWhat the deal Twin?\n\n[Verse 3: Big Pun]\nYeah baby! Ayo it's off with his head\nSlap the shit out the Devil and tear his horns off his head\nAyo it's almost over, few months we all gon' know Jehovah\nTil then I'mma keep the steel in the shoulder holster\nI ain't ready to die, bury me alive\nBut if my nigga got beef, we goin together tonight\nCause I'mma ride for my niggas, die for my niggas\nPuff lye with my niggas til I'm high with my niggas\nWhat you say Twin?\n\n[Verse 4: Prospect]\nAyo it's off with his head\nLeft a body stiff and dead with the infrared\nIt's hard to survive, disarm a whole part of this tribe\nWe taking niggas lives, so what? They tryin take mine\nWhat I'm supposed to do? Let shit slide like I was close to you?\nThis murder I write, pushin a hearse, let me chaffeur you\nCause I'mma ride for my niggas, die for my niggas\nPuff lye with my niggas til I'm high with my niggas\nWhat the deal son?\n\n[Verse 5: Big Pun]\nAiyyo it's off with his head\nNigga I was born in the fuckin Dawn of the Dead\nI always got my Dunn like I always got my gun\nFresh out the box, oiled and cocked, Glock 21\nOnce I've begun to pop, I ain't gon' stop til I'm done\nSo either call the cops, or bust a shot - nigga uhh\nCause I'mma ride for my niggas, die for my niggas\nPuff lye with my niggas til I'm high with my niggas\nHold me down Pros'\n\n[Verse 6: Prospect]\nAiyyo it's off with his head\nPut that nigga to sleep and make a coffin his bed\nI come from rough times where niggas bust 9's and be like fuck rhymes\nAnd puff dimes, living on front lines, and lust crimes\nYou better trust mines, I'm down for the cause\nGimme a round of applause and hear the sound of the 4's\nCause I'mma ride for my niggas, die for my niggas\nPuff lye with my niggas til I'm high with my niggas\nWhat the deal kid?\n\n[Verse 7: Big Pun]\nAiyyo it's off with his head\nCock the lead redecorate the crib burgandy red\nAiyyo I never front, I want whatever nigga to stomp\nWhoever want it gonna get lift with the pump\nI mention I'm dumb, my trigger finger fittin to jump\nGot the whole left side of my face twitchin and stuff\nCause I'mma ride for my niggas, die for my niggas\nPuff lye with my niggas til I'm high with my niggas\nTake us home Dunn\n\n[Verse 8: Prospect]\nAiyyo it's off with his head\nHe ain't really want it so he lost it instead\n\"Picture Me Rollin\" like 'Pac in the drop, my style too hot\nTo figure out, oh Lord, please don't make me put this nigga out\nMy trigger shout through your area code\nThe scary explos', your click get, leary of foes\nCause I'mma ride for my niggas, die for my niggas\nPuff lye with my niggas til I'm high with my niggas\nNow it's on Twin - now it's on Twin\nYeah, hah, now it's on Twin\n\n[Outro: Opera Steve]\nTerror Squad, Big Pun, The Don, Armaged-deon\nProspect, Triple Seis, Cuban Link, Terror Squad"}], "artist": "Big Pun"}