{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "Cross My Heart (The Chalice Version)", "album": "The Chalice", "lyrics": "Billy woods ft. Kong - “Cross My Heart (The Chalice Version)”\n[Emcee(s): Kong and billy woods]\n[Producer(s): 007 (AKA Bond)]\n\n[Hook: Kong]\nI cross my heart, don’t hope\nTo die.  I’ll socialize with open eyes\nCross my heart, don’t hope to die, socialize with open eyes\nI’ll cross my heart, don’t hope to die\nI’ll socialize with open eyes\n\n[Verse 1: Kong]\nHear the cries and the lies\nYour lies turn to alibis, mental uncircumcised\nOnly when the curtain rise, pain in the tears\nThe rain came in years, I ran from the fears\nThe game’s switching gears.  Fourth year, let’s get off here\nThe Source is here.  The Source is the cross, the cross is here\nDon’t look at The Horseman.  I’ve seen the light under\nThe darkest night, sparking bright, often bright, but I’m\nNauseas from the height of a lot of bottles flipped, living\nFor the luscious lips, a luscious chick sucking dick.  Saint\nGot me speeding, fiending for indecently treating\nPleading for reason, need a meeting with the son of “thou\nShall not”\n\n[Hook: Kong]\nCross my heart, don’t hope to die.  I’ll\nSocialize with open eyes.  I’ll cross my heart, don’t hope\nTo die, I’ll socialize with open eyes, I’ll cross my heart, don’t hope\nTo die.  I’ll socialize with open eyes\nI’ll cross my heart, don’t hope to die\n\n[Verse 2: Kong]\nWhat’s the profit of a man\nThat gains the whole world but lose his soul for glycerin gold?\nGolden glycerin, heart of nitroglycerin.  Now listen\nTo portion of book that he was mentioning.  My days\nIs scarred, I pray to God, I cross my heart, don’t hope to die\nI’ll socialize with open eyes.  I’ll cross\nMy heart, don’t hope to die.  I see the pain in the street\nWhen I rock on the block with the Glock cocked, niggas can’t\nFuck with the Kong when I’m raw on the spot.  Niggas\nStraight-up hesitate the fuck with this ‘cause, to fuck with me\nYou’ll get the gun kiss—blao!  Niggas is\nPlowed out, niggas assed-out, passed out when I walk\nThrough the block, niggas is...\n\n[Verse 3: billy woods]\nFuck what you saw.  Bloodstains\nBy the front door, a nigga crawled from the store, hands raw\nI knew I’d seen him before.  I’d do wrongs of\nPushing stolen cars, face black as char.  All is\nFare in love and war, nobody keeping score no more\nMomma would say, “What you crying for?” then hold\nMe close like soldiers grip toast and rosaries.  Battle-\n-field ghosts, they like holding the throats of the condemned\nAs they choke, dance from the rope.  That which doesn’t\nKill makes me stronger—hard to feel when pain\nBecomes armor.  For better or worse, wound or hearse\nSum it up with a curse: do your worst.  Just one more verse\nGame over.  One more quarter, one more\nDash for the border.  Get your papers in order\nAwful Dodger, Tommy Lasorda, sort of drop\nOne more mortar, knowing when they catch me, it’s torture\nDavid Lynchian torture, face-down in the River\nStyx, throat slit, pendulums and pits, hoes\nDitch.  Been rich, been broke as shit, trade\nNicks for wicks, dreaming licks between steel sips\nBattery acid wetting my lips, hock is spit\nHell naw, I ain’t gonna quit\n\n[Hook: Kong]\nI’ll socialize with open eyes.  I’ll cross my heart, don’t hope\nTo die, I’ll socialize with open eyes, I’ll cross my heart, don’t hope\nTo die.  I’ll socialize with open eyes\n\n[Outro: Sample]\n“Too bad you fucked up, dummies” - Sample from Ghostface Killah on Raekwon ft. Method Man, RZA, Masta Killa, and Ghostface Killah - “Wu-Gambinos” (x5)"}], "artist": "​billy woods"}