{"artist": "Azealia Banks", "songs": [{"title": "Can’t Do It Like Me", "image": "https://images.rapgenius.com/98a3f53453312b83ba1c74e068c25df3.600x600x1.jpg", "album": "Slay-Z", "lyrics": "[Verse 1]\nBitches better off leavin' their mans at the hotel waitin'\nPlaya's drinkin', posted up flingin' out bands\nThat's for them hoes be naked\nPoppin' pussy, rollin' it, shakin' it\nSmokin' hot, boiling pot\nShe got that cho-cha, that cobra, that clutch 'em up\nI make 'em wild, I make 'em holla\nI blow these niggas away now\nWon't fuck a nigga twice\nSmokin' aces, rollin' dice\nRice and peas on my hips and thighs\nPython g-string hypnotize 'em\nMotorboat, motorbike\nYou should be lucky I even acknowledge you\nYou should be lucky I shot you that alley-oop\nYou was just cruisin' the streets, nigga\n\n[Hook]\nPretty A.B., them bitches can't do it like me (no way)\nAmerican dream, pussy be peppermint clean (okay)\nYou sweatin' that steez, I'm hot like a hundred degrees (okay)\nPretty A.B. bitches can't do it like me\nPretty A.B., them bitches can't do it like me (no way)\nAmerican dream, pussy be peppermint clean (okay)\nYou sweatin' that steez, I'm hot like a hundred degrees (okay)\nPretty A.B., y'all bitches can't do it like this\n\n[Verse 2]\nCustom bodice, that bougie babe\nThat diva donna, that...\nChocolate bombshell, honey glazed\nShe bustin' out of her bustier\nRich niggas, what up?\nBurn them fuckin' hundreds\nChristian Lacroix fits, fill her pockets\nTrips to the tropics, I want it\nI let him spend this paper, but I never lick his lolli'\nHe eat my pussy out and sing to me like Champagne Papi\nLodi-dodi, now who gon' fuckin' stop me?\nI'm chasin' the buck, I get it\nThat's why niggas got to watch me\nWoke up in the projects, ended up in Tijuana\nI had to fill my pockets, had to holla at my gualas\nDollars, commas, get it, the whole enchilada\nDame pesos, papi, tu prende nigga, copy\nShout out to my ockees and all my freaky hotties\nBitches gettin' money, smokin' like selassi\nLet me rub them hundreds all over your body mami\n\n[Hook]\nPretty A.B., bitches can't do it like me\nY'all bitches can't do it like me\nPretty A.B., bitches can't do it like, uh, uh\nY'all bitches can't do it like this\nPretty A.B., bitches can't do it like, uh\nY'all bitches can't do it like this", "year": "2016-03-24"}]}