{"songs": [{"image": "https://images.genius.com/119468569700cf58e095e16b7473e753.800x800x1.jpg", "title": "Down With The King 2011 (Mick Boogie Remix)", "album": "Doobies x Popsicle Sticks", "year": null, "lyrics": "[Hook]\nYou know I'm down with the king\nThe king\n\n[Verse 1]\nI a king in a pair of jeans\nBrooklyn born so I'm always close to queens\nI'm close to fans, you just close to means\nInternet rap nuckers ? is he\nHold your dreams, and hold your horses\nI'mma bodied the beat and close the caucus\nI'm ? sworn, and close to honors\nMy protes go on until I'm Nostradamus\nIt's simple, yet invective,I don't want to next\nI'm invested, cells talent infested\nNot a day pass I forget what I blessed with\nSay no more of me than whoever they've slept with\nF for shallow flow, I got a death wish\nOne of the best since Shey dropped breakfast\nThis is all I know, and all I owe\nNever less than a four mic flow\n\n[Hook]\n\n[Verse 2]\nI'm down with the King of the cut, and what?\nAdidas on my feet, I never rock And 1\nThat's word to Run DMC me emceeing\nCatch me on TV route touring European\nBlank out the canvas, then crank out a classic\nBlack out with rapping, the packed house is clapping\nThanks for the support, you can find me in the air port ?\nBackpacker ain't a dirty word no ?\nI prefer 'em north faced to pack my big words\nAs long as jams work, I'mma keep keep making 'em\nChop up the samples I'mma put a put a pace to 'em\nScroll on you ho's like bar tend\nDrag bar ? if I got no pen, yo\nWhere the words at?\nLove letters to the letters\nIt's Don Doug nobody does it better than\n\n[Hook]\n\n[Verse 3]\nSo hot, in winter time I could enjoy summer\nTrying to be the white chocolate boy wonder\nIf Stevie could see me, it's la-di-da\nCause it's three like the stripes on the ad-di-das\nLaid back in a Maybach, breeze in a jet\nYeah it's crossed my mind like a sleeve when I sweat\nMan, even Eli agrees I'm the best\nWith a shield on the mic, MP's on the desk\nHere the wheeze from the breathe\nCatch Z's when I rest\nSpend cheese from the checks\nWhen it's G's that's the best\nEmcee in the flesh\nWhen I'm spinning CD's in the decks\nTechnology has spoiled me\nWhile I'm thinking about the punk motherfuckers with no loyalty\n6th Sense, Tonya Morgan pretty Nitty of course we're royalty\n\n[Hook]\n\n[Verse 4]\nOk, All Day I Dream About Sneakers\nDream about bumping out your speakers under bleachers\nRaw hip-hop yeah we do it in the park\nGot the ones and the twos like they did it on the arc\nEasy to kill it when they singing along\nBut yo, can you move the crowd when the crowd don't know your song?\nIt's an emcee habit, emcee's have it\nMy mics to nice, to let have a femcee grab it\nNow, who's saying girls can't rap I got that new boom bap\nYou know the tunes on tap\nFlowing in my zone, so they be throwing stones\nBut I just recollect them, and I build me up a throne\nCause I'm down with the king and I'm down with the prodigals\nCan't won't stop, till the back drop drop it go\nHow we got McBoogie on the chronicles?\nMake the impossible I M possible"}], "artist": "Nitty Scott"}