{"songs": [{"image": "https://images.genius.com/8acc2c921ff6defb4a5463597263ff0e.750x750x1.png", "title": "Icey", "album": null, "year": null, "lyrics": "(Nelly)\nI got a whole heard of cows ta die for my 6'\nHockey players pagin' me to practice on my wrist\n20 inch chocko treads so my whip don't slip\nPullin' up bringin' joy like my nigga Baugette\nIf I go on a rampage then watch my mo' flip\nDraw from both hips, emptyin' both clips\nGot a whole lotta niggas wanna ride wit' me\nNow that a niggas so hot, can strike fire from me\nThinkin' Nelly 'posed to take 'em outta poverty\nBut when I tell 'em no, they think of robbin' me\nSon ain't no stoppin' me, some are home at Iceland\nHang with penguins, like that's my reason (that's my reason)\nLike Berkley we'll find the part that's freezin'\nLast time you seen Nelly, snowin' in June\nYou ever had a bicoastal orgy happen off in yo' room\nBut what happen's in Cancun, stay's in Cancun\n\n(Chorus-2x)(Nelly)\nIcey that, icey this\nIcey neck, icey wrist\nIcey cris, I see miss\nIcey 6 tha sea six\nIcey fits on five, icey tips\n\n(Keyuan)\nI live a nice way, I store my jewels in an ice-tray\nHow you want it, the man or the mice way?\nTalk 2 of these karats, call me in tha mornin' have an ice-day\nI stay in more leather than Andrew Diceclay\nYou might say I'm arrogant, just because I ain't sharin' it\nIf the check ain't seven digits, I'm tearin' it\nIf the 'Tics can't fit in my whip, then I ain't steerin' it\nBomb that rifle cuz, now a nigga wearin' it\nCatch me on my set wit' my iced-out chain\nAn iced-out rapper wit' my iced-out name\nA cold hand shake because of my pinky rang\nIced-out Cordeara's with an iced-out frame\nCatch me in an iced-out Range wit' icey dames\nPuffin', bling-bling, while she do tha damn thang\nI'm spendin' half my changes on clockin' thangs\nAnd I got a icey game like hockey man\n\n(Ali)\nI gave knowledge to scientists who brains was locked\nThey didn't know that Iceland was just my jewelry box\nAnd then the South Pole, that's when I used to slang O's\nAnd moved to keys and bought diamonds outta control\nMy poppa, Snow Man, momma, Eskimo\nSo many rats that I need pest control\nWould cop from Jacob, but I don't know where he at\nSo 'till I found that cat I guess I'll roll wit' Zach\nAnd puff sacks in the hydraulic-dancin' cars\nGotta a caulus on my hand for poppin' Branson jaws\nBitches be prancin' hard cuz they know we maintain\nWith enough ice to freeze rain in a woodgrain Range\nDual exaust playa, I keep some soft\nIt's da gloss-boss, the floss-frost across the Randy Moss\nUntil we meet again, y'all keep on servin' 'em out\nNicky Sach, AKA, George Durban, what?\n\n(Chorus-2x)\n(Murphy Lee)\nYoung dude 'bout to do this like a veteran\nLong shorts, tall Timberland's\nFlossin' in my icey Vokal, Varsity letterman\nIcey headband to hold my baby-dreads in\nThat's what it is, what 'of that a been\nCuz when I get cold I freeze, when I'm hot, I'm water\nOn ice at all times, hittin' hockey player's daughters\nI'm like Ralph and the Honeymooners (Why I oughta!)\nPut ice on the S-T-L and my role model for startas\nI'm like icey as frozen foods with frost big friends\nWho all like 'em thin with icey rear-ends, nine outta ten get hit\nSeven outta nine givin' icey head in the icey whip\nSchool boy keep a icey fit for icey mits\nWho like icey that and icey this\nSmoke a icey spliff gettin' icey licked\nBy these Pizza Hut delivery chicks who love tips\n\n(City Spud)\nAiyyo, I'm icey when you say Lunatics gon' ride\nLove when ya call me to make yo C.D. hot\nMet this man sayin', \"How you go from bottom to top?\"\nJuan B beside me when I do T.V. slots\nNow I'm at the bar floatin' from the icey jaw\nKnow who we are when I pull up in tha icey car\nI ice the chain cuz niggas got twice the change\nI ice the ring and niggas go to sortin' the game\nSo if I'm hot, I'm hot, if you not, you not\nAnd if I'm clockin' dough, let me tick and tock\nAnd if love ready to rock, yo I'm hot to trot\nCourtney B. ready to rock, I'm hot to trot\nYellow Mack ready to rock, I'm hot to trot\nCougar Love say I'm hot then I'm buyin' a yacht\nAnd a drop to shock these niggas who jock D's\nThink he might shock Eve, like the icey watchee\nPut these on six e's, if I want it I get it\nI do it for publise so honeys'll love this, ugh"}], "artist": "Nelly"}