{"artist": "G Herbo", "songs": [{"title": "4 Minutes of Hell Part 2", "album": "Road To Fazoland", "year": "2013-05-03", "image": "https://images.genius.com/4f78a2d5dbd1ec2e170944bf72a2852b.392x380x1.png", "lyrics": "[Intro]\nGang!\nNo Limit MB\n150 Roc Block Man\nR.I.P. them niggas\nWelcome to Fazoland coming soon\nJust be patient\nI know that's what ya'll been waiting for\n\nLet's Get It!\nFree them niggas\n\n[Verse 1: Lil Herb]\nLook I wake up every morning with the same state of mind\nBitch I'm running to this money\nLet the lames wait in line\nI'm impatient\nBitch I'm chasing\nThis first place and we not racing\nNow I'm cashing\nRiding Astons\nWent from sitting in the station\nBut I'm up now\nAll the neighborhood hoes wanna fuck now\nI can't let chain me up like a chump now\nI just call my lil bros let her bustdown\nSee Jackie at the top when you touch down\nI done lost a lotta niggas to this street shit\nHad to duck a lotta triggers to this street shit\nI done seen a lotta niggas do this street shit\nBut the streets talk when you in deep shit\nTaught me get rich cause you can't beat this\nGotta stay afloat niggas getting seasick\nGotta get the dough I ain't with the cheap shit\nFor everybody ever said I wouldn't be shit\nSeen my homie hit twice coulda been three\nAlmost seen Christ twice coulda been three\nI'mma burn these pipes 'fore they get me\nI had to earn my stripes coulda went sweet\nNow I separate from niggas I don't trust\nNiggas that ain't starve with me\nAnd all them bitches I ain't fuck\nCause I was working hard\nMix matching words straight in that booth attaching verbs\nHerb gon' get what he deserve and I deserve it all\nGot some shit a couple labels heard\nNow they want Herb to ball\nGet me out the hood and in them hills\nMan I done heard it all\nBut honestly, my niggas honor me\nWon't leave that hood at all\nAnd honestly, No Limit sponsors me\nMe and my hood gon' ball\nResponsibly I keep my promises\nNo need for compliments\nI do as I please like the G's\nFuck the consequence\nYou boys ain't in my league\nGot my speed or accomplishments\nMight catch me overseas smoking weed eating Lobster tail\nOr I'm probably over East where they pop you over beef\nDissing 'bout them L's boys until they spot you in the street\nNow they got you in the streets\nWith nun' to block you from that heat\nAin't no boxing over East\nMy youngins pop before they speak\nThat's the way it go in my city\nThey trained to go in my city\nWe dream of sunny days\nBut it rain and snow in my city\nThem things will blow in my city\nThem boys be feeling anger\nCan't just be hood on hood\nThem boys be killing strangers\nEverything ain't good all good\nIt ain't the same when your mans draw blood\nNiggas change when the gang draw blood\nWhen it's cold in the game\nNiggas don't know your name\nHave you posted on the block\nGiving blows in the rain\n16 toting Glocks thinking those are the things\nNow you on top riding fours on a range\nEverywhere niggas claim yall cuz\nNah it ain't all love where I meet you at\nNiggas want Herb man that's why I keep a strap\nPosted over East man where them heaters at\nRun up on me bro let them heaters clap\nAnd dear Lord I pray\nThat on the day when you take me away\nI got enough money laid in the safe\nTo make sure my moms and my sister they straight\nBut the Lord coulda took me today\nLet a nigga run up on me cook me today\nIt wouldn't be easy I stay with the Eight\nOr I make one call have them K's in his face\nCatch me in the mall spending K's on my waist\nAll I know is ball\nAnd I do it harder than ya'll\nIn the club, throwing racks got your broad off the wall\nOff the Po' up leaning so hard I could fall\nCodeine\nPour me up\nTriple cups\nFours a night\nSmoking dope\nSipping lean\nPurple sprite\nHold the ice\nMe and broski riding in that challenger high as fuck\nAny nigga challenge us\nDuck when we riding up\nBuck at the nigga back\nBuss till the nigga flat\nOne to his fitted cap\nWatch how the nigga act\nSkeet off\nDrop the heat off\nCall an ass to hit\nPick her up smash the bitch\nV12 fast as shit\nDudeski call it Activist\nI'm gon' off a six\nI ain't lackin' while it's crackin'\nSomething long on my hip\nBig pole nigga\nYou gotta be strong just to live\nQuick soul lifter\nThis will get him gone in a jiff\nLeave a nigga right there on the block where I'm at\nRiding through kids and Marley in a lot with the Mac\nRiding through trigger we gone leave you stinging from the black\nNigga lay a couple bricks on a mat\nWe on that\nApologies you don't want that\nRun upon us with the chance you ain't blow that\nToo bad man I feel for you\nSay you eating man I hope your squad got a last meal for you\nCatch a nigga in the store we blow him\nCatch a nigga with his ho we blow him\nCatch a nigga he don't got it we smoke him\nCatch a nigga out in traffic we on him\nNiggas think they want static do they really?\nAsk me why I start rapping do they hear me?\nBut this shit ain't only rap cause it's in me\nWe ain't worried 'bout your stack we got 50's\nPut No Limit on my back for the city\nAnd No Limit's where it's at in the city\nRight on Essex where I'm at come and get me\nRight on Essex where I'm at come and get me\nL's\n\n[Outro]\nNo Limit MB\nGang!\nGet More crack when my tape drop\nGet More crack when my tape drop"}]}