{"songs": [{"year": null, "image": "https://images.genius.com/ce9a0317f67940b823d8370135d930af.500x500x1.jpg", "title": "Interdependent", "album": "Dirty Pretty Things", "lyrics": "[Rapper Big Pooh]\nThe world's on my shoulder, weight gettin light\nAs a nigga gettin older, likes I had fewer\nMy words on the skewer, people tryna live\nReal life behind computer, a bunch of manure\nThe track's like the doer, the biz might take it\nClimb to this point and you said I wouldn't make it\nSpirit couldn't break it, aim for the spine\nI played it so +Cool+ like the member of The Time\nI +Pledge to the Grind+, shout to my man\nKilla Kill for the line, homie in due time\nSelf-evaluation, lookin in the mirror\nAt my own situation, Pooh practice patience\nNo motivation needed, I got plenty\nA house was a home and that muh'fucker empty\nLabels couldn't pimp me, fam couldn't simp me\nSimply, even manpower couldn't tempt me\nRobins wouldn't push me, life ain't that cushy\nHeard they searchin for some real shit, I'm here!\nNiggas obsessed with the here right now\nMy head take a bow, thank you God for the year\nThis is my struggle, this is my pain\nEven when it's over, I forever have a stain\nEmotionally drained, married to the game\nThis is Chapter 2, welcome all to the change\n\n[Interlude]\nIf you could ask me like, five-six years ago\nWould I be at this point where I'm at right now?\nI'da been like, \"I don't know\"\n\n[Rapper Big Pooh]\nThis is more high quality, right brain thinkin\nCheck my astrology, when you hear me\nIt's LB 'til the day I fade, played the back\nBut still history I made, get hit pimpin\nDown the block, round the corner from the easy livin\nNeighborhood still the same but I'm more driven\nSendin beats to the grave, rap's mortician\nGo hard or go home, I ain't got a pension\nWho the fuck shootin for just a mere mention?\nIn for the fight of life, time to knuckle up\nI'm Tracy Chapman's +Fast Car+, better buckle up\nConfidence overflow, pass another cup\n\n[Outro]\nI mean, I don't know where I'ma be five-six years down the road\nI-I mean, I don't know! Y'know, all I know is that\nI'ma keep, keep consistently puttin out dope shit\nAnd I'ma keep comin, new and improved\nYou know what I'm sayin? All I wanna know is\nIs you gon' ride with me? Is you gon' take this journey?"}], "artist": "Rapper Big Pooh"}