{"songs": [{"title": "Stand Up", "album": "VYP: Voice of the Young People", "year": "2008-04-28", "image": "https://images.genius.com/638b0a7f368a3faa2d1adfb605f4b99c.400x400x1.png", "lyrics": "Why don't you come around, my way(way) my way my way(way) my way(way) [x2]\nWhy don't you come around?\n\nUh, Uh, Uh, why don't you come around (way, way, way) why don't you come around\n\nWalking down Williams through Mart and Blays(mart and blays)\nCall it Big Steps where I used to play(used to play)\nThe girls in the park gotta lot to say(lot to say)\nThem girls over here threw they life away(life away)\nCause they got babies and they just now head(just now head)\nThey double numbers they mamas promoting this here\nThe boys on the court playing basketball(basketball)\nThey baby fathers they rather be boys and that's all\n\nBlays Rd. Stand up! (uh)\nPre K Stand Up! (uh)\nEast Coast Stand Up! (uh)\nYou should\nCome around my way [x2]\n\nI'm from a place in Harlem\nWhere the streets they look like Africa\nAnd the trees are in better condition than the homes so abandoned\nP S 197\nWhere I study my academic stare run\nAnd the books so worn and torn I can't think\nHow they tried to cripple me\nUnderstood the lost side of me\nThank god I had a good teacher on the side of me\nShowed me the right thangs to do\nOvercame these obstacles\nHaters stand up for the things that we've been through ooh\n\nBlays Rd. Stand up! (uh)\nPre K Stand Up! (uh)\nEast Coast Stand Up! (uh)\nYou should\nCome around my way [x2]\n\nHere we got these buildings called projects but they ain't three stories\nThey fill about ten on the block april flow go up by twenty\nStories I tell be true story kids cut school and watch Maury\nLike if they ain't intelect in what's affecting my life I can't respect them\nBut that's just they way of the ghetto\nPeople who come from where I'm from get it\nBut we still gotta make a difference\nStand up tall so the world can get it\nTeach kids pride insted of \"Outside\"\nShow another side and they show gon' rise\nStop letting responsibilty fall\nI can tell you ain't been aroung my way at all\n\nWhy don't you come around(way)\nSo you can see what my(way)\nEyes been seeing why(way)\nWhy don't you come around\nWhere we need directions(way)\nRespect in every lesson(way)\nWay, why don't you come around\n\nMy way(way) my way my way(way) my way(way) [x2]\n\nBlays Rd. Stand up! (uh)\nPre K Stand Up! (uh)\nEast Coast Stand Up! (uh) [x2]\nYou should come around my way\nYou should come around\n\nUh, Uh, Uh\nUh, Uh, Uh"}], "artist": "Lil’ Mama"}