{"songs": [{"image": "https://images.genius.com/635946fa12a6130ad2bb3f3bbd4da01c.600x600x1.jpg", "title": "Hands Up", "album": "NF - EP", "year": "2014-08-05", "lyrics": "[Intro]\nA few words to define my music?\nI'd say it's pretty laid-back\n\n[Chorus]\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up, hands up\n\n[Verse 1]\nYo! Yeah, I'm like Ali when I write hooks (Yeah), get it? Right hooks\nThese songs are like the chapters of my life and this is my book\nYo, you seein' me on these stages, go into a song, I'm turnin' these pages\nTurn the pages, welcome to chapter one of my life: \"crazy\"\nYeah, let's call it that if ya'll don't mind, I got a dope mind with these Pope lines\nI don't smoke, I'm in a cold climate, so ya'll better hold on\nThey tellin' me that I'm loco, um, tell me something I don't know\nAin't that a clear picture, no photo, yeah, clear pictures, no photo\nAnd yo this ain't about the photos or the fame life (Nah)\nI kill my flesh and live for God all in the same life\nSo call me what you wanna, but I'ma do what I gotta, yup\nAnd anybody got a problem, shh (NF real music)\n\n[Chorus]\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up, hands up\n\n[Verse 2]\nAnd yo, I started from the bottom, no Drake though, Yeah, I came in the game like, \"hello\"\nI came in the game like, \"Let's go\"\nOh, this beat might break your neck bones\nBut that's okay, okay\nYou ain't heard of me, then you so late\nSo just take a seat of that cold plate\nAnd just let-let-let-let me explain\nYo, \"NF\" be the logo\nCapitol be the label\nIf I see beats on my table\nI swear, I'ma eat the whole plateful\nAnd that's my life\nI write what I mean so I might\nGo a little bit cray when I find mics\nI ain't doing it so I am in the limelight, 'cause that limelight, it ain't nothin'\nAm I in this for the money? Hey, quit crackin' jokes\n'Cause we all know this industry is known for cuttin' throats\nAnd if this was all for money, I'd have quit years ago\nBut it's not, so turn me up until my ears explode, let's go\n\n[Chorus]\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up, hands up\n\n[Bridge]\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up\nHands up\nOh let me see those hands up\n(Where you at? Where you at?)\nLet me see those hands up\n(Where you at? Where you at?)\nLet me see those hands up\n(Where you at? Where you at?)\nLet me see those hands up\n(Where you at? Where you at?)\nHands up\n(W-w-w-w-where you at?)\n\n[Chorus]\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up, hands up\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up\nLet me see those hands up, hands up"}], "artist": "NF"}