{"songs": [{"title": "Knowledge is Power", "lyrics": "[Verse 1: Akala]\nWe claim we’re lovin’ this Hip Hop\nAre we ready to understand it\nIn its fullest cultural state\nBeyond its useless branding\nBeyond the story that keeps us feeding us the common myth\nPeople started rapping in the 70’s what a bunch of shit\nDone with the talk\nIm lovin New York for impact in my heart\nBut lets not pretend there was no foundation to this art\nBecause KRS-ONE and Bam would be the first ones to say\nBirth of Hip Hop runs far deeper within our veins\nBefore Kool Herc came to New York pumping 100 watts\nBefore the Watts Prophets, Last Poets and Gil Scott\nBefore there was Jazz\nBefore there was Blues\nBefore there was Cab Calloway\nBefore the whips the ships and all the tragedy\nBefore we were stripped of Knowledge of our cultural anatomy\nYou could be apart for generations you’re still family\nBefore there were slaves, fuck the bullshit about slave music\nYou must have had a cultural base to even produce it\nThe schools of Timbuktu they already knew\nThe cycles of the planet and the motion of the moon\n150 years before Galileo, check it\nAnd medieval Benin’s in the Guinness book of records\nAnd all of them cultures there… they had a Griot speaker\nA storytelling musician poet and history keeper\nWho had to memorise a couple thousand oral epics\nThe tradition still exists today but it could get neglected\nAnd Hip Hop? Needs to be understood\nIn its fullest context not just as a product of the hood\nCos Miles Davis was rich and still played with the same feeling\nIt’s that cultural memory go and ask Steven\nElla Fitzgerald scatting's basically rapping\nWhen we know we lost our language then you know what has happened\nSo when you hear somebody’s rapping, the base of it is African\nIt ain't about excluding no one; it's just accurate…\n\n[Hook: Akala]\nKNOWLEDGE...IS...POWER!\nDon't let them tell you 'bout yourself\nNever that's your wealth\nKNOWLEDGE...IS...POWER!\nIf you dont feed your mind how can you live in health?\nKNOWLEDGE...IS...POWER!\nDon't let them tell you 'bout yourself\nNever that's your wealth\n\n[Verse 2: Akala]\nLook around hip hop’s becomes this global voice\nBut we must understand its roots so we can have a choice\nWhat we should do with it how to use it\nHow to teach our students\nCos Viacom is not our cultural institution\nBut it will use this culture for its prostitution\nAnd our destruction, anything but a solution\nThe ghetto dilemma's as bad as its ever been\nPeople are dead, just ain't rememberin'\nRoots of the rhythm and bass\n[?] thing is as good as the parts that assemble it\nHamlet is writing, we think the pencil is\nPeople are sacred, we think the Temple is\nIf i'm uncomfortable you shouldn't mention it\nIm superior so watch your sentences\nDon’t disturb my privileged pensioners\nLiving off ignorance of all the members of\nEvery one of all the people we severed off\nNever one of all the people we’re never soft\nAny gun or the better we sell it off\nAny sum of all the cheddar we level off\nCultural suicide is a necessity\nTo get you to worship celebrity\nCos people with a strong sense of themselves could say that we’ll never be\n\n[hook]\n\n[Verse 3: Akala]\nWhen they say that Knowledge ain't for you and your people\nThey’re tryna' keep you less than equal\nCos deep down in themselves, that’s how they really see you\nLess based on status\nOr the places you was raised in\nOr the shape of your faces\nDegrees or bank statements\nSo we gotta reject  Whatever they set\nThey’re never benevolent yet\nYet we sit at a desk Collecting a check\nNo need to ever respect\nMess coupled by death\nTripled by theft\nLook at the West and the rest\nTransfer knowledge transfer the power then tell me what is left\nBliss? No ignorance\nIt just just his head that is numbing the pain\nOnly the clever shit should ever change\nOur development towards an aim\nNo bro, push of the chain\nTraining the muscle is training the brain\nIt is the same if you push through the pain\nOnce you are strong you are never the same\nYour manner your swagger\nThe way that you stand up\nThe way that you work with your boys as a rapper\nI’ve seen a killer convert from a trapper\nTo working with yout dem and tellin’ em man up\nI am not telling you it will get better\nBut if we are to fight we must keep our jabber\n\nC’mon my people stand up\n\n\n[HOOK] x2", "year": null, "album": "Knowledge Is Power Vol. 1", "image": "https://images.genius.com/95f4dbc07c7455e0bbf14b55f99cc7a0.918x1000x1.jpg"}], "artist": "Akala"}