{"songs": [{"title": "Mason Cafe", "album": "Out the Trunk", "year": "2019-09-04", "image": "https://images.genius.com/d053270ef1560994ce6d3bd9e7ea85d4.1000x1000x1.jpg", "lyrics": "[Intro]\nI'm just lovin' you, baby\nWait a minute, wait a minute, wait a minute\nWait for what?\n\n[Verse]\nI'm real spontaneous, I got no patience\nSo many whips had to change the location\nYou cracking under pressure, I'm just eating crustaceans\nForty dollar body wash, fuck it, it's nathan\nI'm cool with jewels, we got lots in common\n200 for the coupe and don't even drive it\nI live in Frisco, Ocean View, you thought I was lying\nI'm the nigga in my city, you better pay some homage\n24 in the lab I ain't slept in days\nThis shit easy to a playa, I'm just giving you game\nGot the vegetables sautéed, I'm chillin' and blazin'\nOn the island with my feet out eating some raisins\nA big mojito on line, too, I'm keeping it cool\nDetails, keychain three hundred, I'm foolin'\nI don't bang but the seats in the Benz is whoopin'\nSippin' on this green tea while I order a movie\nI'm him\nBitch, you know you fucked up\nNow you back to fuck around with broke bruh-bruh\nI don't never step down, bitch, I just step up\nAvocado in the smoothie, something different on a slut\nSlide through my old hood and it's feeling like the 90's\nShit changed, man, I 'member when I used to ride my bike\nDown them project stairs, now I'm 2019 on them\nSwervin', mobbin', gotta keep that thang on me\nThis beat so smooth, I ain't have to sing on it\nYou a Taco Bell nigga, bitch, I got this lobster imported\nBitch I'm hella important, better do your homework\nBefore I take you serious I gotta check that dome first\nI wonder, do you still got that crib I use to slide through?\nThe one next to Whole Foods, you know I use to love them smoothies\nSix tapes back to back I do this in my sleep, nigga\nTFM the record label, bitch, you should go and sign with us\nWhat's happening?"}], "artist": "Larry June"}