{"songs": [{"image": "https://images.genius.com/55c6bfb6928ee69fa076f8f2a3218981.700x700x1.jpg", "lyrics": "[Intro: U-God]\nOnce again...\nThrough the storms\n\n[Verse 1: U-God]\nI gotta stay strong take deep breaths, hold on long\nBring the harm with no regrets\nOn my chest, let me knowledge be born on levels, wild\nDevil copters mark my every step\nWhen the riots form, my woman keeps me warm\nFrom Fort Green I sing the song mean\nBring the calm overseas, glide high in the skies\nSky dive... far... far as the eye could see\nIn the midst of acapell', I ball my fist up\nUnravel, travellin to the cells of Gotti\nI shot up a shell, will he drop? Will he flop?\nWill he go pop a cell? Is his mind frail?\nThe worst is groove frantic, he expand the planet\nPlan harder, your Godfather's plans failed\nI air mail the senseless scar, two snub noses\nNiggas love those expensive cars\nIs it him and those twenty inch rims, splittin the tar?\nAn amazon woman from the stripbar\nGod, it varies, Halle Berry, stars eatin hard cherries\nThis world is bizarre, not bein far from Mars\nGalaxy hoppin, non-stoppin the sun rays\nStayin paid for real, 'til I'm old and grey\nPretty legs, of course, soft as clay\nDegrees, hot breeze in your hair all day, all day\nEngaged a lot, rockin hot and cold chains\nIs my brain vain? Flames, still dock the missles\nLet off one, stay in your lane\nEverybody got issues, I'm drunk off the rum\nNumb, one case got thrown out in dismissal\nEverybody got pistols, but will the referee blow the whistle\nBefore I lock on your ass, bone gristle?\nThese streets is crystal, crystal, crystal\n\n[Verse 2: Hell Razah]\nPleasure and pain, some took lead to the brain\nGot rich and couldn't live for the end of the game\nGovernment train, breakin off the slavery chain\nFrom a weddin to a funeral, it's pleasure and pain\nGuns, gangs cock back, ready to aim\nColin Fergusons, ridin on the back of the train\nTelevisions and this cocaine, got us insane\nWe got to war, if we all got a burner, then flame\nBaby showers, same day as nuclear showers\nProphecy's harsh, world will be destroyed in an hour\nShots fired in the night, from the heart of the coward\nStop the growth of the young flowers from going to Howard\nBrooklyn Beirut, raised in fatigues and boots\nBlue-printin who we hittin, and we need to shoot\nNo description, all though it was dark, an Egyptain\nAnd didn't have no love, but a grudge against Clinton\n\n[Verse 3: U-God]\nRepresentin... how much gold can one man claim?\nOver horizon, recognize him, it's candy rain\nFlusty, lookin out of dusty old window pane\nWith nothin to lose, but everythin to gain\nSo far to go, much more is unclaimed\nNo delay, when we spray, we Play IV Keeps in the Jeeps\nStumpin somethin gritty, it's gun nitty in the city\nThat never sleeps, street sweepin\nIs senseless, intense, fenced in, fleein\nA long road ahead, I'm still believin in my freedom\nOn the darkest day, I'd say your darkest hour\nI came to realize, the sin is most inner-most power\nSo enchanted, cry inside, fryin and dancin\nAt God speed, damn it, fear is planted\nSevere nature of man, there's still no cure\nSeduce me, reduce me to ashes, caught in the law\nAtoms scatter, brain lashes, to the core question\nStill no answers, moves of the phantom, handsome\nMidnight silence surround us, eye in the sky\nEverything is a lesson, RZA I love the God for all of your blessings\nI'm reppin, grateful 'til I'm dead, hateful heads, we under Allah's\nProtection\nEssence of life, one second, after the blastin\nI wonder, is Heaven truly everlastin?\nI'm askin, I said it to four lost relatives missin, in action\nCommunication breakdown, it's all the same\nHavin a nervous breakdown, draw you insane\nIt's just pleasure and pain, pleasure and pain\nAnother man's loss, another man's gain\nStay in the game, pleasure and pain\nWe treasure the fame, pleasure and pain\nPleasure and pain, pleasure and pain, pain, pain, pain", "title": "Pleasure or Pain", "year": "1999-10-19", "album": "Golden Arms Redemption"}], "artist": "U-God"}