{"songs": [{"title": "Keep It Real", "lyrics": "(Master P talking)\n\nYeah, huh, my boy Young Bleed in here, C-Loc in here, an you know the\nColonel MP up in here\n\nChorus: Young Bleed\n\nNigga we gonna keep it real dawg, hustiln high, cuz live niggas keep it\nReal young, can we keep it real Loc? Tryin not to spill no blood, if\nIt's real show a nigga love, nigga\n\nVerse 1- Young Bleed\n\nNigga it burns for gold that rose before me that was fakin' the funk\nLong an behold I come to get it, so I'm takin' it in chunks, out to\nLunch for brunch, maggots gonna munch in perpendicular, order money, man\nSlaughter, I write this shit thats good for you, how many mutha fuckas\nMust get dealt wit? Before someone kick down yo door, an leave you\nHelpless, is you feelin' my fear, feelin' my vibe, at the same time, I\nDirty my theroy, clickin my tribe, tryin' ta claim mine, hush\nWhat you discovered don't shake the rictor, my nigga, my nerve, go get\nThe camera, get the picture, I'm laughin' at y'all for tryin' to ball\nWit yo mug on me, movin' a million mutha fuckas strappin murder machine\nI come dainty an benidine, so gimme mine, sippin great wine\nPunishing pussy to Ginuwine, paralized to the format still smokin' blunts for\nDays, an mama's theroies an ways, got me prepared ha, niggas ain't\nReady, but if it wasn't for the grace of God, they say you couldn't live\nLife against all odds, I know it's hard, but it's real though, I'm 'bout\nTa peel out, everytime I touch somethin', what ya feel yo, nigga, give a\nFuck if you bigga\n\nChorus\n\nVerse 2- C-Loc\n\nIt be a piper push poundses, wit playas who wanna rise, pick the pen\nThen ??? my rhyme, eh, so now I can make a leagal paper in this rap\nGame, at the first used to hear that boy playin' wit steel toys, now I'm\nWorse, can't break the curse, y'all laugh until I die, comin' from the\nDirt, so watch a young hustler rise an shine, like the ghetto\nMastermind, (bout it bout it) let em know, why do, doin' all that lyin'\nGot the nation down to ???, young mutha fucka ain't do shit, can't stand\nThe heat get out the kitchen, before trigga fingas get to itchin', getty\nUp, get into position to have twitchin', thinkin', damn, how could I\nHave mention, stop trippin', keep it real nigga\n\nChorus x2\n\nVerse 3- Master P\n\nUghh! I live my life of a youngsta wit money, to many, bitches\nPandhandlers, beggas an dummies, tryin ta, steal my soul, I mean suck me\nDry, for these 20 inch rims on my ghetto ride, I couldn't lose my life\nTryin' to keep my shoes, sell my soul to the devil, in the ghetto you\nLose, an ain't no, nigga gonna make it, fakin' the game, too many blacks\nBehind bars for fortune and fame, I live, my life, readin' jail house\nLetters, I'm workin', money orders sendin weed through sweaters, I seen\nMama's turn off of hustlas and killas, my last supper probably gonna be\nWit fiends an dealers. Ughhhh!\n\nChorus x3\n\n(Master P talking during chorus)\n\nC-Loc records, keep it real, for all the records, keep it real Loc the\nWhole south, to the east, to the west, to the middle, huh, we gonna keep\nIt real though, keep it real Loc", "album": "My Balls and My Word", "year": null, "image": "https://images.genius.com/1613c69d81c9bbfbbbbe477f2130bb6f.500x500x1.jpg"}], "artist": "Young Bleed"}