{"artist": "Fabolous", "songs": [{"year": "2015-11-26", "album": "Summertime Shootout", "image": "https://images.genius.com/7a5aea7c661ee0f8c16585c99ec86077.800x800x1.jpg", "lyrics": "[Intro: Fabolous & (Trey Songz)]\nDatpiff.com world premiere\n(Go ahead)\nSee you can't just do it\n(Go ahead)\nYou gotta do it well\n\n[Verse 1: Fabolous]\nLook, body language is the kinda talk I'm fluent in\nWhy don't you stop talking 'bout it and come do it then?\nWritten on your face, that \"Yeah I'm tryna do it\" grin\nEvent planning, we just need a spot to do it in\nHeading to engagements, head behind the Range tints\nFruits of my labor, edible arrangements\nIt get a little messy, sweater new, Jays mint\nShe say when she done with me I better go and change them\nFuck the sweater, I don't know no fuckin' better (Whatchu mean?)\nY'all don't get it, I don't know no fuckin' better (Word)\nThen this right here, shawty right there\nStill givin' ol' boy nightmares\nAnd I heard your ex hate it, that's why my texts stated\nLast night was a movie and it was X-Rated\nFlick called Wet, it only gets better\nTonight we make the sequel and call that shit Wetter\n\n[Pre-Hook: Trey Songz & (Fabolous)]\n(Go ahead) Go ahead\nFuck me like you know somebody else ain't fuckin' me right\nGo ahead (Go ahead)\nFuck me like you know somebody else ain't fuckin' me right (Nice)\nI'ma kiss your body from your head down to your toes\nAny time you want it you just let a nigga know (Just let me know)\n\n[Hook: Trey Songz & (Fabolous)]\nAnd we gon' do it, do it, do it, do it\nWe gon' do it real good\nAnd we gon' do it, do it, do it, do it\n(She represent Queens, I was raised out in Brooklyn)\n\n[Verse 2: Nicki Minaj]\nBody language is the only talk he fluent in\nHe knew it was going down when he flew me in\nAnything that I got on he wanna do me in\nNow all these non-discrete bitches wanna do me in\nUh, Gold AP on me\nHe know all his niggas wanna put the D on me\nEven Dr. Dre went and put the B on me\nBut my pussy so exclusive, limited edition\nYou know niggas love pretty bitches with ambition\nBees on the keys, never go in the ignition\nB-B-But when I ride it, do it to precision\nI could tell that he trippin', every time that I slip in\nWhen he 'bout to come, I start to kiss his neck\nI let him score, but we ditch the ref'\nWhen we going out, we gotta ditch the press\nAh man, I got his bitch depressed\n\n[Pre-Hook: Trey Songz & (Fabolous)]\nGo ahead (Go ahead)\nFuck me like you know somebody else ain't fuckin' me right\nGo ahead (Go ahead)\nFuck me like you know somebody else ain't fuckin' me right\nI'ma kiss your body from your head down to your toes\nAny time you want it you just let a nigga know (Just let me know)\n\n[Hook: Trey Songz & (Fabolous)]\nAnd we gon' do it, do it, do it, do it\nWe gon' do it real good\nAnd we gon' do it, do it, do it, do it\n(She represent Queens, I was raised out in Brooklyn)\n\n[Verse 3: Nicki Minaj & Fabolous]\nI'ma call you big daddy and scream your name\nOnly if you have me drippin' like candy paint\nSo what you sayin? I give it to you right, give it to you left\nMake it last forever, Keith Sweat, have you outta breath\nMmmm, daddy slow down a bit\nYou acting like you never been downtown and shit\nI need a baller laid back while he watch this thing bounce\nBuying them designer bags, put money in my account\nNo doubt, I'm the player that they're talking about\nGot that good shit, even in a drought\nIf you gon' do it, do it for real\nAnd if they ask how I'm doin' tell 'em doin' it well\n\n[Pre-Hook: Trey Songz & (Fabolous)]\nGo ahead\nFuck me like you know somebody else ain't fuckin' me right\nGo ahead (Go ahead)\nFuck me like you know somebody else ain't fuckin' me right\nI'ma kiss your body from your head down to your toes\nAny time you want it you just let a nigga know (Just let me know)\n\n[Hook: Trey Songz & (Fabolous)]\nAnd we gon' do it, do it, do it, do it\nWe gon' do it real good\nAnd we gon' do it, do it, do it, do it\n(She represent Queens, I was raised out in Brooklyn)\n\n[Tag]\nDatpiff.com: The Mixtape Authority\n\n[Outro]\nGirl 1: Hello?\nGirl 2: Uh, where have you been?\nGirl 1: I've been in L.A, uh...\nGirl 2: What do you mean L.A?\nGirl 1: Um... I met this guy\nGirl 2: So when are you coming back to New York?\nGirl 1: I don't know, girl, it's going so good, I don't know\nGirl 2: What do you mean you don't know?\nGirl 1: I don't know, I'm about to go shopping though, I'm about to go cop these\nGirl 2: Right now?\nGirl 1: New Chanel—this new Chanel bag, yeah, I'm about to, I gotta go\nGirl 2: Oh, don't forget about me, bitch", "title": "Doin It Well"}]}