{"artist": "Iamsu!", "songs": [{"title": "Key Of Life", "lyrics": "(Intro)\nBounce so I could get all of it\nOther shit\nReal shit\nUh\n\n(Verse 1: Iamsu)\nChillin with my homie tryna make a way\nComparing my whereabouts to roamin wouldn’t take a day\nThey hatin, I can’t complain\nI got it good\nI been in top floor suites out in Hollywood\nReminiscin bout it but we still got a way to go\nLearnin and building off the mistakes that we made before\nI pay my roll, man sacrifice is in all this shit\nTurned a piece down just so I could see all of it\nSchool of Hard Knox, I attended on scholarship\nWorked for so many years, never getting acknowledgement\nSo while through the worrying, I’m just thinking big and better\nGot a circle of real homies that’s down for whatever\nWorkin like I'm enslaved til my name is engraved\nIn that walk of fame, gold sparkling\nFind the passion and turn into an assassin\nA month of competition of us strayin from the invasion\n\n(Chorus)\nWhy don’t you sing for me?\nThe song to the key of life (song to the key of life)\nWhy don’t you sing for me?\nYea yea\nThe song to the key of life (song to the key of life)\n\n(Verse 2: Jay Ant)\nBallin like 2-3, magic like 3-2\nNiggas say we outchea but we don’t never see you\nYou niggas must be see through, blowin up like C2\nPlus 2, bless you, your bitch was ready for me\nBefore I even met you, you talkin down on me\nJust don’t let me catch you, drop it\nAin’t nobody comin here to catch you\nA wise man told me don’t ever get too thrown if ain’t nobody there to fetch you\nStop me? man I can’t let you\nGotta be hot but I can’t sweat you\nThese niggas do anything for attention\nUh, sayin many things to be mentioned\nUh, and I’m from another dimension\nI’m nothing like you preachers\nUh, stay on track like your bleachers\nOn the highest mountain, nigga still couldn’t reach us\n\n(Chorus)\nWhy don’t you sing for me?\nThe song to the key of life (song to the key of life)\nWhy don’t you sing for me?\nYea yea\nThe song to the key of life (song to the key of life)\nYea yea\n\n(Verse: CJ)\nI’m dreamin to blow that reafer, life got me over here\nLearnin while I’m earnin in the west to play the teacher\nBut I won’t get what I deserve, home boy my spot is reserved\nThey told me life’s a bitch, will I finally get to meet her?\nProbably get in ya speaker, come and lead this here\nBut permanently I’m what they yearnin to see\nNow everybody wanna talk, it ain’t important to me\nI’m in a different lane, can’t nobody merge with me\nYou B hit me only cuz she got the urge to see\nI’m bout a dollar, I’m bout a dollar\nI swear I’m is\nBut bright lights make a nigga little nervous\nPay attention to the niggas who I swerve with\nI got the key to the life and I’mma splurge ya\nUh\nThe same niggas who I’m smoking on this earth with\nThe same niggas I leave earth with\n\n(Chorus)\nWhy don’t you sing for me?\nThe song to the key of life (song to the key of life)\nWhy don’t you sing for me?\nYea yea\nThe song to the key of life (song to the key of life)\nYea yea", "image": "https://images.genius.com/4f17798f733b204f275cb24133e9d98e.500x500x1.jpg", "album": "Kilt 2", "year": null}]}