{"artist": "Professor Green", "songs": [{"album": null, "title": "Mercedes Riddim", "image": "https://images.genius.com/c4491fa50cf30ec4f3a4934b4bf26a84.500x500x1.jpg", "lyrics": "[Professor Green - Verse 1]\nMy skin colour ain't nothing to make light of\nWe're all the same colour when you turn the light off\nIf you don't wanna hear this then turn the mic off\nI drive women crazy I left your bitch a write-off\nOnly if the head's right\nI forget her name you know what it gets like\nLike my whiskey sour, with no egg white\nRolling up a big spliff sipping on a Red Stripe\nMy bread's sweet, I got that hard dough\nMaking it look easier, you make it look harder\nIf I'm ordering food I ain't calling up Ocado\nMight fling it in an Uber but I got a couple car though\nAMG GT S it up and down the road you might see me wet it\nYour lines like coke that I keep re-pressing\nMy rhymes like coke that I keep repressing\nWhere's the Merc, I thought you were mashing work\nPing ping I thought you were clapping thing\nWhere's the cash, I thought you was in the trap\nAnd what's with all the front 'cause ain't nobody got your back\n\n[Dutch]\nLook, the place I'm from ain't nothing to make light off\nRide around and turn your lights off\nAww you wanna play, you know no gangsta\nThe flip it back, ride around and turn your lights off\nCutting through the city, big body Benz\nTalking to Pro Green about cuttin' ends\nEvery time they see us in the streets they're like there they go\nGot my bro looking out the window like \"that's one of them\"\nWhat's with all the gossip, what's with all the chat\nIf we pull up to the front they're running out the back\nYou know that I'm getting money, you know that's a fact\nWith my tools on you know how the goons are\nSpray spray we about to take the roof off\nThen I shoot off in a new car\nIt's easy, you're making it look too hard\nSlow down, you're taking this shit too far\n\n[Hook]\nWhere's the Merc, I thought you were mashing work\nPing ping I thought you were clapping thing\nWhere's the cash, I thought you was in the trap\nAnd what's with all the front 'cause ain't nobody got your back\nGot your back, got your back\nAin't nobody got your back\nAin't nobody got your back\nGot your back, got your back\nAin't nobody got your back\nSo what's with all the front?\n\n[Professor Green - Verse 2]\nI got that hard shit, download it and bang it in your car shit\nGive me the spliff yeah I'm past it\nCrack shy but I'm plastered, I ain't a {?}\nBut everywhere I go I get my arse kicked\nSee a fan give them a hug though\nDon't give a fuck though 'less I wanna fuck though\nGive you a quick spud tell you it's all love bro\nI couldn't give a fuck if you got hit by a bus though\nI buy in bulk, Costco\nUmbro, I will soccer if she cost though\nLove? No. Me I just run through it\nEverything is custom I'm accustomed to it\nWork\n\n[Hook]\nWhere's the Merc, I thought you were mashing work\nPing ping I thought you were clapping thing\nWhere's the cash, I thought you was in the trap\nAnd what's with all the front 'cause ain't nobody got your back\nGot your back, got your back\nAin't nobody got your back\nAin't nobody got your back\nGot your back, got your back\nAin't nobody got your back\nSo what's with all the front?", "year": "2018-05-04"}]}