{"artist": "Problem", "songs": [{"album": "The Separation", "title": "Lay Your Head Back", "image": "https://s3.amazonaws.com/rapgenius/Problem_The_Separation-front-large.jpg", "lyrics": "[Intro: Problem & (Chris Brown)]\nIf you're ready for a real nigga, baby, please come up, come on (yeah)\nIf you're ready for a real nigga, baby, please come up, come on\nWassup, baby? (Oh, woah)\n\n[Verse 1: Problem]\nOnce I unzip, it won't conflict, no no, no red light, let's go\nRight where we need to, wanna eat you, prepared your feeble\nUh, you prepared your feeble, your man gone shit, I'm tryna see you\nWhen he leave, yeah, I'ma swing through, I'ma bring a little drank, little drugs girl\nYou already know what this gon' lead to and I'ma do what I need to\nGirl, them tights so see-through, go 'head and take 'em off, bounce on me 'til you make it soft\nFuck the condom, I'm going raw, oh yeah, yeah, I'm off of my drugs and you know that\nPhone ringing, fuck her that's a throwback, that's a new thang, and I'm looking for a brand new boo thang\n\n[Chorus: Chris Brown]\nSo lay your head back, wassup, baby?\nSpread both of your legs, baby, so lay your head back\nCome on, girl, let me deep inside ya, so lay your head back\nAnd just let it come on down, I got you, baby, just let it come down, ooh\n\n[Verse 2: Problem & Chris Brown]\nFuck in the house, we could do it in public, feel it drip when I rub it\nI'm inside and you love it and you ain't even trip, when you found out I fucked on your cousin\nBut that was a long time ago, your body cold, I'ma wear it out like a designer coat\nPop that thing from the deep, oh, you won't find a young nigga with a wilder stroke\nFor real, oh, woah, has his own career, smoke this joint right here\nWhile we riding round to Aaliyah, your man a bitch, Madea\nSo I know why you fucking with me now\n'Cause I'm hitting and licking that cat 'til that motherfucker meow (meow)\n\n[Chorus: Chris Brown & Tank]\nSo lay your head back, will you tell me all the freaky things you are?\nSpread both of your legs, baby, so lay your head back\nCome on, girl, let me deep inside ya, so lay your head back\nAnd just let it come on down, I got you, baby, yeah, just let it come down, ooh\nYou gotta give me something, babe (so lay your head back)\nLay your head back, lay your head back\nLay, baby, lay, baby, lay (ooh yeah, ooh yeah)\nCan I take over from here? Head back, your head back, baby\n\n[Verse 3: Tank]\nGo to the bathroom, go wipe that thing down, lay down, I got you, my time's in charge now\nLick it up, lick it up, 'til you fall out, beat it up, beat it up, make you call out\nSit it up, sit up, out of my mind, when enough is enough, I wanna hear you scream and shout\nShit's about to get real, thirsty and I need water\nGonna need a refill, drinking all of your water\nHow you know what to do? Tell me, baby,who taught ya?\nTell 'em, girl, what it do, tell 'em Teezy taught ya\n\n[Outro: Chris Brown]\nSo lay your head back", "year": "2013-03-10"}]}