{"artist": "Kidd Kidd", "songs": [{"image": "https://images.genius.com/618dea054f2d84c4713013075be1ad0c.1000x1000x1.jpg", "title": "New Warleans (Like it’s Friday)", "year": null, "album": "Street Fame", "lyrics": "[Intro]\n?\nKnow what I mean? I get it by all means\n?\n?\nIt's all on me\nThis is my city, this is where I'm from\nThere's a lot of love, New Warleans\nStreet fame\n\n[Verse 1: Kidd Kidd]\nThis big gun in my pants go boom\nLike a bad smell it'll air out the room\nIn the morning right before your kids go to school\nWho would have knew by lunch time that he’ll be on the news\nReporting live from the city of the blues\nInvestigators looking for clues, blues\nThese hard rhymes come from hard times\nMy pa was doing life, he caught hard time\nSomebody died, here come the second line\nTime to crack a smile, hold your cries inside\nYou see the pain in her face through a smirk\nCelebratin' with your face on a shirt\nYou thought Katrina was the worst thing that happened to us?\nYou thought that FEMA money was enough?\nBut we gotta get it by all means\nTrynna survive in the city of New Orleans\n\n[Hook]\nSo fuck yesterday, say yes to the day\nBecause who knows if we gon' see tomorrow anyway\nOnly lord knows if we gonna die today\nSo we livin' everyday like it’s Friday, hey\nLike it's Friday\nWe livin' everyday like it’s Friday, hey\nOnly lord knows if we gon' die today\nSo we livin' everyday like it’s Friday\n\n[Verse 2: Juvenile]\nHigh grade Adidas, anybody lead us\nWe left the house of blues and then we took it to Anita's\nMy niggas got the heaters, say they comin' out to meet us\nWe headed to together, said they'll prolly try to cheat us\nTrippin' off my homie, I’m knowin' that he a rat\nHe be reachin' out his hand at me, I don’t be reachin' back\nBe like, oh since you got money now nigga that’s how you act?\nI read the paperwork and, yo homie, I know the facts\nI had trouble with the law, but this ain’t the same issue\nNow I realize we ain’t cut from the same tissue\nI was tryin' to trim my mustache, but the lights went off\nNigga trynna joke about I used to pipe them off\nBack in early Magnolia when boys done had flippers\nWhen tourin' in ? was four and a half niggas\nThe hood is all chains, the spirit is gold in it\nNone made the same, the feeling was authentic\n\n[Hook]\n\n[Outro]\nLittle brothers, enjoy y'all life while y'all here man\nThis shit ain't promised\nYou know these niggas try like a mu' fucka in N-O man\nI can't believe this shit\nLittle niggas man, just droppin' off the porch man\nJust comin' out the womb, 12-13\nGrabbin' that iron swingin' at mu fuckas\nPay attention homies\nYou know I'm not only livin' for me right now, I'm livin' for my kids man\nAnd I suggest you do the same thing\nYou got a lot to live for homie, pay attention\nHey, Kidd Kidd, I love you for this nigga\nNiggas get to hear that real shit, you feel me?\nUptown, downtown, stay connected nigga, I see you"}]}