{"songs": [{"year": "2010-06-22", "image": "https://images.genius.com/094639b25f790dc7c57451247197cfd7.360x360x1.jpg", "title": "I’m Back", "album": "Gang Rags", "lyrics": "[Verse 1 ]\nYo, guess who's back up on the scene?\nIt's the microphone fiend\nWe're something like a new tag-team\nIf I'm Rakim then Mike Clark's Eric B\nHeartbeat's when the base line drops\nRiding on the stair and I ain't gon' stop\nZombie King with a board in the head\nB.L.A.Z.E. yeah, back from the dead\n\n[Hook]\nAll of us were murdered away\nAlthough the chosen king will return to say:\nI'm back from the dead (Ya dead homie)\nI'm back from the dead (Ya dead homie)\nAll of us have needed a king\nSo if you return, just grab your wings\nI'm back from the dead (Ya dead homie)\nI'm back from the dead (Ya dead homie)\n\n[Verse 2]\nI'm back from the dead, fuck what you said\nI'll say it one more time so ain't nobody mislead\nFuck what you said, I'm out the coffin\nOften the suckers that be talking is the ones I be jocking out\nFirst minute of the ten round bout\nRunning off at the limit stuck the foot in your mouth\nI'm reved out the dirt of the urb to return\nTo the top of the world, in the spot that I earned\nThis is my spot now, all ho's bow\nTo the O.G. been to the grave and out\nSome folks shout, but I can't blame 'em\nI'm like a gladiator, I was sent to entertain 'em\nSaying all punks and chumps at my arrival\nBlaze Ya Dead Homie is back, it's my revival\nBack from the grave, crazy in the head\nBlaze Ya Dead Homie and I'm back from the dead\n\n[Hook]\n\n[Verse 3]\nI busted out the casket, with a hatchet\nI place in the shed, so later we can pass it\nWhen I broke out shit done changed\nThe hood lost their nuts to pigs, shit strains\n\n[Bridge]\nI'm back and you offended\nYou thought my time has ended\nNow that I am ascended\nTo hell which you're pretending...\n\n[Hook]\n\n[Verse 4]\nI'm back on the block, it was hot, but now it's cold\nBecause I'm out cold on these trife ass hoes\nTake my six inch, a zombie, outta limit\nMy home is a twilight zone, and you ain't fucking with it\n\n[Bridge]\n\n[Verse 5]\nI'm back to reclaim the throne I left vacant\nBeen gone a minute, but I need to put my steak in\nTake back everything and all I ever had and more\nRose out the grave but now it's time for me to soar!\n\n[Hook]"}], "artist": "Blaze Ya Dead Homie"}