{"artist": "Immortal Technique", "songs": [{"title": "Lick Shots", "lyrics": "[Intro]\nThis is the Invasion\nThe Evil Genius Green Lantern!\nImmortal Technique, \"The 3rd World\"\nIt's on now motherfucker - ha, ha drop\nYou know you got the right to bear arms, huh\nSometimes you might have to brandish a motherfuckin firearm\nLick shots, lick shots, lick shots, lick shots\n\n[Hook]\nLick shots, lick shots, lick shots\nLick shots for the revolution!\nLick shots, lick shots, lick shots, lick shots\nBut watch, where the fuck you shootin'!\nYo, where you aimin' at? Where you aimin' at?\nWhere the fuck you niggas aimin' at?\nWhere you aimin' at? Where you aimin' at?\nThis is only for the hardcore wherever you at, yeah\n\n[Verse 1: Immortal Technique]\nVolume 1, cop killer, hip-hop has never been realer\nVolume 2 shot up the president like a guerilla\nNew York police state capital tried to swallow me\nLocked me longer than Puerto Rico been a colony\nThirteenth Amendment slavery property\nAnd now they signin rappers that promote their philosophy\nFuck that, nigga hip-hop is not Republican\nThat's just the white motherfuckers that own the publishin\nAnd get the fuck out, if you want the foreigners gone\nI paint the White House black and park my car on the lawn\nMarry a Muslim girl and fuck her five times a day\nEvery time right before we shower and pray\nYou damn right the AK, symbolizes Jihad\nBut a holy war, is a conversation with God\nYou bitch niggas misinterpret what you don't understand\nStackin' the wrong sign can end up, shootin' your man\nShootin' each other, shootin' your brother\nAim the gun at the right motherfucker\nAnd leave him colder than the prison in Russia\nOr America's white power structure\nNiggas love to say \"Fuck revolution!\"\nUntil the jury come in and move for the prosecution\nAnd then brothers act like a born-again Huey Newton\nForgot about the bullshit music they was producin'\nBut my niggas aim precisely, through the confusion and\n\n[Hook]\nLick shots, lick shots, lick shots\nLick shots for the revolution!\nLick shots, lick shots, lick shots, lick shots\nBut watch, where the fuck you shootin'!\nYo, where you aimin' at? Where you aimin' at?\nWhere the fuck you niggas aimin' at?\nWhere you aimin' at? Where you aimin' at?\nThis is only for the hardcore wherever you at, yeah\n\n[Verse 2: Crooked-I]\nI got a hundred shooters with me, Ruger shoot you through the kidney\nStand in front of the judge and lie quicker than Scooter Libby\nI'm runnin' through the city, dear God\nIf I murk the racist Rush Limbaugh I wonder would you forgive me\nSomebody told me Glenn Beck is the Klan’s overseer\nSee ya, time to let him see a damn soldier\nFlip your Landrover, I told ya I blam toasters\nGun pop off like the mouth of Ann Coulter\nThis is my gangsta religion\nSee I aim with precision, point blank the position\nI'm black as them ancient Egyptians\nBefore European historians went and changed the description\nI'm blamed for the 'caine in the kitchen\nThe C.I.A. playin' with the pigeons, same pain that I'm pitchin'\nListen, you dudes better watch the hook\nI'm a boxer, coppers'll come up, Hoffa, look\nThey wanna get rid of this conscious crook\nLike I'm an agnostic, apocryphal, non-canonical Gospel book\nBut I ain't goin' nowhere, that's the motherfuckin' truth\nAmerica don't care for its inner city youth, so I\n\n[Hook]\nLick shots, lick shots, lick shots\nLick shots for the revolution!\nLick shots, lick shots, lick shots, lick shots\nBut watch, where the fuck you shootin'!\nYo, where you aimin' at? Where you aimin' at?\nWhere the fuck you niggas aimin' at?\nWhere you aimin' at? Where you aimin' at?\nThis is only for the hardcore wherever you at, yeah\n\n[Verse 3: Chino XL]\nPuerto Rican superhero!\nXL eternal, my journal, Sojourner, Nat Turner\nCop murdered by the certain burner turned in the back of his sternum\nHe flirted with pullin' me over for bein' brown, I bust\nNow he in the back of the truck with Don Imus\nI must, take aim when I lick shots\nThrow stray bullets like when Nas got off of Pharoahe Monch\nThese pigs wanna see us dead inside a jail cell\nTurn us from Shawn Carter to Sean Combs to Sean Bell\nMy temper 'bout to break like levees in New Orleans\nCatch Jimmy Iovine when he refinance his mortgages\nKid illusion is dead, we movin' with the blue and the red\nLatin Kings, Giuliani with a gat to his head\nY'all don't lick shots like killers aimin' at the Feds\nY'all lick shots like Jenna Jameson and Superhead\nPigs slice to Venice and beef at the benefits meet\nBuried him on Venice Beach with the flies and the bees\nChino and Immortal Tech'\nKill shit like the Chinito at Virginia Tech\nAnd Jacob ain't your friend, he's a fuckin' jeweler\nBlap! Blap! I shoot the cats off your fuckin' Pumas\n\n[Hook]\nLick shots, lick shots, lick shots\nLick shots for the revolution!\nLick shots, lick shots, lick shots, lick shots\nBut watch, where the fuck you shootin'!\nYo, where you aimin' at? Where you aimin' at?\nWhere the fuck you niggas aimin' at?\nWhere you aimin' at? Where you aimin' at?\nThis is only for the hardcore wherever you at, yeah", "image": "https://images.genius.com/cbb36cff0867b087bc47fcf98b7cd803.300x300x1.jpg", "album": "The 3rd World", "year": "2008-09-12"}]}