{"artist": "Papa Reu", "songs": [{"album": "Xcuse Me!", "title": "Shine", "image": "https://s3.amazonaws.com/rapgenius/papa-reu.jpg", "lyrics": "(Papa Reu)\nYo\nWhen I see my boy C-Note I'ma buy him somethin' brand new\nWhen I find Lil' O\nYou know he gone keep somethin' new\nAnd of course, you know the original\nPapa Reu!!!!\nI'ma keep somethin' new, new, new\nLook\n\nFirst Verse (Papa Reu + Lil' O):\n\n(Papa Reu)\nWe gone buy somethin' new, for the millenium\nThis triple O jag cost two million\nBuy somethin' new, for the century\nDouble O, one drop top Bentley\nAnd I'm gonna clown when they see me\nIn a jag truck with four TV's\nYachts and jets, yes we're overseas\nBest to get presidential role's\n\n(Lil' O)\nWatch me get an A plus for the way that I bust\nPresidental role's with biggetes and ice plus\nLike plush, all of my foes they bite dust\nWhen I bust my beretta, fat rat, with the cheddar\nDrop the top on the cadillac, cool, and yell \"WHOA!\"\nHoes askin' who the fuck is that?\nIt's Lil' O\nYou ain't know?  These other ones shine, I glow\nBlood stream for State, cristal and hydro\nMan the way that I go, be havin' niggas sayin' man he left with my hoe\nAnd made a woman swear like she was doin' Tae-Bo\nAnd Lil' O, man he put it in they face I know\nFor real I know\nBitches young follow him\nHe bail up in the club like he's King Solomon\nYoung nigga thuggin' ain't no stoppin' him\nPoppin' champagne, jewelry with the rocks in 'em\nThe O ain't trippin', come on\n\nChorus (Papa Reu):\n\nWe gone shine, shine, shine, shine, shine, shine, shine\nPlatinum role's to tell the time, time, time, time, time, time, time\nAnd all the diamonds gonna blind, blind, blind, blind, blind, blind, blind\nRollin' twenties all the time, time, time, time, time, time, time\n\nSecond Verse (Papa Reu + TC + C-Note):\n\n(Papa Reu)\nThe windows be tinted, and we be in it\nFive hundred cruise control, lights all in it\nOn the coast of Puerto Rico, with some women\nWhere my shorties at?  Where they at?\nSo come here my baby\nYou look and now you wearin' them guccis\nSo take me to where them rude boys be preachin'\nYou know they say we rich and we bubblin', we bubblin'\n\n(TC)\nWe got so much money, we can't even count\nCheck my credit cards, bout X amount\nBout to pull somethin', out the garage\nSeventeen, playin' with bout ten cars\nMy nigga Rue, bout to survive bank\nI'm steady clubbin', ain't even old to drink\nBallin', that's all I know\nWhite bentley off the showroom floor\n\n(C-Note)\nWe gone buy somethin' new\nTwo thousand dollars a shoe\nIce the benz candy blue, now I'm comin' through\nMy lex bubble like moets and them private jets\nWith ten K around my neck, Prince and cut biggetes\nI'm in the game like EA Sports\nNo more standin' on the corner pushin' island resorts\nC-Note to buy the cars, we some million dollar players\nWe go with Papa Reu, cuz we real rhyme sayers\nParle' ers, police give me tickets cuz we ballerific\nNext time I'm poppin' big shots, cuz all my letters kick it\nNow we bitch slappers cuz we fantabulous\nWalk around sell out the show, cuz niggas tired of us\n\nChorus (2x)\n\n(Papa Reu)\nBuy somethin' new, somethin' brand new\nBuy somethin' new, somethin' really, really new\nBuy somethin' brand new, somethin' brand new\nBuy somethin' brand new, really, really new", "year": null}]}