{"songs": [{"image": "https://images.genius.com/dd4702b67b8df5a6d15413c2a9f2117c.700x700x1.jpg", "lyrics": "\"Uncle mac, will you read us a bedtime story?\"\nNo! You guys are like 28, move out of your mom's basement!\n\nI once knew a guy named Bareknuckle Chris\n82 pounds, stood 4-foot-6\nHe sat up at the bar by himself every night\nWith a mean attitude and a balled-up fist\nNow all around town everybody asked why\nHe tried to start a fight with everyone that walked by\nBut he was so small, that Bareknuckle Chris\nThat he always had a broken nose and two black eyes\n\nPeople said that he was insecure inside\nFull of piss and vinegar and full of male pride\nBut when the whole town found out about Chris\nEvery night the bar was full with a line outside\nSome brought billy clubs, some brought pipes\nAnd everyone knew that he would never win a fight\nBareknuckle Chris always threw the first punch\nBut the person always chuckled and punched out his lights\n\nNow Ringside Ripley was 20 years old\nA second-rate boxer with gloves made of gold\nBut he was getting tired of living in the shadows\nOf all the Bareknuckle Chris tales that were told\nSo he went to the pub in a peacock coat\nAnd picked up Bareknuckle Chris by the throat\nHe waited till the crowd cheered really really loud\nThen he punched him so hard that his whole face broke\n\nHe held Chris up then he said\n\"Stand clear! I'm Ringside Ripley, the champ of the year!\"\nHe slammed Chris down on a pinball machine\nThen he bought everybody in the crowd a cold beer\nThen they hobnobbed through the dark black night\nAnd Ripley told war stories all about his fights\nHe spent every dollar that he had on the people at the pub\nCause they made his self-esteem take flight\n\nWell, Tank the bartender had a face made of stone\nHe cut the drinks off and sent everybody home\nBut everybody went over to Ringside Ripley's\nCause he said he had flying monkey of his own\nWhen everyone was gone tank pulled out a cloth\nAnd washed all the barstools and tabletops off\nHe saw Bareknuckle Chris laying unconscious\nAnd walked up and said \"Time to go home, boy!\"\n\nSee Bareknuckle Chris came from a tall family\nHis daddy drank whiskey and bourbon and brandy\nHe had 2 brothers that were 8 foot tall\nSo at a young age he had to learn how to brawl\nThe whole family treated him like he was a disgrace\nThey slapped him, punched him, and kicked him in the face\nJust like the drunks did every single night\nWhen they walked by Chris hoping he would start a fight\n\nSee at a young age Chris learned very quickly\nHow violent by nature that human beings are\nSo even though he acted like the village idiot\nBareknuckle Chris was the owner of that bar\nHe didn't want friends, he just wanted revenge\nAnd every time someone came to kick his ass\nThey acted like a bully but little did they know\nThey were giving Bareknuckle Chris all their cash\n\nThe moral of the story will catch you in a blink\nWhy the hell do you care what other people think?\nManipulate your own goddamn truth\nPackage that shit up and sell it to the world\n\nThe moral of the story will catch you in a blink\nWhy the hell do you care what other people think?\nNever tell somebody when you have the power\nTake their own weakness and sell it back to 'em", "year": null, "album": "The Original 11:11 Sessions", "title": "Bareknuckle Chris"}], "artist": "Mac Lethal"}