{"songs": [{"image": "https://images.genius.com/6d4122e04620c80f89815bcd23e4e6de.500x500x1.jpg", "title": "38 Baby", "album": "38 Baby", "year": "2016-08-04", "lyrics": "[Intro]\nI don't give a fuck who out here doing this shit mane, yeah. You know, nigga know what the fuck this is mane, NBA gang, ya heard me? I go by Young Boy, I'm the hottest younging, ya heard me? Fuck what a nigga talking bout believe that\n\n[Verse 1]\nEverybody under disguise man they scheming\nThese hoes will set you up\nTell you they love you they don't mean it\nFull of syrup, bitch I'm leaning\nSmoking dope with the demon\nSend my younging at your little nigga give me a reason\nI heard a nigga say they turned me up, get off a nigga dick\nDon't like the fact that now I'm blowing up, nigga get on your shit\nI got turned on next Montana ain't nobody give me shit\nBitch I bought my own car, started my own dealership\nCruising down Florida with my burner leaning faded\nTo tell the truth, I don't know why these niggas hating\nI stay with the 38, I won't let nobody take me\n& I know these niggas plotting, so I don't smile up in they faces\n\n[Chorus]\nNo I ain't crazy, so bitch don't try to play me\nI'm a 38 baby, go against me I'm a slam them\nOut the north, know not to spare them\nGo with his move, bitch I dare them\nGo with his move, bitch I dare them\n\n[Bridge]\nAnd I don't go nowhere without that iron on me\nThis shit so cut throat my own niggas talking down on me\nThese niggas envy for no reason, I ain't got time for them\nI'm out that gang and what I rep bitch I stand on it\nAnd I don't go nowhere without that iron on me\nThis shit so cut throat my own niggas talking down on me\nThese niggas envy for no reason, I ain't got time for them\nI'm out that gang and what I rep bitch I stand on it\n\n[Verse 2]\nFor so long I've been slept on, got to make them believe me\nJust bought a Glock-up out the north, so that's them shots off the 3's\nGot the law up on my ass, demons up in my dreams\nAndy Gaulden was my uncle, robbing shit in my genes\nNigga I'll prove it while you assuming\nI'm up in Houston\nBrand new rod for my younging for whoever wanna do me\nWith this beef shit, I don't stop like Q-Red bitch I'm producing\n3Three let me hold the Glock, I'm just waiting for to use it, pussy\n\n[Outro]\nI'm strapped in the booth right now. But that's how the game go, they gon' talk. You know I don't do nothing but turn up, they gon' hate. Bitch ass nigga get your money up gang. You heard me? NBA, never broke again. Yeah, 2016 shit nigga, NBA Live. Bitch I stand on the gang. Ay, ay Youngboy"}], "artist": "YoungBoy Never Broke Again"}