{"artist": "Andy Mineo", "songs": [{"title": "Take Me Alive", "album": "Heroes for Sale", "year": "2013-04-16", "image": "https://images.genius.com/fdf80f726778a05ec46bdc108384b8f2.540x540x1.jpg", "lyrics": "[Verse 1: Andy Mineo]\nThey say we all different, what's that common ground?\nOne day everybody gon' lay in that ground\nIf death is certain, then how you live it?\nAnd if heaven's real, tell me how you get it\nI'm a bet it on my life, it ain't gon' be bout' works\nSo I bet it all on Christ, boy lemme give you this work\n\nWay before the moment I crawl, I already been in that hurts\nI'm already dead, I'm living at my worst\nThe first to be last and the last to be first\nFollowing Jesus don't mean that there won't be pain, but um\nBut it does promise that none of it is in vain, and um\nAnd I'm not afraid of that persecution that came\nI'm more afraid of the fame and people knowing my name\nTake me\n\n\n\n[Hook: Andy Mineo]\nTake me alive, take me alive\nTake me alive while I'm still here\nTake me alive (take me), take me alive (take me)\nTake me alive (take me), take me while I'm still here\n\nTake me alive, take me alive\nTake me alive, take me while I'm still here\nTake me alive, take me alive\nTake me alive, take me while I'm still here\n\n[Verse 2: Andy Mineo]\nRiding low key, ya'll know me\nSoli deo glory be to Father\nI can't lie though sometimes I want it all for me\nGotta kill that, gotta kill it\nDon't conceal that but reveal it\nI don't care what you think about me\nThe Father know it all but I'm still forgiven\nI must be decrease cause the way up is down\nIn His Kingdom it's all flipped as crazy as that can sound\nThat's why the blood is rushing to my head\nDyin's how I live\nIf you love your life you lose it\nIf you lose it, then you gain it, and\nWisdom is justified by all the children\nGod's worthy of my worship, so I'm defying my feelings\nIn my mess, there's a message\nIn my test, testimony\nHe say no, I get to know Him, when I'm on that Rock you Jabroni!\nI cannot be more, stacky dough\nLove me some shoes, shoulda cop me two\nBut I'm thinkin' about the boxes inside my room\nAnd I think about the kids that ain't got no food\nWhoo, that one hurt, the truth is a mother\nThe price of the lies when they come up\nHeavy when they run up, the dark will reveal when the sun up\nEveryday we're dying\n\n[Hook]"}]}