{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "Mood for Love", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Verse 1: Don Newkirk]\nThere I go, there I go, there I go, there I go\nPretty baby, you are the soul who snaps my control\nSuch a funny thing, but every time you're near me\nI never can behave\nYou give me a smile and then I'm wrapped up in your magic\nThere's music all around me, crazy music\nMusic that keeps calling me so very close to you\nTurns me a slave\nCome and do with me any little thing you want to\nAnything, baby, just let me get next to you\nAm I insane or do I really see Heaven in your eyes?\nBright as stars that shine up above, you're in the clear blue sky\nHow I worry about you\nJust can't live my life without you, baby, come here\nDon't have no fear, oh, is there a wonder why\nI'm really feeling in the mood for love\n\n[Break]\n\n[Verse 2: Don Newkirk]\nThis little dream might fade away\nThere I go I'm talking out of my head again\nOh, baby, won't you come and put our two hearts together?\nThat would make me strong and brave\nI'm not afraid, I'm not afraid\nIf there's a cloud up above us, go on and let it rain\nI'm sure our love together can endure a hurricane\nOh, my baby, won't you please let me love you\nAnd give you relief from this awful misery?\n\n[Verse 3: Female Singer]\nWhat is all this talk, about loving me, my sweet?\nI am not afraid, not anymore\nNot like before, don't you understand me?\nWon't you please pull yourself together? do it soon\nMy soul's on fire, come on and take me\nI'll be what you make me, my darling, my sweet\n\n[Verse 4: Sweet Dee (Breeze)]\nUh, I'm loving you from the first look\nLike Mobb Deep, you got me all shook, uh\n(Yeah, your love is real good, honey\nIt even feels better 'cause I didn't pay money)\n\n[Verse 5: Don Newkirk]\nOh, baby, you make me feel so good\nLet me take you by the hand\nCome let us visit out there in that, new promised land\nAnd maybe there, we can find a cool place\nTo keep our loving state of mind\nI'm so tired of being without love\nNever knowing what love is about\nHey, Mr. Houston, you come on in man\nAnd you can cut now if you want to\nWe're through\n(Yeah)", "year": "1999-02-23"}]}