{"songs": [{"year": "2016-02-12", "album": "The Life of Pablo", "image": "https://images.genius.com/a790030faa431687a8c79a92de6cc079.1000x1000x1.jpg", "title": "30 Hours", "lyrics": "[Intro: Arthur Russell]\nBaby lion goes\nWhere the islands go\n\n[Verse 1: Kanye West]\nYou say you never saw this comin', well you're not alone\nMillion dollar renovations to a happy home\nMy ex says she gave me the best years of her life\nI saw a recent picture of her, I guess she was right\nI wake up, assessin' the damages\nCheckin' MediaTakeOut\nPictures of me drunk walkin' out with a bitch\nBut it's blurry enough to get the fake out\nI wake up, all veggies no eggs\nI hit the gym, all chest no legs\nYep, then I made myself a smoothie\nYeah, then me and wifey make a movie\nChicago - St. Louis, St. Louis to Chicago\nÁndale, ándale E.I, E.I, uh-oh\nYou had me drivin' far enough to switch the time zone\nYou was the best of all time at the time though\nYeah, you wasn't mine though\n\n[Chorus: Kanye West]\nBut I still drove 30 hours\nAnd I, I still drove 30 hours to you, yeah\n\n[Verse 2: Kanye West]\nI remember rappin' for Jay and Cam\nYoung producer just trying to get his flows off\nI remember being nervous to do Victoria's Secret\n'Til I pictured everybody with they clothes off\nExpedition was Eddie Bauer edition\nI'm drivin' with no winter tires in December\nSkrrt, skrrt, skrrt, like a private school for women\nThen I get there and all the Popeye's is finished, girl\nYou don't love me, you just pretendin'\nI need a happy beginnin', middle and endin'\nChicago, St. Louis, St. Louis to Chicago\nIt's gettin' hot in here, that's all that I know\nGot a hotel room, three stars for you\nYou call down for an omelet, girl, it's 5 in the morning\nYou realize we at the DoubleTree, not the Aria\nOnly thing open is Waffle House, girl, don't start with me\nI used the Western Union for you like it's no prob'\n'Cause you was in college complainin' 'bout it's no jobs\nBut you were suckin' a nigga dick the whole time\nWell, I guess a blowjob's better than no job\n\n[Chorus: Kanye West]\nAnd I drove back 30 hours\n\n[Bridge: Arthur Russell]\nWhere the main ties onto the sail\nBetter on sighting\nFor astern, oh\n\n[Outro: Kanye West & André 3000]\n3 Stacks, can you help me out?\n30 hours\nYeah, this type of shit you just ride out to\n30 hours\n30 hours\nI just be like, it was my idea to have an open relationship\nNow a nigga mad\nNow I'm 'bout to drive 90 miles like Matt Barnes to kill...\n30 hours\nJust to kill..\nJust to...\nJust to...\nI'm about to drive 90\n90 miles like Matt Barnes just to whoop a nigga ass\nIt was my idea and now a nigga (30 hours)\nNow a nigga mad, now a nigga, uh\nA stunna\nWhoop him after school just to show I got class\nDuh-duh-duh-duh-duh-duh-duh-duh\nDuh-duh with you, yeah (30 hours)\nYou know what I'm sayin'? Drop some shit like that\nAyy, ayy woop him after school just to\n30 hours\nWhoop him after school just to show I got class\nUh, 3 Stacks\n30 hours\nJust ride out to that\nCheck it out: this the bonus track, this the bonus\n30 hours\nMy favorite albums used to have like bonus joints like this\nThat's why they kick it off like this\nYeah, just did that Madison Square Garden\n30 hours\nHad to put the flyest nigga on this shit, ayy, ayy\nThe pyramids shall rise\n30 hours\nLook at these ultralight beams flowin'\nFor all the moms, the dads, the kids, the families that shared this moment with us\nLet's rock out for 'bout\n30 hours\nYou know, ayy, you know\nAyy, you know, ayy, you know\n30 hours\nWhole design team, Yeezy team, music team\nRemember when the whole block'd get shout out?\nThis my version of a shout-out track\n30 hours\nLet that mothafucka rock, let that, let that, yeah\nTo my brother Yasiin, holding it down in Africa\n30 hours\nTo my family: thank you for holding me down\nThe media be acting like\n30 hours\nThat's Gabe calling\nYo Gabe\nI'm just doing a... I'm just doing an adlib track right now\nWhat's up?\n30 hours\n30 hours\n\n[Produced by Mike Dean, Kanye West & Karriem Riggins]"}], "artist": "Kanye West"}