{"songs": [{"title": "Baby Don’t Go", "image": "https://images.genius.com/1d12d7dc0eb80df9792dceff1153791b.1000x1000x1.jpg", "lyrics": "(Brother Ali Talking):\nHey little honey bee. Haha. You look like you were looking at me\nI was standing over here. Naw. You wasn't looking at me?\nWell what were you looking at then? I know that you weren't looking at nobody around me\nYeah, come over here. Lean a little bit closer\nLet me tell you something in your ear\n\nChorus: [X2]\nBaby don't go I know you're listening\nBut you gotta try to play your position\nFallin' in love and you won't admit it\nWe're only livin' come on and risk it\n\nVerse One:\nBaby girl I ain't easy on the eyes like the rest of them boys\nAnd I don't spend a months pay check on my clothes\nBut when you in the bed with the pillow under head\nWho you really want to get up and check on that noise?\nGot a permanent feather in my cap\nGot a strut in my stride, a stroll to my step\nRealizing that it's all about the mindset\nGet a little closer the older I get\nWear a ticklish grin on my chin\nThe good Lord put me in this particular skin\nWhen he speakin' to the angels, I be listening then\nAnd I share an inside joke with all of them\nI'm high without smoke\nShine without a rope\nI am the old, step out fly when I am broke\nThey always crowded around me when I spoke\nBecause every time I start rhymin' it's a quote\nLeave it to me to see the diamonds in your coal\nHoller at the glow from the bottom of my soul\nAin't no need to polish it no more\nBaby let your guard down and let your heart go\nGirl\n\nChorus [X2]\n\nBridge:\nC'mon and just throw your knees in the air for me baby\nTremblin' like you just might care for me baby\nSay hell yeah\nGood till you say hell yeah\n\n(Brother Ali Talking):\nI'm saying. I came all the way over here\nI done laid myself out. The least you can do is dance with me. C'mon\n\nVerse Two:\nIf I ask you to dance then we gonna actually dance\nI don't just rub my pecker on the back of your pants\nIf you're down to take a chance then let me lead you by the hand\nYou an expert on boys, let me teach about a man\nThey stand close to me\nThey want a dose of me\nIf you witness me how come you don't love me?\nI had to look this way because I'm so stunning\nI spear blind you until you don't see no ugly\nParty starter, show stopper, real, no drama\nBorn alone, die alone never had a coauthor\nDon't no joker throw down no harder\nLight the roof on fire we don't need no water\nWe gonna sit on a wish and let our feet dangle\nLet the song with no chorus be the lead single\nDamn how the world do it, the world is wrong\nShe knew I was right the moment she heard this song\n\nChorus [X2]\n\nBridge:\nJust throw your knee in the air for me baby\nTremblin' like you might just care for me baby\nSay hell yeah\nGood till you say hell yeah", "year": "2009-03-12", "album": "The Truth Is Here EP"}], "artist": "Brother Ali"}