{"artist": "Westside Gunn", "songs": [{"year": "2017-03-08", "lyrics": "[Intro: Westside Gunn]\nDrrttt\nBoom boom boom boom boom!\nAyo!\n(Ayo, Hitler on Steroids)\n\n[Verse 1: Westside Gunn]\nAyo\nIt's the zebra V2 rocker, guess who?\nMister completely in a Lexus coupe (skrrrrrrrrrr)\nHundred round drum, more fire\nI keep it on my jit, he got no priors\nGod bless the niggas doing twenty over crack sales\nHuman Made hoodie, jacket pastel\nPush a gold plated 'Rari\nA thousand bricks cracked the last scale\nServin' all nights, fiends up\nThree days no sleep, I gotta re-up\nKAWS painting hanging over the bake stove (bake stove), bake stove (bake stove)\nJewelry hang glisten\nLeave your brains missin'\nCVA whippin'\nNigga face twitchin'\nBag of Ace fishin'\nBucket hat flippin'\nRunning through the bricks\nLike Usain in that kitchen\nInsane when I'm dealin'\nHand to hand killin'\nWent to sleep, drink a million bricks\nWoke up like God willin'\nReal nigga shit\nShady just dropped off the bag\nNow I'm 'bout to go flip the shit\nTell papi I'll be right back\n\n[Refrain: Westside Gunn]\nTook the ones to cop the island\nTook the ones to cop the island\nTook the ones to cop the island\nTook the ones to cop the island\n\n[Bridge: Royce Da 5'9\"]\nOne hundred thousand machine guns get found in a row\nCome to your town, fuck ya fee hoe\nKnock 'em down in a row\nSniffin' cocaine off the table and the line in a row\nOne hundred thousand machine guns found in a row\n\n[Verse 2: Royce Da 5'9\"]\nLook\nI don't ask shit, I just spaz\nSki mask on in the Aston\nHeaded to Bible class\nAs the water in the streets splash, it's the fiberglass\nI classify your last album as weakass cyber trash\nI've amassed so many bodies I keep bags by the bags\nRight or wrong I'm willing to live or die by the song\nTattoos of my newborn son on my right arm by the psalm\nI'm legendary like Iverson\nCounting cash, splitting the pie with none\nNever will I divide the sum\nI'mma just be forever living or die by the gun\nUh, black and white tuxedo\nTuck ego, regal Billy Dee though\nTouch cheese, so cerebral skeezes be like \"fuck me, fuck me mo'\"\nUh\nPrayers up, fuck evil\nEither we in a players' club or a cathedral\nUp underneath a gazebo, clutch squeeze blow, but\nAllow us to begin\nThat's right I'm just gettin' started\nI got sluts and they lined up for the win\nI'mma be 'round here forever and the only thing falling off is my nut from her chin\nThinking is a nigga time up, then, when?\nAs I go to lift the blinds up at the wind\nWoo\nThey call a nigga wrecking ball Nickel\nNo shark swimmin’ or dentist'll check a jaw quicker\nProduct of my mama and papa upper dresser drawer wisdom\nIf there's a check involved I disconnect from flaw and then I connect to raw business\nUh, if there's an upper echelon, then every echelon should know I'm in this\nThe airhole on a barrel make the TECs so extra long-winded\n\n[Refrain: Westside Gunn]\nTook the ones to cop the island\nTook the ones to cop the island\nTook the ones to cop the island\nTook the ones to cop the island\n\n[Bridge: Royce Da 5'9\"]\nOne hundred thousand machine guns get found in a row\nCome to your town, fuck ya fee hoe\nKnock 'em down in a row\nSniffin' cocaine off the table and the line in a row\nOne hundred thousand machine guns found in a row\n\n[Verse 3: Conway]\nI pop the sticks, see fire comin' out the chopper pipe\nThese other niggas rappin' but they not as nice\nWhippin' rock, the white, flood the watch with ice\nMy dog just got some more blocks and plus he drop the price\nCop killas' and them clips, them shits'll stop ya life\nFuck all these niggas, my gun work, and plus, I can fight\nHave you shot tonight, I was broke but now my pockets right\nDrink is pain, my bitch don't drink pain, she like Ciroc and Sprite, aight?\nI'm a legend, you missin' the point\nRide through the hood with a stick in the Royce\nI'm good when I visit Detroit, I pull up and kick it with Royce\nTriple just hit me and said he got hoes, I can get any bitch of my choice\nNigga shot me and twisted my face, but it ain't do shit to my voice\nThese niggas can't fuck with the flow at all\nYou know my protocol\nThe grimy shit? I'm the one you know to call\nHit your head with this MAC 'til I blow it all\nReal life what he sold us all, yeah\nReal life how I got the city on my shoulders\n\n[Outro]\nGriselda, Griselda", "image": "https://images.genius.com/079ecc7893337f2190cd09569c96112a.800x800x1.jpg", "album": "Hitler On Steroids", "title": "100,000 Machine Gunz"}]}