{"songs": [{"lyrics": "[Verse 1: DaBaby]\nJust got off the phone with my partner\nHe told me he need three, I told him I got him (Ha)\nYou probably ain't heard how I'm rockin'\nI'll beat yo' ass up, leave my gun in my pocket (Yeah)\nJust went up on my prices, you dig? (I went up)\nKeep a gun wit' no license, you dig?\n\n[Verse 2: Stunna 4 Vegas]\nOff the top, I ain't writin' this shit (Uh-uh)\nI keep a Glock, I ain't fightin' you (Bitch)\nYeah, I'm tryna strike him (Come here)\nI got shit on lock, Rikers (On lock)\n\n[Verse 3: DaBaby]\nSent the DM, she think that I like her (Uh-huh)\nI just want some good head, she want titles (That neck)\nGot my music on Apple and Tidal (Ha)\nI got the juice like I'm Snapple, I'm viral (Ha-ha)\nShe sucked my dick for a pic (Uh-huh)\nI smack her ass, give her dick (Dick, dick)\nI'll turn your ass to a lick (Bitch)\n\n[Verse 4: Stunna 4 Vegas]\nWe hop off the sprinter with sticks\nWe came for a show, but these rods ain't for show\nNigga do the wrong thing and we endin' his shit (On gang)\nBruh, hop off the stage then we fallin' (Uh)\nNigga reach, is you tryna go viral? (Pussy)\nHe get beat to sleep for playin' tough in the club\nHe won't remember tomorrow (Gang)\nI'm a real-I'm a real blockstar (Uh-huh)\nStunna man got the block bumpin' (Uh-huh)\nMy name in the streets like I popped somethin' (Yeah)\nNigga play with my name, have the block jumpin' (Uh-uh)\nYour bitch on my dick when I drop somethin' (Ooh)\nYou ain't hit no licks, nigga, stop frontin' (Uh-uh)\nI ain't tryna lip box\nI'm tryna knock him out the frame, Stunna gon' crop somethin' (Come here)\n\n[Verse 5: DaBaby]\nLookin' for his bitch like he lost somethin' (Where she at?)\nShe wit' me, I got my feet up (Ha, ha)\nMy dick on the plate, make her eat up (Eat)\nHe can still get a P, bro, they cheap (Ha)\nA trapper turned rapper\nBeen losin' my plays 'cause I've been out of town for a week (Damn)\nToo busy, I can't pick my phone up (I can't)\nDon't argue with hoes, bitch, we grown-ups (Yeah)\nI walk it out, DJ Unk (Walk it out)\nGot that fire on me, not fuck with Trump (Got that fire)\nDo my dance on your main, she gon' fuck\nNigga, play with the gang if you want (Yeah)\nI'll do a show, get you hit (Get you hit)\nHundred twenty-five hoes on my dick (Twenty-five)\nI bumped into your swoop, she a goner (She gone)\nShe wasn't my type of boo, I ain't want her (Uh-uh)\nPassed it down through the crew, here go Stunna (Okay)\n\n[Verse 6: Stunna 4 Vegas]\nUh, bro send that pack off like a punter (Trap)\nI son that boy like his uncle (Bitch)\nHe claimin' somethin', we puttin' him under (Come here)\nWe beat down his block like some drummers (Wham)\nNo Thug, I'm really with gunners (Slime)\nAyy, I'm in her mouth like a sucker (Ooh)\nI use her face, I won't nut on the covers (Thot, thot)\nFour times, these bitches love me (Four times)\nSee me with DaBaby, now they wanna fuck me (Gang)\nAnd if I do, bitch, you lucky (Ooh)\nHa, I bet he gon' die if he touch me (Wham)\n\n[Outro: Stunna 4 Vegas & Da Baby]\nFour times, four times, four times\nPop your shit, nigga, pop your shit, go 'head\nFour times\nPop your shit\nBlank Blank\nPop it\nBlank Blank\nPop your shit, talk your shit\nYeah, hottest young nigga doin' this shit, bitch (Bitch)\nFour way, you get this shit the glo way\nHallway, rundown, god way, grahh\nThat's why I fuck wit' nigga\nThat's why I fuck wit' that nigga right there\nHuh?\nHe gon' pop his shit, you hear me?\nHuh? Huh?\nReal talk, I'm the best motherfuckin' rapper, Stunna the best young nigga rapper, bitch, we takin' over\nBlank Blank", "album": "Blank Blank", "year": "2018-10-31", "title": "4X", "image": "https://images.genius.com/d5adb2deede7009c588c4e5b88bda515.800x800x1.jpg"}], "artist": "DaBaby"}