{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/e4b6cffbcfbd231e11a0a3d0769476e6.900x900x1.jpg", "title": "Hi, I’m Scott (TEDx Talk)", "year": "2015-12-18", "album": null, "lyrics": "Look at that handsome face!\n\nUhh! Okay. Just wanna check the mic first (?) get the sound right. This is not comedy hour, I promise.\n\nThe funny thing is: I used to go to this school. And my class used to sit like in this area, here. Yeah, O2, who’s an O2er?\n\nKendra, come here! Kendra, come on! Kendra (?) everybody! Come, give me a hug! I mean, how long has it been, two decades? Come up here! I was at all doing me. (?). How about that – reunion!\n\nOkay. So, it’s just a little surreal, I haven’t been in this room since 1999, 2000 maybe. So, I’m 31, I just turned 31 on January 30th, how about that? Oh, thank you, thank you.\n\nAnd, when I was approached to do this Ted Talk, I was immediately like: Why? And, then it was kinda like, put in perspective by me, in – I’m not really one to do speeches, I’m really weird, if you can imagine as I do the performing and I’m on stage, doing this is my job. It’s different to stand up in front of people like this when there’s this light and speak and, you know, express yourself in this way.\n\nBut, I told myself, okay, how am I gonna be able to do this, let me just talk about my life. That’s something I know, better than anyone else. And, I feel like coming from Cleveland, coming from Shaker, you know, such a diverse place, and just looking in the audience from the people I can’t see, it’s still … very diverse. But, I believe that my upbringing in this town, the school, district, is what made me the man I am today.\n\nAnd when I moved away when I was 20 years old, my mom was extremely sad – where’s my mom at? Yeah. She was crying. Hey Mommy. My first big fan was my mom. And, it was really interesting, I remember leaving home, and she’s giving me a hug at the airport, and she leans and she goes: “You can always come back around, you can go right back home, you can change your mind, everything will be fine.” I’m like: “No, I’m going, this is happening.” And you know, walk into security and then looking back and just seeing her like: “Ohhh...” And me just being like: “Errr…”\n\nHowever, as soon as I turned back around, I knew I was on a mission, on this very specific quest. You know? It was bigger than just wanting to be a musician, or do movies. It was about: Finally showing the world what Scott could do. I wasn’t the best student, I’mma be honest with you, Kendra knows this. If Kendra was in my class and she was sitting next to me I probably would have tried to cheat off her.\n\nBut that’s not the point. The point is, it’s like: When I think about it, you know, I wish I applied myself as much as I applied all the energy into music as I did, as in music as, you know, as in music, I wish I could have applied that same energy into my academics when I was in school. So a lot of people look at me now and they go: “Oh man, this must be dope to be a rapper.” And it is dope, it’s awesome. (?)\n\nBut, you know, I can’t say that I don’t wanna sometimes go back and relearn some things. I can’t say I don’t feel out of certain conversations that my friends have. You know, and these are things that I think about, you know, cause being at school is all about being cool and wearing the fresh – I was gonna curse but – wearing fresh clothing. And being popular. And, when you go out into the real world, you realize that that moment is just a little beep of your life. High school, you know. Now I remember Kendra (?), but everything else I don’t remember. No I’m just joking. But I’m just saying: At that moment in life you feel like that’s all that matters. High school, it’s like: Oh this girl doesn’t like me, this guy here and there’s all this drama, this drama, and you go into the real world and you know it’s about just trying to make your mark in the world. And I never got the chance to do that academically.\n\nSo I had this fire, I had this fire to pursue this musical career. I had no idea how to go about it. I was living with my uncle who was up in the age at the time. 80 years old. Older uncle. So when I moved to New York it’s not he could show me around, show me all the cool spots, you know, he was just kinda like: “There’s the train and you get a metro card, and you go.” And I was: “Yeah okay, we got the Rapid, I can do this. It’s all right.” I was immediately wrong for that, for assuming that it was gonna be the same. It is not the same.\n\nUm, but, I embraced it. I embraced the fear, the danger. I enjoyed the fact that I was going in uncharted territory. It was like a sense of wonder for me. And, I can’t say I was one of those people that was into like having thrills and, you know, getting some type of stimulation from that, but it was nothing like saying, like: “Y’all I’m gonna out and pursue something and I know I’m gonna do it. And nobody’s gonna tell me I can’t. And everybody that doesn’t believe it I’mma prove it to ‘em sooner or later. And that’s just what it is.” Because I won’t point I didn’t feel like I was smart enough to pass that test. Or I didn’t feel like I was smart enough to go to this college.\n\nBut with music it was like: Nobody’s gonna take that from me. You know what I’m saying? Because it was things that I was dealing with as a youth at this school that I didn’t talk to people about. That probably kept me from put my best foot forward with my academics. You know? And with music, it was a platform for me to express myself and also realize that I’m not that crazy. That there’s other kids out there that might me depressed or lonely, dealing with suicide, things like this.\n\nAnd, it was one of those things that, you know, I just feel really blessed to just have my mom who has been my supporter forever, who supplied that trip financially, first couple of months or whatever. Um, to have the support of my home town, I can come back in this room and just feel the love and energy, you guys got me really nervous, my palms are sweaty. But, um, it’s really just the clock, it’s like: 11 minutes, 24 seconds, 23 seconds, 22 seconds … It’s like what’s gonna happen when that clock’s over with? It’s like somebody gon’ just pull me off stage? Geez.\n\nUm. But um, really, I, first thing I did when I went to New York, and most people think it was kinda like this amazing adventure – it wasn’t. It was pretty much finding a job. And for the first couple years I was working everywhere. You know, whether it was like at this clothing store here, or Abercrombie & Fitch, or American Apparel, or Dean & DeLuca, I always had a job. I was a hustler. And, you know, I still apply that same work ethic with the music.\n\nYou know what I mean, like, I’m almost in a way don’t know how to relax because my whole life has been just a grind. You know what I mean? And, I think that, when people ask me: “Man, how do you do it”, you know, I’m just kinda like: “I don’t know, like I was just … focused?” You know? Because it’s hard to put it into words because I can’t say that it’s just something I flipped, a switch I just flipped when I turned 20. Like I was always this guy.\n\nYou know, I was always outspoken and creative and artsy, I used to draw when I was a kid, it was before all the musical stuff came along. I was an artist. You know, I used to draw all my stuff, I used to draw all my tattoos and I said: “Oh when I get 18, I’mma draw, I’mma get these tatted.” It was about being a cartoonist up until I was like 15. And then I just wanted to be a rapper. And then it was all uphill from that.\n\nBut, you know, … if I could really just give people one piece of advice, you know, and it just passes along, and one thing I want you to take from this, is that like, we are all the commanders of our own destiny.\n\nYou know what I mean?\n\nIt’s like you see these movies where they say, like that one movie with … Lucy, where she has 100 percent of her brain power and she can do anything she wants. You know, and you realize that the average human doesn’t use at … two, three percent. You know what I mean? Some weird small percentage like that.\n\nI really just told myself from jump like: “Hey man, I’m gonna do this, and I apply the information that I needed to execute that and in places, times of my life where I didn’t have the answers, I make sure to get the information or surround myself with people that had the information.” You know what I mean? You can’t hang out with people that ain’t doing nothing. How you gon’ get money, hanging around with people that ain’t got no money? You know what I’m saying?\n\nLike, how you gon’ be inspired by people who aren’t at least trying to go the same way, at least, whether it’s music, or schooling, like I would be inspired by all my friends, cause, I went to college, I went to University Toledo for one year for film – it sucked, I hated it. You know, it wasn’t for me. But my film class, my film classes were amazing, um, and now that I’m doing acting, producing shows, writing shows, I wish I wrote that whole couple, three more years out, cause I would have information that I needed, and I wouldn’t have to go through so many hoops, to be able to direct or create my own film or TV show. Um, I don’t know why I said that, let me get back on track … Okay.\n\nSo, um, really, you know, people, like I say, come up to me all the time and they like: “Man but you did it man, you’re special, you’re different” – and I’m not. Any different. From you, you – we’re all the same. I came from this town. I went to this school. All my buddies, we all had the same opportunities, you know? It’s kinda just like: Having that self-confidence. You know? And it was a lot of areas in my personality where I wasn’t as confident. You know? Definitely with the chicks. Early on. I don’t know if Kendra knows this.\n\nBut the music, me doing something, where I was like: “Wow, I made this!” Like my first album, when that came out, I was like: “Wow! I made this, this is something that I put all my energy into, and it’s out and it’s released to the world on a professional level.” I was so proud of myself. But: “Let’s do it again.” I didn’t have time to be like: “Yeah, my first album, yeah, yeah, people like it”, it was like: “Okay, we did good, it didn’t suck, what are we gonna do again, we gotta do another one.” And then I did that one: “Okay, people like it, let’s do a third one.” You can’t get caught up in just all the other things, you know, I really was like, even still to this day, I have my front, but it’s focused, you know, it’s never, you know, even when I do straight, I’m still working. I’m still writing a song, I’m still doing something. I’m persistent.\n\nYou know, um, and that’s also another part, you know, I believe that some people get lazy. Some people might have that one painting that they started to paint and never finish it. Because they get caught up in their head and it’s: “Oh, I can’t do this, maybe I can’t do this.” It’s like sticking to something. One goal at a time. You know, that was like, that’s still big for me. I never put too much on my plate. You know, at first it was like the music, and then the acting kinda came into play, early on, and I, it was unexpected, but it was a blessing, that I was prepared for. I was like: “Man. I’ve been a class clown since forever, let’s do this.” And I used to do it for free, now I’m getting paid for, this is great. Um, so, you know, I’m glad you guys like my jokes, I’m not even a comedian, this is just…\n\nUm, so, you know, just kinda fast forward cause it’s so much I’m tryna squeeze into 5 minutes, 56 seconds. Um, but, you know man, there are a lot of haters, there are a lot of doubters, there are a lot of people that would telling me: “Man you ain’t gon’ do that.” “That’s not gon’ happen.” “He’ll be back.” I would tell all my buddies: “I’m moving to New York” – “All right! You’ll be back!” Nah. Nah. I’m not coming back. And if I do come back, it’s for a concert. You know? And everybody be like: “Alright, whatever.”\n\nAnd when I came back it was for a concert. It was for a concert, and it was the most beautiful homecoming I’ve ever had. It’s no show more important than this show. And I’m not just saying that because it was like: In Cleveland, and it’s like, my home town. It was the first time I saw my peers, friends I went to school with, being proud of me. I didn’t get the moment to walk across stage with everybody. I didn’t get the cap and gown. You know what I mean? I didn’t get the chance to see these guys because I moved to Solon, 11th grade. It’s like even seeing Kendra is wild, because I haven’t seen anybody in so long. Um, but, that’s the beautiful moment, still to this day, I do shows and I see a class mate in the crowd and I forget my raps, I’m gonna: “Oh … oh … happy, you got any kids, I’m sorry, I gotta …”, you know? It’s wild. You know?\n\nAnd, I didn’t get that at school. I didn’t play on the football team – I tried, but I was terrible. I didn’t play on the basketball team – I tried, but I was terrible. I didn’t wrestle. I tried – no, no. I did try. But I tried outside of the Shaker Heights High School, in another district in Cleveland Heights, where none of my peers could see me and me be embarrassed. It was kinda just like: “Okay I try this in 7th grade and be terrible and then nobody in Shaker will know about it – cause it’s in Cleveland Heights, they’re just talking over there.”\n\nBut my point is also like music was my plan G. You know, it wasn’t like I didn’t try anything else, like I tried everything else. I tried everything I thought, you know, was a traditional thing a young boy should do – sports, you know, and even going to college was me just tryna fulfill a destiny where I thought it was my own destiny, but also I wanted to make my mom happy. You know? And sometimes guys, we gotta do that. You know, there’s a lot of things that we don’t wanna do stuff, but it’s like, man, like, your parents (?), they really have to deal with a lot of our shit. And you know it’s like, and now I’m at 31 and I’m just like: I have to apologize to my mom, was it like seven years ago, I was like: “Mom, I am sorry.” Like: “I was a nightmare. But we got money now, so let’s just go like…” And we’re okay. We’re good now.\n\nUm, and it’s funny, too, cause I took my mom to get her first tattoo ever, I forced her to get a tattoo, and it’s so funny, cause she – are you, are you embarrassed, I’m sorry. But this is big, you know, because our relationship from the kid I was at high school, it’s the best it’s ever been. You know, I used to put my mom through hell. But, she was my supporter. And that’s what parents are there to do. To give you the devil’s advocate, even when, I’m not gon’ say, every time I told my mom I was moving to New York, she was like: “Pff. Okay. Aight.” You know, but that was more so like the fear of letting your child go out into the world, more so like the people in the street that are just hating on you don’t wanna see you win.\n\nParents care. Now I got a four-and-a-half-year-old, she’ll be five in march. She’s the apple of my eye. She’s my little baby. And, she’s so funny, you know, cause, I’m the one who gets emotional when she has to leave, you know, and I’m kinda just like, when she’s leaving, I’m like: “You know I’mma miss you, right?” And then she’s like: “Yeah.” And I’m like: “You gon’ miss Daddy?” – “Yeah.” “Oh my … You know you can call me and stuff, when you miss me? And I’m just sad you’re leaving.” She’s like: “It’s okay. We always come back.” And I was just like: “That’s what I’m saying, all that, that’s why I’m crying, I’m so emotional!” But it was just like beautiful to just see, you know like, me be the parent now. You know what I’m saying? And to see that confidence of my child, and the same confidence I gave my mom and you gotta just kinda take it backseat and go: “Okay.” Cause I literally like follow my daughter’s lead. I mean, I just, whatever she is telling me to do, I just follow whatever she – well I mean, obviously not in every way. Or else like, I would be broke, but … in some ways I do what she asks me to do or what she tells me to do.\n\nBut, that’s the beauty of life y’all. You know what I’m saying? I used to come in this room, I used to sit right in that section. Sometimes I’d pay attention – sometimes I wouldn’t. Most of the time I’d be checking out chicks. Some chick I probably never talk to cause I never had the confidence, maybe if a – what’s the day that we would send carnations, Kendra? Valentine’s Day. That wasn’t a joke. I was the king of like, sending, like, carnations to chicks that I never talk to. I would be asking my mom for like: “Mom, can you give me five bucks, you know it’s (?) today, I wanna (?).” And, she would just be like: “Okay”, you know? Not knowing that I was buying carnations for all these chicks, you know, but, thanks for supplying that, Mom.\n\nBut, with 23 seconds left. I just what y’all know that life will throw you through shit ton of curve balls, it’s scary, but like, if you believe man. You know? I you believe. And if you want it. And if you wanna work hard enough for it. You can be so. Cause it’s no difference from me and you. I just really wanted this shit. I wanted it bad. You know? And I didn’t want to be a failure. And nobody’s a failure in this room. Don’t ever think that. We can all win. And that’s it.\n\nThanks."}]}