{"songs": [{"image": "https://images.genius.com/3f2040bca1feff51a85c56dd0f3cb107.500x500x1.jpg", "year": "2012-06-15", "title": "Hi, Life", "album": "Popular Culture", "lyrics": "[Hook]\nHi, life; goodbye, world\nFeel like I can fly to the moon\nLiving that high life, in my world\nAnd I don't think I'm gonna leave soon\nSo I say hi, life; goodbye, world\nFeel like I can fly to the moon\nCause I'm so high\n(I'm so gone, man I'm so high)\n\n[Verse 1]\nMillionaire shades, I am for a lifeline\nLooking at the stars, the TV is my nighttime\nLeft my watch at home, it never is the right time\nYou ain't in your right mind? Shit, I can't even find mine\nBoy in the hood, smoking on that sticky shit\nHole in my chest, kind of like Ricky's is\nMake my team all-spark like Sam Witwicky did\n'Til my life is gravy to the point I think I'm really shit\nMama always ground me, funny how I fly now\nPut no one above I, maybe just my eyebrows\nI just want to love life; world, I'm saying bye now\n'Til I'm dead in your ground, I'm living in my cloud\nLife is a bitch, that I won't deny\nBut when she treat me good, she's a lady in my eyes\nAll I want is her, and all she want is mine\nBut man, I only love her when she's high\nBut still I say...\n\n[Hook]\n\n[Interlude]\nWhat did I tell you?\nBaby, we have no rules...\nDon't you want me? (Yeah)\n\n[Verse 2]\nKonichiwa life, everybody's balling\nI just see the high lights, and Wayan like I'm Marlon\nShe offers a fly life, I offer her pollen\nShe calls me her lover, I love her, she's my darling\nShe says if I go all out, she will put her all in\nI don't ever dial out, waiting for my calling\nNo one always wins, so everyone's a loser\nPeople pretend to hate her, until the day they lose her\nShe's my present, past, my Marty McFly future\nMusic made my life cooler, the tide just didn't suit ya\nTic-tac-toe, put the circle in the square, now X is up\nAnd I got it all from scratch like eczema\nGetting too old, putting that lethal weapon up\nHotel key-cards, cheap broads checking us\nLife's so right, how many days you got left in ya?\nBaby girl is dressed to kill and she ain't even dressing up\nIn her walls, I'm that guy\nShe said I'll only see her, if I go outside\nLife waves hello, the world tells me bye\nBut damn, I only love her when she's high\n\n[Hook]\n\n[Interlude]\nBaby, stay with me\nBut let me keep you high\nDoesn't it feel good? (Yeah)\n\n[Verse 3]\nBonjour, life; the show must begin\nAnd even when it ends I want the encore lights\nCondor wings, Concorde flights\nShe is my keys, and I am her type\nTangled in a web, she keeps showing me sites\nI don't want her to leave, but I know that she might\n\"Onto the next\": the motto she lives by\nWanted to stick around, and I know that she'll try\nBut why I only love her when she's high?\n\n[Hook]"}], "artist": "XV"}