{"artist": "Ace Hood", "songs": [{"title": "Different People", "album": "Starvation", "year": "2012-03-26", "lyrics": "[Intro: Ace Hood]\nWe are different people\nBorn alone, I'mma die alone nigga\n\n[Hook]\nWe are different people (we are) (x2)\nWe are different people (church)\nWithout races (preach)\nDifferent aspirations (preach) (x2)\nDifferent aspirations, without faces\n\n[Verse 1: Ace Hood]\nMama was a hustler, daddy was a deadbeat\nChances of me out the hood was rarer than some red meat\nPistol on my night stand, now I lay me down to sleep\nI believe in god but deep inside resides the beast in me\nNightmares of being broke never seemed to be a joke\nSlidin’ with that 44 and my license been revoked\nBlondie raised a real G, paid and I'm still me\nReal love you real, I don’t respect the niggas in between\nI’m like Achilles from the Troy movie\nThat do some damage like a full Uzi\nI am nothing like you other dudes\nSame common goals but we got different views\nSnitching under pressure, that’s a never do\nClick of loyal niggas with me as I’m makin’ moves\nTalkin’ tough onto that killer with you in the booth\nI’m prepared to die, question is: are you?\n\n[Hook]\n\n[Verse 2: Game]\nI’m prepared to die, I got the blueprint\nTo how to tote that 45, survive realized\nI can’t be fucked with on no scale\nNot the hoes, the money, the swag\nNow my G-code, I'mma spray and reload, hit your toe with a tag\nNiggas hood with it, yo Ace what's good with it?\nHe got the ace, I got the spades\nGetaway car, we ready for the raid or whatever\nI can’t be stopped, no hair\nI’m the net son, half a million dollars up will get some\nBurner on my waist them hollows yelling \"come get some\"\nI flip you and murder around, yeah red rum\nNigga what the blood clot? Don’t get blood shot\nMurder ain’t shit to me, I love taking mug shots\nLove taking bitches from Paris down at Jamaica\nLove sittin’ on the floor while Rihanna watching the Lakers\nI’m a bad boy, ain’t seen Puff in years though\nBut I keep some B.I.G. off in my ear lobes, hood!\n\n[Hook]\n\n[Outro: Ace Hood]\nMama was a hustler, daddy was a deadbeat (x3)\nChances of me out the hood was rarer than some red meat\nPistol on my night stand, now I lay me down to sleep\nNow I lay me down to sleep (x2)\nPistol on my night stand, now I lay me down to sleep", "image": "https://images.genius.com/ee1f29169e460342b88aa5c8d75ede59.500x500x1.jpg"}]}