{"artist": "Pouya", "songs": [{"album": "The South Got Something to Say", "title": "Talk to Me Before I Die", "image": "https://images.genius.com/acf70667ef0a748f2ca4485b706fa611.1000x1000x1.jpg", "lyrics": "[Verse 1: Pouya]\nIt's hard to feel\nEasy to kill, hard to deal\nEasy to give up, hard to build\nEasy to break down, ease up, run the fees up\nWith my feet up in the Fiat, let my brain rot\nFeel the raindrops in my tank top\nAnd I can’t stop and I can't move\nWhen I wake up and I break up\nAnd I say stuff that was never meant to see the daylight\nI realize that I demonized you when I blamed my problems on you\nIt was always me, I'm uncomfortable in my skin when I’m not with you\nI feel like I'm walkin' in circles, what's my purpose? Brand new whips and purses\nBeggin' my baby don't hurt me like I hurt you, yeah\n\n[Chorus: CUCO & Pouya]\nSing to me a lullaby, talk to me before I die\nQuestion my emotions, I'm so sick from all the notion that\nEnding this sounds easy, maybe I'll end up on TV\nI can’t seem to find the meaning, I can’t seem to find the meaning\nI wanna feel alive, how do I tell these lies?\nHow do I look at you and tell you that I feel alright?\nDon't wanna hurt this way, do I deserve to stay?\nDo my apologies mean anything to you today? (Yeah)\n\n[Verse 2: Pouya]\nIt’s hard to feel alive\nIt's easy to wanna die\nIt's hard to look at my reflection\nEasy to grip that Smith & Wesson\nEasy to fuck that bitch, no question\nEasy to get my dick hard\nIt's easy to get real pissed off\nIt’s hard to quit my day job\nIt's easy to pop pills, skip meals\nGet fucked up, tucked under covers\nNever leaving my dojo where I stay solo\nWhen I feel safest and I'm less anxious\nBegging for someone to save me\n'Cause most of the homies around me forsake me lately\nCreepin' on me when the sun go down, so shaded\nNo surprise it don't faze me, yeah\n\n[Chorus: CUCO]\nSing to me a lullaby, talk to me before I die\nQuestion my emotions, I'm so sick from all the notion that\nEnding this sounds easy, maybe I'll end up on TV\nI can't seem to find the meaning, I can't seem to find the meaning\nI wanna feel alive, how do I tell these lies?\nHow do I look at you and tell you that I feel alright?\nDon't wanna hurt this way, do I deserve to stay?\nDo my apologies mean anything to you today?", "year": "2019-07-01"}]}