{"songs": [{"image": "https://images.genius.com/134aec1024a9790ac74d7383124949f3.800x800x1.jpg", "title": "Reality", "album": "Moments ", "year": "2010-11-29", "lyrics": "[Intro]\nHey, welcome to reality\nYeah\nSometimes, we all get away from that real life\nYou know sit back and think about, \"What if my life was like this?\"\nIt's crazy\nAnd when you think about it\nKinda like a dream\nYeah, Yeah\n\n[Verse 1]\nImagine a life where you ain't got no reason to cry\nIt ain't hard to tell the truth when there's no reason to lie\nPicture everything bad that ever happened to you\nSnap it in two then laugh at those that laughin' at you\nImagine your pain disappears like magic\nEverything that ever hurt you never happened\nYour dad never left, your mom never cried\nYour relationships' perfect, and nobody dies\nYou feel far from reality yet\nI do, so I'mma bring reality back\nYou never met your dad, gone since you was a kid\nMatter fact, he left before you even cried in the crib\nAnd you momma always cryin'\nStartin' to mess with your head\nTo the world, you alive\nBut to yourself, you're dead\nLook in the mirror, heart's so full of rejection\nSo you cock your fist back, then crack your reflection like\n\n[Hook]\nYeah\nI don't like the way that I feel\nLookin' for reality, but this ain't real\nWhat am I supposed to say, yeah\nI ain't supposed to feel this way\nIt's like\nYeah\nI don't like the way that I feel\nLookin' for reality, but this ain't real\nWhat am I supposed to say, c'mon\nI ain't supposed to feel this way\n\n[Verse 2]\nImagine everyone you knew respected you\nPut your name up high when they mentioned you\nNever talked about you bad behind your back\nAnd what they say is what they do\nAnd what they are is how they act\nImagine every girl you had never hurt you\nAnd every guy you fell in love with didn't desert you\nEvery lie on the earth was real\nAnd didn't mind really lettin' out the way they feel\nBut hold up\nLet's slow it down for a minute\nOh no! Lies in your face\nI don't get it\nWhat happened? I must have been dreamin' again\nAnother fake friend in your face playin' pretend\nAnother liar\nYellin' it ain't nothin' but truth\nAll cryin', screamin', \"I would never hurt you\"\nYeah, like we ain't heard that befo'\nYou want the truth? What you think I'm rappin' fo' like\n\n[Hook]\nYeah\nI don't like the way that I feel\nLookin' for reality, but this ain't real\nWhat am I supposed to say, yeah\nI ain't supposed to feel this way\nIt's like\nYeah\nI don't like the way that I feel\nLookin' for reality, but this ain't real\nWhat am I supposed to say, c'mon\nI ain't supposed to feel this way\n\n[Verse 3]\nPicture a man that never did nothin' wrong\nGot beaten 'til most of His flesh was gone\nPut thorns in His head while they laughed and mocked Him\nDevil laughin' down in Hell like, \"Yeah, I got Him\"\nImagine nails goin' into your palms\nStrapped to a cross\nSoldiers strechin' your arms\nLike a joke, people all gather around\n\"If you so powerful, then why don't you just come down?\"\nYour mother cryin' at your feet\nBreathe your last breath\nYou want reality, man that's as real as it gets\nThe one true God came down to earth to die\nNever committed a sin, yet He died for mine\nAnd seems we all so caught up in the crazy life\nDie for the world, then we'll know what crazy like\nGotta be blind homie if you can't see it\nSo think about it next time yeah before you scream it like\n\n[Hook]\nYeah\nI don't like the way that I feel\nLookin' for reality, but this ain't real\nWhat am I supposed to say, yeah\nI ain't supposed to feel this way\nIt's like\nYeah\nI don't like the way that I feel\nLookin' for reality, but this ain't real\nWhat am I supposed to say, c'mon\nI ain't supposed to feel this way"}], "artist": "NF"}