{"songs": [{"lyrics": "Part I\nMy life after childhood has two main stories: the story of the hustler and the story of the rapper, and the two overlap as much as they diverge. I was on the streets for more than half of my life from the time I was thirteen years old. People sometimes say that now I'm so far away from that life - now that I've got businesses and Grammys and magazine covers - that I have no right to rap about it. But how distant is the story of your own life ever going to be? The feelings I had during that part of my life were burned into me like a brand. It was life during wartime.On \"Public Service Announcement\"\n\neven when a rapper is just rapping about how dope he is, there’s something a little bit deeper going on. It’s like a sonnet, believe it or not. Sonnets have a set structure, but also a limited subject matter. They are mostly about love. Talking on such a familiar subject and writing about it in a set structure forced sonnet writers to find every nook and cranny in the subject and challenged them to invent new language for saying old things. It’s the same with braggadacio in rap. When we take the most familiar subject in the history of rap -- why I'm dope -- and frame it within the sixteen bar structure of a rap verse, synced to the specific rhythm and feel of the track, more than anything it’s a test of creativity and wit. It’s like a metaphor for itself; if you can say how dope you are in a completely original, clever, powerful way, the rhyme itself becomes proof of the boast’s truth. And there are always deeper layers of meaning buried in the simplest versesFrom Negative Space section\n\nHip-hop has always been controversial, and for good reason. When you watch a children's show and they've got a muppet rapping about the alphabet, it's cool, but it's not really hip-hop. The music is meant to be provocative - which doesn't mean it's necessarily obnoxious, but it is (mostly) confrontational, and more than that, it's dense with multiple meanings. Great rap should have all kinds of unresolved layers that you don't necessarily figure out the first time you listen to it. Instead it plants dissonance in your head. You can enjoy a song that knocks in the club or has witty punch lines the first time you hear it. But great rap retains mystery. It leaves shit rattling around in your head that won't make sense till the fifth or sixth time through. It challenges you\n\nWhich is the other reason hip-hop is controversial: People don't bother trying to get it. The problem isn't in the rap or the rapper or the culture. The problem is that so many people don't even know how to listen to the music\n\nSince rap is poetry, and a good MC is a good poet, you can’t just half-listen to a song once and think you’ve got it. Here’s what I mean: A poet’s mission is to make words do more work than they normally do, to make them work on more than one level. For instance, a poet makes words work sonically - as sounds, as music. Hip-hop tracks have traditionally been heavy on the beats, light on melody, but some MCs - Bone Thugs ‘N Harmony, for example - find ways to work melodies into the rapping. Other MCs - think about Run from Run-DMC - turn words into percussion: cool chief rocka, I don’t drink vodka, but keep a bag of cheeba inside my locka. The words themselves don’t mean much, but he snaps those clipped syllables out like drumbeat, bap bap bapbap. It’s as exciting as watching a middleweight throw a perfect combination. If you listened to that joint and came away thinking it was a simple rhyme about holding weed in a gym locker, you’d be reading it wrong: The point of those bars is to bang out a rhythmic idea, not to impress you with the literal meaning of the words\n\nBut great MCing is not just about filling in the meter of the song with rhythm and melody. The other ways that poets make words work is by giving them layers of meaning, so you can use them to get at complicated truths in a way that straightforward storytelling fails to do. The word you use can be read a dozen different ways: They can be funny and serious. They can be symbolic and literal. They can be nakedly obvious and subliminally effective at the same time. The art of rap is deceptive. It seems so straightforward and personal and real that people read it completely literally, as raw testimony, or autobiography. And sometimes the words we use, nigga, bitch, motherfucker, and the violence of the images overwhelms some listeners, It’s all white noise to them until they hear a bitch or a nigga and then they run off yelling “See!” and feel vindicated in their narrow conception of what the music is about. But that would be like listening to Maya Angelou and ignoring everything until you hear her drop a line about drinking or sleeping with someone’s husband and then dismissing her as an alcoholic adulterer\n\nBut I can’t say I’ve ever given much of a fuck about people who hear a curse word and start foaming at the mouth. The Fox News dummies. They wouldn’t know art if it fell on them.", "title": "Decoded: Part 1 (Excerpts)", "image": "https://images.rapgenius.com/2642d731d987fb27a2de4a06a5f0319b.1000x515x1.jpg", "year": "2010-11-10", "album": "Decoded (Excerpts)"}], "artist": "JAY-Z"}