{"songs": [{"image": "https://images.genius.com/e2ff502068eaa8fe29f8949d454546f6.500x500x1.jpg", "title": "I Came Thru", "album": "Realer", "year": "2018-12-20", "lyrics": "[Intro]\nYeah, yeah\nUh-uh, yeah\nUh-uh, yeah\nSlime\n\n[Verse 1]\n4 in the morning, shorty textin' me down\nSay she want a nigga for to slide through\nI was tryna make the pack touch down\nMy niggas drivin', that's some shit I don't do\nThese niggas cappin', keep it G, which one you workin' bitch?\nAnd I'm too slimy for to be up on some hurtin' shit\nHe slang that iron, on 4K Trey, yeah I can vouch for jit\nSlidin', you be in, so you be out, oh, I'ma talk my shit\nReal player never sayin' who he fuck with\nReal hoes never layin' with niggas they hoes slept with\nTryna put this cutter on a nigga on some fuck shit\nThey ain't down with me but they know I'm one nigga that it's up with\n\n[Chorus]\nNigga, I came through swervin'\nI was thuggin', gettin' loaded, gettin' dirty\nHe want smoke, we blow it, make him choke it\nWe gon' murder him\nSippin' potion, tryna focus\nNigga play, we shoot another film\n\n[Verse 2]\nBeen gettin' dirty out my top so nigga, what you wan' do?\nI'm with some niggas with no name, when you say something, they like, \"Who?\"\nHe lost his brother to this shit, but he gon' bang 'til he through\nAnd I can tell you Black snort 'caine before he load up and shoot\nI'm smoking doja, my cup dirty, Percocets, I'm on two\nThis nigga actin' like a bitch, I can't control what he do\nWell bitch, we steppin' on you, a hundred flyin', comin' through\nAnd fuck that bitch, that ho ain't shit, she cross that line with me too\n\n[Chorus]\nBut nigga, I came through swervin'\nI was thuggin', gettin' loaded, gettin' dirty\nHe want smoke, we blow it, make him choke it\nWe gon' murder him\nBeen drankin' potion, tryna focus\nNigga play, we shoot another film\nNigga, I came through swervin'\nI was thuggin', gettin' loaded, gettin' dirty\nHe want smoke, we blow it, make him choke it\nWe gon' murder him\nSippin' potion, tryna focus\nNigga play, we shoot another film\nNigga, I came through swervin'\nI was thuggin', gettin' loaded, gettin' dirty\nHe want smoke, we blow it, make him choke it\nWe gon' murder him\nBitch, we bangin' 4K Trey\nA nigga play, we shoot another film"}], "artist": "YoungBoy Never Broke Again"}