{"artist": "​​wifisfuneral", "songs": [{"year": "2012-04-29", "lyrics": "[Intro]\nBut uh, yeah, man, I mean\nBasically, I'm just, tired of all this shit and what-not\nI’m 'bout to give you shit from my perspective\nShit how I feel through a, the daily basis\nAnd um, shit I wouldn't want up changing, in general\nShit that I feel people should know\nI mean, I ain’t get this microphone for no reason, my nigga\nYou know\nI'ma just explain to you some shit, whatever (I mean)\nIf you feel like you in the sideline then, this song's for you, basically\nHa, and shit, but uh, hear me out\n\n[Verse 1]\nHuh, fuck it\nMy flow is lyrically homicide, to get the case\nA smile on my face as I get to the nine to five\nI get this rap shit on my life\nFuck yo' favorite rapper\nGive me the mic' and dim the lights\nI'll explain my story, show my rise to glory\nShit, I'm still on that road\nJust to let you know, I tried to blow like Hiroshima\nGet it cleaner up on my screen-er\nWalkin' like a mobster, eatin’ lobsters\nQuite a shock to the fantasy\nI show no love to reality as I gradually\nGrab the Presidents from the resurrection\nCame up wit’ two suggestions\nIt's do whatever to make the cheddar\nFor the worse or for the better\nAs I long as I don’t sell my soul\nI'll try to make this cash forever\nHowever, niggas try to break yo' fall\nI mean, yeah, you got rhymes\nBut trust me, that ain't it at all\nThey try to crack yo’ jaw wit' that [?]-it shit\nWhat is this serious lyrical business they witness?\nSo, they tend not to sleep\nDo whatever to get you bread and make yourself eat\n\n[Break 1]\nLook, I said um\nI said it like this\nHa!\n\n[Chorus]\nSee, I'ma put myself on the map\nGone and I ain't lookin' back\nSee a lil' nigga put the bank on me\nCause I could bet you anytime, it won't be free\nSee, these niggas really wanna sleep on me\nOh, Lord\nI wonder why I would't be so sure\nBut, I wish somebody had a guideline\nOn how to get up out the sideline\n(Side-line, sideline, yeah\nI said, ha, sideline\nWhere ever we go, sideline\nYeah, sideline nigga)\n\n[Verse 2]\nLook, throughout the pain\nSufferin' and the rain\nI stayed the same learnin' the game of life\nOnly you can get cut off at any given sight\nMaybe, I might become so tight wit' the mic'\nKickin' knowledge, while bumpin' The Chronic\nI find it ironic\nOn how the theories of the world get through people\nKnowin' they put fear in yo' heart just to make you evil\nPlease don't fall for the traps\nPerhaps we can look at it from a slower perspective\nAnd when it gets hectic, look for yo' savior\nAnd no one's prayed for the wicked\nI get lifted, I feel like I have the courage yet\nThey consider me gifted\nI try to reach in yo' heart to spark a rage\nBut in a good way, we need change\nShit ain't the same\nWhy don't people care at all?\nThe Government is fuckin' us up\nWhile in the court they ball\nKilluminati rollin' through yo' body like a 12 gauge shotty\nOh, I see, I respect none of these fake niggas\nWho would figure yo' idol won't admit that you're in danger?\nThem riches turn bitches inside strangers\nHa, how can I live now?\nWhen I never cried later\nI say fuck the others who gon' become haters\n15 year-old rebel, I write 'til I die, wit' my pride in my hand\nUnderstand as a man, I tried to do the best as I can\nBut only you can control yourself\nSo what will it be?\nAre you down for life, or just for fake wealth?\nPain equals passion, passion equals pain\nYeah, I tried to lend an open hand but niggas don't act the same\n\n[Break 2]\nAnd, yeah, but, alright\nLook, I said um\nHa, look\n\n[Verse 3]\nYou would figure life can never get any better\nFor standin' under the bad weather, wit' a sad song\nYou actin' wrong 'bout all the bullshit they say\nMan, I'm tryin' to negotiate wit' deaths on my casket\nThat shit can get put on delay\nNever gave a fuck about a bitch, but I sure love a ho\nBust a nut and then she goes\nPass the cup and now we movin' slow\nWalkin' high up on my toes\nLivin' life carefree, shit, nigga, I don't know\nI express my emotions through the drugs\nAnd fuck for the love of the sweet sex\nNever being cautious, so I never use a Latex\nBut in any words, I touch myself to old V.H.S. porn\nBrainstorm about the future, fuck the past\nRoll the blunt and get the grass\nSee my eyes go to white and to an instant red flash\nWhat the fuck I got to live for?\nThis song is for all the girls who's been called a whore\nA song for all the niggas who didn't have the balls\nTo talk to that fine bitch next door\nI always wanted to be that popular kid\nInstead, I'm that kid wonderin' where my real Pops is\nIt's like the older I get, the more I regret\nPuttin' my feelin's into women\nI should've thought about all the pussies that I could be swimmin' in\nSee, sex isn't good until you're high as fuck\nSloppy drunk up on the pavement\nScreamin', \"What the? Fuck it!\"\nWhen I talk about my Step-Dad\nI swear to God, I understand my Mom's pain\n'Cause bitches play the same game\nYou can't forget about the popular kids\nThe ones wit' the Cement 3's\nNike S.B.'s, Gucci backpacks, Louis, Versace\nAlways the type of person to wish that I was exactly like them\nToo bad, when they heard my name\nThey said \"What the fuck? I don't like him.\"\nFor only if they knew the real me\nSee, being our normal to the world isn't cool\nAnd they wonder why I say, \"Fuck school! That shit's a hell-hole.\"\nWant to put me back on my ex, \"Oh, hell no!\"\nI feel like I'm in hell though\nSee, everyone knows Isaiah\nBut they don't know Izzy wit' his evil thoughts and his smart remarks\n\n[Outro]\nYeah", "image": "https://images.genius.com/1d3f2097300f9e49a75c5b9f7b115475.500x500x1.jpg", "album": null, "title": "Sideline Story"}]}