{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/86239d3de00e4660583da44a02ffa821.820x546x1.jpg", "title": "Martin Luther King Jr The Revolutionary", "year": "2015-01-19", "album": null, "lyrics": "Martin Luther King, Jr. was a Revolutionary, simple and plain. He did not get to live a regular life and have an 86th Bornday. He died a murder victim because he had the audacity to challenge a war machine bent on keeping people impoverished and men and woman dying for an illegal war. Martin was more than a speech-giving, marching, de-segregationist. He was a human being that dared to call out the hypocrisy of asking young people to refrain from violent protest on the one hand, while on the other allowing them to be cogs in a war machine that was making Vietnam a hell on earth for natives of that country and American soldiers alike.\n\nMartin was a young father who at the threat of death dared to push forward on behalf of all humanity against the global reign of America and her allies’ evil, perpetrated through war. He was a man of conscience who valued the life of all humans. He believed the philosophy of Jesus in a deeper way than just anti-homosexual rhetoric and conservative right-wing dogma. He was disgusted with the government and its use of power to oppress in the same way Christ had been. He defended the principle of all humanity having value and being equal–like his savior. He was not a flower-giving, other-cheek-turning sucker. He was a fiery preacher, returning from the mountaintop with a message that would turn the world as people knew it on its ear. Like his messiah Jesus Christ, he was a revolutionary.\n\nHe proposed that the poor have value. He was against all war. He saw the value in all humanity. He plotted, planned, organized, strategized and mobilized for a movement that was bigger than simply ensuring blacks had rights. Martin died with his “dream” unfinished. His dream was to expose the link between poverty, pain, prison and global war. He saw U.S. foreign policy as one arm of global oppression that needed to be called out. He saw the acceptance of poverty as simply a part of other lives as a sin. A sin that he was called to rally against–as well as the corporations that helped keep that condition in place.\n\nSo on the celebration of what would have marked MLK Jr’s 86th year on earth I ask: What do we do next? What do we do besides: take a day, party and watch a march on TV? Will you continue where Martin left off? Will you join other protestors in the streets to end police policy that targets and kills blacks and darker people globally? Will you fight to make sure Africa controls her own fate–both as a continent and as separate states? Will you call out your current “black” POTUS for continuing to land U.S. troops on foreign soil and engaging in more illegal wars? Will you take to the streets and feed the hungry, defend the poor and march on public buildings calling out the incompetent men and woman we call leaders? See, those things are the way to honor a revolutionary. The question is: are you, like MLK was, a revolutionary?\n\nBe more than an American that simply enjoys the fruits of his labor by taking a day off. Be a keeper of his challenge to government. Be a source of agitation to policy-makers. Be an ally to those young people in the streets, fighting against corrupt police departments. Be a friend to the poor and to prisoners. Be more like Martin, Malcolm, Che, Hampton, Assata. Be willing to fight–with your life if need be–for the freedom, justice and liberation of all against tyranny and the war machine that these countries and corporations force upon us and call ‘normal’. We don’t need more depictions of Martin as anything other than what he was–and what we have to become to ever realize his dream of the eradication poverty, miseducation, inequality and war. We have to be revolutionaries and nothing less."}]}