{"songs": [{"image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg", "lyrics": "Hey!\nAy-yo, sup? What's good, brah?\nThis man's kinda high over here\n(Laugh)\n\nAy-yo the flyest motherfucker in the room yeah you know it's me\nBitches hatin on him cause he started out here locally\nHopefully, I'll be at the top soon for now I'm at my house on the couch watchin' cartoon\nYou know how much you love it when you get it in abundance\nGive a fuck about a budget when you always be the subject of discussion\nBut it's nothin' when you stop and just say fuck it cause you walkin' out in public, and you hear em talkin rubbish\nI just wanna ride. Ride through the city in a cutlass\nFind a big butt bitch somewhere get my nuts kissed that's the way it goes when you party just like I do\nBitches on my dick that used to brush me off in high school\n\nTake over the world when I'm on my Donald Trump shit\nLook at all this money, ain't that some shit?\n\nTake over the world when I'm on my Donald Trump shit\nLook at all this money, ain't that some shit?\n\nWe gon take over the world while these haters gettin' mad\nThat's why all my bitches bad they see this crazy life I have\nAnd they in awe we gon win you can take the lose or draw\nWhat I'm in got these hoes who used to play me and they broads\nWe gon take over the world while these haters gettin' mad\nTake over the world watch these haters get mad\nThat's why all my bitches bad they see this crazy life I have hop into the car\nAnd then we take em to the pad, it's a wrap\n\nAnd motherfuckers think they know me but they never met the kid\nStyle come with excellence and money made benevolence irrelevant for the fuckers who never been intelligent\nI kill my henny break the bottle for the hell of it\nTell a bitch that she better bring a friend\nAnd if she want an autograph she better bring a pen\nYeah, the party'll never end\nThis life is what I recommend\nAnd if you got a hoe to pull me then she better be a 10\nI ain't picky but these girls be actin' tricky when the situations sticky and the liquor got'em silly\n\nBut I take over the world when I'm on my Donald Trump shit\nLook at all this money, ain't that some shit?\n\nWe gon take over the world while these haters gettin' mad\nThat's why all my bitches bad they see this crazy life I have\nAnd they in awe we gon win you can take the lose or draw\nWhat I'm in got these hoes who used to play me and they broads\nWe gon take over the world while these haters gettin' mad\nTake over the world watch these haters get mad\nThat's why all my bitches bad they see this crazy life I have hop into the car\nAnd then we take em to the pad, it's a wrap", "year": null, "album": null, "title": "Donald Trump (Clean)"}], "artist": "Mac Miller"}