{"songs": [{"year": "2009-09-15", "image": "https://images.genius.com/6e143a0c0900b5cfb7087ecf770f4331.500x500x1.jpg", "title": "Intro (Words From Big Pun) (Spoken Word)", "album": "The Legacy: The Best of Big Pun", "lyrics": "[Verse: Big Pun]\nDon't try to play me cause I'm not a player\nAyo I shot the place up and pass the heat off like a hot potata\nI'm bout to make a million dollies, but still I'm rowdy\nSo I [?] before I have to kill somebody\nThat's how it is in the stone jungle\nIf you known to own a bundle, guaranteed nigga gonna mug you\nAnd no one love you when you broke and shit, focus kid\nCommercials don't lie, thirsty to die\n[?]\n(sniffles twice)\nBlow ya life away, that's a big price to pay\n(crew laughing and clapping)\nThey're here to teach this kid how to ride his bike\nAre they stupid?\n\n[Male News Reporter 1]\nA new rapper by the name of Big Punisher recently signed to Loud Records, records his debut album this year\n\n[Female News Reporter 1]\nRapper Big Punisher informed us of what we can expect to be his album, and gave us a definition of his own early age, and forming his own crew Full-A-Clips. He was able to get noticed from his newly found partner in crime, Fat Joe\n\n[Male News Reporter 2]\nPun celebrated the release of his highly anticipated album last week, remaining in the top 20 of the Billboard charts for two exciting weeks\n\n[Male New Reporter 1]\n...becoming the first Latin rap solo artist to sell a million records...\n\n[Male News Reporter 2]\n...the rapper said he owes it all to the Bronx... performed at the opening of the Oscar De La Hoya-Felix Trinidad fight\n\n[Female News Reporter 2]\n...and Hip-Hop's heavyweight received a nomination\n\n[Female News Reporter 3]\n...explained in a recent interview his passion for the art of Hip-Hop\n\n[Female News Reporter 3]\nLatin artist Big Pun... weight loss camp at Duke University earlier this week... is currently working on a sophomore album\n\n[Male News Reporter 3]\nChristopher Rios, also known as Big Pun, was pronounced dead at 3:53 pm on Monday\n\n[Big Pun]\nThat's the way the ball bounces, ya know what I mean?\nYa know, but we'll have our day, ya know\nAnd we, we'll keep it going for now"}], "artist": "Big Pun"}