{"songs": [{"album": "Blacklight", "image": "https://images.genius.com/7024230a664e26c9a3b0c4fc89609ef5.1000x1000x1.jpg", "year": "2011-05-30", "title": "Get Up", "lyrics": "[Verse 1: Tedashii]\nHomeboy!\nWhen I walk, when I talk man it's more than just a show\nThis is life, reaf life, I'm not Truman that's fo' sho'\n[?] loco at home, long distance, on the road\nOverseas, around the globe, yep, that's just how it go\nOh! I keep runnin' but my legs feel weak\nFeel like I'm gon' slip, this a trip; leg sweep\nBut give up, I don't know the phrase, get up like the Sonn was raised\nThat's just what I do since He got up from the grave\nGoin' smart, arithmatic, do the math, watch it add up\nMe and Him, that's a deal I couldn't pass up\nAy when I'm weak, He strong, ay when He right, I'm wrong\nIn Him I am too, man I knew that all along\nSo trust in Him, man His strength can go long\nThis call is too expensive, E.T. phone home\nBut He paid the bill, and put me on His plan\nNow when I fall, when I ball, I get up by His hand\n\n[Hook: Tedashii]\nWhen we fall, GET UP!\n'Cause this ain't all, GET UP!\nIt might be hard, but I gotta stand tall, GET UP!\nStay on the grind, GET UP!\nAy all the time, GET UP!\nDon't let it duke it'll pull ya to the ground, GET UP!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\n\n[Verse 2: S.O.]\nTedashii, what up? Leggo!\nI tell 'em get up, don't snooze or sleep\nLet up, why? Better strive\nHead to the road that's narrow so you can see what I seen with better eyes\n[?] your shadow feelin' your pain in a way that'll never die\nChrist is [?] is easy as is televised\nNo, be strong in the grace that is found solely in He\nMan, that spirit rose from the grave, it's safe to say\nHe lives in me\nAnd you, indeed, stand with a truth [?]\nKnow that feelings could be lyin, so it's the Lion who\n[?]\nI said it's struggle gives grace, it's perseverence of the saints\nIt's only 'cause He holds [?] by His rope of love, but wait\nThere's more, in store, sanctification's taking place\n[?] and you won't be in a perfect state 'til He returns\nTil then we keep yearnin, learnin, discernin with\nSermons servin the powerful in the world [?] the person, we will do it\nOur faith will not be ruined\nAnd not in any case it's by His grace that we pursue Him\n\n[Hook: Tedashii]\nWhen we fall, GET UP!\n'Cause this ain't all, GET UP!\nIt might be hard, but I gotta stand tall, GET UP!\nStay on the grind, GET UP!\nAy all the time, GET UP!\nDon't let it duke it'll pull ya to the ground, GET UP!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\n\n[Verse 3: Tedashii]\nOooahhh\nSo don't get lazy on my baby, uh uh, gotta keep it movin'\nTrain your body that's the aim like a 12 guage shotty\nStay focused, life is crazy, hold your ground, call it rudy\nThis is not a game, but you feel like you keep losing\nAnd it's real man, but still it's so hard to understand\nBut we never practice Godliness, we get it where we can\nThat's weak, yeah that's weak and that's just how it's gon' be\nYou can train physically and still never have strength\nAy, hangin' by a thread, feelin weary and unstable\nLook to Him who is strong, Kirk Franklin, He is able\nHe is God, we are not, we lazy and lack in faith\nBut you can persevere through it all; Imogo Dei\n\n[Hook: Tedashii]\nWhen we fall, GET UP!\n'Cause this ain't all, GET UP!\nIt might be hard, but I gotta stand tall, GET UP!\nStay on the grind, GET UP!\nAy all the time, GET UP!\nDon't let it duke ya, it'll pull ya to the ground, GET UP!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nKnock him dowm, get him up!\nOhhhh! GET UP!\nOhhhh! GET UP!\nOhhhh! GET UP!\nOhhhh! GET UP!\nOhhhh! GET UP!\nOhhhh! GET UP!"}], "artist": "Tedashii"}