{"artist": "Ace Hood", "songs": [{"title": "Mood", "album": "Starvation 4  ", "year": "2015-10-27", "lyrics": "[Intro]\nHaha, shit\nCause I'm in the mood baby\nI'm in the mood nigga\nDon't give me a reason\nDon't give me a reason\nShit\n\n[Hook]\nI'm in the mood to count up the loot, blessin's\nJump out the coupe, where fuck is the roof? Flexin'\nI'm with the crew, you ain't makin' moves then exit\nI'm in the mood to call up your boo to sext\nOoh, ause I'm in the mood\nOoh, cause I'm in the mood\nOoh, cause I'm in the mood\nOoh, cause I'm in the mood\n\n[Verse 1]\nBrought a car with a horse, got a young nigga whippin'\nI just pull up at the light, shittin' on your Honda Civic\nI got racks in my pocket, dead fresh catch a body\nThat potato on a shotty, count that money for a hobby\nI just pull up to the villa, big shit, Godzilla\nYoung nigga, chinchilla, all ice like it’s winter\nHit the mall, blow a check\nOn the gram, gotta flex\nAin't no love for my ex, oh lord boy you blessed\nSee I'm in the mood to fuck up your mood, I'm covered in jewels\nI just brought a crib with too many rooms, it came with a pool\nI know what you're thinking, got rid of my neighbors, had too many rules\nDon't get it confused, don't get it confused, we never gon' lose\nI'm gonna get everything a nigga prayed for\nFuck me and call me daddy ain't that what you came for?\nI'm in the mood, I'm like fuck it, put twenty chains on\nGo hit the club, pour the bottles to see the light show\n\n[Hook]\nI'm in the mood to count up the loot, blessin's\nJump out the coupe, the fuck is the roof? Flexin'\nI'm with the crew, you ain't makin' moves than exit\nI'm in the mood to call up your boo to sext\nOoh, cause I'm in the mood\nOoh, cause I'm in the mood\nOoh, cause I'm in the mood\nOoh, cause I'm in the mood\n\n[Verse 2]\nMiddle finger in the air, that's my motherfuckin' mood\nTwenty-twenty with the vision, I got panoramic views\nIn my cup, got the screw\nPhantom ghost, peek-a-boo\nNigga sleep, let 'em snooze\nAce Hood got the juice\nI'm the motherfuckin; man, twenty bands for a [?]\nI just brought a foreign, pay for it like a boss do\nNigga in the mood, keep it cool, goons crazy\nWalk in the club with them Haitians\nThe fragrance amazing\nI just might cop me a crib and only live in that bitch\nI might just cop me a whip and only drive that new shit\nI might just charge every hoe that I encounter for dick\nThen pull up on my old teacher who said I won't be shit, bitch\n\n[Hook]\nI'm in the mood to count up the loot, blessings\nJump out the coupe, the fuck is the roof? Flexing\nI'm with the crew, you ain't making moves than exit\nI'm in the mood to call up your boo to sex it\nOoh, cause I'm in the mood\nOoh, cause I'm in the mood\nOoh, cause I'm in the mood\nOoh, cause I'm in the mood\n\n[Hook]\nI'm in the mood to count up the loot, blessin's\nJump out the coupe, the fuck is the roof? Flexin'\nI'm with the crew, you ain't makin' moves than exit\nI'm in the mood to call up your boo to sext\n\n[Outro]\nCause I'm in the mood baby\nI'm in the mood nigga\nDon't give me a reason\nDon't give me a reason\nShit", "image": "https://images.rapgenius.com/61a6d2f06e25b6b84728e70788199ad5.500x500x1.jpg"}]}