{"songs": [{"image": "https://images.genius.com/b6b1954249340a8a91aa3595088a3bab.500x500x1.jpg", "title": "Aint No Black Superman", "album": "Bullets Ain’t Got No Names Vol. 1", "year": "2008-09-26", "lyrics": "[Intro: Smoke]\nThe Empire\nHa-ha, yeah man, it's that G.E.D shit, you feel me?\nAnd I am the one and only el natural nino\nHittin' every dollar I holla, ha, let's go\n\n[Verse 1: Smoke &  Nipsey Hussle ]\nYo, it's that H-borough, too thorough\nA block away from Melrose, the nigga's gettin' stuck like velcro\nThe prostitutes ain't the only ones that sell blow\nHell no, cellphone pictures with the jail pose (Haha)\nI can tell yo, why these ladies love me now\nRun me down, give her to my dogs like puppy-town\nYou couldn't touch my style, not on your best day\nComprende? Your men lay when the M10 spray\nFuck what them say, I'm tight quarterbackin' it\nWhen I'm throwin' bullets I be accurate\nWeekends on the bully, they be jackin' shit\nThat's why I be packin' shit\nThe only time you shoot is at a hoop when you practicin'\nRunnin' drills, I dream to see a hundred mils\nStuntin' ill 'til my pockets heavier than Uncle Phil\nTell your son to chill, he ain't want to deal\nTry it fam, I'm Iron Man 'cause I come wit' steel\nI wish a sucka will, my dudes thugs for real\nHe probably think I'm George Foreman how I punch his grill\nWhat's the deal yo? Talkin' what I'm livin' now\nWanna fuck the pictures I be diggin' out? (Huh?)\n\n[Interlude 1: Nipsey Hussle]\nAy, niggas already know\nLabels wanna fuck with these motherfuckers\nG.E.D nigga, Gettin' Every Dollar, nigga, you understand?\nNiggas got a bad tendency to hate on a young nigga out here gettin' it, you feel me?\nI just tell 'em, look man, don't be mad at me homie\nThis shit ain't my fault I went hard at a young age, nigga\nI stood on this block while you niggas was evading cops\nNew [?], nigga, Slauson boy, [?], Hussle\n\n[Bridge]\nYo, this Hutch, I ain't in right now but please– uh you know, I'm out, flossin', tossin', dippin', and trippin', you know what I'm sayin'?\nAy, Hutch man, they cleaned your momma house man\nI don't know what they got–I'm broke man, and they lookin' for us man, call me over at [?] house\n\n[Verse 2: Nipsey Hussle]\nMan check this out homie\nLook, it's 10 stacks on my neck and 20 more on my brodie's shit\nI'm self-made, ain't no nigga ever throw me shit\nOutside my enemies, I'm watchin' who I'm rollin' with\nThat .40 on me like a fucking Motorola clip\nShit, I feel like a million when I'm full willin'\nAt 7:45 parked in front of your buildin'\nDesigner jeans, Gucci loaf, wear my gold, kill it\nI got a kilo on my neck, I'ma go get it\nSee what you lookin' at now that's my old vision (Look)\nChess moves, my next move to get more business (Look)\nI promise I be on my tips 'til my toes give in\nI'ma always shine, I'll never let my glow blemish\nI hear you talkin' but fuck what you niggas say\n'Cause real niggas know a real nigga demonstrate\nAnd real niggas know it's real 'cause I illustrate\nThat feelin' of a young hood nigga when he gettin' cake\nGlocks and gauges puttin' faces on the newspaper\nI can't get caught for old crimes and catch new cases\nBlocks invaders spite rage just if you've made it\nHomies in the hole [?] wit' no shoe laces\nBack on the streets I'm rollin' weed and see through paper\nDippin' down the shore, S-types with the blue paint\nPoppin' tops off bottles with the gold label\nIt's pretty good to say I dropped out the tenth grade\nI'm better than ever, this rap shit is nathin'\nThis for my niggas in the county on the Mainline\n\n[Interlude 2: ?]\nAy this dedicated to my nigga, J-Stone, you know what I'm sayin'?\nDo your time nigga, don't let your time do you, you already know\nKeep it all the way though, you know what I'm sayin'?\nMy niggas Shade and Blue, what's up cuh?\nI'm out here in New York, turned up nigga, smokin' on this kush\nFuckin' wit' my Harlem niggas, my Brooklyn niggas, my Uptown niggas, ay Smoke, a lot of these niggas, man\n\n[Verse 3: Smoke DZA]\nWe break bread like it's Hanukkah, G.E.D's my moniker\nEvery day I be scoured up, shit, my dollars up\nMy God, in the hood, nigga I'm okay\nSteal my shit I'm comin' at you like O.J\nAnd broad day them niggas comin' with them fists\nDressed in all black hittin' it for the genesis\nBringin' extra clips, finna catch a lick\nHit the connect spot, left me like half a brick\nNiggas act as if my guys ain't hard\nHomie we ain't petty, we don't steal, we rob\nNiggas hit the ER when we pull like [?]\nFirst, they hear the click-clack then they get the shit bad\nTakin' jewels and be flossin' wit' it\n9/11 kid, we run our own abortion clinic, huh\nGot a .40 on my 40 waistline\nAny nigga try and take mine gon' take nine, nigga\n\n[Outro: Nipsey Hussle]\nAy, I'ma come through with the whole clique though\nYou might catch more than just nine nigga\nNah, niggas bustin' choppers at you nigga\nYou do the math homie, that's damn near a thousand shells cuh\nYou know what I'm sayin'?\nAnd you know, I'm from the [?] murder capital nigga\nSouth Central Los Angeles nigga, ain't no black Superman\nWe don't wear capes nigga, we chop eights\nYeah, I mean, we hop gates and run from them Johnny's nigga\nNeighborhood shit nigga, we set Crips\nNigga this hood ain't no Crip or Blood shit\nNigga this Crip on Crip, Blood on Blood, real on fake"}], "artist": "Nipsey Hussle"}