{"artist": "Big Daddy Kane", "songs": [{"lyrics": "Yo, on the M-I-C right about now, I go by the name of Big Daddy Kane. I got my man Scoob Lover on the side of me, DJ Mister Cee on the wheels of steel, Dre on\nThe film and Marley on the boards. We gonna do a little something like this:\n\n[Big Daddy Kane, Scoob Lover & both]\nSome like it hard and some like it soft\nYo, bust the groove as I set it off\nBut wait a minute...\nYo Scoob, what's up?\nPardon me a moment as I interrupt\nFor what?\nFor this:\n\nYou like the stylish clothes we wear\nAnd you like our flat-top style of hair\nIt's just those bugged out things we do\nThat make the girlies wanna stare\n\nLike when we're chillin' with the crew\nOr drinkin' that Old English brew\nStraight from the bottle not the cup\nAnd it gets us more than just fucked uuuuup...\nAnd I like it yall..\n..like it yall...\nLike it yall...\n...like it yall\nScoob Lover, won't you hype it yall?\nWell, I'm the S-C double-O B-L-O-V-E-R- uh\nLadies come to me, I'll be your midnight horror\nNeed a flat top? Come to Scoob, I'm the barber\nOf Da Ville\nAnd that's right\nTry to step to us, watch what you get\nCuz me and Big Daddy's not havin' it\nWell, it's the Big Daddy, so all hail\nSave your wack rhymes, hold your female\nPass the Old Gold, trash the ale\nCash your food stamps, get the WIC out the mail\nLove to eat shrimps, but I never eat snail\nEat a whole fish except for the tail\nKeep food in the fridge so it don't get stale\nAnd when there's nothing to eat, I bite my nails\nSo Scoob Lover, you know your rhymes are kickin'\nGet on the mic, cuz you know you eat chicken\nNow-now-now, I'm-a place a order for a Scooby snack\nNot at the Chinese restaurant because I don't eat cats\nNow who in the world can ever eat these?\nWhen I'm at home, I chow down with ease\nAnd say \"More beef sausage, mom, please?\"\nThat's right, Mommy Dukes, she feeds me swell\nCoffee on the table, orange juice as well\nSome of the things I say are outspoken\nGuaranteed to have you chokin'\nBitin' MCs are the one I'm yokin'\nKane, I'm outta here, I guess I'll use my token\nI'll walk through the gate if the turnstile's broken\nBig Daddy, if you're down with me\nGet on the mic on the count of three;\nOne, two, three...\nNow I'm a black brother that's out to succeed\nSo step aside as I take the lead\nSexy young ladies of a light-skinned breed\n\"You got-you got-you got what I need!\"\nOutstanding, kind, cool and loyal\nDrove all the way to Maaco just to change my oil\nCuz I'm the only child, you might think I'm spoiled\nTouch the young ladies make their blood pressure boil\nI got the ...hmm...hiccups, excuse me, sorry\nScore a 100 Gs every time I play Atari\nPut a hole in the Old Gold, blast the Bacardi\nOn the dance floor, hype moves I be freakin'\nMakin' new steps up every single weekend\nNot Abbot and Costello or Laurel and Hardy\nI'm only here to PAR-TY!\n\nYo, check it out, check it out. Turn the music down, turn the music down\nTurn the music down...here we go, here we go...\n\nWe gonna end it like this in the place yall\nIt's like this yall, and you don't stop\nNow, the name Kane is superior to many people;\nIt means King Asiatic Nobody's Equal\nI hate to brag, but damn I'm good!\nAnd if mics were a gun, I'd be Clint Eastwood\nAnd if rap was a game, I'd be MVP:\nMost Valuable Poet on the M-I-C\nAnd if rap was a school, I'd be the principal\nAw fuck it, the Kane is invincible\nTo be specific, I may die one day\nBut my rhymes will remain like a hieroglyphic\nIt's a certain special skill, that takes much practice\nI got it good; apparently you lack this\nSo in turn, sit back and learn\nListen close, this is for your own concern\nLet me show ya, exactly how it's properly done:\nLights, Camera, Action! [laughter]", "image": "https://images.genius.com/a3044a73939ccd541c13cf37d29d70bb.1000x1000x1.jpg", "year": "1988-06-28", "title": "On the Bugged Tip", "album": "Long Live the Kane"}]}