{"artist": "50 Cent", "songs": [{"album": "Get Rich or Die Tryin’", "image": "https://images.genius.com/1a10bcefe2e4c82bd02b506decf65f99.300x300x1.jpg", "title": "21 Questions", "lyrics": "[Produced by Dirty Swift]\n\n[Ad-Libs: 50 Cent]\nNew York City\nYou are now rockin'\nWith 50 Cent\nYou gotta love it\n\n[Intro: 50 Cent]\nI just want to chill and twist the lye\nCatch stunts in my 7-45\nYou drive me crazy, shorty, I\nNeed to see you and feel you next to me\nI provide everything you need, and I\nLike your smile, I don't want to see you cry\nGot some questions that I got to ask\nAnd I hope you can come up with the answers, babe\n\n[Chorus: Nate Dogg]\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\n\n[Verse 1: 50 Cent]\nIf I fell off tomorrow, would you still love me?\nIf I didn't smell so good, would you still hug me?\nIf I got locked up and sentenced to a quarter century\nCould I count on you to be there to support me mentally?\nIf I went back to a hooptie from a Benz\nWould you poof and disappear like some of my friends?\nIf I was hit and I was hurt, would you be by my side?\nIf it was time to put in work, would you be down to ride?\nI get out and peel a nigga cap, chill and drive\nI'm askin' questions to find out how you feel inside\nIf I ain't rap ‘cause I flip burgers at Burger King\nWould you be ashamed to tell your friends you're feelin' me?\nIn the bed, if I used my tongue, would you like that?\nIf I wrote you a love letter, would you write back?\nNow we can have a little drink, you know, a nightcap\nAnd we could go do what you like, I know you like that\n\n[Chorus: Nate Dogg]\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\n\n[Verse 2: 50 Cent]\nWould you leave me if your father found out I was thuggin'?\nDo you believe me when I tell you, you the one I'm lovin'?\nAre you mad ‘cause I'm askin' you 21 questions?\nAre you my soulmate? ‘Cause if so, girl, you a blessing\nDo you trust me enough to tell me your dreams?\nI'm starin' at you, tryna figure how you got in them jeans\nIf I was down, would you say things to make me smile?\nI'll treat you how you want to be treated, just teach me how\nIf I was with some other chick and someone happened to see\nAnd when you asked me about it I said it wasn't me\nWould you believe me? or up and leave me?\nHow deep is our bond if that's all it takes for you to be gone?\nWe only humans, girl, we make mistakes\nTo make it up, I'll do whatever it take\nI love you like a fat kid love cake\nYou know my style, I say anything to make you smile\n\n[Chorus: Nate Dogg]\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\nGirl, it's easy to love me now\nWould you love me if I was down and out?\nWould you still have love for me?\n\n[Outro: Nate Dogg]\nCould you love me in a Bentley?\nCould you love me on a bus?\nI'll ask 21 questions and they all about us\nCould you love me in a Bentley?\nCould you love me on a bus?\nI'll ask 21 questions and they all about us", "year": "2003-04-29"}]}