{"songs": [{"image": "https://images.genius.com/b494ca4151f14803123849b4f34be37f.700x700x1.jpg", "title": "America", "album": "Untitled", "year": "2008-07-15", "lyrics": "[Intro: Nas & (Flo Simpson)]\nYo, it's like waking up, from a bad dream (America)\nJust to figure out, you wasn't dreaming in the first place (no)\n\n[Verse 1: Nas]\nIf all I saw was gangsters coming up as a youngster\nPussy and money the only language I clung to\nClaim to, I mold myself up to become one\nAin't ya happy I chose rap? I'm a monster\nStreets deceiving, can't believe my achievements\nCultural strata, persona's that of a non-needer\nCause I don't need nada 'cept for Prada beaver\nFor cold winters, tattoos got my summer sleeveless\nTo my G's on the flee from the coppers\nStiff bodies on freeze in funeral parlors\nFrom the slums I come up, a phoenix caked up\nTrying to take what I'm eating came up\nA dismissive kid\nYou lucky if you allowed to witness this\nSavvy, mild, wild hardly\nA man's man, who would've knew the beach houses and wild parties\nJezebels and Stella McCartneys\nFor years, all that, how can I not be dead?\nThis old German said I was a thug with a knotty head\nLooked at my Benz and called that a Nazi sled\nWith a face like he wonder where I got my bread\nProbably all these stones he see, from my shows overseas\nFrom crime to rhyme\nMy story is I'm from the home of the thieves\n\n[Chorus: Nas, (Flo Simpson) & Both]\nAmerica (Americaaaaaa), pay attention\nWake up (Americaaaaaa), this is not what you think it is\nAmerica (Americaaaaaa), pay attention\nThis is not what you think it is\n\n[Verse 2: Nas]\nBlessed, the Lord is a G, he gotta be\nWho's the God of suckers and snitches? The economy\nLipstick from Marilyn Monroe blew a death kiss to Fidel Castro\nHe'd want me to spit this\nOnly the strong survive, Nas bear witness\nThe hypocrisy is all I can see\nWhite cop acquitted for murder, black cop, cop a plea\nThat type of shit make me stop and think\nWe in chronic need of a second look of the law books\nAnd the whole race dichotomy\nToo many rappers athletes and actors\nBut not enough niggas in NASA\nWho give you the latest dances, trends and fashion?\nBut when it comes to residuals, they look past us\nWoven into the fabric, they can't stand us\nEven in white tees, blue jeans and red bandanas\n\n[Chorus: Nas, (Flo Simpson) & Both]\nAmerica (Americaaaaaa), pay attention\nWake up (Americaaaaaa), this is not what you think it is\nAmerica (Americaaaaaa), pay attention\nThis is not what you think it is\nAmerica (America, Americaaaaaa\nThis is not what you think it is)\n\n[Verse 3: Nas]\nAssassinations, diplomatic relations\nKilled indigenous people built a new nation\nInvoluntary labor, took a knife split a woman naval\nTook her premature baby, let her man see you rape her\nIf I could travel to the 1700s\nI'd push a wheelbarrow full of dynamite through your covenant\nLove to sit on the Senate, and tell the whole government\nY'all don't treat women fair, she read about herself in the Bible\nBelieving she the reason sin is here\nYou played her, with an apron like, \"Bring me my dinner dear\"\nShe the 'nigga' here, ain't we in the free world?\nDeath penalty in Texas kill young boys and girls\nBarbarity, I'm in the double-R casually\nBugging how I made it out the hood, dazzle me\nHow far are we really from third world savagery?\nWhen the empire fall, imagine how crazy that'll be\n\n[Chorus: Nas & (Flo Simpson)]\nAmerica (Americaaaaaa, Americaaaaaa)\nAmerica (Americaaaaaa\nThis is not what you think it is)\nAmerica (Americaaaaaa, ohh\nThis is not what you think it is)\n\n[Outro: Nas]\nAmerica"}], "artist": "Nas"}