{"artist": "Ice-T", "songs": [{"title": "Hit the Fan", "lyrics": "[ Shawnie Shawn ]\nYo, what's goin on Ice?\n[ Ice-T ]\nYo what's up Shawnie Shawn?\nMan, just trippin off this girl, man\n[ Shawnie Shawn ]\nGirls?\nYou?\nThe Iceberg?\nAw man, come on, spill it, man\n\nShe was a swinger\nTalkin 'bout high post\nShe was the most\nKnew she was fine, dope, fly\nShe didn't have to try\nShe brought a eye on my eye in a crowded club\nI tried to stare the girl down, but she didn't budge\nShe moved through the crowd in a straight line\nThe closer she got, mad thoughts ran through my mind\nYo, what would I say, yo, how would I chill?\nMy mind drew a blank, the whole scene was ill\nShe stepped in the light, she was dynamite\nHer eyes said, \"I wanna be with you all night\nI wanna rub you down, I wanna kiss, caress your soul\nMake your body warm and cold\nDo everything sexually you ever heard\"\nAnd she hadn't said a single word..\nI said, \"Damn, what the hell am I gonna do?\"\nBut my eyes said the same things too\nI tried to speak, she put a finger across my lips\nFollowed it with a kiss\nShe said, \"I want you bad,\" and she moved in next to me\nThis woman spelled out ecstacy\nSaid, \"I've seen on the movies and TV\nI love your records, but I ain't no groupie\nJust wanna love ya, cause you're a real man\nAnd you deserve this lovin like only I can\"\nI wanted her bad, and I am a man\nThat night the shit hit the fan\n\n[ Shawnie Shawn ]\nDamn, man\nKeep on with it, man\nCome on now kick it, man\nYou gotta kick it right, though\nLet me know what's up\n\nShe had a 500 S-E-L airtight\nCellular phone, brand-new, it was white on white\nAs we walked to the car, I couldn't help but recognize\nHer small waist and sexy thighs\nShe had a beach house she owned and a restaurant\nTook me in her crib and put Sade on\nAs the waves hit the rocks in the moonlight\nShe came up behind me and squeezed me real tight\nMy mind started to trip, flip, roll, and roam\nWhat about my girl who's at sleep at home?\nBut before I could lock in on that thought\nShe broke out with a new men's watch that she had bought\nShe put it round my wrist, it was a perfect fit\nAnd said in my ear, \"Want you to have it\"\nThen she unzipped her dress, dropped it to the ground\nMy mind was totally blown by now\nShe gazed at me nude in the moonlight\nPumps still on, her body was firm and tight\nI looked at her breasts as they glistened and rised\nRight before my eyes\nAnd all I could say to myself was, \"Damn..\"\nThe night the shit hit the fan\n\n[ Shawnie Shawn ]\nMan, man, man\nI understand...\n(The night the shit hit the fan)\nCome on now\nI feel it\nCome on\n(The night the shit hit the fan)\nDamn, man\nIt's all that\nShit\nCome on, Ice\nKick that shit\n\nNow I'm a player, I been all around the world\nMade love to many girls\nBut tonight this was the big league\nAnd I was worryin about fatigue\nI wanna do this girl, so she won't forget me\nAnd I knew that she'd let me\nShe moved close and took my shirt off\nShe said my skin was soft\nThen slipped her hand\nBetween my stomach and my waist band\nMan, I couldn't take it no more\nFuck the bedroom, we use the kitchen floor\nWe hit skins all weekend\nWe didn't even eat, we just hit em again\nI love to think about how it went down\nBut she's no longer around\nLeft town with some fly guy\nShe's on some island drinkin D'Acqueray's and Mai Thai's\nBut she gave me the keys to the beach house\nShe knows what I'm about, at least now she figured out\nI ain't nothin but a straight up man\nAnd I might need those keys the next time the shit hits the fan\n\nYeah\n\nUh!\n\nYeah\n\nUh..\n\nYeah\n\nUh\n\nI want her\n\n[ Shawnie Shawn ]\nDamn\nAll that, all that\nAnd after all that\nYou know?\nYou always know, man\nIn the long run\nYou meet another one like the other one", "image": "https://images.genius.com/e31ea71297e7a9f7b5274df3c469e7d9.1000x1000x1.jpg", "album": "Home Invasion", "year": "1993-03-23"}]}