{"artist": "Yung Ro", "songs": [{"album": "Welcome to Nobody Land", "image": "https://images.genius.com/a3621ce8171d94bca6d1e12de28ce669.389x389x1.jpg", "year": null, "lyrics": "The Bible say we all equal, we the same in the end\nSo when you fuckin with Yung Ro, then Nobody gone win\nSo here I am, full of pain, with a mic in my hand\nI sacrafice the truth to let you know Nobody'll understand\nAnd if I'm judged as a man, for this Nobody life style\nI hope they don't forget to mention, all the laughs and smiles\nBut don't cry for Yung Ro, Cause I'm on anothe roll\nWhere it started, where it ends, my nigga Nobody knows\nI'm destined to shine, punk nigga, don't fool yourself\nAnd if you get hot from the truth you betta cool yourself\nCause I'ma young master mind, how the fuck you figure?\nBitch I'll fuck you up in public and laugh at you foolish niggas\nTake heed to what I'm sayin, only them covers cartoons\nSee most rappers - got war stories, Yung Ro got war wounds\nAnd I ain't even - TRYIN to plex\nI'm only - TRYIN to stress\nBut you betta - REMIND yourself\nNigga that - I'M the best\nAnd you just might - FIND yourself\nLookin for some - KIND of help\nThat your nigga done got pissed\nNow bullets - FLYING through your chest\nGOT EM!\nYung Ro an ignorant fed muthafucker\nBut the way I spit it, you can't touch it\nOnly due to my structure\nAnd I was told on this road, they wanna go and kill me\nI'm like the wind, you can't see me\nBut when I flow, you feel me\nCan you hear me?\nNigga this goes on, like I said too much\nAnd if you fuck with Nobody, Nobody will fuck ya up\nIt's Color Change, Paid In Full, Nigga let it be known\nAnd if you fuck with Nobody, Nobody will fuck ya up\nIt's Color Change, Paid In Full, Nigga let it be known\nAnd if you fuck with Nobody, Nobody will fuck ya up\nIt's Color Change, Paid In Full, Nigga let it be known\nAnd I'ma ride for my niggas, until the day that I'm gone\nMy nuts - are way bigger, my team - is way stronger\nMy boss money's on my mind right, nigga I'm on ya\nAnd if you consider competition, you betta get on your shit\nCause soon as they give me a chance, I'ma run this bitch\nNobooooooody - Grab your heat and put your gun up\nPut some pistols on they ass and make 'em walk like Ronald\n[Laughs] And I don't do gangsta rap\nI spit raw Nobody shit, now how gangsta is that?\nI'm a man, and I ain't never had my nuts taken from me\nAnd I'm no where to be found, if you bitches lookin for me\nI be anxious aiming lookin through my peep hole dumpin\nPunk bitch, I see shit, just like Neo comin\nPlus protected by God's sheild, and I'm driven by God's will\nAnd I know that God's real, but it's so hard to chill\nWhen snake niggas get scared, they build they hate then they swarm\nI don't wanna use what God gave me, to inflict no harm\nNiggas what I bring will be pain, and way worse then a bullet\nAnd I've been itchin, anxious, so stressed, that I'm ready to pull it\nAnd you don't want them thangs burnin the blood in your artiries\nAll that bumpin don't bother me, You'll be in jail for robbery\nThis is what the streets made me, thinkin about God daily\nPlus the struggle made me stronger and at the same time crazy\nI'm havin bad dreams my nigga, and I don't understand them\nI wake up crying and confused and write a Nobody Anthem\nCan you fakers here me spittin, think this shit's so easy\nHow many ways can I say it's fucked up for someone to believe me\nI'm in need of a miricle, they feelin me lyrical\nScared of my physical, and so lost spiritual\nI can't explain what I know, how I know it and why\nI'm pretty sure it'll all make sense when I lay down and die\nBut for now, I'm gettin fucked up, runnin the streets with my killers\nI got -THUG LOVE- for my Nobody niggas!\nYEAH!", "title": "Punished for Hard Livin"}]}