{"songs": [{"image": "https://images.genius.com/b6b1954249340a8a91aa3595088a3bab.500x500x1.jpg", "title": "Hussla Hussla", "album": "Bullets Ain’t Got No Names Vol. 1", "year": "2008-09-26", "lyrics": "[Intro: Nipsey Hussle]\nYeah, it's one of them Slauson Boy hits\nY'all already know what this is, y'am'sayin'\nNeighborhood Nip Hussle, Hoodsta Rob in this muthafucka\nAy Rob, ay my nigga, I think they want somethin' to bang to\nI think they want somethin' to ride to, my nigga\nYou know, that get right music out there, it's only right, homie\nAy, you gon' go first or I'ma go first?\nAlright, holla at these niggas, yeah\n\n[Verse 1: H60dsta Rob]\nI'm a hustla, hustla, baby, what it do\nYeah, I always pop tags, yeah, I'm always brand new\nMaybachs that's burnt blue, honey water for shoes\nWomen holler for dude, they sayin' he's the most improved\nWhat, they mad, because he been in, musta thought I would lose\nThought the ho wouldn't choose my pimp, probably stayed on cruise\nNow what I'm lookin' like not ballin' here, plenty broads callin' here\nNiggas rentin' space for some months, they pay us all year\nLet's get this clear here: I don't fear nobody\nEspecially if he soundin' body -- better ask somebody\nSlauson Boyz, we run the party -- bottles here for everybody\nCrenshaw, Crenshaw, yeah yeah, homie\n\n[Chorus: Hoodsta Rob]\nI'm a hustla hustla — baby, what it do?\nI always pop tags, I'm always brand new\nI'm a hustla hustla — baby, what it do?\nI always pop tags, I'm always brand new\nI'm a hustla hustla — baby, what it do?\nI always pop tags, I'm always brand new\nI'm a hustla hustla — baby, what it do?\nSlauson Boy, Slauson Boy, Slauson Boy, yeah we do\n\n[Verse 2: Nipsey Hussle]\nI'm a hustla hustla, baby, what it do?\nKeep my neck and wrist shinin' and my diamonds see through\nIt ain't trickin' if you got it but that's not what we do\nFlip the game and get a dollar out a bitch just like you\nWanna sit inside coupes, wanna sip on my Veuv\nVIP, you starstruck, tryna get inside too\nOther niggas tried to, just to slip and slide through\nBut that feelin' you provide 'em have them tryin' to wife you\nI know you've been lied to but he don't wear my size shoe\nI'm a grinder, you's a dime, you need a boss beside you\nSeat back, kush smokin' every time I slide through\nAnd I always pop tags and I'm always brand new 'cause I'm a\n\n[Chorus: Hoodsta Rob]\nI'm a hustla hustla — baby, what it do?\nI always pop tags, I'm always brand new\nI'm a hustla hustla — baby, what it do?\nI always pop tags, I'm always brand new\nI'm a hustla hustla — baby, what it do?\nI always pop tags, I'm always brand new\nI'm a hustla hustla — baby, what it do?\nSlauson Boy, Slauson Boy, Slauson Boy, yeah we do\n\n[Verse 3]\n[H60dsta Rob]\nI'm a hustla hustla — this tuna wrapped in seaweed\nSolution: Newsboy cap, a white Tee and my Nikes\nI'm a hustla hustla — it's Patron mixed with orange\nYeah, kush blunts and Red Bull, stuff got me actin' brand new\n\n[Nipsey Hussle]\nI'm a hustla hustla — And my bitch is rockin' Dolce\nGrams to the gold chains and now my records rotate\nI'm a hustla hustla — It's fast money over slow cake\nBut don't do me no favors, I'm straight, nigga, no thanks\n\n[Chorus: Hoodsta Rob]\nI'm a hustla hustla — baby, what it do?\nI always pop tags, I'm always brand new\nI'm a hustla hustla — baby, what it do?\nI always pop tags, I'm always brand new\nI'm a hustla hustla — baby, what it do?\nI always pop tags, I'm always brand new\nI'm a hustla hustla — baby, what it do?\nSlauson Boy, Slauson Boy, Slauson Boy, yeah we do"}], "artist": "Nipsey Hussle"}