{"songs": [{"image": "https://images.genius.com/918b4db0bc6d6cd1a89e223b72d2d53b.1000x1000x1.jpg", "title": "Empowered", "album": "The Pre-Fix for Death", "year": "2004-09-21", "lyrics": "(Intro: \"Whip out the Metallica from my hip and blast some Megadeth at you!\" vocal scratches)\n\n(Verse 1: Necro)\n\nI wanna accomplish shit by giving, i'm taking, i'm tripping towards oblivion, raping, chop you 'til you the opposite of living!\nMy topics are sickening, chop your topper's tits 'til you a Necropolis victim!\nYou wanna rap? Don't. You would if you could but you can't so you won't! (Inaudible: You bent), you clone, i cut off your hand, leave Rap alone!\nI have a virtue be enabled to (inaudible: co-hoarse) you with a (inaudible) of a razor insert through your wrist vein, death is what you pursue!\nI ordinarily love bashing cats with bats, now you're buried in bugs, then attacked by rats\nDie for me, inquiry, of my skitzo diaries, undeniably, a path to a higher (inaudible: change)! Peep the psychiatry, flooded with termanology, vermon follow me, slice off your skin, practice dermatology!\nYou're over-sensitive, well i represent what offensive is, blending your appendages, giving purpose to the forensics bits!\n\n(Chorus: John Tardy):\n\nEmpowered! (Inaudible: Lights gone!)\nWillpower! Yeah, yeah, i am the living, the dead!\n\n(Verse 2: Necro):\n\nI got the answers for the unexplainable, but their unobtainable into your brain is pulled out of your cranial! Your hormones, must be fiending to see your own blood on your own clothes, i'm so cold, i'll put you in a chokehold!\nI'm all about the swords, you used to be sick, well now you're (inaudible), shout out to (inaudible: Lord), as the gunpowder is poured!\nFor every positive, is negative, it's relative, for every piece of cake you digest, there's someone that won't get to live!\nYour face is slashed like you crash in your car, and blast guts, through your flesh, when you smash into the window fast!\nOnce you sell out, you dead, you crucified to a billboard, number one with a bullet in your head!\nYou fucking trannies, you switched up like Marv Albert, you couldn't handle the pressure of the business and bitched up! I'll knock your fronts out, kid, i'll pull the guns out. I need some room to breathe, i'll cut your lungs out!\n\n(Chorus: John Tardy):\n\nEmpowered! (Inaudible: Lights gone!)\nWillpower! Yeah, yeah, i am the living, the dead!\n\n(Outro & guitar solo: \"Whip out the Metallica from my hip and blast some Megadeth at you!\" vocal scratches)"}], "artist": "Necro"}