{"artist": "Papoose", "songs": [{"album": null, "title": "First Chain (Remix)", "image": "https://images.rapgenius.com/3e315565328a656abe3968dac13ce39b.481x479x1.png", "lyrics": "[Intro]\nCome on now, y'all knew I was coming\nY'all just ain't know when\nThat was a cheap shot, now I gotta get you\n\n[Verse 1]\nBig Sean's album is trash, it sound wicked\nIn fights I be swinging like Will and Jada Pinkett\n\"Papoose, who?\" Boy, I'll give you faceshots\nI'll leave your eye puffy like the nigga who made Ma$e hot\nAll of your dogs is stray dogs, y'all get straight shots\nBastards, I spit acid they need Maalox\nKanye wore a skirt; what was he trying to prove?\nY'all be following them illuminati rules\nCarry yourself like a man, and you will fail\nPlay a bitch, you prevail\nThe only time they want the black man to show his strength\nIs during sports\nOutside of that they want us to be soft\nSo Big Sean speak like a woman when he talk\nWhen he having a seat he keep his legs crossed\nWe can't blame him, it's really not his fault\nThis is the feminization that he was taught\nYou ain't a man; take that M from your mannerism\nYou brain dead, I just gave you an aneurysm\nTrue and living, God sight was divine, use your wisdom\nWhenever I'm reciting a rhyme the proof is given\nUsing Biggie name, who gave you permission?\nYou look like Ralph Tresvant from New Edition\nGifted, I shoot to give no curse\nEvery time they play Control they skip your verse\nLittle bitch, how much change you got in your purse?\nI'm 'bout to lift your skirt\nIt's a difference between great music and good music\nY'all ain't good with me\nHow the fuck they put your album out before Pusha T?\nI figured out why you're so skinny then I got over it\nPusha must be selling the crack and you smokin' it\nAnorexic describe the way that you spit\nOn your album cover it look like you taking a shit\nBehind the green curtain, the same color as Kelis' dress\nOn Nas album cover, you a complete mess\nIs that a indirect or you just a copycat?\nCause he killed you on your own album, he bodied that\nGot the audacity to say you're better than Drake\nAnd out rap Jay Z, what a level of hate\nThose artists made you hot, go ahead and give grace\nWorst Clique verse, they should spit that in your face\nYour biggest record was called A-S-S\nNicki Minaj made it hot, you way less fresh\nI heard you Ye yes man who get paid less checks\nSo when Ye ask a question you just say \"yes yes\"\nYou cocky for no reason like you making mad noise\nYou got your style from the original Bad Boy\nB-I-G, why you said that shit?\nAlways sayin' \"Boi!\" that's Craig Mack's shit\nStill in New York? You better head back, bitch\nRed still ringing, let that red Mac spit\nFirst chain, don't make me laugh lame\nIn Brooklyn that would'a been your last chain\nSaid you stay on your toes, damn that's for ballerinas and girls\nYou should stay grounded, keep your feet on the floor\nMiley did your video without you even\nI saw your interview couldn't give a good reason at all\nLost on your first single, you was fiending the draw\nAttention to your project, she evened the score\nShe illuminated your album, you was fiending for more\nProstituting for the press, you a media whore\nMentally you a virus, part of the reason we lost Hannah Montana\nNow we stuck with Miley Cyrus\nTalking 'bout you hall of fame but you and Ye is all the same\nShare a verse, wear a skirt place them on the wall of shame\nWhen they name lyricists, they don't never call his name\nSo in every interview you hear this fuckboy complain\nNever walked the subway tracks in the pouring rain\nWith a can of spray paint, just to tag upon the train\nNever seen a movie: Breakin', Beat Street, Krush Groove\nStyle Wars, Wild Style, damn you a fuck dude\nAin’t hip hop in a lot of ways\nNever walk with a Walkman, your first headphones was Dr. Dre's\nSean I get at you, ready to attack you\nLast name Mackie do, you gonna call me Papoose\nRight on my hand I got my whole city tattooed\nFive burroughs of death, don’t make me back smack you\nKing of my castle, get out of here, skedaddle\nEyes on the prize and my ears to the gravel\nNiggas like to tattle, shotty double barrel\nBrains on the windshield, Caine cousin Harold\nI carry the torch like a motherfucking statue\nShitting on these rappers I don’t even need a bathroom\nThey probably never had you, know the man who craft you\nBig head scientist, go by the name of Yakub\nOh you spit a mean 16, I can match you\nWell I spit a M-16, who wanna battle?\nPapoose who? World Health Organization\nPapoose who? You a owl or you hating\nWho? you know who the God is, stop fronting, never say who\nWho is a rock group in London", "year": null}]}