{"songs": [{"image": "https://images.genius.com/54500d80e30b81f3a2607247d50c3cf6.600x600x1.jpg", "year": "2012-06-22", "title": "Chains, Whips & Bars", "album": "Awesome EP!", "lyrics": "[Verse 1]\nHow we go from \"Who's that?\" to \"That's who!\"?\nGave the game life when it had less sole than flat shoes\nHeart of a king, blood of a slave, a hundred chains\nSixteen bars that prison guards could not contain\nWe put on ice as soon as we get hot\nAnd carry heavy metal just in case we slip, not\nThese kids rock like we Kid Rocks of hip hop\nAnd if you hope that it stops then kick rocks in flip flops\nCD's fill bins like Regis, but we still treated like animals\nRight? No PETA\nMaybe 'cuz we shine like a Las Vegas ?\nCuz we all pack heaters. They in drive, two seaters\nHittin' one city but I rent two cars\nDamn Big, did we take it too far?\nThis is Ozymandius' chain going too hard\nWe are slaves to our vain man, look at the scars\nBut I got...\n\n[Hook]\nChains, whips, bars, see?\nSo tell me why I feel so free\nSo tell me why I feel so free\nSo tell me why I feel so free\n(x2)\n\n[Verse 2]\nIt's hard to quit the bull, they be on some Jordan shit\nCuz when really do it, you don't choose it, you were born to do\nSo I choose for my fam' and you, Florida shit\nAnd I'mma kill a nigga on some Dexter Morgan shit\nI promise momma that college wasn't just for the kid\nCuz I master the trophies you don't box up in storages\nNobody ever sang my praises, amazing\nNow I'm hopping up on stages where they all singing my choruses\nChains, bars and whips. Y'all ball cuz no umpire would ever call THEM hits\nThat y'all spit out y'all lips\nI spit out my soul, you just spit out your spit\nI'm going for the globe at the end of my wrist\nNorth Pole on my twelve, South Pole on my six\nVizzy on tock, bad bitch on tick and it just won't stop\nIf you don't know that boy sick cuz he's got\n\nChorus\n\n[Bridge]\nWhile everybody struggles to be so free\nI can't take these chains off me\nI can't take these chains off me\nI can't take these chains off me\n(x2)\n\nChorus"}], "artist": "XV"}