{"artist": "Fabolous", "songs": [{"year": null, "album": "More Street Dreams Pt. 2: The Mixtape", "image": "https://images.genius.com/569b76848a931c158eafa9ee03a47708.500x500x1.jpg", "lyrics": "Yea, Its bout to get real hard for these niggas to move man\nSomebody get these niggas some wheelchairs or somethin\n\nGoin to war is still a scary issue\nBut in my hood they train to kill wit every pistol\nLike they military issue\nGuess you a star if you sell a million every disc too\nCatch a gun case and bounce and still they'll barely frisk you\nCuz, I proved I move the retail\nMake the smoothest grooves wit females\nAnd I remove the roofs on V12's\nYou ain't never seen it move this smooth on sprewell's\nI'm a hustler, you just a middle man to me\nThe way I pass the rock could make Jason Kidd a fan of me\nJust cop one joint, for one point somethin\nStill I'll have you at gunpoint, with one joint dumpin\nSo watch what you say to them crackers\nIll put a couple G's on yer head like you play for the Packers\nI'm rap's Lebron James, I quickly see baskets\nThese scrubs wouldn't make it to the Mickey-D's classics\nYou got some sticky weed? Pass it\nIf not put it out, im pushin it before they put it out\nWit the dash, wooded out, Shaq O'Neal footed out\nBlastin a dude who get it first, before they put it out, Clue!\n\nYea, uh, uh, uh, uh, uh\n\nMaybe wouldn't be a million kids wit they faces on containers\nIf cops pursue the same way they chase us entertainers\nIn the hood, a few big faces and a chain a-\nGet metal in ya mouth like braces and retainers\nEven the young bucks be scheming on somebody change\nTryin a sell somebody 'cain, before they even potty trained\nYou can smooth talk your way into a hottie brain\nHave her suckin long enough to leave a nigga body drained\nI wasn't taught, I learned from watchin stupid people\nThat'll run up shootin, in front of a group of people\nI lay in a cut, the same way the troopers peep you\nRide up on yer coupe and creep you while you let a groupie deep you\nCuz even if you reppin like a man of steel\nYou gon' still need a weapon when you land a deal\nOne for watch you slippin like you steppin banana pills\nThink a nigga ain't gon' pull a weapon cuz you scanned a mil? (what)\nI crept in and got handed meals\nNow the white and black rides look like salt and pepper on the bannon grill\nThink I wouldn't hold a Pepsi in my hand for mils?\nYou must be fuckin stupid, nigga\n\n[Ad-Lib til end]", "title": "B.K. Style"}]}