{"artist": "Fam-Lay", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/9127665738535e7306181973e9c0b9b9.356x237x1.jpg", "lyrics": "[Hook]\nWe be rockin' with the beach cruiser\nBeach cruiser, stacking on the handlebars\nYou could ride wid me\n\n[Verse 1 - Famlay]\nLook, I'mma be 100 with you\nIf I can't get no money with you\nI ain't running with you, I ain't even come and get you\nI ain't being funny with you\nCan't do nothing with you\nLet your other cousins come and get you\nCause behind my nickle, look, I'mma find my pistols\nAnd shoot my way up out the courtroom like I'm Brian Nicols\nLook, it's a blessing from the Heavens if I ain't twist you\nNormally, the passenger seat'll be dying with you\nLook at you: bullets is the issue\nBullets rip through tissue, bullets rip through gristle\nLet a physician fix you\nLook, I'm a missile, inside a silo\nCause I know that my flow is like white folk's assault rifles\nSometimes I'm might go Psycho\nSometimes I'm might go  Michael\nI'm not no psycho, no this not no fucking typo\nI type on iPhones: you vs me is a no-no\nWhite string long, Yo-Yo\n\n[Hook]\nWe be rockin' with the beach cruiser\nBeach cruiser, stacking on the handlebars\nYou could ride wid me\n\n[Verse 2 - Famlay]\nSee all that mess they talkin bout?\nThey never block him out, they never NARC him out\nSingles keep on poppin out\nSee what people talkin bout?\nSee what he's talkin bout, see what she talkin bout\nT.Y.B.O. poppin out\nThey mic on the right song my right palm\nLike lightning. My right palm is napalm\nMy icon ?, skate or your bike on\nYour fuck on, you fight on\nThen bygones be bygones\nC'mon: you can ride, you can go, you can slide\nYou can roll, you can fly, you can float\nHypnotized by the spokes, it's alright if you smoke\nWe can ride to the store\nMeet up: time to re-up, break a lead up\nHeat up, light the weed up, beat the beat up\nFeet up, put your seat up, put your Vs up\nA down, this is a teaser\n\n[Hook]\nWe be rockin' with the beach cruiser\nBeach cruiser, stacking on the handlebars\nYou could ride wid me", "title": "Beach Cruiser"}]}