{"songs": [{"image": "https://images.genius.com/d878e54b6766255010da413481db1471.1000x990x1.jpg", "title": "Popular Demand (Popeyes)", "album": "Til the Casket Drops", "year": "2009-10-23", "lyrics": "[Hook: Pharrell]\nMami you miss me, don't you?\nHaters, wish you could hit me, don't you?\nHeh, you should call me uncle\nI understand, I'm back by popular demand\nThat new CL fly\nOutside of Popeyes eating chicken and fries\nYeah, come holla at your uncle\nI understand, I'm back by popular demand\n\n[Verse 1: Pusha T]\nYou are now listening to the all-time phenomenal\nUsed to bag work in VA at the Econo Lo'\nNow I'm laying out at the Delano though\nBut don't get it twisted, the Uzi's in the lining though\nHollow tip dum-dums eat flesh like piranhas though\nSuch a scary thing to hear the soul sing \"Geronimo!\"\nPull up in the CL, the shit's astronomical\nHoes lining up on the curb, they fall like dominoes\nUsed to have this white bitch, she looked like Madonna though\nHeard that she fucking LeBron, but shit, I don't know\nLike that, Bron-Bron? I had that long time ago\nButt-naked on the balcony at the Dolla-no\nI mean the Delano, I mean, Pharrell'll know\nThe head shop bitch from D.C, ay P, let 'em know!\n(Yeah that bitch was hot nigga) Yeah, yeah, but it was time to go\nThem hoes come in \"eenie, meenie, minie-mo\"\nYuugh! Mami you miss me, don't you?\n\n[Hook: Pharrell]\nMami you miss me, don't you?\nHaters, wish you could hit me, don't you?\nHeh, you should call me uncle\nI understand, I'm back by popular demand\nThat new CL fly\nOutside of Popeyes eating chicken and fries\nYeah, come holla at your uncle\nI understand, I'm back by popular demand\n\n[Verse 2: Cam'ron]\nWhy wouldn't I be? Look at shorty (Dammmn!)\nUh, mami good down to the cuticles, \"I'm Cammm\nWhat's your name, beautiful?\" Like (mannn)\nI could get used to you\nWoulda (rannn) if you knew what I used to do\nBut call me uncle, yeah Uncle Cam\nI tax 'em (like who?) Like Uncle Sam\nFrom the jungle, fam, where niggas bundle grams\nFumble or you crumble, get murked on the humble\n(Annnd) The gat on the belt on the hip\n(Annnd) I keep it Pharrell with the Clipse\nDrive a hard bargain (bargain)\nI'm Harlem's only Gar-gar-gin, car foreign\nThe other man stood-stood stutter-fied\nI know your moms well, tell your mother \"Hi\"\nI'm the other guy that got your mother high\nCoke like a caterpillar, I make butter fly, I\n\n[Hook: Pharrell]\nMami you miss me, don't you?\nHaters, wish you could hit me, don't you?\nHeh, you should call me uncle\nI understand, I'm back by popular demand\nThat new CL fly\nOutside of Popeyes eating chicken and fries\nYeah, come holla at your uncle\nI understand, I'm back by popular demand\n\n[Verse 3: Malice]\nGoddamn, the boy's back\nFrom pushing a mountain of Sno-caps to avoiding the Kojak\nThe pioneer of the coke rap\nI'm dancing with the stars, stepping on blow, doing the toe-tap\nThe dope return like I had it on LoJack\nIt made its way home like a road map, I fathered this\nIf I misled any kid that's fatherless\nThat burden's on my soul as long I exist\nGeneration lost, they saying they can't reach us\nThe answer is the Lord like Saturday Night Fever\nI kept it in the crib, it made me a light sleeper\nWhether watching for the Feds or avoiding the Grim Reaper\nWay deeper than rap, money and hoes, it's deeper than that\nFight the temptation but it keep coming back\nMoney stacked to the ceiling just as quick as it dispense\nWho knew them commas meant you could lose your common sense?\nBefore it's too late, all I can tell 'em is \"Repent,\" ugh\n\n[Hook: Pharrell]\nMami you miss me, don't you?\nHaters, wish you could hit me, don't you?\nHeh, you should call me uncle\nI understand, I'm back by popular demand\nThat new CL fly\nOutside of Popeyes eating chicken and fries\nYeah, come holla at your uncle\nI understand, I'm back by popular demand"}], "artist": "Clipse"}