{"songs": [{"year": "2017-03-12", "image": "https://images.genius.com/afe551d73e3033e55b03c7a16eb52069.500x500x1.jpg", "title": "No Chorus, Pt. 9", "album": "Loco", "lyrics": "[Verse]\nAyy, pussy ass nigga done got too troubled\nHit 'em in the eye, they like ooh he cuddle\nMake the wrong move, I don't do non-bustin'\nI don't give a fuck about who do cousin (that's on my mama)\n2017 we got choppers with the beam, nigga\nBig dreams, that's the Martin Luther King nigga\nClip long like a limousine nigga\nBullets run you over like a fuckin' limousine hit you\nWe got them killers outside\nWhere you gon' go? you got nowhere to hide\nAK they come with the knives\nI stick you and shoot you, how you gon' survive?\nThe plug is comin' at five\nStretch 'em, he won't be alive\nHow many P's? five\nWhat you gon' do? I'm gon' split it with the guys (that's on my mama)\nNiggas they hate but they keep it in disguise\nIt's not my fault that you work a five to nine\nBroke, and I got a server runnin' in and out the door\nAll about the bill like I live in Buffalo\nSaid I got a server runnin' in and out the door\nAll about the bill like I live in Buffalo\nNigga tried to rob me, turned his ass into a ghost\nTwo O's in the back, gave his ass a double O\nNigga tried to steal my cash, so I went and fucked his ho\nNigga done made me mad, so I sipped a hundred some' goin' to the door\nHit the club, I'ma act a fool in this ho\nCame through the back, got my tool in this ho\nIf a nigga make the wrong move in this ho\nGlock two, now dude on the floor\nFound out where he hide mane, I'm about to ride out\nCar ain't brand new but this coupe got some drive 'bout\nPull up on your boo, she like ooh, pull that iron out\nI'm an OG like Doe B, let me find out\nYour bitch gave me head, yeah she good with the dill pickle\nHundred on his head, fuck it, that's just how I deal with you\nTell the streets the truth, BlocBoy JB be the real nigga\nForty make your whole team run, track and field nigga\nPlug just came with the pack so fast that a nigga might go'n head hit him with the uhh\nNow I'm like uhh, feelin' like Soulja Boy, hit 'em with the you\nNigga I'm a gangbanger, I'ma let it bang bang\nI ain't talking car game, bitch we can do it\nMake a nigga bling hang, I did him cruel (what's up?)\nPolice come, watch me maneuver (I'm gone)\nI do not beef on computers, I give it to you like a distributer\nNiggas they singin', call 'em Marvin Lewis\nThat's why when I see 'em, shots at they medula\nGot on my knees and I prayed and always said my grace\nWho knew I would blow up in the freezer?\nTell all the niggas that hate get the fuck out my face\nBitch I'm icy, shoutout to my jeweler\nXD's with the coolant, shots at your medula, all my niggas shooters\nKickin' kack, C'in cool with the ruler\nBut I'm not a tutor, pull up like an Uber\nToasted like a strudel, boiled like some noodles\nThen feed you to one of my freaky lil thots\nWe servin' soft, we don't mix it in pots\nMight run in your spot and hit you with the Glock\n\n[Outro]\nBlocBoy next up, time to run a check up\nHands in the air 'cause girl I'm a flexer\nFlexer, finesser, bend her, undress her\nChoppers, berettas, all up on the dresser\nAyy, haha, I told y'all niggas this shit don't stop nigga\nWhole lot of crip shit nigga\nNigga know what goin' on man\nAnd I'ma die behind that nigga, crip"}], "artist": "BlocBoy JB"}