{"songs": [{"year": null, "title": "Kiss the Babies", "image": "https://images.genius.com/6525d1888947cc49b5c9274e9ee2e289.400x400x1.jpg", "lyrics": "[Hook]\nSee the politician\nSee him kiss the baby\n\n[Verse 1]\nIt's the end of the way of life as we know it\nThis is the last straw\nGeorge Bush bout to declare the last war\nSo tell everybody you love you still love em\nAnd if you got kids then take time to hug em\nI don't really think that y'all know what niggas is facing\nWe are near the end of a twisted civilization\nThis isn't a nation\nCut all the money for education\nAnd build more prisons as a replacement\nHow is that they could win a war against terror and\nIn the ghetto we losing the war against heroin\nWhere all the thoro men?\nThe Martins, the Malcolms\nThe ones that'll lose they life to change the outcome\n\n[Hook]\n\n[Verse 2]\nIf we don't get 40 acres, then I think that blacks\nAt least shouldn't have to fucking pay sales tax\nGotta give us something back\nGMC should give every black man a damn brand new 'lac\nAnd we should all give em back\nTell em \"we don't want that! Y'all listening to too much rap!\"\nFucka, our will is strong now, can't nothing touch it\nAnd we don't give a fuck if you keep cutting the budget\nNiggas gon thug it, life live to the fullest and love it\nAnd keep it rugged til we kick the bucket\nI can't vote, and that's something I don't regret\nCause for the poor folks they ain't did shit yet\n\n[Hook]\n\n[Verse 3]\nTo the NYPD, the LAPD\nWhatever the hell they call the police in DC\nI don't care if you a sergeant, a narc or a DT\nYou could even be just a security guard with a CB\nAnd no gat, but I'ma act like I ain't even know that\nThis kill a cop mentality stem from me being pro-black\nOut the pen and I ain't fin to go back\nWon't fake no jack, if jake snap a Kodak\nInstead I'll be forced to pull, cock back, unload the whole gat\nI'll die controlling the MAC, telling the po to \"hold that\"\nWhether he white, black, Irish, Italian, or Polack\nBody thin as a Somalian or fat as Joe Crack\n\n[Hook]\n\nDo we really know where the guns come from?\nDo we really know where the drugs come?\nHow come it only effects us and not them?\nHow come Jesus Christ has still not come?\nWhy am I wrong if I kill a nigga that punched me\nBut it's right for you to blow up a whole country?", "album": "Warning Shots"}], "artist": "Saigon"}