{"songs": [{"album": "Body Snatchers 3", "year": "2016-04-16", "title": "100 Boxes", "image": "https://images.genius.com/34bf5359b6f29e0f8aaa96fd6a7037c4.500x500x1.jpg", "lyrics": "[Hook X2: J. Stalin]\nI'm taxin' niggas\nWhen that coke jump back\nPut the whip game on it\nHow I do it like that\nI'mma need a hundred boxes of baking soda\nA hundred boxes of baking soda\n\n[Verse 1: J. Stalin]\nCocaine on my horse, nigga\nCocaine in my Porsche, nigga\nThe whole West, flooded with bricks\nCause some of you come up short, then they gon' split your shit\nSee, I got fifty bands in this briefcase\nAnd I just beat a police chase\nSo I don't give a fuck about what he say or she say\nI'm lookin' for the plug, where the bricks at?\nMy lil niggas keep callin', like where them zips at?\nI'll be in the kitchen in an hour flat\nWhippin' up powder, brining that hard back\nNo cut, this shit'll give you a heart attack\nI gotta have a chopper at the transac\nCause I got a cool million in this back pack\nAny my nigga Tommy-Guns'll push your wig back\nSaid I got a cool million in this back pack\nAnd my cousin Maybach'll push your wig back\n\n[Hook X2: J. Stalin]\nI'm taxin' niggas\nWhen that coke jump back\nPut the whip game on it\nHow I do it like that\nI'mma need a hundred boxes of baking soda\nA hundred boxes of baking soda\n\n[Verse 2: J. Stalin]\nNiggas dyin' over drug money\nFuck a drive by, I'mma dump the whole drummy\nBounce out, show them niggas what we talkin' 'bout\nIt wasn't ready, air they ass out\nGot a hundred bands in that safe, nigga\nAnd a good lawyer for that case, nigga\nSo I been on the corner, still pushin' free bass, nigga\nWha, I used to be a lil broke nigga\nI used to duwop and sell soap, nigga\nNow I walk a thin line like fuckin' tight rope nigga\nAll I know is pimp bitches shoot dice, sell dope\nFive in the morning, nigga, I was woke\nSittin' outside your house with your head in the scope\nI just heard you got the shipment, nigga, fresh up off the boat\nSo I just came to collect, nigga\nWith them Macs and them Tecs, nigga\nThem Macs and them Tecs, nigga\n\n[Hook X2: J. Stalin]\nI'm taxin' niggas\nWhen that coke jump back\nPut the whip game on it\nHow I do it like that\nI'mma need a hundred boxes of baking soda\nA hundred boxes of baking soda"}], "artist": "J. Stalin"}