{"songs": [{"image": "https://images.genius.com/5f4b5e2e1279c7b7d37d4506ce090fbf.1000x1000x1.jpg", "album": "uknowhatimsayin¿", "title": "3 Tearz", "lyrics": "[Intro: Danny Brown]\nOh, we went to school alright\nHaha, we went to school, we was doin' JPEGs\nCheck\n\n[Verse 1: Danny Brown]\nUsed to cut the rock with no glove on (Step)\nShove on, for the block, develop a love jones (Yeah)\nThe reason why your ho got them rug burns (Ah)\nIt's no limit, call me Mr. Serv-On (Yeah)\nWork all day 'til the work gone (Step)\nTalkin' back in the day when I had a chirp phone (Boop)\nMy nigga made a wrong turn, got flipped in the zone\nHad to say I was a smoker just so I could go home (Home)\nEvery day, another episode (Step)\nI'm just tryna hear the beat like the stethoscope (Yeah)\nLike my bass lines thick, like a Texas ho\nIt was written, but the signature not legible (Nah)\nDrink so much, I could drown a fish\nOn some other shit (Step)\nA demon on the hunt for the succubus (Step)\nWhy you on some pedo shit? Hit it then fuck her bitch\nI don't think you know who you're fuckin' with (Yeah)\n\n[Chorus: Danny Brown]\nTwo tears in a bucket, fuck it (Step)\nI don't care about nothin', nothin' (No)\nTwo tears in a bucket, fuck it\nI don't care about nothin', nothin' (Step)\n\n[Verse 2: El-P]\nDanny, it's dangerous, Run The Jewels is chaos in arrangements\nShit'll give your fuckface a facelift\nPoppa did the Triple Lindsy flip when the 'caine hit\nMama never met a bottle that she couldn't drain quick (Ayy)\nStuck in a rude mood, the fuck shit approaches\nLike we believe in nothin' Lebowski (Yes, Lebowski), there's no motive\nI babble on, tryna get bags like, \"Fuck all of 'em\"\nDeath is on my couch and I'm telling' him jokes, stallin' him\nPlus, I offer one of my smokes, he smoked all of 'em (Fuck, man)\nTrue doom, eat up your crew, like MM... FOOD\nSay the name, it's like you prayin' for pain, but you rude\nGot a brain? You gon' move it or lose it, you screwed\nI'm from fame, its deranged, it is sick, real shit\nIf I'm correct, the really cool kids prolly callin' it lit (Hey kids)\nCall it shit that I am culling from my brain with a switch\nHold my beer, I'm 'bout to go and get rich, motherfuckers\n\n[Chorus: El-P]\nThree tears in a bucket, fuck it\nI don't care about nothin', nothin'\nThree tears in a bucket, fuck it\nI don't care about nothin', nothin', hol' up\n\n[Verse 3: Killer Mike]\nI don't give a fuck 'bout Trump, who got dump?\nWho protesting collections at their garbage dump?\nAnd I don't really give a fuck about givin' a fuck\nAnd who feels that black celebrities ain't givin' enough\nGive 'em the dick; fat, slick son of a bitch\nBetter than you are, what you are's the son of a whore\nMy dad told me that your mom was somethin' mean on her knees\nBut thank God we ain't related, 'cause she swallowed the seeds\nHappy belated, I'm elated to know we ain't related\nSo tell your special kids stop saying Auntie Shana my lady\nI sip on fine wines, fine dine with dimes and nines\nI got an Einstein mind and I still tote iron\nI'm a P-I-M-P in my own rhyme\nSpace-age gorilla pimpin' out the cage with mine\nWould you steal for me, nigga?\nIf it's goddamn mine\nWould you kill for me, nigga?\nBitch, you out your goddamn mind\nAnd that's goddamn right, I'm goddamn Mike\nWin in the end like Tina did goddamn Ike\n\n[Chorus: Killer Mike, El-P, & Both]\nThree tears in a bucket, fuck it\nI don't care about nothin', nothin'\nThree tears in a bucket, fuck it\nI don't care about nothin', nothin', hol' up\n\n[Outro: Killer Mike]\nThree tears in a bucket, fuck it\nI don't care about nothin', nothin'\nBucket, fuck it\nI don't care about nothin', nothin'\nThree tears in a bucket, fuck it\nI don't care about nothin', nothin'", "year": "2019-10-01"}], "artist": "Danny Brown"}