{"songs": [{"year": null, "album": "Stranger Than Fiction ", "image": "https://images.genius.com/0043c66183bb24d57ffa8209ac57183e.500x500x1.jpg", "title": "Angels", "lyrics": "[Verse]\nWhere we go from here, If I leave the block\nA little money fine but I need a lot\nTake a preachers route but dont lie to people\nI ain't never seen anything in the sky\nClean in the ride, what I mean that I'm fly\nWith a bitch super mean, bumpin' lean to the side\nI was thinkin bout any means I could try\nI believe in a high!\nBeing logical gave me a reason to doubt\nScheme for things I was dreaming\nIn a magazine article reading about\nFace card, I ain't got to pay for drugs\nIt comes free with the artificial look\nCould I just do me, Let me be me\nI ain't arguin' for much\nI'm with this bitch and I feel free\nShe don't demand of me for much\nMy sex drive been at an all time low\nI can barely get it up!\nTryin' to keep another mother fucker happy\nSwear I'm givin' up!\nDrug usage is increasing since the last time\nBeen gone awhile and I'll be back just like the last time\nRacks on me, stacks on me, Travel hard\nOne nation under God!\nIn the car alone, prayin' to the stars\nEngine roaring, make a joyful noise\nPraise be to Allah, come this far or not!\nCocaine, foreign car, look who takin' off!\nThrowin' money at my nigga\nYounger sister really wishin' he was with us\nBut look who takin' off!\nBand for you to keep, love I'm finna leave\nSo I guess I'm taking off!\nNo one will love you like I do so never hesitate to call\nKnow I could always count on you to always have me there at all\nGood hearted if you think wrong\nHow could you be right?\nFour niggas fuckin' the same bitch\nShe pop up pregnant this can't be life\nGet rid of the bitch, 'fore I get rid of you bitch\nI'm sick of you bitch\nNo hands on ya, rubberbands on ya, I ain't talkin' like a stripper\nPay they do it, send razors through, spray the kay and make you flip\nOnly reason I ain't kill your mother\nStrength of her daughter\nAnd she cheats everyday on your daddy\nTryin' to give orders\nThen they try to extort a gangsta, I'm someone important\nDon't step in my office, I ain't about no talkin'\nBe sippin' my coffee while bullets is sparkin'\nWithout any caution, now watch who I'm crossin'\nBoobie is awesome, catch up if I lost ya\nWith this I went off\nMy grandpa a gangsta, he died I went off\nDon't interrupt me while I am recordin'\nShit so depressing, I wish I could pause it\nMisunderstand it, put that in a coffin'\nBack to the margin, re-up and get off it\nLabel an orphan, Lane of my own\nI got the hawkin, I am retarted\nKnow theres a name, don't know what to call it\n\n[Hook]\nNo ones watchin' but the angels\nMy hearts been takin' by this angel\nI, To many insecurities that won't allow me to trust\nWhy not protect us from love, If they’re angels?\nMy hearts been taking by an angel\nNo ones watchin' but this angel\nI, To many insecurities that won't allow me to trust\nWhy not protect us from love, If they’re angels?"}], "artist": "Kevin Gates"}