{"songs": [{"title": "Freak", "lyrics": "[Ahmad's friends talking]\n.. and then he cut it off *laughter*\nHahaha, ay who next? Who next?\nAy ay Jamal come up\nSomebody else.. aiy who next man?\nCalvin you next?  (Nah nah)\nMidget?  Rascal?  (No, no no)\nIt's mine?  On mine?  I'm gon' tell a story man\nAight aight, it's like this..\n\n[Ahmad]\nWell it was half past eleven o'clock, ready to rock\nI'd been searchin for a spot all week, where they be doin the freak\nBut no one knew I didn't panic, remained calm\nThought, \"Why not just go out on a mission, like James Bond?\"\nDouble-oh-seven, since I'm the great, I'll be double-oh-eight\nSo I went into the closet and got my gear straight\nJumped in the car, drove for an hour, with no luck\nStarted havin doubts and that's about when trouble came up\nTwelve thirty at night I'm at a street light and hot\nRestin my head back (BOOM!) I heard a shot\nFired through my back window broke the glass then hit dash metal\nNo time to look both ways I hit the gas pedal\nNow my \"Mission\" is real like Special Ed\nGettin shot at with a shotty and I wish I had a jet\nTo hit, maximum thrust 'fore they bust one and hit me\nSquare in the back cain't understand I was the wrong man that\nThey were after, I wish they'd see the light, no joke\nBut in the meantime, I broke and hit a quick right\nDipped to an alley, turned off my lights and ducked\nAnd I guess none of 'em saw me, they kept goin up Crenshaw, good\nOpened my eyes for surprising more\nTo see the alley I was in lead to the party I'd been lookin for\nAll out of breath and could hardly speak\nBut soon as I walked in the door, honey asked me if I wanted to freak\n\n\"She did the freak!\" (4X)\n{*reggae patois - can't follow*}\n\n[Ahmad]\nWell I'm back on the move, yeah back on the mission\nGettin jocked and shit cause my pockets thick\nI guess they heard I had a record deal\nAnd I'd expect that would change their views do's and don'ts\nInto they won't diss and now my mission gets, a little bigger\nI'm lookin for a freak with soul that's not a gold digger\nYup, I want some-bo-dy\nAnd by bein in the bright spotlight, you learn a lot like\nIf you got ends, well then you got friends\nIf you got dough, well then you got hoes\nAnd that's how all of that go, but\nI'ma still have to give it a try\nI saw a girl with no guys, sittin in back and I went over to chat\nWell we talked and laughed about a half hour then\nThere was a sudden blur, when I saw her\nThe finest girl I'd ever seen her name was Tina\nDressed all in red then my mouth said\n\"Sorry I don't mean to be a dog or a mutt\nI'm just a big Cool J fan and, Tina got a +Big Ol' Butt+\nSo I'm leavin love,\" then I went over to Tina to speak\nAnd I asked her if she wanted to freak\n\n\"She did the freak!\" (6X)\n{*reggae patois - can't follow*}\n\n[Ahmad]\nDig it now she wanna freak, well here's my number beep it\nMight even lick the cat but if I do I get to keep it\nThat's what I told Tina then I jetted, I said it\nJust to make sure we got in bed - it's, all in the mix\nTo the Motel 6, because I figure\nIf bags was bait she bit 'em hook line and sinker\nI'm out now, until next week, mission complete\nAhmad, the great double-oh-eight niggarole doin the freak\n\n\"She did the freak!\" (8X)\n{*reggae patois - can't follow*}\n\n\"She did the freak!\" (16X)\n{*reggae patois - can't follow*}\n\n\"She did the freak!\"", "year": null, "album": "Ahmad", "image": "https://images.genius.com/3d85c954b2ab0c9abe8f9fc12381fbd7.600x600x1.jpg"}], "artist": "Ahmad"}