{"songs": [{"image": "https://images.genius.com/508b912f569b8bb0c6714a8272e0e931.400x397x1.jpg", "title": "Dead Body Disposal", "album": "Gory Days", "year": "2001-11-13", "lyrics": "[Sample of Sol, Vinny & Lincoln from Snatch]\nLincoln: Well, what happened to him?\nSol: He got shot in the face, Lincoln. I would have thought that would be obvious\nLincoln: What'd you do that for? You mistake him for a rabbit? What'd you want me to do about it?\nVinny: Sort it out\nLincoln: I'm not a fucking witch doctor\nSol: But you are a bad-boy yardie, and bad-boy yardies are supposed to know how to get rid of bodies\nLincoln: I create the bodies. I don't erase the bodies\n\n[Verse 1: Necro]\nLet's talk about dead body disposal, my proposal\nTake the corpse to the bathtub and drain the blood out of the bastard\nStrip ya self nude first so you don't get blood on ya new shirt\nAnd cut the fuckin' corpse up like a butcher to meat kid\nAnd put the pieces inside trash bags\nSo she'll be reeking like a fags ass with flesh covered in leeches\nAnd throw the bags away in various trash bins in different areas\nThis shit's hilarious\nNobody notices some asshole taking out the garbage\nWho would know it's a carcass?\nEven if they were focusing cause the plastic bag is dark kid\nAnd even the nosy bitch wouldn't open it, it make no sense\nAnd if you do it just before a trash pick up\nThe bodies hauled away before it decays and stinks up\nIt won't be noticed with literally tons of other shit\nAnd ya bag is in the middle buried right under it\nEspecially if you double-bagged it\nYa victim'll stay a faggot in fragments forever stagnant\n\n[Hook: Necro]\nDead Body Disposal\nFor those that don't know what to do after ya foes are killed\nShit could get messy when the blood flow spills\nYou never know when you might need to know skills\nIn body disposal it's no frills\nDead Body Disposal\nAre you interested in hearing my proposal?\n\n[Verse 2: Necro]\nBodies begin to stink within an hour of death\nAnd if it's warm outside then it's quicker for the sour stench to leak out the flesh, so think about the steps\nYou taking killing and be willing to consider the best\nBe extra careful and grab an aerosol can of pepper spray\nTo coat the pieces the smell is unbearable\nHold the first layer of bag beautifully\nThat'll keep animals from tearing open the bag to get to the meat\nSquirrels, dogs and birds\nOfficers with dogs that smell won't find shit when they thrown off the scent\nYou could hang a fuck upside down in ya tub\nAnd slit his throat from ear to ear to remove a large amount of blood\nMost of it'll gush on its own at once\nBut to get that last couple of pints drained work his arms like pumps\nFor dismemberment gentlemen I recommend\nHeavy duty bone saws that cut through gentle limbs like pendulums\nBut if you want to take your time don't rush it\nEither cut each piece off like Pizza Hut pizza with a rusty cleaver\nThen put each piece up in a freezer\nTake out the trash in a couple of days the stench of decomposition's meagre\nAnd make sure there's no incriminating papers in the bag\nLetters, receipts, anything with ya name they'll trace ya\nI know it's obvious but you'd be amazed at how easy it is\nTo be sloppy with this even the Mafia slips\n\n[Hook: Necro]\nDead Body Disposal\nFor those that don't know what to do after ya foes are killed\nShit could get messy when the blood flow spills\nYou never know when you might need to know skills\nIn body disposal it's no frills\n\n[Bridge x2: Necro]\nLet's talk about death baby\nDisintegration of flesh you'll see\nLet's talk about all the good things and the bad things\nIn hacking up ya meat\n\nLet's talk about that!\n\n[Brick Top from Snatch]\nBrick Top: You're always gonna have problems lifting a body in one piece. Apparently, the best thing to do is cut up a corpse into six pieces and pile it all together...\n...And when you've got your six pieces, you gotta get rid of them, because it's no good leaving it in the deep freeze for your mum to discover, now, is it?\n\n[Verse 3: Necro]\nThere's more choices to choose kid\nBury the corpse in the ground, bury it at sea or the pieces get distributed\nWhen using the ground a shallow grave isn't allowed\nCause the corpse'll be found when the stench of it lingers out\nMake sure it's six feet deep or more\nConstruction sites work in fermented\nIn what's cemented suspended beneath the floor\nUsing the sea has its potential sequentially\nThe sea destroys all evidence eventually\nBut make sure that you tie a weight to the body to keep it from floating\nAround and being discovered by mistake\nDrop it as far from shore as possible otherwise it'll pop up at low tide or\nBe seen by some fisherman's opticals\nDistributing body parts is riveting\nI explained it in verse one forgive me if I begin again\nA wood chipper turns a corpse into chopped meat\nSpread it all over ya grass then water it down properly\nWithin a few days the cadaver's fertilizer\nYour advisor's taught you ways of covering up murders wiser\nRegardless how you tried these methods\nBe careful with prints and rented equipment use cash and fake IDs\n\n[Hook]\nDead Body Disposal\nFor those that don't know what to do after ya foes are killed\nShit could get messy when the blood flow spills\nYou never know when you might need to know skills\nIn body disposal it's no frills\nDead Body Disposal\nAre you interested in hearing my proposal?\nShit could get messy when the blood flow spills\nYou never know when you might need to know skills\nIn body disposal it's no frills\n\n[Hook]\nLet's talk about death baby\nDisintegration of flesh you'll see\nLet's talk about all the good things and the bad things\nIn hacking up ya meat\nLet's talk about that!\n\n[Brick Top from Snatch]\nBrick Top: Then I hear the best thing to do is feed them to pigs. You got to starve the pigs for a few days, then the sight of a chopped-up body will look like curry to a pisshead. You gotta shave the heads of your victims, and pull the teeth out for the sake of the piggies' digestion. You could do this afterwards, of course, but you don't want to go sievin' through pig shit, now, do you? They will go through bone like butter"}], "artist": "Necro"}