{"songs": [{"lyrics": "\"(spoken)Yo, so you know, all of a sudden, we're in front of the\nRestaurant and she decides she wants to leave on her own\nAnd I'm like \"Just go!\" you know? And then she\nShe gotta get something out the car\nShe gotta do this she gotta do that...(/spoken)\n\nYo she was always trying to fight me\nKick me and bite me\nI used to argue with her daily and nightly\nTrying to excite me, saying shit to spite me\nShe said \"I know it isn't another girl!\" I said \"It might be.\"\nThere really wasn't but I said it cause she hyped me\nI know she loved me but she act like she don't like me\nAnd started gradually just trippin' on me slightly\nAll of a sudden, she stopped acting politely\nI said \"Just kiss me instead of trying to dis me\nCause when I'm gone you'll be hollering you miss me\nYou should just love me instead of trying to shove me\nTry to hug me instead of trying to bug me.\"\nShe beautiful but be acting like she ugly\nI know she dug me but why the hell she drug me\nThrough all the drama talking 'bout that she can kill me?\nBe flashing on me, turn around and say \"You feel me?\"\nI'm like \"Yo, you ain't always got to grill me\nYou better tighten up before somebody steal me.\"\n\nCHORUS:\n\nWhy you be acting up, why you be showing out?\nWhy you be talking all loud when we in the house?\nWhat's with the attitude? Why you like to run your mouth?\nI guess you really don't know what it's all about\nYou gots to BOUNCE\nGet your clothes and BOUNCE\nPack your bullshit and BOUNCE\nGet your clothes and BOUNCE\nGimme everything and BOUNCE\n\nShe was always trying to hold me\nShape me and mold me\nI never knew and nobody ever told me\nTrying to control me just because she know me\nShe said \"If you love me like you tell me then you show me!\"\nI had to tell her that I dealt with her solely\nIt didn't matter cause she treated me so coldly\nTried to talk with her but she blocked it like a goalie\nWe was lovers before we was homies\nI said support me instead of trying to short me\nOutvote me or root beer float me\nMisquote me or even scapegoat me\nAnd after all that insult me?\n\nCHORUS\n\n(spoken)You know, we used to be close now you want to badmouth me\nAnd talk to your friends all crazy about what I do...(/spoken)\n\nShe was always trying to clown me\nSink me or drown me\nOutthink outdrink and out-of-bound me\nI used to leave but I hated when she found me\nBut she got to everyone in the townie\nI tried to duck from the drama that surround me\nIt's in my blood, I'm a king you got to crown me\nThe way she flipped the script on me was astounding\n\"Who do you think about when you say who found me?\"\nI should have taught her everytime I fought her\nI never caught her and never tried to salt her\nI wonder why our relationship falter\nI guess we both have the kind of life you can't alter\nPeople should make up instead of trying to break up\nOr just break up cause that can be a wake up\nAnd when you wake up make sure you take up\nA little time so you don't make a mistake up\n\nCHORUS\n\nTake your (keys/cat/dog/silverware/dishes/old couch) and BOUNCE\n\n(spoken)Yo, alright, this is done. No more, I can't argue with you...\"", "title": "Bounce", "album": "Accepted Eclectic", "image": "https://images.genius.com/4f38e699f6f80a3255420adf5e98a0a8.600x600x1.jpg", "year": null}], "artist": "Aceyalone"}