{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/b4fa12daae29f7a482e96f06ed084db8.432x432x1.jpg", "title": "Swimming", "year": "2011-05-17", "album": "PL3DGE", "lyrics": "Bigga, Boulevard King shit, nigga\n\n[Verse 1: Mike Bigga]\nShe got a Bugatti body, I wanna run that\nAnd she a hard to kill thrill, ay, where my gun at?\nI got them both on my arm, bracelet and timepiece\nI only take em together, just call it Siamese\nWe order Manhattan takeout, you know that Chinese\nAnd then we smoke Thai sticks till we look Thainese\n\n[Chorus]\nWe swimming in all these women\nSome folks thinkin' we crazy, crazy\nCrazy, crazy, crazy, crazy\n(They truly believe that we're nuts)\nWe swimming in all these women\nWill we settle down? Maybe, maybe\nMaybe, maybe, maybe, maybe\n(I don't know, I don't know)\n\n[Verse 2: Mike Bigga]\nThey say I'm a fool (I'm a fool!), they say I'm crazy (I'm crazy!)\nI'm walkin' out on the perfect lady (I'm gone!)\nWhat they know about walkin' in the destiny (they wrong!)\nThe ?? won't ever get the best of me (oh no!)\nWhat so many need (need!) and deserve this (deserve this!)\nAttention bad bitches, I am at your service (attention!)\nIt's Mr Lay It Long (I am!), Mr Stuff It In (I will)\nMr If She Witit, you can bring your lovely friend (for real)\nShe said you got a woman that keep it straight with me (ok, ok)\nI said I got several, couple you could date with me (uh-huh, uh-huh)\nI got a Louis lady (I do), I got a Gucci girl (that's two)\nI'm looking for a Fendi freak, what you doing girl?\n\n[Chorus]\nWe swimming in all these women\nSome folks thinkin' we crazy, crazy\nCrazy, crazy, crazy, crazy\n(They truly believe that we're nuts)\nWe swimming in all these women\nWill we settle down? Maybe, maybe\nMaybe, maybe, maybe, maybe\n(I don't know, I don't know)\n\n[Verse 3: Roc D]\nShe love me, love me not\nShe caught me ??\nFive in the mornin', I be the Dan, bitch I don't stop\nShe tell me black is hot, she light a little shot\nNa I do, I love these hoes, no I do not\nThat's why I keep it pimpin' with so many pretty women\nWhile y'all still sippin', the liquor still swimmin'\nThe lit is still grinin', the lit is still women\nEven though I ain't cumin', she still crimpin'\nShe gettin' ready, no sleep, call me Freddy\nI got that pussy so wet like Katrina and ???\nI been cold ??, get Murphy money like Eddie\nAnd I'ma be like ??? they cut my lights off like Teddy\n\n[Chorus]\nWe swimming in all these women\nSome folks thinkin' we crazy, crazy\nCrazy, crazy, crazy, crazy\n(They truly believe that we're nuts)\nWe swimming in all these women\nWill we settle down? Maybe, maybe\nMaybe, maybe, maybe, maybe\n(I don't know, will we ever settle down?)\n(I don't know, maybe)\n\n[Verse 4: Mike Bigga]\nBitches love me (they love me!), I'm a ??\nI'm a boyfriend's nightmare, Wes Craven\nHow your job baby? Take a year off (a year!)\nTry Ciroc hon, get rid of the Smirnoff (disappear!)\nWe some big dogs (big dogs!), doin' big shit (big shit!)\nCall your girlfriend, ay let's take a big trip (big!)\nAy hold on, hold on (hold on, hold on), 'fore you grab that phone (phone)\nLeave them Suzy squares church girls all at home (gone!)\n\n[Chorus]\nWe swimming in all these women\nSome folks thinkin' we crazy, crazy\nCrazy, crazy, crazy, crazy\n(They truly believe that we're nuts)\nWe swimming in all these women\nWill we settle down? Maybe, maybe\nMaybe, maybe, maybe, maybe\n(Will we never settle down? I don't know)\n(I don't know, maybe)"}]}