{"songs": [{"title": "Afro Puffs (Extended Remix)", "album": null, "year": null, "image": "https://images.genius.com/48e9a0e02d85ec6db66796c8a1a592e1.499x499x1.png", "lyrics": "[Verse 1: Snoop Dogg]\nDamn, look what the wind blew in\nFrom the depths of the sea\nIt's the S-N-double O-motherfucking P\nIn the place to be\nAnd this time I came with the homegirl R-A-G-E\nSo let me begin\nTo slowly start to flow but let me grab my cup of gin\nThen look, the crook, it's me\nWho be the D-O-double to the G\nI fly through the sky like a dove once again\nIt's Snoop Doggy Dogg -- can I blend, men?\nThen send more than you need\nCan I have some bags so I can roll up the weed?\nI take a glance, in other words a chance\nI spot myself up on the dance floor taking a dance\nI got a bitch on my dick, some niggas talking shit\nBut ain't no need for me to call my clique\nCause DPGC be the clique that the D-O-double G belongs to\nI wrote a song to the track that's provided by my nigga Dr. Dre\nNow slowly start to slide into a trance, move around\nAnd get hooked, lady, by the sounds of the Pound\nWe got the hits that just don't stop and they don't quit\nCause once again, Snoop Dogg is 'bout to drop some shit, bitch\nI can't stop, I pop\nNever flip, I flop\nSnoop Dogg got the shit that don't stop\nRock on with your bad self\nIt's The Lady of Rage at the top of the shelf\nSo push the button, run, because\nSnoop Dogg is on the mic and I'm a dope motherfucker\nYeah, you best ask somebody\nAbout the man with the la di da di\nI got the shit that makes your body shake\nIt's time for you to stop, pause, and awake\nOpen up your eyes and stay composed\nIt's one nine nine four -- I still don't love hoes\nI treat them the same -- it's like the boom bam\nIt's Snoop Dogg, I'm on the mic; can I slam?\nYes you can, and you just don't stop\nC'mon, say what, and you just don't stop\nUh, yeah, and you just don't quit\nHey yo Rage, could you please drop some gangsta shit\n\n[Hook: The Lady of Rage and Snoop Dogg]\nI rock rough and stuff with my Afro puffs\n[Rock on with your bad self]\n\n[Verse 2: The Lady of Rage]\nI rock on with my bad self cause it's a must\nIt's The Lady of Rage still kicking up dust so, uh\nLet me loosen up my bra strap and umm\nLet me boost you with my raw rap\nCause I'mma break it down to the nitty gritty one time\nWhen it comes to the lyrics, I gets busy with mine\nBusy as a beaver, you best believe-a\nThis grand diva's running shit with the speed of a cheetah\nLyrical murderer\nI'm serving em like two scoops of chocolate\nCheck out how I rock it\nI'm the one that's throwing bolos\nYou better roll a Rolo\nTo find out I'm the number one solo\nThe capital R-A -- now kick it to the G-E\nI'm bringing things to light but you still can't see me\nI flow like a monthly, you can't cramp my style\nFor those that try to punk me, here's a Pamprin, child\nNo need to say mo', check the flow\nRage in effect once mo', so now you know\n\n[Hook]\n\n[Verse 3]\nNow I'm hitting MC's like Hadouken\nAin't no doubt about it, I'm the undisputed\nSo what you want to do is back on up\nI'll tap that butt, wax the cuts, pass the bucks\nSo put your money on the bread winner\nI kick lyrics so dope that the brothers call 'em head spinners\nI got the tongue that is outdone anyone\nFrom the rising to the setting of the sun\nOr the moon, I consume the room with doom\nWhen I hear the kick of a 808 bass...boom\nBoom, bam, Goddamn!\nI'm hitting so hard you could say it's a grand slam, dunk\nPunks get broken off for chunk when they feel the funk\nOf the rhythm (fresh) that I give 'em\nLet it hit 'em, split 'em, did it -- now I'm rid of 'em, yeah\nI put that on my unborn kids\nRage in effect so you know how it is\n\n[Hook]\n\n[Verse 4]\nNow ever since my debut, I've continued to lay you\nFlat on your back from the raps that I spat, spit\nOh shit, I'm the shit\nYou can't get with the Rage, then tough titty\nI pity the fool that gets\nWith the lyrical murderer cause my shit is rude\nYou wanna get with the wickedness?\nWith that big-bodied girl that's kicking it\nRipping it apart like Jason\nYou'll be chasing a dream like Freddy\nAre you ready for the cream de la creme?\nI'm steam pressuring those who ain't measuring up\nI keep competitors stuck\nIn the muck with they butt up\nWhat, you want to nut up like cashew?\nDon't you know that I will mash you?\nFor real, that's the deal, I'm straight out of Farmville, VA\n[Snoop: So what you gotta say?]\n\n[Hook]\n\nI am the roughest, roughest, roughest [Snoop: Say what? Say what?]\nI am the toughest, toughest, toughest\n\nGet with the uhh, roughest, roughest\nGet with the uhh, toughest, toughest\nGet with the uhh, roughest, roughest\nGet with the uhh, toughest, toughest\nGet with the uhh, wickedness, roughest\nI am the uhh, wickedness\n\n[Outro - Snoop Doggy Dogg]\nYeah, one-nine-nine-fo'\nThe indo blow and the grass grow\nSnoop Doggy Dogg still don't love a ho\nBut you gotta give credit when credit is due\nWomen back down and bow down\nTo my motherfucking homegirl The Lady of Rage\nShe rocks rough and stuff with the Afro Puffs\nHandcuffed as she busts\nAnd trick biatch, she's guaranteed to tear shit up\nYou know what I'm saying?"}], "artist": "The Lady of Rage"}