{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/d22dab44518982eea6d1dd56dae8f38c.600x600x1.jpg", "title": "Early Mornin", "lyrics": "[Verse 1]\nThey talking about skill, let me drop it on the head\nThey talking about pills, let me pop em till im dead\nI'm the curse of the shit that means words that i writ, now take you back in time to my earliest shit\nWhen i drop my mixtape yeah they try to ignore\nWhen they cop the shit it's great now they try to applause\nI ain't here for you to dick ride, cos I spit the sick rhymes\nSee my in my clique light up getting rich\nI won't stop till I'm claiming it all\nI've be warned its gonna hurt, will I remain in this form?\nStand in the depths not a chance of it yet not yet man or ever imma dance till the death\nI'm the man with the shit but im loosing my brain\n10 years strong only the truest remain\nOh you need a couple facts? Check the charts when my shit drops!\nI'm doing this for us, thats a trust - FUCK HIP-HOP!\n\n[Hook] x2\nCos I'm up till the early morning\nWriting these rhymes same day I record them\nNeed a brake that's what they keep telling me\nStill the same Kers looking for a felony\n\n[Verse 2]\nYou say I changed like way to much\nI haven't changed once so wait you cunt\nI mean I got a lot fresher when I got a fucking cash flow\nThat's no joke, blow smoke watch the ash, though\nThis is my whip yeah I bought it out-right\nThey used to say I was broke yeah now try!\nMother fucker I can hustle my shit\nSnowy mountains if I cum on your tits\nLet me get into the shit no-one do it like me\nThat's why you so damn attached it's the truth when I speak\nAn you watch me rise up, climb up and ride up\nThanking my fans every track I'm your life brah\nCos I'm here I ain't ever going no where\nBut if they get me killing me back man you better swear\nI ain't scared I'm prepared for the future\nSo many haters, lets see if they shoot brah\n\n[Hook] x2\nCos I'm up till the early morning\nWriting these rhymes same day I record them\nNeed a brake that's what they keep telling me\nStill the same Kers looking for a felony\n\n[Verse 3]\nWe ain't ever gonna leave, we ain't leaving\nThis is spare time crush your chest you breathing\nI ain't wanna hear all the shit they talk 'bout\nRoom full of rappers? Then fuck it man I'm walking out\nI ain't wanna hear about your next CD\nUnless I'm riding with you, otherwise leave me\nI'm in my own zone standing on the top of shit\nOnce a month for 4 years I've been dropping hits\nThat includes albums every year too\nFuck a hater I can see shit with a clear view\nAn they told me chill why you always angry man\nCos you hated now you back here as a fucking fan\nWhat am I meant to do welcome you back\nYou doubted at first I should belt you for that\nOnly joking man a fan is a fucking fan\nSupport me I got you I'm the fucking man (im the fucking man x4)\n\n[Hook] x4\nCos I'm up till the early morning\nWriting these rhymes same day I record them\nNeed a brake that's what they keep telling me\nStill the same Kers looking for a felony"}], "artist": "Kerser"}