{"artist": "Canibus", "songs": [{"title": "Curb Your Ego", "album": "Full Spectrum Dominance 2", "year": "2018-09-07", "image": "https://images.genius.com/fea25ba78bd67acfe5ae5963f098c1ed.804x804x1.png", "lyrics": "[Intro]\nAlright fellas. Listen, let's get real this morning, you gotta kick the ego, to the curb. You just gotta get it, and kick it, and throw it to the side. The male ego has a tendency to create more damage, than good. And a lot of times, our ego, simply gets in the way\n\n[Hook:  Seven Spherez]\nYo it's the murder prequel serving heat at the third degree, bro\nYou rappers need to stay in your lane, and curb your ego\nHurt the beat, burning MC's with the verbal free-flow\nYou rappers need to stay in your lane, and curb your ego X2\n\n[Verse 1: Seven Spherez]\nIt's the ravenous rap savages, damaging wack amateurs\nTrapped in a black cavern, the hazardous track ravellers\nSnap on you cats, snack on you rappers that act fabulous\nBacking Jack, when I flatten twats in their jacked amulets\nFantabulous, feel the wrath of these gas canisters\nAll you rappers with lax to the track landed with Canibus\nHandle this biz right, spit light, like the hammer click\nThe only time you shoot with those cannons is snap camera pics\nRap vandalist, with his hand on the can, angling\nDangling off the building, revealing the craft's manuscript\nPlanning shit with candles, ripping anarchist with ganja lit\nPopping tags, till I'm fucking drowning in Mandarin\nHand in the throne, battle your clique while I stand on my own\nBut rappers are running from me like I'm standing here banging the chrome\nMy hand when he strangle a clone\nThe seven we gang to the bone\nStep into the cypher get beheaded like Ann Boleyn [?]\n\n[Verse 2 | Canibus]\nAight, enough about him, let's talk about me\n'cause every now and then I gotta speak my piece\nI could curb my own ego and still get it off\nWhen I walk I break off chunks of Himalayan salt\nI receive my blessings from projecting my love\nI'd rather do that than stain swords with blood\nEasy-peasy rice and cheesy but don't get touchy-feely\nGet punched in the neck for being greedy\nMy living quarters are cold with poisonous mold\nBeen living down here since zero years old\nIn the name of the Creator, I rose\nRemove the millstone from my own neck bones, so i can spit what I wrote\nIn return, I was enhanced manifold and saw spiritual growth\nFor you to find out and for me to know\nHow I weld words together, separately plasma cut into letters\nA ripper forever, nobody do it better"}]}