{"artist": "Half A Mill", "songs": [{"album": "Da Hustle Don’t Stop", "lyrics": "[Verse 1]\nUh woke in the mornin hoped out the water bed kissed my boo\nSee I'm known to shake their ass like Mystcal\nIf maggot was a school I'll be principal\nThere be no more boarder Ed just broader head\nPushin Ford Humvey, got hoes all cross the country\nDon't get it confused I'm gangsta, dunn my guns squeeze\nMy gators cost too much run from D's, cranberry and yellow\nThe illest nigga since Rockafello\nThe realest nigga since 'Pac, straight off Death Row\n17 Karats on my left toe, bitches grab on and can't let go\nI understand that's your wife dawg but thats my best hoe\nNigga hello, drop bow's on 'em and lose your elbow\nChanelle flow straight paper, been to more places than Melrose\nPeep the view, call your hoes when I'm rollin through\nCuz I might whisper in her ear, Only You\n\n**repeat 2X**\n***In my world, Only You, things I do for a love\nWhat I would do for a love***\n\nUh, what?, Only You, knawmean baby?\nIf you make me do things I will not do\nStraight ma, uh Only You, things you make me do\nGet that money girl, for real though\n\n[Verse 2]\nBrand new ride, trench coat made out of Camel hi\nMill Latin, is this still Manhattan?\nGucci draws, 50% silk, 50% satin\nOne love to Biggie Smalls, Illmatic, Guerilla action\nI spend in caption foreign countries\nBroads want me cuz I break 'em hoes\nTake good girls and make them hoes\nAss naked in the Range Rover\nI'mma filthy get your damn stove\nI had your bitch sayin \"you wanna fuck me\"?\nAnd head for bank roll\nI felt that buck v, mafiaso like Bugsy\nPour VSOP hennesy in cups of tea\nKi's of herion from England, Opium cut wit Dutch cheese\nBorn hustler fuck wit me, son you just a customer\nYou rather duck for me\nGun Delero, no scare crow or duckin me\nI grab your baby moms and make her sell that buck for me\n\n**repeat 2X**\n***In my world, Only You, things I do for a love\nWhat I would do for a love***\n\nYea, Half-A-Mill-ion the don, ya know?\nYou know what you make me do\nAt long as you get that paper, I do anythin for ya\nYou know what you make me do?\n\n[Verse 3]\nLobster and Shrimp my son'll tell you pots or pans?\nAnd I'm still street, make thugs hop the fence\nWhen I'm lettin off your fiance will call the wedding off\nHow she gonna marry a nigga -- when his head is off?\nI rock Maury Gotors suits playa you in terry cluafs\nI'm the bomb ask your mom, I drive some cherry's off\nI spit game, my words is wisdom, they got sherry's lost\nWent from sherry's to pour, braddy to abroad\nI know your shit is hot but dawg I got a deadly assault\nUrban Kelly main Virgin Mary berry or cross?, Religion\nIll coupe dawg, just for pigeons, bullet proof engine\nLay back the roof is missin\nAnd everytime I smile my tooth is gleasin\nGet money like the Rasta child\nToo smooth to get high style, just watch out\nOnly You girl that's what I'm 'bout, watch out\nOnly You girl that's what I'm 'bout\n\n***In my world, Only You, I'mma do for a love\nWhat I would do for a love***\n\n[Outro: Half-A-Mill]\nWord!, Only You baby, uh things you make me do\nUh, just keep them papers rollin through\nUh, youknow?, I got what you want\nYou got what I need, uh, the new\nWhat I would not do baby, Only You\nWoooo!, youknow, this joint here is just for you\nFor doin the things you do\nYea, uh, Ali Baba, Half-A-Mill, aka, Mill Latin\nMore than just tripple platinum ya heard?\nGarfiya cartell, uh we drop the bomb shells\nYa heard? (ain't nuttin but word, bitch ain't nuttin bird)\n***laughter***", "year": null, "image": "https://images.genius.com/cdace55ea46853fe392a282bca193979.600x600x1.jpg", "title": "Only You"}]}