{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "Central Booking", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "TARIQ (NARRATION): It’s plain to see I was set up by Tru. But why? Could he still be jealous of me? First, it was rhyming, then, my record deal, and now, bigger drug sales. Damn! How I’m gon’ explain this? Caught with a hooker, guns, drugs? My moms and my girl gon’ flip on me! The worst thing is, if I rat on him, the organization gon’ kill me! I’m fucked!\n\nOFFICER O’MALEY BITCHKOWSKI: Okay, punk! I think you know the routine!\n\nTARIQ: C’mon, don’t I get one call?\n\nOFFICER O’MALEY BITCHKOWSKI: Not ’til you talk to the captain!\n\n[*door opens and closes*]\n\nOFFICER OB: Here’s the scum, Captain!\n\nPOLICE CAPTAIN: Take a seat! … Hmm… I just got your résumé!\n\nTARIQ: Résumé?\n\nPOLICE CAPTAIN: It seems as though you’re a good kid. No prior convictions. Why?\n\nTARIQ: Why? Yo, wh— What are you talking about?\n\nPOLICE CAPTAIN: Don’t play games with me! Tell me who’s your boss!\n\nTARIQ: Can I make my call now?\n\nPOLICE CAPTAIN: Bitchkowski! Give this punk his call! Get him out of here!\n\n[*door opens and closes*]\n\nOFFICER OB: Here! You got two minutes, punk! Use it wisely!\n\n[*phone picks up, dial tone, phone clicks*]\n\nMOTHER: Hello?\n\nTARIQ: Hello, ma. I’m in a little bit of trouble\n\nMOTHER: Baby, what is it? What’s wrong?\n\nTARIQ: Ma, I’m in jail. The third precinct\n\nMOTHER: What?!\n\nTARIQ: I— I— I can’t explain now, ma. Just get me out, please? C’mon!\n\nMOTHER: Okay, I’ll call Tru!\n\nTARIQ: No, ma! Not Tru! Trust me. Not him\n\nMOTHER: Okay. I’ll send the Reverend. He’ll know what to do\n\nTARIQ: Cool, ma, whatever. Please, just get me out of here. We’ll talk about it later\n\n[*phone hangs up*]\n\nTARIQ (NARRATION): This was definitely the worst time of my life. Locked up, set up, and fucked up. And I got two days ’til my meeting with the Wu. Damn. I don’t know what I’m gon’ do. I guess I’ll just sit and wait ’til the Rev gets here\n\n[*jail bars slide closed*]\n\nCONVICT 2: See yo, it ain’t going down like that. Don’t play me like that. Don’t play me, man\n\nCONVICT 3: Can’t leave ‘em up in this motherfucker…\n\nCONVICT 1: Aight, man, let’s just— Aye, man. Aye, y’all niggas tripping, man! Y’all better give back my man’s shit, man! Just give it back, man!\n\nCONVICT 2: Yeah…\n\nCONVICT 1: Just, fuck it, man, just give my nigga’s shit back!", "year": "1999-02-23"}]}