{"artist": "Ice Cube", "songs": [{"title": "Integration (Insert)", "lyrics": "[Malcolm X]\nSpeaking as a Black man from America, which is a racist society, no matter how much you hear it talk about democracy, it's as racist as South Africa or as racist as Portugal, or as racist as any other racialist society on this earth. The only difference between it and South-Africa: South-Africa preaches separation and practices separation; America preaches integration and practices segregation. This is the only difference. They don't practice what they preach, whereas South-Africa preaches and practices the same thing. I have more respect for a man who lets me know where he stands, even if he's wrong than the one who comes up like an angel and is nothing but a devil\n\n[Louis Farrakhan]\nI don't agree with him because I'm not a follower of Muhammad myself. I think that all people have been mistreated in some form or another, but I don't agree with him; I don't follow Muhammad. I don't think anyone should follow one man; I think they should follow their own conscience. I think the main problem of most negroes is that they feel sorry for themselves, and I think this keeps them back much more than they would be if they didn't feel so sorry for themselves\n\n[Malcolm X]\nIf Martin Luther King, Roy Wilkins or any of these compromising negroes who say exactly what the white man wants to hear is interviewed anywhere in the country, you don't get anybody to offset what they say. But whenever a black man stands up and says something that white people don't like, then the first thing that white man does is run around and try and find somebody to say something to offset what has just been said. This is natural, but it is done\n\n[Louis Farrakhan]\nYou know what I think? I just think you've given up. (Given up on what?) On the ideal of an integrated America, the dream of Martin Luther King, I think you've given up. This is not, I'm not trying to be a smart alec, I'm telling you honestly that I think you've given up\n\n[Louis Farrakhan]\nYou know, it's interesting how white folks sit here thinking that I have a reason to lie to you, as though you are so powerful, and you are so wonderful, and I am so ashamed of my words, that I have to twist and turn. Please. You're not dealing with that kind of man. You're dealing with a man who means what he says and says what he means. Now listen", "image": "https://images.genius.com/aa204256470ef9ed3c3a3fbcc1ee43da.1000x1000x1.jpg", "album": "The Predator", "year": "1992-11-17"}]}