{"songs": [{"image": "https://images.genius.com/0c2b6ab5b12521682ccf377202642c09.600x600x1.jpg", "album": "XXX", "title": "Blunt After Blunt", "lyrics": "[Verse 1]\nKush got a nigga feeling awesome\nAte that bitch pussy 'til she squirted like a dolphin\nTold her bend over, hit that shit doggy\nCalled her a cab then I told that bitch to call me\nDanny Brown bitch, tell me what you need\nI got some Adderall and fire ass weed\nAnd they try to tell me I get too high\nThat's a lie, if so, bitch, I woulda been died\nBut the flow OD, don't get cochesed, capiche?\nFuck with me, fuck around and be deceased\nRest in peace wack niggas with your oversized clothes\nComplain about my jeans cause I'm taking all they hoes\nHold up, wait a minute\nYour pussy ain't shit 'til you had some Danny in it\nI'm gone off a Xanny nodding off watching Menace\nRolling on some purple that my nigga call Grimmace\nBitch I ain't finish\nThese bars was test tubed in the lab with foreign chemist\nRolling testers on it but statistics got slumped\nI'm smoking blunt after blunt\n\n[Hook]\nAnd I smoke\nBlunt after blunt, after blunt, after blunt, after blunt, after blunt\nAnd I smoke\nBlunt after blunt, after blunt, after blunt, after blunt, after blunt\nAnd I smoke\nBlunt after blunt, after blunt, after blunt, after blunt, after blunt\nAnd I smoke\nBlunt after blunt, after blunt, after blunt, after blunt, after blunt\n\n[Verse 2]\n'til my brain feels ten pounds heavier\nYou fell off like Tom Selleck in a Celica\nBitch give me brain for the hell of it\nBut to her it's heaven even if she gets a smell of it\nThat's why these bitches fuck with me\nCause I eat that pussy like a female MC\nYou get it? How about me and your girlfriend, you with it?\nMoney over everything the only thing that matter\nAnd since I been getting it my been blunts getting fatter\nTake a couple puffs off it now a nigga woozy\nThe white hoes I fuck with consider them whooties\nWe 'bout to make a movie, starring me and a cast full of groupies\nAnd I do my own stunts, I'm smoking blunt after blunt\n\n[Hook]\nAnd I smoke\nBlunt after blunt, after blunt, after blunt, after blunt, after blunt", "year": "2011-08-15"}], "artist": "Danny Brown"}