{"songs": [{"year": "2001-10-16", "image": "https://images.genius.com/8af6cd69d2d9ed7258d80228afce41de.220x220x1.jpg", "title": "Nasty", "album": "1 Less G n da Hood", "lyrics": "[Intro]\nYo Blaze you so nasty, you know you nasty\nMan you so nasty, you know you nasty, yo Blaze you nasty\n\n[Verse 1]\nScabs and bubble gum, peanut butter on ya toe nail\nFlickin' boogers in ya ginger ale\nGet's my chain, bust ya in the face\nThen wipe my butt, so now it's kinda itchay!\nDrink doosh bags like wine coolas!\nAnd throw gang signs for all the old schoolas!\nI stuck an AK in a hood rat booty\nCause I found out she was a groupie!\nIf I blow ass, you gonna know fast\nAll y'all gone' need a fuckin' gas mask\nI'm the yellow shit underneith ya armpit\nAnd when I talk, that's fine, cause I spit\nI'm like clay, wet, smelly and gray\nI wore the same clothes forever and a day\nNow you can hate me and try to say I'm trashy\nAnd if you go & ask somebody, they'll tell ya that I'm\nNasty, that I'm nasty!\n\n[Hook]\nYou nasty Blaze, you nasty\nYou nasty Blaze, you nasty\nYou nasty Blaze, you nasty\nYou nasty, nasty, you nasty, nasty x2\n\n[Verse 2]\nI'll use Anybody Killa rubber, after him\nI ain't payin' shit and time's costin'\nMo money, and not enough veel\nWord to ya neden, I'm just tellin' the deal\nI suck the pus out my own pimples\nAnd spit it on yo ass and fill up the dimples\nI'm the lint, in ya belly button\nFuzzy like Moe, ain't that somethin'?\nI like to fuck chickens, then 'que'em\nBarbeque sauce on my balls just for screwin'em\nI go swimmin', in a port-a-potty\nAnd have shit and piss, on my face and body\nI like to party, with my pants off\nWhen my dick gets hard, smack it and it goes soft\nI'll suck the blood, out a Tampon\nI'm nasty as the mother fuckin' ground that I stand on\n*Anybody Killa*\"Only if you standing in a pile of shit!\"\n\n[Hook]\n\n[Verse 3]\nI stay funky like a doo chip, I wipe\nSnot on your bed spread, lil' sister pussy lip\nI got mice sleepin' in the holes in my back\nI tried to evict'em, they said fuck that!\nDirt under fingernails, wounds don't heal\nSkrimp on my double burger, value meal\nTake home some hookers, with no teeth\nBut still got lips and loopy ass cheeks\nI'm the melted ice cream covered in ants\nGot dried blood and guts on my favorite black pants\nThis one freeky bitch, tried to piss on me\nSo I sit on her, so that she can see\nThat killas don't swing like that\nSo open the neden real wide, and I stuffed in a rat\nWhy you think all the hoodrats ask me\n\"Blaze why the fuck is you so damn nasty?\"\n\n[Outro: Violent J]\nShut the fuck up bitch"}], "artist": "Blaze Ya Dead Homie"}