{"artist": "PARTYNEXTDOOR", "songs": [{"album": null, "title": "Break Me Down", "image": "https://images.genius.com/70ea7995fd5b65d8bafe8d6b5401fe32.700x700x1.jpg", "lyrics": "[Intro]\nYeah\nEver since I was a kid I said I was gonna deal with this personal shit on my own\n\n[Chorus]\nAin't this what you wanna see?\nMe breakin' down, huh?\nAin't this what you wanna see?\nMe breakin' down\nYou love to see me breakin' down\n\n[Verse 1]\nGirl, you don't say much, ah\nIs it too much to ask you\nTo look at your reflection and ask yourself, oh\n\"Do you need me how I need you?\"\nI brought you to California, for what?\n'Cause right now you're so, so sick of my guts'\nYou got me out here hittin' my crunches\nYou got me out here skippin' on lunches\nI wanna be per-per-perfect for when the next time I see ya\nIced up, baby, I'm drippin', drippin' like my jeweler\nBallin', baby, need a hoop for your Hula, woah\n\n[Pre-Chorus]\nYou the, you the, you the baddest bitch [?]\nBeep, beep, put you through crazy things, baby, you a trooper\nBut you done, done, done, baby you done, done, tired\nBaby, you done, done, fuckin' with me\nYou done, done tryin'\nHey, hey\nCall me, call me, call me, call me, call me, call me\nHey, woah, px\nCall me, call me, call me, call me, call me, call me, yeah\n\n[Chorus]\nAin't this what you wanna see?\nMe breakin' down\nAin't this what you wanna see?\nMe breakin' down\nI feel you love the fact that I'm breakin' down\n\n[Verse 2]\nReal life, geek\nMy fiancé emailin' me, instead of FaceTimin'\nTalkin' 'bout some real time\nAway from me, space (hey)\nBaby, baby, baby, please, please, please, please\nBaby, I need peace, peace, peace, baby\nThey don't understand, I got a bigger plan\nThey don't know what they see in me, baby\nOnly you understand, oh-woah\nHelp me sleep easy like a Xan, woah, woah\nHelp me slip in and out that jam, woah, woah\nBut I don't think you see that though\nI'm lying, baby girl, you stole ten grand from the safe\nHow I'm supposed to feel safe?\nBaby girl, this rocks was for you\nHow you still actin' like groupie?\nWhy you act like you don't know me?\nBefore all the K's, Kylie's, and Kehlani's, whoa\nWhy you do me this way?\nMust be how it go when you crack the Drake code, Draco\nBo-bo-bo-boom, red-bottom baboons\nYou say this too soon, I say this too soon\nThey say this too soon, but I want you right now, baby\nI'ma get it right, I'ma get it right\nCross my heart and hope to die\nPromise to cross my T's, promise to dot my I's\nI don't wanna want but I know what a nigga need\nYeah, baby girl, it's you, woah\n\n[Pre-Chorus]\nYou the, you the, you the baddest bitch [?]\nBeep, beep, put you through crazy things, baby, you a trooper\nBut you done, done, done, baby you done, done, tired\nBaby, you done, done, fuckin' with me\nYou done, done tryin'\nHey, hey\nCall me, call me, call me, call me, call me, call me\nHey, woah, px\nCall me, call me, call me, call me, call me, call me, yeah\n\n[Chorus]\nAin't this what you wanna see?\nMe breakin' down\nAin't this what you wanna see?\nMe breakin' down\nI feel you love the fact that I'm breakin' down", "year": "2017-08-24"}]}