{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/cb2de89be16cfafd680c13fe5fd48c85.1000x1000x1.jpg", "title": "Enjoy the Magnamity", "year": null, "album": "Aztec Yoga 1", "lyrics": "[Intro]\nCheck, check\nKool, move, historical\nMagnificent, adorable, horrible man\nKool A.D\nSee me now, hear me now, wow, beautiful\nAnything, everything\nHundred dollar freestyle, beautiful songs for your mental mind state\nEverything, yes\n\nHey, yo\nAbolish prisons\nFuck prison reform, that's still slavery, simple and plain\nNo poetry could ever explain all the truths of that statement\nYo, movin' on, get used to the way I slay\nIt appears that I'm here to stay, Kool A.D.,\nChase the fear away, never said I was perfect and ya'll never expected that, hopefully\nAll ya'll expected was raps and ya'll got to admit I stay wreckin' at that\nSome ya'll haters wanna nitpick\nSay this record is whack, or the other little record, or that one, wasn't up to ya'll fuckin' imaginary standards\nYour boy about freedom, what the fuck is a standard [?]\nI close my eyes, go shine like a lantern, even\nEl rey [?] cero\nEl nieto, the grandson, even\nStyle was like that of a Grand Canyon, even\nDead presidents\nHit em with the cannon, even\nGive 'em a little Spanish, even\n[Toma te gusta ?], even\nYo, dog, I'm a beast, I get loose with it\nGolly, I'm juice, I'm a fool wit' it\nI try to make conscious rap, but I'm too dumb\nThey used to call me Dum Shiny\nThree ghost poster beneath the little pine street\nMy inventions is timely\nKool even, cold even\nEvil is a terrible notion to even fathom, I'd rather not\nHeh, my vibrational [sand lost carbon is impasse?]\nCuss, I blend fast, I trust, I'm in raps\nOut of the skin of the fallen zebra\nYoung, proud, tall, and eager\nYes, ya'll in with the best of all of em\nThe lessons afforded only slightly less than important\nWho cares?\nYo, who bares the collective responsibility of language but We the People?\nWhat do we hold to be evident?\nMy poetics is elegant, relevant, totally\nI know you love that\nYou know it's me\nThey bust, bust back\nThat's been the poetry ever since the fuckin' genesis\nBring all of your mens in, and everybody go and do whatever then doggy\nI'm a thug in the gentleman\nA druggy little hood boy doin' my thing\nI'm a cook, I'm a chef even\nA blessed reasonably seasoned and trained\nGoin' like train, I'm blowin' mayne, Novocaine, holy game\nLadee-good-golly Hollywood Bollywood Nolliewood\nOn the guest list, all three, yea I'm prolly good, check it again, see, there it go\nOops, what, wait, where he go? There he go\nNevermind, clever mind, movie, genius, honey did, money clip\nFast forward, rewind, the clip go back in the, see me mix\nMatchin the mix, master cut faster, beep\nJugglin', feet shufflin'\nYou and me, plus, um, the other man\nDamn, the brother man\nYour whole fuckin' fam\nYo, like it was a small fuckin' government, dough boy, run Munna\nOoh, young rubber band, type\nNo hoe, joy get suppered up\nSucker punch, uppercut\nRun, dash off to the palace and whatnot\nDo whatever man, everything is everything\n\nVibe on the concepts, figure your hustle out\nVision the levels and level up\nYo, move from the window to the other spot\nThe wisdom of the elders\nBut [innovate?], renovate outdated concepts\nNow play the context of how you're really feelings play out into emotional larger feels\nThrow devotions at the oceans and fields\nStars in the sky, mountains and trees, Sun, Moon\nThe realest aspects of the fabric of reality\nTruly enjoy the magnamity"}]}