{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/c347081c7afabbcba96aea0847886344.758x738x1.jpg", "title": "A Thug’s Love Story (Chapter I, II, III)", "year": "1998-10-20", "album": "Roots of Evil", "lyrics": "[Chapter I: Kool G Rap]\nI know this chick, yo mami is rich, she push a six\nLivin' some bloodshed, her man pushin' bricks\nCrib way out in the sticks, they house lookin' slick\nIt's like some shit, straight out of a Hollywood flick\nMe and my clique, met the chick up at Saint Nicks\nHoney was thick, I was the first nigga to kick\nYo mami was thick, silk skirt with thigh split\nI couldn't quit, tryna peep out the privates\nThe live shit, you know how loose I get\nI'm schemin' on her back, peeping her hips, fiendin' to hit\nPlump cherry lips, medium tits, Chink eyes her baby hair chick\nThe type you want to pair with, have an affair with\nWe chattered a bit, slipped me the digits, to the hip and the phone flip\nSaid she had to split, hopped in the whip, headed up the strip\nProbably had to get with her man and shit\nLater on at night, I'm stressin' love at first sight\nSome ain't right, I ain't the type of cat likely\nTo be dealin' with mad feelings\nAnd even though mami was mad appealin'\nBody revealin' and big wheelin'\nThis shit is illin, I don't like it\nFuck it, I can't fight it\nI'm reachin' for the cordless to call Miss\nI insist, to get with this\nTan Tone answer the phone, \"Hello, who's this?\" (chick)\n\"It's me baby, G Luciano, what up lady?\"\n\"Fine and how you doin' boo?\" (chick)\n\"Ain't nothing new but you, angel, yo why don't you swing through?\n\"We could sip on some champagne from Spain boo\"\nAbout an hour or two she came thru, fly hairdo\nWe link, push in the six circle circle drink\nTo purple mink, had mad bank, Chanel bag full of Benjamin Franks\nMore ices than a hockey rink, face of a Saint\nWent for a drink, open windows, a spot for our shots\nWould wanna spend those, five digit o's, on busty bimbos\nBar closed, back to her six double o, she drove\nMy eyes closed, her nigga dozed, when I awoke\nSaw mad snow, we at her spot at the Poconos\nBridge robes, crib hot as a stove\nShe changed out of her clothes, put on a silky bath robe\nPanty hoes with see-through holes, pretty toes\nTook me into the master suite, shit was sweet\nJacuzzi four feet deep, with satin sheets\nAs I was speakin' to this half black/latin freak\nMet on a Manhattan street, body petite, fat in the cheeks\nI was gettin' open, started, laughin' and jokin'\nWe weed smokin', strokin', the shorty spoke and\nSaid what the deal is, the realness\nMy man is crazy as Bruce Willis\nIf he catches, he'll try to kill us\nHe got a whole army of killers\nMe no worry, I gots the clapper son\nEnd of the first verse, chapter I\nWord\nShit is real in the field\nThug love story\n\n[Chapter II Intro: \"G. Luciano\"]\nSo here I am\nLaid up in this lavish house, up in the Poconos\nWith this chick I don't even really know\nSteady stressin' me how ill her man is\nSo what I go and do, heh-heh, I nail her ass to the bed anyway\nStraight twistin' mami's back out\nHit three o'clock, fell right the fuck to sleep\nClothes still on, breath smellin' like Henrock\nTotally no kind of regards for this bitch's man\nI guess it's just another one of those G Rap adventures\n\n[Chapter II: Kool G. Rap]\nThe next day about a quarter to eight\nI heard a squeak on the staircase\nGot the gat from under the pillow case\nSomebody broke in, now me and boo fully awoken\nGood thing I slept inside my clothes and, shorty was frozen\nI'm waitin' for a head to poke in, and start smokin'\nThe home invasion, right through the door, they started blazin'\nBullets was grazin', shit was crazy kid\nI had to think fast, let the gun blast, duck, then dash\nHeard a crash, they broke through the door, they on her ass\nJumped off the balcony like a falcon Gee\nWith honey right in back of me, feel on top of the snow in agony\nShit was thick, couldn't get to the six, they loaded the fifth\nSaw the snowmobile yo fuck it\nWe start jumped it, get on top of the shit and peeled\nMad soldiers out in the field, bustin' they steel\nThe raw deal, kill or be killed, shit is real\nTen hit me right on my heels, tryna make a thug's blood spill\nIn zero degrees, niggas on skis, me and these Gees\nSlipping through pine trees, we skid up behind these\nTwo big rocks and left off shots, about four dropped\nThe other six started to pop, felt somethin' hot\nI think I got hit, my jacket is ripped\nLoaded my last clip then broke out quick and checked the chick\nShe on my back tighter than shit, like vise grips\nI started clappin', niggas rolled up in blue and black and\nSpotted this Rover by a log cabin, we got our ass in\nMash the gas, make the fuckin' wheel spin\nThe safety again, and still doin' a hundred and ten\nShorty shiverin', lip quiverin', ski suits up in the back seat\nPulled over the Jeep, get it in\nAnd took a rest stop at the river bend\nWe livin', made it the fuck out, mad slugs deliverin'\nPretty soon we at my rest piece, up in the bedroom\nGot shorty boo, tendin' my bullet wound\nPut on some tunes, she blew my shit like a balloon\nUp in the moonlit room, and dickin' her womb\nHittin' full behind her, grindin' her with my anaconda\nShe rode the dick like a honda\nI took her to the point of no return like Bridget Fonda\nShe back spasmed, givin' the crazy orgasm, from steady rhythm\nMy dick glistened, her lips hit 'em, I shot jism\nThen laid back in the sack and lit the ism\nI thought about the realism\nNiggas comin' and bring they steel with them\nI got just the thing to deal with them\nNickel plate Mac, the laser attached, with two clips packed\nPush a nigga whole head back, so I snatched that\nSo quick spray out, and play the layout\nStill on alert, me and the skirt, day in and day out\n\n[Chapter III Intro]\n[\"G. Luciano\"] Yo what's the matter mami, you scared or something?\n[\"Mami\"] I'm a little worried baby\n[\"G. Luciano\"] Yo, don't be worried about nuthin', alright?\nEverythin' gonna be alright\n[\"Mami\"] OK\n[\"G. Luciano\"] Look, we just gonna go to your house, go get the money\nYou know, we gonna get your backs or whatever\nAnd we gonna get out of there, alright?\n[\"Mami\"] Alright, ven paca papi, dame un besito\n[G. Luciano] Alright, alright grab that bag money\n[Mami] Let's do this, baby\n\n[Chapter III: Kool G. Rap]\nAfter three whole days of lampin', we broke camp and\nWent out to the beach, many mansions out in the Hamptons\nBrung the clamp, ready to shoot shit up at random\nFive hundred grand is buried in the sand\nWe plannin', up in the crib-o with big windows, I'm countin' the dough\nShe packin' her clothes, had her Lexus in the back of the Rolls\nI saw the keys, I grabbed the G's, we on and took those\nShit was sittin' on some chrome momo's\nTinted windows, a LS Ford double O\nTold the chick; \"Yo you movin' too slow\nSpeed it up baby, we got to go\nAnd get this plane and, hit the Caymans\nWith the payment\", somebody came in\nA platoon of goons with heaters aimin'\nI drew the Mac 10 and started flamin', they did the same and\nSlugs sprayin' and blood rainin', I left about seven thugs layin'\nBut this one cat was gainin', he grabbed the dame and\nPut the heater to the chick's brain and\nI let my two guns drop, they got the drop\nThey took us both to a boat dock, then on a yacht\nThe chick's man was there with a sixteen shot\nNigga was hot, took the Glock and hit me dead in my knot\nHoney started to panic and yellin' that money in spanish\nThinkin' he's out to take advantage\nSo we're out in the fuckin' Atlantic\nWith no lifesavers and stranded\nBackhanded the chick on the floor, called her a whore\nSaid, \"Amor, you won't be pretty no more\"\nTook us on a tour, down in the deck\nGuess he wasn't ready to kill us yet\nSaw this nigga there, holdin' the Tec\nReady to wet, I started to sweat, a niggas stressed\nWe up beside a horrible mess\nI saw a box with the letters on it, S.O.S\nSo I took out a flare gun and shot the kid in the chest\nTook the Tec from out his hand, now I'm ready to bless\nThe madness, put the rest of them niggas to rest\nLooked around, the chick's man was the only one left\nThrew his ass over board and told him \"Hold your breath\"\nCaught my breath, I seen honey down on the deck\nEyes closed with a bullet hole dead in her breast\nHeld her in my arms till her soul finally left\nI'm mad depressed, my baby was an innocent death\nA real thug, lost the only women he loved\nAnd I bugged, bustin' slugs at the skies above\nWord"}]}