{"songs": [{"image": "https://images.genius.com/ee6c6181ebd522da5b345ff9cd0a61f9.1000x1000x1.jpg", "title": "CG 2", "album": "Nellyville", "year": "2002-06-25", "lyrics": "[Intro: Nelly]\nI tell ya what\nYo, know what I'm feelin'?\nCheck it..\n\n[Hook]\nMmmm..\nI'm comin' back down baby\nThis time in the six fo'\n(Since we came down wit mo' sho' than the first time\nI thought I'd go trade the Rover in for a six fo' this time)\nA lil' mo' sho', listen to the switches go\nZoop, zoop.. zoop zoop zoop\nZoop, zoop.. zoop zoop zoop\nMmmm..\nI'm comin' back down baby\nThis time in the six fo'\nA lil' mo' doe, listen to the switches go\nZoop, zoop.. zoop zoop zoop\nZoop, zoop.. zoop zoop zoop\n\n[Verse 1: Nelly]\nYou can find me, same city, same state\nCarryin' more weight, fishin' wit more bait\nMore license plates than your DMV\nTakin' more total request than your MTV\nErrry, gaga, they call me Dada\nThe rookie wanna signin' bonus for that pu nada\nBut my, salary cap won't allow me to give a nada\nI guess she be a free agent until she find anotha'\nCall it fresh, for the D's on my ATVs\nAnd if I squeeze niggas fallin' like they last name Keys\nDirties please, watch me as I switch my steez\nFirst name GMC, last name Denali\nWhy the change? Yu-kon not fuck wit me\nEight batteries, four pumps where the trunk should be\nI hear the conversations, about Nelly he overrated\nI'm feelin' like Chris, slightly a little violated\n\n[Verse 2: Ali]\nNow what you lease I pay cash for, lit up like the dashboard\nWent from the PJ's to livin' out past Ford\nWhat the cash for? me to spend\nLike the rims on the Benz while you pretend to got\nI fuck twins from the back end\nBack to the club and backed in\nWent to the back end gotta announce we back in\nThe place where my crew go, iced out Jesus face and Parasucco\nBread sick I need your Pluto\nBlack Menudo, in the candy black two-door\nBMW Sport, check the Ra Report\nWhat you thought it was a widle? yea, them seats swivel\nCats be killin' me talkin' ballin' and can't dribble\nBits in the Kibble, mnage trois was civil\nCrystal y'all, head from all, 18 ta' 80 bar\nHit the mall nigga, and shop 'till we fall\nAnd the bitches y'all be lovin' won't even bother to call\n\n[Hook 2x]\nMmmm..\nI'm comin' back down baby\nThis time in the six fo'\nA lil' mo' doe, listen to the switches go\nZoop, zoop.. zoop zoop zoop\nZoop, zoop.. zoop zoop zoop\n\n[Verse 3: Kyjuan]\nI'm comin' down down, baby, duck when you see me\nWhen Kyjuan comin' the spray, yo it ain't graffiti\nNo I don't eat bullets, but I'll feed the needy\nThrowup a L, but I won't smoke a L at the city\nTruck is big, tires is meaty, yes indeedy\nExcursion, lime-green so I know that you'll see me\nKy-Weeze done brought them cars out\nNo doubt, like numba' 3 on Free City CD\nIt not a game, I went from a GS to a LS\nAnd LS don't mean low self-esteem\nSo clean, cats think I sip Ajax suit Vokal\nNights mis-match , hard from Zat\nI smoke herb, but what's the harm in that?\nHey Mr. Officer, where Clarence Harmen at?\nOnly got caught once, where my warnin' at?\nBeen in St. Louis all my life, ain't seen a farmer yet\n\n[Verse 4: Murphy Lee]\n(Back in 1993) Was when a school boy decided to be an MC\n(See some said no, others said fa' sho)\nAnd now we comin' back down, this time in a six fo'\nZoop zoop, open ya mind up for this lineup\nNo, we don't pitch but rich is how we wind up\nSituations, entrepreneurs get dollars and new toys\n(wait 'till they get a load of my Impala!)\nWe back back, matter fact goin' down down\nYou people need to calm down, Spreewells only goin' round\nActin' like you neva' seen a car dance befo'\nThey be askin' how does it feel like D' Angelo (how does it feel)\nPicture wakin' up, all weed, bomb weed\nPalm trees, no kickin' it on the beach\nHave to work all day, dirty, 3 P.M. to 3\nBut at your local ATM you can find Murphy Lee\n\n[Hook 3x]\nMmmm..\nI'm comin' back down baby\nThis time in the six fo'\nA lil' mo' doe, listen to the switches go\nZoop, zoop.. zoop zoop zoop\nZoop, zoop.. zoop zoop zoop"}], "artist": "Nelly"}