{"artist": "Andy Mineo", "songs": [{"title": "Vendetta", "album": "Uncomfortable", "year": "2015-09-18", "image": "https://images.genius.com/9a23efdbe421de59647ed95b73952a34.1000x1000x1.jpg", "lyrics": "[Intro]\nI told you so, I told you\nWe are the ones, yeah\nCause 'Pac (What?) did a lot more for me than Barack\nSalute\nLa, da-da, da, da, da, da\nWe're not afraid to lose everything we got, nah\nCause all we really got is our word, word, word\nThe pen is greater than the sword\nLa, da-da, da, da, da, da\n\n[Verse 1]\nBy the people, for the people\nSeem like you only look out for your sort of people\nI look around, it's more evil\nGotta see it in me\nYou see, um\nEveryday we closer to that funeral\nEveryday a struggle, but the struggle still beautiful\nAnd doctors don't got patience for their patients\nSo they just send them to that pharmaceutical\nWe tell 'em that they need drugs\nBut I know that they need love\nI ain't scared of that war or the violence\nThe thing I'm more terrified of is (Silence)\nI wanna snatch my generation out this apathy\nGotta do that now 'fore this voice grow out of reach\nAnd what we feedin' people that's a tragedy\nSo what you want, the chemicals or calories?\nNobody taught us how to eat\nMomma gon' work the sixty hour weeks\nWhat's for dinner?\nWell, what's quicker and cheap\nYou got remote parents, you'll be raised by the TV\nMy momma worked the night shift\nStill made it out to every single game\nWhile my father sat at home\nI promise when I have my own that we will never be the same\nVendetta\n\n[Chorus]\nLook I told you so, I told you\nWe are the ones\nCause 'Pac (What?) did a lot more for me than Barack\n(That's a lot)\nSalute\nLa, da-da, da, da, da, da\n\n[Verse 2]\nLook, Mr., Mr. or Mrs. Government Official\nWe just won't listen\nYou can't relate to how we livin' from where you're sittn'\nThat's why the artist got more influence than the polititian\nThis my generation\nWe know the news never tell the truth\nSo we go to Twitter for our information\nIt's so fast, ya'll seem slow to us\nBy the time you print it tomorrow it's old to us\nWe are the ones that you used to be\nBrave idealists with a dream who went corrupted by the cream, yeah\nThis pen is not for sale\nThey nickel and dime'n\nWe still throwin' quarters in a wishin' well\nAnd I know you can't imagine losin' a lifestyle that you so used to havin'\nAnd, yo, we still make decisions for the fact that they're awesome\nNot just for the profit margin\nHold up, how I'm talkin?\nI got excess, others got need\nI gotta answer to God for all of these sneaks\nI got a hundred pairs, but only two feet\nGod forgive me, I've been thinkin' 'bout me\nWe point fingers at people who sin different, skin different\nBut the same color we bleed\nYou wanna know the real problem in America?\nAlways has been and it always will be, me\nIf you had any other answer you've been deceived\nWe've been lookin' for salvation in education\nMoney, leaders, and policies\nBut we got a bigger need\nWe got a sin debt that we inherited\nWe divide ourself by class, skin color, and our heritage\nWell, our Creator bankrupt the heaven so that we could all be there with Him\nBrothers and sisters\n\n[Outro]\nI told you so\nI told you\nWe are the ones\nCause 'Pac (What?) did a lot more for me than Barack\nSalute\nLa, da-da, da, da, da, da\nWe're not afraid to lose everything we got\nCause all we really got is our word, word, word\nThe pen is greater than the sword\nLa, da-da, da, da, da, da"}]}