{"artist": "Gangsta Boo", "songs": [{"title": "On That", "album": "Witch", "year": "2014-01-01", "image": "https://images.genius.com/37784bbab4e843076e5526cc31916bf6.640x640x1.jpg", "lyrics": "[Hook]\nOn that thug shit\nOn that drug shit\nOn that bullshit\nOn that devil shit\n\n[Verse 1: Lil Wyte]\nPocket full of drugs stumbling in the party\nI'll kidnap your ho and take her straight to Molly\nTake pictures with every bitch that's up in that party\nPut every bitch in that party on that same fucking Molly\nRock out with my cock out\nThey can jam out with they're clams out\nMe and Gangsta Boo up in this motherfucker\nGetting loose in this ho 'bout to jam out\nWe back up on that thuggin' druggin' boolin' devil shit\nThis some of that 2036 MAFIA mix level shit\nOn point like shark senses\nFuck with me my homies will smell the blood\nOn a one way ticket to hell you headed\nBeheaded with me no love\nI got real killers that did real time at all times on my left and right\nBetter think twice when you fuck with Lil Wyte\nAn extended clip can fuck up your night\nAlright?\n\n[Hook]\n\n[Verse 2: Gangsta Boo]\nI'm smoking like a motherfucker and I'm going crazy\nRiding with Wyte with a bitch with no babies\nY'all already know I'm back up on that ratchet shit\nGet wrong one time leave ya in a ditch\nBumpin' that new triple six\nYou niggas y'all know what it is\nYou high and you gone off them pills\nThat's why I'm just keeping it real\nI'm back on that old ass I don't give a fuck type legendary status\nI ain't gotta come with no hype\n99 problems but you hoes ain't one\nI don't fuck with ya I just fuck with y'all for fun\nI'm doing shit you can't\nI be all up in the bank\nLooking like a million dollars smelling like a pound of dank\nAye!\n\n[Hook]\n\n[Verse 3: La Chat]\nYeah, I'm a thug bitch\nYou drugs bitch\nI love the hood and my folks be on that bullshit\nGone catch you slippin' so don't play in Memphis\nWe 'bout that life so get right\nHope you pay attention\nThem goons they be lurkin' they come out at night\nMayne for yo' pockets then yo' wallet they will take yo' life\nClubbin' druggin' thuggin' all the way until the sunny light\nParty's at my house we live as hell 4sho we'll get you right\nBlowing nothing but herbs through my lungs got my mind blown\nDip it in that drank my words slurred now I'm super throwed\nFuck it, it ain't nothing else to do, so I hit up Boo\nWe so with the shit it ain't no telling what we finna' do\nWe thuggin!\n\n[Hook]"}]}