{"songs": [{"lyrics": "[Intro: Jay-Z]\nUh-huh uh-huh, UH!\n\n[Chorus: Jay-Z]\nBounce if you wanna bounce (right), ball if you wanna ball (right)\nPlay if you wanna play, floss if you wanna floss\nIt's alright, you heard? It's alright, Holla back\nYou can ill if you wanna ill, smoke if you wanna smoke\nKill if you wanna kill, loc if you wanna loc\nIt's alright, you heard? It's alright, yeah yeah\n\n[Verse 1: Jay-Z]\nBeitch.. I need a ho in my life to blow on my dice\nSo we can make our points twice and skate out of town\nI need that glow in my ice, E-Class\nLadies screamin' Jigga you know we needs that, flowin' out like Jees-ass\nThey ain't seein' me holdin' the mic\nSo when you like you find MC's so impolite\nAnd me I'm so into nice, got cats on the corner like\nDon't me and Jigga be flowin' alike?\nNah, not in your life ain't nobody poppin' like\nMr. Jay-Z, shit you're crazy\nI'm hot like the six, navy, deep dish with the gray seats\nI flow greater than your navigator\nI drop through your town, block the date up\nPimps all comin' through with a hot pair of gators\nAnd a crew with, rocks their the size of craters\nCan't be touched like hot potatoes, ya heard?\n\n[Chorus: Jay-Z (Memphis Bleek)]\nNow we can bounce if you wanna bounce, ball if you wanna ball\nPlay if you wanna play, floss if you wanna floss\nIt's alright, you heard? It's alright, holla back\nYou can ill if you wanna ill, smoke if you wanna smoke\nKill if you wanna kill, loc if you wanna loc\nIt's alright (YEAH), you heard? It's alright, holla back\n\n[Verse 2: Memphis Bleek]\nIn the middle of a war rockin' a vest\nWho's the illest shorty alive (who?), I confess\nI take lye to the chest and I swear to the heaven skies, I bless\nThe mics until the day I rest, to make you feel what I feel\nI'ma try my best, and if you real like I real\nYou can provide the rest\nEverything left out, you can blame it on the brain, not the heart\nI'm playing my part, stressed out, just about the best out\nAny nigga realer than me, is in a messhall with their chest out\nAny rapper with less clout, sell more records than me\nWe extort 'em as soon as they record 'em, Bleek\nI made this clear, back when shorty used to braid my hair\nOn the project stairs, once I drop to a caesar ma I don't need ya\nFrom the block to the hot two-seaters, ya heard?\n\n[Chorus: Jay-Z (Memphis Bleek)]\nGeah, now we can\nBounce if you wanna bounce, ball if you wanna ball\nPlay if you wanna play, floss if you wanna floss\nIt's alright, you heard? It's alright, holla back\nYou can ill if you wanna ill, smoke if you wanna smoke\nKill if you wanna kill, loc if you wanna loc\nIt's alright (YEAH), you heard? It's alright\n\n[Verse 3: Jay-Z]\nCheck, on the jew-els I blew more money than Latrell, who else?\nThey don't know you, think they know you too well\nYou jel like Flubber\nI hover above the city in a private jet, the livest set\nPress you're brakes, Feds wanna investigate\nMr. I don't cop nothing less than eight\nAnd anything involved with my name, regardless of the fame\nIt's hard, I can't even walk through Harlem again\nCharge it to the game, I'm platinum like American Express\nMy boy died, and all I did was inherit his stress\nTo make every jam tougher, you ain't my man fuck ya\nI should just let you live, right? Negative, I swear\nIt's dough or die, I hope your soul provides you with an afterlife\nClose your casket tight, take your last two deep breaths\nAnd pass the mic, to Jay-Z nigga, that's right!\n\n[Chorus: Jay-Z]\nNow we can bounce if you wanna bounce, ball if you wanna ball\nPlay if you wanna play, floss if you wanna floss\nIt's alright, you heard? It's alright, holla back\nWe can ill if you wanna ill, smoke if you wanna smoke\nKill if you wanna kill, loc if you wanna loc\nIt's alright, you heard? It's alright, holla back\n\nWe can bounce if you wanna bounce, ball if you wanna ball\nPlay if you wanna play, floss if you wanna floss\nIt's alright, you heard? It's alright\nWe can ill if you wanna ill, smoke if you wanna smoke\nKill if you wanna kill, loc if you wanna loc\nIt's alright, you heard me? It's alright, then holla back", "title": "It’s Alright", "image": "https://images.genius.com/31fbf5c324b9093ce0d8783fcad9b5ba.300x300x1.jpg", "year": "1998-05-12", "album": "Streets is Watching Soundtrack"}], "artist": "JAY-Z"}