{"artist": "Kirk Knight", "songs": [{"image": "https://images.genius.com/ce69a86964b19ae948fb69cd3977f7d4.760x760x1.jpg", "title": "5 Minutes", "year": "2015-10-30", "album": "Late Knight Special ", "lyrics": "[Intro: Kirk Knight]\nI got so much..\nSo much fuckin stress on my mind real quick holmes\nVibe for a nigga real quick, my nigga, you know what I'm saying?\nWord up, word is bond and all that\n\n[Verse 1: Kirk Knight]\nLust demon gets hornier and hornier\nAs the kills gets gorier and gorier\nFrom corridors to corner stores\nCatch him on the block\nWith the orphans through the street\nViolins playing as another black coffin speaks\nAt the thought - of another ignorant phone call\nWho is this? Calling me at 5:47 in the morning\nCrack of dawn and why she mourning\nBittersweet, hit it both ways, now I'm scorching\nFirst things first, man, you fucking with your hearse\nSo rehearse  who you coming at\nAye aye squintin' at Captain Kirk\nStar trekking, playing my role\nBut still follow scenes tread\nEnemies, friend up ahead of me\nShow no empathy, get smashed like a centipede\nSent to energy, don't bug me with your sympathy\nYou ran a whole train on a bitch\nShe still suck a mad dick, when the clock tick\nAs I elect no cause of politic, uh\nCould you picture the damage that we afflict, uh?\nI'm staring at my own, own fucking depth\nBackwoods smoking out my motherfucking chest\n5 minutes to death, I'm still in bed, get high at rest\nAs I arrest the sex pin, my love reminisce\nLearn to architect, computerize love\nIt's that project that'll shock her back to cardiac arrest\n\n[Hook: Kirk Knight]\nI got some problems that I can't get away from\nIf all else fails, know I got my day ones\nI got five on it, keep a nigga face numb\nFuck five on it, keep a nigga face numb\nI got some problems that I can't get away from\nIf all else fails, know I got my day ones\nI got five on it, keep a nigga face numb\nFuck five on it..\n\n[Verse 2: Joey Bada$$]\nMy trigger finger get hornier and hornier\nFinger fuck the grip til it spit on a cop\nA warning shot for the warden\nHolla, say the word if you want it\nI'ma bring the ward in\nPeep holes straight through ya doorman\nMy sound reach foreign\nY'all still be local, I'm in this foreign\nMy vocals still ain't focal\nRap game in a chokehold\nI smoke those who don't know\nWho could get lunged in the air by the dope flow\nMatter fact, I flow dope, bars by the boatload\nYou said you ready for war, boy I just hope so\nLet me vindicate for all my indica syndicates what I indicate\nBeen the great, the Flatbush renegade niggas been afraid\nSqueeze the life out you rap niggas like lemonade\nYo, Kreeper say the word and I eliminate\n\n[Hook: Kirk Knight & Joey Bada$$]"}]}