{"artist": "Canibus", "songs": [{"title": "Fraternity of the Impoverished", "album": "Melatonin Magik", "year": "2010-02-09", "image": "https://images.genius.com/eab20e1acfa343ff4b9ea6c53ff8ac79.500x500x1.jpg", "lyrics": "[Canibus]\nFraternity of the Impoverished\nKnowledge this, knowledge this\n\nThe vocalist beast, knowledge like the Pope in this piece\nYou think the ocean is deep? Fuck with me!\nUnbelievable bars, unbeatable odds\nUnspeakable horrors at a unperceivable cost\nYour unagreeable response lacks thought and human heart\nThis is Lyrical Law, it's what I make the music for\nMy prayers are simple, my forehead is layered with wrinkles\nBecause of all the hardships that I've been through\nSymbolic Hip Hop prophet speak to your subconscious\nFringe politics got the public thinking the opposite\nI'm a hypo-lyrical spontaneous alchemical\nElite neo-liberal child of the indigo\nDrilling holes through the Faraday cages of your brains\nThen I implant the arcane image of Saint Germaine\nHigh lyrical exponent intelligence quotient\nWhen I'm focused I can engage multiple opponents\nBut I won't if, I have no motive, \"Soldier be careful, it's loaded!\"\nVerbose with emotions of psychosis\nIn case you didn't notice when I wrote it\nI'm spitting lyrics fitting in tighter spaces than outer-space roaches\nA real emcee don't have to do what he don't wanna do\nAnd that includes freestylin' in front of you\nIt's not like something gone change\nIt's not like the whole world gone start praising my name- I stay in my lane\nI'd rather die by living brave then live like a slave\nI'd rather be broke then be fake and get paid\nThese layers of physicality challenge me\nMy soul is gold and it's the only thing that's able to balance me\nMy energy body has a alchemical copy that looks godly\nNot fat, out of shape or sloppy\nThe iller the rhymes the more that I embody\nVilified when real recognize real - I gets mines\nStand with the underdog - don't be a coward\nStop dickriding people for their money and power!\nEven the American flag says 'Made in China'\nThe national debt says the US is a vagina\nOf a black widow spider spraying blood out like a geyser\nWhy do we lose everything we fight for?\nFathers, mothers, sons, daughters\nIn the land of the lawless, sacrificed before Horus\nThe Inca, the Aztecs, the Mayans, were masters\nA new beginning is coming - the irony is classic\nThe potential of life versus the potential of death\nEither way you go through mad mental stress\nGod forbid for you, for her, or him\nWe ignored the gems now we gotta do it all again\nWe failed Hip Hop's laws and brought down shame upon our cause\nNow we will fall upon our swords\nThe Shaman pays homage to Solomon\nHe orders them to send the witchdoctor in, then asked me to rhyme again\nEvery now and then I get retarded and spit\nI would like to apologize to every artist I dissed\nEverybody assumes that I wanna rhyme when I don't\nSometimes I just wanna chill and watch you flow\nMysteries of the cathedral, the dark overlords are evil\nRipped out the vocal cords of the people\nI walk up to your bed side in disguise with red eyes\nAnd tell you to remember these rhymes\nThis is the season of Hip Hop, believe it or not\nI lined it up with the planet's equinox"}]}