{"songs": [{"year": "2019-06-07", "title": "Angels and Demons", "image": "https://images.genius.com/2989d81f5ba13d08135f6ac8bc9f7747.640x640x1.jpg", "lyrics": "On it Atown on it\nA! A! A! A!\n\n[Verse 1]\nSometimes you gotta say it how it is\nAlot of BS but I be keeping alot of it\nFirst na anka mede pain no beba Twitter\nBut sesiaa menyin nniema no dooso I gotta swallow it\nMa choose ways that I deal with it\nSilence dey kill critics\nThis is not a regular song this is real lyrics\nThey wanna still limit\nMame nka nokore nniema bi dey fit kill spirit\nI swear down\n\n[Verse 2]\nSe mete me baabi na medwen me ho a\nYese Sarkodie dont want no one to follow him\nSe mehu obi na mepe se me boa no nso a\nYese “He was only trying to overshadow him”\nWhat the fuck is wrong with you?\nAden kraa na mo focuse on the wrong issue?\nMo agu meho fii akye I need a long tissue\nHow do I stay relevant? I'm gon teach you\nMay God be with you!\n\n[Verse 3]\nSesiaa yese a couple of gate-keepers\nAll they wanna do is bring a nigga down\nOmo suban nyinaa aye se fake sneakers\nYe hye ne dem wode pue a ema yawa wo town\nBut I’m always gonna rise\nCos charle nokore no always overcome the lies\nTo my Sarknation everybody for relax\nSe otanfo benya me a gye me shorte bars\nBut we no dey carry last\n\n[Verse 4]\nAfei obi mane nto me nue bema no se\nSe odaaso dwen me ho a endie agoro wo nani so\nPapa panyinmu na still a wo be gyimi die a\nAdwuma na ahia\nWo nkolaasem no ebebo woti so\nBabia madwen no da no mempe nkolaa agoro\nEbiaa wodae som ne se wobe trende wo Twitter\nMedie medaso do wo\nNti daakye bi se w'adwene ba fie a\nWodie fre, your brother be your brother\n\n[Verse 5]\nForgete am still the god\nI'm not a human I’m a god\nWogoro me ho a wobeye sad\nBabia meduru no I don’t give a f*ck\nMeye rap mu Adjetey Sowah\nNansa yi se wobo shows a wogye lower?\nNext time afei na wakuuli wonni ******\nGyae me fr3, make you only call me when you grow up\nHollup!\nYeah", "album": "Alpha SZN - EP"}], "artist": "Sarkodie"}