{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/d99d072a2a5498c5bc40c3fb57535cdb.1000x1000x1.jpg", "title": "Big Bank", "year": "2016-06-11", "album": "Lil B.I.G. Pac", "lyrics": "[Intro]\nOh this the real deal, like for real for real?\nI thought lil shawty was the real deal and I guess not\nBut this the real deal? For real?\n\n[Hook]\nLil nigga I got big bank\nI was ‘bout to eat that pussy but that shit stank\nGirl I want to eat your pussy but I just can’t\nSmoking medicate help me meditate\nYou was so wack, I don’t wanna hear your mixtape\nHis diamonds so wet, he got it out the fish tank\nI swear all I do is crank like I never think\nI don’t think I just crank, I don’t hesitate\n\n[Verse 1]\nLet it spray, Kodak let it spray\nI ain’t got to tote no 5, keep it just in case\nThem niggas ever get out of line, put them in they place\n‘Cause I be staying out the way, them niggas in the way\nIt Lil Kodak, I don’t rap, bitch I illustrate\nIt like I be painting pictures but I picture paint\nSo why they call you Kodak Black? You sippin’ Easter pink\nI be right there at your house, think it’s trick or treat\nI be drawing when I speak, see it vividly\nI keep a 30 clip but this a Glock 23\nThink it's sweet then come and see, I’ma demonstrate\nDrop two ounces of codeine in my Minute Maid\n\n[Hook]\nLil nigga I got big bank\nI was ‘bout to eat that pussy but that shit stank\nGirl I want to eat your pussy but I just can’t\nSmoking medicate help me meditate\nYou was so wack, I don’t wanna hear your mixtape\nHis diamonds so wet, he got it out the fish tank\nI swear all I do is crank like I never think\nI don’t think I just crank, I don’t hesitate\n\n[Verse 2]\nYou ain’t gotta like my music but you gon’ respect me\nBy the way when you approach me better come correctly\nI be on that Little Caesar's shit, hot and ready\nAll the motherfucking bread, where the damn jelly?\nI can’t understand these bitches, they so damn messy\nI want to motivate them niggas but I got them jealous\nLil nigga I got big racks\nI be flexing, wondering why I ain’t got no six pack\nAll this flexin’, I deserve to have a six pack\nI stay finessing, break a nigga like a Kit-Kat\nI stay finessing, break a nigga like a Kit-Kat\n\n[Hook]\nLil nigga I got big bank\nI was ‘bout to eat that pussy but that shit stank\nGirl I want to eat your pussy but I just can’t\nSmoking medicate help me meditate\nYou was so wack, I don’t wanna hear your mixtape\nHis diamonds so wet, he got it out the fish tank\nI swear all I do is crank like I never think\nI don’t think I just crank, I don’t hesitate"}]}