{"songs": [{"year": "2017-04-14", "album": "DAMN.", "image": "https://images.genius.com/d25e7043f51c2de6acaf6c39caa60da2.1000x1000x1.jpg", "title": "DUCKWORTH.", "lyrics": "[Intro: Bēkon & Kid Capri]\nIt was always me vs the world\nUntil I found it's me vs me\nWhy, why, why, why?\nWhy, why, why, why?\nJust remember, what happens on Earth stays on Earth!\nWe gon' put it in reverse\n\n[Bridge: Ted Taylor (Sampled)]\nDarling, I told you many times\nAnd I am telling you once again\nJust to remind you, sweetheart\nThat my—\n\n[Verse: Kendrick Lamar]\nOh, Lamar\nHail Mary and marijuana, times is hard\nPray with the hooligans, shadows all in the dark\nFellowship with demons and relatives, I'm a star\nLife is one funny mothafucka\nA true comedian, you gotta love him, you gotta trust him\nI might be buggin', infomercials and no sleep\nIntroverted by my thoughts; children, listen, it gets deep\nSee, once upon a time inside the Nickerson Garden projects\nThe object was to process and digest poverty's dialect\nAdaptation inevitable: gun violence, crack spot\nFederal policies raid buildings and drug professionals\nAnthony was the oldest of seven\nWell-respected, calm and collected\nLaughin' and jokin' made life easier; hard times, mama on crack\nA four-year-old tellin' his nanny he needed her\nHis family history: pimpin' and bangin'\nHe was meant to be dangerous\nClocked him a grip and start slangin'\nFifteen, scrapin' up his jeans with quarter pieces\nEven got some head from a smoker last weekend\nDodged a policeman, workin' for his big homie\nSmall-time hustler, graduated to a brick on him\n10,000 dollars out of a project housing, that's on the daily\nSeen his first mil twenty years old, had a couple of babies\nHad a couple of shooters\nCaught a murder case, fingerprints on the gun they assumin'\nBut witnesses couldn't prove it\nThat was back when he turned his back and they killed his cousin\nHe beat the case and went back to hustlin'\nBird-shufflin', Anthony rang\nThe first in the projects with the two-tone Mustang\nThat 5.0 thing, they say 5-0 came\nCirclin' parking lots and parking spots\nAnd hoppin' out while harrassin' the corner blocks\nCrooked cops told Anthony he should kick it\nHe brushed 'em off and walked back to the Kentucky Fried Chicken\nSee, at this chicken spot\nThere was a light-skinned nigga that talked a lot\nWith a curly top and a gap in his teeth\nHe worked the window, his name was Ducky\nHe came from the streets, the Robert Taylor Homes\nSouthside Projects, Chiraq, the Terror Dome\nDrove to California with a woman on him and 500 dollars\nThey had a son, hopin' that he'd see college\nHustlin' on the side with a nine-to-five to freak it\nCadillac Seville, he'd ride his son around on weekends\nThree-piece special with his name on the shirt pocket\n'Cross the street from the projects, Anthony planned to rob it\nStuck up the place before, back in '84\nThat's when affiliation was really eight gears of war\nSo many relatives tellin' us, sellin' us devilish works\nKillin' us, crime, intelligent, felonious\nPrevalent proposition with 9's\nDucky was well-aware\nThey robbed the manager and shot a customer last year\nHe figured he'd get on these niggas' good sides\nFree chicken every time Anthony posted in line\nTwo extra biscuits, Anthony liked him and then let him slide\nThey didn't kill him; in fact, it look like they're the last to survive\nPay attention, that one decision changed both of they lives\nOne curse at a time\nReverse the manifest and good karma, and I'll tell you why\nYou take two strangers and put 'em in random predicaments\nGive 'em a soul so they can make their own choices and live with it\nTwenty years later, them same strangers, you make 'em meet again\nInside recording studios where they reapin' their benefits\nThen you start remindin' them about that chicken incident\nWhoever thought the greatest rapper would be from coincidence?\nBecause if Anthony killed Ducky, Top Dawg could be servin' life\nWhile I grew up without a father and die in a gunfight\n[Gunshot]\n\n[Outro: Kendrick Lamar]\nSo, I was takin' a walk the other day…"}], "artist": "Kendrick Lamar"}