{"artist": "Big Daddy Kane", "songs": [{"lyrics": "Daddy Daddy tell me a story of how you took out that wack MC\nNo Daddy, tell them how you beat down that bootlegger\nDaddy Daddy tell us a story!\n\n[Big Daddy Kane]\nHeh heh, alright, alright, alright y'all OK\nCome on y'all, crowd around Daddy now OK? C'mon\nY'all just sit there and listen\nI'mma tell you about the MC\nAnd I'mma tell you about the bootlegger, OK?\nHere we go children\n\n[Verse 1]\nIt happened at a jam, some kid tried to sham on the program\nSo I had to silence the lamb and show him who I am\nSo I just set it off on my competitor\nFreakin the funk as I hit em with crazy metaphors\nLike back up off me Dukes, because you're trippin\nYou better dry your cranium off, cause your brain is slippin\nYou beatin me is somethin that I doubt\nThe only way you could bake Kane is workin in a crackhouse\nNo man alive can withstand the Kane flow\nI kick so much flavor that my shoes look like a rainbow\nYou need a whole lot of practice, you thought that you was\nOn the money so I took you out like taxes!\nNow you can Flea Off, releasin me G, easy be\nTo keep the great MC\nThen I throw em I lean and mean record to spark\nSo I can school that ass just like Joe Clark\nNext I translated, my rap is more educated\nAnd made it complicated for him to illustrate it\nMy dexterity, put him in fear of me\nAnd had his mind bewildered by everything he was hearin see\nThat was enough to slow his whole train of thought down\nSo I just speeded the pace up more than enough for him to come around\nI triple the words, when makin the rhymes, whatever the rhythm\nPuttin his mind in a prison\nAnd oh yeah, that's how I did em\n\nThat's how I did em (HUH) that's how I did em (HAH)\nThat's how I did em (HUH) that's how I did em (HAH)\nThat's how I did em (HUH) that's how I did em (HAH)\nThat's how I did em (HEYYYYYYYY)\n\n[Verse 2]\nI was out flex, lookin cold sex in a Lex'\nSippin on a Beck's, pumpin the remix of Das EFX\nDrive down 125th with my man\nAnd what did I see, bein sold at the stand?\nA bunch of bootleg tapes that he had claim on it\nSo I snatched everything with my name on it\nAnd give me that Kool G. Rap tape, and give me that Ice Cube\nAnd all the Wu-Tang joints, cause they're my boys too\nA man tryin to make a livin, I can't knock it\nBut now you tried to take money out of my pocket\nWord to Miz, what the problem is, is that the kids\nDidn't buy it from The Wiz, they bought your shaky fibs so\nNow it's time to move him off the block\nPass me the Glock cause I might make a body rock\nAnd I'll break down sixteen shots\nThat's One + Eight + Seven on a undercover\nBootlegger, you're worse than a beggar\nMakin a fake profit, stop it\nCause I work hard for the money, to make cash flow\nTo have another come along and take my dough\nNooooooooooooooooooooooooooooooo\nSo I just told my man, aiyyo\nThrow the tapes in the Lexus\nThen we burned his whole stand down just like Waco, Texas\nAnd then I jumped on the brother, with rage\nCrushed his ribcage, damn did he get slayed\nCause I don't think he even know whatever hit him\nBootleggers beware, cause yeah I did em\n\nThat's how I did em (HUH) that's how I did em (HAH)\nThat's how I did em (HUH) that's how I did em (HAH)\nThat's how I did em (HUH) that's how I did em (HAH)\nThat's how I did em (HEYYYYYYYY)\n\n[Verse 3]\nGive it your best shot, bring it with all you got\nAnd watch the bombs I drop just rock your knot\nCause it ain't wise to address me\nI wouldn't advise a schoolteacher to test me\nCause I don't just do em, I run through em\nAnd I don't just hurt, uh uh, I body work em\nLyrical torture, never could support ya\nFor steppin to me, agony is what it brought ya\nCause you never seen this type of lyrical genius\nThat could never be touched, and I mean this\nSo one love, I'mma leave you with the rhythm\nAin't no need to go off, cause yo hon know I did em\n\nThat's how I did em (HUH) that's how I did em (HAH)\nThat's how I did em (HUH) that's how I did em (HAH)\nThat's how I did em (HUH) that's how I did em (HAH)\nThat's how I did em (HEYYYYYYYY)", "image": "https://images.genius.com/c57181cdaaeb4f7bcf3a5a0f89a83315.1000x1000x1.jpg", "year": "1994-09-13", "title": "That’s How I Did ’Em", "album": "Daddy’s Home"}]}