{"artist": "E-40", "songs": [{"title": "Da Bay", "image": "https://images.genius.com/dd58bf92b00eef5fb53d153babbf9317.1000x1000x1.jpg", "album": "Grit & Grind (Promotional Copy)", "year": "2002-06-22", "lyrics": "[Chorus: Chris Bentley]\nI'm sorry baby I can't change my ways\nI grew up in the Bay\nWhere the hustler plays\nAw-yay!\nI'm sorry baby I can't change my ways\nI grew up in the Bay\nThat's how the hustlers play\nAw-yay!\n\n[Verse 1: E-40]\n\n'Member Mr. Flamboyant way back in '89?\nWell back then I was selling tapes out of the trunk of mine\nI put my car into park and let the beat explode\nWithin an hour, guess how many tapes I sold?\nI got the power, I'm feeling my Wheaties I can't stop\nI bought a clothing store right down the street from Rich Art's barber shop\nNow I'm popping, ain't nothing wrong with nothing I do\nAs long as I pay my tithes and the internal revenue\nI'm booking studio time, Solano Avenue\nAt Studio Ton's to make a hit or two\nClassics for the future that ghetto gold super duper\nHits like Hurricane and Captain Save A Hoe\n\n[Chorus]\n\n[Verse 2: E-40]\nMoney ain't changed me, money changed the way people think about me\nWhen I was broke, all I had was my family\nIt kinda hurt me when they closed down (Who?)\nThe Music People, Jason Blaine and them downtown\nThey was around before I even owned a bottle\n(Like that then,) like George's Music in Chicago\nLike 7th Heaven up in The Show Me State, Kansas City\nJones & Harris, Long Beach V-I-P & T-Y-E's\n\n[Chorus]\n\n[Verse 3: E-40]\nI grew up in the Bay, Cali-for-ni-a\nWhere the Oakland Raiders and the 49ers play\nI hear everybody talk about where they stay\nWell how come I can't talk about where I stay?\nThe Yay, where we pop our collars\nJack our slacks, and make them dollars\nWrite these raps, and spit this game\nAnd show the whole world, that we ain't no lames\nI can't change my ways, I been a hustler for days\nThe way I walk and I talk, it's not a fad or a phase\nA fling, a fluke or a joke, or some old gimmick that's staged\nBut it's the way I am, I can't change my ways\n\n[Chorus]\n\n[Outro: Chris Bentley]\nWhoa, Forty Fonzarelli, Chris Bentley, S Dog, we keeping it real\nY'all don't wanna see us\nCause we gone kick up a lot of fuss\nIn the dust, from The Bay to LA\nWe are so paid, baby"}]}