{"songs": [{"year": null, "image": "https://images.genius.com/1c1c9c3b1982f1cae03e4d20479cd365.818x818x1.jpg", "title": "James Bon Elevators (Freestyle)", "album": "Camouflage (2003 Original Version)", "lyrics": "[Verse 1: Billy Woods]\nYo yo, spitamatics, you know\nKid so dope it’s illegal, we belong in a dirty needle\nFuck that, just bring the eagle plus the beretta\nYo gon’ need all your guns and all your cheddar\nCause we all know who rap better, what the fuck\nYou think you a competitor? You can’t even stand with this\nI’m the editor, cut your lines out each rhyme\nI’m on deck though I flip dimes and I stay on my P’s and Q’s\nNiggas watch thieves, I’m thrifty like Jews, what the fuck\nI leave no clues and [?] like who, what, where\nY’all niggas can stare an ice grill but guess what\nI flipped with skills\n\n[Verse 2: Vordul Mega]\nFlip with skills, living inflicted bills\nTrying to get them skills up, ‘cause it’s real\nFuck where we live and the chills ducking\nI’m like yo the children’s ducking in front of the buildings\nWhat, I don’t understand why it’ like that\nNiggas is like yo, trying to strike caps over seas\nNigga please, yeah\n\n[Verse 3: Billy Woods]\nMoney when I spit, money when I spit\nLike ATMS I spit them bloody gems\nNiggas said what, this shit don’t got seeds or stems\nThat’s him Billy Bodega, they call him slim\nIn D.C. where we feel crack, drive caprices\nYo, y’all niggas know, I fucked your nieces\nWhat you gon’ do, I leave you in pieces, it’s ridiculous\nWhat niggas try to do, the way we bust\nYou can’t handle us, we got the blunderbuss\nPointed at your chest, what you gon’ do now\nWho can you trust?\n\n[Verse 4: Vordul Mega]\nYou on the floor looking up, fucking with\nThe brothers that can’t took enough\nTalk about look at hooks, look at [?]\nThat come like the thousand horses\nKids, ready for the bizum, we twist ism\nEveryday keep the eye lit up, you know how we get up\nGotta big cup, talking ‘bout yo wig, diddy, I need money\nLet’s get busy, I don’t care if he rap in my vocal\nMan, bring it back to the chokehold, then take his money\nAnd his aligators, then slide off in ill James Bon elevators\nNiggas is faders, getting faded all day\nYeah, yo all day, since hallways\nYo all day, since hallways\n[?] blaze, still heavy\n\n[Verse 5: Billy Woods]\nIt’s the lyrical terrorist, microphone martyr\nGuess what, we come harder, you is conventional weapons\nNigga we little boy and fat men, you shoulda come harder\n\n[Outro: Vordul Mega & (Billy Woods)]\nThat for the 2000-and-beyond\n(You’re not promised tomorrow)"}], "artist": "​billy woods"}