{"songs": [{"year": null, "title": "Got Up This Morning", "image": "https://images.genius.com/cb391d97ea1e67f146589b798b0e7b0a.306x306x1.jpg", "lyrics": "[Intro: Sage Francis]\nIt's not that what we're doing is wrong\nBut let's try to keep this here secret\nBetween me, you, and the song\nMénage à trois that sings to me\nSinfully\nWhen god plays along\n\n[Intro: Jolie Holland]\nWhat you want with a woman who won't do what you say?\n\n[Verse 1: Sage Francis]\nI was sweet on her\nShe was sweet on Jesus\nWe slept with a blanket barrier between us\nMaster of her craft, I had her laughin' like hyenas\nWhen I asked her if she'd marry an elitist\nStaggering genius in lace\nWith the grace of a drunken monk\nThe mask isn't seamless cause her face says something's up\nBut I don't dare ask her I just listen\nSwitchin' to my good ear and adjusting my position\nAs she discuss Ginsberg I listened and learned\nAs she disperses his words I just resisted the urge to do like he would\nWhatever he wanted, if she allowed me to\nShe dangled that carrot then asked me:\n\"What would Bukowski do?\"\nOh don't go there\nHe'd make you his mom and then completely lie about it in a book later on\n\n[Hook: Jolie Holland]\nGot up this morning\nDidn't know right from wrong\n\n[Verse 2: Sage Francis]\nSpirits were lifted when she whispered something French in my ear\nTension was there\nWhen I responded in English it sounded less sincere\nThe sex in the air couldn't be left alone\nSo welcome to the Terrordome\nA bedroom full of pheromones\nWhere nothing that we say is set in stone\nIf I thought it was for posterity I'd already be writing better poems\nBut I'm talking in extremes\nBest this and best that\nBest not regret anything that ever gets said to this hell cat\nCreepin' on all fours\nReady for combat\nWith secretive wars sneaking her claws in our contract\nBending every which way but loose with no proof that anything that we've suggested to this day is the whole truth\n\n[Hook]\n\n[Verse 3: Sage Francis]\nI heard her chemical romance was a medical slow dance\nSaid my advance was sexual\nHeld my genitals with cold hands\nSet up the Coke cans\nBroke out the Red Ryder\nThen one by one I tried to knock down everything that's dead inside her\nShe used to treat street dividers like a balance beam\nArms spread wider than the legs in her dad's magazine\nRe-enacting the pages that she got trapped between\nI used it for kindling and then spilled the gasoline\nNow I'm your water boy\nI fetch it from your cheeks just like tennis balls\nSmell the stench of your weakness on the bedroom walls\nSomebody careless let em vaporize\n\"Who let these fall to the floor from your poor vacant eyes?\"\nDisintegrate\nThis ain't a great first impression\nBut I work better on pages, they say words are my profession\nLet me spell it out in simple language\nPlain English\nI want your suicide to be a book of mine that I never finish\n\nJolie Holland:\nGot up this morning\nDidn't know right from wrong\n\nWhat you want with a woman who won't do what you say?", "album": "Human the Death Dance"}], "artist": "Sage Francis"}