{"artist": "Cam’ron", "songs": [{"title": "Curve", "album": "Crime Pays", "year": "2009-05-12", "image": "https://images.genius.com/92496cfcc2e09bf599c5704239d3db57.1000x1000x1.jpg", "lyrics": "[Talking: Cam'ron]\nNow I told shorty to curve! She like curve? I'm like curve!\nShe like what that mean? I'm like that mean get away from me. Ya breath stink you heard of TicTacs?\nCurve man get outta here.. If Big Pun was alive, he'd tell you, 'Go that way.' Curve!\n\n[Verse 1]\nFrom Ecuador, extra raw\nRepertoire, like the reservoir\nFew Beretta scars, get ya neck ajar\nRespect it Pa, don't believe, better call\nI need a fr-fr-fre freak, I mean a tramp ma\nAnd my dick you can lick like a stamp ugh\nAnd ya back you can arch like a ramp ma\nGet a helmet you about to get rammed hard\nI'm Rambo, Commando, Camacho\nYa disappear, Vamanos, Vato\nGot doe, Gwap ho, Shots go\nRatt ratt taat how could he not know\nLouie socks though, you can see the logo\nAnd I chop blow blow no homo\nShoot out in the woods no po-po\nHe wired, the deal a no go yo\nI get dough though, he a no show\nI'm so high high in the low low\nI ain't gotta address but yo I gotta get dressed\nCome watch a mobster get fresh\nLennon and ostrich on deck\nI kno ya'll wish that them shots would've shot me to death but Death becomes me, you a mummy\nI'm out of ur flesh dummy money bustin outta my socks and my sweats\nGet cash but a lot of my gwaps in a check\n\n[Hook]\nThat's my word, if homie actin absurd and he sort of like a bird, then tell tha dude to curveee\nGirls too, if she gettin on ya nerves and she got a lot of nerve then tell the girl to curveee\nCurve nigga, no curve trick\nCurve nigga, no curve trick\nCurve nigga, no curve trick\nCurve nigga, no curve trick\n\n[Verse 2]\nYo, Damn Cam why they startin wars?\nBoston Garden kitchen, parquet floors\nLittle pimps, watch them whores\nSlide em to the crib, right inside her ribs\nRight outside her ribs, right inside her chips\nPlease stop watchin me\nLook, diamonds around her wrist, house behind the cliffs\nLeft her equivalent, to 600 dimes of piff\nOff the winner menu, I'm from a different venue\nThese nike's??, don't ask, discontinued\nMust this continue, one clip will end you\nPlease stop watchin me\nI can't front baby girl I'm something to watch\nI ask you one thing girl, you comin or not\nI make sugar melt, you don't need killa help\nMy doors are suicide, bitch go kill ya self\nSince ya feel ya self, nine mill will steal ya health\nPlease stop watchin me\nI kno a lot of ya'll hatin wanna clap me still\nListen good, I don't care how you actually feel\nCause I'm actually real, for real wrapped in steal\nAnd the roof open up like a happy meal\nGet a steel grip, you won't feel shit\nWe move single file like we on a field trip\nGet ya permisson slip, can you vision it\nEmpty the gun son, put in a different clip\n\n[Hook]\nThat's my word if homie actin absurd and he sorta like a bird, then tell tha dude to curveee\nGirls too, if she gettin on ya nerves and she got a lot of nerve then tell the girl to curveee\nCurve nigga, no curve trick\nCurve nigga, no curve trick\nCurve nigga, no curve trick\nCurve nigga, no curve trick"}]}