{"songs": [{"lyrics": "I could make 'em all dance, or I can sleep\nI can walk with a limp and make your step feel incomplete\nPeople are made of match sticks, life is bred of flames\nNoted the craft work bore the last smirk of the Damien mainframe\nMy boxcar siphons third rail juice from lost poets\nInhabit ocean bottom with a bin of rotten scapegoat pardons Note to self:\nDon't bargain at martyr parliament rallies\nWhere participants squeeze in last giggle then widdle sacrificial finales\nI can tie my bootlaces alone, save the knee deep offerings\nSorta brings you coughing bunk persona to light\nI might, Build anti-malignant railroads, find you, and lay tracks adjacent\nJust to scream \"fuck off\" as the engine pulls out the station\nWhat should we do with a thousand drunken sailors?\n\"Kill 'em all, locate their family address, release a mailer:\"\n\n(Dear Sir or Madame, your son or daughter's embarrassed humankind\nConsuming booze and gut-fuel, till their cruise had crossed the line)\n\nI spin gold\nHe bats a dirty lash toward the nursery class act impressionable bubble\n(Y'all could've been more subtle when polluting paradise gene puddle)\nMan, huddles make us look like cool peeps and I'm trying to school sheep\nToward the right idea, see ya\nThis basic divine subsidiary buffs gunner syllable logic, fold origami\nPlantation shut\nDoes this picket fence hang on to your dreams kitten?\nYou'll probably never hear this song\nLet alone sip the mission long enough to listen\n\n(I smoke cigarettes down to filter, smoke the filter down to space\nNow I'm gonna roll this question tight and smoke that shit up in your face\nNow if you were to alter masks every time fame circus approaches\nDo you really think your maker wouldn't notice?)\n\nOkay, I've died a thousand, and I'll die a thousand more\nI leave footprints in fours, two for bipeds, two more to break the door\nYou can practically caress the utterings of crushed by drudgery\nBrothers and sisters mothering stickler cabinet, mad and shit\nI'll fix your wing for a penny and a parable\nYeah, but this friendship sunk with a barrel full of tarots pulled\nSnake eyes harbor bad shiners\nThen wonder why the cauldron sitting at the their rainbows ending\nRocks garbage bag liners (garbage bag liners)\nI sat to breathe. Adam and Even without the Apple seed's useless\n(I sat to breathe) Bashful boredom crafts a castle out of toothpicks\n(I sat to breathe) I breathed too hard nearly, metamorph castle loose pins\nNow I stand to breath as not to disturb the plumage\nAnd I know that sob story, it no longer turns my stomach\nHollering wolf in the form of one frustrated culprit\nCaught a love tap full of washed up stardom, melted trying to milk it\nWin a ticket to ride white lines highway sideways knelt it, smelt it\nOne love to the rungs in my ladder, one love to the gathering of\nLaughter baths that hung from my rafters\nSee the jackal met the badger, they were both such fucking bad asses\nThat clashing wouldn't make sense (hence my tape deck)\nNow I ain't gonna name name's, and I ain't gonna drag others in\nBut I ain't about to say that I'm the only catch you got bubbling\nYou're lucky, somehow you've managed to befriend some good people\nWho will sit and soak the evils you secrete, but why? I'm not really sure\n\n(Knock knock. Fuck off. Kicking his lip across the floor\n'til the archival vinyl venom soak the lure\nAnti-clarity mechanism spit flattery burners\nFusing a million majesty murders, then stole your crown)\n\nOh wait, that's right, you discovered me right?\nOffered up the peace pipe\nThen oh, it's all cotton candy when Aesop rocked a b-line\nHe's acting foolish left in the middle of laying bricks\n(but we weren't building nothing but a great wall around these stones and sticks)\nOh and for the record I've been rhyming since me and Andre thought we could freestyle\nBuilt foundation out passion and brother's dusty Tascam\nStudied dope rappers, vocab expansion, poems, syllable placement\nYou just mad because somewhere in there you came and went\n(And I ain't the type to dwell) Dismissed it as casually non-compatible and bounced\nObtained status where I could straight objectively critique your after projects like\n'Oh that sounds fresh' or 'Damn that shit is garbage, what happened? I'm not even laughing'\nYeah, but the barriers were broken (you choked)\nYou choked a few comments to the wrong Vulcan who out of respect and honor leaked your program\nNow like were, both trying to sit and breathe another dawn so my advice\nTo you is when I say \"move on\" just move on", "title": "The Tugboat Complex Pt. 3", "album": "Labor Days", "image": "https://images.genius.com/6a16cbbd76c264fec96a9675981e9556.1000x1000x1.jpg", "year": "2001-09-18"}], "artist": "Aesop Rock"}