{"songs": [{"year": "2017-09-08", "title": "Certified", "image": "https://images.genius.com/63434c224d99de7c2fa4646da1ed5c4d.400x400x1.jpg", "lyrics": "[Hook: Worlasi]\nWho then who be guy\nWho wey dem dey spy?\nCheck around and see\nMe dem dey spy\nAll clean up, All certified\nAll clean up but we never fight\nWe start dey rap but some dey give adadga\nMe and you dey rap abe wey dey the back\nThis no be random wey you no be gwala\nTry take your back, you go fi chop asala\nTeditedi (mmm, hhh)\nTedateda (mmm, hhh)\nTeditedi (mmm, hhh)\nTedateda (mmm, hhh)\nTeditedi (mmm, hhh)\nTedateda\n\n[Verse 1: Jayso]\nThey call me kwaku picasso representing the westside\nIf you wanna roll with me then let’s ride\nIf it ain’t productive then I let it slide\nI am steady taking shots\nYou're taking selfies on your bedside\nStill these critics ain’t giving me probs (no)\nWanna get ride of me you can stuck (bro)\nThey said I must be highing off for something\nSome other assumptions\nBut tell them that is not so\nAt the door with the crew matador to the bull\nIf u can’t say it to my face then please don’t ask me\nOr I might pull a stunt and police dont catch me so\nMiss me with the tough talk or u gonna see who’s there before knock knock\nTalk lock for your thumbs sucks am good with these bars word to bruce lee and its non chucks\nLately success is all I see\nEvery other month different caller ID\nHow I make this quick stevens to God my Gee\nQuick heads give thanks to Almighty\nLately progress is all I see\nDigital gansters Rip\nGrateful for every single heart I reach\nNyaame ebi God almighty\n\n[Verse 2; Sarkodie]\nAlot of success still a, menyɛ satisfied\nMenya ne kwa I made alot of sacrifice\nMe rap ɛnyɛ me hobby ɛyɛ mi 9 to 5\nNti nɛ yaa mukâmi hunsɛm Sometimes I let slide\nMoa ankasa mo nkorɛ moyɛ me level? No!\nMo ne hwe ka a, mo se meyɛ devil, slow\nSesea menho I just to be devil cause ye pɛ w’asɛm a, yɛde nsem a yɛde akeka bɛ sei wo\nBro, you ne dey fit in my shoes\nMa ben meho matua me dues\nMa hyɛ mo bɔ mede Ghana ato map no so\nTrust me once a, nyankopcn aka sɛ ɛbɛ ba mu then it must be\nNkwadaa nketua moba so ato mo ne mouth mouth\nHit baako to mu pɛ you people start dey cause cause\nOf course they dey talk tall\nBut mene size from 19 kojohoho soso banger we dey drop drop\nAbe spitting the thing i see\nGotta be real being a boss like me\nSɛ me kudi no baa a, mepea wifi’ie\nMeni abua nti yɛ adey cheat but please\nSosopon ebe like unna dey use fake IG\nNti mo nsusu ma no ɛnyɛ mo dɛ na wanya Dia-bi-tes\nShow me who be the best ridee\nSɛ ɛnyɛ me a, ma me nti mo kasa kraa like please\n\n[Hook: Worlasi]\nWho then who be guy\nWho wey dem dey spy?\nCheck around and see\nMe dem dey spy\nAll clean up, All certified\nAll clean up but we never fight\nWe start dey rap but some dey give adadga\nMe and you dey rap abe wey dey the back\nThis no be random wey you no be gwala\nTry take your back, you go fi chop asala\nTeditedi (mmm, hhh)\nTedateda (mmm, hhh)\nTeditedi (mmm, hhh)\nTedateda (mmm, hhh)\nTeditedi (mmm, hhh)\nTedateda", "album": "HIGHEST"}], "artist": "Sarkodie"}