{"artist": "C-Bo", "songs": [{"title": "Death Riderz", "album": "Enemy of the State", "year": "2000-07-11", "image": "https://images.genius.com/1022971e425e0540a354e0df5b13ef9c.500x483x1.jpg", "lyrics": "Now that a nigga's seen money, shit\nI can smile and laugh\nI got 20's on my bentley\nAn iron cage in front of my pad\nAnd I still mean muggin\nThrow up west-side in my photo shoot\nAnd got TV's, 20's and DVDs in my photo coupe\nGot a stash spot in the airbag\nFor when the po-po's snoop\nSteady mobbin on the killa route\nWith the bads like pride gin n juice\nI'm split proof\nWith the bulletproof and the gin n juice\nStill mash with the men in blue\nAnd stay strapped down with a mac-10 or two\nNow how you wanna do it?\nWe can get muddy and bloody\nI'mma still count cash, count crass\nIn the middle of the street whoopin niggas ass\nI'm west bound crowned by 50 pounds thats how I do it\nOn the phone with your wife\nWhile ya gettin beat down that how I do it\nI'm a mastermind in crime\nI cause disaster with one 9\nBe behind 17 bodies all shot in the head one time\nSo think twice before you gaffle\nOne pellet to the big apple\nAll your names in one bag\nWere pullin death tickets like a raffle\n\n[Hook] X 4\nBitch, I'm a rider for death\nSlide with a tek-9 for respect\nAnd a nigga that step gets stepped with a tek\nSo it's best you ride with a vest\nHomicide be the best bet\nFor the real life with the best threats\nSurprise, with a tek full of teflons\nIt's westside for death\n\nYeah yeah war, 9, give it to em\nHit the men in blue and I send it to em\nLet off the deaf one full of teflons\nHollowtips spittin straight through em\nNiggas scream one never seen one\nSend a mini 14 in the street low\nWith no remorse of course I aim\nThe tip of torch and I scream go\nHaven't you ever heard of a straight killa?\nOne that makes really quick to break a nigga\nFuck fake niggas and ? nigga\nLeave em abandoned and stranded\nHit, by chrome cannon\nAnd he bucked and bucked and kicked\nLike a bull from the next planet\nThey wanna see me talkin bout thug law\nYou a cinderella quick to scrub floors\nBehind your car door in the war\nAnd you've got a 44\nCatch me in a four-door range\nWicked language with blowed brains\nWith Compton's revered\nAnd a east-side ridah no brains\nThis west coast mafia til death do us part\nI don't step on no mark\nI let the Smith & Wesson bark\nWho you are? Nigga you just a bitch in my book\nYou snitch, and couldn't shook\nCus you done bit the hook\n\n[Hook] X 4\n\nAin't no nigga gon' step on my toes\nWithout gettin bullet holes through his car door\nOr a broken nose, they say I'm hostile\nBut I'm just raised bloccstyle\nDon't ever want it nigga, never put my Glock down\nI'm from the town where house parties be known for crackin\nFor 10 minutes, then it happen, niggas cappin and scrappin\nThen sideways off the block, gang signs out the window\nAnd it's fuck all cops, cus I hit the sherm with the indo\nNow, I'm superman and I'm quick to shoot a man\nIf it's teflon, I send a teflon through his chest bones\nI'm out for manslaughter, must I test the water?\nI got heat that explodes and implodes like Pearl Harbor\nThe hood is like a mini-war, them little ???\nNow I bang a gang, that I remain to kill lethal\nGets critical and it's pitiful\nCus money is all I'm in it for\nIn the hood on one knee\nStrap in my hand yellin what that info\n\n[Hook] X 4"}]}