{"artist": "Kirko Bangz", "songs": [{"image": "https://images.genius.com/38aaf5861d591eadb239fc5c1a8c9e1b.500x500x1.jpg", "title": "Don’t Fall 4 Me", "year": null, "album": "Procrastination Kills 3", "lyrics": "Intro:\nAy yo! I just got this text message right, she told me I better kill it. But uh, little do she know, that what we bout' to do. I'm bout' to take it there. Let's go!'s\n\nVerse 1:\nShit, I told her in the beginning, please don't fall for a nigga. She didn't listen\nI told her I'm a young ass nigga on my grind\nShe told me \"you're the only nigga that been on my mind.\"\nI'm thinking that it'll work as I'm pulling down her skirt\nShe only came over just to do some homework\nBut now she at the pad, doing everything but math\nAnd when we got through she told me she had a man!\nShit, I'm like \"cool.\" Now I know she understands\nThat I'm just trying to chill, I ain't tryna' be the man\nI got some other plans, got some other shit to do\nI got some other plans and they're not including you\nShe told me she'll chill at the crib till' I get back\nNow she getting attached, lil' mama gotta to quit that\nGot a nigga wishing that I never would've hit that\nBut when I get back to the crib ima' hit that!\n\nVerse 2:\nI get back to the crib. She all on my computer on skype with her friends. They're like \"who's that?\" she said, \"thats my man.\" All I can do is laugh like shit she better be playing. She asked could I rap, said she was my biggest fan, she said GodDamn!\nI told her I was tired, I'mma chill on the floor. Meanwhile I'm thinking how to get rid of this ho. Then her friend asked what happened with you and Nick?\nShe said he a trip homegirl we had to split. Now I'm like shit! I remember when I told her me and her should get together if her and her nigga quit. But I was just flirting and that was way before me and her did anything, I told her she was perfect. Now I see how I gotta watch what I'm spitting. You never want to come between a woman and her feelings\nBut I ain't really trippin' I told her she can stay the night. It was only right, I was trying to be polite. We got done sexing, she started asking questions\nGod can you please have this girl go on my breakfast? The next day she texted me, I ain't hit her back. The day after that, I ain't hit her back! The next day she texted me saying nigga Fuck You! I texted her back like I thought you knew..."}]}