{"songs": [{"image": "https://images.genius.com/c0563c9032200258584576466a5d6d53.395x395x1.jpg", "album": null, "title": "Bruiser Brigade Freestyle at a Boxing Gym - Selector", "lyrics": "[Danny Brown]\n\nCheck!\n\nI done popped a pill and I don't give a fuck\nAsk B Mo ya think I made it up\nI'm turnt up, Your bitch turnt out\nShe sucked all my niggas dicks in that dope house\nI'm getting money now, Whatcha know about it?\nFuck around and Im'a show you about it\nPut stacks on your head\nWe gon' fuck around and put a noose around it\n\nMy niggas spit some gun powder\nTurn your face to clam chowder\nWe eating good, Smokin' kush\nI done had three hoes in a two-way shower\nI don't care about you fake niggas\nI don't fuck with none of y'all\nBitch I'll take your boxes\nAll I need is one phone call\n\nShout to my nigga name Dolla Dave\nMy niggas like runaway slaves from caves\nThey in the field, but they ain't picking cotton\nAll they wanna know is where the boxes\nWhere the mag at? Where the sag at?\nMag to your face, think they ain't gon' pass that?\nBruiser Brigade\nBruiser Brigade\nBruiser Bridage\nWe don't give no fuck\n\n[Dopehead]\n\nI'm on Linwood rolling up that Iraq\nI can't put no more bitches in my contacts\nI weigh my work on my palms, Fuck a Pyrex\nYour bitch pulled it out and fucked me up in IMAX\n\nReefer roastin, chiefin chokin' keep my lyrics potent\nHaters notice I'm the dopest, Fakers keep my focused\nPockets full of Oxys and this bitch about to snort it\nThese rappers trunk rappers, want to fuckin' full forward it\n\nEverybody strapped, All my bitches head hunters\nDevil's heaven free my niggas serving dead numbers\nI'm in the street with the gremlins about 100 deep\nFuck CPR, Chopper leave 'em RIP\n\nI'm the Hulk on bath salts\nI'm the Hulk on bath salts\nDophead killin' shit on purpose nigga\nY'all on that broke shit\nTuesday dollar Church's nigga\n\n[Chavis Chandler]\n\nI'm cleaned up and still represent the streets\nYoung black mother fucker with the flow\nThat got you asking \"Who is that mother fucker?\"\nTurn your favorite mc into that wack mother fucker\nPolo trench got me feeling like Shaft\nPosting up on nigga's composition cause I'm bad\nNiggas and these bitches keep my name in their mouth\nMy name in their mouth, Their mouth on my shaft\n\nOh god damn, Talking is cheap\nI did a lot of shit and it was all cause of me\nDidn't even have to leave, did it all from the D\nNiggas wanna diss, but they all gotta sneak\nThe flow like sneaks, yours general release\nNiggas know I'm instrumental to these fucking beats\nFlow hard like it was trying to sail the Titanic's kitchen sink\n\nAh! Nigga I'm killin' this shit\nEast 7 mile and we been in this bitch\nBy the time you get it, I done been in that shit\nCup of Faygo pour some liquor in that bitch\nI ain't driving shit unless the tint in that bitch\nShut your mouth before I put my dick in that bitch\nEast 7 Mile, I gotta get rich\nBruiser! We killin' this shit\n\n[ZelooperZ]\n\nPut my penis in your pie hole, Bout to go viral\nTwo bitches on my dick like these hoes 'bout to tight rope\nGot these bitches stuck like they're sippin' on some sizzer\nI put 'em walking to the store in a blizzard\nUsed to walk miles in a blizzard\n???\nFuck, Fuck\nFuck all the rumors, let my dick make a statement\nHood rat hater, Bitch catch vapors\nNiggas jackin' off they style. Master. Baiter\nLet the K decay him. Put his ass in labor", "year": "2012-01-01"}], "artist": "Danny Brown"}