{"artist": "Andy Mineo", "songs": [{"title": "Hello World", "album": "Formerly Known", "year": "2011-09-29", "image": "https://images.genius.com/b69d4d087350fcc7c60238bac49a2151.1000x1000x1.jpg", "lyrics": "[Intro]\nAndy: Dang, man. Wish my roommates would turn down the TV! Tryna record\nAndy's Roommate: Shutup! Turn your music down, dang!\n\n[Verse]\nHello world, ain't no friend of ya\nSo quit with all the smiles, I won't bend for ya\nI'm walking straight, better now than never\nI guess I started late, now my heart's awake\nWhen did this all begin?\nI guess it's hard to say\nAll I really know is that something happened inside of me\nAnd it was not my own, I was chosen\nNow I'm flipping paper for the prophets\nI ain't talking about how my pockets grown\n Not the paper with the dead people faces\nTalking about them dudes that I read in them pages\nNow I'm seeing clear, but I ain't got Lasik\nI’m thinking about my past, I never shoulda made it!\nBut God in His grace saw it fit to come and snatch me up\nI draw the line in the sand, no I ain't backing up\nWoo!\nBack in the days I was acting up\nYou know when communion came, your boy had to pass the cup\nPass the bread too, sin I was still in\nOffering went in the plate, my condoms almost fell in\nOutside I’m feeling cool, inside I'm yelling\nOutside looking free, inside's like a felon\nDoing time for rebelling\nEnslaved to that sin, that I was dwelling in\nBought the lie they were selling like\nGo, get as many girls as you can\nAnd get it out of your system now so you'll put a ring on that hand\nDown the line when you're thirty\nAfter you had like thirty different women\nThey so perty, feeling clean, getting dirty, yuck!\nNow what a lie from the mouth of Satan\nLet’s use logic for verifying these statements\nWell, you keep chasing them you’ll only want more\nSin is never satisfied, boy we at war with ourselves\nYou ever wanted something so bad it was all you could think about\nYo, you had to have it\nThen you finally get it, you like it for a minute\nBut then your eyes pivot, now you're onto something different\nWe got God-sized longings\nWhy you try to fill em with them things that you can’t take with you in the coffin, huh?"}]}