{"artist": "Cadet", "songs": [{"title": "Gipset Flow Pt. 2", "album": "The Commitment 2", "year": "2017-07-21", "image": "https://images.genius.com/5820d2dba0549dbc477fc37bf62ae455.1000x1000x1.jpg", "lyrics": "[Intro\nUnderrated Legend\nI want that old school Cadet man\n\n{Verse 1}\nAight, Boom\nMe I can't lie, man I ain't wrote bars in a minute\nMan still phone my phone, like Cadet can you still kill it?\nWhen they ask me dumb questions, I hang up, and can't help it\nHow you asking a black belt, if i still know my white belt shit?\nMaybe where I'm from bro we do shit different\nThose niggas you call (gangstas, gangstas), us niggas we call (bitches, bitches)\nYa I know why grime started, g'yea (yell) if you come from the E3\nAnd those niggas you call legends, I can do them dirty on the easy\n\n{Chorus}\nThey know about me, they know about me, they know about me, they know\nThey know about me, they know about me, they know about me, they know\nKeep that shit to yourself, don't play your tracks in my zone\nI don't wanna airplay music like, \"phone my phone, phone my phone\"\n\n{Verse 2}\nAight cool, aight let me get in my zone\nAight let me get a mad flow, come let a man know\nThink you can get at man? Don't\nOn the phone, go'on get a man ghost [?]\nThats C-C-Cadet\nBeat in a video post, my heart was really on cold\nHe was on crud, until I put arms round him\nLike I was lettin man row, No it's all good\nWhen I said man could hang, it means that I was gettin man roped\nAin't let a man go, It's cool then come in with toast\nWith the bread, I was getting mad toast\nNo better man know, deep shit and get a man choked\nOr greeze and get a man smoked, you el cold [?]\nI wanna put chains on the necks n', watch how I get a man frozes\n\n{Verse 3}\nTold matic that I love him, cuh he's always got my side\nAsks about me before the music, had it with me all the time\nEven when I'm doing deals, I had it wit' me on my grind\nThat's church road and ER, doing biz with my nine\nChange up the flow, watch how I make it a show\nThey wanna know, if it's got the swammy on him (oh yea)\nBut he never came here with corn, came in the broze\nQuickly slid in here, its like man came with a com\nBoy came in, Google browser ting\nYea man he came with the chrome, junes on loads\nDone this so many times, they couldn't come to my shows\nMan is so mad, wait for a Drake collab\nAnd that's when they wanna know, you catch that?\nYou didn't? Well it's calm\nEver since man done \"Slut\", it's like they forget that I'm Cadet, Cadet\n\n{Chorus: Cadet]\nGipset Flow ah\nThey, (they) forget that I'm Cadet (Cadet)\nGipset Flow ah\nEver Since man done slut (Cadet, Cadet)\nThey (they, they, they) forget that I'm Cadet (Cadet, Cadet, Cadet, Cadet)\n\n[Verse 4]\nAight, Boom!\nC-Came home to your Mrs., she was flexin in my sweater\nYea you know she's been cheatin', giving bum without the cheddar\nDon't get mad at yo' gyal, cheatin' cause I do it better\nShe was just at my song, only krept cause I let her\nDoing a game where everyone's shit, the dying breed is the one that spits\nThey show up on the astro turf, and take this row man came wit' a kit\nIt came with a sixteen-bar in the clip, every bar from the boy be piff\nThey know its long as they spit wit' da kid, cause they had basic bars\nThey be like\nKelly, she likes Jelly\nAsk questions when man's on telly\nYeah man Kelly, she's so smelly\nSkeng, dip-dip skeng, belly\nMe? I would have used wordplay, that shows that we ain't the same\nKelly couldn't ask no questions, only 'y' would have been at the end of her name\n\n{Chorus: Cadet}\n(Gipset Flow ah\nGipset Flow ah\nGipset Flow ah\nThis is my Gipset Flow ah)\nEver since man done slut, it's like they forget that I'm Cadet, Cadet\n\n[Outro]\n(Gipset Flow ah\nGipset Flow ah\nGipset Flow ah\nThis is my Gipset Flow ah..)"}]}