{"songs": [{"lyrics": "TEASPOON! come here come here, hey, hey, hey look\nHey go get me two pounds of bud and two ounces of yay\nMuthafuckaz at mah house waitin right now cuz\nAiight\n\nHow long can sell?\n(you see life is like football you know what im saying)\nBefore I have to go to jail\n(you gotta hike the ball and just make something happen man)\nCan I possibley get real?\n(I mean you know you might get tackeled you know what im saying)\nBefore somebody go and snitch\n(then again you might fuck around and make a touch down)\nI'm so paranoid stressed stressed paranoid paranoid\nOne false move I can be destroyed (echo)\nI avoid the cops I use a decoy\nSee my mother fuckin driver he's a white boy\nI'm so paranoid stressed stressed paranoid paranoid one false move\nI can be destroyed to avoid the cops I use a decoy\nYou see my mother fuckin driver he's a white boy\nAll my life I did nothin' but dealin'\nLearned to rely on my gut feelin'\nYo name is what? what? I know you from where? where?\nI dont meen to seem vicious but you look suspicious\nStop talking bout drugs on the telephone\nStop walking with a bunch of thugs to my home\nStop fuckin up, call me before you come\nStop telling these bitches where you got it from\n\nHow long can I sell\nThe sheriff departments right down the block\nBefore I have to go to jail\nPass my beer so I can swallow this rock\nCan I possibley get real\nPass the tabs the turnakit and syringes\nBefore somebody go snitch\nBefore the DEA kick the door of the hinges\nI'm so paranoid stressed stressed paranoid pranoid\nOne false move I can be destroyed (echo)\nI avoid the cops I use a decoy\nYou see my mother fuckin driver he's a white boy\nI'm so paranoid stressed stressed paranoid paranoid\nOne false move I can be destroyed (echo)\nI avoid the cops I use a decoy\nYou see my mother fuckin driver he's a white boy\n\nAs I bail down the street with my khakis creased\nEverybody looking at me look like the police\nHavin conversations with my gang asailants\nDo you think we under police surveilance\nAsking questions giving suggestions\nPulling smith an wessons on strange pedestrians\nCookin crack up, dolla bills stacked up\nHope the cops dont backup here they come man\n\nHow long\nStop runnin stop runnin\nCan I sell\nThe sheriff departments right down the block\nBefore I have to go to jail\nPass my beer so I can swallow this rock\nCan I possibly get real\nHurry up pass the tabs turnakit and syringes\nBefore somebody go and snitch\nBefore the DEA kick the door off the hinges\nMaybe I otta stop sellin water\nSpend more time with my son and my daughter\nBut my drug life drug me away from my wife\nShe couldn't deal with the stress and the strife\nThe cocaine rockin' and the hood rats jockin'\nThe late night knockin' the drive way blockin'\nLate at night I fantasize bout rappin\nBut I gotta sell dope till it happen\nFor how long\n\nHey who is that who is that man?\nSee you all fuckin up\nI got these looks\nYo man little rich kids comin over here\nThats what I'm saying now\nYou know the gonna snitch\nThey can't even lie to there parents\nWhat the fuck you think they gonna do when the police presure em?\nGet to crying and shit..afroman sold it to me mommy\nHe stays over there\n\nHow long can I sell\nThe sheriff departments right down the block\nBefore I have to got to jail\nPass my beer so iI can swallow this rock\nCan I possibley get real\nPass the tabs turnakit and syringes\nBefore somebody go and snitch\nBefore the DEA kick the door of the hinges\nI'm so paranoid\nNow god lay me down to sleep\nBefore the cops rape\nPlease give me a beat\nIf they accidently kill me\nAnd I dont escape\nPray some white person\nGotta video tape\n\nTwinkle twinkle little little star (echo)\nThat looks like a police car (echo)\nShining on my dope spot (echo)\nA police raid (echo)\nI hope not (echo)\nLittle little homie hold my gun (echo)\nIm gonna fuckin run (echo)\nWhere I run, I dont care\nThrow that dope, anywhere (echo)\nCops chase me, through the hood\nStraight in to the woods camera\nFly like leapords\nI hear, german sheapards\nFreeze, hold It right there\nDrug dealers, nightmare\nBusted crack, criminal court\nNo black support\nHandcuffs very tight, baptist jury all white\nThey could never, be my peers, sentence me twenty years\nThis rap so damn real, Im glad I gotta record deal\nIf I don't sell a mill\nThis could could happen still\nWhat a predicament", "title": "Paranoid", "album": "Sell Your Dope", "image": "https://images.genius.com/0bbd138da6ed935df988e78c78275c51.364x368x1.jpg", "year": null}], "artist": "Afroman"}