{"songs": [{"album": "Eardrum", "image": "https://images.genius.com/36dc52e92a9d27102149cf08b1a7f326.936x936x1.jpg", "year": null, "title": "Hostile Gospel Pt. 2 (Deliver Me)", "lyrics": "[Intro: Sizzla] + {Talib Kweli}\nDeliver me oh my father\nHaha, Amadea {C'mon!}\nSizzla Kalonji {Yeah, this the one right here!}\nTalib Kweli\n\n[Hook: Talib Kweli] + {Sizzla}\n{Deliver me oh my father}\nWhat? What? Yeah\nDeliver me from temptation, a weakened man facin\nYou put the spirit in me, I feel the sensation\n\n[Verse 1: Talib Kweli]\nDie on my feet before I live on my knees lord\nDeliver me from point A to B like livery\nNothin is free, you got to be a hero to save\nThey got you working like a slave from the crib to the grave\nA minimum wage can barely keep a job for a home\nA car or a phone, forget about gettin a loan\nYou starting to moan, your bank account is getting withdrawn\nIt's pitiful how we becomin slaves to things that we own\nThey en-slavin the brains with the whips and the chains\nEnd up in the coffin chasing the fortune, chasing the fame\nSlave to the rhythm, slave to the night, slave to the day\nThey hop aboard the Underground Railroad and run away\nPray for the day niggas don't get taken away\nFor makin a way to stop their baby's stomach aching today\nI sip a whiskey straight, no chase\nIt's hard to take a man away from the sin when it's inside of him\nPlease\n\n[Hook: Talib Kweli] + {Sizzla}\n{Deliver me oh my father}\nYes, yes\nDeliver me from the evil that's all around me\nJamaica to King's County, God\n{Deliver me oh my father}\nYes, yes, yes\nDeliver me from temptation, a weakened man facin\nYou put the spirit in me, I feel the sensation\n\n[Verse 2: Sizzla - best guess only]\nDance through my soul and let my days go right\nHe can preserve me all the days of my life\nWith the strength to wake through another day so bright\nOh! Kalonji, Talib\nThey say nothing's wrong with doing sin in your mind\nI reach myself and see what's there for my kind\nAnd look around and see, don't be acting blind\nThis is the birthing of us, it's just not kind\nNow what's the worst thing a man could ever price\nPay his life for something he didn't do like the missing mice\nListen up, you know growing up I'll tell you something\nHe won't like you in the deepest of dungeon\nTake away from my periods, leave me by myself\nLife is like a dot com, but the blue in my eyes\nAired by your love from but your feuds are hopeless!\nYou got a lot of bid, that's how it went\n\n[Hook: Talib Kweli] + {Sizzla}\n{Deliver me oh my father}\nWhat? What?\nDeliver me from the evil that's all around me\nJamaica to King's County, God\n{Deliver me oh my father}\nYes, yes, yes\nDeliver me from temptation, a weakened man facin\nYou put the spirit in me, I feel the sensation\n\n[Verse 2: Talib Kweli]\nPlug in the mic like I'm gunnin a bike\nFront if you like, I'm movin fast, my life is runnin the lights\nI give my son some advice\nEyes on the prize, keep more with the one in your sight\nWon't win the gunfight if you brung you a knife\nI'm drawin blood from the rock and keep floodin the block\nWith rhymes that are sharper than the razor that be cuttin the box\nFor sure I gotta move niggas with rocks in their socks\nThe prostitutes sellin the shit right in front of the cops\nUnder the street lamp, walking through the rain until our feet damp\nSingle moms all line at the office because they need stamps\nYour cousin out of jail, he spent his time finding God\nWith a felony kinda charge it's kinda hard to find a job\nHe gotta make a decision, the situation he's placed in\nAs he's gotta get that gainful employment for his probation\nOtherwise he's just another part of the scenery\nJust because you got out of jail, that don't mean you free\n\n[Hook: Talib Kweli] + {Sizzla}\n{Deliver me oh my father}\nWhat? What?\nDeliver me from the evil that's all around me\nJamaica to King's County, God\n{Deliver me oh my father}\n\n[Sizzla]\nGotta survive and sustain and that ain't right\nAnd everywhere you go they want to give you a fight\nGotta survive and sustain and that's for sure\nAnd every minute sees I'm coming at the bar\nOh yeah...\nI got to reach out and look\nAnd keep my seed by my side\nUh, yeah\nLife's a reality\nSizzla Kalonji, Talib Kweli"}], "artist": "Talib Kweli"}