{"songs": [{"lyrics": "[Produced by Aqua and 3H]\n\n[Intro: Notorious B.I.G. in a 1996 MTV interview]\nGotta try to stay above water, y'know?\nJust stay busy, stay working\nPuff told me, like, the key to this joint\nThe key to staying on top of things\nIs treat everything like it's your first project, nomsayin'?\nLike it's your first day, like, back when you was an intern\nLike, that's how you try to treat things like, just stay hungry\n\n[Verse 1: Jay-Z]\nY'all wanna know why he don't stop?\nY'all wanna know why he don't flop?\nLet me tell you pe-people why\nCame from the bottom of the block I\nWhen I was born, it was sworn, I was never gon' be shit\nHad to pull the opposite out this bitch\nHad to get my ri-ide on\nEyes on the prize, Shawn knew I had to\nHad to had to get these chips\nHad to make moves like Olajuwon\nStarted out selling dimes and nicks\nGraduated to a brick\nNo exaggeration, my infatuation with the strip\nLegendary like a schoolboy\nCrushin' merely nearly every every chick\nHeavy shit – that's how schoolboy got whipped\nAnd got left on some Just Me, Myself and I\nOn some Trugoy shit\nHad to voyage to a place of, to a place of no return\nHad to play with fire and get burned\nOnly way the boy ever gon' learn\nHad to lay way in the cut, 'til I finally got my turn\nNow I'm on top in the spot that I earned\n\n[Chorus: Jay-Z]\nIt's my life, it's my pain and my struggle\nThe songs that I sing to you is my everything\nTreat my first like my last, and my last like my first\nAnd my thirst is the same as when I came\nIt's my joy and my tears\nAnd the laughter it brings to me, it's my everything\n\n[Verse 2: Jay-Z]\nLike I never rode in a limo\nLike I just dropped flows to a demo\nLike it's '92 again and I got O's in the rental\nBack in the Stu' again\nNo prob' livin' was a whole lot simple\nWhen you think back, you thought that\nYou would never make it this far\nThen you take advantage of the luck you handed\nOr the talent you been given\nAin't no half steppin', ain't no, no slippin'\nAin't no different from a block that's hittin'\nGotta get it while the getting's good\nGotta strike while the iron's hot, before you stop\nThen you gotta bid it, good riddance\nGoodbye! This is my second major breakup\nMy first was with a pager\nWith a hooptie, a cookpot and the GAME\nThis one's with the stu', with the stage, with the fortune\nMaybe not the fortune, but certainly the FAME\n\n[Chorus: Jay-Z]\nIt's my life, it's my pain and my struggle\nThe songs that I sing to you is my everything\nTreat my first like my last, and my last like my first\nAnd my thirst is the same as when I came\nIt's my joy and my tears\nAnd the laughter it brings to me, it's my everything\nTreat my first like my last, and my last like my first\nAnd my thirst like the first song I sang\n\n[Outro: Jay-Z]\nWoo, it's like the blues, we gon' ride out on this one\nTy-Ty, B-High\nYo High, remember you was making them baskets\nFor them niggas at radio and shit?\nClark Kent, that was good looking out, nigga\nCarline, who ever thought we'd make it this far, homie?\nSha, they can't stop us, knahmsayin'?\nLenny S\nDame, whattup! Robbing the bank\nNiggas thought we was crazy, man, remember uhh\nYou had that fucked up ass handwriting\nYou was writing all the numbers that we was spending down\nFor the videos we was doing ourselves\n(Ski, whattup? Original Flavor in the house)\nYour accounting was crazy wrong and shit\nBut we still put it together\nBiggs, whassup?\nMember we went to St. Thomas and uh (John Meneilly)\nYour dog peed on homie leg and shit\nAt his crib, I think that was Rudy\nAnd they was having a lil trouble with the pool\nYou and Ty-Ty was laughing\nEmory was there; whattup, Emory?\nWhat up, Ty? Hip-Hop, whattup, man?\nAye, aye Hop, you ain't, you ain't have no uhh\nYou ain't have no muh'fuckin seat on your, on your bicycle\nNow you're uhh, the head of black music\nThat's what I'm talking 'bout right there, homie\nGee, whattup, Gee?\nYessir, e'rybody in the Roc\nHey, Guru, I know you spoiled, man\nI be taking them shits in one take\nYou gonna have to punch niggas' shit (?Snigity?)\nYou gon' be tight?\nOG Juan, whattup? I'm a little upset that you wasn't involved in this whole process, but it's all good\nWassup, Dez?\nMy whole family, my nephew, cousin Angie, whassup? Ti-Ti\n(Bey, Bey, Bey, Bey)\nMom, you made the album, how crazy is that?\nBobalob, rest in peace\nMy pops, rest in peace (Sup A.J.?)\nBiggie Smalls, rest in peace\nUh-uh, uh-uh, uh-uh, uh-uh\nNigga, I'm bout to go golfing, man\nAye, I might even have me a cappuccino, fuck it!\nI'm going somewhere nice where no mosquitoes at, nigga\nHolla at me! It's your boy", "title": "My 1st Song", "image": "https://images.rapgenius.com/db98dd9c59a51c9b6b76f6d6a32cac9f.991x1000x1.jpg", "year": "2003-11-14", "album": "The Black Album"}], "artist": "JAY-Z"}