{"songs": [{"title": "Rat Race", "lyrics": "AKIR - “Rat Race”\n[Emcee(s): AKIR]\n[Producer(s): [?]]\n\n[Verse 1: AKIR]\nTECs, checks to bless.  Vexed sex with stress\nIntangible gains arranged, my pockets dead from debts\nMy pain stems deep.  In abyss, I can’t sleep\nNew York king complete.  Battle filled the concrete\nTrying to make ends meet, but they got fury with each other\nOne is my delegate and the other is my brother\nCream said they was men until they never flipped kids\nTaking the rent money, so these niggas got addicted\nHe gave it to this bitch on his dick [?]\nDidn’t give a fuck about D’s.  She had kids to feed\nMy mother tells me, “Get together with your man mind”\nHe’s lost, I can’t find son.  I know he’s in jail\nEvery time I look for him, my mom’s got to post bail ‘cause it’s\nA rat race and the movement’s quick, sucker\nA voice said, “Watch your back, son, and the counterfeit\nGet the money up front [?]”\n[?] and the New York mental ‘cause it’s\nA rat race.  It’s a rat race, son\nIt’s a rat race.  It’s a rat race, son\nIt’s a rat race.  It’s a rat race, son\n\n[Verse 2: AKIR]\nMotivation from my mans to get the crew back to old times\n[?] rhyming in the park\nBody want to dance if mind with the lyrics\nHard to pump up, dividing his soul to freak the gifted\nThat nigga hard, he rest in parts—the first to get blasted, B\nDays before, I told him ‘bout this cat named reality\nComing out his crib, silhouette by the streetlights\nOn the way to meet his shorty—yo, you know that street life\nThey was just getting started, didn’t even see the dadas\nAll of a sudden, linked in drama—life as real as baby mama\nBefore they cut his [?] bucked him in the brain\nEver since [?] and it ain’t never been the same\nBut he played off and kept it thriving in the struggle\nOut of them all, my best friend’s soul is constantly\nIn trouble, on the run [?]\n[?]\n\n[Hook: AKIR]\nIt’s a rat race, son\nIt’s a rat race.  It’s a rat race, son\nIt’s a rat race.  It’s a rat race, son\nIt’s a rat race.  It’s a rat race, nigga\n\n[Verse 3: AKIR]\nThought he grew up.  Even though a nigga been through it\nNicotine lungs, a liver that’s done—scars to prove it\nTook a walk about it [?] and left his mans and it\nFelt like a zombie pumping with no hands and it\n[?] hurry to write a check\nHe’s hoping that his latest rhyme’ll bring him out of debts\nGetting strong, him and his pops getting along\n“Keep your enemies, your friends”—lyrics from his newest song\nSurvivalist, he thrives and just to bring ‘em all together\nUnite in one form what makes your heart last forever\nTime goes on, the song prolongs\nThe lifetime that belongs and how we all say, “Dawg”\nThrough the bitches in heat, through the ditches and beef\nThrough the switches that lock bars and biting with your teeth\n[?] one last message to my mens:\nIt’s a rat race.  Let’s stack the cheddar ‘til the end", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}