{"songs": [{"title": "State of the Enemy", "lyrics": "AKIR - “State of the Enemy”\n[Emcee(s): AKIR]\n[Producer(s): [?]]\n\n[Intro: AKIR]\nYeah, man.  I was chilling in Africa, man, eating yams on land with my shorty.  Nah’mean?  They uprooted me from my home, B\n\n[Verse 1: AKIR]\nThey must be problematic.  Automatic response to the tragic\nPictures in false scriptures portraying us wreaking havoc\nMost of the niggas I know have got a problem with po’\nStaying high, escaping feeling so low, so there it go\nOut on the streets, you could feel the tension, profiling\nFilling quotas to increase their pension.  Niggas wiling\nBut really rebuilding defenses.  In our ascension\nTrying to rise up out these fucking trenches.  In a period\nA long sentence of every day is outlawed, so I’m\nAppalled at the fact I can’t drive while black.  I don’t\nWhip a Benz, Beemer, a Lex, or an Ac’.  The more\nYou beat the concrete is the more The Beast will find a crack\nSteadily staying indifferent while the pillars of the\nU.S. stand on this contradiction.  What about this Prohibition?\nIf we was Kennedys, would pennies be the remedy?\nShould I let it ride or genocide?  State of the enemy\n\n[Interlude 1: AKIR]\nI know you’re hungry, man.  Don’t worry about it, though.  Me and moms going to church tonight.  We gon’ get some food, you know?  We got the check coming for the end of the month.  So go to school, man.  Here’s a dollar, man.  Get a sandwich or something.  You nah’mean?  I’m sorry, man, but just keep us...\n\n[Verse 2: AKIR]\nYo, his little man just got out of school.  Him and his cousin, Wayne\nHis name.  Mayne just came with his uncle tool\nReady to do anything.  Feeling the ridicule\nAin’t got the flyest guild in the world, but the girls\nWouldn’t waver from a nigga with the thug behavior\nSkinny nigga couldn’t wait to get his weight up.  It’s in his nature\nChief emancipator of the crew\nRobbing niggas just to get a brew with his uncle’s twenty-two\nSo now they’re eating healthier suppers.  In his closet\nAssortment of Chuckers.  Didn’t even get his dick wet\nSet up by undercovers, same pigs that trapped his brother\nTrying to protect his baby mother against her ex-lover\nIt’s a vicious cycle.  Acting like they don’t know\nInterfering in Kosovo won’t help us at home\nPlans to pack it up and roll like Marcus Garvey.  The enemy\nCould never harm me or scar me.  The army still trying to starve me\nSo, instead, they’re trying to ruin our future\nSports entertainment and music.  There’s no attainment.  Just movements, but\nWe’re God’s people, so forever we shall be blessed\nTeach your kids the violin ‘cause it’s time to invest\nWe are the best", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}