{"artist": "IDK", "songs": [{"title": "Maryland Ass Nigga", "lyrics": "[Intro]\nPG County Police! Get your hands above your fuckin' heads!\n\n[Verse 1: IDK]\nStick a middle-class kid in a bad school and that's me (hi)\nThe bad apple that dangled up on the fam's tree\nBallin' to be like 2K, no Raz B\nMy fruit been forbidden, you niggas ain't gotta ask Eve\nThe first one in my family to see the\nPenitentiary when I shoulda been seein' C's, B's\nA's too, mama and Martin just wasn't able\nTo keep me studyin' history in their teepee\nWhere the hoes at? Yeah, and not the navajos\nSkippin' Spanish with your bitch like vámonos\nAt night, hit the lick with the toasty toast\nHit the alley, then I hit 12 with the okie doke (haha)\nYou'll never catch me (ha,) you'll never catch me\nMy description was a 5'9\" nigga with mild acne\nSki mask, coat and boots make me look like a tall athlete\nSo they lose every time that they thinkin' they 'bout to bag me\n\n[Chorus: IDK]\nWe (yeah)\nWe don't give a fuck about you (right)\nYour homie on your block'll get it too (woo!)\nYou little motherfuckers ain't gangster\nThey know you (right)\nDon't make me put a hit out on you (bop, bop, bop)\nDon't make me and my niggas come through (yeah)\nYou little motherfuckers ain't gangster, they know\n\n[Bridge: Swizz Beatz]\nGoddammit!\nPress your life, how the fuck you feel? (Oh)\nI ain't have to do it but I did it still (woo)\nWhat I'm s'posed to do? Call God now? (Right)\nWhat I'm s'posed to do? Call God now? (Yeah)\nPress your life, how the fuck you feel? (Woo!)\nI ain't have to do it but I did it still (oh)\nOh you actin' hard now? (Oh)\nOh you actin' hard?\n\n[Verse 2: IDK & Swizz Beatz]\nOh goddamn, yes the hell I am\nI'ma run up in your house just to say I can\nTell a ho that I love her when the shit ain't true\nWhen I hit, she my bitch when she think she my boo\nThat's fucked up, I know, but fuck that, I'm grown\nI used to hit it in the kitchen when my mama not home\nThat's messed up, I'm tryna right my wrongs\nBut I'm sorry, them same wrongs help me write this song\nOkay, runnin' halls, runnin' school, runnin' home, runnin' pockets, gang gang (oh!)\nRunnin' church, mama say I don't even pay attention anyway (real)\nAfter church, call the clique, smoke the spliff, hit the lick, split the shit\nTake this check, buy some kicks, man it's it, yeah that's it (right)\nTold my job that I quit, huh, tell the truth, I got fired, huh\nBoss said I had a warrant, huh, I said, \"You a liar\", huh\nCheck my voicemail prior, huh, guess who the shit was from, huh\nThird District sayin', \"Turn yourself in now 'cause we got the gun\"\n\n[Chorus: Jay IDK & Swizz Beatz]\nWe (oh!)\nWe don't give a fuck about you\nYour homie on your block'll get it too\nYou little motherfuckers ain't gangster (right)\nThey know you (oh!)\nDon't make me put a hit out on you (oh!)\nDon't make me and my niggas come through (woo!)\nYou little motherfuckers ain't gangster, they know", "image": "https://images.genius.com/362b37d757b597e3bf2bce15e7e93eef.630x630x1.jpg", "album": "IWASVERYBAD", "year": "2017-09-29"}]}