{"artist": "Half A Mill", "songs": [{"album": "Da Hustle Don’t Stop", "lyrics": "[Intro: Half-A-Mill]\nYea, Half-A-Mill, uh huh, east west north south\nIt's one of 'em days man\nJust feel like breakin out and shit knawmean?\nFuck the ki's, fuck the coke, fuck the hoes\n(word son), you gotta take some hoes wit you\n(thats true, thats true) knawsayin?\nYou might end up in Paris and shit\nAruba, Rio, you know that real willy shit\n\n[Verse 1]\nYo they ask me -- \"how I got so hard\"?\nI rock wallaby's in stompin yard\nEat Italian food Celasi I gaurd\nDrink herb tea sash for realla\nHalf-A-Milla, take you on rap a Vinci\nBe cautious how you spit my rhymes\nThey might crack your dentures\nMy rap is ill as the Donald Goines literature\nSinister to menace, far from the minister\nIn this to win this, swallow some bottle of Guinness down in Venice\nSmoke a pound of that spinich, til the ground'll spit it\nWalk 'round in lenin, green lizard slitherin\nNo beginnin or endin, no make believe or pretendin\nDunn I vacate suite and blaze 'em in the street\nExecutive thug my salary is deep, I carry the heat\nRemove the gravity from your feet\nYou carried or creep, I hang you high and bury you deep\nForever you sleep, I chop the head off for a week\nAnd sail off on a yacht and get lost for several weeks\nBatman movie silence that's why I neva speak\nForever is deep\n\n[Chorus: Half-A-Mill] **repeat 2X**\nShit is deep shit is real\nSumetimes I wanna get away\nFly to an Island and chill\nShit is deep shit is real\nSumetimes I wanna put down the steel\nAnd say mothafucka them dollar bills\n\n[Verse 2]\nEatin mangos wit my main hoes\nWent from bank rolls to bank loans\nScrapin the globe in a stank rose\nSteppin out the shower in a mink robe\nFlower like duncan hines\nCome for mine and I'm buckin the nines\nSumtimes I wanna leave this life behind\nTake a vacation thats right for the mind\nRelax my muscle's, relax from the hustle\nMiles away from cats that wanna bust you\nMiles away from the struggle, thats what it be\nWeather like 100 degrees\nPine apple juice under the trees\nPurple haze wrapped in the leaves\nFrom massages by them Caribbean Queens, knawmean?\nPretty thug team, clear blue water like I'm Marine\nWatchin videos on an 80 inch sub-screen\nTouch cream, its like every thug's dream, nuttin in between\n\n[Chorus: Half-A-Mill] **repeat 2X**\n\n[Verse 3]\nSip on don, watchin chicks strip to they thong\nSkinny dippin wit the women, cuz my Benjamin's long\nSwimmin wit swans, hit my cell won't get no response\nTwo way me I won't reply, what the fuck ya niggas want?\nI took a vacation from Manhattan, Brooklyn and the Bronx\nGot my mind right clear some thoughts\nFor years holdin for fort, no remorse\nNo love for you haters, dunn we floss\nYou know what it cost, smokin opium in the Porsche\nPayin cat just to drive you around and open the doors\nI was suppose to score like R. Kelly, I can soar\nI believe I can fly, without the henny or Lye\nBling like it ain't a thing, wings on the 8-50 eye\nVehicle came, layed back in Rio and things\nAnd I ain't worried 'bout 'em kilos or sceno's that the streets hold\nGame is to be sold, not to be told\nI'm slippin in wallaby slippers from poverty to pro, yo\n\n[Chorus: Half-A-Mill] **repeat 2X**\n\nYa heard? yea, uh huh east west north south\nYea, Half-A-Mill-ion, DJ Ali the don", "title": "Vacation", "year": null, "image": "https://images.genius.com/cdace55ea46853fe392a282bca193979.600x600x1.jpg"}]}