{"artist": "Antoinette", "songs": [{"title": "Who’s the Boss", "image": "https://images.genius.com/6048fbc409cf8026ef1821747507c396.400x400x1.jpg", "album": "Who’s the Boss?", "lyrics": "[Intro]\nDay time, night time, any time's the right time\nWho's the boss? Of course, Antoinette's rhyme\n\n[Verse 1]\nNow here we go, hug your stereo\nIt might pump or jump around\nBum rush the sound beat it down run it in the ground\nThe bigger they are the harder they fall, oh well they fell\nTheir records couldn't sell even if you gave 'em away free\nAh, honey you're just a wannabe\nRap star, and now you're trying to front on me\nBut kids who play will suffer when the beat is on\nAnd the going gets tougher when the heat is on\nI go off and I be keeping it kept on\nMake like a rash, break out or get stepped on\nStep child you're just a son in this\nAnd Antoinette is like runnin this\nYeah dance go ahead, do that\nInstead pick up your head cause I flew that\nAntoinette taking no loss wearing no shorts\nBut telling you who's the boss\n\n[Verse 2]\nIf you were brave because you escaped or get hit wit'\nYou little nit wit\nYou better get wit' Antoinette on set cause I'm fed up\nI'm going head up, now get up\nDucks who get stuck in\nGrab your cup and I'ma fill it to the brim\nSo take a sip don't bite\nYour lip don't take bites out or it's gonna be M.C.'s lights out\nThe young the old the bold they all like be looking\nBecause I'm hooking, but I ain't a hooker\nSo save that for T.J\nThat he-say and she-say ain't no threat\nI'm knocking out gangs with no stress\nSo who's the boss? It ain't a weak chick\nSo let me launch a rhyme and let the beat kick\n\n[Verse 3]\nLace up so you could face up and hit the lineup\nPlay me wrong and yes you might wind up\nDead on arrival, because this is survival of the fittest\nSo do your pushups and get wit' it\nBefore I go off without that\nNo question about that\n(\"They're closing in!\") Yo, I doubt that\nFace to face, rhyme for rhyme\nFist to fist, sweet dreams when rings hit lips so\nSlow down, I won't go down in a throw down\nYup she's out now that's another hoe down\nYou should be knowing this\nYou can't flow with this\nThe best, the gangstress, the def soloist\nI roll, the mic transforms like a decep\nA's in effect so who could possibly e-fect\nThe chick with soul, the boss who has to master\nTo ducks who front I make like a ghetto and blast ya'\nI'm hyper, riper, doper, stronger\nBreakbeats get broken and rhymes last longer\nI'll find and lose ya and left ya lost\nAnd you sweat to death like a horse\nNow who's the boss?", "year": null}]}