{"songs": [{"album": "DiCaprio 2", "year": "2018-11-26", "title": "Tiiied", "image": "https://images.genius.com/a24486c6e4c335d50ce79fdcf7bef5ac.1000x1000x1.jpg", "lyrics": "[Chorus: J.I.D]\nI been so down on my luck and stuff ain't lookin' up\nI need somethin' that's takin' me higher\nAnd maybe I'm outta touch in a rush\nAnd life been kickin' my butt but that ignited the fire\nAnd maybe it's when I'm spillin' my guts\nI know you don't trust me, you love me, instead you call me a liar\nOr maybe you really hate me, you can't be\nI need for somethin' to save me 'cause, little baby, I'm tired\nYeah\n\n[Verse 1: J.I.D]\nHow you gon' dump me and then leave wit' my hoodie?\nAnd you ain't comin' back, give me back my hoodie\nAnd now you tryna make a scene at the movies\nYou really wanna act, bitch, we at the movies\nI want my money back, I'm leavin' for goodie\nAnd I get mad, I don't even wanna be here\nAnd you get mad 'cause you don't even wanna leave here\nAnd now it's bad 'cause we ain't even seen the previews\nAnd now she mad, takin' shit to social media\nAnd I just need you to tell me how you feelin'\nAnd I just need you to come at me wit' real shit\nBotherin' people 'cause we fightin' in the dark, yeah\nWe ain’t gotta leave but we gon' sit a seat apart (Yeah)\nUh, tears in the bucket of fuck-its\nFightin' and fuckin' and tusslin' and fightin' and fuckin'\nLovin', lovin' unless you lucky\nI fuck wit' you because you real and you beautiful\nBut still, starin' at the screen only thinkin' how I feel\nFor real\nI wanna share my popcorn wit' you\n'Cause I won't eat the whole thing\nBut you still got an issue\nAnd I been tryna sip yo' drink, meet the kid in the middle\nBut no, boo you, she just goes to the car\nPull up, she drove, didn't open the door\nSo cold, outside\nAnd ya boy need a ride\nOh God, it's really a problem\nAnd I'm so tired of\n\n[Chorus: J.I.D]\nI been so down on my luck and stuff ain't lookin' up\nI need somethin' that's takin' me higher\nAnd maybe I'm outta touch in a rush\nAnd life been kickin' my butt but that ignited the fire\nAnd maybe it's when I'm spillin' my guts\nI know you don't trust me, you love me, instead you call me a liar\nOr maybe you really hate me, you can't be\nI need for somethin' to save me 'cause, little baby, I'm tired\nYeah, I'm tired, baby\n\n[Verse 2: 6LACK]\nHey, how you gon' leave wit' yo number on my phone bill? (Bill)\nLook inside yo' wallet you got one bill (Bill)\nNever got a job but you want chill (Chill)\nGirl, that shit is unreal (Unreal)\nI'm feelin' a little sluggish\nYou think I'm entertainin' all the rubbish\nIt's a no from me, dawg\nI guess I gotta let you free fall\nFlippin' through my shit like we in a gym, naw\nI'm talkin' my shit 'cause I'm off the Hen', dawg\nIf I, uh\nThere ain't nothin' left to admire\nI been listenin' to Mýa like woah\nDon't you let the love turn to pyro\nHow you let it drag on? Spyro\nGoin' 'em at right hand, spirals\nI'm seein' Z after Z after Z\nHe, wait, who after me, huh? (Huh?)\nWait, don't actually explain it and I don't wanna know\nI'm tired every time I come home\nShe all alone, it ain't my fault\nI'm livin' life, she in the dark (Yeah, yeah)\nAin't got no bite, a lot of bark\nI clear the room, so we can talk\n\n[Chorus: J.I.D]\nI been so down on my luck and stuff ain't lookin' up\nI need somethin' that's takin' me higher\nAnd maybe I'm outta touch in a rush\nAnd life been kickin' my butt but that ignited the fire\nAnd maybe it's when I'm spillin' my guts\nI know you don't trust me, you love me, instead you call me a liar\nOr maybe you really hate me, you can't be\nI need for somethin' to save me 'cause, little baby, I'm tired\n\n[Verse 3: Ella Mai]\nTired (Tired)\nThat makes two of us\nI'm a liar (Liar)\nWhere's the truth in that?\nI can't figure how you run your mouth\nYou been so down on your luck, and stuff ain't lookin' up\nYou need somethin' that's takin' you higher\nMaybe you're out of touch in a rush\nAnd life been kickin' your butt, but that ignited your fire\nAnd baby, it's when you're spillin' your guts\nYou don't trust me, love me\n'Stead he call me a liar\nOh baby, you really hate me, you can't be\nYou need for somethin' to say\n'Cause, little baby, you tired\nTired\n\n[Outro]\nPublic service announcement\nNiggas ain't shit\n(Niggas ain't shit but a tongue and a dick)\nHey\n(Niggas ain't shit but a) What? (And a dick)\nOkay\nNiggas ain't shit but a tongue and a dick\n(He ask me where I'm at like I owe him shit)\nPeriod"}], "artist": "JID"}