{"songs": [{"lyrics": "Just like bums, we used to stay in the slums of LA by the way\nGang-bangers killin' each other for rep, sellin' rock cocaine on my doorstep\nHad a ball to bounce plus a bike to ride, but my mama never would let me play outside\nBut when I got enrolled in elementary school, started bangin' like a fuckin' fool\nSo cool, throwin' up gang signs to the gangster beat, shot an enemy from across the street\nMama came home, said she got a good job. Daddy did too. Now they don't squab\nFinancially, we improvin'. 2 months later, son, we movin'\nNo more duckin' from shotgun shells. Bought a two-story house in East Palmdale\n(give it to me now.)\n\nPalmdale, come back to me\nI need you and I love you, baby\nPalmdale, come back to me\n(Check it out, check it out, check it out.)\n\nNo more rats and no more roaches, livin' next door to football coaches\nNow I got a new place to sell me crack. Now I got little white kids to jack\nI stopped wearin' blue, wasn't trippin' on red. Too busy squabbin' with the skinheads\nStupid questions, distract the class. Rubbin' little white girls on the ass\nI didn't really care if I passed or failed, I knew I was headed for the NFL\nUntil the playoff game, shoulder got hurt. I thought about my future, layin' in the dirt\nI can't jump, I can't flinch. Superstar player, ridin' the bench\nGraduate from school? Don't make me laugh. I got an F+ in basic math\n(give it to me now.)\n\nPalmdale, (Hell, yeah.) come back to me\nI gotta do one song for my neighborhood. Bucccoooc!\nPalmdale, come back to me\n(check it out.)\n\nI knew I couldn't make it in the white man's world, so I bought me some khakis and a Geri curl\nI knew I couldn't make it to the NFL, so I went to East Palmdale and started slingin' yayo\nFor sure! I was makin' crazy dough. Should've dropped outta school a long time ago\nBought a cell phone, like a nut. Now I deliver like Pizza Hut\nI drunk whisky and Bacardi. I sold dope to anybody\nMe and my homies sold dubs and dimes, took turns bustin' rhymes just to pass the time\nA white man drove up to my spot. He said, Hey, homeboy, what you got?\nI put a fat rock inside his hand. About 25 sheriffs jumped out the van\n(Get down, punk.)\n\nPalmdale, (Hell, yeah) come back to me\nI need you and I love you, baby\nPalmdale, come back to me\n(check it out, check it out, check it out.)\n\nCan't get drunk. Can't get blunted. LA County, 95 hundred\nCrips wanna take my All-stars. Bloods wanna eat my Snicker bars\nThem peckerwoods don't want none, but the Mexican's straight own one\nThem Ese's, catorces, treces always try to test me\nSo I jumped off the bed, cause I ain't no punk. Jammed his head up against the bunk\nSocked that Cholo in his chin. Black mother-fuckers scared to jump in\nSheriff broke it up when we hit the floor. I kept talkin' shit cause I want some more\nBack in town, we get along with the brown. Now I'm in jail, they tryin' to beat me down\nJail is hell, but I'll adapt. Won't hesitate to get in a scrap\nCause I'm down for mine, and that's for certain, sittin' in the hole with my knuckles hurtin'\n(Palmdale)\n\nPalmdale, (Hell, yeah.) come back to me\nI need you and I love you, baby\nPalmdale, come back to me\n(check it out, homeboy.)\n\nNow I got a fucked up life. Two bad kids and a naggin' wife\nDead end job at the airport. Check too short to pay the house note\nTurn on the TV, then I see different homeboys that went to school with me\nPlayin' in the NFL. We used to kick back in East Palmdale\nRodney Williams. Lorenz Tate. Zeno plays for Colorado State\nI wish my homeboys much success, but at the same time, I still get depressed\nWalkin' through the wind with a cup full of gin thinkin' 'bout things that could've, would've, should've been\nI wipe my tears, sip my beers, wish good luck to my peers\n(Palmdale.)\n\nPalmdale, come back to me\nI need you and I love you, baby\nPalmdale, come back to me\nCause that's where my heartache began, heartache began\n\nPalmdale, come back to me\nI need you and I love you, baby\nPalmdale, come back to me\nCause that's where my heartache began, heartache began\n\nPalmdale, come back to me\n(Hey, all the homeboys on the football team, where y'all at?)\nPalmdale, come back to me\n(Hey, wherever you at in the world, I don't care if you in Japan, Africa\nHey, you know how we used to do it, man. Hey, hey, hey.)\nYo, let me get a Palm (Palm!)\nYo, let me get a Dale (Dale!)\nYo, what do we sell? (YELL!)\nYo, where we fittin' to go? (We fittin' to go back to jail!)\n[X4]\n\nDale. Palmdale. (Hey, everybody just clap your hands.)\nDale. Palmdale. (C'mon, c'mon, c'mon. Buci-buci-bucccoooc!)\nDale. Palmdale\nDale. (Where them Falcons at?) Palmdale. (It ain't over 'til the fat man sings.)\nDale. (Little Rock can't get none. What, what?) Palmdale\nDale. Palmdale\n[Fade out.]", "title": "Palmdale", "album": "Sell Your Dope", "image": "https://images.genius.com/4fa9a8e1c0931cd6c1441fc3a0034c92.600x600x1.jpg", "year": "2009-01-01"}], "artist": "Afroman"}