{"songs": [{"year": "2014-12-11", "album": null, "image": "https://images.genius.com/937899817bbca48d3fbf47a8d864ae81.807x807x1.jpg", "title": "Patience", "lyrics": "[Talking]\nTurn up ho\nWhat up Fresh\nHa Ha\nI swear I'm outworking\nU niggas\nLINK UP\n\n[Verse 1]\nOne Thing I Can't Trust Is A Liar. I Swear, Im On Fire\nSteady Killing Niggas. Caught A Grip, Just Like Some Pliers\nYou Can't Fuck With Me, Im On My Job, I Can't Get Fired\nCame Up On Some Money, Now Im Flyer Than A Flyer\nTold All Of My Niggas, We Gone Get It, Just Be Patient\nEveryday Im Working. Man, I Need A Damn Vacation\nJumped Up Off The Benches, Now They Got Me In Rotation\nI See That She With You, Now Thats My Girl, Boy, No Temptations\nThe Same Niggas That Told Me, That I Wasn't Gone Be Shit\nIs The Same Nigga Thats On My Line, Just Bandwagon My Click\nSince Day One, I Saw The Vision, I Had A Spot At The Top\nAnd Im Just Warming Up. This Shit Here, Won't Stop\n\n[Hook]\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now (We On, We On, We On)\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nIt Just Took A Lil Bit Of That Hustle\nTook A Lil Bit Of That Grind\nMy Whole Team, We Eating, Baby\nYeah, We  All Gone Shine\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now\n\n[Verse 2]\nI Swear, I Was Bless With Hella Patience. Look At All They Faces\nI Smell Bullshit From A Mile Away. I Know They Hating\nIts Been Plenty Years, That I Been Put In Situations\nNiggas Keep That Bullshit In They Mouth, Just Like Some Braces\nBut I Come Out Clean, Nigga. But I Come Out Clean\nGo Back In That Fort, Young Niggas Pack Just Like Sardines\nThem Same Niggas Loyal. Boy, Can't Nothing Come Between\nExactly, Why I Do It For My Team\n\n[Hook]\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now (We On, We On, We On)\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nIt Just Took A Lil Bit Of That Hustle\nTook A Lil Bit Of That Grind\nMy Whole Team, We Eating, Baby\nYeah, We  All Gone Shine\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now\nYeah My Nigga We On Now"}], "artist": "K CAMP"}