{"songs": [{"title": "4th King", "image": "https://s3.amazonaws.com/rapgenius/brotherali-flag-1.jpg", "lyrics": "[Intro]\nShit, you know a new hot beat come out and everybody gotta jump on the bandwagon on that trendy shit and rock on it\nYa ain't got this beat, though!\nShout out Jake One!\nUh!\n\n[Verse]\nY'all see trends and pretend\nI'm a veteran which means I'm pre-trend\nHand grown beats, sweetened, weakened, and watered down\nI lead men, never follow clowns\nMost time my soul speaks, then I jot it down\nTherefore, most weekends I'm out of town\nFirst class seat, feet seldom on the ground\n'Less I'm in the V, she got her pedal to the ground\nI do not friend and de-friend, I'm all around\nKeep them 'till the end, go every round\nNow, got a couple dead homies but no ex-homies\nOnce I give my word by that I'm bound\nRacks on racks is in my hands, my cash is in advance\nI don't just put it all in my raps, it's in my pants or\nTucked under the mattress or in the bank\nI ain't telling y'all exactly, I'm more savvy than you think\nI walked around with gats and carried a little shank\nCause the world treat me bad and I couldn't afford a shrink\nShit was rough, I scribbled it in my books\nThey say you must be independent cause your image sucks\nThey say necessity's a bitch\nOr the mother of all inventions, you take your pick\nEither way I ain't afraid to take a risk\nSo that's the one I made my babies with\nThey saying light skin is in style, dark skin is in style\nHow come white folks always in style though? Huh\nYou can check the file but you know what's never in style?\nFat Muslim rapping albinos, uh, yeah I know\nI only love her if she in the struggle\nI can't relate to a woman who's never been through nothing\nHigh, saddity, privileged and soft\nThey pretty but they always say something to piss me off\nMy heart's forever with the underdog\nWho got nothing to give except for love accord\nYou should listen to this when you're occupying\n? frontlining\nEven if you don't join us in the Ramadan\nStarving the one thing we all got in common\nThat's why I'm not styling on 'em\nRighteous dude in a Maybach I'm Stalley on 'em\nMore like a four-door Honda on 'em\nPut my baby mama through college on 'em\nOff a type of rhyming they find inspiring\nI'm not a boss on a yacht, I'm Basquiat\nBefore I finish the rhyme, you start rewinding\nCause everything that drops out my mind's a diamond\nI'm only rocking the bling that's in my chin\nDiamonds and gin, to shining from within\nThat's some shit the poor people say\nMaybe so but it's true for me either way\nYou can ask your man Hov if I'm blinging\nHe gotta admit it (Uh, it's just different)\nThe best verse on a song I ain't even on\nIt's either now, 4th king, never steer you wrong\nReporting live, A-L-I, your brother\nMourning in America, dreaming in color", "year": null, "album": null}], "artist": "Brother Ali"}