{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/2a93856f78af856011f450fe4967ca0b.300x300x1.jpg", "title": "Friends", "album": "Weekend Warrior", "lyrics": "[Verse One]\nI saw this girl from like around the way\nI told her I was the B-I-Z Emezah-A\nShe said she know my reputation, know I got clout\nAnd like to get to know me, without no doubt\nSo we started havin long telephone conversations\nTryin to feel each other out, showin a lot of patience\nWas a hook-up from my man, word bond she was bad\nIf I met her whole family I would kiss her dad\nSo in my mind I was thinkin she really liked me\nShe got a good head on her shoulder and she's no dummy\nMe and her, had compatible horoscopes\nBut she bugged me out so bad I was on the ropes\nNow when I was with her, my shoulders shrugged\nBecause when I reached out for a kiss and hug\nShe mushed me in my face, and smiles with a grin\nAnd said this question\n\n[Chorus]\nWhy can't we be friends?  We can't we be friends?\nWhy can't we, be, friends?  We can't we be friends?\nWhy can't we be friends?  We can't we be friends?\nWhy can't we, be, friends?  We can't we be friends?\n\n[Verse Two]\nI knew she was different, a very special gal\nFor the time being, hmm I shall\nRespect her wishes, she wasn't a groupie\nI understand, she said she just had met me\nI liked her for that, a woman with morals\nShe called me every day, so I saw she was loyal\nIt bugged me out cause I don't usually wait\nBut on a scale of one to ten she was a twenty-eight\nWe was goin out on the reg', movies and dinner\nAlways stay at my house, way past ten o', clock\nI thought she really really liked me\nI did the right thing, like my name was Spike Lee\nShe had her own car so I walked her to the door\nLike Busta Rhymes I said, \"Gimme Some More\"\nSo I put my lips out, to get a kiss\nAnd she said just like this\n\n[Chorus]\n\n[Verse Three]\nI knew somethin was wrong because my mack is correct\nTalkin for six months and didn't hit it yet?\nI thought I was slippin, or maybe in a slump\nI felt like Eddie Murphy when he was Professor Klump\nNaw it can't be, she's here every day\nSo I don't know why she'd wanna treat me this way\nI gotta investigate like Magnum P.I\nI just don't understand, why oh why\nSo the next time I saw her she was unhappy\nShe had a frown on her face and real jumpy\nI said, \"Yo what's wrong?\"  I was real concerned\nThe way she looked her life had took a real turn\nShe said, \"I went to court today,\" and I said, \"What?\"\n\"If I tell you this, you're gonna go nut\"\nI said, \"Tell me I can take it I won't pretend\"\n\"I gotta go to jail for life, so..\"\n\n[Chorus]"}], "artist": "Biz Markie"}