{"songs": [{"title": "Bring the Noise", "lyrics": "[Master P]\nThis for my nigga Young Bleed, ya heard me?\nYoung Bleed, hah hah, ungh\nFrom the South to the West bring the noise\n(Bitch I see you there, whas happenin?\nOh what you don't remember me? I'mma come out motherfucker, know how I do)\nAin't No Limit, unggggh\n\nUngggggh, bring the noise, nigga\nUngggggh, pass me them toys, nigga\n(repeat 2X)\n\n[Mystikal]\nYou need a fuckin whole army if you think you gonna take me\nI come up in this bitch and start goin CRAZY\nNo more Mr. Nice Guy, excuses be given but that's how you MADE me\nBitch this real life, it ain'ts to be played with\nOne false move, niggas I tear purchasin the pavement\nHad to get my shit together straight never flyin right from a sandpit\nHad to get my foundation mo' stable, and tighten up on my PAPER\nUncle Sam get out the way I don't care so hand the number\nTo my pager watchin for weasels, but still take good care of my PEOPLE\nKeep handlin my business I'm in it to win it -- YEAH!\nFuck the party I'm workin hard from seargeant to lieutenant\nLet's get it started to fin' it, my beginning is your ending\nIf I want it I GET IT, AND IF I SAID IT I MEANT IT\nHOW IN THE FUCK you gonna PLAY ME, smile in my face like you LIKE me\nBitch you might as well HATE ME, you don't value my LIFE\nDetermination, balls of fate, is how I got up in here\nSo don't get SHOT up in here get out the way bitch we GOT IT from here!\n\nChorus: Master P\n\nSo, bring the noise, niggas unnnngh\nSo, pass me them toys, nigga unngggggh\n(repeat 2X)\n\nNiggas duck when I came I mean I buck and they ran\nHow many fools screamin Soldier but they couldn't maintain\nI had my Soldier ranks high and across my fo'head\nIs there a heaven 4 a gangsta, that what my pah said\nI learned to, double it up for some dollars\nHooked up wit a dopefiend term I sawed shit into hard powder\nI'm on the block slangin amphetamines\nI'm thinkin about my ghetto dreams on a triple beam\nAin't no, turnin back I'm way too deep\nI got prices on my head by niggas in the hood and the police\nA young nigga tryin to make it\nTwenty inch rims, candy wood, that's why they hate me, Soldiers\n\nChorus\n\n[Young Bleed]\nNigga if you ain't ready now you won't ever be ready\nThey tryin to catch me for steady stackin confedi it's heavy\nBut let me explain the game to break the chains of pain and, misery\nPlayin my fame throughout this game and, remain a, mystery\nIs you peepin my skill? Is you seein is it real?\nIs you hurtin from hatin makin me reach for my steel?\nKnowin I'm runnin with ballers and steady clickin with killers\nGraveyard peelers masterminded drug dealers, and bitches love\nNiggas payin dues without nothin to lose\nActin a fool the savage style from New Orleans to Baton Rouge\nI'm the cool out, makin it pop, it don't stop\nTil I stack a million chips that's off the top, is you feelin me?\nI'm willin, it ain't no killin, I bet\nYour life'll never be the same from blood spillin\nHeavens to Merkatroid gotta be fouler like the Big Boy\nShakin up some shit I thought you knew I bring the noise, bitch\n\nChorus\n\n[Master P]\nHa ha, No Limit nigga\nBringin the motherfuckin noise\nYoung Bleed, pass the toys\nMystikal, and I got it Master P\nLet's ride out nigga, handle our business\nBurst the game on these stupid bitches and get paid\n*gunshot*", "album": "My Balls and My Word", "year": null, "image": "https://images.genius.com/1613c69d81c9bbfbbbbe477f2130bb6f.500x500x1.jpg"}], "artist": "Young Bleed"}