{"artist": "Andre Nickatina", "songs": [{"title": "Andre Nickatina", "album": "Raven in My Eyes ", "year": "1998-06-23", "image": "https://images.genius.com/7e1daec351ffc7c86dc485eebe9de835.220x220x1.jpg", "lyrics": "OK.. got some for me?\n(San Quinn)\nYeah, yeah, listen to the story I'm about to tell\nAnother tale about that yayo\nLittle girl once innocent and sweet\n14 introduced to the street\nStarted from weed, big smoke outs\nBefore you could exhale, blunt in your mouth\nSham, Nay, blew you blew\nNow you need something else to do\nA new high to try, a new place to go\nIntroduced to the yay to the yo\nHouse full of girls, old and young\nPlayin it on the table takin one on ones\nUse dollar bills just to snort the lines\nYou see the big girls do it so of course it's fine\nCocaine enforced on your mind\nNow blow, then they blowin ya time\nLet's go\n\n(Chorus 2X)\nAyo for yayo\nWalk around with yayo, all in my nasal\nI must have been craze yo\n(San Quinn)\nChompin and compin kicks\nSupplyin people with they fix\nWhere you fit?\nFillmore Street is where you sit\nDon't go in the house till you move a zip\nWorked a day and night shift\nTo stay awake, a nigga might sniff\nNot too much cuz you might slip\nInstead of 28, you cookin 26\nKeep a gat in the pack in the sock\nTake a couple of tubes, then its back to the block\nBack to the service out the sack\nExperimentin with that salt, what about that crack, huh?\nOne try, another try without a doubt\nPapered out, always at the Powder house\nDay time, night time, nigga part it out\nCouldn't been papered a power house\n\n(Chorus 2X)\n(San Quinn)\nLike you and I, super high, like superfly\nOne more line, one more rhyme like Peruvian Fine\nI can keep you down, and get you high\nYou like to blow? like Boston George\nYou want some more, for you and your whores?\nI kick off wars, and get behind walls\nAnd corporate doors, executive nose sore\nRich man, high, eight balls and quarters\nThey call me, placin they orders\nBring me across the border, buyin the case\nBefore I'm sold, they take the case\nSnortin habit, not with affordin\nSome use me, strictly out of boredom\nI hooked people before man, I warned them\nI took many people out before them\nDoin my job, connected wit the mob\nGot President Bush, Whitney, and Bob\nMany others all walks of life have one on ones with me every night\n\n(Chorus 4X)\nThat's some good coke"}]}