{"songs": [{"image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg", "title": "Grindin Freestyle", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "[Intro: Nicki Minaj]\nOk, ok, ok\nKyuhh\nC'mon, c'mon\nUh-huh, listen\n\n[Verse 1]\nYe' ain't say nothing lil' mama I got those\nAnd I'm about to bl-blow like snot nose\n(Whuh!) Oh no, no homo (Ugh!)\nThis is for my niggas, my niggas that don't know (C'mon!)\nPlease tell these rap bitches to get ready (Ugh!)\nDon't get gassed unless you're getting getty\nDon't get jerk j-jerk don't get nutty\nFix up your paperwork, you're somebody\nBut! You ain't better than the President (No!)\nI'm just too eloquent, bitch, I'm the President!\nI be sitting on a elephant, huhuhuh\nCounting all my money where Stella went, hahaha\nAnd I don't need my groove back (Oh)\nUnless the nigga looking like 2Pac (Oh)\nUnless he got colors like Toucan...\nSam (Uh-huh), Sam I am! (Whuh!)\nDifferent color Lambs, Green Eggs and Ham (Okay)\nBet I could bake a gram like the baker's man (Okay)\nStop running up on me like who? what? when?\nI stay around the white like the Ku Klux Klan (Okay)\nI stay around the sand, butter-pecan tan (Look, haha)\nButter-pecan tan (Kyuhh)\nI stay around the sand, butter-pecan tan, nigga\n\n[Bridge]\nDamn\nLook, I'm a bad bitch\nI'mma give y'all a couple more bars, it's nothing\nListen.... (Kyuh!)\n\n[Verse 2]\nI was shotgun when the Bentley cruised up (Word)\nI'm a bad bitch let me put my shoes up (Okay)\nI don't say hi, I just throw my 2's up (What up)\nWhen I'm in Texas I chuck my deuce up\nBitches is snakes, sorta like Medusa (Ahh!)\nI get on the beats like a new producer\n(I hate Nicki Minaj!) Just excuse her\nI'm in a GT, she in a PT Cruiser (Hahahaha)\nI mean the PT bruiser\nDang, lil mama, you is such a loser (Okay)\nOkay, you is such a loser\nDang lil mama you is such a loser, huhuhu\n\n[Outro]\nI mean... If I'm not the baddest bitch who the fuck is?\nI mean when I do it's done\nY'know! Get who you want..\nLike, I'mma body every last bitch in the game\nI'mma sit on my throne and\nAnd, you know these bitches, you know be\nPicking my fruit out\nI want some fresh strawberries and shit\nTell them bitches to be ready to pick my fruit out\nI'm a be sittin on the throne\nLike Michael Jackson and Eddie Murphy, it's nothing\nY-Y'dig? Hahahahaha"}], "artist": "Nicki Minaj"}