{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/330345c8e2f17c8bf3fe4a8ab26ca88a.640x640x1.jpg", "title": "Look at What I See", "year": "1995-10-24", "album": "Smile Now, Die Later", "lyrics": "[Verse 1: A.L.T.]\nDomino, now we're in the mix\nI know that you holding 3-5 and a double 6\nI got yo' money fool now what you gonna do\nYou're acting like them fools on the other side do\nBut all that heebity-heebity shit is old\nWe got 15 platinum to your one pussy ass gold\n(Hold up, wait a minute\nA.L.T. put some motherfucking curse once in)\nNow I'm back on the streets after five and the deuce\nAnd everybody's trying say there's a gang truce but fuck that\nI gotta put away the one that put me in to the pen\nThe one who made the stone from a grin\nNo more old school fights I got you in my sights\nMy blast is gonna light up the night\nIf you're gonna talk the talk, walk the walk\nCause your body fits perfect in the outline chalk\n\n[Chorus: Diane Gordon & A.L.T.]\nLook at what I see... Look into my eyes..\nTake a look at life to the eyes of the criminal\n\n[Verse 2: Frost]\nTake a look into my eyes can you see what I see\nA day in the life of a G\nCuffed up, ruffed up and kick when I'm down\nSome say I play the tears of the clown\nWest Coast down to the bone\nI made it on my own with my motherfucking rhymes and my chrome\nMoney in the bank and the pound of dank\nA flight out of Kennedy I think that's the remedy\nJust like the weed, them fools is wack\nTrying to rap on the West Coast gangsta track\nBut that ain't happening and they ain't platinum\nReach back like a pimp n' I'm slapping 'em\nNow should I take my .45 and demand mine\nSince I'm the hitting bomb call me dilemma\nStraight up parlay I'm West Coasting\nNever leave the pad without my .9 in my holster\n\n[Chorus: Diane Gordon & A.L.T.]\nLook at what I see... Look into my eyes..\nTake a look at life to the eyes of the criminal\nLook at what I see... Look into my eyes..\nTake a look at life to the eyes of the criminal\n\n[Verse 3: Frost & A.L.T.]\n19 motherfucking 95\nBalling through the hood with my 'Lac in drive\nRagtop rag hitting side to side\nBut Frost got ?? for the bails tonight\nJust last week I was ?stalling?\nPicking up money smiling as I was in Terminal Island\nI just made parole so it's time to stroll\nPick up my man A.L.T. and we're roll\n\nAyo, Frost pass the keys to the trunk\nSo I can get the shells and the Mausberg pump\nSo I can go wild like I don't give a fuck\nSo I can make the pump 12 gauge go buck *shot*\nTake a look in life to the eyes of the criminal\nThere's no picket-fences and life ain't sample\nI'm living day today homie check it\nI can take your life in the L.A. second\n\n[Chorus: Diane Gordon & A.L.T.]\nLook at what I see... Look into my eyes..\nTake a look at life to the eyes of the criminal\nLook at what I see... Look into my eyes..\nTake a look at life to the eyes of the criminal\nLook at what I see... Look into my eyes..\nTake a look at life to the eyes of the criminal\nLook at what I see... Look into my eyes..\nTake a look at life to the eyes of the criminal"}]}