{"songs": [{"album": "All 6's and 7's", "image": "https://images.genius.com/7d4c4dfa3d56e3cd0f59836ef122ff24.1000x1000x1.jpg", "year": "2011-06-07", "title": "Delusional", "lyrics": "[Intro: Tech N9ne]\nYeah, like this\nI'ma drink this Henn, I'ma keep this grin\nBut if you look at N9na closely\nI'm tryna contain this beast within\nI know some of y'all already knowing\nThat I got a lot of cheese to spend\nBut that don't change the fact I go insane\nI've got a heap of sins, please begin\n\n[Verse 1: Tech N9ne]\nI saw the glitz in all of this when I was just yay tall\nAnd I pictured y'all and it wall to wall but they all said I was just\nDelusional\nBut the people startin' calling us and I'm balling tough\nBut the crawling rough and I never thought of stuff with saw enough\nWhat the problem is now I got 'em here\nTelling all these kids I'm the K.O.D\nAnd they pumping up the volume and listening hard\nWhen I give my heart, is it\nDelusional?\nWhen I'm thinking I'm a boss in the biz\nBut I'm lost and I fake it that I'm off in the lid\nBut they pay the cost when it is dark at the crib\nSome say that if I tell them to hate\nMy people are at the gate ready for sealing your fate\nThat is up for debate because when I make\nMy music ain't no evil from Mr. Yates\nCalling me a cult leader\nI don't really know but I'ma fosho heater\nWickedness coming from Monrovia\nThey could blow me but the folks wanna soul see us\nAt the bottom with the devil look around and it be no N9na\nThey say I lead 'em to evil\nLike I was Jimmy Jones and feedin' the people\nWhen I bleed in the steeple\nThe reason they seizing me ain't no decreasing my ego\nMy power's for good, I think\nWould I shrink if somebody took away how good I ink?\nBut that would never happen I'm makin' it with the rapping\nBut they want me to collapse and when I could I sink\n\n[Chorus : Nikkiya Brooks & Tech N9ne]\nI hope I find what I'm looking for\nMaybe I should drink just a little more\nDelusional\nI'm fightin' but I'm losing\nFeel like the author of confusion\nHear me!\nMy rights and wrongs are questioned in my life\nAnd confusion seems to be my alibi\nDelusional\nI'm feelin' like I don't belong\nFeel like I'm telling you to do wrong\nHear me!\n\n[Verse 2: Tech N9ne]\nShe feel like I'm\nGonna make them hate me\nBecause I was around and kick it and make them babies\nAnd now that I made it gotta escape them daily\nAnd that's crazy\nBecause all I'm doing is making the industry pay me\nBut when I show my face feeling everything's great\nDid a show then we ate then I'm outta that state\nShe said I'm a good provider\nBut daddy of the year? Man, I'm out of that race\nHow I compensate for the losses they get often dates\nThat's too personal, Will stop the tape\n\n[Chorus : Nikkiya Brooks & Tech N9ne]\nI hope I find what I'm looking for\nMaybe I should drink just a little more\nDelusional\nI'm fightin' but I'm losing\nFeel like the author of confusion\nHear me!\nMy rights and wrongs are questioned in my life\nAnd confusion seems to be my alibi\nDelusional\nI'm feelin' like I don't belong\nFeel like I'm telling you to do wrong\nHear me!\n\n[Verse 3: Tech N9ne]\nThey say I'm seeing things\nBut everybody know I'm being things, we them kings\nLike it or not we running this\nGot a lot of hype because I wanna spit\nAnd I come to grip on the fifth\nYou gotta know Tech's never gonna miss\nI know I might be a little psychy\nBut it's nightly and brightly inside of me making me a little frightening\nRipping it with the right team\nI bring hella light when reciting\nWhen it's all said and done I'm sickened and heavened\nCaused this a damned reverend\nAll 6's And 7's\n\n[Chorus : Nikkiya Brooks & Tech N9ne]\nI hope I find what I'm looking for\nMaybe I should drink just a little more\nDelusional\nI'm fightin' but I'm losing\nFeel like the author of confusion\nHear me!\nMy rights and wrongs are questioned in my life\nAnd confusion seems to be my alibi\nDelusional\nI'm feelin' like I don't belong\nFeel like I'm telling you to do wrong\nHear me!\n\n[Outro: Tech N9ne]\nDelusional\nDelusional"}], "artist": "Tech N9ne"}