{"songs": [{"year": null, "image": "https://images.genius.com/a0cc8fe946c04554a7d8c0e1032677bd.450x450x1.jpg", "title": "The Saga", "album": null, "lyrics": "(Man talking) Yo Mega man, what's the deal son?\n(Mega) Yo son, whattup?\n(Man) Yo, I'm just sittin' here, zonin' out, thinkin' about how life is\nYo, life's general for us, you know? how we livin' out here, you know\nThings we go through man, why we gotta go through this life?\n(Mega) Life is an interlude to death son, you ever thought about that?\n\n[Verse 1]\nThe saga begins\nI'm a reflection of the drama within\nThe ghetto I live in, niggas Moms on crack, Pops just disappeared\nThe first time you get locked up who really cares?\nI see a little snotty nosed with his sneakers on backwards\nSleepin' on a mattress when I go to make a sale\nAt times I wonder, are we goin' straight to Hell?\nOr does God realize we're tryin' to make it as well\nMy sleep is interrupted by food on the stove\nNot gun shots, we're immune to those\nSome of my friends first bids are two to fours\nOthers are on the run with huge rewards\nMothers watch Son's walk through the door\nFor the last time 'till they go view at the morgue\nLife is deep, we all just tryin' to eat\nRap's a mental narcotic, I supply the streets\n\n[Chorus]\nLook at my life, you see white coke and black roses\nAnd tears shed for passed soldiers\nWe all walkin' the path chosen\nFrom the cradle 'till the casket's lowered\nI still got the black ski mask to throw on\nBut I can get richer off the tracks I flow on\nI'd be lyin' if I said I wasn't hustlin' no more\nLook at my life..\n\n[Verse 2]\nLife ain't fair, shorty pregnant with nowhere to live\nSleepin' in a crackhouse 'cause she don't got no relatives\nHer friends want to drink brew and beef about who's sale it is\nNow she's gettin' hungry, she smells the marijuana scent\nI paint a picture vividly\nAs if Picasso's spirit entered me\nStarin' at the Heavens, secluded in a tinted jeep\nI'm sick of hearin' eulogies\nI realize my nigga Blue is - a reminder of my past like Greek ruins\nYet his seek keeps bloomin'\nUneffected by police intrusions\nOr street illusions we were consumed wit'\nI've even grown away from people I grew wit'\nI mean we cool, but I don't need to bullshit\nMy mood could switch easily from smooth to ruthless\nWe ain't built the same so mind games are useless\nTimes change, like the climate I change\nCheck the forecast, I reign\n\n[Chorus]\n\n[Verse 3]\nLive niggas I rep for, deceased, I pour Moet for\nThose incarcerated, my heart is wit' y'all\nI know at times it gets hard behind penetentiary bars\nThen once free you realize you're mentally scarred\nIf not physically, if subjected to correctional facilities\nPrepare for your future to the best of your ability prosper, otherwise\nYou've been conquered\nBlowin' up her mobile phone so she can send you a box\nSon, I sit inside my residence\nAnd thank God I'm blessed with this poetical gift evident in every\nGhetto like graffiti and crack sales\nAnd cabs that won't stop for Black Males\nUndercovers givin' younger Brothers bad stares\nFours clap, Dogs crap in the grass here\nYou love to hear the story Son, the saga began here\nMC are fictitious yet there's actual facts here\nLike the Bible said, Jesus had napped hair\n\n[Chorus]"}], "artist": "Big Noyd"}