{"artist": "ILL BILL", "songs": [{"title": "La Coka Starsky and Hutch", "lyrics": "Intro (Big Left)\nYo What Up? It's the original Devil Dog Big Left of La Coka Nostra\n\n(Uncle Howie)\nYo Big Left. This is Uncle Howie. Go fuck yourself, motherfucker!\n\nVerse 1: (ILL BILL)\nIll Bill be the personification of modern day violence and hatred\nA combination of science and nature designed to degrade you\nAnd make you into something capable of surviving the Holocaust\nMachinery, bitches, and weed be our power source\nBlue and red rags, green money bags, black bitches with pink pussies\nColorful things, the hunger of kings, it inspires all in the kingdom\nY’all even murdered over oil wells and selling cracks in the wrong building\nThis is gangster music, goons and gangbangers with Uzis\nPimpin’,Penthouse pussy programmin' their coochies\nCatch me in the back of the tour bus damaging groupies\nRock bitches only rap music they bang at The Fugees\nI be deadly like coke and speed, heavily smoking weed\nUncle Howie screaming, “Rest in peace, ODB.”\nWe south paw, hit you hard with hammers\nBig Left, Ill rock records, let’s bomb these faggots!\n\nHook X2\nIll Bill, Big Left\nWe supposed to be ferocious, real shit\nIll Bill, Big Left\nToo much flavor I'm major, Bill\nVerse 2: (Big Left)\n\nGive me a bomb-ass chick and i\"ll fuckin' dig out her organs\nBig Left and Ill Bill and I ain’t talking about Baldwin\nThe Bronx and Canarsie, Starsky and Hutch\nQuick to ride on you fucks without touching the clutch\nListen, I’ll run a train on a bitch with no intermission\nMy intuition tells me I need me some intervention\nFuck that shit, I’ll drink till my liver pops\nSmoke a stog, drunk driving hoping I end up on Cops\nAn Italian Charles Bronson, slick with a death wish\nForty-four death kiss, like fuck it just let the lead spit\nA bad motherfucker, white motherfucker\nQuick to fight motherfuckers, take your life, motherfucker!\nLive on the block where the pistols pop and the missiles drop\nCorner store slinging weed out in crops\nGot the lead out the box, sticking chickens like cops\nCollaborate Uncle Howie, ‘05 at the top\n\n[Chorus x 2]\n\n[Uncle Howie talking]\n\nYo, Big Left. This is Uncle Howie and Ill Bill and we’re here to get high, man. Let’s do this", "image": "https://images.genius.com/99ff63951f21bd5532d81bd64d3cbd69.800x800x1.jpg", "album": "ILL Bill Is The Future Vol. II", "year": "2003-02-03"}]}