{"artist": "Phora", "songs": [{"album": "Proverbs 18:21", "title": "A Song For Her", "image": "https://images.genius.com/cc9c764effe75591b5029dd5e4a23f6a.500x500x1.jpg", "lyrics": "[Chorus]\nWhat is love, love?\nIs it you and I, sharing lips under the scenery of the bluish sky?\nIf I told you I loved you would it be true to lie?\nI'll let you decide, I'll let you decide\nWhat is love, love?\nIs it you and I, sharing lips under the scenery of the bluish sky?\nIf I told you I loved you would it be true to lie?\nI'll let you decide, I'll let you decide\n\n[Verse 1: Phora]\nI'd spend the rest of my days with you, there ain't no other way I'd choose to use my time\nIf it's ok with you let's leave the booze behind\nAnd maybe get a snow cone or somethin'\nGirl you got my heart beating in slow-mo or somethin'\nNo rush, let's let fate take its course\nI mean, we can move fast but I can wait of course\nAnd you kiss me when I'm sick\nYou say you don't want me to leave cuz you feel lonely and you miss me when I split\nI wanna tell the world how much I love you\nI wanna show everyone that I'm softer than a pillow when I hug you\nMy friends make fun, they say that touchy shit is dumb\nBut I don't care cuz it's the truth, that's how I feel when I'm amongst you\nI've got a good spirit and good intentions\nBut your friends disagreeing they say you shouldn't listen\nTo the things I have to say, but your choice is ultimately up to you\nI just hope you think of me throughout the day\n\n[Chorus]\nWhat is love, love?\nIs it you and I, sharing lips under the scenery of the bluish sky?\nIf I told you I loved you would it be true to lie?\nI'll let you decide, I'll let you decide\nWhat is love, love?\nIs it you and I, sharing lips under the scenery of the bluish sky?\nIf I told you I loved you would it be true to lie?\nI'll let you decide, I'll let you decide\n\n[Verse 2]\nI'd spend the rest of my days with you, there ain't no other way I'd choose to use my time\nEven if I'm not with you I'm keeping you in mind\nI can't say that we never fight\nBut it's nothing that we can't fix whenever you spend the night\nYou know what I'm talkin' about baby, I can't keep you a secret\nI wanna scream until the people believe it\nThat it's possible to find love, and even though we ain't perfect\nI give you my best cuz you deserve it (deserve it)\nI get the tingles every time you call me baby\nTouch my hands and kiss me on the neck, girl you amaze me\nI ain't got no shame in showing off my lady\nCuz I don't want nobody else, and my friends say I'm crazy\nBut I never pay attention to the negative comments, cuz I've got a girl who's (jella?) than honest\nAnd when I say I love you, I mean that shit sincerely\nGirl I love you dearly and that sentence is a genuine promise\nWhen I need someone to talk to you're the first person I think of\nAlways there whenever I need ya\nSo I gotta thank you for everything that you do for me\nTaking care of me while I'm sick and ditching your school for me\nAnd the love that you show me is something new to me\nI hope that you just don't get too used to me\nHate it when you pop my pimples, but I think it's kinda cute\nJust wanna make you happy, tell me what I gotta do\nYou watchin' TV as I write this but right now I'm watchin' you\nAnd I really hope you like this cuz I wrote this song for you\nWhat is love, love?\n\n[Chorus]\nWhat is love, love?\nIs it you and I, sharing lips under the scenery of the bluish sky?\nIf I told you I loved you would it be true to lie?\nI'll let you decide, I'll let you decide\nWhat is love, love?\nIs it you and I, sharing lips under the scenery of the bluish sky?\nIf I told you I loved you would it be true to lie?\nI'll let you decide, I'll let you decide\n\n[Fade]", "year": "2012-08-12"}]}