{"songs": [{"year": "2017-10-20", "album": "Today We Rebel", "image": "https://images.genius.com/8aace4b16f6804ead4c1f5628361895c.1000x1000x1.jpg", "title": "New Portrait", "lyrics": "[Verse 1: KB]\nLook, was Christ really buried?\nIs His whole story very fairy and that was just a man?\nDid they really find His bones and then lied to keep the code\nOr did He walk out of a tomb to a throne?\nWas He God? Was He not?\nDid He buy us a spot in the Heaven or is all this a ruse?\nAre we just delusional dudes who refuse\nTo believe in the truth, are we fools?\nIs all this the white man religion?\nEuropean invention to drive the weak to submission\nHow can an African like me get the vision\nWhen these preachers owned slaves\nBut taught that freedom was Christian?\nChrist of the culture, Christ to the vultures\nCommitted genocide with a cross and a holster\nChrist of America, Christ of the system\nThat is not my Savior, that's a politician\n\n[Chorus: KB]\nChrist that the Lord knows\nChrist that was foretold\nChrist that's sure to come back in His war clothes\nWhich Christ do you believe?\nYou gotta know before you leave\n\n[Verse 2: KB]\nYes, He did arrive, yes, He was alive\nBrown Middle Eastern, definitely wasn't white\nNo, He never married, He never had any wives\nBut committed His life to a interracial bride\nYes, He did rise days after He died\nGod of the oppressed, even in it, He still thrives\nDied as a criminal from the hood part of town\nWhat can I say? Yes, He is God\nFrom the womb to the tomb to the throne\nYou can go to the moon but you can't hold to His bones\nNobody owns a saint, portraits are all failing\nHe made us in his image, Da Vinci returned the favor\nBut He is still risen, He is still risen, He is still risen\nOver the guns and supremacists, over all the division\nOver the wicked intentions, the real One is livin'\nChrist of the Galilee, Christ of the Nazareth\nChrist that will vindicate, He will make it right again\nChrist that was worshipped by the ancient of Africans\nMany men claimed Him but did He ever claim them?\n\n[Chorus: KB]\nChrist that the Lord knows\nChrist that was foretold\nChrist that's sure to come back in His war clothes\nWhich Christ do you believe?\nYou gotta know before you leave\nLets leave\n\n[Outro: Lisa Sharon Harper & Doctor Jarvis Williams]\nNow the thing I would argue is that race isn't even real\nIt's something that we create in order to determine how the polset the people will live together on this land it's a political construct\nWhat's real is ethnicity, what's real is the people groups who move through time, in space and land and are shaped by their experiences together. So I would argue we need to reclaim ethnicity\nYeah, He is the Messiah and that what is prioritized and that these are the categories that we have to work with. But Jesus doesn't sit nicely and neatly with our categories\nAnd scripture tells us clearly if you are human you are created in the image of God therefore called by God to help steward the world"}], "artist": "KB"}