{"artist": "Cam’ron", "songs": [{"title": "Girls just wanna have fun", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Intro]\nKilla!!\nDipset, shallowmain\nJim jones, santana, freaky\nLets go! what they want sing\n\n[Chorus]\nGirls just wanna have fun\n(oh girls)\nGirls just wanna have fun\n(girls juss wanna have)\n\n[verse 1]\nDamn chump pass, he a dumb ass\nCall jay off get a fun pass\nYeah she come fast, so she leave quicker\nCause she cum fast than ski ski nigga\nWe be wit her, me, jim. zee, kidder\nThen she wit flea flicker, don gg get her\nP.e wit her, wee wee, eazy, ol me, ol g little me lick her\nSo she need liquor never seem sicker, nigga, rap as fast\nShe could be twista\nHad her alley to alley, hawai and maui, and cali the valley\nUp in white lotus dog you might notice\nThat you type bogus me im quite focus\nAnd hope is hopeless, dissapaer in the air hocus pocus\n\n[Chorus]\n\n[verse 2]\nGodamn we stuck like stuck-o\nCut loose sl*t no here he come uh oh (uh oh)\nMan see what the fighting do thats why im pipng boo\nAin't even liking you, im exiting true\nJust right i do, heals high, wheels fly, real fly, nice immune\nAnd a rightous view, from high to noon, day, he play\nTheres a flight for two (first class!) and you caught you a baller. baller!\nHawker, dog you a stalker! (stalker)\nUpset cause what she was showin, awww man yo you ain't even knowin\nAsk question if youre a hoe and\nWhatz that?, who you wit?, where you at?, where you goin?, (where you goin)\nWhere you goin, im flowin, she blowin, shy high like a bowing\nGot pies like it snowin\n\n[Chorus]\n\n[verse 3]\nFemales better twirl off yours, better curl off yours\nCause i swirl off shores (then what) come back to a pearl golf course (who you)\nIm parock, cause girls are hoars, and the world is yours, honey sim sim with a pearl off cours\nAnd you know im in the buildin mister, wit the olsen twins, or the hilton sisters\nAnd i haul em in to the hiltons mister\nI milked them, i killed them, you quilt them, you missed her (missed her)\nYou helped her, you kissed her\nYou felt all the blisters, melt on your whiskers\n\n[Chorus 2x]"}]}