{"songs": [{"lyrics": "Eh-heh, eh-heh eh-heh, ay\nEh-heh.. huh.. ay\nThis is the pimp of the year\nI want I want to tell y'all a story, about this ho (yes)\nHer name was Janine\nHeh, she thought she was all that, but y'all know what time it is\nHah, I put her to work\n\n[D-Nice]\nBust it\nOne Friday night I was chillin at a party (doin what?)\nFeelin smooth, drinkin Coke and Bacardi\nI seen her on the scene, lookin lean\nThis beauty queen - her name? Janine\nI was about to push up but before I can think\nShe looked my way and then she flashed a wink (blink)\nI started to think, this crazy side\n(Heh, pimp daddy knockin out them boots tonight!)\nOh yes, she was very well dressed\nI asked her her name, and she said yes\nI said, \"Umm let me see, now is it Vanessa?\"\nShe said, \"Janine, but Chocolate fits better\"\nChocolate?! How'd you like to waste some time\nWith no hesitation she replied with, \"Fine\"\nHuh, the first thing that came to mind was\n(Heh, eh-heh) that fat ass is mine! (YEAH)\nSo off we went, back to the crib\nThe question arose, how do I live?\nI said, \"Yo, I'm not the mouse or the wimp\nTo make it clear, I'm the pimp of the year\" (pimp of the year)\nShe said, \"Please - look how you're dressed\nTell me what seperates you from the rest\"\nI said yo..\n\nYo look baby, I'm what you call a A.P.P\nAn All Purpose Pimp, haha\nCause I'll pimp yo' momma, your sister\nAnd I'll even take G.P. - that's granny panties, haha!\n\nShe was fascinated, she wanted to work\nI said, \"Okay but eighty-six the skirt\" (take it off!)\nAnd guide your tongue, from my crack to my feet (gon' be funky)\nThen.. (hah, yeah, eh-heh) you'll be ready for the streets\nDown came the skirt, before I can guess\nOff went the blouse and the bra was next (what?)\nI was impressed but I must confess\n\nHey yo Tone, that bitch had CARAZZY hair on her chest\n\"Heavens to Merkatroid!\"\nHahaha, ahahahaha\n\nI shaved her down, so the story goes\nPut her to work as one of my hoes (one of my hoes)\nThe moral of the story is girls beware\nCause lurkin in your neighborhood (is who?) is the pimp of the year\n\nHeh, aheheh, yo, ah-he, yo heh\nYo this the pimp of the year, ha ha\nI wanna tell y'all, I wanna tell all y'all hoes out there\nBeware of me, ha ha, you know\nCause, I'm in your bedroom, eh-heh\nHeh, I'm in your closet, eh-hah-hah\nAy, I'm even in the skins baby, ah-hah\nAy, ah-hah, matter of fact, eh-heh, yo\nGet up off your knees ho, ah-ha, you know what?\n\n{*words fade out*}", "album": "Call Me D-Nice", "year": null, "title": "Pimp of the Year", "image": "https://images.genius.com/eb0cb470ed0037a539adc0b84eb90ebd.432x432x1.jpg"}], "artist": "D Nice"}