{"songs": [{"year": "2018-09-03", "album": "Luca Brasi 3", "image": "https://images.genius.com/8a6e0542397ba5643257566c4e03615e.500x500x1.jpg", "title": "Great Man", "lyrics": "[Intro]\nAyy\nDealin' with heartbreak, heartbreak\nI’ve been dealin' with heartbreak\nNigga, my heartache\n(Know I'm sayin’?)\nSwear to God\n(You know)\n\n[Verse 1]\nLook in the mirror, what do you see?\nI see someone dealin' with heartbreak\nWhen I love a nigga, my heartache\nI know how a Cuban cigar taste\nBut that do not help with the heart pain\nMy lil' brother died in a car chase\nAnd spent on my older brother from beside the whip\nHe got the car sprayed\nGuess he got through on the crossway\nThankful that we ever crossed ways (Allahu Akbar)\nWonder do heaven got hallways? (Allahu Akbar)\nPrayin' how much I say always\nSalute OG Boobie, that's all day\nBringin' it back from the causeway\nAin't fuckin' with niggas, they all fake\nWas up on my end and they all hate\nYou can’t get mad at a nigga who’s gettin' it\nIf he not carryin’ y'all weight\nI had to make a decision\nBread Winner mission to get it while y'all wait\nI get that coffee delivered\nMetric ton off the boat in a tall crate\nMaybe I'm havin’ an off day\nMaybe I had a heart and my heart changed\n\n[Chorus]\nLook in the mirror, I see a great man\nLook in the mirror, I see a great man\nJust look in the mirror, I see a great man\nI see a great man, I see a great man\n\n[Verse 2]\nI used to look like a caveman, stressin' 'til I done got grey hairs\nMe and Odell Beckham havin' conversations\nRelatin' to life well\nI told him I used to have nightmares\nOf somebody killin' me, tryna get rid of me\nBitch, I'm really retarded\nYou gotta finish me right there\nMazi was smiling when somebody shot him, diamonds on heaven in the night air\nLemme me breathe for a minute\nI mean, did a nigga not think this day would come?\nI mean from Allah we come\nTo Allah we must return\nI pour a four in a two liter\nAnd remember some joy and we all well\nI put a ho in a two-seater\nI press on the floor and the car bail\nRunnin' the raw like a Barksdale\nDump through the miles with the cartel\nSell you a dog with a small tail\nLow to the ground wit' a large head\nThe ho that you lovin', she garbage\nI'ma go vroom in a Corvette\nTake your shoes off in the apartment\nWe could go sit on the carpet\nLook, I made you some tea, she got all wet\nBut I am not fallin' for all that\nI hit from the back and she \"Aw yea!\"\nNow you gotta leave and don't call back\nI hit from the back and \"Aw Yeaa!\"\nNow you gotta leave and don't call back\nOnly the player shit I entertain\nI done matured, I was bein' lame\nI had some cuts turned into stains\nYou know I'm still prayin' for Lil' Flame\nI'm still affiliated with the game\nBread Winner Gang (Bread Winner Gang)\nCop lights, no lookin' around at the stop light\nThese niggas be actin' they not right and only security top flight\nIt might went over your head a lil' bit but it come off of Friday with Mike Epps\nSmokin' a clip with a nice hep\nWe tryna celebrate another season\nI'm tryna levitate it out of reachin'\nI'm tryna meditate you with my breathin'\nI'm tryna better ways from livin' decent\nI'm on some medication, got me thinkin'\nI roll a cigarillo with Sativa\n\n[Outro]\nI'm on a different level on the Keisha\n(Yeah) I'm on a different level on the Keisha\n(Ayy) I'm on a different level on the Keisha\nI'm on a different level on the Keisha\n(Ayy) I'm on a different level on the Keisha"}], "artist": "Kevin Gates"}