{"songs": [{"album": "The Last Rocket", "image": "https://images.genius.com/74b56667823dea124a1efe48efbe1735.1000x1000x1.jpg", "year": "2018-11-02", "title": "Bruce Wayne (Outro)", "lyrics": "[Intro]\nIt's bigger than what you thought it was\nCan you picture me rollin'?\nHaha\n(That boy Cass')\n\n[Verse 1]\nI bet they know the name and the game (Game)\nWhat's a 28? We roll out the whole thing (Thing)\nOrder up a hundred ice trays for the gang (Gang)\nBruce Wayne, Batmobile, one-of-one from Spain (One-of)\nOrder up a hundred ice chains for the gang (Icy)\nCourtside, we sit front row at ball games ('Bron James)\nThat Wraith a wide-body so I hog up all lanes (Skrrt)\nNiggas, they want clout, that's a shame, they want fame (Sad)\nBefore the \"Bad and Boujee,\" been on flame\nThey say they love those songs, don't know the group name (How?)\nI was thinkin' of goin' and buyin' my bitch a Birkin (What happened?)\nGot me second guessin' now, but it might be worth it (I don't know)\nThis shit ain't worth it, she do this shit on purpose (I don't know)\nI was nervous, remember when she curved me (Curved)\nRemember that first time I stepped on the stage, I was nervous (Nerve)\nHad butterflies in my stomach (Blrrt)\nI wanted to vomit (Blah)\nI was nervous\n\n[Interlude]\nNah, for real, keep it a hundred\nThat's how I feel\n\n[Verse 2]\nI ball, James Worthy (Ball, ball, ball)\nTold her she can have it all, gotta make sure that she worthy (Worthy)\nBitches and chickens all in my livin' room (Brrt)\nTwo twins kissin', do what I tell 'em do (Two twins)\nHollywood bitch in the kitchen cookin' chicken soup (Whip it)\nThey ain't Asian, but eat rice more than Asia do (Molly)\nI ain't gon' tell 'em how much to take, gon' do what they gon' do\nTryna talk my head off, but bae, this ain't no interview\nWhen I pour up, I don't wanna speak or conversate with you\nI know I told you lies before, but right now, I'ma tell the truth\n\n[Bridge]\nThe lion in the jungle, but I still remain humble\nGet the sack, might tumble it, but I ain't gon' fumble\nYou gotta know me to understand me\n\n[Verse 3]\nI just took a trip to Kansas (Kansas)\nPour a four, pop a Xanny (Xanny)\nShe a thottie, but a baddy (Baddy)\nThey will never understand me ('Stand me)\nNiggas, we high demandin' (Know that)\nNigga, we high demandin' (Know that)\nThe gang, we high demandin' (Price)\nThey will never understand it (No)\n\n[Outro]\nI remember the backend wasn't big enough\nNow we seein' more blue than Bonnie\n\nThere is, there's a world out there. Start the cameras. Wow, that's very, very reassuring what we're seeing here. Couldn't have done it better myself. So more than 24 miles up, successful after all this training, all this work, all this time. There is the capsule, the data and the picture there, their (Stratos Capsule's altitude is at) families celebrating. (104 thousand feet.) And our guardian angel will take care of it"}], "artist": "Takeoff"}