{"artist": "Pharoahe Monch", "songs": [{"album": "Desire", "title": "Agent Orange", "image": "https://images.genius.com/9550ab49453d639d9e2d3a07226ff0ed.500x500x1.jpg", "lyrics": "[Hook 1]\nPlease lord forgive me for my sins\nMy life is all I have to give\nPlease lord forgive me for my sins\nMy life is all I have to give\nDamn you that lost the will to live\n\n[Verse 1]\nPissed on the motherfucking White House lawn\nI threw a rock, then I ran\nCause I couldn't stand anymore within the grip of the man\nY'all wanna ask me who's sane\nThese biological gasses are eating my brain\nIts a political grab bag to rape mother earth\nThirty seconds after they bagged dad for what he's worth\nThousands will die now so millions can smile later\nThis ain't the Rockford Files nigga\nThey stockpile data for satellites\nWhere you discuss who's style is greater\nIn this killing pool you playing it cool like Cal Tjader\nWhen ya'll ready to rock like Led Zep and Al Qaeda\nWith weapons of mass destruction an hour later\nWhat's your identity today?\nYou on some John F. Kennedy or Timothy McVeigh?\nThis Henessy done left me with a remedy to spray\nFor my identity your life is the penalty to pay\nMotherfucker\n\n[Monch] {Crowd\n[Y'all ready to rock?]\n{We ready to rock\n[Y'all ready to roll?]\n{We ready to roll\n\n[Hook 2]\nMy life is all I have to give\nPlease lord forgive me for my sins\nMy life is all I have to give\nDamn you that lost the will to live\nTrapped in the game\nJust tryin to win (3x)\n\n[Verse 2]\nIts not a Vietnam song\nI know women from desert storm who came back deformed\nMissin limbs and disease and they legs is numb\nChemicals twice as strong as agent orange\nIts messages in the bass drum\nWar goin off in your mind\nNo man is safe from\nIts not a Game Boy, X-Box or PlayStation\nIts Resident Evil when every President's a mason\nRobbin y'all fools like Dick Grayson\nAnd y'all inherited roots and don't know how to retrace them\nPlace them back\nFace them facts\nDisgraceful, faceless, tasteless acts\nPharoahe takes the authorities to court\nPeep crime before it happens like Minority Report\nAnd I will never be mentally defenseless\nCatch me on the block, in the hood in the trenches sayin", "year": null}]}