{"songs": [{"image": "https://images.genius.com/304f1052c5fa7e08761ce5a6ab1ceb75.500x500x1.jpg", "album": "Generation Gaming XIII", "title": "Carbon Warfare", "lyrics": "[Verse 1]\nI'm the most heartless of businessmen, I'm on a mission:\nHarming the climate with carbon emission\nFalsify facts to calm opposition\nDespite the obvious harsher condition we live in\nThe thermometer's splitting\nCan't take the heat?\nThen depart from the kitchen\nJust stop all the bitching, I'm trynna' do business\nAcquiring riches is like a religion\nMelt the last ice caps, just like that\nDeploy propaganda to gaslight stats\nThen cry 'fake news' when I dislike facts\nThat's my strategy, that's my act\nSlash and burn and amass my cash\nSalt the scorched Earth, just for a laugh\nDon't get caught in the global warming hoax\nAll the warnings are totally boring!\n\n[Hook]\nI, just want to watch the world burn\nEarn what's mine\n'Til we arrive at the point of no return\nI, just want to watch the world burn\nBurn\nWe'll never learn, we'll never learn, we'll never learn...\n\n[Verse 2]\nAim:\nCreate massive pain\nSpray acid rain\nAssassinate Mother Nature, that's the game\nNatural disaster, that's what we're after\nTapping that ass like I'm fracking for gas\nLook:\nGas guzzler\nMass muzzler\nFact shuffler\nCrap shoveller\nBlast muffler\nThe whole planet's last hustler\nDat autocratic fat cat sat smug on a pandaskin rug\nThat I had smuggled in from the jungle I'm cutting up\nMy cash stocks and the temperature's looking up\nNo inspectors'll get through me\nYou'll regret if you reckon that I'll let you see\nI'll affect every breath you breathe\nChainsmoke cigarettes in my SUV\nI'll choke the sheriff and the deputy\nTurn everyone on Earth to a refugee\nI revel in seeing the sea level reach a new piece of the beach 'til the piers beneath it\nThe Devil and the deep blue sea you're between\nIt's too late to cease when you've already seen it\nRip right through reefs like a riptide\nLook right to the sky, see hypocrites ride\nPrivate planes while describing the ways we should fight the invasion of climate change\nStop their childish ways off the climbing frames\nI say put 'em on the firing range\nI'm a tyrant, violent to my environment\nCrimes against nature, acquiring a pile of 'em\nInnit ironic, that I run it, when I couldn't give a flying fog if anyone'll survive from it?\nI'm not even being hyperbolic, I'm diabolic\nNever do I wanna' see a dial with a smile on it!\n\n[Hook]\nI, just want to watch the world burn\nEarn what's mine\n'Til we arrive at the point of no return\nI, just want to watch the world burn\nBurn\nWe'll never learn, we'll never learn, we'll never learn...", "year": "2017-03-23"}], "artist": "Dan Bull"}