{"songs": [{"lyrics": "[Intro]\nI don't know what life will be in H.I.P. H.O.P\nWithout the boy H.O.V\nNot only N.Y.C. I'm hip hop's savior\nSo after this flow you might owe me a favor\nWhen kingdom come, you ready?\nWhen kingdom come, I'm ready\nWhen kingdom come I'm ready\n\n[Verse 1: Jay-Z]\nNow everywhere I go they like HOV you back\nUp out the corner office out the cul-de-sac\nWhere's Iceberg Slim he was the coldest cat\nGet your swag back daddy where your focus at\nGot to admit a little bit I was sick of rap\nBut despite that the boy is back\nAnd I'm so evolved I'm so involved\nI'm showing growth, I'm so in charge\nI'm CEO and yeah glory to God\nI'm so indebted, I should have been deaded\nSelling blow in the park, this I know in my heart\nNow I'm so enlightened I might glow in the dark\nI been up in the office you might know him as Clark\nBut, just when you thought the whole world fell apart\nI - take off the blazer loosen up the tie\nStep inside the booth Superman is alive\n\n[Hook]\nThe King Of New York New York\nNot only N.Y.C. I'm hip hop's savior\nSo after this flow you might owe me a favor\nWhen kingdom come, you ready?\nWhen kingdom come, uh huh\nNot only N.Y.C. I'm hip hop's savior\nSo after this flow you might owe me a favor\n\n[Verse 2: Jay-Z]\nI hear \"hurry up Hov\" when I'm out in the public\nCause niggas like: \"but you love it; you be it, you're of it\n\"You breathe it, we need it; bring it back to the hustlas\"\nHad to dust off the Hammer dance, can't touch this\nC'mon playboys, bring the cars back out\nCause ya boy Hov is back, you know them broads coming out\nGot 'em dancing on the banquette, like they from Bankhead\nFuck Cristal, so they ask me what we drinking\nI thought dudes remark was rude okay\nSo I moved on to Dom, Krug Rosé\nAnd it's much bigger issues in the world, I know\nBut I first had to take care of the world I know\nI'm from the bottom, so I still feel em from the bottom\nUnderdog before my cape, still couldn't stop him\nFlash Gordon when recording, spark the light in the dark\nPeter Park, Spider-Man, all I do is climb the charts\n\n[Hook]\nThe King Of New York New York\nNot only N.Y.C. I'm hip hop's savior\nSo after this flow you might owe me a favor\nWhen kingdom come, you ready?\nWhen kingdom come, uh huh\nNot only N.Y.C. I'm hip hop's savior\nSo after this flow you might owe me a favor\n\n[Verse 3: Jay-Z]\nJust when they thought it was all over\nI put the whole world on my back and broad shoulders\nThe War-Hova, but who you know took over tracks like that\nGuess what New York, New York - we back\nAnd I ain't never been afraid of a drought\nSince I was six, seventeen been getting money down South\nBout it, bout it, Master P\nAsk the nigga Pimp C\nAsk my homie Bun B\nI run the streets the streets don't run we\nY'all run, we chill still waters run deep\nI repeat, sing a long with me\nI run the streets, the streets don't run we\nLadies saying \"Where you been Superman?\"\nWhen niggas spending ten million in media on my hands\nThe Bruce Wayne of the game have no fear\nWhen you need me just throw your ROC signs in the air, yeah!\n\n[Hook]\nThe King Of New York New York\nNot only N.Y.C. I'm hip hop's savior\nSo after this flow you might owe me a favor\nWhen kingdom come, you ready?\nWhen kingdom come, uh huh\nNot only N.Y.C. I'm hip hop's savior\nSo after this flow you might owe me a favor", "title": "Kingdom Come", "image": "https://images.genius.com/4371d45b1c52d7dc87e4204ae0aa8373.900x900x1.jpg", "year": "2006-11-21", "album": "Kingdom Come"}], "artist": "JAY-Z"}