{"songs": [{"album": null, "year": "2016-04-11", "title": "Robotics", "image": "https://images.genius.com/f2cead724e6251d2b546e650f92a56d7.1000x1000x1.jpg", "lyrics": "[Verse 1]\nAlright\nNiggas be half-mad and a man paralyzed\nCan't even use his legs and thighs, ready to ride\nI'm ready to die's a lie, I gotta live\nNice ride, machete inside, you gotta chill\nNighttime, spaghetti and fries, we make a meal out whatever's in the fridge or some shit I done pilfered\nSend a dick pic to ya chick, no filter\nToo much swag, I could sell a house to a realtor\nRealtor\nReal talk\nI'm on my real ting shit\nA king of oneself, on my clothes, in my mink set\nMy mindset\nBad white girl and a fine set of twins on her chest and her kids\n745 Benz, left her old man\nSimply, cause I put that endi in Fendi\nAll by my lonesome, I'm lookin' for an Olsen\nTwin, there I go again\nSlow-mo approachin' a Benz\nWindow rolls, and the smoke billows from the ocean wind\nMakin' a (?)\n\n[Chorus]\nNigga, let that snub nose sneeze like achoo!\nHe can make that snub nose sneeze like achoo!\nI can make the snub nose sneeze like achoo!\nI could make the snub nose sneeze like achoo!\nYoung nigga blessin, blessin, blessin, blessin\nNigga, let that snub nose sneeze like achoo!\nYou can let that snub nose sneeze like achoo!\n\n[Verse 2]\nAlright, y'all would keep it cool if you knew the shit that I knew\nI know, but you ain't gon' listen for your survival\nYou just a cool guy, accompanied by a fly hoe\nWho just a fly hoe, she'll fly away on bottles\nCouple nights in Cabo, bottles, come swallow\nShe with another man on that same shit tomorrow\nYou with another chick, she flew you in from Chicago\nShe wanna be where you go, where I go\nI'm J.I.D Leonardo\nDiCaprio, put a cap in yo soul in an arrow\nMo' 4, 5-0\nWoah, woah, drive slow\nThat's only cause nobody's on top of us\nWe know they watchin' us, bifocal binoculars\nOn clock and they clockin' us\nSkin black so they lock us up\nFuckin' debauchery\nI wrote this, on Absolut and obsolete\nBlunt full of Socrates\nModern-day me\nThe comparisons is cool, but it stops at the door\nNigga, locks and the Glocks and the dogs\nTake off yo shoes and yo cool\nMatter fact, don't move, just join the movement\nThe Spill-Vill revo-fuckin-lution\n\n[Chorus]\nNigga, let that snub nose sneeze like achoo!\nHe can make that snub nose sneeze like achoo!\nI can make the snub nose sneeze like achoo!\nI could make the snub nose sneeze like achoo!\nYoung nigga blessin, blessin, blessin, blessin\nNigga, let that snub nose sneeze like achoo!\nYou can let that snub nose sneeze like achoo!\n\n[Outro]\nThe Spill-Vill revo-fuckin-lution"}], "artist": "JID"}