{"artist": "9th Prince", "songs": [{"album": "Revenge of the 9th Prince", "lyrics": "[Intro: Shyheim]\nOh shit, 9th Prince, Granddaddy Flow\nNigga, ain't been on a track with you since the Young Godz\nNow we the Young Godz\n\n[Shyheim]\nI burn more niggas rapping, then CD duplicators\nHustler, put that paper together like staplers\nThere is no competition, hustlers and musicians\nWitnessing Bottom Up, is eating more than a kitchen\nI don't give niggas fishes, I make niggas fishermen\nBusinessmen, hitmen, that's not to be mentioned\nAnd my team, we be, moving like a government\nAnd all my allies, keep it on some other shit\nEvery city I go, I got a gunning bitch\nShoot it out with police, I ain't trying to max bitch\nThis just the way I live, not on no rap shit\nFrom stiches, rip niggas so bad, they need patches\nMake 'em feel so small, I can put it in baggies\nLike, honey, I done shrunk these little bastards\nScared them with my words, I ain't have to pull a ratchet\nCuz I can make a classic like the Dr. J hook shot\nWait, I can make a classic like the MJ swish shot\nNiggas, say that I'm pussy, niggas be like \"Yo, what Shy?\"\nNot the Shy that I know that run around with them twin Glocks\nNah, nigga, nah, not Shy\n\n[9th Prince]\nYo, I'm on a mission, like a nigga just came home\nFrom prison, never cloud my vision\nChampagne bottles in the kitchen, Spanish mami\nWith a Victoria Secret leafprint\nNo panties or bra, underneath\nThe Granddaddy Flow keep these bitches in the streets\nCook it up, so I can hook it up\nSteel marks on my wrists, on them tight ass handcuffs\nSwing on the po-po, take his weapon\nLike Nicholas Cage, I be Gone in 60 Seconds\nI'm a monster, underneath my style, low profile\nBitches famous lifestyle, meditate by the Nile\nLong live the Prince, yeah, ya niggas live short like Bow Wow\nI hit you with everything, a plate, a chair, the kitchen sink\nIncluding the chandeleir, I need a bitch that can ride with me\nGlide with me, through this galaxy, so we can see prophecy\nThrough monopoly, yeah, cock back the cannon\nBlow a hole through the planet\nYeah, the four-fifth, will leave niggas damaged\nPlay for me, to meet the canvas\n\n[Outro: 9th Prince (Shyheim)]\nWhat the fuck ya'll niggas know?\nWhat the fuck ya'll niggas know?\nMuthafucking Granddaddy Flow\nMy nigga Shy, do or die, what up nigga?\n(You already know, nigga) we back in the booth, son (S.I.N.Y.)\nYou know, these niggas know what it is already, son (10304)\nThey know how we do (10301, 10303, yeah, nigga)", "year": null, "title": "Young Godz Pt. 2", "image": "https://images.genius.com/af61f0ef977c2f691226fe0ab315bfd9.500x500x1.jpg"}]}