{"songs": [{"year": "2012-10-22", "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "Big Boy’s Neigborhood Freestyle", "lyrics": "[Intro]\nClassic, Young Gotti\nGangsta, gangsta\n\n[Verse 1]\nLook, swallow your pride and then eat a dick\nMake the Ruler's apologize you ain't ruling the shit\nI'm Rick Rubin in 85 with the beard thick\nDick bitch tight the movie and slanted eyes that squinch\nI tell you that I'm one up, sun down then sun up\nSon, I son niggas I probably fucked up your mama\nNo condom, it's good pussy\nPussy, tell it to your honor that this trauma is Jeffrey Dahmer\nTook me too many moons set up this new platoon\nGet ambushed or kicked, pushed with push broom\nMan look, your man, look like sweet water\nCorn bread to break under pressure if he's caught up\nBig homie said I gotta crawl before I walk\nAnd if I ran my mouth then my legs would get cut off\nI'm just a  young boss with a bat cave\nBack against the wall closer my back came back with them back pains, whoa\nTell em put my name on the blimp\nBall like I'm Derrick Rose you should know my gym\nYou playa's not allowed I'm sparking your game towels\nAnd spikn' your Gatorade with gasoline I'm foul\nI'm in the crowd like Artest and them\nI move the crowd like Artest and them\nPunchlines mean I really go punch civilians\nCrunch time mean I take it to the hole\nNot this basket but rather the good pussy that I'm in\nI assassin you niggas I make you wait shake in\nBlank tapes in your deck, niggas still break their neck\nThey hear it you need plans with the label just to spin\nI need to clear it with the bank just to win\nClub accounts go 15 racks when you wet like that shit\nIt's gotta be a sin. Hm. so Lord forgive me I'm a sinner\nHm. These hoes squeeze me cause I'm a winner\nBack when we ate canned food for dinner, I coat food and the..tools make my agenda\nI show fools I'm nasty like tofu I wish a\nMotherfucker would get your whole career injured\nThis assault what a deadly weapon\nGuilt your favourite rapper, favourite rapper last record\nWe fucked your baby actress on the map just what a blessing\nMake that pussy ante up she call my dick anti-depressive\nI'm really not depressed with, none of you niggas stressing\nThat's some of you niggas bless with the gift to carry the presence\nA big in Pac and pop with..and with investments\n15 minutes come up with 60 seconds\nLast month I've been six hours inside of session\nCame up with shit writers block niggas up in this stressing\nLike who the fuck cares? who the fuck cares? Even if you get drunk up\nStill be a millionaire\nYou could play a Santa Claus and make sure you're the whole dear\nEvery verse I put that bitch in the hearse, while boy stear\nUh Church to your pussy and push me get pack..\nVerse that you cookie I read it my foot is here big boy\n\nAlright\nAnd you don't stop, and it don't stop\nAnd you don't stop\nAnd it don't stop\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't, and you don't, and you don't, and you don't stop\n\n[Verse 2]\nThis be that shit that make real niggas grab they dick\nAnd bitches rubbin' on they tits as if they think this monkeys rich\nMonkey see what monkey do, you monkeys never make no tips\nClimbup the tree shit on you\nParanoid the shit and bricks that can build the castle\nHastle and breaking your picket fence\nI know pterodactyls that still exist\nClappin if you resist to cooperate, go home and see their daughters go..\nYou at risk if you wear bracelet, we want your wrist\nWe can taste it from planet pluto\nDog Gonnit you panic just like a poodle rip out your culo then kudos\nTwo door Regals, El Caminos, and two more\nSevilles with the whitewalls, wipe it off with my shoe ho\nI feel you just menthol, meant to get smoked and sent off to your maker\nTrace your..with no the ..coach\nMean ain't no hood high up in California and G watches snoops\nLadies press down I bet you dog watchin, west coast what's up?\n\nGangsta, gangsta you don't stop\n\nAnd you don't, and you don't and you don't\nAnd you don't, and you don't and you don't\nAnd you don't, and you don't, and you don't\nAnd you don't, and you don't stop\nYeah, ah\n1 2, LA what's at it with it\nKendrick Lamar\nYou dig that, we out here\nLook\n\n[Verse 3]\nMe while I'm in Compon stomping through the swamp to swap meet\nGoing back to L.A. ya'll\nTryin to see what's poppin\nYou cannot stop me\nJay Rock, SchoolBoy, Top Dog Entertainment\nWe the best, with the west\nWho can blame me\nI've been put up on all the OG's\nDre Snoop, Quick Easy E\nDJ Quick and now it's me\nThen you see game, now we finna change\nThe whole fucking game smash it know you lames\nCompton you should already know the name yeah we pop it\nI shout out the whole westside because I got it like that\nAnd if we had it once then we got it right back\nAnd if you ever had it you won't have it no more\nAnd if we see the back though we to the front door\nTaking your bread, crucifying everybody off with their head\nThis is freestyle of the top of the dome\nAnd you know Big Boi that's my home\nWhat's up?\n\nAnd you do stop, and you do stop, and you do stop\nAnd you do, and you do, and you do and you do\nAnd you do, and you do, and you do and you do\nAnd you do, and you do, and you do and you do\nAnd you do, and you do, and you do stop"}], "artist": "Kendrick Lamar"}