{"artist": "Prince Paul", "songs": [{"album": "The Redux", "title": "The Redux", "image": "https://images.genius.com/e58569cd90b518f059533fae5240c13e.1000x1000x1.jpg", "lyrics": "[Skit]\n\"What exactly is your inspiration for this album?\"\n\n\"You were born in the sixties right? I mean most of these kids, uhh, would have been born in that century so...\"\n\"Quincy Jones you know, Quincy Jones ate rats. You know thats real, thats real poor. Eating rats is real, and that's why...\"\n\"Perhaps you're not aware, that to the contemporary ear...\"\n\n\"If you could go back in time and redo any of your past albums what would you do differently?\"\n\nYo eff-it, it's The Redux\n\n(Boy!, I'm three generations deep in gangsta-dom. Three Generations!)\n\n[Intro: MC Delite]\nHey Prince Paul, there's a story out there. They say you M.I.A, Missing in action man\nThey all up into your Kool-Aid man. They all up into your business. They don't know, that you all up in the lab with the mix\nAnd thatchu all [?] baby, like a mad scientist!\n\n[Verse 1: Breeze Brewin]\nSo what's the redux on some street corner heat [?] or armin' for armageddon regardless you calm, [I'm debtin'?]\nCan I call a retaliation? Before you speakin' I'm sorta tweakin' all up in the alley\nWaitin' to make the preemptive strike and be [?] like wid a fast break\nAnd I'll [?] it tryna throw it and make the glass break\nUnleash my inner Darryl Dawkins, [?] with my style of talkin'\nNo [?], no justice, no smiling\n[Thoughts?] is like the [?] in the ghetto cause most of yall nosy hoes\nFrontin' pinocchio to your squad, I'm Geppetto\nSo let it be known and understood, I ain't wid standin' by\nI ain't wid' havin' our legacy goin' fuckin' wood\nSo whatchu bringin' to the table? The willin' and the able\nOr the [?], that really ain't you\nI get it like [?] but while I stick with my kin\nSome swallow dick and some kids on some politics in the bi-i-iz-z\n\n[Outro: MC Delite]\nHe's ready to set the record straight\nThe one and only, DJ Prince Paul\nI am the [?], most definitely\nThe [?]: MC Delite, and we're in the buildin'\nAy, lemme tell you somethin' man\nI know y'all been sleepin', yo Paul I know they been sleepin' my man\nI know that they thought that you suckered out\nI know they thought that you was wack and that you was, out of control. Didn't know what you was doin'\nBut here he is, steppin' up to the plate\nBoom!\n\n(Welcome to the terrordome, bitch!)", "year": "2017-10-13"}]}