{"songs": [{"title": "I Don’t Need", "lyrics": "Yo listen\n\nOkay.\n\nI don't need for you to have long blonde weave down to your knees,\nI don't need for you to have the latest Gucci shoes or Christian Dior dress,\nI don't need, in-fact, I don't want you to parade around in your underwear and booty shake for me in a video\nI don't need for you to sing RnB.\nI don't need for you to be an independent woman and I don't wanna be an independent man,\nBut if we can get along and laugh and talk and have sex and dream,\nAnd laugh and talk and still like each other...\nThen maybe, just maybe, we can depend on each other.\n\nI don't need for you to wear red lipstick or lip gloss or face dust, I like your face just fine as it is,\nI don't need for you to paint your nails or to add fake ones I think they look kinda silly.\nI don't need to see your cleavage or your thighs\nI'm still getting over your eyes and your smile and I don't need any more distractions.\nI don't need, in fact, I don't want you to sit a certain way or talk like this or walk like a supermodel.\nI don't need you to lose weight.\nI do need stimulating conversation, it's like Dead Prez said - I need mind sex\nI do need to laugh with you,\nI do need to dream with you,\nI do need to be able to be honest with you.\n\nMaybe I'm getting old but,\nI'm finding that when you get to know a woman vertically they can be incredibly interesting, inspiring creatures.\nJust watching you work, watching you think, watching you eat.\nMaybe I'm getting old but,\nI can't be bothered to follow my dick around everywhere, I'm happy here and to be honest I just ain't got the energy.\nMaybe I'm getting old but,\nI feel like it's okay to be vulnerable, to be upset, to admit I ain't the biggest, baddest, strongest man on the planet\nAnd sometimes I feel inadequate.\nMaybe I'm getting old but I just don't need it any more\n\nYah know...", "year": null, "album": "DoubleThink", "image": "https://images.genius.com/1d372a1e5ce6759370053ad0e1be955f.1000x1000x1.jpg"}], "artist": "Akala"}