{"artist": "E-40", "songs": [{"title": "Broccoli", "image": "https://images.genius.com/a5f1f8095418f1fd91f86ca97ac169c0.1000x1000x1.jpg", "album": "The Element of Surprise", "year": "1998-08-11", "lyrics": "[Intro: Sung by Otis & Shug]\nLet's get Sick Wid It baby\nSick Wid it baby, yeahehyeahyeahehyeahhahah\nLet's get Sick Wid It baby\nSaid I'm gonna get so Sick Wid It, yeah\nSaid I'm gonna get highhhhh\n\n[Hook]\nI don't need no doctor, I don't need no shrink\nAll I need is broccoli and a 40-oh to drink\nSmokin that broccoli now, takes me out\nSmokin that broccoli now, takes me out\n\n[Verse 1: E-40]\nWhile I was bullshittin\nBitch tried to hit me upside the head with her shoe\nTalin bout, \"Who the fuck you been doin it to?\nComin home always smellin like tuna fish and brew\"\nI said \"Bitch, if you don't get up outta my talkin face\nI'mma slap you real tough-like\nAnd I can almost rest assure you\nThat it ain't gon' be no pretty sight, ugh\"\n2-4-7, 3-6 Fin\nI pull out my dick and spell my name over the bitch\nShoot the hundred fool, let's play for pink slips, whatchu slammin?\nThat there shit across the street? That ugly ass gremlin?\nBuy some sticky, you got the pillow\nHere go some Black'n'Mild style, split it down the middle\nWhat's that? That Oakland Crip? Nah it's that white widow\nI was about to say cause they'd botha have your ass\nUp in the hospital, check it out\n\n[Hook]\nI don't need no doctor, I don't need no shrink\nAll I need is broccoli and a 40-oh to drink\nSmokin that broccoli now, takes me out\nSmokin that broccoli now, takes me out\n\n[Verse 2: E-40]\nSmell me on this one, check it out\nHit up for 5, and hold it for 10, I'm true lung\nLet's see who got the most wind, get em sprung\nMake em wanna come back and spend, Afghani bomb\nFrom juice and Seagram's Gin\nFuck all of that Cristal-poppin, drinkin Moet shit\nI'm from the block\nWheaties, Thunderbird, gorilla milk and Aftershock\n?Boom square wide country?, Wild Irish Rose\nSmugglin Hennessey and scotch, Jagermeister and Tequila shots\nDrinkin 40 ounces was how I first got my figure\nThen I graduated to straight hard liquor\nSo hah, let me take a swig of that Crown Royal\nWhat you puttin on that blunt huh? Hash oil\nMy Panamanian saha from south San Francisco\nOn some marijuana farm down in San Luis Obispo\nWake yo' ass up Charlie Hustle, wake yo' ass up, why you asleep?\nCause, nigga that shit got my twaskin?? my life nigga, shit!\n\n[Hook]\nSmokin that broccoli now, takes me out\nSmokin that broccoli now, takes me out\nI don't need no doctor, I don't need no shrink\nAll I need is broccoli and a 40-oh to drink\n\n[Verse 3: E-40]\nSeein two's and three's\nHighly intosticated while I'm slidin on a brim\nSet of Z's and V's, spit Long Range Pimpin\nL-R-P sophisticated wannabe's, stuck up H-O-E's\nDisease-infested back-polluted pussy hoochie mamas, ooh ooh\nGive a damn, make that 2-8-9, think I had a V8\nHighly carbureator, four-barrel engine scram\nGet gas, go in sideways, figured up like a philly\nReady, get that motherfucker hop up away\nEverybody got the munchies and they ain't tryin ta miss\nWe ride around the corner, nigga there go Emmitt Smith\nWebulation! Bust a U-ey folker, oh as I'm hoppin out\nDamn that's my beeper, I got dinner at the house\nThe rules and regulations of the game up in the Yay\nJust slap a bitch silly if she gets off in my way\nShe's open to all the brothers, forgive me grandma yay\nThree or four different bitches, five or six different times a day\n\n[Hook]\nI don't need no doctor, I don't need no shrink\nAll I need is broccoli and a 40-oh to drink\nSmokin that broccoli now, takes me out\nSmokin that broccoli now, takes me out\n\n[Outro: Sung by Otis & Shug]\nLet's get Sick Wid It baby\nLet's get Sick Wid it baby"}]}