{"songs": [{"year": null, "album": "He’s Keith Murray", "image": "https://images.genius.com/7e796a2b47ce739fd258b02f553d744e.800x800x1.jpg", "title": "Child of the Streets", "lyrics": "Yo, the fruit don't fall far from the tree\nYeah, uh\n\n[VERSE 1] (Keith Murray)\nMy grandfather use to tell me\nThis place ain't got nothing to offer you\nDon't you see all the changes everybody going through\nThis family got problems and they do too\nBut everybody wanna tell you what they think you should do\nHe said watch them so called friends and them girls too\nSonny do you like they did Jesus crucify you\nAs he sat there in his chair looking out the window\nI'm thinking when you can't get away where do you go?\n(Inside your mind) man child never had a chance to be young\nEither you selling drugs or out there on the binge strung for some\nThere's only two places to go the morgue or the Pen\nFor some school is an option entertainment to alternate them\nThen they'll try to exploit you discriminate you\nUse you as a tool make money and live in luxury off you\nAnd we so confused we wanna believe in something\nSo they promise us the world but give us nothing\n\n[Hook] (Sonji Mickey)\nI say we can be all in this together\nYeah, will you end up like, your family tree\nTell me what you gonna do what you gonna do\nWhat you gonna do\nYour mind ain't too far from the sky\n\n[VERSE 2] (Keith Murray)\nThe death of a loved one remind you of yourself don't it?\nKnowing you could be next at any given moment\nLike Twine I used to call him a brother of mine\nHis pops was a drunk and his mother was blind\nHe use to stay at my hose sometimes my moms didn't mind\nWe was just nickel and dime hustlers wasting time\nLiving in the streets targeted and forced to kill\nDualistically we learned how to lie and steal\nGangsters of the future modern days thugs\nSeem like my childhood is covered in blood\nTraveling a rough life in the eye of the storm\nNow I wear their life stories tattooed on my arm\nPsyc's grandmother passed away on April fools day\nThen her funeral was on her birthday shit is real\nMy man had four baby moms and two on the way\nAnd trying to make a living for them passes away in vain\nGod bless him, ask Skeeta\n\n[Hook] (Sonji Mickey)\nChild of the streets well, well, well, well\nWill you end up like your family tree?\nTell me what you gonna do 3X\n(Child of the streets, understand the habits\nBehind the child of the streets)\n\n[VERSE3] (Keith Murray)\nThey try to fuck my fame up tear my name up\nTurn around and sue me fuck my little bit of change up\nI knew it was going to be some shit to get me for some cream\nI saw it in my subconscious world like a vision\nAt first it hurt me like a knife in the heart\nBut by nature I continued to live out my part\nAs art imitates life and life imitates art\nDon't respect the streets and they tear your ass apart\nIt's important that my understanding understood\nBut it's more important that it's understood in the hood\nAnd to all the females in the Pen stay strong\nAny day in jail girl is a day too long\nAnd for those who had to do what they did to slide\nNow running like a fugitive to save the live you live\nPut in a box saw my step pops\nHe said boy Keith what the blood clot how much time you got?\n\n[Hook] (Sonji Mickey)\nChild of the streets little sister\nTell me where will you lay your head?\nChild of the streets little brother\nWhere will you make your bed?\nYall tell me what yall gonna do\nWhat yall gonna do\nTell me what yall gonna do\nTell me"}], "artist": "Keith Murray"}