{"songs": [{"year": null, "image": "https://images.genius.com/2a93856f78af856011f450fe4967ca0b.300x300x1.jpg", "title": "Bad Day", "album": "Friends EP", "lyrics": "Ah..\nMan, why did it have to happen to me?\nMan, what did I do to get this?\nWhat'd I do to deserve this?\nCheck it out\n\n(Verse 1: Biz Markie)\nI woke up in the morning with my hand on my head\nNot knowin this would be one day that I'd dread\nI prayed the night before, for a let-me-live\nThe way this day turned out wasn't my prerogative\nI went to the kitchen to get some cereal smooth as silk\nBut when I looked in the ice box, there wasn't no milk\nWell I don't need no breakfast, I'm too fat anyway\nI just grab a cup of juice and be on my way\nSo I got my car keys, on route to my job\nI walked out, my windows broken and my car got robbed\nThey took my radio and my favorite cassette\nWhat a way to start the day, aww - what's next?\nI get to the office, my boss starts to scream\nIt was really unbelievable, like a bad dream\nHe kept talkin all this blahse blahse\nAnd looked at me and said, \"What you have to say?\"\n\n(Chorus)\nI'm havin a bad day\nThings ain't goin my way\nI'm havin a bad day\nToday, today\n\n(Verse 2: Biz Markie)\nHere's somethin else that happened to me\nIn the middle of this day that's bein deep\nTo begin this era of grief and aggravation\nI was parked by a meter and still got a citation\nTook the ticket off my window, got in my car alright\nA cop pulled behind me at a red light\n\"Your licence, registration and insurance card\"\nI was buggin out cause it was really hard\nI didn't do nothin, asked, \"Why'd you pull me over?\nYou never saw a young man drive a Range Rover?\"\nHe let me go and said, \"Don't do it again\" - \"Why,\"\nI said, \"thank you officer, you been a nice guy\"\nSo I stopped at the store to get somethin to drink\nGuess what happened to me before I could blink\nThey had my truck in the air, just about to be towed\nFor $700 in tickets I owed\n\n(Chorus)\n\n(Verse 3: Biz Markie)\nAfter all that I could finally go home\nAnd rest my feet and get on the telephone\nI had a unbelievable time in the city\nI shoulda be down with the ( ? ) committee\nI tried to cook some dinner but it came out burnt\nThe fire was too hot, I just had learned\nSo freak it, I'll go to a restaurant\nI brought a girl with me, asked, \"What do you want?\"\n\"Shrimp and lobster, two bottles of Alizé\"\nI looked at her and said, \"Hey hey hey!\"\nShe ate all the food and drank all of the liquor\nI better bring her home so I can stick her\nSo I got her to my house as fast as I can\nThis is like takin candy out of a baby's hand\nBut when I got her to my room, without no doubt\nShe was so intoxicated that she passed out\n\n(Chorus)"}], "artist": "Biz Markie"}