{"songs": [{"title": "Bae Bae", "album": null, "year": "2016-08-02", "image": "https://images.genius.com/05eb3b49def9881a38fa7f54d9c01515.955x955x1.jpg", "lyrics": "[Verse 1]\nAye, yeah, aye, whoa\nAye, droptop rain drop, pull up in a juice box\nAye, hold on, aye, yeah\nI might cop a vette cause I muthafuckin' can\nPull up in a cannon you can check my gangsta grill\nAye back home I got niggas who gon' kill\nPop it at your noggin if your pussy ass squeal\nHold on, bitch I do this shit for real\nBoat from the six or, I ball like a sixer\nI don't drink no liquor, hold on\n10 stacks for a picture, chillin' with my niggers\nYeah damn hold on, yeah\nI'm a vet at this shit, all you niggas rookie\nEat that pussy up like chocolate chip cookies\nYeah whoa hold on\nBitch I earned my stripes when I was a youngin'\nAll my niggas back home, best believe that they dumpin'\nAll my niggas no band but them niggas drummin'\nWhoa damn\nAye, if you feel what I'm sayin'\nFuck with the kid 'fore a nigga get to sprayin'\nNigga I ain't playin', I'm all about my fetti\nChasin' after guap, hold on\nI said I'm chasin' after guap\nDamn I should've banged with chase\nCause I've been runnin' to the money\nLike a marathon race\nGive bout your race, I'mma bust it at your face\nHold on, no face, no case\nYeah aye whoa damn hold on\n\n[Interlude]\nYeah, I'm fuckin' with this shit\nYou feel me? I think I might drop a mixtape on these beats, you feel me?\nAin't nobody fuckin with me in this mufuckin' music shit nigga\nI'm the king of the teens in this muthafucka ya dig?\nYou don't know my name goddamn by now you goddamn better get to doin' some mutafuckin research\nYou feel me?\nJust like that\n\n[Verse 2]\nI might drop fifty thousand on a necklace\nI don't give a muthafuck cause I'm reckless\nMiddle fingers to a cop I could give a damn\nYoung nigga, I might pull up in that goddamn\nWhat the fuck\n10 bands spent on a hummer truck\nTold that bitch to back it up\nYeah whoa goddamn\nCheck a nigga wrist, nigga keep lucky charms"}], "artist": "Lil Yachty"}