{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/aed4be580bebfb6ad41343f2e39be3b0.700x700x1.jpg", "title": "​smiledog.jpg", "year": "2012-06-11", "album": "haha, i’m sorry", "lyrics": "[Intro]\nHey, be careful with that, no, stop\n\n[Verse 1]\nThe monster in my closet fought the one under my bed\nAnd in the middle of the battle, I said\n\"Don't tell my dad or he'll probably get mad\nAnd he'll stop payin' for all the adderall\"\nAnd I don't want that, I don't wanna get fat at all\nIn a room with the admiral, the bruiser brigade\nIt's been a really, really messed up week, month, day\nI just rack up the hate, it comes as fast as a play count\nAnd I'm just gonna chill on the playground\nWhile you spend your whole day down in the depths of the net\nWanna bet? It upsets you\nYou want me to fade out\nAnd I am the rap game pest, get your raid out\nAnd I got your ass obsessed, no shame\n\n[Hook]\nI'm not really interested in hittin' the tip top\nAnd I got you mad but you're watchin'\nYou say, \"This little white girl is ruining hip hop\"\nI say, \"Damn right!\" and take a lick of the Ring Pop and smile\nNowhere near the tip top\nAnd I got you mad, but you're watchin'\nYou say, \"This white girl is ruining hip hop\"\nI say, \"Damn right!\" and take a lick of the Ring Pop and smile\n\n[Verse 2]\nI'm the kitten kaboodle and now I'm all over Google\nAnd I am very Youtube-able\nWith the Beautiful Lou beats and hideous cuticles\nYou hide out in your cubicle and ponder whose daughter I am\nA diabolical plot of the industry and\nWe didn't think anybody would be into me and umm\nI don't give a crap, I get happy\nEnough to have your favorite rapper twitterin' at me\nAnd A&R sayin' I could be a star\nAnd I'm way stressed, I just wanted a Betsey J dress\nAnd some time off from Claire's so I could chill for a while\nSo I take a lick of the Ring Pop and smile\n\n[Hook]\nI'm not really interested in hittin' the tip top\nAnd I got you mad but you're watchin'\nYou say, \"This little white girl is ruining hip hop\"\nI say, \"Damn right!\" and take a lick of the Ring Pop and smile\nNowhere near the tip top\nAnd I got you mad, but you're watchin'\nYou say, \"This little white girl's ruining hip hop\"\nI say, \"Damn right!\" and take a lick of the Ring Pop and smile"}]}