{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "Not Your Man", "image": "https://images.genius.com/937a22b3dfa62548d1013d052f733535.1000x1000x1.png", "lyrics": "[Intro: Thabo]\nI gave you my everything, guess that didn't mean anything\nTo you, cause I'm not your man\nAll the nights I spent with you, not making love, just making do\nOoh, I'm not your man\n\n[Hook: Thabo]\nI'm swimming way out of my depth\nI'm in way over my head\nI wish she never showed me her bed, bed, bed\nI wish I could forget\n\n[Verse 1: Professor Green]\nWhat you take me for? What you take me for? Gave you everything\nYet you're still looking at me like I could've gave you more, gave you more?\nI ain't got anything left to give, somebody better notify my next of kin\nCause the stress is killing me, either you're feeling me or not\nEither way I ain't gonna be spending any more money on Tiffany\nI'm done with that, what do you think I rap for?\nTo buy you a bag? Are you mad? I'm a catch\nThe type of man women normally go mad for\nSick of love, sick of you, wish I was but I ain't though\nChanged like a boy in trance, anything you ask for\nI can't say no, don't give but you take loads\nThe dinners and taxis, I ain't ever been attracted to anybody as much\nI am in love with you so madly, ain't ever treated you badly\nBut no matter what I do, you're unhappy\nIs it cause my dick isn't as big as Dappy's?\n\n[Hook]\n\n[Verse 2: Professor Green]\nPlaying a game that I'm losing so I guess you're winning\nI should've known better in the beginning\nWhen you said you were a fan of Beyoncé\nBut the only song you didn't like was \"Independent Women\"\n\"Bills, Bills, Bills\", bet you liked that though\nDough with a D, yeah you like that dough\nGave you a key to the crib only to find\nYou'd smoked all of my weed when I came home\nA temptress, a seductress\nWho possessed enough pizzazz to make me obsessed\nWhen you undress you wanna compete, sorry I didn't know\nIt was a contest, but guess I won\nCause I came first, is that the reason that you're upset? [?]\nWhy would you keep coming back if it's just sex if it ain't no good?\nOr is it the rest that you're interested in?\nAll of the spending in the restaurants\nI gave you everything that you ever wanted and what did I get in return for it?\nLouboutin, Louis Vuitton, your shoes cost\nMore than I used to earn in a month back when I used to sleep on a futon\n\n[Hook]\n\n[Outro: Thabo]\nI wish I could forget\nWish I could forget\nI remember\nEverything\nI gave you my everything, guess that didn't mean anything\nTo you", "year": null}]}