{"artist": "Fat Joe", "songs": [{"year": "1995-10-03", "album": "Jealous One’s Envy", "image": "https://images.genius.com/d39ec88ceb1de2aaf358c7c2fdc2898c.640x616x1.jpg", "lyrics": "{*DJ cuts \"Guess who's back?\"*}\n\n[Fat Joe]\nYeah..\nThe Fat Gangsta..\n\nHere comes the nigga from the East\nWho just been crowned for most hated by police\nThe public enemy, rapper at large\nWho's known throughout the industry for pullin niggas cards\nYou know the situation, Zulu Nation\nNever forget the Bronx because the Bronx the foundation\nFat Joe, a.k.a. Joey Crack\nNiggas be like he's fat, bitches be like he's all that\nMotherfuckers know my rep, I never fronted\nNiggas be talkin mad shit, but they don't want it\nIt's the realer MC, the drug dealer MC\nIf a nigga fake jax, I'm gonna kill a MC\nYeah, you can't handle the truth\nFuck around and get thrown off the project roof\nMad lives have been lost and forgotten\nNiggas better watch they back, the Big Apple's gone rotten\n\nMicrophone check, one two one two\nShouts to the East and the West coast crew\nWhatever you do, keep this hip-hop shit true\n{\"That's all I ask of you..\"}\n\nWhen I step in the jam all eyes are on me\nSold out crowds, with curiosity\nEverybody wants to know, could the man still flip it?\nMicrophone gifted, unrealistic\nComin with the bomb bass for the underground heads\nFlex got the most, Serge got the landspread\nKeepin shit real, niggas know the deal\nJust through trial and comin down on appeal\nMicrophone Joe I own it, bitches wanna bone it\nBlowin out the tweeters in your musical component\nIt's your man Fat Joe, oh, is that so?\nYou remember me from, \"You know ya got to Flow\"\nOne time for your mind off the top of a dome\nNever leave for home without the motherfuckin chrome\nWord to Tone, Big Daddy, I know he's chillin\nPeace to all the villains out of state makin millions cause ah\n\nMicrophone check, one two one two\nShouts to the East and the West coast crew\nWhatever you do, keep this hip-hop shit true\n{\"That's all I ask of you..\"}\nMicrophone check, one two one two\nShouts to the East and the West coast crew\nWhatever you do, keep this hip-hop shit true\n{\"That's all I ask of you..\"}\n\nFrom the Bronx to Queensbridge, on back to Redhook\nNever lost a gram on any eighth that I cooked\nFat Joe, army fatigue and black chuckers\nHardcore lyrics to all my real motherfuckers\nI'm tryin to see cream, in the millions, retire\nAnd go play golf with Russell Simmons\nThat's the type of mission that I'm on\nAiyyo my word is bond, I keep a army just as deep as Farrakhan\nYou.. can't.. deal with the man\nWho be holdin down the fort with the gauge in his hand\nI know you love the way I grab the mic and spark it\nYou hookers'll NEVER get your hands inside my pockets\n\nMicrophone check, one two one two\nShouts to the East and the West coast crew\nWhatever you do, keep this hip-hop shit true\n{\"That's all I ask of you..\"}\nMicrophone check, one two one two\nShouts to the East and the West coast crew\nWhatever you do, keep this hip-hop shit true\n{\"That's all I ask of you..\"}\n\n{*\"Everybody knows Fat Joe's in town..\"*}", "title": "Fat Joe’s in Town"}]}