{"songs": [{"image": "https://images.genius.com/e8a9393885c7a914ec2a4677bff82bfb.500x500x1.jpg", "album": null, "title": "Dear Auntie", "lyrics": "[Intro]\nDear Auntie Beeb\n\n[Chorus]\nDon't take away our radio\nWe need a place - a place to go\nWhere we can play our favourite shows\nDon't take away our radio\n\n[Verse 1]\nWhen I first heard the word about BBC 6 I thought\n\"This is absurd, is the BBC sick?\"\nIt rocked the airwaves enough to keep me seasick\nBut it's the first to get sunk - can we believe it?\nAnd I thought pirates were meant to be the problem\nBut obviously not 'cause your lot's already got some\nDoctor, doctor, what's your option\nWhat are you going to drop from the roster to cost cut?\nThe Asian Network plays the best work\nOf a strain of the nation that strains to get heard\nAnd now you're severing the nerves of a massive demographic\nIt's not a very clever tactic, is it?\nThe last bastions of unsigned action\nIndependents depend on it for traction\nAsk Lamacq or Bobby Friction for his reaction\nMy prediction isn't one of satisfaction\nDo the maths, it's a simple subtraction:\nTake away the stations and you chase away the talent\nListening figures isn't your biggest purpose\nIt's first and foremost to provide public service\nI'm not saying other stations are worthless\nBut adverts are adverse and make me nervous\nWe deserve to have a say in what we'd like to see\nI mean after all, we pay the licence fee\n\n[Chorus]\nDon't take away our favourite shows\nDon't take away our radio\nDon't take away our favourite shows\nDon't take away our radio\n\n[Verse 2]\nYou need to appeal to the people that feel John Peel\nAnd want to keep it real\nSo please, pretty Beeb, we appeal for a new deal\nWe'd be pleased if the spiel was repealed\nD.B. sees what's needed to escape from the danger zone:\nMore DAB radios in the nation's homes\nThe audience is there, they just need connecting\nIn the same way your arrangement needs correcting\nNext thing on the list that's vexing\nBloody everybody is you spending money like it's never ending\nEven a yellow bellied Teletubby could tell us it's crazy\nLaa-Laa; Lady Gaga\nPay me half of what you pay to Clarkson\nI'll be laughing like I can't keep a straight face, straight up\nIf there's a budgetary deficit to make up\nThen wake up and give Big Jeremy a pay cut\n\n[Chorus]\nDon't take away our favourite shows\nDon't take away our radio\nDon't take away our favourite shows\nDon't take away our radio\n\n[Verse 3]\nThere's enough talent out here for like forty channels\nBut we only get to hear the top forty sellers\nYou're running it like Basil does to Fawlty Towers\nLiterally - ask Andrew Sachs, he could talk for hours\nAbout how he was pushed about as Manuel\nThen Johnny Ross and Russell Brand did it as well\nMan, Johnny Rotten wouldn't slag the living Hell\nOut of an old man's grandkid on his cell\nWell, if Russell Brand and the six million dollar man\nAre the cream of the crop then you can hang the DJ\n\n* Radio 1 - sweet for teenagers\n* Radio 2 - great if you're really ancient\n* Radio 3 - for those of a refined taste\n* Radio 4 - all talking and giant brains\n* Radio 5 - only sport fans are tuned in\n* Radio 6 - it's the music we're losing\n\n[Chorus]\nDon't take away our radio\nWe will complain until you know\nIt's a mistake - I'm afraid so\nDon't take away our radio", "year": "2010-03-01"}], "artist": "Dan Bull"}