{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": "2013-04-30", "lyrics": "[R.A. The Rugged Man]\nI walk in the Pentagon with a blood soaked hatchet, leave the president's nose\nShattered, stretch his neck like go gadget, and toe tag it\n\n[Vinnie Paz]\nYou a stone cold faggot, I hold the chrome in a jacket\nGo toe to toe with a savage and roll you over a cactus\n\n[R.A. The Rugged Man]\nFunerals are closed caskets, coke addicts, chrome ratchets\nThe whole package, I'll beat Moses on the head with them stone tablets\n\n[Vinnie Paz]\nI killed Kennedy, brains blown all over Onassis\nI'll hold my own with the axes and turn the pope into ashes\n\n[R.A. The Rugged Man]\nDesigned frequency, I'm a holy divine lyrical deity\nEven atheists and heathens and non-believers believe in me\nThe punk-ass devil was born soft, I'll piledrive you like Paul Orndorff\nSteal his pitchfork and rip his horns off, I'm the born force\n\n[Vinnie Paz]\nSick fuck, I'll skin you alive and then carry the bones\nLoad the Ruger up and shoot you up like I'm Marion Jones\nVinnie is out of his dome, Guinea that carry the throne\nGimme, it's that or be stoned, Trinity, that'll be home\n\n[Chorus: Sadat X]\nWe 'bout to spaz, R.A. and Vinnie Paz\nR.A. and Vinnie Paz\nWe don't give a fuck, we don't give a fuck\nWe don't give a fu-fu-fu-fuck\nWe 'bout to spaz, R.A. and Vinnie Paz\nWe don't give a fuck, we don't give a fuck\nWe don't give a fu-fu-fu-fuck\n\n[R.A. The Rugged Man]\nNew jack pussy, young rappers think their rapping is good\nYoung rappers get treated like fetuses in planned parenthood\nThis ain't no Mickey Mouse, zip-a-dee-doo-dah Disney, it's the claws of a\nGrizzly, it ain't Wayne and Drizzy, it's Thorburn and Vinnie\n\n[Vinnie Paz]\nAnd R.A., that’s my brother there, anyone who unaware\nI'ma leave 'em stumbling as if they had a ton of beer\nI'm from Philly, it ain't a sucker to ever come from here\nYou a pussy, you see confrontation and you run from there\n\n[R.A. The Rugged Man]\nWhat kind of dirty bitch did your daddy put his sperm in?\nKiddie porn web searching, pervert jerking, you serpents is Satan's servants\n\n[Vinnie Paz]\nYou get slain for certain if you put your faith inside of Satan serpents\nStick the blade in you while I embrace you like my favorite person\n\n[R.A. The Rugged Man]\nStay in Hell burning, slaves with chains on your brain like a turban\nI make Abel kill Cain and get bible pages reversing, brains\nBursting\n\n[Vinnie Paz]\nIt takes a taste of bourbon for me to rape a virgin\nAnd Vinnie deal with mathematics like an Asian person\n\n[Chorus: Sadat X]\nWe 'bout to spaz, R.A. and Vinnie Paz\nR.A. and Vinnie Paz\nWe don't give a fuck, we don't give a fuck\nWe don't give a fu-fu-fu-fuck\nWe 'bout to spaz, R.A. and Vinnie Paz\nWe don't give a fuck, we don't give a fuck\nWe don't give a fu-fu-fu-fuck\n\n[R.A. The Rugged Man]\nHands like Roberto Durán, it's the flight 103 Pan Am\nIt's the Gulf War between Iraq and Iran\nTreat you like Indians I'm snatching your land, I'm more dapper than Dan\nI'm Rakim I master the plan, I bring the roots without having a band\n\n[Vinnie Paz]\nWithout having a fan I coulda never took care of my fam'\nI coulda never done all the tours on the shores of Japan\nStill would've slaughtered your man, still would've aborted the plan\nStill an apostle from Sham, still I'm like God in Sudan\n\n[Chorus: Sadat X]\nWe 'bout to spaz, R.A. and Vinnie Paz\nR.A. and Vinnie Paz\nWe don't give a fuck, we don't give a fuck\nWe don't give a fu-fu-fu-fuck\nWe 'bout to spaz, R.A. and Vinnie Paz\nR.A. and Vinnie Paz\nWe don't give a fuck, we don't give a fuck\nWe don't give a fu-fu-fu-fuck\n\nWe 'bout to spaz\nR.A. and Vinnie Paz\nWe 'bout to spaz\nR.A. and Vinnie Paz\nWe 'bout to spaz\nR.A. and Vinnie Paz\nWe 'bout to spaz\nR.A. and Vinnie Paz", "title": "Sam Peckinpah", "image": "https://images.rapgenius.com/fddfb28093968215065b63c6ed0339c1.1000x563x1.jpg"}]}