{"artist": "Phife Dawg", "songs": [{"album": "Ventilation: Da LP", "title": "Lemme Find Out", "image": "https://images.genius.com/7b15bd4cebb535f1f46449b1258fd434.500x500x1.jpg", "lyrics": "[Intro: Phife Dawg]\nYo Pete, run that\n\n[Verse 1: Phife Dawg (Pete Rock)]\nGrowin up I used to use the Afro Sheen\nKnicks and Lakers was my favorite basketball teams\nUnderground MC, but I can bring it mainstream\nRap style being seen like muthafuckin Tom Greene\nIn the immortal words of Rakim, I'm a microphone fiend\nTrini say 'yes, Jamaica say 'seen'\n(Hold it down) gotta hold it down for Queens\n(Recognize) My name is Phife\nPeople still takin rappin for a joke\nAll they know is chips, whips, dank, hoes and smoke\nWhat we need is raw peoples who will practice they craft\nGoin hard to the extreme, why would you go half-assed?\nCall me the Cal Ripken of the industry (Carl who?)\nSeen rappers shine, as well as seen some hang their head in misery\nNo matter what whoever said, I stuck with it\nStay committted, hence the reason competition stay gettin shitted\nOn - what - I've held shit in for so long\n(Go 'head, Phife, get your man on)\nReminiscin 'bout them school lunch tables I used to bang on\nRun-D.M.C. at M.S.G. gettin they shine on\nKnowin one day I'd get that chance, yo\nAnd the reward wasn't just dough, it was when people hit the danceflo'\nA way with culture lyrics or shorties singin \"Can I kick it?\"\nYeah, that's the ticket, go 'head, show me your Tribe spirit\nMan listen, I'm here to tell it\nSuccess was bound to come, how I know? I can smell it\nPhife be sharper than an arrow\nEquivalent to Pete Rock or Primo collectin vinyl\nCause it's all about the love, yo\nBattle whoever whenever, let's get it on, yo\nBust that ass like no tomorrow\nJust to keep the flows up to par\nBut nowadays none of you maggots would like to spar\nBut here I are, 10 years in the cut\nFive albums, did three of em dope, two of them ( *disgusted sound* ) - and such and such\nBut like they say, a true champ, he always rises\nPhife Dawg, Da LP, full of surprises\n\n[Chorus: Phife Dawg (Pete Rock)]\n(Lemme find out) Y'all niggas ain't got no clout\n(Lemme find out) Y'all niggas got my name in your mouth\n(Lemme find out) Them labels lately puttin shit out\n(Lemme find out) Ah-ha (Lemme find out) Ah-ha\n(Lemme find out) You want me to come blow up the spot\n(Lemme find out) Y'all niggas is all in the cot\n(Lemme find out) You don't know about Pete Rock\n(Lemme find out) Ah-ha (Lemme find out) Ah-ha\n(Lemme find out)\n\n[Verse 2: Phife Dawg (Pete Rock)]\nOn my way to the club better known as One-Tweezy\nWhere you find them fake ballers and some hoes lookin sleazy\nThe place where robbin a nigga is so easy\nSame club where strippers go, I think I found one to ease me\n1:30 in the morning, taking it easy\nThis one dude's all in my shit, for a sec I thought I had tits, gee\nI overheard him saying that my rap style was pussy\nI'm nothin on my own, the rest were better without me\nI couldn't comprehend, he said it under his breath\nBut when I did, no hesitation, to my business I stepped\nWhat you say? Excuse me? Pardon? Oh, don't be a bitch, sucker\nNow you wanna act shy? You know my name, muthafucka\nStraight pussy nigga, oh now it's what, you don't know?\nBelieve me man, you can get that ass bust for sho'\nJust because a nigga rappin, what you think it can't happen?\nWhat the deal, you wanna dance? We can get straight to scrappin\nHm, I'm sayin Pete, you know the drilly, black (No doubt, son)\nNew York is to the fullest, we don't know how to act\nBut on a professional level, should I deal with this?\nLike the Goodie Mob say, I'm too real for this\nWork too muthafuckin hard for this\nUsed to lie, cheat, steal for this\nAn innovator when it comes to this\nFeed my fam with this, put clothes on they back with this\nBust my ass to be a part of this\nLivin my life with this\nMakin people straight rejoicin this\nAw fuck it, I'm so nice with this\nI make your broad drop her drawers for this\nSlit her wrist for this, and now what, punk, bitch\nBut fuck it yo, I ain't trippin\nI know a asshole when I see one, just don't get caught slippin\nSo what the fuck now, nigga?\nYo, suck on ???? right here, in my pants, behind my zipper\n\n[Chorus: Phife Dawg (Pete Rock)]\n(Lemme find out) Y'all niggas ain't got no clout\n(Lemme find out) Y'all niggas got my name in your mouth\n(Lemme find out) Them labels lately puttin shit out\n(Lemme find out) What (Lemme find out) What\n(Lemme find out) You want me to come blow up the spot\n(Lemme find out) Y'all niggas is all in the cot\n(Lemme find out) You don't know about Pete Rock\n(Lemme find out) Ah (Lemme find out) Ah\n(Lemme find out)\n\n[Outro: Phife Dawg (Pete Rock)]\nYo\n2000\n2001, 2, 4, 5, 6, 7, 8, 9\nTill 2000-bombaclaat-30\nYa hear me\nLive life\nLive long\nStay strong\nI'm out\n(No doubt, son)", "year": "2000-09-26"}]}