{"songs": [{"year": null, "lyrics": "(Chorus: Lucky Luchiano)\nWhere they at?\nWhere they at?\nWhere my playamade mexicans at? (Huh!)\nI see the screens and the visor with the twenty inch tires\nWhere my players making paper on the texas map\nWhat it do screwston? (where my players at?)\nAll the way to San Antone (where my players at?)\nFrom Laredo to Dallas, all the way to Amarilla\nIt dont matter where you from boy its all about that scrilla\n\n[Lucky Luchiano]\nThis for my players down south we mexicans on feet\nReady to spend we been hustlin all week\nHeads turn when I crawl and the slab on chrome\nLeather and wooded, a big strap on the floor\nLucky representing for his players making pay\nH-town mexicans wearing fades and braids\nStaying playamade and swanging apple over silver\nDont be mad at Lucky cause he stacking all the scrilla\nWhere my mexicans po' pimping?\nI see your chrome spinning\nMan this for my mexicans, platinum and gold grilling\nCreased jeans, piece and chain with the J's on the toes\nScrew in the trunk while we swanging on the road\nI'm a flow on the track\nFinna roll a ball bat\nFifth wheel with the grill, 84's on the lac\nWhere my mexicans hitting licks?\nWhere my with the bricks?\nWhere my on a mission tryin' to ball and get rich\n\n(Chorus: Lucky Luchiano)\nWhere my playamade mexicans at?\nWhere they at?\nWhere they at?\nWhere my playamade mexicans at? (Huh!)\nI see the screens and the visor with the twenty inch tires\nWhere my players making paper on the texas map\nWhat it do screwston? (where my players at?)\nAll the way to San Antone (where my players at?)\nFrom Laredo to Dallas, all the way to Amarilla\nIt dont matter where you from boy its all about that scrilla\n\n[Baby Beesh]\nAin't it funny?\nMexicans run the drug money\nCause we all about our carrots like mane, the bugs bunny\nFucking with a thugs money gone get you broke down\nAnd if you didn't know, well patna you know now\nCause we dont punch clocks\nWe push a bunch of rocks\nBang a bunch of bopps\nAnd shake the fucking cops\nOff top, Baby bash call me the scrill dilly\nDeep as space city surrounded by big tittys\nAin't it trippy how its drippy the candy that stay red\nMane where you from, well playa then say that\nTrunks glowing, screens showing and caddys and woo-doos\nFlated in the truck, sittin on new shoes\nCrackin the rear view, cause the beat's too zappy\nParking lot pimping with the weed transaction\nGetting a hell of action from a dime piece chula\nShe said she want a mexican all about his mula\n\n(Chorus 1X)\n\n[Lucky Luchiano]\nMane we them throwed mexicans out of the dirty south\nHaters want plexx what they, what they talking bout?\nIm a hogg all lanes while I crawl on blades\nLucky Luchiano be my dog on name\nIm a swang im a tip in a candy mothership\nUnlike my bumperkit and put on another flick\nScreens fall, popping trunk on the seawall\nBout to show them other fools how the third coast ball\nAll my dogs in H-town chunk a duece out the roof\nSwang left to right what it do act a fool\nI'll shut my show down cause we was blowin the pine\nClubs hate my entourage cause they know we gone clown\nPuttin down for my homies in the penitentiary\nWhen im gone my little homies will represent me\nThats how it be we ain't never gone stop it\nPlayamade mexican keeping this here poppin\n\n(Chorus 1X)\n\n[Baby Beesh Talking]\nMane hold on, I thought you thought\nMane hold on, I thought you thought\nMane hold on, I thought you thought\nMane hold on\nUh yea!\nIts the phantom track\nThe bonus!\nSlowed and throwed in your earlobe\nThat boy Baby Beeshie\nWith the neptune Lucky Luchiano\nProduced by that boy Rebel\nAll in your jaw bone\nUhhhh!", "title": "Playamade Mexicans (Bonus Track)", "album": "On Tha Cool", "image": "https://images.genius.com/892fe4333961812afe1bb44ded0c2760.300x300x1.jpg"}], "artist": "Baby Bash"}