{"songs": [{"year": "2016-07-15", "title": "Imagine", "image": "https://images.genius.com/4f0893d0cd52c000747ed0f18d8ac4c6.1000x1000x1.jpg", "lyrics": "[Intro: Sadat X]\nYeah (Close your eyes and imagine)\nIt's a beautiful world, just imagine living (Close your eyes and imagine)\nDoing things (Close your eyes and imagine)\nGreatness (Close your eyes and imagine)\n\n[Verse 1: Sadat X]\nImagine if my dudes in the Earth realize their worth\nImagine if they was taught love at birth (Word..)\nImagine if my father ain't die\nAnd the thought of him here still moistens my eye ('Til this day)\nMy daughter lives so far away (Far)\nImagine if I was there providing structure through her day\nImagine the things I can say\nBut since I ain't there, she gon' do it her way\nSeen my dude Mike last night, word is bond\nHe was dead by the morn\nWe grieved, buried him and moved on (Close your eyes and imagine)\nClose your eyes and imagine my infant son little feet\nHis little heartbeat (Close your eyes and imagine)\nWhat if I lost him in the street?\nSeen him covered with a sheet? (Close your eyes and imagine)\n\n[Pre-verse: Sadat X & Rhymefest]\nImagine succeeding (Close your eyes and imagine)\nYou want us to fantasize with no [?]\nGreatness (Close your eyes and imagine)\nMan, whatever.  We live in the ghetto, X\nPyramid-builders\nProject-livers (Close your eyes and imagine)\nGreat thinkers, mathematicians\nHigh school dropouts, B (Close your eyes and imagine)\n\n[Verse 2: Sadat X]\nImagine succeeding\nDoing everything you needing\n[?], Dublin, bubbling\nDue to fumbling, economic crumbling\nWar zone (Close your eyes and imagine)\nI'm falling at home\nWe got a black man under the dome\nBut we still violate where the Indian's call home\nThey was there a thousand years ago (Close your eyes and imagine)\nA stress-free life\nPicket fence and a wife\nAin't got to carry that knife (You don't need it!) (Close your eyes and imagine)\nBlowing good herb\nAnd nobody hit the curb\n\n[Bridge: Jabar]\nEverything is everything, money to the ceiling\nBills paid ahead of time, oh, what a feeling\nCan you imagine that?  Can you imagine that? (Close your eyes and imagine)\nYou got the whole world in your hands, phones keep ringing\nDeals coming by the pounds, you don't want to hear it\nCan you imagine that?\nCan you imagine that? (Close your eyes and imagine)\nYou started at the bottom, now you on top\nRock star status, top of the charts\nUnbelievably gleaming, you thought you was dreaming\nThinking outside of the box (Close your eyes and imagine)\n\n[Verse 3: Rhymefest]\nShhh...eyes wide shut, visualize freedom\nBig banks, credit, car notes, you don't need them\nSet free on the island with jet skis\nParasailing with cinnamon women that's so sexy (Heey..)\nEvery rapper make a million dollars, go platinum\nRick Ross and his baby mama, it never happened\nRihanna met Chris Brown and walked the other way (Damn..)\nI'm just saying, I imagined that the other day (Woo..)\nFree health care, everybody on welfare\nYou can wake up 3 o'clock like \"Hell yeah..\"\nShhhhh...can you imagine that?\nDon't tell me what I want to hear, can you fathom that?\nLeave the keys in your Cadillac (Vroom..)\nI'll put some gas in it, man, 'fore I bring it back\nI pick my son from his mother\nTake my next girl from her lover\nFuck her without a rubber (Bahh..)\nBig love, got three wives, I wanna love 'em\nMy mother had three girls, imagine I had a brother\nMy father was MIA, imagine I had another\nBut then I wouldn't be who I am, word to mother\n\n(Close your eyes and imagine)\n(Close your eyes and imagine)\n(Close your eyes and imagine)", "album": "Agua"}], "artist": "Sadat X"}