{"artist": "C-Rayz Walz", "songs": [{"title": "Blackout", "album": "Year of the Beast", "year": "2005-05-17", "image": "https://images.genius.com/d357c7e828546de7ecb57ec880f699c7.600x600x1.jpg", "lyrics": "C-Rayz Walz ft. The Angel & The Preacher - “Blackout”\n[Emcee(s): C-Rayz Walz and 4th Pyramid]\n[Producer(s): MYK DEFY]\n\n[Intro: 4th Pyramid and C-Rayz Walz]\n4th Pyramid: You sell that picture illegally, I’m suing you.  What’s wrong with you?\nC-Rayz Walz: Triple bypass. Put it on my tab, America!\n\n[Hook: 4th Pyramid and C-Rayz Walz] (x2)\nWe're black and we wanna be white\nWe're black and we wanna be white\nWe're black and we wanna be white\nAll night, all right, all hype\n\n[Verse 1: C-Rayz Walz]\nI'm black, wanna be white.  For the first time in life, I wanna\nBe right.  I know this is wrong.  I’m getting accused, they\nFrisk me at night.  I know what it is.  Give me the light.  If I was\nBlanco, I'd be invisible to pig's sight.  I'm\nBlack, wanna be white, well-dressed, speaking polite, self-\n-stressed, living a lie.  Well, I guess this is life.  All the\nDues I’ve paid, I wanna be “dude” in the shade, rocking\nHard like I was raised in the rave.  Rayz got the vo-\n-cab that made most mad when I spoke like graff.  Is it\nBad I think, drink, joke, and smoke like dad?  Peak at\nTrees.  These bad seeds hang on corners\nRaised by murderers and mourners (Yeah).  I’ma be the\nShit at the meeting, statistically speaking, playing golf on the\nWeekend with Ralph Lauren, Christopher, and Keenan.  When the\nIvory Wayans/weighings, the scales brake.  Who can deny me\nPayment?  Well, alright.  I'm all-white—I finally make it\n\n[Hook: 4th Pyramid and C-Rayz Walz] (x2)\nWe're white but we wanna be black\nWe're white but we wanna be black\nWe're white but we wanna be black\nFight back, like this, like that\n\n[Verse 2: 4th Pyramid]\nI’m white, wanna be black.  A daunting task that’s haunting me\nGats, drunk.  Started to laugh.  My com-\n-plex is like, “Pardon my dad.”  I’ll respect you.  You\nStarted the fad.  I got no problems with that, but\nHow would you feel if you lived in the village and were\nTold all your ancestors did was steal, kill, and pillage?\nI know not of my past.  One\nGrown out of gods, anonymous tags\nBurden bestowed, I want to escape.  I don't\nHave it made ‘cause of my skin—it's just not the case\nFamily don't understand artistic views, feel like\n“Damn it!  Why I have to live with fools?”  I did\nMe.  Fuck what I did in school.  To live\nFree feels like forbidden fruit.  I'm\nShackled, need my gene pool, but it's all scattered\nCall Devil ‘cause I need food.  It don't matter\n\n[Hook: 4th Pyramid and C-Rayz Walz]\nWe're black and we wanna be white\nWe're black and we wanna be white\nWe're black and we wanna be white\nAll night, all right, all hype\nWe're white but we wanna be black\nWe're white but we wanna be black\nWe're white but we wanna be black\nFight back, like this, like that\n\n[Verse 3: C-Rayz Walz]\nIf you\nBlack with a degree and you work and got a happy fa-\n-mily, they say you wanna be white.  If you\nWhite, rebel, smoke weed, listen to rap, and live\nFree, they say you wanna be black.  There's nothing in\nBetween, so this medium means you double excel\nOn Smallville and dinner is beans.  There's two\nClasses: the rich and the poor.  Everybody else\nRun wild in the halls! (Look, man)\n\n[Verse 4: 4th Pyramid]\nI envy long-standing tradition\nTension starts from what you do to me through dissing (Stop it)\nThe past is done and was never my ambition (Nope)\nAnd now I will plan for that tin can to piss in\n‘Cause some of my people poverty-stricken\nSleeping in the same spot that they probably shit in (Come on)\nKill you (Kill you) in Alaska for some gold\nStill viewed as master of the globe\n\n[Hook: 4th Pyramid and C-Rayz Walz]\nWe're black and we wanna be white\nWe're black and we wanna be white\nWe're black and we wanna be white\nAll night, all right, all hype"}]}