{"artist": "Pastor Troy", "songs": [{"album": "I Am D.S.G.B.", "title": "Champion!", "image": "https://images.genius.com/a40b93273e5c9174c866a211a1183d34.600x600x1.jpg", "lyrics": "(Pastor Troy)\nCome on\nD.S.G.B ya'll know what time it is\nGa ya'll know what time it is\nPastor Troy for President for 2000\nI'm ready\nI'm ready\n\nVerse 1:\nI made up my mind to hit the grind and get paid\nThat Glock 45 I go to war with all these haters\nMy faith is now greater because I know that I'm the man\nMy package not shaper cause they say they didn't understand\nTogether we planned to lock GA on the map\nAnd only I can because them other busters sap\nThey claimin' they rap but too lame to me\nYou wanna come strapped it ain't no thang to me\nProbably gone be layed up in a ditch\nI'm a kill you, slay your main bitch\nAnd oh how quick the game done switched up\nI'm screaming G-A the crowd screaming what\n\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\n\nI ain't playing with these busters or all these enemies\nI got hated I got people who'll shoot you till you bleed\nI'm the leader of the army and Atlanta is the base\nLet me catch you in my city I'm a shoot you in the face\nBetter tape clothes to your nose cause I know I'm the shit\nPastor Troy, DSGB I represent for my click\nRed mouth nobody mouth as red as mine\nDown south affiliated with that Georgia Pine\nAin't nothing kind when I enter, Doberman pincher I'm pit\nWhile you doberman pinching I done locked on ya bitch\nAnd just that quick the so called game done switched up\nI'm screaming G-A the crowd's screaming what\n\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)\nPa-stor! Pa-stor! Pa-stor! Pa-stor!\n(I am DSGB!)", "year": null}]}