{"songs": [{"title": "It Is What It Is", "album": "Church Clothes 3", "year": "2016-01-15", "image": "https://images.genius.com/ecf271772aa0af61304b89a07eb15401.1000x1000x1.jpg", "lyrics": "[Hook]\nI’m hearin’ screams and they sayin’ we sold out\nBut I’m hearin’ screams from the stands cause we souled out, it’s so loud\nI got one life so I spend time tryna live 'til the next one\nIf you don’t like it, cool\nIt is what it is, it is what it is\nIt is what it is, it is what it is\nMy plate too full to sample that dish\nIt is what it is, it is what it is\nI’m handlin' biz, it is what it is\nIt is what it is, it is what it is\n\n[Verse 1]\nSome like, “I ain’t really feelin' that bruh\nI ain’t with religious rap, bruh”\nSome sayin' it is devil rap\nIlluminati-on-another-level rap\nFell flat from heaven went to hell and back, huh?\nA lot of radio ain’t givin' no play, but it’s ok\nCause my day one's been A-1\nBefore the co-signs and the pros came\nWhere you been, been boy, boy?\nYou ain’t been keepin' up\nChurch Clothes 1 and 2, then Anomaly\nYou probably need to turn your speakers up\nAnd now I’m on my third tape\nAnd I just might drop it on a Thursday\nSo tell the industry and my enemy\nThat your man wouldn’t follow in they rules in the first place\nThirty plus in the residential\nIn the truck feelin’ presidential\nWith my girl lookin’ detrimental\nKillin' anything tryna to be a side piece out my mental\nOutta your mind\nYou thinkin’ I’m leavin’ my baby by marchin’ for dimes?\nYou'll get that curve, you way out of line\nGave her that rock, I’m stayin’ with mine\nI keep the huddle mad tight, too many players I don’t trust now\nYou wasn’t with me on the 4th down, huh?\nThen you can miss me when I touchdown\nAnd that’s no shade, no shade\nIt’s just those games, I don’t play\nI’m gettin’ wiser with more age\nAnd realizin’ some gonna hate\nAnd that’s ok\n\n[Hook]\nI’m hearin’ screams and they sayin’ we sold out\nBut I’m hearin’ screams from the stands cause we souled out, it’s so loud\nI got one life so I spend time tryna live 'til the next one\nIf you don’t like it, cool\nIt is what it is, it is what it is\nIt is what it is, it is what it is\nMy plate too full to sample that dish\nIt is what it is, it is what it is\nI’m handlin' biz, it is what it is\nIt is what it is, it is what it is\n\n[Verse 2]\nHold up\nLet me get a minute from the flexin’\nForeign cars and the million dollar jets\nFuturistic clothes, feelin’ like a Jetson\nCause keep it trill, it ain’t really that impressive\nBlessed, but I ain’t frontin’ with the Grammys or the fame\nI’m just stuntin’ with my family unashamed\nAnd cats say, Crae, you done got it all\nIn the gym workin' hard, you should show it off!\nNah, that ain’t never been my forte\nPride come before the fall, what the Word say\nAnd I’ve been eatin’ off the wordplay\nWorking hard on the lyrics that the world play\nRemember where I came from in the first place\nIt’s all a gift, every breath is a birthday\nSo I spend time tryna find all of these souls lost\nCause it’s a wasted time if I got it all and they souls lost\nI ain’t tryna to ball\nIf that’s what you feel then your goals off\nIt’s a different game tryna get this truth\nPut you on and then go off\nSo, yeah, I may swag at award shows\nGet some jet lag from a tour show\nKeep a couple abs on my torso\nBut none of that is gon' matter when the horn blow\nI ain’t tryna front for them flashin’ lights\nMan they had us, life is a gift\nSo if last night was my last night, them I’m good\nIt is what it is\n\n[Hook]\nI’m hearin’ screams and they sayin’ we sold out\nBut I’m hearin’ screams from the stands cause we souled out, it’s so loud\nI got one life so I spend time tryna live 'til the next one\nIf you don’t like it, cool\nIt is what it is, it is what it is\nIt is what it is, it is what it is\nMy plate too full to sample that dish\nIt is what it is, it is what it is\nI’m handlin' biz, it is what it is\nIt is what it is, it is what it is"}], "artist": "Lecrae"}