{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/7b848bb2c03176f196fbd8167b10284f.1000x1000x1.jpg", "title": "ABC’s And 123's", "year": null, "album": "Collaborations", "lyrics": "\"Hello, children, I am you teacher Mr. KJ52.\"\n\"Hi, Mr. 52.\"\n\"Today we are going to be working on your ABC's.\"\n\"Noooo!\"\n\"Can you say A?\"\n\"Nine.\"\n\"Can you say B?\"\n\"Twenty-seven.\"\n\"Just listen\"\n\nFrom the A to the B to the B to the Z\nNow we gonna break it down to you alphabetically\nBring you back to the essence of how we emcee\nCause we gonna break it down to you alphabetically\n\n(A) Alphabetically attack with actual actions\n(B) Bumping bass while I'm busting breaking backs blasting\n(C) Catching cats crashing, creating creations and clashing\n(D) Doing a double dose of damage and dashing\n(E) Everlastingly encouraging everyone just to endure\n(F) Facing feeble fools as I faithfully just flow forth\n(G) God's good and God's great, God's grace I gratefully got\n(H) Hope in Him has helped heal this hurtin' heart\n(I) Idiots institute irrevorant type insolence\n(J) Joyful jammin' junk jacking up this Jesus journalist\n(K) Killing just to keep the King's kids kicking\n(L) Learning life's lessons and just laughing loving and living it\n\nFrom the A to the B to the B to the Z\nNow we gonna break it down to you alphabetically\nBring you back to the essence of how we emcee\nCause we gonna break it down to you alphabetically\n\n(M) Make the most of moments most men mentaly miss\n(N) Navigate nine new nouns, nearly noone notices\n(O) Officially overturn obstacles that often operate to\n(P) Put people in poor position in their proper place\n(Q) Quite quaint how the quotient just quickly quits\n(R) Reprimanding real rappers who in reality they really rip\n(S) Sorry saps sell ya sorry sylables and selling silly suckers\n(T) Tell your tall tales trying to touch us\n(U) Understand underestimating the underground\n(V) Voting to verily vindicate this viscious type of vows\n(W) Well wishing and wondering will we waste these wanted weapons\n(X) Xeroxing x-rated, x-con type x-men\n(Y) Yearing and yelling at you yes-men for years while\n(Z) Zig-zagging and zapping and zoom zealously for zeal\n\nFrom the A to the B to the B to the Z\nNow we gonna break it down to you alphabetically\nBring you back to the essence of how we emcee\nCause we gonna break it down to you alphabetically\n\n\"We have a substitute teacher today, students. Say hello to Mr. Billy Puddles.\"\n\"Billy Puddles, Who's Billy Puddles?\"\n\n(1) One of these boys running one of these own things\n(2) Today you better stop rubbing those tutus like totsies\n(3) Three days from now we gonna break out on a three way\n(4) Fortune to fork it over like an intrepid on a freeway\n(5) Why you five-o trying to beat me like a price on e-Bay\n(6) Had a six shooter to my six pack\n(7) Seven of my nine lives just then took a trip back\n(8) Like that young kid who ate all those eight balls\n(9) Only got nine innings in this crazy game of baseball\n(10) Ten out of twenty y'all, is going AWOL\n\nFrom the A to the B to the B to the Z\nNow we gonna break it down to you alphabetically\nBring you back to the essence of how we emcee\nCause we gonna break it down to you alphabetically"}]}