{"songs": [{"lyrics": "(Roll the windows down, you know why?\nI'll tell you why)\nSo the wind can hit my face while i pump the bass, oww\nSwervin' lane to lane, like i'm going insane, may-ayne\n(I'm just playin', don't drive like that)\nAfroman in your stereo, crumblin' the walls of Jericho\nCatch me limpin' down the street, to the tempo of the beat\nLet your head bu-bop at the bu-bus stop, ay, put up your hands if you love hip hop\n(BUCOOC!)\nJoseph Foreman made this beat, funky like the bathroom in the Slauson' swap meet\nYou know how the traffic goes; it don't\nThe radio could play my song; but they won't\nJam my jam in the traffic jam, wom, bom, let your system slam\nThree eighteens vibrate your body, make you jump around like you're throwin' karate\nDancin', dancin', can't stop moving, exhausted - still groovin'\nÌ\nYou know how the traffic goes (traffic goes, oh)\nIt don't (It ain't going nowhere, hurry up and wait.)\nThe DJ can play my song (play my song)\nBut he won't\nThat's why i hit the swap meet, bought some major beat (oww)\nMAJOR BEAT\nSo i can be patient when i'm in the street (oww)\nMAJOR BEAT, MAJOR BEAT\nI'm never rude, when i get my food\nI've got a good attitude, take time dude\nBump my beat, bust my rhyme\nJammin' a drive through the Hoe town\nWalk to school, walk back home\nI never walk without my Walkman on\nI remember when i got my GRJ\nI bought an old car with a new tape deck\nWell get the in-crowd (?), cargo cluttin' (?)\nChillin' in my car with my woofers subbin'\nCan't end my night, can't start my day unless I've got myself some tight rap music to play\nTurn it up (turn it up), start humpin' (humpin')\nEverything i play beat-bumpin'\nChicken on the grill getting roasted\nI ain't going nowhere, i'm posted\nYou know how the traffic goes (traffic goes, oh)\nIt don't. (It ain't going nowhere, hurry up and wait.)\nThe DJ can play my song (can play my song)\nBut he won't. (What's wrong with him?)\nSo i hit the swap meet, bought some major beat (oww)\n(Yeah, yeah, yeah, BUCOOC!)\nSo i can be patient while i'm in the street (get on down, oww)\nI used to be broke as can be\nHubcaps missin' on my LTD\nChillin' with the winos tryna' keep warm\nFillin' out my CA-7 form (Got a pen?)\nI stand in line for three hours tops\nGettin' yelled out by the food stamp cops\nCounty wheel (?), county mail, county hospital, county jail\nCluckhead gangbangers and rude tramps\nGeneral relief and food stamps\nMy girlfriend Kim was down with me\nEven though i was broke, she let me live in her place\nShe got a son, now we havin' a daughter\nMy lightning ain't paid, i'm in hot water (?)\nTook a little trip (trip)\nDown in Mississippi\nGot with God\nClucked the grip\nJesus Christ, save my life\nRe-united me with my kids and wife\nWhen Christmas come around, they call on me\nFor the Powerpuff Girls and the Dragonball Z\nThe new Xbox and the Yugioh cards\nAll praises go to God\nI beg me patience, in my soul\nI don't trip on things i can't control\nYou know how the traffic goes (traffic goes)\nIt don't. (Go nowhere. It don't go nowhere.)\nThe radio could play my song\nBut they won't. (Ah no)\nYou know how the traffic goes (traffic goes)\nIt don't\nThe DJ could play my song\nBut he won't\nGoing to the swap meet, get some major beat\nMAJOR BEAT, MAJOR BEAT\nSo i can be patient when i'm in the streets......", "title": "Major Beat", "album": "Afroholic: The Even Better Times", "image": "https://images.genius.com/c4fd850563348aed762e3d484ea76e19.500x500x1.jpg", "year": null}], "artist": "Afroman"}