{"songs": [{"title": "Don’t Do It", "lyrics": "(Jeezy talking)\nThis is the greatest show on earth\nWhats understood ain't gotta be.. SIMPLE\n\n(sung)\nDon't do it\n\n(Jeezy talking)\nHaha, I see you Zipo..I got you homie!\n\n[Verse 1]\nNo mo' JOSE, no mo' ROSE'...\nThey locked my dog up and that ain't ro-zay..\nAll he wanted was the fame, make it last forever..\nYou get some one's, I get some one's\nWe make it rain together..\nI'm talkin quabo dreams, cristal fetishes\nSmokin' everyday, just to keep ya sanity\nJust me and my nigga like 'WHAT UP DOE'...\nStill partyin', the club closed an hour ago\nI guess the back-to-back lambo's a thing of the past\nWe use to talk on a chirp, now we talkin' thru glass..\nJust like the glass, I know he see's right thru me...\nTransparent...I can't hide my window pain\nIm thinkin' what to say to make him have a betta day\nIm walkin' down this lil' hallway like 'what the fuck I'm gon say?'\nAs I'm walkin' down the halls I feel the stress in the walls\nI need to lighten up, man...this shit is to tense\nFeels like I need tums, my heart aches so bad\nBut when he see's my face, he's gon be so glad\nThen I look into his eyes swear to God I seen his soul..\nTell me what can make a hot boy stare so cold?\nAs I looked a lil deeper, I saw a lil hope..\nAnd then he cracked a smile, he still got his pride\nKeep doin' what you doin', hold us real niggas down...\nNo matter what you do, dont let us real niggas down\n\n[Hook: 1x]\nJeezy don't do it...\nDon't you let 'em down Young Jeezy\nDon't you let 'em down Young Jeezy\nNo, no, no, no, no\nJeezy don't do it....\n\n[Verse 2]\nI done been through so much, real life done lost touch\nInhale so much yayo I lost my sense of smell (haha)\nAnd I don't mean that literally...but I mean this literally\nThese niggas actors, me I'mma factor..\nKnown for movin' big money, I should've leased a tractor\nNo brakes, no tires, I'mma ride for these streets..\nYEAHHH..until the wheels fall off!\nIt's gon take more than hate to get my focus off\n+Can't knock the hustle+, still stackin' +dead presidents+..\nThey say he's on his was out, well thats a +reasonable doubt+..\n+Ain't no niggas like the one's I got+..\n+Friend or Foe+, +Politics as Usual+\nI'm +Feelin' It+, still livin' wit regrets...\nWith all these +Imaginary Players+, +You Must Love Me+\nI told y'all in due time...+The City Is Mine+\n\n[Hook until fade with Jeezy talking in the background]", "album": "The Recession", "year": "2008-09-02", "image": "https://images.genius.com/1b0e8d5c8ba78942c07465f1565ca9c0.1000x1000x1.jpg"}], "artist": "Jeezy"}