{"songs": [{"title": "Every Single Bitch", "image": "https://images.genius.com/ba5e0eb6b2a9751eafc012365bd32cd8.710x716x1.jpg", "lyrics": "[Intro: Brotha Lynch Hung]\nFuck these hoes, it's the re-do, you know how we do\nEvery Single Bitch y'all\nFrom the Psycho Active album, by my nigga X (Nefarious)\nBear nigga the flex, can't come nearious (biatch) (who is this?)\n\n[Verse 1: Brotha Lynch Hung]\nIt's the muthafucken Lynch and I'm back on a X tracc\n'Bout to tell you niggas how to keep a ho stack (what you do?)\nWhat you got to do, ta have your bitch clockin\nJust put her on skirt, (then what?) sit her on stock then fish-net stockins\nTight around thick jock, make it look good, to the normal nigga eye\nThat bitch'll make a killin even if she ain't fine (what?!)\nCuz a big ass and some titties is a gold mine, deuce-nine dollars\nA nut, two nuts is 58, an extra 4 if want the ho to masturbate\nA blow job is 24 bocks a hit\nBut it's worth she see the ho swallow the gooey shit\nAnd when I come through she be comin to see daddy\nLike a O.G., you know me, I'm sittin in the Caddy, kick back\nLook at the ho like \"Wow!\"\nBitch your my slave, what should I make her do know?\nYou can't treat a bitch good, you know (no)\nWhat good is a nigga who ain't slappin his ho\nSo peep, let 'em all know that you don't play\nAnd every bitch gotta price to pay\n\nThat's real, you bitches, fuck hoes mayn\nThey got all off crack, tryin to make you scratch\nThat's realer than real, shots to that nigga Nefarious\nHe put down the original game, nigga just need to bring back some doe\nSlow me, uh, productions\n\n[Verse 2: Brotha Lynch Hung]\nWho's the ho? A bitch named {silence} was the trick\nShe gave up the poo-poo for not one cent\nShe didn't pay, fuck it I kept the ho\nEvery morning at 6 A.M. she was leavin out my window\nThe close homie probably hit 'em too\nI thought I gave her fuck but she probably fucked the whole crew\nI can't lie, I hella liked the bitch\nBut like X-Raided said: \"Once a bitch, always a bitch\"\nSo why try to change her?\nI rather be by myslef, fuck a ho I strangle her\nThe only woman I respect\nIs my muthafucken moma, disrespect I break yo neck\nIt's hella easy pullin hoes (hella easy pullin)\nHalf cuz I got game and half cuz I'm in the store\nDumb bitch you, you get's no play (24 street)\nYou got a price to pay, fa sho\n\nFuck these all muthafucken\nDisease carrien\nMuthafucken red pussy havin\nCuz it's been dug up, stretch up, phunky stupid ass, biatches\nSet up bicthes, yaknowwhuti'msayin\nFuck 'em and leave 'em\n\n[Verse 3: Brotha Lynch Hung]\nThat's that bitch givin up the cash\nI know a ho, who would straight up jack yo ass\nYou might go to the mo-mo and get you some\nThen you wakin in hella broke and feelin dumb\nShe made you cum then your ass went to sleep (then what hapend?)\nTook your ki and out the doo' the ho creep\nYou got got by a sneeky ass bitch\nNow she's kickin with a notha nigga, front you shit\nYou said the baby had you caught, that's what you said\nBut you thought she was sprung so you gave her the bread\nIt was all of the bitches plot\nBig spider web, yo ass got caught\nYou went in her that night loc\nYeah, she said use the rubber, a big fucken\nShe got head, ate and paid quick\nAnd all you got was a fat ass cheuqe to spend\nSee, niggas just love the bomb shit\nThem bitches cry to make a nigga go for it\nBut not me, nigga I do it my way\nCuz every bitch got a price to pay, fa sho\n\nYouknow, what I say, haha, them bitches got you stretched out...", "year": "2000-06-27", "album": "EBK4"}], "artist": "Brotha Lynch Hung"}