{"artist": "Canibus", "songs": [{"title": "Detox Infinity", "album": null, "year": null, "image": "https://images.genius.com/86dfaf46c1f97aa0d3bdebf581f58529.1000x1000x1.png", "lyrics": "Omni, Oobi\nInfinity ain't ready yet, sue me\nLook what they tryin' a do to me\nDetox, half dead, drowsy, that's how they found me\nHowdy, let's get to the bitter end shall we\nIn the Area 51 bunker with [?]\nChance assigns each ripper their own personal housing\nWalking down Downing Street just browsing\nKnowledge god in the up army [?]\nListenin' to the album\nEzekiel a rain mac train by the train tracks\nOK gentlemen breathe\nI watched they shoulder blades relax\nExpand contract\nTranquil beast strike like matts\nJavelin Fangs and [?] the White Knights of rap\nMaster swat chief tussin\nIron Man [?] bunker bustin'\nEx [?] Dutchman, translate some Russian\n\nTell them impatient niggas to stop fussin'\nAnd banging they knife and fork on the table\nThe chef's in the kitchen cookin'\nWhat's the point in eatin' a meal that ain't ready?\nJust to go outside and get punched in the belly\n\"You threatening me?\" No\n\"Then why you questioning me, yo?\nIf it was me I would have finished it by now.\" So?\nThe only thing fishy is the jacker acting like he ain't with me\nWe keep it Puerto Rican rum proof, 150\nRip the disciple, one hand on the rifle\nBoth eyes on the title Santiago psycho\nJoe the Butcher carve it up while tarantulas crawl on ya\nScorp the monk put the C logo scars on ya\nLord Zero, our hero\nArchitect provide the inside track\nFrom his contacts at the Bureau\nDJ Comma Infinite thorough\nInfinity ain't ready\nCause we goin' through a music industry furlough\nSo pass the merlot and shut the fuck up\nYou ain't gettin' it 'til it's ready\nAnd it won't gonna be ready 'til I'm done\n\nDead Man Walking just walked out the building\nSoon as Pac turned all his music in they killed him!\nEvery time a artist get wacked they make money you faggot\nDon't you think we figured out that pattern?\nI ain't never made music just to make money off it\nI ain't got no Playgirl Bunnies at the office\nI ain't got no office, I'm Father Poor Pauper\nThey took my green card, I can't even fly over the water\nSo who ran over whose money?\nListen buddy, 10,000 bars never been done before dummy\nSeventy dollars?  You spent that on at Benny Behana\nValentine's Day. \"Why wouldn't you send me some flowers?\"\nA one month gym membership, a protein drink and a shower\nPop off the gas tank, 12 gallons\nDrive through, a family of five\nThree fat people, any McDonalds\n\nLast album, USB drive's 10 hours, it's my album\nStop asking M-80 about it\nStop acting all childish every media outlet\nDo you think it's a smart move\nTo waltz into the restaurant and be rude\nWhat do you think they gonna do to your food?\nThere's five hours of free Infinity on Youtube\nMore than that when the rippers' mix in a good mood\n100% truth, that's my statement\nSo anybody complainin'\nCan't do a damn thing about how long it's takin'\nCause I'm the one that makes it\nAnd you ain't gonna rush me just because you impatient\n\nWho else got somethin' to say Bis?\n\"This is Infinity Detox, you got something to say Rip?\"\n\"I think we forgot to say a couple of things boss\nBut that list was so long I'm not passively playin' dawg\nI got your back, fuck it, I'm gonna do it myself\"\n\n[At this point, the lines are choppy and overlap]\n\nYou gotta hold it down\nFor every ripper who supported and helped\nInfinite Phase showed me what DC told me\nThe rippers' abilities nullify numbers\nWe got our own army of creativity\nAnd artistry the way it ought to be\nPeople drop a PLOO tape every week\nSlayers don't fuck with CC\nBut fuck with real rippers with real identities\nLike Passionate and Maltese, RIP-K123\n[?]\nMC's blowin' ganja\nWith Andre the Beast, Presto, Trolla, East Tony\nYou know my niggas in the streets\n(I'm in the bunk)\nListenin' to my lesson sing\nDo the damn thing, it's a process\nDJ, [?] King\nFlux who came through\n[?] Captain [?]\nIn the chopper flyin' over the tropics\n[?] DJ Johan Solo\nMix it in the cockpit create mixin' my new shit\nWhite bong with meta shape drawn\nDesigns the first PLOO spaceship, it's true\nA colorful cube with rainbow exhaust\n[?] pass along the fuel of the Gods\nCopernicus monitored this\nFrom the earth to the stars [?] ridin' shot\nBy Chandel spittin' bars, we picked up lace\nBoom, the seven over[?]\nCivilians reported strange lights in the sky\nFor 12 counties before it got too cloudy\nSoul [?] drops the flare\nI found him at Ivy chillin at the boundary\nAn APB comes out the speakers playin' loudly\nProximal and troubled, detoured on the double\nPoetic spy through the Hubble\nThey saw him in the flesh, man\nFight Lizard Beast Face on Mars in the rubble\nWatch out, enter coordinates\nThe BTA, was 10 minutes left\nHypodrive max supplied by Jackson\nNow play that raw eight track\nWhile I kick back trying to relax\nWatchin' something important like battle rap"}]}