{"artist": "88-Keys", "songs": [{"album": "40 Days & 40 Nights", "lyrics": "[88 keys]\nDon't even play yourself\nWhat you gave what I got\nYou haven't saved yourself (yourself)\nFor one minute\nYou say nothings been in it\nDon't act like you were raised in a house\nWith nuns in it!\nI'm not dumb nor timid to the women of the block!\nWho be given up the crotch (crotch)\nSo we can have fun with it\nThis is a two way street\nEven tho I bust my nut\nYou still got something to eat\nTake yo ass to lotus(?)\nIn the meat packing district\nYou won't find a meat this thick\nDeep in the jungle with you mac lipstick\nI ain't lying when I say i-\n\"Want your number, What's your myspace page girl\"\n\nYeah, Yeah, Yeah,Yeah\nNow holla if you ever been placed in handcuffs\nNot on me but I put em on her tho\nNow holla if you ever been placed in handcuffs\n\n[XV]\nI'm like- un-huh\nSee my story a little different tho\nCheck it\nEven on the internet she was a site to see\nThought she was a perfect match she enlighten\nI be like \"Ay, thats my wifey to be and i'mma\nPeek at whatever she ain't like me to see ok?\"\nAfter I seen what she can do with her throat\nI turned the red light on\nMy lady I told her I can't let you-\nCuz you drive me so crazy\nPulled out the cuffs the first time in my life\nOver to the left so I can read you your rights\nI take her to the club but I can cuff her all night\nDude's tryna holla I'm like \"get off of my wife\"\nShe said \"you too uptight\"\nI'm like \"......\"\nHaha, Now ain't that something?\nGot the key to her heart but I'm still handcuffin\n\nNow holla if you ever been placed in handcuffs\n(in handcuffs,in handcuffs)\n\n[Outro]\nSo yeah then Adam let me know, Like he got home from the bar\nOld girl in his bed, he's in the bathroom, Giving his dick\nPep talk, he's like \"Stay up come on we can do this\", he like\n\"I got this girl, shes in my bed she's bangin I can't believe it.\"\nBut Adam definitely didn't want his dick to go down", "image": "https://images.genius.com/d51e86578df25f696ad430beed4f0415.500x500x1.jpg", "year": "2008-11-01", "title": "Handcuff ’Em (Remix)"}]}