{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/21af1b75150287897aef54312f0bc97a.500x500x1.jpg", "title": "Dear Mother", "year": "2010-08-01", "album": "Xerxes the God-King!", "lyrics": "[Verse 1: King Gordy]\nHey Yo\nMe and my soccer mom is locked in an octagon\nWith boxers on and knuckle guards around our palms\nWho's the first to drop a bomb?\nGet her in an arm bar and make her tap out, she slips out, gets into full guard\nDon't worry my mom's strong, but pops soft so he coaches her\nGrow some balls and come n get your block knocked off\nNO\nBut she says she wants to do it so let's do it\nBeating her til she's bloody the canvas covered in fluid\nHearing her scream is therapeutic\nSee it's like sweet music to my ears as my gay ass dad stares in fear\nWhile his wife's being killed in here, this sounds fun\nNot even twenty seconds into round one and mom's done\nPut her in a rear naked choke til her neck is broke\nAnd dad whatchu stepping for?\nYour scary as a pregnant ho\nBITCH\nI'm an American terrorist uncut\nFuck a therapist, just go beat your parents the fuck up\n\n[Hook: Kehoa & King Gordy]\nDear mother\nYou have to die\nKill your parents, kill your parents, kill your parents now!\nDear father\nYou can sacrifice\nKill your parents, kill your parents, kill your parents now!\n\n[Verse 2: Bizarre]\nRufus Johnson, the kid who got molested\nMom finger fucked me while she was still pregnant\nSeven months, with two more to go\nCrackhead Betty is starting the show\nAll at the store ready to suck and fuck\nSold my sister for ten bucks to my uncle Chuck\nAnd uncle Chuck, he made her a sex slave\nEven a transsexual pub aid didn't wanna stay\nThey brought me on t.v. for two dollars and fifty cent\nFlies around my face, smelling like shit\nAll white community, somewhere down river\nAll the white kids said \"Johnny you a nigga.\"\nGrab a steak knife, stab you in the eye\nShould've left me in Africa with the shit and the flies\nDo like John Bridges and write a book\nAbout a childhood star that got his manhood took\n\n[Hook: Kehoa & King Gordy]\n\n[Verse 3: Prozak]\nMommy dearest why have you forsaken me?\nTaken me to this place where Satan be\nSo hastily you've hated me\nSince birth I've been rejected, protested\nIt hurts the worst to accept this\nCan't find the words to express this, except for kill em all\nAnd now this twisted mentality holds me tightly\nWithin the grips of insanity\nI've finally flipped from humanity\nTo the darkest realms, spawned from hell\nMy carcass harvested as a lifeless shell\nNo remorse, never tell, handful of pills does me well\nI'm psycho, full blown like Micheal\nFor-grown and spiteful, homegrown with rifles\nSerial killer in the making, like Jason, facing my demons\nScreaming in silence from violence I've witnessed since breathing\nI'm a broken soul, no control\nSo help me God I'm letting go\n.45 up to my dome, cock the hammer, let it blow\nBefore I go I gotta say goodbye to mother\n\"Norman is that you, you worthless motherfucker? \"\n\n[Hook: Kehoa & King Gordy]"}]}