{"artist": "Boosie Badazz", "songs": [{"album": "Out My Feelings (In My Past)", "title": "Big Blue Hundreds", "year": "2016-01-01", "lyrics": "Verse 1: Boosie\n\nKeep them big blue hunnids on me\nSo i keep money & guns on me\nGot a lot of big blue hunnids on me\nSo i keep money & guns on me\n\nWent to the pawn shop, got another fishing rod\nWhat that mean nigga? got another body guard\nHow you feel nigga? feel like niggas staring hard\nBoy i kill, you ain't fucking with no lil boy\nI got a band on top of band on top of band, thats a 50 pack\nGot this man up in my hand & its a 50 gat\nGotta have it on me dawg cause im getting that\nTry to take it pussy & i promise you, you getting whacked\nAin't in the way, get out my way when you doing dirt\nIm a boss but remember i was a shooter first\nWho purse? not my mama purse pussy boy\nEmpty this bitch here & hit em with the other roid\n\n(chorus)\nGot a lot of big blue hunnids on me\nSo i keep money & guns on me\n(x2)\nGot a lot of big blue hunnids\nBig b-blue hunnids\nBig blue hunnids on me\n(x2)\n\nVerse 2: Mista\nCame home to a hunnid bands & twin Glocks\nDriver said he heard three but it was ten shots\nPussy nigga got my name in the wind now\nBut im back, im with that bullshit again now\nD.A said im godfather, im like this hoe tripping\nTired of using [ ? ] watching all my children\nBack strap with side armer, like who want it with me\nHad a ticket, cash that ticket, nigga go & get it\nOn 24 hour lock down without no cell mate\nPlaying chest all by myself, i got a stale mate\nDiving in that water, hope that you could sail straight\n40 grand but this 40 kept my fam safe\n\n(chorus)\nGot a lot of big blue hunnids on me\nSo i keep money & guns on me\n(x2)\nGot a lot of big blue hunnids\nBig b-blue hunnids\nBig blue hunnids on me\n(x2)\n\nVerse 3: Boosie\nCheck this out this a rat, this a stack\nSomebody made a rap bout hatch now he ain't back\nPussy nigga wack\nYou ain't taking nothing from me, i ain't pussy i ain't running\nIf you check my rap sheet, you'll see that i ain't stunting\nWalking on yo pussy ass ain't nothing\nI ain't staright for I.G, pussy boy im push buttons\nI been gettin alot of cho-cho, ballin on the plane\nThinking niggas names when im shooting at the rain\nAll blues boy, a hunnid 20 in my pants\nGet outta line, a hunnid 20 on yo whole gang\nIts no eraser when i got yo whole name\nCold cases, old friends, this a fucking cold game\n\n(chorus)\nGot a lot of big blue hunnids on me\nSo i keep money & guns on me\n(x2)\nGot a lot of big blue hunnids\nBig b-blue hunnids\nBig blue hunnids on me\n(x2)", "image": "https://images.genius.com/5017fc0dc3e487ccadcc16b5dbc6a40d.680x680x1.jpg"}]}