{"artist": "Kidd Kidd", "songs": [{"image": "https://images.genius.com/e17eef41ffb7b716a6b412052f096c1c.600x600x1.jpg", "title": "Pussy Nigga", "year": "2016-07-14", "album": "Fuck Da Fame 2: American Trapstar", "lyrics": "[Intro]\nHashtag loyalty has no price nigga\nFuck the fame\nAll or nothin' nigga\nThe squares out the circle\n\n[Hook]\nI can see that you a pussy nigga\nI see it in your eyes\nYou fell in love with a pussy nigga and now she mine\nYou said you never was a pussy nigga?\nStop lyin'\nYou better watch out for these pussy nigga\nThey in disguise\n\n[Verse 1]\nDoot-doot-doot, my choppa got a stutter problem\nLight a nigga on Harlem Nights boxin'\nWhen they can't talk to you they talk about you\nGot my hands dirty from milkin' so many cowards\nYou better watch who you talkin' to\nLast nigga got the coffin, ain't caught the flu\nSeen me with the same team, ain't nobody knew\nWe get a lot of shit but ain't nobody knew\nIf you a snitch it don't apply to you\nBig Mac out the window, McDonalds drive thru\nPotato on the barrel, here's some fries too\nFor some extra cents you could get it super sized too\nPlay no games with these niggas cause they fake and they phony\nEverybody claim they beefin' but it's bunch of baloney\nI don't need nobody with me, do my dirty on my lonely\nI ain't runnin' to no car nigga, I got it on me\n\n[Interlude]\nYou already fuckin' know tity fuckin' baby. I'm zone rider baby, all that talkin' bout you beefin' nigga, you ain't beefin' nigga. Stop all that fucking shit man, you fit the shoe nigga wear it. You fit this motherfuckin' shoe? Nigga wear that bitch nigga. These niggas be everywhere man. Talkin' about a nigga fuckin' everywhere, nigga everywhere. Nigga you ain't there. Fuck you already know where we at\n\n[Hook]\nI can see that you a pussy nigga\nI see it in your eyes\nYou fell in love with a pussy nigga and now she mine\nYou said you never was a pussy nigga?\nStop lyin'\nYou better watch out for these pussy nigga\nThey in disguise\n\n[Verse 2]\nIt ain't time to play, you got that iron in your face\nI try to tell you keep it real, you still lie in my face\nBoth my partner know where your baby momma stay\nIf you ain't home then that ho gon' have to die in your place\nNiggas wanted beef and went and got a steak\nThen they went to sleep, then he got away\nWord on the street, whatever we say\nIf you keep this shit discreet, we could get away\nCause nigga's lips stay open like pussy hoes\nSofter than cookie dough\nGangsta I don't know what you read about\nHustler pump drugs out my momma house\nBitch you better not air it out\nI'm 'bout to call Mario out\nGive you somethin' to talk about\nTell that pussy ass nigga what I'm all about\n\n[Interlude 2]\nYou know what it is bitch. You know it's Rider Gang all day. You know what it is, Me, Zach 24/7 nigga. You niggas talkin' beef but you know where I be nigga. 24 from (?) store you want to see me? Come see me nigga. 2014, it's our year, we been had this shit, Kidd Kidd. You know we got the fuckin' Unit, Rider Man here nigga, on some boss shit\n\n[Hook]\nI can see that you a pussy nigga\nI see it in your eyes\nYou fell in love with a pussy nigga and now she mine\nYou said you never was a pussy nigga?\nStop lyin'\nYou better watch out for these pussy nigga\nThey in disguise"}]}