{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C. Pt. 2", "title": "ABC", "image": "https://images.genius.com/e25277b4e30e7ff6801bccf445a029d8.499x499x1.jpg", "lyrics": "(Young P)\nAyo daddy show these mothafucka's how we do it\n\nP, P, P, P\nP, P, P, P\nWho holding down NYC huh?\nP, P, P, P\nYeah, listen\n\n[Prodigy]\nIt don't matter who popping for the moment\nP is forever, it don't matter what's the new hot shit\nMy shit better, courtesy of myself, thanks to me\nI've work hard to come with these\nSixteen's is much more than a rap, this is pure facts\nYou see what's really good when you catch him by himself\nDolly, I leave a fool holy like Jesus Christ\nIt's a miracle he still living\nAnd you could say a whole life time of prayer\nBut you never in this lifetime player be the mayor of the murder murder\nKiller killer, bloody rap songs out the slums in the squala\nMade a few dollars, now they say I'm too rich\nI give some to you, now a nigga cool\nHa, I ain't got two cents for you bums\nNow watch as I burn rubber in the six-huns\nCL made my gun ring a bell\nWhere the shots came from they never can tell\nThey just here to fire and everybody bails\nOne nigga on the ground dying in hell\nFo'real!\n\n(Chorus) Prodigy and kids\nA B C D E F G\nH I J K L M O\nP P P P P P P\nAnd numero uno P\nThere's no other\nKids tell 'em who I be\nA B C D E F G\nH I J K L M O\nP P P P P P P\nThe one and only\nH.N.I.C. who holding NYC huh?\n\n[Prodigy]\nListen, R.I.P season begins\nDead bodies popping up, niggas getting hit\nOthers getting beat the fuck out and bashed out\nMOP style, they get mashed out\nI razor blade you up and cut you bad\nYou gon' need plastic where your face's at\nBoy I'll bullet riddle you up and chop you into parts\nThen scatter you all over the East Coast, kiko\nYou're playing with your life\nYou play with me you're like a baby running with a knife\nYou're upset your wife got my CD in the changer\nAnd you rap too and she don't bump your bangers\nYour shit wack and then on top\nYour life style don't match the shit you pop\nThis is gon' be simple cause you're easy\nLike 1 2 3, I do it niggas greasy as...\n\n(Chorus) Prodigy and kids", "year": "2008-04-22"}]}