{"songs": [{"album": "Strangeulation Vol. II", "image": "https://images.genius.com/d6abef8fbc863a78647f5e7bfd58bbe7.500x500x1.jpg", "year": "2015-11-20", "title": "Blunt and a Ho", "lyrics": "[Verse 1: Tech N9ne]\nIRS took all my money, I was a stupid kid\nCause I didn't pay taxes when shit was lucrative\nSo I had to start over, good thing I shoot the shit\nOff enough to not take me away to do big bits\nSo I say that to say that I'm straight building\nBut it really hurts when the government take millions\nSince I was shady had two ladies to make children\nThe same time when they do college you break scrillion\nSo you think of doing the shit that be un-earthly\nTo be sure your daughter stay steady and up in Berkley\nMoney be the problem, but other things be here to curse me\nHurt my girl so much she now doing the shit to hurt me\nWifey cheated after I did and skeeted\nMy life is a Red Hot Chilli Pepper I eat it\nLike I'm Anthony Kiedis, I'm heated\nSo, just like a man, I resort to my penis\nSo check it out...\n\n[Hook: Tech N9ne] (x2)\nI got a blunt (And a ho)\nI ain't about to spend my whole day stuck in the funk\nSo I'm about to get drunk (And a ho)\nSitting right on top of me with that incredible rump\nSo check it out\n\n[Verse 2: Murs]\nI used to have this festival called \"Paid Dues\"\nBut I never fully got paid, dude (Really?)\nThe IRS thought they think I did\nAnd now they after the kid, shit\nAnd I'm the only one in my household that go to work\nAin't getting no pussy, so now I gotta jerk\nFeeling like a jerk and that ain't ever gonna work\nPlaying positive, but ain't getting none of the perks\nWhat to do when your IG popping off?\nSnapchat got the gym rat panties dropping off\nSaying all she want is this dick, whether it hard or soft\nClosest I been to pussy is fish sticks and tartar sauce\nAnd I ain't tryna be no martyr boss\nFucked around and she done pissed Nick Carter off\nThis nigga Tech got me high and now I finally got a good alibi\nSo check it out, I got a...\n\n[Hook: Tech N9ne] (x2)\nI got a blunt (And a ho)\nI ain't about to spend my whole day stuck in the funk\nSo I'm about to get drunk (And a ho)\nSitting right on top of me with that incredible rump\nSo check it out\n\n[Verse 3: Ubiquitous]\nI got a chick out of town always giving me stuff\nShe stay mad as a fuck cause I don't visit enough\nSo she calls me to cuss\nI don't know what it was, but, uh, something that I does got 'em falling in love\nSo we on the phone beefing and she crying to me\nLike \"U-B-I, you be fly, but you be lying to me\"\nTrue, she dying to see where I was and what happened\nStudying social media, she trying to catch him\nBad bitch caught him off guard with the condom off\nLet her hit, now my dick feel like it falling off\nSperm went and shot 'em off burning like a Molotov\nWord to my mama, I'm disturbed by a lot of broads\nThat's word to mother, son, I cut her off\nBaby, she make me cum a lot, but it come at a cost\nI got a girl I love, and I lost, we'll never reconcile\nShe played me like a pawn for the record\nSo check it out, I got a...\n\n[Hook: Tech N9ne] (x2)\nI got a blunt (And a ho)\nI ain't about to spend my whole day stuck in the funk\nSo I'm about to get drunk (And a ho)\nSitting right on top of me with that incredible rump\nSo check it out\n\n[Outro: Murs]\nOh, man (Ah, shit)\nBoss man, boss man\nI told you I don't smoke man, you know I don't do that shit\nAy, y'all hear that?\nIs that my phone? Hold up\nHello? Hey baby, uh, nah, hold on\nAy, y'all do I sound high?\nFuck! Y'all gon' get me a divorce, man\nGod damn it\nHold on, baby, I'll call you right back"}], "artist": "Tech N9ne"}