{"artist": "AZ", "songs": [{"title": "Just Because", "image": "https://images.genius.com/35afe30eb73450ff393ecfb0e427ce61.500x500x1.png", "album": "Pieces of a Man", "lyrics": "[Verse 1]\nIt's on for now, niggas ballin' now (uh huh)\nIt's The Firm baby, ain't no fallin' down\nThrough your eyes see yo' snakeness (Uh huh)\nNo lie, Doe Or Die, try to take this\nStay swift, you can follow if you tailgate (C'mon)\nReminiscin' when a nigga used to sell weight\nWell laced, G.A. in the summertime, Freak'n it\nWhen the time it's the ski trips, when we rich (C'mon)\nBack and forth to the ball game, Hen in the cup (Ah)\nThrough the years niggas all changed, livin' it up\nTakin's steps to the next level, seen the light\nWhat it be like, now, puttin' weed in the pipe!\n\n[Hook x2]\nBerakin' day, off this shit here\nThis year, snatched loot everywhere\nNext year, takin' what we left here\nA fear, for thugs\nHoes get dug, foes get slugs\nJust because\n\n[Verse 2]\nCancun at the Jazzfest\nFirst time we ever met you was half dressed\nEasy access (Ah)\nYou and you whole crew, ya alright\nWhen you beep use Code 2, call tonight\nGot a villa full of young Dons\nChampagne and a grill on my front lawn\nWhat song?\nWe can dance to some more jams\nFinally meet Nas and the whole fam\nRoseland, love is love when it's all good, clutch ya name (yeah.. yeah)\nThrough my eyes, see I'm all hood, fuck the fame\nPlay a script like Larenz Tate, bench weights (Yeah)\nWorked out stay in shape\nBenz plates\nCruise around wit the hot sounds\nPumped loud, \"I Be\" by Fox Brown\nIt's locked down\nOverall tryin' to make moves stay in the mix\nMotivated by the ace, deuce, tre and the six\n\n[Hook x2]\n\n[Verse 3]\nWanna bring it to me right way\nFace to face, (yeah) when you see me get ya lie straight\nIt's high stakes, (uh huh) goin' up against a street playa, true type\n(uh huh)\nGet the paper handle beef later, never too hype\nAnalyze from the next man, wants war\nStill alive, on the next plan, wantin' more\nOutta town tryin' to get mine stay in the cut (Uh huh)\nCubans control the prices, keep raisin' 'em up!\nPeace and love to my allies (Uh, uh) play on\nStayin' up, high late at nights, stay strong\nSittin' up lettin' all y'all know the deal\nThis Firm shit is on for real (For real)\n\n[Hook x5]", "year": "1998-03-26"}]}