{"artist": "Pouya", "songs": [{"album": "Baby Bone", "title": "Say Hello", "image": "https://images.genius.com/bc221e3874d2c5529802975728ddb8f4.700x700x1.jpg", "lyrics": "[Intro: Scarface Movie]\nYou wanna fuck with me? Okay\n¡Abrir la puerta honcha!\nYou wanna play games? Okay\nOkay. You wanna play with us? Okay\nSAY HELLO TO MY LITTLE FRIEND\n\n[Verse 1: Pouya]\nDashing, ducking police\nThey wanted me stuck but they couldn't find me\nI hid in the trench deep inside Miami\n3-0-5, where you can find me\nAll of my bitches, they wearing designer\nSucking my dick, but not eating vagina\nMy ho, she was made in China\nDump you in the river, ain't nobody gonna find ya\nUgly frank, grab the shank\nHomie was bucking and doing wheelies in the tank\nMan, packing them weapons ready for war, not afraid\nWe brave, and don't really care what ya think\nDon't sleep on me ho\nPhase two in this thang, bang, swang\nIf all I meant now rose drove(?)\nTo the back, make a tact to the fours, floors\nGo sick and I'm blasting the ho with my cum\nCome see me what I do when i run this rap game\nMoney and love is everything, fuck fame\nBitch look at my eyes and suck on my dick\nHo busting it cus' it is like a custom\nI'm fucking yo sister, yo mom and yo cousin\nThe family tree, bitch, you wish you could get it like me\nYou really ain't fucking with me\nI know you ain't talking to me with that tone\nI wish all these hoes would just leave me alone\nI'll put you on blast on Instagram, and you don't want that\nI completely understand, but I don't give a fuck cus I'm the motherfucking man\nBitch hold my shit, blow my dick, and don't say shit\nMake sure you don't say shit, ho\n\n[Verse 2: Pouya]\nYuh\nThe Pou comin' through with the mufuckin' heat\nAnd I bet that I make yo ho drop to her feet\nSippin' rum, sippin' that Hennessy\nPour it up for all my enemies\nFree'd up my energy\nFuckin' this shit up\nI'ma ride that pussy with my stick up\nBitches they call, never pick up\nThey stuck on my dick like a sticker\n\n[Outro: Pouya]\nYuh\nPop that pussy for a pimp\nBitches on my fucking dick[x2]\nSo pop that pussy for a pimp\nThese Bitches on my fucking dick\nI'm chilling with my fucking clique[x2]", "year": "2013-08-08"}]}