{"artist": "Webbie", "songs": [{"year": null, "lyrics": "Trill Fam. Young Savage you can catch me (catch me)\nFresh kicks, fresh bows, and a fresh tee (fresh tee)\nWe two crucial ass hoes yea that's me (that's me)\nLook at him his eyes closed he ain't even sleep\nSay Boosie chill wit all that swervin' too much dope in here\nNigga slow down you betta think about Big Head and Pimp\nY'all want that savage shit (savage shit) I gotta represent\nY'all want some rider shit (rider shit) well here it is then\n\n[Hook: repeat 2X]\nHow you ridin?\nBad bitch hair did nails feet too\nHow you ridin?\nLeather seats TV's with the beat too\nHow you ridin?\nGettin big behind tint you can't see through\nAnd my rims way bigger than yours\n\n[Webbie]\nRed truck, blue truck, green truck, black truck\nSuburban, Excursion, that Tahoe, that 'llac truck\nFuck it a bucket, a Delta, a Cutlass\nA Regal, a Montigue whatever you thuggin'\nIt's suped up, it's couped up, it fold down with grey sound\nWhen summer hit you gotta keep the roof up or it go down\nThat bad bitch now she be in that Mustang or that Sebring\nOr stuntin her ass off in that '05 her man bought\nHow much your paint cost?\nLook like it just got rained on\nTell me this when you stop do your rims stop or they keep goin\nYour Nissan, your Neon, your old man Caprice own\nYou finna take off them twenties and put them big 23's on\nWatchin the latest DVDs with the TV's on\nIt's hot AC in winter can turn your heat on\nYou hear them loud pipes as soon as you put your feet on\nBicycles, motorbikes, whatever you on the street on\n\n[Hook]\n\n[Webbie]\nYou went the cheap route or do that deck pop out\nYou gon' let that tech pop out if that mess pop out\nHow you ridin\nWant you ain't worried bout flossin\nYou hollerin fuck what I'm talking your shit better than walkin\nIt's five stickers up on it look like the junkyard on it\nThe 26's up on it and Boocu bitches up on it\nWhat kina motor up in it think it can fuck with that Hemi\nI gotta Cutlass 350 will leave your ass by a distance\nYou ain't customly did it or oringally interior\nYour like them Westside niggas'll sit that thang on them switches\nThem by 9's be tickin you broke the rearview mirrors\nBut that's the 415 shit I run with the 412\nI gotta 'llac chrome grill on the factory rims\nHoes piled up in here all on laps be still\nCan't wait to get to the room nimblin on my ear\nY'all gon' get it just chill let me control this wheel\n\n[Hook]\n\n[Webbie]\nHot gun half a bird man I ride like that\nI ain't even tryna swerve I just drive like that\nWith a Beyonce face and some thighs like that\nAttitude like Trina and a ass that fat\nFuck it I done told my cousin you can have that Lac\nGon get your shine on watch what I'm gon' snatch\nI don't know but off the top I'm spendin 85 stacks\nWith them cozy ass seats that massage my back\nJacksonville, Mississippi A-Town y'all niggas wit me\nThey talk funny but them boys makin money in New York City\nTook some trips up to Houston be all the D-Town bootin\nGreg Street whats happenin to they love that Gangsta Musik\nIf you gon' do it then do it from the Benzes to Buicks\nLet your ends look stupid drop them up 22 it\nY'all niggas is clueless don't you worry bout Trill\nThis another hit for y'all stupid clowns to steal\nGametime", "image": "https://images.genius.com/fed2b88612a95c627c4595a7e42543b5.500x500x1.jpg", "album": "Savage Life", "title": "How U Ridin’"}]}