{"songs": [{"album": "Born Sinner (Deluxe Version)", "year": "2013-06-04", "title": "Crooked Smile", "image": "https://images.rapgenius.com/a9067d240e699c6ca27a7597b7d4e640.640x640x1.jpg", "lyrics": "[Chorus: T-Boz, Chilli & Jennifer Hudson]\nEven though I—\nOn my way, on my way, on my way down\nOn my way, on my way, on my way down\nYou were the one that was tryna keep me way down\nBut like the sun, know you know I find my way back round\n\n[Verse 1: J. Cole]\nThey tell me I should fix my grill ‘cause I got money now\nI ain't gon' sit around and front like I ain't thought about it\nA perfect smile is more appealing, but it's funny how\nMy shit is crooked—look at how far I done got without it!\nI keep my twisted grill, just to show the kids it's real\nWe ain't picture perfect, but we worth the picture still\nI got smart, I got rich and I got bitches still\nAnd they all look like my eyebrows: thick as hell\nLove yourself, girl, or nobody will\nThough you a woman I don't know how you deal\nWith all the pressure to look impressive and go out in heels\nI feel for you, killin' yourself to find a man that'll kill for you\nYou wake up, put makeup on\nStare in the mirror, but it's clear that you can’t face what’s wrong\nNo need to fix what God already put his paintbrush on\nYour roommate yelling, \"Why you gotta take so long?!\"\nWhat it's like to have a crooked smile\n\n[Chorus: T-Boz, Chilli & Jennifer Hudson (J. Cole)]\nEven though I—\nOn my way, on my way, on my way down\nOn my way, on my way, on my way down (This crooked smile)\nYou were the one that was tryna keep me way down\nBut like the sun, know you know I find my way back round (Yeah)\n\n[Verse 2: J. Cole]\nTo all the women with the flaws, know it's hard, my darling\nYou wonder why you're lonely and your man's not calling\nYou keep falling victim ‘cause you're insecure\nAnd when I tell you that you're beautiful you can't be sure\n‘Cause he don't seem to want you back and it's got you askin'\nSo all you see is what you lackin', not what you packin'\nTake it from a man that loves what you got\nAnd baby girl, you a star, don't let 'em tell you you're not\nNow is it real? Eyebrows, fingernails, hair\nIs it real? If it's not, girl, you don't care\n‘Cause what's real is somethin' that the eyes can't see\nThat the hands can’t touch, that them broads can’t be\nAnd that’s you, never let 'em see your frown\nAnd if you need a friend to pick you up, I’ll be around\nAnd we can ride with the windows down, the music loud\nI can tell you ain’t laughed in a while\nBut I wanna see that crooked smile\n\n[Chorus: T-Boz, Chilli & Jennifer Hudson]\nEven though I—\nOn my way, on my way, on my way down\nOn my way, on my way, on my way down\nYou were the one that was tryna keep me way down\nBut like the sun, know you know I find my way back round\n\n[Post-Chorus: J. Cole T-Boz & Chilli]\nWe got the crooked smile, we can style on 'em\nBack round, crooked smile, we can style on 'em\nYou were the one that was tryna keep me way down\nBut like the sun, know you know I find my way back round\n\n[Verse 3: J. Cole]\nWe don't look nothin' like the people on the screen\nYou know, the movie stars, picture perfect beauty queens\nBut we got dreams and we got the right to chase ‘em\nLook at the nation\nThat’s a crooked smile braces couldn’t even straighten\nSeem like half the race is either on probation or in jail\nWonder why we inhale, ‘cause we in Hell already\nI ask: If my skin pale, would I then sell like Eminem or Adele?\nBut one more time for the 'Ville\nAnd fuck all of that beef shit, nigga, let’s make a mil\nHey officer man, we don’t want nobody gettin' killed\nJust open up that cell, let my brother outta jail\nI got money for the bail now, and well now\nIf you askin' will I tell now—ayy, hell nah\nI ain’t snitchin' 'cause, man, they get them niggas stitches now\nIf you was around then you wouldn’t need a witness now\nHow you like this crooked smile?\n\n[Chorus: T-Boz, Chilli & Jennifer Hudson (J. Cole)]\nEven though I—\nOn my way, on my way, on my way down\nOn my way, on my way, on my way down (That crooked smile)\nYou were the one that was tryna keep me way down\nBut like the sun, know you know I find my way back round\n\n[Post-Chorus: J. Cole T-Boz & Chilli]\nWe got the crooked smile, we can style on 'em\nBack round, crooked smile, we can style on 'em\nYou were the one that was tryna keep me way down\nBut like the sun, know you know I find my way back round\n\n[Ad-Libs: Choir]\n\n[Outro: Choir]\nLa la la, la la la, la-la—la—la\nLa la la, la la la, la-la—la—la\nLa la la, la la la, la-la—la—la\nLa la la, la la la, la-la—la—la\nOn my way, on my way, on my way down\nOn my way, on my way, on my way down\nYou were the one that was tryna keep me way down\nBut like the sun, know you know I find my way back round\nBack round\nYou were the one that was tryna keep me way down\nBut like the sun, know you know I find my way back round\nBack round\nYou were the one that was tryna keep me way down\nBut like the sun, know you know I find my way back round\nRound\n\n[Music Video]"}], "artist": "J. Cole"}