{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/cb610cd6deeaa359ad987bf8f9dcb669.1000x1000x1.jpg", "title": "My Life (dirty)", "year": null, "album": null, "lyrics": "[G-Wise * vocoder box effect]\nYeahhh, yeh yeh - G. Rap that's gangsta (my life nigga)\n\n[Chorus: G-Wise * vocoder]\nAll of my life, I live\nI'll be thuggin with youuuuuuu\nThug it out baby, thug it out baby\nDon't stop 'til I die for this\nI'll be keepin it trueeeeeee\nYeah yeah yeah yeah\n\n[Kool G. Rap]\nYo, yo\nGiancanna the name break it down simple and plain\nWent from a small chimp in the game to gorilla king pimpin the game\nKnow how to tempt dames to tense in the Range\nHit the block to pitch rocks, the strength of the name\nLimp with a cane, lactosin limp for the king\nWe even pack toast expend from the flames, my aim\nStrictly about makin that bread pop (y'know) blocks red hot\nFrom feds and cops, lookin for rock bottles with red tops\nTradin lead shots with dreadlocks\nInfrared dots 'til their head drop, we fled spots\nWord on the curb is when it came to birds we spread flocks (no doubt)\nNo tellin when the bloodshed stop, glide 'til the sled stop\nCopped the latest every hot flavor in them crocs and gators\nSomebody clique riff, pop the bravest\nOut of town trips in whips I got from Avis, drop knots in Vegas\nMy plot for paper was crockpots of wafers\n\n[Chorus]\n[Kool G. Rap]\nNigga into warm mansion rooms, wall to wall with handsome goons\nHalf-naked bitches dancin to tunes (uh-huh)\nMarble floor to the terrace nigga, glance at the moon\nPlay the jacuzzi 'til your hands get blue\nRugs tight, bright as the white sands of Cancun [yeahhhh]\nSkylights up in the ceilings for the plants to bloom\nNigga we crop grams in dunes, Cuban cigar brand of grandest fumes\nPrison niggas that ran balloons\nShut down shop from Jan. to June, and still cop land in the boons\nFuck women in tanning rooms\nEvery last fingernail on their hand groomed, self built do\nDown to the mink pelts, gator belts and silk suit\nIf I can't stack a nigga cap get peeled loose\nWord to them cats that died on the street, it's spilled juice\nSo where that Don be? (right here) In the calm breeze in the palm trees\nBomb G under the armpiece\nLivin in harmony, coke farm pharmacy\nBulletproof armory, school of the hard knock honory\nWashin the jackpot like laundry\nFuckin Don of the year nominee, honestly\n\n[Chorus] - repeat 2X\n[G-Wise * vocoder box in background to fade]\n\n[Kool G. Rap]\nG. Rap nigga..\nWhat, thug shit, Queens clicks\nWhat.. uh-huh\nYeah, thug shit, Queens clicks\nThug shit, Queens clicks\nUhh.. yeah"}]}