{"songs": [{"lyrics": "[Intro: MC Ren]\nThe year is 1991, N.W.A back on the streets yo\nTaking out all you commercialized suckers\nAnd we're on this laid back track\nAnd we're doin' this one kinda smooth\nSo whatcha gonna do, Dre? - Kick it!\n\n[Verse 1: Dr. Dre]\nAnd so on, let the beat flow on\nBecause I need something to go off on\nThe one and only D-R-E servin' a death wish\nSo I'mma hit you like this\nEarly in the morning, hop into the B-en-z\nI got 44 ways of getting paid\nSitting in my lap as I roll off the Compton blocks\nTo scoop up Ren, I heard shots\n1-2-3, then I seen Ren\nHopping the fence and with the .45 inside his hand\nHe ran to the Benz, got in and said\n\"Dre, I was speaking to your girl O'Shea\"\nAnd as we roll on, I seen the patroller creep\nSo we got ghost before they peeped\nMe and Ren in a black CE, yo\nBumping some funky tracks by the D.O.C\nI gotta get paid, paid in a hurry, see\nI got a habit if I'm not paid thoroughly\nI start takin', makin' sure the money is steady coming\nBecause I'm always into something\n\n[Interlude: Admiral Dancehall]\n\n[Verse 2: MC Ren]\nI heard a dope beat, somebody told me to go through it\nBut if Dre didn't do it I can't flow to it\nN.W.A is like a mix of hard time and hard rhymes\nIn the same lines\nYou're taking a chance when you think that\nTalking under your breath won't lead to young death\nTaking a life, ain’t nothing but a killing\nFor a brother labeled as being a young black villain\nBut you don't know me, a record can't tell ya\nHow so many prayed that I be just another failure\nReal G's ain't about faking but taking\nI hooked up with N.W.A and started making\nFunky hyped lyrics for your system\nMight sound nice so it makes you wanna listen to a\nSample of a ruthless organization\nBut you don't want a confrontation\nReal G's don't play\nYella, Eazy, me and my homeboy Dre\nYo, always making sure that my beats is steady bumping\nBecause I'm always into something\n\n[Interlude: Admiral Dancehall]\n\n[Verse 3: Dr. Dre]\nYo, because I'm in it for life\nAnd in the beginning I was stacking\nNow everyone wanna jack-in\nWatching a softy, punk strong as coffee\nA brother like that best to back up off me\nYo, cause these are the days and the times of the real G\nYou cross me, you getting tossed see\nAnd that's on the real, cause I'm know to get ill\nAgain and again, so tell them what's up Ren\n\n[Verse 4: MC Ren]\nIf I'm not into nothing, I don't feel right\nSo I get my boys and we roll yo, and start some wrecking at night\nBecause I can never conceive myself from sittin' in a cell\nWhere the crime was too tragic I couldn't make bail\nSo now they gotta hold me\nAnd listen to rehabilitation over and over, sayin' they told me\nBut I don't really care, cause I know my music is bumping\nNow Ren is always into something", "album": null, "year": null, "title": "Alwayz Into Somethin’ [Edited]", "image": "https://images.genius.com/627acab300f5f3fd378a3b1adf4a69f8.630x630x1.jpg"}], "artist": "N.W.A"}