{"songs": [{"image": "https://images.genius.com/7aed567539aad2911147be7b27058b75.1000x1000x1.jpg", "title": "Buddhaveli (NahImaStay)", "album": null, "year": "2017-02-23", "lyrics": "[Intro]\nYaaa yaaa\nY'all bitches lucky I pushed my album back\n\n[Hook]\nYo yo\n\nLittle Buddha baby belly big from the cake\nThey ask me if I go hard I'm like nah imma stay\nTry to mind my business, drink my water, stay aligned\nBut these crazy motherfuckers out they motherfuckin' mind (god damn!)\nWhere my spray?\nFuck nigga! Fuck nigga! Get away! (Imma spray) x3\nFuck nigga! Fuck nigga! Get away!\n\n[Verse 1]\nNah imma let it rock\nHe think you pussy though\nHe think you ain't the type to turn up on a pussy hoe (girlllllll!)\nNah pussy come, pussy go\nImma let a pussy know\nCop another pound and keep it poppin' like a pussy show\nThink I ain't with the shake just because I meditate\nFuckin' with the feng shui bitch I make it levitate\nI did the Art of Chill but y'all make it hard to chill\nNow I got the Creature beastin' on 'em nigga guard your grill\n\n[Hook]\n\n[Verse 2]\nYo pockets fatter than a Buddha belly\nGot big bazookas call me Buddhaveli\nCome in peace but imma need a piece if you disturb the peace it's like a scene in Belly\nInhalation, exhalation\nHit my chakras with the activation\nTwist it up like I was Oliver 'cause all these vultures do is give me agita (uh)\nBeef is a broke bitch sport\nI don't even play that sort (mhm)\nLookin' like New New, but I do the voodoo\nI am the guru, the plug and the port\nUsed to hit a nigga with the C-4 (uh)\nKnow a nigga sell shells by the seashore (uh)\nDeeper than a detour on the sea floor\nLike fuck you think I smoke a lot of weed for? (uh)\nBackwoods, I want backwoods\nImma spaz the pack, I trash woods (ah!)\nBlazing like I knew the track would\nNow these backtrackers wanna act good like\nAye, what nigga, fuck nigga want my brain?\nImma spray, light the incense 'fore I go insane\nNever speaking what I don't believe in\nGot a hitta with me and she been a vegan (ooh)\nBlackarican, wanna freak and eat and gotta doobie reeking now it's Creature season bitch!\n\n[Hook]\nYo yo\nLittle Buddha baby belly big from the cake\nThey ask me if I go hard I'm like nah imma stay\nTry to mind my business, drink my water, stay aligned\nBut these crazy motherfuckers out they motherfuckin' mind (god damn!)\nWhere my spray?\nFuck nigga! Fuck nigga! Get away! (Imma spray) x3\nFuck nigga! Fuck nigga! Get away!"}], "artist": "Nitty Scott"}