{"songs": [{"year": null, "album": "Kashin Out (The Clean Hits)", "image": "https://images.rapgenius.com/ec6957b33ab9953822b71186d91183e0.400x400x1.jpg", "title": "Old Freak", "lyrics": "[Verse 1: Kash Doll]\nYou can talk about my whip game\nYou can talk about my wrist game, talk about my shit game\nNigga talk about his dick game\nBut he couldn't hang -- lil' nigga talk about your limp game\nKash Doll I got new flows\nI'm a pretty girl I be signing titties when I do shows\nSilly bitches don't phase me\nHit my old nigga now she thinking that he played me -- haaa\n\n[Hook]\n[yeah bitch you got my old freak\nYeah bitch you got my old freak\nBitch you got my old freak] x4\n\n[Verse 2: Kash Doll]\nI do this for my strippers and I do this for my family\nUp in KOD I didn't do a fucking Grand Prix\nMoney on my mind I don't think y'all understand me\nJealous ass bitches they don't want me win no Grammy\nEverybody talking but nobody gon' deliver\nThe only rap bitch rapping better than these niggas\nI den made a couple Ben's and my name got bigger\nNow these bitches think they me\n'cause they fucked my old nigga\n\n[Hook]\n[yeah bitch you got my old freak\nYeah bitch you got my old freak\nBitch you got my old freak] x4\n\n[Verse 3: Icewear Vezzo]\nLook, big chain with the gold piece\nStill selling cane like the old me\nI'll let a hoe go like a [?]\nQuick to turn a nigga main to my old freak\nThese hoes want to hold me\nBitch out of control, they control freaks\nJust tell them that I'm on try to expose me\nFuck a bitch out in Cali for a OG\nHit it good 'till her knees knock\nBeat the pussy up, that's a beat box\nYeah you heard about me I got the streets locked\nI'll get this bitch jumping like the seat hot\nBuy cars heard y'all putting cash down\nTwo chains on dancing like Kash Doll\nNigga Icewear broke? yeah how that sound?\nHit the Louis store and pour a nigga trash out\n\n[Hook]\n[yeah bitch you got my old freak\nYeah bitch you got my old freak\nBitch you got my old freak] x4\n\n[Bridge]\nYo, yo did you bitches really think y'all could fuck with me?\nAye would you tell these bitches they can't fuck with me\nWhat, you think cause you fucked some bitch you me\nBitch you ain't me, you ain't lived my life bitch\nI never seen you in the airport bitch\nI never seen you at the car lot bitch\nI never seen you in the jewelry store bitch\nYall bitches wear Burberry for holidays\nBitch, Mucho wear that shit everyday\nFuck with me, Kash Doll\nLet's get it\n\n[Hook]\n[yeah bitch you got my old freak\nYeah bitch you got my old freak\nBitch you got my old freak] x4"}], "artist": "Kash Doll"}