{"artist": "Amir Obè", "songs": [{"title": "No Peace", "album": "Def Jam Presents: Direct Deposit Vol. 1", "year": "2016-09-09", "image": "https://images.genius.com/97fb44edfd05f64d721881203b997f63.1000x600x1.jpg", "lyrics": "[Hook]\nWhere your love now?\nPour my heart out to the floors now\nTreatin' love like a drug, I been drugged out\nTreat your feelings like a target, bring them guns out\nKept on shooting just to prove that you ain't numb now\n\n[Verse 1]\nPut a ring on a middle finger, fuck you\nHope it stings just a little when it cuts through\nKept it distant from them women that be tellin' now\nAll them stories you ain't told, you can tell 'em now\nI don't get enough credit\n'Less we scamming understand we get enough credit\nI make it work either way 'till the peace stop\nI'm seeing all my enemies throw the peace sign, no peace\n\n[Bridge]\nLet them bodies hit the floor now\nLet them bodies hit the floor now, now, now, now, now\nLet them bodies hit the floor now\n\n[Hook]\nWhere your love now?\nPour my heart out to the floors now\nTreatin' love like a drug, I been drugged out\nTreat your feelings like a target, bring them guns out\nKept on shooting just to prove that you ain't numb now\nWhere your love now?\nPour my heart out to the floors now\nTreatin' love like a drug, I been drugged out\nTreat your feelings like a target, bring them guns out\nKept on shooting just to prove that you ain't numb...\n\n[Verse 2]\nWhere your love now?\nIn the bottom of this bottle, I go drunk now\nIf I'm sober, then it's over, say it's done now\nWon't play it smarter, I'm a martyr I go dumb now\nI'm still open i'm just hoping you ain't shut down\nI can see your soul when I'm looking in your eye\nTryna feel alive but you're killin' all the vibe, yeah\nFound a treasure, girl you mix the truth with the lies, yeah\nI done told you, but you never even threw a sign, yeah\n\n[Bridge]\nLet the bodies hit the floor now\nLet the bodies hit the floor now, now, now, now, now\nLet the bodies hit the floor now, now, now, now, now"}]}