{"artist": "Anderson .Paak", "songs": [{"title": "Bubblin (Remix)", "album": null, "year": "2018-07-13", "image": "https://images.genius.com/ef33e578d43586a51b6e3ad2ad1bb8e3.1000x1000x1.jpg", "lyrics": "[Intro: Anderson .Paak]\nLook at you go, okay, you bubblin'\nLook, go, go, look at you go\nOkay, you bubblin', look\n\n[Verse 1: Anderson .Paak]\nYeah, one in the hand, one in the bag, bubblin'\nLook at the cash, look at the cash comin' in\nCome get your mans, this lil' nigga buggin' me\nJust leave the bag, quit all that jaw-jackery\nDon't even pass me that, I don't want none of it (yeah)\nThese niggas mad about it, had enough of it\nWoah, watch what you sayin', all that poppin' and shakin'\nGot me hot as a laser, my posse deep and irate\nAnd we act a fool for the paper, had a dream and I made it\nEl Camino on Dayton's, Vintage Guess over Bape\nPut the bread on me, bitch, bitch, you bet I'ma bank it\nPiggy flat in a blanket, I might just roll out today\nI might just roll out to Vegas, head back to my old ways\nCop a room full of Asian hoes and do blow all day\nLook at me, baby, look at me, baby\nDon't I look like a million? I'm 'bout to clean out the safe\nD-don't I look like somebody that just be bodyin' everything?\nAll that talkin' is great, but I don't be talkin', I air it out\nAll the problems have gotten easy to bury\nI'd rather drown them in Hendrick's, I'd rather kiss on my Mary\nI been broker way longer than I been rich, so until it levels out\nI'ma take your mama to the Marriott and wear it out\nTook me so long to get it, gonna spread it out\nLet 'em know all about me when I'm dead and gone\n\n[Chorus: Anderson .Paak]\nOne in the hand, one in the bag, bubblin' (look at you go)\nOne in the hand, one in the bag, bubblin' (look at you go)\nLook at the cash, look at the cash bubblin' (okay, you bubblin')\nLook at the cash (look)\nBubblin' (go)\nOne in the hand (look), one in the hand (go)\nOne in the hand, one in the bag, bubblin' (look at you go)\nLook at the cash, look at the cash bubblin' (okay, you bubblin')\nLook at the cash (look)\nBubblin'\n\n[Break]\nYo, Anderson .Paak, Busta Rhymes!\n\n[Verse 2: Busta Rhymes]\nEvery time I come I hit a nigga in the middle\nHit a nigga high, hit a nigga low (Aye!)\nAnd as I fuck it up a little more\nKill 'em and I get 'em\nAnd they whine when they hit the floor (Yeah!)\nAnd while I'm guzzlin' a little bit of yack 'cause the spot bubblin' my nigga, where the dough? (Where it at?!)\nNow put the motherfucking money in the bag\nHurry up my nigga right now, gotta go\nSo much truth in the nigga head\nLike the water gonna pop\nBoilin' and bubblin' and its takin' everything I got\nI got a boy and he strugglin' no matter how they wanna pop\nBoy we be husslin' and try to make a nigga stop\nWe huntin' and then moshin' and then messin' and then we beat him in the head\n'Til we got him tumblin' and shufflin' and mumblin' and tusslin'\nAnd have a hard time recoverin'\nBack for more than truce (ay ay ay)\nOne's in the air, everybody better put 'em up\nEverybody better get to the back\nStack money, nigga get it up\nKnow what I mean\nEvery time we pull up niggas wilin' on the scene\nStep back, look jack, fuck around and make a nigga\nBlack back till you sound like a fiend\nAny time that I come and I get up in the buildin'\nNiggas already know there's gonna be a killin'\nAnd I give you more, hit 'em with the raw\nUncut pure raw coke, that'll keep a nigga shiverin'\nSee me I don't give a damn\nWhen I smoke this gurkah\nBitches they be fightin' and be bickerin'\nNiggas know to give it up\nAnd nothing to question, better believe we be deliverin'\n(let's go!)\n\n[Interlude: Sample]\n\"Get over here and empty your pockets.\"\n\"I don't do that.\"\n\"You're my prisoner—you do what I tell you to do—get over here.\"\n\"Haha, he's gonna get nasty about it!\"\n\"Fuckin' bitch!\"\n\"Frank! Cool it, huh?\"\n\"Stay the fuck outta this!\"\n\n[Chorus: Anderson .Paak]\nOne in the hand, one in the bag, bubblin' (look at you go)\nOne in the hand, one in the bag, bubblin' (look at you go)\nLook at the cash, look at the cash bubblin' (okay, you bubblin')\nLook at the cash (look)\nBubblin' (go)\nOne in the hand (look), one in the hand (go)\nOne in the hand, one in the bag, bubblin' (look at you go)\nLook at the cash, look at the cash, bubblin' (okay, you bubblin')\nLook at the cash (look)\nBubblin'"}]}