{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "[Verse]\nI'm coming down the chimney like I'm Santa with an AK47\nIf you're naughty then I'm taking all your presents\nIt's December the 25th and if you're building in the way you should\nI'm giving a couple gifts to all the children in your neighborhood\nUnless you know somebody that's a rotten fucker\nThen you better just believe that I'ma show at Christmas Eve\nAnd then I'm gonna give their mom a muffler\nAs a stocking stuffer\nDamn it, kid, I'm standing with an AK47 in the middle of the city\nWhere the criminals are gritty and they're tough!\nGotta entreprise a little bit and own a company\nCuz slaving for the man and making pennies ain't enough\nIt's Christmas but fuck your wish list cuz you're already gifted!\nSo give yourself independence and start your own business!\nGotta hustle with a vengeance here is some motivation\nYou may need and it's too damn true\nLil Wayne is only 5'5 mothafucka\nIf he can be successful then you can too!\nYou know I'm high up on the trees like an angel\nI be rippin' to the rhythm of the sleigh bells\nI don't care about a person saying they're a Rap God\nCuz when you're underground you gotta face hell\nJust what I enjoy little drummer boy\nBarum ba bum bum man, it is such a joy\nWhen I'm going dumb da dumb I shoot a missile and destroy\nFinding the work and finding a purpose like a kid that's unemployed\nI'm drunk Santa Clause I just drank a fifth\nGetting crazier than Jaden Smith\nSo you can tell The Grinch I put some mistletoe above my ass\nAnd now he knows where to place his lips\nCheck it out, I'm vaping marijuana cuz it centers me\nIs giving me the energy to rip the beat up vividly\nAnd even when I'm 63 and when the air is so polluted\nThat it makes you sick to breathe I'll prolly be a sick MC\nThe sickest in the history of anything I went to war with 50 kings\nAnd ate the planet Saturn in a single bite and sniffed the rings\nYou gotta take some shrooms and try to smoke dimethyltryptamine\nTo see a vision this incredible the devil in your dreams\nI'm bigger than the universe, I'm infinite like human thirst\nFor water and like water from the glaciers I consume the Earth\nThey call me Lethal Clause and I'm the fastest in the world\nI got your grandpa some golf clubs, your grandma some pearls\nBaby now you know I got the rhymin' stamina\nKill you while you shittin' like you Tywin Lannister\nI don't wanne have to go and damage your entire face\nPeace I'm out back up the fire place!", "year": "2014-12-03", "album": "YouTube", "title": "Santa Raps SO Fast!!!"}], "artist": "Mac Lethal"}