{"songs": [{"image": "https://images.genius.com/72218595c0bb6861d2cc11041abd4c7d.1000x1000x1.jpg", "title": "MURDER RATE", "album": "GOODNIGHT LOVELL", "year": "2019-02-22", "lyrics": "[Intro]\nGinseng\n\n[Chorus]\nOT shit, OT shit\nOT shit, OT shit\nOT shit, OT shit (Okay, okay, okay, okay)\nOT shit, OT shit (Okay, okay, okay, okay, yeah, ayy)\n\n[Verse]\nWant my bread, I got plenty so they want me dead\nI'm the best, all these niggas tryna break my neck (My neck)\nAs I said, you might find your bitch inside my bed ('Side my bed, bitch)\nI won't rest 'til these niggas fill my brain with lead (Lead, yeah)\nAs I prance, I like showing all my diamonds dance\nPeep my stance, all you pussies tryna catch a glance (Catch a glance, bitch)\nShe said, \"What you sipping on? I want some in my glass\" (In my glass, bitch)\nSorry, baby, I can't share this if you got no ass (Got no ass, bitch)\nIt's cool, if you hate me, bitch (Hate me, bitch)\nGot you crying like a motherfucking baby, bitch (Like a baby, bitch)\nHow the fuck you thought you was gon' be my lady, bitch? (My lady, bitch)\nIf you talking 'bout you tryna have a baby, bitch (Have a baby, bitch)\nI ain't a fool, you can't play me, bitch\nWant my digits, you gon' have to fucking pay me, bitch (Pay me, bitch)\nNow she tryna tell me that she want a fucking pic\nOnly take a pic if shawty down to suck some dick\nMost you niggas acting like you kinda scared of me (I ain't pussy)\nGot you shaking 'cause you never got ahead of me (Ahead of me)\nAll the shit ain't really what it all appear to be (All appeared)\nStop the talking, pussy, all you niggas mini me's\nYour baby texting me like, \"Can you book a telly please?\"\nI don't hesitate to give you all these luxuries (All these luxuries)\nGot these niggas talking and these bitches on they knees (On they knees, bitch)\nWant you motherfuckers off my dick, pretty please, yeah I say\n\n[Interlude]\nYo, say word, it's you, fam\nYo, I've been looking for you everywhere\nTell me how it's a been a crazy couple years since you dropped the album or whatever\nBut, yo, it's time for you to regain your throne, mans are acting soft and silly out here fam\n\n[Chorus]\nOT shit, OT shit\nOT shit, OT shit\nOT shit, OT shit\nOT shit, OT shit"}], "artist": "Night Lovell"}