{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "CJ’s", "album": "The Chalice", "lyrics": "Billy woods ft. Priviledge - “CJ’s”\n[Emcee(s): billy woods]\n[Producer(s): Dan Datiles]\n[Scratches: Dan Datiles]\n[Hook: Priviledge]\n\n[Verse 1: billy woods]\n99 bottles of malt liquor with 99-cent stickers\nCould have 99 Newports, niggas’ll still bicker\n15 ain’t bitter, 40-ounces taught us\nTo drink quicker.  In dungeons with dragons, magical\nElixer by the sixer, but don’t let it\nGet warm—you’ve been forewarned.  Youngins in the stockroom\nAin’t calm, some is armed, chasing MGD\nWith Boone’s Farm, sitting on milkcrates torn\nEnterprising pipeheads swarm, seven watches\nOn their arm cause speakers, broken glass\nIn the tweeters, chilling coat-space heaters\nSin eat his wifebeater, creatures sweating out liters\nRing of fire, suppliers, alleyway frequent flyers\nRock monsters, real survivors, hustlers\nIs born liars, winos, and thieves with problems\nUp their sleeves.  In Heineken we believe, clean\nGreen like optimal leaves.  Jealousy and greed\nWhat I want ain’t what I need\n\n[Hook: Priviledge]\nAyyo\nWe’re sipping, we’re drinking, we’re falling tipsy in the drunken\nSearching for the point where enough’s enough.  For what’s\nIt’s worth, who gives a fuck?  Just tip your cup\nAnd check me in the back of CJ’s, lighting a blunt\nWe’re sipping, we’re drinking, we’re falling tipsy in the drunken\nSearching for the point where enough’s enough.  For what’s\nIt’s worth, who gives a fuck?  Just tip your cup and\nCheck me in the back of CJ’s, lighting it up\n\n[Verse 2: billy woods]\nLiving raw, cracking jaws.  Kirk said, “Keep it out\nThe store,” so it’s Big League Chew cracking the jaw\nLife in a claw, pints in the park.  Sometimes\nYou eat the bar, sometimes the bar eats you\nDrunken words is often true like, “Don’t trust no one\nIn the crew.”  Didn’t believe ‘til I seen on the news\nHe got blown out his shoes in front CJ’s\nSix shots over loose talk and a five-dollar rock\nThis ain’t for the pity ‘cause it wasn’t that bad really\nGirls wasn’t that pretty but let a kid suck their titties\nPour ‘til we’re shitty, puff ‘til the Philly little\nBitty, hit it again, seeds pop out the shit\nSo smack they feel when I burn my lip\n22’s was a sip.  No need to throw up, we’ve\nBeen sick"}], "artist": "​billy woods"}