{"songs": [{"lyrics": "[Intro: Action Bronson]\nYeah! Bam Bam\nLive from Jamaica\nUh, yeah\n\n[Verse 1: Action Bronson]\nI'm feelin' like the Phantom of the Opera\nHangin' from the ladder of the chopper\nI might splatter if I drop\nThey say I look Spanish in the drop\n700 horses go \"VROOM\" then I vanish off the block\nNow I'm in the store playin' lotto in a wife beater\nOne sock on, chancletas\nScreamin', \"You better give me my cheddar before I break shit\"\nMan let me stop, it's only good vibrations\nHow could I be mad at this view?\nStrange patterns in the skies, snakes that fly\nThe mothafuckin' stakes are high\nLook the other way when jakes roll by\nFor my birthday, put a hundred thousand in the cake, oh my\nI think I might flip into the ocean\nPress the pedal of the M3, yellow\nSoundin' like explosions, baby girl, don't play with my emotions\nDon't baby, don't baby\n\n[Hook: Jah Tiger]\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nTime you ah waste\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nWell done again\n\n[Verse 2: Jah Tiger]\nMi as a ras mi haffi deh pon dem case\nKnow the tribulation, we all over your face\nDat's why mi nuh mingle inna no rat race\nAs a ras, mi carry a permanent smile upon mi face\n\n[Hook: Jah Tiger]\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nTime you ah waste\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nLook Yah!\n\n[Verse 3: Jah Tiger]\nMeet you a while ago and you have one face\nMeet you dis hour with a different face\nDat fi show say that you have two face\nYour have a clean face and a dirty face\n\n[Hook: Jah Tiger]\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nTime you ah waste\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nWell done again\n\n[Verse 4: Jah Tiger]\nGwan like you ah work offa Satan face\nLike you ah work offa Lucifer face\nLike you ah work offa the devil, him face\nSatan couldn't lend I man none o' him face\n\n[Hook: Jah Tiger]\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nTime you ah waste\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nWatch this!\n\n[Verse 5: Jah Tiger]\nEnglishland people from all different race\nThe people scatter all over the place\nYou can hear it from the keyboard, the drum and the bass\nAs a ras, mi nuh do my tings inna haste\n\n[Hook: Jah Tiger]\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nTime you ah waste\nI'm Mr. 2 Face\nTime you ah waste\nI'm mistress 2 Face\nWell done\n\n[Verse 6: Meyhem Lauren]\nWhite rum and Ting, Magnum and tonic\nJamaica to Jamaica, goddamn, it's so ironic\nShots of JB at the 'dega party\nUh, can't walk, I can stagger hardly\nRasta tanktop, lookin' like it's '92\nMr. 2 Face, rasclot, we gon' find you\nI'm livin' off the land like the Ital man\nHow to stay alive? That's a vital plan\nBlack sand beach, Boston Bay snapper\nCurry on the lobster, jerk is comin' after\nTake a shot of Jager, bone slide with a slide\nEverything irie, there ain't no fuckin' up my vibe\nJune plum juice drippin' down my chest\nOpen off a bad girl, damn I'm such a mess\nFlex with the top down, I'm doin' the pepper seed\nAsk the dread who got the better weed\n\n[Bridge: Action Bronson & Meyhem Lauren]\nFreak dancin' in the basement, grindin' in the hallway\nThat's right, we do it all day\nFreak dancin' in the basement, grindin' in the hallway\nThat's right, we do it all day\n\n[Outro]\nGive me your love\nGive me your love", "title": "Mr. 2 Face", "album": null, "image": "https://images.rapgenius.com/7cef0e5f7eaaff799304a81e3f53e4ea.500x500x1.jpg", "year": "2016-04-12"}], "artist": "Action Bronson"}