{"artist": "Canibus", "songs": [{"title": "Air Strike (Pop Killer)", "album": "Melatonin Magik", "year": "2010-02-09", "image": "https://images.rapgenius.com/414dbca28b7db90ed21ad7982b743558.170x170x1.jpg", "lyrics": "[Intro]\n\"Alright, we're about to blast the hell out of here\"\n\"Rear (?), what's your position? Got 3-6 down, one two... (?)\"\n\"Okay\"\n\"Here comes\"\n\"Holy!\"\n\"But uh, like, honestly, I don't let them have it yet, you know. His little... Whatever, like, barely peeped my radar, you know. So hopefully, he'll do something better, like, get my attention or whatever\"\nWar Lab, call us haters all you want\n\n[Verse 1: Kuniva]\nFuck it, call me a hater, full blown instigator\nLeavin niggas on intubators breathin like Darth Vader\nI hate people that pack guns but they don't bust 'em\nOr bitches that come back to my room but they ain't fuckin\nPistol clutching, the Dozen, you heard it don't get is misconstrued\nWhatever we do'll hit the news once we get the tools\n\n[Interlude]\nIf you’re an MC and you mention my name in the wrong way, you draw first blood, I’m gonna come at you\"\n\n[Verse 2: Canibus]\nYou pushed D12 to the side to sign Voltron 5\nIf Proof was alive, he'd be dyin' inside\nYou ain't no hip-hop messiah, you a bitch 'cause you dissed Mariah\nShit like that supposed to be private\nI'ma fry you on behalf on Mariah and Michael\nPut you back on them drugs, make you suicidal\nYou can't shut the record down, nigga it's viral\nWhen you use the word \"nigga,\" just remember your idols\n\n[Verse 3: DZK]\nI got a question, I'm white, can I join D12?\nI'll sell you four million records then I'll tell you go to hell\nLeave Swifty in charge, then remove all the stars\nAnd make the group wish Bizarre shot pool in a bar\nAn assault lawyer stop the beat, suing us all\nI really do hope you know who get involved\nCause I'm a fan and I'll get you for a Nick Cannon dissin'\nAnd you already know how fuckin' sick Canibus is\n\n[Verse 4: Swifty]\nI hate a bitch-ass nigga just as much as I hate fags\nI love goin' to war but I hate when they raise the flag\nThese niggas hittin' the streets spittin' venom on me\nThen start renegin' the beef, I hate peace treaties\nForever yo' enemy I increase beef as Amityville's finest\nCause I don't believe in stoppin' violence\nI'm a tyrant that'll snatch my respect and scram\nI use a Uzi cause I hate a Tec when it jams\nI hate when dudes treat this like life a movie\nUsin' rap as his excuse to do shit and they only move keys in the booth\nI piss on niggas hands, whoever's grown, patches and tombstones\nI hate 'em ass when I break into a home\nI'm barefaced, I clap your cat, ransack it\nThat's what I'm wearin' black and I hate goin' out the back\nSo call me a hater, walkin' detonator, I ain't afraid\nTo stick this blade into your fade in front of spectators\n\n[Interlude]\nYou're an emcee, big small it doesn't matter\nNo matter how big I get, I just want people to know\n\n[Verse 5: Canibus]\nYou the devil in a red dress on MTV\nYou signed more black people than a basketball team\nWhat you trying to say subconsciously? You can't rock the beat like me\nConsciously, you know I rock you to sleep\nSlim Shady you a coward 'cause you scared to rap with me\nThe only black man you respect is 50\nAnd the greatest rapper of all time was dead right and dead wrong\nYou shouldn't have even been on that song\n\n[Verse 6: DZK]\nHe fell off so hard this faggot broke his accent\nI'm flippin through the channels seein Bruno get his ass sniffed\nAnd I'm disgusted man, what the fuck is wrong with you?\nWhy'd you date Mariah? Mariah's not a fuckin' dude\nYou never even saw her nude and you busted, too\nMust have been thinkin 'bout your stepdad touchin' you\nBut that ain't nothin new, I asked your ugly crew\nThey verified it, so bitch quit lyin'\n\n[Verse 7: Canibus]\nI remember the first time we met, I ain't even liked you\nWalkin' around my video set like you was in high school\nIt must excite you seeing black people being tribal\nThat's why Dr. Dre signed you\nI bet you right now you got a big rotten Rosenberg beside you\nTrying to be just like your father, inside you\nYour Stan android fanboys need to kill that noise\nI know what you thinking, \"kill that boy\"\n\n[Verse 8: DZK]\nWe leavin' Elvis funny money makin' pelvis shattered\nLet's see you square dance now, let's see you hold your bladder\nLet's see you fire back Em where's the fire at it?\nSuicide hotline time, go dial that\nPut on that \"8 Mile\" hat and write a vile track\nGet at some people that can actually diss you back\nNo more target practice on retarded actors\nAnd pop stars, Marshall you're not hard\n\n[Interlude]\n\"Whatever happens to me in this game, I've always got my ear to the street\"\n\"Whatever happens to me in this game, I've always got my ear to the street\"\n\"Whatever happens to me in this game, I've always got my ear to the street\"\n\n[Verse 9: Canibus]\nRenegade Schemenegade, you pink like lemonade\nI've been better than you before Genesis was made\nYou ain't better than Black Thought, you ain't better than Mos Def\nYou ain't better than Canibus, Professor Griff, Hotep\nSo Renegade Schemenegade, you pink like lemonade\nI penetrate through Halley's Comet with metal blades\nYeah! You and I both know why I'm saying this\nI hope Whoo Kid get fired for playing this\n\n[Verse 10: Bizarre]\nGet off, Nikolai Volkoff, mazel tov\nReady to show off, fo'-fo'll blow your do' off\nBlowin off steam, goin off the beam\nLet the nine sing, bitch this ain't a dream\nBitch I'm the king, color me bad\nSkinny jeans, what happened to the sag? You makin' me mad\nY'all a bunch of JJ Fags, now who the fuck is bad?\nMotherfucker I'm bad!\nCall me a hater\n\n[Outro]\n\"I'm kinda doing this deliberately 'cause I wanted a reaction from him\"\n\"Oh you want us to get him on, you two can go at it\"\n\"Well, that would probably take up the whole hour and we don't have a lot of time so you can do that\"\n(Laughs)\n\"Stink niggas and they go tattle\nIt tastes like when Eminem and Canibus had a battle\"\n\"But you can't invade me, though\""}]}