{"songs": [{"year": "2009-10-06", "title": "That’s Not What’s Up", "image": "https://images.genius.com/ba2ca8f14b0677073955b40f4f7a416f.1000x1000x1.jpg", "lyrics": "Talk:\nDamn man, what you doing out here this late man? Pss, Get your ass in the house, take your ass in, Go head..\n\n(G. Martin Soul- Chorus)\nYour out here slinging them drugs, I heard you hanging with thugs, (HANGING WITH THUGS) living dangerous\nGirl that's not what's up\nGoing to strip in the club, if your momma can see you with us, she'll be furious\nGirl that's not what's up\n\n(Verse 1 Saigon)\nYou gone live by the gun, you gone die by one\nI would hate to here you got hit in a drive by son\nI dreamed being some shit that you got hit in the head and you might not make it out the hospital bead. (Is he dead?)\nThe street life is going catch up quick\nYou hot dog you need to get on some ketchup shit\nLike you moving fast just without a target or direction, but it's either the grave or the department of corrections, I know that it's hard in the recession, and poverty's depressing, but never should a God forget his lessons\nA man is not a man if he vanish and leave his family famished, that's not a man that's a damn ignoramus\nAnd I thought you was smarter than that, but if you wanna be a part of the pack, then pardon my back\nI'm outta here like Vladimir, why these baby cubs don't wanna listen to poppa bear. (come here)\n\n(Chorus)\n\n(Verse 2 Saigon)\nI see you sliding down the pole\nAt the same time I see the tears slide down your soul\nYou used to be on the honor role, your momma named you Tawanna yo\nSo why they call you Ms. Geronimo?\nMatter fact I don't wanna know, gotta fuck with you, it do don't it on the low\nGotta hurt you to be a woman who sells her self cheap\nDon't even love herself enough to develop self worth\nI peep pimps with hoes, and so all of their hoes, most of those is putting snow up their nose that's just how it goes\nYou in this bitch with no clothes, I know you since you was oh so innocent\nNow your'e not interested\nIn nothing unless it's something that got dollars and cents with it\nTryna make some since of it, it's simple but it's intricate\nDon't you wanna be a grand mamma one day? you need to be in church this Sunday\n\n(Chorus)\n\nTalk with male voice singing in background:\nWord, it's not what's up, that gang banging shit, it's not what's up man, we raising young gang bangers, we gotta teach these little brothers the right way yar'll, we gotta a responsibility (that's right) to our children yar'll (that's right)\nTeaching our young, our young ladies to be strippers. (Na man)\nYou know we make'n it rain on our little sisters,(no more of that) on our nieces, (we don't want know more of that) on our babies yar'll.  Lets get it together yar'll\n(Chorus)\n\nAn Interview-talk\nInterviewer Q: Wow, you know Saigon I really, really like this one, (Saigon: Thank You, thank you) from \"Pain In My Life\" you've always come out with something with a message, (Saigon: I try) I mean what inspires you?\nSaigon: You know just life man just feeling a responsibility to our younger the younger generation man, as an artist I feel like we need to do more of that, because they look up to us, you know these kids looking up to us, and what we put out there, they take it man, they run with it, you know\nInterviewer Q: You said they make it rain on our young girls?\nSaigon: Yeah, it's crazy right\nInterviewer response: Yeah that's not what's up\nAnd now like, I'm a father man, speaking of speaking of making it rain, I just had a little girl named rain, her name is Rayne Dior", "album": "Warning Shots 2"}], "artist": "Saigon"}