{"songs": [{"title": "Classic Male Pregame", "album": "Professional Rapper", "year": "2015-04-15", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro: Lil Dicky]\nWhat's up, y'all?\nIt's your boy LD\nA.K.A. The Original Pancake\nI'm going the fuck out tonight\n\n[Verse 1: Lil Dicky]\nOff work, 'bout to get trashed\nMe and my crew all about to get ass\nSam coming through with a bottle of the Cap\nMe and Dean 'bout to tube, Mark taking out the trash\nClean up my room, bitches 'bout to peep that\nPeen getting groomed, bitches 'bout to eat that\nDean shave my neck, thanks, man, I need that\nRead through my text, then I itch my kneecap\nNow I gotta play the game right with Liz\nTop prospect, met the other night through Tinder\nEight o'clock so I think it's only right I hit her\nWith a \"what you got on tap for the night?\", delivered\nWhile I wait Imma pick a shirt\nAin't nobody wearing plaid so I claim it first\nMark got a little sad cause his favorite shirt's plaid but fuck him\nHe knows I back off in a reverse\nNow I'm taking a shot and we drinking and popping a bottle\nAnd thinking of all the bitches we gon' haul in\nSam say I know a house party and it's popping\nBet Imma cop some weird head, Dennis Rodman\nOh, yeah, we plotting\n\n[Chorus: Nekisha-Michelle]\nThis is a pregame\nIt's a pregame\nA classic male pregame\nNot a weekday (o, aaaa)\nSo this is when we take (tam, taaa ram)\nShots and we chasing alternate DJs (tam, taaa ram)\nAnd that we pray cause (this is a pregame)\n\n[Hook 1: Lil Dicky]\nAnd we all get drunk (It's a pregame, a classic male pregame)\nAnd we get dressed up (Not a weekday, so this is when we take)\nAnd we all buy gum (Shots and we chasing alternate DJs)\nAnd we all gon' fuck\n\n[Interlude: Lil Dicky]\nAye, pour me another shot, God damn it\nI'm tryna get to a place where I can talk to these bitches\nI got seven shots in me, three condoms on me and immeasurable hope\n\n[Verse 2: Lil Dicky]\nTen O Clock, words getting slurred\nAnother shot, Sam's tryna hurry\nMark's not, says he isn't worried\nHe ain't tryna spend hella bread at the clurb\nCall him out, \"since when you using clurb, faggot\"\nMark pouts, something like a hurt rabbit\nDean smiles, we been doing work\nPretty turnt, think he blacked out\nLil Dicky burp loud (burp)\nPeep phone, what the fuck, she ain't text back\nPretty close to considering a text back\nSpilling Coke on my shirt that's a red flag\nNow I gotta change, Mark knows put his best plaid on\nWe debating the top ten in the NBA\nDisagreeing alot about Lamarcus A\nShawshank redemption popped on, attention all on. Redemption for ‘em all\nSam was like, \"nah, the party called off\"\nI already got a Lyft, I'm going out to a bar\nThen Mark pulled out a spliff, temptation very hard\nYou know I couldn't resist, we blazing, now the car here\n\n[Chorus: Nekisha-Michelle]\nThis is a pregame\nIt's a pregame\nA classic male pregame (turn up, turn up)\nNot a weekday (o, aaaa)\nSo this is when we take (tam, taaa ram)\nShots and we chasing alternate DJs (tam, taaa ram)\nAnd that we pray cause (This is a pregame)\n\n[Hook 2: Lil Dicky]\nAnd we get fucked up (It's a pregame, a classic male pregame)\nAnd we all feel rushed (Not a weekday, so this is when we take)\nAnd our plans fall through (Shots and we chasing alternate DJs)\nAnd we in bad moods\n\n[Interlude: Lil Dicky]\nMan, what time is it?\n12:24? And the bars close at 2, lights on like 1:30\nLet me just think for like a second\n\n[Verse 3: Lil Dicky]\nSam like, \"we gotta go, cause the car here\"\nMark like, \"I don't know, what's the bar deal?\"\nDean like, \"I'm on a roll in Guitar Hero\"\nDicky looking like he about to choke on his lamb gyro\nSam looking let down, 'bout to go berserk\nMark put his sweats on, now he rolling purp\nDean blacked out, he ain't even on the earth\nI was like, \"Sam, I was with it with my other shirt\"\nSam bounced, he's like, \"fuck it, I'm out\"\nMe and Mark smoke a blunt, Dean stuck on the ground\nText Liz, \"what the fuck?\", even snuck in a frown\nI get the spins high and drunk, I throw up in the shower\nNow I'm jerking off inside a condom (I do that)\nI text my ex say, \"I miss you often\" (she knew that)\nSam back, it's not even one yet, he a dumb mess\nHe about to be a problem\nI ain't even tripping, I'm Tindering\nAll of a sudden I'm blinking, I'm squinting\nIt's saying it's six in the morning\nI'm stinking, I'm still in the same shit from last night\nGot a text from Mark saying:\n\"I ain't mad, but I know you’ll clean the bath, right?\"\n\n[Chorus: Nekisha-Michelle]\nThis is a pregame (m mm m mm mmm)\nIt's a pregame (masturbating in condoms)\nA classic male pregame (can not, can not)\nNot a weekday (o, aaaa)\nSo this is when we take (tam, taaa ram)\nShots and we chasing alternate DJs (have a fab time)\nAnd that we pray cause (This is a pregame)\n\n[Hook 3: Lil Dicky]\nAnd we get too drunk (It's a pregame, a classic male pregame)\nAnd we don't have fun (Not a weekday, so this is when we take)\nThen we eat too much  (Shots and we chasing alternate DJs)\nAnd the next day sucks (And then we praise)\n\n[Outro]\nLike, we really just wake up and spend far too much time shitting... so, the whole process just feels flawed. Thank you for your time"}], "artist": "Lil Dicky"}