{"artist": "Big Ed", "songs": [{"lyrics": "[Big Ed]  (Da Diiiiiiiick)\n\nI'm having a big problem, or should I say difficulty?\nWith my body's faculty\nMy wood ain't acting right, as soon as I got this girl to act right\nSeduced her to give up the ass on the first night\nHer name is Cynthia, hell of a body that will send for ya\nBackstage, D.C, had my niggas go send for her\nShe spotted me and she said\n\"I was just wondering why they call you Big Ed?\"\nNow that's the million dollar question hon'\nLet just say in the sack I'm known to make a run\nForget about it, cause I'll hit you with that pressure\nCan't wait to undress ya, with your fine ass lookin' like Vanessa\n5'11\", light skin, green eyes and convacios\nDefintely lickable in delicate places\nNot tonight though, strickly just to dick down\nGot to the telly, honey laid down, pulled the pannies way down\nAin't got time to waste now, she's tuggin' at my waist now\nDropped my pants, dropped my drawers, and whipped it out\nInserted into her mouth, she wrapped her head around the ear\nShe let me watch my dick disappear, reappear\nI rubbed the cat, finger fucked it, she grabbed my hand and sucked it\nAnd in the other hand nothing but dick\nI got my jim-hand but when I tried to put it on\nMy hard-on was gone\nI told my dick \"Attention salute\"\nBut he didn't, insuborate motherucker\nWhat happened to the rocka rocka motherfucker?\nThen he spoked, spoked me I almost choked\nOn my spit, this is ricdoulous\nI'm looking at my piece like whose dick is this?\n(Who Am I? I'm the nigga that made you\nI'm the reason why all the honies laid you\nI got 'em doing all that freaky shit they do\nReprations overdue)\nNigga hold up, reprations? (Yeah I said it)\nNow what you mean you got me pussy? (Oh I didn't get it?)\n(Only thing you did was brag about me\nTelling 'em how I'm hangin' like Nights of the Boogie\nAll in the your raps, all in your convo\nYou building curosity straight from the get-go\nYou know, and I know, that she wants to know\nAnd she ain't gonna go, until she knows how long I grow)\nNigga I got it from the game I spit\nI enticed the mind way before she saw the dick\nWhat you mean you made me? I'm the that bust the raps\nBust the gats (Yeah but I got the nuts to go do that\nHoes I run through that)\nFool when I walk in the spot they be like who that?\n(Nigga they be lookin' at the bulge in your pants\nThe size of your feet and hands, peepin' out your stance\nMusclar, six pack, don't mean shit\nThey leave your stupid ass if you go impatent\nNigga you ain't shit without me, can't do shit without me\nCause every women loves a big fat stiffy\nThat she can sit on, direct and cream on\nAnd if I don't rise up, best believe she's gone\nAlot of women want their cats licked\nBut it takes a backseat to some bomb dick\nEven money won't do the trick, she'll get tired of the shit\nShe'll start sneaking around hunting for some dick\nThe want from you to lift shit, fix shit\nYou wouldn't be around if you weren't attached to dick\nI'm in control, I'm the brain's extension\nNo matter you postition, just look at Bill Clinton\nDykes hate you but buy me off the shelf)\nMan nigga fuck you (Nawl that's bad for your health\nAnd while we on the topic, this bad hoe you wanna stab\nCan't fuck with her dogg, she got crabs\nAnd they'll get in my afro, oh hell no\nLet's just bust from flacio, cause she'll go)\n*door slams*", "image": "https://images.genius.com/2c9efb860b4d6cf291a19972d492574c.499x499x1.jpg", "year": null, "title": "Who Am I?", "album": "Special Forces"}]}