{"artist": "Prince Paul", "songs": [{"album": "Psychoanalysis (What Is It?)", "title": "J.O.B. (Das What Dey Is!)", "image": "https://images.genius.com/2e62c87c2fc12d70ea466dbe46b314e0.599x599x1.jpg", "lyrics": "Bimos: Yo what's up man?\nScully B: Yo w'shup, man?\nBimos: Yo, you gotta let 'em know where that Scully B is!\nScully B: I 'unno, man, but you know they be all just BITIN', MAN!!\n\nScully B:\nJ.O.B., tryin' to make green\nPeoples always ask me what the hell does that mean?\nJ is for the jerks around the way\nWho be standin' on the corner almost every single day\nO is for the others who can't understand\nHow gettin' a job can improve a man\nB's for the bitch that lets you knock it\nBut only if you got that cash in your pocket\nShe lets you rock her 'till the break o' dawn\nAnd then skip town when the cash is gone\n\nBimos: Aw yeah, Scully B got head!\nScully B: Yeah, you know what I'm sayin' man, DAS what dey is!\n\nScully B:\nStep into this jam, damn, lookin' nice\nJealous sucka punks thinkin' what a life\nWell, since this is life and nothing comes free\nIt's all about makin' that cash money\nGrabbin' on my clothes, girls screamin' my name\nWell I guess that's just the price of fame\nThis bum asked for change, (Yo, can I get some change, man?) lookin' kinda rugged\nIt's not that I fronted, but I only carry 100's\nBump into this girl I ain't seen for a while\nThe girl flips out and starts actin' wild\nNow things like that I won't allow\nCause girls like that cold cramp my style\n\nBimos: Yo, she played you like that? Daaaamn! Yo, I woulda kicked her in the neck!\nScully B: Oh. Is that what you did?\n\nJason X:\nDrivin' in my Z down the avenue\nGangsta lean to the side and a 40 of brew\nHit my breaks (screeeech!), who could it be?\nSome nice round thighs and a big boo-ty\nI said \"Baby, baby, I know what you like -\nTurn that butt around and I'll ride you like a bike.\"\nShe said \"Yeah, man, I know what you mean ... \"\nThen she pulled down those designer jeans\nCause I'm the type of brother that just don't play\nI waxed that butt from March till May\nAnd just in case I get an overdose\nI pass it on to my man Bimos\n\nScully B:\nStopped at the light on Atlantic Avenue\nAw, damn! Here comes that Squeegee crew!\nBrothers on the car like rats on cheese\nGet off my car, niggas, won't you please?\nStopped at the station to get me some gas\nAnd here comes a girl with a great big ass\nThe closer she got, the more I knew\nI had to take her to the crib and do the dew\nRan in the store to get me some brew\nA 3-pack of condoms and a Charleston Chew\nBack to the crib, didn't play no games\nHad the fly girl screamin' my name (SCULLY!!)\nFinally realized the girl was a whore\nPut my foot in her ass, she asked me for some more\n\nBimos: Oh, is DAT what she is?\nScully B: (giggling)", "year": "1996-06-25"}]}