{"artist": "R.A. The Rugged Man", "songs": [{"album": "C*nt Renaissance (Remix) / Every Record Label Sux Dikk Part 2 / C*nt Renaissance", "year": null, "lyrics": "[Intro]\nYo yo, they asked me where the fuck I've been for this time\nI've been poor out of my fucking ass\nEating fucking shit fucking ugly bitches\nEverybody knows that pretty bitches ain't down the fuck nobody warming shit\nBut that shit don't even matter\nIt's all about you faggot ass motherfucking rapid sticking out don't drive and Lexus is and shit like yet and\nEvery record label sucks dick\nBut yo, yo, but, but, but you'll be sucking on your record label dick\nWord up, just a little something for\nMotherfuckers [?] fall off the Earth\nYou know what I'm sayin'?\n[?] in the morning losing my fucking mind about the murder people\nYo yo yo yo, check it out, yo yo yo yo\n\n[Verse 1]\nSay snakes in this rap feel fuck the fat do ya\nFeel how they're choking on the smoke from the gas fuel\nThe Rugged Man record label suicide\nMove aside (Man, calm down)\nWho the fuck you think you are?\nI smack that bitch who works the front desk at strictly\nBe there for high school credit but sucks picks of all the rap stars\nWill be behind bars, 'cuz Mr. Elliot our beds\n'Bout to get fucked in his asshole and brother I'm not even gay\nShame, shame, shame\nThe president of the company don't care if I'm tenerife I'm bleeding\nI'm succeeded they took my mind state into evil\n'Cuz I want everyone dead on this fucking Earth\nIt really hurts 'cuz you're here is it doesn't work\nI got nothing left to live for expect I get in the programs\nVision bitches hate my fucking guts, those sluts\nLove me more than Patrick Swayze when I had my steady income\nI need a spot that I can sit for\nSuicide never but I got plots are taking out to other people\nAnd I ain't doing jail time that shit is wet\nAin't no coming back once I lose control my sins finishes\nJust don't get in this, you record label people\nWe're gonna die and no family gonna die two motherfuckers\n\n[Hook]\n\"You ain't gotta tell me no more\"\n\n[Outro]\nNo, that's distant verse one\nYou can't but this shit is shit is not for sale\nThat's for the real rap advance, but see real nowadays is just a fucking give me anyway\nI'm keeping it real, I'm staying real all the bullshit, yeah\nY'all how the fuck is you supposed to be really you can't rap for real I can't float for real\nYou got your hip hop styles on and you read them fucking rap magazines I listen to them rap music stations and all the sudden you know what the fuck rap is right\nGet the fuck out of my face with that bullshit you faggot motherfuckers\nR.A. The Rugged Man\n[?] man tracks", "title": "Every Record Label Sux Dikk Pt. 2", "image": "https://images.genius.com/c22a50b3d1660a9b067467ab9031a78f.600x603x1.jpg"}]}