{"songs": [{"year": "2013-07-16", "album": "Stranger Than Fiction ", "image": "https://images.genius.com/0043c66183bb24d57ffa8209ac57183e.500x500x1.jpg", "title": "Die Bout It", "lyrics": "[Verse 1]\nTil' the paddywagon pull up and cuff us\nMy pants saggin', I'm double cup\nSouthside, hustle inside, hustle outside, I don't give a fuck\nI might beam ya up, you won't get it up\nYou wanna shoot dice, we could do somethin'\nIn the club with like 30 bands, going hard til' like 2 somethin'\nGo live on em, hit vibes on em\nNiggas lie bout it, I'm fly on em\nMy lil' niggas, on my corner, they rap too, they trap too\nPull up broad day, you know the raw way\nWith the rod play, bap-ap you\nLil' Mocha said and Dearcy, Beeto and Brian just called me\nUptown Beezy, lil' Jeremy nook in my brother sprite no talkin'\nBring yappas out, pass by your house, December feelin' like August\nPullin' up on murder street, my uncles clutchin' revolvers\nHear anything about ?'s green, you play with that, I'm gon' off ya\n20 years in, rap hustlin', got in the game I'm hawkin'\nAudemars, I'm ballin', bitch you love, I'm doggin'\nLast old lady, took my feelings like Soulja Slim, no fallin'\nShe thinking she special, paid her, told her get to stepping, retawdid'!\n\n[Chorus]\nI ain't got shit to do but cook like I was from Virginia\nThese niggas lyin' in they rhymes, you could stop pretending\nMy pants saggin' in this bitch, don't give a fuck who feel me\nAnd if you disrespect me nigga, you gon' have to kill me\nBitch, I'mma die bout it\nNigga, I'mma die bout it\nI'm from where niggas get it on\nWe don't cry bout it\nYou say a nigga disrespect you, nigga ride bout it\nI know some pussy niggas scared, probably hide bout it\n\n[Verse 2:]\nFaggot throwing water at the event at my show\nCatch him on the rebound I wanna see if could catch what I throw\nLook 20, bands, 30, bands, 40, bands, 50, bands\nGet 'em captured, get 'em splattered\nAll in traffic, bout that action\nYea it's, up there, up there, up there\nDid a show don't give a, fuck there\nWe'll come up there\nNiggas from where I come up at\nTaught to up that\nShoot to kill, don't discuss that\nDone that, fuck that, fuck that, fuck that\nBreath easy, this street sweeper go \"Hree-hree!\"\nAnd delete people\nTaking pictures all in front my car, is like dick-puller, I mean meat-beater\nI met your mom, you had a good life\nI fuck with your dawg, I don't fuck with you\nAs soon as that nigga went to jail you start doin' shit that a busta do\nYou don't know how to keep it street, reason why?\nYou not a street nigga\nMy uncle, mama, grandmother, thuggin'\nGrew up in the street, real street nigga\nNot a local rapper in your own city, boy you look disgusting\nYou lil' ugly, black, dirty, dusty, dingy\nPockets empty, mouth look like a place a toothbrush never entered\nYoung Get 'Em!\n\n[Chorus]\nI ain't got shit to do but cook like I was from Virginia\nThese niggas lyin' in they rhymes, you could stop pretending\nMy pants saggin' in this bitch, don't give a fuck who feel me\nAnd if you disrespect me nigga, you gon' have to kill me\nBitch, I'mma die bout it\nNigga, I'mma die bout it\nI'm from where niggas get it on\nWe don't cry bout it\nYou say a nigga disrespect you, nigga ride bout it\nI know some pussy niggas scared, probably hide bout it\n\n[Outro]\nMe and Stroke by myself, you know we in a black coupe thang, you heard me?\nMe and Stroke down there thuggin' by ourself\nYou know we just, yeah all in that bitch, retawdid\nYou know, nigga ain't tell us nothin', you heard me?\nYou know every time I see that lil' bitch, he dont't move by himself\nHe got a whole lil' entourage and shit you heard me?\nThat's a sign of weakness\nYou know a real 'vic will sit back, and look a nigga just like weakness\nI ain't takin' no diss shots at no nigga man, I'm just statin' them facts you heard me\nNigga ain't kept it street, I spoke about it, nigga caught feelings like a bitch would do, you heard me?\nSo, I just know that when you do a bitch, you just yeah\nLook, go do what you want to, you's a renegade ho\nThe worst thing you can give any nigga or bitch is rejection\nYou know hoes love attention\nYou ain't got to have a pussy to be a ho\nA ho is somebody that just want attention from another man\nThey got a lot of hoes with dicks, outchea\nRight now, you know me keep that thang all the way street\nYou know I be listening at these niggas talk\nMane you ain't gangsta, you ain't gutta, you ain't grimy, you ain't shinin', you ain't grindin'\nLook I'mma leave that there what it is\nLook, B.W.A\nKevin Gates For President\nAll the way retawdid'!"}], "artist": "Kevin Gates"}