{"songs": [{"year": "2005-12-22", "image": "https://images.genius.com/8c7e84792eef2e8440ef7c7adad0852a.1000x1000x1.jpg", "title": "Bossrapper", "album": "Zuhältertape X-Mas Edition", "lyrics": "[Intro: Mr. Chissmann]\nOk, hör zu, yeah\n\n[Part 1: Mr. Chissmann]\nIch steh auf Hoes wie Cameron Diaz\nUnd nicht auf Teenie-Groupies im Eminem-T-Shirt\nEs ist der Boss wie auf Nintendo bei FIFA\nGuck ich leg meinen ML Geländejeep tiefer\nDu wärst gern Pac und bist jetzt sehr frustiert\nDenn das einzig schwarze sind die Air-Force Sneakers\nKomm ins Game, werf ein Airball, Biatch\nUnd hau dann wieder ab in dei'm meerblauen Fiat (Jap)\nIch bin kein Businessman\nChiss ist Business, man\nUnd ich hab den Magic Stick grad am Start\nEr verzaubert deine Bitch, so wie Sharuk Khan\nHör zu, es ist dreckig wie Englands Volk\nUnd trotzdem seh ich nur Hoes, die mich kennenlern' wollen\nIhr rappt den ganzen Tag, ganz schön hart\nIch rapp' einmal im Monat und es langt für'n Jahr\n\n[Part 2: Kollegah]\nEy, yo Chissmann, geb die Skimaske her\nIch bring Street-Atmosphere, wie D-Block Konzerte\nKid, du siehst mich im rotfarbenem Sakko\nAll abendlich auf Partys mit dem Hochadel Monaccos\nUnd ich fick deine Slut im Stripclub, mit noch einer Bitch am Sack\nGeb ihr den Dick in die Pussy, bis sie nicht mehr kann\nUnd mach weiter bis Mitternacht\nDer Boss, bin ich nicht grad Geld am zählen\nRaub ich Shell-Tankstellen im Pelzmantel aus\n\n[Part 3: Mr. Chissmann]\nEs ist der Bossrapper, Gottrapper\nDeine Bitch gibt mir 'en Cockjacker\nUnd komm rapp ein paar Lines, versuch es\nIch geb ein scheiß auf dein Tape, wie auf meine Groupies\nGib mir Cash für den Mercedes im Hof\nDenn ich hab diesen Rap nie gelebt so wie Torch\nUnd laber mich nicht voll, dein Tape ist der Hammer\nDu verkaufst schon nichts wegen dei'm scheiß Face auf dem Cover\n\n[Part 4: Kollegah]\nUnd ihr sagt, dass ich Frauenverachtend bin? - Warum?\nNur weil der Arbeitsplatz von meinen Frauen Daunenmatratzen sind?\nVorzeigesluts stehn am Bordstein um acht\nKommt eine erst um eins nach acht, bekommt sie Ohrfeigen ab\nIch werd durch Rap Milliardär, Rapmilliardär\nUnd wenns nicht klappen sollte werd ich wieder Crackdealer - yeah\nDu Stricher, ein Blick auf dein Persobild langt\nUnd ich merk, dass du anscheinend aus Tschernobyl stammst\nEy, ich schick dir Gee's, die blasen dir dein Lebenslicht aus\nLassen deine Mutter blasen und leben sich aus\nDeine Karatetechnik richtet nichts gegen mich aus\nIch press dein Kopf auf den Asphalt und dein Leben ist aus\nWo ich wohne siehst du Showtänzer strippen\nKokshändler ticken, Großhändler Business\nNutte, wenn ich an der Hotelbar sitze\nBenehme ich mich wie ich will, weil ich das Hotel besitze"}], "artist": "Kollegah"}