{"songs": [{"year": null, "title": "Swig Of The Stew", "image": "https://images.genius.com/32dac835a69d095e96fcbbc2afb2d6e6.1000x1000x1.jpg", "lyrics": "Artist: Saafir\nAlbum: Boxcar Session\nSong: Swig Of The Stew\n\n[Intro}\nYeah man\nIts this motherfuckin Swig of the Stew for the nigga in you\nMothafucka, can you get wit this crew?\nTry to test this motherfucker turn ya fuckin bangers blue\nSomebody pass me this beer, ima listen to Saafir\nOn this motherfuckin next time...\nWho got this motherfuckin next rhyme?\nIts my partner over in this motherfucker\n\n[Verse 1]\nAnother massive dose I'm sendin' in\nHittin' when I step to the deck\nSidebets kick 'em in then raise up then jet\nFrom the ivory it's time for me to see if I can\nGraze the cut... just a hit\nI'm shuttin' down ya pistons\nYou'll have to listen cause I'm...\nClippin' off the wack bracket shit that's soft so\nGo back to the troft and put it back next to the Smirnoff bottle\nWhere u found it from it sounds\nNumb has no feel\nAn organic synthesis did I mention this in the last verse?\nNo. I drive a fast hearse\nThey'll have to catch the flow I'm...\nSnatchin' a row of burnt corpses and...\nHopin' they learnt the forces that they're up against\nIs immense in this shit\nWith a fist to this grill is still a fraction\nOf common sense\nYou would want Providence to play a part but it's obvious\nYou have no heart\nI'm pro-truding a pro-tracker\nThe proportion of a slacker is where I store the shit so\nGive me ya cup\nWhat's ya flavor?\nIt's juice taste it\nA swig of the stew\n\n[Chorus]\nThe funky nomadic attic dweller (3x)\n\n[Verse 2]\nNow that I have a deepdish spoon\nNiggas be attackin' get blackened eyes like racoons\nBlew up like balloons busted\nThey're getting rusted, thrusted with them screw drivers\nWho's the livest? Me!\nAnd I love it when the\nSlug rubs another from a rusty life they uhh\nCouldn't cut it so I cut 'em with my trusty knife\nSkinned alive and when deprived of one's life\nOne thinks twice. Three time a lady\nLionel couldn't pay me for you to fade me\nCause I be learnin' shit\nMakin' tourniquets from broken English\nI'm yokin' the seamstress cause\nI'm sewin' up shit\nYou know I can rip, I rest with the Hobo's\nYo yo's stays up\nNo Mayonnaise on the cut\nBut I can bust it wit the mustard\nMy spice is hot\nThe radish adds this seasoning that creates and make\nTaste buds wanna make.. dubs of a\nSwig of the stew\n\n[Chorus (x5)]\n\n[Verse 3]\nBox Car 23 is my freight train\nI'm not strippin' for the cock except the diesel\nThe weight gain\nI make pain and I take it cause I'm humble\nA dirty rat, A sturdy gat is the back up for the smack up easy\nFor me to pack the knack up\nBraggadocio rhymes I'm braggin' while I'm laggin'\nSaggin' cause my jeans hafta be lean for the cuisine\nSo... Who dat!\nDick Dasturdly could never master me\nDrew raps... constantly after me comes me, stop\nSuction cupping you got nothing coming\nBut cum of bum...\nHon, I'm doin' it for my niggas in the\nOh ak land where I plan my escape\nFrom traits of empty crates and\nBusted grapes are not part of the gourmet\nHey just an appetizer\nFilet mignon but the song is the stew", "album": "Boxcar Sessions"}], "artist": "Saafir"}