{"artist": "Benzino", "songs": [{"lyrics": "[Intro: Benzino]\nOh shit\nPut ya middle fingers up on this one\nOh this is the one right here yo\nOH we finna get real crunk up in this motherfucka man\nLil Jon & The East Side Boyz from ATL stand the fuck up (Oh yeah!)\nLet's go y'all, g-g-g fuck that, fuck security yo\nCompton, NY, Connecticut\nAre we goin' to boast on this one? (No!)\n\n[Verse 1: Benzino]\nY'all niggas can't deal with the fact that 'zino getting busy in the booth\nI'm gangsta murmur it'll get you done\nRecognize my niggas, where you gonna run?\nSave  yourself from judgement day\nNever should've fuck with Ray\nLive to die another day\nThese cats ain't seems what it seen\nMotherfuckers don't know what a nigga really been through\nEver since my pops did time, I live in the studio rippin' rhymes\nNow he out, hit 'em off, he good\nHe moving with his son, just like he should\nNow rethinking of my niggas who be from the hood\nDon't tell me what I can't to\nLost getting ran through\nFuck around kid and I'll Glock your mental\nStay fuckin' wit' ya man Benzino\nHardy on the side by the Rick Gambino\nBurners on the side, that's how we be though\nTaking another hit of that Sour Diesel\nStash keep a nigga ride, high all nine\nClap clap nigga run where you at?\nBust through the sunroof\nNiggas ain't gun proof\nFuckin' you awake cause some niggas better run too\nY'all niggas better run too, huh\nEverybody wanna talk war\nBut when it really come down to a niggas want peace\nReal niggas don't want war on the radio\nReal niggas don't fight on the radio\nCock back them thangs, sit your little silly ass down, you want no drama\nWe lick them thangs, north from Stuy niggas didn't really want no problems\n\n[Hook: Lil Jon]\nOkay!\nBitch niggas we touch rough, we buck 'em up\nAnd lay it down, twist the nigga, your times is up\nWe gangsters, killers, thugs, pimps with plenty of hoes\nAnd when you lose bitch, that's how it goes\nBitch niggas we touch rough, we buck 'em up\nAnd lay it down, twist the nigga, your times is up\nWe gangsters, killers, thugs, pimps with plenty of hoes\nAnd when you lose bitch, that's how it goes\n\n[Verse 2: Young Hardy]\nI give you no time to run\nRun up on you point blank then I fire the gun\nLittle homie don't think, when it gotta get it done\nI put work on the corner, broad day in the sun\nToo many gunshots, kids can't play where I'm from\nAll you hear squalay, all day when the cops come\nBut I'm steady there smashing the fiends\nYoung Hardy burned blocks like gasoline\nNiggas don't play with my quota\nCement feet then I drop 'em in the water\nGet handgagged 'til your breath run out\nSixteen shots, you lucky that I left one out\nA lot of niggas named they best, but they left one out\nAnd they gon' mention my name from here on out\nThis young boy spit heroin now, I won't stop\n'Til a shotgun punk, start tearin' you out, G\n\n[Hook: Lil Jon]\nOkay!\nBitch niggas we touch rough, we buck 'em up\nAnd lay it down, twist the nigga, your times is up\nWe gangsters, killers, thugs, pimps with plenty of hoes\nAnd when you lose bitch, that's how it goes\nBitch niggas we touch rough, we buck 'em up\nAnd lay it down, twist the nigga, your times is up\nWe gangsters, killers, thugs, pimps with plenty of hoes\nAnd when you lose bitch, that's how it goes", "image": "https://images.genius.com/945c7322d9672c48d11afc32d5031058.500x500x1.jpg", "year": "2005-02-22", "title": "Dat’s How It Goes", "album": "Arch Nemesis"}]}