{"artist": "Willie D", "songs": [{"year": null, "lyrics": "[Intro: Excerpts from Ice Cube, Chuck D + more scratched below]\nCompetition and money, Fuck You!\nBitches and money, hold it now (Money)\nCompetition and money (Bitches)\nCompetition and money\nA material, a material\nCompetition and money (Bitches)\nI need some money, man\nCompetition and money, Fuck You!\nBitches and money, hold it now (Money)\nCompetition and money\nCompetition and money (And money) (Bitches)\nCompetition and money\nCompetition and money (And money) (Bitches)\nA material, a material\nCompetition and money\nCompetition and money (And money) (Bitches)\nCompetition and money\nCompetition and money (And money) (Bitches)\nAiy, this is some questions of motherfucking money\nCompetition and money (Bitches and money)\nYou owe me\n\n[Hook: James Brown from 'Ain't It Funky Now']\nFellows, we got to let the girls know what they gotta do for us\nThis one got to be a drag man, a man can do nothing no more\nHahaha hahaha\n\n[Verse One: Willie D]\nHey bitch, hey whore, hey tramp, hey slut\nTell me what the fuck is up?\nEveryday you bitch, bitch bitch bitch\nWant that, want this, like the motherfucker's rich\nAlways looking from something from Willie D\nBut what the fuck have your broke-ass giving me?\nNothing but complex and drama\nI got enough of that shit when I was living with my mama\nWe got a crib so we're living together\nWe're two grown folks, things all will be better\nStill we have is the same old mood\nWant me to pay the rent, want me to cook the damn food\nBitch, you got me fucked up\nI ain't Baby's Face, I like to fuck up the place\nWhat I look like doing the chores?\nWhat you think I got your dumb-ass for?\nIt damn sure ain't your bust slut\nCause I can jack-off and get a motherfucking nut\nPussy ain't nothing but meat on a bone\nNiggas fuck it, dykes suck it, and faggots leave it alone\nSo get on whore, you ain't nothing but a trouble maker\nHere's your motherfucking welcome paper\nAnd if dollar money is what you're thinking\nYou fuck around, and come up stinking\nAnd that goes for the rest of you whores\nWillie D'll tell you if you ain't been told\nLoudly shit, just like this\nYour pussy, ain't no more important than my dick\n\n[Chorus]\nMy pussy - my dick, my pussy - my dick\nMy pussy - my dick, my pussy - my dick\nMy pussy - my dick, my pussy - my dick\n\n[Verse Two: Willie D]\nHey bitch, hey whore, hey tramp, hey slut\nWhy you think that you're so damn much?\nYour face looks good, and your ass is a working butt\nBut your motherfucking nose's going off\nI saw you when I saw you're looking fly\nDidn't say Hi! - I passed your ass right on by\nSince I didn't make the first move\nYou told all your fucking buddies that I had a fucky attitude\nWhores just like the satisfaction\nOf turning niggas down, so I start asking;\nDo you have a man? - do you wanna dance?\nI glued my ass to a judge in standing lance\nCause I know what you whores about\nYou're looking for the man with the car, and the big home\nSo he can support, you and your baby\nBoils money on dumb-dumb shit and go crazy\nBut you can't get Willie D\nI'm looking for somebody who can help not hurt me\nYou like your naughty way without a doubt\nAlways got your motherfucking hands out\nMy birthday was not long ago\nAnd all I got from your dog-ass, is I didn't know\nNow yours here, and you're telling me this whore\n(Where's my birthday's gift?) it's at the goddamn store\nSo suck a nigga's dick, or make a nigga rich\nAnd treat me like you wanna be treated bitch\nYou get's no more thing to come with\nCause your pussy, ain't no more important than my dick\n\n[Chorus]\n\n[Verse Three: Willie D]\nHey bitch, hey whore, hey tramp, hey slut\nDon't duck, you know you like to suck and fuck\nBut some suckers don't know this\nSo you take them to hoop with the girl next door shit\nPlaying that motherfucking innocent role\nKnown all the time you like lick the booty hole\nI won't beg your ass, it ain't my nature\nPlay them games with me bitch and I'll rape you\nBut then again, I ain't going like that dear\nCause I can get pussy anywhere\nA lot of girls wanna be with Dee\nOnce more dumb-whore, they're all be paying me\nI state your fate, because you got a pussy\nAnd when you go out that's an automatic drink\nI'm tired of this ladies night shit\nWhen it's the butts, that's making these motherfucking clowns rich\nBuying your breath as much again, it's too much\nYo bitch, I'll go dutch\nSo why you're trying to be malicious?\nI pay my half and leave your ass washing dishes\nAnd that goes for the rest of you whores\nWillie D'll tell you if you ain't been told\nLoudly shit, just like this\nYour pussy, ain't no more important than my dick\n\n[Chorus]\n\n[Hook: James Brown from 'Ain't It Funky Now']\nFellows, we got to let the girls know what they gotta do for us\nFellows, fellows, we got to let the girls know what they gotta do for us\n\n[Chorus]\n[Outro]\nMy dick! - my dick!\nMy dick! - my dick!\nMY DICK!!", "image": "https://images.genius.com/99c31136e48907dfc450b10677d10058.400x397x1.jpg", "album": "I’m Goin’ Out Lika Soldier", "title": "Yo P My D"}]}