{"songs": [{"year": "2015-12-01", "title": "Help Me", "image": "https://images.genius.com/24e1bfe9bcc0239864c20610fe6cb49b.1000x1000x1.jpg", "lyrics": "[Chorus]\nHelp me, can you help me?\nI got fifty bags of gas, can you help me?\nI just cooked another brick, can you help me?\nHelp me, can you help me?\nI pulled up in a Fisker then I pulled off in a Tesla\nThought this shit was sweet, I left his ass on a stretcher\nI don't catch feelings, I'm too busy catching death tolls\n\n[Verse 1]\nPull up in the trenches, pull up in the trenches!\nI said that shit on woe, dog\nI got the juice like O-Dog\nI got 'caine like I'm Kane\nMe and Lotto in that fucking Fisker switching lanes\nPull up on a pussy nigga and fuck on his main\nI just spent a fifty-thousand dollars on a chain\nI just spent a twenty on a motherfucking ring\nYoung Savage bitch, I got this shit off cocaine\nSkrt, skrt, skrt\nPull up on your bitch and give her that skrr\nPull up on your bitch and drop that work\nYeah, and I'm still getting paid\nBitches getting slaughtered, man these bitches getting slayed\nKeep that Glock 40, dare a nigga to touch my chain\nI shoot this motherfucker like my name Max Payne\n\n[Chorus]\nHelp me, can you help me?\nI got fifty bags of gas, can you help me?\nI just cooked another brick, can you help me?\nHelp me, can you help me?\nI pulled up in a Fisker then I pulled off in a Tesla\nThought this shit was sweet, I left his ass on a stretcher\nI don't catch feelings, I'm too busy catching death tolls\n\n[Verse 2]\nI'm a dog like Michael Vick\nI used to sell them Michael Vicks\nI can't even lie, I ain't never sold a brick\nBut I got some partners who done really sold them bricks\nYoung Savage bitch and I done really hit them licks\nI really put that pistol on these pussy nigga's shit\nRun up on a nigga, better take a nigga shit\nIf your diamond's hitting you could take a nigga bitch\nI hit four hundred and went a bought a 'vette\nYour diamonds so cloudy, who the fuck sold you that shit?\nYou know damn well don't no Rolex fucking tick\nGet your motherfucking money up nigga, try again nigga, 21\nOil based dope, I gotta try again\nDope got wet, it gotta dry again\nPussy ass rappers telling lies again\nPussy ass, bitch ass fuck boy\n\n[Chorus]\nHelp me, can you help me?\nI got fifty bags of gas, can you help me?\nI just cooked another brick, can you help me?\nHelp me, can you help me?\nI pulled up in a Fisker then I pulled off in a Tesla\nThought this shit was sweet, I left his ass on a stretcher\nI don't catch feelings, I'm too busy catching death tolls", "album": "Slaughter King"}], "artist": "21 Savage"}