{"artist": "Inspectah Deck", "songs": [{"title": "Luv Letter", "lyrics": "[Intro: Inspectah Deck]\nAy, what's up baby?\nI need you to sit down for a minute, relax your feet\nI'll keep an eye on the dinner\nSomething I've been wanting to say for a minute\nSo just listen\n\n[Verse 1: Inspectah Deck]\nI'm just sitting here, pouring my heart, even though\nUsually, about now, I be touring with the Gods\nPlay your status like I'm MJ, scoring with the broads\nMy love for you is deep, a little more than what's it's called\nSo how am I at fault, we both got issues\nI miss you on the road, but at home I fight with you\nAt times I might be tight with you, take my life before I hit you\nSituation difficult to get through\nYou was just concerned with all the bitches in my face\nI was just concerned with all the riches in my face\nGrown man, so these bitches know they place\nI know it's no love 'cause yo they fucking different niggas every day\nCouldn't wait to hit the crib and see your face\nIf only for one night, the sunlight's gleamin' in our face\nNo love without pain, I still love you the same\nBut still share the same love for the game, and so\n\n[Hook x2: Ms. Whitney]\nBaby, I just got your love letter\nI'm trying to do better, 'cause now I know better\nI'm gonna hold you down, I'm gon' stay strong\nYou gave me your word, so I ain't gonna do you wrong\n\n[Verse 2: Inspectah Deck]\nThere be days when you call him on stage, text messaging\nAll in a rage, you think I'm fooling around\nBut the truth is, I'm moving around, L.A\nYesterday to the Bay, next stop Chi-Town\nRarely get a chance to lie down, snatching paper with the fly sound\nAll the hoes, you are not down\nWhen the going got rough, you ain't jump up and leave\nBut if you did, wouldn't be so tough to believe\n'Cause I know I put you through it, woman like you\nYou just trooped it, girlfriends calling you foolish\nHang on in there girl, 'cause when I\"m finished\nWe gonna live it to the limit, I'ma give you the world\nJust saying that it's you on my mind, I wish I was there\nBut I gotta stay true to my grind\nCoast to coast line, strolling the curve\nKiss the kids for me, baby, I be home on the third\n\n[Hook x2: Ms. Whitney]\nBaby, I just got your love letter\nI'm trying to do better, 'cause now I know better\nI'm gonna hold you down, I'm gon' stay strong\nYou gave me your word, so I ain't gonna do you wrong\n\n[Verse 3: Fes Taylor]\nYou told me stay off the block\nBut still held me down when a nigga got locked, yeah\nYou brought me clean drawers and socks\nOn the dance floor tried to sneak in some top\nIt's like my pen be the heart, ink be the blood\nI know your mama pissed that you fell for a thug\nI can't wait to give you kisses and hugs just to be right near you\nWishing I was, missing your love\nSo close, but it's so much distance between us\nSo I call collect, long distance, hoping you pick up\nYeah, I know the Gods try to holla\nBut I'm that nigga, still touch the world getting dollars\nJust ride with me, mama, release date soon\nSaid I'd probably touch the streets around the middle of June\nCan't wait to get you undressed, P.S. sincerely yours\nAlways, mama, love, Fes, yeah\n\n[Outro: Ms. Whitney]\nBaby", "image": "https://images.genius.com/82c9b14e7d1772e390a21fe67e28ad6e.800x800x1.jpg", "album": "Manifesto", "year": "2010-03-23"}]}