{"artist": "Peewee Longway", "songs": [{"album": "The Blue M&M Vol 2 King Size", "title": "Jugg 4 Me", "image": "https://images.genius.com/d13b6c12bea37a9c4ed83616d4c890a6.500x500x1.jpg", "lyrics": "Chorus:\nI've got a hundred bag play, are you down to jugg for me? (Baby!)\nIt's understood, on my rack, I'm with you under your honor\nPut your feelings to the side, I'm the nigga you want\nI got a hundred bag jugg, are you down to do it for me baby?(Jugg! Jugg! Jugg!)\nI got a hundred bag play, are down to jugg for me baby!?(Jugg! Jugg! Jugg!  Jugg for me baby!)\nI just want to  know if you gon' jugg baby. (I just want to know, I just want to know.)\nI just want to know if your gon' do it for me baby (I just want to know if your gon jugg for me baby!)\n\nVerse 1:\nI got a hundred bag jugg,  you down to snatch it?(for me!?)(Bags!)\nPull up serve a nigga with the ratchet.(With the Gas!)\nDressing in medusa super classy\nYou put it on the line, I'm down to match it\nStanding in front of the judge hatchet\nTo leave it in his or her casket\nI just want to show you that I'm down for you baby!\nPut your feelings inside a bag of blue hundreds\nWe on that trap or die shit, baby doin numbers\nTrapping in the trenches, baby cook it like my mama\nHibachi chicken, we serving places, Benihanna.(Crack)\nBlue Benjamin's in your buscemi purse is full of hundreds\n\nBridge/Pre-Chorus:\nBaby you deserve this\nHundred bag jugg make you nervous\nCome down to it no swerving\nFuck twelve cause I swear you allergic!\n(Longway Bitch!)\n\nChorus:\n\nVerse 2:\nCrocodile skin, hundred thousand dollar luggage\nI'm a load her down with ten  tell her bring me back a 30\nFerragamo buckle on my waist the 40 hold a 30\nThe Fed a risk, baby Fuck em if they're try to give you 30\nIma stay down with you, I ain't the type of nigga, do you dirty\nWe can put it in blood, I'm talking fucking 730\nGotta show you the lean, I'm sipping on muddy\nShow you shit you never seen,taking flights out the country(drug money)\nAllergic to broke niggas, they pockets like bugs bunny\nEverybody, everybody Yo Gotti!\nSpent a hundred on her pinky toe, that bitch just like Mariah\nBet her mama and her friends know about it\n\nBridge/Pre-Chorus:\n\nChorus:", "year": "2015-02-01"}]}