{"artist": "Isaiah Rashad", "songs": [{"title": "Tranquility", "lyrics": "[Chorus]\nWell, thank God for the shooter, hmm\nAnd thank God for the leader, hmm\nAnd think hard for a message\nBlink art on pedestrians; what are you, a believer?\nWe're tranquil for a Brutus, hey\nAnd hard road for a Caesar, hey\nWell, who came from the heavens?\nThey kill for a blessin', they gon' do it to Jesus, hm\nAnd thank God for the shooters\n\n[Verse 1]\nThem hard streets make a militant man\nFuck a bitch, be as real as you can\nOur education, they tend to say we killers again\nBut I'd rather give this living a chance, I'm getting patience\nI wonder if the world is gon' see us as just niggas\nThey treat lyrics like I hold triggers like I make difference\nThen downplay, what I'm given like I'm no different\nIt make me wanna move to my aunt's house\nI've been on pills since a little one\nStart with Advil then we level up\nI wonder if my son gon' trust me, after songs so ugly\nBout his moms, ain't mean to see the world so crummy\nThey got.. Tec-9's for Jesus\nSo I figured that the second coming wasn't never coming\nGo figure heaven is a hassle cause\nThey don't even want a nigga back in Africa\n\n[Chorus]\nWell, thank God for the shooter, hmm\nAnd thank God for the leader, hmm\nAnd think hard for a message\nBlink art on pedestrians; what are you, a believer?\nWe're tranquil for a Brutus, hey\nAnd hard road for a Caesar, hey\nWell, who came from the heavens?\nThey kill for a blessin', they gon' do it to Jesus, hm\nAnd thank God for the shooters\nWell, thank God for the shooter, hmm\nAnd thank God for the leader, hmm\nAnd think hard for a message\nBlink art on pedestrians; what are you, a believer?\nWe're tranquil for a Brutus, hey\nAnd hard road for a Caesar, hey\nWell, who came from the heavens?\nThey kill for a blessin', they gon' do it to Jesus, hm\nAnd thank God for the shooters\n\n[Verse 2]\nAnd some of us fall and some of us hover\nAnd some of us shooters and some of us lovers\nI see the sum of it all, I'm running for cover\nInvite you for supper, but really they hunt you\nWhat's really 300, who's really a gangster\nWho's really the prey? Who's really in danger?\nI'm willing to pray, I'm feeling the angels\nIs liquor the savior? This moment will contain us\nAnd ride to the far side, I'm looking for peace\nJust spread the cigar wide, a moment of ease\nHard benches for my brothers that be roaming the streets\nWe don't always be the leaders that they want us to be\nI'm just hoping that she praying while she down on her knees\nSee I often treat these hoes like their fathers would be\nGood Lord, my flaws, blind you, got you time for, my flaws\n\n[Chorus]\nWell, thank God for the shooter, hmm\nAnd thank God for the leader, hmm\nAnd think hard for a message\nBlink art on pedestrians; what are you, a believer?\nWe're tranquil for a Brutus, hey\nAnd hard road for a Caesar, hey\nWell, who came from the heavens?\nThey kill for a blessin', they gon' do it to Jesus, hm\nAnd thank God for the shooters", "image": "https://images.genius.com/88da1904fb461fae943c2c34f20bda85.600x600x1.jpg", "album": "Cilvia Demo", "year": "2014-01-28"}]}