{"songs": [{"image": "https://images.genius.com/c93362744a33b4196acf0d52520994c4.264x264x1.jpg", "album": null, "title": "No regrets - craze & hoax remix", "lyrics": "Oo-oh-oo-oh-oo-oh\nNa Na Na Na Na\nOo-oh-oo-oh-oo-ohh\nHear me out\nThis is my kings speech, im no where near the end\nIf i s-s-s-start a sorry i ain't heaven sent\nI messed my life up, and yeah ive been down\nIm a changed man now Chris Brown\nYou know i feel your pain, coz i done been through it\nIm Kurt Cobain, but i just couldn't do it\nNo point in turning back, just to hit rewind\nBack to the future, ma marty mcfly\nInside theres a fire\nCoz im no longer looking at a reflection that I admire\nI paint a picture of a fighter\nBut as im looking back at me since I'm a liar\nIf I should die before i wake\nThe least that i could ever say\nI made mistakes but held on to my faith\nCause when i look in a mirror i don't even recognize My Self\nGot the heart of a winner\nBut looking back at me is someone else\nNo Regrets, No Regrets\nNo point in crying over yesterday\nNo Regrets, No Regrets\nCause we ain't even seen the best of days!\nOo-oh-oo-oh-oo-ohhh\nNa Na Na Na Na\nOo-oh-oo-oh-oo-ohhh\nIhis is my last chance, im on my final straw\nI came so close to b b breaking like a spinal cord\nI came from nothing, some kid in camden\nNow im flier than the birds Richard Branson\nI'm a Prince and yes I will get the crown\nKate stays in my dungeon when her sister's round\nSo please forgive me, if i make mistakes\nBut il blow the bloody doors off michael caine\nIf i should die before I wake, the least that i could ever say\nI made mistakes but held on to my faith\nCause when i look in a mirror i don't even recognize My Self\nGot the heart of a winner\nBut looking back at me is someone else\nNo Regrets, No Regrets\nNo point in crying over yesterday\nNo Regrets, No Regrets\nCause we ain't even seen the best of days!\nI'm free to be whatever I\nCoz im famous call me gallager coz im so shameless\nThe papers saw the pages like the cost of my failures\nVictimised by the public dont know if I can't take this, so I sing\nSo when you feel like theres no more\nNothing left but the life youve broken\nNo regrets no turning back\nPick up yourself and tell em im just being me!\nCause when I look in a mirror I don't even recognize Myself\nGot the heart of a winner\nBut looking back at me is someone else\nNo Regrets, No Regrets,,\nNo point in crying over yesterday\nNo Regrets, No Regrets\nNo Regrets!\nCause when I look in a mirror I don't even recognize Myself\nGot the heart of a winner\nBut looking back at me is someone else\nNo Regrets, No Regrets\nNo point in crying over yesterday\nNo Regrets, No Regrets\nCause we ain't even seen the best of days!", "year": null}], "artist": "Dappy"}