{"artist": "Yama Buddha", "songs": [{"image": "https://images.genius.com/fe28cc45f0c1247f22f68fa96bde8f67.720x720x1.jpg", "year": "2017-03-01", "album": "Khatra", "lyrics": "Aah! Yama! Nasty!\n\n[Verse 1]\nAhh! sabai ko thulo kura\nTara kaam vane kaile hunna pura\nAajkal mitra ni ke bhichitra\nMukh ma ramram bagali ma chura\nTara malai pani baal vo\nPrithvi golo chha aaucha sabai ko paalo\nManchhe ko jaat chinna k garo vako\nBahira gahu-goro bhitra man k saaro kalo\n\n[Chorus] x2\nK vaako hola, K vaako hola\nRap hanchhas geda jasto k vaako hola\nGeet pani geda jasto k gaako hola\nKeta man naparey ni kina yesto gay vaako hola\n\n[Verse 2]\nAajkal ko rap battle yani khulla manch ko bhela\nEk dui oota neta ani baki sabai jana bheda\nMa hun sabai ko guru sabai rapper mero chela\nMa sanga rap kakshya lina aaija bela bela\nTalai tyehi ni thik chha\nVideo banais keti nachais la babu thik chha\nNepal jasto desh ma je paye tyehi ni bikchha\nTara ta jasto hawa sanga kasle rap sikchha\nYeso alikati rapper huna jan\nTero rap sunda dukchha hami sabai ko kaan\nNa jhad dherai saan, kura maan\nTalai dhuwa jasto udai dinchhu dhumrapan\nChhaina kunai saan tero asli rapper majh\nTero video jata tattai lagchha overblast\nTara thikai ho desh vari chha namarda ko raaj\nKati keti matra nachauchas aaba afu pani naach\n\n[Chorus] x2\nK vaako hola, K vaako hola\nRap hanchhas geda jasto k vaako hola\nGeet pani geda jasto k gaako hola\nKeta man naparey ni kina yesto gay vaako hola\n\n[Verse 3]\nYo ho rap ko ranabhumi gari aaija tayari\nSabai lai sabda le prahar chha astra ko bhakari\nDherai ufrine lai pachadi, kasailai ni nachadi\nEk saas ma nilera janchhu ma nadakari\nMalai ramro lagchha Yodda, Bidesh ani Cromblah\nBrisk Timos, Nasty, Laure ani Trix baula\nAru sabai tori tah rapper pani haina\nTimiharu ko geet ma tah kunai rapper pani chhaina\nKinaki testo hawa talko geet lai rap bhanidaina\nAni pose handaima matra kahile rapper banidaina\nHawa jasto paara tero dherai udhdaichas mora\nYour father is back, aba runechas chora\n\n[Chorus] x2\nK vaako hola, K vaako hola\nRap hanchhas geda jasto k vaako hola\nGeet pani geda jasto k gaako hola\nKeta man naparey ni kina yesto gay vaako hola", "title": "K Vaako Hola"}]}