{"songs": [{"year": null, "album": "Atlantis: Hymns for Disco", "image": "https://images.genius.com/d7c9472cd5fb6703b27f2eb1f517e8f1.1000x1000x1.jpg", "title": "Black Ice - Hymn For Disco", "lyrics": "[K-oS]\nSometimes the way we look at life can be too serious\nCause we dancing by the pale light\nI wake up in the morning and I feel delirious\nCause of something that I did last night\nBut then an angel came onto me\nShe said that, \"Life is more than you see\nYou've got to be the change that you be\nSo don't die, just try...\"\n\n[Chorus: K-oS]\nWe just some fools with the lights turned on\nHoping your coming too, and turning up the moon\nI'll play it cool till the night's over\nWhen are you coming back\nTo save this heart of mine, yeah\n\n[K-oS]\nTime to take it slow\nBlack ice, white snow\nWhat is the truth, is we don't really know (Uh-huh)\nIf so, then life is a mystery\nThis could be the end of all history\nBut wait! The sun rises to the east\nAnd the world still spins 360 degrees\nOn it's axis this intergalactic practice\nOf rhyming proves that there's no beginning or ending\nOr timing and it's been a long haul\nRise like the sun and get your back once more\nPeople party in the light game show\nOnce again, we dumb it down to ease off the flow\nWhat's the the definition of this thing called \"Black\"? (Huh?)\nI had a premonition 18, way back (Yup)\nThat black's the color of the universe of whence we came\nI wonder if my souls on ice again\n\n[Chorus: K-oS]\nWe just some fools with the lights turned on\nHoping your coming too, and turning up the moon\nI'll play it cool till the night's over\nWhen are you coming back\nTo save this heart of mine yeah\n\n*instrumental until 3:45*\n[K-oS]\nCome on!\nAh, come on!\nFools with the lights turned on... (Repeat 2x)\n\n*beat-box at 4:21*\n\n[K-oS]\n...Oh, oh, oh you think so?\nCheck it out! Okay\nI've got something for you\nIt goes like this, check it out\nWake up in the morning, press the cold gate\nBrush my teeth then I'm hitting the streets to meditate\nWent outside, and the sky was rather grey\nBut I paid no attention kept moving upon my way (Uh-huh)\nWent down the block and skipped a little further\nUntil I saw a kid and he said, \"What's up with emcee mur...\"\nThat was then, son (son), this is now\nI live in the moment like a why to a how\nWow, that's profound, just break that down\nThat's when I proceeded to show him the pro to the noun\nI said, I found, instead of trying to be what I was\nI'll be what I is which makes us the Wizard of Oz-- (*Static*)"}], "artist": "​k-os"}