{"songs": [{"album": "The Gates Mixed Plate", "image": "https://images.genius.com/7efd1fa33fbd953a08bc1d44fae9f6a7.600x600x1.jpg", "year": "2010-07-27", "title": "Doin’ It", "lyrics": "[Intro: Tech N9ne]\nStrange Music 10 years in the makin'\nHey man, this feel like I'm in Miami, Florida, man\nBut reppin' Kansas City at the same time\nYukmouth, Chillest Illest\nYo, Tech N9ne! Ome, let's go!\n\n[Hook: Ome]\nI'm doin' it!\nI can do anything go shop\nBuy fly high no lookin' back\nI'm doin' it!\nTake a trip everyday\nLivin' life all paid build an Empire State\nI'm doin' it (doin' it)\nI'm doin' it (doin' it)\nI'm doin' it (doin' it)\nBuy low, sell high!\n\n[Verse 1: Yukmouth]\nEuro, pounds, crowns, get dough\nRed Light District, hoes in the window\nAt the Green House blowin' on the indo\nThen it's to the room and the cab is the Benzo\nYo, then I'm on to the next\nJigga Man style blowin' zones on a jet\nHigh above 20 inch chrome on a (?)\nGot hoes on deck, got a home on my neck\nYup, wrist flooded in cruise ship\nTwo chicks, I'd have pop it like Whoo Kid\nShut 'em all down, no brand new shit\nLouie to the Gucci bitch I do's this\nWhat? I get brain (?)\nThe Last Train to Paris\nLike Diddy for them benjies\nBlack stones and a chain, black Bentley\nAll black everything flier than a frisbee\n\n[Hook]\n\n[Verse 2: Chillest Illest]\nChillest Illest, yaah, yo\nI'm doin' it weller than (?)\nGlobetrottin', I'm hot, I'm a young yacht seller\n(?) when I land her\nMake it to Japan\n(?)\nI'm a boss\n(?)\nCarnival cruisin', exchange currency\nAll about my paper I'm serious like an emergency\nSome of y'all ain't heard of me but I'm about to fix that\n(?)\nI spits a lot of game you should absorb it\nAnd no I don't pay rent partner I pay mortgage\nChecking NASDAQ (?)\nAnd all that you imagine\nOh yeah I'm doing that\n\n[Hook]\n\n[Verse 3: Tech N9ne]\nSold out shows N9na make 'em go nuts\nThey get the dough cut, splittin' hella O's up\nClose up to show rush to go to Lust Vegas\nThe Tower Suites encore doin' for much\nCold days in Missouri can't stand them\nSo I take the family to Saint Martin just to tan 'em\nKickin' at random beaches then when I land 'em\nThe bags in the van, wife and kids in the Phantom\nRoyal Caribbean floating through amphibians\nGo to Disney and pig and eat at the Grand Meridian\nWealthy Kansas Citian, pretty women, Henn and lemon or lime\nWhy she all up in mine? I'm Tech N9ne\nAnd gettin' mo' checks, my life is so jet\nI got a Mercedes Benz I ain't drove yet\nOrder your beast filet straight chewing it\nHaters want me to ruin and never stop the N9na cause it's\n\n[Bridge: Ome]\nFull traffic escorts\nNew market passports\nWe're closing airports\nDo anything!\n\n[Hook]\n\n[Outro: Tech N9ne]\nOkay this means we through doin' it now\nThis was the mixed plate\nNow I'm 'bout to go to Gates and get me a president's tray\nY'all know what I mean, ha-ha-ha\nKansas City baby this album was for you\nI don't care what nobody say\nI love this place!"}], "artist": "Tech N9ne"}