{"songs": [{"album": null, "year": null, "title": "Pushing The Odds", "image": "https://s3.amazonaws.com/rapgenius/qlffff0000000000000000000000000000072bc0.jpg", "lyrics": "[Intro: Pusha T]\nHands dirty like Ason, I'm grindin' nigga you J Kwon\n\n[Bridge]\nThey owe me some pape, they owe me some pape\nThey owe me some pape, they owe me some pape\n(My mic on?)\nI ain't fucking with these niggas, they owe me some pape\nHi kids, I see these wack rappers like braids all in his head\nDid exactly as I did\nHi kids, I see these wack rappers like braids all in his head\nDid exactly as I did\n\n[Verse 1]\nYou only here cause your team pull strings like a violin\nBall, hell nah, bitch I ball like your eyelid\n[?] keep pressing me, just tryna get them press release\nFrom St. Louis where we say [?] we flip bird, no Sesame Street\nOn the average I'm with a bad bitch [?]\nPulled up in that black truck and we strapped up, and we extra deep\nHol' up...\nLets get some shit straight for a second\nYou just getting bread, Push, I've been straight for a second\nNiggas say I'm dead, I say I'm too alive\nLiving \"respect my elders\" I'm 26 that nigga 35\n\n[Interlude]\nYou old ass clown, just an old ass now\nLet a young nigga shine\nSit your old ass down\n\n[Hook]\nAll I wanna now is why they picking on me\nAll I wanna now is why they picking on me\nWhy they picking on me, stop picking on me\nCause I'll fuck around and pop your ass\nPop, pop, pop, pop your ass\nThey picking on me\nAll I wanna now is why they picking on me\nWhy they picking on me, stop picking on me\nCause I'll fuck around and pop your ass\n\n[Interlude]\nFive albums, a hundred songs\nAnd you ain't got no fucking Yeezy\nI bet you got some J Kwon\nYou ain't got no fucking Yeezy?\n\n[Verse 2]\n(Paow) I mute you\nI bought a whip, color: odd future\nSince -04 I had the odd fusia\nNigga time's crucial, you wanna fight? Yeah right\nI turn off your light like I'm Future\nLil homie you don't know me, quit fucking with me\nFucking kids wear wigs and fucking with niggas\nYou The fucking Creator, is you like really creative?\n\n[Hook]\n\n[Outro]\nPusha T said my name, he owe me some pape (owe me some pape)\nOdd Future said my name, they owe me some pape (oooooh)\nAnd I don't fuck with [?], they owe me some pape (owe me some pape)\nI ain't fucking with these niggas, they owe me some pape\nWhy they picking on me?\nCause I'll fuck around and pop your ass"}], "artist": "J-Kwon"}