{"artist": "Pharrell Williams", "songs": [{"album": "We Got It 4 Cheap, Vol. 2", "title": "Maybe (Remix)", "image": "https://images.genius.com/1ebf1b2c3d5b1d4a726e437705a95630.999x1000x1.jpg", "lyrics": "[Break: Maybe (Original)]\nHold it now [scratched]\n\n[Intro]\nThis for all the... All the connoisseurs of fine rhyme you know?\nI dug deep in the cellars of my mind for this\nI love y'all niggas, I just wanna air some things out\nDear hip-hop, ya know?\nDear hip-hop\nDear hip-hop\n\n[Verse 1]\nI got a cult following, N.E.R.D. is far from pop, G\nNo radio, light spins since the video drop, see\nI'm the tourbillon of this shit, like Mozart and Bach be\nI'ma show you niggas what time it is, niggas watch me\nMy falsetto's been hot, like The Sopranos' five seasons\nAlto beats, \"Grindin'\" soundin' like \"Frontin'\"? Niggas is reachin'\nI pimped across the stage, nigga tipsy off that reason\nSnatched that Grammy, when I joke I call it the G-Thing\nAsk Robin Leach how many V-somethings in my fortress\nLike Russell Crowe in Gladiator, so many fucking horses\nPorsches, Maranello, that's white, I call it Ghost\nPhantom named Nightmare, black scares people the most\nI introduced BAPE to the world, 400, nigga, out fast\nFavorite group, White Stripes, R. Kelly, Kanye, and OutKast\nA R&B producer, I was sittin' on the shelf\nA Ralph Laurenic nerd then Noreaga gave me help\nBut my samples wouldn't clear, and I couldn't rock a wig\nAnd they didn't have pimp cups, and dancin' wasn't my gig\nBut shoulder brushin', blazers, and trucker hats I did\nAnd the only niggas I ain't work with was 2Pac and B.I.G, haha\n\n[Hook]\nYou and me\nBAPE, Ice Cream and BBC (Yup)\nJust because we skate down the road (Niggas)\nDon't mean we can't slam Phantom doors (Bitches)\nYou and me\nBAPE, Ice Cream and BBC\nJust because we skate down the road (Love y'all, man)\nDon't mean we can't slam Phantom doors (You have no idea)\n\n[Verse 2]\nNow errbody keep asking me about Kelis\nShe's dope with or without me, 'til I die, that's what I speak\nI never run to the tabloids and run around here grinnin'\nI'm a peaceful, Rolls Royce-drivin' black John Lennon\nPsychedelic beats, medals on my soldier jacket\nFuckin' the baddest bitches in fashion, niggas, can you imagine?\nMa, why you even breathin? Why you even talkin'?\nPut my big bang in your black hole, I'm Stephen Hawkings\nIf the mind is full of water, can you believe I'm walkin'\nOn your thoughts, trust me niggas, what I've achieved is awesome\nMind readers, you think you know me, proceed with caution\nOhup! Eternal sunshine of a spotless mind, you lost him\nI cried when my grandma died, Bob said Jah saves\nIf Jah's short for Jesus, then I'll sing what Bob says\nOh, small diamonds are blasé blasé\nRemember 20 karat solitaires can not be pavé\nAnd while my heart has lots of scars hidden\nMy beats is star-ridden, givin' trucks and jeeps and cars rhythm\nAccompanied by 40 bars spitting, not from the prospective of narciss-um\nBut as N.E.R.D. goes, I start pene-trating minds unlikely fitting\nGhetto girls and thugs liking the album guitar-driven, yup\nGhetto girls to girls from the valley\nFrom niggas that skate to niggas that pump crack in they alleys\nI'm the black Carl Sagan, Timothy Leary, John Lennon\nLookin for my Yoko, hoping my wife hears me\nAnd maybe she'll have more Interscope and won't be a Virgin\nWho bought my album, and who will prefer the regular version that goes\n\n[Break: Maybe (Original) plays fast]\nSee, maybe (Haha)\nThere was something wrong (Hooo!)\nAnd you were telling me no wrong\n(What up black radio? Daddy loves you)\nSee, maybe (Ahhhhohhhhhhhhhh!)\nThe laugh's on me (Yeahhhh)\nAnd life was telling me a joke (joke joke joke)\n\n[Hook]\nYou and me\nBAPE, Ice Cream and BBC\nJust because we skate down the road (Mean what?)\nDon't mean we can't slam Phantom doors (Nigga nigga)\nYou and me\nBAPE, Ice Cream and BBC\nJust because we skate down the road\nDon't mean we can't slam Phantom doors (Nigga-nigga)\n\n[Outro]\nLove y'all\nP.S.: Daddy loves you\nYours truly, N.E.R.D\nYup!", "year": null}]}