{"songs": [{"year": "2000-03-30", "image": "https://images.genius.com/b70930fc56c82c3038f706c659b43fc6.500x500x1.jpg", "title": "Leather Face", "album": "Yeeeah Baby", "lyrics": "[Intro]\nWhat I gotta do let y'all niggas know\nI am THE. NICEST. EVER!\nHardcore.. Commercial... What you wanna do?\nYou wanna wile up, you wanna dance?\nDon't matter to me, I got it all locked down baby\n\n[Verse 1]\nIt's not a game it's war, plain and raw\nBlood stain the wall\nWhen I bring the chain with the saw\nBring the pain to your door like death was knockin'\nUnless you got my ends I'ma make you twins with the Headless Horseman\nHell extortion, sell your soul, live your dreams\nDon't pay the cost then {*bam bam*}\nSay hello to the guillotine\nA killer fiends for blood\nScreams of thugs like\nFiends for drugs\nI don't need no love\nGive me your fear, money, respect, beer, honeys and sex\nWe're here\nI'll bend them checks for years, hungry and stressed\nYou fuckin' with Chris - fuck Pun - dead the wrath for later\nGet your calculator, the head decapitator's back forever\nCan't count how many heads I had to sever\nHalf the niggas I keep\nI put em back together\nThat's the terror, cut open your girl\nAnd make a truss out her flesh, like Buffalo Bill\nYou fuckin' with reel to reel, rap axe maniac\nSound bwoy killer\nHack hack chain-react\nTwo for one - double the death, same price\nWhat would Big say?\n\"Huh, you know that ain't right\"\n\n[Hook x2: with samples from \"Scarface\"]\nIt's not a game pah (Now the leg huh?)\nWe're gettin paid hah (Now the leg huh?)\nIt's still T-Squad (Now the leg huh?)\nWhat you came for\nSurgery, with a chainsaw\n\n[Verse 2]\nWord to Pac and BIG\nMy Glock so big it can rock a bridge\nDrop the midsection like the top of your wig\nAin't no bullshittin, getting the full treatment\nSpecial two heated missiles, 'til your crew's leaving witchu\nI rip you in half - blast that ass through a glass window\nLaugh a little (HA HA) and dash in the S-Class limo\nThat's how we do it in the South Boogie\nWhere tough rough rookies get snuffed out, for talking loud to me\nWhy should I even consider your crew\nShit on your crew\nGet rid of your crew, what I'm fitting to do\nI split you in two, leave you impaired when I blast the shotty\nRip it like dope and leave you there with half your body\nWe Rowdy like Roddy, probably robbing your stash\nCatch a body like Charlie up North\nStashing knives up my ass\nSurviving the task, we the last ones left\nBlast them tecs with clips, fast as vets that spit\nAdd some tips for any, bastard bitch, pappin shit\nWatch me rep til the casket from the bassinet, biatch!\n\nAhora tu!\n[Hook]\n\n[Outro: From *Scarface*]\nWatch what happens to your friend\nYou don't want this to happen to you\nYou give me the money, okay"}], "artist": "Big Pun"}