{"artist": "Yung Gravy", "songs": [{"album": "Mr. Clean", "image": "https://images.genius.com/d8f648137e03a531a9f1d8bbfbc8aaf0.1000x1000x1.jpg", "year": "2016-09-03", "lyrics": "[Intro]\nShit man, I got gravy on my bitch\nGravy on yo bitch\nGravy on my coffee\nGravy on my jean shorts\nGravy on your fuckin chiropractor\nGravy on my biscuits, logic\nI mean shit man you'd think it's Thanks Giving\n\n[Verse 1]\nAy posted with your thot\nGravy just came in hot, goodness\nShe real thirsty gotta hydrate\nDark skin so my eyes gotta dylate\nMy girl foreign man I think I might migrate\nI was just flexin' on Myspace\nAy posted with yo Godmother\nI was just flexin' like a scrub under cove, ay\nBitch it's Mr. Clean also known as Mr. Butter\nShit it's Yung Gravy he a wavy motherfucker\nDon't like me then your name is probably Tucker (Tucker)\nAnd you probably a trucker\nAnd you probably ugly (ugly)\nMy side bitch call me Yung Bubbly (Bubbly)\nShe always gimme bubble baths\nGot too many hoes it got me doin' fuckin' math\n\n[Hook]\nBitch I pull up with the potion (splash)\nI come through smooth like lotion\nMy hook shot wet like the ocean\nWhole team lit cuz' Gravy got the potion\n\n[Verse 2]\nAy, posted with your female\nYeah I just finessed her over E-Mail\nShe think I'm real charming\nGravy gonna get up in that ass like Charmin\nSide bitch named Carmen\nShit maybe it was Karen back of the Mclaren\nPull up real quick with the R Kelly blearin'\nWord to Bobby McFerrin\nUh don't worry be happy, my hair so nappy but your Momma call me Papi\nGuess I'm kinda like your grampa\nPull up make it hot like Tampa\nThicc like a panda\nMan that's what I need\nCome through fertilize your bitch like a seed\nI finessed your Mom before i learned how to read\nGravy pull up, bad bitch stampede\n[Hook]\nBitch I pull up with the potion\nI come through smooth like lotion\nMy hook shot wet like the ocean\nWhole team lit cuz' Gravy got the potion\n[Verse 3]\nI pull up, drop top when i begga\nYour Mama wanna l'eggo my Egga\nMan i'm spittin' hot fuega\nChillin' with latinas who can call me Diego\nI just got a hunnid for a feature\nAlmost hit your bitch, but she look just like a creature\nPull up to your sister\nGirl it's nice to meet ya\nWe out at Little Ceasar's\nGravy on my pizza\n[Outro]\nOooh shit man\nYou know this \"Gravy shit\" isn't some weird fucking sexual metaphor\nYour bitch legitimately has top-shelf gravy on her hands, face and knees\nI mean shit, you would think it's Thanksgiving\nI mighta hit it last week but right now we're just eating\nIt's Mr. Clean, Hoe", "title": "Patrice"}]}