{"artist": "C-Murder", "songs": [{"title": "I’m a Baller", "album": "TRU Dawgs", "year": null, "image": "https://images.genius.com/ae5bdb4090e0098cab16287cfd6d6b31.239x239x1.jpg", "lyrics": "Chorus 2X: XL\nI'm Know they see me coming\nI'm A baller\nJust cuz I got money they wanna lock me up tonight\n\n[Verse One: C-Murder]\nI Know you see me coming\nI just left the dungen with handcuffs on me\nBut you ain't my homie what\nI'm on a paper chase you trying to take my place\nFuck they system that's right (Damn C-Murder dissed them)\nYou see me on TV, court TV\nTake my freedom from me but I'm still gonna be a G\nLocked down to free thats me the Miller boy\nChrome carrier I'll burry ya but I'm smooth\nYou couldn't fit my shoes\nI make the news on a regular\nSix ??? burry ya scary ya\nYou don't wanna mess with me\nThat means I get the ski mask and X your ass whoa!\nFor real though I'm looking for a reason\nCuz in the Calliope it's duck hunting season\nMy mama say boy you better let it go\nBut I'm gonna pull an R Kelly and keep it on the down low WHOA!\n\nChorus 2X: XL\n\n[Verse Two: MAC]\nTake a shot take these niggas in the pace\nMe and my doggs hangin' them like drapes let me say this\nAin't no love if you transparent\nYou also know is week who to put these niggas to sleep\nShits deep proverts is what I'm speaking cussing like Puerto Ricans\nBuss them till you leaking I sound like who?\nWorld War III you don't wanna start me nigga\nGT is where my muthafuckin heart be nigga\nI'm a lion king ducking with a gat in my hand\nLittle kid would you like to be a murder man\nSoulja rag on my eye soulja ????????\nBitch niggas try to stop me I reverse the game WHOA!\n\nChorus 2X: XL\n\n[Verse Three: T-Bo]\nGot damn them bitches hate when you up\nAnd got a couple of bucks and hate you when you broke\nWhat is this what the fuck?\nI like candy Benz and pointing in trims and big ole trucks\nDollars to tip strippers couple of chickens to pluck\nYou must be sick in the head if you think I do this for ya'll\nI do this for my family, I do this to ball\nAnd I promise ya'll when I hit the top I never gone fall\nBack down to the bottom again Bitch I'm never gone fall\nI got 10 whips 20 chicks and a house made of bricks\nOne gold mouth piece especally made for talking shit\nTill you rock those big chains trying to catch cracker slim\nPut on your track shoes ????\n\nChorus: XL\n\nTill fade"}]}