{"songs": [{"year": "2003-09-23", "lyrics": "LSR...\n\nI'm still high as I ride in my 7 duece coupe deville\nYall soldiers know my truth be ill\nNow with these visions and these bad thoughts runnin through my mind\n(can't) stop the clock, see I'm runnin out of time\nAnd as I, tell myself, I'm a changed man\nDressed in black out to jack me a game plan\nSituation critical, it's called creepy physical\nHella cold, I'm a BO put off in hella old\nPlus it's hard to focus, when you crooked and hopeless\nI ain't home, but my mama don't notice\nNationwide with thugs, locc'd out it's just us\nWith the feds and the police out to bust us. (That's right)\nThe most prominent, see we stay dominate\nAnd stay wicked, and plus we keep it explicit\nAbducted by the streets see it's hard to manage\nEnd up on my block saying we the savage\n\n[Chorus 1]\nSo you made a little money OH WOW, what the f*ck yo punk a$$ finna do now...\nSo you roll on 24's OH WOW, what the f*ck yo punk a$$ finna do now...\nSo you pimped a few ho's OH WOW, what the f*ck yo punk a$$ finna do now...\nSo you earned a few stripes OH WOW, what the f*ck yo punk a$$ finna do now...\n\nI hear you rappin bout the streets, talkin bout pushin deal\nWhen most of yall never seen a triple beam scale\nRunnin from weed smell, runnin from dank smoke\nThen you get on the mic, talkin bout you been chokin?\nYa lame as mark, buy some heart with yo chump change\nDon't make me start, cold hearted droppin punk names\nYou run thangs? maybe, in yo back yard\nYou act hard round here you gonna get smacked hard\nBaby bash cross game, that's a negative\nWith savage dreams on my mind so repetative\nLet it live, let it go, playa do or die\nCuz fools on my side will tell the other fool to ride\nDown to do what I gotta do, to satisfy the man in me\nI pull illicit things, my family ain't understandin me\nSo while I have kids beatin up on the door\nI'm gonna crack up and smoke with a corona\n\n[Chorus 2]\nSo you got a platinum grill OH WOW, what the f*ck yo punk a$$ finna do now...\nSo you got a record deal OH WOW, what the f*ck yo punk a$$ finna do now...\nSo you pack a few gats OH WOW, what the f*ck yo punk a$$ finna do now...\nYou fell in love with yo bitch OH WOW, what the f*ck yo punk a$$ finna do now...\n\nThe day I wake up, blaze up, lace my J's up\nTry to make a couple stacks fo' the days up\nHustle hard ni**a, that's how I live\nOnly fuckin with fans, my ni**as and relatives\nAnd I dress fly, all clean and keep a fat knot\nFor supplying all the beats to the have-nots\nHP you ain't knowin I run this, so stop braggin\nWon't kill what you don't bitch. Or watch your grill hoe\nI'll have you iced out, you beat grills with your mutha f*ckin lights out\nLame ni**a, we ain't worried about yo salary\nGet off them pills and come back to reality...\n\n[Chorus 1]\nSo you made a little money OH WOW, what the f*ck yo punk a$$ finna do now...\nSo you roll on 24's OH WOW, what the f*ck yo punk a$$ finna do now...\nSo you pimped a few ho's OH WOW, what the f*ck yo punk a$$ finna do now...\nSo you earned a few stripes OH WOW, what the f*ck yo punk a$$ finna do now...", "title": "Oh Wow", "album": "Tha Smokin’ Nephew", "image": "https://images.genius.com/64603eb1c06e292b66e8e33c4aa10509.400x400x1.jpg"}], "artist": "Baby Bash"}