{"artist": "Isaiah Rashad", "songs": [{"title": "Shot U Down", "lyrics": "[Produced by The Antydote and Chris Calor]\n\n[Verse 1]\nI take a drag at the square, I feel anxious, spit dangerous\nAs the verbal appears, it's reflecting my perspective\nBeer goggle and fear, role model so hollow\nShadow adolescence and a gaggle of them bitches\nRoad to the riches still paved with the ditches\nGet caught up in the hype, your career is for a night\nI ain't these other niggas, cause these niggas is fake\nThey ain't popping shot, these niggas is Papa Doc\nFine as the shine, beam me up, and I’m riding Spock\nNo crying 'til I'm in a pine box\nI got the bitches hitting Mikey like where Zay at?\nProbably fucking on her friend, probably L.A. at\nProbably plotting on a mil', staying well fed\nBitch don't run your mouth, we don't play that\nMomma taught me better, can't count on niggas\nCan't count on weather, go figure nigga\nThey ain't worried 'bout this cheddar\nThem niggas just sky diving in my propellers, I don't feel 'em\nAin't tryna be no freshman, I'm chilling\nCause they'll bring a knife to the fight, and I'll kill 'em\nMe and my niggas is hungry, we're willing\nTo bring a little ho to the party and Meek Mill 'em\nI feel like talking my shit\nCome in the house, acting friendly, you can suck my dick!\n\n[Bridge]\nI'm praying for some good rappers and a fleetwood\nWhy I gotta bring my A game? You just D goods\nWe don't wanna hear that weak shit, nigga speak up\nRocking old flows corn rows and a beeper\nYou niggas hoes, you niggas hoes and I ain't even tripping\nCause we'll be laughing to the bank and riding by these niggas\nMikey bring that mink with your low body Bentley\nPut the hood in the fucking trunk and bring the party with me\n\n[Hook]\nI came, I saw, I conquered, I shot you down\nYour brain no have no conscious, what you do now?\nI came, I saw, I conquered, I shot you down\nI bang, I bang, I blocka, what you do now?\nNo bitch-ass rappers, I shot you down\nNo sensitive niggas, I shot you down\nNo bitch-ass rappers, I shot you down\nNo Hypebeast pussies, what you do now?\n\n[Outro]\nI came, I saw, I conquered, I shot you down\nYour brain no have no conscious, don't make a sound\nI came, I saw, I conquered, what you do now?\nYour brain no have no conscious, what you do?\nDon't make a sound, bitch", "image": "https://images.genius.com/2da0c97092636f1af5d67c73bc6e24d8.500x500x1.jpg", "album": "Cilvia Demo", "year": "2014-01-28"}]}