{"songs": [{"title": "The Journey", "lyrics": "[Intro: Akala & (Mic Righteous)]\nIsn't the purpose of life to give your life some purpose?\nChasing these dreams and these goals to only find they're worthless\n(In this eternal circus I could turn in circles\nSpins around the fire burning\nWe're searching for higher learning)\nDistracted by higher earning\nYearning for more than what's on the surface\nWhat if I told you that inside you were perfect\n(Would you believe me or say I'm crazy man, what's your verdict?)\nThe furthest from the battlefield is always lovin war\n(The one who's on the front line, well he ain't as sure)\nDon't appreciate all your blessings, you need to struggle more\n(Might have the fullest plate and live amongst the poor)\nIf you've got a heart full of hate then you are just as flawed\n(What if the journey is the destination, what you reckon, if you present)\nIs a present, will you grab it with every second, or\n(Would you still wreck it, given a second chance?\nNow that we've even said it, nah, we ain't no better, in fact)\nWe're just as wreckless and we ain't got the answers\n(These are just our questions)\n\nJourney with us, journey as we ask these questions\n(Journey with us, journey with us)\nJourney with us, journey as we're learning lessons\n(Journey with us, journey with us\nJourney with us, journey with us)\nWe ain't got the answers\n(Journey with us, journey with us)\nWe're just asking questions\nIs this what they're waiting for\nCause we give it to them straight and raw\nIs this what they're waiting for\n(This what they've been waiting for)\n\n[Hook]\nEvery journey begins with just one step\nTurn over the page, open the book, just look\nEvery journey begins with just one step\nPut your foot in front of the other and just move\n\n[Verse 1: Mic Righteous]\nI've been livin' in a prison in my mind\nYou been nothin' like mine, when you talk, pigs fly\nWhat you call this life\nWhat you glamorize is a pack of lies\nI'm with a pack of lions\nYou ain't playin' with our pride\nThat's patronising, talking to the young bucks\nYou ain't ready for the pop-pop\nLittle Akon, you don't wanna get locked up\nYou don't wanna be a Konvict\nWhat you spat got him on shit\nDon't you fuckin' have a conscience?\nI got this, can't stop it there\nThat's how I felt for the last couple years\nYou don't wanna confront my peers\nMy brother just lost somebody\nSo I had to go back to the manor and confront my peers\nAnd comfort my peers\nAll this time I'm funding my career\nAll this time my fans are getting air\nYeah, I'm stood in the middle of nowhere\nAnd I broke my back just to get here\nThen and there is where dad just said a prayer\nStill feel the blood of the person\nI was building up in me, yeah I'm prepared\nStill feel the blood of the person\nI was building up in me, yeah I'm aware\n\n[Hook]\n\n[Verse 2: Akala]\nAkala and Righteous, the words we are uttering\nFeel in your spirit, the pain we are summoning\nCause we came up in the suffering, now we're recovering\nBut it still feels like we're stuck in it\nThere's enough of it\nEveryone's sucking the life out of people\nIf it doesn't toughen 'em\nBreak, crack, shatter your life\nThis is the journey, it ain't always nice\nWe have not learned to disable the lies\nIt seems we're determined to pay all the price\nBut still, I murder a rhythm like no one in Britain\nI'm righteous on mics when I'm spitting\nFam, don't worry bout me I am living\nJust play your position and stay out the kitchen\nWhen the rhythm hit him in the chest, better get a vest\nI'm obsessed in his steaks there on the decks\nGetting vexed, it's a head stare on your neck\nSo who's next to express? Get it off your chest\nChess that I play, fuck the right game\nTime you were sure you aboard the right plane?\nThis one right here it goes where I say\nThe journey is allowing me to focus my pain\nTo spit phrases, molten ice flames\nYou'll get burned and frozen, that's only quite tame\n\n[Hook]\n\n[Verse 3: Mic Righteous]\nBrush off my shoulders and bop to the mother-ship\nBumping some other shit\nNow all the lies will just turn into mumbling\nTurn up my mic again\nTurn up my mic so they know who the fuck it is\nKnow when I'm coming in\nYou just a problem for rap, when I rap\nI'm a problem for governments\nThere's a problem in mainstream media coverage\nFfeeding us utter shit, please keep 'em coming in\nThis year I'm encouraging anyone with the courage to go up against\nThe system we're stuck up in\nAnd if you ain't with us then fuck if then\nBecome a pawn or become a king\nBecome a pauper, they die by the sword of another pawn\nWhy are we fighting each other for?\nWhy are we fighting our brothers for?\nWhat's the price of a life if you young and poor?\nLooking online at a life for only some can afford\nI got a son that needs more so I'm opening doors\nI'm hoping he won't say I'm hopeless\nThat is more dangerous than a man who is desperate, broken\nComing back from an injury, did you miss me?\nMan'll wanna throw me out like a frisbee\n(Where you been fam?)\nWanna know where I've been G?\n(Yeah, tell me now)\nI've been alone, it's a rocky road, Kingsley\n\n[Verse 4: Akala]\nIt's a rocky road in the stories that we're told\nWell I'm evolved from the places that we've growed\nYou wasn't there when the rental was in arrears\nAnd the bailiffs came to the door\nYou wasn't there, didn't witness all the tears\nIn fact have you ever been poor before?\nYou sure this ain't Jersey Shore?\nThis is real life, it is totally raw\nUncle's is going to prison\nAnd half of your role models getting their dough in the kitchen\nLiving right next to the rich kids\nOne street away but our struggle is totally different\nI am the man of the house where I'm living\nAnd I'm like 11, I'm destined for prison\nI never went though cause I beat the system\nAnd all of my villains is proud that I broke tradition\nYou don't know shit about us\nDo not discuss what you cannot sus\nSus is the start of them fuckin' us up\nNo it wasn't just not enough luck, better suck it up\n\n[Hook]", "year": "2015-03-30", "album": "Knowledge Is Power II", "image": "https://images.genius.com/7c518a58eebfd479e5ad2216b0cd1a85.1000x1000x1.jpg"}], "artist": "Akala"}