{"songs": [{"year": "2015-08-26", "image": "https://images.rapgenius.com/f693f825be056cfa91c9e345dd89717f.800x800x1.jpg", "title": "I See", "album": "Bishy’s B-Day Playlist", "lyrics": "[Intro]\nImma just go straight in, fuck it\nYeaah..Uh\n\n[Verse 1]\nThe ill nigga illin' in the Hilfiger\nTransforming into a real figure\nYeah they figured that I'm optimist\nBut my prime ain't even close\nI got em' shook like oculus it's obvious who's host\nWant the end like apocalypse but they a lone vote\nOn the road gettin' doe for bozos and slow\nChattin' foes trying to make me black like crows\nI see rows of zeros, no cracking a code\nImma about to explode, backs packed with the load\nWear backpacks so they think the cats wanna fold\nBut the cats just wonderful\nOnce I unzip, concedes to bull\nBecause if im seeing red\nAll that imma do is squeeze and pull\nI'm titanium, these fools full of wool\nBishy play the sheep herder and murderer of all the wolves\nThey true burgers?\nAnd they creepin' like burglars\nThey trying to hurt us but scenes can turn into murders\n\n[Hook]\nI see that they trynna test me\nI see clowns they trynna stress me\nI see biddies trynna sex me\nI see why I'm kinda sexy\nI see fakes squeal once they envy\nI see snakes in see them simply\nI see why some act so empty\nI see I can't leave no entries\n\n[Verse 2]\nSettling for the lowest of lows\nBut im higher than highest\nLike graphs trying to rise\nAnd get a piece of the pie\nWill im setting the bar\nKnow the ending is nigh\nFor these sap rap guys trynna slide for the ride\nThey gon' slide and slip, trynna survive with the fit\nWhen they nine is legit\nThe style is so sick\nWhen I spit, even Hammer would quit\nIm from the land where scammers will get ya quick\nNever focused on hitting the chicks\nCause I was hitting the licks\nTill I could afford a mic, to have my voice recorded right\nNow its like when I write and the bitches on my stick and let me hit them more than Ike\nNow Latinas got the nigga hype, now\nI see em up like high heights\nI'm the captain when I'm tappin she go \"AIGH! AIGH!\"\nPapi Chulito, make it look easy like free throws\nThey see sequels, I see C Notes\n\n[Hook]\nI see that they trynna test me\nI see clowns they trynna stress me\nI see biddies trynna sex me\nI see why I'm kinda sexy\nI see fakes squeal once they envy\nI see snakes in see them simply\nI see why some act so empty\nI see I can't leave no entries"}], "artist": "Bishop Nehru"}