{"artist": "Half A Mill", "songs": [{"album": "Da Hustle Don’t Stop", "lyrics": "Uh huh, yea, uh uh, what ya want from me?\nUh huh, yea, Half-A-Mill, y'all know\nFirst don, yea, uh huh, holla\n\n[Verse 1]\nLegendary don, cherries flowin in Parion\nPlatinum Champaign glass yea thats Half-A-Million\nLay back, laughin at these rap new jacks\nYappin 'bout how they slung a few cracks\nAnd touch a few stacks\nUse to come through on the max\nNow all of a sudden you sealed out\nCrew cat, now you shoot back\nFake ballers, let Mill show y'all where hoop at\nGet real, here I come head for the hills\nNigga my ooz strap, my first single is Rata-tat-tat\nKill every nerve in you, action packed you might need plastic bag\nI mack hoes like hack-a-sack jack\nSpit tight flows, 23 inches on on the white Rove\nThey tryin to hear you oversize chips\nOn my right lobe, oversize clips light oversize spiffs\nPut my oversize dick 'tween your bitch oversized lips\nFive or six, no matter what you whip\nYou ain't fly as this\n\n[Hook: Half-A-Mill] **repeat 2X**\nFrom the Range to the Rove to the Bentley Coupe\nBack the V-12 for being buggy niggas salute\nWe be them Mill-i, pretty thugs guns we shoot\nSo when you see us don't say \"wuttup\" niggas salute\n\n[Verse 2]\nFuck you starin for? frontin off in front of camera floor\nMy name Milli, chicks feel me like brand new soar\nI make a brand new hall maybe like brand new eloar\nIf niggas wanna front dawg I got the brand new four\nI pop a cannon off, lay you in brand new floor\nI ain't tryin to play you dawg, I just spray you dawg\nLive motivator, why's is hole in paper?\nNo respect for the dead send my guys to hold your wake-up\nFrench fries ass, cheese burger frontin like you fly ass\nWords on the street you bitch niggas gon' die fast\nSo I advise you hop on your CL K and drive fast\nNo set-ups then I just wet-up your dry ass\nAct like you fed-up, \"ok, uh huh, shut up ass\"\nStreet vet, heat rep show you how to develop cash\nHella stash, keep the Calico on hella blast\nHella stash, keep my Calico on hella blast\n\n[Hook: Half-A-Mill] **repeat 2X**\n\n[Verse 3]\nI got no love, thats why niggas got no liver\nLet the fed figure why you got thrown in the river\nI'm thorough bred put the extended metal to your head\nChicks say I'm a sex symbol, pop you like your next pimple\nYour righteous? I'mma step to your Temple\nCut your legs off dawg leave you walkin off thimbles\nNow hop over the candle stick dick lets see if your nibble\nI'mma like an evil Hindu, Knievel, Willy's 6-50 through\nIllmatic, Bill Matic, peel ratchets, still at it\nMost of y'all niggas is still faggots\nOpen up your ass cheek you prolly leak ill maggots\nReal madness, thats why I keep steel for you bastards\nIn the Million Man March against me -- get a million caskets\nI'm hear to spark niggas and piss on your ash's\nRetaliatin be the next thug missin in action\nWhoeva want it they can get slugs I'm dissin off Magnums\n\n[Hook: Half-A-Mill] **repeat 2X**\n\n[Outro: Half-A-Mill]\nMill Latin, uh hu Ali Baba, yea\nWhat, street fathers, yea\nYa niggas man ya might as well not even bother son, word!", "year": null, "image": "https://images.genius.com/cdace55ea46853fe392a282bca193979.600x600x1.jpg", "title": "Salute"}]}