{"songs": [{"image": "https://images.genius.com/48a420d53ea8300fa1b58b3b9ab8d0e7.1000x563x1.jpg", "album": null, "title": "Dear Microsoft", "lyrics": "[Verse 1]\nDear Microsoft\nHi, I'm Dan Bull, I write rap verses\nAnd this track's about your quite crap service\nYou've supposedly done countless improvements\nSo tell me how come that now it is useless?\nWhat's the ground for bringing out all this new stuff\nIf it's not as good as 2002 was?\nYour latest upgrade won't allow me to do what\nI used to be able to do without an issue whatsoever\nYou're obviously not so clever\nIf you reckon this development makes software better\nAn elementary mailbox is all it's meant to be\nBut there isn't a single thing to more effectively\nEnkindle the raw intensity of Dan's rage\nThan accessing my messages to get given a blank page\nNo matter how much I refresh it, it's the damn same\nIt's like I'm the victim of a whiteout campaign\nI down the champagne when it finally opens\nOnly to find it's too late and my ties are broke\nIt's urgent but trying to reply's just hopeless\nIt would have been quicker just to write and post it\nA service so unreliable is unviable\nIt's undeniable so trying to have me done for libel\nIs undesirable, I'd provide you with the details\nIn an email but you wouldn't find it because\nA) It wouldn't arrive at all\nAnd B) I couldn't write it anyway 'cause there's so much of it, it's undescribeable\nI would like a refund for all the wasted time that you give me\nIs this what you mean by The New Busy?\nI'm too busy now, my day's too stressful\nNot cos I'm successful but cos Hotmail's dreadful\nIt's leaving me feeling off-kilter\nImmune system weaker than your spam filter\nAnd what's with the file transfers on MSN?\nI tried to send a picture to my best friend\nDragged the link into the window but it got all compressed then\nI'm not impressed. 640 by 480?\nI thought these days shit was all HD\nI don't need a \"paste this to Facebook\" facility\nJust a faithful communication utility\nSilly me for thinking the ability to link is\nPretty obligatory in this day and age but\nThat's yet another thing you dicks have disabled\nNow I have to click away to bring a seperate page up\nSelect the link, copy the text and then paste\nWhat the F MSN are gonna do next\nI'll never guess except I bet it's a mess\nCause every change that's made by the boffins is another fail nail in the coffin\nI've been trying to stay away from the Gmail doctrine\nBut unless it gets better then I'm left with no option", "year": "2011-02-02"}], "artist": "Dan Bull"}