{"songs": [{"album": null, "year": "2017-01-16", "title": "High for Hours", "image": "https://i.genius.com/bd0d6dbc24d2e548d15b35819a15e3f6b79c1de2?url=https%3A%2F%2Fi1.sndcdn.com%2Fartworks-000203161147-wc6unj-t500x500.jpg", "lyrics": "[Intro]\nThis is called being high as shit, for hours\nThat's the name of this song, nigga\n\"High as Shit for Hours\"\nHere we go, yeah\n\n[Verse 1]\nAmerican hypocrisy, oh, let me count the ways\nThey came here seekin' freedom\nThen they end up ownin' slaves\nJustified it usin' Christianity which saves\nReligion don't mean shit, there's too much ego in the way\nThat's why ISIS is a crisis\nBut in reality this country do the same shit\nTake a life and call it righteous\nRemember when Bin Laden got killed, supposedly?\nIn a hotel lobby after a show, was noticin'\nThese white ladies watchin' CNN, coverin' the action\nThey read the headline and then they all started clappin'\nAs if LeBron had just scored a basket at the buzzer\nI stood there for a second\nWatched them high-five each other\nFor real? I thought this was \"Thou shalt not kill\"\nBut police still lettin' off on niggas in the Ville\nClaimin' that he reached for a gun\nThey really think we dumb and got a death wish\nNow somebody's son is layin' breathless\nWhen I was a little boy my father lived in Texas\nPulled up in Toyota, drove that bitch like it was Lexus\nPut my bag in his trunk and headed off for Dallas\nOut there for the summer, feelin' just like I was Alice\nLost in the Wonderland where niggas still sufferin'\nJust like they was back home, and that's wrong\nSo now it's \"Fuck the government!\"\nThey see my niggas strugglin'\nAnd they don't give a fuck at all, and that's wrong, yeah\n\n[Hook]\nThe type of shit that make you wanna\nThe type of shit that make you wanna let go\nThe type of shit that make you wanna\nThe type of shit that make you wanna let go\n\n[Verse 2]\nI had a convo with the President, I paid to go and see him\nThinkin' about the things I said I'd say when I would see him\nFeelin' nervous, sittin' in a room full of white folks\nThinkin' about the black man plight, think I might choke\nNope, raised my hand and asked a man a question\nDoes he see the struggle of his brothers in oppression?\nAnd if so, if you got all the power in the clout\nAs the President, what's keepin' you from helpin' niggas out?\nWell, I didn't say \"nigga,\" but you catch my drift\nHe looked me in my eyes and spoke and he was rather swift\nHe broke the issues down\nAnd showed me he was well-aware\nI got the vibe he was sincere and that the brother cared\nBut dawg, you in the chair, what's the hold up?\nHe said, \"There's things that I wanna fix\nBut you know this shit, nigga: politics.\"\nDon't stop fightin' and don't stop believin'\nYou can make the world better\nFor your kids before you leave it\nChange is slow, always has been, always will be\nBut fuck that, I'ma bust back 'til they kill me\nChange is slow, always has been, always will be\nBut fuck that, I'ma bust back until they kill me—feel me?\n\n[Hook]\nThe type of shit that make you wanna (Aight, third verse)\nThe type of shit that make you wanna let go\nThe type of shit that make you wanna\nThe type of shit that make you wanna let go\n\n[Verse 3]\nHere's a thought for my revolutionary heart\nTake a deeper look at history, it's there to pick apart\nSee, the people at the top\nThey get to do just what they want\n'Til after a while the people at the bottom finally get smart\nThen they start to holla \"Revolution!\"\nTired of livin' here, destitution\nFuck that lootin'! Can you tell me what's the best solution?\nI used to think it was to overthrow oppressors, see\nIf we destroy the system, that means we'll have less of greed\nBut see, it's not that simple\nI got to thinkin' about the history of human nature\nWhile this instrumental played\nThen I realized somethin' that made\nMe wonder if revolution was really ever the way\nBefore you trip and throw a fit over these words I say\nThink about this shit for a second, you heard the way\nThe children in abusive households grow up\nKnockin' girlfriends out cold—that's called a cycle\nAbused becomes the abuser and that's just how life go\nSo understand\nYou get the power, but you know what power does to man?\nCorruption always leads us to the same shit again\nSo when you talk 'bout revolution\nDawg, I hear just what you sayin'\nWhat good is takin' over\nWhen we know what you gon' do?\nThe only real revolution happens right inside of you\nI said, what good is takin' over\nWhen we know what you gon' do?\nThe only real revolution happens right inside of you, nigga\n\n[Hook]\nThe type of shit that make you wanna\n(High for hours, nigga)\nThe type of shit that make you wanna let go (Volume one)\nThe type of shit that make you wanna\nThe type of shit that make you wanna let go"}], "artist": "J. Cole"}