{"artist": "Pastor Troy", "songs": [{"album": "By Any Means Necessary", "title": "Crank Me Up", "image": "https://images.genius.com/5b7b2cc12eb081fc5c59e26543a0bc75.500x500x1.jpg", "lyrics": "[Intro]\nYeah\nYeah!\nPT Cruiser, baby\nHey, yo, we want everybody to crank this motherfucker up, nigga\nCrank this joint loud, nigga\n\n[Bridge]\nCrank me up\nPT, baby, it's bout to get buck\nI don't know maybe you never heard of\nCaught 'em in the back of the club with black gloves\nHard as a hammer, I am Atlanta\nAs soon as I step on the scene it's lights, camera\nAction, cashing fat ass checks, my Rolex\nWill make you faint\nYou think I ain't\nI hit the bank with 50 grand just to spend tonight\nNah, um, pass me them bills, mama, I got a flight\nLear, listen here, private jet at the door\nA bad ass ho, into the clouds I go\n\n[Verse 1]\nThe underground putting it down for 5 years\nThe blood, the sweat, the motherfucking tears\nI'm living the life of a young drug lord\nI'll blow this heifer up if I get bored\nNow, ease up shorty, let the G slide through\nAnd I don't leave without my .32\nTucked in the boots, tucked in the coat\nAnd when I see Chuck, it's gon' get tucked in his throat\nAnd 'Murder She Wrote', but hell, I can't read\nStab the ho, kidnapped the bitch seed\nAnd now I'm on the loose, now I'm on the run\nFuck that shit, I go and get a bigger gun, yeah!\n\n[Verse 2]\nMotherfucker, nigga, crank me up\nIf you don't give a damn, nigga, we don't give a fuck\nI bought ya CD, my man, y'all suck\nDone sucked a cracker dick in the office and came up, get it\nNever wore a vest, yeah, nigga, test\nD.S.G.B. across my motherfucking chest, nigga\nYes, nigga, picture me [?]\nWhen I done been raised by all these G's\nThe crooks and killers is my motherfucking niggas\nJab a pussy with some motherfucking scissors\nThis a motherfucking crime scene\nI'm dumping on the law, my nigga, by any means\n\n[Bridge]\nCrank me up\nPT, baby, it's bout to get buck\nI don't know maybe you never heard of\nCaught 'em in the back of the club with black gloves\nHard as a hammer, I am Atlanta\nAs soon as I step on the scene it's lights, camera\nAction, cashing fat ass checks, my Rolex\nWill make you faint\nYou think I ain't\nI hit the bank with 50 grand just to spend tonight\nNah, um, pass me them bills, mama, I got a flight\nLear, listen here, private jet at the door\nA bad ass ho, into the clouds I go, yeah!\n\n[Hook](x2)\nCrank me up\nIf you a gangster, you need to crank this up\nIf you don't give a damn, nigga, we don't give a fuck\nPastor, baby, 'bout to crank this up\nNigga, crank me up", "year": null}]}