{"artist": "Aminé", "songs": [{"title": "DR. WHOEVER", "album": "ONEPOINTFIVE", "year": "2018-08-15", "image": "https://images.genius.com/57a5f41f49c164e784bf0e43df5535af.640x640x1.jpg", "lyrics": "[Intro: Rickey Thompson]\nSad on your muthafuckin b-day? Bitch, what the fuck?! Don’t you realize you poppin'? Every time you walk in the room you break necks. Necks?! But you tellin' me you sad on your muthafuckin' b-day?\n\n[Verse 1]\nI sit here and tell you my problems, that’s how this work, right?\nI’m s’posed to be open and honest, but I got time, right?\nMy niggas having seshes and I’m doin' sessions\nCan’t man up if masculinity your only weapon\nMan, I’ve thought about suicide a hundred times\nBut, I'd hate to disappoint and see my momma cry\nBirthdays these days be the worst days\n'Cause I know I’m gettin' older and not happier\nMe and my father love each other but we barely show it\nHe hates that I left home and the lawn is now his to mow it\nHe look at my generation and think that fashion's over\nI kill my sister if she ever model Fashion Nova (True)\nI'm always on a flight, or I'm in a hurry (Yeah)\nI miss when losin' my virginity was my only worry (Yeah)\nBack when puttin' on a condom had me really scary (Scare)\nAnd milkshakes were the only time we'd eat a cherry\nI think learnin' how to eat pussy from someone who eat pussy\nIs better than learnin' from someone who doesn't\nAnd that's word to my ex and that's word to my tongue (Yeah)\nAnd that's word to the woman\nWho had my heart beatin' drums (Drums, drums)\nYeah, love is what I cherished and Miss Parrish (Yeah)\nFlew all the way to Paris and we made out on my terrace (Yeah)\nI kept it on the low low, 'cause I was in love (Love)\nAnd the shade I had in my room was already enough ('Nuff)\nI'm goin' on some dates and I'm makin' some plans\nBut it's hard to find some love if the girl is a fan (Fan)\nAnd after we fuck, she want a picture with me\nShe got me feeling like Paper Boi, but I cry when she leaves, yeah\n\n[Chorus]\nThese intros ain't meant to be bangers\nThey meant for you and me so we'll never end up as strangers\nWill Ferrell's ass can't even handle this weather\nTune in your speakers and please be my Dr. Whoever\nI said, I said, these intros ain't meant to be bangers\nThey meant for you and me so we'll never end up as strangers\nWill Ferrell's ass can't even handle this weather\nTune in your speakers and please be my Dr. Whoever\n\n[Interlude]\nYeah, uh-huh, uh-huh, woo\nYes sir, yeah, look\n\n[Verse 2]\nBoy, you lookin' big mad\nWhen you see a young brotha up in first class (Yee!)\nAnd you damn right my ego like Lavar Ball (Yuh)\nThey hate to see a black man who can't get blackballed (Skrr!)\nI said my paper long (Yuh), my paper long (Yuh)\nYou damn right, bitch (Bitch), my paper long\nIt's that yellow, mellow, fellow, yeah, that Yellowstone (Hey!)\nPlay the cello for the fellows, fake as silicone (True!)\nI went from plaque in my teeth to havin' plaques on the wall\nGold album with platinum records\nWho woulda thought? (Uh-huh!)\nYoung nigga, like Jigga, tryna make me a boss\nI'll take my momma to Louis and take your girl to the Ross, nigga\nBack in the muthafuckin' building (Yuh)\nYour boo thing want my children (Yuh)\nMy net worth gon' be billions (Bih!)\nShorty gimme head like ceiling (True!)\nDick disappear, chameleon (True!)\nAnd like I'm muthafuckin' rollin' (Yee!)\nMy whip bought, it's not stolen (Brrr!)\n\n[Chorus]\nThese intros ain't meant to be bangers\nThey meant for you and me so we'll never end up as strangers\nWill Ferrell's ass can't even handle this weather\nTune in your speakers and please be my Dr. Whoever\n\n[Verse 3]\nHey doc, do I tell em how I actually feel? (Yeah)\nOr do I see a therapist and numb the pain with the pills\nThis for niggas play tough won't even smile in mirrors (Nah)\nAnd we learned to fuck hoes off trial and error\nFriday nights, where them broke niggas ball out\nAnd Aminé be the name that your girlfriend gon' call out (Call out)\nTo all my niggas with some melanin, let your feelings settle in\nIf you feelin' worthless (Yeah)\nYou should probably go and tell a friend (Tell it)\nYeah, but, I should take that advice\nThis year has been crazy, what the fuck is my life? (What)\nMy best friend got married, you can bet that I cried\nI met Spike and Brad Pitt, no malls, I'm Saks Fifth, nigga (Errr!)\n\n[Outro: Rickey Thompson]\nGet your shit together and turn the fuck up!"}]}