{"songs": [{"title": "Letter To God", "lyrics": "[Intro]\nZaytoven\nYeah, I keep this shit so real\nI had to write a letter to God\nHaha\n\n[Chorus]\nPlease God, can I have my niggas back?\nPlease God, can I have my niggas back?\nThey restin' in peace (Yeah), Or in jail for the G (Jail for the G)\nGod please bring 'em back to me (Please, God)\nI know you did a lot of shit for me (Young Scooter)\nBut thats the only blessing I didn't receive (Please)\nI just want my niggas back, can I have my niggas back? (Yeah)\nPlease God, can you bring my niggas back? (Yeah)\n\n[Verse 1]\nWhere all my real niggas at? (Yeah)\nAll that slick talkin'll get you BLATT! (Count up, nigga)\nLil Mexico City, thats where we at (Lil Mexico City)\nThey like why you rap about dope, thats getting whack (Cocaina tricks)\nI pray to God they free Guwop\nHe took a chance on me, I fucked around and got caught up (Salute)\nTwo months later they got both of us locked up (Damn)\nSame cell, he saying, \"be cool, bro, God's got us\" (Fuck)\nPlease God bring the real niggas back\nPlease God bring my niggas back\nWent to jail then lost Double (OG D)\nThink about him everyday, God bring him back (Yeah)\n\n[Chorus]\nPlease God, can I have my niggas back?\nPlease God, can I have my niggas back?\nThey restin' in peace (Yeah), Or in jail for the G (Jail for the G)\nGod please bring 'em back to me (Please, God)\nI know you did a lot of shit for me (Young Scooter)\nBut thats the only blessing I didn't receive (Please)\nI just want my niggas back, can I have my niggas back? (Yeah)\nPlease God, can you bring my niggas back? (Yeah)\n\n[Verse 2]\nUncle Skip died in my face shooting dice (Damn)\nShootin' two bad, three crapped out, had a heart attack and lost his life\nLil Scooter walked through the cut in my grandmas house and passed out\nAnd large [?] with his lil 'cuz, he was starved out\nMy cousin Travis killed his wife and himself too (Shits crazy)\nIts a shame what that pussy do (Damn)\nYeah, so God have mercy on Street\nMy grandaddy died and fucked up the family (Damn)\nDear God, I need to talk to OG D (Please)\nWhere the hell he put that fuckin' safe key (Yeah)\nHe loved me and OG Boo Dirty (Yeah)\nKilled a real OG for ten thousand, they worth it (Fuck)\n\n[Chorus]\nPlease God, can I have my niggas back?\nPlease God, can I have my niggas back?\nThey restin' in peace (Yeah), Or in jail for the G (Jail for the G)\nGod please bring 'em back to me (Please, God)\nI know you did a lot of shit for me (Young Scooter)\nBut thats the only blessing I didn't receive (Please)\nI just want my niggas back, can I have my niggas back? (Yeah)\nPlease God, can you bring my niggas back? (Yeah)\n\n[Verse 3]\nYou rappers say the wrong shit on tracks (Yeah)\nReally I'm just fuckin' up the traps (Fake rappers)\nGo listen to the Ten Crack Commandments (Yeah)\nWish I could bring B.I.G. back (Richie Porter too)\nYeah, but I Ain't Mad At Cha (No)\nBut I know Pac laughed (Hahaha)\nI wish I could bring Aaliyah back (Bring Aaliyah back)\nI'd let her sing on all these dope boy's track (Young Scooter)\nSo caught up in the streets I didn't know God's prayer\nAin't went to church in fifteen years, ma was mad as hell (True story)\nAnd when I fly to do a show, she be scared as hell\nYou niggas try to count me out, but I'm still here (Young Scooter)\n\n[Chorus]\nPlease God, can I have my niggas back?\nPlease God, can I have my niggas back?\nThey restin' in peace (Yeah), Or in jail for the G (Jail for the G)\nGod please bring 'em back to me (Please, God)\nI know you did a lot of shit for me (Young Scooter)\nBut thats the only blessing I didn't receive (Please)\nI just want my niggas back, can I have my niggas back? (Yeah)\nPlease God, can you bring my niggas back? (Yeah)", "album": "No Mo Struggle", "year": "2015-10-20", "image": "https://images.genius.com/e5d1c3769fcbdec05bf1cc22065779ef.640x640x1.jpg"}], "artist": "Young Scooter"}