{"artist": "Isaiah Rashad", "songs": [{"title": "Sydney Jones", "lyrics": "[Verse 1: Isaiah Rashad]\nMan coming from a city where the heater bang\nNooga shooter Ruger, kill your brother that's that local fame\nAlways gave a fuck so much my Dockers wasn't Dickies man\nGotta keep it pimping James stomped them out, 44 deep, over cookies so\nImagine what they do to niggas acting like some pussy man\nAustin daddy left him so abrupt now he hitting stains\nType of shit, make me say prayers for all my players\nI’m here for all your fears you sell, I gotta scale\nIt’s real, riding, riding with my brother and his Lincoln\nGot me thinking of get rich schemes for all my people\nAnd maybe I should talk to my daddy, good karma\nBut fuck it I’m still stuck in these panties\nTake relations for granted ‘stead of lowering standards\nI did blow I didn’t plan it I’m understanding these addicts\nCan you manage your habit? can you honestly practice?\nAll that shit that you preaching? always misplacing my glasses\nBut always peeping the evil like, I see it clear now\nLike back in high school you’re the one that’s acting weird now\nHad a baby in the 9th grade, shes old enough to cheer now\nYou see us getting money put that motherfuckin’ beer down\nWe’re here now\n\n[Break: Isaiah Rashad]\nWe here now mothafucka\nI think we need some motivation\nWe’re here now mothafucka\nGive me that Sydney Jones pussy\nI think we need some motivation\n\n[Verse 2: Michael Da Vinci]\nMany nights I shot ball 'til lights\nCut off on flight so probably fell my life\nMy momma was probably right I fill shoes to height\nThat Kobe could fit ‘em tight these niggas here is light\nTo get ahead they living like parasites and mice\nAnd pussy will make them fight, I’m be sippin' this fucking sprite\nFor fillers I couldn’t write my big homie had died\nFor niggas who living lies he’s six feet from life\nI hope heaven treating him nice, why good die in spite?\nWhen Sydney Jones get piped, she young, black, and trife\nMy light skin advice, she keep me hooked like Phife\nMy electric relaxation, her thighs give me escapism\nWith music make me anxious, nigga be all tasteless\nSometimes I feel like hatred will kill me if I do make it\nThree stacks vacations, secluded living locations\nIllest amount of payments to bank accounts that I’m making\nSeasons changing for us and we adding a couple faces\nThese niggas get funny so Benjamin keep me racing\nEverybody a actor wanna be the leading faces\nSo get your acting right the directors giving our placements\n\n[Outro: Michael Da Vinci and Isaiah Rashad]\nMy niggas die for it, she got that pussy juice\nI could lie for it, that pussy the truth\nYou got some time boy, then get some pussy too\nI’m the nigga baby, what that pussy do\nMy niggas die for it, she got that pussy juice\nI could lie for it, that pussy the truth\nYou got some time boy, go get some pussy too\n(Give me that Sydney Jones pussy\nI think them niggas need some motivation)", "image": "https://images.genius.com/ed51814925ca7500559f72f430822940.500x500x1.jpg", "album": "XXL Freshmen 2014 Mixtape", "year": "2014-06-16"}]}