{"songs": [{"year": null, "title": "Down The Road", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "[Intro/Hook]\nI've been down this road befooooore\nI'm still, I'm still who you're lookin for, ohhh\nI been lookin for a place to hiiiiide\nI feel, I feel your eyes\nSee right through my lies\nAhhh-ahhhhhhhh...\nMy lies\n\n[Verse 1-Saigon]\nUh-huh\nThese young artists is strivin, they say it's hard survivin\nThey only authorizin the rappers that's harmonizin\nTelling them to not to worry, music is just modernizin\nI beg to differ cause if you look upon the horizon\nYou see a star is risin and go by the handle Brian\nHe like a man of iron compared to these dandelions\nAnd what comeback? The underground I been run that\nIt just suck, I'm so stuck to the street like a run flat\nThough it only take one track to get you back on my nutsack\nI'm feelin like \"Where the fuck is the love at?\"\nI might as well make it rain, sleet, snow, hail in this dry spell\nI might as well come out of my shell, hell\nCause hip-hop ain't been the same since I left it\nAnd tryin to be positive I guess was the wrong method\nCause you could bring a dick to the pussy but you can't make him F it\nNow look what I'm left with - this\n\n[Hook]\n\n[Verse 2-Saigon]\nWe got a black prez, still a lot of crackheads\nMy grandmother still can't afford her back meds\nKRS already taught us 'bout them black feds\nThey don't wanna see us live, should we act dead?\nThen they wonder why niggas rockin that red\nIt's the only sensible lifestyle, that they ever lead\nTry and put it in his head\nThe more Bloods that's on the block the more blood that's gon' shed\nCh-check what he said\nHe said out here dodgin the mortuary is not outta the ordinary\nOur people is so poor that it's scary\nCause when we in a war we ain't worried\nLike a young G in the street is how I wanna be buried\nLook shorty, you put it wrong, here go a thinkin cap\nNow put it on, with that mentality you're as good as gone\nLyin there with the bystanders lookin on\nI ain't tryin to cook it calm, I'm tryin to put you on\n\n[Hook/Outro]\nI've been down this road befooooore\nI'm still, I'm still who you're lookin for, ohhh\nI been lookin for a place to hiiiiide\nI feel, I feel your eyes\nSee right through my lies", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}