{"artist": "Phora", "songs": [{"album": null, "title": "Open Letter", "image": "https://images.genius.com/a90f2fab66d37361458156ff96992d50.600x600x1.jpg", "lyrics": "[Verse: Phora]\nI had to do this for my city once\nThis for my Anaheim niggas rolling blunts\nAnd I can't forget Santa Ana\nCause it not about where I'm at\nIt was always about where I'm from\nFrom a place where they quick to snatch your life\nPut your feet in my shoes and you couldn't last a night\nThese rappers are rapping like claiming savage life\nBut me, I know the difference in real life and rappers life\nWhy team and a team is back and strong\nThey thought they was killing it, that ain't last for long\nThese rappers talk guns and these kids rap along\nStop lying, you ain't in the dope house, you at your moms\nThat's not the boy she raised, how dare you disrespect her\nSwear I feed off these niggas like I was Mr. Lecter\nWatch my words eat away at their ego's\nCause you can have all goons in the world\nAnd they can't protect ya\nYou live a fraudulent life, you was never real\nI'm dropping that fire just like I said I will\nTo the rappers that keep it real, man I see you\nBut you need to come to Yours Truly records for a better deal\nSo fuck what they say and homie I got enough\nNow I ain't tripping, now listen I'm quit to call your bluff\nAnd I'm killing these rappers, its all for fun\nCause I don't hate not a soul in this world\nExcept for Donald Trump\nKeep the hate mail coming, that shit just motivates me\nThe thought of me making it probably drives you crazy\nI'm hitting one-eighty, how can you blame me?\nAnd I always keep a smile cause even a bullet couldn't take me\nThey the type to follow, bitch I break the rules\nBoy you know you ain't no thug, you should've stayed In school\nI guess I'm the one to break the news\nYou need to spend less time on Worldstar\nAnd more time making moves\nI ain't got shit to prove to a fucking soul\nMiddle finger to the world, watch me fuck her slow\nSitting here like what the fuck happened to rap?\nMan, it used to be music\nBut now its just a muhfucking puppet show\nIt's gon' be a minute before we finish nigga\nYou telling stories, not living it, there's a difference nigga\nMost of these rappers whole lives is rented\nWhy you say in a Bentley when you really in a Civic nigga?\nYeah, I could tell, I could tell when they fronting\nYours Truly, ask around, they gon' tell you we coming\nAnd I tried to tell 'em not to push my buttons\nNow we taking over, no room for discussion\nMuhfucker, whats up?", "year": "2016-01-24"}]}