{"artist": "Benzino", "songs": [{"lyrics": "[Intro: Benzino]\nYeah..\nYou thought it was over?\nNah..\nYou can't get rid of me..\nI'm the arch nemesis..\nAnd I'm not stopping..\nUntil I've acomplished what I've came here for..\nComplete elimination\n\n[Verse 1: Benzino]\nIt's about to be the death of Slim Shady\nA little over 2 years, he still can't face me\nThat shit you pulled in the D was a slick move\nYou should have got Dave, cause now I'ma get you\nAnd I ain't even pressin up on a ya like i should\nBetter double up on ya security, wish a nigga would\nTryin to run up on the station, and I'll be waiting\nWith fully automatics, blowin out your patients\nYou got a fucking nerve taking me to trial\nCopyright infringement, you said it was a freestyle\nAnd you lied about your age, you was 21\nNever ever make a move with an empty gun\nI'll go to war, never fold, snipe you on the fifty yard line\nWhy you talkin this way? And why you walkin with Dre?\nIt don't matter, catch you at a show, you ain't built for battle\n\n[Chorus]\nIt was me..\nThat made you stop doing shows in the States\nIt was me..\nThat made you get Pauly on a tape\nIt was me..\nThat made your uncle put the burner to his face\nIt was me..\nThat got your boy Proof served in Miami\nIt was me..\nThat struck a nerve when i said fuck Hailie\nIt was me..\nThat ultimately put an end to Slim Shady\nVerse 2\n\nYo, Pauly tell me on the telly, you a light weight\nSuck it motherfucker cause he's the same way\nYour whole circle's just a bunch of little bitches\nTap dancing niggas, weight lifting snitches\nAnd I know I didn't hear you say you help my career out\nYou a puppet, sittin like a kid in Jimmy's lap\nMakaveli rollin over in his grave\nYou fuckin' up his music, the beats don't pay!\nAnd where's your girl Kim, I need to get my dick sucked\nI heard she like coke, she wanna get her face fucked\nBut I ain't freakin with no trailer park trash\nI'll leave that shit to you Marshall Mathers (Outkast)\nWhats the use of having papers, if you hide it\nI can see the Source Awards, but missing at the Vibes\nHow can you call yourself the number one rapper\nXXL showing love to a cracker!\n\n[Chorus]\n\n[Verse 3: Benzino]\nI heard on the radio, you said you wanna squash beef\nIt's kinda funny, to me this shit was never beef\nPuerto Rico with the burner in hand\nRan up on Green Lantern\nHe almost shit in his pants (Damn!)\nRaise the white flag, I'm charging up the hill\nNail in the Coffin? I'm impossible to kill!\nI'm your worst nightmare, the reaper in the flesh\nIts a fight till the finish, a battle till the death\nDressing like a woman to sell a few copies\nDisrespecting Michael, Em you getting sloppy\nYour album's atrocious, Jimmy's scared in double\nFuck D12 cause their careers are in trouble\nAngela get their nuts up out your mouth\n[?]  a dick rider, I'll lay these niggas out\nAnd everybody else who wanna try and hold ya\nCause in all reality you're the only toy soldier!\n\n[Chorus]", "image": "https://s3.amazonaws.com/rapgenius/91e679c8210dab2c79d0611be49e28ef.jpg", "year": null, "title": "Built For This (Eminem Diss)", "album": null}]}