{"songs": [{"album": "Life on Life", "year": null, "title": "Who is He", "image": "https://images.genius.com/47ed6f727e34a8fcaf81f6743e4943fc.1000x1000x1.jpg", "lyrics": "[Verse 1 – Lecrae]\nYeah … walked out of his home, different time zone\nLives in eternity, now he’s living in time zones?\nThis is mind blowing, God of the universe\nKnows every star in the sky to my human hurts\nMade the trees, made the breeze\nMade the seas, emcees like J and me\nBut let me tell you what amazes me\nHow he came as a man who was made to need\nHungered and thirsted\nAnd the very same earth that he cursed, he’s now fully immersed in\nLook at his work, he’s God to be exalted\nBut he came and lived with people falling and faulted\nI hope you get it homes\nOnly a God who’s perfect in love would ever leave his throne for some skin and bones\nIt’s hard to live just breathing to death\nWhen the same God that made you is breathing your breath\n\n[Hook – Json & Lecrae]\nWho is he?\nGod in the flesh who was tested\nWho came manifested, was killed, resurrected\nWho are you?\nDo you even know who you are?\nCreated to know the God who created the stars\nWho is he?\nHe was, he is, he will be\nDeath couldn’t hold him and neither shall death seal me\nWho are you?\nYou’re better off never existing if you don’t trust the God of the Scriptures\nYou listenin’?\n\n[Verse 2 – Json]\nCan you imagine God in the flesh? Invisible seen as visible\nInfinite seeming finite, spirit becoming physical\nIt’s odd man, God man slept and obeyed\nThe earth’s confines, to breathe the very breath that he made\nHe would sweat, he would weep, even eat for his hunger\nDefeat death within three, so we’d see that he’s stronger\nCould give us anything even offer us wealth\nThat wouldn’t be love if he ain’t offer himself\nSo he stepped down from his throne and removed his crown\nAnd touched ground, though he knew he would be bruised and bound\nHe is now and then next and later on\nAnd still is what me and Crae can’t convey in this song\nThough our minds can never reason this thang\nThe question is: do you really see him the same?\nAnd if you see him as sane, as the living God and matchless Christ\nHow much do these truths impact your life?\n\n[Hook – Json & Lecrae]\n\n[John Piper]\nIn order for Jesus to suffer and die, he had to plan way ahead of time, because … he couldn’t die. Immortal. He didn’t have any body, yet he wanted to die … for you. So he planned the whole thing by clothing himself with a body so that he could get hungry and get weary and get sore feet. The incarnation is the preparation of nerve endings for the nails – the preparation of a brow for thorns to press through. He needed to have a broad back so that there was a place for the whip. He needed to have feet so that there was a place for spikes. He needed to have a side so that there was a place for the sword to go in. He needed fleshy cheeks so that Judas would have a place to kiss and there would be a place for the spit to run down that the soldiers put on him. He needed a brain and a spinal column with no vinegar and no gall so that the exquisiteness of the pain could be fully felt. I just plead with you – when you’re reading the bible and you read water toy texts like “he loved you” and “gave himself for you,” you wouldn’t go too fast over it. Linger, linger, linger, and plead with him that your eyes would be opened"}], "artist": "Json"}