{"artist": "Fat Joe", "songs": [{"year": "1998-09-01", "album": "Don Cartagena", "image": "https://images.genius.com/f5c1dde7c10db5efcf281667957c213d.953x953x1.jpg", "lyrics": "[Intro: Layzie Bone]\nYea, What's happenin'? Bone Thugs~n~Harmony\nFat Joe, Terror Squad, Mo' Thugs\nThe Good Times nigga, we on top of the world 2x:\n\n[Hook 2x: Krayzie Bone (Layzie Bone)\nGood times, good times we can have a good time..\nWe havin' a big celebration\n(We could take some stress off our chest)\n\n[Fat Joe]\nYo, Check my philosophy - Happiness ain't all about monopoly\nI put aside the guns & robberies, see good guys copyin' me\nThe good times is here, rainy days is clear\nYou wanna go where everybody knows your name like \"Cheers\"\nWhere problems is all the same and we got stories to share\nWhere you don't have to look for joy in a bottle of beer\nSee what I'm sayin? Stop feelin' sorry for yourself\nBesides, those shots of Jack Heed's bad for your health\nUnderstand tough people last, tough times don't\nSome get up off they ass, and nigga, some just won't\nTake the bad with the good, cuz the good ain't far\nThis is the stuff dreams are made of - shoot for the stars\nThe good times\n\n[Hook]\n\n[Bridge: Krayzie Bone:]\nBig Celebration, we havin' a big celebration\nWe havin' a big celebration\nCelebration, [bration] celebration, big celebration\nHey we havin' a celebration\n\n[Krayzie Bone]\nHavin' a wonderful day\nRememberin' the good times\nAnd the niggas who ain't here for the celebration\nWe roll up a blunt, and pour out the liquor\nWhateva you want, we got it\nIt's probably in there, plenty reefer\nSmoke is blowin' in the wind yeah\nJust inhale, exhale...\nFeel it whateva your problem is, it won't be one no more\nAnd if you're laid off [Good times]\nSit down and take a load off\nYou deserve it, fuck what you heard, fuck the world\nAnd let the Buddah soothe ya, ooh ya\nBetter not let the quicker system \"Boo\" ya\nKrayzie makes the world. I thenk God for my good times\n[My good times, my good times]\n\n[Hook]\n\n[Bridge]\n\n[Fat Joe]\nYeah, uh, Now I'm 25, and It's a brand new scene\nI'm makin' rap pits straight flossin' on the TV screen\nKnow wha' I mean, life's sweet to me\nIn times we used to front, now speak to me\nI'm feelin' all right, keepin' them girls happy all night\nBaby hold tight, when Joey takes you for a long ride\nWhat was once a dream is now reality\nAnd I'm glad I never listened to haters thet said it'd never be\nRemember me? the fat kid from Trinity\nWho was once a public enemy is now a loved celebrity\nIf Joe could do it, It could happen to you\nSet goals, and keep your weight up\nAnd good times'll come through. What? [what, what?]\n\n[Hook]\n\n[Bridge]", "title": "Good Times"}]}