{"artist": "Pink Guy", "songs": [{"album": "Pink Season", "title": "Nickelodeon Girls", "image": "https://images.genius.com/176ec7cd55a78c0fcb8c2560fa88283c.1000x1000x1.jpg", "lyrics": "[Intro]\n(Hello, Nickelodeon headquarters)\nHi, sorry to disturb you this-this late in the night\nUh, I-I have a serious inquiry directed toward Nickelodeon, uh\nMy question is, what the fuck are you doing?\nYou know, y'all used to have some fire bitches\nWhen I turn on the TV I'm trying to see my favorite bitches\nZoey 101? Jennette McCurdy? Oh my God, ugh\nAnd now all you got is these preteens\nBruh, I'm not a pedo\nI'm not trying to look at these little kids and get aroused, mrrr\nNow I can't watch Nickelodeon with my dick in my hand anymore\nNow I'm fucking upset\nThis is some fucking bullshit\nMrrrr!\n\n[Verse]\nDan Schneider\nBring all my bitches back\nI need all my bitches, I need all my bitches\nThe new shit you put out is wack\nDan Schneider\nI'm just trying to get an erection\nBut now that these kids looking 13 and under\nMy penis will suffer\n\nDan fucking Schneider (Schneider)\nThis ain't a fucking game, bitch\nI wanna watch a sitcom\nWith my hand on my dick\nI wanna see a titty (Titty)\nNot fucking kid shit\nReturn all the hot chicks\nOr you gon' get it, bitch\n\nICarly, iCarly\nI don't care if you look like Michael Jackson\nAs long as you giving me action\nAnd Freddy gon' film the reaction\nSam gonna join in\nAnd suck me a fat one\nNickelodeon girls\nCan't live without 'em (Whew)\n\nAriana Grande (Ariana Grande)\nI know I drive a Hyundai (I know I drive a Hyundai)\nI can put you in a coma (I can put you in a coma)\nHave brunch on a Sunday (Have brunch on a Sunday, fancy)\nMy dick put you in a coffin\nAll night screaming and tossing, ugh\nVictoria Justice\nI know you tryna touch this\n\nLizzie McGuire is tight\nBut I bet Zoey's tighter\nYou can find me in her bed\nDigging through that vaginer\nAmanda Bynes, you a little bit crazy\nBut you can still have my babies (Whew)\nGo down like a dog with the rabies\nY'all can't save me\n\nUh, a little bit of weed, hard liquor for the ladies\nGot me feeling like a young Dan Schneider from the 80's\nWith a Jewish law firm and an all black Mercedes\nShe playing with the balls like Brady (Ay)\nFuck off with the shitty little kids with their stupid shit\nI only wanna see the ones with a body fit\nAnd I don't want to be the one to be a little bitch about it\nBut I'm just saying what everybody is thinking (Hahahahaha)\nWhere the titties at?\nDan Schneider why you ruining your business?\nYou realize I'd probably buy cable if you keep all the girls\nAnd the ratings all stable\n'Cause I ain't tryin' to see a young baby in the cradle\n'Cause I'm not a pedophile\nI'm not trying to see that shit (C'mon man)\n\nThe girls I have sexualized are all in their 20's and 30's\n(Disclaimer!)\nI'm not saying you should change all the bitches\nBut at least something after 10:30 (30!)\n\nDan Schneider\nBring all my bitches back\nI need all my bitches, I need all my bitches\nI need all my bitches back\n\nI love you Dan Schneider, just please bring them back", "year": "2017-01-04"}]}