{"artist": "King Los", "songs": [{"image": "https://images.genius.com/afeb378bc29956644d2a2f2a1b036b8a.1000x1000x1.jpg", "title": "Da Hood Cypher", "year": "2018-06-15", "album": "410 Survival Kit", "lyrics": "[Verse 1: Deetranada]\nYeah, ay\nWow, people mad for what?\n'Cause the kitty immaculate\nCheck you and your crew\nAnd have you wake like, 'What happened?'\nBro, nobody on my level\nThey can't even reach the ladder\nWhat's the matter?\nI'm the shawty with the rings\nOut this world, call me [??]\nOld broad want beef, that's suicide\nCaught up in your lines, that's a Houston die\nYou Whitney?\n[??] don't know, watch me aim right for the kitties\nWhy the runners?\nIf you a rapper, when I come around, you mini\nHave that work like I'm moving, got a long clip\nI be jogging around that mat like a long lip\nLike I said, since I be making it\n[??] can the rapping [??]\nIt's obvious in music 'cause [??] them\nI'm leggin and they having it\nBoom, head shot, idea\nWhere your bed at? Move along, IKEA\nNot Genuwine, mess around Aliyah\nWow, then I make you lean like Pisa\nIt's evident I'm excellent\nI had to set the precedent\nI usually go harder\nI'm just showing feature etiquette\nI settle the kettle talking I'm black and [??]\nNo, I'm black and white\nCould you tell  I ain't the childhood girl\nSuper cralifragilistic when I touch down\nFlew to Cali 'cause I haven't seen enough town\nI'm the youngest queen in charge here, the what now\nWhy you think my name is diamond, 'cause I'm bust down\n\n[Verse 2: BoxCheck Marty]\nDamn\nBoxCheck, is y'all ready? (damn)\nCash fall like confetti (damn)\nGood fellon, no [??]\nSee Wu waters like jetskis\nI'ma need you to cut that check please\nIf not, they gon' let that tec squeeze\nNew Wraith when we drive\nOr Teetar bird when that jet leave\nBalmain, Balenciaga, almighty my breezy Prada\nNigga we flyer, now we higher\nFuck niggas need to retire\nAudacity to ask me if I'd ever failed, these niggas\nI'ma real live nigga, I'm known from the diesel\nNo Shaq, I should kill these niggas (damn)\nBoxCheck, we in here, boy, I don't really think y'all ready (damn)\nFour or five cops, nigga, one damn shot turn your right hand and brain spaghtti\nGet me?\nI don't just rap, boy, I live this shit\nEleven in the feds, I done did that bitch\nThe ZLS, [??] did that whip\nBefore she [??], I'ma did that bitch (god damn)\n\n[Verse 3: Chrissy Stayhigh]\nChrissy Stayhigh Sosafina you bitch\nI'm a Baltimore baby\nI ball out the gym\nHad to bust down my wrist, I'm just glad I can swim\nTell these bitches don't test me, I ain't bring my pen\nI do more than just pray with these hands when I sin\nPop the heads off you barbies, tryna toy with my kin (Ken)\nWhen my bitches, wan (want - to) pop out, we hop in the Benz\nSame hoes used to talk down, tryn hop in the pic\nI... hit the button, sit the roof down\nLitty Chrissy bring the moon out\nUmm.. niggas iffy, Ion (I don't) do clout\nSticky icky piffy, in my spliffy, got me glued down\nShady shaky shifty, you ain't with me, gah (got-to) move round\nLor (= Lil) baby, play the fifty, then the bittie getting chewed out\nI feel like I'm Izzy Band Huntin' all these blues now\nChrissy little and she pretty, but she bring them goons out\n'Cause I'm dragging out this coochie\nNo excuse me, you heard me?\nAnd if lor (=Lil) shordy actin' boujee, she can fly with the birdies\nI got a pocket full of loose leaf but you know my shoes dirty\nAnd you won't see a nigga juice me 'cause I never been thirsty\nUmm... you rappers is trash, you get tossed out\nName ringing bells, they wan (want- to) call now?\nSame ones that prayed on my downfall\nAct like they glad I ain't fall down\n\n[Verse 4: Starrz]\nI'm ready\nRepping my trap in remarkable fasion\nY'all capping for clicks and a caption reaction\nParting my passion, I'm sick of distractions\nParting my dragon, I'm smoking, you matching?\nNo competition, bitch, don't get me laughing\nI'm from a place where you're hooping or flagging\nI'm form a place where the asses are fake 'cause they rather have asses instead of a face (woo)\nMichael Jackson flow, bitch, I been bad\nThought I might fail, bad bitches in the gym class\nI'm the present, they should put me in a gift bag\nMost of y'all washed, they should put you in a gym bag\nGimmicks, pushing as a riff raff\nTop 5, 10, I do it with no pen pad\nProfessional, projection flow, I'm over heads\nI kill careers, just hold your head\nI kill punani, just hold your legs\nThey kill the witness if he told the feds\nThey tie your mama and they hold your kids\nThey send the ransom, better sent the bread\nNo freestyling when they off their heads (sheesh)\nThat's the truth, no capping in it\nShe's on her kneeds, she's Caperknicking\nI got the head, I chopped the chicken\nBut it all makes sense, she say I'm finger licking\nWait, you see it all, but nobody knows\nYou'll get a hit but then it's adios\nSo I write every verse like I'ma body Los\nI write every verse like it's a bad of dope, a line of coke, a knife to poke, a throat to choke, a gun to tote, a blunt to smoke, a ass to stroke\nMotherfucker, I'm these rappers hope (haa)\nVisionary, scary hardest\nCold as Ben & Jerry\nBury me with greener faces, that's the Jim Carey\nBrent Barry, unexpected shooters\nNothing free, I need that check to do it\nBitch I'm nice, you better check the music\nLet me say this so you don't confuse it\nI'm the best that's living 'till they come and shoot me (god damn)"}]}