{"artist": "Cam’ron", "songs": [{"title": "Get ’Em Girls", "album": "Purple Haze (Advance)", "year": "2004-12-07", "image": "https://images.genius.com/b6f4f4bab1804fbaae0c7dd7e0b294d6.1000x1000x1.jpg", "lyrics": "[Verse 1]\nKilla.. let's go\nI get the boosters boosting, I get computers 'puting\nY'all get shot at; call me, I do the shooting\nI do the recruiting, I tutor the students\nI nurture their brain, I'm moving the movement\nWhether Buddhist or Buddha, that's Judas or Judah\nI got Luger to Ruger, hit from Roota to Toota\nChick from hooter to hooter, I put two in producers\nI'm the real ball story, the loser of \"Hoosiers\"\nI rock mostly dosey, I roll mostly dolie\nI'll leave you wholly-holey, you'll say holy moly\nHere come the coroner, get em, play Rollie Pollie\nI'll tell you true stories, how I coldly hold heat\nWhen it's repping time, I get on extra grind\nFried to fricassee, Pepperseed to Pepperdine\nJeff Hamilton, Genesis, leather time\nBitches say I'm the man, I tell em never mind\n\n[Chorus]\nThey getting nice, they got some ice\nLet's get the dice and roll em (get 'em girls)\nThey getting chips, they flipping bricks\nGet the rots and pits, tell em (get 'em girls)\nShe acting feisty, getting sheisty\nCall the wifey, tell her to (get 'em girl)\nJust lay back, get your face slapped\nWe at the race track, eight stacks (get 'em girls)\n\n[Verse 2]\nYou acting funny nigga\nCome... dumb, dummy nigga?\nKilla keep twenty blickers (I'm getting money nigga)\nSo you should move away, or join the dude 'n play\nHey, so you can say (I'm getting money nigga)\nFirst pile up in the rear, I style up in my gear\nStallion of the year: medallions in my ear\nWhips on my fists, houses on my wrists\nYour budget on my neck, your spouse on my dick\nPosters on the wall, posted on my balls\nDick in her mouth, I tell her \"I'm gettin money niggaa\"\nY'all faking the fizzle, I'm caking for shizzle\nFuck a Sizzler steak; my estates, they sizzle\nAte, boom-boom, my ace boon coon\nShake, bake, skate, vroom vroom (We gettin money nigga)\n7 to 8, zoom zoom, boom boom tune\n'Fore I get life, that boom boom room\n(I'm gettin money nigga)\nWrecks 'n Effects: zoom zoom in poon-poon\nSince the movie Cocoon, had my Uzi platoon\n(I'm gettin money nigga) Killa\n\n[Chorus]\nThey getting nice, they got some ice\nLet's get the dice and roll em (get em girls)\nThey getting chips, they flipping bricks\nGet the rots and pits, tell em (get em girls)\nShe acting feisty, getting sheisty\nCall the wifey, tell her to (get em girl)\nJust lay back, get your face slapped\nWe at the race track, eight stacks (get em girls)\n\n[Verse 3]\nMy team is the Goonies, we were seen with buffoonies\nToonies, best dressed, stay up in Neiman's and Bloomies\nWant to hit it from the back, she agreed that I'm looney\nBut proceeded to moon me (I'm gettin money nigga)\n\"Baby\" b.s. and \"honey\" do, Cam V.S. 1 and 2\nI'll help you get your son out of P.S. 22\nGet him a Mauri flow, from the Mauri show\nFuck around, y'all gonna be up on the Maury Show\nHe in bootcamp, you on food stamps\nWelfare, no health care, a true tramp\nAnd I'm lokie-lokie, leave you pokey-pokey\nNo Rice a Roni, that's the okey-dokey\nMe and Toby homie, make you do the hokey-pokey\nPull the pound, up and down, turn yourself around shorty\nHere's some weed, burn yourself a pound whoadie\nHere's a map, go learn yourself the town, sporty\nI was down 40, now I'm up 50\nBuck 50, but quickly: who could fuck with me? Killa"}]}