{"songs": [{"title": "The Mystery of Iniquity", "album": "MTV Unplugged 2.0", "year": "2002-05-07", "image": "https://images.genius.com/223n7ezbshqosz0dhiz8hrmkd.500x500x1.jpg", "lyrics": "[Hook]\nIt's the mystery of iniquity...\nSaid it's the misery of Inequity...\nSaid it's the history of Inequity...\nWhen it all...\nAll falls down...\nTelling you all...\nIt all falls down\n\n[Pre-Verse]\nChildren...\nEat your bread\nLittle children...\nEat your bread\nCause it all...\nAll falls down...\nTelling you all...\nIt all falls down\n\n[Verse]\nYo! Y'all can't handle the truth in a courtroom of lies\nPerjures the jurors, witness despised\nCrooked lawyers, false indictments publicized\nIt's entertainment, the arraignments, the subpoenas\nHigh profile gladiators in bloodthirsty arenas\nEnter the Dragon, black-robe crooked-balance\nSouls bought and sold and paroled for thirty talents\nCourt reporter catch the circus on the paper\nFile it in the system not acknowledged by the Maker\nSwearing by the bible blatantly blasphemous\nPublicly perpetrating that \"In God We Trust\"\nCross-examined by a master manipulator\nThe faster intimidator receiving the judge's favor\nDeceiving sabers doing injury to their neighbors\nFor status, gratis, apparatus and legal waivers\nSee the bailiff representing security\nHolding the word of God soliciting perjury\nThe prosecution, political prostitution\nThe more money you pay, the further away solution\nLegal actors, Babylon's benefactors\nMasquerading as the agency for the clients\nHypocritical giants, morally non-compliant\nOrally armed to do bodily harm\nPolluted, recruited and suited judicial charm\nAnd the defense isn't making any sense\nFaking the confidence of escaping the consequence\nThat a defendant is depending on the system\nTotally void of judgment purposely made to twist em'\nEmotional victim blackmailed by the henchmen\nFramed by intentions\nInventions whereby they lynch men\nEnter the false witness slandering the accused\nPlanting the seed openly showing he's being used\nTo discredit, edit, headed for the alleged\nSmearing the individual fearing the unsuspected\nExpert witness (the paid authority)\nMade a priority to deceive the majority\nOf disinterested peers, dodging duty for years\nHating the process, waiting to be returning to their careers\nDo we expect the system made for the elect\nTo possibly judge correct? Properly serve and protect?\nMaterially corrupt, spiritually amuck\nOblivious to the cause, prosperously bankrupt\nBlind leading the blind, guilty never defined\nFilthy as swine, a generation purin it's own mind\nLegal extortion, blown out of proportion\nIn vein deceit, the truth is obsolete\nOnly two positions: victimizer or victim\nBoth end up in destruction trusting this crooked system\nMafia with diplomas keeping us in a coma\nTrying to own a piece of the \"American Corona\"\nThe Revolving Door, insanity every floor\nSkyscraping, paper chasing, what are we working for?\nEmpty traditions, reaching social positions\nTeaching ambition to support the family superstition?\nWhen the Son of Perdition is Commander in Chief\nThe standard is Thief; brethren, can we candidly speak?\nWoe to the men, trusted in the chariots dem'\nLeaning on horses, they run their intellectual sources\nCounterfeit wisdom creating the illusion of freedom\nConfusion consumes them\nEvery word they speak it turns them outwardly white\nInternally they absent of light\nTrapped in the night and bonded to the Cain of the night\nUnder the curse, evil men waxing more worse\nFaxing the first, angelic being cast to the earth\nIt's time for rebirth, burnin up the branch and the root\nThe empty pursuits of every tree bearing the wrong fruit\nTurn and be healed, let him who stole, no longer steal\nOh it's real, surrender for Jehovah is real\nHow long will you sleep, troubled by the thoughts that YOU keep\nThe idols YOU heap, causing the destruction you reap\nJudgment has come, find it and return to the One\nAbandon the flesh, self-interest: Broadway to death\nPride and the Greed, hide and subdividing the seed\nThe knowledge of Good and Evil is what caused us to lie\nCaused us to die, let your emotions be crucified\nRenounce all your thoughts\nRepent and let your mind be re-taught\nYou'll find what you sought\nWas based on the deception you bought\nA perception of naught where the majority remains caught\nLoving a lie, not realizing in Adam, all die\nLoving a lie, not realizing in Adam, all die\nLoving a lie, not realizing in Adam, all die\nLoving a lie, not realizing in Adam, all die\n\n[Hook]\nIt's the mystery of iniquity...\nSaid it's the history of Inequity...\nSaid it's the misery of Inequity...\nWhen it all...\nAll falls down...\nTelling you all...\nIt all falls down"}], "artist": "Lauryn Hill"}