{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/040972129589dd27d69aaa4f3312ec5b.700x700x1.jpg", "title": "I Got Pulled Over", "year": "1992-04-21", "album": "East Side Story ", "lyrics": "[Police Radio]\nSuspects are found in location\nThree to four male Hispanic cholo type\nThere armed with an iron bar\nPrepping to rig into parked vehicle\nSuspect number one is wearing a grey sweater, blue pants\nNumber two is wearing a white shirt, dark pants\nNumber three wearing a white, black khaki pants\n43 3 Code 101 94 38\n\n[Police]\nThere they go over there!\nAw man, shit!\nI gotta get up off my ass and go chase these cholo muthafuckas\nI hate fucking Mexicans\n\n[Verse 1: Kid Frost]\nI'm always getting caca from the blaca\nThe pinche jura always pull me over\nTake me out the rafla, sit me on the curb\n...And then they look me over\nThey ask about my beeper, I'm not a dope dealer\nThis is the Cherokee 4 wheeler\nIf I was selling drugs\nTo all of the street thugs\nYo, I don't mean to brag\nBut I'd be driving in a Jag\nI wouldn't be hitting the Eastside lowriding\nI'd be in Hollywood or Venice Beach high-profiling\nAnd all that shit\nAnd I happen to play along with your stupid little skip\nBut I'll just kick it\nYo, go ahead and write your ticket\nBut hey yo, Mr. Officer, you know where you can stick it\nI say this to myself, I let him do his thing\nOr he might beat me down just like he beat down Rodney King\nI got pulled over\n\n[Police]\nHey, don't that truck look familiar?\nYeah, that Cherokee over there?\nI think that belongs to that fat fuck ah -\n...that La Raza muthafucka\nLet's go fuck with him\n\nHey buddy, hey!\nAlright, you fucking...\nGet your fucking fat ass out the car!\n\n[Verse 2: MC Eiht]\nIt's 12 o'clock, late at night, I grab my keys\nKid Frost put me up with a skeez\nSo I roll a blunt to go\nOn that late night hype, who gives a fuck about five-o?\nI'm knowing that they're scheming, but fuck it\nCause they cop car's a goddamn bucket\nGeah, I ain't sweating shit, check the Eiht\nSo they run a make on my goddamn plates\nSo I hit the next corner real slow\nLow, here it go\nThe same old routine because of my car, black\nMistaken identity for slinging that dope sack\nAnd just because Compton's my playground\nThey want a nigga like E to stay way down\nBut I done had enough with harassing\nLike I said, one time still gaffling\nI know they up to no damn good\nJacking a nigga, cause I'm seen in the hood\nBut I best switch from a Benz to a Nova\nTo prevent them from pulling me over\n\n[Police]\nPull your ass over and get on the sidewalk, lock hands and feet\nYou know the routine, nigga\nYeah, nigga, you rollin down Alondra like you own this muthafucka\nWhere the sack at, muthafucka, where the sack?\n[MC Eiht] The sack?\nNigga, ain't no sack\nThe only sack is my nutsac\nYou got the MC Eiht mixed up with these other clockers\nGet off the dick, muthafucka\n\n[Verse 3: ALT]\nALT, that's me, I'ma flex again\nThe hooter, they were dying to shoot another Mexican\nSo I learn, if I don't wanna burn\nThen I pass up my exit, cause I'm afraid to turn\nAnd if I don't, then that pig'll be vicious\nCause every Hispanic at night is suspicious\nI'm thinking to my mind that I can hardly bare it\nI heard 'Fuck the Police,' but they forgot about the sheriffs\nAnd if I said it, then I might get beat down\nAnd I ain't going out by a clown in a brown gown\nThey ain't passing, no time for dashing\nLooked in my mirror, I seen red lights flashing\nHe had his hand on his gun on his hip\nAnd when he walked up, yo, that dumb fuck tripped\nHe was pissed, he said that I gave him some lip\nSo he busted me, now I'm in custody\nHe called my mother and he said he'd knock me silly, but\nThen I felt the crack of his muthafucking billy-club\nAnother night with a nurse looking over my shoulder\nJust because I got pulled over\n\n[Police]\nHey, Honcho\nGet your taco-eating ass out of the car\nWhat's your fuckin name?\n[ALT] I'm ALT, but what the fuck did I do?\n[Police] Get your fucking ass over there on the curb\nWhat's the bitch's name?\n[ALT] Hey man, don't call my old lady a bitch\n\n[Police radio]\nAll units code 461\n24 Hollywood Boulevard\nSuspects in custody"}]}