{"songs": [{"image": "https://images.genius.com/841cd44507fac2eb3bbad2da8d2919df.1000x1000x1.jpg", "album": null, "year": "2018-04-08", "lyrics": "[Verse 1]\nEverywhere I go I'm hearing something\nBaby, stop making things out of nothing\nAm I the one to blame? three years, still the same\nI talk still nothing is changed\nI had to go, you called me rude\nI did it for us, I did it for you\nA hundred below, high on the roof\nWas tryna get close, you tell me to move, oh, ah\nTell me, do you wanna stop?\nBefore I get up to the top\nClick clack pow, just take your shot\nI won't wait, I've had enough, yeah\n2 AM, my mind's on us\nAll my friends out to the club\nSaw you there, they said you're numb\nNumb to the pain, oh how you changed\nIt's not 'bout the girls, it's not 'bout the fame\nBlowin' the clouds, tonight it will rain\nYou havin' fun, this isn't a game, oh yeah\nYeah yeah yeah yeah\n\n[Chorus]\nDouble up, your love is not enough\nThank you for your accusations\nThank you for your accusations\nThank you for your accusations\nDouble up, your love is not enough\nThank you for your accusations\nThank you for your accusations\nThank you for your accusations\n\n[Verse 2]\nMe and all my buddies rock rock 'til we on the top top with a drop top, yeah\nJumpin' on this thing like hopscotch, all these other niggas all talk talk, yeah\nMe and all my friends, we a mess are you tryna drop lock with the mop mop?\nWalk away, oh she's gone, 'cause I love the drugs\nAnother one, one more time, and I swear I'm done\n'Cause everything that you've done is not enough\nIt's not enough, it's not enough\nI am all alone, baby do you want to come?\nSunflower fields, I just wanna run\nGirl you rubbin' off, I think I'm pretty numb\nSippin' on these things and I don't care about the love, yeah-eah\nI need you to listen to me\nShe's locked in a prison all alone, yeah\nBaby won't you listen to me\nI am in this mission on my own, yeah\nIt's been long but you come, girl, you switched it up\nAll this time I was wrong, you did it for the love\nSo everything that you've done is not enough\nIt's not enough, yeah, uh, what\n\n[Chorus]\nDouble up, your love is not enough\nThank you for your accusations\nThank you for your accusations\nThank you for your accusations\n\n[Outro]\nOh-oh-oh, oh-oh-oh\nOh-oh-oh, yeah\nOh-oh-oh, oh-oh-oh\nOh-oh-oh\nThank you for these accusations, thank you, oh\nThank you for these accusations, thank you\nIt's been long but you come, girl, you switched it up\nAll this time I was wrong, you did it for the love\nSo everything that you've done is not enough\nIt's not enough\nI'm alone, baby do you wanna come?\nSunflower fields, girl I just want to run\nGirl you rubbin' off\nAyy yo, start that from the beginning", "title": "Accusations"}], "artist": "070 Shake"}