{"songs": [{"title": "Eating You", "image": "https://images.genius.com/14da381769975ec5c53bf1de0edb7baa.500x500x1.jpg", "lyrics": "[Intro: Brotha Lynch Hung]\nOkay, now that we're here, I can finally tell you guys, what...\nWhat I brought you here for\nSo, but first of all, cheers to Strange, toast, glasses up\nAlright, alright this is how it went\n\n[Verse 1: Brotha Lynch Hung]\nI saw her in the woods by herself I had a knife\nPerfect opportunity to take another life\nUnfortunately I'm fucking ya kids instead of your wife\nShe was over 18 so she could make her own decisions\nSacramento born so she knew I probably visit\nWhat is it a blizzard? Nigga I'll cut her up with the scissors\nLaid the skin out on the table able to stretch it\nPicture a nigga bathing in blood and butt naked\nI met her at the studio I put her my record\nTold her I'd give her an ass cap if she turned that ass backwards\nI lifted up the black skirt, stuck a N9ne in her\nPulled the trigger\nNow she gone and you eating her for dinner\nI never would have told y'all\nBut I love y'all niggas\nTold her my tour bunk was right above y'all niggas\nShe really wanted to see y'all\nBut I met her first\nShe told me she had a ¡MAYDAY! CD in her purse\nI told her I was a Strange artist — she didn't believe it\nI was staring at the ¡MAYDAY! tattoo on her cleavage\nShe also had a Tech N9ne tat on her ass cheek\nVaseline\nShe say she just got it done last week\nI said Tech's too busy that's a long shot\nSee he in the north pole fucking an Eskimo slut\nHe said the pussy was cold and the rest was all cock\nFelt like the pussy was dead kinda like a zombie\nI gave her some of that Humboldt cookie bomb weed\nShe was higher than the space needle\nI keep that shit almost everyplace we go\nI started cutting up the arms and the legs\nAnd I had the bags in the passenger seat\nAnd a blunt in the ashtray\nNow I'm driving down the freeway\nParanoid, hella wired and I was driving for 3 days\nI almost dropped the body parts off at the truck stop\nHella tired\nLike for 2 hours I sucked cock\nI couldn't focus, eyes hella blurry, I can't stop\nGoing back to Cali ain't an option get caught by the cops\nSo I came to Kansas City just to talk to Trav\nY'all was on the next thing smoking now we eating meat\nI'm on the news, did you see me on the I.D. channel\nThey got a story about me called bloody candles\nThey say I murdered hella people\nAnd ate the bodies up\nThey had some 6 foot nigga play my body double FUCK\n\n[Interlude: ¡MAYDAY!]\nYeah man, I swear he even looked like you man, I couldn't believe it\nYo w-what’d you put in this food man, this shit is fucking awesome B\nI swear to god man this shit got me, I don't know man this shit got me feeling fucking good\n\n[Verse 2: Wrekonize & (Bernz)]\nWe really glad to be sitting at your table and break the bread with the Mannibal of Lector\nAnd this animal flesh just a stab at the best and we expect no less from the gesture?\n(Alright, and I seen her at the show of the day locked up what the fuck we eyed)\n(This Morse Code tat with a flesh filled high and a pair of red socks that way up knee high, no lie)\nThis meal is fantastic, thanks for the invite Lynch\nCheers to Strange, too right, The Snake and Bats the shit\n(Well Tech is fucking the Eskimos in the north pole\nWe bath saltin' in Miami where the whores ??? snort blow)\nWe been all up on your cannibal shit, the cannabis twist\nAnd now we on some mannibal shit, the mammals we get\nWe damage with the top of our fist an ice pick\nSwing hard just to damn and the cliques Strange Music\n(Ay that’s what's up, I need an ass filleted in this booth)\n(And this meat is a little too tough Brotha Lynch mighta been that you overcooked?)\nBut back to the matter at hand I know you damaged the fam, which might cause concern\nBut at the end of the day it’s bros' before hoes', they don’t ever seem to learn right Bernz\n(Let’s chew it, the girls came through and got more than she bargained for)\n(She had a body that was so damn thick the bowels could rip apart your jaw)\n(Scars, hard, this broad was playing backyard)\n(So it’s a shame you chopped her up Lynch but life is hard)\nAnd I ain't her bodyguard, goddamn this steak is charred\nPass me the whiskey please brotha, I need to ease the gods\nBut a demons claws, I scratch beneath the stars\nAnd give ‘em another reason to be up in needing sacrafeasts in large?\n[Wrekonize & Bernz]\nSo we thank you Brotha Lynch Hung for this invitation\nAnd we forgive you for the fan of ours you mutilated\nOn behalf of all of us in ¡MAYDAY! here’s our statement\nWe're down to roll with you no matter what the situation\n[Outro: Brotha Lynch Hung & (¡MAYDAY!)]\nSo, t-the moral, I mean\nYou know basically what I was trying to tell you guys\nI mean I just wanna know am I crazy?\n(Nah, nah, nah)\nFor, for eating human meat?\n(Wait, Wait? You were eating human meat right now?)\nDid you guys, yeah.. you guys ate human meat\nSo, tell me what you think\n(My stomach hurts…)\nHA HAHAHAHAHA Human Meat\n(Puking)", "year": "2013-02-05", "album": "Mannibalector"}], "artist": "Brotha Lynch Hung"}