{"artist": "Warren G", "songs": [{"year": "1997-03-25", "lyrics": "[Intro:]\n(Now, now go)\nYou got me fucked up\n(Why?)\nCuz I'm a bad muthafucka and you can't understand me\n\n[Chorus: K-9]\nMCs dont know how we puts it down\nK-9 and P-C from East to North town\nWe be bound by honor, or whoever wants to step\nSo either ya keep on steppin or we takes ya automatic weapon\n\n[Verse 1: P-C]\nNigga back up, see I came to stack up\nBodies like hits, whats that\nYou wanted to act up, and diss the click\nA sister, put my niggas up wetted the grave\nYou wanted to get richer, so offer your beats that made by fade\nCascade, because yo ass is soapy\nMr. Locc you wanna be Mr. low key\nWhen yo ass used to be low key\nYou know me so act like you know my click\nAnd I'm an assist to kick the shit that you and MD could never get with\nAnd speakin of MD, another nigga that used to be from my click\nAct like he double to down, but when it go down, go down he splits\nThis is strictly for all of y'all niggas that diss me\nY'all think y'all skills is up to par well stars come out and get me\nNow we got these niggas out on the streets, and a place to lay my gun?\nI guess you could say that I got hostess, in more ways than one\nY'all keep clickin and clickin, my chips continue to stack up?\nBut while you dissin and dissin I'm a tell you niggas to back up cuz\n\n[Chorus: K-9] x2\nMCs dont know how we puts it down\nK-9 and P-C from East to North town\nWe be bound by honor, or whoever wants to step\nSo either ya keep on steppin or we takes ya automatic weapon\n\n[Verse 2: K-9]\n(Hey K-9 what about Mad Dog)\nWell let that nigga loose\nNo better yet just let the dog loose\nSo he could fetch, goin to Vegas to see what he catch\nAin't gonna be no cases\nJust tell him what he faces and watch him snitch\nWhile I lay up in Vegas\nIts either the Raiders or the switch so he did\nSwitched over like electric shocks\nMoms got on pregnant static\nSo they suspected pops\nDid they know about me\nMr. K-9 see, clicksta in deep, in your Mama's panties\nDid they know that I was bangin it\nWhere at, oh your Daddy's bread be back\nNow she's pregnant and I ain't claimin it\nYour husband's cryin cuz he feels like a chump\nWhat, your son is fit to die and he ain't nuthin but a punk huh\nShe can't sayin nuthin cuz she needs my support?\nBut not for the child see the hooker's tryin to take him to court\nAnd I'm a body like Jah\nBut accept with mo mil\nWe probably wasmeant for each other\nCuz we two niggas they gave us both jams\n\n[Chorus: K-9] x2\nMCs dont know how we puts it down\nK-9 and P-C from East to North town\nWe be bound by honor, or whoever wants to step\nSo either ya keep on steppin or we takes ya automatic weapon\n\n[Bridge: P.C. + (K-9)]\nSo when the east is in the(when the north is in the house)\nBack up, back up\nSo when the west is in the(when the south is in the house)\nBack up, back up\nSo when the east is in the(when the north is in the house)\nBack up, back up\nSo when the west is in the(when the south is in the house)\nBack up, back up\nSo my click is in the (when da click is in the house)\nBack up, back up\nSo when K-9 is in the (when K-9 is in the house)\nBack up, back up\nSo when P-C is in the (when P-C is in the house)\nBack up, back up\nWhen Warren G is in the (when Warren G is in the house)\nBack up, back up\n\n[Chorus: K-9] x4\nMCs dont know how we puts it down\nK-9 and P-C from East to North town\nWe be bound by honor, or whoever wants to step\nSo either ya keep on steppin or we takes ya automatic weapon", "image": "https://images.genius.com/d0191f52cbece0c662cd18e324f486e9.1000x1000x1.jpg", "album": "Take a Look Over Your Shoulder (Reality)", "title": "Back Up"}]}