{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/53fefc4d6df0d130e456a9b88874193e.400x422x1.jpg", "title": "La Raza", "year": "1990-01-01", "album": "Hispanic Causing Panic", "lyrics": "[Produced by The Real Richie Rich & Will Roc]\n\n[Verse 1: Kid Frost]\nQ-Vo, aqui estoy, MC Kid Frost\nYo soy jefe, patron, yes, the big boss\nMy cuete's loaded, it's full of balas\nI put it in your face and you won't say nada\nVatos, cholos, you call us what you will\nYou say we are assassins an we are sent to kill\nIt's in my blood to be an Aztec Warrior\nGo to any extreme and hold no barriers\nChicano and I'm Brown and I'm proud\nGuantes, chingaso, simon, ese let’s get down\nRight now, in the dirt\nWhat's the matter? You afraid you're gonna get hurt?\nI'm with my homeboys, my camaradas\nKickin' back con mi ganga y para mi no vale nada\nYo soy chingon ese, like Al Capone ese\nControlo a todos solo never try to sweat me\nSome of you don't know what's happening que pasa\nIt's not for you anyway, cuz this is for the Raza\n\n[Hook (x2)]\nThis for La Raza, Raza\nThis for La Raza, Raza\n\n[Verse 2: Kid Frost]\nThe foreign tongue I’m speaking is known as  alo\nY sabes que loco? Yo soy muy malo\nTu no sabes nada, your brains is hallow\nBeen hit in the head too many times with a palo\nStill you trying to act cool, but you should know\nYou're so cool that I'mma call you a culo\nYou’re just a pee-wee, you can’t get none ever\nYou're on the leva\nYour own barrio doesn't back you up\nThey just look at your ass and call you a poo butt\nAnd so I look and I laugh and say que pasa\nYeah, this is for the Raza\n\n[Hook (x2)]\n\n[Verse 3: Kid Frost]\nCruising in the calle, headed for the bolo\nNo want to go with me, so I had to go solo\nAnd when I go out alone I'm packed\nI don’t sweat the chavalas when I know that I’m strapped\nEvery time that I pack my piece\nI pull it out quick, all the nonsense will cease\nJust like the song when you're 18 With A Bullet\nGot my finger on a trigger, I'm not afraid to pull it\nIf it gets out of hand I know some mafiosos\nWho can pull out cuetes on some stupid ass babosos\nSitting there wondering what's happened, que pasa\nYeah, this is for the Raza\n\n[Hook (x2)]"}]}