{"songs": [{"title": "Legacy", "lyrics": "[Intro]\nLet's build institutions. Let's build, y'know, things that will at least let our children know– before they even come out the whom– that you got something to look forward to. Y'know, that's important. And if we're not doing that, then we're just masturbating really...\n\n[Verse 1: Mas-D]\nYo, I was once to a story of old\nA tail of lovers and foes\nYo, you wanna hear it? Here it goes:\nGrand daddy was a radio man\nA type set a surviver\nAlive cause he didn't bother lies of men\nHe tried to rise against, but persecuted\nHe was wise and left in time to try again\nSo the man moved his fams to a brand new land\nTold his wife and young children \"we gone do as we can\"\nDaughter become a mother, son become a doctor\nOld man and wife loving life\nTrying not to succumb to the guilt of the past they left\nNumbed from the dignity of which they now are rest\nHe takes pleasure in children's modicum of success\nBuilds with his grandson who he loves the best\nLike this, he passes on all of his love, knowledge, and stress\nIn his golden years, finally getting it off his chest\nHe too learns a lesson from the knowledge he imparts\nA chip off the old block, that's how the legacy starts\nAnd though he's gone now, I keep a place for him in my heart\nFor forgetting where we've been, we realized we have not\n\n[Hook]\nOnly you can make it better\nYou got to make it easier so the rest of us can make it\nButchu gotta show me, show me what I got to do to keep on going strong\nKeep the legacy moving on\n\n[Verse 2: Akir]\nHumble my soul, I don't fumble over faith's control over my path\nKeep it towards my goals, take a hold\nCause time is fast, learning from my past, making moves\nFor my legacy, they raking dough and make they own\nRetiring, expiring, there's no security\nSurely the fury is enough to ensure me\nI can support seeds, I can ensure cheese\nIf I just explore deeds, even with no short days\nI plan to breed more kids\nToo many niggas doing time, violating laws\nI like the shine, but never went and tucked my chain inside\nDon't got no ride, don't even own a house yet\nSo fuck accessorizing outfits, my hobby is to count chips\nWe never had shit, and learned the game backwards\nOn some Simmons, Johnson, and dad shit\nFlip it and cash it\nNo disrespect, but where's the passion?\nThere's no example of us lasting\nIn this cruel world of Anglo-Saxons\nI see ya'll releasing all for a feature\nThe retards, while they fee ball\nWatching they melt they power– recharge\nThey hurting, and all the glitter really don't mean shit\nNo name could run the game, on some Kennedy shit\nThe remedy's this: teaching the mindframe of penny-less bliss\nAnd the driver revolt the slaves taking his ship\nHis eye portals see more\nKeep yours, teach the kids to reach for the stars\nSo we can keep ballin'\n\n[Hook]\n\n[Verse 3: Veks-One]\nI ain't got time for gettin' in battles\nLet's look around to reconsider that we live in this battle\nThis war on poverty has got me stressed\nI need money to breathe, so I got to scheme\nJust to give my pockets breath\nMy wallet need the Heimlich– preform CPR\nDo it: be an E up on your TV and your VCR\nHit the grocery stores, we got it sown up\nTeam effort– he get the G's, I'm stealing cold cuts\nAin't no \"I\" in \"team\", Ain't no \"I\" in \"hungry\"\nCheck the pyramid, believe me, there's a eye in money\nNever seen it? Need to look\nYou need to teach a child to read a book\nBuddy more concerned with how his sneakers look\nInfatuated with the Bloods and Crips\nSex, money, and drugs\nThrowing gangs signs, now let's pick up our grips\nThe media got it televised, glorified\nMother's cry, horrified, cause their son is gonna die\n\n[Hook]\n\nWe can create that legacy, we can have those people to follow up with that. And that's what we need more than anything. We need a follower. We need somebody to do something that bad and strong and dazzling and hip. And then the kids say \"man that's what I'mana do\" without causing us all this crazy money and trynna fit next door to the Tommy, killing niggas. Y'know, we need to do something that's gonna be about us clearly, that shows us loving us\n\nHis legacy will live on in our hearts for all eternity", "year": "2007-07-17", "album": "Legacy", "image": "https://images.genius.com/ec568067b0f966b9ee18a0f87677e60e.1000x1000x1.jpg"}], "artist": "AKIR"}