{"songs": [{"image": "https://images.genius.com/b004781b362cd21da695699a9328946c.600x600x1.jpg", "year": "2019-06-21", "title": "End Game", "album": "The Dude with the Strap Back Dad Hat", "lyrics": "[Intro: Endlyss]\nKinda wanna work through the pain\nThe creation of the world is insane\nI feel it in my soul like the rain\nThink it's time we end this game\nJust wanna let it go\nLet yourself up and show some more love, and\nSearching for answers\nThey right in front of you just pick and choose, yeah\n\n[XV]\nHey!\nYeah\n\n[Verse 1: XV]\nHow many songs must I write just to tell you I'm wrong\nI been on the move so much, but I never been gone\nMad test through this quest, where the questions would form\nSearchin' for some kind of answer that was there all along\nI been keepin' shit inside, but still been gettin' out\nOut here living life these others rappers spittin' bout\nDriving through my old hood and the kids is out, gotta floss\nTake some time, pull em' to the side, tell em' what it cost\nTryna get it, out the mud, never bought a diamond pendant\nBroski gettin' dollas but those commas led him to a sentence\nShorty trippin', call dropped, she lost my attention\nOnly service you getting this high is a flight attendant. Damn\nI know that you was calling on me\nGirl we sprouted like Alf-Alfas, you like Darla to me\nThen I started to dream, never knew how hard it would be\nWhat it cost to be this great, I know ya'll don't relate. Look!\n\n[Chorus: Freddy High, XV & Endlyss]\nLook, Some of my kin can't relate\nChess piecin' every move and every win that I make, look!\nYeah! I make endless mistakes, done been through the pain\nWe at the end of this game. Look!\nYeah, Some of my kin can't relate\nChess piecin' every move and every win that I make, look!\nYeah! I make endless mistakes, done been through the pain\nWe at the end of this game. Look!\n\n[Verse 2: Freddy High]\nYeah, cuz' nothing's never given to us\nKnowing they should just invest if they really knew us\nWe from the hood and they scared of how we influenced\nIt's all good, it's understood, how the culture move it\nDon't be truant, hard work in everything you doin'\nAnd I ain't tryna lose em', man I'm just speakin' to it\nLearn from Losing cuz' them L's got Lessons to em'\nA challenge stop running away instead of stepping to it\nThat dream is music, this hard work, I'm just working through it\nTil' I prove it, Gotta Do It, like them Checks on Shoes and\nAny \"L\" I took, know I gained respect from losing\nStrive For Greatness, I'm The One, ask who they choosing?\nLebron James. Yeah, my city on my\nBack when my time came. Moment in time change\nThey get fake, can't relate to that mind frame\nSo things change, let me end, game. Yeah!\nFreddy!\n\n[Chorus: Freddy High, XV & Endlyss]\nLook, Some of my kin can't relate\nChess piecin' every move and every win that I make, look!\nYeah! I make endless mistakes, done been through the pain\nWe at the end of this game. Look!\nYeah, Some of my kin can't relate\nChess piecin' every move and every win that I make, look!\nYeah! I make endless mistakes, done been through the pain\nWe at the end of this game. Look!"}], "artist": "XV"}