{"songs": [{"image": "https://images.genius.com/b94d6ac419173d0ac18545c2e73eaada.640x640x1.jpg", "album": "Face", "title": "America", "lyrics": "[Intro]\nAmerica, America\nHere's to your health\nAmerica, America\n\n[Verse 1]\nNow tell me\nWhy's the country that's the most wealthy also amongst the most unhealthy?\nThere's probably a lot of theories out there\nBut mine's got to be the lack of national healthcare -\nA category of welfare that happens to be well fair\nWhether there's wealth there or whether it's elsewhere\nNow you can probably tell where this is going from my accent\nOr you're thinking \"Why's this British guy rapping?\"\nI like America, the music, the people\nThat's why I want to see improvements to each of them\nThere's problems here too, Britain's got its fair share\nI'm sure you know about our questionable dental care\nBut there's one thing that stands better than the rest\nAnd that's the NHS, yes\nWhere nobody faces rejection\nJust because to treat them would be a dangerous investment\nWhere what the doctor prescribes is what you're given\nInstead of having to wait for your insurer's decision\nWhere prescriptions are a reasonable price\nIf you need something lifelong you can even subscribe\nWhere if you're old or young; unemployed;\nThen it's free, and the price tag becomes null and void\nWhere you can go home without paying one penny;\nWhere you've still got the option of a private company\nIt's unbelievable the stuff they've done for me before\nMonths in hospital and I've not paid a fee at all\n\n[Hook]\nAmerica, America\nHere's to your health\nAmerica, America\nHere's wishing you good health\n\n[Verse 2]\nInsurance firms are about saving dimes\nBefore they'll even think about saving lives\nSo say goodbye to your treatment if there's even\nA minor loophole in your legal agreement\nIs your system victim free?\nThere's fifty million Americans who evidently disagree\nFifty million without health insurance\nThat could die just because they couldn't afford it\nYou don't have to pay to have a fire extinguished\nAnd you have the police, not private militias\nSo why should this difference apply to the systems\nProviding for victims requiring assistance?\nNothing should be held higher than citizens\nPutting wealth over health? I am sick of it\nInsurance firms are commercial businesses -\nThey're not concerned what your physical fitness is\nThey're only interested in what the interest is;\nOver here we have a different incentive\nA lot of you are incensed at this\nAnd I don't intned to be insensitive but listen\nThere's several myths about the terrible British\nMedical system that I better dismiss, quick:\n1. You can't choose who your doctor is. Not true -\nThere's a long list of doctors I've gone to\n2. One of the most stupid lies is that\nOld people are euthanised when they're due to die\nNot true - if there was institutionalised\nGranny killing don't you think there'd be a public outcry?\nYou don't have to use the NHS anyway -\nThere's still plenty of private firms if you want to pay\nBut the proof's in the pudding, come to Britain for a bit\nI bet you can't find anyone who would get rid of it\n\n[Hook]\n\n[Outro]\nAmerica, America", "year": "2010-04-18"}], "artist": "Dan Bull"}