{"artist": "Zack de la Rocha", "songs": [{"album": null, "title": "March of Death", "lyrics": "[Sample]\nRock and roll music is the main weapon\n\n[Intro]\nCheck\nOne two\nAlright, bust it\n\n[Verse 1]\nI was born with the voice of a riot, a storm\nLightning the function, the form\nFar from the norm, won't follow like cattle\nI'm more like a catalyst; calm in the mix of battle\nWho let the cowboy on the saddle? He don't know a missile from a gavel\nPara terror troopin' flippin' loops of death upon innocent flesh\nBut I'm back in the cipher my foes and friends\nWith a verse and a pen, against a line I won't toe or defend\nInstead I curse at murderous men in suits of professionals who act like animals\nMan child, ruthless and wild\nWho gonna chain this beast back on the leash?\nThis[?] Texas Führer, for sure a, compassion-less con usurper\nLethal needle to the poor. The cure for crime is murder?\n\nWell I was born with the voice of a riot, a storm\nLightning the function, the form\nFar from the norm, won't follow like cattle\nI'm more like a catalyst; calm in the mix of battle\nWho let the cowboy on the saddle? He don't know a missile from a gavel\n\nOn the left, on the left, left, right, left [x3]\n(But it's just a march of death)\n\n[Sample]\nOkay, you're lookin' good, you might bend just a little left, just a little left, about 170\n\nI read the news today, oh boy, a snap shot of a midnight ploy\nVex the powerless, devour my hours I'm motionless with no rest\nCause the scream now holds the sky, under another high-tech drive-by\nA lie is a lie is a God\nA government's a condor of war, nothing more\nIslam peace, Islam stare into my eyes brother please off our knees\nTo beef now we feed their disease, interlocked our hands across seas\nWhat is a flag is a rag is a shroud out loud, outside a faceless crowd\nA cowering child just took her last breath, one snare (one snare) in the march of death\n\nOn the left, on the left, left, right, left [x3]\n(But it's just a march of death)\n\nHere it comes the sound of terror from above\nHe flex his Texas twisted tongue\nThe poor lined up to kill in desert slums\nFor oil that boil beneath the desert sun\nNow we spit flame, we flip this game\nAll the targets are taking aim\nAll targets are taking aim\nWe're the targets, they're taking aim", "year": "2003-03-21", "image": "https://images.genius.com/6745496caedb92dd50c1ddb46f49d5ae.500x500x1.jpg"}]}