{"artist": "Fabolous", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/8e2843dcf4a386d5de04cd6e203899e1.391x391x1.jpg", "lyrics": "Sky lines and city lights are all I see as I'm wasting away\nI need the city to remind me\nThere is life out there surviving\n\nIf you could see me, I would thank you\n‘Cause I can’t see anything, is see through\nI can't look straight and I can’t believe\nThat the heaters not a burning just a bad dream\nI could _ france, so you think I'm in\nI could play it off, as life is playing out my sin\nBut I come off like a jaded fool\nWhen all I really want is something real from you\nLife keeps on moving even when my heart has stopped\nThis world keeps spinning\nEven when your love has left my heart\nTime’s not affected when you decide to just be still\nMy thoughts are holding me against my will\n\nSky lines and city lights are all I see as I'm wasting away\nYou came into my life, the old me is wasting away\nSky lines and city lights are all I see as I'm wasting away\nI need the city to remind me\nThere is life out there surviving\n\nCan you check me? Can I rank you?\nCan we stir up an emotion I can break through\nOn a twelfth floor, in a dark room\nThere’s no living when you look from my window view\nDo it just as is, cause when no one plays\nI win from millions so we live inside this crazy space\nDo we want more or hate change\nAm I wasting all my time wasting all my pain\nLife keeps ya moving even when you wanna stop\nThis world keeps spinning even when you have left my heart\nI hear the people move when nothing is moving\nI see the city sleep but nothing is soothing me\n\nSky lines and city lights are all I see as I'm wasting away\nYou came into my life, the old me is wasting away\nSky lines and city lights are all I see as I'm wasting away\nI need the city to remind me\nThere is life out there surviving\n\nSometime I look at the sky line\nAnd I don’t know if it’s the light that makes you … dark\n\nI'm just happy to be real\nIn a world that’s mad fake\nThat can’t stop me, my life got bad brakes\nDreams come true, I finally convinced myself\nAnd still wake up every morning and pinch myself\nI’m a role model, she’s centerfold models\nAnd we both goes but in the rolls model\nThere's ups and downs to my understanding\nTo be fly,there gonna be take-offs and landings\nWhile you doing at least get to see the sky line\nThe good life contract, where do I sign?\nSo when I shine, baby you shine\n‘Cause life’s a bitch, that you can't two time\nI’m so original somebody may copy\nMy son points at the tv and say papi\nThis reminds me there’s people behind me\n& God to guide me with you beside me\n\nChorus x2\nSky lines and city lights are all I see it's wasting away\nYou came into my life, the old me is wasting away\nSky lines and city lights are all I see as I'm wasting away\nI need the city to remind me\nThere is life out there surviving", "title": "City lights (feat. fabolous)"}]}