{"artist": "Yukmouth", "songs": [{"album": "Thugged Out: The Albulation", "image": "https://images.genius.com/6dcb01d30774cfc257eef87de8bad453.500x500x1.jpg", "year": null, "lyrics": "Yes, yes, yes, uh!\nBalla shit, nigga\nTimer shit nigga\n(Regime shit baby)\nFlossy shit, boi!\n(Smoke-A-Lot, Smoke-A-Lot)\nRolex Rulez\nCheck it, we rock big jew-els an shit, big karats an Baggets an shit\nMutha fuckas be starrin, niggas packin big thangs too nigga\nUh\n\nVerse 1\n\nI started off wit heata shit\nCarry a nine millameter shit\nRolex on my wrist\nNever fuckin wit Geneve shit\n(playboy whats Geneve shit?)\nSomethin like 20 g's cheaper shit\nTryin to pawn this shit, but the jewelry store tell you to keep the shit\nLook juss like a Rollie, but it really ain't Rollie\nWhat the fuck you think homie, you walkin around wit fake Rollie\nI never knew that swap meets a-wraps could make Rollie\nThe Motra fake Rollie's, yo time an date gone break Rollie\nThe type of shit a theif won't even attempt to take Rollie\nGo out on a date, start makin bitches hate Rollie\nNow pump yo brakes homie\nOnly the ballin qualified can rock the platinum, oyster, in distant\nRolex wear outside\n\"Stayin Alive\" like Wyclef, gettin high until my eyes shut\nWise steps, hands carrassin my tech\nRolex under my sleve nigga\nTo each nigga playa hatin, I make you mutha fuckas bleed quicka\nI read niggas\nLook in my eyes an die slowly\nMeet my four-five\nNiggas done died fo a Rollie\nI leave yo chest over yo family outside lonely\nThey died on the stretch an take an ambulance ride homie\nMy four-five told me, that shit that crucify homies\nIf I didn't, got so many down niggas ready to ride fo me\nDie fo me\nEye fo an eye homie\nThat's what you get for tryin to rob me fo my Rollie nigga\nRolex Rulez\n\nChorus *(Phats Bossalini)* 2x\n\nWell an nigga wit the Rolex on\nYou best believe he packin Stretch Armstrong\nSome kinda gat or thang on him\nHit you bullet rain storms\nWhen you got the Rolex watch, piece an chain on\nListen\n\nVerse 2\n\nTo all my real playas\nThrow yo Rollie's in the sky\nWave 'em side to side\nThen keep yo four-five caulked to ride\nSo many mutha fuckas done died\nTryin to steal a Rolex watch\nEspecially tryin to steal mines\nI remember the day I bought my first watch\nThe turfs hot\nSlangin them birdies, that chirpin juss don't stop\nRaise niggas off the block who turf hop\nJuss got my first 5 in the world to check in the jewlery store the first\nSpot\nI'm wet\nCash the check, grab the tech an jet\n10 G's in my pocket headed straight to Spence\nI want my shit all baggets\nBut it cost too much\nHad to fuck wit somethin less\nAin't tryin to floss too much\nA straight gold Presidential\nNo diamonds down the wrist\nPrincess cabezel\nYou know\nThat's small timer shit\nBut fuck that!\nI got the Rolex, chain an ring that match\nStack my scratch, until I got enough green to bring shit back\nExchange? Yes!\nGive up the chain an gain a Rolex\nDrop some G's\nIt's juss like property so invest\nAn if you ever go broke, don't feel depressed under stress\nPawn yo shit, I give you what you paid an not a dolla less\nThat's big timer shit\nWhite colla shit, so I jet\nI see some niggas casin the set\nHangin out by my Lex\nI grab the mutha fuckin Tech 9\nThe first time, I get to hear that mutha fucka scream an whine\nRolex Rulez!\n\n*(chorus)* 2x\n\nUh, to all my real playas, nigga, uh\nSmoke-A-Lot up in this bitch\nRegime shit, uh\nSometimes you gotta floss, sometimes keep that shit up under yo sleve\nHaha. Cuz niggas tryin to get us\nBut I keep big heats, nigga. Uh\nHow many holes you want in yo ass?\nBLOW-BLOW!\n1, 2, or 3? Nigga what?\nBLOW-BLOW!\nBack the fuck up nigga. We do our thang, Rolex Rulez\nI sugguest you pack a gat too, my ballin ass potna\nOr you will get flatlined\nDone deal", "title": "Rolex Rulez"}]}