{"songs": [{"image": "https://images.genius.com/a771fd3e611d5c86a13b17b05dbb15f9.500x500x1.jpg", "lyrics": "Spoken: A Rapper Imitating Eminem as Bin Laden]\nOh Dr Dre. Or should I say Dr Gay\nYou are very bad man, you diss the wrong motherfucker. You think Osama won't diss you back biaaatch\n\n[Verse 1:]\nThings just ain't the same for Osama\nSo much drama since the World Trade Bombings\nAnd the Pentagon got the whole world calling\nMe to kill all of congress, like...[blurred]\nThe Strangest things can happen to an Afghan\nWhen people get wrapped up in Islam and Allah\nThen some shiteaters fly planes and wreak havoc\nThen go drop the blame on Bin Laden\nNow I got a faggot-ass rapper attacking me\nWith this gangsta rap, like I'm not gonna battle\nDr Dre? The man wasn't done shit since NWA\nAnd gave Eazy-E AIDS\nDon't make me go Suge Knight on your fat ass\nYou homofuck, you ain't the only one goin' platinum\nOsama Bin Laden, keeping it gangsta\nFuck Dr Dre, I'm the Aftermath\n\n[Hook:]\nEverywhere that I go ain't the same as before\nPeople I used to know just don't know me no more\nAnd everywhere that I go, I got people I know\nWho've got people they know, so I suggest you lay low\n\n[Verse 2:]\nOh Dr Dre look at you, you fool\nI use your own rap against you, and I'm better\nLick my balls, until they are dry\nSorry... come again *gunshot*\nThings just ain't the same for Bin Laden\nThis planet hates me more than Michael Jackson\nHating on the Taliban for keeping me captive\nThreatening to find my little cave and blast it\nNow I've got to worry about this wannabe gansta\nWho pays other rappers to write his wack shit\nEveryone knows that your beats are helped man\nAnd you'll never blow by yourself man\nSorry, you'd blow... blow cocks\nUse the hole as a straw and blow sperm out your nostrils\nI don't give a hurried fuck, call Slim Shady\nSnoop Dogg, D.O.C, Wren and Jay-Z\nTo write a verse, fuck I'll do it for ya\nYou still lick dick, this is Booshu Babara\nDo you know who, do you know what, do you know who?\nLet's keep this between me and you\n\n[Hook]\n\nOsama...\nOsama...\nOooosama...\nO-o-o-osama...\nBiatch", "title": "Bin Laden Diss", "year": null, "album": null}], "artist": "Unknown Artist"}