{"songs": [{"image": "https://images.genius.com/a166de62d6de5dd737fd76f23799246a.769x768x1.jpg", "lyrics": "[ INTRO: D Knowledge ]\nAnother 1000 years of mystery\nUnresolved history\nAnd don't blink\nOops, it's 2000 A.D\nThat's 'After the Death of us'\nBut we don't have to die\nOr live like ghetto zombies\n\n[ VERSE 1: Mac Mall ]\nIn the House of the Lord\nI make relationships with Allah and pray hard\nEven though I'm at odds\nWith what I know and what you call 'God'\nHoly Bible to the Holy Quran\nEverybody seekin salvation\nSome try to get it by smokin dum-dums\nSome only feel it when they get sexed up\nVictims of their own lust\nOthers find it with a poke in their veins\nSome try to get it with material gain\nAnything to kill the pain\nThe people from Heaven Gate\nTook they own life, they tried to get away\nRather be in outer space\nAnd the cold thing about it: what if they was right?\nAnd we was too blind to see the light?\nHuh, I doubt it, but that just goes to show\nHow far people'll take it just to feel hope\nSome fools can't even find they soul, let alone save it\nThat's why we got these cross-burnin racists\nEvil hawks in the most holiest places\n'll try to steer you wrong with temptation\nDon't matter if you're black, white, latin or asian\nWe all must have communication\nWith the Man Upstairs\n\n[ *DJ Yon cuts up* ]\n(See, I fought with the devil, made a promise to God) --] L.L. Cool J\n\n[ VERSE 2: Mac Mall ]\nMay the Father, the Son and the Holiest Ghost\nGive me some guidance on these streets so cold\nShed some light down on me and my folks, you know?\nCause the Pope never toured the ghetto\nBut anyway I pray for you to understand that it's hard out here\nSo I fear no man and keep a semi-auto near\nIs it in your plan to let live plus kill?\nIs it true when you destroyed you must build?\nI wonder 'bout a lot of thangs, like when I go\nWill I be judged for what I did, or what I lived fo'\nIt's all in your hands, yeah, I suppose\nThe thought of never bein alone\nKeep believers' hearts strong\nOn the news they say we years from the clone\nYou know the words, mayn, \"2000 triple zero, party over, we gone\"\nAs the choir sings songs of redemption\nIn the U.S. we dyin for religion\nOut in Europe they dyin for religion\nI say this and hope the Holy Father's listenin\nLivin in this New Age Babylon, preachers havin telethons\nJustice playin war games, waitin on the red don\nAnd then they wonder why the kids do drugs\nCause Uncle Sam don't show no love\nWe need the Man Upstairs\n\n[ *DJ Yon cuts up* ]\n(See, I fought with the devil, made a promise to God) --] L.L. Cool J\n\n[ VERSE 3: Mac Mall ]\nNow I release myself to these streets\nPray to God to keep me strong in the world of the weak\nAnd if I should die before a million I make\nBless my kinfolk with big dough and keep em all safe\nI can hear my grandmother singin gospel songs\nSayin to me \"Jesus love ya if you don't live wrong\"\nAlso said it was the devil that made us act wild\nDidn't listen back then, but I'm feelin her now\nHeaven or hell, I'm livin through em day to day\nAnd God shall return, that's what the preacher say\nPartner, if he is, I wish he hurry up\nCause the government tryin to bury us\nKnow what I mean?\nIn Afghanistan Muslims dyin over holy land\nIn Tibet it's the same madness\nOn my block you can die for lookin the next man in his eye\nMama's child grown way before his time\nIt's a cold world, but still it's God will\nBut why we gotta die tryin to chase the dollar bill\nMan Upstairs?\n\n[ OUTRO: D Knowledge ]\nWe don't have to die or live like ghetto zombies\nAnd we don't need a 'New Millennium' to change\nCause we got today, right now, to wake up\nRise up, shine up and climb, upstairs\nRise up, climb up, leap up, clean up, be up\nAnd go, upstairs, high, upstairs\nRise up..", "year": null, "album": "Immaculate", "title": "The Man Upstairs"}], "artist": "Mac Mall"}