{"songs": [{"album": "Javotti Media Presents: The Cathedral", "image": "https://images.genius.com/ef6dedd7fb7fbfd332ff9ea334d4188f.500x500x1.jpg", "year": "2014-11-10", "title": "Everywhere I Go", "lyrics": "[Intro]\nNow the question has been raised, what the fuck happened to you?\nWell I can tell you what did not happen to you\nYou didn't get your ass on this Cathedral mixtape\nSissyyyyyyyyy\n\n[Verse 1: Curren$y]\nFor not knowin' the ways you can be capped like a NBA salary\nLives taken haphazardly, them sons of bitches is bastards, G\nThat's why I be high B, so don't ask me why I'm not speakin' nigga\nJust ain't countin' no money up wit' cha\nThe fuck we got to talk about?\nNot seachin' for Bobby Fischer\nBut somethin' sticky and super official\nTo burn with my girls in the parkin' lot\nSurrounded by 'em before I got out\nParched aren't we?\nHonestly shorty, let me check make sure I ain't got no fleas up on me\nFrom minglin' with them ol' pussy ass niggas and dog ass bitches\nOld veterans get bit by the youngins\nI swear to God that them puppies 'll kill ya\nField of dreams, they come true if you build it\nSo I made myself if y'all can dig it\n\n[Hook: Kendra Ross]\nEverywhere I go we roll up\nEverywhere I go we pour up\nI know you think you shinin' nigga, so what?\nIt wasn't going down til we showed up\nYou know it's going down-n-n\nYou know it's going down-n-n\n\n[Verse 2: Talib Kweli]\nAcross the water or across the border\nSee my second line deep like I’m from New Orleans\nYou a snitch nigga type that’ll call the law\nSo before the slaughter I get my thoughts in order\nSeen your rapper on stage you and your little crew\nWe so sick of these Thelonius dudes\nAnnoyance grew and the audience boo\nWe had enough of your corny excuse\nLiving in the world of my own adventure\nLife a gunfight, a knife is your only weapon\nYou don’t really know what the fuck you stepped in\nBetter chill right now, life such a blessing\nSave the feedback, where the weed at?\nImagine me at an intervention\nYou the one who need an intervention\nTo stop you from interruptin’ sessions\nWow that’s such a nasty habit\nWow this marijuana marriage got my wifey jealous\nI get selfish when I’m making fuckin’ classics\nAmsterdam or California, Washington, Oregon or Colorado\nWhen we blaze in the club the Jamaican bud\nGot me feelin’ so special, no bravado\n\n[Hook]\n\n[Verse 3: Big KRIT]\nHey ya I emerge from the south with the mind to get paid\nCup of some drank keep it stuck in my ways\nLivin’ life tryna catch me a wave\nIn the same state they used to wholesale slaves\nPimp tight nigga hold up\nPresidential when I roll up, like a playa do\nShe in love put nothing above purest the drug in a day or two\nThat’s a playa move, in this game of life can’t cruisade or lose\nYou gotta be willin’ to be the villain to give it [?] gator shoes\nI heard it from an old school kid, say I had an old school soul\nTold me I was bound to be great, never fall for the fake\nAnd never ever chase no ho, gotta make that dough\nCrack my seal, pop my trunk and work my wheel\nCause every now and then, reflect on times\nThat I ain’t have dimes to fuck or dough to spend\nSo I gotta keep my mind right, forever run from the limelight\nI don’t need no fame, my aura shine so bright\nI’m a star in my own right, forever loyal to the game\n\n[Hook]\n\n[Outro]\nI love this nostalgic shit\nThis whore right here\nIs literally like the perfect blow job\n\n[Curtis Mayfield sample]"}], "artist": "Talib Kweli"}