{"songs": [{"year": "2011-05-03", "image": "https://images.rapgenius.com/6478121f52fa3b0248edb20e7d06e076.300x300x1.jpg", "title": "Take Me Away", "album": "Damn Fool", "lyrics": "[Intro:Big Scoob]\nLord, Grant me\nThe serenity to accept the things that I cannot change?\nCourage to change the things that I can and the wisdom to know the difference?\nLearning to live one day at a time, Enjoying one moment at a time\nAccepting hardships is my path when it peaks\nTaking as he did, My sinful world as it is, And not as I would have it\n\n[Hook: Irv Da Phenom]\nIt's like everywhere I go the drama follow me\nI try to get away, The streets is calling me, Lord Please?\n\nTake Me Away (x3)\n\nAnd the hood is all I know, So I'm just trying to stay strong but\nI don't know if I can make it on my own, Lord Please?\n\nTake Me Away (x3)\n\n[Verse 1: Big Scoob]\nThey got me scared to pick my phone up, It's always bad news\nSeems like lately, Lord I ain't winning, All I do is lose\nI done lost so many people, I got nothing left to lose\nThey done turned the chess to checkers, They ain't playing by the rules\nI done paid so many dues, Feel like I should know the moves but\nI'm blind and I can't chose, How much longer in these shoes?\nI've been walking down this same path, It's time for something new\nI keep trying to add up numbers but subtractions all you use\nMan, I'm sorry for these questions but I need to see some truth\nI've been waiting on these blessings, I don't think they coming through\nMan, You told me put my faith in you but now my heart is bruised\nI got nothing left to do but run these streets and hunt for clues\n\n[Hook]\n\n[Verse 2:Big Scoob]\nI'm so tired of gutter livin, How the story stays the same\nHow I see the same picture and it's always full of pain\nLife is cloudy in these pitchers and it always brings rain\nThat's the reason, I be itchin in the kitchen, twistin' caine\nAin't much different if it's prison or the block it's all the same\nSo I get it how I'm livin don't make sense to leave the game\nI ain't trying to place the blame, I'm just asking how to change?\n\nTryin to find a different lane, That's the reason I'm with Strange but\nWith Strange brought the fame but it's slow to bring the change\nSo I'm right back in the game and I don't think that I can change\nMan, My home will still remain, Still got greed for fancy thangs\nSo I'm right back in position on a mission through the rain\n\n[Hook]\n\n[Verse 3: Big Scoob]\nMan, They tell me it's a reason, While I'm still upon this earth\nAm I the only one dont see it, Please? Show me what I'm worth?\nJust a glimpse of my destiny? I swear to give the best of me\nAnd till there's no more breathe in me, All I got that's left of me\nI'm trying to clear the pitchers with my very last shot\nIf a switch don't come from this one, Then I'm heading for the block\nTime to holla at my mexicans and dust off my pa\nYeah, You know I had to keep it man, I knew I couldn't stop\nI'm a pusher that's my nature, So I'm trying to push these records but\nI speak a different language, So it's hard to get my message\nVent aggression, Under Pressure, Like the lids funna blow\nGot my eyes on the prize but, It's still far to go\n\n[Hook]\n\n[Outro]\nSo as I stand here before you, Lord\nI take this opportunity to humble myself and ask you for your help\nIt's like at this point in my life right now\nI need something different or I just need you to let me know\nThis is the path that you intended for me and I'll walk this path with no resistance"}], "artist": "Big Scoob"}