{"songs": [{"album": "Hood Politics IV: Show and Prove", "image": "https://images.genius.com/3258e160f5aaaf0d6be6f408706fed6b.500x500x1.jpg", "year": null, "title": "Watch How It Go Down (Remix)", "lyrics": "[Intro: Premier talking]\nPrimo. Yo, what up Term'? You know we had to do it. Remix, remix. Guess who?\n\"Watch how it go down\" - M.O.P. 'World Famous'\nFirst family\n\n[Verse One: Lil' Fame]\nSoon as the beat drop, your heart beat (STOP!)\nThe heat pop, it's M dot O dot P (DOT!)\nThis ain't hip hop\n(It's Mo P hop!)\nThe streets hot\nWe in the building like sheet rock\nHaters can eat a cock\nAnyway, enough about ch'all, fuck cha'll\nLet's talk about me\nI can't stop, I won't stop\nI'm too strong plus it's all fucked up without me\nI'm the baby of a Kingsboro alchie\n(Jamal Grinnage!)\nI'm the baby of despot\n(Trini.!)\nT.N.T. I'm half hard dough bread, half Inver House Green\nAnyway, enough about me, fuck me\nDuke let's talk about ch'all\nWe done ran through gay crews and squads\nI got my compact disc pushed back\nBut I can bet yo' ass this\nI ain't never got my shit pushed back\nIt's the world's most dangerous\nM (Blonk!) O (Blonk!) P (Oooh!)\nWith Termanology and Primo\nMotherfucker\n\n\"That's how you bring it!\" - M.O.P. 'World Famous'\nLil' Fame\n\"Kick back and watch how it go down\" - M.O.P. 'World Famous'\n\"Streets crazy wild plus it get crazy foul\nListen when I say it now\" - Termanology 'Watch How It Go Down'\n\"Watch how it go down!\"\n\n[Verse Two: Termanology]\nYo\nI see myself as the holy resurrection of rap\nI rise souls how I'm bringing it back\nListen, a little Makaveli, I'm smoking on lots of cherry\nAnd thinking on plots to bury, my enemies out to get me\nI'd rather just sign a deal then gripping the pine and steel\nOr flipping and find a kill and sitting in county jail\nThey dying to prosecute me, illegally stop and scoop me\nIf not then these cops will shoot me\nAnd popped on my top are Gucci\nThe secret Illuminati is crooked as Giuliani\nAs long as my crew behind me\nI'm keeping it truly army\nWe starting revolution, a pivotal evolution\nA lyrical execution, Puerto Rock rebel shooting\nA Che Guevara with bling on, I sing songs\nFor my people locked in the bing long, you've been strong\nKeep your eyes open and your mind elevated\nHit the law library, spend your time educated\nIt's Termanology\n\n\"Bring 'em over here\"\nPrimo\n\"Watch how it go down!\"\n\"Bring it back to the east\"\nPapoose\nPap-oose\n\"Watch how it go down!\"\n\n[Verse Three: Papoose]\nMy support system is New York wisdom\nI tuck the four fifth in\nDon't get caught slippin\nYeah we all winning\nCause I make the city look good when it was dead\nJust like a mortician\nI hear 'em all riffing\nBut I shoot guns like directors shoot movies\nWho wanna audition?\nBefore you talk, listen\nThese rappers is blind like the shades in the window\nI got a strong vision\nAnd I hear 'em all spitting\nBut they ass backwards like the Detroit Knicks\nAnd the New York Pistons\nI neglect all ignorance\nInject a long clip in to protect all women\nThey keep the world spinning\nYeah we all chilling\nThis what you call living\nGot it locked like Elmira you never saw prison\nLook in the mirror\nYou reflect poor image\nThe game is sour cause you niggas all lemons\n\n\"Crooked detectives is foul how they book and arrest us\nFor cookin and stretchin we just tryna feed our kids\" - Termanology 'Watch How It Go Down'\n\"Streets crazy wild plus it get crazy foul\nListen when I say it now\"\n\"Watch how it go down\"\n\"Shit is wicked on these mean streets\" - Jay-Z 'D'Evils'\n\"Ayo enough's enough\" - Fat Joe\n\"Shit is wicked on these mean streets\"\n\"Ayo\""}], "artist": "Termanology"}