{"songs": [{"year": "2019-01-24", "album": null, "image": "https://images.genius.com/f1044b69e4a7358f999ef8a9f7c4c6ef.300x300x1.jpg", "title": "Bounce Back", "lyrics": "[Hook]\nI may be down just for the moment [?]\nI'll live forever through these records, never die\nThe way I, bounce back\nWay I, bounce back\nWay I, bounce back\nWay I, bounce back\nI may be down just for the moment [?]\nI'll live forever through these records, never die\nThe way I, bounce back\nWay I, bounce back\nWay I, bounce back\nWay I, bounce back\n\n[Verse 1]\nSaid I been chopping with these bars like a battle axe\nAnd everything a nigga write, well it's matter of fact\nSee you could take it as the truth or choose to not believe it\nNo need to beat around the bush, I'm off the beaten path\nThe quest I'm on is one for life, I gotta figure out\nEverything that I been looking for, I can't find\nHow the fuck do you critique a nigga's inner thoughts?\nAs if you even understand what I'm going through\nI'm in a business where the numbers matter more than the product, you might get caught up\nYou will take losses, I got my back against the wall\nI throw these records out with reckless abandon\nI hope and pray that one of them sticks\nStill slumming, ya dig?\nStill spitting this shit\nStill outta the mix\nMy shit fresh, your shit outta the box\nYou outta your mind, you outta your lane\nI'm outta this world, I'm out in a hurry\nI hurdle hearses and all traffic\nI step back and fall in line\nA wise man once said, \"Be [?], be patient, all good things, they come in due time\"\nEverybody don't ball like they Chris Duhon\nEverybody don't push the Beamer, Benz or Bentley\nSome of us are broke and hopeless, pockets empty\nMe, I wanna find some peace of mind, [?]\nYeah I may be down right now but not forever\n\n[Hook]\nI may be down just for the moment [?]\nI'll live forever through these records, never die\nThe way I, bounce back\nWay I, bounce back\nWay I, bounce back\nWay I, bounce back\nI may be down just for the moment [?]\nI'll live forever through these records, never die\nThe way I, bounce back\nWay I, bounce back\nWay I, bounce back\nWay I, bounce back"}], "artist": "K.A.A.N."}