{"songs": [{"year": null, "album": "YouTube Promotion Tracks", "image": "https://images.rapgenius.com/02b58086980a9d85d02680be12cb2a87.562x218x1.jpg", "title": "Punchline", "lyrics": "[Intro:]\nAye yo Nebs\nI think this is that flavour that's gonna\nLook, (it's like) look, look\n\n[Verse: 1]\nI'm feeling smoother than ever\nI'm rocking Gucci with feathers\nShould see me move man I'm clever\nI got the movement in cheddar\nI take a 2 add some letters\nAnother 2 5 together\nThat means the crew is forever\nYou never knew of it better\nSpitter or rapper\nJust stop the chitter and chatter\nFlow live a shiv in the bladder\nKicked in the fucking' door\nLike I ain't even heard of Aussie Rap\nNow other rappers scratch their heads\nLike \"Jesus Christ, what was that?\"\nHe ain't say a barbeque or even mention politics\nHe did say that he wants us dead\nOur baby mums can swallow dicks\nIt worked for him like fuckin' hell\nHis selling out his shows and shit\nHe ain't got no showman-ship\nCos he ain't gonna show men shit!\nI hang around the type of cunts that stay hypin' up\nThey don't wanna fight for cash, they just wanna fight for blood\nDo you like or love the reason why I rise above?\nI'll slap your little sister down until she gets me - lighten up!\n\n[Hook x2:]\nPunchline, yeah they waitin' on that\nIt took me 10 damn years to create where I'm at\nSo if you even have a thought of ya takin' it lad\nExpects a fucking avalanche to be breaking your back\n\n[Verse: 2]\nI'm crushing pills, use your pussy as a pill press\nThen put a pussy on the pill, once the pill's pressed\nI'm the ill yes\nI'm the sickness\nI'm the rapper keeping Aus alive, rappers still stressed\nMy price rised over a couple of months\n3 massive tour, I can't even 'member the cunts\nI got some boys that are loyal, they all got my back\nSo if you ever pop at me they gonna pop you back\nBack, back, then back again\nUntil ya slap, trap, hacked\nThen you wrapped in bin\nI'm a Rap King\nHalf the age of what you call Rap Kings\nThey never want beef, they just call it a 'rap thing'\nWhen Nebs was in jail, he was doing his stretch\nI was working on the rhymes for the future I guess...\n\nIt's now x5\n\n[Hook x2:]\n\n[Verse: 3]\nThere's no effort in the shit that you do\nIt's quite obvious, that's why they don't listen to you!\nI'm the Kers, controversial, drinking the purple\nABK, that the circle\nHater's getting murked\nIf I'm out of the club\nI'm surrounded by cunts\nSo much pussy tryna touch me but I'm outta ya slut!\nNo times for the games, I'm strange in my brain\n\"04 on the train to the city again\nRun a muck, back then, you could hear me flow\nI've been out thinking that was almost 10 years ago!\nI started from the streets, so that you know that it's real\nAnd back then, ain't nobody gonna throw me a deal\nSo I got my hustle on, with the skill it was obvious\nThat I be running rap and I'm standing at the top of it!\nThere's the cocky shit\nYou wanted the young Kers\nI could kill a motherfuckers life, in 1 verse!\n\n[Hook x2:]\n\n[Outro:]\nWhat up Nebs\n225 ABK\nTop of this shit\nAnother NEBS production\nYou can't get beats like this"}], "artist": "Kerser"}