{"artist": "Kirk Knight", "songs": [{"image": "https://images.rapgenius.com/db8f36f41df818dbb6e6e8d75d7102e6.500x500x1.jpg", "title": "Knight Time", "year": "2015-08-28", "album": "Late Knight Special ", "lyrics": "[Hook]\nWhat the fuck you know about the knight time?\nAlright, what the fuck you know about the knight time?\nI said, what the fuck you know about the knight time?\nI said, what the fuck you know about the knight time?\n\n[Verse 1]\nEverything's alive in the knight time\nTook baby steps still stuck at the crib\nTrain to thought was off the rail got broke\nNow I'm street smart unstable album givin' ribs\nThese are my sons and life so hard\nThey own mother couldn't even feed them through a straw\nEquipped to the core\nEver since birth my nigga you been staring at the mutha'fuckin' plug, damn\nFam turned to famine, never been a fan of it\nPhantom power tucked\nNever catch me on the scene cause a nigga go ghost\nRecordin' the low so these niggas look up\nNever in the midst of things\nSo much broken souls boy got damn thought it was pourin'\nAnd the hoes only want you if you scorin'\nBut I'm sorin', living in drought\nThe only good thing is how life has taken you out\nSo much stress and it wrinkles to oh\nAlready me against the world\nNever get along, never pout\nIf the cops come we dippin' and we out\n5-0 dot and we gotta draw the line\nCause it's sign to the end and there's [?] just to find my beliefs\nNow a nigga only way is a move\n\n[Hook]\nWhat the fuck you know about the knight time?\nAlright, what the fuck you know about the knight time?\nI said, what the fuck you know about the knight time?\nI said, what the fuck you know about the knight time?\n\n[Verse 2]\nKnight time nigga, ain't no hours in the day\nThree sixty-five, be the thief in the night\nDon't sleep, we creep, flip scripts my way\nSign me up, logged out age of fifteen\nPark side, dark side, nigga on the scene, CP3\nAdrenaline rushes, I'm rushing the stage\nThis is not staged\nI do not play, lowest of keys\nBeen working the [?] flow\nCreating a life, there's no pianos to me\nNiggas that I show love, they dropping like flies\nTear duct dry, no cries in these eyes\nJeremiah lies, I'm being deceived, inner child in me\nSeen better days, when it's simple things\nSuch a [?], open to the world now\nCutting all the scenes, you are diseased\nSurrounding me around the people that I love\nThose partners, I call 'em apostles\nSaint Paul born and you know that I'm riding\nAnd my pros are with me\nAin't witnessed the change, I'm ready to eat\nI'm last to the supper, now drinking divine\nDivine I will be\n\n[Hook]\nWhat the fuck you know about the knight time?\nAlright, what the fuck you know about the knight time?\nI said, what the fuck you know about the knight time?\nI said, what the fuck you know about the knight time?\n\n[Outro]\nEverything's alive in the knight, knight, knight, knight, knight, knight, knight\nEverything's alive in the knight, knight, knight, knight, knight, knight, knight\nEverything, everything\nEverything's alive in the knight, knight, knight, knight, knight, knight, knight\nSwear to, swear to God\nEverything's alive in the knight, knight, knight, knight, knight, knight, knight"}]}