{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/42281596b18a280da263b6c5dbe8f23e.540x540x1.jpg", "year": "2013-02-26", "album": "Trunk Muzik Returns", "lyrics": "[Intro]\nMello Yello can in my hand,\nMullet hawk, what?\nCountry folks don’t talk much\nThey just get to work sawdust (sawdust)\n\n[Interlude]\nYou know my Uncle Critter said\n\"You look like you been shot at and missed\nShit at and hit\"\n\n[Chorus]\nOn that ass, bitch\nBumpin’ this funky-ass shit to ride to\nYeah, and I be bumpin’ this funky-ass shit to ride to\nYeah, on that ass, bitch\nAnd I be bumpin’ this funky-ass shit to ride to\nTrunk Muzik, bumpin’ this funky-ass shit to ride to\n\n[Verse 1]\nMello Yello can in my hand,\nMullet hawk, what?\nCountry folks don’t talk much\nThey just get to work sawdust\nChainsaw, axe, knife, cut firewood, burn, logs, heat\nSleepin’ bag by the bricks: call me the fly, I’m on some shit\nDrum this out with two sticks\nSupa hot’s too cool for new kicks\nZoom, raps make mummies jealous from a tomb\nKnock twice if you feel it\nBorn to rip, I should’ve been\nPerforated by the rings like a Mead notebook\nSquares want an artery blocked when I’m around\nCirculated, nerds are in, Urkel made it\nI’ll slap Urkel, take his lunch money\nPunks they run from me, drunk and upset\nBut I don’t run clumsy, punch a perp’\nA one, two, three: I’m at the Chelsea Hotel\nLike Sid & Nancy with the knife, and two grams of candy\nGive me the dizzies, fee, fee, fuck me\nPlease oh please don’t leave\nJust give me the keys and crank that beat\n‘Cause I might double up and straight dry heave\nBut believe, oh believe I’m cold, I’mma freeze this beat\nLike Freon, frickin’ neon, that’s me glowing in a snowstorm\nLook here, we in these streets like a pair of Nikes\nWell, I might be more like a pair of nice jeans, cause I’m…\n\n[Chorus]\nOn that ass, bitch\nBumpin’ this funky-ass shit to ride to\nYeah, yeah bumpin’ this funky-ass shit to ride to\nOn that ass, bitch\nAnd I be bumpin’ this funky-ass shit to ride to\nYeah, and I be bumpin’ this funky-ass shit to ride to\n\n[Verse 2]\nSo what’s new?\nBeen on that shit, where’s the atlas?\nThumbtack it, South Cackalack it, Alabama has it, go\nRelax in a 1985 box train, perhaps I’m playin’ Relapse\nBoss, Eminem saw the gem in him\nOh, me? Yeah, who thought?\nJust toss the white trash out the window\nNow I’m in a ditch like broken pencils\nEmpty bottles and stolen rentals\nThis one is for all my kinfolk\nYeah, bring ‘em in, though\nOut the rain, what’s a friend for?\nWord, oh for sure, yours truly, at the door\nHad to add a syllable to that word\nCountry, but, oh, of course\nBitches go berserk for certainly, no need to be coerced\nOdd economy, don’t need no nine-nine-nine-nine-nine and I know\nJust the na, na, na, na, hey, hey, hey, goodbye, and hey, let’s roll\nThese hoes are no good, pills are okay\nI just wanna get high, fuck what you say\nWild, the pen-play kind of like a samurai sword\nWith a Bic bitch, bow to sensei\nMotherfuckin’ bitch, it’s pay your rent day\nDo I not look like my name was MJ\nOne glove and a fuckin’ pair of penny loafers\nAnd I moonwalk on the tempo like Billy Jean is not my friend, no\n\n[Chorus]\nOn that ass, ho\nBumpin’ this funky-ass shit to ride to\nYeah, yeah bumpin’ this funky-ass shit to ride to\nOn that ass, bitch\nBumpin’ this funky-ass shit to ride to\nOn that ass, ho\nBumpin’ this funky-ass shit to ride to\n\n[Outro]\nYeah, I’m on my shit now…\nYeah, I’m on my shit now…\nYeah, I’m on my shit now…\nYeah, I’m on my shit now…\nYeah, I’m on my shit now…\nYeah, I’m on my shit now…\nLet’s go, let’s go, let’s go\nLet’s go, let’s go, let’s go\nLet’s go, let’s go\nYeah, I’m on my shit now…\nI’m on my shit now…\nI’m on my shit now…\nI’m on my shit now…\nI’m on my…\nYeah, I’m on my shit now…\nI’m on my shit now…\nLet’s go!\nYeah, Lunch break\nDon’t worry for the day\nI’m bout to get slung under\nSlung under..\nSlumerican\nSupa-supa-SupaHot Beats\nCatfish really though”", "title": "F.A.S.T Ride"}]}