{"artist": "Asher Roth", "songs": [{"title": "An Open Letter From Asher Roth: XXL Exclusive Excerpt", "image": "https://images.genius.com/d2428ce0d129ae1116dae83c31fd96ce.800x450x1.jpg", "album": "XXL", "lyrics": "“It was in 2008 when I signed my first record deal. Steve Rifkind took a chance on me after hearing a few bars about equality and an animated Gaby insisting ‘Do not let this kid leave the room.’ I celebrated like any 22-year-old would by dropping out of school and moving to Atlanta with a few of my college buddies. Scooter Braun took responsibility for us hooligans and fostered us into a seasoned starter home on Standard Drive. That Spring we let loose a compilation of recordings we made in our rat-infested basement dubbed The Greenhouse Effect Volume 1. Rounding up some local friends, we shot a video in our living room for a track called “Roth Boys.” The following weeks were spent yelling ‘We on the couuuch’ and/or ‘Who’s in your mouth!’ Excitement ensued and we intensified it by placing a song “I Love College” on my MySpace page. My beer pong skills soon went on to receive recognition and before long we had been plucked from The Greenhouse, released a ‘debut’ album Asleep in the Bread Aisle and placed on tour with fellow [XXL] freshmen Kid Cudi & B.o.B. The Great Hangover had begun.\n\nMy life in 2009 was full of experiences that happened so fast I’m glad we taped it. Asleep in the Bread Aisle debuting at number 5 on Billboard along with a successful nationwide tour had left me with somewhat of a career. I met a girl the summer after tour concluded and decided it best to spend my next chapter in New York.\n\nI owe a lot to my time in New York. I met some amazing people who are still very impactful on my life today. I also learned that nobody really gives a fuck. Not in a depressing, cynical way. It’s just that nobody cares about you more than you do. My manager, Scooter, had begun to harbor other talent and the business was starting to take the forefront. The label had begun its search for “I Love College II” and I was only interested in compiling household recordings over some of my favorite beats, which became known as Seared Foie Gras With Quince And Cranberry. I remember recording “I’m Eddy” and feeling like I had accomplished something. Something I was proud of. For the most part, nobody at the label really gave a shit. No offense to me, as I understand it’s their job to concentrate on hit records and not great verses over Dipset beats. Budgets became scarce as the label turned to expensive solutions to find something for the radio. All I could do was vent my frustration in an EP called Rawth with boom bap extraordinaire Nottz Raw.\"\n\n...\n\n\"Still there’s nothing I would change about these past 4 years. I’ve learned too much. I’ve learned about who I am. I’ve learned about where I am. I’ve learned about what I’m doing. I’ve learned about picking your battles. I’ve learned about patience. I’ve learned about communication. About being part of a team. I’ve learned to shut up and listen. These last few years have instilled in me an understanding that vision and commitment go a long way. That the scenic route takes time and isn’t easy but it is by far the most rewarding. I’ve learned to spend time with people you love. Doing what you love. To surround yourself with people who inspire and believe in each other. People who encourage you to just do your thing.\n\nThat is why I’ve decided to stray from the path UMG has laid for me and continue on the scenic route. I prefer to relay my music directly to my fans. Show them what it is I see. Share with them what it is I think. I enjoy letting you hear free-flowing ideas recorded in basements and broom closets. Who cares that they will probably never be heard on the radio? I want to be proactive and not reactive and I would rather nothing get in the way of the relationship I have with my family, friends, fans and my music.\n\nI encourage you all to do the same. Do your thing. Do it every day. Do it unapologetically. Don’t be discouraged by criticism. You probably already know what they’re going to say. Pay no mind to the fear of failure. It’s far more valuable than success. Take ownership, take chances and have fun. And no matter what, don’t ever stop doing your thing.”", "year": null}]}