{"artist": "Pharoahe Monch", "songs": [{"album": "Desire", "title": "Hold On", "image": "https://images.genius.com/9550ab49453d639d9e2d3a07226ff0ed.500x500x1.jpg", "lyrics": "[Intro]\nErykah Badu: You're beautiful, you know that?\nYoung Girl: Uh huh\nErykah Badu: Do you know that?\nYoung Girl: Yes\nErykah Badu: You do?\nYoung Girl: Um hum\nErykah Badu: You know when those kids tease you\nYoung Girl: Uh huh\nErykah Badu: Don't you ever worry about that because you are very beautiful\nErykah Badu: Do you know you're beautiful?\nYoung Girl: Uh hum\nErykah Badu: Are you ready?\nYoung Girl: Ma, I love you\nErykah Badu: I love you\n\n[Verse 1 - Pharoahe Monch]\nHe pushed down and called her black and ugly\nShe asked \"why must you tease me?\"\nHe laughed at her said, \"you're from Africa, your hair is peasy\nYour skin is dark and greasy\nAnd plus you are so beneath me\"\nPlease trust me it wasn't easy for Diamond, it scarred her deeply\nPlays like a Fender bass\nTo myself thought how much does gender play?\nRememberin such hatred at this tender age\nIf I could send a mental page\nMy thoughts would end the rage\nReminiscin of the looks to her in class I gave, my eyes would say\n\n[Hook - Erykah Badu]\nHold on, I'm sure, that there's so much more to live for\nIf you hold on, things'll change\nSo come on, be strong\nAnd hold on, I'm sure, there's so much more to live for\nAs you grow strong, things'll change\nNo pain (no more pain), no gain (no more pain)\n\n[Verse 2 - Pharoahe Monch]\nPlease be willin to fight for your will despite writings from William Lynch\nMillions tried to rise like helium, but died in the fields and the trenches\nCries from the killing is senseless\nEyes to the ceiling, it quenches a thirst and a feeling that's endless\nThe prize like a rain that wrenches the soul and cleanses your mind from white picketed fences\nHeads up your ass, splinters in face, mentally ridin benches\nThe masters, pastors, disastrous but fascist bastards\nThey crafted this hazardous plan, that still has us broken and battered\nWe shoulder the struggle\nWith the weight of a boulder that muffles the sound of provocative thinking, the pieces of puzzles\nIncompleted, only deleted\nTo be pushed to the back of your mind like a hairline that has receded\nNow we repeated, the process, but never weeded the problem out\nHeeded the warnings but never proceeded to solve it\nNo forward progress, it's obvious the soul is gone\nI meditate and pray that these words will somehow allow you to\n\n[Hook]\n\n[Verse 3 - Pharoahe Monch]\nSee now Diamond is priceless\nTimeless, how she maneuvers like Heimlich\nIn this new world it remind me of Isis\nShe knows now that her complexion is a holy device\nA protection from UV rays in this negative time of crisis\nLike a knife through butter slices\nEasily to anger she reacts pious\nLike a cell protectin itself from a virus\nTwice is strong is her demeanor, now she is righteous\nGod is what you see now when you peer inside her eyelids\n\n[Hook]\n\n[Outro - Erykah Badu - singing]\n(*harmonizing*)\nYou're so beautiful\nYou can change this world\nIf you want to girl\nOhhhhhh, ewwwwwwwww\nNow come on, hold on\nGrow strong", "year": "2007-06-26"}]}