{"artist": "Yukmouth", "songs": [{"album": "Thug Lord: The New Testament", "image": "https://images.genius.com/35680e47bf5602cb32bedf4290f16072.600x600x1.jpg", "year": null, "lyrics": "[Talking]\nIntroducing, (whoa) the worlds...(it's the world's most hated nigga)\n...hated nigga, yes, you know what I'm sayin'?\nY'all niggas ride Bentley's (Bentley's), not Mercedes (not Mercedes)\nBentley's (Bentley's), so why y'all niggas hatin' on me?\n(quit hatin', nigga) Y'all got money (what? what? nigga)\n\n[Verse 1]\nMama used to say: \"Watch your friends\", cause they be fake as fuck\nNiggas smilin' in my face, I'm knowin' they hate my guts\nThey hate the way I bust, hate the way I strut\nThey wanna take my stuff, kill a nigga to make a buck\nThey even hate the way I fuck, cause I fuck they ho's\nWhen I bust, fuck up their flow, Yuk untouchable\nPlatinum make a nigga tuck his gold, Ice up his robe\nMy lyrics touch your soul, make bitches rush the flow\nI give it to 'em raw, regaurdless of what squad\nI'ma hit 'em hard if they get envolved, break them niggas off\nLet 'em know I'm rollin' with god, roll with the MOB\nIf you fuck with one of us, the whole club about to squab\nYour bitch gettin' shot, even your mama gettin' robbed\nFuck try'na hold haah, I sold rock, I sold haah\nFrom the thug spot, coke spot, post up, and tote Glocks\nGot it if you snort haah, got it if you smoke rocks\nIt don't stop late, niggas get dropped from labels\nFor fuckin' with a nigga that's hot and fatal\nI'm like the henny, rock the cradle to these little ass pre-schooler\nNursery rhyme niggas, still ridin' beach cruisers\nDude, I see through you, cause you're plastic\nBring the beef to you, put the heat to your vlastic\nFuck the last album, this a classic\nFags get put inside a casket, cliques get blasted\nBy them niggas tatted with dragons\n\n[Hook]\nI'm try'na live one time shine (why can't a nigga ball like y'all\nWith platinum plaques on my wall?)\nBut y'all niggas platinum, what's mine? (they don't wanna nigga to shine at all\nThey wish a young nigga would fall)\nCause I'm the world's most hated, world's most hated\nWorld's most hated nigga, nigga\nCause I'm the world's most hated, world's most hated\nWorld's most hated nigga, nigga\n\n[Verse 2]\nYou need to quit it, all I got is 6 digits, you got meal tickets\nTalk slick in your raps, and pillow talk to bitches\nY'all niggas ought to quit it, god's my witness\nOr face the consequences, like when Eryka Badu sparks an inscent\nYou 'bout to get lalla-byed, rock-a-byed\nPopped the guy, shot the guy, then went in the pockets of his Karl Kani's\nRobbed the guy, got the guy, don't forget to dot your eyes\nCross me, you got to die, I'mma ride\nMAKE YOU FEEL LIKE PAC ALIVE!\nThe Thug lord, prophesize, bring the west back\nShit on them niggas with no ex-lax\nMake them bitches eat, check that\nThen put my tape in, make them niggas respect that\nAnd stop P.H.in', and congratulatin' the nigga they facin'\nWho went from section 8, to makin' money, listen to revelations\nAnd Jags and Navigations, Playstation, stay breakin'\nPlatinum deuce, conversations to rule a thug nation\n\n[Hook]\nI'm try'na live one time shine (why can't a nigga ball like y'all\nWith platinum plaques on my wall?)\nBut y'all niggas platinum, what's mine? (they don't wanna nigga to shine at all\nThey wish a young nigga would fall)\nCause I'm the world's most hated, world's most hated\nWorld's most hated nigga, nigga\nCause I'm the world's most hated, world's most hated\nWorld's most hated nigga, nigga\n\n[Verse 3]\nCome with me, go toe to toe with me\nStill the king of the O. would be that nigga smokin' weed\nY'all wanna be soulja's sweet like potpouri\nI crust your fuckin' text like a buldozer go hungry like vultures be\nFake niggas wish they never spoke on me\nOr said shit about that thug nigga, leavin' they head split, detted\nI'll make you muthafuckaz regret it, get wetted with the gun\nFor try'na gas me like unleaded, I ain't the fuckin' one, one, one\nSo take that gum out your ass hole\nFirst round, T.K.O. his ass like \"Glass Joe\"\nI lash you, harass you, thrash you\nSmash you, blast you, I put holes in your shirt like cash do\nI probably have to stop to find his ass too\nHit the avenue, in his strip, bullet proof Nav. too, if niggas was after you\nTry'na catch you niggas, jack you for puttin' a nigga name in your raps, fool(fag you!)\nWell, that's your ass, dude\n\n[Hook]\nI'm try'na live one time shine (why can't a nigga ball like y'all\nWith platinum plaques on my wall?)\nBut y'all niggas platinum, what's mine? (they don't wanna nigga to shine at all\nThey wish a young nigga would fall)\nCause I'm the world's most hated, world's most hated\nWorld's most hated nigga, nigga\nCause I'm the world's most hated, world's most hated\nWorld's most hated nigga, nigga\n\n[Talking]\nThere you have it, another muthafuckin' classic\nNigga, you ride Bentley's (Bentley's), not Mercedes (Not Mercedes)\nBentley's (Bentley's), nigga quit trippin' on me, bitch\nQuit hatin' on me, bitch, you got all the fuckin' money, nigga\nI ain't the fuckin' one, one, one\nNigga, Regime Life, what? what? Regime Life\nMy nigga Mad Max: Regime Life\nMy nigga LQ: Regime Life\nMy nigga Phats Boss: Regime Life\nMy nigga Ke Ke: Regime Life\nMy nigga C-Bo: Regime Life\nMy nigga Diesel Don: Regime Life\nMy nigga Gov Matic: Regime Life\nFuck hater niggas, you niggas be bitin' songs, niggas be hatin' niggas\nY'all got all the money, man, make room for the young niggas\nLet us get some paper, nigga, sit your ass down, nigga, be executive, nigga\nDo your thug thang, nigga, and I'mma do mine\nYou stay out my fuckin' way, and I'mma stay out your way, you bitch\nRegime Life, done deal...", "title": "World’s Most Hated"}]}