{"songs": [{"year": "2008-01-29", "title": "Escape Artist", "image": "https://images.genius.com/53b6cf23d3b9c3491d5918ea4087005b.640x640x1.jpg", "lyrics": "[Verse I]\nWhen I first got into magic it was an underground phenomenon\nNow everybody's like, \"Pick a card, any card\"\nIf I shot my full load with the first hand I played\nI'd be a monkey in a box\nHangin' with the David Blaines\nI'd be swimming with the sharks\nMouths full of razorblades\nBut I'm not\nI got outta that game\nEscape artist\nI talked till I'm red in my face\nWith strained polyps\nI rock till I'm outta my range\nThen raise octaves\nI play through the pain\nAnd remain conscious\nRefraining from commenting on the lame compliments\nAnd the petty criticisms from those who ain't accomplished\nEven one-fifths of some of the shit\nI've made progress with\nI'm leavin' naysayers stumped like rain forests\nAfter years of pullin' rabbit ears out my pants pockets\nI'm not revealing any tricks of the trade\nIt's just there ain't no magic in the breakdown, baby\n\n[Hook]\nIn an effort to make ‘em all see what I found in my life I decided to give 'em a look\nNone of 'em gave it a glimpse and I guess that I’m sitting in the middle of an unread book\nLetters are falling apart but the sentences stand on their own and the wording is permanent\nNever been missed, I've just been misworded and misinterpreted, it’s\nFunny how serving a sentence of solitary confinement\nResults in the death sentences filling my writing assignment\nI'm just wondering where my time went\nIt pulled a disappearing act\nAnd every single assistant I ever had got sawed in half\n\n[Verse II]\nCause see I never paid attention but I can't afford to laugh (word?)\nCause I'm lookin' through my break\nAnd an autograph for my cast (Ok)\nAnd I'm short on staff\nSo all I ask is volunteers from the crowd\nShow a little bit of audience participation now!\nWhen I say \"hip\" (What do I say?)\nYou? You say, \"Shut the fuck up; we ain't sayin' shit!\"\nAnd I respect it (yes!)\nCheck it\nIn a flair for the dramatic exit\nA fashionable entrance late to my own arraignment\n(Oh) The self-destructive things that I do for entertainment\nMy folks gave me this heart you broke and heart is my pallet\nWhile I was out honin' my craft\nYou were disownin' your talent\nThat's why you still live at home\nAnd I bought this house off my parents (uhh)\nI'm gettin' ahead of myself (I'm gettin' ahead of myself)\nI see the hair on my back (I see the hair on my back)\nI'm on the road reading Kerouac\nHis poems versus better raps\nI think to myself (I think to myself)\nWhat's worth remembering\nVersus defending\nThe size of my manhood\nOr confessional canned goods\n\n[Hook]\nIn an effort to make ‘em all see what I found in my life I decided to give 'em a look\nNone of 'em gave it a glimpse and I guess that I’m sitting in the middle of an unread book\nLetters are falling apart but the sentences stand on their own and the wording is permanent\nNever been missed, I’ve just been misworded and misinterpreted, it’s…\nFunny how serving a sentence of solitary confinement\nResults in the death sentences filling my writing assignment\nBut none of this is gettin' told in confidence I reckon\nI spin confidential records just to hold the listeners attention\n\n[Verse III]\nI'm a veteran of spacial relationships\nI clip your wings to fit you in\nHeadshrinking magician\nShapeshifting reptilian\nTurned body contortionist\nOrphanages started offering torches to abortion clinics (abortion clinics)\nI lost acquaintances\nAnd a morgue of lady friends\nI gender bent the heaven sent angelic devil boy\nGood Gods androgynous\nI'm lookin' marvelous\nBut looks can kill\nAnd they're unsure about my sexual orientation still\nPut me in a special kind of case that only breaks if\nYou hit it with a bouquet of flowers and baby breath arrangements\nThe vault is vacant\nAnd they're all looking for fault for blame\nI called my agent\nThe moment that I caught the train\nI let him know that I'm goin' nowhere\nHe's invited\nIf he leaves tonight then he might just help me find it\nBut this is my burden to bear\nNot his\nAnd I'm a psychic without a sidekick\nHolding the future hostage\nA loose cannon standing on the rooftop with\nA new respect and understanding of bartenders and locksmiths\nThey call me daredevil\nBut I'm not precise enough\nUnprofessional\nOn an amateur level\nI love my life too much\n\nEscape Artist (x4)\n(Escape, escape)\n\nEscape Artist\nI'm in two places at once\nEscape Artist\nBut I ain't slept in months\nEscape Artist\nJust tryin' to get away\nBut there ain't no magic in the breakdown baby\n\nAin't no magic in the breakdown baby\nNo magic in the break\nAin't no magic in the breakdown baby\n(x3 and continues as Sage speaks)\n\nPussies\nYou're scared to shoot me in the heart\nYou know it's too big!\nUhh!\nYeah, fuck you\nI got a bulletproof heart\nHit it, baby\nI'll never fall in love with you\nEver!\nIf you got glass so long too\nBiyatch shut up", "album": "A Healthy Distrust"}], "artist": "Sage Francis"}