{"songs": [{"year": "1994-11-08", "album": "The Most Beautifullest Thing in This World", "image": "https://images.genius.com/447c633e96f2be906b387d1114ff07c4.953x953x1.jpg", "title": "Escapism", "lyrics": "[Redman]\nHooo-ahhh!\nHigh as a motherfucker\nZonin on cloud nineteen as the Def Squad takes you\nOn another eerie place... of a dark side\nYesssss!!!\n\n[Keith Murray]\nI escape from the world\nTo show niggas that my style is superb\nFor what it's worth I'm gettin off planet Earth\nBut I gotta redefine gravity first\nSo I figure, I get my guns and I bust the biggest cap\nFrom the demand of the trigger\nI'm equipped to dip with a knapsack\nAnd a survival kit, with blunts n shit (word!)\nI'm in all black, ?with a face? money\nWanna double to NASA, to hijack a space shuttle\nMore ages than curiosity\nI enter the backdoor with animosity (\"Yeah, here's Murray!\")\nSearchin for the astronauts, checkin my watch\nDetermined the time I had to be out\nI saw my prey without a second delay\nSuited up, strapped down, straight and on my way\nFor five seconds to liftoff I was in the Hell\nWhen I escaped from the world\n\nI escaped from the world (4X)\n\nSo far...\nI went through a Milky Way of stars\nAnd landed on my destination, which was Mars (whoa, shit!)\nThis planet was foreign and new\nAs I'm puffin on a blunt, observin the view\nTo my surprise, a spaceship arrived\nOut came a Martian, with six fingers and three eyes\nHe spoke a bleeky type of dialect (\"Bleek, bleek bleek bleek bleek bleek\")\nBut understood my form of intellect\nI said, \"I'm Keith Murray from the planet Earth\nBoy I'm psychosomatic and homicidal with a verse\"\nMy hypercritical form of words busts his brains\nAnd then the whole atmosphere changed (\"What the fuck?\")\n\n\trrarahrhagharhar rharhagahgahrahgh\n\nI was surrounded by some Martians in the hut about to front\nI used my last resort, and pulled out the Blunts\nLit it, got the whole Martian crew blitted\nSo now's my chance to try to get acquitted\nI said, \"I escaped from the planet Earth\nTo let my mind untwirl because I'm mad at the world\nAnd the murder wasn't premeditated\nMy language was just mis-interpretated\"\nOne acknowledge I'm right and pulled out the peace pipe\nAight?  About to set the vibes right\nHe lit it with his finger, I smelled the Martian buddha linger\nI felt good cause I released some anger\nNo sooner than the cease of the herb ignite\nI was headed back to Earth at the speed of light\nUpon my return niggas thought I was in jail\nNah kids... I escaped from the world\n\n[Redman]\nAs we zone, on the cosmic type of funk\n(escapism y'all)\nWe drop mad flows, for the 1990's\n(escapism y'all, escapism y'all)\nThe Funk Doctor Spock signin off live\n(escapism y'all, escapism y'all, escapism y'all)\nThis is how we do\n(escapism y'all, escapism -- escape from the world)\nFlows enough for the nineteen ninties and we OUT!\n(escapism y'all)"}], "artist": "Keith Murray"}