{"artist": "Porta", "songs": [{"album": "No es cuestión de edades", "title": "He cambiado", "image": "https://images.genius.com/1d76236de7af6962571eed68e31756dd.768x768x1.jpg", "lyrics": "Yeah! He cambiado. Hemos cambiado\n\n[Shinoflow]\n¿Habré cambiado tanto, me habré vuelto mas tonto?\n¿tendré algo de razón si llego tarde y aun es pronto?\n¿habré volado mas alto que los pájaros?\n¿habré tocao el sol, me habré quemao y habré bajado?\nSi he cambiado mírame a los ojos y descúbrelo\nTu velocidad se habrá parado por algún reloj\nPues veo que no reconoces\nEl roce de mi corazón latiendo en altavoces\nSube el bombo, tu eres un bombón y yo era un monstruo\nY yo en tu rostro vi los restos de la brisa del agosto\nY parece que fue ayer pero será mañana, ¿no te jode?\nTenemos poco tiempo pa que encima nos lo roben\nQuiero marcharme en un land rover hasta el monte\nDonde note el norte sobre el corte de horizonte\nSi!, que se vuelvan verticales\nShinoflow el presidente de los estados mentales\nPrefiero morir soñando a morir despierto\nDormir en un desierto\nDe palabras donde el agua es el silencio\nQue mi corazón reclama\nCuantas de las que llevo a la cama\nValoran mas el alma que mi fama\nNo se, yo soy el mismo con corbata\nEl acróbata de ritmos, te lo explico hasta en pijama\nPijo, pídele a mama mi disco\nQue no te va de sol si veraneas en San Francisco\n\n[Estribillo]\nNo he cambiado, como tu quisieras primo\nCambié lo suficiente sin salirme del camino\nNo he cambiado ni la mitad que el resto\nPero he cambiado el doble que vosotros por supuesto\n(x2)\n\n[Porta]\nQue he cambiado, traigo combo, ¿como?, mi rap mejorado\nClaro grabo con... y voy subiendo los peldaños\nAños pasan y el rap en España sigue igual de sectario\nHay cambios de mal en peor, no soy un rapero de barrio\nEs necesario aprenderse el abecedario en la EGB\nMi vocabulario va mas allá y eso que no hacia los deberes\nYa no juego al Mario Bross no, ahora hago rap a diario\nDe años sabático estoy, tacho días del calendario\nEste es mi código binario, los cambios son experiencia\nVarias ganas de avanzar, evolución y consistencia\nEsfuerzo, trabajo y paciencia es lo que hacen de mi un mc\nCambiar pa bien o pa mal solo dependerá de ti\nNo dejes que te manejen como un títere\nMe enteré de que dependes del que solo te quiere por interés\nNo es que te pusiste a fumar y a beber por ordenes\nDe quienes te hieren y tan solo quieren su bien\nRectificar es de sabios, cambiar pa mal es de tontos\nPor un camino puedes quedarte solo y perderlo todo\nY tendrás que empezar de cero, así que es simple, se tu mismo\nCambias como el tiempo al tempo del ritmo en este sonido\nTu forma de ser se forma por norma, tu estilo cambia\nEl reloj no se para y nos separa de la rutina mas rutinaria\n¿que harías tu si ahora todos cambian contigo?\nPiensa, actúa y no dejes que influencias te lleven por el mal camino\nSi lo haces luego no te reconocen\nTu conciencia hace cruces de cables ni tu te conoces\nSalir con gente nueva o distinta de otra forma funciona\nSe fiel a tus principios, no cambies, evoluciona\n\n[Estribillo]\nNo he cambiado, como tu quisieras primo\nCambié lo suficiente sin salirme del camino\nNo he cambiado ni la mitad que el resto\nPero he cambiado el doble que vosotros por supuesto\n(x2)\n\n[Cansino]\nAunque cada día estoy mas chungo de lo mío\nNo me faltan las ideas ni las ganas, mira\nPongo sorna en cada línea por placer, volví a nacer\nMe hice las paces y cambie mi cara plana por sonrisas socarronas\nAsí sin mas, la suma del total es cero\nMantengo el equilibrio muchos se picaron\nYo aguanté el tirón, soy pícaro ¿cuestión de potra?\nNo lo creo como Casparov prefiero estarme quieto\nAntes que dar pasos pa atrás de mal agüero\nPero pájaro de todas maneras, vuelo libre\nMas vigilo tras mis posaderas, que después de esta escalera\nNo puede haber nada bueno, que será , será\nDemonio en cuerpo de pantera, imposible seguir sereno\nAlteras mi temperatura víctima del desenfreno y sano\nPierdo la cordura pero la encuentro tarde o temprano\nY vuelvo pa seguir siendo el mismo fulano\n\n[Estribillo]\nNo he cambiado, como tu quisieras primo\nCambié lo suficiente sin salirme del camino\nNo he cambiado ni la mitad que el resto\nPero he cambiado el doble que vosotros por supuesto\n(x2)", "year": "2006-06-11"}]}