{"artist": "Prince Paul", "songs": [{"album": "Psychoanalysis (What Is It?)", "title": "Booty Clap", "image": "https://images.genius.com/2e62c87c2fc12d70ea466dbe46b314e0.599x599x1.jpg", "lyrics": "I said watch your language! Hahah\n\nARRUF! AwwwwwwwwAHHHHHHHHHHHHHHHH\nAHHHH-right about now, once again it's on\nCheck it out, we about to do the booty clap\n\nTo New York (make that booty clap)\nMiami (clap that booty)\nD.C. (make that booty clap)\nCleveland (clap that booty)\nNew Orleans (make that booty clap)\nDallas (clap that booty)\nAtlanta (make that booty clap)\nL.A. (clap that booty)\n\nAlright now\nIf you're proud of yo' ass and you like yo' ass...\nAnd you know yo' ass got it goin on...\nI want you to line right on up right up in here\nAnd make your booty clap, c'mon\nIf you know what you're doin, and you got that control...\nGet in the know, show me whatchu got\nMake it bounce now, everybody\nWave your hands in the air\nAnd wave em like you just don't care, c'mon!\n\n(Girls!) Dance (Get that ass in the air!) C'mon!\n(C'mon get that ass up! Ass up!) C'mon get that ass up!\n(Girls!) C'mon! (Get that ass in the air!) Over here!\n(C'mon get that ass up! Ass up!) C'mon get that ass in the air\nNow girls! (Girls!) Dance (Get that ass in the air!) Throw it here!\n(C'mon get that ass up! Ass up!) I wanna see that booty, c'mon!\n(Girls!) C'mon! (Get that ass in the air!) C'mon!\n(C'mon get that ass up! Ass up!) Alright, c'mon\n\nGirl the way you booty clap\nMake me wanna booty smack\nSmack that butt all over the club\nTake you home, put you in the tub (UHH!)\nAnd make sure you wear that tight black thong\nSo I can have a private show ALL NIGHT LONG\nNow I got chills cause she's got skills\nMakin them buttcheeks clap at will\n\nNow c'mon girl, we can swing an ep'\nTake you to the crib, YOU KNOW WHAT'S NEXT\nCall your friends and I'll call mine\nAnd we can do this type of thing, all the time\nCause girl you know we get sic-wid-it (UHH!)\nDo it so hard make you throw a fit (UHH!)\nGirl you know there's no time to waste\nWhen you clap that ass all in my face\n\nAwwwwwwwwAHHHHHHHHHHHHHHHH\nAHHHH-right about now, all the ladies\nIf you wanna see the dick, then let me know you wanna see it!\nC'mon, let me hear you!\n\nUp! Up! Get it up, get it up! (GET IT UP!)\nUp! Up! Get it up, get it up! (C'MON!)\nUp! Up! Get it up, get it up! (Now fellas)\nUp! Up! Get it up, get it up! (if you wanna see the ass clap)\n(let me hear you say CLAP)\n\nClap, clap, clap, clap (C'MON!)\nClap, clap, clap, clap (RIGHT ABOUT NOW)\nClap, clap, clap, clap (Now everybody)\nClap, clap, clap, clap (switch it up, c'mon!)\n\nUp! Clap. Up! Clap\nUp! Clap. Up! Clap. (DANCE!)\nUp! Clap. Up! Clap\nUp! Clap. Up! Clap\n\nAHHHHH it feels so good to me right now\nI like to see you doin it\nEverybody we gonna keep this goin all night\nLet me hear you!\n\n(Girls! Get that ass in the air!) C'mon!\n(C'mon get that ass up! Ass up!) C'mon get that ass up!\n\n(Boys!) Go ahead! (Get that dick in the air!) You don't hear em do you?\n(C'mon get that dick up! Dick up!) Let me see you with the dick and\n\n(Girls!) Go ahead! (Get that ass in the air!) C'mon!\n(C'mon get that ass up! Ass up!) Let me see that big fat ass and\n\n(Boys!) Go ahead! (Get that dick in the air!) Go on!\n(C'mon get that dick up! Dick up!) Let me see your dick dance\n\n(Make that booty clap!) Girls got it!\n(Make that booty clap!) Everybody!\n(Make that booty clap!) We got the asses and the dicks all up\nAt the same time (Make that booty clap!)\n(Make that booty clap!) There's gon' be some penetration\nGoin' on up in here! (Make that booty clap!)\n(Make that booty clap!) Here we go!\nCLAP THAT BOOTY BABY!\nCLAP THAT BOOTY!\nAwright we gonna break it down for ya\nC'mon, c'mon, just clap that booty baby\nC'mon and drop that booty for me ladies\nIf you got a nice ass, I wanna see you in the back\nAt the end of the show here\nPeople, I like ass, we all like ass\nAnd it's and it's it's just a beautiful thing\nIt's a beautiful thing, we outta here\n\nOh hold up! Oh no! It's goin on!\nLet's get ready for part two in this thing, c'mon!!", "year": "1996-06-25"}]}