{"artist": "Beanie Sigel", "songs": [{"lyrics": "Chorus:\n(Scratching)...\"get down\"\nThis Philly cat back with them blackmatics\nPop up with the gun in ya crib fa the fun of it\n(Scratching)...\"get down\"\nTwo guns you know, desert eagle, streetsweepers\nIt..Its in the blood!..Mac Pain!....Click BOOM!\n\n[Beanie]\nI'll smack you in the grill or you'll feel the 45 harding\n45 yards of football stitches, look ya'll bitches...(Black)\nBullets in and out the same spot\nTurn you so skinny you can, in and out of rain drop\nSkinny like a smoker in and out of cain spots\nHook, drop, dry coke in and out the same pot\nMac with the block could hustle at any cause\nRan through bricks like Nitsie Russel and Lady Boss\n(man)..Tricky hustle, quick to bust you 380 toss\nYou can't escape hell, 357 with 8 shells\n38 long six shots\nGet ya shit stopped, get ya clique got\nGet ya strip hot, you could get swat\nYou could get cops, niggas get ya shit mopped\nHit ya block with two semis and say gimme\nLay everybody down on the ground and take plenty\nThis four pound make you lose pounds and get skinny\n\nChorus:\n(Scratching)...\"get down\"\nThis Philly cat back with them blackmatics\nPop up with the gun in ya crib fa the fun of it\n(Scratching)...\"get down\"\nTwo guns you know, desert eagle streetsweepers\nIt..Its in the blood!..Mac Pain!....Click BOOM!\n\n[Beanie]\nThis Philly cat back on a mission, out the kitchen\nBack at it, playing with blackmatics\nOne Mac eleven, one seven\nA line up four buck tears for one bredren\nLeave three basins of tears from one widow\n50 cars back to back with stick-up windows\nHollow points clap from Mac sittin' em in you\nNurses gotta cut ya back getting out you\nDisable niggas get staples and shit patch you\nShift over ya liver and able to reroute you\nLeave you niggz tubes and cables to spit out through\nYou know the rules of engagement I gotta out you\n(shit)...how you want it dog? We can gun it out\nSpit it out, have ya fucking stomach sitting out\nDig this when the shits on, get gone\nI'm rated PG, pull on-get gone\n\nChorus:\n(Scratching)...\"get down\"\nThis Philly cat back with them blackmatics\nPop up with the gun in ya crib fa the fun of it\n(Scratching)...\"get down\"\nTwo guns you know, desert eagle streetsweepers\nIt..Its in the blood!..Mac Pain!....Click BOOM!\n\n[Beanie]\nYou know Sigel play with them eagles, niggas don't get tagged\nThrow bullets out them dirty birds like McNabb\nBunch of niggas where ya corners at\nGet a whop, take a quarter back, bring a half back you do the math black\nAin't no warnin' black, when Im wearin' black...mask\nOver the braids two nines like Warren Sapp\nBring prosperity back to the hood like Buck Jay\nTurn ya block to slump day, who want gunplay?\nAll you niggas pennies add up to one thing....my dollars\nHollows holla, first class trip to satan with flyer mileage\nGuess who the pillot?..DOA Airlines, dead on arrival\nFlatline you, no survivers they can't find you\nLike Kennedy Jr. you kidding me Jr\nYou way out ya league\nSlow up pump ya brakes shorty, I'm ya way out ya speed\n\nChorus:\n(Scratching)...\"get down\"", "image": "https://images.genius.com/bf8c5034f8552cd568d53398bc41222f.500x500x1.jpg", "year": "2001-06-26", "title": "Get Down", "album": "The Reason"}]}