{"songs": [{"image": "https://images.genius.com/0f83f6339684287642e452f3aa527238.600x600x1.jpg", "year": "2014-03-28", "title": "Enuff", "album": "March Madness Vol. 3: Elite Eight", "lyrics": "[Intro: DJ Enuff & XV]\nXV, DJ Enuff (Swiff D)\nWe up in here!\nKansas, Wichita, New York\nLet's do it\n\nNever enough, no, it's never enough\nNever enough, no, it's never enough\nNever enough\n\n[Verse 1: XV]\nI've had enough of the game, I've had enough of the fame\nHad enough of the fake shit, enough of the lames\nNot enough of the love but enough of the pain\nCause it's never enough, no, it's never enough\n\nI've had enough of these snakes, I've had enough of these smiles\nHad enough of these tapes, I've had enough freestyles\nHad enough of these dates, had enough being wild\nBut it's never enough, no, it's never enough\n\nNever enough of the dro, never enough of a drank\nBut had enough of the hoes, don't give a fuck what they think\nGettin' Will Smith O's, enough to fill up a bank\nBut it's never enough, no, it's never enough\n\nI had enough of the tweets, had enough of the vines\nHad enough of the people just sayin' stuff on they mind\nI've had enough of the hustle, had enough of the grind\nBut it's never enough, no, it's never enough\n\nThere year was not '97, more like July '09\nWas heating up for a second, after I gave Cole lines\nHad enough of my mind and then Enuff helped me shine\nTo show it's never enough, yeah, it's never enough\n\nThen I couldn't get enough of hearing \"Can't Get Enough\"\nAnd my label had that face like when you can't get it up\nSo I gave them Zero Heroes, end up banging my stuff\nBut it's never enough, no, it's never enough\n\nHad enough push backs, I've had enough countdowns\nEnough of the waiting, can't 2015 be now?\nThey think I got enough fans that's ready and down\nBut it's never enough, no, it's never enough\n\nI've had enough of the work, never enough free time\nEnough to drive me berserk, enough to go out my mind\nBut you support me enough to put my life in my rhymes\nThat's why it's never enough, no, it's never enough\nLet's go\n\n[Outro: DJ Enuff & XV]\nYo, this DJ Enuff\nXV, the next big thing\nIn Hip Hop\n\nCause it's never enough, no, it's never enough"}], "artist": "XV"}