{"songs": [{"year": null, "image": "https://images.genius.com/6da49ff0e6d6b69f4a78bfd5f4fc60ed.626x626x1.jpg", "title": "Back In The Highlife", "album": null, "lyrics": "Intro\nYeah, yeah yeah yeah I guess everybody know. You know what im sayin'? I took my walk. You know what I'm sayin'? Exposed myself. You know what I'm sayin'? Cleaning up, cleansed up, cut my hair. You know what I'm sayin'? That motherfuckers like man whats wrong with this motherfucker man is this dude crazy or something? But you know its all good man out on the rest part motherfuckers think theres really somethign wrong with me man\n\nBizzy Bone\nThe moment of time, when we makin'.. like I'm feelin' it\nLovin' it, livin' it, rippin' it, flesh...\nRollin' a blunt, and knockin' it, and baby, I want it for real\nKeepin' it moving as fast as I can with no physical father\nThe pressures of steel (the pressure of steel)\nAnd everyday, and in everyway, tellin' me do what I do, and it's cool\nRemember my homies, remember my friends, I'm not going to lie to you, thought they was cool\nRoll to the club, a bottle of bub, talk about love\nRemember the chill, went to the lord, and the heavenly father is all that I have for real\nAll that I need, all that I want, nobody can mirror me, baby you strained\nI'd rather kick it with them anyway, I'd never be mad cause of Cane\nIt's not that I can't, but baby I ain't, remember the words, you'll never forget\nNow treat yourself cause royalty riches and sinnin' and crippin and shit\n\nChorus\nI'll be back in the high life again\n(You better believe it youre going to be praisin' the lord for sho)\nAll the doors I closed one time will open up again\n(You better believe it youre going to be praisin' the lord for sho)\nI'll be back in the high life again\n(You better believe it youre going to be praisin' the lord for sho)\nAll the eyes that watched me once will smile and take me in\n(You better believe it youre going to be praisin' the lord for sho)\n\nBizzy Bone\nI know what they do, I know where they go\nI'm breakin' it down it's looking like snow\nHeavenly father you gave me my life and I'm trying to live\nThe people like no, the people like who (who), the people like what (what)\nThe people like where (where), which way did he go?\nPeople they know but they won't admit it, it's all good, this is a pro\nOut of the lord everybody will lead it, thought I was lost but look what was found\nThe Heavenly Father picked me up when I was down\nThey want me to choose but thats not my role\nI'm saying my prayers to better my soul\nTo better my spirit to better my life and all that I had you already know\nGet it some money and give me some clothes and give me a place to rest my head\nIn the name of the father the son and the holy spirit, amen\nI'm feeling the east the peace we still I'm feelin the real I'm feeling the chill\nAnd baby relax and rest your neck and rest your back\nHeavenly father I thank you for everything life is good and you're the greatest\nYou're the best I'll tell the rest through all my prayers\nAnd Heavenly father I thank you for everything life is good and you're the greatest\nYou're the best I'll tell the rest through all my prayers, we back baby\n\nChorus\nI'll be back in the high life again\n(You better believe it youre going to be praisin' the lord for sho)\nAll the doors I closed one time will open up again\n(You better believe it youre going to be praisin' the lord for sho)\nI'll be back in the high life again\n(You better believe it youre going to be praisin' the lord for sho)\nAll the eyes that watched me once will smile and take me in\n(You better believe it youre going to be praisin' the lord for sho)\n\nBizzy Bone\nForever and ever and ever and ever my baby I need you to please stay\nWhat do\nWe say? It's ok, we can go together away\nI'll never forget I cherish the\nMoment, I cherish the day\nThe beautiful grace that's bought me good and it's\nYour grace baby (it's your grace baby)\nFinally free, I really don't care, I've done enough to feel the flare\nLeave everything for you and you do cause this ain't for me\nI'll never free almighty (almighty baby, almighty baby) I'll never free almighty baby\nNothing between but this is real remember the stars though shalt not kill\nBut if you ever ever need me I'll be standing in the battlefield\nPeace for me please we need it, I've been in the mean green patches and the scenery heaven we pray us into scenery\n(what a beautiful baby) what a beautiful baby, man down ten thirty\nHuh, B in distress even ham(?) gets love yes\nThe water is good like it should I never forget I praise your name\nHeavenly father daddy, heavenly father daddy"}], "artist": "Bizzy Bone"}