{"artist": "Asher Roth", "songs": [{"title": "Last Man Standing", "image": "https://images.genius.com/bdf3154c714e072bfa8fd02a9c3d1bee.220x220x1.jpg", "album": "Madden 12 Soundtrack", "lyrics": "[Intro: Akon]\nOh, oh oh, oh, oh, oh, oh, oh oh, oh oh, oh, hey hey hey!\nOh, oh oh, oh, oh, oh, oh, oh oh, oh oh, oh, hey hey hey!\nAkon and Asher Roth\n\n[Verse 1: Asher Roth]\nThey say they want that hot shhhh, say no more\nHad to walk around the block, couldn’t take no more!\nLike escaper from the rock, couldn’t wait no more\nSean Con cocked penis mightier than the sword\nSo I’m sleeping with the whores while I file for divorce\nPlain and simple and in short, when it rains, man, it pours\nStepping in manure, second sippin in the moor\nQuickest leopard gets the boar, secret weapons win the war\nGuessed, but I’m pretty sure that I’m destined to endure\nFlesh into the core, Pauly D to Pauly Shore\nWorld of cyborgs and tours of cyberspace\nWhat’s behind the door the allure something strange?\nOf course, this is why I came, the forces are untamed\nNo corporate or dumb fame, I'll record for chump change\nCourse is unphased, contorted or concave\nI'm sort of a poor sport, nothing short of Liu Kang\nGot me feeling like\n\n[Hook: Akon]\nI fall and I rise, with the fire still in my eyes\nMy scars and my strife, You know I will survive\nThe strength that I find when I dig down deep inside\nGot me still in this fight, and I’ll be the last man standing!\nOh, oh oh, oh, oh, oh, oh, oh oh, oh oh, oh, hey hey hey!\nOh, oh oh, oh, oh, oh, oh, oh oh, oh oh, oh, hey hey hey!\n\n[Verse 2: Asher Roth]\nI tried conversing with God, but only hearing myself\nI be throwing up a lot but I ain't here for my health\nWhen I'm feeling like blah, I had to loosen my belt\nAte the corn right off the cob, didn't need no help\nSo, now I've come to realize I'm on my own for real\nSo most of em I approach em with a Slomin's Shield\nKeep my enemies close cause they prone to steal\nWhen friends become foes know you're doing it well\nJust keep it going\nI'm a red pill taker, who's my real maker?\nGroup homes and tombstones to feel safer\nLoopholes for new souls, lets keep praying\nToo grown to complain, I create the lane I stay in\nForever underrated, so now I'm Nicholas Cage-ing it\nDoing all about anything as long as you put my face in it\nFace it, I didn't want to be famous, but that's the way it is\nWay I play the game, no wonder the brother made it like\n\n[Hook]", "year": "2011-07-19"}]}