{"artist": "Gangsta Boo", "songs": [{"title": "Wut U Niggas Want", "album": "Both Worlds *69", "year": null, "image": "https://images.genius.com/05275b2a5cae3f310f25e06511aa2191.400x400x1.jpg", "lyrics": "[Verse 1]\nYo! Hangin' low, chiefin' high\nTime to make you haters cry\nCirculatin' gossip 'bout the Lady you deserve to die\nMemphis Queen will set it off\nNever ever play me soft\nAlways 'bout my business, be a witness while I write you off\nPlease stop beepin' me, since I fuck you won't stop beepin' me\nIs it cause you sippin' on that syrup or takin' ecstasy?\nI don't wanna play wit you, Mrs. Villain Gangsta Boo\nGot no time for you cause I be busy with my fuckin' crew\nOut to get some paper and you know just how the ball bounce\nYellin' \"Fuck a hater!\" Blowin' hydro smoke up out my mouth\nRidin' with the limo tint, system bumpin' triple 6\nJust a lovely lady independent tryin' to make it rich\nJust to let you know I peep you out and how you look at me\nBallin' in yo' friends Mercedes, smiling like you foolin' me\nNever are you foolin' me, Ladies represent with me\nHow you got the clout when, nigga, you be out here chasin' me?\n\n[Hook x2]\nWhat these niggas want from a bitch?\n(what you want)?\nWhat these niggas want from a bitch?\n(really want)\n\n[Verse 2]\nWhat you niggas want from a bitch\nYou niggas makin' me sick\nBe actin' like you a baller just to get in my shit\nCause a lady ( I ) she don't want no scrubs\nA scrub is a nigga that can get the fuck from me\nAnd glistenin' in yo' white gold chains\nSaw me ridin' in the Benz nigga doin' my thang\nSo I don't need you. I got my car keys plus a check book\nTwo way constantly jumpin' sendin' me messages \"Boo, I love you\"\nAnyway playa I'mma say whats on my fuckin mind\nI don't give a fuck what you write I ain't fantizin'\nOK got a car, OK got that ice, OK nigga cool shit ya life is aight\nNow what ya wife be tellin me ya business my nigga\nI don't care about your figures, I'm a playa my nigga\nI'mma mack till I fall ya'll, keepin' it tight\nSo tell me why you wanna get with Mrs. Lady Aight?\n\n[Hook x 2]\nWhat these niggas want from a bitch?\n(what you want)?\nWhat these niggas want from a bitch?\n(really want)\n\n[Verse 3]\n\"G\"- Is Gotta talk, I gotta let you niggas know tha bizz\n\"A\"- Is Always on my P's and Q's you boys know what it is\n\"N\"- This heater Nine is always by my side when I be cruisin'\n\"G\"- Is Grabbin' at me when I'm buckin' plus I'm never losin'\n\"S\"- Is Sorry man I gots no time I'm down hea platinum nine\n\"T\"- This Triple six is sellin out it ain't no stoppin now\n\"A\"- Is ATL is where we represent this lady gangsta\n\"B\"- Is Boomin' system in the caddy plus the navigation\n\"O\"- Is On my dog, why you let her have the drought always\n\"O\" cause it's my time Gangsta Boo just hit the charts\nNumber ONE that's off the top\nCrazy lady blew the spot\nSpotted me in NYC I'm blazin' people off the block\nNiggas love me cause I'm thorough, bitches hate me cause they ain't\nNiggas tell me that they love me when the really want my bank\nBut you playas know you can't get nothin from the Lady\nYou need to come and tell me what you want from me baby\n\n[Hook x 2]\nWhat these niggas want from a bitch?\n(what you want)?\nWhat these niggas want from a bitch?\n(really want)"}]}