{"songs": [{"year": "2011-02-15", "title": "Better Way", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "[Intro: Layzie Bone]\nHey, hey, it's lil' Lay\nSaigon, Just Blaze\nJust out here in the field man\nTryin to make these ends meet, you know?\nEvery time you look around it's some shit goin down\nMan we tryin to make a better way\nSaigon, talk to 'em man\nTell 'em how we tryin to do this man!\n\n[Saigon]\nCheck, my heart is hurtin and my soul's searchin for a better way\nI was born in Mooseknuckle where the kid was led astray\nThen I moved to B.K., where I fell in love with guns\nFast forward six years later I'm a felon on the run with one\nRenegade Ron was my alias\nAnd even when I was wilding the 'gon was a Don like Cornelius\nThem hoes used to chase me around\nNone of my niggas surprised I got models givin face to me now\nThat I roll with a super producer plus keep the booth in a stupor\nThat's your dog? Call him, or we're meetin is {?}\nI try to put all of my troublemaking days behind me\nBut it seem like them fuckers always find some way to find me\nI never thought that Just Blaze would sign me (why?)\nCause he know that I fight a lot and he know my Nation is major grimy (yeah)\nThat's how I know that nigga for real\nTook a chance on givin a trill nigga a deal\n\n[Hook: Layzie Bone] + (Saigon)\nAlthough we thuggin and we be buggin we do be tryin to find a better way\n(Tryin to find a better way)\nAnd I'd be lyin if I said that we wasn't tryin to keep our pockets paid\n(Tryin to keep our pockets, paid)\nAlthough we grindin we on the grind and cause we tryin to reach our destiny\n(Tryin to reach our destiny kid)\nWhether it's hell (it's hell) whether it's jail (it's jail)\n[Both] Or it's the cover of the XXL!\n\n[Saigon]\nI never thought rhymin would help me climb the ladder of success\nNiggas thought by now that I woulda took the magnum to the chest\nOr have the staggerin arrest record for dabblin in this\nI knew I shouldn'ta been in since I'm fresh up out the pen\nBut N-O spell 'no' sucka, I kill 'em with the flow fucka\nYou could compare me to no other\nI'm so scared of my temper, what if somebody try me?\nWhat if I gotta prove that I still use the shotty?\nAtlantic Records would dropped me, police is gon' knock me\nThem bitches is gon' laugh at me, the haters is gon' party\nAnd I'll be back in the yard\nWith old timers callin me a GODDAMN FOOL for clappin ratchets at y'all\nI'm tellin you this, so you know I'm fully aware\nAnd very mindful, that I will throw away my career\nAnd let one of you little bitch niggas step in my square\nAnd I'll show you I keep the weapon right here, ayo Belly come here!\n\n[Hook]\n\n[Saigon]\nCheck it, look\nI'm hardly never low-key so it's hard to get to know me\nGot enemies in the street that's still targetin to smoke me\nIt must make 'em sick to see me as godly{?} in the movie\nWait 'til they start spendin money to market and promote me\nWhy would y'all wanna stop me?\nI changed my life around, put the rifle down, niggas still plottin to BIG and 'Pac me\nBut on the contrilly I'm packin the mac-milly\nAnd clappin at the first lil' faggot that act silly\nIt was my destiny to be here\nI killed the mixtapes for three years, all original beats so be clear\nAnd as fuckin fate would have it\nI got connected with the best producer in the world so we can go in and make a classic\nSo when will you learn? I get deep without the Biblical terms\nWe livin in hell with no physical burn\nThat's why a nigga tryin to find a better way\nAnd sayin hi to tomorrow, goodbye to yesterday\n\n[Hook]\n\n[Saigon]\nWhether it's hell, whether it's jail\nOr it's the cover of the XXL!\nWhether it's hell, whether it's jail\nOr it's the cover of the XXL! {*echoes*}", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}