{"songs": [{"lyrics": "[Ice Cube]\nWhat the fuck's up, Dre?\n\n[Dr. Dre]\nYou tell me, you talk to Ren\n\n[MC Ren]\nI'm right here nigga\nRelease the hound\n\n[Snoop Dogg]\nBow wow wow\n\n[Verse 1: Ice Cube]\nI'm a nigga wit an attitude thanks to y'all\nAnd I don't give a fuck I keep it gangsta y'all\nI'mma ride for my side in the C.P.T\nGod bless the memory of Eazy-E\nIf it wasn't for me where the fuck you'd be\nRapping like the Treacherous Three, fucking cowards\nI'd have seen Dre rocking parties for hours\nAnd I'd have seen Ren fucking bitches from Howard\nAnd I'd have seen Snoop give away Eddie Bauer's\nSo fuck Jerry Heller and the white superpowers\n\n[Verse 2: MC Ren]\nThis the shit niggas kill for\nThey hear the villain niggas spitting with them nigga flows\nFuck you hoes, fuck you bitch-ass niggas too\nGot something for you broke\nThese niggas wearing skirts like the pope\nWho them niggas that you love to get\nWho them niggas that you fuckin' with\nLove to yell that we the shit\nThe saga continues with the world's most dangerous group\nFour deep in the coup\n\n[Refrain]\nI'mma smoke where I wanna smoke, fuck that\nI'mma choke who I wanna choke, fuck that\nI'mma ride where I wanna ride, fuck that\nCause I'mma nigga for life, so I'mma nigga til I diz-ie\nI'mma smoke where I wanna smoke, fuck that\nI'mma choke who I wanna choke, fuck that\nI'mma ride where I wanna ride, fuck that\nCause I'mma nigga for life, so I'mma nigga til I diz-ie\n\n[Verse 3: Dr. Dre]\nA pencil, a pen, or a Glock\nI'm the original, subliminal, subterranean\nTitanium, criminal minded, swift\nD-R-E with that fuck a bitch shit\nA couple of notes and get you hog-tied in rope\nDope like tons of coke, cut-throat\nYou don't want the pistols to whistle\nCandy paint Impala\nI make hoes pop collars\n\n[Verse 4: Snoop Dogg]\nGod damn hoes, here we go again\nFucking with Ren, playing to win\nHe got the Coke and Hen - I got the juice and gin\nSame shit you was fucking with way back then\nWe keep it cracking from the acting to the jacking\nG'ed up C'ed up motherfucker blaze the weed up\nWe all on deck fool so put your heat up\nI stay on deck so me don't get wet\n\n[Ice Cube]\nLook my nigga, we can scatter like buckshots\nLet's get together, make a record, why the fuck not\n\n[MC Ren]\nWhy the fuck not\n\n[Dr. Dre]\nWhy the fuck not\n\n[Snoop Dogg]\nWhy the fuck not\n\n[Ice Cube]\nCause I'm tight as the night\nI had to wipe activator off the mic, in 1985\n\n[Snoop Dogg]\nReal niggas, biatch, you know, ha hah\n\n[Ice Cube]\nWe cause tragedy, erratically\nSystematically in your house without a key\nHow fucked up that'd be\nGat'll be near your anatomy, my form of flattery\n\n[Dr. Dre]\nAssault and battery, cause we coming with that street mentality\nStraight west coast rider academy\nConcrete nigga, that's my reality\n\n[Snoop Dogg]\nWe tend to bust on niggas that get mad at me\n\n[Dr. Dre]\nWas it a bitch in the mix\n\n[Snoop Dogg]\nWell it had to be\n\n[Dr. Dre]\nLying tricks told them dicks I had a key\nHoes make the world harder than it have to be\n\n[Refrain]\nI'mma smoke where I wanna smoke, fuck that\nI'mma choke who I wanna choke, fuck that\nI'mma ride where I wanna ride, fuck that\nCause I'mma nigga for life, so I'mma nigga til I diz-ie\nI'mma smoke where I wanna smoke, fuck that\nI'mma choke who I wanna choke, fuck that\nI'mma ride where I wanna ride, fuck that\nCause I'mma nigga for life, so I'mma muthafuckin nigga til I diz-ie", "album": "The Best Of N.W.A: The Strength Of Street Knowledge", "year": "1999-08-23", "title": "Chin Check", "image": "https://images.genius.com/78636c183063f097a0dafe49613f378a.1000x1000x1.jpg"}], "artist": "N.W.A"}