{"songs": [{"title": "We Lied", "lyrics": "[Intro]\nAy, ay who dis is, my girlfriend\nAy, ay who we talkin' bout, my girlfriend\nAy, ay who dis is, my girlfriend\nWho dat is, my girlfriend\nAy, ay who it is, my girlfriend\nAy ay, check this out\n\n[Hook]\nI said I weren't gon never hurt you\nYou said you ain't gon never hurt me\nWe lied\n\n[Verse 1]\nLove melt, how could I do this to myself\nI lied to her, and plus I lied to myself\nNothing's left, the relationship done lost it's breath\nIt stopped breathing, it died last season\nI think about you leaving, cuz you a sexy lil' creature\nYou thought I was lying when I said I ain't fuck Alicia\nAnd I don't wanna hear what Mika said and fuck Keisha\nI betcha they'll fuck me all you gotta do is leave us\nMake you out a believer we some grown ass people\nDem bitches get on my nerves that's why I be smokin' reefer\nFirst we start arguing, I open up my ether\nWhen I open up my ether the shit get deeper\nAt first you start throwin' shit then you start bowin' shit\nRunning round hollerin' tryna guess bout who I'm hoein' wit\nYou know who I'm goin' wit, I be there when you doin it\nI don't hit the door no latter than one in the morning\n\n[Hook]\nMan it's been a long spin loving this woman\nAt first we was in love in the beginning, it was strong then\nNow you talkin' bout you don't want me, well gone then\nIf we don't get along why we talkin' on the phone then\nFirst I walked out now you want me to come home then\nYou said we would stay together, why the fuck am I alone then?\nI said I wasn't gon never hurt you\nYou said you ain't gon never hurt me\nWe lied\n\n[Verse 2]\nMan this shit killing me, I'm reacting like Willie B\nBeatin' on my chest y'all niggas ain't feeling me\nCards you dealing me, I'm like what the fuck is you givin' me\nWe both got injuries now we play religiously\nSame hoes hatin' on us, numbers they be slipping me\nYou rippin' me, you temptin' me, you thought that you was clippin' me?\nI knew you got them stacks when you took 'em I knew instantly\nLeft the shit for you to go shopping to get some Bemanes\nYou acting like a enemy why the fuck is you hittin' me?\nHoes tellin' lies to you why aren't you defending me?\nNow I'm finna cheat, now I'm finna creep, now I'm finna have different women in my V\nWhy? She lied on me, why? I'm fly homie\nFuck working it out, I'm finna go and ride homie\nNow I'm sleeping here, creeping here, bout to spend a week here\nGuess who I'm fuckin' round with, that bitch Keisha, yeah\n\n[Hook]\nMan it's been a long spin loving this woman\nAt first we was in love in the beginning, it was strong then\nNow you talkin' bout you don't want me, well gone then\nIf we don't get along why we talkin' on the phone then\nFirst I walked out now you want me to come home then\nYou said we would stay together, why the fuck am I alone then?\nI said I wasn't gon never hurt you\nYou said you ain't gon never hurt me\nWe lied\n\n[Verse 3]\nFuckin' round wit Keisha, ain't no passion though our mansion gold\nRock Ralph classical Benz color pistachio\nThey love me I'm on MTV, game international\nMe and Nick on 26, grape grand national\nI love her I ain't sayin' shit, I don't know who to share it with\nI'm talkin' bout my girl, this who I be breakin' bread with\nDread shit, sellin' dro, she never let the feds know\nThis house I'm in used to be full of love, but where it go\nMan I wanna let it go, I love you cause I said so\nI cheated and regret it though, I let my cousin Tres know\nTold me to get a thousand roses and plus seven more\nWe would never hurt one other, that's what we said though\nWe lied gone and say it, folk we miss each other extra though\nBut guess what I can't get out my head, guess what we said, folk\n\n[Hook]\nI said I wasn't gon never hurt you\nYou said you ain't gon never hurt me\nAy, we lied\nMan it's been a long spin loving this woman\nAt first we was in love in the beginning, it was strong then\nNow you talkin' bout you don't want me, well gone then\nIf we don't get along why we talkin' on the phone then\nFirst I walked out now you want me to come home then\nYou said we would stay together, why the fuck am I alone then?\nI said I wasn't gon never hurt you\nYou said you ain't gon never hurt me\nWe lied", "album": "Best Thang Smokin’", "year": "2006-08-29", "image": "https://images.genius.com/d08a6e151064244a37d938d092fc5670.640x640x1.jpg"}], "artist": "Young Dro"}