{"songs": [{"year": null, "image": "https://images.genius.com/a822e5595fc1eee33d5cbbfa1ae70b68.500x500x1.jpg", "title": "Step Up", "album": "Delightful Bars", "lyrics": "[Hook: DJ scratches]\n\"Step up\"\n\n[Rapper Big Pooh]\nUh, uh, I think it's that time\nFor some real talk, uh\n\nNobody told you to lay in that bed\nNobody said for you to open them legs\nYou know what happen when sperm meet egg\nA teenage mother is what you're pegged\nThat's another mouth need to be fed\nThe father gone, you alone and scared\nThere's another way out, don't say it\nMany times in your thoughts you played it\nSo now your child here, don't hate it\nCause at the end of the day you made it\nRejoice in the blessing, be elated\nIt's too late once your period's belated\nI ain't here tryna talk down\nJust offer some advice on how to walk now\nFirst it ain't about you, you living for your kids\nThe goal for them to have everything you never did\nShow a lot of love, lot of kisses, lot of hugs\nPositive role models, later for them thugs\nYou all about pussy and moving a few drugs\nYou don't think I'm talking to you? I never was\n\n[Hook]\n\n[Rapper Big Pooh]\nWhat up? It's good to see you're doing right\nAnd that you finally made a turn in your life\nYou got dreams, I suggest you try and live 'em\nCause second chances, only God give 'em\nFamily members looking down on you smiling\nI got your back, don't think you on an island\nHere's the chance to be the man that we all knew\nCould one day shine through once your mind grew\nTime flew, two years, one kid\nTwo nephews and they all getting big\nYou see? Life's better than the bid\nWe only get one and sometimes we skid\nStraighten that will, got people in the backseat\nLittle dependence, depending on you, back sleep\nYou are the leader of this herd, they are your sheep\nSometimes we can't see it but life's sweet\nLife's good, life's great\nGot a bigger appetite? Get a bigger plate\nWhen you the man of the house get a big estate\nYou been dreaming of the day? Well it's your day\n\n[Hook]\n\n[Rapper Big Pooh]\nThe time comes when we all gotta grow\nWhen your time here, trust me, you'll know\nI advise you to just take it slow\nEnjoy being a kid, go with the flow\nCause pretty soon you gon' pay your own bills\nAnd pretty soon you gon' know how it feels\nTo feel like the whole world's on your back\nDevil's over your shoulder waiting for a reac-\nTion, and that ain't just for pretend my dear\nI gotta tell you what you need to hear\nAnd this is part of that good speech\nEvery man has with his siblings or his peeps\nOkay, I made a few mistakes\nAnd still tryna learn as a man what it takes\nI really wanna help you out\nHelp you understand what growing up's about\nEase some of the pressure if you learn from me\nAll you have to do is wake up and see\nThat everyone ain't here to make it tough\nWe just want you doing better than us so step it up\n\n[Hook]"}], "artist": "Rapper Big Pooh"}