{"songs": [{"title": "Wop", "album": null, "year": "2018-10-09", "image": "https://images.genius.com/bffd81c21137030c2112d93ce97f1d28.1000x1000x1.jpg", "lyrics": "[Intro]\nYou know I just copped a new YSL piece\nYou know what I'm sayin'?\nNo cap\nKnow I'm with BSlime\nAnd I got, um, StickBaby with me in this motherfucker\nKeedtoven as always, you know what I'm sayin'?\nAyy, where you get that beat from? Mooktoven\nKeed, talk to 'em\n\n[Chorus: Lil Keed]\nI got shooters so I hope a nigga ain't on nothin' (Wop)\nMe and BSlime fuckin' these hoes, nah, we ain't cuffin' nothin' (Wop, wop)\nI got cheese on me wrapped in saran (Wop)\nWhat's that floatin' 'round that Crush? Man, that's all Xans (Let's go)\nForeign ho just water and brush, she didn't need no weave (Wop, wop)\nWater on my neck and wrist, yeah, Dasani (Wop)\nYou can picture this right now, ain't talking Sony (Wop, wop)\nBlack pitchfork, that's that Masi (Skrr, skrr)\nYeah, I did it for brother\n\n[Verse]\nAnd I just left Bali and I'm smokin'\nNah, they can't be me, these niggas can't see me, nigga, stop\nYeah, I pulled up on Bleveland Ave in a drop\nYeah, Glock with a dick, yeah, it's gon' pop\nYeah, I got bad bitches, yeah, give me top\nOff-White denim on cost me a lot\nOff-White shoes, rock them bitches with Gucci socks\nThey don't wanna see them slimes out, they called the cops (No cap)\nYeah, you say you slime but did your partners slime 'em out?\nI got up, they hands out but y'all niggas counted me out\nAnd a nigga make a sound, I make StickBaby clear the block (Skrr)\nOn the way to these Ms, I ain't even do no stops\nBust down Rollie, no tick, no tock (Uh-uh)\nNigga flexing for the day, gotta give it back at 12 o'clock (Uh-huh)\n(Keed, talk to 'em)\n\n[Chorus: Lil Keed]\nI got shooters so I hope a nigga ain't on nothin' (Wop)\nMe and BSlime fuckin' these hoes, nah, we ain't cuffin' nothin' (Wop, wop)\nI got cheese on me wrapped in saran (Wop)\nWhat's that floatin' 'round that Crush? Man, that's all Xans (Let's go)\nForeign ho just water and brush, she didn't need no weave (Wop, wop)\nWater on my neck and wrist, yeah, Dasani (Wop)\nYou can picture this right now, ain't talking Sony (Wop, wop)\nBlack pitchfork, that's that Masi (Skrr, skrr)\nYeah, I did it for brother"}], "artist": "Lil Keed"}