{"songs": [{"lyrics": "[Intro]\nWhat we gonna do right here is go back\n\n[Verse 1: MC Ren]\nNow, this is some shit that's from the days of wayback\nWhen niggas in Compton first started to jack\nWhen the bitches wouldn't give you no pussy\nIf you wasn't sellin' drugs\nSo many bitches in my neighborhood got mugged\nThey always loved that shit, they want a nigga that's sellin' keys\nBut nowadays, they workin' at Mickey D's\nBut in the days of wayback, I couldn't be laid back\nBecause I needed ends and I made that\nI get the nine from my nigga that he lend me and\nStart robbin' muthafuckas just like Cowboys and Indians\nAnythin' it took to get paid\nA nigga like Ren already had the plan made\nAnd I was in it to win it and not to lose\nAnd shit'd start blowin' up once I lit the fuse\nAnd police couldn't touch me because I was payin' 'em\nBut not with no money, yo, I was sprayin' 'em\nAnd never get caught because nobody is snitch\nBut one hoe did, so Ren had to shoot the bitch!\nNow she's in a coffin and my life is better off and\n'Cause everybody knows who's the boss and\nThat black nigga that they call Ren\nYou fuck with me, you gotta fuck with a Mac-10!\nSo listen to me as I reminisce the days of wayback\nSo, check it out, y'all\n\n[Verse 2: Dr. Dre]\nIt was once a time in the days of wayback\nWhen niggas was gettin' jacked\nIn fact, it was when I used to pass through the\nAnd kickin' ass through a muthafuckin' Compton Massacre\nNow, let me tell you a little somethin' about Compton\nWhen I was a kid and puttin' my bid in\nYo, Compton was like still water - just strictly calm\nNow it's like muthafuckin' Vietnam\nEverybody killin', tryin' to make a killin'\nNiggas stealin', muthafuckas willin' to dealin'\nWith so many ways to come up\nThe average nigga didn't give a fuck\nAbout another muthafucka in this game and\nClaimin' what he claimin', livin' like he livin', killin' after killin'\nMurder was a dirty job, to rob a dead man was the best plan\n'Cause a dead man never ran\nBut now your best friend is your worst friend\nGreed, kids to feed, make a me more some of what you holdin'\nSo, now your shit is stolen and you and your niggas start rollin'\nYo, to get your shit back ain't the word up\nMuff? It's more murder, more murder, more murder\nThey wanna make you think that it's a crack thang or a black thang\nOr some niggas in a muthafuckin' gang\nBut guns and money, they go together like the Ku Klux Klan\nA nigga brung up and strung up\nWhy do I call myself a nigga you ask me?\nRememberin' the days that's past me\nYo, never givin' niggas a chance to rest\nThe ghetto is like a fuckin' survival test\nAnd number one way for you to pass\nYo, get treated like a king and they'll crown your ass\nThey never in the wrong though so I made a song so\nMuthafuckas would know\nIf your livin' situations make you wanna get a gat (a gat)\nThat's 'cause you livin' in the Dayz of Wayback...\n\n[Outro]\nSurprise, niggas!\nYou don't think I could do it again, did ya?\nAnother album!\nThe jokes on you, Jack!\n(Yeah! Yeah! Ha ha ha ha! We did it again) We did it again!", "album": "Efil4zaggin", "year": "1991-05-28", "title": "The Dayz Of Wayback", "image": "https://images.genius.com/378262f83025b434fc5375a332bd1a1f.800x800x1.png"}], "artist": "N.W.A"}