{"songs": [{"year": "2013-03-04", "image": "https://images.genius.com/283cd237d7c947223a80f65f3252599e.500x500x1.jpg", "title": "Moon & Stars", "album": "Nehruvia", "lyrics": "[Verse 1: Raz Fresco]\nAyo spiral be the movement of the spirits\nPyronetic spittin special edition kicks illin in the village\nWith Dynasty Visions, Dreams of major league pitching\nMe and Bishop sufferin from ill young nigga syndrome\nKillin shit and we co-defendants\nSittin back chilling rooms be marijuana scented\nEgyptian gold my nigga got Cleopatra women\nWhen you start the race, I be at the finish line illin\nWho am I? Mr. Never Money Over My Niggas\nGluteus grippin She got nubian beginnings\nShe truthfully gifted, I caress her that's player pimpin\nIma fucking villain so fuck the system fuck if they feel this\nRaptors Jacket Cash in the Denim\nTime is money and I got mad money invested\nIn this rap shit, dwarf a giant when I rap shit\nSo much beyond the surface if you can pass this\n\n[Hook: Raz Fresco: x2]\nEverything written in the Moon and the stars\nAnd everything under the Sun has been done\nBut this shit right here?\nThere'll never be another\nI said this shit right here?\nThere'll never be another\n\n[Verse 2: Bishop Nehru]\nA nigga tryna get it a scene that ain't hard to find\nI'm hoping that lines or dimes will leave me the lines of dimes\nWhether bitches or riches, I'm tryna avoid the stitches\nWanna be taking pictures with fans saying my rhymes vicious\nMy mind gifted, lines wicked try and switch this\nNigga up in the rough, and disrupting the sudden force of corrupt niggas must\nThink they getting something from me\nSince I got to the money\nEven Elders been acting funny\nAnd honeys no longer dummies\nRemember when I was bummy, no clothes\nWith more foes coming by the boatload\nA chokehold, is what I got the game in\nYou straining, I'm entertaining\nFans killing all the remaining\nPatience, impatiently, wait and see\nI murder rappers and on a daily basis we\nBreaking weed, baking these tracks your ass lack\nYou wanna react, cut the slack and bring it back\nIt's a wrap\n\n[Hook]"}], "artist": "Bishop Nehru"}