{"songs": [{"image": "https://images.genius.com/3a2b5d523ed4c1887dcd3d37b71c01d9.1000x1000x1.jpg", "title": "Heaven", "album": "God’s Son", "year": "2002-12-13", "lyrics": "[Chorus: Jully Black & Saukrates]\nIf Heaven was a mile away\nWould I pack up my bags and leave this world behind?\nIf Heaven was a mile away\nOr save it all for you?\nIf Heaven was a mile away\nWould I fill the tank up, put gas\nAnd be out the front door in a (flash?)\nBefore reconsidering this hell with you\nIt ain't you, it's the things you do (do)\nIt's tearing my heart in two\nI would've fell with you, to Hell with you\n\n[Verse 1: Nas]\nIf Heaven was a mile away, and you could ride by the gates\nWould you try to run inside when it opens\nWould you try to die today?\nWould you pray louder, finally believe in His power?\nEven if you couldn't see Him, but you could feel Him\nWould you still doubt Him?\nHow would you start actin'?\nWould you try to put the keys down, thinkin' every drug sale that you make in the streets he can see now?\nWould a fiend even want to get high? Would he stop smokin'\nIf he knew on his own two feet he could just stroll in?\nTo get away and escape from the craziness\nAnd I bet you there's a Heaven for a atheist\nIt's hard takin' this, racist planet\nWhere they take a younger brother in a hand-cuff\nEven if he innocent, \"Nigga, get on the car!\nPut your motherfuckin' hands up!\"\nThinkin' I'ma lose it, my mom's in chemo\nThree times a week yo, keep tryin', but people, it's hard\nAnd God, your young soldier's not so bold but needs you\nThis world's my home, but world, I will leave you\n\n[Chorus: Jully Black & Saukrates]\nIf Heaven was a mile away\nWould I pack up my bags and leave this world behind?\nIf Heaven was a mile away\nOr save it all for you?\nIf Heaven was a mile away\nWould I fill the tank up, put gas\nAnd be out the front door in a (flash?)\nBefore reconsidering this hell with you\nIt ain't you, it's the things you do (do)\nIt's tearing my heart in two\nI would've fell with you, to Hell with you\n\n[Verse 2: Nas]\nNigga, what you think, I'ma stop building?\nI'ma stop feelin' like I'm Amistad's great-great-grandchildren?\nHow I'm not gonna want to make millions\nSince the quarter water days, in the hallways\nMakin' fake gold caps\nWith the Reese's Pieces wrapper in my mouth all day\nBut then my style has quite a while\nThat same type as Ill and Al Skratch\nGame time took 'em cats, never looked back\nCristal, blowin' dub sacks\nThat's when it all just hit me: you see, the broads and Bentleys\nIs nothin' unless my niggas spend it all with me\nI'd give it all away quickly\nJust to hear them all about some new kicks\nFree of any autographs, and not to be recognized, forgive me\nIt's becomin' unbearable, makin' hits is easy\nPut a famous bitch on a hook, there you go with a platinum CD\nI know you heard the noise, preachers touchin' on alter boys\nSodomizin', not realizin' God is watchin', before the Lord\nHow could they do the Devil's work?\nA man give another man head in Church\nHell, it hurts just to fathom the thought, wishin' that I fled the Earth\n\n[Chorus: Jully Black & Saukrates]\nIf Heaven was a mile away\nWould I pack up my bags and leave this world behind?\nIf Heaven was a mile away\nOr save it all for you?\nIf Heaven was a mile away\nWould I fill the tank up, put gas\nAnd be out the front door in a (flash?)\nBefore reconsidering this hell with you\nIt ain't you, it's the things you do (do)\nIt's tearing my heart in two\nI would've fell with you, to Hell with you\n\n[Outro: Nas]\nYou trapped in your own hell\nEvery day I wake up I'm blessed\nEvery day you wake up and breathe another breath, you blessed\nTo all them niggas runnin' around\nTalkin' about, \"I'm fucked up,\" \"I got to get on,\" \"I got to…\"\n\"I'm in the grind,\" \"I'm fucked up\"\nYeah, we all in the grind\nBut look at the beautiful shit around you, it's a beautiful life\nAll my niggas locked up, keep ya heads up\nHeaven's just a mile away\nI'm talkin' Heaven on Earth, ain't got nothin' to do with money\nGot nothin' to do with nothin' material\nI'm talkin' about Heaven in your own heart\nIn your own world, baby, in your own existence\nTo my moms, look at me, baby\nI love you, girl, your boy's shinin', God's son..."}], "artist": "Nas"}