{"artist": "G Herbo", "songs": [{"title": "Knucklehead", "album": null, "year": "2014-12-04", "image": "https://images.genius.com/910ed08cc34641e27befd74b7e35304f.480x480x1.jpg", "lyrics": "[Produced by RandomBlackDude]\n\n[Hook: Lil Herb]\n'Member when I used to skip school, hit the block instead?\nDiaries of a knucklehead\nI used to slang under cameras like \"Fuck the feds\"\nDiaries of a knucklehead\nAnd if you out here in these streets, you can understand\nDiaries of a knucklehead\nI put my life up on the line cause I love my mans\nDiaries of a knucklehead\n\n[Verse 1: Lil Herb]\nI used to stand up on that block like, \"Fuck the feds\"\nHustle hard, we was stackin' every buck we had\nIn that field, 24 but we was duckin' lead\nBullets flyin' close range and they was lucky legs\nYoung niggas, dumb niggas, we ain't listen, had to learn\nKilled my homies, now we grievin', load the heaters, let 'em burn\nGotta keep it, I don't know when it's my turn\nSo I'm ridin' through my hood, and I'm grippin' on it firm\nNiggas say they gon' kill me, be a man of your word\n.40 burst, hit the dirt, call a hearse, get a shirt\nAnd the hood ain't see me lately, I'm like, \"Y'all gon' get this work\"\nNiggas diss about me crazy, all that shit gon' get 'em murked\nDon't do that\nFound out where you hang out and have my shooters come through there\n'Member I ain't have no gear, now I can't think what to wear\nUsed to tote them Dillingers, man how'd I get to here?\nNow I'm signin' signatures and fuckin' bitches everywhere\n\n[Hook: Lil Herb]\n'Member when I used to skip school, hit the block instead?\nDiaries of a knucklehead\nI used to slang under cameras like \"Fuck the feds\"\nDiaries of a knucklehead\nAnd if you out here in these streets, you can understand\nDiaries of a knucklehead\nI put my life up on the line cause I love my mans\nDiaries of a knucklehead\n\n[Verse 2: Earl Sweatshirt]\nAnd I'm a product of screamin'\nAnd got a lot just off the top if it's the topic of demons\nWe talkin' weed cause I need it, niggas faded and deep\nIf you need a fade then you get it, blow an 8th, then I speak\nThese niggas playin' for keeps,  the rain ready to make you go inside\nMuzzle up and shovel up, just keep your gold in mind\nShoulder cold, he hold the 9, doggie I know your kind\nI missed the boat, I understand, been in it 'fore the fuckin' cash\nSince minute phones was in, and every bitch would let you cup her ass\nBut none of them was suckin' dick... see now they're suckin' dick\nMy niggas got the upper hand, cop me a couple grams\nTaught me to stuff the Swish, papi just up and dipped\nTight grip on the shit that I'm drownin' in\nCan't step in my momma crib without counselin'\nDip, and my face on the kicks to the south of me\nLet me say you're lookin' out, but I know you got it out for me\n\n[Hook: Lil Herb]\n'Member when I used to skip school, hit the block instead?\nDiaries of a knucklehead\nI used to slang under cameras like \"Fuck the feds\"\nDiaries of a knucklehead\nAnd if you out here in these streets, you can understand\nDiaries of a knucklehead\nI put my life up on the line cause I love my mans\nDiaries of a knucklehead\n\n[Outro]\nDiaries of a knucklehead\nDiaries of a knucklehead, knucklehead\nDiaries of a knucklehead\nDiaries of a knucklehead, knucklehead\nDiaries of a knucklehead, knucklehead\nDiaries of a knucklehead, knucklehead\nDiaries of a knucklehead\nDiaries of a knucklehead"}]}