{"songs": [{"title": "Dreams", "lyrics": "[Verse 1]\nAy yo the bottom line is, I'm a dyke with a do\nDildo to be exact, my pipe game is real\nI had dreams of fucking an industry bitch\nNow listen, pay attention, why read my lips\nLauren London, I could just picture us fucking\nYou had a baby by Wayne so I ain't eating your muffin\nMegan Good, damn I know that head game good\nWith those lips, I swear I'd turn you out if I could\nI know you're married and no disrespect to your man\nI been a fan, so fucking you was part of my plan\nAnd Cyn, I met you, don't act like you don't know me\nAnd yeah, I'll commit sins for Chipotle\nTake you to the crib, you drink Henny and Rosé\nI do circles with my tongue, call it ring around the rosie\nMy sex game on fleek\nSo don't think I can't take Nicki Minaj from Meek\nGet her in them sheets, she riding it like a Honda\nTell her ass up, put in my anaconda\nYo Rihanna,  I heard you get around\nFuck them niggas, you ain't heard dykes in style?\nPut the strap on, put it all in your tummy\nWhen we finish, bitch better have money\nI'm a player, I have more hoes than Santa\nFrom New York to Atlanta, women calling me handsome\nWhen I saw Jazzy Bell I didn't think nothing of her\nTil I turned around, fuck the cake, she got the oven, lord\nThe things I'd do, but we gon' keep that between me and you\n\n[Hook]\nThis ain't serious\nI know you straight girls are curious\nSo I take 'em home, make 'em moan and shit\nYoung M.A, how it feel to fuck an industry chick?\n\n[Hook]\nThis ain't serious\nI know you straight girls are curious\nSo I take 'em home, make 'em moan and shit\nYoung M.A, how it feel to fuck an industry chick?\n\n[Verse 2]\nI made love to Ciara right in front of the camera\nAmber Rose, she can get it, right in front of the mirror\nI'm a freak though, got women lined up like a free throw\nSo open up and let me put it in like a cheat code\nAnd you miss delicious, looking very delicious\nIf we fucked, shit I'd probably be in love when we finished\nBlacc Chyna, your body looking right and all\nTake off them drawers and let me feel them china walls\nBlack women, white women, shit I like 'em all\nSpanish, Asian, Russian, shit I'll try 'em all\nCassie, I'll fuck her right in my back seat\nWith the radio on, listening to Blackstreet\nBy a back street, with a city view on that street\nAnd fuck her 'til she sweat, make that pretty hair nappy\nKylie Jenner, do you fuck with the same gender?\nWill you let me have sex with you and one of your sisters?\nForeplay, I can beat it up in four ways\nWear your ass out, have you sleeping for four days\nAnd I ain't tryna make nobody offended\nBut honestly if I really want her goods I can get it\nDo it on a desk, really give her the business\nMy dildo is big, I really give her some inches\nAfter this, I know I'ma hear a lot of opinions\nEverybody judging, criticizing over their feelings\nBut I don't give a fuck\nTell your girl come to me if she wanna bust a nut\nLet me take her home, make her moan and shit\nYoung M.A, now that's how you fuck an industry chick, huh?", "album": "Sleep Walkin", "year": "2015-11-04", "image": "https://images.genius.com/3ae7d87feb65194db9c5a5859a86922c.500x500x1.jpg"}], "artist": "Young M.A"}