{"artist": "ILL BILL", "songs": [{"title": "Society Is Brainwashed", "lyrics": "[Verse 1: ILL Bill]\nEvery society honors its live conformists and dead troublemakers\nI'm the Son of Satan, sculpted the culture of the ancients\nBurn me at the stake with my left hand stuck in The Matrix\nI'm the apex, I steal science off of spaceships\nBlackwater contractors captured off of camcorders\nAfter mass slaughter, violent massacre, Masters of Order\nBurning effigies of presidents and American flags\nVeterans clash for the chance to sell terror for cash\nBabylon destroyed the Beis Hamikdash\nDeath cults, murder squads\nExploding churches and burning mosques\nThrow your dice now your destiny's cashed\nAnd these seeds of war were planted over centuries past\nAnd the mysteries remain unsolved, colossal pyramids on Mars\nVisitors beyond the scriptures of Allah\nGod is on the side of the ones with money and large armies\nPray for death amongst these brainwashed zombies\n'Society Is Brainwashed'\n\n[Hook]\nI bet you can't see what I can see\nThat's right\nHere's a few things we have to address\nI bet you can't see what I can see\nWhen I'm in the streets I always remain cautious\nHe's good, goddamn\n\n[Verse 2: ILL Bill]\nNovember 5th, 2001, less than two months after 9/11 occurred\nThe infamous William Cooper was murdered\nEx-Naval Intelligence Officer\nRenowned author of 'Behold A Pale Horse'\nHe paid the cost\nI can't say I agree with everything that he wrote\nBut I admire him for speaking his mind though\nNever holding his tongue for nobody, how society is brainwashed\nGuns in each others faces for the same lies\nSame everything and same nothing\nSame bullshit materialism, the Third World man's luxury\nThis false flag fuckery, an AIDS infested junky\nYour Lady of Liberty can't fuck me\nCan't touch me, The Black Pope, superior general\nTim Osman riding like a Piru from Inglewood\nBring the hood up to a hovering mothership\nThey already made the switch to the One World Government\n\n[Hook]\n\n[Verse 3: ILL Bill]\nAmongst the Ivory Tower witch doctors, witnessed explosion\nOn the Groom Lake landing strip, silicon sorcerers abandoned ship\nFamine gripped the planet with the gigantic Satanic fist\nBelieved to be linked to Al-Qaeda through a sandwich business\nI don't advise you to believe, these could be camera tricks\nAll I'm saying is to ask questions, amateurs\nWhat Hollywood tries to pass off as fantasy\nMight already have happened in actuality\nAnd vice versa, if Jesus Christ was a person, who was Mithra? Who was Krishna?\nWho was the first to be baptized, crucified, resurrected?\nBetrayed and made into a martyr for someone else's redemption?\nOld men start wars for young dudes to die in\nMadison Avenue telling you what you should be buying\nReligion and science always profess peace\nBut in the end who created the deadly war machine?\nSociety is...\n\n[Hook]", "image": "https://images.genius.com/457870257e417a35d5715090c07a987d.1000x1000x1.jpg", "album": "The Hour of Reprisal", "year": "2008-09-16"}]}