{"songs": [{"year": "2018-12-07", "image": "https://images.genius.com/3e53c9bb3f71fcaa17e6c63911a89f44.874x874x1.png", "title": "Arm aus dem Fenster", "album": "Monument", "lyrics": "[Intro]\nJa, doch, mit der hab' ich mich wirklich getroffen\nJa, mit der hab’ ich mich sogar absichtlich getroffen, und du\n\n[Part 1]\nDu bist sichtlich getroffen wie der mittlere Osten\nDenn wie soll ich sagen, Mois? (was denn?) Ich fick' deine Tochter\nAuch Stewardessen werden stets gefickt auf der Toilette\nLaber kein'n Scheiß, Mois, was? Die bringen auch Getränke? (tzeh)\nFiligranes Leben wie Hedi Slimane, Cartier (ja)\nWas die Welt kostet, fragt man nicht auf billiger.de\nHundert Zeugen (ah), keiner hat zur Aussage Mut (no way)\nEs ist wie beim Herz, Bitch: Klappe auf, es fließt Blut\nIm Gerichtssaal mit ’nem Koffer, aus dem bare Scheine quell'n\nKurzer Plausch im Hinterzimmer – Verfahren eingestellt\nUnd zu den Akten gelegt, yeah, zu den Akten gelegt\nWie der Boss in sein'm Harem, wenn er nachts schlafen geht\nSeit sie für mich läuft, ist deine Hoe 'ne leblose Hülle\nEinst erfüllt von Freude, heut von Penisergüssen (Kid)\nVor ihrer Tür 'ne Hundert-Mann-Warteschlange\nIst die Nutte am strahlen, dann nur unter 'ner Schwarzlichtlampe\n\n[Hook]\nIch roll' in mei'm Benzer (Benzer)\nAMG (ey), 22 Zoll (ja), tiefgelegt\nArm aus dem Fenster (Fenster), die Sunglasses nice\nBaller’ voll in deine Punk-Fresse Blei (brrr)\nIch roll’ in mei'm Benzer (yeah)\nS-Coupé (Bitch), Stern-Emblem (geil)\nArm aus dem Fenster hab’ im Heck paar Drogen\nFast 'n Hektar Drogen, außerdem noch Tec-Patronen\n\n[Part 2]\nIch hab' deine Nuttenmama mal wieder bis morgens um vier gebangt\nMein Riesenglied in sie gezwängt, ihr die Zeit mit mir geschenkt\nWill jetzt noch bis sieben penn'n\nDoch komm’ ich runter und setz' mich an' Küchentisch, will ich paar Teller seh'n (yeah) wie im Kniegelenk\nWo ist mein Proteingetränk? Der Shake muss hier steh'n\nMuss ich erst Kevin herrufen, um hier 'nen Bacon zu seh'n, mhm?\nDen schwarzen Toast riecht man in dreißig Kilometer (hm)\nUnd das hier, das kann man wohl nicht Ei nenn'n wie Korea\nAuch der Chai ist nicht so mega\nJetzt mal ehrlich, deine zweifelhaften Eigenschaften als Zofe beleidigen Kollegah\nWas stehst du Bitch so dumm rum?\nMassephase heißt, eine Mahlzeit muss drei satt machen wie der Öffentliche Rundfunk\nMan glaubt's ja wohl nicht\nKein Wunder, dass dein Sohn, wenn er nur den kaum kaubaren Mist von dir Hausdame frisst\nSo 'ne hauchzarte, kaum wachsende, nur Knochen und Haut habende\nSaublasse, abgefuckte Lauchstange ist\nDa könnt' ich ausrasten, Bitch, guck dir den Hungerhaken an (ey)\nSeine Oberschenkel haben meinen Unterarmumfang\nUnd auch seine Baggyhosen können das nicht übertünchen (ne-ne)\nDer BMI des Spargels liegt doch maximal bei fünfzehn (maximal)\nEr hat praktisch gar kein'n Rücken, und das Schlimmste\nAn ihm sind die Arme noch am dünnsten wie in Kannibalen-Küchen\nIch bin ehrlich geschockt (wallah)\nEy, bring mir den Jung'n mal her, Bitch, ab in die Lehre beim Boss"}], "artist": "Kollegah"}