{"songs": [{"year": null, "title": "Contraband 3 (A, B, C, D)", "image": "https://images.genius.com/bdd653946582aa8175d2fe527924778f.500x500x1.jpg", "lyrics": "[Intro]\nPress reset, muhfucka.  Renegade Renaissance.  And another one.  Do it my way.  The Yardfather returns.  You already know.  Back better than ever\n\n[Verse 1 – Saigon]\nI got a couple of deep questions for niggas that need lessons\nThe truth I deliver—you should consider these blessings\nIf you ain't heard Contraband 1 or part 2\nYou should Google those too so you can know how I do\nFirst question for niggas that dwell north\nWhat do y'all think the reason is New York fell off?\nA) This new batch of niggas sounding like switch siders\nB) New York DJ’s for being dick riders\nC) Fake thugs and shit pretend to be bloods and crips\nD) All of the above, ya bish (ya Bitch)\nSecond question, I think I'll take some suggestions\nWhat do we do about this rapper wearing a dress trend?\nA) Show ‘em how getting punched in the fuckin eye feel?\nB) Just wait ‘cause soon they'll be wearing high heels\nC) Line ‘em up but just provide em with a slaughter\nD) Or just admit this shit is Sodom and Gomorrah\nThe third question a question I take seriously\nI know you listening, but I don't think that you hearing me\nI ain't ‘gon front, shit kinda put some fear in me\nWhy people say all these tragedies a conspiracy?\nA) ‘Cause they really using HAARP to control the weather\nB) If a building's hit at the top, it would hold together\nC) They been saying the world'll end since 2010\nD) We remember the shit they did to the Indians\nThe fourth question a question that's controversial\nWhy do these square rap groups wanna be crime circles?\nAll of the fake drug dealing, all of the fake murders\nWhich of these niggas set black people back the furthest\nA) Trinidad James and All Gold Everything\nB) Rick Ross, the officer that'll gang bang\nC) 2 Chainz for really being a kid that has brains, or\nD) The white man that's running the game\n\n[Hook x2]\nYou never was a killer, you never bust a gun\nYou never held a spot down, was never on the run\nYou never was a OG.  No, it is not right\nFor you to say you was, then live in the spotlight\n\n[Verse 2]\nI'll strike the mag, smack the fag that said I jacked his swag\nThen smother the motherfucker with a Glad plastic bag\nI'm a maniac, like I get around violence and chain react\nDoctors still asking me,”What the fuck you so angry at?”\nI don't even know, but they say one out of every three\nBlack boys in the ghetto love metal and gun powder\nSomething about the bang, I like it a little louder\nI'm just telling the truth—it ain't even something I'm proud of\nYou know you fucked, jury come back in less than an hour\nHow you deliberate a nigga fate in less than an hour?\nMoney is power, then power is nothing\nA verse from me is equal to like a hour discussion\nMalcolm X was just 2Pac without the percussion\nWho'd of thought it would amounted to nothing?\n‘Til I came", "album": "G.S.N.T. 3: The Troubled Times of Brian Carenard"}], "artist": "Saigon"}