{"artist": "ILL BILL", "songs": [{"title": "Cannibal Hulk", "lyrics": "[Hook]\nIf you ever need help after a nuclear assault\nWho the fuck you gon' call? Me, cannibal Hulk\nSavages approach with bangers and cannons of smoke\nWho the fuck you gon' call? Call me, cannibal Hulk\nHow your daughter been abducted by a cannibal cult\nWho the fuck you gon' call? Me, cannibal Hulk\nGamma radiated cannibal Hulk, genius and dope\nWho the fuck you gon' call? Call me, cannibal Hulk\n\n[Verse 1: Ill Bill]\nYo, yo\nJump the Grand Canyon barefoot\nThrow their helicopter a thousand miles from their hood\nI personify rage, use to turn green before I learned to monetize pain\nMangles of coke, Ill Bill, cannibal Hulk\nBurn my internal soul if I ever betray my eternal oath\nFamily, friends shot each other in parked cars and\nChairman Alessandro is only two blocks from large Marv\nIt's forty mill' that got Morty killed, thought he was more wavy\nI call my grandmother's sauce gravy\nAnd when the shoty blows, adios\nNot proud to say my uncle Howie shot dope and sold Cosby coke\nArtifacts heartbreaking like a teen, suicide bomber attacking Iraq\nBeyond rap, society brainwashed, stay calm\nIce water like Raekwon, they artificial like a prosthetic arm\nListen, the pistol pop like champagne\nI rock like Van Halen when they had Dave\nPop the truck full for the milly, drug dilly, young Billy\nWith chuck jewelry and a cut grilly\nAngle dust Gelato, remember that a brand you can trust is the motto\nLSD in the food punch, it’s the I double L, left you two guns\nTrust me, you don’t want the smoke\nFuck around, transform into cannibal Hulk\n\n[Hook]\nIf you ever need help after a nuclear assault\nWho the fuck you gon' call? Me, cannibal Hulk\nSavages approach with bangers and cannons of smoke\nWho the fuck you gon' call? Call me, cannibal Hulk\nHow your daughter been abducted by a cannibal cult\nWho the fuck you gon' call? Me, cannibal Hulk\nGamma radiated cannibal Hulk, genius and dope\nWho the fuck you gon' call? Call me, cannibal Hulk", "image": "https://images.genius.com/80a603727b85f51760c599f962f6b88c.1000x1000x1.jpg", "album": "Cannibal Hulk", "year": "2019-03-29"}]}