{"songs": [{"image": "https://assets.genius.com/images/default_cover_image.png?1570807223", "year": null, "lyrics": "[Ali Vegas-Verse 1]\nBefore Ali became a don and gave his arm to melody\nHe swore to never set her free\nHe tricked on her, to get on her\nEven let his click spit on her\nLyric tried to warn her, the more she wondered the more she confused her\nThe more she loved him the more he abused her\nShe introduced him into the trifest game, she even iced his chain\nWho would've thought his life would change\nThe split second melody chose to give him twice his fame\nVegas was six when he first met her, ever since then he thirst cheddar\nIt was like God broke off his birth to inherit the earth\nHe would talk to her smoothly and others would cruse\nIt was time for the youngster to speak\nShe told him to stop running the streets and never loose his hunger for beats\nMake her number one and she guaranteed to place Ali Vegas amongst the elite\n\n[Ali Vegas-Verse 2]\nTogether they had to game sown\nDid a few street promos to get his name known\nShe said she know a few cats that seen dough\nShe thought them the difference between dough fats and primos\nIt's like telling a saint from healer, them two make the most distinctive mixture\nHe would tell her stories and she would paint the picture\nThey made the most flagrant scriptures\nEveryday they met with A (AZ) and Nas\nIn the studios he spit the most amazing bars\nMelody and lyric could really take him far\nAll they needed was a technician, that was they next mission\nTo find a producer that had the best vision\nIt's because of her he take vacation a choice\nEngineers'll pull strings to play with the bass and the voice\nShe should him things that most would never get to see\nI won't get rid of you, until you get rid of me\n\n[Ali Vegas-Verse 3]\nYo Vegas felt it was time he put her under the wing\nTake her places, show her things the average girl ain't never seen\nBefore he said \"I do\" and handed her that ring\nAll he needed was to know some things\nIf he was to die today would you cry for him?\nIf he was to be questioned by Jake's would she have an ably for him?\nWould she take the stand knowing she had to lie for him?\nBaby girl are you down to die for him?\nIf you down then we down for life\nWe could hold our heads up high and show up our crowns of ice\nI know some people say never say never\nBut I'mma say I'll never leave you we together forever", "title": "She (Melody & Lyric)", "album": "Generation Gap"}], "artist": "Ali Vegas"}