{"artist": "Webbie", "songs": [{"year": null, "lyrics": "(feat. Big Head)\n\n[Introduction: Webbie]\nTrill ent Young Savage\nIf it don't make dolla's it don't make sense\nI'm just doing what I do when I do what I do Nobody do it better nobody\nIf it ain't purple it ain't smoking right\n\n[Verse 1:]\nI don't know what's finna happen tomorrow\nBut Growing up in dem hoods\nAll a ni**a can do is hope it'll be good\nHim, big head dats my thug [? ]\nSo where you art (I'm in da hood) just stay dere I'll through it\nWhen I'm riding it's high 18 ft Or some hit with some heat\nTold my peeps I'm a die in these streets\nI'm a million dolla ni**a why am I in these streets?\nI don't know ni**a shittt I got love in these streets\n8th grade found a plug in em and I ain't turn back\nAin't no love in em thugs gonna have to learn dat\nI'm a tell ya'll da real doe money what we here foe!\nCause say he was coming home Monday, dat was a year ago\nTell me stop I blow, My tolerance is real low\nIf it wasn't fo baby bopper I woulda died from pounds a some years ago\nYoung savage I be hearing you doe, You got some tigger in you doe\nNigga sounding like you on da cool but I don't know\n\n[Chorus:]\nI make it just so sick dat dey gotta (bite my shit)\nMan I got so many hoes and bit*ches (like my dick)\nMan I ain't neva gon stop it's just like pimpin (just like dis)\nAnd get it (just like dis) and win it (jus like dis)\n[x2]\n\n[Verse 2:]\nI ain't neva had shit but dis rap wish\nBig whips but no money fo da chap stick\nBut I was real since a ni**a hit backflips\nI'm real in thugin I don't need no practice\n[? ]m Girls under the mattress\nStart Fuckin a bitch look like a actress\nI workin for da magnum stead of plastic\nEverywhere I go I got hoes so attracted\nDon't be hatin jus be brave and get yo ass whipped\nI'm a bust him if his ass trip\n\n[Chorus:]\nI make it just so sick dat dey gotta (bite my shit)\nMan I got so many hoes and bit*ches (like my dick)\nMan I ain't neva gon stop it's just like pimpin (just like dis)\nAnd get it (just like dis) and win it (jus like dis)", "image": "https://images.genius.com/c34737bbafed45ab75562f625e46ec8f.640x640x1.jpg", "album": "Savage Life 2", "title": "Just Like This"}]}