{"songs": [{"year": "1996-11-26", "album": "Enigma", "image": "https://images.genius.com/482eea61300bdf72a62b443973fd7a5c.1000x1000x1.jpg", "title": "Love L.O.D.", "lyrics": "Intro:\nYo, I seen them motherfuckers out in the street\nThem pussy asses\n(Man, fuck them niggas anyway)\nHood rats and those fat, rolly polly punks\n\nKeith Murray:\nYo Kel (What up?) yo answer this question\nWhy are we the nicest in this fuckin' profession?\n\nKel-Vicious:\nYo, it's um, simple philosophy\nDoe, ray, me, fa, so, love L.O.D. (yeah, yeah)\nAye yo 50, (What's up?) answer this question (What's that?)\nWhy are you the best in your profession?\n\n50 Grand:\nNow when I'm creepin' on a bitch M.C\nDoe, ray, me, fa, so, love L.O.D\nKeith Murray (Yo, what's up 50?) answer the question? (What's that?)\nWhy are you be the sickest in this profession?\n\nKeith Murray:\nI been all around the world hearing the wack M.C.'s\nIt's doe, ray, me, fa, so, love L.O.D\n(Aye yo) Ask yourself the very same question\nWhy are we the wickedest in this profession?\n\n50 Grand:\nI'm breaking back with Def Squad constantly\nDoe, ray, me, fa, so, love L.O.D\nAny nigga want to step, get busy\nDoe, ray, me, fa, so, love L.O.D\n\nKel-Vicious:\nI be the bushwa freaker coming thourgh your speaker\nMy jams be getting stronger\nWhile your shit be gettin' weaker\nNow Kel be playin' kids like the NY Knicks\nTaking it to your ass with these rhymes and shit\nCause kids contradict themselves when they be rhymning\nSounding like shit, off beat with no timing\n\n50 Grand:\nNow soon as I touch the paper, see you later\nI shut your lights off like a blackout\nSo hit the circuit breaker\nI'm the worst trouble you ever had\nVocab like knife stabs\nComin' wild killin' in a paragrah\nHolding niggas ransom, it runs in my blood\nMaybe my grandson might be wild like Charles Manson\n\nKeith Murray:\nI be the gimmie, the got ya\nBeen blastin' niggas way before the remix \"I shot ya\"\nThe proper hip hopper, fading em in the Palladium\nAnd bustin' each and every nigga, bubble in the Tunnel\nAfter the sunshine comes the rain\nHold up, wiat a minute, let me back up and just explain\n\nHook:\nI been all around the world\nWhat battle me?\nTake this autograph home and give it to your family\nAll I hear is booty stinkin' ass wack M.C.'s\nStricly doe, ray, me, fa, so, love L.O.D\n\n50 Grand:\nNigga your life means nothing to me, challenge L.O.D\nThe average nigga style sucks like a hickey\n50 G, the M.C.'s brain buster, mic crusher\nDirty money quicker picke upper, crew duster\nNow that L.O.D.'s  up in this motherfucker\nLeave a known rapper with Broken English\nLike Smooth Da Hustler\n\nKeith Murray:\nSome thing make a nigga laugh, make his ass cry\nHe rolled a seven\nI bet it all he turned around and rolled snake eyes\nMy thinking cap is bigger htan a fuckin' Sade's\nStay all-terrain, rainin' on all parades\nThe street is my bed and the corner is my pillow\nI'll kill your fuckin' ass and for your crew I'll do ditto\n\nKel-Vicious:\nI'll leave a nigga dead, and stinkin' take his soul\nCha-boom, cha-boom fill him up with holes\nNatural born killer, iller than the rest\n(Where you at?) East coast to west\nI keep it real kid, I freak the flow until it's naked\nNiggas get paniced and frantic and can't take it\n\nHook"}], "artist": "Keith Murray"}