{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": null, "lyrics": "[Intro]\nI just want to be famous\nI just want the world to love me\n\n[TV Reporter]\nAnd this just in\nTom Cruise and Will Smith are buttbuddies\nBack to you gentlemen\n\n[Block McCloud]\nTop celebrity, top celebrity\nTop celebrity, top celebrity\nI'll make you famous\n\n[Verse 1: R.A The Rugged Man]\nHmm, so you wanna get your ugly face on TV?\nWanna be a superstar, wanna be a top celebrity\nToo short to be a ball player, too ugly to be an actor\nToo dumb to sell drugs and now you're trying to be a rapper\nNow all you gotta do is shake hands with the devil\nMaybe lick a little, uh, penis, I'm for real on the level\nIf you take a dick you could make a hit, you could jack the styles\nOf underground rappers and claim you've created it\nYou could get cash and be massive, you could be worshipped and be a tool\nFor the corporations and help them gain control of the masses\nMake sure you make more hits, product placement, packaging products\nSo poor people could make corporations more rich\n\n[Chorus: Block McCloud]\nI'll make you famous. I'll take your kids, your rhymes\nYour blood, your life, your soul\nTop celebrity, top celebrity\nTop celebrity, top celebrity\nI'll make you famous. I'll take your kids, your rhymes\nYour blood, your life, your soul\nTop celebrity, top celebrity\nTop celebrity, top celebrity\nI'll make you famous\n\n[Verse 2: R.A The Rugged Man]\nSociety, celebrity obsessed, shock value, Janet pulling out a\nBreast, Gaga wearing a meatmaggot infested dress\nYou don't need talent to be worshipped when you walk in a building\nThey'll praise you if you ain't shit but you rich and your parents own the Hilton\nMore and more people are becoming non-believers\nIn a world where your children know more about Snooki then they know about Jesus\nAnd in the hood there's more pressure cause if you're a black actor in Hollywood\nThey try to make sure you become a cross-dresser\nWe like Martin running through traffic, butt-naked with a gat\nOr little Britney shaving her head, beating up cars with a bat\nDon't forget during your journey of dreamchasing you should promote\nIlluminati images, pretend to be a Free Mason\nWorshipping witchcraft and satanic scriptures. RnB\nDivas posing as Baphomet, goats and pagans in pictures\nDon't try to help the neighborhood, they're broke, the don't feed you\nAnd who cares if the babies are dying? They don't really need you\nThe ladies love you now, you're large till a lying ass gold digger\nShow up at your hotel and you catching a rape charge\nSo black people, don't be stupid, stop letting white lawyers\nBusiness execs and white accountants dictate your music\n\n[Chorus: Block McCloud]\nI'll make you famous. I'll take your kids, your rhymes\nYour blood, your life, your soul\nTop celebrity, top celebrity\nTop celebrity, top celebrity\nI'll make you famous. I'll take your kids, your rhymes\nYour blood, your life, your soul\nTop celebrity, top celebrity\nTop celebrity, top celebrity\nI'll make you famous\n\n[Verse 3: R.A. The Rugged Man]\nNow BET got bought out, let me explain briefly\nNow it's WET, white entertainment TV\nViacom, Time Warner and Disney, those the true\nDictators of black music, hip hop and RnB\nThey're politicing your careers they could set you up and you could get\nMurdered and your murderer just mysteriously disappears\nTry to get murdered, take note, rappers\nCause getting killed can turn an average artist\nWith above average talent to GOAT status\nFemale entertainers, you losing the race, God forbid you get a\nWrinkle, go see the surgeon, hurry and mutilate your face\nSome times you gotta come from the struggle and suffer\nOther cases your dad can be OJ's lawyer and you can fuck Brandy's little brother\n\n[Chorus: Block McCloud]\nI'll make you famous. I'll take your kids, your rhymes\nYour blood, your life, your soul\nTop celebrity, top celebrity\nTop celebrity, top celebrity\nI'll make you famous. I'll take your kids, your rhymes\nYour blood, your life, your soul\nTop celebrity, top celebrity\nTop celebrity, top celebrity\nI'll make you famous", "title": "Make You Famous", "image": "https://images.genius.com/c839ae29cd32413eb20a1c6585d7d604.1000x1000x1.jpg"}]}