{"artist": "ProfJam", "songs": [{"album": null, "title": "DarkSide", "image": "https://images.genius.com/06600b3d132b5f96ede940c012fcd560.927x927x1.jpg", "lyrics": "Bem-vindo ao dark side e olha que a força tá comigo\nSou máquina com o flow, qd tu falas eu desligo\nA minha pata fica psico qd escrevo mais um artigo\nDiz só que eu não consigo só pa eu ter mais um motivo\nSou fly - so bye bye, nem me apanhas no sky\nMete um fato de astronauta e vem ter à lua co pai\nTou na sexta de jupiter e se o puto tiver vai\nE tipo dois paus cruzados - so a tua puta quer mais\nNao é deliquente, é rap doente - sente os sintomas\nPescoço ja nao para, testa cheia de hematomas\nFesta cheia de brutas conas, restam feias, putas, donas de casa\nMudam me a vibe, fodass, agora tou em brasa\nPassa me o copo, tou on fyah tipo o cuspo do spit\nBehind red eyes, limp biskit, bush shit\nTanta bullshit parece que tou na arena\nE tu directo pa cova co uma campa pequena\nAcampa pequena, ja tenho a tenda montada\nE olha que eu nao vendo nada, a esquina foi toda espigada\nPonho lhe a venda nos olhos e ela ja nao ve nada\nAmordaçada, coitada, chama-me papi, daddy, father...\nFico darth vader, respiraçao frenetica\nCom o light saber ela fica toda electrica\nPussy shaker, vibrator é mera replica\nDeito-a ca peida pa meca e meito em jeito de arma bélica\nE ela... e elaa... e elaaa...\n\nTem cara angélica e asas tambem encontro nela\nMas nao pode ser um anjo pq eu sei o sexo dela\nE com uma vela queimo a vela da caravela\nAssim onde tamos ja nem o vento nos leva...\nTou noutro level, queres? eu dou te o cheat code:\nNao tires o som do ouvido, tripa no meu sick mode\nTou numa bina sem pedals, highscore com um pogo\nQueriam me banhar as medals, fuck that, my flow gold\nWordplay tipo gunshow, ganho ao gula no gancho\nSou tipo o gunplay, cowboy fora do rancho\nWu tang clan profjam, killa bees go!\nO truque é deixar o flow guiar o teu boat...\nSo sing with me: fuck everybody!\nNiggas wanna be me, hoes they only wanna party!\nYou see me in my city, high as fuck, head cloudy\nFaded player like a fader gettin super loud", "year": "2013-05-10"}]}