{"songs": [{"album": "Cole World: The Sideline Story", "year": "2011-09-27", "title": "Cole World", "image": "https://images.genius.com/40e3a5c128f6db9b27cebe6606882165.1000x1000x1.jpg", "lyrics": "[Intro]\nI think it's gonna be a hell of a night, a hell of a night\nSo we could do whatever you like (Like, like, like...)\nHey, hey!\n\n[Verse 1]\nIt took me all day to find some inspiration\nIt just hit me like a ton of bricks, no renovation\nProblem with the game now, there ain't no innovation\nI see my shit all in your shit, we call that imitation\nAnd they say that's flattering, but I ain't flattered at all\nMatter fact y'all need to practice that more\nSee my man Nate asked me if I gained weight\nI said nah, my pockets got fatter, that's all\nMoney was an issue, but now that that's solved\nI ball, I ball, like Kobe in the fall\nPut trophies on wall, rather trophies on my mantle\nDog my shows be off the handle\nTake the proceeds go to gamble\nHa, bet it on black and pray, I quadruple my salary\nIf I win, maybe then I could pay Sallie Mae\nTold her I be dealin' with some real-life shit\nShe be askin' \"When?\", Bitch! When I feel like it\n\n[Hook]\nCole World (World), Cole Life (Life), Cole Blooded\nI be on my shit, and look at, all the hoes love it\nGot a hundred fifty bitches in the club starin' at me\nHow that feel? Very happy! Ha, ha, ha!\nI got what you need right here, right here\nI got, I got what you need right here, right here\nI got, I got what you need right here, right here\nI got, I got what you need right here, right here, hey!\n\n[Verse 2]\nUh, turn up the 808's for me (Woohoo!)\nBack when I was starvin' no one made a plate for me (Woohoo!)\nNow I do it big and that's my day to day story (Woohoo!)\nI got the type of shit that make a hater say sorry\nBitch, I made this in the crib, watchin' Belly\nEatin' peanut butter jelly, what the fuck the niggas tell me\nThey say I'm takin' long, I tell em patience is a virtue\nI'm goin' all out and bitch I never had a curfew\nSee, when you're spittin' so real\nSuddenly these phony niggas lose they appeal\nGot em' feelin' like my niggas when they lose, they appeal\nThen it's back to the cell, back to the hell\nAt times I watch the news and see they talkin' 'bout diplomacy\nAnd they ain't got a clue my niggas ain't got they diplomas, see\nRappers show me love, I wonder what it could be\nI think they scared of me, and they should be\n\n[Hook]\nCole World, Cole Life, Cole Blooded\nI be on my shit, and look at, all the hoes love it\nGot a hundred fifty bitches in the club starin' at me\nHow that feel? Very happy! Ha, ha, ha!\nI got what you need right here, right here\nI got, I got what you need right here, right here\nI got, I got what you need right here, right here\nI got, I got what you need right here, right here, hey!\n\nHm, Ok, we're outta here (O-o-o-key-key-key)\nI think it's safe to say we outta here\n(We outta here, we outta here, we-we-we)\nWe outta here\nI think it's safe to say we outta here\n\n[Outro]\nI think it's gonna be a hell of a night (Night, night, night)\nA hell of a night (Night, night, night)\nSo we could do whatever you like (Like, like, like)\nHey (Hey, hey, hey...)"}], "artist": "J. Cole"}