{"songs": [{"year": "2000-04-04", "image": "https://images.genius.com/b70930fc56c82c3038f706c659b43fc6.500x500x1.jpg", "title": "You Was Wrong", "album": "Yeeeah Baby", "lyrics": "[Intro: Drag-On]\nWhat?\nT-S nigga\nY'all don't know?\n\n[Bridge: Drag-On]\nAiyyo its on, I see how niggas didn't learn\nYou is wrong, thought the fire didn't burn\nIts on, me and Pun ain't from the Bronx\nYou's wrong, nigga we can get it on\n\n[Verse 1: Drag-On]\nAiyyo, guns we toss 'em, and bodies we auction\nTo his family we tell 'em he owed us a fortune\nGimme forty-thou, you can have your child, you don't know\nWhat I had to go through, to clap this clown\nCheck my background\nThe last nigga to see you bleed\nTthe last nigga to see you breathe\nThe last nigga you wish you shoulda believed\nAnd Drag move quick, blend right in the wall like a brick\nThe only thing you see before I blow off ya shit is my wrist\n'Cuz my hand the gun is covered in\nNot this range, when I pump this pistol, its very rare I miss\nIt's damn near on your lips\nY'all keep talkin like y'all teflon with no weap-ons\nNigga I'm pumpin my raw, I ain't thugging no more\nNowadays niggas run upstairs, open they drawer\nMy circumstance, you ain't got that chance\nMines in my draw, you get it?\nThats means y'all walks for two dicks, so don't be stupid\nAnd make me use one, unless you not a bitch\n\n[Bridge: Big Pun]\nAiyyo it's on, you thought I was wack\nYou was wrong, album double plat\nYo it's on, stop talkin shit\nYou was wrong, get off my dick\n\n[Verse 2: Big Pun]\nHow dare you doubt or deny Big Pun, the undoubtable\nThe only rapper that'll pull out a gun and slap the shit outta you\nYou can't tell me nothing, I'll clonk you and stomp out ya belly button\nI'm too violent for this rap shit, I should be out somehwere killin somethin'\nToo quick to blast, some niggas talk shit and dash\nBut I really will KICK YOUR ASS\nJuggernaut, I don't care if you a thug or not\nI'll get Jamaican on ya ass, rudeboy, what the bumbaclot?\nOn your mark get ready, run, I'm sparkin' everyone\nDon't wanna get locked? Stand back and watch\nWhere you from?\nHow dare you come and try to shit where I eat\nFuck you nigga, literally\nDick in your cheeks, you rich in the street\nBut I'm still gon' hit cha'll niggas\nBecause up north you be tossin' salads with maple syrup\nI know you hate to hear it, but everybody know this one\nWhy you always gotta be right nigga?\nWhy can't you ever be wrong?\n\n[Bridge: Fat Joe]\nNow it's on, from the Bronx where its at\nYou was wrong, me and Pun brought it back\nNow it's on, stay on with the gat\nYou was wrong, it's the Don, Joey Crack\n\n[Verse 3: Fat Joe]\nWho the fuck want beef with Joe Crack\nMake your body fold back\nLift his soul with the chrome mack\nI don't chat on the phone, 'cuz the phone tapped\nYou heard there's money on the block, we control that\nI got the work in the pot where that stove at\nCook it up 'till it's rock, get my dough back\nYou niggas so wack, tryna compete\nI blind you with heat, I'm the reason crime on the street\nI die for my peeps, keep an open eye when I sleep\nLet you slide when I coulda put five in your Jeep\nWho's liver than me? I ain't know you really want it\nI'm like Christ, niggas beg for they life when they see me comin\nAin't nodoby gonna stop my shine, you out'cho mind\nDon't make me have to cock my nine, pop ya spine\nNeva did believe in the Don's\nSince ninety-two I've been proving that y'all niggas was wrong\n\n[Bridge: Remi Martin]\nAiyyo, it's on, though I'd stay on the block\nYou was wrong, now Remi on the rock\nSo it's on, thought I wasn't gonna drop\nYou was wrong, I was right all along\n\n[Verse 4: Remi Marin]\nI told these niggas, that I was the sickest bitch\nAnd everytime you spit, I'mma spit some sicker shit\nRidicoulous, I reminisce and blaze the track\nType of shit make a nigga wanna play it back\nY'all hatin' that, but I'mma make 'em all believers\nFuck hot, I'mma come and straight drop a fever\nCop a heater, turn around and pop your leader\nAnd for the followers, I'mma leave their heads hollower\nMake your wig twisted as if I was Oliver\nLayin' in a hospital, hooked up the monitors\nThats for the game, y'all lames just came to first\n'Cuz I ain't neva heard a bitch straight flame a verse\nI blame the church, how God let you lie like that\nWho scribed you for, 'cuz you ain't never rhymed like that\nHow the fuck you gon' tell me that chick is tight\nShe ain't 'aight 'cuz she don't write, you wrong"}], "artist": "Big Pun"}