{"artist": "Kirk Knight", "songs": [{"image": "https://images.genius.com/181e1d2446794ee27e22e7131562e60a.400x400x1.jpg", "title": "Brokeland", "year": "2015-02-09", "album": "Late Knight Special ", "lyrics": "[Intro]\nYeah, yeah\nShit I seen and eh\nWith the figure S, nigga\nIt’s Kirk Killa, shit!\n\n[Verse 1]\nI smoke Backwoods and Dutchies\nThe extra dusty young fly motherfucker\nOh my God it must be — triple-K cutter\nBrooklyn life-and-deather\nCross me, be the first and last like Alpha and Omega\nSo, what's the dilemma hon'?\nNiggas with hella guns\nResidence medieval so watch my umbrella, uh\nBright like candella with statements like Mandela, uh\nStank-face still stainless, it's whatever bruh\nThink and lead a coffin right there, we headin' AWOL\nMy getaway, it's that stick shift call it 8 ball\nHopped in the hot seat I'm drunk nigga\nLeave you slump nigga\nDon't get dumb nigga\nI know it's time for change so we snatch quicker\nNot measly shit I seen as a little figure\nI dare some\nTo try to flash clothes and fair guns\nBecause where I'm from for amusement shoot the fair one\n\n[Hook] (x4)\nThe mind of a Brooklyn nigga\nGo Brooklyn, go Brooklyn, go Brooklyn\nBrooklyn's in the house!\n\n[Verse 2]\nI said nowadays Brooklyn ain't the same\nAnd life's a scam and I'd rather be paid\nCredit card by that fuckin' BOA\nBut if you want a couple stacks than you're going to Chase\nIf you play your cards right than you're heading the fast way\nAnd them niggas in the clash just fillin' up plates\nSo I just keep on, reachin', lying to my teachers\nWith the hammer pants, I keep security cards in my sneakers\nI'm heading for the trust funds, bonds, and planned speeches\nAll I ever knew was a ATF procedure\nTransaction, gotta eat, serving all the status\nNo fan could catch me that BMW fashioned\nBlack tinted, Mac 10, oh yes the bitches\nCircle round scan them pockets for the double digits\nAnd these things around me make my wants money, bitches\nBut my conscious told me just look back and listen\n\n[Hook] (x4)\nThe mind of a Brooklyn nigga\nGo Brooklyn, go Brooklyn, go Brooklyn\nBrooklyn's in the house!\n\n[Outro]\nNow I ain't gonna tell your fuckin' ass you owe me motherfuckin' money! Now strip motherfucker strip! Strip! Come on. Now everybody know that money is the root of all evil. I'll show y'all how the loot work"}]}