{"artist": "Problem", "songs": [{"album": "Selfish", "title": "Living Good (R.I.P. Jen)", "image": "https://images.genius.com/8165c0445cec284a3a939bed51fc0555.1000x1000x1.jpg", "lyrics": "[Chorus: Problem]\nI'm living good, why you wanna see me doing bad nigga?\nYour bitch just left, say its the best night she done ever had, nigga\nHoe stop lying, real bitches holla out\nNigga stop lying, real niggas holla out\n\n[Verse 1: Nipsey Hussle & Problem]\nI came back with some better rhymes\nBigger name, bigger chain and better rock\nAs I operate the enterprise\nReal nigga, first mil, you re-energize\nFake gone, real finna rise\nNiggas wouldn't believe all the bad bitches I done been inside\nBeating the odds, ain't a bigger prize\nKill me off 'fore I live a lie\n\n[Chorus: Problem]\nI'm living good, why you wanna see me doing bad nigga?\nYour bitch just left, say its the best night she done ever had, nigga\nHoe stop lying, real bitches holla out\nNigga stop lying, real niggas holla out\n\n[Verse 2: IamSu! & Problem]\nMy phone won't stop ringing, Fat T keep on hitting me\nThe homie just got his head knocked off on Century (fuck)\nTo us that's fucked up, to the opps that's a victory\n15 years later still fuck with me, mentally\nWon't let it get to me (roll up), the weed it be fixing me\nOff of 6 O's like wit Biggie and where Nipsey be\nWhat?!\nLet me break it up, life like dice, time to shake it up\nWhat?!\n(Diamond) I'm living life, boy\nAnd she bust it open for the right boy\nThe devil think we got a price, boy\nIt's on you if you gonna prove them right, boy\nDiamond light, Mr light nigga\nChained up, turning up like them white niggas\nI'm doing me, why you mad? What's the gripe nigga?\nI hit the weed then I run the light nigga\nShots\n\n[Chorus: Problem]\nI'm living good why you wanna see me doing bad nigga?\nYour bitch just left, say its the best night she done ever had nigga\nHoe stop lying, real bitches holla out\nNigga stop lying, real niggas holla out\n\n[Bridge: Problem & Nipsey Hussle]\nLight the weed, then I levitate\nWe in this here to innovate\nWe'll let all you other niggas emulate\nSurvival in this shit, that'll make 'em whine\n\n[Interlude]\nWait a minute, what the fuck is your problem?\nYou got a fucking problem?\nI know what your problem is\nYou got nothing better to do with your life\nBut I'll give you a fucking real problem\nChachi, talk to these motherfuckers\n\n[Verse 3: Problem]\nLet me, let me loose, let me, let me loose\nThrowing fingers out the roof, motherfuck a truce\nHBK, Diamond Lane, we hit our squad goals\nDon't need you niggas for nothing as far as our squad goes\nIn that pussy, diving deep, no goggles\nChachi, Paparazzi, count a million with his eyes closed\nBad Lucc, Kool John, P-Lo, Sage the Gemini\nCali outcast, so lets drop a fucking 'Quemini\nNever put a bitch over the business 'cause these women lie\nWhy? 'Cause these women lie, 'cause these 'cause these women lie\nDrop this shit and kill these niggas like it's genocide\nNever ill-advised, please respect my business mind\n'Cause all this shit pimping to me\nThis rap game, only thing I see different is me\nAnd I don't talk about it, I just go Nike on a nigga\nAsk Su, he done see me go hyphy on a nigga, it's the crew\nNever catch us with our hands out, only bands out\nSee us coming, pull 'em cams out, ch-ch-cheese\nWhite bitches, on they knees, Thelma and Louise\nYell it out on three, \"Fuck my enemies\"\n\nYell it out on three, \"Fuck my enemies\"", "year": "2017-11-03"}]}