{"songs": [{"lyrics": "[Verse 1: My Chemical Romance]\nWhen I was a young boy\nMy father took me into the city\nTo see a marching band\nHe said, \"Son, when you grow up\nWould you be the savior of the broken\nThe beaten and the damned?\"\nHe said, \"Will you defeat them\nYour demons, and all the non-believers\nThe plans that they have made?\"\n\"Because one day I'll leave you\nA phantom to lead you in the summer\nTo join the black parade.\"\n\n[Verse 2: JAY-Z]\nThey say \"they never really miss you til you dead or you gone\"\nSo on that note, I'm leaving after the song\nSo you ain't gotta feel no way about Jay so long\nAt least let me tell you why I'm this way, hold on\nI was conceived by Gloria Carter and Adnes Reeves\nWho made love under the sycamore tree, which makes me\nA more sicker M.C. and my momma would claim\nAt 10 pounds, when I was born I didn't give her no pain\nAlthough through the years I gave her her fair share\nI gave her her first real scare\nI made up for birth when I got here\nShe knows my purpose wasn't purpose\nI ain't perfect, I care\nBut I feel worthless cause my shirts wasn't matching my gear\nNow I'm just scratching the surface cause what's buried under there\nWas a kid torn apart once his pop disappeared\nI went to school, got good grades, could behave when I wanted\nBut I had demons deep inside that would raise when confronted\n\n[Hook: My Chemical Romance]\nHe said, \"Son, when you grow up\nWould you be the savior of the broken\nThe beaten and the damned?\"\nHe said, \"Will you defeat them\nYour demons, and all the non-believers\nThe plans that they have made?\"\n\"Because one day I'll leave you\nA phantom to lead you in the summer\nTo join the black parade.\"\n\n[Verse 3: JAY-Z]\nNow all the teachers couldn't reach me\nAnd my momma couldn't beat me\nHard enough to match the pain of my pops not seeing me, so\nWith that disdain in my membrane\nGot on my pimp game\nFuck the world, my defense came\nThen DeHaven introduced me to the game\nSpanish Jose introduced me to 'caine\nI'm a hustler now\nMy gear is in and I'm in the in crowd\nAnd all the wavy light-skinned girls is loving me now\nMy self-esteem went through the roof, man, I got my swag\nGot a Volvo from this girl when her man got bagged\nPlus I hit my momma with cash from a show that I had\nSupposedly, knowing nobody paid Jaz wack ass\nI'm getting ahead of myself, by the way, I could rap\nBut that came second to me moving this crack\nGimme a second, I swear\nI will say about my rap career\nTil '96 came, niggas I'm here\nGood-bye\n\n[Hook: My Chemical Romance]\nHe said, \"Son, when you grow up\nWould you be the savior of the broken\nThe beaten and the damned?\"\nHe said, \"Will you defeat them\nYour demons, and all the non-believers\nThe plans that they have made?\"\n\"Because one day I'll leave you\nA phantom to lead you in the summer\nTo join the black parade.\"\n\n[Verse 4: JAY-Z]\nGood-bye to the game, all the spoils, the adrenaline rush\nYour blood boils you in the spot, knowing cops could rush\nAnd you in a drop, you're so easy to touch\nNo two days are alike\nExcept the first and fifteenth, pretty much\nAnd \"trust\" is a word you seldom hear from us\nHustlers, we don't sleep, we rest one eye up\nAnd the drought will define a man when the well dries up\nYou learn the worth of water without work, you thirst til you die, yup!\nAnd niggas get tied up for product\nAnd little brothers' ring fingers get cut up\nTo show mothers they really got em\nAnd this was the stress I lived with till I decided\nTo try this rap shit for a living\nI pray I'm forgiven\nFor every bad decision I made\nEvery sister I played\nCause I'm still paranoid to this day\nAnd it's nobody's fault I made the decisions I made\nThis is the life I chose, or rather, the life that chose me\n\n[Outro: My Chemical Romance & (JAY Z)]\n(If you can't respect that your whole perspective is wack\nMaybe you'll love me when I fade to black)\n\nWhen I was a young boy\nMy father took me into the city\nTo see a marching band\nHe said, \"Son, when you grow up\nWould you be the savior of the broken\nThe beaten and the damned?\"\nHe said, \"Will you defeat them\nYour demons, and all the non-believers\nThe plans that they have made?\"\n\"Because one day I'll leave you\nA phantom to lead you in the summer\nTo join the black parade.\"", "title": "Black Parade On December 4th", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}