{"artist": "Pacewon", "songs": [{"album": null, "title": "Any Champion", "image": "https://s3.amazonaws.com/rapgenius/1362133040_pacewon1.jpg", "lyrics": "[DJ Revolution scratches]\n\"Pacewon\"\n\"I get physical, mystical, very artistical\" -] Big Daddy Kane\n\"Outsidaz\" -] Rah Digga\n\"And if you don't know, now ya know\" -] Biggie\n\nAnd it go..\n\n[Verse One: Pacewon]\nAll across the world from North to Los Angeles\nNever have you witnessed a rapper this hazardous\nRun up on your vehicle, carjack ya passenger\nIgnore jake, don't nobody hassle us\nIn crooked eye New York, New Jers' is the realest\nWannabe niggas catch feelings\nJust 'cause a brother got it straight down eatin\nCondo and Phoenix, furnitured up like the showroom in Seamans\nTake a vacate, hold the A.K. - y'all need help like \"mayday, mayday\"\nScramble, love somebody you lose; light a candle\nKeep guns by you like commando, bust 'em\nBitch ass niggas ain't accustomed to viewin\nHomicide to you walk up and put to it\nMind power's like the druid, got a unit\nGot beef, step to it.. motherfuckers\n\n[Verse Two: Pacewon]\nYo, I hit you with another one, hit you with the troublesome\nPacewon play you can't recover from\nHit you with the hook, huh, ha, that's the Rah\nThen I put a hole in ya side: BURNIN\nNiggas tried to school you but you couldn't learn it\nWhatever happened to you, you deserve it\nAs for me, I'm record dealt up, kickin real slugs\n'bout to mill' up, never give up, hear me?\nYo even if I lose and my eyes get teary\nI gotta taste the cheese like Tom do Jerry\nNow, half y'all rappers that's wack\nNasty pussy boys just scared to blast back\nRunnin like their AMP tracks, scared to just\nStand their ground, grab their pound, shoot the man back\nLook 'em in the face, see how the fag act\nAnd fill his pussy ass with led, and mad cat\n\n[Verse Three: Pacewon]\nUnderstand?\nYo I'm the king of the underground radio waves\nBeen down since them shady old days, motivation\nIf the doorway blocked, I'ma kick my way in\nNever been the one for you to play with\nYo when I roll up on your ass nigga don't say shit\nDon't nuttin move but the pavement\nYo I'm the man to bring you water when it ain't none\nStickin up banks with a paintgun\nLike free base I'm that shit that leave your face numb\nHitman waitin in your house with a twelve gauge pump\nBetter known to y'all as Pacewon, sincerely yours\nLive from New Jers', feel me y'all..", "year": null}]}