{"artist": "Young Thug", "songs": [{"year": "2013-10-07", "lyrics": "[Intro]\nYeah, yeah, yeah\nYeah, yeah\n\n[Hook]\nOh, ran up my check now I can't be these niggas\nI, I want that cream just like s'mores, aye\nRan up a check now I can't be these niggas\nYoung Thugger liking the time, and the time, and the time, and the time\nI be liking the time, and the time, and the time, and the time, and the time\nAye!\n\n[Verse 1]\nThugger Thugger gon' take yo ass in that truck! (Come on)\nOh yeah, yeah\nThugger Thugger gon' let you meet his mother, his father, his sister, his girl, and his cousin\nAnd I look like a million, yeah (Cash)\nI look like a million, yeah\nGirl I watch your children while you go to work all the time, all the time, all the time, all the time, yeah\nBallin' in a trap, pullin' all the trash from the back\nFrom the back, from the back, aye\nTry to gimme somethin', I don't know how to act\nWhy the hell is it so fat, and you don't know how to bounce that\n\n[Hook]\nI be like \"whoa!\"\nOh, ran up my check now I can't be these niggas\nI want that cream just like s'mores, yeah\nRan up my check now I can't be these niggas, uh\nI be like \"whoa!\" (Cash Talk)\nRan up my check now I can't be these niggas\nI want that cream just like s'mores!\nRan up my check now I can't see 'em, no\n\n[Verse 2]\nThat butt sit out like a open thong\nGot tons, got sons, we can go meet moms\nMy swag worth a milli'\nI'm a blood, I want a Bentley\nThese hoes take me down, they wanna sue my business\nS-L-I-M-E, can't spell \"slime\" without \"me\"\nI strapped to the \"T\"\nI'ma make sure I spit when I sneeze\n(Chee, chee!)\nKing Cupper my Wodie, no Magnolia\nDrink yo sister, no solar\nI'm cold as a Polar\nNo Magnolia but I know ya\n\n[Hook]\nOh, oh, oh\nRan up my check now I can't be these niggas, nah\nI want yo cream just like s'mores, just like s'mores baby\nRan up my check now I can't see 'em, nah, nah\nI be like \"whoa\", I be like \"whoa!\" Yeah!\nRan up my check I can't see these niggas, no!\nI want yo cream just like s'mores! Aye\nRan up a check now I can't see these niggas, yeah\nRan up a check now I can't see these niggas\n\n[Outro]\nRan up a check now I can't see these niggas\nRan up my check now I can't see these niggas\nBuild up them blocks till I can't see these niggas\nWhoo!", "image": "https://images.genius.com/8a4fe393a9c3a1c2eca3e55eff0db85b.1000x1000x1.jpg", "album": "19 & Boomin ", "title": "Can’t See ’Em"}]}