{"songs": [{"lyrics": "[Verse 1]\nWhen I’m alone\nSmoking weed, sitting by the window in my home\nOften thinking why the fuck is it I’m not in Rome\nIf I had a little motivation, money, and a hot body\nI see it now, Bronson, the heart-throbby\nNo more pigging out, binging on the late night\nNo more sneaking juice in the syringe to get the game tight\nNo more pack of hot dogs on my neck right by the fade right\n40 pounds to go and then you hookers getting laid right\nI’m eating salad but I’m leaving off the croutons\n'Cause ever since a youth your dog's huskier than UConn\nSavings on the cookies, mommy clipping out the coupons\nPassing out from over-eating, sleeping on the futon\nLock the refrigerator, there’s no controlling me\nSteak and chocolate got they muthafuckin hold on me\nAin’t trying to be laid in a box, roses on me\nBronsolino running 5 miles for the glory\n\n[Bridge]\nLets go, 20 more to go baby boy\nYo you want that V by the crotch right?\nYeah lets go (I want it)\nGimme some pushups\nGimme some dips (I can’t no more)\nLet me get some jumping jacks (Gimme a sandwich!)\nYeah you want that steak dinner don’t you? (AAAAH)\nYour gonna work that sandwich off now (I need marshmallows!)\nYeah lets fuckin go\n20 more miles, lets go you fat fuck\n(AH MARSHMALLOWS, GIVE IT TO ME)\nYou motherfucker, you, fuck you!\n\n[Verse 2]\nFrom philly cheesesteaks, lobsters on the barbeque\nI’m getting twisted eating chicken with a prostitute\nAn hour later eat the burger with my drug dealer\nThen add the butter to the fudge to make the fudge realer\nEvery five minutes look in the fridges as if magic happened\nSneak a cookie, rip the bag, and fix the plastic wrapping\nI don’t want know one to know that I took it\nCause I'm an over-eater (Ay yo ock, ay yo ock, fry the mayonnaise for me, man)\nLife is a smorgasbord to me and I’ma over do it\nI wanna wear Italian clothing but it just don’t cut it\nNot the type that show the package with the crystal studded\nThe shit they model in Milan that’s looking crispy custom\n5 and 6 bitches, lickin’ my dick twitches\nServe up a facial, Mister Belding, bitches dismiss ‘em\nFor now I’ll take what I can get till this shit switches\nWhatever fuck you stupid bitch\nPeace to the Drums of Heaven\nPeace to beef ribs\nExtended lunch time I eat enough for three kids\nGo on a diet, then fall off because I’m weak kid\nSince I was young I’m eatin’ candy on the sneak tip\nMy day is based upon fine drugs, cholesterol\nThough at my height and weight im probably still the best at ball\nI’m tatted up, I have no shame to show the chest at all\nI bet I have your lady humming on my testicles\n\n[Outro]\nYeah, Bronsolino\nBout to be fuckin, summer time in the winter\nShirtless", "title": "Ronnie Coleman", "album": "Dr. Lecter", "image": "https://images.genius.com/9b10376fe5cc5f697702488523dba2cd.580x521x1.jpg", "year": null}], "artist": "Action Bronson"}