{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/d64a07454f5f799f903401eb571f1020.600x600x1.jpg", "title": "The Meaning To Your Love", "year": "2011-05-31", "album": "Riches, Royalty & Respect", "lyrics": "[Verse 1]\nYo, is it me or the damn chain? (My chains)\nIs it me or the champagne? (Let me know)\nIs it me or the tan range?\nIs it the dame can't restrain cos the man blames?\nDoing the type of bull a little smaller with the damn rage\nIs this cos she see me push the business around?\nIs she living in a town where syringes are found?\nIs it because she know I’m breaking a stupendous amount?\nInvite you out to the house and your friends is aroused (like wow)\nIt just couldn’t be the waiters and the catered food\nGreat booze, lake view and a room like a Laker do [?]\nJust to show you what a good amount of paper do\nThe big faces eat you look like a caper move [?]\nLaced with jewels, wrist, neck, chest full of ice\nLook like you ran inside of Tiffany’s and pulled a heist\nWhere you stay inside the PJs is full of mice\nKnow it's just me you like\nCut it out\nYou pulling pipe\n\n[Hook] [x2]\nThere’s a limit to your love!\nYo, what’s the meaning to your love, Mom?\nThere’s a limit to your love!\nTell me the meaning to your love, Mom\nThere’s a limit to your love!\nWhat’s the meaning to your love, Mom?\nThere’s a limit to your love!\nTell me the meaning to your love\n\n[Verse 2]\nIs you here for the long run?\nIs you here for the long sums?\nSee where you at if the storm come\nI bet you up and leave a breeze like no wrong done\nA ounce of weed a day baby you got some strong lungs\nBut what would happen if God forbid I'm in an accident\nLose my two legs and my back is bent\nAnd every stack sent to doctors for puttin' brackets in\nI bet you say, ‘Salute captain’ and go and pack your tents\nFirst time I seen a chick do a backwards limp\nI be like, What happened, baby, I thought G Rap your prince?\nShit brought you back to senses when a nigga back in rent\nI bet you haven a foot forward and one back to sprint\nWhen it’s all gone and life no longer immaculate\nWhen his pockets flat and he down in the dumps\nThe whip's no longer dumping those sounds in the trunk\nNow you’re frowning and you’re sunken like you crowning the chumps\n\n[Hook] [x2]"}]}