{"songs": [{"year": "2019-09-19", "image": "https://images.genius.com/ca34607b62772ff63a2967378b5b4619.644x644x1.jpg", "title": "Jail Calls", "album": null, "lyrics": "[Intro]\n(Hello [?] prepaid call from)\nThe fuck this nigga want?\n(*Phone lady continues*)\n*Conversation*\nPfhh... Bitch ass nigga\n\n{Verse]\nPhone calls from a jail cell (jail cell)\nWhen I was locked up ain't nobody give me fan mail (fan mail)\nThe feds watching get a new trap and new clientele (clientele)\nIt was some folks it was some joes they tell me all is well (wo-woord!)\nI'm eyeballing fuck a skit this shit not digital (no not digital)\nI-I-I shot a opp, what's his condition? That shit critical (condition)\nHey everything a nigga do this shit original (facts)\nThese niggas chicken like a 50 piece traditional (big facts)\nWaaa...Walk in this bitch and I smell like a pound but I only came in with a quarter (gas)\n25 racks don't look like a stack, I like all my hundreds in order (cash)\nI'm in Russia with a strap I took across the border (rahh!)\nI might call your ass, subtract, because your money shorter (facts)\nEeee...East side nigga we took out them Cs, we take your money and leave (crip, crip, crip)\nGggg...Glock with a dick and they all about to preach, cross your mans out like a priest (a priest)\nIiii...I've been strapped since I was wearing dickies at Caprie[?] (wow)\nMi-Might cop an old school Monte Carlo or Caprice (word, wo-wo-wor-woord!)\n\nYOLO\nI shot his mans and fucked on his sister I call that shit rasta[?] a low blow (blow)\nI hit the mall I don't gotta snap cause everybody taking photos (wow)\nBitch I'm from Memphis where we catch some bodies and we do not talk to the po pos (never)\nToo gangster in a new Maserati got me feeling like I'm Bobo (skrrt!)\nSs...Still busting 30 for juicy (facts)\nYou liking a nigga you stupid (stupid)\nI tow the 30s in movies (in the movies, in the movies)\nYeah, yeah\nPu-Pu-Pull in something so coopish[?] (skrrt!)\nYour bitch looking at me she groupie (wow)\nShe eat the D like some ruckress[?]\nYeah, yeah, yeah, yeah...\nBitch I'm in business I suit it (huuh?)\nA lot of niggas say that they the block but they never got recruited (no) (ooo...)\nI'm smoking gas this shit off the top, this shit right here is some pooty (booty)\nI see her ass when she gave me top now this shit right here is some booty (fool)\nA-ain't(?) no stopping her if her man's find out it is some kaka then he'll go stupid (stupid)\nHe just be watching her, like probation officer, but really he clueless (clueless)\nShe not an amateur I pull out the camera (word) and make us a movie (a movie)\nShe got some nice boobies\nHeee...He want some dope but you know the price move it (that's on my mama!)\n\nSo much lean in my motherfucking (cup!)\nWhat is your vertical? Nigga get (up!)\nNiggas getting upped on, nigga snucked on, strip him out his clothes have a nigga ass (fuck)\nGrade street cripping now you see these chucks, on person ain't no runner-ups (crip)\nDesigner down nigga Louis V. up, they make your bitch wanna fuck! (designer)\n\n[Outro]\nThey make your bitch wanna fuck\nTold that bitch \"Hey ho up!\nBut you stopping my motherfucking pimping baby and I ain't even living yet, I ain't even got that old you hear me?\"\nOld flows, y'all niggas fucking on your old hoes\nAnd I was getting scraps way before bows\nWell I was getting scraps Fin one four [?]\nFor real, yeah...\n\n*Phone conversation*"}], "artist": "BlocBoy JB"}