{"songs": [{"lyrics": "\"This is labor\" {*Echoes*}\n{*Sample cut and scratched*}\n\nWho put the monkey wrench in well-oiled perfectionist emblem\nJust to watch these monitors spit white noise through your office space\nAutomater, I infect jolly gene pool descendant clown-clusters\nBrushing dust mites off your starving art revolution sound jugglers\nDelinquent friend from brick habitat\nBob, weave, stick, move, fence\nAnd pause somewhere in the middle for slick invention\nThis years brain crops spread spectacular, I ain't mad at ya\nDon't stay mad at the caliber (I twist characters like Twist characters)\nTally up the alley cat aggression in this Doug E. Fresh infested\nMess of bass line lust and automatic b-boy Krylon can combust circuit\nWorking these war pig cyphers with Ted Striker stability\nAnd kamikaze chivalry\nI alone noble in a worm food feud\nWalking dead generation\nAin't nobody asking for your patience\nThe grand opening holding me to face the fact\nI knew myself and didn't have to ask nobody else\n(Talk about labor)\nFantastic planet urchin putting work in\nSearching for pertinent verse minus the murderous diversion\nApologies won't lure me to the communal sob story\nNor will I sacrifice live style to benefit jury temperament\nThis old Green Goblin web cutter butts up against\nCrayola daydream landscape spitting bedlam. Dead 'em\nCharge the villagers nickels and nicotine to watch him fed to\nOne disgruntled kraken at high noon\nWe'll sell popcorn beer and balloons\nI got an inkling this gon' be the one the children bicker over\nIt's that Warriors vs. Baseball Fury element\nTo glitch his motor sensory development\nI am a star, really\nThat Big Bang bastard's back with a one-way ticket to beat street\nThis all is like, relevant to human kind supply/demand ratios, man, learn it\nI work past the surface\nI work on what I love, I work to service all my burdens\nAnd I'll work until this here little flat line closes the curtains", "title": "Labor", "album": "Labor Days", "image": "https://images.genius.com/def77066ced04907598868615b66c70b.1000x1000x1.jpg", "year": "2001-09-18"}], "artist": "Aesop Rock"}