{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/101ec9acebacbc3b7d2c51ebd7abe4b6.960x960x1.jpg", "title": "Latin Kings - 1073293", "year": null, "album": null, "lyrics": "Can you handle it?\nLatin Kings, peep the flow we bring\nEvery show shake the scene, you know the routine\nTop notch players, dope rhyme sayers\nLatinos, tenemos que unirnos\nNever mind what you claim to know\nYour last name slow, becomes irrelevant\nHeaven sent, I'm militant, born Spanish and innocent\nLifestyle's assumed, the past consumes me\nWith stereotypes and tel-lie-vision that I see\nHow to be, an understandable role model for the youth\nWhen I'm speakin with my neck in this noose\nCut me loose amigo, tu hermano latino\nSoy chicano, vamos down the same camino\nControlando y vigilando dinero cause\nNobody moves more contraband than San Diego\nLa frontera, mera mera, we got the biggest border\nIn the world so we're seein all the feria\nDon't get caught with your pants down\nWe advance ground, and got a list of demands now\nIt's for the brown crowd, spanish queens\nFiltered Souls, and West Coast Latin Kings\nLatin Kings, peep the flow we bring\nEvery show shake the scene, you know the routine\nTop notch players, dope rhyme sayers\nLatinos, tenemos que unirnos\nLow profile lifestyle, I love my jefita bonita\nCookin frijoles con aguita\nSalsita, con tortillas hecho a mano\nDamn it feels good to be chicano!\nSoy travieso, latino fino to the hueso\nRespeto, to all my gente en el ghetto\nMejico, Suramerica Aztlan y Puerto Rico\nPobre grande y chico, sabor rico\nDon't you understand?\nWe were the first to hit the switch\nNow they're bouncin in Japan\nFumando puros de Cuba\nMenudo pa'la cruda\nPlantando tomates y lechuga\nSarapes y juaraches\nFeelin sucio salvaje en el zoot suit traje\nTomo vino con latinos unidos\nBailando al sonido, hay dios mio!\nLatin Kings, peep the flow we bring\nEvery show shake the scene, you know the routine\nTop notch players, dope rhyme sayers\nLatinos, tenemos que unirnos\nThe latin race, above la ley\nIt's Mr. Old School veterano from East L.A\nNino de nieve, straight up and down for the plebe\nHeinas sittin pretty in my ragtop Chevy\nJust ask Shysti, and homeboy will tell you\nWe stack big mail down here in San Diego\nSo I smash with Baby Beesh, thinkin bout cash\nSidewindin down the 5 to the 6-1-9\nPage the homey Mad One, he told me that he had one\nA whole kilo, meet him down in San Recida\nSo I quickly changed clothes, switched up my rental\nChecked out the mo mo I'm payin on my incidentals\nGot my mind made up, f*ck a feud and a hoodrat\nI got a stack for all the god damn scratch\nScrilla, feria\nSo watch out when I come into your ar-ea\nLatin Kings, peep the flow we bring\nEvery show shake the scene, you know the routine\nTop notch players, dope rhyme sayers\nLatinos, tenemos que unirnos"}]}