{"songs": [{"year": null, "album": "Chimes of Freedom: The Songs of Bob Dylan Honoring 50 Years of Amnesty International", "image": "https://images.genius.com/5467e90c6f628d46c2c95ec229f8f6b4.1000x1000x1.jpg", "title": "With God on Our Side", "lyrics": "[Verse 1]\nIt’s a movie and the whole world is viewing it\nAnd the popcorn is dreams torn, but we’re always chewing it\nThe set design’s by God but the costumes' by the devil\nAnd the screenplay is adapted from a book that’s embezzled\n\nThis is where I grew up\nThis is where I grew proud\nThis is where neighbors never say music is too loud\nThis is where the streets have no name, but they have history\nThis is loss's victory\n\nOh my name it ain’t nothing; my age it means less\nThe country I come from could be like the rest\nI was taught and brought up there, laws to abide\nAnd the land that I live in has God on its side\n\nI was young; I grew. I could tie my shoe\nI was blind, but I knew, that I would always see blue\nBlue seas I see through, on the bottom I’ll meet you\nAnd when we come up for a breath, would you mind if I kiss you?\n\nChildhood came up for the kiss, but its lips was painted with mist\nAnd the sunny skies came and I missed it\nVanished and windswept\nLanded and we slept in the arms of convenience, blanket obedience\n\nNow the Somali-American\nWar had its day\nAnd the Civil War too was soon laid away\nAnd the names of our warlords\nI was made to memorize\nWith guns in they hands, they say\nGod’s on their side\n\nI had an undying wish to keep from dying\nI had an untimely hitch keep me from climbing\nBut I climbed the hitch itself and I tried flying;\nI had an uprising in my soul\n\nThe left was fighting the right\nAnd the right was fighting the light\nAnd the light was blind in the night\nAnd the night woke up in tears\nWhen my fingers went to wipe them\nThey became a poem but to write them\nThey would have to speak tears in another language;\nThat would take years\n\nSo now as I’m leaving\nI’m weary as Hell\nThe confusion I’m feeling\nAin’t no tongue can tell\nThe words fill my head\nAnd fall to the floor:\nIf God’s on your side then\nWould you ever need war?"}], "artist": "K’naan"}