{"artist": "Ace Hood", "songs": [{"title": "Dat Foreign (Beast Mix)", "album": null, "year": "2014-08-29", "lyrics": "[Verse 1 - Ace Hood]\nI got a bitch from Barcelona and she foreign\nAnd if that head ain't good then she gon' get deported\nI count my blessings and that money every morning\nAnd all these hoes they want the dick like there's a warrant!\nOk, Germany, (???) Haiti, we fly out in Dubai where they pray do I lie?\nHot in the desert, the way you know leather, I know it's a blessing you meet with the God!\nYou know I'm the boy, I'm the realest to do it, whipping that foreign that'll shit on your Buick\nI'm lying on money, but still no accusing you, rapping so dizzy I'll park you with music?\nHa! Love it that a nigga getting cash, that’ll make a nigga go bad! VROOM VROOM\nCreeping on a low creep past, never get it that’s too fast!  ADIOS!\nWorking out deals like Cardio, smoke a little a little weed , gee where the fuck Mario?\nYou know a real nigga when you see one, you ain’t gotta broadcast shit like the radio\nYou know who I am, you know what I’m about, you see where I’m at\nI’m straight at ya neck, don’t pose in no pictures I pose as a threat\nI’m bout it whatever, they not in my level, you bow to the best!\nI pray that I make it, amazing, and please don’t compare me to less!\nI’m satan, I’m blazing, I’m through with the patience\nI’m like a grenade that was locked in your basement\nI’m too underrated, I’m too high and faded , my flow is outrageous , they want me sedated\nFamily  is good then I’m happy you laid me, chasing that cake is like (Happy for you lady??)\nSorry to tree, but this beat it was banging, think I won’t body you, you sadly mistaken\nI’m GONE! And I got your bitch off in my foreign, and she said ya sex was fucking boring!\nI fucked her once while I was touring! Believe that!\n\n(Chorus)\nShe only been here for two weeks, and where the girls at that trying to leave with me\nShe working hard, like she trying to get a visa, the way she twerk it, (I might just pull out my visa)\nAfter we leave girl, you know where you going (you know where you going!)\nStraight to the telly (you ain't leaving till the morning)\nSaying I’ll bang ya (you know that shit boring!)\nAMERICAN, you know I had to copp that foreign! (Copp that foreign)\nAMERICAN, you know I had to copp that foreign! (She got on that bikini when we in the lamborghini)\nAMERICAN, you know I had to copp that foreign! (She from another country, I brought her in the city with me, yeah! know it's never boring!)\nAMERICAN, you know I had to copp that foreign! (Copp that foreign!)\n\n(Bridge)\nAnd she be like “ Ay que rico!”  when I’m going real deep though\nYou can give me all them besos, just stay low and do what I say so!\n(Fuck me now) Oh shit, excuse my French but I got a bad bitch and\nShe ain’t from france, but she French kiss dick\nShe ain’t got no plans, but to get dismissed\n\n(Chorus)\nShe only been here for two weeks, It’s a different party every night she like to drink\nBody language is like she trying to speak!  That's ok, that's all right,  go all day, go all night, I’m a BEAST!\nAfter we leave girl, you know where you going (you know where you going!)\nStraight to the telly (you ain't leaving till the morning)\nSaying I’ll bang ya (you know that shit boring!)\nAMERICAN, you know I had to copp that foreign! (Copp that foreign)\nAMERICAN, you know I had to copp that foreign! (She got on that bikini when we in the lamborghini)\nAMERICAN, you know I had to copp that foreign! (She from another country, I brought her in the city with me, yeah! know it's never boring!)\nAMERICAN, you know I had to copp that foreign! (Copp that foreign!)", "image": "https://images.rapgenius.com/2eb79148cd7fffb4fe1bf2ec70674889.640x640x1.jpg"}]}