{"songs": [{"lyrics": "(Somebody's pulling me close to the ground. I can sense, but I can't see. I ain't panicked, I been here before. Don't take me to no hospital please, fuckin' emergency rooms don't save nobody. Some bitches always pop you at midnight when all they got is a Chinese intern with a dull spoon. Look at these suckers, scramblin' around, what for? My ass ain't supposed to have made it this far)\n\n(Da$H)\nSnatch your soul up out your body like the Highlander\nBed sheets made from the finest panther\nInhale the cancer\nTell her answer\nErotic dancer suck the camp up\nReferred to as a stand up\nTan tux\nBrown tie\nSuede shoes like my name was Ace\nHigh in the lobby of the Tangiers\nWhen they look they see the man here\nSee the plane don't have no landing gears\nI park it at the dock then jump aboard the yacht\nPour the Moe' and roll the finest California crop\nIn celebration of my soarin' stock\nWe made it\nPissin' greatness\nBuild a moat around the estate\nBuy a hatin' bitch a face-lift\nTake your daughter off on a date, shit\nIt's me and Harry Belafonte out in Pompeii\nWatch 'em carve my statue while I eat the flambe\nSmokin' the bomb haze\nShort head after a long day\n\n(I'm reloaded! Okay!)\n\n($ha Hef)\nCheck my aura, I'll even score off the bench\nRalph Lauren black label trench\nStranded at the border with your daughter\nFound the soil with the (?)\nSearch the pussy found a quarter of the hemp\nBut fuck it though\nMy bucket low and I'm still Polo to my underclothes\nJames Harden, how I'm quick to let that thunder go\nSee through these nights I've fucked their wives of all my adversaries\nSome I cart and some I had to bury\nDig the holes, see some I had to carry\nBought the judge a car and tip the jury\nSwear that codeine keep my vision blurry\nGun powder my cologne\nWilin' in that coupe Deville\nRugar's peel\nGet that money tooth and nail\nShoot to kill\nMy resemblance is striking\nSail across the seas like a viking\nMob is right beside my like a hyphen\nMasterati with the pipin'\nWhip it with no licesnse\nWife her for the night and knock the pussy out like Tyson\n\n(Come on in here motherfuckers! Come on I'm waiting for ya!)\n\n(Man-Z)\nLet me get my shit off, it's so much so say\nSo much rain and I thought you niggas knew my ways\nNow them days I done spent to increase my pay\nMama said it's more money when you switch them things\nSo I switch my plates and eat different see different\nCan't judge a book but I always read different\nWent a new route so I might seem different\nBut I'm still man-z, I just blow trees different\nDutch after dutch, some say I steam different\nCause my mind think (?), so I might lean different\nLove my (?), but she on that shit\nDon't wanna speak so soon, but she on that shit\nAnd my fam gon' deny it, but I'm on that strip\nIn the summer with a (?) like it's fuckin' (?)\nThat shit, I ain't feelin' it\nPlus a nigga (?) it\nSo I put the (?) with no fingertips, I'm sealin' it\nCuzzo stay strong cause your babymom's killin' shit\nDid my nigga dirty, when he wonder (?) feelin' it\nThis shit realer than you think\nSo that Henny or that Remy be that remedy to drink\nBugged out\nNiggas soft with they chest out\nWorried 'bout my team, give a fuck what the rest 'bout\nThey been my fam since the trap house\nSo if they need me know I'm shootin' like Stackhouse\n(?) with the mac out\nThat's just the life of a young man\nGettin' older and growin' while I'm working on God's plans\nReal humble like\nIn the jungle with a (?) trained to rumble like\nAnd it's nothin' nice\nYo that's all I got\n\n(I mean look at me. You got everything man. Come on. Fucking diapers man! I got fucking diapers! I shit my pants everyday! I can't walk, I can't hump. You know? Go on and kill me you cocksucker!)", "album": null, "year": "2013-04-06", "title": "Pachanga’s Revenge", "image": "https://images.genius.com/c69f2d80c917398a44b51ada55dd654a.640x420x1.jpg"}], "artist": "Da$H"}