{"artist": "Kirk Knight", "songs": [{"image": "https://images.genius.com/19874de89b1e4ec7ebe21ff2b6c19330.560x560x1.jpg", "title": "Dreams", "year": null, "album": null, "lyrics": "[Produced by Block]\n\nDidn't you hear me dog?\nDo you hear me?\nComing from Brooklyn\nYo\n\nI ain't gonna front thought I was scoring\nSince I escorted damn\nSo keep the lean pouring\nI just wanna feel the room and I'm a put my clothes on\nBefore I hear another excuse like \"I ain't really ready\nAnd I don't want to rush\"\nSo I was like \"I don't give fuck I'm off it\"\nShe tried to pull me back back down\nCause if you play with bananas\nI gotta bring the mac out\nAnd that's the end of the clip\nHopped out and dip\nWalking home I'm just trying to figure out why I'm so alone\nCause just about everybody I come in contact like\n\"Why you always chattin?\" or \"Why you not maccin?\"\nOr everything I do is wrong or in the wrong approach\nSo let me roll the roach\nSwisher twister now I'm somewhere in the stars\nHey hey just thinking\nWhy my head can't be straight like the lines on my keyboard?\nWhy everybody on me for?\nAnd I guess I treat my girlfriend like that cause I'm coldhearted\nBut how can I if I never had a heart to start with?\nI'm over exaggerating I'm just sayin'\nHow can I play ball and I ain't never played it?\nAnd that's a fact\nLike a dime domination\nI'm just saying everybody moving up\nAnd I'm at square one cause people hold me back\nLike a strap on a bag like a snap on a hat like a trap to a rat\nMan I wish this was a dream\nIn reality nobody mad it me\nAnd my music touches everybody soul\nLike Kirk you that new nigga that everybody bump\nBut for now just bump\nKnock your head understand\nLike this shit is abusive you know I'm the man ah ah ah yo\nI just want people to feel me tonight\nSo a little bit of loco make you feel alright\nSo I'm a just dream all night hey hey all night\nI just wanna chill and drink with my niggas\nSlip to an odyssey take a trip nigga\nI'm a just dream all night\nHey hey all night\nHey hey all night\nHey hey all night\nHey hey all night"}]}