{"songs": [{"year": null, "album": "Y.H.N.I.C. (Hub City Threat: Minor of the Year)", "image": "https://images.genius.com/1d86c80235f3ffef2492fec6dac85b33.500x500x1.jpg", "title": "Biggie", "lyrics": "[Intro]\nUh, I see everybody wanna play gansta now, huh\nWell you know what niggas\nI'mma just play Kendrick\nYou gotta respect it\nFeel this\nUh, lemme shit on these niggas man\n\n[Verse 1]\nLook homie I'm not your crip or your blood\nHomie I'm just Kendrick\nSee me other than him might plead the fifth amendment\nHard headed nigga shit all it take is an instant\nShocked to have scored just as soft as an infant\nSay you bust your gun, but never totin' it\nYou say your man is dope I think he's smoking it homie\nWhy you provoking it don't mean to boast a bit\nBut you can call me a fly cause your boy be on some shit\nPussy fly so all the girlies think I'm the shit\nI've got it to spend but still never buy them shit\nYou better guard your bitch\n‘Cause all it takes is a finger to turn her on holmes\nSomething like a lightswitch\nHands down but still dark think I might switch the Jag for the Porsche\n‘Cause it got a better steering grip\nYoung but been a man and you won't understand\nSpree wheels looking like a bed room ceiling fan\n\n[Hook]\nWhen the beef start cooking\nAnd the shots start coming\nDon't hesitate to pop that thing\nPeople start looking\nAnd people start running\nDon't hesitate to pop that thing\nRolling down Rosecrans\nI fear no man\nI be God damned\nIf I live on my knees I rather die on my feet\nThat hub city threat shit is me\n\n[Verse 2]\n(Nigga) I'm from the land where fiends fly like Peter Pan\nAnd the average man got a heat up in his dickie pants\nI got some plans, to stack riches\nOwn 76′s like a Philadelphian\nYou don't know but now I'm focused like camera lens\nAnd if I know your mans I might give a second chance\n‘Cause I don't wanna hurt you\nHave ‘em running in herzels\nShells stick to his back like a ninja turtle\nCrack sells, drug sell all in the virtue\nBeen an artist since Prince played in Color Purple\nWeed smoke hydro blow on that purple\n2 straps on my side like suspenders on Urkel\nI suspend they murk you, what you lying for?\nYou know you ain't eating like feed the children commercials\nMan my children circle around your block\nLet out shots and be home 30 minutes before they curfew\n\n[Hook]\nWhen the beef start cooking\nAnd the shots start coming\nDon't hesitate to pop that thing\nPeople start looking\nAnd people start running\nDon't hesitate to pop that thing\nRolling down Rosecrans\nI fear no man\nI be God damned\nIf I live on my knees I rather die on my feet\nThat hub city threat shit is me\n\n[Outro]\nIt's real\nKendrick\nSee me in the streets man\nCome to me as a man, man\nIt's real nigga\nKendrick\nYou gotta respect it\nNiggas respect me man (K. Dot)\nStop being some yank nigga\nIt's real\nLotta niggas tryna play gangsta, huh\nIt's 2004 man\nYou up in this shit quit it\nBe yourself man\nStill affiliated\nNiggas respect me, bitch"}], "artist": "Kendrick Lamar"}