{"songs": [{"year": null, "image": "https://s3.amazonaws.com/rapgenius/1353182321_big-shug.jpg", "title": "The Militia", "album": null, "lyrics": "\"A special guest\" \"It's the militia... It's the militia\"\n\nThis is a conquest, so I suggest you take a rest\nOr keep a breath, but definitely keep a vest on that chest\nRymes I'm packin, just like a thug at a car-jackin'\nShoot off your hat when I start cappin, this is no actin\nG-A-N-G, S-T-A double R\nAnd you don't want no trouble up in here, baby pa\nFrom the late-night drama, of the New York streets\nTo the hoods of LA, real niggas likin Primo's beats\nPut suckers on glass, send em, back to class\nAnd kick hot shit, so we can stack the Johnny Cash\nI brought the God, Rakim, lyrically gunning you wanna dash?\nI got Dub C, from South C, what you doubt me?\nTravellin through warzones with my infrared microphone\nIn the year One Mill, destroying, enemies chromozones\nWords burn through flesh, leavin nothing but skeletal\nYou best pay resepect to the legends, boy I'm tellin you, Militia\n\nThe illest--Realest--Representin\nBringin the rukkus--Let it be known\nThe illest--Realest--Word up\nIt's The Militia\nThe illest--Realest--Representin\nBringin the rukkus--Let it be known\nThe illest--Realest--Word up\nIt's The Militia\n\nMakin a move, makin a move, who's that nigga thats makin a move?\nIt's the Shadiest rhymin'-back, actin' a motherfucking fool\nFour-four packers, my jackets ?hittin the tag? saggin, baggin\nFoot on my rag, mess up a bag, leavin my enemies in bodybags\nYou niggas was crackin, what y'all thought it wasn't gon' happen?\nDub C and my East Coast sisters gettin together rappin\nGun-clappin, chump smackin, kiss the ring of your highness\nLook while I'm in New York City\nWalkin with two of the Brooklyn's finest\nMy two affiliates from the East we all bang\nBut if y'all don't mind, this is still Westside Connec' Gang\nDress-code the same, just new pieces on my neck\nEast Coast brownies, house shoes, and hair nets\nY'all can't see this, so peep the sister G is pushin a Six\nAs I freak this, caviar GangStarr Militia remix\nIt's Dub C the jankiest loc', I'm runnin this here\nWith the Guru and New York's hardest, DJ Premier, Militia\n\nThe illest--Realest--Representin\nBringin the rukkus--Let it be known\nThe illest--Realest--Word up\nIt's The Militia\nThe illest--Realest--Representin\nBringin the rukkus--Let it be known\nThe illest--Realest--Word up\nIt's The Militia\n\nYo, it's The Master, mister, Musical Massacre\nPassion for disaster, paragraph ambassador\nR get the red carpet, just call me on\nCorner the market like the mic's last name was Corleone\nThe facade killer, come through your city like Godzilla\nThink of the sickest thing you ever seen, Ra's iller\nMy vision's vicious, suspect suspicious\nPlans is ambitious, my motive's malicious\nNo interferin, if you ain't down, you got to swearin\nAnd these cats they ain't carin, habitat awarin\nCrack appearin, from out the track that I'm hearin\nIt's either that, or I'm going back to racketeering\nYo, you should see me, I got a crew like Mussolini\nBut Kool as Moe Dee, my flow be, smooth and easy\nFor turnin ?area centers? to wilers, you get the picture?\nRakim is, the minist', with malice, Militia\n\nGangStarr, The R, Dub C, baby pa. Straight up, check it out"}], "artist": "Big Shug"}