{"artist": "Petey Pablo", "songs": [{"album": "Life On Death Row", "title": "That’s My Boy", "image": "https://s3.amazonaws.com/rapgenius/1372159499_Petey.pablo.jpg", "lyrics": "[Hook- Petey Pablo]\nI like em' slutty, I fuck em' bloody\nI fuck in the ass, I love gettin money (That's my boy)\nI'm just a dirty dirty, I'm in my early thirties\nAnd gonna be like this till I die (Give me some more Patron)\n\n[Verse 1- Petey Pablo]\nYou can't be serious, can you? Damn you\nOoh you fucking idiot, fuck you\nWhy do yo keep doing the things that you keep doing\nWell first of all I'm a nasty motherfucker\nAnd I don't give a fuck about none of y'all\nAnd all y'all can suck my balls (Your balls)\nYeah my balls\nThe thing that hang down on the bottom of the ding dong\nEverybody got balls\nMine a little bigger than yours, that's why it look a little strange\n(how dare you invite me to your scrotum)\nFuck you motherfucker ???\nMotherfucker where your daughter at (bitch come on)\n\n[Hook]\n\n[Verse 2- Petey Pablo]\nI ain't never fucked in the back seat of a car before, oh this is nice\nWhat nice not bitch you got to be out your motherfucking mind\nAin't fucking in the back of my Cadillac, and they just reupholstered mine\nI could feed fifty motherfuckers with these seat covers (how)\nBitch this is swine (ooh)\nGet your ass on the outside and put your hands on the motherfucking bumper ma\nWait! before you do that, come here, bend down, open your mouth\nWoo, unh that's right\nShow me that you bout it bout it (you like)\nMight keep you around a little while\n\n[Hook]\n\n[Verse 3-Petey Pablo\nI like little titties, big titties, salty tasting titties\nTitties just came out the club, sweatin, them type a titties\nLoose pussy, wet and juicy, pussy not too tight\nPussy too tight, Pussy be burning skin off my wood\nToo much friction\nToo much hair on your kitty, bitch\nHere take this Bic, take a razor to that shit (It's too thick)\nShit, that shit just knotted bitch\nUse these clippers\nAnd clean up all that evidence and let's get down to business\n\n[Hook]\n\n[Talking]\nI know you didn't just pour my shit in no glass!", "year": null}]}