{"songs": [{"album": "Sickology 101", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg", "year": "2009-04-28", "title": "Creepin’", "lyrics": "[Intro: Kutt Calhoun]\nAreola, that shirt came off, that bra came off and so crazy\nWhat a day, what a motherfuckin' day, I tell you\nBaby, I'm home! Hey, baby!\nWhat's that smell? Smell like, like my baby's pussy\nWhat the fuck?! (Oh, shit! Sorry! Shit!)\n\n[Hook: Krizz Kaliko] (2X)\nWhat do you do when you're workin'\nCome home, and I'm creepin' out the back door\nPants on the floor and you're lookin'\nAt her sayin' \"What you doin' that for?\"\n\n[Verse 1: Tech N9ne]\nThis is how it goes when you're hard at work (Hard at work)\nI'm with your lady and I'm all up in her skirt (All up in her skirt)\nShe chose a rapper, cause this rapper know how to tap her\nStrap her down and attack her while you sneak in\nWatch pornos and jerk (Watch pornos and jerk)\nAnd you can't be mad at me, cause your thick bitch wanna ravage me\nGot my big dick in her cavities then it's spit, spit I'm in anatomy\nAnd you can't come badgin' me, cause she sick wanna insert half of me\nStraight addicted to the master, he whips the sticks up without batteries\nPoetry in motion, I make her water, cause I'm a scholar\nI father her twat and bother her I got her\nShe'll eat anything I want her to eat\nShe'll swallow anything I want her to swallow\nShe'll go down and chew on my dog\nDoin' anything that'll make me holler\nAnd you the victim don't even know, what's you comin' home to\nI'm bangin' it out and she's screamin' like we doin' kung fu\nI'm feelin' right, cause you the one she do the wrong to\nNow that you know your lady is creepin' - what you gon' do?\n\n[Hook]\n\n[Verse 2: BG Bullet Wound]\nBut it ain't no need though, cause I'm a G though\nI find 'em, then fuck 'em, feed 'em and I let him repo\nI understand you're punchin' that clock\nBut while you're punchin' man, I'm punchin' that twat\nGonna get that overtime, BG Bullet does step over the line\nGotta key to the crib, this pussy's suppose to be the line\nThis bitch too old to be lying, she done\nTold her husband things suppose to be fine\nYou the bigger man, and I'm her clover leaf now\nWhat about the clothes that he found\nDid you tell him you love him, did you tell him you with it\nDid you tell him you this love his dick\nEverytime that you get it - I don't think so\nSo I'mma keep things low, keep pullin'\nThese strings close that pop that El Nino (Yes!)\nCause I'm the best at it, your lady's sex addict\nAll in the spot when you're not, getting my head patted\nBut I'mma keep this thing respectable, homie\nI'm using condoms in your festival, homie, no need to kill a nigga!\n\n[Hook]\n\n[Verse 3: Paul Mussan]\nWhat would you do if your boo crept on you\nWith me, new tattoo with the letter \"P\"\nAll over her humps like the letter \"B\"\nTrip if you want to, scared nigga\nNever me: your girl has been land-marked\nThat means that I marked her - that means\nThat I skeeted sperm all over her twat fur\nThat means that I got her, where you never had her\nSex game critical, now she is a master\nYou never got your dick licked, mine is getting tongue-kissed\nShe could suck a orange through a straw - call her Sunkist\nMan, she a cold chick, yeah I know you miss that\nBank account access, yeah, you know I did that\nPut it where her ribs at, then I let her slip on it\nIf ya like it then ya should-a put a ring on it\nCause Paul Mussan had that pussy with a sling on it\nAnd I ain't even poppin' E homie, but the question is\n\n[Hook]"}], "artist": "Tech N9ne"}