{"songs": [{"year": null, "image": "https://s3.amazonaws.com/rapgenius/RapperBigPooh-02-big.jpg", "title": "Girls Like", "album": null, "lyrics": "RAPPER! I'm back, bitches!\nMy nigga Big Dho up in here with his Le Coq Sportif track suit on..\n(I know what girls like..)\nMy nigga G in here, wit his Members Only jacket two sizes too small..\n(Girls like..)\nAnd my nigga Khrysis in here wit his, Sergio Valente jean suit..\n(I know what girls like...)\nOH!!! (Girls like me!)\n\n[Rapper Big Pooh]\nHopped out the car in my brand new Dunks\nSpeakers in the back, got 12s' in the trunk\nO ride shotty, Joc in the back drunk\nG just lookin for some chicks to hump\nPo go crazy when they play his jam\nDookie gold rope, I am the man\nGirls gon' flock 'cause the way I stand\nCenter of attention, that is the plan\n\n[Chorus: imitating \"I Know What Boys Like\" by The Waitresses]\nI know what girls like, they say they want me\nI know what girls like, they say they horny\nI know what girls like...girls like..\nI know what girls like...girls like me!\n\n[Rapper Big Pooh]\nHead to the bar got cash to blow\nDrinks on me - let it flow\nI think we all know how the story go\nThirsty-ass broads, gotta tell them no\nThe club is packed, so I walk slow\nBefore I know, I am the show\nV.I.P., bottles of Mo'\nWe had a good time, now we gots to go\n\n[Chorus]\n\n[Rapper Big Pooh]\nIt's 3 A.M., so it's time to eat\nWaffle House, lookin real sweet\nI ordered cheese eggs, grilled chicken plate\n'cause it's too late to be eatin on steak\nMy orange juice chilled, so am I\nThis girl walked in, kinda caught my eye\nSo I said hi, she waved back\nTurned around and that ass was fat\n\n[Chorus]\n\n[Rapper Big Pooh]\nI paid my bill then I went to speak\nI asked the young lady, \"Could I have a seat?\"\n\"What's your name?\" She said Unique\nBut all of her friends, call her Tweet\nI said, \"Well Tweet, my name is Pooh\nAnd I would love to have a rendezvous\nJust tell me what I need to do\"\nShe said, \"I'm down - but not with you\"\n..\n{*quiet chuckle*}"}], "artist": "Rapper Big Pooh"}