{"artist": "Boondox", "songs": [{"album": "Abaddon", "title": "Bloody Regrets", "year": "2014-05-13", "lyrics": "[Intro]\nAs a young man I found out that if you hurt somebody\nThey’ll leave you alone, good guys do finish last\n\nAm I crazy? Am I insane?\n\n[Verse 1: Big Hoodoo]\nHoodoo is my religion I believe in superstition\nCome against me and I turn instantly to mortician\nYou need some more convincing? Killer like the son of sam\nGruesome with my old depiction twist you like I'm outer realm\nHomicidle idle survival of the wickedest\nGot my rival suicidal from how I kick this shit\nWatch me flick the bic I'm about to light the gas\nThen I'mma cut your hand off and use that bitch to wipe my ass\nI'm vicious, my heart has no malice\nEnter militias and my trigger finger is so careless\nFrom killin' bastards now all I do is swing the hatchet\nAll hail to prime minister definition of sinister\nDetrimental to industry, breaking bad with my chemistry\nTrying go out and infamy, fuck with me, feel my energy\nWicked poetic symphony this is how killers meant to be\nBoondox and Big Hoodoo no remorse and no symphaty\n\n[Hook: Boondox]\nNo sympathy, no remorse, cold blooded\nSick with it, this how we do\nNo soul, my hearts cold (everybody knows we)\nSick with it, this how we do\nAm I crazy? Sick with it, this how we do\nAm I insane? Sick with it, this how we do\n\n[Verse 2: Boondox]\nThe pain is constant and sharp\nAnd this confession? It means nothing\n\nThe ring around sinking, coming clean like it used to\nPermament reminder that I got couple screws loose\nSame with the bathub, same stained hands\nDrops on the counter top of insane man\nThoughts of the flashback, remembering the first time\nThat I realized I was evil of the worst kind\nCovered toe to head in somebody else's life\nAnd laughing when I lost it, lickin plasma from a knife\nStaring at the wind, chippin' down from a slow drip\nLips on the water fountain, startin' with a slow sip\nAnd end it with the crazy mixed pleasure with your shame\nA little bit of pain from the liquid that I drain\nWhy did I do it? Was it worth the affliction\nAnd why did I let to it to become my addiction\nThe body in my conscious bearing out in the mud\nA blood thristy killer with a real thrist for blood\n\n[Hook]\n\nThere is no me, only an entity\nSomething illusory\n\n[Hook x2]", "image": "https://images.genius.com/181444660a65d0000670a98f7f5af756.400x400x1.jpg"}]}