{"songs": [{"image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg", "lyrics": "[Intro:]\nJust so Pittsburgh, man\n\n[Hook:]\nSo how does it feel?\nCan you tell me how it feel?\nNow it's real\nSo can you tell me how you feel?\nCan you tell me how it feel?\nCan you tell me how it feel to come and hang around a motherfucker like me?\nHow it feel to come and hang around a motherfucker like me?\nHow's it feel? So can you tell me how's it feel?\nCan you tell me how it feel to come and hang around a motherfucker like me?\nHow it feel to come and hang around a motherfucker like me?\n\n[Verse:]\nBaby what you doing tonight\nWe can watch the world get ruined tonight\nLiving this life, got you flexing feeling cooler than ice, let it melt\nAs we follow all this stupid advice\nAnd I don't usually like to be this honest with you\nI must have lost a picture, gimme a box of swishers, room full of obnoxious bitches\nWhy you lying to me?\nDescribe your ladies, that Mercedes all kinds of roomy\nAnd when the time's is gloomy hit me up\nI can make you feel like the perfect girl you wish you was\nGiving you that feeling like when Chrismas come\nI just take all of my problems throw 'em in a blunt\nLight 'em up and watch em float away\nWatch em float, I can take you anywhere you wanna go\n\nCan you dream?\n\n[Hook:]\n\n[Bridge:]\nI'm back on these rap songs\nFeeling that's never gonna last long\nGot a shortcut baby I'll pass on it\nMight throw your ass on it\nPass the time, as for my alibi\nTrynna tell you I need that\nJust relax\n\n[Verse 2:]\nPut that money in my motherfucking hand\nDrinking in the pool, goddamn\nAin't part of the plan, like a car in a van\nI'm rolling, I'm feeling good, I'm golden my man\nSo let me do my dance\nCause motherfucker this my jam\nThis my motherfucking jam\nHow many times you got to let them opportunities pass you by?\nI used to be a pretty passive guy\nSince before I was a goddamn mastermind\n[?], I came up\nDidn't have the time to see these lame fucks\nYou can't rush that greatness\nThat mansion where my maid lives\nLike wow\n\n[Hook:]", "year": null, "album": null, "title": "4_Therapy"}], "artist": "Mac Miller"}