{"songs": [{"year": "2005-09-13", "image": "https://images.genius.com/8f42b22ec5549467826fbd0c750ab571.450x450x1.jpg", "title": "Tha 3 Shugs", "album": "Who’s Hard: Gang Starr Presents Big Shug", "lyrics": "[Intro]\nThe three Shugs\nMC, ghetto nigga, P-I-M-P, ya heard?\nWe 'bout to get it in ya\nYo Shug you there my nigga?\n\n[Big Shug]\nOne two, one two yeah\nIt's all good nigga, yeah, yeah {*scratched: \"one\"*}\n\nWhassup Duke, it's Big Shug again\nHere to make money, fuck makin friends\nPunches to the face, feel no ways\nCall on your team, my 9 sprays\nIn this game, I'm pretty accurate\nImmaculate, leave no mess\nIn through the back, out through the chest\nFuck you nigga, fuck family stress\nDon't front, and I'll let you live\nDon't lie, and I'll let you live\nBut your girl still swallow my kids\nThat's just the way it is, f'real\nWho wish to du-el, for jew-els\nStep up and get that ass kicked like a mu-el\nI been there and done that\nSo all you got left to do, is run that\n\n{*beat changes*} {*scratched: \"two\"*}\n\nI run up in the spot, cock, two Glocks\nI yell out, gimme the ki's, or the combo\nP.O. back know\nI squeeze off I let off, I plug him in the big toe\nNow he tellin me the combo slow\nI open up the safe, a whole lot of dough\nI put it in the bag, quick I got to go\nI hear sirens so I run mad low\nThrough the bushes to the getaway car\nI put the pedal to the metal, to get mad far\nI try to be discrete\nBut to the kids, I'm legendary in the streets\nShuggy Shug, I'ma put the guns down\nI got a plane ticket, so it's first class outta town\nMy hustle remains strong\nLive the life of money and women, and fly rap songs\n\n{*beat changes*} {*scratched: \"three\"*}\n\nWatch out, for Big Shug Daddy\nChicks sweat me, for the rims on my Caddy\nI've been pimpin chickens for years\nWith no fears, cause I got the fly wears\nLike diamonds rings and fur coats and things\nAll the riches, that the good pimpin brings\nI check trap, attack weak rap\nPlayer haters, stay mad at that\nI need a franchise chick\nOne who dreams of mansions, not five dollar dicks\nIf you ready to work, then I'm ready to talk\nHere's your chance, to start on the sidewalk\nLive the life, of a high-priced mobster\nFive pounds of shrimp, and ten pounds of lobster\nAnd a bottle of Mo', to go\nIf anybody ask, you Shug Daddy's hoe\nSo get in where you fit in\nI know you smitten, by this fly pimp shit I'm spittin\nSo get money; no bullshittin\nAnd when you come home we'll try five new positions\nWhattup?"}], "artist": "Big Shug"}