{"artist": "Warren G", "songs": [{"year": "2003-10-11", "lyrics": "(Intro, RBX)\nOnce again\nThe circle\nContinue to hit'chu with these massive hits\nYa know\nWe gon' do it somethin like this\nFor all them busters out there\nCheck this out\n\n(Hook x2, RBX)\nHey\nWe came here to ride\nFalling back to ready\nAnd set to collide\nNiggas you won't know my nephew died\nSuicide, it's a suicide\n\n(Verse 1, Warren G)\nI'm deadly as ever\nReady for whatever\nTryin'a keep my pockets heavy on the cheddar\nGot nothin to prove, just really expressin myself\nWhile y'all niggas in the studio stressin yaself\nYa got to do it, so why not do it big?\nDrop the music, and spit fluid to they wig\nUnder dig, I'mma split the game in half\nAnd leave 'em all mad, like Warren what'chu done did?\nHey, we came here to ride\nNever slippin, Beretta sittin on my side\nBlaze up, cause I'm tryin'a raise up, and flow\nI came up, from broke, to papered up\nDon't test me, I bust like a twelve-gauge sawed-off\nAnd hoes jump on stage and rip they drawers off\nAnd I see through, all that's see through\nMake up a weave in ya head this evening, but hey\n\n(Hook)\n\n(Verse 2, Warren G)\nSworn to the streets\nBorn in the beach\nArmed with the heat\nMourning my peeps\nMakin niggas respect mine\nI came to collect mine\nComin through with the Tech-9\nLettin my neck shine\nMight let a nigga slide with a pass\nBut next time, I might disconnect his neck from his spine\nRun up and catch him from behind and stretch him\nWe squeeze triggas like ketchup\nWet'cha whole stretch up\nScared of the truth\nYou fear it, don't wanna hear it\nTil' the Smithsons bust\nThen you listen up\nCause I'mma tell it like it is\nLike it was, or like it always will be\nGive a fuck if you feel me\n\n(Hook)\n\n(Verse 3, Warren G)\nWho am I?\nW-A, double R, E-N to the motherfuckin G\nSuicide, niggas hang they self\nMight as well bend over, and finger-bang they self\nSell they soul for the fame and wealth\nAnd end up broke and lonely\nNobody to blame but'cha self\nBut me, I keep it all business\nCause this is business, can I get a witness?\nSee I been chillin like a villain\nWith a million and my children\nPlottin on revealin what the game been concealin\nI got a little older and learned a bit\nApplied the effort, and earned a grip\nNow I notice it's a hater, in every circle\nAs I roll another Vega, heavy with purple\nTake a puff and inhale\nAnd hold it til' it gets stale\nIn my chest, exhale my stress\nMy nigga R-B-X\n\n(Hook)", "image": "https://images.genius.com/99c2d5ebcf0c1c92be29838cd4b3c6fe.500x500x1.jpg", "album": "True Crime: Streets of LA (The Soundtrack) ", "title": "What U Wanna Do"}]}