{"songs": [{"image": "https://images.genius.com/fa0dcff8a3ed177edc3f7ef2f9830aaf.1000x1000x1.jpg", "album": "Bullmatic", "title": "2 Times 5 Your Mind", "lyrics": "[Intro]\nYeah, it's Illmatic, yeah\n(It's Bullmatic, actually)\nIt's Illmatic, yeah\n(It's Bull- it's Bullmatic, I just couldn't find-)\nIt's Illmatic, huh\n(I just couldn't find a proper instrumental\nWithout him t-talking over the-)\n\n[Hook]\nOne time for your mind, one time\nYeah, whatever\nOne time for your mind, one time\nYo, whatever (It is Bullmatic, though)\nOne time for your mind, one time\nHey yo, Nas? Kick that fuckin' rhyme\n(Yoink! Queue-jumping)\n\n[Verse 1]\nI'm picking a quite good rap, on top of a quite good track\nBeing quite good at rap, I'm quite good at that\nPlug in your headphones and listen to the stereo\nI'm navigating neurons in your head through heavy flows\nA sonic hemorrhage, have you got a beverage?\nIt's thirsty work being such a bloody clever kid\nI like inventing mental raps, some things I never did\nLike pushing Richey Edwards head-first off the Severn Bridge\nMelanin deficient, the sun gives me much redder skin\nThan the stereotypically depicted Native American\nI burn so easily that I'm banned in the EEC\nFor health and safety reasons, being tanned's an unachievable dream\nPeople would scream and see my peely skin\nAnd being a bit obese, I wish that I was really thin\nBut the lifestyle I've picked doesn't allow for it\nToo much curry, whiskey, I can't even make my trousers fit\nI'm proud of it\n\n[Hook]\nOne time for your mind, one time\nYeah, whatever\nOne time for your mind, one time\nI sound clever\nHey yo, Nas? Fuck that, man, that shit was fat\nBut kick that for them gangsters man, fuck all that\n(Ah! Language.)\n\n[Verse 2]\nI'm a rowdy Brit, once I've had a drink or three\nWhen someone says the word 'prick', I think of me\nI don't like myself so I forget it with drink\nUntil I'm retching up my breakfast with my head in the sink\nI've fallen off the wagon, poppin' down the pub with Adam\nCalling Jack up, knocking back Jack until I'm fucking lagging\nI could be spending my time on reinventing my life\nBut have you tried Strawberry Kopparberg, it's ever so nice\nOpen up wide, it's medicine time\nExcept I've lost my wallet now and that's the end of the line\nCan't even get a kebab, can't even get in a cab\nLooks like I'm trekking it back at the end of the night, shite\nHeavy drinker, heavy thinker; bevvy sinker\nWake up with a headache laying in bed next to a sweaty minger\nWhy do I do it to myself, I could be saving cash\nRather than wasting it behaving like a blatant ass\nIt takes me back to Monday Club with Jack at Hog's Head\nInhaling flaming gas chambers, knock'em back and drop dead\nNowadays I keep my ass clean and keep to caffeine\nTwaty Dan with glass in hand, that man's a has-been\nI blow raspberries in his general direction\nHe could've been spending time investing in his next profession\nSo there's a lesson: time is valuable and finite\nWork hard and play hard but get the dividing line right\nIf I had tried to write till all my rhymes were tight\nI wouldn't just rely on tired similes to blow me up like dynamite\n\n[Hook]\nOne time for your mind, one time\nI sound clever\nOne time for your mind, one time\nYeah, whatever\nOne time for your mind, one time\nYo, from ninety-two to ninety-nine\n\n[Outro]\nFrom ninety-two to ninety-nine\nI know what you mean, Nas\nThe golden years!\nWhen David Collier was Chairman of Luton Town", "year": "2015-03-26"}], "artist": "Dan Bull"}