{"artist": "R.A. The Rugged Man", "songs": [{"album": "Night of the Bloody Apes ", "year": "1994-11-05", "lyrics": "[Verse 1: R.A. The Rugged Man]\nNow let me tell you a little something\nI met this little honey dip, honey dip, she likes to shake her butt\n(But she's a problem child) She ain't nuttin' but a youngster\nHer boyfriend tried to step now his bodies in the dumpster\nNow I'm in love 'cuz she crazy, she's messed up\nI dressed up, she didn't give a fuck how I was dressed up\nCowbunga, feeling stronger\nShe couldn't get no younger, but one night she had the hunger so I swung her\nI treat her good, I remember the time\nI freaked her in the bed but that's considered a crime\nShe couldn't understand it was regular\nUnderage pussy, I've offended ya, I rip shit when I bending her\nShe's slippin' psycho, bitch is psychopathic\nThink a schitzophrentic, now it's to get roman-tic\nNursery schoolin' it, feelin' like a fool and shit\nI bust my nut, why did I have to stick my tool in it?\n\n[Verse 2: R.A. The Rugged Man]\n(What's with that young bitch?) People never mind their business\nWhat is this? How could I hit this, I'm on their shitlist\nBut I swing the trusty bat, mind ya biz punk\nShe flied up she's fly and her pussy's all of that (word)\nThey call her statu-tory\nBut I don't care 'cuz 21-year-old women bored me\nPlus the fact with age she's homicidal\nTried to take her title, well, she's sick, Jeffery Dahmer is her idol\nI don't what to do, no, I don't know what to do\n'Cuz I'm so into YOU!\nI take shits in front of her, (?) don't you think that's really disgusting\nThat's the reason she's my love stem\nWho give a fuck about her age\nIf you said that you cared about her age\nI'll hit you with the 12 gauge\nBaby, I'm not don't with causin' strife\n(She down with OP.P.?) If she is I'll take her fuckin' life\nI got the Buttafuoco complex\nWhen I have sex with her, er, um, on my nerve\nShe's mad young, I call her Statchy for short\nMeaning statutory, true\nWhy did I have to stick my tool in it?\n\n[Verse 3: R.A. The Rugged Man]\nUp to now, everything was going wonderful\nBeautiful to certain indivu's it's not suitable (grrr)\nThey call me babysitter just because I hit her\nBut oh, no, not an underage, it's kinda sky page\nUrine, I know she went the virgin when I took her\n(Did you stick her?) I stuck her now she act like Frankenhooker\nShe feens for every nut on the flag, I'm not lovin' for it\nReady crotch, ready puss and find a place to store it\nYou bust-head bitch, I don't care how rough you is\nI'm friggin' Rugged, I'll stick my body parts in ya fridge in fact girl\nI don't know who you're messing with\nWhy do you have to play me\nUsed to love it now I'm gonna end it\n(Get off, get over here, get off!) I punched her in the face\nNow's she's placed her mace I put her body in the suitcase\nToo bad, you never got to see ya sixteenth birthday\nYou hurt me, you hurt me, but now you'll never jerk me\nI really miss her, yes, I do, I loved her, I shoulda listened up\nI should have never stuck my tool in it\n\n[Outro]\n(Why did I have to stick my tool in it.. Statchy)", "title": "Statchy", "image": "https://images.genius.com/0459459cdc2f6a1ba50292d192b060db.500x500x1.jpg"}]}