{"songs": [{"title": "Response to Accusations on “Neurotic Society”", "album": null, "year": null, "image": "https://images.genius.com/4fff53f85a4f6704ecb471ac0c617cfe.446x446x1.jpg", "lyrics": "Neurotic Society is a song about people not being, or not being able to be, who and what they truly are, due to the current social construct. I am not targeting any particular group of people, but rather targeting everyone in our society who hides behind neurotic behavior, rather than deal with it.\n\nThe world we live in now is, in many ways, an abhorrent distortion, an accumulation of generations and generations of response to negative stimuli. Many don’t even have a concept of what normal is, by virtue of having lived afraid, ashamed, as victims of abuse, or inadequately handled for so long. I believe in coming up from under that fear and allowing the psyche/soul to truly heal. I understand that healing is a process, but I also believe that it is our responsibility to seriously care for ourselves, so that we can extend that level of concern for others and positively affect our environment.\n\nI want what is best for Humanity. Humanity, aligned with the Spiritual principles, that help each individual conquer fear, and transcend limited circumstance. I believe in healing and dealing with the traumatizing events of our lives, both in this lifetime, as well as those passed down to us, or inherited, so we can live as fully as possible.\n\nThe whole world suffers from a lack of honest dialogue. Character and integrity have suffered at the hands of political correctness and corporate agenda, while our society moves further and further towards unhealthiness and breakdown. I oppose these trends.\n\nEveryone has a right to their own beliefs. Although I do not necessarily agree with what everyone says or does, I do believe in everyone’s right to protest.\nThe overarching message of my music is to get up and stop compromising! And hopefully it will stimulate and motivate the changes that our society needs.\n\nArtists are constantly under media and public scrutiny. This is not a one-way street. Those of us with the charge of putting out faithful vibrations, have a responsibility to report what we see, and to write about what we know. I have seen some of the best and also some of the worst representations of human behavior. The same way that I exalt that which is high, is the same way I expose that which is abusive, in order to motivate and remind if not all of us, than as many as possible, of the Higher Calling."}], "artist": "Lauryn Hill"}