{"songs": [{"image": "https://images.genius.com/9703948ee40b2385b6c79a5f9eeffec3.700x700x1.jpg", "year": null, "lyrics": "Yes, yes, yes\nUh, yes, yes\nYeah, yo, c'mon\n\n[Hook]\nPeople of the world we got to have - balance\nYou guaranteed to fall off if you lack - balance\nIt's one essential thing that we got to have\nBaby you get to get, you know that we all need - balance\nCan't be on point if you don't have - balance\nYou'll get caught off guard if your game lack - balance\nIt's one essential thing that we got to have\nBaby you got to get, you know that We all need - balance\n\n[Verse 1]\nTake a look around, what you see? Turmoil (uh)\nAt some point recently, the whole world spoiled\nIt seems like we all fallin (uh)\nBut I'm here to help restore the balance, cause I'm answerin my callin\nAnd I don't think I'm better than you (nah)\nBut let me put you on to these jewels and you can put me on too\nI never had no problems with a lesson (uh)\nI got mad problems with the world though, even my profession\nThere's no balance in rap, you either nerd or a thug\nYou either got too many big words or bust too many slugs (slugs)\nYou could study for years and be the world's top scholar (Gang Starr)\nBut tryin to make the fans feel dumb, won't make 'em holla (uh)\nAnd this shit is hard to earn, so these thugs need to learn\nThat they only fuckin it up for the kids when it's they turn (yea!)\nLet 'em know they roots and cultivate they talent\nSo when they reach the crossroads, they can have balance\nAnd that's why the game needs Ak\nTroops are at need to bring the realness back (uh)\nEverywhere you look now, shit is fucked up (true)\nKids goin to school, they blowin the bus up (uh)\nWorld War III is on the brink of reality\nWe kill the innocent and call 'em incidental casualties (true indeed)\nHow do we get some balance back in the mix? (huh)\nLook out for each other, cause the government's lunatics\nNow\n\n[Hook]\n\n[Break]\nMaintain balance and you won't fall off (yeah)\nMaintain balance and you won't fall off (uh)\nMaintain balance and you won't fall off (uh)\nMaintain balance and you won't fall off (yo)\n\n[Verse 2]\nYou only got to watch TV for so long\nTo see our beautiful black women without they clothes on (uh)\nI know we capable of producin some fly freaks (uh)\nBut what about the ones that you get you open when they speak?\nThat's what I want to see on my TV this week\nBut there's no balance, so all we gettin is the nipple tweak\nBaby girl make it twerk, you'll get paid for your work\nI think it's foul, but you lookin at me like I'm the jerk\nI like to watch a ass shake as much as the next\nBut young ladies need to know they worth more than sex\nBut whatever, cause everywhere I look it ain't straight\nEverybody either hypocrites or over run with hate (uh)\nThe same cat tellin you that God is great\nIs makin friends with your son, with plans to violate (true indeed)\nNow what the fuck are we supposed to believe?\nWhen the ones we supposed to trust, all got somethin up they sleeve?\nBalance - somethin that we got to achieve\nIf your man slap you up, you got to know when to leave\nBalance - somethin that we gotta maintain (uh)\nRecognize plots to control your brain (yeah)\nBalance - somethin that we all gotta learn (what?)\nTake what you will and don't miss out on your turn (uh)\nRecognize your worth and cultivate your talents\nRemain on point and maintain your ...\nYo\n\n[Hook]\n\n[Break]", "title": "Balance", "album": "Balance"}], "artist": "Akrobatik"}