{"songs": [{"album": "Sickology 101", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg", "year": "2009-04-28", "title": "Dysfunctional", "lyrics": "[Intro: Tech N9ne]\nFirst entry for Sickology 101: Dysfunctional\n\n[Verse 1: Tech N9ne]\nYeah, don't you bring me nothing stupid\nIf you don't want me to lose it\nStep back if you don't want me to attack\nI'm a beast, better give me the deuces\nI have no tolerance for nonsense, get away from me\nN9na wanna get dollars, don't wanna holler but you makin' me\nI'm a little dysfunctional\nYou're the problem, please don't awaken me\nAnd I'm that way 'cause back in the day most have forsaken me\nLa-di-da-di, I'm at the party\nOn a drunk night with a punk, might\nDude's tryin' to pick a fight because he's sorry\nThat he ain't Gotti, like I be, 'cause he\nSloppy, not me, costly rocks be spot free\nBut he don't know I'm roguish, surrounded by my soldiers\nAnd they be locked and loaded when exploded you can't hold us\nAnd we don't got no scruples\nWe didn't come to fight and shoot you\nBut you busters better be mutual\nDon't get loose because we cuckoo\nListen, they call me genius, I run the show\nWomen be on my penis, it's wonderful\nDemons think they the meanest\nBut I brung the foe on the floor\nLittle bit sick, don't you know?\n\n[Hook: Krizz Kaliko]\nI'm a little dysfunctional, don't you know?\nIf you push me it might be bad\nGet a little emotional, don't you know?\nIf you fool around and make me mad\nI'm a little dysfunctional, don't you know?\nIf you push me it might be bad\nGet a little emotional, don't you know?\nMight fool around and make me mad\nDon't make me mad\n\n[Verse 2: Big Scoob]\nBorn to hustle, I'm a product of environment\nThe game done changed, so I've been forced into retirement\nBut I make moves and I paid dues and I got common sense\nSince I can't lose and I can't choose, then I'll come back to spit\nI got hit songs but I've been gone so long that I don't fit\nKneeled at the throne, but can’t get on, so I need me a lick\nI write these songs but don't belong I'm on some other shit\nI'm huntin leads in desperate need, I hope it's comin' quick\nI'd wrap my brain to find a lane that's gon' bring me some change\nBut it's so strange, my life has changed and I am not the same\nI come around but since I'm down, it feels uncomfortable\nI try to hide it deep inside but I'm dysfunctional\nI never learned to hold it in, I gets emotional\nFirst, implode and then explode, I am combustible\nSo please don't push me, play me, pussy, on some real shit\nWon't be defeated if I'm heated, nigga, oh shit!\n\n[Hook: Krizz Kaliko]\nI'm a little dysfunctional, don't you know?\nIf you push me it might be bad\nGet a little emotional, don't you know?\nIf you fool around and make me mad\nI'm a little dysfunctional, don't you know?\nIf you push me it might be bad\nGet a little emotional, don't you know?\nMight fool around and make me mad\nDon't make me mad\n\n[Verse 3: Krizz Kaliko]\nI ain't no killer but don't push me\nGoody-goody choir boy never been no pussy\nCould be carrying something up under my hoodie\nKrizz would never snap and kill a baller, y'all, or would he?\nNow I wanna be peaceful, but I carry Desert Eagles where\nEver black people are, you know how black people are\nI peep 'em out, try to stay evened out\nWanna preach to 'em but their evil keep on seepin' out\nEmotions get the best of me, messed up\nAnd then y'all get the rest of me\nDepressed and stressed, feel like my destiny\nI know y'all think less of me, 'cause I'm always sick\nAnd I can't let it be, pharmaceutical soup be the best recipe\nIt's gon' be the death of me, I need depakote\nJust to cope, while I keep throwin' them pills down my throat\nDysfunctional blunts will do Smokin' Bombay\nCan give me Fung Shui, but I wish that it all would go away\nOr maybe I should pray for Jesus Christ to just un-pretzel me\nTryin' to pray for change, but sometimes it feel like he lets it be\nSo I just take another couple doses, probably be fine\nBut if you get too close you'll find out that I\n\n[Hook: Krizz Kaliko]\nI'm a little dysfunctional, don't you know?\nIf you push me it might be bad\nGet a little emotional, don't you know?\nIf you fool around and make me mad\nI'm a little dysfunctional, don't you know?\nIf you push me it might be bad\nGet a little emotional, don't you know?\nMight fool around and make me mad\nDon't make me mad"}], "artist": "Tech N9ne"}