{"artist": "Vado", "songs": [{"title": "Nice For What (Freestyle)", "year": "2018-04-16", "lyrics": "[Intro: Big Freedia]\nI wanna know who mothafuckin' representin' in here tonight\nHold on, hold on\n\n[Pre-Chorus: Lauryn Hill]\nI keep lettin' you back in (you back in)\nHow can I, explain myself?\n\n[Chorus: Lauryn Hill,  Drake, & Vado]\nCare for me, care for me, you said you'd care for me\nThere for me, there for me, said you'd be there for me\nCry for me, cry for me, you said you'd die for me\n(Murda on the beat)\nGive to me, give to me, why won't you live for me?\nCare for me, care for me, you said you cared for me\nThere for me, there for me, said you'd be there for me\n(Let's go bro)\nCry for me, cry for me, you said you'd die for me\nGive to me, give to me, why won't you live for me?\n\n[Verse 1: Vado & Lauryn Hill]\nShout-out all my exes, get your brag on\nYour Chanel, your Céline, mean bag on\nGet your swag on\nIf he don't act right, I'ma act [wrong/raw]\n'Cause you was that type to put me back on, real one\nFuck how them niggas feel, they wasn't worth a chill\nThey wasn't worth a mill, when they payin' the bills?\nYSL is your heel, know you better than that\nAnd you never was whack, always ahead of your pack\nYou was something to chase that flew up in the ranks\nUsed to run in the banks, I gave you nothin' but thanks\nEvery color in cakes\nPump, pump it up\nButton open the gate, townhome come with a lake\nIt ain't over, you wait\nBae, you know you a star\nAnd one-up wit' your broads, [?] Audemars\nBartenders, they know who we are\nThey know where it's dough, ain't gotta blow it, they ball\nThey just go to the car, then we goin' across\nStones goin' across like Jesus go on the cross\nI could tell you sad, yo' glowin' is off\nYou know that you hot, that's why I be blowin' you off\n'Cause you a vet ma, love how you flex, ma\nPushin' the vet, ma\nHoodie is Vetements\nGucci tights and heels, Amiri sweats, huh?\nNo efforts to dress, huh?\nI'm definitely impressed\nCare for me, care for me, you said you'd care for me\nThere for me, there for me, said you'd be there for me\nCry for me, cry for me, you said you'd die for me\nGive to me, give to me, why won't you live for me?\nI be out in LA wit' my connection\nBottles of Belair, hoes in my section\nI won't lighten up on these niggas\n'Cause niggas ain't nice enough for me, nigga\nI been a beast\nHeavy orders for weeks\nBreakin' quarters for cheap\nOn these corners is street shit, every mornin' was sweet\nLast winter, bought a mink for my daughter and niece\nOnce I caught it and beat shit, I'ma throw it to East\n\n[Bridge: Big Freedia & Letitia Wright]\nUh-huh! (Oh yeah!)\nThese hoes! (They mad!)\nYour boy! (I had!)\nI made! (Watch the breakdown)\n\n[Verse 2: Dave East]\nIf we talkin' 'bout women, I keep a bad one\nMami a freak, you can't relate if you never had one\nShe told me you actin' light skin\nWe just be fuckin', I can't be wifin'\nAlways textin' me, she keep typin'\nHer ex from Harlem, she told me he went to Rykes\nAnd I been movin' so triflin'\nFuckin' everything movin', I'm breakin' nights\nMy aura converting dykes, we fuck to \"What's The Price\"\nOff the Migo album, Miami not like Barbados\nShe never seen an island\nShe tried to ask me 'bout paper, told her I keep it pilin'\nI might even eat it, long as you keep it silent\nGot the nerve to tell me she got to be nice for work\nI ain't want you anyway, I just liked your butt\nActin' all stuck-up, ain't livin' life enough\nTryna be in our section, you 'bout to spend a night wit' us\nMiddle of the summer, we keepin' it calm\n'Wit a chick like Stacey Dash or Lela Rochon\nFull lift in the winter, that shit be keepin' her warm\nPanties get pulled to the side, fuck it, she keepin' 'em on\nAfter the neck I got respect, I might speak to her mom\nSaid she from Highbridge, I caught her creepin' wit' Don\nShe got everything Gucci, said she need some Vuitton\nShe know the kid rich, might new freezer her arm\nTold me she stressed out, just need to smoke one\nShe got her nails did, got her toes done\nShe told me life been rough wit' these niggas\nShe pour a cup and like to fuck off the liquor\nI understand\n\n[Breakdown: Drake]\nGotta make that jump, gotta make that, gotta, gotta make that\nGotta make that jump, gotta make that, gotta, gotta make that\nGotta, gotta, gotta g-g-gotta, g-g-gotta, gotta\nGotta, g-g-gotta, gotta, gotta make that jump, jump (let's go)\nBend it over, lift it up, bend it over, lift it up\nMake that jump, jump\nBend it over, lift it up, bend it over, lift it up\nMake that jump, jump\nBend it over, over, over, over, over, lift it up\nMake that jump, jump\nBend it over, lift it up (make that jump, jump)\nBend it over, lift it up (make that jump, jump)", "album": null, "image": "https://images.genius.com/89ee702fa8a0cd51525f3505f76443c0.680x392x1.jpg"}]}