{"artist": "Petey Pablo", "songs": [{"album": "Diary of a Sinner: 1st Entry", "title": "Didn’t I", "image": "https://images.genius.com/7a6ca6b439312b29ef9ca24c73fef85f.220x220x1.jpg", "lyrics": "* originally from \"The Fast and the Furious\" soundtrack\n\n(Petey arguing with cop)\n\"All inmates are asked to stay inside the cell\"\nHey dog, you think I could make my phone call?\nHey look, what you need to do is sit down\nI just wanna make my phone call\nJust sit down -\nHey, I get a phone call for this motherfucker\nFuck you\nHey fuck you too ya bastard\nI just want my fuckin phone call\n\"Sgt. Ellis : Please come to the front gate\"-\n\n[Verse 1]\nI got his ass didn't I?\nTold him my plan didn't I\nThought I was playin wit him\nNow he ass out and payin shit that nigga stank didn't he?\nSmelled like some old spoiled meat didn't he?\nWhen they found him - took bout a motherfuckin week didn't it?\nDown in a motherfuckin creek didn't they?\nMr. Roberts found his ass out fishin Sunday evenin' didn't he?\nGift-wrapped in a sheet didn't he?\nRoberts got out of there so fast they didn't ever find his boat did they?\nI'd like to flip the hood night didn't I?\nDisrespectful-ass nigga like to ran up on my slab didn't he?\nY'all didn't even know I had that thing did ya?\nY'all just seen mad niggas haulin-ass across the field didn't ya?\n(hey, hey, hey!) that shit pulled a lot of cards didn't he?\nEspecially that bald-head tight t-shirt wearin ass Cindi didn't he? (punk)\nThat nigga ran in up his girl didn't he? (yo what happened)\nTook her home and ran the train on a trick didn't I?\n\n(sung chorus in the background, man talking man talking over)\nYou are now rockin wit one of the most real motherfuckers in the rap game\n97 -Petey Pablo or Petey Too Small as we call him down in Greenville - ya\nWith this new shit \"Didn't I\" -ya\nBoy that boy has done a lot of things\nPetey- tell sumden else you did\n\n[Verse 2]\nThought I was playin didn't ya?\nI did everything I said didn't I?\nI got out of prison and got a major record deal didn't I?\nYou didn't believe me did ya?\nYa'know I know you didn't\nYou probably decided that I'd be right back on the street didn't ya?\nI guess I showed you didn't I?\nGot in the race and then I won it didn't I?\nI didn't even rub it in your face did I?\nI could of got real shitty but I didn't did I?\nOr got all fly but I didn't did I? (nope)\nMan, I just kept it all real didn't I? (ya)\nBrought it right back to the homefront just like I said didn't I?\nThey kept skippin Carolina didn't they?\nYo (cough cough) excuse me, can I have your attention didn't I?\nI fucked 'em up the way I did it didn't I?\nCame to the city spittin nothin but that greasy-grimey-gritty didn't I?\nI changed a lot of things here didn't I?\nCame from the back to the front and I had them kissin a nigga ass didn't I?\n\n(sung chorus in background, man talking over)\nYou real crazy, boy you a trip, you a real trip\nBut hey, but hey, the boy kept it real , he did\nOh you thought it was over\nHey petey\nGet real fly on they ass\nAnd talk about some shit - some real shit - come on\n\n[Verse 3]\nYou coulda had me couldn't ya?\nAll that time couldn't ya?\nFaggot - mad little penny-pinchin ass\nThat little cash wouldn't hurt you would it?\nWell it shouldn't should it?\nYou wouldn't be broke and not tell us would you? (haha)\nC'mon, don't laugh, it could happen couldn't it? (yeah)\nIt wouldn't be so bad would it?\nIf I wasn't right there on your ass would it?\nSuch little shit shouldn't effect you should it?\nGlitter my ass - I'm a star cat (now Petey you shouldn't even be like that)\nMother fucker! (mother fucker)\nDidn't they tell you man?\nAll your dumbness is gunna come back on your monkey ass\nYou gunna be mad at this verse here ain't ya man?\nI wrote a song a bout it\nWould you like to here it here it comes (ha ha ha ha ha haaa)\n\n(chorus sung, with man talking over)\nHey let me tell y'all something\nI wanna tell y'all that this mother fucka here don't give a fuck\nFor real, he is pimp, straight up and motherfuckin down\nY'all got to hear this shit\nPetey Pablo - tha boy be out 19-2000 killin shit yo\nAiyyo we outta here\nWe'll let this motherfuckin beat ride\nWe're gunna let y'all motherfuckers sit there\nAnd enjoy the rest of this motherfuckin song\nAight, that was just a fly ass intro to this whole thang\nThe whole thang", "year": null}]}