{"songs": [{"year": "2017-07-14", "image": "https://images.genius.com/2aa8c09e7f1f4978eee0c17ea9097aac.1000x1000x1.jpg", "title": "As If It Was Nothin", "album": "Golden Era Tourtape ", "lyrics": "[Part 1: Kollegah]\nSieh mich Weintrauben essend beim Freimaurertreffen, Bitch\nWhite-Powder-Sessions, da herrscht Feinstaubplakettenpflicht\nMein Business läuft, ich bang' junge Chicks bei Striptease-Shows\nDein Business läuft voll scheiße wie ein umgekipptes Dixiklo\nKid, yeah, die Tourgigs ballern schon\nAber wirklich anstrengend ist erst der Groupiemarathon\nGuck, zum Tourstart meinte Ali: „So viel Schlampen schaffst du nie“\nDoch jetzt sieht man: Ali irrte wie am Strand der Normandie\nDeine Mum schuftet zuhaus, empfängt die Kundschaft ab sieben\nJeder muss 'ne Nummer ziehen, um 'ne Nummer zu schieben\nDu klopfst beglückt an ihre Tür, sie sagt: „Liebling, jetzt nicht!“\nZeitgleich brüllt ein Junkie: „Ey, die 73 bin ich!“\nWas 'ne Nutte, guck, sie steht in Heels aufm Rastplatz\nWo sie schmierigen Truckern für 'n paar Biere ihren Schwanz suckt\nUnd noch probiert diese Kahba, etwas würde zu bewahren\nUnd quittiert jeden Cumshot mit: „Mmh, lieblich im Abgang!“\nYeah, sie lutscht dem Big Boss die Eichel, doch bricht heulend zusammen\nSie hasst ihr Junkieleben, Kid, ruft zum Himmel: „Ist da wer?\nBitte, schick mir ein Zeichen!“\nUnd genau da kriegt sie mein'n mo'fucking Cumshot ins Gesicht\n\n[Hook: Kollegah]\nAlpha Gang zerfickt dein ganzes Camp\nErzieh' sie aus dem Handgelenk, Mutterficker!\nEin Mixtape, das wie Ganja brennt\nUnd wir hab'n uns nicht mal angestrengt, Mutterficker!\nAlpha Gang zerfickt dein ganzes Camp\nErzieh' sie aus dem Handgelenk, Mutterficker!\nHalbe Stunde und ein neuer Hit ist im Kasten\nYeah, yeah, as if it was nothing\n\n[Part 2: Pretty Mo]\nDa's ein großer Stress mit so 'ner Ex\nZiehe Solo durch die Gegend mit Raketen an der Hand, ich bin Boba Fett\nBecher' mich weg so wie Sokrates, bezahl' beim Ober Cash\nUnd du machst Auge auf den Schein wie beim Drogentest\nHater im Social Net am zinken wie ein Kokarest\nFinden ihre Eier in ihr'm Reallife nur am Osterfest\nWer ist Pretty Mo denn jetzt? Und kriegt er seine Texte geschrieben?\nEr ist total fresh wie Kodak Black und lächelt so sweet\nEy, Jungs wie ich entdeckten Penicillin\nIn deinem Team nur faule Hunde wie bei Resident Evil\nIhr seid Blender wie dieser Remington Steele\nIch krieg' Businesscalls in Fischrestaurants wie Ally McBeal\n\n[Hook: Kollegah]\nAlpha Gang zerfickt dein ganzes Camp\nErzieh' sie aus dem Handgelenk, Mutterficker!\nEin Mixtape, das wie Ganja brennt\nUnd wir hab'n uns nicht mal angestrengt, Mutterficker!\nAlpha Gang zerfickt dein ganzes Camp\nErzieh' sie aus dem Handgelenk, Mutterficker!\nHalbe Stunde und ein neuer Hit ist im Kasten\nYeah, yeah, as if it was nothing"}], "artist": "Kollegah"}