{"artist": "Cam’ron", "songs": [{"title": "Cookies-N-Apple Juice", "album": "Crime Pays", "year": "2009-05-08", "image": "https://images.genius.com/92496cfcc2e09bf599c5704239d3db57.1000x1000x1.jpg", "lyrics": "[Verse 1: Cam'ron]\nKilla!\nYo\nI won't kiss her, maybe hug her but I don't even like her\nI might get it, hit it, split it but yo I'll never wife her\nI Rowdy Roddy Pipe-her, (yes) but when she can't decipher (what?)\nLove from fucking no fussing, buzzing, she out my cypher (ahh)\nCome through in a Viper (Viper)\nGod damn I might white Nike her (yeah)\nYeah she straight, but get it straight, underestimate I might just dyke her (dyke her)\nYou fight and fuss wanna bite her, (damn)\nLock your girl down just like Rikers\nI ain't gotta do that once I hit your shit the damn bitch a lifer (forever)\nThis dude wanna write her (write her?), e-mail, text and type her\nHe a runner, I'm a gunner, baby girl, a sniper (sniper)\nRoll the blunts up, ma I'mma get the lighter\nI'll have you squirtin' for certain, yeah bring a diaper\nMilk, lemonade, I'm a fucking renegade\nHandguns, hand grenades meet me at the center stage (stage, stage)\nBaby boy go hire a squadron\nMy crib got more poles than the fire department (Ahh)\n\n[Hook: Skitzo]\nCookies with some apple juice\nCookies with some apple juice (Lady)\nI ain't mad at you, cookies with some apple juice (Lady)\nI ain't mad at you, (Lady) cookies with some apple juice (Lady)\nI ain't mad at you, cookies with some apple juice\n\n[Verse 2: Byrd Lady]\nFirst lady so wavy, lady of the birds, this is the Byrd Lady\nHoldin' up you know it gets crazy\nNo I'm not yo' girl but I could be your baby\nYes baby, I'm sexy, why you itty bitty girls wanna test me?\nCause I fly high floatin' where the jets be\nThat's why your man wanna sex me\nYep, he said I'm cute, try to throw me in the loop\nHit me when he hungry, lick my cookies, drink my apple juice\nApple Coupe, zoom-zoom, horse and Porsche, vroom-vroom\nZoom-zoom and not poom-poom, smash real fast got up out his room\nClassy, yet I get nasty, nasty but never trashy\nBright light, yes bitch I'm flashy, no you will never pass me\nAsk me? Ask who, ask you\nI'm sick, something like a flu flu\nYou stink, something like a zoo zoo\nLay low, you know what to do boo\nCause you don't want no problems, please trust girl\nI will solve them\nFo' Fives gats, I revolve 'em, now it's hell up in Harlem\nThis for midwest, down south, dirty dirty\nBitches catch up, tie your shoes now hurry hurry\n\n[Hook: Skitzo]\nCookies with some apple juice\nCookies with some apple juice\nI ain't mad at you, cookies with some apple juice\nI ain't mad at you, cookies with some apple juice\nI ain't mad at you, cookies with some apple juice\nMilk, Milk\nLemonade\n'round the corner fudge is made\nCookies with some apple juice\nI'm just trying to get paid\nMilk, Milk\nLemonade\n'round the corner fudge is made\nCookies with some apple juice\nI'm just trying to get paid\n\n[Verse 3: Cam'ron]\nI said, cookies and some apple juice\nCherry Jeeps, Apple Coupes\nNo hassle, hit 'em with a gavel, asshole my whole staff will shoot (Shoot, shoot sh-sh-shoot)\nWhat could the bastard do? (nothing)\nThey run, we run this town, we'll run you down, they'll laugh at you\nDamn no, look at mommy shaking her derriere (damn)\nFuck Christmas, you could have a merry year\nWhere you wanna go, everywhere?\nWhat you wanna do? Let me hear\nI'm talkin' Vegas, I don't do them teddy bears (nope, nope, nope)\nBut I do do the fish nets...\nPre-ejaculation to get my dick wet (No homo..)\nBut I'm tryna get your lips wet\nDoggy-style, facial, huh.. Welcome to Dipset\n\n[Hook]"}]}