{"songs": [{"lyrics": "[Verse 1]\nYep, steps up to the plate\nLittle brother, Little League, '87 he was 8\nRookie season for the skinny slugger newly out of T-ball\nPit against a pitcher with a ripper you could eat off\nChurch, then a grip of loons run to 3rd first\nGranny yelling \"Go Cubs!\", nose in her word-search\nSeen MILFs like apes on a monolithic bleacher\nInto advocating war and peace in lieu of sport and leisure\n\"Hi, Peggy!\" I was 10, chewing on a Sweet Tart\nLittle brother, left field, queen's guard, mean arm\nKnees bent, two out, two on bags\nWhen I caught him staring down\nAt something moving through the grass\nHold up, tagged runner and the whole cast rotate\nNot before he could identify the culprit\nGranny yelling, \"Go Cubs!\" Graham yelling, \"Gopher!\"\nNew left fielder give a fuck about a homer\nGot a homie, little rodent, head and shoulders out his hovel\nNo baseball in the bubble, ruh-roh\nParents thought it adorable, the players followed suit\nInning crawling to a close, head coach not amused\nCoach seeing red, coach on the diamond\nDragging 27 inches of aluminum behind him\nWhen he transverse 3rd, the families turn nervous\nThe following is a transcript of man vs. vermin\nHere we go: man stands out by a hole\nPest pops up to patrol\nMan plays live Whac-a-Mole\nIn a scene that would try every child as adults\nWhoa, pallbearer with a ball mitt\nThrown over the fence, coach hit the bench\nBoth teams lose, \"Good game, good game\"\nGranny yelling \"Go Cubs!\", Cubs ain't playing\n\n[Pre-hook 1]\nMy little brother is a funny dude\nA lot of funny shit happened to him\nMy other brother pretty funny too\nAin't seen him in a minute though\n\n[Hook]\nJust in case of rough waters\nI want to put one up for my brothers\nJust in case of rough waters\nI want to put one up for my brothers\n\n[Verse 2]\nYep, not a part of the machine\nBig brother, big idea, '9-0, 16\nNeubauten tee, plaid-flannel-laden, adolescent art kid\nTony Hawk hair, Skinny Puppy denim\nAnd a record player vomiting Alien Sex Fiend\nPeel Sessions in a Christian home for field testing\nIt's real youth in the palm of your hand\nWhen your mom thinks Satan is involved in a band\nWe were buried in the Village Voice\nChecking who was playing where\nPulled his head up out the paper, pushing out a single tear\n5 words, like a beacon of light in the mist: \"Ministry live at the Ritz\"\nIt was \"Christ Has Risen\" to Chris, 3 loaves, 2 fish\nMiracle of mechanized loops on 2-inch\nComing to a theater, he would be there in the flesh\nMoms didn't say \"No,\" but she didn't say \"Yes\"\nCop tickets, ah, the plot thickens\nCountdown to ultimate concert experience\nMa still wary: \"And why are they called Ministry?\nAre they a cult?\" Maybe she would properly investigate\nBought a mag with an Al Jourgensen interview\nRead a couple sentences, glanced at a pic or two or three\nThat's all, no fair trial\nSimply, \"You will not be going to the show and that's final!\"\nWhat occurred next were the top of the lungs\nOf a son who unjustly had lost what he loved\nIn a moment that would transcend anger to high art\nSaid, \"This is something I am willing to die for!\"\nCan you even imagine a death in the fam from industrial fandom?\nAnyway, no body count, no concert\nAnd Chris kicked rocks in his mismatched Converse\n\n[Pre-hook 2]\nMy older brother is a funny dude\nA lot of funny shit happened to him\nWe hadn't spoken in a couple moons\nI called him last night, \"How you doing?\"\n\n[Hook]\nJust in case of rough waters\nI want to put one up for my brothers\nJust in case of rough waters\nI want to put one up for my brothers", "title": "Blood Sandwich", "album": "The Impossible Kid", "image": "https://images.genius.com/1d8582e283f0f4d717c0ba1fe12df744.1000x1000x1.jpg", "year": "2016-04-29"}], "artist": "Aesop Rock"}