{"artist": "​​wifisfuneral", "songs": [{"year": "2018-03-09", "lyrics": "[Intro]\nAyy\nGot it on smash\nAyy, ayy, yuh\n\n[Chorus]\nOkay, like, 25 lighters on my dresser (Ayy)\nI woke up still dead, forgot to mention (Ayy)\nI'm sick off the drugs, like, what's my best bet? (Okay)\nI'm sick off the drugs, like, what's my best bet? (Okay)\nOkay, like, 25 lighters on my dresser (Okay)\nI woke up still dead, forgot to mention (What?)\nI'm sick off the drugs, like, what's my best bet? (Huh?)\nI'm sick off the drugs, like, what's my best bet?\n\n[Verse 1]\nOkay, like, smokin' on this kill, I'm so fucked up, my life's a interlude\nPretty sure I held my pride, if I can't die, like, what got into you?\nPeep up how she pushin' on my whip now, hip now\nI just spent a quarter on my wrist, like, what that shit 'bout?\nThis is real life, no cap, I'm on the tac, like, \"Check my fist now\"\nHol' up, like, keep your breath, I stay off edge, like, who my shit now?\nListen, okay, all my life been deaded, deadman bless me 'till I'm restless\nBring it back, write my thoughts to mention, burn my past until it's present\nYou can't kill my soul, forget it, you too evil for my section\nWait, like, tell me why I'm better then? Bitch check out my letterman\nHand free smoke like cigarettes\nThey new shit not my biggest threat\nLike, bitch, I'm in my element\n\n[Bridge]\nBring it back, brick back, hold that, uh\nWe can only minus with the toe tag\nAll up in the middle, run four flat, uh\nAll up in the middle, run four flat, uh\nBring it back, brick back, hold that, uh\nWe can only minus with the toe tag\nAll up in the middle, run four flat, uh\nAll up in the middle, run four flat, uh\n\n[Chorus]\nOkay, like, 25 lighters on my dresser (Ayy)\nI woke up still dead, forgot to mention (Ayy)\nI'm sick off the drugs, like, what's my best bet? (Okay)\nI'm sick off the drugs, like, what's my best bet? (Okay)\nOkay, like, 25 lighters on my dresser (Okay)\nI woke up still dead, forgot to mention (What?)\nI'm sick off the drugs, like, what's my best bet? (Huh?)\nI'm sick off the drugs, like, what's my best bet?\n\n[Verse 2]\nNow check this, whether you love me, or you hate me, it's the same thing\nKeep my name alive and keep thinkin' you about to switch these lanes\nNow let's not talk my pinky rings, silver surf my wave, you listenin'\nHunnids in the back door, check it in, fast with the work like a Mexican\nLike, why I still walk dead but this ain't past tense?\nI'm walkin' right through by my grave, these boys, they has-beens\nYou see, like 30,000 I could wipe my ass with\nBut I remember, I ain't had no place to crash with\nThey want my energy, oh please, like they could have it\nBut I can't trust you in my circle if you cappin'\nThem bricks look just like Air Force 1's, all white, yeah, that's it\nI'm smokin' kill inside this wood, that's straight boom-bap stick\nYou know that bitch, she not a 10, that hoe a catfish\nInside my Louis duffle, what I clean them racks with\nI stretch that money like I'm Mr. Fantastic\nI stretch them rubber bands, poppin' just like elastic\nLike why they actin'?\n\n[Chorus]\nOkay, like, 25 lighters on my dresser (Ayy)\nI woke up still dead, forgot to mention (Ayy)\nI'm sick off the drugs, like, what's my best bet? (Okay)\nI'm sick off the drugs, like, what's my best bet? (Okay)\nOkay, like, 25 lighters on my dresser (Okay)\nI woke up still dead, forgot to mention (What?)\nI'm sick off the drugs, like, what's my best bet? (Huh?)\nI'm sick off the drugs, like, what's my best bet?", "image": "https://images.genius.com/c2f5b91d67aa97e5a3856e20154cdfb5.939x939x1.jpg", "album": "Ethernet", "title": "25 Lighters"}]}