{"songs": [{"album": "Truly Yours 2", "year": "2013-04-30", "title": "Cole Summer", "image": "https://images.rapgenius.com/9025d88006694e95c5632c00323ac3e0.500x500x1.jpg", "lyrics": "[Intro]\nThis right here is not a preview\nI need to let it go, yeah\n\n[Verse 1]\nNow this right here is not a preview\nOf what the album goin' to bring you, or nothing like that\nSharing things I think quietly, with those that admire me\nRemember MTV Diaries? This something like that\nI wear my heart up on my sleeve, and I, bleed for you\nCookin' beats hoping' to reach like each one you\nWhen I release, trust if you feel like my shit is weak\nWhen you see me on the street, then speak, I refund you\nThis sample was yellin' \"loop me!\", Ms. Hill please don't sue me\nCause I ain't one of these rappers out here frontin' like he got it, nigga\nI ain't fuckin' got it, nigga...\nThrowing thousands in the strip club with Drizzy\nDifference is I'm throwing four, he's throwing fifty\nLord, forgive me\nBitches saying: \"You a rapper nigga, ain't you s'pose to tip more?\"\nI don't see no pussy, baby, ain't you s'pose to strip more?\nConfessions of a cheap-ass nigga\nBut I finally put my Momma in that E class, nigga\nAnd I told her quit her job, but hold your horses\nIf my next album flops it's back to the post office, both of us, shit\nThey're saying that's a real possibility\nThe thought alone is killing me\n\n[Hook]\nI think I need to let it go\nI need to let it go\nI think I need to let it go, let it go, let it go\nI think I need to let it go\nCause nothing even matters...\n\n[Verse 2]\nAnticipating rain, I can't make the same mistakes again\nThem 90s niggas raped the game\nAnd left us with a battered and bruised bitch, with a few kids\nThe pussy loose, but the truth is I love her, though\nShe ain't perfect, but who is?\nHoes saying \"Cole, you is\" don't be silly, ma\nCause really I am just a born sinner the opposite of a winner\nCole summer, I predict another winter\nCause I'm finta, drop knowledge like a five percenter\nFuck the Bilderberg, nigga show 'em God sent ya\nRhyme with the skill, as if Nas went to\nCollege on scholarship met 'pac and said \"I'm down with ya!\"\nAnd when they wasn't writing rhymes they fucking lined sisters\nPuffin' on swishers, what's up Milan?\nEverytime I drop I get the net poppin' like Lebron swishes\nKay told me kill ya, and I gotta respect my Mom's wishes\nWhen I let go this how my mind switches\nNo looking back, don't even want to see my prom pictures\nPardon the rhyme scheme, I guess I'm long winded\nLet me switch it now, back to Hell's kitchen now\nUp in Hova office like he the fucking principal\nPut me in with Stargate, that shit was like detention now\nJust tellin' my story so dissin' ain't my intention now\nDrop a couple hits and all the dumbies pay attention now\nA shame when you learn the ins and outs of the game\nAnd reminisce on little Jermaine in the south\nRappin' out loud, with all the niggas that's cool to you\nJust to realize that all them niggas was foolin' you\nAnd they ain't who they said they were\nTalk about the streets, but nigga that ain't really where they were\nActing just like there they were, but who am I to judge?\nThat's neither here or there\nJust know I know, my nigga, I just like being aware\nIf i had one wish, I would fuck Tia and Tamera, at the same time\nAnd put name tags on they titties so I don’t get they name wrong\nScreamin' \"Game on\"\nLike Wayne's World, that just came on\nI'm rambling now\n5 days to finish the album, I'm scramblin' now\nTook a break from sampling now\nJust to say a few words to this bitch named Summer\nJune will make four years since I gave you my number\n\"The Warm Up\" dropped, I got hot, you called it a classic\nAnd Jay dropped \"Autotune\", you wanted him back, shit\nPlay my position, the whole while still wishin'\nA year later Drake put his key in your ignition\nAnd I told my fellas, \nI dropped \"Friday Night Lights\" in the winter just to make her jealous\nWanted to drop the album in the summer\nBut the label didn't think that they could sell it\nRecoup the first week, I think it ain't shit they can tell us\nDo you agree?\nIt's been a long time coming this thing between you and me\nI can't let it go\n\n[Hook]\nI think I need to let it go\nI need to let it go\nI think I need to let it go, let it go, let it go\nI think I need to let it go\nCause nothing even matters...\n\n[Outro]\nJune 25th. Born Sinner. Bitch"}], "artist": "J. Cole"}