{"artist": "R. Kelly", "songs": [{"album": "Double Up", "year": "2007-05-29", "lyrics": "[Intro: R. Kelly]\nAight, now we got that out the way, let's double up\nIt's your boyfriend\nLook here, if we in the club\nAnd you trying to decide whether if you gon' leave with me\nAnd you don't know because you got your girl with you\nBring her with you, bring her with you!\nI got a place you can stay in my crib, let's go\n\n[Chorus: R. Kelly (Snoop Dogg)]\nStep up out the club with a dizzy head\nI got two chick that got dizzy legs\nI'm 'bout to double up (one on each arm)\nYou know I'm 'bout to double up (I keep one on each arm)\nHop up in that Phantom with the doors suicide\nI got a freak in the front and a freak in the back\nI'm 'bout to double up (one on each arm)\nAnd you know I'm 'bout to double up (I keep one on each arm)\nDouble Up\n\n[Verse 1: R. Kelly]\nI flow through the spot, Kells on the prowl\nI see these honies and they dancing all wild\nAll up on each other winding real freaky\nI'm plottin on how I'm gon take 'em home with me\nMaybe her cousin, maybe her girlfriend\nI just wanna get them both up out of here\nFast as I can on them dubs to the crib\nStart off with my game and pop a lil bub\nAnd have 'em dance for me like they danced in the club\nOooh they so freaky and both of them on me\nShots of Tequila puffin dro and now they ready\nHer girl hollered out with her best friends\nAnd then I hollered out \"y'all look like twins\"\nAin't no competition, y'all a couple of tens\nAnd then they said \"Kells, tell us what you wanna do?\"\nWell I'm about to double up with you and you\n\n[Chorus: R. Kelly (Snoop Dogg)]\nStep up out the club with a dizzy head\nI got two chick that got dizzy legs\nI'm 'bout to double up (one on each arm)\nYou know I'm 'bout to double up (I keep one on each arm)\nHop up in that Phantom with the doors suicide\nI got a freak in the front and a freak in the back\nI'm 'bout to double up (one on each arm)\nAnd you know I'm 'bout to double up (I keep one on each arm)\nDouble Up\n\n[Verse 2: R. Kelly]\nWomen don't stop when I walk up in the club\nSee your girl with her girl and try to get a group hug\nGet 'em to the hotel get some group love\nHer, her, me, man I just can't get enough\nAll up in my tub, steady poppin bub\nWho is she to you when she reply first cuz\nMan I can tell they so naughty, naughty\nThe way they took me down like a forty, forty\nOne in the bed and one in the chair\nOne might suck my toes while one braid my hair\nIn the prop spot like two fo these players\nIn the car lot like two of these players\nHaters say \"damn, how he doin this player?\"\nDoubling up for me is like routine player\nI'ma go get 'em, mix 'em up like a dealer\nMan three is company, bitch call me Jack Tripper\n\n[Chorus: R. Kelly (Snoop Dogg)]\nStep up out the club with a dizzy head\nI got two chick that got dizzy legs\nI'm 'bout to double up (one on each arm)\nYou know I'm 'bout to double up (I keep one on each arm)\nHop up in that Phantom with the doors suicide\nI got a freak in the front and a freak in the back\nI'm 'bout to double up (one on each arm)\nAnd you know I'm 'bout to double up (I keep one on each arm)\nDouble Up\n\n[Verse 3: Snoop Dogg]\nI'm back up in the VIP, in a cloud of smoke\nBe poundin', surrounded by all my folks\nGive me another shot, damn the music loud\nI'm bout to mix it up and blend in in the crowd\nWhip, slip, slide by the dance floor\nBaby grab me by the hand say she wanna dance, oh oh\nIs that your girlfriend peepin' me out?\nSho' nuff, it must be cause now she freakin' me out\nShe get behind a nigga, grindin' on a nigga, touchin' on me\nWhisperin' in my ear, damn it sound lovely\nI'm infatuated, we evacuated, now we at the crib\nIt's two for the money, that's the life I live\nKiss me, kiss her, now kiss each other\nIt's a trip the way I make these chicks twist each other\nTake your shirt off, now I'ma take hers off too\nIt's double or nothin', baby, that's how the boss do\n\n[Chorus: R. Kelly (Snoop Dogg)]\nStep up out the club with a dizzy head\nI got two chick that got dizzy legs\nI'm 'bout to double up (one on each arm)\nYou know I'm 'bout to double up (I keep one on each arm)\nHop up in that Phantom with the doors suicide\nI got a freak in the front and a freak in the back\nI'm 'bout to double up (one on each arm)\nAnd you know I'm 'bout to double up (I keep one on each arm)\nDouble Up\n\n[Outro: Snoop Dogg (R. Kelly)]\nHow bout that?\nSnoop Dogg and Kells (Chi-tizzle)\nWe lead the league in this here man (Believe that)\nYou know what I'm talking about? (Yeah, hell yeah)\nThat's forty toes man, add that up, forty toes\nThat's like twenty points and twenty rebounds\nThat's a double double (you a fool)\nWe double up like that man, Midwest connect\nYou know what it is, holla back\n(Uncle Junebug, what up my nigga?)\n(I see you Reese, sitting there all slim and shit\nNigga I'm 'bout to go workout too)", "title": "Double Up", "image": "https://images.genius.com/d006d387bc28299b559e6b9848a770d1.1000x1000x1.jpg"}]}