{"artist": "Wax", "songs": [{"year": "2013-01-01", "lyrics": "[Intro]\nYeah. My man Elements of Music\nHe just sent me a little new shit\nSo I had to tell him how I deal with shit check it\n\n[Verse 1]\nPardon the cliche but I tend to keep it real\nSo if I tell you something then it's probably how I feel\nBut some people that I deal with do it way different\nChanging, colors Shape shifting\nThey adjust to their surroundings\nAnd bring to the table whatever that certain crowd brings\nHow they talk how they act\nWatch what you tell them 'cause they quick to stab you in the back\nSo they best left kept away\nYou'll end up saying damn it felt like we was best friends yesterday\nThey terrible homies great snitches\nLawyers love em cause they always make a great witness\nOn the stand they be giving up the Judas speech\nPutting it all out there like they on a nudist beach\nAin't nothing that they loyal to\nLook out for them don't let them foil you\n\n[Chorus]\nI'ma watch what you say to me\nCause you not what you claim to be\nIs that your real hair and your real skin?\nBeware the chameleon, uh\nBeware the chameleon, yeah\nBeware the chameleon\nIs that your real hair and your real skin?\nBeware the chameleon (Yeah)\n\n\n[Verse 2]\nPeople in love can be easily deceived\n'Cause love requires trust so the other people needs to be believed\nBut some will readily betray it\nTell a lie and not feel guilty as they say it\nThe manipulative type trying to get what they like\nThey got they flipping game tight so they gratin' the fight male or female\nEither way no sympathy\nThey both do it they just do it a little differently\nA man's blinded by hard sex and large breasts\nA woman's blinded by cars, jets, and large checks\nA man cheating is probably fucking with random whores\nA woman cheating is probably fucking a friend of yours\nShe'll smile at you when she come in the house\nWatch out she might got some cum in her mouth so don't kiss her\nAs soon as possible dismiss her\nAnd take it as a lesson next time you'll get the picture\nIt's the truth man\n\n[Chorus]\nI'ma watch what you say to me\nCause you not what you claim to be\nIs that your real hair and your real skin?\nBeware the chameleon, uh\nBeware the chameleon, yeah\nBeware the chameleon\nIs that your real hair and your real skin?\nBeware the chameleon (Uh)\n\n[Verse 3]\nOn the other end of the lizard spectrum\nIs the hollywood networker always trying to kiss your rectum\nOnly friends with those who can connect him\nAnd they understand the game it's hard to respect them\nIt's real easy to spot this dummy\nWhen you talk to him say a joke that's not that funny\nIf they burst into way too much laughter\nThen they own personal gain's what they after\nBut i don't treat them with hostility\nI just treat them like they speaking in soliloquy\nThe female ones they be killing me\nBitch you just trying to fuck Ryan Phillipe\nGet up out the dressing room\nIt's Big Wax EOM if you guessing whom\nIt's why the shit bump like a pregnant womb\nGood night kids another lesson coming soon\n\n[Chorus]\nI'ma watch what you say to me\n'Cause you not what you claim to be\nIs that your real hair and your real skin?\nBeware the chameleon, uh\nBeware the chameleon, yeah\nBeware the chameleon\nDon't let them take care of your children\nBeware the chameleon", "image": "https://s3.amazonaws.com/rapgenius/Big_Wax_in_Front_of_a_Fence.jpg", "album": null, "title": "Chameleon"}]}