{"artist": "E-40", "songs": [{"title": "1-Luv", "image": "https://images.genius.com/b52b581f902f3353abd2c96694363546.800x800x1.jpg", "album": "In a Major Way", "year": "1995-02-25", "lyrics": "[Intro]\n(Phone rings)\nThis is the operator. I have a collect call from\n\"Ay this yo' potnah, mayne!\"\nWho is an inmate in a California state prison\nTo deny charges, hang up now\nTo accept charges, press five now\n\n[E-40 + Levitti + (Geraldine Michaels)]\nMmmmm..... welllll\nOne love (One love)\nOhhhhh (One love) The L, the L, the L, the L\nOne love (One love)\nWelll (There's only one love) The O, the O, the O, the O\nOne love (One love)\nOhhhhh (One love) And the V, the V, the V, the V\nOne love (One love)\nWelll It's the E, the E, the E, the E (There's only one love)\n\n[Verse 1: E-40]\n'Member that game Fat Bank Take Skinny Bank?\nWell now we play Skinny Bank Take Fat Bank\nThat's because it ain't no work bein' offered main\nThey act like they ain't even thinkin' 'bout us main\nI promise I swear the po-po threw my homie in the slammer\nDid him bad, wish I had my candid camera, made me mad\nPenelopes swarmin' like bees, surveillance binoculars hidden in trees\nReliable sources copping pleas, oh p-uh-please\nOne for the life, and two for death\nThree damn strikes no chances left\nLet me tell ya lil 'bout me, E-40 and the C-L-I-C\nWe used to have to use sheets for curtains, socks for washtowels\nI was happy as hell when my cousin gave me his hand-me-downs\nThis ain't no happy Shirley Temple tale-listic crap\nThis here is serious, more realistic than Radio Shack\nObserve as I strike a nerve, reach out and touch my kind\nOpen up your photo album, man, and I bet you find\nFolks that passed away, potnas that been blasted away\nI miss you, spill some liquor, mayne, who got some tissue?\n\n[Chorus: E-40 + Levitti + (Geraldine Michaels)]\nOne love (One love) One love\nOhhhh (One love)\nOne love (One love) One love\nWell wellll (There's only one love)\nOne love (One love) One love\nOhhhh (One love)\nOne love (One love) One love\nWell wellll (There's only one love)\n\n[Verse 2:]\nHuh, e'rybody wanna shoot 'em up bang bang\nWay I was raised we had to knuckle up and throw them thangs\nWe got em up and you know I had to check 'em swell\n'Cause if I ran home and didn't fight back my mom'd beat that tail\nJust received word from my folks upstate\nThey said uh, they tryin' to, they tryin' to take away our weights\nAnd uh, no more beef and pork, just Muslim books and fish\nWalking laps around the yard with my Walkman bumpin' this\nNow I'm bouts to get married, is it clever?\nThought it was 'til I got the Dear John letter\nBeen down for ten months and got a eight-year stay\nAnd I just found out she had her baby yesterday\nAin't nobody been to see me yet, but I ain't gonna worry\nMayne, ya out there ballin', mayne, can you drop a twamp up in my commissary?\nUhh, my family thinks that I'm a thug, homie\nWhen you see my momma, man, give her a hug for me\nAnd tell her\n\n[Chorus: E-40 + Levitti + (Geraldine Michaels)]\nOne love (One love) One love\nOhhhh (One love)\nOne love (One love) One love\nWell wellll (There's only one love)\nOne love (One love) One love\nOhhhh (One love)\nOne love (One love) One love\nWell wellll (There's only one love)\n\n[Verse 3: E-40]\nHuh, thinkin' back, you gotta watch your back and play it well\nEnjoyed myself when I was out there tryin' to get in that mail\nWe used to kick it at the Waterfront, the whole Vallejo\nWatchin' the pervin contestses between E-40 and Del\nThat's what we did up under the bridge, fools posted up\nChoppin' game, conversatin', gettin' toast up\nLeanin' against my Zeniths, convertible tops and who's the cleanest\nThem Click boys smobbin' deep in cuts, actin' meanest\nThe good times, they gone, here in the can is my new home\nGuess in order to do some right I had to do some wrong\nPicked up a package yesterday and I was HAPPY\nIt was a box full of goodies from my PAPPY\nTripped me out, ain't seen or heard from Potna Duke in years\nSent me a picture and some fetti, dang near sheddin' tears, huh\nSee, first you born then you live then you die\nOne day soon I'll get another try, 1-Luv\n\n[Chorus: E-40 + Levitti + (Geraldine Michaels)]\nOne love (One love) One love\nOhhhh (One love)\nOne love (One love) One love\nWell wellll (There's only one love)\nOne love (One love) One love\nOhhhh (One love)\nOne love (One love) One love\nWell wellll (There's only one love)\nOne love (One love)\nOhhhh (One love)\nOne love (One love)\nWell wellll (There's only one love)\nOne love (One love)\nOhhhh (One love)\nOne love (One love)\n(There's only one love)\nOne love (One love)\nOhhhh (One love)\nOne love (One love)\nWell (There's only one love)\nOne love (One love)\nHey (One love)\nOne love (One love)\nYeah yeah yeah (There's only one love)"}]}