{"songs": [{"title": "Intro", "album": "In My Own Lane", "year": "2018-07-13", "image": "https://images.genius.com/264018a1742668571058bf4a6a740e03.500x500x1.jpg", "lyrics": "Bitches thinkin' they can touch this\nFuck I look like — a iPhone?\nBitches talkin' like it's they time\nThey ain't even in my time zone\nBad bitch smokin' big gas\nPuff, puff, bitch, no pass\nWhite bitch with a thick ass\nAnd when a bitch pass, I give 'em whiplash\nSo all you lookin' ass hoes keep watchin'\n'Cause you ain't stoppin' what I punt\nLook at what I'm whippin' in a pot\nLookin' when I'm pullin' out the lot\nLook at what I did for the culture\nWhy you think they label me a boss bitch?\nAll up on my bread like a toaster\nNow I got the flavor in the sauce, bitch\nAin't a off-switch, yeah the plug got 'em two on\nKush gone tell me, \"what the fuck is you on?\"\nAll I do is stay fresh like a new bong\nAll I do is run numbers like a new phone\nLast week got a coupe, and it's coke white\nThis week got a coupe and it's two-toned\nDouble up on a bitch on a broke night\nDouble up on a bitch, put the crew on\nRight back with some mo' shit — oh, shit\nStill buzzin' from my old shit, no shit\nHoes talk like they know, don't know shit\nFuck you with a smile what a hoe get\nKill my old foes off, got a new list\nRing, ring, got a new phone, who dis?\nSame shit, same clique, fuck a new bitch\nLil Debbie still goin', got 'em too pissed\nI'ma get it\nFind me and a mic and I'ma check it\nI don't ever listen to a hater, ain't a damn thing\nYou could ever do but respect it\nI'ma still do Debbie, if I never get the credit\nI'ma keep gettin' money 'til I only charge debit\nBitches wanna throw shots, I ain't worried 'bout a pellet\nI ain't never been about it, if I let a hater tell it, woo\nIf you tryna touch my riches, bitches\nThen I think, it's best you get religious, bitches\nNah, I might not be as big as bitches\nBut they just as fad I call 'em fidget spinners\nHere today and gone tomorrow\nFollow trends, never bidness, so they fuckin' with us\nHaters hatin', but I'm still creatin'\nAnd we still be cakin', 'cause it's bigger bidness\nLord my witness, I'm a record\nLord my witness, I'm a record\nBitches busy talking gimme-gimme\nGive 'em bars a plenty, 'cause I said it\nLord my witness, I'm the realest bitch\nLord my witness, I'm the realest bitch\nBaddest bitch, I'm on my savage shit\nI came to damage it\nI know they feelin' this, hear me out"}], "artist": "Lil Debbie"}