{"songs": [{"title": "Body Scream", "album": "Three Seashells", "year": "2014-02-20", "image": "https://images.genius.com/0f6c8f3b41300378f968228833670eed.350x350x1.jpg", "lyrics": "[verse 1]\nThese bitches front like they ain't know I was the illest out\nCool J couch, camo hidden in the freaking house\nHomegirl said she want me, put it in her mouth\nYou see them bitches crowd around, you know Lakutis in the house\nI'm getting paper like a neighbor on the route\nBad man, see me coming, rush your children in the house\nBar the windows, act up\nI will end your life on Foo Fighters with the Mentos\nYou don't meet no kin folk, you's a crazy bitch though\nDoug Funnie with the banjo, eat the pussy like the baby with the dingo\nI'm a star like Ringo, I'm a star like Han to my wrist froze out you\nHi boo, how you?\n\n[hook]\nGirl, I know you miss the things that we do\nYou tell me I make your body scream\nGirl, you know you miss the things that we do\nYou tell me I make your body scream\nGirl, I know you miss the things that we do\nYou tell me I make your body scream\n\n\n[verse 2]\nDamn, I don't like how she surround them dudes\nPlus I don't like the way they hounding you\nShe had the nerve to walk up and ask me \"how are you?\"\nI said, \"Astounding, you?\"\nShe said, \"Better, now that you around, and you?\"\nI said, \"I'm fine, and you?\"\nShe said, \"I'm good, you too?\"\nI said, \"ooh ooh ooh\"\nShe said, \"woo woo woo\", shit\n\"That's Living Single, man I watch that too.\"\nShe said, \"I watch that too.\"\nI said, \"Ha ha, that's true.\"\nShe said\n\n[hook]\n\"Boy, I cannot believe the way you treat me\nYou have got to change or say goodbye to me.\"\nI said\n\"Girl, you know you miss the things that we do\nYou tell me I make your body scream\nGirl, you know that I am your perfect lover\nI know you miss the things that we do\nYou tell me I make your body scream.\"\n\nGirl, I know you miss the things that we do\nYou tell me I make your body scream\nGirl, I know you miss the things that we do\nYou tell me I make your body scream"}], "artist": "Lakutis"}