{"artist": "King Los", "songs": [{"image": "https://images.genius.com/6a65f4df62e6c17c90d56a362d8bb582.500x500x1.jpg", "title": "Dark Fantasy", "year": null, "album": "The Louis Vuitton Gift Pack", "lyrics": "[Produced by RZA, No I.D., Kanye West, Mike Dean, and Jeff Bhasker]\n\n\n[Teyana Taylor]\nCan we get much higher............\nBut of course we can baby hahaha\n\n[Los]\nUmmm its Los .. again\nOkay I take my middle finger, flick it to the wicked media\nCritics on my dick, clicking a nigga’s wikipedia\nFlow more intricate than the period of pyramids\nWhack rappers lack what the Pythagorean Theorem is\nMy mathematics will trip you have your shoes tangled\nI think it’s funny, you come at me from acute angle\nI could of grabbed all my weapons and took a T.I\nBut I ain’t gotta see you to kill you, Book of Eli\nNikka we fly, the first time you hooker glanced\nI hit it from the back and did the skully low Brooklyn dance\nThe Rico from Paid in Full while everybody look and dance\nFucked her in the kitchen, did the Lil B Cooking Dance\nI took a chance with Puffy and lost six years\nBut how he gon fix my problems? He can’t fix his\nThis year, I ain’t prepared to take my next L\nLast year, I got X but this year, I excel, ahem, please pardon my pun\nEach part of my jargons like jog, yo he starting to run\nHe talking to pun, me, you see me sparking my gun\nI go retarded with these bars, I'mma talk in my pun\nThis chick in back of me, bought me a daiquiri\nSat beside me, said hi, I’m Daphne\nActually, you attracted me after I heard you rapping\nThere’s something ,just happened magically\nAutomatically grabbing me, sorta drastic dramatically\nStaggering off to jack but accurately adapting\nTo dudes in black hats and the jackets was thinking, jacking me\nBut I’m packing ratchets for static that happens gradually\nTold that bitch imagine me casually falling, casualty\nGrab the gat and blasted the castle that hats and back of me\nKilled the bitch at the bar then sat back, just had my daiquiri\nI think these rappers be scared to step an inch in my sector\n‘Cause I school that ass like a Princeton professor\nYou approach your bars with hesitation\nI approach mine with a Harvard’s education\nYeah I dropped outta college and could of went to jail\nBut I don’t like regular people, I should of went to Yale\nI’m just venting hell, think I need a book deal\nCan we get much higher? I feel how the hook feel\nAnd I’m rolling in that Rolls Royce, bumping Seal\nYou know the one with the white bitch on the ugly grill\nI ain’t talking ‘bout Seal, I’m talking ‘bout the car\nHad to clarify that ’cause niggas be talking ‘bout my bars\nYour time’s up dog, I’m cleaning out the cell\nI jump on songs and snap like I’m singing acapella\nCan we get much higher? I feel how the hook feel. So this it for your career\nThe way I’m ‘bout to start this bidding war\nYou gon’ think I’m selling missiles to Korea\nIt’s official, get it clear, this tre that I’m packing\nAin’t singing you a song when it hit you in the ear\nSo warn your whole village, I’m coming to kill every king\nRight now, the score is them nothing, me everything\nI feel like they gave me nothing and them everything\nSo I ain’t just rapping and bluffing, I mean everything\nI’m bout to have y’all niggas mad at me\nI wrote this blindfolded, dark twisted fantasy\nCan we get much higher? Can we get much higher? Can we get much higher?"}]}