{"songs": [{"album": null, "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png", "year": null, "title": "5 AM in Brooklyn", "lyrics": "[Intro]\nY’all niggas soft, b, y’all niggas soft, b, you’re spoiled\nUsed to be you had to go look for your hip-hop\nNow it’s served to you on a silver fucking platter\nNow y’all niggas overly concerned with how a nigga look\nWhat a nigga wear, who a nigga fuck\nThat’s soft shit, b\nWhat part of the game is that? Aye\nBut I love these niggas\nI approach all my niggas with love, man\nI approach all these niggas with love, man\nYeah\nWhy? Why?\n\n[Verse]\nLove never fails, fuck your fairy tales\nI’m never scared, plus I do this rap shit very well\nI aim to let my shit bang, turn the levels up\nParty over for you niggas, time to settle up\nAll of a sudden y’all wanna know my opinion\nBut a nigga been official I’m holding down my position\nLooking for the answers, ain’t no solution, there’s not a problem\nThey tryna turn up, my catalogue speaks volumes\nWhen I say I’m a man of the people I really mean it\nI don’t just mean the people that I agree with\nNow I could probably use some tact and some proper diction\nBut that’s why I’m an artist, not a politician\nAnd that’s why I’m the hardest regardless\nIf you think I’m a Prisoner of Conscious I illicit certain responses\nTo make me the poorest choice to be backed by a corporate sponsor\nSo I'm independent as fuck and my Company Flow gets Rawkus\nSometimes I get exhausted, there ain’t no rest for the weary\nI never forfeit, I’m ill until the coffin\nIt’s lower than to the ground they say the lion left a pawprint\nBody of work is so vast, so enormous\nY’all niggas ain’t about shit, get your mouth split\nBlood dripping all out your lip, on your outfit\nTalking all that loud shit, I’m thorough as you say you are\nNiggas twist your words so I gotta watch what I say on blogs\nThese niggas leaving comments, but they scared to at me\nPut in the work that I put in and then holla at me\nI got love for every artist, I’m more than just a product\nI’ve been a prisoner, see Mumia, I’ve been to Cuba to see Assata\nWay before Mr. and Mrs. Carter went on a dinner date\nI had to send the lyrics ahead of time before I hit the stage\nSo scrutiny is not new to me I just usually\nOnly respect the opinion of those suggesting unity\nLove hip-hop, stop it I don’t believe you\nAnd loving hip-hop don’t got nothing to do with either\nCaught up in the gossip and rumors you not consuming\nSo I’m shitting on these niggas like Revenge of Montezuma\nIf you demand it trust the market will supply it\nThey complain about the music, but they never fucking buy it\nI kinda get it though, we asking them to cop it\nAnd they probably like, “Why? You waking up in a new Bugatti”\nShout to Future, this for my chicks who rocking the Scotts with the poodle\nAnd party like Adam Scott on Hulu\nSet to wake these niggas up like cock-a-doodle-doo\n‘Cause my spit more ludicrous than Shaka Zulu\nThese pseudo-intellectual metrosexuals try to confuse you\nAnd knock you off your schedule putting death on a pedestal\nBut rhyming describes the times that ricin was sent to federal buildings\nBy cowards capitalizing on our confusion\nNow we trapped in speculation the caterpillar the butterfly\nWho get blinded by the light while they stripping us of our rights\nI'm not giving up on the fight or set ‘em up with the left\nThen knock ‘em out with the right\nI be rocking the shit for life, yeah\n\n[Outro]\nPrisoner of Conscious\nJavotti Media\n5 AM in Brooklyn"}], "artist": "Talib Kweli"}