{"artist": "360", "songs": [{"album": "Loosies", "year": "2013-08-09", "title": "30 Minutes Tops", "image": "https://images.genius.com/abe3cfc92fbcdff0e796fa77de4fbcea.479x479x1.jpg", "lyrics": "[Intro]\nYeah, motherfucking 360 bitch\nWe made this song in like half an hour tops (Wooh)\nJesus was swag\nYou know god? He is my dad\nUh\nUh, yeah, yo\n\n[Verse]\nGo to an orphanage, kicking the door in\nKidnap her like [?] strangle her with my foreskin\nYeah, and I'm swimming with dolphins\nIt's the only way left to release endorphins\nI'm on a motherfucking galaxy quest\nI'm trying to figure out which planet's the best\nHey yo, I bet that Saturn is next. It makes sense too\nThat's why I got the motherfucking tat on my neck\nWent to the bank to make a balance request\nThey couldn't understand, all the cash that I've spent\nAnd, if I don't change soon, I won't have any left\nNow, even my god damn reality check bounced\nNot another fucking rapper again\nKicking me another verse about his pad and his pen\nAsking me when me and Kerser fucking battling next\nI'm sorry buddy but that ain't going to happen again\nNo, I ain't scared that I'll damage or wreck\nBut no cunt will ever go and piggyback me again\nBrother, don't take it as a lack of respect\nI'm glad I helped you [?] a tad of success\nBut I just have to adress something that has to be said (What?)\nA snapped neck doesn't need snapping again\nDo I think I won the battle? Actually, yes\nSee the fast fucking flow, it's just a tad for a sec\n'Cause if you slow it down and listen to the raps that he said\n'Cause, really, how many of his bars do you actually get?\nLike Sue from Neighbours ain't it, so you taking a piss\nWhich human on this earth'd eat a razor and shit?\nWhich human'd ever eat a razor and live?\nAnd which dude is dumb enough to place in his dick?\n\n[Interlude]\nSue from Neighbours' anus\nPrawn razors naked\nWhat the fuck cunt?\nYou taking a piss\n(We do it for the love)\nYeah\n\n[Verse (Continued)]\n'Cause if I had to fuck razors or be playing your shit\nI think your name would come up in my playlist a bit\nYeah, I lied, but he said I have a Canadian chin\nYeah, I lied, but what the fuck is a Canadian chin?\nSo, I don't watch our battle anymore, yo I exited\nThat's two bits broken cunt, imagine the rest of it\n\n[Outro]\nYeah, thirty minute tops\nMate, tops\nI'm way too busy brah\n(We do it for the love)\nYeah, uh\n360"}]}