{"songs": [{"year": "2016-01-13", "title": "You Dead", "image": "https://images.genius.com/31f2b72c5881d6472c42ba99a09502bf.700x700x1.jpg", "lyrics": "[Hook]\nYou dead! And that’s just how you’re gonna stay\nYou dead! You don’t get to see another day\nYou dead! We’ve been dancing on your grave, homie\nYou dead! Tried to tell you, you don’t want to play\n\n[Verse 1: Nacho Picasso]\nOnly time I get to running’s when the feds is coming\nBury money in the bed hid the rest in London\nI ain’t even going clubbing unless you get my gun in\nHit the powder pack first then I dip the blunt in\nNew new chick like Lauren London\nCheese steak got extra onions\nFor Pete’s sakes he’s so repugnant\nHe joined a cult, she joint a covenant\nShia LeBeouf ‘em, I don’t love ‘em\nI don’t cuff ‘em, I just stuff ‘em\nYou buy the muff, I buy the muffin\nI tie ‘em up & don’t buy ‘em nothing\nLine ‘em up, divide it up\nWhite lines I’m high as fuck\nBust a nut & then buy a truck\nTook a bump & then took a dump\nI don’t love no niggas neither\nTattoos & I ain’t a bleeder\nTattoos on every finger\nLife’s a bitch, you aim to please her\nLife’s a bitch, I’m a wife beater\nBlood speckles on wife-beaters\nSold black tar wearing white sneakers\nKnow white boys with wide peepers\nThat’ll rob you blind like nice speakers\nI’m a night-owl, late night tweaker\nRun DMC, on DMT, keep TNT in my Adidas\nI walked with Jesus, drew Mona Lisa\nI taught the thesis, I’m cold as Frieza\nThey call me Caesar I’m so facetious\nIncrease the peace or increase the pieces\n\n[Hook]\n\n[Verse 2: Sadistik]\nI’m inundated, in a daze\nOut my mind I’m in a phase\nInnervate my inner-veins\nMy innards drained for entertainment\nAt center stage\nSpill my guts on dinner plates\nI’m dead awake, they’ve been afraid\nMy set of fangs may penetrate, uh\nMy limbs still feel dismembered, that's if I still remember\nLiquid liquor liver dies like live or die by thrilling benders\nInstill the pressure to break the surface & build it better\nI'll William Tell em my aim is perfect & kill offenders\nMy top lip is gothic, the bottom is opposite\nI'm often laconic, they not they just talk\nTheir topics are toxic, obnoxious & nauseous, etcetera\nI better not get what they got I know I'm not one of em\nRunning with wolves, and keeping that pack\nUnder the moon, I can see in the black\nEat through the fat, hunt and pursue\nI turn nothing to something deceive and attack\nThey feed on the last I proceeded to pass\nAnd repeat it, read it on my lips\nIt's chronic when they cross their tongues\nJust to talk to haunted ones, you dead\n\n[Hook]\n\n[Verse 3: Mr. MFN eXquire]\nYo, I’m a dead bee, no buzz\nI don’t give a fuck, nigga I’m focused\nI’m a urban legend, like the Loch Ness\nThis fur’s a yeti, this fur’s a vest\nThis verse a blur, my words a blur\nObscure absurd, I’ma merk this nerd\nDoing a drive-by, I swerve & squirt\nWave bye-bye, merge with the earth\nI’m Mufasa, King Jaffe Joe\nOn Viagra fucking a sloppy hoe\nI grip her ass like I’m kneading dough\nYou wear Jordan skullcaps with fucking minks\nYou a fucking weirdo\nI don’t give a fuck, I’m fuck-less\nI’m drunk as fuck, I’m hopeless\nI’m Basquiat, I am Malcolm X\nBitches in the club be like\nThat nigga ain’t got no type respect\nI don’t give a fuck, you still gone fuck\nMy pops said he like my music\nI just say fuck too much\nWell fuck you pops\nThis how the fuck you made me\nFucking wild, fucking crazy", "album": "Salo Sessions"}], "artist": "Sadistik"}