{"songs": [{"year": "2008-06-10", "album": "Deified", "image": "https://images.genius.com/36a055443f122e1a3843a531db937cde.600x600x1.jpg", "title": "That Go (Remix)", "lyrics": "(feat. Prodigy of Mobb Deep & The Alchemist)\n\nProdigy (Intro):\nYeah Nigga, yeah, yeah, yeah, yeah nigga yeah, yeah\nLaid up, laid up; Infamous nigga; its going down\nKeak Da Sneak, Uh-Huh \"P\" (Prodigy), Yeah \"ALC\" (Alchemist)\nWhat up What up With It?\n\nChild (Intro):\nMozart, Mozart, Mozart\n\nProdigy (Hook):\nGet it, get it, get it, get it, get it\nKeep the paper, write on it, and never wait a minute\nThat money clicks, all the honey dips; wanna ride in the whips, they slide heavily\nSlippery hoes you na that go, slimy na mean fo sho?\nHahahaha, \"P\" (Prodigy) for president; with pistols that pop all that missle shit\nAll that pussy, pussy; I get all the nucci, I get all the coochie in the middle of the poochie\nThey got hella booty and heavily faced; make a few down every time a blank\nIt's really a small thing, I don't try hard\nI just kick it back and play my part\nNever see the bright side, we only see the dark\nSo I'm ready for whatever it is you want more…\nMore, more, more, more, more, more, more, more\n\nKeak Da Sneak (Chorus):\nThat shit go\nThat go, that go, that go, that go, that go, that go, that go\nNa Mean Fo Sho?\nThat shit go\nThat go, that go, that go, that go, that go, that go, that go\nYadamean you know?\nThat go, that go, that go, that go, that go, that go, that go\n\nKeak Da Sneak (Hook):\nI said lean wit it, rock, walk, and pop, lock\nGet low, go get go dumb, don't stop\nGoing like rushing out traffic, in the fast track\nIn the car pool lane; with something like three times black\nAnd there ain't no coming back; Granddaddy hittin hard balls like Barry Bond's bat\nGoin gone, finding something for the feet running; with a fourth counting, the bay slappin' the trunk for me\nGame savior; I cut you with a shavor weather; honey-racks never behave, only catching my own neighbors\nStill from the street to the beat; watching this getting; and you ain't gotta tell me what I'm getting\nBbbbbay on the road again; this my fourth album all that other shit scraped and done\nScraped and done, dipped up put back in your mouth; Brand new media rep smoking more more in and out\nYadada talkin' bout (know what I'm talking bout); if you didn't neezle\nIt's all n the dizzle so hit the geezle heezle heezle geezle fo' sheezle\n\nKeak Da Sneak (Chorus)\n\nThe Alchemist (Hook):\nYo, eh I'm off the chain; na dawgy, I break the cable\nI'm mentally retarded; straight disabled\nI eat off the budget and rape the labels\nDJ spinning records; oh I break the tables\nPull a plug on them; na dawgy, I put the thug on them\nPut lumps on them; throw punches without the gloves on them\nI run on them; roll up and pop the trunk on them\nI stun on the;, shit on them and dunk on them\nThey can't carry the weight; I drop a ton on them\nI set it off; yeah, I'm dropping the one on them\nI'm straight cash; you can put the funds on them\nI guns on them; na dawgy, I bang the drums on them\nIt's like we throwin' off, the lights is out, the phone is off; I'm going off, I'm pulling off, hitting them off\nWe rollin' off; I'm peeling off, killing them off, I break them off that\n\nKeak Da Sneak (Chorus)"}], "artist": "Keak da Sneak"}