{"songs": [{"year": null, "title": "Ground Control", "image": "https://images.genius.com/53b6cf23d3b9c3491d5918ea4087005b.640x640x1.jpg", "lyrics": "Sad Sad Monster. Turn those horns up\nBurn the back roads. Find your way out\nTroubled love life... give the gift of yourself...\nTo the dark\n\n[Hook]\nGround control to lost soul...\nGround control to lost soul...\nIf you copy...\nCome in lost soul\nCome in lost soul\nWe lost contact\nAbort Mission\nWe lost contact\n\n[Verse 1: Sage Francis]\nDon't these dead streets back you into bad corners?\nCurbs crumble once you park your ass on em\nParking meters overdue. Violation goes unnoticed\nOut of all of those who tried to travel off road... you've come the closest\nSo I grant you this toast:\nTo all of those who showed promise and never made one that broke\nI salute you. I never meant to lose you\nBut I know this road don't go where it used to\nI've got a map that looks a lot like your veiny arms\nIt ain't to scale, but it details the name of this song\nAnd this one is called \"Cancelled Flight Blues\"\nA manipulative twist I think that Manson might've used\nBut poor musicians come a dime a dozen\nAnd you're the eggman, a flash in the pan, and your yolk is running\nWho broke that hard outer covering?\nSome chick in your mix you couldn't level with, headless horsemen?\nCome the suffering... go the direction...\nFollowing air currents, but it was my drift you were supposed to be catching\nFish nets collect dust in stagnant water\nI haven't heard back from you since the gag order\nPussycat got your tongue?\nPick it up up up up up up up (end communication)\n\n[Hook]\n\nBad, bad actor. Flip that script now. Come on!\nYou cock. Bust my shit! Woaaah!\n\nYou're a lint ball who moves on the whim of the wind\nConfused flexible movement for freedom\nIf the walls you keep bouncing off of are closing in\nTheres only so much time before your rhythm gets broken\nI could hear it speeding up before we lost signal\nIt caused a ripple effect. Rings on the radar would intersect\nNow your fingers are off limits;\nI can't hold your hand longer than your attention span\nThe two way street we are supposed to meet on is just\nA one-way dead end. You're some of my best friends\nPress send. Where are the donuts you've been lost inside?\nTow trucks you've been forced to ride? Hold ups at the borderline?\nCustoms will confiscate costumes\nEat my dust and get exhausted, force-fed my car fumes\nI can't afford the duty tax, so expensive\nCome off your head trip and visit where your old friends live\nYou're sensitive like the time (critical!)\nYou swore to God on a lie and didn't die (you're invincible)\nKiss the pavement, make love while cars spin\nBe careful when the unsafe sex parade comes a marchin'\nThey've got full body condoms to carry you off in\nI wish I told you that while we were still talking\n\n[Hook]\n\n[Live performance sample]\nI'm a motherfucking Bill O'Reilly of this hip hop shit!\nI want you to give it up for my DJ No Spin Zone!", "album": "A Healthy Distrust"}], "artist": "Sage Francis"}