{"songs": [{"year": null, "lyrics": "[Chorus]\nBig baby D.R.A.M. I'm from Hampton baby\nAnd I'm never around there\nSo I might sound crazy when you hit me up\nAll about my cakes and not coming through is nothing new\nOh this is something to do nah ok then\nBig baby D.R.A.M. I'm from Hampton baby\nAnd I made my way out I might sound crazy\nHow In Malibu I had a studio session\nWith this bearded dude named Ricky Rube\nI bet you met him too ok then\n\n[Verse 1]\nThey threw my mattress out\nWhere do they stay\nThey fluffed their pillow up\nAnd begin to lay\nThen they would close their eyes\nAnd pull over the sheets and on the subject to me\nAnd slowly went to sleep\nBig baby D.R.A.M. I'm from Hampton baby\nAnd my family still there some looking at me crazy\nBecause some of them they ask me how my day job\nIs coming along and they say songs won't work it off\nOk then they know They really know\nThey couldn't figure Now they treat me different\nThe same Hampton nigga Big baby drama from Hampton baby\nWhere the chip on my shoulder that’s been trying to outweigh me\nIt's a heavy shit trying to keep a level head with steadiness\nGiving you no reason for forgetting this ok then we\nChange hand this ain't for the better\nWomen weeding weather I want to cut a joint with Kendric\nBut it must be special I step into places all dredded like\nHe must be ghetto these racist faces looking\nLooking at me don't mind I’m fucking settled\nIf you don't come back on the temples of my shoulders\nAny minute niggers might tip over and then it’s over\nI go over shit and spending time with all my niggers\nAnd my team some are bogus some just want\nSome are colour blind it's only green\nI use to see red like it was blood in my eyes\nBad bitches blow the dust out my eye\nAnd then some rubbing their thighs\nThink of yours that was off limit or not\nOr you turned on because your boy winning\nTough loss coast to coast with it like curve ball\nGive me four weeks then I'm splurging ball\nHigh school reunion and I'm foreign thats ball\nSmall fraction of the cash I got from touring\nVery important all in I can't forget where I’m from\nI'm a Hampton nigga I'm a Hampton nigga\nI said all in all I can’t forget where I’m from\nI'm a Hampton nigga  I'm a Hampton nigga\nI'm a Hampton nigga  I'm a Hampton nigga\nI'm gone", "title": "Okden", "album": "Gahdamn!", "image": "https://images.genius.com/7f6c63dd4e9b985b78c8d31c024697e3.640x640x1.jpg"}], "artist": "DRAM"}