{"songs": [{"year": "2017-11-10", "album": "Engraved In The Game", "image": "https://images.genius.com/d2a4d928684e2efa403cd26a8dc80fa5.1000x1000x1.jpg", "title": "One Wish", "lyrics": "[Verse 1]\nKerser’s back, I’m back again\nYou heard off a friend I was relapsin’\nThat’s not far off the truth being truthful\nFelt suffocated, leader of the youth\nWhat the fuck? Who’s statin’ that?\nI just wanna rap and leave it at that\nBut you can’t at the hype that I’m reachin' all right\nAnd it’s kind of my life, did I teach them the right\nWay or the wrong, were the drugs too much?\nOr was talking bout jail and my buds in cuffs\nNot enough honesty for the cunts who judge\nNumber one on the ARIAs, shut that up, hmm\nSomething up there\nNever really care but the shit is unfair\nThat’s just life in a general sense\nFight on, aim up, what you recommend?\nYou heard my opinion like fifty times\nI get goosebumps before the ink would dry\nThe realest vibe you can ever find\nPop pill rewind then I pop, rewind\nWhat I got is my, pride in my daughter\nAnd I got April, who would have thought a\nHigh school couple what perfect timing\nAnd twelve years later the birth of Diamond\nThat’s all you get about my daughter bro\nBorn Feburary this year, all I know\nIs I never felt love like that before\nThey said I had a break but I’m back for more\nIt’s why it’s so dangerous, going against me\nSwear it on God there is no other EMCEE\nDone what I done, it was mad intense\nSorry baby Diamond, go back to bed, Dad’s stressed\n\n[Hook]\nOh the Kers has made it\nHis dreams true, they hatin’\nI take flight with one hit\nI did this off one wish\n\n[Verse 2]\nTake you back to my battling days\nThe young ABK shit, we started to faze\nYou can ask anyone from Greels to 6\nWe used to rock to them battles, we were real as shit\nFive years before that, we were still raw lad\nYoung cunts down hanging out where you score at\nTable turns, I’m the one you used to call Chat\nNow I’m number one, what the fuck we gonna call that?\nFall back, let me get through my\nRhymes 'cause I’m feelin’ extra hype\nAin’t nobody ever dropped a track this real\nBut in my own head, it’s a drastic feel\nI attack this ill with a packet of pills\nThat I happened to steal from an addict, it’s real\nDon’t be forgot where he put the pack\nMediacted real slow, let me push it back\nTo a time where the people doubted Kers\nA long time before they were shouting “Kers”\nI was broke as fuck, sitting on the train\nWith a few mates plottin' on the money game\n'Cause the rain outside and they couldn’t write\nRandom thoughts are hooked in my\nMind when I process like I’m a robot\nStaying my grind and a win and you know Scott\nSet a tone for the street to rap\nThey stole my whole style, I don’t need it back\nHow many times do I have to prove\nThat I will not lose and you have to chose\nWhat’s right from wrong? I’m not your answer\nI don’t even know if I got the answer\nLet's fly away, to a brighter day\nKers one did it, now you’re wide awake\nLife’s great\n\n[Hook]\nOh the Kers has made it\nHis dreams true, they hatin’\nI take flight with one hit\nI did this off one wish"}], "artist": "Kerser"}