{"artist": "Ace Hood", "songs": [{"title": "80's Baby", "album": "Trust the Process II: Undefeated", "year": "2018-05-11", "lyrics": "[Hook]\nEver since I came into the game\nI been goin harder in the paint\nEver since they heard about the name\nThey know who gon put out with the flame\nEver since I'm in my own lane\nAll you niggas start to sound the same\nEver since I started with the reaI\nI can never understand a lame\nWhat is real? what is fake?\nYou be wise, nigga snakes\nBorn in May, 80 baby\nOn a level eighty eight\n\n[Verse 1]\nLegendary, very scary\nI don't think that goofy shit is necessary\nI do not want to be a part of ordinary\nBlood of Jesus, saw me born, son of Mary\nIn here whippin' like I'm gold with culinary\nAnd he's in it kickin' shit like Vinatieri\nOh my goodness\nI get that feelin' sometimes\nI don't wanna fuck with people, just this business of mine\nYou can't come into my space with all them negative vibes\nAin't no intoxicating my circle, we gon sever them ties\nJust my policy, no apologies\nAll one hundred that's why real niggas follow me\nEver since I stepped into the light\nI don't ever buy into the hype\nNever get too low or get too high\nNever let them cover up your size\n\n[Hook]\nEver since I came into the game\nI been goin harder in the paint\nEver since they heard about the name\nThey know who gon pull up with the flame\nEver since I'm in my own lane\nAll you niggas start to sound the same\nEver since I started with the real\nI can never understand a lame\nWhat is real? what is fake?\nYou be wise, nigga snakes\nBorn in May, 80 baby\nOn a level eighty eight\n\n[Verse 2]\nLegendary, Tyler Perry\nMake a movie show to shrug in like I'm Uzi\nSmoking kush, got absinthes all in my Jacuzzi\nRight on my lip, I'm thinking \"girl, mama juicy\"\nI understand how I don't pull from that fruit tree\n...\nI'm playing Lauryn Hill when she was with the Fugees\nAnd when they come to doin' this I feel like two-three\nDrop a classic on this niggas they come back 'round\nWe can hear you pussy niggas in the background\nTrust the process\nJust digest this higher level ways\nIt's been in my DNA\nUndefeated, I'm the great (God)", "image": "https://images.genius.com/b3d629c95fe2a0b0f4f3d20998c37c61.1000x1000x1.jpg"}]}