{"artist": "C-Rayz Walz", "songs": [{"title": "Barb Wire Fences", "album": "Limelight (The Outroduction)", "year": "2003-02-03", "image": "https://images.genius.com/1c7f1f5dcacc3e1fa80d314a70a561d0.600x600x1.jpg", "lyrics": "[Hook: C-Rayz Walz]\nMCs, your life's on the line\nYou might as well shoot the free throw while the ref holds the 9\nIf you miss, the clip lifts your brain through the twine\nWith a bucket on your mind, you kick the illest rhyme\nAnd though you run out of it, you still have time\nAnd if you hit, you might get to shine\nBarb wire fences.  Word up.  Raise the level of the cut\nNow you ducking the sentence—cha-pow\n\n[Verse 1: C-Rayz Walz]\nMy lines illuminate.  Can you relate?  I'm Tron\nFor you to get signed, I would have to break your arm\nThe Sun Cycle strictly repping\nBeware, your career could be gone in 60 seconds\nStronghold number 5.  It's nothing to fear\nYou better off sword fighting a Musketeer—yeah!\nNobody gave me nothing, so I ain't having it\nBut you don't hear me, though—I might as well be speaking Arabic\nGoing out like a terrorist, the stage is sin\nI write bomb music with grenade pens/pins\nLike margarine, I do go against the grain\nFor you to feel Smartha, you would have to touch my brain\nYou don't know me.  Don't speak my name in vain\nI'm C-Rayz, keeper of the flames, explain the difference\nOf MC and singer\nYou internet head (Shh), don't come out your fingers\n‘Cause I reach through computers and slap kids\nShut your cipher down quick like Theo Ratliff\nThe Pied Piper running with weird fiddlers\nMaking crowds throw they hands in the air like Hitler\nBut I'm not Jewish—I never been gassed up\nI'm a runaway slave with asthma holding a pump\nAnd while y'all front and play the movie role\nLines I write be tight like insect booty hole\n\n[Hook: C-Rayz Walz]\nMCs, your life's on the line\nYou might as well shoot the free throw while the ref holds the 9\nIf you miss, the clip lifts your brain through the twine\nWith a bucket on your mind, you kick the illest rhyme\nAnd though you run out of it, you still have time\nAnd if you hit, you might get to shine\nBarb wire fences.  Word up.  Raise the level of the cut\nThe mentality’s endless.  Hmm...\n\n[Verse 2: C-Rayz Walz]\nWell this ain't fantasy island—my family's wiling\nTo the violins, tryna explain humanity's violence\nYour brain (Silence) activates, screaming \"The toast is coming!\"\nI take aim and I'm seeing your ghost is running!\nWe can start at men in arms, end at wrist bone fractures\nMaster the universe, cause natural disasters\n“Top of the Food Chain,” “Keep, Keep, Keeping It Raw”\nShowing traces of death, flowing to sketches of Skeletor\nHigh “Degrees,” put “The Smackdown” and kill a vulture\nHandle B.I., but see, I fulfill a culture\nThe fine line between sign and divine mind crystals\nBlow spots, hit the bullseye with live rhyme missiles\nThe realm where four pockets hold eight items\nExplode off the top of the brick (Spit!) and mic fight them\nExcites ‘em with the line of the century\nOver your head like barb wire fences in penitentiaries\nMention me, eventually, avenging the energy\nOn point.  Darts accumulate in the breast vicinity\nStuck in the trenches, the god fires a sentence\nTwice as broke as you are—that makes me relentless\nThe cipher’s an oval office—blasphemy's been barred\nThe true support while few report like Ken Starr\nSo the righteous will be what the wicked they'll see\nMy mentality's roundhouse—come kick it with me\n\n[Hook: C-Rayz Walz]\nMCs, your life's on the line\nYou might as well shoot the free throw while the ref holds the 9\nIf you miss, the clip lifts your brain through the twine\nWith a bucket on your mind, you kick the illest rhyme\nAnd though you run out of it, you still have time\nAnd if you hit, you might get to shine\nBarb wire fences.  Word up.  Raise the level of the cut (Bring that back)\nNow you stuck in the trenches, defenseless (Don’t!)\n\n[Outro: C-Rayz Walz]\nDon’t panic now.  C-Rayz Walz.  Face on the bars, punching yellow pillows ‘cause y’all soft.  Panik, Molemen, Stronghold, BK.  You know how we, DJ.  The intro is leaked—barb wire fences early for you"}]}