{"songs": [{"lyrics": "[Hook]\n\"Jealous niggas on the dick\" - PMD\nI know all y'all\nWhere all y'all?\n\n[Verse One]\nLet's take this back like Le Tigra shirts\nWith the flannel\nMe and my cousins going toe to toe over switching the channel\nHad to regulate the TV\nI was trying to watch, couldn't miss Ralph McDaniels video music Box\nI used to sit there, absorbing the shit, something amazing\nFly gear, sneakers, rocking the ropes, I was gazing\nShould've listened to my mom dukes kid, then I started praying\nAll the best rappers is winding up dead, nahmasayin?\nIn 24 years of my life, I never thought I'd get cut with a knife\nShould've never went to The Tunnel out that night\nGot caught in a fight\nNiggas went to jail, what the hell?\nConspiracy on the god Agallah, wait till the fucking album sell\nRinging the bells\n\n[Hook]\n\n[Verse Two]\nI got a hard working family, my aunt serving in the Army now\nI got a call from [?] they turn my application down\nWe use the oven for heat\nAnd I was cooking bars of food for my neighbors\nThat's how it is in Brooklyn\nThank the good looking\nWhen the electricity ran out\nI put the extension cord right up to my man and them house\nWe gon' throw away the pissy couch and get a new one\nMore burners more gats to make you and your fucking crew run\nLike Sonny Carson when he got beat with sticks and poles\nThe Devil wants to take my soul, he hates when I roll\nI'm in control\n8-Off, I never lost\nHow the fuck y'all gon' focus with your Polaroids off?\n8-Off\n\n[Hook]\n\n[Verse Three]\nTo my Puerto Rocks and my negros\nDon't get my wrong\nI'm gonna discover new flows like I'm Ponce De Leon\n8-Off Assassin\nKick it for the rugged not the fashion\nBeats and rhymes are my passion\nOne on one I blast on\nAin't nobody to hate, but shit hate me all\nYou got jams see it stalled, be prepared to fall\nSilent off the corner poles screaming out your death\nNo more time left\nHurry up and take your breath\nIt's pretty fun going out with a bottle of Henny and my gun\n15 shots inside of you' chest and you're still not stunned\nTried to run\nAnd led [?] what way to turn\nLean down with eight rounds\nBlood clot ya done done\n\n[Hook]", "title": "I Know All Y’all", "album": "I Know All Y’all - Single", "image": "https://s3.amazonaws.com/rapgenius/220px-Agallah_2011.jpg", "year": null}], "artist": "Agallah"}