{"songs": [{"title": "Black Rage", "album": "Lauryn Hill: Unreleased", "year": "2012-10-29", "image": "https://images.genius.com/4937060d163a5e35ce175f4df81f6c73.722x722x1.jpg", "lyrics": "BLACK RAGE is founded on two-thirds a person\nRapings and beatings and suffering that worsens,\nBlack human packages tied up in strings.\nBLACK RAGE can come from all these kinds of things\nBlack Rage is founded on blatant denial\nSqueezing economics, subsistence survival,\nDeafening silence and social control.\nBlack Rage is founded on wounds in the soul!\n\nWhen the dogs bite\nWhen the beatings\nWhen I'm feeling sad\nI simply remember all these kinds of things\nand then I don't fear so bad!\n\nBlack rage is founded: who fed us self-hatred\nLies and abuse, while we waited and waited\nSpiritual treason, This grid and its cages\nBlack rage was founded on these kinds of things\n\nBlack rage is founded on draining and draining\nThreatening your freedom, To stop your complaining\nPoisoning your water, While they say it's raining\nThen call you mad for complaining, complaining\nOld time bureaucracy drugging the youth\nBlack rage is founded on blocking the truth,\nMurder and crime, Compromise and distortion\nSacrifice, sacrifice who makes this fortune?\nGreed, falsely called progress\nSuch human contortion,\nBlack rage is founded on these kinds of things\n\nSo when the dog bites\nAnd the beatings\nWhen I’m feeling sad\nI simply remember all these kinds of things and then I don’t fear so bad\n\nFree enterprise, is it myth or illusion?\nForcing you back into purposed confusion\nBlack human trafficking or blood transfusion?\nBlack rage is founded on these kinds of things.\nVictims of violence both psyche and body\nLife out of context IS living unGodly\nPolitics, politics\nGreed falsely called wealth\nBlack rage is founded on denial of self!\nBlack human packages tied and subsistence\nHaving to justify your very existence\nTry if you must, but you can’t have my soul\nBlack rage is made by unGodly control\n\nSo when the dog bites\nAnd when the beatings\nAnd I’m feeling so sad\nI simply remember all these kinds of things\nAnd then I don’t fear so bad"}], "artist": "Lauryn Hill"}