{"songs": [{"album": "Misery Loves Kompany", "image": "https://images.genius.com/d568b86ce102e78c9c49f201c1a48234.953x953x1.jpg", "year": "2007-07-17", "title": "Fan or Foe", "lyrics": "[Intro]\nAy ain't that the nigga Tech N9ne, man\nYeah, that's that nigga\nHe be rappin' shit, yeah\nHe cool I guess\n[?] a little bit\n[?]\nAy, ay nigga ain't you Tech N9ne nigga?\nYeah, what's up man?\nAy, that new shit cool\nThat shit hot [?]\nReal life bro that shit hot\n\n[Verse 1: Tech N9ne]\nBack up wait a minute, why you lookin' at me like that?\nDo you really wanna trip or you flippin' the script?\nDo you wanna rap with a nigga or we bangin' suwoop in the whip?\nI don't ever want us to come to bussin' off shots\nNigga misery can't produce enough cops\nAnd I don't know if you wildin' or what\nAll you wanna do is freestyle in the cut\nFan or foe, (foe) I don't really know, (know)\nOff at the show, (show) niggas they know, (know)\nWhat it looked like was a good night\nNow it's lookin' like a motherfucker wanna jack all me dough\nCome up to me; my kids and me chillin'\nBetter think twice I'm a 56 Villian\nBut they wanna talk about a ditty, when I did it\nMan, I thought I was about to get a bullet in a minute\nYou should be careful how you walk up on us\nGot a bonus for all opponents if they want it\nI know they wait for Tecca Nina moments\nFan or foe they be poppin' up and hit you, don't it?\nWe don't know if they be trippin' or not\nProbably 'cause all of us live on the block\nWhen you rappin' niggas want what you got\nTough as ever when you up on the top\nShow some respect when you approach me\nDon't you be muggin' me\nMight have that drug in me\nPluggin' a nigga for merely shruggin' me\nAin't nothin' wrong with people peepin'\nGeekin' whether man or ho\nBut a grammar so bamber stammer\nI don't know if you fan or foe!\n\n[Hook: Krizz Kaliko]\nIf he trippin' we can go\nPeepin' like he seekin' dough\nWanna throw or wanna flow\nI don't know if he fan or foe\nI don't know if he fan or foe\nI don't know if he fan or foe\nEasy how you speakin', bro\nI don't know if you fan or foe\nIf he we can- we can go\nPeepin' seekin'- seekin' dough\nWanna throw or flow- flow\nI don't know if he fan or foe\nI don't know if he fan or foe\nI don't know if he fan or foe\nEasy speakin'- speakin', bro\nI don't know if you fan or foe\n\n[Verse 2: T-Nutty]\nNow be easy how you speakin', bro\nT-Nutty the young floheakin' though, don't be jokin'\nShow your ass and you'll be walkin' off with it broken\nRun up on motherfuckers in the open\nMakin' them shut up wolfin' with that ho shit\nCut the shenanigans, nigga you fakers are mannequins\nThinkin' you slicker than lotion?\nBack up wait a minute, why you lookin' at me like that?\nI'm just a nigga with a little bit of fame\nBut if you get to trippin', then I'ma givin' 'em my gang\nNever catch me slippin', you can get it out your brain\nMayne, fan or foe\nSucker nigga tryna get his hands on my dough\nBut if you really want it come on and try to get on it\nYou can be the opponent chokin' with hands on your throat\nMan, I'm a loc, one to pack round from Sactown\nBetter watch out for the blow-blow\nBlackout, blackout, blackout, blackout, brrah\nStay with my killers that be knockin' noodles\nWakin' the game up like a cock-a-doodle\nThink you gon' catch me slippin' at a show\nNutt factors lookin' like they Shaka Zulu, I see through you\nWith all the fake shit, you filled with hatred\nHopin' and wishin' you was my replacement\nComin' so vicious, you gon' have to face it and try to taste it\n'Cause I laced it like a tennis shoe when I been a fool\nLike C-Bo, Lynch and X-Raided but this is a different interview\nFactors up nigga\n\n[Hook: Krizz Kaliko]\nIf he trippin' we can go\nPeepin' like he seekin' dough\nWanna throw or wanna flow\nI don't know if he fan or foe\nI don't know if he fan or foe\nI don't know if he fan or foe\nEasy how you speakin', bro\nI don't know if you fan or foe\nIf he we can- we can go\nPeepin' seekin'- seekin' dough\nWanna throw or flow- flow\nI don't know if he fan or foe\nI don't know if he fan or foe\nI don't know if he fan or foe\nEasy speakin'- speakin', bro\nI don't know if you fan or foe\n\n[Verse 3: Krizz Kaliko]\nIt may not be a bad idea if I never go home again\n'Cause niggas lookin' at me like I'm a chicken dinner\nLookin' back at niggas like I'm Shauntay Henderson\nAre you a foe (foe) so I gotta carry the fo', (fo')\nI think they recognize me, I don't really know though\n'Cause they walkin' up fast and givin' me doubt\nAnd when they pass me askin'\n\"When yo new shit come out?\"\nMe and my dawgs at the picture house\nAnd they be huddled up and got me thinkin' pick one out\nI pick the nigga bigger than me, pull the trigga to see\nIf he tough enough, make 'em what he tryin' to be\nBut he a fan though, don't know how to approach ya, vulture\nGet to close how I posed ta\nPosed to know the difference from fan or foe when you muggin' though\nCan't even live in peace and when I eat with my peeps in the place\nYou in my face with yo mixtapes\nAnd if I ain't tryin' to listen to it we get into it\nIf I'm off of that fluid then it's time to do it\n'Cause a nigga from out south out the mouth\nYo girl be lovin' me, givin' me mouth to mouth\nAnd it ain't fair that the music got her doin'\nWhat she wanna do when you ain't there\nAnd you too salty softy\nWhen you see me out you betta get up off me\nIf ya girl actin' a ho I'll turn a fan to foe\n\n[Hook: Krizz Kaliko]\nIf he trippin' we can go\nPeepin' like he seekin' dough\nWanna throw or wanna flow\nI don't know if he fan or foe\nI don't know if he fan or foe\nI don't know if he fan or foe\nEasy how you speakin', bro\nI don't know if you fan or foe\nIf he we can- we can go\nPeepin' seekin'- seekin' dough\nWanna throw or flow- flow\nI don't know if he fan or foe\nI don't know if he fan or foe\nI don't know if he fan or foe\nEasy speakin'- speakin', bro\nI don't know if you fan or foe"}], "artist": "Tech N9ne"}