{"artist": "Angie Martinez", "songs": [{"title": "Take You Home", "image": "https://images.genius.com/fa4abffe2c6164a010ae6b833f491d67.1000x981x1.jpg", "album": "Animal House", "lyrics": "[Intro: Angie Martinez]\nYea... wooo!\nUh, the animals are here\nYea, Angie, Cool & Dre\nUh alright, yes sir\nHere we go, yo, c'mon\n\n[Verse: Angie Martinez]\nI got a call from my girls around eight\n'Bout that Friday spot\nRound 12 hit the highway stop - I need gas\nCar behind me, on my ass, speed past\nTurn the radio on it's my joint\nGot me amped, I need to dance\nPull up in the truck and it ain't my man's\nYou screaming \"hey yo\" you don't got a chance son\nYou are speaking a language I don't understand\nKnow the dude I hang wit, I don't hold his hand\nCause me I'm free to choose\nIt's possible to leave wit you\nWhen we get through, I drive passenger seat for you\nLet's ride, at one I arrive\nWalk past the line damn his ass is fine\nSome guy now we up in the spot, watch\nPlace hot, couple of bottles, champagne popped (yeah yeah)\nAnd that's how we doin' it now\nI'm scheming while the DJ's movin' the crowd\n\n[Hook: Kelis + (Angie)] (2x)\nI was wondering\nIf I could take you home (if I could take you home)\nBut would you still love me baby (would you still love me babe)\nIf I could take you home\n\n[Verse: Angie Martinez]\nIt's around 2 AM, the mood is trend\nThe club is snug, I see him watching, love is love\nCaught him when I looked up, gave him a glance\nPromote-a-Chick walked over while I'm shaking her hand\nI'm looking over her\nSorry but I'm waiting for this man\nIs what I told her, so she could leave\nNo breaking up my plans\nNo time for talking about shows\nOr dates that I could host\nDamn, he walking over to me, they breaking out the jokes\nMy girls laughing, they see me already imagining\nHe whispered in my ear\nWould I dance with him? I answered him\nHe took my hand with him, dancing close\nI turned around and gave him my back, he passed a smoke\nHe put his hand on my hip then my stomach, he must want it\nAnd I was really just 'bout to leave, his clique fronted\nLike they don't see that they man bout to tell 'em peace\nAnd to think I wasn't even gonna go out, see?\n\n[Hook]\n\n[Verse: Angie Martinez]\nAll I need is my lip gloss, ID, gum and I'm straight\nEspecially if it's Envy in Bungalow Eight\nWe making it hot on the dance floor today\nBut my girls wanna leave cause there's nothing to take\nNothing to meet, spot dead, nothing to see\nThen we all agree that we won't leave\nCause some spots the papi's still come at three\nThat's when I tell the DJ to run that please\nHe dancing behind me, I feel what's under his jeans\nAnd I had one too many so I'm under his scheme\nI mean I'm cool and the gang, the music is playing\nThink I found what I'm looking for\nAin't no purpose in waiting\nAlmost time for breakfast\nStanding by the coat checkers\nLooking for my parking lot ticket, that's it!\nAnd this night just ended\nCan't say with who, what, or where but it'll definitely be remembered\n\n[Hook]\n\n[Outro: Kelis]\nWould you be my boyfriend? {3X}\nFor tonight only\nWould you be my boyfriend? {3X}\nFor tonight", "year": null}]}