{"artist": "G Herbo", "songs": [{"title": "Boww", "album": "Still Swervin", "year": "2019-02-01", "image": "https://images.genius.com/c9afa7b8044e0a1dd4a8eba6baf78768.1000x1000x1.jpg", "lyrics": "[Intro]\nUh\nIt's, it's that ratchet shit, uh\nAnd that gang shit\nDJ Victorious with me in the buildin'\n\n[Verse 1]\nI'm a bad boy like an old Piston\nMove around in Mo-Town like a Detroit Piston\nMarble floors in the bathroom, that's how I'm pissing\nTurn the bedroom into my closet, not to mention\nFirst grade, bitch was juking on me, got detention\nWho knew I was gonna be a rapper? I've been hittin' some bitches\nMillions was on my wishlist, I got tired of eating fishsticks\nI ain't gotta do shit for nobody, I don't give a fuck 'cause I'm rich, bitch\n\"Is you sucking some dick?\"\nAlright, I'm finna book the Ritz then\nAfter I'm finished I'm finna spin\nBitch, you ain't finna get hit again\nBitch, ain't it the weekend? (Ain't it the weekend?)\nGon' and hit the club with your friends, why you in here tweaking?\nI'm 'bout to hop in the car with my mans, I'm goin' back in here reekin'\nFuck around, gon' hit this lil' other bitch, I'm goin' back in here stinkin'\nI thought this bitch gon' have me busting, I ain't even 'posed to be blinkin'\nBitch wanna come up there, I be like fuck it, I don't really even be thinking\nSmokin' KK, Sherm, and Gelato, got my eyes chinky (Got my eyes chinky)\nI just don't eat swine, bitch, I am not a vegan (Not a fuckin' vegan)\nI look like a star, boy, I am not the Weeknd (I ain't the Weeknd)\nAnd I don't got no heart, boy, I am not a deacon\n\n[Chorus]\nI'm like bow, bow\nI'm like, I'm like bow, bow\nI'm like bow, I'm like bow\nI'm like bow, bow, bow\nI'm like bow\nAll my chains like blaow\nBitch, my chains like blaow\nTwo hundred thou', make you look like, \"Wow\"\nReaching out like, bow bow bow\nI'm like, I'm like blaow\nI'm like blaow, blaow\nI'm like blaow, I'm like blaow, I'm like blaow, blaow, blaow\nI'm like blaow, blaow, blaow\nI'm like blaow, blaow, blaow\nI'm like blaow, I'm like blaow, I'm like blaow, blaow\n\n[Verse 2]\nNigga run, we hit your back\nYou know lil foenem into that\nHooded up, they in the black\nHop out either side, I'm in the back\nBeamed up, I'm in the 'Raq\nIn the alley, I'ma sneak up like a cat\nYou only got one life, remember that (Remember that)\nLeave a nigga body froze, oh, it ain't December yet\nI paid sixteen hundred for a pole, this the kimberjack\nAnd I got a Kel-Tec, got a baby MAC\nGot a rifle, that bitch too big, wish I could take it back\nAnd I don't even wanna keep it in the house like that\n'Cause I don't even be in the house like that\nPlus I ain't even gon' set up my spouse like that\nShe got some lil' shit she can cock back\n\n[Chorus]\nI'm like bow, bow\nI'm like, I'm like bow, bow\nI'm like bow, I'm like bow\nI'm like bow, bow, bow\nI'm like bow\nAll my chains like blaow\nBitch, my chains like blaow\nTwo hundred thou', make you look like, \"Wow\"\nReaching out like, bow bow bow\nI'm like, I'm like blaow\nI'm like blaow, blaow\nI'm like blaow, I'm like blaow, I'm like blaow, blaow, blaow\nI'm like blaow, blaow, blaow\nI'm like blaow, blaow, blaow\nI'm like blaow, I'm like blaow\nBlaow, blaow\n\n[Outro]\nNigga, blaow\nThat's the goddamn, the signal\nSignal to the, signal to the\nYou know, we done blaowed some shit\nYou know this shit blaow, blah-blaow-blaow, gang shit\nYou feel me?"}]}