{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "Go Royals. Rest in peace BB King. KC Kings\n\n[Mac Lethal]\n\nCheck it out now\nHere I come with the hype flow\nHear the drums and I might go\nBang!\nI accelerate in centerfield when\nI be running for the pop-up fly\nYou're thinking I'm like Lo Cain\nHere's a preview\nMy name is Mr. Mac Maniac Lethal\nI'm like Dyson when I'm dicin'\nOr Walter White with a ciggy full of Ricin\nThat's what speed do\nI'm gonna hit them with the EQ\nI'm Mike Moustakas playing third base in my light blue dockers\nHitting to your opposite side so many times\nThey gotta find two doctors\nField of dreams, and I'm a white dude: Costner\nThis is Kansas City how we do it how we live it\nGonna rock it gonna battle gonna give it\nEvery single ounce of energy we got\nWe getting crazy getting loud\nThey're making Jordan's\nBut they gotta make some light blue Hosmers\nWe lead the pack, man in May weather\nA way better fight than Pac-Man and Mayweather\nWe probably gonna bite them out of anger\nWe don't really care about Detroit, man\nTigers are endangered\nGordo got the platinum glove\nJump so high he could catch a dove\nIt's an act of love\nRyan and Hudler's back\nYou can't sneak a piece of cheese by a hungry rat\nMorales up to bat the ball left the park\nHererra, Davis, Holland killing it no question mark\nGonna throw up an extra heart\nLike I'm Alcides Escobar playing extra hard\nLook, I don't smile when I pitch\nI make the Yordano Ventura face\nBut you got them Kylie Jenner lips\n\nPaulo triple-o he's making music with the bat\nLike it's Apollo's piccolo\nI hope you're following the flow\nCuz now we're winners\nSo I'll soak you like I'm Salvy with the gatorade\nThey think that' I'm a joker\nBut I'm actually the ace of spades\nI'm picking up the bat and hitting homers out the stadium\nThe ball is flying by your head so fast it make your neck twist\nOmar Infante and Alex Rios\nAnd my main man Morales A.K.A. Cubano Breakfast\nMy head isn't bolted\nI'm going lights out like I'm Edinson Volquez\nIn a Monarch's uniform\n18th and Vine at the Negro League Museum\nFor Buck O'Neill we gotta rock hard and do it for him\nGuthrie and Vargas are pitching the stones\nSalvador Perez is sitting at home\nAnd even though he's putting on perfume before he plays\nIt doesn't matter cuz we also got Christian Colon\n610 - sports radio clicked in, gonna listen\nTo the drive and the country mart call in show\nMan I'm tall with flows\nChris Young, boy 6'10\nSay Denny Matthews never gives me bad news\nNever thought a team could ever make the city that blue\nWith the best bullpen how can they survive?\nWe'll be champs until 2085 we live", "year": "2015-05-23", "album": "YouTube", "title": "Kansas City Royals Insanity Rap"}], "artist": "Mac Lethal"}