{"artist": "Pastor Troy", "songs": [{"album": "By Choice or by Force", "title": "Crossroads", "image": "https://images.genius.com/a4d00aa1bcfff32d978eb85eb57fce63.500x500x1.jpg", "lyrics": "[INTRO:]\nYea... yea... this PT... nigga... representin my DJ SQUEAKY!(SQUEAKY!)... nigga...\n\n[Background:]\nI'm'a dedicate this song to the gone\nAll my niggas that left ya live on\nI'm'a dedicate this song to the gone\nI'm'a dedicate this song to the gone\n\n[Foreground:]\nWe live forever baby... (put ya lighters up)\nY'all will never die baby...\nYou live forever baby... (put ya lighters up)\nYou live through me...\n\nYea... Yea... [random yea's throughout the next part]\nWhat's up John Reed? Uncle Sweet... Uncle Randy(What's up sweet? I see you baby!) Gangstas nigga! Randy Van Troy! Rest in peace gangsta! Yea! We love you gangsta! Rest in peace gangsta! I know y'all niggas lookin down on me!\n\n[VERSE:]\nI'm'a dedicate this song to the gone\nAll my niggas that left ya live on\nNow Everybody! I need to put ya lighters up!\nWeLL UH HUH! I need to put ya lighters up!\nI done lost a lieutenant, a mother lost her son\nA brother lost a brother, and that's not including others\nThat you touch through your personality\nAnd since I lost you the devil breathin'[?] after me\nBut I'm'a prevail from ATL\nAnd know that I'm missin' you like hell(like hell)\nI'm talkin' bout a hood tragedy nigga\nAnd everybody always askin me nigga\nI love this nigga, we ate together\nThe same fork off the same plate together\nI wish I would've been there when they came\nI would've left 'em in a flame\n\n[HOOK: x2]\nBut I'm'a see him at the crossroads\nI got some blunts and some liquor\nSack of Timmy D and some bitches I'm'a picture(or pitcher I'm not sure)\nI'm'a see him at the crossroads\nCuz that's my mothafuckin' nigga\nSo he won't be lonely(lonely)\n\n[VERSE:]\nHit the club, hoes askin' where you at\n\"Chillin' with the father\" I reply back\nSack after sack after sack after sack\nThey ain't even have to do ya like that\nBut niggas full of shit so I don't fuck wit 'em\nNiggas lookin crazy, I get right with 'em\nThey killed my dog, They killed my ace\nForever I miss ya, Ya can't be replaced\nI wish I would've been there when they jacked\nI'd blew 'em out the door with that mothafuckin' mack [imitating gunshots vocally]\nI'd walk blackbottom for my mothafuckin' dogs\nLook him in his eyes, leave him in the fog\nI love ya unc, I miss ya man\nAnd I can't wait to grab ya hand\nAnd pull ya close and embrace ya with the other\nMan you my mothafuckin' brother\n\n[HOOK: x4]\nBut I'm'a see him at the crossroads\nI got some blunts and some liquor\nSack of Timmy D and some bitches I'm'a picture\nI'm'a see him at the crossroads\nCuz that's my mothafuckin' nigga\nSo he won't be lonely(lonely)\n\nYea(yea)", "year": null}]}