{"songs": [{"year": "2003-11-18", "image": "https://images.genius.com/0e825d5daf35800f4be503b4ff58164c.640x640x1.jpg", "title": "Throw Back", "album": "Weekend Warrior", "lyrics": "[Verse One]\nI'd like to tell a story and it goes like this\nBefore I was makin money hand over fist\nThe mid-80's is what I'm talkin about\nYou will agree without a reasonable doubt\nAs I tell this tale, sittin on a pail\nThis is one you'll like when it's done\nOnly certain people know about Union Square\nThe Rooftop, Latin Quarter, cause I was there\nRed Alert downtown, Brucie Bee uptown\nGrandmaster Vic had a different sound\nYou had block parties, with free gifts\nMr. Magic and Marley gave radio a lift\nYou don't understand, but we do\nThat's why I'm tryin to explain it to you\nSo sit back and listen, to what I say\nAs I tell the story of this beautiful day\n\n[Chorus: sampled]\n\"We'll go dancing in the dark\" - HEY!\n\"Walking through the park, and reminiscing\"\nBREAK IT ON DOWN!\n\n[Verse Two]\nBefore Versace and DKNY\nThere was a lot of clothes that was fly\nLike Polo, Benetton, Coca-Cola and Osh Kosh\nGuess jeans and others that's acid washed\nD.C. wore K-Swiss and Sergio Tacchini\nGirls wore tennis skirts, that was mini\nSpot{?}, Ewings, {?}\nNew Balance, Fila, Nike and Ellesse\nAfrican clothes and medallions was worn\nAnd when Rakim came out, knowledge was born\nIn the midst of it all, I almost forgot\nThere was a brother uptown makin his own spot\nMakin Gucci, leather and suede tailor made\nThat had more flavor than mom's Kool-Aid\nI'm gonna tell you, the name of this man\nHe goes by the name of the Dapper Dan\n\n[Chorus]\n\n[Verse Three]\nSee at this time, you might think I'm strange\nCause I wore a four-finger ring, and big gold chains\nLike I was Mr. T from the A-Team\nIt was just a sign of me makin cream\nBut the cars and jeeps was incred-a\nLike the Audi, 280 Z's, 98's and Jettas\nCherokees, Wranglers, Suzuki Sidekicks\nL.A. and West coast cars was doin tricks\nNow the dances was crazy to match\nLike the Pee Wee, The Wop and the Cabbage Patch\nThe Prep, The Snake, and \"The Biz Mark, Biz Mark\"\nThe way the Gucci Girls gave shows a spark\nNow listen, to what I got to say-ah\nReagan was Pres', and Koch was the Mayor\nYou can't beat that with a baseball bat\nAnd you'd never see me without my Biz Mark hat\n\n[Chorus] - 4X w/ ad libs"}], "artist": "Biz Markie"}