{"songs": [{"year": null, "image": "https://images.genius.com/dcc907148124284a9abc48db9df5e500.500x500x1.jpg", "title": "Let It Be", "album": "Fat Boy Fresh, Vol. 1: For Members Only", "lyrics": "Feat. Chaundon\n[Intro: Rapper Big Pooh]\nUh, it's Rapper\nChaundon, Mel & D\nExcuse me, Mel & C-Stylez, ha\nYo..\n\n[Rapper Big Pooh]\nI spent the last year trippin over all my fuck-ups\nThe game is fulla roaches and the rats' a buncha suck-ups\nNiggas brown-nose for a buzz\nI'm tryna get drunk as Charlie Sheen, B, show me some love\nLike Bernie Mac say, witht he pen Poobie kinda crafty\nCause I ain't rollin with 9, they wan' shaft me\nTry and outlast me, young'ns speed passé\nI ain't goin back to the bottom, that's where you got it from\nAnd ain't no problem when you climbin to the top\nRemember problems resurface when you start to drop\nThe expectations of others determine when you flop\nAnd even Sean John has a moment when he stopped\nBut time waits for none, the grind waits for some\nThe blind choose to shun and you're confused as some\nIf you believe that this +Brother+ is done\nThe truth is, I only begun, I go\n\n[Chorus: Rapper Big Pooh]\nI used to spend a lotta time tryna give y'all the best of me\nAnd for my family and friends, they got the rest of me\nI used to think this rap thing was my destiny\nBut I'm content now to let it be\nI can let it be (let it be), I can let it be (let it be)\nAnd now my family and friends, they get the best of me (best of me)\nI used to think this rap thing was my destiny\nBut I'm content now, I can let it be, ha!\n\n[Chaundon]\nJesus~! 40 days and 40 nights of writing\nAt the dorm room when it seems so exciting\nDidn't have a worry, no real responsibilty\nBut times changed and the process is killin me\nPaid dues, held on to my receipt\nLookin at me funny cause my features ain't for free?\nFUCK that! Now I'm 'bout to raise up the amount\nYou suckas gotta pay me just to get up out the house\nGot a wife now and a family in the making\nDon't do it for the love, gotta bring home the bacon\nYou got me mistaken for these internet niggas\nDroppin free LPs', c'mon nigga please!\nI thought about quittin, get a 9 to 5\nHealth care, Roth IRA, shit is live\nBut I keep one-two'n it to death on y'all niggas\nCan't stay away from this shit, go figure\n\n[Chorus]"}], "artist": "Rapper Big Pooh"}