{"artist": "Kirko Bangz", "songs": [{"image": "https://images.genius.com/9be3ef9f2bdb77b1fb3d043822f6431c.960x955x1.jpg", "title": "Awwready", "year": "2013-08-12", "album": "Progression 3", "lyrics": "Its a young don ? from the H-town streets\nWheres girls they got time for a nigga like you, & they never get time from a nigga like me\nAll my hoes pretty when I pull up in ya city\n& wherever I go everybody wanna be\nAnd I ain't tryna keep my new bitches on the low, when I walk thru the door everybody get to see\nAll my bitches love my bottles, man these sparkles blinding me\nJust look for July 4th in the club and you gon spot a G\nIt ain't hard to tell your girl can't keep her eyes off V.I.P, cause she know this type of night dont come ‘round twice, girl what it be?\nUh\nIm in the party with some all stars, never low-key\nThat money that you bragging you just spent up on a car last month, man I cut the same check on lean\nPull up on the scene, H-town king, but im tryna get more you can call me high king\nMe and all my niggas we just living out our dreams spending money with the team, getting pussy ain't a thing\nYou ain't wanna get the whip til i got it my nigga\nYou ain't wanna get the crib til i got it my nigga\nYou ain't wanna get the bitch til i got her my nigga, yeah i got her my nigga, but i dont doubt her my nigga\nYou ain't wanna get the chain til i got it my nigga\nYou ain't wanna sip the drink til i got it my nigga\nYou ain't wanna pop a thing til i got it my nigga\nYeah i got all my niggas, we turnt up in the club like\nAwwready (awwready)\nAwwready (awwready)\nAwwready\nNigga tell his girl not to fuck with a nigga like me, but i fucked\nAwwready (awwready)\nAwwready (awwready)\nAwwready\nI been chillen on the low, but ya probably dont know\nHow the fuck I pull up in a drop like this?\nHow I make her fingers ? like this?\nHow the fuck I pull up in a new Lamborghini looking like Bruce and I ain't even drive my shit?\nHow the fuck I make these bottles pop like this?\nMan How the stripper make that ass drop like this?\nLast night I fucked like 4 of them hoes, and the crazy part is im telling my pops this shit\nYou can't tell young niggas nothing, you can't tell us nothing\nShoulda never asked your girl about me, thats why she let me fuck her\nSaid You can't tell these bitches nothing, man can't tell em nothing\n& i been sippin on this drink so bitch please shut the fuck up, girl (shut the fuck up)\nIts a young ? from the H-town streets\nWheres girls they got time for a nigga like you, & they never get time from a nigga like me\nAll my hoes pretty when I pull up in ya city\n& wherever I go everybody wanna be\nAnd I ain't tryna keep my new bitches on the low, when I walk thru the door everybody get to see\nYou ain't wanna get the whip til i got it my nigga\nYou ain't wanna get the crib til i got it my nigga\nYou ain't wanna get the bitch til i got her my nigga, yeah i got her my nigga, but i dont doubt her my nigga\nYou ain't wanna get the chain til i got it my nigga\nYou ain't wanna sip the drink til i got it my nigga\nYou ain't wanna pop a thing til i got it my nigga\nYeah i got all my niggas, we turnt up in the club like\nAwwready (awwready)\nAwwready (awwready)\nAwwready\nNigga tell his girl not to fuck with a nigga like me, but i fucked\nAwwready (awwready)\nAwwready (awwready)\nAwwready\nI been chillen on the low, but ya probably dont know"}]}