{"songs": [{"title": "Truman", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro]\nAyy, man... man\nAyy... Ayy\nI guess y'all on board\nYoung Man couldn't leave that shore\nHad the life they made for him till he seeked out more\nBoat rock, couldn't see that storm, he'll get up though\nHe know he close, it's too late to jump ship (Ayy)\n\n[Chorus]\nAw, damn! Aw, damn! You that motherfucker shit\nI know, this here became a trip: Cabo\nUp in the womb, but you can feel it when I kick it, I know\nAnd you too must be rockin' with Lil Dicky: Bono\nIt's like I hit the lotto, I had to hit the wall though\nI couldn't see it for a minute, shit was hidden: Waldo\nThey treat it like I'm goin' crazy, I'm just prayin', I don't\nIt's just I know, it's just I know\n\n[Verse 1]\nI saw the world like, \"Hold up\"\nDamn near fakin' on the side\nLet me take you on a ride\nLet me tell you bout the one who couldn't take the 9 to 5\nUse to take the 95 down to Richmond\nBumpin' Jigga up in the ride\nUse to think along and drive\n'Bout my drive\nUsed to wonder why\nUsed to wonder when the world'l see like I'm seein' mine\nUse to whine\nUse to wanna shine\nUsed to wanna dine\nUsed to talk to bitches in my mind when they were walkin' by\n\"Girl, what's happenin'? Girl what's happenin'?\"\nI ain't really 'bout to get involved that's what's happenin'\nErrything I knew was unevolved like a Baptist\nLayin' on my matress\nPrayin' I could have this, and\nNow when I get Tinder matches\nThey think they've been Catfished\nNow I been controlling how we livin' like a facist\nNow I got this weight up off my shoulders like a strapless\nRemember this shit was hapless\nRemember the day it happened\nAw, you the shit Dave, you be killin' everything you did\nGot the whole world talkin' all about what you did\nGot your old girl talkin' all about what you is\nGot your old world lookin' like it's his you ain't here\nI been fuckin' for the fuck of it\nAnd one of the bitches I been fuckin' with\nBeen wondering how I can work this much and stomach it\nShe wonders what I want from it\nI said, \"We don't gotta get into it\"\nShe like \"Nah, just do it\"\nShe a psychology student\nShe always followin' up\nFind the guy to be amusing as fuck\nUsually I'll answer her truthfully\nBut truthfully, I'm unusually used to being unusually good at internalizing when music is not provided\nBut I humor hoe\nAsk her if she ever saw the Truman Show\nShe like yeah\nI like well, when I saw that shit I was convinced I was livin' like Jim\nA similar situation where I was the basis of everyone's entertainment\nLike really up in the basement talkin to y'all\nIn the mirror because I thought Lil David was some American hero\nI know it's selfish and all\nBut I just felt it's my call\nI was a ten year old then\nBy 2010 I was wrong\nI'm like\n\n[Chorus 2]\n\"Aw, damn! Aw, damn!\nYou the motherfucker though\"\nI know\nThat shit became a trip, Cabo\nUp in the womb, but you can feel it when I kick it, I know\nAnd you too must be rockin' with Lil Dicky, Bono\nIt's like I hit the lotto\nI had to hit the wall though\nI couldn't see it for a minute\nShit was hidden, Waldo\nThey treat it like I'm goin' crazy\nI'm just playin', I don't\nIt's just I know\nIt's just I know\n\n[Verse 2]\nTwenty three bars up in my apartment\nI am debarred\nGotta do this shit\nI gotta recharge\nBut I gotta be smart\nMovin' up that ladder company\nStar, fuck it, that ain't nothin'\nI am *the* star\nSpittin' like a retard\nWork was like a prison\nI'm just seein' bars\nMy boss was all up in my camp\nAnd I'm just seein' Lars\nI been a heavyweight, Muhammad Ali\nAnd if he can mold that out of \"Clay\"\nThen I can turn the Lil D\nSo now I'm snappin' like I'm Truman\nBut off and on\nThere's always somethin' in the way\nI should be off and gone\nGirl I'm sorry if this draggin'\nI just need you to imagine\nBein' stuck up on the land without a captain\nWhen everyday is average\nAnd everyday you feelin' like a captive\nAnd feel like somethin' seriously lackin'\nAnd then you fear what could happen if you just leave it on the table like napkins\nBut, yo, you really fearin' hitting them rappin's and leaving everything behind\nCause you don't know what that horizon brings\nBut girl you gotta know what kind of fish you is\nSurvival instinct kicked in\nSink or swim\nI flipped a playlist\nQuit my day gig\nNow, I'm on a boat, Lonely Island\nIrony, and you still been tryin' to figure how I work this tirelessly\nBut girl\nThis is everything I've thought\nThis for everything I've fought\nThis for who I am to me becomes to y'all\n\n[Bridge]\n(Go)\nThey tellin' me \"nah\"\nBut I just be tellin' them \"yeah\" (Go)\nI just be tellin' them \"yeah\" (Go)\nI just be tellin' them \"yeah\"\nTell 'em I'm gone (Yeah)\nI just pretend I ain't scared (Go)\nDon't even know I was there (Go)\nDon't even know if I care\nCause girl this is Truman approachin' the wall\nUntil I'm me I am nothin' at all\nUntil I'm free I will not see beyond\nI had to be who I was all along\nAy *crash*\n\n[Verse 3]\nI think I mighta broke it down\nHoppin' on the fuckin' steps like ain't no around\nOpen up that door, you bet, ship ain't goin' down\nGuess the only thing left is to take a bow\n\n[Chorus 3]\nAw, damn! Aw, damn!\nYou that motherfucker shit\nI know\nThis ship became a trip, Cabo\nUp in the womb, but you can feel it when I kick it, I know\nAnd you too must be rockin' with Lil Dicky, Bono\nIt's like I hit the lotto\nI had to hit the wall though\nI couldn't see it for a minute\nShit was hidden, Waldo\nThey treat it like I'm goin' crazy\nI'm just prayin', I don't\nIt's just I know\nIt's just I know\n\n[Outro]\nFuck!\nThat felt good\nWell, that's all I got\nThe show is over, as they say\nHonestly, I just think that part in the Truman Show where his boat hits the wall is really the exact\nMoment that I'm at in my own life right now\nUh... metaphorically, of course\nAnd I'm ready for - I think I'm ready for it\nLike I've been thinkin' about it, I think I'm ready\nI mean, if I'm being completely transparent with y'all\nUh, like my lifestyle hasn't really changed that much\nUh, you know, considering, uh, where I think I'm at musically\nLike I'm still at the point right now where pretty much any bitch that tweets at me anything remotely flirtatious\nI have seen not just one of your pictures, I have seen the entire catalog\nThat's the type of shit that's goin' down over here right now, so...\nI am definitely ready for that, uh, next step, y'know what I'm sayin'?\nI think it's close, too\nI think it's close\nLike, uh, Diddy tweeted about me\nUh, y'know, that... I don't know if he handles his own Twitter\nI would assume he probably doesn't, actually\nBut, like, I'm so confident that I feel as though, like, me and Diddy will have a moment just about this outro\nLike when we're both sittin' next to each other smokin' cigars\nAnd bein' like, \"Ay, remember when you said that shit on that outro?\"\nLike, and I'm like, \"Yeah. That's, this is the exact moment I - I did that for, y'know what I'm sayin'?\"\nBring the - bring the beat back up. I don't know why\nLike, keep, loop everything. I wanna be talkin' for minutes, yeah, uh, y'know what I'm sayin'?\nLike, uh, shout out my Macbook Pro\nHad that shit since '09\nI made my first song ever on it\nLike, when I called myself Lil Dicky\nI made my, like, fuckin' album song on that shit\nAnd we survived, baby\nUh, shoutout Allen Iverson, Larry David, Will Smith, and Kobe Bryant\nFor makin' me the man that I am today\nBoth on and off the court\nShout out my mother\nWhat a great woman\nShe's so mad I recorded these conversations\nShe - she honestly went crazy\nIt took so much convincing to allow this\nBut, she's awesome\nShe's adapting to the rap game, as we all are\nLook, I just want to get this to a place where I can sell TMZ pictures of my actual asshole\nHeh, y'know?\nCause, well, I, I think that'd be such a feat\nIf I could actually create, like, an alt alias\nAnd sell TMZ pictures of my own asshole\nLike, profit off of that\nThat, I would totally do it\nI don't know why Seth Rogen's not already doing it\nI don't, I'm seein' the signs that it's not, I'm\nI think I'm seein' the signs\nI hope I am\nIf I'm really just misreading all these signs\nThen, I am 100% gonna have, like, a legitimate nervous breakdown\nUh, at some point very soon\nSo, we'll find out about that\nBut I see some signs\nLike, like I really am not fuckin' that much\nBut, like, the other day I did fuck a bitch to music\nLike, I fucked a bitch to some Miguel\nAnd that's kind of new for me if I'm bein' real\nLike, I had never actually done it before\nBut I was feelin' like I was some king shit\nY'know what I'm sayin'?\nSo, I was like, \"Man, Imma fuck this bitch to some Miguel right now\"\nUh, actually to be completely real to you, I, I will never fuck a girl to music again\nI found the whole thing to feel, like, completely cliche\nLike, I don't need my emotions dictated to me by, like, music\nIt makes me feel like I'm in a TV scene\nTakes all the, like, realness out of the moment for me\nLike, actually, was actually super weirded out by it\nSo, but still, like, I am about to let my hair down\nAnd, I don't know, I just feel like it's all comin'\nI feel like, like, I'm literally, like, about to find out about everything\nAnd it's exciting\nAnd, I, y'know, I, I had pinkeye last week\nAnd I remember thinkin' that, as I, like, was like, real down\nCause I was, like, trying to keep recording and shit\nBut I was thinking, \"What would Michael Jordan do?\"\nAnd he would play through the pinkeye\nSo that's why I'm in here\nI'm still not fully recovered, y'know what I'm sayin'?\nI, I'm definitely clearin' up\nLike, it's totally on the upswing\nBut, I just want you know I did record this shit through pinkeye\nAlright, I could talk for fuckin' years\nLegitimate years\nThis is an outro to an out\nYou see how long I talk with outros to songs\nBut, goddamn\nLook, I need to get out of here\nI'm 'bout to go take a Khalifa\nRest up\nThat's right, I did invent that phrase just there\n\"Take a Khalifa\"\nY'know what I'm sayin'?\nI also invented \"That's what she said\"\nBut I get no credit for it\nUh, oh, shoutout to Dickheads, obviously\nFundin' this whole operation\nWhatchu know about a Kickstarter, man?\nWhatchu know about the best fans in the world?\nSeriously\nThank you guys, I appreciate it\nHonestly, you made my dreams come true, and that's fact\nCouldn't have done this without y'all\nUh, I'd like to shout out my dick\nI know, y'know, we haven't had the smoothest relationship\nBut, I feel as though by kind of putting our issues out there\nLike, we have become something bigger than we could have been otherwise\nAnd, hopefully soon you will be rewarded for your patience\nAnd I will be rewarded for my patience\nI, and, I respect you\nI'd like to shout out my brain\nMy brain got the hardest verse on the whole goddamn album\nI hope my brain starts gettin' some feature looks\nBut he don't just hop on shit\nFuck, I, I got nothin' left\nI'm out\nI'm a professional rapper\nLong live LD\nAnd in case I don't see ya\n\"Good afternoon, good evening, and goodnight.\""}], "artist": "Lil Dicky"}