{"artist": "Bas", "songs": [{"lyrics": "[Intro]\nHow did you know\nThis is what I always wanted\nCould never have done many thing\nWhere you quick taking me? I might tumble\nI’m trying, will somebody make you just shut up about it?\nCan we settle down, baby?\nNo, let’s ride\n\n[Verse]\nI’m wired nigga on molly and Red Bull\nParty with the fiends you know ain’t no party in civil\n2 devils on my shoulders and I’m just caught in the middle\nGot decisions to make, the decision’s been made\nI swear these bitches screaming YOLO fore they sniff the yola\nFeeling like a Porsche 4 door, used to feel like Corollas\nMy niggas still moving the yola, till they fill the quota\nPopo on em like they just paroled\nAnd fuck the help, they never showed em\nSo we outchea, get it by any means\nI’m on fire; no lying, them boys remind me of anti-freeze\nAnd my engine keep running, I’m supplying the energy\nAin’t a thing, you great a sin, I’m high on the canope\nLooking out for my niggas, keep an eye on my enemies\nBitch, I’m just where I plan to be\nSo fuck what you say\nThis a new CBA, your favorite rapper’s been amnestied\nDon’t pretend to be classy, ho\n‘Cause I prefer nasty hoes\nTest driving broads, ho I’m a car show\nPockets all stinch if I see them narcos\nProlly gonna pinch, nerf a nigga in the stick\nThe prison’s like the man, it shoulda gave us bar codes\nHeart cold like it’s waiting to be transplanted\nBand wagon feeling, guess I’m grant standing\nGot them hoes on all 4’s, guess they can’t stand it\nShouts to oak shades, shouts to bandanna\n\n[Hook]\nAnd when we hit the pound that bitch black & blue\nI spend a condo in the club, one bottle won’t do, no\nAnd when we hit the pound that bitch black & blue\nI spend a condo in the club, two bottles won’t do, no\n\n[Bridge]\nI check the homies and I breeze\nAnd chickens hit my phone up, say they only wanna please\nSome niggas actin phony ‘cause they only want a piece\nI’ll be it, I see through, I never deceive you\nFiend\n\n[Outro]\nAnd when we hit the pound that bitch black & blue\nAnd when we hit the pound that bitch black & blue\nAnd when we hit the pound that bitch black & blue\nAnd when we hit the pound that bitch black & blue", "image": "https://images.genius.com/8c2660b7aba5800c53ad957150e40949.400x400x1.jpg", "year": "2013-04-26", "title": "Black & Blue", "album": "Quarter Water Raised Me Vol. II"}]}