{"artist": "Papoose", "songs": [{"album": "Underrated", "title": "God MC", "image": "https://images.genius.com/f554df8669b07b723949bb7564bc0ace.1000x1000x1.png", "lyrics": "[Intro]\nUnbelievable\nUh huh (Uh huh)\nDo it!\nUnbelievable\nAnd I\nYeah (Yeah)\nLet the drums knock\nUnbelievable\nStatik, what up?\nCome on (Come on)\nPapoose (Unbelievable), Papoose\n\n[Verse 1]\nI launch a larger missile, that's how I resolve a issue\nYou start so much shit, you should carry a starter pistol\nLet's see how good that does you when Nola revolvers hit you\nYou just a partial, you such a target, it's hard to miss you\nAt your funeral nobody in your squad'll miss you\nThey'll be no cryin', no sense in buyin' up all the tissue\nWhen they walk up to your casket not even your moms'll kiss you\nYou always been a bastard, I don't think your father miss you\nI gotta eat your food 'cause I'm starvin', you on the menu\nYour manager's retarded regardless for marketing you\nI always been the smartest, a artist, my art official\nHis job is just the hardest, his artist is artificial\nMobbin', we gon' continue to rob you for your residuals\nThis be our little secret, this robbery is confidential\nGo buy a typewriter, ink pen and some more utensils\nTo write a rhyme about me you gon' need a longer pencil\n\n[Chorus]\nDon't let me tell you where I'm from\nBrook-Nam, we cain't stop here\nIt ain't-it ain't a facade, it's God in the MC\nI'm the god, I spit the sun, moon, and the stars\nSay what'chu want\nDon't-don't-don't let me tell you where I'm from\nBrook-Nam, we cain't stop here\nIt ain't-it ain't a facade, it's God in the MC\nI'm the god, I spit the sun, moon, and the stars\n\n[Verse 2]\nI immediately structure the plan and strike strategically\nBefore I make a move, I carefully scope the scenery\nAvoidin' contact with the ignorant is the key to me\nBut recently I have been engagin' more frequently\nI'm tryna keep positive thoughts and think peacefully\nBut the snakes gotta just cross and keep deceivin' me\nAll the trick knowledge they taught is just beatin' me\nEatin' me alive inside brings out the beast in me\nContemplatin' ways to capture the win easily\nHad to make sure the battlefield was split evenly\nThey be stealin' my ideas, what's all the thievery?\nThey lack dignity, I swear, no decency\nSendin' threats, you think I care? You not a G to me\nThe streets in me wanna just grab and stab 'em repeatedly\nGlock eighteen with the drum, you can compete with me\nKrush Groove stay with the drum just like Sheila E\n\n[Chorus]\nDon't let me tell you where I'm from\nBrook-Nam, we cain't stop here\nIt ain't-it ain't a facade, it's God in the MC\nI'm the god, I spit the sun, moon, and the stars\nSay what'chu want\nDon't-don't-don't let me tell you where I'm from\nBrook-Nam, we cain't stop here\nIt ain't-it ain't a facade, it's God in the MC\nI'm the god, I spit the sun, moon, and the stars\n\n[Outro]\nUnbelievable\nUnbelievable", "year": "2019-02-15"}]}