{"songs": [{"title": "I Gotta’ Get Paid (feat. Ghostface & Raekwon)", "album": null, "year": null, "image": "https://images.genius.com/37d697fdf2a877e070869cbcf7cc9322.151x151x1.png", "lyrics": "(featuring Ghostface Killah & Raekwon)\n\n(Chorus: Lil' Flip)\nReal niggas bust ya pistols in the sky\nI'm a muthaf**kin' G and til I die\nI get that paper, and I'm chillin' on the low\nAll I need, is more money more\n\n(Hook: Lil' Flip)\n'cause, I gotta get paid, I gotta stay paid\nI gotta get paid, I gotta get this money\nI gotta get paid, I gotta stay paid\nI gotta get paid, I gotta get this money, man\n\n(Lil' Flip)\nI get that paper for shizzle, I'm breakin' bread with my niggas\nI ride around with them triggas, I clap back nigga\nI shoot that uzi like hoops, I ride around in them Coupe's\nGot alligator on boots, my pockets fat nigga\nWe overseas with the Wu, we blowin' trees with our crew\nAll my clothes brand new, you gotta love it man\nI'm on top of my game, rocks on top of my chain\nCatchin' planes to Spain, nigga, you know I'm thuggin', man\nWe pushin' whips you can't buy, 24 hours we high\nI believe I can fly, I'm f**ked up, dog\nI smoke that shit you can't get, we spit that shit you can't spit\nFifteen tracks, no skits, so f**k all y'all\n\n(Chorus)\n(Raekwon)\nShorties bouncin', forty ounces, Lex gon' kill up all the bouncers\nRound my shit, gon' fall up out you\nRaw that nigga, bring horror up out you\nThought about you, blow that forty and call the cops too\nI'ma be out by four and route you\nPussy ass nigga, bring horror up out you, valor the couch, too\nI'm amazin', when they pass the gauge in\nSky blue Phantom with beige in\nStop changin' it, ride it for a month\nThen come up, make my change in it\nNot done, the best, to get it, Uncle, let's get it\nWhat's really real if Lex can't get it?\nShaolin whip big techs again\nF**k around and caught me a Mexican bitch\n\n(Chorus)\n(Ghostface Killah)\nI blow your face off, cake off, then buy an acre, stayed off\nMy mustache like Adolf, don't let me pull my cape off\nIt's Superman lover, f**k it, no other\nWe just a group of bad brothers, y'all pussy, now check it\nRap DeNiro, crazy Shapiro, pushin' through customs\nBack from Europe, and we changin' our Euro's for money\nThe Wallabees gummy, with so much paper I'm dead\nCall me a cheese dummy, and we dip our leaves in honey\nAwwwww, you wanna see the hammer?\nAwwwww, you wanna hit the canvas?\nI will not waste my time on frontin' ass\nNiggas, that do not excease\n\n(Chorus)\n\n(Hook)"}], "artist": "Lil Flip"}