{"songs": [{"year": "2014-06-03", "title": "Make ’Em Purr", "image": "https://images.genius.com/272fb5e65bfaf7694e7ceb8c53b5c715.1000x891x1.jpg", "lyrics": "[Produced by: Buck 65]\n\n[Verse 1]\nI was a lot more comfortable being vulnerable and open\nWhen I was younger and it wasn’t clear if I was or wasn’t joking\nBut so much has broken, just like fuck it, the fix is in\nIf i can’t hide in plain sight anymore I’ll just stay hidden\nIt’s been a minute since I left this domicile\nNo need to change my outfit, I rock it like it’s going out of style\nIt’s out of style? Ain’t no one here to tell me otherwise\nIt gets more difficult to stay inside during the summertime\nBut most of the time it’s just like any other time\nAvoid personal interaction and human touch, shut the blinds\nIt’s been a while since I left this bachelor pad\nI need to go to the market soon cause the food is going bad\nThe food is bad. I found it’s difficult to just cook for one\nWith healthy recipes, well, depending on what book they’re from\nIf you want to eat healthy you gotta dirty some dishes\nThe frozen dinners quickly ready to serve and it’s so delicious\nIt’s not delicious, it’s disgusting, but it satiates the hunger with a quickness\nAnd hey, at least it’s something, at least it’s something\nAt most it’s nothing, fuck’s wrong with me? I don’t know, I’m just adjusting\nIt’s been a month since I left this cabin\nThe doctor was worried about a fever and other difficulties I’ve been having\nShe called me on Christmas, that was my gift\nShe was worried I might die, I said “I might die? No shit”\n\n[Verse 2]\nIt’s been forever since I said something that I can’t wiggle free from\nIf there’s anything I cherish in this self-inflicted prison, it’s freedom\nComes at a cost so I’m private to a fault til I default\nOn the loan for home, it’s actually more like a vault\nNo one knows the combo but little old me\nThe head honcho, the holder of the key\nAlone, but never lonely\nIt’s been a millennia since I left this dominion\nBeen in the company of any women\nAt least I got my kittens\nSpent more cash on my cat than I did myself\nWhen he stopped eating, I took him to the vet so they could check his health\nThey put a feeding tube into his neck\nI said “Please let this work cause if it doesn't I got nothing left”\nI didn’t say that, but they saw that. Cat had my tongue\nI didn’t speak at all, they told me to call back\nWhat, it wasn't weird I did nothing but stand right there?\nWith a \"fix this, money’s no object\" type stare\nIt’s been a year since I stepped into anyone else’s private quarters\nI’ve been busy self-diagnosing disorders\nFirst world problems, yeah, USA, number one\nTop of the world, I’m in a tux and cummerbund\nWelcome everyone to the party of the century\nIt’s sure to be one for the books, no doubt, medical ones especially\n\n[Outro]\nMy 20’s were a roar, my 30’s were a blur\nMy 40’s, I’m not so sure, but I’mma make ‘em purr\nMy 20’s were a roar, my 30’s were a blur\nMy 40’s, I’m not so sure, but I’mma make ‘em purr\nMy 20’s were a roar, my 30’s were a blur\nMy 40’s I’m not so sure, but I’mma make ‘em purr\nAnd I’mma make ‘em purr, but, but I’mma make ‘em purr\nI’mma make ‘em purr", "album": "Copper Gone"}], "artist": "Sage Francis"}