{"artist": "Inspectah Deck", "songs": [{"title": "Do What U Gotta", "lyrics": "[Verse 1: Inspectah Deck]\nYeah\nI ride till I'm through with the case\nThrough the days use the weights, niggas talk till they blue in the face\nBeen strugglin' is nothing to me\nCome and see, I get it in like Kobe at the buzzer for three\nWhen I'm gone, better 21-gun it\nThousand dollar bottles pop, one of the best that ever done it\nBroke nights dumbin' with the dumbest\nSportin' the four-four I bought off a fiend for seven huned'\nNew faces, screwfacin' niggas from a distance\nOne time wait to take a nigga through the system\nI ain't got time to play\nI hit the globe on roam, I'm still home a million miles away\nAnd I grind so my seeds could eat\nSometimes I let my eyes close, and I daydream of sleep\nAnd if I should die before I wake\nThen before my wake hit my wifey off with all my cake\nTill then, I'ma live it up, pop corks, and split a dutch\nWalkin' on the wild side, just to get a rush\nYa'll better get in touch, laws ain't shit to us\nEvery one I know is God, Earth, King, Crip, or Blood\nLittle nigga listen up\nI know you loving the life, an' livin' it fly, so high you can't get enough\nSon said, \"Who gives a fuck?\"\nThey see I'm making my bread, escaping the feds\nSo why should I give it up?\n\n[Hook: Inspectah Deck]\nAin't nothing left to do but\nHold myself down in these streets and\nIf I feel like niggas test me\nGot ta' reach out for my piece and\nI don't run from confrontation\nBy myself I keep it true\nWhen it comes down to gettin' paper\nI'm gon' do what I got ta' do\n\n[Verse 2: Inspectah Deck]\nI seen million dollar niggas fall flat on they face\nBest friends, co-defendants, how you rat on your ace?\nScramblers chase, the blood money, hammers on waists\nJust to trick it on the chick with the candles and lace\nBelieve it, it's real, we all out, fiendin' for meals\nFools shot up on the block, left 'em bleedin' and still\nNothing worse than power in the hands of fools\nThey play the game but they don't understand the rules\nYo, you should understand the jewels\nI got my life on the line, there's a 50/50 chance to lose\nAiyo, my dude, it's bigger than me, but at the story go\nWhy buy the cow when you get it for free?\nTo make a living, it's either death or state prison\nDeck just ain't quittin', either rep or stay hittin'\nYa'll know the motto, hollow points follow you home\nAl Capone cats, swallow the chrome\nYou get blown back out of your zone\nLike *pow* to the dome, so watch your mouth, kid\nMind on your tone\nSon, I ate with the greatest, stayed with the latest\nEye for a eye boss, ain't with the favors\nI laid where they murk all day, broad day\nI said flames will disperse y'all way, y'all play\nDeep inside the game, wise guys die for they name\nWhile the organized mind stay quietly paid\n\n[Hook: Inspectah Deck]\nAin't nothing left to do but\nHold myself down in these streets and\nIf I feel like niggas test me\nGot ta' reach out for my piece and\nI don't run from confrontation\nBy myself I keep it true\nWhen it comes down to gettin' paper\nI'm gon' do what I got ta' do", "image": "https://images.genius.com/82c9b14e7d1772e390a21fe67e28ad6e.800x800x1.jpg", "album": "Manifesto", "year": "2010-03-23"}]}