{"artist": "Cage", "songs": [{"title": "Hell Oh", "album": "I Never Knew You", "year": null, "image": "https://images.genius.com/6d8342a3af27f297cd488e93fab0906d.500x500x1.jpg", "lyrics": "[Verse 1]\n\nThere’s nothing serene about nature through a reinforced screen\nThat can’t be kicked out by a sedated teen\nI wanted an autograph of Northern Calloway\nWhen we were in Stony Lodge together\nI asked and got dragged away\nHe was the only celebrity I met as a kid, I still remember\nThe sheet over his face, his body on a stretcher\nAnd the only food for thought that would feed my head\nWas like my childhood, David from Sesame Street was dead\n\n[Hook]\n\nHello? Is someone there?\n\n[Verse 2]\n\nI covered every base and solved that dirt from mystery\nIf don’t know you in my present I can’t recall you from my history\nDistantly awake, violently shake near narcissism\nYou get away as fast as you can, it’s where the art isn’t\nKinda like a front group for a flock of casualties\nThe God they got for sale is in your wallet already actually\nGreen pictures of white men don’t answer prayers\nBut turn odds, I’m just a stacking Christ’s dads hope to burn God\n\n[Hook]\n\nHello? Is someone there?\nOf course you see me, there’s cameras everywhere\nYou know? We’re just like the press\nA bunch of reporters and liars spying on each other\n\n[Verse 3]\n\nI think of the past and how the future isn’t how I imagined it\nBut the past is exactly right where I unraveled it\nExcuses for failed attempts, gained another one I used a noose\nIt’s not until you fall apart you see the screws are loose\nAnd the screwdriver’s in the hands of the girl you live with\nAnd show affection when those you love are agents of deception\nFaces come and go, the lies disguised as purity\nIt tastes better than the reality, rotting in obscurity\n\n[Hook]\n\nHello? I know you’re there\nIf you’ve come to get me you can wait with despair\nYou know? There’s not much left\nBut you’re welcome to help yourself along with all the rest"}]}