{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Intro]\nForgive them, for they know not what they do\nForgive me for what I will do\n\n[Verse]\nLet me see, besides my life, nigga, I got my wife\nShakur, Samir, Ama Latif\nMaamu, Tafiq, I got Sia, Gina, Jalen\nAnd I got Walik, I got my mother\nMy sisters, my brother\nI got my nephews and all my nieces\nThink I'm gonna let that just fall to pieces?\nGotta keep that glued together\nI got no room for error\nAbsent father gave me my survival skills\nSo if I gotta rob and steal to provide the meals so be it\nNigga this only a stick up\nDon't turn it into an ambulance pick up\nGive that shit up\nOr feel the wrath from all the nights I suffered\nWith no supper, just Wonder bread and butter\nOne bed, four deep\nNo heat, my little covers\nShivering, laying in the piss of my little brother\nMotherfucker, you got me twisted\nThink your little bitch-ass gonna stop my mission?\nLeave me with no pot to piss in?\nBlocks of cheese, powder milk is how we stocked the kitchen\nMom out skitzing, but ain't smoke no crack her addiction\nWith slots, tonk and black jack\nMy pop up state kept steaks and jack mack\nToo young to understand that daddy ain't coming back\nBeing the oldest boy I had to step in his shoes\nI skipped class, in the Hard Knocks is where I was schooled\nI've been shot by the police, harassed by parolees\nFell in a state of depression, damn near OD'd\nFeeling guilty, if only I could foresee\nThat I'd be the reason you niggas is drinking codeine\nBefore Future started sipping on that yellow tuss'\nI clip your life shorter than that yellow bus\nYou target, put that beam on your back\nMe, the reason beaver leaned on the ack\nMe, the reason Philly even on the map\nMe, the reason your silly ass rap\nMe, ungrateful, motherfuckers\nAnd I tried to give you some game that Jay gave me\nTo make the transition from the street to the fame\nYou got a little fame and tried add street to your name\nIt ain't the same\nI'm battlefield tested, wounds all over my body\nWhere your scars at?\nRide for my niggas, willing to die\nWhat's your life like?\nFeel it in the air\nWhere them bars at?\nYou ain't been through shit, you can't record that\nThe respect I get, you can't afford that\nYou ain't been through wars, hugging your boys cryin'\nMight not make it back, but you ride? You lyin'\nAnd that shit you write, it don't excite me\nI push your shit to the white meat\nDon't you ever think you're like me\nI'm the dad you never had\nWhat's your problem, nigga? I'm like your father figure\nAnd with that being said, daddy's here to put the kids to bed\nNow get your ass upstairs and I better not hear that TV on\nSP chasing niggas with that DC on\nAnd whoever siding with him, dying with him\nLook him in his eyes right now, try with him\nWhen you come to the city, you're like cancer\nYou were damn near in Pamper's, it was me and The Answer\nYour own niggas can't stand you\n'Cause when you ain't around they look like hunger\nAsk Young Gunner, forgot he got the Bentley, damn near a summer\nHad copies of keys to where I got my slumber\nYou should've left me asleep\nYou done woke up a sleeping giant with your arrogant defiance\nYounging, respect more valuable than money\nAnd I'm well-connected all cross the country\nFuck you think that jet gonna land at\nWhen the whole city strapped up where you stand at\nNo need to make music ever in my life\nI'm Muslim, Halal wife, I just beat you twice\n\n[Outro]\nThe sad thing is, I really fuck with ya\nI just feel sorry for whoever stuck with ya\nGood luck to ya\nNigga please,  younging, I'm out your league\nI'm out your field, let's be for real\nI could keep going, but that's overkill\nI guess I'll see you when I see you\nAnd when I see you, I wouldn't want to be you\nGood night", "image": "https://images.genius.com/8d3e339ff0d8d5161923bf7da01fc9e6.680x680x1.jpg", "year": "2016-10-07", "title": "Good Night", "album": null}]}