{"artist": "Wiley", "songs": [{"year": "2012-01-19", "lyrics": "[Skit: Wiley, Customs Agent, and Customs Agent's Superior]\n\nHello sir, can I check your bag please?\nYeah yeah yeah, go on, go on, go on, go on\nCan I ask where you're going?\nI'm going to Barbados just to see the island for a couple days\nOhhh, you like to travel?\nYeah, you know I like a bit of sightseein' and stuff\nJust wanna go and see Barbados really\nAlright, hold on a minute\nYo, you check the boy there?\nI'm doing it now Wellan\nEy boy, you got drugs haulin' off\nWhat d'you mean officer? I don't carry nothin' nowhere\nHold on Wellan, let me check the (?)\nEy boy, stand up there (?)\nCan I see your passport please, sir?\nYeah, let me just get it out the bag wait a sec, sec\nHere, here\nYo this boy (?)\nEy boy, we gotta take a urine test now\nUm, 'ello mate, what it is is\nWe do these checks because uh, there's a lot uh, you know\nThere's a lot of drugs going back and forth and that\nSo uh, step this way\nAnd we're gonna uh, take a sample of your urine\nAlright alright mate, so you're a police officer from England then\nAnd you just work up there?\nYeah yeah yeah, what it is is we help out with immigration\nAs you know, there's a lot of people doing this sort of thing\nSo we have to make sure that it's all sorted\nYeah I know what you mean\nYou know, like make sure no one ain't slippin' through\nWith anything that they shouldn't be, you know how it is\nAnyway son, I'm sure you, I'm sure you\nYeah yeah yeah, I know I know I know I know\nSure you know\nOkay then, so would you like to take um\nA sample of your urine into this tube\nAnd then uh, when you finish, the sink's there\nWash your hands, and um, yeah\nGive us back the tube\nOkay okay okay, cool\nHere you go, officer, there's the tube\nOkay son would you like to take a seat in there?\nYeah\nAnd um, give us like a minute or two (Okay, okay)\nAnd I'll get back with the results\nAnd then um, hopefully we can get you on this flight\nAnd you'll go to Barbados and uh, everything will be sorted\nYou know(Yeah, exactly)A little bit of sightseein'\nWouldn't ya?\nDefo man, that was the main aim, you know what I mean?\nI come to Jamaica but I just wanted to pop over to Barbados\nBut yeah, alright, sort that out for me cool\nOkay mate, um, what's happened is\nYou are 69.7 percent THC level\nSo um, yeah, you you\nDo you smoke weed, at all?\nYeah I smoke weed officer, to be honest with you\nI do smoke weed, I'm not gonna lie, you know what I mean?\nI'll have a puff here and there\nOkay cause what it is, is, um, usually what they wanna do\nIs run you up the hospital, you know uh, go to the\nKingston, the uh, the hospital and uh\nWhat they'll do is an x-ray, because uh, they\nThink that you've swallowed some class A\nNah man, I ain't done that\nOfficer I told ya, I smoke weed bro, and that is what I do\nI'm not, uh\nRight now, I just wanna go over to Barbados and do a bit\nOf sightseein' you get me?\nSee if I might see Rihanna, if it's possible\nHahahahaha, I hear ya son but let me have a talk\nWith my pal in there, because as I said anyway\nWe'll have a talk, and if he gives it the go ahead\nWe'll let you go this time, but just to let you know\nIf you do smoke weed, when you know you're gonna fly\nDon't really smoke, because then, obviously\nIf they see ya, or if they look in your eyes and it looks\nA bit red, they're obviously gonna do one of these checks\nAnd one of these checks could obviously mean you go up\nThe hospital, and they do the x-ray, and obviously\nThat'll waste your time a bit, but, hold on a sec man\nLet me sort this\nOkay okay, cool cool cool\nOkay Richard, you're free to go\nAs I said next time, don't, um\nGet, erm, stay away from the weed\nWhen you're about to fly cause obviously\nYou don't want to get caught up in one of these checks\nOkay son? See you later, have a nice flight\nHave a nice time in Barbados, and if you see Rihanna\nTell her I said hi (Hahahaha) Wouldn't ya?\nI will mate, I will, thanks, see ya later\nFucking prick", "image": "https://images.genius.com/d5b1437d0bbfb809fd3a9868b1fe0d7d.400x400x1.jpg", "album": "Evolve or Be Extinct", "title": "Customs"}]}