{"artist": "Vado", "songs": [{"title": "Large on the Streets", "year": null, "lyrics": "[Hook: Big L]\nI'm large on the street scene\nI keep cream, I'm large on the street scene\nCuz I keep cream, I'm large on the street scene\nI keep cream, I'm large on the street scene\nEvery time I touch mics, I'm large on the street scene\n\n[Verse 1]\nHeads start bobbing like \"who's this?\"\nVado that dude spits, sharper than steak knives from Ruth Chris\nYou hors d'oeuvres get toothpicks, I aim to shoot shit\nSweep up ya whole block; no broomsticks\nWhen I touch mics, I come right\nThey like \"son nice\", get thrown like hung Nikes\nEvery bar's a gun fight, get one strike\nCoke like Tiger Woods, fuck with too much white (Haaa!)\nProud dream, my style mean\nWish I was here, see the next thing they crown king (Vado!)\nIt's that swag that Uptown bring\n4 pound swing, you be down before the sound DING!\nYou ask me, you sound weak, you not a threat\nLike Artest I don't stand too far from the best (Killa!)\nCarhartt and vest, no I ain't the hardest yet\nThere's a few artists left, words for them \"God Bless\"\n\n[Hook]\n\n[Verse 2]\nLive performance hit the stage no encore\nA wild cat that can ball like he John Wall\nGet crossed, big cross wearing like John Paul\nNo Pope, peel dope, got it inside walls\nI cop ounces from the Hill\nUptown and down the block from where Malcolm was killed\nStreet built, could tell the album is real\nNumbers could go on heads, thats just how a nigga feel\nTight if you want, you either fight or get jumped\nIf I was in hell, I'd have Satan light me a blunt\nGot a variety, if it ain't the trey, it might be the pump\nDig a hole for all his kids, throw wife in the trunk\nFuck Life, I fear nothing, you nice? Lemme hear something\nI'm like a Mack Truck, you a deer running\nStraight roadkill, I don't care buzzin, my name in the air buzzin'\nCops floodin' the block like the mayor comin'\n\n[Hook]\n\n[Verse 3]\nTen dollar bag is a dime\nA bad bitch thats fine\nGot work on the strip you grind\nSee a nigga you say slime (Sliiiime!), locked up you got time\nCoke you got lines, deal you got signed\nStop it 5 you all talk, singles we call shorts\nAnd popped off means we all for it\nCotton Club thugs ya'll all soft\nBlocks thats boardwalks, shipping you up top that's up North\nOne time means fuck off\nOr say it before you hang up the phone, dap your man then walk off\nA hot cars a toy, a cop car's the boys\nWe call Nike Shox the boings, loose change is coins\nGunplay you shoot things with noise\nSay you wearing bang bang means your chain is moist\nYou like the way I deliver it?\nI talk for Harlem, I will never stop kicking it\n\n[Hook]", "album": null, "image": "https://images.genius.com/e2d9824f3848684bc687e9cad8889c34.687x595x1.jpg"}]}