{"songs": [{"year": "2011-05-13", "album": "PinkElephants", "image": "https://images.genius.com/12d8e3dbc94c72fa2e61dba904175664.1000x1000x1.jpg", "title": "So Potent", "lyrics": "[Intro]\nYeah\nBounce\nBounce\nNo pin and pad needed on this one, homie\n\n[Verse]\nAh, feelin' great, feelin' better than ever\nI'm lookin' super duper ill in my Bill Cosby sweater\nCan nobody bring down my mood\n[?], [?] fiasco, superstar the [?]\nWho are you, who are you to judge my music?\n[?], you fellin' me, all these niggas killin' me\nNo, not again another kin with a pin\nTryna destroy my rhymes like I'm African\nI am slappin the, I am back again\nCall me Jordan on the track 'cause I break the rhythm\nWith the heat, with the heat, hol' up, let me bring that back\nYoung, Young Abstract 'bout to have a [?]attack\n'Cause I came up in the room and the nigga made it shining\n'Cause I came up in the room and the nigga made it blinding\nI am feelin' all alone, all my niggas call me Eileen\nBut wait, why you eying? Baby girl on the roadway eying\nI mean Ian, she is seeing crazy things like demons\nI am being who I been since the sixth grade\nBetter behave, shoutout to Drake\n'Cause [?] today\nI mean back in the day when we were chillin', we were [?]\nGoing of the top, niggas straight from the [?]\nI'm chillin' in the crib looking at my ceiling, man\nThen I go in the car jam [?], man\nYou know me, you know my flow be kinda o-d\nI be getting groovy, tryna make a movie\nWith a girl in a Jacuzzi, a x-rated movie\nBaby, will you do me, baby, will you do me\n[?], breathing, on the track I am leaving\nOn the track I am a dragon, I am breathing\nThis fire out, hah, with my fire mouth\nI need a babygirl, she need a wider mouth\nY'all see what I'm about, it's going down at the moment\nThey can hate, they gon' hate but this is so potent, nigga\nThis is so potent, I am not [?], I'mma keep flowing\nI go in, I go in, I let it keep rollin'\nWho are you? Who are you? A couple [?]\nOn my knees, on dem trees, under the [?] tree\nLike J-A-Y-Z say on the black album\nI'm back at them, niggas steady shouting\nI'm steadier like a mountain\nIt's going down, we need that fountain\nWe need that basement, we need that tapin'\nDem niggas cravin', like Billy [?]\nThat's what I'm sayin', I'm never playin'\nThe trunk bumpin', let me tell you somethin'\nCall me Kanye 'cause you can't tell me nothin'\nI'm stuntin', I'm stuntin'\nLike for real you niggas frontin', back with a bunch of them\n[?], 'bout to just punch again\nOh-oh-oh-oh, lunch again, what y'all want?\n\n[Outro]\nWhat? Bounce\nWhat? Bounce\nWhat? Bounce\nWhat? Bounce\nYeah, [?] need to tell you, homie\nFreestylin'\nPow, pow, pow\nI'm bussin' out\nShot a Waka Flocka, nigga\nASF up, for real"}], "artist": "Kevin Abstract"}