{"songs": [{"image": "https://images.genius.com/d139ded1190d7e3c5cdc6dda61c6767f.600x600x1.jpg", "title": "Country Grammar (E-40 Remix)", "album": "Da Derrty Versions - The Reinvention", "year": "2003-11-25", "lyrics": "[Nelly]\nAight, yeah\n(Hot shit!)\n\n[Verse 1 - E-40] + (Nelly)\nE-40 (um I'm goin)\nLet me breathe on ya man\nLet me speak upon a man\nLet me teach you somethin about this game (mmhmm)\nLet me show you how to swing\nPush pedal, that candy cane\nOn the turf where the law can't scare me (yeah)\nPushin that candy, drinkin that brandy\nLivin that turf, like me and my family\nPimp tryna make a dollar outta fifteen cent\nBustas on the corner of the block gettin bent\nMe and my folks we on one (on one)\nWe don't be trippin off that (nothin)\nPlayers about to be somethin (somethin)\nA music and beat be somethin (somethin)\nWhere the Louie at man, where the Louie the thirteenth\nE-40 and the Lunatics off to drink\nLookin for the chicks in hot pink\nI'm so throwed I need a shrink\nI'm so throw, throwin up in the sink\nRight back up with the bunnies and Henn\nGettin that hunny with the peaches and cream\nNot a main thing, but a one night flang\nDo my thug things, livin off the king pin\nHousehold thug, for all up in my business\n26 inch chrome rims spin\nDon't check me, check your chick man\n(Nelly: yeah, hot shit!)\nBoss floss (boss floss)\nYou lose you lost (you lose you lost)\nTrue false (true false)\nHoes cost (hoes cost)\nWhat do I look like spendin my yay\nBut man hunny better pay me paper man\nMan I'm a honey mackin Hillside hustler man\nThe Hillside didn't raise no buster man\n\n[Verse 2 - Nelly]\nMmmmm, you can find me, in St. Louis rollin on dubs\nSmokin on dubs in clubs, blowin up like Cocoa Puffs\nSippin Bud, gettin perved and gettin dubbed\nDaps and hugs, mean mugs and shoulder shrugs\nAnd it's all because, 'ccumulated enough scratch\nJust to navigate it, wood decorated on chrome\nAnd it's candy painted, fans fainted - while I'm entertainin\nWild ain't it? How me and money end up hangin\nPlus I hang with Hannibal Lector (HOT SHIT!)\nSo feel me when I bring it, sing it loud (what?)\nI'm from the Lou and I'm proud\nRun a mile - for the cause, I'm righteous above the law\nPlaya my style's raw, I'm \"Born to Mack\" like Todd Shaw\nForget the fame and the glamour\nGive me D's with a rubber hammer\nMy grammar be's ebonics, gin, tonic and chronic\nFuck bionic it's ironic, \"Slammin\" niggas like Onyx\nLunatics 'til the day I die, I run more game than the Bulls and Sonics\n\n[Hook - Nelly]\nHmmmmm\nI'm goin down down baby, yo street in a Range Rover (c'mon)\nStreet sweeper baby, cocked ready to let it go (HOT SHIT!)\nShimmy shimmy cocoa what? Listen to it pound\nLight it up and take a puff, pass it to me now\n\nI'm goin down down baby, yo street in a Range Rover\nStreet sweeper baby, cocked ready to let it go\nShimmy shimmy cocoa what? Listen to it pound\nLight it up and take a puff, pass it to me now\n\n[Verse 3 - Nelly]\nWho say pretty boys can't be wild niggas?\nLoud niggas, O.K. Corral niggas\nFoul niggas, run in the club and bust in the crowd nigga\nHow nigga? Ask me again and it's goin down nigga\nNow nigga, come to the circus and watch me clown nigga\nPound niggas, what you be givin when I'm around nigga\nFrown niggas, talkin shit when I leave the town nigga\nSay now, can you hoes come out to play now\nHey I'm, ready to cut you up any day now\nPlay by, my rules Boo and you gon' stay high\nMay I, answer yo +Third Question+ like A.I\nSay hi, to my niggas left in the slammer\nFrom St. Louis to Memphis, from Texas back up to Indiana\nChi-Town, K.C., Motown to Alabama\nL-A, New York Yankee niggas to Hotlanta\n'ouisiana, all my niggas with \"Country Grammar\"\nSmokin blunts in Savannah\nBlow thirty mill' like I'm Hammer\n\n[Hook]\n\n[Verse 4 - Nelly]\nLet's show these cats how to make these milli-ons\nSo you niggas quit actin silly, mon\n+Kid+ quicker than +Billy+, mon\nTalkin really and I need it mon\nFlows I kick 'em freely mon, 'specially off Remi, mon\nKeys to my Beemer, mon - holla at Beenie Man\nSee me, mon, cheifin rollin deeper than any mon\nThrough Jennings mon, through U-City back up to Kingsland\nWith nice niggas, sheist niggas who snatch yo life niggas\nTrife niggas, who produce and sell the same beat twice, nigga (HOT SHIT!)\nIce niggas, all over close to never sober\nFrom broke to havin bro-kers my price Range is Rover\nNow I'm knockin like Jehovah - let me in now, let me in now\nBill Gates, Donald Trump let me in now\nSpin now, I got money to lend my friends now\nWe in now, candy Benz, Kenwood and 10\"s now\nI win now (Whoo!) fuckin lesbian twins now\nSeein now, through the pen I make my ends now\n\n[Hook]"}], "artist": "Nelly"}