{"songs": [{"album": null, "image": "https://s3.amazonaws.com/rapgenius/talib-pic.png", "year": null, "title": "In The Red", "lyrics": "Can you feel it? Can you feel it?\nHere we go, are you recording?\nAiyyo Tone, is it ah, ah on?\nLet it bump, they love it in the red\nReflection Eternal, that other shit is dead\nYes, let me know if you alive\nPut your hands in the air, let me know if bring it live\nHey, come on, hey, I love music\nMusic is the river, we floating, we get to live it\nLike the souls of those swept away crossing the Mississippi\nHonorary spokesman, my focus is so scary\nVocalist for the hopeless, I'm championing my city\nCracks in the levy, we catching the last ferry\nApply this application that's crashing your Blackberry\nRock Steady like Aretha, it's got heavy\nWhat's that about cat and mouse, Tom and Jerry?\nCommissary get commissioned, the prison no sanctuary\nFor the locked up, every relationship adversary\nAin't no replacement, so make a statement before you buried\nWith very legendary already, no need to worry\nPay attention to the music, led your hazard to bury\nMixed for transistor radio speakers, Marvin married\nHis daughter in sort of a quest for a father figure\nThe little Stevie Wonder was killing 'em at the shows\nBest songwriter since Smokey and Quincy Jones\nGill Scott and Last Poets turned they poems into song\nEverybody know that my favorite Nina Simone\nRest in peace Michael Jackson, I think I need a shamone\nPaid attention to his lyrics, he wished we leave him alone\n(Leave me alone)\nHuh, leave him alone\nHuh, leave him alone\nJames Brown and Michael Jackson was working until they gone\nOn tour just so they could make payments on they homes\nEverybody cried when Usher sang him a song\nJoe Jackson was promoting his label, he know he wrong\nShame how our heroes are broke, we call 'em stars\nThat's because when they falling to earth, they falling hard\nEverybody balling hard but they sound wack\nIf you in the resistance then this your soundtrack\nLet it bump, they love it in the red\nReflection Eternal, that other shit is dead\nYes, let me know if you alive\nPut your hands in the air, let me know if you alive"}], "artist": "Talib Kweli"}