{"songs": [{"image": "https://images.genius.com/134aec1024a9790ac74d7383124949f3.800x800x1.jpg", "title": "Until I Die", "album": "Moments ", "year": "2010-11-29", "lyrics": "[Intro]\nYeah\nRecord four\nLet's go\nYeah, it's record number fo'!\n'Errybody knows\nYeah!\nI'ma let it, I'ma let it, I'ma let it go\nI'ma let it go\nYeah\nListen!\nOh, no! Yeah\n\n[Verse 1]\nI ain't the type to take a gat and put a hole in your head (nah!)\nI'm the type that take the mic and clean your soul up instead (yeah!)\nWhat I say and what I write is motivation, forget it\nYou want a Shady number two, man that's not what this is (not what!)\nIt's like we all take sin and adapt it\nUsed to seem ugly, now it's lookin' attractive (real pity)\nUsed to let it bug me, now we like it when it happens (crazy)\nIt's like when it happens (nah!), your life is inactive (yeah!)\nWorld's satisfaction will play with your mind\nGot you think you're gettin' 'head, but your fallin' behind\nYo, DMX said, \"Lord, send me a sign\"\nRead a little Revelation, and that's what you gon' find\nSee, in every line, I present you with facts\nAnd yo, in every rhyme I desire to impact you (thank you)\nGo inside of your mind\nI rewind and go back to a place or a time\nYou traveled off of the map\nDo the math, yeah\nMoney put a smile on your face\nSame thing that make you smile will make your smile go away (yeah!)\nSee, the riches of the world might get you the chains and Nike's\nBut in the end, neither one of those'll save your life\n\n[Chorus]\nUntil I die\nI'ma take my hopes and dreams\nAnd use 'em to glorify His Name\nUntil I die\nI'ma rep the one true God\nAnd I don't care 'bout what nobody say\nUntil I die\nI'ma spread the truth to this nation\nAnd show 'em there's a God that can save 'em\nUntil I die\nAnd here I take my last breath out of my chest\nI'm gon' praise Him\n\n[Verse 2]\nMTV knows how to get the alley-oop (yeah)\nAll they gotta do is mix a little lie with some truth\nCome out here, girl! Let me fix that face up\nNeed a little less clothes and a lot more makeup (haha!)\nGet all caked up\nOh no, here we go\nAnother episode, skippin' down the Hollywood road (haha!)\nWhere you goin'? Nobody knows, nobody cares\nThen you wonder why the girls around the world insecure (yeah)\nIt's so stupid\nYou want the truth, kids?\nThe media's just one big lie of losin' (come on!)\nIt's like I'm watchin' a movie, world's so full of actors (actors!)\nTake a moment listen to me, I'm not actin'\nI'm just askin'\nTell me if you're ready to die (nah)\nIf it happened today, where would your soul reside?\nDevil laugh 'cause he know how to play with your face\nSo I just laugh back and pick up the mic and I say\n\n[Chorus]\nUntil I die\nI'ma take my hopes and dreams\nAnd use 'em to glorify His Name\nUntil I die\nI'ma rep the one true God\nAnd I don't care 'bout what nobody say\nUntil I die\nI'ma spread the truth to this nation\nAnd show 'em there's a God that can save 'em\nUntil I die\nAnd here I take my last breath out of my chest\nI'm gon' praise Him\n\n[Verse 3]\nI'd rather die today for what I believe in (come on)\nThan die a hundred years from now for no reason (well, why?)\nAtheists are like, \"I don't know why I'm breathin'\nYeah, there's gotta be a reason, but there's no Jesus\" (haha)\nStandin' up screamin', \"He's not real!\" (he's fake!)\nHonestly, I'm sorry that's the way y'all feel (fake!)\nWorld's kinda like, to me, just a roller coaster\nYou in it for the ride? Well, what's up when it's over? (yeah, yeah)\nYou keep doin' wrong when you know it ain't right (yeah)\nHow you live today, it turns eternal life (eternal life)\nYou let it slip away, and it's gon' blast you\nKeep the sin up in your face, then the truth gon' pass you\nMy momma used to tell me I should follow my dreams (come on!)\nBut most of my life I just been followin' me (yeah!)\nSo I'ma take this moment to release my shine\nAnd yo, forget about me\nLet His will be done, man, not mine\n\n[Chorus]\nUntil I die\nI'ma take my hopes and dreams\nAnd use 'em to glorify His Name\nUntil I die\nI'ma rep the one true God\nAnd I don't care 'bout what nobody say\nUntil I die\nI'ma spread the truth to this nation\nAnd show 'em there's a God that can save 'em\nUntil I die\nAnd here I take my last breath out of my chest\nI'm gon' praise Him"}], "artist": "NF"}