{"songs": [{"title": "Let’s Start Over", "album": "The Bigger Artist", "year": "2017-09-29", "image": "https://images.genius.com/7d94aecd396a79046cef20ef7fdead34.640x640x1.jpg", "lyrics": "[Intro]\nShe said, \"Okay, okay, let's start over\"\n\n[Chorus]\nDiamonds be the coldest when they all chokers\nI'm paranoid, my hand on the toaster\nEverybody duck before they start shooting\nFuck around, get hit, it's gon' be all over\nShe ain't wanna step into my fucking room\nFuck around and made a bed out the sofa\nShe said, \"Okay, okay, let's start over\"\nTold me how she feel and now she all open\n\n[Verse 1]\nNow she all open, water from the pussy overflowing\n'Fore I started stroking, eat it up, her legs on my shoulders\nNow I'm so focused, yeah yeah, I swear I'm so focused\nYeah yeah, I swear I'm so focused\nEverywhere I go they ask me where I'm going, I don't know you\nYou actin' like you know me, you don't know me so don't call me bro\nIf I take your hoe don't you trip she might not be a hoe\nI'm just a man, I know I'm just a GOAT, I'm just an animal\nIf I stop fucking with bitches, can we start over?\nIf I post all of your pictures, can we start over?\nIf I tell you why I love you, can we start over?\nI never meant to leave you heartbroken\nIf I admit it can we start over\nTold you I'm an animal, I was a dog on you\nYou said I was different but I showed you wrong, don't I?\nI still make you wet the bottom of your dome, don't I?\nYou told me that you don't care, I know you care don't lie\nWhen I hit it from the back you be so scared, don't lie\nPull your hair and I bet I could break the bed on it\nThe way she gripping on the dick, she broke a nail on it\nIn and out the lobby, had the scale on me\nTissue on the camera so the super couldn't tell on me\nCouple niggas wasn't real, they switched sides on me\nYou told me you was my nigga, but you lied to me\n\n[Chorus]\nDiamonds be the coldest when they all chokers\nI'm paranoid, my hand on the toaster\nEverybody duck before they start shooting\nFuck around, get hit, it's gon' be all over\nShe ain't wanna step into my fucking room\nFuck around and made a bed out the sofa\nShe said, \"Okay, okay, let's start over\"\nTold me how she feel and now she all open\n\n[Verse 2]\nI was about to go and buy her ass a new ring\nBut instead I spent a hundred on a new chain\nI was about to go and scoop her in a Mulsanne\nBut she talk about it every time that we do things\nMood swings, you killing me with all these mood swings\nDon't you know I'm in my zone I'm in my 2-3\nShout out to my nigga Reggie for these two 3s\nI swear my life is like a mother fucking movie\nTwo cribs, one for me and gang, one for you and me\nTwo chains, like I'm Tittyboi and they glittery\nYou a lame to her, now she wanna be my boo thing\nKeep the same niggas with me, I don't need a new gang\nIf they hate, fuck it I expect a hater to hate\nI can't let a hater be my friend that man is two-faced\nKeep the 'K with me, yeah I only keep security\nThe place safe nigga I don't wanna be on TMZ\n\n[Chorus]\nDiamonds be the coldest when they all chokers\nI'm paranoid, my hand on the toaster\nEverybody duck before they start shooting\nFuck around, get hit, it's gon' be all over\nShe ain't wanna step into my fucking room\nFuck around and made a bed out the sofa\nShe said, \"Okay, okay, let's start over\"\nTold me how she feel and now she all open"}], "artist": "A Boogie Wit da Hoodie"}