{"songs": [{"title": "Trappin’", "album": null, "year": "2018-10-10", "image": "https://images.genius.com/88d940564ba39d25a3dd6ccf554c2f17.1000x1000x1.jpg", "lyrics": "[Intro]\nAyy... yeah....\n\n[Verse 1]\nAye, we got a choppa' and we shoot out (bang bang), yeah, that shit got holda' beam\nI was trappin' in the house, I was whippin' shit like cream (like cream)\nAnd yo' nigga he a bitch, why he wanna be like me? (be like me?)\nIn the beam, I just poured another cup of bubbly (bubbly..)\nYeah, roll up, pass the boof, you a lame, you will not shoot (will not shoot)\nAnd I don't need no mo' school, I just pulled off in a coupe (skrrt skrrt)\nYeah, yo' bitch she trynna fuck with me, told her better suck the team (suck the team)\nYou a snitch, can't ride with me, and you scared to pop a bean, yeah\nThat shit got me so geekin' (so geekin'), these niggas changin' like the seasons (like the seasons)\nAnd these bitches stay tweakin' (stay tweakin'), my fours leave your body leakin' (leak, yeah)\nTook a piss when we popped out (popped out), brother with me and you know we bought a Glock out (Glock out)\nKylie lips, so I had to try to tap out (try to), last show boomin' brought the whole fuckin' block out\n\n[Chorus]\nHow a nigga switch when ion' know you? (ion' know you)\nI was just trappin' by my old school (I was trappin')\nBut now I'm makin' hits, I feel pro too (I feel pro too)\nFound out I took yo' bitch but that's old news\nHow a nigga switch when ion' know you? (ion' know you)\nI was just trappin' by my old school (old school)\nBut now I'm makin' hits, I feel pro too (I feel pro too)\nFound out I took yo' bitch but that's old news\n\n[Verse 2]\nNow a nigga up, she won't leave me 'lone (leave me 'lone nigga)\nAnd I ain't finna answer when you hit my phone (when you hit my phone)\nLike, bitch what the fuck, but you can't give me dome (lil' bitch)\nA young nigga made it, I ain't had no loan (no loan, no)\nWe was flippin' work on the interstate (flippin' work), said you puttin' work, but got no cake (no cake, man)\nAnd free my brother Tazzy, got a big case (free that nigga)\nAnd free my big homie, fuck what he say (free Kilo)\nYou can't fuck with me, nigga, you can't fuck with me (fuck with me)\nI just bought a pint, and I poured that it started bubblin' (pour that lean)\nI just seen a thot, like, damn that bitch is lovely (lovely)\nThought she was down, but the money why she lovin' me? (why she lovin' me?)\nWhy you totin' on that tool, nigga (on that tool nigga)? I was hittin' licks like it was coolin' (it was coolin')\nI could've fucked yo' bitch but she ran through, nigga (but she ran through)\nAnd I just crashed a whip I'm too a coolin' (skrrt skrrt)\n\n[Chorus]\nHow a nigga switch when ion' know you? (ion' know you)\nI was just trappin' by my old school\nBut now I'm makin' hits, I feel pro too (I feel pro too)\nFound out I took yo' bitch but that's old news\nHow a nigga switch when ion' know you? (ion' know you)\nI was just trappin' by my old school (old school)\nBut now I'm makin' hits, I feel pro too (I feel pro too)\nFound out I took yo' bitch but that's old news"}], "artist": "Lil Mosey"}