{"songs": [{"image": "https://images.genius.com/5c20c657a063eac69a842fc529269744.375x375x1.jpg", "lyrics": "[Intro: Mac Miller]\nClose your eyes...\n\n[Verse 1: Mac Miller & Iman Omari]\nSo watch her do the Macarena, somewhere out by Pasadena\nLove a drug that everybody here just tryna get a taste of\nYou a waste of the space that you take up\nLivin', this time around I'm not kiddin'\nI had an intuition about these women\nAnd suspicion got me lookin' at you different\nHow a man in my position can't start slippin' down these slopes\n'Cause it's all just (downhill from there)\nAs a kid I didn't learn that, but (now I'm aware)\nWhen you a youngin\nYou just tryna live your life and have some fun\nIn a world where you have yet to see how evil it's become\nIt's hard to have a dream when you deep inside of one\nAnd I know you hate them spirits so I keep em in my lungs\nI'm a Beatle to these young kids\nBut sometimes I be feelin' like a needle to these young kids\nYou had the world, you about to leave it to these young kids\nAnd we gonna show you what the love is...\n\n[Pre-Hook: Iman Omari & Mac Miller]\nStay high, go for what you know\nLet it in your mental and don't ever let it go\nIt won't stop!\n\n[Hook: Iman Omari & Mac Miller]\nYou can't fight the feeling, feeling\nYou can't fight the feeling, no (it won't stop!)\nYou can't fight the feeling, feeling\nYou can't fight the feeling, no\n\n[Verse 2: Mac Miller]\nUh, and I keep a couple Most Dope homies by me\nSo there ain't too many times it's me, myself and Irene\nWe stay smokin' through the night wake up, do some tai-chi\nHomie can't you see I'm chillin? Please don't fuck up my chi\nYeah my jacket Y-3, recently been up on fashion\nWaste a bunch of money, kinda stinks of sastisfaction\nFell asleep in Hollywood, woke up in Manhattan\nBallin' like I'm Jordan, but I'm fresh as Mars Blackmon\nA penny for your thoughts, a dollar for your dreams\nA price on an idea, we never can agree\nThey tell you what to know, but it's better to believe\nSo why you tryna act like what you never gonna be?\nStill I tell em, \"Fuck what you know, I'm feelin' comfortable\"\nJust continue livin' life, cause enough of 'em don't\nYou spent your days countin' every single penny made\nRestart now, cause we comin' for you anyways\n\n[Pre-Hook: Iman Omari & Mac Miller]\nStay high, go for what you know\nYeah, Macadelic...\nLet it in your mental and don't ever let it go\nIt ain't never gon' stop cause\n\n[Hook: Iman Omari & Mac Miller]\nYou can't fight the feeling, feeling\nYou can't fight the feeling, no\nI told you it won't stop cause\nYou can't fight the feeling, feeling\nYou can't fight the feeling, no\n\n[Verse 3: Kendrick Lamar]\nSometimes I wake up, up in the morning, make up\nWipe the smudge of makeup off my bed\nSoon as she’s gone and take up\nHours out my day just to find power shit to say\nBut you won't hear it\nEven if your ears was pierced with Beats by Dre\nI mean the sun is slowly falling, we all surely should die eventually\nSo what's your calling? Oh you left your phone behind?\nIdentity crises break mirrors, vices steer us through wickedness\nJesus Christ is right near us and Devil said you owe ten percent\nSold your soul, I know, sold your soul and you're hopeless\nMy focus, stare at elopin' on boats that float in the open\nOf oceans that coast the line on the margins I rhyme, choking\nOr soaking up game, I'm hoping you picked the second one\nChange the emotion of jealousy that you're holding\nYou're telling me that you're golden but really cubic zirconia\nLet me see, I'll break you down like a pound of fire, whenever\nYour tactics are mighty clever but even if you Mayweather, you\n\n[Hook: Iman Omari & Mac Miller]\nYou can't fight the feeling, feeling\nYou can't fight the feeling, no (it won't stop!)\nYou can't fight the feeling\nYou can't fight the feeling, no\n\n[Outro]\n(women moaning)", "year": "2012-03-23", "album": "Macadelic", "title": "Fight The Feeling"}], "artist": "Mac Miller"}