{"songs": [{"year": "2016-10-27", "title": "American Hypnosis", "image": "https://images.genius.com/fd18d90f88a239743c1ad2caf0ed2a60.496x497x1.png", "lyrics": "[Intro: Saba]\nYeah yeah yeah yeah yeah yeah yeah\nAhem!\nHuh, ah, ah\n\n[Verse: Saba]\nAh, American hypnotize, been sad since about '09\nWas scared of shit in my mind, now I smile in my pic's online\nIsolation taught me patience 'bout the way to go\nHad to learn my mama depression wasn't my own\nHad to feel the pressures of the pessimism\nTrying to convince me that realism was a better vision\nNever been accepted in the ghetto, but I'm on Division\nAnd I'm livin', inability to be myself in a room full of niggas\nFocused on hittin stains and gettin' bitches\nI don't speak, I'm silent as a mouse by my own house\nWith a bit of bitterness, worried about fittin' in\nAnd my uncle in the pen taught me how to be a man\nBut he failed to mention why he did what he did\nWhy my dad had to dip 'fore I learned how to tie my sneakers?\nWhile my mama boyfriend think he hiding the fact he sell reefer\nWe was kids, that ain't mean we was stupid\nFirst time I'd seen a gun, thinking if he'd shoot it\nShotgun in my mama mouth, please don't do it\nShe ran home naked and came right to us\nAnd I go to school the next day like ain't shit happen, excelled in great grades and they ain't matter\nStandardized tests educate data\nYou love the hype shit, but they ain't Saba\nYou ain't seen addicts until my family\nGranny lost her brother, her other brother, her daddy\nYou wonder why I don't drink, wonder why I don't smoke\nWonder why I don't live, wonder why I'm so gray\nWonder what's a fun night, waiting for the punchlines\nWant the beat quantized, you should play some other shit\nNigga, we was traumatized, you talkin' 'bout the government?\nHad to get my ass whooped, fight's how we settle it\nI wish I didn't have to be famous to be important\nI used to wish that my parents could keep it cordial\nI hated my life until I played the piano\nThey raided my best friend, he red-handed\nScene of this shit like a scene of a movie\nMeanwhile, I'm the kid in the private schooling\nWearing my glasses, playing my computer\nDrawing cartoons, was a straight-A student\nOn a scholarship and I hated that\nLeft the hood, somehow I made it back\n\n[Bridge: Akenya]\nBack to life, back to reality\nWill my life, ever belong to me?\nHypothesize the definition of free\nRealize this dream wasn't meant to be\n\n[Voicemail: Saba's father]\nHey, boss, how ya doin'? It's Pops, here's my bucket list; it's pretty short. I want us to go see Vatican City, I wanna go see Mecca, I wanna visit Israel, I wanna visit Morocco, I wanna see the Egyptian pyramids, the Mayan pyramids in South America. But most importantly, what I'm saying is that I want us to all do this together. I'm proud of you, man. Peace\n\n[Outro: Saba and Akenya]\nI too am an American dreamer\nI too dream of American freedom\nI too sing an American plea\nI too scream till liberty rings and\nI too am an American dreamer\nI too dream of American freedom\nI too sing an American plea\nI too scream till liberty rings", "album": "Bucket List Project"}], "artist": "Saba"}