{"artist": "Gangsta Boo", "songs": [{"title": "Mask 2 My Face", "album": "Both Worlds *69", "year": null, "image": "https://images.genius.com/05275b2a5cae3f310f25e06511aa2191.400x400x1.jpg", "lyrics": "(Juice)\nMayne!!!! I can't I'm up in dis joint wit Gangsta Boo. I'm so Hi!\nBoogaloo! I'm so hi. Purple!! Purple!! Mayne! I'm so hi!\nGood shit Gangsta Boo\nThe Juice always blown out on dat fire shit\nI'm gettin high den a motherfucker. Damn!\n\n(Gangsta Boo)\nSome dumb boys be killin me\nActin like dey want me pounds\nI be lookin for the fires\nWe will not come in ya town\nGansta Boo the scandalous\nThat's been so freaky when she hi\nOops I ain't go lie, bump and smoke until the day I die\nRidin in the Chevy and you know I'm smokin ink mayne\nGot the bongs mayne\nLimo tinted for you hataz mayne\nCrusin through my hood\nIm hot as fuck, my life is on suspension\nI don't give a fuck\nIm constantly gotta smoke one bitch\nAs I come up on the spot to eat and sleep and do it all again\nGangsta at it again, clean as fuck I'm rollin twenty-twens\nCall my nigga dank to see if he know where some hydro at\nWhen I go get dank I got the Glock nine and a vest\nRollin through the projects lookin for dat nigga wit dat dope\nFiendin like a junkie thinkin \"damn a playa gotta smoke\"\nActin like you ballin when you only sellin nicks and dimes\nShit dis habit of mine\nGot me clickin when I'm on the ground\n\n(Chorus 4x)\nMask 2 my fuckin face I'm fiendin to increase my high\nEye balls is like red as hell dese bitches better recognize\n(could dat fuckin fuckin ink conservin deal dats some shit)\n\n(Gangsta boo)\nSo I got dis ghetty green\nLook here nigga I'm a star\nBout to hit the corner and rap\nStoned and get leaf cigar\nI don't smoke on seeds\nBut not to dis\nThe ones unfortunate\nIf you need me, hook up wit me, I'll smoke you to death\nAll my niggas on dat good dope, If you hi just clap yo hands\nAll my niggas on dat good dope, if you hi just clap yo hands\nTake a trip to Amsterdam\nSmoke a blunt wit lady man\nAlways chiefin gotta wake up wit a blunt up in my hand\nIt be funny how you dig\nCuz you got green and me and you be friends\nIf I let you smoke wit me, you lucky I'm a keep it real\nI don't give a fuck about a beg or tryin to smoke my weed\nIf you got some money you need to put half on dis fuckin green\nDon't play wit the muthafuckin funky dont play\nSmokin on some hay\nOnce again hid in the black Hay (haven)\nActin like you ballin when you only sellin nicks and dimes\nShit dis habit of mine\nGot me clickin when I'm on the ground\n\nChorus til end"}]}