{"songs": [{"image": "https://images.genius.com/5d9e05cbc201692dd4f9923ce5290122.268x268x1.jpg", "lyrics": "[Intro: Loski]\nCome like Stevie Wonder\nSound like thunder\nNow look at the state of his jumper\nBlade on hip like hunter\n\n[Chorus: Loski]\nSee us in the field and they all act blind, come like Stevie Wonder\nShotty too long man chop it, chop it, sound like thunder\nAim at your chest not under, now look at the state of his jumper\nOpp block tour go check that score…\n\n[Verse 1: Loski]\nOpp block tour (ayy wet him up, wet him up)\nWant blood ‘pon them, want blood ‘pon them\nWe step for the kill of course\nGet nicked for the drill don’t talk (don’t talk, don’t talk, don’t talk)\nBut I ain’t been nicked for one\nI feel sorry for the paigon’s mothers\nHow many times have we bored their sons? (how many?)\nWe came through and them boy dere run (dash)\nWhy love chat when you know we’ll come? (chatting)\nI love bore tongue on a gorgeous one\nLoski Loose love splash for fun (drip, drip, drip, drip)\n15 inch get vicious, I don’t know nuttin’ ‘bout slippin’, fishin’\nBet I see bare man trippin’ (muhh)\nStill Kenny Bop and tell Mad Max done him (done him)\nThey chat, I came round bussin’ (bussin')\nHandtings or Teddy start brucking\nCocky as fuck all my opps are nuttin’ (none of dem, none of dem)\nTalk on my name don’t do it (don't do it)\nTry do 12 I was pissed that day, cah I only made 7 go through him\nBack out your mash but your ting was fake, or you never had corn that day (mhm)\nBack out your splash, why would you dash?\nI’ll ching out your back\nCan I know you ain’t brave (why you run? why you run?)\nSparta man crash with a K, SA or SD love shave\nOnly time that we dash from jakes\nShotty too long like Bellz, It’s bait\n\n[Chorus: Loski] x2\nSee us in the field and they all act blind, come like Stevie Wonder (coward)\nShotty too long man chop it, chop it (muhh), sound like thunder\nAim at your chest not under, now look at the state of his jumper (yuck)\nOpp block tour go check that score, keep blade on hip like hunter\n\n[Verse 2: Incognito]\nBeat that case, dodge 25\nYou know dat my ting different (ayy, ayy)\nCats they kitting, trap make figures, dem man ran like bitches (mash bread)\nWe step we get a boy chopped\nJB expose the sword that he tucks\nIncog move too Crasis, been on 10 toes with that mop (crasis, crasis)\nCrasis I been too choosy\nOld one she brown, she bouije (bad)\nUp front on pitch like Rooney\nOpp dem chat but still can’t do me (naa)\nI got mates that move too bookey\n2 shotgun that’s unruly\nWho’s that? What’s that? Rambo saucy\nGerman push start doing no stalling (skr, skr)\nStep for the kill of course (course)\nDem boy can’t war SK or Crasis, Incog stay on jawns (no way)\nBrown she bad don’t talk\nGB step leave the whole place bored\nMe, JB, opp block do tour\nWe splashed man down main road\nThat day should’ve dashed when I try do 4 (shh, shh, shh, shh)\nBad and bouijee, she no practice\nShe like man with style that are flashy\nTrapfit, jumping line doing backflips\nI ain’t ‘bout all this gang ting\nMe, JB we lurk, we get splashy\nBack then put them tools in that cabby\nBeat this case but I ain’t on bragging\nBeat that case but I ain’t on bragging (ayy, ayy)\n\n[Chorus: Loski] x2\nSee us in the field and they all act blind, come like Stevie Wonder (coward)\nShotty too long man chop it, chop it (muhh), sound like thunder\nAim at your chest not under, now look at the state of his jumper (yuck)\nOpp block tour go check that score, keep blade on hip like hunter", "year": "2018-04-13", "album": "Call Me Loose", "title": "Stevie Wonder"}], "artist": "Moscow17"}