{"artist": "Waka Flocka Flame", "songs": [{"year": "2013-06-11", "lyrics": "[Intro: Waka Flocka]\nSquad!\n(I’m drinking champagne one deep in my phantom ghost Uh!)\n\n[Verse 1: Waka Flocka Flame]\nI’m drinking champagne one deep in my phantom ghost (Uh!)\nBad bitch with me wonder where my manners go (Turn Up)\nMy youngings sick, sick, where the antidote? (They geekin')\nAiming at your top, bust you cantaloupe (Pussy)\nHe forty-six and he's still selling dope (OG)\nHow the fuck you ballin' with a car note? (How the fuck?)\nI’m in the trap, real shit where the felons go (Squad)\nCury never had a job, he always used a bowl (Whip it)\nThem youngin’s run up in your house what it's hitting for\nNo mask just to let you know who did it ho\nI’m from Riverdale, all I know is get it in (Riverdale)\nI got weed, I got mollies, what you tryin' to spend?\n\n[Hook: Waka Flocka Flame]\n50k for a show and my niggas sellin’ schwag\nShe's a red bottom bitch Versace shirt, Birkin bag\nI'm a get money nigga, don’t use the card, or keep a tab\nBefore I leave my fucking house, grab my pistol and my flag\nThumbing through the bands I be playing with a check, uh! (x4)\n\n[Verse 2 : Waka Flocka]\nMy foreign car painted flat black (Turn Up)\nMy girl hopped out ass fat (Damn)\nPaparazzi keep flashing pictures (Flocka)\nBroke niggas looking wanna be these niggas (Pussy)\n4 grams in my Backwood (I’m smoking)\nMillionaire nigga still keep it hood (Riverdale)\nPay the extra 60 for that steel hood\nPhantom ghost got a nigga living good (Turn up)\nI bet your bitch want a nigga\n(Hey come here shawty)\nI bet she wanna fuck a nigga\n(Hey come here shawty)\nNever be a broke nigga (Hell naw)\nShe like \"Fuck gold!\" shawty she a platinum digga\n\n[Hook]\n\n[Verse 3: T.I.]\nDope boy fresh, hell on the scale, shorty\nTrap nigga ask Red Cross in Riverdale\nBitch I still run the South, got them mils at the house\nBunch a bad ass bitches like to chill at the house\nI dont fuck with none of them suckers but they bitches on my dick\nGot my youngin with my buss at anything I tell him hit\nBought my girl a .45, told her put it in her purse\nSpent 350 on a vert, made a hundred for this verse\nTold Flocka you can bring this shit in cash or in work\nHe brought twenty and a bag, I say fuck it, that’ll work\nYou don’t want to be caught in my dope spot, nigga\nTalking 'bout your silly bitch get you both shot, nigga\n\n[Hook]", "image": "https://images.genius.com/8353f98864cf50edc55e1f157070c010.500x500x1.jpg", "album": "DuFlocka Rant: Halftime Show", "title": "50k (Remix)"}]}