{"artist": "Ice Cube", "songs": [{"title": "I’m Scared (Insert)", "lyrics": "[Woman #1:]\nI was raised to be white-black, I was raised to be equal to anyone. Listening to you, you are so prejudiced I just can't believe it! I am shocked! You're scaring me!\n\n[Woman #2:]\nWhat is he saying that you have a problem with?\nWhat is he saying that you have a problem with?\n\n[Woman #3:]\nWhat scares us is I think we hear violence\n\n[Woman #4:]\nI Think you don't know what the fuck it is you talkin' about\n\n[Woman #3:]\nI'm so scared to go out in the world next year, because I was never a prejudice person until listening to you, it's really scary hearing what you're saying, I'm very scared!\n\n[Woman #2:]\nWhat is he saying that you have a problem with?\nWhat is he saying that you have a problem with?\n\n[Woman #3:]\nWhat scares us is I think we hear violence\n\n[Woman #4:]\nI Think you don't know what the fuck it is you talkin' about\n\n[Woman #3:]\nThey're saying questions about us fearing, white people fearing, you know, what will the black folks do and stuff, we should be running down the streets, screaming and ranting and raving cause when you look at the statistics, Who is the one dying? From the policemen? From the KKK? From the skinheads?\n\n[Woman #3:]\nWhat scares us is I think we hear violence\n\n[Woman #2:]\nWhat is he saying that you have a problem with? And why is it when a black man stands up to speak for his people, and all the people stand up to speak for their people, there's no problem with it?\n\nBut you saying\nHe said \"black\", he said \"jew\"\nWhen people talk... they talk like that\n\nBut why is it when a black man stands up to speak for his people, you feel so threatened? Everybody's paranoid?\n\nAnd you talk about black segregation? We live in Harlem and we live in Watts. We live in Bedford–Stuyvesant. That's a form of segregation. We walk through Bensonhurst. We get killed. So what are you talking about?", "image": "https://images.genius.com/aa204256470ef9ed3c3a3fbcc1ee43da.1000x1000x1.jpg", "album": "The Predator", "year": "1992-11-17"}]}