{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/6bd31dbf732499119628ee22f6aeece3.500x335x1.jpg", "title": "​orion’s belt", "year": "2012-06-01", "album": "haha, i’m sorry", "lyrics": "[Verse 1: Kitty Pryde]\nRap game Taylor Swift, 45 on my hip\nAnd I'll lift up, a switch up hip hop with Riff\nDatpiff, no downloads 'cause I am not gifted\nI sift in through the shit on Twitter, I wanna quit it\nBut I spit it on the Beautiful Lou\nAnd tell the Kitty lovers, baby, you are beautiful too\nBlonde haired girls that put the youth in the crew\nAnd if you bring me around, I'll put some youth in you too, boo\nI am the rap game tease, in the trap\nWhere I be's with the Adderall fiends and the assholes\nWee! I can rap, I'm not mean, but you're whack\nIn the backseat, cypher's hyper on the track\nWee!\n\n[Hook: Kitty Pryde]\nWee, I can rap, wee-wee, I can rap\nI'm not mean, but you're whack, mean-mean, but you're whack\nWee-wee, I can rap, wee-wee, I can rap\nI'm not mean, but you're whack, mean-mean, but you're whack\n\n[Verse 2: Riff Raff]\nWhen it comes to hateful words, I got skin like a rhinoceros\nDiamonds on my binder, fourth grade I was immaculate\nReading, writing, arithmetic; my favorite? Mathematics\nMarked my paper more than average\nYou bastard rappers you should go play in traffic\nThe way I ball, I could've played for Toronto Raptors\nOlympic swimmers from Nigeria, emeralds in my ears\nSo far from clear 'cause they resemble frozen lettuce\n91 degrees out in Belgium, you ever seen melted lime jello?\nDid I confuse you losers? I pull up in the candy relish\nRap game Peppermint Patty and the lavender bumble bee jackets\nYour girlfriend's vagina smells like Bumble Bee tuna\nShe duct taped me to the dumpster\nOtherwise I woulda left sooner\nRiff\n\n[Hook: Kitty Pryde]\nWee, I can rap, wee-wee, I can rap\nI'm not mean, but you're whack, mean-mean, but you're whack\nWee-wee, I can rap, wee-wee, I can rap\nI'm not mean, but you're whack, mean-mean, but you're whack"}]}