{"artist": "Knoc-turn’al", "songs": [{"image": "https://s3.amazonaws.com/rapgenius/knocturnal.jpg", "title": "Str8 West Coast (Remix)", "year": null, "album": "L.A. Confidential Presents... Knoc-turn’al", "lyrics": "[Knoc-turn'al]\nSuper ugly!\n\n[Xzibit]\nMr X to tha Z\n\n[Knoc-turn'al]\nYeah, Warren (aaahaaa aaaahaaa)\nLA indo\nGangster and mack mo\nBullets at your window (dangerous)\n\n[Xzibit]\nRuthless, hostile, unforgiven\nWho gave you permission to try to stop me from livin huh?\nTry again faggot\nYou've gotta ride better than that\nTo move out in front of the pack\nIt's two thousand and two\nMy backpack raps got my backpack strapped and filled with plaques\nI ain't relaxed or laid back at home with my feet up\nI drop Pradda, lock and load, heat the streets up\nYou weak fuck\nShakin and dancing\nYa'll takin pills, we takin penitentiary chances\nI'm too advanced-is\nNever the same when I hit it and quit it\nYou want it come get it, I'm wit it\nWhen I say that I'm wit it\nThat means I got a main defense team that's gon get me acquitted\nG's is walkin out the courtroom like George Jefferson\nStop the interviewin, the faggot had it comin to him\n\n[Knoc-turn'al]\nWarren G!\n\n[Warren G]\nWhat ya'll thought, I wasn't gonna return with a hit\nToo much smokin that Sherman shit\nI learnt this from the best that got ya'll sprung (what)\nThe-the doctor Andre Young\nCompton, LB, ain't nothing y'all can tell me\nGoin hard on the yard till my dogs bail me\nThey tells me I can't proceed wit it\nI came back and got Warren G wit it\n\n[Nate Dogg]\nWest coast\nStill smoking on that indo\nSmoke, oh no don't pretend oh no\nI woulda came but I was dead break, no mo\nI'm rollin on some real oh no\nBout to get it, but niggas trip though\nLet's go\nI'm the realest and they all know\nReal dope\nYou need a filter or you will choke\nIndo\nThat's all a nigga will smoke\nOh no\n\n[Shade Sheist]\nNow, niggas better get between their door (door)\nI'm shakin all your shit onto the floor\nAnd niggas don't get it\nBut be careful what you ask for you just might get it\nYo the undisputed middle weight champ runnin like Hopkins\nClap six to ya shins niggas start hoppin (Sheist never stoppin)\nIn other words, if your click full\nCan't press mute and it don't apply now\nI'm feelin funny in the tummy and a nigga ain't been eatin for weeks (I'm sick)\nI ain't trying to get no better\nBut rather\nInfect the world leavin Vicks in an old sweater\n\n[Knoc-turn'al]\nKnoc's landin\nTell me if it ain't me, who got the best plannin (yup)\nWho got your ears tuned it and who keeps you listenin\nWho gots your undivided attention\nWho makes your panties wet girl (what)\nHold up, pause\nWhich nigga on TV that you see makes you wanna give up the draws\nAt parties and shows, I mash regardless\nYo hardest flows couldn't stop this bombardment\nI clench the vision till there's no room for expansion\nAll prepared for war it's Knoc's landin\nA nightly stalker, in shadows I walk\nMindin my own while haters throw soft\nThe more I succeed, the more bitches clock\nThrough my peripheral vision I watch subconsciously\nWaitin to introduce you to tragedy see\nKnoc's landin\n\n[Nate Dogg]\nWest coast\nStill smoking on that indo\nSmoke, oh no don't pretend oh no\nI woulda came but I was dead break, no mo\nI'm rollin on some real oh no\nBout to get it, but niggas trip though\nLet's go\nI'm the realest and they all know\nReal dope\nYou need a filter or you will choke\nIndo\nThat's all a nigga will smoke\nOh no"}]}