{"artist": "Drake", "songs": [{"year": "2015-07-29", "album": null, "image": "https://images.genius.com/8c6a8d757b3ac293ef31e3d96e013cd5.1000x1000x1.jpg", "title": "Back to Back", "lyrics": "[Intro]\nOh man\nOh man, oh man\nNot again\n\n[Verse]\nYeah, I learned the game from William Wesley, you can never check me\nBack to back for the niggas that didn't get the message\nBack to back, like I'm on the cover of Lethal Weapon\nBack to back, like I'm Jordan '96, '97\nWhoa—very important and very pretentious\nWhen I look back, I might be mad that I gave this attention\nYeah, but it's weighin' heavy on my conscience\nYeah, and fuck, you left The Boy no options\nI wanna see my niggas go insane\nYou gon' make me step out of my fuckin' frame\nYou gon' make me buy bottles for Charlamagne\nYou gon' make me go out of my fuckin' way\nI waited four days, nigga, where y'all at?\nI drove here in the Wraith playin' AR-AB\nI'm not sure what it was that really made y'all mad\nBut I guess this is what I gotta do to make y'all rap\nI mean woah, can't fool the city, man, they know what's up\nSecond floor at Tootsies, gettin' shoulder rubs\nThis for y'all that think that I don't write enough\nThey just mad ‘cause I got the Midas touch\nYou love her, then you gotta give the world to her\nIs that a world tour or your girl's tour?\nI know that you gotta be a thug for her\nThis ain't what she meant when she told you to open up more\nYeah, trigger fingers turn to Twitter fingers\nYeah, you gettin' bodied by a singin' nigga\nI'm not the type of nigga that'll type to niggas\nAnd shout-out to all my boss bitches wifin' niggas\nMake sure you hit him with the prenup\nThen tell that man to ease up\nI did another one, I did another one\nYou still ain't did shit about the other one\nI got the drink in me going back to back\nYeah, going back to back\nI got the drink in me going back to back\nYeah, I'm going back to back\nI don't wanna hear about this ever again\nNot even when she tell him that they better as friends\nNot even when you saying, \"Drizzy, tell 'em again!\"\nI been puttin' on a show, it was a sell-out event\nOh, you need better seatin'\nI didn't wanna do it, gave me every reason\nThe point I'm tryin' to make is I don't ever need 'em\nSeen what you’d do for fame, what would you do for freedom?\nPlease, check 'em for a wire or a earpiece\nPlease, please do not let these niggas near me\nPlease, think before you come for the great one\nPlease, who's a real nigga and who ain't one?\nPlease, somebody stop me\nI'm talkin' boasy and gwanin wassy\nI got the fest in five days and it's my shit\nSoon as a nigga hit the stage, they gon'...\nThey gon' ask if I can play this shit back to back\nYeah, they want it back to back\nThey gon' ask if I can play this shit back to back\nI took a break from Views, now it's back to that, nigga (Six)"}]}