{"artist": "Pacewon", "songs": [{"album": "Won", "title": "Locked", "image": "https://images.genius.com/51988e399d7fd0c27dc7bf9671e91b51.600x600x1.jpg", "lyrics": "[Pacewon]\nUh-huh.. yo, uh-huh\nYo I got it locked like the mob on my block\nThe local rap star that the fine women watch\nMy sister used to say that I shoulda been a cop\n'til I pulled up in the fully tinted drop\nUntil I rapped on the ninety-six album of the year\nNow she don't think I'm so weird\nNow when I pop in the tape she wanna listen\nKissin my ass; like back in ninety-five she wasn't dissin\nNow I got a deal and I'm steppin with a piston\nC.O. executive position\nThe wisdom of a man doin life inside prison\nAll he do is read, smoke stogs, and be liftin\nThe vision of how I can overcome the system\nPace will be a legend in his time like Sonny Liston - locked\n\nYo I got it locked, on the real I got it locked\nRollin with the kids that wanna rock\nYo no doubt I got it locked, word life I got it locked\nWhip my 540 on your block\nYo don't try to look hard like you holdin down the spot\nDon't try to look away like you ain't on the jock\nCause I'm comin with the Outz and we takin whatchu got\nBeefin like B.I.G. and 2Pac\nYo I got it locked like the Feds that be watchin where you plot\nLocked like Gotti, but headin for the top\nGet my money up, push Hummers off the lot\nL and registration, ridin with a fox\nSet to \"Wild Out\" like I'm runnin with The L.O.X\nDon't make me put you in a pine box - locked!\n\nIt's like Pacey-come-lately, happy-go-lucky\nBeat y'all kids like, \"Pappy don't snuff me\"\nDon't want her if she ugly, two-faced or chubby\nKeep my mother lookin lovely, give her money\nSee I need the finest in life, cameras and lights\nHammers and ice, people feel me - the good stuff!\nBlow my whole neighborhood up, glad I stood up\nPut flavor in your mix like sugar\nLock your girl down like Booker; never fall in love with a hooker\nOr cracked out broads that smoke cook-up\nCould be she fine now well off and she a looker\nAnd know how to work the pressure cooker\nBut drugs is more addictive than love, kisses and hugs\nPeople slip and get hung, grippin they lung\nMy nigga gettin this money is my number one agenda\nTie your raps up like, \"please return to sender\"\n\nLocked - I got it locked, no doubt I got it locked\nMixin up the beef with the broc\nYo on the real I got it locked, you see I got it locked\nUnderground never go pop\nBaby heads all bring they friends we drop, do the wop\nGettin mad bent off the gin and the scotch\nI'm hittin off the skins then I'm audi from the spot\nLocked!", "year": null}]}