{"artist": "Cappadonna", "songs": [{"title": "Criminal Mind", "album": "Wu-South", "year": "2008-03-26", "image": "https://images.genius.com/428306dd65a2bd3482e1d0f1594a9889.300x300x1.jpg", "lyrics": "[Killah Priest]\nI fought off dragons with large wings, boxed dragons\nDressed as a gladiator, inside God's ring\nThe hearts of kings were eaten by the beast\nTheir flesh hung from their teeth, my right arm under his feet\nMy left arm pulls the gun, from out of the sheet\nBlasted his stomach, body tumbled all over the streets\nI heard trumpets, God hand brought me to my feet\nMy G., we resting five devils over the five boroughs\nBroke the walls, into the tri-boroughs\nGoing through the ocean floors, going through the walls\nGoing through the malls, we just brawl and brawl and brawl and brawl\nHe went for my Adam's apple, blood splashing all over the tabernacle\nPull out swords, I got saws, he grabbed his gun, then I grabbed gats too\nStart clapping, he collapsed and look what the mack do\n\n[KMC]\nWe tough in the physical, tough in the spiritual\nWatch it boy, you get dropped for the ritual\nI pray to lord, to bless my soul\nYou come too close, our thoughts is cold\nWe're rough with the AK, so if you not\nMake way, some of these get murdered\nWe rough with the fo-fo, so what we argue for?\nBust mine, somebody get murdered\n\n[Cappadonna]\nYo, it's New York in effect, it's time to get ill\nSurvival of the fittest, this is shit is for real\nI've been sleeping all day, now I'm finally woke\nAnd I selling no crack, and I slinging no dope\nI'm a frontline nigga, stuck in the grind\nYo before I couldn't see, 'cause I used to be blind\nNow I'mma smoke weed nigga, rock my shine\nLick a shot for The Punisher, and pop my nine\nA'udhu Billahi Min ash-Shaitan ir-Rajeem\nAllahu Akbar, caught Don Alon's fiend\nJails can't hold me, it's no cure for this\nI smacked ya'll devils, outta my myst\nTake the gun from ya hostler, grab your stick\nI got a hatred for evil, son, times is hard\nCan't destroy my heritage, we the armor of God\nLightning bolts hit your face, break your facade\nProphets and war mongers, leave you scarred\nThe hell fire gon' come, the fucking Goon Squad\n\n[Scratch Samples]\n\"Lit rings\"...\n\"Bangin' in yo hood\"\n\"See, this the pusha\"\n\"Goon's Squad visual, this that..\n\"Fire, fire..\"\n\"It's defenitaly still\"\n\n[Rush]\nYo, my full time criminal mind, in overtime mode\nCold blooded, you get your face piece flooded\nNo ifs, ands, buts about it, who bout it bout it?\nMy body banger stay crowded, like rush hour\nTurn a sweet thing sour, I pack a monster\nSend shots for ya roster, who wanna trot?\nEvery man wanna go to heaven, but scared to die\nRevenge I cried, try'nna take the crown from my\nHead piece, Selassie 'dad, rest in peace\nWho want peace? Change ya culture to kosher\nFucking with me, will have me on the wanted poster\nDead or alive, only the illest survive\nKilla Haile, ride by the law of the land\nMan to man, hold a steel, hand in hand\nYou over the hill, still too, old to spill\nI roll for real, black down, dressed to kill\nUntil hell freezes, you better beef with Jesus\nLike pussy teasers, I get you soakinng wet\nNigga fronted on my style, and I broke his neck\nRun the respect, like I'm standing here with a tech\nWhat you expect? Me must stand, the next man\nThe best man will die with his dick in his hand"}]}