{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Whatever it Took", "album": "The Unforgiven Volume One", "lyrics": "Hey Dott Dogg...muthafucka was out there in them streets\nNigga did whatever it took to get in nigga\nFrom the jackin', to the rappin', to the slangin' crack and...\n\nFirst Verse:\n\nX-Raided up in this bitch, bout to disrupt some shit\nAin't from the pound, but I'm still down to Kurupt some shit\nInterrupt your shit, cuz I'm always in a rush to spit\nLike an axe, when I rap, I splitter up your clique\nYou better relax, be a witness or a participant\nEddie Gaffin' laughin' at the CO, wonder where the Sergeants went\nSee we flow, but it's way more bigger than that\nRansom note, deliver the gats and all them wack ass tracks\nSo we slit his throat, it's malicious, but the game's vicious\nAnd niggas know, we'll do anything that gains us riches\nWe quick to flow, but we just as quick to bark that heat\nStart that beef and Dott Dogg will pause that heartbeat\nWe hard to beat, like Schwarzanegger in movies bout factual\nBurning niggas like third degree\nCritical surgery\nWhen I'm mad, you hoes burglary, intrudin' your home\nStole everything like clepto includin' your dome\nLeft your ass chewed up, gaze blast, mid-section blew up\nBet you all five homicide detectives threw up\nSuit up, in coca sacks then I smoke a bag\nThey make me get my focus back, then I choke the gat\n\nChorus:\n\nWhen it came to gettin' that money I did whatever it took\nFuck dividin' the power, wanted every cranny and nook\nUnderstand me nigga, my family is full of thugs and crooks\nKings and queens protected by knights, bishops, and rooks\n\nSecond Verse:\n\nYou better look into my eyes, can't you see the pain?\nI'm tired of lies, bitches and niggas playin' games\nThis is my ghetto prayer, Lord can you hear me?\nProtect my family from player haters, don't let 'em near me\nNo need to fear me, I'm only human\nPursuin' dreams for greenbacks with more schemes, than J.R. Ewing\nI mean that sincerely\nLove my alcohol and tetrahydracanebanol dearly\nConsumin' twenty pounds yearly\nClearly I'm out for the cash, nothin' else in my vision\nTakin' chances, makin' decisions that could keep me in prison\nBut circumstances keep demandin' me to break these laws\nWritin' lyrics strong enough to, penetrate these walls\nDott Dogg,don't feel I'm guilty\nAs charged, I'm filthy really\nDown for the cause, and I'm comin' raw til' they kill me feel me\nWith slugs to the dome, ain't no love so it's on\nAnd if you ain't thuggin' with me nigga, then I'm thuggin' alone\nI'm a ruggish bone like Bizzy, Wish, Krayzie, Layzie and Flesh\nArt of War to the last breath, nigga ride to the death\nWe hardcore, Dott Dogg and Nefarious\nMad man, Black Market til' they bury us\n\nChorus (2x)\n\nThird Verse:\n\nI'm constricted on y'all ass like a python\nI'm ready to spit some venom, turn this mic on\nRun up in em\nCheckin' them niggas like a chess board\nCuz they be hatin', what'cha think I sport a vest for?\nPremeditatin'\nYes Lord I got my eye on'em\nWhen they try to get me I'ma have a fat surprise for 'em\nGot some advice for 'em\nYou better recognize, Raided ain't down for none of that bullshit\nGot a full clip, and this man eater won't hesitate to pull it\nAnd deliver the bullets to your chest like a mailman droppin' off letters\nFat hole in your sweater\nSmash out with all your cheddar\nMet a nigga that had much game, deeper than the abyss\nTaught me such thangs as how to get fame and keepin' cash in my fist\nNow I insist to get my scrilla scratch\nHow real is that?\nAnd I'm quick to peel a niggas cap\nIs you feelin' that?\nMove swiftly when I see the cops, cuz I ain't scrillin'\nMuthafuckas wanna see me drop, but I ain't willin'\nYou a pawn in my book\nBusta market a hook\nSaw the fear in your eyes the first time that I looked\nI'ma treat y'all niggas like powdered cocaine it's time to get cooked\nI'm Michael Jordan, you the average guard about to get shook"}], "artist": "X-Raided"}