{"artist": "Pusha T", "songs": [{"album": "DAYTONA", "title": "Infrared", "image": "https://images.genius.com/99199dd6e0f60ef05789ba2cbe2a5d9b.1000x1000x1.jpg", "lyrics": "[Intro]\nInfrared, yeah, you know what I mean?\nInfrared, yeah, you know what I mean?\n\n[Verse]\nThe game's fucked up\nNiggas’ beats is bangin', nigga, ya hooks did it\nThe lyric pennin' equal the Trumps winnin’\nThe bigger question is how the Russians did it\nIt was written like Nas, but it came from Quentin\nAt the mercy of a game where the codes is missin'\nWhen the CEO's blinded by the glow it's different\nBelieve in myself and the Coles and Kendricks\nLet the sock puppets play in their roles and gimmicks\nShit, remember Will Smith won the first Grammy?\nAnd they ain't even recognize Hov until \"Annie\"\nSo I don't tap dance for the crackers and sing Mammy\n'Cause I'm ’posed to juggle these flows and nose candy (yugh)\nFerrari, my 40th, blew the candles out\nTom Brady’d you niggas, I had to scramble out\nThey be ridin' these waves, I pulled my sandals out\nJefe Latin my Grammy, I went the Spanish route\nOh, now it’s okay to kill Baby?\nNiggas looked at me crazy like I really killed a baby\nSalute Ross 'cause the message was pure\nHe see what I see when you see Wayne on tour\nFlash without the fire\nAnother multi-platinum rapper trapped and can't retire\nNiggas get exposed, I see the cracks and I'm the liar?\nShit, I’ve been exposed, I took the crack and built the wire\nNow who do you admire?\nYour rap songs is all tryin' my patience\nThem prices ain't real without inflation\nI done flew it, I done grew it, been a conduit\nMoynat bags on my bitches, I done blew it\nSee through it, neck, igloo it\nHabla en español, I \"y tu\" it\nLet Steven talk streamin' and Shazam numbers\nI'll ensure that you gettin' every gram from us\nLet's cram numbers, easily\nThe only rapper sold more dope than me was Eazy-E\nHow could you ever right these wrongs\nWhen you don't even write your songs?\nBut let us all play along\nWe all know what niggas for real been waitin' on\nPush\n\n[Outro]\nI do, so, yeah\nInfrared, yeah, you know what I mean?\nInfrared, yeah, you know what I mean?\nInfrared, yeah, you know what I mean?\nInfrared, yeah, you know what I mean?\nI'm gone, I'm gone, you hear me?\nI'm gone", "year": "2018-05-25"}]}