{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/1934a1107b759549c286680bb18eb64a.500x500x1.jpg", "title": "Here I Am", "year": null, "album": "Independence Day", "lyrics": "Aight look\n\nSoon to be the nigga on whatever\nDrunk bullshittin, gettin nough chedder\nEatin good. Little feather weight\nAlaskan crab legs on plates while I say grace\nAnd unravel the napkin\nBon appetite ya little bitch. Why you snackin?\nThat and life is just a phase\nSo I puff the ill till I got a hi-top fade\nI be all over the map. Rap. Im everywhere\nLong as I got some hotel fare, hell yea I'm there\nTurnpikes. We burn right and cloud surf\nBring me another ginger ale now, jerk\nIs what some stuartists might testify. Oh this the guy\nIs what I've always heard. This shit ain't nuthin new\nI'm classified amongst niggas who do this beautiful music\nHe be spewin, representin, have you movin through ruins\nNiggas is foolish. Middle man is out here scoopin that new shit\nI rise above it. Niggas talkin, but really jivein? They nuthin\nGotta be fuckin kiddin me. Is you serious? Niggas crazy\nOnly one life to live and I ain't signin up for no slavery\nNiggas gotten mistakin. Theys burnin, constantly bakin\n\nMy brain got me thinkin bout slowin down on that drinkin\nMy life long story told\nEverything that glitters ain't gold\nThis shit'll grab you by your ankles when you try to run so you can't go\nContracts. Beyond that and case closed\nWon't sign shit. We poppin with many options\nWe smoke and be poppin while you ponder\nBout life and your next move and transaction\nHe is a man, only if that man stackin\nI'm doin sumthin. You can if you part of the new heights\nNew endevers, new levels, new days, new nights\nSurvival of the fittest. I'm a livin witness straight out the jungle\nI just lost all my niggas\nMan this shit is gettin outta hand. Must be part of Gods plan\nDestroy and rebuild. That's why he put me on land\n\nSo here I am. Can't stop me on his arm, Jesus on his neck, ain't nobody harm. He dont rock a charm\nHere I am. Can't stop me on his arm, Jesus on his neck, ain't nobody harm. He dont rock a charm\nHere I am. Can't stop me on his arm, Jesus on his neck, ain't nobody harm. He dont rock a charm\nHere I am. Niggas. Here I am"}]}