{"songs": [{"lyrics": "[Produced by Kanye West]\n\n[Intro]\nKanyeezy you did it again, you a genius nigga!\n\n[Hook]\nLucifer, son of the morning! I'm gonna chase you out of Earth\n(I'm from the murder capital, where we murder for capital)\nLucifer, son of the morning! I'm gonna chase you out of Earth\n(So you need to change your attitude 'fore they asking what happened to you)\n\n[Verse 1]\nLord forgive him, he got them dark forces in him\nBut he also got a righteous cause for sinning\nThem-a-murder me, so I gotta murder them first\nEmergency, doctors performing procedures\nJesus, I ain't trying to be facetious, but\n\"Vengeance is mine\" sayeth the Lord, you said it better than all\nLeave niggas on death's door, breathing on\nRespirators for killing my best boy, haters\nOn permanent hiatus as I skate\nIn the Maybach Benz, flyer than Sanaa Lathan\nPumping \"Brown Sugar\" by D'Angelo\nIn Los Angeles, like an evangelist\nI can introduce you to your maker\nBring you closer to nature, ashes after they cremate you bastards\nHope you been reading your psalms and chapters\nPaying your tithe, being good Catholics, I'm coming\n\n[Hook]\nLucifer, son of the morning! I'm gonna chase you out of Earth\n(I'm from the murder capital, where we murder for capital)\nLucifer, son of the morning! I'm gonna chase you out of Earth\n(So you need to change your attitude 'fore they asking what happened to you)\n\n[Verse 2]\nYes, this is holy war, I wet y'all all with the holy water\nSpray from the Heckler-Koch automatic\nAll the static, shall cease to exist\nLike a sabbatical, I throw couple at you, take six!\nSpread love, to all of my dead thugs\nI pour out a little Louis, to a head above\nYessir, and when I perish, the meek shall inherit the Earth\n'til that time, it's on and popping, church\nLike Don Bishop, the fifth or palm cock either\nLift up your soul or give you the holy ghost\nPlease I leave you in somebody's cathedral for stunting like Evel Knievel\nI let you see where that bright light lead you\nThe more you talk, the more you irking us\nThe more you gon' need memorial services\nThe Black Album, second verse, is like\nDevil's pie, save some dessert for us\n\n[Interlude]\nMan, I gotta get my soul right\nI gotta get these devils out my life\nThese cowards gonna make a nigga ride\nThey won't be happy 'til somebody die\nOh man, I gotta get my soul right\n'Fore I'm locked up for my whole life\nEvery time it seems it's alright\nSomebody want they soul to rise\nI chase you off of this Earth\n(Let me get serious for y'all, one second)\n\n[Verse 3]\nI got dreams of holding a nine milla to Bob's killer\nAsking him \"why?\" as my eyes fill up\nThese days I can't wake up with a dry pillow\nGone but not forgotten, homes I still feel ya\nSo, curse the day that birthed the bastard\nWho caused your church mass, reverse the crash\nReverse the blast then reverse the car\nReverse the day and there you are, Bobalob\nLord forgive him, we all have sinned\nBut Bob's a good dude, please let him in\nAnd if you feel in my heart that I long for revenge\nPlease blame it on the son of the morning, thanks again", "title": "Lucifer", "image": "https://images.rapgenius.com/db98dd9c59a51c9b6b76f6d6a32cac9f.991x1000x1.jpg", "year": "2003-11-14", "album": "The Black Album"}], "artist": "JAY-Z"}