{"songs": [{"album": null, "image": "https://images.genius.com/f9c084d7abdf5afe472b8313d9a4b1fc.480x360x1.jpg", "year": "2011-11-22", "title": "Beat It Up", "lyrics": "[Verse 1: T. Mills]\nI'm startin’ with some purple keep my eyes low\nI mix it with sativa in a cyclone\nGet the fuck back, cause I’m blown\nI don't buy sex, cause I buy in bulk\nWait who’s that she's looking right\nThe kind of girl you stay fucking for a couple of nights\nShe got a couple grams, I got enough joints\nShe wants to light up in bed, I beat it up like\n\n[Bridge]\nI hold it down like a George Foreman\nOverhead in the bed you know I’m performing!\nDamn, million, yeah I push it to the maximum!\nLike a credit card charged to the maximum!\nTulips, No flowers, two lips, two hours\nAnd I hit that bitch with magic, I got super power\nBitches call me Travis, and groupies call me T\nI just got off the phone with juicy, we got hoes in Tennessee\n\n[Hook]\nI’ll beat it up like\nThis beat is up like\nI'll beat it up like\nGive it to you girl every time\nAnd those other guys ain't got nothing like mine\nHit it from the front to the back\nAnd baby I ain't done, till I make you say yeah!\n\n[Verse 2: Juicy J]\nAll I got is strippers and porn stars\nThey at me like a brand new foreign car\nLet’s smoke a lot of dope\nI stay in pimp mode\nI got a hotel with three hoes bending over!\nYou know it!\nWith a whole lot of liquor and a party pack\nThey bought skittles all day, bring all the bitches back!\nDon’t bring your girl around me if you don't wanna lose her\nI got naked pictures of her, I might show it to you\nShe freak, when I’m hanging with the trippy geek nigga\nSo high, they drink syrup by the pitcher\nJuicy J big and his bank account way bigger\nGot pussy flowing like a river\n\n[Hook: (x2)]\nI’ll beat it up like\nThis beat is up like\nI’ll beat it up like\nGive it to you girl every time\nAnd those other guys ain't got nothing like mine\nHit it from the front to the back\nAnd baby I ain't done, till I make you say yeah!"}], "artist": "T. Mills"}