{"artist": "Wax", "songs": [{"year": "2011-07-21", "lyrics": "[Verse]\nEat a dick\nOr at least eat a Pita chip, right after I skeet on it you piece of shit\nTell your lie speaking lips they should try pleadin' fifths\nMore often, bitch, and refer to me as 'Your Awesomeness'\nYou saying me and so and so are comparable\nThen I look up so and so and they're terrible\nYou disgust me\nTrendy rappers fall the hell off the map\nAfter just one listen I can tell off the bat\nThere will never been a time that I have to rewind it\nOn some 'God damn, what was that line?' shit\nIn fact I find it, rather boring's the category I put them in\nFast forward that whack verse I'd rather hear the hook again\nI would rate your skills very low level\nAnd your softness is at a Pillsberry dough level\nMe, I've got the gold medal flow that'll put my on the freaking podium\nYou're child's play, you Nickolodeon\nI'm about to sprinkle sodium all over them wounds\nBig Wax, EOM, homie. Don't get confused\nShouldn't get your hopes up when you know you gon' lose\nYou won't accomplish anything, if you don't pay your dues\nI'm saying, with all the shit I've charged to the game\nThe game should issue me a credit card in my name\nNo we aren't the same. You a motherfucking ant size\nMy catalogue's Jack's beanstalk plant size\nI'm sick of y'all saying y'all spit well\nWhen y'all shit sound like dog shit smell\nSeriously, take it back and say you're joking\nWhen you rap, everyone behind your back does that masturbating motion\nI've worked hard for this\nWhile y'all half assed it\nRaised the white flag, matter fact, half mast it\nHalf this rap shit that you hear is half plastic\nThe other human half is a lying ass bastard\nFake biters like dentures\nWriting their bios based on someone else's adventures\nI be confusing the censors with the shit that I speak\nCause they don't know if its some shit they should bleep\nThey're like \"Damn, that the fifth time this week\nThat I've witnessed a sheet\nOf lyrics from this geek\nOn my desk for inspection\nTo bleep or not to bleep is an excellent question\nThese words have yet to receive Webster's attention\nSpanish Webster is still fucking with the gender\nOnly point I'm trying to make, to give em something to remember\nWhen they're spitting on the microphone, or strumming on a Fender\nThese kids get mixed up like cumming in a blender\nSame goes for you lame trolls blogging\nI would recommend less dick riding and more jogging\nYou at your computer desk, sipping your Super Big Gulp\nEating Little Debbie snacks and Newton's full of fig pulp\nI'm talking to you, it's sunny out, enjoy it\nThe bicycle you purchased was like money down the toilet\nYo, it's funny how steroided your confidence seems\nWhen the last time you got laid Hipsters were rocking big jeans\n2Pac was in his teens. Variations of the running man were popular routines\nLittle NAS was up in Queens yet to write. It ain't hard to tell\nHe was still busy watching the Smurfs battle Gargamel\nFuck it. I'll just keep rapping great\nOutside of the box like you used cheap packing tape\nTry again. There's no time to waste\nJust make sure the drawing board you go back to is dry erase\nThat shit you Sharpie ain't gone never be sharper\nUnless that Magic Marker is an actual magical marker\nEven then, it'd have to have a good battery charger\nCause I've been rapping since Eric Clapton was back with the Yardbirds\nI wish you the best of luck\nIf y'all agree with me that most rappers suck\nThen make like a rake on the back of a landscaping truck\nAnd stand the fuck up", "image": "https://images.genius.com/fb787dca8b948515112767aae31f8fda.630x630x1.jpg", "album": "Eviction Notice", "title": "Coins"}]}