{"songs": [{"album": "2014 Forest Hills Drive", "year": "2014-12-09", "title": "A Tale of 2 Citiez", "image": "https://images.genius.com/2f88c0a52697a42d3d0fb1e3276d2411.640x640x1.jpg", "lyrics": "[Produced by Vinylz]\n\n[Verse 1]\nSince a youngin' always dreamed of gettin' rich\nLook at me my nigga\nFantasize about a white picket fence\nWith some trees my nigga\nUsed to want a Pathfinder with some tints\nThat's all I need my nigga\nThrow some 20's on that bitch and get it rinsed\nBut now I see my nigga\nThat the world's a lot bigger ever since\nPicked up the paper\nAnd they say my nigga Eddie caught a body, I'm convinced\nAnybody is a killer, all you gotta do is push 'em to the limits\nFuck being timid in the Civic\nPoliticin' with the pushers and the pimps\nI'm tryna write a story, can I get a glimpse?\nYeah, can I get a glimpse?\n\n[Hook 1]\nLast night I had a bad dream\nThat I was trapped in this city\nThen I asked is that really such a bad thing?\nThey robbin' niggas on the daily\nCan you blame a nigga that ain't never had things?\nGuess not! (What's the value of a thing?)\nLast night they pulled up on my nigga at the light like—\nUgh, nice watch, run it\nHands in the air now, hands in the air, run it\nHands in the air now, hands in the air, run it\nHands in the air now, hands in the air\nHands in the air now, hands in the air\n\n[Bridge]\nSmall town nigga Hollywood dreams\nI know that everything that glitters ain't gold\nI know the shit ain't always good as it seems\nBut tell me till you get it how could you know?\nHow could you know? How could you know?\n\n[Verse 2]\nListen up I'm about to go and get rich\nFuck with me my nigga\nWe gon' circle round the Ville and hit a lick\nCop some tree my nigga\nAnd some powder, bag it up and make it flip\nYou gon' see my nigga\nOne day we gon' graduate and cop a brick\nAnd that's the key my nigga\nListen up I'm 'bout to go and get rich\nStand back and watch if you want to nigga\nMe I want my pockets fat, a badder bitch\nTired of seein' niggas flaunt, I wanna flaunt too nigga\nWatch some rollers in a fuckin' Crown Vic\nTryna lock a nigga up, that's what they won't do nigga\nWanna know a funny thing about this shit?\nEven if you let em' kill your dream\nIt'll haunt you nigga, haunt you\n\n[Hook 2]\nLast night I had a bad dream\nThat I was trapped in this city\nThen I asked is that really such a bad thing?\nI look around like—\nDo you wanna be another nigga, that ain't never had things?\nGuess not! (What's the value of a thing?)\nLast night we pulled up on a nigga at the light like\n(You know what the fuck it is nigga, run that shit!)\nUh, nice watch, run it\nHands in the air now, hands in the air, run it\nHands in the air now, hands in the air, run it\nHands in the air now, hands in the air\nHands in the air now, hands in the air\n\n[Outro]\nFather forgive me for my childish ways\nI look outside and all the clouds are gray\nI need your hands to take me miles away\nYour wish is my command, my command, my command\nBut before you go I've got to warn you now\nWhatever goes up surely must come down\nAnd you'll get your piece, but know peace won't be found\nSo why just take me man, take me man, take me man\nYour wish is my command, my command, my command"}], "artist": "J. Cole"}