{"artist": "Porta", "songs": [{"album": "No hay truco", "title": "Las niñas unas guarras pero los tíos unos cerdos", "image": "https://images.genius.com/8d2637d189e14c6096a3e8262f996719.605x605x1.jpg", "lyrics": "Niñas vs Niños\nNiños vs Niñas\n\n[Intro: Porta]\nYeah\nGuarras, no me miréis así\nLas niñas, ay, ay, ay\nZorras, sólo comen polla\n\n[Verso 1: Porta]\nLas niñas ya no comen chuches, ahora comen pollas\nVan a la moda con samblancat, doce años y ya follan\nNo es normal, pero es lo que ahora se lleva\nComo papá no les deja llevar piercing se lo ponen de pega\nY que mas da si su mente es más corta que sus minifaldas\nLlevan tanga y las guarras se van de compras con mamá\nSe van al Up&Down (¡zorras!) a ver si se triunfan alguno\nPoder fardar con las amigas (''¡cuatro me han tocado el culo!'')\nSon infie-les ya por naturaleza\nClaro, y luego encima se quejan (si su novio les deja)\nLes va la lefa, algunas dicen que soy machista\nSeñoritas, salid un finde, veréis que soy realista\nNo os piquéis pero os copiais y parecéis todas iguales\nRubias morenas, pelirrojas, comen pollas a raudales\nUn grupo de amigas juntas pfff... es insoportable\nSon mas plastas que las ex que siempre serán follables\nViernes todas pa' la disco pa' bailar el reggaetón-ton\nQue os viene el subidón, zorra restriega tu pandero\n20 horas arreglándose echándose todo el pote\nPonte escote que se noten bien tus excitantes dotes\nYa no se juega con Barbies (¡qué va!), ahora hay que ser rebeldes\nPapas ustedes sabrán que su hija... (de todo menos los deberes)\nSe saben abrir de piernas y de mente son cerradas\nEspecial dedicación, pa' todas, sois unas guarras\n\n[Outro: May]\n¡Pero que dices gilipollas! Tío tenías que ser\n\n[Verso 2: Porta]\nSexo, alcohol, drogas y farra, solo queréis fiesta\nAnoche con resaca follaste y ni te diste cuenta (¿recuerdas?)\nVan de juerga, de pesca, pa' ver si algo en su red cazan\nMientras a otras lo único que les preocupa es si adelgazan\nEstá de moda lo Playboy y, rajarse los brazos\n¿Para llamar la atención? La anorexia es pa' que te hagan caso\nLas niñas que se arreglan suelen ser las mas feas\nImplántate silicona, ponte tacones aunque duelan\n\n[Estribillo]\n(May) Cuantos mas tíos conozco, más quiero a mi perro\n(May) Los tíos de hoy en día son todos unos cerdos\n(Porta) Pero si vosotras a la mínima os bajais las bragas\n(Porta) Las niñas de hoy en día son todas unas guarras (x2)\n\n[Verso 3: May]\nLos tíos son unos cerdos\nLo que a las tías nos falta de falda a ellos les falta de cerebro\nCuando empiezan con su chica nunca muestran su lado chulo\n(pa' chulo, chulo mi pirulo), que te den por culo\nTe venden una imagen y después son lo contrario\nSe cree el mas triunfador y luego es el tonto del barrio\nQué plastas, qué pesados, hacen fuerza marcan brazos\nTe dicen (toca, toca) y añaden (voy al gimnasio)\nSe hacen fotos sin camisa pa' después poder pasar\nY si hay que hablar de los tamaños del tuyo mejor no hablar\nFardas de lo que careces, ¿una discapacidad?\nPon mas escusas, que tenerla así (¿no es tu culpa verdad?)\nQue la tienes corta, ¿eso es un trauma para ti?\nEstás acomplejado el tamaño importa, ¿por qué mentir?\nPa' marcar los musculitos camisetas de tirantes\nEstoy harta de niñatos que se creen interesantes\nCorre chaval date prisa, maquea tu motito\nVete a la tienda de Footlocker a comprarte un modelito\nMuelles o TN que es lo que hoy día se lleva\nCon el detalle del cordón te quedas con la peña\nY en la disco es pa' flipar lo que se hace para fardar\nLlevan puestas las gafas de sol ¿pero el sol donde esta?\nCuenta a tus colegas, a cuantas tías te has tirado\nDivídelo por tres y tendremos el resultado\n¿Dos cosas a la vez? Para ellos imposible\nSu inteligencia para mí hasta hoy es invisible\nEgocéntricos y piensan que siempre llevan razón\nPobrecillos les da gusto sólo el follar sin condón\n¿Un grupo de tías juntas es insoportable?\nPues un grupo de tíos juntos, es tan deplorable\nA que no tienes huevos de... (¿que no? ¿qué?), son subnormales\nVes y pides personalidad para estas Navidades\nEntre todos tus amigos tú tienes que destacar\nY no por ser tu mismo, si no por aparentar\nBusca alguien que esté, solo y dale el palo\nSiempre y cuando vayas con tus colegas al lado, ¡está claro!\nVan de duros y cuando les dejan todos lloran\nPero no es lo mismo. si no están contigo a solas\nHay que joderse con los tíos, de hoy en dia\nTe dicen (yo te quiero)\nY piensan (me la follaría)\nEl sexo para ellos es una necesidad\nLos tíos si servís para algo, es sólo pa' follar\nSí claro, vosotros la fuerza (¿uh?)\nNosotras la inteligencia y el placer de daros puerta\n\n[Estribillo]\n(May) A cuantos mas tíos conozco, más quiero a mi perro\n(May) Los tíos de hoy en día son todos unos cerdos\n(Porta) Pero si vosotras a la mínima os bajáis las bragas\n(Porta) Las niñas de hoy en día son todas unas guarras (x2)\n\n[Verso 4: Porta]\nSuperficial, es total,. osea da igual\nDi que tu eres diferente, que eres especial\nBah No me seas egoísta!\nAlguna vez as pensado en alguien que no seas tu misma\nEngáñate, hazte la distinta, tus pintas de megaguarra!!\nPasas fotos desnuda haciendo posturas desproporcionadas\nCerda..en la webcam solo te enfocas a las tetas\nBuscáis fama, dinero, pollas, y un futuro sin metas\nTodo el barrio te conoce, pero no solo de vista\nJuegas con los tíos solo pa tenerlos en tu lista\nLos tíos son triunfadores, pero las tías zor***\nBuscáis hacerlo sin condón y k además dentro se os corran\nQuien se de x aludida..ejem solo buscáis sexo\nTu novio que sea mas grande tenga coche y no tenga la eso\nEs un malote, si no tienes lo k quieres te mosqueas\nTienes novio y por el messenger con cualquiera tonteas\nEl jugador también forma parte del juego tenlo presente\nConmigo alguna lo intento pero paso a ser mi juguete\nColorete pal moflete pa estar mas wapa o mas mona\nPintalabios pa marcar la polla que esta noche comas\nUna tía solo se fija en si uno es guapo o esta bueno\nQue os fijáis en los ojos? El culo es lo primero\nLuego en la sonrisa ? y en realidad es el paquete\nSi papa no te deja salir de fiesta escápate\nHazte un tatoo guapo, que no se note si hace cuernos\nConoces a una tía al primer día ya te dice te kiero¿\nPoned fotos rara en vuestro querido fotolog\nPon paranoias que ni tu misma entiendes en tu blog\nDale don dale, no, dale donde duele\nNo te creas sus mentiras, no dejes que te las cuelen\nTe pasan una foto increíble y dicen, en esta salgo mal?\nY es que ser una niña guarra hoy en día es lo normal\n\n[Estribillo]\n(May) Cuantos mas tíos conozco, más quiero a mi perro\n(May) Los tíos de hoy en día son todos unos cerdos\n(Porta) Pero si vosotras a la mínima os bajais las bragas\n(Porta) Las niñas de hoy en día son todas unas guarras (x2)", "year": "2007-01-29"}]}