{"artist": "Cardi B", "songs": [{"title": "Everything", "album": "Gangsta Bitch Music, Vol. 1 (Promo CD)", "year": "2016-03-07", "image": "https://images.genius.com/3f5818884df17f1a9b0863d9cff964dc.1000x1000x1.jpg", "lyrics": "[Intro]\nYou know, people underestimated me\nAnd making me feel like I'm never gonna amount to shit because I used to be a stripper\nIt feels like I'm getting whipped in the back, with words\nBut you know what?\nThey don't see the bigger picture\nI had to feed myself, I had to feed my family\nBut you know what?\nJust here me out\n\n[Verse 1]\nLord forgive me for my sins\nForgive me for the crazy shit I wish I never did\nI'm simply just a young hood girl tryna win\nI just want it all, and I gon' pretend\nLike I ain't never had to suck a dick to pay my rent\nI'm tryna get my family out the hood and new cribs\nI wanna finish paying my mothers new whip\nI do it for a cause, so understand the kid\nI want my little girl to go to school in Fort Lee\nSchools in the hood, got him crazy, man he three\nAnd it's fucked that it ain't how it's supposed to be\nHe should be counting 123's and ABC's\nAnd momma used to beat my ass like every week\nThat's because she can't have nothing but love for me\nI wanna spoil her so much, oh lord please\nThat's my everything\nMy everything, my family\n\n[Hook]\nYou know what?\nEven when I was stripping, like bitches was worried 'bout the wrong things\nOh they want red bottoms, they want the biggest cars\nLike I'm worried 'bout my father stop cab driving\nBefore he turn sixty, and my mom stop being a cashier before she fifty like\nThat's why I'm working so hard out here\nThat's why I go so hard\nNot for me, but for them though\nYou feel me?\n\n[Verse 2]\nNote to self, for my sister Hennessy\nTry and go to school, finish up and get degrees\nDon't be fucking trick niggas, just so you can eat\nThat's the shit I did and it really makes me weak\nI would close my eyes, dying for it to be over\nThe thought of a stranger inside, I just can't be sober\nDirty ass breath, breathing all over my shoulders\nAin't no bitch gon' tell you that, just respect the soldier\nAnd I wanna tell my dad, you don't gotta cab\nDrive for two whole weeks just to make a stack\nYou don't gotta drive no more, I'm gon' change all that\nI put that on my everything, I'm gon' pray for that\n\n[Outro]\nYou know when I was a little girl I used to tell my mom\n\"Hey mom, when I grow up, I'm gonna buy you a house, I'm gonna buy you a car\"\nUntil I turned eighteen, it's like damn, I can't even get me my own apartment\nSo, it's just like, now that I'm in this position I'm gonna\nI'm gonna take full advantage of it\nLike oh my gosh, I can't wait till I get to surprise my mom\nLike, \"Hey, I didn't went to college, but look, look at me mom, look at me now, look, look mom, look, look at your house, This is your house! Not mines, but yours, and I bough it for you!\""}]}