{"songs": [{"year": "2001-10-16", "image": "https://images.genius.com/8af6cd69d2d9ed7258d80228afce41de.220x220x1.jpg", "title": "Maggot Face", "album": "1 Less G n da Hood", "lyrics": "Here come the maggot, feedin' on my flesh! x8\n\nDarkness, (black!) buried underground\n3 slugs in my chest, never been found\nI'm decomposin', my lungs collapse\nMy flesh is food for the maggots on my back!\nGot my gat! They all said my bodies paralized\nI can feel them crawling on my eyes!\nAnd lookin' for the open wounds, the smell of death\nNow they on the march, on my face to eat my flesh\nStartin' on my chest where the first bullet enter\nA hundred maggots in and start diggin' in the center!\nTearin' up my insides, til' they reached my rib\nThen one of them hollered, \"Back to the grill!\"\nThey all followed one by one on my chest\nAnd headed on back to my face to rest\nThe trip to my head was like a race\nThey all made it though, and that's why I got a maggot face!\n\nChorus\nYea I got a maggot face and I don't care\nYea I got a maggot face and I, don't, care! x4\n\nI got maggots on my face, 3 quarters of my body\nThey runnin' through my veins like a, IVY!\nFeedin' off the blood and flesh to take control\nOf a lifeless corpse, dead man without a soul\nTryin' to maintain while they crawl through my bloodstream\nI can feel'em movin' from my neck to my brain\nTo my eyelids, to the back of my spine\nFrom my feet on up to my mother fuckin' mind!\nThey want to take control of my body and reak havoc\nOn them suckas out there tryin to rob my fuckin' casket\nOr my goods like a 40 of formaldehyde\nA 9 millimeter, good for pullin' drive-bys!\nMy 2 rags and a sawed of shotgun!\nAny sucka get wit'in 2 feet, I pop'em!\nAnd I peel your wig, before you bit the case\nI wanna tell you bitches straight from the maggot face\n\nChorus\n\nHere come the maggot, feedin' on my flesh! x8\n\nNow your homie Blaze, got a maggot face\nGot me creepin' out the casket, just to erase\nSuckers on my block cause the maggots gotta eat\nScoped 3 fools with my semi-auto heat\nDragged their fuckin' bodies back into my casket\nChoppin' limbs up, wit' a hatchet!\nFresh for the livin, ain't no better taste\nWoke from the dead, made a mother fuckin' maggot face!\n\nChorus"}], "artist": "Blaze Ya Dead Homie"}