{"artist": "Watsky", "songs": [{"year": "2009-10-14", "lyrics": "[Verse 1: Watsky]\nYour first rap show posted in the back row\nOf a sea of white kids bent on supermanning that ho\nPretty soon you're buying fitted hats and high tops\nPretending that you're black enough and rapping with the lights off\nIt's like a cyclops with one closed eye\nYou can tell me that you're winking, but the grin won't lie\nAnd no mouth supplies, what your skin tone hides\nAbout a thousand miles south as the jim crow flies\nAnd then we're playing he said she said\nI see red when I peep a pink cheeked boston meathead\nI wanna go Bruce Lee\nWhen I see him on the T taking up two seats\nAnd say, \"excuse me, but would you move if hell froze?\"\nYou know the subway is the underground railroad\nLynch trees have the same white limbs\nCheck out my arms, I look just like him\n\n[Verse 2: Catch Wreck]\nLet's you and I get one thing straight\nThe game never been equal, ain't no food on my plate\nI gave birth to this and you just took it and co-opted it and profited\nAnd packaged it and wouldn't give me half of it\nPeep how I master this and break down how you took it all\nRaped the culture and you standing there looking all\nInnocent, take a mile when I give and inch\nAnd how you getting rich, is it a coincidence?\nOr is it ignorance? You don't know your own privilege\nYou own riches and don't know what homeless is\nYou got a lot to learn before you even think about\nHip hop, black culture and which fitted you pickin out\nPlay Nigga in the store, I don’t think so bro\nMy people ain't supportin your black history show\nSo stop what you doing we won't take it anymore\nBefore you come in my house wipe ya feet at the door\n\n[Hook]\n\n[Verse 3: Watsky & Catch Wreck]\n\n[Watsky]\nI see the color lines\nIt's tough that every other time a brother rhymes\nWhite mothers think of gutter crimes\nWe keep our standard higher\nWe don't kick lower rhymes\nOther times it undermines the fact the mine are over minds\n\n[Catch Wreck]\nAll you gotta do is get past the guilt\nWe ain't living in a house that master built\nIf you overstand that, tell your people what you know\nBecause one of em got enough money to pay back what you owe\n\n[Watsky]\nYes, My great grands had land, had slaves\nI guess I pressed this record off the bank he made\nBut I want independance, past the declaration\nBut one down ass white boy can't pay for reparations\n\n[Catch Wreck]\nI'm running out of patience while you do the work of Satan\nLike an impulse. Edu Leedz Black history's an insult\n\n[Watsky]\nNumber one, I'm not trying to tell your story\nI just want to sit on my porch, drink a forty and spit\nNumber two, cause uou can smell bullshit\nI just love hip hop\nPinkie swear that's it\n\n[Catch Wreck]\nIf you love hip hop respect it\nThat includes the people who created it and paved the way for this\nSo that you're making it\n\n[Watsky]\nWell if you're talking on who's making it, I'll play devil's advocate\nA lot of black music has white dollars backing it\nKweli's got it on lock\nRupert Murdoch funded Rawkus\nYou looking for the keys, then you better check the pockets\n\n[Catch Wreck]\nI'll be checking pockets all right\nAs soon as it gets dark and all night\nI'mma get my money we can all fight\n\n[Watsky]\nYou taking out the high and the mighty\nAnd their kids\nYou say kill whitey\nI say can I live?\nYou're not black militant\nKilling us diligent\nGrab my fam, and grandma and light us up like a filament\nI thought we were cool now I'm this close to giving in\nJust put a bullet in for each missed dose of Ritalin", "image": "https://images.genius.com/3433966a73a598eca7e6120b7f0cbab3.1000x1000x1.jpg", "album": "Guilty Pleasures", "title": "Color Lines"}]}