{"artist": "Casey Veggies", "songs": [{"title": "I’m Blessed", "album": "Live & Grow", "year": "2015-09-25", "image": "https://images.genius.com/e4635c8f2676255ecd4610e6ea16dd52.1000x1000x1.jpg", "lyrics": "[Produced by T.H.C.]\n\n[Intro]\n\n[Verse 1]\nPull up in that CL, I'm blessed\nLove all around me, I don't stress\nI'm Clark Kent, got Superman on my chest\nThey ain't show us no way so we finessed then we flexed\nI'm blessed my nigga, that's one thing that I know\nIf you spread your wings then God gon' help you float\nAngels watching me everywhere that I go\nYou can spark that weed but we don't do no blow\nWe don't do no blow\nI told my brody on me, I'm bout to blow\nAll this time I put in, it's bout to show\nIf you talk to God and try to get to know him\nEven in the nighttime, it glow\nMy grandad, he came out to my show\nHe told that he proud of me, to keep going so I keep going\nI put that on everything, I'm blessed\nGod with me, I never feel alone\n\n[Hook]\nI'm blessed my nigga, that's one thing that I know\nYou spend that money, then I'ma put on a show\nPut more than got bands and we might go on tour\nWe need that money nigga, we don't do it for the low\nWe ain't for the low\nI'm blessed my nigga, that's one thing that I know\nI'm blessed my nigga, that's one thing that I know\nI'm blessed my nigga, that's one thing that I know\nI'm blessed my nigga, that's one thing that I know\n\n[Verse 2]\nEverything I been through, I'm blessed\nYour body is a success girl, you blessed\nI'ma give you my all, ain't nothing less, ain't nothing less\nI give you my heart, all of my flesh, all of my flesh\nGirl you know that you got my heart know that you got it\nI know we gon' get back to it every time we go through it\nGod got me, I tatted all on my chest, all on my chest\nWhen I got hit by that car I thought life was mess, I thought life was a mess\nBut I was able to ball so I know that I'm blessed, know that I'm blessed\nThe way I switch up my life, I know that I'm blessed\nGot nothing but love for ya if I know ya\nStay humble or God gon' do it for ya\nI just thank the Lord I made a way\nHow'd I get this far, it gotta be faith\nRide around, I got Jesus all on my chain, all on my chain\nMy pops tell me that it's just part of the game, part of the game\n\n[Hook]\nI'm blessed my nigga, that's one thing that I know\nYou spend that money, then I'ma put on a show\nPut more than got bands and we might go on tour\nWe need that money nigga, we don't do it for the low\nWe ain't for the low\nI'm blessed my nigga, that's one thing that I know\nI'm blessed my nigga, that's one thing that I know\nI'm blessed my nigga, that's one thing that I know\nI'm blessed my nigga, that's one thing that I know\n\n[Verse 3]\nThink about my grandma, she blessed\nYou never left my heart since we laid you to rest\nI remember walking into the hospital to come see you\nEyes closed, you had already left us that evening\nWe buried you mama but your soul is still the same\nI know that you're blessed cause your life has so much meaning\nYou'll always be with me in my mind\nAs I live, I grow into the man that you designed\nDon't worry bout your daughter, just know she fine\nShe got Superman right here and I'll be there right in time\nI'll forever care for you\nI promise I'll never forget about you\nI know that you hear me screaming girl\nI just wanna chill around\nDon't ever take for granted all the loved ones in your life\nIf you get a chance, just make sure you do it right\nAnd I'ma do it right\nOh I know that I'm blessed\nGrandma, I know that you blessed\nMomma, I know that you blessed\n\n[Casey's Mother]\nMy son, I knew that since you were a little bitty boy that there was a blessing upon your life. When that car hit you, your dad and I almost lost our minds. But faith and prayer got us through. And your attitude. It was your attitude, the way you handled it, let me know that you were going to be special. Your granny and nanny always prayed over you and your brother. We are blessed\n\n[Casey Veggies]\nI just want to leave y'all with something, you know what I mean. I just wanna let y'all know that we're blessed. If you got a dream, follow your dream. Don't let nobody tell you you can't get it. Keep grinding. Keep shining. Keep being blessed. Let's get it"}]}