{"songs": [{"year": null, "image": "https://images.genius.com/6478121f52fa3b0248edb20e7d06e076.300x300x1.jpg", "title": "Dead-A-Man", "album": "Damn Fool", "lyrics": "[Intro: Krizz Kaliko]\n[?]\nBut I should have been dead!\n\n[Verse 1: Big Scoob]\nI'm a beast from the streets, I'm sweaty and breathing hard\nI'm peeping in through the window, he's slipping, puffing cigars\nSipping on some brandy, it's dandy just for a moment\nHe flaunted now I want it, I plotted and got up on it\nBreathing like a demon, proceeding to start my evening\nI'm thinking 'bout my heathens, I'm feeding, so I ain't leaving\nDestruction as a bust in! Yelling loud and cussing!\nLooking like the devil gripping metal, I ain't bluffing!\nTake me to the money, [?] just like I told ya\nPlaying with me only gon' make me cock an explosion\nSoldier, told you first time that you met a nigga\nPlay the game fair or regret you ever met me nigga!\n\n[Hook: Big Scoob & Krizz Kaliko] x2\nOn a mission out hunting, I'm vicious and look suspicious\nBest believe me when I tell you \"I will!\"\nLet me do it, I can do it, been through it but nigga, really?!\nI should have been dead!\n\n[Verse 2: Big Scoob]\nMoving slow, sitting low, we've been hunting all night\nOn a mission with precision, 'bout to take this nigga's life\nOnly bright nigga played me for a large sum of cash\nHope it's worth it, when this choppa get to sing it to his ass!\nWhistling bullets singing past, cutting holes through his ass\nI forget a lot shit, but I remember all my math\nLet it pass, been a year now, I bet he think I'm soft\nHe was playing checkers, it was chess that I was tought\nI'm strategic so believe it, every nigga that has wronged me\nEither finished breathing or one evening he won't be!\nI wished that it is was different, I didn't have to kill for bread\nBut this the life I chose, when he shows this nigga's dead\n\n[Hook: Big Scoob & Krizz Kaliko] x2\nOn a mission out hunting, I'm vicious and look suspicious\nBest believe me when I tell you \"I will!\"\nLet me do it, I can do it, been through it but nigga, really?!\nI should have been dead!\n\n[Verse 3: Big Scoob]\nGod's karma man, these niggas let me have it, I was slipping\nI was going off the liquor, hella rowdy, I was tripping\nChasing pussy like a rookie and I know I'm out of bounds\nPapered-up and flamed-up, nigga showing I'm a hound\nAll I heard was spittin rounds, from the chop I know the sound\nHeard the zing and saw the blades trying to lay me down\nTook for cover, so I struggle, trying to keep from passing out\nDoing a hundred up the block, I'm in and out, I'm blacking out\nCalled the homies: \"send the missles, just in case I didn't make it\"\nWant revenge and I can taste it! I was praying that I made it\nI didn't ask for forgiveness, I still had to handle business\nSo as God is my witness, I can't tell you why I'm living\n\n[Hook: Big Scoob & Krizz Kaliko] x2\nOn a mission out hunting, I'm vicious and look suspicious\nBest believe me when I tell you \"I will!\"\nLet me do it, I can do it, been through it but nigga, really?!\nI should have been dead!"}], "artist": "Big Scoob"}