{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/a8906126ae46a874605d38c7d1e89e9e.1000x1000x1.jpg", "year": "2014-03-02", "album": null, "lyrics": "[Intro]\n\n[Verse One - Yelawolf]\nHello Rittz\nKnow you over there burning kush\nRed hairdo popping out of that black stocking cap like a burning bush\nWell let me let mine go\nLet my hair down and let a line go\nNever mind though like an old wino\nSipping on lime and coke I'm dope I'm Dope\nYeah bitch don't judge my rope\nWon't find another like this in the store\nNo dope come and get you one of these\nMoney in the bank won't make an emcee\nThat's true but it's making him believe\nShitting me buddy Yela shaking up the tree\nHanding over weeds? like a weeping willow jack\nCause a ratchet ? now fella go to sleep?\nI got em peeping over seas\nGot a check coming I ain't tripping over cheese\nUnless it's a stack the size of a tree trunk\nAnd I'm in an atv\nRING RING\nI'm throwing mud I'm showing up\nI'm blowing drugs I'm so clean I'm blowing suds\nYou know whats up?\nHey when I get down I get the FUCK down\nDouble barrel from the side of the truck\nClick click bang the fuckers down\n10 pointer\nSee that's three 3 points and one\nBitch get off me\nBig pen on the page like a plastic handgun\nWhite trashes bitches and some\nBlack eyelashes in hand? and boobies too\nRitz crackers in the box\nWanna eat want a treat\nWell get on it dude\n\n[Verse Two - Rittz]\nYeah bitch its Rittz and Catfish Billy\nChucking me the light while I crack this philly\nYou ain't never heard anybody rap this illy\nI'm the limelight kid\nHigher than a mother fucking skyline is\nDick gag a bitch till her eyeliner start dripping down her cheek like a teardrop\nClear chopped out on a mirror the beer disappeared so we drinking on the Smirnoff\nWe're not the alcoholics but you can find me on the late night sipping on a whiskey beverage\nIn the bed with my red head between some legs\nI bet I eat her pussy better than Melissa Etheridge\nEat meth for breakfast snort coke for lunch\nI think I need to go and see Dr. Drew\nLoad the gun under the seat of the aqua blue Monte Carlo the cops in hot pursuit\nFuck an obstacle I got pot to move and you can tell when you smell the good dro\nYeah that's me in the club I got a bitch by my side and we getting gone at the Yelawolf show\nWith the Dixie Mafia the homie transcend bout to put the damn pen to the J-Plymp track\nOther rappers that tried either died or they got denied because they came and they ain't been back\n\n[Verse Three - Yelawolf]\nDouble barrel back in my truck window is impeccable\nElastic on beats my wordplay is stretchable\nPopeye on the street with my green Chevy bass up treble low\nI grew up with hot sauce on tables for my vegetables\nSkateboard on my feet and a backpack full of that work load\nI drop off the weight and pinch a gram before I let go\nNever fuck with techno\nNever popped the purple haze\nStoners caught the elbow\nRavers bought the special k\nFlashing lights of red and blue\nPaparazzi hide\nAnd you don't have no hand? cause you're a friend of mine\nRittz is synchronous so Yelawolf has to got fly\nJ-Plymp is whipping tow trucks I had to catch a ride", "title": "Double Barrel"}]}