{"songs": [{"year": "2016-04-24", "image": "https://images.rapgenius.com/887eb9192ddbe2da48e0046d53e5eeb6.1000x1000x1.jpg", "title": "Neighborhood", "album": "Ms. Gladys", "lyrics": "[Verse 1: Ralo]\nAt night I think about it, them niggas can't without me\nThem bitches tried to doubt me, a nigga came up out it\nOne thing about it, niggas ain't 'bout it, you was just talking\nHow could they doubt me? How could they doubt me? they was surround me\nHow could they give it and take it from us?\nAll of my niggas done made it with us\nFuck all them haters, they can't get in touch\nI was impatient, I was in a rush\nI just been ballin' and making that money\nI came from nothing, I made it, I promise\nFuck all that comments, the hatin' abundance\nTell them I want this 'cause nobody done this\nI just been stacking it up\nThey did not show me no love, I got this shit out the mud\nI stood in front of that judge, I didn't have much, I barely made it to court\nI love my mama's support, she didn't abort, I owe that lady the world\nTell her I did it for her, I did it for her, she still my favorite lil girl\n\n[Chorus: Birdman]\nYeah, we move them bricks in my neighborhood\nDouble strapped with them MAC's in my neighborhood\nWe get the money, flip them hundreds in my neighborhood\nI'm staying toe ten down in my neighborhood\nBust guns and don't trip nigga\nPlay around and get flipped nigga\nHustle, this for them Crips nigga\nWe do this shit just for them flips nigga\nWe all gravy in my neighborhood\nWe get the money, keep it running in my neighborhood\n\n[Verse 2: Ralo]\nI'm in the bricks, I'm in the bricks, don't come in the bricks\nI'm with your bitch, you want your bitch, she want the dick\nRalo pull up in that Wraith in the Bluff\nNone of these niggas can take it from us\nFuck what it was, lil ho we does\nWe just be fucking these hoes just because\nFuck their opinion, I know that I did it\nAll of my niggas gon' handle their business\nI get it, I spend it, you know that I'm winning\nNone of my niggas been broke in a minute\nAll of these bitches embrace me, I think it's because of my bracelet\nYou see the look on they faces, you know them niggas was hating\nTell 'em that I'm gonna win, I'm gonna do it again, look where my niggas have been, yeah\nI just got out of the pen, now I get rich off a pen, yeah\nThey just remember me selling dope\nI used to live at that yellow store\nThat lil nigga doing better though\nI ain't ever going back to broke\n\n[Chorus: Birdman]\nYeah, we move them bricks in my neighborhood\nDouble strapped with them MAC's in my neighborhood\nWe get the money, flip them hundreds in my neighborhood\nI'm staying toe ten down in my neighborhood\nBust guns and don't trip nigga\nPlay around and get flipped nigga\nHustle, this for them Crips nigga\nWe do this shit just for them flips nigga\nWe all gravy in my neighborhood\nWe get the money, keep it running in my neighborhood\n\n[Verse 3: Derez De'Shon]\nTime is money, got the Rollie and the scale on me\nOn the highway with no license and them bales on me\nI got a stick on me right now, that loud talking, better pipe down\n'Fore I catch a body right now, yeah, yeah, I'm talking right now\nI'm from southside, Clayton County\n'Fore you try it better think about it\nRex Road, niggas bang about it\nEverybody having paper round me\nMost of these niggas be lying\nMost of these niggas be lying, never committed a crime\nPull out that fire and they crying, what's on the back of your mind?\nI'm on that mob shit like Lil Hitty\nI'm stealing, we rob shit, and we killin'\nNo swiping no card shit, in the trenches\nGot dope in the closet and the skillets\nCrips and Bloods show me love in my neighborhood\nBefore you cross me better be cautious in my neighborhood, yeah\n\n[Chorus: Birdman]\nYeah, we move them bricks in my neighborhood\nDouble strapped with them MAC's in my neighborhood\nWe get the money, flip them hundreds in my neighborhood\nI'm staying toe ten down in my neighborhood\nBust guns and don't trip nigga\nPlay around and get flipped nigga\nHustle, this for them Crips nigga\nWe do this shit just for them flips nigga\nWe all gravy in my neighborhood\nWe get the money, keep it running in my neighborhood\n\n[Outro: Birdman]\nYeah, you understand?\nBright lights and I ain't talkin' 'bout the ikes, you dig?\nSpark for my dead homies\nAnd I ride for my niggas, nigga\nHustle, we hustle, hustle nigga\nWe get the money, go to trippin' nigga\nPut that gauge to your head nigga\nOpen safes or you're dead nigga\nBrrat, Rich Gang or don't, Rich Gang or don't, yeah\nIt's Rich Gang or don't\nLil Ralo, I'm fuckin' with you nigga\nDerez, I'm ridin' with you nigga\nLondon, we out here boy\nThree-oh-five-oh-four\nHeater, we bust a nigga, we bust a nigga\nWe bust a nigga, then blaow\nOne hundred, let's get it"}], "artist": "Birdman"}