{"songs": [{"year": "2009-02-22", "album": null, "image": "https://images.genius.com/24c5c29fe788fe669929c7cd90a09600.412x412x1.jpg", "title": "Amazing", "lyrics": "[Verse 1]\nI don't eat bacon, order steak and eggs\nI'm picky, picking over chicken like a set of legs\nI eat sushi and that honey butter sweat bread\nYou just started eating coochi\nDon't let me say it\nI am not kidding\nThat's why I stopped kissing\nI am not dissing\nBright women pussy stank\nAll you niggas fuck the same hoes\nCome on what you think?\nGetting home, tryna wipe it off before my girl smell it\nWhy you think I'm tryna wipe it off?\nBecause your girl smelly\nAnd my girl smell it\nStupid mother fucker\nKnow it's confusing, I be losing mother fuckers\nProbably to inclined for your mind\nStupid mother fuckers\nThey say it's my turn to eat, I say It's been the time\nI hold my city down winter time to winner time\nProducers give me food to chew, hmm\nDinner time\nAnd it ain't nothing else to do\nNow it's killin time\n\n[Bridge]\nMy grandmother use to tell me a long time ago, she used to pull me to the side\nShe'd say \"Baby, sometimes talking to you be like talking to a brick wall. But you never cease to amaze me. You're amazing.\"\n\n[Verse 2]\nJumping out the top of that thing, my dreads shaking\nNo look like Shabba Ranks, manna' talk like a Jamaican\nYou know can do what I can do, why you 'ating?\nTry and get the money up too, real impatient\nThirty in the party\nHardly mean a ting\nManna' badman\nYou want to see my dingaling?\nDingalingaling\nWiggling me dingaling\nYou do the same if you ain't got a brain\nWiggle your dingaling\nJump in the Luc with Newman\nHe got a thing for green\nPick up the phone, call Bone\nYo I need the lean\nMy little nigga Level\nNiggas ain't on your level\nGet your change, don't change\nKeep the city under pressure\nBrice doing 6\nBoobie coming home\nWayne had stacks\nSmash the lack in a mc\nPlay the side line see the ties when they ride by\nI don't hate, love to see you shine\nGet your ride fly\n\n[Bridge]\nA lot of people don't know this\nI jumped off the porch when I was like 14, 15\nHead first in the game\nUsed to have fun rapping and shit\nBut me? I more looked at boxing like my ticket out the hood\n\n[Verse 3]\nWalking home from practice had a talk with Big London\nTold him what it was and got the hook up on them onions\nWhole block bumping\nTraffic start coming\nThat other boy was passing through but wasn't sellin' nothin'\nMy favorite rapper Big Head, couldn't tell me nothin'\nBuckzey came home, had the rap game lovely\nTime Reezy came home I had a trap in the bottom\nThen I told Tome I'd never turn my back on the bottom, got em"}], "artist": "Kevin Gates"}