{"artist": "Waka Flocka Flame", "songs": [{"year": "2012-06-08", "lyrics": "[Intro]\nI got friends that need, family to feed\nFriends that need, family to feed [x7]\n\n[Waka Flocka]\n(Bricksqaud Monopoly)\nThe industry grew me up mentally\nPhysically, financially ya'll can't fuck with me\nI'm soon to be in the top three put it on the\nBeat my G. Partner got two, Brother got two\nMomma got five [?] momma got eight. It ain't\nBout cake plus a nigga I'm straight. Eat it out\nThe pot I don't need no plate, you can ask\nMy girl I don't need no date. Four singles up\nAye shawty you late. Sleep when I'm dead meet\nMe at my wake. Ninety-five problems like the\nBeast awake (west side). Everytime they hate\nI act alright. I love every beat southside make\nThey call me mister eight-oh-eight. Roll up blunts\nI don't do no shake. House on the hill I don't want no lake\nPump yo bricks why u worried bout us. Monopoly\nBoys in the squad I trust plus I got friends in need, family\nTo feed. Flag in my pocket as unity. Not the same person I\nUsed to be. I ain't going nowhere, get used to me Flocka!\n\n[Hook]\nPick yo chin up (Flocka) don't walk with your head down\nThose just words don't let them knock you down\nI got friends that need, family to feed\nFriends that need, family to feed [x3]\nAll for one one for all. One swing we all swing\nAll these niggas they got my back, a mill ticket that's chump\nChange I got friends that need, family to feed\nFriends that need, family to feed [x3]\n\n[Slim Dunkin]\nCause gettin' money don't make shit (Nope)\nNigga never gave me nothing, had to take shit\nWhole hood rep blue like the Patriots (Squad)\nGot the Glock like nigga do the matrix (Pow)\nNiggas start breaking laws, fuck jail. Went to court\nJudge was like no bail (Shit) I don seen a lot of things on the\nDope scale. I ain't trap rob a nigga wholesale. Fifty deep\nEverybody gotta eat (gotta eat) one bed everybody gotta sleep\n(Gotta sleep) spend hours in the line just to [?] folks. Put\nBarack in the office, nigga still broke. Daddy beat momma\nAss, yeah I had it rough. Fucked a nigga up so I got big enough\nDid shit nigga hoping to do, why you want my autograph nigga\nI'm broker than u. Momma cried, two jobs. two [?], work [?]\nForgive me my God, I'm fucked up, times hard. Dirty shoes\nRent due, D Moss we miss you. Behind the mic, they don't\nKnow what Slim D been through... Dunk!\n\n[Hook]\nPick yo chin up (Flocka) don't walk with your head down\nThose just words don't let them knock you down\nI got friends that need, family to feed\nFriends that need, family to feed [x3]\nAll for one one for all. One swing we all swing\nAll these niggas they got my back, a mill ticket that's chump\nChange I got friends that need, family to feed\nFriends that need, family to feed [x3]", "image": "https://images.genius.com/057e6f03f3f38c3d1d2dde953b224723.220x220x1.jpg", "album": "Triple F Life: Friends, Fans and Family", "title": "Chin Up"}]}