{"artist": "AZ", "songs": [{"title": "Livin’ the Life", "image": "https://images.genius.com/873af17f87b1e08c99360537e0e6b9f6.300x300x1.png", "album": "Legendary", "lyrics": "[Intro - Cozmo flips a sample]\nIt's wet ink, you dig?\nThink it's a joint\nY'all get a level and all that, right?\nYo who joint is that, who that singing that?\nThe Satellites?\nThat shit crazy, ahaha\nOnce again! Back in business\nAZ is a whole game motherf...\n\n[Verse 1]\nIn a high rise penthouse suite over the beach\nGot a bad bitch, butt ass, massaging my feet\nBumping DeBarge through the iPod, I'm nodding to sleep\nMy homey Miz caught a charge, his bid start in a week\nValet garage, got eleven cars parked in the street\nOne of the few so elite, it's an honor to meet\nObama physique, groomed well, garments is sleek\nHave a chick so in check you got to con her to speak\nDon of the week, centerfold magazine style\nFuck Kenneth Cole, everything is Japanese now\nLove dinner rolls, lemonade with iced tea mixed\nWho's on beginner mode? I see through the sheisty shit\nPolitely flipped, handsome, slightly mixed\nRandom broads come aboard, few might see dick\nFights we fixed, it's a handful whose life's legit\nSaid it before, mahphukkaz, yeah life's a bitch\n\n[Hook]\nThis is for the homeys that did it and got away with it\nStill around and talking, lounging, never lost it\nBuilt they own fortress, living the life\nFour wheeling or they peeling on bikes\nThis is for the homeys that did it and got away with it\nStill around and talking, lounging, never lost it\nBuilt they own fortress, living the life\nBe four wheeling or they peeling on bikes\n\n[Verse 2]\nKickstand the Kawasaki, cooling it off\nSwitch hands, the sour got me, I'm cool as the frost\nShower properly, smelling like a jewel in my north\nIt's only right like a midnight 2-2 Porsche\nDual exhaust, buck-60, fleeing, burning the clutch\nBallers is never talkers, they just learn and adjust\nThe jeans is crushed, double stitched, creased in the front\nSo go figure, ne-er nigga could teach me to stunt\nReach for the blunt, the reaper ain't release in a month\nNo sleeping, if you're scheming you'll get beat to the punch\nRetreat to the Trump, feet up, fruit in the bowl\nHow many ever minked up and drop the coupe in the cold?\nThe view is controlled, the watchers just work and contribute\nOnly certified fly guys flirt with the visual\nCircle the menu, main course pick of the day\nGet yours, what else for a nigga to say?\n\n[Hook]\nThis is for the homeys that did it and got away with it\nStill around and talking, lounging, never lost it\nBuilt they own fortress, living the life\nFour wheeling or they peeling on bikes\nThis is for the homeys that did it and got away with it\nStill around and talking, lounging, never lost it\nBuilt they own fortress, living the life\nBe four wheeling or they peeling on bikes", "year": null}]}