{"songs": [{"lyrics": "[Produced by DJ Premier]\n\n[Hook Samples: Snoop Dogg + Prodigy]\n\"Dear God – I wonder, can you save me?\"\n\"Illuminati want my mind, soul and my body\"\n\"Dear God – I wonder, can you save me?\"\n\"Secret society, tryna keep they eye on me\"\n\"Dear God – I wonder, can you save me?\"\n\"Illuminati want my mind, soul and my body\"\n\"Dear God – I wonder, can you save me?\"\n\"I can't die, I can't die, I can't die\"\n\n[Verse 1]\nThis shit is wicked on these mean streets\nNone of my friends speak, we're all tryna win\nBut then again, maybe it's for the best though\n'Cause when they're sayin' too much\nYou know they're tryna get you touched\nWhoever said illegal was the easy way out\nCouldn't understand the mechanics\nAnd the workings of the underworld, granted\nNine-to-five is how you survive, I ain't tryna survive\nI'm tryna live it to the limit and love it a lot\nLife ills poisoned my body, I used to say fuck mic skills\nI never prayed to God, I prayed to Gotti\nThat's right, it's wicked – that's life, I live it\nAin't askin' for forgiveness for my sins, ends\nI break bread with the late heads\nPickin' their brains for angles on all the evils that the game'll do\nIt gets dangerous, money and power is changin' us\nAnd now we're lethal, infected with D'evils\n\n[Hook Samples: Snoop Dogg + Prodigy]\n\"Dear God – I wonder, can you save me?\"\n\"Illuminati want my mind, soul and my body\"\n\"Dear God – I wonder, can you save me?\"\n\"Secret society, tryna keep they eye on me\"\n\"Dear God – I wonder, can you save me?\"\n\"Illuminati want my mind, soul and my body\"\n\"Dear God – I wonder, can you save me?\"\n\"I can't die, I can't die, I can't die\"\n\n[Verse 2]\nWe used to fight for building blocks\nNow we fight for blocks with buildings that make a killin'\nThe closest of friends when we first started\nBut grew apart as the money grew and soon grew black-hearted\nThinkin' back when we first learned to use rubbers\nHe never learned, so in turn I'm kidnappin' his baby's mother\nMy hand around her collar, feedin' her cheese\nShe said the taste of dollars was shitty, so I fed her fifties\nAbout his whereabouts I wasn't convinced\nI kept feedin' her money 'til her shit started to make sense\nWho could ever foresee?\nWe used to stay up all night at slumber parties\nNow I'm tryna rock his bitch to sleep\nAll the years we were real close\nNow I see his fears through her tears\nKnow she's wishin' we were still close\nDon't cry, it is to be; in time\nI'll take away your miseries and make it mine, D'evils\n\n[Hook Samples: Snoop Dogg + Prodigy]\n\"Dear God – I wonder, can you save me?\"\n\"Illuminati want my mind, soul and my body\"\n\"Dear God – I wonder, can you save me?\"\n\"Secret society, tryna keep they eye on me\"\n\"Dear God – I wonder, can you save me?\"\n\"Illuminati want my mind, soul and my body\"\n\"Dear God – I wonder, can you save me?\"\n\"I can't die, I can't die, I can't die\"\n\n[Verse 3]\nMy flesh no nigga could test, my soul is possessed\nBy D'evils in the form of diamonds and Lexuses\nThe Exorcist got me doin' sticks\nLike, \"Homie, you don't know me\nBut the whole world owe me, strip!\"\nWas thought to be a pleasant guy all my fuckin' life\nSo now I'm down for whatever, ain't nothin' nice\nThroughout my junior high years it was all friendly\nBut now this higher learning got the Remy in me\nLiquor's invaded my kidneys\nGot me ready to lick off – Momma, forgive me\nI can't be held accountable, D'evils beatin' me down, boo\nGot me runnin' with guys, makin' G's, tellin' lies that sound true\nCome test me, I never cower\nFor the love of money, son, I'm givin' lead showers\nStop screamin', you know the demon said it's best to die\nAnd even if Jehovah witness, bet he'll never testify, D'evils\n\n[Hook Samples: Snoop Dogg]\n\"Dear God – I wonder, can you save me?\"\n\"I can't die, I can't die, I can't die\"", "title": "D’Evils", "image": "https://images.genius.com/18040c4f503942a16d6577d9820644cb.1000x1000x1.jpg", "year": "1996-06-24", "album": "Reasonable Doubt"}], "artist": "JAY-Z"}