{"songs": [{"album": "Theories", "image": "https://images.genius.com/f009c5c209653caabc2d8008afc6a1ae.500x500x1.jpg", "year": null, "title": "Genius Wrote It", "lyrics": "[Produced By Gotham City]\n\n[Verse 1 -Tha City Paper]\nI pulled up, take the block\nThen I said I appreciate ya\nNowadays it’s just boss shit\nMotivator, mediator\nGot to watch out for them alphabet boys, abbreviators\nQuarter chickens, four and a baby\nUsed to keep that bitch in an incubator\nSmall town, perfect timing\nPulled up bumping that Big Lou\nHoop dreams, junior college, goddamn I wish I was 6’2”\nHold up, hold up, remember me?\nMotherfucking right, I remember nights\n[?] on the project floor\nI didn’t even give a fuck, didn’t dim the lights\nOld shit, but she heavy now, got a nigga telling them cock tales\nMeeting up with young T Hyde, I ain’t s’posed to be eating these ox tails\nEnterprise, need to rent a car, young bitch ain’t got a credit card\nSon still getting his hustle on, shooting threes to  [?] better yard\nI’m City Paper, I’m a rap god\nAll I can say is a genius wrote it\nHalf a plug, I ain’t even tripping, guess I’ll let Ms. Tina hold it\nBlood money, see the stars, where the hell is Ms. Mother Nature?\nTryna get like them Arabs, 50 stores, 100 acres\n\n[Hook]\nSaid a genius wrote it\nSaid a genius wrote it\nSaid a genius wrote it\nSaid a genius wrote it\n\n[Verse 2 – Starlito]\nI just caught a pound play out the Uber\nThey watching how I maneuver\nHad to tell all my shooters stay off the computer\nHad a bad looking bitch out at Hooters\nAnd a broke hood bitch even cuter\nGive me brain, she the tutor, I’m the student\nEnd up fucking all the hoes I went to school with\nShe stupid, now I’m a genius, acting like they forgot the facts\nI shot my strap, was balling for about two hours ‘fore he got snapped\nFree my homies, this for the projects and the college cats\nGave away scholarships from my lil partners, passing out the stacks\nCool ass nigga, still Cashville’s hottest act\nJust copped a spot in AZ and in Vegas, he must got a sec\nI holler grind hard, and I mean it\nWhy you sound like that? Cause I’m leaning\nOn it, sincerely yours, a genius wrote it\n\n[Hook]\nSaid a genius wrote it\nSaid a genius wrote it\nSaid a genius wrote it\nSaid a genius wrote it\n\n[Verse 3 – Petty]\nHey, let me get it then\nFuck rap, jump back, be the [?]\nGetting paid, switch blade, cut that like a middleman\nPull up all black in a minivan\nImma kill em when it’s cold out\nLeave a nigga with his soul out\nThen I roll out, fuck it, say a genius wrote it\nAin’t no [?], uh uh, they don’t know about nothing\nYoung Aristotle, I’mma a [?] starter\nCheck, I go hella harder\nYou can tell apart a motherfucker like me easy\nGot a Socrates like philosophy\nProphesize every prophecy that my prophets see\nWonder what’ll make em start with me\nI know that it’s hard to be, got a flow that can part the seas\nMy heart disease, bitch\nBetter check the signs, you don’t wanna be the next to die\nIt affects the time, so a nigga gon respect my mind\nPetty Cain, I’m a rap god\nRide a beat, say a genius wrote it\nReal niggas, real bitches love it\nWhen I kick the bucket, RIP Bironas\nThis that shit that gon last forever\nNo dream, I know it, say a genius wrote it\nKing decoded, never let a ho between the focus\nSaid a genius wrote it\nDo my dirt alone, I don’t want a nigga singing on me\nSay a genius wrote it\nAnd if you ain’t want it when I read up homie\nThen I seen [?], said a genius wrote it"}], "artist": "Tha City Paper"}