{"songs": [{"title": "I Know", "album": "Dark Sky Paradise (Deluxe)", "year": "2015-02-24", "image": "https://images.genius.com/139a6cb07b6e594bf4079a74a98fb350.500x500x1.jpg", "lyrics": "[Produced by DJ Mustard & Key Wane]\n\n[Intro]\nMustard on the beat, ho\n\n[Chorus: Big Sean]\nI know you've been goin' through some things, uh-huh\nI know you don't even love the same, do you, do you?\nI know you've been runnin' on empty, runnin' on empty\nThe way you move it's like you could use a vacation\nDrink in your hand and the harder you dance\nI swear right now it look like you on a vacation\nGotta get away, make it happen\nWhatever happened just had to happen\nOn vacation, yeah\nI know you've been, I know you've been\n\n[Verse 1: Big Sean]\nDancin', dancin', dancin' like you fucking got a reason\nDancing like it's something to believe in\nDancing like it's fuckin' dancing season\nBlame it on the alcohol or blame it on sativa\nThe harder your heart keep beating\nOnly feel bad while you're thinkin'\nPop, pop, pop like Pepsi Co. the best we smoke\nPlus the tan look like you flew in from Mexico\nGo go, let me see how wild it get, bust it wide as it get\nYou need to be taken care of and pampered\nBut just like a pamper, he on that childish shit\nYeah, I know you've been silencing your phone\n(Silencing your phone, ignoring calls from home)\nUh-huh, I know you've been tryna get along\nWhat's up, it's on, no games, we grown\nI know you feel like sometimes\nThat y'all don't speak the same language\nUh-huh, I know that you just wanna let it go\nWith all the bitches that you came with\n\n[Verse 2: Jhene Aiko]\nI know you've been going through some thangs\nWanna get away, baby, let me be your vacation\nThat other trick you've been fuckin' with is a trip\nYou know she be playin', baby I am just saying\nI know you know I am down for whatever, yeah\nYou know I'm just here to make you feel better, yeah\nTake a load off on my private island\nCome inside and go into hiding\nI know that you've been sacrificing your time\nAnd need time to unwind and let go\nSo let go and let's go and let's roll and we roll\n\n[Verse 3: Big Sean]\nExcited, activated get ignited\nSo many charges on my card, oh God I think it got indicted\nGet a, get a night, get a day, get a room, get a place\nGet a drink, pop a bottle, maybe we can get away\nYou a star, you need space, we can shoot up by the town\nHave you ever been to Texas? South By Southwest\nWhere we can smoke a zip like we can't get arrested\nWhere they might know us off any intersection\nI mean baby I know you've been, wanna be that baddest\nWanna be with somebody who ain't never had it\nNo status, just all cinematics, you just got casted\n\n[Bridge: Big Sean & Jhene Aiko]\nI know you've been crying and poutin'\nKnow you're tired of arguing but no screaming and shouting\nAnd you know we on a roll like we did good in college\nThrowin' hundreds and thousands\nLike they not hundreds and thousands\n\n[Chorus: Big Sean & Jhene Aiko]\nWhy? Cause I know you've been going through some things\nI know you've been going through some things you can't explain\nWith your main thing that shit insane\nI know you just tryna maintain, that shit is lame, you can't complain\nI know you don't even love the same, do you, do you?\nDon't love the same, I know you've been diving through pain\nI know you goin' so crazy, I know you runnin' on empty\nThat shit can fuck with your mente\nI know this shit, don't you tempt me, I know you...\nI know you've been runnin' on empty, runnin' on empty\nThe way you move it's like you could use a vacation\nI know you, I know you\nDrink in your hand and the harder you dance\nI swear right now it look like you on a vacation\nGotta get away, make it happen\nWhatever happened just had to happen\nOn vacation, yeah\nI know you've been, I know you've been\n\n[Outro: Big Sean]\nI know it look like like you need a vacation\nHow 'bout Hawaii, maybe Jamaica, maybe Asia\nTake you places other niggas can't take ya\nDon't forget the makeup, yeah"}], "artist": "Big Sean"}