{"songs": [{"title": "Noticed (Original Version)", "album": null, "year": "2017-06-06", "image": "https://images.genius.com/8ef3b4e5b82280ce1b1826f9697c4aa6.720x720x1.jpg", "lyrics": "[Intro]\nUghh\nYeah, yeah\n\n[Chorus]\nBitches switched up and act like I ain't noticed\nI just run it up cause' that's the main focus\nTalkin' down on all these bitches, yes I know this\nNeed a thottie, Kylie body tryna go with this\nI don't know how the fake shit go there\nGot too much going, think I'm fiendin' for the Goyard\nLike I'm up, Maison if you test me I'm gon' go there\n22, up on front, you can't go there\n\n[Verse 1]\nI don't know why niggas be frontin'\n(Yeah)\nI don't know why niggas be talkin'\n(Yeah)\nI don't know why niggas be flexin'\nI do what I want, stop talking\nMe, JD, link wit Southend, we was thuggin'\nYou don't know me, I been juggin' for a moment\nSaid I'm with Gs, say we trappin' so we thumbin'\nSaid we thumbin' yeah\nI said we thumbin' yeah\nFuck school, stuck to rapping, I love fast money\nIf you with it, better know you can't turn back from it\nJust copped some green for the wood I said and now we bluntin'\nFlipped a brick, now they ballin' and now it subbin'\n.223 and it's full, so we can blast off\nFast cars full of bitches like in mask off\nMy bitches 10, toot it again and I dash off\nStick em up and I did that shit now mask off\n\n[Chorus]\nBitches switched up and act like I ain't noticed\nI just run it up cause' that's the main focus\nTalkin' down on all these bitches, yes I know this\nNeed a thottie, Cali body tryna go with this\nI don't know how to fake shit, go there\nGot too much going, think I'm fiendin' for that Goyard\nLike I'm up, Maison if you test me I'm gon' go there\n22, up on front, you can't go there\n\n[Verse 2]\nFaking for what? Only tell truth\nSayin' they sparking you know it ain't true\nNiggas be talking but never come through\nSaying they banging but I know it's cool, yeah\nYeah, what's new?\nWhat's new?\nWhat's new?\nGrew up fifty avenue, tweaker layed up next to dude\nNeed a bigger revenue so I stay tryna sell to you\nNiggas always testing me so I stay with that .32\nYou can't roll with bros and me 'cause we gon' blast that .22\nYeah, you know\nI said you know, yeah\nI turn heads when I, roll through yeah\nYou know I'm with the, with a crew yeah\nCircle small so I just two times two, yeah\n\n[Chorus]\nBitches switched up and act like I ain't noticed\nI just run it up cause' that's the main focus\nTalkin' down on all these bitches, yes I know this\nNeed a thottie, Cali body tryna go with this\nI don't know how to fake shit, go there\nGot too much going, think I'm fiendin' for that Goyard\nLike I'm up, Maison if you test me I'm gon' go there\n22, up on front, you can't go there"}], "artist": "Lil Mosey"}