{"songs": [{"year": "2018-11-02", "album": "RARE Sound", "image": "https://images.genius.com/282b04bfc85cf54436eaef9d05920228.1000x1000x1.jpg", "title": "Far from Perfect", "lyrics": "[Chorus]\nTell me how I'm gon' trust you\nIf you don't trust yourself\nI'm just watchin' my steps\nThese niggas lurkin'\nWanna take my wealth (What?)\nBitch you know I work hard for this shit, stop playin'\nI ain't goin' out sad\nLord knows I won't do it\nThese niggas mad\nI don't really give a fuck\nWhere the hell were you when I was down bad?\nThese niggas ain't give me one shoulder to lean on\nNow I'm on top, I'm just gettin' my dream on\nEvery day I wake up, gotta throw somethin' clean on\nStyrofoam cup, I'm just gettin' my lean on (Sip)\nPop me a perc, baby just for the feelin'\nI know it ain't right, it's the way that I'm livin'\nTryna be a role model for all the children\nBut no I ain't perfect, do you dig what I'm sayin'?\n\n[Verse 1]\nNo, I ain't perfect, do you dig what I'm sayin'?\nI just caught a flight on the way to Japan (Woo)\nFamily gotta eat, gotta bring home the bands\nStill can't believe I had to cut off my mans\nI hear 'em all talk, but they don't understand\nFeel like all this pressure on me (On me)\nWhere the hell was you when a nigga didn't eat? (Didn't eat)\nWhere the hell was you when a nigga couldn't sleep? (Hey)\nGrandma gone, I don't know how to feel\nDon't wanna cry but I'm lettin' it spill\nLife come fast, it just feel surreal\nThe work don't stop, gotta pay these bills\nI can't clock out ho, no-no-no-no\nA young nigga tired but I'm still on go mode\nCan't let the rap game steal my mojo\nYeah, I'm keepin' it goin'\n\n[Chorus]\nTell me how I'm gon' trust you (Yeah)\nIf you don't trust yourself (Yourself)\nI'm just watchin' my steps\nThese niggas lurkin' (Lurkin')\nWanna take my wealth (Yeah)\nBitch you know I work hard for this shit, stop playin' (Stop playin')\nI ain't goin' out sad (Nah)\nLord knows I won't do it\nThese niggas mad (What?)\nI don't really give a fuck\nWhere the hell were you when I was down bad? (Let's go)\nThese niggas ain't give me one shoulder to lean on\nNow I'm on top, I'm just gettin' my dream on\nEvery day I wake up, gotta throw somethin' clean on\nStyrofoam cup, I'm just gettin' my lean on (Woo)\nPop me a perc, baby just for the feelin' (Yeah)\nI know it ain't right, it's the way that I'm livin' (Yeah)\nTryna be a role model for all the children (I'm tryin')\nBut no I ain't perfect, do you dig what I'm sayin'?\n\n[Verse 2]\nI make real shit for the niggas that appreciate it ('Preciate it)\nI know you broke niggas used to hate me\nGoin' down like the boy from Houston, baby (Houston, baby)\nSteak and shrimp from Houston's, baby (Woo)\nI don't even like the bitch, I had to use the lady (Use the lady)\nI know your man feelin' useless lately (Ayy)\nLike Pac, ridin' round in a new Mercedes (New Mercedes)\nI just pray they don't shoot it, baby\nHesitate, step back, then shoot it, baby (Bah bah)\nAR and a Ruger baby (Ruger)\nYou know the pussy stay wet on them cougars, baby (Cougars, baby)\nThank God, hallelujah baby (Woo)\nHella paper, I don't think I need a tutor, baby (Nah)\nI'm stuck on you like a tumor, baby\nIt's too late, should've got the boy sooner, baby (Sooner, baby)\nAnd I don't fuck with the rumors, baby\n\n[Chorus]\nHow I'm gon' trust you\nIf you don't trust yourself (Talk to 'em)\nI'm just watchin' my steps\nThese niggas lurkin' (Lurkin')\nWanna take my wealth (What?)\nBitch you know I work hard for this shit, stop playin' (Stop playin')\nI ain't goin' out sad (Never, no)\nLord knows I won't do it\nThese niggas mad (Mad)\nI don't really give a fuck\nWhere the hell were you when I was down bad? (What? What?)\nThese niggas ain't give me one shoulder to lean on (Nah)\nNow I'm on top, I'm just gettin' my dream on\nEvery day I wake up, gotta throw somethin' clean on\nStyrofoam cup, I'm just gettin' my lean on\nPop me a perc, baby just for the feelin' (Yeah)\nI know it ain't right, it's the way that I'm livin' (Yeah)\nTryna be a role model for all the children (Yeah)\nBut no I ain't perfect, do you dig what I'm sayin'? (Haha)\n\n[Outro]\nDig what I'm sayin'?\n(No, I ain't perfect, do you dig what I'm sayin'?)\n(Dig what I'm sayin'?)\nBut no, I ain't perfect, do you dig what I'm sayin'?\n(Yeah yeah yeah yeah)\nDig what I'm sayin'?\n(No, I ain't perfect, do you dig what I'm sayin'?)\n(No, I ain't perfect, do you dig what I'm sayin'?)\nNo, I ain't perfect, do you dig what I'm sayin'? (Yeah yeah)\nOh oh oh oh (Yeah, touchdown)\nOh oh oh oh\nYeah, talk to 'em, talk to 'em, let's get it\nOh oh oh oh (Yeah, touchdown)\nOh oh oh oh"}], "artist": "K CAMP"}