{"artist": "A$AP Ferg", "songs": [{"title": "Shabba REMIX", "image": "https://images.rapgenius.com/1drx78wq4ny44h2isjpnnvygt.500x500x1.jpg", "album": null, "lyrics": "[Intro: Shabba Ranks]\nSHABBA! Him deh yah\nS, and a H, and a A, double B\nAnd a A, R-A-N-K-S, always the best\nA$AP MOB, do the job, fly the flag\nLawd ah mercy, people\n\n[Verse 1: Shabba Ranks]\nSay my name a likkle louder\nHolla out mi name mek I rip up the crowd ah\nSay it 3 times if a me unu proud ah\nSHABBA! SHABBA! SHABBA!\nOh man, say it a likkle likkle louder\nHolla out mi name mek I rip up the crowd ah\nSay it 3 times if a me unu proud ah\nSHABBA! SHABBA! SHABBA!\nHey, holla out mi name, jump to mi name\nCall out mi name, bawl out mi name\nNah stop until it reach hall of fame\nSeh yuh body waan Shabba know de same\nPeople, holla out mi name, jump to mi name\nCall out mi name, bawl out mi name\nNah stop until it reach hall of fame\nAnytime mi spit, mi spit flame\nAh me dem in need of, true crowd pleaser\nTurn non-believer, inna believer\nCome crowd a people follow di procedure\nMi no Rakim but \"Follow The Leader\"\nHead ah go jump off ah fool dem shoulder\nChop off dem head with mi cleaver\nFrom Jamaica right back to Geneva\nShabba Ranking ah true crowd pleaser\n\n[Chorus: A$AP Ferg]\nSha-Shabba Ranks, Sha-Sha-Shabba Ranks\nEight gold rings like I'm Sha-Shabba Ranks\nFour gold chains like I'm Sha-Shabba Ranks\nOne gold tooth like I'm...\n\n[Verse 2: A$AP Ferg]\nWho that stocky nigga with the grills? Trap Lord you're so trill\nI could get a new Bugatti but a nigga rather chill\nRather sit up on the block and stack it 'til I get a mill'\nWhat about them old bitches who ain't wanna give me feel?\nNow they want a make it Gucci cause a nigga got a deal\nRather double up and strap and hit a booty in Brazil\nI hit Punta Cana when shit gets so real\nTwo bad bitches in my vehicle\nYellow hood rats like Pikachu\nHit it from the back got 'em screaming like\nAHHHHHHHHHHHHHHHHH like Yeezus do\nBringing rappers from the dead like Jesus do\nCan't call them bone thugs cause they eating dude\nI bust-a-rhyme and flip-mode, speak the flu\nNigga Ya Ya Ya eat ya crew\nButter pecan, Puerto Rican, be freakin' the deacon'\nA hood pope get good throat, I'm skeetin' the sheets\nShe feelin' my team, I asked her if she feelin' The Weeknd\nCause a nigga like she give head while you're singin'\nI'ma get the bread while I'm breathin'\nI'm the rookie of the year and you better believe it\nI be barkin' like a Que like I'm very collegiate!\nLike I'm Pedigree eatin'\n\n[Verse 3: Quavo]\nMeetin' up the plug at a QuikTrip\nYoung nigga had to make that money back flip\nI'm trappin' with accuracy\nGold on my toilet like Master P\nLil' mama, she drunk off a daiquiri\nShabba Ranks my pinky finger, please\nYou mad cause you workin' at Mickey D's\nYoung nigga, I'm flexin' like Hercules (flex, flex!)\nYou can take her to the movie and go watch a film\nA$AP Ferg, front me a pelican\nLean, lean, lean, that's my medicine\nQuavo, old money, Sega Genesis\n\n[Verse 4: Takeoff]\nTakeoff got ten gold rings, bling, bling, bling\nFor tryna take my rings, gun go bang\nCashed out on the jeweler, ching\nGot 'em feelin' like Martin Luther King, I had a dream\nActavis, I only sip\nAnd begin with a beam by extending my clip\nIf I see the police, grab my chips and I dip\nSnapping my fingers, we fillin' arenas\nI flip up the Hannah Montana in real\nI feel like that Keyshia Ka'oir\nThat double AK-47's, they aim at your lip\nVersace, Givenchy, this shit is ridiculous\nSHABBA!\n\n[Verse 5: Busta Rhymes]\nLook, nigga, get it straight, you could never fuck with my clique, boy\nAww shit, quick, hit you with the dropkick jaw\nBone break, you can see the way the clock tick, tock, tick\nFunny all these niggas stop, bitch boy\nBust' Rhymes back up in the cockpit, spit toxic, always givin' niggas hot shit, boy\nNiggas see me shinin' 'til he's sick, sick, sick\nAny bitch really want Islam dick, boy\nSo much jewelry, nigga lookin' priceless out here\nA lot of rappin' niggas lookin' lifeless out here\nKill 'em 'til they say a nigga triflin' out here\nAnd you can let 'em talk, you know who the nicest out here\nVroom, vroom, vroom! Bite dust pussy\nBetter get low when you hear de shot buss, pussy\nEvery time I come here, know I body niggas fully\nGodfather with it while I murder little rookie\nAnd I'm bigger than your shorty though her pussy kinda bushy\nFuckin' on the low, Versace logo on the hoodie\nAirhorn blow, my nigga, bwam bwam bwam\nLet it go, you already know what's really goodie\nKillin' shit like I'm some kind of cancer\nBag your bitch, now she my private dancer\nI don't understand why niggas feel like they have to ask who the god is\nWhen you know what's the answer\nChokehold shit 'til they be callin' me strangler\nHundred million dollars, safe behind the plasma\nProper with it, 'til he spread the propaganda\nAnd when I TEC talk, can we pop your man up\nOn my Sha-Shabba Ranks, on my Sha-Shabba Ranks nigga\nGettin' so much money, it's like I just robbed a bank, nigga\n\n[Chorus: A$AP Ferg]\nSha-Shabba Ranks, Sha-Sha-Shabba Ranks\nEight gold rings like I'm Sha-Shabba Ranks\nFour gold chains like I'm Sha-Shabba Ranks\nOne gold tooth like I'm Sha-Shabba Ranks\nSha-Shabba Ranks, Sha-Sha-Shabba Ranks\nEight gold rings like I'm Sha-Shabba Ranks\nFour gold chains like I'm Sha-Shabba Ranks\nOne gold tooth like I'm Sha-Shabba Ranks", "year": "2013-11-23"}]}