{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "Parte Loiça", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "Yo yo yo yo yo yo\nIsto aqui é astro records bitch\nProfjam e vilao mano, the big banger theory mufocka\nI dont give a fuck man! isto é rap mano\nRappers sayin what the fuck they wanna say\nDont come here with yo faggot bullshit right now\nCause shit right here man is break the fuckin dishes man\nParte a loiça!\n\nDamn, onde é q eu vim parar?\nPassam-me a perna e eu ainda paro pa ajudar\nDevo ser palerma, eu reparo, é quase dado!\nTantas vezes enganado, fiquei preso nesse estado\nJa nada sei se nem sei que sei isto...\nDesculpa fake, nem reparei q saiste!\nAjudei-te, ainda assim desististe\nPreparei-te, mas caíste, tá visto!\nQué isto? showbiz! despisto em chao liso onde nao vejo nem uma pegada\nSou priest e batizo, todo o mc vivo fica logo ca cara encharcada\nRoupa suada, nadega marcada, mente traumatizada\nPoupa-me brada, passa a palavra que a gente nao ta interessada\nMeu chapa, chapa dux la no lux? nao!\nCa tropa, é lusco fusco, move brusco: «tao crl?»\nBolota é muito escuro, da-me lume po canhao\nQu'esta shit é só weed, vejo-te a ti na escuridao\nVegetativa a naçao onde eu vivo à patrao\nFiquei nocivo, é fdd! culpem a poluiçao\nCuspo preto como a noite, é a cor do meu pulmao\nSafoda o ar puro, tenho uma pura na mao\nInspira, expira, acelera, trava\nTranspira e gira, hoje é tabua rasa..\nTripa amiga, pede uma nave à nasa!\nDiz à mae natureza: «hoje nao durmo em casa»!\n\nF-f-f fodaaase t-t-t-todass ficam doidas qd eu parto a loiça\nDizem coisas, fazem coisas, partem coisas qd eu parto a loiça\nRebentam bolhas, tiram rolhas, giram folhas qd eu parto a loiça\nSão cachorras bué da loucas e eu sou dogg pa elas todas!\nDogg pa elas todas!\nDogg pa elas todas!\nDogg pa elas todas!\nDo-dogg pa elas todas!\n\n\"huh, eu fico profundamente triste enquanto cidadã portuguesa\nFico profundamente triste em ver este tipo de manifestações\nQue demonstram uma falta de civismo das pessoas q vão huh interromper...\"\n\n[Vilão:]\nSiga lá partir a loiça só po espalhafato\nSiga lá encher o bolso e gastar tudo em fatos\nVou relatar os factos, cago pos boatos\nÁguias e lagartos a deixar tudo em cacos\nDj's nao riscam pratos, fracos ideiais\nPutos vão de saco em situações normais\nAumenta o volume, tu tas a ouvir os tais\nElefantes a entrar numa loja de cristais\nOu no expresso do sucesso tou co jam na agenda\nNao esperem pelo regresso tenho um processo na fenda\nOiço dicas sem nexo.. será q têm legenda?\nPitas partilham o ass no serviço pós-venda\nHaja alguém q me entenda e q faça de mim presa\nEm casa ou na tenda ou então sobre a mesa\nDps das sobremesa ponho as cartas na mesa\nMas se tens melhor jogo, vingo me na loiça chinesa\n\nF-f-f fodaaase t-t-t-todass ficam doidas qd eu parto a loiça\nDizem coisas, fazem coisas, partem coisas qd eu parto a loiça\nRebentam bolhas, tiram rolhas, giram folhas qd eu parto a loiça\nSão cachorras bué da loucas e eu sou dogg pa elas todas!\nDogg pa elas todas!\nDogg pa elas todas!\nDogg pa elas todas!\nDo-dogg pa elas todas!", "year": "2014-06-06"}]}