{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/d51a09ab284e0481b02b4d6ecfda5c73.1000x1000x1.jpg", "title": "Plain White Rapper", "year": null, "album": "Behind The Musik (A Boy Named Jonah)", "lyrics": "[Intro]\nYo son\nWhat's up son?\nYo son check out my man's mini-van!\nAh that's that new mini-van son!\nYo he sittin' on like ten-inch rims son!\nTen-inch rims son!\nAnd he got on a Wal-Mart throwback\nYo where'd he get that Wal-Mart throwback?\nHe got like five-inch speakers up in that thing\nWhat's that kid's name?\n\n[Verse One]\nMan, y'all should know who I am\nI stay thugged out rollin' out in my mini-van\nWith my ten-inch rims buggin' out with my little tan\nWhile I'm lettin' 'em spin, Mountain Dew can in my hand\nMan, I'm iced out like what?\nWell I was iced out when the ice fell out the cup\nBut I can't help it, I almost ran into a truck\nAnd the ice all melted, the mini-van got stuck\nBut it's cool, I let my speakers bump\nDude I got five-inch 'woofers in the trunk!\nAnd we still make the party people get up and jump\nKJ-Fivetweezy, you know he get it crunk\n\n[Bridge]\nMini-cans is in the house y'all\nMountain Dew is in the house y'all\nTen-inch rims is in the house y'all\nFive-inch speakers is in the house y'all\n\n[Hook]\nI'm just a plain white rapper\nNothin' more, nothin' else cause it really don't matter\nI'm just a plain white rapper\nNothin' more, nothin' else, I don't try to be an actor\nI'm just a plain white rapper\nNothin' more, can't you tell, no it ain't Marshall Mathers\nI'm just a plain white rapper\nNothin' more, even still you can quit your chit-chatter\n\n[Verse Two]\nFivetweezy\nYou know the name\n'Sup to the soccer moms all up in the place\nDriving SUVs, Camry, Lex or the Range\nMan, I just bought my CD on the way to the game\nYou don't have to act your age\nGet your hands up, make your kids think you strange\nStart dancing, get 'em really now ashamed\nPick 'em up from school, honk the horn, be like \"Hey\"\nOkay, back to the track\nI'm a kid in a cap and a Wal-Mart throwback\nYeah, what y'all know about that?\nMan, I be putting Cape Coral, Florida on the map\n\n[Bridge]\nSoccer moms is in the house y'all\nHomeschoolers is in the house y'all\nWal-Mart is in the house y'all\nSouthwest Florida is in the house y'all\n\n[Hook]\n\n[Verse Three]\nAin't nothin' special 'bout me\nAin't the best lookin', ain't the best MC\nNow, I'm not a hoodlum, flashy or icy\nAt the dentist, the only time I get flossy\nSee all really got is just Christ in me\nWho precisely breathe life in me\nJust guides me daily and nightly\nAnd never fails me cause he holds tightly\nAnd I know it's just a sight to see\nDon't seem right, don't even seem right to me\nBut all it just means is God gets the glory\nAnd in the end that's all I'm living for, end of story\n\n[Bridge]\nFivetweezy is in the house y'all\nT-Cleezy is in the house y'all\nSo get ya hands up in the house y'all\nAnd let's turn this party out y'all!\n\n[Hook]"}]}