{"songs": [{"image": "https://images.genius.com/49e67f195e584291bc2a980f23cdad07.809x799x1.jpg", "year": "1996-10-15", "title": "Carry the Weight", "album": "At the Speed of Life", "lyrics": "Intro: Xzibit, [J-Ro]\n\nI really wish I could act the way you want, you know what I'm saying?\n[I'ma tell you exactly why I do the things\nI do, you know what I'm sayin']\nGotta carry the weight you know what I'm sayin'\nGo ahead, check that shit out\n\nVerse One:\n\nYou see I don't like to reminisce about the past\nLower class, no clout livin' hand to mouth\nEach and every wrong move the police keep count\nMake it real fuckin' easy to get stretched out\nI was at the funeral when it all began\nYou know the painful transition from a boy to man\nLost sight of my mother at the age of nine\nDidn't understand death, nearly lost my mind\nBut see life moves on and broke niggas can't change it\nAge ten, new step family arrangement\nAt thirteen, started gettin' hair on my dick\nAnd noticed me and my sister were gettin' treated like shit\nI would forever be hit with anything in reach\nThen my father would proceed to go to church and preach\nAbout forgiveness, patience all the shit that he lacked\nDidn't jump when he said then that ass got cracked\nPhysical contact was in form of a slap\nAt the age of fifteen Xzibit now hit back\nCourtesy of my stepbrother, who taught me to scrap\nLeft the bitch on the ground with her eyes on black\nRan away from the house of Teresa and Nate\nInto juvenile detention where I built up hate\nI don't remember the date of the judicial debate\nBut legally I was now in custody of the state\n\nChorus:\n\nAnd niggas wonder why I sit up in the club and drink\nSay what's up to Xzibit and I still don't speak\nTryina contemplate the next move to make\nGotta find some way to release this hate\n\nAnd niggas wonder why I sit up in the club and drink\nSay what's up to Xzibit and I still don't speak\nI'm trying to contemplate the next move to make\nI gotta find some way, Xzibit carry the weight\n\nInterlude: Xzibit, [J-Ro]\n\n[Damn, it's fucked up though man]\n[You know what I'm sayin']\nYo\n[The fuck you doin' in jail]\nInsane man, I don't know man, he he he\n[Yeah what's goin' on down there, gotta get out dude]\nYeah I be out in couple of weeks man\nYouknowI'msayin'\n[It's poppin' man]\nIt's cool yo fuck that\n[It's poppin' out here]\nThey can go on and on for that\n[I'm tellin' you it's poppin' man come home]\nAlright, in a minute\n\nVerse Two:\n\nAnd now was was worse than the treatment I was gettin' at home\nOnly now I was fucked up plus all alone\nMy father talkin' all crazy to me over the phone\nTurned age sixteen now on my own\nStarted running with cats who carried gats cause they had too\nWith no hesitation lock load then blast you\nWithout a hassle, we in a town of hicks\nFuckin' all these chicks\nSellin' rock by the bricks\nSo we sellin' like we mothafuckin' Nino Brown\nAt the house when the motherfucking man touched down\nScreamin' demands: \"Let me see your goddamn hands! (Now!)\"\nATF cause a handguns's a contraband\nNever kept it in the house\nSo of course we clowned\nOnly found one pistol took us all down town\nWe be out by the end of the afternoon\nGettin' drunk on the strip let the system boom\nWho would assume Mr. QK would chill with a wife\nTy and Matt caught bodies\nNow they spend there life behind bars\nCatchin' scars that will not heal\nNiggas don't know the half about keepin' it real\n\nChorus 1 1/2\n\nOutro:\n\nLike this\nLike this, like that\nYeah! gotta carry the weight\nLike this euh!\nBringin' live\nYeah! yeah! like this\nIt's Xzibit\nGotta carry the weight\nLike that yo!\nLike that yo!"}], "artist": "Xzibit"}