{"artist": "Phat Kat", "songs": [{"album": "Re-Dedication To The Suckers", "title": "All Madden (Remix)", "image": "https://images.rapgenius.com/69cb877b6e47866d776f3b399e3b9c8c.1000x1000x1.jpg", "lyrics": "[Hook: Phat Kat 2x]\nY'all niggas just rapping\nGon' 'head keep yapping, we makin' shit happen\nRun up, cause when them thangs get to clappin'\nMy whole team is mean, nigga, we All Madden\n\n[Verse 1: Phat Kat]\nRonnie Euro, stay forever ready, (YEAH!) my aim's immaculate\nHoldin' the flame steady, please, don't let me get to bussin' (BAH!) Kalashnikov - AK Russian\nBuilt heavy duty, you nigga's ain't saying nothing (Un-un!)\nGrown ass man, no time for bickerin' and fussin'\nHeard you got locked, and got to singin', like Justin\nPost your bail? Have my shooter, blast you with the musket (BAH!) That shit that came out your head, was lookin' like some custard\nMy moves are silent, plans? Never discuss them\nGot hit for your budget, they found you with them\nAnd your body rotten under nuggets, my fortress of solitude Concocted rhymes crush him, will leave all\nY'all shook, like \"What did he say?\" Lookin' for your remote Quick to press the replay,  step in any booth\nAnd run you suckers, like a relay, Obi-Rhyme Kanobi\nHere to kill you slowly, I ain't friendly, so you bitches\n'Bout pay me what you owe me, need I say? This is polo\nEveryday, you niggas know me, that we makin' shit happen\n\n[Hook 2: Phat Kat]\nRun up, just when them thangs get to clappin'\nMy whole team is mean, nigga, we All Madden\nY'all niggas just rapping\nGon' 'head keep yapping, we makin' shit happen\nRun up, cause when them thangs get to clappin'\nMy whole team is mean, nigga, we All Madden\n\n[Verse 2: Guilty Simpson]\nYEAH, uh, still I stand, I'm in mint condition\nWith time, meanin' I gotta couple bands\nStackin' off of rappin', my dude, so what you sayin'?\nNOTHIN', cookin' these suckers in buttered pans\nThey tell me, \"It's a young man's game\", I say \"Naw\"\n\"It's a grown man's game\", I got fans, a shooter\nWith a high hand, darin' your crew, when the airin' is through?\nI'm eatin' rappers, like tiramisu\nWhat I speak, is terror to you, the truth hurt, don't it?\nThe illest on the earth wrote it, me\nAnd my team, is all the about the green, they hatin'\nSo I copped another heater, with the beam, want to be kings?\nI'll bring an endin' to your dreams, bells I ring\nFrom to Belarus to Phillipines, still supreme\nAnd those who object? I'll shoot a hole in your neck\nRound here? We as cold as it gets\n\n[Hook: Phat Kat + (Gulity Simpson)]\n(It's All Madden) Y'all niggas just rapping\nGon' 'head keep yapping, we makin' shit happen\nRun up, just when them thangs get to clappin'\nMy whole team is mean, nigga, we All Madden\n\n[Verse 3: Elzhi]\nFor not following God, you are hollow inside and weren't stable\nNow you eat your words, swallowin' pride and turn tables\nThe thought of even stoppin' me? Lettin' my light shine\nMighta went right into your left, but left out of your right mind\nIt's not possible, don't cross my path\nIt's got obstacles, the gossip you jot is writin' fossil fuels\nI'm the G.O.A.T, that Detroit raised that\nMade his one shot look like, three point plays\nFrom half court, I craft what the fiends on the ave snort\nThrough paragraphs, to get you high, as a giraffe wart\nCause y'all don't spit as versatile as me, I'm cuttin' you deep\nGive you a split personality, this what they thirst for\nPerform my first tour, an open mic attempt\nI've always had pinstripes, like a pimp\nSince what I write's jizzin', and just keep my height risen\nSo you can't see me when I black out, even with night vision\n\n[Hook: Phat Kat]\nY'all niggas just rapping\nGon' 'head keep yapping, we makin' shit happen\nRun up, just when them thangs get to clappin'\nMy whole team is mean, nigga, we All Madden\nY'all niggas just rapping, UH\nGon' 'head keep yapping, we makin' shit happen\nRun up, cause when them thangs get to clappin'\nMy whole team is mean, nigga, we All Madden", "year": "2015-10-30"}]}