{"artist": "Beanie Sigel", "songs": [{"lyrics": "(Beanie Sigel)\nBare witness to the greatest, can't beat us join us\nKeep heaters on us, with red lasers\nNow far warning, short shots won't graze ya\nWe hug corners, play blocks like gators\nWith bundles on, serve tre's like waiters\nIt's the life we chose, the hustle\nCan't stop it, can't knock it\nHalf the profit get flown out Vegas\nMe and my niggas tryna break tables\nStack chips like Connect 4\nWhile you pricks try and whip, tryna stretch more\nCharge less for, that ain't the program\nGet'cha lessons from the snowman\nLike Pilsbury I get the dough man\nI'll off ya head for a slice of bread\nI keep my word and I'm true to my peeps\nGimme a bird and my crew 'gon eat\nI'm over the stove like +Cuban Linx+\nBreakin down +Cash Money+ like +Baby+ do\nYou niggas soft like baby food\n'Round the world niggas pay me dues\nWhile you niggas sing the same old song like Sadies do (Jay-Z: same song)\nGrown man, nigga baby who?\nI send you shots from the baby zoo\nOld game like Grady fool, propane flow flame you dudes\nNo names don't claim ya shoes\n\nOnce again it's on nigga\nSigel hard like corn liquor\nI take you out this world like you was born nigga\nButt-naked, covered in blood, gaspin for air, clingin for dear life\nNigga you dead right?\n\n(Jay-Z)\nSince you was a baby, coward\nWe been sprinklin the world with baby powder\n+So Fresh and So Clean+\nBeen an +OutKast+ since I was a teen\nBut I outlast, cause I outblast anybody you bring\nYoung, you got it the prophet\nI told yall niggas then I showed yall niggas\nYou +Can't Knock It+\nDon't get carried away you a mute nigga (mute nigga)\nWhere was you nigga? I was doin this here like Mary J\nLike +Every Day+, It was true nigga\n\n(Beanie Sigel)\nThey can't question what we do Jigga\n\n(Jay-Z)\nOnce again it's on\nYoung run through you niggas, like a glitch in the computer nigga\nI'm the shit I'mma sewer nigga, This is Jay everyday, no days off\nFerris Bueler nigga\n\n(Beanie Sigel)\nB Sig Fred Kruger niggas, nightmare ya medulla nigga\nYou scared? Cause I glue with Jigga\nHe said \"Sig' you that nigga\" couldn't see his vision\nBut then he drew the picture, like a compository sketch\nSaid if Sig stay honest I'll deposit you a check\nIt's a secret society, all we ask is trust\nNo G-Money shit, all we gots is us (we all we got)\nTrue indeed, yes, more better, yes\nMore chedder, S-P chain, jeans, and sweaters\nMovies, cartoons, labels, etcetera\nFill in the blanks and drop blocks like Tetris or\nGet off the block run south with M. Betha\nFrom my block to your block shout out to M-Extra\n(Memphis Bleek: Who the fuck (fuck) want (want) what)\nNone of you niggas\nIt's B Sig prick I'm done with you niggas...\n\n(Beanie Siegel)\nOnce again it's on\nFuck we ain't through with niggas, twin towers here to ruin niggas\nYou couldn't break up the towers with Tom Donivich\nOr Osama bombin' shit\nWe slay niggas with 'K's, we the drama men\nGet it right young scrap don't even try it boy (boy)\nYou rather slide down a razor blade slidin board\nI'm a livewire, hoolahoop barbwire\nRun through hell with gasoline draws on\nYou can't mute me put the pause on\nMy gun shoot like fast-foward's on\nYou dress cute when the wars off\nWhat you doin dog you playin wit it\nYou make ya bed right you layin in it\nYou keep your share tight, you stayin in it\nYou bringin niggas where ya kids sleep\nI sing to niggas while the kids sleep\nRoc-a-bye mothafucka\nI hope you high mothafucka\nReady to die mothafucka\nWho shot ya? Separate the weak from State Prop to\nKids squash beef and rep the streets\n\n(Jay-Z)\nOnce again it's on nigga, bring the drama to ya lawn nigga\nTell ya momma bye bye get ready to mourn sista, it's a\nSee what you got here is a full blown twista\nYou nothin but hot air, it's not fair\nThe reason while we lead the pack, this is a marathon\nYou start off fast, then you wheezin in the back\nSo even if I slack I got enough leeway to put out +The Reason+ by the +Mac+\nPhiladelphia Freeway and I'm back, without leavin and I'm here\nBut you can't see him, I gave you +The Blueprint+ but you can't be him\nSo no matter what you been told and the records you sold\nDeep inside you know that it's only one Hov\nYoung veto, voice of the young people\nIf my life was a movie then +Sigel+ 'gon be the sequel\nWe bring it to ya door with Bleek peekin through ya peekhole\nAnd don't get scared nigga, alert ya people\n\n(Beanie Sigel)\nOnce again it's on", "image": "https://images.genius.com/ca482029f1aca4d2f2a6dec2d36da526.730x730x1.jpg", "year": null, "title": "It’s On (feat. Jay-Z)", "album": null}]}