{"songs": [{"year": null, "album": "Kopa 7\"", "image": "https://images.genius.com/bff1176ed6deb6d256cc9e04734b0136.365x365x1.jpg", "title": "Kill The Dance", "lyrics": "[Intro: Akon]\nAkon and...\n\n[Kardinal Offishall (*Akon)]:\nCho! Must be Kardinal!\nYo! J.A. (Yeah!) T Dot (Ho!) New York (Yeah!) Puerto Rico (Ho!)\nEngland (Yeah!) Germany (Ho!) All Japanese dem to, cho! (*Akon)\n\n[Verse 1: Kardinal Offishall]:\nAiyyo! B-boy stance in di dance so we s-ay\nMr. Kardinal dun know don't pl-ay\nHaffi buss a nut every rasclaat d-ay\nDon't mix up wid no faggot nor g-ay\nBuss two shot inna di air ok-ay\nBun up everyting from here to Mo B-ay\nCool yuh perform nuh bodda wid di lay l-ay\nBun up di whole T Dot inna di pl-ace\nDeal wid di girls nuh bodda watch nuh f-ace\nGal steppin out we have to deal wid di c-ase\nBad bwoy Kardinal front a di r-ace\nLove all mi gal dem in di black l-ace\nThis just a small ting one likkle t-aste\nTek a likkle sample no time fi w-aste\nMix up di treble and tun up di b-ass\nMr. celebrity face let's go!\n\n[Chorus: Akon]\nWe kill the dance again, mash up the place and it's a memory\nControl the spot like some big time bad bwoy\nOhhhhhhhh!!!!!! Hey!\n\n[Verse 2: Akon]\nRepresent convict music, Akon (Who dat?) A.K\nRecognize bwoy we don't play\nDo it like this each and every day (Uh huh!)\nSo please stay in your place\nHate to find you with no face\nBetter yet gone with no trace\nOther words please don't start no beef\nNow sip on your Chardonnay\nIf the girls tipsy then fade away\nI can tell that you wanna play\nCause it's written all over your face\nFrom here it's back to the block\n(Uh huh!) Hopefully not back to the Glock\n(Uh huh!) Got it made up but what if them cop\nIf I don't get popped by them crooked ass cops, no!\n\n[Chorus: Akon]\nWe kill the dance again, mash up the place and it's a memory\nControl the spot like some big time bad bwoy\nOhhhhhhhh!!!!!! Hey!\n\n[Verse 3: Kardinal Offishall]\nAiyyo light up di place when di whole place sh-ine\nLet me see somethin gal (Wine gal wine)\nLook yuh own gal nuh bodda touch m-ine\nEverybody show me a sign (Cho!)\nAre you a Scorpio? (No!) Taurus? (Yeah!)\nMiddle finger up real high inna di air\nJook dat gal a like yuh just don't care\nBrush dat bwoy deh if him caan stop stare\nThrow out yuh Pumas or yuh Nike Air\nMi nuh really bizniz weh yuh waan wear\nShow mi yuh cellular mi nuh dat yuh bare\nWhether yuh G string or yuh skin bare\nEat up yuh heart and come follow m-e\nMr. Kardinal inna di place to b-e\nHair stay nice and yuh part cool-ie\nHuh, buss di dance let me s-ee, Kardinal\n\n[Chorus: Akon]\nWe kill the dance again, mash up the place and it's a memory\nControl the spot like some big time bad bwoy\nOhhhhhhhh!!!!!! Hey!\nWe kill the dance again, mash up the place and it's a memory\nControl the spot like some big time bad bwoy"}], "artist": "Kardinal Offishall"}