{"songs": [{"image": "https://images.genius.com/3e04787eea4f43554ffcbde3a35ad709.1000x1000x1.jpg", "title": "No Remorse", "album": "Death Rap", "year": "2007-09-11", "lyrics": "Blast you with the Metallica\nRip ya head to shreds like Gallagher's sledge hammer\nYou're dead like the space shuttle challanger\nScar slashes, car crashes, guitar thrashers\nBarbaric fascist, smashing you like Cassius\nIn a bar brawl smashed on Jager and hashish\nWar clashes, napalm blast hits, ashes to ashes\n100 yard dashes through the pastures, landmines stashed in the grasses\nBlood splashes on the bra of Onassis\nKilling you is sweet like a jar of malasses\nWe're hard assassins rockin' dark glasses\nSarcastic, millitant like M.A.S.H. is\nTear gasses, burn like hot flashes\nBas in ya skull, blood drips down ya eye lashes\nBombastic like Comstock convicts\nAssfucked, shanked with sharp plastic condoms\n\n[Hook: x2]\nPunch you dead in your face, snuff you, jux you, mush you, rush you, bust you\nAny day, any place, any time, step, no remorse, no regret, rep it to the death\nSet it off in the street, cock back gats, fists or weapons, whatever, attack\nYou don't want it with me, look into my eyes, Death Rap, listen to it, live it, die!\n\n[Verse 2:]\nLight you up, rabid oxidation, scintillation\nSkin burn to a cinder, disintigration\nInferno wind, flame blazing\nTinder, luminosity, human atrocity\nFumigated found in ditches, bodies on top of bodies\nAccumulated like compound interest\nAt the help with a splatter film axe, flank attack\nStomp you like a tanks caterpillar tracks\nOverture of torture, let the crows get ya\nBlood stained, Gorbachev's head, chrome wet ya\nPackin like jack Ruby with a short fuse\nBooby trap you, brapppp! You live on the news\nLapidation, foulness like Ralphus\nRapid heart palpitations, scalp you like Al Fish\nEvery subject is sticky, strictly thug\nLet off a clip in ya mug publicly\n\n[Hook: x2]\nPunch you dead in your face, snuff you, jux you, mush you, rush you, bust you\nAny day, any place, any time, step, no remorse, no regret, rep it to the death\nSet it off in the street, cock back gats, fists or weapons, whatever, attack\nYou don't want it with me, look into my eyes, Death Rap, listen to it, live i"}], "artist": "Necro"}