{"artist": "The Game", "songs": [{"title": "Bad Intentions", "album": null, "year": null, "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg", "lyrics": "Bad intentions nigga\nFucking with the wrong one\nCall Dre tell that nigga I'm on one\nAftermath nigga we blaze cuban cigars\nDrive foreign cars into the stars\nFuck bitches at our leisure\nStuff dick inside they throat til they have seizures\nHoes down, B's up\nRoll the trees up, Smokey Robinson\nStart trippin, I like his jewelry, then I'm robbin son\nFuck a platinum plaque nigga hood with it\nBouncin that impala down the shore like what's good with it?\nI'm a made man, I wear J's and\nI been around more rocks than a fuckin cave man\nI done sold it and bagged it\nI done drove it and crashed it\nFucked my credit up smashin the Aston\nFYI nigga I got a magnum\nOnly time I been punked was by Ashton Kutcher\nI'm a motherfuckin butcher\nLeave me around anything white and I'm a cook it\nI be all up in the kitchin\nNo need for an apron, playboy\nI'm a professional, I'm cakin playboy\nThe last real D-boy up in this rap shit\nChrome 24s with the fat lip, call the shits? cash\n? Fuckin with the bomb squad\nDismantle any MC for free, you been warned god\nChurch, Higher power\nImpala sittin clean like it took 5 showers\nNigga I'm the G.A.M.E. so don't you tempt me\nYour chest'll be full and my clip will be empty\nI'm simply one of the most raw niggas in this shit\nWhy you think that I got in this shit?\nPaid for my momma house, bout 700k\nCan't stop smokin but I'm down to a blunt a day\n\nYay, I mean yayo\nOn the block sun up sun down like where the day go?\nWe come through chargin nigga like San Diego\nSeventeen chargers, couple of em same color but the shit is ok though\nCause all my niggas on the payroll get caught slippin, get a halo\nAnd I ain't talking bout the x-box\nNiggas let the tech knock\nWelcome to the real life Black Ops\nWhere it's still fuck the police, white and black cop\nAnd we ain't killin Jonny, no\nNigga give em an ass shot\nPut him on injured reserve\nTie my number twelves up and then I give him the bird, word\nThat's how I get down, all you rap niggas floppin\nWho talkin shit now? only Drake and Ye worth coppin\nI take a hiatus, spend a little time gamblin in Vegas\nCome back to back runnin faster than five Lakers\nSo mother fuck a hater and his family\nAbout to finish the R.E.D. album up in Miami\nLebron can't stand me, cause I got this purp in my cup\n24s on the truck, Laker game nigga what?\nBallin, Jim Jones voice probably with the Byrd Gang\nSee the chrome boy, them my mother fuckin home boys\nBut I'm from Cali not to be confused with Khaled\nHe say that we the best but I'm the best that's valid\nAnd before you try to say that that's a diss\nI was at Khaled's house two days ago bitch\nSippin on a Long Island ice tea with a white bitch\nThat was just as bad as Ice-T's, but she's not the wifey\nThe wife be at home with the kid's\nLook at them and see how a motherfucker live\n24 cars, 5 and a half cribs, I was spending money like goin broke was the shit, shit"}]}