{"songs": [{"title": "Indwelling Sin", "album": "Rebel", "year": null, "image": "https://images.genius.com/203d6f5e6f6426f878ba3ff2a016c5e6.1000x1000x1.jpg", "lyrics": "[Sin]\nAye look what's good man it's me again\nThe one you used to call your friend\nI know you ain't forgot me?\nOh yeah, you always get me caught in sin\nHere you go with that again\nYou act like we ain't cool or something\nLets go smoke a Kool or something\nTalk and sip a brew or something\n\n[Lecrae]\nNah man I ain't trusting you\nAin't nothing but lust in you\nThanks be to God I obeyed the teaching I was entrusted to\nCause when you pass by you just want your boy to backslide\nHave me feeling sick like I'm coming down off a crack high\n\n[Sin]\nMan that's a flat lie\nYou act like I'm the bad guy\nYou know when me and you get together we have a grand time\nLets take it back, all the way to like the 6th grade\nLast thing on your mind back in the day was trying to live saved\nRemember house parties, kissing in the dark?\nMan that was innocent fun come on-\n\n[Lecrae]\nNow don't start\nSee dog I live by the Spirit so I don't gratify\nAll them old sinful desires that never satsify\n\n[Sin]\nAye come on kill that\nLook me in my face and tell me I'm a lie\nYou ain't feeling chasing women, getting drunk, and getting high\nStacking money, staying fly, living up the playas life\nWe was having fun now you gon' try to be religious\n\n[Lecrae]\nAyo man first of all lower your voice\nWho you talkin' to?\nHandcuffed in August '02 I got caught with you\nTruck flipped over on 35 that was all from you\nI'll mess around and lose my life, man tryna walk in you\nI'm standing on these stages and got these people believing me\nWhat I look like trying to gratify this disease in me\n\n[Sin]\nSo now I'm a disease? Man please, I got yo back dog\nI ain't saying drop the Jesus and be a rap star\nAll Im saying is when it's you and me lets be real folk\nWe ain't gotta be selling drugs and tryna kill folk\nMaybe just a lil-\n\n[Lecrae]\nWhat? A lil this, a lil that\nA lil BET late at night, that's like a lil crack\nSee you ain't gone lie to me, I see how you be tryna be\nBET tonight becomes addiction to pornography\nThat's in no way honoring the God who's ruling sovereignly\n\n[Sin]\nMan you know you miss them old days\n\n[Lecrae]\nYeah you right possibly\nBut after that I sober up, think of Jesus holding up\nHis skin up on the cross for all them drunken nights I'm throwing up\nEvery thought of blowin' up is captured in his flowing blood\nI start thinking Philippians 4:8 when you showing up\n\n[Sin]\nYou know I ain't gon' quit right?\n\n[Lecrae]\nYeah I know but I'm dead to you\nAnd one day I'll be present with Jesus who died and bled from you\nColossians 1:15 thats the God that I trust in\nThe Father crushed Him, in doing so he has crushed sin"}], "artist": "Lecrae"}