{"artist": "Pimp C", "songs": [{"album": "The Naked Soul of Sweet Jones", "title": "What Up", "image": "https://images.genius.com/0d642196ad89f3b471f3e7f78223006a.558x558x1.jpg", "lyrics": "[Produced by Boi-1da & DJ B-Do]\n\n[Intro: Drake]\nYeahhhh, yeah, uhh\nHigh Rollers, what's up? Drinks Houston, what's up? Onyx, what's up?\nYou does it baby, you does it baby\nHarlem Knights, what's up? Treasures, what's up? Legends, what's up?\nJust love me baby, just love me baby\nYeahhhh (yeah)\n\n[Verse 1: Drake]\nTo all my Houston Texas country muffins\nBaby let me hit that liquor and that blunt you puffin\nAnd after that, I'mma throw that fucking Young Money up\nAnd we can both watch it fall like it's bungee jumping\nMan, I'm so high\nNext time we won't smoke all of the ounce you buy\nOoh, I almost forgot to blow the candles out\nCause I don't really wanna fall asleep and light this house on fire\nGood night, I'm still up, I told my girl to lay down\nI see the bottle is full, I'm 'bout to drink it way down\nWhat up Bun my nigga? Man you know we stay down\nAnd I'm a honorary resident in UGK town\nI'm on my way, Yeah I'm on my way\nI never give a fuck about what any nigga say\nThe music all slow and the bitches all pretty\nMe and Pimp about to do it for the city in this thang\n\n[Chorus: Drake]\nWhat up, what up\nH-Town in this bitch\nWhat up, what up\nMe and Pimp about to do it for the city\nWhat up, what up\nWhat up, what up\n\n[Verse 2: Pimp C]\nUhhhhhh\nMoney by the ton (ton) bricks from crumbs (crumbs)\nMillionaire from nothin (nothin) mind on hustlin (uhh)\nPussy's a commodity but dick sells better\nWearin Dickies and high shoes to a Cashmere sweater (uhh)\nPaint done got wetter than it was in nine-fo' (fo')\nThe drank done got thicker and the dirt weed rolled (rolled)\nNine-six Impala with the stick on the flo' (flo')\nNow it's Bentley fo' do's with my 'dro all on the do' (do')\nThats light wood nigga Polo, fuck Hilfiger ('figer)\nJammin Slim Thug (Thug) belly full of drugs (drugs)\nYoung hogg nigga (nigga) underdog nigga (nigga)\nYellow lights on the ground cut through the fog pussy nigga\nYellow diamonds on my finger, playin in the car (car)\nMy dick wanna fuck but my pockets say stop (stop)\nNot cause they empty I'm just greedy for some mo' (mo')\nI need some mo' dough, I'm a P-I-M-P fo' sho'\n\n[Chorus: Drake]\nWhat up, what up\nH-Town in this bitch\nWhat up, what up\nMe and Pimp about to do it for the city\nWhat up, what up\nWhat up, what up\n\n[Interlude: Bun B]\nWhat up doe, Young Drizzy\nSweet James Jones, Bun Beada\n\n[Verse 3: Bun B]\nWell it's the Trill O.G., I got the neighborhood soul\nCause she said I'm gettin blowed, ride and bang and get throwed\nAnd the candy painted low (low) chrome grill in front of it\nBelts on the back of it, my chromey shoes runnin shit\nAnd shorty on the side of me is straight up off the King cover (cover)\nDon't care what anybody say long as the king love her (love her)\nWish I could tell her that I don't but it would kill her\nI just keep on grippin grain (drippin stain) bein trilla\nAin't another brother realer, blowin thousand dollar killa\nWith that Filipino flow that I just got in from Manila\n'Bout to snow up in my city - so let me put on my chinchilla\nIn the 'rari doing Donuts like my name was J Dilla (Dilla)\nAll about the skrilla so just point me to the dealer\nKeep the work up in the attic and the money in the cellar (cellar)\nYour girl up in the second, automatics for the fellas (fellas)\nYou see us in the back then all you gotta do is tell us\n\n[Outro: Drake]\n[Chorus: Drake]\nWhat up, what up\nH-Town in this bitch\nWhat up, what up\nH-Town in this bitch\nWhat up, what up\nH-Town in this bitch\nWhat up, what up\nMe and Pimp about to do it for the city", "year": "2010-09-08"}]}