{"artist": "Pink Guy", "songs": [{"album": "Pink Season", "title": "Fried Noodles", "image": "https://images.genius.com/176ec7cd55a78c0fcb8c2560fa88283c.1000x1000x1.jpg", "lyrics": "[Intro: Dumb and Dumber]\nWhat happened?\nHis head fell off!\nHis head fell off?\nYeah, he was pretty old\nOh, that's it! I've had it with this dump!\nWe've got no food, we've got no jobs, our pets' heads are falling off!\n\n[Bridge]\nPussy, pussy, pussy, can't you see\nYou bitches can't do it like me\nMotherfuckers stay mad, like I killed their mom or something\nIf you really didn't care, you'd let it be, yo\n\n[Verse 1]\nI've been dying since day one, but y'all knew that\nMy dick like Americans: Too fat, but dangerous\nI'm the grimiest motherfucker to walk this earth\nThe shit I do is way below dirty sewers, a connoisseur\nI'm a flying reptile, a pterodactyl on Adderall\nI've got a bunch of scales that I dug up, you've never heard at all\nEat a dick little faggot, jeez, and furthermore\nYou're trying to scrap with me? I don't beef, faggot, I'm herbivore (Hmm)\nI crawled into the industry, a saturated circus\nManipulating like Hillary\nThey say I'm crazy, but lately they've been defending me\n'Cause take a look around, motherfucker, everyone's digging me\n\n[Chorus]\nI live in a constant state of fear and misery\nDo you miss me anymore?\nAnd I don't even notice when it hurts anymore\nAnymore, anymore, anymore\n\n[Bridge]\nPussy, pussy, pussy, can't you read\nI'm a dirty old pussy eating freak\nMotherfuckers still mad like I killed their mom or something\nIf you really didn't care, you'd let me eat\n\n[Verse 2]\nHere we go again, I'll make jokes about your estrogen\nThat's pretty much the rest of this song, I'm roasting everything\nI'm a weird little entity that'll enter titties\nAnd bust all over the tummy and little nippies\n(Ew!)\nI know I'm morbid at times, that's how I like to be\nThey call my dick a mammoth, you salty you got a micro D\nClassic penis joke, inserted with appropriate timing\n'Cause if I ain't got a penis line I ain't dining\nNo homo, but seriously I'm getting faded\nAnd my life is like my vids, low budget and underrated\nKids, the only way to succeed is to chip away at the soul\nAnd hope that by the time you get there you ain't singin'\n\n[Chorus]\nI live in a constant state of fear and misery\nDo you miss me anymore?\nAnd I don't even notice when it hurts anymore\nAnymore, anymore, anymore\n\n[Outro]\nDon't take the lyrics too seriously, I don't really give a shit", "year": "2016-05-08"}]}