{"songs": [{"image": "https://images.genius.com/9a7b9f4de6723e26dca74ce406572aa7.1000x1000x1.jpg", "title": "Slowdown", "album": "Underestimated, Forgotten & Overlooked, Vol. 2", "year": null, "lyrics": "[Intro: Torch]\nOh this that vibe right here\nNo breaks... no time to breath on it\n\n[Torch]\n(Oh, le'go) You're now rockin' with the corner\nReal D-Boy, ball like humanoid\nStuntin' like Meek used to, my man spit mad (shit)\nShe like to get cut shawty the Kim K bath\nAin't hard to tell I'm next, you can smell a check\nI ain't gotta squeeze I coach them hittas, Belichick\nHella fresh arrogant they tryna humble me\nPulled up black and yellow, transformer Bumble Bee\nM's on my hood, VVS' on my neck\nYSL on my clothes, I murdered the alphabet\nI'm a G you ain't know somebody should've schooled you\nNicer than me? Only on April 1st they fooled you\n\n[Meek Mill]\nIt's Meek Milly north Philly no I'm alive\nThey say I'm lazy but super hotter than summertime\nGoons with me honey shots it's rummytime\nRunning time and tell 'em catch up like Dungey\nHa! Ha! I'mma beast like Blake Griffin\nWe ain't slippin', Louis luggage I ain't tripping\nAirshippin' G4 no retour\nI tell 'em feed me beats so I can see more\n\n[Hook: Torch] + (Woman)\n(So just slow down) MMG we killin' 'em\nWe killin' 'em! MMG we killin' 'em\n(So just slow down) MMG we killin' 'em\nWe killin' 'em! MMG we killin' 'em\n(So just slow down) MMG we killin' 'em\nWe killin' 'em! MMG we killin' 'em\n(So just slow down) MMG we killin' 'em\nWe killin' 'em! MMG we killin' 'em\n(So just slow down)\n\n[Interlude: Torch]\nHa ha it's what we do\nMaybach, we the untouchable\nFiretruck ninja, where you at nigga?\n\n[Gunplay]\nSlow down you're murkin' 'em, you're too hot\nHotboy turkin 'em surround 'em circle 'em\nPut 'em down like a straight R AR\nFifteen with me on my day off\nMy nigga I'm about that\nHow wet that shit I'mma rock that\nPass yo bitch I'm in then got that\nYou don't want these problems oh no not that\nAw man\n\n[Wale]\nOne time for Hip-Hop, but fuck it, don't love it\nYou might fool the public, but we know you suckers\nSuckers, fool blooded all around bustas\nFuck em, you and I ain't even no discussion\nTrust it, truly I'm just tryna to get off\nI ain't tryna eat small, I'm just tryna Warren Buffet\nBuffet whatever ten sumthin' vuleva\nKinda cost me a grip though I be living out luggage\n\n[Hook]\n\n[Interlude: Torch]\nAww man, I tried to tell y'all man top to bottom\nMMG, we stronger than ever nigga\nBreed talk to 'em\n\n[Young Breed]\nGotta get street gutter hard like Breed\nYou greedy suckers not out my league\nYou lame nuddin it's MMG\nWhen you go out there and hustle watch everybody eat\nWhen you lookin like money guess everybody eats\nThe E ran shit these everybody's streets\nHard, soft, rerock or better\nO's Pounds we cop whatever\n\n[Stalley]\nSixteenth get the money, still on the paper\nRoss still flippin' dummy, every foe back and down\nEvery nigga hungry, famished they be grabbin' hammers\nGoin' out huntin' these wolves on the prowl\nCock it to a crying out child now flip it down\nIncreased up cum pretty slugs too loud\nWeed in the air passed by like a shoot cloud\nWe out here blue collar boys\nHow niggas makin' a new kinda noise?\nBlack blue and tan is unidentified, niggas all rappin'\nAll mad with saran, it's about full of pildis\nWe shootin' outside I'm tryna' kill ish\nIt's funny how these niggas won't ride when times are realest\nA revolution everyone respects\nI'm feeling Dickie shirts seven buttons to the neck {*echoes*}"}], "artist": "Torch (Triple C)"}