{"artist": "Antoinette", "songs": [{"title": "I Got an Attitude", "image": "https://images.genius.com/f30b448fd2f37fcc342ea63cf5a4ae5e.538x553x1.jpg", "album": "Hurby’s Machine : The House That Rap Built", "lyrics": "Aurally potent, lethal, bust steady\nMan your battle stations, I'm ready\nCold gettin bigger, an idol-like figure\nPlay me if you want and make like a trigger\nSqueeze off your best, you can huff and puff\nBut it's kiddie stuff because your best ain't good enough\nStand on attention, your body in line\nThis ain't your average rhyme, if it is, it ain't mine\nDucks, has-beens, I'mma show them all\nI'm not a joker but I laugh cause y'all can't brawl\nI roll the mic, smoked I lay it to rest\nEmbalmed in my palm, I touch it and it's blessed\nGot style, I know the routine\nAll punks poppin junk can't join my team\nI got an attitude\n\nI run through the motions, I don't ramble\n20:1 I'm up to par, don't gamble\nI take it till you're broke, you think it's a joke?\nThe last duck that laughed choked from my smoke\nI light the mic on fire, set alarms to perk\nAntoinette is alert, I put bodies to work\nMy attitude fills the room, you can feel the tension\nAnd if I ain't around, just mention\nI'm on the way with the mic at my side\nWatch the ducks hit the road up to Duckhill Drive\nWhen I finally approach I be in the mood\nTo get loose and get mine, me and my attitude\nI got an attitude\n\nCome to the party with an attitude, a mood to chill\nWhen the music starts kickin I can't keep still\nBiters watchin me, eyein me, waitin to make\nLittle rumors causin tumors that I might break\nBut I'll never break, I'll just address the crowd\nThere's no ifs, no ands when it's pumped up loud\nCause I'mma rush em, crush em, shame, tame and blush em\nVoices that are moist - I'll hush em\nI'm no joke, the mic smoker of chicks\nFrom the pack I'm the pick, no, it ain't no trick\nI got rhymes that'll rock ya, beat that'll knock ya\nIf it don't shock ya the body'll stop ya\nBut don't play me close, other words hands off\nDeep voice, hard and moist, playin hard when you're soft\nYou want a cutie? Don't mean to harness the charm\nDom Perrignon in the arm, duck alert the alarm\nI'm not braggin or boastin, don't wanna be rude\nBut sad sorry-looking Sallys keep tellin' I got an attitude\n\nYou wanna know why I play you like that? I don't like your face\nTake your running shoes off, you ain't in this race\nKick back, sit back, step off, sit down and be numb\nFeed crumbs to bums, rock rhymes over drums\nIt ain't complicated, must I break it down?\nDef rhymes from a lady with a real live sound\nMust admit it I'm with it so get with it, you dig?\nFlossin carat and gear, and real hair, not a wig\nBodily I'm vivacious and vocally gracious\nAntoinette's put together in all the right places\nFit to carry wit, makin hit after hit\nNever ask me to quit cause I'm eternally lit\nYou ain't ready, baby, sorry Sally, this is my thing\nA lot of male vocalists can't even hang\nAnd if they sound like a sissy when they diss they just piss me\nOff, I get wild and on the mic I get busy\nBold just like a bee, I'm the queen of this thing\nRock a beat inside out like Whitney can sing\nClear my throat, hit a note, ( ? ) and bruised\nYou run circles with my words, I finds and loose\nYa, run your ( ? ) to the edge, you must be on qualudes\nDon't be comin in my face ( ? ) sayin I got an attitude", "year": "1987-01-01"}]}