{"songs": [{"image": "https://images.genius.com/6ad21432400163f3234f3fedd46950bf.500x500x1.jpg", "lyrics": "[U-God]\nYo, yo, yo, yo\nVendetta inside, swiftly start stabbin\nOne second to meltdown, feel the twin cannons\nBurn, handgun herns, standin firm\nReturn from mega-death, I'll tell you what's left\nDilemma, Earth tremor, up by man\nWith the Grand Canyon rap, U dynamic wingspan\nThe Power from the Clan, yo, is more than fantastic\nPull pins out the hazard, on this Battlestar Galactic'\nSkull tactic, sporatic, Asiatic, long awaited\nSon of Sam, mention the mic mutated\nYou hated us, cuz we immortal on wax\nRip the China White shit, flip a dynamite ax\nShillac em perhaps, the heart pump an anti-toxin\nFeed me the Power, meteor shower when I'm boxin\n\n[Chorus: U-God]\nProfessional vets, now comin through vexed\nI'm testin you vets, what you claimin that you best?\nThe S on your chest, better stand for Super-stress\nAnd Leathaface pressed, next, here to set you\nREC! I suggest niggas come To the Rescue\n\n[Lethaface]\nI know how to part your medula, oblong gotta\nTest the rocket launcher, they'll get conquered\nBy my block sponsers, monster Tonka truck ya\nThe whole train conductor\nA hole in your spine, rip your stomach mothafucka\nBrotha suffer, my Dutch puff as sinister as the Feds\nInfrared, signin on the Glock, splittin ya head\nDrippin wet from death threat messages I inject\nIntellect reflects worldwide over Internets\nHeart colder than Winter Fresh, chest smokin like incense\nVets broken into the flesh, soakin in ya own mess\nChrome bleds, some of the known best soldier vets\nOver cassette, you get smashed like crashed desert air shows\nHoldin ya breath, gaggin for a bit of oxygen\nSubmission put a stop to men, reveal the foul document\nLockin position, invision, adapt critical condition\nPitiful you didn't listen, now we're spiritual blessin\nViewer discretion advised, sabotage satellites\nSplatter guys, get ya food ate like I'm Big Mac and fries\nTrap nines in the thighs, symbolize real lives\nInstill a rocket fuck from the inside to the outside\nIn ya mouth lied the barrel, subdue bone marrow\nYa tone shadow, blown from high-explosive poem battles\nDome smack, you live, projectiles effectin you\nIncredible new wave heart, blade sharp verses sexin you\nClaim professional, but I never met you\nSon I never forget you\nI slaughter foes when my particles wet you\nTo the Rescue\n\n[Chorus: U-God]\nProfessional vets, now comin through vexed\nI'm testin you vets, what you claimin that you best?\nThe S on your chest, better stand for Super-Stress\nThe Golden Arms pressed, next, here to set you\nREC! I suggest niggas come To the Rescue\n\n[U-God]\nSlash hope, raw burnin, freezin thoughts are cold\nBallistic missle lift off, now one behold\nMy throat harden for Harlem, harness the volume\nWith grief fallin on me in a breeze, the seas partin\nIt's two men awesome, uncanny\nThe handy man crook, the rap gank where every damn nook and cranny\nPlus four more opponents couldn't throw me, couldn't slam me\nI told you before, this is war, it's radical claw\nMenate the law, practice my ambition\nUnderstand determination, plus my burnin condition\nRebuild 'em, sing a song strong for disaster\nScorch 'em on a letter, clever, bled 'em much faster\nExotic lens, bionic Timb's, hardco' organic\nThe floor panic when revolvin, Shaolin dodgin\nPotion of my juice, it's \"Houston we have a problem\"\nIts Basic Instinct, motor mouth, hold is sacred\nThe Rushmore Rock Face, one four shot with the greatness\nRaw shoulders, sword colder, no remorse\nThe crash course, the portions of my Porsche\nDivorse it, the Holocaust exhaust, driven with force\nMighty ship back on course, I almost lost it\nToss the smokin corpse, seldom sing\nShells amongst men, rebellion, teens formin and swarmin\nVikin style, strikin without warnin a nation\nStandin ovation, rap devastation\nNew animation, the scandal\nBandle the best part, damsel in distress, I'll bless you\nGod damn you! To the rescue\n\n[Chorus: U-God]\nProfessional vets, now comin through vexed\nI'm testin you vets, what you claimin that you best?\nThe S on your chest, better stand for Super-Stress\nThe Golden Arms pressed, next, here to set you\nREC! I suggest niggas come To the Rescue", "title": "To the Rescue", "year": "2001-07-03", "album": "Wu-Chronicles Chapter II "}], "artist": "U-God"}