{"artist": "Big Daddy Kane", "songs": [{"lyrics": "When you work, sometimes you sweat\nAnd when you sweat you're gonna get wet\nYou're gonna get wet (OW!)\n\n[Verse 1]\nI was the one to say I get the job done\nI did it and got with it, I must admit it was well fitted\nA piece of the pie would be fly\nInstead of a crumb for a bum, uh, I gotta get some\nBut I don't wanna be a secondhand, middle man\nI wanna take a grandstand and\nMakin' the cash flow grow\nPullin' myself outta the dirt\nAnd a job ain't nothin' but work\n\n[Hook 1 with various ad-libs]\nWORK!\nA job ain't nuthin' but work\nWORK! WORK!\nA job ain't nuthin' but work\nWORK! WORK!\n\n[Verse 2]\nMo' money, mo' money, mo' money\nGotta get made to get paid in this trade\nAnd I believe that I can achieve\nTo make ends meet like a hair weave\nSurvivin' in this economy, people in the world they gotta be\nStayin' in the upper class, so you're the path\nThe rich gets the most and the poor gets a little\nAnd only Monie Love can make it in the middle\nI can't let life get the best of me\nI gotta take, take control of my own destiny\nControl what I hold and of course be the boss of myself\nNo one else will bring me wealth\nI gotta hit them streets to make ends meet\nSo just bust the style of a hustler\nRun a scam, 'cause damn, many people pockets get hurt\nAnd a job ain't nuthin' but work\n\n[Hook 2 with various ad-libs]\nWorkin' everyday\nAll the damn week\nA job ain't nuthin' but work\nWorkin' everyday\nOn the subway\nA job ain't nothin' but work\nA job ain't nothin' but work\n\n[Bridge]\nNo more workin' overtime\nYou get yours and I'll get mine\nI won't stop at any cost\nI won't stop 'til I'm the boss\n\n[Hook 2 with various ad-libs]\nWorkin' everyday\nAll the damn week\nA job ain't nuthin' but work\nWorkin' everyday\nOn the subway\nA job ain't nothin' but work\nA job ain't nothin' but work\n\n[Verse 3]\nStraight outta the ghetto\nNot out of Beverly Hills or Flushing Meadows\nYet through, I made it this far and had to gamble, scramble, peddle\nAin't no shame in my game and I came through like a thoroughbred\nBut still there's more ahead\nI'm not the greedy, I'm the needy seekin' a financial status\nThat put my pockets to be the fattest\nI don't wanna be employed when times are hard\nI'm so against workin' I wouldn't even take a blowjob\nI'd rather do my own thing\nI gotta be the one in charge to make myself live large\nA J-O-B is not for me, I don't want no parts of it\nSo take this job and shove it\n\nWhen you work, sometimes you sweat\nAnd when you sweat you're gonna get wet", "image": "https://images.genius.com/5415d5144d9ffab019cb06946cf8e1da.600x591x1.jpg", "year": "1992-06-23", "title": "A Job Ain’t Nuthin’ But Work", "album": "Mo’ Money (Original Motion Picture Soundtrack) "}]}