{"artist": "IDK", "songs": [{"title": "Hello Pt. 3", "lyrics": "[Intro]\nYeah\nA nigga come for your spot\nTake that shit\nHe supposed to\nSouthside\n\n[Chorus]\nFirin' at niggas, firin' at niggas\nFirin' at niggas outside\nI feel like Malcolm X, I'm peepin' out the blinds\nDon't care if it's nine hundred niggas outside\nI'm comin' back firing at niggas, boom! Firin' at niggas\nI hear sirens, I'm firin', I'm firin' at niggas\nI'm like Malcolm X, I'm peepin' out the blinds\nDon't care if it's nine hundred niggas outside\nI'm comin' back\n\n[Verse 1]\nI'm slick, I flick my wrist, she see, I snatch yo bitch\nThat's it, put my hand up on her hip, I hit, I dip\nWho you with? You say him and him and him and him and him\nBut when drama come, who comin' with you?\nCricket chirp None of them\nI just make fun of them, how you gon' run with them, maybe doin' the running man\nThey stay in place, they place the bat on base, they love to play them games\nYou pace & pace, you don't know who is who, so glad I can't relate\nPretty good at seein' who is real and who is anime\nEspecially with a bitch, I'm never messy with a bitch, look\nMost of these hoes is just a quiz, so don't try and test me with a bitch, stress me with a bitch\nI am not the one, matter fact, I take it back, I'm number one\nHit the lotto with the rapper number one\nDJ Khaled with the racks, another one, look how far we come\nLast year I made 6 figures, most niggas say \"That ain't shit, nigga\"\nBut I still ain't got a hit, nigga, I got fans, HXLY be the clique nigga\nWhen I get bigger, that's the plan though, Plan B, that's not a plan, hoe\nSo you dickridin' niggas gettin' pregnant with the twins, you gon' have to have those\n\n[Verse 2]\nDo not try to play with me, you better watch what you say to me\nLately, my mind has been crazy, my mama ain't here so my heart got a vacancy\n\"Woooo!\" like the pastor be, my favorite fooood is the mac & cheese\nAnd bitch, I ain't talkin' bout mac & greens, I'm talking \"kla-kla-kla ping ping\nPing\" for the shots that missed you (who?), you better drop that pistol (shit)\nMight as well pop that pussy (why?), Korea gon' drop that missile (bang)\nI'll probably be in UK, though, I'm still alive, you halo\nAlhamdulillah to my akhs locked up that'll still come wet you with the Draco\nFuck that, get on all-fours when she bust that\nSay she on birth control, don't touch that\nI'ma just bust on her mouth like a nutcrack\nJordan Howard all up in a hoe like run-back\nBack it up and she gon' clap like a jump jack\nJack a nigga spot like she tryna make him cum, yap\nNow I'm at the top like a layer, when you sun tan\nFlow give a nigga pussy sun tan, run man\nKnow I'm the best, if you look back at history they be ignorin' the best\nAnd you show 'em the sweat, bitch I done been in the sauna for years, I ain't passin' out yet\nPass me the crown, I'ma stomp on that shit\nI don't do hand me downs, had the pot and I pissed\nGot some pots for my clique, so we all gon' be rich\nBut my plans is so big that it's so hard to quit\n\n[Chorus]\nFirin' at niggas, firin' at niggas\nFirin' at niggas outside\nI feel like Malcolm X, I'm peepin' out the blinds\nDon't care if it's nine hundred niggas outside\nI'm comin' back firin' at niggas, boom! Firin' at niggas\nI hear sirens, I'm firin', I'm firin' at niggas\nI'm like Malcolm X, I'm peepin' out the blinds\nDon't care if it's nine hundred niggas outside\nI'm comin' back\n\n[Outro]\nClick clack, pow pow, bow, man down\nClick clack, pow pow, who your man now?\nClick, click, click, click, click, pow pow..", "image": "https://images.genius.com/b2a3861dddfe5b537e851d70e4cfcccf.1000x1000x1.jpg", "album": null, "year": "2018-01-05"}]}