{"songs": [{"lyrics": "It's Brooklyn in the house\nYeah\n\n[Verse 1: Jay-Z]\nYeah, I'm out that Brooklyn, now I'm down in Tribeca\nRight next to De Niro, but I'll be hood forever\nI'm the new Sinatra, and since I made it here\nI can make it anywhere, yeah, they love me everywhere\nI used to cop in Harlem – hola, my Dominicanos\nRight there up on Broadway, brought me back to that McDonald's\nTook it to my stash spot, 560 State Street\nCatch me in the kitchen, like a Simmons whippin' pastry\nCruisin' down 8th street, off-white Lexus\nDrivin' so slow, but BK is from Texas\nMe? I'm out that Bed-Stuy, home of that boy Biggie\nNow I live on Billboard and I brought my boys with me\nSay what up to Ty Ty, still sippin' Mai Tais\nSittin' courtside, Knicks and Nets give me high fives\nNigga, I be spiked out, I could trip a referee\nTell by my attitude that I'm most definitely\n\n[Chorus: Alicia Keys & Jay-Z]\nIn New York yes\nConcrete jungle where dreams are made of Yeah\nThere's nothin' you can't do Sing with me tonight!\nNow you're in New York That's right!\nThese streets will make you feel brand-new new\nBig lights will inspire you You!\nLet's hear it for New York\nNew York, New York\n\n[Verse 2: Jay-Z]\nCatch me at the X with OG at a Yankee game\nShit, I made the Yankee hat more famous than a Yankee can\nYou should know I bleed Blue, but I ain't a Crip, though\nBut I got a gang of nation walkin' with my clique though\nWelcome to the meltin' pot, corners where we sellin' rocks\nAfrika Bambaataa shit, home of the hip-hop\nYellow cab, gypsy cab, dollar cab, holla back\nFor foreigners it ain't fair, they act like they forgot how to add\nEight million stories out there in the naked\nCity, it's a pity half of y'all won't make it\nMe? I gotta plug Special Ed \"I Got It Made\"\nIf Jeezy's payin' LeBron, (I'm payin' Dwyane Wade)\nThree dice Cee Lo, three card Monte\nLabor Day Parade – rest in peace, Bob Marley\nStatue of Liberty, long live the World Trade\nLong live the king, yo – I'm from the Empire State...\n\n[Chorus: Alicia Keys & Jay-Z]\nIn New York Sing now!\nConcrete jungle where dreams are made ofYeah!\nThere's nothin' you can't doYeah!\nNow you're in New York Feel so special tonight!\nThese streets will make you feel brand-new New!\nBig lights will inspire you You!\nLet's hear it for New York\nNew York, New York\n\n[Verse 3: Jay-Z]\nLights is blinding, girls need blinders\nSo they can step out of bounds quick, the side lines is\nLined with casualties who sip the life casually\nThen gradually become worse – don't bite the apple, Eve!\nCaught up in the in-crowd, now you're in-style\nAnd when winter gets cold, en vogue with your skin out\nThe city of sin is a pity on a whim\nGood girls gone bad, the city's filled with them\nMami took a bus trip , now she got her bust out\nEverybody ride her, just like a bus route\n\"Hail Mary\" to the city, you're a virgin\nAnd Jesus can't save you, life starts when the church ends\nCame here for school, graduated to the high life\nBall players, rap stars, addicted to the limelight\nMDMA got you feelin' like a champion\nThe city never sleeps, better slip you a Ambien\n\n[Chorus: Alicia Keys & Jay-Z]\nIn New York Yes!<.b>\nConcrete jungle where dreams are made ofYeah!\nThere's nothin' you can't do\nNow you're in New York That's right!\nThese streets will make you feel brand-new New!\nBig lights will inspire you  You!\nLet's hear it for  New York\nNew York  , New York  Hands up!\n\n[Bridge: Alicia Keys & JAY-Z ]\nOne hand in the air for the big city\nStreet lights, big dreams, all lookin' prettyYeah!\nNo place in the world that could compareYeah!\nPut your lighters in the air, everybody say, \"Yeah\", Yeah Say what!\n\n[Chorus: Alicia Keys]\nIn New York uh\nConcrete jungle where dreams are made of Sing!\nThere's nothin' you can't do\nNow you're in New York\nThese streets will make you feel brand-newnew!\nBig lights will inspire you you!\nLet's hear it for New York\nNew York , New York ", "title": "Empire State of Mind (Live)", "image": "https://images.genius.com/a8ffed7e5657f645bbc4eda1cff0515e.300x300x1.jpg", "year": null, "album": "Live In Brooklyn"}], "artist": "JAY-Z"}