{"songs": [{"year": "2014-09-30", "title": "My Mama Thinks I’m Crazy", "image": "https://images.genius.com/bdd653946582aa8175d2fe527924778f.500x500x1.jpg", "lyrics": "[Intro – Saigon]\nUh, how real is, this? (uh-huh)\nHow real is... this? (Saigon)\nDo it, do it\n\n[Hook – Curbside Hustle and (Saigon)]\nMy mama thinks I'm crazy (my mama think I'm crazy)\nMy mama thinks I'm craaaaazy (you do)\nMy mama thinks I'm crazy (my mama think I'm crazy)\nBut she don't know a thiiiiiiing\n\n[Verse 1 – Saigon]\nUh, uh, uh\nTruth or dare.  Who should care?  Lucifer's near, proof is there\nEither your gun is a souvenir, or you use it, yeah\nWhen you use it, you face the music.  Prison—you lose it there\nHow could you compare?  Niggas is 20 and they losin’ hair\nMama said \"Brian, I hate to say this shit, but I don't be lyin’\nThe way you livin’, I only picture you dyin’\"\nAnd though I'm defiant, I know the reason why she droppin’ the science\nKnow why that's what she implyin’—I know why she cryin’\n\n[Hook – Curbside Hustle and (Saigon)]\nMy mama thinks I'm crazy (damn, my mama think I'm crazy)\nMy mama thinks I'm craaaaazy\n\n[Verse 2 – Saigon]\nTwo to the one.  I get a gun, you get a gun and do it for fun\nMama not believin’ there's reasons niggas'll shoot at her son\nShe know I sell smoke but don't know that I'm movin’ a ton\nHard to find a job, yeah, at least not a lucrative one\nOne of your dude's nigga’s gettin’ money that's much younger than you\nYou catch hustle fever, your temperature's like 102\n'Stead of goin’ to see the doc, you goin’ to see 'Pac\nPop was short for popular, gotta supply the B-rock\nShe wrote me when I was in C-block\n\n[Hook – Curbside Hustle and (Saigon)]\nMy mama thinks I'm crazy (my mama think I'm crazy)\nMy mama thinks I'm crazy (uhh, my mama think I'm crazy)\nMy mama thinks I'm craaaaazy\n\n[Verse 3 – Saigon]\nMy mama checkin’ in my bedroom but I ain't there\nI left a note that said, \"Life ain't fair\" (life ain't fair)\nI came back and seen a note that said, \"I ain't care\nYeah, motherfucker, life ain't fair.  I let you live here\"\nThe struggles of a single black woman raisin’ a man\nThat and poverty obviously go hand in hand\nDamn!  My mama think I'm crazy\nThe funny thing she been thinkin’ this since I was a baby\nWell if I'm crazy, then I'm prayin’ that father can save me\n‘Cause my mama?  My mama?  MY MAMA?\nMan, listen\n\n[Hook – Curbside Hustle and (Saigon)]\nMy mama thinks I'm crazy (my mama think I'm crazy)\nBut she don't know a thiiiiiiing\nMy damn mama thinks I'm crazy, uh, uh-huh\n(How real is, this?)\n\n[*ad libs*]\n\nMy mama thinks I'm craaaaaaazyyyy", "album": "G.S.N.T. 3: The Troubled Times of Brian Carenard"}], "artist": "Saigon"}