{"artist": "50 Cent", "songs": [{"album": "After Curtis", "image": "https://images.genius.com/1eb2de96e05dcd13adf5f43852179122.953x953x1.jpg", "title": "Click Clack Pow Officer Down Remix", "lyrics": "[Intro: 50 Cent]\nEeny meany miny moe...\nLet 'em go!\nMm mmm mmm with the law!\nHaha!\nPut it back, I got it... One more time, one more time!\nYEAH!\n\n[Hook: 50 Cent (Kardinal Offishall)]\nEeny meany miny moe!\n.38, .44, .50-cali shotgun\nI tear up yo Glock, son\nEeny meany miny moe!\nCatch a piggy by the toe\nClick-clack, POW! - Officer down! (We still scream: \"Fuck The Police! \")\n\nEeny meany miny moe!\nHe may holla let 'em go\nBut nigga if you let 'em go, you get hung by the law\nEeny meany miny moe!\nEeny meany miny moe\nNigga you confused (CH'EAH!) - let me choose!\n\n[Kardinal Offishall:]\nAYO! - One \"Licka Officer\" walked the earned stripes, (BOOO!)\nTwo Licka pigs gon' get shot another night. (BOOO!)\nHomicide would love for me to take a ride\nBut I ain't touch pork unless it's dead on the side\nWith a fork in it, police can suck my third leg! ('ey!)\nLock my niggas up beca' dem look like the dread. (oh, why?)\nIn the photo that was pointed out by one of your snitches\nThat worked at mr.Chows in the back doing dishes\nThat was upset with seein' all them niggas gettin' money\nComing inside the spot, treat the white folks funny\nFlashin' all that paper, 30 deep up in the spot\nThat's why IRS come through to bum that club. (eeee-eeeeeah!)\nWe ain't waitin' for the boss man to come with no pig\nCause the crew that you deal with spray, (50: YEAH!) they don't say it. Nigga!\n\n[Hook: 50 Cent (Kardinal Offishall)]\nEeny meany miny moe!\n.38, .44, .50-cali shotgun, (YEAH!)\nI tear up - yo' block, son. (hehe!)\nEeny meany miny moe!\nCatch a piggy by the toe\nClick-clack, POW! (YEEAH!) - Officer down! (BLAT!)\n\nEeny meany miny moe!\nHe may holla let 'em go\nBut nigga if you let 'em go, you get hung by the law. (EH!)\nEeny meany miny moe!\nEeny meany miny moe! (KARDINAL!)\nNigga you confused - let me choose! (EEEEAA!)\n\n[Kardinal Offishall:]\nHey yo, you took one of ours, now we even in the score\nWe ain't playin that civil rights thing no more!\nNo more homies holding hands, we are armin' up for action\nThe revolution is to the guys like Mike Jackson\nNo more shootin' niggas 41 times. (NOOOOO!)\nNo more blastin' us after you sniff lines! (NOOOOO!)\nNo more sellin' coke to me! Cause when I distribute to you\nI get my rights read, pig, FUCK YOU!\nWITH A BROOMSTICK! - Who this pig think he is?\nBastard only mean to get spit on by our kids. (CH'EAH, KIDS!)\nIn the area, cause none of us respect the games\nAnd we already know what provoked all the raids\nYou sold them guns, now they blastin' you sell the bullets\nThey shoppin' real heavy like a plane propellor. (blat! blat! blat! blat! blat! blat! blat! blat!)\nI ain't sayin' kill nobody B's in blue\nKeep it up and you get a park named after you!\n\n[Hook: 50 Cent (Kardinal Offishall)]\nEeny meany miny moe!\n.38, .44, (BLOW!) .50-cali shotgun\nI tear up - yo' block, son. {YEAH! }\nEeny meany miny moe!\nCatch a piggy by the toe\nClick-clack, POW! (BLAOOOWWW!) - Officer down! {haha! } (BLAT!)\n\nEeny meany miny moe!\nHe may holla let 'em go\nBut nigga if you let 'em go, you get hung by the law. (CH'EAH!)\nEeny meany miny moe!\nEeny meany miny moe!\nNigga you confused - let me choose!", "year": null}]}