{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/1820d89200ceee4f0b20325385670042.804x804x1.jpg", "year": "2019-03-29", "album": "Trunk Muzik 3", "lyrics": "[Chorus]\nMama always said I was a space cadet\nThat I would lose my head if it wasn't attached\nThank God I was touched with the vision of rap\n'Cause I still ain't got the patience yet\nTo deal with the truth because the truth is sickening\nSo I just leave the pigs in the pigpen\nI'm sure the devil's got him a big grin\nWatching my head spin with moral afflictions\nAddiction\nAddiction\nAddiction\nAddiction\n\n[Verse 1]\nUh, yeah, fresh as fuck in Atlanta\nClique look like a pack of zebras with the Dixie banners\nMossy Oak from ankle to throat, mind your manners\nPocket full of lures but I ain't catching fish, I'm catching bitches from the sewer, yeah, I played in it\nSkipping, jumping rope, and jumping fences\nAnd jumping off of bridges\nJump out the whip and then knock your door off your fucking hinges\nPlayground full of syringes (Yeah)\nGreyhound bus, twenty-two pound, send it (Yeah)\nGreyhound route, two hundred miles, end it\nChattanooga to Nashville\nI watched more cash build through kids hands than a Disney flick\nHe was fifteen with half a mil'\nAny y'all can't, the panties drop, dope game, fuck\nCouple of suicides 'cause they couldn't pay the plug\nWhen little Jay died, I remember the day it was\nLike a shock that it became just the way it was\nThat's a sad reality dealing with casualties\nLike it's an average thing, as it life was meant to be battled\nWe rattled the snake, took off the brakes of an 18-wheeler\nAnd D.U.I. through it casually, survived it, how did we?\n\n[Chorus]\nMama always said I was a space cadet\nThat I would lose my head if it wasn't attached\nThank God I was touched with the vision of rap\n'Cause I still ain't got the patience yet\nTo deal with the truth because the truth is sickening\nSo I just leave the pigs in the pigpen\nI'm sure the devil's got him a big grin\nWatching my head spin with moral afflictions\nAddiction\nAddiction\nAddiction\nAddiction\n\n[Verse 2]\nNirvana, had 'em dancing with Mr. Brownstone\nGuns followed by roses laid on the gravestone\nC'est la vie, baby is now gone\nBaby ain't hurting but the streets is covered in tears\nLeaving these mothers here to grieve, ain't no subtle fear\nIt's obvious and aware, the robbery of a pair\nTwo brothers'll darken a fairy tale, uh\nAin't it something?\nThat boy wouldn't hurt a fly, he wouldn't paint a pumpkin\nNow he's a maniac, pack of serrated blades\nCarvin' his name into his skin in a perverted way\nWent from a chicken to a bird of prey\nWent from a spark in the kitchen to an uncontrollable flame\nThat fully auto was tame, now it's reloaded, cocked, and aimed\nHe picked up the poison when he picked up the loose change\nThat's what the karma is for dropping chains\nA penny for your thoughts\nHow many can you spend before you go insane?\nLife is a bitch, man\nTo drive you crazy 'til you take the wheel and switch lanes\nOr you could make your deal and take a pill for this pain\nBut the only thing you will conceal is shame, is shame\n\n[Chorus]\nMama always said I was a space cadet\nThat I would lose my head if it wasn't attached\nThank God I was touched with the vision of rap\n'Cause I still ain't got the patience yet\nTo deal with the truth because the truth is sickening\nSo I just leave the pigs in the pigpen\nI'm sure the devil's got him a big grin\nWatching my head spin with moral afflictions\nAddiction\nAddiction\nAddiction\nAddiction", "title": "Addiction"}]}