{"songs": [{"year": null, "image": "https://images.genius.com/54b0bf1a80bd897379e6468d08cf0291.818x818x1.jpg", "title": "The Dream Shatterer (Original)", "album": "Endangered Species", "lyrics": "[Production by Buckwild]\n\n[Verse 1]\nAiyyo I shatter dreams like Jordan, assault and batter your team\nYour squadron'll be barred from rap like Adam & Eve from the garden\nI'm carvin my initials on your forehead\nSo every night before bed you see the \"BP\" shine off the board head\nReverse that, I curse at the first wack nigga with the worst rap\nCause he ain't worth jack\nHit him with a thousand pounds of pressure per slap\nMake his whole body jerk back, watch the earth crack\nHand him his purse back\nI'm the first Latin rapper to baffle your skull\nMaster the flow, niggas be swearin I'm blacker than coal\nLike Nat King, I be rappin and tounge's packin\nThe ones, magnums, cannons and gatling guns\nIt's Big Pun! The one and only son of Tony... Montana\nYou ain't promised manana in the rotten manzana\nC'mon pana we be mob rhymers\nFeel the marijuana, snake bite, anaconda\nA man of honour wouldn't wanna try to match my persona\nSometimes rhymin I blow my own mind like Nirvana\nComma, and go the whole nine like Madonna\nGo try to find another rhymer with my kinda grammar\n\n[Hook]\nWhen you awaken, your manhood'll be taken\nFakin like you Satan when I'm the rhymin abomination\n\n[Repeat Hook]\n\n[Verse 2]\nI'm pure adrenaline, uncut, straight to the gut, medicine\nRaw cure for pain I coat your brain like polyurethane\nSimple and plain, I'll explain it in layman terms\nIf you came to learn how to make fire, I'mma make it burn!\nHigher and hotter than lava this scholar advisor is smart as MacGyver\nTo put honor inside the heart of a liar\nInvolved in a life of crime (crime!) fuck it I like the shine (shine!) Up in the white and lime (lime!) Comes with the pipe design\nPlushed out! (No doubt!) Both pockets about to bust out\nIf you not in it for the spinach, GET THE FUCK OUT!\nTake a hike, we can even battle to make it right\nGo 'head lace the mic, you finished? Say good night\nHead to head in the street, I'll leave you dead in your feet\nSettlin beef, I'll even let you rhyme to the Benjamin beat\nBut it won't matter, you dreams still gon' shatter\nIt's a long ladder to climb, and mine is known to stagger\nSo get outta town, 'fore I hit you with the loudest sound\nYou ever heard; desert bird player you outta bounds\n\n[Hook] - 3X\n\n[Verse 3]\nYou know the Pun'll diss you if your whole steez is unofficial\nI'll come and get you and let the desert eez tounge kiss you\nWith one pistol and two clips, I'll make your crew do flips\nLike acrobatics, I'm charismatic, my gat is magic\nIt makes rappers disappear, whipser in your ear\nCrystal clear, come here, let me kiss your tears\nEverything you fear is here, you ain't got to search further\nThe first murder's the worst, now I thirst further\nFor reverse birth, every verse hurts, every curse word's\nAlready more offending than Eddie Murph's worst\nI thirst for blood like a vampire\nAny man claimin his game's tighter - IS A GOD DAMN LIAR!\nI set him on fire, retire your train of thought\nDrain a quart of blood out your brain and leave you insane in the dark\nThe king of New York! Lays his crown in the Boogie Down\nAnd sprays the town, with a Mac hoodied down\nI'm no joke! I soak your face with a sweeper\nDie in disgrace, or face your death through the speaker\n\n[Hook] - 4X, fades out"}], "artist": "Big Pun"}