{"artist": "Young Thug", "songs": [{"year": "2019-01-27", "lyrics": "[Intro]\nAye, aye (yeah)\nThugger, real talk, real spit\nI'm tired of this shit, you know what I'm sayin'?\nI'm tired of these fuck niggas and these bitches, slatt\nYou know what I'm sayin'?\nRicky Racks\nHey! Aye\n\n[Verse 1]\nI done kept it real with the fake\nI done did my thing, fuck who hating\nI can't take my kids on a date (I can't take my kids)\nBaby mama hating who I date (she tripping)\nBaby mama hate who I can't hate (tripping)\nThey mad cause my pockets ain't on pancake (hah!)\nIf they had the ups, they'll off my toupee (woah)\nEven if I spent racks on their due dates (I swea)\nI can't understand these bitches (I can't understand)\nI can't understand these niggas (I can't understand these)\nI can't understand why they trippin'\nAnd they stacking all they money while I'm spending (blatt)\nI done spent a 100,000 tickets (a hunna spent)\nI had 'em sleeping good while I hit licks (I had 'em sleeping)\nThey looked they best while I looked stressed, aye (swea swea)\nThey looking healthy, I'm looking messy (gettin' all'um)\nI ain't never focused on my self 'bout none\nI done put my whole family on my back (woah)\nI ain't trusting none so the wall got my back (yeah)\nLeave a nigga tired, like a hog in a hatch (aye aye aye)\nGo to war 'bout that\nNigga mob 'bout that (mob 'bout that!)\nAin't no understanding\nAin't saying sorry bout that\n\n[Hook]\nWoah!\nCan't you tell (can't you tell)\nI'm living life (hey!)\nCan't you tell (can't you tell)\nEverything on me so bright (woah!)\nCan't you tell (can't you tell)\nI'm living the life (hey! hey!)\nCan't you tell (tell)\nMy future is so bright\nAye aye aye aye\nOh I know I know I know I...\nAye aye aye aye\nKnow I know I know I know I...\nAye aye aye aye\nNo I won't say sorry to them, no bae\nAye aye aye aye\nI'll never never say sorry to them bae\n\n[Verse 2]\nI done got the double-R and bossed up (Thugger Thugger)\n350 grand what is cost us (woah)\nKick shit, Jackie Chan with the raw cut (woah)\nNigga fuck around and get found [?] (brrrt)\nMy son hair good he got a soft cut (soft cut)\nThese niggas fake gansta call it soft nuts (woah)\nWe round like a ranger they can't law us (skrrrt)\nI stuff them with the wood and they saw us (yee hee)\nThe poles on the back with the triple Ds (triple D)\nShe fiend for the kid like I'm nicotine (get the kid)\nShe got some good knees and some big ol' teeth (big ol' teeth)\nShe got bald head pussy she in with me (cool with me)\nWhen bae 'round she act like the enemy (ugh)\nWhen bae 'round she act like she kin of me (do it)\nShe know she hotter than a cup of tea (hot hot)\nWhen we alone man all she love is me (woah)\nI sent my man back to Pakistan (sent my man)\nHe came back with like 10 thousand xans (thousand)\nHe must have took a dozen just to land (there you go)\nStart a rumor now she knows the plan (know)\nWe started building like we bought some land (land)\nWe on the beach and we got plenty sand (sand)\nShe said she ready for like 20 million (million)\nShe going broke no no never again (no)\n\n[Hook]\nWoah!\nCan't you tell (can't you tell)\nI'm living life (hey!)\nCan't you tell (can't you tell)\nEverything on me so bright (woah!)\nCan't you tell (can't you tell)\nI'm living the life (hey! hey!)\nCan't you tell (tell)\nMy future is so bright\nAye aye aye aye\nOh I know I know I know I...\nAye aye aye aye\nKnow I know I know I know I...\nAye aye aye aye\nNo I won't say sorry to them, no bae\nAye aye aye aye\nI'll never never say sorry to them bae", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png", "album": null, "title": "Can’t You Tell"}]}