{"artist": "Pink Guy", "songs": [{"album": null, "title": "Thomas The Frank Engine", "image": "https://images.genius.com/2e0ea0eff080494fcfbee80f9df5aed9.999x999x1.jpg", "lyrics": "[Verse 1, Ramen King: Pink Guy]\nI still masturbate while eating Top Ramen\nAt a faster rate in the bigger quantities it counts as rape\nWhen I'm slurping at this unbelievable pace\nI turn the temperature up all the way to sweat up out my face\nIf you give no effort, if you got no money, then I got a cheap method\nCrack it open, throw it in a pan, and let it cook, bitch\nNow, that's a real education, fuck books\nIf you wanna make it in college, acknowledge all the flavors that be dropping mad knowledge on these pussy ass canned goods\nWe got chicken and beef to boost the manhood, anybody want a piece of me, will have to get this Ramen first\nStart with the shrimp and then the fire\nIf you're fully blazed, then this shit'll get you higher (Heh)\n35 cents a pack 3 for a dollar, unbelievable pricing, that's the future of a blue collar worker\nAnd I'm talking about Ramen\nThis shit'll fill you up when you're feeling like an African\nCome back when you're in the state that I'm in\nAnd say \"hi\" to my homeboy\nTop Ramen\n[Verse 2: Filthy Frank]\nY'know when I was younger I used to want to be Thomas the Tank Engine\nBut that shit never happened\nWe all have dreams\nIt's Filthy Frank mother fucker\nIt's Filthy Frank bitch\nIt's Filthy Frank mother fucker\nIt's Filthy Frank bitch\n[Verse 3, Big Mama: Pink Guy]\nYo, big mama selling narcotta\nHow much do it cost, bitch?\nNone, zip, nada\nRun from policia?\nAin't no drama\nFresh new Adidas for the new-born stamina\nFlows so pretty I would turn around and fuck it\nAsian girl screams\nThat's the Bangkok Ruckus\nNot a crack pipe but I crack pipe vocally\nPipe kids down with\nThe black cane locally\nGot a thick layer of bullshit that covers me\nSpying on your girl from a tree\nLike Discovery-Channel\nBust through your\nGirls Vag-canal\nFuck her in the ass\nLess humps than a camel\nYo, riddle this fictitious\nLittle kiddo\nThat rinses dishes\nBlow kisses to bad girls\nThey flinch itches\nMad sketchy like Craigslist ain't shit, ya'll finish short\nLike a midget at the races\n[Verse 4, Jungle Boy: Pink Guy]\nLet me tell you about a thing or two\nIf you wanna finger dudes, ride a Subaru\nOr do some gay shit like Ron fucking Harry Potter with a broom\nAnything regarding dicks ain't my cup of tea cause I love the poon\n(No?)\nThey call me Mr. Fantastic\nAss kicked rapper nasty blasting sticky mass in ass and other fat things\n\"Smoking blunts was a daily routine.\"\nAnd that's a bad impression of biggie\n[Biggie Smalls]\nSince 13, a chubby nigga on the scene\n[Pink Guy]\nBut I don't mean any disrespect\n[Biggie Smalls]\nMotherfucker, come on motherfucker come on, come on motherfucker come on\n[Verse 5, Jungle Boy: Pink Guy]\nI'm so fucking slick that Slick Ricky would slit his wrist and insist\nThat I should be the slickest bitch since the genesis\n\"Since the genesis?\"\nYeah since the genesis\nCause I'm the bestestest at good grammar in these sentences\n[Filthy Frank]\nIt's just a prank bro, it's just a prank", "year": "2016-05-03"}]}