{"artist": "G-Dep", "songs": [{"title": "Let’s Get It (Remix) (Bonus Track)", "album": null, "year": null, "image": "https://images.genius.com/e809032be49dc1abed1b3b49bf50e014.620x400x1.jpg", "lyrics": "* differs from the remix on P. Diddy's \"Bad Boy For Life\" 12\"\n\n[Black Rob]\nThey said that I'm a Rottweiler\nAnd I'm from the Rottweiler house, the Rottweiler New York\n\n[Loon over Black Rob] (P. Diddy)\nWe just happy to be here (This is the remix)\nFuckin cock suckers (Bad Boy baby), haha!\n\n[Kain]\nYo.. aiyyo, get smacked silly (right)\nKain m.i.a? Then check wet willies\nDep cracked the dutch cause Curry broke the philly (what?)\nNews at ten, Bad Boy, hope ya know not them dudes again\n(not them dudes again) Yeah we hold vendettas, big ten letters\n(what?) S6s with fourteen antennas (c'mon)\nOr in the Porsche with the buckets back, hah\n(Oh my God!) Bitches like, \"Who the fuck is that?\"\nCiaffi, freaked off, drunk off Saki (that's right)\nGot 'em +Eyeing The Tiger+ like +Rocky+ (c'mon)\nWhen I, step on the scene I'm expectin my cream\nStand by and I'm reppin for Queens (that's right)\nMy destination is, detonation (say what?)\nIf one verse-out, my mouth could dead a nation (that's right)\nYeah I said it, and Diddy gon' and did it (c'mon)\nPut these rappers on edit, now let's get it (let's get it)\n\n[Hook]\nMake this money, take this money (let's get it)\nAin't no way you can take this from me (let's get it)\nAin't shit funny (uhh) shake it honey (let's get it)\nTake it money, now let's get it (let's get it)\n\n[P. Diddy over Hook]\nThis, is, the, remix - Bad Boy baby..\nWe just happy to be back\n\n[Mark Curry]\nCurry the paperchaser, lace the track up with 16 bars of crack\nBring it back from the block, sub on (?) workin it wherever you at\nGet the money and the nigga, no takin nothin from me\nI'm hungry for it, I'm fadin niggas 'cross the border\nAnd if they want war, we can war (we can war)\nI'm chin-chose down to the floor (uhh)\nRound 'em and count 'em, take 'em all (uhh)\nYa lookin for the hook up, who ya call?\nThe M the A the R the K the C-U double R-Y\nShit crackin all night, gotta hear it all types\nI'm to the pavement, my nights and days wit (uh-huh)\nWhile you stare in amazement, I'm hotter than Cajun\nYou're blazin, throwin up my tre's in, who want 'em?\nJust like that, a 360 on 'em, get that\nTwist yo' ball caps and rep how ya livin\nIt's all about the cash, let's get it (let's go)\n\n[Hook]\n\n[P. Diddy over Hook]\nC'mon, Bad Boy's young guns\nThis, is, the, remix - Loon..\n\n[Loon]\nUhh, yeah, now check it out, yo, check it out\nI'm 'bout a dollar, son, I see through it, I gotta follow\n(c'mon) If ya ain't borrow money I gotta holla (holla)\nSimple and plain (plain), the reason why I entered the game\n(that's right) I seen Sean do it, so I'm tryin to get it the same\n(let's go) Pimpin ain't changed, niggas still gettin 'em thangs\nGot the six with Shaquille feet rippin 'em lanes\nGot a chick that's a real freak givin me brains\nThe temperature changed, soon as nigga get off the plane\nSo ya know a nigga gettin some change, stand over the game\nWhile do they shake they shoulders the same? (why?)\nWe get money, they ain't supposed to be playin\nSo what we supposed be sayin\nYou niggas actin like these crackers ain't payin\nSo let's get it (you got it), so let did it again (c'mon)\nIn 2002, son, I'm diggin the Benz (that's right)\nWith the rims that stop but continue to spin (yeah)\nMy shorty come with a crew son, I'm diggin the French\nSo let's get it\n\n[P. Diddy over Loon's last line]\nThis, is, the, remix\n\n[Hook]\n\n[P. Diddy over Hook]\nBad Boy baby, The Saga Continues, The Saga Continues\nThe Saga Continues\n\n[G. Dep]\nSoul Controller (yeah!), rap Ayatollah\nKids hate me when they older I put cracks by the stroller\n(c'mon) I'm registered voter, motherfuck a quota\nGive some bakin soda and a quarter (yeah)\nBet I flow straight up out the water\nI'mma wreck the game 'til it say \"Out of order\"\n(uh-huh) Put the high score up, then tear the floor up\nOn the world tour with your whore out in Europe\nHead on the tour bus (ehh)\nDo what them niggas in the drop thinks cooler\nCalled up five reporters to thank my supporters\nHittin wives and daughters\nBrought 'em neck spray from Estee Lauders\nCall Puffy to order\n\n[P. Diddy]\nAiyyo, call me Diddy, I run this city\nSend the cops, the D.A. and feds to come get me\nCats wanna leave me for dead you comin with me\nGettin head in the Bentley red at one fifty (aah!)\nStraight lose it, love two things my money my music\nMight co-write and produce it, drop mine, hot 9 exclusive\nGot y'all +Hulkin+ like +Bruce+ did (say what, say what?)\nCause I can, break backs and stacks, it's no problem\n(no problem) Make raps and tracks and go Harlem\nI get worldwide coverage\nI got so many spots I don't even buy luggage\nYa love it; make moves major, hide out in Asia\nIf your girl keep comin around them I'm a blaze her\nI'm the Bad Boy flavor, light blue gators\nNOT GUILTY!! {*echoe*} C'mon\n\n[Hook]\n\n[P. Diddy over Hook]\nThis, is, the, remix - Bad Boy baby\nThe Saga Continues, The Saga Continues\n\n[Black Rob]\nI be the east side Soprano, Rob Marciano\nFlow in each channel with the Iverson handle (c'mon)\nForty-five sparks (haha) turn your day gray flannel\nSnatch the yay of the mantle, then proceed to dismantle\nCan't slay Rob\nHow many niggas done tried to play mob, quit they day job\nTired of putting broke niggas under the wing\nIf I go to jail again I'm going under the bing\nAct like you gonna pull that thing thing\nYou the only one that always get stuck for bling bling\nI represent \"A\" block in Sing Sing\nAlmost caught a buck fifty for fuckin a Latin King's queen\n(oh papi!) Moves for paper, booze no chaser\nBullets out the blazer four-fifths with laser (take that)\nCome and get your shit splitted, newspapers say I did it\n(he ain't do it) Now let's get it (let's get it)\n\n[Hook]\n\n[P. Diddy over Hook]\nThis, is, the, remix - Bad Boy baby, yeah\n\n[Hook]\n\n[P. Diddy over Hook]\nThis, is, the, remix - Bad Boy baby\n2001, The Saga Continues\n\n[P. Diddy]\nThe Saga Continues, yeah {*ad libs to end*}"}]}