{"artist": "YFN Lucci", "songs": [{"image": "https://images.genius.com/c0d3f36d3796698913a9e876160eef7a.500x500x1.jpg", "year": "2019-06-21", "album": "650Luc: Gangsta Grillz", "lyrics": "[Intro]\nHah, Dinero, fool\nGangsta Grizzill\n\n[Verse 1: YFN Lucci]\nUh, I just took all your shit, told him catch me in traffic\nWhen you see me, you know that I'm blasting it\nThe hundreds, you know that I'm having it\nNo gunner with me, that's my savages\nI got like 300K in my mattresses, huh\nLike 800K in my attic, huh\nAyy, for that paper, I'm an addict, hey\nPlay with me and we gon' get at it\nI pull up in some shit look like a Brinks truck\nGot some shit that'll take down a Brinks truck\nHell nah, you can't go on this trip, bruh\nWe ain't got time for no slip-ups, yeah\nWe ain't shootin' out of vehicles, yeah\nWe tryna hit our victim, yeah\nKick 'em out the car, evict 'em, yeah\nThese kicks don't come out 'til December, huh\nUh, know that I'm drippin', I'm slip, bitch, I'm wet, huh (What else?)\nMy partners'll leave your ass wet, huh (What else?)\nI got her lil' pussy gettin' wet, yeah (And what else?)\nI spend like three hundred a set\nYeah, yeah, them karats on me, tell 'em, \"Roger that\"\nDon't play with me, Russian roulette (What else?)\nYou know that I know where you at (Yeah, uh)\n\n[Chorus: YFN Lucci]\nYeah, huh, boss, huh\nI'm different, they stealin' my sauce\nWhy the fuck would you think I fell off?\nWhen these bitches won't leave me alone\nHow the fuck you gon' catch me? I'm gone\nHow the fuck you gon' catch me? I'm gone\nGot a whole lot of racks in my home\nHavin' racks, man, I don't need a loan\nKnow I'm strapped if I'm ever alone\nPocket rocket on me when I roam\nGot them packages in, I'm on\nDrop the price and I took off on holmes\nYeah, boss\nI'm different, they stealin' my sauce\nWhy the fuck would you think I fell off?\nWhen these bitches won't leave me alone\nThese bitches won't leave me alone\n\n[Verse 2: Young Dolph]\nThese bitches won't leave me alone (Nah)\nIs it the camouflage cars or the way I be styling and puttin' this shit on? (Woo)\nY'all still savin' thots (Damn)\nI'm still screaming fuck the cops (Fuck 'em)\nI'm still screaming fuck the opps (Fuck 'em)\nI'm still in and out of drops (It's Dolph)\nFuck everybody and fuck everything, and I mean it (I mean that shit)\nBrothers crossed they own brothers out for some money, I seen it (Damn, man)\nI woke up with two bitches so bad, I thought I was dreaming (Woo)\nThese bitches won't leave me alone (Get out)\nPut 'em out, make 'em go home (Get out)\nFuck the Skydweller up, bust it down, put all blue rocks in it (Ayy)\nPulled up in a Rolls Royce with two umbrellas, four Glocks in it (Ayy)\nHad four traphouses, five stash houses with no pots in it (Haha)\nJust a young fly nigga screamin' Paper Route Business, Paper Route Business, ayy\n\n[Chorus: YFN Lucci]\nYeah, huh, boss, huh\nI'm different, they stealin' my sauce\nWhy the fuck would you think I fell off?\nWhen these bitches won't leave me alone\nHow the fuck you gon' catch me? I'm gone\nHow the fuck you gon' catch me? I'm gone\nGot a whole lot of racks in my home\nHavin' racks, man, I don't need a loan\nKnow I'm strapped if I'm ever alone\nPocket rocket on me when I roam\nGot them packages in, I'm on\nDrop the price and I took off on holmes\nYeah, boss\nI'm different, they stealin' my sauce\nWhy the fuck would you think I fell off?\nWhen these bitches won't leave me alone\nThese bitches won't leave me alone", "title": "I’m Gone"}]}