{"artist": "A$AP Rocky", "songs": [{"title": "FREE ROCKY FREESTYLE", "image": "https://images.genius.com/84260afdfa02f8cba4117c80ac6c847b.1000x1000x1.jpg", "album": "All $miles", "lyrics": "[Beat 1]\n\n[Intro: A$AP Rocky & Lil Yachty]\nYo bro I'ma come clean bro\nIf you gon' put me on the spot at least give a nigga a heads up\nNigga I ain't have a heads up myself, my God!\nYou gone put me under the bus while the bus still moving\n\n[Verse 1]\nYou gone put me under the bus while the bus still moving\nHow you gon' stop the beat when my raps still grooving?\nHow you gon' point the finger, fuck is you doing?\nHows you gon' choose and you ain't no chooser?\nHow you gon' be snoozin' and you sleepin', bruisin'?\nI'm just going in my Jeep, Jeep is cruisin'\nI just doze off to sleep, countin' the sheep\nGoing off to sleep and I be countin' my Zs\nAll I need to sleep is my beauty rest\nTell that chick that her coochie stretched\nAll this time I do be blessed\nAnd I deliver like I'm UPS\nHow y'all know about the boy\nHit 'em with the emergency, need the vitamin C\nAll these other girls want my vitamin D\nIn spite of my teeth, I'm smiling so clean\nLike how I gleam, she like how I seem\nTell her that, man she can have a nice dream\nA wet dream, a sex scene, we sexing\nAnd detexing, caressing\nHer best friend want the same thing but I just curved it\nFuck it, y'all niggas be smoking on that sherbert\nYou don't wanna admit I'm cleaner than detergent\nYes, straight like I left the permit\nAll my semen started swerming\nTo her eggs, between her legs\nShe in the daze, going crazy\nI'mma come clean I can't-\n\n[Interlude: Lil Yatchy + A$AP Rocky]\nI can't, I can't, don't look at me, I swear to God I can't do it\nYes you can\nNot like that\nYou just had a scare, so you just gotta relax a lil' bit\nNah bruh, I could never\nHe had a scare you a lil' tramatized still\nBruh, you rap without stopping\nYou know why? When you fuck up you keep going\nI can never do that\nIf you like, bro if you fall you gon' get right back up we got you\nOh I like that\n\n[Beat 2]\n\n[Hook: A$AP Rocky]\nIt's time for me to go\nIt's time for me I know\nIt's time for me to\nIt's time for me to go\n\n[Verse 1: A$AP Rocky]\nHe said this a smash, I said this a pass\nFull on cash, real fast\nI ain't sitting on tabs, I ain't spending a tab\nBetter get in a cab\nTake an LSD, I'm sipping a tab", "year": "2019-07-06"}]}