{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/86239d3de00e4660583da44a02ffa821.820x546x1.jpg", "title": "That’s Life II", "year": null, "album": null, "lyrics": "[Verse 1]\nMs. Oprah, Mr. Cosby, I am right back at your ass\nWith all honor, Mr. Obama, please don't walk out so fast\nI got a question, got a question, got a question for you all\nWhy when Oscar Grant got murdered, we didn't hear a peep from y'all?\nWe appreciate the way you delegate for Henry Gates\nBut what about your people slaving in these fields everyday?\nWe know that House got air conditioning and the sweetest lemonade\nBut don't forget your color, brother, we still muthafucking slaves\nAnd that even go for Puffy who so muthafucking paid\nThat he's richer than these White folks or at least that's what he say\nThat's what he say, that's what he say, and them petty niggas love it\nThink about it, what's a rapper standing next to Warren Buffett?\nHa ha ha, now you niggas are properly enlightened\nYou can disregard that sell-out shit that Jason Whitlock writing\nYou can disregard that racist shit that Glenn Beck is reciting\nI'm the leader of the gang, tell them to get a mike\n\n[Hook]\nI was born and I was raised in the U.S.A\nAnd I done been around the world and back, what a day\nSo I done seen a lot of shit and I just want to say\nThat Lucifer is here to stay, so bitch, you better pray\nI was born and I was raised in the U.S.A\nAnd I done been around the world and back, what a day\nSo I done seen a lot of shit and I just want to say\nThat Lucifer is here to stay, so bitch\n\n[Verse 2]\nWhat I'm touching on next, you might want to leave the kitchen\nCuz I'm touching on that touchy subject that they call religion\nKind of touchy like that religion that's touching on your children\nBut nobody want to talk about that, touching and feeling\nOn topics that they touching or talking about Jesus said\nThey liars like they father and sixes is in their head\nBishop Long, what is up with that monkey shit on your head?\nLast I checked, vanity was a sin, the Lord said\nOn my life, I believe you put boys off in your bed\nThough some New Birthers and Catholics ain't going to like what I just said\nBut before you fix your mouth and try to come with a retort\nPlease be advised that Jesus never took a plea in court\nAnd he never had a plane, and he never had a car\nAnd he never had a church that was visited by stars\nBut he did have love for the poor and the theives\nAnd he was in the street, kind of similar to me, nigga\n\n[Hook]\n\n[Verse 3]\nMr. Beck, Mr. O'Reilly, Mr. Limbaugh, Mr. Hannity\nHow could you sell white America your insanity?\nYou tell them that they're different and manipulate their vanity\nWhen truthfully, financially their life is a calamity\nOtherwise they wouldn't be listening to Dave Ramsey\nSo they're about as broke as the people that they don't want to be\nConvincing them that rich Republicans is what they going to be\nSo they act like Ronald Regan and like him they're awful actors\nWho look up to the rich like dumb kids look up to rappers\nAnd that's about as dumb as a (donkey) pulling a tractor\nYes, that's a Democrat diss, I'm a detractor\nSo whether you vote right or vote left it's not a factor\nWhen you ain't got no care for your health, Hey, this America\nThey going to put your ass in debt something terrible\nSo you can disrespect presidents and call them socialists\nBut Palin and Pelosi both going to have you broke as shit\n\n[Hook]"}]}