{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Lord Have Mercy", "album": "Vengeance is Mine", "lyrics": "If I gotta burn in fire\nFeel the flames\nFor my loved ones to excel in this game\nThen let it burn\nLet it burn\n\nAs I lay me down to sleep\nI pray to the Lord that my soul he keeps\nNobody weeps when a G dies\nBut like Maya Angelou still we rise\nMama tried to keep me home at night\nBut despite her attempts\nI hung with the macks and the pimps\nSidin' with the Rip's\nNot cuz I like blue if you like red\nI did it cuz I never did like you\nAnd it said the good die young\nI don't recognize myself what have I become?\nCan you tell me why am I headed for a dead end?\nWhy I got another dead friend?\nWhy they surround me- dead men?\nEverywhere I look right and left\nFlip another page in the book of life and death\nIt's comin'- I feel it breathin' down my back\nIt got me runnin' Grim Reap ain't cuttin' no slack\nWhat can I do where can I go\nLord forgive me for all I did cuz I didn't know\nAnd when my heart beats it's last tick\nSomebody sat these three words in my casket:\nLord have mercy\n\n[Hook]\nLord forgive me for all the wrong that I did\nAll of the pain that I inflicted as a kid\nOn Judgement Day consider this before you curse me\nI was only a child so Lord have mercy\nForgive me for all the wrong that I've done\nAll of the pain I inflicted when I was young\nOn Judgement Day consider this before you curse me\nI was only a child so Lord have mercy\n\nShould I die before I wake\nDon't shed a tear Mama cuz I finally escaped\nNo more drama no more blood sweat and tears\nNo more pressure from my peers\nAnd no more fears\nI rest in peace- how long will it last\nFore I have to answer for what I did in the past\nIllin' - willin' and dealin' cops always after me\nI call it survival and you call it misanthropy\nBut let the record reflect circumstances were suspect\nBut you couldn't care less- mann\nWhile I struggle to survive\nYou turned your eyes- plugged your up ears\nIgnored my cries\nNow Ms. America sayin' we scarin' her\nBut she can give me Liberty or Death- I'm darin' her\nEither one'll set me free- that's all I wanna be\nBut that ain't what y'all wanna see\nYou'd rather see me killin' up my own in the ghetto\nOr sellin' blow to anybody Black, Brown, or Yellow\nBut forget that- I'm tryin' to get my head right\nEven if it mean I gotta get dead tonight\nLord have mercy forgive me\n\n[Hook]\n\nForgive me for the blood that his body bled\nAnd all the tears that his Mommy shed\nBook says 'Thou Shalt Not Kill'\nBut I done seen more blood spilled\nThan the vets on Hamburger Hill- it's real\nPost War Syndrome- went to see my homie\nBut his Mama told me that the homie been gone\nEverytime I turn around it be another body on the ground\nWith fresh gunshot wounds but he didn't hear a sound\nWhen he came out the room\nNobody told him he would be dead so soon\nBut the gauge went boom Ms. America\nI know you got a cure for AIDS\nBut we need a cure for Raid who on a rampage\nCan you feel it- the tensions in the air thick\nHate got me so high I'm gettin' airsick\nGot my people broke lookin for a buck to borrow\nDoin it one day at a time fuck your sorrow\nFuck tommorrow I want revenge\nI got a Beretta named Vendetta\nTime to answer for your sin- man\nWhen you meet your creator- tell him I apologize\nBut I gotta ride Lord have mercy forgive me...\n\n[Hook]"}], "artist": "X-Raided"}