{"songs": [{"year": "2018-12-14", "title": "Where It’s At", "image": "https://images.genius.com/fe6cb57123317424dbaf3378a3d2ab8d.300x300x1.png", "lyrics": "[Intro]\nAyy, ayy, where it's at, where it's at, ayy\nWhere it's at, where it's at, ayy, yeah\n\n[Chorus]\nRise or shine, I come around, ayy, yeah\nPeace of mind I finally found, ayy, yeah\nWhere it's at, ho where it's at?\nWhere it's at, ho where it's at? Ayy\nI said, rise or shine, I come around, ayy, yeah\nPeace of mind I finally found, ayy, yeah\nWhere it's at, ho where it's at? Ayy, yeah\nWhere it's at, ho where it's at? Ayy, uh\n\n[Verse 1]\nLook, 40 acre my reparation, yeah\nTax in action, that's for my places, yeah, ayy\nI'm like, where it's at, ho where it's at, ayy, yeah\nWhere it's at, ho where it's at, ayy, look\nWhen the speedin' facts ain't catch no flack, ayy\nGuess they guarantee your money back, sss\nFuck that, I'ma need all my money back, ayy, yeah\nWhere it's at, ho where it's at? Ayy\nAyy, fuck your deposit, I don't want half, ayy\nWhen you got it all, you can call me back, ayy, ayy\nWhere it's at, ho where it's at? Ayy, yeah\nWhere it's at, ho where it's at? Ayy, yeah\n\n[Chorus]\nRise or shine, I come around, ayy, yeah\nPeace of mind I finally found, ayy, yeah\nWhere it's at, ho where it's at? Yeah\nWhere it's at, ho where it's at? Ayy, yeah\nRise or shine, I come around, ayy\nPeace of mind I finally found, ayy, ayy\nWhere it's at, ho where it's at? Ayy. ayy\nWhere it's at, ho where it's at? Ayy, yah\n\n[Verse 2]\nTurnin' location on, yeah\nTurnin' location on, in this bitch cussin' 'cause it's not for radio\nPay me on the day you agree to pay me on\nGolden like the team that KD on\nThey gotta hand out like achy bones\nHeard that you burn those, and I don't mean cigs\nDon't rattle on me, you receive what you bakin', home\nLike tell her, it ain't shit you can tell us\nMy life gon' spoof just like Pusha-T, that mean No Malice\nBut we right back at it if they say New Balance or, Canada\nThis is the anthem, or janitor, now I'm a rapper\nI didn't love college, no I was no extra\nSo I just dropped out, in the projects like catapult\nOh boy, like that's that boy\nWhere is he, where is he, you better tell the boy\n'Cause when they tell the boy\nMy niggas'll take your legs, turn you to Brandon Roy\nNo I'm not the man that do it\nBut you best have it when you say you have it or\nIt's gon' be problems\nProblems I'm not sure that you can endure\n\n[Chorus]\nRise or shine, I come around, ayy, yeah\nPeace of mind I finally found, ayy, uh\nWhere it's at, ho where it's at?\nWhere it's at, ho where it's at? Ayy, uh\nRise or shine, I come around, ayy, yeah\nPeace of mind I finally found, ayy, uh\nWhere it's at, ho where it's at?\nWhere it's at, ho where it's at? Ayy, yah", "album": null}], "artist": "Saba"}