{"songs": [{"year": null, "title": "I Miss me 2", "image": "https://images.genius.com/7416674bcc7984052d2dc793a8310265.1000x1000x1.jpg", "lyrics": "This is horrible, If that is terrible\nThis is terrible, more than horrible\n\nI hope you take care of yourself\nI hope some day be happy\n\nI wish you the best, you deserve the best\nYou've been through horrible things\nYou've been through terrible things\n\nI lied to you and that's not right\nI am an egoist, I ask for forgiveness\nI feel bad about this, I'm a selfish shit\n\nYou did not believe me when I said I loved you\nHow could you be friends with an agoista like me?\nWell, that's not the question really, Damn it\nTell me, did you consider me your friend? never know\nSomeday I would like to be your friend again, I miss you\n\nI understand that you're feeling bad, it's not my fault\nBut I want to give you 100 percent of my help\n\nI know I ruined it but you could just forget our friendship\nYou were my best friend, you still are but for a friendship\nThe two sides must agree, and I only agree, only me ...\n\nYou told me you did not want to stop being my friend\nYou wanted everything to go to hell, effectively\n\nI felt uncomfortable if I did not talk to you, it's really\nI was a parasite in your life\nFor you it was just a passing friendship, but, and for me?\nFor me it was a friendship that marked me, I will remind you\n\nYou are one of the few people I will remember fondly\nOf the few people that I will always love\n\nI know I ruined it but you could just forget our friendship\nYou were my best friend, you still are but for a friendship\nThe two sides must agree, and I only agree, only me ...\n\nYou told me you did not want to stop being my friend\nYou wanted everything to go to hell, effectively\n\nI felt uncomfortable if I did not talk to you, it's really\nI was a parasite in your life\nFor you it was just a passing friendship, but, and for me?\nFor me it was a friendship that marked me, I will remind you\n\nYou are one of the few people I will remember fondly\nOf the few people that I will always love\n\nTo you\nTo Valentina", "album": "Lover"}], "artist": "SadBoyTaki"}