{"songs": [{"lyrics": "[Aesop Rock]\nSulking in bulk and a half, sulk in a laugh, crash test\nFigure the mixture's digging up his last breath\nGrief leaf thief briefly turned chieftain\nThe tap water is on the waters off the waters leaking\n\nSo this is blue?\nMy frame reportedly sparred in garden variety burners and lost to normalcy\nMy terms the memoir, obligation the bookmark\nCrystallize impurities to zero on the...\nAutocrat derby catapult sponges, my hunches hurling murder abundance\nLunches where the city sump is pungent, (Curdling!)\nTomorrow sits on what the sin/consquence merger brings\nTo bubble up along the edges of precious child fantasy broken, broken\nHi, my name is Hazardous Tobacconist (Hi), hung on the brink\nI purge a dirge and spit my lung in the sink\nAs for the product, well it's wrenched in a barren backward wasteland\nOf shimmering moral tension adventuring to blossom pleasant\nI've done it all, from pixie dust to cramming pins in voodoo dolls\nAnd ninety-nine dreams linked on the shooting gallery wall\nBut it's like, not a wave crash similar to last or next\nHeckle me not already doctored by regrets\nRain (rain)\nBelligerent fragments bond massive\nUsher in the pixels 'til the image burn classic\nBliss in a barrel and motivation in a basket\nImma cast it out to sea and wait for my karma to grasp it\nI left my crutch over the rainbow with my riches\nAnd I know the rat race of the bad taste once its grimace cringes\nSee, an iron butterfly will float if given good condition\nBut I'm still fishing the same worm from the same faulty position\n\n(Prosperity)\nSorta makes you think\n\nI'm a Tomahawk I walk alone and miss the bliss\nInside the accidental meeting of the pencil and the seedling\nAnd the central started beating\nBreathing at a rapid caliber\nI doubt if her allotted grace will last forever more\n-\nDusting off a dream to be an autopilot\nStill a silent understudy. Funny how the opposite will throttle\nAnd the different stroke and model to the prison\nIs an accurate portrayal of inadequate betrayal of a wish\n-\nGonna-wanna-coulda-shoulda-woulda didn't\nIsn't it amusing choosing\nYet a plan is hibernating\nWaiting till the mating dance of motivation took a fine position\nDishing only after every little kiddy has performed\n-\nI just wanna be a general he said\nI just wanna, I just wanna be a general he said\nI just wanna, I just wanna be a general he said\nI just wanna, I just wanna be a-\nI just wanna sleep, yo\n\nOh, Eidolon, Capitol Crush\nGallop my chariot burning and awful enigma\nSprung by the sling of David to pierce gutter bug batch prior to hatch\nDismiss it as a soul cadets' excuse to decorate maps with thumb tacks\nThis gold star product pushing hate boogie themes Enter the smoke screen\nBlazing saddle remnants alive analyze pensive\nConnect all picket fences like chain gangs linked digging trenches\nTo candy land image factory. Sold\n-\nOh, I wanna be an astronaut, I got the merits and heart\nAnd I bought a starship with hard earned money from one hour selling dreams to dummies\nWhen they raised the lights:\nJa-ja-Jesus Christ! I've never seen so many goblins in my life! (Oh, my lord)\n-\nMigrate through the fog and then some\nDragging bitch circuits on a short leash like organ grinder primates dancing for bread crumbs\nWell, did you touch that slugger?\nBanging on the table with an old tin cup, thin luck\n-\nI can raise the dead while the shocked settlers fled the blaze\nSprung out their bed of nails to spread the sails, racing for milk and bread\nBut I got (big) big plans. I ride a big boat with a big ol' motor\nAnd I ain't really that big on helping you turn your leaf over\n-\n(Let's sing)\nBring out your dead, I got a pile sky high\n(Let's sing)\nRun if you're miserable, saw the planet fly by\nMy name is \"Try to deny the magnificent doom craft my ragged soul built\nAnd I'mma show you why this fucking globe tilts\"\n\n(Repeat 3x)\nTake me where the air is clear\nI don't really know where but I know its not here and\nEvery little step she takes makes me spin\nCause I know I'll never have to ever sleep alone again", "title": "Prosperity", "album": "Float", "image": "https://i.genius.com/097177ea52f6ad0147914b68157107a588f47fb2?url=http%3A%2F%2Fwww.mushrecords.com%2Falbum_art_front%2FMH202_D.jpg", "year": "2000-09-05"}], "artist": "Aesop Rock"}