{"songs": [{"lyrics": "[Hook] [Phonte]\nIt goes work that body for all my niggas\n5 star generals and y'all beginners\nRock on my niggas, get it on my niggas\n\n[Verse One] [Phonte]\nMr. Get Busy\nMr. So Damn Nit Picky\nCircle you squares till I get dizzy\nAnd bum rush your whole spot\nMy raps slap box with robots like Sam Witwicky\nI Left It All Behind now I'm taking my shit with me\nGave you a chance to shine not it's time that we gritty\nAnd we can rhyme, go line for line, I got plenty of time\nYou can stay all day like Miss Milly\nYou rap niggas kill me\nIt's just to much for me\nFathered a style, then I gave up custody\nUntil reluctantly\nMy fam reminded, there's so many words that can't no nigga fuck with me\nSuch disgust\nSo many things I can dis-cuss\nAnd lames that I can distrust\nTouch, the radio sometimes to see what I might have missed\nAnd from the sound of things, I ain't miss much\nMy nigga P said, \"Take your time\nIt's like planets when they align\nHell you ain't even gotta rhyme.\"\nNot boasting but I can coast it\nEspecially when niggas still tripping off the stuff we did in '99\nBut Tigga ain't a coward\nAnd still my pride just can't allow it\nSo I'm gonna spit for the many dozens\nFans that kept a nigga hot when a nigga wasn't\nAnd straight kept a nigga fed when a nigga struggling\nSurvived shut downs, break ups and Benny budgets\nSurprised that I lived to tell any of it\nThis joint tip, but I'm anointing\nSo any shots this way about as pointless as titty fucking\nWhoa son, you're doing it ass backwards\nTay spit fire from here to Grand Rapids\nMichigan\nMe and 9th, two of God's instruments\nAnd when we get together, nigga call it band practice\n\n\"We have a band, that's all you need!\"\n\n[Hook] [Phonte]\nIt goes work that body for all my niggas\n5 star generals and y'all beginners\nRock on my niggas, get it on my niggas\nWork that body for all my niggas\n5 star generals and y'all beginners\nRock on my niggas, get it on my niggas", "title": "Band Practice", "image": "https://images.genius.com/8d727a22a4d1d05ff7dc9a2ed5ca0c53.1000x1000x1.jpg", "album": "The Wonder Years", "year": null}], "artist": "9th Wonder"}