{"songs": [{"lyrics": "[Intro]\nLittle punk ass fuck, that’s it nigga (laughing)\nThat’s ballin'?\nI guess men lie, women lie\nBut numbers don’t\nIt's over for that ballin’\nIt's my turn\nBrooklyn!\n\n[Chorus]\nWe fly high, no lie, you know this (Brooklyn!)\nForeign rides, outside, it's like showbiz (It's my turn)\nWe stay fly, no lie, you know this (Brooklyn!)\nHips and thighs, oh my, stay focused\n\n[Verse 1]\nBrooklyn get paper, tote big things\nWe chase niggas around they own ball game\nBall game nigga, it's over for you lames\nGimme back the chain, it's over for you dames\nFuck y'all broads\nDidn’t they ever tell you don’t fuck with a man’s family They'll fuck with y'all's?\nKidnap mine?\nNigga I will click-clack push your wig back further than Tyra Banks' hairline\nYour bank versus mine\nIf you're ballin’, nigga what I’m doing can’t be defined\nThe Joneses can’t keep up\nMaybe my nigga Nas, but I got stronger after Ether\n\n[Chorus]\nWe fly high, no lie, you know this (Brooklyn!)\nForeign rides, outside, it's like showbiz (It's my turn)\nWe stay fly, no lie, you know this (Brooklyn!)\nHips and thighs, oh my, stay focused\n\n[Verse 2]\nBed Stuy, Brownsville, CI\nThe Best in the game since Daddy Kane and B.I\nMy turn, we live, money to burn, nigga we on fire\nG-5'er, Ace of Spade\nMake it real easy to book your babe\nI’m running a Boston on these niggas\nI’m watching ya Soundscan you keep reniggin'\nI’m trump-tight, I'm Trump-like\nI’m on my way to a billi, I play my cards nice\nNiggas like \"Hov, ya sound too rich!\"\nI'm like \"Oh! Ain't that about a bitch?\"\nAin't that we here for? Therefore\nI sound like I'm supposed to sound, meet me at the Clearport\nI’m ballin’ for real, you pump faking it\nManhattan keep on faking it, Brooklyn keep on taking it! Yeah!\n\n[Chorus]\nWe fly high, no lie, you know this (Brooklyn!)\nForeign rides, outside, it's like showbiz (It's my turn)\nWe stay fly, no lie, you know this (Brooklyn!)\nHips and thighs, oh my, stay focused\n\n[Outro]\nYeahh! Shoutout to all my real niggas in Harlem\n145th & all that\nAll the Dominicans, OG Juan, Lower Eastside Tru-Life\nThis ain't about boroughs, this is about niggas and bitches\nIt's game time, hehe\nIt's my turn\nLet the games begin\nYOUNG!", "title": "Brooklyn High", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": "2006-11-16", "album": null}], "artist": "JAY-Z"}