{"artist": "Watsky", "songs": [{"year": "2018-11-15", "lyrics": "[Refrain]\nWe're summoning spirits\nTearing the labels\nClearer than vodka\nBottle it up\nDon't bottle it up\n\n[Chorus]\nHas anybody told you you're a mean ass drunk?\nHas anybody told you you're a mean ass drunk?\nHas anybody told you you're a mean ass drunk?\nOh no (Oh shit), oh no (Oh shit), oh no (No, no, no)\n\n[Verse 1]\nYou say it's your thing to be honest\nLike it's kind of this token of pride\nWell, to be honest, you're kind of a goddess\nBut being with you kind of kills me inside\nYou want me to explain it, well\nIt's sort of this look in your eye\nLike you're cooking an egg on the hood of your car 'cause you looked at it hard\nBut my heart is the egg and you're watching it fry\nI'm not gonna cry, I'm not gonna lie, I am gonna cry\nBut not right here\nGive me like a minute, let me get up in my feelings while I pop my beer\nShit is getting muddy, and I'm seeking out the buddy\nAt the bottom of the bottle but it's not quite clear\nWhat you expect from me\nWhen you're disrespecting me\n\n[Chorus]\nHas anybody told you you're a mean ass drunk?\nHas anybody told you you're a mean ass drunk?\nHas anybody told you you're a mean ass drunk?\nOh no (Oh shit), oh no (Oh shit), oh no (No, no, no)\n\n[Verse 2]\nWanna treat me like a dog on a leash\nWell, that's your prerogative, sheesh\nOr does she wanna see what we got\nWhen the saga repeats, nada, capeesh\nI'm not a complete wretch\nI fetch, I sit a bit, but I'm not gonna stay\nBut if you wanna see me, you can see my feets\nAnd my cute little cheeks when I'm walkin' away\nYou can see me sitting on the dock at the bay\nYou can see me lickin' on my crotch like a stray\nBut if you're gonna see me like a prop in a play\nGotta say, I'll be skippin' what you got for the day\nMaybe you'll be thinking that I'm hot in the head\nOr I'm sick of pickin' at my chicken pox in the bed\nYou can think what you like, I think I'll take a hike\n\n[Bridge]\nOh no (Oh no), oh shit (Oh shit)\nOh no (Oh no), oh shit (Oh shit)\nIt's just one small complaint, I know I am no saint\nOh no (Oh no), oh shit (Oh shit)\nOh no (Oh no), oh shit\nI think we're old enough to know what we ain't\n\n[Refrain]\nWe're summoning spirits\n(Drink it in, drink it in, spit it out, spit it out, spit it out, spit it out, spit that shit out)\nTearing the labels\n(Take it off, take 'em off, take 'em off, get it on, get it on, get this shit on)\nClearer than vodka\n(Get 'em up, sit 'em up, sit 'em up, sit 'em up, put 'em down, put 'em down, put 'em down, put that shit down)\n\n[Chorus]\nHas anybody told you you're a mean ass drunk? (Another one, let's have another)\nHas anybody told you you're a mean ass drunk? (Another one, c'mon, another one)\nHas anybody told you you're a mean ass drunk? (Another one, why not another one?)\n\n[Outro]\nAnother one\nHas anybody told you you're a mean ass drunk?", "image": "https://images.genius.com/e085e9de1b52279b0d7276ff85da8d10.500x500x1.jpg", "album": "Complaint", "title": "Mean Ass Drunk"}]}