{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/86239d3de00e4660583da44a02ffa821.820x546x1.jpg", "title": "Tougher colder killer", "year": null, "album": null, "lyrics": "[Verse: El-P]\nTo the mother of my enemy, I just killed your son\nHe died with his face to the sky and it can not be undone\n\n[Verse: El-P]\nTo the mother of my enemy, I just killed your son\nHe died with his face to the sky and it can not be undone\nHe didn't die hard, in the end he just grinned and bowed\nMade him dig his own grave at the point of a gun\nWhile he laughed to the gods out loud\nAnd it made me want to jump out a window\nAnd it made me want to scream\nTear my face off run through the streets\nPandemonium me, f*cked by decree\nCame a long way from young and alive when I was not blind\nNow I can not see\nGrace in reverse at best it gets worse and I wanted you to know\nSince then I don't sleep\nAnd the uniform, tags, side arm and ID that I wore\nWhen I did it got send C.O.D\nTo the HQ, note reading \"this is not me\nAnd I hate you for making me make a man bleed\"\nAnd before the man passed and his last gasp fled\n(And this is why I'm writing you now) his eyes gleamed\nAnd he pointed to the part of his chest that still beats\nLooked dead in my grill and then said this to me\n\n[Hook]\nThere is a tougher colder killer\nA tougher colder killer than\nA tougher colder killer than you\nAnd he will wipe us all from this place\nYou will learn to crawl\nYou will learn it all in just one day\nJust one day\nJust one day\nJust one day\nJust one day\nJust one day\nYou will learn it all in just one day\nJust one day\nJust one day\nJust one day\nJust one day\n\n[Interlude: Killer Mike]\nI'll slap a motherf*cker so hard his mama probably said baby you okay\nI just got a straight pain inside of my face, you understand me?\nYour dad should be ashamed of raising you suckers man, real sh*t man\nYour dad should've left home like millions of other dads did\nBy staying at home, man, he only made you a tougher, colder pussy\n\n[Verse: El-P]\nI'm the f*cking Catalina wine mixer\nBlitzer, wolf in a shearling wording sh*t twisted\nIt's a lovely day to go Blitzkrieg, isn't it?\nListen if suicide pacts are your bag try dissin' him\nThe blocked number, no star 69\nCall, breathe heavy at your little sis, rock system\nCome with the loud talk, limp back whispering\nThat motherf*cker's no victim\n\n[Verse: Killer Mike]\nThe return of the other\nInsane psycho sick savage raw rap rhyme motherf*cker\nWith a big black belly\nIf I get to shaking like jelly and the gun\nDon't jam, you're a dead motherf*cker!\nN*ggas say sweet like smuckers\nPeanut butter pack the motherf*ckers\nI'm ashamed for your mothers\nPause, calm\nHow I know your momma? Bad mother-f*cker?\nDouble entendre?\n\n[Verse: Despot]\nMotherf*ckers don't know sh*t\nNot the half of the math or the sum of the quotient\nGet your cameras and focus to capture the moment\nI slap you for poking your nose in\nGlobe gripped so tight that it's choking\nHe got the whole world in his hands, hold this!\nPose in a winning stance, don't get close\nWatch me with the telescope you watched the throne with\n\n[Verse: El-P]\nTrapped in another bad circuit, twirk it\nSplash in another man's snatch, get murdered\nPaths get burnt and cut right through sermons\nI laugh at the priest getting deep in the service\nLast guy to the big guy in the sky\nIs a rotten egg or potato au gratin\nHead get him down, take a piss in his coffin\nBetter off dead than let him keep talking\n\n[Verse: Killer Mike]\nYou better off walking than talking\nBullets get to sparking, leave you in chalk or a coffin\nLord have mercy on the family and they losses\nI paid for the roses to cover the coffin\nI move like Bulger, the boss up in Boston\nCaught him in a bottle house buying Mr. Boston\nHit him with a bullet from a .38 snub\nPut the plug in his skull, hit the switch lights, offed him\n\n[Verse: Despot]\nWhat's that on your shirt? Made you look\nGet jacked for your work, get juxed for the gold\n'Oldest trick in the book like grandma's hand on her cunt playboy centerfold\nHold his d*ck like it shook on the block while he look at the cops and they drive past slow\nKeep the heater on ice, let it go, he was told that revenge was best served cold\n\n[Hook]\n[There is a tougher colder killer than\nA tougher colder killer than\nA tougher colder killer than you\nAnd he will wipe us all from this place\nYou will learn to crawl\nYou will learn it all in just one day\nJust one day]\n\n[Killer Mike]\nYou ain't with this sh*t we with\nBars of death and destruction\nWhat do I hear from you? Nothin'. Silence\nYou ain't ready for this sh*t. You don't want this sh*t\nIt's a prizefight. It's a prizefight\nAnd one opponent ain't showin' up\nSucka\nSucka"}]}