{"artist": "Watsky", "songs": [{"year": "2016-08-19", "lyrics": "[Intro]\nVeneficia!\nVeneficia!\nSeven trumpets!\nVeneficia!\n\n[Verse 1]\nEasy, with a ballot, we can put a reality TV personality in DC\nSpeak free if you can see how this delicate fucking matter developed but, man, it beats me! (Oh my Gooood!)\nTwo fleets keep peace on the mean streets\nOne treats brown people like they’re beastly\nNothing like the force that police me (That’s so oooodd!)\nWhat’s the fate of the species?\nGet a metal plate and then mate with the PCs\nOr retreat back to a monkey chucking feces?\n(What’s the deeeeal?) Wanna ease this pain\nDifferent than the BC years\nNow we BCC Jesus on the email chain\nWay too many threats to flee\nWay too many heads to feed\nNot too many beds to sleep\nChief said that it was best you leave\n\"F you, please\" to the refugees\nAnd it’s seeming like it’s every other day that I been tugging at my collar, thinking, “Damn, it’s toasty!”\nWhere did all the people at the supermarket go\nThat used to scan my groceries? Vanished mostly\nAnd wassup with all the homies with the camo and the ammo in the rifles on their shoulder\nWalking through the city, thinking that they’re Annie Oakley?\nThat’s quite enough\nBut this shit is fucking unbelievable\nI swear you couldn’t write this stuff\n\n[Chorus]\nEverywhere that I stare (Veneficia!)\nYou couldn’t write this shit, no\nEvery minute, deeper in it (Veneficia!)\nAnother fantasy is brought to life\nEverywhere that I stare (Science Fiction!)\nYou couldn’t write this shit, no\nEvery minute, deeper in it (Veneficia!)\nAnd now I never get surprised\n\n[Verse 2]\nYoung George Jetson stepping up in this motherfucker\nGripping a butcher knife, hoping I can cut the chord\nWhere the horde is plugged to the motherboard\nThat is not a legitimate hoverboard (Shit’s got wheels!)\nI Iook at the sky, saying “My God, run!”\nLife’s heavier than an iPod one\nMy Twitter ain’t gonna matter when the tripods come\n(Let’s get real!) From the hieroglyphs to the crowded malls\nNever mind the if, but the how it falls\nI’m vibing out watching Ow! My Balls (Oh yeaaaah)\nCore defects tend to wreck my sleep\nThe quest to be more perfect than Ford Prefect\nWhile I’m dreaming of Electric Sheep\n‘Cause Soylent Green is people, resistance is just futile\nPop a red pill and a blue pill and I dilate my pupils\nMoving light speed, we all got vile needs\nLiving is a violent deed\nSpread my soul like Wild Seed\nWhy would it be any wonder I act weird?\nI’m trying to find out who the fuck I am\nWhile looking in a cracked Black Mirror\nYou got a finish what you thought about?\nHow this is gotta bottom out?\nYou wanna flee the reaper, but they’re bombing the city\nAnd the single haven to creep in is the slaughterhouse\n\n[Chorus]\nEverywhere that I stare (Veneficia!)\nYou couldn’t write this shit, no\nEvery minute, deeper in it (Veneficia!)\nAnother fantasy is brought to life\nEverywhere that I stare (Seven trumpets!)\nYou couldn’t write this shit, no\nEvery minute, deeper in it (Veneficia!)\nAnd now I never get surprised\nEverywhere that I stare (Veneficia!)\nYou couldn’t write this shit, no\nEvery minute, deeper in it (Veneficia!)\nAnother fantasy is brought to life\nEverywhere that I stare (Veneficia!)\nYou couldn’t write this shit, no\nEvery minute, deeper in it (Veneficia!)\nAnd now I never get surprised", "image": "https://images.genius.com/caf3c17709b04ff24300da4d62da46fa.630x630x1.jpg", "album": "x INFINITY", "title": "Brave New World"}]}