{"songs": [{"image": "https://images.genius.com/defd8397a2b22608048f1651510491b1.612x612x1.png", "year": null, "lyrics": "[Hook] No Jam will take me alive x4\n\nVerse 1 (Alex Wiley):\nDamn where the fuck was I?\nYou know I keep two b's rolled\nSour D's and Blue Cheese Smoke\nKeep these hoes on they knees though\nLike Tim Tebow after he scores\nAsk me if I give a fuck, I be like who the fuck are you?\nMy Master P CD be exactly what imma fuck her to\nBumpin bout it bout it you know I pull out when I'm bout to nut\nBetter get the fuck around me you know I get loud when Im about to nut, uh\nSwaggin as if we couldn't fail\nI don't give a fuck about much nigga, as if you couldn't tell\nI can't and I won't but you niggas be giving a big fuck\nDrinking apple juice out my pimp cup\nGetting my dick sucked\nSmoke till I get stuck\nWish you niggas good luck!\nCause you ain't got no chance against your mans\nI break dance, hit me, Fuck around and break your hands against your mans\nNever stress over that little shit, bitch always take it in stride\nI lied\nWhen it comes to jams, no jam will take me alive\n\n[Hook]\n\nVerse 2 (Futuristic)\n\nComing around like a beat off that\nI'm in the bottom of grass like snakes\nI'm in the sky like Drake's face on the CD case\nAnnihilate, annihilate, ain't got to time to compensate\nWish you be on that\nIt go this n***a then me\nBig mouth gator, that means I'm greater\nIf you got weed then put it in raw papers\nI've been gold like the candy now and later\nCall up your neighbor and borrow some sugar\nWho's your favorite rapper, I could pick like a booger\nRappers are signin' these deals, getting fucked\nBy these labels who pay you  that make you a hooker\nAnd it's crazy, I'm way better\nGive me 46 opponents, I'm feelin' like Mayweather\nRappers say they cold, they feelin' like May weather\nMe, I'm actually cold, I chill in eight sweaters\nFocused on my endeavors, my flow has been kind of clever\nNo gimmicks, I got no image, no hat in no leather\nIntroduce you to Futuristic, hi, it's been a pleasure\nIntroduce you to Futuristic twice so don't forget him\n\n[Hook]", "title": "No Jam", "album": null}], "artist": "Alex Wiley"}