{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg", "title": "CudderIsBack", "year": "2010-01-26", "album": null, "lyrics": "[Intro: Kid Cudi]\nYeah, wassup\nMmmhm nigga, yeah it's me (laugh)\nYeah, I’m back baby\nCudder, hey\n\n[Sample: Vampire Weekend]\nOttoman couch, how handsome your furniture\nLovelier now, but dressed for funeral\nBegging you to sit for a portrait on the wall\nTo hang in the dark of some parliamentary hall\n\n[Verse: Kid Cudi]\nStay home a lot, no TV\nJust thoughts, and a heap of good weed\nSame jeans, same old Converse\nBape tees and the Walees, so works\nI'm cool, some niggas mad at it\nLookin' in from the outside, fantastic\nCan't keep the negative alive\nThey be on my dick, if Kid Cudi die\nDon't cry hater, I forgive\nNow go and get my album and get off my dick\nI smile and I’m pleasant, the weed is the essence\nBut if I’m in the club, we gon’ tear this shit up\nI’m talkin' 'bout shots, ridiculous amounts\nCause if you’re gonna rage, should be all about\nTake, take another shot or you’re soft\nDream On campaign I’m the mother lovin' boss\nHaters suck my balls, two time\nI never say goodbye 'cause I’m on mine\nAll my life, wanna do some' major\nNow every little thing I do might make it in the paper\nCudi found y’all nigga, po-po (whatever)\nMad drunk in the street, no photo (I rage)\nHatin' motherfuckas, don't know yo\nI guess this was the life I chose\nWanna get up in my mind\nWanna know about me and Amanda Bynes (Amanda please)\nWanna know really, really, really who I’m datin'\nIs she civilian or super duper famous? (hmmm)\nIs she African American, Caucasian, or Asian? (so many)\nOr maybe Spanish\nIt don’t matter my nigga, I love them all\nAs long as she don’t need stupid amounts of makeup\nTo makeup the self esteem\nSelfish dreams can reflect the blessing\nI am tap dancing on a cloud\nSuccessful raps, I might scream out loud\nPuttin' it down, for all I met\nTalking fans, I won't quit\nI’m puttin' it down, for all I met\nTalking fans, I won't quit\n\n[Outro: Kid Cudi]\nHey hey hey, whoa whoa whoooa (come on, come on)\nHey, whoa whoa whoooa (come on, come on)\nHey, whoa whoa whoooa\nHey, whoa whoa whoooa\nNa na na na na na\nGoodbye"}]}