{"songs": [{"year": "2009-05-26", "album": "Gudda Muzik", "image": "https://images.genius.com/f384e4a2d846f755af26a400f6e2436d.500x500x1.jpg", "title": "Bang Bang", "lyrics": "[Intro: Jay Rock]\nDJ Heat, what up?\n\n[Verse 1: Kendrick Lamar]\nHello, hit every lying clip with a Eggo\nI pop more than I pop for when the cop blow\nYou Fruity Pebble, homosexual wearing velcro\nWho gassed you up? Man, I raised the price of the petro\nKilling Cali, gang bangers and GTA's\nWeed and water, come and swim on a tidal wave\nI'm fucked up, psychologically braindead\nI once walked into a Blood group, wearing all red\nWonder why nobody's banging on me\nGetting mad as fuck, then the police came\nMistaking me for a real thug, this is not a game\nI'm from Compton too, shoutout to Game, give me a pair of shoes\nFinna skydive off the peak of my career\nThough it's not here yet, you motherfuckers still know who's best\nFrom the murder cap, you never heard of that, okay\nWhat about now? Clip-clip, pow, man down\n\n[Chorus: Kendrick Lamar]\nIt's like this and like that and like this and a\nIt's like that and like this and like that and a\nKiller Cali niggas don't know how to act and I\nNever know so ride around strapped and I\nGive it up, give it up, give it up, give it up, bang\nBang, bang, bang, bang, bang, bang\nCompton, bang, bang, Inglewood, bang, bang\nWashed up, bang, bang, you know what's good, bang, bang\n\n[Verse 2: Kendrick Lamar]\nWho said Long Beach don't keep it hood?\nFive minutes away, say you can die today if you dumbing out\nWell let's just say, if you run your trout\nYou fucking fish get shot in the mouth\nAnd plus your bitch get shot in the mouth\nThat's ejaculation, you kiss it, then you taste it\nI road around with my antennas up like\nTelevision way before the satellite\nK Dot mechanisms, learn something\nI could tell that you don't know nothing\nBy the way you carry yourself\nYou dumb fuck, I'm basked up and Jim Carrey myself\nYou better duck, bless screwed, you'll be eating through a tube\nI've been fueled, that's the fucking guy\nI've been fueled, that's too fucking fly\nSo where's my parachute, I'm 'bout to jump from the Hoover Dam\nNo car cue, I think I landed in the Hoover, damn\nThey 'bout to shoot\n\n[Chorus: Kendrick Lamar]\nIt's like this and like that and like this and a\nIt's like that and like this and like that and a\nKiller Cali niggas don't know how to act and I\nNever know so ride around strapped and I\nGive it up, give it up, give it up, give it up, bang\nBang, bang, bang, bang, bang, bang\nCompton, bang, bang, Inglewood, bang, bang\nWashed up, bang, bang, you know what's good, bang, bang\n\n[Verse 3: Jay Rock]\nI'm an East side savage, black matters bring tragics\nSpray maggots, swat flies for the practice\nIt's a habit, laughing at you bitch ass niggas, get on my level\nHeavy metal when I'm rocking in my jeans\nGot a problem then I'm hopping at your team\nDrop your captor for acting like he wanted the drama\nGrab the llama, she baddest mama\nHouse disrespectful, blame it on the hood I come from\nNiggas cicadas, with their little babies walking with guns\nCatch me walking with some\nI'm double hot, I'm walking with heat that's under the sun\nYou blood pop, you done if you ain't got one\nBetter step your game up before it's over\nBefore you know it, you're close to showing\nSulken red, fall on the ground, you know he dead\nDown for the count like an accountant\nCalifornia, what you know about it?\nYeah, I'm 'bout it, 'bout it\nLike Master Pete, I am the streets\nJay Rock\n\n[Chorus: Kendrick Lamar]\nIt's like this and like that and like this and a\nIt's like that and like this and like that and a\nKiller Cali niggas don't know how to act and I\nNever know so ride around strapped and I\nGive it up, give it up, give it up, give it up, bang\nBang, bang, bang, bang, bang, bang\nCompton, bang, bang, Inglewood, bang, bang\nWashed up, bang, bang, you know what's good, bang, bang"}], "artist": "Kendrick Lamar"}