{"songs": [{"title": "Finer Thangz", "album": "I Am Legend", "lyrics": "[Produced. by Dr. Dre]\n\n[Intro]\nYeah, you in bra\nWhaddup doe?\nYeah\n\n[Verse 1: 40 Glocc]\nI was predicted a statistic that might not last\nWhat your doctor would call, a psychopath\nSo proceed with caution, you might go next\nStart feelin' kinda nauseous, and bust yo ass\nI ain't never played the rules or been in acting class\nFar as I'm concerned that Hollywood shit's for fags\nKeep it real dawg, post up with the steel dawg\nKick it with real hop, with real balls\nA lot of these cats yeah they talk so real\nBut half of these cats get cracked and squeal\nI could give two fucks less if I got a deal\nI still get bucks and watch Christoph Spiel\nCuz I could care less whether I'm broke or not\nI cop me a quarter piece and blow up the spot\nSorry dub for dub[?], and rock for rock\nWork it up to a whole brick and sold the block\nIma cop that jag, and drop that rag\nWalk up outta the mall, with shopping bags\nI want the Lifestylez, ov da rich and the famous\nNah I ain't rich yet but that's finna be changing\n\n[Chorus: L.V.]\nAll I need is the Finer Thangz, all I want is the Finer Thangz\nAll I want, all I need is the Finer Thangz\nAll I want is the Finer Thangz, all I need is the Finer Thangz\nAll I want is the Finer Thangz, all I need is the Finer Thangz\nAll I want, all I need is the Finer Thangz\nAll I need is the Finer Thangz\nYeah in my life\n\n[Verse 2: 40 Glocc]\nSee I fall in with heat, fall in the Jeep\nHit your block, jump out, and dump up all on your street\nHit the weed, and bump in-between the sheets\nRing some pussy up and let my dick fall in the sheep\nYou want beef? Put your money where your heart at\nFuck that, put your mouth where my nuts at, suck that\nSpit on wax, with 16 bars\nThen jump on tracks, like I'm a track star\nWe all got straps, no need to act hard\nWe can get our scraps on, in my mama's back yard\nI started out young, ridin' handlebars\nWent from, shootin' up cars to a hood ghetto star\nBet ya never thought Glocc could make it this far\nWith Doc Holiday, puffin' Cuban cigars\nMenage a trois, it's on the beach under the stars\nPanties and bras? Got bad bitches takin' it off\n\n[Chorus: L.V.]\nAll I need is the Finer Thangz, all I want is the Finer Thangz\nAll I want, all I need is the Finer Thangz\nAll I want is the Finer Thangz, all I need is the Finer Thangz\nAll I want is the Finer Thangz, all I need is the Finer Thangz\nAll I want, all I need is the Finer Thangz\nAll I need is the Finer Thangz\nYeah in my life\n\n[Verse 3: 40 Glocc]\nNow I done been around the world and back, and watched cats\nSwitch from Jerry curled backs to Wayne caps [?]\nAnd now the new fact[?] fresh braids to the back huh?\nAnd everybody rockin' silver like it's platinum\nStop it dawg, what the fuck wrong with y'all?\nIf you can't afford the real don't cop it at all\nYou can't ball and be broke\nSpend up all your come up money\nAnd wonder why you keep coming up short\nI don't know what it is, what the fuck is this?\nC'mon that shit on your wrist's faker than silicone tits\nYou need to quit, seek a role model to follow\nOne that can teach you, the means of a dollar\nSee you? You spend your last buck on weed\nSee me? I spend my last buck to eat\nMight fall in the club, buy myself a drink\nHell yeah I'm fucked up, what the fuck you think?\n\n[Chorus: L.V.]\nAll I need is the Finer Thangz, all I want is the Finer Thangz\nAll I want, all I need is the Finer Thangz\nAll I want is the Finer Thangz, all I need is the Finer Thangz\nAll I want is the Finer Thangz, all I need is the Finer Thangz\nAll I want, all I need is the Finer Thangz\nAll I need is the Finer Thangz\nYeah in my life", "image": "https://images.genius.com/7fdb871fc0f0f0caae60fc303f4456b3.500x500x1.jpg", "year": "2009-03-17"}], "artist": "40 Glocc"}