{"songs": [{"image": "https://images.genius.com/655b854c09fd20fcd932070d6fa0e912.640x640x1.jpg", "title": "Let Me In", "album": "Price City", "year": null, "lyrics": "[Intro]\nHands in the air if you a'int broke\nHands in the air if you still broke\nIf I die I pray to God He bring me back to kill shows\nTo kill shows, and still hoe\n\n[Hook]\nGet up on my ladder, I\nI, I spend a night on a satellite\nAnd I ain't coming back tonight\nNo I ain't coming back tonight\nThey made millions off this rap shit\nYou can't tell me that's magic\nRabbit out the hat trick, that shit\nI guess I gotta go practice right?\nMake a sacrifice, for the flashing lights\n\n[Verse 1]\nI've always had a thing for a girl with a little bit of attitude\nAs long as she can walk the walk\nAs long as she can bark the bark\nShe can say a lot if she knows where to park the car\nI know a lot like a valet do\nStay on my toes like a ballet move\nI graduated from the streets my nigga\nEven though that ain't school\nI learned how these moves made men\nAnd this young made man made moves\nI made it clear my kind of common sense is rare\nI kind of sense my opposites got a common fear\nSo watch and stare, you might see Pac appear\nThey told me think out, I live out the box, you square\nI had a dream that my momma wrote back\nShe told me stay onto your rap\nKeep a hard head, break bricks at the Mario trap\nAnd now I'm in the corner dealing with dealing this audio crack\nI'm still mad at Jesus to this day\nHe put mom in that taxi\nThat seat, bullet to the dome glass pieces to the face\nI don't know my mom and I'm fiending for her face\nY'all fiending for a tape?\nY'all fiending for that Price City?\nThat Rapsun, Blacksun, yall fiending for a taste?\nMan, yall seeking for a trace?\nI'm a billlion and 17 feet above this place\n\n[Hook]\nGet up on my ladder, I\nI, I spend a night on a satellite\nAnd I ain't coming back tonight\nNo I ain't coming back tonight\nThey made millions off this rap shit\nYou can't tell me that's magic\nRabbit out the hat trick, that shit\nI guess I gotta go practice right?\nMake a sacrifice, for the flashing lights\n\n[Verse 2]\nI've always had a thing for a girl with a little bit of altitude-\nAs long as she don't choke at ease\nAnd if she falls onto her knees\nI hope she holds onto a tree and smokes all the leaves\nI know you're listening\nAnd if I ever go missing and disappear\nFollow my footprints in the air\nWhen you start getting lost in the fog, just call, I'm there\nBring a missile and a chair\nThe stories I tell when I make y'all songs\nI make y'all yell when I take y'all souls\nYoung black angel, with a black halo\nA place called hell is a place called home\n'Cause I never had it easy\nNothing but a heavy letter sequence\nGo against what every pastor preaching\nDreams 'fore I barely had the eat 'fore I sleep and\nGoals 'fore I barely pass the defense, G-Shit\nYour bullshit is irrelevant\nI'm a G, not the element, separate, I'm a veteran\nYou're kinda Shady like Eminem\nI'm on key like piano men\nFucking bitches I've never met\nBeen rapping since Elementary School\nStarted smoking heavily, then you resented me\nIt's cool though\nI just hope you're proud of me\nIf you can see my footprints when the moon hits, shawty you can follow me\nI bet if Cassper said this y'all would hit twitter and go wild\nIf AKA said it you would consider this an audio gold mine\nI bet if K.O. said it, you would go on twitter and happily quote lines\nBut a young kid said it and you ain't gon' pay him no mind\n\n[Hook]\nGet up on my ladder, I\nI, I spend a night on a satellite\nAnd I ain't coming back tonight\nNo I ain't coming back tonight\nThey made millions off this rap shit\nYou can't tell me that's magic\nRabbit out the hat trick, that shit\nI guess I gotta go practice right?\nMake a sacrifice, for the flashing lights\n\n[Bridge]\nI think I have a motto\n“Live life, live life, like you hit the lotto”\nYou ain't gotta have a lot, yo\nJust some pot, yo\nRapsun, Blacksun, the CrackBros\nComing for your back door\nMatter of fact, yo\n\n[Outro]\n(The game gon' let me in one day)\nDamn what you say, damn what you say\n(The game gon' let me in one day)\nDamn what you say, damn what you say\n(The game gon' let me in one day)\nDamn what you say, damn what you say\n(The game gon' let me in, fuck y'all,dunk on all of y'all)\nThe game gon' let me in one day)\nDamn what you say, damn what you say\n(The game gon' let me in one day)\nDamn what you say, damn what you say\n(The game gon' let me in one day)\nDamn what you say, damn what you say\n(The game gon' let me in, fuck y'all, dunk on all of y'all\nBlacksun I think we got it my nigga"}], "artist": "Nasty C"}