{"songs": [{"image": "https://images.genius.com/ff6738f83747060eafd4a7af4964cd8f.1000x1000x1.jpg", "title": "Blunt Ashes", "album": "Hip Hop Is Dead", "year": "2006-12-19", "lyrics": "[Intro]\nYo, I wonder if Langston Hughes and Alex Haley\nGot blazed before they told stories\nI'mma get blazed before I tell y'all stories\nI saw on TV today, this man lost his son, his son died\nSo he had him cremated\nTook his ashes and then made it to a diamond ring\nNow he watches his son shine everyday\nI just thought about that\nWhile I sit here ashing in this ash tray, yeah\n\n[Verse 1]\nThe making of a mad band, intricate stories of DeVante Swing\nAva Gardner, the crashin' of James Dean\nBobby Brown influenced by Rick James and it goes\nPrince wanted Alexander O'Neal to be Morris Day or Jerome\nBut Alex was putting coke in his nose, nigga whylin'\nCould be a myth, but I swear that the source was close\nPhyllis Hyman killed herself, it was crazy\nMommy was bad they say\nDonny Hathaway free-fall from a balcony, he swings\n\n[Hook]\nAs the blunt ash falls into the ash tray\nI could see my whole life fly past me\nDid I? Did I keep it gangsta or keep it classy?\nAnd will the money and fame outlast me?\nThe blunts ash falls down in the ash tray\nWell, I see my whole life fly past me\nI'm asking, did I keep it gangsta or keep it classy?\nDid I? Anything else you wanna know, just ask me\n\n[Verse 2]\nSam trusted Womack with his main lady\nHe tossing in the grave like, \"This is how you repay me?!\"\nA change gon' come, wish you didn't trust me so much\nMarvin said \"No mountain's high enough,\" fly stuff\nDavid Ruffin was punchin' Tammi Terrell\nGave her concussions\nWhile the Funk Brothers was laying down the percussion\nWhen Flo from the Surpremes died, Diana Ross cried\nMany people said that she was laughin' inside\n\n[Hook]\n\n[Verse 3]\nJohn F. Kennedy's enemies dealt with treachery\nIt interests me. Judy Campbell in Gucci sandals\nShe's what a temptress be\nThe death of Ennis Cosby, what a mystery!\nOr the Chicagoan Harold Washington\nSomeone is sabotaging 'em\nWatch out for the traps\nLarry Troutman killed his brother Roger Troutman\nThen he killed himself, that's the end of Zapp\nAnd I wouldn't change a thing, mistakes of the greats\nThis is what came from their pain\nFrom their hurt we gain, an unfair exchange\n\n[Hook]\n\n[Outro]\nI could smell old bogey cigars\nLong record perfumes, smelling just as sweet\nMe and my wife K, flying in a drop-top\nLike Ruby and Ossie Davis, baby – know what I mean?\nYo, man, I get smoked out, and start thinking 'bout\nHattie McDaniel got a Oscar\nFor playing Mammy in \"Gone with the Wind\"\nAnd she didn't get allowed\nWasn't even allowed to go to the premier\nBelieve that? Couldn't go to premier to her joint\nMan, you know they were strong back then, man\nBlunt from my ash tray, nothing gon' to live past me, yeah"}], "artist": "Nas"}