{"artist": "Andy Mineo", "songs": [{"title": "Goodbye", "album": "Formerly Known", "year": "2011-09-29", "image": "https://images.genius.com/b69d4d087350fcc7c60238bac49a2151.1000x1000x1.jpg", "lyrics": "[Intro: Andy Mineo]\nUh, uh, they thought I was a singer\n\n[Verse 1: Andy Mineo]\nLook, I'm like ink so fresh I could smear it\nJust signed my name, I already feel it\nIt's like a bulls-eye on my head that I'm wearin'\nBut it's not a Bulls snap-back cap that I'm talkin' 'bout\nWalking out my faith, live from that New York City\nLiving where it ain't pretty, Wash Heights\nWhere they puff haze, play music all night\nThat's why your boy came, so we could show 'em Christ\nY'all don't get it, I been saved, living for His things\nSwitched the name, used to go by C-Lite\nBut then I put it in the grave, cause I'm steppin' off stage\nStill the same dude livin' what I say up on that mic\nCap and gown, graduated now, 23 and I'm in a new season\nWow, this is crazy! God is so amazing\nHe been using all that pain He allowed to shape me, chiselin'\nEvery little thing of me that isn't Him\nAnd sin is still wacker than it's ever been\nJesus coming back again, when he does all that\n\"I used to go church\" stuff is irrelevant\nFollowing Christ ain't a one time event\nIt's a lifestyle, not what you use for your girlfriend\nSo there it is hope y'all listening\nYeah the same mission but the team look different\n\n[Chorus: Andy Mineo]\nDon't believe the lie\nYou're living in a world that's passing by\nAnd all the pretty things that you thought were fly\nYou can't take 'em with you when you die\nEverybody sing, oooh\nGoodbye!\nEverybody sing, oooh\nGoodbye, goodbye!\n\n[Verse 2: Andy Mineo]\nRap aficionado, from the 'Cuse where they move for Otto\nBut now out of my window, I can see the Apollo\nI changed cities, still people remain hollow\nEverybody Tweet, but they don't know who to follow\nWatch me kick it, Salvation minus Crucifixion\nYou got a better chance at the Lotto with no ticket\nIt's horrific, rhyme for Jesus but flow wicked\nYou hear the truth, but don't wanna do it like those dishes\nNewsflash, new trash in the media\nAll them old lies, watch what they feedin' ya\nIf it's no good throw it up, like bulimia\nIf it's no good throw it up, like graffiti huh\nSo think fast, Ramadan, Autobahn\nGirlies wanna move fast tryna use they body wrong\nThey gettin' naughty but, you know it's probably cause\nThey want male attention, cause they father gone\n\n[Chorus: Andy Mineo]\nDon't believe the lie\nYou're living in a world that's passing by\nAnd all the pretty things that you thought were fly\nYou can't take 'em with you when you die\nEverybody sing, oooh\nGoodbye!\nEverybody sing, oooh\nGoodbye, goodbye!\n\n[Verse 3: Eshon Burgundy]\nSay goodbye to the liar, say hello to the fire\nSay peace and the storm gone, like it's on tires\nThought you was a Don Juan so you co-conspire\nWith the evil empire, Evel Knievel, conniving people\nAre putting commas in God's word\nCareful who you worship when you waving at concerts\nMy finger's on the detonator like I'm playin' Sega\nSee ya later to the hater of love\nI made this statement because I'm sick of\nBeing in your data with that hatred and lust\nI got kids, and they got ears and they be opening up\nTo bright ideas, and you feeding 'em bull\nI feed 'em truth, cause I understand speaking's a tool\nEither a key or a noose. Either get you out or get you through\nBut it all depends on what you're gettin' to\nSee that gettin' is forbidden if you get into that fruit man\nGet up in them Scriptures instead of getting to that loot fam Salute\n\n[Chorus: Andy Mineo]\nDon't believe the lie\nYou're living in a world that's passing by\nAnd all the pretty things that you thought were fly\nYou can't take 'em with you when you die\nEverybody sing, oooh\nGoodbye!\nEverybody sing, oooh\nGoodbye, goodbye!\n\n[Outro]\nGoodbye, Good-ggoodbye, Oh! Goodbye!"}]}