{"songs": [{"image": "https://images.genius.com/b7412b0236e83088fc910e3cae26634e.500x500x1.jpg", "year": null, "title": "Evil Genius", "album": "The Unforgiven, Volume 3: Vindication", "lyrics": "[Verse 1]\n\nI'm Robert Oppenheimer, this is the Manhattan Project\nI'm making a bomb to blow up the earth, that is my object\nNot one of you can stop it, can't defuse it\nMy rockets field upon the launch pad upon who to drop it\nThat the only question: Who wanna test my side?\nHitler, Mussolini, I blow up their allies\nI literally drop bombs like Hiroshima\nNo need for FEMA, no clean up, I blow the whole damn thing up\n(Mu-ha Muhahaha), yes I am an evil genius\nIf you don't like it kiss my anus\nTell your people \"Bring it!\"\nMy demeanor is so mean and so fiendish\nThere's no changing me, it's such a shame I have to be a giant penis\nBake your body up like peanuts if you claim to be even half as insane as me\nBarbecue your meat up like it's angus beef, you anger meeee\nHe's so dangerous he gives out his mind and by 'he' I mean me cause we're Schizophrenic and out my mind you're out of time!\n\n[Hook] (Mock laughing in background)\n\nI'm an evil genius\nI'll take over the earth x8\nMu-ha!\n\n[Verse 2]\n'\nI'm so nefarious\nSo evil atrocious\nThey start to freak out and get afraid when people approach us\nThe Abominable X\nRaided is so horrendous\nKilled all the other rappers cause there can be no contenders\n(Mu-ha!) You had an accident\nA sudden tragedy\nI'm so dastardly, women love my savagery (Mu-ha!)\nI'm an evil genius\nBut there's nothing to it, my IQ is 162 but even a caveman can do it\nI'm Beelzebub, I'm Mephistopheles\nI am a juggernaut, there is no stopping this (Mu-ha!)\nIt's all for not\nAll your efforts are I'll burn you up, make you look like you're covered with lepro scars\nNot leopard spots\nDon't you confuse the two\nBut I could slice your DNA, clone you and fuse the two\nMake a hybrid out you\nCall you \"Catman\"!\nIntroduce you to my next creation, I am Batman!\n\n[Hook]\n\n[Verse 3]\n\nI am Batman!\nLook what I've come to be\nI used to be human, but look what he's done to me\nChildren run from me, I'm just trying to say 'Hi', Hello\nBut my teeth are sharp, I have wings, and my eyes yellow\nThat's what he said\nWhen I opened my eyes\nHe raised his fists above his head and yelled out \"Into life!\"\nAnd since then I've done my best to try to hide\nI wear a trench-coat, hat, and glasses, that is my disguise\nI hang upside-down\nSometime from a branch\nI went to sleep one night and woke up and my feet were hands (Mu-ha!)\nHe strikes again\nHe never stops\nHe has the body of a man, the head of an ox\nNow that was figurative\nI must be specific\nCause he's an evil genius, he could do it if he wishes\nHe's coming closer\nHe must've overheard\nI advise you to deny you ever spoke a word\n\n[Hook]\n\n[Outro]\n\n(Moaning)\n(Laughing)\nThat's what the fuck is up\n(Laughing)\n(Moaning)\n(Laughing)"}], "artist": "X-Raided"}