{"songs": [{"year": null, "image": "https://images.genius.com/1a6991088db2ae8d9ae4e9223bac2352.400x400x1.png", "title": "Me & Mother Teresa (Sink My Boat)", "album": "Emperor Nehru’s New Groove", "lyrics": "[Intro Sample from The Emperor's New Groove]\nRudy: I threw off the emperor's groove\nPacha: What?\nRudy: His groove! The rhythm in which he lives his life! His pattern of behavior! I threw it off! And the emperor had me thrown out the window!\nPacha: Oh really? I'm supposed to see him today--\nRudy: DON'T THROW OFF HIS GROOVE!\n\n[Intro]\nYup, Yup, ain't no way\nWhen you're doing your thing you know\nThere's always somebody ready with torpedoes\nDon't let 'em sink your boat\n\n[Chorus]\nAyy, all I know is I ain't gonna let you sink my boat\nAyy, as I wrote, I'ma make sure that all I do is glow\nAyy, I was told everything that glistens isn't gold\nAyy, all I know is I ain't gonna let you sink my boat\n\n[Verse 1]\nYeah, my boat has been floating perfectly\nThey want the Titanic or another worse to murder me\nStill I never panic cause y'all lead me certainty\nThey can't help but watch me go first like it's courtesy\nMy character ain't assassinated I'm fine, certainly\nA little aggravate but it seems like the perks of me\nAin't a perc in me, and still it ain't even a you need\nThe only time I leave Earth is when I go to merk a beat\nI serve unique Hennesy\nLearned in one life my little boat could grow to a yacht\nHe got to go and shine, that's the bottom line\nMy boat's so strong it could hold off Poseidon, uh\nLike a rushed book, I'm focused on my end\nTruly being me, everyday I'm trying to wisen\nBecame a lost jewel that they seeked and been finding\nSo now I'm making 'em pay like go around finding\nAin't surprising\n\n[Chorus]\nAyy, all I know is I ain't gonna let you sink my boat\nAyy, as I wrote, I'ma make sure that all I do is glow\nAyy, I was told everything that glistens isn't gold\nAyy, all I know is I ain't gonna let you sink my boat\n\n[Verse 2]\nI ain't sinking, what are y'all thinking?\nSee as I'm getting older that my circle has been shrinking\nNotice that it gets lonely at the top and now I'm linked in\nThat's why I feel like humans on the brink of extinction\nCause any distinction just get 'em embarrassed\nI done seen it for twenty years, even see it in my parents\nAnd honestly it's apparent (Wait what?)\nBut whatever, that's why it's fuck every opinion all together\nAny weather I'll be fine, got a different mind\nLife is battleship and really I've been winning every time\nLike strict mom whippings, now they wouldn't even try\nCause my boat won't flip, inside staying dry\nI'm striving for history, the strive sends victory\nI figured out the keys to my route like a mystery\nI know they want me out like a house with an entity\nBut my boat forever afloat like it's infinity\nAre you kidding me?\n\n[Chorus]\nAyy, all I know is I ain't gonna let you sink my boat\nAyy, as I wrote, I'ma make sure that all I do is glow\nAyy, I was told everything that glistens isn't gold\nAyy, all I know is I ain't gonna let you sink my boat"}], "artist": "Bishop Nehru"}