{"songs": [{"title": "Need Some Lovin’", "album": "The Lost Tribe of Shabazz", "year": null, "image": "https://images.genius.com/ccff32ca0eedb6ac1f785643772e94fa.400x399x1.jpg", "lyrics": "Put negativity to a halt, it's not my fault that we're killin\nAnd illin, that's why I'm takin my time and I'm spillin\nMy guts on a cut like this one\nMake sure you don't miss none\nOf the rhymes from the clean and crisp one\nPeople of the planet Earth, man, it hurts to see\nPeople livin in poverty, there's got to be a better way to live\nWe gotta learn to give more love, that's the only alternative\nJust the other day I was speakin to my man Rob\nAnd I said, \"Yo Rob, what's up hops?\"\nHe said, \"Lak man, I just can't stand\nAnd I don't understand the ignorance of a blackman\nToo many crackheads, tackheads and bloodshed\nBrothers and sisters are fightin instead of unitin\nWe need to cut it out, we're self-destructin\nYou know what we need, Lak?\" \"What Rob?\" \"We need more lovin\"\n\n(Gotta get some lovin)\n\nWe're self-destructin\nThat's why we gotta get more lovin\n\nLove the fact that you're black if you are black\nBeamin up to Scotty is wack, this ain't Star Trek\nBe not weak but be strong and watch out for the attack\nOf those that might try to hold ya back\nI'm the type of guy that likes to spread peace\nNot the type of guy that'll leave your achy\nYou've been sleeping too long, you need your bed reached\nWake up before you end up a dead sheep\nInnocent till proven guilty, yeah, that makes sense\nThe blacks, we're guilty till we're proven innocent\nTo get where I got to my approach was different\nNow you know why I'm so militant\nI got a handful of love, yeah, take a crunch\nBut be positive, you come negative, you get punched\nOne bad apple don't spoil a whole bunch\nWe can make it - get my hunch?\nStop your snakeous mischievin, your lyin and thievin\nAnd love the fact that you're alive and breathin\nLove is the key, see, to unity, without it there's nothin\nSo let's all show a little more lovin\n\nBreak it down like this\n\nLove could be the start of many things\nWe all know the sorrow and joy it brings\nSet your goals in life and believe in your dreams\nAnd maybe one day it might come true, yo, know what I mean?\nStop complainin, we need to crack down\nI heard of Chinatown but never of Blacktown\nBy any means necessary I'm not havin it\nAnymore we need our own establishments\nPeople of the world, it's plain to see\nWe need to spread a little more l-o-v-e\nNothin in the world is gonna come to you free\nSo let's get work together and make money\nSome of us are so blind we don't understand, see\nWe're jealous and envious and wonder why can't we\nLive in unity as one big family\nI show a lot of love for those that are down with me\nAnd we'll hold on through thick and thin\nCause we're brothers and sisters, more than just friends\nDestroy negative and build the positive\nDo what you wanna do, that's your prerogative\nStick together, no matter the weather\nLet no one stop ya, I'm sure you can prosper\nWe need to cut it out, we're self-destructin\nPlay ya part, open your heart and spread some lovin"}], "artist": "Lakim Shabazz"}