{"songs": [{"year": null, "album": "The Most Beautifullest Thing in This World", "image": "https://images.genius.com/447c633e96f2be906b387d1114ff07c4.953x953x1.jpg", "title": "Herb is Pumpin", "lyrics": "I gets dumb with the momentum of the drum\nAnd blow MC's, to kingdom come\n\n\"The future holds nothing else, but confrontation\"\n\nMurray is a lyric luna-tic toc\nBoom, I fill the room with the rough rhymes I consume\nMy lyrics is too fly for this world (word em up yo)\nAnd more famous than the Jheri Curls\nMy rhymes correspond with the funk beat\nLike infrared corresponds with heat\nI'm malicious and vicious, puttin rappers in stitches\n(yeah yeah) when I'm rippin up twelve inches (like this)\nMy rap style is a metallic bastard\nThat thrives off of battery acid (word em up)\nI rhyme like I'm hungry over funk beats\nFor those, who shit where they eat\nReach, and your strategies'll be picked off\nCream puff sweet, I freak the sheek type of speech\nThe vital, verbal combat I enlist\nWraps rappers' brains up into a pretzel twist (word em up)\nWhen I'm coastin with the funk style potion\nI leave your notion dead and bloody in the ocean\nI can't be beat so don't be under that assumption\nI flow as long as the herb is pumpin\n\n\"Yo what kind of weed is this?\"\n\"It's the bom bom zee baby.\"\n\"Yo this shit is WAY out!\"\n\"Yo let's be outta here.\"\n\nCome and take a ride on my bad side\nYou can't fuck with my style cause it's bastardized\nAnd when I meet my match, I'm tyin em up\nIn the bassline and stabbin em in the spine for tryin to play fly\nWe got to have it like some hungry dirty stinkin motherfuckers\nAlways actin wild and stupid like truckers\nGoin against the grain, barbecuin' niggas\nIn the Purple Rain as my wild brain child style goin insane\nAnd I'm wild with the usage of a harsh word\nMy style of speak is mentally disturbed\nI drug the head more than hallucinogenics with rhymes like these\nOn the mic I'm catchy like herpes\nCovalent ionically with the mic I combine\nAnd gain more strength, than a molecule enzymes\nE crack the sticks while I get in the mix\nAnd kick some fix after prefix after predicates\nI take a trip down memory lane\nAnd kick some shit, that'll bust your brain\nHit as you should, a real common hood\nNot Stephanie Mills, but I still feel good\nI take a Phillie Blunt to go, and yo\nI flow as long as the herb is pumpin"}], "artist": "Keith Murray"}