{"songs": [{"album": "Ruff Draft", "year": "2003-02-25", "title": "Crushin’ (Yeeeeaah!)", "image": "https://images.genius.com/7ccfcf23aa63222a84f1dbb1ee771716.1000x1000x1.jpg", "lyrics": "Sex, sex! Freaks, freaks!\n\n[J Dilla]\n'Bout to get nasty in this muh'f....\nWhere my freaks at? Uhh, get live with it\nYeah, uhh, let's go\n\nIf you wanna f..k all night let me hear you say\nI wanna f..k all night right now\n(I wanna f..k all night!)\nYeah! I wanna f..k all night, let's do it\n(I wanna f..k all night!) Clean it up\nI wanna crush all night right now UHH~!\n(I wanna crush all night!) Ah keep crushin\n(I wanna crush all night!) Ah keep crushin, yeahhh\n(I wanna crush all night!) Ah keep crushin\n(I wanna crush all night!)\n\nThis is for my n....z and my nymphos\nNon-stop bangin like a Dilla instrumental\n\nUhh, yeah turn it up in your whip boy\nCatch a glimpse of the 5th turnin up in the strip joints\nCause if you know what I know\nMy dick stay half-baked so b...h you know what I wrote\nI have... and I don't wanna talk to no Sampson\nI wanna... but don't let me stop you from dancin now momma\nFat booty workin it out\nKeep twerkin it, DAMN~! She pullin up my shirt with it, WILD\nYou hurtin 'em girl, your - doin yo' thug thizzle\nI'm feelin the Monie go right in the middle\nShe got a ticket or som'n, girl you somethin ridiculous\nCan a brother f..k it or som'n?\nF..k all the small talk, you got some friends we can all walk\nDilla dawg'll party with all y'all\nS..t, we fixin to get live\nBounce hit the horn then Nitti get inside\nAnd then we off like that\nDoin 85 while she hit me off like that, yeahhhh\n\nWe gon' f...k all night\nIf you wanna f..k all night long let me hear you say\nI wanna f..k all night right now uhh\n(I wanna f..k all night!)\nYeah! I wanna f..k all night, let's do it\n(I wanna f..k all night!) Clean it up\nI wanna crush all night, let's go!\n(I wanna crush all night!) Ah keep crushin\n(I wanna crush all night!) Ah keep crushin, yeahhh\n(I wanna crush all night!) Keep crushin\n(I wanna crush all night!)\n\nThis is for the bitties that's 'bout it 'bout it\nWhether goin to college or the city to drop it\nI got somethin for ya, it's only chump change\nYou know me, jump in the Range and hit the buttons for ya\nUhh, I rolls out like I'm Luda\nWith the crew and, roll up buy her the buddha\nLet's do the damn thang, tryin to f..k us yo\nWe need a bust yo to let me and my mans bang\nMcNasty affair, come down to the D\nWe can hit the Key cause a lot of ..s be in there, I tell ya!\nI remember, nailin this bank teller in there\nF..kin her friend now that's hookin her nails up\nBend it over momma, let me show you how I do Renee\nIt's McNasty, party with two a day\nLet me give it to ya, you want Dilla to do ya it's done\nPlus got a ridiculous booty it's on\n\nThat's how we like it y'all, and all\nSo if you want it all night let me hear you say\nI wanna f..k all night right now OHH\n(I wanna f..k all night!)\nYeah! I wanna f..k all night, let's do it\n(I wanna f..k all night!) Clean it up\nI wanna crush all night let's go\n(I wanna crush all night!) Ah keep crushin\n(I wanna crush all night!) Keep crushin, yeahhh\n(I wanna crush all night!) Keep crushin, uh-huh\n(I wanna crush all night!) Keep crushin, yeahhhh~!\n(I wanna crush all night!) Ah keep crushin\nUhh, yeahhh\nRuff Draft muh'fu...."}], "artist": "J Dilla"}