{"artist": "Benzino", "songs": [{"lyrics": "Intro: Benzino\n50 Cent is fallin down, fallin down, fallin down\nGet Ya Gunz it’s going down, FUCK G-UNIT\nOh ain’t no muotherfucking games man\nNa ah\nYou know what the funny thing is man?\nYou come to me for help\nI didn’t even know you man\nPunk motha...word up man!\nOh I know you mothafuckas didn’t think it was over\nOh this shit has just begun\nYou blast that\n\nHook: Benzino\nMany men, don’t wanna stop\nAnd my real street niggas\nThey ain't gonna stop\nCuz my money making dawgs go down to block\nGive them drugs and a mothafucking guns’ll pop\nRed shoes, only see ya when I get you\nPut a forty in ya mouth, when I wet you, dead you\nYa up in the hood cuz I met you\nYou was looking really shook when I met you\nAnd I don’t like the way they look at you\nAnd I don’t like them funny things you do\nAnd I don’t like the way you tell them lies\n50 Cent you gonna lose ya life\n\n[Verse: Benzino]\nYou a fed’s 1st artist, Eminem’s son\n3 times platinum snitch always on a run\nSacrificial meat, the machine money maker\nDre steals beats and then he saying he made em!\nBenzino spit eth, (Ether) always ready street sweepin’\n50 feel these 50 .cal hollow heat seekers\nThe magazine kill the kid if I have to\nTie him up, chainsaw his legs in the bathroom\nDon’t confuse real life shit with this rappin’\nYou used to gettin’ shot, we gon make it happen\nWho sign ya in ya life insurance policy?\nJimmy, Dre, or Em? Or maybe all 3\nYou just another fucking slave, stop yappin’\nCurtis Kinte, sorry Miss Jackson\nYou looking funny with that bullet in ya face, stop taking. You droolin’ all over the place\nWho ya foolin’? You just a moving target at the range. You don’t shoot back, What’s that you claim?\nRemember back when the 1st time I saw you\nYou was scared shaking like a leaf when I saw you\nYou said you had beef and ya man ran on you\nYou told these niggas put their bare hands on you (Murda Inc. at Hit Factory)\nYou fucking idiot, you ran in my session\nStabbed in the gut and you wanna start confessin’?!\nYou a snitch, how you gonna hide from that?\nI see 1 informant, classified rat\nWhere I’m from, we keep the hammers locked and loaded\nYayo took a fall cuz you wasn’t gonna hold it\nNeed a fall guy? Peace? See themself 1st sweep\n“G” stands for girls, the unit Dre’s beat\nCuz 50 you a wanksta and you never shot nothing! You ain’t no gangsta cus you won’t pop nothing!\nYo fucking leader is a trailer park bozo, snatch him from the back rip spine out his torso\nHe look stupid in that 'Free Yayo' shirt. I got niggas in threes that will leave yayo hurt!\nSurrounded by niggas with no heart in ya chest\nHollow spark rip apart that bulletproof vest\nAnd my 1st mil, way before you signed a deal\nBust my 1st shots, way before you started to squeal!\nKill the head, the rest of them will fall apart\nI’m a crime frontline when the ballas start\nI send the wolves to grandma’s house\nScud missile that nitch just for running your mouth\nIt’s no coincidence, ya name is five-o\nProlly is a feds, so you hang with five-o\nAnd many men, shot ya many, many times\nAnd niggas don’t believe what you say in ya rhymes\n\nHook: Benzino\nMany men, don’t wanna stop\nAnd my real street niggas\nThey ain't gonna stop\nCuz my money-making dawgs go down to block\nGive them drugs and a mothafucking guns’ll pop\nRed shoes, only see ya when I get you\nPut a forty in ya mouth, when I wet you, dead you\nYa up in the hood cuz I met you\nYou was looking really shook when I met you\nAnd I don’t like the way they look at you\nAnd I don’t like them funny things you do\nAnd I don’t like the way you tell them lies\n50 Cent you gonna lose ya life", "image": "https://s3.amazonaws.com/rapgenius/91e679c8210dab2c79d0611be49e28ef.jpg", "year": "2003-01-01", "title": "Fallin’ Down (50 Cent Diss)", "album": null}]}