{"songs": [{"year": "2015-05-15", "title": "Out the Bowl", "image": "https://images.genius.com/c3b758e8c0a12314740b57bf07ab7974.1000x1000x1.jpg", "lyrics": "[Key!]\nHello!\n\n[DJ Hoodrich Keem]\nJust in case y'all niggas didn't know\nWe the man round here nigga!\nOne time, lil lavish nigga\n\n(Hoodrich Bitch!)\n\n[Verse 1:Key!]\nWhen she give me head she gon' use both hands\nHey! Hey!\nAnd ya know, hey, hey\nIm the man, hey\nOh im in the club and im doing the stale face, ok\nHey, why ya mad?\nIm just waiting to get the check please\nHey, I need my check please!\nTry to check me, you gon need a check please!\nAnd the fuckin Glock become designer\nNiggas rockin' Glocks like that shit designer!\nOk, if I pull mine I'ma fuckin' design ya!\nOk, leave you chopped up like some fuckin' lasagna\nOk, keep the piece, i've been tryna keep the peace\nYou can clear the fuckin' streets that's why I'm tryna keep the peace\nAy, I got a money recipe that work for more than me\nAy, they can't work for you, hell, you can work for me\n\n[Hook: 21 Savage & Key!]\nShe love me cause I get it out the bowl\nIma real nigga rockin' real gold\nBut little do she know\nI'm just tryna get her out them clothes\nShe love me cause I get it out the bowl\nIma real nigga rockin' real gold\nBut little do she know\nI'm just tryna get her out them clothes\n\n\n[Verse 2: 21 Savage]\nBitch!\n20 bands in my hands ima make these bitches do the Macarena\nAy, ima real street nigga, I be damned if I pay you for a feature!\n(21! 21!)\nMamacita! I wanna meet ya!\nSmokin' reefer (gas! gas!), I keep my heater\nI met her in the club, I knew she was a cheater (cheating bitch)\nI can fuck you baby girl but I can't keep you\nYeah, Ima liar, Ima dog, she a silly bitch\nShe always call my phone with that silly shit!\nYou ain't talkin money? hang the phone up (what?)\nYou ain't talkin money nigga? hold up (what?)\nYou ain't talkin money nigga? pour up (w-what?)\nGot it out the bowl with the cola\n\n[Hook]\nShe love me cause I get it out the bowl\nIma real nigga rockin' real gold\nBut little do she know\nI'm just tryna get her out them clothes\nShe love me cause I get it out the bowl\nIma real nigga rockin' real gold\nBut little do she know\nI'm just tryna get her out them clothes", "album": "The Slaughter Tape"}], "artist": "21 Savage"}