{"songs": [{"album": "The Never Story", "year": "2017-03-10", "title": "EdEddnEddy", "image": "https://images.genius.com/796771530cc626d2f5c7ae281bd32b3d.1000x1000x1.jpg", "lyrics": "[Skit]\nNah bruh (Huh?)\nWhat you talking bout, homes?\nAyy, ayy, nigga, Snapchat niggas twisted up real tight\nI'm with my motherfucking brothers, nigga (Hahahahah)\nThey was representing for Trump real tight\nBut we in this motherfucker real tight\nNigga, ain't left, everything right\nNigga, I'm tight!\nNigga, fuck you talking about?\nBars forever, nigga!\n\n[Intro]\nBars, bars\nMe and my two, okay\nMe and my two, alright, me and my two, okay\n\n[Verse]\nMe and my two niggas be like Ed, Edd 'n' Eddy\nI'm Zack, you AC, that Jessie and Kelly\nI pull up to your hood, just let me know when you ready\nI'm rolling up this dub, finna face it, beheaded, mm-mm\nHold on, chill out, please give me a second\nI'm drowsy off a Xan, nigga, legs is spaghetti\nCut all of the bullshit, nigga, chop the confetti\nYou ready? I'm ready, you ready? I'm ready, uh, alright\nNever sell weed cause I'm smoke it too much\nI fuck up the pack, I don't fuck with the sack\nAnd I mean the bread come quick\nHe told me bring him 300\nI brought him excuses and like 200 or something\nI mean most of y'all niggas love drugs like me\nLove me like drugs, bitch, I might be\nYo' love light bulb, turn on lights please\nTurn off your cool, I mean, I might freeze\nI mean hold on, relax, please give me a chance\nI was moving too fast, I ain't hear what you said\nWe was celebrating life, tryna get to the fetti\nBut me and my two niggas, we like Ed, Edd 'n' Eddy, damn\n\n[Outro]\nEd, Edd 'n' Eddy, Ed, Edd 'n' Eddy\nMe and my two niggas be like Ed, Edd 'n' Eddy\nEd, Edd 'n' Eddy, Ed, Edd 'n' Eddy\nMe and my two niggas be like Ed, Edd 'n' Eddy\nNigga, Ed, Edd 'n' Eddy, Ed, Edd 'n' Eddy\nMe and my two niggas be like Ed, Edd 'n' Eddy\nEd, Edd 'n' Eddy, Ed, Edd 'n' Eddy\nMe and my two niggas be like Ed, Edd 'n' Eddy, damn"}], "artist": "JID"}