{"songs": [{"image": "https://images.genius.com/4ca57e4ceb5f85f4c1d5b5fd347cab28.500x500x1.jpg", "year": "2008-07-08", "title": "Everything Is Cool", "album": "Planet Squaria: The Square in the Circle", "lyrics": "[Intro] [XV talking]:\nYeah. And now for your...feature presentation. The square in the circle. A radio fly production. And a Royalty City film. Yerrdigg? Speech!\n\n[Verse One]:\nI got a hunch that nigga Vizzy back\nHello Moto, no Toto where I'm at\nHello my lady\nHello my honey\nHello creativity\nBye bye money\nIt's like hip hop doesn't want me here\nBut I'm cornering the game like a circle in a square\nRock skater shoes and said it ain't hood\nWhile my people co-sign like my credit ain't good\n\nEverybody's fly, everybody's a rapper\nEverybody hustle, everybody's a trapper\nBut I Don't Fit In\nI Don't Fit In\nEverybody tough, every dude is a thug\nEverybody party, everyone in the club\nBut I Don't Fit In\nI Don't Fit In\n\nAgainst all odds but I tell 'em to deal me in\nCause in my silly bin I think that I really win\nLive in living color, I'm a Complex brother\nSo the day that I come, black and white fill me in\n\n[Hook] (x2)\nHaters and fakers, everybody go\nHipsters and gangsters, welcome to the show\nEverything is everything and everything is cool\nEverything is everything and everything is cool\n\n[Verse Two]:\nEverybody asks, \"X where can we find you?\"\nThe last three months I've been with Erykah Badu\nJust last week I saw some crochet pants\nAnd said, \"Damn. I'mma give these a chance.\"\nCan't even say I'mma do this for the fans\nCause all it seem like everybody wanna do is dance\nIt's like what your parents always said\nIf Soulja Boy jumped off of a bridge then we all would be dead\nI'm like, \"Do they hear what I hear?\"\nThinking on your own is just so last year\nSince when did life become so cheesy\nThat we gotta watch other people on TV\nThese fads are becoming outlandish\nAnd being fly is kinda Peter Pan-ish\nNo need to Panic\nI was just At The Disco and came up with something to get my hands in\nI took a break to let 'em breathe\nSeven said, \"You keep giving them crack, they gonna lose all of they teeth.\"\nBut I'm cool with that G\nCause that'll prevent all these broke MC's from biting me\n\n[Hook 2] (x4)\n\n[Verse Three]:\nNo lie, I did the whole fresh thing\nBut I did it before they even knew what fresh mean\nMy kicks crazy but I had to let go\nAnd rappers trying to be me retro is metro\nI'm sorry if I'm bitching like my prescription is estro\nI'm just tired of niggas fucking with my escrow\nGotta a problem? Let X know\nI run circles 'round square MCs, so let's go\nVending machine flow, you know that I'm gonna pop\nCause I shake 'em up, whenever I drop\nBut it's a New Era like the fitted on my knot\nAnd it's not really hip to listen to hip hop\nOn track/trek to be Star with nothing to cling on/Klingon\nNobody's making a stand, who can I lean on?\nPardon me if I seem gone\nIt just seems rap just turned into one big ring tone\n106 to Park, I can't play it yo\nAnd I turn to Captain Hook around radios\nBut I flow cause I know I'm better\nSo I'm back for vengeance like V For Vendetta\nLike that\n\nYou may wonder\n\"How you gonna write raps if you don't be up in the trap?\"\nYou may wonder\n\"Man I thought you'd get fresh, then where's your big chain at?\"\nYou may wonder\n\"What about your street cred? Homie didn't you go to school?\"\nAnd I just wonder\nWhy all these fools thing everything is cool?"}], "artist": "XV"}