{"songs": [{"image": "https://images.genius.com/72e0788bf9888110c8f963aa527a1c50.600x600x1.jpg", "title": "Dedication", "album": "Victory Lap", "year": "2018-02-13", "lyrics": "[Verse 1: Nipsey Hussle]\nLook, my nigga this is dedication, this is anti-hesitation\nThis a real nigga celebration\nThis a Dime Blocc declaration\n59th and 5th Ave, granny house with vanilla wafers\nThis the remedy, the separation\n2Pac of my generation, blue pill in the fuckin' Matrix\nRed rose in the gray pavement\nYoung black nigga trapped and he can't change it\nKnow he a genius, he just can't claim it\n'Cause they left him no platforms to explain it\nHe frustrated so he get faded\nBut deep down inside he know you can't fade him\nHow long should I stay dedicated?\nHow long 'til opportunity meet preparation?\nI need some real nigga reparations\n'Fore I run up in your bank just for recreation\n\n[Chorus: Nipsey Hussle]\nDedication, hard work plus patience\nThe sum of all my sacrifice, I'm done waitin'\nI'm done waitin', told you that I wasn't playin'\nNow you hear what I been sayin'\nDedication\nIt's dedication, look\n\n[Verse 2: Kendrick Lamar]\nI spent my whole life thinkin' out the box\nBoxin' homies three-on-one, got DP'ed but I ain't drop\nChirp on me, here I come, brrt, spin around the block\nThey blurped on me, said I ran a stop sign but that's a lie\nI spent my whole life starin' at the stage\nPlayin' Sega, daddy smokin' sherm, mama playin' spades\nCatchin' vapors, grandma said I'd get some Jordans for my grades\nThat's my baby, when she died my heart broke a hundred ways\nI spent my whole life tryna make it, tryna chase it\nThe cycle of a black man divided, tryna break it\nYou take a loss? Shit, don't cry about it, just embrace it\nMinor setback for major comeback, that's my favorite\nMy nigga L said, \"You do a song with Nip, K. Dot he a better Crip\"\nI said, \"He a man first, you hear the words out his lips\nAbout flourishing from the streets to black businesses?\"\nLevel four, yard livin', given to false imprisonment\nListen close, my nigga\nIt's bigger than deuces and fours, my nigga\nSince elementary we close, my nigga, yeah, straight like that\nI give you the game, go back to the turf and give it right back\nFor generations we been dealt bad hands with bad plans\nProve your dedication by hoppin' out Grand Am's\nI'm at the premiere politickin' with Top, Nip, and Snoop\nDamn, Pac watchin' the way we grew, from dedication\n\n[Interlude: Kendrick Lamar]\nIf it ain't congratulate then it look like hate\nIf it ain't congratulate then it look like what, Nipsey?\nHol' up\n\n[Verse 3: Nipsey Hussle]\nLook\nThis ain't entertainment, it's for niggas on the slave ship\nThese songs just the spirituals I swam against them waves with\nEnded up on shore to they amazement\nNow I hope the example I set's not contagious\nLock us behind gates but can't tame us\nUsed to be, \"Stay safe,\" now it's, \"Stay dangerous\"\n'Cause ain't no point in playin' defense, nigga\nThat's why I dove off the deep end, nigga, without a life jacket\nCouple mil', tour the world, dawg, my life crackin'\nCook the books, bring it back so it's no taxes\nRoyalties, publishing, plus I own masters\nI'll be damned if I slave for some white crackers\nI was mappin' this out, I hit the heist backwards\nHoppin' out the eighty-five in Reebok Classics\nRan a couple marathons just to get established\nTo make it happen, you got to have it\n\n[Chorus: Nipsey Hussle]\nDedication, hard work plus patience\nThe sum of all my sacrifice, I'm done waitin'\nI'm done waitin', told you that I wasn't playin'\nNow you hear what I been sayin'\nDedication\nIt's dedication"}], "artist": "Nipsey Hussle"}