{"songs": [{"title": "Lookin’ Down on ’em", "image": "https://images.genius.com/a9a54dbfff6e0f3a0b8143a1234a410e.498x493x1.jpg", "album": "Death Before Dishonor", "lyrics": "(Intro, 2 Pistols)\nYeahhh\nYoung boss of the city nigga\nBMU, Deck, C-bo, J-Flame, Young Ski\n\n(Hook)\nI got the Chevy sittin right\nRims shinin bright (Bitch I'm-Bitch I'm super fly)\nWhen I pull up to that light\nI'm lookin down on 'em (Eyyy eyyy)\nI'm lookin down on 'em (Wet-wet paint drippin)\nOff the side\nEvery time I ride\nI be ridin through the city, choppin like I'm Micheal Myers\nI'm lookin down on 'em (Eyyy eyyy)\nI'm lookin down on 'em (Eyyy eyyy)\n\n(verse 1, Deck)\nI just lit a blunt of 'dro\nWhere da bottle? I don't know\nI just flow to buddy suckers and my nickname UFO\nI got a super-duper flow\nArms shootin for the sky\nSteady chokin on that killa\nI just murdered Micheal Myers\nRidin past the city lights\nI maneuver through the night\nMovin colors, I got green and I got purp (M.U. got white)\nBMU bitch, get it right\nYou got nothin, but you da pain\nAll attention for you lames\nI got money on my brain\nFlashin in lanes\nSit so high bitch, they compare me to a crane\nDump so wet, got off and jumpin out the paint\nCome ride with me dawg, you better buy a skuba tank\nThe chrome is so strong\nThe paint is on all shine\nIf it creep through them clouds, them niggas gon' be blind\nAll I need is UV rays to put them hoes in a daze\nFlippin different flavors, bitch can just calls me Lay's\nC-bo dawg, aye!\n\n(Hook)\n\n(Verse 2, 2 Pistols)\nI pull up to the light, you know I'm ridin old school\nThe main four's lookin down, nigga where ya ruler? (So high)\nTwenty-eight inch deep-dish (Yes)\nOrange candy paint, baby call it Sunkist (Young boss)\nWho me? I'm just that nigga\nShe wanna ride with the boss cause my rims is bigger (Oh yeah)\nIf I don't look down, I won't even see you niggas (Where they at?)\nI don't even see you niggas\nI'm with a bad bitch fornicating\nWith her two friends, and they participating\nYeah that's just the life I live\nYoung boss of the city baby, it is what it is\n\n(Hook)\n\n(Verse 3, J-Flame & Young Ski)\nJizzy!\nI'm gettin money so, that's the word man\nI was fly with the white like Birdman (brdrdrdrdr)\nAye Khaled, I'm so hood (Hood)\nI shoulda been on \"I'm So Hood\"\nWiggle in the shop, I grip the Oak wood\nTwenty-six inches on I-O, what's good?\nI'm the man, understand?\nDeath before dishonor, that's the plan\n\n(Young Ski)\nI'm so fly bitch, I think I grow feathers\nMy cliques mob out, call us the \"Blues Brothers\"\nI'm sittin real high, them haters might stare\nI Freddy Crougar'd the whip, to give 'em nightmares\nPull up in somethin fly, oh that was light-year\nI spit a little game, cover your wife's ears\nI'm lookin down on her, call my whip papsmear\nThen they come out of this world, like William Shat-neer\n\n(Hook)", "year": null}], "artist": "2 Pistols"}