{"songs": [{"year": "2012-05-22", "lyrics": "[Chorus: Taylor Swift]\nI wish I was strong enough to lift not one but both of us\nSome day I will be strong enough to lift not one but both of us\n\n[Verse 1: B.o.B]\nUhh\nEver thought about losing it\nWhen your money’s all gone and you lose your whip\nYou might lose your grip when the landlord tell you that you due for rent\nAnd the grass so green on the other side\nMake a nigga wanna run straight through the fence\nOpen up the fridge 'bout 20 times\nBut you still can’t find no food in it\nThat’s foolishness\nAnd sometimes I wonder, why we care so much about the way we look\nAnd the way we talk and the way we act and the clothes we bought\nHow much that cost?\nDoes it even really matter?\n'Cause if life is a uphill battle\nBut y’all tryna climb with the same ol’ ladder\nIn the same boat, with the same ol’ paddle\nWhy so shallow? I’m just askin'\nWhat’s the pattern to the madness?\nEverybody ain’t a number one draft pick\nMost of us ain’t Hollywood actors\nBut if it’s all for one, and one for all\nThen maybe one day, we all could ball\nDo it one time for the underdogs\nSincerely yours, from one of y'all\n\n[Chorus: Taylor Swift]\nI wish I was strong enough to lift not one but both of us\nSome day I will be strong enough to lift not one but both of us\n\n[Verse 2: B.o.B]\nI could feel your pain, I could feel your struggle\nYou just wanna live, but everything's so low\nThat you could drown in a puddle\nThat’s why I gotta hold us up, yeah, hold us up\nFor all the times no one’s ever spoke for us\nTo every single time that they play this song\nYou can say that that’s what Bobby Ray wrote for us\nWhen the tides get too high\nAnd the sea up underneath gets so deep\nAnd you feel like you’re just another person\nGetting lost in the crowd, way up high in the nosebleeds\nUh, because we've both been there, both of us\nBut we still stand tall with our shoulders up\nAnd even though we always against the odds\nThese are the things that’ve molded us\nAnd if life hadn’t chosen us\nSometimes I wonder where I would've wound up\nCause if it was up to me, I’d make a new blueprint\nThen build it from the ground up, hey\nBut if it’s all for one, and one for all\nThen maybe one day, we all could ball\nDo it one time for the underdogs\nFrom Bobby Ray, to all of y’all\n\n[Chorus: Taylor Swift]\nI wish I was strong enough to lift not one but both of us\nSome day I will be strong enough to lift not one but both of us", "title": "Both of Us", "album": "Strange Clouds", "image": "https://images.rapgenius.com/26b89ac0cd8c179b2aeb27a1630f21e2.600x600x1.jpg"}], "artist": "B.o.B"}