{"artist": "A$AP Rocky", "songs": [{"title": "Bad Company", "image": "https://images.genius.com/642071f475f60e0a2e71b333b95da387.1000x1000x1.jpg", "album": "Madden NFL 19 Soundtrack", "lyrics": "[Intro: A$AP Rocky]\nPeople think you're stuck up, but we're all super good friends\nIt's only natural, I suppose, but we're all super good friends\nUm, I get the feeling that you're admired, but, um\nI'm above average\n\n[Chorus: A$AP Rocky]\nI got so much beef, I could barely sleep\nParanoia got me losin' all my Z's, all day\nGood lord, momma prayin' on her knees, all day\nIf you still frontin' when I up it, I'mma squeeze\n\n[Bridge: A$AP Rocky]\nBad company's bad for your company\nBad company's bad for your company\nMac and the ski mask in case you come for me\nGot the Mac and the ski mask in case you come for me\n\n[Verse 1: A$AP Rocky & BlocBoy JB]\nWhen I say I got beef, they don't want no beef\nWhen they say they got beef, they don't wanna eat\nIf he said he wants smoke, they don't want no steam\nShe put a V on her tee, bad bad bad bad bad\nHad a bachelors degree, Ph.D. while sellin' speed\nFix the face then fix the weave, now workin' on her self-esteem\nHit up Bloc (brrr), \"yo' this Flack, nigga, where you at?\nPin the drop, uh, my new map location be the block on the app\"\n\n[Interlude: BlockBoy JB]\nI need money and company, nah nah\nBad bitches, I don't even know the company, hahahaha\n\n[Verse 2: BlocBoy JB]\nYou—you—you can't hang baby, we don't want you 'round here\nI—ice on my neck and it's froze, Santa's reindeer\nY—you got bad bitches, hella hoes, i—i—it's the same here\nYou bad company, lil' bro, you can't hang here\nG—g—g—gettin' money so the bottles keep on comin'\nPh—ph—pho—pho—phone ringin' so you know the trap jumpin'\nTha—tha—that nigga lookin' at me, he owe me some money\nHit 'em with the Tommy, now that nigga crumpin'\nWhy—why these niggas playin' games? They don't want no problems with me\nMy shooters got good aim, you know I brought them shottas with me\nMight have hit a bad stain, they say that someone top was missin'\nThem niggas were opposition\nThey move wrong, so I shot them bitches\n\n[Verse 3: A$AP Rocky]\nDark shades, too much smoke, I could barely see the fumes\nActin' brand new like I don't see you when I do\nWho them folks? Who want smoke? You too close, give me room\nPhony folks, play it close, do the most, don't they?\n\n[Bridge: A$AP Rocky]\nBad company, that's bad for your company\nBad company, that's bad for your company\nMad cow disease, now you in a ton of beef\nBlack Mac tucked underneath my new blue dungarees\n\n[Verse 4: A$AP Rocky]\nFlintstone bust down, color Murakami\nFruity pebble bezel, Wilma, Betty, Fred, and Barney\nBad bitch from outta town, I think she model Abercrombie\nWrist game Lucky Charmy, told my jeweler Leprechaun me\nI'mma come clean, I got hella beef\nParanoia got me rollin' up my sleeves, okay\nNiggas hatin' cause I'm uppin' up the fees\nWhole team got V's on they tees, all day\n\n[Chorus: A$AP Rocky]\nI got so much beef, I could barely sleep\nParanoia got me losin' all my Z's, all day\nGood lord, momma prayin' on her knees, all day\nIf you still frontin' when I up it, I'ma squeeze\n\n[Outro: A$AP Rocky]\nI'm above average", "year": "2018-03-26"}]}