{"artist": "Vakill", "songs": [{"title": "Monstaz Ink", "year": null, "lyrics": "[Verse 1]\nMy name is legendary on all blocks, spitting fireball rocks\nBefore they call cops had bodies in walls and crawl spots\nHammers is all cocked\nSo many Makaveli mini-mes in the game, it's a fucking outbreak of small pox\nAnd beef is when everybody is not breathing\nSo body me not even\nEverybody is holding and probably not squeezing\nAnd last year niggas albums did more flopping then a Vlade Divac season\nShit I'm warning them flinch and the itching trigger finger is gon start forming a clench\nAnd you come that hot lead storm and you drenched\nMy flow as fury as the scorn of a bitch\nAnd you hot niggas ain't keeping shit warm but the bench\nI'm a beast in bed, check my dick head for triple sixes\nI'll hit a fat ass from the back until it ripples vicious\nGive titty nipples stitches\nI'm a pimp, pussy fall in my lap like a strip club full of clumsy crippled bitches\n\n[Interlude: Interviewer + Vakill]\nVakill, you just finished working on your new album, Worst Fears Confirmed\nThat's right\nWhat can we expect with this album?\nBasically, I stepped up my spittin'-game up, and it basically means, more fears for these garbage-ass niggas\n\n[Verse 2]\nThey say death comes in threes, but fuck it I'm feeling a fourth nut\nEjaculation until my scrotum shrivels and dwarfs up\nFrom getting brain and poo-nani from two mami's\nI'm tsunami with the spitting, you cartoon ass niggas is Toonami\nY'all faggots wish the champs lose but that ain't chips on y'all shoulders, switch your shampoos\nYour cosigning gangsta shit you can't prove\nThe hood won't take ya\nY'all print model spitting, got no flow but the shit looks good on paper\nSpit bars that will knock out whole alliances\nOut cold, y'all about the be outsold and client-less\nMouths closed in silence\nThis fear will smoke y'all asses faster than DMX's household appliances\nYou got no money and mo problems you backwards Frank White\nI shit on who you thinks nice for 'fore the eyes of the Lord can blink twice\nAin't a belt long enough to spank Christ\nAnd ain't shit sweet bitch, only suge' in my tanks knight\n\n[Interlude: Interviewer + Vakill]\nVakill, you spent a lot of time in the studio; who are you making this records for?\nEvery motherfuckin' American that think like me, do shit I do, and fuck the kind of bitches I fuck\n\n[Verse 3]\nNiggas asking, \"When is Va' gon' bling?\"\nOr, \"When is Vakill gon' establish himself as Chicago's king?\"\nIm dreaming bout a 10 Million a year gun cargo ring\nAnd the crown dont move, it goes where I go....scene\nFor decades hip hop been misusing the goal\nNow that bitch about to tear up and some tissues fin' to blow\nWho got issues with the flow?\nYou in XXL 'Step Yo Rap Game Up' section 12 issues in a row\nMatter of time til my shit classic soon\nAm I nice, how can you ask it spit burns acid wounds\nAnd run cemeteries outta casket room, yall gassed with fumes\nI go harder, wether a chrome nine or a plastic spoon\nIts simple I'm flyest, spit on graves to rekindle a fire\nAnd funeral directors is assembling choirs\nNo flows resemble Messiah's\nNiggas do not want it til a vest with a Superman symbols acquired, prior\n\n[Interlude: Interviewer + Vakill]\nDoes lifting weights improve your ability to rap?\nHell yeah, nig', 'cause you got a lot of scrawny motherfuckers out there, poppin' that commando shit, man, and ain't none of them got that fist-game—fuck all y'all", "album": "Worst Fears Confirmed", "image": "https://images.genius.com/c889b12ec78f38ef02a2008434b6f21d.967x968x1.jpg"}]}