{"artist": "Gangsta Boo", "songs": [{"title": "Chop Shop", "album": "Both Worlds *69", "year": null, "image": "https://images.genius.com/05275b2a5cae3f310f25e06511aa2191.400x400x1.jpg", "lyrics": "[Intro]\n\"Ay man, check this junt right here out, this junt cleaner than any man\"\n\"Ooh this junt bangin' dog\"\n\"Check these 20's out on this bitch\"\n\"Ooh wee where'd you get these thangs from?\"\n\"I got these junts today\"\n\"Ooh who the fuck is that?\"\n\"Ay my nig, you got change for a hundred my nigga?\"\n\"No i ain't got it.\"\n\"AY BITCH, GIMME THESE MUTHATFUCKIN KEYS, GIMME THE MUTHAFUCKIN KEYS HOE\"\n\"Ay man, you betta give him the muthafuckin' keys, he look serious\"\n\"BITCH YOU A BANANA, BITCH YOU GONNA GET PEELED\"\n\n[Verse I: Gangsta Boo]\nCall my nigga Project Pat\nDog I got them ends\nI need 20's, Navigation 500 Benz\nReal quick, can I flip the script?\nI wanna be clean nigga\nI wanna be seen nigga\nCome and make this cheese nigga\nI know where that nigga lay\nI know where that nigga stay\nI know you can get him cuz I fucked that boy the other day\nDon't forget to beep me twice when you get the prize\nI'll be sittin' here proud, waitin' for it tonight\n\n[Verse II: Project Pat]\nImma let the gun talk once I find where he limpin' (GB: Yuh)\nWar in the streets if I catch his ass slippin (GB: Yuh)\nHope when I ask for his shit, he start trippin' (GB: Yuh)\nBullets pop off, get his shit, then I'm dippin' (GB: Yo)\nTo ya chop shop cuz them cars you be flippin'\nImma get the one that'll fit yo description (GB: Right)\nMust be the boy who you said who was chicken\nHit you on the phone cuz this cheese I ain't missin'\n\n[Verse III: Gangsta Boo]\nMan look, I don't really talk on phones, they be tapped\nYou just make sure you get here and you get back\nI got you for a minute since you don't know where he stay\nWinchester, Kings Gate, first left driveway\nMan jack up if you have to smack up\nBring that Benz-o straight to me\nImma be relaxin' in my mansion like you got the key\nWhen I get the car, I'm gonna take it to the Chop CT\nHit me when you finished\nWhat's the business, are you diggin' me?\n\n[Verse IV: Project Pat]\nI do crime anywhere and escape like a demon\nSay what you want, for the cheese I'm your genie\nSaw the trick ridin' in his hood, lookin' cleanly\nBenz-o and AMG so Imma steal him\nNeva saw the jack move but it was meanly\nCaught him at the light, put the tone to his beamer (GB: Blah!)\nBlew his brains out by a d on the ceiling\nThings got a mess but I got away cleanly\n\n[Outro]\nPP: Boo mane, I got yo keys right here baby\nGB: Yo Gold Mouth, what the fuck is this!?\nPP: What's up?\nGB: Nah Pat, this the wrong car man!\nPP: It's the wrong car?\nGB: You hit the wrong nigga!\nPP: Whatchu talm bout man?\nGB: Man down, first\nPP: Man Boo, don't start that\nGB: Uh-uh man. First driveway, man\nPP: Don't start that\nGB: First left Kings Gate\nPP: Man look, give me seventy five-hundred\nGB: Hell nah. I can't give you shit for this. This the wrong car man, you done fucked up!\nPP: Give me seven thousand or sum man! I can't man, come on man, don't do me like that man! You trippin' mane!"}]}