{"artist": "Benzino", "songs": [{"lyrics": "[Intro]\nGet money, get that dough\nGet money, get that dough\nGet money, get that dough\nWhat, what, get that dough\nGet that dough, get that dough\nGet that dough, get that dough\nGet that dough, Figadoh\n\n[Busta Rhymes]\nRay Benzino.. Hangmen 3..\nBus-a-Bus.. M.O.P...\nWhat the fuck?\nLet's give it to ya\nYeah, what the fuck y'all want? (Ha ha ha)\nWhat the fuck y'all want? (Ha ha ha)\nWhat the fuck y'all want? (Ha ha ha)\nCome on (Ha ha ha)\n\n[Busta Rhymes]\nGuess who's comin through right now, bitch?\nTo smack you with the force to kill a fucking cow, bitch\nHunh, I told you not to fuck around, bitch\nFoul nigga, that's the way we gettin down, bitch\nYou shook faggot, I'ma keep you motherfuckers shaking\nAnd run around just like a crazy big foot Jamaican\nSee there's no mistaking, see you can never replace me, nigga\nThey think you alien, whippin shit like a hated nigga\nI wonder, wise guy trife and said to me\nWhat we be on and that we would have a recipe\nTalk, what they talkin bout rude boy?\nSome gully niggas up in the place, we comin through, boy\nThe news be tryin and run go report niggas\nThe way they do when immigration trt to deport niggas\nRay Benzino, Bus-a-Bus and M.O.P\nJust for the record - none of you niggas can fuck with me!\n\n[Chorus 2x w/ Busta Rhymes ad libs]\nFigadoh\nDoooooooooough\nFi-ga-doh, Figa-da-doh!\nFi-ga-doh, Figa-da-doh!\nYou know me, Figada-figada-figada\nGet that dough, Figada-doh\n\n[Benzino]\nMe and Bus-a-Bus breakin bread dough town\nFuck a bus - we private jet Motown\nBoston streets.. where I put my flow down\nHold up, you shakin it fast, bitch slow down\nBlaze shots for the gangster in me\nYou scared to carry heat, don't hang with me (Motherfucker)\nBig guns, no thang to me\nTop three is what I aim to be\nHunh, and what I rep.. mainly 3\nAin't no muthafucka spittin flames like me\nOriginal gon come, brew it up\nM.O.P. gon come, to rip it up\nWhen I reach, it ain't to greet you\nFuck your people, motherfucker pleased to meet you\nB-E-N-Z-I-N-O...\nThis the remix, Figadoh, bitch!\n\n[Chorus]\n\n[Lil' Fame]\n(Bom bom bom) F-I-Z-Z-Y dub O\nMack (Bingfield, B.K.) Oh!\nBring bitch out of the bubbs warrior style\nThrowing bricks, bottles and slugs (Get it on son!)\nI spit 8 bars and smack the fuck out the engineer before the songs done\nJust to make this shit more hotter\nSo tighten up your training wheels bitch...\nCause your fucking with a scholar\n\n[Billy Danze]\nWith this I step lively, talking to myself cause I'm mad\nWith a mack 10 to spin - back up nigga! (Back up nigga!)\nWatch out nigga.. (Watch out nigga!)\nI'm coming, mojo smokin, I ain't jokin faggot, I'm gunnin\nI ain't hear nothin, start runnin\nWhy you suprised, you a fucking with a man who got.. (Fire!)\nWith sides will.. (Fire!)\nAny nigga that want it, any nigga that front it, I pump one in his stomach\n\n[Chorus]", "image": "https://images.genius.com/2dc039a69f839e6cf2cd363179b68679.500x500x1.jpg", "year": null, "title": "Figadoh (Remix)", "album": "The Benzino Remix Project"}]}