{"songs": [{"title": "Fire in the Eye", "image": "https://images.genius.com/bc93d9a1f10bf994d92790c0d8a53c75.1000x1000x1.jpg", "lyrics": "* originally appeared on A League Of Our Own Vol. 2 compilation\n\n[Intro]\nBrother Ali. Rhymesayers Entertainment. Midwest. A League Of Our Own\nVolume 2 motherfucker. Fuck with me right now. Listen listen\n\n[Verse One]\nYou are now inside the brain of Americas best\nForrest Whittaker hungry, it's about to get ugly\nPolice with their arm extended can't touch me\nSmacked in the face is how this shit struck me like\nShowstopper\nA-L-I the Brother\nSince 89's the number\nAnd ain't tryin' to slumber\nRepresentin' for the birth pain of my mother\nAli like Rocky, I train in the gutter\nBut it ain't about the tunnel\nIt's the light at the end\nAnd we walkin' through life with a mic and a pen\nMentality is that of a cat who gon eat\nI grind till the sparks dance off the concrete\nStand close to me\nWatch me hopefully\nCause you're gonna see my gift open up the door for me\nThe last of a dying breed\nLive MC\nLook inside my eyes and see what's inside of me\n\n[Chorus: 2X]\nThe ock got the fire in the eye\nAll head turn when the brother walk by\nAnd you should know that when you got that little feelin' in your soul and you're cold\nAnd tonight you might die ahhhhh!\n\n[Verse Two]\nThe syllabus will be read aloud this evenin'\nWatch out now if you're too opposed to be in this\nOpen season\nYou should know not to walk nearby the cage when it's this close to feedin'\nHold your feet in the flame\nAli is the name\nYou'll be chantin' \"boom bye aye\" when you repeat it in vain\nHis beats are insane\nAnd you can ask any local wack rapper to show you where the teeth are ingrained\nEven my lazy eye got that fire in it\nWent from grindin' to shinin' and now sky's the limit\nThey do it every day without disguise or gimmick\nYour face look better when my fist grind up in it\nThis is the house that the Sayers build\nNow I use it as a return address when I pay my bills\nPain and guilt fill the pages up\nWe gonna ride till our days is up\nMotherfuckers say...\n\n[Chorus] - 2X", "year": null, "album": "Off the Record"}], "artist": "Brother Ali"}