{"artist": "Westside Gunn", "songs": [{"year": "2018-06-22", "lyrics": "[Bro A.A. Rashid]\nWe do not participate in attention seeking behaviour\n(La musica de Harry Fraud)\nWe don't seek to be saved, you see\nSock it to my motherfucking pocket\nYou understand what I'm talking about?\nI'm talking about that retail, you understand?\nNigga, straight up, you can wait on the stream all you want\nThe fuck around and Katrina your stream, boy\nYou heard?\nYeah, nigga, I told niggas\nThe true cryptocurrency is in this music, this renaissance\nAnd the physical aspects of what the retail market distinguishes\nBased on these fucking perfect arrangements, beautiful sound, and the art that accompanies it\nShit, praise God, praise Him\nThe first thing you gotta do is stop listening to bad music\nI don't listen to no fucking garbage music\nThe only type of music I listen to is this type of music right here\nYou understand what I'm saying?\nLet me tell you why, 'cause this has several factors involved, you see\nMan can be governed in four ways, you see\nYou govern people in four ways\nAnd you use words, and you use imagery\nAnd if none of that shit work, you pray for them niggas\nAnd if the prayers don't work, then, shit\nYou use God's hands, you understand?\nThat's the final means, and God is a force, you understand?\nAnd it's through man that God has access to this world, you understand me?\nSo God operates through what man perceives\nAnd this world is perfect\nWhat's imperfect are the ears listening to what's going on right now\nAnd all I hear is the stomps and the st-stamps and the hoofs and the\nAnd the musings of one trick ponies\nI done heard that shit they done did 17 times already\nI'm finished with that shit, you feel me?\nYour missus at home, the renaissance man, let me tell you something about renaissance periods\nThe renaissance is distinguished and admired by those who are the strivers, you understand?\nThe general populous is conceived and perceived to be a lumping group of ignorance\nThe renaissance spawned out of the pockets of those who embrace art, embrace arrangement\nWho embrace the process, you understand?\nAnd these are what makes perfection perceived\nBy those who are normal", "image": "https://images.genius.com/a8a5e42d4ec977626772d2df25f034c5.638x638x1.jpg", "album": "Supreme Blientele", "title": "AA Outro"}]}