{"songs": [{"title": "Rob Who", "album": "I’m a Hitta", "year": "2011-03-24", "image": "https://images.genius.com/2fba92a6c632077b99f5397ca22e81cd.500x500x1.jpg", "lyrics": "[Chorus: La Roux]\nI'm going in for the kill\nI'm doing it for a thrill\nI'm hoping you'll understand\nAnd I let go of my hand\n\n[Verse 1: Lil Reese]\nRob who? I'll clap you up, boy that's an easy kill\nEighteen, but I'll transform him like a pill\nI'm goin' hard, stomachache, bitch I need a meal\nThink I'm playin'? The whole Lam' gotta eat forreal\nWe get it poppin', you'd be surprised who up in the field\n300 tryna catch a body, call it Holyfield\nThe dour got me super focused, boy this shit ill\nI'm drinkin' Remy, no chaser, 'til I fuckin' spill\nI can't trust a soul, they ain't who they say they is\nNiggas is bitches, they'll snitch you to a hundred years\nA small circle, no new niggas, I ain't switchin' gears\nA body gettin' dropped every day, this shit real\nA lotta niggas say they real, they ain't really real\nA lotta bitches say they bad, they ain't really bad\nNiggas talkin' 'bout they cash, like what they had\nNiggas say they got that bag, man they wish they had (that bag!)\n\n[Chorus: La Roux]\nI'm going in for the kill\nI'm doing it for a thrill\nI'm hoping you'll understand\nAnd I let go of my hand\n\n[Verse 2: Lil Durk]\nRob who? I'll clap you up, now that's an easy kill\nOnly The Family in my eyes, and nigga it's a drill\nFire a slug, got him sizzlin' like he Emmett Till\nNiggas claim they in the streets, I'm out here for real\nCan't trust too many bitches, they be low-key and sneaky\nPillow talkin' to niggas, turned to be opposition\nNow he woofin' to bitches, why you woofin' these bitches?\nNow he sleepin' with fishes, two cups fucked up my vision\nAy Lil Moe, bro I miss you, after that I kept distance\nNobody tell me shit, you know that I won't listen\nIf I start, I'mma finish, to them I am a menace\nI got the 40 in his mouth like I'm a dentist\n\n[Chorus: La Roux]\nI'm going in for the kill\nI'm doing it for a thrill\nI'm hoping you'll understand\nAnd I let go of my hand"}], "artist": "Lil Reese"}