{"songs": [{"title": "It’s Real", "image": "https://images.genius.com/d40375efccd9d5ab669a4e37a3769327.410x410x1.jpg", "lyrics": "(Hook, sample)\nReason it's real\nKnowing the\nReason it's real\nKnowing the\nReason it's real\nKnowing the\nReason it's real\nKnowing the\nReason it's real\n\n\n(Verse 1, Brotha Lynch Hung)\nI put you up nigga, don't trip\nYou did your dirt for that mark\nAnd he left you in the dark\nSky-divin' in a bullet-proof parachute\nNo remorse, left you hangin\nEasy aimin, lock down shoot\nThe Glock sounds tootin\nOne minute til' I'm in it\nGot a business, still they ass to death\nAnd get my scrill up in the corner, none left\nShots out to my nigga in the pen\nDidn't switch, didn't act bitch\nTry to stop a nigga from gettin rich\nYou could dig a ditch, but you won't find shit\nLeft you in flames, kept the roach\nYou can smell the shit when I approach\nI be off that stanky sack of indo-nesia\nIt's a evidential\nI leave you hungry, eat yo cheese up\nHeard you was sweet, like a Almond Joy\nAnd I know you heard of me\nCause I'm a West-Coast Bad Boy\nAnd I'm a sick nigga, \"Sicc made!\"\nIt gets real as I pull the pin out this grenade!\n\"Body Parts\" like the movie\nOld school Uzi\nRip yo arms out from the elbows\nNigga I smell those green leaves\nThe six thieves\nA twenty-sack of green weed is all I need\nI make you bleed, I take yo cream\nI know you got it from the \"Ice Cream Man\"\nBefore you make that transaction\nI need the cash in my hand\nAnd if you don't, we can do the murder-man dance\nUnder any circumstance, I'ma have yo hands\n\n(Hook)\n\n(Verse 2, Master P)\nBrotha Lynch, I'ma make you a deal you can't refuse\nMy phone tapped\nThe new code for halfs and wholes is t-shirts and tennis-shoes\nFrom the yay, I got the sneakers\nSixty-five for a shoe nigga, if you got the tweakers\nMeet me down-south, New Orleans we bumpin\nI get this bitch jumpin, you got the money\nI got the g's, flip the ki's, and the o-z's\nWe could blow some weed\nAnd talk about this shit smokin some trees\nBut watch yo back, keep yo handle bar cocked\nToo many Federal Agents pretend to be hustlers, but really cops\nSend it across the border, nigga like Taco Bell\nPut it in a plane, a boat, UPS, nigga I could get it there\nI'm surrounded by cocktails, I mean hoes in mini-skirts\nAin't no free dick out here, it's time to put in work\nPut these hoes on a Greyhound, fool if it's goin down\nAnd make 'em bring it back, from my hood, to your town\nAnd it's all good, nigga it's like wax\nAnd we could slang these records like motherfuckin crack\nAnd if they bumpin, we gotta keep 'em jumpin\nCause it's all about the cheddar, the cheese, and the money\n\n(Hook)\n\n(Verse 3, Mr. Serv-On)\nA criminal tatted front-to-back\nAlways 'bout my jack\nDoin a dope-deal, forget to bring yo strap\nLet it be fact, I blast first\nI know no nigga that smart in a hearse\nWho cursed, my dope and money life\nA Eagle with blood stains in the scope\nBe my wife, live yo life\nTil' death do us part\nStart my gangsta bounce\nThirty-six ounce, to a ki\nGot this T-O-D in ya face\nNow tell me the fuck else you got free\nA thousand pounds of that skunk\nReady to jump, smokin everything I can, huh\nMaster P, and Brotha Lynch Hung\nLet me serve some dick to these niggas with they tongues out\nEighty-five in the south\nTwenty-four in the east\nSee my scrilla, blow like yeast\nCross my fingers, pull my wife\nIt's hot tonight\nA murder case, got away with a hundred g's\nAnd a couple of wild geese, headed west\nCapiche?\nA hundred clunkers waitin my arrival\nDirty... survival\n\n(Hook, to fade)", "year": null, "album": "Appearances: Book 1"}], "artist": "Brotha Lynch Hung"}