{"songs": [{"lyrics": "[Intro]\nAye! Public service a mothafuckin’ announcement!\nBroke niggas in the back, rich niggas in the front!\n\n[Hook]\nFrom the D to the mothafuckin’ M, real rap shit\nBitches poppin’ pussy in a bando, on a mattress\nCame up by myself, he say I’m lucky like a backflip\nNiggas from Miami spend that money, I'ma tax you\nYou ever seen a real bitch that rub your nuts and hold a Mac clip\nI swear these bitches weaker than they braids, I'ma snatch them\nPop out with that Louie on my feet, designer tacky\nHop out with that sticky, it was reekin’ like some cat piss\n\n[Verse 1]\nBoy you a rookie, eat the cookie, tell me how it taste\nI spend like 40 on my bitches, times was rough, we had to pray\nNiggas all up in my ear, just for that bag I had to wait\nI put bitches on they feet, cut down the grass and saw a snake\nUp in Florida, pussy water, fuck with ballers, Sean Carter\nFuck a trend, I’m a starter, wanna be me, you my daughter\nBuy me Gucci for that nut, rode his face just like a truck\nAnd if he say he put me on, that nigga lying add it up\nIf I turn into a freak, you got to show me where that good dope\nQuarter ki wrapped in that plastic like I’m rolling frontos\nYour nigga ain’t my mans, sweat them bitches like a fan\nGet rich was up in the plan, they watching like on demand\nDallas girls love a nigga who will slap up a bitch\nBuy a doll designer daddy, we gon' fuck in the whip\nCame twice, it was good, still ain’t loving the dick\nHe the type to get finessed, still ain’t loving the trick\n\n[Refrain]\nCan he match these bands or can he match this whip?\nI put bitches in they place and I make bitch niggas drip\nCan he match these bands or can he match this whip?\nFinesse a nigga for that bag, and take my bitches on trips\n\n[Hook]\nFrom the D to the mothafuckin’ M, real rap shit\nBitches poppin’ pussy in a bando, on a mattress\nCame up by myself, he say I’m lucky like a backflip\nNiggas from Miami spend that money, I'ma tax you\nYou ever seen a real bitch that rub your nuts and hold a Mac clip\nI swear these bitches weaker than they braids, I'ma snatch them\nPop out with that Louie on my feet, designer tacky\nHop out with that sticky, it was reekin’ like some cat piss\n\n[Verse 2]\nI got fifty, nothing shorter, pop that pussy, Travis Potter\nAll this money, like a hoarder, boy you broke, you out of order\nLet it drip just like a faucet, want my number? It’s gon cost you\nAll these diamonds around my neck and on my face could start an auction\nHood niggas, they some freaks, a hundred k up in these streets\nMake your nigga lick my feet, steak and shrimp we like to eat\nThese bitches ain’t my friends, these hoes act like fans\nGet rich the best revenge, Asian with it, no pretend\nIn your feelings like a bitch, niggas lying on they dick\nI be sliding on your bitch, I put that iron on her wig\nIf you want it we got smoke, Twin tookas let it blow\nPut that boy up onna scope, rearrange your fucking nose\n\n[Refrain]\nCan he match these bands or can he match this whip?\nFinesse a nigga for that bag, and take my bitches on trips\nCan he match these bands or can he match this whip?\nFinesse a nigga for that bag, and take my bitches on trips\n\n[Outro]\nGang!", "album": "Doll Szn", "year": "2018-05-04", "title": "Miami", "image": "https://images.genius.com/30dd3a8bdc3a5a5e3492c52a90ce804a.1000x1000x1.jpg"}], "artist": "Asian Da Brat"}