{"songs": [{"year": "2011-10-14", "album": "The Nebulizer", "image": "https://images.genius.com/108c1549cb9fa7e49685238b78f6936d.600x600x1.jpg", "title": "Magic Trick", "lyrics": "[Intro]\nOi, I'll show you a magic trick, ready?\nWhere the fuck did that go, cunt?\n\n[Verse 1]\nNobody's touchin' my drink tonight\nIf I haven't had a drink, better pinch me twice\nThat shit ain't right and I take it serious\nQuarter past nine AM, I'm here for this\nNice drink with a tablet too\nI'm forgettin' all the shit that I have to do\nNow I’m walkin' down the street with a hatchet too\nAnd an axe and a shiv in the backpack, ooh\nSmooth as but my eyes are bloodshot\nCan't it be 'cause I'm high as fuck, what?\nDrunk too, fuck you and your punk crew\nTalkin' on my bottle like “man, I fuckin' love you”\nSaw the gronk lad, I’m havin' some fun\nNo money, walk in, then I grab it and run\nOther rappers go and make a song for the piss\nI'm in a bad mood, I see you, you're coppin' a shiv\n\n[Hook]\nAbracadabra, got a magic trick (yeah)\nTouch my drink and I'll slap you bitch (ha)\nTouch my drink and I'll stab you quick (come on)\nIt's a bad habit and I have to admit\nAbracadabra, got a magic trick (yeah)\nTouch my drink and I'll slap you bitch (ha)\nTouch my drink and I'll stab you quick (come on)\nIt's a bad habit and I have to admit (let's go)\n\n[Verse 2]\nJumped up, poured a mix\nGot a homeless fuck [?] shit\nI forgot a little bit but I snort a stick\nBeat a chat fuck with his own walkin' stick\nI could have a bitch drink like a Vodka Cruiser\n(Why?) 'Cause of the vodka loser\nThis ain't a track for you to go party to\nIt's a track for me to drink more [?] to\nKnock at me door, I bet it's me friends\n(Who's that? It's me) You got a Jim Beam ten?\nI'll lock the fuckin' door unless you do\n\"Are you fuckin' serious?\" Yes, it's true\n(Come here [?]) Nah, I can't hear you\nGonna lock the door, come back with a beer dude\nGreedy cunt but what? I'm addicted\nOne dirty habit that I'm never gonna get bitch\n\n[Hook]\nAbracadabra, got a magic trick (yeah)\nTouch my drink and I'll slap you bitch (ha)\nTouch my drink and I'll stab you quick (come on)\nIt's a bad habit and I have to admit\nAbracadabra, got a magic trick (yeah)\nTouch my drink and I'll slap you bitch (ha)\nTouch my drink and I'll stab you quick (come on)\nIt's a bad habit and I have to admit (let's go)\n\n[Verse 3]\nPeople hate me when I get pissed\nThat's okay 'cause they gonna get shived\nI'm a nice guy, I'm a nice g—\nNo I'm not, okay, that's a white lie\nI settle down because I'm losing control\nI gotta behave man, gotta do what I'm told\nGotta be a good man, gotta move when I’m told\nBut then I went and seen the fuckin' cue for the doll\nWhat the fuck this shit? Now I pull out a knife\nGrab the Centrelink bitch and I put it in twice\nEverybody's screamin' \"Don't stab her, no!\"\nSo I grab that bitch and I stab her throat\nWalk back to the desk, normal as fuck\nHere's my form, two fortnights, yep, that's a month\nLeave the scene now cunt, I'm needin' a drink\nI guess we all know where I'll be in a week\n\n[Hook]\nAbracadabra, got a magic trick (yeah)\nTouch my drink and I'll slap you bitch (ha)\nTouch my drink and I'll stab you quick (come on)\nIt's a bad habit and I have to admit\nAbracadabra, got a magic trick (yeah)\nTouch my drink and I'll slap you bitch (ha)\nTouch my drink and I'll stab you quick (come on)\nIt's a bad habit and I have to admit (let's go)\nAbracadabra, got a magic trick (yeah)\nTouch my drink and I'll slap you bitch (yeah)\nTouch my drink and I'll stab you quick (yeah)\nIt's a bad habit and I have to admit (let's go)\nAbracadabra, got a magic trick (yeah)\nTouch my drink and I'll slap you bitch (ha)\nTouch my drink and I'll stab you quick\nIt's a bad habit and I have to admit (ha)\n\n[Outro]\nYeah\nAfter all that shit\nI went and gave me form to Cheryl\nPut it through\nSo my pay goes in tomorrow\nAnd um, you might not see me for a bit\n'Cause I’m on a holiday\nFuck yous, ha!"}], "artist": "Kerser"}