{"songs": [{"image": "https://images.genius.com/44a8be97aef4cdd5114bd6cec02b2357.1000x1000x1.png", "title": "Catch Me", "album": "Pink Friday", "year": "2010-11-22", "lyrics": "[Verse 1]\nExtracurricular, parallel to none, I am perpendicular\nHit 'em with the, oh-now-that's-just-ridiculous!\nWe could've cleared up all these particulars\nThat could have been the homicide, vehicular\nYou wasn't in no state to speed off\nYou was buggin' out, yeah, you was peed off\nWe was just chillin', up at the ski loft\nThinkin' we was on, you tellin' me we off\nYour whole vibe changed, when you got that phone call\nThat's the effect, they call a snow ball\nNext thing you know, I was runnin' down the hall\nSayin' \"Please come back, I have given my all!\"\nI have given my all\nIt's funny, how you could always make me feel small\nI have given my all\nCatch me, catch me, I think I'm gon' fall\n\n[Hook]\nMy mind is made up, I'm waitin' for you\nI'm waitin' on you, waitin' boy\nMy mind is set, I'm waitin' on you\nI'm waitin' for you, waitin' boy\nCould you catch me? Could you catch me?\nCould you catch me? I am waitin' on you to catch me\n\n[Verse 2]\nYou wanted oh so bad to prove points\nBut your game always makes me lose points\nAnd your game always makes me concur\nAnd maybe I should have never, taken you from her\nBut, with all of the aforementioned, I am still trapped, in your dimension\nSo I will be on the mountain waitin', 'cause I am in need, of more attention\nCould've called back, just to say somethin'\nI'mma fall back in the bass drum\nPlease come to destination, I'm not doing well, exclamation!\nYou succeeded at your attempts to make me -\nNeed you desperately, to vindicate me\nIt's funny, how you could always make me feel small\nI have given my all, catch me, catch me, I think I'm gon' fall\n\n[Hook]\nMy mind is made up, I'm waitin' for you\nI'm waitin' on you, waitin' boy\nMy mind is set, I'm waitin' on you\nI'm waitin' for you, waitin' boy\nCould you catch me? Could you catch me?\nCould you catch me? I am waitin' on you to catch me\n\n[Bridge]\nOkay!\nOh, oh, oh, okay!\nOh, oh, oh, okay!\nIt's, it's whatever you say, ay, ay\nIt's whatever you say, ay, ay\nI am at your disposal\n\n[Hook]\nMy mind is made up, I'm waitin' for you\nI'm waitin' on you, waitin' boy\nMy mind is set, I'm waitin' on you\nI'm waitin' for you, waitin' boy\nCould you catch me? Could you catch me?\nCould you catch me? I am waitin' on you to catch me"}], "artist": "Nicki Minaj"}