{"songs": [{"album": null, "year": "2018-01-25", "title": "My Name Is (Freestyle)", "image": "https://images.genius.com/16421d7eeb8ba0f80a42e41d87803e7e.500x500x1.jpg", "lyrics": "[Intro]\nMay I have your attention please\nMy name is, what? My name is, who? chka-chka\nYeah\n\n[Chorus]\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nJ.I.D, yeah\n\n[Verse 1]\nHi kids, wanna know what I did?\nI do drugs, get drunk and promote violence\nEverywhere I go I take my gun, even churches\nOpen carry in Georgia so save me a seat in circus\nFuck takin' Dylan Roof to jail, you should bring him to me and my niggas\nOn God there won't be a homicide\nWe'll keep him alive, give me four days, maybe even five\nJust from Monday to Friday, I promise he'll cooperate\nWe'll snatch out one of his eyes, make it look him in his eye\nThen scalp shave, then use his hide for black pride\nI guess you would think I'm tryna incite a race riot, but naw\nI like white people, I hate that guy\nI never understood the mind of a person that wanna murder\nAnd hurt people who tryna make a change and do good\nIf he wanted real war, he shoulda went to the hood\nI would have felt better about it, I just had to acknowledge it, but\n\n[Chorus]\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHI, My name is, what? My name is, who?\nJ.I.D\n\n[Verse 2]\nMy English teacher called me nigga like in Junior High\nThanks a lot, I'll use this word the rest of my life\nMy nigga this, my nigga that, dawg where my niggas at?\nDamn don't make me kill a nigga, god bring my nigga back\nUse it in the wrong context can get a nigga smacked\nLittle-bitty bullet make a skinny nigga fat\nWait, Bonjour my shitty amour, where your nigga at?\nWork? Ok, cool. Get drunk? Where the liquor at?\nBasically, what I'm sayin' girls and guys are piranhas\nMy dawg, hit a chick raw, and caught the gonor-Rihanna\nI just combine in a word because she was fine as Rihanna\nNot sayin' nothin' about Rihanna, oh I'm sorry Rihanna\nI ain't slept in 20 days, I'm a zombie lil' mama\nI'm tryna pay attention this much for fuckin' insomnia\nI'm cardinal, carnivore, hard as hard-on\nA tryna be good and God on my side\nI ain't vulnerable, it's the honorable\n\n[Chorus]\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHi, My name is, what? My name is, who?\nMy name is, chka-chka J.I.D baby\nHI, My name is, what? My name is, who?\nJ.I.D"}], "artist": "JID"}