{"songs": [{"title": "World’s War", "lyrics": "[Intro]\nThe world's war\n1884\nHistory\n\n[Chorus]\nHistory is written by the winners, true\nSometimes though heroes are of another hue\nAnother religion, another point of view\nAre they remembered at all? By who?\n\n[Verse 1]\nThe world's war, 1884\nScramble for Africa, height of imperial force\nEuropean armies go and conquer the globe\nWith a gentleman's agreement to not kill off their own\nSo, massacres in the Congo\nAll the dead are Amritsar, ain't nothing wrong though\nSome are less dead than others, you know why?\nIt's the same in the grave as it is in this life\nThe lower grade races, subject people\nHave a different heaven and hell, there's less people\nIn the same way, we choose to remember\nWho to lionise and who to forget all together\nNot based upon the sacrifice that they made\nBut upon the prejudices of the time and the place\nSo, Chinese workers on the Western Front\nThat dug trenches and then filled in the graves\nAnd made their way\nCarving engravings on shell casings\nFade from the story as we tell it today\nAnd gas, made its way across the battlefield\nChoking North Africans fighting for France\nThey were French enough to die for the flag\nBut reconcile with history, it seems that we can't\nThe process of forgetting started at the beginning\nCos of the discomfort of who it was that was winning\n\n[Chorus]\nHistory is written by the winners, true\nSometimes though heroes are of another hue\nAnother religion, another point of view\nAre they remembered at all? By who?\nHistory is written by the winners, true\nSometimes though heroes are of another hue\nAnother religion, another point of view\nAre they remembered at all? By who?\n\n[Verse 2]\nWhen you have an empire of inferior creatures\nWhat happens when you need them to die like real people?\nThrough the training, and the sacrifice\nMight end up believing they are equal\nGo back to the land of the savages, unwilling\nFor subordination for people that they were killing\nQuickly they erased them\nUnmarked graved them\nDisavowed them of any idea that things were changing\nThe wrong people that fought for the British flag\nWere not invited to the victory parade\nDid the same work, fought in the same war\nNever got the same bonus when Armistice Day came\nBlack Americans, in segregated units\nWith German POWs treated better than them\nGo back to America, Jim Crow and lynching\nThat would greet them when the war ends\nRed Summer, Red Summer\nDomestic terrorism put them back in their place\nVigilante mobs, Klan and the police\nCollaborate while the state look the other way\nLiverpool and Cardiff, Barry, London and Glasgow\nAfter the war, similar terrorism\nWar broke hierarchy, supposed to be eternal\nAnd for that, it could never be forgiven\n\n[Chorus]\nHistory is written by the winners, true\nSometimes though heroes are of another hue\nAnother religion, another point of view\nAre they remembered at all? By who?\nHistory is written by the winners, true\nSometimes though heroes are of another hue\nAnother religion, another point of view\nAre they remembered at all? By who?", "year": "2018-10-24", "album": null, "image": "https://images.genius.com/3222ca5815132f2ac56b73bacb186bf1.1000x672x1.jpg"}], "artist": "Akala"}