{"songs": [{"year": null, "image": "https://images.genius.com/69a36be14d6ea4a081e8b94ff44cbc4e.994x994x1.jpg", "title": "Ain’t Nuttin’ Changed", "album": "Tha Blaqprint", "lyrics": "[Hook x2]\n[Akon Samples: \"Blaq Poet\"]\n(When I come to the hood)\nYou know what's poppin'\n(Ain't nuttin changed)\nYou know what's on\n\n(When I come to the hood)\n\n[Verse 1]\nIt's like woooo-aaahhh!\nAin't nuttin' changed 'Po whatchu gonna do man?\nWe still gettin' money, bitches still actin' funny\nThey wanna hold somethin, can't get shit from me\nI'm back on the block, passin' the rock\nGot my young squad, you don't want 'em bastards to pop\nRhyme veteran ready to get it in\nWay before fif I was hated by many men\nWhen I come to the hood, you know I'm creepin'\nLeave you leakin', missiles heat seekin'\nNuttin' to talk about, fo' pound in your mouth\nNew York in the house, I dare you to walk it out\nStraight menace, fight to the finish\nNiggas get demolished, diminished I mean business\nMillionaire rappers still wanna envy me\nThey wish they was mini-me, I'm sick on any beat\n\n[Hook x2]\n\n[Verse 2]\nNiggas need those\nI'm on a hill, where all the fiends go\nBig bottle of yack, the big gat\nNiggas fall back, I got the biggest crap\nAnd when it's time to go, I go hard\nFuck the police they got a job, I got a job\nAin't nuttin' changed, except the weather\nExcept the chedda, except a nigga got betta\nAfter all these years and all these beers\nI got niggas still running in fear, why?\nI ain't killin' nuttin', I ain't lettin' nuttin' die\nNiggas know the repercussions if they fucking try\nShine up, stand up and a puffy eye\nBesides that? Blaq Poet, a lovely guy\nRun around have fun in the hood\nGet love from my thuns when I come in the hood\n\n[Hook]\n\n[Verse 3]\nAin't nuttin' changed\nNiggas still pumping the rain\nThings still come from the train\nStill gotta tell them mothafuckas no change\nNiggas still on the block, holdin' em thangs\nSome disappeared like motherfucking Blaine\nSome got hang, some comin' home, some in the zone\nThey all can't wait 'til I tell 'em that it's on\nBlaq Poet army across New York\nYa'll niggas don't even talk, You done prim with a fork\nScrewball disciples get at you\nNiggas don't like you, baseball bat you\nOr sit up on a roof, and snipe you\nMiles away, 50 cal rifle\nA real gangsta is good in any hood\nA real goon comin' soon to your hood\n\n[Hook]"}], "artist": "Blaq Poet"}