{"songs": [{"album": null, "image": "https://images.genius.com/6efed4f2f043ca2d708512a157481569.720x720x1.jpg", "year": null, "title": "Dig That", "lyrics": "Yeah uh\nNappy boy\n\nAhh man\n(Sigh)\nAye, i know u think its gonna take 4 niggas star to respect\nThe blood and the tears and the sweat\nAnd still don't ferget where the so called ideas came from\nOr who they call for ideas when they ain't none\n\nWho carry them on there shoulders when they can't run\nIts hard work when u find out it ain't fun\nBut hard work will turn a man into a bitch\nBut hard work ain't shit compared to hard dicks, So\n\nAin't nobody fuck with me, im unfuckwitable\nRecord labels hit the ground when i hit the doe\nThey say we need a first single for Mr. so and so\nAnd Mrs. bitch over here don't even know where to go\n\nSince everybody need directions\nI put out the mix tape so listen to my lecture\nI bet cha\nI tell you that the game is just a game its not hard\n\nUp down, Up down, A.b. star\nYou go R-e-s-p-e-c-t T me T p Tallahassee Florida\nAnd if somebody don't got me what i need and i need to see everything else in order\nIn order for me to see me being what i need to be then somebody else gone be much less\n\nDig that\nUntil then imma spit the real end of it\nOtherwise fuck it\nDig that\n\nYeah, these swat niggas wanna make me be outtie\nSo i bought me a outtie\nCuz when i get the rest, i go and get a whip\nAnd the only challenger i got is still at the Dodge dealership, damn\n\nYou nigga's ain't feeling me yet\nHe in here for crazy ass for that T-pain affect\nAnd T-pain and shit\nTo step on a nigga toes\n\nBut my nigga's been known to fuck with 'A' nigga holes\nCan't stand the heat then get the fuck up the restraunt\nI make the niggas feel low\nSomebody get the blunt\n\nSomebbody get this kinda Tapon quick\nI'm throwin tricks at these tricks\nIm on my 'And 1' shit\nTallahassee Gold Trauter\n\nReady like rambo\nGet the fast cash a hard lass in the lambo\nIts nothing but a game its not hard\nUp down, up down, A.B. star\n\nYou go R-e-s-p-e-c-t T-Me T-P Tallahassee Florida\nAnd if somebody dont got me what i need and i need to see everything else in order\nIn order for me to see me being what i need to be then somebody else gone be much less\nDig that\n\nUntil then imma spit the real end of it\nOtherwise fuck it\nDig that\n\nThis right here is the Nappy Boy family\nSouthside chase entertainment\nMike Blunsty whats up\nDang whats up\nRocko whats good\n\nI got rebels in for my Nappy Boy family\nOne time Tay Dizm\nOne time of Sophia Fresh\nYoung Cash\n\nOne time i done R.B.L\nResazuter my nigga\nOne time a day\nOh we boutta do it big this year\nThis is a big movment\n\nExclusive Jay went hard this time\nNappy boy!"}], "artist": "T-Pain"}