{"songs": [{"year": "2018-09-24", "album": "Luca Brasi 3", "image": "https://images.genius.com/e0c3b11380e12f309db06e2b657490ba.750x750x1.jpg", "title": "Adding Up", "lyrics": "[Intro]\nMy dog in this bitch (Luca Brasi)\nMy bad, dawg\nYeah\nGo an' line 'em up, yeah\nYou know, man, I'm sorry\nLet 'em do it while I'm doin' my verse, fuck it\nThen after that, we can do it, you know, what up?\nHuh, me? Yeah, record all this, fuck it\n\n[Pre-Chorus]\nOh, he say he thuggin', well that shit ain't addin' up (Shit ain't addin' up)\nI'ma keep on flexin' 'cause these niggas ain't man enough (I'm doin' it)\nBitch, I'm never goin' broke, shit, my money keep addin' up\nI'ma keep on thumbin' through hunnids, I count money fast as fuck, uh\n\n[Chorus]\nOne mil', two mil', uh, I'ma keep addin' up\nThree mil', four mil', uh, I'ma keep stackin' up\nFive mil', six mil', uh, I'ma keep addin' up (Add it up)\nSeven mil', eight mil', uh, money keep addin' up (Add it up)\n\n[Verse 1]\nAy, pressure my motive (Motive)\nI'm thumbin' through something, we blew out the motor\nI jump in the bucket, dress up like a woman (Come here bitch)\nI jump out and bust it in front of the Kroger\nTried to hold on to the holy approach, play for keeps, you gotta know it's approachin'\nHit a sweep, took a lot of my homies, couldn't sleep, Julio, he the closest\nBrought the Range out, whippin' the Rover, puttin' change out, nigga, you know it\nDon't change now, I'ma stay focused, just notice, but try not to notice\nBig load, bring a pack to the show, we back now, bringin' it back\nCountin' good, my thinkin' intact, I'm hood, I perfected a craft\nThis means I can see through the glass, SS with a digital dash\nWith a turbo, goin' launch mode, doin' circles, still hittin' the gas\nI signed for a brick and a half, touchdown to a milli in cash\nI'm in the vet, I'm gettin' neck from a giraffe and I pray to God that we don't crash\nYeah, oh\n\n[Pre-Chorus]\nOh, he say he thuggin', well that shit ain't addin' up (Shit ain't addin' up)\nI'ma keep on flexin' 'cause these niggas ain't man enough (I'm doin' it)\nBitch, I'm never goin' broke, shit, my money keep addin' up\nI'ma keep on thumbin' through hunnids, I count money fast as fuck, uh (Gates)\n\n[Chorus]\nOne mil', two mil', uh, I'ma keep addin' up (Gates, Gates)\nThree mil', four mil', uh, I'ma keep stackin' up (Add it up)\nFive mil', six mil', uh, I'ma keep addin' up (Gates, Gates)\nSeven mil', eight mil', uh, money keep addin' up (Gates, Gates)\n\n[Verse 2]\nNow we back talkin', got out my feelings\nChalk nine, engine got reassembled (Do you, Gates)\nGlock 9, throwin' that in the blender\nDo I gotta mention I'm in the kitchen? (I'm in this bitch)\nDo I gotta mention, I don't deliver\nEx-girlfriend, I don't remember (Do you, Gates)\nEx-boyfriend, she don't consider\nGoddamn, hmm, I get the picture\nVacuum seal one, lower the ticket\nVacuum seal numb, I'm 'bout to kill it\nGet mad, bitch niggas ability\nDrop racks, offender a cynic\n'Bout to sit down, talk with the city\nFree my big round, lower the sentence\nDick a bitch down, holdin' her titties\nMeanwhile, while controllin' the seatin'\nNeed help now, loan you a penny\nStayed down, would've gave you a ticket\nBig feet, bitch, why is you trippin'?\nDon't get loud, talk with a whisper\nWhen you see me, you know I be glistenin'\nLil sneak peak, you know I be listenin'\nSound upset, why is you dissin'?\nI'ma tap somethin', make them come get you\n\n[Pre-Chorus]\nOh, he say he thuggin', well that shit ain't addin' up (Shit ain't addin' up)\nI'ma keep on flexin' 'cause these niggas ain't man enough (I'm doin' it)\nBitch, I'm never goin' broke, shit, my money keep addin' up\nI'ma keep on thumbin' through hunnids, I count money fast as fuck, uh\n\n[Chorus]\nOne mil', two mil', uh, I'ma keep addin' up (Gates, Gates)\nThree mil', four mil', uh, I'ma keep stackin' up (Add it up)\nFive mil', six mil', uh, I'ma keep addin' up (Add it up)\nSeven mil', eight mil', uh, money keep addin' up (Add it up)\n\n[Outro]\nSay, Gates, what's happenin'?\nThe fuck, dawg, I mean, you love this nigga, dawg?\nI just keep addin' up, dawg, lemme show him\nYou know, I just keep addin' up, you know what I'm sayin', What up?\nLemme show him, I'm, huh, I'm him\nWassup?\nLuca Brasi"}], "artist": "Kevin Gates"}