{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/bff1176ed6deb6d256cc9e04734b0136.365x365x1.jpg", "title": "Clear!", "lyrics": "Clear, Clear, Clear, Clear\nPeople on the left, Clear\nPeople on the right, Clear\nFellas on the left, Clear\nLadies on the right, Clear, Clear\n(Hey hey hey) Clear, (hey hey hey) Clear\n(hey hey hey) Clear, (hey hey hey) Clear\n(hey hey hey) Clear, (hey hey hey) Clear\n(hey hey hey) Clear, (hey hey) Clear Clear\n\n[Verse 1]\nIt's like I waited my whole life just to come set this off\nWe in the middle of the game all bets is off\nAnd now we killin' this movin in the best of cloth\nAnd now hard to get girls come extra soft\nWe need an extra loft for all the people in here\nAnd I be chillin' with the villains like a millionaire\nYo killin each and every city bottle up in the air\nCelebratin' how we made it haters get it in the rear (we gone)\n\n[Hook:]\n\nYo are you really ready, Clear\nPeople I wanna know yo if u really ready, Clear\nTell me if you ready (ready) ready (ready) Clear\nEverybody get ready to party get \"clear\" Clear\n\nPeople on the left, Clear\nPeople on the right, Clear\nFellas on the left, Clear\nLadies on the right, Clear, Clear\n(Hey hey hey) Clear, (hey hey hey) Clear\n(hey hey hey) Clear, (hey hey hey) Clear\n(hey hey hey) Clear, (hey hey hey) Clear\n(hey hey hey) Clear, (hey hey) Clear Clear\n\n[Verse 2]\nA yo AK told me I wouldn't recognize the old me\nMonetarily speakin' yo the world can't hold me\nFall down givin' high fives to the clouds\nOnly come down when I'm murdering the crowds\nLittle niggas talk but I can't hear nothin'\nLike \"hu.\" you don't really wanna to push the button cause when you\nPush it and we fired up people get wired up\nIf you don't wanna get tied up then you better stay (stay, stay, stay, stay)\n\n[Hook]\n\n[Verse 3]\nMy whole crew so fresh, we don't know what to do\nR8s in Amsterdam how do u do?\nAnd I'm just startin' with the actin a fool\nAt Dreamland throwin' big money niggas in the pool\nThen I fly to the dot side hang with the hot girls\nPut a ring on her turn into a dot girl\nStop girl go ahead with your bad self\nGot my city in my heart now we going for delf and gone (gone) gone (gone)\n\n[Hook]"}], "artist": "Kardinal Offishall"}