{"artist": "Cam’ron", "songs": [{"title": "Girls Cry", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Hook]\nThere comes a time\nIn every girl's life\nShe'll have to cry, cry, cry\nCry baby, sometimes\nThere comes a time\nWhen your heart can't take no more\nAnd you'll have to cry, cry, cry\nCry baby\n\n[Verse 1 - Cam'ron]\nListen\nWhen it comes to my girl, I could tell it all\nWhen I come in the house, she wanna smell my balls\n\"Why it smell like soap, Cam, if you were playing ball?\"\nTook a shower at the gym, said, \"You's a playa, boy\"\n\"Glitter on your pants, make-up on your shirt\"\nGave some hugs at the office, girls wear makeup to work\nBaby, ain't macking, yo\nCause I'll smack a ho, crack a ho\nWith a tennis racquet, John McEnroe\nGot a beautiful mind, the way she acting, yo\nIn my phone when I'm sleep, trying to crack the code\nI'm Swayze (gone), she crazy (loco)\nI went to the door, turned around and I said baby\nYou my one, no other\nBut discovered undercover that you're jealous of my mother\nBaby, so from here girl I blow a kiss\nAnd it's me I know she miss\nCause when I left I told her this\n\n[Hook]\n\n[Verse 2 - Vado]\nI know\nFucking shame, you fucked what's his name?\nThat's when your luck changed, got rid of that plush range\nThe whole bus train give your guts pain\nNow you stuck strange, a bum without cupped change (haaa)\nNah, I don't want to have a seat\nYou know a counselor? Cool, we don't have to meet (not at all)\nJust hear me well, B, I'm gone, and put him back to sleep\nWoke him up with this dumb shit cause you mad at me\nWe got beef? Go ahead, speak your mind (talk!)\nLike I was with you before, when you ain't had a dime\nI'm Swayze, she crazy\nI went to the door, turned around and I said baby\nYou my one, no other\nBut discovered undercover that you're jealous of my mother\nBaby, so from here babe I blow a kiss\nAnd it's me I know she miss\nWhen I left I told her this\nOne time\n\n[Hook]"}]}