{"songs": [{"image": "https://images.genius.com/9df0115ec239640f50d1f217f1bcff9f.398x400x1.jpg", "title": "Runnin’ Out Of Time", "album": "Pain Killer", "year": null, "lyrics": "[Chorus]:\nIt's all in your mind\nHip hop's alive but it's on the decline\nNew York, New York niggas runnin' out of time\nWhatchu gon' do nigga? How you gon' shine?\nWe runnin' out of time\nYou can see the sun till your eyes go blind\nYou can be the one that meet the chrome .45\nYou can be the one that don't die\nSo run and hide\nYou runnin' out of time\n\n[Verse One]:\nMusic I make is like, somethin' to take at night\nStronger than Vicodin, music will save your life\nI can't prescribe it to you, only describe it for you\nIt's like a bitch tryin' to squeeze money out of dudes\nFirst time she meet him, try to beat him and bait him\nI'm like a pimp that keep the key to every suite that I stay in\nAll the freaks that I dated ain't get their numbers deleted\nIt's called emergency ass, I call 'em whenever needed\nYears thinkin' I could never get that swag back\nWhatever you thinkin', I'm thinkin' ten steps past that\nI seen what you drivin' nigga go 'head just crash that\nI'd rather flip crack with heavy checks from ASCAP\nMy niggas will love me and some might hate me\nDon't wanna cross the line young blood, don't make me\nI'll hurt you up severely, I know that you hear me\nJust before you got scared and your eyes was teary\nYou heard me say...\n\n[Chorus]:\nIt's all in your mind\nIf hip hop's alive then it's on the decline\nNew York, New York niggas runnin' out of time\nWhatchu gon' do nigga? How you gon' shine?\nWe runnin' out of time\nYou can see the sun till your eyes go blind\nYou can be the one that meet the chrome .45\nYou can be the one that don't die\nSo run and hide\nYou runnin' out of time\n\n[Verse Two]:\nAyo, some of my songs get your kids suspended\nI'm talkin' shootings and gangs instead of finger paintin'\nThings they ain't supposed to be hearin' unless they livin' it\nProject environment, playtime is limited\nThe father gettin' cussed out\nBaby know the bus route\nShe only three years old, now she turnin' on the stove\nWhile you in the back sleep, you never hear the tickin'\nLittle piece of paper, big fires in the kitchen\nYo we livin' that hood life\nThe cameras in my buildin' can prove that\nWe movin' like it's boot camp\nDon diva shoe champ\nNike Air's every color, summertime make a color\nFake niggas come around\nGrowl but they ain't gorilla\nMore like orangutang, all bark but never bang\nWhen we go to war niggas never show they fang\nThey only wanna talk about rap\nWhen they see me like it's all about that\nWhat's up nigga?\n\n[Chorus]:\nIt's all in your mind\nIf hip hop's alive then it's on the decline\nNew York, New York niggas runnin' out of time\nWhatchu gon' do nigga? How you gon' shine?\nWe runnin' out of time\nYou can see the sun till your eyes go blind\nYou can be the one that meet the chrome .45\nYou can be the one that don't die\nSo run and hide\nYou runnin' out of time\n\n[Verse Three]:\nNiggas fixin' they resumes after 30 somethin' years\nHavin' kid and no Medicaid\nOn the streets runnin' wild like I'm down with the Blue Cross\nWith a blue cross, Bluetooth and a blue Porsche\nFresh pack of Newports\nBest rapper, who thought?\nScoopin' up your bitch at the mall in the food court\nEatin' with the kid and she even got the stroller with the shop type\nMy type\nTill she got to know a nigga now she wanna kiss and tell\nHow she used to give me head\nThen she smoke a cigarette, chase it with the Ginger Ale\nPuttin' on the lipstick, she headin' back out\nHeaded to the mall, sneaky rat tryin' to mack out\nAny nigga shoppin', spot him when he pull his stack out\nDon't matter if he rappin' if he got it, it could happen\nHer baby daddy waitin' at the crib with the ratchet\nThinkin' she was shoppin', if he knew he would clap her\nIf he knew what she was after\n\n[Chorus]:\nIt's all in your mind\nIf hip hop's alive then it's on the decline\nNew York, New York niggas runnin' out of time\nWhatchu gon' do nigga? How you gon' shine?\nWe runnin' out of time\nYou can see the sun till your eyes go blind\nYou can be the one that meet the chrome .45\nYou can be the one that don't die\nSo run and hide\nYou runnin' out of time"}], "artist": "Nature"}