{"songs": [{"year": "2002-03-26", "album": "Exit", "image": "https://images.genius.com/dcee8e66d8bfbca61e739b2be7ba65e6.352x350x1.jpg", "title": "Neutroniks", "lyrics": "[Intro]\nYo, (here we go, come on)\nGreetings to you all (here we go, come on)\nWe came millions of miles to be here with you tonight (here we go, come on)\nAnd we're gonna bring a man up to the microphone right now (here we go, come on)\nAnd goes by the name of uh, well he doesn't know (check it out come on yo)\n\n[Verse 1]\nShape shifing, uplifting, lyrical being here to terminate the bling bling\nSix million ways to live, choose none\nThe devil's both left and right confusion\nA new sun, a new earth has begun\nMetabolical rates are changing, rearranging\nThis rhyme is entertaining and visually stimulating like an impressionist painting\nOooh, yo come follow me, what's the definition of a real MC?\nIs it looking hard on MTV?\nOr freestyling in a back street all-ey?\nMuhammad, it's the return of the common\nI'm bombing these rappers and dropping a hip hop megatron\nFrom king street to eglington, we don't run\nCause when they got a mic, there's no need for a gun\n\n[Hook: K-Os]\nAnd it don't stop, and it don't quit\nIt's all fortified so jump on it\nAnd to my people if you love your life, forget the strife\nWe rock from night, until morning\n\nAnd it don't stop, and it don't quit\nIt's all fortified so jump on it\nAnd to my people if you love your life, forget the strife\nWe rock from night, until morning\n\nGet your back up off the wall\nCan't afford to miss the boat when they call\nGet your back up off the wall\nCan't afford to miss the boat when they call\nGet your back up off the wall\nCan't afford to miss the boat when they call\nGet your back up off the wall\nCan't afford to miss the boat when they call\n\n[Verse 2: K-Os]\nIf you think about a thought, then you'll see that you're timeless\nHouse the rhymeless, they're asleep like Linus\nI find this, very stimulating to the mind\nBut drives me crazy at the same time\nAm I this or that? human or black?\nExtraterrestrial or right side of the tracks?\nIn fact, the shoes itself could be confusive\nHere's a little story from the time that's elusive\nI knew a girl by the name of Roxanne, met her in eighty-six\nAt the local band stand\nNew track suit, fat laces white sneakers\nMoving to the sound comin' out of the speaker\nLast week around queen and john, I saw her at the corner with a business suit on\nI said \"what's up girl? you still check the vibe?\nRemember de la soul? diamond d? and the tribe?\"\nShe said \"no, no, I just don't listen\nThat stuff on the radio is not to transmission\nSame beat, same lyrics, same song\nI listen to my old school tapes to get it on\"\nI said \"word up girl? I know what you mean\nIt seems we're all trapped in the glitz and the gleam\nThe truth's just hidden for now, so don't sweat it\nSo here's a cassette\" and then I jetted!\n\n[Hook x4]\nAnd it don't stop, and it don't quit (come inside)\nIt's all fortified so jump on it (there's no use hiding)\nAnd to my people if you love your life, forget the strife (come inside)\nWe rock from night, until morning (the sun is high)\n\nAnd it don't stop, and it don't quit (come inside)\nIt's all fortified so jump on it (there's no use hiding)\nAnd to my people if you love your life, forget the strife (come inside)\nWe rock from night, until morning (the sun is high)\n\nAnd it don't stop, and it don't quit (come inside)\nIt's all fortified so jump on it (there's no use hiding)\nAnd to my people if you love your life, forget the strife (come inside)\nWe rock from night, until morning (the sun is high)\n\nAnd it don't stop, and it don't quit (come inside)\nIt's all fortified so jump on it (there's no use hiding)\nAnd to my people if you love your life, forget the strife (come inside)\nWe rock from night, until morning (the sun is high)\n\n\n[Interlude]\nGet your back up off the wall\nCan't afford to miss the boat when they call\n\nGet your back up off the wall\nCan't afford to miss the boat when they call\n\nGet your back up off the wall\nCan't afford to miss the boat when they call\n\nGet your back up off the wall\nCan't afford to miss the boat when they call\n\n[Background vocal]\nHigh, high, high, high, high, high, high, high\nHigh, high, high, high, high, high, high, high\n\n[K-Os]\nCome inside, there's no use hiding\nCome inside, the sun is high\nCome inside, there's no use hiding\nCome inside, the sun is high"}], "artist": "​k-os"}