{"artist": "Pharoahe Monch", "songs": [{"album": "W.A.R. (We Are Renegades)", "title": "The Hitman", "image": "https://images.genius.com/2694343eb76859336bf01cf74ae9f24b.250x250x1.jpg", "lyrics": "[Hook: Pharoahe Monch]\nCall me the Hitman, it's kind of hard, ain't it?\nWhat most feared we'd become in the game we became, we became it\nSo I painted a masterpiece of an industry tainted\nIt's not a lithograph, so it's graphic, frame it\nThe Hitman (say it again)\nThe Hitman\nThe Hitman (say it again)\nThe Hitman\n\n[Verse 1: Pharoahe Monch]\nSome people say I'm extreme, broadcast a beam live through a meme\nScreaming as Jimmy Iovine, as corrupt as Don King\nBoxed into the ghetto, to be champions of bling\nIndustry's the arena, the Internet is the ring\n\nYou train audible Queens to sling music to fiends?\nThen Def Jam, supreme team, the same thing\nExcept more critical now, digital cocaine\nThe goal's to control every individual's brain, like\n\nCadillacs for contracts in the 60's\nNow it's rap till you 60 for contracts 360\nThe trick, switch the degrees with the three sixes\nArtists are left with zero, you know who receives the riches\n\nWhich is the reason why there's only a few moguls\nGlobally, the pioneers are left in a chokehold\nEnough to make an individual go postal\nWatching these old folks get fucked for their vocals\n\n[Hook: Pharoahe Monch]\n\nThe Hitman, it's kind of hard, ain't it?\nWhat most feared we'd become in the game we became, we became it\nSo I painted a masterpiece of an industry tainted\nIt's not a lithograph, so it's graphic, frame it\nThe Hitman (say it again)\nThe Hitman\nThe Hitman (say it again)\nThe Hitman\n\n[Verse 2: Pharoahe Monch]\nIf you are not performing fellatio for radio rotation\nWhat's the ratio for radioplay at your station?\nIf you're not paying to play the record is dead\nPuts a whole new spin on Radiohead\n\nThey got a thousand plays a week and we selling the same units\nPut their best rep up, they couldn't stand next to it\nPeople wanna relate, they wanna connect to it\nHere's a lyrical check, is this enough for you to flex to it?\n\nHuh? Or do you need more clues?\nShould I be more black, would that change your view?\nShould I dye my hair blond, should my eyes be blue?\nJust a couple of questions I mustered up for you\n\nBut these eleven and a half shoes, you can't fill those\nI make headlines (head lines) like corduroy pillows\nAnd probably get banned from television and marketing\nTargeting music industry politics provocative\n\n[Hook: Pharoahe Monch]\n\n[Verse 3: Pharoahe Monch]\nThe Hitman, it's kind of hard\nLet's release sex tapes so we can become stars\nNude photographs of titties and asses\nIncrease our buzz, impress the masses\n\nI thought she was supposed to be so passive\nNow you just another ass in the end with an asterisk\nCell phone songs, you will never be classic\nYou sold your soul, they call that remastering\n\nSee, why does it have to be so drastic?\nChemical skin peel makes the song more plastic\nFollow the program, man stick to the tactic\nTwelve to eighteen, you know the demographic\n\nThese kids want popcorn, they want slapstick\nProbably the chorus goes tisket, tasket\nBut I'm not willing to risk it mask it\nThis might take a couple of listens for you to grasp it\n\nThe Hit--", "year": "2011-03-22"}]}