{"artist": "C-Murder", "songs": [{"title": "Life or Death", "album": "Life Or Death", "year": null, "image": "https://images.genius.com/dd9b12b56387cac0b0c8ab7e7315ade3.200x200x1.jpg", "lyrics": "[Hook]\nOhhhh\nIt's life or death in my town\nAnd I'm standin' on deadly ground\nI just wanna live my life\nAll by myself...\n\n[C-Murder]\n\nLife is full of debt\nAnd life is full of cnflict\nI'm just tired of seein' all my homies out here dyin' quick\nSociety today is all twisted\nGave my homie 20 years for shop lifttin'\nNow that's bad because LaWan got 3 for murder\nPolitics in the court house ain't the same since the murder\nThat's why constantly I watch all my enemies\nCuz death is a disease to all my TRU g'z\nThe can't shake it\nThey can't seem to break the cycle\nThat's why I'm protected by the gat and St. Micheal\nRalph Sten said money...runs the country\nMake ya do some strange things when it's right in front ya\nI done see mothers turn on they own kids\nMoney make brothers turn on one another\nEven make each other split the other's wig\nAnimosity\nLeast of all tops is ta watch ya back\nLife or Death\nCuz ya never know if ya breathed ya last breath\n\n[Hook x2]\n\n[C-Murder]\n\nI'm already dead\nSo can't nobody kill me\nI done suffered to long to let another man fear me\nMy pain brings anger to a total stranger\nAin't no limit to my hall when I'm constantly in danger\nI just wanna be surrounded by somebody that luv me\nBut reallity is sendin' me those hatas undercover\nI don't know who to trust but my family and friends\nTakin' chances on your life when you let a stranger in\nIn my days rappers die\nSo I take it as a message\nI lived to see another year so I count my blessings\nTell Em' I'mma changed man, but they don't hear me\nOn my knees beggin' god can you please forgive me\nLet the past be the past\nI'm investin' in the future\nWatch the ones that swallow most ya\nAnd the ones that'll do ya\nMy advice to the world\nMaintain your sanity\nI know your faced with life or death everyday but overlook the evil thoughts cuz there's gotta\nBe another way\nLife or Death?\n\nSee me?\nI trust nobody\nMoney is the rule to all evil\nBetter watch yourself boo\n\n[Hook till end]"}]}