{"songs": [{"year": "2017-04-06", "album": "SupaJefe", "image": "https://images.genius.com/82f313e0aa09ef9cc0156d93ae45d696.355x355x1.jpg", "title": "I See You", "lyrics": "[Intro: Kap G & Chris Brown]\nYeah\n(Aw yeah)\nI ain't into this playing games shit\nNo, for real\nI ain't gotta print no resumé\nHahahaha\nYou already know what it is with me, bitch\nHahahaha\n(Kap G)\n\n[Chorus: Chris Brown]\nYeah, ooh girl I see you lookin' my way (yeah, way)\nRight now I see you back in my place (my place)\nOoh girl, I see you back in my bed (my bed)\nOoh girl, now don't you fuck with my head (ow!)\n\n[Verse 1: Kap G & Chris Brown]\nSh-sh-shawty, swing my way\nYeah, I just wanted you to come to my place\nYeah, I'ma pull up in that i8\nYeah, she just want the wood like a fireplace\nI ain't tryna intervene but how you fit that in them jeans?\nI don't really need a driver, I'ma fuck you on the Benz\nI'ma fuck you in so style, I'ma fuck you in Supreme\nYou know I won't play around, I be ballin' like Kareem\nNa' mean? I be flexin' with my team\n\n[Pre-Chorus: Chris Brown & Kap G]\nWhat's your set, nigga? Throw it up\nWhat you represent?\n2 or 3, I put it in my cup\nWhat you sippin', fool?\nOHB, you can't fuck with one of us (woo)\n\n[Chorus: Chris Brown & Kap G]\nOoh girl I, ooh girl, I see you lookin' my way (in my way)\nNo, for real\nYeah, right now I see you back in my place (oh, woah, my place, ooh, woah)\nOoh girl, I see you back in my bed (my bed)\nAt the crib\nOoh girl, now don't you fuck with my head (ow!)\n\n[Verse 2: Chris Brown]\nDrivin' in that new shit (new)\nWalked in the house like I love Lucy\nCan't say shit to me (to me, yeah)\nRespect me like Hov, girl, I got the Blueprint (yeah)\nTellin' my bitches it's over, yeah\nI think that I'm textin' for closure\nBaby, I'm tryna get to know ya (know ya)\nWhy these niggas keep pushin' up on ya? (Bop, bop, bop, bop)\n\n[Pre-Chorus: Chris Brown & Kap G]\nWhat's your set, nigga? Throw it up\nWhat you represent?\n2 or 3, I put it in my cup\nWhat you sippin', fool?\nOHB, you can't fuck with one of us (OHB, woo)\n\n[Chorus: Chris Brown & Kap G]\nOoh girl I, ooh girl, I see you lookin' my way (way, in my way)\nNo, for real\nYeah, right now I see you back in my place (oh, yeah, my place)\nOoh girl, I see you back in my bed (my bed)\nAt the crib\nOoh girl, now don't you fuck with my head (ow!)\n\n[Verse 3: Chris Brown & Kap G]\nBitches know they hoes when niggas still take 'em back\nI'm prolly with your bitch, she rollin' up that pack\nIf I front it, I need it, gave you a brick, I need a quarter back\nTold that bitch throw it back, know she gon' make it clap\nStop fuckin' with them lames\nAnd he can get exchanged (brrrrp)\nLet me upgrade you\nI pull up with the gang (Kap!)\nAnd you know that I see you\nWhat you with? It's your payday, cyeah\nYou know, you’re in your own lane, baby\n\n[Chorus: Chris Brown & Kap G]\nOoh girl I, ooh girl, I see you lookin' my way (way)\nWhat it do? No, for real\nYeah, right now I see you back in my place (my place) Kap G\nOoh girl, I see you back in my bed (my bed)\nAt the crib\nOoh girl, now don't you fuck with my head (ow!)"}], "artist": "Kap G"}