{"songs": [{"title": "The Rap World", "album": "High School High (Music From and Inspired By the Motion Picture) ", "year": null, "image": "https://images.genius.com/cd29718e436b4c969a36495c282f35e7.400x393x1.jpg", "lyrics": "[Intro: Pete Rock]\n\"Can you hear me say it?\" Everybody in the rap world today. Pull up a chair\nAnd parlay (word up). It's Extra P and Pete Rock (yeah) we got something to\nSay (what?). Comin' at cha with the rapture (you know) for the nine double\nTrey (c'mon) how we do e'ryday (knowhatI'msayin'?), Bust the flava. \"Can\nYou hear me say it?\"\n\nPete Rock:\nI represent from the east coast bringing the ruckus\nStyles lost so from the mic you get tossed\nPenetrating through your soul son taking drastic measures\nStriving for buried treasures living life forever\nHowever the Soul Brother still doing his thing\nBout to get you wide open off the songs that we sing\nYou fiend from Mt. Vernon to Queens the Extra P\nAbout to set up shop and drop his next degree nigga\n\nLarge Professor (Extra P):\nYo, I brake it down unto the very last morsel\nMake you shake your torso\nAlso\nTo bring in the light to what's dark like a narc on a drug bust\nNiggas know the deal when I thrust\nOver the track ain't actin' masquerade and get sprayed\nBy the automatic\nRhyme addict that gets dramatic\nWhen the beast is ill you know the real really will\nC'mon kid listen how we swing it like a krill\n\nHook:\n\"In the world\" We got drugs and crime\n\"In the world\" We got snitch droppin' dime\n\"In the world\" We got money and clothes\n\"In the world\" You got friends and foes\n\"In the world\" Theres projects and tecs\n\"In the world\" Kid who knows what's next\n\"In the world\" You got love and hate\n\"In the world\" We got money to make\n\nLarge Professor (Extra P):\nC'mon the loaded Sp's the ensemble\nPete Rock together with Large the bomb combo\nWe raise the stakes on flakes and rock the show\nFlipmaster mania son we got to go to the top and won't stop\nFlop or fold wheather cop a gold or plat\nThey hit the map\nIn every section tag team connection wide\nGettin' hot on each track we glide\n\nPete Rock:\nYo the beat got me twisted rhymes are too delicious (huh)\nYou look suspicious you wanna bite but can't grip it\nRecognize the flav as we lay it on wax\nCrime dogs of the funk and never Fakin' no Jax\nBut for the record look on your face you see rejection\nIt's hard to believe I liquidated every section\nLet's Get It On like Smif 'N' Wessun\nOr don't even look in my direction\n\nHook\n\nPete Rock:\nWe throw blows to the dome like Mike Tyson\nSuspend your rap license\nKid bring on the cake plus the icing\nRaw deal to all my niggas who keep it real\nOne love we fittin' like a hand in glove\n(Yo shit is drug son) Even hardcore for the thugs\nFrom east to west it's time to rise up above\nAnd build so blacks can chill I make cash at will\nThe rap world is how I eat my meals\n\nLarge Professor (Extra P):\nSo here's the jist it's the high top crisp\nFunk dons\nComin' through to knock out Nas\nIn this orderly fashion\nStraight up to fuck flashin' (what?)\nMy capability to bring the uncut action\nTo any set be the Queens lounge vet\nLarge so dodge a camouflage cause you're pet\nCompetition is no I got the glow so yo\nI'm truely in the world to stay the Large Pro\n\nHook"}], "artist": "Large Professor"}