{"artist": "Ice-T", "songs": [{"title": "My Word Is Bond", "lyrics": "[Intro]\n[Ice-T] yo, yo, yo man, let me tell y'all the story man\n[Posse] Oh-oh, here we go again \"Stop lying\"\n[Nat The Cat] All lies\n[Ice-T] lyin' man, what you talkin' about?\n[Nat The Cat] All lies \"Stop lying\"\n[Posse] Let's hear this one\n[Ice-T] no man, you niggas is buggin' man\n[Posse] alright go a head, go 'head\n[Ice-T] Alright, let me tell you what's, let me tell you what's goin on, man\nLet me tell you what happened to me\n[Posse] go a head, go a head, go a head \"Stop lying\"\n\n[Verse 1: Ice-T]\nThe other day I spent a million on a def gold chain\nIt weighted thirty nine pounds, my name plate the same\nI put it on, it was too heavy\nSo I hired me this brother to wear for me\nOne night, we was out chillin, he and I minus crew\nI was held at gun point by a thug's .22\nBut when I told him that I was the L.A. player Ice-T\nThe brother robbed somebody else and brought the money to me\nYou might think I'm lyin' but man, you're wrong\nAs I told you before, my word is bond\n\n[Interlude]\n[Posse] You expect me believe that? \"Stop lying\"\nYou're the master of lying, man\n[Ice-T] Yo, look at you with your basketball outfit on, man\n[Posse] That's cause I can play\n[Ice-T] What do you know about basketball, man?\n[Posse] What I know?, yo, yo...\n\n[Verse 2: Bronx Style Bob ]\nI played ball back in ( name ) Park\nThe ( name ) on the board, hit three pointers in the dark\nI got a scholarship but said: \"Yo, forget it \"\nGoin' straight to the Pro rank, coach, so don't sweat it\nThe Lakers wanted to pick me, but I said: \"Step\"\nCause takin' Magic's spot, could be bad for my rep \"what\"\nSo he sent me to Chicago, to play in front of.. you know\nBut then I said: \"Either he go or I go\"\nI gave Jordan a break, then came back to the city\nYou know, cause everybody missed me \"right, right, right\"\nYou think I'm lyin?, but brother, you're wrong\nAs I told you before, my word is bond\n\n[Interlude: Ice-T]\nLies man, man you're crazy\nLook at Donald D comin' through the door late\nWe're makin' a record, brother\nWhat you're doin' so late, man\nWhat's up, man? \"Stop lying\"\n\n[Verse 3: Donald D]\nMy girl was pissed, so she tried to diss\nThe D, until I showed her my fist\nI argued with her in the pouring rain\nAfter the fightin' with her, I missed the train\nIt was delayed for an hour, so I fell asleep\nWhen I woke up, I was on 14th. Street\nBy the time I got there, it was way too late\nCame back uptown and decided to wait\nRan into her cous', and hung with him\nMet Billy, Joe, Bob, Frank, Chuck and Slim\nWent back to the crib to watch a VCR\nAnd then I had to pick up my father's car\nLooked around for my brother, to see where he went\nAnd then I had to pay my mother's rent\nI know y'all think I'm lyin', but listen, you're wrong\nLike I told you before, my word is bond\n\n[Interlude]\n[Ice-T] Lies man, you be late to the show\nHow you gon' make some money, man?\n[Donald] Money?, You talkin' about money?\n[Ice-T] Man, I got money, man\n[Donald] You ain't got no money, man\n[Ice-T] Yo, check this out\n\n[Verse 4: Ice-T]\nI got so much money that the bank couldn't hold it\nCar so dope that I didn't wanna roll it\nSo many houses, sometimes I forget\nI brought a yacht and a brand new lear jet\nI flew to Paris just for good meal\nThen to Rome, to sign a record deal\nOff to London, to kick with the Queen \"what Queen?\"\nBack to LA, I bought a football teem\nI just can't stop spendin' that green\nMy girl loves the water so I brought baby a submarine\nBut see, I left my house without my credit Cards\nI think I left my wallet in my other car\nIf you could loan me ten, I'd pay you back\nYo man, you're lookin' at me crazy, what's up with that?\nYou think I'm lyin' but man, you're wrong\nAs I told you before, my word is bond\n\n[Interlude]\n[Bronx Style: ]lyin' man\n[Ice-T] yo man, I'll pay you back\nYo, you be talking about them girls you got, man\nYou ain't got no women, man\n[Posse] That's why I went to jail, man\n[Ice-T] What's up with your girl, man?\n[Bronx Style] alright\n\n[Verse 5: Bronx Style Bob]\nMonday morning, walkin' down the block\nSaw this girl in a Jag, y'all, and she stopped \"aww man\"\nShe said her father casted for the Cosby Show\nAnd she said: \"Bob, would you like to go?\"\nYou know, so I went with her, and we chilled\nGot her drunk off the Eight Ball, and we illed\nShe was stupid rich, so I bought myself an island\nCharged it to her Master charge, I be wildin'\nSo, after that I stepped and she was cryin'\nShe gave me mansion, yo, why should I be lyin'?\nYou got me frontin'?, well homeboys, you're wrong\nAs I told you before, my word is bond\n\n[Interlude]\n[Ice-T] lies\n[Bronx Style] Why, why it gotta be all that, why it gotta be all\n[Ice-T] look at Donald, he always be lyin' about shows\n[Posse] Oh, he, he be lyin'\n[Donald D] yo, I ain't be lyin'\n[Ice-T] Check him out\n\n[Verse 6: Donald D]\nYo Ice, I did a concert in the White House\nAnd after that me and Donald Trump hung out\nAnd then I knocked Vanity boots in a limo'\nI rejected Michael Jackson's demo\nSmacked Freddy Krueger and he didn't reply\nHit Mike Tyson in his eye\nSharks around me and didn't die\nDrank a case of Cisco and I didn't get high\nYou might think I'm lyin, but listen, you're wrong\nLike I told you before, my word is bond\n\n[Interlude]\n[Posse] You high right now, man\n[Nat] No, I'm not (Stop lying)\n[Ice-T] Let, let the man with the money get it right for you\n[Bronx Style] What money, man?(Stop lying)\n\n[Verse 7: Ice-T]\nYou think I'm lyin' but I'm tellin' the stone truth\nI have been player ever since my youth\nIn 1st grade I was knockin' kids out cold\nIn 2nd grade I was truckin' the large gold\nIn 3rd grade I was checkin' the youth bank\n4th grade puttin' Gas in Benz my tank\nBy the 12th I was gamblin' outrageous\nI drove through Desert and broke Los Vagus\nYou probably think I'm lyin' but brothers, you're wrong\nAs I told you before, my word is bond\n\n[Outro]\n[Posse] lyin' man, lyin' man\n[Ice-T] What you talking about, man?\nYou and that basketball stuff you talkin' about\nDonald talkin' 'bout Donald Trump,' man, y'all is crazy\nShawnie Mac, what are they talkin' about, man?\nMy Word is Bond, home boy\n[Posse] Don't believe the hype\n[Donald] My Word is Bond\n[Posse] you be lyin' every time you talk\n[Ice-T] y'all all drunk\n[Posse] yo man, we outta here \"Stop lying\"", "image": "https://images.genius.com/8130dc496c2cedd8004532bb340c7c91.800x800x1.jpg", "album": "The Iceberg / Freedom of Speech... Just Watch What You Say", "year": "1989-10-10"}]}