{"artist": "Webbie", "songs": [{"year": null, "lyrics": "(Webbie)\n\nPants low, afro, no shirt, blowing purp, I'm not a star, Im just a regular ole hood nigga. VIP full of hoes, full of rose, We got guns in this muthafucka now bitch that's how we comin. A half of diesel, pack of kools, a whole pound of kush, Presidential shit now that's what we call blowin money. Murder weapons, 357's, Glock 9's, I ain't lying, bitch that chopper hold a whole mutherfucking hundred. Think fo you move, cause you dont wanna move wrong. Send yo hitman niggas gon put that tool on him. Bow! Bow! Bow! Knock all his shoes off. Im the Savage, what's happening, come on tell me who want it. Cause we can crank it up, cause I dont give a fuck. Where ya people at? You better bring all them dick in the booty ass, coochie ass, fake ass ballers. You ain't neva pop nuthin, stop stuntin bitch. Nigga you ain't seen nuthin until you see me, climbing out a tree, wit a 223. What! Im scarred up, ready for warfare. Im right here.Pussy nigga Wassup. Get at me\n\nChorus\n\nNow I done did some fucked up shit I ain't gon even lie. But Im trilla than a bitch and you can't even lie. Im beat that pussy like no other, bitch dont even lie. I'm a bad mutherfucka and you can't even lie\n(Repeat 1X)\n\n(Lil Phat)\n\nI done did some fucked up shit so niggas ready fool. Remember. Remember. I shot the wrong dude. Such and such had sent me on a lick, I took the wrong tool. Six-shots I barely made it out a shoot-out. Fuck school.Standing on the corner what we knew bout. If a nigga tried to play you then you better pull that tool out. I done did some fucked up shit so niggas can't roll they look at it and taste it but still can't pay tho. I'm tired of being slept on, don't know about me. They gon fuck around and make me bring that four up out me. And I ain't stopping til I see the fucking graveyard nigga. Rest in peace to your shooter dont lose your graveyard wit ya. They say I'm thugging. Yea. Crushing. Yea. Yea. All my niggas struggling. Yea. Try me and I'm busting. Yea. End of that discussion .Yea. Be like yunging, fuck the yunging, he a dirty ass bastard.Some say I'm pussy some say I jack they favorite rapper\n\nChorus(2X)", "image": "https://images.genius.com/5a6259511dc000afa8b2e11fb5051a00.336x336x1.jpg", "album": null, "title": "Trilla Than A B***h"}]}