{"songs": [{"album": "G.O.Y.A.", "image": "https://images.genius.com/fb7ecaddc1d29cc6370534f44a6e9ae8.1000x1000x1.jpg", "year": "2013-01-01", "title": "Scandalous", "lyrics": "[Intro]\n[Man talking] There's nothing familiar about the way they talk...or look. Or even the way they worship their creator. They may be American but they're....they're not like you at all\n[Woman talking] We made a wild and wonderful record for you\n[Man talking] We tell you all kinds of things to do and be and you can let your imagination go\n\n[Scratch Hook]\n\"Recognize\" - Mobb Deep 'Eyes May Shine (Remix)'\n\"The real\" - Big Pun 'Firewater\n\"Who wan' to test the real scandalous?\" - Big Pun 'Firewater'\n\"Recognize, do I have to prove all the time?\nAnd get up close and personal in front of your eyes\" - Mobb Deep 'Eyes May Shine (Remix)'\n\"Recognize\"\n\"The real scandalous\"\n\"Who wan' to test the real scandalous?\"\n\"Recognize, do I have to prove all the time?\"\n\"When it come to money, dunn, I'm not the one to laugh with\" - Big Pun 'Firewater'\n\n[Verse One: Termanology]\nYou better recognize\nI don't give a fuck about a record deal, I wreck you guys\nPlus I specialize in murking you out with special knives\nTec's and nines, next in line\nWho wanna get it, I known to spit it with the best alive\nI murder stages and murder pages like murder cases\nRip out your vertebrates and your brain with my dirty razors\nI went to thirty mages invaded 'em with my lasers\nTold 'em about it this independent gun that I'm blazing\nFuck a record deal\nFor the record I've been living wreckless\nI'll clutch your diamond necklace off your neck and I'll flex it\nThen I fled to the exit, I hope you catching the message\nI got a necklace the size of Tretch's just to wreck ya flesh with\nWe straight scandalous, handing out brain damages\nCats pulling banana clips\nVast bullets and bandages\nThe brain is Goya me patna now you wanna cop?\nUnless you cop\nThen it's 1-800-COP-SHOT\n\n[Scratch Hook]\n\n[Verse Two: Chris Rivers]\nAin't nothing humorous\nCrucifix ya ludicrous movement\nI'm way too lucrative, I move with this translucent improvement\nOnly the light can pass, lightening fast\nBy the time you can wipe ya ass\nNeed to calculate infinity to fathom the mic's I grasp\nYour mind relapse\nPerhaps, from the way that I write these raps\nThe attack I blaze each track with the force of a 1,000 stars collapsed\nNovas and quasars\nSoldier and eight bars\nSixteen I'm Elohim, nebulous status, I make stars\nI stay charged\nRipping the force out of black holes\nYou don't get my space reference\nSuck a corpse out an asshole\nYou dumb fuck\nI guess you should've died as a tadpole\nBut since you're here now, go hang yourself on a flagpole\nI'm joking\nI'm all about that peace and equality\nPreaching philosophy\nWord to law for reading astrology\nLeading this odyssey journey from the depths that I constantly turn in\nDemocracy, logically and fuck this economy\n\n[Scratch Hook]"}], "artist": "Termanology"}