{"artist": "Warren G", "songs": [{"year": null, "lyrics": "Do you, wanna\nSmoke with me tonight\nI just wanna smoke\nLet’s get high, put it in the air\n‘Scuse me, may I have a match or light\nI just wanna smoke, let’s get high\nI’m on cloud 9 smokin’ on the good green\nIt ain't’ no secret now you can smell the reefer now\nAnd I’m higher than a mutha fucker 365 I’m higher than a muthafucka\nO.G, granddaddy what’s the newest name?\nDo Purple kush and indo still smoke the same?\nDo you like it in a bong, paper or a blunt\nCuz I get high on bongs paper and blunts\nBut not the flavored ones only like originals\nSwisher sweet or backwoods, or I smoke originals\nWhite papers zig zags for the chronic smoke\nAnd if you can’t grow, shit you just wait to smoke\nLet’s get high do you have a match or a lighter?\nNewborn Cali weed boy and its fire\nStrike a lighter lets get high put it in the air\nIts 4:20 everywhere with the chronic in the air\nDo you wanna smoke with me\nDo you wanna choke with me?\nDo you got that indo smoke? well you could loke with me\nRenew, revitalize, rejuvenate, accountability, stability, bomb tranquility\nYou trippin’ cause I’m usin’ big words\nMixin’ words verbs, pronouns and herbs\nWe heading back to the ghetto now\nJust bought a Cadillac ey you got a 20 sac?\nLet me get a couple what you do for 300?\nYeah I got some zig zags can you put some trees on it?\nHm, so I can get a piece of mind in this cold cold world that’s hard to define\nAnd uh it’s a miracle but smoking weed is spiritual\nWe all need high learning so I keep the fire burning\nHeeeey now you know, inhale exhale with my flow\nSo roll antother blunt\nI killed my high tryin’ go\nNigga played a smoka- a lot\nSo they call me broken stove\nSince a tiny G I been off the reefer leaf\nChoking off the sess weed\nNow its kusha keef\nThat light green is some good green\nBut that dark is the creeper, ya boy know its reefer\nRoll it in a zig zag fat like your finger\nAnd be careful with it, ya boy blow ether\nThe marijuana will keep your eyes low\nAnd make you lean in your seat, glide in your ‘64\nIm so cool plus high in the ’64, im old school\nWhite paper wrapped around the smoke\nI just wanna smoke\nSomebody roll a blunt\nSomebody fill the bong, somebody roll a joint\nStrike a lighter lets get high put it in the air\nIt’s 4:20 everywhere with chronic in the air", "image": "https://images.genius.com/5686f9398745abf989ef2336fa794264.307x307x1.jpg", "album": null, "title": "Let’s Get High"}]}