{"songs": [{"album": "The Warm Up", "year": "2009-06-15", "title": "Get Away", "image": "https://images.rapgenius.com/bbedb619df51d7c751c886dc70dfc60c.1000x1000x1.jpg", "lyrics": "[Intro: J Cole]\nLA, NC, NY\nThe Chi, yea, hey, yea\n\n[Verse 1: J Cole]\nI wake up, hop out the shower spray cologne on while im dressing\nThey hollering about recession so my niggas out here stressing\nBut bitch, Im live and breathing so to me that there’s a blessing\nSee life is like a test that I ain't never got no “F” in\nStepping out today, I got leave the crib\nMomma stressing , I pray\nThat ain't no body gon’ pull the weapon out and spray\nCuz I don’t got no strap\nAnd ever since we hit the depression niggas don't know how to act\nIn, fact there goes some niggas there\nHating, I feel the stare\nMe vs you shining is like a diamond and silverware\nLet ya’ll feel the glare I got to go now\nI'm riding through the city with the windows rolled down\nShorty holla, so I pulled up beside her\nI'm fronting “What's your name?”\nShe told me, “Boy, you know me, don’t play no games\nNow, look, they say you blowing up, hey, is it true, fired up?”\nI say, “Girl, they wasn’t kidding like they tubes tied up\"\n\n[Hook]\nI'm hollering hey, good God what a day\nI gotta say it feels good to get away\nWhere ain't nobody stressing over shit they got to pay\nAy tell me whats work without play\nAll my niggas hollering hey, good God what a day\nHey baby girl tell me can you get away?\nWhere ain't nobody hollering bout the problems of the world\nIts just me and my favorite girl, now all around they holler\n\n[Verse 2: J Cole]\nOkay so word is spreading\nThat I done jetted to New York- I was just up there doing my thing\nSo now some folks I used to know is hollering out “J. Cole!”\nI got to chuckle cuz I know they used to say Jermaine\nSo who changed?\nWhats in name though, when niggas can't hang on-your shoe strings\nThe flow insane plus I got that flame throw, that Liu Kang\nEven in the winter we bring, feelings of summer Suzanne\nWe get them hooked like T-Pain\nAnd scoop them hoes like loose change\nCan you blame me?- Im just a boy straight out the Ville\nThese wangsta ass niggas getting played out for real\nYour acting like your trill, nigga you bet not!\nYou talking out your ass, you feinna get your head rocked!\nThis is where they shooting sideways\nBoys getting blazed\nCan't afford to fly so we high to get away\nNow come here ladies see we trynna get you loose, pour it up\nTake this juice, we gon mix it with this Goose, don’t throw it up\n\n[Hook]"}], "artist": "J. Cole"}