{"songs": [{"title": "Fxck You", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "[Verse 1: brandUn DeShay]\nYeah\nI've been looking for something I can believe in\nThere's no telling the day that I'ma be leaving\nThe sweet smell of victory's what I've been breathing\nLet out a sigh, the fact that I'm even alive is a lifetime achievement\nI heard somewhere that blessings come in seasons\nWell, I'ma need to be blessed like I'm sneezing\nWell, I'ma need to be the best for no reason\nBefore I turn my back on the rest, no treason\nBefore I blow like the trees in the breeze and\nAnd kill the mold on the beat like a seasoning\nAll my Q's and P's and excuse me please\nWhen I never smile, when I get cheese, I'll be cheesing\nI'm like a whore, every night I'm on my knees and\nPraying to the Lord that one day you'd stop teasing\nI've got to keep it together like adhesive\nI set a goal, least I can do is achieve it\nBelieve it\n\n[Chorus]\nNothing that you can do or for you to say\nNow I'm gonna fly anyway\nI know I can\nI know I am better than you\nNothing that you can do or for you to say\nNow I'm gonna fly anyway\nI know I can\nI know I am better than you\n\n[Verse 2: brandUn DeShay]\nYou could plagiarize\nIn other words, take my word for it\nI swear to God, I done heard it all\nMy music is achievers\nIt seem like Jesus to all you non-believers\nI owe it all\nTo you, there you go again, Mr. Know-It-All\nThey came to see your show, of course I got to show it off\nI got a little shine, but you don't even glow at all\nEveryday is like a great day, hey, mazel tov\nI flow like a super soaker with the nozzle off\nSo I'm all Holocaust while y'all all cotton soft\nEven the greatest like autumn, dog, you gotta evolve\nAnd prays like Pokémon cards, you got them all\nAM radio niggas, they got a lot of talk\nSo I ain't hearing none of you naysayers, not at all\nThey got they floaties on and I'm yelling \"cannon ball\"\nHow you gonna get the picture if the Canon's off?\nGet it?\n\n[Chorus]\nNothing that you can do or for you to say\nNow I'm gonna fly anyway\nI know I can\nI know I am better than you\nNothing that you can do or for you to say\nNow I'm gonna fly anyway\nI know I can\nI know I am better than you\n\n[Verse 3: brandUn DeShay]\nGonna say good morning to the world\nAnd now I'm gonna say good morning to your girl\nWe had a good night, I got the goods, right?\nI can tell by her skin, yo, she had a good life\nBut no Kanye and no T-Pain\nI'm a Prince, cue the smoke and the purple rain\nSearching for the rings like a young hobbit\nNow they all on my jock like a young Bobbit\nLorena, this here is a no-brainer\nShow the world vivid pictures, but I'm no painter\nPhysically and mentally the best\nTrying to find myself with a mental GPS\nI ain't meant to be the best, just the best that I can\nGoddamn, the worth of you is one less man\nJesus was a rock star, I'm just one less fan\nBetter yet, I'm just one less stan\nAnd I won this hand\n\n[Chorus]\nNothing that you can do or for you to say\nNow I'm gonna fly anyway\nI know I can\nI know I am better than you\nNothing that you can do or for you to say\nNow I'm gonna fly anyway\nI know I can\nI know I am better than you\nNothing that you can do or for you to say\nNow I'm gonna fly anyway\nI know I can\nI know I am better than you\nNothing that you can do or for you to say\nNow I'm gonna fly anyway\nI know I can\nI know I am better than you", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}