{"songs": [{"title": "Get it Crunk", "album": "Kings of the South", "year": null, "image": "https://images.genius.com/ec6fd0ec1dc958208ad742d28e069f81.800x800x1.jpg", "lyrics": "[Hook]\nWe came here to get it crunk like (jump!)\nIn the club with our middle fingers up like (jump!)\nNow, we gonna make 'em stomp like (jump!)\nNiggas get out of line we hit 'em up like\n\n[Verse 1]\nWell I'm flippin' and grippin' my woodgrain steering wheel (steering wheel)\nI made a mill at eighteen, nigga how it feel (Ha ha!)\nIt feel good to cash checks every other day (yes!)\nIf you ain't talkin' bout money, go the other way\nMiss me with that bullshit dawg I'm on the grind (grind)\nYou disrespect me while I'm on stage, it's goin' down\nBottles, chairs, whatever I get my hands on\nYou can bet your bottom dollar they get some\nIf you think you strong enough to take a shot (jump!)\nI bet you changin' your mind when you lookin' now (jump!)\nThese niggas like to talk shit, then apologize (I'm sorry, I'm sorry)\nYou put my name in a verse then I gotta ride\n\n[Hook] (2x)\n\n[Verse 2]\nLook I'm a pimp\nMine is the 3-piece suit\nMy grill the same color as my GT Coupe\nGators snappin' on my feet like they fresh out the jungle\nThere's a nine in my vest, but it's a tec' in my Hummer\nI know I make y'all niggas wonder how I'm gettin' that cash (cash)\nCause when we gotta drop, I ain't spendin' my last (my last)\nThe prices (jump!)\nIf you out of town and you need a bird (jump!)\nI could ban him and blow his brains on the fuckin' curve (jump!)\nYou don't want beef wit my squad nigga (jump!)\nCome out the club off note, you gettin' rob nigga (jump!)\nStupid if you wanted dawg\nThese hollow tips gon' put you in a coma dawg. ya dig?\n\n[Hook] (2x)\n\n[Verse 3]\nHey!\nNiggas claim they got guns but they ain't shot nobody\nOr you a stick-up kid why you ain't got nobody? (stop lyin!)\nNiggas at the bar buyin' shit they can't afford\nYou think he ballin' until you see his Honda Accord (Ha Ha!)\nAnd tell valet not to scratch my wheeeel\nOr he gon' leave here wit a busted liiiip\nMe and Crime Boss rollin' in my Coupe Deviiiille\nI ain't tryin' leave you in but I shoot to kiiiiiill\nHey! I'm like Jeezy I trap or die (trap or die)\nAnd I don't pop, pop, I rather fire\nI'm a thug and you know it, you damn right I show it\nTwenty two's on my lotus just in case you haven't noticed\n\n[Hook] (2x)\n\nHey I bet he won't (jump!)\nKeep talkin' all that shit but I bet he won't (jump!)\nKeep talkin' all that shit but I bet he won't (jump!)\nShe talkin' all that shit but I bet she won't (jump!)\nShe actin' like a bitch 'cause I know she won't (jump!)\nOh, Oh, Oh, you better not (jump!)\nOh, Oh, Oh, you better not (jump!)\nOh, Oh, Oh, y'all better not (jump!)\nYou fuck around and get (jump!)\nHa-ha! Whoo!\nShout to my nigga Zab Judah\nFloyd Mayweather, Roy Jones, Winky Wright know what I'm sayin'\nWhat up to my nigga Bernard Hopkins\nYeah, holla at yo boy!"}], "artist": "Lil Flip"}