{"songs": [{"year": "1999-11-30", "album": "Amplified", "image": "https://images.genius.com/d698c73828666e6a746521fe9375c8a9.394x394x1.jpg", "title": "Breathe & Stop", "lyrics": "[Intro]\nUh uh uh uh uh get up\nUh uh for real uh uh\nCome on\nUmmah, Ummah, Ummah, Ummah\n\n[Verse 1: Q-Tip]\nA hard time if your motion is still\nLet me move some things around because the lyrics is ill\nAbstract..you know my stiggidy in here (yeah)\nNiggas get on and swear it's they fuckin' year\nBut yo your girl just moved\nTo the joint in the club, in the car if it groove\nBroad look, the movement is on\nMild mannered mami's in Victoria thongs, uh\nI get my rhyme on thus\nGuaranteed to make it right if your night is a bust (yeah yeah)\nYou Vivrant and you fresh and all\nOriginal to say the least and you've impressed Kamaal (come on)\nRappers start then they stall\nFindin' it very hard to make it over the wall\nHey, get your weight up, my motto you heard?\nAnd I grown a deaf ear to felonious words, uh\nSo girls move it around\nIf you see your main dog give a brother a pound\nAnd just uh..\n\n[Hook: Q-Tip]\nBreathe and Stop, for real and give it what you got, and just uhh\nBreathe and Stop, for real and give it what you got\nGive it what you got, give it what you got\nIf you on the block then give it what you got\n\n[Verse 2: Q-Tip]\nA thug, a thrill, you as mean as the eyes (say word)\nI wanna feel you, them big ass thighs\nYour Prada dress or your Gucci bag\nWith the Polo jeans over doobi-bag, uh\nYo hold the door a-ight?\nWe comin through, Tribe beef, hold it down for the night\nBig Moon got the fifth\nD-Lyfe he got the deally and girl you got the gif (yeah for real love)\nTurn it over the page\nUsherin all of y'all to a brand new age, where (yeah)\nStatus really don't matter\nEverbody get right to the pitter the patter (come on)\nMakin moves, settin precedence\nEnter in your residence, the whole scene is decadence\nAnd the feelin is true\nI'm seein me and my crew, you seein black and blue, uh (yeah)\nSo let's go for the ride\nStrap yourself in tight and if you bonafied then just uh\n\n[Hook: Q-Tip]\nBreathe and Stop, for real and give it what you got, and just uhh\nBreathe and Stop, for real and give it what you got\nGive it what you got, give it what you got\nIf you on the block then give it what you got\n\n[Bridge: Q-Tip]\nDunn what what bring it, bring it\nA-bring it give it bring it give it\nBring it give it bring it give it\nBring it give it bring it give it\nBring it give it bring it give it\nBring it give it bring it give it\nA-where we bring it to?\nRight here, right where? Right here, right where?\nRight here, right where? Right here, right where?\nRight here, right where? Right here, here here\nRight here, take it home home, take it home, right here\n\n[Verse 3: Q-Tip]\nMillenium, on your mind, are you runnin out of time?\nHope you skippin every line because I'm gettin mine\nMove it around a bit again\nEvery block every town we startin a trend (for real for real)\nEye to eye ma and toe to toe (toe to toe)\nWho concentratin on killin the show?\nPenetration is methodically slow\nMountain high valley low gonna find the dough (yo for real for real)\nAll my peoples, no matter the creed\nWe gonna satisfy the urge and discover the need\nYou feel, you feel the bite in this\nIf you think I'm type real then invite me miss\nAnd let me say a rhyme in your ear\nDancin close you the most and you fit in here (yeah)\nYou feel the rhythm is right\nYou know the spittin is tight\nYou think you won't but I think you might, uh\n\n[Hook: Q-Tip]\nBreathe and Stop, for real and give it what you got, and just uhh\nBreathe and Stop, for real and give it what you got\nBecause uhh breathe and Stop, for real and give it what you got, and just uhh\nBreathe and Stop, for real and give it what you got\nBecause uhh breathe and Stop, for real and give it what you got, and just uhh\nBreathe and Stop, for real and give it what you got\nBecause uhh breathe and Stop, for real and give it what you got\nIf you on the block keep diggin the hot\nAnd if you dig what I got we keep makin it hot"}], "artist": "Q-Tip"}