{"artist": "Big Boi", "songs": [{"lyrics": "[Verse 1: Big Boi]\nGet the South dick up out your mouth, what are you talmbout?\nSee we know everything that you're about, so try another route\nPaperboy, you can't destroy what we done built\nPick on somebody your own size and fuck around, get killed\nBut not like the kilt above the knees, BB\nWill plant you niggas like seeds, or fertilizer for the trees\nEmergency vehicle last seen speeding from the scene\nNigga take one for the team, now he's bleeding from the spleen\nStay so fresh and oh so motherfucking clean\nNo blood spatter or evidence, long distance with a beam\nWe come in peace while some of ya'll niggas come in greed\nGluttons fucking up the game like ice, heroin, or speed\nSlow down, nigga\n\n[Verse 2: Big Boi]\nSpeed it up like The Ballad of Ricky Bobby, boy go fast\nNot a hobby, this my life, you disrespect it, that's your ass\nAs one half of the OutKast return like Ghost of Christmas Past\nIt's the son of Chico Dusty, must be West Savannah bad, ayy!\nHad to go to church every Sunday with Great-Grandma and Granddad\nTaught me always follow Jesus when the grass didn't have a path\nIf I ever fell astray, then God will get me back on track\nDidn't say that Rico, Ray and Pat was getting with me and Three Stacks\nThen we spitting 'cause we killing everything that we attack\nSpecial Forces of the rap game, so you best take heed of that\nAll that shit you rappers lack, we got plenty, here's a snack\nDon't ruin their appetite, because your shit is really wack\nWack-ass nigga\n\n[Outro: Big Rube]\nAnother battle won, another story to tell\nListen to the angelic plucking of the puppet strings\nAs Sir Lucious puts his left foot forward\nAnd rides off into the horizon of infinite regression, victorious\nUndefeated on the battle field\nAgainst the means of ignorance, greed, and hatred\nAll contenders to the throne are left naked\nBecause the truth is the only thing you can never be stripped of\nAnd if you want to commit to that truth\nThen you could end the vicious cycle that's affecting our youth today\nIf you just stop lying, if you just stop lying\nStop lying... lying\n\n[Skit]\nHey, Josh, you ever– you know about the David Blaine?\nYou know the magician David Blaine, right?\nThe David Blaine is when you're fucking a girl from the back, or somebody from the back, right, and goddamn\nYou let your friend slide in without her even knowing, right\nThen you goddamn run around and bang on the window and you wave at her ass\nIt's called the David Blaine", "image": "https://images.genius.com/46ac321c10a27dea568b0b0e2d39cf51.1000x1000x1.jpg", "year": "2010-07-06", "title": "General Patton", "album": "Sir Lucious Left Foot... The Son of Chico Dusty"}]}