{"songs": [{"year": null, "image": "https://images.genius.com/073ae5b8b5d21a472eb45384f0a38241.500x500x1.jpg", "title": "3rd Coast", "album": "See Me On Top II", "lyrics": "[Produced by Big KRIT]\n\n[Verse 1:]\nI ain't never been the type to be a lame, a hater\nMy flow is like precious wine, I get greater, later\nAnd only time will tell if I will prevail over the fiction\nNow the (?) came out, everybody wants his digits\nCall him up the streets about this (?) is he versatile? Does he have a banjo as his picture?\nWe can make a million and I promise that we'll bomb that\nBut first give up your 99 percent and sign this contract\nFor nothin', a little bit of fame and some hoes\nAnd I'll retire age of 40 platinum with no (?)\nI'd rather not, I hit the block and smoke a lot out the trunk\nMy pockets big and fat in due time just like the Trumps\nFiend after fiend would get addicted to this (?)\nA&Rs got their first hit now they get back\nGet stacks, that's what a wise man told me\nI took that to the heart and fed it times three\n\n[Hook:] x4\nI can be your guide or your coach\nDeep down in the bottom of that 3rd Coast\n\n[Verse 2:]\nWake up, wash my face, get clean, and check my phone\nPull out the freshest T I got and throw my Forces on\n(?) crease, fitted cap, sittin' low\nMy mind frame is country, so country is all I know\nReach my grandma in my morning, she swear I don't get rest\nShe won't let me leave the house until I eat me up some breakfast\nWants me to cut my chin hair and fix my pants\nI tell her just who I am and eventually she'll understand\nGrab the door knob, with the (?) on my own\nWhile some return home, but mostly remain gone\nIn that street war, where surviving is so irrelevant\nThe only representation I got is them dead presidents\nI'm on guard, more than ever I pray to God\nI worked so hard to get my equal rights, I paid my tithes\nMy music bumpin', years ago I was onto something\nBut what do I do my nigga? Truly I'm only country\nBut that was then, this is now, and was forever\nIs my own go in stride to find me something better\nThen what lies beneath me, increasing my interviews\nWhile labels calculate my net-worth and revenue\nI speak for the hood, ghetto thinking, and ghetto livin'\nI embody the ghetto people and ghetto children\nI am that, you that man, your coach\nYour guide down deep in the Earth to third coast\n\n[Hook:]\n\n[Outro:]\nBuy these motherfucking stocks\nBuy these motherfucking stocks"}], "artist": "Big K.R.I.T."}