{"songs": [{"year": "1998-04-28", "image": "https://images.genius.com/58022580d1255ed1d96577caf5d630b7.426x426x1.jpg", "title": "Twinz (Deep Cover ’98)", "album": "Capital Punishment", "lyrics": "[Verse 1: Big Pun]\nReady for war, Joe, how you wanna blow they spot?\nI know these dirty cops that'll get us in if we murder some wop\nHop in your Hummer, the Punisher's ready\nMeet me at Vito's with Noodles\nWe'll do this dude while he's slurpin' spaghetti\nEverybody kiss the fuckin' floor\nJoey Crack, buck 'em all\nIf they move – Noodles, shoot that fuckin' whore!\nDead in the middle of Little Italy, little did we know\nThat we riddled two middlemen who didn't do diddily\n\n[Verse 2: Fat Joe]\nIt'll be a cold day in Hell the day I take an L\nMake no mistake for real, I wouldn't hesitate to kill\nI'm still the fat one that you love to hate\nCatch you at your mother's wake\nSmack you, then I whack you with my snub tre eight\n\n[Verse 3: Big Pun]\nI rub your face off the Earth and curse your family children\nLike Amityville, I drill the nerves in your cavity fillin'\nInsanity's buildin' a pavilion in my civilian\nThe cannon be the anarchy that humanity's dealin'\nA villain without remorse, who's willin' to out your boss\nForever, and take all the cheddar like child support\n\n[Verse 4: Fat Joe & (Big Pun)]\nI support Pun in anything he does, anything he loves\nMy brother from another mother, sent from the above\nA thug nigga just like me, one of the best – might be\nEven better, leavin' niggas kneelin' on they right knee\nSpike Lee couldn't paint a better picture\nYou small change, I'm blowin' out your brains, gettin' richer\nHit ya with the MAC, smack your bitch, nigga what?\nYou gettin' stuck, my trigger finger's itchy as a fuck\nTruck jewels, cruisin' in the Land, bumpin' Cash Rules\nLast crew to want it caught a hundred tryin' to pass through\nThat's true! (So who the next to get it?)\nTS the best that did it\n(Get it off your chest, kid, admit it, and it's…)\n\n[Chorus: Fat Joe & (Big Pun)]\nYeah, and you don't stop!\n(Twenty shot Glock with the cop killers, fill 'em to the top)\nYeah, and you don't stop!\n(Joey cracks the rock, and Big Pun keeps the guns cocked)\nYeah, and you don't stop!\n(We'll make it hot, nigga, what?\nBring it, I blow your whole spot)\nYeah, and you don't stop!\nIt's still one-eight-seven on an undercover cop\n\n[Verse 5: Big Pun]\nFuck the police, I squeeze first, make 'em eat dirt\nTake 'em feet first through the morgue\nThen lodge 'em in the deep earth\nThe street's cursed, the first amendment's culturally biased\nSupposed to supply us with rights\nTonight I hold my rosary tight as I can\nI'm one man against the world, just me and my girl\nBlack Pearl Latina mas fina but keeps it real\nYou know the deal, we steal from the rich and keep it\nPeep it, it's no secret\nWatch me and Joe go back and forth and freak it\n\n[Verse 6: Fat Joe]\nCreep with me, as I cruise in my Bimmer\nAll the kids in the ghetto call me Don Cartagena\nKickin' ass as I blast off heat\nAnd you never see me talk to police\nThough you should know that I really don't care\nPull you by the hair, slit your throat\nAnd I'll leave you right there, so beware\nIt's rare that niggas want beef, Big Pun speak\nAnd let these motherfuckers know how we run the streets\n\n[Verse 7: Big Pun]\nFuck peace, I run the streets deep with no compassion\nPuerto Ricans known for slashin'\nCatchin' niggas while they sleepin', no relaxin'\nKeep your eyes open, sharp reflexes\nThree TECs in the Jeep Lexus, just in case police test us\nStreet professors, Terror Squad, ghetto scholars\nFull-a-clips mob, inflicts the fear of God\nWhen the metal hollers\nBetter acknowledge or get knocked down\nUntil I'm locked and shot down\nHeather B. couldn't make me put my Glock down\n\n[Verse 8: Fat Joe]\nWe lock towns like rounds in the chamber\nBoogie Down major like Nine, I bust mine\nEvery time, plus I'm the crime boss of New York\nWhere we taught to walk the walk, all my niggas carry chalk\nAnd stalk our prey like a predator\nWhoever want it, go and get it\nSet it, baby, and I'ma bury ya\nSo remember the Squad that I'm reppin'\nI fill a clip of my weapon\nAnd punish niggas 'til it's Armageddon\n\n[Chorus: Fat Joe & (Big Pun)]\nYeah, and you don't stop!\n(Twenty shot Glock with the cop killers, fill 'em to the top)\nYeah, and you don't stop!\n(Joey cracks the rock, and Big Pun keeps the guns cocked)\nYeah, and you don't stop!\n(We'll make it hot, nigga, what?\nBring it, I blow your whole spot)\nYeah, and you don't stop!\nIt's still one-eight-seven on an undercover cop"}], "artist": "Big Pun"}