{"songs": [{"year": "2018-04-25", "album": null, "image": "https://images.genius.com/7aace56fbaa5a03a7b3693fafdd7bdb2.279x387x1.png", "title": "Dragon 🐉 energy [April 25, 2018]", "lyrics": "dragon 🐉 energy\nNatural born leaders\nVery instinctive\nGreat foresight\n\n(me and Mike 😂)\n(and we danced to music Michael all morning)\n...\n\nto be great is to be misunderstood\n\nnever a master. Always a student.\n\nspread love\n...\n\n2024\n\n...\n\nFree thinkers don't fear retaliation for your thoughts.  The traditional thinkers are only using thoughts and words but they are in a mental prison. You are free. You've already won. Feel energized. Move in love not fear. Be afraid of nothing.\n\nYou don't have to agree with trump but the mob can't make me not love him. We are both dragon energy. He is my brother. I love everyone. I don't agree with everything anyone does. That's what makes us individuals. And we have the right to independent thought.\n\nIf your friend jumps off the bridge you don't have to do the same. Ye being Ye is a fight for you to be you. For people In my life the idea of Trump is pretty much a 50 50 split but I don't tell a Hillary supporter not to support Hillary\nI love Hillary too.\n\nI love when people have their own ideas. You don't have to be allowed anymore. Just be.\n\nLove who you want to love.  That's free thought. I'm not even political. I'm not a democrat or a republican\n\nAnd also I'm all the way out the sunken place. And I'm not scared anymore. I'm not scared of the media. I'm not scared of the past and I'm optimistic about the future. This tweet is in love not fear.\n\nwith love I am invincible. Truth is subjective but love is the most powerful force in the world and the world needs to express more of it.\n\nI said express love more because we have love but we don't express it.  My friend Tmills will always say \"I love you\" and it used to make me feel weird to hear that. Now I tell everyone I love them.  He sparked me to start expressing love more.\n\nWhen my daughter acts out she actually says afterwards I just want to hear you say I love you more.\n\nno race religion region or political party can argue with the power of love\n\nfear takes strategy   Unlearn linear thinking   Hit you with these zig zag thoughts\n\ndecentralize\n\nburn that excel spread sheet 🔥😂\n\nYeezy VC invests in and develops food clothing shelter and communications\n\nmy wife just called me and she wanted me to make this clear to everyone. I don't agree with everything Trump does. I don't agree 100% with anyone but myself.\n\n...\n\nI’m nice at ping pong\n\nwe got love\n\nmy MAGA hat is signed 🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥🔥\n\nI'm so happy to hear that Peter Thiel would like to take a meeting. I feel very optimistic about the future.\n\n[Kanye 2024 pic]\n\n[Donald Trump reply pic]\n\n[Tmills sms pic]\n\n...\n\nwhenever someone mentions the word \"fan\" to me it's super manipulative. It's like \"don't do or say this because of your fans\"  My fans are fans of themselves.\n\nAnd any fan of me wants Ye to be Ye even when they don't agree because I represent the fact that they can be themselves even when people don't agree with them. Drops mic 🎤Yeezy shrug 🤷‍♂️\n\n[Anthony Chance SMS]\n\nlet's move in love not fear\n\nLove is the most powerful force in the universe\n\nClaudio Silverstein is a free thinker\n\nClaudio will be awesome when me and Chance build new homes in Chicago\n\nObama was in office for eight years and nothing in Chicago changed.\n\ncan't wait to meet\n\ncaption this photo\n\n2 of my favorite people\n\n[Donald Trump tweet]"}], "artist": "Kanye West"}