{"songs": [{"lyrics": "Can't Knock The Hustle\n\n[Intro (Mary J. Blige)]\nOk\nAlright\nHey\nThis song right there\nWas off the first album I ever made\nIt's called Reasonable Doubt\nAlso was fortunate enough to be blessed by the presence of\nThe Queen of, just the Queen man\nI wanna say R&B, I wanna say hip hop\nHer name is Ms Mary J. Blige\nMary!\nLet me get all the way up beside you girl\nYou ready?\n(What I'm ready)\nI'm making short term goals when the weather folds\nI just had to test y'all\n\n[Verse 1]\nI'm making short term goals when the weather folds\nJust put away the leathers and put ice on the gold\nChilly with enough bail money to free a big willie\nHigh stakes, I got more at stake than Philly\nShopping sprees, cop in three\nDeuce fever IS's fully loaded, ah, yes\nBouncing in the Lex Luger, tires smoke like Buddha\n50 Gs to the crap shooter\nY'all can't fade me, chrome stocks beaming\nThrough my peripheral I see you scheming\nStop dreaming, I leave your body steaming\nPlayer's is fiending, what's the meaning\nI'm leaning on any player intervening with the sound of my money machining\nMy cup runneth over with hundreds\nI'm one of the best player's that done it\nSix digits and running, y'all dudes don't want it\nI got the Godfather flow, the Don Juan DeMarco\nMary!\n\n[Hook 1: Mary J. Blige (Jay Z)]\nI'm taking out this time\nTo give you a piece of my mind\n(Cause you can't knock the hustle)\nWho do you think you are\n(Jay Z baby)\nBaby one day you'll be a star\n\n[Verse 2: Jay Z]\nLast seen out of state where I drop my sling\nI'm deep in the South kicking up top game\nBouncing on the highway switching four lanes\nScreaming through the sunroof, money ain't a thang\nYour worst fear confirmed\nMe and my fam roll tight like The Firm\nGetting down for life, that's right, you better learn\nWhile I play with fire, you burn\nWe get together like a choir, to acquire what we desire\nWe do dirt like worms, produce G's like sperm\nUntil legs spread like germs\nI got extensive with expensive clothes\nAnd I sip fine wines and spit vintage flows\nWhat y'all don't know\nUh Uh Uh Uh\nCause you can't knock the hustle\n\n[Hook 2: Mary J. Blige (Jay Z)]\nBut until then lately, I'm the one who's crazy?\n(Talk to em Mary)\nCause that's the way you're making me feel\n(They feel you, they feel you)\nI'm just trying to live right\n(Why wouldn't you)\nI don't have the time\nTo knock the hustle for real\n\n[Verse 3: Jay Z (Mary J Blige)]\nYo, lunching, punching the clock\nMy function is to make much and lay back munching\nSipping Remy on the rocks, my crew\nNothing to stop, un-stoppable\nScheme on the ice, I got to hot your crew\nI got to, let you dudes know the time like Movado\nMy motto, stack rocks like Colorado\nWaddle off the champagne, Cristals by the bottle\nIt's a damn shame what you're not though (me)\nSlick like a gato, ya boy Jay-Z\nMy pops knew exactly what he did when he made me\nTried to get a nut and he got a nut and what\n(Tried to get a nut and he got a nut and what)\nStraight bananas; can a nigga see me\nGot the US Open, advantage Jigga\nServe like Sampras, play fake rappers like a campus\nLe Tigre, Pa you're too eager\nYou ain't having it\nOh good me either\nLet's get together and make this whole world believe us huh\nAt my arraignment screaming\nAll us blacks got is sports and entertainment, until we even\nThieving, as long as I'm breathing\nCan't knock the way a player eating\nAlright\n\n[Hook 1: Mary J. Blige (Jay Z)]\nI'm taking out this time\n(Let me buy you one)\nTo give you a piece of my mind\nWho do you think you are\n(That's right, Jay Z baby)\nBaby one day you'll be a star\n(Let's take em uptown, let's take em uptown)\nBut until then lately, I'm the one who's crazy?\n(Let's go all the way uptown)\nCause that's the way you're making me feel\n(We in Harlem now, let's go to the Bronx on em)\nI'm just trying to get mine I don't have the time\nTo knock the hustle for real\n(Let's go all the way up town, let's take em to Yonkers)\n\nFamily Affair [Mary J. Blige (Jay Z)]\n\nPeople can we get it crunk tonight\n(We in Yonkers now)\nYeah yeah yeah\nLet's get it\nLet's get it\nLet's get it\nLet's get it\nLet's get it\nLet's get it\n(Talk to em Mary)\nIf you know the song, sing along\nLet's get it crunk tonight\nLet's get it crunk upon, have fun upon\nUp in this dancery\nWe got ya open, now ya floatin'\nSo you gots to dance for me\n(Talk to em)\nDon't need no hateration, holleratin'\nIn this dancery\nLet's get it percolatin', while you're waiting\nSo dance for me\nDance for Jay Z\n(Come on let's go)\nCome on everybody\nGotta thank Jigga for letting me get down tonight\n(No no thank you)\nThank you very much\n(You love that, ladies and gentlemen Ms Mary J Blige)\nThank you\n(One more time for Ms Mary J Blige y'all\nOk, alright. We might be at 8, we close we close. Alright, I got you Mami, let's slow it down one time)", "title": "Can’t Knock the Hustle / Family Affair (MTV Unplugged)", "image": "https://images.genius.com/a7449b38b8eab47232b379bc442a5f10.1000x1000x1.jpg", "year": "2001-12-18", "album": "MTV Unplugged"}], "artist": "JAY-Z"}