{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/3067c302983abed2fb91504570362e92.640x640x1.jpg", "title": "Check Please", "year": null, "album": "The Cleveland Show", "lyrics": "(Verse 1)\nI just want to be, Fly\nAnd pay no mind to these niggas comin' up to me askin' me about mine\nThat's why, I keep them Louis frames on my nose\nAnd, I, keep that Polo man on my clothes\nIf I was dead and they recollected\nWhy he don't rock a necklace but fresher than you expected\nDamn, why is you askin' him all these questions?\nCan't he chill for a second?\nNah, he'll get your message, on Myspace\nGet your little Jimmy Neutron head ass out of my face\nUnless you got cake\nAnd you tryna put it in my H-A- N- D\nIf not gimme dap say hey then leave\nOr neither one of them options\nI'm from where you say hello, they just look at you, keep walkin'\nSomebody call for my valet parkin'\nGave the waitress a tip, I said stay out of the dark in Cleveland\n\n(Hook)\nHold on, you did what?\nGave the waitress a tip, I said stay out of the dark in Cleveland. (x3)\n\n(Verse 2)\nYes, 2 gun clips, 216, and I'm good\nA nigga be fresh, ahead of the rest\nBut nevertheless, I'm dealin' with stress\nCause niggas is phony, fuck a new homie\nRather be lonely, niggas can't slow me down\nOr stop me, Me and my posse\nKeepin' it humble, we never stumble\nI'm from the jungle, no they won't jump you\nThey'd rather kill you, nah we don't feel you\nFuck an emotion, niggas is broke\nWith nothin' to lose except they freedom\nTakin' they chances, lookin' for answers\nEmpty those pockets, yeah, we gon' need em\n90 percent of these rappers is whack and out here in Cleveland we don't believe em\nBein' real is like a talent, most don't have, they never had it\nWe been had it, reefer addicts\nSLAB E.N.T, where dreams can happen, Damn\nDaydreamin' this whole verse\nSittin' here at this restaurant\nNow I'm full, waiter comes up and asks\n\"Is anything else you want\"\nJust respect, just the check, please\nNow we leavin', gave the waiter a tip\nI wrote stay out of the dark in Cleveland\n\n(Hook)"}]}