{"artist": "YFN Lucci", "songs": [{"image": "https://images.genius.com/c0d3f36d3796698913a9e876160eef7a.500x500x1.jpg", "year": "2019-06-21", "album": "650Luc: Gangsta Grillz", "lyrics": "[Intro: DJ Drama & YFN Lucci]\nAn important fact of success\n(DJ Lavish Lee)\nDiversify (KE on The Track)\nHow many streams of revenue can you count? (Yeah, yeah, yeah)\nI definitely need more than two hands (Uh, look, uh)\n\n[Chorus: YFN Lucci & Fabolous]\nWhat you gon' do to get dineros? (Yeah, yeah)\nAyy, do you even know what you here for? (What you here for)\nUh, get a million dollars ain't enough, bro\nYeah, I swear life will be beat you like this instrumental\n(Loso, holla at 'em)\nAyy, can't save 'em all, we ain't no heroes (Ain't no heroes)\nYou don't want it all, then what you here for? (What you here for?)\nYou appreciate them riches when you been broke\nStreets relate to it, that's my kinfolk\n\n[Verse 1: Fabolous]\nSome people want it all, some people wanted jobs\nI gotta shoot my shot, I'm playin' wanted ball\nSee that new Rolls truck like four hunnid, y'all\nAnd I'm all about my growth, don't let 'em stunt at y'all\nSome people never wanna pass, they just wanna ball\nI bet them people Trump supporters, prolly want a wall\nFuck buildin' a taller fence, I want a longer table\nAnd fuck them weak links, I want a stronger cable\nYeah, these pieces gettin' heavier\nShit, my niece is one of seven, bruh\nHuh, and these streets is gettin' messier\nLife's a bitch, but you know I keeps that fresh on her\n\n[Chorus: YFN Lucci & Fabolous]\nWhat you gon' do to get dineros? (Yeah, yeah)\nAyy, do you even know what you here for? (What you here for)\nUh, get a million dollars ain't enough, bro (Uh)\nYeah, I swear life will be beat you like this instrumental (Uh)\nAyy, can't save 'em all, we ain't no heroes (Ain't no heroes)\nYou don't want it all, then what you here for? (What you here for?)\nYou appreciate them riches when you been broke\nStreets relate to it, that's my kinfolk\n\n[Verse 2: YFN Lucci]\nUh, look\nWant it all but yet confused\nWant it all? Then get it, then, don't know what to do, yeah\nWanna ball, but get to ballin', don't know how to shoot, yeah\nWanna ball, but when they fall, they wanna call on you, hey\nI can't be keepin' it real when I'm feelin' used, that ain't cool\nNiggas always trippin', they don't tie they shoes, niggas fools\nBite the hand that feed them, there ain't no food, yeah\nShit on my hand cost a three-bedroom, yeah\nHow you gon' plan to feed you and your goons?\nNiggas say they want it all, but only if you knew\nYou got your kids, you got brothers, and your auntie, too\nAnd your mama keep callin', she sayin', \"I need you,\" yeah\n\n[Chorus: YFN Lucci & Fabolous]\nWhat you gon' do to get dineros? (Yeah, yeah)\nAyy, do you even know what you here for? (What you here for)\nUh, get a million dollars ain't enough, bro (Uh)\nYeah, I swear life will be beat you like this instrumental (Uh)\nAyy, can't save 'em all, we ain't no heroes (Ain't no heroes)\nYou don't want it all, then what you here for? (What you here for?)\nYou appreciate them riches when you been broke\nStreets relate to it, that's my kinfolk\n\n[Outro: DJ Drama]\nShout my nigga DJ Lavish Lee\nWish Me Well 3 on the way\nThis thing of ours is unstoppable, know that", "title": "Want It All"}]}