{"artist": "C-Rayz Walz", "songs": [{"title": "Make It Happen (Clean)", "album": "Mood Swing / Make It Happen", "year": "2001-01-01", "image": "https://images.genius.com/997ef6cef6768ef403ed6eedec5c2452.528x528x1.jpg", "lyrics": "[Intro: C-Rayz Walz]\nHa.  Now come on.  Now come on.  Now let’s do it\n\n[Hook: C-Rayz Walz] (x2)\nDo it right (Right).  Left to right (Right)\nKeep it hype (Hype) all night (Night)\nMake it happen (Uh huh.  Uh huh.  Live your life)\nMake it happen (Uh huh.  Uh huh.  Live your life)\n\n[Verse 1: C-Rayz Walz]\nDon’t talk about it—be it.  Get it if you see it\nWhether drunk or sober or immensely weeded, believe this\nFrom the floor to the door, go for yours—don’t be retreating\nMeaning, “Get the fuck up!”  Even if you take a beating\nFor the life I’m leading, I could get a felony, cuz\nI don’t like Bills like Hilary or Bellamy\nSwitched like Medina in Philly with a cheesesteak\nMy rollerblades cost one dollar—I’m a cheapskate\nMake it happen, captain.  This is Musical Chairs\nThe beat stop, son, and now your spot ain’t there\nYour plan failed.  What’s worse?  You failed your plan\nAll you did was talk about it to the next man and\nI hustle, get big muscles without going to jail\nGet success.  Nobody loves you when you fail\nYou want to get felt?  Become braille, balance the scales\nLife’s a track.  Spark the action, be the third rail\n\n[Hook: C-Rayz Walz] (x2)\nDo it right (Right).  Left to right (Right)\nKeep it hype (Hype) all night (Night)\nMake it happen (Uh huh.  Uh huh.  Live your life)\nMake it happen (Uh huh.  Uh huh.  Live your life)\n\n[Verse 2: C-Rayz Walz]\nI’m always at the right club at the right time\nKnowing the right promoters (Go left), skip the right line\nA quick pat-down.  Now I’m right inside\nAnd if Pat’s down, I’m right on stage, ripping the rhyme\nThrow your hands in the sky, make cloud disappear\nWhether your Timbs are scuffed or there’s blings in your ear\nUh.  Live the day and you could make this your year\n‘Cause the time is now, the place is here\nIn the 4th Pyramid was the party—(Bam!)—here it is\nExplosive like science experiments\nFrom the back, shorty’s bags packed like groceries\nGet them beads of sweat around my neck like rosaries\nYou ain’t a thug.  You bugged off the drug’s reaction\nActing like you’ll get to clapping to make it happen\nJust smack, lay back like slashing in the rain\nDon’t say jack unless it’s their music—you passing the pain\n\n[Hook: C-Rayz Walz] (x2)\nDo it right (Right).  Left to right (Right)\nKeep it hype (Hype) all night (Night)\nMake it happen (Uh huh.  Uh huh.  Live your life)\nMake it happen (Uh huh.  Uh huh.  Live your life)\n\n[Verse 3: C-Rayz Walz]\nI’m the starving artist formerly known as\nThe brother on the block you would have to loan some cash\nI made it happen on the river of life\nMoving rapid, born ripping the mic\nFrom the old school—I always skipped class\nTo plant seeds in the Earth while I played on her grass\nIt takes one to dance, two to tango\nI like fruit.  Honey fresh, look like mango\nLife is funny, but I’m dead-serious when I laugh\nUnderground lines like Jersey that stay on path\nYou can’t make it happen if you sit on your ass\nLife is full of traffic—get past it, don’t crash\nGrab the steering wheel or I’ll beat your ass\nWhat you doing now, man?  Forget about your past\nMake it happen today ‘cause it might be your last\nYou see what I’m doing now—you don’t have to ask\n\n[Hook: C-Rayz Walz] (x2)\nDo it right (Right).  Left to right (Right)\nKeep it hype (Hype) all night (Night)\nMake it happen (Uh huh.  Uh huh.  Live your life)\nMake it happen (Uh huh.  Uh huh.  Live your life)\n\n[Outro: C-Rayz Walz]\nYeah, yeah.  (Living life).  Uh.  I feel that.  (Make it happen).  Live your life.  Make it happen.  (Live your life).  Uh huh.  Uh huh.  Yeah.  Uh huh.  Do it.  Uh huh.  Yeah.  Uh huh.  Uh huh.  Make it happen.  Uh huh.  Uh huh.  Do it.  Right, left—go ahead.  Make it happen"}]}