{"songs": [{"image": "https://images.genius.com/b0dcab7759816b8e3cf45e78f11f883a.800x800x1.jpg", "lyrics": "[Intro]\nI wanna give a big rest in peace to one of my facking idols: Nate Dog\nGod damn it why did you have to die man, fack! (it’s so incredible)\nNorth Korean barbeque\nBlack clover\nBurn rain clouds burn\nBurn rain clouds burn\n\n\n[Hook]\nYou know I wiped the blood out my blue eyes\nPeople looking at me thinking that I'm too high\nBut no, I'm just saying goodbye, to the snow\nWaiting for the fireworks in July, here we go that's\nSomething I can heart (whoa)\nSomething I can heart (whoa)\nSomething I can heart for life. (okay!)\nI'm looking for:\nSomething I can heart (whoa)\nSomething I can heart (whoa)\nSomething I can heart for life. (okay!)\n\n[Verse 1]\nYou know I'm rapping beautiful to drums\nI'm looking in the mirror asking who have you become?\nMe? I've become a monster, stone\nHearted like a kid from the foster-homes\nBut I ain't seen my home in months, I don't have the luxury\nI make my living on the road, can't say I'm living comfortably\nI'm looking in the mirror asking who the fuck is he?\nI dip my paintbrush in the blood that's on my upper teeth\nDamn, I'm a gluton for the self-torture\nTell the devil thanks for punching me I fell forwards\nI only started screaming when I felt cornered\nAt the record label meeting I could smell hors d'oeuvres\nThey told me I should buy a new toupee\nThey’ll put me on the charts I could climb, I’m to hooray\nImma never let you do me like you do Lupe\nKeep your blood money bitch, good day!\n\n[Hook]\n\n[Bridge]\nPhoenix in the sky\nWe will never die\nSprinkling the ashes for the people in disguise\nPhoenix in the sky\nWe will never die\nSprinkling the happiness we need a new july\n\n[Verse 2]\nI'm like a classic impressionist painting\nWith negative space covered by excellent shading\nI'm watching lots of these veterans fading\nCause they ain’t sacrificing nothing to better what they brang\nAnd thats their own fault. Imma melt the snow with my bone salt\nMe and my stress can take a slow waltz\nGrab it by the hand, I throw it off a tall bridge, catch it if you can\nBut you don't even want it. I separated from it\nNow I'm gonna live until I'm 1 million and 7 hundred\nSo even when I die I’ll be chillin in heaven blunted (?)\nAnd probably hangin’ out with Jesus' children; forever young kid\nIt's a quality of life, see now I got the juice\nAnd me and all my demons made a truce\nI promise it's a quality of life, and this anxiety is drug-induced\nSo my sobriety will cut me loose, next! (Next)", "year": "2011-04-04", "album": "North Korean BBQ", "title": "Something I Can Heart"}], "artist": "Mac Lethal"}