{"artist": "Ant Banks", "songs": [{"title": "Only Out to Fuck", "image": "https://images.genius.com/992e30f2e51c18bd369b9f8badc632a5.772x768x1.jpg", "album": "Sittin’ On Somethin’ Phat", "lyrics": "[Goldie]\nI'm the auntie-fucking, sister-fucking, cousin-fucking\nAnd the motherfucking mack Goldie\nSo nigga flip the 40 and peep\nWhile I speak about the freaks who want to gank you\nShe went to you after sucking my dick I said, \"Bitch thank you\"\nLiving with a nigga you ain't getting nothing out of me\nMaybe one or two nuts, I doubt three, bitch\nI ain't the one to break up a happy home\nStay with that punk, while he pays you I get my nappy on\nFuck you in your booty hole, pussy hole, and mouth hole\nCause I'm the mack hard cold like the South Pole\nAs you can see I get my tramp on\nI go up in more pussies in a month than a tampon\nSuck it like you fuck it then gargle it\nOr you'll get banked like Wells-Fargo, bitch\nI'm taking a pit quick for pigeons making my dick brit\nWhich ho will the Goldie get with?\nTo fill up a cock mouth with this liquid?\nPimp down for pussy is making paper\nPut your bitch to work and stop being a ho saver\nI'm a seven day mack from Friday through Friday\nIf I can't meet you and fuck you within a week, bitch hit the highway\n\n\tBitch I don't love you (I'm only out to fuck)\n\tHoes on my tip \t       (I'm only out to fuck)\n\tBitch suck my dick     (I'm only out to fuck)\n\tHa, you know what I'm saying bitch?   (Repeat 2x)\n\n[Too $hort]\nYou see a bitch ain't nothing but a word to me\nSo bitch don't give me that third degree\nSaying you love me, do I love you back?\nI'm an ice-cold, hard ass Oakland mack\nI don't love you, it's not your turn, bitch\nYou want love from a pimp, you got to earn this\nAnd for the moment, you ain't even coming close\nYou couldn't get a job on the ho stroll\nI know you're fine, but you're flat broke\nSo hit the dank, suck my dick, and just choke\nI'll bust a nut in your contact lens\nTalk shit in your face cause you don't make sense\nYou want to see me again, when and where?\nCause all hoes can't fuck with real players\nYou'd better check yourself and find a sucker, bitch\nCause Shorty the Pimp don't play that shit\n\n[Ant Banks]\nHa, yeah bitch, fuck that love affair shit\nJust hit it, split it, quit it, and forget it\n\n(I'm only out to fuck)\n\tThe pussy, the pussy   (I'm only out to fuck)\n\tBitch suck my dick     (I'm only out to fuck)\n\tHa, you know what I'm saying bitch?\n\n[Pooh-Man]\nCool, the third verse\nFine ass, gold digging ass nurse\nShe was about 23\nTold my auntie she had eyes for me\nDark skinned and liked chocolate ice cream\nShe could be the head of my team, you know what I mean?\nShe had ass, like boo-yaa\nAnd when she see me, she great me with a big smile\nBitch tried to fade me like this\nStarted talking about her bills and shit\nShe gave me the pussy, it was cool\nThen she said her rent was due, ha ha\nI had to tell the bitch I ain't that kind of nigga\nAnd I ain't gonna be the victim of a gold digger\nBut it's cool bitch, I got my nut\nLet me get dressed, cut, because I'm only out to fuck\n\n[Ant Banks]\nHa ha, no hand outs, slut\nYou know what's up, all you getting is mouthful of nut\n\n\tBitch I don't love you (I'm only out to fuck)\n\tHoes on my tip \t       (I'm only out to fuck)\n\tBitch suck my dick     (I'm only out to fuck)\n\tHa, you know what I'm saying bitch?   (Repeat 2x)\n\n[Ant Banks]\nA lot of hoes in the town are going nuts\nThey think they getting ends cause they giving up the guts\nBut who you think you breaking, from me you gets nathan\nI know I said I loved you, but bitch I was faking\nSee Ant Banks is a nigga you can't fade\nYou don't get paid off of what I made\nYou gets dick, nothing more and nothing less\nNut in your mouth or maybe nut on your chest\nAnd I be serving 'em up something vicious\n*slurp* (Mmmmm, delicious)\nNow you know I'm making with the dick I'm packing\nThese hoes get jacked from the back end\nBut I don't get sprung or even took\nYou just listen to the hook, tramp\n\n\tBitch I don't love you (I'm only out to fuck)\n\tHoes on my tip \t       (I'm only out to fuck)\n\tBitch suck my dick     (I'm only out to fuck)\n\tHa, you know what I'm saying bitch?   (Repeat 2x)\n\nYeah, for all you stupid hoes out there\nWho didn't know a nigga was out to fuck\n\n\tAyo Tina, bitch         (I was only out to fuck)\n\tMmm, talking bout Tanya (I was only out to fuck)\n\tAnd even Racia          (I was only out to fuck)\nHa, you know what I'm saying, bitch?\n\n\tFake ho Moeshia         (I was only out to fuck)\n\tPunk-ass Lisa           (I was only out to fuck)\n\tDick-sucking Tracy      (I was only out to fuck)\n\tHa, stupid-ass bitches, ha ha, yeah", "year": null}]}