{"artist": "Angel Haze", "songs": [{"title": "Look What You’ve Done", "image": "https://images.genius.com/94752f8107601b005d0ccd537b1f7727.500x500x1.jpg", "album": "Voice - EP", "lyrics": "[Speaking:]\nKinda wanna talk about myself today\nWe'll call this shit honesty hour\nYeah, alright\n\n[Verse 1:]\nIt's like mid '91 and I'm her growing pains\nAnd she saying\n\"You should change, you don't have to go that way\"\nBut then you walk out and you do you\nAnd you telling her that you knew\nYou would do something that day\nEven though, I was on my way\nAnd it hurts me cause you knew that\nYou took the pistol, you pulled back\nDidn't think that nigga would of fought back\nDidn't think one shot could of caused that\nAnd I hate you, I hope you know this shit\nTears wanna fall, lemme hold that shit\nGet what you give when you sold that shit\nCan't really understand how we go that quick\nI used to pray that God would give you a second chance\nYou know, maybe then you would be a better man\nBut, you dream until you realize\nEverything runs, especially the tears cry\nEven after all of the years I, probably never know what it feels like\nDamn, and you don't know what I've been through\nIf Hell is where they sent you\nThen dare I say, that I've been too\nAnd maybe we were together for a moment\nEven though I never really shown it\nEvery cut hurts so much more\nWhen there ain't nothing to put on it\nAnd boy you should of seen my mom\nGot hurt, but she did a damn good job\nI was one of the smartest in my class\nDad, I worked so damn hard\nAnd I got through it all\nEven when they hurt and raped me\nBut I can't let go of the thought that\nYou probably could have saved me\n\n[Hook:]\nBut I got it (I got it)\n(Yeah)\nCause pain hurts but it heals too\nAnd after all this shit that I've been through\nI got it (I got it)\n(Yeah)\n\n[Hook:]\nLook what you've done\nLook what you've done\nLook what you've done for me\n(Oooh, yeah yeah)\nWhen life's hard, it means something\nYou get through, you gon' be something\nYou got it (you got it)\n(Yeah)\nLook what you've done\nLook what you've done\nLook what you've done for me\n\n[Verse 2:]\nIt's like '06, 6:30 in the early A\nMy mom wakes me and my brother\nAnd says that we're going away\nAnd then my stomach tightens\nMy heart drops, then I start to shake\nAnd we pack up and before long we were on our way\nAnd I, just keep remember thinking\nWhy the fuck do we gotta keep leaving?\nWhy does everybody wanna fucking hurt us?\nSomeone give me a good reason\nThen I looked to the left and seen those tears on my mother's face\nAnd I thought somewhere inside\nShe was just wishing herself to another place\nAnd we ain't have no where to go\nSo they put us in a shelter\nSeemed like no matter where we looked\nNobody could really help us\nAnd we ain't have no food\nNothing in my stomach for like 30 something nights\nNever saw it coming, I got perfect fucking sight\nMy mother cried on her knees like every fucking night\nAnd nothing really hurts like that\nYou ever feel like dirt like that?\nDid you ever lose your worth like that?\nThen you don't know the hurt I got\nAnd you don't know the work you got\nThat's what my mom would always say\nWhen the devil try to bring you down\nGod would send all these ways\nHow did she have all that faith?\nI swear I would of given up on it\nBut even after all that pain\nShe was still there, on her knees, calling\nAnd I don't really get that\nI was never fully with that\nBut every time she called on God\nHe was always quick to get back like\n\n[Hook:]\nYou got it\n(Yeah)\nCause pain hurts but it heals too\nAnd after all this shit that I've been through\nI got it (I got it)\n(Yeah)\n\n[Hook:]\nLook what you've done\nLook what you've done\nLook what you've done for me\n(Oooh, yeah yeah)\nWhen life's hard, it means something\nYou get through, you gon' be something\nYou got it (you got it)\n(Yeah)\nLook what you've done\nLook what you've done\nLook what you've done for me\n\n[Bridge:]\n(Uh, yeah)\nYou knew that I was gon' be something\nYou stressed out and you need something\nI got you\nAnd when life's hard, it means something\nYou go through, you gon' be something\nYou got it\n\n[Verse 3:]\nIt's 2011, I'm crazier than I ever been\nAnd I still get blessed, yeah blessed, like I never sin\nAnd I think I feel good about myself again\nIt just get hard sometimes, when you feel like you never win\nI know, boo hoo, sad story\nYoung and addicted to that glory\nNever thought that love could hurt me\nI never predicted that it could be that gory\nBut I still give my all\nYeah I still give my all\nTil the sky becomes the sea\nTil everything in heaven calls\nGotta stay strong\nI gotta let down my guard\nGotta let them see my truth\nGotta let them see my scars\nYeah, look what they've done\nLook what they've done\nWhat I've become (hey)", "year": null}]}