{"songs": [{"image": "https://images.genius.com/5558befb83c1a20447e8e59fc8c93648.999x1000x1.jpg", "title": "Horny Honeys", "album": "The Sexorcist", "year": "2005-08-02", "lyrics": "[Hook]\nHorny honeys get the dick\nI got love for you wild anal chicks\nAll of you co-eds\nYou better lick or suck\nI'll shoot loads of cum in your holes\nThere's a lin mouth-watering centerfold\nYou're so kinky\nTell me your fantasies\n\n(Necro)\nWe're in a dance club somewhere in France, my hands rub your ass through your pants I'm mad drugs, in a trance. No need to know a honey's name, as long as she's into fun and games, I'm gettin fucked from the fame, rippin your cunt out the frame, leavin your buns in pain, put your tongue down my vein, I'll fuck a hundred dames. When I'm seventy-five years old, I'll still be putting my dick inside a hole, because I'll always stay young in the brain. You know the deal-y, I got these girls really naked, and touchy-feely they wanna get slutty and cheerlead, they really, wanna fuck me and hear me, kick a rap about how I leave their pussy's bloody, sincerely. You got a G-string strangling your puss, and a neatly trimmed, beautifully cut traingle bush. Grab my cock like a mic, sit on it like a bike, my pipe will strike a dyke like a spike\n\n[Hook]\nHorny honeys get the dick\nI got love for you wild anal chicks\nAll of you co-eds\nYou better lick or suck\nI'll shoot loads of cum in your holes\nThere's a lin mouth-watering centerfold\nYou're so kinky\nTell me your fantasies\n\n(Goretex)\nWhat's up, ma? You in them green shorts that I like, a black tank with your hair up when you spit on the pipe. Lickin blunts with one hand, the other crushin up Vikes, take some medicine like a good girl, dust this, she my A of life, rock stockings, pig tails cover your tits, I love your face looking up at me, suckin fingers, all in your clit. Fat lips, mission impuffy, she likes it rough, wrappin the whip, my hands around her close, she uncuffed me, born to watch, homegirl, tastin your furry, her face in your crotch, under pentagrams is blurry, poundin dat ass, the kitchen morning, time before Maury. Ten AM is ATM, she finds ways to adore me. You fucked up Steph, this next bitch is switched to sure, she always beats in latex and get erect on the toilet, importing slaves. Ma, my game's amazing like Federline's, suckin me off, shoot it off before the hook, there ain't no better time\n\n[Hook]\nHorny honeys get the dick\nI got love for you wild anal chicks\nAll of you co-eds\nYou better lick or suck\nI'll shoot loads of cum in your holes\nThere's a lin mouth-watering centerfold\nYou're so kinky\nTell me your fantasies"}], "artist": "Necro"}