{"songs": [{"title": "Beware", "album": "Hall of Fame (Deluxe)", "year": "2013-06-25", "image": "https://images.rapgenius.com/1ff2a07308cc1e4220438831c88d69db.475x475x1.jpg", "lyrics": "[Chorus: Big Sean and Jhene Aiko]\nWhen you said it was over, you shot right through my heart\nWhy you let these hoes tear what we had right apart\nOoh, I was so mad, I should've seen this coming right from the start\nYou should beware, beware, beware of a woman with a broken heart\n\n[Verse 1: Big Sean]\nPraying to a sky all black\nLooking at the stars like they finna talk back\nLooking at my phone like she finna call back\nBut last night I feel like probably ended all that\n'Cause by now she woulda sent a text in all caps\nThen another one tryna take it all back\nSaying fuck you, I miss you or I hate you so much\n'Cause girls only say \"hate you\" to the guys that they love\nI know, I know, I know\nThe highs, the lows it comes and goes\nYou say \"be real\" I try, I don't\n'Cause you take anything and just make it everything\nKept my phone on silent ever since you got a ring (Funny, right?)\nAnd I never cheated (I mean, maybe once, twice)\nOne time don't change everything\nShe ask why I don't feel the same, I'm still the same\nShe's still insane and now she's saying\n\n[Chorus: Big Sean and Jhene Aiko]\nWhen you said it was over, you shot right through my heart\nWhy you let these hoes tear what we had right apart\nOoh, I was so mad, I should've seen this coming right from the start\nYou should beware, beware, beware of a woman with a broken heart\n\n[Interlude: Big Sean]\nOkay, skeet, smoke, sleep, call, miss, text, woke, spoke\nLie, feel, Lisa ew, time, kill, months, still\n\n[Verse 2: Big Sean]\nI got somebody baby mama calling me daddy\nI drank too much, please call me a cabby (swerve)\nPenthouse after party hoes want that addy (swerve)\nFuck they can ride with us, crawl in a Caddy\nThird row is when you call, I hit cancel\nReally? I hit answer, fuck I hate when that happens\nPhone in my pocket for the whole night\nAnd you heard bitches screaming 'til my phone died\nThen she text me like \"Why you still talk to my mama?\"\nHow the fuck you run around with condoms?\nWhy you make me get this tattoo?\nMan, fuck this tattoo you the reason I wasn't single in college\nWhat? All because I had you, nigga I don't even have you\nHow am I suppose to get past you?\nAnd she called the next guy spillin' some real shit\nNow they problems that he gotta deal with\n\n[Chorus: Big Sean and Jhene Aiko]\nWhen you said it was over, you shot right through my heart\nWhy you let these hoes tear what we had right apart\nOoh, I was so mad, I should've seen this coming right from the start\nYou should beware, beware, beware of a woman with a broken heart\n\n[Verse 3: Lil Wayne]\nGirl, don't believe them hoes\n'Cause they don't wanna see us together\nAnd you already know you're too fly\nBut baby, don't get your hair caught in the propellers\nI be tryna tell her these hoes is jealous\nYou know they never like it when you never say never\nLong hair, red bone, but her pussy is hairless\nMuah, I french kiss it like we in Paris\nI be screaming out, \"ain't no woman like the one I got\"\nBut she be always worrying about the one I fucked\nShe said it's gonna be me, myself and I\nDamn, that would make me a one-eyed fuck\nSch, I was so mad\nDamn, you used to ride a nigga like a moped\nBut players fuck up, my bad\nAnd just to keep from crying, I laughed\n\n[Chorus: Big Sean and Jhene Aiko]\nWhen you said it was over, you shot right through my heart\nWhy you let these hoes tear what we had right apart\nOoh, I was so mad, I should've seen this coming right from the start\nYou should beware, beware, beware of a woman with a broken heart\n\n[Outro: Jhene Aiko]\nBaby, last time calling me baby\nLast time calling me crazy, crazy, crazy\nBaby, last time calling me baby\nLast time calling me crazy, crazy, crazy"}], "artist": "Big Sean"}