{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "Frank Einstein", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "[Verso 1]\nOkay, disseste que não 'tava preparado\nCaguei, limpei o cu e entrei com o meu style marado\nSou bem parvo, no stress, 'tou degolado\nCabeça sempre na lua, a ESA já mandou o contracto\nNao assino nada, mando o mambo todo tagado\nTop dawg motherfucker, pata suja do outro lado\nChapado bro com paleta Charlie Chaplin\nRasgo a Page, fumo a Plant e parto num Led Zeppelin\nUk babblin', babando me na bunda da Gavlyn\nTopa só que isto é lindo, a puta parte no booty clapin'\nDesde puto rappin', fuckin' rapper de rapina\nTipo a mascote do benfica\nMas mascando mescalina\nMastigando uma doutrina que nem o papa domina\nRegurgito o meu saber, deixa só que o Prof ensina\nO chão do game inclina e eu ataco para cima\nE só para dar mais pica boto na sola vaselina\nSe calhar sou fake nigga, faz outro take nigga\nTou a falar serio johny, ta bacano? então siga!\nSem estrica na dica, tipo NG, só coca lírica\nEscrevo mais uma linha a medida da tua narina pah\nSou tipo linedealer mas sem profit existente\nMinha shit vicia, viras proficodependente\nAcredita player, injecta a faixa na veia\nDeixa-te la em cima e se tiveres pressa tens boleia\nVou rumo ao topo, só que o topo sabe a pouco\nE sozinho lá em cima aborreço-me a jogar o jogo\nQuem vem comigo? vou fazer uma expedição\nNão se paga nada, só tens que ouvir com atenção\nNão quero salário, isso só faz mal à tensão\nMuitos morrem de colesterol porque já só querem parmesão\nE os que falavam há pouco? boy agora onde é que 'tão?\nJuro que os ouvi a falar, deve ter sido impressão\nEntão liga a cam, bora la fazer um clip\nMa nigga sou profjam, um tipo que vive num beat\nBatucando a street toda, safoda a puta da pide\nE já que a dama excita, shit, bora la fazer um feat!\nRemix do lollipop, lick lick no teu clit\nO nicho dela é o hiphop, ela spita no meu dick\nTrafica some good shit, a booty com o bass faz boom boom\nO ass dela pinga lsd, eu tripo com aquele bumbum\nYou think I give a fuck? tens razão, toma lá um\nEla pede mais uma fuck, quer subir mais que o cume\nAfundo o submarino, ganho a batalha naval\nEla pede o meu fogo e eu levo com o squirt final\nBebi da pussy dela, vou trippin mais um bilénio\nEsse alucinogéno alucina o génio\nIngénuo mas guloso, how's life? mine's fine..\nSou génio monstruoso - frank-einstein\n\nFrank-einstein, frank-einstein, génio monstruoso - frank-einstein\nFrank-einstein, frank-einstein, génio monstruoso - frank-einstein\nFrank-einstein, frank-einstein, génio monstruoso - frank-einstein\nFrank-einstein, frank-einstein, génio monstruoso - frank-einstein\n\nNão saio da golden age, isso era la pros states\nEu paio gold no stage c'um brain old cheio de breaks\nWeca-weca, scratch na boneca\nTa com comichão, é a comissão do atleta, blergh\nGuarda a guita chica, paga-me com amor\nEu sou tipo o jigga mas menos produtor\nÉ que o produto todo ta dentro de um puto louco\nSobretudo pouco chega pr'o puto ficar doido\nBo sta dodo, a mim ta crazy\nBiggie flow, baby baby\nNaah o beat é mesmo o meu recreio\nSe eu bebo e ofendo quem vende é porque eu sei quem tem o meio\nEmpresas presas a preços, nem pensam no peso qu'eu deito\nOdeio como esse teba chega la com o CD cheio\nDe merda tipo intestines e testies cheios de leite\nInveste nisso e pede guito p'ra filmares outro harlem shake\nMas depois chama-me fake, não te esqueças, por favor!\nEu sou 'tão fake que o verdadeiro da me o direito de autor\nDevo ter jeito p'ra promotor, fuck that, sou extintor\nApago hot niggas com nove figures, sou um cheque gordo\n\nE o nigga fica comprado\nJá domina o mercado\nAgora é adorado\nAte ao dia que será queimado vivo\n\nE logo vem outro\nE logo vem outro\nE logo vem outro\nDepois desse vem outro\nDepois desse vem outro\nEsse é o ciclo\n\n\nFrank-einstein, frank-einstein, génio monstruoso - frank-einstein\nFrank-einstein, frank-einstein, génio monstruoso - frank-einstein\nFrank-einstein, frank-einstein, génio monstruoso - frank-einstein\nFrank-einstein, frank-einstein, génio monstruoso - frank-einstein", "year": "2014-06-06"}]}