{"songs": [{"year": "2011-12-31", "title": "Midnight Run", "image": "https://s3.amazonaws.com/rapgenius/Into-The-Wild-Artwork.jpg", "lyrics": "[Intro Hook]\nIt's hurting my eyes, it's hurting my ears\nI know, I know, I know there'll be tears\nYou're hurting inside, been hurting for years\nI know, I know, I know there'll be tears\nLife's never that clear\n\nOn another midnight\nOn another midnight\nRun\n\n[Verse 1]\nIt's a long way down without a chute ain't it?\nWell I ain't leaving any time soon baby\nSo call the media, press and paparazzi\nGot some things on my chest, I got up off me, yeah\nCause its easy to lose your mind, when you never in the same place, never had the time\nThe girl you love at home, slowly starting to despise\nExcuses you keep throwing, that I knowing that they lies\n\nShake your head, won't look you in the eyes\nHoping that your lawyers tries to catch one of the lines\nAnd catch one of the lies\nAnd try to put and end to your career\nBut really turn in being blessing in disguise\n\nSix comma zero zero zero comma zero zero zero\nYou the man\nKinda\n\nThey call that work, but works not whats its called\nDon't forget how much you wanted it before you had it all\nYeah\n\n[Hook]\nOn another midnight run, sniffin for trouble, unlucky for some\nOn another midnight run, I'll still be breathing come the morning sun\nIt's hurting my eyes, it's hurting my ears\nI know, I know, I know there'll be tears\nYou're hurting inside, been hurting for years\nI know, I know, I know there'll be tears\nLife's never that clear\n\n[Verse 2]\nIt's a long way down without a chute ain't it?\nWell I ain't leaving any time soon baby\nSo tell your favorite blogger or magazine, to get on it while its hot\nThese stories still got the steam\n\nIt seems\n\nMusic is the reason I'm alive\nAnd karma while it sucks, seems to always pick a side\nThe lows come to level with a monumental high\nWas lost on navigation, now I happened to be fine\n\nOh\n\nI get it, stay loyal to your M\nI said fuck money, stay loyal to my friends\nBecause when it runs out, you'll be looking for a pen\nBut they're ain't no one to write, was it worth it in the end?\n\nNah\n\nAnd when you think about it, it depends, huh?\nI know the answer, ain't got to pretend \"huh?\"\n\nThey call it work, but works not whats its called\nDon't forget how much you wanted it before you had it all\nYeah\n\n[Hook Outro]\nOn another midnight run, sniffin for trouble, unlucky for some\nOn another midnight run, I'll still be breathing come the morning sun\nIt's hurting my eyes, it's hurting my ears\nI know, I know, I know there'll be tears\nYou're hurting inside, been hurting for years\nI know, I know, I know there'll be tears\nLife's never that clear\n\nOn another midnight\nOn another midnight\nRun", "album": "Into the Wild"}], "artist": "Sammy Adams"}