{"artist": "AZ", "songs": [{"title": "Envious", "image": "https://images.genius.com/e5e2a8b3671c0f8af14faf178e669b52.500x500x1.jpg", "album": "A.W.O.L.", "lyrics": "[Intro: Bounty Killer] (AZ)\nCross!!! Angry!!! (Yeah!)\nAiyyo you know it's Bounty Killer and AZ (Stand in attention)\nNo if's no buts no maybes (Single file)\nAiyyo yallo! Motherfuckin niggas clear out (Carry your flags)\nWarlord in the buildin (It's the art of war)\nAiyyo yallo! I got this fuckin forty five willin\n(Fire they lost power) I caught dem stealin\n(Bounty Killer) yo!!! (AZ) Lawd a mercy (Soldiers at war) huh!\n\n[Verse 1: AZ]\nIf you Crip get your Crip on sip get your piff on\nNever slip I'm in the mix with the fifth long\nNever riff see me fixin on my lip balm\nChip charm chillin with them Gucci kicks on\nBut like the Kiss song niggas get shit wrong\nTo a bliss fully flipped and they gettin pissed on\nLife ain't a sitcom gotta keep your wisk on\nShit niggas bitch other snitch like Nick Bonds\nPick chrones pick 'em up switch pawns\nPick 'em up get 'em tuck get gone see it's on\nSome got warned got laid got torned\nGot shot got saved got mourned\n\n[Hook: Bounty Killer]\nWar dem want with us, why they come start it up\nWe know they won't give up, when they gone bite the dust\nThey are envious, so our guns we buss\nIn the lord we trust, war they wantin\n\n[Verse 2: Bounty Killer]\nRun up inna mi gun an yuh a mystery\nDi last dem see yuh and di rest a it a mystery\nRush mi wid knife an promise yuh a guh fist mi\nBadman nuh trace an crab like big seh\nBullet mi a guh gi dem bout 60\nFriend from him could, him haffi leave yuh in a jifty\nGunshot a mek di fassy speak inna gypsy\nFrom Brooklyn to Poughkeepsie croosss\n\n[Hook: Bounty Killer]\nWar dem want with us, why they come start it up\nWe know they won't give up, when they gone bite the dust\nThey are envious, so our guns we buss\nIn the lord we trust, war they wantin\n\n[Verse 3: AZ]\nI'm cool with them Pirus cool with them die moves\nAny death this way niggas a die too\nCry who y'all won't do me like Ja Rule\nJewels all sky blue smooth since High School\nFuck with a why do with me it's why who\nYou sneeze you liable to leave we hostle\nYoung apostle, son of pop duke\nCop cruise to move to top roof\nGot loose and left them high stoops\nThe rest is my new respect to my troops\nGive me boose some juice some grey Goose\nAnd word to Jesus it's back to Beirut\n\n[Hook: Bounty Killer]\nWar dem want with us, why they come start it up\nWe know they won't give up, when they gone bite the dust\nThey are envious, so our guns we buss\nIn the lord we trust, war they wantin", "year": "2005-09-06"}]}