{"artist": "King Los", "songs": [{"image": "https://images.genius.com/af979fd34aa3f95d652a83f4bdfdf39a.538x538x1.jpg", "title": "Angel In A New Dress", "year": null, "album": null, "lyrics": "[Produced by Bink! and Mike Dean]\n\nI dedicate my everything to ya’ll, I’m over-faithful\nIn the world where everyone that love you, grow to hate you\nMy motive ain’t never to knock you it’s to motivate you\nDear momma I love you and your glow is graceful\nNotice I had to shout-you-out on something slow and tasteful\nFor my girl, I miss every minute I don’t embrace you\nYou better not never leave a nigga, how I’m gonna replace you?\nTo my ballers getting money, thinking dough will make you\nChasing them hoes, just get your paper and them hoes will chase you\nDon’t ever mention me with niggas I don’t relate to\nI’m so driven boy, if you listening my flow’ll take you\nYou heard Los on ‘Freedom of Speech’, I think he going racial\nNever that I’m just dropping knowledge, tryna flow-icate you\nSo in the midst of your troubles just keep going straight thru\nYou going straight, keep your chin up don’t let opponents break you\nAnd I give glory to God because I know what it takes to\nFor him to show a breakthrough you got to show him faith too\nSo I be more than faithful even though no one’s label wants to sign you\nUnless it’s a show that can go on cable\n\nUh, get off my dick hater, quit that old girl shit\nCity on my back, flip it till it some whole world shit\nNow all the fly ladies screaming ‘you go boy’\nAll the backpackers screaming ‘we seen you on 2dopeboyz’\nDamn no way that Nas ain’t sign you yet\nYou ain’t pressing the vinyls going viral yet\nYea huh, Guess how I spiral that, I can do all things through Christ\nHomie you ain’t read the bible yet?\nNow where all my rivals at, lets kick this disrespect off\nMy flow move mountains, and ya’ll niggas need to step off\nLike my step dad when he stepped and I was left off the right track\nBut then I came right back and never stepped off\nI’m just talking, I ain’t even rapping\nTell you what, let’s pretend this shit ain't even happen\nI take these niggas for a joke and I ain’t even laughing\nSo if I’m reaching for this pound, I ain’t even dapping\nFuck sleep I ain’t even napping\nThis shit was more like poetry but I ain’t even snapping\nIf my past couldn’t stop me what could?\nThe crown ain’t safe in the hood, whats good"}]}