{"songs": [{"album": "Identity Crisis", "image": "https://images.genius.com/48c0cb108f652a1188a862412a81d930.640x640x1.jpg", "year": "2009-05-26", "title": "Make War", "lyrics": "[Intro: John Piper]\nI hear so many Christians, murmuring.. about their imperfections\nAnd their failures, and their addictions and their shortcomings\nAnd I see so little war! Murmur murmur murmur...'why am I this way?'\nMAKE WAR!\n\n[Verse 1:Tedashii]\nBang with me\nBang Bang Ba-Bang with me\nNever playin' games man cause this this thing can get frisky!\nSo man if you in Christ, take up your cross quickly!\nStand fearless on the frontline -Time to come with it (Ey!)\nDo the right thing\nWake up and let's get it\nI ain't even in the ring, they're throwin' bows like Riddick (Who?)\nPersistently attacking me they even in the back of me\nIts either fight or loose your life\nAnd I can't take this passively\nSo what you think I'm bout to do?\nI'm bout to do what I can do\nTrust the One who got me through and fight like it was after school\nNever giving up, steady standing on the battlefield\nFeet firm to the ground like I stepped on Chapel Hill\nFlesh feelin' frisky, sin persuades and tempts me\nSatan cheers me on-guilt followed by conviction\nIts the same old trap, and we fall like we're defenseless\nWork your senses, grow in wisdom\nStand firm and be relentless\n\n[Chorus: Tedashii & Flame]\nI make WAAARRR\nCause sin never sleeps\nIts got me in a trance\nYou can see it in my dreams\nI make WAAARRR\nMan I beat my flesh- to the death\nEvery breath like I beat my chest\nI make war\nSun up\nI make war\nSun down\nI make war\nTime in\nI make war\nTime out\nI make war\nAgainst lust\nI make war\nAgainst pride\nI make war\nAgainst me\nI make war\nTill I die\n\n[Verse 2: Flame]\nDo YOU even have a clue what happened to you when He died?\nWhen that tomb got rolled?\nWhen He rose in the sky?\nI think we emphasize sin so much\nThat it makes us paralyzed\nAnd glorify struggle so much\nThat it makes us terrified\nAnd DE-emphasize the fact that we have been sterilized\nFrom our old lives and thus\nGod, this ain't never wise!\nWe gotta snap out of it, we ain't in no straight jackets (We free!)\nWhen Jesus died, in our lives something strange happened\nHe gave us power, yeah I know that we're sinners\nBut since He rose He's renewing the image of God in us\nNow we gotta start makin' WAR\nNow we can start sayin' NO\nTo the fleshly impulses that Jesus Christ was paying for\nNow we can start taking the lead just like the Dalai Lama\nAnd start going all out just like a suicide bomber!\nWhatever the sin is we gotta go go go harder\nBy His grace, no time to waste\nJus-jus-just like there's no tomorrow\n\n[Chorus: Tedashii & Flame]\nI make WAAARRR\nCause sin never sleeps\nIts got me in a trance\nYou can see it in my dreams\nI make WAAARRR\nMan I beat my flesh- to the death\nEvery breath like I beat my chest\nI make war\nSun up\nI make war\nSun down\nI make war\nTime in\nI make war\nTime out\nI make war\nAgainst lust\nI make war\nAgainst pride\nI make war\nAgainst me\nI make war\nTill I die\n\n[Verse 3: Tedashii]\nI'm a Christ REPPER-senter, finna stand and deliver!\nA lot of my BE-lievers struggle with their agenda\nI drop this on a ADAT, just so you could come playback\nA hit to be encouraged that rocks you with truth from way back!\nListen to it asap!\nLike you do a Lecrae track\nI'm spittin written visions to put on heads like a wave cap\nSinning? Nah we don't play that\nThat's the way that a slave acts\nI'm filled with the spirit and tell 'em dawg 'this is payback!'\nAs you begin to copy the carbon copies of Christ\nAnd conform to his written image you should be shining the light\nIf you're not, why is that?\nIs it fear that's been grippin' you cause you scared they'll be dissin you\nFlippin' birds while they spit at you?\nIf you're not, why is that?\nIt don't matter so bump it\nPerfect love cast out fear - He ain't save us for nothin'\nThis is a priviledge (Priviledge)\nYour life to give to Him (Give to Him)\nSo stand firm for him dawg and lets get it in, uhh!\n\n[Chorus: Tedashii & Flame]\nI make WAAARRR\nCause sin never sleeps\nIts got me in a trance\nYou can see it in my dreams\nI make WAAARRR\nMan I beat my flesh- to the death\nEvery breath like I beat my chest\nI make war\nSun up\nI make war\nSun down\nI make war\nTime in\nI make war\nTime out\nI make war\nAgainst lust\nI make war\nAgainst pride\nI make war\nAgainst me\nI make war\nTill I die"}], "artist": "Tedashii"}