{"artist": "Willie the Kid", "songs": [{"year": null, "lyrics": "[Intro:]\nYou wanna know what was happening\nWhile you were living it up in Mali or Cali or Yahweh whatever it is\nThere was 15 murders the first week and 21 last week in this Goddamn city\nYou know decent people are gonna have to work here and live somewhere else\n[By decent people you mean people who can afford to live somewhere else]\nFor Christ you are such a bleeding heart Liberal\n[My heart bleeds a little for the underprivileged, yeah]\nIf I was at the field they'd be back in the war zone\n[?] Hawaii\n[Seemed pretty good until they ran in the sand and used to live with the crime rate statistics]\nNo what this city needs is more police than people\n\n[Verse 1:]\nYeah! Yo yeah\nWitness me making eclipse\nBake pies at red night escaping ma myth\nSwore 4 plus 5 oracle bore gift\nPlus explore your life show you how the lords spit\nSince 79 held the spine order more clips\nWorked with los Orvich try to build him a bridge\nThat shit collapsed with ma back fucking the ribs\nGet blasted for looking all grand in front of ma crib\nSit back close your legs drown in the box\nPound up with 2 Glocks, dumb out with the Ox\nThe fluids out shoot it out till sundown with the cops\nNo running we [?] the world is mine on a yacht\nSoon they probly find me like a body in a lot with blue suites behind me\nWith the shotty pulled cop\nNew suites in lobby and we value all flocks\nNever recent quotes preaching for that Jack Iglesias\nTold Torres like Papi Mase and catching cases but they cold\nEmployees know the faces who to stretch and who to fold\nGet old eat off rap manifest all gold\nPlots for more gold and Grey robbers playing dominoes\nGot Raul put you in piece caplo waiting at ma home\nSo sick no pharmacist would enter the room\nNew York trip PA flab foot [?]\nI'm off it playing in salon resting ma wound\nMa talk spit body outlined floating in June\n\n[Chorus:]\nWhere am coming from [Yeah! bronze man]\nI don't really mean you no wrong [it's Willie The Kid]\n[Gun wu] I gotta keep moving on [Pull up a chair we here nigga]\nI gotta Let you know where I'm coming from [TCP nigga, Ayo]\nI don't really mean you no wrong [we do it like this nigga]\n\n[Verse 2:]\nI said Um!\nI said lagavulin nigga who you fooling\nI'm never Jet lagged these dudes is Lorna Doones\nThe fly i'm in Dubai hitting sand dunes\nOr in Japan on the bullet train Cancun\nWe used to use Cancun to balance off the sofa\nNow we don't touch the steering wheel Rover with the chauffeur\nI'm in Muskegon Jet-skiing for the weekend\nOn the lake shore, told ma niggas make sure this time everything remain genuine\nSee ma end your windows continuing\nMove like a bed wind\nBreakfast in bed pop Spades no bentwisch a bad bitch wiska bisque\nYeah! Despite the madness i'm perfectly insane. Psycho-telepathic\nTelepathy, rooms full of sneakers closets full of Jings\nBring Jackets on the bed fuck it I ain't sleeping anyway\nJewels by the penny way I'm more than ready\n\n[Chorus:]\nWhere am coming from [Yeah!]\nI don't really mean you no wrong\nI gotta keep moving on [Pull some next shit]\nI thought I had to know, where am coming from\nI don't really mean you no wrong\nI gotta keep moving on\n\n[Outro:]\nComing [x6]\n[?]\nHey please excuse our little brother\nPlease forgive him\n[Ha Ha Ha Ha Ha Ha, it's alright his tan boxing is not bad he nearly beat me]", "image": "https://images.genius.com/d7852f2379b2be35cbd3ecda80338de1.500x500x1.jpg", "album": "The Living Daylights", "title": "Coming From"}]}