{"artist": "Pusha T", "songs": [{"album": null, "title": "The Story of Adidon", "image": "https://images.genius.com/eae929c7cb87cf2590b0afdd9c6c6039.1000x1000x1.png", "lyrics": "[Intro]\nEasy money\nIt's about to be a surgical summer\nChop the tops off the coupes\nThe cuatrociento' ochenta y ocho\nThe Spider joint\nAnd you know we gotta cut the heads off these snakes, right?\nWatch the body drop\n\n[Verse]\nDrug dealin' aside, ghostwritin' aside\nLet's have a heart-to-heart about your pride\nEven though you're multi, I see that your soul don't look alive\nThe M's count different when Baby divides the pie, wait\nLet's examine why\nYour music for the past few years been angry and full of lies\nI'll start it at the home front—I'm On One\nDennis Graham stay off the 'Gram, bitch, I'm on one\nYou mention wedding ring like it's a bad thing\nYour father walked away at five—hell of a dad thing\nMarriage is somethin' that Sandi never had, Drake\nHow you a winner but she keep comin' in last place?\nMonkey-suit Dennis, you parade him\nA Steve Harvey-suit nigga made him\nConfused, always felt you weren't Black enough\nAfraid to grow it 'cause your 'fro wouldn't nap enough\nSince you name-dropped my fiancée\nLet 'em know who you chose as your Beyoncé\nSophie knows better as your baby mother\nCleaned her up for IG, but the stench is on her\nA baby's involved, it's deeper than rap\nWe talkin' character, let me keep with the facts\nYou are hiding a child, let that boy come home\nDeadbeat mothafucka playin' border patrol, ooh\nAdonis is your son\nAnd he deserves more than an Adidas press run; that's real\nLove that baby, respect that girl\nForget she's a pornstar, let her be your world, yuugh!\nHow dare you put Ye in my verses?\nI'm selfish, I want all of the curses\nI'm pre-bookin' the churches, me versus three hearses\nIf we all go to Hell, it'll be worth it\nAlready aligned with the greats, and on that same note\nThe only ones I chase are two ghosts\nStill givin' you classics, that's the only thing that dates me\nOVO 40, hunched over like he 80—tick, tick, tick\nHow much time he got? That man is sick, sick, sick\nI got the devil flow, nigga—six-six-six\nSurgical summer with it—snip, snip, snip\nAnd you don't really want it with him\n\n[Outro]\nSurgical Summer, Volume 1\nWe gon' take this slow\nWe just gon' peel it back layer-by-layer\nYeah, DAYTONA\nAlbum of the motherfuckin' year\nAnd you talkin' 'bout you upset\nHahahahaha\nWell, I wanna see what it's like when you get angry, okay?\nYou show me that\nPush!", "year": "2018-05-29"}]}