{"artist": "Famous Dex", "songs": [{"year": "2019-05-07", "album": "Momma’s Boy", "image": "https://images.genius.com/cc47d28b8efa09eea9ddb963d09e6aff.1000x1000x1.jpg", "lyrics": "[Intro: Famous Dex & Lil Gotit]\nDamn\nI got motherfuckin' slime here too with me, man\nI'm talkin' 'bout, she so...\nHood Baby\nWhat the fuck?\nGrimes, you see this shit?\nHold on, fuck\nI can't believe my eyes\nDexter! (Damn)\nOoh, uh-yeah, uh-what?\n\n[Verse: Famous Dex & Lil Gotit]\nI walk in the room, a bunch a lil' cuties (What?)\nI wanna feel on her booty (God damn)\nShe wanna go to the movies (Woo)\nCome to my house and get in the jacuzzi (Yeah)\nDo- doin' lil' ho, she a cutie (Doin')\nI'm ridin' around in a coupe, she in a two-piece (Skrrt, ooh)\nJust like a famous movie, we ridin' around shootin' shit up to Nudy (Brrt)\nPop me some Percs and get to it (Percs), I get me some ones to slap on her booty (Ha, let's go)\nThese bitches thinking I'm stupid (What?), I'm fucking her face and I don't want the coochie (I don't want coochie, what?)\nOoh, I know you a groupie (A groupie)\nHuh, ooh, I saw you in movies (In movies, ha)\nHuh, huh, you wan' make a movie? (A movie)\nHuh, I got my slime, he shoot it (Slime, he shoot it, huh, what?)\nYeah, the slime stay together, walkin' and crippin' like they the three stooges (Brr)\nUh, hotbox a foreign (Skrrt), ridin' with a check, they know that I do this (Let's go)\nUh, hit 'em with the choppa 57 just like some lil' fruities (Yeah)\nHah, me and my slime ride 'round with 30, hell yeah, we do this (Yeah, we what? Ha)\nWith Glocks, huh (What?)\nRun up on me keep a mop, huh (Keep a, huh?)\nRun up on me it don't stop, huh (Uh-what?)\nI be high off the Wok, huh, the lean, huh (Oh-man-god-damn)\nI fuck on your bitch, she a fiend (A fiend)\nShe sucking my dick and my magazine, huh (Magazine)\nShe wanna magazine (Oh-man, damn, damn, me)\nI call up slime he slatt with me (Slatt Gotit, yeah, slime, slattball)\nYeah, I keep the mop with me\nStickbaby, he gon' mop with me (Stickbaby)\nI kick that ho out the spot (Ooh)\nHell nah, that's no thots on me (Yeah, nah)\nGunWunna, he pass me the drip (Uh)\nHell yeah, drip drop on me (Hahaha, YSL Baby)\nOoh, huh, I get the drip from my walk (Drip, drip, drip, drip)\nHell yeah, come walk with me\nA bad bitch wanna stalk on me (Uh-what?)\nShe suck on my dick, her brains on me (Ooh, woo)\nHold on Dexter (Hold on Dexter)\nHold on Dexter (Hold on Dexter)\nYeah, Gotit, uh, yeah (Yeah, yeah)\nHold on Dexter (Let's go)\nThe Glock gon' talk for me (Talk)\nAR gon' walk for me (Walk, choppa)\nChanel, it cost on me\nVVS diamond floss on me (Ney-ney)\nCar got a boss, it be (Uh)\nIn beehive with some bumblebees (Blatt)\nI keep some racks on me (Ooh)\nStack that shit up way past my knees (Slatt)\nLil Gotit, he YSL ape, I got the drugs no tangerine (Huh, slime)\nHuh, I fuck that bitch one time (Ooh, ha, yeah)\nShe got the dick, I'm making a scene (Making a scene, ooh)\nShe wanna sing on the mic (Ooh, what?), I told her bling bling bling (Swear, huh, yeah)\nHuh, uh, the diamonds on me (Diamonds on me, huh)\nHuh, ooh, the diamonds my teeth (All on my teeth, swear, uh-what?)\nYou run up on me, I got a gun, it's surgery (Tote a real)\n\n[Outro: Famous Dex & Lil Gotit]\nYa dig? (Yeah)\nMe and slime in the studio, making songs, making history (Dex talk to 'em)\nSlime shit, Dexter\nDex talk to 'em\nI'm talkin' 'bout (Uh)\nYou gotta take a dictionary out, read 'bout it (Swear)\nHa, uh-yeah, uh-what? (Ooh, yeah, swear)\nBi-atch, slime shit", "title": "Fully Loaded"}]}