{"artist": "King Los", "songs": [{"image": "https://images.genius.com/4d9c32a9b90541ce4c0c3d143d56f7c9.1000x1000x1.jpg", "title": "Everybody’s A Bitch", "year": "2017-12-25", "album": "Moor Bars", "lyrics": "[Verse 1: Hopsin]\nYo, don't even ask me\nYour ho in the backseat, I dove in it fastly\nOh she was nasty, inappropriate ass cheeks\nI was hopin' to actually\nFill her jaw with all my testicle ooze\nFilm it all and maybe text it to you\nI'm feelin' awesome, you should step in my shoes\nI'm ill in Boston with the rest of my crew\nYou flexin' on who? (who?) Try to start a problem with a nigga\nThen you gon' get stuck (gon' be stuck)\nSomebody gotta end up on bottom\nMan, I'm tellin' you, it won't be us (won't be us)\nOverly confident when I'm pulling up\nOn women as I hold these nuts (oh he's nuts)\nI talk a little gibberish\nThen get inside that pussy with the OG thrust\nI wrote this dope, just hope it flows to pay off\nWrote this coast to coast provokin' chaos\nFolks suppose the closest clone is Adolf\nDon't get close 'cause bones get broke and ate off (Yikes!)\nRockin' all black like Batman\nSlap a nigga with a backhand\nI'm swaggin' on your motherfuckin' rap clan\nI see through you niggas like a CAT scan\nI've been the truth since fou'teen\nBeen on and always let loose with mo' steam\nLit like a nigga off juice and codeine\nBreakin' all laws, actin' rude to police\nBitch, here's a nut you can use for protein\nY'all niggas don't be producin' no heat\nI ride the beat smooth and cruise it slowly\nFuck jewels and Rollies, bitch niggas, all you below me\n\n[Hook: King Los]\n'Cause everybody's a bitch if you ask me, if you ask me\nIf you ask me, if you ask me\nEverybody's a bitch if you ask me\nI fuck around and take everybody bitch if you ask me\nBut don't ask me\nDon't ask me nigga, don't ask me nigga\nDon't ask me nigga, don't ask me nigga\n'Cause everybody's a bitch if you ask me\nI fuck around and take everybody bitch if you ask me\nThat's real talk though, but don't ask me nigga\n\n[Verse 2: King Los]\nKing! I'm about to do my shit, Hop\nI'm about to do my Hip Hop\nWhere I rap and where I got my studded flooded wristwatch\nAnd fuck your bitch in Gucci flip flops\nI get two groupies and I just watch\nI make them bitches coochie lip lock\nThey think I'm awesome, Poppa's groovy\nBut this ain't a fuckin' movie, get with the movin' the move\nIf you're goofy, I'ma make the fuckin' scripts swap\nI'm at the tip top of my game though, and my chain glow\nLike I found the gold at the end of the rainbow\nI heard your girl take five then take five then take five more\nLike Jackie, Tito, Marlon, Michael and Jermaine though\nAnd that's your main hoe?\nI heard he did the robot in the whole twat\nThe whole damn time you was thinkin' that whole thing lined\nThey had it lookin' like the \"Soul Train\" line\nChoose up, elevate, move up\nManeuver, juice up, you suck, manure, you suck\nMy newer use of dudes who exclude us\nIncluding Judas, fool, we exude\nUpper echelon, the upper at your mosque\nFuck it, bet your broad done took off with your car\nSucker, bet you'd call the cops and cop a deuce\nI cop a squad on niggas, cock a chopper too\nTake the masses off a pile of Jabbawockeez\nKeep the ratchets on me, keep you ratchets off me\nKeep you actors back, peep the acrobat, niggas flip the script\nPeople have your back or have your back in caskets\nBastards once you die, that's it, once you lie\nI'll cut you off like you drop your black ass in acid\nWon't you fry?\nWon't you buy a skirt and heels and twerk for bills?\n'Cause everybody's a bitch if you ask me\nHaha, yup, and we the strongest boys\nI done been considered the best for like the longest, boy\nI got pissed off and hopped on the phone with Royce\n\"Yo Los, what up my nigga?\"\n\"Mm, shit, uh, man, I need a favor from the god.\"\n\"Nigga you the GOAT, nigga anything you need? What's good?\"\n\"Okay, then this won't be hard\nI need that two minute unlimited of you and Eminem\nBad Meets Evil Sequel, Eye for an Eye\nFetty Wap, Masika, Secret Technique\nStreet meets perfectionist, unique eclecticness (Royce!)\nI need that why the fuck do Akademiks\nKeep postin' all the wackest rappin' gimmicks?\nI got a platinum plaque in Swag-Olympics back in the day\"\nI be bumpin' Fab' in Brooklyn, I be bumpin' Fab in the Bay\nJust cashed a six figure check, that's called a fabulous day\nMiraculous, practice this, after this\nThey gon' hashtag them to pray\nBut half of 'em tactic's my prey\nImmaculate passion to pass, I’m surpassin' the Jay’s\nThe Biggie and Pac’s, 'cause that's what they would want\nTo give me the shot, then Nas' gave us knowledge\nPun gave us puns, once they was done\nThey would want the one that was finna take it\nKnow you pussy niggas really finna hate it\nThis my inner sanctum, this ain't entertainment\nAnd this shit a movie and they finna tape it\nMorpheus, Neo, agents in the Matrix\nAnd it's ancient and it's painted on the wall of the pyramids\nFuck all y'all!\n\n[Hook: King Los]\n'Cause everybody's a bitch if you ask me, if you ask me\nIf you ask me, if you ask me\nEverybody's a bitch if you ask me\nI fuck around and take everybody bitch if you ask me\nBut don't ask me\nDon't ask me nigga, don't ask me nigga\nDon't ask me nigga, don't ask me nigga\n'Cause everybody's a bitch if you ask me\nI fuck around and take everybody bitch if you ask me\nWoo! But don't ask me nigga\n\n[Verse 3: Royce Da 5'9]\nYou chasin' that glitz and that glamor, not I\nI'm chasin' that guap\nI'm lookin' like Joe Budden chasin' 'em kids\nWith them cameras with rocks, racin' that clock\nPlus I dress spectacular, havin' an adverse effect on wackness\nLast verse leave headless rappers\nBlast first, ask questions after, 'cept I don't ask no questions\nI'm just like a terrorist\nIf I like her pics, my wife likes her dead\nI only dick down bad-ass black bitches\nBut I'm quick to flip like Chris Brown\nAnd aim straight for that white girl head (woah)\nIf she Spanish, I am papi\nI probly hypnotized her like the eye of Hopsin\nY'all guys, y'all been robbed a bunch of times\nBut, not I, I am Ryan Lochte\nI kick down doors, true 6 Mile boy\nPart of a breed that never existed before\nYou the last of a dying copy\nHere to shake the game with my vibration, uh\nI used to dream\nAbout just makin' plain paper clean without traces\nBut now shit done changed\nNow I just make paper plane, like Roc Nation\nIf you niggas start with me\nI leave you stiff as khakis with the starch increased\nNigga the art is key\nIt's important to me you don't win against me\nIt's more to me than just business and jeef\nIt's more to me than just a Eminem beef\nEven though these weirdos hard to please\nI got Moses at my show pointin', goin', \"He depart the sea!\"\nI don't wear no condoms, what the fuck are condoms?\nI don't trust no rappers, I don't fuck behind 'em\nI go Kobe, Steph, LeBron and shoot my shot and\nHit it with no second sniffers\nI only go for seconds at the bed and breakfast\nFuckin', holla nothin', yellin', \"Nothin' is promised!\"\nThat's 'cause I'm fuckin' hot as the Bahamas (whoo)\nThat's 'cause I'm hot as the Bahamas\nI been makin' money hand over fist fast\nI send your baby mama home\nWith a condition called Land Rover whiplash\n'Cause I let it go hammy 'til she drain my vehicle\nBattery gave me like three or four cavities\nShe wearin' edible panties (achoo!)\nI got a being broke allergy, being local\nMortality don't resonate with a super human being\nI used to shoot and spin\nAnd keep shootin', now I'm doin' shoots for spin in GQ\nOoh, tire marks skid\nRoof's see through, fly alcoholic, rich dude recruised\nCrack a dollar on my wrist with these jewels\nShe said she love me, told the bitch, \"Bitch, me too!\"\nThis is what happens when you hear three kings on a track\nMy style is one of one and I'm the comin'\nWasn't shit before it\nI sat in these sessions until I turn to rigor mortis\nThe architect of artful tact, I'm not a dime, I'm off event\nWhat I'm writin' down just Don DeMarco raps\nI'm wearing blue Jays\nAnd my ego flyin' through your Cardinal's hat\nThis freezin' cartridge to heat your ass\nPart your crack, lean your carcass then arch your back, uh\nTell these artists it's hard to argue facts\nGo see if the charts will market that\nI got jabblin' swag off to the races with bars\nFly, my only ultimatum is Mars\nMy bitch is the baddest, her ass is the fattest\nShe tatted with class, I take her for granted\nI met her on Madison Ave\nJust to give her balance, took her to the Radisson last\nI just grab it and smash it then toss it\nWhen bitches and niggas see me in person\nThey be just like when Calvin was walkin' in that Mickey D's commercial\nYeah, they see me workin'\nThey're like, \"Hey hey, Ryan, look like you're goin' to work!\"\n(Hey, get money!) But I ain't on my way to McDonald's\nI'm sprayin' them lamas: pop-pop-pop-pop!\nBut nothing's fuckin' funny, track back, jumpin'\nAll I think about is who gon' pick up all this fuckin' money\nLike Blac Youngsta\nWeight liftin', whippin' 8-50s\nWith a license plate that say: \"All y'all niggas straight bitches.\""}]}