{"songs": [{"lyrics": "[Intro: Jay-Z]\nTurn the lights even lower!\nHova\nMemphis Bleek\nBeanie Sigel (uh huh)\nRoc-A-Fella y'all (yeah yeah)\n(DMX) Jigga, my nigga, rhyme all night\n\n[Verse 1: Jay-Z]\nTo the top with my niggas\nPop with my niggas\nDrive by in whips, rock rocks with my niggas\nBreak day on the hottest block with my niggas\nJust cause I (DMX) love my niggas (uh huh)\nChill with the crew (uh huh)\nReal with the crew\nFour million sold, look, still with the crew\nBreak bread with the fam\n'Til I'm dead with the fam\nDuck cops, shake feds with the fam\nFlip them pies with my hustlers (uh huh)\nRide for my hustlers\nDie for my, lie for my, cry for my hustlers\nRoll with my dunns (uh huh)\nCold with the guns (uh huh)\nIf he slow with my ones hit the floor when I come\nI fuck with them hoes that fuck with them clothes\nThat's real with them shoes, keep it real with they dudes\nI'm sick with the flow and this is all I know\nMore money, more cash, more hoes BEYACHHHH!!!!!!\n\n[Hook: Jay-Z (DMX)]\n\nMore money, more cash, more hoes (what)\nMore money, more cash, more hoes (uh)\nMore money, more cash, more hoes (come on)\nMore money, more cash, more hoes (what, what, what)\n\n[Verse 2: Memphis Bleek]\nAy yo, M-E-M-P-H-I-S Bleek\nNo need to dress warm, I brought plenty of heat\nY'all can't do nothing with this here\nFor one, I pack three 9s like the year\nY'all funny money hustlas\n7 gram hustlas\nType to bust a O down with ya man hustlas\nI hold bank dough, dough 6-5-4\nWhile you ho talk that, look for a walk dough\nPetty crime niggas\nPetty time niggas\nSold petty drugs came up with petty thugs\nNow you got game in you\nWanna be a menace and you got Caine in you\nI'll put them thangs in you\nI'm a hot lil' nigga\nI ain't gotta tell niggas\nYou came too deep, one fell niggas\nI'm layin in the cut but still don't give a fuck\nRoc-a-fella forever, Memph man, what what\n\n[Hook]\n\n[Verse 3: Beanie Sigel]\nPeep the kid from P-H-I-L-L-Y\nNorth West South West Southside\nSpit it for them bitches and niggas who stay fly\nB-Mack, Roc-A-Fella till I die\nMet Jay, dropped on a album in a week\nWithout unsigned hype or battle of the beats\nThe first time niggas heard me spit it in the streets\nI gave y'all \"1000 Bars\" with Memphis Bleek\nStay strapped, heat in the car under the seat\n6 hammers even though we only 3 deep\nWe clap up niggas\nSmack up niggas\nDuck tape, rope, and wrap up niggas\nThink shit a joke, go head crack up niggas\nGet treated like Coke and get capped up niggas\nThe only thing funny\nIs y'all never seen big face money\nTill them big face 20s\n\n[Hook]\n\n[Outro: Jay-Z]\nRoc-A-Fella shit\n1999 (uh huh)\nYou about to witness a dynasty (you are not ready) unlike no other\nGet down or lay down ya heard!\nNo publishin' for niggas\nI know y'all niggas wonderin, like:\nWhen them niggas gone stop? (come on)\nWe got a date for you-\nFebruary 31st, 19-neva hate (haha)\nI know y'all niggas ready to kill yourself, too\nJust go head and do it!\nJump off a building, slit ya wrists!\nJust do it!\nThe world'll be a better place (haha)\nRoc-A-Fella\nBeanie Seigel\nMemphis Bleek\nHovah Hovah\nYa heard me!", "title": "More Money, More Cash, More Hoes", "image": "https://images.genius.com/590556997577af8e2ff883648f683ec0.300x300x1.jpg", "year": null, "album": "The Corruptor: The Soundtrack"}], "artist": "JAY-Z"}