{"artist": "E-40", "songs": [{"title": "2 Fingers", "image": "https://images.genius.com/a82de911f07b5ddaf9bd5b4e2064c8f0.300x300x1.jpg", "album": "Sharp On All 4 Corners: Corner 1", "year": "2014-12-09", "lyrics": "This the business\n\n[E-40]\nYou used to be sweet as honey, used to be my honey\nBut switched up when my money started getting funny\nGot ya partners all in your ear now your beer is beer\nUsed to throw up toast up cheers now its nothing but tears\nYou bad as fuck with a big ol butt but your attitude fucked up\nGuess all them likes on your selfies bitch got ya mind all fucked up\nYou know me, all my life I been real, never phony\nGou gon' fuck around and make me fuck one of your homies\nBiatch!\n\n[Adrian Marcel]\nYou got me fucked up\nWhat part of you will say fuck love\nCause you be on that fuck stuff\nAnd I'm tired of your shit\nIt's never love at first sight\nIt was only lust on the first night\nShould've known then you wouldn't be right\nBut I had to give you a try\nHow was I supposed to know\nThat you were gonna tell me I was lousy\nYou had me in the dirt\nWhile you look me in my face I\nMe and you alone\nEven though I'm trying to hide inside\nDamn it really hurts\nMy heart to keep your place\nI'm giving you\n2 fingers girl\n2 fingers girl\n2 fingers girl\nMove on\nOne's for the pain, all the drama, the trouble\n2's for the tears that I cry when I loved you\n2 fingers girl\n2 fingers girl\n2 fingers girl\nMove on\nTears in a bucket\nCause fuck it we over\nAlways remember that I really loved you\nOh yeah\nThen you turn around and play me\nTalk this shit\nOh really?\nStill I was that one that held you down\nGave you my heart\nYou said my heart wasn't much\nGirl I never ran the game on you\nCause I was too in love with\nHow?\nHow I'm supposed to know?\nThat you were gonna tell me I was lousy?\nDragged me in the dirt\nStill look me in my face, I\nMe and you alone\nEven though I try to hide inside\nDamn it really hurts\nSome things you can't replace\nI'm giving you\n2 fingers girl\n2 fingers girl\n2 fingers girl\nMove on\nOnes for the pain all the drama, the trouble\n2'sd for the tears I cried when I loved you\n2 fingers girl\n2 fingers girl\n2 fingers girl\nMove on\nTears in a bucket girl, fuck it we over\nAlways remember that I really loved you\n\n[E-40]\nYou played with my heart you tempted to wipe your feet on\nGet out of my life get gone bitch for I slap you with this phone bitch\nPack your bags and tear up out the soil I don't want your ungrateful ass no more\nAll these bitches I coulda had bitch I was faithful to your ass\nShowed you the other side of the game took you from state to state\n200 a plate, lobster and srhimp scampi and a hot steak\nBefore me you wouldn't know nothing about a quirksih field\nJust recently I was considering getting down on one knee\nBut now?\n\n[Adrian Marcel]\nHow I'm supposed to know?\nThat you were gonna tell me I was lousy?\nDragged me in the dirt\nStill look me in my face, I\nMe and you alone\nEven though I try to hide inside\nDamn it really hurts\nSome things you can't replace\nI'm giving you\n2 fingers girl\n2 fingers girl\n2 fingers girl\nMove on\nOnes for the pain all the drama, the trouble\n2's for the tears I cried when I loved you\n2 fingers girl\n2 fingers girl\n2 fingers girl\nMove on\nTears in a bucket girl, fuck it we over\nAlways remember that I really loved you\n807"}]}