{"artist": "Casey Veggies", "songs": [{"title": "Forever", "album": "Sleeping in Class", "year": "2011-09-20", "image": "https://images.genius.com/aaf0da7a07e05d17ff3c822d7769bd09.500x500x1.jpg", "lyrics": "[Verse 1: Casey Veggies]\nNigga we be on our shit, call us cow manure\nYoung boy stay clean even in the sewer\nMy last girl was super but I couldn't get through to her\nI swear I was literally just tryna get into\nBut you can't even have her, I'm the closest thing to her\nCan tell you everything about her, Feel like I really knew her\nBut if God could bless anybody, I swear I'd just choose her\nCause she's a good girl tryna stay true to her\nMy mind stay racin' I swear I could run in Cuba\nBeen shaded up lately, Blowin' hard like a Tuba\nLike man am I a loser? Or is it just a new her?\nI swear I'm the only dude in her life that improved her\nBut when I grow up man I might just have to move her\nSomewhere with the money we gon' ball like a hooper\nBeen doin' a lot of growin' I swear I been on some new stuff\nLivin' like the Jefferson's, nigga it's that time to move up\n\n[Hook: Casey Veggies]\nI'm up late night just tryna get it right\nSwear I been on my grind just tryna stay outta sight\nThis is \"Sleeping In Class\" just tryna spread my light\nTryna make a mil off these million thoughts that I write - Right!\nForever, Forever ever, Forever ever? Forever\nAny weather I'm here whenever\nForever, Forever ever, Forever ever, Forever\nWe'll stay together and make it better\nYeah\n\n[Bridge: B.J The Chicago Kid]\nYeah I fall asleep in class\nYou niggas learnin' for now but I'm sittin' here dreamin' my future\nAnd when we leave class you niggas better haul ass\nCause my life ain't quite what ya used to\nEvery single morning, When ya'll packing I'm yawning\nFrom nights in the studio, Nigga if ya didn't know\nI'm on it\n\n[Verse 2: Casey Veggies]\nDreamer turn believer 'bout my salad like Caesar\nThe society just tease us findin' ways to decrease us\nMy rhyme's like Jesus findin' ways to increase us\nThis my story, Gettin' money, There's a thesis\nCause what my family leave is for my Nephew's and my Niece's\nJust wanna make sure my generation don't fall to pieces\nCause what them teachers teach us\nGot degrees and they don't believe us\nThey lie to us when they conceive us\nTryna shred us down to pieces\nThat's reality\n\n[Hook]"}]}