{"artist": "Pras", "songs": [{"album": "Ghetto Supastar", "title": "For the Love of This", "image": "https://images.genius.com/cf6a65fdae367a2af61e2514cba1f7cf.500x500x1.jpg", "lyrics": "(Pras)\nUh, yeah\nYo, yo, yo it's so amazin how I be blazin\nFrom the four seasons to you at the days in\nWhere you lay at on the cages?\nI comin with a cannon, two guns blazin, purple hazin\nMy shine can be appraised, my tongue radiate\nOrchard violent rays, why you stower in the off broke and paid\nSingin your heart out, oh happy days, I'm movin on up\nDamn, I wish I had it made, ran on your parade\nMake you exchange at the word trade\nDig son, your whole couldn't add up to my half\nI'll count your funds yeah, like third grade math\nBlast to your path every mornin I break flags\nDirty cash always find a way to get stash\nFrom Italy to the deepest alley\nUp to the highest mountains of the Himalayas\nI put that on a stack of bibles so I stack a prayers\nYo democrat block, must get shot\nBelieve me not go ask Pac Prodock\nScream on the crew when you don't know how\nShiver liner got, rhymes in every single cloud, cause what\n\n(Chorus: Pras)\nFor the love of this, I give my life a diss\nAnd for the love of this, I send my last wish\nFor the sake of hip-hop, will you never stop?\nYou see I will do anything but I won't do that\n(Sniff Coke) won't do that (slang dope) can't do that\n(Get out the car) shouldn't do that (take off your rope) why do that?\n(Feel the gun smoke bloaw!)\nDo you hear me baby\n\n(Pras)\nYo, I got no life to spare, no time to bear\nNo TL care, I'm single like a stair\nI can feel it in the air comin everywhere\nTwenty years from now, I'm gonna be a billionaire\nRed for the on the island M-I sicky underwear\nLeavin all the BS elsewhere, I swear\nBlack you out make you see the boat like Noah\nThere's nothin here for y'all, glasses like Coca-Cola\nMix-a-Mack make em see there's not enough buildings\nNot ever since when I drop by these flash un a peepin\nNo reef thugin more caffeine than tryin\nSpread the love yeah to all my beloved\nHigh speed chasin, low pro pursue\nBlack shoes important, soldiers come Bay Root\nSo look to my troops and the stolen Coupes\nHere's the gun don't talk about it, just get up and shoot (stop it)\nHold up son, let me set up the pace\nI'm that cattle in the race on the Human Race\nDon't call me Human, call me Lou-man\nLike par, move your record company under ?You-Hah?\nFamily business FR to snitches\nI'm down with M.O.B. yeah Money over Bitches\n\n(Chorus: Pras)\nFor the love of this, I give my life a diss\nAnd for the love of this, I send my last wish\nFor the sake of hip-hop, will you never stop?\nYou see I will do anything but I won't do that\n\n(Pras)\nFor the love of this I'll paint myself green\nWithin myself in the Corrine, Pras Most Wanted\nLast seen with Sister Morphine\nScuba Diving with the Navy Seals in the Yellow Submarine\nHeaded for, the Philippines, microphone fiend with are regain green\nIt burns when I eat tangerine, wash it down with a cup of Gasoline\nBurn into flames, like your actress said Ilene\nSupreme Dream Team, musical machine, money makin machine\nWalk through the Desert butt-naked with a inch of canteen\nSlappin it, rapper'll be like nah mean?\nGot nothin but a piggy in a tree, to what I shoot and some washed out jeans\nHeadin for the stars word, word to God\nWatchin every move placin all my cards\nThe game'll soon come like the aliens\nEverybody runnin, sayin that's the one\n\n(Chorus: Pras)\nFor the love of this, I give my life a diss\nAnd for the love of this, I send my last wish\nFor the sake of hip-hop, will you never stop?\nYou see I will do anything but I won't do that\n(I sell Crack) won't do that (peel on your back) can't do that\n(Here comes the Gat) shouldn't do that (if you wanna lay flat) why do that?\n\n(Pras)\nYo, come on, do you hear me baby (hear me baby)\nUh, uh, uh, Navy Seals y'all, Refugee Camp what, what\nYou better stop it, punk, stop it, stop it, stop it, stop it HA!\n98-99, yeah, yeah, (*Dirty said several times*) Cash haha", "year": "1998-10-27"}]}