{"songs": [{"year": "2011-03-14", "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "All of the Lights (Remix)", "lyrics": "[Verse 1: Lil Wayne]\nLights on, I see your face\nShe eat me up, she got expensive taste\nI see you dreaming, but you still awake\nBig slices, that's how you cut the cake\nIt's cold as hell, I show and tell\nWeezy home, our nigga out of jail!\nIn this \"give or take\" world I got what it takes\nPut you out your misery: Kathy Bates\nI'm Young Money, I'm Cash Money\nIf we could buy time I'd spend my last money\nNow I'm spending time, you in the blind\nThis little light of mine, I'mma let it shine\nBright lights, night lights, headlights, shh\nNo lights but them infrared lights\nLong life, don't like to ask twice\nYou killing me baby, this the past life\n\n[Chorus: Rihanna]\n(All of the lights)\nTurn up the lights in here, baby\nExtra bright, I want y'all to see this\nTurn up the lights in here, baby\nYou know what I need\nWant you to see everything\nWant you to see all of the lights\n\n[Verse 2: Big Sean]\nReady, set, go, go, go, go, go\nGo til you can't go no more\nI'm ill times ill, dope plus dope\n\"Westside bitch,\" quote, unquote\nWoah there boy, don't go there ho\nIf you cross that line I might overload\nI swear these lights be talking to me\nBut I can't read Morse Code\nWhy every rapper named \"Big\" got bodied, huh?\nBut every rapper named \"Sean\" got money, ooh?\nWell I guess my chances are 50/50\nBut my vision is 20/20 so I be counting a hundred 100's\nOh my Allah, Lordy lordy lordy, I took your chick\nNow you want beef and I am chuckling like I'm Porky\nCause you spend all day with her spooning\nI spend all night with her forking\nThere's a one-way ticket to Hell and\nThey want these bullets to book it for me\nI'm shitting on every statistic that said I'd be dead or fuckin broke\nThis is history, your kids' kids' kids' kids' kids gonna book report me\nAnd I think they want to murder me\nI'm shining hard, because bitch I'm an emergency\n\n[Chorus: Rihanna]\n(All of the lights)\nTurn up the lights in here, baby\nExtra bright, I want y'all to see this\nTurn up the lights in here, baby\nYou know what I need\nWant you to see everything\nWant you to see all of the lights\n\n[Bridge: Big Sean]\nSo good, so good, Westside, so hood\nI do it.. B. I.... G\n\n[Verse 3: Drake]\nBad decisions, good intentions, man I'm riding, Weezy with me\nI just stepped out of the strip club, made 5000 look like 50\nI spend all my time in Houston, smoke that kush but I don't do Whitney\nI don't do Britney, I don't do Lindsay\nI made $2 million since last Wednesday\nAnd I hate y'all! Y'all got too much free time\nSaying I don't drop shit, everything gon be fine\nWorrying about your old girl, trying to see if she's mine\nNigga she's with me when she tells you she needs some \"me time\"\nIt's our time, so fuck y'all!\nI'm really about to go Spring Break now\nAnd start taking shots in this muthafucka\nAnd you didn't have all that ass last month girl\nWhat, you get some shots in this muthafucka?\nYeah, we got the Roc in this muthafucka\nYou thought niggas going pop in this muthafucka?\nYoung Money, power, respect in this bitch\nYou would think we got the LOX in this muthafucka\nI made mistakes, I made some bread\nI even made a way for them to get ahead\nTo my surprise, nobody replacing me\nTake Care and Carter IV it won't be long 'til they can see the lights\nAnd I'm on one, I got one\nYou a pussy nigga, I'm not one, so call it a night, call it a night\nAnd I run this, and y'all know that\nI take the purple and pour that, all in the Sprite, all in the Sprite"}], "artist": "Kanye West"}