{"artist": "R.A. The Rugged Man", "songs": [{"album": null, "year": null, "lyrics": "[Intro: sample (R.A. the Rugged Man) {Timbo King}]\nDo you resent the fact that people\nMake a special deal out of you\nPerhaps becoming a white champion in a black dominated sport?\n(Yo, I f**k up anybody, shit don't matter, white, black, I'll f**k you up, you\nKnow?)\n{Yeah, that's what his mouth is sayin', see in the ring? It's a different story\nYou know what I mean, in the ring, that's a different story)\nIn the right hand corner, wearing black trunks and a throwback jersey\nBlack hat, and black Timberlands, from Brooklyn, New York, Timbo King!\nLeft hand corner, wearing white trunks, a white wife beater\nAnd dirty white shelltoes, hailing from parts unknown, R.A. the Rugged Man!\n\n[Timbo King]\nAiyo, we black macks, with black hats and black bats\nBlack Panthers, with black gats, twenty-one blackjacks\nTwenty one black napsacks, black weed\nBlack Friday, nigga, black fistes\nBlack misses, Onyx, black misonic\nBlack tonic, black marble, ask Arnold\nBlack bombers, with black linen, repent black sinning\nSwimmin' in black women, the Men in Black winning\nBlack Timb's, black jims and black ink\nBlack ice on, black widow's in black minks\n\n[R.A. the Rugged Man]\nIn the White House, White Owl, turn the light out\nWhite boy, night out, knock your white ass, right out\nFind out, white dog, white bitch, white fist\nBeat your bitch like this, white dick, white sheets\nDevin make white beats, suburban kids from the white street\nJames Cagni, white jeep, white sox\nWhite rocks, white cops in donut shops\nWhite blocks, now them dead white cops\nWhite through the night creatures, white sneakers\nWhite wife beats, thin lips, white features\nWhite powder, Snow White, snow, hit the ho right\nWhite dred, slow life, white snakes, so white\n\n[Chorus: unknown singer w, samples going in the background]\nBlack, white, black, white\nBlack, white, black, white\n\n[Timbo King]\nBlack men with black belts on, black denim style\nSmoke a black, come out, layin' down black cow\nBlack souls, lost in black holes\nBlack robes, f**k bitches out on Black Gold\nBlack seeds, black eyed peas, black pepper\nItalian black leather, fade to black\nBlack models, sport black Marotto's\nBlack Moet bottles, holla back, black star power\nBlack rockwilder's, black nines, black on black crime\nWho's skin blacker than mine?\nBlack spades, givin' lames black eyes\nBlack foot indian drive, black berries\nBlack Pelle Pelle's, black Israeli go to war with black Skellies\nHummer's with the Black Perelli's, Armor All\nBlackball, black label, alcohol\nBlack ho, beat a nigga up, you know how that go\n\n[R.A. the Rugged Man]\nAnd then we truly white, finger, arms, ya hands is white\nSquare dance tight, dance in white, I'm Charles Manson white\nSteal ya lab white, Rugged Man right\nI rip right tight, like to fight, white knight\nBlue eyed bright Christ white, nighty night light\nToys R Us light bright white, simple light's white\nNice life, nice fight white, great white hype\nWhy Uncle Ben's rice white? Hate life white\nAnd get fruitcake twice, white guys recognize\nSee the whites in your eyes, white skin, white lies\nHouse of Pain white, Everlast, Kurt Cobain white\nElvin, Simple and Plain white, John Wayne white\n\n[Chorus]\n*samples into the end*", "title": "Black & White (clean original) (feat. Timbo King)", "image": "https://images.genius.com/8fff7f98b3275b4fa6a6a43f01159e31.899x899x1.jpg"}]}