{"songs": [{"image": "https://images.genius.com/d1cd15de102b996097a8100b1ddf77b0.320x320x1.png", "album": "uknowhatimsayin¿", "title": "Combat", "lyrics": "[Intro]\nTwelve-gauge shotguns, I seen twelve-gauge, um, pumps\n\n[Verse 1: Danny Brown]\nI don't give a fuck\nI could talk a cat off the back of a fish truck\nTell me, \"What's up?\"\nAll about the game, so I'm hunting big buck\nBig butt, slim waist, and her hair long\nPass it down to me like a heirloom\nThe Henny got me wetter than whale piss\nI die for this shit like Elvis\nBoss up and shake down\nGet it jumpin' like a techno breakdown\nNight young and we just gettin' started\nLet me walk on yard at the Bruiser Brigade party\nGot smoke, of course\nGoin' up, fireworks on the Fourth\nTake mine, and I do it with force\nBeen with this shit since I jumped off the porch\nUsed to chop grams on my Grandma's faucet\nPay me what it costs, I ain't tryna hear offers\nTryna play Brown, you be hangin' with Hoffman\nCopped a pound and I broke it down in ounces\nBust it open like them hoes came in\nGot more pills than the Olsen twins\nFocus, I can see where ocean is\nKush stankin' like it broke the wind\n\n[Chorus: Danny Brown and Q-Tip]\nWhat it is, what it is, what you know about?\nCame a long way from that dope house\nWhat it is, what it is, what you know about?\nCame a long way from the—\n\n[Verse 2: Danny Brown]\nAll I cared about was the stacks and the stage\nWhen it's time to re-up, then my partner got his hash\nAin't rocket science class, I ain't tryna pass math\nTwelve grams on the scale, watch me do arts and crafts\nAny day could be my last, livin' like that\nTripped over the crack, crippled by circumstance\nNigga gotta face the facts, make this world your own\nSun sprinkled light for this mega-marathon\nTryna live on through my music\nThe future influence, the next to do it\nThe odds are against you, kiddo\nLife want everything from you, like a divorced widow\nTryna get it like the next negro\nWant beef? You gon' fuck around and end up a vegetable\nTryna give you a lil' game\nGet some, get locked, get out and back again\n\n[Chorus: Danny Brown, Q-Tip & Consequence]\nWhat it is, what it is, what you know about?\nCame a long way from that dope house\nWhat it is, what it is, what you know about?\nCame a long way from the—\n\n[Verse 3: Q-Tip, Consequence, & Both]\nIt's a combat zone\nEvery fiend, want they own\nRed top, blue top\nGet the green on the block\nIt's a combat zone\nEvery fiend, want they own\nRed top, blue top\nGet the green on the block\nIt's a combat zone\nTryna get that bag\nCatch that lick, get that bag\nIt's a combat zone\nTryna swerve from 12\nIt never fails when you goin' through Hell\nIt's a combat zone\nCatch that lick real quick (Combat)\nGet the bag, get the bag, whatchu got?\nIt's a combat zone\nGet that lick real quick (Combat)\nGet the bag up, and the swag up\nBefore they call for back up\n\n[Verse 4: Danny Brown]\nListen, all a nigga wanted was a Chevy on some Daytons\nWasn't thinkin' 'bout no lawyer, nigga, fuck savin'\nDidn't know we'd see them horrors like Wes Craven\nHook jumpin' out them vans, throw us on pavement\nLocked up with dirty white boys, all musty\nPrayin' for probation, hope I get lucky\nCourt-appointed lawyers, gotta stay coppin'\nPut you in predicament, but that's your only option\nSink or swim, look at him in the system\nJust another nigga, one-way ticket to a prison\nTried to help, only hurt in the end\nHow the fuck 'posed to take care your kids from the pen'?\nIt's the life that we chose, friends become foes\nThat nigga snitched on, everybody know\nSome don't know how to stick to the code\nNobody to trust, that's the way life goes\n\n[Outro: Q-Tip & Consequence]\nI've seen hand grenades (Combat zone)\nI've seen beer... beer-can (Combat), beer-can bazookas made (Combat zone)\nDamn things hit you (Combat), just-just as getting hit with a gun (It's a combat zone)\nI've seen .22 zip guns (Combat), I've seen .38 zip guns\nI've seen (Combat zone), I'll tell you\nThis about things you think you'd never see on the street I've seen (Combat)\nI've seen dynamite on the street\nI've seen all this\nYou'd be surprised, man\nPretty soon they're gonna steal the damn atom bomb", "year": "2019-10-04"}], "artist": "Danny Brown"}