{"songs": [{"title": "LupShay Fiasco", "image": "https://images.genius.com/d39be70f638c88c431339e037c0e69e2.1000x1000x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nYeah\nWe gonna keep it going\nI'm over here losing my voice, but...\nI still got a lot in me\nYou know?\nLet's keep it going\n\n[Verse 1: brandUn DeShay]\nNiggas with low expectations, it's easy to satisfy\nNiggas with high expectations can't help to see the sky\nCan't help but to see this guy, I'm shining like the light\nAt the end of the tunnel, my nigga, my hustle's Saint Peter's eye\nWho need a ride? I'ma carpool to success\nOr a harpoon to the chest to these hard dudes say they're next\nAnd they clearly not, I'm next up, I got right now\nJust turn them spotlights down, I'm shining bright right now\nWell now, homie, I'm too hard, homie, you're too huff\nAll these plaques that I'ma have, I'ma need a toothbrush\nLooking like a soldier, no crew cut, lace your boots up\nChicago made me stare hard, hard like Medusa\nNow I'm used to them hood niggas and the ones siddity\nGot me feeling like a windmill in this windy city\nHow pretty, you turned this disadvantage to advantage\nMost of them couldn't manage, a toast to those who can handle it\nAlways knew I was special, why niggas was poking fun\nI practiced my craft, now all my music's the smoking gun\nI hope it's done in 2010 or be the genesis\nMaking love or making music, I'm just getting into it\nGet into it\n\n[Verse 2: Cameron Ryan]\nIf I could work but never shine, grind until the end is mine\nI shine down on y'all, but y'all cursed, them forever blind\nSo who is this cooler kid on the course of cooler whips?\nBut he don't want the money, cars, clothes, or the groupie chicks\nHe just want one girl and the world to know the dude exist\nHe kicks down the door into the game, look how rude he is\nThat Midwest on my back, carry that heart on my sleeve\nI just got one foot in the door, yet I'm trying to leave\nAm I retiring? You know that pressure heavy\nBut still, I break these records like Katrina broke the levee\nAnd I don't care if you spit fire because I ain't about to stop, drop, or roll over for no one\nNo, son\nI won't stop a trap until my pocket rollers rotund\nWatch me bring the game to a standstill as I slow run\nJust like red light, red light, don't you see that red light?\nThey ain't saying stop when that red light is on your head, right?\nWhat your bread like? If it don't stack up, pay it right\nAll them rhymes you previously spit just wasn't said right\nYou know I'm ill, though, but I ain't from that ill-go\nAnd I ain't never shy, but these show that I will still hold\nDown\n\n[Outro: brandUn DeShay]\nDown\nYeah\nCameron Ryan\nThank you for the tag team help, sir\nYou know I can't go the rest of this journey alone, so\nKeep it moving\nI don't even know what's next\nAll I know is...\nShit, I hope it's done soon\nMan, I ain't gonna have no voice left by Christmas", "year": "2009-12-25", "album": "Your Favorite! MixTape"}], "artist": "Ace Hashimoto"}