{"songs": [{"year": "2015-12-04", "lyrics": "[Verse 1]\nNot a human, not afraid\nI will not comply, I will not obey\nSee the plan is to depopulate\nBut the body can overcome anything, fuck what a doctor say\nFans shaking me like Bobby wake up\nChip on my shoulder, I was holdin' a grudge\nI wanted to be loved more than I wanted to love\nBut hey, what can I say, fame's a hell of a drug\nBorn a slave to a tyrant\nIt's goin' take more than just petitions and riots\nAre we headed for a future of being indebted to credit\nHopin' the next leader elected will trump the one we beheaded\nWords the wealthiest rappers will never utter\n'Them checks they throwin' to niggas a motherfucker'\nSeems like the future was brighter when I was younger\n(Seems like the future was brighter when I was younger)\nI'm torn between performing and rewriting the norm\nAm I born to transform or just to die and move on\nBe the life that people mourn while reciting all my songs\nTo the battle I am sword dull armor worn\nBeaten down to the pulp for being different\nYou question old tradition they just say you superstitious\nLike a snake that eats its own tail, the economic system\nPublic schools the babysitter, health care is the modern day Adolf Hitler\nFact check, ever since the internet\nMolestation multiplied by a million percent\nYour aunts and uncles, niece and nephews all align with the shit\nHistory shows for speaking up my whole life is at risk\nYeah I'm cocky, kamikaze, who gon' stop me? Annunaki\nIlluminati? Neo-Nazis? They do me how they do Cosby\nWhen you winnin' they gon' love you till you lose like Ronda Rousey\nEvery revolutionary they execute 'em proudly\nIt go JFK, nope, MLK, nope\nSince Lennon got smoked, it's clear they don't want us to have hope\nThey tore down our houses, replaced it with dope\nAnd say that it's our fault, false!\n\n[Chorus]\nYou wanted to fight\nSo you wanna be brave\nSo you found the light and you've seen the truth and you feel betrayed\nWell it comes with cost\nA price too large\nCause if we're really just born to die\nI'd rather never been born at all\n\n[Verse 2]\nStay in school they said, use your tools they said\nBut being on TV looks pretty cool I said\nThat's true I said, must I remind myself\nThese corporations aren't your friends, you should've signed yourself\nThey, they, who are they? They are us\nWe are they, the pyramids started at the top, we just mimic and behave\nThe same way, Babylon brainwaves\nHuman incarceration's the modern day slave trade\nCost of college, cost of living so high you can't maintain\nAll you can do is sell pills, drink tea, and waist train\nStruggle to make mortgage and re-up by payday\nAnd the wealthiest families split it up eight ways\n\n[Chorus]\nYou wanted to fight\nSo you wanna be brave\nSo you found the light and you've seen the truth and you feel betrayed\nWell it comes with cost\nA price too large\nCause if we're really just born to die\nI'd rather never been born at all", "title": "Born To Die", "album": "WATER (We Are The Enemy Really)", "image": "https://images.genius.com/0fb63f56a90a658f950a838126f7ce63.800x800x1.jpg"}], "artist": "B.o.B"}