{"songs": [{"year": "2019-10-04", "image": "https://images.genius.com/5c327b90df5e37ff77d7d45715863993.800x800x1.jpg", "title": "​gas leak", "album": "Terror Management", "lyrics": "[Intro: billy woods]\nDon't wanna be the one to say it\n\n[Verse 1: billy woods]\nNo Christmas this Christmas, kitchen frigid\nSpace heater in the room, Chinese delivered\nWatch Knicks, every shot missed\nLike airplane bottles out mini-fridges\nI wash dishes, I'm an isthmus\nMy arm's length is quite the distance\nOnce distant future now day to day existance\nMy ex-wife is my mistress\nYour woman on a pedastal but this ruby red shit\nPut your life on the grid, let niggas see how you did\nLook close kids, you can see where a nigga just barely slid in\nUnder a microscope it's clear somethin' had to give\nWords glib, dress 'em up, put 'em on the track to see what you can get\nVerse to turn to tricks, pacin' the telly sick\nStill took the money, I'm a piece of shit\nProdigal, blew the gift, it was a hell of a trip\nBut I'm back rappin' through lapels of my vest\n\nI drive till it stroll, stripped it for parts\nWith a copped carburetor\nPut spares, one or two large\nRoad to the riches lookin' like [?]\n\nBlack cop, another hour of chaos, took the day off\nSummoned the ancestors with crack rock at the seance\nLand raised sativas from the banks of the Mekong\nFace like Madiba at Liliesleaf Farm\nTSA swabbed my palms\nGrapefruit notes, with the tarragon\nObama incense, ten percent the proceeds go to Farrakhan\nIt's the long con, long rifle, get the damn kids off the lawn\nTryna stop time, Taliban, tryna stop time like a movie bomb\nDEA on my Android party-line like I [?]\n\n[Outro]\n[??]\n[?] get out a pen [?]\nIt doesn't seem like they are thinking very far ahead in terms of their interests. And he says, \"Are you kidding?\" You know, these people are looking at quarterly reports. And if they're in the red for two quarters, they're out. But, basically, they're looking at very short term profits, of their corporations, in competition with other corporations. Their job is to get that next quarterly report into the black and their shares up"}], "artist": "​billy woods"}