{"artist": "G Herbo", "songs": [{"title": "Eastside", "album": "Ballin’ Like I’m Kobe", "year": "2015-09-29", "image": "https://images.genius.com/fce05223ccad3afd182baeaef351e35f.640x640x1.jpg", "lyrics": "[Intro]\nOh my god, what is this? An L beat?\n\nEyyy\nG Herbo. NLMB. 150 dream team. 150 rock block. Ballin like im Kobe\nYou already know what it is man. We the gang\nReal eastside\nMotherfuckin 79th and Essex\nFrom Stony to Rainbow if you ask me goddamn it\nEastside you already know, look\n\n[Hook]\nWhere I grew up so thats where you see me usually\nWhere every nigga from I know going shoot for me\nAll the shorties violent ain't no guidance\nNo more chiefs left in the hood, fuck who you used to be\nWhere I witnessed all those killings at\nWhere I left all of my feelings at\nStill be in the same hood\nPost up flame woods on the (Eastside)\n\n[Verse 1]\nEarly ages grew up on the east\nYoung nigga in the hood still innocent\nBuncha niggas that came up with me\nEither missing them or they got sentences\nBack when I used to play Sega genesis\nI was born on a building on Bennett\nAnd free my bro shorty foe like my blood\nFighting first degree murder with witnesses\nSometimes i get high and i think about what my life would be if i didn't go get this shit\nIf i dropped out of school and just sat on my ass and depended on niggas to get me shit\nBut you know that's not me that ain't nothing like me thats why niggas say they dont like me\nAnd they know they'll get hit up if they beefin with me because there no telling where I might be\nI know I gotta stay on my feet\nI'm 19 and if i want to see 21 I know I gotta stay with my heat\nMy mama told me stay away from the east\nRight back there on the 9, I think its the Essex in me\nLost my nigga rock on the 9, Pistol got hit on the 9\nLost Kobe right there on the 9, lost G Fazo right there on the 9\nFresh off a plane and I'm straight on the 9, I think its the Essex in me\nI'm from where young niggas turn into killers because there ain't anything better to be\n\n[Hook]\nWhere I grew up so thats where you see me usually\nWhere every nigga from I know going shoot for me\nAll the shorties violent ain't no guidance\nNo more chiefs left in the hood, fuck who you used to be\nWhere I witnessed all those killings at\nWhere I left all of my feelings at\nStill be in the same hood\nPost up flame woods on the (Eastside)\n\n[Verse 2]\nCaught my first pistol case over east\nAnd i wasn't even up on the block\nIt was going to happen eventually\nI don't leave the house without my Glock\nExcept for the time when i got shot\nAnd that time I was on the block\nBut you know we was tottin them jocks\nRock block bitch you know how we rock\nI'm thinkin the opps called the cops\nCuze right before that we got stopped\nOf course all the slammers got tossed\nAnd that shit happened on the next block\nBut anyways that type of shit happening anyday them people listening anyway\nReminiscing about my niggas missing G Fazo and makes me remember  them center days\nBut I can always got back in time anyday\nMan this rap shit all make believe anyway\nMan these niggas all mis-believe anyway\nAnd these niggas are all snakes anyway\nNiggas thinkin my lifestyle is cool\nIf I could would have stayed in school anyday\nEvery year all the niggas i lose\nWake up and think about that shit everyday\nJail time and I'm ducking that shit  everyday\nNiggas say they going to kill me, I'm not afraid\nPistol loaded I'm tuckin that everyday\nRun up on me I'm bustin it every way\nAnd these niggas show love when you up with a smile on your face and do drugs when you up\nWhen you down bet none of them niggas around, but fuck it I knew that shit anyway\n\n[Hook]\nWhere I grew up so thats where you see me usually\nWhere every nigga from I know going shoot for me\nAll the shorties violent ain't no guidance\nNo more chiefs left in the hood, fuck who you used to be\nWhere I witnessed all those killings at\nWhere I left all of my feelings at\nStill be in the same hood\nPost up flame woods on the (Eastside)"}]}