{"artist": "Petey Pablo", "songs": [{"album": null, "title": "Freek-A-Leek (explicit version)", "image": "https://s3.amazonaws.com/rapgenius/1372159499_Petey.pablo.jpg", "lyrics": "(Petey Pablo:)\nLets take some calls from the request line. caller number one..\n(Caller:)\nAy,..man...whats up\nThis Dominique from shay lil' trailer park\n\n(Petey Pablo:)\nWhats up Dominique\n\n(Caller:)\nI wanna hear that song from Lil Jon and Petey Pablo\n\n(Petey Pablo:)\nAight, I got that coming right up for you\nNow shoutout the radio station that gave you what you\nWanted\n\n(Caller:)\nDouble-u boom boom beats baby!\n\n(Bridge:)\n(How you like it daddy?)\nWould you do it from the front?\n(How you like it daddy?)\nWould you take it from the back?\n(How you like it daddy?)\nFyna break it down like that!\n(How you like it daddy?)\n\n(How you like it daddy?)\nWould you do it from the front?\n(How you like it daddy?)\nCan you take it from the back?\n(How you like it daddy?)\nFyna break it down like that!\n(How you like it daddy?)\n\n(Verse One:)\n24, 34, 46, good and thick, and once you get it she'll work wit it\nPut a face and some cute lips, earing in her tongue and she'll know what to do wit it\nMake a name for herself, and she do her shit well, and know how to keep her business to herself\nCome over anytime a nigga call chick, 1 o'clock, 2 o'clock, (ding dong) and she right there\nAnd she know why she came here, and she know where her clothes suppose to be (off and over there)\nSniff a little coke, take a little x, smoke a little weed, drink a little bit\nI need a girl that I can freak wit\nAnd wanna try shit, and ain't scared of a big dick\nAnd love to get her pussy licked\nBy another bitch, cus I ain't drunk enough to do that\n\n(Chorus:)\nFREAKALEEK!\n(Do you like it daddy?) Shameka\nKeisha\n(Do you like it daddy?) Tara\nFREAKALEEK!\nShonda\n(Do you like it daddy?) Sabrina\nCrystal\n(Do you like it daddy?)Daronda\nFREAKALEEK!\nTheresa\n(Do you like it daddy?) Falicia\nTenisha\n(Do you like it daddy?) Sharon\nFREAKALEEK!\nKe'arah\n(Do you like it daddy?) Monique\nChristina\n(Do you like it daddy?) Yolanda\n\n(Verse Two:)\nI need to know a whole lot then to teachin' a broad, with my ding dong make her tongue tickin the bong\nGo on ahead so I dont have to do that far, I'm spoiled (and I don't like to work that hard)\nI like to lay back, relax, and enjoy my time, and with my eyess roll back and my toes curl\n(I love when you do that girl) Until it comes time for me to have to give her hers\nTell me what you want, do you want it missionary with your feet cramed into the head board?\nDo you want it from the back with your face in the pillow so you can\nYell as loud as you want to?\nDo you want it on the floor? Do you want it on the chair?\nDo you want it over here? Do you want it over there?\nDo you want it in ya pussy? Do you want it in ya ass?\nI can give you anything you can handle!\n\n(Chorus)\n\n(Bridge)\n(Caller:)\nYeah, I appreciate it lil' home boy\n\n(Petey Pablo:)\nNot a problem. You know I do it because I love you\nNow I got to give a shoutout to Seagrims Gin cus I drink it, and they\nPaying me for it\n\n(Chorus 2x) Song evaluation", "year": null}]}