{"songs": [{"lyrics": "[Produced by Statik Selektah]\n\n[Intro: Action Bronson]\nFly Mary in to sing to that cow before we slaughtered it\nAnd then I ordered it\n\n[Hook: Action Bronson]\nDon't say a word to me\nYou already committed perjury\nA bunch of lies and sneaks and I don't play that\nYou know better, you better save that\n\n[Verse 1: Action Bronson]\nLaid by the pool, my legs gettin' massaged by a professional\nStrictly business, nothin' sexual\nSeasonal vegetables lookin' exceptional\nYou ain't think I was hot then, now you wanna hum on my testicles\nI'm from a dirty borough where that Sun don't come out\nBut when the moon come and the goons come, the crew runs\nLike a big Jamaican, I stand adjacent\nTo that S600 in amazement\nMy time gon' come, I'm headed to the top\nLike I never wore makeup, and I'm ready for the spotlight\nYou know I got my hoodie on, and it's such a hot night\nShit I'm straight from Queens, catch me in the limo like it's prom night\n\n[Hook: Action Bronson]\nDon't say a word to me\nYou already committed perjury\nA bunch of lies and sneaks and I don't play that\nYou know better, you better save that\n\n[Verse 2: Action Bronson]\nThis that do a hundred in the rental in the rain\nWith the jammy, a day before I have to go to Spain\nLivin' on the edge, different colored women in my bed\nDifferent, different colored linens on my leg\nMy mother said I better win or else she'll fuck me up\nMa we did it, I love you, you lucky slut\nSince I was young I had the husky gut\nBut I'm gorgeous, got money in the pouch just like a tourist\nSwerve in a Skylark, big piece of the pie chart\nBitch this is fine art, I gets my shine on\nYou lyin', dog, you never even put the iron on\nYou drive a Scion, you ain't ridin', dog\nMe, I'm cell built, grab your chest\nStill get hit with right hands from left field\nMy life is a kaleidoscope\nShe makes me feel just like I'm high on dope\nI never calm down, shoot the gun without puttin' my son down\n\n[Hook: Action Bronson]\nDon't say a word to me\nYou already committed perjury\nA bunch of lies and sneaks and I don't play that\nYou know better, you better save that\n\n[Outro: Big Body Bes]\nYou should have been known who the fuck this was\nJust by my fuckin' tongue\nBig fuckin' Body Bes\nYou know I'm all over everything now\nYou know me, you might see my face stamped on a bag of dope\nOut here gettin' filthy cause you know I got that ooh woo woo. You know me, I go home and change up\nI get fresh to fight. Just caught a new fuckin' case. But it's alright though, I got this stupid mothafuckin' lawyer\nHe told me, \"Don't even worry about that shit, Body. I'll make that go away\nNow what's for lunch?\" I told him, don't worry, I got the hookup\nAnything you want. Crown Fried on me, 1 through 6 only\nI know your type though\nThe type of mothafucka wear a three piece suit to go to court, shook to death\nAnd you there for smokin' weed\nPiece of shit, get the fuck outta here", "title": "The Rising", "album": "Mr. Wonderful", "image": "https://images.genius.com/3f40c65495de257e6acc2dabe3749b6b.800x800x1.jpg", "year": "2015-03-23"}], "artist": "Action Bronson"}