{"songs": [{"album": null, "year": null, "title": "Tipsy 09", "image": "https://s3.amazonaws.com/rapgenius/qlffff0000000000000000000000000000072bc0.jpg", "lyrics": "Paroles de la chanson Tipsy 09 :\nTeen drinking, is very bad\n\nYo, I got a fake I.D. though\n\nYeah\n\nYeah, Yeah\n\nYo, two step wit' me, two step wit' me\n\nOne, here comes the two to the three to the four\n\nEverybody drunk out on the dance floor\n\nBaby girl ass jiggle like she want more\n\nLike she a groupie and I ain't even on tour\n\nMaybe 'cause she heard that I rhyme hardcore\n\nOr maybe 'cause she heard that I buy out the stores\n\nBottom of the nineth and a nigga gotta score\n\nIf not I gotta move on to the next whore\n\nHere comes the three to the two, to the one\n\nHomeboy trippin' he don't know I got a gun\n\nWhen it come to pop, we do shit for fun\n\nYou ain't got one? Nigga you better run\n\nNow I'm in the back gettin' head from a hun\n\nWhile she goin' down I'm braggin' on what I done\n\nShe smokin' my blunt sayin' she ain't havin' fun\n\nBitch give it back now you don't get none\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nTwo, here comes the three to the four to the five\n\nNow I'm lookin' at shorty right in her eyes\n\nCouple seconds pass now I'm lookin' at her thighs\n\nWhy she tellin' me how much she hate her guy\n\nSay she got a kid but she got her tubes tied\n\nGirl you 21 girl that's alright\n\nI'm wonderin' if a shake comin' wit' those fries\n\nIf so baby, can I get them super-sized?\n\nHere comes the four to the three, to the two\n\nShe stay feelin' on my Johnson, right out the blue\n\nGirl you super thick so I'm thinkin' thats cool\n\nBut instead of one life hat, I need two\n\nHer eyes got big when she glanced at my jewels\n\nExpression on her face like she ain't got a clue\n\nThen she told me she don't run wit' the crew\n\nYou know how I do but that's just what I gotta do\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nThree, then comes the four to the five, to the six\n\nSelf explanatory, I ain't gotta say I'm rich\n\nYes single man, I ain't tryin' to get hitched\n\nLiquor wasted on me man, son of a bitch\n\nBrushed it off now I'm back to gettin' lit\n\nWit' some orange juice man, this some good 'ish\n\nHomeboy trippin' 'cause I'm starin' at his chick\n\nNow he on the sideline starin' at my click\n\nHere comes the five to the four to the three\n\nHands in the air if you cats drunk as me\n\nClub owner said, \"Kwon put out those trees\"\n\nDude I don't care I'm a P.I.M.P!\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\nEverybody in this bitch gettin' tipsy\n\n(Everybody in this bitch gettin' tipsy)\n\n..."}], "artist": "J-Kwon"}