{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "G.D.O.D (feat. Big Kuntry & Doe B)", "lyrics": "(Bridge)\nEvery day I’m all about that dollar bill hoe\nThat R E S P E C T I kill for\nLost a hundred grand, made a hundred mill though\nMy money long, your money short, back out so stand up\n\n(Hook)\nI’m lookin good, I roll the block\nI’m all about that GDOD, hoe, get dough or die\nSay I ain’t getting it, who told done told the lie?\nI’m all about that GDOD, hoe, get dough or die\n\n(Verse)\nSay girl stand, stakin, I can hit a mill\nPlayin hay, getting on my ass, I don’t give a fuck\nWe talkin paper, hood is up, we get them figures up\nThe order I’m payin for, I hit them niggas up\nTriple OG, they can sit around\nSlurp green like nigga you a sitting duck\nI park a drive, you suck a dick then I’m still bonified\nGDOD, you know me homie, know I’m gonna ride\nMy reputation all I got\nSome say I’m snitchin, pussy nigga, who you talkin bout?\nFuck nigga, we can have a paper work party\nBut she ain’t got no patience, Shawty do that work for me\n\n(Bridge)\nEvery day I’m all about that dollar bill hoe\nThat R E S P E C T I kill for\nLost a hundred grand, made a hundred mill though\nMy money long, your money short, back out so stand up\n\n(Hook)\nI’m lookin good, I roll the block\nI’m all about that GDOD, hoe, get dough or die\nSay I ain’t getting it, who told done told the lie?\nI’m all about that GDOD, hoe, get dough or die\n\n(Verse)\nI’m about that paper, I’mma get that til I die\nI’m not understanding you, we’ll see when we can lie\nI’m ridin round solo with some titties in my right\nThey say we ain’t getting money, they don’t motherfuckin lie\nI’m like shittin rich, we getting karats by the pound\nWe ain’t countin that so we gonna be countin for a while\nCut through it when I shoot\nNow they through it in the top\n‘Cause everybody came through\nShawty take they ball\nGet dough or die, they where you need it ho\nThough how the streets talkin you a dead man walkin\nAnd I just bought a Louie belt to hold that 40\nIf you play emotion to the death with that big ol 40\nFor real, I’m preachin out in Ogeeda\nDon’t talk about yo real, boy I’m walkin on the real\nAny boogers in my ear cost me brick fair\nAll white BBS’s look like fish scale\n\n(Bridge)\nEvery day I’m all about that dollar bill hoe\nThat R E S P E C T I kill for\nLost a hundred grand, made a hundred mill though\nMy money long, your money short, back out so stand up\n\n(Hook)\nI’m lookin good, I roll the block\nI’m all about that GDOD, hoe, get dough or die\nSay I ain’t getting it, who told done told the lie?\nI’m all about that GDOD, hoe, get dough or die\n\n(Verse)\nI’m all about my paper, bustin for my cheddar\nThe reason why you broke ‘cause you don’t know no better\nYou not talkin money I can’t see yo visions\nAll I do is getting money, that my true religion\nI will bust it down, pass when you were washin dishes\nYou was workin for the man, now we’re still up in it\nWe ain’t ghosts in the ghost, nothing is rented\nI don’t even know the price, bitch I just spin it\nYou see them Forgiato bitch, I pull em on the curb\nIf she’s not a bad bitch she getting no swerve\nCan’t even swing a rack, no sir\nI’m a selling digit nigga, like a phone long bird\n\n(Bridge)\nEvery day I’m all about that dollar bill hoe\nThat R E S P E C T I kill for\nLost a hundred grand, made a hundred mill though\nMy money long, your money short, back out so stand up\n\n(Hook)\nI’m lookin good, I roll the block\nI’m all about that GDOD, hoe, get dough or die\nSay I ain’t getting it, who told done told the lie?\nI’m all about that GDOD, hoe, get dough or die"}], "artist": "T.I."}