{"artist": "Playboi Carti", "songs": [{"album": "Playboi Carti", "title": "Magnolia", "image": "https://images.genius.com/b08ccdce49d2dc78a6abf5a8a46b076e.1000x1000x1.jpg", "lyrics": "[Intro]\nYo Pi'erre, you wanna come out here?\nIn New York, I Milly Rock, hide it in my sock\nRunning from an opp, and I shoot at opp (What)\nAnd I'm on the block (What, what, what)\nAnd I'm on the block (What)\nIn New York, I Milly Rock (Hello?), hide it in my sock (What)\nHide it in my sock (What), selling that re-rock (What, what, what, what, what)\n\n[Chorus]\nIn New York, I Milly Rock, hide it in my sock\nUsed to sell re-rock, running from the cops\nShooting at the opps (Yo Pi'erre, you wanna come out here?)\nShooting at the opps, 'cause I run they block\nGimme top (Top), in my drop-top\nAll these hoes gon' flock (Flock, flock), when I drop (Drop, drop)\nAll these hoes gon' flock (Flock, flock), when I drop (Drop, drop)\nAll these hoes gon' flock (Flock, flock), when I drop (Drop, drop)\n\n[Verse]\nWoo, woo, woo, woo\nWoo, woo, woo, woo\nAll these hoes want cash, all these hoes want bags\nFucking on yo' bitch, uh, I'm her dad\nAll these niggas sound like cash, sound like cash\nI'm a soldier, damn, I thought I told you\nShootin' like a soldier, like I'm from Magnolia\nAll these, niggas, always, fold\nBig, bank, never, fold\nSippin, Act', fill that shit slowly\nBitches, on me, say she like my clothing\nI'm in London, Young Carti global\nDesigner is on me, call it dirty laundry\nAll these bitches want Young Carti, Young Carti (Yeah)\nAyy, Young Carti, Young Carti (What)\nYoung Carti, Young Carti (Yeah)\nAll of your bitches, they loose\nAll of your bitches, they loose\nAll of my bitches, they rich\nAnd they stay rockin' that Rick\nWhat, what, huh, what, what, huh\nRich, rich, Cash Carti, bitch\nRich, bitch, got a rich clique\nI'm suckin' on the clit, she suckin' on the dick\nGive that ho a tip, told her, \"Buy some kicks\"\nThen I brush my teeth, pop up in a whip\nGlocky in the whip, glocky in the whip\nAnd I'm cocky, fuckin' on a thotty\nShe just wanna plot me, bitch can't stop me\nI'm riding in a Masi', this ain't even my Masi'\nOh, that's not yo' thottie? Yo' bitch look like a aunty\nWalked in with Ashanti, damn, that look like 'Shanti\nDamn, that look like Carti, I think that be Young Carti\nHeard he spent a hunnid on a fucking watch piece, that's filthy\n\n[Chorus]\nIn New York, I Milly Rock, hide it in my sock\nRunning from an opp, then I shoot at opp\nAnd I'm on the block\nAnd I'm on the block\nIn New York, I Milly Rock, hide it in my sock\nHide in my sock, selling that re-rock\nWhat, what, what, what, what\nIn New York, I Milly Rock, hide it in my sock\nUse to sell re-rock, running from the cops\nShooting at the opps\n\n[Outro]\nYou know what I'm sayin'?\nYo, Pi'erre, you wanna come out here?\nBitch ass nigga, fuck that nigga, man!", "year": "2017-04-14"}]}