{"songs": [{"title": "GET MONEY BROS.", "album": "Lil Boat 2", "year": "2018-03-09", "image": "https://images.genius.com/c5ccfc3f04970ad45b0bbde6ea1fa1ac.1000x1000x1.jpg", "lyrics": "[Intro]\n30, you a fool for this one\nEar Drummers\nLil Boat\nYeah, yeah\nYeah, yeah\n\n[Verse 1: Lil Yachty]\nBurn his ass out like a skillet (Woo)\nAll that shit talking online gon' and kill it (Woo)\nThrow them legs up and I promise I'll drill it (Woo)\nWhip wasn't high enough, I told 'em lift it\nCheck wasn't high enough, I told 'em lift it (Woo)\nBought bro a Rollie 'cause my brother gifted\nThat pussy pretty but I still gotta sniff it\nWhole team got chains on, I call that certificate (Uh, ooh)\nWhere your money lil' nigga?\nWearin' 10 chains don't make your diamonds bigger (No)\nLook at my ring, that's a 80\nFuck up V Live when I'm bored wit' Lil Baby\nBorn in '97 my bitch from the '80s (Woo)\nShe drive a young nigga crazy\n\n[Verse 2: Tee Grizzley]\nI'm from Detroit between Evergreen and Southfield Road (We come up off the freeway)\nMoney long as 6 Mile, fuck nigga, but you know I'm so Joy Road (Joy Road)\nShit I seen in my hood made me the type to sneak into awards with my pole (Brra, brra)\nThree million, I got that in cash, 400K, got that in gold (Got that in gold)\nCrib came with a sauna (Crib came with the sauna)\nBeam came on the MAC (Beam came on the bow!)\n200 miles a hour (Skrr skrr), this a Hellcat not a Scat (Skrr skrr)\nWe ain't cosignin' no rats, talkin' to the cops only time these niggas state facts (Only time these niggas state facts)\nLeave a nigga brains in his lap, he was driving, chopper put him in the back (Brra)\n\n[Chorus: Lil Yachty]\nWe the young niggas gettin' money, yeah\nEverybody 'round us gettin' money, yeah\nNiggas in the back, they gunnin', yeah\nVVS diamonds so stunnin', yeah (Bling)\nA bitch nigga mad, well, so? (So?, Yeah, ayy)\nWe the fuckin' get money bros (Get money)\n\n[Verse 3: Lil Yachty]\nGotta get guap, gotta get it\nUsed to ride 'round baggin' hoes in a Civic\nNow I pick and choose, I'm super specific\nShawty slurp nut like a Blueberry Mistic (Ew)\nUhh, watch where you steppin'\nBang what you bang, nigga, rep what you reppin'\nDon't you dare ever dap me with yo' left hand\nRespect my pimpin', I'm ballin' like I'm Pippen\n\n[Verse 4: Tee Grizzley]\nMy Uber actin' so janky right now, bro come pick yo bitch up (My shit ain't workin')\nYou pull up on tip, I'ma headshot you, then gotta pick yo shit up (Boom, boom)\nMy diamonds so white, I was whippin' the dope, almost got it mixed up (Skrr skrr)\nI shaved off my firin' pin, it was one shot, now it got the hiccups (B-Boom, boom, boom)\n\n[Chrous: Lil Yachty]\nWe the young niggas gettin' money, yeah\nEverybody 'round us gettin' money, yeah\nNiggas in the back, they gunnin', yeah\nVVS diamonds so stunnin', yeah\nA bitch nigga mad, well, so? (Huh, yeah, ayy)\nWe the fuckin' get money bros"}], "artist": "Lil Yachty"}