{"artist": "Positive K", "songs": [{"album": null, "title": "I Got a Man (Ultimix Remix)", "image": "https://images.genius.com/c2abf6077deb234a5be12d881aa642e6.350x350x1.jpg", "lyrics": "Aiyyo sweetie, you're lookin kinda pretty\nWhat's a girl like you, doin in this rough city\nI'm just here, tryin to hold my own ground\nYeah, I think I like how that sound\nWhat you say we gets to know each other better?\nThat sounds good but I don't think that I can let ya\nI don't know, tell me is it so\nDo you get a kick, out of tellin brothers no?\nNo it's not that see you don't understand\nHow should I put it, I got a man\nWhat's your man got to do with me?\nI told ya\nI'm not tryin to hear that see\nI'm not one of those girls that go rippin around\nI'm not a dove baby, so don't play me like a clown\nI'll admit, I like how you kick it\nNow you're talkin baby, dats da ticket\nNow don't get excited and chuck your own in\nI already told ya, I got a man\nWhat's your man got to do with me?\nI got a man\nI'm not tryin to hear that see\nI got a man\nWhat's your man got to do with me?\nI got a man\nI'm not tryin to hear that\nNow you can persist and play Don Juan all night\nBut ain't nothin gonna change\nYeah baby, sure you're right\nI'ma break it down and do whatever I gots to do\nI'll tell you now, I got eyes for you\nYou got eyes, but they're not for me\nYou better use them for what they're for and that's to see\nYou know what's the problem, ya not used to learnin\nI'm Big Daddy Longstroke, and your man's Pee Wee Herman\nI got a question to ask you troop\nAre you a chef, cause you keep feedin me soup\nYou know what they say about those who sweat thyself\nYou might find yourself, by yourself\nI'm not waitin because I'm no waiter\nSo when I blow up, don't try to kick it to me later\nAll them girls must got you gassed\nA-when they see a good thing they don't let it pass\nWell that's OK, cause see if that's their plan\nCause for me, I already got a man\nWhat's your man got to do with me?\nI got a man\nI'm not tryin to hear that see\nI got a man\nWhat's your man got to do with me?\nI got a man\nI'm not tryin to hear that\nWhat am I, some crab inmate\nThat just came home from jail sweatin you for a date?\nI don't want no beef, I just wants to get together\nBut how you talkin, pssssh, whatevah!\nWe can't have nothin\nIt all depends\nWell if we can't be lovers than we can't be friends\nWell then I guess it's nothing\nWell hey I think you're bluffing\nWell I'ma call my man\nWell I can get raggamuffin\nYa better catch a flashback remember I'm not crabbin it\nYou know my style, from I'm Not Havin It\nAll I remember's an excuse me miss\nYou can't get a guy like me with a line like this\nWell look I'll treat you good\nMy man treats me better\nI talk sweet on the phone\nMy man writes love letters\nI'll tell you that I want you, and tell you that I care\nMy man says the same except he's sincere\nWell I'm clean cut and dapper, that's what I'm about\nMy man buys me things and he takes me out\nWell you can keep your man, cause I don't go that route\nDon't you know yu haffa respeck me\nThere's a lot of girls out there who won't say no\nYou're out for mami with your DJ Money\nBoom batter my pockets is gettin fatter\nI wanna turn you on and excite you\nLet me know the spot on your body and I bite you\nSo when your man don't treat you like he used to\nI kick in like a turbo booster\nYou want lovin you don't have to ask when\nYour man's a headache, I'll be your aspirin\nAll confusion, you know I'll solve em\nI got a man\nYou got a what?\nHow long you had that problem?\nWhat's your man got to do with me?\nI got a man\nI'm not tryin to hear that see\nI got a man\nWhat's your man got to do with me?\nI got a man\nI'm not tryin to hear that\nI got a man\nAiyyo baby put the dial numbers or your address\nI got a man\nI told ya I treat you right\nI got a man\nAww c'mon now ain't no future in frontin\nI'm not havin it\nC'mon Miss, oh we back on that again\nUhh, I'm not tryin to hear that see\nI got a man\nBut your man ain't me\nUhh, uhh, I got a man\nYou got a WHAT?\nUhh, uhh, uhh, I got a man\nYou got a WHAT?", "year": null}]}