{"artist": "WC", "songs": [{"year": "2007-08-14", "lyrics": "[Intro: Ice Cube]\nYo what's up?\nOfficial T-shirt nigga\nHood certified\nDub Sizzle\n\n[Chorus 1: WC]\nWhere my, where my, where my hustlers at?\nWhere my, where my, where my hustlers at?\nWhere my hustle is at, where my hustlers at?\nBabies give give give money. Throw their hands up\n\n[Verse 1: WC]\nSixteen in the chamber with a stack between my fingers\nGeto Boys, NWA, Schooly D in the CD changer\nReclining like The Mac, swoop on the ave\nCruise the block like a float in a parade in a seven and a half\nSitting low [?] so [?] to the Pro Fitted\nHustler, hustler, nigga all I know is a goal get it\nAh, ah, ah the flow is so wicked\nStrip for me baby, slide down this chocolate pole and grip it\nGoing all out for the dough, ball out and roll\nDub keep it G, nigga this hood shit is all I know\nGot the dice [?] up, my ice cleaned up\nNow I cater the streets like the weed man out of the ice cream truck\nDiamonds on my neck shining in the club like daylight\nDub C be hitting it right, by the end of the night you be saying \"all right\"\n22 is the inches, 69 is the position\nLench Mob and gangsta shit, money's my addiction, nigga\n\n[Chorus 2: Ice Cube]\nWell you 'bout to bow down when you see a OG\nComing straight out the hood it's my nigga WC\nWell you 'bout to give it up but we do you ugly\nWe addicted to it, gettin' closer to it\n\n[Chorus 1: WC]\nWhere my, where my, where my hustlers at?\nWhere my, where my, where my hustlers at?\nWhere my hustle is at, where my hustlers at?\nBabies give give give money. Throw their hands up\n\n[Chorus 3: WC and Ice Cube]\nI'm addicted to green that don't burn\nUp in the kitchen without a concern\nMothafuckas will learn it's my turn\nI'm addicted to it, getting closer to it\n\n[Verse 2: WC]\nMaking it bounce, making it bounce, chrome frame making it bounce\nI know girls like money so I'm sticking them and dicking them now\nDick in their mouth putting a dick in their mouth with a .44 on me sticking out\nWindows getting foggy while we doing it all night doggy style\nActing up run the weed up, jag in cup, G'd up\nFucking it up my Chucks moving and doing my new dance while I'm holding my n-eez-uts\nBack down then side to side I skip skip throw my dubs up high\nRunning around South Central bottom with a bandana on my steering column\nSlap boxing, dominoes, jail breakers squatting low\nSwitching up and our fly S5 on mine, middle finger out the window with one time\nRiding when I beat up on the concrete I be sliding when I get up on a bitch their eyes get\nWide and when they see me sagging and lagging them, Lench Mob medallion\nBlinding them. Hood screw up your stars and it ain't no killing ours\nStill the stars whoop your ass for the cash, yeah, I'm guilty as charged\nQuarter pounds, assholes, whatever you need best believe don't trip\nIf the price is right I take a trip for flip and get them [?]by one zip for zip\nSitting on but I'm dipping on but I'm tipping on nigga getting it on\nWith a freak on the side of me sipping Patrón trying to whip it on, baby licking my bone\nAnd I'm starting to moan cause them lips are long and I can see me getting my pimping on\nAnd she tripping on but I'm twisting on my swap meet corduroy slippers on\nCause I'm real with this, I was built for this, nigga muthafucking WC is still the shit\nAnd I ain't leaving until I get another meal in this, so every time I spit it I'm killing shit\nSo nigga dig a ditch, get out the wilderness, I'm hood-certified and still with this\nWhen will I quit? Oh, fuck it nigga, I ain't quitting until I'm filthy rich\n\n[Chorus 2: Ice Cube]\nWell you 'bout to bow down when you see a OG\nComing straight out the hood it's my nigga WC\nWell you 'bout to give it up but we do you ugly\nWe addicted to it, gettin' closer to it\n\n[Chorus 3: WC and Ice Cube]\nI'm addicted to green that don't burn\nUp in the kitchen without a concern\nMuthafuckas will learn it's my turn\nI'm addicted to it\nGetting closer to it\n\n[Chorus 1: WC]\nWhere my, where my, where my hustlers at?\nWhere my, where my, where my hustlers at?\nWhere my hustle is at, where my hustlers at?\nBabies give give give money. Throw their hands up\nWhere my, where my, where my hustlers at?\nWhere my, where my, where my hustlers at?\nWhere my hustle is at, where my hustlers at?\nBabies give give give money. Throw their hands up", "image": "https://images.genius.com/d4ed6bd2c7a379500fac9a01a4457d66.300x300x1.png", "album": "Guilty by Affiliation", "title": "Addicted to it"}]}