{"songs": [{"year": "2000-04-04", "image": "https://images.rapgenius.com/b70930fc56c82c3038f706c659b43fc6.500x500x1.jpg", "title": "My Turn", "album": "Yeeeah Baby", "lyrics": "[Intro]\nPsssh.. it's my turn, y'knahmean?\nGet this motherfuckin money y'know?\nShit..\nYeah I went double, y'know?\nNiggas is goin' triple-five-ten platinum\nCan't do what I do\nThis is my game, this is me\n(T. Squaders) Y'know?\n\n[Chorus]\nYo it's my turn, I demand my respect\nGive me my burn, or get slammed in your neck\n'Cause it's my turn, I'mma reach to the top\nGimme my burn, I'mma speak with the Glock\n'Cause it's my turn, don't make me turn your wig\nGimme my burn, don't make me burn yo' crib\nI'mma rhyme it right, and keep the ghetto in a trance\nBut when the time is right, me and the devil gon' dance\n\n[Verse 1]\nFuck you and yours, make way I'm comin' through the door\nAnd screw the law, breakin' the rules ain't nothin' new at all\nI'm true to all the shit that I done, check the clip in my gun\nRespect the clique that I'm from, or get lifted or somethin'\nDunn, you just a small fry, fuckin' with the fall guy\nBig Pun, the Honorable, all rise\nSky's the limit, nothin' less if my guys is in it\nFor the right price, even Christ could get it\nFast life we live it, all my memories are vivid\nI remember only minutes, that's how I mentally get rid of all the enemies\nThe spirits that definitely mimic my every melody\nAnd lyric which so heavenly rhythmic\nIn magic do I build, but math do be equally compatible\nAnd secretively battle you to reach my peak in equilateral\nI'm from the streets deep in the barrio ain't no Mario Brothers\nOfficial Bronx niggas, quick to body yo' mother (ouch)\n\n[Chorus]\nYo it's my turn, I demand my respect\nGive me my burn, or get slammed in your neck\n'Cause it's my turn, I'mma reach to the top\nGimme my burn, I'mma speak with the Glock\n'Cause it's my turn, don't make me turn your wig\nGimme my burn, don't make me burn yo' crib\nI'mma rhyme it right, and keep the ghetto in a trance\nBut when the time is right, me and the devil gon' dance\n\n[Verse 2]\nJesus H. Christ, how many times I gotta pay the price?\nYou scared of death I'll make you twice as afraid of life\nI bring sight to the game for every night you complained\nYou couldn't see the light, I was bright in your brain\nIgnitin' the flame, keepin' your third lit\nSpeak and observe with the mind\nWhat are blind sleep til they worth shit\nI'm earth wind and fire, the first one to fire\nReppin T. Squad since birth 'til I retire\nI wire your jaw, wire the walls with plastique explosives\nAnd riot the halls at the malls where all the crackers moms live\nKeep flappin yo' gibs and I'mma come back with those kids\nFrom the back of the bridge\nI think two hand touch means tackle the bitch\nI rap for the chips, but I'm truly assassin\nFour hundred pounds, six feet tall, brutally handsome\nThat's the pro, got beef with Pun, you gots to go\nMafia style, tear you a new ass-a-hole\nFlash your dough, but you too cool for the captain\n'Cause I don't give a fuck if I was quadruply platinum\nAnd to the 50 Cent rapper, very funny, get your nut off\n'Cause in real life, you don't know\nI'll blow your motherfuckin' head off (ooh yeah)\n\n[Outro]\nThat's my motherfuckin word, you understand?\nThought we was a fuckin' joke? Shit\nTerror Squad nigga, you don't know me\nYou don't know my name, don't say it, you understand?\nTold you before I ain't no motherfuckin' rapper understand?\nShit, I don't make no songs about rappers I don't like\nIf I'mma make a song it's gon' be how I beat yo' motherfuckin ass understand? That'll be the name of the motherfucker\n\"That's Why I Had to Beat Your Motherfuckin Ass\"\nFeaturing Tony Sunshine\nT. Squaders, T. Squaders, T. Squaders\n\n[Chorus]\nAnd it's my turn, I demand my respect\nGive me my burn, or get slammed in your neck\n'Cause it's my turn, I'mma reach to the top\nGimme my burn, I'mma speak with the Glock\n'Cause it's my turn, don't make me turn your wig\nGimme my burn, don't make me burn yo' crib\nI'mma rhyme it right, and keep the ghetto in a trance\nBut when the time is right, me and the devil gon' dance"}], "artist": "Big Pun"}