{"songs": [{"year": "2018-07-05", "lyrics": "[Intro]\nIn search of something greater\nI'm sick and tired of doing fuck niggas favors\nI'm sick and tired of chasing down designer labels\nSo I said \"fuck it, imma start up my own label\"\n'Cause tryna please you, I just ain't capable\nI'm sick and tired of tryna make myself relatable\nSo please don't ask me why my eyes low\n'Cause madafucka i could do this with my eyes closed\n\n[Verse 1]\nHow many hits? How many pills do I gotta take to think of a hit?\nTo be at the top, how much cotton do I gotta pick?\nHow many M's do I gotta get? Don't make any sense\nAin't that a bitch? Ain't I legit?\nSinse I was a git, fuck with my shit\nI was a stubborn kid, I grew up stuttering, hoping that someone on top would discover me\nHow many publicists do I gotta-?\nHow many publicists I gotta hire to juggle this fuckery? Someone should cover this, I've had enough of this\nI can't make up this shit, I am on too many substances\nHow many streams? How many themes? How many awards? How many rings?\nFuck with these dreams\n\n[Hook]\nWho I ride for?\nDefinitely not no clown-ass niggas, call you sideshows\nAnd we, and we know that your IG be telling lies, ho\nI'mma reap the shit that I sow\n\n[Verse 2]\nI find it odd, niggas stay saying \"don't wife a thot\"\nBut you wifing thots behind the dignified facade\nYour life's in knots, my life might appear more aligned a notch, but I'm on suicidal watch\n(Hello? you ever just wanna die a lot)\nWell, commence the chords, B.o.B you sound rich and bored\nI say we're just a bunch of piles of shit with pores\nThat spend all day eating, then shit some more\nI don't want kids, I'm convinced, I'm sure\nPull out like my dick's a sword\nEight billion people, 90% of them's poor, but fuck it, what's a few more\nLet's even get more shit to afford\nSeventy summers and you're a cripple corps\nYou on, you on, you on my dick\nA dog, a dog, a dog only holler when it's hit\nThat means something I said must got under your skin\nTell me, how real can I get?\nI said fuck the feds, the twelve, the cia and apeshit\n'Cause they can't do shit\n\n[Hook]\nWho I ride for?\nClown-ass niggas, call you sideshows\nYour IG be telling lies, ho\nI'mma reap the shit that I sow\n\n[Outro]\nIn search of something greater", "title": "Dontbenobodysbitch", "album": "NAGA", "image": "https://images.genius.com/a0370f3b55eb19a51f991675764cc669.1000x1000x1.jpg"}], "artist": "B.o.B"}