{"artist": "Angie Martinez", "songs": [{"title": "What’s That Sound (Remix)", "image": "https://images.genius.com/439f66679a994188cae23c6858565d8a.438x438x1.jpg", "album": null, "lyrics": "[Peter Gunz]\nB-X\n[Pharrell Williams]\nOh you gangster now\n[Peter Gunz]\nBrooklyn\n[Angie Martinez]\nAngela\n[Peter Gunz]\nHarlem\n[Pharrell Williams]\nYou ain't gangster nigga\n[Peter Gunz]\nQB\n[Angie Martinez]\nAnimal House\n[Peter Gunz]\nStaten Isl\n[Pharrell Williams]\nRemix, 2002 Baby\n[Peter Gunz]\nJersey, Philly\n[Pharrell Williams]\nAll the mother fuckers in the hood that's really\nGhetto and gangster\n[Peter Gunz]\nGunz, Tariq, Angie & N.E.R.D\n[Pharrell Williams]\nBring it from the top\n\n[Peter Gunz]\nIf you mad and you hatin' mother fucker please kill it\n\nYou know Neptunes is hot like skillets\nYour ego's scared then nigga please go heal it\nThat tight ass fitted cap the dogs will peel it\nLong as the Bronx still got me and New York still feel it\nFor the jump off, jump off niggas best to kill 'em\nAy yo Gunz you change let's make it rain you conceited\n\nNaw still got a 9 girl and Peter still eatin'\nI'm just another nigga from the hood in the car\nSix double zero bikes double the R\nSee them dogs draped in red cover the bar\nSee them cowards be in the club trouble we are\nI smokes no drugs just Henney no chase\nFoot on the throttle with models giving me face\nLike Oochie Wally Wally she gave me lolly lolly\nNow you wanna polly polly holla if you hear me y'all\n\n[Chorus: Pharrell Williams & (Lord Tariq]\nUptown what is that sound (let 'em know)\nHarlem what is that sound (I wanna know)\nBrooklyn what is that sound (I gots to know)\nQueensbridge what is that sound (I wanna know)\nJersey what is that sound (tell me somethin' man)\nPhilly what is that sound (Angela)\nD.C. what is that sound (come on I wanna know)\nVA what is that sound (I gots to know)\n\n[Angie Martinez]\nYo, if you mad and you hatin' muh fucker please kill it\nPuerto Rican diva came thru to rip it, shit\nYa'll niggas need to know i'm not playin'\nI'm spittin serious bitches need to know what I'm sayin\nFuck, it ain't a game no more this is realness\nAll the way out to Cali ya'll bloods & crips feel this\nDont act like I still ain't runnin' this shit\nAngela, model/rapper and top radio bitch\nReppin' the Boriquas!! Ya'll know Angie keeps it real\nAnd I'm still pushin records & not sex appeal\nITS ANIMAL HOUSE, we're I sign ya'll to deals\nAnd make cash to keep 22's in the wheels\nI can never be broken, never ever soft spoken\nLight up the blunt and I just start tokin'\nHardest workin bitch in the entire industry\nFUCK THE HATERS!! Ya'll need to take a look at me\nI'm 10 years strong, count em 10 years long\nCan't nobody stop my hunger, people love my songs\nIf I Could Go climbed up to the top\nAnd I got a shit load of hits, bitch it dont stop c'mon!!\n\n[Chorus: Pharrell Williams & (Angie Martinez)]\nTy Water what's that sound (I wanna know)\nRichmond what's that sound (Angela)\nBaltimore what's that sound (I got's to know man)\nChi-Town what's that sound (come on tell me somethin' man)\nDetroit what is that sound (Animal House)\nHouston what is that sound (I need to know man)\nLittle Rock what's that sound (I got's to know man)\nL.A. what is that sound (I need to know man)\n\n[Pharrell Williams]\nOh you gangster now\nWord!\nYou ain't gangster nigga\n\n[Peter Gunz & (Lord Tariq)]\nIts been a minute since we spitted 'em\n(Dogs we be killin' 'em)\nNiggas they be hatin' 'em\n(Broads they be feelin' 'em)\nActin' like we reachin' man\n(Ay yo Gunz let me get at them)\nLook at how he buckle (when them things get to hittin 'em)\nJust another nigga with his face in the sand\n(I pull them things out and blam!) him and his man\n(I guarantee my guns won't jam) he should a ran\n(I'm crazy with a thing in my hand) you understand\n(Ay yo Gunz we ain't havin' that) Lord I be grabbin' that)\n(I run up in his crib tap the safe where he stash it at)\nGive me half of that I slap 20's on the Cadillac\n(Laughin' at chickens I'm only trickin' if I'm tappin' that)\nAy yo I'm hittin' Hon's (sippin Henney)\nGot money (gettin' plenty what you thinkin')\nWe brings (drama to whoever we can) squeeze things\n(From the street to the stage nigga) we sing\n(Bring the chorus in)\n\n[Chorus: Pharrell Williams & (Peter Gunz)]\nCome On!\nSound view what is that sound (come on man)\nWatson what is that sound (come on man)\nClay Ave. what is that sound (tell me somethin' man)\nL.E.S. what is that sound (I need to know man)\nWestville what is that sound (I wanna know) come on!\nBroadway what is that sound (I need to know)\nMemphis what is that sound (I gots to know)\nUptown what is that sound (tell me somethin' man)\nHarlem what is that sound (I wanna know)\nBrooklyn what is that sound (I need to know)\nQueensbridge what is that sound (I gots to know man)\nJersey what is that sound (I need to know man)\nPhilly what is that sound (please tell me somethin' man)\nD.C. what is that sound (come on man)\nTy Water what's that sound (come on man)\nRichmond what is that sound (tell me somethin' man)\nBaltimore what is that sound (ah ha ah ha)\nChi-Town what is that sound (I need to know) come on!\n\nDetroit what is that sound (I need to know) come on!\nHouston what is that sound (I gots to know) come on!\nLittle Rock what is that sound (ah ha ah ha)\nL.A. what is that sound come on!\nSt. Louis what is that sound (come on)\nO-Town what is that sound (tell me somethin' man)\nN.O. what is that sound (tell me somethin' man)\nGeorgia what is that sound (I need to know man)", "year": null}]}