{"songs": [{"year": null, "image": "https://s3.amazonaws.com/rapgenius/black-rob-news.jpg", "title": "Whoa! 12\"", "album": null, "lyrics": "[Black Rob]\nWe gon' take this all around the world\nYo, I'm 'bout ready to put y'all up on something else, man\n(Whatcha gon' put us up on, man?)\nYo, this part two of the raw shit(We ain't never gonna stop)\nOkay, y'all know what this is\nThe remix, you know what I mean? (Life Stories)\nAllright, anything ill you see it's WHOA! (I know that)\nLike for instance, Black Rob is WHOA! (Oh no doubt)\nAnd Bad Boy is WHOA! (No doubt)\nAnd that's it, man, word up\n\n[Rah Digga]\nDigga on a Black Rob track like WHOA!\nBrick City where we smack cops back like WHOA!\nMy whole crew dime pieces in the Jeep like WHOA!\nJuicy lips, big tits, pussy deep like WHOA!\nDon't trip, on the mic I'm the bitch like WHOA!\nBe the illest when I spit, see my flicks like WHOA!\nChicken heads wanna know where I shop like WHOA!\nRah single knocking niggas out they slot like WHOA!\nEverywhere honey go, cats jock me like WHOA!\nDigga puttin' TVs on Ducati's like WHOA!\nRah first featured on The Score like WHOA!\nBroads tried to run up on my draws like WHOA!\nC'mon, nigga's got spunk and I freak the funk\nH-Town where they lean, ATL where they crunk like WHOA!\nShouts to everybody I know\nHigh pro, nice toes, live shows, tight flows like WHOA!\n\n[Lil' Cease]\nCease come through with the E-Pills like WHOA!\nA bunch of white hoes following like WHOA!\nThey pulling my pants down, shit, I'm like WHOA!\nThey giving me head now, B.R. like WHOA!\nBust off, she swallowed the whole nut, I'm like WHOA!\nThe bitch was thick, the back shop was like WHOA!\nDaddy, long stroke, give it to 'em like WHOA!\nCease-a-Lee bad with a chrome like WHOA!\nMy four-four blow silently like WHOA!\nCock it back, squeeze one more time like WHOA!\nYou wanna be B.I.G., nigga, picture that WHOA!\nI'mma frame yo' ass, right where you set it at WHOA!\nYour flow ain't WHOA! Your crew ain't WHOA!\nYour ice ain't WHOA! Your Benz ain't WHOA!\nBlack Rob, M.A.F.I.A., smoke 'dro\nGet dough, nice hoes, nice clothes like WHOA!\n\n[G-Dep]\nG-Dep spit fire like WHOA! (G-Dep, let's go)\nBust two shots through your tire like WHOA!\nTyin' up the getaway driver like WHOA!\nFrontin' like you live, but we liver like WHOA!\nGettin' electrified trying to touch it like WHOA!\nYou reach wrong, might lose your arm like WHOA!\nGot the detanator in my palm like WHOA!\n3-2-1 hit the bomb like WHOA!\nI'm a beast, born in the Belly like WHOA!\nExcursion, stolen perellies like WHOA!\nI don't think there's nothing y'all can tell me that's WHOA!\nSo I'mma just wreck the show, get the dough like WHOA!\nWait! Stop the tape!\nI live the fast life and I only stop for cake like WHOA!\nMy niggas, get dough, get low, hit 'dro, hit hoes, spit flows like WHOA!\n\n[Da Brat]\nWhen the cooch get wet, it's real juicy like WHOA!\nYou fuck up my check, I'm calling Lucy like WHOA!\nI fell off in the club 20 deep like WHOA!\nLit up about five blunts a piece like WHOA!\nWhen my new shit drop niggas gon' be like WHOA!\nWhen the 34-Bs fill up the bra they like WHOA!\nWhen niggas see the size of my ass they like WHOA!\nWhen the chrome rim shine on the Nav they like WHOA!\nUgh! I sparkle on every finger like WHOA!\nSame bitch who said the goldier scent lingers like WHOA!\nNigga, what bitch is hotter, I'm most requested it like WHOA!\nI'm \"Unrestricted\", my perfected like WHOA!\nThe bitch got jazzy, I had to slap her like\n(*immitating slapping sounds*)\nWhen niggas ask me to rap for free I'm like nigga WHOA!\nMy niggas, So So; Plat, Gold, Brat cold\nFlyin' bigga, type clothes WHOA!\n\n[Beanie Sigel]\nSigel came to set up shop, you gotta ROLL!\nEverytime I gotta step on the block, they like WHOA!\nThem young 'uns see the print of the Glock be like WHOA!\nEverytime I'm spinning the block, they like WHOA!\nBitches talk about \"Can I go?\" I'm like NO!\nI'm all about the dough, ain't got no time for no WOES!\nYou catch me on the block on my ground wit' these HOES!\nNiggas takin' nines up the nose straight FROZE!\nGot 'em coming back everytime like WHOA!\nI got 'em doing petty ass crimes like WHOA!\nThey do anything for the coke like WHOA!\nThey know my shit fresh off the boat like WHOA!\nI grips the fo-fo and hit your ass up\nCome through in the truck slow like WHOA!\nMy niggas get dough, get locked\nGet out, get low, get mo' like WHOA!\n\n[Black Rob]\nI hit to the scene in '95 like WHOA! (Robeo, Robeo)\nBroke like a motherfuckin' dog like WHOA!\nRobbin' niggas cribs in Mid-Town like WHOA!\nPlus I'm on the run from my PO like WHOA!\nI remember scraping shanks on the floor like WHOA!\nTakin' niggas' commissary flipping it like WHOA!\nNow y'all see the God on TV you like WHOA!\nDoin' my dance wit' PD like WHOA!\nNow I got the house and my whip it's like WHOA!\nJewels heavier the ice clear like WHOA!\nShit, L.O.X. left and Ma$e retired like WHOA!\nSo I threw the label on my back like WHOA!\nAnd more less, more so, I'll rip your torso\nI live the fast life, come through in a X-5 like WHOA!\nMy niggas like dough, light dro', nitro\nMic flow, nice clothes like WHOA!\n\n[Puff Daddy]\nYeah, uh uh, it ain't over yet, man\nYou know how them...the DJs...y'all gotta...\nSpin it back around and start it from the top\nI ain't gonna make you do that on this remix\nWe gon' keep it goin\nWe gon' give you a little taste..\nOf WHOA! young guns..\nBad Boy baby\nWe won't stop, cuz we can't stop\nAAAAHHHH!!\n\n[Shyne]\nWHOA! Keep a stainless on my hip like WHOA!\nShoulda seen them clips with the tips like WHOA!\nPut it to your face for the cake like WHOA!\nExpert, six to your shirt like WHOA!\nSin is a problem in Harlem like WHOA!\nBorn in BK wit a AK like WHOA!\nGot wit BR, spit a bar like WHOA!\nD's on my back, spit the Mac like WHOA!\nHad to cool off smoke a Newport WHOA!\nDid the video that had the Feds like WHOA!\nFlow off the heezy talking greasy like WHOA!\nShe's a G.B., so she easy like WHOA!\nGod bless, for the dough, I pop the pistol\nCome through in a Volvo like WHOA!\nMy niggas fly dro, hydro, 5-0\nHigh low, spit the bars like WHOA!\n\n[Petey Pablo]\nI'm from the dirty, filthy nasty dirty WHOA!\nBitch in North Carolina, I'm the motherfucking WHOA!\nThis shit be good to a motherfucker like WHOA!\nSmoke neckbones and a pot of rice WHOA!\nI know I ain't right, but motherfucker I'm WHOA!\nHit you with a Jackie Chan chop like WHOA!\nChase you with a half a water pipe like WHOA!\nY'all keep actin' like y'all ass can't get it WHOA!\nFuck around and have ta loose your balance like WHOA!\nCuz I'll snap the butane fire on ya like WHOA!\nMan, let's get this motherfucker crunk like WHOA!\nAnd tear this motherfuckin' club the fuck up like WHOA!\nMore or less, more so, I'll kick your asshole\nI Am the fast life come through in a dump truck like WHOA!\nMy people like dough, like dro, ni-tro\nMic flows nice clothes like WHOA!\n\n[Madd Rapper]\nI really hate you fuckin guys the Madd Rapper's like WHOA!\nAin't got a goddamn dime my shit ain't happen like WHOA!\nI'm coming after yo' ice, gon' pull a heist, you like WHOA!\nCuz I'm in Family Court, my daughter mom, she needs DOUGH!\nBrooklyn niggas ride trains, we steal your chains you like UGH!\nI steal your mics and pull the plugs at your shows you like WHA!\nYour new Timbs, I'm steppin' all on your toes, you like WHOA!\nI hate you niggas, spill my drink on your clothes you like WHA!\nI got a 20 of trash, y'all smokin 'dro I'm like WHOA!\nAnd I'm bootleggin' your albums, y'all need the dough, you like WHOA!\nI know y'all hearin my shit, y'all on my dick, I'm like WHOA!\n\"Well, my album caught a brick\", I'm fairly sick, I'm like WHOA!\nNo sales, no plaques, no shows, no world tours\nI live a rap life so I'm trying to live yours\" I'm like WHOA!\nMy niggas, Black Rob, Bad Boy, Crazy Cat, Madd Rapp'\nAnd that's that I'm like WHOA!\n\n[Puff Daddy]\nBad Boy 2000 WHOA!\nWe're baaaack\nWe ain't never going to stop (Life Stories)\nJoe Hooker is like WHOA!\nShot back is like WHOA!\nBlack Rob is like WHOA!\nAlumni\nBad Boy baby WHOA!\nM.A.F.I.A\nQueen Bee WHOA!\nD-Dot\nFamily WHOA! (This the remix y'all)\nNow we ain't never gon' stop\nWHOA!\nBad Boy is like WHOA!\nWe been like WHOA! for 10 years\nJust bounce"}], "artist": "Black Rob"}