{"songs": [{"title": "Bulls on Parade - triple j Like A Version", "year": "2019-02-15", "album": "triple j Like A Version 15", "image": "https://images.genius.com/fd6be7f51b7e4c9fa54ee0c76136c2de.1000x1000x1.jpg", "lyrics": "[Intro]\nCome with it now!\nCome with it now!\n\n[Verse 1]\nThe microphone explodes, shattering the molds\nEither drop the hits like de la O or get the fuck off the commode\nWith the sure shot, sure to make the bodies drop\nDrop and don't copy yo, don't call this a co-op\nTerror rains drenching, quenching the thirst\nOf the power dons - that five sided Fist-a-gon\nThe rotten sore on the face of Mother Earth gets bigger\nThe triggers cold empty your purse\n\n[Chorus]\nRally 'round the family with a pocket full of shells\nThey rally 'round the family with a pocket full of shells\nThey rally 'round the family with a pocket full of shells\nThey rally 'round the family with a pocket full of shells\n\n[Verse 2]\nWeapons, not food, not homes, not shoes\nNo need, just feed the war cannibal animal\nI walk the corner to the rubble, that used to be a library\nLine up to the mind cemetery now\nWhat we don't know keeps the contracts alive and moving\nThey don't gotta burn the books, they just remove 'em\nWhile arms warehouses fill as quick as the cells\nRally 'round the family, pocket full of shells\n\n[Chorus]\nRally 'round the family with a pocket full of shells\nThey rally 'round the family with a pocket full of shells\nThey rally 'round the family with a pocket full of shells\nThey rally 'round the family with a pocket full of shells\n\n[Verse 3]\nListen\nBirds chirpin', dogs barkin', kids missin', milk cartons\nSoul dark as black markets, war is startin', more is sparkin'\nHistoric prophets praise Muhammad\nDiff'rent Strokes, Philip Drummond\nGave me crack, like I'm plumbin', Jesus Christ, second comin'\nCut myself, now I'm numbin', never scared, never runnin'\nChosen one, I'm one hunnid, pray for me, pray for London\nGuilty me, he ain't done and gun me down, all for nothin'\nPrecedent in abundance, president is a puppet\nGotta hate it, gotta love it, pass a class, I rise above it\nWise enough, advise the public, pistol bust, screamin' \"fuck it\"\nDonald Trump, Donald Duck, what the fuck is the difference?\nNow we stuck, in a rut, this ain't what I envisioned\nWhat is what? What is guts when you don't have intuition?\nNot a saint, not a sin, tell me what's my real religion?\nGenocide, Genesis, they say it's a new beginning\nI'm a sinner, you a sinner, I can see the devil grinning\n\n[Chorus]\nRally 'round the family with a pocket full of shells\nThey rally 'round the family with a pocket full of shells\nThey rally 'round the family with a pocket full of shells\nThey rally 'round the family with a pocket full of shells\nBulls on parade!\n\n[Outro]\nCome with it now!\nBulls on parade!\nBulls on parade!\nBulls on parade!\nBulls on parade!\nBulls on parade!\nBulls on parade!\nBulls on parade!"}], "artist": "Denzel Curry"}