{"songs": [{"image": "https://images.genius.com/831094e429da4afe9c59be62b73b160e.750x750x1.jpg", "title": "Barbie Goin Bad", "album": null, "year": "2019-02-02", "lyrics": "[Intro]\nPatty, I see you too\nThis what y'all be wanting?\nThis what they waiting for?\nOkay, haha, rrrr\n\n[Verse]\nNeck tat say “Onika”\nI got more slaps than Aretha\nWhen you lose the Queen, niggas friendly, dawg\nIt was just back to back like Wembley, dawg\nNow you all the way back up in the Bentley, dawg\nI turn lemons into lemonade simply, dawg\nOld boy and my brother tried to end me, dawg\nI heard they looking for the old me\nA couple of you niggas still owe me\nYou asked for the G.O.A.T. so they sent me, sleaze\nTryna lay low, don't tempt me, sleaze\nThirty in the clip will be emptied, sleaze\nYou bitches still my sons, learn your As and Bs\nLeave the hate train in the station please\nI was in the court, no Jays and Beys\nMade her change her mind in the judge chamber, sleaze\nThe MAC's on the line, I ain't talking 'bout the PC\nI'm the biggest fish in the pan, I'll do you greasy\nAll he gotta do is call, I'm in my T-shirt and my drawers\nFace down, ass up, I'm already on all fours\nSuck his dick through his shorts\nThen I ride him like a whore\nI mean a horse, I'm a boss\nYeah, I got the juice and I'm takin' him on a tour\nImitating Nicki while your ghostwriter dissin' me\nLeave for two weeks, I got all of my babies missin' me\nNever gon' fall, never not gon' ball\nAnd I keep my nigga bustin' like a draco\nHe always come back, Big Draco\nStill going bad on you stank hoes\n\n[Outro]\nUh, haha mmm\nAhahaha, ahahaha!\nO-kaaaaaay\nThey wanted the old Nicki\nThey wanted the old Onika, so\nI had to, uh, get back in my bag\nI might drop a freestyle every, um, week 'til the thing-thing come\nThe label hit me said they want the fifth thing-thing, I got in the studio, I did the fifth thing-thing\nAnd then they say \"You know, it's time to drop your single\" I said \"Noooo\"\nYou know radio already tried to blackball a bitch\nIt's all good 'cause when you a legend, when you legendary\nYou shine no matter what\nThey get compared to me no matter what\nThey asked for the GOAT so I came through, bitch\nBut look, on some real shit, I'm 'bout to go on tour with, um, Juice WRLD\nIn Europe, shout-out to my fans in Europe\nUhm, I'm fucking three to four times a day, I'm feeling real good\nI'm rehearsing for the tour\nYou know I'm sayin', pussy feelin' real good right now\nPussy like bald, like really bald right now\nLike, because, I just be keepin' that shit so bald and so\nThat shit be so wet so, oh my, you know what?\nAyo, shout-out to my bad bitches, though\nAll my bad bitches know\nAll my bad bitches know what's good\nI got you though\nSouth side Jamaica Queens\nSouth side Jamaica Queens, nigga\nHeavy you on it, sleaze\nHahahahaha!\nBut you know what?\nWhenever I do something they say I'm the angry black woman\nI'm just playing around and having some fun\nZamn Zaddy, eoooow!"}], "artist": "Nicki Minaj"}