{"artist": "Amir Obè", "songs": [{"title": "Detroit Cartier", "album": "Detrooklyn", "year": "2014-07-06", "image": "https://images.genius.com/f3396764355400fc722c741f9c08445d.500x500x1.jpg", "lyrics": "[Intro: Sample from T-Baby – It's So Cold in The D]\nIt's so cold in the D!\nHow the fuck do we 'sposed to keep peace?\nIt's so cold in the D!\nHow the fuck do we 'sposed to keep peace?\nIn the D!\nIn the D!\nIn the D!\nIn the D!\n\n[Verse 1]\nI feel trouble brewin, I’m losing my manners\nPooh got the hammer, just came home from Atlanta\nUsed to diss his dreads and his accent\nWe passing through the east side robbing bitches for they glasses\nCartier when they goin' get paid, well damn how we gon' split the profit\nWe prolly get some bank for them\nSix-six-sixhundred that's good enough, do it up at Fairlane Mall\nTook some ghetto broads to the store\nCircle the movies for hours, after hours\nIt's still live, posted by a Benz like it's ours\nThomas had a Corolla, nicknamed it Rolly\nMy Rollie, nicknamed Corona, it's stolen\nCorona was 18 carat\nOh so, I thought til it turned copper, oh now I'm embarrassed\nFuck it though we at the club 18 and under\nFirst day of summer we leaving or what\n\n[Hook]\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\n\n[Verse 2]\nUh, five deep in Corolla, smoking weed, sipping soda\nPray mom don't smell the odor\nThem bum ass Nikes got boring, cop Guccis at Nordstroms\nMom asked me how you afford them\nUh, Early introduced me to Sean, he was on, signed to Kan\nI'm kinda jealous, shout out to Sean\nChopped it up in his Impala, gave me tickets to his concert, came home promoted my songs\nFuck it, let's go stir up some beef\nIn the burbs disturbing peace, blasting music burning trees Worthless pieces of shit, gripped a G in a week\nCopped Louis V\nSome matching belt came next weekend, hit Fairlane Mall the same evening\nC-C-Carties on\nNiggas drove by bumping Blades, ice was on\nRan up on me, caught me slipping it hit me dead in the jaw\nI'm sleepin\nWoke up, Carties missing, Louis missing, sidekick missing\nLost sight of vision, left eye was dripping\n\n[Hook]\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\nSwear to god, I'mma die rich, swear to god\n\n[Outro]\n'Nother day, 'nother dollar\n'Nother day, 'nother dollar\n'Nother day, 'nother dollar\n'Nother day, 'nother dollar"}]}