{"artist": "Willy Northpole", "songs": [{"year": null, "lyrics": "[Gun loaded]\n[Gun cocks]\n\n[Intro:]\nHeheheh!\nYeah, fuck this nigga man this niggas, gay! (hehehe!)\nThis nigga had a tongue ring!\nAny nigga woulda... that's all I need to hear's a nigga had a tongue ring, on top of that! (yeah!)\nOoh, yeah!\n'Member Sisqo had that sun on his stomach! (heheheheh!)\nThat sun shit on his navel!\nThat nigga got that shit on his chest...\nYou could see, you could still see that shit he tried to cover it up with the N.W.A shit!\nYoukno'msayin'? (hahahahaha!)\nPlus the nigga was a stripper!\nNever denied bein' a stripper! (hehehe!)\nOn top of that, his favorite player... uh... basketball player was Dennis Rodman! (hehehehe!)\nSo you know this nigga is a fuckin' weird-o, man!\nNow that he got the butterfly on his eye, nigga that shit startin' to come out man!\nMan, let's get this nigga! (hahahahah!) [beat starts]\n\n[Intro:]\nYeah, Willy! (GGG-GGG!)\nSouth Phoenix! (GGG-GGG- G-UNIT!)\nUh!\nSkip this nigga, man!\nHotRod, Carnegie whattup? (GGG-GGG!)\nLet's go!\nG-Unit! (GGG-GGG G-UNIT!)\n\n[Verse:]\nNigga it's the last supper. - And I'm sittin' in the middle, (uuuh!)\nThis is straight from the heart! - No gimmicks and no riddles!\nAfter dinner table. - Whattup Bank$? Whattup Buck? (whattup?)\nWhattup Fif'? Whattup Yay'? Shit's about to get rough. (hahahaha!)\nWhat? ! - I ain' supposed to beef cause I'm brand new? !\nNigga you a rod! - If a motherfucker hands you\nA couple of dollars can (uh!) put your daughter in college (yeah!)\nTo slaughter a couple of rap niggas to talk greasy\nGAYme, Joey and Jada that shit is too easy!\nGet to know Willy! - Y'all about to meet Willy\nA beast, I beg this nigga 50 to: \"Free Willy! \"\nFirst off this nigga, GAYme bang you little Red homie! (uh!)\nDead rappers tattoed on you, oh is them your dead homies? !\nNigga I know your past about that tat on your neck!\nYou got it big enough to cover that Crip set\nYeah, yeah! GAYme flipped! - GAYme used to be a Crip!\nCurtis Junior High was no Bloods, all Riffs!\nI got fam' in Carson, I got fam' in Compton! (uh!)\nYou pretty young thing! - Faggot-ass tongue ring!\nYou disloyal nigga; jus' let me know one thing!\nYou was quick to diss Ja, but when it came to Joe\nAnd Jadakiss! - That's when the GAYme became a ho!\nYou talked a lot of shit to Irv and lil' bro\nBut was scared of competition cause Ja had lil' flows\n50 put you under his wing when you had no tats!\nWhen you had no game! When you had no straps! (uh!)\nWhen you had no name, you called my nigga Ratchet! (what niggas? !)\nGAYme gay how the fuck you diss Jay? !\nAnd turn around and apologise the next day. (hahahaha!)\nI see the bitch in this nigga jus' like a X-Ray!\nYou better keep the Doctor if you wanna stay paid\nIt ain't a \"Squad\" of \"Terror\" - since the porn era!\nFat Joe, fat funky! - Big nasty, sweat junkie!\nJoe garbage, the nigga rap retarded!\nYou can't go platinum so why the fuck you got artists? !\n+Lean Back+, backward ass your whole fuckin' Squad WACK!\nNew king of the jungle, y'all a couple of Bobcats, ha!\nI'm too clever, can't beat me, it's G-Unit, can't cheat me!\nReady for war two-thousand lunges!\nTwo-thousand pull ups and two-thousand cruntches\nFor Jada' and his punchers, I'm here to straight free Yonkers\nWHY is the Lox fake they really ain't no shooters? !\nWHY it's only hit came from a G-Unit producer? !\nWHY this niggas talk tough - like they rough and gritty? !\nAnd turn around and get robbed and did a show with Diddy! (faggot-ass niggas!)\nYou niggas is titties! You niggas is pussy! - Pull out your dushes!\nBack in the day I wouldda hopped out the bushes (uuuh!)\nBut that was back in the day when I was runnin' with pushers! (uh!)\nWasn't the Lox niggas +Money, Power, Respect+? !\nPuff Daddy was a pimp, did y'all ever get a \"Cheque\"? !\nDid y'all ever get \"Respect\"? ! Did y'all ever get \"Power\"? !\nCause last time I checked every album went sour\nShit! - Fuck The Lox, Fat Joe and them other guyz!\nI wish my nigga would get a tat' of a butterfly. (youkno'msayin'?)\nBack to the GAYme, you in trouble you gay ho!\nYou used to be a stripper with N.W.A flows!\nGet it off your chest nigga! - Let Eazy rest nigga!\nWilly signed you would never have the West nigga!\nWild Wild West flow at it's best nigga\nI ain't from the Coast but I'm a West \"Ghost\"!\nA South Phoenix vet' and I'm far from a gang rookie! (yeah!)\nSouth Phoenix love me on Broadway, I'm Tookie! (yeah!)\nGive a fuck about your five shots - Cali-bon got popped!\nDo that give him street cred on the block? ! NO!\nYou had a scholarship, GAYme was on some college shit\nI heard that mixtape I laughed that's he talked!\nA Blood sayin': \"If I was a Crip, I C-Walk! \" (hahahaha!)\nWhat the fuck did he say; this nigga is gay!\nShots out to them Broadway gangsterz\n6-0-2 and a nigga that created this wanksta!\nFifty you tried! - You shoulda pulled this cat to the side\nStudied his past and noticed that this dude was fag!\n\"Change Of Heart\" that nigga got dissed by that lame broad!\nAnd said that: he watched the whole show with his gang squad!\nCome on man! - I had to expose his flat face\nMush face, tongue ring eat a bitch puss face!\nHollywood Blood, fake Hollywood thug!\n50 doin' movies with mad hollywood plug!\nSo tell all 'em G-Unot pick a sign slaves!\nThat's happy the world! - G-Unot PAID!\nAll that tough talk DVD is bluff\nNigga you in the same state, you can't even touch Yuk'!\n50 smart! - If he wanted to he can find you\nHe can touch you - and them broke niggas behind you, (hahahaha!)\nNigga! - I got a whole state behind me, that's power!\nUntouchable! - You couldn't wet Willy in the shower!\nCause when I hit the Game I started with 50 Cents\nI made Young Bucks! - Bank$, ever since, nigga!\n\n[Outro:]\nYeah!\nHahahahaha!\nFuck you nigga! Fuck all y'all niggas!\nOh now my nigga a rat, huh? !\nHe a snitch? !\nYou used to run with the nigga!\nThe nigga put money in your pocket, nigga there wouldn't be no GAYme!\nYoukno'msayin'?\nYou disloyal nigga!\nJus' admit you got scared!\nWhen it's, when it's time to beef with them nigga you-you cracked up under pressure!\nYou scared of them industry niggas!\nYou wasn't built for that G-Unit shit, it's competition in this game right now!\nFake-ass nigga!\nThen on the DVD... you went to the nigga house... the nigga, the nigga wasn't even at home!\nYoukno'msayin'?\nY'all niggas is like high school kids and shit, man\nThis nigga signin' deals for movies and y'all niggas in...\nIn the motherfuckin' woods... lookin' at the nigga crib, nigga!\nGay-ass niggas!\nYou and them broke niggas!\nNigga you should'a hopped the fence nigga; knocked on a nigga door...\nTrespassin' nigga!\nThat's a legal reason to pop your ass!\nTalkin' all that street shit nigga, you fake nigga! I see through that shit!\nYou could fool these muhfuckin' fans nigga but you can't fool a real, nigga!\nYoukno'msayin'?\nI know them Blood niggas out there!\nHey man I'm a tell you like this, nigga!\nIt's whatever when you see me!\nThis is G-Unit!\nIt's Willy... HotRod, Carnegie whattup niggas?\nAll my SouthSide niggas!\nMy Phoenix vet's!\nHey GAYme don't try to turn this into no... no LA/Phoenix shit, nigga!\nHandle your own beef, nigga!\nIt's Willy!", "image": "https://s3.amazonaws.com/rapgenius/willynorthpolevideo-50002855-20080701_131250-320x240.jpg", "album": null, "title": "Game Over"}]}