{"songs": [{"album": "E.B.A.H.", "image": "https://images.genius.com/ecaf59e8351d366bc86005cc66afe532.800x800x1.jpg", "year": "2012-09-13", "title": "Don’t Tweet This", "lyrics": "[Intro]\nHello ladies, here's the deal: Welcome to Tech N9ne's tour bus\nBefore you get on this bus there's a couple rules you need to follow:\nLeave all your cell phones with me\nThere will be no Tweeting, no Facebooking\nNo playing the PlayStation, no Instagram, no YouTubing\nWhatever happens on this bus, stays on this bus\n\n[Verse 1]\nWassup? It's me, Caribou Lou again\n(Tech N9ne!) Kansas City, fuckin' hooligan\nIf you think you cool and true Then doing the fool my friend\nYou'll begin boozing and choosing women that we do and do again\nOnly if they hold us, the secrets they crossing over\nThe beaches and often go, where we eating we rock and rollers\nDeep in the thoughts we go, but no Tweetin' she lost her mobile\nAnd geekin' because we showed her, freakin' across the globe\nIn the weekend we off in Boulder, Colorado\nAll my soldiers got a bottle\nAnd some hoes with a wobble from sticky dough's you hella bobble\nHead bitches they model and let's kick it Colorado's\nA red district full of brothels and med fixes\nYo, we gotta hide, just see, we get no privacy\nWhy, would she ride, with me, tweet, and straight lie to me?\nI don't know (What?) who, she sleeps with\nBut, all I know is: Don't you tweet this\n\n[Hook]\nDo what I told you, I told you, I told you\n(Don't tweet this!)\nDo what I told you, I told you, I told you\n(Don't tweet this!)\n\n[Verse 2]\nBaby I would hate to, kick it and then erase ya\nCause you wanna go to one of those social networks\nAnd go state the facts about my nature I gave to see you later\n(Oooooh) this bitch is shakin' the table\nPissed at me cause you wished it be\nListed with a Twit Pic sick at me\nWhen ya missed it you scripted me\nWhen I gotta move invisibly\nYou violate it, you fly away it\nSimple cause I am stealth\nThen formulate it, we tried to made it\nKeep it to your damn self\nGet our nudie on, quiet, we can truly bone\nAnd I'll be pushing all yo buttons like movie phone\nAct like you belong, creeping in my groovy home\nDrinkin Bou-Lou we go all my groupies owned\nWay of life, keep it neat trick\nIf you and the beast mix, you don't see shit\nAnd you will get the least bit of resistance\nWe pick who we see fit, but yo\n(Don't Tweet This)\n\n[Hook]\nDo what I told you, I told you, I told you\n(Don't tweet this!)\nDo what I told you, I told you, I told you\n(Don't tweet this!)\n\n[Verse 3]\nYeah, it is what it is, baby\nNo I don't want a lot of ears in my bizz lady\nCrazy Daily, thizz at my crib, save me\nDippin' get me to drop some jizz on your lid maybe\nWe in Canada partying like some animals\nEven my tour manager know that Tweetin' will vanish you\nTweet the day I go and say my party wasn't amateur\nGranted the lost camera was planted in tall canisters\nKeys, you will receive, right when you leave\nPlease, grab all your needs, ya cannot leave, not a thing\nPut away ya phone, Yahtzee!\nAnd don't be flickin' like the fuckin' paparazzi\nWe livin' covert, Flava Flav know!\nWe let you see what we want to, and when we say so\n(Monitor!) Her Tweetin' gossip is really out of her\nThat's why, I think I don't have that many followers!\n\n[Hook]\nDo what I told you, I told you, I told you\n(Don't tweet this!)\nDo what I told you, I told you, I told you\n(Don't tweet this!)\nDo what I told you, I told you, I told you\n(Don't tweet this!)\n\nWhat the fuck you mean am i mad\nIts 4 oclock in the fucking morning\nAnd you seating here talking to me about tweeter\nTweeter men, fuck that's some bull shit America\nBitch\n\n[Hook]\nDo what I told you, I told you, I told you\n(Don't tweet this!)\nDo what I told you, I told you, I told you\n(Don't tweet this!)\nDo what I told you, I told you, I told you\n(Don't tweet this!)"}], "artist": "Tech N9ne"}