{"artist": "Papoose", "songs": [{"album": "Mixtape Murder", "title": "Monopoly", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Intro: Papoose]\nTo everybody in the struggle\nIf somebody ever told you that you couldn't do somethin'\nAnd you still made it happen\nCongratulations\nSoul clap for all the independent women\nSoul clap for all my homies straight thuggin'\nClap for the real MCs buzzin'\nWe the leaders of the new school\n\n[Verse 1: Papoose]\nMomma's in tha kitchen cookin' that rice\nFather's outside shootin' them dice\nBrother's in jail, raisin' hell\nSister's on the corner sellin' fruit cocktail\nFamily alcoholics still sippin' his booze\nThat's why I'm rappin over rhythm n' blues\nTo all you rich black folks wit ya glistenin' jewels\nEntrepreneurs, all you millionare dudes\nBefore you catch another case, limit your moves\nJohnny Cochran got a brain tumor, I deliver the news\nWhat if mother nature aborted the sky\nWhen would we shoot our fireworks on the fourth of July?\nWe can't afford to live, so abortions rise\nCan't afford the truth, so we told to lie\nCan't afford a funeral, 'cause the costs is high\nGod damn, we can't even afford to die!\n\n[Chorus: Papoose]\nBut if you buyin' a house, I'll be your land lord\nI'll finance you a car, that's if you can't afford\nI'll own the jails, the banks, and all the property\nHere's a million, come on big shot, let's play Monopoly\n\n[Verse 2: Papoose]\n'Cause when the rappers start grindin'\nIt's a shame, a out-of-towner gotta sign them\nBut when his album drop and he go diamond\nEverybody beside him\nEvery real artist need a real label to sign them\nJust like every good man need a good woman behind them\nIt ain't about havin' the baddest chick on the streets\nI respect the dude Nas 'cause he married Kelis, but still\nIf you ain't ready, just wanna be my fiancé\nThan we could do it like Jay Z and Beyonce\nPardon my language, if you a real bitch\nThan we could do it like Jada and Will Smith\nCoincidence, where we come in to spin it at\nWe in tha same place that we first got rich at\nThey only gonna give us what they know they will get back\nSo when you get money, don't you ever forget that\n\n[Chorus: Papoose]\n\n[Verse 3: Papoose]\nHe got a DVD flow\nThey need to give me man, Smack, his own TV show\nThe voice of the jails, voice of the streets\nKay Slay's show should play seven days a week\nWe pull guns on each other, are we still peoples?\nIf you strapped and I'm not strapped, we still equal?\nThe say don't carry guns, 'cause guns real lethal\nBut guns don't kill people, people kill people\nMy cousin gotta do time, he say it ain't nuthin'\nTold me, I could do the time standin' on my head, cousin\nYo Paps, stay focused, you out hear bustin'\nBy the time I come home, you gonna be somethin'\nI wish I could do half his time for him\nWe go in there thuggin', he do a year, I do a year\nThey run and concur it, but still\nIt's all about havin' money and property, true\nThey'd rather see us doin' drugs and robberies, true\nWe gotta flip that into the economy, you\nSo my philosophy's the way of the world\nLet's play Monopoly!\n\n[Outro: Papoose]\nYou gotta monopolize and strategize\nSo we can get this money\nGet filthy rich\nThugacation\nStreet Sweapers\nC'mon man\nEast coast, pop a bottle wit y'all\nWest coast, pop a bottle wit y'all\nDown south, pop a bottle wit y'all\nCount your blessings, you ain't promised tomorrow", "year": "2005-07-01"}]}