{"songs": [{"image": "https://images.genius.com/9fb8160b2c6d56c5e7237de79281fbdc.807x807x1.jpg", "title": "Halftime (Live)", "album": "Illmatic: Live From The Kennedy Center", "year": "2018-04-20", "lyrics": "[Intro: Nas]\nNasty Nas in your area\nAbout to cause mass hysteria\n\n[Verse 1]\nBefore a blunt, I take out my fronts\nThen I start to front; matter of fact, I be on a manhunt\nYou couldn't catch me in the streets without a ton of reefer\nThat's like Malcolm X catching the Jungle Fever\nKing poetic; too much flavor, I'm major\nAtlanta ain't Brave-r, I'll pull a number, like a pager\n‘Cause I'm an ace when I face the bass\n40-side is the place that is giving me grace\nNow wait, another dose and you might be dead\nAnd I'm a Nike-head, I wear chains that excite the Feds\nAnd ain't a damn thing gonna change\nI'm a performer, strange\nSo the mic warmer was born to gain\nNas, why did you do it? You know\nYou got the mad-phat fluid when you rhyme; it's halftime\n\n[Chorus: Nas]\nHalftime\nHalftime\nHalftime\nYeah, yeah\n\n[Verse 2]\nIt's like that, you know it's like that\nI got it hemmed, now you never get the mic back\nWhen I attack, there ain't an army that could strike back\nSo I react never calmly on a hype track\nI set it off with my own rhyme\n‘Cause I'm as ill as a convict who kills for phone time\nI'm max like, I flex like sex\nIn your stereo sets, Nas'll catch wreck\nI used to hustle; now all I do is relax and strive\nWhen I was young I was a fan of the Jackson 5\nI drop jewels, wear jewels, hope to never run it\nWith more kicks than a baby in a mother's stomach\nNasty Nas has to rise, ‘cause I'm wise\nThis is exercise 'til the microphone dies\nBack in '83 I was an MC sparkin'\nBut I was too scared to grab the mics in the parks, and\nKick my little raps ‘cause I thought niggas wouldn't understand\nAnd now in every jam I'm the fuckin' man\nI rap in front of more niggas than in the slave ships\nI used to watch \"CHiPs\", now I load Glock clips\nI got to have it, I miss Mr. Magic\nRest in peace Mr. Magic, tragic\nI'm an intellectual\nAnd that's no question, yo\nThese are the lyrics of the man\nYou can't near it, understand?\n‘Cause in the streets I'm well-known, like the number man\nAm I in place with the bass and all that?\nExplore rap and tell me, \"Nas ain't all that.\"\nAnd next time I rhyme, I be foul\nWhenever I freestyle I see trial, niggas say I'm wild\nI hate a rhyme-biter's rhyme\nStay tuned, I assume; the real rap comes at halftime\n\n[Chorus: Nas]\nCheck check, it's halftime\nLooking at my Rollie, it's that time, oh\nYeah, that's [?] over there\nBut some of y'all know\n\n[Verse 3]\nI got it going on, even flip a morning song\nEvery afternoon, I kick half the tune\nAnd in the darkness, I'm heartless, like when the NARC's hit\nWord to Marcus Garvey; I hardly sparked it\n‘Cause when I blast the herb, that's my word\nI be slayin' them fast, doing this that and the third\nBut chill, pass the Andre, and let's slay\nI bag bitches up at, and hit a matinee\nPutting hits on 5-0\n‘Cause when it's my time to go, I wait for God with the .44\nAnd biters can't come near\nAnd yo, go to hell to the foul cop who shot Garcia\nI won't plant seeds\nDon't need an extra mouth I can't feed\nThat's extra Phillie change, more cash for damp weed\nThis goes out to Manhattan, the island of Staten\nBrooklyn and Queens is living fat, and\nThe Boogie Down, enough props, enough clout\nIll Will, rest in peace! We was out\n\n[Chorus: Nas]\nHalftime\nWhole up, looking at my Rollie, it's that time, oh\nHalf—half—it's halftime\nYeah, check, hey yo, it's halftime\nNot even half of this show though\nNot even half, yeah\nHalftime, yeah\nHalftime, yeah\nHalftime\n\n[Spoken: Nas]\nY'all alright over here? Over here?"}], "artist": "Nas"}