{"artist": "Z-Ro", "songs": [{"album": "Drankin’ & Drivin’", "title": "Hate Me So Much", "lyrics": "[Verse 1]\nY'all can keep on talking, dropping salt on my name\nWhile my haters keep walking, I pass by in that thang\nA cool hundred thousand dollars on me\nSpend it all on me just because I ain't got no homies\n17 years day for day and 8 on parole\nToday we celebrating freedom, this one for you big bro\nThink i got bout 3 or 4 ounces on me\nWe gon smoke until i ain't got no more ounces on me\nI think they mad at us cause we ain't trying to turn up\nSo if it ain't screwed up it really dont concern us\nEverybody moving slow we all double cupped up\nThey say the south fell off, they got us double fucked up\n\n[Chorus]\nWhy they hate me so much?\nI don't know\nThats why I keep my gun off safety so much\nAnd if it can't go with me then I don't go\nWhy they hate me so much\nCause I dont fuck with nobody\nI stay in my own lane\nI dont give a fuck what y'all be doing\nThat's y'all motherfucking business\nI'm interested in doing my own thang\n\n[Verse 2]\nOut of all my old homies I used to fuck with\nRick D and Grady only ones I still fuck with\nCause it ain't matter if I had a million bucks or straight up buckless\nReal niggas do real thangs\nIf it ain't real we could give a fuck less\nAnother hundred thousand on another car\n50 thousand down on another home\nAnd the IRS wanna know who paid for it\nTell them I wrote another song\nJust me myself and I quite frankly you can leave us the fuck alone\nYeah bitch you a bad bitch but they taking my picture I'm who they touching on\nNiggas hate me cause instead of them I'm who they woman been sucking on\nAnd wherever her baby daddy name tatted, thats what im busting on\nWhen I'm out in public, my attitude is fuck it\nI'm in the Bentley but I'm driving it like it's a bucket\n\n\n[Chorus]\nWhy they hate me so much?\nI don't know\nThats why I keep my gun off safety so much\nAnd if it can't go with me then i don't go\nWhy they hate me so much\nCause I dont fuck with nobody\nI stay in my own lane\nI dont give a fuck what yall be doing\nThats yall motherfucking business\nI'm interested in doing my own thang\n\n[Verse 3]\nQuestion: Is it because I'm successful?\nManaging all this money man I swear it's so stressful\nThought I had a brother and a cousin I'm so forgetful\nIt was me the whole time by my damn self, I had wings, no Redbull\nI'm just saying, I was trapping hard as I could trap\nNiggas hated my shit I still was rapping hard as I could rap\nNiggas say they love you but rob you what part of the heart is that?\nI dont love no nigga I dont love no bitch I'm blackhearted and that's a fact\nThey mad at me cause i got 200 on the dash\nAnd this ain't the '90s no more I dont need you to pitch in on the gas\nNiggas screaming hate at me but my money is so much louder though\nI wish DJ Screw was alive cause he'd be proud of 'Ro and the way they hate me\n\n[Chorus]\nWhy they hate me so much?\nI don't know\nThats why I keep my gun off safety so much\nAnd if it can't go with me then I don't go\nWhy they hate me so much\nCause I dont fuck with nobody\nI stay in my own lane\nI dont give a fuck what y'all be doing\nThats y'all motherfucking business\nI'm interested in doing my own thang", "year": "2016-07-15", "image": "https://images.genius.com/1a8e0868c4ad71669aa961ecfdc9043b.800x800x1.jpg"}]}