{"songs": [{"album": "Everything You’re Not", "image": "https://images.genius.com/3f1869f3648594a9202577342ffe8b27.224x224x1.jpg", "year": null, "title": "Is It Time", "lyrics": "[Intro]\nSomething about...\nSomething about you...\nThere's something about you...\nAnd I keep thinking, I keep thinking\nYo\n\n\n[Verse 1]\nIt was his high school crush, he only lived up the street\nAnd he would see her when they passed in the hall\n(When they passed in the hall)\nWanted to take her on a date, maybe even to prom\nBut when he saw her he never asked her at all\n(He never asked her at all)\nAnd when he saw her he was shy, couldn't work up the nerve\nHe blended in with the crowd, so his purpose was served\nHe never saw a girl in life that was as perfect as her\nWishing moments were like the movies, but they certainly weren't\nBut one day\nThey bumped into each other, it was fate\nHis heart began racing, hands started to shake\nCause there was something on his mind that he wanted to say\nWanted to tell her how he felt and thought she ought to relate\nShe looked up and said that \"I know you, you're that kid from that one class\"\nHe tried to say something, but he just felt like a dumbass\nNow he's starring at the ground, and he took him a breath\nBut then he heard the bell ring and he looked up and said:\n\n[Hook]\nIs it time to go? Is it time to go?\nYou can't fight the way you feel\nCause all my life I thought it's real\nBut I keep thinking, I keep thinking\nIs it time to go? Is it time to go?\nI waited all night for a chance to say\nAnd there ain't a damn thing to stand in my way\nBut I keep thinking, I keep thinking\nIs it time to go?\n\n[Verse 2]\nA few years down the road, he could feel it with time\nCause no matter how hard he tried, she was still on his mind\nSame moment in the hole, he can't control it at all\nStill regretting not fighting for that moment he lost\nBut he started a new life, got a job and house\nAnd every now and then he dates, but never tries to go out\nCause there's a remnant of her still lingering there\nAnd as he walks into his job, he thinks he's seeing her there\nNo wait\nIt is her, man, you gotta be kidding\nThe same girl he thinks about is right across from him sitting\nBut he's a man now, he ain't gonna give up this\nNo way he can now, this time he gets up quick\nSo he walks across the room and introduces himself\nAnd she remembers who he is but he feels stupid as hell\nAnd you can tell she's interested, but she wouldn't confess\nSo he glances at his watch and he looks up and says:\n\n[Hook]\nIs it time to go? Is it time to go?\nYou can't fight the way you feel\nCause all my life I thought it's real\nBut I keep thinking, I keep thinking\nIs it time to go? Is it time to go?\nI waited all night for a chance to say\nAnd there ain't a damn thing to stand in my way\nBut I keep thinking, I keep thinking\nIs it time to go?\n\n[Verse 3]\nYou can hear wedding bells, people laughing\nHoly matrimony\nShe found another man, it's all over for him\nNow he thinking in his head, what he wouldn't give\nWhat he might've said, no, what he could've did\nHe gets into his car then turns over the ignition\nHe's driving down a road, but nowhere is where it gets him\nHe pulls up to a temple, parks his car in the front\nHe has no idea what he's doing, but a part of him does\nBut then he walks into a church, hands starting to sweat\nAnd everyone up in that room could hear his heart in his chest\nMinutes are ticking, preacher says, \"Dearly beloved-\"\nThen he yells out, \"Please don't finish the sentence!\nI got something I wanna say, and it needs to be said!\"\nShe walked up to him, took a step to his chest\n(She took a step to his chest)\nAnd he was at a loss for words, trying to catch him a breath\nShe grabbed his hand, kissed his lips, looked at him and said:\n\n[Hook] x2\nIs it time to go? Is it time to go?\nYou can't fight the way you feel\nCause all my life I thought it's real\nBut I keep thinking, I keep thinking\nIs it time to go? Is it time to go?\nI waited all night for a chance to say\nAnd there ain't a damn thing to stand in my way\nBut I keep thinking, I keep thinking\nIs it time to go?"}], "artist": "Hard Target"}