{"artist": "Pink Guy", "songs": [{"album": "Pink Season", "title": "Pink Life", "image": "https://images.genius.com/176ec7cd55a78c0fcb8c2560fa88283c.1000x1000x1.jpg", "lyrics": "[Produced by Holder]\n\n[Intro]\nUh, what?\nWhat? What? What?\nI'm a large pink cunt\nKnow what I'm sayin'?\nYeah, yeah, yeah\n\n[Verse 1]\nThey wanna see a man do the god shit\nNarcotics if you wanna get nauseous (Uh-Huh)\nPink Guy dancin' like a clown\nKeep laughin' lil cunt, I got money on the down low\nY'all think this about my feelings?\nThey still think this about my feelings?\nLike Big Bird or a Steve from the Blues Clues\nWhen the sun go down she go down too (Yuh)\nRidin' around with a bump and a pound too\nIf you wanna leave a voice mail hit the pound two\nI got money out the orifice\nI buy your girl Louis bag, shit's glorious (Oh)\nI'm not a hero or a role model\nI'ma spray your moms and your girl, no nozzle\nDrinkin' red wine out of Gatorade bottles\nIf you can't keep up then pull off to the bottom kid (Uh)\nThey say I'm an elitist\nLike I'm better than the bunch, uh duh nice hunch cunts\nWhen the sun go down I'm a fiend\nWhen the sun go down I'm a monster\nWhen the sun go down I'm sippin' lean\nWhen the sun go down I hope it never come up (yup)\nYoung boy with the trash talk\nRun your little mouth, find it sittin' on the asphalt\nI know you tryna be me, I don't have a doubt\nI can't answer at the moment, I got pussy in my mouth\nMy mouth, pussy in my face\nDepending on the nationality I get a different taste (Yuh)\nY'all really think I'm out here having hard times\nI got 17 jobs, this one's part time (Seven-Eleven)\nSuck a dick and a ball sack\nPoppin' more pills than the moms in the cul-de-sac\nFuck her good on the couch while your dad's gone\nPoke holes in her face, jack'o lantern\nShe like how the leather feels\nShe really like that I rejected several record deals\nShe said \"why?\"\nI said \"the money wasn't good enough\"\nShe said \"ooh wow, you really know your stuff\"\nYeah I do bitch\nI don't need a fucking marketing team tryna blow my shit\nI'm not a fuckin' vlog cunt with a lot of chicks\nTryna buy an autobiography about my dick\nWhoops, fuck that\nI work hard for my shit, y'all boys are just fuckin' whack\nI'm the only one who cares about the process\nI'm the only one who fuckin' with the progress\nI'm the only one who made it with no middle man\n(I don't care about this song anymore)\n\n[PreOutro]\nHow ya like that? How, how ya like that?\nI got money on my back, I don't need your fuckin' cash\nHow ya like that? How, how ya like that?\nI got money on my back, I don't need your fuckin' cash\nIt's yo favorite pink cunt!\nHow ya like that? How, how ya like that?\nI got money on my back, I don't need your fuckin' cash\nHow ya like that? How, how ya like that?\nI got money on my back, I don't need your fuckin' cash\n\n[Outro]\nYo, yo shout out shout out to Steve from Blue's Clues go go find those clues man. Heh go find those clues man\nPink Season Coming soon", "year": "2016-08-15"}]}