{"artist": "Wrekonize", "songs": [{"lyrics": "[Hook]\nIf the phone don't ring and the line goes cold\nI really need you to know, you got to let it go!\nJust let it go! (Oh)\nThey can lock me up 'til my faith grows old\nBut they'll never take away my soul\nUnless I let it go, I won't let it go! (Oh)\n\n[Verse 1]\nI worked in this city for years\nThought that I had persevered\nSnapped once and they labeled me a murderer\nI should have woke you up this morning\nJust to tell you that I love you\nBut I didn't really feel like disturbing ya'\nI saw the city go from golden to Gotham\nWholesome to rotten, rock bottom, south beach to Serbia\nNow they'll convict me with murder, ha?\nCarry up my so-called peers\nI can't believe the fucking nerve of ya'\nI've seen the gas price go ozone\nFast life in slow loans\nWe are burning down my lavish old folks home\nNow I'm choking on the bone that they've thrown\nCause I can't chew the fat full of hormones and war songs\nI should've let loose from time to time\nDeep breath and low tones\nTo beat the stress and bed it in my souls' home\nInstead I cracked up in cold sound\nJail bars with no dope\nPraying to a god I'm sure I don't know\n\n[Hook]\n\n[Verse 2]\nBeen on the road for seven whole months\nHaven't been back home once\nBut I came really close to doing it\nHalf a year when I've been running\nHiding out from cops, do nothing\nIt's like living your life as a fugitive\nKept to myself human contact, my new\nEver since the day that I knew I had to fly coop\nI stuck to the plan like a million dollar man\nWith a million dollar scam\nIn my cold infringed hands, so\nWhittle away, whittle away, whittle away now\nMiles away from the sick and twisted playground\nI broke free and ran at speed to can break down\nThe Jake through 88 towns\nAlways a second lay clowns\nI think about that time passed and realize that I was gassed\nBut couldn't see it until my life was being layed down\nThe sunsets are lookin' strange\nHow am I still getting changed\nEven when it's more attention that I pay now\n\n[Hook]\n\n[Verse 3]\nBeen on the run about a year\nAnd I think I truly fear\nThat somebody's always out to try and round me up\nAcross the block from a station full of cops\nAnd somehow I know, my apology ain't gon' count for much\nI ran the motherfuckers round\nTwenty states in every town\nAnd I'mma bet they can't wait to beat me down in cuffs\nI'm calling you, so no matter what they do\nYou'll know I turned myself in\nWillingly to serve a thousand months\nI know I murdered a man\nAnd in the after-life I'll burn in eternal revenge\nThere ain't a thing them pigs can do to make me feel worse than you\nWhat I'm saying is, I know violated all you knew and\nIf only I could go back, call myself to know that\nLife can be a cold cap\nBut nothing worth murdering a man, not even nearly\nNow I say goodbye for ever, tell my son I love him dearly and\n\nIf the phone don't ring and the line goes cold", "title": "Fugitive (Witness Protection Mix)", "year": null, "album": "A Soiree For Skeptics", "image": "https://images.genius.com/d23b689edc521146ac84672312449010.700x700x1.jpg"}]}