{"artist": "360", "songs": [{"album": "Please Be Seated", "year": "2010-04-21", "title": "The Ghost Inside", "image": "https://images.genius.com/fcbf34bbaeea7510da3d3de60a3d77a6.720x720x1.jpg", "lyrics": "[Intro: 360]\nUh, yeah, Forthwrite\n60\nP Easy, Please Be seated\nYeah\n\n[Verse 1: 360]\nI feel that something inside\nRight when you feel there was nothing inside\nI know now that it's somethin' this time\nNow I feel ready, I got nothing to hide\nYo, it's funny things come when you least expect it\nRight when you're just about to reach the exit\nAnd now you're hoping that these people get this\nAnd those who admire will at least respect it\nSee, a lotta wanna watch you fall\nWhy the hell they wanna stop you for? You don't have to though\nThey wanna see you drop the ball\nNow they got you thinkin' \"What's it for?\" It doesn't matter though\nI write while inside I bleed\nGot a hang on every word that your timeline reads\n'Cause I'm cool with the life I lead\nIf you wanna follow suit, yo, it's fine by me\n\n[Chorus: Styalz Fuego]\nFeel like a star [?]\nI feel like a star tonight\nWithout warning\nWe gave up the ghost inside\n\n[Verse 2: PEZ]\nYeah, yeah [?]\nI was focused on my destination\nWhile thinking \"I can get there!\" with an exclamation\n[?] all my first attempts to make it\nWere just clouded by hesitation\nHad to sit down thinkin', find my style\nCouldn't fix that quick, had to bide my time, this time I\nWon't let that bit of me talk negative\nTo ensure I never repeat that lesson\nNow I won't wait, no way, gotta make my own way\nSometime soon or it's done, I'm through with it\nShit, I'm too close to the finish\nTo burn out, turn 'round and pack up, are you kidding?\nI won't let that happen, no chance, won't even\nThink of backtrackin', nah, there's just no time\nAnd I prove it, I can free the ghost in me\nI think it's time I start living where I'm sposed to be\nThank god\n\n[Chorus: Styalz Fuego]\nFeel like a star [?]\nI feel like a star tonight\nWithout warning\nWe gave up the ghost inside\n\n[Chorus (Extended): Styalz Fuego & James Mercer]\nWas it all for show?\nFeel like a star [?]\nI feel like a star tonight\nWithout warning\nWe gave up the ghost inside\nFeel like a star [?]\nI feel like a star tonight\nWithout warning\nWe gave up the ghost inside"}]}