{"songs": [{"year": "2014-10-14", "image": "https://images.rapgenius.com/dc6782d9ef39e0d12ab38a6b17ebcc0e.500x500x1.jpg", "title": "Cadillactica", "album": "Cadillactica", "lyrics": "[Produced by DJ Dahi & DJ Khalil]\n\n[Intro]\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nUh\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nUh\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nUh\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\n\n[Verse 1]\nUh, what you think a real nigga rap for?\nSo I can roll around in a RAV4? Never that\nCadillac pimped out, fish bowl, true vogues\nFifteens, but I had to go and get two mo'\nWhassup, get buck, shake junt killa\nDJ booth with the pole in the middle\nFor the edge of the rest to go flash up a bitch\nSee how far these vegetables get us\nPour up, the show up, the focus\nThe doors ain't typical when they get open, hol' up\nYou ain't never been sky high\nSwear I coulda died when I hopped out my ride\nLike four or five times, no parachute\nBungee jump for the loot\nHock a loogie out the roof, what I feel like\nPorn on the screen, two hoes on the scene tongue kissin'\nYou would think my whip dyke\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—too early for the hook\nNot sure if it's the sawed-off pump or the bass in the trunk that keep a nigga shook\nCareful no crook, tell a bitch, “Look.”\nHow I work the wheel and the crisis\nPolice behind us my index was grindin' her pussy like rhyme with no timin'\nI think I'm nicest of all (All, all, all, all)\nThat's the way I feel, bitch! Crawl (Crawl, crawl, crawl, crawl)\nWhy you showing your grill, bitch? We off (Off, off, off, off)\nOur way outta here, don't get lost\nI come in peace from somewhere unique\nHave no fear, uh\n\n[Hook]\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nFuck yo' whip, nigga!\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nI took yo' bitch, nigga!\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nFuck yo' whip, nigga!\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nI took yo' bitch, nigga!\n\n[Verse 2]\nUh, what you think a real nigga rap for?\nSo I can roll around with a nympho? Yessir\nTwenty five lighters on my dresser, the best of\nVersace, Versace, Versace, my bezel\nThe bass and the treble will beat, ho\nKomodo with the four-door when creepin', slow\nI pull up on the high side, God give me high five\nEvery time I holla, \" I thank you, Lawd\"\nJesus please, don't let the jackers try to take what's mine\nHate to have to black out, reach in the dash to the Lac, ‘fo the Act Right\nCause a nigga act like I'ma just back down\nAnd I'ma put some vogues on these toes bitch\nI blew the back out the trunk with the fifth wheel slump\nIt's some neon that's red, that's my old shit\nBut this some cold shit\nThat my granddaddy wish he could have drove in, then passed down\nSo in honor of Zebby, I bring a ho down like a levee\nWhen I slab 'round in this glass house\nSee me in it, it was easy pimpin', 'fore you even finish trick or treating trippin', she wasn't even with it, she was outside the Lac tryna ease in it\nShe might fall (fall, fall, fall, fall)\nIt ain't really that high, bitch crawl (crawl, crawl, crawl, crawl)\nWhy you showing your grill, bitch? We off (off, off, off, off, off)\nOur way outta here, don't get lost\nI come in peace from somewhere unique\nHave no fear, uh!\n\n[Hook]\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nFuck yo' whip, nigga!\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nI took yo' bitch, nigga!\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nFuck yo' whip, nigga!\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac\nCadillac-lac-lac-lac, Cadillac-lac-lac-lac—lac\nI took yo' bitch, nigga!\n\n[Outro]\nSlabbin’ ‘round, my windows down, you hear the sound\nThat sonic boom, that ba-ba-ba-ba-ba-ba-bass\nThat shake your baby momma crib\nPardon me if I phone home 4000 miles away from where you at\nIf you ain't holdin' back I can take your whip\nC-A-D-I-Double-L-A-C-T-I-C-A\nC-A-D-I-Double-L-A-C-T-I-C-A\nC-A-D-I-Double-L-A-C-T-I-C-A\nC-A-D-I-Double-L-A-C-T-I-C-A, K-R-I-T forever\n\n[Skit: Big K.R.I.T. & crew + employee]\nHold up, nigga\nNigga, hit that new spot real quick called Mo' Grease than Beef nigga, see what they hittin' on round this bitch\nI heard they got some fried biscuits too, though\nYeah, they be giving them hoes away though, I don’t want no given-away biscuit\n\nYeah, man, what happenin', welcome to Mo Grease than Beef, what can I get for you, man?\n\nI want a #1, my nigga, but, uh… I don’t see what it is on the menu man, run that shit down for a player real quick\n\nOh, you want the #1? Shit, well, the #1 come with two sides—shit, you can get some poverty or some famine. And bruh, if you don’t want that famine, nahmsayin, you can always get some low self esteem—or a biscuit\n\nMmm, nah, I’m good on that, my nigg’, I’m good though…\n\nSay, bruh, I know you wanna take some food home to your baby mamma. You can go and get her the Plan B meal—it come with a free DNA test, two bitchass niggas. Shit, or you can get a biscuit. Best part of all this, it’s already prepared for you, bruh. This shit been sittin’ here all day. Waitin’ on you\n\nHell nah!"}], "artist": "Big K.R.I.T."}