{"artist": "R.A. The Rugged Man", "songs": [{"album": "Legends Never Die", "year": "2013-04-30", "lyrics": "[Intro]\nGet it Rugged Man\nGet it, he stay fresh\nR.A\nGet it, with the style and finesse\n\n[Verse 1]\nYo, I got a big head and a fat ego, I got the starving\nAnd hungry poverty superiority flow\nMy pistol is old school class, I'm peeling your ass fast\nYo, I'm uncontrollably gifted, I totally ripped it\nI'm vocally vicious, naming the best ever - I'm supposed to be listed\nEven if I'm emotionally and overly twisted and socially timid\nAnd every chick had left with a broken ovary when I hit it\nThe fans follow me like disciples, I'm Charlton Heston\nNot the Moses version, I'm the gun toting version with the rifles\nDon't let them crabs gash you when I'm jacking a rapper and ripping the jacket\nDetaching your ass and using a machete to smash you\nI'll rob anyone, anywhere, under the jacket, get the flame up\nPull the gun out at your wedding while your grandma do the Macarena\nAll these feminine rappers wanna see me dead and buried\nToo many rappers is drag-queened out; Tyler Perry\nSick of the similar imitating, I did it already, the pitiful paid them\nThe bigger the better to bait them, you biting what I spitted, already, verbatim\nI don't need to breathe when I rap, I got gills, fuck lungs\nI'm like a superhero out of the toilet of the slums\nCome on\n\n[Chorus]\n[?]\nEvery verse like a firearm blasting ya\nI'm number one, number one, number one\nVerse like a smoking gun\n[?]\nI'm the greatest\nI'm the greatest!\nYou ain't shit\nCompared to me\n\n[Verse 2]\nShacking up for the night at the crib with a B-movie actress\nShotgun next to the bed and the wad of cash under the mattress\nAs a kid I wasn't into theatrics, after school\nMy daddy used to teach me combatative Green Beret tactics\nMy flow natural, you artificial, beefed up Barry Bonds at BALCO\nDope or dog food? I spit heroin, your rhymes are alpo\nI ain't into the tight jeans\nI'm into bar brawls, brass knuckles, and bloody fight scenes\nThe mainstream pussies ever give me props? No, nada\nThat's like the Fox News giving props to Obama\nWait! I teach the children in the world the word hate\nI eat pussy till every dyke on the Earth turn straight\nI'm disturbing with the grammar. I'm more disturbing than\nThe bombing of the Baptist church in Birmingham, Alabama\nI've been repping, I'll put a hit on any paper that my pen blessing\nI'm nice with the hands, each fist is a registered weapon\nI'll leave you forever resting, I don't care if you're beefed up steroids\nOr what you bench pressing, I'm at the Best Western, tossing your girl salad\nWith some French dressing, hit you with a bat or a hatchet\nOr the back of a ratchet, my flow, ain't a rapper that match it\nToo much lyricism to digest, I do it on purpose\nTwo of my bars is more lyrical than two of your verses, come on\n\n[Chorus]\n[?]\nEvery verse like a firearm blasting ya\nI'm number one, number one, number one\nVerse like a smoking gun\n[?]\nI'm the greatest!\nYou ain't shit\nCompared to me\n\nGet it, Rugged Man\nGet it, he stay fresh\nR.A\n\n[Outro]\nI tour the world\nYou're at home with your momma\nI get ass\nEvery night you get no ass\nSuck my balls\nAnd choke on my dick you bitch\nYou ain't shit\nCompared to me", "title": "Tom Thum", "image": "https://images.genius.com/c839ae29cd32413eb20a1c6585d7d604.1000x1000x1.jpg"}]}