{"artist": "Peewee Longway", "songs": [{"album": "Money, Pounds, Ammunition 3", "title": "Jam on ’Em", "image": "https://images.genius.com/87e544035bc49bdf61b79058ca2bd165.500x500x1.jpg", "lyrics": "[Verse 1]\nBitch I don't wanna fuck around with you anyway\nI got my own money, I don't need your help thumbin'\nThink she struck the load, bitch gon' of the dope dick\nGo ahead on with that hoe shit\nBitch don't suck dick, I don't wanna fuck with\nHit it, she a quickie, I'm on to some more shit\nBitch talking money for the pussy is bullshit\nFuck it, Bloody Jay hit the bitch with the dope dick\n\n[Hook: PeeWee Longway]\nJam on 'em\nI just jam on 'em\nI just jam on 'em\nI just jam on 'em\nI just jam on 'em\nYou knew what you came here for\nYou ain't wanna fuck, what you spend the night for?\nBring a friend cause I kinda like her\nMichael Jackson beat her cause I hit her with a glove\nNo GP, I don't GP\n\n[Verse 2]\nGot a million dollar dick and a list for you to sign\nIt's offend on take, that's a fine\nJumping out the dresser like Shawn Michaels\nShe want me to do it one more time for the Vine\nWhole dick in her, put it all in her spine\nSaid 10 got me thinking that that skinky bitch fine\nNow she drank a lil, pop it up, and keep calling my line\nShe bitches out the trenches popping, I put her in line\nI just jam on 'em, I don't fuck around, she ain't mine\nAin't no cuffing but the Ferragamo buckle match my mink skin Margielas\nLongway and Bloody Jay, we kick it like the Goodfellas\nJam on 'em, what a duck, yeah, we plucking his feathers\nSave my bitch to make ya nut, kid, don't I get the chowder\nA lawyer always told me cheddar was better\nShe put the leave a bitch and fuck whoever\n\n[Verse 3]\nConnected with hip is my papi, like pepper\nBitch I don't need you to chow through the cheddar\nFly with the fish, get the tuna together\nLongway, Fonzarelli, cooling leather\nThese bitches ain't shit, get my bitch from Belgium\nGriselda Blanco, serving tacos\nLongway fuck all these bitches with it, Vado\nPaint that bitch face on her way, Picasso\nJam on 'em, touch down with a truck load, Longway bitch\n\n[Hook: PeeWee Longway]\nJam on 'em, you knew what you came here for\nI just jam on 'em, you ain't wanna fuck, what you spend the night for?\nI just jam on 'em, bring a friend cause I kinda like her\nMichael Jackson beat her cause I hit her with a glove\nNo GP, I don't GP\nI just jam on 'em, slam on 'em\nDamn I want her, bamb on her\nI just jam on 'em\nI just jam on 'em\nI just jam on 'em\n\n[Verse 5]\nNiggas pissed off like Kirk, she P\nHit her, pain, ball head bullets\nI told you I like that pussy bald when I run into it\nBrown, no St. Louis, trapping, that's just one note from St. Louis\nShe a lunatic, begging me to take my mask off\nLike the nigga from The Lunatics, what is it with this bitch?\nSaid she can't slow down, drop a Actavis\nPut my whole arm in it like Vix, trapping up and down\n\n[Hook: PeeWee Longway]\nJam on 'em\nI just jam on 'em\nI just jam on 'em\nI just jam on 'em\nI just jam on 'em\nYou knew what you came here for\nYou ain't wanna fuck, what you spend the night for?\nBring a friend cause I kinda like her\nMichael Jackson beat her cause I hit her with a glove\nNo GP, I don't GP\n\n[Verse 6: Slim Jimmy]\nPocket full of gold packs, I'm popping gold bottles\nOnly bussing these strippers and models like my forefathers\nFreaky Cididi, bitches chew me up until they jaw broke\nI just slam on 'em, turn around, Space Jam on 'em\nSlim Jimmy, pimp Jimmy\nJam on 'em, and I took the motherfucking rim with me\nYellow wrist make a bitch do a 360\nTook her mama to the crib, made her walk different\nTook her mama to the crib, made her talk different\nI'm not cuffing, I'm not kissing\nI'm not tricking, it's not tricking\nWe not talking, it's just business\n\n[Hook: PeeWee Longway]\nJam on 'em\nI just jam on 'em\nI just jam on 'em\nI just jam on 'em\nI just jam on 'em\nYou knew what you came here for\nYou ain't wanna fuck, what you spend the night for?\nBring a friend cause I kinda like her\nMichael Jackson beat her cause I hit her with a glove\nNo GP, I don't GP\n\n[Verse 7: Swae Lee]\nYou don't have to play anymore\nYou knew what it was when you came through the door\nI jam, did you come back from war?\nYou never be the same once your panties hit the floor\nYeah, you can bet I'm a son of a gun\nEvery day I gets paid to get laid\nCouple hotels uptown in my name\nPray she wanna do something strange\nGet it work, then I go, finna go with a bang\nHoes playing hard to get but my game too original\nGot you fucking with a friend, now the girl looking pitiful\n\n[Hook: PeeWee Longway]\nJam on 'em\nI just jam on 'em\nI just jam on 'em\nI just jam on 'em\nI just jam on 'em\nYou knew what you came here for\nYou ain't wanna fuck, what you spend the night for?\nBring a friend cause I kinda like her\nMichael Jackson beat her cause I hit her with a glove\nNo GP, I don't GP", "year": "2016-06-11"}]}