{"songs": [{"image": "https://images.genius.com/d139ded1190d7e3c5cdc6dda61c6767f.600x600x1.jpg", "title": "King’s Highway", "album": "Da Derrty Versions - The Reinvention", "year": "2003-11-25", "lyrics": "Ugh Yeah You should really turn this up\nNatural Bridge and Kingshighway\nAs loud as possible (that's what I'm talkin about, gon shine my shit up)\nNatural Bridge and Kingshighway (yeah)\nAsk em' Where you headed?\nNatural Bridge and Kingshighway (yeah)\nNatural Bridge and Kingshighway (St. Louis shake it)\n\n[Verse 1]\nCome on with it\nIt's me and my derrty we just got back home\nIn the blue grey Bentley with the cellular phone\nCallin' up the 'Tics (you know) it's time to get it jumpin'\nSmoke comin' out the sunroof to let you know we're comin'\nEverybody looking if you're jealous turn around\n21 inches keep me further from the ground\nI'm gettin good grip from the Dunlop Tires\nThe F1's bumpin' but I need the volume higher\nCause the 808 kick drum Basement Beats hits son\nJay-E and Wally got it knocking (you wanna) dirty get some\nI heard them haters talkin' but what am I to do?\nI'm the man they love to hate the Bill Clinton of the Lou\nPicked up some shorties on Skinker towards Wellston\nHeaded for the Castle lot moscato got me croachin\nBently kinda crowded the whole car was leanin' back\nShandra watchin' TV with two gurlies on their lap (man)\nMartin Luther King the set is kind of dead\nMade a left on Kingshighway Natural Bridge is just ahead\nSo fresh and so clean U City representin'\nThe St Lunatics on that Castle lot set\n\n[Hook]\n(Tell it) Where you headed?\nNatural Bridge and Kingshighway (uhh uhh)\nWe gon' make it knock, 'Tics gon' make it fuck\nNatural Bridge and Kingshighway\nCome on with it\nWhere you headed?\nNatural Bridge and Kingshighway\nBasement Beats gon' make it knock, 'Tics gon' make it rock\nNatural Bridge and Kingshighway\nCome on with it\n\n[Verse 2]\nNow rollin' with the 'Tics you know we never bored\nShow me another clique when more points scored\nWe walk around with criminals a bunch of big gorillas\nMy dirty Murphy Lee he's a teenage lady killer\nKyjuan is on my left side dancin' with this freak\nThe way she clap that ass make my knees get weak\nJD is the white guy people think he's funny\nBeen down long time way before we had the money\nBut now we collectin' dollars from platinum to white gold\nSwervin' in this Bentley and ain't got no place to go\nRollin' past Fairground what's up to the thugs\nShorties in their mini's wanna show a nigga love\nBut the dope man got em and they butts just drop\nShorties looked depressed cause that thing gon' stop\nHeaded back toward Union bust a Uie what the hell\nSomebody shoutin' Nelly we're damn near out of L's\nBaby girl blew me a kiss said \"you're number one\"\nThen looked over to me and I ain't gon tell you what she done\nThe closer we get the woozier I feel\nNatural Bridge and Kingshighway somebody take the wheel\n\n[Hook]\nWhere you headed?\nNatural Bridge and Kingshighway (St. Louis)\nBasement beats gon' make it knock, 'Tics gon' make it rock\nNatural Bridge and Kingshighway (dirty)\nCome on with it\nWhere you headed? (uhh)\nNatural Bridge and Kingshighway\nBasement Beats gon' make it knock, 'Tics gon' make it rock\nNatural Bridge and Kingshighway\nCome on with it\n\n[Verse 3]\nRolling Natural Bridge and we bumped in the store\nMobbing with the 'Tics is the only way to go\nFour shorties by McDonald's was looking for a ride\nWe in the wide body so it's plenty room inside\nWe put two by the trunk, one on the hood\nOne on my lap, don't it feel good\nPosse's getting deeper, we still looking for freaks\nAin't worried about them tripping cuz three got that heat\nNow them shorties getting hungry and Jackie Frost treating\nWe stopped at Burger King for some royalty eating\nBut Burger King was closed, the girls started to hassle\nSaid \"man, go back the other way I want some White Castle\"\nNow this is the place where the dubs hang out\nThe new shits is cool but old schools get the clout\nPosse's so damn big what the fuck you want to do\nI'm getting dirty looks from those other rapper crews\nAli dropped a hundred, I tripped off what he done\nNow should I pick it up? No, drop another one\nSome nigga started tripping cuz his girl was in my face\nI told Big B to chill cuz he ain't worth the case\nAnd I ain't with the smacking and beating up on your girl\nIf your Pimp Juice is low, then let her leave your world\nWe took his girl with us (us) I seen him on the bus (bus)\nHe beating on the window and it damn near about to bust (man)\nI got a tight clique, you got a bunch of dudes\nNow you're broke cold crying them St. Louis Blues\nWe rolled off with your girl and now you all upset\nShe with that Country Grammer boy and them St. Lunatics (uhh)\n\n[Hook]\n(Check it) Where you headed?\nNatural Bridge and Kingshighway (uhh uhh)\nBasement beats gon' make it knock, 'Tics gon' make it rock\nNatural Bridge and Kingshighway\nCome on with it\n(Tell me) Where you headed?\nNatural Bridge and Kingshighway (listen to me)\nBasement Beats gon' make it knock, 'Tics gon' make it rock\nNatural Bridge and Kingshighway\nCome on with it\n\nHo ho ho ho ho ho ho ho\nBasement Beats gon' make it knock, 'Tics gon' make it rock\nYo if you ain't tens or better 12s or getting leather\nIf you ain't tens or better 12s woods or leather"}], "artist": "Nelly"}