{"artist": "ILL BILL", "songs": [{"title": "Peace Sells", "lyrics": "[Verse 1: ILL Bill]\nI'm the Kreator of Terrible Certainty, it's No Escape from the Toxic Trace\nPop your face, Storming With Menace and Blind Faith\nThe Angel of Death Read Between the Lies South Of Heaven\nExpendable Youth, Divine Intervention\nTeaching y'all A Lesson In Violence\nDoctor Death injecting the virus, apocalypse\nI'm a horseman in the Circle Of Tyrants\nAnd death's the era, Possessed like Jeff Becerra\nConsuming Impulses drown you in the depths of terror\nForever!\n\n[Hook]\nPeace Sells, But Who's Buying?\nWho's trying? Who's crying?\nWho's lying in a pool of blood dying?\nPeace Sells But Who's Buying?\nWho's trying? Who's crying?\nWho's popping with the four pound iron?\nPeace Sells But Who's Buying?\nWho's trying? Who's crying?\nWho's lying in a pool of blood dying?\nPeace Sells But Who's Buying?\nWho's trying? Who's crying?\nWho's lying in a pool of blood?\n\n[Verse 2: ILL Bill]\nStranded In Hell, My America dated Betrayal\nBrainwashed by a system that's created to fail\nFreedom Or Fire, Securitron, ominous fate\nFear Factory manufacturing Hi-Tech Hate\nA Slave New World, a world gone mad, A World Without Heroes\nUsed to go to shows surrounded by weirdos\nLive at L'Amours, mastering the science of war\nReading Metal Forces Magazines dying to tour\nBiohazards and Carnivores, living a Life Of Agony\nWhere to go, We Gotta Know like Harley Flanagan\nElectric Funeral, Children Of The Grave Behind The Wall Of Sleep\nBe afraid, killing to be saved\nI Don't Need Society, Down For Life, foul and trife\nILL Bill, Dirty Rotten Imbecile, down to fight\nGive Me My Taxes Back, money, God's a liar\nSpeak truth to Def Americans like Tom Araya\n\n[Hook]\n\n[Verse 3: ILL Bill]\nPsychic Vacuum, jab you with a knife and stab you\nRavenous Medicine, Tribal Convictions, it's heroin\nExperiment, Macrosolutions To Megaproblems\nLet the revolvers solve 'em, Chaos Mongers, a Cosmic Drama\nPeace Sells But Who's Buying, so I stay with the funds\nWe're real, so you die and find you laced with the slugs\nWith The Quickness you calling me my Sacred Love\nI got Bad Brains, the reason I spray with guns, now listen\n\n[Hook]", "image": "https://images.genius.com/fc526dae683e1f19f37ee02105da9a7c.1000x1000x1.jpg", "album": "What’s Wrong With Bill?", "year": "2004-05-04"}]}