{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C", "title": "Trials of Love", "image": "https://images.genius.com/6a5406166b09f9389383b8e5cab645ef.599x599x1.jpg", "lyrics": "[Prodigy]\nYo..\nCome here darlin, have a seat, we need to speak\nLook straight in my eyes, tell me what you see?\nIs it that same nigga that you fell for from the door\nAin't I that same nigga we was both on the train goin hard\nAnd then your shit surfaced\nTakin the phone in the bathroom, whisperin wit your girlfriends\nTry to play me on some jerk shit\nNumbers underneath the sole of your lady Timb's\n... oohh shit!!\n\n[B.K.]\nKid, I kept it tight for you\nTurned nigga's down, didn't go out all them nights for you\nAnd I ain't even that type'a bitch\nI heard about Jones Beach and Luke's Freak Fest\nNevertheless I still put my faith in you\nYou was my dog, so I stayed faithful\nBut I'll be god damned if I be some nigga dumb bitch\nIt's fucked up it gotta go down like this...\n\n(Chorus:)\n[P] Yo, have you ever had a bitch that'll pop guns for you?\n[B] Type of nigga you'll do anything he ask to?\n[P] Snake bitch turn around and backstab you?\n[B] Crab nigga found out he fucked around too?\n[P] Threw her cash, threw in the smash, that's boo\n[P] Rockin your 4 wheel drive and tattoo\n[B] Talk sweet thinkin that he rockin you to sleep?\n[B] Who me? Fall for that bullshit, you got it twist\n\n[Prodigy]\nYou was once my bunny, now you want to act funny\nI'm that same nigga from the first day who dress bummy\nSame grimy style nigga, I'm still hungry\nI never lost my thirst for takin that money\nI never lost my lust for chicks lovely\nYou met me on those terms, so that's how I'm runnin\nI still walk up in the crib 5 in the mornin\n... and still count my cash before I crash\nWhat you thought, you had a dunny? I ain't the one honey\nYou skim 20's out of my stacks of Benny's\nYou done found yourself a street life love, to death do us\nRemember that shit, now everything's ass-backwards\nWe was more like Mickie and Mallory\nYou fouled out on me; found another man math in your Bally bag, damn!\nI wish you luck though, you sneaky bum ho\nCatch you on the corner while I pass in my truck though\n\n[B.K.]\nYeah aight\nFirst of all Fuck You, and everything you own nigga\nYou got a lotta nerve, nigga\nI should throw a brick thrrough your shit, fuck your whips\nIt ain't about that, it's about you givin out my dick\nOr so it seems, I can only call it how I see it\nGot hoes callin the crib, hangin up not speakin\nCome on, what type of shit is that?\nWhat, I'm sposed to sit back, stay up all night for you to get back?\nLike the world revolves around P\nSo while you strolled in at 5 I was comin in at 3, 3:30\nNiggas wanna play dirty\nFuck it, that's how you wanna rock? let's get dirty\nYeah, condom wrappers in the back of the Azure\nTalkin' bout you let your mans get off, your G ain't strong\nI'm gone, you ain't worth the tears\nYou lost the best thing you ever had in your life, a waste of my years\n\n(Chorus)\n\n[BREAKDOWN]\nI might give out, but I'll neeeeeeeeever give iiinn..\nWe might as well, be friends, yes we have...", "year": "2000-11-14"}]}