{"artist": "Fashawn", "songs": [{"year": null, "album": "Boy Meets World", "image": "https://images.genius.com/4eb0769f2fa647dc2e26d40d1390094b.1000x1000x1.jpg", "lyrics": "[Verse 1-Fashawn]\nRemember, livin' in a trailer\nCookin' dinner out a Crockpot or we would microwave it\nBasic, television same seven stations\nOn a twelve-inch, I had to watch cable at the neighbors\nDidn't know how broke we was 'til I got older\nNever knew I had a father until he showed up\nOut the blue, tryin' to get back wit mama\nStepdad walks in, now here comes the drama\nHad a couple of em, to be honest\nLike William, Scott, they would always take me shoppin'\nRalphie and Mark, they would take me to the doctor\nI call em all Daddy even though they didn't have me\nKids used to make fun of my clothes\n'til one of em got punched in the nose\nKinda like I was forced to be tough\nLife as a shorty shouldn't be so rough, but hey\n\n[Hook 1-J. Mitchell]\nEven though, I'm young and I can't see\nThe forest from the trees, follow me\nAnd when I'm grown, you know I'm bound to be\nThe H.N.I.C., follow me\nMama, I'll be alright, just let me do my thing\nFollowing my dreams, this is me\n\n[Verse 2-Fashawn]\nFirst fight, third grade, I was swingin' from the shoulders\nWith this kid named Dariah, he was three years older\nAnd like two feet taller, I finished it, he started it\nAll over this chick named Barbara Johnson\n\"Nonsense\" I thought once the principal came\nThat fat lip really put a dent in my game\nNever in my life have I felt such pain\nGot sent home, but I held my own\nSlept in every morning, it was like a vacation\nHow'd I make it to sixth grade graduation?\nCause I was always ditchin', hung around with some misfits\nWith ADD, and they all smoked weed\nNever read a piece of literature, wasn't good listeners\nNever paid attention, so they hung 'round me\nWhile my parents was out in the streets\nI built my world on a blank sheet, just thinkin' in myself\n\n[Hook 2-J. Mitchell]\nEven though, I'm young and I can't see\nThe forest from the trees, follow me\nAnd when I'm grown, you know I'm bound to be\nThe H.N.I.C., follow me\n\n[Verse 3-Fashawn]\nCheck it out, hard to forget all the time I would spend\nWith my first fuck, even had me dodgin' my friends\nWore my heart on my sleeve at the age of fifteen\nShe would tell me that she loved me, it was all just pretend\nShe cheated on me, so it quickly came to an end\nShe put the blame on him, got played, I'll admit that\nHangin' with my friends, never called her again\nFive years later, heard she had a kid, damn\nI guess time flies when you're havin' fun\nSo enjoy life, you only get one\nI love my childhood, despite the gunfire\nI was quite happy growin' up in the slums\nIt wasn't too bad, havin' a few dads\nThe only thing I disliked was not havin' cash\nWhat I'd give for a couple of bucks\nMan, life as a shorty shouldn't be so rough, but hey\n\n[Hook 1-J. Mitchell]", "title": "Life as a Shorty"}]}