{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/6988db34176c7b94ceb840e8cf16ec4e.500x500x1.jpg", "year": "2012-07-04", "album": "Heart of Dixie", "lyrics": "[Intro: Yelawolf]\nEy what up Ritchie\nI’m not sure if you’re aware or not but I’m Illuminati\nWe controlling the minds of all the youth\nShady, the evil empire\nYeah you got me pegged motherfucker\nYou got me, fuck y’all\n\n[Verse 1: Yelawolf]\nMan people really got me confused, what did I do?\nOutside being a human being seeing my dreams through?\nNever did shit to nobody but invite them out to my party\nGet’em drunk and maybe even tell them a story or two\nSome think I’m Illuminati ‘cuz I’m a light in the dark\nLookin’ for masonic symbols inside of my body art\nThat’s hilarious Marshall, what the fuck you do to these folks?\nCrazy motherfuckers tryin’ to put me and you in the boat\nWith Royce da 5’9”, Crooked I, Budden and Joell\nBut I’m on this ship and I don’t give a shit, oh well\nI see the storm, let the boat sail\nAnd I’m on deck but the rain pourin’ off my raincoat tails\nThey see God in me ‘cuz I know Hell\nThey see the criminal inside of me probably ‘cuz I broke jail\nBut my soul is not on wholesale\nAnd when I die, my people will be cryin’ the first\nNo? Well look\n\n[Hook]\nIf I’m gonna be the one, then everybody comes to one\nThen I guess the battle has begun, fuck it then, let’s have some fun\n‘Cuz I promise I will never run, never run from what I’ve become\n‘Cuz all that dumb shit that I’ve done, built me up to make me the one\n\n[Verse 2: Yelawolf]\nJesus Christ sittin’ passenger with the .45\nTurn the page, I got a new way to earn in pay\nStickin’ bitches up with a crucifix while Lucifer sits\nWith a Vice Magazine, burning every page\nWell I guess it’s my turn to play\nThe wildcard of Shady’s clique and new world order’ll play\nTalkin’ shit, yeah that’s sorta gay\nBut I ain’t homophobic; I punch a homo like I punch a man\nNo way, are you serious?\nClaiming that I got hipsters brainwashed and they all coming to my show\nBut if you took a moment and took my dick out your mouth\nYou would see all the versatility on the front row\nI convert, revert people to desert\nPeople who miss being them people of Wolf, go home\nAnd if you’re 'bout it enough, anybody doubtin’\nThey come to the Circle of Psychos and you be done\nSo look\n\n[Hook]\n\n[Verse 3: Yelawolf]\nThe one gathering people, some people think that I’m king\nSome people think that I’m trash, some people shout and they scream\nDon’t bother me, I’m a survivor, I’m alive and livin’ my dream\nIn a microwave society I’m a steady stream\nDon’t need no validation from any cultural thieves\nNo magazines or blogs or anybody who don’t believe\nIf you’re behind the camera, than just point it at me\n‘Cuz I’ll be making this movie and you’re just making a scene, check it\nMissy Eliot gave me a shot and I love her for it\nI wasn’t ready, I should have waited, but when you poor\nAnd you got a two year old baby and one on the way\nYou be crazy to see opportunity at your door and ignore it\nSo you lookin’ back and callin’ me whack and ho for\nWhen all I wanted to do was get my kids out that apartment\nAnd that’s important\nAnd I went from not having a home, to everything I owned up in storage\nI made a sacrifice any daddy would make\n‘Cuz I cannot stand and look when they look into daddy’s face\nWhen the government picked away at every penny that I made\nI had to borrow money to get my son a fuckin’ birthday cake\nYeah, I guess that’s a hard balance to weigh\nChase the rap game, or manage a subway\nWell I suck at making a sandwich and rappin’ don’t get me paid\nBut if I stick to then I’ll get through with it someday\nI’ll be the one, you can talk shit about me\nI’ll be the one that you think is a part of some fucked up cult\nI’ll be the one you can hate\nBut\n\n[Hook]\n\n[Outro: Yelawolf]\nI ain’t mad motherfucker\nIt’s that new church, I be pastor\nWhat’s up Wolf pack?\nLet's get the summer started\nOpen up this rhyme book, give you some motherfucking quotables", "title": "Be The One"}]}