{"songs": [{"year": "2002-04-16", "title": "Inherited Scars", "image": "https://images.genius.com/ac9e0f11c62005e2d424955c950a2944.300x300x1.jpg", "lyrics": "[Intro]\n\"I wanna show you something\" She said\nAs if I had built up enough trust in her\nTo the point where she could show me\nThe type of thing that she had to first\nIntroduce by saying she wanted to show it\nInstead of just showing it like, \"Look\"\nAnd I'm like \"I don't feel like lookin'\"\nLike the uninterested type\nSo I say \"A'ight, show that shit.\"\nBut a little more respect and reservation\nIt was my sister for Christ's sake\nSo I'm waiting for a follow-up line\nThere usually always is to statements like \"I want to show you something.\"\nIt kind of runs in the same vein as statements like \"You can't tell anyone\"\nAnd then promises are made;\nSecrets are kept\n\n[Verse One]\nI didn't tell anyone about what I seen or heard that day, mums the word still\nI'm scared to plant ideas into your head while your rebellious side is fertile\nHurdles are getting knocked down\nI'm running a losing race\nYour legs aren't the only ones marked up, how many dreams have you chased?\nIf I could have said this to your face maybe you wouldn't have to write like I do\nExcept I use paper instead of my body now; it's something you might want to try too\nFrom haikus to horror stories, it's something in our blood that we share\nSomething in our blood that appears on the surface of our skin when we bring it there\nMy facial expression said I didn't care\nHate and aggression must've made an impression on the little kid who stared\nSitting on stairs when I would bother to bring my skates\nMy feeble attempt at being a strong, big brother doing father figure 8's\nRipping my cape on the ground that it dragged on\nTripping on fate and hearing the sounds of a sad song\nListen, it's great sharing time now that dad's gone\nBut what's with the choice of words?\nOr the body parts that you decided to tag them on?\nI'm a vagabond who moved to modern day Babylon and then back again\nWith minimal contact and you know I can't ask your mom what's happening\nYou've got such beautiful gifts, what are you doing ruining the packaging?\nHow ironic come to think I probably put this ink on my back for him\nI want you to laugh and sing more\nBut you dropped anchor in a place\nWhere dreams go to die and you're keeping your ass indoors\nI'm asking for you to stick it out and see things through\nYou're asking for me to zip my mouth and keep it just between me and you\n\n[Hook]\nIf I could have been there from the beginning if I could be there right now\nIf I could promise to be there when you need me, would it raise an eyebrow?\nHow would your body be different if I still dropped by for visits?\nIs it my place to put a smile on your face?\nCould I erase your body language telling you its all been said before?\nOr change the words you wrote, exchanging your scars for my metaphors?\nI'd add them to my collection while smiling\nNext time you want to paint with razor blades and need a canvas use my skin\n\n[Verse Two]\nYou're hiding your sins well, but I see the hell that your limbs speak\nTongue in cheek Lying awake in bed while other kids sleep\nThe strength of evil begins to keep your grins weak\nNo matter the length of the needle\nMarking up one's body is so much more than skin deep\nFeel the pin prick The grim reap what they sew and you're trained to say that you're fine\nYour thresh hold for pain is greater than mine\nSo I'm waiting in the lines that you give me patiently\nWhile you get cut in the lines that THEY make YOU wait in, in ways that they can't see\nIf there's a vacancy as far as room in your life goes\nSay it to me Don't do it with a knife under your clothes\nBecause the anguish of hidden skin is letting my ghosts be shown\nPlus the language its written in hits especially close to home\nI'm most alone when I'm out of touch with the people who feel this type of pain\nYou might just aim for a day that its raining to strike a vein to take my name in\nChanging your uniform and altering your mind set\nHas your pointer finger decided if it was a fault of his or mine yet?I bet\nI know the dialect It's nowhere I haven't been before\nWith skin that's sore Battle scars that rise from our inner war\nAre decorative medals of honor that our father decided to pass through inheritance\nAnd it is repetitive when the kids head in the direction of evidence\nProving the pain and hurt is relative\n\nAll this pain and hurt is relative\n\n(repeat chorus)\n\n[Outro]\n\n(Young Sage Francis?) Stop that, or I'll cut your head off\n(Francis's little sister?) Awwwwww!\n(Young Sage Francis?) What? You're on the re-tape recorder now\n(Francis's little sister?) What!?", "album": "Personal Journals"}], "artist": "Sage Francis"}