{"songs": [{"title": "All I Know", "album": "Detroit", "year": "2012-09-05", "image": "https://images.genius.com/6b6ac4eb55acf7dda757b1f6c6081c31.500x500x1.jpg", "lyrics": "[Big Sean]\nYeah, Finally Famous gettin'.. yep\nCould you tell me where to go? I need direction\nWhere are we now? Where's the\nIntersection?\nMotherfuck my phone, it never has reception\nIn this cold world, it's all about collection\nSo I, I stack paper and keep it ghetto\nOh, cause when you rich you are on top of the world\nI made a promise to the mirror\nThat I'd, never ever ever go broke\nRiding through the city, I be riding through the city\nAll I know is bad bitches, I got Finally Famous with me though\nPlenty smoke, plenty rolled\n\n[Hook: Big Sean]\nSo I'mma drink and smoke and fuck and go-go-go\nLike it's all I know, all I know\nLike it's all I know, all I know\nLike it's all I know, all I know\nAll I know, all I know-ow-ow\nOw-ow-ow {*8X*}\n\n[Wiz Khalifa]\nWhile I'm flying over literally, flying over cities\nGot my carry-on but really wish I had a pound with me though\nMy watch is thirty thousand dollars, Dolce and Gabana\nI done spent so much in Prada, I don't wanna know\nI'm the reason that your bitch is smoking weed now\nNo blunts, lil' bro wan' roll up joints\nSeen the how-to video now he on point\nAnd he tryna make it front row to the show to throw me one\nIf I ever hand you some weed, it's free, you don't owe me none\nJust put on one of me or Big Sean's CDs and roll me some\nAnd there's only one, you know you know\nKhalifa got, I stay high like Pluto\n\n[Big Sean]\nOkay, I'm going hard (I'm going hard), I'm going dumb (I'm going dumb)\nI'm\nGoing in (I'm going in), 'til I'm going numb ('til I'm going numb)\nI got a lot to say, I don't hold my tongue, I just hold money, don't hold me up\nRolling in more green than a hole in one; you got more than me? Then shit roll somethin'\nSee I be off of that tree, people tell me I shouldn't be\nBut early on, my mom taught me that everything green is good for me\nI wake up to three girls, my role model is Hugh Hef\nI gave ya girl a t-shirt since she gave the whole crew neck\nI don't dance, I two step, my weed loud, it suplex\nI came up from that basement, man straight up out of that duplex\nBitch, if I ain't a G, I'm an OG\nTwo fingers on my joint, one to the policeeeee\n\n[Hook]\n\n[Big Sean]\n...Yeah\nOhh, yeah\n...Ohh"}], "artist": "Big Sean"}