{"songs": [{"image": "https://images.genius.com/121e256fc284807240eabbb5a0dded60.500x500x1.jpg", "album": null, "title": "Dear Miley", "lyrics": "[Verse 1]\nDear Miley\nMy name's Daniel (Hi)\nI've never really been a big fan of yours\nI'm a musician too, amateur\nBut anyway, let me tell you what I am here for\nYou want to take a hammer to Hannah Montana\nAnd vanish her\nThat is a plan I would have as your manager\nBut the manner that you're handling\nIt's going to damage you\nNever underestimate the power of the camera\nMiley, you've got nothing to prove\nBut you're behaving in a way\nThat says you've nothing to lose\nI said, Miley, you've got nothing to prove\nBut you're behaving in a way\nThat says you've nothing to lose\n\n[Hook]\nMiley, you've got nothing to prove\nBut you're behaving in a way\nThat says you've nothing to lose\n(2x)\n\n[Verse 2]\nYeah, I know girls just want to have fun\nBut Cyndi Lauper never flaunted her bum much\nSee, you're in a funny position\nEvery time you speak, young girls listen\nThey want to be like you, different\nSo they copy your moves and lose innocence\nI tried twerking, it wasn't working\nMy balls kept slapping my thighs and it was hurting\nThere are blurred lines between empowerment\nAnd the first time people seeing down the front of your dress\nNot to mention the rest\nSometimes being censored is best\nThis is just a guess, but I'm sensing there's stress\nYou're either a diva or sensitive mess\nMiley, you've got nothing to prove\nBut you're behaving in a way\nThat says you've nothing to lose\n\n[Hook]\nMiley, you've got nothing to prove\nBut you're behaving in a way\nThat says you've nothing to lose\n(2x)\n\n[Verse 3]\nMy God, have you heard what she's done? (What now?)\nI don't know, but I bet her tongue popped out\nOne day when the cheeks of your bum drop down\nYou'll have nothing left but your lungs and a hot sound\nRight now, you've got pop locked down\nBut come middle age, you'll be washed out\nI don't want to hear you've lost out for some quick dollars\nThe way the industry's treating people, it's bollocks\nI see the wrecking ball as a metaphor\nFor what could happen to you during the menopause\nWhen applause dies out, there is then a pause\nAnd then you wonder what you acted like a lemon for\n\n[Bridge]\nSinéad O'Connor\nShe ain't your momma\nBut she doesn't deserve to have the piss taken of her, no\n(2x)\n\n[Verse 4]\nSee me, I'm really pretty good with words, but\nI managed this without ripping my shirt off\nI've tried a few stunts, but not this\nHow seriously can you take me when I'm topless?\nMmm, yeah I like it\nI'm better at music now\nHow else could I act for additional hits?\nI could hold up a cat while I jiggle my tits\nLook at my boobies, look at my boobies\nYou'll see a heart\nIf you look straight through these\nThis isn't the movies or Looney Tunes\nWe are stuck with decision that we choose in our youth, see\nLook at me, man, I'm standing in my pants\nDon't I look silly when I'm doing this dance?\nAnd I pull a face as if I'm pooing my pants\nI want a long-term career, but I've ruined the chance\n\n[Hook]\nMiley, you've got nothing to prove\nBut you're behaving in a way\nThat says you've nothing to lose\n(2x)\n\n[Outro]\nOf course, you're under no obligation\nTo pay any attention to those observations\nBut living a life with no moderation\nWill lead to a load of complications", "year": "2013-10-07"}], "artist": "Dan Bull"}