{"songs": [{"image": "https://images.genius.com/7bd5105544956db251fdc5f82aabbb6e.450x450x1.jpg", "title": "Your Woman Has Just Been Sighted (Ring the Alarm)", "album": "Music & Me", "year": "2001-12-04", "lyrics": "[Jermaine Dupri]\nCmon\nDance with me baby girl x2\nCmon\nDance with me baby girl x2\n\n[Verse 1: Nate Dogg]\nMan I was dancing, prancing, laughing, bouncing, swinging\nMoving, grooving, cause the music's booming\nMacking, tryna get some action, packing, acting\nManish, drinking, tweaking, winking, peeping\nSeeking a freak for the evening, really feeling way too horny\nReaking from the weed I'm token, choking, smoking, real doping, hoping\nMy nights wide open, knowing that my girl's at home\nSnoring, boring, ignoring, warning that my girl was coming\nSudden mood interruption, busted my girl in the club\n\n[Hook]\nRing the alarm (oh oh)\nYour woman has just been sighted (uh)\nRing the alarm\nHow'd she get in if she wasn't invited? (I dunno)\nRing the alarm\nShe's headed this way like lighting (yeah)\nRing the alarm\nI'm not tryna be ducking and diving (cmon)\nRing the alarm\n\n[Verse 2: Nate Dogg]\nHeaded, top speed for the exit\nDamnit don piece can't grab it\nA habit like chasing my cabbage\nMagic, time to disappear fast with\nThis chick, who I slept last week with\nReal trick, I like her cause she real slick\nLet's dip, I don't care who you came with\nNo lip, got no time for some bullshit\nShe went, that she all in the backpen\nTime spent, now it's time to hit the pavement\nTwo sense, got no time for your comments\nDon't trip, do you know where my girl went?\n\n[Hook]\nRing the alarm (oh oh)\nYour woman has just been sighted (uh)\nRing the alarm\nHow'd she get in if she wasn't invited? (I dunno)\nRing the alarm\nShe's headed this way like lighting (yeah)\nRing the alarm\nI'm not tryna be ducking and diving (cmon)\nRing the alarm\n\n[Verse 3: Jermaine Dupri]\nListen, I'm in the club, nowhere I ain't even supposed to be\nDrinking with a girl all close to me\nI'm all up in the air, telling her some superfly shit she need to hear\nThinking can't nobody see us cause we in the rear\nAll I'm tryna do is get a number then I'm up out of here\nCause my girl ain't home, she out with a friend\nIta be just my luck this the spot they in\nNot the place for her to spot me in\nYou know especially when I'm supposed to be at the studio\nI take one step, what do I see my girl coming through the door but she don't see me\nNow I'm ducking, now I'm dodging, hiding, praying to god that she don't come find me\nWhat was I thinking of, I should have never parked my car in front of the club damn!\n\n[Hook 3x]\nRing the alarm (oh oh)\nYour woman has just been sighted (uh)\nRing the alarm\nHow'd she get in if she wasn't invited? (I dunno)\nRing the alarm\nShe's headed this way like lighting (yeah)\nRing the alarm\nI'm not tryna be ducking and diving (cmon)\nRing the alarm\n\n(ambulance siring)"}], "artist": "Nate Dogg"}