{"songs": [{"title": "Look Back At It (Olexesh Remix)", "album": null, "year": "2019-02-22", "image": "https://images.genius.com/9c2e5fab74c3c052748e1ee4c9d6a6e3.1000x1000x1.jpg", "lyrics": "[Chorus: A Boogie wit da Hoodie]\nLook back at it\nShe ain't never do this before, but she good at it\nSaid she never made love, but she good at it (She good at it)\nShe make a nigga feel good when I look at it (Yeah)\nI get goosebumps when I look at it (Look at it)\nOh, girls just wanna have fun with it (Fun with it)\nAll the girls just wanna have fun with me (Fun with me)\nThese girls ain't really no good for me, yeah\n\n[Post-Chorus: A Boogie wit da Hoodie]\nDrrrat, da-da, da\nDrrrat, da-da-da, da\nDrrrat, da-da-um-da\nDrrrat, da-da-da-um-da\nYeah, got a new Benz that I ain't promotin', yeah\nAll of my friends love money throwin'\nDrrrat, da-da-da-um-da\n\n[Verse 1: Olexesh]\nOh, Chaya, kannst du wein'n für mich? (ja)\nOh, Chaya, kannst du wein'n für mich? (jaja)\nÜbermorgen hab' ich Zeit für dich (Zeit für dich)\nRauch den Joint für mich an, ich will high sein (high sein)\n69, Pussy, Suck, Facedrive (ja)\nRuf mich an, ich nehm' mir Zeit für dich (jaja)\nKleine Schljuha, bitte wein für mich (jaja)\nImmer wieder wirst du ohne mich allein sein (ja)\nNimm die Finger und denk an meine Handsign (jajajaja)\nLass uns los, von hier weg, komm mit ins Hotel (ja)\nAlles aus, meine Welt, falsche Liebe geht (ja)\nSchlaf' mit ihr in ei'm Bett, sie will Scheine zähl'n (ja)\nSie ist da wegen Fame, Fame, Fame\nSie ist gut, morgen schlecht, zahle alles, ey (ey, ja)\nGänsehaut, auf sie drauf, sie will für mich dreh'n (dreh'n, ja)\nDoch mal seh'n, ob sie bleibt, wenn ich nichts hab' (jaja)\nFame, Haus, Hype-Shit, Bratan, kenne kein Stop (jajajajajaja)\n\n[Chorus: A Boogie wit da Hoodie]\nLook back at it\nShe ain't never do this before, but she good at it\nSaid she never made love, but she good at it (She good at it)\nShe make a nigga feel good when I look at it (Yeah)\nI get goosebumps when I look at it (Look at it)\nOh, girls just wanna have fun with it (Fun with it)\nAll the girls just wanna have fun with me (Fun with me)\nThese girls ain't really no good for me, yeah\n\n[Post-Chorus: A Boogie wit da Hoodie]\nDrrrat, da-da, da\nDrrrat, da-da-da, da\nDrrrat, da-da-um-da\nDrrrat, da-da-da-um-da\nYeah, got a new Benz that I ain't promotin', yeah\nAll of my friends love money throwin'\nDrrrat, da-da-da-um-da\n\n[Verse 2: A Boogie wit da Hoodie]\nCan I come by and vibe? (Can I?)\nI get a different type of fly (Fly)\nHit a lick and split it with my guys (My guys)\nGettin' rich I'm really lit, but I (I)\nAin't shit, I admit it but I try (I try)\nIf I'm wrong, just tell me that I'm right\nLet me tell you somethin' 'bout my life (My life)\n\n[Outro: A Boogie wit da Hoodie & Olexesh]\nLook back at it\nOh, Chaya, kannst du wein'n für mich?\nSaid she never made love, but she good at it (Good at it)\nÜbermorgen hab' ich Zeit für dich\nI get goosebumps when I look at it (When I look at it)\nAll the girls just wanna have fun with me\nThese girls..."}], "artist": "A Boogie Wit da Hoodie"}