{"artist": "Ice Cube", "songs": [{"title": "Good Cop Bad Cop", "lyrics": "[Intro]\nTurn me loose\nBreak 'em off some\nYeah\n\n[Verse 1]\nGood cop, good cop rollin' with that bad cop\nWhat'cha doin', boy? Turn in that blood clot\nBuck shots, they fly through drug spot\nRobots can give a damn who the fuck shot\nClean cop, clean cop, fuckin' with that dirty cop\nDon't act like yo' ass never heard of that\nClean cop, clean cop rollin' with that mean cop\nStill tryna act proud as a peacock\nYou know that mean cop might need a detox\nMothafucka tried to blow me out my Reeboks\nBut I swing like Jack and the Beanstalk\nChop 'em down when these bitches try to lock me down\nHit the ground hit the turf\nWarp the earth\nCube kidnap your mind, Patty Hearst\nBust a verse that'll make yo' ass hit reverse\nKill the curse that was placed on the universe\nWest Coast warlord blacker than the Black Knight\nFuck a black and white when they ain't actin' right\nGood cop, good cop filling out your report\nBad cop asking you to distort\nBad cop asking you to lie in court\nSend another young brother up north\nSend another young sista off course\nWhile these mothafuckas chill on the golf course\n\n[Chorus]\nBlack police showin' out for the white cop\nWhite police showin' out for the black cop\nBlack police showin' out for the white cop\nWhite police showin' out for the black cop\n\n[Verse 2]\nLazy cop fuckin' with that crazy cop\nAlways bragging 'bout the new case he got\nDo-or-die cop with that suicide cop\nTell-the-truth cop, with that you-a-lie cop\nAre you fuckin' high, cop? Don't even try cop\nAin't no mothafuckin' drugs up in my spot\nAll you find in my closet is the high tops\nAnd my mothafuckin' tickets to the skybox\nHold up, nigga, I'm a rider\nYou's a roll-up, yep the controller\nMake me mad that's when I get swole up (Don't touch me)\nThe Incredible Hulk is bipolar\nCome out the cuffs knock off the rust\nThrow my hands (What's up?) up you still wanna bust\nThe Trojan horse is full of excessive force\nWhen they try to get aggressive nigga off the porch (C'mon)\n\n[Chorus]\nBlack police showin' out for the white cop\nWhite police showin' out for the black cop\nBlack police showin' out for the white cop\nWhite police showin' out for the black cop\n\n[Verse 3]\nGood cop, good cop, where is your dignity?\nWhere's your empathy? Where is your sympathy?\nBad cop, where's your humanity?\nGood cop, is that just a fantasy?\nHell on that nigga, snitch on that bitch\nTruth be told, mothafuck the blue code\nFuck the po-po actin' like Deebo\nAlready know Craig'll let the brick go\nBlack Lives Matter is not chit chatter\n'Cause all they wanna do, is scatter brain matter\nA mind is a terrible thing to waste\nA nine is terrible in your face\nThe mace has a terrible fuckin' taste\nThe pen is a terrible fuckin' place\nThe kings all hate the fuckin' ace\nThe judge sabotaged my fuckin' case\nRacist motherfucker\n\n[Outro]\nBlack police showin' out for the white cop\nWhite police showin' out for the black cop", "image": "https://images.genius.com/9c575bc84cfc0134a9b73a19085d9ce6.600x600x1.jpg", "album": "Death Certificate 25th Anniversary ", "year": "2017-06-06"}]}