{"artist": "Apathy", "songs": [{"title": "Chaos", "image": "https://images.genius.com/e0fd6f4042838cf24cc48a890f2b142e.1000x1000x1.jpg", "album": "The Widow’s Son", "lyrics": "[Verse 1: Apathy]\nWorld war leader, ether raps, speakers shake\nAp speakin' mean as Idi Amin with a cheetah cape\nCheapest date, take a skeezer on a reefer break\nUsed to fiend for sneakers now it's realer 'cause it's real estate\nSealed the fate of a snake with a steel shank\nAin't in shape but I feel great, trainin' in a field of apes\nFeel the bass, feel your face melted like a tape in a case\nIn a car in the summer motherfucker, you get erased\nI'm magnetic, mathematically average street credit\nFaster than your brain could process as soon as I said it\nI triple it, quadruple it, it's futile to fuck with a pupil\nOf Bruce Lee, I'm brutal fuck rap I'm Taps on a bugle\nAp's out of his fuckin' noodle, you new to this rappin' etiquette?\nScrap with me and get tractor beamed and trapped in Connecticut\nI'm an advocate for traffickin' tracks like narcotics\nAnd tunnel under borders like the Mexicans got it\n\n[Chorus: Sample and Apathy]\nI cause chaos, chaos, chaos\nLet me shout this out loud and clear\nA lot of rappers gettin' found dead 'round here\nI cause chaos, chaos, chaos\nLet me shout this out loud and clear (I cause)\nA lot of rappers gettin' found dead 'round here\nI cause chaos...\n\nI'm seein'...\nBody, after body, after body\nAfter body, after body, after body\nAfter body, after...\nI'm seein'...\nBody, after body, after body\nAfter body, after body, after body (I cause)\nAfter body, body, body...\n\n[Verse 2: Apathy]\nYo, I'ma fuck forty whores while my shorty records\nNut in her eyes and blind her like Geordi La Forge\nFormerly yours, you can call me \"Lord of the Lords\"\nHipster chicks are linin' up like for Morrissey tours\nWith every spliff that's lit, with every forty that pours\nMystic portals and doors open with sorcery orbs\nI'm the source of '94, I'm the four-door Ford\nThey shot Kennedy in, put his brains on the floor board\nI'm like the sword that was forged in the Mordor wars\nI pack four-fours for force that'll leave you leakin' quarts\nThe type to toss a torch in ya kid's tree forts\nI'm your greatest resource like Aquaman's seahorse\nWith no recourse, I'm runnin' up and gunnin' up courts\nTurn Muslim in jail, my bitch will rock three force\nMy life story's analyzed inside The Warren Reports\nI'm Doughboy pullin' Little Chris up on the porch, let's go to war\n\n[Chorus: Sample and Apathy]\nI cause chaos, chaos, chaos\nLet me shout this out loud and clear\nA lot of rappers gettin' found dead 'round here\nI cause chaos, chaos, chaos\nLet me shout this out loud and clear (I cause)\nA lot of rappers gettin' found dead 'round here\nI cause chaos, chaos, chaos...\n\nI'm seein'...\nBody, after body, after body\nAfter body, after body, after body\nAfter body, after...\nI'm seein'... (chaos, chaos, chaos)\nBody, after body, after body\nAfter body, after body, after body (I cause)\nAfter body, body, body...\nChaos, chaos, chaos...\n\n[Outro: Sampled from the film The Holy Mountain]\n\"You have power and money, but you are mortal. You know you cannot escape death. But immortality can be obtained. I know where the immortals live and how to obtain their secret.\"", "year": "2018-02-02"}]}