{"artist": "Drake", "songs": [{"year": "2015-07-27", "album": null, "image": "https://images.rapgenius.com/dd0b923b67acb9604ca8eceb99fec5f0.300x300x1.jpg", "title": "Charged Up", "lyrics": "[Intro]\nStop, stop, stop…\nFuck niggas gon' be fuck niggas\nThat’s why we never give a fuck when a fuck nigga switched up\nI’m so sorry\nDid you hope I was crying?\nIt was rough without you\nIt was rough without you\n\n[Hook]\nI did some charity today for the kids\nBut I'm used to it 'cause all y'all charity cases\nAll y’all stare in my face in hopes you could be the replacement\nNiggas is snitchin' on us without no interrogation\nI stay silent 'cause we at war and I’m very patient\nSix God is watchin', I just hope you’re prepared to face him\nI’m charged up, I’m charged up\n\n[Verse 1]\nWow, I’m honored that you think this is staged\nI’m flattered, man, in fact I’m amazed\nThe perfect start to the summer, man, this shit is a doozy\nThis shit a twist in the movie, but don't jump to conclusions\nYou boys are gettin' into your feelings on me\nYou should embrace it, this could be one of our realest moments\nOkay, the flow start to feel familiar, don’t it?\nMust I remind you that Jimmy got 20 million on it?\nNeed DJ Clue to drop a bomb on it\nNone of them want this shit more than I want it\nI seen it all comin', knew they would push a button\nEast egg huntin', they gotta look for somethin'\nDone doin' favors for people\n'Cause it ain’t like I need the money I make off a feature\nI see you niggas havin' trouble goin' gold\nTurnin' into some so and so’s that no one knows\nBut so it go\nCome live all your dreams out at OVO\nWe gon' make sure you get your bread and you know the ropes\nI get a ring and I bring it home like I’m Cory Joe\nNo woman ever had me star struck\nOr was able to tell me to get my bars up\nI’m charged up\nOh no we eatin', niggas ain’t about to starve us\nNah, niggas ain't about to starve us\nI'm charged up\n\n[Verse 2]\nI bought my niggas rollies off of Thank Me Later\nWhile these boys was stanky leggin'\nTrust me this information is vital\nI’m tryin' to take the high road\nI still got love for my idols\nI got me a deal with Apple and I still feel entitled\nRumor has it, there’s somethin' that only I know\nRumor has it, I steer the ship with my eyes closed\nRumor has it, I either fucked her or never could\nBut rumor has it, hasn’t done you niggas any good\nIt’s sound, sound, sound ‘til the day I die\nWe goin' live to keep this shit alive\nCops are killin' people with they arms up\nAnd your main focus is tryna harm us?\nAnd you think you ‘bout to starve us?\nNiggas ain’t about to starve us\nNah, I’m charged up!\n\n[Outro]\n(Stop, stop, stop, stop…)\nHave you seen me?\nI’m doing so good\nEvery time we meet:\n\"Oh, I’m so sorry.\"\n(Fuck niggas gon' be fuck niggas\nThat’s why we never give a fuck when a fuck nigga switched up)\n\n[Sample]\n\"You know, I kept it real\nIt ain’t too many real people out here\nAnd people be on some weak bitch-ass shit all day long\nIndustry people… regular people…\nAnd then when you keep it real with people, they cross the line, take your kindness for weakness and that’s weak.\""}]}