{"songs": [{"image": "https://images.genius.com/ff321b7b11c499b6ffbd311c2022b0d4.1000x1000x1.jpg", "title": "The Unlearning", "album": "The Art Of Chill", "year": "2014-05-23", "lyrics": "[Hook]\nTo whom it is concerning\nThis is the unlearning\nHere to free my psyche at the world and I'm determined\nMotherfuckers sermon [?]\nNow my wheels is turning\nGuess it's how it feels when you become a thinking person\nTo whom it is concerning\nThis is the unlearning\nEverything you taught me to believe in I'm deserting\nTruth is I am yearning\nUrgency is burning\nPulling back the curtain and I'm searching for a certain\n\n[Verse 1]\nOkay, a wise man once said nothing (ha)\nSo you can't tell me nothin'\nSee I know that I've been puffin'\nBut I think they've been bluffin'\nLike they know a lil' somethin' but they frontin'\nThe moment when I realise\nThat the truth is all real lies\nA bunch of flawed responses to the real wise\n(?) damaged by the programming\nLooking for the food we in a soul famine\nBut I got more than five senses\nNatural defences, seven chakras through the lenses\nSince the cradle, they enabled all the labelling\nDoctrine with no options\nI awake to an awakening\nKnowledge is power but ignorance is bliss\nAm I miserable with facts or just a happy idiot?\nLife is painless when you brainless\nAimless when you shameless\nSo much unconditioning to do\nI gotta sing this\n\n[Hook]\n\n[Verse 2]\nNow do you know about the tool?\nVisual repetition?\nPowered on faithfully, your living room religion\nOr what about the slavery they stitched into your breeches\nBlood diamonds in your riches when they glisten\nPoliticians feeding us articulate nonsense\nNews commentators cropping the content\nDrag it through the mud, tell you that it's pure\nAnd they keep my people sick cause ain't no money in the cure\nIf the world was mine, I would teach em something new\nLike, black is beautiful and you can do it too\nAnd you ain't gotta stand there like you ain't feel the pain\nYou ain't gotta pretend that you don't feel the change\nAnd your silence much louder than the violence\nSo don't wait until I die to give me violets\nUh, and keep that virus out your iris\nWatching with your ears, listen with your eyelids\nFuck this cheddar and wealth\nI gotta better my health\nCause I can't better the world\nBefore I better myself\nBirthmark, making my earthmark\nSpiritual rebirth when the verse start\n\nAnd when I feel it is time to enlighten my mind\nI sit back and close my eyes and imagine myself as I'd like to be\nI envision myself sitting in the dirt\nMy body anchored, much like my birth\nThese roots are the essence that will connect me to the mother earth\nThe Unlearning..\n\n[Hook]"}], "artist": "Nitty Scott"}