{"songs": [{"image": "https://images.genius.com/c7766be4216f233e38404ae7c801ef6d.800x800x1.jpg", "title": "Attitude City", "album": "Attitude City", "year": "2014-06-24", "lyrics": "[Verse 1]\nWhat's up baby? You're a very sexy lady\nWhat's a good girl like you doing in a 'hood like this?\nYour life's in danger every enemy's a stranger\nBut good for you I rule this town with my iron fists\nCheck my sunglasses for proof that I kick some asses\nNo more classes, you've been schooled and now you know the deal\nEveryone here has a black belt in \"Amazing\"\nAnd diplomas from The University of Fucking Keepin' it Real\n\n[Chorus]\n(Hey! Hey!) That's how we're living\nWelcome to Attitude City\n(Hey! Hey!) No fucks are given\nWhen you're in Attitude City\n(Hey! Hey!) You made the right decision\nIf your goal was to learn how to rock\nNow sit back as I walk you through\nMy life as the baddest fuckin' dude on the block\n\n[Verse 2]\nEvery morning I wake up before the dawn and\nRun a half a mile in forty seven minutes flat (Unh!)\nThen shit gets crazy, I water my grandma's daisies\nAnd sit down with her for biscuits and have a nice chat (Fuck yeah!)\nThen I maintain this insane body with weight training\nCan't contain me! Put five pounds up on that barbell rack! (Do it!)\nJust ask my mother, I am one tough fuckin' fucker\nAnd if I have scary dreams I can just go to sleep between her and dad\n\n[Chorus]\n(Hey! Hey!) No one can faze me!\nWhen I'm in Attitude City\n(Hey! Hey!) This shit gets crazy\nDaily in Attitude City\n(Hey! Hey!) My rock is fuckin' tasty, but here come some tough\nGuys from the town, trying to steal my crown\nI'll take on your whole bitchass gang, now let's throw the fuck down!\n\n[Bridge]\nNinja Brian, would you lay down a sick flute solo for me?\nThank you\nOh what a lovely spring day\nFor you to visit our city\nHere are some tasty gumdrops\nAnd rainbow colored lollipops (lollipops)\nDo come again with your thugs\nBut only if you like bro hugs\nHere's my wallet\nHave a nice day (day)\n\n[Chorus]\n(Hey! That's Right!) We are the masters\nOf fuckin' Attitude City!\n(Hey! We're much!) Harder and faster\nThan you in Attitude City\n(Hey! We are!) nightmare disasters!\nFor anyone who\nShows disrespect, girl your life we'll protect\nAnd if you think we're awesome then you are extremely correct!\n\n[Outro]\n(Rock Fuck!) Sorry, I don't know why we said \"fuck\" there\n(Rock Fuck!) Sorry again"}], "artist": "Ninja Sex Party"}