{"artist": "Bhad Bhabie", "songs": [{"lyrics": "[Intro]\nBitch, you're just mad\nYou think you know me and you don't\nYou don't know the real-life situations I've been through and what really goes on in my life\nAll you know is what you see\nDon't believe everything you see on the internet\nI'm just tired of everybody's opinion\nLike y'all need to just hear the real story\nStop Bhad Bhabie\n\n[Verse]\nFinally reached out to my dad\nWe met at the mall on some other shit\nPissed off by his tattoos 'cause they had the names of his other kids\nLike fuck me, I don't exist?\nAnd you actin' like I'm s'posed to praise you?\nMy whole life you bought a pair of J's\nNow you think I'm s'posed to say, \"Thank you\"?\nThat's when I knew I didn't need dad\nMy mom was pissed, I was sellin' pills\nCouldn't even afford rehab\nSo she put me on Dr. ****\nGot on stage and fuckin' blacked out\nI look up, I'm in a ranch now\nDid four months in solitary\nBet that y'all know it ain't a act now\nFuck it, hit a ho with no bars\nI remember seein' Clay kill a staff member, Jimmy with a crowbar\nThey fled the scene in Alicia's car\nCame home, jumped on the scene\nI look online and I'm a fuckin' meme\nSaid I'd shoot my mom, I on't go fuckin' mean\nYou don't know what I seen\nWhat the fuck you mean?\nI took all the pain in my heart\nCarried that shit to the charts\nEven when they protested, I still got more blessings\nI never dissed my mom to get some attention\nTake a second and listen 'fore you give your dumbass opinion\nYou bitch\n\n[Bridge]\nYou ain't seen nothin'\nYou don't know what I've been through\nYou haven't been there with me\nSo don't tell me what I went through\nDon't tell me that I disrespect my mom for the fuck of it\nDon't tell me I'm just bad for the fuck of it\nBitch you don't know my life\nYou don’t know what I been through\nUnless you were there with me\nYou can't tell me nothing, ho\n\n[Outro]\nSo, after 6 months of being on Dr. **** show\nI finally got home (finally I was gone for so long)\nAnd I got home from a ranch\nAnd it was pretty miserable (fucking horrible)\nI had no touch\nLike I was not in touch with the internet\nI did not know what was going on (at all)\nTo the real world\nThis place was far away from anything\nLike no phones, no internet, no nothing\nLike there wasn't even service there (nothing)\nAnd a couple a weeks after being home\nI finally decided that I wanted a meet with my best friend again (I just missed her and I wanted to see her again)\nSomeone who was not good for me at all\nBut I ended up going to her house to see her\nAnd instantly, like I say it was the next day\n'Cause she had slept over my house\nWe just got back to doing our old shit again\nSmoking, like, like trying to finesse people for money\nLike just doing really really dumb shit again (like really really dumb shit)\nSo since I was back outside the house\nMy mom decided to give me my phone\nBecause I was running around with Zandalee (take your phone back, Dani!)\nShe wanted to make sure that if something happened\nI could be able to call her or whatever\nSo (just in case)\nI logged into my Instagram\nThat I hadn’t been on for almost 7 months now\nAnd (should of just stayed off of it)\nEvery all these people were following me\nEveryone was commenting on my pictures\nI had almost like 500,000 followers\nAnd I was like \"What the fuck is this?\"\nSo I went on the explore page and there was a bunch of memes that was just my face that said \"Catch Me Outside\", and I was like \"What the fuck is this?\"\nLike I had never-\nLike I never even imagined that would happen (this shit's just so stupid)\nLike I didn't even remember saying \"Catch me outside\"\nThat's the funniest thing\nLike until I seen the bit from the show\nI didn't even remember I said that\nLike that shit was so irrelevant (this shit's so irrelevant)\nLike it was just some random ass shit\nSo like a couple weeks later I had 600,000 followers\nAnd it was crazy I was like\nThese people didn’t even know if it was my real account\nLike I had never verified that it was my real shit so it was kind of crazy (they were just following it 'cause I guess people had liked me)\nAnd then my\nAnd then now this guy Adam had knocked on my door\nAnd I was like \"Can I help you like what do you want?\"\nAnd he was like\n\"Do you sing? Do you rap? Do you do anything?\" (do you sing? do you rap? do you do anything?)\nAnd he was like \"well I wanna bring you to LA\"\nSo me I was like \"LA? Okay, cool!\" (just trust me I'll make you a star)\nSo I went out there\nI met Meechie and I met um Adam's management partner, Dan (I got you that check Barb, are we cool?)\nAnd I stayed out there for a little bit\nI did some interviews\nAnd did some videos and stuff\nAnd then I went back to Florida\nAnd me and ZZ were just like walking like the streets\nWhere it's like going to the beach and stuff\nAnd people kept taking pictures of me\nAnd they kept like\nWe kept getting into fights\nAnd like even some of ZZ’s friends got into fights about me\nAnd I was getting sued for it I was getting blamed for it\nSo I then I hired my body guard Frank (hey I'm Frank)\nBecause he a big ass muhfucker\nAnd he'll beat up everybody and they mama (just go fuck yourself)\nSo me and ZZ had went somewhere with one of her friends\nAnd we ended up getting tattoos that night\nAnd I didn't tell Adam I was gonna do it\nBecause I didn't think he would care like\nI didn't think he really like gave a fuck\nSo I ended up getting a tattoo\nThe tattoo I have on my arm (it says family first)\nAnd I went home and Adam had called me and he-\nOr he FaceTimed me and he seen it\nAnd he was like \"Oh my god\nYou're going to fucking-\nYou're- you're- you're going back to LA\nI can't have you out here doing this shit\" (I can't have you out here doing this shit)\nLike you're going to fuck yourself\nYou're going to get in trouble\nThis is not happening anymore\nSo before he had sent me back to LA\nThat day I met this girl Gabby\nWho I then started dating or talking to for a couple months (I don't know why... I really don't know why)\nAnd I was living with her in her trailer\nAnd it was crazy like every time I'd go outside\nLike there was all the neighborhood kids were surrounding like her house (everyone wanted to see me and take pictures)\nAnd meanwhile while my dad was trying to get back in my life\nAnd I didn't understand why\nSo I told him like no I don't want you to be in my life\nLike 14 years and you haven't been here\nNow all of a sudden\nYou see I have fans and followers and all this\nAnd now you wanna get back in my life like no\nIt's not gonna work that way (nope)\nHe didn't like that so he went to press\nHe went to other cops (everywhere you could imagine)\nHe went to news stations\nAnd other TV hosts and all this shit\nFacebook, Instagram, Twitter (dumbass)\nTalking all the shit he possibly could\nJust trying to sabotage my whole career that wasn't a career yet (he just wanted money he just wanted his voice to be heard)\nHe wanted to make sure that every time I went to court\nHe went as well and tried to fuck shit up\nHe lied to the judge, told the judge I was suicidal\nTold the judge I needed sexual ed classes\nLike just a bunch of unnecessary bullshit\nSo fast forward fuck my dad (fuck his bitch pussy ass)\nThen my manager was like \"okay let's go to this recording studio\nI have a few people I want you to meet\"\nSo I went there, I met this A&R, Aton (what's good Bhad Bhabie?)\nAnd he was like well we have this song\nLike \"we want you to record it\nWe want to see how you sound\" (we gotta try this out, lets try this)\nAnd it was just literally just\n\"Hi Bich, Hi Bich, Hi Bich\"\nIt was not no other (it's just a hook right now but we'll work on this)\nNo other lyrics\nIt was just a beat and the words \"Hi Bich\"\nSo we made some verses and finished the hook (Yo, Aton, this shit is fire)\nAnd Aton loved the song (Dan, Adam, Mike, Caren, call the lawyers)\nAnd he was like \"You know what?\nYou're gold, I wanna sign you\"", "image": "https://images.genius.com/9a9aad1d603e579226342fc86cfe53eb.562x562x1.jpg", "year": "2018-09-18", "title": "Bhad Bhabie Story (Outro)", "album": "15"}]}