{"artist": "Wrekonize", "songs": [{"lyrics": "[Verse 1 - Blueprint]\nI don’t let the drums dictate the way what I spit/lay\nOr if the rhythm of it’s what makes it great\nI listen to it, then when I hit play\nMy mind drifts into a place 50 years away\nI see what would’ve been, if I let the pen lay:\nThe old me got so many things to say\nBut nobody listens ’cause his beard is grey\nSo he tells me to get back here and seize the day!\nSee… I don’t need peace & quiet\nI really don’t like it, it really ain’t the way\nCool concept, but hardly inspiring\nWhen peace is the only thing you see every day\nNow I don’t think we need riots\nOr all types of violence, for things to be okay\nBut in terms of environment, we need something to fight against\n’cause most great art can’t exist without pain!\nCut off your own ear if it gets you to paint\nTell us that you do it for the people that hate\nCan’t enjoy the sun unless you sit through the rain\nAgain: most great art can’t exist without pain!\nMary J. Blige, Billie Holiday\nCharlie Parker, John Coltrane\nJimi Hendrix, Kurt Cobain\nRoger Troutman, Marvin Gaye\nSee? You ain’t got nothing to save\n’cause everything about you is safe\nYou live in the prettiest place\nRivers and lakes, makin’ serious cake\nYou talkin’, but I ain’t hearin’ them thangs\nSleepwalkin’, you ain’t even really awake\nToo often, this is how you spend all your days\nIf this really the case, then it’s really a race\nAnd maybe that’s why I can’t fuck with you\nYou too comfortable, you too huxtable\nPolice don’t even fuck with you\nYou ain’t seein’ ’em leavin’ people bleedin’ right in front of you\nAll I see is white T-s, and popped collars\nPitbulls and rottweilers\nPeople who ain’t got options\nMight as well keep the block poppin!\n\n[Hook]\n\n[Verse 2 - Wrekonize]\nYeah… Ha!\nI could’ve changed a life, could’ve prevented one\nThe way it ended up, I must say I’ve regretted some\nThey said I meant you wrong, and now my head is numb\nI know I walked the line, but never did I pretend to run\nI wrote this verse in blood, I’m drinkin’ Heaven’s rum\nHoping the Armageddon comes, I’m it’s second son!\nYou quoted words of mine and truly as that record spun\nI heard the devil hum those melodies I’ve been affected from!\nIt leaves me breathless, empty lungs\nSenseless, head is but a vessel for the medicine!\nI spit pain, backflippin’ off of rebel’s tongue\nNegative and never fond, this Netherworld has severed some\nAnd when it’s all said and records done\nYou see I make sure to reflect the one emotion most would never strum\nI like my mirror with cracks, don’t ever change\n’cause most great art can’t exist without pain!\n\n[Hook]", "title": "Pain", "year": "2013-01-31", "album": "The Rooftops Mixtape", "image": "https://images.genius.com/88e068903a4f33a883dd03382fcde905.700x700x1.jpg"}]}