{"songs": [{"title": "Say A’", "album": "The Bigger Artist", "year": "2017-09-22", "image": "https://images.genius.com/7d94aecd396a79046cef20ef7fdead34.640x640x1.jpg", "lyrics": "[Intro]\nNess on the beat\nWhat the fuck I'm supposed to say?\nWhat the fuck I'm supposed to say? Ayy\n\n[Chorus]\nWhat the fuck I'm supposed to say?\nPolice pull me over, they ain't got nothing to say\nI told 'em, \"I got tints because I'm rich\", they said, \"Okay\", ayy\nGotta pray a lot niggas get shot up everyday, ayy\nHold up, what the fuck I'm supposed to say?\nPolice pull me over, they ain't got nothing to say\nI told 'em, \"I got tints because I'm rich\", they said, \"Okay\", ayy\nGotta pray a lot, niggas get shot up everyday, ayy\nHeard you got a big body but a little face, ayy\nGot a 41 bezel, it's 100K, ayy\nIf I feel a way then I'm gon' say it to your face, ayy\nIf I play the block today, I'll make 100K, ayy\n\n[Verse 1]\nYeah, I just might make 100K, yeah\nIf they put a price on me, I'll double what they pay, yeah\nThey say they don't like me, give a fuck 'bout what they say, yeah\nI could take your bitch and make you think about what you say, yeah\nI'm gon' put her in a leg lock like MMA, yeah\nI'm gon' let her give me head twice if she don't say shit\nIf she ever turn sherm on me then she basic\nCouple bitches had to swerve on 'em, I updated\nYou pulled up with her, she ain't leave with who she came with\nShe deserve better, you's a bird, you's a wasteman\nFuck a umbrella, change weather in my spaceship\nDiamonds dancing, I'm two-stepping with my bracelet\nSo, get the fuck up out my face\nI'm just on my way to get this money and I'm late, okay\nIn the strip club throwing twenties like \"I'll be okay\"\n100k a day, trap booming like an 808\n\n[Chorus]\nYeah, what the fuck I'm supposed to say?\nPolice pull me over, they ain't got nothing to say\nI told 'em, \"I got tints because I'm rich\", they said, \"Okay\", ayy\nGotta pray a lot niggas get shot up everyday, ayy\nHeard you got a big body but a little face, ayy\nGot a 41 bezel, it's 100K, ayy\nIf I feel a way then I'm gon' say it to your face, ayy\nIf I play the block today, I'll make 100K, ayy\n\n[Verse 2]\nHold up, talking shit don't ever get to me\nWhen they see me now, they'd better have that same energy\nIn abandoned houses, in and out, it wasn't shit to me\nWhen you see me now, don't try to act like you remember me\nThen look at me now, bitch I'm drowning\nAnd my hoodie Saint Laurent, it's a thousand\nAnd we come straight out the Bronx so we wildin'\nShoutout BK, free Bobby and free Rowdy\nFree my nigga V12, holla if you see 12\nFebreze, believe me, it'll cover the weed smell\nI probably got 3 mil', sitting in my email\nSo much on me, they second guessing what we sell\nSo much money on me, fuck it if it's dirty money\n'Cause I earned it, you get murked if you come searchin' for me\nWhen the police pulled me over, I had 30 on me\nWhat the fuck I look like with less than 30 on me, nigga?\n\n[Chorus]\nYeah, what the fuck I'm supposed to say?\nPolice pull me over, they ain't got nothing to say\nI told 'em, \"I got tints because I'm rich\", they said, \"Okay\", ayy\nGotta pray a lot niggas get shot up everyday, ayy\nHeard you got a big body but a little face, ayy\nGot a 41 bezel, it's 100K, ayy\nIf I play the block today, I'll make 100K, ayy\nIf I play the block today, I'll make 100K, yeah\n\n[Outro]\nI'll make her say a'\nI'll make her say a'\nI'll make her say a'"}], "artist": "A Boogie Wit da Hoodie"}