{"songs": [{"year": null, "image": "https://images.genius.com/f1406e41cb3b32d036b612619107dd3d.500x500x1.jpg", "title": "Evolution Of Elevation", "album": "Evolution of Elevation", "lyrics": "(Intro)\nYeah, one time for they mind baby\nKeep the wicked numbers away haters\nI know y'all want some, but'chu can't get none\n\n(Hook x2)\nAnd what I'ma do is just keep them away without worryin about a thang\nAnd you know my name\nI'm not takin the blame, not playin a game\nEvolution of elevation is way bigger than your big bank\nExplain to me breath\nExplain to me breasts, explain to me death maaayn\n\n(Verse 1)\nHeaven is high\nHow you doin it as I'm walkin by\nI've been in a flurry of war, and enemies ain't talkin right\nI don't have the time, ain't expectin no love up in here\nAllah I pray you forgive me for closin my eyes and ears\nNobody want to tell the truth [shh] nobody is real\nEverybody tryina cover up what's already revealed\nWhy am I tortured just for tellin the way it really is?\nNo questions asked, I'ma pass, I don't want none of that ass\nI don't need, lead, that a fig\nI can walk around here naked\nNo I'm not Mr. Shakur, I'm so secure in the matrix\nI'm bakin up in this blanket, your fire is childs play\nChucky, I'll stomp you to pieces, and take him out my way\nWe prayin like everyday, see you at the +Crossroads+\nI'm gonna miss everybody, cryin for the lost souls\nCrosses, fire, and crossbows\nThe righteous that lost those\nMy titans and corn-rows, igniting and turn slow\n\n(Hook x2)\nAnd what I'ma do is just keep them away without worryin about a thang\nAnd you know my name\nI'm not takin the blame, not playin a game\nEvolution of elevation is way bigger than your big bank\nExplain to me breath\nExplain to me breasts, explain to me death maaayn\n\nAnd what I'ma do is just keep them away without worryin about a thang\nAnd you know my name\nI'm not takin the blame, not playin your game\nEvolution of elevation is way bigger than your big bank\nExplain to me breath\nExplain to be breasts, explain to be death maaaayyyyn\n\n(Interlude)\nNow what I want you to do right here man-\nIs I want you to flip it like you used to flip it way way back in the day (Maaaaaayyyyyn)\nYou know, you gotta get back to that man (Maaaaaayyyyyn)\nYou know what I'm sayin?\nRight before you had cut your hair, man\nI want you to flip it on 'em, baby (Maaaaaayyyyyn)\nHolla, cool\n\n(Verse 2)\nGenerals sit at the desk\nThen we take a test, we sellin ourselves in unison\nAnd if woman'll miss us\nThe moment of you and then everything that he was doin then\nSee Heaven is high, now get with the real\nWe studying Islam, people\nWe walkin alone, without any help, and duckin like every evil\nIs there anything that you want me to tell you?\nAre you learning anything new on this internet?\nBut now you got something that you can come listen to\nGive 'em the real on these politics\nIt's more and more obvious\nNever oblivious to any negative thinking\nCause we are the warriors, slaves of Allah\nWithout any negative drinking\nYou know what I mean\nNo need to go further and further, the burner is serious\nWe keep to ourselves, with nobody else around to make us delirious\nIf I can't be as sloppy, just pop me\nWe drippin, we movin like militant soldiers\nNo what will you feel when all the ascensions are going around your shoulders?\nRocks are bigger than boulders\nWhether it's Colorado or if it's California\nThe haters are demons, just lookin for war\nNow watch when they runnin up on us\nIt's only they jealousy, they'll never win\nThey'll only be mad cause we back y'all\nAnd it ain't a need for me to worry, Allahu Akbar"}], "artist": "Bizzy Bone"}