{"artist": "50 Cent", "songs": [{"album": "The Kanan Tape", "image": "https://images.genius.com/7fcd2b52ce6617033572ef90e82560d9.800x800x1.jpg", "title": "Burner on Me", "lyrics": "[Hook]\nI got a clip for a nigga tryna stunt on me\n(Stunt on me, stunt on me)\nI put a bullet in a nigga tryna front on me\n(Front on me, front on me)\nI got that burner on me, I-I-I'm up now\nI'm strapped bitch, we ballin'\nI got that burner on me, I-I-I'm up now\nI'm strapped bitch, we ballin'\n\n[Verse 1]\nSo what you got a Benz? I buy my bitch a Benz\nThem niggas you be fucking with, I wouldn't fuck with them\nI'm on that brick shit, you still on that block shit\nI sell them whole ones, you sell ten dollar rocks, bitch\nMan, get your weight up, I said get your weight up\nStay in your place 'fore you get your ass sprayed up\nMan, I ain't ever scared, I got all kind of guns\nI'm getting plenty bread, I throw the hoes to one\nStrip, bitch, you heard me? I said strip, bitch\nI'm cold as ice, check the temperature on my wrist, trick\nI blew three hundred grand, what kind of watch is that?\nI bet you wanna know, stop tryna jack my swag, ho\nGucci, Fendi, Prada and that Louis, now I'm hotter\nSo it's Tom Ford and Armani, YSL, I'm fly as hell\nI be Louis Vuitton swan with my hair mask on\nI look good enough to eat, your bitches suck me and all fuck me\n\n[Hook]\nI got a clip for a nigga tryna stunt on me\n(Stunt on me, stunt on me)\nI put a bullet in a nigga tryna front on me\n(Front on me, front on me)\nI got that burner on me, I-I-I'm up now\nI'm strapped bitch, we ballin'\nI got that burner on me, I-I-I'm up now\nI'm strapped bitch, we ballin'\n\n[Verse 2]\nYou say you hard as a motherfucker, you goin' H.A.M\nWe're strapped in this motherfucker, now understand\nBanana clip, banana split, I be on some gangsta shit\nDump 30 here, dump 30 there, I make it hot up out this bitch\nMy diamonds bigger, grimy niggas, city slicker, pull the trigger\nLine a nigga, it's a stick up, money pick up, dust kick up\nTires screeching when I'm reaching, 50 preach in church, bitch\nThis is pimping, fuck around and end up in the worst shit\nHollow tip, .40 mag, bloody rags, toe tag\nBody bag, killer swag, blood all on my Gucci shit\nNow I'm mad in the Jag, same day, this is bad\nFucking fag, look at your ass, why you make me do this shit?\nI'm built for this, so I was told\nSince mama gone I've been on my own\nI'm for real about it, man, fuck how you feel about it\nNigga, we in the streets, that's why we holdin' heat\n\n[Hook]\nI got a clip for a nigga tryna stunt on me\n(Stunt on me, stunt on me)\nI put a bullet in a nigga tryna front on me\n(Front on me, front on me)\nI got that burner on me, I-I-I'm up now\nI'm strapped bitch, we ballin'\nI got that burner on me, I-I-I'm up now\nI'm strapped bitch, we ballin'", "year": "2015-12-09"}]}