{"artist": "Benzino", "songs": [{"lyrics": "[Napoleon (Benzino)]\nDon't worry soulja (Made Men, Outlawz)\nYo, pain ain't nuthin but a part of the game\nThey got us real fucked up\nAin't nuthin but a part of the game, deal wit it\n\n[Napoleon]\nLife -- is a hustle, I got my .45 waitin to bubble\nI lost a lot of my loved ones to the struggle\nIt's like I'm holdin back my breath through a muzzle\nIt's like I got one more piece to complete the puzzle\nYou only got one chance cuz I don't love you\nAnd I'll be boned if I cock back and slug you\nFor all my dead niggas, that's above you\nIt's like a feud, my family ain't around they done\nAnd if I lose one more soulja I'ma drown someone\nWho Makaveli? I give you eight to ya belly\nFor Killa Khadafi, please tell the cops to stop me\nMy brother Seeky, I'ma ride all night for ya\nAnd do the same for Gustafa and Big Mike soulja\nThis to my main man comin from a Made nigga\nI feel your pain, hold ya head, let's get paid nigga\n\n[Benzino]\nYo hear my number Polly, call me\nAnd anytime you wanna talk about the situation, involve me\nI understand just what your goin through\nI lost niggas too.. I shed tears too..\nI can't cry no more, yo Tony what'chu die for?\nThree strike 915 is what I ride for\nYou and Roc hold it down, we aight (we aight)\nWe with the Outlawz, sippin Henny all night\nBeen goin through that shit since day one\nI think I live this long, cuz I live by the gun\nBut that's the question, I know my life is dee-per so feel me\nCheated death many times when niggas tryed to kill me\n\n[Chorus - Young Noble]\nI feel yo' pain! - Sick torment 'til he's guarded\nKeep us caged like dogs, go to shit in the yard\nI feel yo' pain! - Drownin in the rain and shit\nThe only thing that's fucked up, we can't change this shit\nI feel yo' pain! - Nigga yo I'm just like them\nWhen I was broke on the block I had clips like them\nI feel yo' pain! - Speak it to ya straight from the heart\nNo matter what you come across you gotta live, get lost\n\n[Kastro]\nAin't nothin to fear in this love affair, when shared with the streets\nI'm in deep losin all kinds of sleep\nAin't no love, so my eyes don't blink\nAnd I'm so shell-shocked I need to see a shrink\nIt stink, stinks so much I can't think\nAnd when it hurts too bad, I numb it up with a drink\nAnd chase my liqour with a bad temper\nToo fuckin blind for the big picture\nLosin my mind, it's just a sign of the times\nAnd when my loved ones go, part of my insides dying wit 'em\nShit, ain't nobody to blame, can't nobody complain\nCan you feel my pain?\n\n[E.D.I.]\nWould you look into my world and tell me what you see now?\nNothing but emptiness, God replinish this\nFuckin with Devils shit I'm tryna stay righteous\nLosin my love I ain't felt pain like this\nStart of this motherfuckin game wasn't nice shit\nI fuck around lost the one thing priceless\nCars and broads won't do, dawg'll slice shit\nI'm just passin the time until my number hit\nFuck it I'll run wit it, until I feel I'm done wit it\nStack up the ones and let my sons come up rich\nClutchin a piece of the past, I move on\nUsing this pain to keep a nigga strong\n\n[Chorus - Young Noble] 2x\n\nI feel it...", "image": "https://images.genius.com/ab64bde2620df28863f2c6355a1da426.600x600x1.jpg", "year": null, "title": "Feel Your Pain", "album": "The Benzino Project"}]}