{"artist": "A$ton Matthews", "songs": [{"title": "PRÆY", "image": "https://images.genius.com/103d9253d69ccc9cdf420e8f83e30587.500x500x1.jpg", "album": " A$ton 3:16", "lyrics": "*glass shatters*\n\nHahahaha (yeah)\nCan I get a hell yeah? (brick)\nCan I get a hell yeah? (flair)\n\nFor god so loved the world\nHe sent his only begotten son to guide the way\nAnd I am the way\nThat’s soon to be ?\nY’all welcome\n\nBackpack with a deuce-deuce\nDuck duck a goose goose, get a zoot suit\nDay or not it’s a lose-lose when my troops shoot\nShoot through, magazines brought the news crew\nEra of the sidekick snitching\nWork in the sock, nigga skipped those classes\nBlick on the hip, if you slip, we blasting\nLook both ways cuz them fingers spell action\nCome from where they hit-and-run\nNo matter who you hit just as long as you get it done\nGet backs, never one on one\nThey’ll hit you where it hurts if you fucking run\nNo lacking they clapping\nNo questions just action\nGet hit `fore you know what happened\nSo tragic\nY’all some dead motherfuckers\nI can tell if the squad late\nYoung Brick Flair, used to have the product in the hallway\nEight shots, homie, broad day\nHad them white hoes, nose trapping off of Broadway\nNigga I said that before\nRun up in your shit like I been there before\nGimme what you got, gimme what you got\nGet it under pressure when it’s hot\nProduct of the block, show you what you not\nWoo!\nYou call it beef and I call it war\nOne of mine, that’s ten of yours\nLost in the paranoia\nNiggas take a life just to settle score\nShoot first cuz you never know\nWhen the lord gon be sending for ya\nParanoia got me ready for it\nForgive me lord if I send em for ya\nLiving for the days where I ain’t have it\nMama working overtime just to manage\nWhen the pastor was passing on a passage\nI was working overtime, passing off a package\nLet my chain swang to my dick\nTre 5-7 aim for the fence\nBlack gloves they ain’t got a finger to print\nMasked up like a St. Lunatic waiting to trip\n\nOh lord, all my young killas go hard\nOh god, chopper left him no jaws\n\nLet us pray, and they plotting on my name\nBut they ain’t eating’ off my plate\nGod calling’, let him wait\nLet us pray, let us pray\nGod calling’, let him wait\nIf he tripping’ let it spray\nGot a body on the way\nNow let us pray", "year": "2014-03-16"}]}