{"songs": [{"year": null, "title": "Blown Away Pt.2", "image": "https://images.genius.com/97e5f72432c5b33084c28f136249f9b1.442x442x1.png", "lyrics": "Saigon, stic.man, dead prezidents\nBlown away, could be any one of us\n\n[Stic.man]\nI pour some water on the ground for the soldiers that's fallen\nThose who paid the ultimate price when they answer they callin\nTo all the martyrs that we lost as a people in common\nYou got blown away but you didn't go in vain\nTrue examples of change on the frontline of the battle\nBrothers like Bunchy Carter, stood up and rolled when it mattered\nWasn't a hidden agenda, wasn't Maulana Karenga\nHe got blown away, still unknown today\nJohn Lennon and Gandhi, both were proponents of peace\nSpiritual message they taught, millions of people they reached\nSuited devils amongst plotted the dark and the light\nBoth got blown away so bearin this Glock is my right\nIs there a message encoded deep in the violent display?\nRenderin people afraid, keepin the movement at bay\nCOINTELPRO is alive still to discourage the rise\nLeaders get blown away, the media covers our eyes\nModern-day genocide, what hope is there for tomorrow?\nWhether it's vertical or the violence is horizontal\nI lost too many cousins but was it the bullets that took you?\nOr was it the, situations society put you?\nThough I rally for peace, still I carry my piece\nI keep it free of debris, I keep it oiled and greased\nThey say it's freedom of speech but just watch what you say\nBefore your face on a shirt, like \"He got blown away\" (uh)\n\n[Hook: Saigon]\nI knew a rapper that just rhymed of his dope and his grind\nBut heard a dead prez record that opened his mind\nYou know what happened the second he pressed play? (what?)\nHe got blown awayyyyyyy (yeah)\nThis other kid had never listened to S to the A (nah)\nSo yesterday I gave him a couple records to play (yeah)\nHe heard \"Clap\" and the shit that I did with Trey\nHe got blown awayyyyyyy\n\n[Saigon]\n(Go 'head) I pour some Henny on the floor for every young boy\nMurdered in Baltimore, Watts to Little Rock, Arkansas\nPhiladelphia, D.C. to Chi-Town (Chi-Town)\nAnd every other ghetto where niggas get shot down\nThe drama's pitiful, little niggas is homicidical\nWe ignore the fact that all the crime is political\nWhen somebody's blown away, somebody's gone away\nPrison population inflatin, the shit grow e'ry day\nIt's usually us, that's occupyin the Riker's bus\nIt's more than us fightin just, this shit is a crisis cuz\n350 million guns in United States\nY'all callin my music conscious, I'm callin it wide awake\nThe ghettos that I escape, a lot of others succumb\nIt's hard when your pops a crackhead, and your mother's a bum\nAnd you discovered the slums is not a place you should stay\nBut the only way to leave there is for you to get blown away\n\n[Hook]", "album": "The Greatest Story Never Told 2: Bread And Circuses"}], "artist": "Saigon"}