{"artist": "C-Rayz Walz", "songs": [{"title": "Brain Dead", "album": "Limelight (The Outroduction)", "year": "2003-02-03", "image": "https://images.genius.com/1c7f1f5dcacc3e1fa80d314a70a561d0.600x600x1.jpg", "lyrics": "[Intro: Sample from Ninja in the Dragon's Den]\nListen, you little faggot.  If you keep falling on your ass like that, you’ll suffer brain damage\n\n[Bridge: C-Rayz Walz]\nAllow me to crush your dreams\nAnd now we may discuss the thing\nGet big, I’ll detach your wig\nCultivate pyramids and build for kids\n\n[Verse 1: C-Rayz Walz]\nEverything in the cycle, your demonic genre\nWill be clutched by the powerful force of karma\nYou think characters is cool ‘til they frostbite\nShowing and proving.  A wise fool must knew and lost sight\nHome is where the heart fits\nBelieve in God, but tie your camel before you cross the River Styx\nDance with the wolves.  Don’t scale full moon in your sheep skin\nSpiked, yellow casket dead on the point—sleeping\nFlood the industry and wear these high waters\nGet your potato head bashed, smashed into a side order\nScientific torture.  These black dots\nLittle respect in the white backdrop—Ravipops\nYou blue bloods want to trap me.  Exactly\nIgnorance is bliss—dig this—I ain’t never been happy\nThe gift of the verse, the trick of the curse—watch me carry it\n‘Til I go chrome and Swing Low in a Street Chariot\nCarry me home, let Harriet tally my bones\nAnd winter poems, holmes.  Make sure you bury the tome\n\n[Hook 1: C-Rayz Walz]\nBrain!\nBrain dead.  Brain dead, brain dead (You know you)\nBrain dead.  Brain dead, brain (B-b-b)\nBrain dead.  Brain dead, brain dead (We all)\nBrain dead.  Brain dead!\nIf the mood is right and the music’s tight\nIf you use your sight, you won’t lose the fight\n\n[Verse 2: C-Rayz Walz]\nAccept death as the ultimate consciousness\nI’m confident.  Confusion is bondage, kid\nPhysical chemicals create elegant beams\nThat turn men to mice just to make elephants scream\nAt least my theme’s original!\nBehold the dream of the most seen invisible\nYou a liability.  ‘Cause of my lie ability, I’m peace\nBut the truth is you an enemy (Enemy)\nCry freedom!  This is hate crime immunity\nBassline in tune with the groove of the community\nAnd you falsehoods never give to ghetto youth\nOn behalf of my A-side, this is what I B/be living through\nGrace and grit.  You exist as a waste of spit\nReshape your greatest light to a ink blot drip\nGet Buzzed like Lightyear peers of infinity\nAnd my walk is much worse than your biochemistry\nYou hold heat?  So?  What we carry’s hotter\nBuck 50 on your head now like Harry Potter\nYou just Spud Webbs playing D on Shaq\nI’m beyond gats and neon plaque—I’m eon fucks\nYou peons, black.  Neo cuts “Degrees” on wack\nI leave y’all stucks to bleed on hacks\nAnd the facts could stack to put me on maps\nYa?  (Ya?).  Tell the streets I done it\nMy speech peach reaching sonic summit\nLines hook—it’s a mind jux.  Exactly\nBesides, you don’t want blood on your khakis\nFrom being\n\n[Hook 1: C-Rayz Walz]\nBrain!\nBrain dead.  Brain dead, brain dead (You know you)\nBrain dead.  Brain dead, brain (B-b-b)\nBrain dead.  Brain dead, brain dead (We all)\nBrain dead.  Brain dead!\nIf the mood is right and the music’s tight\nIf you use your sight, you won’t lose the fight\n\n[Hook 2: C-Rayz Walz] (x4)\nI will kick my feet\nScratch my dick and fix you something to eat"}]}