{"artist": "Boosie Badazz", "songs": [{"album": "Every Ghetto Every City Vol. 1", "title": "Fly Away", "year": "2015-03-27", "lyrics": "[Hook: Boosie Badazz]\n\nSometimes I wish I could fly\nSo many wish they could ball\nSo many names on the wall\nToo many gangstas on the yard\nProbably the realest shit I ever wrote\n\n[Verse 1: Boosie Badazz]\n\nSometimes I wanna fly away from all this money madness\nBut I think about it, how many people wish they fuckin' had it\nImma be all the way one hundred, miss my fuckin' daddy\nMiss my nigga right now, josin', making commissary\nWe pack the mortuary, this life is dark and scary\nYou can't trust too many, gotta know who against me\nI take shots of Henny, man, I need a break\nI'm two steps away from clickin' 40 minutes straight\nI make the real relate, real music gave back to the hood\nSo tell me this (nigga), how could you hate?\nSlander me in the news. Press conference around my crews\nMany nights I wanted to fly away and give my kids my dues\nI know some niggas in the booth, wish they had ten thousand dollars\nKnow some niggas up in jail, wish they woulda been a scholar\nModel citizen, you trippin' if you ain't feeling it\nEverybody go through roller coaster rides\nI miss my granny, I ain't lying\n\n[Hook: Boosie Badazz]\n\nSometimes I wish I could fly\nSo many wish they could ball\nSo many names on the wall\nToo many gangstas on the yard\nProbably the realest shit I ever wrote\n\n[Verse 2: Boosie Badazz]\n\nDamn, that nigga wanna ball like me\nDiabetes, enemies, you want it all like me\nWhere people take your words and twist it\nOn parole, still pissin'\nMad, wishin' somebody'd make some more real ass niggas\nNobody showing love. This how we growing up\nDon't know if we gonna see tomorrow, this why we showing up\nBetter do something if you wanna ball\nYeah we do something, my niggas on call\nJust looked at a picture of six niggas. Only two of us now\nYour honor, I've been doing right. I don't want no trouble\nP.O. I just wanna feed my family. I just wanna travel\nI know you tired of goin' to college, but don't wanna tell daddy\nGot a vision, but your vision come up a different alley\nOf yes sir's and no sir's\nAs a child I wanted to fly away from junkies, Budweiser's, lies and cuss words\nGot in them streets and I realized\nNo matter how good you gonna still die\nTears come to my eye for Bleek and Ivy\nSo many niggas cross the wall\nWish they could ball again\nHomicide, momma cryin', they got her son again\nHurt the whole family, ripped they pride away\nLittle sister wanna fly away\n\n[Hook: Boosie Badazz]\n\nSometimes I wish I could fly\nSo many wish they could ball\nSo many names on the wall\nToo many gangstas on the yard\nProbably the realest shit I ever wrote\n\n[Verse 3: Boosie Badazz]\n\nCan't forget my niggas who, they gave a life sentence to\nLil Joe, Dan, Mike Fleet and Moo, my penitentiary crew\nI know you wanna fly away sometimes. That shit be hittin' you\nConvicted as a killer, but don't let your mind be convicted too\nThe police killing niggas. Niggas playin' it south\nDamn, that nigga killin' now. He's a fuckin' cause\nShit, put my name on the wall with them wall niggas\nThe two new Craigs, both hit with the flame, yeah ya'll niggas\nFly away, God help me. Luvah just lost his nephew\nStill a young nigga, I left he was seven\nMookie still cryin' tears and it hurt my heart\nMake you wanna fly away, when they murk ya boy\nI know your pain lil' momma. You want the Hollywood lifestyle\nThe lights, but it's hard, cuz your from Alabama\nHurtin' inside, but smiling for the camera\nShit, so much pressure you feel like giving up\n\n[Hook: Boosie Badazz]\n\nSometimes I wish I could fly\nSo many wish they could ball\nSo many names on the wall\nToo many gangstas on the yard\nProbably the realest shit  I ever wrote", "image": "https://images.genius.com/06130230395e4f33b3841585a225fc30.500x500x1.jpg"}]}