{"songs": [{"title": "One For The...", "image": "https://s3.amazonaws.com/rapgenius/brotherali-flag-1.jpg", "lyrics": "Intro:\nYeah. C'mon now. The whole planet. Join in. Right now\n\nLadies and gentlemen boys and girls\nThis is the way that you rock the world (2x)\n\nVerse One [Pigeon John]\nLet me tell you 'bout my gangster wit I don't follow no clique\nI'm quick to flip a dollar out of 15 cents for rent\nI'm a scholar in a blue Impala with dents\nSuch is life a stand up man that bent\nI use this mic and MPC to vent\n2000 ways to slay a beat and hint\nAt what it all means brothers gonna call me dense\nWhen I take my brain and let it touch the rain\nAnd since then I'm a young king in training\nAnd listening to the wind to see what its saying\nIn glimpses sometimes it all seems senseless\nYou trapped outside of white picket fences\nStill gotta figure out a way how to make it real\nIn three ways: sports, crack or a record deal\nAnd the homies know how I feel\nTill I'm on the next level I'm a grind at will\n\nChorus: [X2]\nOne for the money two for the show\nThree for the homies who got in the back door\nOne for the money two for the show\nThree for the honies who got in the back door\n\n2nd Verse [Brother Ali]:\nUs rappers we love to tell the stories again and again\nAbout the burning fire that rages within\nBut all you ever hearing everyday from your friends\nIs that if you leave the herd there's no way you can win\nSo what you gonna think about?\nWhen everything around you is negative including your bank account\nScrapping out a living in a major drought\nWith no avenue to let your angry out\nYou rattle your cage and shout\nYou pray they break you out\nYou stay truly devout\nCause you wade through doubt so deep\nThat you can't tune it out\nBlood boiling and you ain't cooling out\nAnd that's why I stand on every stage and kick that verse\nLike it the first and last time I'll ever say it\nI'm nothing if I'm not dedicated\nEvery win is celebrated for the soldiers that never made it\nTrying to figure out where Awesome Dre went\nAnd why Grand Master Cas still ain't been paid yet\nSo since I'm blessed to run around the nation\nI'm obligated to find a new lane and pave it\nSo if the little homies ever want to disconnect\nFrom the matrix and jump off the slave ships\nAnd when they swim they'll have a destination\nAnd they come right on along and hit the same lick\nIts entertainment but its more than that\nWhy you think Slug took me on the tour in fact?\nWhy you think El-P put his boys on wax?\nAnd why you think Little Brother's in the door like that?\nIts because God gave us something that makes us\nMore than record breaker we're our own saviors\nAsk the average man about taking his life\nIn his own hands\nAnd he won't understand\nThat idea was stolen with the land\nAnd we scrape for the few crumbs that fall from the hand\nLive life hungry work to get bummy\nOr run we they 3, 2, 1 for the money\n\nChorus: [X2]\nOne for the money two for the show\nThree for the homies who got in the back door\nOne for the money two for the show\nThree for the honies who got in the back door", "year": null, "album": null}], "artist": "Brother Ali"}