{"songs": [{"year": null, "image": "https://images.genius.com/343c2c53c7b1f818cf50919e00643c0a.428x428x1.jpg", "title": "About All That", "album": null, "lyrics": "(Verse 1 - Lil Wayne)\nYoung desperado straight out the grotto\nI'm so bad my shadow chooses not to follow\nLittle nigga but see me as a fuckin' rhino\nLil Weezy hit this bitch like Rocky Marciano\nIt's a drought ain't it? How the fuck would I know?\nNigga I been gettin' my Cher in (share in) like Sonny Bono\nI ran the streets... check my bio\nI started high wit' two O's just like Ohio\nI'm fuckin' nuts... cashews\nBut I'm so DC like fat shoes\nI skate away... like later dudes!\nNever get caught baby I'm mashed potato smooth\nAnd just when it stopped... I made it move\nRespect me nigga I'm a dog... no Asian food\nI wet up the party so have a bathin' suit\nAnd daisy dukes you bitch ass nigga\n\n(Chorus - Lil Wayne)\nKeep talkin' that shit that you talkin'\nAnd we gon' have to get into some gangsta shit\nMy nigga... keep talkin' that shit that you talkin'\nAnd we gon' have to get into some gangsta shit\nMy nigga... 'Cause you ain't really even 'bout all that\nYou ain't really even 'bout all that\nAnd don't'cha forget.. I know ya you ain't 'bout all that\nYou ain't never been about all that... fall back\n\n(Verse 2 - Fat Joe)\nNiggas must want Joey to lean on 'em\nFlash the binky splash his dreams on 'em\nLet 'em sleep on it it's nothin' to Crack\nLay the murder game down back to hustlin' packs\nYeah Weezy homie's got yo' back whether raps or macks\nEither way they both spit like BRRRRAT!\nNigga... them muhfuckas is broke like them levies\nAnd we done sold so much dope ain't shit you tell me\nNigga... how you want it ?? coke or dog food?\nMy shit'll have you runnin' naked like an old school\nAnd yeah we 'bout it 'bout it and you ain't ridin' on me\nUnless ya got a whole fuckin' suicidal warmin'\nAnd I'm a rider homie and you can find it on me\nThat 40 cal'll get you ??\nThis shit is funny to me\nAll these niggas frontin' war but they runnin' from me... Crack!\n\n(Chorus - Lil Wayne)\n\n(Verse 3 - Birdman)\nI had 'em as lil' niggas raised 'em 'round real niggas\nPoppin' bottles fuckin' wit' them bitches nigga\nMade money to the ceilin' me and my young nigga\nChillin' I'm in the streets hustlin' gettin' money nigga\nChanged all my new shoes nigga got some new tools\nNigga got some mo' jewels we was gettin' money\nAnd ain't nothin' ever changed still doin' the thang\nStill gettin' money still spendin' change\nWe hustlin' from Sunday to Sunday\nAnd we grindin' everyday like the money ain't comin'\nNigga... yeah we ridin' woodgrains and minks\nGot the dope in the Hummer cold case for that thang\nI hate the law for what they done did they broke in niggas cribs\nWish I woulda caught 'em I'dda split they fuckin' wig\n3rd Ward let me claim my fame\nI put it down Uptown I'ma do my thang believe dat\n\n(Chorus - Lil Wayne)"}], "artist": "Birdman"}