{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/7f54a7e8e35ab0c0025418271ad28431.820x820x1.jpg", "title": "Gun for Gun", "year": null, "album": "The Offering", "lyrics": "[Nas]\nIll Will\nIll Will's alive yea Killah Priest Nasdaq Dow Jones ha ha\n\n(Hook)\nGuns for gun streets filled with rivers of blood\nRaised in the PJ's with real niggas and thugs\nEye for an eye a tooth for a tooth\nBlood for blood coming to a theater near you\nIt's all love\nGuns for gun streets filled with rivers of blood\nRaised in the PJ's with real niggas and thugs\n\n[Priest]\nI'll make Mussolini wear a Kufi\nI talk like Dr. Ben but look like Malcolm holding his Uzi\nPeering through curtains who would I murder?\nPearl silencer screw on my burner four four caliber\nThe new Nat Turner I'll make Hitler wear a yarmulke\nKKK celebrate Kwanzaa\nShould I pursue further?\nI'm like Tutankhamen with the tools in my garment\nPut a few in my cartridge the moon and stars lit\nLight up the hood it looks like a techno club\nWe slam dance to this music when the Tek blow slugs\nIt's ghetto thugs, welfare and poor education and gang love\nSitting in the Federal waiting\n\n(Hook)\n\n[Nas]\nWhat did Malcolm think split second before he was shot?\nDid he think to hit the deck on the floor before he dropped?\nOr did he just say \"Fuck it\" I'm ah die for my brothers?\nCause by killing him just made his words teach others\nLike Martin Luther King he preached peace\nLike the West East beef finally that shit is rotten\nPlace yourself in the shoes of a people's leader\nFrom drug kingpin to President either is off the meter\nYour best man can turn it or squeeze ya burn you and leave ya\nBeside a lonely road or inside a meat freezer\nThat's the way it goes on the 3rd rock from the sun (earth)\nAlone circling the light were we begun where we become\n\nA follower to a general with soldiers to run\nThey move off every word of your tongue\nFearless and ruthless when you was young pulling your gun\nNot scared to shoot shit remember it was all in the fun\nIf it's power you wanted can you control over a hundred minds?\nAnd these are grown men who've killed over a hundred times\nEvery champ team has an arch rival\nAnd it takes one time to mess up and niggas don't like you\nYou start to want peace, niggas want you deceased\nYour money low, niggas want you to go\nWho else but I can bring the most haunting flow? (Nas)\nYou soon to see the best of me\nFrom a boy man to a king hear out my destiny\n\n(Hook)\n\n[Priest]\nWhen my fam is at stake\nI think of how much slander I take\nThen I sit back and watch tapes on Alexander the Great\nI start studying how he bloodied men\nI think of rappers I'm a massacre\nMetal armor cover my skin\nTake me to war, fuck y'all\nPriest is Ivan the Terrible\nStare at my eyes, they're unbearable\nYou collide with the generals\nSurround me like the most high\nSurrounded by Cherubim\nWho'd imagine the illest collabo\nPriest and Nas are incredible\nHe's spits ether, I spit urancha\nDescribe how you devils move\nScream on MC's as I recline on my pedestal\n\n(Hook)\n\n[Nas]\nThe I to the L to the L to the W the I to the L to the L\nTo the W the I to the L to the L\nTo bring trouble to all ya niggas\n\"PRIEST\" \"NASDAQ DOW JONES\""}]}