{"artist": "Pimp C", "songs": [{"album": null, "title": "Midnight", "image": "https://images.genius.com/755227370d0d3fffabe599d486856318.960x960x1.jpg", "lyrics": "[Intro]\nYeah, I know...\n{David Banner, David Banner}\nYou can blame it all on me, it's cool\nHol' up, bitch!\n\n[Chorus: Pimp C (in tune of Kingpin Skinny Pimp's \"Midnight Hoes\")]\nI've been wastin all my time, jumpin in and out my clothes\nI've been wastin all my time, blowin indo out my nose\nI've been wastin all this time, fuckin 'round with midnight hoes\nI've been wastin all this time, guess that's just how my live goes\nMidnight hooooes!\n\n[Pimp C]\nI flip city to city, see ass and titties\nThe booty was good but the pussy was shitty\nShe wanna fuck, I gotta catch my plane\nSo I can get back to the city and grip on grain\nGot a young yella hammer, call the gurl Cocaine\nCause the pussy like dope, swallow it all don't choke\nWith some red pussy hair, nigga; smell it in the air, nigga\nShe don't wear draws, I be beatin the pussy walls!\nPut in work and make the pussy squirt\nThis young don't cum 'til she say, \"Daddy, it hurt!!\"\nMy piece don't pause, stand up in that thang\nWhen my dick get hard, you see that big ol' ass vein\n(Big ol' ass VEIN~!) Hold it open, don't stop\nFanger in ya butt, dick in ya cot\nSuck ya toes, I'm gon' shrimp tonight\nDick make you weak like Kryptonite\n\n[Chorus]\n[Rick Ross]\nHer face was cute, but her pussy was cuter\nSee her with another nigga, all I do is salute her\nCouldn't defeat her, the bitch was a skeeter\nSquares on the Facebook just dyin to meet her\nSo I took her to dinner, the bitch was a winner\nScoop her like spinach dip every time I run in her\nThat ass was soft, pass the fork\nI ate the pussy like pork, now pass the salt\nNaw I'm playin, baby see'm sayin?\nYou got a nice pad and I'm thinkin of stayin\nFeet in the sand, walk in the beach\nWith my finger in the pussy, never argue with me\n\"Kitty miss you, finger it up!\"\nI'm a multi-millionaire, I ain't makin it up (naw)\n\"Kitty miss you,\" yeah I'm crankin it up\nI'm a multi-millionaire, I ain't makin it up, PIMP!\n\n[Chorus]\n[Slim Thug]\nYeah, I got 'em on deck\nSo deep in her mouth, I be all in her neck\nPussy so wet, you can hear it go splash\nDrippin down the cut all down in her ass\nBitch so bad, she a prize to a pimp\nAin't even gotta fuck to get paid by a simp\nTitties so big, face so pretty\nGotta be top three baddest bitches in the city\nMaster in the bed, love to give a nigga head\nAnd'll swallow every drop, yep baby go fed\nStone cold freak, she don't never wanna quit\nYou can fuck her five hours, she'll still want dick\nThick in the thighs, waist the right size\nWhen she walk by, it's too much for your eyes\nFirst time I cut her was a dream come true\nShe had another bad bitch come through too (Thugga!)\n\n[Chorus]", "year": null}]}