{"songs": [{"image": "https://images.genius.com/6d9b19d023bc1a4aaf747cabf6d78531.467x467x1.jpg", "title": "I’m Good (clean remix) (Promo Only clean edit)", "album": null, "year": null, "lyrics": "You can find me in the streets, even in a drought\nMy mattress is full, why shouldn't I be out?\nAy, buddy, I'm good, what that tell ya? I'm good, what they tell ya?\nI'm good, what she tell ya? I'm good, what you see?\n\nFour hundred dollar jeans with my favorite patch\nPulling up my ride, hell yeah the rims match\nWhat that tell ya? I'm good, what that tell ya? I'm good\nWhat they tell ya? I'm good, what she tell ya? I'm good\nWhat you see? Looking good\n\nMan I'm killing it, riding in that brand new\nSwimming through the streets, looking like I'm Shamu\nIn that big body with the wet paint\nI got some pocket change from selling wet weight\n\nToday is a good day, ice cubes on my chest\nLooking at my Blackberry, freak, hit me on the text\nCome and beat it up, I just need a minute\nYou can K ya ass, you ain't gotta lay in it, yes\n\nNiggas don't like you when you lookin' good\nHate it when you shining through the neighborhood\nBrand new ride, niggas know the time\nHo's cut they eyes, we call them samurais\n\nFly as I could ever be\nA level of success that you could never see\nYou jealous mayne, we in propellas mayne\nThink about it, ain't shit you could tell us mayne\n\nYou can find me in the streets, even in a drought\nMy mattress is full, why shouldn't I be out?\nAy, buddy, I'm good, what that tell ya? I'm good, what they tell ya?\nI'm good, what she tell ya? I'm good, what you see?\n\nFour hundred dollar jeans with my favorite patch\nPulling up my ride, hell yeah the rims match\nWhat that tell ya? I'm good, what that tell ya? I'm good\nWhat they tell ya? I'm good, what she tell ya? I'm good\nWhat you see?\n\nYou can test it out ma, tell me what you see\nOrder what you want, hell yeah it's on me\nDon't it tell ya I'm good? What that tell ya? I'm good\nWhat they tell ya? I'm good, what she tell ya? I'm good\nWhat you see? I'm looking good\n\nCrusin' on them 22s, got me sittin' pretty\nYou should hear that engine purr, here kitty-kitty\nRide through the city, everybody know me\nAnd the sun is out, it's like it's shinin' on me\n\nShoutin' out the homies as I breeze by\nI'm on cloud 9, and I ain't even high\nTold my shawty I'll be back, and I ain't even lie\nThem VVS' be the best money can buy\n\nI see you flirtin' baby, them jeans is painted on her\nMama looking right, and I don't even want her\nNo need to take it personal, but that just how it be\nNo disrespect to you, I'm just enjoying me\n\nFinally I'm free, all my dues paid\nThem yellow diamonds got the charm like it's Minute Maid\nAnd I'm lookin' good, and I'm feeling good\nTry and stop my shine, I wish a nigga would\n\nYou can find me in the streets, even in a drought\nMy mattress is full, why shouldn't I be out?\nAy, buddy, I'm good, what that tell ya? I'm good, what they tell ya?\nI'm good, what she tell ya? I'm good, what you see?\n\nFour hundred dollar jeans with my favorite patch\nPulling up my ride, hell yeah my rims match\nWhat that tell ya? I'm good, what that tell ya? I'm good\nWhat they tell ya? I'm good, what she tell ya? I'm good\nWhat you see?\n\nYou can test it out ma, tell me what you see\nOrder what you want, hell yeah, it's on me\nDon't it tell ya I'm good? What that tell ya? I'm good\nWhat they tell ya? I'm good, what she tell ya? I'm good\nWhat you see?\n\nI'm looking good, I'm looking good\nI'm looking good, I'm looking good\nYeah, yeah, yeah, yeah\n\nI'm looking good, I'm looking good\nI'm looking good, I'm looking good\nYeah, yeah, yeah, yeah\n\nI'm looking good, I'm looking good\nI'm looking good, I'm looking good\nYeah, yeah, yeah, yeah\n\nI'm looking good, I'm looking good\nI'm looking good, I'm looking good\nYeah, yeah, yeah"}], "artist": "Clipse"}