{"songs": [{"lyrics": "[Verse 1: D Nice]\nWell I'm known to wreck a mic like a prince, so all hail\nTo the raw deal, on a scale your style's frail\nI don't believe I can fail, cause I'm headstrong\nYou're trackin' me, plus jackin' me, knowin' that you're dead wrong\nI got a Tec for those that wanna step\nYou're ghost, cause since you're playin' me close you're gettin' checked\nAnd I can't conceive a better way to do it\nSo when you're in my comp, get ready to be stomped, there's nothin' to it\nCause I got piles of wicked styles and files of tracks\nI get wild with a South Bronx style of rap\nSo you think you got rap sewn happily?\nHow's that? You couldn't sow shirts in a factory\nYou're what I label as a hip-hop hypocrite\nYou smile in my face, behind my back runnin' off with lip\nBut I got somethin' to kill that, though\nI'm a real rap pro, bad bro, so now you know\n\n[Hook]\n(The TR 808)\nStraight, straight from the Bronx\n(The TR 808)\nStraight, straight from the Bronx\n(The TR 808)\nStraight, straight from the Bronx\n(The TR 808)\nStraight, straight from the Bronx\n\n[Verse 2: D Nice]\nNow back to the scene of the crime\nI was taught to bust a nine\nAt any and all who's outta line\nYo, that's the way I was shown how to hold my own\nUntil I found other ways on the microphone\nI used to see so many out on the Ave die\nStrung high, playin' a game, and that's why\nSo many up in the Bronx, they got done\nFor livin' a lifestyle of crime like it was fun\nBut now I'm hittin' ya hard and pullin' the cards\nOf those that wanna act a fool, they got schooled\nAnd got caught with a right to the mug\nIt wasn't enough, cause they wanted to bug and caught a slug\nAnd got they bodies just laid to rest\nCause in the streets you gotta get all you can, and no less\nThe first minute you do, you get bucked\nSo you and your crew better duck\nWhen you step into the Bronx\n\n[Hook]\n(The TR 808)\nStraight, straight from the Bronx\n(The TR 808)\nStraight, straight from the Bronx\n(The TR 808)\nStraight, straight from the Bronx\n(The TR 808)\nStraight, straight from the Bronx\n\n[Outro: D Nice]\nCheck it\nI wanna take this time\nTo send this out to my man Dino\nAnd to my man Scott-La-Rock\nCause if it wasn't for them\nI wouldn't be here today\nBut since I'm here\nI'mma continue to make funky music for my brothers\nYou know what I'm sayin?\nI'm outta here\nPeace!", "album": "To Tha Rescue", "year": "1991-11-26", "title": "Straight From The Bronx", "image": "https://images.genius.com/b2d7657f73b5437df65f81efafb363a6.400x394x1.jpg"}], "artist": "D Nice"}