{"songs": [{"year": "2016-12-09", "image": "https://images.genius.com/595a5c53c72195068baa3a2331acf4ef.1000x1000x1.jpg", "title": "Cold Blooded", "album": "Imperator", "lyrics": "[Part 1]\nWährend die Rapszene diskutiert: „Wie könnte Trap auf Deutsch funktionier’n?“\nHaut ihnen der Mac unbeirrt weiter straighten In-die-Fresse-Rap vor die Stirn\nIhr rappt für Autos, Hoes und Silberperlenketten\nIch rapp’, um Macht zu erlangen, um irgendwann die Verbrecher zu ficken bei Bilderbergertreffen\nWas für „Silbenzählerrap“? Ihr hatet nur, weil ihr selbst keine Technik habt\nKein Intellekt am Start, drum fahrt ihr die Realnessschiene auf wackste Art\nWährend ich Business mach’\nDebattiert diese Szene den ganzen Tag über Realness und Autotune - ihr macht selbst aus ’ner Kissenschlacht noch ’ne Wissenschaft!\nYeah, Oldschool-Rhyme - egal, ich schlag' euch rollstuhlreif\nWenn ihr beginnt, auf 'nen Knastaufenthalt wegen Kiosküberfalls stolz zu sein\nVollblutstyle - macht mir nicht auf Ehrenmann mit eurem Alkoholikerleben\nEin Punch an euch hinterlässt astronomische Schäden wie das Ozonschichtproblem\nUnd ihr seid durch den Wind wie mein weh'ndes Versacehemd\nSeht ihr Sterne, wisst ihr, warum man’s „Teleskopschlagstock“ nennt\nYeah, Ruger an meinem Gürtel; ich schmücke mich mit keiner Großfamilie\nDoch habe loyale Soldaten im Rücken, die sich für mich Kugeln einfangen würden\n\n[Hook]\nGib die Banknoten, Bitch! Such keine Antworten, Bitch!\nHat der Boss einmal Gnade, hat’s die Kanone nicht!\nBitch, ich bin cold-blooded\nKein Gewissen, ich bin cold-blooded! Ich bin cold-blooded!\nZu viele Heuchler, zu wenig Kugeln in den Clips drin!\nIch lass’ Blutfontänen spritzen, lass’ das Blut von denen spritzen!\nIch bin cold-blooded\nKeine Reue, ich bin cold-blooded! Ich bin cold-blooded!\n\n[Part 2]\nKollegah der Boss, Player, Geschäftsmann, Erfolgsgarant\nZu einer Hälfte Don Juan, zur and’ren Hälfte Donald Trump\nDie Szene kann mir ein’n blow’n, nur Farid Bang ist mein Blutsbruder\nZwei Kalaschnikows und wir ballern Blei in rappende YouTuber\n*Schussgeräusche*\nArme gestählt, Bart wie die Mähne von Berglöwen\nSchwarzer Mercedes, stapel’ die Knete in Anwesen wie von Herzögen\nIn Eichenholzschränke, Seidenvorhänge, stilvolles Mobiliar\nYeah, ’ne zeitlose Einrichtung wie Casinos in Monte-Carlo\nAlle Neider sowie Hater soll’n sich ’ne Scheibe von Kollegah\nAbschneiden, tut mir leid, doch Platin schneidet man nur schwer, yeah\nIch zahl’ zweihunderttausend Cash für den Bentley\nRauch’ vorm Staples Center ’nen Blunt mit Fetty Wap bei den Grammys\nFliege dann weiter nach Bordeaux, Paris oder Wien, mon ami\nIch hab’ mehr Geld mit Bonds verdient als Sean Connery\nIhr Wannabes nutzt euer Geld für Schwachsinn wie Bitches und Bling\nIch nutze mein Geld, um den Menschen zu helfen, die Opfer der Machtelite sind\n\n[Hook]\nGib die Banknoten, Bitch! Such keine Antworten, Bitch!\nHat der Boss einmal Gnade, hat’s die Kanone nicht!\nBitch, ich bin cold-blooded\nKein Gewissen, ich bin cold-blooded! Ich bin cold-blooded!\nZu viele Heuchler, zu wenig Kugeln in den Clips drin!\nIch lass’ Blutfontänen spritzen, lass’ das Blut von denen spritzen!\nIch bin cold-blooded\nKeine Reue, ich bin cold-blooded! Ich bin cold-blooded!"}], "artist": "Kollegah"}