{"songs": [{"lyrics": "[Intro]\nYeah, yeah, so, yeah, so\nYeah, yeah, so, yeah, so\nYeah, yeah, yo, uh, yo\nI been waiting patient, dawg\nI been faded, chasing dough, uh\nThey been hating, they jaded, I know, uh\nThinking they gon' take it, they wrong\nI'm thinking like, who got the upper hand?\nI'm thinking like, is you really my mans?\nI'm thinking like when I pull out that MAC if it'll jam, yeah\n\n[Bridge]\nI need that\nGot me thinking like I need that\nI need that\nGot me thinking like I need that\nI need that\nGot me thinking like, so\nI need that\nGot me thinking like I need that\nI need that\nGot me thinking like I need that\nI need that\nGot me thinking like, so\n\n[Verse]\nGot me thinking like I need that new Mazarati truck\nThinking like I need a lot of bucks\nThinking like talking that fly shit is gon' get that thottie fucked\nThinking like she fucked a lot of us\nThinking like I need to cop me some hammers\nThinking like free all my dogs out the slammer\nThinking like I'm losing track\nOf all of these groupies, this show money, all of these cameras\nThinking like I need to find me a grower\nThinking like I need a bitch from Samoa\nThinking that she should respect me like H.O.V.A\nThinking that rifle would sound like a mower\nThinking that I just believe I'm the realest\nThinking that all of these pistols conceiling\nThinking that all of them cases appealing\nThinking of stacking this bread to the ceiling\nThinking like, where was you when I was struggling?\nThinking like I was just sleeping on floors\nThinking like I was just resting on couches\nThinking like I was just kicking in doors\nThinking like I was just robbing from houses\nBounce to this, know it\nYou can't deny my influence\nEverything they bragging 'bout, man I do it\nYou talking money, then prove it\n\n[Outro]\nEverything is copacetic\nEverything is copacetic\nAnd I never did regret it\nEverywhere I got the leaded\nEverything is copacetic\nEverything is copacetic\nFuck on your bitch just to prove it\nEverything is copacetic", "album": "Double A-Side: Volume 4", "year": "2017-10-24", "title": "Copacetic", "image": "https://images.genius.com/a980b1bcd03e88610b658e7b00d9e751.1000x1000x1.jpg"}], "artist": "Da$H"}