{"artist": "Problem", "songs": [{"album": "Chachiville", "title": "Keep On Pushin", "image": "https://images.genius.com/0b8764d1237a5e4c830d12f02cc1b589.1000x1000x1.jpg", "lyrics": "[Hook]\nImma keep on pushin\nImma keep on pushin\nStay stayin away from the bullshit\n\n[Verse 1 : Problem]\nChach pull up they know what im all about\nBang my line make sure they call about\nM-O-N-E-Y cause that's what this world about\nSus niggas stay of my line with that hoe shit\nDid I fuck your girl man nigga I don't know shit\nReal to real nigga, go ask that hoe bitch\nGround breaking with it come check how this flo shift\nBeen playin chess y'all still on go fish\n(Imma keep on pushin)\nNever waitin for no dealer to deal mine\nI only hang with your girl to kill time\nNigga stop with that boss shit\nBoy yousa a look out\nPulled up on the side of your whip you ain't even look out\nYou on but your homies ain't, you ain't even look out\nAnd gettin read by the bitches like you a book out\nIf i was you i would chill with that tough shit before you get took out like meat at a cook out\nYa feel me\nCause its a lot going on with me\nThuggin solo like bobby cause niggas singing like the old Whitney\nCause these days in the streets\nMorals is dead as great grandma\nBut in the end dawg\n\n[Hook]\nImma keep on pushin\nStay stayin away from the bullshit\nImma keep on pushin\nStay stayin away from the bullshit\nImma keep on pushin\nStay stayin away from the bullshit\nImma keep on pushin\nStay stayin away from the bullshit\n\n[Verse 2 : Problem]\nMan these hoes gon be hoes don't go bad on em\nWanna get some revenge, stack a bag on em\nCrack a badder one with some ass on her\nSo bad that she say she wanna smash on her\nThen invite her to the spot yeah\nNot yours neutral spot and make sure that Glock there\nCause these hoes can get tricky as a backstreet\nShit ain't wavy, Chach goin out like Max B\nCause all of em got a little brother that bang\nA little cousin that slang\nOr some nigga that hang with some niggas\nThat do they stuff, set you up, be careful when you boo that up\nDiamond Lane untouchable, yeah thats us\nTattle tell outta towners, call our bluff\nPlay cool cause any day we\"ll have your stuff\nAnd ain't a nigga in LA you can call on us, whaaat\nI'm just giving all the facts yeah\nI'm from Compton California where they don't know how to act there\nA nigga still catchin flack there\nBut won't a nigga in that mothafucka say I can't go back there\n\n[Hook]\nImma keep on pushin\nStay stayin away from the bullshit\nImma keep on pushin\nStay stayin away from the bullshit\nImma keep on pushin\nStay stayin away from the bullshit\nImma keep on pushin\nStay stayin away from the bullshit\n\n[Bridge]\nImma keep on pushin\nImma keep on pushin\nStay stayin away from the bullshit\n\n[Verse 3 : Problem]\nHangin out in back like a car fin\nWomen say i act like im dark skinned\nCause every word i say dog my hearts in\nTryna make sure all my counterparts win\nSay litlife cause my life lit\n5 figure shows so the price fit\nBillion dollar goals plus my wife lit\nAnd her pussy feel like a vice grip\nCuz none of these booth niggas had her yet\nStay woke take you adderall\n6 kids, 5 women shit i had to ball\nTommy stashed just incase im in the battle zone\nChop choppin at ya clown asses\nHalf ya favorite rappers was clown dancers\n\n[Problem]\nHey baby\n\n[My Princess Aeryn]\nI love you\n\n[Problem]\nI love you too\n\n[Problem]\nWhat are you doing?\n\n[My Princess Aeryn]\nNothing, just watching tv\n\n[Problem]\nMy phone keep ringing hold on a minute baby don’t even trip ima decline it\nHows yo eye feeling?\n\n[My Princess Aeryn]\nGood, I got the stitches taken out\n\n[Problem]\nBecause you a big girl and daddy loves you whoo whoo whoo whoo whoo\n\n[My Princess Aeryn]\nWhen you gon pick me up?\n\n[Problem]\nYeah ima come pick you up\n\n[My Princess Aeryn]\nWhen you gon pick me up tho\n\n[Problem]\nProbably tomorrow\n\n[My Princess Aeryn]\nOk\n\n[Problem]\nOk we gon hang, and no more accidents ok?\n\n[My Princess Aeryn]\nOk, I already promised never to do it again to do it again\n\n[Problem]\nI know I believe you too cuz you daddy’s big girl\n\n[My Princess Aeryn]\nOk\n\n[Problem]\nAlright Love you\n\n[My Princess Aeryn]\nDaddy?\n\n[Problem]\nYes?\n\n[My Princess Aeryn]\nI also need a uniform for school\n\n[Problem]\nWell daddy going to take care of that ok?\n\n[My Princess Aeryn]\nOk\nLove you\n\n[Problem]\nLove you, bye\n\n[Verse 3 : Problem]\nNow back to you bitch niggas\nGettin money switch niggas\nCheatin on your girl with your homeboy switch hitters\nPut you on a lick but don't think you gotta split with a nigga\nSo fuck it i'll have a nigga from his click kill him uhhhh", "year": "2017-01-20"}]}