{"artist": "Boldy James", "songs": [{"album": "Consignment: Favor For A Favor The Redi-rock Mixtape", "title": "Bank Jackin’", "year": "2012-02-27", "lyrics": "[Hook: Boldy James]\nCock the four pound, and the 74\nPull my mans down, like you ready to go?\nLet off a couple rounds, soon as I hit the door\nEverybody laid down, get down on the floor\n\n[Verse 1: Czar Rae]\nDon't do nothing stupid, you know what we here for\nAll the money is assured, we ain't got to kill folks\nDon't be a tough guy, try not be a hero\nBitch you got your phone out, you think this a fucking joke\nBoy I got the door, nigga just go get the dough\nSlapped him in the head with the burner, just to let him know\n\n[Verse 2: Boldy James]\nMade an example out of him, had to fire the guard\nCaught him reaching for the silent alarm\nHopped the counter on the teller, grab the bitch by the arms\nPut the gun to her head, then I asked where the cash at?\nAnd the safe deposit, boy show me the way\nCracked open the safe, duffle bag check\nCleaned out your accounts and your assets\nAnd now it's time to bounce like a bad check\n\n[Hook: Boldy James]\nCock the four pound, and the 74\nPull my mans down, like you ready to go?\nLet off a couple rounds, soon as I hit the door\nEverybody laid down, get down on the floor\nBank, bank, bank jacking\nStraight, straight, straight jacking\nBank, bank, bank jacking\nEverybody laid down, get down on the floor\n\n[Verse 3: Czar Rae]\nThree minutes and now we finished\nThree minutes is in it for the Benjamins\nEverybody in  they position\n\n[Verse 4: Rick Rude]\nStolen getaway car,  peeping the scene\nTwo fully loaded carabine 15's\nLooked up, two squad cars on the scene\nHere come Boldy and C's with two bags of g's\nThis the shit that you see on a big screen\nSWAT team, M16's\nThat's when I hopped out, and cut that chopper loose (blocka, blocka)\nI know I hit a cop or two (blocka, blocka)\n\n[Verse 5: Boldy James, (Czar Rae) & [Rick Rude]]\nThat's when I get to popping too\n(blocks let's move I got you boo\nThen we dove in the whip like a swimming pool)\nAs the glass shattered cause they was shooting at us\n[Smash the gas pedal, now we Audi 5\nIn a Audi 5, all wheel drive]\n\n[Hook: Boldy James]\nCock the four pound and the 74\nPull my mans down, like you ready to go?\nLet off a couple rounds, soon as I hit the door\nEverybody laid down, get down on the floor\nBank, bank, bank jacking\nStraight, straight, straight jacking\nBank, bank, bank jacking\nEverybody laid down, get down on the floor\n\n[Verse 6: Rick Rude]\nGhetto bird out, and them news cameras\nHigh speed chase and I'm a loose cannon\nMan the cop cars quick, but we move faster\nCaught a good down slide trip, move past it\nBolds telling me to drive, duke's a hazard\n\n[Verse 7: Czar Rae, (Rick Rude) & Boldy James]\nMan fuck this shit, I'm 'bout to do damage\nI let a whole clip off, too scandalous\nOut the back of the window like, you bastards\n(Making love to the money is my true passion)\nSure, trying to stuff a hundred in my new mattress\nCause if the catch us they gon' send us to a new planet\nI'm talking 'bout Jackson, no Janet\nHold this motherfucker steady Rude, don't crash it\nCause if this bitch lose control, we ???\nCop lights on the rearview flashing\nOpen up the bag it's a bad pack, blue magic\n\n[Hook: Boldy James]\nCock the four pound and the 74\nPull my mans down, like you ready to go?\nLet off a couple rounds, soon as I hit the door\nEverybody laid down, get down on the floor\nBank, bank, bank jacking\nStraight, straight, straight jacking\nBank, bank, bank jacking\nEverybody laid down, get down on the floor", "image": "https://images.genius.com/f4e62e3a94855fb08b00d8bc0fb319ef.500x500x1.jpg"}]}