{"songs": [{"year": "2018-12-07", "image": "https://images.genius.com/3e53c9bb3f71fcaa17e6c63911a89f44.874x874x1.png", "title": "Consuela", "album": "Monument", "lyrics": "[Intro]\nYeah\nEy, guck ma', folgendermaßen (stellt sich die Sache dar)\nHör genau zu, junger Strolch\nAh, yeah, ey\n\n[Part]\nIch komm' nach etlichen Nächten voll Ecstasy- und Weed-Verkauf\nMescalin- und Speedverkauf an Gangster in den Streets der Town\nEndlich wieder hier nach Haus\nUnd seh' auf diese das Antlitz des Macs nicht spiegelnden, sondern dreckverschmierten Fliesen drauf (ey)\nDiese Hexe Consuela denkt sich nix und liegt da faul\nPizza fressend wie das Brangelina-Liebesaus (ey)\nIch zeig' der hässlichen Latina-Braut\nWährend sie sich mexikanische Soaps auf dem Flatscreen im TV anschaut\nDen glänzenden Machine-Gun-Lauf (wooh), du nichtsnutzige Schlampe\nKomm' ich heim, will ich, dass alles hier so blitzt wie diese Waffe\nUnd jetzt wischst du miese Schlange die Stühle und den Holztisch da\nUnd komm mir nicht wieder mit, „¡Solo hablo español, Mister!“\nDu Drecksstück verstehst das nie\nLetztens brachtest du mir erst, nachdem ich dir den Weg mit dem elektrischen Taser wies, das Tee-Service\nDu faule Haushälterin (tzhe), du rührst bloß mal 'nen Finger, wenn überraschenderweise\nGrade der Boss in sei'm Beamer kommt und vorm Haus hält darin\nAh, denkst, dass ich saudämlich bin, jetzt nimm den Staubwedel\nBevor ich's tu, deine Augäpfel damit rausbreche (pass auf)\nUnd dich zum Aufessen zwing'\nDanach wäschst du die Pelzjacken\nWie bitte? (was?) Was hast du gesagt? Ich soll es selbst machen?\nTzeh, widerliche Hure\nDu weißt, dass ich solche niederen Dinge wie der Diener tue, ist wider die Natur\nUnd jetzt wiener mir die Schuhe (sí) und die Fliesen hier im Flur (sí)\nSieh's positiv: Du tust damit was für deine Figur (sí)\n\n[Outro]\nDu fette kleine Schlampe, dat kann ja wohl nicht wahr sein\nNormal, dass das ewig dauert (jajaja), guck ma', wie fett du bist, Alter (jajaja)\nWas für 'ne elende—dat kann doch wohl nicht wahr sein, Alter?!\nIch hab' nix gegen Dicke\nJa, jetzt kommt die scheiß Bild-Zeitung wieder an und sagt:\nEy, der macht hier wieder Randgruppen-Beleidigung (Ja! Ja!)\nAber guck dich ma' bitte an (sí), das sind dreihundert Kilo (das ist jenseits von Gut und Böse)\nHör mir auf mit der Scheiße, du hast dich seit Jahren vollgefressen\n(Woah) Auf Kosten anderer\nMenschen verhungern auf der Welt (in Afrika) und du frisst hier ein Baguette (komplett)\nUnd 'ne Pizza nach der rein (nein), von meinem Geld (meinem Geld)\nWas ich dir bezahle jeden Tag (jeden Tag)\nDamit du hier saubermachst, nicht dass du hier frisst (mach' ich, mach' ich doch)\nPizza fressend wie das Brangelina-Liebesaus\nMuss man sich wirklich schäm'n"}], "artist": "Kollegah"}