{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/0aab2c3a8fe65902dd9bea31a7460a32.706x706x1.png", "title": "I’m Not the Average", "year": null, "album": "Rap Hard", "lyrics": "[Intro]\nSo so so sweet, yeah\nSo so so sweet (CL, CL)\nCome on!\nJust come and ride with me (Head bang nigga, head bang nigga)\nYeah! Cudi nice nigga!\nI'm different\nYeah\n\n[Verse 1]\nWhat the fuck ya'll niggas ponder when you think of K-I-D-C\nAnother motherfucker tryna flow up 'bout the ce-ze\nThat's right bitch, you need to pay respect\nThe checks on my Nikes these ain't the only checks I hope to get\nCritics talk about there ain't no talent in the land\nBut tell it to your man who would spread it to where he can\nY'all niggas street dreamin', that's probably where it ends\nI look down at you rappers and I'm only 5'10\" nigga\nTired of niggas talkin' fly shit out of they mouth\nActing like they know me and the city I'm comin' out\nI’m not a Bone Thug, don’t study to rhyme fast\nI rhyme at a steady pace and I'ma make the same cash\nInstead of talkin' bullshit, tit for tat\nHearin' these other niggas spittin' wack on these tracks\nInstead of smirking and laughing when you think of Cleveland rap\nBow down, to Kid Mesc nigga, y'all know we did that\n'Cause I'm\n\n[Chorus]\nThey don't know yet\nBut I'm not the average nigga\nThey don't know yet\nBut I'm not the average nigga\nThey don't know yet\nBut I'm not the average\n'Cause they don't know yet\nBut I'm not the average nigga\n\n[Verse 2]\nDon't stereotype Kid Mesc dawg, I'm not them\nDon't be like \"Damn my nigga, you sound like him!\"\nWhat you niggas know now wish y'all niggas knew then\nI'm not that nigga\nI'm the other Kid!\nAnd you best be believin' my heat gon' simmer\nI'm a special deliver while it hits you in your liver\nI'll make your soul shiver, lay you still at your wake\nGive these pussy ass niggas a solid reason to hate\nI done leaped over the gate, but y'all scared to hop it\nSpeakin' about all these guns but y'all lames don't pop it\nMy album's so hot even your moms will go cop it\nIt'll take you millenniums for your mark ass to top it\nLook look, now check here what your boy boy speaks\n\"Michael Johnson with the flow, work at your own speed\", oh\nYou can't hate on a nigga that's great\nNow y'all can't fuck with me I'm tryna get this cake 'cause\n\n[Chorus]\nThey don't know yet\nBut I'm not the average nigga\nThey don't know yet\nBut I'm not the average nigga\nThey don't know yet\nBut I'm not the average\n'Cause they don't know yet\nBut I'm not the average nigga\n\n[Outro]\nNana, yeah\nK-I, K-I, K-I, K-I-D\nK-I (oh), K-I (sing it), K-I (oh), K-I-D\nK-I (rock), K-I (oh), K-I (sing it), K-I-D\nK-I (rock), K-I (one), K-I (two), K-I-D\nHaha\nYeah, CL\nCudi\nRock with me, rock with me, come on\nBang pop nigga\nIt's the real, Midwest Action\nMelwisky, I see you nigga\nI'm not the average, I'm not the average\nThey don't know\nCBD13\nI'm not the average, I'm not the average"}]}