{"songs": [{"image": "https://images.genius.com/00a340ffd105977056a4782a46ba0027.400x392x1.jpg", "lyrics": "Some say the [?? ---- fell out ??] 'cause niggas get skunked out\nCowards we buck 'em down shoot the chooper in the ground\nMuggin' with evil frown got heat nigga what's up now\nLet off a hundred rounds guaranteed to shut your mouth\nSome say we need to be locked up in penitentaries\nI say kill off police and district attorneys\nPublic offenders too, they all be in cahoots\nCut them from ear to ear let 'em die in plug poos\nMust not forget the judge so long I helped his grudge\nWith a rusty box cutter cut off his nuts\nThough they might call us nuts I do not give a fuck\nI hit that po'po' once then come mista monsta dump\nTo all the black police: I want to see you bleed\nNigga ya still a nigga that's on the wrong team\nSometime I hate the world want to kill up everythang\nMaybe it's hallucinagenics fuckin' with my mind frame\nThe question's in head tellin' me don't trust my friends\nDon't crush my cans so in my ruger I can [?? bend ??]\nBut then again what if this motha fucka jammed\nThen I fall and will the lord know who I am?\nProbably not because I'm livin' life by the fault\nSo off hellfire I blaze the blunt with me or against me\nUgh\nMy bitch don't understand she think it's just a phase\nI hear her cry at night hopin' that one day I change\nCan't tell her that I love her when I lust the game\nTryin' to keep my composure but yet I'm untamed\nListen I hear the streets call my name\nThe same way they called my father in his day and that nigga came\nIt's tradition, though my mama raised me as a Christian\nI still [?? roll in terms of low ??] with devilish intentions\nPoppin' [?? shit out ??] but didn't nobody listen\nOn my way six feet under the ground or up in state prison\nIf so then in my book let it be written\nA youngster did his fuckin' thang without pretendin'\nPreacher think I'm cursed because I seldom go to church\nI went through five-hundred boys doin' major dirt\nGrandmama say the other night she had a dream\nThat I was laid off in a coffin after faulty scene\nLooked at me said look baby you know what that mean?\nThat you can catch death tryin' to chase after green\nAnd everybody ain't your partner so [?? - ---- --- ---- ??]\n'cause fools will leave your ass for dead and don't trip\nAm I crazy?  Tell me am I really insane?\nIs it strange 'cause I feel the pain corruptin' my brain?\nI need a head shrink because I'm startin' to think\nI'll turn the barrel on myself and take a long sleep\nBaptised by my heat, take my own self out the game then maybe then I can rest in peace\nFuck [??] fools that want to see my on my back\nWith my mama cryin' over me dressed in all black\nI'm drinkin' conyak poppin' hella prozak\nIt's harder everyday to keep my sanity intact\nI'm takin' ritlan smokin' on that rope again\nAll type of mani shit that try to calm the beast within\nI think I need to pray maybe that' do some good\nDo God got some time for niggas in the hood?\nCain't win for losin' who the hell do I think I'm foolin'?\nVoices in my dome I think I start to listen to 'em\nTellin' me to pull the trigger fool don't be no punk\nAnd I ain't no punk so I blast I don't give no fuck", "year": null, "album": "Illegal Business 2000", "title": "With Me or Against Me"}], "artist": "Mac Mall"}