{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/b294ecc265a79f3e4ef86c41b208e8e4.500x500x1.jpg", "title": "Super Clean/Super Hard", "year": "2008-07-08", "album": "I Pledge Allegiance to the Grind II", "lyrics": "[Intro]\nGood morning, hey\nYa'll know who it is and ya'll know what it is\nHold up, let me make it official\nThat's right, you know who it is\nMr. Cool Acer a.k.a. The Ghetto Wayne Newton\nA.k.a. Mr. Malcolm Thermostatic\nA.k.a. Acer Ascot\n\n\n[Verse 1 - Killer Mike]\nPimping I'm super clean, pimping I'm super hard\nAin't into pimping but love linen and super broads\nI'm on a super grind, I'm out here getting mine\nI refuse to be a beggar in a soup line\nI tell them \"See you later motherfuck a soup kitchen\"\nYou can catch me in Decatur in a Super Sport dipping\nCra-gar, 30-spoke, first 8 corner-dipping\nYou should see the Vogues glisten, similar to 4's tippin'\nYou should see us in the condominium with pretty women\nAll stripping, buncha player shit, yeah we all tipping\nI took a bank roll, threw a couple grand\nTold the youngest ho, \"See that's how I do my Superman\nAnd you a super girl, good hair, super curls\"\nShe was super thick and she sucked a super dick\nI let her get my number told her \"Hit a player later\nI told my wife about her and we did a 'Will and Jada'\"\n\n[Hook]\nI'm super clean, I'm super hard\nAn ultraviolet ray, I shine from afar\nBitch, don't you know who we are?\nBitch, don't you know who we are?\nI'm super clean, I'm super hard\nAn ultraviolet ray, I shine from afar\nBitch, don't you know who we are?\nBitch, don't you know who we are?\n\n[Verse 2 - MJG]\n(Don't you know who I are?)\nI'm pimp tight, M-J!\nI know mad hating\nBut my infrared beam spot you like a dalmatian\nMy Tuesday ho riding 'round with my Friday bitch\nThat's what you call teamwork, nigga try this shit\nIf you a pimp, pimping hard, keep it pimping\nWorking hard hoes and hard-working women\nI got a Caddy make a nigga want to get a Caddy\nA Cadillac? Nigga, naw, it's a super Caddy\nWith a super motor, it make it go super fast\nGive me all my money bitch ho, do the math\nI don't even want half, ho I want it all\nMind, money, heart, soul I'ma sell your drawers\nAnd put your mouth up right, do it, half price\nJust right too, half-black and half-white\nDon't even act shy, ho I know you with it\nDo it Vivica Fox did it, reach out and get it\n\n[Hook]\n\n[Verse 3 - 8Ball]\nBig Ball, my girl say I got a hustle belly\nShe like to climb on top and ride that roller coaster baby\nUp and down, round and round, super clean, super mean\nFly like a gulf stream, purple in my bloodstream\nA yellow Cindarella cigarillo for my green\nHit the club 30 deep like a football team\nSouthern rap royalty, hated in the industry\nGhetto superstar, number love for us in the streets\nAny city, any town, stick me where the 'hood at\nTalking 'bout my life up on this mic that's what I'm good at\nStill keep my heat even though I know them boys watching\nAnd it ain't never took a lot for me to get it popping\nI'm dropping shit on niggas talking 'bout they running thangs\nI'm hitting evil bitches in the forehead with this game\nLame niggas imitate but they can't do the same\nFuck all haters, go and get your money mayne\n\n[Hook]\n\n[Verse 4 - Killer Mike]\nI'm player fly, I'm player fresh\nFresh, dress to impress like when pimps pet the flesh\nAnimal skins with the men from my toe to chest\nPonyhair, Morris slippers slippers 4X, matching vest\nI'm feeling good, I'm looking 'hood\nAs I watch the world through the Benz logo on the hood\nFly boy, fat boy, fat boy, fly boy\nI adore women that's thick like Ki-Toy\nI'm starting to feel like young Willie Dynamite\n32 flavours baby: got 'em black, brown, white\nEven got an Asian, sex is amazing\nHair to her ass and I think she Malaysian\nTaking yoga classes, she said when I hit her\nThe down south dick nearly ripped her and split her\nEvery time I'm with her it's Grind Time Official\nCause I be like \"Uhh\" and she be like \"Killa...\"\n\n[Hook]\n\n[Outro]\nThat there we have it nigga, pimping 101, man\nThat's right 101 from goddamn rule 1 to rule 3\nHope ya'll soaked this shit up nigga\nWhat I want you to do if you didn't understand it cause I was going too fast for you\nCause I do move at a terrific speed of one thousand thirty seven and thirty miles per hour\nYou back that shit up and slow it down\nYou might have to screw it nigga"}]}