{"artist": "Webbie", "songs": [{"year": null, "lyrics": "What you mad now?\nCuz i done made it, laugh now!\nYou doin bad now?\nI thought you was a big timer!\nYou a trip nigga\nYou just a buncha lip nigga\nWhy that shit so little and all the diamonds missin?\nWhere the hood street shit?\nShow me where the G shit\nWhere the gutter holes be and nobody gone see shit\nHit the purple main up, man i need a complete zip!\nAnd if i catch you anywhere i can hit, you gettin' ripped\n\nVerse 1, Webbie\n\nI had to ? at the club\nAnd i didn't even know her\nI just looked her in her eyes\nAnd i could tell that she was sober\nThat's a problem, bought some bottles\nWe started blowin and pourin\nShe got to bouncin and twerkin, my dick it start gettin hard\nThe lights and 'em got 'em movin my shit it start glissen hard\nTold niggas that got to lookin i'm muggin them bitches hard\nAlready smoked about a half of dat shit i was trippin hard\nSo i made sure my niggas was straight\nAnd kept her goin\n\nCHORUS\nFirst night! Watch diz nigga do it every time\nFirst night! Probably get to even let my nigga get a try\nFirst night! Oh come on suck it i know it's your first time\nFirst night! I just hit 'em and forget 'em I ain't lyin!\n2x\n\nVerse 2, Webbie\nUgly hoes stand wide bad bitches come and talk to me\nI don't really talk a lotta shit my appearance talk fo me\nI don't like relationships cuz i dun really wanna fuss\nI love me thighs and hips to grip when i be cuttin some\nMe, i'm quick to nuttin some\nI know you clowns trippin' out\nUntil you find out that it's yo bitch mouf i'm talkin bout\nReal feel this shit cuz\nOn the beach just chillin out\nSix puerto rican hoochies just me, boos, and rick ross\nBet a hundred on that Saints game\nKinda pissed off i just lost\nShe ate nuts i cheered up\nNigga feel her this bitch soft\nI call soon as you go to work\nI leave right when you get off\nI stay there when you ain't home\nI'm the nigga behind them prank calls\nI fuck hoes, i touch them, i'm out shit, i'm bout dat\nI count toes, i flow hoes, i slang hoes, these skank hoes\nHead first, a fo sho, and bread first, a no no\nTo the room after my show, don't wanna go then don't worry\n\nChorus 2x\n\nVerse 3, Mouse\nI met a cutie with a booty, and she was kinda groovy\nShe woulda gave it to me if i took her to the movies (Yup!)\nThen I met Pam, straight outta Birmingham\nShe says she ? but she did the whole fam (Yup!)\nCan't forget Ashley, yea she get nasty\nChopped her on campus right befo she changed classes (Yup!)\nFreaks by the bundle, yea they act humble\nBut when they let the ?, shit they will rumble\nWhen I work that lumber, big cucumber\nHit you and forget you, you's a one hit wonder\nWhen I work that lumber, big cucumber\nHit you and forget you, you's a one hit wonder\nBut if you work it good you can leave me your number\nHit the bedroom and make it shake like thunder\nThat girl ass phat but yours much more plumper\nGirl don't waste a minute go on lemme hit it on tha\n\nFirst night! Watch diz nigga do it every time\nFirst night! Probably get to even let my nigga get a try\nFirst night! Oh come on suck it i know it's your first time\nFirst night! I just hit 'em and forget 'em I ain't lyin!\n2x", "image": "https://images.genius.com/c34737bbafed45ab75562f625e46ec8f.640x640x1.jpg", "album": "Savage Life 2", "title": "First Night"}]}