{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "[Intro: 2Pac]\nI'm not saying I'm gonna change the world\nBut I guarantee that I will spark the brain\nThat will change the world\n\n[Verse 1: Ya Boy]\nBetter show respect before I lose it\nThe whole world know Precise is more than music\nA movement, look at all the goons that I move with\nHomies, guns, vest & boots on that platoon shit\nBest, hardest in the West, yes, literally\nThe fans comparing me to who? Come on, ya killing me\nThe enemy keep trying, but can't get rid of me\nBombs like Timothy, arms like a centipede\nHoes through his door, make sure he's a memory\nOne nigga, but I got 'em shook like there's ten of me\nGo hard in hip-hop, hope they remember me\nScreamin' \"Thug Life\" like a 2Pac Mini-Me\nAny beef? Tell 'em to bring it special delivery\nI bet my little friend will put 'em outta his misery\nThese niggas wanna finish me and send me to the Reverend\nHonestly, there's probably better competition in heaven\nHolla at me, Fillmore bitch, we dollar happy\nYou would think I was strippin' the way hoes throw dollars at me\nI'm the ma'fuckin' spiteful, delightful, iteful\nThe new Ice Cube, bust my guns and rock mics too\nSo what's good? Either you Crip or you Blood\nSomebody call Khaled, tell 'em \"Ya Boy was hood\"\nIf he joke like DeRay, my heat like D. Wade\nShots to his face, make him sing like T-Pain\nStuff him in the trunk, then I dump the remains\nNowadays all that rappin' is is a free chain\nIf a nigga ever look at me as a free chain\nHe's not gonna make it like his plane got delayed\nI'm talking to the real, if you fake, then get lost\nThem block musclemen, hustlin' like Rick Ross\nReal talk, I'd rather sit than snitch dawg\nCause quick jaws get a nigga smoked like menthols\nI'm way outta they league, who hotter than me?\nGotcha favorite R&B bitch swallowin' me\nI ain't lyin', look I'm so fly I should be flyin'\nMaybe that's the reason why ya girl keep eyein'\nI'm eyein' her back, Louie purse with the hat\nI'm not a trick, but I'm rich, so I'm buyin' her that\nAnd I'm tired of this rap beef, tired of that gay shit\nI thought he wanted war, he seen me and didn't say shit\nI'm outta this world, when you see me I'm like a spaceship\nLights everywhere, make it bright anywhere\nGot the sun on my neck, full moon on my wrist\nDa-da-diamonds in my mouth and it's all on a bitch\nI guess I took notes from Kevin Federline, every time\nMilk a bitch like a cow, every cent, every dime\nNever been to jail, but I done done hella crimes\nMoved to Malibu, now I got 'em thuggin' in Pepperdine\nGimme mine, if a nigga say I ain't the top five\nDead or alive, remove his head and his spine\nI load the lead in the nine and leave him dead on arrival\nYou sittin' on the shelf, what the fuck did you sign for?\nCatch me with the Crips and the Bloods don't mind, no\nI don't bang colors, I'm a damn albino\nDrunk like a wino, hard like a rhino\nFlyin' through ya time zone, looking for a fine ho\nRihanna, Alicia, Mya, big pimpin'\nI'll even take a white girl like Jessica Simpson\nMake sure she licks it, kiss my Limp Bizkit\nTape it, need a witness, this is big business\nI'm heavy with SRCs like Steve Rifkind\nI'm talkin' some real clientele, nigga listen!\nDrop 'em a line, that's all I do is go fishin'\nGet 'em hooked on me then I turn 'em into fish sticks\nThis is -- 100 BARS OF DEATH if ya listenin'\nI ain't like these other niggas, I can go the distance\nYa fans in my hands, so you know that I'ma clinch it\nThe rap game dirty, but somebody gotta rinse it\nI don't even spit shit, I just go and rip shit\nThat's why these hoes put me on like lipstick\nThat's why these hoes put Ya Boy on they hit list\nSwag like a ma'fucka, I'm the new Slick Rick\nLa-di-da-di, sawed-off shawty\nRidin' through the hood, bout' to flip somebody\n\"How you rap like that?\" It's just somethin' 'bout me\nI step in the booth and the shit just comes at me\nNiggas wanna shoot me, niggas wanna rob me\nFuck that, .40 cal here right beside me\nNiggas can't deny he, hotter than Mojave...\n...Desert in the middle of summer, let's have ménage\nI be, killin' other rappers like a hobby\nNiggas take pictures of women like they surround me\nI don't even trip, I don't block no head\nI tell them hoes, \"Do me,\" like Rocko said\nBut you can get up outta here if you ain't got no bread\nCause even my bed, got a Ferragamo spread, yeah\nI mean Scrooge McDuck bucks\nAnd if a nigga say I ain't nice then he probably get butt fucked\nI catch you in the hood all I'll say is \"tough luck\"\nDon't holla \"Precise Gang,\" ya get fucked up\nWhat-what? Cut a nigga up like Nip/Tuck\nYou might as well kill ya self like a wrist cut\nAnd everybody in the whole hood know it's us\nThe way them doors no longer swing, they lift up\nThe way them boys gon' do they things with big bucks\nBig homes, big diamond rings and big trucks\nDespite that, I'm tryna sell like Mike Jack\nI even get the fans that don't like rap\nKeep it a hundred, so it's a must I write that\nSpit so much crack The Feds got the mic tapped\n\n[Outro]\nYeah, holla at me\nPRECISE GANG!\nYA BOY!\nI suggest you keep me healthy West Coast\nWest Coast, I suggest you keep me healthy\nHaha!\nY.B\nI'm on one\nInfaRed on this ma'fucka\nYeah, come on", "title": "100 Bars Of Death"}]}