{"artist": "Fat Joe", "songs": [{"year": "2005-06-14", "album": "All or Nothing", "image": "https://images.genius.com/07b605de3e64892070232ced7e01e190.1000x1000x1.jpg", "lyrics": "[Timbaland]\n(Jump off) Timbo and Joey Crack about to FLIP!\nYeahhhhhh - FLIP!\nYeahhhhhh - FLIP!\nYeahhhhhh - FLIP!\nYeahhhhhh OH!\n\n[Hook 1: Fat Joe]\nGet up, get get, get down\nYou ain't come to party muh'fucker just sit down\nGet up, get up, get up, get up\nGet up, get up, get up, get up\n\n[Hook 2: Fat Joe]\nShe's bad, she's bad, she's bad I know she's bad\nEverybody GET UP!\nGet up, get up, get up, get up\nGet up, get up, get up, get up\n\n[Fat Joe over Hook 2]\nGuess who's back?\nYeah, guess who's back?\n\n[Fat Joe]\nThey call me Pillsbury Dough-bwoyyyy\nCause they know I really get that dough bwoyyyy\nDropped \"Lean Back,\" it was so propers\nThen I had to circle back with some mo' choppers\nMo' guns, mo' nines, whole lotta, money\nMo' Biggie sing it with me, \"Mo' Problems\"\nUhh, it's the BX finest, Cook Coke Crack\nBaby please rewind this, and yeah I know I'm hot\nYou don't need to remind us, ladies!\n\"Your royal penis is clean, your highness\"\nUhh, I can't do nuttin right these days\nGot chicks mad at me cause I lost some weight\n... Timbo and Coke\nAnd we 'bout to haunt the town in the sky blue Ghost\nNew York! Damn I hate to brag and boast\nBut \"I'm RICHHHH,\" Timbaland bring in the chorus\n\n[Timbaland] Everybody get up!\n[Hook 1]\n[Timbaland] Everybody get up!\n[Hook 1]\n[Timbaland] Everybody get up!\n[Hook 2]\n\n[Fat Joe]\nYou about to witness, greatness at it's prime\nYou should tape this\nMatter fact, go 'head, congratulate us\nRucker, three-peat champ, see us Lakers (whattup Reem?)\nHomey please don't hate us\nShe said that she was single, yo leave or make up - DAMN!\nI'm out in L.A. within a week\nHonies go to {?} from and they cut (aowwww)\nV.A. is you wit me now\nCouple bricks of that yay and it's Philly bound, feel me now\nI'd rather die in prison, than to be a broke nigga\nLive my life in the kitchen, into bakin pies\nOne of my addictions, on the mound\n95 mile per hour pitches, volleyball servin 'em\nThe iron is itchin\nTo straighten any nigga out tryin to diss on... Crack\n\n[Hook 1]\n[Timbaland] Everybody get up!\n[Hook 1]\n[Timbaland] Everybody get up!\n[Hook 2]\n[Hook 2]\n\n[Fat Joe]\nShe's bad like MJ's sister\nI ain't gotta talk fast, give a day and I'll twist her\nAin't gotta be celebrity to get with me, shit\nI fuck bitches that look worse than...\nAs long as they head right and ass fat\nI put a pillow over they face and ass that - Crack\n'Bout to cruise down your avenue\nIn the back of that Cad, think collateral\nAin't no tellin what this clip and the Mac'll do\nAsk Timb, I got the beat by kidnappin Maganoo\nIn other words don't fool with us\nAiyyo Timbaland, tell 'em what to do\n\n[Timbaland] Everybody get up!\n[Hook 1]\n[Timbaland] Everybody get up!\n[Hook 1]\n[Timbaland] Everybody get up!\n[Hook 2]\n\n[Fat Joe] Crack!", "title": "Everybody Get Up"}]}