{"songs": [{"title": "Touchin’ Everythang", "album": "Bred 2 Die Born 2 Live", "year": null, "image": "https://images.genius.com/0ec27b6023fdef052011e493255845b9.900x900x1.jpg", "lyrics": "[Chorus]\nI'm in the street, yeah Scrappy touchin' err'thang\nI'm in the mall, man Scrappy snatchin' err'thang (Yup)\nWhen I'm in the club catch me smokin', drankin' err'thang\nSwear to God I ain't lyin' man, I put dat there on err'thang\nYou already, you already know (Huh, Huh!)\nYou (You) already, you already know (Whoa!)\nYou already, you already know (It's ya boi Scrap, haha)\n\n[Verse 1]\nSoon as I wake up I'ma say my prayers\nThen I look up in the closet to see what I'm gon' wear\nI got the +G's Up+ shirt, with the +G's up+ chain\nGot the G-Unit shoes, dat's whudd I'm talin'bout mayn'\nI hit the showa, hit the charga\nPut the key up in the starta\nHit the mall-a, with my niggas\nGit the broad up, bend the cone then I holla\nTha fuckin' hardest, cuz I'm a mothafuckin' balla\nI'm gangsta, dat's whudd it is and you gon' love it\nFuck bein' on TV - I'ma show my ass in public\nShawty it's nuthin', you know the young nigga buckin'\nYou ask 'bout me shawty and this what they say\nI'm the wildest young nigga in the -A- (Sho'nuff)\nThrowin' money in the bay cuz I'm paid (Hol' Up)\nI went and spent 45 on my mouth (Hunned?)\nNawh, 45 thou' (Damn!), Shawty just look at my smile\n\n[Chorus]\nSo whudd it is? - Man, you already know whudd it is\nWhat's the deal? - You already know whudd it is\nNow whudd it is? - You already know whudd it is\nWhudd it is? - You already know whudd it is\n\n[Verse 2]\nYou can catch me in the club gittin' drunk as usual\nTha ol' wildin' nigga just be so crutial\nA couplah groupies with some big azz booty's\nSloppy ass drunk, trynnah do sumthin' to me\nI'm like: Babydoll hold up, gitcha mind right\nI'm lookin' atcha face, Yeah I mean you iight\nYa body off the chain, but ya head fine\nSay you ain't a freak - You's a Goddamn lyer (Aye)\nI'm on the goose, trynnah git loose\nGotta squad full of niggas dat'll git atchu\nDon't got me wrong my nigga, on dat role down home\nEven though we in the club, you can git dat chrome\nI see ya poppin' at the mouth (Who you talin'bout?)\nI ain't got bread at the house (Now who you talin'bout?)\nAll dat mean muggin' & dat mumblin' (Who you talin'bout?)\nWhen I start bussin', start runnin' (Dat's whudd I'm talin'bout)\n\n[Chorus]\nSo whudd it is? - Man, you already know whudd it is\nWhat's the deal? - You already know whudd it is\nNow whudd it is? - You already know whudd it is\nWhudd it is? - You already know whudd it is\n\n[Verse 3: Yung Joc]\nNow when ya back touchin' ya stomach\nI can teach her sunumics\nA hunned miles and runnin', the realest who eva done it\nThem hatas make me vomit, wishin' my sales plumb it\nThey mad cuz I hit the mothafuckin' block gunnin'\nStuntin'! Put 'em wheels on 'em 26s\nBitches! one to the truck to see who in it\nA minute, his limo tinted watch you sayin' nigga?\nOh yeah we make plays - on the radio, we ain't playin' nigga\nTha kush and the peels (I got it!)\nI put the push to the deal (I got it!)\n8 karat bently on the wrist (How bout it?)\nI bought the coup' just to match and (Hop out it!)\nYeeeeaah I mean every word\nGotta machine with a bean dat'll clean ya whole curb (Aye)\nScrappy, tell 'em - we G'd up\nFrom the feet up - the block need us\n\n[Chorus]\n.\nSo whudd it is? - Man, you already know whudd it is\nWhat's the deal? - You already know whudd it is\nNow whudd it is? - You already know whudd it is\nWhudd it is? - You already know whudd it is"}], "artist": "Lil Scrappy"}