{"artist": "The Game", "songs": [{"title": "Block Wars", "album": "Block Wars Original Soundtrack", "year": "2016-07-25", "image": "https://images.genius.com/e3f4fc097719794050d92c29bcdec825.1000x1000x1.jpg", "lyrics": "[Intro]\nYou know what the fuck be pissing me off?\nThe other motherfuckers think they running my block\nJump off that fucking stoop, hit the fucking gate, nigga\nGrab your burners it's time to go to war\nI give the niggas the whole fucking clip\nEvery motherfucking round in this motherfucker you can get\nTell 'em it's a block war\nMurder murder, murder murder\n\n(Bongo 808)\n\n[Verse 1]\nNiggas run up on this red '64\nYou get a white tag on your big toe\nThese ain't punch lines, niggas kick doors\nLeave your baby mama with her lip swole\nAll handguns, niggas pack light\nNigga's mouth loose but my strap tight\nNiggas slide through and they bust first\nWe killin' everybody that night\nBlock wars, we bout that life\nScuffed J's and them fist fights\nDead bodies on dead bodies\nSavage, that's what I live like\nGo and chop a nigga head off\nFuck around, let the rounds hit you\nBlood splattered on them niggas with you\nAll I had to do was give a signal\nMagazines if you got an issue\nHit one nigga with the Source\nHit two niggas with the Vibe\nBitch I kill your vibe\nIt's a reason niggas can't fuck with Chuck\nI'm a Compton nigga and I don't give a fuck\nNigga walk around with that pistol tucked\nI do the drive-bys out a Bentley truck\n\n[Pre-Hook]\n(Murder murder) Whoo! Yeah\nHave you ever seen a murder huh?\n(Murder murder) Boom-boom-boom-boom, look\n\n[Hook]\nHave you ever seen a murder?\nHave you ever seen a dead body?\nGot a chopper with some rounds on it\nBoop-boop, hittin' everybody\nTurn the corner from your mama house\nPut a nigga in the trunk\nCock your shit and walk around the corner\nPromise nigga this ain't what you want (block wars)\nNigga this ain't what you want (block wars)\nNigga this ain't what you want (block wars)\nNigga this ain't what you want (block wars)\nNo, nigga this ain't what you want, whoo, yeah\n(Murder murder) Boop boom boom boom\n(Murder murder) Whoo\n\n[Verse 2]\nPull up on your block, take that shit over\nStolen choppers out of stolen Rovers\nSupernova bullets rippin' through Corollas\nPure shooter like DeMar DeRozan\nHot slugs but the jewelry frozen\n12 gauges on the trap sofas\nNaked bitches in the kitchen whippin' yola\nPockets fat like the young Oprah\nTold the nigga he ain't want the clip\nI'm filthy rich and still with the shit\nHis mama cryin' but his son a bitch\nI had her view the body like she from the 6\nBullets ricochetin' all through the block\nNigga run his mouth like he knew the cops\nI do the shootin' while the shooters watch\nThen cook crack in a noodle pot\nMove me? Gotta move the block\nThat means take shots like it's Blue Dot\nNiggas talkin' bout the game like it's ESPN\nI'll put your ass with Stuart Scott\nNo conscious mind, the chronic got my mind blown\nI can't stop with the murder shit\nBurn rubber, burn a clip\nA lot of niggas died on how they wear the shit\n\n[Pre-Hook]\nShut the fuck up\nOr get murdered murdered murdered\nHave you ever seen a dead\nMurder murder murder murder\nHave you ever seen a dead body?\nHave you ever seen a dead body? (whoo)\nHave you ever seen a\n(Have you ever seen a murder huh?)\nMurder murder murder murder\n(Boom boom boom boom, look)\n\n[Hook]\nHave you ever seen a murder? (block wars)\nHave you ever seen a dead body?\nGot a chopper with some rounds on it (block wars)\nBoop-boop, hittin' everybody\nTurn the corner for your mama house\nPut a nigga in the trunk\nCock your shit and walk around the corner\nPromise nigga this ain't what you want\n\n[Outro]\nEverybody lay the fuck down, you know who it is nigga\nAy, what the fuck you doing? Nigga come here nigga\nGun in your motherfucking mouth\nNigga put that motherfucking gun down\nBefore I smoke your motherfucking homie\nAyo and get all this shit nigga\nI'm about to kill this nigga, fuck you nigga\nYou dying too bitch ass nigga, blam nigga\nLet's get the fuck out of here"}]}