{"artist": "R. Kelly", "songs": [{"album": null, "year": "1998-03-23", "lyrics": "[Verse 1: Sparkle]\nTwo years ago, promises is all I heard\nWait a minute, let me finish\nTwo years ago, promises is all I heard, out of your mouth\nAnd now you wanna walk away, boy\nAnd tear down the walls in this house\nYou used to tell me sweet things, sweet things in the morning time\nNow all you do is hurt me, and think that everything is fine\n\n[Chorus: Sparkle]\nYou better be careful what you say to me\n'Cause it might turn around on you\nYou better be careful what you do to me\n'Cause somebody might do it to you\n\n[Verse 2: Sparkle]\nNow who was there for you, when your ass was out of work\nAll by myself, taking little man to church\nSo quick to hang up the phone when I step, in the room\nThen you want to turn it all around\nI'm getting tired of playing fool\n\n[Chorus: Sparkle]\nYou better be careful what you say to me\n'Cause it might turn around on you\nYou better be careful what you do to me\n'Cause somebody might do it to you\n\n[Refrain: Sparkle & (R. Kelly)]\nIf the shoe fits, wear it, boy (yaw yaw yaw yaw, yaw yaw yaw yaw)\nIf the shoe fits, wear it, boy (yaw yaw yaw yaw, yaw yaw yaw yaw)\n\n[Verse 3: R. Kelly]\nTwo years ago, didn't know you had male friends\nWait a minute, let me finish\nTwo years ago, didn't know you had male friends, off up in college\nI found out you're still reaching out to some of them, Mrs. Busy Body, hmm\nYou used to listen to me, when you were down and lost, mmm\nBut now, you don't even respect me, ever since I got laid off\n\n[Chorus: R. Kelly]\nYou better be careful what you say to me\n'Cause it might turn around on you\nYou better be careful what you do to me\n'Cause somebody might do it to you\n\n[Verse 4: R. Kelly]\nNow who gave you money when your ass was broke, without a dime?\nAnd even though lil' man is not my child, I made him mine, mmm-hmm\nSo quick to run to your friends and talk about, what we do in this house\nAnd then you wanna party all night long\nWhat the hell you talking 'bout?\n\n[Chorus: R. Kelly]\n'You better be careful what you say to me\n'Cause it might turn around on you\nYou better be careful what you do to me\n'Cause somebody might do it to you\n\n[Refrain: R. Kelly & (Sparkle)]\nIf the shoe fits, wear it, girl (yaw yaw yaw yaw, yaw yaw yaw yaw)\nIf the shoe fits, wear it, girl (yaw yaw yaw yaw, yaw yaw yaw yaw)", "title": "Be Careful", "image": "https://images.genius.com/e54b7a47c059f99afc5429a8709acf02.400x400x1.jpg"}]}