{"artist": "Ant Banks", "songs": [{"title": "Big Thangs", "image": "https://images.genius.com/5dca59480c46608eea6dbfa7afa46024.500x500x1.jpg", "album": "Big Thangs", "lyrics": "We havin big thangs\nIce Cube, the only nigga that can bring Too $hort out of retirement\nRepresentin money\nHmm, beeitch\n\nVerse One: Ice Cube, Too $hort\n\nWise crackin felines, unh\nCan a nigga make a bee-line?\nTo that nappy area, don't wanna marry ya\nJust wanna bury ya head in a pillow\nSorry but I got a kilo pussy-willow\nJanked ass penicillin, ain't got ta ask how ya feelin\nI'm tha nigga that got ya squealin\nYa wanna know how we keep these hoes in check?\nKeep them broke and keep their panties soakin wet\n\nI like to smoke big, ride fat, and always stack cash\nBelieve me, keep her breezy with her fat ass (fat ass)\nBig thangs on my mind ain't trippin at all\nThey call me $hort, but I got a big dick in my drawers\nI feel like a giant sometimes, bitch don't stare\nYou'll go blind from my diamonds\nTryin ta size me up, but basketball I ain't playin\nCall a tech, blow the whistle, throw the bitch out the game\n\nChorus:\n\nWe havin big thangs (like it's the thang to do)\nBig thangs baby ($hort Dawg and Cube)\nWe havin big thangs (like it's the thang to do)\nBig thangs baby (you know it's true, really doe)\n\nVerse Two: Ice Cube, Too $hort\n\nNow how can I let this bitch run it?\nWhen her ass ain't never felt the seats of a 600 (now)\nTricks we take shits at the rents, we don't get excited\nOver long hair and big tits\n$hort Dawg they get hella weak, when I tell the freak\nWe the richest niggas that you gonna ever meet\nWe got bosses in the back, countin the stack\nWe got cunts in the front with Hennesey and blunts\nNow what you want?\n\nShe wanna get fucked all night long, bitch what's up?\nYou know I got a tight song\nHeard me on the radio, I can't go wrong\nBut you ain't got no features, this can't go on\nYou're like a bundle of joy, but you're unemployed\nYou ain't throwin, so the pussy is just null and void\nDo you really understand what I'm tellin you\nLooks can be decieving, and bitch I ain't even feelin you\n\nChorus: add additional line\n\nBest believe me, it ain't easy, to be off the heazee\n(repeat 2X)\n\nVerse Three: Ice Cube, Too $hort\n\nYou can try and figure out the new shit we on\nBefore you break yourself, make yourself at home\nGive thanks, when it's Ice Cube, $hort Dawg, and Ant Banks\nWe all platinum, now ya got ta add francs\nTo the salary, that'll be cash or charge\nSo large, got a whole floor actin mirage\nWe like big thangs, we like runnin big trains\nOf big beautiful bitches with big brains\n\nBitches with big brains, I went to Spelman College\nTo see if my dick could get some higher knowledge\nBut pussy is pussy from Bel-Air to the projects\nBitch better suck my dick\nAin't nothin new, the game is old\nYou think the bitch is decent, and that's the same old ho\nUsed to fuck the whole crew, we was ballin man\nWestside!!! You know we doin big thangs\n\nChorus: same as Verse Two\n\nOutro: Ice Cube, $hort Dawg\n\nWe off that heazy bitch\nBeeeyyyitch\nHey $hort, give em yo part\nBitch bitch bitch bitch make me rich\nDo all that shit\nShe can even lick my dick, but I ain't lickin no clits\nWest-sieede. Westside!!!!!!!!!!!!", "year": "1997-07-08"}]}