{"songs": [{"year": null, "image": "https://images.genius.com/8af3ef445738797913f04096acda169b.500x500x1.jpg", "title": "Y.S.P.", "album": "Hardest Pit in the Litter", "lyrics": "Breaking bricks of cocaine...\n\n[Hook]\nY.S.P. we a team, Southside connected\nWolverines on the rise, and we well respected\nMob Style protected, infested with game\n(breaking bricks of cocaine), and ain't a damn thang changed\n\n[Mr. Sweets]\nWe some wolverines, with guilotines chopping the scene\nWith diamond rings, and living like kings\nPutting clips in spleens, on some of the funk that I bring\nBrain tumors and body wounds, from AR-15's\nNiggas scream, as soon as I heat em with the beam\nWe can go head up cause I'm fed up, and we might just triple team\nI ain't playing with ya, cause when I get ya I'ma split ya\nPay attention and get the picture, them hollow tips can hit ya\nBit ya, I hope they got a body bag to fit ya\nIf not, I'm hitting the back streets to get ya\nFuck it, I'm back in my bucket and headed home\nShagging ass in my zone, on the streets of Yellowstone\nThat's my turf that's my hood, it's understood\nTossing it up, whether I know that it's all good\nI wish you would, buy a vest for them niggas\n(too late Mr. Sweets, buy a chest for them niggas)\n\n[Hook - 2x]\n\n[Chris Ward]\nY.S.P. we a team, packing a beam\nLiving a dream, everytime I plot I gotta scheme\nGetting my cream, me and my six figga nigga team\nDown to do some dirt, it's time to be redeemed\nStep out on the streets clean, mugs on mean\nI'm a million dollar machine, operating for green\nWolverines on the rise, Mob Style and organized\nKnown for whipping, and flipping cakes and pies\nRecognize, a Yellowstone game spitting nigga\nBaked up, bricks of cocaine splitting nigga\nHard hitting, hater assassinator\nBitch nigga, exterminating terminator\nLoaded cock glocked, with a candy red dot\nBusting at any nigga, that wanna get shot\nSixteen to the body, and one to the brain\nBreaking bricks of cocaine, (and ain't a damn thang changed)\n\n[Hook - 2x]\n\n[Big Pokey]\nThese niggas better watch they sweater, cause they call me the chest wetter\nDesignated ditch digger, with a loaded baretta\nYoung trend setter, pailing bushes of G's\nOn my Q's and my P's, 3-60 degrees\nMash with ease, flipping up cassettes and c.d.'s\nTrees blown like a breeze, while surrounded with G's\nMoving ki's, what you expected we on feet\nMob Style protected, and we slicker than sleet\nRelease and relief, cause cheaters they get hit with the heat\nFrom your dome to your seat, rapid fire repeat\nGame consistent, wrist wear water resistant\nKeep a distance from bitch niggas, cause they flyer than pigeons\nCausing collisions, head on in this Southern division\nOn contracts I discuss, and cause body incisions\nNationality is a fact, that punk shit don't flatter me\nStay strapped 'fore I snap, perform a fatality we on the rise\n\n[Hook - 3x]"}], "artist": "Big Pokey"}