{"songs": [{"image": "https://images.genius.com/64efcd85041bcf1840a2b65a9ae4684a.1000x1000x1.jpg", "title": "I Miss the Days", "album": "The Search", "year": "2019-07-26", "lyrics": "[Intro]\nMm, mm\nMm, mm\n\n[Verse 1]\nI miss the days when I had a smile on my face and\nWasn't so caught up in all of the small things\nWasn't so adamant that I could handle everything alone\nAnd wasn't so cautious and always exhausted\nAnd actually listened to things that my heart said, heart said\nRidin' my bike, just ridin' my bike\nNot overthinkin' my life\nNot always wonderin' if I'm a likable person\nOr someone that nobody likes\nNot always stressed about money or losin' my job\nOr scared I ain't makin' a flight\nNot always goin' to bed every night\nWith this knot in my stomach that never unwinds\nWhat happened to me? Yeah, what happened to me?\nWhen did I start to believe I wasn't worth it\nThen question my purpose to breathe?\nWonderin' who I should be\nHappiness out of my reach\nScared to get back on my feet\nNeed to get rid of what's detrimental, but it's hard to let go\nWhen the thing that hurts you help you get to your dreams\nSee, I miss the days when I wasn't so faded\nLove wasn't always invasive, I could embrace it\nJust innocent, waitin', not always livin' in anguish\nWhen did I break and become overtaken?\nWhat was the moment I caved and\nGave away all of my faith and made a replacement?\nI miss the days when, I miss the days when—\n\n[Chorus]\nI miss the smiles we had when we were young (Oh)\nI miss the memories of feeling love (Oh)\nI miss us runnin' underneath the sun (Oh)\nStaring out the window when the rain would come (Oh)\nI miss the smiles we had when we were kids, yeah (Oh)\nI feel like life was so much simpler then, yeah (Oh)\nWhen we had joy and we were innocent (Oh)\nI'd give it all to feel that way again, way again\n\n[Verse 2]\nGive me my mind back, yeah\nGive me my mind back\nThe one that told me I was worth somethin' when I fall flat\nYeah, fall flat\nThe one that told me I was worth somethin' when I'm off track\nBack when my imagination wasn't in a cage and it was free to run fast\nYeah, give me my mind back\nYeah, give me my, give me my mind back\nBefore it was hijacked and wasn't described as\nA place of limitation, always indicating I can't\nHandle everything from my past\nHanded anything it dissects 'til I'm depressed\nI know I'm blessed, but I'm cursed too\nTake me back when I was happy, but I wasn't actin'\nVulnerable but didn't see it like some kind of weakness\nOr a thing that's unattractive\nHad emotion, but I learned to mask it\nDidn't know what I was runnin' after\nDidn't know the older I would grow\nThe more I'd lose control and take in all the baggage\nIt's really sad when everything you thought was stable crashes\nEverything you thought would take the sadness\nReally only made it deeper, got me off the deep end askin'\nWill we ever feel like we imagine?\nWill we ever feel like we adapted?\nWill we ever feel like we did back then?\nJust take me back when, just take me back when\n\n[Chorus]\nI miss the smiles we had when we were young (Oh)\nI miss the memories of feeling love (Oh)\nI miss us runnin' underneath the sun (Oh)\nStaring out the window when the rain would come (Oh)\nI miss the smiles we had when we were kids, yeah (Oh)\nI feel like life was so much simpler then, yeah (Oh)\nWhen we had joy and we were innocent (Oh)\nI'd give it all to feel that way again, way again\n\n[Bridge]\nOh-oh-oh (Oh)\nOh-oh-oh (Way again)\nOh-oh-oh (Mm)\nOh-oh-oh (Way again, way again)\nYeah\nOh-oh-oh (Oh)\n(Had when we were kids)\nOh-oh-oh (Oh)\n(So much simpler then)\nOh-oh-oh (Oh)\n(And we were innocent)\nOh-oh-oh (Oh)\nYeah\n\n[Chorus]\nI miss the smiles we had when we were young (Oh)\nI miss the memories of feeling love (Oh)\nI miss us runnin' underneath the sun (Oh)\nStaring out the window when the rain would come (Oh)\nI miss the smiles we had when we were kids, yeah (Oh)\nI feel like life was so much simpler then, yeah (Oh)\nWhen we had joy and we were innocent (Oh)\nI'd give it all to feel that way again, way again (Oh)\n\n[Post-Chorus]\nOh-oh-oh (Oh)\nOh-oh-oh\nOh-oh-oh\nOh-oh-oh\n\n[Outro]\nMm, mm\nMm, mm"}], "artist": "NF"}