{"artist": "Wale", "songs": [{"title": "Cyphr", "year": "2009-06-19", "lyrics": "[Freeway]\nYeah! Gunna!\n\n[Young Chris]\nWell it’s the C from the R-O, the Polo a cargo\nThe Murcielago, garage a car show\nThe ‘matic is auto, suit ‘em up, hard-toe\nHard-toe, get that to the wire like Marlo\n\n[Freeway]\nAnd so the wrist stay on glisten, the beats keep on ripping\nTouch me? Dream on, or y’all keep on schiz'ing\nIt’s the king of the flow-switching, I do it best\nSmif-N-Wes, right under the rest where the arm go\n\n[Wale]\nIt’s Mr. Need-an-Encore, J11 Concord\nYou niggas is John Q., you don’t have the heart for it\nCatch me out in Largo, showin’ off my hard work\nCount so much bread, swear to God that my arm hurt\n\n[Young Chris]\nGive ‘em the LV, fresh pair of lens and a nice belt\nI be in the women, swimming like Mike Phelps\nYoung black distributor, did it with the white help\nLittle bit of green, too, satisfy the fiends too\n\n[Freeway]\nMe too! I’m saying, bringing the banger right here\nI been hip-hop gaming, dropping bangers all year\nFreezer, bang that thang and end your singing career\nHoes like it, fly private, do my thing in the air\n\n[Wale]\nWell, am I making it clear, or did I st-st-stutter?\nGlobetrotting is nothing, I’m living out of my luggage\nA neighborhood superstar, don’t even hit the public\nDiscovery Channel tape us and swear the hood is a jungle\n\n[Young Chris]\nMotherfuck 'em, they feed the R&B and let the rest starve\nHad to leave my old team like Brett Favre\nCondensate, you fucking hater, let the mag off\nThen watch ‘em turn to commentators like Bradshaw\n\n[Freeway]\nRock stages, snatch wages, you can hate me or love me\nMTV-Unplug me and put me up with the greatest\nLil’ sweats, Louie specs, I put you up on the latest\n‘Cause I made it, graduated to the Benz from the buggy\n\n[Wale]\nAnd we the freshest, they love, it, we the subject of discussion\nWe can get it popping, brother, out in public, we ain’t running\nI ain’t playing, I ain’t caring at all, Philly, we ready for war\nWe bring it to ‘em, they Usain Bolt, gone\n\n[Beanie Sigel]\nIf I don’t come up, the sun won't\nDef might Jam but my gun don’t, I keep the 40 Glock with me\nI’ll give the jockey on your ‘Lo shirt a wiggy\nYou can keep the coke, papi, but the dough coming with me\nI’m all about the Benjamins, baby, pockets Puffy\nBig Poppa of the Property, you got to love me\nPopped off if it’s problems, we can do this publicly\nOr in private, however do you want it, B\nNo problems do you want with me\nI put your body in that box so comfortably, church\nLay a nigga six feet beneath earth\nWhile the preacher search the Bible for a verse, rest in peace\nState Prop, get your wig popped\nI’m on my job in the hood like Young Bob giving headshots\nKing of Philly, there’s none before me and none to come\nI got it locked like the wig on Stunna’s son", "album": "Back to the Feature", "image": "https://images.genius.com/5c5f10369e0207f5cea994743acd45c2.500x500x1.jpg"}]}