{"songs": [{"title": "Remember Your Path", "image": "https://images.genius.com/ec5d1855836657508c02c9103758522f.640x640x1.jpg", "lyrics": "Remember hip hop?\nDo you really?\nHow could I forget?\nRemember, one two\n\nKeep it simple, I try to do that\nBut when I keep it simple it sounds like something's lacking\nSo I go back and listen to the track and do a few subtractions\nGrab my pad and pen, write a new line, add it in, hmmmmm\nI can't say that again, I already rhymed this word with that word\nSo this time I gotta find a new way to flip it\nIs it that serious? I don't know\nBut I'm not trying to kick a bunch of freestyle flows\nI'm trying to grow as an artist\nCharisma and swagger, catch you off guard, I don't look like a rapper\nTake my picture, I'm not trying to look hard\nI never been behind bars or tagged train yards\nWith a marker or spray can in hand\nI'm an emcee y'all, I am who I am\n\nTo whom it may concern\nRemember back in the day\n??\nI'm doing way back\nThis goes out to anybody\nLets give back\n\nMicrophone check, one two, what is this\nIt's friends vs. business and friends come first\nI never thought this music would be lucrative\nI didn't know if I was stupid or intuitive\nCrazy, a little bit but maybe he's brilliant\nDrawing the blueprint to build this as a little kid\nWhen I was fifteen hip hop was a dream\nNobody voted for me to be the prom king or class president\nI was a west coast resident\nMoved to the east, hip hop was more prevalent\nLiving in New Jersey my junior year\nHigh school drop-out, my future's unclear\nTimberland boots yo, I couldn't play ball\nI was at the record store, never catch me at the mall\nSaving lunch money to buy fresh cassettes\nThat's why I stayed hungry to make the next step\n\nNo more nonsense, I'm taking rappers hostage\nSit them in seminars, teach them how to prosper\nThrow away money on cars and jewelry\nWhips and chains, that's appropriate slang\nWe become slaves to the idiosyncrasies\nOf rap songs that they play on the radio frequencies\nWe all desire a higher position\nSelfish ambition, it's a critical condition\nYou're not giving yourself a chance\nLike jumping out a plane wearing parachute pants\nIt's all the right words with the wrong emphasis\nIgnorance attacks, we become our own nemesis\nI tell it how it is, remember how it was?\nWhen I started rapping I did it for the love\nNo matter where you're from, wherever you're at\nAnd wherever you go, yo, remember your path", "year": null, "album": "The IV Edition"}], "artist": "Braille"}