{"artist": "9th Prince", "songs": [{"album": "Granddaddy Flow", "lyrics": "[Intro: Islord]\nEy yo, I want all y'all niggas out there in this rap shit\nClaiming y'all rappers\nY'all niggas ain't no fucking MCs\nKnow what I'm saying, son?\n'Cause once you step into the chamber\n'Cause we dealing with the 7th Chamber..\n\n[Verse 1: Islord]\nEy yo; witness this homicide lyrical specialist\nOnce I slide on the set like Mt. Everest\nAvalanches, causing total mayhem\nIn this rap industry, towards any non-descript rapper\nWho has the strongest heart, and dares to challenge the God?\nDart for dart, that's the wrong move\nLike one cat with a red shirt, stumbling upon\nTen cats with blue shirts, each one of 'em\nRugered out with clips filled to the brim with hollow points\n'Cause I'm on some, fuck all y'all R&B artist-es\nThinking y'all MCs, y'all best to Run 4 Cover\nAnd throw ya bulletproof helmets on ya head\nEnough said..\n\n[Verse 2: Infrared]\nI spit warfare, real shit niggas like to hear\nInfrared from Ruthless, nigga, crack them beers\nTwist the 'dro, put the clip in the fo'\nCock it back, put one in the head, these niggas don't know?\nThen let 'em know how we coming\nDeep, we keep shook niggas running\nYou cowards is afraid of my power, ain't holding nothing\nLemme show you something 'bout this rap shit\nFirst of all if you ain't spitting acid, you going backwards\nThese Bastards attack shit, fabulous, fatherless\nMarvelous, Shaolin niggas from stomping with\nKillarm' T.M.F. connect with Ruthless\nChallenge new generation, nigga, we the best\nWe out for this cheddar cheese\nYou better freeze if we enemies\nIf ya life's on the line you better squeeze\nYo I'm telling these wannabes, about the rules\nCome out ya shoes, we ain't got nothing to lose\n\n[Verse 3: Trife]\nEy yo; I floss like a red Porsche beamin' in the sunset\nYou made a dumb bet fucking with these young vets\nWho bumped heads with the hardest and build with the smartest\nFive artists, you can't do nothing to part us\nNiggas is garbage, that need to get bagged up\n'Cause their style's ragged up looking like sad pups\nYou'll be jacked up, leakin' with your eyes half shut\n'Til you had enough 'cause fucking with us is bad luck\nThe temptation of pussy be hard to pass up\nSo before I slide in I test the cat and strap up\nIs there a question? You gotta ask us\nDon't be afraid, but on my behalf you're getting played\nAnd where you was at, you should've stayed\nNow you search for aid, no one to save you\nAnd all your so-called men betrayed you\nThey wanting to talk and work deals under the table\nPassing 'em CREAM, gold watches and large cables\nThey snaked you, like the serpent\nTurn the lights off and close the curtain\nSelling their soul to a merchant\nI got niggas, scared to meet me in person\nSearching, like the Internet, I got 'em surfing\n\n[Hook: Tommy Whispers]\nNow Born, Port Richmond, Killah Hill\nStapleton, West Brighton, Jungle Nillz\nIn Shaolin we keep it real\nShit is getting deep, reach for steel\nWe going all out, do what you feel\n\n[Verse 4: Truck]\nI stick and move, move and stick with niggas\nIf it's real I click with niggas\nLaying all the fifth with niggas, sick of niggas\nSimple licking and squeeze faster than with triggers\nDouble dare any niggas, cross me and my city slickers\nPetty pocket pickers rocking niggas\nQuick to throw a rock at the bitches\nTrying to cock-block my riches on a hot block with snitches\nStill getting dough, still getting hated on the low\nStill doing sticks with Sideshow, eyes low from hydro\nDrive slow, beasts on our tail, rain, sleet or hail\nCatch me on these cold streets stackin' for bail\nNiggas is lacking the real so I brought the hostility\nBetter off killing me then trying to send me back to a cell\n\n[Verse 5: 9th Prince]\nEy yo; thugs with rubber grips and hollow joints\nSharp lead that fled through your pressure points\nCelebrity Death Match, we out like an axe\nBeing swung by a serial killer maniac\nPoetry brainiac, project hoodrats\nThey kill to hear my album\nBlack dust will get you blast\nThen throw on a ski mask and rob street's asylum\n9th Prince, y'all niggas can't solve him\nThese 9 Fingers of Death'll be the answer to your problems\nMy roof is like an infrared, I'm hostile\nNo Smiles, dogs growl when they're on trial\nRhymes travel 23 million square miles\nMad razor blades, throwing switchblades that'll cut you a fade\nLyrical maze, MC's lost for days\nWithin the 9th Chamber, another Wu banger\nFor all my Killah Hillside stranglers\n\n[Hook x2: Tommy Whispers]\nNow Born, Port Richmond, Killah Hill\nStapleton, West Brighton, Jungle Nillz\nIn Shaolin we keep it real\nShit is getting deep, reach for steel\nWe going all out, do what you feel\n\n[Outro: Tommy Whispers]\nTommy Whispers, nigga (Bastards!)\nWord is bond, come on!\nRevenge of the 9 Fingers\nGod, The Chamber continues\nWord up\nEverything is Everything\nGod be the King\nThis Shaolin shit is forever!\nForever..", "year": null, "title": "Generation Next", "image": "https://images.genius.com/aee759b8fa2fa70e9bb2b738d3297e33.462x462x1.jpg"}]}