{"songs": [{"title": "Caught in the Wind", "lyrics": "Ay they can't handle this one\nThis for the block nigga, what?\n\n[D-Tay]\nI make one move, hit your block, and your whole spot hot\nUh-huh, if you're lucky have your whole block cocked\nNow I ain't sayin that's gon' stop all my niggas that chop\nCause in they mind, ain't no dyin, niggas flip to get flopped\nShootin more than 50 shots and my heart catch not\nWhen the gunfire a-start it ain't no callin the cops\nBesides, you started beef, I'm just bringin it back\nAll my niggas you hunt around so what you packin a gat?\nJust leave that where it's at, or leave here on your back\nMake one move like you're reachin and I'm leavin you flat\nWarnings I'm givin you, but you never did listen\nSo I'm spittin Smith & Wessons 'til they out of ammunition\nI'm clip totin, holdin rollin with my cousin Priest\nI'm back, and ridin in the candy painted 'llac\nWe max, and gettin all these hoes for they cheese\nWe jack, and gettin all these ballers for they ki's\n\n[Hook: repeat 2X]\nDidn't think that I would make it this far, throwin rocks at the pen\nLeft niggas layin dead and I did it in sin\nAnd I'd do it again, thugged out 'til the end\nStill we gon' keep ridin 'til we caught in the wind\n\n[Rizin Sun]\nNigga I'm gon' make it if I gotta rob and steal\nCock back my grill, let 'em know this burner's for real\nWhen the coast is cleared that's when I plan my escape\nWanted in 50 states, my first shot is debate\nDon't be late, Buck we got hits to make\n50 is you with me, if they really want me they'd come and get me\nNow I'm a fugitive on the run, killers don't leave home\nWithout the gun, blaze one\nThey got me nationwide all over the world they tryin to turn me in\nBut the pearls, I think ahead on that\nFuck the pen, I'm tryin to see my money stacks\nIf you lookin for me I'm where the ballers at\nDrinkin Cristal gettin smoked out\nTry not to take the bar out, but they done, tapped my house\nI'm goin all out, got me on some major shit\nDressed in black, when I attack, please believe that\n\n[Hook]\n\n[Young Buck]\nI need to get my hands on somethin, I suggest you play it low\nGet your last words in when the soldier's rag over my nose\nLook the anger done build up, I'm damn near about to blow\nTryin to unhook a time bomb when I'm right at zero\nFuck a stolen vehicle, we gon' pull up in luxury\nBubbilize somethin, survive nigga you're lucky\nWhen shit get ugly, bustin e'rythang that rush me\nSwingin this fuckin chopper 'til my arms get musty\nThis occassion calls for military issue buddy\nMy fetti took a slight fall now y'all gon' be bloody\nYoung Buck, a.k.a. Frank Nitti of the city\nAin't fakin none to DT's, you got it then come and get me\nBut the form I come in, I swear it's hard to hit me\nNot a face bein shown, just a chrome tucked in my dickies\n\n[Hook]", "album": "T.I.P.", "year": null, "image": "https://images.genius.com/d018174ecb7b887477659509ddf44ca3.499x499x1.jpg"}], "artist": "Young Buck"}