{"songs": [{"year": "2015-08-03", "album": "YouTube Promotion Tracks", "image": "https://images.genius.com/d22dab44518982eea6d1dd56dae8f38c.600x600x1.jpg", "title": "I don’t know if you know", "lyrics": "[Intro:]\nIt's Kerser\nYo\n\n[Verse 1:]\nThey got me buzzin', Album 5 sounds like dynamite\nAnd when it drops another million rappers bite it right?\nI'm used to it by now, fuck I've been through everything\nA new producer by my side, is this what's meant to be?\nNow they questioning but i ain't gonna answer shit\nMajor labels wanna talk - what's a man to think?\nI threw my fucking program off to get my album done\nAnd now my doctor's asking how I'm fucking living ahhh\nI don't know what to tell him music runs my life\nI don't got the time to be here every Monday night\nAnd, if I have a break with music, fans are on my back\nBut I don't blame 'em, it's the Kers, you need a lot of that\nI'm just staring out the view of my new car\nIt's almost like I've hit the point where I've come too far\nOnly do it cause the fans need me right now\nSo how the fuck can I not give them my life - how?\n\n[Hook:]\nDo this for my damn crew, do this for my fans too\nI don't know if you know, I ain't stopped from Down The Drain ooh\nSee my world change, money made my world strange\nMoney makes the world go round, but money's on the world's pay\nDo this for my damn crew, do this for my fans too\nI don't know if you know, I ain't stopped from Down The Drain ooh\nSee my world change, money made my world strange\nMoney makes the world go round, but money's on the world's pay\n\n[Verse 2:]\nSometimes I think if I was broke then I would be okay\n'Cause I've been on both sides of that and seen the people change\nLike when you broke ain't no-one gonna hit you phone up\nBut when you're cashed up you won't wanna own a phone bruh\nLearn from Kers I'm the king to hustle music\nI got rich from this shit YOU fucking do it\nInstead of hating cos your CD's don't sell at all\nYou should be inspired made a win no help at all\nIt's what the Kers did all from fucking words writ\nTop the charts had the industry like \"Fucking word? Shit!\"\nAnd then these labels chasing for another signature\nThe future's looking even brighter I'm a winner bruh\nAnd I'ma bring the whole crew to the end of this\nABK 225 - Don't forget that shit\nIf the fans are feeling fucked, who they run to?\nThey come to Kers I can save their life with one tune\n\n[Hook:]\nDo this for my damn crew, do this for my fans too\nI don't know if you know, I ain't stopped from Down The Drain ooh\nSee my world change, money made my world strange\nMoney makes the world go round, but money's on the world's pay\nDo this for my damn crew, do this for my fans too\nI don't know if you know, I ain't stopped from Down The Drain ooh\nSee my world change, money made my world strange\nMoney makes the world go round, but money's on the world's pay\n\n[Verse 3:]\nCalm before the storm, wait till this album drops\nI'll have a hater skitzing out like they outta pot\nI'll have these rappers copying like \"How'd he do that shit?\"\nThey either gonna bite, hate or admit it's sick\nI hit a goal in the states with some new beats\nA long shot but they hit me back like do this\nAnd i ain't gonna drop their name till this shit drops\nIf you knew behind the scenes you would just agree with Scot\nI'm over stressing what the public fucking thinks of me\nAs long as I am on the rise I'm making history\nProbably take a couple years to realise what I've done\nI changed the sound of rap in Aus since i got my buzz\nAnd rappers hating I'll leave 'em on the floor again\nDon't they realise that I'm opening the door for them\nThey can lay back, man you's are washed up\nCan dreams come true? Shit look at Scott cunt\n\n[Hook:]\nDo this for my damn crew, do this for my fans too\nI don't know if you know, I ain't stopped from Down The Drain ooh\nSee my world change, money made my world strange\nMoney makes the world go round, but money's on the world's pay\nDo this for my damn crew, do this for my fans too\nI don't know if you know, I ain't stopped from Down The Drain ooh\nSee my world change, money made my world strange\nMoney makes the world go round, but money's on the world's pay"}], "artist": "Kerser"}