{"artist": "King Los", "songs": [{"image": "https://images.genius.com/cadae1b67d7c667ed27d41b42cd0970a.500x500x1.jpg", "title": "I’m On One", "year": "2011-07-18", "album": "Worth The Wait", "lyrics": "[Produced by Noah \"40\" Shebib & T-Minus]\n\n[Drake]\nI’m getting so throwed\nI ain't work this hard since I was 18\nApologize if I say, anything I don’t mean\nLike, what's up with your best friend?\nWe could all have some fun, believe me\nAnd what's up with these new niggas?\nAnd why they think it all comes so easy?\n\n[Los]\nSo I’m gon get it while I’m here, boy\n'Cuz I might not get this opportunity next year, boy\nJeez, guys, I jump on the beat, I go dumb\nYou knee high and I be on my fee-fi-fo-fum\nWas 'bout to put in work like T.I. old guns\nBut D-I-D-D-Y was on one\nThese weak-ass rappers come at me, I choke one\nMy daddy was a soldier, I’m G.I. Joe’s son\nOr Jackson, I keep it so G, I’m Joe’s son\nI’m top fivin’, you can come see why Los won\nBest rapper alive, it ain't up for an option\nNobody’s close to me\nI should be up for adoption\nI mean, one cell of my brain got Playstation capacity\nI’m so outta this world, there're space stations harassing me\nMy flow’s so a trip that vacations are mad at me\nAnd Einstein couldn’t get straight A’s in a class with me\nI out last ‘em, out class and merk you\nYou scared to go in like you out past your curfew\nAhh shit, don’t talk shit then bullshit\nMy thoughts get on some Thor shit\nIt’s war, bitch\nThat’s how it is, so get up off your coward shit and battle me\nI’m so charged up that I could probably shit a battery\nYou ain't seen nobody, like you skipped anatomy\nI’m at your Adam's Apple, shatter atoms automatically\nI’m on one, nigga, just a strong young nigga\nIn my zone, yeah, you fucking with the wrong one, nigga\nLike a private Christmas party and you ain't get the message\nSo just because your present, don’t mean you got presence\nAnd I’m so fucking gifted, you see me go light years\nSo its like you not here\nEven though you right there\nWhat I’ma bout to do to the summer done got the winter shook\nTook a page from history and stuck it in the Guinness book\nAs a bookmark cause I’m book-smart\nAll my thoughts took action 'cuz my actions took thought\nI hope the crown ain't safe, give you a creepy feeling\n'Cuz you look up to me and hate me, I’m like a leaky ceiling\nYou see me kill 'em, how I pounce on these beats\nAnd then I upstage rappers like balcony seats\nSee I’m in my whip and I got two sluts\nYour girl gots hips that I got to touch\nSlide it in her lips when I’m bout to nut\nKeep your eye on your chick cause I got two nuts\nAnd she on one!"}]}