{"artist": "Half A Mill", "songs": [{"album": "Milíon", "lyrics": "[Chorus]\nNew York gon' bounce to this\nD.C. gon' bounce to this\nHouston gon' bounce to this\nL.A. gon' bounce to this\nA.T.L. gon' bounce to this\nN.O. gon' bounce to this\nJersey gon' bounce to this\nV.A. gon' bounce to this\n\n[Half-A-Mill]\nWho dat? Blazin the track, Milion really on, from Philly on\nAnd the club spillin down, bouncin\nWe be gettin it on, that's that shit, keep puttin it on\nI'm a hoodlum and a don, smoke mad marijuan'\nWhere you from nigga? Brook-lan, damn right, hoodlum\nRaised in the heights, grenades the ice\nFaked it twice, laid ya wife, spray AK's in the heist\nLaid for 8 days, not to change the ways\nPull a record out, blaze the waves, blaze the A's\nMake it bounce, told them not to brake your legs\nBrake the stage, make ya day\nIf you layin up, when we gon' make some way\nMake someday, shit, we ain't came to play\nCame to stay, comin wit that ill shit\nTake it away, bouncin, what we makin 'em say\n\n[Chorus]\nMiami gon' bounce to this\nChi-Town gon' bounce to this\nConnecticut gon' bounce to this\nBoston gon' bounce to this\nDetroit gon' bounce to this\nCarolina's gon' bounce to this\nEverybody gon' bounce to this\nAlaskans gon' bounce to this\n\n[Spice 1]\nRidin down the block wit a Half A Mill\nTented windows in the Benz, all smokin to kill\nWe gon' bounce to this, roll a L to this\nPut the 5 to the Indo, clown to this\nWhy go? Gonna let you wit the diamond face\nSippin hennecy bottle, wit the speed to chase\nPoppin a collar to this, and thugs holla to this\nThrow you rolly in the air, nigga hotter than this\nWe pullin shorties, up the front of the steps\nTakin 'em off to back relax, with Crystal and yak\nIt don't stop till we hittin the last\nTorn sack, gettin stress, never get in Cadillac's\nGet in, where you fit in\nIf it don't fit squeeze, outta make up the cheese\nLike drop six-o, hydraulical g's\nJunk play in the airport, bouncin keys\nGon bounce from back, and side to side\nIf you in the club, in the car, doin tonight\nGotta limo good and goin up and down to this\nMe & baby 'bout try to make it bounce to this\n2 o'clock in the morning, put a pound to this\nToo many fish, smokin up an ounce to this\nYou ain't gotta be in my show to be a star\nCuz I'm a thug world, no matter who you are\nTake her to bathroom, bounce again\nCall up homies, you can call your friends\nEverybody on the dance floor get wit this\nMe and my nigga Half A Mill, comin sick wit this\nIt don't stop, livin in the world supreme\nAll the raps, nothin but a hustle to gleam\nBaby come and go in this lick wit me\nWe can be like Mickey and now Minnie\n\n[Chorus]\nSeattle gon' bounce to this\nAlbany gon' bounce to this\nCanada gon' bounce to this\nGermany gon' bounce to this\nThe whole Japan gon' bounce to this\nFrance gon' bounce to this\nThe whole world gon' bounce to this\nEverybody gon' bounce to this\n\n[Half-A-Mill]\nMill Gates, pill hate niggas, still hate\nScratch shit don't work, I'mma deal weight\nPeel on jake, and the silver eight\nI'm a real live nigga, dunn, I kill the face\nKill the snakes, four five, spit it ya face\nI leave dead bodies, in the riches of lake\nPushin wild body, five Mill Gates on the place\nMe and my dunn, Spice 1 got million to make\nIllustrate, nobody can't spit it this great\nWhen I hit it, bitch I'mma penetrate\nCuz I don't stop, get it, get it\nBout it, bout it, wit it, wit it\nNo doubt about it, niggas bounce to this ill shit\nReal shit, Brook-lan, what the deal kid\nHydro in the ill whip, ride low\nThen I'm wilted, duck 5-0\nMy name reign double here to Y.O\nNew Orleans to San Francisco\nSip Crystal nigga, no Sisqo\nYou can my presence and you roll wit disco\nIn your six hundred or your broken seven o\nHere we go, here we go, your new scenario\nThis is somethin for your radio\nHere we go, here we go, your new scenario\nThis is somethin for your radio\n\n[Chorus]\nThug niggas gon' bounce to this\nThug bitches gon' bounce to this\nAll my niggas gon' bounce to this\nAll my bitches gon' bounce to this\nIn your sixes gon' bounce to this\nIn your whips gon' bounce to this\nBrook-Lan we gon' bounce to this\nL.A. we gon' bounce to this", "year": null, "image": "https://images.genius.com/23e45bc88de0a6f6a0ac73d6b9f6b05f.500x500x1.jpg", "title": "Bounce"}]}