{"artist": "Isaiah Rashad", "songs": [{"title": "Grace", "lyrics": "[Intro]\nOne more time\nGot some hoes\nGot some hoes that read between the lines\nI-, yeah\nGot some hoes that read between the lines\nI like smoking weed, I like that\nI dream like three year old\nGot my-, I like-\nYeah, yeah\n\n[Chorus]\nI got some hoes that read between the lines\nI like smoking weed, I like that, I dream like three year old\nWith my diamond teeth, I don't need no bitch to hold me down\nI got more to see, got my sapphire 'focals on me now\nNo more monsters swarmin' round\n\n[Verse 1]\nDMT hit like a pound\nIt's my momma turn\nLet me strike some rule, and you a fool\nAre you down to burn?\nAre you-are you down to hold it too?\nAre you down to learn?\nAll my niggas know was Chattanoo'\nHand me down the shirt\nI come from-I come from where you goin'\nWhere them bitches at? Where them bitches at?\nIs that your Henn'? Let me finish that\nHoe, you know I'm good as granny food\nBring my nigga back\nRakim, don't you down that 100 proof\nWe just chillin', Jack, got 'em poppin' on a new terrain\nOn them bitches face\nI could fuck her, flip her, to a Benz\nWith my better rims\nThey don't make no fuckin' picket line\nFor your cousin, then\nYou might catch me prayin' for some J\nFor some better rims\n\n[Chorus]\nI got some hoes that read between the lines\nI like smoking weed, I like that, I dream like three year old\nWith my diamond teeth, I don't need no bitch to hold me down\nI got more to see, got my sapphire 'focals on me now\nNo more monsters swarmin' round\nNo more monsters swarmin' round\n\n[Verse 2]\nAnd just a reminder, regardless, you know you're special, yeah\nSo fuck the Matrix, the pineal, and phony vessels, yeah\nWe are the 'niners, we brought you a bowl for breakfast, yeah\nI'm glad your offer is often, like, sacrificial, yeah\nAnd oh my God, it's a God, I should never 'fessed it, yeah\nLike can you call me, I'm fallin', I need a blessin', yeah\nI never heard ya, I'm worried, I think you're human, yeah\nI see you bleedin', you need me, I never knew ya, but\nBut bust it wide, when you visit me\nHoe, at least you know that it's Rashad\nOver everything, now I got the world, but I was fine\nWith some Dairy Queen, I might fuck her, flip her, it's a line\n'Till they bury me, guess what happened on that new terrain\nIn the better place, I can't choose between this medicine\nAnd some better friends, thought we found the truth but then we lost\nAll the evidence, hold my Gucci, baby, don't get lost\nIn the Edison\nBaby, Gucci, baby, hol' up\n\n[Outro]\nI like to smoke\nMedicine, man\nLost, everything\nLost, Edison\nI like to smoke", "image": "https://images.genius.com/f3bf7e237d3161e1014a53c4a379c197.300x169x1.jpg", "album": "The House Is Burning", "year": "2019-07-25"}]}