{"songs": [{"album": "Scriptures", "image": "https://images.genius.com/fc08a4018680b3979b913a15b46cd21b.1000x1000x1.jpg", "year": "2019-06-07", "title": "Million Dollar Foreign", "lyrics": "[Intro]\nGotta watch my back because that bag is enormous\nPlease don't run up on me, I will have your family mourning, family mourning\nI done came through in a million dollar foreign\nYeah, yeah, yeah, ayy\n\n[Verse 1]\nThe safe out of space, like the roof on the Wraith, yeah\nHouse got a view with a lake, might go canoeing today, yeah\nI can sit back for a month off what I do in a day, yeah\nJump out the whip, then come off the waist\nCall the plumber, I done flooded the face\nWhat kind of trick is that?\nI’m in the Lambo', the Urus\nCame from nothin', I’m touring in Europe\nLook at God, granny be catchin' no cure\nDon't fuck with these niggas, no sir\nSic my dawg, what's the word?\nDiamonds dance like you got served\nI'm up in Gucci, 10K to the clerk\nAnd the roof missing no AMBER Alert, ah\n\n[Chorus]\nI done came through in a million dollar foreign\nHad to call that bitch an UberX 'cause she was boring\nI'm a felon so I might not make it through the border\nIf they made a movie 'bout my life, it would be horror\nI came through, did a show, and made a hundred\nGotta change my ways, I was wrong for bringin’ that gun in\nBut I done seen some shit that made me sick to my stomach\nSeen so many meet they demise, I learned from it\n\n[Verse 2]\nYeah, niggas don’t want no static, yeah\nStill got a few bad habits, yeah\nUsed to sleep on palletes\nNow this Benz I got 4Matic (Skrrt)\nSixty dollar salads (What else?)\nWith the crab legs, bring me a mallet\nMy niggas like animals, they won't trip if you don’t panic, ayy\nBring me another round\nWhat they gon' say to us now?\nWhen I got that bag, felt like the game went and touched down\nWent from bus stop to bustdown (What else?)\nBust bands, used to bust rounds\nI'm the big dawg, sit the fuck down\nBitch ain't fuckin’, why you come around?\nFree my niggas, RIP my niggas\nI be poppin' pills for the pain, nigga\nWhy you talkin' loud? You insane, nigga\nLeave you in the street with your brain drippin'\nRun into your mans and do the same, nigga\nI'll show you boys how to tame niggas, yeah, ayy (Facts)\nHeart of a thug, baby (What else?)\nProbably get to the plug, baby (What else?)\nYou gotta stop ridin' (Why's that?)\nI'm 'bout to cum, baby\nThey don't get far 'cause niggas dumb, baby\nWant a walk-through, nigga run eighty\nI'm a chance master, niggas can't play me\nGood defense, niggas can't take me, ah-hah\nAh\n\n[Chorus]\nAnd I came through in a million dollar foreign\nHad to call that bitch an UberX 'cause she was boring\nI'm a felon so I might not make it through the border\nIf they made a movie 'bout my life, it would be horror\nI came through, did a show, and made a hundred\nGotta change my ways, I was wrong for bringin' that gun in\nI done seen some shit that made me sick to my stomach\nSeen so many meet they demise, I learned from it\n\n[Outro]\nI done came through in a million dollar foreign\nHad to call that bitch an UberX 'cause she was boring\nI'm a felon so I might not make it through the border\nIf they made a movie 'bout my life, it would be horror\nI came through, did a show, and made a hundred\nGotta change my ways, I was wrong for bringin' that gun in\nBut I done seen some shit that made me sick to my stomach\nSeen so many meet they demise, I learned from it\n(Gang, gang\nI learned from it)"}], "artist": "Tee Grizzley"}