{"songs": [{"image": "https://images.genius.com/274188528bce177cee3b6d4bc092e46e.200x200x1.jpg", "year": null, "title": "Hey There", "album": "Recycle Bin", "lyrics": "[Verse One]:\nThis one right here is dedicated to the dedicated\nThe ones who thought they'd never make it, never made it\nHomie, I sat and waited for my chance\nI'd be damned if my number don't come up\nThe game needs a make over, I'mma get it done up\nThe days far from over nigga, I'mma bring the sun up\nThat would be the heaters\nFor the niggas that don't understand the metaphor through speakers\nI can squeeze space through the tweeters\nEither\nThe microphone controller, hip hop healer\nBentley wheel peeler, till the day they don't feel ya\nThe Daywalker out killing all the dream killers\nYou the liner filler nigga? I'm a scene stealer\nI got a mean build up, but my fan base been sealed up\nDon't touch that man's plate, he'll kill ya\nI've worked hard for it all, waiting for my pay off\nSo now I'm saying \"Hey y'all\nI'm here.\"\n\n[Hook]:\nHey there\nCould you help me please?\nCould you spare some change for the world\nFor the world to see?\nHey there\nCould you help me please?\nCould you spare some change for the world\nFor the world to see?\n\n[Verse Two]:\nI'm feeling like\nRecord labels don't get the picture\nThey ain't scared to experiment, cause they cloning niggas\nI did it all from club songs to snapping fingers\nTo backpack rapping to clapping niggas\nWhat the world wanted to see was the real XV\nPut on my white boy tee and gave them the real me\nThe person I only let my girlfriend see\nIt took her ass a couple years, the world get it for free\nHip hop elevates not staying in one place\nSo tell me what's the case with this beef with the south\nEverybody's overrated and few artists are hungry\nAnd that's why I think this whole shit's in a drought\nThough I hate to get on songs and just boast and brag\nBut in the past the most I had was my mouth\nSo I used that to lie about things I had\nUntil my friends came over and saw my house\nTrue story\n\n[Hook]:\n\n[Verse Three]:\nTell me what Dre needs to see\nOr L.A. Reid and Jay-Z\nTo give a chance to little ole' me\nThe boy from Kansas on 21st Street\nHop get Mike Caren to holler at me\nHoff holler at Diddy\nBut I'mma look that contract over a few times cause that nigga is shifty\nDarius Jones come holler where I stay\nYou gave Chingy a chance, I'm one state away\nThey say\nI'd be dope on G.O.O.D. Music\nProbably cause the way I make such good music\nI could probably bring another Grammy to the Family\nPlus I make my own videos, that's upping up the ante\nSigned or unsigned, every time I'mma spit it\nI ain't asking for a handout, I'm asking for a visit\nComplex is a classic, don't believe it till you hear it\nAnd if you think not, you a critic\n\n[Hook]:\n\n[Pharrell]:\nHey there mister, give me some cash\nI'm high as hell and I'm ready to blast\nI'm just one hit away from being passed out\nYou don't even ask out\nHey there mister, give me some cash\nI'm high as hell and I'm ready to blast\nI'm just one hit away from being passed out\nYou don't even ask out"}], "artist": "XV"}