{"artist": "Ant Banks", "songs": [{"title": "Ride Wit Me", "image": "https://images.genius.com/f5e3b268f1ab7a632ba28e1447e73a94.774x768x1.jpg", "album": "Derty Werk", "lyrics": "[Otis & Shug]\nGuess who's back? Guess who's back?\nGuess who's back? I just couldn't stay away\nGuess who's back? Guess who's back?\nGuess who's back? The player that's here to stay\n\n[Ant Banks]\nStarted out it went out to the bitches, until the game got vicious\nHad a stripper talking bout, digging each other some ditches\nWe were two hard-headed niggas, with dreams of being major\nNow we worldwide players, known for having paper\nSo they had to separate us, cause the boss couldn't stop us\nIt was a smooth-ass case of divide and conquer\nNow we back on that ass, who be doing Big Thangs\nRolling Benzos, smoking Rolexes and pinky rings\n\n[Pooh-Man]\nNow Banks they thought it was over but I return to burn that ass\nHow I'm living now player? It don't concern that ass\nTwo of Oaklands original danksters\nAin't fucking with nothing but ballers, G's and gangsters\nBeen in the game since 1989\nAnd still you young-ass niggas trying to downgrade mine\nSee I've been rapping since since your ass ing snotty-nose\nWith holes in your clothes and still got flows like bolos\nAnd fly solos and kedo\n\n[Otis & Shug]\nIt's some heavy-ass shit for the mind\nWhen I make a G and I reside\nIt's some heavy-ass shit for the mind\nWhen I make a G and I reside\n\n[Ant Banks]\nReal riders, come ride with me\nBig timers, get high with me\nReal riders, come ride with me\n(The player that's here to stay)\n\n[Ant Banks]\nWhile you was writing the rhymes, I was making the beats\nWe was signed to Jive and now we back on the streets\nA nigga loving it, pitch-black owned and independent\nBombay Music making change now we spending it, nigga\nClocking some scrilla, rolling with nothing but killers\nSupertimers, superriders, I know they feel us\nWith this heavy state of mind, sipping on my fire\n\n[Pooh-Man]\nNiggas be look who like the hottest, what you looking for I got it\nBest believe for three years I kicked back and plotted\nIt's the return of the bad man, with the bad plan\nI'm supersiding for life and got the best hand\nNow see I've been to the mountain top\nAnd that's just cool, Mercedes Benz dropped, rocks and Glocks\nPaperchasing from the gates trying to stack some cash\nAnd got a pinky ring full of ice to blind your ass\n\n[Otis & Shug]\nIt's some heavy-ass shit for the mind\nWhen I make a G and I reside\nIt's some heavy-ass shit for the mind\nWhen I make a G and I reside\n\n[Ant Banks]\nReal riders, come and ride with me\nBig timers, get high with me\nReal riders, come and ride with me\n(The player that's here to stay)\n\n[Ant Banks]\nI roll with players like Boo, niggas that know what to do\n115 oh zoom, got 'em fucking with Pooh\nTold me \"Be about your paper\" Boss major player\nToss a freak up with Keke and don't fuck with them haters\nReal riders I'm home cause the bitches are due\nThey can't fuck with this player, so the bitches try to sue me\nWhen I'm on one\nSo much love to my nigga that's on the run, Rock Rock\n\n[Pooh-Man]\nSee Banks them foos talk behind my back plot assassination\nBut I just chalk it to the game as playa hatin'\nNiggas supposed to be my homies, but they hate mo'\nBut you stay real through it all, they can't do fo'\nBut while you talking baby, Pooh-Man is taxing\nI'm certified gold trying to hit platinum\nBut now Banks since we fucking again (What's happening?)\nNigga, why don't you ride that forty-ass Benz\n\n[Ant Banks]\nNow see we got more bread to make (More bread to make)\nWe got more hoes to break (More hoes to break)\nNiggas got more haters to shake (More haters to shake)\nSo much game in the shit, nigga, we can't be fake\n\n[Otis & Shug]\nIt's some heavy-ass shit for the mind\nWhen I make a G and I reside\nIt's some heavy-ass shit for the mind\nWhen I make a G and I reside\n\n[Ant Banks]\nReal riders, come ride with me\nBig timers, get high with me\nReal riders, come ride with me\n(The player that's here to stay)", "year": null}]}