{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/b6545d163bea1139257b724af0d11099.640x640x1.jpg", "year": "2014-06-22", "album": "Anxiety", "lyrics": "[Intro: Raff Alpha]\nAwe shucks\nYo, yo, yo, yo, yo, yo, yo\n\n[Verse 1: Raff Alpha]\nHop up on the track with the super funky flow\nWith these instrumentals, I be putting on a show\nCuz I'm itching for some dough\nI could really use some mo\nBecause I'm poor as hell, my people living in poverty\nTryna get a record deal, but they never acknowledge me\nThey continue to sign these rappers that sound legitimate\nI remade the sound, but still be spitting the illest shit\nBut I'ma do it big to pay the bills for my mother\nI kick it with the Tundra cuz he's known to bring the hunda\nI wonder\nWhy they always knock the brother down\nThat was underground\nBut wants to wear the mainstream crown\nWow, please someone give me an explanation\nOf the constant hating\nOn the new Baltimore rap sensation\nHe goes by Raff Alpha\nHe's supa, dupa clever\nYelling out, \"Rest in Peace to Nelson Mandela\"\n\n[Chorus: BenJo]\nI'm wondering, will we ever made it out the slumps?\nI'm wondering, will our time ever come?\nI'm wondering if we ever make it out\nIf Lord give me chance, I'ma take it now\nI'm wondering, will we ever made it out the slumps?\nI'm wondering, will our time ever come?\nI'm wondering if we ever make it out\nIf Lord give me chance, I'ma take it now\n\n[Refrain: YBN Cordae]\nDa, da, da, da, da, da, da, da, da, da, da, da\nDa, da, da, da, da, da, da, da, da, da, da, da\nYeah, uh\n\n[Verse 2: YBN Cordae]\nIt seems that the underground, it start to come around\nNo radio, so there's no need to dumb it down\nI spent the lightning, thunder sound\nIt make me run the town\nAin't no use to you, running now\nWe already sonned you clowns\nBut I'ma make it, I'm confident\nThey intolerant\nBut in the future they gon' all know who Entendre is\nWondering about the far skies, whether apartheid\nTired of the dark lies, they say in our eyes\nFuck a history, life is misery with its enemies\nGet you mentally, was meant to be this way essentially\nFor centuries, my niggas been stuffed in penitentiaries\nTo infinity, they want us all gone eventually\nFuck America, cause hysteria and the chaos\nCuz in my area, life's a gamble like Las Vegas\nAnd they watch me rap off Omega\nAnd may God\n\n[Chorus: BenJo]\nI'm wondering, will we ever made it out the slumps?\nI'm wondering, will our time ever come?\nI'm wondering if we ever make it out\nIf Lord give me chance, I'ma take it now\n\n[Refrain: YBN Cordae]\nDa, da, da, da, da, da, da, da, da, da, da, da\nDa, da, da, da, da, da, da, da, da, da, da, da\nYeah, uh\n\n[Verse 3: Benjo]\nAye, mother nature's fresh green leaves\nFreezing up the paper that we coil\nNigga Giovanni lacks the huge, rooted from the soil\nWe use it for oil, fueling my aura\nWhen it get sports, with that raw shit that's never gonna spoil\nCheck the aura, ah\nI used to flow from the mainstream\nFrom the rivers to the lakes, creeks\nUntil I figured out that the swimmer would never shake me\nFlapping my fin\nYou see they attack swimmers safely\nGot that ocean flow, that swallowed though, that spaced me\nStyling free, with the spirit of the bigs\nLord is killing them softly till they graves, don't you dig\nHe's taking a swig of the roots that he's made me\nI'm the Raff Alpha of these double entendres baby\n\n[Outro: Benjo]\nHahah", "title": "Wonders"}]}