{"songs": [{"title": "Beef", "album": "Hump Days", "year": "2013-05-29", "image": "https://images.genius.com/75145c356837ef95317b2e1192749c65.1000x1000x1.jpg", "lyrics": "[Intro]\nWhat's up y'all?\nIt's Dicky, AKA chipotle aioli\nUh, basically I just love it when rappers is beefing at one another. It gives you like a chance to kinda act kinda tough, but, nobody really cares about me to the point where they'd ever be beefing at me, so I kinda just made up an arbitrary rapper to come at over a hard beat\nSo\n\n[Verse 1]\nCause if you really talkin' shit bruh\nI suggest you take a sec and recognize ma shit raw\nI been texting pictures atcho sister, be ma in-law\nYou know I been spittin' vicious, whatchu fittin' to get at ma dude\nI been killin' bitches, Michael Vick in the booth\nThe US see me, I be Kiffin to you\nI gotcho bitch up on ma stick she ride it sick\nLike it was quidditch but nude\nAnd I'm the honorary Gryffindor Jew\nAnd I don't care about ya bitch, or ya ya, ya riches or ya whips bro\nEven though you fictional, I'm guessing that you get dough\nNo you don't exist, but I see through you like a window\nDicky run this shit and you'sa cripple\nFuck it though, you dumber than Waka Flocka\nBe sonnin' you like a father\nD bomber than Osama plot\nAnd smart as Obama\nGotcho lil mama in the sauna all up\nIn the male locker room\nShe really good with the D\nThat's my Serge Ibaka boo, ooh\nDas dat dude, spittin' hot as Rihanna\nYou softer than llamas\nDo primadonnas faster than Ramadan\nI'll be honest, getting commas in ma wallet\nIs nada, ebonically smarter, the kike\nBeen flowin' nice as the Dalai Lama\nWhaddup bruh\nI'm goin' stupid cause I'm better\nThis the hottest shit like I was pooping in a sweater\nAin't nobody do you anymore, you a letter\nYou get it write? That was clever\nHo'\nBut look\n\n[Hook]\nIf you think you on ma level jabroni\nThan let me educate you, bet you need a fellowship homie\nLil Dicky rippin' dat ribbon cause what he spittin' is winning\nSo if you finna be some chicken for dinner\nThen hollaback up at the kid boy\nI'm spittin' good up in this bitch ho\nSo if you tryna get at me you better get a Mento, ahhh\nThat's word to ads from the past\nYa ass up in a jam if you come at the man\nThen yon't stand a chance\n\n[Verse 2]\nDas retard flow\nI been talkin' game on campuses I'm Lee Corso\nBattle me, he'll be like, \"Dude I ran.\" see Argo\nPackage all up in this dude caboose...free cargo\nFuck it. I'm really talkin' that shit\nI'm coming at a muthafucka that don't even exist\nBut if we under the assumption that he\nSomeone dat spit it redundant to someone incumbent\nThen he dumber than bricks, ya dig?\nListen to these bitches making hits and\nYou'll see the horrendousness dat be existing\nEvery minute some kid is diminishing a single\nWritten like a semi-retarded kid in kindergarten\nExcept he harder than me so poor Lil Dicky is\nStuck\nWatching stupid muthafuckers\nMake music and caking foolish\nWhile Jewish muthafuckas rate movies\nOkCupid to do a lil fuckin'\nBut if it's bout the rap, they on't want it\nThat's why I tell em look\n\n[Hook]\nIf you think you on ma level jabroni\nThan let me educate you, bet you need a fellowship homie\nLil Dicky rippin' dat ribbon cause what he spittin' is winning\nSo if you finna be some chicken for dinner\nThen hollaback up at the kid boy\nI'm spittin' good up in this bitch ho\nSo if you tryna get at me you better get a Mento, ahhh\nThat's word to ads from the past\nYa ass up in a jam if you come at the man\nThen yon't stand a chance\n\n[Outro]\nSay I didn't kill that dude man\nAy you can't blame me for like\nWanting to be tough once\nUh for those of you wondering\nWhy I'm on the toilet\nFirst thing I'll say is mind your business\nBut like second off, it's cause I wanted to hammer home the point that I was like shittin' on him\nLike literally I took it to that level\nWhich, like, I could understand the argument against that\nIt is questionable\nI, y'know, I might end up regretting this in the long run\nBut, y'know, uh, man, we got some much fucking mexican coke in this bitch man\nMan, shout out my connect, taco bar\nBringing that shit in from Mexico like it's nothing\nThat's that good shit\nUh, anyway, So Hard, that's online\nPeep that, hollaback\nStop saying hollaback! I say hollaback way too much for somebody who never says hollaback\nUh, the beat cut off so, this is acapella\nAnd goodbye"}], "artist": "Lil Dicky"}