{"songs": [{"year": null, "title": "Jaw of Steel", "image": "https://images.genius.com/c7ebb60abfe8b9b584644158594daf66.427x433x1.jpg", "lyrics": "Everybody want Kevin but nobody want fed\nI played cemetaries, been heckled by the dead\nBut Jeckel never Hyde. Every rhyme that I said\nWas part man, part wolf. Fight. Never fled\n\nTighten up the rents on little leather boots\nThe type to make advances but then never recruits\nLoosing to the man while the independent groups\nGot a bullet proof plan: \"don't meddle with the suits\"\n\nMy peddle got the loops. My chamber got the echo\nInvensted way too much in this here anger to let go\nMy vicious cycle is a calm steady tempo\nI always extinguish birthday candles with a death blow\n\nDim mark. Hand touch of the faithful\nSecrets never leak. Keep the Mescalito playful\nDevil on my shoulder saying \"I don't need no angel\"\nOther shoulder's cold silence hanging from a halo\n\nIt's the Jaw of Steel\n\nSwing low sweet chariot of fire\nLet me know if you need any help carrying it higher\nHad it up to here with this valley of desire\nBeing fearful of a god, and married to a liar\n\nNow daddy's tired of the war that he feels\nMommy's defenseless with a cross on her shield\nThe golden glove champ born in a field\nBacked into a corner, it's the Jaw of Steel\n\nRewind, Selector. Run that tape backwards\nReverse the curse and become radioactive\nIt takes practice just excaping these straight jackets\nIn a land full of snakes without no Saint Patricks\n\nMy Irish temper is a curse that is a blessing\nA sign that I'm alive although at first it gets upsetting\nA burst of addrenaline that then turns to depression...\nAnd I only go to church for a funeral or wedding\n\nSometimes I can't tell one from the other\nThe type of place where you could loose a best friend or a lover\nA bunch of people crying, keepin stuff under the cover\nConfess all your sins, mother fucker\n\nCome down, Selector. Boom! Bye bye to the emperor\nWould you die? Die for his leather?\nRely on the weather. They manipulate it with machines\nParade around naked til you freeze\n\nTornado chase her. Drink with your rival\nListen to the wind get caught in the spin cycle\nWorship the idol American psycho\nPortrait of a boxer trading in his golden gloves for a rifle\n\nChik-chik a-chik cha-chin check\nChik-chik chik-chik cha-chin check\nChik-chik chik-chik cha-chin check\nChik-chik chik-chik cha-chin check", "album": "Sick Of Wasting"}], "artist": "Sage Francis"}