{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/3ae84b594a511297bd256cc5b9c33afa.600x600x1.jpg", "title": "A Nigga Shot Me", "year": null, "album": "44108", "lyrics": "[Hook]\nLast night I had a dream, i woke up and thought a nigga shot me\nLast night I had a dream, i woke up and thought a nigga got me\nBut I'm glad it was a nightmare, that i had when i was having conjuring\nI've been living in a nightmare, every night [???]\n\n(Chip wake up. My nigga wake up\nChip wake up. My nigga wake up.)\n\n[Verse 1]\nMy inception is more perfect than perfection\nMy recollection is King Chips reflection\nHaving deju vu in my dreams, fuck does that mean\nEven in my dreams, won't let you fuck with my team\nI went to go shoot the nigga who killed Hawk\nParked the whip around the corner then got out and walked\nSo I'm standing in this driveway, chugging the brew\nLet the tech 9 sing as i scream fuck you\nHis next door neighbor thought that he was under attack\nA couple rounds hit his house, he came out with the mac\nI did a Michael Vick, Jessie Owens, wylin ass, rolling, felt a tingle in my neck and in my chest i kept going\nGot around the corner, hopped up in the hottie\nPeeled off. Start coughing, couldn't stop coughing\nLooked up in the mirror, i was [???]\nPulled the Buick over, said a prayer and then she woke me (She woke me)\n\n[Hook]\nLast night I had a dream, i woke up and thought a nigga shot me\nLast night I had a dream, i woke up and thought a nigga got me\nBut I'm glad it was a nightmare, that i had when i was having conjuring\nI've been living in a nightmare, every night [???]\n\n(Chip wake up. My nigga wake up\nChip wake up. Wake up nigga!)\n\n[Verse 2]\nThe next night i went to sleep and continued my dream\nWhen i dozed off i woke up in that Buick and bleeding\nI merely picked up where i left off\nI'm half dead, on the hundred twenty fifth, and my stolen asset\nStarted feeling around for my phone to call for help\nMight have to drive right to the Cleveland clinic myself\nDamn this shit is starting to hurt, choking on blood\nThat nigga who just shot me is still coming on foot\nStarted panicking, then remembered still have some bullets left\nHurt to up the tec, but i up the tec let him feel it\nYeah i hit him but he was still coming and busting shots\nDucked down in the Buick but damn, nigga got shot\nAnother one to the back, I'm burning rubber\nHit a couple corners, started thinking about my mother\nWishing i could say bye to my son, dying lonely\nI exhaled, said a prayer, then she woke me\n\n[Hook]\nLast night I had a dream, i woke up and thought a nigga shot me\nLast night I had a dream, i woke up and thought a nigga got me\nBut I'm glad it was a nightmare, that i had when i was having conjuring\nI've been living in a nightmare, every night [???]\n\n(Thank God she woke me\nThank God she woke me\nCause a nigga thought he was gone\nA nigga thought he was gone. On life)\n\n[Hook]\nLast night I had a dream, i woke up and thought a nigga shot me\nLast night I had a dream, i woke up and thought a nigga got me\nBut I'm glad it was a nightmare, that i had when i was having conjuring\nI've been living in a nightmare, every night [???]"}]}