{"artist": "Fabolous", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/8e2843dcf4a386d5de04cd6e203899e1.391x391x1.jpg", "lyrics": "No, no, no, no, no, no, no\n\nHomie, I don't think you know me (No)\nAnd I don't think I know you (No)\nBut this clip on the 16\nYou actin' like I can't let them (Shorty!)\nI don't think you know me (No)\nAnd I don't think I know you (No)\nThe way you shakin' that ass (No, no, no)\n\nNow there's nothin' in this world that I can't get ya\nI can't sweat ya, but I can't let ya\nDon't get carried away, I just met ya\nOr you can get carried away on that stretcher\nAnd you respect this gangster\nWhen you lookin' at this big diamonds and the\nNecklace, ain't ya?\nChecking the 22s on the Lexus ain't ya?\nPeepin' at them black air mex's ain't ya?\nFriends would say I'm gassin' ya\nCause there ain't enough room in the coupe for more passengers\nBut while they feedin' and hatin'\nWe be leanin' and escapin'\nKeep these beats circulating, but you mean I be thinking\nShorty's, a little bit too hype\nBut if a nigga give her anything\nIt will be the pipe, and it will be alright\nCause you know the kid will be the type\nAnd do it like Lewinsky, beeyatch!\n\n[Hook]\nHomie, I don't think you know me (No)\nAnd I don't think I know you (No)\nBut this clip on the 16\nYou actin' like I can't let them (Shorty!)\nI don't think you know me (No)\nAnd I don't think I know you (No)\nBut you lookin' so good\nAnd that's just why I can't let them (No)\n\nYou will never step out of line and come out your face\nCause you don't want to see these guns come out the waist\nIt'll be weeks before your neck come out the brace\nMonths before the verdict come out the case\nWhen I'm there, the hypno come out the case\nHip hop pops wait for me to come out the place\nBut you know whenever fellas go through\nI'm in the platinum and yellow gold too\nI'll always get them girls do the kinky things\nWhen they see the size of the pinky ring\nIt looks like a bracelet on my finger\nWedding ring in my ear\nEarrings on my neck, yeah what you expect\nNigga, I'm something like a pimp\nSomething about the limp\nBefore something like I'm pimp\nInstead I'm something like a pimp\nCause every thirty days I'm pulling up with something with a tint\n\n[Hook]\n\n[Bridge]\nAnd I know something that you don't know\nCan't nobody stop my nine\nCan't nobody stop my shine\nCan't nobody stop my grind\nAnd I know something that you don't know\nCan't nobody stop my flow\nCan't nobody stop my glow\nCan't nobody stop my dough\n\nUh oh, you might see me in Brooklyn\nMy heed is homie if you ever see me in Brooklyn\nCause my hat is on the top down when I go back\nMy bulletproof vest on under the throwback\nI don't see no other platinum rappers doing good like me in the hood like me\nBut keep it in the stat for when they pull the rover\nYou heard what happened the last time they pull me over?\n\n[Hook]", "title": "Can’t Let You Go (Remix)"}]}