{"artist": "Canibus", "songs": [{"title": "Gotta Get That Doe", "album": "C! True Hollywood Stories", "year": null, "image": "https://images.genius.com/b3eb34359661b0bc8191e1fdb19d157e.600x600x1.jpg", "lyrics": "Yo whattup Pakman\n(Aiyyo whattup Bis, I'm waitin for the Rip Off man)\nYo I just wanna know one thing (What's that?)\nYou ready to get that dough (No doubt)\nAIGHT!!\n\n[Hook: Canibus + Pakman]\nWe be the rippers that'll bring if you act shady\nAfter we fry you, we puff a blunt and then it's gravy\nAnd you can keep her cuz we don't care about ya lady\nIiiii've gotta get that dough! AIGHT!!\n\n[Canibus]\nAiyyo it's only a handlefull of rap critics\nThat every had a close-encounter with this rap wizard\nYou wack rappers can't rip it\nIn other words your lyrics are too primitive\nYou need to be more descriptive\nLook at the way I flipped it, a True Hollywood Story\nI manipulated this miserable music business\nThen I caked off two, by going independent\nHow much you make an album? About ten cents\nI make about ten cents, every sentence\nIt's my third album and I'm workin on my tempence\nI don't brag; I'm keep it modest\nI'm ain't hot; I'm the hottest\nI'm not being pompus, I went through a process\nI used to be a prophet, now I make profits\nYou sound like garbage, one of these days you gon' end up jobless\nPushin a shoppin cart with the same Cristal bottles\nYou was drinkin out of when shit was poppin\nI seen a episode on VH1 Documents\nThey talked about your drug addiction and what was behind it\nThe bottom line is, how much you sold\nNo one gives a fuck if you blow, you gotta get that dough\nI'm tired of niggas talkin about it, but I can't live without it\nI'm stuck if I ain't got it, so what's the logic?\nShould I talk about material objects, and get on some\n\"How you like me now bitch,\" wearing a shiny outfit?\n(Nah Bis, don't do that come on) Yeah, I know, I know\nBut no matter what I do I'mma get that dough, fo' sho'!\n\n[Hook] 2x\n\n[Pakman]\nWhen I get at you niggas, ain't nuttin personal I gotta\nEverything you spit, I'm predictin it's double copper\nYou the type of nigga to force a nigga to rock ya\nAlways got ya'self up in the middle of the drama\nFrontin for nothin cuz ya niggas told me you pussy\nNeed to get smarter and try to holler at the rookies\nFuck with Canibus & Pak and get that ass a coffin\nFUCK what you thinkin faggot, we rippin niggas open\nNow is a new day and we be focused on the paper\nStill'll get in you but the feeling for dough is greater\nPiling with hate and you need to holler at the maker\nIf you don't do it now, then you gotta face it later\nDon't even think about tryna dim a nigga shinin\nYou gon' fuck around and get slapped up with the iron\nEverything we do is connected with gettin paper\nAnd you ain't talk about it, so nigga I'll see you later\n\n[Hook] 2x\n\n[Canibus]\nIf ya know where ya comin from, ya know where ya goin\nI wouldn't doubt myself, not even for a moment\nI'm proud of my music cuz it's dope and I wrote it\nTrue Hollywood Stories opens in October\nDirected by none other than Canibus for a coper\nIt's no stoppin me, my commodity is growin\nI'll fly anywhere on this planet to promote it\nMaybe I should come out with my own line of clothing\nI printed up some Canibus shirts and I sold 'em\nI jump on stage, and I prove I'm a showman\nCan-I-Bus is a microphone omen\nI slam it when I'm done to make sure that it's broken\nThe industry's sick, man I'm already knowin\nNever had the luxury to choose, I was chosen\nWhere I come from, opportunity is golden\nPlatinum I already sold it, NO SHIT!!\n\n[Hook] 2x"}]}