{"artist": "9th Prince", "songs": [{"album": "One Man Army", "lyrics": "[9th Prince]\nYo, cyanide poetry, let it flow like Floetry\nSlow motion-ly, but still deadly as a Rakim melody\nMy brainwaves get expressed through the sound waves\nThe Runaway Slave with an army brigade\nThe dragon warrior with four arms and six legs\nI pledge allegiance to the Wu-Tang flag, and let me pants sag\nWhen I was young I had the BMX bike with the all black mags\nWu-Wear, silk fabrics, guns and grenades in my cabinet\nStudied martial arts and discipline from the e-ching tablet\nAttract like a magnet, went to jail and came home with a few habits\nLike smacking rap faggots\nKillarmy, we the greatest underground group\nYou know the theme, grab ya army suits\nAnd ya fat black boots and go out like troops!\n\n[Chorus: 9th Prince]\nYo, y'all people ain't ready for the war like military\nI write rhymes trapped in solitary\nBe careful what you wish for\nI sleep in a bulletproof valor\nAnd I'm hard to the core!\n\n[9th Prince]\nI've been fascinated with hip-hop ever since I was a child\nWith a destiny to be wild and make money by the pile\nPlus move the crowd with the force of a forty-four magnum\nThis might be my last album\nNot enough rap fans to feed this young healthy black man\nConcrete jungle, remain humble\nBut still shoot my way out the royal rumble\nExotic champagne, sunshower rain\nRaw cocaine is like poison to the brain\nPull out my dick then piss on Jane\nThe Avalon Don rockin' teflon, flow calm\nSet it off like an alarm\nIf I can't find you, then I'm shootin' ya fuckin' moms\nI'm wildin' like thugs on Riker's Island\nProfilin' but never smilin'\nCourageous cat, bust back then toss the mack\nI might speak in codes whenever I'm on the jack\nFuck all the chit-chat, you can get gat\nWu-Tang/Killarmy will never crack!\n\n[Chorus]\n\n[Outro: 9th Prince]\nWe on some hardcore shit right now, word up\nThe 9th Prince with many styles\nWild like a juvenile from Riker's Isle, word up\nPussy-faced niggas get dick to the face, word up\nI'm on some bullshit right now\nFuck all you clowns\nFuck around and lay down, nigga", "year": null, "title": "Be Careful What You Wish 4", "image": "https://images.genius.com/21cb3399de2cfe8fac890083e9323314.940x940x1.jpg"}]}