{"artist": "Willie D", "songs": [{"year": null, "lyrics": "Come on! Yeah!\n\n[Verse 1: Willie D]\nIt went like this, I got caught up in a clique\nIt was me, Dre and T, against six motherfuckers\nNigga went to talking like he was boss\nI hit his ass in the mouth, and squared it off\nNow it's two on one, and two on one\nAnd two on one, but a nigga didn't run\nBecause it's all about respect\nAnd I'mma get that while I'm here\nIf I don't get nothing else\nWe could have whipped them with our eyes closed\n'Cause them hoes, was dropping like dominoes\nBut then a sucker went to capping\nWe wasn't packing, so here's what happened\nI took one to the chest\nDre got away, but T wasn't blessed\nHe was hit in the head, as them bitches fled\nWe lay back in the red\nBleeding like a period\nLife light came, so you know it was serious\nOne time wanted a descrip'\nI had revenge on my mind\nSo I weren't saying shit\nPunk motherfuckers! stupid ass suckers!\nWhat the hell made them want to buck us?\nBut I'm a motherfucking soldier\nAnd I'mma pay you back, if I motherfucking owe you\nOne by one they all die\nMy girlfriend, and the movies was my alibi\n\n[Sample: (Average White Band - Stop The Rain)]\n(Yesterday you slipped away from me)\n(Without so much as one word of goodbye)\n\n[Verse 2: Willie D]\nNow a nigga owes me cash\nNext time I see him, I'mma bust a cap in his ass\nSo go ahead and call the florist\n'Cause I'mma shoot him in the face with my Taurus\nNiggas act like they got nine lives\nFucking with my money, thinking that it's funny\nI worked hard for mine, wheeled for mine\nDealed for mine, and goddamn it\nI'mma kill for mine!\nAnd die for mine, if it go like that\nMotherfuckers gonna learn how to act\nSome say I'm not sensible\nI still lynch them though\n'Cause it's the motherfucking principal\nOne by one they all die, die motherfuckers!\nDie motherfuckers! die!\n\n[Outro: Willie D (unnamed haters)]\nNow, for all you hoes, who thought I be Bo-Bo\nWhen I went solo\nThis is your mouth\n(\"Fuck that nigga Willie D\")\n(\"I went to school with that nigga, he ain't shit, he ain't gon' never be shit\")\nYeah, this is my dick in your mouth\n(\"mmm, that dick is good\")\nAny questions?", "image": "https://images.genius.com/99c31136e48907dfc450b10677d10058.400x397x1.jpg", "album": "I’m Goin’ Out Lika Soldier", "title": "My Alibi"}]}