{"artist": "Canibus", "songs": [{"title": "Cemantics", "album": "Rip the Jacker", "year": "2003-07-22", "image": "https://images.genius.com/3e434bcc2ae72261dadee52b9d388b8b.300x300x1.jpg", "lyrics": "[Verse 1: Canibus]\nAll right, yo, Let's talk about the incredible rap flow\nWe can have a Dinner for Five with John Favreau\nSee it comes to me natural\nOne of my integral attributes is to be lyrically tactful\nI can prove who's nice or who's not an MC\nThrough falsifiable scientific hypothesis\nIn recent times, I find it's never been about the rhymes\nThe game is very politicized\nThose who sympathize with their hearts and minds\nShow hatred through their mouth, body language and eyes\nSometimes I say to myself, \"Why do I even try?\"\nIn spite of whatever happens, I love it till I die\n\n[Hook]\n\n[Verse 2: Canibus]\nIf you don't believe in the other dimensions you been duped\nThey're the main ingredients in this cosmic soup\nSee the mouse? Grab it, edit the edges with Avid\nIs this the picture of a duck or a rabbit?\nYou see ass and tits, welcome to madness\nPlease, try to interpret the following passage\nMagenetohydrodynamic mechanics\nTranslated into Canibus language, you'll never understand it\nIt's on when the crowd is cheering me on\nWaving their arms like they doing Falun Gong\nFirearms three quarters of a million troops strong\nIn a single file line stretched out a mile long\nThermodynamics of the Second Law\nIsolated physical systems lead toward greater disorder\nAcross the dry desert in the featureless sand\nWater is secondary to the meaning of man\nI know but I won't tell\nThere's more to the human race than polymers, proteins and protocells\nChemical evolution, L- and D-form subunits\nWe come from the love of Hip Hop and Rap music\n\n[Hook]\n\n[Verse 3: Canibus]\nThe scourge of the words I attack the Earth with\nI bet you submerge dry and emerge wet, what you think?\nConfuse my shrink with English the publication refuses to print\nMy daughter likes blue and my son likes pink, man give me a drink\nWhat kind of world are we living in? I think it stinks\nWhatever life you live, it's a quick-sighted quiz\nIf you perceive something to be real, maybe it is\nForce your kids to listen to dead prez before they go to bed\nSend them to school, put them in special Ed\nReinforce their paranoia of the Feds\nMake sure they grow dreads and they live on the edge\nThe philosophy of the hard-knocks\nPan-psychics sit on the block and attempt to talk to rocks\nIn the projects where they harvest the human crop\nOrganic robots that bleed when they get shot\nIf you can survive or thrive in the Jamaican ghetto\nYou deserve a Congressional medal\nMy heart goes out to all the young bloods\nThe heart has reasons the mind knows not of\nFrom the 1st to the 12th month\nI keep a 12 pump in the trunk for the day when Hell comes\nWas invincible on the mic when I held one\nMy motto was to blaze all and spare none\n'I came, I saw, I conquered', now there's just an empty void\nMic Club come holla at your boy\n\n[Hook]"}]}