{"artist": "PnB Rock", "songs": [{"album": "RNB3", "title": "Aftermath", "image": "https://images.genius.com/2ae153a81de0e8de784287ae35882df3.500x500x1.jpg", "lyrics": "[Verse 1]\nHey\nLately I been on my fuckin' shit\nIt's no competition who fuckin' with me\nThis rap shit, I run it, I'm blowin' this money\nThese fifties and hunnids ain't nothin' to me\nI want the royalty, I want the loyalty\nPuttin' up money for lawyer fees\n'Cause I know me, man, I got a bad temper\nPut one these rap niggas right in a blender\nPnB: I'm who they'll always remember\n'Cause I be killin' shit, I spit that realest shit\n'Cause I done did this shit, I'm on that different shit\nCopyright all my shit, these niggas stealing shit\nI been feelin' like 2Pac and shit\nAll eyes on me, yeah they watchin' shit\nStudy my moves, tryna see what I know\nLike, \"How the fuck he get so poppin' quick?\"\nGot a lot of shit that's on my mind\nGot a lot of shit that's on my plate\nGotta feed the fam, gotta feed the hood\nSo I'm up and down that interstate\nDoing shows, havin' different meetings\nIn the studio, I been barely sleepin'\nSmokin' all this dope, I been barely eatin'\nIn a different city every fuckin' weekend\n\n[Verse 2]\nHey\nI'm your favorite rapper's favorite rapper\nI go in the booth and make it happen\nIt's amazing how this shit just happens\nFinesse the track without no fuckin' practice\nLately I get in the booth and I cook up a hit\nI'm rollin', I really can't miss\nThese bitches, they all on my dick 'cause they know that I'm 'bout to be rich\nI'm 'bout to be rich ('bout to be rich, hey)\nBlowin' money on stupid shit\nMe and my niggas strapped up in the rag top\nBut we all on that ruthless shit\nBitches, I'm pickin' and choosin' shit\nI'm hittin' bitches in twos and shit\nI swear my life on some movie shit\n'Bout to call Chop up to shoot this shit, damn\n\n[Interlude]\nHey Chop, get the mo'fuckin' camera ready, nigga. Let's make a mo'fuckin' movie, nigga. Movie time. Where my dope at nigga? I might get high, let's do this shit\n\n[Verse 3]\nHey\nCash rules everything around me\nSo you know I keep that thing around me\nReal niggas, yeah, they stay around me\nFuck niggas, stay the fuck from 'round me\nHey, I'm 'bout to go to Miami\nHey, cop a new lay for the Grammys\nHey, I'm cashin' out with my family\nHey, fuck you, you ain't with the family\nWhen I come through, better cuff your bitch\n'Cause I'm the type of nigga that'll fuck your bitch\nSing to the pussy, do my thing to the pussy\nAnd we can get into some other shit\nGot guns, got clips, you ain't duckin' shit\nThis for all the pussy niggas on that selfish shit\nGoddamn lil' homie, why you love the bitch?\nYou gon' die for the pussy? Well, fuck it then\nShot got the MAC with the rubber grip\nThat mean it ain't no more rumblin'\nHe gon' come through and start cuttin' shit\nPlus we got Kev in the cut and shit\nDamn!", "year": "2015-10-30"}]}