{"artist": "Petey Pablo", "songs": [{"album": null, "title": "Raise Up (All Cities remix clean)", "image": "https://s3.amazonaws.com/rapgenius/1372159499_Petey.pablo.jpg", "lyrics": "This is David Nevermind\nAnd today's controversy is coming from yet another member\n(Hey, yo, tell 'em that we not gon' be playin)\nOr should I say members of the hip-hop community:\n(I'll blaze 'em niggas)\nPetey Pablo - a new artist signed under Jive\n(Hey, yo, look at my homeboys)\nAnd has teamed up with Timbaland, outta Va\n(We gonna blow this up)\nIn a quest to redeem his title\nAnd bring, North Carolina, and Virginia, to the front of the line\n(Yeah, we gon' do it)\nWe're gonna stand by\n\n(Chorus: repeat 2X)\nThis one's for North Carolina! C'mon and raise up\nTake your shirt off, twist it 'round yo' head\nSpin it like a helicopter\nNorth Carolina! C'mon and raise up\nThis one's for you, uh-huh, this one's for who?\nUs, us, us; yes sir!\n\n(Petey Pablo)\nWho am I? Petey Pab motherfucker!\nFirst to put it down for North Carolina\nBut guess what (what?), it's been worth it\nI'ma superstar, bought me a big ol' car\nFour point six (see the car!)\nBlack fifty-four from the front to back\nAnd got a button in the middle, make the trunk go eh-eh\nBut it ain't 'bout that\nIt's about gettin' whatchu gettin' and drivin' all back here\nBig fellas (six fellas)\nHalf of me and Carolina niggas, I'm tired of y'all\nPolk, Bladen, Marshall, Hoke, Greene County, Timbaland, damn\nTransfer, Sandy Ridge, Browns over here (greens over here)\nPasqoutank, down on the, Odom East (lemme think)\nJohnson County, Franklin, Burgaw, Newport, Warren, Shelby, Kenansville\n(Man Catawba) Tarboro, Triangle, Goldsboro, Halifax, Stateville\nAnd all my niggas doin' life behind the wall\nThis right here, right here, right here's for\n\n(Chorus)\n\n(Petey Pablo overlapping Chorus)\nUh, uh-huh, uh-huh, beat it, beat it\nYou remember them day y'all, we used to play y'all\nThe radio and put our own lil part in the song y'all\nWe used to (Rep our city, rep our city!)\nRunnin' through the school halls\nJust before our basketball pep-rally jumped y'all (round!)\nMy house, my home, my hood (round!)\nMy brother, my sister, my cous' (round!)\nMy niggas that was there from the beginin'\nBeen wit me even 'fore they knew what bein with me was\nY'all niggas just glanced at it, now I gotcha starin' at it\nWouldn't been the same ol' North Carolina, it's been then\nY'all niggas just gettin' it, oh it's a shame isn't it?\nOh you thought we said we were comin' wit a whole other\nWe were bullshhh! (ahh!)\n\n(Chorus)\n(Petey Pablo)\nMan, I had to do it\nJust in case you were one of the ones who wanted to come\nAnd ask somethin' stupid\n(What you think you doin?) What it look like?\nPuttin' it down for my niggas in the south side\nNorth Carolina, South Carolina\nAnd all my little bitty open little cape towns\nWe gonna hit y'all asses, ain't nothin' but a T.D. blast\nThat we got comin' atcha, (beat) slammin', (first) classic\n(Go for this) What's after platinum?\n(Baby you don't want the bomb) And I don't meant to scare ya\nBut I'm about to bring it home\nBlow these fellas, these hills, these things and N.C. out the water\nHow's it feel to lose to motherfucker that be real\nNow tell 'em - \"I told ya!\"\n\n(Chorus)\n(David Nevermind)\nUh, af-after seeing this\nI, I have no other questions, I, I mean I\nHey look, this is David Nevermind\nI'm signing off, but before I'm outta here\nRemember, if I ever talked anything about the Polk guys, never mind\nNorth Carolina and Va. are definitely at the front of the line\nYou have my vote of support, over and out", "year": null}]}