{"artist": "R. Kelly", "songs": [{"album": "Demo", "year": null, "lyrics": "(remix)\nGive 'em a little, 12 Play\nIts time for love yo, 12 play\nJust give 'em a little\nKell, Kell re re Chopped (screwed)\n\nTell me have you ever met a girl that acted like that was her real hair\nWhen it's not?, not?, not?\nEver ran into a chick that said that she was mixed with something else?\nAnd you're like, please stop, stop, stop\nBut she looking so right, and her body so tight\nGot you at the bar drinking, buying her drinks all night\nClubs 'bout to let out and now you're drunk\nNow she leaving the club with me, sorry you've been punked\nBelieve me I know, listen to the remix professor\nSee homie before you tip her, first you must undress her\nCause this is how a real playa do\nTell me, do I have to sound like a broken record record record record\n\nChorus\nNow you've officially been chopped & screwed\nScrewed, screwed, chopped, chopped & screwed\nYou've officially been (and, and) screwed\nAnd ooh ooh chopped, screwed, screwed\nYou've officially been chopped & screwed..\n\nReeemixx\nNow now can I break it down and show ya\nBreak it down and show ya\nJust how easy it is to be chopped and screwed?\n\n1...You're in the club, she walks by\n2...She give you those bedroom eyes\n3...You think tonight she's gonna fulfill you're fantasies..yea\n4...Now you're both all on the floor\n5...And you're feeling all on her thighs\n6...Now the club is about to let out and you're like what you doing after this...yea\n7...She suggests the IHOP\n8,8,8... and Now you're putting her all in ya car\nStupid 9...You think you're gonna get some Bump & Grind...yea\n10..oh, now she wanna bring her friends\n11...Now the bill is up to 210\n12..Goofy, You give her your number,says shes gonna call but you never see her again\n\n(Chorus)\n\nCalm it down now, calm it down now\nCalm it down now, calm it down now\nCause that was a freestyle, cause that was a freestyle\nThat was a freestyle, that was a freestyle\nNow, just imagine if I had to sat my ass down and\nTook my time and really wrote it (wrote it) Oh", "title": "Chopped & Screwed Remix", "image": "https://images.genius.com/e54b7a47c059f99afc5429a8709acf02.400x400x1.jpg"}]}