{"artist": "Wiley", "songs": [{"year": null, "lyrics": "[Intro]\nYeah\nEskiboy (Shut your mouth, star)\nKnow me (Oi)\nI'm sitting down (Yeah) eating right now, class of 07 (Oi, hold on)\n(Hold on) hello, (Hold on) hello\nYo\n\n[Verse 1]\nI'm a karate kid like Daniel LaRusso, crane kick\nAnywhere I go, I see him trying on the same kick\nAnd the crane kick ain't even my main kick\nMy lyrics are like kicks from Van Damme's\nSwinging in the rain with eight pricks\nNone of them are swingers on The Matrix\nHis wife's got a link to The Matrix\nI've said too much and I hate this\nWhy am I shot up on the road, refuse to be wasted?\nNewcomers do what their mates think\n[?] so pain, it's like your hair got braid in\nDidn't find nothing when the yard got raid in\nAsk Little Dee, me and A Plus have got the plans\nSo you end up rich, not in a can\nIf anybody can, then me and my gang can\nI'm fifty four shots, twenty, I'm a dan\n\n[Interlude]\nDon't try and crown me\nClass of 07 (Hello)\nYou know I've been doing this for time\nHold tight them man, I still can't see ya\nI still can't see ya, trust me, where are you?\nYo\n\n[Verse 2]\nI've been away for a minute\nGot swayed for a minute\nI was in the hood, selling cocaine for a minute\nSent for God's Gift but he didn't wanna spray for a minute\nHis heart weren't in it\nBut I'm in it to win it, I got past it, Will's got no limits\nWin wars with fists, and guns, knives and gimmicks\nYour last hit was thirteen years old\nI'm not surprised that you still sing it\nI carry weight like Caribbean Joseph\nTop boy, what boy? Everybody knows it\nThem man are lucky, I never had the strap\nBecause I swear to God, I would empty the whole clip\nI'm like [?] fully loaded\nMost man in the game lost it, they eroded\nI'm Roman, I'm E3 area-coded\nAnd I didn't flop in the game like Jerome did\n\n[Interlude]\nYou get me?\nHold tight the whole game\nHalf of them don't even know what they're doing but guess what?\nGood, you know why?\nYou know why?\n\n[Verse 3]\nYou see the level I'm on, you wouldn't last long\nBecause I'm on the moon like Neil Armstrong\nI was the first one, I be the last one\nYou're too lazy, wanna be a star in the hood\nCome and ask one\nBut it's like, really, sitting in the top\nEverybody wanna try and pull a fast one\nSo I step off the top spot, once I'm advised from a legend\nI wrote this bar at midnight 07, January first\nI learnt to drive manually first\nMe and my sound, we were angry first\nIf shots were getting buss, I'm like \"can we first?\"\nUsed to like school but I kept getting kicked out\nWhat about music? Bring a few hits out\nI got it in me, mum died, brother too\nPlus I don't wanna be the one who missed out\n\n[Outro]\nEskiboy\nClass of 07\nEskiboy\nYou know me (You know me)\nHello\n(Run up on your girl quick)\nNasty", "image": "https://images.genius.com/de7dec0da580e6983af1849e89114aef.583x583x1.jpg", "album": "Umbrella Vol 1", "title": "Class of ’07"}]}