{"artist": "E-40", "songs": [{"title": "Countdown", "image": "https://images.genius.com/d593047f4a6d182171c88ef3ceef0912.1000x897x1.jpg", "album": "The Block Brochure: Welcome To the Soil, Pt. 4, 5, & 6", "year": "2013-12-10", "lyrics": "[Hook: C-Ballin]\n(Ballin') Got a blunt rolled, full of OG\nDouble lean cup, can't catch me\nGrey Goose to the face, and I'm 'bout to go up into space\nLike a countdown, 3-2-1 I'm gone, 3-2-1 I'm gone\nLike a countdown, 3-2-1 I'm gone, 3-2-1 I'm gone\n\n[Verse 1: E-40]\n3-2-1, I'm gone (Outta here!)\nMy screen cracked on my phone (Thug!)\nThey try to foreclose my home (Take it!)\nNow I'm gettin' my bank all long (I'm back!)\nTake baby steps, stay safe (Longevity!)\nLegends ain't built in a day (Work!)\nQuarter platinum plaques in the hallway (Money!)\nNot Frank Sinatra but I did it my way (Mine!)\nCut the top off the coupe, that's surgery (Serious!)\nMust be blind deaf dumb if you ain't heard of me\n\"Versace, Versace,\" I did that in the 90s!\nWith 2Pac and $hort and the Click and K-Ci from Jodeci\nBig face crown on my wrist (Rolex!)\nFinish face designer necklace (Corey!)\nBig chubby nigga but I'm dope (Saucy!)\nYou can't see me with a telescope (Bossy!)\n\n[Hook]\n\n[Verse 2: 2 Chainz]\nI keep it straight like a bantu (bantu)\nI keep it straight like 12:30 (12:30)\nI fuck over your bitch hairdo\nIf it's curly I straighten it, if it's straightened, I leave it curly\nI use baking soda for the recipe\nIf you mixing with me you get an extra key (ha!)\nAnd if I wasn't an only child (only child)\nMy parents would have had an extra G\nComma-zero-zero-zero-comma-zero-zero-zero\nGot dinero on dinero, man, dope boys is my heroes\nI got jewelry like a Pharaoh, I still get it for the L-O\nAnd it's hard for me to let go and it's hard for me to drive\nGettin head and gettin high, man, I make that pussy echo\nKnown for hit and runs, so I hope you got that gecko\nPut it in yo muthafuckin face like a freckle\n\n[Hook]\n\n[Verse 3: E-40]\nSlid in the function by my lonesome (Lonesome!)\nLeft out the function wit yo woman (Woman!)\nPockets deeper than the Red Sea (Peep! See!)\nQuarter million worth of jewelry (Jeweller!)\nBanked up, hella scrill, when I take a shower\nFuck a towel, bitch, I use a hundred dollar bill!\nI'm feeling how I'm posed to feel, off the sauce, I'm a boss (Boss!)\nTryna fuck on every bad bitch I come across (Cross!)\nLoyal to my soil, purple bag Crown Royal (Liquor!)\nL.A. Confidential sprinkled with the hash oil (Wax!)\n(What is you?) Money motivated\n(Where you be?) In the streets like bullet-shell casings (Bow!)\nI'm crack, nasal candy on the microphone (Dope!)\nSo much gas I need to own a Chev-a-ron\nShe on like a light-switch, y'all! (Switch y'all!)\nOn a pill, I ain't talking Tylenol (Bitch!)\n\n[Hook]"}]}