{"artist": "Wiley", "songs": [{"year": "2016-10-14", "lyrics": "[Intro: Wiley]\nAyy, listen\n\n[Verse 1: Wiley]\nDrink 'nough beers before the game, what d'ya call that? Georgie Best MC\nListen, I don't rest MC\nYou man sleep, that's why you're not the best MC\nYou man are part time, never had beef\nBut you're on the mic like a bulletproof vest MC\nI'm a double, precious, tek MC\nSeparate heads from necks-\nI was in the shadows, I came to the light with a path\nUs spitters who wanna be first and never be last\nI've been ahead of the game, I've been ahead of the craft\nI wanna laugh\nCome sailin' along like a boss\nWith the flow I'm like rah, what the ras?\nI'm a striker, yo where the pass? Get my triple A passes\nI'm sittin' with the stars\nListen up, I ain't normal, I'm sicker than my bars\nDriven myself crazy, I've been in every car\nNow I like to fly by on my black Yamaha, that's wingin'\nSome man do the crime and talk but that's singin'\nNot many man have been in the wars that I've been in\nI can work here but it's not a place that I could live in\nGettin' new money though but I've already made a killin'\nI've already made a scene, I already live a dream\nAnd the king's road's lonely, you can't go with him\nWhen it's time for a test\nMan ah man have gotta move swiftly 'cause you don't want a knife in your chest\nIn the hood every day, it's heroin, livin' like they're dead\nMade it, now you're lyin' in your bed\nIt's like, \"Yo, has anybody seen my flow right here, cuz?\"\nLive in your ears like earplugs\nKeep myself away like rare dubs\nWhat makes you so scared? I'm sure fear does\nOn the real though, I stand up and face it\nThe levels high in my scene, that's why I embrace it\nLet me go on and enjoy what I created\nMan will jump on the stage and go ape shit\nFor years I've been killin' it, trust me\nSwear down, I will never get rusty\nMy lyrics dem will rough up your lyrics like rugby\nFor the work I put in, the fans love me\n\n[Verse 2: Devlin]\nThis one ain't free but it's the liberty\nStreet divinity\nMe and Will's tyranny\nAnd this one's willin' me to rise like Pyrenees peaks and I'm lyrically\nIn the sky and then I'm ridin' through infinity\nForever after, Devs be the master\nHit 'em with the Corleone ting, Godfather of grime\nDon't charter to ride through parts of\nThis precinct when it gets darker\nDon't think you can stand the heat\nYou can't stand this peak\nI'm like a million and one lightyears way past of an artist's reach\nMary, I'm hard to beat\nNow think deep\nAbout this collabo\nHistorical events unravel\nLike I went Middlesex, I came to Harrow\nMy man said he feel paro\nBloody cuffs, heart on my sleeve\nThis shit feels like beef to me\nWhen I spit and my arms start swinigin', I'm bringin'\nMore raw shit than a Beckton works\nSmell it and know why Kano writ it\nWrote it, fuck me, alright, don't quote it\nFocus, look, now I'm back and it's hopeless\nComparin' me with these seeds\nToo rare a breed of MC and the flow shifts\nMore than once a minute\nGettin' off like Dahmer, I come and I kill it\nA Dagenham'er strapped with a bunch of lyrics\nThat bang harder, where the fuck's the gimmicks?\nThere ain't nada\nI've got the heart and spirit they can't harbor\nSilly men pass the limit and then scarper\nWhen it comes on top with the urban legend, I get 'em like Carter\n\n[Verse 3: Wiley]\nSpitters can't better these levels of terror\nI leave my brain in my car but my head is together\nI make a team of dons quit when I'm put under pressure\nRate Devlin, why? He's a grime treasure\nIn grime, I've lined my catalogue up, prime seller\nI'm never too far from the hype that I set up\nI step up like a bredda who's livin' in nice weather\nAt work, puttin' words together with ice letters\nI spray, make a big tree lean in the road\nTrees drop on your house to leave them a cold\nTrees drop on your car, the windows smash\nEski brought O2 Indigo back\nBut this whole time, fam, I've been holy in grime\nEven a first time who don't know me in grime\nBut you love my stage vibe when I'm holdin' a mic\nI'm a pro now, bro, I jump over the spike\n\n[Verse 4: Devlin]\nAny hardcore fan of grime\nGo mad when you hear this bang inside\nI got the keys like pianists, black and white\nI've been a beast in the scene all my adult life\nEver since Will said, \"Hello, hi\"\nI was sat in the shadows, high\nConcoctin' the maddest vibe\nWith a way less narrow sight\nThan a homo sapien eye\nX-Ray, make way for my death ray\nNikola Tesla reborn to a next stage\nTechnology stole our children\nThe world's in debt and our men are all templates\nI'll bring ten crates of my best mates\nPuttin' up my worst and best traits\nConverse in a verse with dead saints\nHoly grime, it's a blessed day", "image": "https://images.genius.com/756c169618448b515f483cb4840d5268.1000x1000x1.jpg", "album": "Godfather", "title": "Bring Them All / Holy Grime"}]}