{"songs": [{"title": "Hard", "album": "The LP", "year": null, "image": "https://images.genius.com/51783bd9801aa4b7b68f22b4f6fd7db5.1000x1000x1.jpg", "lyrics": "When it all boils down, who got the motherfuckin' crown?\nFor makin' that...\n\n[Hook]\nHard! Street, ghetto rugged\nBeat that'll make your whole crew say \"Fuck it\"\nHard! Street, ghetto wild\nBeat that'll make you feel my style\nHard! Street, ghetto beat\nThat I play when I think about out in the street, I got the\nHard! Street, ghetto style\n\n[Verse 1]\n(What about the smooth shit?) Yeah, I can do that too\n(What about the groove shit?) Yeah, I can do that too\nBut when it comes time to rock the block\nWho got that old mad ghetto type shit stocked and locked?\nLarge Pro, for those who don't know which way to go\nListen to your man's latest show\nWith the (Hard!) Street, you know the routine\nOn the concrete where the things ain't too clean\nAnd it only gets rougher, and some will have to suffer\nI was there, and even had to get my share\nBut as long as I'm alive, I will never forget\nWhat I had to go through to hit\nThat's why I play the...\n\n[Hook]\nHard! Street, ghetto rugged\nBeat that'll make your whole crew say \"Fuck it\"\nHard! Street, ghetto wild\nBeat that'll make you feel my style\nHard! Street, ghetto beat\nThat I play when I think about out in the street, I got the\nHard! Street, ghetto style\n\n[Verse 2]\nYou see, it's all in my blood, so I could never be a dud\nThe street mentality, I'll have you like \"What?\"\nWhen you walkin' around, both feet on the ground\nNo drive, about to take a nosedive\nKid, it ain't no joke, you either get gat or go broke\nOr get busy, the way the world turns, you get dizzy\nIn a spin, so listen to the rhymes I send\nThey're only a reflection of the times I've been\nOn the street tryin' to make it on my own, alone\nI've grown, and now I'm here to let it be known\nThat a wish on a star may be too far-fetched to catch\nEspecially when you're tryin' to stretch\nOne dollar to the next on the cement, with mad heads schemin'\nBut ain't got a chance, they're dreamin'\nAnd deal with the real with determination in this burnin' nation\nAnd listen to the...\n\n[Hook]\nHard! Street, ghetto rugged\nBeat that'll make your whole crew say \"Fuck it\"\nHard! Street, ghetto wild\nBeat that'll make you feel my style\nHard! Street, ghetto beat\nThat I play when I think about out in the street, I got the\nHard! Street, ghetto style\n\n[Verse 3]\nSee, if you can make it on the streets\nYou're live enough to make it any place\nI've seen many waste mad time and talent, and I just stay silent\n'Cause I ain't goin' out tryin' to preach a nonviolent\nCommunity rap, I had to learn\nThe streets'll burn any man that is not concerned\nWith a plan for the future, someone could just shoot ya\nOn any given, that's why I thank God I'm livin'\nOn this here day to relay the message I say about the...\n\nHard! (Repeat x8)"}], "artist": "Large Professor"}