{"songs": [{"year": "1993-06-02", "image": "https://images.genius.com/9703d795ec6c8c350b9674639f3fa5b8.500x500x1.jpg", "title": "Young Girl Bluez", "album": "All Samples Cleared", "lyrics": "[Hook x4]\n\"Huh huh huh, now what was I to do?\nShe's crying over me and she was feeling blue, I said\" - Slick Rick (Repeat 4x)\n\n[Verse 1]\nI was walking down the street, just a minding my biz\nI saw this young lady, the ultimate\nShe had a pair of jugs that was so fine\nThen I took a look at that behind\n36-24-36, I looked to her and I said \"I need a fix\"\nI asked her the same blahzay, blahzay\nHer name, where she live, and how much she weigh\nI got her digits and gave her my 1-800 beeper number\nYou can leave a message under the name of Rhumba\nI know you're bugging off the nickname, I would be too\nBut every time she be walking, she turns the heads of the crew\nWord is bond, I wouldn't be messing\nWith this girl if I knew she was an adolescent\nTo all the guys over 21, here's the news:\nIt's the hip-hop version of the Young Girl Bluez\n\n[Hook x4]\n\n[Verse 2]\nAs the story goes on, I get a little deeper\nI got a strange message on my 1-800 beeper\nCall my looney, crazy, psychotic or dumb\nBut I got a good message from a girl named Rum\nShe said come and get me from Mickey D's at 8\nThat's where I work after school, pick me up for a date\nI was so excited that she called my pager\nBut never thought to ask if she was a teenager\nShe mentioned going to school, but I didn't think it was high\nIf you saw what I saw, then you'd know why\nYou wouldn't believe or even think of\nA bird like that could be a dove\nI picked her up in my Lexus coupe\nOnly God knows what I'm doing is an oof\nAm I robbing a cradle? I'm very confused\nI'm stuck in the middle of the Young Girl Bluez\n\n[Hook x4]\n\n[Verse 3]\nNow I was seeing her for about half a year\nEverything was fine and dandy without shedding a tear\nAge ain't nothing but a number, that's what Chi-Ali said\nOkay, then why don't you get that through the judge's head?\nProceeding along, I must have to say\nIt was coming very close to her birthday\nI asked \"What do you want?\" She said \"A pair of earrings\"\nI never knew what an avalanche the future brings\nHer birthday came and she gave a party\nI arrived kind of late to the place to be\nPeople was excited for seeing my face\nIf my mother ever knew, I would be a disgrace\n\"How old are you now?\" to Rhumba-reen\nI was in shock when they screamed \"Sixteen!\"\nI felt like falling apart when I heard the news\nThis is the never-ending saga of the Young Girl Bluez\n\n[Hook x4]"}], "artist": "Biz Markie"}