{"songs": [{"image": "https://images.genius.com/2e0610f49e2d2bbabfcf95d4848bcab2.500x500x1.jpg", "album": null, "title": "Boost!", "lyrics": "[Verse 1]\nIn the past, the internet\nDidn't have video yet\nThen there came a website\nCalled YouTube to make it right\n\n240p\nWas the size of a video\nAnd the audio\nWas mono, not stereo\n\nYou could not upload a song\nLonger than ten minutes long\nThen we got a data boost\nNew features were introduced\n\n[Verse 2]\nQuality increased from 240 pixels in 360\nAnd YouTube added an option to watch videos in 3GP\nHey, hey!\n\nNetflix, Ustream, Roku and, let's not forget Apple TV\nAnother data boost as we got used to browsing audiovisually\nEee, eee\n\n[Verse 3]\nSuddenly, we're in the realm of HD\nA whole new level of quality\n720p\nAnd we went from 4:3\nBlack bars on the side to full widescreen\n\nWith faster data plans and broadband\nIt's like your holding a whole cinema in your hand\nI hope you brought your 3D specs\nSo you can see what's coming up next\n\n[Verse 4]\n720p was clearly never sufficient\nSo boost to 1080, improve your vision of the screen\nAs the videos streams\nAutomatic subtitles transcribe your speech\n\nVevo, ThumbsUp, and HTML5\nI can't imagine the size of the disk drives, it's like\nBandwidth gets bigger every minute\nWe need another data boost just so we can keep up with it\n\n[Verse 5]\nThe scene's a sea, we're swimming deep within it\nSingers, streamers, comedians, memers\nKeen\nIt seems we're keen to reach the limit\nIt's our forte\n\nEverything that came before was foreplay\nBut of course were going to raise the rate to 4K\nWith more frames\n\nEnabling smoother views of your games\nYouTubers are huge news for the new youth\nOld media bequeathing the future an leaving it to you\nI think you know by now what we need to do: boost\n\n[Verse 6]\nNow it's natural that we are\nBecoming compatible with VR\nCaviar\nRunning in 8K color space capable of displaying HDR\n\n360 degrees, it must seen for it to be believed\nIt must be heard Just like the world \"skrrt skrrt\"\nI don't know what that even means\n\nAll I know is everything is getting more excessive\nEvery morning I see something that is ever more impressive\nAll my messages amassing even faster than I get em\nThe progression is so fast that I cannot even get a breath in\n\nWhat do you think of the fact bringing the track back from the beginning of rap fresh as cinnamon baps and in the middle of that, Dan's reminiscing about video stats, still managing to kill it with brilliant facts?\nHe really is fast", "year": "2017-05-31"}], "artist": "Dan Bull"}