{"artist": "Cappadonna", "songs": [{"title": "Struggle With This", "album": "The Struggle", "year": "2003-10-23", "image": "https://images.genius.com/f7a7e9bd3d16cfdfd266ae989d07c7b8.500x500x1.jpg", "lyrics": "[Intro: Cappadonna]\n(... it's like I'm back in the guts, the worlds\nThe streets, the projects, it's always a struggle\nNo matter what you do)\nStruggle with this, come on ya'll, struggle with this\nStruggle with this, come on ya'll, struggle with this\nStruggle with this, come on ya'll, struggle with this\n\n[Verse 1: Cappadonna]\nAll ya'll fake ass niggas, what you know about this?\nAlbum after album, like I don't give a shit\nAnd you still writin', you ain't flippin' no bricks\nAnd you got a big mouth, but you ain't go no hits\nYou just a squirrel in the path, about to get ran over\nYour talk game is good, but where your Land Rover?\nYou never had a whip, you never had no chips\nYou was lookin' for Don', while I was takin' long trips\nCame back to Park Hill and I flexed my kits\nSmoke greens with ya'll niggas, come on, get a grip\nStop frontin' like you can't see.. (what?)\nDeep down inside you wanna be like me\nAnd get a little more fame and a little more pussy\nBut you so jealous of me, plus you kick dirt\nThat's the reason why ya'll niggas can't work..\nYo, yo, come on, ya'll, struggle with this\n\n[Chorus: Cappadonna]\nWe up early in the morning, and all night\nWe keep the armor of Allah on, ready to fight\nCome on, ya'll, struggle with this, keep it tight\nBecause I, am, thee, un-, ordinary life!\n\n[Interlude: Cappadonna, (King Just)]\nYeah, come on ya'll, struggle with this\nCome on ya'll, struggle with this\nCome on ya'll, struggle with this\n(Aiyo, Cap, one of those round math')\n\n[Verse 2: King Just]\nI'm rarely seen, cuz I'm out, chasin' my dreams\nMicrophone fiend, way before I was a teen\nMitch Green niggas all get punched in they eye\nChallengin' the champ, like I won't take their pride\nOr kick they hide, from here to the Westside\nTell you rest in the flesh, even the best done tried\nComply, or you'll be assassinated\nI'm dated and faded, download it and save it\nI made it, easier for the media\nSo you could understand me, without the slang Enclyopedia\nStay weeded up, like the kettel gettin' headed up\nTalkin' bout the kid, but I already beat it up\nIn the cut, like peroxide, or iodine\nOptimus shine, here to decline your slot time\nRock rhymes on point like a porcupine\nAnd if my ass get left back, I'mma catch up/Ketchup like Heines\nAnd define definition of an M.C\nTempt me, I ain't got a lot to give, I got plenty\nSince you went from 103 to 104\nThem dumb ass broads talkin' 'bout them more and more\nFrom shore to shore, I laid down my law\nAnd walk my Adidas on Colleseum floors\nScore like Fugee, Rhyme & Reason first movie\nI ain't gon' rest til I see Flex black a tooly\nOne bad mooly, who lost his cool-io\nWith this Julie ho, gettin' brains in the studio\nFigadoh! Return of the phantom of the opera\nPop a collar, pop it for Mr. Popular\nI could see through binoculars that you've been watchin' us\nYour best bet is to get your money set and start coppin' us\nBefore the deeds knock us, and push petal charges\nAnd fall off the face of the earth like slaughtered Sergeant\n\n[Interlude: King Just, (Cappadonna)]\nCome on ya'll, struggle with this (yeah, do it, right)\nCome on ya'll, struggle with this (Staten Island, stand up)\nK.J. all day, Donnamite (get fucked up)\nCome on ya'll, struggle with this\n\n[Chorus: Cappadonna]\nWe up early in the morning, and all night\nWe keep the armor of Allah on, ready to fight\nCome on, ya'll, struggle with this, keep it tight\nBecause I, am, thee, un-, ordinary life!\n\n[Interlude: Cappadonna]\nYeah, Hollyhood, come on, ya'll struggle with this\n\n[Verse 3: Cappadonna]\nI've been strugglin' a few years, now I'm back\nAll ya'll stupid muthafuckas best to learn how to act\nI ain't here to rap with you or here to clap with you\nCappadon', I'm just back on the map with you\nPlus I'm gettin' it hot, ya'll hatin' ass niggas not gettin' a lot\nScheming like a fiend and when the joint in the block\nKnow you can't get down, nigga, what you got?\nBig Don' beyond plot, stay low in the block\nWith the Glock, told them niggas in Crimestock\nHold ya head, it's gonna pop\nKeep comin' home, we gonna rise to the top\nLike one in the dome, nigga, we refuse to stop\nDon't get it twisted, the Bees gon' drop\nBut the heat's still rising and ya'll gonna get it\nIt's me, Big Cappadon' with the fitted\nAnd my goretex shit with the FUBU knitted\nAnd I'm coming back for all ya'll niggas that shitted\nKid back off, my thoughts make you wanna clap off\nRun from Don, I tear the wax off\nOsama Island, nigga we been wildin'\nStruggle with this, come on ya'll, fuck talent!\n\n[Outro: Cappadonna]\nStruggle with this, put that work in\nCome on ya'll, struggle with this\nHomicide Hill, come on ya'll, grizzly\nStruggle with this..."}]}