{"artist": "Watsky", "songs": [{"year": null, "lyrics": "So someone said to me the other day I've got a lisp\n\nA stranger, you know, they said I've got a subtle lisp\nAnd I should know I sound a little stupid doing spoken word\nWhen all my words with \"S\" in them are spoken so absurd\n\nAnd I'm not upset, okay it just sucks\n\nTo think you're speaking normally for two decades\nAnd then shucks—\nFind out your stuff sounds like a stanza of Severus Snape's toughest parseltongue is pronounced by Daffy Duck\n\nSo I will say this:\n\nMy subtle lisp is not sinful\nI'm not sorry Saturday, I'm not sorry Sunday;\nI'm spiritual and when I speak\nI celebrate the Sabbath seven days a week\n\nI've got special S sauce smothered on my skull walls like a tossed salad so silkscreen the Sistine ceiling on my soft pallet\n\nI sing along with super scenesters\nReciting Sufjan Stevens songs in skinny jeans\nDance salsa with soccer moms\nSneaking out in skimpy see-through sarongs\nI will answer your questions in stout\nWith my sexy subtly lisping sparkling incisor small\n\nWhat's my surname? Watsky\nWhat's my size? Stocky\nMy city? San Francisco\nIt's so sweet, now slow\n\nSee, I've heard some steamy stories of oral sex\nBut I'm not stretching to say one time\nI made a lady climax by speaking an essay section\nOf a Shakespeare sonnet in her split legs' general direction\n\nI scribble all S-Essays I shred them and sprinkle the whole S-ashes\nMy speech doesn't give a spotted sea snail if it passes\nI slipped past straight Fs to straight Ss in my classes\nBecause my speech stay second-semester senior status\n\nSeriously so so so so soon\nSo sick sixth grade school kids call me sofa king\nI'm on tongue steroids\nSlammin' with the Sammie Sosa swing\nSo tight I sleep upright in a small cell in Sing Sing\nAnd sail the seven seas on Steve Irwin's stingray\nWhile your speedboat's sinking\n\nIt's still too soon\n\nAnyway, screw an S.S.O.S\nI'm straight S.S.S for Save Someone's Standards\nStudied at Emerson; the school of savage speech\nSup, Stanford?\n\nI spit sexier than Summer Sanders, Sarah Silverman\nSusan Sarandon, Sissy Spacek, Sally Struthers, and Selena\nSpooning in a 6-way same-sex all S celebrity civil union\n\nSo, you can slander the gay lisp\nAnd I will slip you a solid list of friends\nOr 60% of Emerson; who\nLisp or no lisp, will stomp, spit, stay pissed\nAnd start all over on the racists\n\nYou can save the South Korean stereotypes\nThe Sambo shtick\nThe sexist shit is sickening\n\nAnd if you suppose your speech is normal\nIts 'cause your impediment is listening\n\nSpeak for those of us with something special\nSomething that sets us aside from my—\nAccent havers, my... stammerers\nMy southerners, my st-st-stutterers\nYes, I will spit it sick and stick to never skipping \"S\"\n\n'Cause I was—\nSuckin' on a soup spoon and I suckled it to sterling silver\nSimple, supple, super soaker\nStaying watching Sister Sister\nScenage syllables coming esophagus\nMove up there this place is\nSufferin' succotash\nSecond place isolate oxygen\nThere's no stopping this\nI start this step of speaking\nYou should see that I will not desist\nI'm sorry!\nCUSPI, if you don't like a subtle lisp\nThen you can simply suck on thissssssss", "image": "https://images.genius.com/15e329cac8808712e9bcdedd4c1b05fd.1000x1000x1.jpg", "album": null, "title": "S for Lisp"}]}