{"artist": "Z-Ro", "songs": [{"album": "No Love Boulevard", "title": "He’s Not Done", "lyrics": "[Verse 1]\nYeah!\nI know y'all wonder why a nigga wanna retire I can't stand this shit\nIf it ain't Mike D, if it ain't Slim Thug I just can't understand this shit\nHell yeah I been better than everybody forever but I really didn't plan this shit\nAlways been number one even though I wasn't running standing still I still ran this shit\nTurning up before they turned up\nWhen they was activator curl permed up\nThey was talking bout Texas niggas couldn't rap\nBut I made these motherfuckers learn us\nWe was street niggas, concrete niggas\nEven though they tried they couldn't turn us\nFuck these rapping niggas, I was slapping niggas, when I came around 'em they were nervous\nThey say 'Ro ain't the best, he is just depressed\nHe ain't got it all, he is just a mess\nHe don't give a fuck what you say about him\nLong as empire still cut the check\nLike they blindfolded, no rubber on\nThey don't really know who they are fucking with\nI am Michael Jordan I retire\nCome back and retire again for the fuck of it\n\n[Chorus]\nHe's not done yet\nHe's not done yet\nHe's not done yet, uh uh!\nHe's not done yet\nHe's not done yet\nHe's not done yet\nHe's not done yet, uh uh!\nHe's not done yet\n\n[Verse 2]\nMo city Texas that's where I come from I never been a bitch\nThrow grenades hoe fuck a Draco\nI'm killing everybody with this shit\nI don't play right broad daylight\nI give a fuck about the witnesses\nPull up and unload leave 'em slumped over\nFirst you see me then I'm in the wind\nSince I dropped Look What You Did To Me in 1998 I been a ghost\nGive a bitch hard dick or hard times\nIts too goddamn hard for me to give her my dough\nThey call me the king of the ghetto\nForever never gonna be another that can sit on my throne\nWhen I'm in my casket they gon' still be asking me to make another song won't leave me alone\nI'm way too solid baby\nI ain't never been to college baby, but I got a degree\nI got a lot of street knowledge baby\nFrom a nigga named DJ Screw\nIf it ain't him I be like DJ who?\nHe always told me to keep it real I'm a do what he say do\nAnd motherfuckers better get out the way\nGet your ass rolled over you better move when he say move\n\n[Chorus]\nHe's not done yet\nHe's not done yet\nHe's not done yet\nHe's not done yet\nHe's not done yet\nHe's not done yet\nHe's not done yet\nHe's not done yet", "year": "2017-06-27", "image": "https://images.genius.com/b81cbf6bb1fe48070f7c8d6b719ac922.1000x1000x1.jpg"}]}