{"songs": [{"image": "https://images.genius.com/3a2b5d523ed4c1887dcd3d37b71c01d9.1000x1000x1.jpg", "title": "Book of Rhymes", "album": "God’s Son", "year": "2002-12-13", "lyrics": "[Intro]\nAlchemist, you know me, man\nI'm the type of nigga that write rhymes\nRight on the spot in the studio soon as I hear the track\nYou know what I'm sayin'?\nWord, but I wanted to bring\nA couple of books to the studio today, man\nI found these shits up in the crib, man, in boxes, man\nI don't even remember when I was writin' these shits\nOr what's in these shits, man\nProbably a bunch of bullshit, man… fuck it, check it\n\n[Verse 1]\nHow can I trust you when I can't trust me?\nPicture myself a old man, a O.G.\nSome niggas will conversate with liars all day\nTime pass— (Nah, let me start somethin' else)\nSoul on ice, death threats given by clowns\nI guess livin' is prison when you live around clowns\nI'm hexed, cursed, worse I been blessed first\nI thought I was abnormal\n‘Cause I would overcome any tasked called to\nSo there it is, I'm a prince, I'm against lames\nWho do minor shit, swear they on the top of they game\nYour rhymin' is called \"Vagina Monologue,\" it kinda supports\nTheories of scary niggas who should lie in the morgue\nRarely y'all come in contact with the real\nSince Pun passed, he was the last shine of sun I could feel\nYo, said there's a few left since music's expressions of life\nDamn, I wish I took more time to write in my book of rhymes\n\n[Break]\nOh shit, Tina!\nI been lookin' for this bitch number, damn\nNo, this rhyme is weak\nThis is weak, I remember this bullshit right here\n(My book of rhymes)\nGandhi was a… what the fuck?\n\n[Verse 2]\nGandhi was a fool, nigga, fight to the death\nThe US Army is a school that teach you plights of conquest\n(I wonder when I wrote this… nah, it's weak)\nThe money's your religion, sky the limit, live life\nNumbers is big business, makes the poor live trife\nThe glimmers of hope provoke those without dollars to dream\nThrough your existence become wealthy, knowledge is king\nPimps and card sharks, thiefs, murderers with hard luck\nAddicts and fiends prostitutes passin' for teens is my society\nCops that shoot blacks is routine for notoriety\nGrow up watchin' well-dressed niggas with charms\nBeautiful ladies on their arms\nDangerous new cars was my fantasy for Nas\nRubbin' my lips with Campophenique\nStill behind the ears wet, turned out to be\nPioneers vets amongst hustlers, crack sellers, and liars and squares\n(Nah, that was weak there)\nMy people be projects or jail, never Harvard or Yale\nPardon me type in my two-way while I'm chargin' my cell\nIt's hard to be iced up with Gucci, God, poverty's real\nI can't fight you, ‘cause you would sue me, niggas be groupies\nI see imitators tryin' to make albums, spittin' my style\nAnd they don't even realize that I notice they stealin' Nas' shit\nI pump some Rick James with that Teena Marie\nMy nina lean on me like Scoob and Scrap\nThis can't be my book of rhymes\n\n[Break]\nThis can't be my book of rhymes, writin' this bullshit!\n(My book of rhymes)\nNah, neva that! Fuck that!\nAw, why you laughin', Alchemist?\nHah, you a funny nigga...\nNaw, yeah (My book of rhymes)\nI'm tellin' you, I'ma come up with some new shit now\nFuck that! I'ma write again now, fuck that!\nI musta been high on some shit… what the fuck is this?!\n\n[Verse 3]\nLook how we treat pregnancy, women in the hood\nOur values so low, our values are no good\nThings our mothers told us we should've heeded\n‘Cause now we need it, we older, almost able t—\nI'm jealous of you, how come you so beautiful?\nSmellin' fresh, youthful, intelligent, while I'm stressin' and shit\nAyo, I envy you ‘cause all you do is smile\nAnd things come your way\nSuch a innocent child is what some say\nI get upset ‘cause I just want to be treated the way you are\nLike a star, not a worry in this world thus far\nBut wait a minute, we both need your mother's attention\nI must be crazy, jealous of my own baby infant (Kinda crazy)"}], "artist": "Nas"}