{"songs": [{"title": "​sorry!", "album": null, "year": "2016-10-06", "image": "https://images.genius.com/e4725a448c159f07e278ffb1a05ca2b9.500x500x1.jpg", "lyrics": "[Intro]\nOh my god, Nathaniel, I done called your phone so many times today. You think this is, you made, you know, you made  that song \"so cold\", you think that you, you know, you're all icy and whatever, but you ain't shit, fuck up, \"lil ricefield\", what kind of name is that?\n\n[Chorus: lil ricefield]\nSorry shorty, got no time, you know I got to blast\nIPhone and an iPod Touch, but I won't text you back\nKnow I gotta shine, glowed up hella fast\nDidn't mean to stunt on you, but I can't take it back\n\n[Post-Chorus: lil ricefield]\nSorry, sorry, my bad (My bad)\n(So sorry) Sorry, sorry, my bad\nSorry, my bad (My bad)\nSorry, my bad\n\n[Verse 1: lil ricefield]\nI don't need nothin' from you\nCountin' all my hundreds and blues\nNow they all fun like we cool\nBut I don't speak nothin' but the truth\nY'all clowns just mouthin'\nLike, wow, y'all found that from the town\nI ain't 'bout that, tell 'em bounce back, bounce back, aye\nI do not roll with no fake, all of these skanks want the change\n[?] got me hella dazed, I ain't got no time to waste\nYung Nathaniel got the recipe, go fuck around and get baked\n[?] everyday\nI'm from the Bay, know that I gotta stay based\n\n[Chorus: lil ricefield]\nSorry shorty, got no time, you know I got to blast\nIPhone and an iPod Touch, but I won't text you back\nKnow I gotta shine, glowed up hella fast\nDidn't mean to stunt on you, but I can't take it back\n\n[Post-Chorus: lil ricefield]\nSorry, sorry, my bad (My bad)\n(So sorry) Sorry, sorry, my bad (I'm sorry, oh fucking shit, oh my god)\n(Alice, it was completely my fault, my sincerest apology)\n(My names not Alice!) (Oh fuck!) My bad!\n\n[Verse 2: zé rosé]\n[?], shawty, stay on beat, I be like metronomes\nShawty couldn't dance with me, had to get left alone\nWhat you stressin' for? In a session with my bros\nKeep us in the fold, no sleep until I reach my goals\nGet a little bit of dough, keep a little bit of dough, aye\nKnow they watchin' how I shine, I be gettin' to my glow, aye\nShe rollin' that shit in the back of my whip, I be blowin' it out to the wind\nMy swagger done high from the fit, I'm sorry, I'm sorry you're mad that I'm rich, yeah\n\n[Verse 3: seiji oda]\nTryna take the whole summer off\nYou know I had to get my hundreds up\nCouple shows and now they lovin' us\nGas gasin', like a Hummer truck\nLil Seiji, [?], gotta get it [?], ready for the problems\nYou should exercise a little caution\nWatch this drama, you ain't finna stop us\nStep up off that pedestal, yeah\nI'm sorry, but you gotta go\nHad to stunt on you, it was intentional\nSorry, but I didn't know, I didn't know\n\n[Chorus: lil ricefield]\nSorry shorty, got no time, you know I got to blast\nIPhone and an iPod Touch, but I won't text you back\nKnow I gotta shine, glowed up hella fast\nDidn't mean to stunt on you, but I can't take it back"}], "artist": "​lil ricefield"}