{"artist": "AZ", "songs": [{"title": "A.W.O.L.", "image": "https://images.genius.com/f7164c7711f98cbf75acb3b0f523d851.744x728x1.jpg", "album": "A.W.O.L.", "lyrics": "[Animal]\nIt's another interlude motherfucker\nYou know it's Animal the Mixtape Bully nigga, MTB\nYou know how I do it the way I do it when I do it the way I do it\nMotherfucker stab you in your throat with a icepick\nShoot you in the face with a beebee gun\nWhatever I do to bring you to the conrete I'mma do it, you heard?\nMy motherfuckin nigga A, it's the closin of the album nigga\nI salute you nigga, for never bein a bitch\nFor never bein a bitch-ass nigga {*music starts*}\nCryin, retirin, sayin you comin back to the game\nGo findin God and comin back, keep gettin shot and comin back\nNiggas doin mixtapes and comin back\nLyin 'til y'all caught with guns and comin back\nKeep comin back baby, you in the top five man\nY'all niggas pay The Source for mics man\nCause you don't know how to be an original nigga from the streets\nI respect you man, close it out like this, 2-double-oh-5\nFuck the world, you heard, say what's up A.W.O.L. take it\n\n[AZ]\nI am one of the flyest, crew is like the Al'Qaeda's\nWe war like in the mess halls of Elmyra\nBodies get caught, predicate spells is higher\nWhy talk if you ain't walk through hell's fire\nAll-nighters, upscale attire\nIn car get new cars you and your mans admire\nYoung messiah, back bottom guns for hire\nI am that what the rap contracts require\nGhostwriter, coast to coast cyphers\nI do this for them grown men in diapers that don't like us\nThough, still the nicest, sendin kites to Rikers is priceless\nReminiscin on past life fights with Cypress\nHung lifeless, sprung from financial crisis\nNever ran, I stand amongst the righteous\nAZ-Q, dark denimy V suits\nHis, arson is lethal, only pardon his people so\nJust ask it open or closed casket\nCoke or the dope acid I'm back on that old Shaft shit\nGot my ratchets, army fatigue jacket\nFitted cap on backwards with them cats from Flatbush\nBravehearted, fuck if they say squash it\nWe remain the largest, we invade regardless\nTrains to Spofford insane with a brain from Hartford\nIt's hard to explain my artwork\nOne for the haters, two for the true and the raiders\nI know dudes who eat your food with a razor\nIt's major, barbaric, brutal behavior\nCalled addict, I talk about the jewelry later\nMy respect is for the DL cartel connects\nAnd the crews that came through and left arise well effect\nFinesse, big boys only play with the best\nIt's no regrets, bein dead broke and raised in the 'jects\nI'm a vet, cousin Comstock callin collect\nSayin he just left the box hot annoyed and depressed\nClaimin he stressed did a 3 still facin the stress\nI'm like look this ain't the vote and you ain't facin your death\nSo save your breath, tie your boots up and bang with the rest\nCause in reality they just incarcerated your flesh\nYou know the deal, I pray they process your appeal\nCause on the real, I still got my hands on the wheel\nAnd I'mma drive 'til the gas run out\nEither crash or a wrap 'til a smash come out\nWe them real niggas", "year": "2005-09-06"}]}