{"artist": "Problem", "songs": [{"album": "Welcome to Mollywood 2", "title": "Like Whaaat", "image": "https://images.genius.com/b1ed996e39c23e18263557323484529a.500x500x1.jpg", "lyrics": "[Verse 1: Problem]\nWho that, talking 'bout, who that\nRun up on me? You get your ass beat blue black\nGo on get nerve, I'm off the curb\nPush mountains of herb, you niggas already heard\nThe bro Berg keep a pistol grip pump on his lap at all times\nWherever, however, 'cause young niggas stay tryin'\nSee 'em and be like “Huh, nigga what?“\n“Huh? Give a fuck like whaat?“ Blow my weed\nSmash the gas, hop up in my lane\nShit be looking way different through these thousand dollars frames\nMi- Mi- Millionaire mind, fuck a thousand-dollar brain\nThousand dollar lame only get loud around his gang ass nigga\nAss nigga\nCompton for real, you ain't gotta ask nigga (nah)\nFloating through the city like I'm on a raft nigga\nMike Vick with the shit, I don't need to pass nigga\nLike what that shit do\n\n[Hook: Problem]\nYeah, I'm just doin' my thang\nFingers in the sky\nBang- bang- banging my gang like ooh\nGo on fall back\n'Cause you don't want no problems like that\n'Cause we gon' be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like\n\n[Verse 2: Problem]\nYour money funny, you a clown\nYour bitch hit me up then I'm probably going down\nIt depends on how much of that shit I just had\nPill cool but I prefer my MDMA by the bag\nHeavy hitter right here, all you other niggas jabs\nBig talking 'bout beef 'til you serve they ass a slab\nDo the math hoes clash, 'cause I got them yelling\nWoo, like Flair\nAnd when I'm done they always ask\nHow you do dat there? Hold up\nWord to Master P and Young Bleed\nI pull your bitch she trying kick it fast as Chun Li\n'Cause I'm a pimp see, word to Bun B\nUnderground king, no checker, shout out to the bitch pressing\nGet a weight lift, reppin' Cal like Ripken\nI'm on fire right now, P burnin', no syphilis\nStrap it up, you murder the pussy\nReal beef you don't talk, you just murder a pussy\nSee me?\n\n[Hook: Problem]\nYeah, I'm just doin' my thang\nFingers in the sky\nBang- bang- banging my gang like ooh\nGo on fall back\n'Cause you don't want no problems like that\n'Cause we gon' be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like \"Huh? Nigga what?\nHuh? Give a fuck, nigga whaat?\"\nA nigga be like\n\n[Verse 3: Bad Lucc]\nWho that?\nI bet your lady knew that\nShe said he got a ticket on the molly, mommy do that\nTalking with my round Diamond Lane, I thought you knew that\nPound half-Raider, hunned sixes is where we grew that\nSee me on the 10 with my squad, we so trill\nOr uptown with them foolies niggas, trapping by the mill\nI do it for my bros of the Locke\nThem hoes on stop\nI used to wear Pirellis back when Nelly was on top\nNow it's 442, my pack a bang, rewinding\nMy bitch is red as a Honda throw back on them Yokohamas\nI be slammin' the scraper\nYou touch the paper it's go, me I just grind it for show\nThese hoes is thinking it's snow\nI get it going my nig', I blow the horn and she ready\nDisrespectful? Nigga please, I’m the one with the fetti\nI'm going out with a bang, it's Lane on the chain\nI just show up with diamonds, nigga, 'cause Lane is the gang, ha!", "year": "2013-02-12"}]}