{"artist": "ILL BILL", "songs": [{"title": "Murdered", "lyrics": "Extra extra! Read all about it!\nExtra extra! Read all about it!\nExtra extra! Read all about it!\nSucker stepped up and got murdered\n\n[Verse 1: Ill Bill]\n\nThe architect before the hour begins\nI bring storm to your valley of death\nWithout fear with my pistol up to your head\nYour life is an illusion, a mirage, and a perversion\nOf God, orgies and morbid sorcery shall arise\nFrom the Judas Priest, the altar of madness\nJoin us at the darkest Sabbath\nPick hollowtips, harvest Magnums\nMy crops is Glocks, farmer tan’s tropical\nMy arms are black metal with threaded barrels and chopper screws\nElectric skull up in the wall of voodoo\nFelt like clips based all upon call of ktulu\nA real dude AKA Bill Duke, I kill crews\nBig goons homie shoot up the casket, we fill tombs\nMake shit move, twist truth, never will lose\nPull out the big Uz, let the clips cruise\nEvery word I speak causes explosions\nI torture soldiers, hearts frozen\nAR-15s and roses, stiffening decomposing\nYou got murdered\n\n[Chorus x 2]\n\n[Verse 2: Crooked I]\n\nYo thirty-nine ounce pistol rosewood handle\nFive heads thrown to the barrels spitting new ammo\nIf it’s over my money that’ll make a dude scramble\nI’m dough, cheese, and bread, I’m the fucking food channel\nPutting two through your flannel, man I murderlize you\nMy Tech ex your clan like the grand verbalizer\nYou piss in the wind, my pistol will circumcise you\nWhile I’m talking more shit than people selling fertilizer\nFor you to be on a higher level than Crooked I\nYou’d have to hire a pilot to write your rhymes in the sky\nThen tell the pilot to crash the plane, burn, and fry\nNow even he’s like me cause I’m fly till I die\nC-O-B yeah who got a problem with me?\nYour eyes are skinny as the body of Whitney\nTo survive when I’m popping semis\nI’m dropping any, God forgive me\nNow Long Beach is Gotham City\n\n[Chorus x 2]\n\n[DJ Eclipse Scratching]", "image": "https://s3.amazonaws.com/rapgenius/avatars/medium/1358290971_142823__MG_9884-Edit%20square.jpg", "album": null, "year": null}]}