{"songs": [{"title": "New Rap", "album": "Hump Days", "year": "2014-09-09", "image": "https://images.genius.com/75145c356837ef95317b2e1192749c65.1000x1000x1.jpg", "lyrics": "[Intro]\nSup y'all\nIt's your boy, L-D\nA.K.A. Slim Boner\nThis does not have shit to do with Sports Center\nBut I want to dedicate this to all the Sports Center anchors out there making our nights easier\n\n[Verse 1]\nAy, what's really really good wit it\nDicky rollin swishers, switch da role up, now the Jew killin shit\nExcuse me, ma attitude be, a little crude\nFor da few people, tryna boo, and screw and shoo me\nMa crew be sayin that I'm focused for real\nAnd soon dude'll play dem women like he coachin Brazil, I'm ill\nScore wit bitches bro, yain't get that punchline?\nLove dimes, drum line, cherry coke and lunch time\nDamn, how you spittin so ridiculous wit it\nDa kid been killin\nAll his writtens meticulously\nCause Dicky getting sick\nOf these bitches spittin chicken shit, literally\nListen to little b, piss on the industry, shit isn't pretty\nBut LD, whaddup, ya boy been spittin hot\nWeird, but it's cool like boy when he kiss his pop\nI'm here, makin noise, better get a mop\nCause I'm bout to shit all up on hip-hop\n\n[Hook]\nSo if you want it wit me\nYou know I'm clubbin wit a chubby\nProlly tuckin ma D\nCause I been really good livin\nPhilly D ma hood chillin\nIf you really good feelin\nHolla back at dude killin em\nL-I-L dicky flowin it up\nWestside, getting high, yea we blowin it uppp now\nSo if you really getting sick. of this new crap\nThen listen up, cause Dicky been spittin new rap\n\n[Verse 2]\nDas dat good shit\nRead about that shit\nI'm tweeting bout that shit\nI'm making a believer outcho bitch\nI'm freakin out dis bitch\nI'm skeeting where you eatin' outcho bitch\nI cheef a mound piff, and now I'm really freakin out this bitch bro\nI'm the biggest pussy rappin all day\nI'mma represent it lovin me some rent on broadway\nCall it gay, but fuck it, it's really lovely\nTo come up in really comfy pajamas\nWit a mama and knowledge of commas and college\nBut all these other rappers think thuggin is cool\nThese mafuckas so redundant wit the drugs in the jewels\nBut I ain't buggin... ma stomach getting sun by the pool\nI'm wit a mexicano jawn straight getting azul\nFo'real tho\nReal flowin, jabronis is still frontin wit it\nReal open spittin, ma dick is a mere couple inches\nMeals made of truffle\nMa kitchen is real troublesome\nI'm real good at hugging, and snugglin\nSomewhat at fuckin and\n\n[Hook]"}], "artist": "Lil Dicky"}