{"songs": [{"year": null, "album": "The Most Beautifullest Thing in This World", "image": "https://images.genius.com/447c633e96f2be906b387d1114ff07c4.953x953x1.jpg", "title": "Dip Dip Di", "lyrics": "Intro:\nHa ha ha Def Squads in the house. One more time. Hostile word up. Keith\nMurray representin' ?. Yeah\n\nVerse 1:\nKeith Murray gets busy most beautifully\nGot Hostile with E.D. in 93\nYo it's a small small world out there so prepare and beware\nBecause I'm coming out rougher this year ah yeah\nNow you know I don't care\nWith a hardrock funk style that's pretty much out there (word up)\nWith the wickedest episodes on the globe\nWith my patterns are murderous poetry unfold\nMy vocabilation is out of your imagination\n(We Slam like Onyx on your radio station)\nI'm internationally known from the east to the west coast\nI like hot butter on my breakfast toast\nWhy chase the bass of the base of my face\nWhen you know what kind of bitch you are in the first place\nI bust phat rap caps miraculously\nCome across me for a little something for everybody\nYou're all in the mustard and can't ketchup\nI wreck up like a tech up so go get a check up\n\nHook:\nI dip dip di your face in the place\nI dip dip di in your face...and brings the drama like Jason (x2)\n\nVerse 2:\nThe one and only philly blunt king Murray\nApostrophy Keith chief of the phontom leaf\nI Takes It To The Streets over raggady ruff beats\nAnd I turns beef into minced meat\nNow who wanna test? Compound or stress?\nYes I'll hurt that chest just like a vest never the less\nI still writes like a mad journalist\nIn the heart of the funk of this who is this?\nDrainin' your brain you can't maintain\nPlease Keith come back kiss away the pain\nWith bloody murder you never heard of\nClick like the Def Squad comin' more ubsurder\nI cert a, for the way I hurt a and murder (yeah)\nTracks way before the hard hit of cracks\nWay before the Gotti and the Angles fought backs\nYeah I brung drama like Jason\n\nHook\n\nVerse 3:\nAnd we be blowin' up the spot like nitroglycerin\nFor those who be listenin' I be rolling like perellies on Michellins\nSimpleton, I gets retarded like Bart Simpson\nVicous and superstitious hit you with snitchy stitches\nThere will be no repentance when I cast my sentence\nI write with a vengeance, you can tell in every fuckin sentence\nThat I'm finestly cruel with ink in my think tank\nRemember the current with my memory bank\nPoint blank I'm ranked number one (yes my son)\nSo eat a dick up...and hiccup"}], "artist": "Keith Murray"}