{"artist": "360", "songs": [{"album": "Vintage Modern", "year": "2017-08-22", "title": "Tiny Angel", "image": "https://images.genius.com/71f6df635bf54bf98f051cfad486d051.600x600x1.jpg", "lyrics": "[Spoken]\nSo this story, is about a really close friend of mine\nI love you, brother\n\n[Verse]\nMy mates talk shit about their wives, but I love mine\nYeah we fight sometimes, but ain't that just life?\nShe’s been pregnant now for some time, it took us years\nAnd enough tries, I thought it wouldn’t happen from my young life\nFrom the drunk times, or when I tried drugs twice\nI thought downstairs had gone and messed it up, right\nThe doctor told me that I need to stop stressin’\nThe only thing that’s working against us is just time\nThat was true, two months by\nMy wife called me up while I was workin' at the pub, right\nShe told me I was gonna be a daddy\nWe both broke down, she said there’s something that I done right\nI called my mother, told her I was gonna be a father\nMum cried, so did I, I was tongue-tied\nI can't explain this feelin' but I love life\nI’ve never had a purpose and this had just become mine\nTo create this little person that’s fun size\nA little bit of her, and a little bit of me\nBut I pray he gets his mum’s eyes\nI say he ‘cause I’ve always wanted a son, right\nThe ultrasound said it's a boy, my little ray of sunshine\nIt dawned on me, I can’t wait to see my son rise\nYou know what they say about time though? It does fly\nFast forward nine months and suddenly it’s crunch time\nIt's been a few days of goin’ through contractions\nGotta stopwatch timin' every moment that it happens\nWe reached five minutes so it’s hospital time\nI call ahead to see the doctors arrive, my wife’s laughin'\nNow I properly drive like the cops are behind\nBut there was barely any traffic so we got there in time\nI’m a little scared, but she ain’t got a worry in sight\nShe’s a warrior, exactly what you want in a wife\nIt’s been several days of epic pain, every day she wakes up\nFinally she's comin’ to that second stage of labour\nI sit next to her, squeeze on her hand\nPut a sponge up on her head and say, \"Breathe if you can\nI love you so much, baby, you’re so strong\nI could never do this but you so easily can\"\nShe said the pain is insane like her abdomen’s ruptured\nLike someone’s got a knife, and they’re stabbin’ her stomach\nShe’s like \"We have to do somethin',\" the nurse said, \"It’s natural\nRelax, it's just a sign that it’s actually coming\"\nShe’s like \"No, it’s too much, it’s too hard to get out\"\nI’m sayin’ any words I think’ll help at calmin’ her down\nDoctor’s like, \"You’re nearly through the worst part of it now\"\nTake a look and see my little king is startin’ to crown\nThey all tellin’ her to push, and she’s screamin’\nShe’s saying that it hurts, I tell her to keep breathin’\nIt’s like ‘push’ is the only word that they’ve said now\nThen I’m shocked by the massive scream she lets out\nThe doctor’s like \"Yes, now the head’s out\"\nAnd then I watch as he quickly pullin' the rest out\nIt’s so amazin’ to see my son in the flesh\nI can’t help but notice he hasn't taken a breath, now\nThey put a little plastic thing in his mouth\nWhile the doctor’s two fingers are slightly pumpin’ his chest down\nI start panicking, something’s gone wrong\nThey push me to the side, I can barely see what’s goin’ on\nHe’s not breathin’, they need to resuscitate him\nHe’s suffocating, I see that it’s something major, I feel\nSo helpless, I wish I could come and save him\nI pray that my son’ll make it, it’s taking ‘em fuckin’ ages\nEveryone’s in shock, I’m just listenin’ in\nHoldin’ my breath, wishin’ I could give it to him, fuck\nAt twenty minutes, now they’re stoppin’\nThey turn around, they say, \"We’ve lost him\"\nI’m in shock, I can’t talk\nI’m starin’ at the ground, I can’t walk\nThey hand him to us, can’t believe the size of him\nThe most beautiful thing I’ve ever seen but there’s no life in him\nMy wife’s cryin’ like, \"Why aren’t they reviving him?\"\nI said, \"They tried for twenty minutes\" she’s like, \"Try again\"\nNow I’m feelin’ like I’m stuck in hell\nThis is the worst pain I’ve fuckin’ felt\nI’ve been ten years clean, but now I’m drunk and on the drugs as well\nI’m doin’ anything to numb myself, but nothin’ helps\nI believed in God, for that I feel dumb as hell\nCan someone please tell God to go and fuck himself?\nI’m sorry, yo, it’s hard to be faithful\nIt's painful, heaven must be runnin’ out of angels\nHe died from asphyxiation, no air in his lungs\nA parent should never have to bury their son\nEspecially one that’s so precious it has barely begun\nThat’s one thing in life that should never be done\nI prayed for a son, and they blessed me with one\nMy biggest gift, now his presence is up\nAnd I’m crying at the thought, he won’t ever feel a hug\nOr the tenderness of love that he’d be gettin’ from his mum\nSent him from above, but why take him?\nIt’s like I'm being punished for the negative I’ve done\nAnd it’s killin’ me that Christmas time is barely in a month\nSo I’m doin’ what I have to do to spend it with my son\n(No)\n\n[Chorus]\nWhere did you go?\nAre you alone?\nHow did you get there?\nI need you at home\nWhere did you go?\nAre you alone?\nHow did you get there?\nI need you at home\n\n[Post-Chorus]\nI need you at home"}]}