{"songs": [{"year": null, "image": "https://images.genius.com/148e26f7441f249985c43919f5cdf8e4.500x449x1.jpg", "title": "Bloody Mess", "album": "Rewind: Deja Screw", "lyrics": "[Blaq Poet]\nAight. What's good? Yeah, Hoo-haa! Blaq Poet, kid\nMad scientist Alchemist. It's a year round thing, you heard?\nHit these niggas off\n\n[Blaq Poet]\nYo, Poet's the wildest, the foulest, spitting malice\nSince I was a child, I loved the challenge\nI put in my hours, I built up my powers, I'm here to devour\nAll you cowards, the nine shell shower the block\nBitches on my cock now that I'm hot\nRecord companies wanting me to sign on the spot\nYou got give me my motherfucking shit off the top\nMatter of fact, Year Round, that's how I rock\nIt's Gang Starr\nFirst Family\nNYG'z\nThe first time Bronx been down with QB\n\n[Hook] x2\nYes, yes y'all, I be the best y'all\nYour double vest can't even protect y'all\nIt's Blaq Poet, Queensbridge, bloody mess y'all\nThem niggas suck, I came to bless y'all\n\n[Blaq Poet]\nAyo, Poet's unstoppable\nRhyme remarkable\nSkip the hospital, you dead when I target you\nDon't try to do what I do\nCause that's hard to do\nDon't try to fuck with my crew\nThey put scars on you\nI'm Queensbridge for rilly, no doubt\nWar's what I'm about, so y'all just cut it out\nI got niggas in BK\nKillers in Queens\nBronx and Manhattan\nThey show guns with Staten\nMy team is like all mad and\nThirsty for the drama\nWord to my mama, most wanted like Osama\nY'all niggas need to stop, Cause when them guns pop\nY'all be hiding like bitch, while the real niggas drop\nYou all pussy anyway, smacked up anyday\nGot something to say? Let the nine milli spray\nI'm not hard to find out in the hood, crack slinging\nReady for any type of shit niggas think of bringing\n\n[Hook] x2\n\n[Blaq Poet]\nAyo, I come through blazing amazing niggas\nGot you hoping Superman start saving niggas\nStrictly headshots, motherfuck gracing niggas\nI need money like Puff, Suge, Jay and them niggas\nGot a million man marching fingers on triggers\nI'm trying to sell ten mill, I ain't playing with niggas\nI told you I was coming, here I am\nThe gat's in my hand\nMic in the other\nCrazy motherfucker from the hood\nAttacking the shit\nThe mack of the shit\nGo platinum and still click crack on the strip\nSearch and destroy\nAll motherfuckers that want it\nYou and your boys\nSwiss cheese from head to stomach\nCause I don't care\nI'm a nut like that, I bust my gat\nI walk it, I talk it, it's actual fact\nNiggas acting like Poet ain't spark this shit\nI'm Queensbridge architect, I build this bitch\nBrick by brick, barehands in the trenches\nWalk around, you see my name in all the benches\nAsk all the niggas and bitches who bear witness\nWho made the most crack money? Just ask the snitches\n\n[Hook] x2"}], "artist": "Blaq Poet"}