{"artist": "Ice Cube", "songs": [{"title": "Gotta Be Insanity", "lyrics": "[Intro]\nUhh, gotta get it...uhhh....hmmm....get it, get it\n(baby)\n\n[Verse 1]\nStab through the neighborhood, these spinnin'\nWe's winnin', scrap with the John Lennon\nHeadrests, TV's in 'em\nBest in the nation, on this Playstation\nThe Don Dada, gotta get you hotter\nBeen a buck naked nigga smokin' water\nOn a Friday, the get high day\nBlowin' at a hot date, findin' Shade\nBlack and bicantay, with ass everwhere, how you do that there?\nA sight to behold, break the mold\nJust tryin' to get some before the world explode\nI see you tryin' to get caught\nWell shake what your mama gave ya, plus what you bought\nWe fuck and we fought, we laugh and we cry\nTold the truth and we lie\n\n[Chorus]\nYou be good to me, I'll be good to you\nAnything you want, anything you do\nI got my eyes on you, and I'm into you\nGive it all I got, and to keep it hot\nNow what a freak like you, doin' with a fool like me?\nExplain it to your family\nIt's got to be insanity (because I like what you're doing to me)\n\n[Verse 2]\nYou know you ain't right standin' at the light\nThink it's chocolate with that shit too tight\nAnd if I fuck around and get you in the car with me\nMotherfuckers would think I had a star with me\nNow see the haterism increase\nThey hate when you got a dime piece\nAnd I got one shotgun, and I might catch a hot one\nWhen I'm lookin' for love and niggas got none, uhh\nIf you let me handcuff your wrist\nBonnie and Clyde ain't got shit on this\nCuz Bonnie and Clyde had to take a risk\nBut most of my money see it's all legit (baby)\nIt's all about your state of mind\nNow what would you do if I handed you a TEC-9?\nAre you feelin' me?\nWould you stay down like Hillary?\nEven if you thought about killin' me?\n\n[Chorus]\nYou be good to me, I'll be good to you\nAnything you want, anything you do\nI got my eyes on you, and I'm into you\nGive it all I got, and to keep it hot\nNow what a freak like you, doin' with a fool like me?\nExplain it to your family\nIt's got to be insanity (because I like what you're doing to me)\n\n[Verse 3]\nAre you the type of girl that would call them folks\nHave your man leave the house in chains and ropes\nDon't need the kind of girl that'll have me in court\nOn lawsuits lyin' about domestic abuse\nHave a bitch like Judge Judy cussin' me out\nGarnish my checks, repossess my Lex\nCuz I come from a place in southern Californi'\nWhere hoes rake niggas for tons of alimony\nBut fuck the world don't aks me for shit\nUnless you my boo, and I'm fuckin' you\nThe rest of these broads ain't knowin'\nThat I'ma have you bumpin' Lauryn, in somethin' foreign\nCome through blow the horn\nStick your wrists out the window\nAnd wave to your kinfolks\nLet 'em know who you with\nAnd to your crazy-ass daddy, let him know who to get\n\n[Chorus]\nYou be good to me, I'll be good to you\nAnything you want, anything you do\nI got my eyes on you, and I'm into you\nGive it all I got, and to keep it hot\nNow what a freak like you, doin' with a fool like me?\nExplain it to your family\nIt's got to be insanity (because I like what you're doing to me)", "image": "https://images.genius.com/b41b30150e61b258f8624ead118328fe.1000x1000x1.jpg", "album": "War & Peace Vol. 2 (The Peace Disc)", "year": "2000-03-21"}]}