{"songs": [{"title": "Hood Love", "lyrics": "(Nigga...)\n[Buck] G-Unit!!\nCan't forget Billy the Kid\n[Buck] Aiyyo whassup niggas\n{GANGSTA, GANGSTA...}\nShouts to the Replacements\n[Buck] It's like that\nShout out my nigga Attitude\n[Buck] My hood is yo' hood\n{GANGSTA...}\n\n[Chorus: repeat 2X]\nThe block love me, I'm sick with my whip game\nWe drive big cars, we like big thangs\nThese hoes love me, they know I'm gettin money\nI'm strapped in this bitch, ye ain't takin nothin from me\n\n[ad libs over Chorus]\n... oh!! ... WHAT?! ... NAHH!!!\nC'mon! ... fo' sho'! ... WHAT?! ... NAHH!!\n\n[Young Buck]\nIn the kitchen like I'm Chef Boyardee\nKeep half of it white, cook up a quarter ki'\nPut some tints on a Grand Am, throw away my phone\nHate to hear a grown man holla throw a dog a bone\nGod bless the child who can hold his own\nI turn a penny to a 20, a gram to a zone\nA hooptie to a Bentley, the gold to the chrome\nA fully to a semi, the bricks to a home\nThe hood love me like grape Kool-Aid\nThey say you live and you learn from mistakes you made\nSo I took off the soda, and added more coke\nThey sniff it up they nose and it numbs up they throat\nThat's why\n\n[Chorus] with ad libs\n\n[Young Buck]\n36 ounces, we call 'em whole thangs\nAnd if we catch a case, we don't say no names\nTake care the old folks, make sure they good\nCause we don't need no help, in our motherfuckin hood\nWe live by the G code, eye fo' an eye\nYou take one of mine, then 10 of yours die\nThrough all of this beef shit, I'm so fly\nSome red monkey jeans and a Glock fo'-five\nSee Ludacris my nigga, I'm down with T.I. (shoutout to D.T.P.)\nSo kill all the rumors 'bout that song, get high {GANGSTA GRIZILL}\nSee Ludacris my nigga, I'm down with T.I. (shoutout to Grand Hustle)\nSee Ludacris my nigga, I'm down with T.I\nSo kill all the rumors 'bout that song, get high\nYou worry 'bout mine, can't pay yo' bills\nAnd me and Banks fuckin hoes out at Yayo crib, yea\n\n[Chorus] with ad libs\n\n[Young Buck]\nYeah nigga\nThis a G-Unit production\nI made the motherfuckin beat\nSo holla, YESSSSS!\nAiyyo shoutout to that nigga The O\nHe one of them under 21 millionaires\nCashville nigga\nWe get money down here bitch, YO!!!!", "album": "Case Dismissed – The Introduction of G-Unit South", "year": null, "image": "https://images.genius.com/f00eb6127863d56bf973226fdb122cbc.360x360x1.jpg"}], "artist": "Young Buck"}