{"artist": "Casey Veggies", "songs": [{"title": "Dreams (Outro)", "album": "Customized  Greatly Vol. 1", "year": null, "image": "https://images.genius.com/dd17019850fcbc3859bfd737bd599ed8.500x500x1.jpg", "lyrics": "[Intro]\nCustomized Greatly\n\n[Verse]\nIt's hard to figure out your dreams\nCause later that thing won't be as cool as it seems\nHow can you throw it when you pulling the seems\nWu-Tang clan niggas wanting the C.R.E.A.M\nBut really dudes wanting to dream\nBut people dream high while you wanting these things\nAnd you might not get it\nCause when the world drops, man I might I drop with it\nNow people are afraid to not be fitted\nI can care less but that shit is me\nIt's like spelling my name without the C\nA-S-E-Y and oh yes, he's fly\nSome people live fast but most of 'em die\nSome people tell the truth but most of 'em lie\nLike why am I even writing this to you\nWhen they here man, what would they do\nMight love it, might step on it like shoes\nKeeping secrets, always erasing the clues\nAnd I don't even like facing you fools\nGet confused and that's what the obstacles do\nBut you gon' have to overcome your obstacles dude\nJust freeze like a popsicle do\n[?] a kid to perfection\nI took all my notes without the lecture\nDouble text shit, my swag is too quick\n[?] on me like toothpicks\nI'm too sick, I'm deli\nOne bullet hit two licks\nTwo hundred dollar sneakers, I could shoe flick\nYeah, made sure that the team was ready\nGot an Italian girl, make a mean spaghetti\nI'm about the green and fetti\n[?]\nI drop the red, blue, white, and green confetti\nYou cool or lame what? You lame fuck\nWe balling on you mid-town lamers\nSpit your best shit, I got the best shit\nAnd when it comes to up and coming, I'm on the next list\n[?]\nAnd when I start recording, the shit gets hectic\nYes, no more favors\nSo when we talking business homie, what is your wager?\nHit me on the kick or the pager\nI burn through *sss* like lasers\nI'm smooth like a paver\nWe lay down rules on this paper\nA nigga in the dark with the flashlight\nSo I'm in the light with all black, right?\nTruly this is me, I don't act tight\nAnd I tell dime girls just to act right\nIn Vegas we had fun that night\nThey fiend for my mixtape like a crack pipe\nTo cut steak, we used butter knife\nStraight up, I rap for the realness\nAnd I write shit, God blessed me with the illness\nUsed to call me Ray cause I always kill shit\nI was kind of hungry so I picked the meal\nGot a deal, next day I made a mil\nThat's two combinations paid and real\nThe gun to his cranium, made in his will\n[?] laid in heels\n[?] we'll be sicker than syphilis, no homo\nMy niggas ain't tickling it\nDudes be bleeding and cripping it\nI write a verse in the [?]\n[?] wack, we do a [?]\nTake a number, I speak water and thunder\nAnd most of y'all don't want the electricity\nAnd love's what they ain't giving me\nIt ain't much of a crime like a misdemeanor\nSuccess is what I'm visioning\nPeas N Carrots on my tee shirts\nA nigga third on the list\nSidekick notes [?] bursting with hits like, like, like\n(It's like that nigga)\n\n[Outro]\nYeah, I would like to thank God, Customized Greatly, Mom, Dad, [?], Damon, Ill plus, J Sean, Corey, Priceless, Peas N Carrots, Hypebeast, F2D, We Major, Uncle Dave, [?] what's good, Isaiah, Josh, Corey, Darren, K Smoov, sup Starion, what's good my ni-, everybody who showed love, whoever supports, musical chicken grill, Ape Thelonius, James, Chad, Mike, MySpace, Michelle, Anwar Carrots (what's up my nigga), Dame, Josh Peas, Mookie, the love anybody showed, Apple Garage Band, all my [?] homies, all the homies man, everybody, everybody tryna make it, every rapper tryna make it, every producer tryna make it, every record label, every street wear clothing line, Tyler, the Creator what's good man, [?], every girl I ever talked to, every dude I ever hated, that ever hated on me, every song I ever listened to, [?] class of '07, Chris, Austin, Jay, Marcus, Nico, everybody man. Buy the mixtape, listen to the mixtape, enjoy the mixtape, it's coming. One love. Peace"}]}