{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "Growing Up in Public", "image": "https://images.genius.com/937a22b3dfa62548d1013d052f733535.1000x1000x1.png", "lyrics": "[Produced By: The New Royales]\n\n[Intro]\nAhh, mate\nA wise man once said\nJust as things start looking up\nIt all goes to shit again\nStory of my fucking life!\n\n[Hook]\nI'm growing up, growing up, growing up in public\nGrowing up, growing up, growing up in public\nGrowing up, growing up, growing up in public\nGrowing up, growing up, growing up in public\n\n[Verse 1]\nThey told me to act my age\nMaybe one day I'll act it\nBut for now I'm going backwards, yeah\nLacing up my shoes, buttoning my shirt\nI don't know why I'm bothering, you can't polish a turd\nIs my tie straight?\nI did it and I did it all my way\nI told you from the get-go\nIt was my way or the high way\nAnd I weren't lying then\nAin't lying now, never been a walk over, ain't lying down\nIt's nothing new to me, the press ain't ever been too nice\nI ain't surprised, the headline was about the DUI\n\n[Hook]\n\n[Verse 2]\nThink to yourself \"what would I have done?\"\nSomebody popped my watch and then tried to run\nWe got in a tussle, all the while\nI had no idea where my wife had gone, plus I'm poignant on\nWhether he's got a gun or a knife on him\nNot knowing if her life was in\nDanger why I tried to hold on to the watch and fight the [?]\nThen I heard her scream, so I'm guessing he bought more guys with him\nFuck the watch, my priority's Millie now\nYou think what I did was so silly now you've figured it out?\nWorked out the reason for me getting into the whip\nNot only is this dickhead who got me kicked\nAnd gotten away with my watch, he's gone and gotten me in all of this shit\nShame I never caught up to him in the whip, eh?\n\n[Hook]\n\n[Bridge]\nOK, if I'm being logical, in hindsight then probably, it is not a shame that I didn't catch up to the little toerag in the car because that could've ended with me in more trouble than I already am...\nDCI Clarke!\nDetective Constable Clarke!\nI don't like you... at all\nWe will never, ever be friends\nI don't wanna be a criminal! I'm nearly 30 years old! I'm a married man! I wanna move to the country, have children and smoke my... pipe! With nothing illegal in it!\n\n[Hook]", "year": null}]}