{"songs": [{"album": "Southern Axecent The Mixtape", "image": "https://images.genius.com/a7f2a133ade99a49a8afcf41f8c3349a.499x499x1.jpg", "year": null, "title": "Go Go Go", "lyrics": "[Verse]\nWhy don't you go, and leave me alone but baby I'm grown, you screaming on the phone\nYou treat me like an adolescent, speak to me and ask me questions [?], you be mad depressive, you don't see the half of it see the half of it\nLeave you in the past with it, I'm done with it and moving on, you should do the same thing, get your things and move along (move along)\n(Knock, knock, knock) Who is home? (Not not me), I'm good as gone and you sit there wonder why, why the hell i do these songs\nSo short stop, don't cry me a river, oh the lies you gonna spit up, I'm surprised I'm still with you\nWe don't need to split up but I try not to give up, but right now Seeing eye to eye 'ain't gon' fix us\nPointing fingers trying to figure out the fault or the blame, think we need to throw in the towl and call it a day\nBring up more shit, and throw it all in my face, saying baby why don't you stay while you walking away\n\n[Hook]\nYou can go go go, why don't you leave me alone?\nNo matter what i do I'm still wrong\nX4\n\n[Verse]\nShe say it's not you it's me, saying she don't really treat you right, now she lay awake at night, wishing she could sleep at night\nWishing i could be by her side and i could squeeze her tight staying here is wrong, but there ain't no way i can leave you right (right)\nIf you consider it belligerent, you mixing up your sentences, you don't see the diss in this cause you don't really give a shit\nYou fucking up my vibe (vibe), you fucking up my high (high), you wanna go, uh-uh don't have enough to ride\nDon't have enough inside to put up with this anymore, you say you want me gone, but you won't let me go\nYou keep on screaming that you saying that you mean it, but believe me I don't think that we can make it through the evening\nBut tonight I 'ain't staying to talk, say my grace and I'm gone, you can be the wait to on the phone\nYou can be the wait who has to sit here waiting alone, cause right now I'm over and done\n\n[Hook]\nYou can go go go, why don't you leave me alone?\nNo matter what i do I'm still wrong\nX4\n\n[Verse]\nBaby, girl I apologise, I was kinda outta line, we ain't seeing eye to eye, maybe we ain't gotta try (try)\nTo my surprise (prise), she swallow lies (lies), that means she meant what she said, I must be out my mind\nThey say you don't know what you got untill it's gone, but it's gone, I don't know what I got, what's going on?\nMaybe you can fill in the blank and finish the song, tell me what you want to happen, I can listen along\nWe both said and did things that we didn't deserve, but the difference, it hurts when it's given to her\nSo many things I want to say and try to fit in the verse, on the tip of my tongue but now I'm missing the words\nI miss the way we used to laugh together, how we always used to say this would last forever\nI now know where the past was heading, my minds made up so I'm past regretting\n\n[Hook]\nYou can go go go, why don't you leave me alone?\nNo matter what i do I'm still wrong\nX4"}], "artist": "Hard Target"}