{"songs": [{"title": "Forever", "album": "Church Clothes 3", "year": "2015-01-15", "image": "https://images.genius.com/ecf271772aa0af61304b89a07eb15401.1000x1000x1.jpg", "lyrics": "[Intro]\nGood morning to you (la, la-la, la-la, la)\nYou're mine\nGood morning to you. You're mine\nGood morning to you. You're mine (yeah)\nGood morning to you. (you know) You're mine\n\n[Verse 1]\nI know a lot of guys out there are tryna steal your heart\nBut a real man hold onto it tight, 'til death do you part\nMomma done raised me right tryna’ make me a knight, light\nShinin' armor, don’t harm her, arm her with all your honor\nAnd don’t mind me that’s just wordplay\nI ain’t playin' with it, that’s here say\nThat’s hairspray, that’s shop talk\nYou stayin' with me?\nI never knew a love like this\nGotta be something for me to write this\nPray to God that when you hear you like this\nThe way that I feel girl it’s hard to fight this\nYou’re my queen, you’re my lady\nWe can make war, make babies\nYeah, you know like Meth and Mary\nNo side chicks and no secondary\nNo shoppin' ‘round it’s just commissary\nI’m locked down 'til the cemetery, my whole life\nMy old life, don’t worry 'bout it\nIt’s been buried\n\n[Hook: Kriss Ross]\nAnd you’ve got my heart and my soul in your hands\nYou change my future with a glance\nA wife and a kid, a house and a whip\nIt don’t matter cause whatever it is, whatever it is\nWith you by my side I'ma do it forever\nI'ma do this forever, I'ma do it forever\nYeah I'ma do this forever\n\n[Verse 2]\nNow listen\nAny boy can go find a girl and try to satisfy her for a whole night\nBut a real man can take one woman and satisfy her for a whole life\nFlex talk, sex talk\nIt seems that’s all they talk about\nBut real love is them sacrifices that you make for me when I’m out of town\nThey don’t know why you hold me down\nHow you hold me down\nBeen here, been real, been trill\nNever sold me out\nSome stay in love and some fight together\nSome breakin' up and some runnin' out\nAnd they love you lookin' all out of shape\nLet’s marathon it, let’s work it out forever\n\n[Hook: Kriss Ross]\nAnd you’ve got my heart and my soul in your hands\nYou change my future with a glance\nA wife and a kid, a house and a whip\nIt don’t matter cause whatever it is, whatever it is\nWith you by my side I'ma do it forever\nI'ma do this forever, I'ma do it forever\nI'ma do this forever\nOh yeah\nGood morning to you. You're mine\nGood morning to you. You're mine"}], "artist": "Lecrae"}