{"songs": [{"title": "Heads Down (You Haven’t Done That Yet)", "image": "https://images.genius.com/79e62ca42e17e0aff79d1ee676768a00.1000x1000x1.jpg", "lyrics": "The Number One Set and Sound (Word, Live)\n\n[Hook]\n'You... You... Only You'\n\nIn about four bars a married man will begin to speak\n\nM-m-m-m-m-m-many have claimed, to obtain, levels of boning\nBut when I meet their women I'm like, \"They must be joking?\"\nThey stroking, but after ten minutes you begin gizzing\nBend her down, flip her 'round, find a way to switch position\nChanging, rearranging, let her seduce ya\nDon't try to rush the panties cause you'll always be the loser\nAnd laughed at, hated on, you can't perform\nWith those that control they tongue, on and on and on\nLet's get specific, my frame crescent thicken, you're sexually uplifted\nWith the freak in you, don't act the way these cats do\nWay I maneuver, Kama Sutra give me a statute\nSo now I ask you, and tell you brothers literally\nWhen it comes to hooking up with these ladies y'all ain't better than me\nDown with RNC, endlessly reciting poetry\nAnytime I'm in the bed my wife is there exploring me\nThen I \"No!\" I'm not ready to share my game plan\nMany say they're free, but this style, they haven't attained yet\n\n[Hook]\n\nRenege you, son, bumping through dunn, don't you know its your biology to cum\nWhat separates the men from boys, masturbation from love making\nIs making your women really humm\nCause by the time you finally get her open she get done\nAnd rock the body, then UP you gotta run\nSee only a sucka pull a move like that\nThen wonder why your women getting hers behind your back\nSelect the right time and place\nPut it in her face, and taste creation of the human race\nIts all about the physical built up you created\nYour time wit it kid, and let her escalade\nThen while you'll STICK!, she'll GRIND!\nDon't touch youself, she's out of time, here's another rhyme\n\n[Hook]", "year": "2004-05-11", "album": "Champion EP"}], "artist": "Brother Ali"}