{"songs": [{"image": "https://images.genius.com/508cfd1c27feb972bd0f02726a60791a.1000x1000x1.jpg", "title": "Blisters", "album": "Strings and Bling", "year": "2018-07-06", "lyrics": "[Intro (fast-forwarded)]\nWelcome to Strings and bling would you like to take a seat? The Coolest Kid in Africa will be here and will be serving a lot of heat in just a second. May I take your bitch while you wait? We have everything that you don't, most of which is just some good ass music. Please don't get me wrong I'm not -\nShoutout to King LilJay\n\n[Verse 1]\nI was talking to God like I was talking to my bro\nHe said I gave you what you need to release your inner glow\nI don't know if it was fear but I started feeling cold\nThen I pushed myself to do it I found me a piece of gold yeah\nYeah, damn, damn, damn, damn\nDamn (gang, gang), damn (gang, gang), damn (gang, gang), damn (gang, gang)\nDamn (gang, gang), damn (gang, gang), damn (gang, gang), damn (gang, gang)\nGang, gang, gang, gang!\n9-1-1 what the fuck? You too damn dope hands up\nYou too black too damn ghetto\nStrings and Blings too many medals\nToo much power for one Zulu man\nThat's why I'm out here acting a hooligan\nI thank God for blessing me ngempumelelo yeah\n\n[Chorus]\nWhen I count my blisters, I count my blessings\nTold God I get it\nYou are now my bestie\nPick me up my bestie\nDon't put me down my bestie\nDon't put me down my bestie\nDon't put me down my bestie\n\n[Verse 2]\nEvery scar came with a scandal but it's nothing Jiggy Jigga can't handle\nShould I tell you I don't never introduce myself?\nAnd it ain't cause I ain't got no manners\nHave you ever seen a kid work harder than Nana\nI ain't never had no nana\nNiggas hating on me coz they don't matter\nI'm jiggy Jesus in Balenciaga sandals\nNow you know, now you know\nI'm a goat on the low, I'm a pimp on the low\nBut I don't put my hand on a hoe\nI've been to hell and back, got colder\nI was on the dope skipping class like rope\nEvery single time I go home\nI gotta put something on the stove\nCount my motherfucking money, it's funny\nI let it have a Roast\nIt was all or nothing\nAnd I be having gold\nLucky number four you got me through the cold\nI'm the chosen one I know it I wrote it down in stone\nDon't test my patience nigga please\nIt won't cost much to make you bleed\nWatch your tone when you talking to me yeah\nWatch your tone when you...\n\n[Chorus]\nWhen I count my blisters I count my blessings\nTold God I get it\nYou are now my bestie\nPick me up my bestie\nDon't put me down my bestie\nDon't put me down my bestie"}], "artist": "Nasty C"}