{"songs": [{"year": "2015-11-13", "album": "Next Step", "image": "https://images.genius.com/623f415517090669819e4d39e8a4e309.600x600x1.jpg", "title": "Be Patient", "lyrics": "[Verse 1]\nKick it off now, got the outro\nOne shout-out to the cunts who doubt bro\nProved 'em wrong but still they hate\nCouldn't have done better, I'm real they fake\nAnd I heard 'em ask if I beef with cunts\nNo beef, I'm just too far in front\nIf that cause beef then so be it\nStop asking if I'm sober yet\nI'm over it, go ten for ten\nSeen the closest mates turn greedy man\nAnd that's enough when I cut you off\nThen they all call back like \"I love you Scott\"\nI've seen two sides, if I quit the rap\nPretty sure you wouldn't be ringin' back\nEveryone around me wantin' something\nWhat you do for me? You do fuckin' nothing\nShout to the crew though, always on the move bro\nOne main rule I'll never ever lose yo\nGotta say my rap, my life\nEverything I've sacrificed\nEverything I have, I tried\nNon stop work, rap has my life\nBut I'll stay here, for my fans, for my fam and for my friends\nUntil the end I'll be the Kers\nAlways here to feed a verse\nFeels like that like every day\nCovered everything, what's left to say?\nI just wanna be like left alone\nCan't end up in a mental home\nBeen chasing my dreams for half my life\nNow I'm waiting for the part where I die\n\n[Hook]\nThis the way it goes, be patient, let me break it down\nDone a couple things I'm never gonna say out loud\nThank you all the crew that got my back\nThey knew from my first rap there's no stopping that\nThis the way it goes, be patient, let me break it down\nDone a couple things I'm never gonna say out loud\nThank you all the crew that got my back\nThey knew from my first rap there's no stopping that\n\n[Verse 2]\nSteppin' up shit every time I drop\nThat's the main reason they kind to Scott\nAnd I'm kinda lost but I find a way\nThinkin' \"I'm ahead should I hide away?\"\nI'm gonna lose patience, time me lad\nI don't even wanna write another rhyme with that\nI want a clear mind, it's all I want\nBut everyone's dramas fall on Scott\nAnd I'm sitting in the back like what is what?\nThinking should I just call it off?\nBut I came so far, too far to quit\nI'll write another rhyme and ask you this\nIf you were me, what would you do?\nWould you get personal when they write a review?\nPiss on these rappers that doubted you?\nWould you get a clear mind from a clouded view?\nI'm losing my mind, when I rhyme I don't choose a side\nReady to make career suicide\nDunno what to do, I'll cruise all right\nShout to the fans, you pull me through\nShout to the haters, I'm hurting you\nAin't no tellin' what Kerser do\nLast thing that you wanted was me verse you\nBut I'm lucky as fuck, I got my girl\nAnd she makes sure that Scott's her world\nAnd that shit there, that helps me heaps\nMore than any other one helping me\nWalk a tightrope, don't slip and fall\nAnd with hip hop I give my all\nAlbum five, I'm signin' out\nUntil next time, all right, we out\n\n[Hook]\nThis the way it goes, be patient, let me break it down\nDone a couple things I'm never gonna say out loud\nThank you all the crew that got my back\nThey knew from my first rap there's no stopping that\nThis the way it goes, be patient, let me break it down\nDone a couple things I'm never gonna say out loud\nThank you all the crew that got my back\nThey knew from my first rap there's no stopping that"}], "artist": "Kerser"}