{"artist": "88-Keys", "songs": [{"album": "The Death of Adam", "lyrics": "\"It hurts to think of just how close we came\"\n\n[Verse One] [Phonte]\nYo, been watchin' you for awhile\nDon't know if it was your lips or it was your smile\nDon't know if it was your hips or it was your style\nUntil you put that thang on me, that's when shit got wild\nWe started off good, goin' to UnPlanned Parenthood\nLeavin' the condoms by the bed and the drawer\nUntil one night you let the nigga put the head in\nAnd we ain't never use them motherfuckers no more\nStarted goin' in and out with the raw sex\nPulled it out, skeeted on your chest\nLike bring your ass here\nPlayin' Justin Slayer to your Jasmine Cashmere\nTill one night you said, \"Baby leave it right there.\"\nI figured I had met my match\nTongue on my neck, fingernails in my back\nI figured we was cool, she said she was on the patch\nSo I stroked and I stroked and finally left off a batch\nLike Ahhh!\n\n[Hook]\nI try, you try\nI try, you try\nJust how close we came\nJust how close we came\nI try, you try\nI try, you try\nJust how close we came\nBefore you cum inside of me\n\n[Verse Two]\nA few months went by and I'm really startin' to dig her\nLunch in the park, picnics by the river\nSexin' all day and all night, shit is ill\nSo she switch from the patch and started takin' the pill\nUntil one night she put my hand on her stomach\nAnd said, \"Baby, we gon' be a family once I pop this kid.\"\nI said, \"Bullshit\nSo let me back it up\nAnd just explain to you, exactly what your options is\nOption one: Take this nigga to the Hoover\nOr option two: Fuck on, I never knew ya.\"\nI know it sounds crazy and it seems prideful\nBut I\nCouldn't shake the feelin' that I was lied to\nShe ran out the room with mad tears in her eyes\nLeft her pills on the dresser right by my copy of Get Back\nI put 'em in my hand\nThen put one in my mouth\nSure enough, all this time she been poppin' Tic Tac's\n\n[Phonte singing]\nFirst time I did it I said I wouldn't do it again\nIn and out, long stroke, no glove on\nBut it feels so good when she let me in\nGet a hold of yourself boy\nYou're gonna me caught up\nI think she got me caught up\nOh, she's gonna get me caught up\nI think she got me caught up\nWell, well\n\n[Hook]\nI try, you try\nI try, you try\nJust how close we came\nJust how close we came\nI try, you try\nI try, you try\nJust how close we came\nBefore you cum inside of me\n\n[Outro] [Phonte talking]\nYou know what I'm sayin' like...when you told me you was on the patch\nI didn't know you was talkin' about the Nicotine patch motherfucker!\nNow you got me up here, I'm gonna be here in this court up here\nOn these trumped up charges. Got me here on these facetious allegations\nUnder these false pretenses. What kind of shit is that? You triflin' heifer", "image": "https://images.rapgenius.com/36bd6f7c9c038652449c033bb7088bd1.700x700x1.jpg", "year": "2008-11-11", "title": "Close Call"}]}