{"songs": [{"image": "https://images.genius.com/e723a4b2d038c34df13108415deee7cf.640x640x1.jpg", "album": "Ground & Water", "title": "Rhymes & Gemstones", "lyrics": "[Verse 1]\nGold, gold, four five chrome (Gold, gold, four five chrome)\nRhymes and gemstones (Rhymes and gemstones)\nFrom rhymes up being flown (From rhymes up being flown)\nBut how can I get a home, if I can't get a loan?\n(But how can I get a home, if I can't get a loan?)\nIf I can't get a job (If I can't get a job)\nAnd I live all alone (And I live all alone)\nNow I'm calling on my phone (Now I'm calling on my phone)\nAll I get is a dial tone (All I get is a dial tone)\n\nBetter call Tyrone to condone (Better call Tyrone to condone)\nBlown sitting at home (Blown sitting at home)\nI roam when I get to Rome (I roam when I get to Rome)\nI've been all around the globe (I've been all around the globe)\n\nI call one place home, that's my home\nBut I just can't go back home (Damn!)\n\nAll I got is my goal (All I got is my goal)\nAnd my four five chrome (And my four five chrome)\nRhymes and gemstones (Rhymes and gemstones)\nFrom rhymes up being flown (From rhymes up being flown)\nBut how can I get a home (But how can I get a home)\nIf I can't get a loan? (If I can't get a loan?)\nIf I can't get a job (If I can't get a job)\n\n[Verse 1]\nGet this nigga his job one time\nI can rob, I can steal, I can kill, I can even serve time one time\nAnd come back outside, oh boy what a day when they see a boy face\nWhen he finally face the truth, is it me or is it you?\nGot Juice, got Friday, ain't nobody taking mine\nAnyone waiting in line is really waisting they time\nYou're not taking me out [?] from the south\nLet me see you put gold in your mouth\nLet me see what you about\nLet me see what you bought\nSomebody sold his soul, look like you got caught\nHomie let me help you out (help you out)\nIn the place to be with greatest mc's\n\n[Hook]\nMouth is full of gold (Mouth is full of gold)\nRhymes and gemstones (Rhymes and gemstones)\nBut sometimes I get blown (But sometimes I get blown)\nAnd forget where I'm going (And forget where I'm going)\nBut I reflect on a poem (But I reflect on a poem)\nThat brings me back right home (That brings me back right home)\nBlusting on everybody that's trying to keep me from my throne\n\n[Verse 2]\nLegacy songs, stage ripped off\n'Cause I got pissed off\nWoke up to reality and realized it's this hard\nAnd the game is this soft, all the pain and chrystal\nThe blame, the pistol I aim, bang!\nBrains, blew [?]\nIt ain't blues unless the blunt I puffed was from an angel's dust\nCrushed the plains into us\nPaint the face, gently brush, evidently blush\nI come up with something\nThe bad politics gotta be from something\nPolice popping children, gotten me disgusted\nThe pain we [?] is the pistol we busting\n\n[Hook]\nI'm talking about my goals (Rhymes and gemstones)\nFour five chrome (Rhymes and gemstones)\nRhymes and gemstones (Rhymes and gemstones)\nFrom rhymes up being flown (From rhymes up being flown )\n\n[Verse 3]\nBeen blown crack house, Alabama shake down\nI'ts that back yard boogey, you can give me cake now\nCame on a greyhound and my head stayed down\nHas been ever since, all I think is underground\n\n[Outro]\nGold, four five chromes\nRhymes... gemstones", "year": null}], "artist": "Blu & Damu The Fudgemunk"}