{"songs": [{"year": "1996-11-26", "album": "Enigma", "image": "https://images.genius.com/482eea61300bdf72a62b443973fd7a5c.1000x1000x1.jpg", "title": "What a Feelin’", "lyrics": "[Intro]\n[?]\n\n[Verse 1]\nKaboom! Guess who stepped in the room?\nLookin' like the creature from the Black Lagoon\nThere's gonna be a 187 real soon\nIf niggas up in here don't give me some elbow room\nI'm runnin' with the Legion of Doom\nLike a pack of wild wolves foamin' at the mouth on the full moon (Au)\nI track range between space and time\nAnd push wigs back like receding hair lines\nThat's the essence of the effervescence\nAs this melodic dynamic shit progresses\nA mic murderer for hire\nAs I sit back and watch your little gimmick image backfire\nUnder the circumstances in any order of events\nI be with sick niggas rollin' thick\nDissin the system got America mad at me\nLike my name is O.J. Simpson\n\n[Chorus]\nMy style is all that, and a big bag of chips with the dip\nFuck all that sensuous shit\nThe astronomical is comin' through like the flu bombin' you\nMy style is all that, and a big bag of chips with the dip\nFuck all that sensuous shit\nThe astronomical is comin' through like the flu bombin' you\n\n[Verse 2]\nGet off the d.k. you pitty pat bitch\nStepped into the party people wonderin' if I'm a start some shit\nPrisoner of the media very often\n'Cause people be blowin' little shit out of proportion (Aha)\nFalse information and bogus arithmetic\nGot everybody stuck on stupid, misinterpreting shit (Yeah)\nHow could I? Why should I damage my career? (Uh)\nOver a nigga that'll probably bust me out of fear\nDon't let your mouth get you into somethin' that your ass can't get out\nWhen I see you I'll pull your dreads out your scalp\nCaution: code red\nI could kill you now, but instead, I'm a put this thought into your head (Right here)\nI got the illest crew in the industry\nWe could go to war for 30 years like foreign countries\nYo, slow your roll\n'Cause I don't really think you know with who you dealin'\n\n[Chorus]\nMy style is all that, and a big bag of chips with the dip\nFuck all that sensuous shit\nThe astronomical is comin' through like the flu bombin' you\nMy style is all that, and a big bag of chips with the dip\nFuck all that sensuous shit\nThe astronomical is comin' through like the flu bombin' you\n(Bombin')\n\n[Verse 3]\nMan fuck bitches, I'm gettin money\nAnd laughin at these clown ass niggas like they funny\nThe grand imperial with milky material\nI'll be the surprise in the bottom of your cereal\nOne thing I gotta say, my Squad never lost it\nUnlike you corny MC's out there who Farrah Fawcett\nCan't rhyme, runnin' your mouth all the time\nWhile Def Squad sit back, enterprising perfect crimes (Yeah)\nGot the Funk Lord squeezin' the life out of keyboards\nWhile each MC tear the frame out of mic chords (Uh)\nYo I was in the bullpen with them niggas pullin' heists\nGrown ass men crying like little mice, but I'mma bounce true indeed\nCause punk ass police only bagged me with two ounces of weed\nNow I'm back on the streets in the city lights (Yeah)\nAnd all I can think about is keepin it tight\n\n[Chorus]\nMy style is all that, and a big bag of chips with the dip\nFuck all that sensuous shit\nThe astronomical is comin' through like the flu bombin' you\nMy style is all that, and a big bag of chips with the dip\nFuck all that sensuous shit\nThe astronomical is comin' through like the flu bombin' you\n\nSlow your roll\nThis is [?]"}], "artist": "Keith Murray"}