{"songs": [{"album": "Eardrum", "image": "https://images.genius.com/36dc52e92a9d27102149cf08b1a7f326.936x936x1.jpg", "year": "2007-08-21", "title": "Hostile Gospel Pt. 1", "lyrics": "[Intro: singers] + (Talib)\nDeliver us, deliver us (Yeah)\nDeliver us, deliver us (What? Yeah)\n\n[Talib Kweli]\nAnd what the people say? We wanna live it up\nAnd what the people want? Please deliver us\nAnd what the people need? Hey...\nI got that, yeah\n\n[Talib Kweli]\nI call these rappers baby seals, cause they club you to death\nI could call 'em Navy SEALs, cause they government feds\nWhat become of the vets? They drugged up, they fucked up, they in debt\nThere ain't no love and no respect, it's like a gang it's like a club or a set\nHip-Hop's the new WWF\nWhat do you rap or do you wrestle? Niggas love to forget\nWe got til it's gone, you think you on, you still hustlin backwards\nYour topical norm a tropical storm, it's a fuckin disaster\nBack to the topic we on, it all started at Rawkus\nThey couldn't find the words to describe me so they resort to the shortcuts\nIs he a backpacker? Is he a mad rapper?\nAn entertainer? or the author of the last chapter?\nWe living in these times of love and cholera\nSynonymous with the apocalypse, look up the clouds is ominous\nWe got maybe ten years left say meteorologists, shit\nWe still waitin for the Congress to acknowledge this!\n\n[Hook: Talib Kweli] & (singers in the background)\nWhat the people want? Please deliver us\nWe wanna live it up, please deliver us\nTh-th-this is the, th-th-this is the, this is the hostile gospel\nI'm reaching through the fire - please deliver us\nI'm preaching to the choir - please deliver us\nJust keep it real with us, you scared to spill your blood\nYour words rung hollow, we need someone to follow\n\n[Talib Kweli]\nYou ain't promised tomorrow, so get your paper up\nYou can't always just borrow and asks for favors bruh\nStand on your own two, never covet thy neighbor's stuff\nKarma's a bitch so watch your mouth and what you sayin bruh\nI start a conversation based on general observation\nHip-Hop is not a nation, take it to population\nNiggas got a lot to say when locked inside the belly of Satan\nAwaitin trial debatin how the hell I got placed in this system\nAm I a victim or just a product of indoctrination?\nThey exploit it and use me like a movie with product placement\nYou hear the congregation; this is the hostile gospel\nThe truth is hard to swallow it'll leave you scarred tomorrow\nKeep it honest our motto, these niggas keep it bottled\nI'm the writer who reach the fighters like speeches by Cus D'Amato\nDJs stickin to vinyl like \"Fuck Serato\"\nSuppliers who ride around the block, in the custom autos\nBallin like the struck the lotto you know who the cleanest is\nA nigga keep it reeich with the stitch and greedy geniuses\nI'm not a hipster, but I flip it like a sneaker pimp\nExpose the game, treat it like a bitch\nSmack fire out these hoes, cause they snitch and tap wires while I plead the fifth\nYou can't trust a soul in the biz, so be careful who you eatin with\nAnd sleepin with and also who you chiefin with\nYou never know they might've added in secret ingredients\n\n[Hook]\n\n[Talib Kweli]\nFreedom's a road that's seldom traveled, watch hell unravel\nRight before the eyes of the soldier who fell in battle\nThe single mother who raised her daughter to bear the sacred water\nAnd not take the hand of every man who make a offer\nTo black kids wishin they white kids, when they close they eyelids\nLike, \"I bet they neighborhood ain't like this\"\nWhite kids wishin they black kids, and wanna talk like rappers\nIt's all backwards it's identity crisis\nThe industry inside us is vipers with fangs trying to bite us\nDrug suppliers is the health care providers\nWe cakin, makin narcotics outta household products\nWe ain't workin out 'til we exorcise the demons that's inside us\nPlus they seem to just provide us with enough rope to hang ourselves\nEnough dope to slang ourselves, enough toast to bang ourselves\nIt's officially nigga season, these niggas is bleedin\nThat's why I'm spittin freedom we had enough of trigger squeezin\n\n[Hook]\n\n[Outro: singer]\nIn these tryin days and times\nAll I need is to be free\nI can't do it on my own\nLord can you deliver me?\nThere are trials still to come\nIt's salvation that I need\nSo I'm reachin to the sky\nLord can you deliver me?\nDeliver us...\nDeliver us, yeah\nDeliver us, ohhhhhhhhhh\nOh, deliver us\nDeliver us\nOhhhhh Deliver us yes\nDeliver us, deliver us, deliver us\nYeah yeah yeah, ohhhhhhhhhh... {*ad libs to fade*}"}], "artist": "Talib Kweli"}