{"artist": "Yung Joc", "songs": [{"album": "New Joc City", "image": "https://images.genius.com/4f7261aa3bdb3fba5296c681e1a136cf.599x588x1.jpg", "year": null, "lyrics": "[Intro: Yung Joc] + (Ms. B)\nEenie, meeny, miney, moe\nHow many bitches from the club want go\nI knowwww you see it; I knowwww you see it\n(I'm like eenie, meeny, miney, moe)\n(How many niggas in the club want go)\n(I knowwww you see it; I knowwww you see it)\n\n[Yung Joc]\nNow you can call me tip drill, they playin my songs\nThrow a couple ones, then she throw away her thongs\nWhen she bust it open, take a picture with my phone\nShe love my cologne, call it purp by the zone\nNow she pussy poppin, yeah it's goin down\nSlap the waitress on the booty, tell her get another round\nAnd when I make it rain, money all over the ground\nFresh Force Ones, Sean John buttoned down\nAnd then I'm like, \"Ohh, boy, my click full of stars\"\nBig fo'-fifth, big dick and big cars\nAt the end of the day when it's all said and done\nI'mma need fo' freaks, cause I need more than one\n\n[Hook 1: Yung Joc]\nEenie, meeny, miney, moe\nHow many bitches from the club want go\nI knowwww you see it (I know you see it)\nI knowwww you see it (I know you see it)\nI'm like bim (bim) bam (bam) I know you want some (some)\nShe chewin on the dick like a piece of Bubble Yum\nI knowwww you see it (I know you see it)\nI knowwww you see it (I know you see it)\n\n[Hook 2: Ms. B]\nI'm like eenie, meeny, miney, moe\nHow many niggas in the club want go\nI knowwww you see it (I know you see it)\nI knowwww you see it (I know you see it)\nThen I'm like dim (dim) damn (damn) I know you want some (some)\nYou chewin on the pussy like a piece of Bubble Yum\nI knowwww you see it (I know you see it)\nI knowwww you see it (I know you see it)\n\n[Ms. B]\nI ain't never been the type to show off in the club\nReal laid back, poppin plenty bottles of\nBub, don't smoke but I got much perk\nGet that nigga real high, make him slurp it then burp\nCould you be a groupie? I hear you singin my song\nLike I see you, lemme feel yo' tongue\nIt's me, Ms. B, nigga let me get you laced\nTake a step back, blow the pussy in your face\nI ain't talkin kush nigga, talkin the rat race\nSo many to choose from, give 'em all a lil' taste\nGot a house full of pussy, the madame of hip-hop\nMy bitches are superstars, so gushy you need a mop; yeahhh\n\n[Hook 1] + [Hook 2]\n\n[Yung Joc]\nI got stacks on deck, snowflakes on my neck\nNew J's on my feet, make my outfit complete\nI knowwww you see it - I knowwww you see it\n\n[Ms. B]\nI got stacks on deck, niggas love my flow\nGot a mohawk blowin, Urr Forces that glow\nI knowwww you see it - I knowwww you see it\n\n[Hook 1]\n\n[Hook 2] - 1/2", "title": "I Know You See It"}]}