{"songs": [{"title": "A Muse To Death", "lyrics": "Akala:\n\nThe Assassin, The Jailer, The Woman of Purpose, The Scared Husband and The Child Left Behind all connected by the chains of death\nOr strings are they? Or bonds? Or unbounded?\nDepending only on your perspective\nThe rattling keys performed a strange duet with the footsteps on the concrete\nThis music, like all music, was a matter of personal taste\nTo the woman it resounded glory, the glory that awaited her this very day\nTo her husband, however, the sounds announced doom\nThough they both awaited the same fate how differently they came to view what lay ahead. As the steps and the keys waltzed closer to the cells, so the glory and the doom grew more imminent\nThe jailer was a short, squat fellow\nA man blessed with neither looks nor intellect that had not the humility to pursue one in-lieu-of the other\nHe gave the impression of being exceptionally ugly for no particular defect on his face, but as if bitterness had twisted his rather plain appearance into a grotesque cocktail of ill-matched features\nHe was also a sadistic man who took pleasure in watching others suffer and, thus, found pride in a line of work that even hardened souls usually found challenging\nBut this woman, this prisoner, was different. Some unspeakable quality of hers made the bully uneasy and the bully chose as all cowards do to be wary of those that seem game for the fight\nAs he approached her cell the jailer felt that unease in himself that he so resented\nHe looked to The Torchbearer as if to say \"watch this one\", before unleashing the keys from his belt and slowly as if opening the cage of a tiger unbolted the cell of this woman\n\"Come now you treacherous whore. Death awaits you.\" The Jailer said, with a smugness barely masking his fear\nThe Torchbearer laughed\nThe woman looked up menacingly calm\n\"Only cowards die. Heroes live forever.\" She retorted with no hint of arrogance or irony and she spat by The Jailers feet\nThe Jailer examined the spit on the floor with contempt as if he was about to explode in rage, but then raised his head only to reveal a wry grin. \"Ah, bless, this silly little woman thinks she is a hero, listen whore get up, lets go\"\nThe Jailer expected resistance and so was made even more uneasy when the woman got up and walked purposefully toward him, seemingly unbothered\nIt even appeared for a moment that her shackled hands and feet had been unbounded by the surety of her walk\nThe Jailer joined her cuff limbs to a lead held by The Torchbearer\nPleased with himself The Jailer then moved toward her husbands cell, the difference could not have been starker\nThe Husband trembled and quivered as if fever overtook his body, visibly scared of The Jailer and all that he represented\nThe cell door cranked open\n\"Lets go\" barked The Jailer\nStrange thing, it was\nThis man had been a brave warrior, fighting for principle and freedom\nA stalwart in the revolt and every bit as brave as his famous general of a wife, but somehow capture had stolen his fighting spirit and the knowledge that he and his wife now faced certain death left him a wrecked shell of his former self\nThey all walked through the corridors of the damp dungeon and the music of keys and chains and concrete now became a symphony\nThe Jailer, The Torchbearer, The Wife and her Husband emerged onto the hanging platform and the light of the midday sun blinded them all for a moment\nA rapturous crowd gazed up, some screaming for death wishing these traitors to The Empire a quick sentence\nOthers un-politicized in their hate just longed to see some blood, but there yet others in the crowd\nThe Oppressed, The Enslaved, those of Revolutionary imagination to whom this woman and her husband were legendary commanders who had fought the mighty Empire for well over a decade with courage and skill and they had fought for them, for The People, for Freedom\nThe woman of purpose looked into the eyes of The Oppressed and saw that they still looked to her even now and that how she faced death would either give them courage or kill them further\n\"They had lived lives worse than mere death, so why be scared of must come?\" she said to herself\nShe looked at her cowering Husband and commanded him\n\"Stand straight! Our People are looking do you not know how sweet it is to die for Liberty?.\"\nThe crowd screamed and hissed and laughed at this man cowered by death and upstaged by his wife\nThe man did his best to muster some kind of strength, but it was no use and as the wooden beams creaked beneath his shaky feet it was clear that every inch of his fighting spirit had been eroded\nThe Hangman approached with a noose and the condemned man had a brief moment to repose\nWhen he saw the face of his only child among the crowd all fell silent for him\nHe was awakened by the feel of rope around his neck and then tormented by the thought of her, his only child being left an orphan and he began to sob and beg and resist as The Hangman fastened the noose and readied the drop and when asked for his last words all the man could offer was a feeble \"Please, please, please...\", but before he could finish he was interrupted by the awful sound of the platform dropping beneath him and his body fell\nHe struggled and spat and cried and tried to escape the The Eternal Clock\nThe punishment of his tormenters\nEventually the last drop of life extinguished from him and he hung limp\nThe Hangman then approached The Woman of Purpose with another noose and she snatched it from him, like a greedy child eager to open a new present\nShe pulled the noose around her neck ceremoniously as if she were a Queen and this her most expensive jewellery and before she could even be asked what her last words were she shouted \"Liberty or Death\"\nAnd leapt into the hanging pit without struggling with a smile as broad as the ocean until her spirit left her body\n\nIs Freedom subjective?\n\nCan we choose how to die?\n\nIf Freedom is a lucid dream, death is a silent scream, that deafens all who dare to witness this intrepid scene\nThe nightmare that ensues is our particular views [?] crushed at the altar of the self, yes, they give us Hell\nWords are metaphors agreed upon as I can tell\nFreedom is a musical solo played by a writers pen\nPictures painted by the strings of a violin\nA folk-song sung by the brushes of every master painter\nIs there anything stranger than human behaviour?\nWe chase this thing called Freedom, but know no destination\nSomeone tell me its place or its precise location?\n\nFreedom's the rebellious slave choosing the way to die\nFreedom is lying on the back staring at the stars\nFreedom a rebellious slave choosing a way to die", "year": null, "album": null, "image": "https://images.genius.com/3222ca5815132f2ac56b73bacb186bf1.1000x672x1.jpg"}], "artist": "Akala"}