{"songs": [{"lyrics": "[Aceyalone]\nExcuse me - sir, whose microphone is this?\n\"I think it's that guy over there\"\nThis guy over here?\nExcuse me, is this your microphone?\n\"Yeah\"\nI mean, I've seen a lot of MC's on this microphone\nBut this is your microphone, right?\n\"Yeah, yeah, it's mine\"\nI mean, what I really wanted to know is\nIs this really, I mean really, really your microphone?\n\n[Aceyalone]\nThis microphone is mine\nWhenever I hold it, I transcend time\nThis microphone allows me to shine\nBright, with the light\nThis microphone is my weapon\nThis microphone is my confidant\nThis microphone is my magical wand\nTo make all y'all, all y'all\nI mean all y'all respond\nYeeeaahh\nThis microphone takes me one step beyond\nThis microphone helped to save my soul\nThis microphone helped to pave this road\nThey say \"what do you do?\"\nI say \"what do you mean?\"\nThey say \"what's your profession\"\nI say \"microphone fiend\"\nThis microphone is the one and only thing\nThat lets me live, lets me open up and give\nThis microphone helps me not be broke\nThis microphone helped to feed my folks\nThis microphone always keeps me awoke\nI tell the truth and I don't tell jokes\nNow check it\nI tell the truth and I don't tell jokes\nNow check it out\nThis microphone, when it's in my hand\nWith or without a band, or a mic stand\nI command, even if it's static-y and distorted\nI still gotta automatically record it\nThis microphone, connected to the power supply\nMy thoughts blossom, like flowers in the sky\nThis microphone...\n\n[P.E.A.C.E.]\nDeactivate factor\nWe fracture microphones\nIs that a microphone? a microphone?\nGo on and roam, take out loans\nIf you wanna own, backpains, swallow it down\nLive from LA, it's Peace and Aceyalone\nSpeak rhymes over cell phones\nNow I know you not gonna sing that song\nWhy? cause ain't nobody gonna understand that, homes\nThis fool is the most assured ?? and thongs on\nDown car phones, somebody passed out\nWith the car door opened, assed out\nRun up on him, see what he got\nA nice box of microphones, microphones\nThese are the same ones being slung to the clones\nOooh, another busted busta getting broke by the microphone..\n\n[Spoken]\nOkay, now I see you proved your point\nSo now, I do have another question for you\n\"What's that?\", \"Why so many questions, man?\"\nI want to know, who's style is that?\n\n[Aceyalone]\nAw P.E.A.C.E. man you know these fools are just LIARS\nThey got fundamental problems they're good DRYERS\nBut they're not FLIERS\nThey're wings are broken, they're sittin' there choking on bones\nWhen they can get down on the microphone\nI'm committed, I did it, I hit it\nCompletely.. reared system\nAll booted up uh, all suited up huh\nLooking all cute, when I'm about to.. take your boots\nAnd I'm about to take the gloves too\nAnd everything I love I.. love you but I still gotta shove you\nIn my oven full of MCs cause you're not maTURE\nYou're not PURE, your styles don't enDURE\nFor SURE! .. this is WAR!\nAnd I'm a warrior and you get ripped up and tore\nAll into pieces, huh, but uh check my thesis\nP.E.A.C.E. is up next, aight peace\n\n[P.E.A.C.E.]\nYou say styles is what you want, huh\nYou say styles is what you flaunt, huh\nBut you're not knowing about P.E. A-C-E and Aceyalone\nWe get down straight burn it to the bone\nOn the micropho-o-one, micropho-o-one\nGet on down hound, dance if you wa-a-ant\nWe don't care we 'bout to take y'all home\nTo the end of the cut y'all don't know what's up\nBut break me down now\nSee ya homie\nWe out\n\nMicrophone", "title": "Microphones", "album": "Accepted Eclectic", "image": "https://images.genius.com/4f38e699f6f80a3255420adf5e98a0a8.600x600x1.jpg", "year": null}], "artist": "Aceyalone"}