{"artist": "A$AP Rocky", "songs": [{"title": "1Train", "image": "https://images.genius.com/75621d1119a70043aadbe3fbf4387d88.640x640x1.jpg", "album": "LONG.LIVE.A$AP (Deluxe Version)", "lyrics": "[Produced by Hit-Boy]\n\n[Verse 1: A$AP Rocky]\nAh, feelin' like a vigilante or a missionary\nTell my A$AP killers, get they pistols ready\nSend 'em to the cemetery with obituaries\nDon't be scared, nigga, is you ready?\nI've been thinkin' 'bout all the O's in my bank account (What?)\nX the hoes in my bed is 'round the same amount (What?)\nEver since this new star fame came about\nOr ever since me and Drizzy started hangin' out, huh\nYoung boy, let his gun bang, let his nuts hang\nTransition to a Lamborghini from a Mustang\nDrugs slang in the drug game with the hustling\n(I know one thing) Anything is better than that 1 Train\nBag made of Goyard, cheffin' like I'm Boyar-\nDee, probably sellin' D in your local courtyard\nBraids like I'm O-Dog, my la familia go hard\nDown to my inlaws, they outlaws with no laws\n\n[Verse 2: Kendrick Lamar]\nWe outlawed then I bogart, any pros that got 'proached at\nWith a toe-tag, get broke off in the projects with a skateboard\nI roll past and I blaze y'all like, \"Doo, doo,\" I hate y'all\nWhen the beef cooked, I ate y'all like, \"Mmm, mmm!\"\nLet's play ball in a ballpark with all sharks and a blindfold\nI rhyme cold, my K hot, your 9 cold, that bark like K9's on\nThat banana clip, straight from the rip\nI'll make that shirt say RIP, I'm on some shit\nIf I'm not the hottest then Hell must have froze over\nYou thought it was safe then forgot what the code was\nI carry traits of a traumatized soldier\nDon't look in my face, I might snap, I might choke ya\nSpine right out of place, give me dap like you 'posed ta\nDarts at your posters, dark nights like this\nI metamorph like I'm 'posed ta, I might slice my wrist\nOr pretend like a vulture and drop off this cliff\n\n[Verse 3: Joey Bada$$]\nBarely even conscious, talkin' to my conscience\nGettin' deeper in these flows like conches\nI'm on my convict, don't drop bars, I drop prisons\nDon't sell rocks, seen the spectrum through the prisms\nSomehow bypassed the bias and the -isms\nThe violence and the killin', so given\nThey seen my pigment and thought that was the ign'ance\nUnfortunately, I am not that type of niglet\nBut pass the pot, let me skillet\nJust got back to the block from a 6 o'clock with Jigga\nAnd I'm thinkin' 'bout signin' to the Roc\nBut my niggas on the block still assigned to the rocks\nAnd I swear it hurt me soul\nI try to prevail, but when I preach, I only hurt their sales\nLike you're only gon' end up either dead or in jail\nBut you my nigga, wish you the best for real\n\n[Verse 4: Yelawolf]\nWhen you mention my name amongst other white rappers\nOr for that matter, any fuckin' rapper, fuck it\nPainter, skater, musician, trailer park, dirt-ditch-diggin'\nBurger-flippin', eat, sleep, shittin' human bein', you would be in\nTrouble to body double or couple me to these others\n'Cause comparatively speakin', my reach is beyond the bubble\nThat they put me in,my vision's beyond the Hubble's\nI huddle with Nubians, new beginnin' again\nYou in school at 10, late, Radioactive's goin' gold\nAnd so? Great! Do I give a flying duck?\nIf I'm applyin' love to my rhymin' plus alignin' us?\nAlabama's climbin' up—wait, no I don't give a\nFlying duck, nothin' but a buckshot, ch, pow!\nMotherfuck your life, pussy blood clot\nAin't never been no rapper this cold since 2Pac was froze\nAnd thawed out for a spot date at a Coachella show, Yelawolf\n\n[Verse 5: Danny Brown]\nWeed a different color like a hoodrat bra and panties\nAnd my flow be overhead like pots and pans in pantries\nAntsy 'cause I'm high like Michael Jackson, penny loafers\nMoonwalkin' on the sun, barefoot, with shades on\nBitch pussy smell like a penguin\nWouldn't hit that shit with my worst enemy's penis\nBitch, when I say this, I mean this: Ho, I'm the meanest\nDick so big, it's like from Earth to Venus\nThat molly got me nauseous, aw, shit, no off switch\nLawless, obnoxious, on that \"suck my cock\" shit\nThat is my synopsis, ostrich's posh shit\nHoes on some goth shit, stop it! You not this!\nNovice, regardless, heartless and awkward\nCryin' tears of vodka, prima donna at the concert\nAdonis smokin' chronic, 'bout to vomit gin and tonic\nJust bein' honest, tell me, isn't that ironic?\n\n[Verse 6: Action Bronson]\nSwiftly, I shift the Bimmer 860\nA heavy smoker, so you know I brought the Blake with me\nThe moon’s reflection off the lake hit me\nYou should have stayed with me\nNow many Asian bitches lay with me\nThe face is silky like a tablecloth\nMy shorty gallop in the mornin' on the beach like a Chilean horse\nRed roses dropped from boxes very often\nConfetti torchin', drinkin' Henny like I'm Kenny Lofton\nOutstandin'\nI fixed the game between Georgia Southern and Gramblin'\nYou see us scramblin', sellin' Susan Sarandon\nThe cloud of smoke like the phantom\nDamn, this shit tastes like fantastic, uh\nYou see me comin' through in each state\nJust so the lord could put the fork inside the cheesecake\nCuffed to my wrist, I've got the briefcase\nThe gavel slam, I'm a free man, try not to eat ham\n\n[Verse 7: Big K.R.I.T.]\nBig K.R.I.T., shawty\nSpit like my last breath: casket rap, six deep\nEyes closed, the black is back, out come the 'lac with flats\nAfter that, bottles I can't pronounce, like, “How you ask for that?”\nWhy you ask for crack and all you had was scratch?\nAll I had was rap, when all they had was wack\nAll I wanted was love and all they had was dap\nFuck them haters and fuck them hoes, a championship win is\nThe aftermath, ask LeBron, open palm, slap a bitch\nWalk the plank or break a bank, I've been in the business of sinkin' ships\nChokin' niggas out with the anchors that they anchor with\nResuscitations cost the label, I'm taxin' if you want a hit\nClear, fuck your career, bitch, I was born here\nBeen a killer, '86er nigga, that's my born year\nGet the fuck from 'round here, that's just my country ways\nSuckin' on your momma's titty, bitchin' while I was choppin' blade\nGrippin' grain, fuckin' hoes, candy paint like Everglades\nMiss me with that rapper chatter, take that shit up with my bass\nI put that on my soul, how could you ever doubt me?\nMost rappers hopin' the world end so they won't have to drop another album\nB.B. King saw the king in me, so why can't you?\nIn order to come up close, you'll have to dig up Cash and Elvis, too\n(That wasn't no sample, nigga!)\nMuddy water flow, Dixie rebel past\nFuck your Louis flag, poppin' benji tags on your wifey's ass\nThat's out of line, but in livin' color?\nI'm more like Miya Bailey on you rap motherfuckers: a true artist", "year": "2013-01-15"}]}