{"artist": "Astronautalis", "songs": [{"title": "These Are The Best Days Of Your Life", "image": "https://images.genius.com/c82d5c33d727c9367192bbbf0940e5be.1000x1000x1.jpg", "album": "The Very Unfortunate Affairs of Mary & Earl", "lyrics": "[Verse 1]\nI struggle with the lock\nI make a joke about how normally it's all cleaned up, you laugh a bunch\nNot at the joke I made, the same line that everyone tells\nWith a poker face in exactly the same damn way\nBrushing off my feeble attempt to impress, you hand me a smile\nDrag your fingers across my chest as you enter the mess\nDrinks are offered, we all explore the nest\nSizing up my sanity through pictures and stitches and fragments I collect\nBut I can't help but think 1000 years down the line\nWhat would archaeologists glean from the fragments of my life?\nWalking around the open tomb of number 214-57-07 Gaston Avenue\n\n[Verse 2]\nGrand gestures as they pry open the entrance\nI wish I could be there so I could explain about the messiness\nAnd leave them breathless with this postcard, the missing message\nWish you were here in this year so we could trade records\nWhat would scientists see of my nightmares and dreams?\nWhat would they decipher from my most private of things?\nMy little bedside boxes\nMy little notes and thoughts jotted on scraps, receipts, and cocktail napkins\nWould it all add up? Would they think I'm a king?\nOr see the truth behind the youth who's too nervous to kiss the queen?\nAm I as dumb as I think or am I too hard on myself?\nMaybe just in case I should put a crown on my shelf\n\n[Verse 3]\nI realize how long I've been hiding inside the kitchen\nToo nervous to be face to face with you without enough jokes pre-written\nI know you get it, you see through my steady hand\nI turn to see you leaning by the oven wearing a face that understands\nWe share a stretch of silence, my hands strangle sweaty drinks\nYour eyes are penetrating, I wanna dive inside the kitchen sink\nI need a stiffer drink, I take a swig and think\nMy brain's a broken glass, shit, I can't remember anything\nYou laugh again holding out your hand I realize\nI'm still holding all the drinks hostage, damn\nI'm still holding hostage, damn\nOur world is falling to pieces, I'm calm and I'm screaming\nAnother step closer, I'll jump, this time I mean it\nHeavy breathing as the radio does the talking\nCarrying on a nice conversation with cubes of ice clinking\nWe say nothing, strangely comfortable, amused by something\n\"It's alright\" you say, and then you touch me\n\n[Verse 4]\nRight there, on the side of my face\nThe softest song, the smoothest lake, it's such a beautiful shape\nFor history's sake, I hope a volcano erupts and covers the city in ash\nPreserving us in powder, leaving the exact moment intact\nForever steadfast, shaped in stone, men of wax\nWhat will they think of us after 1000 years pass?\nHow will they judge us? The clothes, the bodies, the drinks\nWhat will they deduce from those who're seduced by kitchen sink?\nAnd what will it mean to them so far down the line?\nHow calm she made me feel in this embarrassing time\nWhat will they glean from this? This mummified still-life\nThat I could kill my friend to keep this girl's hand wrapped in mine", "year": null}]}