{"songs": [{"year": null, "album": "Tell the World My Name", "image": "https://images.genius.com/13eeaa5fc1948dbfc3568cb96d5a1c08.400x400x1.jpg", "title": "Solo Rocks The House", "lyrics": "[Intro]\n(Solo! Solo!) Rocks the house\n(Solo! Solo!)\n(Solo! Solo!) Rocks the house\n(Solo)\n\n[Verse 1]\nOpen the door, my DJ's on the cut\nInvited to my rap, or look, the door's shut\nAll eyes on the man who runs the house\nOr be small if you can't take a, the on-across Solo\nPain is moved like earthquakes when mirrors break\nTransform, even the dog house shakes\nRhymes of mine own many rappers presence\nVacate this, but still can't be resident\nRappers'll cave and try to get one copy\nTrespass, and got arrested on my property\nIn my house, and locked up and no way out\nWhat do they all see? Solo rocks the house\n\n[Hook]\n(Solo! Solo!) Rocks the house\n(Solo! Solo!)\n(Solo! Solo!) Rocks the house\n(Solo)\n\n[Verse 2]\nCops met on the bathroom sink and tub\nAs Bally footprints cover the living room rug\nWith four rings, no rappers can answer 'cause\nWhen cage collapses, chandeliers fall\nCrap will break walls, celings start to cave in\nFrom the living room, dining room, and den\nRappers'll trap, MC's try to break\n2 rhymes and cuts, thats break, there, 5 escape\nThey wait in the crowd, with nowhere to go\nThey hide in the closet, so their face won't show\n'Til they get hit with shoes, and poles, and flows\nThat hold the clothes, and now the whole foundation unfolds\nTo the ground, rappers on mics can't be found\n'Cause punks are buried, nobody can ever sound\nFor those that with, is this, know what it's all about\nThe neighbors tell the cops, Solo rocks the house\n\n[Hook]\n(Solo! Solo!) Rocks the house\n(Solo! Solo!)\n(Solo! Solo!) Rocks the house\n(Solo)\n\n[Verse 3]\nTricks are treats, so put my mic in the bag\nAnd rap and serve with a hat\nNow rappers want to round and brag\nMC's who perceive warning, don't let me catch you\nSleepin', or yawnin' in the mornin'\nI'll be waitin', also takin'\nMC's out, on a rappin' group awakenin'\nRead up my rap style, you never know you might\nGet hit in the head with consecutive rows of flows\nBeats go together like Clash of the Titans\nRhymes are hittin' harder like a punch from Tyson\nI never found a foe too hard to fight\nI might jump up on the wage of the stage, a poltergeist\nWitty the ditty, think the pretty\nCome off of jams, I'm flauntin'\nAnd yell \"They're from the city\"\nWell I'm from Long Island where rappin' and rhymin' is hype\nBoth you frogs, you disapear like bat might\nGrab your dice, throw your roll, you crapped out\nI grab the dice, now I roll C Lo\nNothin's hard, for K-Solo to do\nI'm like vodka, I'm Absolut-ly\nDeadly, MC's, don't even step to me\nAs I cause death and won rap victory\nRappers fit the same descriptions, soft\nThey sayin' they're makin' records\nBut rappers are still walkin', talkin', also stalkin'\nLookin' for a manager or producer in New York\nAnd they might see you, ask what y'all can do\nSee you kick a weak rhyme, and flaunt your crew\nTime's up, your appointment's through\nYou hear the man\n(Don't call us, your style sucks, we'll call you)\nThe problem what you know music, weak rap lines\nYou stopped at the wrong place at one wrong time\nSome pray to god for one contract to sign\nThey name their posse's name on the dotted line\nYou're like to rest to me, say weak mind\nSo grab a ticket and number, punk, get on line\nWe can go rhyme for rhyme, hit for hit\nGrab the bad mit, Ok, let's play rhyme-a-hit\nI'm at the bat, you throw a pitch\nI take aim, swing a Solo rhyme, it's a hit\nSo chase me with mitts like a baseball\nTryin' to get it, but drop the midget quick\n'Cause I'm a home run hit\nBases loaded, quote, take note and\nFour hit records at one time, Solo wrote and\nI design the flow and rhyme something like a sketch\nAnd dress it and press it until it sounds like Memorex\nOn tape, when I rhyme, I don't rhyme straight\nI rhyme crooked with zig zag and base\nSome, rhyme, punks inherit their own fate\nTo be that crab, so that's when I pass plates\nTo wait if, to wait for other crab MC's\nThrowin' them back in the ocean\nSo they can flow against me\nThey get an idea, some try to swim high\nGet trapped in the bay or they get lost in the tide\nWhere I live, bigger and better try to bite me\nLike Jaws, 1, 2, and 3\nBlind mice, who doin' the louie, I kick\nRhyme crazy, never Hong Kong Phooey\nMC's are the same, livin' large\nRappers are frontin', 'cause they want to be stars\nYou tell two friends, so on and so on\nAnd I'm gone, that's the end of the song\n\n[Hook]\n(Solo! Solo!) Rocks the house\n(Solo! Solo!)\n(Solo! Solo!) Rocks the house\n(Solo)\n\n[Outro]\nSo flow production, word up\nOn the strength, PMD cold packin' an AK Mac 10\nWhat's up E?\nYo Mel, I'm out"}], "artist": "K-Solo"}