{"songs": [{"title": "The LP", "album": "The LP", "year": null, "image": "https://images.genius.com/51783bd9801aa4b7b68f22b4f6fd7db5.1000x1000x1.jpg", "lyrics": "[Scratched and repeated]\nLP!\n\nWho is it?\nCome on\nWord is bond\nIt's on\n\n[Verse 1]\nSome people said it couldn’t happen, and couldn't be done\nSettin' up campaigns to diss from day one\nBut now I’ve arisen, the coast is clear\nSo I had to hit you off, your host is here\nStandin' at 5'7\", grown to be Large\nIt's not about the height, it's the power of the charge\nYou get when you listen to this lyricist/beat maker\nEven though I had to take a\nLong time, it was worth it, 'cause now shit's perfect\nI feel like new, givin' up thanks to you\nThe ones that gave me support when I was caught\nIn this wack record industry, trapped, you take a short\nIf you wanna, that’s why I packed up and went on a\nVacation in the ghetto, hangin’ out on the corner\nThe place I know, where the (*scratch*) can go\nWhere we party hard for the dough\nOr get the dough so we can party hard\nI like to flow, no need for bodyguards\nSo when you see me, I'm peace and love\n’Cause you helped this brother increase above\n\n[Hook]\nAnd... It's for my people\nThe LP, it's for my people\nThe LP, it's for my people\nThe LP, it’s for my people\nThe LP\n\n[Verse 2]\nIt's right on time with the dirt and the grime\nThe LP, and insert and to climb\nUp all the charts, on all the pop tarts\nThat call themselves \"Keepin' it real\", but got hearts\nMade of plastic, man, I get busy on the dizzy\nI rock ya whole show and have you askin' \"Boy, is he?\nThe midnight marauder or what?\" 'Cause on the cut\nI remain and I'm representin' Queens, maintain\nLots of knowledge, 'cause this world is my college\nWhere I teach and breach your whole contract, jack\nGo with Large Pro and only get fact\nNon-fiction, but layin' with mad prop addiction\nWit' a twist of rhyme, it's that time\nFor me to not keep prolongin' and born\nOnce again to my friends, this name of this song is...\n\n[Hook]\nFor my people\nThe LP, it's for my people\nThe LP, it's for my people\nThe LP, it's for... for... for...\n\n[Scratched and repeated till the end]\nLP!"}], "artist": "Large Professor"}