{"songs": [{"title": "Flavor (2014)", "lyrics": "[Hook]\nLet me kick my shit\nRide 'round get that paper\nTreat yo bitch like candy\nFuck her now and later\nI flex, I flex, and stunt\nGotta shine on 'em haters\nYo bitch see all that sauce\nSay \"Can I have some of yo flavour?\" (naw)\nYo flavor, can I have some of yo flavor (nah) (x2)\nCan I have some of yo flavor? (x2)\n\n[Verse 1]\nYou can have none of my flavor\nYou can have none of my paper\nYou can have none of my linen\nYou ain't got none of my gator\nI'm movin' these bricks and this shit is conducive\nDesigner, desiger, my shit is exclusive\nFlexin' and flexin', my rims are [?]\nI'm all up at fifth's I'm shoppin' at poochie\nGet well a damn, I go up in Gucci\nI'm on the molly, I'm smokin' the [?]\nI'm Future with bands, I freak, like Boosie\nThey know I'm a dog, they callin' me snoopy\nThe chopper, the scope, and the rifle I want it\nKnockin' em out, like [?] in the mornin'\nMy daughter is 5, I bought her a pony\nI am a steak, and ya'll are baloney\nEt cetera, cetera\nPaper is federal, you gon' need medical\nEat 'em with lyrics, you niggas are edible\nDrizzle be rappin' and snappin' I'm tellin' ya\nUh, let me kick my shit\nBruce Lee, nigga back up\nShe can have none of my flavor\n[?]\n\n[Hook]\n\n[Verse 2]\nFlavor, I am impossible with it\nSurgery, I am a doctor with digits\nG-g-got the monopoly fitness\nHoes up in Onyx, they poppin', they takin'\nUse to be broke and poverty stricken\nNow I got work with them blocks in the kitchen\nThat information is not to be mentioned\nChauffeur, the phantom is not to be driven\nAll of this flavor is not to be given\nYou gotta pay me, they bite me like rabies\n[?] county, born in the 80's\n8 pm sharp, I'm fuckin' yo lady\nYou want a block? Imma take out a [?]\nYou know Imma cut it then mix it with bakin'-\nSoda, cola, bitches in Boca\nMe and fantasia had dinner with Opera\nWinfrey, Bentley, attackin' a semi\nNigga get wrong, Imma tour him like Jimmy\nDrunk as a fuck Imma do it on Remy\nNigga I'm more, the [?] is in me\nRun through your crew like a bull, don't tick me\nToo many hoes, so how they gon' pick me?\nLet me kick my shit\nBack up bitch, hit me!\n\n[Hook]", "album": "Purple Label", "year": "2014-04-20", "image": "https://images.genius.com/db6803d03af9c7c05c52b84d5fb5cd6c.500x500x1.jpg"}], "artist": "Young Dro"}