{"artist": "L’A Capone", "songs": [{"title": "Separate Myself/Intro", "album": "Separate Myself", "year": "2014-01-06", "image": "https://images.genius.com/086ed874c1108cee242267fa19737166.500x500x1.jpg", "lyrics": "[Intro]\nHow you leave your mans dead for a broke bitch?\nMost of these rap niggas on some ho shit\nHow you leave your mans dead for a broke bitch?\nMost of these rap niggas on some ho shit\nHow going to school gone teach more shit\n\nAnd the teacher said I wouldn't be shit?\nMost of these rap niggas on some ho shit\nHow going to school gone teach more shit\nAnd the teacher said I wouldn't be shit?\n\n[Interlude]\nL'A Capone speaking, man. Team 600. Niggas know how I'm coming, man. You know, I just gotta separate myself man...from all this fufu shit. It's a lot of fufu shit going on round here, kid. You hear me?\n\n[Verse 1]\nHow you leave your mans dead for a broke bitch?\nMost of these rap niggas on some ho shit\nHow going to school gone teach more shit\nAnd the teacher said I wouldn't be shit?\nI guess I'm just stuck on that street shit\nNiggas mad cause we ball on that Heat shit\nAnd everyday, I pop out on some flee shit\nI love designer, that's me, shit\nHow you talking to hoes 'bout bro and 'em?\nWhy you talking to hoes 'bout bro and 'em?\nPillow-talking, we gotta expose him\nIf he got them oz., then we poke him\nL'A too real, you can't clone him!\nYou ain't talking no bands, then don't phone him\nTwo-tone chrome under the True shirt\nTry to go on a date and get your boo hurt\nI don't like no dramatic bitch\nSo I just separate myself from shit\nIf you post up, I hope you brought your kit\nCause I'm wounding cats when that chopper spit\nLil Dee in the trap, pop out, Glock out\nHe'll kill 'em, I ain't lying, heard it from the horse mouth\nCan't walk through the Six, you a Brick, another route\nHit a stain for the shit, made it flip, another house\nYoung nigga hood, but I'm trying to make it out\nMeanwhile, these guys trying to get clout\nRiding through the hood, we let 30s hang out\nAnd if he ain't Double-O then he can't hang out\nFuck talking tough, nigga we can bang out\nIt was raining out when my mom put me out\nBut I don't understand what the net beef 'bout\nIt's a drill in your hood so nobody hang out\nI ain't never heard 'bout a top-notch bitch\nSome raw little chick who ain't did no dick\nSo when I get a check, put ice on my wrist\nGot a whole lot of shit, nothing for a bitch\nMy name hold weight so niggas wanna kick\nCall up the lean man, need another six\nGet another stain then do another hit\nSlide on the O, get a yop, now I'm lit\n\n[Verse 2]\nWe don't tolerate bitch-ness\nSneak diss bad for your fitness\nLet's get this, hit your block up, leave no witness\n25 shots, that's Christmas\nGot a handful of niggas on hitlists\nI made this here for the bitches\nAnd the snitches, and the lames\nBrick nigga, stay in your lane\nOnly so long 'fore a nigga get changed\nAll the opps wanna put dirt on my name\nI'm a still be the same, you can keep the change\nAin't too many young niggas in the game\nThat can say they ain't never been a motherfucking lame\nI watched these niggas get bitched by the gang\nIt's levels to this shit, man"}]}