{"artist": "G Herbo", "songs": [{"title": "4 nem ft. Lil Durk", "album": null, "year": null, "image": "https://images.genius.com/910ed08cc34641e27befd74b7e35304f.480x480x1.jpg", "lyrics": "[Intro]\nG-Deso, gang gang\n150 Dream Team, gang shit bitch\nYou know what I'm sayin'\n150, 300, shoutout Durkio, ya know\nAy, foenem, on foenem\n\n[Hook]\nI might fuck your bitch, I stole a Lambo, bitch on foenem'\nHow you girl that bitch? We all fucked the thot before him\nGD's, BD's with me, plus I buy my trees, ain't for them\nPigs at my back room door, don''t ask us shit, don't know them\nI be ballin’ bitch on foenem, you live on streets, on foenem\nOne call they lurk, on folks nem', you don't wanna see foenem'\nOn foenem', on foenem', on foenem', on foenem', on foenem'\n\n[Verse]\nFirst off, lets be clear it's fuck the opps we let off\nShots with foenem, I be all up in the Gucci store clutching\nThe Glock, yea you know I be shopping a lot\nDashing the two door, don't care if I'm solo or not\nCall me \"Swervo\" it's off with the top\nI see the enemy, on sight it's off with his top\nEven though I like talking a lot\nTried to stay up in the trap, fell asleep off the drop\nWoke up, walked on the block, something told me\nTo mix Ecstasy with the Codeine, must of been\nKobe talking to Roc, lately I keep switching states\nAnd a lot of new faces keep hating, don't know why\nI don't know them, foreigns in traffic with foenem\nAnd four seaters, .40's, we 4 deep, you know we got 4 'dem\n\n\n\n[Hook]\nI might buy a ring, I fucked a model bitch on foenem'\nHow you wife that bitch? We all fucked the hoe before him\nGD's, BD's with me, plus I buy my pipes from Moe 'nem\nPigs at my granny door, don''t ask me shit, don't know them\nI be off the Percs on foenem, you get on shirts, on foenem\nOne call they lurk, on folks nem', you don't wanna see foenem'\nOn foenem', on foenem', on foenem', on foenem', on foenem'\n\n[Verse 2]\nG Herbo, yea that's that nigga, you know him\nHe getting that money, on foenem\n600 Horse like a rodeo, in that new Bent' with that\nRollie on, sweater by Kenzo from Tokyo\nI'm from No Limit so I'm reppin' Vito and Fazo\nWith Kobe and Roc that's big bro nem'\nFuck with real niggas, so Lil Durk, he know how\nWe rock, OTF, 0-6 foenem, that's foenem\nWalked in the spot, looking for your lil hoe nem'\nClips is extended, we toting them please don't get hit up\nNiggas be mad hating on foenem' about hoes we been\nFuckin before them, don't even come near us\nPass out them head-shots, they have to shovel a lil\nNigga shit up. can't even sit up, hollow tips put him\nIn shock, now he holding his breath like a hiccup\n\n[Hook]\nI might buy a ring, I fucked a model bitch on foenem'\nHow you wife that bitch? We all fucked the hoe before him\nGD's, BD's with me, plus I buy my pipes from Moe 'nem\nPigs at my granny door, don''t ask me shit, don't know them\nI be off the Percs on foenem, you get on shirts, on foenem\nOne call they lurk, on folks nem', you don't wanna see foenem'\nOn foenem', on foenem', on foenem', on foenem', on foenem'"}]}