{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/3854e18825bf21223a3118da56c258d1.1000x1000x1.jpg", "title": "Halloween", "year": "2017-10-30", "album": null, "lyrics": "[Intro]\nI'm livin' like \"catch me if you can,\" you know?\nThis the amazin' true story of the youngest and most darin' conman\nTricky, swiftly, but yet viciously\nIt's always a mystery\nEvery day a new identity\nI ain't talking cereal, but\nI got all the tricks\nSilly bitch, and I'ma finesse kid\nYeah, we ain't got nothin' for you tricks but some rabbit food\nI could be ya professor 'cause I'll school ya\nI shoulda been born in April 'cause I fool ya\n\n[Chorus]\nGemini, woke up on the wrong side of the sheets\nLike really I shoulda been born on Halloween\nI ain't no demon semen but I do evil deeds\nMy daddy don't ever see me, I ain't no devil's seed\nI don't remember his last time checking up on me\nWhy you drop another album in a week?\nI'm a wolf but I be dressing like a sheep\nPut on my monkey suit and go orangutan\n\n[Verse 1]\nPopping monkeys, popping bottles, make me swing\nWho the fuck you walking in and out my dreams?\nI know I'm smart, you make me do some crazy things\nMonkey on my back, let a nigga be\nPlease, niggas free out here but they ain't free\nYou out here physically, locked up mentally\n'Bout everywhere I go, I gotta bring the ski\nNo face, no case, live everyday like Halloween\n\n[Chorus]\nGemini, woke up on the wrong side of the sheets\nLike really I shoulda been born on Halloween\nI ain't no demon semen, but I do evil deeds\nMy daddy don't ever see me, I ain't no devil's seed\nI don't remember his last time checking up on me\nWhy you drop another album in a week?\nI'm a wolf but I be dressing like the sheep\nPut on my monkey suit and go orangutan\n\n[Verse 2]\nI'd trick so much individuals for a treat\nK Boogie with a Hoodie, best believe\nIt's hot he got the hoodie on to hide the heat\nAnd he got so much tricks up his sleeve\nAll the nights I had to mask up on the scheme\nMy subconscious got me fighting in my sleep\nI can't forget about it I see it in my dreams\nI'm kicking in your door, but I don't want no sweets\nI'm giving you what I came for so I can leave\nYou know I'm serious don't you feel my energy\nNo this not a joke, everybody on they knees\nDon't try to buck jack, you get buckeyed back\n\n[Chorus]\nGemini, woke up on the wrong side of the sheets\nLike really I shoulda been born on Halloween\nI ain't no demon semen, but I do evil deeds\nMy daddy don't ever see me, I ain't no devil's seed\nI don't remember his last time checking up on me\nWhy you drop another album in a week?\nI'm a wolf but I be dressing like the sheep\nPut on my monkey suit and go orangutan\n\n[Verse 3]\nYou ain't gotta be scared just respect a nigga please\nI'm starting to think my cranium got a disease\nThey be like yo Kodak I just seen you on the scene\nThey be like I ain't approach you though, cuz you was looking mean\nDon't need no friends I gotta big family\nI'm a G, it's in my genes\nGlock 23, it's in my jeans\nYou playing freeze tag but I got that beam\nSorry baby I lied, you was just a fling\nI don't love ya, I just wanna get in yo jeans\nTricked her for her treat, tricked her out her panties\nI can't get romantic\nNo I'm not satanic\n\n[Outro]\nI'm not satanic\nWho said that?\nWhy you said that?\nWho said that?"}]}