{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/a9bb9fe645bdfddeca85ef75d292386d.700x700x1.jpg", "title": "Lmfao", "year": null, "album": "SKY LADDER", "lyrics": "Uh, Kool wit' another one\nOoh, god damn, it's a better one\nCoulda been number one hits\nHeh, but your boy never play that shit, it's just rappin'\nLook what the fuck happenin'\nFuck Tom Hanks on the Captain\nSpittin' that African rhyme\nJust woke up from a nap, man\nDude, I'm the man, you a trash can\nShout out the Lauryn Hill\nHe finna be a trash man now, that's good money\nWe in the hood runnin' hella little scam\nHit em with the meta-blam-blam\nThat's a spiritual pistol\nYoung [?] motor with the spherical piston\nCan't get much flexin' in the [?]\nBaby, I'm a motherfuckin' issue\nShout out to Issue\nWe in it like ink in skin tissue\nYa'll get stitches like a snitch do\nAy, fuck blue [?] said Vishnu, people\nSeem me flip the scripts in the Hebrew\nAramaic wit' it\nTrips in the Arabic, slay a bit\nYa'll straight bitch, I'm swearin' it\nKissed by the seraphim\nSick credit with the Vedic knowledges\nYea, I went to college, bitch\nBut the knowledge that I bring is beyond that\nTruly astonishing, beyond rap, beyond man even\nHeh, meet me on the sand [?], young gladiator\nYou mad, you a hater. Why you mad, player?\nSee you later, like a alligator or a crocodile\nYou don't see me in the wall\nThat's your front door with a steel in the smile\nA deal in a while\nHella real in the style\nYou can feel how I die, get down, and back up again\nYour boy hella blessed I'm a lucky man\nHit it in the bath with a clip, with a ducky [?]\n[?]\nBreakin' all my [?] up for the Ludakris song\nSit down for the anthem, fuck America\nFuck the American nation\nRather be Jamaican or Haitian, better yet Cuban\nKool A.D. more humid than human\nFollow my nose like a Toucan\nOne man army but it feel like two man\nBetter yet Navy, who [?]\nLook, your boy is so crazy\nI feel like Jay Z in the 80's maybe\n[?] I admit, I'm a 80's baby\nYes I'm the shit, you could pay me daily\nNothin' never phase me\nSuckers get paisley darts to the neck\nI'm smart with the arts in my [?] get the check\nYou know your boy sports sport with the best\nGoin' through the park in the vest\nYou don't show up with the Kevlar\nCall me killer heart I get hard\nPlus lines my n- plus lines like my name was, um, Chris Gethard\nGo dumb like a retard\nSorry if uh that was maybe out of line\nI'm out of my mind like my uncle ro- run motown, what?\nGet up in the pad, get mo down\nGet the hootenanny, shindig, jamboree, hoe down\nIf you ain't -if you ain't knew now then you know now [?]\nI could never slow down, no, nah, nah, not ever\nSee me on Valencia street with uh, Dave Eggert\nProfessional man of the letters, you a bed wetter\nI'm a bread-getter, plus a head-getter\nDot on your chest like a red letter\nScarlet O'Hare with the literature\nHo [?] wit it, your bro [?] digits\nJust as a hobby\nObi-Wan Kenobi told me in the lobby [?] kobe, what?\nPosse on Broadway\nPoppy [?]\nYou a Conway shopper [?] proper\nJohn Jay Styles that's Loco\nDrivin in the [?] Jorge in the Volvo\nI'm a pimp I'm a chulo, I'm a cholo\nYou a wimp, you a loser, you a Bozo\nYou a shrimp, you a joto\nHeh, you a git, you a hobo\nSee me on Fresno stalin' like [?]\nShit, in a cranberry DeSoto\nYou don't even know how my flow go\nEvery which way mayne\nThis day, every previous one and the next one, too\n[?] how I rep you, check you\nMicrophone check\nCalifornia, California, I'm a [?]\nBest rapper in the world, everybody know\nHow many more seconds we got on this shit, let's cut this shit out, okay"}]}