{"songs": [{"year": "2008-01-01", "image": "https://s3.amazonaws.com/rapgenius/RapperBigPooh-02-big.jpg", "title": "Nobody Do it Like Us", "album": null, "lyrics": "[Rapper Big Pooh]\nOh, oh, do that mayne\nTell Cannon run that back, watch him do it again\nYeah, my heart pure but I do it to gain\nI done had my shared drama but I do that again\nMayne, man, you don't wanna say that loud\nNo sweat from the kid, watch me wipe my brow\nNeed a good ass-whoopin but you not my child\nPut Rapper in your deck, watch the women go wiiiiiiild\nCause they love my style\nLove the tats on my arms and the sexy profile\nFresh pair of feet, two dimples when I smile\nWhen I step out, get numbers by the piiiiiiiles\nPooh's a screwdriver\nFace all in it like a deep-sea diver\nSweet piece of chocolate like you found me at Godiva's\nHad other men but not now, nigga liver\nWell go on say it, who's official?\nDude with no stripes, black shoes or a whistle\nI'm everywhere when there's plenty pixels\nPop quiz niggas grab your number two pencils\nNow everybody want to stencil\nFree hair artist, got business to attend to\nCheck me out, go hard in the rental\nLet me slow it down 'fore I lose my credentials\n\n[Hook] {X2}\nOh my god, we go hard\nThat's my squad, nobody do it like us\nNah, nah, nobody do it like us\nUh, no, nobody do it like us\n\n[Joe Scudda]\nOh, you don't hustle, you don't work, you don't grind\nI will take your spot, you all mine\nAnd while you recline, I decline\nI never really stop in one place, I bring it back like a rewind\nCause I ain't ran with that\nI bring it back to the crib and break it down and dismantle that\nI build it back up, your homie, I'm the man with that\nAnd I push it to the people like packs and tell 'em 'handle that'\nThis is ain't Dancesport sandal rap\nThis is Nikes, love me, hate me, like me\nFight me, bite me, fuck it, bitches like me\nTell me what it is, homie, damn what it might be\nUh, this ain't that flat-tire, broken window hoop flow\nIt's that two-door European coupe flow\nMeaning I'm fly boy, and I despise you guys\nI advise you get your eyes on the prize boy\n\n[Hook] {X2}\n\n[Outro: Rapper Big Pooh, Joe Scudda]\nYeah, it's your boy muh'fuckin Rapper\nYou know what it is, your boy J.O.!\nAnd in the back we got my man Don Cannon\nI like the way that one sound\nYou know what it is\nHOJ's in this nigga\nYou know! 9-1-9\nBig Dho starring the motherfucking Commissioner\nWhat up? Jay-Z, what's poppin?\nChaundon, the back motherfucking Twista! What up?\nI'm on them Coronas man, what up? What's poppin Corona?"}], "artist": "Rapper Big Pooh"}