{"songs": [{"title": "Comedy Tragedy History", "lyrics": "[Verse 1: Akala]\nDat boy Akala's a diamond fella\nAll you little boys are a Comedy of Errors\nYou bellow but you fellows get played like\nThe cello, I'm doing my ting\nYou're jealous like Othello\nWho you? what you gonna do?\nAll you little boys get Tamed like the Shrew\nYou're mid-summer dreamin'\nYour tunes ain't appealing\nI'm Capulet, you're Montague, I ain't feeling\nI am the Julius Caesar hear me\nThe Merchant Of Venice couldn't sell your CD\nAs for me, All's Well That Ends Well\nYour boy's like Macbeth, you're going to Hell\nMeasure for Measure, I am the best here\nYou're Merry Wives of Windsor not King Lear\nI don't know about Timon\nI know he was in Athens\nWhen I come back like Hamlet you pay for your action\n\n[Verse 2]\nDat boy Akala, I do it As You Like It\nYou're Much Ado About Nothing\nAll you do is bite it\nI'm too tight, I don't need 12 Nights\nAll you little Tempests get murked on the mic\nOf course I'm the one with the force\nYou're history just like Henry IV\nI'm fire, things look dire\nBetter run like Pericles Prince Of Tyre\nOff the scale, cold as a Winter's Tale\nTitus Andronicus was bound to fail\nSo will you if Akala get at ya\nThat's suicide like Anthony & Cleopatra\nCymbeline was a modern day Bridget Jones\nLove's Labours Lost, a woman on her own\nShe needed Two Gentlemen Of Verona\nThis is illa State and I am the owner\n\n[Verse 3]\nWise is the man that knows he's a fool\nTempt not a desperate man with a jewel\nWhy take from Peter to go pay Paul?\nSome rise by sin and by virtue fall\nWhat have you made if you gain the whole world\nBut sell your own soul for the price of a pearl?\nThe world is my oyster and I am starving\nI want much more than a penny or a farthing\nI told no joke, I hope you're not laughing\nPoet or pauper which do you class him?\nSpeak eloquent, though I am resident to the gritty inner city\nThat's surely irrelevant\nCall it urban, call it street\nA rose by any other name, smell just as sweet\nSpit so hard, but I'm smart as the Bard\nCome through with a Union Jack for the yard\n\n{verse 4]\nAkala, Akala, wherefore art thou?\nI'm the black Shakespeare and\nThe secret's out now\nChance never did crown me, this is destiny\nYou still talk but it still perplexes me\nDevour cowards, thousands per hour\nDon't you know the king's name is a tower?\nYou should never speak it\nIt is not a secret\nI teach thesis, like anicent Greece's\nOr Egyptology, never no apology\nIn my mind's eye, I see things properly\nStopping me, nah you could never possibly\nI bear a charmed life, most probably\nFor certain I put daggers in a phrase\nI'll put an end to your dancing days\nNo matter what you say it will never work\nWrens can't make prey\nWhere eagles don't perch\nI'm the worst with the words\nCos I curse all my verbs\nI'm the first with a verse to rehearse with a nurse\nThere's a hearse for the first jerk who turn berserk\nOff with his head, cos it must not work\nRamp with Akala, that is true madness\nAnd there's no method in it, just sadness\nI speak with the daggers and the hammers\nOf a passion when I'm rappin I attack 'em\nIn a military fashion the pattern of my rappin\nChattin couldn't ever map it\nAnd I run more rings round things than Saturn\nSick, never slackin' like a pig with a baton\nVerses split big kids wigs when I'm rappin\nThat boy Akala, the black Shakespeare\nDidn't want to listen, when I said last year\nRich like a gem in a Ethiope's ear\nTell them again\nFor them who never hear", "year": "2007-10-01", "album": "Freedom Lasso", "image": "https://images.genius.com/c8c06fa89db19b40c9c6483e9b394b40.360x360x1.jpg"}], "artist": "Akala"}