{"artist": "Ace Hood", "songs": [{"title": "All The Way Up (Beast Mix)", "album": null, "year": "2016-04-01", "lyrics": "[Intro: Ace Hood]\nStorm comin'\nGo! Hood, Go!\n\n[Hook: Fat Joe]\nNothing can stop me, I'm all the way up (oh, all the way up)\nAll the way up (all the way up)\nI'm all the way up (I'm all the way up)\nI'm all the way up\nNothing can stop me, I'm all the way up\n\n[Verse 1: Ace Hood]\nOut in Abu-Dhabi, got twenty bitches off in the lobby\nThe only Bu I know is the Gatti, ballin' my hobby\nI copped the rollie playin' with A$AP, got it Rocky\nThe jewels all icy, it's likely I'm playin' hockey\nI give my chick the work, and I make her twerk on the cocky\nI heard they tryna stop me, I'm kickin' shit like Miyagi\nOoh, kemosabe, they think I'm illuminati\nI'm still in the cut with them hitta's who catchin' bodies\nI know most niggas jealous, I'm coppin' Rolls' with the fella's\nMy situation developed, I'm on a whole 'nother level\nRockin' new Margiela's, I got this shit out the cellar\nHood Nation forever, I got the juice to propeller\nSo I'm on the road with the squad, goin' up with the vibes\nWatch me run through the money, I'm tryna pass the baton\nTell them niggas who lookin', I'm not that hard to come find\nBlow em' up for every second they were sleepin' on mine, nigga\n\n[Hook: Fat Joe]\nI'm all the way up (oh, all the way up)\nAll the way up (all the way up)\nI'm all the way up (I'm all the way up)\nI'm all the way up\nNothing can stop me, I'm all the way up\n\n[Bridge: French Montana]\nShawty whatchu' want? shawty whatchu' need? (whatchu' need?)\nMy niggas run the game, we ain't never leavin' (never leavin')\nCountin' up this money, we ain't never sleep (never sleep)\nYou got V12, I got 12V (skrrt)\nGot bottles, got weed, got models (models, I'm all the way up)\nShawty whatchu' want, I got whatchu' need (need)\nShawty whatchu' want, I got whatchu' need (hah?)\nShawty whatchu' want, I got whatchu' need\n\n[Hook: Fat Joe]\nI'm all the way up (all the way up)\nI'm all the way up (all the way up)\nI'm all the way up (all the way up)\nI'm all the way up\nNothing can stop me, I'm all the way up (all the way up)\nAll the way up (all the way up)\nI'm all the way up (I'm all the way up)\nI'm all the way up\nNothing can stop me, I'm all the way up (I'm all the way up)", "image": "https://images.rapgenius.com/b39d4a337ba6a6c16a15d6442f3eb47d.500x500x1.jpg"}]}