{"songs": [{"title": "Practice", "lyrics": "[Intro - Allen Iverson]\nWe sitting here, I'm supposed to be the franchise player\nAnd we in here talking about PRACTICE?\nI mean, listen we talking about practice\nNot a game, not not not the game that I\nI got out there and die for\nAnd play every game like is my last not the game\nWe talking about practice man\n\nVerse 1\nCover the flash on these cameras\nI manufacture  street anthems\nWhat we talkin about? Huh?\nPractice? Or Lights Camera Action\nWhen I get active. Passion\nNever went out of a Fashion\nSomething Like Reebok Classics\nToo many sleepless nights I sacrifice to fall off top like dandruff\nChampion\nASAP with the bag G!\nYeah I rap but they pay me like an Athlete\n.............\n.... on my neck piece\nKeep It Sexy, Flexy\nBut taking it slowly never impress me\nThat' why I got the game by the testies\nKing Forbes when you address me\n\n[Chorus 1 - Allen Iverson]\nAnybody tell you that i missed practice\nIf the coach said i miss practice, then y'all hear it then, that's that\nI mean I might miss one practice this year\nBut its its its its easy to, to talk about it\nIts easy to sum it up\nWe talking about practice man!\n\nVerse 2\nHow many ways to get this paper\nNo other breaks, No Vacations\nMy daughter's face is motivation\nDo you got what it takes to be a great one?\n(He.e)\nNo Pain, No Gain\nThis shit is 10% of Champagne\nBalmain, 90% heartbreak\nI don't play no games, This ain't no Arcade\nIt was dark days\nNow I'm busy living like Scarface\nNow I'm looking for a house with way more garage space\nAll i need is Beyonce, then I'm straight\nYou don't want to go against me\nCause my 16's will give you chesties\nLongevity, thats Classic\nSupa Megacy, Black Magic\n\n[Chorus 3 - Allen Iverson]\nOut of all practices this year? that's enough\nI mean how silly is that? man we talking bout practice!\nIf I can't practice, i can't practice man!\nI'm hurt!  I'm hurt, simple as that\nNot the game that I, I go out there and die for\nIt's not the game!\nWe talkin' bout practice man!\n\nVerse 3\n\nEverything I ever did I had to win\nWorking on my tactics I was shooting in the gym\nI'm just trying to elevate the stature\nAlways seen the bigger picture on the plasma\nOpen up the safe!\nI'm running out of space like NASA\nSame thing with my trophy cabinet\nCaptain, my captain take us international\nLead us to a Championship you a natural!\nTop boyz Sound, watch out.....\nTop 2, not 2\nIt's time to tango, Boss moves\nI break rules and break ankles\nCan't lose, I drop jewels at tight angles\nHuh!!\nI was made for this shit, Can you believe I get paid for this shit?\nI might just need a parade for this shit!\nIt's time to call it a day with this Shit!", "year": "2018-05-30", "album": null, "image": "https://images.genius.com/6020e462d3c1eb4d567e51959bf8a5dc.375x375x1.jpg"}], "artist": "AKA"}