{"songs": [{"image": "https://images.genius.com/cc60009fe3a8e9f4e0bf0ecb050bb51a.1000x1000x1.jpg", "title": "Rhinoceratops Vs. Superpuma", "album": "Strawberries and Cream", "year": "2013-01-01", "lyrics": "[Intro]\nOh hey, did I ever tell you about the time\nThat Ninja Brian and I saved the world from super monsters?\nYeah, that's a thing that happened\nSo please, pay attention\nI'm talking to you, Doug. Jesus\n\n[Verse 1]\nIt's the middle of the day but darkness falls on the city\nIt's the shadow of a giant cybernetic death kitty\nAnd on the other side of town something rages down the path\nIf you had a lisp you'd know it's kickin' theriouth ath\nMortal enemies since the early days of yore\nWe're just collateral damage in their giant-ass war\nThey rumble, battle, tussle, and then do a cocky strut\nThey both know they're kicking Earth right in its planetary nuts\n\nNot a single human being can survive in the vicinity\nIt's kinda like Godzilla squared but also times infinity\nMe and Ninja Brian were just chillin' at our place\nWhen we got a frantic call from the President of Space\nSaying, \"You're the only hope to save billions of lives\"\nI said, \"I'm making baked potatoes and I'm about to add the chives\nWe can be there in an hour if we really, really try.\"\nBut we didn't, so they ate France, sorry if you died\n\n[Chorus]\nRhinoceratops versus Superpuma\nGiants from the sky with no sense of humor\nEveryone's in danger from their massive-ass brawl\nOne shat on Minneapolis, the other St. Paul\nRhinoceratops versus Superpuma\nI am pretty sure that they pissed on Cuba\nI would be lucky if we live to see dawn\nThey killed a million people and they just stepped on my lawn\n\nFuck! I just had that re-sodded\nThat's gonna be like twenty-five dollars, at least\nDamn it\n\n[Verse 2]\nA couple hours later NSP hit the scene\nYou know we could have been there sooner but we stopped for ice cream\n\"Where have you been?\" screamed the president, \"We're all under attack!\"\n\"I had a craving for pistachio, get off my fucking back!\"\nBrian busted out a keyboard and I grabbed my blue bass\nSome guy said \"What are you doing?\" so we punched him in the face\nSuperpuma was a girl, Rhinoceratops a dude\nWe knew that all we had to do was get them in the booty mood\n\nWe rocked so hard it put the monsters in a trance\nAnd they lept up on each other in a frenzy of romance\nI was immediately sorry that they weren't wearing pants\nNow I can't forget the sight of Superpuma getting lanced\nWhen the sex was over they took off into the sky\nAll the world screamed \"NSP you are super-awesome guys\"\nSo we finished off the night with an amazing rock show\nThen Brian stabbed a random guy while I got laid twice in a row\n\n[Chorus]\nRhinoceratops versus Superpuma\nLife on Earth survived, but it was kind of screwed up\nFinally we’re safe, stupid Doug shouts \"Hooray!\"\nDoug you suck but that's a story for another day\nRhinoceratops versus Superpuma\nI think there's a lesson here that needs reviewal\nChoose sex over murder even if you're from the stars\nOr you might kill a planet and also scratch my car\n\nSon of a bitch!\nI'm gonna have to lightly buff that out\nAlso, that's definitely space rhino jizz on my porch"}], "artist": "Ninja Sex Party"}