{"artist": "Prodigy of Mobb Deep", "songs": [{"album": null, "title": "Ok Dunn", "image": "https://images.genius.com/459c7b64c165fbc76e02360f338fe60b.600x600x1.jpg", "lyrics": "Havoc:\nYeah, check it out like this you heard?\n\nProdigy:\nWoo! Infamous records, yeah son...\n\nTesting one two, one two, that's what I'm talking about...\nMobb Deep, yeah... Clinton Sparks\n\nThis is H right here, got P by my side you heard?\nUh huh, let's do it like this check it out, get familiar\nClinton Sparks dunn, what up dunn? Get familiar...\n\n[Verse 1: Havoc]\nHav spit it, Hav live it, Hav pushing it to the limit\nYou a gimmick, get the shitted smacked out of you with linden\nI been it, scoop you off of your pivot, the four fittith, all get it\nWhen your monkey ass pass the line of scrimmage\nWe invent it for the palm and dead it until the ending\nI ain't running even if the illest repertoire is mentioned\nMy weapons aren't like yours, my handles don't wipe doors\nI coming through blocks nigga, section shit off\nThem streets and the gloves don't ever come off\nThe strong overcome the weak, accept the laws\nMami want a gangster, she be looking at a boss\nHomie front, there will be bodies, more\nThe stones on my cross, you gonna get it\nCatch you in the club slitted\nWhile you tricking, get up on them Jigga, your man's with me\nH A V O the new Mobb\nYour worst nightmare, trucks wrapped in camouflage, bitch\n\n[Hook x4]\n\"Mobb Deep, Mobb Deep\"\nYeah Ok Dunn, Ok Dunn, Ok Dunn\n\n[Verse 2: Prodigy]\nAyo word so many niggas got so much beef\nThat when you come out, you better ring the police\nBetter keep one in your head, and turn off the safeties\nLearn how to sleep light because we're waking\nAnd tape up your kids and your relatives\nGet on some ruthless shit, I need sedatives\nTo calm me down, wind me down\nImma find you even if it takes months on a stakeout\nWe hitting in the club, we out and about\nWe're bound to see you homie, walk with your gun out\nIndustry bitten, you're just like a chick\nWith her nose up, I squeeze on you and if you live dunn...\nIt's over... We're coming back for more of that bullets...\nThat murder, it'd be a wrap for your bitch ass\n\nInfamous records, Clinton Sparks, what up?", "year": null}]}