{"artist": "Asher Roth", "songs": [{"title": "Fuck Your Ringtone Dog", "image": "https://images.genius.com/9da820494f0481947a0c330df3cf71b1.320x320x1.jpg", "album": "Seared Foie Gras W/ Quince and Cranberry", "lyrics": "[Verse 1]\nAll this shit about titties just isn't enough\nI need to speak on something witty, or some shit with some substance\nI sit at home thinking 'bout how I would run things\nBut when it comes to rapping I just wanna give up\nI'm frustrated as fuck, I wanna make 'em go nuts\nI wanna say something silly, when I say it they bug\nThen rewinding back A Million ain't even enough\nThey need to listen while they pissing or they eating they lunch\nI've been eating a bunch, I've been eating at brunch\nFour Seasons with a Stephen telling me that I'm done\nCause I drink to much, and I smoke too much\nAnd only wrote one song in the last twelve months\nI'm like, \"What? You that shit ain't true.\"\nThen I use an excuse about my planets aren't aligned with my moon\nI just need a little time to rectify my mood\nHonestly it's the vibes from the side of the room\nWell, it's kind of the truth\nI try to be loose, let it ride when I slide in the booth\nBut it's all bullshit, they only need one song\nThat their boss calls a hit, cause the kids sing along (Tell me what you want)\nSo I'm with Q-Tip at the Vevo launch sayin' \"This is some shit, where did we go wrong?\"\nFuck your ringtone dog, put it on vibrate\nI was fine till your phone played Black Eyed Peas (I got a feelin')\nI was high off my in-store best by date\nI was fired from Best Buy 2-thou-8\nWhat's that say about me? I was sellin' CDs\nNow I'm sellin' CDs, I'm a stellar emcee\nI've developed a freak type fetish with a beat\nHistory rewriting whenever I speak\nWherever I be, I'm there with my team\nHBTV, Brain Bang, Hypebeast\nAnd we still down with sorority games\nNow a days it just seems my priorities changed\nLife's more to me man, more important than fame\nI can't afford being 40 and just pouring a drink\nTalking 'bout how I would've been, or should've been big\nNow I'm on the front porch and I'm smoking a cig\nTalking to a girl around the age of 18\nLike I was your age, I was living the dream\nI had seven girlfriends with Brazilian butts\nAnd a house, and a whip, and a million bucks\nBut now I'm a drunk, dumb looking for fun\nHow I wish I didn't love college so much (I love college)\nNow I wish I would've put knowledge above\nEverything else except God, shit, and love\nSo good thing I realized this before\nI'm a poor 24 with a date in court\nFor my third divorce and my child support\nThat's remained unpaid since I went on tour\nNow I'm sure all I need in this world is free\nExcept tickets to the Knicks and an eighth of weed", "year": null}]}