{"songs": [{"year": "2015-05-05", "album": null, "image": "https://images.genius.com/71841ad8f6248070b516ace6ef4db063.500x500x1.jpg", "title": "Dead Prez (Dead presidents rmx)", "lyrics": "[Verse 1: K.A.A.N]\nI swear to god every line that I spit\nReligious relic, overzealous from the flows that I flip\nI'm keeping it real\nI said in the moment I feel\nI'm giving you all of my pain\nI wanted a way to regain\nThe sanity everyone else had been taking in vain\nI feel like I'm losing my soul\nAchieving a goal\nThe way that I'm living is cold\nI murder my foes\nOr anyone that would oppose\nThe rhythm in which I compose\nAnd now I dispose of ignorant nonsense\nEvery day I was hearing the content\nWondering if you were given a conscience\nNever believed in the lyrics they conjure\nHow do I conquer?\nPutting my life on the page\nThat nigga was giving you honor\nPeople like Common, they only think about commas\nNobody cares for your problems\nPick a position to play, and practice your part\nThat feeling inside of your heart, you never ignore\nWe taking [?] to explore\nAttentive when asking for more\nAnd for the most part, I'm Mozart, Belafonte and Bogart\nImposing, giving you classical\nI'm masterful and magical\nThe depths of my emotion is devotion\nWhat am I really divulging?\nGiving into my impulses\nWhat about focus, nigga they already know this\nAs I eliminate simple acts of intelligence\nTalking televangelist, my hands upon the bible ah!\nI open the book and I look at the chapter\nI'm a legitimate bastard\nCausing disaster, leaving that lyrical madness\nStaying away from distractions, never attracting\nThat was an overreaction, digging inside of my faction ah!\nPraying to Jehovah, asking him to grant me inner peace and bless me with some happiness before I'm finally deceased\nMy soul was sanctified by the soothing sound of the symphony\n\n[Verse 2: Norman Dean]\nI'm out for presidents to represent me\nAll they care about is dead, [?], I'm a titan, nigga\nHit 'em with this light gun, I enlighten niggas\nYou ain't gonna light none, you ain't sparking a thang\nYou a little light, son, always guarding your chain\nSince my Gram left, I ain't been right son\nIn the dark, just waiting until the light come\nAnd I'm just contemplating all the things I've done in my days\nI'm obsessed with getting paid in a couple of ways\nThis year, I done doubled my days to keep the work up\nWe pushing through the struggle and pain, sometimes it hurt us\nBut people dying daily, how the fuck I'm 'posed to feel?\nI've been ducking from these labels while they tryna close the deal\nI ain't finna sell my soul, not for none of these devils\nThey be biting off my style, here's a wannabe medal\nAnd my girl always saying she gon' love me forever\nI done made a few mistakes but I wanna be better\nAin't nobody ever say that I was perfect\nBut stick around, I promise I'll make it worth it\nI give you everything I am in these verses\nIt's my purpose, I knew it before my first kiss\nLiving in a time where you gotta be afraid of the cops\n'Cause your skin color black, they gon' laser your top\nEvery day the headlines show another nigga blazed\nTryna give us [?] or they want us in the grave\nI'm already dead\nI'm already dead\nTo represent me\nI'm out for presidents to represent me\nI'm out for presidents to represent me\nI'm out for dead fucking presidents to represent me"}], "artist": "K.A.A.N."}