{"artist": "Big Daddy Kane", "songs": [{"lyrics": "Uhh! Put your weight on it\nUhh, and uh, Prince Paul, bring me on and uh\nAiyyo Botch, bring me on and uh\nMad Money Murph just bring me on and uh\nJust bring me on, yo\n\nThis is a world premier and I'm here\nA presentation beyond compare\nSo MC's step to the rear as I break through\nGirls say ooh and then skip to my loo\nThat means dance as I get smooth with\nPoetic perfection that you can groove with\nJust like a passenger, hurry and fasten your seatbelt\nCause I'm about to start broadcastin\nThe words of wisdom, so turn up the system\nLoud and clear, I don't want no one to miss one\nWord to be heard never blurred or slurred\nThe preferred is absurd, all the damage that's occured\nAs I break MC's like a lumberjack\nAin't no comin back, you can't get none of that\nI'm not the type of MC to be merciful\nSo if your name ain't Jermaine take it personal\nCause like a vigilante I'm gonna kill off any\nSucker MC that tries to withstand me\nWith the mic in my hand I start flowin then\nAll competition flee and start goin in\nThe other direction, run for protection\nCause I can burn an MC like an erection\nYou're too small kid, don't get involved with\nThe verbal law for the Nation of Islam\nWisdom I speak makes your head nod\nShowin I got the power, and that's from bein born the God\nBut many doubt my Knowledge of Self\nBut they're just illiterate, so I don't consider it\nFeedin off poison that's pollutin their mind\nAnd that's the reason I don't swine\nI gotta maintain, accelerate my brain\nAnd god damn, it's hard being the Kane\n\nGive it to me! C'mon!\nC'mon! Uhh!\nGive it to me! Give it here!\nGive it to me! Yeah..\n\nThis is the proper way man should use ink\nBut you're at your brink and your rhymes are extinct\nJust like a dinosaur, but you never find a more\nCause mine'll keep sellin on wax like some kind of whore\nLet me inject this, flow of electric currency\nFor all the party people preferrin me\nAnd spectatin like a tourist, cause you never\nSaw this style of rap kickin like Chuck Norris\nBut this ain't Kung-Fu, no I just brung you\nA style, that phony MC's were too young to\nDigest, when I manifest, you adolescent\nSo sit back, relax, be glad you had a lesson\nAnd this one's for your listenin pleasure\nSomethin for all the bitin MC's to treasure\nJust like a diary, for you to admire me\nBefore you're put in the Dead Poet's Society\nCool as a draft, droppin math in a paragraph\nI laugh as the wrath break in half, your whole staff\nBut many MC's were able to retreat\nRunnin like an athlete, but I got bad feet\nSo I don't chase ya, nor do I wait to face ya\nNah it ain't in my nature\nI just rip shop, flip-top, and watch MC's get dropped\nAs I manifest in hip-hop\nRhymes I construct are tough like a Tonka truck\nAnd just like lightnin they struck\nDown on all the toy MC's that annoy\nThat's how I build and destroy\nThe poetic printer, rough rhyme inventor\nWith a groove so smooth you can't help but get into\nSo I'm advisin competition to flee\nCause I can bake an MC like Chef Boyardee\nHoldin my own on the microphone\nCause I break bones just like sticks and stones\nSo let it rain let it rain as I put em in pain\nGod damn, it's hard bein the Kane!\n\nGive it to me! Get up!\nCome on! Uhh!\nGive it to me! Come on!\nGive it to me! Yeahhh\n\nPut in a pause, because here's the holocaust\nAbove all laws, in effect and all yours\nCause I came to blaze a taste of bass of grace\nA replace, erase the waste without a trace\nMy vocabulary will just have you very\nDazed and amazed so I fear no adversary --\nThat means competition\nThey can't even touch this, even with ammunition\nBreak out the gauge and go into an outrage\nAnd I'mma still blow up the stage\nCause this is a death threat, but don't let your sweat get\nIn the way of your vision don't be missin when I get set\nTo go on a rampage, start a one man rage\nTotal destruction as I rip up the damn stage\nAnd leave it in ruins from the damage that I'm doin\nTo prepare the atmosphere, as I put you in\nThe mood for the Smooth Operator to start this flow\nAnd so..\nI crushed and crushed and stomped the comp that tried\nTo get fly and face the ace I put em in place\nProceed em, retreat em, defeat em, delete em, and feed em, and eat em\nAnd all the rest of that good stuff, cause I don't need em\nOnly one survivor can remain\nAnd god damn, it's got to be the Kane!\n\nGet up! Give it to me!\nGive it here! C'mon!\nC'mon! Give it to me!\nUhh! Put your weight on it", "image": "https://images.genius.com/7918e44d6acd48d11766ef89ec264228.400x399x1.jpg", "year": "1990-10-30", "title": "It’s Hard Being the Kane", "album": "Taste of Chocolate"}]}