{"artist": "50 Cent", "songs": [{"album": "50 Cent is the Future", "image": "https://images.genius.com/6bc22518471304f1684549742212664c.945x945x1.jpg", "title": "Bump Dat Street Mix", "lyrics": "[Tony Yayo]\nNew Shit\nTony Yayo, 50 Cent c'mon\n\n[HOOK: 50 Cent]\nBump Dat\nNiggas try to stunt on my click\nThen when I get on that shit\nI bring it to 'em where they pump at\n12 Gauge mashberg\nNo shell in the head\nBefore you put in work, you gotta pump that\nYou done hit a nigga with it and you runnin to polices\nCome and take my advice, nigga, dump that\nThis is serious, these rap niggas, I'm just havin fun with it\n50 Cent, nigga, Bump Dat\n\n[50 Cent]\nMy son ask \"Daddy why carry a gun, you ain't a cop\"\nLooked at him and said \"Sometimes you gotta shoot or get shot\"\nWanna go to show-and-tell and show the class my Glock?\nShow 'em the clip\nShow 'em the beam\nShow 'em how Daddy lean\nIn the convertible Jag\n22 inch mags\nFor a high school drop out, shit, that ain't bag\nI'm not a blood or a crip, I'm doing my own thang\nG-UNIT\nShit, I done started my own gang\nI don't go that funny dance\nI don't throw gang signs\nBut I'm a gangsta to the core so I stay with a nine\nThink all I do is rap, then you don't know me good\nHave Smurf hangin out the sun roof to light up your hood, man\nCarlito ain't never seen Blanco comin'\nBut if he did .. you think he woulda started runnin?\nAnd I move with the Doublemint Twins and two macs\nAnd leave you flat your back\nBRRAT\nTake that\n\n[HOOK]\n\n[Tony Yayo]\nI gotta half a mil deal with no diploma\nIce so blind it give your ass glaucoma\nIts hard to live, but its easy to die\nSo I'm going through life lookin death in the eye\nThese rappers ain't gun slingers\nThey R&B singers\nG-Unit, come thru with some guerilla niggas\nMinimum wage ain't gonna pay the rent\nCause the seats in the coupe got the Fendi print\nAnd this shit right here for the listeners pleasure\nI'm still on the strip with the fifth and my ever\nIts T-O-N-Y\nStay with a semi\nMilk your crack spot - till the shit be bone dry\nYou think you pump hard? Nigga I pump harder\nMy phone ring so much, I walk around with the charger\nWhen the D's come around, I'mma swallow my crack\nShit the work out later, and hit 'em with that\nIf it's a direct sale\nI'mma change the bill\nTryin to push the new Range cause they changed the grille\nLook nigga we icey thugs\nWe stay with them things so we stay with some Nike gloves\n\n[HOOK]\n\n[Tony Yayo]\nJust havin fun with this rap shit, man\nIt never stops\nMy man 50 done put out, what, three albums on the street?\nAnd y'all ain't even hear the new shit\nJust keep goin' and goin' and goin'\nMotherfuckin' Duracell Battery\nIt never stops\nWord up\nG-Unit\nSha Money XL", "year": null}]}