{"songs": [{"title": "Daily Duppy", "lyrics": "[Verse]\nDrill on a grime beat, grime on a drill beat\nNigga, don't copy my pattern\nBulldoze, man ah get flattened, everything patterned\nChing chow shine like Hatton\nNah, I don't box like Floyd\nNah, I weren't gonna say Hatton\nEverybody thinks that they're bad till they're doing up sprints\nTryna run Usain for the cannon\nAnd look, I ain't Kodak\nBut I got a couple dreads from the throwback\nThat'll run up with a rocket and blow that\nWord to Giggs, you'll get banged from the blow back\nLook, I come through with an O pack\nNiggas saying \"AJ's cold, did you know that?\"\nPeng brown ting just stepped in the room\nAnd she gave man neck till my eyes start roll back\nI said \"hold that\"\nThen I'm off on a jog down the road, akh\nTalking 'bout Grove and Goldborne Road, akh\nTalking 'bout Suttons and Latimer Road, akh\nUsed to throw snow with the cats from the snow plaque\nNow I do shows\nMan just re-up on the bars, let 'em go\nGot a whole box for the low, ayy\nGot a whole box for the low, ayy\nPosted 0 for 1 sec then done\nCranked for days, I ain't seen that sun\nPut a hand on bro? Then God bless your mum\nCause I swear to God she won't see her son\nSkrt the car on main road, best done\nIf I sku-du-du-du-du-du, man's done\nAsk for beef and man might get bun\nCan't squash the beef, that's not how this tun\nAnd now 10's on the map\nI used to have both in the trap\nTommy and James on my lap\nMoney is power like the program\nSo I had to ghost that pack\nI was out there doing loads\nI was doing loads for the cash, ayy\nI was doing loads for the cash\nI don't follow back chicks, I'm a leader\nAJ from the Lane's never been a follower\nYoung Tekky and I'm in the field like Onomah\nAnd I'm gonna break through the scene like Oduwa\nPeng tings I don't wanna save like Hugo\nI'm pouring out champs in Nouvo\nI could spit bars 'bout something I don't do\nBut that's your style there and I sure ain't you though\nI'm me, though\nHolding it down like Dier or Moussa\nStrong like a kilo\nI was getting love like way before Bebo\nAnd I'm not a normal dude, just like Reeko\nLike Posty, in grime, I'm the boss\nI'mma cop mum a house, give a fuck what it costs\nIf you ain't chatting bout Ps, you're lost\nYou don't speak my language, something like Poch\nI'm something like, I'm something like Christian\nI used to finesse the balls like all day\nCall for a ball? Then trust, you're gon' pay\nGive him 1.2s, the fuck a man say\n0.6, the fuck a man say\nNow I'm doing shows, the fuck a man's paid\nIf I catch you on the pave and you're chatting 'bout me\nWe'll spray, no le, I'll fuck with man's day\nI'm on the field, no bally\nShower, malé, drugs, Alli\nBut now it's mics, not drugs I carry\nNo Vorm ting, bad vibes? I'll parry\nAJ never can took for a Barry\nOr Phil Jones, man are upfront like Harry\nMake a young gun come with a one furnace\nThen put a strap across your chest like a Spurs kit\nYeah, I got more money cause I earned it\nHard work, fam, nah I never shot Bale\nMan sent war dubs, man have got mail\nAnd them old bruddas on his side till he got stale\nMan's gonna see deep blue like a whale\nWith my 32, lick off your headback well\n16 lick off your headback clean\nA’s young in the scene like a Balerin\nOops, fam, I meant like I'm Bellerín\nLike Rashford, man are young but I get it in\nSeeing money that you made, there's no better thing\nGrind fast, but you niggas slow like you're ketamine\nYou niggas slow, can't keep up\nLetting in goals, no keeper\nOut here tryna stack coins, FIFA\nMy bruddas hit the strap ras like it's reefer\nI'll turn man pack for the back chat, normal\nNike Air Ones on a date or a meeting\nBlack Air Ones for the beef, that's formal\nNike Air Ones when the thing ain't-\n\n[Outro]\nGet me?\nDaily Duppy\nAJ from the Lane, get me?", "year": "2016-12-08", "album": null, "image": "https://images.genius.com/3b0091f928fe4cb6e5a8828056956a98.320x180x1.jpg"}], "artist": "AJ Tracey"}