{"artist": "Ice Cube", "songs": [{"title": "Can You Bounce", "lyrics": "[Intro]\nBounce it bounce it, shake it shake it\nWiggle wiggle, Make it jiggle, just a little\n\n[Chorus]\nBaby baby can you bouce to this (bounce)\nFuck around and smoke an ounce to this (bounce)\nTurn it up, we can clown to this\nThrow your hands in the air if you down with this\n\n[Verse 1]\nI hear you bragin 'bout the money you foldin'\nSame nigga that be kissin' my colon\nWhen you picture me rollin'\nNigga picture me holdin', pure heat like Nolan\nThey call me Papa Doctor\nSee your bitch and i knock her\nI collect them like Pokémon\nFrom Nokishan, accept the ones with no behind\nYou can keep 'em, keep 'em from creepin' where I'm sleepin'\nSame bitch and same club every weekend\nSame drink, same dress, brainless\nWhat would you do if i handed you a stainless\nCan't fuck with a girl that's gameless\nWould you tell the po-po's what my name is\n\n[Chorus]\nBaby baby can you bouce to this (baby bounce)\nFuck around and smoke an ounce to this (smoke an ounce)\nTurn it up, we can clown to this\nThrow your hands in the air if you down with this (yeah yeah)\nBounce it bounce it, shake it shake it\nWiggle wiggle, Make it jiggle, just a little\nBounce it bounce it, shake it shake it\nWiggle wiggle, Make it jiggle, just a little\n\n[Verse 2]\nDon't stop get it get it\nI'm not the kind to get jiggy with it\nI'm the kind to get niggy with it\nI'm a show you what it's all about, trick!\nShake yo' ass till your curls fall out, bitch!\nDon't pretend you can live without, dick!\nCome with me ain't no doubt that i'm, rich!\nWhatchoo goan do in the early 'morn\nWhen the lights come on, and your drink is gone\nDo you think you grown\nThink we convone (?)\nIt's a party at my house i got drinks at home\nGet to undressin', pull out the lethal weapon\nLook you in the eye and i aks you one question\n\n[Chorus]\nBaby baby can you bouce to this (bounce)\nFuck around and smoke an ounce to this (what choo smokin' on?)\nTurn it up, we can clown to this\nThrow your hands in the air if you down with this\nOunce it bounce it, shake it shake it\nWiggle wiggle, Make it jiggle, just a little\nOunce it bounce it, shake it shake it\nWiggle wiggle, Make it jiggle, just a little\n\n[Bridge: Jay Z]\nBounce, bitch, bounce wit me wit me...can ya\nBounce, bitch, bounce wit me wit me...can ya\n\n[Verse 3]\nWho that nigga that be in the club every week\nWho that cheep mutherfucker won't buy you a drink\nWho that bitch dressed like a freak but she won't speak\nWho that ho think she is, like her shit don't stink\nWho that player on the floor, sweatin' in all silk\nWho that girl showin' tits, like she got milk\nWho that hater in the corner, always on tilt\nWho that fool in the parking lot about to get killed (yeah)\n\n[Chorus]\nBaby baby can you bouce to this (can you bounce)\nFuck around and smoke an ounce to this (blaze one)\nTurn it up, we can clown to this\nThrow your hands in the air if you down with this\n(if you down with this)\nBaby baby can you bouce to this (huh)\nFuck around and smoke an ounce to this (dogg best C.G.(?))\nTurn it up, we can clown to this\nThrow your hands in the air if you down with this\nBounce it bounce it, shake it shake it\nWiggle wiggle, Make it jiggle, just a little\nBounce it bounce it, shake it shake it\nWiggle wiggle, Make it jiggle, just a little\nYeah, Ice Cube (bounce it, bounce it...)\n\n[Outro: Jay Z]\nBounce, bitch, bounce wit me wit me...can ya\nBounce, bitch, bounce wit me wit me...can ya", "image": "https://images.genius.com/b41b30150e61b258f8624ead118328fe.1000x1000x1.jpg", "album": "War & Peace Vol. 2 (The Peace Disc)", "year": "2000-03-02"}]}