{"songs": [{"title": "I Want it All", "album": "Heist of the Century", "year": null, "image": "https://images.genius.com/29aed50e708381cab4e55222550f38fa.962x925x1.jpg", "lyrics": "[Intro]\nYeah, yeah, unh, word up\nTo my man Ced Demon, King Gunner, Slow Joe\nWord up, men at Montana, lock down, you know?\nTarif, word bond, uh, yo\n\n[Verse 1]\nYo, it's Born God, I survive, Park shit is still real\nYou know sex, money, drugs, death, the whole ordeal\nMurderers to kill, Henny demon and ill\nJump in my rocket to the moon, spark an L and just chill\nI got to own stocks and bonds, kid, just because I want them\nAnd million dollar businesses with Darkman written on em\nNot up front but an economical stunt\nI want it all, I hope I didn't put that too blunt\nEducate, moving on up like the Jeffersons\nCop a Lex, a Jag, a Land Cruiser and a Benz\nAnd a mafia of friends to dispose my foes\nStand over my shoulder while I head crack a C-lo\nTaking care of my peeps cause I know how it be\nMad court cases and white papers, that's all we see\nFrom the roll of poverty but I always got mine\nSmuggle from Now Y to M.I. on the mainline\nNow I'm in cash field still pursuing my path\nSever the mic in half to unleash my wrath\nI want an abundance of girls to escape the world\nThrow a party on solo, me and seventeen pearls\nPuffing on mad lah, dunn, without a regard\nI need thirty-three acres of ganja growing in my backyard\nFour courts in the front and bathrooms as big as kitchens\nTwo thousands gallon aquarium to sink my sharks in\nAll for one on estate, my whole crew living great\nEnter the gate unannounced and you will meet your fate\nI'm up Carlito's Way, rolling with the real\nProtected to infinity in a security shield\n\n[Chorus x2]\nI want it all, Lex and Tecs and shit\nI want it all, a fly wiz and crazy kids\nI want it all, Pelle Pelle's and diamond jewels\nI want it all, and my four-pound to buck them fools, aight?\n\n[Verse 2]\nI've been hungry since a youth, product of the Bronx\nP.J.'s and killer ways, ain't a damn thing changed\nI got to snatch mine, did it for the whole world and\nEases to Jesus to drink on Chesterfield cuban links\nStinging stones on the medallion, I escaped the Island\nDon't give a fuck about you, I'm from the Shaolin Asylum\nWhich way you want it, I need condo's and hoes\nCess, best guests, vortex and black timbo's\nEight-fifty B.M., a lighting system that's dimmed\nYoung Deniro damager, sitting above the rim\nLa The Dark', my hustling goal is to live great\nCause I'm a New York nigga catching money out of state\n\n[Chorus x2]\nI want it all, Lex and Tecs and shit\nI want it all, a fly wiz and crazy kids\nI want it all, Pelle Pelle's and diamond jewels\nI want it all, and my four-pound to buck them fools, aight?\n\n[Outro]\nWord, Born God year, you know?\nIt's La The Darkman right here\nWord up, marvelous, I keep it spicy, kid\nKnow what I'm saying? For my mad av. cats\nYou know? B.D.F.B., you know?\nWord up, murderous\n\n[Movie sample]\nI couldn’t have done things differently. But he was wrong. Things can always be done differently, only he was in a hurry. He didn’t want to wait, he wanted it all, and he wanted it now. But he’d forgotten that God doesn’t work that way, His clock isn’t set like ours is. When the pay off comes, He takes lives, He cuts deep, He decides"}], "artist": "La The Darkman"}