{"artist": "B-Real", "songs": [{"album": "Smoke N Mirrors", "title": "Fire", "lyrics": "[Intro: Damian Marley]\nYahhhhhhh~! Junior Gong and B-Real\nPepper, pepper, pepper!\nA wot dem feel like?\nCome down!\n\n[B-Real]\nStraight up we set the fire we blaze 'em and do it properly\nSonically all we need is the honest and the Cali weed\nRoll up the sensei when you want to break up insanity\nHit it and pass it and we blazin all of humanity\n(BLAZE IT UP!) Then we never care about what you say to us\n(BLAZE IT UP!) Everywhere we go we takin the spray with us\n(BLAZE IT UP!) All the mamis in the club wanna blaze with us\n(BLAZE IT UP!) All you fuckin haters remain hatin us\nWe grow the crystal freely, from dirt up to the ceiling\nI know you want the feeling, you need some herbal healing\nWe flip it in the Valley, out here in Southern Cali\nI know you fuckers envy, B-Real and Mr. Marley\n\n[Hook 2X: Damian Marley]\n(Fire fire fire fire fi-yah)\n(Fire fire fire fire fi-yah)\nAnalog or digital it's spiritual and physical\nIn literal or literally industry down here in Cali\n\n[Change last line first Chorus: \"In literal or literally... Cali da cavalry\"\n\n[Damian Marley]\nSome likkle wannabe wanna come walkin on mi Wallabee\nWanna follow me, but that fruit-tooty-to he got wobbly\nDashin and flashin lyrics who dat leave dat mean a tragedy\nTo Don Fox Reilly 'e dance wily come to us naturally\n(BLAZE IT UP!) Any time, any place and no a politic\n(BLAZE IT UP!) An' next soundbwoy nah near become reality\n(BLAZE IT UP!) Squeeze up to all da in US technology\n(BLAZE IT UP!) Puff puff up move de fuck up off me now casually\nCome de originally, Mr. De Reality\nI'm takin trips to Cali, more now that thick thick Cali\nJust a specifically, get a good spliff of Cali\nI keep it, you keep it, we keep it BLAZIN!!!\n\n[Hook]\n\n[B-Real] *\nTe quemo con el fuego mira mami esto no es un juego\nVen aca por que me gusta lo que estas haciendo\nUna toca y seguro que mi mota es duro\nY te lo juro yo que sub cuando hueles el humo, VAMOS!\n(BLAZE IT UP!) In the club or on the corner don't play with us\n(BLAZE IT UP!) In the limo shut the window and break it up\n(BLAZE IT UP!) If you try to take it from me it's dangerous\n(BLAZE IT UP!) In Jamaica no mistakin the ganja bus\nBelieve the kush is sticky, and all the fiends are tricky\nThe pigs be comin quickly; they can come and get me\nWatch me smoke out the city, let's see who's comin with me\nThe bong'll make you dizzy, it's Gong and Mr. Brizzy\n[Hook]\n\n[Repeat 4X]\nFire fire fire fire fi-yah\n\n* any help on the Spanish appreciated", "image": "https://images.genius.com/a84f5f2a93fac34de0ebb0407f26b392.600x600x1.jpg", "year": null}]}