{"artist": "Papoose", "songs": [{"album": null, "title": "Black Girl Lost", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "Hello?\n\nWhats up girl\n\nAin't nothing, this nigga in here stressing\nTalking that old off the wall back to Africa shit again\n\nWhat, that God Body shit?\n\nYeah, that dumb shit\nI'm trying to get up outta here!\n\nI hear that, but yo, you know the spot is pumping tonight\n\nWord for real where?\n\nYou know, where the real niggas is popping the Cristal\nNot that white stuff!\n\nHa ha! Word where the real niggas at?\n\n[JoJo Hailey]\nListen, to reason\nPretty baby baby listen\n\n[Nas]\nA young wild beautiful love child\nYou like them thug style link rocking, then mink copping\nHit you on the sink a hundred dollar drink popping\nThe head'll make you take him shopping, a foul doctrine\nReminiscent of my first time up in a chick\nYou was innocent, but now you rent-a-dick, wear the tightest shit\nChanel looking real, airbrushed nails\nHit the gym, hit the scales, heaven-sent but negligent (so fine)\nTo see a prophecy, your ebony tone is locking me\nThe way you moan make me daydream of you on top of me\nWishing I could be the one man; but you juggle\nWay too many Willies all in one hand\nYou want to run up in clubs, getting rubbed on\nNiggas pull your hair, shake your fat rear\nGet your fuck on, following week, you back there\nBut what you stuck on, weed, clowns and cars\nPuffin with some lil nigga, husband not knowing she's out\nCould you believe Eve, Mother Earth of the seas\nNiggas thirst you, you just let em hurt you and leave\nWhat up mah, fronting like you naive\nPusherman's whip, calling police when you flip\nCan't understand it, yo it should be a throne for us\nBut for now that's a whole different zone from us, word!\n\n[Chorus: JoJo Hailey]\nDiamonds all shining, looking all fine\nPretty little face, get a little high\nYoung girl struggling, trying to survive\nMother of the Earth, she made you and I\nJust tired of playing the same ol' games\nMessing with my mind, emotional things\nAnd there goes, a black girl, lost\n\n[Nas]\nLike Isis, she got you heartbroke and felt lifeless\nGrow up girl instead you want revenge so now you act the nicest\nTo who'sever getting down and trifless\nTo get his mind all you do is give him something priceless\nCause in time he'll realize the thighs is all he needs\nMore than weed, then you hit him off with lies and greed (deceit, yeah)\nThere you go again, starting wars, making me more yours\nSeem to get a kick out of keeping me on all fours\nFace glistening, I'm addicted to you\nOriginal, Wisdom Body got me picturing you\nIgloos of ice tricking on you, you never listen\nTo this nigga spending Franklins on tennis anklets\nMust've had a bad deal in the past though\nCan't even keep it real with a nigga with cash flow\nSay men are all the same, what we need to do is break this chain\nYou got a job part-time and school's your night thing\nWith dreams to settle down, it ain't far from now\nYou getting interviewed, but your boss is into getting screwed\nTypical day that the black girl sees\nComing home wanting more from a college degree\n\n[Chorus]\n[Nas]\nWhere are you focused, on legit niggas and where the coke is\nNice and Thug Life niggas, yo you seem hopeless\nYour value, too much to be measured, I wonder how you\nCould ever be played, your pussy worth gold amounting to\nMore than the world, but not knowing nothing about you\nYou leaving the crib, taking all your kids out to\nDrop them off, letting some nigga knock you off\nSo hot and soft, that's the same thing that got you lost (you should be ashamed)\nGrowing up seeing it, it should remind you, you being lied to\nEverything that move be inside you\nSacred as you are, left with these wannabes to guide you\nI watched you, hard to knock you, I tried not to\nThey spot you out dancing topless in your drawers\nDamn look, there goes a black girl lost\n\n[JoJo Hailey]\nYou should be ashamed of yourself\nThe way you carry yourself\nThe way you hang out all night long\nDoing silly things that is wrong\nBlack girl", "year": null}]}