{"artist": "Beanie Sigel", "songs": [{"lyrics": "(feat. Sparks)\n\n(Beanie:) Yeah Sparks in here, The Truth in here\n(Sparks:) Yeah\n(Beanie:) Yeah - Witness - Tales of a Hustler\n(Sparks:) Im going to ride nigga\n(Beanie:) Ya Know - This just the life we live uh, this just the life we lead\n(Sparks:) Yeah Yeah Gangsta\n(Beanie:) Tales tales\n(Sparks:) Gangsta! Yeah\n(Sparks:) Sugar coat\n\n(Sparks)\nOmillio Sparks the young gun\nMy life as an adolescent said I'll go through something\nOther guys try to stand in my way like brick walls\nSo I kept guns in my palm like Mesiah scripts in Psalms\nI should fear no man but God\nSo lord knows we could get it on\nGuns baptized guys testing my pride\nClearing my conscience in the liquor store\nWith a fifth of Thunderbird but I be guzzling hard\nPlaying the corners with a washed up old-head\nChant tunes by the Whispers\nSame corner where I banged at with niggas\nCops drive by and grin on us\nIf they grabbed then\nOne of them nosey neighbors done snitched on us (Again?)\nHey this game juicy got me puffing looseys\nEvery two days interigated by the police\nSee, this life I live cost more than your Roley's money\nIt cost my homie Nook his whole life, ya heard me?\nWhen he was here it was easy to love him like a brother\nNow thats he's gone I find it difficult to talk to his mother\nI mean - What do you say to a woman\nThat's just lost her only son to the game and the gun, except mami\n\"I'ma ride for him\"\nThe look that she gave me \"Like Sparks you got some nerve\nCause most of these niggas dont keep their words\nNow I'm under pressure\nAnd I can't even break that type of promise\nAnd y'all niggas paint that picture\nRisking your freedom\nOn the strength of memories of him\nThe time he made you laugh\nThe time he bust his gat when them other niggas ran\nHow real is that?\nOmillio Sparks niggas holla back\n\n(Beanie:) TALES - OF - A - HUSTLER\n\n(Chorus: Sparks - repeat 2X)\nIn this life you not promised tommorow\nSo take the bitter with the sweet and maintain\nIn these vicious streets\nCarry your heat and keep your mind on your money\nLife's a gamble everybody got a number homie\nTALES OF A HUSTLER\n\n(Beanie)\nI'm back to the block with it\nWait let me clear that up\nI'm back to the blocks that you get when your block get it\nGet hard with that hot water when the pot hit it\nGet large with a little water when you pop wip it\nI send hope to late scramblers\nSling coke to you late you scramblers\nGo broke sling soap to you late night scramblers\nNo joke, I'm a crook, catch hooks broke, late night gamblers\nLook - you loose limbs when fuck with him\nThat be I strapped and high\nFBI all on back want to trap the guy\nGot niggas in all black want to snatch my pies\nNever that too many gats\nToo many guns\nToo many vest\nTough guys not to many left\nWhere they at?\nDead or locked behind bars in jail\nI know I ain't too far from hell\nI'll spit the devil these bars in hell\nDog I been through it son\nLook at my scars and tell\nCatch Mac in a Chevy truck slightly tented\nNo excuses on who might be in it\nYou know passenger twisting backwoods\nSlightly spinning\nCrack the window the indo slightly scented\nSplash of haze and hash lightly blented\nPut the pressure on niggas who might be timid\nLike, you got like a minute\nTo put the cash in this bag or ya ass just might be in it\nIn small piece, I'll snatch your family up\nStart from tall nephews to your small nieces\nBitches\n\n(Chorus)", "image": "https://images.genius.com/ca482029f1aca4d2f2a6dec2d36da526.730x730x1.jpg", "year": null, "title": "Tales Of A Hustler (feat. Sparks)", "album": null}]}