{"artist": "3rd Bass", "songs": [{"lyrics": "[Intro]\nToday I'm prepared to bring specific charges\nAgainst certain members working in an industry\nThat reaches into every household in the country\n\n[Verse 1: Pete Nice]\nHoods is up so skills is up\nIt's a stick-up, so why'd you interrupt?\nSo such bust material cerebral\nI'm eatin' cereal with spoons, sippin' Cepacol\nDaddy-O slipped me some cause my breath stank\nWhite gold, but no accounts in Swiss banks\nThink tanks once rolled on the city streets\nI used to meet your moms between the sheets\nUniverse is versus hoods prospectus\nTrue flam, flammin' words on wax discus\nSo they dismiss this as vulgarity\nAnd once laughed and pointed at the university\nSome perk without skills and push a pen\nI send surreal scenes where you never been\nLooked out, gave you three strikes, you struck out\nPop shit with the 3rd, knock your fronts out\nBlew your blunts out you wings stuck up your ass\nGassed you up then slap you with my staff\nI seen your skins like to go to the motels\nBut your ass won't know to the hotels\nCause a lip is zipped, I paint pictures\nA portrait, a self far from tipsters\nMy discussion of impression ain't ignorance\nSo don't label the hoods on appearances\nYou never thought that a gangster could talk sense\nBut this artifice flipped, your beans is spent\nTook your papes out your pocket and just stood out\nThe focus, the portrait of the artist as a hoods-up\n\n[Verse 2: MC Serch]\nPortrait painted back in the days\nYoung strays, posted at the L.Q. on Fridays\nWaitin' for Dice to give the go ahead\nHawkin' 50 cent, puttin' heads to bed\nFor a herringbone hear the tone of the Audio Two\nMilk was chillin' as I chilled in the back room\nListening to Snaps pushed by Scoob and Scrap\nUnion Square, to tear up the KRS tracks\nTorn up by the Kent, the Clark Dark\nAs the brothers try to spark\nWe knocked boots, and the boots got knocked\nThree A.M. and it was off to The Rooftop\nHip-Hop Starski, the Masters of Ceremony\nKa-ka-cracked out, was hookin' property\nFive A.M. it was the S&S\nA hundred and forty-fifth street, down on Lennox\nStarchild made all the hoes squeal\nFor a dollar crackheads Armor-Alled your wheels\nWhippin' home in the sunshine, fun time\nBut now you can't find\nClubs like this that kept the music in the street\nAnd pop rap couldn't get a dime to eat\nYo, they're makin' mills, but what about the hood?\nA parking lot, where the Latin Quarter stood!\nA landmark marked in the cranium\nBut now I bring it back in front of packed stadiums\nPicture painted with the goals and the good\nThe portrait of an artist as a hood\n\n[Outro]\n[S] Yo Pete man, yo where the hoods at Pete?\n[P] Yo the hoods is in Brooklyn, Queens, Bronx\nMoney-makin Strong Island\n[S] Yo can't forget Newark New Jersey\nPhilly, D.C\n[P] From Detroit to Mobile Alabama\nMemphis Tennesse Cleveland\n[S] Yo, money-makin Miami, Chicago\nEast St. Louis got crazy hoods\n[P] Oakland Compton Watts wearin the hoods\n[S] Yo true indeed, Louisville\nBoostin Houston got CRAZY hoods\n[P] New Orleans, Seattle\n[S] North Carolina cannot forget about Atlanta\nShockmaster Glen Boyd got crazy hoods\nListenin to his program\n[P] And the hoods are holdin their joint\nAnd they're out\n[S] True indeed.. SEE-YA!", "image": "https://images.genius.com/ba67f25eba0c6951171aa44e82a3051a.600x600x1.jpg", "album": "Derelicts of Dialect", "title": "Portrait of the Artist as a Hood", "year": "1991-06-18"}]}