{"songs": [{"title": "I’m Right", "album": "Hump Days", "year": "2014-09-03", "image": "https://images.genius.com/75145c356837ef95317b2e1192749c65.1000x1000x1.jpg", "lyrics": "[Intro]\nWassup y'all?\nI realized I never kinda just like full on swagged on cats\nYou know what I mean? And I was thinking about that\nAnd like, damn D, why the fuck not? You know I mean?\nYour swag is a, is a real thing, I think\nAnd I've been looking at other rappers swag\nAnd being intimidated by it, but like why?\nI'm an impressive young man\n\n[Verse 1]\nI guess I could tell you I'm blowing up big\nAnd I'm 'bout to get money\nAlthough I ain't joking, America also agree that I'm funny\nThe rapping, you like it\nOh, this is some shit I picked up in my twenties\nI'm really a writer, you knew it, it's stupid\nI got an eight hundred, come fuck with that\nLil ho, come fuck with that\nHonestly I could have had whatever fucking job\nI wanted in the country\nBut I fuck with rap, real shit, bro, I fuck with rap\nAnd i don't mean it, like I fuck with that\nI mean it like I run amuck in that\nI talk about somebody cock and I buzz off that\nKnow I'm saying? I'm the man right now\nAct like ya man playing right now\nAct like I ain't get hundred granding in from the fans right now\nAct like I ain't planned that out\nAct like I'm not about to get them bitches from the mag\nPicture that right, cause I rap nice, I'm attractive to that type\nLiving that life and I'm naturally that likeable\nThat right dimple, not like the left, but it's barely worse\nBitches playing marry, fuck, kill, inevitably become Mz. Burd\nGo head and fuck them, I'm real and my jumper is ill\nY’all got swag, but I got reservations\nY'all just boys and I'm the voice of my generation\nLike I really belive that, like I think I'd get us\n\n[Hook]\nRun it back, homie talking shit, pipe down\nI don't care 'bout history, I'm the shit right now\nYou can tell me that I'm brash, but it's hardly a fight\nI've been tryna tell you hoes, I ain't cocky, I'm right\nSwagga on a hundred milligram, I can play the villain, fam\nPut your boy in any room, I swear to god he still the man\nLil homie, I am Obama\nYou the man among some bitches, bunch of lying Juwannas\nFlex, run it back, homie talking shit pipe down\nI don't care 'bout history, I'm the shit right now\nYou can tell me that I'm brash, but it's hardly a fight\nI've been tryna tell you hoes, I ain't cocky, I'm right\nI ain't cocky I'm right, I ain't cocky I'm right\nEverything I say I do and I ain't stopping tonight\nSwagga, swagga, swagga, swagaa\n\n[Bridge]\nThat's really fun to say like that, y'all should try it\nIf you ever get some free time, or on my level\n\n[Verse 2]\nI never done acting, but somehow, I still get auditions for movies\nThe last one I went after Bob Odenkirk\nAnd that's Saul if you clueless\nThe way they react to my rapping\nIt show me, it's bigger than music\nAt shows they be laughing, then dancing\nThey never seen anyone do this\nCome fuck with that\nLil ho, come fuck with that\nWas in the number one department in the country\nI was one up in my class, coulda run with that\nBiz week, coulda run with that, then Lil D had a run with ads\nLil D wrote a couple for the League, got them on TV\nThen was done with that, y’all high I'm matterhorn\nAnd no offense I matter more\nThe Rec League, like Steve, LD winning back to back\nWith scattered blacks, then smack y'all in scattegories\nYou in a trash, like category, I'm getting ass no statutory\nYou seeing red I'm matadoring\nYa rap is boring and wack deplorable\nLack the morals that make mine allegorical\nI'm the motherfucking man of my time right now\nGot ya whole team looking at the man, like damn\nThat's LeBron, that's Durant, that's Assange\nThat's your aunt, on my cock, say I can't\nEven parents fucking with me\nBro, I'm so comfy with myself, but here snuggle with me\nLike please, come here and snuggle\nSee what the fuck happen to you, you gon' like it, I'm real warm\nI shift my weight, so your legs won't fall asleep\n\n[Hook]\nRun it back, homie talking shit, pipe down\nI don't care 'bout history, I'm the shit right now\nYou can tell me that I'm brash, but it's hardly a fight\nI've been tryna tell you hoes, I ain't cocky, I'm right\nSwagga on a hundred milligram, I can play the villain, fam\nPut your boy in any room, I swear to god he still the man\nLil homie, I am Obama\nYou the man among some bitches, bunch of lying Juwannas\nFlex, run it back, homie talking shit pipe down\nI don't care 'bout history, I'm the shit right now\nYou can tell me that I'm brash, but it's hardly a fight\nI've been tryna tell you hoes, I ain't cocky, I'm right\nI ain't cocky I'm right, I ain't cocky I'm right\nEverything I say I do and I ain't stopping tonight\nSwagga, swagga, swagga, swagaa\n\n[Outro]\nI didn't even mention how nice I was at tennis neither\nSo, don't forget about that"}], "artist": "Lil Dicky"}