{"songs": [{"image": "https://images.genius.com/8acc2c921ff6defb4a5463597263ff0e.750x750x1.png", "title": "Girl Drop That", "album": null, "year": null, "lyrics": "Girl drop that (drop that), girl drop that (drop that)\nGirl drop that (drop that), girl drop that (drop that)\nGirl drop that (drop that), girl drop that (drop that)\nGirl drop that (drop that), girl drop that (drop that)\nUp in your curch, love that you bring\nWay that you move, you overdue for a raise\nGet it, I get it, I ain't takin no breaks\nHustle, I do it, girl I been up for some days\nDrink like a phony, smoke like a kitsch\nMoney on top, I do this shit for commission\nIf I break the room, eatin em outta\nBefore the line over I'm elevatin the ladder\nYou see your red bottom's hot\nYou know right away\nYea you know how to get it\nLet me see if you know how to shake\nSee that money's ignited, so come on get on it\nOnly way you can get it is to see where it's going...\nOne more kill I'll see\nI'm swopping out, taken off\nOne more kill I'll see\nWe own the night, we coming off\nWe up on the couches yelling out\nAye! Aye! Aye! Aye!\nAll on the tables yelling out\nAye! Aye! Aye! Aye!\nUp on the bar they yelling out aye\nDon't turn it down, I'm turned up\nThat kush loud, that where we burning love\nNo clubs mama, bottles to the head\nYou can drown me if you want and get a bottle to his head\nI do it, I do it, I get it if I want it\nThe way shorty movin, go ahead and bag it up on me\nYea her body's official, keep keep do what you doin\nAnd you and your girlfriend are open, both of ya'll come get to it\nAnd ya'll gon drop that booty (aye aye baby go)\nDrop it for real, drop it however you feel (come on)\nGon drop that booty (aye aye baby go)\nDrop it for real, drop it however you feel (come on)\nOne more kill I'll see\nI'm swopping out, taken off\nOne more kill I'll see\nWe own the night, we coming off\nWe up on the couches yelling out\nAye! Aye! Aye! Aye!\nAll on the tables yelling out\nAye! Aye! Aye! Aye!\nUp on the bar they yelling out aye"}], "artist": "Nelly"}