{"artist": "AZ", "songs": [{"title": "Drink Champs Intro", "image": "https://images.genius.com/60597dc54732883eddf3a1d983f07168.750x750x1.jpg", "album": "Legacy (Mixtape)", "lyrics": "\"... Back there with a 40 lookin' like a sucker!\"\n\"Fuck you!\"\n*laughter*\n\"Why you get up in there boy?\"\n\"Why you didn't get the money?\"\n\"Ay ay check this out, check this out\"\n\n[Sample: Drink Champs Steve Stout Interview]\nN.O.R.E: \"So um, ok now\nWhy isn't AZ, why didn't AZ, like be, just as big of a star-\"\nSteve Stout: \"Oh shit, yo I just had this conversation with son..\"\nN.O.R.E.: \"Why? Why?!..\"\nSteve Stout: \"About AZ. AZ, honestly..\"\n\n*vinyl record needle scratching*\n\n\"Hi. I'm Randy Wooden, and welcome to another Inner Edge Library series. Encouraging you to think, before you speak.\"\n\n[Sample: Drink Champs Steve Stout Interview]\nSteve Stout: \"People forget, even after the rhyme, on, uhm, Life's a Bitch-\"\n\n[AZ: acapella Life's a Bitch verse]\nVisualizin' the realism of life in actuality\nFuck who's the baddest, a person's status depends on salary\nAnd my mentality is, money-orientated\nI'm destined to live the dream for all my peeps who never made it\n‘Cause yeah-\n\n[Sample: Drink Champs Steve Stout Interview]\nSteve Stout: \"People thought his pen just fell off after that\"\nN.O.R.E: \"Right\"\nSteve Stout: \"More Money Mo Murda his rhymes is also hot\nN.O.R.E: \"Right, right\"\nSteve Stout: \"And uhm.. He just wasn't... He didn't have enough talent-\"\n\n[Sample: Russell Westbrook Interview]\n\"What? Bro what are you talkin' about, man?\"\n\n[Sample: Drink Champs Steve Stout Interview]\nSteve Stout: \"For the- for what was comin' out at that time\nN.O.R.E: \"Mmm\"\nSteve Stout: \"It was- it was vicious\"\nN.O.R.E: \"Nah, you sure?\"\nSteve Stout: \"The amount of rappers that was-\"\nN.O.R.E: \"I think he had the talent-\"\nSteve Stout: \"No he didn't have the talent-\"\n???: \"What are you- what what skill do you think he lacked, dude?\"\nSteve Stout: \"No, he had the work ethic\"\nN.O.R.E: \"Mmm\"\nSteve Stout: \"And he had the, uhh.. he he- he was a polished person. Show up, deliver, he could act. He'll play it all out\nHe was that type of guy\nBut if, when he went to write the rhymes and do it over and over-\nHe didn't give a shit about that\nHe showed up when Nas was on the record, but outside of that he wouldn't write- he wouldn't do it\"\n???: \"Yeah\"\nSteve Stout: \"Listen to his music!\"\n\n[AZ]\nAyo ayo what's up? Let's keep it real son!", "year": "2019-01-29"}]}