{"artist": "Yukmouth", "songs": [{"album": "United Ghettos of America", "image": "https://images.genius.com/a4ae2aabb3f4db3a65c0959f297b0ca5.500x500x1.jpg", "year": null, "lyrics": "[Yukmouth: one long verse]\nYeah, yeah, yeah, yeah\nOctober 18th '74, the year I was born\nA young nigga, ready for war\nIt's in my blood to get the 'fetty for sure\nI was cursed since birth to get the patties slanging faggats are raw\nAnd I'm the advocate, crackhead, in '86 we started having shit\nRock it and cook it to cut the baggin' is, slang packages\nFor my cousin, making twenty off a note\nBut I refused to go broke; my whole family slang dope\nAnd my big sister was a little richer cuz she always fucked around with the big pushers\nI watched niggas break keys in the sinks with jackhammers and Ginsu's\nThrow me money for tennis shoes\nI been the dude since high school with latest clothes and them jewels\nHad me paper chasing, I didn't finish school\nI bought a quarter ounce in the ooze\nGot a crew, hit the block, start hustling like the real niggas do\nI'm walking in the shoes of Phoenix Mitchell\nAnd Little D, I'm balling niggas from my projects I listened to\nI keep it real with my interviews\nI was broke as fuck and sleeping on the floor in the village dude\nI'm just a YG, why chronic D, smoking finer weed\nThick as quarter peak I build a dynasty?\nSo a pistol whip and rob niggas\nWhat goes around, comes around cuz I end up getting shot nigga\nBut got love not, my hope don't stop, I pop bubbly\nLike the whole block locked, I live lovely\nAnd my father was a Black Guerilla Family crack dealer\nWith the house on hill-a, made scratch for real-a\nThat's why I say it's in my blood cuz my father was a thug\nWith the Colombian plug, flood the block with drugs nigga!\nWe slang lots of coca with Glock's up in the holster\nLa Costra Nostra nigga!\n\nChorus x2:\nLiving the life, living this life\nEveryday's a struggle\nLiving this life, living this life\nLa Costa Nostra", "title": "La Costra Nostra (Intro)"}]}