{"artist": "Prodigy of Mobb Deep", "songs": [{"album": null, "title": "Phone Tap (Welcome to State Prison)", "image": "https://images.genius.com/459c7b64c165fbc76e02360f338fe60b.600x600x1.jpg", "lyrics": "* Intermission *\n* Call between Twin Gambino and Prodigy *\n\n[Twin] Ayo P what's good dunn! What's happening?\n\n[Verse 1: Prodigy]\nAyo what up with it, yeah it's been a minute\nI'm good on this side of the fence, same shit\nDifferent spot on the navigation, just being patient\nWorking out, reading and writing you know the basics\nCorrections, got word from Albany\nKeep me in voluntary P.C, which means\nThe state decides where I live\nCan't sign out because I never signed in\nDifference between they bid and my bid is\nThis ain't county jail, this is state prison\nI'm high risk, high profile too\nThere ain't population but niggas like \"Who you?\"\nNever heard of you, keep banging do your thang and\nMaybe one day you'll be famous, but fuck all that\nThey got this phone tapped you hear me G's?\nTell Tyson bring that beef and broccoli on the next VI\nAyo what's up with Hav?\nHeard that song Letter to P that shit is crack\nThere gonna be drastic changes when i get back\nIt gonna be me and [?] on the [?] like [?] said\n\n[Hook]\nAyo they monitor the phone calls, watch what you say\nThey got the phones tapped better watch how you speak\nYeah, welcome to state prison\nThey got a call on the hotline who is it?\nYeah, better off talking on the visit\nYeah, you better off talking on the visit\nIf you don't know how to speak in code\nYou gone' fuck around and catch a new charge yo\n\n[Verse 2: Prodigy]\nI heard Rap D got knocked, I mean Max B\nI heard Tru Life fighting a body, I hope he beat it\nTell Un every lights green ain't no passes\nTOS, on the East and the West\nTell 40 the same thing, they stay catching niggas slipping in Cali\nFor their jewelry and things\nGive my love to the Zoo baby, Village Boo\nManiac, Tip-Toe and Badass too\nAnyway, 50 came in to see me last weekend\nWe had a long talk about how it's gonna be when\nI touch town, and when I touch down\nWe're gonna party like the SuperBowl on the countdown\nWithout a fuck left, this shit is nothing\nNigga, Ferg about to come home from doing real numbers\n15 years on lock, he was wilding they sent him to 200 box\nSo Twin listen, holla at Gotti and Ron Ron\nTell him congratulations, he made it to the Lakers\nAnd we gonna get this money like it grow on trees\nAnd anybody hating, nigga taste on these\nGodzilla balls, I talk fire when I speak these lyrics\nThe rap game twisted, because everybody copy what the next man does\nI listen to Pitbull and Flo Rida\nThese new niggas sounding like Kanye West\nHe's a biter not a writer, I'm not impressed\nYou a lover not a fighter so cut the bullshit\nAll they're gonna do is run like Saigon did\nBut tell Hav I love him get the beats together\nSo when Mobb Deep drop we be bigger and better\nWord, tell him I need fire nigga\nSo when Mobb Deep drop we be bigger and better\n\n[Hook]\nAyo they monitor the phone calls, watch what you say\nThey got the phones tapped better watch how you speak\nYeah, welcome to state prison\nThey got a call on the hotline who is it?\nYeah, better off talking on the visit\nYeah, you better off talking on the visit\nIf you don't know how to speak in code\nYou gone' fuck around and catch a new charge yo\n\n[Verse 3: Prodigy]\nAyo I just got a letter from the real Rick Ross\nHe in the feds right now but he's real short\nWhat else? Cormega came through on the humble\nWe had a good visit (that's my dunn)\nYeah that's my dunn too\nHe told me that Nas still tight\nBecause I rep Queensbridge harder than a lead pipe\nAnd I'm from Hempstead, close to the shacks on Park side\nGuess he mad I'm successful, and he can't shine\nOh that's too bad, Oh that's so sad\nHe remembers Central Park, he better fall back\nLet me chill because I'm talking reckless on this jack\nAnd police is listening, to everything said\nWhat up with your brothers Punk Munk and Alley Moe?\nThat's good, tell Moms I said Hello\nAnd I know I'm talking your head off, but we ain't speak\nIn a few months, been so much that's happening\nLike Michael Jackson died, the fans is bugging\nNow Jay-Z's summer jam picture means nothing\nOh yeah, I was with [?]\nWe was in Rikers Island, the CO's was wilding\nThe female officers was bad as hell\nIf I had've stayed a little longer I'd have got some tail\nSee, Alchemist on tour with Slim Shady\nHome girl better chill before Em let that tape leak\nBefore Cam'Ron let that tape leak\nBefore Ma$e let that tape leak, damn she a freak\nI spoke to Yayo last night he just copped\nThe new four door Porsche (Yeah that shit hot!)\nI know, but I'm back on my Acura shit\nNo jewelry with the factory rims\nThat life he living now I already lived\nIt's his turn to shine it's my turn to sit\nBack like a Mac and let the bread stack\nYo Cocaine I still wanna test drive that!\nYeah YG wrote me, he holding it down\nAnd Nut wrote a book he a author now\nTell Bumpy George and Tim Law what's up\nProps Karate Joe, Black Ice all my dunns, you heard?\nKing Benny just got locked up\nHis bail was 30,000, Gotti got him out and\nThey caught him in Utica with guns in the car\nDamn, we just chilling on the DI floor\nHeard Money Know getting in it, that's my G\nTell him to stay low, and stay sucker free\nJM will be home real soon before me\nAnd my nigga Shameek back on the concrete, now\nRoam just got bagged for crazy powder\nMan New York hotter than hellfire keep outta\nThe reach of the Police, stay off the streets\nThey locking niggas up like slavery\nI just got a kite from Shee I leech\nAnd LL suppose to come up so we can speak\n(Word I'll be up there again soon yo!)\nGood because I got certain shit I can't say on this phone\n\n[Hook]\nAyo they monitor the phone calls, watch what you say\nThey got the phones tapped better watch how you speak\nYeah, welcome to state prison\nThey got a call on the hotline who is it?\nYeah, better off talking on the visit\nYeah, you better off talking on the visit\nIf you don't know how to speak in code\nYou gone' fuck around and catch a new charge yo\n\nYou know what I'm saying? That nigga P, Sid Roams", "year": null}]}