{"songs": [{"image": "https://images.genius.com/6ae5142ec2af2f495fb6520e587b4517.375x375x1.jpg", "lyrics": "[Hook]\nIt's all right, It's okay, Seein' you all night and all day\nWe be crushin' round the clock, crushin' crushin' round the clock\nWe be crushin' round the clock, crushin' crushin' round the clock\nIt's all right, It's okay, Seein' you all night & all day\nHEY!\nWe be crushin' round the clock, crushin' crushin' round the clock\nWe be crushin' round the clock, crushin' crushin' round the clock\n\n[Verse 1]\nShe got a little bit of beauty, little bit of class\nLittle bit of lips, Little bit of ass\nLittle bit of style, dressed to kill, little bit of freak, with a sex appeal\nUm, I'm so down for whatever baby, always dressed fresh and wavy\nWanna make love, ah yea, that's gravy. late night sex get extra crazy\nAin't gonna leave em stayin, sick of all the games you playin'\nEye gazin', sex amazin, got you squintin, eyes look asian\nI know I'm just a kid, ever tell me what this is\nI see you shake, I see you moan, everytime I touch ya lips\nYou grab my hand, run your fingers through my hair\nEverywhere we go there's sendin sex all through the air\nYa, I know you think I'm playin right?\nHow bout you take just take a chance, stay the night\nYou my baby right? love it when I call you that\nBut I follow cash, I'm a have to call you back\nJust know that, you be in my mind\nI say the same thing every single time\n\n[Hook]\nIt's all right, It's okay, Seein' you all night & all day\nHEY!\nWe be crushin' round the clock, crushin' crushin' round the clock\nWe be crushin' round the clock, crushin' crushin' round the clock\nIt's all right, It's okay, Seein' you all night & all day\nHEY!\nWe be crushin' round the clock, crushin' crushin' round the clock\nWe be crushin' round the clock, crushin' crushin' round the clock\n\n[Verse 2]\nYa, I'm amazed, actin like there ain't no time to waste\nShe a freak, lemme get her right behind the stage\nMy true shorty though, I've had all sorts of hoes\nTake my time when I'm with her, drink my 40s slow\nAnd give us a second, you can find us on the bed\nWild sex, with her legs behind her head\nTurn her over on her stomach, get her from the back\nShe always leave a scratch, but I like that\nShe the type that, you wanna wife that\nAnd she like me, cause all I do is pipe that\nBuzzin' like a bumble bee, that's chillin by the hive\nLove her with no limits, cause my ceiling's in the sky\nFeelin up ya thighs, tongue ticklein ya twine\nWhen I get it from behind, ya say it's twistin up your spine\nBaby, I'm one of a kind, that finds that spot that have ya climax\nI'm that boy\n\n[Hook]\nIt's all right, It's okay, Seein' you all night & all day\nHEY!\nWe be crushin' round the clock, crushin' crushin' round the clock\nWe be crushin' round the clock, crushin' crushin' round the clock\nIt's all right, It's okay, Seein' you all night & all day\nHEY!\nWe be crushin' round the clock, crushin' crushin' round the clock\nWe be crushin' round the clock, crushin' crushin' round the clock", "year": null, "album": "The High Life", "title": "Crushin’ Round the Clock"}], "artist": "Mac Miller"}