{"artist": "R.A. The Rugged Man", "songs": [{"album": "Die, Rugged Man, Die", "year": "2011-03-02", "lyrics": "[Intro]\nRadio speaker : Yeah baby, it's Phil Cassese live on Night Talk\nWe're talking about musical genius R.A. The Rugged Man\nLet's take some calls, find out what you guys think\n#1 Caller: Yo, R's definitly one of the illest lyricist I've ever heard, that's real\n#2 Caller: R.A. man, he's coming out, guns blazing baby, BOOM, watch out\n#3 Caller: He's very intelligent, he's a positive role model in rap\n#4 Caller: I went to a show last week, he was the bomb...\nHe was better than Michael Jackson\n#5 Caller: He's so sexy, My girl said he had an 11 inch cock, couldn't walk a week after\n#6 Caller: Yo R.A. is worldwide man, he's going platinum, quadruple, and big time\n#7 Caller: First time I saw him, I knew he had a star quality, he's a superstar\n\n[Verse 1]\nAyyo, here's the whole story, the whole true, \"He's retarded\"\nHere's how my whole bullshit career started\nBack in '88 it was about battle rapping and shooting guns off\nAt house parties, say \"HO\" (BANG!BANG!BANG!) on the streets before rhyming\nNo complaining, no money, no fame, still maintaining\n1991, now my whole career started busting\nYou seen on stage shows, guess the crowd jump in it\nLet the kids come on\nTommy Boy, Mercury, Priority wanted me\nRussell Simmons, and 9 other record companies\nSending limousines out to pick up my broke ass\nFeeding me steaks, buying me hookers, I hope that shit last\nI was used to have no cash, I got gassed\nWhite trash, why they wanna sign my ass?\n'92 the whole industry was on my dick\nI signed to Jive Records, and fucked up the whole shit\n\n[Hook]\nYou're a shining star\nYou're a superstar\n(Ooohhh)\n(Large star)\n(But you gonna be large)\nYou're a shining star\nYou're a superstar\n(Ooohhh)\n(Yeah, right)\n\n[Verse 2]\nNow I'm stuck on a wack label\nThey say, \"See the way you behave\nNow wonder why the label hate you\"\nThey said \"He's a beast, he's a creature\nKeep him in the other room, don't let him see Aaliyah\"\n\"Ban him from the building, I don't wanna see him either\"\n\"He just don't know how to play the game right\nHe could be larger than life\"\nThey try to turn the label Caucasian\nThey signed me, Whitey Don and the Insane Clown Posse\nAnd then they signed the Backstreet Boys and Britney\nIt's a pop label, what the fuck they want with me?\nForget R. Kelly, I'mma do that ripping out your cunt shit\nI flipped the fuck out and did some dumb shit\nOn some look at me, I got a gun shit\nI ain't gonna give you that commercial run hit\nInstead I gave you \"Every record label suck dick\"\nTry to press charges against me\nSuited me, blackballed me\nMy lawyer wouldn't even call me\n\n[Hook]\nYou're a shining star\nYou're a superstar\n(Ooohhh)\n(Large star)\n(But you gonna be large)\nYou're a shining star\nYou're a superstar\n(Ooohhh)\n(Large star)\nYou're a shining star\nYou're a superstar\n(Ooohhh)\n(Large star)\n(But you gonna be large)\nYou're a shining star\nYou're a superstar\n(Ooohhh)\n(Yeah, right)\n\n[Verse 3]\n'95, I'm broke out the ass, no dough\nWatching everybody else around me blow\nTrackmasters, Mobb Deep, Keith Murray\nBiggie and Puff, I will admit it, I was jealous as fuck\nI was so pathetic\nNo dough, found an ugly chick\nWith a no dough fetish, all my old hoes jetted\nWent from hearing \"You gon' be a star kid\"\nTo hearing \"He ain't talented, he's garbage\"\nNow for shitty kicks there's no market\n'96, I got a gun now\nI remember I was plotting to kill Jeff Fenster\nMoved back in with pop duke\nAnd my handicapped brothers and sisters, and we had no loot\nThat's when the Feds came by\nAnd surrounded the house\nThey had automatic weapons, and was pulling 'em out\nAnd the moral of the story is\nAll that glamour and glitz shit (what?)\nFuck that shit, I don't need it\n\n[Hook]\nYou're a shining star\nYou're a superstar\n(Ooohhh)\n(Large star)\n(But you gonna be large)\nYou're a shining star\nYou're a superstar\n(Ooohhh)\n(Yeah, right)\n\n[Outro]\nRadio speaker: Yeah baby, it's Phil Cassese, we're back live on Night Talk\nThe subject: R.A. the Rugged Man... What happened to that guy? We're taking calls\n#1 Caller: Yo, R's the true definition of a wack ass, punk ass, bitch ass MC, 'na mean\n#2 Caller: R.A., You're going down boy like a piece of shit, BOOM!\n#3 Caller: I see him at the mall, he grab my ass and spit on my tits\n#4 Caller: I went to a show last week, it sucked so bad\nHe was in his underwear, spitting everywhere, he's so disgusting\n#5 Caller: Yeah, my girl fucked him\nShe sad he had a little 2 inch dick, and couldn't keep it hard\n#6 Caller: R.A.? He’s hurting, man. Heard his label drop him, guy's a loser\n#7 Caller: Yo anybody seen that guy R.A. around, heard he's fucking broke\n#8 Caller: Yeah, I don't think R.A. is that bad guy and everything\nJust cause he's losing and shit, and I, before..\nRadio speaker: I think we might have R.A. the Rugged Man on the line now\nR.A, is that you?\n#8 Caller: Uuuh... NO!", "title": "A Star is Born", "image": "https://images.genius.com/3bdbfd263ed5b58a13c023066d2c7c74.900x900x1.jpg"}]}