{"artist": "C-Rayz Walz", "songs": [{"title": "PostUp", "album": "Limelight (The Outroduction)", "year": "2003-02-03", "image": "https://images.genius.com/1c7f1f5dcacc3e1fa80d314a70a561d0.600x600x1.jpg", "lyrics": "[Hook: C-Rayz Walz]\nYo, we post up and build in front of the kids\nPay them bills for real ‘cause we gotta live\nThe rest of the chorus will come when I write it\nSo for now, just pretend you psychic (Psychic)\nYo, we post up and show skills in front of the kids\nPay them bills for real ‘cause we gotta live\nMy life is real—you can feel when I’m writing\nSo if you living, you better act like it\n\n[Verse 1: C-Rayz Walz]\nYo, I can’t stand y’all—I should make y’all sit down\nI’m an asshole?  Well let me drop this shit now\nI’ll kill you—my mouth is a gun.  Click, blao, blao\nOn some Kool Moe Dee—“How You Like Me Now?”\nI spaz out, pull math out and equate\nElevate—my conversation educates\nLevitate my stats every time I rap\nI’m hip hop, listening to R&B with slack\nSmoking a Bob Marley with anthrax in my backpack\nWell-rounded like perfect paws and circle cats\nIt’ll hurt you, black, like “Did I do that?”\nThe Urkel rap—my Family Matters, in fact\nI cypher sounds with Funk and Flex on clowns\nGet your hands out your pocket.  Calm down!\nEveryone’s rushing.  I slow it up and be different\nThat’s how iMac like computers without pimping\n\n[Hook: C-Rayz Walz]\nYo, we post up and build in front of the kids\nPay them bills for real ‘cause we gotta live\nThe rest of the chorus will come when I write it\nSo for now, just pretend you’re psychic\nYo, we post up, show skills in front of the kids\nPay them bills for real ‘cause we gotta live\nMy life is real—you can feel when I’m writing\nSo if you living, you better act like it (Act like it)\n\n[Verse 2: C-Rayz Walz]\nI’m the black market artist—you don’t wanna start this\nI rock PlayStation 2 with a SEGA cartridge\nThe next level of the game (Yeah).  Life’s for real\nA smart shopper—that’s how I got my deal (You wanna know?)\nSome go plat’.  Others run for steeling/stealing\nMy tracks is hot—hotter than a devil when it’s chilling (Hot)\nYou better get a front pass, make the fun last\nI got stupid money (What?).  I mean dumb cash\nRoll with the force, of course, or get trampled\nThat girl you kissed lips may contain a sperm sample\nIt ain’t no party—where the tail you can pin the donkey on?\nBut you’ll get the point later like a junky’s arm\nI told kids, “You can get Tricked or Charms”\nBomb con the arm or just set it off to get on\nIncite me to see it before it happens\nSo if I incite the riot, will that lead to clapping?\n\n[Hook: C-Rayz Walz]\nYo, we post up and build in front of the kids\nPay them bills for real ‘cause we gotta live\nThe rest of the chorus will come when I write it\nSo for now, just pretend you psychic\nYo, we post up, show skills in front of the kids\nPay them bills for real ‘cause we gotta live\nMy life is real—you can feel when I’m writing\nSo if you living, you better act like it\n\n[Verse 3: C-Rayz Walz]\nI’m all over the net like a clumsy insect\nI’ve been a vet, been Stronghold, been a wreck\nBeen baking.  Then seen Ben Franklins\nI been seen it, but I’m patient so I been waiting\nAnd police Bengay/been gay without the ointment\nBenefitting from crime—Bushwick to Boynton\nI bench press my borough, rep my set\nBitch warrant got the most benevolent stress\nAnd beloved, not to be on no bullshit\nIf you don’t smoke the whole L, you get a full clip (Blat, blat)\nI spit funky—you can words, town herbs\nI’m dope enough to get you bent like the bell curve\nI pay fifty dollars for milk, bread, and cereal (Damn)\nHoller if you with me now, say, “I feel you!  I feel you!”\nPost up like cereal on top of the fridge\nSome of this is over your head, kids\n\n[Hook: C-Rayz Walz]\nAyyo, we post up and build in front of the kids\nPay them bills for real ‘cause we gotta live\nThe rest of the chorus will come when I write it\nSo for now, just pretend you psychic\nYo, we post up and show skills in front of the kids\nPay them bills for real ‘cause we gotta live\nMy life is real—you can feel when I’m writing\nSo if you living, you better act like it\n\n[Outro: C-Rayz Walz]\nYo, we post up.  Right in front of the kids.  We post up, reveal in front of the kids.  Living?  You better act like it.  Stronghold.  Whose style is the sickest?  SH5, Cardiño Reyes.  Splatting you.   Discovering time.  Jeepers.  Cream them cats.  Zoinks!  Hahaha"}]}