{"artist": "Boosie Badazz", "songs": [{"album": "Incarcerated", "title": "Better Not Fight", "year": "2010-09-28", "lyrics": "[Intro]\nY'all better not (Heeeeeeeeeyyyyyy)\nY'all better not (\nY'all better not\n\n[Hook:]\nYa'll betta' not fight in this bitch\nYa'll betta' not fight in this bitch, cause I plan on stayin' all night in this bitch [x2]\n\n[Lil Boosie:]\nAsk Louisiana, (ask 'em) ask Mississipi (ask 'em)\nAsk Little Rock nothin can fuck with me. (Little Rock)\nReal talk you can even ask 50 (ask 50)\nBetta' yet you can ask P.Diddy\nBaltimore my city, I set it off\nIn Milwaukee I'm the governor nigga, they lovin' a nigga\nI'm Duvall finest, I'm laced with diamonds\nBeen up in St. Louis all they do is bang Boosie\nPresident in Carolina, both of 'em, hundred thousand on my wrist bitch, both arms\nLouisiana ain't even gotta talk, (fa what?) in every town I'm the muthafuckin boss\nSavannah Georgia I'm higher than anybody, rest in peace camoflauge nigga I got it\nGot a style that just can't be faded, gotta smile drive bad bitches crazy\n\n[Hook:]\nYa'll betta' not fight in this bitch\nYa'll betta' not fight in this bitch, cause I plan on stayin' all night in this bitch [x2]\n\n[Lil Trill:]\nWe in that thing d-bo, hotta than a heato, walk a wrong way & getcha stung like a mosquito\nYoung nino, money like a casino, bossman in my city think I'm Al Pacino\nChea with the fightin tonight gettin ya chills on\nWe tryna party all night we ain't goin home\nTrill fam yeah you know how we rock every city we hit we got the town on lock\nAll or nothin' yeah that's just how we comin'\nTell ya boy to stand down we come in a whole hundid' (Think we ain't?)\nYou can buck, you can dance, you can wyle out\nGet outta line & we gon' make ya file out\n\n[Hook:]\nYa'll betta' not fight in this bitch\nYa'll betta' not fight in this bitch, cause I plan on stayin' all night in this bitch [x2]\n\n[Webbie:]\nWhatchu mean bruh? Awh mane bruh\nI'm in this thang and that's the only thing I came for. Mugged up, I got my people with me\nThe whole trill fam, and we don't give a damn\nBout what they talkin bout. spillin liquor put us out\nPoint one of em out, I'll punch em in the mouth\nFull of drugs, feelin good\nI dare ya for to look at me. fuck with me, what nigga?\nKnock ya out & then kick ya apart, stomp the shit up outta bitch & take that shit to the car\nPut that tool up on ya homie right in front of ya boy\nMurda, first degree, I'm ready ta catch me a charge. whaaat!\n\n[Hook:]\nYa'll betta not fight in this bitch\nYa'll betta not fight in this bitch, cause I plan on stayin' all night in this bitch [x2]\n\n[Foxx:]\nDon't get to fightin my niggas might get to shootin\nI got fifty niggas with me, 49 of em bootin\nI'm on all kinda drugs I don't know which way to go\nLeft my mind at the house\nLeft my cigar at the store\nLeft my weed in the car\nLeft my henny at the bar\nLeft my rubber on yo bed\nLeft yo woman in the dark\nTell tha dj run it back, yeah we on the hundid pack\nGot somebody babymama kissin where my stomach at\nBetta cool yo lil nachos, actin like you macho\nHitcha with that 40 knock the meat up out ya taco\nI don't even drank but got this giant goose bottle\nYou can keep the ratchets cause I'm leavin' with a model!\n\n[Hook:]\nYa'll betta not fight in this bitch\nYa'll betta not fight in this bitch, cause I plan on stayin' all night in this bitch [x2]", "image": "https://images.genius.com/d9d6e55f32ffdf0538d438019664bba5.640x637x1.jpg"}]}