{"artist": "ProfJam", "songs": [{"album": null, "title": "MAOI", "image": "https://images.genius.com/06600b3d132b5f96ede940c012fcd560.927x927x1.jpg", "lyrics": "How ya doin baby? howdy do proud g\nMAOI no palco, mato o mau mood growly\nShao lin, \"efeito pauli\" - spino num grau free\nDid't get it? it's ok, that's how we\nDo it, just - ke, ni\nFuck like a lion, phi-line, sea mine, c minor\nPussy fine minha, dá-me please pq isso cai na\nPerfeiçao, de feição, minha face no teu colo\nUm beijo sao dois, nao sei se nao me colo\nA ti, aos teus lips e dou-te um novo lipstick\nTenho um stick pos teus lips tipo um baton de dick\nSorri, tas a ser filmada\nNa minha mente fotográfica tarás sempre marcada\nEs linda assim mm, safoda o instagram\nInstantaneamente flashaste o profjam\nObeso na track - professor chanfrado\nEddie murphy, bernie mac, unas e solnado\nTu na frente, eu na back, classico reeditado\nDo snoop la pa 93/94\nTira uma do sixpack, desliza no meu sixpack\nA tablete quase derrete quando tu viras sexy cat\nYou bringin' sexyback (yeaaaah)\nE eu fingerbangin that, ela só pinga no meu lap\nSo bring her, cut the crap, ve-se que ela adora rap\nPtt just make it clap e enquanto o ass abana tb estala com uma slap, huh\nCurte de verdura, eu faço logo um crepe!\nWe smoke that weeeed, ela chama-me asap\nE eu nem faço trap mas olha que trepo bem..\nNao sou badboy, ele é que é bué de feio!\nU see that? consegui fazer-te rir\nWhat's next? so falta fazer-te vir...\nPr'aqui po pé de mim, queq ja tavas a pensar?\nCarinha de santa mas tas sempre a magicar\nLarga a varinha mágica - pára de m'agitar!\nSe alma fica nostálgica, não consigo pensar...\nMas tu és... algo inexplicável\nConstante na minha vida, função sem variável\nTeu olhar lança faíscas e como eu sou inflamável\nQueimo esta merda toda, nero do rap, implacável....\n\nÉs uma miúda graúda, sa foda a puta da tuga\nTu tas comigo na luta ptt abana a batuta\nEscrevo uma linha da pura, sentes a minha pq apura\nCurtes a minha que é dura, ruge! caminha que és dura\nMinha maninha madura minas me a mente de loucura\nFuras me o dente doçura, quem mais mente mais jura\nEntao sente a cura po nosso tempo\nMuda o que tens ca dentro, muda o momento\nChuta o veneno pa sempre, limpa o teu templo\nLiberta o teu ser e deixa-te viver!", "year": "2013-04-27"}]}