{"artist": "Drake", "songs": [{"year": "2007-09-01", "album": "Comeback Season", "image": "https://images.genius.com/866a4a7df935705e834f236499d617c6.1000x1000x1.jpg", "title": "Comeback Season", "lyrics": "[Produced by Nottz]\n\n[Verse]\nI got ice all over my windshield\nI can tell it's gon' be a cold winter\nI hit the defrost, I never turn the heat off\nAnd still I'm so chilly willy snowflake\nThese silly billies really fail to act as if they know Drake\nAlways gossipin' callin' and textin'\nMagneto niggas tryna bring down ex-men\nTellin' my ex-girl tryin' to explain\nHow I am no good, so go with the next man, but dog\nYou don't know me, you don't know us\nWe go by the name of A-T-F, and any previous affiliation\nThey know to hold they tongue and I spare 'em humiliation\nI know you in and out, nigga I am not playin'\nJust fall back, keep on Escape'in and Alize'in\nAnd stop tryna act like you like me and my team\nNot us, so you knock us, that's precisely what I mean\nAnd dog, it's forever clear, my money evergreen\nMy presence required in places you have never been\nIt's all in a day's work, that's what I am on\nNBC, MTV, Viacom\nAnd whose Continental GT is outside\nShowin' them how monumental he be?\nOne wheel on the curb, ticket on the dash\nIt's like every fuckin' summer I just switch it on they ass\nAnd maaan I'm a commodity, none of them as hot as me\nThe industry standard, so I am what they gotta be\nCause Drake's syllables is like Jake Gyllenhaal\nCan't help it, I been brainwashed to kill 'em all\nI think I should pass my own amendment\nYou frontin' with glass all in your pendant\nYou ain't livin', rapper, you never have been\nYou a has-been, a gas station attendant\nYour man is a turkey, you wit' a liar\nI'm clearin' the air, I'm a humidifier\nI'm spittin' fire, and gettin' flyer\nAnd what you plannin' for this summer, I did it prior\nI've shattered shows in tattered clothes\nMet status quos, this is the South\nAnd I am, present when it matters most\nThe startin's hot but pay attention to my latter flows\nGivin' brain ain't bad girl, don't be that opposed\nI flatter hoes\nAnd drink Dom, they always ask me, \"Is that a rose?\"\n\"You mean Rosé? Why yes it is\"\nI stopped trying years ago, this is effortless\nI'm in your house got the key to your home\nI am Jeopardy asked Wikipedia known\nI am A.A. driven and Expedia flown\nSo stop jackin' my style, you're in need of ya own, man"}]}