{"artist": "Porta", "songs": [{"album": "No es cuestión de edades", "title": "Las niñas de hoy en día son todas unas...", "image": "https://images.genius.com/1d76236de7af6962571eed68e31756dd.768x768x1.jpg", "lyrics": "Vaya, mira que pinta, eres una niña muy guarra ¿verdad?\nSí, sí, tú lo que quieres es que te den\nEso es lo que buscas, Oh, eres una coqueta y una\nGuarra, te mueres de ganas y no te importa quien\nTe lo de porque no tienes dignidad, Y eso te pone ¿verdad?\n\n[Verso 1]\nTú, tú, tú, tú eres zorra como todas las demás\nPues solo buscas pollas gordas para poder follar\nEn un lujoso hotel o en la guantera de algún coche\nEn plena luz del día o preferiblemente en plena noche\nNo te importa si él es feo, si él es guapo\nSolo te importa su cipote, na’ más te importa el tamaño\nLa típica que va de santa y que mama le compra todo\nSin saber que mama todo, cometrancas es su apodo\nImpuesto por sus amantes,¿por?, por ser tan zorra\nMostrando su escote, ¿para? para que en este se le corran\nSuena algo desagradable pero es que esto es lo cierto\nLa juventud de hoy en día solo se fija en un cuerpo\nEl amor se basa en engaños, también en decepción\nEn poner los cuernos al chico que amastes ten compasión\nY es que eres una puta más, tan solo siendo niña\nEntiende que me das asco con tu Malibú con piña\nEn tu disco favorita siempre tirando la caña\nA ver si pica algún imbécil en tu gran tela de araña\nUsas de cebo pa’ triunfar tus más infalible arma\nEscote excitante y una muy corta minifalda\nProvocando, eres una calientapollas\nSi eres tan guapa, dime, ¿por que solo con feos follas?\nVas de mayor de madura siendo solo una niñata\nQuieres ser como son todas de mentalidad cerrada\n\n[Estribillo]\nLas niñas, las niñas de hoy día son guarras\nLas niñas solo quieren sexo, alcohol, drogas y farra\nLas niñas quieren dejar ya de ser niñas\nContrólenlas papa y mama espero que las riñan (x2)\n\n[Verso 2]\nVuestras niñas solo saldrán de casa maquilladas\nQuieren ir guapas, salir vestidas como colegialas\nNunca salen sin su bolso ni sus putas pinturitas\nQuieren ir guapas en todo lugar como princesitas\nDe porcelana, rubias, morenas son todas iguales\nPelirrojas más de lo mismo, no importan las edades\nVais igual, perdónenme pues no os consigo distinguir\nSolo os quereis pa’ competir, pa’ ver que zorra gana aquí\nA ver quien es la más guarra de toda la pandilla\nEn especial va dirigido a aquellas guarrillas pijillas\nQue se den por aludidas, pa’ follar ves al Pacha\nO busca algún facha que este cachas y que haga la marcha atrás\nVas como una cuba, empiezas a empapar tus bragas\nEn casa te espera papa y una bronca que te cagas\nSe que tenias ganas de follar, pero no podrá ser\nEn esta noche por tan zorra te quedaras sin placer\nY además castigada, te jodes sin salir un mes\nLlama a tu ex que te visite y que suba por la ventana\nTan solo eres una enana que se tira lo que sea\nEres fea aunque estés buena, ya piensas que eres perfecta\nTan solo eres una Barbie en busca del rabo de Ken\nVas de chica playboy, puta niña pija que te den\nSueles follar sin condón y además con desconocidos\nHarás un bombo tendrás un bebe, sida y cero maridos\nRubia de pote, chocho morenote\nPuta comeme el cipote que se que te pone el roce\nSon las 11 pa’ la cama a acostarse con la fama\nTan solo eres una niña guarra y nana en pijama\n\n[Estribillo]\nLas niñas, las niñas de hoy día son guarras\nLas niñas solo quieren sexo, alcohol, drogas y farra\nLas niñas quieren dejar ya de ser niñas\nContrólenlas papa y mama espero que las riñan\n\nLas niñas, y es que una ex siempre será follable\nLas niñas, pasaras un ratito agradable\nLas niñas, trágate entera mi sable\nLas niñas de hoy en día todas son una guarras\n\nAha aquí esta el Porta, contra todos aquellos de\nReggueton, de reggetonmania tonton a ver ¿Qué pasa?\nSi, eh, qué pasa? Muévete va, menéate ahí, hazte\nLa guarra , yo…mira, mira …\n\nMueve las caderas, nena, mueve las caderas\n¿No te enteras que me pones? A ver si maduras nena\nBailas guarra chúpala, agachada dentro del Pacha\nBuscando algún cachas moreno que sepa hacer la marcha atrás\nEl reggueton te pone tonto, restriega pollas por culos\nY verás que diversión, tu coeficiente mental nulo\nVete a la disco pa’ triunfar, pa’ bailar con un Don Juan\nEres el centro de atención, puta ¿bebes pacharán?\nEnséñame el tanga, quitarte la camiseta, ¿bailas zorra?\nClaro, ¿tengo que estar buena, o ser rapero y llevar gorra, no?\nIr a la moda, ser como a ti te mola\nEn esta discoteca tu eres la única que controla\nHagamos un pelotón entre todos y toquémonos\nPongámonos a 100, sudemos juntos y mojémonos\nTequila, sexo drogas, alcohol, es lo que hoy en día se mueve\nSi la tienes de tres metros triunfarás entre mujeres\nFuma, bebe, a ser posible mójate la camiseta\nQue se vea bien tu escote o directamente las tetas\nVuelvo para prender fuego a la gasolina de Daddy Yankee\nPongo la voz de pito y voy de tranquis\n“dale más gasolina, dale más gasolina”\nMe la suda, si te has follado a 2 o 3 latinas\nEsta noche ya veremos si con el morao’ atinas\n¿Eres provocativa? No, solo eres otra guarra\nUn cubata, 2 polvazos y aun quieres seguir de farra\nFardar de lo que tienes, doña no tengo defectos\nY es que los grados de alcohol ya empiezan a tener su efecto\nCuatro de la mañana necesitas descansar\nTu cuerpo ya no aguanta más pero no te quieres marchar\nNecesitas machacarte, romperte para parar\nY es que sois tan regguetontos que palmáis para bailar\nRegguetonto, eres un regguetonto\n\n¡Que te follen!", "year": "2006-06-11"}]}