{"songs": [{"image": "https://images.genius.com/88580af983438f1c5296bb2a8a2668c1.1000x1000x1.jpg", "title": "Shadow Man", "album": "Telefone", "year": "2016-07-24", "lyrics": "[Intro: Phoelix, TheMIND, Cam O'bi]\nHow do you see me?\nHow do you love me?\nHow do you remember me?\nAmaurotic nightingale\nI hope that darkness keeps you well\nWhen I can't fall asleep at night\nI blindly taught myself to fight\nAw shadow man shadow box, please keep your hands up\nAnd if you get knocked down don't forget to stand up\nBless the nightingale\nDarkness keep you well\nBless the nightingale\n(I pray it keep you well)\nDarkness keep you well\n\n[Verse 1: Noname]\nShadow man, shadow box, dance in the dark with me\nThis resurrected agony there's apathy for caskets\nEverything I ever loved I lost in the magic\nI claim by the river, my body delivered\nWhen I die there's 27 rappers at my funeral\nMoses wrote my name in gold and Kanye did the eulogy\nRemember all the bashfulness, understand the truancy\nHere I stand in front of a college dropout\nMy music was a church when my spirit hopped out\nMet a gypsy in LA and she reading my palm tree\nMysterious situation like kissing the concrete i.e getting money\nI been close to heaven, baby claim he love me\nHold me down forever, I never should have bought this halo\nHe waiting for me at his table\nMy funeral a Disney fable 'cause the king 'bout to take me home\n\n[Verse 2: Saba]\nPreach, church, tabernacle, Tallahassee sunshine\nSouthern is my bloodline, we know it'll come time... to go\nAnd though I leave like alumni\nI'm lying like a lullaby and quiet like my tongue tied... alone\nBury me in satin, tell the pastors say the sad shit\nSame class with the whole... first row\nAnd if ashes turn to ashes then I'm back in my first form\nWith a dust storm with a corner... and coke\nMorbid or late, Lord give Lord take\nViva la muerte, mortal man, less love, more hate\nMore like mortician, we meet our fate\nFuneral home lookin like a home that I used to live in\nYou wasn't supposed to go so soon I took it for granted\nMaybe we'll meet the next life, maybe another planet\nOpen my soul but then it'll end with an open casket\n\n[Verse 3: Smino]\nUh, ay, tippy-toe on a tightrope\nLeaning on green and it gon be a dice roll\nI'm fiendin' a feline who mindset Afeni, I got two packs for us\nGold on my gumline done got rich off my tongue\nSticky dro in the tight roll, cleaning my grievances\nAs a lil' heathen I sat pledge allegiance out\nNever believed in y'all system, I needed more\nAnd I done went Figaro with the finger roll\nLanded wrong split my head, start leaking songs\nAnd I'm worser than they worst, they make a nigga live forever\nFlock with them birds, my heart stay lighter than a feather\nIt's gon be niggas boomin' at my funeral (oo-woo-woo-woo!)\nTell em play Metro Boomin' at my funeral\nSt. Louis taught me death could be your neighbor, stay away\nDon't take the family for granted better days await\n\n[Outro: Phoelix, TheMIND, Cam O'bi]\nBless the nightingale\nDarkness keep you well\nBless the nightingale\nDarkness keep you well\nBless the nightingale\nDarkness keep you well\nBless the nightingale\nDarkness keep you well"}], "artist": "Noname"}