{"artist": "Wiley", "songs": [{"year": "2008-12-29", "lyrics": "[Intro]\nYo\nWicked man time, yo\nListen, yo\n\n[Verse 1]\nWell I'm back to win it\nYou're a big actor innit\nGot a sick [?]\nYou really wannabe, you're an idiot\nI'll relax and finish him\nIs he back for William?\nWell, let him know I'm killing it\nMain stage, top belling it\nCracks and druggie never gonna see em\nBut I've said before, everyone not gonna [?]\nRapist, pussyhole\nCaught with a hundred shots, three times\nWho's singing if he's out on road?\nWait a minute because it will take a minute\nSee I can take the crits\nPlus snitch talking about MAC-10 and wires\nFake and finish, not a Jamaican innit\nYou're a pagan\nPlease don't mistake him innit, he's a Jamaican innit\nAnd I'm not hating innit but I've got ratings innit\nMy career ain't finished, I'll be clear in a minute\nI'll be there in a minute, you'll hear in a [?]\n\n[Verse 2]\nDon't fear like lizard but I've got him on the ledge again\nDraw for the stud again\nLet a fassy know he's not ahead again\nLikkle brother ain't here breddin' him\nI can see the dead in him\nThere's no cure, no tablets, Valium, drugs or medicine\nDidn't fire no MAC in the first place\nHow you gonna come back and fire like a MAC again?\nTitch don't like all the glamorous chat again\nHow you gonna bust case, land road\nTalking a bag of chat about how you're back with the MAC again?\nBoom, fall back with a MAC chat\nFeds ain't my friends, you need a protection racket like\nIf it goes off in a place, I got it in place\nYou're gonna see all of them man backing him\nMake jokes like manaman stabbing him\nYes, ain't heard about manaman jacking him\nBut, what about the Stoney? Them grabbing him?\nAnybody want to bet money I'm back again?\nThree cars, two bikes, three yards, stack again\nWages are fat again, big boy's back again\nI'm skating the track again, I'm raising the rat again\nAmazing the crowd that came here to clap again\nTalk once, ain't gotta talk back again\nYou're the silly one who's on crack again\n\n[Verse 3]\nMe, I'm back again, back again, wearing black again\nTold them already, no tackling\nTwenty five goons with a back again\nPolice boys are tapping him\nAnd man thinks \"why the hell was I backing them?\"\nNow he's on the road, chatting crap again\nAnd I'm doing 30 years for the prick, on a visit I'd be slapping him\nLikkle idiot, I see the crack in him\nI don't give a damn who's backing him\nStage show, solo, Wiley's back again, so\nMan better realise, man better know\nGot a top 5 and the man behind you ain't got one\nLet alone you and them, so forget electro\nI'll snap your neck, bro\nHolding on to my status, let go\nHyping up like you're gonna let the TEC go\nThe ting I smoke is green like pesto\n\n[Verse 4]\nDon't hype with the white lights for the night\nFor the night, white lights right past me\nIf you want to know why I'm the best, just ask me\nCan't outclass me or harm me\nWith or without your new army\nI sent your whole camp, bar me\nIt's on top, alarm them, don't alarm me\nYou've been yamming on a bacon sarnie\nIts hard in a war, can't par me\nIts not gonna happen anymore\nCan't scar me again, dark me again\nNever break half of your leg\nWhat you owe your brother, you can never pay half of the debt\nCan't say that it's hard to forget\nSo boo-boo-boom-boom\nThat's half of your head gone\nNow you wanna know where the half of your head's gone\nYou can see me any day on a stage and try a ting\nIt's gonna be the half of your leg gone\n\n[Verse 5]\nFirst part of the year, he was offbeat\nLanguage barrier, sounded like a Yankee\nWhere's My Brother? Now you understand me\nKeep on trying it, do you understand me?\nReally and truly, you can't stand me\nI make you angry\nBoy Better Know is my family\nMC, say \"Boy Better Know\" out your mouth so much\nReally, I should be chopping off a hand clean\nBox a man up in the canteen\nI don't give a shit what a man seen\nMy plan A worked, you're on plan B\nAnd we know I'm at the top\nNot like you and plan B are standing\nI am six bags, no one can look\nYou are never gonna catch me\nAnd I didn't get killed in Hackney, in an alley way\nAsk God he'll back me", "image": "https://images.genius.com/da5172b04f89f0048c646e85e4f332ef.549x549x1.jpg", "album": null, "title": "Angry Garden Gnome Freestyle"}]}