{"artist": "Papoose", "songs": [{"album": null, "title": "Go To War", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "INTRO BY PAPOOSE:\nYou wanna go to war? lets get it then\nIf war bring peace im wit it then\nI don't start beef, I finish it\nGhetto soldiers, we militent\n\nAKON:\nI dont like to fuss or fight\nJust tryin to live life right\nBut dont take my kindness for weekness 'cause i will take your life\nAt first i will walk away, unless you push me to play\nBut thats somthin I know you'll regret, so please dont forget:\n\nIm a ghetto soldier,desperado oooo\nIm a ghetto soldier,good man sing ooooo\nIm a ghetto soldier,how white sing ooooo\nYes, a ghetto soldier,black man sing oooooo\n\nPAPOOSE:\nThe soldiers get trained my the leutenant\nThe leutenant gets all of his orders from the captain\nGeneral, when i was young, i got drafted\nSent me to the army of brooklyn, those bastards\nFull of soldiers, my homies lay in caskets\nThey couldn't survive the heat\nJust like the mavericks\nAnd I dont buy wolf tickets from niggas\nBut niggas be wolfin so i walk around wit my clippers\nSome of my people was alive for my struggle\nBut ain't lived to see my success\nThey wanted to see me make it, but got stripped naked\nAnd layed in the mall cuz of death\nSo yo now that Im successful\nHow can i celebrate it?\nThey died early, so in their eyes I never made it\nI ain't goin' give you my life, you gotta take it\nSoldier, I'm going out Blazin'\n\nIm a ghetto soldier,desperado oooo\nIm a ghetto soldier,good man sing ooooo\nIm a ghetto soldier,how white sing ooooo\nYes, a ghetto soldier,black man sing oooooo\n\nPAPOOSE:\nWe said the same thing at the same time\nI ain't knock on wood\n\nBlack cat crossed my path, my luck still good\nBroke a mirror, I ain't get 7 years of bad luck\nNuttin bad ain't even happened, my left eye jumped\nPut my hat on the bed when I walked in the room\nSwept my feet, and I ain't even spit on the broom\nWhat im try'na say is, Im not supersticious\nAkon what am I ?\n((akon)Im a ghetto soldier)\nMy right hand itchin, been havin money kid\nI even opened the unbrella in da crib\nBought my girl some shoes, she ain't walk outta my life\nNo bad luck, I skipped the po twice\nNo superstition, just wise intuition\nOn the battle field get killed or do the killin\nBy the way my good luck charm is a biscuit\nGhetto soldier to the ended...\n\nIm a ghetto soldier,desperado oooo\nIm a ghetto soldier,good man sing ooooo\nIm a ghetto soldier,how white sing ooooo\nYes, a ghetto soldier,black man sing oooooo\n\nPAPOOSE:\nNo pain no gain\nAll of the trama is killing me\nPain can't swim\nThats why I drown in that Hennesey\nTired of the enemy, runnin to your crib\nSlumped you in your fireplace, and have smoke comin outta\nYour chimney\nI could see straight through your plots and your trickory\nIt dont mean shit to me, im trying to get to the bottom of it\nBut I lost a whole lot of my energy\nTryna get to the bottom of a botteless industry\nNow-a-days all i got is my pride and my dignity\nYou ridin with sympathy\nThey say misery needs company, why keep em company?\nYou kiddin' me? when I could grab a weapon and put him outta his misery\nSays shots asked you to tell you Im not playing!\nWhen you fire back you let me know what chu saying\nThis gun busting its like an unspoken language\nWe communicate with our guns, this shit is dangerous\n\nIm a ghetto soldier,desperado oooo\nIm a ghetto soldier,good man sing ooooo\nIm a ghetto soldier,how white sing ooooo\nYes, a ghetto soldier,black man sing oooooo\n\nYa know...", "year": null}]}