{"songs": [{"title": "If My Life Was More Like 1983", "image": "https://images.genius.com/68d31cfa3f42ed7eb96514ef18e56c4e.1000x750x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nI... gots... flow\nYeah\nBrandUn DeShay\nSorry I took so long\n\n[Verse 1: brandUn DeShay]\nFirst of all, I'm just taking a breather for spitting ether\nSo while y'all dudes getting that bread, I'm making pita\nNot Lois, my freestyle's sick, so he's a cheater\nEither that, or a genius, but you, sir, are neither\nSee ya, wouldn't want to be ya, good luck\nThat snow bunny's rubbing on my feet for good luck\nShucks, I still ain't signed and it sucks\nOnly got two bucks, but I could give two fucks\nWho knew fucks could fly? It must cause I'm fly as fuck\nAnd I don't give a flying fuck\nGot your aviators on, but your flying sucks\nOnly dude at the Grammy's looking fly in a tux\nHa! Goddamn, I can already see it\nLike the letter after \"B\", I can already see it\nGot the ocean of stars and you already see it\nWho knew that I could make waves\nMake way? Hey\n\n[Chorus (2x)]\nFar away from home, no man\nHow're we supposed to land when there's no land?\n\n[Verse 2: brandUn DeShay]\nI done been through way too many transplants cause if I can reckon\nI gave my heart to music, college a arm and a leg and\nThe cost of college nowadays is a arm and a leg and\nI'm bringing the end like I'm Armageddon\nI'm Doomsday, the Red Barrel, what does your tomb say?\nKanye's the best producer, I wonder what tune say\nI still remember hit was a Tuesday, a school day\nMatter of fact, been a fan of DOOM ever since I heard DOOM say\n\"Now why Hollywood hotties stepped in Giuseppe Zanotti's\nPersonnel nurses, Chanel purses, CLK shottie\"\nSpecial Herbs was the ish, so I'm using the potty\nEvery time I listen to the disc, it go inside my iPod-y\nYou kidding me, you got me? You reading me, you copy?\nThese guys like fax machines, they read me and copy\nBut the problem: they knock me, I'm untouchable\nUncrushable, keep from getting mad money\nI'm sorry\n\n[Chorus (2x)]\n\n[Outro: brandUn DeShay]\nI'm sorry\nCan I, can I\nCan I talk my ish again?\nFor real, though, like...\nThis, I don't know\nThe main thing that's killing me right now\nAs a fan, you know...\nCause, I don't know\nI'm trying to get to the, you know...\nWhere the spotlights at, the flashing lights and all that\nWhatever\nIt's not my goal, but...\nI guess that's the main thing\nThat I don't think people really should have, like, a main goal\nMe, personally, that's how I feel, IMO\nI'm just doing it because this is what my soul is telling me to do\nI mean, there's nothing else that I can see myself doing\nI love this, it's not work\nIt feels good\nLike, I'd rather do this than anything else in the world\nPeople doing this for money, but be kind of pissing me off\nEspecially when somebody like me is doing it because it's their passion...\nBut I digress\nBrandUn DeShay", "year": "2009-02-23", "album": "Volume: Two! For the Show"}], "artist": "Ace Hashimoto"}