{"artist": "Peewee Longway", "songs": [{"album": "The Blue M&M Vol 2 King Size", "title": "Longway", "image": "https://images.rapgenius.com/198b7ef98a37d893e2f7e5597128c805.740x740x1.jpg", "lyrics": "[Intro]\nI got Longway with me\nAnd we done ran that sack up crazy\nI need to see as I got you\nCause I done ran that sack up crazy\nFor her ring I bought her diamonds\n20 bands got me at your lady\nAnd if I'm lying then I'm flying\nI swear to god I done ran that sack up\nI got Longway with me\nAnd we done ran that sack up crazy\nI need to see as I got you\nCause I done ran that sack up crazy\nFor her ring I bought her diamonds\n20 bands got me at your lady\nAnd if I'm..\n\n[Hook]\nI got Longway with me\nAnd we done ran that sack up crazy\nI need to see as I got you\nCause I done ran that sack up crazy\nFor her ring I bought her diamonds\n20 bands got me at your lady\nIf I'm lying then I'm flying\nI swear to God I done ran that sack up crazy\n\n[Verse 1: Rich Homie Quan]\nLongway my brother\nI say blood couldn't make us closer\nDifferent daddy, different mothers\nIf I'm with him you know it's over\nThou shall ride for ya brother\nI mean protect him through whatever\nIf we don't win, we lose together\nMade it my oath, this shit forever\nI say I stretch my money the longway\nIf I need some lean, I'm calling Longway\nI got her holding me the strongway\nAnd everything I said true\nSo listen to what the song say, nigga!\n\n[Hook]\n\n[Bridge]\nWe done ran up, ran up, ran up, ran that sack up crazy\n(longway, longway, longway)\nWe done ran up, ran up\nWe done ran that sack crazy\n(longway, longway, longway) (2x)\n\n[Verse 2: Peewee Longway]\nI was schizo for them Benjamin's, they say I do the most\nDouble R with the big grill, I'm pulling up in the Ghost\nI got longway money, and a whole lot of rich homies\nSo lot of bands, thumbing through cash\nDouble down you know it's on me\n20 bands on your bitch, she wanted diamonds\nI bought her the rollie rollie\nFlooded her out with big gas, I got it out the Pyrex\nWhipping up the doughnut, the holey moley\nShe didn't know this, she kick it with a D-boy\nCall rich homie, we kick it Bruce Leeroy\nSo many bands stuffed in my pants\nRunning through the weed, feed me, Seymour\nI running the sack up crazy (too cray, too cray, too cray!)\nI'm running the sack up crazy (bam! bam! bam! bam! bam!)\nI'm flying out to the bay, (outta here! outta here! outta here! Gone!)\nThose are the risks that I take!\n\n[Hook + Bridge]", "year": "2015-02-21"}]}