{"artist": "ILL BILL", "songs": [{"title": "Antron Singleton", "lyrics": "[SAMPLE: Attorney Milton Grimes]\n\"I don’t think in his 26 years he’s ever... Indicated a propensity to eat people, or do the things that he did to this young lady. This young man, is walking down the street, two o'clock in the afternoon, butt naked. And blood is all over his face, blood is on his arms, and his hands, his chest.\"\n\n[FOX News Interviewer]\n\"Do you know that you where, um, you were actually chewing on her flesh allegedly when the cops came?\"\n\n[Antron Singleton aka Big Lurch]\n\"I mean, all I can remember, you know that the world was going to end, and I had to find the devil and kill the devil before the world ended.\"\n\n[Verse 1: ILL Bill]\nWould you ever have thought that a rapper could cannibalize you?\nAngel dust is a hell of a buzz, it'd take your mind through\nThe nine Luciferian planes\nYou could stick a pineapple up the ass of the Aryan race\nI'm the sorcerer supreme, Emperor of (box locals?)\nRazor dance on your face, I make the eyes vocal\nYOLO, make my ice-pick do the Pogo\nHomie, you get barbecued like pirogi\nCut off your fucking head, hang you on my wall like a trophy\nCoka Nostra like macho men posted with Oakley's\nGorilla goons, bulletproof few cars\n[?] cop shoot cop for fun coupons\nPiss on thousand-dollar lesbians\nMy shooters are killing everything, I hire Chechyans\nServing splattered, silver platters of people\nMurder [?], witness the madness and evil\n\n[SAMPLE: Attorney Milton Grimes]\n\"This drug is not a play thing, it’s not a beer, it’s not a Marijuana cigarette. This Is something so mind-altering, that it will make you a cannibal or a beast.\"\n\n[Verse 2: Goretex]\nPop the choppers heavy\nGot the white cookies 'cause it's customary\nAcid ceremonies got that Jerry laboratory steri'\n8 balls like Tatum O'Neal, mixed in with matzo meal\nMausoleum drama, you get dug up like a poppy field\nDesert heavy-metal shells\nThrashers rock Gazelles\nAyatollah pot, cocaina, helicopter crew (Krell?)\nJeff Walker med students\nGhoulish, another deli shooter\nCemetery dips, no lips, just respect the shooters\nGet your paper Paul Newman, Propofol protocol\nI keep bitches around that look like Rollergirl\nI'm like Antron when I feast on dead space\nA rib-cage, refrigerator, arms and slit face\nInverted reverend, vomit on the host of heaven\nSeventh Roman shepherds\nManischewitz and clerics and Charlie's resurrection\nYou on me like Spicoli on jelly since I was embryonic\nTake this chalice, drink from my veins\nThe pain is cosmic", "image": "https://images.genius.com/80a603727b85f51760c599f962f6b88c.1000x1000x1.jpg", "album": "Cannibal Hulk", "year": "2019-03-29"}]}