{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "Product of the 80's", "title": "Am I Crazy?", "image": "https://images.genius.com/eaab6f49e8becaf7dff85596621575c0.700x700x1.jpg", "lyrics": "Yeah...\n\n[Verse 1: Prodigy]\nAttack of the thugs\nMy thuns come through with bundles of drugs\nThe Hip-Hop cops, just let us do us\nIf we beat a nigga ass, they would just watch\nJust as long as we not firing gunshots\nGuilty thugs rush your door, get everybody in\nBecause they stunting with the passes and I can control it\nWe smoke the whole club out, me and the dum-outs\nMazaradi Fox and my niggas from OV\nThat's Queensbridge, Jamaica and Far Rock\nThat's power in the streets you can't stop\nWith jail bars, and thick cement walls\nLike you can murder people, what you gonna do at all?\nThe rest of the hundred forty three thousand\nNine hundred ninety nine niggas wildin'\nI had a dream when I was nine about martial law\nI saw global police, am I crazy God?\n\n[Hook x2]\n(Sometimes I wonder...)\nAm I crazy yall'?\n(Crazy, crazy,crazy)\nAm I crazy God?\nGod please show me the sign, if I'm not crazy\n\n[Verse 2: Prodigy]\nI'm cracking the benevolent\nMachine guns and tanks\nTo come inside your party with a fucking AK\nAnd we just chilling, we just want a few drinks\nAnd get a few bunnies to hop back to the place\nIt's not a problem if that's what it is\nBut if it is a problem then it is what it is\nAnd we handle that accordingly, see you ignoring me\nI'm gonna laugh at you when you can't stop your arteries\nFrom bleeding, see that's what you get\nSo what if that nigga die, he wasn't innocent\nAnd if he was, he was wrong place wrong time\nIt's on me I pay for it in my next lifetime\nFor right now, this is how it's going down\nYou fuck around you lay around, moving your bowels\nThis nigga mistook me for some type of coward, a fraud\nNow look at him, crazy soft, am I crazy yall'?\n\n[Hook x2]\n\n[Verse 3: Prodigy]\nAnd then it happen, at three thirty three\nA big fire in the sky in Queens\nI almost crashed my car, on the L I E\nGodfather and Ty max was both sleep\nIt wasn't meant for them to see\nNah, the sign was for me\nTo let me know I'm not bugging\nThis shit real, if you do the research you will see that it's real\nMy nigga E Money Bags R.I.P\nHe told me back in ninety nine this was gonna be\nWe both tried to tell Nas but Nas was doing him\nHis little brother Jungle was the only one that listened\n(Yup) Jay-Z and Jaz-O know\nJay-Z chose to ride with the other side though\nThe math all add up, you can check it out\nI told you, me and Pac would've worked it all out\nBecause Majestry and Stretch would've dead that now\nAnd we would've all been brainstorming wow\nImagine life with an army like that right now\nThat's what I'm talking about, that's real power\n50 Cent my nigga because he know what's up\nIlla you my nigga tell me, I'm crazy huh?\n\n[Hook x2]", "year": null}]}