{"artist": "Cappadonna", "songs": [{"title": "Blood Brothers", "album": "The Struggle", "year": "2003-10-23", "image": "https://images.genius.com/f7a7e9bd3d16cfdfd266ae989d07c7b8.500x500x1.jpg", "lyrics": "[Intro: Cappadonna & Lounge Mode]\nBlood Brothers!\nBlood Brothers! Suuu!\nBlood Brothers! (Staten Island niggas)\nBlood Brothers!\n\n[Verse 1: Cappadonna]\nAll y'all hatin' ass MC's Run 4 Cover\nLong live Cappadon' that's word to mother\nI'm a Staten Island slike nigga straight from the gutters\nAnd every time you see me, I always got the butters\nAnd the fat chick on the low, ready to flow\nI carry guns, cracks, ounces of blow\nTravel across the globe, show after show\nWe fuckin' ho's all night, that's the goal\nAnd there's a bunch of y'all niggas that's feelin' the O\nBut do I give a shit about y'all? I don't think so\nI clap one of y'all niggas and leave you flat\nAnd the rest of y'all bitch ass niggas'll fall back\nIt's the C-to the A-P in ya mouth\nCold stab y'all niggas, what the fuck y'all talkin' about?\n\n[Chorus: Cappadonna & Lounge Mode]\nBlood Brothers! Suuu!\nBlood Brothers! Suuu!\nBlood Brothers! Suuu!\nBlood Brothers! Suuu!\n\n[Interlude: Cappadonna]\nHomicide Hills, Staten Island\nThat's what it is\n\n[Verse 2: Lounge Mode]\nAiyo, Cap, what you speak about? Niggas still frontin'\nLike we ain't got shit to make a cat start runnin'\nWhat? We blood for life, we thug for life\nY'all remember in the crib when we bugged at night?\nMama Love always screamed on us\nAnd sometimes, not all the time, Daddy dropped CREAM on us\nMotherfuckers wan' get it gully back to back\nTake it back to eighty-six when we wrapped up crack\nAnd we ride together, rhyme together\nEat together, talk shit and sleep together\nIn the Hood we pack eat together\nWhat you think? Y'all niggas keep frontin' I'ma bleed ya leather\nL-O be blunt, speak twice, speak it up\nHow you feel about fam dogs sneakin' up?\n\n[Chorus: Cappadonna & Lounge Mode]\nBlood Brothers! Suuu!\nBlood Brothers! Suuu!\nBlood Brothers! Suuu!\nBlood Brothers! Suuu!\n\n[Verse 3: Cappadonna]\nWhat's wrong with y'all? I'ma sing a song for y'all\nPop off 'til I get along with y'all\nI'ma stay strong with y'all\nKnucklehead niggas, Shaolin volume two\nStuck the stacked knives, bigger than pistol\nPop the pistol at the police that's disturbin' the peace\nHard times on the block, guns and hair grease\nI'm just tryin' to eat, nigga, and stack cheddar\nI don't think I'm better, I'm just a true blue nigga\nBut the hood is redder\nKid the way I do things is my only vendetta\nOriginal Don Don, and jelly green Nike's on kid the green leather\nI ain't sweatin' shit for bringin' fam dogs together\nAnd my big dick go right in ya heffer\n\n[Chorus: Cappadonna & Lounge Mode]\nBlood Brothers! Suuu!\nBlood Brothers! Suuu!\nBlood Brothers! Suuu!\nBlood Brothers! Suuu!"}]}