{"songs": [{"album": "The Come Up Vol. 1 Mixtape", "year": "2007-05-04", "title": "College Boy", "image": "https://images.genius.com/bda451f623edd51bf1dcc17564bd3e70.501x501x1.jpg", "lyrics": "[Verse 1]\nIt's hard to picture a nigga not getting money\nJ. Cole living bummy? Hahaha that shit is funny\nI’m focused on that cash, I just laugh at them bastards\nEligible bachelor, finna get my Bachelor’s\nAnd if this rap shit don’t work, I’m going for my Master’s\nStill scouting hoes on the first day of classes\nKeep up with the asses, keep up with the grades\nA nigga straight A’s like the Braves\nShe got me in her dorm room, talking bout her room ain’t clean\nAnd she wanna fuck, but wait until her roommate leaves\nNow I could give a damn if her roommate seeing\nCuz if the girl get excited, she’s invited. (haha)\n\n[Hook]\nIf it's alright with you, yea, shit, then it's alright with me\nIf it's alright with you baby girl, then it's alright with me, (uh)\nAnd if it's alright with you shawty, then it's alright with me\nHey and if it's alright with you, (yea, yea) then shit, it's alright with me\n\n[Verse 2]\nYeah, uh, I hate to brag, well naw, I don’t, the big man on campus\nI gotta chick in every class that give a nigga glances\nAnd if your ass is dumb you won’t even get a chance\nCuz I gotta chick in every class that give a nigga answers, yea\nAnd if I hit ya shorty, keep it on the low\nThis shit just like highschool, people wanna know\nI see you haters mad, but I ain’t mad at y’all niggas\nWe get ass like them basketball niggas, I’m ballin’\nGot a sidekick so them hoes don’t be callin’!\nHit me on aim, ay what’s your screen name?\nWhen I start typing in, a nigga’s got some mean game, yea\nAnd when I whip it out, shit she gonna think she seeing things, but\nBack in Carolina I miss home badly, (yea)\nIt’s funny hoes I couldn’t have is tryna bag me\nBut I’m in the Jeep with this freaky ass Aggy\nShe said she want it from the back, gladly\n\n[Hook]\nIf it's alright with you, yea, shit, then it's alright with me\nIf it's alright with you baby girl, then it's alright with me, (uh)\nAnd if it's alright with you shawty, then it's alright with me\nHey and if it's alright with you, (yea, yea) then shit, it's alright with me\n\n[Verse 3]\nI’m skipping class just to get some ass, living fast\nAnd college with no sleep nigga, my jabs quick as Zab's\nSo kill that old college gangsta shit we dont believe\nYou mad cuz your girl on Facebook poking me, so uh\nYou know the G, I hit her up like “Hello Elle\nI see you looking right the other day, LOL\nSo, what’s good with you?”\nShe hit me right back like “Shit, what’s good with you?”\nYou know I like that, so of course I write back\nHit her with some nice chat\nSame night she in my room, lights off I strike that\nYea I put game right, but that’s your wife, nigga take her\nI bust then I kick her ass out to write a paper, yea (hahaha)\nA nigga doing homework, drinking like a fish\nIt ain’t a weekend that I’m sober\nFighting hangovers on my way to my internship\nAnd I forgot to study for my midterm, shit!\n\n[Outro]\nHahahaha, wooo!\nAy, this is straight through, nigga\nNo, no fucking, no double takes\nThis is straight through the whole shit nigga\nCheck it out man, tryna tell y’all niggas man\nCollege is a good look\nA real good look, my nigga\nFor more reasons than one, man\nKnow they try to keep us out of that shit though\nThat shit like extra expensive\nI got scholarships though, so you know I’m not sweating that\nI feel for my niggas that couldn’t make it man\nAy Mike we in there baby, hahaah\nAy they can’t, they can’t keep us out the G my nigga, you know\nThen we all make it, nah, we ain’t all make it\nShout out to my niggas, man\nAll my niggas, yo\nWhether you graduated or not\nWhether you made it to college or not, nigga\nFayettenam, yeah, yeah\nClass of 2007 man\nHolla at me\nI’m going to grad school though, you know?"}], "artist": "J. Cole"}