{"songs": [{"title": "Welcome to Dystopia", "lyrics": "Conform x15\n\n[Verse 1]\nIt's bigger than your local colloquium\nIn a world that is dystopian\nKid's aren't born in fallopians\nThey're grown in tubes and inserted growth in them\nDust is choking them\nBut this ain't the type of pollution we place in the ocean\nIt's apathy, stench we can't quench\nDon't matter who inhabits the bench\nOr wig or gown, hammer or crown, oval or down\nJokes on us, we're not even frowning\nMuch less pissed off\nWe're switched off\nSmiling villany, the wickedest tyranny\nIs the one that says fuck you so nice\nYou say thanks, and shake hands\nSay he's your man, forget all your plans\nReach your hand out you see your in bondage\nThe idea of beauty is blondeness and other such nonsense\nWhat our response is?\nConform and amputate conscience\n\n[Hook] x 4\nConform. Obey\nTransform. Sleep easy\n\n[Verse 2]\nAh, that good old human conditioning\nEver since days of the pyramids\nMake us invalid, which means invalid\nWrestle with things we can't manage\nLike peace and equality\nWhich minority is the authority?\nWhoever has property, it's all idolatry\nEven if you have no image of God, do you follow me?\nDo we not all worship money?\nWhen you think about it it's quite funny\nCan't eat money, can't breathe money\nCan't inject it and kill disease money\nBut we pray at it all till we're guns and tanks\nAnd offer the money god a million sacraficial lambs\nWho's the priest in charge of sacraficial plans?\nLet us pray and hold hands\nWar is peace - ignorance strength - freedom is slavery x3\nNot only do we believe that creed\nWe hold it deep and praise it as bravery\nYeah\nAlong with the vision and difference\nSo we can maintain the belligerence\nTo their pain, feel no shame\nIt's all just stages in a video game\nThat our kids play kill, kill, kill\nDeath is such a thrill, thrill, thrill\nSwallow junk, still feel ill\nTake blue pill, pill, pill\n\n[Hook] x3\n\n[Verse 3]\nSometimes I feel like I'm losing my mind\nI do beliee our nature's kind\nJust confused and we're so far gone\nGot no clue how to right these wrongs\nSo we bury our head in the sand or the desk\nAnywhere but inside of our flesh\nIf I looked at my self - I would see I am the enemy\nI am not honest nor kind nor caring nor sharing\nOr any of the many thing that I pretend to be\nI'm selfish and arrogant, and obedient\nFollow truth only when it's convenient\nAccept laws that I know that decieve me\nSo I can sleep in my bed easy\nDon't blame governments, they are just us\nIf they are corrupt, then we are corrupt\nLook back through history\nWhat makes you think that we would act differently?\nIf we were in power\nWe would devourer whoever the underclass were like cowards\nThe question is, is this inevitable?\nIs there good or evil?\nIs it terrible?\nOr just survival?\nSome say it's overspill from days when we were tribal\nI don't buy that I think you will find that\nThat's an excuse if we just don't buy facts\nEverything we really need to survive actually makes us feel good inside\nSex feels good, food feels good\nDamn, even taking a pill feels good!\nSo if war and hate were our natural causes\nWhy would we need conditioning for it?\nBut I ain't gonna forfeit my privilliges\nNow I'll get back in line and follow my orders", "year": null, "album": "DoubleThink", "image": "https://images.genius.com/1d372a1e5ce6759370053ad0e1be955f.1000x1000x1.jpg"}], "artist": "Akala"}