{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Intro]\nYeah..\nYou know, 1990 begins a new decade\nSince I got paid and blew up like a live grenade\nIt's been a three, four year stretch\nAnd I'd just like to thank all of you\nMmm..\nAnd this goes to everybody in the entire world\nThat means the United States, overseas in the U.K\nWay in Brazil, Japan, Africa, and everywhere else\nI just wanna dedicate this one to you\n\n[Verse 1]\nHere's another groove that I'm bringin' to you kind of mellow\nAnd I just want to say hello\nOr should I say peace as I start to release\nThe poetry that don't cease, never the least\nYour feet got to shuffle as I put the muscle in the groove\n'Cause I'm so smooth\nOnce you experience a whole Kane rhyme\nI'll have you dancin' in a Soul Train line\nPick up the pace and get a taste of B-I-G\nD-A-double-D-Y Kane in the place\nDoin' the job how you want it done\nWith lyrics that's bright as the mornin' sun\nSo, grab one line, rub it on your face like sunshine\nAnd everythin' else'll combine\nThis is that particular beat\nFor all the fellows feelin' mellow to pump in the Jeep\nUhh, also for every girly\nTo shamiyo, shamago like Laverne and Shirley\nHuh, now, wait, now, wait, now, wait a minute\nUhh! Now, check this\nI wanna talk about peace and unity and love\nNot one, but all of the above\nComin' together like keys on a piano\nBlack and white to unite and oh man, oh man\nWhat joy do we find?\nHard for me to say it sometimes\n\n[Verse 2]\nNothin' can stop this flow so back up off me\nHold your cup of Folgers, wake up and smell the coffee\nBig Daddy Kane’s the name of the one and only\nYou wanna say it three times like Tony! Toni! Toné!\nIt’s not an avocation of being the best\nBut I at least deserve a cape or an S on my chest\nQuote: “The blacker the berry, the sweeter the juice”\nMmm, they shoulda never turned me loose\n'Cause I’m a true livin' Casanova\nSmooth and stylistic and suave bowler\nAnd they say nasty couldn’t even tell it\n'Cause when I’m with girls, I get Funkadelic\nSo, ladies stand still as I start to fulfill\nJust chill, the scenery’s about to get ill\nThe places I feel to give your body a thrill\nAs I rub you the right way like Johnny Gill\nAnd competition take notes from a champ\nYou once had this but all your girls broke camp\nAnd now you wanna diss\nYou swung but you missed\nSo, now, tip your hat and bow down to this\nWho? The father of civilization\nWith knowledge of self under any situation\nThe F to the I to the V to the E\nThe P-E-R-C-E-N-T\nThat means an Asiatic king just rocked it\nAnd left your mouth wet with a taste of chocolate\nThat’s right, y'all, and that’s right, y'all\nMy rhymes freshen the air like Lysol\nGirls, uh, right there, yeah, right there\n\n[Production by Big Daddy Kane]", "image": "https://images.genius.com/9018e5e448f4d08b6115d24de00e8af0.1000x1000x1.jpg", "year": "1990-10-30", "title": "Taste of Chocolate Intro", "album": "Taste of Chocolate"}]}