{"songs": [{"year": "2005-10-18", "image": "https://images.genius.com/15624b4dce6b2d79919cdb6d2afbada5.325x325x1.jpg", "title": "When You Come Home", "album": "The Black Rob Report", "lyrics": "[Verse 1: Black Rob]\nI remember that day clear, the month and the year\nI was hustlin, '89 Downtown in Times Square\nWith ten niggas, but you recognized the Commander\nYou went to school and worked part time at Alexander [???]\nChain [???] and kiss on the cheeks\nI said some slick shit like, 'we can do this on a beach'\nYou laughed, straight teeth, mines was all crooky\nYou walked away but kept turning back, laughin and lookin\nI'm gassed, I said Pity she ain't want me to leave\nThen she the one, I also waiting to see\nNot called you, you called me we on the same tune\nI'm Uptown me and June in the game room\nI was glad to hear your voice, you choice\nBrown sugar, 5'5'' a body was moist\nAnd on top at all, personalities to match\nHad a lot in common, yeah we still took it from scratch\n\n[Hook: Rhea]\nFrom the streets, to the Pen, lovers and friends\nI'mma hold you down, I'll be here when you come home\nI'll be waiting for you\nI'll be waiting for you when you come home\nFrom the streets, to the Pen, lovers and friends\nI'mma hold you down, I'll be here when you come home\nI'll be waiting for you (you know)\nI'll be waiting for you when you come home\n\n[Verse 2: Black Rob]\nYou was there when I signed with Diddy\nYou was there when [???] hit the city\nThere when I cried [???]\nYour advice was like [???] from your titties\nSo [???], after a while I started flourishing\nAnd just to think that you was sitting down\nHaving a couple of drinks, me and you on the [???]\nI'm calling quits, cheatin, no matter how you call that shit\nMy stomach hurtin now, on the pit\nAnd that's nonsense, you told you I was fuckin on tour\nNot true, [???]\nYou know what, boo? I think I showed you too much feelings\nI ain't believe when he said you fucked [???] from the building\nIt's cool-o, I let you kick me in my culo\nI ain't coming back now matter how much you scream [???]\nI spent a lot of dough on you, I put jewelery to goal on you\nAnd that's how this all you gon do? Yo\n\n[Hook: Rhea]\nFrom the streets, to the Pen, lovers and friends\nI'mma hold you down, I'll be here when you come home\nI'll be waiting for you\nI'll be waiting for you when you come home\nFrom the streets, to the Pen, lovers and friends\nI'mma hold you down, I'll be here when you come home\nI'll be waiting for you (you know)\nI'll be waiting for you when you come home\n\n[Verse 3: Black Rob]\nI admit now, time is hard\nFucked out, I was locked up, you [???]\nWe missed each other, guess it's so used to you\nEverything about the shit that we used to do\nIt's spice you cookin, you give a nigga real good lovin and\nThat's why we still snap back, like a rubberband\nAnother man can't do what I do, I got you\nI said the sky is blue and is blue\nYou fam, you know was better enough you fucked with Scram\nGot you actin up for [???], smuggling grams\nWhat you want, ma? Ha, the house or the car?\nYeah I know I'm locked down, but I'm still B.R\nAnd love, before a minute there I thought you lost me\nI got three and a halfin, happy home shortly\nYou probably thinkin I'm just poppin shit\nLike some nigga get home and do [???]\n\n[Hook: Rhea]\nFrom the streets, to the Pen, lovers and friends\nI'mma hold you down, I'll be here when you come home\nI'll be waiting for you\nI'll be waiting for you when you come home\nFrom the streets, to the Pen, lovers and friends\nI'mma hold you down, I'll be here when you come home\nI'll be waiting for you (you know)\nI'll be waiting for you when you come home\n\n[Verse 4: Black Rob]\nMa, listen I gave you respect because you earned it\nYou still here fucking with me, could [???] you see?\nMa, soon as I touch I'm getting money soon\nWe gon do the engagement, then the Honeymoon\nI'm feeling you, you coming or what?\nWhat's crazy, me standing here spilling my guts\nHow dreams ain't gon turn to dust?\nLong is all about me, you and the all outta us\n\n[Hook: Rhea]\nFrom the streets, to the Pen, lovers and friends\nI'mma hold you down, I'll be here when you come home\nI'll be waiting for you\nI'll be waiting for you when you come home\nFrom the streets, to the Pen, lovers and friends\nI'mma hold you down, I'll be here when you come home\nI'll be waiting for you (you know)\nI'll be waiting for you when you come home"}], "artist": "Black Rob"}