{"songs": [{"year": "1999-11-30", "album": "Amplified", "image": "https://images.genius.com/6e84984f4b00329695a16521d47f4aca.300x300x1.jpg", "title": "Do It", "lyrics": "[Jessica Rivera]\n\"Hmmm, so you're the one they're talkin' about\nLet me see if this is real.\"\n\n[Q-Tip]\nWhen I do it, eyes lookin' at me when the\nMusic should be the only thing you see\nIt's the score to a cinematic oddity\nLettin' off shit, hit your ass repeatedly\nAcrobatic, wha I'll pull something through your chest-piece\nBefore she came home, pit-stopped breast be\nWatched the movie, and smoked a philly and\nTook a hit of D. She actin' all silly and...\nI pull the brothers in depressed situations\nWhen the thang hit the 'phere, we risin' up to the occassion\nYou're killin' me wit' petty, little rap beef\n'No fingerprints' is how my expert-ass be\nWhile I'm at it, I'mma stand my ground righthere\nSpotlight, where the chicks is found\nYou see this little-ass club we in? Yo, it's\nMine, intertwine, wink your bun, do it to the drum\n\n[Jessica Rivera]\n\"Yeah, that's alright\nBut I know you can do better than that!\nC'mon, come harder!\"\n\n[Q-Tip]\nAiiight then\nI guess we stand the same ground, same\nPage and wanna freak shit\nI wanna eat it, watch you beat it, cum reaal hard than repeatin' Yo!\nThe frivolous rap song he rap about is no good\nRemove all the crap about my dogs is all in for the national\nNo passion, then I guess they be cashin' out\nI keep my eyes on things and\nI keep my shine on BLING!\nMy peoples ain't nothin' to toy wit'\nProfessional, leavin' a boy stiff\nYou doin' all while you're really talkin'\nYou need to get gun or get walkin'\nThis greedy-ass country we in? I guess it's\nMine, intertwine, wink ya bun, do it to the drum\n\n[Chorus: Jessica Rivera & Q-Tip] (3x)\nWhat 'chu really wanna do?\nI wanna really do it right\nWhat 'chu really wanna do?\nGrab ya hands, hug ya tight\nFor real?\nFor real\nWell, what 'chu feel?\nWell, what 'chu feel?\nWe can...\nDo it. Do it. Do it\nDo it. Do it. Uh\n\n\nDo it. Do it\nDo it. Do it\nDo it. Do it\nDo it. Do it. Do it. Do it\n\n[Q-Tip]\n\"So, I was wondering what would happen...how would you feel if\nI...came inside your bedroom, I took off all your clothes, and\nTook all mines off. And, uh, I got the portable DVD thing...\nAnd...got the...right connections. I stick it in and put on top\nYour spa basing to get you all fucked up over the bounce. And\nThen, you can take it off and then...\""}], "artist": "Q-Tip"}