{"songs": [{"title": "Queen", "album": "Debbie", "year": "2016-07-15", "image": "https://images.genius.com/797f7db266863fadcf70bc9358166861.1000x1000x1.jpg", "lyrics": "[Verse 1]\nLivin' my life like it's golden\nLook at my wrist and that motherfucker frozen\nGot my city on, now that mothefucker's rollin'\nLook at my pockets, motherfucker's on swollen, bulging\nLook at my motherfuckin' time, different days\nSame gang, G's up, hoes down, let 'em drown\n'Cause whatever we do, we do it flawless\nBitch, I'm going big, as big as Christopher Wallace\n\n[Hook]\nBitch, I stay high, high as fuck\nRoll another backwood fired up\nI'm high, uh, what's up?\nGrew up in the city and they ride with us\n'Cause I'm the queen\nI'm the queen, I'm the queen\nI'm the queen, I'm the queen\nWhat'chu mean, what'chu mean, hoe?\nI'm the queen, I'm the queen\nI'm the queen, I'm the queen\nWhat'chu mean, what'chu mean, hoe?\n\n[Verse 2]\nNew money, same fuckin' shit, tho\nNothin' changed lately, lane in the 6 fo\nQueen shit, I ain't playin' with no bitch\nNo fatty 'cause I big blow, you know how that shit go\nYeah buddy, staight up of that gutta gutta\nIt's gettin' ratchet in this motherfucker\nA lotta talk but I know these bitches really love us undercover\nFuck the game, I don't need a rubber\nBitch, I'm on your shit with my Polo fit on\nTurned off bitches, how you know your shit's on\nI ain't got time for what broke ass bitch on\nI 'on't fuck with you haters, treat a bitch like Big Sean\nI 'on't give a fuck, I just get a blunt\nThen I lit it up, I'm just turnin' up, livin' how I want, hoe\nI 'on't give a fuck, get a double cup\nThen I sip it up, boss bitch, what the fuck I gotta [?]\n\n[Hook]\nBitch, I stay high, high as fuck\nRoll another backwood fired up\nI'm high, uh, what's up?\nGrew up in the city and they ride with us\n'Cause I'm the queen\nI'm the queen, I'm the queen\nI'm the queen, I'm the queen\nWhat'chu mean, what'chu mean, hoe?\nI'm the queen, I'm the queen\nI'm the queen, I'm the queen\nWhat'chu mean, what'chu mean, hoe?\n\n[Verse 3]\nIn the function and you know what's up\nBottles by the dozen, I don't need a cup\nHaters on the menu, watch me eat 'em up\nLookin' at my circle, all I need is us\nAll we do is get sprayed, bitch, hit the snack tray\nTwenty bad bitches, and her roaches in my ash tray\nBlunts burn slow, money get it in the fast way\nAll I know is hustle, I'ma do it till my last day\nBitch I run my shit, like a boss ass bitch would\nWay too cute to talk shit, spit this good\nI ain't got time for what a broke ass bitch say\nI don't fuck with you haters, treat a bitch like Kanye\nI don't give a fuck, I just get a blunt, then I split it up\nI'm just turning up, living how I want hoe\nI don't give a fuck get a double cup, then I sip it up\nBoss bitch tired of fucking with you dumb hoes\n\n[Hook]\nBitch, I stay high, high as fuck\nRoll another backwood fired up\nI'm high, uh, what's up?\nGrew up in the city and they ride with us\n'Cause I'm the queen\nI'm the queen, I'm the queen\nI'm the queen, I'm the queen\nWhat'chu mean, what'chu mean, hoe?\nI'm the queen, I'm the queen\nI'm the queen, I'm the queen\nWhat'chu mean, what'chu mean, hoe?"}], "artist": "Lil Debbie"}