{"artist": "Fabolous", "songs": [{"year": null, "album": "Street Dreams", "image": "https://images.genius.com/4b857fc26420a638d0085145c7bcd7f3.1000x1000x1.jpg", "lyrics": "[Produced by Omen]\n\nYou know what?\nEverybody goes through some changes in life\nSome people change for the better, some people change for the worse\nBut umm, some people need to make that change\nYou know what I mean? Change is good sometimes. You know?\n\n[Verse 1]\nWhy would I change? I ain't never slide down a bat pole\nEven though I'm certified over plat's sold\nThey say I'm different 'cuz I ride in a plat. Rolls\nBut every time, we gotta ride don't this cat roll?\nI never snitch, and go and hide in a rat hole\nAnd I ain't givin' you nothing besides what this gat hold\nNo pride, I ain't that old\nCut off a few, but kept a few girls I decide like I'm Matt Knowles\nIt probably don't seem like a struggle\nBut I used to dream that this thug'll balance beams just to smuggle\nIt's funny same girls that didn't seem like they'd love you\nIs beggin'for your autographs ands screamin' to hug you\nIt's crazy, same dudes that seem like they thug you\nIs prayin' on your downfall, schemin' to mug you\nAnd people that didn't give a fuck, is dreamin' to bug you\nAnd goin through' extreme's just to plug you, who really changed?\n\n[Hook]\nThis game ain't change me, so don't let it change you\nIf you've been real with me, I'm still real with you\nIf you got love for me, I still got love for you\nIf you down for me, then I'm still down for you\nIf you don't fuck with me, then I don't fuck with you\nIf you ain't cool with me, then I ain't cool with you\nIf you won't ride with me, then I won't ride for you\nThis game ain't change me, don't let it change you\n\n[Verse 2]\nWhy would I change? I didn't step out of Superman's phone booth\nTo remind where I'm from, I look at my own tooth\nI'm speakin' the known truth\nI ain't been living the same, since I moved under Silvia Rone's roof\nWhy would I feel like I'm a stranger?\nAnd why should I feel like I'm in danger?\nAnd I'm grindin' 'till I'm right\nWhether it's on the streets, or online tryna climb sites\nI ain't blind from the limelite\nI had my mind and my rhymes right, and signed when the time's right\nPeople shouldn't be hateful, they should be grateful\nBut fuck it, I guess I gotta keep my three eight full\nI'm playin, the game, like I'm, supposed\nStayin, the same, like I'm, supposed\nGhetto Fab in da house, hip hop hustler\nOne million customers, and I still bust at ya\n\n[Hook]\n\n[Verse 3]\nWhy would I change when I get green like the Incredible Hulk?\nI've chilled with the richest people to the ghettoest folks\nKnown a few ????? and met a few locs\nMade a few comments, and said a few jokes\nBut it's gettin' me sick, someone prescribe me some medicine\nBefore the fame, the vibe was way better then\nSome have even became rivals instead of friends\nOnly two become liable for settlements\nI grew up watchin the Bed-Stuyvesant veterans\nNow they hate to see a nigga drivin' the better Benz\nThat's why the clubs be, deprivin' to let us in\nThey know the family bring knives and barettas in\nI'm thankful for being allowed, fans for being the crowd\nHow could my head be in the clouds?\nIt's strange, what the fame'll do\nBut you know what? The only one who seen the change from the fame is you\n\n[Hook]\n\nI'm the same nigga man\nSame nigga, that ridin' with you\nNiggas that's fuckin' with you\nI'm still fuckin' with you niggas\nThe same nigga, these ho's ain't like\nNow they on my dick right? Haha... shit is crazy\nDon't let this game change you nigga...", "title": "Change You or Change Me"}]}