{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/85f538a44febd6cf0a31867a37173978.432x432x1.jpg", "title": "4th of July", "year": "2017-07-04", "album": null, "lyrics": "[Talking]\nSee there's pussy niggas everywhere\nGutter niggas everywhere\nYou niggas buy that shit or whatever\nYall already know niggas about they issue\n\n[Verse]\nI was fucking with you strong, what's the issue?\nWhat you wanted? A lil song or a picture?\nYou say somebody hit your phone like it's pressure\nSo we'll just fuck it dog, I thought that we was better\nWhat you wanted? A lil shoutout, a lil publicity?\nIf you asked me i would've did it with no resistance\nYou made a dis song and now you in your feelings\nRunning around telling niggas, they wouldn't listen\nYea you niggas bout that life, but we more realer\nEverytime you pull a play, we pull one bigger\nYea you niggas bout that too, but we some lunatics\nMan you niggas should've thought before you do the shit\nTried to shoot a video on my corner but we shoot the shit\nIf you a bitch now tell the media that you a bitch\nI don't tweet, I tell that nigga pull up bring some food\nAll my zombies in the projects will devour you\nAnd it's easy to keep the tool but you don't know how to move\nAnd you niggas ain't strategic, and you moving loose\nMy nigga caught him at the wrong time with the .22\nGo this a .22\nI ain't specifically talkin bout you Heffer\nYou niggas ain't got no balls, ain't got no testicles\nYou niggas pussy, ain't got no balls ain't got no pelvis\nCuz if you was a man you wouldn't be jealous\nYall done brought it to a whole other level\nNiggas getting kidnapped and getting let go\nNiggas only did that just to scare you\nTo tell the truth if I was there you would've been dead bro\nAnd I feel like it's a blessing I'm on house arrest bro\nCuz you niggas already know a nigga hit first\nMy cousin just got hit up and it fucked my head up\nI was ready to rock and roll, come find my heavy metal\nI ask my people \"why you move my gun when I went to jail for?\"\nThis house arrest might be a blessing, might be better\nWhat the hell happened to that 187\nOn another note you niggas should've know better\nNiggas know we ain't the niggas to be fucked with\nBut you niggas out here smoking on that fuck shit\nOh you know we them niggas from the project\nOh you know we them niggas we them zombies\nAnd you know we them niggas boy we about it\nAnd you niggas gookin' right now smokin mollies\nIf yall wasn't smoking mollies y'all would know the deal\nHow you going against the will\nAnd I don't call deuces, I call .30s\nAnd I can't believe Bushawn that nigga dirty\nYea you bout that shit you live it but you workin\nI don't care what you did I tell a nigga you workin\nI keep having visions about these niggas getting wet up\nHow the hell you can't tell me bout the set up?\nAnd I don't cop no pleas unless I'm jammed up\nThe only way you talk to me is about some cheddar\nI'm swimming in the pool with my beretta\nI been learning moves dancing with the devil\nDamn I heard you ain't wanna let the Draco spray\nWhy the hell you even got it anyway?\nI don't even know why niggas gotta be\nYou should've came with bloods you just wannabe\nHow you rhyme with a nigga who stripped you out your jeans?\nMan I ain't forgivin a nigga who had you on your knees\n\n[Verse-YoungBoy Never Broke Again]\nEverybody under disguise man they scheming\nThese hoes will set you up\nTell you they love you they don't mean it\nFull of syrup, bitch I'm leaning\nSmoking dope with the demon\nSend my younging at your little nigga give me a reason\nI heard a nigga say they turned me up, get off a nigga dick\nDon't like the fact that now I'm blowing up, nigga get on your shit\nI got turned on next Montana ain't nobody give me shit\nBitch I bought my own car, started my own dealership\nCruising down Florida with my burner leaning faded\nTo tell the truth, I don't know why these niggas hating\nI stay with the 38, I won't let nobody take me\n& I know these niggas plotting, so I don't smile up in they faces"}]}