{"songs": [{"title": "Any Given Friday", "image": "https://images.genius.com/e8332ec55c5b62595f4d276fc1d954f3.500x500x1.jpg", "lyrics": "[Intro]\nYeah\nFuck this shit\nThis shit ain't going right\nI'm-a have to move like I used to move\nThis shit ain't cool\nYeah, you know what I'm talking about\nBack home, you know?\n\n[Verse 1: Brotha Lynch Hung]\nSpend money on drugs and drink, it's been funny out here\nYou looking for love? It ain't...it ain't sunny out here\nHit you in the tummy out here, that's how I live life\nNever enjoying the cash flow but now my kids might\nThat's how I'm doing this, this shit ain't for you\nFuck the family shit, motherfucker, because you're in it for you, right?\nI used to be in it to do right, but now I'm-a do it like I used to\nBecause night-by-night, day-by-day, I tried to juice dudes\nAnd they got used to it, took a kindness for weakness\nBefore you met me, you niggas was heatless\nWith hella niggas to creep with, so you thought you was hard\nYou used to ride the bus, now you got you a car\nNow, you flex-flossing, you know how it is when you're bigger than the next\nYou be the money-making nigga with a vest, always in a mess\nBecause it's the sign of the times, telling me \"nigga, move on\"\nMy desire for music is too strong, I'm Mr. Fucking Do-Wrong\nIf I got to drop you, type shit, and I deal with it as it comes to me\nYou nitwit, I rip shit, just as quick as I get shit\nSlip shit all in the clips, this ain't no chunk-'em homie shit\n\n[Hook]\nOn any given Friday\nWhy they wanna test me on any Friday\nIt's meat fry day\nGot to have it my way\nI got my own recipe because niggas wanna mess with me\nYour chest will bleed now\n[x2]\n\n[Verse 2: Crookwood]\nI'm like a white blood cell when I'm not up in the blood stream\nMean mug me, until I hit you with the red beam\nFake-ass niggas be bumping their gums\nBut we don't do that punk-ass shit where we're from\nBecause snitches and fake bitches get more than stitches\nI got 16 switches for your motherfucking britches\nI'm ghetto as fuck, I eat off of broken dishes\nI'm not a genie but I can grant your ass three wishes\nI flow through traffic like blood through veins\nSo, all that internet gang-bang shit mean a motherfucking thing\nTrying to gain fame off the next nigga name\nRather write it on a bullet and put it in your brain\nNow you know Phonk Beta gets all up in your pores\nStop fronting in your bricks while saying it's yours\nNext time you see me, punk, you better bring your heater\nNever really like your ass even back on Manzanita\n\n[Hook]\n[x4]", "year": "2003-06-10", "album": "Lynch By Inch: Suicide Note"}], "artist": "Brotha Lynch Hung"}