{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/699f98c18a6750dc382068fbcdbc0236.1000x1000x1.jpg", "title": "Burn Baby Burn", "year": "2013-04-12", "album": "Indicud", "lyrics": "[Verse: Kid Cudi]\nElement of the surprise\nSuch a spectacular thing I cannot, lie\nSo many things people wanna limit you to be\nI show you a glimmer inside the spectrum of the wizard\nWell known as a getter and a nigga with a plan\nThe negative that come out they mouth, so sad\nWhen I smash wipe the smirk off their face, my bad\nWho bad? I am, my dad raised one hell of a man\nAt eleven I had to throw on the pants\nStill don't feel appreciated and not by my own fam\nAll good, I'll be tucked away in them shadows\nWorkin' in sweats solve the riddle and soon I'm ready for battle\nMove my fans with my love and they move me with theirs\nWe unified by the dark and middle fingers in air\nCome on who gon' go half on a zone\nOh, thought I would be done off the coke, no\nLet me tell you something ho\nBen said \"Everything that shine ain't gold.\"\nBeen skeetin' on pretty faces then my heart switched cold\nBeen the nigga sittin' in hell in fresh ass clothes\nI know what it feels like to have a broken nose\nAnd ain't nobody hit you in it\nIt's really cause that shit that you snorted and put all in it\nThat time you thought I was finished no I just experimented\nAnd it helped me adjust and be ok, with being demented\nBy the way nigga these cars ain't rented I give a fuck who sees\nSo I don't bother rollin' tinted look who the fuck it be\nThat skinny Cleveland niggie I stay reppin' my city bitch\nBeen smokin no jokin cudder’s had that itch\nSo I scratch, so please no more speculation bout that\n\n[Outro: Kid Cudi & King Chip]\nBurn baby, burn, truthfully and noted\nI’m back so please no more speculation ‘bout that\nBurn baby, burn, truthfully and noted\nI’m back, niggas think I’m livin life paranoid\n(Mothafuck that, man)\nAw, they got me twisted, they don’t know that boy\n(Mothafuck that, man)\nI’m just gettin busy killin it, gettin busy\n(Mothafuck them, man)\nI just wanna watch it burn, baby, burn\nNiggas think I’m living life paranoid\n(Mothafuck that, man)\nAw, they got me twisted, they don't know that boy\n(Mothafuck that, man)\nI’m just gettin busy killin it, I'm gettin busy\nNow it’s time to watch 'em burn baby, burn\nAhhh, my leg!"}]}