{"artist": "Cardi B", "songs": [{"title": "Cheap Ass Weave", "album": null, "year": "2015-12-15", "image": "https://images.rapgenius.com/9cec500bb4713e856fccb77e7e7cd9ac.630x630x1.png", "lyrics": "[Verse 1]\nThe nerve of you bitches\nLike, oh my God, I got no words for you bitches\nLike, who's really serving you bitches?\nI need some answers, I'm worried for bitches\nLike, this really absurd\nNo wonder these niggas stay curving you bitches\nDon't even take no more selfies\nThat weave don't even deserve any pictures\nLike, where did you buy that shit?\nWho really acknowledged it?\nWhat made you feel that you would be lit if you went and copped that shit?\nThey tell you ya look good?\nWasn't you iffy?\nOh, I know, they tell you that you get two bundles for fifty\nGirl, you ain't low\nI know how this go\nCheap shoes is okay, cheap dress is okay, but cheap weave is a \"no\"\nDon'tcha do it to yourself that's bad for your health\nDon't fuck up your flow\nTalk shit about me with ya dusty ass weave?\nNow you outta control\nI'm Cardi B, I come through and I kill everything, everything and that's a fact\nGot me on my hitman shit like brrap-brrap-brrap-brrap-brrap-brrap-brrap\nI'm fully reloaded, full clip\nI cut to the chase, snip-snip\nThat weave gotta go, pink slip\nLooking washed up, drip-drip\n\n[Pre-Chorus]\nI can't believe it\nThis is insane\nHow can you talk about me when your weave is inside of the grave?\n(It's dead, bitch)\nI can't believe it\nOr is it just me?\nBut why all these bitches just walking the streets with some cheap ass weave\n\n[Chorus]\nCheap ass weave\nCheap ass weave\nHow everything on fleek when you got some cheap ass weave?\nCheap ass weave\nCheap ass weave\nDon't even step to me if you got some cheap ass weave\n\n[Verse 2]\nSo check yourself before you come at me\nCardi B killing shit, I'm causing casualties\nI am a masterpiece, you are a tragedy\nFinish you like Mortal Kombat; fatality\nI got shit jumping like What a Time...\nLike Jumpman, Jumpman\nThat weave you got should be a crime\nYou got no luck, man\nAnd how you niggas even let them in the crib with that?\nYou know that weave stink, that shit need a Tic Tac\nNow you tell me you pulling hair off your pillows, hair off the sheets, and even hair out your asscrack\nSo cheap weave is okay? I think I missed that\nI see a track showing, you need to fix that\nYou got a braid loose, you need to twist that\nYou got it fucked up, I would never pick that\nLady Leshurr done told y'all to go brush your teeth\nBut after you done, you leave the crib with that cheap ass weave?\nI'm begging Lord, oh God, oh God, oh please, oh please\nPlease just bless these thots, these thots with they cheap ass weave\n\n[Pre-Chorus]\nI can't believe it\nThis is insane\nHow can you talk about me when your weave is inside of the grave?\n(It's dead, bitch)\nI can't believe it\nOr is it just me?\nBut why all these bitches just walking the streets with some cheap ass weave\n\n[Chorus]\nCheap ass weave\nCheap ass weave\nHow everything on fleek when you got some cheap ass weave?\nCheap ass weave\nCheap ass weave\nDon't even step to me if you got some cheap ass weave"}]}