{"artist": "Ace Hood", "songs": [{"title": "Mama", "album": "Trials & Tribulations", "year": "2013-07-16", "lyrics": "[Hook: Betty Wright]\nMama, can you hear me?\nMama\nMama, can you hear me?\nMama, can you hear me?\nOh oh oh\nMama, can you hear me?\nMama\nMama, can you hear me?\nMama, can you hear me?\nOh oh oh\n\n[Verse 1: Ace Hood]\nMay eleven special, I was born in God’s favor\nMama gave birth in tears through that hard labour\nI just wanna thank you, ain’t no way I could repay you\nStrongest woman that I know, you’ve been my motivator\nAnd just know I’ll be everything that you said I would\nOnly focus is hoping that all my family good\nA lot of ups and downs, a lot of hard times\nA lot of cloudy days, prayin for that sun to shine\nI was hard headed, granddaddy diabetic\nLord bless her soul, granny kept a fool ready\nFive kids, three jobs, how you ever did it?\nTryna make a livin, hustle got me reminiscin\nDaddy chose lust over all us\nTell me what’s the type of man who never kept in touch\nHow do you feel? Mama showed me the real\nCan’t revover them years, too much emotion to feel\nWe was covered in bills, mama takin them pills\nGot er stressin for days, then why the fuck ain’t you here\nIt’s why I love er to death, she was dead when they left\nPrayin for me every day, Lord honor my steps\nI hope you hear my Lord, if yo mama’s around\nGotta cherish the love, gotta savor the smile\nNever go for nothing, gotta keep it 100\nYou are the epitome of a strong black woman\nYou hear me?\n\n[Hook: Betty Wright]\nMama, can you hear me?\nMama\nMama, can you hear me?\nMama, can you hear me?\nOh oh oh\nMama, can you hear me?\nMama\nMama, can you hear me?\nMama, can you hear me?\nOh oh oh\n\n[Verse 2: Ace Hood]\nDear mama I just wanna say I love you\nAnd if you left toda I don’t know what I’d ever do\nSayin this boy ain’t nothing like yo mama\nThrough the road blocks, fake friends and the drama\nMo grilfriends and a chick named karma\nReal eyes realize I could call on er\nAny time of day, any time of night\nBeen there from the start up on this journey called life\nNow I’m 24 and grown, tourin doin shows\nThankful for it all, know it’s been a bumpy road\nAs we starin at my Rollie, started reminiscin\nBoy my bad ass, used to run from all them woopings\nBut I understand, made me a better man\nYou hear me mama told you would never want again\nI put my pain on the beat, you fed it all to the streets\nI’m a believer in me and I be livin the dream\nOh Lord, black boy bout to get feel\nWho’da thought that I’d be countin up a couple mill?\nAll them TV and them magazines were label deals\nTalkin bout the struggle, start to give a nigga chills\nGod it’s the press, people still hate\nWasn’t for my mama, don’t know where I’d be today\nLord have mercy\nDon’t know where I’d be today\n\n[Bridge: Betty Wright]\nAin’t no love like mama’s love\nMama, can you hear me?\nAin’t no love like mama’s love\nAin’t no love like mama’s love\nMama, can you hear me?\nAin’t no love like mama’s love\nMama, can you hear me?\nAin’t no love like mama’s love\nAin’t no love like mama’s love\nMama, can you hear me?\n\nWhen all your friends, all your false friends are gone\nYou know mama’s gonna stay and stay and stay and stay ‘cos a mama\nMama, can you hear me?\nYea, that’s how we do\nThat’s how we do\n\nAin’t no love like mama’s love\nMama, can you hear me?\nAin’t no love like mama’s love\nAin’t no love like mama’s love\nMama, can you hear me?\nAin’t no love like mama’s love\nMama, can you hear me?\nAin’t no love like mama’s love\nAin’t no love like mama’s love\nMama, can you hear me?\nAin’t no love like mama’s love\nMama, can you hear me?\nAin’t no love like mama’s love\nAin’t no love like mama’s love\nMama, can you hear me?\nAin’t no love like mama’s love\n\nWhen your friends tell you how they gon show up and come\nAnd they know bout it there but got it mama\nFor your support I know you know about a mama\nOh you can count on mama all day, all night, anyway\nMama\nI wanna talk about a mama\nYou know what I’m talkin about\nMama, can you hear me?\nMama\nMama, can you hear me?", "image": "https://images.genius.com/fd10f6966d666486d2f60d595f5bfd2b.300x300x1.jpg"}]}