{"songs": [{"image": "https://images.genius.com/23061dd2dc7e863127db561906debd27.434x434x1.jpg", "title": "Grand Finale", "album": null, "year": null, "lyrics": "[dmx - dialogue]\nI ain't goin back to jail\nNext time, the county or the state see me\nIt's gonna be in a bag\n\nUhh! this is it baby!\nEnd of the road, ha hah!\nWhen you a dawg, you a dawg for life!\nYou don't hear me though, you don't hear me though\nYou don't hear me though, c'mon, c'mon!\n\n[method man]\nWatch them young guns that take none, nobody safe\nFrom the friday the 13th, ghetto jason\nItchy trigger finger achin, snatch yo' ass\nOut that s-class for fakin, forty-fo' blast\nIs a bloodbath, take your first step down a thug path\nAin't no love here, just slugs here\nKids know the half you get plugged here, that's just impossible\nFor the weak to last now behold the unstoppable\nThird eye watchin you, watchin me\nThrowin rocks from the penalty box, cop a plea\nYoung g we was born to die, don't cry for me\nJust keep the heat closely and ride for me\nCause we family for better or worse, you and i\nFrom the dirt, you snatch purse, so hard it hurt\nTo be here, and each year, I'm pourin out more beer\nFor deceased peers, holdin fort\nPolice line 'do not cross', they found his corpse\nIn the loft with the head cut off, and butt naked\nHomicide the crime method, add another\nKiller verse to the murder record, the grand finale\n\n[lennox speaking - movie dialogue]\nWho wan' test me, c'mon!\nMe shot pussy-hole fi fun\n\n[nas escobar]\nHot corners, cops with warrants, every block is boring\nFriday night, getting bent, lick a poem\nMy dawg, not even home a month yet, and blaze a girl\nIn the stomach, he robbin niggas who pumpin\nLil' blood got popped, by the group home cat\nEverybody nervous in the hood, pullin they gats\nFiend yellin out, who got those? go and see\nShorty snot-nosed, he don't floss but he got dough\nThug faces, fugitives runnin from court cases\nSlugs shootin past for the love of drug paper\nQueens cap peelers, soldiers, drug dealers\nAnd god'll throw a beam of lightning down cause he feel us\n\nMay the next one, strike me down if I'm not the realest\nThe mayor wanna call the swat team to come and kill us\nBut, dawgs are friends, if one see the morgue, one'll live\nTo get revenge, and we ride to the end\nBravehearts blow the lye with henn, and still rise\nTook alive with live men, my man got three six-to-eighteen's\nAnd only five in, the belly of the beast\nDidn't wanna hear the shit I tried to tell him on the streets\nIt's irrelevant, the beast love to eat black meat\nAnd got us niggas from the hood, hangin off his teeth\nWe slangin to eat, bringin the heat\nBulletholes, razor scars is the pain in the street, huh\n\nChorus: ja rule (repeat 2x)\nWhen you a dawg you a dawg for life (ride or die)\nMy dawgs feel pain from love (see eye to eye)\nGive us one shot at life (let us fly)\nCome on niggas! (we dawgs for life)\n\n[dmx and lakid {dialogue}]\nThere's mad money out here dawg\nMad money out here\nWhat you tryin to get it? (word up)\nYou gonna bust your gun to get it? (tsh, whatever yo)\nI hear you I hear you\n\n[dmx]\nUhh, I've lost my grip on reality or so it would seem\nPinch myself to wake up, cause I know it's a dream\nNiggas that don't know me see me and think i'ma rob em\nNiggas that know me well see me and think i'ma problem\nI'm just a nigga that's misunderstood\nBut word to God I turn your last name to underwood\nCause if I see it, i'ma take it and run with it, that's me\nWhat type of bullshit is this nigga on? that's d\nThe dawg come and getcha outside\nThe more blood flows, when I plug holes with the snub nosed\nGun blows, bullets whistle, wouldn't miss you\nHit you all up in your mouth like it tried to kiss you\nDrama, it's right here, how much you need?\nBeat you down with gat see how much you bleed\nHow much you plead, for your life, you was a killer\nAnd all the bitches comin up out that ass you feelin, gettin realer\nNow beg for your life, one more time, one more crime\nOne more nine, c'mon cry nigga\nIt's over! this is the shit, that hits hard\nYou either the last one standing, or the last one to fall\n\nChorus"}], "artist": "Nas"}