{"songs": [{"year": "2008-10-28", "image": "https://images.genius.com/91b9a76e50f5301dcd3a2c0ffcb542c7.425x425x1.jpg", "title": "Long Story Short", "album": "Tronic", "lyrics": "[Verse 1]\nEight fourteen 1983 nigga I'm there\nBut let me fast forward about 17 years\nTake you back to the basics, back to the basement\nHi-Hat, snare drum, baseline, base kicks\nRecording the karaoke, stereo to tape deck\nHaving fun with it ain't worried bout gettin paid yet\nCouple years past now I wanna get paid\nAnd stepped up as an Emcee, stepped up to the MP\nDoing beat cd's gettin better bruh\nListening to Pete Rock, Preemo, Dilla on the regular\nI'm tellin ya, couldn't +Tell Me Nothing+ 'til my ears determine\nLearning how to get my sound\nAs good as theirs hell yea\nI'm about to add a little group then\nTen speed and brown shoe\nLasted bout 2 years\nBut its more info\nMy kinfolk went on tour roady for Slum Vill'\nHe got a beat CD in the hands of Baatin\nDidn't hear from til they got back to Michigan\nGot a phone call *rings* What up doe?\nCome up to the studio, yo we wanna hear mo'\nSome I brought some mo tracks and they picked a few of those\nAnd made a little dough, then yo I'm out the door\nIs the story over? Not really\nGot Trinity, Dirty District, Detroit Deli\nI'm thinking how can we fail\nSeen a whole other level of the game\nOut on tour with D12\nFans wilding out, hands raising in the pile\nAnd Proof keeps stage diving in the crowd\nI can do this I can get used to it, but\nThere's more facts so let me back track\nTo the B-rack, BR Gunner shit\nHoping we were running shit\nBut it didn't work they way hey\nYoung J and my nigga Fat Ray\nDirty District 2 things seemed okay\nBut it still ain't right\nThings are moving slow mo\nSo I'm thinking bout going dolo\nSo I had to go and go solo\nDoe low and I'm not feeling\nHaving low doe or close to having no mo\nSo I'm back to basics so I'm going back to the basement\nI'm trying to make it\nAnd I hope the crowd coming with me\nI'm grinding out then I made Sound of the City\nI'm trying to show bruh's how this bruh do it\nTrying to keep my buzz up suited\nMy buzz in the underground stupid\nPhone call from Fat Beats, who dis?\nYo we trying to make you the newest\nArtist on the roster, possibility\nI'm bout to use this shit to make another outcome\nOutdone, popular demand came out\nAnd shout out to the fans that's been holding me down\nNow traveling the world gotta get em\nWhats next?\nMe and Hex on a mission for the competition\nCaltroit shout, what up to my nigga Bishop\nHold me down on the West coast laid out\nTold him good lookin out on the Dre' shout\nHey now, niggas trying to go and get paid now\nKill em on stage wow\nThe spotlights not dimming\nFat Ray got +The Set Up+\nShare the spotlight with 'em\nCritics saying I'm one of the dopest on the beats\nAccolades in the page of the magazines\nAnd that's only a little of what I've been given\nStill can't believe that it's only the beginning"}], "artist": "Black Milk"}