{"artist": "Wiz Khalifa", "songs": [{"year": "2009-04-17", "lyrics": "[Intro]\nLadies and gentleman\nMy name's Wiz Khalifa and I'm so damn good\n\n[Verse 1]\nI earn niggas respect before the cash came\nYou try me get a ticket I'm in the fast lane\nI keep the bigger picture in the glass frame\nPlus my city on my back like it's a motherfuckin last name\nWhere you goin when the driver know your last name\nAnd first class ain't much different from the last plane\nSay we the same but I'm nothin like you guys\nNigga, I'm a frequent flyer Taylor Gang or Drink n Drive\nDie...\nNow everybody's mourning I think we\nRunnin' outta liqour bring some more in\nUsed to say I'm fresh\nBut now I'm gettin spoiled\nCause new shit gettin' old\nThese hotels kind of boring\nDon't mean to sound unappreciative\nBut it's obvious the game ain't what you think it is\nYellow diamons speak spanglish on my neck and wrist\nDon't even check the list\nThey expecting us\n\n[Hook]\nSee I'm packed ready to go go go\nWe in the air you oh So LOW!\nShawty we gon live it up\nAnd girl I got a lot of but it's just I can't get enough\nSo I'm a check my bags everything secure with my tags hand me my boarding pass\nYeah... Yeah\nAnd I'll hit you when my flight land\n\n[Verse 2]\nYeah, got me feeling so professional\n3 hour trip with only 15 minutes left to go\nA small comparison should let you know\nCause only time ya'll niggas got leg room\nIs in the exit row\nDamn. People tell me I change\nThat's exactly what I'm getting so I'll never be the same\nNiggas losin' weight cause what I spit is lipo\nTry to explain but they get it twisted like a micro\nI hit the club it's like a light show\nBet this liqour turns the wouldn't into a might go\nGot a bitch that's for insurance like she Geico\nTry to use her phone to get a picture but the lights... Low\nBut the bottles still full\nAnd you don't really want this night to end do you?\nSo sip slow-ow-ow and I'm a put this thing on cruise control\n\n[Hook]", "image": "https://images.genius.com/87ca659a586e891811e781b44890aa4a.400x400x1.jpg", "album": "Flight School", "title": "Boarding Pass"}]}