{"artist": "Cadet", "songs": [{"title": "Uber Everywhere Freestyle 2", "album": null, "year": null, "image": "https://images.genius.com/9db2bc94a35881662088ec9ddd907bfe.1000x1000x1.jpg", "lyrics": "[Intro]\nMy brudda [?] you know\nFam, I thought you was my brudda but I don't know anymore fam\nWhy fam?\nWhere's this Nandos?\nYou're always talking about food, you are so Af'\nFood, food, don't cry, don't beg\nWings, wings\nBackchat London yourself man, African guy man\n\n[Verse]\nCome out the Uber\nMan know me, I'm a mover\nWe ain't going Nandos no more bro\nWhere we going fam?\nShopping fam, where?\nPuma\nYou know me, I've gotta stay swagged\nMan I might go Puma and blow me a bag\nBest make sure you've got my back though\nWhy? Because the fans can move mad\nSwear down? Look, come on, they know man\nBeing fresh is part of the program\nMan just wanna cop me a new pair that won't crease, have me walking around like a old man\nYou don't believe me, I'll show man\nJust remember that I told man\nBut I ain't tryna chat in there\nSo make sure you've got my back in there\nHi, welcome to Puma, if you need any help, my name's Kelly\nThat's calm man, rudeboy I told you\nTold me what? That was one fan already\nAnyway these was the pair that I wanted bro, I've gotta make them mine\nLet me see\nBig man, please can you do me a favour? I beg you please get these in a nine\nWait, I swear you're Cadet?\nWhat you saying, you can tell by the trim?\nYeah man, your music's wavy\nCan I get a picture? Of course bro, it's not a thing man\nLove for the picture, cous' don't worry, it's nothing\nHey man, the pictures' wavy\nAy, who's that? Come on, Krept's cousin\nWhere was I? Let me put my hand on my chin\nWas I doing punchlines or wordplay?\nEither way brother, I was going in\nSee na, I don't see what mess he's on\nI just wanna get them creps and be gone\nBig man, please can you do me a favour? Take those to the till while I try these on\nWoah, shit\nWhagwan?\nCadet, you won't guess who just came in the shop fam\nWho bro?\nYoung Philly\nYou're chatting shit fam\nHas he clocked yet? Has he clocked yet?\nHas he clocked yet?\nHe's here cous'\nYo, boom man\nCadet, Cadet\nCous' not again man\nCadet, Cadet\nYou done it the last time man\nCadet, Cadet\nNot every day bro\nCadet, Cadet\nOi son, fall back man\nCadet, Cadet\nLove for supporting and that yeah\nCadet, Cadet\nBut you're taking the piss now man\nCadet, Cadet\nNot every day man\nFam, you see why it's long?\nWhy I wanna get my creps and be gone\nDon't get it twisted, I love my fans\nEverything about them keeps me strong\nThey're the reason my money be long\nTrust me bro, my money be long\nOi, look, come follow me to the till\nI just wanna get them creps and be gone\nAight big man, can I get them creps?\nI'm rich, I don't care how much that is\nA hundred and ninety-five pounds\nIght man it's nothing, what, can I pay contactless?\nThirty pound is the limit, I think you'll pay no more, I'm sorry\nAight fuck it, what, can I do chip and pin?\nCalm, I'ma just put my pin in like boom\nLet me tell you about the dude\nI'm a young fly nigga and I move like I move\nBully in the booth and I cruise like a cruise\nExcuse me\nWhagwarn?\nIt didn't go through\nWhat d'ya mean? What d'ya mean?\nThere must be something wrong with your machine\nLet me wipe these on my jeans\nUh, you think that I need to pretend?\nYou know how much P's that I rasclart spend?\nMaybe I put in my PIN in all wrong\nFuck it, come, let me try this again\nUh, watch me rhyme again\nA young fly nigga that's on time again\nDiamond teeth, watch them shine again\nExcuse me\nWhat?\nIt declined again\nNa\nOi you, cut that off quickly, cut that off quickly\n[?] let me chat to you for a second bro yeah\nObviously man's filming a quick video and that yeah basically, you hear that?\nI hear that\nAnd like, I need to stunt for the 'gram and that, you get me\nYeah but company policies\nNa na, obviously, what I'm saying is..I'm not saying let me keep them, I'm saying why don't I take some pictures in them and that\nYo big man, yo yo, listen, let me just take some pictures and that yeah\nLet it slide, let it slide, let it slide\nAnd then I'm gonna bring it back in with the bags and that, you get me\nObviously you're lightskinned and that so I can promote you on my 'gram and that\nIght, cool\nFam, they're gonna-fam trust me, you're good, you're good, you're good\nI'll be back in like two seconds, just take some pictures and that, you get me\nIght, calm\nOi where did you go bro?\nBruv, what happened?\nI was in there buying bags upon bags upon boxes upon boxes B, where did you go fam?\nCard declined\nWhy would you even say anything like that? The devil is a liar, why would you even wish those things on me?\nMy card declined, are you mad, me?\nSo what was my man saying?\nCadet, Cadet, Cadet\nNo obviously he was-he wanted a picture and that\nOh yeah?\nSo he wanted to get a picture of man and that and then obviously I said \"Rah, I can't do pictures today\" 'cause today I'm just shopping, you get me fam?\nHey big man, you said I could get that for five\nCan't we get a couple pictures and that\nSorry, company policy\nBruv, what's going on?\nI'm saying you can take it, big man, big man, big man\nDeclined?\nWhat no P's? No P's?\nHuh?\nBruv, I thought you had P's\nFam I've got mad-ah my Uber fam\nOi the Uber's there fam, na obviously, I'm gonna come back and get you\nWhat happened?\nThe Uber's there\nNa I'm coming with you still\nOh, this way, this way\nOh yeah?\n[?]\nOi let's go, Uber\n[?]\nI'm coming fam"}]}