{"songs": [{"lyrics": "[Intro]\nGrows back\nDude, it grows back\nIt's ok it grows back\nMa!\n\n[Verse 1: Aesop Rock]\nThere is a bowl cut template mapped with a billy can\nMega mom scissoring a topiary lego man\nMini-ramp cowlick\nGood ship snot nose\nLap rain water out of pigeon hill potholes\nRat brain, shovel green peas offa butterknife\nRacoon hat, moon boots all summer-type\nFelt pressure at the center of the dog show\nBetter off blending, sweater—off Waldo\nYou! Wanna see a genome mutate?\nCut a page boy ‘til it bring home a Cube tape\nPoof, screw-face wriggle out a chop shop\nHome-brewed Kool-aid, Disavowing Osh Kosh\nSimulating television\nLittle rowdy rock snob\nBobble-headed shredder playing top-heavy hop scotch\nYou realize you only got a week\n‘til you catch him with a set of shitty clippers in the sink\nLike bzzzzt, motherfucking bzzzzt, bzzzzt\nThat's a quiet kid, buzzing asymmetric rebel lines in\nCrudely, some say to praise the lord\nI say you wanna feel saved baby shape the orb\nAnd I will see you all in Helven\nRead he fled a panic room pissed\nAnd been searching for animal chin since\nBumpin' Johnny Rad, eye on the sauce pan\nCurrent mop: 4 months shy on the off-chance\nMight just reset this whole shit\n\n[Hook: Aesop Rock]\nStart with a text book bowl cut (Bowl cut!)\nOne you can mow down slow as you grow up\nLearn a couple great new curse words (Pussy!)\nBuzz a cool rat tail, take 2, your turn\n\n[Interlude]\n“Haircuts! Get your five dollar haircut here! I can do mohawks, fauxhauks, afros, halfros, racing stripes, fringes, high top fades, mullets, reverse mullets, crew cuts and much much more!\"\n\n\"No, I just needed a little off the top\"\n\n\"Mirror? No, you can’t look in a mirror, trust me, you look awesome!\"\n\n\"I just want to take a look\"\n\n\"Give me another buck and I'll trim [?]\"\n\n\n[Verse 2: Aesop Rock]\nI knew this kid Camu who in the lion's mouth\nMade up a fail safe way to get his life corralled\nLet's say he short on the rent\nHis land lord is upset\nHe disappears with sheers yelling \"I'm going George Jeff\"\nBathroom door sound like a part—mech barbershop quartet\nForced into war with itself\nWhat emerge next in a shaft of light is bald up top\nLong on the back and sides\nMaybe the blade oil came with a ax to grind\nBut granddaddy half-smile, all mastermind\nHe asked, \"How do I look?\"\nI said, \"You look insane\"\nHe said the haircut come with a theory, I'll explain\nPlease do\nFirst: no hats allowed\nFaux nat' male pattern when he out the house\nAnd wouldn't crop it up until his monopoly prop pass go\n‘til then walk this town like an asshole\nBzzzt! Motherfucking bzzzt bzzzt!\nLast week we were stoney\nThis week he program beats all Monday, sold two Wednesday\nPay rent, fabricate a whole new hedge maze\nBack on his smooth shit Friday at noon bitch\nWow, just like that\nA method I encourage you to share and apply and adapt\nAs one day his didn't grow back\nSo, if yours does, get that zig zig zag\n\n[Hook: Aesop Rock]\nStart with a text book bowl cut (Afro!)\nOne you can mow down slow as you grow up\nLearn a couple great new curse words (Fuckface!)\nMaybe try a pony hawk, take 2, your turn", "title": "Racing Stripes", "album": "Skelethon", "image": "https://images.genius.com/be7ecb35b49d25728281da97d28c2ca1.1000x1000x1.jpg", "year": "2012-07-10"}], "artist": "Aesop Rock"}