{"songs": [{"lyrics": "[Intro]\n“I work and work 'til I'm half-dead and I hear people saying\n\"She's getting old,\" and what do I get? A daughter\nWho cares as much about the beautiful dresses I give her\nAs she cares about ME!”\n\n[Verse 1]\nLet's do this for these babies\nMercedes truck, fuck, houses on acres\nBlatantly ballin' on HD\nY'all need to step up y'all AV\nLife changed again I was already taking off\nMy flight changed again\nSlight change of winds\nIt's barely 12 noon and my wife changed again\nBaby need Pampers\nDaddy need at least three weeks in the Hamptons\nPlease don't judge me, only hugged the block\nI thought my daddy didn't love me\nMy baby getting chubby\nCue that Stevie Wonder music, aww, isn't she lovely?\nNow I'm staring at her praying that things don't get ugly\nAnd I'm stuck in that old cycle like wife leaves hubby\nFuck joint custody, I need a joint right now\nJust the thought alone fucks with me\n\n[Hook]\nHigh on life\nI could die from the fall, imagine if I hit the floor\nApologies in order to Blue Ivy my daughter\nIf it was up to me, you would be with me, sort of like daddy dearest\n\n[Interlude]\n\"Don't fuck with me fellas. This ain't my first time at the rodeo.\"\n\n[Verse 2]\nI dream filthy (My mom and pops)\nMixed me with Jamaican (Rum and whiskey, what a set off)\nAnd I know I'm not perfect baby\nI done been through so much trauma, it gonna be hard to reverse it\nWith some doctors and some nurses maybe\nTeach me on how to treat a lady, open doors on the 'Cedes\nThis relationship shit is complicated\nAll I know if we ain't speaking everyday, I fucking hate it\nI don't wanna duplicate it\nI seen my mom and pop drive each other mothafuckin' crazy\nAnd I got that nigga blood in me\nI got his ego and his temper, all is missing is the drugs in me\n\n[Hook]\nHigh on life\nI could die from the fall, imagine if I hit the floor\nApologies in order to Blue Ivy my daughter\nIf it was up to me, you would be with me, sort of like daddy dearest\n\n[Interlude]\n\"No... wire... hangers... EVER!\"\n\n[Verse 3]\nFather never taught me how to be a father, treat a mother\nI don't wanna have to just repeat another leave another\nBaby with no daddy want no momma drama\nI just wanna take her back to a time when everything was calmer\nOut in Paris on a terrace watching the Eiffel Tower\nAnd a Ferris wheel yet and still, nothing could prepare us\nFor the beauty that you be Blue be\nLooking in your eyes is like a mirror, have to face my fears\nCheer up, why can't you just be happy\nWithout these back and forth thoughts, you too much like your daddy\nBadly I just wanna spent more time with him\nSadly life wouldn't let me get around with him\nNow I got my own daughter, taught her how to take her first steps\nCut the cord watch her take her first breath\nAnd I'm trying and I'm lying if I said I wasn't scared\nBut in life and death if I ain't here\n\n[Hook]\nHigh on life\nI could die from the fall, imagine if I hit the floor\nApologies in order to Blue Ivy my daughter\nIf it was up to me, you would be with me, sort of like daddy dearest", "title": "Jay Z Blue", "image": "https://s3.amazonaws.com/rapgenius/MCHG_cover.jpg", "year": "2013-07-13", "album": "Magna Carta... Holy Grail"}], "artist": "JAY-Z"}