{"artist": "Big Boi", "songs": [{"lyrics": "[Hook]\nIt's Freakanomics\nThat's why every dime is making money\nGot it down to a science, yeah, she studied\nSince the beginning of time\nEvery girl I see got a PhD in Freakanomics\n(Yeah)\nIt's Freakanomics\nIt's Freakanomics\nEvery girl I see got a PhD in Freakanomics\n\n[Verse 1: Big Boi]\nShe say she want to see me but I got me somebody\nI tell her see you next lifetime but she want me today\nAnd if I give her D, then she will never go away\nWe went from watching a lil movie to me drilling for babies\nNow she know that I know that we know we fucking\nAll up in each other like it ain’t nothing\nNo cuffing, just busting\nDon't stop till you get enough of the hip-thrusting\nTrust me, always in a must-win\nFall back, what, you thinking I’m a husband?\nBoyfriend? Bae? Naw, give up the drawers\nForever in the friend-zone? Yes we are\n\n[Bridge]\nI know it may seem, I’m falling for her plans\nI know it may seem, she’s got me eating out her hands\nShe’s not my lady and I am not her man\nSee, that's just my friend and we gon’ let you do the math\n\n[Hook]\nIt's Freakanomics\nThat's why every dime is making money\nGot it down to a science, yeah, she studied\nSince the beginning of time\nEvery girl I see got a PhD in Freakanomics\n(Yeah)\nIt's Freakanomics\nIt's Freakanomics\nEvery girl I see got a PhD in Freakanomics\n\n[Verse 2: Big Boi]\nAnd anytime I want to get down I hit her line\nRound after round while I piped her spine\nSpine is the kind when you just touched down\nYou had a long flight but you wanna bust now\nOr later, like the candy, come out the panties, please\nGot to be polite with all these freaks, freeze\nTag the moon over the stars, into the Boomiverse we are\nShe said she want to see me but I got me somebody\nI tell her see you next lifetime but she want me today\nAnd if I give her D, then she will never go away\nWe went from watching a lil movie to me drilling for babies\n\n[Bridge]\nI know it may seem, I’m falling for her plans\nI know it may seem, She’s got me eating out her hands\nShe’s not my lady and I am not her man\nSee, that's just my friend and we gon’ let you do the math\n\n[Hook]\nIt's Freakanomics\nThat's why every dime is making money\nGot it down to a science, yeah, she studied\nSince the beginning of time\nEvery girl I see got a PhD in Freakanomics\n(Yeah)\nIt's Freakanomics\nIt's Freakanomics\nEvery girl I see got a PhD in Freakanomics\n\n[Outro skit]\nWe in the bonus round, Lil Rod (Let's do it)\nWe ‘bout to give away $25,000 in this Hood Family Feud\nFinna get your mama wig off layaway, boy\nYou finna turn up out here\n(Shoutout to everybody, man; let's get this)\nWe asked 100 hood men and women:\nName something you say to a woman when her lights are out\n(Ahh, bitch, they got you too?)\nOK, we asked 100 hood men and women:\nName something a kid said to his father on Fathers Day\n(Ahh, nigga, who are you?)\nOK Lil’ Rod, this for all the marbles right here, boy\nThis is it:\nName something you say to a woman at dinner\n(Ahh, uh, uh, shit that’s a suck a dick steak, ain’t it?)", "image": "https://images.genius.com/62ac77014890d9620ef8186d7f2f5893.620x620x1.jpg", "year": "2017-06-16", "title": "Freakanomics", "album": "BOOMIVERSE"}]}