{"songs": [{"image": "https://images.genius.com/05fc618bdb59b8992907ab9a8a7914c2.500x500x1.jpg", "year": null, "title": "Take Flight", "album": "The Unforgiven, Volume 1: In The Beginning", "lyrics": "[X-Raided]\n\nY'all muthafuckas wanna go to war?\nNigga we'll give you war\nNigga this Black Market\nDott Dogg, show these niggas what it's like when we go to war\n\nFirst Verse [Dott Dogg & X-Raided]:\n\n[Dott Dogg]\n\nYou say you ready for war, so I'm about to take flight nigga\nDott Dogg, fuck all y'all I never liked niggas\nBreak mics quicker than Billy the Kid pulled triggas\nLike Canibus I eat emcees til' I'm full nigga\nI'm locin' up, leavin' you niggas broken up\nSlit out your tongue, cut your throat, leave ya chokin' up\nYou smokin' up a gang of sherm got your brain fried\nToe to toe, head up nigga we the same size\nFlows flow, fed up, tired and you talkin' shit\nPreachin' with your wack style, what else?  Talkin' shit\nLookin' for your wack style against this Blocc shit\nBattle me, get got with, like a Glock bitch\nYou must be dreamin', nights be wakin' up screamin'\nI'm right there, your pall bearers, me, and five demons\nI dare you Devil, test it and get your bubble peeled\nGet sacked like a quarterback fuckin' with Stubblefield\n\n[X-Raided]\n\nYou ever heard revenge?\nMe and my nigga Dott Dogg on a murder binge\nShot 'em all, watch'em fall like we murder men\nWe do illegal shit like we never heard of sin\nWe ruin people with them fifty caliber Desert eags\nWhen you see us comin' all y'all baller niggas best to leave\nYou best believe it's goin' down and you the next to bleed\nMake some sound and catch some rounds til' that's guaranteed\nWe sharin' weed just the flammable shit\nTurn your loc into an animal quick\nDott Dogg can we handle this shit?\n\n[Dott Dogg]\n\nThat's affirmative nigga\n\n[X-Raided]\n\nSo now we shermin' it nigga\nWhere the black and bloody glove?\n\n[Dott Dogg]\n\nWe burnin' it nigga\n\n[X-Raided]\n\nYou better be learnin' it nigga\nMoney burnin' it nigga\nAnd if you ain't on that page, you better be turnin' it nigga\nX-Raided loc, I ain't givin' a fuck about y'all clout\nWe're like them chariots to war\nAnd there are plenty of scouts, we shout\n\nChorus [X-Raided & Dott Dogg]:\n\nTake flight like stealth bombers in a war zone\nYou wanted funk my nigga?  So now the war's on\nLate night I'm on a creep for a full chrome\nRed light boom, will drive inside your dome\nTake flight like stealth bombers in a war zone\nYou wanted funk my nigga?  So now the war's on\nLate night I'm on a creep for a full chrome\nRed light boom, will drive inside your dome\n\nSecond Verse [X-Raided & Dott Dogg]:\n\n[Dott Dogg]\n\nFuckin' homegrown, I'm the Northern Cali green leaf\nSplit your dome with one hit, now you want peace?\nPit bull, well I can shake til' I good and leave\nClip full, got hollow tips BITCH swallow this\nI'm sicker than aliens on Mars Attack\nAct gat hollerin' at'cha with whoever got'cha back\nFact, non-fiction, sendin' my niggas on a rhyme mission\nYour whole house, kids, and your baby Moms missin'\nBut still all you wanna run up on a murder Man\nGot a reputation for bein' quick to hurt a man\nNo hesitatin', premeditatin' some cold shit\nMy designation, assassinatin' your whole clique\n\n[X-Raided]\n\nYeah, yeah, open up the casket, nigga I ain't dead yet\nAsh to ash, dust to dust, ain't been said yet\nHad Dott Dogg fill the bulletholes stuck on bedrest\nSo I left you in the car with your brains on the headrest\nGot that heart, Hannibal heart is all a nigga need\nYou doin' 100?  You  best to pick a quicker speed\nYou best to heed, every warning y'all niggas receive\nCuz in the morning, we comin' for all our enemies\nPicture these, beg and plead for your life\nBut for my clip to squeeze, I look you dead in your eyes\nTell ya \"Nigga Please\"\nHit your liver then your kidneys\nGot your boxers, full of bloody piss and feces\nLook what it got you fuckin' with these Northern Cali G's\nIt's a disease, incurable sickness indeed\nIf you sleep I'ma creep, leave that pillow bloody red\nWho got y'all?  X-Raided and Dott Dogg then I said:\n\nChorus (2x)"}], "artist": "X-Raided"}