{"songs": [{"title": "Tropical Fantasy", "lyrics": "(feat. Jean Grae)\n\n[Akir:] Hmm, come here\n[Jean:] Heh, stop it! [laughs] Stop! C'mon\n[Akir:] I'm sayin.. let's go\n[Jean:] Nah, stop askin me to go away, man\nWe don't have to go away, you my getaway for real man\n[Akir:] I'm sayin I'll save a little money\nWe can get the tickets and get outta here right now!\n\n[Akir:]\nIt's like this priceless, Queen Isis\nA pleasure, when we're together though the trifest hypes this\nI write scripts rollin tight spliffs, roll on Miss\nWhile the time ticks, dodgin cops with nightsticks\nPlots and mind tricks, blocks where crime gets out of control\nGotta know what glitters ain't gold\nAnd I'ma stop this grind shit, let's get on the road\nFuck barely affordin the livin and the bills that we owe\n\n[Jean Grae:]\nI'm owin these bills, gettin through life with you, wife with you\nBreathe in the city lights 'til we exhale neon\nBeyond stress we gone, metropolis livin\nI'm beyond pills, we gon' build; how we gon' deal though?\nHouse for sailboat, my vision is with yours\nSnaps back to dirty building to steel doors\nWanna relax back with the damn facts that we assed out\nAnd trapped, can't blast out, maxed out\n\n[Chorus: Jean Grae - singing]\nHow we gonna get away (away)\nI've been goin crazy here, I can't make it here and I see\nYou want the sunlight, the paradise, won't that be nice?\nDivine is right, if we could find a getaway\n\n[Akir:]\nYeah, prayin to angels, plottin all angles, weavin a web tangled\nMingle we labeled in the Star Spangled\nStrangle for oxygen, island hoppin Bahama way\nLet's get it poppin in mai tais and moccasins\n\n[Jean Grae:]\nYeah, but we gon' rock Timbs, never lessen out the king\nEven if collar poppin in Hollis is not a sin\nSee we already blessed, forgetting the stress\nThe pennies yes, but many are without any or less so\n\n[Akir:]\nUsually they brutally usin me, foolishly cluelessly\nChoosin means over you or me, who could be\nMovin feet to a beat, reach to a piece of land\nClose to a beach with sand\n\n[Jean Grae:]\nAnd it's a grand vision, a tan prism, and hands glisten\nHoldin a roll, a part of a gram but listen\nI'm with it, proposal exquisite\nBut I can't flow 'til it, wanna let go but logic it holds with it\n\n[Akir:]\nGotta go with it, I know it is, so a risk\nJust flow with this, let's blow this bitch\n\n[Jean Grae:]\nBoy I'm foldin my wrists, no cliques to hold back\nBaby we so rich, maybe I could show that\n\n[Akir:]\nKick back and pop a bottle 'til models in avocado strings\nI picture a collar string bikinis lookin like a fashion model\n\n[Jean Grae:]\nBeen in love and daydream then roll like the villains and never play\nWe takin aeroplanes, speed in narrow lanes, never lay\n\n[Chorus]\n[Jean Grae:]\nI see the jobs and bills and it's hard to kill\nWant a menáge with thrill but I argue still\nI'm thinkin oxtail in Negril\nThen I'm thinkin con-ed locked in, it's heavy as drop lead[?]\n\n[Akir:]\nUhh, mira poquita señorita mas mantequilla\nYou give me seizures when I see your features, diva\nEase up, and when you find some time to free up\nCheck me after this re-up, though we can slide to Costa Rica\nAntigua or Dominica, linens with a mink cuff\nShirt, matchin your sneaker, ganja we reek of, high 'til we reach clubs\nSqueeze up, liquor spillin margaritas, glass upon the speakers\nFeelin, grabbin, teasin my leaver, feenin to get your beaver beat up\nOnly to reason for the Four Seasons\nQuick, go get a Visa, we might even see the preacher\nLay back and let the sun shine, time teaches\nTo learn each other in a place where nobody can reach us\n\n[Chorus x2]\n[Outro: Akir]\nC'mon baby, let's hit the road\nNah, nah don't pack your bags\nWe'll buy somethin when we get there, yeah\nNah man, don't worry about the bills\nWe'll take care of that later on\nWe got somewhere else to be, you and me", "year": null, "album": "Legacy", "image": "https://images.genius.com/ec568067b0f966b9ee18a0f87677e60e.1000x1000x1.jpg"}], "artist": "AKIR"}