{"songs": [{"lyrics": "[Produced by Just Blaze]\n\n[Intro: Jay-Z]\nUhh, uhh, yes sir!\nJust the sound of his voice is a hit, heh heh\nY'all niggas got me really confused out there\nI make Big Pimpin' or Give It 2 Me one of those\nY'all hail me as the greatest writer of the 21st century\nI make some thought provokin' shit\nY'all question whether he fallin' off?\nI'ma really confuse y'all on this one... follow!\n\n[Verse 1: Jay-Z]\nWhen them tops come down, chicks' tops come down\nLike when them shots come out, make cops come around\nWhen them blocks come out, I can wake up a small town\nFinish off the block then I make my mall rounds\nStares get exchanged then the fifth come out\nThe tough guy disappear, then the bitch come out\n\"That's him!\", I'm usually what they whisper 'bout\nEither what chick he with, or his chip amount\n'Cause I been doin' this since CHiPs was out\nWatchin' Erik Estrada\nBaggin' up at the Ramada, table full of powder\nA/C broke, 'bout to take another shower on my 25th Hour\nSpike Lees everywhere, game or the fight\nYou might see me anywhere, a day in the life\nOnly thing changed the tail number on the flight\nI can touch down and take off the same night\nI'm so bossy, bitch get off me\nTrick get off me, you can't get shit off me\nI'm so flossy, no 6's on Sprees\nLaid back, Maybachs, don't even talk to me\n\n[Chorus: Jay-Z]\nThis is that ignorant shit you like\nNigga fuck shit ass bitch trick plus ice, c'mon\nI got that ignorant shit you love\nNigga fuck shit maricón puta and drugs, c'mon\nI got that ignorant shit you need\nNigga fuck shit ass bitch trick plus weed, c'mon\nI'm only tryin' to give you what you want\nNigga fuck shit ass bitch you like it don't front!\n\n[Verse 2: Jay-Z]\nThey're all actors, lookin' at themselves in the mirror backwards\nCan't even face themselves, don't fear no rappers\nThey're all weirdos, De Niros in practice\nSo don't believe everything your earlobe captures\nIt's mostly backwards, unless it happens to be as accurate as me\nAnd everything said in song you happen to see\nThen, actually, believe half of what you see\nNone of what you hear, even if it's spat by me\nAnd with that said, I will kill niggas dead\nCut niggas short, give you wheels for legs\nI'm a K-I-double-L-E-R, see y'all in Hell\nShoot niggas straight through the ER, whoa!\nThis ain't B.R., no, it's S.C., CEO\nThe next Lyor, no, the next leader of the whole free world\nAnd the first thing I'ma do is free Sigel, go...\n\n[Verse 3: Beanie Sigel]\nUhh, take off the cuffs, unlock the gate\nIt's that ignorant nigga that you love to hate\nThe '07 Ice Cube, B. Sig so rude\nTell a trick, get these nuts, eat dick like food\nNow see if I care if this verse get aired\nEven if you mute it, the curse is there, yeah\nI'm so raunchy, bitch get off me\nKeep my flea collar on, you lil' ticks get off me\n\n[Verse 4: Jay-Z]\nI missed the part when it stopped bein' 'bout Imus\nWhat do my lyrics got to do with this shit!\nScarface the movie did more than Scarface the rapper to me\nStill that ain't to blame for all the shit that's happened to me\nAre you saying what I'm spittin'\nIs worse than these celebrataunts showin' they kitten, you kiddin'!\nLet's stop the bullshittin'\n'Til we all without sin, let's quit the pulpittin'\nScarface the movie did more than Scarface the rapper to me\nStill that ain't to blame for all the shit that's happened to me\nLet's stop the bullshittin'\n'Til we all without sin, let's quit the pulpittin', c'mon\n\n[Chorus: Jay-Z]\nThis is that ignorant shit you like\nNigga fuck shit ass bitch trick plus ice, c'mon\nI got that ignorant shit you love\nNigga fuck shit maricón puta and drugs, c'mon\nI got that ignorant shit you need\nNigga fuck shit ass bitch trick plus weed, c'mon\nI'm only tryin' to give you what you want\nNigga fuck shit ass bitch you like it don't front!\n\n[Outro: Jay-Z]\nIt's only entertainment! Hehehe", "title": "Ignorant Shit", "image": "https://images.genius.com/778c1892b8a2f5aee554c4c797ca8915.1000x1000x1.jpg", "year": "2007-11-06", "album": "American Gangster"}], "artist": "JAY-Z"}