{"artist": "G-Eazy", "songs": [{"title": "Fire In The Booth Part 2", "album": null, "year": "2015-12-05", "image": "https://images.genius.com/fd7ed1a82cc621a07ef0ec67ae88b145.1000x1000x1.jpg", "lyrics": "[Part 1]\n\n[Intro]\nYah, yee\nYoung Gerald, reporting live from London\nYeah\n\n[Verse]\nIn my mom's Honda replaying 2001\nCussing ass ten year old, knew she had a rowdy son\nStart the CD over right after the album's done\nLooking for a fuck to give, damn I never found me one\nAs I wonder which classic I should write this to\nAs a youngster, I swear I was the nicest dude\nRode my bicycle, no I ain't have the nicest shoes\nThey would talk about me so I always got in fights at school\nAsk my moms why the car would always smell like skunk\nSwear it's been like every day, Mom what the fuck is up?\nAlways smelling stuff, little would I know this\nI was too young to know mom was smoking explosive\nIn her closet had a bong, democratic Cali mom\nKnew I was gon' be somebody ain't nobody read up on\nTrust me this is true me and school we just ain't get along\nShe told me if I kept my grades up then I could get to prom\nSo the girl I tried to ask, baddest in class\nDissed me and she laughed then passed\nIf she would have said yes I would have been gassed\nThe bitch got uppity and turned me down fast\nNow I'm upper echelon, Lamborghini zoomin\nIf I feel like laughing I would go to my reunion\nJust to stunt on everyone, like where the fuck have you been?\nWorking at a restaurant or desk I'm assuming\nNow I attract, girls that used to turn they back\nCausing me to put them on blast on this fucking track\nI'm like nothing that you've seen before\nFrom coffee shops to an arena tour\nI told Tony grab a mop, said \"what you need it for?\"\nI put an axe in a rappers back I'm tryna clean the floor\nAmerican psycho I'm having fantasies of killing all these rappers\nI'm jealous of, not a fan of these\nHollywood assholes,  caught up in the hype\nAnd only focused on cash flows\nSaint Laurent leather jacket came with the tassles\nIn 2016 I'm only fucking with bad hoes\nSo listen, let me drop some shit about this bitch I used to know\nGuess I don't let nobody know\nHer and her best friend naked both of them off the blow\nThey got freaky on my tour bus I skeeted on them both\nI've known the hoe for one hour she's rolling up sour\nThis girl was a winner bruh, something about her\nThese hot hoes is feigning, they on my nuts\nBut bitch I'm out your pussy when I nut\n\n[Outro]\nFor real, Xxplosive\nCharlie Sloth\nHaha G-Eazy\nWhen It's Dark Out, December fourth\n\n[Part 2]\n\n[Intro]\nYah, yah, yah, yah, yah\nYah, yah, yah, yah, yah\nYah, yah, yah\nYah, Gerald, yah\n\n[Verse]\nWhat If I had a hundred million dollars?\nI'd fuck up some, fuck up some, fuck up some commas\nWhat if I did fuck Rihanna?\nWhat if I had two bitches at once with no drama?\nWhat if the whole world believed in Obama?\nWhat if Bill Clinton had never got head?\nWould we pay attention to real fucking issues instead\nWhat if Pac wasn't dead\nAnd the thunder and rain\nWhat if it all was champagne\nMy moms was healthy\nLike what if there wasn't no pain\nWhat if these rappers could actually find their own lane\nWhat if it wasn't the same, what if I did my own thing\nReally, said fuck it and went against the grain\nI don't know I'm just saying\nJust some ideas I had on my brain\nCharlie Sloth what you saying"}]}