{"songs": [{"album": "DiCaprio 2", "year": "2018-11-26", "title": "Despacito Too", "image": "https://images.genius.com/a24486c6e4c335d50ce79fdcf7bef5ac.1000x1000x1.jpg", "lyrics": "[Intro]\nU-U-U-U-Uptown\nAyy, it's, it's all for the kids man\nThis-this shit for the kids, hahahah\nFor the little children, uh, um\n\n[Verse 1]\nI can be, whatever I want to be\nBet not a bitch or a nigga stand in front of me\nI got the devil in the pockets of my Dungarees\nTaking a dump on anything that standing under me\nI can be a dream, yeah, or I can be a nightmare\nBorn on Halloween night, it seems like a light year\nDouble my Sprite, hey my guy, do you got a light? Yeah\nSquash stampede, plenty lion and many bison, huh\nSeen some, seen one, but it's not many like 'em\nWhen I fry or when I die, bury me with many mics, yeah\nI can be, whatever I want to be\nBet not a pussy ass nigga stand in front of me\nTook a stop at the light, made a right on humble street\nGuess I been buzzin' like a motherfucking bumblebee\nTryna turn this honey tree into a money tree\nBut it's only one of me, and y'all niggas the son of me\nGod\n\n[Interlude]\nWait, wait if I win this, I\nIt's gonna be something, but I don't know what it's gon' be\n\n[Verse 2]\nUh, okay I'm gonna be, whatever I want to be\nBet not a bitch or a nigga stand in front of me\nThey tryna snatch this motherfucking rug from under me\nBut never stumble, young man rumble, the sensei\nThe J.I.D babe, Mutombo, the brass ensemble\nCop an eighth and spend the last on paper and funds\nSo at Thanksgiving I'm your drunk ass uncle\nOn the corner, that junky that mumble\nThe little nigga that climbed the hair of Rapunzel\nI'm the shrimp beside your gumbo, I make myself sick, damn\nDick down doctor, that's the J.I.D, give a health check\nI'm the wrong letter that made it up out your spell check\nFucking up your texts, uh, I'm electric, I'm a Lexus\nI'm the evidence, like the shell case when the shell hit\nBut I never tell shit, I'm cold\nBut the flowing come from the bottom like whale shit\nI know what I know, and I know that you prolly fail shit\n'Cause y'all niggas selfish, and my niggas desperate, damn\n\n[Interlude]\nDamn, fuck\nI wish I knew, Black Panther, but he's not real\nFuck man, homie, I don't know\nNot real\nWhat you trying?\n\n[Verse 3]\nUm, look\nThey saying, \"What you wanna be J.I.D? What you wanna be kid?\nA doctor, a lawyer, exploring the coral reef shit?\nA football player, a track sprinter, I know you run fast\nOh you gon' be a rapper with your dumbass\nJust because you used to bump Caz\nTalk fast and can tap a drum pad\nYou thinkin' that the world's going mad? Big head, short ass\nBig eye, bug eye, drug head, shoo fly, don't bother me\"\nI'ma be better than y'all will be, tryna be, y'all see\nAll for one, all for me, shit, you niggas ain't all for me\nMotherfucker with your offering, talk-a-talk-a-talking\nShe's a sober mind, I keep receipts\nI beat the beat and eat the beat\nSo I could be the beat if I want to be\nMe I call you one two the sun do\nWhat the sun do rise when the gun drew\nWould meet the devil in hell where niggas'll hunt you\nWhen it's dark all around and you lookin' for some\nBut in the heart of the jungle, my nigga you run\nYou could be whatever you want, but better get you a gun\nBetter do what you want, whatever you feel in your stomach\nWhatever you gotta do at the moment, only the strong survive\nOnly the strong in mind and soul and spirit and spine\nYou stand firm, you rise, it's go time!\nHe looks determined without being ruthless\n\n[Outro]\nI wish I knew, Black Panther, but he's not real\nYeah\nNot real"}], "artist": "JID"}