{"artist": "G Herbo", "songs": [{"title": "L’s", "album": "Ballin’ Like I’m Kobe", "year": "2015-09-18", "image": "https://images.genius.com/fce05223ccad3afd182baeaef351e35f.640x640x1.jpg", "lyrics": "[Produced by C-Sick]\n\n[Intro]\nHaaa, G-Herbo, humble beast nigga. RIP all my niggas man\n\n[Chorus]\nLove and live your life\nMake it lavish long\nAnd I can't right my wrongs\nSo I just write my songs\nHow would I live if God guaranteed my life was long?\nAnd when I sin I pray that God don't leave my life alone\n\n[Verse 1]\n13 I'm in the books, I'm playing basketball\nBy 16 I'm cool with crooks and lettin' ratchets off\nBut let's rewind, go back in time, this how it happened ya'll\nOn the east side of the Chi, straight full of madness ya'll\nStraight full of pains, snowstorms and rains\nStraight target practice dog\nBut back to story, me? I was just a shorty\nSee stayed in the slums, two parent home\nBut moms that's who was close to me\nPops was cool but I was everything I wasn't supposed to be\nIn the streets, ditchin' school, murder, drugs around me\nRappin' it just found me, thank God it wasn't the county\nBuncha shootouts, lucky that them bullets went around me\nGod was with me, jumped straight in that water, it ain't drown me\n\n[Chorus]\nLove and live your life\nMake it lavish long\nAnd I can't right my wrongs\nSo I just write my songs\nHow would I live if God guaranteed my life was long?\nAnd when I sin I pray that God don't leave my life alone\nLove and live your life\nMake it lavish long\nAnd I can't right my wrongs\nSo I just write my songs\nHow would I live if God guaranteed my life was long?\nAnd when I sin I pray that God don't leave my life alone\n\n[Verse 2]\nLong live G-Fazo, Vito, Cheeko, C-Mo, Pistol, Kobe, Roc\nBlizz, Richie, white folks, cracks, playboy, yeah my broski Capo\nThe herd is real, the couple of names I didn't say I'm gone and stop\nThe shit I've been through made me heartless\nAll my feelin's on this Glock\nAnd damn Cap, we was just ridin' through the town\nSmokin' out the pound\n30-40 down\nHeard that shit, it made me sick\nI'm still fresh from out of town\nIf I'm comin' home to that how I'm supposed to put it down?\nThey don't understand my struggle\nThey don't care what I've been through\nKobe they don't know me and you was on the block\nUp tweakin' all night right before they hit you\nAnd your moms still calls all the time\nSaid she wanna hear the tape soon as I get through\nAnd she know what my shit gone do\nSo she don's mind waiting till a nigga get through\nAll this shit on my mind and I'm only 19\nCan't believe how a nigga get through\nEvery line that I spit shit true\nThey like why you ain't drop shit new?\n2013 songs I ain't ever even drop man\nAnd me and Cap got some hot shit too\n'Member bein' in the stu' all day\nAt the hood all night on some hot shit too\n\n[Chorus]\nLove and live your life\nMake it lavish long\nAnd I can't right my wrongs\nSo I just write my songs\nHow would I live if God guaranteed my life was long?\nAnd when I sin I pray that God don't leave my life alone\nLove and live your life\nMake it lavish long\nAnd I can't right my wrongs\nSo I just write my songs\nHow would I live if God guaranteed my life was long?\nAnd when I sin I pray that God don't leave my life alone"}]}