{"songs": [{"title": "Smoothie at Midnight", "album": "Mr. Midnight", "year": null, "image": "https://images.genius.com/6659527e1d927b401e994eff3a8867ac.1000x1000x1.jpg", "lyrics": "[Intro]\nCardo got wings\nShh, Shh, Shh\nMan, uh, uh\n(Ay, ay, ay, ay, ay, ay, ay, ay)\nShh, man, God\n(Ay, ay, ay, ay, ay, ay, ay, ay)\n\n[Verse 1]\nTook the stickers off the GT, first nigga whipping this\nThe Panamera cool, but I don't think that it can fuck with this\nOff top, press a button then I watch my spoiler lift\nI know you think about me all the time, why you ain’t call the kid?\nTouch down in Portland, had to kill em with my Nike shit\nI bought these in Tokyo, I think they dropped in '96\nI ain't even tripping off dude, I know I’m that nig\nWiping off my rims, take my son to go get some Timbs\nThirty day run on the road, need half a mil'\nIf we do this shit under the table, we can do a deal\nI don't think I ever been in love, show me how it feel\nCount a hundred thousand, wash my hands, then I plan a trip\n\n[Interlude]\n(Ay, ay, ay, ay, ay, ay, ay, ay) Yeah, damn\nCount a hundred thousand, wash my hands, then I plan a trip\nWhat's happening?\nYeah\nAnd that was just on sight, nigga\n(Ay, I'ma keep it going)\nDon't check me bitch, check your credit score\n(Ay, ay, ay, ay, ay, ay, ay, ay)\nOh yeah, drop it right here, fuck it\nYee-hee\nMan, good job\n\n[Verse 2]\nYou gotta learn from it, bounce back from it, treat it like it's nothing\nForty-mile drive from the crib, couple hundred tucked\nMove in silence, gotta be a prophet, is it really worth it?\nWake up in the morning thinking dollars need, that's a certain\nI can only do so much, I’m only one person\nEver since I got my money up, everybody hurting\n\"June can I hold a couple dollars? I see you up now\"\nAnd If I can’t do it then I'm fake, so fuck niggas now\nI used to have a whole lotta friends, I got a check now\nI used to have no whips at all, I got Vette now\n\n[Outro]\n(Ay, ay, ay, ay, ay, ay, ay, ay)\nShh, man\nGod damn\nSock it to me\n(Ay, ay, ay, ay, ay, ay, ay, ay)\nAnd bitch don’t play me bitch, play the lottery\n(Numbers)\nBitch you might get lucky, know what I'm saying?\nNumbers\nAy, ay, ay\nCardo what's happening?\nMr. Midnight\nSock it to me"}], "artist": "Larry June"}