{"artist": "Andre Nickatina", "songs": [{"title": "Ho’Lat", "album": "Andre Nickatina", "year": "2013-09-24", "image": "https://images.genius.com/fd314206c5ff2ff1e35633b30636c517.1000x1000x1.jpg", "lyrics": "[Verse 1: Andre Nickatina]\nShoot you like a free throw, don’t be no hero\nTurnt into a zero, I’m hard to find like Nemo\nPour wine on you like Nino, to the format\nWalk on you like a doormat\nI made a bet, did they score that?\nMan money I fold that, dice I roll that\nTell a freak to HO’LAT\nOh you decided, money you gon’ hide it\nAnd not divide it, never split the pie\nAnd then you’re gonna lie and straight deny it?\nHell's where your souls at, freak you’s a polecat\nAnd I’ma let you know that, and you can’t control that\nStraight expose that, until you HO’LAT\nStraight to the abyss, with a death wish\nPasta and fish, and cannabis, and a bucket list\nThat’s bucket list, and stuck in this, like a Stucky Fish\nAnd you know that, snap quick like a Kodak\nHomie where is that dro at? Yea you need to roll that\nIt's time to blow that Fillmoe, HO’LAT\n\n[Verse 2: Krazyie Bone]\nEvery time I come through, I sit her down what you wan' do?\nKnockout a nigga with the 1, 2/ I don’t need a gun dude\nAnd tryna run up was a dumb move, you niggas broke the number 1 rule\nNow I gotta show that, lil nigga where the doe at\nYou gotta reap what you sow jack, homie now you know that\nAin't no thang to throw a couple of blows and tellem HO’LAT\nYou niggas dealin with a monster, get in ya veins like ganja\nI been (raised??) like a doctor, crooked like a copper\nBomb like Osama, Bin Laden drama\nAnd you don’t really want that, the flow clean pullin' kojax\nDope fiends call it cold crack, sippin on the (bozac?)\nTell ya girl to come here so I can see if she a HO’LAT\nIf not back up off me unless (she tryna boss me)?\nWake em up like caffeine and coffee\nYou're gonna need an army to disarm me\n'Cus Im never ever heated softly, I keep a fo' fo' gat\nBodies on it call it throw back, Made nigga killin mo' raps\nI'm the typa man (???) toss you a hand grenade and say here (??) HO’LAT\n\n[Verse 3: Andre Nickatina]\nBeing caught up in the aftermath, is like a Magic Johnson pass\nBlack bag fulla filthy cash\nNow you flip the Steve Nash, how long will that last\n'cus time goes real fast\nGonna think you stole that, then you resold that\nHad to get that dough back\nNow its time to show that, quick control that\nWord life HOLD THAT\nThis is a film mix, like Stanley Kubrik\nNothing to fool with, get ya poolstick\nHit the Que ball, floss my white wall\nMy rise and my fall\nI know you know that, Fillmoe don’t hold back\nSan Francisco that\nNow where’s the hope at where’s the dope at, Homeboy HO’LAT\n\n[Verses 4: Krayzie Bone]\nDon’t gimme that shit, you niggas want a little bit of that fix\nYou know the Krayzie (gassin?) really got hits\nYou gotta be really swift if you really wanna catch my drift\n(Then I come with a slow rap??) peace love hate mo rap\nWhen I spit it on a dope track\nEverybody clone that, and get to thinking that they own that, they better HO’LAT\nTell em all look, real, recognize real\nRecognize steal and I recon you live\nJust with the skills, you can be killed\nEspecially when they tryna short stop my (meals/ mills)\n??? niggas where the dope at, give it to me let me roll that\nBlaze up, lemme smoke that\nAnd im toked, and im loaded, inhale through the throat, HOL’AT"}]}