{"songs": [{"lyrics": "Step on the lawn I keep the foot, peep\nIn the pot go six degrees of cooked geese;\nBoiling, blitz the beach of mushed peas\nOver ten meat hooks with a blister each\nI'm all pincer, fevery hoodie-on hoodie-off\nSweat through his E.T. sheets to the worry dolls\nNever met a quiet storm\nThat didn't grow into a choir of colliding horns\nThat go \"click click clack\" in territorial syntax\nSitting on the porch with his lids pinned back\nPinball whiz in a thimble of Sims\nI'm a symbol of whimsy abridged\nKiss Me, I'm Dead; nursing a mystery, DayQuil\nLed Zep staring daggers down page mill\nHow pray tell do he sit pretty?\nWhen the old one-two unglue in a tizzy\n\nPlease hold for the don't-play dull boy\nClick: I am not a page or a pull toy\nCame in the door and the floor is lava\nKilljoy if your core more Norman Rockwell\nBorn homesick for an invisible address, batshit\nBumble and bat around catnip\nOne black-heart Katamari massive\nPacked in a fat category-5 rat nest\nNose on his sleeve, holes in his inner peace\nRobot phone like a tentacle of flippancy\nI hate you (I hate you more)\nNo, I hate you infinity\nAnd Pangaea break into smithereens\nInterlude presto change-o\nIf it move too quick (oh whey oh)\nRight brain go write train Ramo\nMustache any old Monet, (no)\nYes\n\nMerrily merrily merrily merrily\nIn a cobweb tomb on a hotbed of heresy\nFrogmen schooled by the god Ed Emberley\nPull dog sleds and exhume Dead Kennedys\nBet: moth into kerosene awful\nA caution to straw men lost on Vaudeville\nAmorally mixing business\nWith 144 Dixie Whistlers\nLawnchair strongman twisted whiskers\nNASCAR Bic in his missing fingers\nOutcast from a system of kiss-the-ring-ers\nAre you privy to the misadventures?\n\nIt's electric, meeting in the middle of the street\nWith a lethally modified Piccolo Pete\nThere is admittedly an incredible mystique\nTo meddling in the reason a city won't sleep\n48 strings of twelve\nThat ring ring ring whiz-bang jingle bells\nAnd melt bootleg G.I. Joes to black taffy\nClassic fire-in-the-hole backdrafting\nFold wildlife out of Wolf Pack wrapping\nFull moon, bad knee, wool hat, caffeine\nTNT plunger in all-caps ACME\nBlast off half of the whole damn mapscreen\nNo sling no spear\nI'm a patchwork of 86'd springs and gears\nWho been stung by an unlinked pinky swear\nDuring his what-in-the-fuck-was-I-thinking years\nMaybe an awkward phase\nLike his acne and sophomore fade, played\nCalling all out-of-work action figures\nIt was death by Saturn Missiles", "title": "Saturn Missiles", "album": "Skelethon", "image": "https://images.genius.com/be7ecb35b49d25728281da97d28c2ca1.1000x1000x1.jpg", "year": "2012-07-10"}], "artist": "Aesop Rock"}