{"songs": [{"image": "https://images.genius.com/2cbec7b745c109ceb67758132235acd9.600x600x1.jpg", "year": "1998-08-25", "title": "Inside Job", "album": "40 Days & 40 Nightz", "lyrics": "[Intro]\nMr. X to the Z (who am I?)\nM-M-M-Mr. X (who am I?)\nX to the to-the-to-the Z\nM-M-M-Mr. X-X-X-X to the Z (yeah, yo)\nM-M-M-Mr. X-X-X-X to the Z\n\n[Verse 1]\nSo it's one fifteen in the mornin', I'm comin' up, a hard day, serve\nWe gettin' drunk, smokin' herb and the third dyke you roll\nNon-stop cash flow, 20,000 dollars and the rest cuttin' yayo\nWe had the rocks, my nigga late to pick it up\nGet him on the phone, hurry up 'cause I ain't tryin' to get stuck\nSo what the fuck is the hold up?\n(\"Nigga, sit your ass in the chair and I'll be right there\")\nReminds me I gotta shake the spot\nI got bitches in the hotel room ready for me to bang cob weight (*knock*)\nYo, who is that man?\n(\"He wanna spend a couple of hundred, but he'll be right back\")\nYeah, that's when I shoulda got the heater\nBut I was too busy in the kitchen countin' money and takin' shots of tequila\nStarted countin' out twelve when it hit me\nIf you was Rocksteady, you woulda came when the C-Note's rang\nBefore I could yell out to lock the front of my small dick (\"Ayy, ayy\")\nNiggas rushed in the front door with the gauge, ready, duck (\"Get yo' ass down\")\nBad enough I'm caught up in it, jacked\nBut worse than that, I'm caught in the kitchen without the strap\n(\"Where the muh-fuckin' sack, homeboy?\")\nYeah, woulda killed Terminators\nOnly D between us is a stove and a refrigerator (yeah)\nCame in and put the gauge to my chest\nTook the money off the table and said (\"Yo, where's the rest of it, nigga?\")\nYou gotta love it, came straight to the moneyman\n20,000 cash, neatly stacked, wrapped in rubber bands\nSnatched the whole shit and broke out\nI ran to the living room and got the heat from under the couch\nSmashed out into the middle of the street started blastin' (\"Alright, nigga\")\nDumpin' at the getaway cars but they was mashin'\nI thought I heard the homies just in time for the action\nPolice hit the corner with they reds and white's flashin'\nThese niggas rolled off with at least a cool fifty\nYeah, I'm in handcuffs on the ground and mad 'cause the K-9 bit me\nShipped me off downtown for the bookin'\nThrew my herb sack when the cops wasn't lookin'\nFingerprints, hold the tape, hear come detectors\nOne at the door, another one askin' questions\nStupid shit like, \"Who was I shootin' at?\nWas it gang related and where do they kick it at?\"\nBut I didn't say shit\nI can tell from all the people involved it was an inside job\nBut I'm the wrong nigga to rob, I'll hunt you down\nFuck the money, I'll take you off and accept the loss\nSet bail at fifteen G's, no sweat\nGot cars slippin' tonight, and almost got wet\nHomies come to set bail see, but that's all right\nSince I'm already here I'ma spend the night\n\n[Outro]\nHey, hey I need to use the phone again\n*Car horns*\nAy, ay man\nSince when did you start takin shoestrings and shit?\nMan, ahh\nDo I look like I wanna kill?\nAyy man, fuck that\nAyy, look... I just need to use the phone real quick man, eh, fuck it\nAight, ayy, let me get the top bunk\nAyy man, this, this, this blanket, this blanket smell like urine, man"}], "artist": "Xzibit"}