{"artist": "The Game", "songs": [{"title": "Bulletproof Diaries", "album": "LAX", "year": "2008-08-26", "image": "https://images.genius.com/bba1920bee43a618432ce43748293ec6.1000x1000x1.jpg", "lyrics": "[Intro: Raekwon]\nSit in the chair, yeah, yeah\nUh-huh, yeah\nSit my alligator jacket on the flo'\nLet that shit crawl around, whattup Game?\nHow are you my nigga?\nLet's get this money, you heard?\n\n[Verse 1: Game & (Raekwon)]\nMoney in zipped duffle bags, shotgun shells\nMy killas gorillas, niggas couldn't see 'em with gazelles\nFronting ass niggas, go hang with Pharrell\nTrying to be a Cowboy, you catch bullets like Terrell\nOwens, call it T.O., he leaking like a project sink\nBusted open like a hot dog link\n(Beef!) it gave me time to think, yeah I did my fucking prison thing\nCame out still on point, like the RZA rings\nI'm from Compton but my inkpen live in Queens\nRep the dub like Wu-Tang, and I got Killa Bees (respect)\nBlack Wall Mafia, new millenium Genovese\nGot a million dollars say LeBron don't win a ring (word?)\nI know Kobe, I be on the floor, \"Kobe!\"\nYou know a nigga that can score 81? Show me!\nI got a Cuban Link to a fuckin O.G\nAnd nigga you're too close, what the fuck, you trying to blow me? (back up)\nThis the face off (respect the don) diamonds all in the charm\n(Iced out) Where you be? (strip club, throwin ones)\nWhere you from? (New York, where you from?) Californ'\n(Big sharks) Me too (swimming in a pile of ones)\n\n[Interlude: Raekwon]\nYeah nigga, tomorrow man\nGoin to take you to go buy some 18-karat gold golf clubs nigga\nIn the Bronx\n\n[Hook: Raekwon & (Game)]\nThis the face off (respect the dons, hundred thousand on the arms)\nSon where you be? (Under palm trees staying warm)\n(Who you be?) Raekwon, who is you? (Amaz-on)\nI'mma keep it (Compton) Staten ('til the day is done)\n\n[Interlude: Raekwon]\nGeah, fronting on us nigga, it's like\nIt's like racing a nigga in Afghanistan to go get some oil nigga\nYou gon' fuck around and get your head burnt\n\n[Verse 2: Raekwon]\nI'm a New York dinosaur, Staten Island artifact\nHip-Hop's never dead, the Cuban gave 'em heart attacks\nSleep in the woods, target cats come from under the V's\nSneeze wrong, course I'm clappin\nKeep it movin homeboy, the mac's always actin\nSpit in your face, go 'head lil' baby rappers\nCan't fuck with us convicts, Stat-land\nIt's like actions, cliques'll die right with traction\nIt's Wall Street money and two gunny's\nSlammers is extra chunky, yeah, me and my red monkeys\nSilverback sales are few donkeys, all of us live comfy\nBlow your head off like lunch meat\nChef and The Game run the country\nTake over the world little girl, better stay out our brunch meetin'\nFuck with they paper their gun squeezin\nOff top, leak from the cop, then nigga jumped, this is front season\n\n[Interlude: Raekwon]\nYo, man yo Game man\nLet these niggas know man f'real man\nWe official man\nThey wan' be reading our autobiographies in a minute, ya heard?\n\n[Verse 3: Game & (Raekwon)]\n(Yo what if I was from Compton?) What if I was from Staten?\nI'd be King Kong knocking down the buildings in Manhattan\n(Gorilla warfare) Shootouts, real block shit\nWest coast assassin on some real 2Pac shit\nMy style's smoking like after a Glock spit\nGame get the blood money, fuck bitches and pop Crys'\n-tal like it's New Year's, cause this a new year\nLook at the tracks, either Bigfoot or The Game been through here\nThe Benjamins won't stop, and neither would a chrome Glock\nI kill a fire-breathing dragon with a dome shot\nCome through your hood in a Chevy Malibu, on stocks\nWe had a meeting before we got here, so shit gon' pop\nHeads gon' roll, Patron gon' spill\nFitted caps getting peeled like the chrome on the wheels\nGot a half a mil' say your wounds won't heal\nI declare war, nigga who gon' deal?\n\n[Outro: Raekwon]\nYeah, y'all know what time it is man\n\"Bulletproof Diary\" nigga, for real\nMany may read this man\nA lot of niggas might not make it home, you heard?\nWe speak for the real ones man, for the churchmen man\nAll them real general niggas man\nAll them niggas that's out there man\nDon't get no rest or none of that man, for real\nThe Chef nigga, Game whattup baby?\nI love you, ya heard? Super mad love for you over here for you baby\nYou know how we do it, we go all over the fucking world man\nGet a lot of bread man, word up, hun'ned my nigga\nWe take you to Boca Chica or some'n man, knahmsayin?\nSip on some motherfuckin, Don Julio or some'n, y'knahmsayin?\nWith two foul rings on, y'knahmsayin?\nCouple of mean Guatemalians wit us\nHalf Guatemala, half Somalian nigga\nNiggas ain't seen them colors man {*fades out*}"}]}