{"songs": [{"year": "1998-04-28", "image": "https://images.genius.com/b55066a4d9c23965c80b13a93ffa9cd0.640x640x1.jpg", "title": "Caribbean Connection", "album": "Capital Punishment", "lyrics": "[Intro: Wyclef Jean]\nWarning!\n\n[Verse 1: Big Pun]\nYo, wanna rumble with the Pun, huh\n*blows raspberry* Shit on the whole industry\nWho puff more Owls than Pun? Pile on more styles than Pun?\nWho the only one with over a thousand guns?\nRunning up in niggas cribs like I paid the bill\nMake you squeal the combination to the safe for wealth\nI lace your grill with the firestarter\nHit your wife with the sawed off in the shower, powers I've gotta\nI'm all about the fundamentals like Pun and pencil\nA piece of paper, a decent caper and someone to strafe you\nMy mental's compatible with the radicals\nMy odyssey type qualities allow me to poli' with animals\nNiggas is cannibals and the ghetto's the jungle\nWhere you either bet all your bundles or struggle on the simple and humble\nMy niggas'll rumble with any man for a Benny Fran'\nTry to imagine what they can fathom for twenty grand\nNiggas'll slice you and dice you into a thousand pieces\nWe pound out weak shit into the ground Uptown\nUp in the Boogie Down we just wallow in jean, pile on the green\nSurrounded in green like flowers in Spring\nBut now I'm a King, so it's more than money\nAll the honies used to call me Punny\n'Cause my fam was always hungry\nBut now we rolling lovely and you feel worse\nWant my money, let your steel burst\n'Cause I'd rather see you in Hell first\n\n[Chorus: Wyclef Jean and Big Pun]\nMucho trabajo poquito dinero\nI'm selling perico\nYo what's the deally yo\nI'm Uptown making moves just like Castro\nMucho trabajo (yo yo yo) poquito dinero\nI'm selling perico\nYo what's the deally yo\nHuh, I'm Uptown making moves just like Castro\n\n[Verse 2: Wyclef Jean]\nYo, yo, yo keep the lights, keep the camera, all I want is the action\nThe battle's on, where I roam in composition\nA hardcore crowd waiting to see if I break\nLike your first time in jail when you got fucked by an inmate\nIt'll never happen, I'm on balance like a Libra\nAnd if I get murdered, Don't Cry For Me Argentina\nPour me a cup of vodka, bury me next to my father\nIn three days, I'll rise like Christ and still sober\nNow my eyes open in my hands I got the Gatling\nI'm looking for the guy that sent me to say hi to Satan\nFists of fury, you wouldn't like me when I'm angry\nI turn Mr. Roger's Neighborhood topsy turvy\nFoes and enemies meaning the same in the dictionary\nThis ain't Pictionary, all you see is the cemetery\nBodies from World War I and II is there\nYou don't want a third war, that's nuclear warfare\nSo Big Pun, count the stacks, make it fast\nIllegal money turns legal now we running a laundromat\nYour hunchbacked and wack rap is packed in your backpack\nYour better off in D.C. with the mayor smoking crack\nThis ain't a diss, Wyclef bomb threat\nRun out of the building or get blast in your Guess\nTEC for TEC or we can go text for text, oh\nI forgot, you don't read so take this hole in your chest - blaow!\nHide the blood, give you the gun, run and hide\nSo when the DT shows up, he thought it was a suicide\nSuicide, it's a suicide...\n\n[Chorus: Wyclef Jean and Big Pun]\nMucho trabajo poquito dinero\nI'm selling perico\nYo what's the deally yo\nUh, I'm Uptown making moves just like Castro\nMucho trabajo poquito dinero\nI'm selling perico\nYo what's the deally yo\nUh, I'm Uptown making moves just like Castro\nMucho trabajo poquito dinero"}], "artist": "Big Pun"}