{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/9546441ab467d0ff8079eccdfb824801.500x500x1.jpg", "title": "Cruise Control", "year": "2011-10-10", "album": "Wheels Up", "lyrics": "[Intro: Kid Ink]\nYeah, yeah, uh\n\n[Chorus: J. Valentine]\nI'm speeding on the freeway tryna get home\nPushing it to the max, she can't wait that long\nFeel like I'm gonna crash and burn\nI hit my last turn, but she already let my hands go like\nCruise control, let me hands go like\nCruise control, let me hands go like\nCruise control, let me hands go like\nCruise control\n\n[Verse 1: Kid Ink]\nFeel like just a week ago we were so equal\nWhere we get divided, my time is for me though\nWish that I could repo your love and sew up your heart\nI see you hurting from the pain, I shoulda known from the start\nBut now I'm speeding, leaning, pedal to the metal\nI got my reasons but all they worth finna losing you forever no\nI'm down girl, knee deep\nIn between the lines, tell me can you read this\nIssues on top of issues\nBetter leave them in the rear view, baby it's official\nI need you on my side, by my side like a pistol\nSo baby girl don't leave me, bring that back, replay\n\n[Chorus: J. Valentine]\nI'm speeding on the freeway tryna get home\nPushing it to the max, she can't wait that long\nFeel like I'm gonna crash and burn\nI hit my last turn, but she already let my hands go like\nCruise control, let me hands go like\nCruise control, let me hands go like\nCruise control, let me hands go like\nCruise control\n\n[Verse 2: Kid Ink]\nGo, why you let me go?\nReally needed you there, shoulda let me know\nUh, coulda let it show, no reason to be insecure\nSwear I got everything you need but you tell me you still need more\nSo now I'm swerving, far away from perfect\nThen you pay attention and tell me it was worth it, worth this\nI got my foot to where the gas\nTryna make it fast, we gotta make it last, uh\n\n[Bridge: J. Valentine]\nBaby I don't know how we ended up, never thought we'd end up this way\nCan't eat, can't sleep, nobody coulda told me there would come a day\nThat you don't love me, you don't care\nI'll be turning over, you won't be there\n\n[Verse 3: Kid Ink]\nGone, can't believe she gone\nIt didn't seem that long, but now we all alone\nMusta made a wrong turn somewhere, tell you where it is but you heard something else\nHe say, she say, CA\n\n[Chorus: J. Valentine]\nI'm speeding on the freeway tryna get home\nPushing it to the max, she can't wait that long\nFeel like I'm gonna crash and burn\nI hit my last turn, but she already let my hands go like\nCruise control, let me hands go like\nCruise control, let me hands go like\nCruise control, let me hands go like\nCruise control"}]}