{"songs": [{"title": "Flexin", "lyrics": "Flexinnnn! Flexin\n\nFlexin, flexin, everyday I'm flexin\nIf flexin was a crime they gon have to come arrest me\nThey ask me what I'm doing thats a good question\nLet you niggas know soon as I get done flexin\n\n[Young Jeezy]\nYoung you stay killin em\nBitch I gotta hit list on that murder 1 kush\nBitch you gotta hit this\nJizzle in that 5, 9,9 you can't forget this\nDont make me hop up out this pretty bitch and take a twitpic\nForeign bitch with me yea she take a big dick\nForeign m60 yea I take a big clip\nWe understand the top damn nigga where your doors go?\nBitch I'm on the move\nWhat the fuck I need some doors for?\nShooters right behind me yeah they in that Escalade\nYou know how to find me\nShooters in the Escalade\nKillers on payroll\nBitch you move my neck work\nLeft the house with all my chains on\nLook like my neck hurt\n\n[Hook]\n\n[Fabolous]\nIm flexin..flexin\nAin't moving a muscle though\nCome through in some foreign shit\nYou checking it like customs ho\nAmerican Gangster: chase them Franks like Russell Crowe\nThem Benjamin Franks in case you lost or just don't know\nI got my BET on that's my Black Watch\nAnd all I do is win my pockets look like jackpots\nCheck my calender it say I'm flexxin all summer\nSo your lucky day is when you get a call from us\nWe in and out them stores they think we the mall runners\nI never change thats why I carry all hundreds\nI'm doing me and yo bitch is who I'm next to do\nOther than that the schedule is flexible\n\n[Hook]\n\n[Yo Gotti]\nI'm flexin, flex, looking like a million bucks\nDouble story white house that bitch a million plus\nLook at my garage everything I ride a hundred up\nIf I ain't the gangster of the year\nThen im the runner up\nFlexin, Flexin\nAston Martin Texan\n9-11 Porsche car triple doors that bitch sexy\nStraight cash shawty motherfuck a credit card\nSee me in the club..\nLooking like a fed charge\nBrick talk dopeboy shit making money fly\nSpotlight center of attention\nI ain't gotta try\nFlexin\nPresidential Roley with the ice in it\nCloset full of Gucci shoes cost more than your Breitling", "album": "The Real Is Back", "year": null, "image": "https://images.genius.com/49ea416b94fcf582ca9877e42c2bad2b.1000x1000x1.jpg"}], "artist": "Jeezy"}