{"songs": [{"album": "The World Ain’t Enuff", "image": "https://images.genius.com/aacbaca3b07ab6c68caf4ac5bedb0d81.776x768x1.jpg", "year": null, "title": "Can’t Stop Me", "lyrics": "[Tela]\nI'm off this red-eye shit\nLost thinkers ain't seen shit\nMy bitch bowlegged and shit\nThick thighs with them hazel eyes\nSmell the air, the night is mine\nYou busters think I'm lyin\nI'm fin' to go in this casino now\nAnd lean up on them tables, why?\n\nCompulsive gambler with a compulsive hammer\nBitches be takin pictures with the get'em'hoe cameras\nBy this time a lot of niggas got enter\nThrow my shit 'cross to the pit boss Montana\nComin out cause I'm feelin real good\nWith a look like, \"Bitch I wish you would\"\nTry to slow my roll, hold me up\nIt ain't gon' go, not this time bitch no\nI'm back up in this hoe, for the lights\nI want them D's, the titles, the rights\nI'm laughin loud cause I'm feelin real nice\nI spins around in my chair twice\nI tap the pad part real real hard\nThis table heah, y'all can just disregard\nYOU hoes need to keep on walkin\nCause y'all gon' fuck me up with all that talkin\n\n[Chorus: repeat 2X]\nCan't, stop me baby I'ma baller baby\nI'm too hot to ladies play-boys baby\nCan't, break me baby cause I'm paper baby\nCan't, hate me baby gotta love you baby\nCan we ball? Where my dogs?\nWhere my broads? (Hook us up) Alla y'all\nCan we ball? Where my dogs?\nWhere my broads? Alla y'all\n\n[Tela]\nI started last night but now it's sunny\nLong run like Marie in Dunny(??)\nBitch on the side buggin, look honey\nAll I'm thinkin is, big money\nPussy don't come poke I don't fuck if I'm broke\nThat's how half these niggas done, lost they stroke\nNow, slide them lights and blow on my throw I\nShakes 'em twice through the air they float, point\nTwenty-five on the line (6 the easy way)\nThirteen in the field, 50 odds, oh my God\nMy whole table charged\nI picks up a hundred eighty-eight yards\nSparks, balloons, room, V.I.P. cards\n(Hook us up) You fuckers think y'all smart\nWho sent y'all?  Hey fuck y'all\nFuck these cards, I'm outta Dodge\n\n[Chorus]\n\n[Tela]\nTowards the do' my ass done stopped\nYou guessed it, I'm at them slots\nI drops two rubber bands, why not?\nI'm up a hand at the MG Grand\nTwo mo' honeybuns the whole shit locked\nBig guns, seven across, jackpot\nMy ass is hot, I'm heated\nI'm scorch, I'm holdin it down, I'm runnin the court\nIn other words to make a long story short\n.. I know the fuckin sport\nI got the owner bout to shit his shorts\nI got the city on life support\nAfter this run I'ma sit and soak\nCause after this run, ain't SHIT broke\nAfter this run, I don't need to smoke\nI'ma get a bitch and get throwed on the boat"}], "artist": "Tela"}