{"artist": "Watsky", "songs": [{"year": "2012-06-11", "lyrics": "[Intro]\nDJ Nu-Mark, Cut Chemist\nThank you for the inspiration\n\n[Verse 1]\nMy looks wrong, I know I sound odd\nBut when I hit the mic the first time, I found God\nI'm not downtrodden, lack a great bod, and I be looking more like the crowd on Cape Cod\nBut ever since I pumped up my Reeboks, before \"Fiddy\" and his unit from the G block\nI been rhyming in the mirror, blending in, like a diamond in the clear, trying to strut it like a peacock\nI taught myself how to beat box\nWhen I was listening to J5 and Pete Rock\n2Pac and Chief Rock, you know, that we gotcha\nChillin' like a meat locker, hotter than some sriracha\nSip a bitter memory, and make an ugly face as if its nothing but some cheap vodka\nJust some fuckin' mind erasers\nBut I'm from the bay, and we don't spend a dime on chasers\n\n[Hook]\nAll I wanted to do is write rhymes\nAll I ever wanted to do is write rhymes\nAll I ever wanted to do is write rhymes\n(Huh?) Is that a crime?\n(What?) To write rhymes?\n\n[Verse 2]\nI don't be an economist\nI don't want to be a cheap novelist\nI don't want to be a weed or a botanist\nI don't want to be a pimp or bottom bitch\nI don't want to be a strip club manager\nAnd I'd hate to be a strip club janitor\nMopping up for crusty ass customer, bustin' their nuts in the cuts\nI just wanna bust a verse\nI don't wanna be a court jester\nI don't want to be a royal poison tester\nI don't wanna pick up dog crap for park and rec\nAnd I don't want to be a doghouse architect\nI don't want to be a server\nI don't want to flip beef burgers\nBe a beat maker\nA Walmart greeter\nA CEO, an astronaut or a fucking sheep herder\n\n[Hook]\nAll I wanted to do is write rhymes (Oough)\nAll I ever wanted to do is write rhymes (What?)\nAll I ever wanted to do is write rhymes (Okayyy!)\n(Huh?) Is that a crime?\n(What?) To write rhymes?\n\n[Verse 3]\nBut the sad fact is, most real folks don't get don't get to practice\nWhat we love for a living\nWe do backflips\nAnd no matter where we're at on the atlas\nEarth spins on its axis\nIt's back to the rat race\nWe run the hamster wheel at a mad pace\nWe'll run laps till our last days\nJust a beast till the last rose petal drops in the glass case\nI'm one of a lucky bunch\nBut I upchuck my free lunch when sucker punched\nI'm fucking up, I don't want to free pass\nWhen my ancestors potatoes rotted in the field they would have to eat grass\nAnd folks put on ski masks\nWhen their back's against the wall throwing right hooks\nAnd I just wanna pen verses, write hooks\nMan I'm such lucky asshole\nSomeone fucking slap me with my rhymebook\n\n[Hook]\nAll I ever wanted to do\nI said, all I ever wanted to do\nAll I ever wanted to do\nMan, all I ever wanted to do", "image": "https://images.genius.com/15b416d55e0958076696e8b871573bd9.500x500x1.jpg", "album": "Nothing Like the First Time", "title": "All I Ever Wanted"}]}