{"songs": [{"year": "2009-01-30", "album": "C4", "image": "https://images.genius.com/8b626036c563b0aefa7a5b83f1fb9302.750x750x1.jpg", "title": "Friend of Mine", "lyrics": "[Intro]\nCome on\nMe, I've been searching, for that right one\nAnd hopefully I found her\nI found her\n\n[Verse 1]\nMy nigga tells me 'bout this girl that he knows, oh\nSaid she the type of girl that I'm looking for, oh\nShout me her number and said make sure I call, oh\nGot straight to the point when she picked up the phone\nWhen she picked up the phone she said hello and I said\n\n[Hook]\nA friend of mine said that you were the one for me\nA friend of mine said that you was with everything\nA friend of mine said that you are good company\nA friend of mine said that you got good pussy baby\nGot good pussy baby\nCan I sample baby? Cause I'm curious, curious\nI want it baby\nGotta have it baby\nSaid I need it baby cause I'm so curious, curious\n\n[Verse 2]\nNow girl I don't mean to come off so strong\nBut I heard that you got the love that I want\nCan you promise me that it's true what they say?\nBefore you tell me your name? Is you with it?\n\n[Hook]\nA friend of mine said that you were the one for me\nA friend of mine said that you was with everything\nA friend of mine said that you are good company\nA friend of mine said that you got good pussy baby\nGot good pussy baby\nCan I sample baby? Cause I'm curious, curious\nI want it baby\nGotta have it baby\nSaid I need it baby cause I'm so curious, curious\n{Bridge}\nTell me is you with it?\nIs you with it? (4 times)\nTell me are you with it?\nAre you with it? (4 more times)\n\n[Verse 3]\nGive me that funk, that sweet, that nasty, that gushy stuff\nThat coochie, that twat, that pussy stuff\nWhatever you wanna call it, I can't get enough\nI can be your lover, be your friend\nBe your number one or your ten\nBaby yell dress, and just like UPS or FedEx girl we can both send\nThen pray in the morning, then after we pray more play in the morning\nHave it your way like a shoe custom made whenever you need\nOr maybe like a chain of Burger King's\nI promise if we do it, I'll remain serene\nI truly understand\nNobody gotta know like a group of yes men\nSo momma don't trip\nAnd if it goes well we can make you a flip\n\nSo what it's gon' be miss lady my clock is tickin'\nSo please tell me you accept my proposition\nAre you gonna tell me now?\nOr you need more time if you do that's fine\nAs long as it goes down, girl make up your mind"}], "artist": "Kendrick Lamar"}