{"artist": "E-40", "songs": [{"title": "Do What You Know Good", "image": "https://images.genius.com/841113c618ea11b5cbd44a43565e925e.788x768x1.jpg", "album": "Charlie Hustle: The Blueprint of a Self-Made Millionaire", "year": "1999-11-09", "lyrics": "[E-40]\nFreak nasty super bad, earring in her tongue\nSmell good, Prada bag, angel perfume cologne\nI'm tryin to have me that, lipstick by Mac\nMake like a car accident, hit her from the back\nMy fetti might be salty but my game ain't damp, see I be hood(?)\nBut the only cheese I ever had, was from the goods\nAnd man that was divided among (?) brothers and sisters\nRaised without a dad\nBasically we was supposed to be have to make good\nBut what we hadn't (?) get the gat from one of my (?)\nOn the tough, Uncle Bruce(?)\nHustle in my veins and lungs, sucker pump\nChickenheads squash through my hood, with good intentions\nBut always end up sparkin antennas on bus benches\nWatchu know, whatchu say, what's the sco'?\nIs it a go? Then you with me after the show\nYou smell? We hit the hotel, and knock boots\nTaught me some thangs, like who? Like Dr. Ruth\nHEY!! (HEY!!) HOE!! (HOE!!)\nAll up in the kitchen on the flo', feel the mantra\n\n[Chorus: repeat 2X {​sung}​]\nDo what you do good, cause you know what you know good\nDo what you do good, cause you know what you know good\n[Do what you know good]\n\n[E-40]\nUhh, rappers sport my style like they sport clothes\nThen have the nerve to say they made it up, now that's some hoes\nThat ain't no stickin to the rules and regulationship\nThat ain't no man if he can't admit he grew up on The Click\nOn the East they got hot dogs and pretzel stands\nOn the West they got tacos and burrito vans\nIn the South, it's (??) and briscuit\nWhat about the Midwest? The midwest, dey just love to kick it!\nTop shelf, ghetto tycoon the area sponsor\nCan't be seen, like Bigfoot, and the Loch Ness Monster\nDialin for dollars paper route and money counters\nScrilla scratchin paper chasin poppin collars\n\n[Chorus]\n\n[Singer]\nDo what I know good\nI kick it in the hood real good\nSmoke real fat big blunts\nSticky-ickies to the lil' krunks\nThirty-one double-eight-seven, that's nine-eleven\nAct like you're livin\n\n[E-40]\nI ain't no Captain\nAt the bar, signin autographs on napkins\nBall til we have it all - bartender talkin about\n\"Last call for alcohol!\"\nI'm bout to get to, mashin on that (??)\nIf we don't get no mo' (??) throw glasses at that Moesha fag\nAnd I'm walkin up out the do', step stuck and stutterin\nDidn't even screw up and hit the floor\nIf I woulda fell, it woulda been embarassing\nFull of that there liquor, walked into a closet\nBut I'm a king size nigga, baby pull my coattail! And just..\n\n[Chorus]"}]}