{"artist": "Watsky", "songs": [{"year": "2012-06-10", "lyrics": "[Intro]\nHey man, you heard the new Eminem track? It's crazy!\nYeah, I heard it like six months ago, hecka long ago!\nAll the tracks on Chronic 2001, dude they're just crazy\nShut up, man! Let me get some hot cheetos tho!\n\n[Hook]\nYeah you're hot\nBut the difference is the differences I've got\nIt's what I'm not\nYeah, the difference is the differences I've got\nYeah you're hot\nBut the difference is the differences I've got\nIt's what I'm not\nYeah, the difference is the differences I've got\n\n[Verse]\nSuspended the same month I won the city science fair\nI won most likely to succeed and teachers nightmare\nGuess I was quite scary, some hate a binary\nSent to the principals office straight from the libary\nBut since my voice was about as high as Mariah Carey\nWhen I had the douchey spiky hair like Guy Fieri\nMy flavor was a mystery you never knew what you were getting it could be some mild or some Wild Cherry\nJust read my diary, cause I'm wirey\nBut I'm irie, and I spit it firey, hire me\nI wouldn't hurt a fly\nThough sensitive you never heard me cry\nBut I got a certified dirty mind\nSo grab some turpentine, a dash of listerene\nAnd splash my mouth out with a gallon jug of Mister Clean\nI'm flashing on every asshole up in the classroom\nI'm planning on coming sick I hope you had your antihistamines\nBefore I split the scene, and we can puff pass\nCause I'm an honor roll kid who liked to cut class\nA babyface but I tend to shave with a cutlass\nAnd If you switch the picture to HD you'll see my mustache\nI tend to slow it down when they want just fast\nI'm a vegetarian who thinks that PETA sucks ass\nI bring the ruckus, while shmucks be kissing my tuchus, I bookishly bust it nasty, you should be rocking a dust mask\nI like smoking dope, but won't pop a pill\nI think Oprah's ill, but I loathe Dr. Phil\nI got the propers to a topple your whole metropolis stomp an impossible obstacle I won't be stoppin' to chill\nFrom Chapel Hill to the big apple I travel the map just trampling bastards but then I handle their hospital bill\nIf there's bees in the trap I'm catching em\nBy the thorax and abdomen\nAnd sanding the stingers down to a rough quill\nThen I dip em in ink, and I scribble a bit\nBut if it they wriggle then I tickle em until they hold still\nLemme say it again\nIn my land of pretend\nI use bees as a motherfuckin' pen\nBut a lot of the guys I know\nHave been saying that I'm so so\nThey're not a believer\nThat I'm a keeper\nB-b-But I don't know\nMaybe it's cause I be looking like Leave it to Beaver they're thinking that I don't flow\nEven if I could be running in circles around em as if I'm gyroscope\nI'll enter the draft and I'm thinking I might go pro\nRunning the jungle like I'm an albino rhino\nDeep in the undergrowth\nFuck a disaster, bring on the asteroids\nNever gonna be massacred like all of the dinos though\nBring on primal vinyl magic show\nI'm turning a blind eye to the bull crap, waving bye bye\nZippity doo dah\nSuck on my booty\nDone with the bad luck\nPut on my brass knucks\nAnd I cold cock any Pol Pot in the whole spot, with that boom\nI'm Fiddler on the Roof hitting Hitler in his fruits of the loom\nI'm Jew, on the right side but it's true\nI'm a Christian on the left\nSide of my family crest, dude\nI've been to public school and private, been unpopular and popular and I don't think people pop from a test tube\n\n[Outro]\nDifference is the differences\nDifference is the differences\nYeah, the difference is the differences I've got\nDifference is the differences\nDifference is the differences I've got\nDifference is the differences I've got\nDifference is the differences I've got\nDifference is the differences I've got\nDifference is the differences I've got\nDifference is the differences I've got\nDifference is the differences I've got\nDifference is the differences I've got", "image": "https://images.genius.com/15b416d55e0958076696e8b871573bd9.500x500x1.jpg", "album": "Nothing Like the First Time", "title": "Difference is the Differences"}]}