{"songs": [{"album": "Now or Never", "image": "https://images.genius.com/c76c49d728c583665c64123cf97fa389.600x600x1.jpg", "year": "1997-01-01", "title": "B.I.G.P.I.M.P.S.I.S.I.", "lyrics": "[Verse 1: Tela]\nPut that ass on a plane, first class not coach\nFuck with her brain a little bit, befo' you show the ho the ropes\nLet her know everything you say and do is all true\nSo even if ya lying she'll believe the plan is fool proof\nClear blue skys coming through on Continental\nThe game ain't changed, it's all the same you see it's quite simple\nTake her to the shop, you know, to get her hair and her nails done\nEven take her to the mall\nBuy her some pieces, some real nice ones\nLike Chanel suits and boots, never give the ho the loot\nEverything that she possesses has to come through you\nEven the petty, fetti that you keep ready\nUnder the mat of your Eddie Bauer check it every hour\nMoney, power\nAnd that's cool, but respect you'll earn\nSo you gotta let this ho know or you might get burned\nShe'll be like, \"Um, I'm sore and tired and I can't dance\"\nPut that ass back in the club cause she clowning you man\nThat her plan\n\n[Hook]\nB.I.G. to the hump back I\nM to the hump back crooked letter I\nCrooked letter I\nBig pimps is out\nBig pimps is out\n\n[Verse 2: Tela]\nCall it \"the sweetness\"\nGot me some pieces\nThat bring about three of the fo' on the weekends\nCustomers, deacons\nLawyers, shrinks and\nSome of them paying for time just to speaking\nThey like my Angelita she's my bad Puerto Rican\nShe's been known for getting at some without the freaking\nMan you need to see this\nThis be niggas weakness\nCaught up in a pretty ass face but I'm a genius\nI let 'em all know it ain't your face, it's the doe\nAnd the only face that keep me in place is on my roll\nShe brought back a light one\nHo I need to ice one\nAnd if you ain't making up for this you need to heist one\nShit that's it, you know they hustlers too\nHustle niggas outta dick and make you think it's for you\nSo you need to watch yo' gal like you watching yo' mail\nAnd you need to watch yo' mail like you watching yo' gal\nOh it's hell\n\n[Hook]\n\n[Verse 3: Too Short]\nYou know Short Dawg keep them bitches broke\nThey want a piece of money they go crazy fo' sho'\nI told you 'bout spoke holding all them hoes\nGot you at the shopping mall buying clothes\nNigga you too nice\nThat's your motherfucking problem\nAll up in that stanky ass pussy with no condom\nTalking 'bout \"I love you\" 10, 20 times a day\nYou gotta make her life better, you trying to find a way\nYou need to quit it man\nCut it out, stop it\nIf your bitch ain't trying to no fucking money in your pocket\nWhile you're financing that ho\nYou ain't know?\nYou ain't heard about the shit she used to do befo'\nThe bitch is sharper than a razor blade looking for a pay day\nA natural born hustler, trying to stay paid\nNow she got a beeper and a phone and a Lexus\nBig balling in Atlanta, L.A. and Houston Texas\nBitch\n\n[Hook]"}], "artist": "Tela"}