{"songs": [{"title": "Fear", "lyrics": "Nothing is to be feared only to be understood\nIntoxicated often does what\nThe sober would, if he thought he could\nIf he had the power, he'd abuse it and that seems clear to me\nWhat is dear to me, is also fear to me\nBecause pain is the price of what I hold near to me\nTo which I'm attached and I can't light the match\nIf I did I'd see everything I think I lack, is right\nHere already, I'm a part of it, not the end and nor am I the start of it\nBut apart nonetheless, scared of what is under flesh\nAnd everything I can't posses so instead I disconnect\nAnd to numb the stress, take a blunder guess\nRather than know, I don't know and just accept\nI view it as a test and I must pass, it's only real if\nIts something that I must grasp\nNothing else counts a bit if I can't count\nIt quick, so lets count figures\nLet us count figures. Figures in the bank\nFigures mowed down by tanks, the steel boot of the figure stamps on the\nAnts, but they want more than figures\nWe ain't figured that we need \u008cthem\nAnd we're projecting the reflection of how were really feeling\nWhen we kick \u008cthem kill \u008cthem, leave \u008cthem there dying bleeding\nAnd say they did it first, we are just getting even\nAnd repeated until it's something that we can believe in\nThe truth is that inside we are screaming\nAnd we hate ourselves that's why we act this way\nWhen we strike out we should punch ourselves in the face\nThat is what we are really doing, got no clue what we're pursing\nThe mirror or the million, what are we really viewing?\nWe can take a microscope and analyze atoms or telescopes to the sky\nThe same thing happens, it's the same picture, they both go on forever\nSo when we place limits on things, is that clever?\nIn fact I define myself by my limitations, my station or my status\nOr my silly faith in papers. The type that I read or the type that say I've\nRead, the type for which they bleed or the type that say you bled and now\nThe ego's fed but never had its fill, so until we shed, let's accept the deal\nWe will steal and will kill just for the thrill, that's my dose of truth\nGive me the blue pill And let me swallow, wallow now in my sorrow\nDon't want to find my own Truth it's easier to borrow", "year": null, "album": "Knowledge Is Power Vol. 1", "image": "https://images.genius.com/95f4dbc07c7455e0bbf14b55f99cc7a0.918x1000x1.jpg"}], "artist": "Akala"}