{"songs": [{"title": "Sho Shot", "album": "Necessary Roughness", "year": "1997-01-28", "image": "https://images.genius.com/348d222084080ed7394d3365fd28723e.600x594x1.jpg", "lyrics": "Yikes!\n\n[Rage]\nUh-huh, right back at cha\nUh-huh, The Lady of, The Lady of Rage\nStill remain the undisputed\nAhh, still hit MC's like (\"Hadouken\" *Street Fighter sound, from Afro\nPuffs*)\n\nUh, I begin like this; with the wicked ass flow\nSomethin for you wack MC's to think about y'know (you what?)\nYou better be on point (they what?), ya better be on deck\nYou better be strapped and buckled down cause I'mma wreck\n*tires squeel, car crashes and glass breaks* like vehicles\nI pop suckers like sickle\nI tickle your fancy like Nancy I will Wil-son get ill son\nRock it from Farmville, the Tilden Projects (hah)\nConcealed when I wreck\nSo hey, step like stairs, or prepare for the levitate (to what?)\nTo mount up on that ass like Warren G the Regulator\nI won't hesitate to put a sucker on his back (uh-uh)\nI don't hesitate to take a sucker out like that (uh-uh)\nI close my eyes and dig deep into myself\nCome up with the shit that's hittin harder than belts\nCause I'm spankin, fakin MC's\nOff the batboard smack another hit from the back door\n\n*chorus*\n\nIt's that Sho Shot shit I release\nMC's from the West and the East get a motherfuckin piece\nCause it, ain't where ya from it's, where's ya gat\nAnd the lyrical attack is where my ammo is at\n\n(repeat 2X)\n\nNow they call me Rage cause I rush and come down like a hammer\nLive rhythm get driven by vocal vehicular grammar\nUntouched, the walls come crumbling down\nYou get clutched, in my clutch is fifty feet from the ground\nFatally feminine, poisonous enought to extinct\nCities of war fled the valley, so all of Cali sink\nI come stompin like Snoop, hit the N-Y next\nI ain't puffin up that shit between the East and the West\nI use my, hip-hop precision, perfectly put to use it's\nMetaphoric phrases, spittin like deuce deuces\nContinuous and strenuous, crafty and shady\nBrothers notice me like Jodeci, now Forever They Lady\nI puts it to ya like this, you can despite me, dislike me\nI makes money like Spike Lee\nYou either wanna be me or be just like me\nI'm nasty, nice-ty, no sheisty\nAhh, so cold I'm icy, hah, so throw them dice G\n\n*chorus* (repeat 2X)\n\nNow I speak with expertise, and any heffer won't beef (moo)\nI be that A-1 Sauce, on your lips like floss\nI eat suckers as my entree, Rage got da bombay\nI gets total wreck and I ain't, playin wit a full deck\nIt's just this, ace in your face, kicks from Earth to outer space\nGimme space room to breath, roll up my sleeves just to breeze\nBlowin up the spot like infrared dots on your knot\nYour knoggin, lyrical murderer a Rockin Robin\nI be dishin out that puddin, all you suckers pussyfootin\nBe actin, but I ain't got time for theatrics\nMy crews be crushin, shitty MC's\nI be flushin down the commode as I explode cock back and reload\nRight the beat until they say WHOA\nThen they tell me, \"Momma don't hurt me no mo'!\"\nI'm strictly bout them skills on the reala\nStrictly bout this motherfuckin MC cold killa, illa\n\n*chorus* (repeat 4X)\n\nIt's that Sho Shot Sho Shot Sho Shot\nSho Shot Sho Shot\nIt's that Sho Shot Sho SHot Sho Shot\nThat Sho Shot Sho Shot sheeeeit\nIt's that Sho Shot Sho Shot sheeeeit\nThat Sho Shot, sheeeeit, sheeeeit\nThat Sho Shot Sho Shot sheeeeit\nThat Sho Shot Sho Shot sheeeeit\n\nUhh, the heavyweight undisputed, still hit MC's like\n(\"Hoo-yu-ken!\") break it down now\nLyrical murderer, hit MC's like what?\n(\"Hoo-yu-ken!\") c'mon now\nAin't a damn thing changed\nI still remain, the ill, reputed\nAnd just in case y'all forgot or, just didn't know\nI hit MC's like (\"Hoo-yu-ken!\") break it down now"}], "artist": "The Lady of Rage"}