{"songs": [{"image": "https://images.genius.com/27c022d369c7e950576014789d414c55.900x900x1.jpg", "lyrics": "[Talking before song: Mac Lethal]\nMan I drove by chick-fil-a yesterday\nThere were a bunch of protesters singing the national anthem....\nFor the first time in my life\nKinda wished two dudes woulda jumped outta the bushes and touched dicks..\n\n[Start of song: Mac Lethal]\nI woke up in the morning and the sky was a little grey\nThere was 800 people outside of chick-fil-a\nProtesting, god damn\nHolding homophobic signs in thier hands\n\nI was like \"geez, ain't that a little much?\"\nAll I really wanted a little lunch\nBut since they won't leave gay people alone\nHere's a recipe for y'all to make easy at home;\nLets go!\n\nFist you got to get ingredients to use:\nBoneless chicken breats, salt, pepper, peprika too\nVinegar, egg, and a dabble of milk, with the oil, and two types of flour\nBaking soda, dry mustard, pickles, and malted milk powder\n\nIcing sugar\nSome honey butter and some pickle juice\n8 fluffy wheat buns\nNow we getting loose\nMac lethal, oh damn man, he spits the truth\nLike sarah palin is a man with a missing tooth\nNow\nPour a little whine from your bottle\nGet a big ass knife to cut the chickens horizontal\nMarinate them in a bowl of pickle juice for half an hour\nThis would be the perfect time to take a nap, or bath, or shower\n\nSeason 'em with pepper and salt\nMassage the peprika into them for better results\nYou gotta get up, and get you a dish\nRemember the egg and milk is mixed in the water with pickle baby give it a wisk\nGrab another bowl to pour all the sick four, icing sugar, dry mustard, soda, and malted milk powder\n\nDoes it need a secret ingrediant?\nOf course it does\nOne teaspoon of Rick Santorums blood\n\nG-what cousin?\nYou be nut huggin'\nYou and your hetero buddies giving each other high fives\nMitt Romney turned Mormon to marry five guys\nIn a dutch oven, pour the peanut oil in to give it a nice fry\n\nHeat it up to 325\nBut not a single bit more, you dont wanna burn it\nDip the chicken breast into the egg bowl\nThen dip it in the powder bowl\nSmother it, and cover it, and turn it\n\n5 minutes later, take it out and dry it\nCut and toast a bun, put some pickles on it; try it\nIf you like chick-fil-a, good, it tastes just like it\nIf you hate chick-fil-a, better, you ain't gotta buy it; anymore", "year": "2012-08-03", "album": "YouTube", "title": "How to Make Your Own Chick-Fil-A"}], "artist": "Mac Lethal"}