{"artist": "Cardi B", "songs": [{"title": "Pop Off", "album": "Gangsta Bitch Music, Vol. 2", "year": "2017-01-20", "image": "https://images.genius.com/7be2b7a5745ed121ebf721f0598de04d.999x999x1.jpg", "lyrics": "[Intro: Cardi B]\nThem motherfuckers be like, \"But what type of niggas will wife you?\"\nMy type of niggas will wife me! The type of niggas that like bitches that pop off and suck dick all day motherfuckin' long, bitch\nThanks to all my followers that always defended me, y'all like my god brothers and god sisters. I would dead jump in your fight, I would dead jump in your fight. Now what's poppin?\n\n[Hook: Cardi B]\nWho wanna pop off?\nWho wanna start war?\nThey talkin' shit?\nI'm takin' tops off\nJeans, off\nWeaves, off\nRings, off\nEverythin', off\nWho wanna pop off?\nWho wanna start war?\nThey talkin' shit?\nI'm takin' tops off\nJeans, off\nWeaves, off\nRings, off\nEverythin', off\n\n[Verse 1: Cardi B]\nI'm startin' to lose my patience, weak bitches hatin'\nBitches throwing subs like I won't kick your face in\nBaby mama's mad 'cause I'm in first place, and\nWhen it comes to you bitch, there's no conversation\nI been to give it up grimy, I'm the Bronx bitch, I'm feisty\n\"Cardi why you feisty?\" Shut up bitch, fight me\nNY raised and so you know it's very likely\nThat when I hear some shit that I don't like, I get hype B\nWho would wanna wife me? Your nigga wanna wife me\nYou think 'cause I'm a stripper hoe, that nigga won't think twice B?\nPut this pussy on his face, rde that shit nicely\nSet his ass up, then you really ain't gon' like me\nSo what you tryna do? You and you and you\nI feel some type a way, a bitch finna get loose\nTell me what's the deal? I'm 'bout to start the hill\nThe wig is comin' off, shit 'bout to get real\n\n[Hook: Cardi B]\nWho wanna pop off?\nWho wanna start war?\nThey talkin' shit?\nI'm takin' tops off\nJeans, off\nWeaves, off\nRings, off\nEverythin', off\nWho wanna pop off?\nWho wanna start war?\nThey talkin' shit?\nI'm takin' tops off\nJeans, off\nWeaves, off\nRings, off\nEverythin', off\n\n[Verse 2: Casanova]\nGot beef with Cardi B? I'm poppin' off\nShit get hectic? I'ma drop it off\nOh you shinin'? Your chain and your watch is off\nYou was never with this shit, nigga, knock it off\nYouse a pussy, and your whole block is soft\nYou caught feelings, could she ain't even drop you off\nYou thought that bag was gettin' you pussy, not at all\nYou was gettin' lied, you ain't know she made that call\nTo the dog's dinner, and they starvin'\nI gotta feed all 'em\nI'maget that nigga, you gon' get that bitch\nWhat they thought switched 'cause we both got rich?\nNah, we on the same time\nYou got yours, I got mine\nYou got a problem, get in line\nIt's Cardi B, and 2 times\n\n[Hook: Cardi B]\nWho wanna pop off?\nWho wanna start war?\nThey talkin' shit?\nI'm takin' tops off\nJeans, off\nWeaves, off\nRings, off\nEverythin', off\nWho wanna pop off?\nWho wanna start war?\nThey talkin' shit?\nI'm takin' tops off\nJeans, off\nWeaves, off\nRings, off\nEverythin', off\n\n[Verse 3: Cardi B]\nShit, that bitch six three and she bodied\nSuperman calves, and her shoulder somethin' retarded\nI ain't backin' down, Cardi got the heart regardless\nYou gon' have to knock me out if you think I'ma forfeit\nGang gang, squad up, and have my niggas all on it\nPay a couple niggas and they had you out in a coffin\nAnd I put that on my life, I really don't do this often\nBut the way I'm feelin' now, like whatever, I'm on it\nHave you laid out on the stretcher with your socks off\nHad the pastor prayin', like, \"Sorry for your, loss\"\nThrow dirt on my name, you better pop off\nMy name ring bells like Mayweather, box off\nI'm Cardi B, east coast newest contender\n5'3\" lookin' good with the nails bananas\nFreddy Kruger on these bitches, I cut their lights off\nShould have read the memo, Cardi B pops off"}]}