{"artist": "Z-Ro", "songs": [{"album": null, "title": "Hate On", "lyrics": "It's Z-Ro\nThe Mo City Don\nWith a special dedication\nTo all my haters\nAnd all y'all haters\nLet's keep makin em mad\n\nYeah you hate me every time I turn around\nAnd every time I'm up you always try to bring me down\nI'm way up in the sky, why you want me on the ground?\nWhen bosses hang with bosses guess that's why you ain't around, hater\nDon't ever call my phone, leave me the hell alone if it ain't about paper\nSo many lobsters and so many steaks, ain't no more Now and Later's\nOnly candy I got is the paint on my car\nI got God on my side and that's all I'ma need I'm ready to take haters to war\nRun up on me then\nIf they say I act funny since I'm makin money they really don't know me then\nLet the Truth Be Told, my nigga, I've been actin funny since way back when\nThe fuck is a friend?\nEverybody I see is pretend\nThey say they my people but they ain't my people I know they would rather see Ro in the pen, man\n\nI ain't even much trippin on they JTE\nI'm too B-L-E-double S-E-D\nHate on, hate on, hate on, hate on\nHate on, hate on, hate on, hate on\nThey be kidnappin my sun but I'm still gon shine\nBut I be still gettin money that's why I don't mind\nHate on, hate on\n\nHate me definitely or hate me maybe\nYou can hate me night or you hate me daily\nScrewed up since 1997\nEver since then they still pay me, baby\nI run this city like decathlon\nTo the motherfuckin money is the path I'm on\nWho me, my nigga? I'm just a G, my nigga\nGod and geometry is the math I'm on\nDislike it, but who the fuck cares?\nI'm worried bout mine, I ain't worried bout theirs\nBitch nigga say I sold my soul\nThey say I snort cocaine when I blow my nose\nThese rappers wear high heels and open toes\nYet they talk about me\nDown south rap wouldn't be nothin without me\nI'm a landmark like Sam Houston\nNot Trae Tha Truth but I am Houston\nI am Dallas, I am Austin, I'm San Antonio too\nI'm Midland/Odessa, I'm Padre Island, the whole state of Texas and all the South too\nGot a couple homies and a lot of haters\nUsed to be broke, now I got a lot of paper\nYea the bitch so fine, might lose my mind\nBut won't spend one dime, I ain't trying to save her\nThey was laughing at me back in '96\n2015, they be trying to ride me, shit\nBut I remember too good back when I was in the hood\nThey was hatin on a nigga, how could I forget?\nJust raise the fuck up off a player's penis\nJust came from Pluto fuckin with Future, now I'm on Venus\nHate on\n\nI ain't even much trippin on they JTE\nI'm too B-L-E-double S-E-D\nHate on, hate on, hate on, hate on\nHate on, hate on, hate on, hate on\nThey be kidnappin my sun but I'm still gon shine\nBut I be still gettin money that's why I don't mind\nHate on, hate on\n\nYou know I got to salute all my haters\nYour [] got to be so strong\nCuz when you're talkin down on me\nYou still gotta look up at me\nHold up\nVandross\nChuuch!", "year": null, "image": "https://images.genius.com/2602d1c6b1b80fb4a81c6cdb729b3572.500x500x1.jpg"}]}