{"songs": [{"album": "Hood Politics 7", "image": "https://images.genius.com/28931b3714ee0d34fe4138002fb9cb51.500x500x1.jpg", "year": null, "title": "Something Special", "lyrics": "Something special\nSomething special\nBack to that shit\nSomething special\nTermanology, Ea$y Money and we still showin off\n\n[Verse 1:]\nI fill squirt guns with liquor and shoot it down bitches' throats\nCheck my timeline, all you see is different quotes\nAnd I spit the most artistic different flows\nGive yo sing unless it's have er doing different notes\nWhether you sit and coach, so you sit in first class\nI cut yo girl man, I gave er the worst gas\nJust stole a bird bag, credit cards and the cash\nI take Xanax, smash em up them bloody panny pass\nThat boy Danny bad and that boy Eddie nice\nTry and be two faced and get beheaded twice\nAnd shread it right in front of your jealous wife\nSon you better slow up fore you step on my yellow flights\nFrom flight club, should be in the Fight Club\nPrime time and all of that but I'm in the night clubs\nStackin up dames with nice butts who might crush\nAnd we iced up so most of em getting hyped up\nRunnin to the bathroom, lipstick, hair check\nFocusin on their check, so we broken their neck\nI'm something special, DJ's want me on their deck\nNow they burning up, man I hope you got a spare set\nI be bare chest, walkin round the telly, wail on my celly rock\nChoppin, sellin pot, getting gwap\nThey say I'm backpacked, underground but I'm high\nI say I'm up there with Biggie, L, Pun and Pac\n\nSomething special\nSpecial right here\nSomething special\nThe way it was meant to be man\nWell it ain't for everybody\nSomething special\nSome off ya'll meant to play the bench\nPay yo dues man, Ea$y wuddup?\n\n[Verse 2:]\nThis that show off dynasty, yea we the tour to God\nStill bring you that real hip-hop shit we immortalize\nRound table with my goons planning your demise\nHand him before the file, send him on a slaughter job\nMy niggas is sure to ride, you accidently thrown in the alley\nOops, you would think he caught er live\nIt's a parent, like it bring you life\nHomie you can dye like a single dice\nRather not, see I'm tryna get the family to pop\nSpit line for that big time, gram easing gwap\nStatic came here to rock, I don't shoot the mist\nCorny rappers I school like a group of fish\nShe with them fly gangstas, handsome G's\nFuck you pay me, too many, you gon have some G's\nAs far as rap go I'm a be your savior\nThat's why they Haiti like I'm DR's neighbor\nThis is easy\n\nSomething special\nWe showin off over here for no reason\nSomething special\nTermanology, Ea$y Money, Statik Selektah\nI don't need to like say my own name anymore\nIt's on half the records in yo fuckin iPod\nSomething special\nFuckin weidos, what were doin with a kid?\nWhat were you doin with a 17 years old?\nWutchu do when you come home from school?\nWhat are you doin now?"}], "artist": "Termanology"}