{"songs": [{"album": "The Misunderstanding of Teyana Taylor ", "image": "https://i.genius.com/5d29b4d7ec3ce1c5006bcd06097602d0c2943ecd?url=http%3A%2F%2Fimg.ulximg.com%2Fimage%2F355x355%2Fcover%2F1331522595_56cc6f79eab3eee5b69b39ca3a814a0b.jpg%2Fa0417c28820ce7b07a31584002369a67%2F1331522595_tmott_front.jpg", "year": "2012-03-12", "title": "Her Room", "lyrics": "[Verse 1]\nChillin' in my bedroom, wife-beater and my panties on\nJust got a phone call that you was out with your new girl\nThe nigga that I did love really kinda threw me off\nFeel like I'm drowning in sorrow, where is my lifeguard?\n\n[Chorus 1]\nFuck that new girl that you love so bad\nI know you still think about the times we had\nI said fuck that new girl that you think you found\nBut you calling me even when she's around\nI'm just saying, with me you had better\nI know your boys have told you that lately\nAfter me, you couldn't find better\nNotice that your new girl ain't me (ain't me, yeah)\n\n[Verse 2]\nKisses from a rebound, she's just a girl you keep around\nI see all of your phone calls, but I don't have the time to pick up no more\nAll the shit that we been through, and I admit it boy I miss you (damn)\nAnd I been sippin' on this champagne, a little tipsy so I call you back to say\n\n[Chorus 1]\nFuck that new girl that you love so bad\nI know you still think about the times we had\nI said fuck that new girl that you think you found\nBut you calling me even when she's around\nI'm just saying, with me you had better\nI know your boys have told you that lately\nAfter me, you couldn't find better\nNotice that your new girl ain't me (she ain't T, yeah)\n\n[Verse 3]\nYou gon' be trippin' when I'm at a party\nYou see these niggas lookin' at my body\nYou wanna grab me when you see me leaving\nWon't take you back, and I'll give you the reasons\nI told you I'd leave, knowing I wanted to stay\nYou didn't try, you let me walk away\nStarting to think all niggas are the same\nThe look on your face tells me that you're ashamed\nWanted to love you, but now I'm afraid\nYou say you need me and how much you've changed\nI don't believe you, it could be just game\nTrust isn't something you give out, it's gained\n\n[Bridge]\nDidn't wanna give up\nSay you want me back now, got my feelings mixed up\nI just wanna move on, I need someone that I can lean on\nAnd it won't be a nigga like you\n\n[Chorus 2]\nI'm just saying, with me you had better\nI can’t even remember the damn words\nBecause you told me—\nYour new girl ain't me, she ain't\nI'm faded\n\n[Outro]\nCare for me, care for me\nI know you care for me\nThere for me, there for me\nSaid you'd be there for me\nCry for me, cry for me\nYou said you'd die for me\nGive to me, give to me\nWhy won't you live for me?\nCare for me, care for me\nI know you care for me\nThere for me, there for me\nYou said you there for me\nCry for me, cry for me\nYou said you'd die for me\nGive to me, give to me\nWhy won't you live for me?\nWhere, where were you when I needed you?"}], "artist": "Teyana Taylor"}