{"songs": [{"year": "2005-12-22", "image": "https://images.genius.com/8c7e84792eef2e8440ef7c7adad0852a.1000x1000x1.jpg", "title": "Chinatown", "album": "Zuhältertape X-Mas Edition", "lyrics": "[Part 1]\nWeil ich 'ne Hoodlegende bin\nKann ich mit einem Anruf dafür sorgen, dass dein Leben ein abruptes Ende nimmt\nIch geh' die Gassen der Vorstadt entlang\nWende mit vorgehaltener Gun rohe Gewalt an\nScheiß' auf die Staatsanwaltschaft, kein Staatsanwalt schafft\nEs, dass mich die Polizei in 'ne Strafanstalt packt\nWeil ich so intelligent bin, dass die Polizei\nMir nie etwas nachweisen konnte, yeah – T.O.N.I.-Style!\nDer Zuhälter beschäftigt hunderte Nutten\nDie für 'n Hungerlohn schuften, meinen Bungalow putzen, in Puffs\nIch komm' gangsterstyle mit der Pumpgun\nUnd steig' nachts bei dir durchs Fenster rein wie der Sandmann\nDie Strassen sind noch nass von dem Regenschauer\nIch treffe dich nachts und verpass' dir ein Schädeltrauma\nIm Vorbeigeh'n\nDu taumelst und fällst um\nDie einzigen Zeugen sind dunkelgraue Mauern und Beton\n\n[Hook]\nIch fahr' mit achtzig durch die Stadt, pumpe das Zuhältermixtape\nEntjungfer' deine Freundin mit 'nem Poolbillardtischqueue\nDu bist fake wie Designerkleider aus Chinatown\nIch gehe straight zwischen die Beine deiner Frau, du weißt genau\nIch fahr' mit achtzig durch die Stadt, pumpe das Zuhältermixtape\nEntjungfer' deine Freundin mit 'nem Poolbillardtischqueue\nDu bist fake wie Designerkleider aus Chinatown\nIch gehe straight zwischen die Beine deiner Frau, du weißt genau\n\n[Part 2]\nDu bist der Sohn einer Hure\nDeine Mom brachte einen Hurensohn zur Welt, so eine Hure\nDie im Puff anschaffen geht\nUnd zwar seit mehr als drei Jahrzehnten aber immer noch auf Luftmatratzen schläft\nWeil du scheiße flowst wie 'n Abwasserkanal\nHab' ich den Ballermann parat\nUnd der macht *Ratatatatatatatatatatatata*\nUnd es ist plötzlich Leere, wo noch eben ein Bitch-Ass-Motherfucker war\nOb ich in Beverly Hills oder West-Berlin chill'\nEgal, wo ich grad bin, ich ticke Ecstasy-Pills, wenn ich will\nDeswegen werd' ich deutschlandweit gesucht\nEy, du bist wie Stuttgart, dein Freundeskreis ist schwul\nUnd du hängst mit obdachlosem Pack rum\nDeine Tagesration ist 'ne Tobleronepackung\nKid, in L.A. will jeder so sein wie ich\nEs ist das Zuhältertape, jetzt ist Showtime, Bitch!"}], "artist": "Kollegah"}