{"artist": "Andy Mineo", "songs": [{"title": "I ain’t done (Beam Version).aif", "album": "Work in Progress", "year": "2019-08-23", "image": "https://images.genius.com/4fa9eaa4fd9645485a3d2928421edda8.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, I was depressed, I was anxious, I was–I was out on tour and I–and I felt like I was washed up like my career was done. So I–I just went back to the beginning where I started when I started producin' for myself, and I–and I picked up that lil' microphone and this–this melody came to mind and I started recordin'; it was like–it was like\n\"Wah, wah, wah, wah, wah, wah, wah\nWah, wah, wah, wah, wah,\"\nAnd then I put the distortion pedal on and I made it sound like this\n\"Wah, wah, wah, wah, wah, wah, wah\nWah, wah–\"\nAnd that's when I started getting my courage back since I started rememberin'\n\"Yo, as long as I'm alive, as long as I got breath in my lungs I still got a chance\nSee I ain't done until I say I'm done\"\nAnd guess what?! Guess what?!\n\n[Chorus]\nI ain't done, I ain't done, I ain't done\nAs long as there's breath in my lungs\nI ain't done, I ain't done, I ain't done\nAs long as there's breath in my lungs, I ain't done\n\n[Break]\nOh, well, if they don't like it I might turn up by myself\nHey, no, I don't need opinions, no, I did this for myself (For myself, ayy, ayy, yeah)\n\n[Verse 1]\nI believe in me the way that I used to\nI believe in me, that's all you need to do (Uh)\nTed DiBiase, million-dollar man is what I'm feelin' like\n'Cause I know who I am\nWoo!\n\n[Pre-Chorus]\nDeath to my depression and anxiety\nDeath to all my stress and what I'm tryna be\n[?], they wanna come\n[?]\n\n[Chorus]\nI ain't done, I ain't done, I ain't done\nAs long as there's breath in my lungs\nI ain't done, I ain't done, I ain't done\nAs long as there's breath in my lungs, I ain't done\n\n[Verse 2]\nUh, just came out of the winter (Uh)\nJust came out like a winner\nHad a breakdown, couldn't stay down, figure\nRather die tryin' than to live like quitter, woo\nYeah, my problem big, but I know God way bigger\nWhat you 'spect? Once you level up\nDon't you know the boss is bigger? Yeah\nUsed to spend a lot of time daring myself\nThen I spent a lot of time comparing myself\nTurned into the doubt, then the fear in myself\nOverthinking to the point I was impairin' myself\nNow I know why Chappelle went missin'\nNow I know why Brit got the clippers\nNow I know why 'Ye started trippin'\nThe pressure and the expectation get ya, ah\n\n[Break]\nOh, well, if they don't like it I might turn up by myself\nHey, no, I don't need opinions, no, I did this for myself (For myself, ayy, ayy, yeah)\nWoo\n\n[Pre-Chorus]\nDeath to my depression and anxiety\nDeath to all my stress and what I'm tryna be\nCan't knock me down\n[?]\n\n[Chorus]\nI ain't done, I ain't done, I ain't done\nAs long as there's breath in my lungs\nI ain't done, I ain't done, I ain't done\nAs long as there's breath in my lungs, I ain't done"}]}