{"songs": [{"image": "https://images.genius.com/0881803bb094739f9a61a1773b166dc3.400x400x1.jpg", "lyrics": "Hey shay what you talking bout \"if they don't fuck with Mac Lethal\", they CAN’T fuck with Mac Lethal\n\nMake the sub-woofer shake like I'm too dope, crazy ass Cujo, only real thugs sip NUVO, (I'm kidding) I brew flows flabbier than Sumo wrestling, interplanetary fucking Pluto hustling, I’m ruffling your wings, I'm a thunderous machine, Imma tear your ass apart like a watch me tugging at the seams, I'll blow your ass to fucking smithereens, listening to my music is like banging H until someone intervenes, howdy do, hello yo, Mr. Mac, mellow flow, beam it down from the sky , with a bright yellow glow, staying smart with the money I collect, paper saving, spraying bleach at you like I'm Bret Saberhagen, got a cape and halo, the truth is something they won't face but they know you're not smart just cause you don't watch basic cable. You get your guts ripped out like Mr. hands, I'm a high school drop out with a Black Clover business plan. That’s Macadocious, The Kids love me I’m kinda like a Big Wheel\n\nYou are fucking with the wrong dude, I still stay Southside connected like a fruit to the tree of the game, like the streets which I came, generations later and my block is still the same, models is hollering got em swallowing collagen , beep beep, skeet skeet , we tweet the following, game over, prepare for take over, I'm at the level Pac was in, no use in rappers bothering , I’m now past peripheral , I'm out of sight, I am a young Bob Barker the price is right, Got a couple chicks that swallow fast in Călărași holler at me\nPut it on the line and follow fastly Ya'll aboard a Collar Rally\nSuper high wire, fly by a typewrite, I'm too fast to write rhymes I’m a time fighter, MC's make me turn into a yuck mouth, yuck, shuck fuck, your luck's out. The kids love me I'm kinda like a big Wheel (The G.I. Joe one)\n\nI've been a big deal, since I had he-man stickers all over my big-wheel, never been the flashy type with my wrists here (nope) but I might if I ever get that big deal, Sony, Interscope, Warner Brothers, one of them, rappers try to step up in my cypher I be sunning em, killer-drug-dealers type of brothers in my covenant, don't be me at us, gotta blame it on the Government, (why?) put us in these circumstances for taking penitentiary chances, I come off antsy cause I'm anxious to live in a mansion and organize the hood like a panther, you looking confused, cue the mic, I'll give you the A's, see you rolling on dubs, run up on you with treys, all up on you in drive through while you ordering wings{pronounced like wangs}, I'll take a double burger with cheese{pronounced like chase} Homie the flow is Kane, I deliver the bang, at the crib mommy giving me brain, so I'm out this card game, it's a wrap I got nothing but spades", "year": null, "album": "Blood In the Water", "title": "Kinda Like a Big Wheel (Freestyle)"}], "artist": "Mac Lethal"}