{"songs": [{"album": "Shut Up And Rap", "image": "https://images.genius.com/22af45710b74abb23f51b1a75a855114.1000x1000x1.jpg", "year": "2014-12-09", "title": "Reality", "lyrics": "[Verse 1: Ea$y Money]\nY'all better salute a G and act right when you see me\nIt's real just more than what we recite in a CD\nYou fighting with Ea$y I'm lighting a DE\nThe flare from that shit'll give you vitamin D, B\nWe put them biscuits straight through ribs\nThat'll give you the business, no patronage\nAnd we all love them hoodrats\nDifference is your bitches get ratchet\nWe fuck with them bitches with ratchets\nYou grip it and flash it\nWould you click it and clack it?\nAre you quicker to pass it\nTo your nigga to blast it?\nHomie we come through and airing the place\nFlipping your head, that's not keeping your hair in place\nBunch of niggas from the streets who get it\nLead through with it\nThe steel jam, fuck it we gon' beat you with it\nUh, the game out of the same cat that'll hug you\nWill aim at you then let your brain splatter\nLike you ain't matter\n\n[Verse 2: Hectic]\nHey yo it's S to the T dot\nFamily in attendance\nPray to the Lord but no more for repentance\nI'm repping to my team 'til death be my sentence\nSpeak in diagrams but y'all can't comprehend it\nThe streets are hectic\nBurn rubber like contraceptives\nYou got a question?\nSpit flames to teach a lesson\nThere's no contesting\nHomies killers with comprehension\nI'm a law town nigga that rebel with no question\nProjection screen niggas\nYour TV funny\nMy terminology hectic, ask Ea$y money\nPractice the art of sin when I snuck in the club\nAnd got a clip all up in your mug\nGot blood on the rug\nI got a sleeper and a couple of snubs\nSay something if you trying to thug\nYou bitch nigga\nIt's S-T and we up in the cut\nSnitch niggas catch the butt of the gun you bitch nigga\n\n[Verse 3: Termanology]\nReality is seeing and doing and not waiting\nThe more daydreaming, the making procrastinations\nEvery day pass, the opportunity you could of wasted\nYou woke up and saw your face, it could have been amazing\nThe shit is you're so lazy, so quick to get wavy\nBut can't take the time out to pick up your own baby\nLook me in the eyes\nIf you got something to say to me\nI woke up and grinded everyday, and waited patiently\nHopped out the booth\nAnd showed rappers they couldn't play with me\nRappers double as famous they shook to step on the stage with me\nThis only confirms my suspicion they was afraid of me\nSpeeding through life\nPush you out your lane, trying to race with me\nI break bread with those that break bread with me\nYou bringing nothing to the table homie, how you gon' eat?\nSo you asking me to take a plate from my daughter\nCause you never got on your grind\nMan you out of your mind\nGrow up"}], "artist": "Termanology"}