{"artist": "Iggy Azalea", "songs": [{"title": "Slo.", "lyrics": "[Intro: Interviewer & Andy Warhol]\nYou once said, I hate to throw the old quotation back at you, that you thought it would be nice to a machine.\nWell, I, I still wanna be.\nDo you believe in feelings and emotions?\nWell, no I don't, but I have them. I wish I, I wish I didn't.\nBut you'd like to get rid of them all together, wouldn't you?\nUh, it would be a good idea, yeah.\n\n[Chorus:]\nWhen I’m alone, I check the time\nI hit you up, you’re on my mind\nYou love the light, the fast life\nFuck that though\nI’d rather go slo\n\n[Verse 1:]\nUsed to be happy, but now shit's unpredictable\nI smiled at the show but there were tears in the limo though\nYou fucked her on my birthday and that’s what really hurt the most\nYou tell the truth… half way, guess thats why this unfixable\nBut still …\n\n[Chorus:]\nWhen I’m alone, I check the time\nI hit you up, you’re on my mind\nYou love the light, the fast life\nFuck that though\nI’d rather go slo, yeah\nI’d rather go slo\nI’d rather go slo\nI’d rather go slo\n\n[Verse 2:]\nWhen I call sometimes I wish you pick up\nBut most days the call is declined\nIt’s okay, I don’t give a fuck\nYou outta sight, so you outta mind\nI'm doing alright know I’ma be fine\nI gotta few candidates standing in line\nBroke up before but I wasn’t like this\nNot many regrets I wish I could rewind\nDamn! We both got our lives so it's no surprise\nThe schedules conflict and we can’t coincide\nMy heart's cold, feels like I got no insides\nWe rushed it to the finish line, we should have took our time\nYou make me crazy with rash decisions and sudden movements\nCan’t even enjoy a moment or pay attention to it\nIf I could try this shit again? Real shit I'd probably do it…\nThat's why it's hard to act like you someone I'm really through with\n\n[Chorus:]\nWhen I’m alone, I check the time\nI hit you up, you’re on my mind\nYou love the light, the fast life\nFuck that though\nI’d rather go slo, yeah\nI’d rather go slo\nI’d rather go slo\nI’d rather go slo\nWhen I’m alone, I check the time\nI hit you up, you’re on my mind\nYou love the light, the fast life\nFuck that though\nI’d rather go slo, yeah\nI’d rather go slo\nI’d rather go slo\nI’d rather go slo", "image": "https://images.genius.com/122cb5a8d88b89ac2c08aedadb152d20.1000x1000x1.png", "album": "TrapGold", "year": "2012-10-11"}]}