{"artist": "Casey Veggies", "songs": [{"title": "Money Talk", "album": "The Odd Future Tape", "year": "2008-11-15", "image": "https://images.genius.com/95006fc0c5c08dc0b6ea167151ba467a.1000x1000x1.jpg", "lyrics": "[Intro]\nCV, Hodgy, Odd Future, what up?\nCV in the mothafuckin' place to be\n\n[Verse 1: Casey]\nUh, yo, yeah, yeah, same-o, same-o\nYoung nigga about that grown dough, ya feel me?\nToo many girls, but, hey, it wouldn't kill me\nYou gotta feel me, they can't even conceal me\nCan't hide me, can't keep me at the bottom\nI stay cool from the top to the bottom\nI'm about the green and I forgot to eat the bottoms\nWe faster, full throttle\nI got a lotta babies, I forgot to give 'em bottles\nWe so customized greatly, and that's my motto\nWe faster, full throttle\nGive 'em big deals like winnin' the damn lotto\nRollin' rims in the whip, check my auto\nGucci G's (?) man, this girl's eatin' tacos\nFlow's so cold, I'm oh Domo\nNow you other rappers is fuckin' so-so, like\n\n[Hook]\nThis is what we doin', I'm tellin' you it ain't funny\nBut this is for my niggas that's talkin' 'bout gettin' money\n(Talkin' 'bout gettin' money?) Yeah, talkin' 'bout gettin' money\nBut this is for my niggas that's talkin' 'bout gettin' money\n\n[Verse 2: Hodgy]\nMoney is good, but it can be evil\nSpell it backwards, live, keep it all cerebral\nIf you black, white, asian or hebrew\nJust do what we do and get this money, people\nYou ain't gotta be equal or see-through\nIn order for you to be a rich negro\nHere's a preview, Casey Veggies gon' do what he do\nHodgy Beats gon' let Super 3 groove\nOdd Future is the crew, I'm cool\nShe you, we cool to touch me\nShe stands on these stool\nAnd does tricks so fit, like Evel Knievel\nRed button, don't press it, false alarm\nAin't nothin' I can't solve a check with\nGuess what I ate for breakfast?\nMoney, cash, weed and (?)\n\n[Hook]\n\n[Verse 3: Casey]\nMake more to the death like D-I-E\nIt's M to the Y and the C to the V\nIt's been like that since BSE\nAnd it's still like that, this OBD\n\n[Hodgy]\nI'm tryna make Veggie R-E-E-N\nWork should be a sport E-S-P-N\nCut the backyards if you Mexican\nI'm hungry 'bout to grab more checks again\nWe talk about money, cash, feta\nGouda, mozzarella, Swiss, cheddar\nGet money, get, get money\nGet money, get, get money"}]}