{"artist": "Bone Crusher", "songs": [{"album": "AttenCHUN!", "title": "Never Scared (The Takeover Remix)", "year": "2003-04-29", "lyrics": "[Intro: Bone Crusher & Jadakiss]\nWhooo! Haha!\nAttenCHUUUUUUUUUNNN!!!\nRemix, remix, remix, remix, remix!\nRe-mix, mix, mix, mix...\n\n[Chorus: Bone Crusher]\nSo I'm outside of da club and you think I'm a puuuuuuuunk\nSo I go to my loaded tech 9 that's off in the truuuuuuuunk\nI told that motherfucker\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)\nI ain't never scared (Southside!)\nI ain't never scared (Northside!)\nI ain't never scared (Southside!)\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)\n\n[Verse 1: Bone Crusher]\nWho am I???\nBone Crusher, motherfucker!\nAttenCHUUUUUUUUN!!! Where my soldiers motherfucker?\nI guess the fight is on, me and you nigga (ha!)\nAnd you (wha!), and you (wha!), and you nigga! (wha!)\nI ain't scared of you bitches, I'll put yo brain in stitches\nThis remix for real niggas who get money in the trenches\nCheck my resume nigga, I got that one hitta quitta\nAnd yo boys ready to flee like \"Why'd you fuck with that nigga?!?!\"\n\n[Chorus: Bone Crusher]\nSo I'm outside of da club and you think I'm a puuuuuuuunk\nSo I go to my loaded tech 9 that's off in the truuuuuuuunk\nI told that motherfucker\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)\nI ain't never scared (Southside!)\nI ain't never scared (Northside!)\nI ain't never scared (Southside!)\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)\n\n[Verse 2: Cam'Ron]\nI tell her front (front), back (back), side to side\nNever let a punk ass nigga slide, dawg\nYou get beat dead, that means you dead meat\nI been on Wall Street, Beach Street, *Gregg Street*\nThat's Dallas, Atlanta, I style with them hammers\nI wild witcho nanna, doggystyle on a hamper\nYou'll get ripped apart, that's it with darts, you kids ain't smart\nPop, pop, pop, I lit the dark\nI'm the wizard dog, come get some heart\nThat's courage and brain, 'caine on several strips\nNot from Houston, but shit, call me Lil' Flip\nCuz I flip a little, fa shizzle, you flippin' nickels\nWhen I flip coke and flip boats, come live a little\nAnd you best be knowin', pussy still is the best thang goin'\nAny extra dough, come invest in ho'in\nBut I clap that boy, kidnap and wrap that boy\nClap, \"We reeeeeeadddy\" I'mma mastered boy like Pastor Troy\nBut I'm stoned sucka, with my nigga Bone Crusher\nBaby, we like to bone, all our chicks are bone crushers\nWe got guns in coupes, in case our sun'll roof\nNo basketball, when we talkin', run and shoot\n\n[Chorus: Bone Crusher]\nSo I'm outside of da club and you think I'm a puuuuuuuunk\nSo I go to my loaded tech 9 that's off in the truuuuuuuunk\nI told that motherfucker\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)\nI ain't never scared (Southside!)\nI ain't never scared (Northside!)\nI ain't never scared (Southside!)\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)\n\n[Verse 3: Jadakiss]\nAiyyo, the 40 cal' is full and I'm waitin'\nNo matter what county I'm in, Dekalb, Cobb, Fulton or Clayton\nMuah baby, you know who it is, the kiss of death\nIf the world was sucka free, it just be me and my niggas left\nI ain't neva scared, I got big hammers everywhere\nIn places where you need yo passport at, I'm heavy there\nIt's time we get even here, when I put the game back\nIn it's proper perspective, this time leave it there\nYou can think whachu want, til I blow the back of yo brains out\nAnd see if you can think with yo front\nLike a new single, make sure you leak for a month\nTreat yo face like a buffet, and tell my niggas \"Eat whachu want\"\nYou'ono nuthin' about puttin' a couple hundred thousand on the table\nAnd tell yo niggas \"Keep whachu want\"\nIt's usually hate or somethin' stupid that a nigga die for\nSo whachu think we outside for?\n\n[Chorus: Bone Crusher]\nSo I'm outside of da club and you think I'm a puuuuuuuunk\nSo I go to my loaded tech 9 that's off in the truuuuuuuunk\nI told that motherfucker\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)\nI ain't never scared (Southside!)\nI ain't never scared (Northside!)\nI ain't never scared (Southside!)\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)\n\n[Verse 4: Busta Rhymes]\nNow all my soldiers (soldiers), thugs (thugs), niggas (yea!), I know you want it!\nDon't stop, get it, get it, bitches betta get up on it!\nSit up on it shawty, get up on it\nSee when I spit up on it, shit up all over niggas like a Harley pick up\nWhen I throw a get-up on it\nBig up, all of my niggas that ain't scared of the hustle\nThrow anotha mill up on it (yea!)\nI'mma cop a lotta land and I'mma cop a mountain and throw a lil' crib up on it\nYes, I'll eat yo food and you know I'm gonna CHOW DOWN!\nMothafucka, all yo niggas betta BOW DOWN!\nMothafucka, 'fore I have to come and POW WOW!\nMothafucka, I ain't playin' witcha\nSo I let my niggas touch ya, it's a must and we gotta rush ya\nShatter bones in yo body, when I bust, I holla Bone Crusher\nLet me spell it out for you homie, I hope you came prepared\nCuz I don't care if you live or phony, cuz we ain't NEVA SCARED!\nFlipmode and the Dirty South niggas know whussup\nCuz we got you open dude\nFuck that, make a lil' sucka nigga, fallin' back\nLayin' stiffer than frozen food\nTwo stop me means you have to SHOOT ME!\nGet cake in the ? GROUPIES!\nWatch niggas acknowledge the general and all SALUTE ME!\n\n[Chorus: Bone Crusher]\nSo I'm outside of da club and you think I'm a puuuuuuuunk\nSo I go to my loaded tech 9 that's off in the truuuuuuuunk\nI told that motherfucker\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)\nI ain't never scared (Southside!)\nI ain't never scared (Northside!)\nI ain't never scared (Southside!)\nI ain't never scared (Eastside!)\nI ain't never scared (Westside!)", "image": "https://images.genius.com/c88a92a668320518e4c89b94c1288fef.600x600x1.jpg"}]}