{"artist": "Wrekonize", "songs": [{"lyrics": "[Verse: Wrekonize]\nRing the bell ring the bell better get alarmed\nNeed a second to get better with a leather palm\nShowing up to your job with a letter bomb\nAnthrax in the center of the pentagon\nIn it with a bit of the bang bang\nGet 'em up and get 'em all a critical mainframe\nLimited to litigate a cynical lame brain\nIgnorant vein vein, typical shame shame\nThis here's a warning shot, to all those acting funny\nI'm loading up to get respect and Apple Patent money\nThis here's the final five\nBut I need to get a liver vibe\nMeet me in the middle with the iodine\nI think it's 'bout to time that I die for mine\nHow 'bout your needs? I thirst for more heat\nDropping shit that'll make 'em all really wanna\nStop -- drop, and roll\nI got them tour needs, bring the liquor please\nI live a life that is really quite nice full of\nRock -- and, roll\nThis game is pure greed, big racks and more sleaze\nBut it's all in the good name of\nHip-hop -- and, soul\nSo let them whores breed, who needs the sword cleaned?\nBen has got a better bit of bangers that'll put your Betty\nBack down on her hands and knees\nPlease emcees, if you need to breathe free\nThen do not challenge me, we agree? Please leave\nWant a solo from the kid, I'll oblige no distortion\nMy next album is set to make Mitt Romney pro-abortion\nCause kids can't compete, when the Brit spits on the beats\nWith the verbs and with the speech, I been bred to rep the Heat\nIt's cliché that I might repeat, I'mma get 'em up under my cleats\nAnd them last bars were weak, that's just how they sound to me\nGet a trip down to Miami come and get a humid reply\nThe drinks are doubles and if troubled well then you just might die\nGet your hustle put 'em in a muzzle we been loving the sky\nWanna give another public supply, of what you been fucking denied\nI'm an 8-3 king with a HD thing\nEnemies who hate me you know I don't stop...\nBut I keep and I keep on going in\nGet it banging all up in the bigger lower end\nGet another from the brother with the solar pen\nThat good 'ol bottom rock...", "title": "Break Ya Neck (Freestyle)", "year": null, "album": null, "image": "https://images.genius.com/c714b196bcc8378c9e57d2328f2b237d.1000x1000x1.jpg"}]}