{"songs": [{"title": "Don’t Stop", "lyrics": "[Intro: Shawty Redd]\nLady's and gentlemen\nHomies and Homets\nI would like to introduce you to a young man we all grown to love\nAnd that motivates the thugs\nHe just put a little CD out right now\nIf you a real Nigga you'll ride to it\nYo Young, you ready? I'm about to put you on blast\n\n[Verse 1: Young Jeezy]\nSo you know it don't stop, so you know it don't quit\nBetter get your money cause these hoes ain't shit\nGotta run me at the mall, yeah you know how it get\nFuck around spend your lease on a whole outfit\nMight see me out cause you know I like to party\nSelf made nigga I don't want nobody\nSee my name Young Jizzle, I don't want nobody\nGot something in my safe, I ain't showing nobody\nSucka's still hating but you know I don't care\nReal nigga with me put your hands in the air\nBetter show respect when your fucking with a player\nNow you riding around the city like your fucking with the mayor\n\n[Hook]\nSo you know it don't stop. (You know it don't stop)\nSo you know it don't quit. (You know it don't quit)\n\nIf the music keeps you rocking, and the bottles keep on popping\nGirl don't worry 'bout the time, girl you fine\nWe got champagne on the rocks and all my ladies looking at you\nKnow the party just won't stop 'til we say. (Oh, whoa)\n\n[Verse 2: Young Jeezy]\nShe wants to buy new shoes and a new bag\nShe can call her home girls up, straight brag\nAnd if you got it like that then you go girl\nKeep doing what your doing, shit it's your world\nNot me, you know I'm on to the next girl\nYou know how people balled up like an S-Curl\nPut some miles on that thing like an S-Type\nWhen I'm going off the goose lay the best pipe\nHad the Lexus back then baby white pearl\nAll that yeah thanks to that white girl\nSaid white pearl, shit I meant pearl white\nAll you nigga talking slick know it's on sight\nMeanwhile see Jizzle off the shed trails\nWith a bad red ball bitch like Chanel\nGot so many gotta name it by the bag whole\nBet you one thing about it, ? bad dough\n\n[Hook]\nSo you know it don't stop. (You know it don't stop)\nSo you know it don't quit. (You know it don't quit)\n\nIf the music keeps you rocking, and the bottles keep on popping\nGirl don't worry 'bout the time, girl you fine\nWe got champagne on the rocks and all my ladies looking at you\nKnow the party just won't stop 'til we say. (Oh, whoa)", "album": "The Last Laugh", "year": null, "image": "https://images.genius.com/c46672b7ac99c9a79c556fa809a45fd5.320x320x1.jpg"}], "artist": "Jeezy"}