{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "Little Secrets", "image": "https://images.genius.com/c5d22bfb857b82260d5a34f6239258a1.1000x1000x1.jpg", "lyrics": "[Verse 1: Professor Green]\nI felt like I was going crazy\nThought I was losing my mind, I did\nI even convinced myself it was all in my mind, all of this time\nI think it's high time\nThat some truth comes of this lie I've lived\nWe've lived or we live together\nAt least we did when we were together\nAll of the things that we did together\nTainted, jaded\nThe first sign of temptation, you gave in\nFirst heard when you tripped up, stumbled over\nAnd did something that I'd never even contemplated\nStick your story, save it\nThought it was a mistake, were you sober\nOr were you wasted?\nDid you show him all of your little faces?\n\n[Pre-Hook: Mr Probz]\nIf everyone knows\nWhy ain't nobody telling me, telling me?\n\n[Hook: Mr Probz]\nFound out all your little secrets\nUncovered all your little lies\nThe amount of times you'd had me believe it\nYou were pulling the wool over my eyes\nFound out all your little secrets\nUncovered all your little lies\nAnd now I'm starting to put all the pieces\nTogether in my mind, together in my mind\n\n[Verse 2: Professor Green]\nDid I ask too much of you?\nDid I expect too much?\nCould I have given you a little extra?\nWould it have made you a little less of a strut?\nAnd you walk wherever you walk\nDress barely holding on for the ride\nGuess I knew we'd always end premature\nI can't say it didn't come as a surprise\nSo tell me, was it good, was it?\nWas it worth it? Did you work it?\nWould you be as kind as to\nTell me what it was I did to you to deserve it?\nCause nah, I ain't perfect\nBut I ain't ever shown nobody where you sleep\nAre you gonna have somebody in my bed?\nGuess I better get new sheets\n\n[Pre-Hook: Mr Probz]\n\n[Hook: Mr Probz]\n\n[Bridge: Mr Probz]\nTogether in my mind\nI found out that you've just been hiding the truth\nNow it's yours, oh\n\n[Pre-Hook: Mr Probz x4]\n\n[Hook: Mr Probz]", "year": "2014-09-22"}]}