{"songs": [{"year": "2008-10-28", "image": "https://images.genius.com/91b9a76e50f5301dcd3a2c0ffcb542c7.425x425x1.jpg", "title": "RePPiN For U", "album": "Tronic", "lyrics": "[Intro]\nSo let me paint this picture\n\n[Verse One: Black Milk]:\nEvery single line was written, explodin' like bombs droppin'\nIt's like I'm Bin Ladin when my pen's jottin'\nThe best to most, extra votes\nA flow that'll shock most like electric volts\nSo yes, E.B. the best, Black spit that shit\nOthers just spit B.S\nTryin' to be larger than life is the rule that I reach fo'\nTill y'all look as miniscule as a peep hole\nYo, yo, Black be the face of the people that tired of the weaker raps\nTired of the people that's, giving artists bad names\nHip hop seeing that\nSeeing Black spittin' harder tracks till the beats collapse\nFuck it, why should I worry when my team's winning?\nOut spending no limits, thousand dollar jean denim\nWe reppin' the D, obviously, yep I be out for presidents to represent me\nYeah, nigga, so what you reppin'?\n\n[Hook: AB]:\nI keep reppin' real music for ya\nI've been reppin' for ya\nI keep reppin' real music for ya\nI've been reppin' for ya\n\n[Verse Two: Black Milk]:\nThen one day\nThis dude asked me, \"What's the answer to this hip hop cancer?\"\nI'm so hungry for real shit it feels like I'm fasting\nThey told me, stop living in the past, get past it\nThe Golden Era it would never come back\nTold him, I hear what he's saying and I'm tryin' to be a crutch to hold it up\nBut I know what I contribute is not enough so\nUmmmm\nI have nothing to say\nI'm as curious as you to see the outcome of the game\nFact remains I don't mind being platinum made\nA platinum plaque in a picture frame\nSee, the difference with me is that I know what I'm called for\nI stay and play my position like an all star\nTill my pen fall I'mma play hard till the end all\nTill I'm on the red carpet with flashing lights like pinball\nMachines, it seems that's what I'm here for\n\n[Hook]"}], "artist": "Black Milk"}