{"songs": [{"lyrics": "[Intro: Jay-Z, Kid Capri & Both]\nYeah, uh-huh, watch this y'all\nUhh, watch this y'all\nC'mon, Jigga, watch this y'all\nC'mon, Roc-A-Fella y'all..\nHuh! Watch this y'all\nIt's  Kid Capri and Jay-Z, come on!\nIt's Jay-Z and Kid Capri, don't stop, huh-huh!\n'Cause I'm like that y'all, yeah\nI'm really like that\n\n[Verse 1: Jay-Z]\nAs a young'un, dumb and gun in the waist\nSold crack to those who couldn't take the pain\nAnd had to numb it with base\nCouldn't drink the Henny straight, I needed somethin to chase\nNowadays I throw shots back, leavin' nothin' to waste\nLife's like a treadmill, niggas runnin' in place\nGettin' nowhere fast, a whole year done past\nI vowed to never stop winnin', 'til the earth stop spinnin'\nRock hot linen, cop hot cars and hot women\nIf it's not him then you got it confused, y'all not rememberin'\nMy motto is, simply \"I will not lose!\"\nAbide by the block rules, I buy my Glocks used\nWith bodies on it, let me know anybody want it?\nI'm raised, irrational, ways misunderstood\nIf you ain't live like I live, then one with the hood\nI done what I could, to come up with this paper 'til this day still\nRun with the hood, guess it's part of my nature\nIf hell awaits a, nigga I'm comin' with the razors\nStill flashin' ya shit, try to pass me in a six\nType classy on the wrist, every bit of 30 karats\nThis is, not a game this is not why I came\nMay these words find a spot on your brain and burn\nThen I recycle my life, I shall return\n\n[Chorus: Liz Leite (Jay-Z)]\nHow tight is your flow? ('Cause I'm like that yo)\nHow right is your dough?  ('Cause I'm like that yo)\nHow white is your blow?  ('Cause I'm like that yo)\nOnly, write what you know  ('Cause I'm like that)\nHow tight is your flow? (Just like that yo)\nHow right is your dough? (Just like that, huh)\nHow white is your blow? (Uh huh, 'cause I'm like that)\nOnly, write what you know (Watch this, yeah, watch this yo)\n\n[Verse 2: Jay-Z]\nI'm a hop skip and a jump from grippin' the pump\nSpittin' a couple of curse words, and hittin' you chump\nShit, I get digits in lumps\nI'm a motherfuckin' problem, is this what you want?\nOverachiever, I love chicks that puff cheeba in reefer paper\nI hate the ones that blow up ya beeper\n'Cause I, go in deeper, I only bone divas\nImpregnate the world when I come through your speakers (ha ha!)\nFuck hot, my records got the fever\nNiggas kick dirt, get ya whole block sweeped up\nI creep up when the beef heats up\nCaught him with his feet up and shoes off, 'bout to snooze off\nHatin', 'cause you can't turn the booze off\nYou dudes is too soft, why I don't fuck with you all\nI might bark at X, or spit at The LOX\nBut, other than that, I don't be fuckin' with cats\nJust me, Ty and B-High, thug it like that\nE, Dame and Biggs, what's fuckin' with that?\nY'all can never diss Jigga, get nothin' for that\nOther than a couple of slugs in ya back (ha ha)\nRappers y'all, runnin' around like I won't gun ya down\nLast nigga that fronted, two shots spun him around\nLord, accept this offerin' here's somethin' for your crown (please)\nI meant no malice, I just met his challenge and won\n\n[Chorus: Liz Leite (Jay-Z)]\nHow tight is your flow? ('Cause I'm like that yo)\nHow right is your dough? (Just like that yo)\nHow white is your blow? ('Cause I'm like that yo)\nOnly, write what you know (I'm just like that yo)\nHow tight is your flow? ('Cause I'm like that yo)\nHow right is your dough? ('Cause I'm like that yo)\nHow white is your blow? ('Cause I'm like that yo)\nOnly, write what you know (Just like that yo)\nHow tight is your flow?\nHow right is your dough?\nHow white is your blow?\nOnly, write what you know\nHow tight is your flow?\nHow right is your dough?\nHow white is your blow?\nOnly, write what you know\n\n[Ad-libs throughout Chorus: Kid Capri & Jay-Z]\nPut your hands up, put your hands in the air\nPut your hands up, get 'em up come on!\nPut your hands up, get your hands in the air\nPut your hands up, get 'em up, everybody put 'em up come on!\nGet 'em up come on!\nYou know what I'm sayin'\nI'm built like that, you heard?\nI'm whole another level, we can put it on, you know\nJigga, Kid Capri yo\nSoundtrack to the streets, nigga, huh\n'Cause I'm like that y'all, ya heard?\nHolla back, bounce with me, bounce\n\n[Outro: Jay-Z]\nGirls and guns (uh huh), all I want (bounce)\n(Bounce with me, come on, bounce)\nStock exchange (uh huh), rocks and thangs (bounce, Jigga, haha)\nGirls and guns (Kid Capri shit, huh), all I want\n(What's fuckin' with that?)\nStock exchange (like that yo), rocks and thangs\n(I'm just like that yo)", "title": "It’s Like That", "image": "https://images.genius.com/1f3b917b779cd80ad127e64f21d6010a.1000x1000x1.jpg", "year": "1998-09-29", "album": "Vol. 2… Hard Knock Life"}], "artist": "JAY-Z"}