{"songs": [{"image": "https://images.genius.com/e4f501fdfa584d29ce2e2706f76e3bf6.500x500x1.jpg", "title": "I Remember", "album": "For All Seasons", "year": "2000-09-19", "lyrics": "\"Yo Nate, shit is crazy, I shook hands with mad dead niggas yo, all the\nNiggas that used to be on the block, Ill Will, Marty, Black Ed, yo Son\nMad niggas is gone, rest in peace though.\"\n\nVerse 1:\nFifty-Two blocks, Gazelle frames\nBald heads and heavy chains\nSomehow caught in the game\nBack in '83, before cable TV\nWhen these so called thug niggas played in the street\nI used to hear the stories\nLive niggas here before me\nLike the Rich Porters, the Fat Cats, the Pauly's\nOutlaw league, from the street to the Pen\nEyes glossy, niggas only speak when they bent\nOff the perfect mixture\nForcin' down herbs and liquor\nOnly hot slugs 'll hurt ya quicker\nThink it out and elevate, I gave years to the state\nAs a 92-R-7478, it set me straight\nThe changing of a stubborn cat\nThe one that used to hustle on the block mad hard and loved to rap\nIn goose down coats and wool hats, the youth in me\nI guess life on the streets ain't what it used to be\n\nChorus\nI remember! (echo)\nWhen niggas used to live it up, live it up\nFlashin' dough all night\nI remember! (echo)\nWhen niggas didn't give a fuck, gettin' drunk\nShootin' guns all night\n\nVerse 2:\nStraight shots of Hen with no chaser\nMo' paper, stubborn, hard headed like Joe Frazier\nThe Gremlins, the pack that I come with\nKeep gats by the stomach\nAct up and stack hundreds\nNiggas don't want it, see me I be the ring leader, Lion tamer\nDo the bankhead and Macarena\nA black entertainer, bottom line\nYa'll niggas know who got the hottest rhymes\nFace it, I got the whole globe on some Nate shit\nStraight from the corners to the covers of the latest Rap Pages\nTurn the Projects to black Vegas\nDon Kingin' niggas, make 'em sign blank papers\nIt's the American way, do my enemies pray or is it just me?\nHustlin', hopin' the fiends trust me\nTalkin' to us, hold up, let me walk you through this\nWannabe pimps, hoes, often shooters\nNiggas need to know what the truth is\nFuck the sarcasm\nI miss my nigga Mark but God has 'em\nWhen I see his flics I start spazzin'\nI learned to let it go\nBut I guess livin' this life a nigga never know\n\nChorus\n\nVerse 3:\nI used to love Starters, thug garments\nBoppin' into Spofford, R.O.R. on drug charges\nWritin' on walls, florescent markers and krylon\nSavin' my loot to buy a firearm\nBroken safety, borough hall and Jay street\nHopped the train not knowin' that a fall awaits me\nProblems came when I started slingin'\nLate night I hear revolvers ringin'\nThe echos cause cops to start Rodney Kingin'\nMany riots, is there any silence?\nEverybody sipped Henny, hustled with many clients\nGrowin' up on the same block my Pops was raised\nRocked waves, blend tapes playin' on hot days\nBrought the speakers out\nPolice made us put the wrieffer out\nPeep it, I was too young to leave the house\nI'm tryin' to see the World, runnin' the streets without a care\nI remember it well cause I was there\n\nChorus"}], "artist": "Nature"}