{"songs": [{"year": "2017-05-12", "lyrics": "[Chorus: Usher]\nThey tell me that I play a lot\nBut I don't think that they play enough\nI don't know if I'm right or not\nTell me who ever stops growin' up\nWe're just big kids\nThe world's our toy\nFor boys and girls, for girls and boys\nTell me who ever stops growin' up\n\n[Verse 1: B.o.B]\nYeah, still ridin' big wheels, still addicted to J's\nFavorite team on my fitted, in every color they make\nI paint the town and every city I stay\nADD or you just never really learn how to play\nA livin' breathin' walkin' memory on Memory Lane\nTell me are we really movin' or just dreamin' in place?\nWhat's today? Outer space, still I'm searching somethin' great (somethin' great)\nA new museum of broken toys, just tryin' to fill a void\nYeah, I wake up a different year, different peers\nTables turned, I tried not to interfere\nYeah, shiftin' gear, tryna steer, things changed\nSee them gettin' smaller in my rear view mirror\n\n[Pre-Chorus: B.o.B]\nAre you here, are you really here, can you hear me clear?\nBiggest fear, hate to say goodbye, hate to disappear\nYeah, tell me are you really here\nIf it's just imagination, hate to see you disappear\n\n[Chorus: Cee-Lo Green]\nThey tell me that I play a lot\nBut I don't think that they play enough\nI don't know if I'm right or not\nTell me who ever stops growing up\nWe're just big kids\nThe world's our toy\nFor boys and girls, for girls and boys\nTell me who ever stops growin' up\n\n[Verse 2: B.o.B]\nYeah, how you expect to mean somethin' to the world\nIf the world don't mean somethin' to you? Ayy\nFocusin' on all the negative\nThe only thing that's negative is somethin' in you, ayy\nWe become the people that hurt us the most\nThat's why the saying is, \"Keep your enemies close\"\nStop givin' attention to what you don't want in life\nOr be prepared to experience it the most\nI became everything I used to criticize\nHad a look inside the critics' eyes, uh\nYeah, but all roads lead home\nWe just arrive at a different time\n\n[Pre-Chorus: B.o.B]\nAre you here, are you really here, can you hear me clear?\nBiggest fear, hate to say goodbye, hate to disappear\nYeah, tell me are you really here\nIf it's just imagination, hate to see you disappear\n\n[Chorus: Usher, Cee-Lo Green & (B.o.B)]\nThey tell me that I play a lot (too much, too much)\nBut I don't think that they play enough (right, right, right)\nI don't know if I'm right or not (not, not, not)\nTell me who ever stops growin' up (right, right, right)\nWe're just big kids\nThe world's our toy\nFor boys and girls, for girls and boys\nTell me who ever stops growin' up\nTell me who ever stops growin' up", "title": "Big Kids", "album": "Ether", "image": "https://images.genius.com/c1d1a3e42b682371920d4b45b3e96eb6.600x600x1.jpg"}], "artist": "B.o.B"}