{"songs": [{"year": null, "album": "That’s My Word", "image": "https://images.genius.com/47ee5f708b5ccb4fd2ef4c3b99aacc33.300x300x1.jpg", "title": "Super Hyphie", "lyrics": "(Yo.............Wassup Keak)\n\nSomethin Went Off In My Hand On My Strap, But Im Smokin Purple, Sippin Yac. (Yeah) Dat's My Word\n\n(Hyphie...What It Do...Fasheezy)\n\nDat's My Word\n\n(Mmhmm....Rah Records, Baby....Dope Game 2....2)\n\nSomethin Went Off In My Hand On My Strap, But Im Smokin Purple, Sippin Yac\nInhailer, Im Primatene Mist, Causin Asthma Attacks\nHittin Niggas, Takin' Early Faids, Gap Backs\nDirect The Scene, Shoot 'Em Wit Cannon, So How You Wanna Aaaaaaact?!\nBunnatin', Oppolatin' The Sizzle\nIn The Cut Alone Fuh Doin My Thizzle\nOohin, Drankin, Throwin Up The Huuuunnneeeeedddddssss!!!\nSolo, But On The Low, My Buddy (My Buddy)\nDoin Hella Shit At One Time\nMy Definition Of Hyphie Man Is Thizzin, Sniffin Lines\nIm In Da Buildin And Im Feelin Like Yeeeeeeee!!!\nR.I.P. To Da Mac D-R-E\nSo Don't, Dont Stop, Keep It Goin (Keep It Goin)\nWit Some Privalage In Da Back Boy, Blowin (Blowin)\nHold It Down For The Bay Reppin Oakland\nIf It Wasn't For That Grandaddy Smokin' (Dadida)\n\nYADIDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nYADDDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nYADDDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nYADDDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nI DONT THINK THEY KNOW, THATS MY WORD (Hyphie)\nI DONT THINK, THEY DON'T, THAT'S MY WORD (What It Do)\nI DONT THINK THEY KNOWIN, THAT'S MY WORD (Fasheezy)\nI DONT THINK, THEY DON'T, THAT'S MY WORD\n\nOoh Ahh, Ooh Aaaah! Do A Little Shit\nBrrrrrapabababaaayyyy. Have I Lost It? You Still Wit Me?\nFazeekin', Keakin And Sneakin\nAll In Tha Do', Wit Da Nappy Fro', Im Still Freaky\nOn Lithas, Bonitas, Senorita's\nTurn The Tool Is The Way They Stay Up On The Feature\nI See My Nigga In Da Traffic, Wassuppeee!!\nBrotha By Anotha Motha, First Cuz, Worst Bloody\nI Miss Big With The Husky Brusky\nQuartebackin, Trust Me, Rugby Rush Me\nColor Purple, Still In The Sweet It's Ugly\nI Dont Know You But You Lovin' Me, Fresher Than Doug E\nLook At Wat The Mothafuckin' Rap Game Don' Done To Me\nTo A Grown Nigga, Run Da Beat, Here Comes Keak Da Sneak\nSell Talk, What To Do Wit Technique, Nothin' But Heat\nSell Talk, What To Do On This Beat, This For The Street\n\nYADIDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nYADDDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nYADDDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nYADDDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nI DONT THINK THEY KNOW, THATS MY WORD (Hyphie)\nI DONT THINK, THEY DON'T, THAT'S MY WORD (What It Do)\nI DONT THINK THEY KNOWIN, THAT'S MY WORD (Fasheezy)\nI DONT THINK, THEY DON'T, THAT'S MY WORD\n\nFirst, Second Verse, Dis My Third\nSix Grade Drivin To School, I Had A Firebird\nI Don't Think They Knowin, That's My Word\nOh You Hip Now? I Was Problem Child, You Was Nerd\nI Was Bein' Bad, You Was Bein' Good\nBut All This Time Had A Destiny To Save The Hood\nAll Dat Shit I Been Through, Look At Me Now\nIm Strikin' Like A Match Mayne, Back To Tha Town (Back To The Town)\nBeenie Cap Fowl And My Mug On Mean (Mean)\nWakin' Up Ya Family Wit 4 15's (4 15's)\nIn Tha Driveway, They Can't Stand Me\nDie Hard Raider, Sneak Davis, Draft Randy\nMoss(sukasuk) Boss Gon' Be Flossin'(Floss)\nPut It On Thick Like MAC Lip Gloss (MAC Lip Gloss)\nOh Inhail Dat Shit, Mayne I Ain't Takin A Loss\nBut Pay, This Shit Cost Cause I Been Had Sauce\n\nYADIDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nYADDDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nYADDDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nYADDDAMEAN (Fasho), KNOW WHAT I MEAN (Fasheezy)\nI DONT THINK THEY KNOW, THATS MY WORD (Hyphie)\nI DONT THINK, THEY DON'T, THAT'S MY WORD (What It Do)\nI DONT THINK THEY KNOWIN, THAT'S MY WORD (Fasheezy)\nI DONT THINK, THEY DON'T, THAT'S MY WORD"}], "artist": "Keak da Sneak"}