{"artist": "The Game", "songs": [{"title": "Bitch You Ain’t Shit", "album": "The Documentary 2", "year": "2015-10-09", "image": "https://images.genius.com/f5bd9dcb51fd19e06b10b2ae0e3620cf.1000x1000x1.jpg", "lyrics": "[Verse 1]\nI got these freak hoes clappin' their hands, stompin' their feet\nEvery now and then they put their mouth on me\nBut these days a G like me can't even call it\nThey ride dick until you sleep and then go through your wallet\nFake ass, bitch ass, thot ass, slut ass hoes\nWorkin' in secret Sunday, don't even wipe that pole\nDirty bitch, you done had a dick in every one of your holes\nYou a trick, you ain't shit and everybody knows\nBitch you don't even wash your rag\nLet a nigga smash and you don't even wash your ass\nFuck you mean? You 'bout to go home and take a shower\nThat mean that pussy 'bout to be funky for a whole 'nother hour\nEvery night you let a new nigga nut in your shit\nHow you suck a nigga's dick with that cut on your lip?\nYou freak bitch, your baby daddy in the county doin' burpies\nAnd you gave that nigga herpes\n\n[Hook]\nBitch you ain't shit, bitch you ain't shit\nBitch you ain't shit, bitch you ain't shit\nEverybody knows\nBitch you ain't shit, bitch you ain't shit\nBitch you ain't shit, everybody knows\nEverybody knows, everybody knows\nBitch you ain't shit\nEverybody knows, everybody knows\nBitch you ain't shit\n\n[Verse 2]\nBitches ain't shit but hoes and sluts\nShe asked to hold 500, I let her hold deez nuts\nBitch what? You fuckin' niggas when you got cramps\nTalkin' bout eat these groceries, bitch you on food stamps\nYou gotta watch these hoes, they get your ass splattered homie\nNever trust a bitch if she got the hood tattered on her\nBrother, he a gunner, got an uncle from the hunnaz\nTwo baby daddies, one from the 60s and one from the Jungles\nMake it even worse, her whole family's full of killers\nAfter the funeral she right back to the followers and filters\nShe got a Range and a Benz\nDoin' credit card schemes with her ratchet ass friends\nBitch just stole a TV from Target\nYellin' at her kids while Joseline and Stevie be arguin'\nShe blocked from Drizzy's page now she all on my dick\nI hit her with a hashtag like (Bitch you ain't shit)\n\n[Hook]\nBitch you ain't shit, bitch you ain't shit\nBitch you ain't shit, bitch you ain't shit\nEverybody knows\nBitch you ain't shit, bitch you ain't shit\nBitch you ain't shit, everybody knows\nEverybody knows, everybody knows\nBitch you ain't shit\nEverybody knows, everybody knows\nBitch you ain't shit"}]}