{"songs": [{"title": "The Antagonist", "album": "Professional Rapper", "year": "2015-07-31", "image": "https://images.genius.com/14cb14f95be93a484fb28e180f91b8f7.960x955x1.jpg", "lyrics": "[Intro]\nYeah\nAye, can y'all turn my headphones down? Significantly?\nCool, that's good\nIt was super loud\n\n[Verse]\nFirst of all, this shit about me\nI ain't made this shit for y'all, that's the damn thing\nI been waitin' pretty long to get on some shit and rip it for Dicky\nSo just consider this my damn theme song, baby\nI been working hella hard, though\nThere's people telling me I'm 'bout to be a star, bro\nBut when I play 'em some of this, they like nobody want the pissed Lil Dicky\nYou the funny kid, that's where your card go\nThat metaphor about my lane, if you're retardo\nI'm bubblin' like I'm in a soda, word to Fargo\nI'm tryna get the fuckin' fame\nAnd it's a tricky little game you gotta play\nSometimes you gotta tell your heart \"No\"\nHere's the problem I been havin' (Uh)\nI wanna make my favorite type of music (Uh)\nAnd the shit I like to bump is not the type I'm brewin'\nI be on that \"Fuck the world, you motherfuckers losin'\" type of shit\nLike all you haters, look at what the fuck I'm doing\nAll my favorite rap is not amusing\nAnd I love my funny stuff, I hope it's not confusing\nI'm just saying, when you doing something time consumin'\nEvery now and then you wanna spazz\nWhy I didn't go with jazz, muhfucka\nGet up in yo ass, muhfucka\nY'all are trash, you ain't even know the half\nI could rattle off a lot if I position the rap game\nBut honestly I'm not in the position for that claim\nTo carry any weight, I just gotta carry on and wait\n'Til a motherfucker carry all the weight\nHypothetically, though, I'd probably tell you that I'm better than you'll ever be, bro\nI probably tell you it's objective, I'm more impressive\nYou pressin' play, and form a perspective\nI'm guessin' more or less it won't be competitive\nY'all adorable, sedative kind of rap is so deplorably edited\nNothin's worse than when a moron's repetitive\nI don't get it, how is everyone the same dude?\nThe rookie walkin' on the court like, \"Man, I can't lose\"\nThey playing Dicky, everybody in the room be like, \"That's some shit\"\nPlay 'em yo' bum ass, they be like \"That's some shit\" (Bums)\nY'all are bubbles wit' the rappin'\nLil Dicky get it popping, you could say he bubble wrappin' (Uh)\nThe irony in all of this is I been funny rappin'\nYet the youngin snappin' to the point where all of y'all look funny rappin' (Uh)\nCongratulations, y'all can write a hook\nAt my graduation, they was sayin' I could write a book\nIf a Rotten Tomatoes site existed for us rappers\nI would be a 97, y'all would hover 'round a 64 (Uh)\nLittle Dicky spit that Pixar\nHope you seeing why I really like to spit hard\nOnly problem is I'm rappin' to rappers\nTo the people that be listenin', that world doesn't matter\nWanna know what the advantage of the rapper who black is?\nThe N-word is his antagonist\nBefore you get all huff and puff about it, think about it, be analysts\nThe fact they always use, it's no accident\nFor example, I could be like \"Go figure\nI don't think I'm one to fuck with all you ho ______\"\nY'all could fill in the blank\nBut that'll make it so they don't gotta rap at a rapper\nThat applies to every detractor\nBut even if I had a word like it, the nerd never disturbed\nIt's absurd but I'm looking 'round and ain't nobody verse me\nI don't think a mothafucka's ever tried to hurt me\nEveryone I see has been supportive on this journey\nLike where my haters at? I'm thirsty (Uh)\nI just really wanna talk my shit, be like, \"Y'all ain't shit\"\nBut y'all ain't shit, like, y'all don't exist\nI could talk about the people that are dicks but I feel like it's whack\nThat'll get old quick, Robin Williams in Jack\nWho the fuck is my antagonist?\nIs it you? Is it you? (Is it you? Is it you?)\nIf it's you, let me tell you somethin'\nYou ain't even got a clue 'bout the shit that's comin'\nYou don't wanna be the dude in five years like\n\"The fuck, I dissed that\nShit was pretty clear, how the fuck I miss that?\" (Uh)\nYou know that I ain't fucking light, bruh\nI just fucked around and did this overnight, bruh\nI just fucked around and quit a fucking job\nWhere I was makin' triple digits then the comma got involved, dog (Uh)\nThis wasn't rappin' or trappin'\nThis was rappin' or a big old fuckin' house wit' a family\nWho the fuck is listenin' that's been making Dicky so angry? (Uh)\nIs it you? Is it you?\nI'm just waitin' on some non-believers\nThe writing isn't on the wall, it's comin' out your speakers (Uh)\nAnybody disagreein' being so facetious, homie I mean it\nForget the website, I'm the only mothafuckin' rap genius (Uh)\nWhere you doubters at? I'm tryna hear it\nMaybe it's the mothafuckas never paying mind to lyrics\nI would dumb it down for y'all to try make it more appealin'\nBut the ones who hang on every word think I'm kinda peerless (Yeah)\nBut even wit' no attention, you can kinda tell this mothafucka killin' this section\nYou can kinda tell this motherfucker still an erection\nBut gettin' harder by the minute, just admit it, it's sexy\n(I'm a boner)\nThe funny fact about this shit, I gotta rap about the fact I wanna rap about this shit\nTo even rap about this shit\nNobody been sleepin' on Dicky\nIt's only been a year and bitches been sleepin' on Dicky\nNobody took over the game with they first tape (With they first tape)\nThis mothafucka hasn't struggled since the first grade (Since the first grade)\nAdd it up, there's no excuse to go berserk, Dave\nCan't debate the shit, you got to skip, you not on first take (Whoa)\nSo what the fuck am I mad for?\nWhat's some other shit that I could actually spazz for?\nMaybe it's the fact that I been stuck in this lab for\nA hunnid fuckin' days straight cookin' up raps or\nThe fact this shit been takin' over every thing in life\nI gotta make it so I made the call to leave it all behind\nThat's my girl, that's my world, that's beyond bein' busy\nNow the only one that gets to David Burd is Lil Dicky\n\n[Outro]\nSee, I told you this about me\nGo on and look up in the mirror, see without D\nWho you hate, boy?\nOnly care about me, said I'm straight, boy\nMaybe I'm the one that gotta hit when I wanna murder shit\nY'all probably thinking \"Who is David Burd?\" and shit\nY'all just wanna hear some LD\nBut I ain't made this shit for y'all, that's the damn thing\n[Instrumental break]"}], "artist": "Lil Dicky"}