{"songs": [{"lyrics": "[Intro]\nYes! It's the collection!\nIt's ya boy S. Dot\nYes! I'ma take this time out to talk to you about The Black Album real quick\nIt's a prequel to all my... uh.. all my albums\nIt's the activities leading up to my first album in '96\nIt's like the book ends for the whole career... you know\nWe gon' take it all the way back\nIt's a time peat circa '88 to '94, maybe 95'\nWe'll put a little bit of '95 in there, you know what I'm saying?\nAll the things that lead to songs like Friend or Foe or D'Evils you know what I'm saying?\nYou know all those activities you know what I'm saying? Yeah\nIt's ya boy Hov!\nWe gon' take y'all back to school, real quick\nThe game is all wrong, business niggas is snitching and it's okay..\nWe gotta adjust the game, put it back where it's suppose to be\nWe gotta put back the integrity back in music man\nYou know what I'm saying?\nCheck it out!\n\n[Verse]\nThere's rules to this shit, consult the OGs\nBefore you dudes make one move on the strip\nBefore you move your lip, take the tool off your hip\nI'll show you how to do this shit\nI'll tell you what type of car to buy\nWhat type of shoes to get\nWhat type of jewels to cop, you could rule this shit\nManolo Blahnik or Jimmy Choo's for your chick\nYou gotta treat her right if she gon' mule your shit\nDo you know the type of damage love could do\nIf she feels she's getting taken advantage of? Ouu!\nIf you wanna understand\nStanding up like a down chick suppose to?\nHere I'll coach you, Young ain't fake like most dudes\nYoung move weight like Cool J's trainers, it's a no brainer\nAnd don't be wearing no vest with no banger\nThat just makes you a target\nYoung used to run the block, now I corner the market\n'86 your bullshit, man get smart kid\nBut you ain't want to do no small bid\nIncarcerated with the hard heads, acting like you hard head\nThat's all dead, get yourself the hog's head\nCheese, we could all get, R.S.V.P\nMan we used to play dolls here, wet niggas with the faucet\nCome through get your car ran, ran errands for the bosses\n'Til I became one, now I got linen in the closet\nI got the blueprint you just gotta follow it\nRule number one, real niggas never gossip\nRule number two, own The Black Album you gotta cop it\n\n[Outro]\nHehehehe, hehehehe\nYeah man, we just gon' bring it back to the game man\nBlack Album, S Dot\nIt's the collection\nFirst non athlete with a shoe\nIt's history baby\nI know you love me, you just don't know how to tell me\nIt's all good though, I love y'all too\nIt's ya boy, Guru, fade it", "title": "Blunts and Armadale (Freestyle)", "image": "https://images.genius.com/0572d3c2a8305ab228c6cfdc3005ee89.300x300x1.jpg", "year": "2011-10-11", "album": "The S. Carter Collection"}], "artist": "JAY-Z"}