{"artist": "Boogie", "songs": [{"album": "Thirst 48", "title": "Save You", "year": "2014-06-24", "lyrics": "[Intro]\nYou see at first, I remember me saying you should um, come save me and shit\nIt's kind of different by now, though\nLet me save you\n\n[Verse One]\nYour beauty deserve dedication, with my medication\nBut you sick of the games I be playing\nI swear that I'm changing, you tell me you hate my perfection\nThen you talk in ya Spanish, well shit, I learned my lesson\nI feel like a Usher, I'm tryna collect it\nNow ain't that ironic? We fuck to Confessions\nI swear you my blessing, just look how it got us affected\nAll this lack of affection, it just lead to this stressing, I swear that it do\n\n[Chorus]\nI hate you, I love you, I need you, no, fuck you\nYou leaving? Like, damn, what you doing?\nThe games that we playing, I swear they confusing\nIt's just an illusion\n'Cause we made for love\nWe fight together, and you break it up\nI let you down, and you make it up\nYou gave a lot, I thought I gave enough, that shit was fake as fuck\nAnd that's real, 'cause we made for love\nWe fight together, and you break it up\nI let you down, and you make it up\nYou gave a lot, I thought I gave enough, that shit was fake as fuck\nAnd that's real\n\n[Interlude]\nI just figured\nLike sometimes, somebody gotta stop being fake\nWe gon' eventually have to tell each other how we really feel, though\nThirst 48, Thirst 48, fuck\n\n[Verse Two]\nI hate you, I love you, I need you, no, fuck you\nYou leaving? Like, damn, what you doing?\nThe games that we playing, I swear they confusing\nYou know what the truth is\nI feel like a Usher, I'm tryna collect\nWell ain't that ironic, to say my confession\nI knew I was destined for death from the jump\nTook your breath from the start\nAs I look at my ankle\nLike how it's gon' heal if I step on your heart?\nIt's more than a spring when you up in this game\nI just can't let it stress me\nAs you picture my face and you tell me how you feeling sketchy\nYeah you picture my face and you tell me how you feeling sketchy\nThen you tell me it's over, the shit that you text me, whoa\n\n[Chorus]\nFuck, we made for love\nWe fight together, and you break it up\nI let you down, and you make it up\nYou gave a lot, I thought I gave enough, that shit was fake as fuck\nAnd that's real\n\n[Outro]\nThat was real\nI fucked up my notes, my bad\nShit still fake though\nThirst 48\n\n[Sound Clip]\n(You see, niggas like me\nI'm not thirsty. I just know what the fuck I want!)", "image": "https://images.genius.com/967988d72ade953e4d1121eb78757aa7.1000x1000x1.jpg"}]}