{"songs": [{"year": "2003-09-23", "lyrics": "-=Baby Bash=-\nWhich way did he go?\nWhich way did he go?\nWhich way did he go?\n\n[Hook: A-Wax]\nThis ain't nothin' new to me\nLook at what they do to me\nNeed to chill\nTry to stop\nDid dirt wit it now I gotta buy the chop\n\n[Baby Bash]\nI'm in my mama rent a car wit 10 and a half pounds\nNo DL's and innocent amount of rounds\nWit my mind on my mansion\nI'm smashin' up out the town\nYou thought I was a hog but wait 'til I clown now\nBasharini believe me\nStill servin' three for the 50\nAnd I wish a motherfucker would try and get wit me\nCuz I'm nifty wit the milli when the torch is on\nAnd play every play like it's fourth and long\nNow when the horse is gone I be the shit out the pig\nIt don't take much to split a fool's wig\nSee I'm only one shot from makin' the headlines\nSo quick niggas got quarters and deadline's\nShakin' the fed time\nThey checkin' my bar codes\nATF, INS, and the US Marshals\nAnd this ain't nathan new to me\nCapitalize on opportunity\nThis ain't nathan new to me\nCapitalize on opportunity\n\n[Hook] - 2X\n\n[A-Wax]\nThis old shit ain't new to me\nI'm rockin' stolen jewelry\nTry to chill so I leave the Bay\nDid dirt wit it now I gotta keep the K\nBash a dude wig over Baby Bash\nHe my smokin' nephew\nWe be checkin' brains and cash\nWe count G's on a omni floor\nPut the bloody bills wit the Tommy in the drawer\nTell mommy wit the roll \"Go on break a lil' corner off\"\nI don't like that bammer\nI don't wanna cough\nYou got to watch every step\nP-walk and pull out a tec\nI thought you new I'm a vet\nLet loose through my set\nA-W-A-X the latex glove on my left hand can only mean death man\n\n[Hook] - 2X\n\n[Jay Tee]\nNow it's that pimpin' ass gringo\nBitch is you single?\nI spit heat, hit the street, stack my Domingo\nBay Area lingo is what a playa blessed wit\nTen shots wit they own spots is all I ever mess wit\nSo if you're broke\nI ain't even heard a ya\nCome around me again and I'm a murder ya\nI need some loot\nSo watch how I attack yo town\nA bitch who wanna hold me, I'll track her down\nGet up in the brain, take over the soul\nFour G's a night, I'm ready to roll\nA big long lac, hella beat in the trunk\nBaby kick back, it's hella heat for the funk\nI dare a motherfucker to step to the Lo\nOne too many drinks, now he's dead in the Rove\nSo call that cat's kids tell him \"Get this\"\nIt's Jay Tee, I'm a dog when I spit this", "title": "Tha Chop", "album": "Tha Smokin’ Nephew", "image": "https://images.genius.com/64603eb1c06e292b66e8e33c4aa10509.400x400x1.jpg"}], "artist": "Baby Bash"}