{"artist": "Ice-T", "songs": [{"title": "Art Of Rap Freestyle 2", "lyrics": "I sold too much coke in the eighties\nIt's my fuckin' fault, I made you crack babies\nNow you whine and cold woke me up\nLike a wild wolf won't murder his sick pup\nNiggas on the net talkin' crazy and reckless\nBusters don't know you get laid down for much less\nThis ain't no game, cuz niggas now we come\n.50 cal dum-dum, rubber-grip bear guns\nI see you run like diarrhea\nHide behind your fucking bodyguards like little ballerinas\nIt ain't no thing when them damn things flame\nFully automatic makes the clubs' ears ring\nThe oldest nigga, true, that means I done it the most\nQuestion is now which pussy want it the most?\nY'all ain't shit to me, never got your G on\nSofter than the pillows at the Bed, Bath & Beyond\nYour mistake thinking that I'm dead and gone\nAsk your mama, I'm bloody in the octagon\nI'm iller than Chucky in Child's play\nI bench 300 on a bad day\nI'm wild like Uganda machetes\nYou motherfucking with a psychopath, you niggas ain't ready\nCracked my nigga T.I., but they didn't catch me\nMy silenced P90 sounds like sewing machines\nBugatti Veyron, Plasma Screen\nMalibu beach house, lake house, I'm caked out\nI come in all blue, I don't know red\nAnd, I don't know throw dough, I make it rain lead\nCoked out, I'm boiling bricks in the kitchen\nI don't matter If you got it, nigga. Tricking is tricking\nAlgebraic, I multiply my metaphors\nI'm so spa from deep tissues and pedicures\nOverload of niggas in ski masks\nWestside rider for life, you ain't gotta ask\nL.A., home of the triple beam\nMy niggas run all up in your crib like a S.W.A.T. team\nI'll make your SUV lean\nFull metal jackets have it rockin' like a raft in rapids\nThe last nigga in life that you want to meet\nKeep talkin' shit on the net, I'll see you in the streets", "image": "https://images.rapgenius.com/f0aeac92b776c723b57d9503308e67c3.278x357x1.jpg", "album": "Something From Nothing: The Art of Rap Soundtrack", "year": null}]}