{"songs": [{"year": "2010-06-22", "image": "https://images.genius.com/094639b25f790dc7c57451247197cfd7.360x360x1.jpg", "title": "Dub Sack", "album": "Gang Rags", "lyrics": "[Intro: Blaze Ya Dead Homie]\nYeah! Blaze ya dead homie MEC!\nTen years in the making, know about it, bitch!\n\n[Hook x2: Young Wicked]\nDubsack, I got your back!\nHand you that for the Andy Jack\nParked on mac in a purple lac\nTrying to fatten up my stack\n\n[Verse 1: Blaze Ya Dead Homie]\nLookin for the twin twin twin\nCheck the purple mac with the switches hand damn\nFrom the back ben quarters B ten\nAuto mac cause I got a couple twelves to trade it for a sack\nI got big way, and cut it straight up on\n48 sacks and they all fat dubs\nDo the math cause making hand over fist\nPaying six for a pound of that bubba kush shit\nMade them other hoes quit when I sealed up the block\n6 shotgun shells and only 2 shots\nNow it's my spot, my place to shine\nMy street, my curb make money on a dime\nSup, you need a dime and I'm right on top\nGot me some nickelbacks for the bitches at the stop sign\nJust a little sample, only for the ample women\nGot a jackson and a dubsack you gettin'\n\n[Hook x2]\n\n[Verse 2]\nI take coin star notes to bottle return slips\nPhone cards, 360 points, I'm even with\nI once took a headshot from this rap bitch\nAnd the drought is raining over here, I got your fix\nPaint your ass what it is it's the newest in the biz\nBy now they know mosquito I ain't fucking with no meds\nOnly fuck with whole grain at the heaviest of strain\nA dubsack a day, it'll take away your pain\nTake the pressure off your brain\nTake the worry out your mind\nLoad a dubsack in a blunt, and get high\nInhale the smoke and choke, you feelin' good right?\nEverything's a party when the dub's inside\n\n[Bridge x2: Young Wicked]\n1 for the nickel\n2 for the dime\n20 for the dub of that bubba kind\n1.50 for the quarter, 3 for the half\n6 for the O with the pink giraffe\n\n[Verse 3: Blaze Ya Dead Homie]\nAll my lettes' and los' everybody knows\nThat I'm out selling dubsacks after the shows\nIn the purple caddy out the back window\n15 for my fam, 20 for you other hoes\nYou know this shit is actual\nWhen a half on a digiscale\n2 grams of bud and a half of gram of baggies sale\nNo stems or seeds, that shit has been gone\nOnly keep the high gray, so you can get your smoke on\nYour homies get their coke on, rips from the glass\nWhere burn the whole shack puts the smoke in the air\nDubsacks I got em, best trees I got em\nOnce you got a dub you can never live without em\n\n[Hook x2]\n\n[Bridge x2: Young Wicked]\n15 for the juggalos\n15 for the juggalos\n15 for the juggalos\nAnd 20 for you other hoes\n\n[Hook x2]"}], "artist": "Blaze Ya Dead Homie"}