{"artist": "YG", "songs": [{"image": "https://images.genius.com/b8ae0860db71072dcdc94da82ab14f11.474x435x1.jpg", "year": "2013-01-21", "album": "Just Re’d Up 2 ", "lyrics": "[Bridge: YG]\nGotta go to court tomorrow Fuck it\nBlew a stack at the mall, Fuck it\nI was supposed to play basketball, Fuck it\nMy bitch was cheatin after all, Fuck it\n\n[Hook x4: YG]\nFuck it, fuck it\n\n[Verse 1: YG]\nGotta go to court tomorrow\nD.E.A. on my dick\nYa'll niggas like flys ya'll be on my shit\nYa'll niggas ain't fly ya'll niggas hoes\nYa'll niggas ain't bros ya'll nigga hoes\nMoney stacked for your lawyer cause I catch a case\nWhere the crocadile hunter at?\nThese niggas snakes\nUgh, ya'll nigga tried to pack the homies\nYa'll niggas swiss cheese like macaroni\nYeah, I gotta go to court tomorrow\nBut I prolly won't show up\nYour bitch say she at home\nIf I pull up she gon ho up\nI pastacio crack your bitch\nThen pour up some actavis\nFuck the camera I got the glam on me\nTwo box shorty got the hammer on me\n\n[Bridge]\n\n[Hook]\n\n[Verse 2: Reem Riches]\nFuck court, fuck the judge, fuck the D.E.A\nPushaz Ink bitch we ball like E.A\nReem Rich yea my pockets on swole nigga\nYoung and rich I'm addicted to these gold diggers\nSo much money think we signed with illuminati\nInked up, tats all on a nigga body\nGeeked up nigga, beam me up Scottie\nThat's your bitch nigga\nShe let us run a trolley\nYeah, she wasn't even off the molly\nPushaz Ink the label, bitch you heard about us\nHit the mall, blow a stack, then it's back to rap\nPorsches, Benzo's, nigga back to back\nRap don't work, then it's back to crack\nMy nigga Mustard on the beat I'm his young attack\nYeah, it's a lot of money over here\nThem niggas lookin broke over there\n\n[Bridge]\n\n[Hook]\n\n[Verse 3: YG]\nI get a number 6 from Popeye's\nI go at stop signs\nI got your bitch on a hot line\nI drop hits you niggas drop dimes\nYeah, just caught another case\nIm nigga, my bitch is another race\nUgh, I put you in another place\nYou know what?\nYou niggas better say your grace\nYeah, you niggas better say your grace\nI'm trying to beat trial like an 808\nLike, like boom boom boom\nMy house got room room rooms\nYeah, we can smoke weed or we can do shrooms?\nYou nigga droppin albums too soon\nJust got another court date\nLike my taxes I was late\n\n[Bridge]\n\n[Hook]", "title": "Fuck It"}]}