{"songs": [{"year": "2011-03-22", "album": "Who Is KB?", "image": "https://images.genius.com/cc0b72e73e609b19ba9fe03fa5eac73b.757x759x1.jpg", "title": "Go", "lyrics": "[Verse 1: KB]\n\nGive me the mic bro\n\nI'm never hesitant, I'm heavenly reverent when we get to kickin' lyrical rhetoric\nCome to evidence of the incredible medicine sent from our heavenly father edible bread and water\nJust taste it!\n\nKeepin' the Christ up, fishin' with lyricism an' givin' 'em -ism and -ology when we get em'\nPoliticking with guerrillas that can petition to kill us\nBut even if we die we know that our lives won't be wasted\n\nSo it's glory alone when we flow, praisin' the name of Jehov\nFrom the middle where they get it to the inner city to the suburbs, send me Imma go\nOh, and if you don't know, we comin' up out the word when we flow\nSo we get the scripture get this don't twist it that's a big no no\n\nImma give it to 'em whenever I'm given the opportunity\nBustin' 'em crushin' 'em then brush off the enemy\nEnergy given me by the Holy Spirit that live in me\nAlone I could never do it as hot as I pretend to be\n\nSlayin' the inner me, while tamin' the inner beast\nSo when I spit the gospel He's mainly the centerpiece\nWilling to intercede, praying that the Spirit will hit em and convict em\nSo one day they can enter peace\n\nThey would rather do without him they sayin' that they don't need Him\nBut did you know that you needed Him to say you didn't need Him\nSpeaking of, speaking down to your breathing and thinking\nApart from his power you couldn't even speak on Atheism\nBut me and my brothers get it singin' like Jimmy Needham and livin' in freedom cause we know we seek Him\nAnd if anybody wants to get down with the kingdom of heaven we gotta heavenly remedy in the message of the Gospel, Yes!\n\nFather God I know I gotta be obedient\nAnd the Holy Spirit'll be the number one ingredient\nMaking it expedient when it comes to me preachin' it\nAnd mercy to men to repent of their sin and sending me Im'ma go!\n\nFather God I wanna be the one that's reachin' em\nAnd when it comes to the Word of God I wanna be teachin' em\nI pray that you will never let me stumble back away from the mission that has been presented\nNow turn the ignition so I can\n\n[Chorus]\n\nGO(x4)\nI GO\nGO(x3)\nI GO\n\n[Verse 2:Tedashii]\n\nHold up! For what? Keep it goin' lemme get it lemme rip it\nI'm wishin to give you more than a smidgen\nJust like a pixel in a picture this is more than a snippet\nMan this is everything together plus the sink in the kitchen\nYou heard the story of his glory and the call that he's sendin'\nAnd while we flowin, when we go, we stand close to his will\nAnd when we out we stand out, like a city on a hill\nCause tryin' to hide is unreal like layin low to the ceiling\n\nAnd so we spit it the way we get it evangelism\nGivin, bearin' witness to men and women---this ain't religion\nRules and regulations, no constellations and making wishes\nRealizing we alive as we get it with 'em\n\nHit 'em up! With the rib and he came and he lived and he died and he rose in the sky on high just to save us\nGet 'em up! From the dead and in sin from the curse to the grave's dust\n\nYes you need to know\nGod alone existed before\nEverything else still that's proof that truth never hidden\nMan, kidding? No!\n\nApplication is unneeded for the way where there's sinfulness\nGiven everything that God'll do while he sends 'em\nTell em God the Father sent His only begotten\nAnd take the lonely forgotten from sins of people and wash 'em\n\nFrom the bad to the worst we go\nSo the Son came down, gave up His throne\nAnd he took that crypt, that spit, that crucifix and died then he rose\n\nSo no boasting in me but only he who redeems and Ima spittin the vision written for Christians\nFrom Samoa to prison and even out of the prisons cause in the works of religion no matter the mission, I'm tellin' you to\n\n[Chorus]\nGO(x4)\nI GO\nGO(x3)\nI GO"}], "artist": "KB"}