{"artist": "Ace Hood", "songs": [{"title": "Double Cup", "album": "Body Bag Volume 2", "year": "2012-08-17", "lyrics": "Intro:\nDouble cup and I'm leanin'\nX3\nFuck these niggas I mean it\n\n(Hook:)\nDouble cup and I'm leanin' (I said it)\nDouble cup and I'm leanin' (I said it)\nDouble cup and I'm leanin' (I said it)\nFuck these niggas I mean it\nX2\n\n(Verse 1: Ace Hood)\n\nOkay now, Purple stuff in my styrofoam\nSippin' slow while they blowin strong\nAll I need is my dirty sprite\nAll I need is her super-dome\nDrank'd up and I'm dripped out\nCaked up and my pistol out\nBad bitch and she thick as fuck\nAnd I'm tryna see if what pussy bite\nBust it open for a real nigga\nBust it open for a trill nigga\nTouchdown, whattup? H-Town\nLong live the Pimp, this one's for you!\nBun B, my nigga Trae The Truth\nStill in the coupe and I'm double dueced\nStill in the hood on that purple, fool\nBetter know what I'm drinkin' ain't grape juice!\nI be flowin' through the city, let my chain swing!\nHow you live, a young nigga tryna maintain\nGet money, fuck lames, all my little niggas on the same page\nSpend racks when I'm up in Neimans\nGimme head she gon' catch this semen\nHatin on me? Nigga, so what? Ya know what?\nHold up...\n\n(Hook)\n\n(Verse 2: Bun B)\n\nGangsta nigga, I'm bout it\nI'm Trill as fuck so don't doubt it\nTell me what's the haps, cause you know I'm strapped\nA nigga never leave home without it\nI'm posted up in that Caddy\nI'm twistin' up a big fatty\nAnd it's full of dro, and I'mma mack your ho\nAnd you know she callin' me daddy\nI'm a trill OG and I earned it\nThat G code, nigga I learned it\nSo when I saw the dough they had for me bro\nI just grabbed the knob and I turned it\nI wanted bread so I chased it\nAnd I got so close I could taste it\nI played the deck and got my respect\nSo nigga I'm the king, now just face it\nI'm in the house and I'm chillin'\nMy mind on cash and I'm willing\nI'm on the paper chase, no time to waste\nSo I could give a fuck how you feelin'\nI'm sideways on that buck\nMy seats is stitched and they tough\nYou ain't down with that?\nThen I'm hide your head in your ass\nAnd be outta luck, wassup?\n\n(Hook)\n\n(Verse 3: Kirko Bangz)\n\nWell it's that young nigga from the Southside\nOf that USA I need Calamine\nLotion cause a nigga used to bump\nA nigga came from nothing to saying nevermind\nTo the pretty girls in the magazine\nYour girlfriend look like Maxim\nA phone book full of Billy Jeans\n? Came out that limosine\nI been a fan for that Codeine\nSince Martin Luther was like 13\nFuckin' queens cause I'mma king\nPut 5% on everything\nI done threw tint on top of tint\nBumper kit, on bumper kit\nThrew my last bitch on my new bitch\nAnd threw ten on my fuckin' dick\nI done came down, hold it down for that H-Town\nI'mma take the crown\nSippin Hen, dont fuck with Crown\nBut I'mma just drop this 4th of 9\nAnd free my cousin that doin' time\nI'mma pay the lawyer\nBut I hope he dyin'\nHold it down for a real nigga\nYoung Kirko, young trill nigga\n(BANGZ)\n\n(Hook)", "image": "https://images.genius.com/961c89453e41ea86f02f3614b8d52ec3.507x507x1.jpg"}]}