{"songs": [{"title": "99 Problems & Messages", "album": "TBA", "year": "2016-10-28", "image": "https://images.genius.com/6f5497123a973a015f459267b86a33a4.600x600x1.jpg", "lyrics": "[Verse 1]\nAny nigga couldn't sit in my chair\nYeah it's on nigga this is my year\nI done ran through all this fly gear\nLouboutin shoes more than five pairs\nYou don't like me, what the fuck do I care?\nI get money what the fuck do I care\nI was posted on the block where\nTry to rob and you get shot there\nI'm a monster, I'm a goblin\nI go hard and I'ma rocket\nI spent 13 on a wallet just a black card in the wallet\nFuck a car key push the start it\nThought I told y'all I'm an artist\nGot a baddie in the valley out in Cali pushing gardens\nCan't fuck with the extra shit\nEvery time I go out it's an extra bitch\nTryna get in my bed to have sex and shit\nI just wanted some head like the exorcist\nI got 99 problems and messages\nDon't be asking me why I won't text you bitch\nWrap your legs around me like we wrestling\nGet on your knees don't you be so damn hesitant\nWhen I get your body I'ma be alright\nAnd when I get a 'Rari you can be inside it\nI'ma get another one and let you drive it\nBaecation for an extra night\nAnd I won't tell nobody all your secrets, I can keep a secret girl\nI know you need somebody\nAnd I really need somebody\nSo tell me you're that somebody, girl\n\n[Bridge]\nI think I might be too late but I'm sorry\nI'm sorry baby, but you should thank me\nAppreciate me, congratulate me\nI got money I don't need to stress a bitch\n\n[Chorus]\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\n\n[Verse 2]\nI got 21 questions for you that I wanna know\nWould you make me look stupid\nI'm really feeling the way that you moving\nI just wanna know if you finna come through tonight\nI can promise you that I'ma do you right\nYou gon' wish you can go back and do it twice\nI can pick you up in an uber right\nGet high on the way to a flight\nWould you ride for me? Would you lie for me?\nWhen you come around good vibes with me\nI rock with you, do you rock with me?\nI swear other bitches do not get me\nDon't be scared baby this is my city\nBut just in case I keep a .9 with me\nI was hoping you can grind with me\nIt gets lonely on this side baby\nBut can you stay the fuck off my Instagram\nI don't know why my phone's always in your hand\nBaby I try to get you to understand mind your business\nYou know I'm a businessman\nI'ma give you the time of day when I can\nTook a minute for me to be who I am\nMy finesse, I can turn a five to a ten\nI been traveling, they don't know where I am\n\n[Bridge]\nBut, I think I might be too late but I'm sorry, I'm sorry baby\nBut you should thank me, appreciate me, congratulate me\nI got money I don't need a stressful bitch\n\n[Chorus]\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages\nI got 99 problems and messages"}], "artist": "A Boogie Wit da Hoodie"}