{"songs": [{"year": "2015-07-28", "album": null, "image": "https://images.genius.com/832cea551c94bfbb6c6b8f46eda89751.500x500x1.jpg", "title": "Hesitation", "lyrics": "[Intro]\nNigga, what the fuck is up? You tryna be rapping that bullshit, you think you're famous or something? Nigga what the fuck, your shit's cool, it ain't Jah Blaze though. Nigga what the fuck? Roll this blunt. Nigga what the fuck you been up to nigga, you can't pick up the phone no more?\n\n[Chorus]\nKnowledge, where you been\nI tell 'em I've been writing rhymes\nIf they only understood what's on my motherfucking mind\nCan't waste no time, no I cannot waste my time\nThat's all the fuck that I own\nI pray to God I attain what I dream and imagine\nNo patience but I cannot stop\n\n[Verse 1]\nWhy am I the only person that I know with a dream or purpose\nEverybody else around me is a major threat\nThey want to infiltrate my thoughts with the negative\nI said I try to block 'em out with more sedatives\nI know I'm down at the moment, not accepting it\nI'm broker than a motherfucker, my regret is this\nI should have never tried to spit\nThe moment I dropped out of college is constantly in my mind\nI wish I could forgive myself so that my wound might heal\nWhen I'm looking in the mirror, all that I can see is fear\nI couldn't comprehend the consequence that came with my decision\nMaybe I was never meant to be nothing from the beginning\nI'm sick and tired of my livin'\nI'm really looking to end it, my attitude is offensive\nI guess that I realize that I'm actually unimportant\nI'm pourin' all my emotion on the page, yes darlin'\nBut everything I deal with is making me feel hopeless\nLawd!\n\n[Chorus]\nKnowledge, where you been\nI tell 'em I've been writing rhymes\nIf they understood what's on my motherfucking mind\nCan't waste no time, no I cannot waste my time\nThat's all the fuck that I own\nI pray to God I attain what I dream and imagine\nNo patience but I cannot stop, lawd\n\nOh shit, nah nigga you was really serious. I didn't, yo I didn't think you was really gonna be doing this shit. I wrote this shit down today, you said you was gonna be ra-, I wrote it down like Brandon made a very funny joke today. That shit's comical nigga, what the fuck nigga? Just get a job, nigga, what the fuck?\n\n[Verse 2]\nI think everyone has got a short attention span\nThey never see the bigger picture like it's happenstance\nIf you don't make it overnight, it's not happening\nOh your pessimistic attitude will never subdue me\nI need a moment to myself, I gotta figure it out\nAnd this shit is looking impossible, your vigorous doubt\nYou try to take a nigga down with everything that you got\nYou act as though I couldn't see that that was really the plot\nI'm living in my isolation, man, I like it a lot\n'Cus I don't need nobody 'round me\nFuck it, I'll say it proudly\nGuarantee I'm astounding, screaming it out loudly\nWhy must I do this alone?\nI'm out on my own\nWith no place that I could call home\nI need a pastor so I can atone\nI feel like I'm dying and going to hell\nI focus on my soul, not no damn record sales\nLawd\nFuck!"}], "artist": "K.A.A.N."}