{"songs": [{"year": "2017-09-11", "image": "https://images.genius.com/84420a132152a19b7d6b4521e6e94937.1000x1000x1.jpg", "title": "Ali", "album": "The Purple M&M", "lyrics": "[Intro]\nHah, hah, hah\nBlocBoy, BlocBoy\nYeah, word\nHah, hah\n\n[Chorus]\nMuhammed Ali\nFloat like a butterfly, sting like a beamer\nMe and Lo 'round with a forty and a nina\nShawty walked past, girl I dig your demeanor\nNow she got her hand and her mouth on my penis (she slurpin')\nShe the type to wipe it off fast like a cleaner\nHit her from the back, smack her ass, she a creamer (woo)\nSay you want a jack, where is that when I see you?\nMuhammed Ali you\n\n[Verse]\nI swear y'all niggas ain't worth it\nY'all niggas chicken like turkeys\nYou're not on the roster, y'all niggas imposters (word)\nWho the fuck gave y'all them jerseys? (word word word)\nI need the bag right now (right now)\nI flip a stack right now (right now)\nI told my niggas that we gonna make it\nIt ain't no turnin' back now (now)\nLoad up the fuckin' MAC now (yeah)\nBitch don't you see these big old four four bullets? (doon-doon-doon)\nI call up Feezy right now (word)\nIf there's no witnesses, he gon' go pull it (that's on my mama)\nSay you killer, you a pussy\nShootin' bullets without lookin'\nTalkin' 'bout some purp and cookies\nThat's fake gas, call it whoopie cushion (gas)\nShit can get ugly like Whoopie pussy\nGoldberg if a nigga want to be there\n'Cause your bitch forehead up on my dick hair\nWhy you kissin' on her when you know what I been there\nAsk for a three when I know that her friends there\nShe is a freak, call her score how I been there\nThese niggas chicken, remind me of tender\nThink a nigga died how a nigga got in there\n\n[Chorus]\nMuhammed Ali\nFloat like a butterfly, sting like a beamer\nMe and Lo 'round with a forty and a nina\nShawty walked past, girl I dig your demeanor\nNow she got her hand and her mouth on my penis (she slurpin')\nShe the type to wipe it off fast like a cleaner\nHit her from the back, smack her ass, she a creamer (woo)\nSay you want a jack, where is that when I see you?\nMuhammed Ali you"}], "artist": "BlocBoy JB"}