{"songs": [{"image": "https://images.genius.com/a07f036c2aeb784c2bf0358dd289e682.500x500x1.jpg", "title": "Knives", "album": "the nothing,nowhere. lp", "year": "2015-06-30", "lyrics": "[Intro]\n\"And the hard part was just becoming part of society again; it's like they didn't want me. They didn't want me to be part of their society anymore. So I just decided, fuck it. I'm gonna sleep in a tent, I'm gonna do what I love for a living, which is playing music. And if I just make a little bit of money, I'd rather do what I love with passion and make a little money than go back to contracting and then try to make a lot of money and be part of a society that doesn't even want me no more. Fuck 'em, you know? Fuck society.\"\n\n[Chorus]\nDo you think about life?\nDo you stay awake at night?\nDo you dream about knives?\nDo you think about life?\nDo you stay awake at night?\nDo you dream about knives?\n\n[Verse]\nSolo, so low, so\nSee I'm feeling so low when I'm solo\nBut I'm still alone though\nBeen conducting a ballad but no one can play to\nMy tempo, my body's a rental\nMy skeleton's relevant only to me though\nThe day I was born, signed a deal with the Reaper\nFunny how I had no choice in it either\nThe people around me, they drink by the liter\nIt turns them all to instinctual creatures\nSo I confide inside all my anxieties\nSome find a god, live the lie, send the bible to tell me that\nDon't need a god in the sky, don't abide by a book\nDon't confide in a lie when they preaching the hate\nJustified by faith, you don't buy all the talk\nYou're just scared of a coffin, fuck\nIt's a maze in my mind, I'm amazed that I'm fine\nHey remember the time I was 'bout age nine\nWhen I didn't get how you were sad all the time? Now I do\nCause we all grew up in suburban homes\nWhen the purpose known was to not grow up\nWhen we grew up, when we grew old, wanna throw up\nNow I take nostalgia by the spoonful\nLife doesn't feel so beautiful\nFuck it, at least I'm being truthful\n\n[Chorus]\nDo you think about life?\nDo you stay awake at night?\nDo you dream about knives?\nDo you think about life?\nDo you stay awake at night?\nDo you dream about knives?\n\n[Bridge]\nYou almost crashed your car staring at the stars\nLife means nothing when you're going nowhere far\nYou almost crashed your car staring at the stars\nLife means nothing when you're going nowhere far\n\n[Interlude]\n\"It's alright. You know, when it comes down to it I came in this world by myself, and when I die I'm gonna be the only one in that coffin.\"\n\n[Chorus]\nDo you think about life?\nDo you stay awake at night?\nDo you dream about knives?\nDo you think about life?\nDo you stay awake at night?\nDo you dream about knives?"}], "artist": "​nothing,nowhere."}