{"artist": "Ice-T", "songs": [{"title": "Rhyme Pays", "lyrics": "[Verse One]\nMagnificent rhymer, I'm the ill beat designer\nIf they ask you if I'm def, don't front and say kinda\nMerciless, meticulous, so fresh it's ridiculous\nI'm raised in the heart of Los A-N-G-E-L-E-S\n\nKing word connector, the vocal projector\nYour girl tried to jock me, I had to reject her\nAlways adventurous voice some say is sensuous\nNow, I'm on the mic so I think I better mention this\n\nI don't like Gucci, Fila, Louis, or Fendi\nThose are fads and I ain't trendy\nBut whether your name's Lucy, Terry, Laura, or Cindy\nIce got the beef and this ain't Wendy's.\n\nBust a move while I'm talkin'\nSucker rappers I be stalkin'\nWhen they see me on the street with my homeboy walkin'\nThey slow down, turn around and ask was that Ice?\n\nThen they see me cold countin' my cash\nRhyme pays!!\n\n[Verse Two]\nMoves must be busted, girls can't be trusted\nI looked at your lady and I was disgusted\nCame into the party just to rock the place\nAnd your big zombie lookin' freak still won't get out of my face\n\nI don't mean to diss her, but do you kiss her?\nLook at her lips, she got them crazy blisters\nBody that smells like the New York mets\nArm pits all nappy packed full of sweat\n\nI hope this something that you never forget\nTie that freak outside next time you come in the set\nBecause my jams be crazy, packed with all fly ladies\nI'm talkin' def girlies and I don't mean maybe\n\nThe way I rhyme no one will ever slay me\nAnd I ain't lyin' rhyme do pay me !\n\nRhyme pays!!\n\n[Verse Three]\nI'm notorious, I'm infamous, like a snake I'm venomous\nFor those who may diss I think you should consider this\nI can make a rhyme complicated as a puzzle\nDangerous and as violent as a pit bull in a muzzle\n\nBut this record is for radio S-T-E-R-E-O\nIt not to be banned or for some underground mix show\nMy hearts in my pen every time I begin\nSometimes my lyrics go crazy and I just can't control em my friend\n\nI try to edit what I'm rappin' about\nBut I can't write polite my anger just jumps out!!\nPerpetrators in the business claim their hard as hell\nTalkin' that gangster shit, know'n they're soft as jell-\n\nOh! I better chill out before I ill out\nAnd my negative potential just might spill out\nAnd then this record won't be gettin played\nI'll save that rap for another day\n\n-Rhyme pays-\n\n[Verse Four]\nThe front stage area goes into hysteria\nAs I start to rhyme and unleash my criteria\nOf what is to come during the beat of the drum\nAnd Evil agitates the records with the use of his thumb\n\nUsing his intricate moves, the record stays in the groove\nMy boy cuts like Jason, it's easy to prove\nThat Evil E is the great, his cuts are real not fake\nNot emulated effects or a play back tape\n\nSo suckers witness your fate while Evil demonstrates\nI'm bout to get off this mic, E., dog the break - Kick it!\n\n[Verse Five]\nLike me if ya want'a, diss me if you're gonna\nBut my jam will still be kickin' on your neighborhood corner\nAs my bass is max'n out the V.U.S. on your box\nThere'll be no doubt within your mind whether this MC do rock\n\nLike granite, I planned it, So you could understand it\nIf someone's talkin' when I'm rhymin'\nThen just say, \"Damn shut up!\"\n\nWhile Ice is breakin' the boy don't be fakin'\nMaybe they're just jealous of the dollars I'm makin'\nBut you're down with me. You know god gifted me\nBlack kids say I'm trech, white kids say I'm nifty\n\nSpell out my name ya go I-C-E T\nBut right now it's time for Evil E to hit me!\n\n[Verse Six]\nRhyme pays, buys my food every night and day\nIt pays my rent my bills I guess I'm doin' ok\nBut when I say rhyme pays, I mean in different ways\nCause rappin' gets a lot of kids out of the streets each day\n\nIt makes me feel real nice when someone likes the Ice\nOr some young MC asks me for advice\nBut there will always be rappers who hate Ice T\nMaybe I dogged 'em in a battle or just jealousy\n\nInevitable situation, sucker rapper frustration\nI rhyme too tough to bite, too intricate for notation\nSyllables jumble, competitors crumble as they witness mic attack\nAnd the microphone rumbles like hurricane\n\nI maim, sometimes I go insane\nStep toward my rap and I inflict the pain!\nNo shame Ice capital T's my name!!\nDamn there I go illin' out again!!!!\n\n-Rhyme Pays-", "image": "https://images.genius.com/b3b06b9ea3b9003bda8e918d44ff9a1d.147x147x1.jpg", "album": "Rhyme Pays", "year": "1987-07-28"}]}