{"artist": "Andy Mineo", "songs": [{"title": "Tug Of War", "album": "Heroes for Sale", "year": "2013-04-16", "image": "https://images.genius.com/fdf80f726778a05ec46bdc108384b8f2.540x540x1.jpg", "lyrics": "[Verse 1]\nMama praying for me, grandma praying for me\nSatan preying on me, Jesus waiting on me\nCause I been straddling the fence, it’s time to make decisions\nI been thinking ‘bout heaven lately, don’t think I’ll get in\nCause I been going back and forth I love the way I’m living\nBut I hate it at the same time cause I know I’m sinning\nAnd I don’t wanna be like them hypocritical Christians\nSo I stay away from Jesus completely ‘til I’m ready to give Him\nEverything, but that seems like it’ll never happen\nMy girl coming over later, you know what’s about to happen\nThen after smashing I’m sitting there asking\nIf eternity in Hell is worth some moments of your satisfaction\nMan I’m so back and forth\n\n[Hook: Krizz Kaliko]\nBack and forth like a tug of war (yeah)\nCause I’ve been fighting for my life like\nTryna get my life right\nAnd I really want more\nI don’t know, back and forth like a tug of war\nAnd I been fighting for control and fighting for my soul and\nThis is war, it’s a tug of war\n\n[Verse 2]\nI got two choices, both require pain\nOne’s the pain of change and the pain of staying the same\nOne of ‘em leads to joy, other one leads to shame\nOne of ‘em leads to freedom, the other keeps me in chains\nI wear a cross and give You thanks for my blessings, ain’t that enough?\nWhy you want everything? Can’t you leave this part of my life untouched?\nI thought following You meant I only had to say yes once\nNow everyday I wake up You give me some cross to take up\nYou really want me to break up with my girl? Nah that’s too much\nI know what’s best for me, You don’t understand my complexities\nSee, I gotta make a living so don’t ask where my checks come from\nI hear You talking, I ain't gone numb\nI know I’m in the dark and I gotta find my way to the Son\nCause You’re calling on my name and I know I can’t run\nBut I feel so back and forth\n\n[Hook: Krizz Kaliko]\nBack and forth like a tug of war (yeah)\nCause I’ve been fighting for my life like\nTryna get my life right\nAnd I really want more\nI don’t know, back and forth like a tug of war\nAnd I been fighting for control and fighting for my soul and\nThis is war, it’s a tug of war\n\n[Verse 3]\nA trail of broken hearts, a man full of regrets\nThe thrill has left, the empty promises of sin sets\nYou wanna put treasure inside my hands but You cease\nCause they’re clamped, holding on to sins I won’t release\nI don’t know how to start loving You and stop doing what I’m doing\nIf I gain You tell me what I’m really losing\nYou have to change me in my sin, I never choose Him\nMy heart needs to see something greater than what I’m pursuing so\nIs it true that You give rest to the weary?\nCan you accept and repair me, do you hear me?\nIt’s so clearer now, it’s painfully apparent that I can’t have my sin and my Savior, they’re not for sharing\nAnything that I lose to follow you is not a loss\nMy girlfriend, my friends, my money, even my job\nBut sometimes I believe the lie\nThat God don’t provide for His child when they obey, that’s so cray\nYou calling me to freedom, I think that it’s time to walk\nI don’t see every step but the next is out of the dark\nI’m the filthiest of them all but I’m Yours if you wash me\nFrom that sin by the blood of that cross, I’m yours"}]}