{"artist": "Azealia Banks", "songs": [{"title": "Chips", "image": "https://images.genius.com/3728c37e67817b2557a4c55f90393b99.500x500x1.jpg", "album": "Fantasea", "lyrics": "[Verse 1]\nChamp in the buil', and what the deal?\nThis about to be another jam on the reals\nYou could dance if you with it, with ya gams on stilts\nBut ya can't-can't slip up on her dance floor\nShe'll steal your man if she meet him, and ya man toss chips\nWent to France and Ibiza, hundred grand for the trip\nWhen I land, I get greeted with the lamb on the strip\nLittle Bam swiped the Visa for the glam and the fit\nDamn lil' diva you the champ, you the shit\nYou the glamour, the glitz\nYou a vamp, you a witch\nListen up my nigga you a fan, you a trick\nYou be amped to the spits, with ya mans in the whip\nAnd heard ya rich, heard ya rich nigga rich\nHeard ya clique hit a lick and ya stick to the bricks\nAnd if it splits, get ya cran and ya tips\nPut ya hand on ya dick, take a gander at this\n\n[Chorus]\nHi, rippin' up my mind, open up my eyes\nRealize this and show me, show, show me one time\nAy-ay, ay-ay , ay-ay\nRide, a lift in your ride, the look in your eyes, I like it\nSo won't ya show, show me one time?\nAy-ay, ay-ay, ay-ay\n\n[Verse 2]\nI'm everywhere you can't go\nI'm everywhere you wish you could\nI'm stitched-ed up in that Van Vogue\nMy weave long and my pussy good\nI lift it up and I tip it slow\nThat chocolate body, that tootsie roll\nThat flirty Hershey, lawd' a mercy\nDo it to me, don't hurt me, hurt me\nRoly poly, float ya boatie\nDick get up - it's so swolly-swolly\nSwollen-swollen, he holding-holding\nHe packing pack and I'm throwing back\nAnd I'm counting racks while he lick the crack\nIf he acting up then he getting slapped\nIf I pop the truck then he getting clapped\nI'll pop ya rump and I'll split ya back\n\n[Chorus]\nHi, rippin' up my mind, open up my eyes\nRealize this and show me, show, show me one time\nAy-ay, ay-ay , ay-ay\nRide, a lift in your ride, the look in your eyes, I like it\nSo won't ya show, show me one time?\nAy-ay, ay-ay, ay-ay\n\n[Verse 3]\nCan I get that?\nCan I get that whip? Can I take that trip? Can I get that grip?\nCan I split that chip with my bitch pack?\nWhere my rich cats?\nWhere ya keep that ship, when ya hit that strip?\nAnd ya hit that sand, in the sand, get a tan on ya six pack\nWhere my bitch pack?\nWhere ya get them clothes?\nHow you make that roll?\nHow you make that dough?\nSip it slow, sip it slow, sip it, sit back\nQuit the chit-chat, 'fore I grip that fou' and I lift your soul\nWhen I lick that, go nigga, go nigga, go nigga, go nigga\n\n[Chorus]\nHi, rippin' up my mind, open up my eyes\nRealize this and show me, show, show me one time\nAy-ay, ay-ay , ay-ay\nRide, a lift in your ride, the look in your eyes, I like it\nSo won't ya show, show me one time?\nAy-ay, ay-ay, ay-ay", "year": "2012-07-11"}]}