{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/b8a6fedf93e2b53192849769f1df9958.400x383x1.jpg", "title": "Fall of Solomon", "year": null, "album": "Best of Killah Priest & A Prelude to the Offering", "lyrics": "[Intro: Killah Priest]\nWhat up, Priest?\nWhat up, cat?\nSince you're one of the dopest MC's that I ever heard\nI want you to kick the story\nYeah, I got one, already..\nThe dopest story I heard, check it\n\n[Killah Priest]\nThieves in the temple, a priest murdered at the doorstep\nHe heard the hounds of horses, surround his fortress\nLook down, the whole town with torches\nBlood on the door knock where our lord slept\nNight before the see-er saw it, so they slept nautious\nBroken windows with cannisters, hidden cameras\nMasked man at the top of the bannister\nShattered glass everywhere, someone pushed his man down the stairs\nA knife in the back with a note attached, read 'Beware'\nLooked up, saw a blowin curtain, a open window\nAnd heard the whistle of the soft air, someone screamin 'warfare'\nSo Solomon takes cover, a servant yells out 'the bitch is cursed\nDon't touch her', but he trusts her, he also loves her\nCalls her the Rose of Sharon, his bright morning star\nHisLily of the Valley, a spy cut her throat inside a dark alley\nSomeone knocked his daughter off a balcony, bloodshed in Galilea\nThe cowardly flee to the hills of Cabarea\nThieves of a hundred gates, the queen of cities\nNo one shows pity, flyin spirits, floatin demons, fallen saints\nSoldiers walkin by their ranks, service of the East gate, scared to drink\nWhat would our leaders think? Every man lookin at each other, scared to blink\nThe seed inside the sanctuary, scary\nPortraits of Saint Mary, with Mona Lisa\nThe Queen of Cheeba, strokin a cheetah\nOther mid-wives sayin 'I don't like the way he treats her'\nPass the reefer, bad cheeba, Solomon judge wisely\nWisdom spoken of highly, hair knotty, ask God 'Why me?'\n\n[Hook 2X: Killah Priest]\nIt's the street life that I write\nFrom beginning to end\nDealin with these lies and deceptions\nLike the fall of Solomon\nAnd all my niggas in the State Pen\nWho doin five to ten\n\n[Killah Priest]\nOrder these guards to untie me\nHe said men do not despise a thief if he steals to satisfy his soul\nIf he's captured he shall restore it, seven fold\nA legend unfold, let it be written in the scroll\nSolomon's gold, swallow them whole\nHe said 'Fuck you!', make me another Pagan God\nUsin brass poles, spies layin up in the closet\nThey open the door, they spray holes through the prophets\nSolomon whispers, a man reaches in his zipper\nThe king killed by his own bishop\nHid beneath the bed but gave himself up when he hicced up\nTears of a child, 'Daddy, get up!'\nFast forward, you see Malcolm X fallin from a pulpit\nSprayed up by bullets, dead over bullshit\nNiggas layin on the pavement, holes in their Woolridge\nLook what the wolves did, full clips and cartridges\nImposters live, adoptthe kids in front of corner stores\nPoppin shit, throwin up gang signs at the same time\nThem niggas roll dice and fight canines/K-9's\nShould I wake 'em up or let 'em stay blind?\nCause education seem like it's only shit to a thug\nYou either Crip or you Blood, really? I'm sick of the grudge\nY'all niggas need to dip it in blood, I should walk by\nAnd take a flick of your mug, show you how vicious you was\nNeighborhood overflooded with liqour and drugs\nYoung queens grow up to be strippers in clubs\nMan, damn son!\n\nChorus 2X\n\n[Outro: Killah Priest]\nIt's the street life that I write\nIt's the street life that I write"}]}