{"songs": [{"year": null, "image": "https://images.genius.com/6fd0c2edeadfae2824a883040dba6bd9.490x490x1.jpg", "title": "Mr. Dead Folx", "album": null, "lyrics": "(Chorus 2x)\nNo questions for you too ask, no gats for you to blast\nNo money, weed, no cash\nIt's time to get in that ass\nMr. Dead Folx, Colton Grundy Ya Dead Homie\nDon't be acting like you don't see me\nBelieve me man you don't know me\n\n(Blaze)\nI was the first to put it down\nReppin' with Twiztid and the clowns kicking the gangsta sounds\nStrictly keep it underground\nLotus in the family, you now how we do\nComing for ours and won't hesitate to ride on you\nRecord sales don't make you bulletproof\nBig time, and we both know you don't be doing that shit that's in your rhymes\nYou ain't a G like me, you ain't the thug I be\nYou watered down, like the punks I see on MTV\nWhere you're motherf**king trees, always asking for smoke\nAin't it a bitch, everybody a G when wearing Loc's\nThat's a figure of speech, and I be sick in the heat\nWhoever think he the shit, trying to claim my territory\nI'm a motherf**king G with heaters loaded and cocked\nYou's a small time pee-on, braggin of running rocks\nBitch break yourself, for everything and then some\nHold the mic to my dick, so you can hear me when I cum\n\n(Chorus x2)\nNo questions for you too ask, no gats for you to blast\nNo money, weed, no cash\nIt's time to get in that ass\nMr. Dead Folx, Colton Grundy Ya Dead Homie\nDon't be acting like you don't see me\nBelieve me man you don't know me\n\nNever ever was I a bitch hoe\nYou can put that on my ten-fold\nMa pop Grundy and them know I sicko\nBaby boy got banana clips for his chopper\nKnown to bring drama somethin' proper\nCheck nuts\nColton Grundy got handles, I got the J\nSo when I'm spiting from the big oh line, nuts' in your face\nDead homie on a ho-port, smoking a Newport\nSpiting at the bitches, and bumping that new Too Short\nLife is nothing I can even they to relate to, for real though\nBeing dead is serious, it change you\nAll I got left in this world, is my music to play\nSo you correct if you thinkin', that I'ma do my thang\nAnd all the thugs that wit me, throw your shit in the air\nAnd wave those motherf**kers side to side\nLike you don't care\nAnd if you feeling like I'm feeling, then it's plainy clear\n'Cause it's a whole bunch of dead folk chilling in here\n\n(Chorus x2)\nNo questions for you too ask, no gats for you to blast\nNo money, weed, no cash\nIt's time to get in that ass\nMr. Dead Folx, Colton Grundy Ya Dead Homie\nDon't be acting like you don't see me\nBelieve me man you don't know me\n\n(Violent J)\nIt's me and Blaze, drunk driving in an 87 Cutlass\nTaking turns at the wheel while the other claps motherf**kers\nYou're chick, I'm dicking that\nWicked shit, I'm kicking that\nI'm hitting with the quickness, life's stinking, where the chickens at?\nYou made a wrong turn coming down my block\nI'll stop your car like I need help, and crack your head with a rock\nUh, Colton Grundy the only homie I got\nMr. Dead Folx sparking at the burial spot\nWe about to ride on the world, leave it deserted like Marz\nGet your wig spilt, by 40 juggalo rap stars\nA little kid asked me if I ever killed anybody (yes)\nI told 'em that I did and was warm and bloody\nI'm Violent J, I'll be around until my dieng day\nOn tour smoking bud, and eating Flying J\nLook me up under 'Juggla' and you'll find my name\nAnd if you don't, then you're dictionary's lame motherf**ka!\n\n(Chorus x2)\nNo questions for you too ask, no gats for you to blast\nNo money, weed, no cash\nIt's time to get in that ass\nMr. Dead Folx, Colton Grundy Ya Dead Homie\nDon't be acting like you don't see me\nBelieve me man you don't know me\n\n(Repeat Till End)\nMr Dead Folx\nBelieve me man you don't know me"}], "artist": "Blaze Ya Dead Homie"}