{"songs": [{"lyrics": "God damn, now lick my balls, oh shit\n[Bitch] You like that?\nPut 'em off\n[Bitch] It's good?\nOuch, shit, godamn bitch you bit' my damn\nShit I said suck the mothafucka, you're bitin' it, shit!\n\n[Narrator]\nHas this ever happened to you?\nDoes her teeth get in the way while she's sucking your dick?\nDoes she know how to suck a dick?\nWell, I had that same problem until my bitch went out and bought N.W.A's new book entitled \"The Art of Sucking Dick\"\n\n[Bitch]\nLesson 1 - First you grab the dick\nNext you gently lick it up and down, then insert it into the mouth\nTake it slow, don't rush it, and before you know it ..\nSPLASH!\n\n[Eazy-E]\nIt goes one for the treble, two for the bass\nShe got nut all over her face\nKick kick it ...\n\n[Verse 1: MC Ren]\nSlow is the tempo, and Ren is gonna flow\nAs I produce and illustrate you to a ho\nCaught on the late night, stamping on the base-pipe\nShe's a hype to get you on the late flight\nBut back in school she was a cutie, yo\nThen after graduation started giving up the booty\nIn school, stuck her head in a feather\nEvery time I asked her what's the time\nIt was never ever what she would talk to the Ren I'm sayin'\nI wanted a date, she wouldn't even be my friend\nBut now in the 1990's, I'd be praying that the bitch don't find me\nCause she's got a gang o' kidz nappy-heads and all dirty\nAnd she's getting pimped by a nigga that's thirty\nI saw her hanging in an alley\nRaggin to her friends how she's ho'in' in the valley\nAll by herself, doin' on the ho stroll\nComin back home late night with the bankroll\nYou know a bitch like that makes me sick\nBut I've heard that she sucks a good dick!\n\n[Hook]\nIt's the world's biggest dick\nDon't matter just don't bite it\nIt's the world's biggest dick\nDon't matter just don't bite it\n\"What do you want me to do with it?\"\nDon't matter just don't bite it\nShe swallowed it (yeah)\n\n[Verse 2: MC Ren]\nAt a high school dance, me and the niggas bailed in\nI saw her sittin' with her friends, with the clan\nSo sexy, thought she was all that\nShe wouldn't even look at us because we wore the black hat\nShe was a stuck-up bitch on the public floor\nBut an instant prostitute behind closed doors\nOn the streets she's a late night feature\nWalking home from school, I saw her sucking a nigga's dick under the bleachers\nShe saw me and she ran and tried to hide her face\nBut a bitch full of nut couldn't escape in the chase\nA disgrace, If I ever ever saw one\nThere wasn't a nigga on the block late at night not getting done\nSo she begged me not to tell a soul\nThen I said of course, cause my dick, yo, it's harder than a totem pole\nThen again it don't concern me\nCause there's a slight chance if I fuck she might burn me\nAnd then I might have to shoot the ho\nI mean checking with the quickness just to let her know\nBut to prevent from getting sick -\nI would just prefer to let her come and suck my dick\n\n[Hook]\nIt's the world's biggest dick\nDon't matter just don't bite it\nIt's the world's biggest dick\nDon't matter just don't bite it\n\"What do you want me to do with it?\"\nDon't matter just don't bite it\nShe swallowed it (yeah)\n\n[Verse 3: MC Ren]\nNow I was at a club on a late late Sunday\nPeeping at the bitches 'till the next day Monday\nHad a couple of drinks, so I was feeling good\nAnd suddenly I saw this bitch  that lives in my neighborhood\nShe went to church every week so now I lucked up\nShe was at the end of the bar gettin' fucked up\nBack at the house she was bitch n' be ignoring\nAnd when she start to talk the ho' was kinda boring\nYo, but now I got to dawn, see\nNow she's dancing on the floor with a skirt and no panties on\nShaking that ass like a salt shaker\nI already got my plans -\nJust while I'm a take her to a room\nBut yo I mean a rest room\nAnd stick my dick in her mouth like a wet broom\nSo I grabbed her hand and she's wit(h) it\nSo when she turns sober, she'll never admit it\nSo while she's dropped I'd better get it quick\nAnd see for myself if she sucks a good dick!\n\n[Hook]\nIt's the world's biggest dick\nDon't matter just don't bite it\nIt's the world's biggest dick\nDon't matter just don't bite it\n\"What do you want me to do with it?\"\nDon't matter just don't bite it\nShe swallowed it (yeah)\n\n[Outro]\n\"So there you have it - a job well done (She swallowed it)\nBut for now let me get back to what I was doing\" (She swallowed it)\nGet it\nWhat the fuck suck this dick bitch\nYeah, here comes\nOoh shit, goddamn\nGoddamn\nGet it all baby, get it all\nSuck this dick, suck this dick, suck this dick for daddy baby\nSuck this dick\nYou know you like it\nSuck it\nOh she swallowed it\nShe swallowed, oh shit, get it all, get it all, suck this dick, suck this dick, suck this dick for daddy ..\nWait till I tell the fellas how you sucked this dick\nHey matter of fact, I want you to suck Dre's dick\nThen I want you to suck Yella dick\nYou already sucked Ren's dick\nYOU BOYS ARE DISGUSTING!\nJust suck my dick bitch... cause I'm a nigga wit an attitude!", "album": "100 Miles and Runnin’", "year": "1990-05-29", "title": "Just Don’t Bite It", "image": "https://images.genius.com/1f1306ebc3ce5d611ce103d6c1bc8880.944x936x1.jpg"}], "artist": "N.W.A"}