{"artist": "Westside Gunn", "songs": [{"year": "2017-04-16", "lyrics": "[These lyrics are intentionally locked and left partial due to a DMCA takedown request. Please do not edit the lyrics to include the removed sections.]\n\n[Intro: Keisha Plum]\nBow our heads, let us pray\nThou shall still not fuck with the Flygod\nWho else has done what he has?\nFuckin' God risen from the Buffalo slums\nGriselda gang, let them other niggas hang\nEaster eggs finessed with rubies and gold\nKeisha Plum, giving you the greatest story never told\nPastry poochie, wild as David Ruffin on coke, dripping in Gucci\nIt's Gunday, eat these words and die\nSurprise surprise, she's still the illest poet alive\n\n[Bridge: Westside Gunn]\nAyo, (boom!) Ayo fuck these niggas yo, (boom boom boom boom boom boom boom boom boom boom!) aye yo\n'Fuck about (grrrdt!) none of these niggas, yo (Grrrrddddttt! boom boom boom boom boom!)\nLuxurious fly shit (doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot doot!)\n\n[Verse 2: Westside Gunn]\nAyo, infatuated by coarse paintings and laws waiting\nMedusa on the saucer scrapin'\nI be the flyest nigga ever, mirror mirror\nOff-White biker leather, yo, Superman all on my sweater yo\nWarhol with the gloves on, turn the stove on\nMoney green, [?], you never drove with\nI had the fiends on the block singing \"West that nigga\"\nYay dealer, J Dilla, 50 on both wrists's, coke whippers\nChanel bags for both of my bitches, peace (peace!)\nSold dope for ten years straight\nDog sniff the readymade bag then fainted\nReadymade frogman leaping over basics\nYour favorite rapper a lil nigga, let's face it\nKnow it, NYC apron like I'm baking, Lord\nThe chain cost thirty, thirty did 'em dirty\nYou fuckers ain't worthy, Lord\nI do shit like, cop a new whip when I'm bored\nGriselda Records nigga, see the scale and the sword\nGriselda Records nigga, it's the fuckin' almighty\nUsed to camp in the line, now I'm getting boxes from Nike (ow!)\nShoutout the Flygod's by Nike\nShout out to Chris from Play Cloths\nI just might paint the Wraith gold\nFace blown off, one shot though (Boom!)\nHop in the Ghost and ghost, (skrr) Gucci goes for show\nFree my nigga A, free my nigga Sos (Free my niggas)\nGod, why you take [?] so soon? (so soon)\nWhy you take him so soon Lord?\nGod, why you take 'Chine Gun so soon? (so soon)\nHe never made it to twenty-five (twenty-five)\nThey never made it to twenty-five (twenty-five)\nThey never made it to twenty-five (twenty-five)\nWhy you took my nigga so soon?\nWhy you took him so soon?\n\n[Bridge: Westside Gunn]\nAyo, it's the Flygod himself\nIt's Easter Gunday\nI just pissed champagne all morning\nLast night was beautiful, we went out\nY'know, was there at your birthday weekend man\nWe had the section\nWe popped bottles all night\nGorgeous bitches, smoking dope, you know\nFly of course, we just livin' life\nNiggas dropping they albums man\nI'm not fuckin' impressed neither\nSee I fell back for a minute, doin' the clothes and shit\nEverything sellin' out, man I think the people-\nY'know this shit art, my nigga, this shit legendary, nah'mean like-\nI-I come with this shi- I-I come with this shit-\nLike, I come at this shit on some other shit, y'nahmean\nNiggas keep stealin' my fucking shit man, nah'mean?\nAny- yo, I'm tired of niggas stealin' my shit man\nLet's be fuckin real man\nNah'mean, your fucking favorite rappers some little niggas too\nTell you that, I don't give a fuck how-\nThem niggas could be 42, them niggas is still little niggas man!\nLet's get that fuckin' straight\nIt's 'bout to be a hell of a year man\nI just woke up and wanted to do this shit, man\nI had to give y'all niggas part two man\nAnd yo, I don't know what the fuck y'all niggas thought\nBut shit don't change over here my nigga\nThis shit is loyalty over here my nigga, no matter what\nSo with that bein' said...\n\n(Yuh!)\n\n[Verse 2]\n\n[Outro]", "image": "https://images.genius.com/7d9ce661813aeb4e00fc47b1f9f92c27.542x543x1.jpg", "album": null, "title": "Easter Gunday 2"}]}