{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "Disco inferno - live from sessions @ aol", "lyrics": "1, 2, 3, Let's go!\n\n(Chorus)\n'Little mama show me how you move it\nGo head-putcha back into it\nDo your thing like there ain't nothin' to it\nShake, shh shh shake that ass girl\n'Little mama show me how you move it\nGo head-putcha back into it\nDo your thing like there ain't nothin' to it\nShake, shh shh shake that ass girl\n\nGo, Go, Go, 50 in the house, bounce\nY'all already know what I'm about\nTha flow sounds sick over Dre' drums nigga\nI ain't stupid, I see Doc then my dope come quicker\nWhoa!\nShorty hips is hypnotic, she moves is so erotic, but watch, I'm like bounce that ass girl\nI get it crunk in here, I make it jump in here, front in here, we'll thump in here\nOooohh\nI'm so gutta, so ghetto, so hood\nSo gully, so grimey, what's good?\nOutside the benz on Dubs\nI'm in the club wit the snubs\nDon't start nothin', it won't be nothin'\nUuuhhh\n\n(Chorus)\nLet's party, everybody stand up\nEverybody put ya hands up\nLet's party, everybody bounce with me\nSip champagne, and burn a little greenery\nThis hot\nDisco Hell, let's go\nYou are now rockin with a pro\nI get told to flip dough to get more, fo sho'\nGet my drink on then get on the dance floor\nLook homie I don't dance all I do is this\nIt's the same 2-step with a little' twist\nListen pimpin' I ain't new to this, I'm true to this\nPay attention boy, I teach how to do this shit\nYou mix a lil' criss with a little Don Perignon\nAnd a little' Hennessy, you know we 'finna carry on\nHollerin' at this bitch in da club tryin' to get right\nWe gonna be up in this bitch 'til we break daylight\n\n(Chorus)\nYou see me shinin', lit up with diamonds uz I stay grindin' (Uh-huh)\nHomie you can catch me swoopin Bentley coupe switchin lanes (Ha Ha)\nYou see me rollin, you know I'm holdin, I'm about my paper (yeah)\nNigga I'm serious, I ain't playin', I'll embed it in ya brain, I'm off the chain (G-Unit!)\nNext level now, turn it up a notch\nEm and Dre sent me to tear up the spot\nFront on me, oh no, you know I'm loco\nHands up on the dance floor, ok let's go\n\n(Chorus)", "year": null}]}