{"songs": [{"image": "https://images.genius.com/ee62eaadc933ad3f925698b7acc99635.500x500x1.jpg", "year": "2016-03-18", "title": "01 MANIKIN", "album": "ItWasntEnough", "lyrics": "[Intro: XXXTENTACION]\nThat beat is just weird as fuck\nNah straight up, keep it real over here (Alright)\nLemme just out my neck (Okay)\nMy voice muted?\nOkay, yuh, yuh\nOkay\n\n[Verse 1: XXXTENTACION]\nAfter I hit metamorph, hey\nI am a dog, girl abort, hey (Okay)\nShoot pregnant wife in a Porsche, yuh, hey\nThat is expensive abortion, hey\nI ran it up, fuck a portion, hey\nAin't had no family like orphan, hey\nMight sell some xans to the orphanage, yuh\nOn your face might stomp the yard\nOn my Mom I'd catch a charge\nPlay with pussy like guitar\nI'm the realest one thus far, hey, yuh\nYou are just running, a candidate, hey\nYour girlfriend said you are minute man, hey\nBitch, my trap house, it got management, hey\nI got no heart I'm a manikin\n\n[Chorus: XXXTENTACION]\nI got no heart, I'm a manikin\nI got no heart, I'm a man-\nI got no heart, I'm a manikin, hey\nI got no heart, I'm a-, yeah, ayy (This shit's alright)\nI got no heart, I'm a manikin\nI got no-, ayy, hey, yeah\n\n[Interlude: XXXTENTACION & wifisfuneral]\nAnd then it cuts\nYeah bu- yeah, keep it, keep it goin' though\nYeah, ayy, yeah, yeah, ayy, yeah\nYeah, I'm not gon' lie, wifi, you turned up on this shit\nAyy, yeah, look, damn\n\n[Verse 2: wifisfuneral]\nLike pussy, why you duck my fade?\nI stare at Satan in the face\nYou soft as fuck, like, what the fuck?\nI flick my cig and then you fade, ayy\nNow since a jit i been in love with that fuck shit\n40 clips causing white noise in her voice\nThat she sniff no distortions\nHalf a fat check on my teeth like I'm Norbit\nOG gas pack to contaminate lungs\nNow I'm higher than orbits\nFalling off like Forbes list, put the force into her core\nI'm the one like I'm Obi, forcing whores to forfeit\nCome within my circle, we gone clip your vocals\n\n[Chorus: XXXTENTACION]\nI got no heart, I'm a manikin\nI got no heart, I'm a manikin, hey\nI got no heart, I'm a manikin\nI got no-, yeah"}], "artist": "XXXTENTACION"}