{"artist": "Andre Nickatina", "songs": [{"title": "My Name Is Money", "album": "Khan! The Me Generation", "year": "2010-04-20", "image": "https://images.genius.com/a40bfc48fac301c14baf8ed031c3f584.600x600x1.jpg", "lyrics": "What's crackin everybody you probly know me my name is Money\nAnd when it comes to me\nLike all y'all want something from me\nI got the pimps, the pushers, players, all the junkies screamin\nCause if they have no Money baby then they start to feenin'\nI'm at the gamble shack\nSometimes they put me in the back\nSometimes the D boys put me where all the guns and all they dope is at\nI'm in your pockets, wallets, purses all your hideaways\nI'm probly the root of everybody's very violent ways\n\n(Let me hold you)\n(Let me hold you)\n\nYo, ask Obama he say straight up\n\"Yo, I know that Money\nHe's in my pocket and I dare you try to take him from me\"\nI know the Mafia\nThey love me and they treat me well\nMan, they be askin for me even when they go to jail\nI'm in the drug game so I know about them drug sales\nAnd I be all on Wall Street so I know like when your stock fails\nSome call me \"Cash Flow\" and I dig it like a bad ho\n\n(Let me hold you. Let me hold you\nThis is what they say\n(Let me hold you. Let me hold you)\nEvery single day\n(Let me hold you. Let me hold you)\nIn a religious type of way\n(Let me hold you. Let me hold you)\nLet me touch you, let me hold ya, something\n\nI'm at the crap table and some might say a dice game\nAnd when it comes to me people will like argue kill and fight mane\nThey call me Ben Franklin, Benjamin and Young Benji\nThey call me Blood Money yo when the gangsters come and get me\nThey like to bury me and carry me in armored trucks\nAnd just the other day man some kid said\n\"I'm strictly guaped up\"\nAnd all the politicians like to give me to they mistress\nAnd all the broke bitches mention me in all they wishes\n\n(Let me hold you)\n(Let me hold you)\n\nThey make me rain at strip clubs like the weathers bad\nAnd some might ask for more of me if your credits bad\nSome spend me real fast man, like they know I won't last\n\nAnd some like to put me away in big old Hefty garbage bags\nSome call me Cheddar Cheese and they'll die for me you best believe\nAnd they don't want me from Mickey D's\nThey wanna get me out this freak\nI'm nothing cheap you need to hear it and believe that\n\n(Let me hold you. Let me hold you)\nThis is what they say\n(Let me hold you. Let me hold you)\nEvery single day\n(Let me hold you. Let me hold you)\nIn a religious type of way\n(Let me hold you. Let me hold you)\nLet me touch you, let me hold ya, something\n\nWhen people have me they tell other people that they ballin'\nAnd all the strippers tell they boyfriends\n\"Hey yo, Money's callin! \"\nI'm all in Vegas I'm the number one priority\nAnd I know every president so don't make me show authority\nI know the coc dealers familiar with life pushing keys\nAnd one name was Montana and he stacked up a lot of me\nI'm all in bank vaults if I'm lost it's they fault\nAnd I like all the pretty women that like to tell men what they cost\n\n(Let me hold you)\n(Let me hold you)\n\nSome like to steal me, yo and lie to people that they did it\nAnd even on they death bed they just won't admit it\nYou can't take me with you\nHere's the issue\nI'll forget you\nAnd depending on how much you had of me that is why people miss you\nThey call Money mane you can mix me up with that honey mane\nAnd anyone can be a boss but bosses know I'm running things\nThat's why all bums be thinking that I'm spare change\n\n(Let me hold you. Let me hold you)\nThis is what they say\n(Let me hold you. Let me hold you)\nEvery single day\n(Let me hold you. Let me hold you)\nIn a religious type of way\n(Let me hold you. Let me hold you)\nLet me touch you, let me hold ya, something"}]}