{"songs": [{"lyrics": "[Produced by DJ Premier]\n\n[Intro]\nUh-huh, I've did it again niggas\nFucked up, right? Ha, I know\nI know what y'all niggas asking yourself\nIs he gon' ever fall off?\nNo...\n\n[Verse 1]\nA lot of speculation\nOn the monies I've made, honies I've slayed\nHow is he for real? Is that nigga really paid?\nHustlers I've met or, dealt with direct\nIs it true he stayed in beef and slept with a TEC?\nWhat's the position you hold?\nCan you really match a triple platinum artist buck by buck\nBut only your single going gold?\nIf Roc-A-Fella should fold, and you're left out in the cold\nIs it back to charging motherfuckers 11 for a O?\nFor the millionth time asking me questions like Wendy Williams\nHarassing me, then get upset when I catch feelings\nCan I get a minute to breathe? And in that minute you leave\nWhile I'm looking at my Rol', ice spinning on my sleeve\nUgh! Nice watch, do you really have a spot?\nLike you said in \"Friend or Foe,\" and if so, what block?\nWhat you doin' in L.A., with Filipinos and Eses\nLatinos in Chevys, down by Pico with Frederico\nI answer all y'all questions but then y'all got to go\nNow the question I ask you is, \"How bad you wanna know?\"\nBLAOW!\n\n[Hook]\n(A million) Uh-huh uh uh uh uh-huh uh-huh\n(A million) How we do, what?\n(A million) Uh-huh uh uh uh uh-huh uh-huh\n(A million) How we do? Ugh!\n\n[Verse 2]\n'98, Preemo remix, and ain't nothing different\nI don't know what the hell, niggas been sniffing\nJigga still dipping, chrome on the whips and\nFour days out the week, find me in the kitchen\nStill in the game, nigga, hooked like glue\nPapi gave me one pie, but it cook like two\nI'm a crook like you\nCats around my way was buying brand new whips and shit\nWhat could I do? Knowin I'm supposed to style\nI'm the hustler's poster child, rock lizards and cro-codile\nLive ironic and what-not\nPut all that ice on the face of a watch just to make it hot\nNow you see me on them stages, rocks in the air\nLooking like blue lasers, never fugaz-es\nAct courageous, I smack 'em with the two aces\nMAC double one, nigga, I'm troublesome\nAll I got for chicks hard dick and bubble gum\nFlip bricks like Fred, Barney Rubble and them\nIt's the Roc-A-Fella clique, what's fucking with them?\nNot a damn thang nigga, we doing our damn thing\nBLAOW!!!\n\n[Hook: Jay-Z]\n(A million) Uh-huh uh uh uh uh-huh uh-huh\n(A million) How we do, come on\n(A million)\nSounds so beautiful, don't you agree, ladies and gentlemen?\n\n[Verse 3]\nHa! Well they call me Jay-Hova 'cause the flow is religious\nAnd ever since I was 16, I was holding digits\nI'm seeing this industry clearer\nAs if I had coke in the trunk and cops in the rear mirror\nI slow-flows y'all to death\nSo y'all hoes know who's best—Jigga!\nThe flow be Ay, Bendito\nFor the mamis I hable español, poquito\nOh Este, I got timing like a segue\nNow holla back, baby!\nUh-huh-huh, Jay-Z, you motherfucking right\nIn the darkest nights let off my gun for light\nTo guide y'all through, show you how it's done\nI'm The Question and The Answer like Iverson\nJets be private ones, no gate to lift\nSo when I take flight, it's from Hangar 6\nBang with this, wake up with one in your brain\nAnd the cocaine flow's straight numbing your pain\nThis ain't your speed, young mayne, run in your lane\nSo I can come through doing a hundred and change\nI put one in your frame—picture that\nWho's running the game? Let's get to that\nI guess we one and the same\nA million and one... once again\nNovacane flow, ho, you ain't know\nLike a baller in an Impala, Jigga remain low\nThen I pop up, and tear your block u\nSnd kick off like soccer\nIn a Range Rove, twist hoes like ankles\n'Til the next time, nigga\nI hit y'all with a million more", "title": "A Million and One Questions (Remix)", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}