{"artist": "Pouya", "songs": [{"album": null, "title": "Ice Cream & Birthday Cake", "image": "https://images.genius.com/4784526572794dd7f23de933cb5e5b8b.500x500x1.jpg", "lyrics": "[Verse 1: Shakewell]\nThe fuck is yo problem?\nI'm mobbing on suckas I'm sipping on Sake I'm puffing on ganja\nI shout out the plug then he prolly do life so I do not say nada\nMy homies is hungry they killing for food turn you into asada\nI'll take your bitch and the products\nWashing my head while I chill in a sauna\nNo Princess Leia she bow like kotona grab my katana\nFuck boy you don't really wanna\nKeep it tucked I ain't flauntin\nStep up and the pistol bombin\nNever wake up in the morning\nMajin Buu, the purple flowing\nNever sleeping but I'm yawning\nKeep it german if you tonin\nYou don't even really want it\n\n[Verse 2: Pouya]\nDumb kids wil'ing outside\nPill popping smoking drugs in the lot\nGun by the lap\nHoes on the sack when I pull up in the back of the Lac get back\nLike luda said in the red light district\n\"Hoe miss me with that fuck shit\"\nI pull out the dick and bust one into yo' stomach!\nI ride with my homies\nYou never could clone me\nThe one and the only\nHoes be sucking and fucking\nBut really they don't even know me\nGive me a Glock and a rock in my sock and I'll be okay\nI been wil'ing on the street getting money all day\n(getting money all day, getting money all day)\n\n[Verse 3: Pouya]\nYuh\nStuck in my mind\nLife, just wasting my time\nPacking the 9 in case someone wanna get to mine\nCan't find another man like me\nPull up [?] Nikes\nI been feeling like a million bucks\nHundred bitches on my fucking nuts\nPull up in the Mercedes truck\n\n[Verse 4: Shakewell]\nHoly water dripping down the sink\nTrying to bless me but it burn the skin\nAnd when I pull in pull out she gon' eat the skeet\nJust know its triple 6 when I rep my team\nAnd never take it personal if I fuck yo' chick\nAnd everyday I'm livin repping for my clique\nShe fucked on the bus but she still want the dick\nThank God for these hoes\nBut it's still fuck a bitch", "year": "2016-02-06"}]}