{"artist": "Watsky", "songs": [{"year": "2013-03-12", "lyrics": "[Verse 1]\nIt’s hard to be living\nYou gotta play the cards you were given\nYou think it’s simple but it goddamn isn’t\nIt’s tougher now than breaking out of Shawshank prison\nAnd as you’re hittin your prime\nPeople say you been committing a crime\nBut I won’t quit till I’m home\nI’ll chip the limestone a bit at a time\nWait! I’m a pale ass pale middle-class straight white male\nI won’t have an alibi the day I fail\nCause if I ever went to jail, Mom would pay my bail\nIn a [boom-boom] heartbeat\nMom and Dad have given me a lot more than a pat on the back\nAnd I gotta thank ‘em for loving me\nFrom the moment I was strapped in a Volvo car seat\nWhen I needed a pep talk\nI couldn’t remember to wreck shop\nWriter’s block, staring at my laptop desktop\nOr sleeping in my rental in a turnpike rest stop\nShit in storage, living from a suitcase\nThinking “this is how a silver spoon tastes?”\nCause you can make a dream possible\nBut it’ll never be easy, no matter what you chase\nIf you wanna poke fun then do so\nI’ll do it for you, it’s no crime\nI’m like if the dude from Juno grew a Jewfro and liked to rhyme [OOoooooohhh!!!]\nSo tell me that I’m not a rapper\nTell Rudolph he can’t pull sleighs\nTell Pluto it’s not a planet\nAnd he’ll probably keep spinning in the same old way\nOn and on, every day\nRight around the sun, wanna feel the rays\nYou do it ‘cause you love it like nothing else in the universe\nAnd fuck it, it’s embedded in your DNA\n\n[Outro Skit]\nBoom! It was really loud. I mean, seriously loud. Boom! Boom! Boom!\nWere you scared?\nI'm probably like... I'm probably like the one who was getting scared like... Ten times... more often... Then anybody else I know!\nI think people that say that they're not scared are lying about not being scared\nYeah... So is people saying that they're not ticklish", "image": "https://images.genius.com/0ed2171f9fa650ff0ccb5bcecb02d6f3.1000x1000x1.jpg", "album": "Cardboard Castles", "title": "Fireworks"}]}