{"artist": "Benzino", "songs": [{"lyrics": "(feat. Bobby Brown, Prodigy)\n\n[Prodigy talking]\nAiyyo, you know what I'm saying, yeah\nFuck you bitch-ass niggas you know what I'm saying\nStraight like that from the bottom of my heart\nMan this is silly\nI ain't got nothing but slugs for you bitch-ass niggas, know what I mean?\nFuck all y'all niggas, straight like that\nWhat up\n\n[Hook 2x: Bobby Brown (Benzino)]\nDon't start with me (Benzino, B. Brown, Hangmen 3)\nYou don't want to see that side of me\nI don't really care how hard ya be\nI just know you don't want a war with me\nSo don't fuck with me\n\n[Prodigy]\nAiyyo, it's war this night and over run up on ya few\nBoss niggas dump bullets and get rid of that crew\nYou gotta bang niggas out\nFuck that shit is serious\nGive it to 'em niggas, kid show them how real it is\nThese punk motherfuckers get their head pushed, leds bust\nGuns on their friends and they feds dunn yeah dunn\nVenalate niggas hear 'em out\nWear niggas out\nGet them before they get you\nOpen up your eyes, true\nLook alive, dunn it's not a game\nIt's not thing for you to get body\nThat's why we don't play\nSo where the bags for the fuck back\nBefore I squeeze more shots and murder more bastards\n\n[Hook 2x: Bobby Brown]\nDon't start with me\nYou don't want to see that side of me\nI don't really care how hard ya be\nI just know you don't want a war with me\nSo don't fuck with me\n\n[Benzino]\nYo, swing that, mince that, double bogie, hit that\nBig gat, tiger money, holdin one, get that\nForty-cal go and get your burns, spit that\nBring beef where your motherfucking cribs at\nShove knives in your chest where your ribs at\nGet money with my Hangmen, split that\nCome thick when we show those guns\nDoing 1-6-0 on the Autobahn\nRide all night drink cris til dawn\nTonight we don't care, right from wrong\nAnybody wanna kick the same old song\nBitch-ass niggas won't last too long, motherfucker\n\n[Hook 2x: Bobby Brown]\nDon't start with me\nYou don't want to see that side of me\nI don't really care how hard ya be\nI just know you don't want a war with me\nSo don't fuck with me\n\n[Bobby Brown]\nMeet you overnight\nRest now that's tomorrow\nMy projects thorough\nTribes with Made Men, now you know\nNo matter what happened in the barium rocks\nStill remain with my pistol in my palm cocked\nGod damn, country, all shit is sick\nCause shit ain't but a bag full of fucking tricks\nAddition and money in my pocket\nSo I'm a dip into my bag and grab my motherfucking clip\nThen I'm a break out the door cause I'm mad like fuck\nAnd I'm pissed off and like get your ass and stick you up\nNo hold barred and it's time to get paid over\nI'm broke, ain't nuttin funny I need money\n\n[Bobby Brown & Benzino (Bobby Brown)]\nFuckers want to try and change the game (I did that)\nTry throw dirt on my name (You got that)\nStorm them for their fortune and fame (You want that)\nTwenty karats on my neck, wrist and brain (I flaunt that)\n\n[Hook 6x: Bobby Brown]\nDon't start with me\nYou don't want to see that side of me\nI don't really care how hard ya be\nI just know you don't want a war with me\nSo don't fuck with me", "image": "https://s3.amazonaws.com/rapgenius/91e679c8210dab2c79d0611be49e28ef.jpg", "year": null, "title": "No Part Of Us (Feat. Bobby Brown)", "album": null}]}