{"songs": [{"title": "Chain Smokin", "lyrics": "[Hook]\nAyo excuse me as I kiss tha skyyy\n(Kiss tha skyyy)\nIt's time for me to roll up, I gotta stay hiighhh\nI'm juss chain smokin joints\n(Chain smokin joints x4)\nAyo excuse me as I kiss tha skyyy\n(Kiss tha skyyy)\nIt's time for me to roll up, I gotta stay high\nI'm chain smokin hella joints gettin extra frriiiieeedddd (Extra frriiiieeedddd)\n(Chain smokin joints x4)\n\n\n[Verse 1]\nWhere tha fuck are my zig-zag's and my lighter? So I can roll it then set it on fire\nSmoke it up, Got another rollin like tires, I\nBe tha consumer nigga, Not thee supplier\nNow which one of y'all is tryna smoke ooouuuttttt?\nDon't even bother comin if you ain't plan on bringin O's ooouuuttttt\nAnd you can miss me wit that bammer\nCause I be bakin OG in tha mornin in my RL pajamas\nI be rockin (Rockin'), Rollin' (Rollin')\nRollin and I'm rockin\nYo this potent got me coughin dish it off like Stockton, John\nSuper fresh yet I don't shop at tha mall\nI be tha bomb but chu? You juss ain't poppin at all\nYou see I smoke good cause it goes good wit tha flows nigga\nI'm cold nigga\nYou see my breath when I talk\nIf I ain't on tha road conveyin this Hip-Hop art?\nFind me heavily in tha cut wit some joints more than ready to spark\n\nReady to spark\n\nIn tha cut more than ready to spark\n\nI'm ready to spark...Yeah\n\n\n[Hook]\nAyo excuse me as I kiss tha skyyy\n(Kiss tha skyyy)\nIt's time for me to roll up, I gotta stay hiighhh\nI'm juss chain smokin joints\n(Chain smokin joints x4)\nAyo excuse me as I kiss tha skyyy\n(Kiss tha skyyy)\nIt's time for me to roll up, I gotta stay high\nI'm chain smokin hella joints gettin extra frriiiieeedddd (Extra frriiiieeedddd)\n(Chain smokin joints x4)\n\n\n[Verse 2]\nAyo some say life is a, BITCH\nSo find me rollin up a joint to get her high as, SHIT\nAnd I'm, Fly as shit, Peep tha steelo\nOG Starter flauntin, Joint burnin as I guzzle Bambino in tha cut\nWho tha nigga wit tha flow? It be I\nSoon as I open my eyes yo I gotta get high and elevate to tha skizzyyy\nI be chillin in tha mist word to my third izzeyee\nAnd this shit right here's tha joint like EPMD\nTell hoes it's head 1st like a DDT\nOpen up wide and insert it like a DVD\nSee these freaks be on me like I'm CP3\nSo I juss, Hit em and run\nRight, Back to tha funds\nThem ΒΛΚΞΓ$CLUB niggas stay second to none\nI hope you got ya boards ready cause tha wave has begun\nTO's, Where tha fuck a nigga from and I blaze like tha sun\n\nBlaze like tha sun\n\nAyo I blaze like tha sun\n\nBlaze like tha sun...Yeah\n\n\n[Hook]\nAyo excuse me as I kiss tha skyyy\n(Kiss tha skyyy)\nIt's time for me to roll up, I gotta stay hiighhh\nI'm juss chain smokin joints\n(Chain smokin joints x4)\nAyo excuse me as I kiss tha skyyy\n(Kiss tha skyyy)\nIt's time for me to roll up, I gotta stay high\nI'm chain smokin hella joints gettin extra frriiiieeedddd (Extra frriiiieeedddd)\n(Chain smokin joints x4)", "image": "https://assets.genius.com/images/default_cover_image.png?1570807223", "album": "NorthernPlayalisticGetHighMuzik", "year": "2013-11-27"}], "artist": "The 6th Letter"}