{"songs": [{"title": "Disappeared", "image": "https://images.genius.com/14da381769975ec5c53bf1de0edb7baa.500x500x1.jpg", "lyrics": "[Hook]\nThey disappeared, no COD\nDon't trust nobody, this shit is weird\nThis shit is real, I have to own it\nAt any moment, they could be on me\nThey have to die, at least in my eyes\nI'm so surprised, I open my eyes\nI seen it all, they think I ball\nI'll never fall, not as far as y'all\n\n[Verse 1]\nThem bodies gon' disappear\nI'mma rip 'em in half, gettin' the last word in\nI'mma sit in the back of the car at her job\nWhen she get in the car, I'mma attack her jaw\nI'mma cut up the face and put on her face and\nWalk out the house with a machete like Jason\nKill her whole family, botox facelift\nNobody, no case, no body, no face\nBarbecue, cocaine, I'mma rape your taste\nI mean, I'mma rape your mouth, bitch! I'mma take guts out\nAnd I'mma put 'em in the oven, yeah, I'mma eat that, love it\nAnd won't you close your legs? I'mma hold up the plate like, \"Bitch, you late\"\n\n[Hook]\nThey disappeared, no COD\nDon't trust nobody, this shit is weird\nThis shit is real, I have to own it\nAt any moment, they could be on me\nThey have to die, at least in my eyes\nI'm so surprised, I open my eyes\nI seen it all, they think I ball\nI'll never fall, not as far as y'all\n\n[Verse 2]\nWe in your neighborhood like speed bumps, nigga\nAnd I got that bloody face, sippin' on that Seagrams, nigga\nAnd you want that season, nigga, where is that season, nigga?\nI'm a misfit and I spit shit like I just got the fever, nigga\nAnd I stay lit like Michael Irvin at receiver, nigga\nPlus, I smoke like a chimney, enemies get ate\nFuck all the hate you were sending me, we straight\nEven if these niggas steadily leaving, nigga\nThese niggas just teething, nigga\nThey don't wanna get in the ring with Ali\nI might be leavin' 'em bleedin', no I.D\nBody chopped up, I'm leavin' in my keys\nNigga, I hack up yo' bitch, what's up?\n\n[Hook]\nThey disappeared, no COD\nDon't trust nobody, this shit is weird\nThis shit is real, I have to own it\nAt any moment, they could be on me\nThey have to die, at least in my eyes\nI'm so surprised, I open my eyes\nI seen it all, they think I ball\nI'll never fall, not as far as y'all", "year": "2013-02-05", "album": "Mannibalector"}], "artist": "Brotha Lynch Hung"}