{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/acc348ccdf6bd18c7aee7ae7c6c3d865.1000x1000x1.png", "year": "2014-11-24", "album": "SHADYXV", "lyrics": "[Intro]\nThese donuts are delicious... son of a bitch! We got a 10-94 on Hines Road, requesting backup. Repeat, 10-94 on Hines Road heading southbound. I'm in pursuit!\n\n[Verse 1]\nPick up, pick up, daddy's in the pickup\nGot so much bounce the kick drum give me the hiccups\nYou don't want it with me, sucker, just look up\nBeer flyin' in this mothafucka like bird shit\nRan these Mickey Thompsons up on the curb, bitch\nCrook as a picture on Sunday\nMy maniac Slumerican squad mount up around your Hyundai\nChevy's up, we got low lives and bow ties\nUp shit's creek, I'll take you for a boat ride\nStick his head in the water, now let him flap his lips\nMotormouth, make a wave, yeah, Roll Tide\nYou're playin' golf in lightning? So am I\nDressed in a tin man suit\nDrinkin' a tin can too, that is 110 proof, uh\nMan if I only had a heart for you bitches\nI'd get down on my knees and help you dig them ditches\nBut mama only raised Hell\nSo when you're done diggin' that ditch, bitch, bury yourself, boaw\nPass me that Colt .45\nI'm partyin' 'til my fuckin' throat sore and dry\n\n[Pre-Chorus]\nI'm goin' down\n\n[Chorus]\nAw, man—you gotta love it\nI'm on my way\nHey, mama, all around the town they're sayin'\n\"He's goin' down, Lord, have mercy\"\nI'm country-rich, no budget\nGot to get paid\nHey, daddy, all around the town they're sayin'\n\"He's goin' down, Lord, have mercy\"\n\n[Verse 2]\nUh, You drivin' drunk, better lift your seat up\nCause cops pull us over just to fuckin' meet us\nCause Marshall's a Rap God, damn right\nWell, then I guess that makes me Jesus\nSo turn this water to whiskey\nWatch the dirty south go from dirty to filthy\nHigh class only means stoned in school\nJoints rolled up bigger than pony stool\nSmoke, stains on the roof of the old Regal's brown\nSo what I got spokes on this bitch, and?\nThe lift kicks like climbin' into a spaceship\nUFO's, unidentified flyin' Oldsmobiles\nAnd mobile homes, amen\nI can still smell the kerosene leakin'\nI should've seen the signs, I was blowin' up\nEither in a trailer home or a pickup\nHey, Bubba, your baby boy is in big trouble\nI fuckin' ran through a briar patch and got cut up\nNow I'm wide open in front of the whole town\nI bled for the game, I guess it's obvious now\nI'm goin' down now, he told me wear it with pride\nYou wanna take the hard road you gotta cherish the ride\nMost mothafuckers won't jump to embarrass the fly\nCan't build a legacy up, then let it perish and die\n\n[Pre-Chorus]\nI'm goin' down\n\n[Chorus]\nAw, man, you gotta love it\nI'm on my way\nHey, mama, all around the town they're sayin'\n\"He's goin' down, Lord, have mercy\"\nI'm country-rich, no budget\nGot to get paid\nHey, daddy, all around the town they're sayin'\n\"He's goin' down, Lord, have mercy\"\nAw, man—you gotta love it\nI'm on my way\nHey, mama, all around the town they're sayin'\n\"He's goin' down, Lord, have mercy\"", "title": "Down"}]}