{"songs": [{"title": "Drippin", "image": "https://images.genius.com/81cb4f78909a1b4113a8306f79d75d7e.750x750x1.jpg", "year": "2018-03-09", "album": "The Wolf of Grape Street", "lyrics": "[Intro]\nHow does it feel to be me?\nWolf, yeah, yeah yeah, ayy, yeah yeah\nBeat Boy taught me\n\n[Pre-Chorus]\nHow does it feel to be me?\nHow does it feel to be somethin' that came from the streets?\nReally was sellin' them keys, this is the way that we eat, 03\nEcstasy, percocet, kush and the powder\nGeekin', it really don't matter\nI just came down [?] fightin' a lot, this is what made me a savage\n\n[Chorus]\nI, been, drippin', inside, kitchen\nI, been, drippin', inside, kitchen\nI been drippin', ooh, I been drippin', ooh\nInside the kitchen, whoa\nI been drippin', I been drippin', baby 03\n\n[Verse]\nThis the way the wolf sound when he off an ecstasy\nI need all my kush loud, baby please don't message me\nSend the package like a G-mail, made a couple G's\nI just left the section, rappers' daughters want to mess with me\nShe want to have sex with me, Greedy so my baddie sweet\nAll my bitches street, she need a nigga with some felonies\nHater never met me, it ain't nothin' that they tellin' me\nI was in the mansion lookin' handsome watchin' Ellen D\nGenerous, but I never give her shit, I don't ever give her shit\nLil DK made me militant, gotta keep quiet when you killin' shit\n03, text me, I'm feelin' it\nOh-oh-oh-oh, oh-oh-oh-oh, oh-oh-oh\n\n[Pre-Chorus]\nHow does it feel to be me?\nHow does it feel to be somethin' that come from the streets?\nReally was sellin' them keys, this is the way that we eat, 03\nEcstasy, percocet, kush and the powder, baby it really don't matter\nGeekin', it really don't matter, geekin', it really don't matter\n\n[Outro]\nCall me Greedy, eat it off a platter, ah\nSkinny nigga but my pockets fatter, ah, ah\nSay hi 'til I'm done, say and I'm done\nHow does it feel to be me? how does it feel to be me?\nOnly one 03, only one 03, how does it feel to be me?\nOoh, I was in jail now I'm free\nFreestylin', he's violent, he's talented\nHow does it feel to be me?"}], "artist": "03 Greedo"}