{"artist": "Canibus", "songs": [{"title": "Falster Ego", "album": "The Brainstream EP", "year": null, "image": "https://images.genius.com/adcb0609ab97cadcb1d698ababd16a9d.350x337x1.jpg", "lyrics": "[Canibus as \"Bis\"] Yo Rip, come here man, lemme talk to you for a second...\n[Rip] What the fuck you want to talk about nigga?\n[Bis] Why You screaming man?\n[Rip] I'm The Illest! I'm the illest...\n[Bis] Yo Relax... put that down man\n[Rip] Yo don't tell me to relax I'll beat your skinny little ass\n[Bis] Yo What the fuck is wrong with you?\n[Rip] Fuck You!\n\n[Canibus as \"Rip\"]\nYou fuckin' hate me, you fuckin locked me in the basement\nAnd you still want me to protect you, it doesn't make sense\nCanibitch, I supported you like a weight bench\nWithout me your defenceless, you betta' face it\nYou ain't show me love when you was at ya' apex\nGettin' paychecks, up at the radio with DMX and Flex\nCatchin' wreck while Noriega was catchin' his breath\nI had to keep the situation in check\nLook at the varicose veins in my neck, Germaine is the best\nThe industry fucked you I'm just payin'em back\nWhat's the matter w/ slayin' these Jackers, that's all I been doin\nBesides talkin' shit I ain't done nuthin' to'em\nThey just mad cause when I see'em I don't run up to'em\nBetween me and you yo-know I'll run right thru'em\n\n[Bis]\nCalm Down!\n\n[Rip]\nWho you tellin' to calm down nigga I'm a Ripper remember\nI told you not to do \"Gone Till November\"\nBut you wouldn't listen, I always had ya' best interests in mind\nI wrote all ya' best lyrical lines\nIf it wasn't for me you'd be writin' pitiful rhymes\nOn the stage if you was tired I would spit'em sometimes\nNobody knew you bit off my rhymes\nI would just be quiet, stand to the side and let the shit ride\nBut I'm gettin' tired of havin' to remind you Bis\nIf it wasn't for me nobody would've signed you Bis...\n\n[Canibus as \"Germaine\"]\nC'mon Rip? You a lyin' ass bitch and you know it\nGroup Home was part my company I co-owned it\nIf there's one thing I learned in showbiz, stay focused\nAnd don't quit. Rip, why you talkin 'bout old shit?\n\n[Rip]\nGermaine, you fuckin' water brain, don't you understand?\nFuck the mainstream, you should just call out names\nThe industry's all about game...\nI shit on 'em all the same and leave spit stains on they brain\nLike liquid chocolate spillin' all over ya' new white trainers\nInsane is an understatement, I'm Satan\nCanibus is a Mason, I don't know what the fuck Germaine is\nI just know that both ya'll are trying my patience\nI don't give a fuck about a beat I been rhymin' for ages\nRippers are dangerous, and all jackers are afraid of us\nYou wanna' face me Bis? Kick a rhyme!\n\n[Bis]\nNo, That's ridiculous...\n\n[Rip]\nAiiight then, listen to mine...\nI'll jump into costume, impromptu, just to rob you\nPut the nozzle to ya' eyeball and tell you what not to do\nRip your tonsils out thru ya' nostrils\nBury you next to shark fossils, make it impossible to find you\nDepths that Jacque Cousteau himself wouldn't dare to dive to\nWith goggles, oxygen bottles and Doppler effect modules\nLock you in a time capsule and smash the console\nShit on you in reverse suck you into a brown hole\nSuck the power outta' ya' soul\nYa' nuthin but a coward in a cold freezer with an hour to go\nWatchin' my casio stopwatch countin it slow\nLike drug lords checkin to see if it's talcum or coke\nI could kill you by drownin the globe\nOr I could just spit inside of a hole and put an ounce in ya' throat\nIn battles I'm a thousand and oh, I silenced the Pope\nDo you know how many rhymes I've economically grossed?\nNo? I thought so... Neither do I\nIt's a dick between ya' mothers thighs divided by Pi\nI'm the sickest linguistically illicit lyrical misfit in the business\nAnd possibly in existence, what's your consensus?\nStudied my own syntax statistics since '96 wit CPA certified assistants\nI've made the decision that my standards are above precision\nThe only thing I could honestly say I love more than women are dope writtens\nIf it ain't dope then don't spit it\nDon't be sensitive and get on the defensive just practice ya' penmanship\nIf you can't spit at high temperatures then just quit\nBe careful of the tongue it tends to bend to the left\nAccording to the manufacturers specs, you'll make a mess\nRupture the blood vessels in ya' neck fuckin' with Rip\nGot millions of blueprints on zip disks\nStock versions of sick verses that come with conversions kits\nWith a course every Thursday that teaches you how to burst like Rip\nYou never experienced work like this, nigga welcome to the serpentine world where I twist\nThe world where that I Rip, the world that I Fixed, the world where I live\n\n[Bis]\nOk Rip, you made your point, I can't out rap you\nYou said you was the illest, I would never doubt that too\nAt the moment of truth I let you design the tattoos\nYou are the illest alive, that's a fact that you've proved\nIt's just a couple rappers that don't want it to happen for you\nRaggin' on you like battlin' is all you can do\nYou didn't sell enough units to be honest with you\nNobody knows the truth you got talent out the gazoo\nWhen niggas first heard of you it was like a Man On The Moon\nYou got dissed by a legend but you damaged him too\nSo what if the ladies think he's more handsome than you?\nWhat happens if the rumors about being a faggot are true?\nLook what it's runnin' into, I don't feel like havin' this discussion with you\nI'm tired of fuckin' with you, niggas in the game don't wanna' do nuthin' with you\nBussin' with you, goin' one on one with who?\nThey wanna get rid of you, ya' shit is too lyrical\nHeadhunters out to get you, that's why I have to protect you\nI wouldn't disrespect you, as another intellectual\nWithout you I'm unsuccessful, God bless you\nWhat makes you think I left you or why I'd ever be tempted to?\nEver since the 3rd album I been mentioning you\nI got your name on my arm I'm representin' you\nYou're Rip The Jacker - I would never question you\nI respect your opinion as a professional nigga'\nI just want you to listen to what I'm tellin' you\nWhat happened between L and you - Forget it!\nPeople know you won the battle they won't give you the credit\nA lot o' people don't wanna' admit it\nBut I consider it a real privilege to bear witness to ya' lyrics\nAnd be involved with sharing the merits, I'm forever indebted\nI just need you to chill for a second, so I can send a positive message\nLike 2Pac before he left us, the author or the work ethic Genesis\nHas inspired me to write the Exobus scripts as a constant reminder not to forget Bis\nBut I've reached a precipice, remember Rip\nYou can't rhyme forever there's always a ripper with better shit\nI keep you out the public eye for a reason\nYou're a commodity Rip ain't that how you wanna' keep it?\nI keep ya' whereabouts secret\nI bring bitches to the crib every weekend, so why is you beefin'?\n\n[Rip]\nAyo Stop patronizing me, you despise me\nAll you wanna' do is steal rhymes from me\nYou constantly keep me behind walls of concrete\nLock me in the basement like a fuckin zombie\nIf I was priority you would acknowledge me\nYou ain't shit neither you ain't got no college degree\nYou can't rhyme without me, stop smilin at me\nGimmie the keys to the garage I need to borrow the Jeep...\nGet the fuck out my face nigga!"}]}