{"artist": "Casey Veggies", "songs": [{"title": "DTA", "album": "Sleeping in Class", "year": "2011-09-20", "image": "https://images.genius.com/aaf0da7a07e05d17ff3c822d7769bd09.500x500x1.jpg", "lyrics": "[Verse 1: Casey]\nMe and my niggas was in the cut like rubbin' alcohol\nShaded up with a girl or two, not a worry at all\nI'm with them niggas in LA, that you know about, know about, from your girl\nFrom the word of mouth, I'm the only name that come out her mouth\nTo the South, Texas state, yeah that's where my family at\nDeep up in the country homie where people be burnin' trash\nRollin' by, feelin' hella good, I been up in Inglewood\nSince Paul Pierce went to Inglewood went from hood to hood\nLove it there, taught me how to be a man\nHear them dudes rappin' 'bout it, but really they don't understand\nI come from a little somethin' called the streets, taught me how to be a man\nHear them dudes rappin' 'bout it, but really they don't understand\nUnderstand?\n\n[Hook]\nGirls come around, man they been tryna get it out me\nNiggas in my face, they don't know nothin' about me\nMost these niggas fake, I say loud I say it proudly\nWe got money to make, and we don't trust anybody, anybody\nSaid we don't trust anybody, anybody\n\n[Verse 2: Casey]\nI said high school, 11th grade, CDs in my back pack\nWho ever needed that, they got it, next day they come back, they on it\nMost these chickens actin' on it, lovin' how I'm tappin' on it\nNiggas hit me up, yeah they lovin' how I'm rappin' on it\nSaid I will attack a track, and this gone need a rappin' lawyer\nCharged before assault, look at all this shit I bought\nI'm always tryna floss, and when I get I'mma do it right\nStraight shinin' on them lames, from the mornin' to the night\nFrom the mornin' to the night, I take the air, takin' flight\nYeah that's that LA shit, young guys on they playlist\nJordans and the gold chain, Illmatic bumpin'\nNas did it first and now I'm 'bout to tell 'em somethin'\nThey all up in my face when I walk up in the function\nThem girls wasn't dancin', but now they all jumpin'\nI said Jordans and the gold chain, Illmatic bumpin'\nNas did it first and now I'm 'bout to tell 'em somethin', Veggies\n\n[Hook]\n\n[Verse 3: Tyler]\nHey girl, what's your name? Do you wanna suck a dick?\nWho am I? Wolf Haley, yeah I'm known for punchin' bitches\nIn the fuckin' brain, do wanna give me some?\nNo you don't? Why you won't? Oh, you're a fuckin' nun\nDidn't mean to offend, oh, you're a lesbian\nSo I'm guessin' you don't really like to put your trust in men?\nWho do I trust? Um, heroine addicts and\nTeenage Mutant Ninja Turtles, yeah I can count on them\nWho is him? Signed proof in a suit\nPreme' six panel cap with the green brim\nIt's box logo this, box logo that\nUsually a caucausian, big swallow on the cack, oh snap\nI am, spittin' like I got chipped tooth, pop some Prozac\nGolf Wang nigga, know that or that can\nTurn into some neck, gettin' snapped up properly\nTyler Creator and Casey Veggies, fuck broccoli\n\n[Outro]\nYeah, DTA in this bitch\nI don't trust nobody nigga\nI mean, you can trust these niggas but\nAt the end, they fuckin' you, no homo\nSwag (Casey Veggies nigga\nTyler the Creator, from '07 and to beyond)"}]}