{"artist": "G Herbo", "songs": [{"title": "Izzo Freestyle", "album": null, "year": "2016-02-17", "image": "https://images.genius.com/4734c34786478934ac98eb9e3c66caf3.595x600x1.png", "lyrics": "[Intro]\nAye, It's G Herbo\nYou already know man\nY'all gotta name me one of the greatest after this one, look\n\n[Verse]\nH to the E-R-B-O remember me tho'\nUsed to look at the P'O's. Run down Essex with Vito\nNow I'm trio, 3 tapes working on 3 mo'\nIt's getting easy. Bully rap niggas like Deebo\nThey love to copy, swagger jock me, taking my steelo\nAnd they flows got my stamp all on it like Vevo\nFucking they hoes and they know that's why they hate me fo'\nCuss her, yell her, beat her don't say nothing to me tho'\nBut back to me tho', just tryna be all I can be tho'\nStay sucker free tho'\nShort temper, Danny Devito\nThat's why I'm coolin'. Stopped leaning, rolling the B tho'\nBackwood fever. Posto is my B.O\nThat's body odor for the slow ones, I'm hardly sober\nI miss leaning so much I been thinking about starting over\nAnd I'm from the struggle. Tho' I got dough it's hardly over\nGotta keep the toaster. Niggas think they can fuck me over\nCatch me unloaded, pumped open, slumped over\nEven though I miss them, ain't time to link with the fallen soldiers\nKillers in the county. No limit crazy already know it\nBooks loaded so if I tell them, send you to Strogers\nH to the Izz-O V to the Izz-A. That's who I feel like\nUsed to freestyle right on the Izz-eight\nA verse 10k but I might take 8 if you strizzaight\nBeen that nigga way before I played with this cizzake\nPussy I slizzay, never ever been on a dizzate\nWas in the trizzap sliding clizzips right in the kizzay\nStreet nigga. Want war? I'm with it bitch let them sprizzay\nReady for whatever got mom and sis out the wizzay\n\n[Hook]\nH to the E-R, B to the Izz-O\nNiggas knizzo. Pull up anywhere for a shizzow\nH to the E-R, B to the Izz-O\nNo they can't stand us. No Limit run them bands up\nH to the E-R, B to the Izz-O\nYeah this the real me why everybody feel me\nH to the E-R, B to the Izz-O\nI feel like Jigga. I'm that motherfuckin' nigga\n\n[Outro]\nYou already know it's G Herbo, man\nI had to do this, I ain't gon' lie I had to do this beat man\nI feel like this...Real rap real hip-hop shit\nI'm speaking my life on this, you know\nNiggas can't do this shit, man, you already know\nThat's how I show you I'm hottest man. Still grindin'\nStill on my shit, man. Doing my own thing, in my own lane\nThis next level shit right here, man. I don't know what the fuck I'm doing right now. Don't know if I'm working on an album or what\nIt's Big G Herbo"}]}