{"songs": [{"image": "https://images.genius.com/75a265916a97836aa5ab08c709a44211.1000x1000x1.jpg", "album": "PSYCHODRAMA", "title": "Psycho", "lyrics": "[Intro]\nTuesday, 23rd of January, 2018\nI'm here with David\nThis is our first session\nWe're just gonna talk about your background\nWhere you're from, any issues you've been dealing with\nSo, where should we start?\n\n[Verse]\nLook\nStop all the pain\nHow do you stop all the pain, huh?\nI used to hear a voice when I was praying\nBut nowadays, I don't even wanna be saved\nNah, fuck that, I don't wanna be saved\nI was born to be wild, I don't wanna be tamed\nTalent's in my blood and I don't wanna be vain\nBut if I'm a psycho, then I don't wanna be sane\nI used to dream of this shit when I was hopping on train\nSo, so bad, I used to want all the fame\nMy ex-girl want to shoot a cover for Vogue\nWhich is pretty ironic 'cause she's top of the range\nIf any one of you take a shot on a track\nMy niggas come back and put a shot in your frame\nEasy as the alphabet\nThree G's in the ring, call me Alvarez\nMy teacher used to say I need counseling\nCouldn't stop asking me, \"What do you feel?\"\nThere's so many old scars that they wanna reveal\nWe got off on the wrong foot 'cause I don't want him to heal, nah\nBut if you're looking for a psycho, you got one\nI thought I had a screw loose but I lost one\nNinety-nine problems, money, it is not one\nMy currency's Kenyan, that's in it for the long run, huh\nTears on a pillow\nBro, I shed so many tears on a pillow\nI used to tell my teachers that nobody gets it\nI don't know Clarke but I know that I'm a Kidult\n'Cause my mummy ain't been home, miss thinks I'm involved\nBlame my environment, it made me a sicko\nFurthermore, I should bring that bitch down to Streatham\nAnd then make her spend a day in a veil like a widow\nKiddo, we seen swords longer than a limo\nMy bros are blacksmiths like Jaden and Willow\nMan, there's weapons over here, we're reppin' over here\nWe're from the Southside but it's Streatham over here\nNo telling if you're selling, hold the wettin' over here\nGet him over here, who the fuck is checkin' over here?\nMost my niggas are the ones applying pressure over here\nFuck assault, I can get a nigga peppered over here, whoa\nWe wanted more, then some food on the strip or moving a brick\nMy niggas went to school with the rich and we were broke\nHiding crow in a Rubicon drink\nWhich is funny 'cause that's how we put food in the fridge\nSo, who am I?\nSomeone tryna live his best life\nI just wanna take a pretty woman for a test drive\nIf I bring her to my room and I press, I\nGuarantee she gonna see the force like an ex-wife\nPeople tell me I'm a little bit barmy\nFor my army, I need a bottle of Bacardi\nIf it's me and a pouch with my dargy\nShawty, you're seeing two stars in the party\nFuck what you heard\nI'm a top boy and I ain't giving man a turn\nI don't wanna know a pretty woman wanna flirt\nLearned you can judge a nigga by the women that he curves\nI love this game, I ain't lost focus\nI'm a hitmaker, if you haven't noticed\nI could be the rapper with the message like you're hoping\nBut what's the point in me being the best if no one knows it?\nBrother I'm a careful, humble, reckless, arrogant, extravagant\nNigga probably battlin' with manic depression\nMan, I think I'm going mad again\nIt's like I'm happy for a second then I'm sad again\nAnd to my fans, the reason I could get to this\nYou're my drug, the instrumental my therapist\nMan, I need some therapy\nMy girl saying that she'll never leave\nI'm scared she gonna find a better me\nDeeper insecurities, like\nWhat if I don't leave a legacy?\nMoney, why they check for me?\nMummy lost respect for me\nI wish we could be together but that ain't how life works\nI used to cry about my dad until my fucking eyes burnt\nNose running, you don't know nothing\nBefore I put a penny on the table, I provided for my family\nHeld my mother's hand through the agony, hey\nYou ever fall 'sleep 'cause you don't wanna be awake?\nIn a way, you're tired of the reality you face?\nIf you're thinking 'bout doing it\nSuicide doesn't stop the pain, you're only moving it\nLives that you're ruining\nThoughts of a world without you in it, hiding\nI ain't psycho but my life is", "year": "2019-03-09"}], "artist": "Dave"}