{"artist": "Beanie Sigel", "songs": [{"lyrics": "We run everything\nWe run the streets, the radio, and the club\nAll of the above\n\n[Beanie Sigel] + (R. Kelly)\nYes, yes! (All the above)\nUhh (ohh-oh-ohh, all the above)\nUhh, uhh (ohh-oh-ohh)\n\n[Beanie Sigel]\nYeah, Mr. Him F'Real is here\nCurbside by Atlanta, got a mill' out there\nBillionaires Boys Club, can't chill in here\nGold bottles of that bubb', y'all spillin beer\nThe boy only pour on that ace of spades\nForbes Magazine homes - soon to grace the page\nI pull 7 digits clean - soon as I grace the stage\nI done caught up with the paper; y'all chasin change\nMan I'm runnin up Broad Street, in and out of lanes\nWith the top down screamin out - you niggas know the sayin\nC'mon, you niggas know my name\nIt's the bully with the bucks, ain't a damn thing changed\n\n[Hook: R. Kelly] + (Beans)\nI'm hood, I'm street\nStill standin in the middle of the beat (Mac!)\nI'm a mack, I'm a thug\nI'm a pimp I does all the above\nOn the low I'm in the fastest whip\nAnd in the spot I'm with the baddest chick - all the above\nUp in the club got these niggas pissed\nWe got bottles and a pound of twist - all the above\nWE BUY OUT THE BAR~! And all night puff on cigars\nWe get so much love, and all of the above\n\n[Beanie Sigel]\nYeah, Mr. Beat The Case is back\nGot acquitted, stitch fitted in that gangster hat\nNow I'm back, sick with it with this gangster rap\nLet's get it, where my gangsters at? Make noise\nAnd I ain't never been no fraud, no nah that's not in my rapport\nNever fronted on my boys for no whore\nI ain't never been no bitch, nor never lied on my dick\nY'all niggas still dyin for these whores\nI ain't never been no - snitch, never been no - rat\nNever shot a nigga in his back\nI always put the drama to his face\nI ain't never pull my strap and ain't clap\nGot my case, did my time, now I'm BACK~!\n\n[Hook]\n\n[R. Kelly]\nUp in the club still poppin the Cris'\nStill back it up whenever I talk shit\nMan I'm worth about a billion but I'm still hood rich\nStill hoppin out the whip with a hot-ass chick\nStill rockin the chain, they still knowin my name\nIt's Kels, that's right bitch, I'm still in the game\nStill walk through the hood like I'm holdin that thang\nStill limp through the club like I'm holdin that cane\nIt's two fingers for a rock star, middle for a bitch\nCome in by self and leave out wit'cha chick\nBeanie Sigel got my back if we run into a snitch\nAnd Kels got his back if he ever need a hit\nFrom the tour, to the block\nWe keep risin, to the top\nFrom the club to the parking lot\nWe 'bout to show the haters what we go so LET'S GO!\n\n{*scratched: \"Sigel was the name that they gave me\"*}\n{*\"Allow me to reintroduce myself\" - Jay-Z*}\n\n[Beanie Sigel]\nIt's the Broad Street Bully I'm number one\nFive-oh said FREEZE when I had the gun\nBut I don't stop for the law, pushed the pedal to the floor\nRock star nigga, heavy metal on the drawer\nBecause my life is, how I mic this\nPolice wan' see my license\nRun my social, check my gov', search my glove\nKeep they hand on they toast when they approach this thug\nCause I'm a hoodlum, a monster, Bad Boy, a goodfella\nGangster and a thug - yes I'm all the above!\n\n[Hook]", "image": "https://images.genius.com/15679ae45abbb9430a1b4611e07fff74.636x640x1.jpg", "year": "2005-03-29", "title": "All of the Above", "album": "The Solution"}]}