{"songs": [{"image": "https://images.genius.com/5035cd900550d88d5595b3cb2f1eb442.800x800x1.jpg", "title": "Every Second Someone Dies", "album": "Brutality Part 1", "year": "2003-01-01", "lyrics": "[Hook (2x):]\nEvery second someone dies Someone just died\nAnother one's dead and again someone just died. Et Cetera\n[Verse one:]\nIf you step I'll bring death to your rep don't get drunk kid and talk shit\nYou can't walk I wouldn't hawk I put a fork in your throat I stalk\nAt midnight I had a sick fight this kids forehead was split open with gore drippin'\nI felt like I was trippin' awake for 48 hours\nLike a snake slithering your death is riveting\nGet kicked in the face with 20 feet\n10 of my peeps stompin' your grill 'till your flesh is embedded in the street\nMy death rap will get you cats pumped end up in the back of a trunk\nAnd your body is blended up into chunks\nMy mental is morbid I'm on some horror shit\nMy instrumental absorb it you'll get ripped off it\n\n[Hook (2x):]\nEvery second someone dies Someone just died\nAnother one's dead and again someone just died. Et Cetera\n\n[Verse two:]\nI acquired the habit of a rapper fired jabbin' and stabbin' the funeral pie you're\nA faggot\nYou should admire, you could expire\nCause if you fake the crooked or look in the trier I'll put you on fire\nChop your squat stomp your heart\nYou don't wanna get beat then repeat: \"EVERYTHING NECRO DROPS IS GOD\"!\nI've been sent to hell can't imagine a day\nWhen everything went well\nYou'll do as I wish or you'll be covered in my piss\nYour blood was discovered in a ditch, shakin' the rubber with your mother's tits\nFuck a hundred rhymes you wrote, my one verse will grab you by your throat\nGet the mediocracy joke\nOut of you kid there's no democracy when you're yoked\nStrangled with no cops in sight in the box you were poked\nI feel complete satisfaction\nBeating your ass until you're bleeding and gasping\nCause the words you were repeating were asking\nI'm competing with Manson for the throne of all sickos\nThe shit's cretin's anthem\n\n[Hook:]\nEvery second someone dies Someone just died\nAnother one's dead and again someone just died. Et Cetera. (2x)\n\nEt Cetera. [8X]\n\n[Loops on repeat and fades out:]\nEvery second someone dies..."}], "artist": "Necro"}