{"songs": [{"title": "We Made It Freestyle", "album": "Hump Days", "year": "2014-03-19", "image": "https://images.genius.com/75145c356837ef95317b2e1192749c65.1000x1000x1.jpg", "lyrics": "[Intro]\nLet's go, it's your boy LD, A.K.A. watch your girl pussy, homie\nY'all missed me, don't you? I stay with a boner, I'm typically hard\n\n[Verse]\nMy dickheads, I'm sorry, for keeping you waiting\nJust know that I miss you (I love y'all)\nBeen leaving you all out to dry in the dark\nLike a cum loaded tissue (that's reference to semen)\nI woke up this morning like fuck it, I got to address all the fans (I do)\nI need y'all to know I got plans (I do)\nI need y'all to know I been slaving away on my debut\nI'm taking a page out the playbook of Jay, Big and Dre, Nas and Ye\nIf you studying rap like I study it then\nYou would know what the fuck I been tryin' to say (classic)\nIt's harder to wait (it is)\nBut it's gotta be great (it do)\nAnd then when I drop that shit all y'all gonna be like \"Lil Dicky we made it!\" (we made it)\nTo everyone listening I think that it's cool that we know what they don't (they don't)\nIt's not about if, only when and it's fun to be in on the joke\nJust did my first shows, nervous as shit, never been on the road\nStarted in Philly I signed my first titty, I killed dat shit\nStill I ain't fucking no hoes (like no pussy, it's sad)\nA part of the reason is none of the venues equipped with a shower (it's so inconvenient)\nSo I leave for an hour and when I come back ain't no bitches around (them bitches be leaving)\nI fuck with this sound\nRapping like Migos is fun for a clown\nI could say anything and at the end of my statement\nThis cadence will make it profound\nLike for example, ya man is about to go ham in the kitchen\nI'm fixin a sandwich (woo)\nAll it is is some turkey and mayo but tell me that shit ain't dramatic! (on ciabatta)\nIt's stupid emphatic\nStomach is fucked I been poopin' erratic (damn)\nNew Santa Monica dude I just moved in in March\nAnd I'm bout to get into some Madness\nDon't confuse what my plan is\nI never go out (it's depressing)\nI meant that my brackets about get sandy\nThe beach on my house (ehh, more like three blocks away)\nI'm newly an Uncle (Uncle Dicky)\nMy bro had a baby (he did, she cute)\nI'll be on by the time she can talk\nHer first words'll be \"Dicky we made it!\" (that's a BABY)\nCan't wait to be famous (oh)\nThat shit gon' be wild (I bet I'll meet Drake)\nI'm lookin' at Jason Sudeikis like who my Olivia Wilde (I need an actress)\nI love Anna Kendrick (legitimate feelings)\nShe never tweet back (not once, ever)\nI figure she's busy or think that I'm creepy\nBut baby I'm not! (unless you like that shit)\nI just have this vision where both of us living like Bonnie and Clyde\nThat's you as a singer and me as a rapper\nWe could be like Jay and Beyonce for whites (that could be so cool)\nThat would be the life\nI'd buy the Sixers and make you my wife\nNah I'm just kiddin', I've only been smitten\nWith totally fictional characters right? (obviously we'd have to get to know each other)\nYou could be a grouch (that would suck)\nYou could be so mean (I hope not)\nYou could be the type that need warning with oral to avoid the cream (some bitches hate the taste of semen)\nThat's graphic as fuck (I suck my own dick)\nBut some bitches is bougie (I've kissed other men)\nForgive me, I just wanna make this pitch perfect I love all your movies (these ad-libs are fun)\nI need me some pussy (I'd buy it)\nI'm scared of the AIDS (the virus)\nI wish I was reckless\nThere's rappers that's been getting head up on stage (Danny Brown)\nI'm way too afraid (my dick is a pussy)\nMy dick been enraged\nBut soon when I'm fuckin in public post nut, he'll look up atcha boy and say \"Dicky we made it!\" (get 'em D)\n\nI'm just fuckin wit the flow\nYou know I still be on that ya ain't really fuckin wit da boy\nI got 150 different ways to cut dat\nLove rap\nSoon they'll be fuckin wit the dork like a humpback\nYeah I'm bout to bring the fun back\nEvery other rapper need to go and get a dunce cap\nNow I got a one track\nMind till I run rap\nMine till I'm done\nWack rhymes better run rap (run ho)\nMafucka shit is done wrapped (over)\nYou ain't wanna see me come back (nah)\nY'all hot for a summer in July in Arizona\nLil Dicky literally is where the sun at\nKnowing y'all, gotta show you where the sun at (hot)\nAll of y'all been bad where my son at? (hot)\nWhere my son at? (hot)\nWhere my son at? (hot)\nWhere my son at? (hot)\nCome get spanked, ho!\n\n[Outro]\n\nMy New Year's resolution is to call these rappers hoes\nAnd mean that\nI mean that shit\nY'all some hoes (y'all some hoes)\nY'all some hoes (y'all some hoes)\nAdios (that's Spanish)"}], "artist": "Lil Dicky"}