{"artist": "Andy Mineo", "songs": [{"title": "The Cross", "album": "Sin Is Wack", "year": "2009-11-06", "image": "https://images.genius.com/a3982a05c30eb4b15856f68714ad6ba4.1000x1000x1.jpg", "lyrics": "[Intro - Pastor Mark Driscoll?]\nJesus goes to the cross and says what? 'Its finished.' Jesus is God. He lived the life we could never live. Died the death we should have died. But on the cross he says, 'Its finished. Its all done\n\n[Verse 1 - Andy Mineo]\nEvery time I think about Him, I be getting so amazed by the grace that replaced my works\nI was never deserving that perfect person cause the serpent was living in me, a purge. I was cursed\nSince Adam ate from that Tree, somebody got to right the debt\nCause the cost of sin is death. No matter how rich you is, you can't write the check\nSomebody gotta pay the cost\nSomebody's body gotta be broken. A token taking the lost\nSo as you pray to Allah, go ahead and label me wrong\nI praise Jesus cause even as we were heathens, He chose to take the cross\nThe Christ came and never sinned, though He could have tried\nLived a life I could never live\nDied a death I should have died\nI got a humble joy. I put my pride aside\nEven when I stumble, boy, I know He'll still provide\nEven when I wonder, Lord. I know He's still alive\nI'm always seeking Him more. Never feel like I've arrived\nI'm still a target for sin, Satan trying to lock me in\nHe's trying harder. He's baiting through apple schnapps and gin\nBe the pops my oxygen. He's my (breathe in and out) yeah\nSo when I'm breathing I be defeating the views because he keeps giving reason to suck in air\nThis life ain't mines. I'm just borrowing the suit cuz\nHe created it, made it, decorated, and then gave it\nI abused it, use it, and bruised it but then he came and saved it\nFrom my self-induced anguish, hatred, and tasteless favorites\nI hope to paint this picture that'll pull you out that Matrix\nSo you can praise the Savior and you can dance like David\n\n[Hook]\nSo get  your hands up\nCause our sins is what nailed His feet and His hands up\nHe took it on the Cross\nI got problems, I got sins you can never know\nWe don't got to hold them. We can let them go\nHe took it on the Cross\n\n[Post-hook]\nHey man, I don't care where you came from or how much wrong you done. Jesus died for sins. Past, present, and future. You think your good deeds will get you to heaven? Well, we all sinners. How good is good enough? You tell me. Jesus is the checkpoint\n\n[Verse 2]\nI can hear it now. You know you're living wrong\nBut you're a rapper and everyone want to sing your songs\nPlus your paper long, and your shorty hot\nAnd, as badly you want to change, you know you're surely not\nCause his sins have got you. You couldn't do it over\nSo what's the sense in saying \"Sorry\" if you know you screwed up\nBut if you only knew of the power God can give you\nWhen you ask Him into your life, to come and live up in you\nHe'll take your heart of stone. Give it a heart of flesh\nYour body will tell you no but His spirit saying yes\nYour desires will change. You'll be a new creation\nBut please don't wait no longer. Ho-homie your life is wasted\n\n[Hook]\nSo get  your hands up\nCause our sins is what nailed His feet and His hands up\nHe took it on the Cross\nI got problems, I got sins you can never know\nWe don't got to hold them. We can let them go\nHe took it on the Cross\n\n[Outro]\nHe took it on the Cross"}]}