{"songs": [{"lyrics": "[Produced by Bink!]\n\n[Intro]\nYeah, yeah, yeah\nUgh, right, right, right\nRight, right, right, right\nUgh, ugh, ugh\nFeel me now, listen!\n\n[Verse]\nMomma loved me, Pop left me\nMickey fed me, Annie dressed me\nEric fought me, made me tougher\nLove you for that, my nigga; no matter what, bruh\nMarcy raised me, and whether right or wrong\nStreets gave me all I write in this song\nHootie babysitted, changed my diapers\nGil introduced me to the game that changed my life up\nEast Trenton grew me, had me skipping school\nValencia's boyfriend Volvo had me making moves\nMomma raised me; Pop, I miss you\nGod, help me forgive him; I got some issues\nMickey cleaned my ears, Annie shampooed my hair\nEric was fly... Shit, I used to steal his gear\nI was the baby boy; I could do no wrong\nYears going past fast; let's move along\nKitchen table: that's where I honed my skills\nJaz made me believe this shit was real\nLabels turned me down, couldn't foresee\nClark sought me out, Dame believed\nPrimo laced me; Ski did too\nReasonable Doubt classic, shoulda went triple\nMomma loved me, Pop left me\nGrandma dressed me, plus she fed me\nBanana pudding was in the hood then\nPuffin on Ls, drinking pink Champale\nTy rolled with a nigga, V.A. spot\nTone, Mike 'Zo and them niggas, V.A.'s locked\nBiggs fucked with a nigga, what's up Hoff'?\nB.I. hated the fact I put rap to the back\nMoney pouring in, clientele growing now\nBirth of my first nephew; time to slow it down\nOctober 21st: Lavelle came to the world\nFollowed by three more boys and then a baby girl\nMomma loved me; Ti-Ti, Uncle Jay...\nLoves you to death; won't let no trouble come your way\nOh, can't forget my man down in Maryland\nHe's gone 'til November; how can I not remember?\nTell your moms I'm there for her and Tiembra\nAnd your son too—there's nothing I won't do\nUnless you was me, how could you judge me?\nI was brought up in pain; y'all can't touch me\nPolice pursued me; chased, cuffed, and subdued me\nTalked to me rudely 'cause I'm young, rich, and I'm Black\nAnd living a movie, not living by rules\nNew rap patroling the city, follow my crews\nBleek, you're still with me, nigga, what did I say?\nYour time is coming: you one hit away\nBeans, I ain't trying to change you, just give you some game\nTo make the transition from the street to the fame\nMy momma loves me", "title": "Blueprint (Momma Loves Me)", "image": "https://images.genius.com/1aebfd816914351eb7010bd441822da8.1000x1000x1.jpg", "year": "2001-09-11", "album": "The Blueprint"}], "artist": "JAY-Z"}