{"songs": [{"title": "Ex-Factor (A Simple Mix)", "album": null, "year": null, "image": "https://images.genius.com/07246443663bfc794192bb1db982f57b.600x527x1.jpg", "lyrics": "Y-yo.. y-yo.. uhh Y-yo.. y-yo.. uhh Y-y-yo.., yo, y-yo.. Y-y-yo..\n\nIt could all be simple but you'd rather make it hard\nLoving you is like a battle we both end up scarred\nTell me who I have to be to get some reciprocity\nNo one loves you more than me and no one ever will\nIs this just a silly game that forces you to act this way\nForces you to scream my name, then pretend, that you can't stay\nTell me who I have to be to get some reciprocity\nNo one loves you more than me and no one ever will\n\n[HOOK:]\nNo matter how I think we grow\nYou always seem to let me know\nIt ain't workin, it ain't workin, uhh\nAnd when I try to walk away\nYou'd hurt yourself to make me stay\nThis is crazy, this is crazy..\n\nI keep letting you back in, how can I explain myself?\nAs crazy as this thing has been, I just can't be with no one else\nI know what we've got to do, you let go I'll let go too\nNo one's hurt me more than you and no one ever will\n\nYo, y-yo, yo yo- I'm here now, not just because it's my year now\nI'm clear now, only feelin cats that's sincere now\nHeart of lioness, scientist, street Zionist\nDon't twist it, it's consistantly consistent\nIf you missed it, this train is bound for glory\nEnd of story, my whole repoitory is Psalm 40\nThey bomb for me\nThinkin they can mess with your plan, but I'mma play lamb\nKnowin that the Kingdom's at hand, and showin those who want it\nYou gon' bring em the land, descendants of Ham\nNot concerned with the platinum status\nCause every joint I threw, I would do for gratis\nI'm on the train with my Pips like I'm lil Gladys\nOr in the Range throwin chips to the kids in Addis (Ethiopia)\nAbaba, two kids and and a baby father\nHot to lava, we Don Dadda, Don Dadda\n\n[HOOK]\n\nCare for me, care for me, I know you care for me\nThere for me, there for me, said you'd be there for me\nCry for me, cry for me, you said you'd die for me!\nGive to me, give to me..\nCare for me, care for me, you said you'd care for me\nThere for me, there for me, said you'd be there for me\nCry for me, cry for me, you said you'd die for me!\nGive to me, give to me, why won't you live for me?\nOhh noo.. why won't you live for me?\nWhy..hahhhihhhhhh, won't you live, for me, for me, for meeee\nCare for me, care for me, I know you care for me\nThere for me, there for me, said you'd be there for me\nCry for me, cry for me, you said you'd die for me!\nGive to meeeeeee..\nGive to meeeeeee..\n\nIt could all be simple, but you'd rather make it hard..\nLoving you, loving you, is like a bat-tle.."}], "artist": "Lauryn Hill"}