{"artist": "Boogie", "songs": [{"album": "The Reach", "title": "First Evergreen", "year": "2015-06-24", "lyrics": "[Verse 1]\nLife, damn, picture this shit, my mom in the middle of shit (Ooooooh)\nAnd she sick of this shit, her son on some ignorant shit (Ooooooh)\nWhat you think she gon' do? She gon' send him to church\n(She gon' send him to church)\nIn the city of Compton, that shit ain't gonna help in the midst of a turf, uh damn\nAnd now I'm in the choir and I'm hallelujahin' (hallelujahin')\nThen I go outside and hear niggas piruin' (niggas piruin')\nThat my cousin Cam, yeah, that nigga a kid too\nHe get dissed, I get dissed too\nI might as well bang that shit too\nStuck in a circle, well at least I'm no square though\nThought that shit was for weirdos\nYes, I ain't a nigga that care though (I don't give no fucks)\nHow we seein' no evil but we hearin' these sirens?\nHow we thinkin' we grounded when all of my niggas is pilots?\n(What the fuck, pilots?)\nCause this is plain ol' bullshit\nThe same old pastor in the same old pulpit (Lord forgive me)\nPrayin' to God for all the niggas I've lost (Niggas I've lost)\nFrom the streets that I cross, you think I'm gon' pull out a cross\n\n[Hook]\nWhen them niggas gangbangin'\nI ain't in this shit but I'm still in this shit\nThem niggas gangbangin'\nDon't get the shit but I'm still with the shit\nEverybody gangbang cause them niggas ain't changin'\nGive a fuck if you ain't bangin' cause them niggas gangbangin'\n\n[Verse 2]\nWhat's up with the shit, I'm still on my thuggin' and shit\n(Ooooooh)\nLike I'm stuck in this shit, I can't get enough of this shit\n(Ooooooh)\nIn the cut with the wine, back when niggas was mobbin'\nWas up in the Hoovers with no Bobby Johnson\nAnd niggas got lost in the city of Compton (Compton)\nDamn, that's probably the city where niggas was found at (Niggas was found at)\nI'm up in the beach where some niggas had drowned at\n(Aye shout out to Long Beach)\nYou was thinkin' you real until niggas would shoot (until niggas would shoot)\nWhy we thinkin' it was healthy when all of this shit was pollution?\n(What the fuck is pollution?)\nDamn, talkin' dirty done got niggas aired out\nThought that shit was the weird route\nNo, that ain't no shit that I care 'bout (I don't give no fucks)\nYou hear 'bout them niggas who do all that side talk (do all that side talk)\nLike they out in the street till the day they get slumped on that side walk\nIt ain't my fault 'bout how my mind's lost\nShit, lives lost from all these lines crossed, uh\nI'm prayin' to God for niggas that's feenin' the title (that's feenin' the title)\nFrom the streets that I walk, you think I'm gon' pull out a bible\n\n[Hook]", "image": "https://images.genius.com/329e9e692537ac6301adb12b1fef2ab9.300x300x1.jpg"}]}