{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/deada0ff4e2dc2960604dcfeac9f702a.720x720x1.jpg", "title": "Fat Raps (feat. Curren$y & Big Sean [Prod. By Chuck Inglish])", "year": null, "album": null, "lyrics": "Chip Tha Ripper-\nUh-huh. SLAB ENT BOY. Good luckin out, chyeah\nPulled up to the hand-car wash like blao\nJust the outside my nigga gon' wipe me down\nKnow i gotta couple dollars for you when you done\nRoll the window back up, roll the blunt, cut UGK back up\nCut the AC back up; gettin kinda hot in here, Benny Hanna\nLeft-over weed, smokin, I'm in here\nLet me volunteer to get you niggas minds right, getcha funds\nUp instead of chasin after limelight\nBut since I'm all good I might, go and see whats good\nWith these pretty girls for one night. So I whipped around\nTo the spot I knew was poppy-in. Parked then we\nHopped out then hopped in, no problem. Soon as we got in\nEye brows raised up, I missed the tape with Fay Cut(?)\nWith the Escalade truck, in the party lookin for Miss-Not-\nToo-Bougiese with a booty and know how to roll\nDoobies and junk\n\nCurren$y-\nBitches think I'm living out my car, all these shoe\nBoxes and shit, don't confuse it boo, this stuff I\nJust bought, before I came to scoop you, coulda\nDropped it off, but I wanted you to see it, confident\nBut not concieted\nYeah, I like my grapes, and my weed seedless\nGettin pussy with my fathers features, believe it\nIf you missed it, then I bet somebody out there seen\nIt, TwitPic my outfit, bitches stalk my comments\nJust fool\nWhat they say I came first on my list of things\n\nTo do(?). If the broad got wireless at her crib\nI fall through. Gotta e-mails to read, as she\nBreak down my tree, reach my cell phone\nTurn the TV down for me(yeah)\nIt was kinda ironic, cuz I had the papers\nShe had the chronic. The Hornets beat the\nSupersonics. And hella vapors from the smokin\nVolcano, I'm thirsty need some water, boy captain\nInsane-o(?)\n\nBig Sean-\nAye, in this lifetime you only get richer or not\nSo hoes jump for my balls like they tipped off\nThe rock. I get it from my dad cuz I'm a chip\nOf the block. Now I'm up in Cleveland to grab\nChip off the block. Now whip off the lots, with\nA bad bitch, ass thick, and tits so I slipped off\nThe top. Yeah, Bitch I'm the man, forever gettin\nChose, I party everynight and it's never gettin old\nThe story of your life is probably never gettin\nTold, them tickets to your show is probably\nNever gettin sold. I might just cop some shit\nFrom some set, New York to LA, I beat the sunset\nYour girl show me L-O-V-E. I dropped the O and\nE, and just took the LV. Thats Louis Vuitton luggage\nEverytime you see my passport, Domneyair(?) print\nGot me lookin like a chessboard ahaha"}]}