{"artist": "Porta", "songs": [{"album": "Reset", "title": "Animales racionales", "image": "https://images.genius.com/0786171922516cdb77f0f7ea0149854a.953x953x1.jpg", "lyrics": "La racionalidad es esa capacidad humana que permite pensar, evaluar y actuar mediante el uso de la razón, se supone que esta característica es la que nos diferencia de los animales, pero la realidad que ven mis ojos hace que no pare de hacerme esta misma pregunta una y otra vez, ¿quiénes son los verdaderos animales aquí?\n\n¿No es maltrato animal?\nPregúntale al torero\nQue le parece normal matar a cambio de dinero\nDirás que los animales no sufren ¿verdad?\nClávate una espada en la espalda y quizá entonces puedas hablar\n\nMe alegro cuando veo una cornada en toda tu boca\nY fusilaba a todo el mundo que apalease a una foca, para luego ir a la moda\nY ni loca te arrancarías tu piel para vestirme aunque fueras masoca\n\nY esto va para la que lanzó cachorrillos al río\n¿serás capaz de hacer lo mismo de mayor, con tus críos?\nHoy en día la violencia es diversión\nYo me haría un abrigo de zorra, como tú, pero no de bisón\n\nMerece la horca el cazador furtivo\nNo es por supervivencia, sino somos los seres más primitivos\nSi se habla de evolución y cada día veo en las noticias, la sangre fría del que no tiene corazón\n\nEn España torear es arte\nPa' mi una tortura\nValla asco de país que lo considera una cultura\nBasado en hechos reales\nSolo porque existimos animales racionales\nPodéis llamarnos asesinos\n\n[Estribillo]\nCuanto hijo de puta anda suelto\nTodo el que maltrata un animal merecería estar muerto\nO lejos del mundo matándose unos a otros\nLos más peligrosos de este planeta somos nosotros.(x2)\n\n¿Quieres un animal de compañía pa' pegarle?\nTu complejo de inferioridad es más grande cada día\nEllos nunca te lo harían\n¡Cobarde!\nSi lo abandonas porque ya no es un cachorro mono como antes\n\n¡AH! Me dais asco y me da pena\nVer a tanto ser humano sin sangre en las venas\nPido más condena\nEl hombre entre jaulas y cadenas\nA veces pienso, que ojalá nosotros fuéramos su cena\n\nAdiestrados, enjaulados, explotados en los circos\nTan fácil de ver como ponerte Telecinco\nPara ti entretenimiento y diversión\nLa tortura, el sufrimiento es morbo\nY el morbo vende en televisión\n\nCabezas disecadas son un trofeo en tu salón\nPido la salvación pa' las ballenas de Japón\n\nNo merecemos perdón, nuestra extinción es mi deseo\nAnimales racionales, los humanos no lo creo\n\n[Estribillo]\nCuanto hijo de puta anda suelto\nTodo el que maltrata un animal merecería estar muerto\nO lejos del mundo matándose unos a otros\nLos más peligrosos de este planeta somos nosotros.(x2)\n\nEstoy harto y manifiesto\nSufro al ver al animal\nQue es capaz de todo esto\nPor su propia voluntad\n\nMultinacionales que testean sus productos\nCon animales que no pueden defenderse y no es justo\nInformaros bien de lo que compráis\nPorque la sangre vertida estará en vuestras manos si las apoyáis\n\nEjecuciones publicas si se escapan del matadero\nNo hay dardos tranquilizantes, es un gasto inncesario de dinero\nHago un llamamiento para que no pensemos\nQue no somos capaces de hacer nada\n\nPor ese motivo mismo escribo esta canción\nQuiero hacer reflexionar al animal más cabrón\nAl que tortura por mera diversión\nEl ser humano, reflexiona, si estás conmigo solo alza la mano\n\n[Estribillo]\nCuanto hijo de puta anda suelto\nTodo el que maltrata un animal merecería estar muerto\nO lejos del mundo matándose unos a otros\nLos más peligrosos de este planeta somos nosotros.(x2)", "year": "2012-05-07"}]}