{"artist": "ProfJam", "songs": [{"album": "Mixtakes", "title": "Queq Queres", "image": "https://images.genius.com/ac43427e0930880bed1cbdb2bb1736f9.600x600x1.jpg", "lyrics": "[Refrão]\nQueq queres que eu diga man?\nQue a vida é só isto e que nem feliz eu mato o meu bicho, é?\nTenho a disease again, síndrome de mc\nEsquizo-me num beat e fico a curtir \"yeah\"\nPreciso de uma can!\nDou tags na parede do muro do medo que divide o mundo, credo!\nSafoda o teu creme!\nCash rules nāo se aplicam na lei que ensina o ProfJam…\nToda a street treme\nBarras são terramotos, desenterram mortos e juntam-se à minha fé\nVíris, gula e sam, mundo, allen halloween 'tão dentro de mim\nPor isso é que eu cuspo bué bué bué bué\n\n[Versos 1]\nO peso da minha caneta partia-te o braço!\nE a dor de cotovelo impedia que ele dobrasse\nTudo aquilo que escrevo é encomendado por gods\nE a mensagem é que a mensagem és tu que fazes\nEu não sou puro, sou misturado…\nÉ lado a lado\nTento pôr os pontos no passado\nÉ complicado…\nYa é verdade, é que eu fico sempre lá colado…\nEu quero espaço, ser libertado, o que é que eu faço?\nPreciso de me saber perdoar...\n\n[Interlúdio]\n“Epah, eu pra te ser honesto meu, juro-te, tipo, eu curto memo bué o ProfJam tipo\nAcho que o gajo tem rimas e não sei quê pah, mas tipo foda-se, o gajo é bué da estranho mano\nFaz letras memo pah, memo pah, nem percebo meu, sinceramente…”\n\n[Refrão]\nQueq queres que eu diga man?\nQue a vida é só isto e que nem feliz eu mato o meu bicho, é?\nTenho a disease again, síndrome de mc, esquizo me num beat e fico a curtir \"yeah\"\nPreciso de uma can!\nDou tags na parede do muro do medo que divide o mundo, credo!\nSafoda o teu creme!\nCash rules nāo se aplicam na lei que ensina o ProfJam…\nToda a street treme\nBarras são terramotos, desenterram mortos e juntam-se à minha fé\nVíris, gula e sam, mundo, allen halloween 'tão dentro de mim\nPor isso eq eu cuspo bué bué bué bué", "year": "2016-03-30"}]}