{"songs": [{"image": "https://images.genius.com/0fd6cab3bc8154997af6d569b9ff9058.500x500x1.jpg", "year": "2012-10-19", "title": "Ganja & Pasta", "album": "Squarians: Volume 1", "lyrics": "What’s that sound? The awesome sound?\n\nYeah, Awesome Sound, what’s this?\nGanja and pasta\nSmoke like rastas\nAnd live like mobsters nigga\n\n[Hook] [XV]:\nSmoke like rastas, live like mobsters\nSmoke like rastas, live like mobsters\n(Yea we) Smoke like rastas, live like mobsters\nWe got that ganja and pasta, ganja and pasta\n\n[Verse One: Freddie High]\nI said \"Awesome you’re a rasta for this beat cause it’s a monster.\"\nGanja and pasta, a few shots of vodka\nGirls, see y'all teeming, wanna hop up on our roster\nSo Vizzy grab that drink and put them hoes up in the casa\nI make a living off of killing beats, doctor\nNow put this in your headphones and watch it change your posture\nImpostors, got us fighting in the streets, Blanka\nYou just a single player in this Game, Boy Contra\nJungle where we from but we’re living like mobsters\nMy team going green, blowing stinky like \"ooh\"\nLove life loyalty, over all things\nIf you niggas know the motto then you know that’s my team\n\n[Hook: XV](x2)\n\n[Verse Two: Sez Batters]\nI roam through Jamaica, Christmas trees in Sicily\nThey know I’m nice, chicks want just to get with me\nRoam through Jamaica, Christmas trees in Sicily\nThey know I’m nice, chicks want just to get with me\nRoam through Jamaica, Christmas trees in Sicily\nRoam through Jamaica, Christmas trees in Sicily\nRoam through Jamaica, roam through Jamaica\nRoam, roam, roam, roam, roam through Jamaica\nV know I’m nice, chicks whine just to get with me\nTreat'em with the mask on, I ain't with the trickery\nThe squares hit the site, two teams, officially\nTake 'em out the game, balls go over heads\nLike you take em to the plane, you ain’t in the lane\nNot from the gutter but the pen game the same\nX told me not to spare 'em, had to beat em out the frame\nJoey said \"whoa\", Batterz 'bout to blow\nToday’s a hurricane, and yesterday I gave 'em snow\nAlso blew the roof off, I had to save the flow\nGood fellas with good fella, y'all niggas better know\n\n[Hook: XV](x2)\n\n[Verse Three: XV]\nSmoke like a rasta, live like a mobster\nReal monsters, you could call me Hoffa\nMy nigga J keep it Michael Bay, hella choppers\nSo that 9 stay on the block like Ibaka\nWhere you think Sez Batters he’s got his name from?\nWhere you think Deuce 1 got the game from?\nFound some cushion like whoopie when they spray guns\nCause I don’t got no sisters that act\nSo they don’t play none/nun\nSee what we started, smoking that olive garden\nBong made of glass, your shit is plastic as Dolly Parton\nI beg your pardon, my culture accepted losses\nNow we on that final level my nigga, we bosses\n\n[Hook: XV](x2)\n\n[Outro: XV]\nSo let me break something down with the Squarian ritual\nYou know what I mean?\nLike one thing that we do in the game of chamber when we, when we have, you know?\nA nice gentlemen meal like some pasta\nYou gotta roll a J, a’ight?\nAnd then we we’re sitting there watching Marley\nAnd the Awesome Sound was like \"Man, we might as well be living that ganja and pasta life.\"\nI was like \"Alright.\" For no reason"}], "artist": "XV"}