{"artist": "YG", "songs": [{"image": "https://images.genius.com/f0f0157ded406877cc0741f2d88aa69a.500x500x1.jpg", "year": "2016-07-20", "album": null, "lyrics": "[Intro]\nThis is the activation of the emergency broadcast system\n\n[Hook: YG]\nFuck Donald Trump\nFuck Donald Trump\nYeah, nigga, fuck Donald Trump\nIt's for our people\nYeah, yeah, fuck Donald Trump\nYeah, fuck Donald Trump\nAin't nobody else gon' speak up, we gon' speak up\nYeah, fuck Donald Trump\nYeah, nigga, fuck Donald Trump\nYeah, yeah, fuck Donald Trump\n\n[Verse 1: G-Eazy]\nI got a question...\nHow'd he make it this far? How the fuck did it begin?\nA Trump rally sounds like Hitler in Berlin\nOr KKK shit, now I'm goin' in\nI'm just sayin' what's real, I don't give a fuck who I offend\nCause it's gotta be said, it's gotta be said\nIt's off the top like the toupee on Donald Trump's head\nThis man's not peaceful, racism's evil\nThis man hates Muslims, that's a billion fuckin' people\nIf truth be told, Donald is a terrorist\nReasons why the world's got a problem with Americans\nThe fuck is goin' on? People just passed\nA mass murder happened, you said thanks for the congrats\nYou tryna get your votes up, you don't got class\nOrlando was a tragedy, you react fast\nAnd then made it 'bout you, to boost your campaign\nIt's goin' all bad if he wins this damn thing\nMan America is fucked if he's next up\nTake a day to undo what Obama fixed up\nIt's Young Gerald so you know who said it\nAnd Ivanka can get it, straight up\n\n[Hook: YG]\nFuck Donald Trump\nFuck Donald Trump\nYeah, nigga, fuck Donald Trump\nYeah, yeah, fuck Donald Trump\n\n[Verse 2: Macklemore]\nOh we ridin', check it\nNow, we protest when we see the tour bus (bang, bang)\nToo scared to get out, that's why the door is shut (bang, bang)\nYour politics are like a Starburst pack (why?)\nNobody fucks with the orange one (biatch!)\nBannin' all Muslims? Aiight, bool (this guy)\nWhat if we ban all the white dudes?\nBecause a couple have run up in trenchcoats and rifles\nAnd killed in the name of Jesus Christ at the high school\nHow 'bout we stop sellin' automatic guns?\nYou got rich cause your daddy gave you automatic funds\nAdd it up, you an automatic punk, what it is?\nI'm just tryna make America great again! (Mothafucka)\nParty in the streets when Hillary wins\nIf she don't, my girl's half Canadian\nActually nah, I'm not gonna stay with them\nI got an eagle on my arm, I'm a patriot\nI'ma stay right here, I ain't livin' in fear\nWith my people who are Muslims, Mexican and queer\nAnd we ain't gonna let you fuck up four years\nAin't gonna let you fuck up four years\n\n[Hook: YG]\nFuck Donald Trump\nFuck Donald Trump\nYeah, nigga, fuck Donald Trump\nYeah, yeah, fuck Donald Trump\nYeah, fuck Donald Trump\nSend it over\nYeah, fuck Donald Trump\nAin't nobody feelin' your ass\nYeah, nigga, fuck Donald Trump\nAin't nobody feelin' you ass\nYeah, yeah, fuck Donald Trump\nHere we go again\n\n[Verse 3: YG]\nThought I was makin' songs just to ride to\nBut come to find out your own kind don't even like you\nMacklemore don't like you, G-Eazy don't like you\nThe rest weenies, they scared to say it, but they don't like you\nObama don't like you, Michelle don't like you\nBeen tryna make it to one of your rallies but I ain't have time to, punk\nPiss on your golf course just to find you\nLike where you hidin' at? Who you lyin' to?\nFuck your get rich scheme, I've been ballin' out\nYou're too old, you keep lyin', that's why your hair fallin' out\nDonald Trump, call him out, KKK supporter\nHis favorite phrase, \"Deport 'em,\" how the fuck y'all endorse him?\nSince America is fucked up anyway\nGive Obama a third term, that's what plenty say\nJust left Texas, hit the stage for a couple thousand\nAnd had your same color people hollerin'\n\n[Hook: YG]\nFuck Donald Trump\nFuck Donald Trump\nYeah, nigga, fuck Donald Trump\nYeah, yeah, fuck Donald Trump\nYeah, fuck Donald Trump\nYeah, fuck Donald Trump\nYeah, nigga, fuck Donald Trump\nYeah, yeah, fuck Donald Trump\nYeah", "title": "FDT (Fuck Donald Trump) - Pt 2"}]}