{"songs": [{"image": "https://images.genius.com/6e672c139a6e77928ac847b6c6f61258.422x421x1.jpg", "title": "Hostage", "album": "Exclusive Audio Footage", "year": null, "lyrics": "[Intro: Pharrell, Pusha T & Malice]\nHello?\nYo Pharrell, get the fuck up, get the fuck up right now\nHuh?\nYo, it's your day date and we go this nigga tied down, right now\nYo, wait til' I get there\nDawg, you ain't gonna make it out of here bitch\nFuck what you thinkin' nigga?\nHold him up yo, ya'll ready to do this nigga\nWhy not, I got his ass, I got his ass\n\n[Verse - Malice]\nYou don't really want none of this though\nI let 'em know from the get go\nSee ya'll is a bit slow\nTryin' come wit the hits but they missed though\nRetaliate make 'em drop like a six fo'\nWhy you hate cause I didn't give a shoutout\nOr the way that my shine turn the spot out\nYou think you can rhyme but you not out\nOr the way we drop the top when it's hot out\nAnyone you can pick and choose\nWhy ya'll stagnant, my niggas stick and move\nMy name say it all, ain't got shit to prove\nMy whole mental ain't shit to lose\nYou all niggas snooze if you wanna\nBut you gonna be a gonna, please forgive me, your honor\nBut that fool tried to take what's mine\nThat's the reason I had to utilize my nine\nOtherwise, you can be right here now\nTalkin' bout how the Clipse don' bit his style (style)\nBack in the day how we did him foul (foul)\nOr how we don' switched, how you like me now?\nAnd anything else that them haters may say\nCome how you want, just bring it the right way\nMayday, what they gon say\nComing to they hood, the Clipse and Tammy\n\n[Hook - Tammy Lucas]\nMother fucker what you here for?\nNow you wonder why I gotta the chrome four to your ear for\nSo you can hear yo (Uncle Terrar you gon let him go?)\nI don't know\nCount to a hundred wit yo eyes closed\nSoon every number is a face of a nigga that's gon die yo\nThey try to hit me but they too slow (Daddy, you gon' let him go)\nI don't know\n\n[Verse - Pusha T]\nAre you ready for the showdown?\nIt won't be pretty if I get another go down\nIn all aspects, low down\nWhen I hit him, make sure he won't see another go round\nWhat make him think he can flame wit me\nNow he hatin' life cause he tried to bang wit me\nHad to show him death weren't a thing to me\nNothin more than a mere blood stain to me\nIt's pain to see, ain't a nigga rank wit me\nBetter yet, ain't a mother fucker hangin me\nTen more on your side, what your odds gon be\nSlim to none cause they all want to run wit me\nThe nerve to ask, why terrar hold the heat?\nHopelessly, they try to steal my deal just to roast the feat\nIf I'm the one from being followed\nHave my girl double back, mack eleven make m holla\nAnd it's just that easy, one trigger one sque-eze\nAnd he droppin' to his kne-es; damn right, lit him up\nGive a fuck about him let the paramedic get him up\nI had to muffle his heart beat\nHit everything but the baby in the back in the car seat\nHad to show his partner talk cheap\nAnd I'ma draw heat, if a nigga think I wanna walk for heat\n\n[Hook]\n\n[Bridge - Tammy Lucas] (4x)\nThink about the things you did\nAnd the things you didn't as a kid\nNo time to stop cause I'm gonna end your life\n\n[Tammy Lucas - repeat to Hook]\nLa, la, la, la, la, la, la, la\n\n[Hook]"}], "artist": "Clipse"}