{"songs": [{"album": "The World Ain’t Enuff", "image": "https://images.genius.com/aacbaca3b07ab6c68caf4ac5bedb0d81.776x768x1.jpg", "year": null, "title": "Let’s Be Friends", "lyrics": "[Tela]\nUhh, haha yeah, shit bangs, bang out the frame\nMy man Wayne, this shit right heah, this is somethin\nI put it straight to ya so everybody can fuck with it\nNiggas, bitches, y'know, everybody\nLittle kids, everybody can relate to this, yeah\n\nNow you been down with this hoe since the seventh and eighth\nHigh school, night school, shit y'all was runnin mates\nSame hustle, clocked your girl in when she was late\nSide by side, boxed hoes when they called her fake\nAnd that's your boo, that's your dawg, sister to the end\nAnd when her folks kicked her out, shit you moved her straight in\nY'all used to hang so tight niggas mistake you for twins\nNames just alike, Carol and Carolyn\nShe would lie to you, steal from you, say she didn't take it\nYou knew she wasn't right but that's your girl you let her make it\nNow who pulled her through when she needed her a portion\nBut who left yo' ass in the center of the ocean?\nShe fucked her cousin nigga and she fucked her nigga family\nYou never ever thought that she would fuck yo' baby daddy\nEverybody tried to tell you but yo' ass wouldn't listen\nAnd now this hoe done came up missin\nBut that's your motherfuckin friend\n\n[Chorus]\nFriends (my nigga), how many of us have them?\nFri-enn-ends (yup), before we go any further\nLet's be friends .. (my motherfucker)\nHow many of us have them?\nFri-enn-ends (y'all), the ones we can depend on\nLet's be friends\n\n[Tela]\nThis ya boy, this ya nigga, motherfuckin close dawg\nAnd it ain't too many niggas you can pass the ball\nHe never fumble, stay humble since you stumbled on him\nSave you from drownin that summer when you thought you could swim\nUsed to run choo-choo trains on his homegirl Kim\nFor you, your man'd put his ass on the limb\nNow he was slicker with them hoes and youse a funny-lookin nigga\nCould only get that pussy when the money lookin nigga\nHe always got it first and you was second base\nI guess this about the time we can establish the hate\nGot his ass on quicker, started movin weight\nShit he showed you too much, that was the first mistake\nWith friends like you, tell me who needs problems?\nWanna set your man up, not to kill him, just rob him\nBut somewhere in yo' flag everything went bad\nMag hit him in the head, that's it, he's dead, he left your friend\n\n[Chorus]\nFriends (yup), how many of us have them?\nFri-enn-ends (you my muh'fucker), before we go any further\nLet's be friends .. (my dawg)\nHow many of us have them?\nFri-enn-ends (my nig-ga), the ones we can depend on\nLet's be friends\n\n[Tela]\nNow you been sleepin with this muh'fucker every night\nPillow talk, shared your thoughts, shit just split your life\nAs they grew up in age they got stubborn and trife\nEverybody else was wrong and they was always right\nSo quick to point the finger, instigatin the fight\nI don't care if it was lovely they find somethin they don't like\nOh so dumb smart don't need no advice\nFolks so dumb smart too bright to get the lights\nYou know the kind, don't hear, don't see it in the mirror\nThey dress it up with bullshit to make it appear clearer\nWith he say, she say, that's all they know\nWhat did they do, where did they go, that's all they livin fo'\nThey wake up one mornin, they done missed the show\nCountin up birthdays like where the fuck did time go?\nNow look at the situation that you got yourself in\nSit self down and ask self, \"Self, is you my motherfuckin friend?\"\n\n[Chorus]\nFriends (yup), how many of us have them?\nFri-enn-ends (cause you my muh'fucker), before we go any further\nLet's be friends .. (my nig-ga)\nHow many of us have them?\nFri-enn-ends (my dawg), the ones we can depend on\nLet's be friends (muh'fucker), how many of us have them?\nFri-enn-ends, before we go any further\nLet's be friends .. (yup)\nHow many of us have them?\nFri-enn-ends (you my muh'fucker, my dawg, my nigga, my muh'fucker)\nThe ones we can depend on, let's be friends..\n(My nigga)"}], "artist": "Tela"}