{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "Clique (Remix)", "lyrics": "[Intro: James Fauntleroy]\nWhat of the dollar you murdered for?\nIs that the one fighting for your soul?\nOr your brother's the one that you're running from?\nBut if you got money, fuck it, cause I want some\n\nB-I-G\nWho fucking with me?\nOh god!\n\n[Hook: Big Sean]\nAin't nobody fucking with my\nClique, clique, clique, clique, clique\nAin't nobody fresher than my muthafucking\nClique, clique, clique, clique, clique\nAs I look around, they don't do it like my\nClique, clique, clique, clique, clique\nAnd all these bad bitches, man, they want the...\nThey want the... they want the...\n\n[Verse 1: T.I.]\nIt's H.U.S.T.L.E. gang\nThey try me, I bet we bang\nRide in the Chevy man, candy painted, day to day\nRain on these niggas, bring pain to these niggas\nI'm in this bitch you know you shouldn't came pussy nigga\nI'm a Pimp Squad OG\nQuarter, half, whole thing\nScore 24 keys, flip that, more cheese\nChya, hey, It's money that we talking about\nHow you want it? Cash, credit or the Swiss account?\nI'm playing with a big amount\nMake more than your bitches count\nSay there's a hotter nigga, where?\nHere? Now? Point him out\nTell when you see me now you now we run shit\nWe about that action training, go\nNobody do it like my muthauckin' clique\n\n[Hook]\n\n[Verse 2: Big Sean]\nI tell a bad bitch do whatever I say\nMy block behind me like I'm coming out the driveway\nIt's grind day, from Friday, to next Friday\nI been up straight for nine days, I need a spa day\nYup, she trying get me that poo-tang\nI might let my crew bang, my crew deeper than Wu Tang\nI'm rolling with... fuck I'm saying? Girl, you know my crew name\nYou know 2 Chainz? Scrrr! I'm pulling up in that Bruce Wayne\nBut I'm the fucking villain, man, they kneeling when I'm walking in the building\nFreaky women I be feeling from the bank accounts I'm filling\nWhat a feeling, ah man, they gotta be\nYoung player from the D that's killing everything that he see for the dough\n\n[Hook]\n\n[Verse 3: Jay-Z]\nYeah, I'm talking Ye, yeah, I'm talking Rih\nYeah, I'm talking B, nigga, I'm talking me\nYeah, I'm talking bossy, I ain't talking Kelis\nYour money too short, you can't be talking to me\nYeah, I'm talking LeBron, we ball in our family tree\nG.O.O.D. Music drug-dealing cousin, ain't nothing fuckin' with we, me\nTurn that 62 to 125, 125 to a 250\n250 to a half a million, ain't nothin' nobody can do with me\nNow who with me? ¡Vámonos! Call me Hov or Jefe\nTranslation: I'm the shit, least that what my neck say\nLeast that what my check say, lost my homie for a decade\nNigga down for like 12 years, ain't hug his son since the second grade\nHe never told. Who we gonna tell? We top of the totem pole\nIt's the Dream Team meets the Supreme Team\nAnd all our eyes green it only means one thing\nYou ain't fucking with the clique\n\n[Hook]\n\n[Verse 4: Kanye West]\nBreak records at Louis, ate breakfast at Gucci\nMy girl a superstar all from a home movie\nBow on our arrival - the un-American idols\nWhat niggas did in Paris, got 'em hanging off the Eiffel\nYeah I'm talking business, we talking CIA\nI'm talking George Tenet, I seen him the other day\nHe asked me about my Maybach, think he had the same\nExcept mine tinted and his might have been rented\nYou know white people get money, don't spend it\nOr maybe they get money, buy a business\nI rather buy 80 gold chains and go ign'ant\nI know Spike Lee gone kill me but let me finish\nBlame it on the pigment, we living no limits\nThem gold Master P ceilings was just a figment\nOf our imagination, MTV cribs\nNow I'm looking at a crib right next to where TC lives\nThat's Tom Cruise, whatever she accuse\nHe wasn't really drunk he just had a frew brews\nPass the refreshments, a cool, cool beverage\nEverything I do need a news crew's presence\nSpeedboat swerve, homie watch out for the waves\nI'm way too black to burn from sun rays\nSo I just meditate at the home in Pompeii\nAbout how I could build a new Rome in one day\nEverytime I'm in Vegas they screaming like he's Elvis\nBut I just wanna design hotels and nail it\nShit is real, got me feeling Israelian\nLike Bar Refaeli, Gisele, nah that's Brazilian\nWent through, deep depression when my momma passed\nSuicide, what kinda talk is that?\nBut I been talking to God for so long\nAnd if you look at my life I guess he's talking back\nFucking with my clique\n\n[Hook]"}], "artist": "T.I."}