{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "Money", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "[Verso 1: Papillon]\nA paca fala\nYa, já há bué que eu não oiço o que ela diz\nEstou submerso na faixa oito do segundo do álbum do Boss AC\nSem kumbo não se passa nada\nEu bem penso nele mas ele não existe\nÉ grande depressão, relaxa eu não 'tou triste\nEste programa eu já vi, tipo déjà vu mas c'est la vie\nPois eu sempre assim vivi, aliás, sempre sobrevivi\nAliás falta de guito em si nunca faltou aqui\nPor isso pa' mim, 'tá tipo os apanhados da sic boy, não há crise\nCaguei pra bolsa de valores, quero é valores na bolsa\nNeste trabalho sou mau, mas quase ninguém reembolsa\nNão tenho preço, tenho valor, também tenho quem me ouça\nMas os meus zeros continuam no bloco do Francisco Louçã\nAté tinha um pouco de kumbo guardado pró que der\nMas tenho um bolso furado e não tenho guito pó coser\nAté tenho pitéu em casa, mas não há gás pó cozer\nE na fila da santa casa oiço alguém a me dizer:\n\n[Refrão: Papillon]\nMeu brada\nA paca\nNão paga\nA minha alma\nMas brada\nSó a alma\nNão paga\nNada\n\n[Verso 2: Papillon]\nA paca fala\nE já bué que eu não oiço o que ela diz\nTenho phones nos ouvidos, desde ante-ontem a ouvir C.R.E.A.M\nDesde ontem a ouvir CAN I LIVE, e hoje a ouvir MONEY TREES\nSou um menino de ouro... mas meu extrato não condiz\nWis à escala universal, a bulir durante um terço do dia\nTêm massa contada, já nem dá pa’ comprar chá de tília\nWis à escala universal, com um terço, rezam \"avé maria\"\nTêm massa pra alimentar três gerações, da tua família\nAndam todos atrás do céu? não, todos atrás do \"seu\"\nQuerem paraisos fiscais, só com reais, sem barnabeu\nPutas partem braço, ladrões partem com o que não é seu\nSão as profissões mais antigas e nem sequer estão num museu\nA minha profissão não me dá o meu, mas dá todo o prazer\nGénios procuram excelencia, não procuram satizfazer\nAndo á procura de JOBS, assim I POD se satizfazer\nE enquanto preencho o C.V. o meu dred vem dizer:\n\n[Refrão: Papillon]\nMeu brada\nA paca\nNão paga\nA minha alma\nMas brada\nSó a alma\nNão paga\nNada\n\n[Verso 2: ProfJam]\nAnda tudo atras da paka, poucos fodem essa rata\nPorque a puta da pataca so se mistura com gravata\nAndo a procura duma faca pa cortar o colarinho\nCorrentes de tecido já escravizam o teu vizinho\nNão sou adivinho, manda me uma de vinho\nQ'eu digo te o futuro, cada passo do teu caminho\nNasces, mudam te a fralda, cresces, começa a aula\nJá mataram os teus sonhos agora fedes porque tas na jaula\nBebes, começa a balda, esqueces o que te falta\nA inocência já la vai, quedas, o chão abaula\nE enquanto a magnum puxa o money, ice c.r.e.a.m. (i scream)\nQuero carrots, bugs bunny, tunesquad my team\nGold nuggets tipo denver brilham no instrumental\nMano e só com duas barras corto o S na vertical\nPorque eu sonhei com isto tudo, vivo a vida em deja vu\nLutar por guita? meu puuuto, eu sou o ídolo do cumbú\nQuerem que eu venda o meu rap porque ele é único\nMas yo, boy não confundas o meu som com produto\nClip não é televenda, tira a venda do olho\nQuem paga pelo meu rap só deve 'tar doido\nNao morro de amores pela guita mas fodasse preciso dela\nÉ uma relação interesseira, só poupo pa' 'tar naquela\nHá quem roube pa tar naquela mas tem roupa da Chanel\nEu cá vou de vento em popa, basta abrir a minha vela, pá!", "year": "2014-06-06"}]}