{"songs": [{"title": "Rookie", "album": "October 31st", "year": "2018-09-08", "image": "https://images.genius.com/49119748696b9f0e7df99fbdf1569161.500x500x1.jpg", "lyrics": "[Verse 1: Lil Nas X]\nUh\nGet it, get it, I went and did it again\nRip it, flip it, they say I’m switchin' on friends\nThey say I’m trippin', forestallin' myself within\nI only trip when I trip and fall in that Benz\nI'ma bake the feature for the right pricing\nCake the beat, I’m just the right icing\nSee, I’m inspired by Neil deGrasse Tysons\nThey inspired by squealers that’s doing lifings\nI get three hours of sleep, just to get better\nThese cowards, they out here sour at me, petty vendettas\nI ain’t ate right or took a pee, waitin' for cheddar\nWorkin' late night, oh, it’s just me, David the letter-man\n\n[Vocals]\nC'mon girl, get up\nCome a little bit\nC'mon girl, get up\nCome a little bit (bit, bit)\nMy whole life I was under it!\nAll-\nChe-che-check\n\n[Chorus: Lil Nas X]\nUh, so I'll be damned if I let a pussy take it from me\nI'm the man, I'm the rookie, finna make the money\nI make 'em dance, throw ya hands up and shake it for me\nI’m advanced, man, my fans out here waitin' for me\nSo I'll be damned if I let a pussy take it from me\nI'm the man, I'm the rookie, finna' make the money\nI make 'em dance, throw ya hands up and shake it for me\nI’m advanced, man, my fans out here waitin' for me\n\n[Verse 2: Lil Nas X]\nUh, I’m doing better so petty shit I just let it go\nI’m more focused on leaving sofas to Mexico\nTouring Europe and Africa, buzz around the globe\n\"Nas, can I get back to ya?\" bitch, the sound of dough\nIs all that I hear\nBitch, I’m really spittin' now, this is my career\nShoutout to the labels flaking on me, fuck they ears\nYou just lost your best player, 'Bron and Cavaliers, disappear! Uh!\nI came to do it\nI came to fucking pursue it\nThey showin' love in this bitch\n'Cause I’m blowin' up and they knew it would happen\nIn this rappin', I’m the new captain\nI sat back, perfected my craft while niggas was laughing\n\n[Outro: Lil Nas X]\nUh!"}], "artist": "Lil Nas X"}