{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "The Hegelian Dialectic (The Book of Revelation)", "title": "Bless You (Bonus Track of Hegelian Dialectic)", "image": "https://images.genius.com/b22dd2158bc588f2bd24f8844f87f648.1000x1000x1.jpg", "lyrics": "[Intro]\nPeace, what up dog?\nYeah yeah yeah yeah\nYou know what it is man\nSame shit ain't nothing changed\nOut here getting it\nDoing what I was supposed to be doing\nMind on my business, you know what I'm saying?\nGettin my money what up with you everything that good? Aight\nIs that right?\nY'all niggas better go handle that then\nDo what you gotta do man\nHandle your things boy\n\n[Verse 1]\nMay the good Lord bless you\nWith anything you hope or wish for bless you\nMay you live a long life\nMake long money sleep good at night (I do)\nI wish you nothing but the best\nMay you love real deep may you laugh real big (haa)\nI pray your enemies fail\nAnd you ain't never gotta spend time in jail (fuck that shit)\nMay you travel safe\nAnd meet good people along the way\nI hope you know you one of a kind\nAnd you ain't gotta be like them you're just fine (you're alright)\nI wanna see you become wealthy (uh huh)\nAnd more important than that, stay healthy (stay healthy nigga)\nGod speed, and pray you never have to lock horns with P\n(Oh hell no)\n\n[Chorus]\nPeace be with me\nThe dark and the light angels protect me (yeah, that's right)\nLife is about balance\nYou trying to be cool but sometimes it gets violent (nigga)\nPeace be with me\nThe dark and the light angels protect me\nLife is about balance\nI'd rather be cool, but out here it get violent\n\n[Verse 2]\nOut the shadows\nLet the moonlight shine on me (who that?)\nKeepers of the night, keepers of the Holy\nRapping words the spirit of the strong in me\nI use the force, careful with that shit, baby\nI feel you I'm still learning my own strength\nSorry if wasn't perfect when you thought I should've been\nI'm just a work in progress (yeah I know)\nI encourage my self to be better and master the art, its\nLong time coming seem like the other day\nI'm just being myself, they calling me a late bloomer (what?)\nAnd I don't know if that's a compliment or insult\nAnd I don't give a fuck really keep talking\nGot two pair of watch like the Polo, kid\nMy time is so precious why would I waste it?\nOn a silly bitch like you and miss my chance\nTo realize my greatness and become who I am (beat it)\n\n[Chorus]\nPeace be with me\nThe dark and the light angels protect me\nLife is about balance\nYou trying to be cool but sometimes it gets violent (peace)\nPeace be with me\nThe dark and the light angels protect me\nLife is about balance\nI'd rather be cool, but out here it gets violent\n\n[Outro]\nAs I take my gun off before I pray\nI don't have problem with meeting God halfway\nYeah, we believe in a higher force\nMay God be with you through this war\nShit real out here man, crazy out here man, peace\n\n[Female voice]\nYou have just been exposed to a range of propaganda devices\nUsed by the West to control, manipulate, neutralize and anesthetize entire populations\nIt's own and that of other nations", "year": "2017-01-20"}]}