{"songs": [{"lyrics": "(Verse 1)\nWhistles, bells, ten by ten cells\nThe peasants in the seven ten split that never fell\nWho print a third rail tiger twine débutante situation\nAnd pencil me in [?rad-doom?] we'll see if we can't make you famous\nThe operetta sunk by sunken skulls fed the chubby tenor jealousy [?Dolby Digi capture?] format\nDawned with that angelic shimmer similar to my brothers first four-track\nCocooned [?a cool?] high school inconsistent success callbacks\n\"I don't want to hear you whinin' 'bout you coulda shoulda woulda been a pilot\"\nWell that's a beautiful regret, that I couldn't quite hear\nI was busy flying by it in my SR-71 Blackbird soul-craft\nWith license dangling for middle digit wiln' \"How are you?\"\nFeeling restless, incredible sense of full galaxy bench-press off the resting sight\nIcicle atmosphere surface corpse of a once lovely now ugly demeanor\nYanked out the grab bag of poison [?splotches?] \"Presto change!\"\n[?the voyage botches, the boy-a watches?] unconditionally\nBully up in a mixed species for the stargazers, scruffy puppy dog car chasers\n\"That's right\" I amaze the hex enough to breathe for a second\nBut in that same breath, he reloads his weapon\nIt's bigger than the most rugged embodiment of malice\nDances with the skeletons, and paints a velvet hell I'm in\nAside from, slide slick humanoid snake tongue hybrids\nStood the net that draped over my TV set\n\n(Hook)\nIt's I against it, Jinx Planet\nIt's it vs. the pennies in my pocket, Jinx Planet\nPlus my will to drink drama, Jinx Planet x 7\n\nIt's I against it, Jinx Planet\nIt's it vs. the pennies in my pocket, Jinx Planet\nPlus my will to drink drama, Jinx Planet x 7\n\n\n\n(Verse 2)\nIt's a Jinx Planet, jeopardy on the canvas\nTryin' to shepherd leopards from the archive and the annex\nLike maggots gut the belly of that fallen elk\nHuman barnacles starship kamikaze to market to buy and sell\nHe said there ain't gone' be no revolution 'til the mutants fell\nTo my sweet lullaby, now they gonna scuttle by speechless\nThe yes-men nod in perfect syncopation, statin' SURE!!\nBut I leave my sures/shores to the beaches, where the hell-nos wash up frequent\n\"Stuck in a mortal\" Stuck in a mortal mannerisms with a definite death\nFlashing the etiquette of veteran gems\nMy tenement stems from where the burners burn best\n\"Stuck walking  a flat Earth simulation murder churn fest\" Blatant!\nPrimal traitor defiling all the parties purity\n[?Pushing this bold least bound?] cross breath meshed with king of pain elixir senseless\nDrink and purge a thousand years of resentment in seconds\n\"And right then I broke his weapon\"\n[?Left?] things forever in a plank, like ain't no dragon alien of Fahrenheit infinite measure\nSwift peregrine falcon split [?tether in between?] this planet's tilt\nAround the wretched refuse Aesop and his little cannon built\nWe thrive in the event horizons offering\nSlide to the event's half baked subsidiaries when\nEvery enriching stitch wishes to back themselves out of a hidden [?wink?]\nCycling the brink of something makers more beautiful than this link\n\n(Hook)\nIt's I against it, Jinx Planet\nIt's it vs. the pennies in my pocket, Jinx Planet\nPlus my will to drink drama, Jinx Planet x 7\n\nIt's I against it, Jinx Planet\nIt's it vs. the pennies in my pocket, Jinx Planet\nPlus my will to drink drama, Jinx Planet x 7", "title": "Jinx Planet", "album": null, "image": "https://images.genius.com/64fbb9620a6b5e79e87c654b74da5441.640x640x1.jpg", "year": "2010-01-04"}], "artist": "Aesop Rock"}