{"artist": "G-Eazy", "songs": [{"title": "Everything Will Be OK", "album": "When It’s Dark Out", "year": "2015-12-04", "image": "https://images.genius.com/3f3caa943941ab74b949c9a28bfc649c.300x300x1.jpg", "lyrics": "[Produced by Remo]\n\n[Chorus: Kehlani]\nEven if I don't stay\nEverything will be okay\nEverything will be okay\nEverything will be okay\n(Okay, okay)\n\n[Verse 1: G-Eazy]\nContemplatin' just who I coulda turned out to be\nIf I'da stayed and weren’t heard, what would amount to me?\nIf I had looked and ain’t found what I have found in me\nI mean inside, would they love me? Never looked down on me?\nThey say, \"You know, if you loved her well then you would have stayed\nYou could have made a perfect pair that people wouldn't trade\"\nTrade for nothing, I did though, I had to chase it\nFace it, I wasn’t born to live a life basic\nThey say, \"You turned your back on us just to go and be\nAn artist, what's a promise anyway when someone breaks it?\nI bet he finally gets a shot and then he wastes it\nI bet he don’t come back for us when he makes it\nAnd if he do it'd be too late, you gotta face it\n'Cause by then there's someone new you been replaced with\nOld friends I grew up with, the girl I fell in love with\nLove or hate me depending on how you judge it\n\n[Chorus: Kehlani]\nEven if I don't stay\n(Even if I don't stay)\nEverything will be okay\nEverything will be okay\n(I promise it'll be okay)\nEverything will be okay\n(Okay, okay)\n\n[Verse 2: G-Eazy]\nI had to wander, I had to go tread my own path\nIf you don't step through no mud, well then it won't last\nThe years pass, it's crazy how they go fast\nAsk myself questions you have, but that you won't ask\nLike, \"You don’t even come home enough\nWhere were you when she was in the hospital, huh? It was only us\"\nAnd that’s deep and yeah, I know it cuts\nBut if that gets you, then you’re weak 'cause we were here and it ain’t broken us\nStill as close and stayed by her side when no one was\nLike when she lost her job and everything, how broke we was\nWhen she was sick and she needed some taking care of\nA fifteen year old shouldered the weight and what he was scared of\nThe worst, I know that you stayed strong\nI don’t say this enough, but you made me just as proud as you made Mom\nYeah, you got some anger, but I don’t blame you at all\nI know I don't call, but you're my brother\nI love ya\n\n[Chorus: Kehlani]\nEven if I don't stay\n(Even if I don't stay)\nEverything will be okay\n(It’ll be, it'll be okay)\nEverything will be okay\n(I promise it'll be okay)\nEverything will be okay\n(Okay, okay)\n\n[Verse 3: G-Eazy]\nYeah, in that first grade class they came and got me\n\"Your mom's outside, say goodbye now to everybody\"\nU-Haul was waiting with all of her things, at least what she could pack\nIn the time my dad's at work and before he came back\nWay too young to comprehend what was happenin'\n\"Are we going to grandma's? When are we coming back again?\"\nLittle did I know that we were leaving him by himself\nAnd ten years would pass before Mom sees anybody else\nJust us, in middle school, I ain't understand\nWho Melissa was and why she wasn't another man\nBiased and confused, they try explain, but nobody can\nWanted what I thought was normal, she had another plan\nSuch is life, even if it took time for me to accept it\nNo longer Dad now, but a woman with whom she slept with\nOver the years when a secret was how she kept it\nI ain't get it, admittedly I was skeptic\nI came around, happiness I see's what you may have found\nAnd that's what's most important, I don’t wanna see you breaking down\nI wanna see you smile, I don't wanna see you make a frown\nIf she loves you, then that's all anybody needs maybe now\nBy '05 things had gotten worse\nMoved to the basement, deep depression's a rotten curse\nHidin' in a dark space, her mind and her body hurts\nBecomin' more reclusive and the pills should have been alerts\nSo the worse it got, I became more and more afraid\nUntil one night, I went into that room, on the floor she laid\nI shook her, she was blue, her skin was cold and she wasn't breathin'\nScreamed, \"Melissa wake up,\" couldn't fathom that she was leavin'\nMom and Bro was runnin' down, I screamed \"Somebody help\"\nTry pumping her chest, CPR, but it didn’t help\nToughest pill to swallow, but we lost, that’s forced reflection\nWhile in her life you made her happy, thank you for the blessin'\n\n[Chorus: Kehlani]\nEven if I don't stay\n(Even if I don't stay)\nEverything will be okay\n(It’ll be, it'll be okay)\nEverything will be okay\n(I promise it'll be okay)\nEverything will be okay\n(Okay, okay)"}]}