{"artist": "YG", "songs": [{"image": "https://images.genius.com/59064082da48f1c48bf96d62c598b6c3.1000x1000x1.jpg", "year": "2018-08-03", "album": "STAY DANGEROUS", "lyrics": "This is Global Tel Link\nYou have a prepaid call from, TC\nAn inmate at the Delano Community Correctional Facility, Delano, California\nThis call and your telephone number will be monitored and recorded\nTo accept this call, say or dial 5 now\nThank you for using Global Tel Link\n\n[Big TC]\nYo YG what's happenin' fool? It's TC fool, nigga\nShit, nigga stay callin' your ass\nYou never answer the motherfuckin' phone\nBut shit look bro, a nigga really callin' you to let you know that I'm lookin' for them dollars, nigga\nNigga really down in this bitch you feel me?\nNigga, stomach damn near touchin' his back bro you feel me?\nBut you stay comin' through for a nigga man, I appreciate that man you feel me?\nShit the last five years wouldn't be the same without you for sure for sure you feel me?\nA lot of niggas turned they backs on a nigga you feel me? But shit\nStay riding for me and I appreciate you fool you know what I'm sayin' like\nKeep doing yo shit though you feel me?\nKeep puttin' your foot on these nigga's necks man I see you man\nAnd fool look I know you be out here on some street shit\nBut look man that shit ain't worth it you feel me?\nI been here with niggas that really be walkin' the yard all they life you feel me?\nBecause of one decision they made you feel me?\nAnd you got the opportunity to change niggas' lives, change your life, change your family's life man you should get out there and do that you feel me?\nA lot of niggas don't get to see and do the shit that you done you feel me?\nEspecially a nigga like me that's sittin' in here everyday and never see the others, shit's the same you feel me?\nAyy but look man, send my love out to all the homies and shit man\nTell em' I miss 'em you feel me?\nNiggas still remember everybody\nTell your moms, tell your lil bro and all of them I said what's hannin'\nStay bollect bro you feel me? I'm 'bout to get up off this phone you feel me?\nBout' to be chow time you hear me?\nYou know what I'm saying? But uhh\nStay dangerous nigga, stay on your shit nigga\nKeep doing you nigga\nKeep your foot on these nigga's neck all day long you feel me?\nI'm out though nigga this TC, you already know the deal nigga\nOne love nigga, I love all yo' ass, Stay up", "title": "FREE THE HOMIES INTERLUDE"}]}