{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/deada0ff4e2dc2960604dcfeac9f702a.720x720x1.jpg", "title": "Feel Good [Prod. By S.O.V.]", "year": null, "album": null, "lyrics": "Uhh\nSlab E.N,T, boy!\nYeah\nChip Tha Rip\nMmhmm\n\nBitch I feel good\nDon't I look stupendous?\nMy shine is so endless\nAin't shit you can do to end this\nEven when I'm dead nigga's still gon' bump that Chip shit\nCoke white escalade on 6's for you dipshits\nSo you won't forget this, midwest nigga be the coldest\nCleveland is the city where you hustle or you hopeless\nAnd my closet's like a store bitch\nOnly difference is you ain't gon' find this in no store bitch\nIt's fresher than your whole clique\nG shock over D.C. grindin' everytime you see me\nHum louis Vuitton complete me\nNow r.i.p. to ant while I'm out here stuntin with keke\nI be ridin' super tint\nI'm a ghost you never see me\nCause I'm up above, I'm in the clouds, I'm rollin up, I'm lookin down\nChip in the house, ya'll stop ya breathin\nI'm a superhero, like hancock to cleveland (nigga)\n\nHell yea, that nigguh shine all the time but look at him you can tell he from the hood\nBitch, I feel good\nHold up, roll up, we just smoked 4 blunts and I'm feelin like I should\nBitch, I feel good\nNigga where the liquor? Where the cups? Where the ladies, where the sluts? I'm drunk, what\nBitch, I feel good\nAnd I'ma stay a fresh, fly nigguh doin' everything you would if you could\nBitch, I feel good\n\nDon't I look tremdous?\nDamn I feel so splendid\nI walk up in yo shindig\nHigher than the o-zone, damn I can float home\nJust call me when you want some\nI'm out here by my lonesome\nPack a bape jacket for the winter polo v-neck for the summer\nI'm a young hood boss, I do what I wanna\nIf you tryna fuck with me then you better have some bros hun\nI fuck wit them OG's, I'm probably stuntin with yo fathaaa\nProblem is you don't want it, nada\nMy nigguh's got hella choppas, you gonna need hella doctaaas\nAnd I rep my city proper\nProbably catch me rockin' prada, hoppin off a helicoptaaa\nIn the skizigh, CuDi hand me ya shizit\nNigga we gettin hizigh\nUh, lookin for izigh, yeah here I go\nThe nigga who get your income tax every show (lets go)\n\nHell yea, that nigguh shine all the time but look at him you can tell he from the hood\nBitch, I feel good\nHold up, roll up, we just smoked 4 blunts and I'm feelin like I should\nBitch, I feel good\nNigga where the liquor? Where the cups? Where the ladies, where the sluts? I'm drunk, what\nBitch, I feel good\nAnd I'ma stay a fresh, fly nigguh doin' everything you would if you could\nBitch, I feel good"}]}