{"songs": [{"year": "1996-01-01", "title": "The Lump Lump (Nubian A Cappella)", "image": "https://images.genius.com/1c52e71359b74022bfc521e5c3903c5b.600x599x1.jpg", "lyrics": "Sadat X ft. Grand Puba and Lord Jamar - “The Lump Lump (Nubian Mix)”\n[Emcee(s): Grand Puba, Lord Jamar, and Sadat X]\n[Producer(s): Buckwild]\n[Scratches: Roc Raida]\n[Sample: The Emotions - \"Blind Alley\"]\n\n[Intro: Lord Jamar and Grand Puba]\nLord Jamar: Yeah.  Where the ladies at?  Where the ladies at?  Where the ladies at?  Check it out\nGrand Puba: This is for all the ladies out there with the Lump Lump, holding it down, running scams, turning tricks, playing players.  I'm telling you: you need to snap out of it, know’m saying?\n\n[Verse 1: Grand Puba]\nWhat’s the deal be, mama?  Body like drama\nOther than her mind, a penny short of a dime\nSharita doing Peter—slick-moving senorita—give her\nTwo margaritas, she's the big willie beater\nHead-to-toe fashion, love gear with a passion, never\nCaught looking slum.  I say, “Word, she is, son”\nNice Lump Lump, big chest caught me staring, stretched\nThe D and the Y of a shirt of Donna Karan.  She a\nSchemer, cherry-red fifty-two-eight Beemer\nMy knot been bar-hopping and it ain't no stopping\nI'm checking out the way that this chicken motivates, spreading\nLegs, waist, and eggs up and down the tri-state\n“Woah, here she come.”  Dig it, dun.  I'ma\nHit her with a clue and tell her, “See Frank Perdue,” ‘cause I\nKeep my erection out the poultry section\n‘Cause the wrong interjection might lead to infection.  It’d be\nTrees and cheese, then bending knee.  Long as\nA nigga keep paper, then it's yours with ease.  I know\nThe whole of the half ‘cause I deal with math, quick to\nRun that ass just to ride S-Class\n\n[Hook: Samples with Scratches by Roc Raida and (Lord Jamar)]\n“I’ve been doing my own thing” - Sample from Groove Theory - “Tell Me”\n\"No doubt about it\" - Sample from Intro - \"Love Thang\"\n“I’ve been doing my own thing” - Sample from Groove Theory - “Tell Me”\n(Yeah, what you gonna do for me?)\n\n[Verse 2: Lord Jamar]\nYeah, I've seen you at the African street fest, dressed in\nThree-fourths to your ankles, tight-wrapped skirt.  What could\nThat hurt?  You was buying books, giving flirtatious\nLooks at the brothers that was eyeing your equipment\nLight-skinned pigment, pierced the belly button and you\nCouldn't tell her nothing.  She said she loved a man with\nDreads and wasn't impressed with the name-brand\nThreads—are you seeing through our game plan?  Sex every\nNight, but never with the same man.  A freak for\nThe knowledge.  Your first week in college, you was sneaking brothers\nIn the dorm and lost your mind when you got the pad\nOff-campus.  All the time, keeping up the façade\nYou like to fuck with the gods.  Now you’re stuck between\nA rock and a hard place, faced with the facts that\nYour acts are a detriment to what you represent\nCan't be a chicken and be acting like it’s science\nYou kicking.  Mad niggas be sticking, licking fingers after\nEvery meal.  Now she wants singers with a deal\nI'm only bringing you the real.  No matter what\nI say, you gon’ do what you feel\n\n[Hook: Samples with Scratches by Roc Raida and (Sadat X)]\n“I’ve been doing my own thing” - Sample from Groove Theory - “Tell Me”\n\"No doubt about it\" - Sample from Intro - \"Love Thang\"\n“I’ve been doing my own thing” - Sample from Groove Theory - “Tell Me”\n(Yeah, yeah, yeah)\n\n[Verse 3: Sadat X]\nI had seen\nThis chicken at the bar.  Ms. Sleazy was thirst\nThe physical was there, but, mentally, she was the worst\nWalked around with her ass out and a glass out of\nHer hand, she sees nothing, my man.  Ask\nHer on the world topics, says she been to the tropics with this\nCat she hardly know, Scott LaRock \"Super Hoe\"\nMost likely to have a baby from a cat who don’t love her\n“Is that your wifey, man?”  No, that's my baby mother\nYou’ll arrive at the pop of the cork like a hawk\nStay around, chitter chatter, and make small talk\nGet fidgety and then you walk.  And you\nWonder why I drag your name through New York\nWith the Velcro cup that's stuck to your fingers\nSearching out the drug dealers and the fly rap singers, getting\nPassed like a blunt, but, in the club, you front\nYou insist that you ain't been twist by half of these\nNiggas—are you crazy?  I got the figures and the numbers don't\nLie.  Save the bullshit, don't try to be fly\nLive as you live and have a good life, but a\nChick like that can't make a good wife.  These\nWords I say might cut like a knife, but I'm\nOnly trying to save you stress and strife\n\n[Hook: Samples with Scratches by Roc Raida and (Brand Nubian)]\n“I’ve been doing my own thing” - Sample from Groove Theory - “Tell Me”\n\"No doubt about it\" - Sample from Intro - \"Love Thang\"\n“I’ve been doing my own thing” - Sample from Groove Theory - “Tell Me”\n(Hold it down.  Ho, hold it down)\n“I’ve been doing my own thing” - Sample from Groove Theory - “Tell Me” (x2)\n\n[Outro: Lord Jamar]\nAight.  What you gonna do for me?  What can you do for me, baby?  Know’m saying?  I know I’m bonified.  I know what I could do for you, but what can you do for me, you know’m saying? Get off that pelvic", "album": "The Lump Lump (Nubian Mix)"}], "artist": "Sadat X"}