{"artist": "King T", "songs": [{"image": "https://images.genius.com/c723068047c0d910e1d247c3b27d3244.640x640x1.jpg", "title": "At Your Own Risk", "year": null, "album": "At Your Own Risk", "lyrics": ".. it's at your own {*repeating, getting louder*}\n.. it's at your own .. it's at your own\n.. it's at your own .. it's at your own\n.. it's at your own risk SUCKER!\n\nYo! Whassup? Yo.. what's happenin, what's happenin?\nE-Swift, you cuttin the records nice boy\nDJ Pooh whassup man? We all chillin\nYo, yo, J-Ro's in the house, we all cold coolin out y'knahmsayin?\nAnd I'mma bust it off like this for Compton\n\nWell - look who sprung up, comin the fuck up\nI came in the place to let you know what's up\nWith a bunch of trunk jewerly\nTwo or three fat gold chains, ring plates with my name on 'em\nYeah I rhyme fly, real fly Hobbes\nI wear Nike's cause I run from the cops\nPops taught me lots he said \"Toys are for tots\"\nAt four, bought me a box, when I was six I wore a jock\nCause, my jimmy was gettin kinda big\nAt nine I was a kid but I took my first swig\nHugged that Olde English beer\nSo my peers wouldn't think that I was queer\nYeah, right off I got the title of a gangsta\nPranksters run because they know that there ain't a\nPerson, runnin a verse on like this, hahahaha..\nWhassup? This at your own risk, sucker\n\nUhh! This at your own risk, sucker..\nP-Puh, Puh-P-Puh-P-Puh-Pooh man fuck it!\n\nPeople always say, \"Are you the King of the West?\"\nBut there's always some pest who try to put you to the test\nEven though, they know I'm King, I'm on a higher level\nI even dust the church and sold they soul to the devil\nI mean really, how you think I'm livin?\nOn the strength I'm livin like it's Thanksgiving\nSo yo, whassup turkey, tryin to jerk me?\nYour rhymes don't work see, you can't hurt T\nThe almighty individual\nYou said you knew, but I don't think you really know\nAbout the K-I-N-G super cool mack daddy\nI drive a Caddy, and I'm livin fatly\nHad me on stage in a rage\nYellin was what ya know, that's how I get paid\nMade my mark but rappers still insist, to diss\nBut yo it's at your own risk sucker\n\nSup? It's at your own risk\nAiyyo, E-Swift, bust the break\n\nVerse three is another one for those to remember\nKing Tee is the champ, smashin all contenders\nFor those who disbelieve, just step in my direction\nI'm snappin arms, legs and even necks and\nSuckers who thrive to drive me crazy\nYou know the ones who front tryin to amaze me\nTake it as a warnin cause I'm hopin that you don't diss\nBut get a load of this, it's at your own risk, sucker!\n\nYo, it's all about me and DJ Pooh and E-Swift\nRockin the house, y'knowhatI'msayin?\nWe got Walkman in the house\nWe got J-Ro in the house\nWe got (??).. {*echoes*}\nY'knowhatI'msayin we cold chillin y'know\nI wanna send this record out, to the Piano Man\nPiano Man, won't you play somethin for me\nAight, get busy, right here, c'mon c'mon\nGet funky, get, get funky, c'mon c'mon\nGet funky ass oh, ohh yeah\nGet funky, aww ooooooh shit!\nIt's at your own risk suckers, knowhatI'msayin?\nYeah, E-Swift, scratch that in\nAwwww yeah..\nAww you're doggin it man, y'knowhatI'msayin?\nSEE YA!"}]}