{"songs": [{"album": "Revenge of the Dreamers II ", "year": "2015-12-07", "title": "Caged Bird", "image": "https://images.genius.com/75954b68370a231b070c743211583832.1000x1000x1.jpg", "lyrics": "[Intro: J. Cole]\nYeah, caged bird\nSome'n' like a caged bird\nCaged bird\nYeah, look\n\n[Verse 1: J. Cole]\nYou ain't a man till you stop chasing your friends, my nigga\nThink for yourself, make your own plans, my nigga\nI'll be lying if I said I ain't understand, my nigga\n'Cause who you gon' follow when the leaders all get swallowed\nBy reefer clouds and bottles\nIn and out of county jail\nThis is hell, see the young black males in packed cells\nWith they heads down\nAnd they fists clenched tight\nThinking, \"I could bust a hole through this wall\nAnd, bitch, I just might.\"\nIt's just like the caged bird; I sing a song\nHoping they open up these bars and send a nigga home\nI cry when I'm alone\nI'm wondering why would God send me here\nKnowing that they hate us\nKnowing that they make us feel like we evil so we kill our people\nWithout a second thought, in every lesson taught by OGs\nWe full of real nigga wisdom, so we proceed\nLike real niggas who been stripped of our humanity\nI see the judge's eyes, I know that he ain't understanding me\n\n[Hook: J. Cole]\nA caged bird (Yeah, a caged bird)\n(Let this little caged bird sing) Caged bird\nYeah, caged bird\nFreedom's just an illusion, that's my conclusion\nAnd if it ain't, then how my niggas keep on losin' theirs?\nThis goes out to childhood friends that's doin' years\nPrison tats on they backs like souvenirs\nWe wish that you was here\nA mother's tear spilled on this page\nA brother's tear spilled on this page\nHow many days left?\nAnd can you find peace when you released\nStill filled up wit' rage\nBack on the streets just to peep that you still in the cage\n\n[Verse 2: Omen]\nWell, it's the oratory vet\nTurned down king slash poet laureate\nUsed to paint a picture with a story of neglect\nI could've been a shorty drinking 40s on the steps\nWith a shorty on my lap\nWith a shorty on the way coming shortly to protect\nI could've been a dealer in the party with the X\nBut I'm hardly in the mix and I partially confess\nI definitely got a couple parts in me that I regret\nIs the cup half-empty or is it half-full?\nI fill mine up with Hennessy, then get back to him\nI'm just a jazz musician trapped in a rap form\nYou think you standing for something you on a trap door\nWell it's the, Mr. Introspective\nI'm a dreamers dream, a sort of an inception\nI never fiend for the scene but I dreamed of the things\nThat a Mercedes brings, like slow sex with fast women\nDrinking cognac I'm past grinning\nA sexy dress, fat ass in it\nBut still hit it till I'm half-winded\nCause niggas tell me I'm the shit when I be hitting all these dimes\nSee I'm caged by the visions of the blind\nI started as a king\nTurned to a slave\nPut us in our chains\nWe was forced to entertain\nThinking bout the present day I'm living off the stage\nWonder if a nigga ever get up out this cage\nAs I sing\n\n[Hook: J. Cole]\nA caged bird (Yeah, a caged bird)\n(Let this little caged bird sing) Caged bird\nYeah, caged bird\nFreedom's just an illusion, that's my conclusion\nAnd if it ain't, then how my niggas keep on losin' theirs?\nThis goes out to childhood friends that's doin' years\nPrison tats on they backs like souvenirs\nWe wish that you was here\nA mother's tear spilled on this page\nA brother's tear spilled on this page\nHow many days left?\nAnd can you find peace when you released\nStill filled up wit' rage\nBack on the streets just to peep that you still in the cage"}], "artist": "J. Cole"}