{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "[Verse 1]\nCali I got it locked up, all my niggas glocked up\nSo you don't need a UBS slip to get boxed up\nI'm a street nigga, baby that's the bottom line\nSo I been a convict before I signed a dotted line\nIt's the rockstar, look at the difference they got him signed\nNow I'm in, turned Hip Hop into columbine\nNiggas gotta eat, and I'm hungry like I never ate\nI fucked the rap game and never took it on a second date\nSigned to Kon Live, now watch my whole worth levitate\nSo if you on the 16, you gone need a better rate\nAs a youngin in the bay, I was on fire fool\nNow I'm double hot, Black Card and a fire pool\nHottest D in the Game, niggas better audible\nI'm sunnin' these rap niggas no biological\nLemme tell you this, if you make it out the ghetto zoo\nBitch niggas hate, real niggas say \"I'm proud of you\"\nI know it's not logical, but something gotta give\nEither you real or fake, clown it is what it is\nPop a tears get your mind right, girl I'm like a klondike\nWhat would you do for your boy and his limelight\nAll I need is nine dykes, lotta ass, my type\nSay they love the pussy, but genitals how they climb pipe\nShoul've been signed twice, matter fact, three times\nSuperstar still on the corner like a street sign\nRock be the fenom, these niggas 'pee-on's\nFee line, you know I shit on every beat I breath on\nCreep like tea pies, pullup in a Neon\nWake a nigga up on the wrong fella to sleep on\nNigga get ya snore on, Imma get my tour on\nPut your helmet on, lace your boots, you in the war zone\nCook him like (di giorno?) pockets on (gordo?)\nHit em up, burner get more play than a porno\nMask down, Zorro! Hangin' out the four door\nYoung nigga squeeze, say cheese no photo\nLand of the loco, where they hop low-low's\nBlack Card boy, bentley wings be the logo\n\n[Outro]\nSittin' in my Cadillac, rollin' with your boy\nNiggas tryna hold us back, but we ain't goin' for it\nRollin' up in an all black tee\nPullin five bullets on the kid\nOn a leather case a nigga trip\nYou better go with that shit\n\n[3x repeat]\nI'm glocked up (Don't make me crowl)\n\nNoooooo! It's Kon Live!\n\nIt's Kon Live!", "title": "Glocked Up"}]}