{"songs": [{"year": null, "image": "https://images.genius.com/b245dff946be15239da702e083f68370.752x752x1.jpg", "title": "New York Giants - Explict", "album": null, "lyrics": "C'mon..\nYeah yeah.. uhh, uh-huh..\n(Oh shit!) Hehehe.. (Ohhh shit!!)\n\nC'mon (yeah yeah) c'mon!!\nUhh, yeah, this is the motherfuckin uncut\nLong time comin, ya heard?\nM.O.P. (c'mon, uhh) Big motherfuckin Punisher\n[Pun] What'cha gon' do?\nUhh.. Terror Squad (yeah)\nBronx.. Brook-lawn collabo'\n[Pun] Yo, yo, yo..\nYa heard me?\n\n[Big Punisher]\nThis is for my twenty-five to life bidders, pork fried rice eaters\nNew York, New York - ice rockin tight wifebeaters\nWe the truth - don't let yo' dead body be the proof\nLeave your Wisdom rottin with holes - and I don't mean ya tooth\nI'm hundred proof, that's perfect percentage\nSince birth I inherit the gift to spit a verse that refers to ya parent\nThe spirit's born, here to bring light to the dawn\nMade right where you starrin from night to the mornin\nPlus the light that give light to Muhammad\nOr Christ how you want it I got what you need\nFrom God to the streets, c'mon motherfucker you talkin to me\nBig Pun!! The papichulo out to screw you\n?? ??, hunchback, like Quasimoto\n\nChorus: Big Punisher, M.O.P\n[Pun] Set off the sirens\n[MOP] Form the alliance\n[Pun] South Bronx, Brook-lawn nigga\n[MOP] New York Giants (c'mon!)\n[Fame] Leave em brainless\n[Danz] Hit em with the stainless\n[Fame] It's the..\n\"World's.. world's.. world's famous!\"\n[Pun] C'mon - violence!\n[MOP] Form the alliance\n[Pun] South Bronx, Brook-lawn pa-pa\n[MOP] New York Giants\n[Fame] Leave em brainless\n[Danz] Hit em with the stainless\n[Fame] It's the..\n\"World's.. world's.. world's famous!\"\n\n[Big Punisher]\nI bring death to your front door like an escort from Hell\nOr ring the bell like you wanna just talk, and just - rock your world\nLike ?? believe me, my Squad get busy if you try to diss me\nCock the glizzy give you one back word to 'Pac and Biggie\nCause my commitee ain't only known for the flowin\nPut they holes in your colon send you rollin like when you're bowlin\nA perfect strike - let me show y'all niggas what I learned from Ike\nI hurt your wife - put the trife ass in the earth aight?\nI'm shootin at you - and that's off the top like Supernatural\n?? ?? turn his moves to statue like Medusa was lookin at you\nClap you with your own heat - by all means\nIf this was L.A., I'd be a motherfuckin O.G\n\nChorus (first 1/2)\n\n[Pun] Violence\n[MOP] Form the alliance\n[Pun] B.X\n[MOP] Violence\n[Pun] B.K\n[MOP] Violence\n\n[Lil' Fame]\nI breaks the world off with a bang (BANG!)\n\"How About Some..\" FUCK THAT! Look nigga, you know the name\nIt's the One slash, Seven One Eight, slash\nM dot O dot P dot, First Family dot\nBoogie Down, Brooklyn (DAMN YOU)\nStep the fuck back, before I get Big Pun to earth-slam you\nI rep for my cellblock niggas\nAnd cats from Puerto Rico, Uptown screamin out, \"Perrico!\"\nYep, this nigga strike, I've survived mad nigga fights\nLil' Fame, insane brain, to fill your gigabytes\nMerc out on machines with loud pipes\nNiggabytes, six-double-oh's, and ?? bikes\n\n[Billy Danzini]\nYou want Seven One Eight Terror (SQUAD), William (DANZE)\nFirst (FAM).. easy soldier!\nI'm not a killer, I just pop a lot\nGrew up in Brownsville, in a brownstone, by a vacant lot\nSeance got - my mind, my body, and my - SOUULLLLLLLL\nOhh! I don't blame you - you switched your gameplan\nWhen you found out your main man was named Danze\nNigga - I'm filled with anger!\nYou fuckin with a hooded soldier, Code Red your life is in danger\n(FIRST FAMILY STYLE) all the way out\nBANG (BANG) BANG (BANG) til your brains hang out"}], "artist": "Big Pun"}