{"songs": [{"title": "Pour It Out", "image": "https://images.genius.com/e909055698b1f5c50eec34b7d688ecaa.300x267x1.jpg", "lyrics": "I've soaked it all in, now I want to pour it out\nI've soaked it all in, now I want to pour it out\n\nI XXX on a soul train in downtown Philly\nSat back in my seat and soaked in the city\nFell asleep and then the train stopped running\nSo I walked the streets until the sun rose again\nIt was unfamiliar territory abandon and a few cars driving by\nAnd people on the corner standing\nThey didn?t acknowledge me so I did the same back\nPlus it was so dark I tried to stay on track\nFollowing the street lights so I can see ahead of me\nAvoiding the dark alleys and probably pass them plenty\nWhere situation could have been deadly\nBut I wasn't a treat to no one just moving alone steady\n\nI've soaked it all in, now I want to pour it out\nI've soaked it all in, now I want to pour it out\n\nI had no clock so time was a guessing game\nI want to go where? nobody knows my name\nXXX XXX's fighting... I wonder who will win\nI'll check the results tomorrow on channel 10\nI saw this girl who looked like a supermodel\nXXX on a runway she's running away\nStanding in one place a car pulled beside her\nWe made eye contact, but neither of us smiled\nIt started raining\nI've tried to block it out in my mind in the sky with some dark clouds\nAnd then I recognize how I miss being home\nBut even there is no different than this\nSurrounded by things that I can't change\nOr maybe I could? if I wasn't searching for the next train\n\nI've soaked it all in, now I want to pour it out\nI've soaked it all in, now I want to pour it out\n\nI was just walking talking to myself\nSomebody asked for change? I didn't hesitate to help\nReached in my pocket... but there was nothing there\nHe looked at me as if I didn't really care\nI just kept moving? the city seemed so alive, but I felt so dead inside\nSo I figured I was hungry? now I'm asking for change\nSometimes we?re so different then we become the same\nThe city moved faster as the sun started to rise\nI wasn't tired or hungry... just wanted to catch a ride\nBut at this point I was lost and confused and I didn't wanted\nTo leave cuz that?s what I always do\nNever around to do something significant\nJust watching from the distance and soaking it in\nAnd that?s why I'm always getting on a train\nBut this time I won't ever be the same...\n\nI wish I could make your problems go away, but I can't even do that with my own\nSo that?s why I'm getting on a train... searching for a place called home\nI wish I could make your problems go away, but I can't even do that with my own\nI think this time I'm going to stay and pour out what I've soaked in\n\nI've soaked it all in, now I want to pour it out\nI've soaked it all in, now I want to pour it out\n\nI've soaked it all in, now I want to pour it out\nI've soaked it all in, now I want to pour it out", "year": null, "album": "Box of Rhymes"}], "artist": "Braille"}