{"songs": [{"year": "2018-10-30", "image": "https://images.genius.com/2e8a0f1744195c85ce77fff6503f4010.1000x1000x1.jpg", "title": "Don’t Say That", "album": "Don’t Think That", "lyrics": "[Intro: BlocBoy JB]\nHa, ha, shh, be quiet\nDon't say that shit around them niggas\nYou know that's there? That's Bloc and them\nThose them niggas that be shootin' shit around the block, shit\nNigga, yeah, we don't wanna fuck with none of them, nigga\nThey don't give a shit if that nigga catch me out\nFor real, for real, for real, for real, for real\nLike, don't say that\n\n[Chorus: BlocBoy JB]\nDon't say that (Word), don't say that (Word)\nDon't say that (Word), don't say that (Word)\nDon't say that (Yah), don't say that (Yah)\nDon't say that (Yah), don't say that (Yah)\n\n[Verse 1: BlocBoy JB]\nI feel like I'm Ricky when I'm in this Maybach (Yah)\nI just went 360, went and got the waves back (360)\nAnd I call your bitch a mattress 'cause I lay that (Lay that)\nShe said BlocBoy made her wet when she got waved at (When got waved at)\nDon't say that (Word), chopper spray that (Rra)\nWhere the AK-47 or the Drake at? (Huh?)\nGet the bitch to set 'em up and find where they at (That's on my mama)\nYeah, I love money but the other thing I love is payback (Facts)\nCall of Duty, tell me where the ray at? (Where the ray at?)\nStars on the roof, I shoot it up, now where your Wraith at (Ayy, where the Wraith at?)\nYou came in here with her, now tell me where your bae at? (Ayy, where your bae at?)\nShe on her knees, she gon' face that, ayy, that's your boo, don't say that (She slurpin')\nOoh, guess she prayed that (Prayed that), head loose, out the Maybach (The Maybach)\nTom and Jerry, when I see a rat, I'ma chase that (Chase that)\nShoes, bitch, I laced that (Laced that), this dick, your bitch crave that (She taste that)\nYou dissin', we don't play that (Huh), ooh, better not say that (That's on my mama)\n\n[Chorus: BlocBoy JB]\nDon't say that, don't say that (Huh)\nDon't say that (Huh), don't say that (Huh, huh)\nDon't say that (Woah), don't say that (Woah)\nDon't say that (Woah), don't say that (Yah)\n\n[Verse 2: Lil Uzi Vert]\nDon't say that, don't say that\nDon't say that, don't say that\nThat's what he said 'cause I know his girl from way back\nHold on, I only hit that thing once like where my cape at, ayy?\nOkay, your nigga, he know I'm the one and he hate that, ayy\nI might just cop me a 'Rari for fun, I'ma race that, ayy\nGirl, your ass fat, ayy, girl, your ass fat, ayy\nI can't chase that, ayy, where your waist at, ayy?\nThey say, \"Why you say, 'Ayy', so much?\", boy, bring that K back (Rra)\nMoney like my uncle, wish they'd bring Nate back, ayy\nNo, no, no, no, you do not have the drop, don't know where I stay at, ayy\nMake her recoup, chicken hid right in the coop, shoot, my nigga BlocBoy, he bang that\n\n[Chorus: BlocBoy JB & Lil Uzi Vert]\nDon't say that, don't say that\nDon't say that, don't say that (Yeah)\nDon't say that, don't say that\nDon't say that, don't say that (Let's go, let's go)"}], "artist": "BlocBoy JB"}