{"songs": [{"image": "https://images.genius.com/d8ac40a7bb579d2ca827620fdc943e1b.707x703x1.jpg", "title": "Jungle", "album": "Strings and Bling", "year": "2018-06-01", "lyrics": "[Intro]\nHuh\nIt sounds so perfect\n\n[Hook]\nI fuck who I want when I want to\nAin't no rules in the jungle\nNiggas gettin' high, gettin' drunk in the jungle\nUsed to get the left over sips from my uncles\nNiggas you should really give a shit, he was humble\nYeah my little niggas got dark where the sun go\nWe was sinnin' in the backyard it was fun though\nWe was young and dancin' with the devil, bitch ya dun know (yeah)\n\n[Verse 1]\nI was prayin' to a fake cuban link, stupid me\nPain to the girl I'm dating now, would you believe?\nAll the little shit they used to say would ruin me\nTurned me to a man and now nothin' is new to me\nMarinate, marinate, marinate (marinate)\nMasturbate addiction in the seventh grade (yeah)\nNow I tell her make that booty levitate (levitate)\nNow she hold my dick up like a accolade (accolade)\nWho let the dog off the leash?\nWho let the wolf see the sheep?\nLet 'em eat right now\nWho wasn’t lame in his teens?\nWho got your broad in the sheets eatin' meat right now?\n(Perfect)\nMy Puerto Rican bitches lookin' colored eksê\nMy colored bitches lookin' Puerto Rican ese\n\n[Hook]\nI fuck who I want when I want to\nAin't no rules in the jungle\nNiggas gettin' high, gettin' drunk in the jungle\nUsed to get the left over sips from my uncles\nNiggas you should really give a shit, we was humble\nYeah my little niggas got dark where the sun go\nWe was sinnin' in the backyard it was fun though\nIt sounds so perfect (perfect, perfect)\n\n[Verse 2]\nI'm a hoes nigga, not a hoe nigga\nPS4 nigga, I control niggas\nIvyson religion, watch your tone nigga\nI'm on the phone with a gorilla\nI can't take no shit, I take a joke nigga\nI was diggin' my grave and found gold, nigga\nI’m the future you are talking to the bones, nigga\n(God damn)\nEase up\nPinky, ears, neck freeze up\n(Damn that nigga blingin')\nHe's a\nMonkey with some  diamonds, oh good Jesus\nFuck goin' broke and givin' up, threesome\nApes stick together 'cause we are a people\nAnd I know that lyin' is below me but if my nigga say he don't know, I'dont I'dont know either, bitch\n\n[Hook]\nI fuck who I want when I want to\nAin't no rules in the jungle\nNiggas gettin' high, gettin' drunk in the jungle\nBitches gettin' high, gettin' drunk in the jungle\nNiggas you should really give a shit, we was humble\nYeah my little niggas got dark where the sun go\nWe was sinnin' in the backyard it was fun though\nWe was young and dancin' with the devil, bitch ya dun know\n\n[Outro]\nJungle"}], "artist": "Nasty C"}