{"songs": [{"image": "https://images.genius.com/55c6bfb6928ee69fa076f8f2a3218981.700x700x1.jpg", "lyrics": "[Verse 1]\nBoldly go only to sew the block up, lock shit down\nMama told me you the giant\nBump out the nose cold, crime wave wholesome\nBaritone throne, so defiant\nThey stole the science from the O.G\nCarbon copy, sloppy, tryna muscle out the Old E\nSlapshot, can't get it past the goalie mask\nStonefinger roam, royalty zone off\nHenn, gin, rummy stunts coming in sums\nWriting on ya tummy hun, low stamina\nStill hungry some asthma clogged up\nRan in smog, dialogue, dog plasma\nRoad hogging all hammers\nNo matters what's the track's right and exact\nIt's madness the scanner listen, system jam up\nRight on ya rack, Black Panthers on a mission\nRight back at you, ready to cook this shit\nBabylon apple, natural habitat, stone statues\n\n[Verse 2]\nRobotron Golden Arms\nPentagon brain cell, all to gain\nChained to the bumper, Wolfgang hunters\nField goal punters tone, steel toe, eruption\nIt's a gusher! Domecrusher Smith\nUshered this style stuffing more criminals\nFoul up in the Nile, let off a signal with attitude\nMagnitude, beat you, me devil lies that's sized of cathedrals\nThe track more lethal\nCame back to see you finish the job off proper\nClobber your shit, spit the lava\nThe helicopter hit you, flying saucers of course\nMay the force not be with you, these Bengals that dangle\nSinister phantom menace handsome are my lenses\nAll in the register, speaking my Spanish\nClips like banana grips, bonanza\nDressed fancy in the club, Halle Berry slow dance\nWe romance now give me love\n\n[Verse 3]\nJackie Chan movements, hard to kill for real\nDrill him some more with some\nOld fashion smooth shit, long winded\nSplendid the bomb blow, on the whole a ruthless\nButter roll flow, show improvement?\nThis shit is cool whip to me\nWhen I groove to rule this music with a mule kick\nEight ball in the side pocket corner\nOne mark the chalk, gimme my pool stick\nSmoked the dipped\nNotes by the throat, full grip, scud puddy in my hands\nFans, read the blueprints\nThe truth is, the slang you bit?\nTo form in a sentence the cold winters I spent with splinters\nThe apprentice under RZA's training\nHe sang the I-Ching vintage aiming at you swine eater\nWife-beater scoundrels, stolen vowel thieves\nI'm swollen now, Colin Powell relief\nThrow the towel in, tools in, full spin, school 'em again\nShow 'em that the wise could rejuvenate\nAll these hoodlums, don't sleep he could win\nPull a pen, it's full again, celeb, all in the web on a\nConquest, no disturbance\nAddress it to ya chest, you're in turbulence\nMighty men vitamin D\nRest in Peace to my nigga Bigga B, love you G\nRest in Peace to my nigga Bigga B, love you G", "title": "Turbulence", "year": null, "album": "Golden Arms Redemption"}], "artist": "U-God"}