{"songs": [{"year": null, "title": "Different", "image": "https://images.genius.com/ac9e0f11c62005e2d424955c950a2944.300x300x1.jpg", "lyrics": "\"Nothing at last is sacred. Oh how the great have fallen\nWhat have I done to myself? It's been way too long!\"\n\nWe need to reacquaint. Things are different now, I ain't the same man I was\nHi, how are you doing? I'm new and improved with even less to lose\nA collector's edition version of a virgin drink ordering cocktail teller\nGone way wrong...to the point of no return\n\nOver the edge and burned out before I even got my shine\nHolding my head in pure doubt\nOut of insight. Out of mindful things to shout or rhyme about\n\nYeah, I know I was supposed to change the world and all\nLooks like the world got to me first\nIf you can't beat em, join 'em..\nThen hurt the team by beating yourself\n\nI'm different...in a different way\nThe only thing that stays the same is change\nWhile people claim their states, I state my claims\nSage Francis made a name for himself\nFor the record my mother calls me Paul\nWhich was my father's middle name, but Ray\nStepped in and raised me\nIt's crazy, but this is a game I play\n\nCalled \"Shut the fuck uuuuuuup!\"\n\nDon't bother calling me at all because I'm not answering\nIs that a voice-mail-bomb-threat or her broken promise I'm mishandling?\nGambling away my money issues, somebody owes me big bucks\nMy career depends on explosive vacuums sucking me in and blowing me up\n\nPoetry struck a nerve in the listenership\nSpoken word then got 'em all interested\nNow I don't have to serve ice cream to little kids\nI get to serve emcees who think they're rippin' it\nAnd poets who think they're somehow significant\nMeanwhile both are loud and ignorant\nAnd don't know how to speak to a crowd in an intimate environment\n\nI am different. In a different way\nThe only thing that stays the same is change\nWhile people claim their states, I state my claims\nI'm a quiet natured player who outwardly hates the game\nI shake what I got, which is a jingly pocket\nDo my mini-market research and make noise for myself when I walk quick\n\nI talk with authority while I question it\nWhen I ask, \"Who am I?\" I'm left guessing\nBut if you're a poor man's version of ANYTHING\nIt is your self-perception\n\nGrowing up in a microscopic town prepared me well for this petrii dish\nWhere talk is invisible to the naked eye and I hate the guy they're speaking with\nI'm a real vegetarian: No chicken...not even fish\nI'm a real underground rapper\nMy tape quality sucks, my records are warped and my CD skips\n\nLady Luck is a greedy bitch with itchy palms and a case of the gimmes\nBut I've got an outtie if she's got an inny\nI'll clean her pipes and then sweep her chimney\nThe beat that's in me is polyrhythmic. You're only 60 heart beats per minute\nA human second-hand-me-down-to-earth-guy who will thriftshop-lift his hiphop\n\nI may be getting too big for my britches\nBut I paid my dues when the cost was climbing\nAnd if I burn too many bridges I'll never get off of this awful island\nAs long as I've been rhyming, they only started listening\nBecause for a while they didn't like how\nI wouldn't smoke the pot that I was pissin' in\n\nPlus I had no dead homies to pour out the liquor I don't drink\nYou can flash your shiny objects in front of my eyes and I won't blink\nI'm motherfucking different. Oooohhhh yyyeeeaaahhhh..\nI'm motherfucking different. Oooohhhh yyyeeeaaahhhh..", "album": "Personal Journals"}], "artist": "Sage Francis"}