{"songs": [{"year": "2005-06-01", "album": "Training Day", "image": "https://images.genius.com/0d736130ef89ba0b866b3b01fad325c1.500x500x1.jpg", "title": "Blood Sport (Freestyle)", "lyrics": "[Intro, Clip from Denzel Washington in Training Day]\n\n[Intro: Kendrick Lamar]\nThis is a public service announcement\nWe call it Blood Sport\nI had to do one too, I sorry! I'm a competitor\nOh my god it about to get hideous\nI hope ya niggas know you history\n\n[Hook: Kendrick Lamar]\nHomie go ask Doc (talk about me)\nHomie go ask Nas (and he'll tell ya)\nHomie go ask Jay (young fella)\nBut when you ask them all (don't be jealous)\nI'm the best in LA. In LA\nOr wherever the fuck that you stay\n\n[Verse 1: Kendrick Lamar]\nIt's all copastetic. Hip-hop no longer face Armageddon\nCall me Bruce Willis\nNo call me lieutenant tinted windows on the black benz\nSo they only see it late nights like Jay Leno\nI fuck twice your girlfriend probly told you we can't fuck\nNo she lying\nOh my god I am the best rapper under 25 you can underline it\nYou abusing the game you defiant\nDisobedient student need attention\nHave parent conference I'll be there, Just let me know what classroom you in my son\nI am Dwyane Wade of recording\nYou more like Kobe Bryant with no endorsements\nThat's like Shaq at the freethrow, pointless\nI'm equivalent to a Earl Boykins, Spud Webb, Muggsy Bogues\nI suppose I handle the rock well\nI do hoes like Stockton and Malone: make my pick then roll\nThe ugly ones go to Sam Cassell\nYou washed up like Nick Van Exel.\nShawn Kemp, Robert Parish, John Salley whole career on the bench\nLet's get deeper in these NBA statistics\nMy team something like the retro Celtics\nWhich means consecutive championships\nWhich means I'm Larry Bird's equivalent\nTo the way I do a verse he handle the ball\nThe same way I handle it with no pen\nI call Jay Rock when I wanna dish it off\nHe bang like Vince Carter when he first saw NBA Court\nAlley oop the court let him do what he want\nBang. Aw fuck it let's talk more sports\nHow bout football?\nI run the game like Walter Payton back 1984\nI'm pass you niggas like Peyton Manning\nPlay the field like Ray Buchanan\nWhen I kick it like Morton Anderson it gets scary\nWeight on my shoulder, refrigerator Perry\nHip-hop cops on me I dodge them like Barry\nSanders... John Madden hold your commentary\nKeep the cameras on I'm primetime like the '95 Deion\nShould I keep going?\nAw fuck it let me keep going\nI'mma do it like the '97 T Owens\nNot the ‘07 T Owens\nT Owens with Jeff Garcia throwing the pigskin\nY'all need to work on y'all defense, I train like Warren Sapp on the weekend\nManeuver like Warrick Dunn\nI'm just having a little fun have some with me\nLet's go baseball now the '94 Ken Griffey\nOne man roster matter fact I'm the '96 Mike Piazza\nMVP of LA, call the doctor\nI came up with my assumptions I must be rap ESPN or something\nIt’s about time for halftime reporting\nI’m a star kicking niggas off the field and court man\nI know you good with the right but you still ain’t nice till you do it with the left hand\nYou ain’t nice till you play all positions\nOr knock it out the stadium, hey wait a min\nI got tickets to the all star game, to pro bowl game baby girl bring a friend\nI’m a get you in, I’m a take you out, I’m a stick it in\nYou might say… ouch\nJust let me score one time\nDribble my balls to the floor one time\nI’d be going for a week bet they gon’ miss me more than a pitch from Nolan Ryan\nI am the Jeff Gordon of recording\nI am Tony Hawk if I was skateboarding\nI am Michael Irv before the coke snortin'\nAw fuck it I’m what’s ever important\nAfter this you gon applaud him\nIf not, fuck it I’m blood sportin'\nHomie I’m blood sport…\n\n[Outro: Kendrick Lamar]\nYa’ll niggas ran out of time to get ya’ll shit together man\nI’m here\nHey, hey, hey, hey Moose what I gotta do boy"}], "artist": "Kendrick Lamar"}