{"songs": [{"album": "Activated", "image": "https://images.genius.com/dbf64d5289adc1fb1c700f63f63dfe25.945x945x1.jpg", "year": "2018-05-04", "title": "Fuck It Off", "lyrics": "[Intro]\nHelluva made this beat, baby\n\n[Verse 1: Chris Brown]\nWho you think you finna play with?\nWho you think you finna run your mouth to and won't say shit?\nI'm outchea when it's cold, leave you out there\nThem bullets hot, think not, get your mouth chipped\nHella nigga's talk shit but they stand still\nLet's take a trip, duct tape, how the van feel?\nHunnid thousand dollar Cartiers, I'ma change shit\nKeep playin' with Liu Kang, I'ma kick it to your main bitch\nAnd I've been fuckin' hoes on my bae shit\nCome to the crib, I tell 'em go to the spaceship\nRed pill, blue pill, we in The Matrix\nTake it to the face, better do what I say, bitch\nHe make it outta here then he a winner\nIf a nigga try to run then we pull up in Sprinters\nWe get to bustin' at your bucket, fuck it hit 'cho liver\nEnd of discussion, it's nothing, I eat you pussies for dinner\nI got no time, for fake ones, killers on the west side, with them real guns\nAnd if you try to wave the white flag, we gon' still come\n\"Where you at? Here, nigga!\" All this pussy I'ma drill somethin'\n\n[Chorus: Chris Brown]\nWhy they hate to see a real nigga make it?\nI done made a lot of change, now my people's changin'\nBy myself, I don't need no witness\nCan't thank nobody but the Lord 'cause I'm gettin' it\nI keep my head up and middle finger to the sky\nAnd living every fuckin' day like it's Mardi Gras\nI'ma finesse this shit, win, lose, or draw\nYou think I work this hard to fuck it off?\n\n[Verse 2: Tee Grizzley, Chris Brown & Both]\nOnce again, I gotta remind these niggas\nBalenciaga, 'member when I couldn't buy these, nigga\nCalled 'em bricks birds 'cause we really fly these bitches\nTell your mans I know I'm lit, but don't eye me nigga (oh, woah)\nI'm solvin' every single problem with a tool\nSupersoak a nigga like he jumpin' off the pool\nIf the feds hit the mansion, we gon' make it to the news\nChoppa lift a nigga up, I bet he make it to the moon (pow)\nYou can tell me and Breezy at the top\nThey want us to fail, hopin' that we fall but we not\nDon't feel bad for what I did to them nigga's block\nCan't say what happened, just know I had to get rid of the Glock (oh)\nRemember my lick days, couldn't pull a bitch days (oh)\nNow I ain't trippin' on none of the bills, that shit paid (ooh woah)\nNigga tried to fake beef with a nigga (that's just hate)\nSneak dissin' me, see me out, jump on my dick, these niggas lame\n(Oh, pussy nigga) aye, nigga's terrible, who raised y'all?\nNigga's leeches I can't feed 'em, I can't baby y'all (you need to fuck off)\nI'm giving headshots, I ain't 'bout to fade y'all\nBitch you ain't fuckin', bye Felicia, I can't play with y'all (woo)\n\n[Chorus: Chris Brown]\nWhy they hate to see a real nigga make it?\nI done made a lot of change, now my people's changin'\nBy myself, I don't need no witness\nCan't thank nobody but the Lord 'cause I'm gettin' it\nI keep my head up and middle finger to the sky\nAnd living every fuckin' day like it's Mardi Gras\nI'ma finesse this shit, win, lose, or draw\nYou think I work this hard to fuck it off?"}], "artist": "Tee Grizzley"}