{"artist": "Cadet", "songs": [{"title": "Ooouuu (Remix)", "album": null, "year": "2016-11-24", "image": "https://images.genius.com/1f0a84d8ee3806d15e664a7079ffbcc4.600x600x1.jpg", "lyrics": "[Intro]\nFeeling like\nSauce dripping off me like\nRunning, running through, running through these women like\nU-u-u-underrated legend like\n\n[Verse 1]\nYeah they hate, but they broke though\nAnd when it's time to pop they a no-show (nah)\nYeah, I'm wavey and I'm loco\nAnd drinking Henney straight got me slo-mo (Cadet, Cadet)\nLet me get into my flow bro\nSouthside nigga man, I'm known in every postcode\nHow I get my girls mixed up, I don't know bro\nCalling bitches by the wrong name like a MOBO (aah!)\nMelanin and glow glow\nThey ain't fucking with the team, they oppose all\nOh, you're better than who? Let me challenge him\nMake a nigga freeze quick, have him doing mannequin (freeze!)\nAyo Stitchy, why these testing me? (why?)\nLike I ain't got stripes like a referee (nah?)\nLike I ain't got a hitter to the left of me (aah!)\nSo best behaviour, yeah they better be (be on their!)\nIf that's your girl, then why she texting me? (why?)\nWhy she message me? Everyday stressing me (stress)\nI told that bitch, \"only holler when there's neck for me\"\nYou call her Stephanie, I call her Neckanie\n\n[Hook]\nFeeling like ooouuu\nSauce dripping off me like ooouuu\nRunning through these women like ooouuu\nUnderrated legend like ooouuu (aah!)\nFeeling like ooouuu\nSauce dripping off me like ooouuu (Cadet, Cadet)\nRunning through these women like ooouuu (Cadet, Cadet)\nUnderrated legend like ooouuu\nOoouuu\n\n[Verse 2]\nYeah they hate, but they broke though (Cadet)\nAnd how you talking money when you owe though?\nYoung M.A with the flow bro\nMoney low low, I keep it dough low (low low)\nYo Yego, where them hoes bro? (where them hoes bro?)\nHow you bring me out if there ain't hoes though? (how?!)\nOh, you selfish with the hoes bro? (selfish)\nEvery time I get a hoe, you get involved though (you get involved though)\nTryna get it by the boatload (boatload)\nAnd disrespect the squad, that's a no-no (that's a no-no)\nSquad really on the go-go (on the go-go)\nGot arms round man like a chokehold (that's a chokehold)\nHaters on my body, shake 'em off (shake 'em off)\nHaters on my body, shake 'em off (shake it off)\nHaters on my body, shake 'em off (I shake 'em off)\nHaters on my body, shake 'em off (shake 'em off)\nI don't open doors for a jezzy\nI just want the neck, not the belly\nMy Cartier better than your Rolex (uh?)\nIt will trump yours, but it ain't a prezzy (that's wordplay!)\n\n[Hook]\nFeeling like ooouuu\nSauce dripping off me like ooouuu\nRunning through these women like ooouuu\nUnderrated legend like ooouuu (aah!)\nFeeling like ooouuu!\nSauce dripping off me like ooouuu (Cadet, Cadet)\nRunning through these women like ooouuu (Cadet, Cadet)\nUnderrated legend like ooouuu\n\n\n[Outro]\nOoouuu\nFumez the Engineer\nOoouuu\nOoouuu"}]}