{"artist": "50 Cent", "songs": [{"album": "The New Breed (Bonus Disc)", "image": "https://images.genius.com/6f53516b0687bec48ba8859fb84d74bc.499x499x1.jpg", "title": "8 Mile Road (G-Unit Remix)", "lyrics": "[50 Cent]\nYeah.. 50 Cent, Lloyd Banks, Tony Yayo\nG-UNIT!\n\n[Lloyd Banks]\nThis rap shit plays a major part in my life\nSo if you jeapordize it I got the right\nTo send a mothafucka at you tonight\nG-Unit! And I ain't stoppin' till my clique poppin'\nSwimmin' in barrels of money\nMa can walk around with her head up, cuz her child ain't a dummy\nIt's funny, niggas would rather see you sufferin' and hungry\nI'm comfy as hell, skatin' with another nigga's money\nYou lyin' your ass off, you know you ain't that tough\nI'm pullin' your mask off as soon as you act up\nYou know what I came for, a piece of the game, or\nArtillery that's about as long as a chainsaw (Lloyd Banks!)\nI'm wide awake but it still feels like I'm dreamin'\nForty cal. under my pillow, condom full of my semen\nThe physical presence of a female's the form of a demon\nThat's why I, fuck 'em and leave 'em\nGet my nut while I'm breathin'\nCause they thought they'd catch me slippin', now I'm duckin' and trippin'\nThat's a thousand dollar outfit what the fuck is you rippin'?\nYou trippin', more records could get my ass in position\nDeath waits for no religion whether Catholic or Christian\nListen, I went through Mama bitchin' in and out the kitchen\nWith probable cause, Papa was in and out of prison\nYou got soldiers, but you still gotta respect ours\nWe got more four five's and nines than a deck of cards\n\n[Tony Yayo]\nYou can take me out the 'hood, but can't take the 'hood out me (Cause what?)\nCause I'm ghetto, I'm ghetto\nNiggas hate when you do good\nBut when you broke, your friends and your enemies\nThey love you, they love you\n\"Chi Chi, get the yayo\"\nPicture me being crack, out of town, trips on the train, What!\n\"Chi Chi, get the yayo\"\nPicture me being crack (Tony Yayo!)\nYou can sniff me, cut me, I'll turn you to a junkie\nI'm the number one seller in the whole fuckin' country\nWall Street niggas, they cop me on the low\nWhite boys don't call me coke, they call me blow\nIt's time to go, on the bus, the train, the plane\nI'm smuggled, I'm nothin' but trouble\nI'll make your money double\nCook me in baking soda\nI'll turn your Hooprock into a new Range Rover\nI'll pay all your bills and fill your 'frigerator\nFeed your family, turn your man to a hater\nYou can put me in your door panels or your stashbox\nPut me in your Nikes, Timbs or Reeboks\nIf you cop three and a half you hustling backwards\nCop a hundred grams, you moving forwards\nYou tryin' to move more birds\n...In PA all day, on the corner of Third\n\n[50 Cent]\nYou can take me out the 'hood, but can't take the 'hood out me (what?)\nCause I'm ghetto, I'm ghetto\nPicture me polishin' pistols, I'm comin' to get you\nThe shells hit you, you screamin'\nThink I'm playin'? I mean it\nMan, I done bought all these pistols\nLets get it poppin'\nStart to wave em and boy shell cases get to droppin' (C'mon)\nIf Jeffrey's down the corner, I got too much pride to hide\nI'm outside, gun in my pocket just stunnin' I'm stoppin'\nI'm dyin' to pop it, I'm young and I'm restless, you know the contestants\nAs the world turns, there's lessons to be learned\nCount all my blessin's, clean up my weapons\nI'm ready for war, the strong survive, the weak shall perish\nI told you before, hoes they compliment me now like \"50 nice chain\"\nBelagio, twenty grand in chips at the dice games\nBallin out, can't stop gotta watch MTV, BET\nNigga you see me!\nI wonder if you mad, cause I'm doin' good\nOr cause niggas feelin' me more than you in your own 'hood\nAnd it hurts cause you love 'em and they don't love you back\nCause they know you just rappin' and you don't bust a gat\nYou pussy\n\nYeah, explain it to the niggas in your hood nigga\nThey know you fuckin' frontin' nigga\nTalkin' all that gangsta shit on a record, I see you nigga\nNiggas know me nigga, ask around in my 'hood nigga\nRead the \"Daily News\" nigga you see them talkin' about me nigga\nI'm in the middle of all kinds of shit\nPussy, lets get it poppin'\n\nG-G-Unit, G-G-Unit, G-G-G-Unit, G-G-G-G-G-G-Unit, G-Unit!", "year": "2003-04-15"}]}