{"songs": [{"title": "I’m Just Askin’", "album": "Larry TWO", "year": "2017-02-10", "image": "https://images.genius.com/93787442156a90b2fbc46eaa2b6d8408.1000x1000x1.jpg", "lyrics": "[Verse 1]\nI figured I could get it cheaper if I go and hit my plug out in Puerto Rico\nFifty cal desert eagle get to squeezing when a nigga feelin’ evil\nBig smile on my face when I look over, see the trap phone ringing\nWhere was you nigga when I didn’t have shit, now you’re comin’ with opinions\nI was taught growin’ up that I’d never have to answer to another nigga\nI was taught growin’ up that you never roll with niggas that be in they feelings\nUps and downs in the trap game got me trappin’ hard, turned me to a menace\nI’m vacayin’ on an island but my money still workin’ on the fucking west\nI got two niggas, Smith and Wes’\nI don’t give a fuck about a threat\nDoin’ donuts in the ‘Vette\nYellow diamonds on my neck\nRide ‘round, mind gone, can’t even think, nigga too high\nTwo trap spots, two trap phones, goddamn, nigga too fly\nI checked the mail like two times\nYeah I’m waiting on that pink slip\nI hit the chopper with the rubber grip\nLately I been on some other shit\nDamn\n\n[Hook]\nSometimes I ask myself is this really living?\nIs this real life? got a nigga trippin’\nI’m just asking\nI’m just asking\nSometimes I ask myself is this really living?\nIs this real life? got a nigga trippin’\nI’m just asking\nI’m just asking\n\n[Verse 2]\nRiding by myself ‘cause I don’t trust niggas\nOld hating ass nigga, I hope a bus hit ya\nDope man, dope man, got it for the cheaper\nChop down, chop down\nRide around with a MAC, gotta move different when you really havin’ money\nCheck that boy for a wire, nigga acting funny, nigga I don’t really trust him\nFour five wrapped in a towel, had to grab mine, heard them niggas coming\nFN with the skinny nose, got it sounding like a rock band drumming\nI been out of my mind\nBae I gotta go now\nI been working so hard\nIt’s all a nigga know now\nRocking Bally’s on my way to valley\nOther bitch Italian, only feed her salad\nOn my way to Vegas, nigga fuck the mileage\nChopper break ya, sounding like you’re switching classes\nI’m going steady so my check advancing\nOrganized crime got me living lavish\nOverseas banking, got a few accountants\nPut my bottom bitch in a new Audi\nTriple eight white tee but that neck hit for like twenty-five thousand\nBounced out on a renegade like what’s up ma, need all of that\n\n[Hook]\nSometimes I ask myself is this really living?\nIs this real life? got a nigga trippin’\nI’m just asking\nI’m just asking\nSometimes I ask myself is this really living?\nIs this real life? got a nigga trippin’\nI’m just asking\nI’m just asking"}], "artist": "Larry June"}