{"songs": [{"title": "WTF", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Verse 1: Jay-Z (Nas)]\nI got these niggas breezy, don't worry about it\nLet that bitch breathe\nI used to give a fuck, now I give a fuck less\nWhat do I think of success? It sucks, too much stress\nI guess I blew up quick\nCause friends I grew up with\nSee me as a Premie but I'm not and my nuts big\nI don't know what the fuss is, my career is illustrious\nMy rep is impeccable; I'm not to be fucked with with\nShit, let that bitch breathe\nI'm way too important to be talking about extorting\nAsking me for a portion is like asking for a coffin\nBroad daylight I'll off your on switch\nYou're not too bright, goodnight long kiss\nBye bye my reply... BLAH, BLAH\nBlast burner then pass burner to Ty-Ty\nFinish my breakfast, why?\nI got an appetite for destruction and you're a small fry\nNow where was I?\nLet that bitch breathe\nI used to give a shit, now I don't give a shit more\nTruth be told I had more fun when I was piss poor\nI'm pissed off, and is this what success is all about?\nA bunch of niggas acting like bitches with big mouths\nAll this stress, all I got is this big house\nCouple of cars, I don't bring half of them shits out\nAll of this Ace of Spades I drink just to piss out\nI mean I like the taste could've saved myself 6 thou's\nHow many times can I go to Mr. Chow's, Tao's, Nobu\nHold up, lemme move my bowels\nI'll shit on y'all niggas, OG tell these boys\nYa'll ain't got shit on my nigga)\nI got watches I ain't seen in months\nApartment at the Trump; I only slept in once\nNiggas said Hova was over, such dummies\nEven If I fell I'll land on a bunch of money\nYa'll ain't got nothing for me\nLet that bitch breathe\n\n[Verse 2: Nas]\nSuccess, McLaren, women staring\nMy villain appearance\nSacred blood of a king and my vein ain't spilling\nGhetto Othello, Sugar Hill Romello\nCamaro driven, I climax from paper\nThen ask why is life worth living?\nIs it to hunt for the shit that you want?\nTo receive's great, but I lust giving\nThe best jewelers wanna make my things\nI make Jacob shit on Lorraine just to make me a chain\nNiggas mentioned on One Love\nCame home to the paper in hand\nAin't gotta brag about the Feds young man\nOld cribs I sold, y'all drive by like monuments\nGoogle Earth Nas; I got flats in other continents\nWorst enemies wanna be my best friends\nBest friends wanna be enemies like that's what's in\nBut I don't give a fuck walk inside the lions den\nTake everybody's chips, about to cash them in\nUp your catalog dog, mine's worth too much\nLike Mike Jacks ATV pub, Mottola can't touch\nLet this bitch breathe\n\n[Jay-Z & Nas]\nLet this bitch breathe", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}