{"songs": [{"title": "Ex-Boyfriend", "album": "So Hard", "year": "2013-04-25", "image": "https://images.genius.com/701a46350909affbfec12488b53a9b66.500x500x1.jpg", "lyrics": "[Intro]\nAyy, what's going on, man?\nIt's your boy, Lil Dicky\nAKA Mr Leftward-Sloping Penis\nI got a story for y'all, man\nPeep this\nYes sir! A'ight, let's go\n\n[Verse 1]\nNow I been dating this girl named Katie, she hot as hell\nAnd her body crazy, vagina shaven and it don't smell\nAnd I don't fall for chickens\nBut this one a little different, body sickening\nPlus, she really good at making breaded chicken\nGot me thinkin she the one, man\nEven fully clothed, shawty really fun man\nGet a lotta hoes, but none of those come close\nI swear this the most that I've felt so damn exposed\nOh yeah there's one more thing\nAnd I know this shit gonna sound insane\nBut I still haven't hit it\nI admit it, I wish I was kidding\nNever been up inside before\nBecause she's only fucked one guy before\nAnd though I really wanna boink this whore\nShe my sweetie 3.14\nSo I'm stayin patient and masturbating\nAnd now my heart is sorta racing\nCause she said tonight will be the night we do some fornicating\nHell yeah, I'm down, I'm 'bout to go all out\nI'm gonna pound that crazy, like an elaborate black man handshake\nBut on the way to crib, we pass this kid\nAnd he seem to know who Katie is\nSo I say \"Who this?\" and she say\n\"Dicky, this is my ex-boyfriend Jim!\"\n\n[Chorus 1]\nAnd I ain't usually the one to be the jealous type\nBut as I'm looking at this dude, I can't believe my eyes\nCause he's the best looking guy that I've seen in my whole life\nHe's got the thickest head of hair, chiseled jaw, an egregious bod\nMan, this the closest thing I've seen to a Grecian god\nAnd now I'm lookin at my chick, cause his dick's been inside her raw (fuck that!)\nAw, damn\n\n[Verse 2]\nMan this is crazy\nI can't believe this guy used to fuck my lady\nI bet he left that pussy ravaged like Haiti\nKatie's hugging and squeezing his shoulder blades\nAnd I'm buggin and queasy, this ain't okay\nAnd then they say, \"Let's get drinks\" so I say \"Okay\"\nEven though I was about to get laid!\nMan this muhfucker look like Ashton\nCombined wit a lil Hugh Jackman\nIn other words, he's so damn attractive\nSo damn tan, he gotta have a little black in him\nNow I'm in the back wit him, sippin on some 'gnac wit him\nAnd he payin for it all, he investment banking\nI'm acting like I ain't distracted\nBut I'm reenacting him and Katie bangin'\nAnd now I'm feelin' pissed, so I go and take a piss\nMidstream, I look left and guess who it is\nAnd I had to see, and I was mad discreet\nAnd I got on my tippy toes and I took a little peek\n\"Oh my god becky, look at that cock!\"\n\n[Chorus 2]\nAnd I ain't usually the one to be the jealous type\nBut as I'm lookin at his dick, I can't believe me eyes\nBecause he's got the biggest cock that I've seen in my whole life\nAnd now I'm starin at this dude's soft dick with a lot of hate\nBecause the shit is plus 8 like Jon and Kate\nAnd I don't know if I can date my girl after tonight\nAw, damn\n\n[Verse 3]\nI don't know what to do, dude's dick is really huge\nI didn't realize a penis could be so smooth\nI know she's missing that, my penis isn't that\nI'm looking closer, I think that his dick has abs\nSix pack on a dick, now what the fuck is that?\nIt's so long and thick, It's like a punching bag\nI'm saying it's so shaven, head is amazing\nGot my dick looking like a raisin\nSkin tone insane, man he's hung like Saddam Hussein, it's crazy\nWhat the fuck should I do?\nHe gotta Ruth's Chris dick, and mine's a drive-thru....\nI think it's time to tell Katie my goodbyes\nCause I simply can't survive\nAfter seeing what was in between his thighs\nSo I tell her\n\n[Chorus 3]\n\"That this dude's got a dick that I don't comprehend\nI had to move my neck to see it end to end\nI mean the physics of his dick just don't make any sense\nAnd I think it's for the best if this comes to an end\nBecause the sex with him must have been the best\nAnd I would say let's just be friends\nBut I think I would just think about his dick all the time, so goodbye\"\nThen she told me, \"Dicky, I don't really know what to say\nBecause I dated this dude in second grade\nSo I don't know about his dick, now let's go home and get you laid\"\n\n[Outro]\nAnd then I took her to my crib, and you know that we belly slapped\nAnd I gave her an O like I was selling crack\nAnd when I came, I pulled out and nutted all over her left thigh\nAnd upper mid-section region, you can call that the pelvis\nSome would even call that the pubic bone\nLeave the pubes at home, making this up on the spot\nFuck you know about it?\nI'm about to go papier-mâché my dick and ride it\nAw, fuck, I think I just actually said I was about to\nMake a papier-mâché version of my own dick and ride it\nAnd I could understand how that, that could sound gay\nBut, like, you gotta realize that I was just freestylin'\nSo like I wasn't really in control of what I was sayin'\nAnd, I mean, 'cause it ain't me, I, I\nReal rap I am about to papier-mâché my dick, I won't even lie about that\nI got, you know, the ingredients is right in front of me like laid out\nLike, no bullshit, newspaper\nI don't even know what the fuck you would call that shit, putty I guess\nIt's about to get real sexual up in here, huh\nBut I am not gon' ride it, that, that ain't me\nI mean that's how I free, it came off the, the, the brain\nYeah, you know, if I, if I was thinkin' that then it is what it is but I, I, I ain't gon' act on it\nHeh, you know what I'm sayin', I ain't gonna act on that shit\nBut I am about to put that shit on the wall, though\nThe, uh, the papier-mâché, cast mold of my dick, so, there's that\nAll right, holla at me"}], "artist": "Lil Dicky"}