{"songs": [{"year": "2001-10-16", "image": "https://images.genius.com/8af6cd69d2d9ed7258d80228afce41de.220x220x1.jpg", "title": "U Can’t Hurt Me Now", "album": "1 Less G n da Hood", "lyrics": "[Intro]\nYou're about to hear the tale of an indestructable man\nHe's dead and he's pissed\nHe's roamin the streets at night lookin for ways to die\nShould you encounter him, the undead, the dead ass zombie\nDo yourself a favor and get the fuck out\n\n[Verse 1: Blaze]\nB to the L to the A-Z-E\nBitch muhfucka, you can't hurt me\nIf you break my legs, then I break your back\nRelax and kick back in a bed of thumbtacks\nMatter fact, you can slit my throat\nSpill blood on my leather Psychopathic coat\nI'mma laugh in ya face, you can't kill a dead man\nYou can try...., I'm serious, you can\nUnder my jersey, bullet holes bout the size of Milwaukee\nYou better step up off me\nPale faced with the maggots all around\nI leave a couple few off in each and every town\nMy leg falls off every other day and shit\nBut I'mma try superglue, a hair apiece sticks\nSo who you lookin at and what'chu gonna do?\nYou can try to kill me, I'mma sho' gon kill you\n\n[Hook: Jamie Madrox]\nYou, you can't, you can't hurt me now! (Ain't shit you can do)\nAin't nothin stoppin me from killin you!\nYou, you can't, you can't hurt me now! (Ain't shit you can do)\nAin't nothin stoppin me from killin you!\n\n[Verse 2: Blaze]\nI ate a pack of firecrackers (Did it Mix)\nWhen I piss, sparks shoot straight outta my dick\nGet the picture before I stab you with the knife\nBut you can't take somethin that I don't have nothin of, right?\nThat's right, I'm more than a ghost\nI still slang ki's on the corner by the light post\nI can't walk the walk\nBut I stray scarin more ho ho's than santa claus\nI been electrocuted, it ain't do shit\nExcept fucked a bare hands outta tiny [?]\nI get ran down then I get back up\nPissin down like a crackhead, curled up\nMy eyes swelled up and I can't see straight\nThen I dive off the overpass on to the interstate\nWho you lookin at and what'chu gonna do?\nYou can try to kill me, I'mma sho' gon kill you\n\n[Hook]\n\n[Interlude: Anybody Killa]\nYo, this is Anybody mothafuckin' Killa! This crew don't feel pain!\nWe Psychopathic! Especially my dead homie Blaze!\nTell me, how the hell a dead mothafucka gonna die!!!?!??!\n\n[Verse 3: Blaze]\nI drink liquid scar, cuz I like the taste\nAnd thug on police till they mace my face\nWent to the White House, pissed on the grass\nStep to the President's wife to get some ass\nEat Halloween candy, blades in the center\n\"Man how you be so mean?\" , I can't remember\nMy throat got cut but I sewed it back\nRap like (*incoherent rapping*), and it's still phat\nThis mothafucka tried to stab me in my love handle\nSo I blew his lights out like a fuckin candle\nIf you shoot me, you better bring a cannon\nIn the end, I'mma be the last G standin\nCan you imagine bleedin everyday\nWrappin up wounds with rooms of duct tape\nWho you lookin' and what'chu gonna do?\nYou can try to kill me, I'mma sho' gone kill you\n\n[Hook x2]\n\nPsychopathic!!"}], "artist": "Blaze Ya Dead Homie"}