{"songs": [{"year": "2018-12-09", "title": "Biibi Ba", "image": "https://images.genius.com/1f240322ca751293b2ef09b3630c3eba.640x640x1.jpg", "lyrics": "[Intro: Sarkodie]\nThere is one thing called money (Dope music)\nThat everyone is trynna find in this world\nIts very necessary (Fortune)\nWe gotta go hard on this one\nYeah\nBelieve it or not we all need it\n\n[Pre-Hook: Sarkodie]\nMoney be the root of evil\nBut poverty dey kill some people\nBrother for dey make that money\nWhether ebe just or illegal\nDon't let nobody deceive you\nNo be everybody go dey believe you\nDem dey pretend like they no dey see you but they really wanna be you\n\n[Hook: Sarkodie]\nBiibi ba oooo, biibi ba oooo\nBrother for dey make that money, cos\nBiibi ba oooo (Beast!), biibi ba oooo (oyoo)\nBiibi ba oooo (Check)\nBrother for the make that money cos\n(Lyrical Republic stand up y'all)\nBiibi ba oooo\n\n[Verse 1: Lyrical Joe]\nMoney be time im a wall-clock I dey keke\nIf I no hammer I go sell bread, we dey dweetee\nYou go fit to fix everything wey broke, wope a bisa Stonebwoy\nI get Gs with guns enye easy\nNti wo de me ka a Paedae you go feel dizzy\nMom. Your baby dey work hard like Steve Jobs\nSo the apple no go fall far from the tree believe me!\nMoney bi the reason sika nti, Batman never know Samini\nBut eno dey matter say the yawa boys get first\nHow many Johns come before Nana? Damn it!\nI'm on the beat to get, I'm on the best to raise expec-tation\nMany go follow they go double the following\nYou no get respect, instead to get doe ebe girls you chose\nI no be Santa Claus I don't laugh with hoes!\n\n[Verse 2: Tulenkey]\nWhether ebe just or fraud money\nSome coins or blood money\nI care less, came for more money\nI no dey biz if you no get more money\nI want your small money\nWanhwie angu me nsam a me shine wo body\nThe small small money be the issue\nMe fa car na me gye gye sika a mi yi mani\nMe nni bi nti ma ye mre se beans stew\nMe bank account mu ntentan ese wani\nEmu som se Fulani\nThe future be some way\nMo nim die eba anka mo atwe twe handbrake\nThat be why my mind dey for grind dey\nAdwendwen na ma me ti ahono se Bola Ray\nSo we tryna get the money\nMy team is standing behind me\nThe dream is finally coming, the kid is grindin\nI need to read the commas in my pocket\nI'm keen on bagging the body\nI've been the pundit, feeling I need the number\nTo get the money I want it all\nTule!\n\n[Hook: Sarkodie]\nBiibi ba oooo, biibi ba oooo\nBrother for dey make that money\nCos biibi ba oooo, biibi ba oooo (Oyoo)\nBiibi ba oooo, brother for the make that money\nCos biibi ba oooo\n\n[Verse 3: Frequency]\nFrequency whaaat?!\nOpportunity go knock, ase wo ne no aye zamzama\nIf you get me your only real G, poverty en key wo hia me pii\nEvery bro for this record dey talk about me, just imagine\nLack of me be the root of all evil\nWo wo me bebree a you go see more people\nAround with the fake love, you no get me you no get mouth\nLose me and see most of your team go switch off wise up\nI'm your favourite frequency model don't ever change the [?]\nMesie sie adie se adie biibi ba mia me ni Sika-Gua Kofi\nMa wo ti so na hwe me bi ye\nMe ni ho a things fall apart Chinua Achebe\nThe gods are not to blame me Ola Rotimi\nThe subject your best rappers dey talk about\nSika bi what everybody dey talk about, ebe me be the money\n\n[Verse 4: Kofi Mole]\nYou say broken heart be the worst thing?\nAre you sure? Try broken pocket\nYou say money can’t buy life, but hospital no be free\nMassa save wo comment\nYou need a mansion with a basement\nNso kae se nye boba na yede ye payment\nWo bedi ye nsaa ako bonsam gyam?\nSore kope sika, abi wote All-night abi Amen!\nKope agyuma ye o\nNa enye hiri-babababa a wo ye no na ebe ma wo adidi\nWo apampam pa ansa na wo anhu se wanyini\nYou for trace your success enye saa a wa titi\nObra  ye ko, wo beba abeto\nWo yeree ebewo, wo rent no nso ebeso\nYuusu wo nsa ne wo nan, enye ano wae\nSe eye ano keke na yede nya sika a anka prako ye Gate Bill Gate\nGo get it! Aposo Gangster\n\n[Hook: Sarkodie]\nBiibi ba oooo, biibi ba oooo\nBrother for dey make that money\nCos biibi ba oooo, biibi ba oooo (Oyoo)\nBiibi ba oooo, brother for the make that money\nCos biibi ba oooo\n\n[Verse 5: Toyboi]\nYare a ebo sika ni ma ne wu ntem boo ohia ni a anka agye praga\nDaa wote Snapchat na we nsa nso ye dan wo ka bi a wose Benada\nTome kaka kyofa Kpakposhito ke Akpeteshie sa ma kae ma mbia ke nnaa wa\nTruth say Sark is gone BET enough what he knows don't tryna go past that\nCover my money enkulde Ghana Gaddafi\nI get my money and my family you go dey grab man I'm Hitler\nOsu Teshie Labadi I'm tryna pull up a rally\nRead boy, come chat me later\nEver tell you difference about ever getting rich\nTell them borger like some Uber journey be like you dey trip....tour!\n\n[Verse 6: Yeyo]\nYou dey want make I come down a na se me nye Zacheuss\nYeeyo!\nTema boy me ko pe sika a me nye bone\nOmo nya ye anka daa mete blue kiosk\nThis be my period mea ankasa me de ko gye Sakawa\nMe hyebre nhye wo nsa enye kawa\nMa ye wild se abofra a new coins ayera\nWe go sin se ye wie a na sakra\nCos none of you go fit to do me favour\nOh jack negative energy die mempe o\nBerema wo tan me a later\nSo I dey go get the money go get the money yo\nOn the real, ekom ye ya\nWo ni bi a nobody go know how you feel\nOhia ma wo feeli se wanya Malaria\nJoe wo boa eye Malaria (Laughs)\n\n[Hook: Sarkodie]\nBiibi ba oooo, biibi ba oooo\nBrother for dey make that money\nCos biibi ba oooo, biibi ba oooo (Oyoo)\nBiibi ba oooo, brother for the make that money\nCos biibi ba oooo\n\n[Verse 7: Amerado]\nEeehe! Amerado\nThe MicBurners\nNAM1 a sika abu ne so kraa onya bi a ope\nNa wo hustlerboy a wote Nzema\nAbusua ne ka woso se pe edwuma\nWompe wo wu a yenye a wo ayie na yatwa ntoma\nNipadom bedi wakyi ama wo so a eye wo sika\nNti fa wabeti bo adwuma pe wo paper Nana\nWo nnim owuo hwe nna pe sika bank ma\nNa bukyia a eho efe nti na yeka  ntwoma\nSo work hard make money pack man\nWhat they come you no get crews o you for attack man\nLooku sharp make you chase some like a hard guy\nOhia yere wo a kunu se nie wo ye ne husband\nYou for think about the Doe, life ne ne goals\nWope wo sika no na wa forget wo foes\nGet on your toes grind for the doe\nWo nya sika na wo pli firi pharmacy\nMpo a yese wa ko gye  Sikaduro o\n\n[Verse 8: 2Fyngers]\nBiibi ba o ase bronya nso bowl a wode\nBesere aduane kora wo nni bi o\nNa wako pe mpaboa\nNtadie ne mo no foo na wo ankasa wope\nNti me nipa ye na pe doe la\nMake money make that honey wey e\nDawg you self come back honey\nMake story you only go fit live once only\nTestimony you pe go fit do that homie just [?]\nFake people and grind for the money\nMaking plans for the money\nNobody go do you betterly\nYour hands on the money\nBounce for the money\nMaking rounds for the money\nNyame boa na adepa akye wo ebe chance for the money\nBra nanenane looki sharp hare hare\nBrother forgeti Charley se allumi kra nanenane\nEya a manemane eya a danedane\nPe sika to ho na daakye wanbe hunu amanemane\n\n[Hook: Sarkodie]\nBiibi ba oooo, biibi ba oooo\nBrother for dey make that money\nCos biibi ba oooo, biibi ba oooo (Oyoo)\nBiibi ba oooo, brother for the make that money\nCos biibi ba oooo\n\n[Verse 9: Obkay]\nGo with the flow\nWade asie?\nO.B.KAY\nCentre for Scientific Research into Money Making\nSe never give up on the grind\nThat be the only way a sika nan beye ntiatia wo mo fie\nAse wo twetwa vines\nLife is a lesson student make wo note\nWhether penny or a dime cedi or foreign\nYou for make sure say money dey your mind\nWe've been victors since AD so after death if\nEno bi money tell me weytin you gain\nTake the world for a ransom obra akwantuo\nYou for run some that be the way\nCharle boa woho!\nNa die ooto anwian egu wani ase mpo da mpoano\nMempe se ebe fa wakyi nti na metwa asi\nWanim se adesua fa o!\n\n[Verse 10: CJ Biggerman]\nOhia tese intercourse, eye fuckin\nWo ni sika a things no dey more move things go dey slow\nThings wey for happen no dey happen\nJust because wo lacki financial backing...tie!!!\nSpeaking from experience\nYe tan bu be bi se experience is the best teacher\nThen I for be the best student\nSika sem nti o anka Nana me mablow dada\nMope se me to Joromi before you go see me?\nMope se me mespiti funny? Anka me ma gyimi\nI be hard guy bad guy fans a owo Nigeria\nMpo te me dini a na wa feeli\nAnd I don't mind I know my capability\nSo prepared, so with this opportunity\nI dey show Ghanaians when preparation\nMeets opportunity equals to success\nSuccess Music!\n\n[Hook: Sarkodie]\nBiibi ba oooo, biibi ba oooo\nBrother for dey make that money\nCos biibi ba oooo, biibi ba oooo (Oyoo)\nBiibi ba oooo, brother for the make that money\nCos biibi ba oooo\n\nFortuaaaane!", "album": null}], "artist": "Sarkodie"}