{"artist": "ProfJam", "songs": [{"album": "Mixtakes", "title": "Baudelaire", "image": "https://images.genius.com/ac43427e0930880bed1cbdb2bb1736f9.600x600x1.jpg", "lyrics": "[Verso 1]\nEsta vai ‘pó stoner, ‘pó queimado, ‘pó crl q ta foda\nA vida não passa de um galho de uma árvore sem folha\nPodes queimar o teu sabão, entra na tua bolha\nMas se só vives na ilusão o mágico fez de ti trolha\nPorque se ela é magia, ’tás preso no truque mano\nA moca não manda em mim, se eu quiser ela chupa-me\nDroga mata o q.i., mas também serve de lupa\nCom ela vejo tudo aqui, central chama e escuta\nLs-ls-ls-lsd, man I smell um spell aqui\nSinto a stella tellin’ me que a vida é bela, apago a wee\nEla é mel no chá das 5, o que faz mal é o papelzinho\nSinto as boas vibrações tal e qual o Melo D\nSó que fumar tipo fellony de certeza q não é bom ‘pa ti\nEsqueci-me de avisar a mim próprio ‘pa não vir contra mim\nEncontra-me a ir contra mim, em contra-mão, giro assim\nPasso da direita ‘pá outra, puto o tixtxo eu giro assim\nTopo Gigio, Big Show Sic, é sick o show no big screen\nHollywood tem pouca food ‘pa alimentar espírito livre\nSe eu não nasci ‘pa rimar ao menos vou morrer aqui\nLetras caminham no céu tipo um alfabeto Anakin\nSente como é que eu pero aqui, fecundo rap legacy\nRap Angelicalm logo acalmo, faço sesta aqui\nSozinho faço a festa aqui, já disse que sou fera aqui\nBoy digo-te eu: this is real tipo Tel Aviv\nSafoda a morte, não me importo, boy até lá vivo\nAté o hell é um hotel, eu até lá vivo\nE quando eu pego no pincel, boy, a tela vive!\nNem ‘co prego Ele morreu boy, c’est la vie!\nEu 'tou sempre com Ele, Ele é bué ‘da activo\nPuto tenta conhecê-Lo, sê mais receptivo…\nSê mais receptivo…\nSê mais receptivo…\nSê mais receptivo…\n\n[Refrão]\nJunta as mãos numa oração, pede ajuda a ti próprio\nCuidado com o vinho, o haxixe e o ópio\nCuida do teu vizinho, vive acima do ódio\nSegue o teu caminho sozinho e o resto: fode-o!\n\nSafoda o resto man, safoda o resto\n\n[Verso 2]\nSigo pegadas de animais que eu nunca vi\nComo é que eu sei escrever aquilo que eu nunca li?\nNão sei com quem falo em conversas que nunca tive\nSou mais um cavalo, peça do jogo que eu abri\nE vou montado em mim, fazendo um L, movimento\nSó que enrolar papel deixa-me enrolado ‘co tempo\nOra rápido ora lento, ácido deu-me a base e agora faço e aconteço\nSó q o tempo fica escasso e o mundo do nada ganha um preço:\nTudo tem um preço na vida mano, aqui ou pagas ou ficas a dever...\nManter ou transformar? faço o meu casulo ou não?\nSou uma lagarta gorda sem postura ‘pa esta rotação…\nVou ter de me encostar, quem é que me assegura o pão?\nSe eu não tiver ninguém vou recorrer à imaginação!\nEntão deixa-me estar neste nível de iluminação\nPorque quando o sol cair, vou ‘tar aqui ‘pa te estender a mão!\n\n[Refrão]\nJunta as mãos numa oração, pede ajuda a ti próprio\nCuidado com o vinho, o haxixe e o ópio\nCuida do teu vizinho, vive acima do ódio\nSegue o teu caminho sozinho e o resto: fode-o!\n\nJunta as mãos numa oração, pede ajuda a ti próprio\nCuidado com o vinho, o haxixe e o ópio\nCuida do teu vizinho, vive acima do ódio\nSegue o teu caminho sozinho e o resto: fode-o!", "year": "2016-04-01"}]}