{"artist": "​​wifisfuneral", "songs": [{"year": "2014-07-27", "lyrics": "Only in the fucking plug i trust (x3)\n\nOnly in the fucking plug i trust\n(Hook)\nJust copped a zip & its startin to get buck\nTheres no faith in religion, only in these drugs do we trust\nRide round my city ain't shit looking pretty \"wassup!\"\nPuffin on this dank with yo bitch in my tub\nHop out the whip just to go cop some drugs\nWe sold all them xanny's for 7,  all the banks know whats up\nNo handshakes to a fuck nigga, they be snitchin to the opps on the low, actin a fool on them pills, yeah a nigga rollin up\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust\n\n(Verse 1)\nWhat it do lil woadie? Cop a tool lil woadie\nPlease dont panic, hit that switch & catch yo ass in traffic\nIts tragic, it happens, we gon light up that blunt, mixin codeine & we relaxin, puffin on thrax with a sack, back to back\nNow not ever will you fuckin catch me lackin\nSpeak on that issue with me, while im smokin & puffin on weed\nCatch me rollin down I-95, smokin fire\nWith a bad yellow broad, ass fatter than the barre\nPop blue, yellow, white, green, xannies with a perc then im gone, since the age of 13, all i wanted was a QP, & a fuckin pint of lean, & a chevy sittin on dubs,  fuck nigga i need a whip lookin clean, south border forever nigga... & you can bet ya ass i love it, smokin on that potent with yo bitch out in public, fire up the work now a nigga feelin blunted, last year all them old hoes called a nigga ugly,  (            ) & now all them hoes wanna fuck me, Ain't never been a pussy nigga, thats why i ain't got no time for discussin, if it ain't about the profit, we send em home to his loved ones, we ain't fuckin around with nothin, & mag's got a nine, with the extendo he bussin,  make you lean wit it rock wit it, got your shoulder blades and your jaw touchin, \"oh im from palm beach nigga you ain't know? \", im from the place where the palm trees grow, & the pussy niggas fold, get your ass caught in traffic, they gon have to let you go, (......)\n\n(Hook)\nJust copped a zip & its startin to get buck\nTheres no faith in religion, only in these drugs do we trust\nRide round my city ain't shit looking pretty \"wassup!\"\nPuffin on this dank with yo bitch in my tub\nHop out the whip just to go cop some drugs\nWe sold all them xanny's for 7,  all the banks know whats up\nNo handshakes to a fuck nigga, they be snitchin to the opps on the low, actin a fool on them pills, yeah a nigga rollin up\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust\nOnly in the fucking plug i trust", "image": "https://images.genius.com/383319eb93e791b4922afe255b44c047.500x500x1.jpg", "album": "wifisfuneral - EP", "title": "Only In The Plug I Trust"}]}