{"songs": [{"lyrics": "[Intro: Aesop Rock & Mr. Lif]\nWe rolling now, official?\nUhuh, uhuh\nTurn the beat up a little\nUhuh, uhuh\nOutside the box, Lif you with me? Yeeah I'm with ya\nAright, let's go\n\n[Hook: Aesop Rock]\nSome cats grow by the laws of the wild\nSome learn slower and lag in the mud\nSome stand up in defense of a style\nSome let the big dogs eat them up\nAt exactly 11:35pm on January 21st I fell asleep sound\nAt exactly 11:35pm on Januray 21st some shit went down\n\n[Aesop Rock]\nNow Benny was a New York City graff kingpin\nFive borough fame, guaranteed to itch pigskin\nRaided near the Brooklyn Naval yard, juxed undercover\nWhen they asked him what he pled he said, \"You're fuckin' up my colors!\"\n\n[Mr. Lif]\nOkay, Jose is working in the slaughterhouse\nAnd he's living in the hood, but he wants to get his daughter out\nSlipped off a ledge, and fell into a machine\nAnother dead immigrant, that's the American Dream\n\n[Aesop Rock]\nMiss Molly, helpless, made a penny with a data entry temp gig\nOverqualified but the rent's thick\nRed brick bash with a texted green screen\nLike, \"I entered my data right into your screen\"\n\n[Mr. Lif]\nJane went insane, she's an anchorwoman\nSick of pushing skewed information\nAnd abusing the nation\nHad a few options:\nEither jump or run (RUN!)\nQuit or cold raise hell waving a gun (GUN!)\nTime for C-H-A-N-G-E\nHeld a knife to the VP on TV\nShe demanded that the format be expanded\nBeyond fair, everybody clear, understand it?\n\n[Aesop Rock & Mr. Lif]\nBilly was a coke fiend\nMaggie was a cop\nFor the dope he stole cream\nShe patroled the block\nBanking off his old scheme\nShe recognized his plot\nHe thought he was home free\nShe knew that he was not\nNow it's off to the jail in a blue squad car\nShe pocketed the crack before they got far\nBilly watches Maggie from behind steel bars\nLike \"Where the crack went?\"\n\"I'ma smoke it tomorrah\"\n\n[Aesop Rock]\nThey call him Larry Luck\nBlackjack, big spender\nHe was married once\nTill he bet her ring finger\nSeen leaving Las Vegas\nWith a pick up truck, diamond\nFourty large, and beautiful wife piece\nLess than what he came with\nHitched to the crib found nickels in the couch\nHitched back to the casino with in an hour\nSaid \"I'm here to make a dollar out of fifteen cents\"\nAnd was immediately shot to his death over debts\n\n[Mr. Lif]\nAs Colin died, his mama cried\nThen the EMS arrived\nSaid that he could be revived but they lied\nAfterlife realized that water from the skies\nWashes pain from our eyes so our hopes could rise\n\n[Aesop Rock]\nNow, J.J. punch drunk, acts like a dumb fuck\nBum touched girls looking young enough to thumb suck\nOnce sought a life thought it right to rat him out\nNow gets raped by Aryans in the big house (OUCH!)\n\n[Mr. Lif]\nTed did 20 years for growing some weed\nAlthough he used to snort coke and dabble with speed\nWelcome home, homie, here's a blunt with hash\nThey said you know the rules bitch, take two and pass\n\n[Hook: Aesop Rock]\nSome cats grow by the laws of the wild\nSome learn slower and lag in the mud\nSome stand up in defense of a style\nSome let the big dogs eat them up\nAt exactly 11:35pm on January 21st I fell asleep sound\nAt exactly 11:35pm on January 21st some shit went down\n\n[Aesop Rock]\nI got one Jack or Jill\nJill won't, Jack will\nJill didn't, then did it\nJack fell\nNo cellophane secrets, b\nI guess I sense two felt bumps in the tar\nNo cell\nBut hell, you jump the bar so well\nParted your partners veil and dipped\nI'm New York harbor\nTale of a sail, ripped sorta\nStuck on purpose for tha love of birthplace\nBut would have carried you home inside of my teeth anyday\nTurns out I wasn't cast in the master plan anyway\nHe holds no grudge, holds his tongue, wow\nSame one she used to hold in both smiles\nDagger the instinctual last shout if it killed me\nSo you can ride up in the sun city guilt-free\nOne year passed, the table is wobbling and your hollerin' back\nSippin the fits you skip when shit cracks\nThey never missed it\nNot a long haul, bullshit, kids kicked into the sink\nShoebox, with a flicks of lipstick\nI'll love you forever, cuz you know me better\nFor the record, at one time, would have married you in a second\nBut kill the rekindling dreams, and navigate the friendship\nOr else by the time the stress airs out we'll both be dead and friendless", "title": "11:35", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}