{"songs": [{"year": "1999-11-30", "album": "Amplified", "image": "https://images.genius.com/6e84984f4b00329695a16521d47f4aca.300x300x1.jpg", "title": "Things U Do", "lyrics": "Q Tip Talking:\nLets talk about these things we see\nWalking across the land\nLets talk about these joints I got\nEvery body get down\nLets talk about these things we see\nLets talk about these joints I got\n\nChorus:\nLets talk about the rules I bring\nAnd the things we take\nAnd the jobs we hold\nAnd the land we stole\nAnd a buck or two\nAnd the love for you\nAnd the things you do (5X)\n\nI puff L's with ladies and gentlemen\nI break spells with faith in a burst of wind\nOthers talk but.what they talk about?\nWho could walk but live what they walkabout\nA calm head in the middle of wartime\nPeople go down just so they could get more shine\nGirls wave your flag and surrender your faculty\nNiggas got g's but its not really mack to me\nKeep it soft like we killers and often gat\nYou walking on me guaranteed you be crawling back\nAbstract, seeing life, just like a kitten do\nNine lives, living one more 'fore I'm fuckin' through\nDogs don't eat it up increase they feedin time\nI'll be damned if a mutt starts eating mine\nLet's stay clubbed out the moon makes it whistle\nPants gripped your ass now I hope they don't fall apart\nLook around you tell me who else is shining girl\nFat rapping cats on my dick they just whining girl\nThat's just the magnetism that a Queens fella has\nRange rover gism and he fronting with his Lexus ass\nBut watch I'mma drop to a bronco\nSee me in your Bentley nigga just honk yo!\nAnd just know that your man to can get that\nAnd just though that I don't really wet that\nAnd just know that this nigga here flips tracks\nUmmah grooms ya, pain and slip dat\nThe illest regiment is what I represent\nGet us mad you gonna see the way gorillas went\nMack time; I need a dime and at least a friend\nI fear Allah he has no start and he has no end\nWe raise the roof up and tear the fuck up off\nBucking hard like the coast guard, who's soft?\n\nRepeat chorus (3X)"}], "artist": "Q-Tip"}