{"songs": [{"title": "Lil Eazier Said", "album": "Prince of Compton", "year": null, "image": "https://images.genius.com/50658067c9d28ff25b3852f99e9b37fb.442x442x1.png", "lyrics": "[Intro]\nEy cuz, I don't think they heard you\nTell 'em what your name is\n\n[Verse 1]\nMy name's Eazy, yeah this is true\nBlowing up the west is what I'm gonna do\nSame plan as my old man\nSame hood in the motherfucking Astravan\nSame gangsta, east-south Compton\nA hustler, a nigga will touch ya\nAnd leave ya face down in the gutter\nYou don't like how I'm living?\nWell fuck ya, it's Eazy!\nJust call me E\nLil E from the C-P-T\nAnd I'm the same person\nWorse than 'im, in the hood workin' 'em\nServin' up Compton's finest\nA young prince, so call me \"your Highness\"\nG pedigree legit\nOG old-school with that new-school lit\nNow that's that shit\nNiggas all know since '84\nWhen the OG Eazy used to sell keezy\nAy you ain't gotta believe me\nJust see it for yourself but you trying to see me\nNigga, it's a new west coast\nAnd a new young nigga wanna sell like dope\nIn the city, and you think you can stop it?\nIt's Eazy-er said, that's old comment\n\n[Verse 2]\nNow some do it for the radio, but I don't care\nIt's warfare when the E on air\nNumber one son of a G\nA young crime wave on the motherfuckin' Compton streets\nLike a tsunami\nThe west behind me\nThe soul of a double OG inside me\nSuicide drive-by, ride soldier\nShootin' in the dark up at hooters barkin' and it's over\nOne less bitch I gotta worry about\nYou can see they scared when the lead come out\nLil Eazy E, when the words pop, it's like birds drop\nYeah, nigga, get it where you live\nSeventeen years and you know what it is\nLil E got the C-P-T sewn up like a motherfuckin' D-O-C\nYeah, I got Ice like T\nAnd I keep it on bang like D-R-E\nCertified young Compton G\nFirst son of a legend named Eazy-E\nNigga, it's a new west coast\nAnd a new young nigga wanna sell like dope\nIn the city, and you think you can stop it?\nIt's Eazy-er said, that's old comment\n\n[Verse 3]\nLil Eazy, number one son of a gangsta-gangsta\nWest coast double OG legit\nI walk like a Crip and I lock like a pit, I don't play that shit\nI'm a destroyer, your ass is gone\nIf I see you on the set when the lights come on\nAnd any motherfucker thinkin' I'm playin'?\n[Gunshots]\nThat's what the fuck I'm sayin'\nIt's a Compton thing, blue and white tux\nOn green leaf, bellin', cuz I don't give a fuck\nSince gold van came with the dope man\nNiggas on the streets knew what the fuck was up\nI make dope, and cut throats, and the game broke\nCuz they can't cope with the rhymes I'm displayin'\nWith my CP, playin', all you can hear them say is\n\"Don't fuck around cuz that nigga is wild\"\nLil E's doin' it Compton style\nThat's the city, and you say you can get some?\nYo, it's Eazy-er said than done\n\n[Outro]\nDedicated to my father, Eric \"Eazy-E\" Wright, godfather of Gangsta Rap, a legend to always remember. Rest in peace, pop"}], "artist": "Lil Eazy-E"}