{"artist": "Yella Beezy", "songs": [{"image": "https://images.genius.com/c0f90591068ddfa0736db83f494fdcb6.600x600x1.jpg", "year": "2019-07-19", "album": "Baccend Beezy", "lyrics": "[Intro]\nOG Parker\nHey \n\n[Chorus]\nI  keep it I keep it G from the dawn to the dusk\nTo be honest with you, it's hard for me to love\nSay with me it'll be love, then it's love\nAnd  I cannot lie, it's hard for me to trust\nWhat  is trust? What is trust? What is trust?\nAyy, I cannot lie, it's hard for me to trust\nWhat  is trust? What is trust? What is trust?\nAyy, I cannot lie, it's hard for me to trust\n\n[Verse 1]\nAyy, what the fuck?\nNigga tryna figure out what is trust?\nBack  then a nigga had feelings\nBut now I don't know if it's love or lust\nAyy, when I was comng up (Yeah?)\nMe and my nigga, we was running stuff\nMama said she knew I was gon' be a problem\nWhen that thing in my pants started jumpin' up\nAyy, hopped off the porch, had to stack my cheese\nCouldn't trust nobody, had to stack my weed\nEverywhere I went, had the strap on me\nMy bitch wanna be affectionate, but that's not me\nGoddamn, why they wanna cap on me?\n'Cause a young nigga got the sack on me?\nAyy, back in the day I used to go for cup\nNow a nigga up and a nigga stuck on E\nAyy, you see how them tables turned\nHad to zip my heart up, now I'm standing firm\nGo bro, you're not a ho, gon' be down to be burn\nI used to trip with my partners when I was slangin' sherm\nGotta cut these hoes off so these bops can learn\nI swear nigga, I'm straight like I rock a perm\nBitch, I stay in the cut like lots of germs\nTaking shots at the kid, you got lots of nerves (Goddamn)\n\n[Chorus]\nI keep it I keep it G from the dawn to the dusk\nTo be honest with you, it's hard for me to love\nSay with me it'll be love, then it's love\nAnd I cannot lie, it's hard for me to trust\nWhat is trust? What is trust? What is trust?\nAyy, I cannot lie, it's hard for me to trust\nWhat is trust? What is trust? What is trust?\nAyy, I cannot lie, it's hard for me to trust\n\n[Verse 2]\nAyy, ayy, is you with me or against me? Gotta pick one\nAin't got goddamn time to be watching my back\nIf I feel played then I'm gon' clip something\nYeah, I got trust issues, no, I don't trust niggas\nNigga got killers in the back, gon' rip somethin\nHell nah, I don't trust bitches, nah, I don't trust bitches\nGo'n bring the sack to a nigga, let me pimp somethin'\nRollin' them lil' ass blunts, tryna skimp somethin', hey\nBeat it from the back, yellin' kill somethin'\nBeen fuckin' this bitch for a long, long time\nShe ask do I got feelings? I don't feel nothin', hey\nNigga talk tough, ain't drill nothin'\nHow you say you a jacker, you ain't peel nothin'?\nNigga picked up my hearse, tryna take him off the Earth\nBut yeah, pussy nigga, I'm still coming\nNo battle of the band, a nigga still drummin'\nI'm a fresh prince like Uncle Phil comin'\nNigga can't be around me, you ain't kill for me\nI ain't worried 'bout buddy but it's still fuck him, hey\nAnd I'll still up the steel on him\nAnd I still got steel for your lil' homie, hey\nNigga's heart cold 'cause they flipped on me, yeah\nFlex on a bitch nigga, drip on him, yeah, yeah yeah\n\n[Chorus]\nI keep it I keep it G from the dawn to the dusk\nTo be honest with you, it's hard for me to love\nSay with me it'll be love, then it's love\nAnd I cannot lie, it's hard for me to trust\nWhat is trust? What is trust? What is trust?\nAyy, I cannot lie, it's hard for me to trust\nWhat is trust? What is trust? What is trust?\nAyy, I cannot lie, it's hard for me to trust\n\n[Outro]\nOG Parker", "title": "Trust"}]}