{"songs": [{"year": "2019-08-10", "album": null, "image": "https://images.genius.com/76284da930b4792f77bf87d38082aa7b.1000x563x1.jpg", "title": "Double Dutch", "lyrics": "[Intro]\nYo Pi'erre, you wanna come out here?\nWho  you talking up?\nAy‚  please leave me alone\nI'm on the Breadwinner swim team\nI dived into you shit\n\n[Verse 1]\nEvery  night I pray to God that the Lord forgive me\nSomebody  try me and don't top me‚ then they coming with me\nYou just be talkin'‚ I be stalkin' with that mini Glizzy\nYou  ever cross me, I'ma lay you in a coffin with it\nI been thuggin' all my life, this a cold sport\nBig ol' Muslim up in rank‚ and I'm like Jeff Fort\n\n[Bridge]\nBread Winner, big driver\nBitch,  you ain't living like I'm living‚ you a dick rider\nBread Winner, big driver\nBitch, you ain't living like I'm living, you a dick rider\nThey know we move like ghosts out here\nI'm moving in the signs of these nine you heard me?\nI pull up by myself solo, presidential\nI got 10,000 angels with me, you know what I'm saying\n[?] was knowing how I was coming\n\n[Verse 2]\nDivision 9 gang members saying they gon' fly today\nI got my shirt off in this bitch, like why this bitch ain't flyin' yet?\nI'm up in rank and mutual con, I got Mehico and fog\nI got bricks of that perico, I'm a Puerto Rico dog\nThey said I couldn't kill my way to the ClearPort\nBut where I'm from, you want respect, you gotta kill for it\nHold up let me take this call, this lil' bitch, her fine-ass\nPut that pussy on me slow, bow-bow, grip her fine ass\nOur videos, we don't post, old hoes do the most\nMe and bae made a toast, look at them like jokes\nGet to turning up my nose, if they ever wanna approach\n\n[Chorus]\nLike what's happenin' with you?\nI hope you know I ain't just rappin' with you\nI had my back against the ropes, you started actin' different\nMy nuts be hangin' to the floor, I got that package with me\nStraight off the boat, I got that dope and got to swaggin' with it\nAy bitch, I double up, I have the gutter tucked\nI bought a peppermint flip to a buttercup\nI'm not ashamed to admit, shit, I love a slut\nI like to hit from the back, grip the bubble butts\n\n[Verse 3]\nAmsterdam, by the water, bitch, I'm in a dam with it\nUsed to do Camaro's on a slab with the wham in it\nNow I'm seeing things, living foreign, sippin' teas, I'm important\nYellow thing, we recording, riding me like a 'Rari\nI'ma keep standing tall, tatted back, and I'm scarred\nLike a [?], big dreams, got 'em all (Thumbin' through it)\nI'm in magazines, I don't pour it\nI'm takin' chances, made a champion\nHalf of you who judge me, probably wouldn't know what disaster was\nPhone number's platinum, I got action on the cannabis\nWe not like we used to, you not on my calendar\nHeavy in my new coupe, no one in the passenger\n\n[Chorus]\nShe like, what's happenin' with you?\nI hope you know I ain't just rappin' with you\nI had my back against the ropes, you started actin' different\nMy nuts be hangin' to the floor, I got that package with me\nStraight off the boat, I got that dope and got to swaggin' with it\nAy bitch, I double up, I have the gutter tucked\nI bought a peppermint flip to a buttercup\nI'm not ashamed to admit, shit, I love a slut\nI like to hit from the back, grip the bubble butts"}], "artist": "Kevin Gates"}