{"songs": [{"image": "https://images.genius.com/37e352ef2debbdafca8f195aac4196f9.500x500x1.jpg", "lyrics": "[Verse]\nI got a deep depression\nI don't sleep when I need the resting so\nI got a crippling anxiety inside me that's about to eat my flesh, man\nI just wanna feel relief and lessen\nAll the needless questions but I keep on stressing\nAnd I keep obsessing\nI keep looking at my phone every three damn seconds\nJust to read my texts\nAnd then I keep refreshing\nInstagram every minute just to see some breast skin\nIf you wanna hurt me you don't need a weapon\n'Cause I keep distressing so deep\nThat I'm probably gonna bleed to death\nFrom all the ulcers, diseases, infections and hunger to reach perfection\nI used to take drugs just to ease the tension\nBut when you take drugs the Grim Reaper's present\nI ain't talking 'bout the reefer you take for stress\nI'm talking 'bout the painkillers that'll keep you sweating\n\nI shouldn't be alive\nHere's a bleak confession:\nI was overanalyzing each regret\nI got emotionless\nI wanted to go somewhere and die\nSo I climbed to the roof of the tallest building\nTook the deepest breath and...closed my eyes\n\nThen I jumped!\nLike, finally\nI can be free from stress\nI can be free from this deep depression\nI braced for impact\nI'm gonna go \"smack!\" on the street in seconds\nThe fall took longer than I thought it should\nI spread my arms and tried redirecting my body so\nI can hit the ground sooner\nReady to die, like heaven's waiting\nI decided that I'd open up my eyes and\nHoly shit, I was levitating!\nYou gotta be joking\nI never hit the ground\nI was in the air floating\nI grew two big white wings when I jumped\nAnd now both of them were open\nAnd I couldn't even close 'em\nAnd above my head was a halo\nI said to myself:\n\"Uh, if I'm not mistaken, I think I'm an angel\"\nYep, I'm an angel\nLook, I'm an angel, I see it myself\nI don't believe in angels, though\nWhich makes sense because I don't believe in myself\n\nMy wings are spread\nI'm flying so high right over my city\nYou know what?\nI never realized, goddamn, man\nThis place is kinda pretty\nLook at that sunset\nLook at that horizon\nLook at that man playing songs on the violin\nI just wanna put a couple dollars in his hat\nHis song is so pretty I just wanna go and clap\nLook at that homeless guy, he looks hungry\nHe probably needs a ride to the shelter\nLook at that pregnant woman, trying to cross the street, man\nSomebody should help her\n\nLook, it's my grandmother\nLook, it's my damn brother holding hands, walking to the store\nLook, it's the girl that I loved for years\nShe's on my front porch, knocking on my door\nI don't understand\nWhen I told her that I liked her\nShe said we should just be friends\nDoes she want me now?\nI wanna talk to her, wait a sec, no\nMy life can't end\nOh my God, there's my dog in my backyard\nI forgot to let him inside\nI remember all the lonely days where he would snuggle me and keep me company\nI swear I would pet him and hide\nHe's kinda old and he can't see well\nSo he'll probably never find a new home\nAnd right there is the cemetery where my dad is buried\nAnd on his tombstone it says:\n\"Here I lie, proud of my children\nI taught 'em to know\nThat whatever doesn't kill them will make 'em stronger\"\n\nFuck!\nI let him down\nI shoulda made it longer\nI realized that my life cannot get better without me\nI realized that my life on Earth was never about me\nHappiness comes from health and people\nFrom making 'em feel good and showing I care\n\nI blinked my eyes and I was laying in my bed\nI didn't really die\nIt was just a nightmare\nGot out of bed and put on my shirt, shoes, and pants\nI guess I'll give this life thing on more chance\nShit, I got a deep depression\nI don't sleep when I need the resting\nSometimes I fall asleep but I dream of death\nAnd I wake up feeling better like\n\"I guess I just needed some deep compression\"\nNo matter how sad you are\nDon't give in to the pressure\nJust watch this video on repeat\nUntil you start to feel better\n\nI love y'all", "year": "2018-12-10", "album": null, "title": "I Tried to Kill Myself."}], "artist": "Mac Lethal"}