{"songs": [{"lyrics": "[Produced by Irv Gotti]\n\n[Intro]\nYeah, hah, yeah, Roc-A-Fella\nWe invite you to somethin' epic, you know?\nWell, we hustle out of a sense of hopelessness\nSort of a desperation\nThrough that desperation, we become addicted\nSort of like the fiends we accustomed to servin'\nBut we feel we have nothin' to lose\nSo, we offer you, well, we offer our lives, right?\nWhat do you bring to the table?\n\n[Verse 1]\nWhile I'm watchin' every nigga watchin' me closely\nMy shit is butter for the bread, they wanna toast me\nI keep my head, both of them, where they supposed to be\nHoes'll get you sidetracked, then clapped from close feet\nI don't sleep, I'm tired, I feel wired like codeine, these days\nA brother gotta admire me from four fiends away\nMy pain, wish it was quick to see\nFrom sellin' 'caine 'til brains was fried to a fricassee\nCan't lie, at the time it never bothered me\nAt the bar, gettin' my thug on properly\nMy squad and me lack of respect for authority\nLaughin' hard, happy to be escapin' poverty, however brief\nI know this game got valleys and peaks\nExpectation for dips, for precipitation we stack chips, hardly\nThe youth I used to be, soon to see a mill'in\nNo more Big Willie, my game has grown\nPrefer you call me William\nIllin' for revenues, Rayful Edmond-like\nChannel 7 News, round seven jewels, head dead in the mic\nForgettin' all I ever knew, convenient amnesia\n\"I suggest you call my lawyer, I know the procedure.\"\nLock my body, can't trap my mind\nEasily explain why we adapt to crime\nI'd rather die enormous than live dormant, that's how we on it\nLive at the main event, I bet a trip to Maui on it\nPresidential suites my residential for the weekend\nConfidentially speakin' in codes since I sense you peekin'\nThe NSX rental, don't be fooled, my game is mental\nWe both out of town, dog, what you tryin' to get into?\nViva Las Vegas, see ya later at the crap tables\nMeet me by the one that starts a G up\nThis way no Fraud Willies present gamblin' they re-up\nAnd we can have a pleasant time, sippin' margaritas\n\n[Hook]\nGe-ge-geyeahhh\nCan I live?\nCan I live?\n\n[Verse 2]\nMy mind is infested with sick thoughts that circle\nLike a Lexus, if driven wrong it's sure to hurt you\nDual level like duplexes, in unity\nMy crew and me commit atrocities like we got immunity\nYou guessed it, manifest it\nIn tangible goods, platinum Rolex'd it\nWe don't lease, we buy the whole car, as you should\nMy confederation, dead a nation\nExplode on detonation, overload the mind of a said patient\nWhen it boils to steam, it comes to it\nWe all fiends, gotta do it: even righteous minds go through this\nTrue this, the streets school us to spend our money foolish\nBond with jewelers and watch for intruders\nI stepped it up another level, meditated like a Buddhist\nRecruited lieutenants with ludicrous dreams of gettin' cream\n\"Let's do this,\" it gets tedious\nSo I keep one eye open like CBS — you see me stressed, right?\n\n[Hook]\nCan I live?\nCan I live?\nCan I live?\nCan I live?", "title": "Can I Live", "image": "https://images.genius.com/18040c4f503942a16d6577d9820644cb.1000x1000x1.jpg", "year": "1996-06-25", "album": "Reasonable Doubt"}], "artist": "JAY-Z"}