{"artist": "Ace Hood", "songs": [{"title": "Damn!", "album": null, "year": null, "lyrics": "[Intro]\nOh yeah?\nThat’s how you feel, huh, young niggas?\nYou gon’ pull up in that ma’fuckin’ foreign right there\nWent bare in your ma’fuckin’ pocket with that bitch?\n\n[Hook]\nGoddamn… goddamn\nWhy you do ‘em like that? Goddamn\n(What you mean?)\nHow he pull up in the Porsche, 911, oh lord\nWith a bad bitch with me and her ass all for it\nGoddamn… goddamn\nHundred-thousand for the Rollie, goddamn\nAll these diamonds in my chain, 30 bottles on the way\nKOD in Magic City, pissy, K, I’ll make it rain\nGoddamn\n\n[Verse 1: Ace Hood]\nSteppin’ out tonight I think I’m ‘bout to make a movie\nDrophead Phantom whippin’, bumpin’ Lil’ Boosie\nBitch, I got a check I just might buy the whole club\nTwenty-thousand dollars I just call it showin’ love\nBig money nigga, caught a milli on the jewels\nBallin’ like a bitch, I made the ESPN news\nOh boy, you can never play me for a fool\nKeep a Mr. Fix-It with me, that’s who keep the tool\nI say “now good lord, look at shorty there, she all ass”\n“Bet your money she gon’ fuck me for that brown bag”\nI said I’m too gone off that liquor – turn up, nigga, you trippin’\nAnd peace to rockin’ my system – blue-tinted watches, I’m different\n\n[Hook]\n\n[Verse 2: Plies]\nI was in the trap, cracker kicked the door\nI was in the room, I was beatin’ a hoe\nCracker asked me “nigga, where the store?”\nTold him “probably in Alaska, cracker, where it snow”\nHit Crummers, I’mma buy a hundred shares\nAnd give it all the way to all of y’all niggas\nGot a funny feeling I’mma whack me a rat\nAnd get on TV playin’ crazy like “I don’t know what happened”\nAsked me did I fuck his girl, I told him I don’t remember\nNow did she suck me? That’s a strong possibility\nHit him with the nine and got his shit back\nTen racks, pussy nigga, and I’ll sell your chain back\n\n[Hook]\n\n[Verse 3: Ace Hood]\nOkay, now fat black Meryl bitches call me Bruce Wayne\nCrib big as Wal-Mart, nigga that’s a shame\nAnd I keep a shooter, call that boy Dwayne Wade\nMost them niggas pussy, lucky I don’t call names\nCatch me runnin’ up in that, Lord have mercy, thank you Jesus\nProbably with a freak, her name Tanika, she a skeezer\nOrder more bottles, tell ‘em more rosé\nDope boy swag, gold rollie and some J’s\nI be wildin’ on your niggas – stylin’ on your niggas\nGo and cop a whip and then I Instagram a picture\nWhat your money like? What get your cheddar up?\nMy paper long, bitch, etcetera, etcetera\nYeah!\n\n[Hook]", "image": "https://images.genius.com/2b8521f75a42651c7f8673b2f3f696bc.720x720x1.jpg"}]}