{"artist": "50 Cent", "songs": [{"album": "Get Rich or Die Tryin’", "image": "https://images.genius.com/17bdb55979efe915f90e0fa67b92ad61.1000x1000x1.jpg", "title": "Many Men (Wish Death)", "lyrics": "[Produced by Darrell \"Digga\" Branch, Eminem & Luis Resto]\n\n[Interlude: 50 Cent and (Lloyd Banks)]\n(Man, we gotta go get somethin' to eat\nMan, I'm hungry as a motherfucker)\nAyo man, damn\nWhat's takin' homie so long, son?\n(50, calm down, he coming)\n*9 Gunshots*\n(Ahh, ohh, what the fuck)\n(Ah, son, pull off, pull off)\n\n[Intro: 50 Cent]\nMany men wish death upon me\nBlood in my eye, dawg, and I can't see\nI'm tryin' to be what I'm destined to be\nAnd niggas tryin' to take my life away\nI put a hole in nigga for fuckin' with me\nMy back on the wall, now you gon' see\nBetter watch how you talk when you talk about me\n‘Cause I'll come and take your life away\nMany men, many, many, many, many men\nWish death 'pon me\nLord, I don't cry no more\nDon't look to the sky no more\nHave mercy on me\n\n[Verse 1: 50 Cent]\nNow these pussy niggas puttin' money on my head\nGo on and get your refund, motherfucker, I ain't dead\nI'm the diamond in the dirt that ain't been found\nI'm the underground king, and I ain't been crowned\nWhen I rhyme somethin' special happen every time\nI'm the greatest, somethin' like Ali in his prime\nI walk the block with the bundles\nI've been knocked on the humble\nSwing the ox when I rumble, show your ass what my gun do\nGot a temper, nigga, go 'head, lose your head\nTurn your back on me, get clapped and lose your legs\nI walk around gun on my waist, chip on my shoulder\nTill I bust a clip in your face, pussy, this beef ain't over\n\n[Hook: 50 Cent]\nMany men, many, many, many, many men\nWish death 'pon me\nLord, I don't cry no more\nDon't look to the sky no more\nHave mercy on me\nHave mercy on my soul\nSomewhere my heart turned cold\nHave mercy on many men\nMany, many, many, many men\nWish death 'pon me\n\n[Verse 2: 50 Cent]\nSunny days wouldn't be special if it wasn't for rain\nJoy wouldn't feel so good if it wasn't for pain\nDeath gotta be easy, ‘cause life is hard\nIt'll leave you physically, mentally, and emotionally scarred\nThis is for my niggas on the block twistin' trees in cigars\nFor the niggas on lock doin' life behind bars\nI don't say \"Only God can judge me,\" ‘cause I see things clear\nCrooked-ass crackers will give my black-ass a hundred years\nI'm like Paulie in Goodfellas, you can call me the Don\nLike Malcolm by any means with my gun in my palm\nSlim switched sides on me, let niggas ride on me\nI thought we was cool, why you want me to die, homie?\n\n[Hook: 50 Cent]\nMany men, many, many, many, many men\nWish death 'pon me\nLord, I don't cry no more\nDon't look to the sky no more\nHave mercy on me\nHave mercy on my soul\nSomewhere my heart turned cold\nHave mercy on many men\nMany, many, many, many men\nWish death 'pon me\n\n[Verse 3: 50 Cent]\nEvery night I talk to God, but he don't say nothin' back\nI know he protectin' me, but I still stay with my gat\nIn my nightmares niggas keep pullin' TEC's on me\nPsychic says some bitch done put a hex on me\nThe feds didn't know much when 'Pac got shot\nI got a kite from the pens that told me Tut got knocked\nI ain't gonna spell it out for you mu'fuckas all the time\nAre you illiterate, nigga? You can't read between the lines?\nIn the Bible it says what goes around comes around\n\"Hommo\" shot me, three weeks later he got shot down\nNow it's clear that I'm here for a real reason\n‘Cause he got hit like I got hit, but he ain't fuckin' breathin'\n\n[Hook: 50 Cent]\nMany men, many, many, many, many men\nWish death 'pon me\nLord, I don't cry no more\nDon't look to the sky no more\nHave mercy on me\nHave mercy on my soul\nSomewhere my heart turned cold\nHave mercy on many men\nMany, many, many, many men\nWish death 'pon me", "year": "2003-05-06"}]}