{"songs": [{"title": "I’m On My Shit", "lyrics": "[Intro: Young Scooter & Future]\nYeah nigga!\nYou already know I’m on my shit nigga\nThe streets crazy right now\nHuh, what the fuck you gonna do?\nSwamp Mutha’fuckin Izzo! (count up)\n\n[Verse 1]\nFuck, fuck the police cause they playing it dirty (yeah)\nLocked up my whole clique, shit got me hurting (dirty)\nI told plug, “You know I got you nigga if it cost a mill.” (a ticket)\nI’mma get my whole clique out; I put that on my kid (I got ya)\nMy lil cousin up, got a fifteen, paying for his appeal (you good)\nPlus, I’m doing this all with no record deal (street running)\nA couple of years ago I was in the county cuffs (the county jail)\nNow I’m pulling up with bails on dump trucks (bricks, bricks)\nIf you’re turned down, nigga I can turn you up (turn you up)\nI drop my price everyday, nigga I don’t give a fuck! (jugg)\nEveryday I’m making plays; eating bands for lunch (Freebandz)\nThe motor in the back; the trunk in the front (foreign)\nMy momma told me, “Son, you’re gambling with your life. (damn)\nLeave the streets alone, shit ain’t right!\nYour chances in the street just like shootin dice\nAt 7-Eleven nigga, you could lose your life!”\n\n[Interlude]\nYeah nigga!\nYou better stay on your mutha’fucking shit in the street nigga\nYou already know Young Scooter nigga\nI’m on my mutha’fucking street shit right now\n...Count up!\n\n[Verse 2]\nThe streets look at me now; I came a long way\nFrom a three grand hundred, to them trucks of yay\nI got so much money, I give that shit away\nBosses eat steak; you’re eating on paper plates\nI just talked to my lawyer; I just beat a case\nThat’s good luck for the streets, I drop the price of yay\nI’m plug-talking; I switch up numbers everyday\nEvery nigga around me is getting paid...\nFreebandz, that’s that shit a nigga like\nHow you want your dough nigga: tan or white?\nI get them on a boat, nigga overnight\nRed, white, and blue, I’m about to take flight!", "album": "Voice Of The Streets", "year": null, "image": "https://images.genius.com/2cf35349d3af568723a1dc7962985e10.500x500x1.jpg"}], "artist": "Young Scooter"}