{"songs": [{"title": "You Know Me", "image": "https://images.genius.com/f71b7359ef6c3289ddb4c2357d15c2d0.500x500x1.jpg", "album": "Death Before Dishonor", "lyrics": "Ooooh Ooooh, Ooooh Ooooh\nOoooh Ooooh, Ooooh Ooooh\n\n(Interlude: 2 Pistols & Ray J)\nSomethin serious... Shorty you know wat it is\n\n(Chorus: Ray J)\nI know you shorty, you know me and you know I can't leave these streets, cause I mean it's in my veins shorty wish I could stay but for now just pray for me\nI know you shorty, you know me so hard for me to leave these blocks got my head tied in a knot always runnin from the cops prayin that I don't get caught\n\n(2 Pistols: x2)\nYou know I push it to the limit sun up, sun down, baby I got to get it, gotta get it... I gotta get it\n\n(Verse 1:)\nBaby girl, you know my situation. I know sometime you get impatient. I be on tha grind. You be at tha house, probably think I'm at another broad house. Shorty I'm gettin money more than I've ever seen. True Religion jeans, I know you like those. That's why I buy'em for ya\nSmile for me. You can't believe them hatin B**ches, they be lyin on me. Keep a nine on me, you know they plottin on me, you just keep that pu**y tight. I'm comin home early. I gotta get it, get it. I can't leave the streets. I did'nt choose tha hustle, tha hustle chose me\n\n(Chorus: Ray J)\nI know you shorty, you know me and you know I can't leave these streets, cause I mean it's in my veins shorty wish I could stay but for now just pray for me\nI know you shorty, you know me, so hard for me to leave these blocks got my head tied in a knot always runnin from the cops prayin that I don't get caught\n\n(2 Pistols: x2)\nYou know I push it to the limit sun up, sun down, baby I got to get it, gotta get it... I gotta get it\n\n(Singing: Ray J) Pray for me pray for me\n\nStreets keep callin, the block keep on watchin. You're my shorty, hope'n you stay down be with me win or lose. Girl my heart is always with you, don't get confused. Just hold me down, I promise that we'll make it through\n\n(Verse 2: 2 Pistols)\nI'm gettin money 24/7 life as a hustler, they wanna throw away the key and lock a ni**a up, I remember when they put me in handcuffs. I look you in tha eye \"Shawty what u cryin for? \" I'll be out in the morning, baby post bail. Get your hair done cause I'm comin straight over there. I trust her with tha money, shorty so real. I put them diamonds on her\nJust to show I care. You stuck with a ni**a, in and out of jail. I know you love me baby, I put you through hell\nI gotta get it, get it. I can't leave the streets. I did'nt choose tha hustle, tha hustle chose me\n\n(Chorus: Ray J)\nI know you shorty, you know me and you know I can't leave these streets, cause I mean it's in my veins shorty wish I could stay but for now just pray for me\nI know you shorty, you know me, so hard for me to leave these blocks got my head tied in a knot always runnin from the cops prayin that I don't get knocked\n\n(2 Pistols: x2)\nYou know I push it to the limit sun up, sun down, baby I got to get it, gotta get it... I gotta get it\n\n(Chorus x2: Ray J)", "year": "2009-05-27"}], "artist": "2 Pistols"}