{"artist": "Vado", "songs": [{"title": "2 Fingers", "year": "2014-02-10", "lyrics": "[Verse 1: Vado]\nWhat happened? Who shot? Who buck and who ran off?\nThese rappers ain’t hot the fuck they got fans for?\nI’m back in the spot, with bundles they hand off\nMeet me another block askin' what’s the expand cost\nIt’s a hard job that fell for raw scarf\nLeft hand steer, Cartier was all polish\nLight knit wear, I don’t pitch the hard\nMaserati whip, serve bricks to the carwash\nWho’s on the menu? Hunned deep at the venue\nHunned keys who I sent to, turn the weed up the mental\nWas in a rental, I done turned down in Pennsylvania\nPistol mania, streets official\n\n[Hook: Kevin Cossom & Vado]\n2 fingers in the air for the ones before\nMiddle finger in the air for the ones that hate\nAin’t no more love\nSorry but it’s gotta be this way\nStackin' all day, trappin' all day\nBack with more yay, we clappin' your way\nI’m a survivor, I’m a rider\nBet you don’t move\nWhen it’s on this side, no\nIt’s been so long but we finally arrived\nWe stackin' all day, trappin' all day\nBack with more yay, we clappin' your way\n\n[Verse 2: Ace Hood]\nYou’re looking at a new school legend\nGift out of Heaven\nPreachin' that real, yeah I'm something like a Reverend\nLivin' by the code, bend nor fold\nBlack man wearin' 100 G's worth of gold\nIced out watches, shirt from Versace\nKing of the south I am, wuddup Gotti?\nBeen speak bout it, money no karate\nProfit go to flippin' now they think I’m Illuminati\nWhat you came here for? I’m in the Django clothes\nNiggas want my life, they wanna take my soul\nSee I done switched my flow just like I do with my hoes\nNow they know I’m the truth but why it took so long?\nKnow the Maybach comfy and the kush so strong\nNo my thoughts ain’t right, I can’t do nothing wrong\nI’m so gifted, hear my voice and get lifted\nCame from the trenches, gun shots to ditches,listen\n\n[Hook]\n\n[Verse 3: Vado]\nI’m quick to grab 9’s when a man hate\nBeen getting bad vibes from they handshakes\nI’mma act fly 'til my land day\nNo need to ask why my nigga man straight\nLong line for the dope that’s a fan base\nHog tie with the ropes, what yo fan face?\nMob ties with the coke, make the plan great\n4-5 to his throat, where’s the damn safe?\nKhaled you know it’s time\nWhen they see me they’ll see Po in his prime\nRich when he was rich, the industry von zip\nGazelles like Dred Scott, Ciele’s my bread copped\n\n[Hook]", "album": "Sinatra", "image": "https://images.genius.com/89138b20fbe3b374294d1f756871626b.620x620x1.jpg"}]}