{"songs": [{"year": null, "lyrics": "\"Back up!\"\n\"Back up, back up, back up...\"\n\"Okay now, just, just put the activator down.\"\n\"Where were you the day Cookie Head got killed?\"\n\"I was at the hair salon man, I was getting my curl done, I was there all day.\"\n\"Where?\"\n\"Oh okay, I wasn't there all day man, I [?] on Crenshaw, I bought me some hair care products man. I got some activator. Some glycerine. And some curl activator.\"\n\"I ain't never went out to the beach.\"\n\n[Verse 1]\nMake your bitch wanna have a nigga slide through and put dick on her\nWanna dip with a nigga take a trip with a nigga, what, you ain't know you was a flip to a nigga, huh?\nI'ma let my soul glow in a black volvo and my teeth shine like a chrome .44\nDon't tell a nigga nothing that he don't know, with a mouthpiece that could put you on a ho stroll\nThought you was the nigga til you a nigga huh, now you thinking about what you told them hoes\nWhen You was all up in they bed, pillow talking and hating, throwing all types of salt on my operation\nAte a bitch, get it then play the bitch\nBut she live in section 8 with her brother sister momma and her uncle trying to hustle\nDo I save the bitch? Do I lace the bitch?\nDo I pump her veins with my activator?\nDo I call her now? Do I call her later?\nDo I leave her hanging like \"bitch I'm through\"? Do I leave her insecure like \"what I do?\"\nWe should flip for it, heads or tails, what I choose?\nMomma never thought I was a bad kid, but I got a lot of tales for the grandkids\nI must say, players only live once,\nIs you bout it?\nLet a real nigga reroute it\nMake a nigga wanna ask questions like \"who that is?\" \"What he do?\"\n\"Do you know that nigga? Did you fuck that nigga?\" Cause...\nIf so, then bitch we through\n\n[Hook]\nMy activator, ho, my activator (x3)\nDon't touch my activator, no, cold game, don't hate the player\nMy activator, my activator (x3)\nFuck all them perpetrators, in the end all I got is my activator\n\n[Verse 2]\nHow that nigga got all that but ain't working? How that nigga got all that but ain't serving?\nTold him it's the activator nigga, do you need some? I might have some for you\nHow to make a motherfucker hate yo shit, then how to make a motherfucker play yo shit, and how to make a motherfucker take yo shit, date yo shit, pay yo shit\nThat activator charm, and you know that!\nTell that ho to set alarm, if you wanna put a diamonds in the charm\nMake a nigga stop like, \"Oh that's you? \"Unloading all your cashews, in a bitch with benefits and a back tattoo?\"\n\"Can you make a bitch cum with your dick and your tongue?\" That's the question dude\n\"Can you tell that bitch that shes the only one and you was never with that other bitch and have her never question you?\"\nBe smooth with it, no details\nSome niggas flip a whole clique of bitches then go run they mouth like a female\nThat ain't P, therefore that ain't me\n\"Do you smile when you see her, kiss and hug that bitch?\"\n\"When your slipping, when she's slipping, would you love that bitch?\" My nigga you fucking up\nGotta feel em out\nBut if she left yo ass, you would call the ho pouring your feelings out\n\n[Hook]\n\n[End]", "album": "Ice Cold Perm", "title": "My Activator", "image": "https://images.genius.com/98d3e3369facf82ee69688c5e541f1f3.1000x1000x1.jpg"}], "artist": "100s"}