{"songs": [{"image": "https://images.genius.com/fc0e1a819fe7cedd7d6ff3b0104d6cb7.600x600x1.jpg", "title": "Got Caught Dealin’", "album": null, "year": "1998-01-01", "lyrics": "(Chorus)\nI got caught dealin, at the age of one-five\nHad all my bitches stealin, just tryin to survive\nAnd it was business as usual if one of mine had to die\nCause fuck dat yo, I gotta make sho my dough multiply\n\nCrimes I commit heinous, y'all niggas is brainless\nYou tied up at gun point, flinch make you famous\nBlow make me live aimless, my gun stainless\nAim for your temple, hope you die painless\nIllest shit we wore those, marked money we tore those\nMy whole team channelin coke through urban portholes\nYou livin like meer immortals, your block's foreclosed\nWe forty deep on in the street, and fuckin your hoes\nSeen your man club bathroom soft stuff heron\nCome out, loud talkin and shit, claimin he Don\nHope he know when he step outside baby it's on\nWatch my guns illuminate the sky like Vietnam\nMy confidence shared by all conglomerates\nEveryone in my circle is dominant\nWe live prominent, your world we bombin it\nStuck in the pen? WALK the shit in\nCome on and cock it\n\n(Chorus)\nEight-fifty navy blue, kill like a Laker do\nTwenty inch chrome shit, who must I say to you\nWatch what your lady do\nWe stoned the fuck out\nNot just your car nigga, chrome ya truck out\nCalico plastic, twin to match it\nIce white like some Star Wars space gun\nThough, that ain't how they come my friend make 'em\nSleek wit 'em like a L.A. nigga, love is day tons\nThey talk shit you nigga where it hits the procedure\nI got rats dim as the site fool quick to switch cheetah\nActually they want the cheeba I'm the owner and leader\nYo my clip's my bitch, I own her and beat her\nHuh, shit, dick missile tomahawk\nOne thing I love is sex discussions and armor talk\nWho got all the CEOs disputin?\nAnd my clipse niggas fussin and shootin?\nYo, it's that same nigga\n\n(Hook)\nIt was.. make money money take money money what?\nMake money money take money money what?\nMake money money take money money what?\nMake money money take money money money\n\nYou ain't never seen it like this\nIces this priceless, pullin heist-es\nOne wrong move, they lifeless\nThug shit, bullets and clips and pwice this\nWhere I come from niggas shoot guns and dices\nWhat the price is, scratch that we don't ask that\nWe blast that gat in yo mouth, where the cash at?\nThat's how I roll drugs get sold but never hold shit\nMalice face two-five to life, but never told shit\nIt's like that, love for my clique, go ahead and light that\nWhen shorty left with no ends, y'all been never bite that\nDay in the life, ain't nothin nice how I hit 'em up\nHands high get 'em up, cash tried lit 'em up\nRegret that? Countin my stack I had to wet that\nHog tied, telephone cords, speak to the lord\nAnd while the cops untyin you, my whole team eyin you\nCause even if you talk in your sleep my heat fryin you\n\n(Chorus)\nI was thankin thankin make money money take money money what?\nMake money money take money money what?\nMake money money take money money what?\nMake money money take money money money\nMake money money take money money what?\nMake money money take money money what?\nMake money money take money money what?\nMake money money take money money money\n\n(Chorus) - repeat 2X"}], "artist": "Clipse"}