{"songs": [{"image": "https://images.genius.com/88580af983438f1c5296bb2a8a2668c1.1000x1000x1.jpg", "title": "Freedom Interlude", "album": "Telefone", "year": "2016-07-31", "lyrics": "[Intro]\nI thought I was gone write a rap\nI thought I was gone...\n\n[Verse 1: Noname]\nI thought I was gone write a rap but this be baby miracle\nVirginity in karat gold, alphabet in the cereal\nI'll forget why I'm here alone\nSentiment for a different song\nLet's get back to IG, open the DM, I think he like me\nAsiatic black man, affinity with lap dance\nThe walls is caving, the laws is changing\nBill Cosby ain't the god we made him, they all forgave him\nI think I wrote a song about confusion and perception\nMessages in bottles, disillusion on the guest list\nYou said plus one, so where your plus one at?\nI hope he find his way to Arizona now\nI hope he find Fatimah and she hold him down\n\n[Verse 2: Noname]\nWhat a pretty lady in the valley of the shadows\nI'm thinking she lost a battle\nI'm thinking she found the bottle\nBlueberry bubblegum bassinet in my hideout\nBaby said turn the lights low\nMomma said go to bed now\nI had a dream I rocked my baby fast asleep\nCount the toes, they're all there, kiss the cheek\nI think this is a song about redemption\nOr a mother's intuition\nHow my kitchen sounds like church bells\nWhy they sell me, my dollar, and my dream?\nWhite picket fence, crop of the cream\nI know this is a song for overcoming\nAnd me coming, and me running out of ways to....uh-uh\n\n[Hook: Noname]\nDance with me, dance with me\nDance with me, dance with me\nDance with me, dance with me\nDance with me, I know I'm free\nDance with me, I know I'm free\n\n[Outro]\nPeter Rodis: Well what's free to you?\nNina Simone: What's free to me? Same thing it is to you, you tell me\nPeter Rodis: No, you tell me\nNina Simone: Just a feeling... It's just a feeling. It's like how do you tell somebody how it feels to be in love? How are you going to tell anybody who has not been in love how it feels to be in love? You cannot do it to save your life. You can describe things, but you can't tell them. But you know it, when it happens. That's what I mean by \"free\". I had a couple times on stage when I really felt free, and that's something else. That's really something else! I'll tell you what freedom is to me: No fear!"}], "artist": "Noname"}