{"artist": "Cage", "songs": [{"title": "Grand Ol’ Party Crash", "album": "Hell’s Winter", "year": "2005-09-20", "image": "https://images.genius.com/35a6c4fadae054a62d3335575b662535.500x490x1.jpg", "lyrics": "(That music makes you feel downright patriotic, doesn't it?)\n\n[Intro: Jello Biafra as George W. Bush]\nOur nation must come together to unite\nI know that human beings and fish can coexist peacefully\nNobody needs to tell me what I believe\nBut I do need somebody to tell me where Kosovo is\nThe illiteracy level of our children are appalling\n\n(Beware, I live)\n\n[Verse 1: Cage]\nI wake up to a caffeine, cigarette vaccine\nThen bathe in water I wouldn't drink before gasoline\nFeel like a loser cause I'm not in Fallujah\nPainting a land cruiser with an Iraqi then taking his Ruger\nNo M-16 to give me a callus\nInhuman super malice for GOP uber alles\nBaby suicide bombers hurdle suitcases in a nursery\nI'm in a deli eating tuna, tasting the mercury\nThen try to wash it down with a two dollar bottle of water\nGet on the train and think of terrorists with box cutters\nGun concealer cause I see a realer reality\nAnd what I breathe through my nasal cavities, killing my batteries\nBombs in metropolis, out all eye sockets\nEsophagus melted out some shiite group will get their props for this\nLook, I need petro for my Mercedes\nBut I'm not trying to kneel or die for emperor Cheney\nMaybe I'm crazy but I will not just follow the herd\nUnless, of course, it's en route to lynch Mike Bloomberg\nBeing pimped by a gas pump and all its Saudi members\nAre like \"fuck you!\" with New York's two middle fingers\nIf the opposite of pro is a con then look beyond this\nThe opposite of congress must be progress\nWhat if the second coming's aborted and put in the dirt\nI still don't know what to wear with this orange alert\n\n(Run, coward)\n\n[Interlude: Jello Biafra as George W. Bush]\nI was proud the other day when both republicans and democrats\nStood with me in the Rose Garden to announce their support\nFor a clearer statement of purpose: you disarm, or we will\n\n[Verse 2: Cage]\nAmerican flags fly, moral's high\nA unit of twenty or so repelling from apaches in the sky\nInto a village of killers, little Jimmy from Jackson\nMississippi, just graduated and seeing action\nM-16 locked, loaded and spitting properly\nWhoever's in that line of fire - chest full of democracy!\nTurn the corner, team leader, neck up, to the nose gone\nBlown off, this is not PS2's Soccom\nJimmy stays so calm, shoots, count nothing\nRiddled in his back answers come flying out his stomach\nFace down, then it's face up in a bed, almost dead\nEyes slightly open, IV bag and no legs\nA couple sandwiches and some bloody bandages\nIn a room full of amputee GI amateurs\nHe gets the word that his unit didn't make it\nGot a free ticket home but flat lined before he got to take it\n\n[Interlude: Jello Biafra as George W. Bush]\nWe're certain there are people that can't stand what America stands for\nWe're certain there are madmen in this world\nAnd there's terror, and there's missiles\nAnd I'm certain of this too\n\n(I hunger)\n\n[Verse 3: Cage]\nCops tape the scene up, gunner downs 9\nThey're chasing away kids playing hop-scotch in this chalk outline\nTwo F-16's, screech an iridescent sky\nLook down, we're not in Iraq, we're in N.Y\nRats in the streets, we move underground like earthworms\nTwo coasts couldn't abort Satan in his first term\nThe army in the subway, walking with toolies\nI'm on the train with the back of the dollar bill still talking to me\nDrive with my left, I know what's right - my weapon hand\nLike the map of DC streets still shows a pentagram\nLicense on the car window when I pass through\nYou've seen the news, no joke, New York pig department will blast you\nMy Weathermen party is invite only, soldier\nCause with one wave of King G. Dub's scepter it's over\nThe right to assemble puts the bureau's team on you\nLook into my file and nod to this while Jello screams on you\n\n[Outro: Jello Biafra as George W. Bush]\nBy our efforts we have lit a fire in the minds of men\nIt warms those who feel its' power, it burns those who fight its' progress\nAnd one day this untamed fire of freedom will reach the darkest corners of our world\nIt is the policy of the United States to seek and support the growth\nOf democratic movements and institutions in every nature and culture\nWith the ultimate goal of ending tyranny in our world\nExcept right here at home! Hee-hee-hee-hee!\nYee-Haw!\nDon't mess with Texas! (x4)\nConnie...Connie, give me some pretzels\nMommy, mommy, give me that bible\nGive me that bible with the pages cut out and it got that cocaine in it\nC'mon, c'mon, don't mess with Texas!\n(snorting sounds)\nI'll fuck anything that moves!"}]}