{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "Elbows", "lyrics": "Hey homeboy, what you know bout them local house parties?\nPosted right next to the hennessy\nWe do the same old dance over here\nWe like..\n\n[Hook]\n\nPoke ya elbows out and swang like this\nPoke ya elbows out and swang like this\n\n[Verse 1]\n\nHold up homie, you ain't known around here to roll up homie\nMight get your face swollen up homie\nDon't, run up run up you know I got the kodak on me\nI load up like U-Haul trucks, YUP\nDon't get your whole crew stuck\nIn a position that they can't get out\nWe lay em out like Ricky on that plastic couch\nAnd Q can save you, know of the scholarship they gave you, OUCH\nDon't you know we ain't going for the okie doke\nWest Coast New Edition, Biv Devoe\nBaby bib around your neck niggas, I feed you with the better flow\nHit the flo' when we shootin, ruin house parties\nThere's too many black bodies in one place equals a fuck up\nSomehow some way, its fucked up ain't it\nBut we ain't lookin for the drama today\nWe tucked the hammers in the hoodies to come and put him away\nNow everbody\n\n[Hook]\n\nPoke ya elbows out and swang like this\nPoke ya elbows out and swang like this\nPoke ya elbows out and swang like this\nPoke ya elbows out and swang like this\nWhatever you wanna call it\nFor the weed heads and for the alcoholics\nNow this could be some OG lowrider music\nOr you can twist your fingers up and gang bang to it\n\n[Verse 2]\n\nI got some ese homies that so loco\nThey be off that wet\nThey be hanging out thugging, they be banging sets\nThey be hanging out, sagging everywhere Im at\nI ain't gon lie about it\nGot your car at the light, we gon crowd around it\nThink you a baller huh?\nThink you a flosser huh?\nWell you should know that the chain gotta come off ya huh\nBefore they put it to ya brain gotta off ya huh\nHe got it for ya, what you want?\nWeed, wet, white, E pills, syrup\nWhere the chronic at? Let it burn up\nLet it burn till the Lord come\nLet the Monic spokes turn till they can't turn no mo'\nTill the neighborhood watch ain't concerned no mo'\nI let the neighborhood watch when I open the trunk\nA car show is what they got and everybody go\n\n[Hook]\n\n[Verse 3]\n\nWhat you know about that California lifestyle?\n[Problem seeds spitting on the ground follow me?]\nIm giving you a walkthrough of the block and down the street\nLos Angeles scan less, police Cutlass and Caprice\nAnd problems with scrapers underneath\nLollipops and bad bitches runnin in flocks soon as the car stop\nAs soon as the beat drop\nWhen it come back on I bet the whole city rock\nWord to Jay Rock\nI told you that Im focused mane\nI do my dance I know that you notice mane\nAnd I rep, I rep like Im supposed to mane\nTop Dawg ENT, we some soldiers mane\nAnd the coldest thang about it, no swag right now I do it without it\nNow let me put it on\nYou should move this way soon as she hear the song\nDon't wanna see no elbows straight\nEverybody just\n\n[Hook]"}], "artist": "Kendrick Lamar"}