{"artist": "360", "songs": [{"album": "Rarities", "year": null, "title": "Humphrey Bogart", "image": "https://images.genius.com/e43ac3b183667bcbd9c5f60579b33f10.220x219x1.jpg", "lyrics": "[Intro: PEZ]\nUh\nForthwrite\nAntiheroes, check it\n\n[Verse 1: Lee Scott]\nI may talk like my brain’s warped\nBut I could step at any session and end it with a [?]\nThis ain't no game, sport, and if it is\nWe're not playin' on the same court, I said with no heart\nI could make war with Bogart so don’t start\nHo, I stay spaced, when your show starts\nI throw darts at your game face, yo\nMy mind’s a plain waste, I’m too hungry to say grace\nKeep your prayers for passion meals, I eat scraps\nBeneath the stairs in a cheap flat in Castlefields\nDon’t even speak back, I plan to steal\nEverything, from your tracky to the medicine in this baggie\nHarass me, now the cyanide in your brandy\nYou call me a bastard and I reply with “Exactly”\nThe formula of a nasty accident\nAwaitin' to happen and I’m laughin', embracin' it\nThe look on my fuckin' face is sick, whatever’s comin'\nI’m awaitin' it, no pressure’s runnin' through my brain and shit\nI mainly sit and chill, spittin' ill rhymes\nBars upon bars about how ill his rhymes are\nAnd I charge for ‘em now, for each verse I want a car and a house\nAnd I ain’t sold shit, Antiheroes\nBroke kids with platinum egos\nI roll thick when alone, stoned with a whole clip in [?]\n\n[Verse 2: Salar]\nWhen I die I hope you go to hell and get rejected\nGet thrown in an AIDS infected, waste collected, place scented\nWith blood, get your face cemented, then crushed and ended\nWith a hammer till it's asymmetric\nHow's that for a crazy head trip? It's hectic\nSix million ways to die, to you I hope they're all implemented\nSix million states of mind all interconnected\nIn my brain, all mixed and causin' stresses\nAnd the result is this raw war message\nYou'll all get hit or develop a gore fetish\nMeant to be physically tested\nGiven crude oil, I'm forced to neck it, nuttin' more expected\nYo, check it, the flow is perfected\nEvery punchline [?] is deflected, directed\nStraight back at the source's first exit\nIt's like a slap to the jaw, I stay quiet\nTill heads start feelin' cocky and begin askin' for war\nSo stop frontin' 'cause we sense the pre-tense\nYou ain't bad, you was probably one of the prefects\nWhat happened? You used to be on it, you reject\nDo you smoke too much green? (Yes) You losin' sight\n[?] dream, six points, you still ain't writin' the theme\nNow, I ain't tryna impress (uh)\nJust because my mother knows a little something like I am the best\n\n[Verse 3: 360]\nYeah, and when I write, I put the knife in your pegs\nMy rhyme book's a tattoo 'cause it's inscribed in your chest\nFuck '60, I'll change my name to Kylie or Jess\nBecause I roll around Melbourne on a bike in a dress\nThe definition of a sellout, livin' life for the cheques\nI'll only write rhymes till I'm rich and drivin' a Lex'\nI'm crazy, I'll drive it up and down the side of a fence\nWhile wearin' diamonds with PEZ and wavin' hi to my friends (hi!)\n\n[Verse 4: PEZ]\nAnd I'm the kind to always lie in my bed\nThrowin' slices of bread, cryin' and say \"why aren't I fed?\"\nAnd I'm nice despite live there's only mics in my set\nMy DJ said \"bye\" and he left because I'd fight with his decks\nYep, I find that life is why inside, I'm upset\nI'm excited by death, for me suicide is like sex\nBut it's kind of a mess, I'm tryna find a new quest\nI'm only rappin' this because it felt like time to confess\n\n[Verse 5: 360]\nYeah\nHey, you got no idea what's goin' on inside of my head\nNah, nah, really, I mean what's on inside of my dreads\nWith all types of insects who always try to infest\nAnd different spiders in webs, they're all combined at the legs\nI've been an alcoholic since the first time I was blessed\nBaptised by a keg, buy a pint of Piney or Beck's\nAnd Mum didn't help, because inside of her chest\nShe didn't have milk, I was drinking wine from her breasts\n\n[Verse 6: PEZ & 360]\nWas it a white or a red? Hold on, I'll slice 'em and check\nOi Mum, come and meet me now outside on the steps!\n\"Why?\" 'Cause I said! \"Have you had your vitamins?\" Yes!\nShut the fuck up '60 before I bite off your leg\nAnd you're only left with your right 'cause your other side is a peg\nAnd you have to hobble your arse around, look like a pirate with dreads (fuck off AIDS)\nWhat? I haven't got AIDS, I made 'em lie on the test\nNow, I can live in denial with hepatitis instead (yes)\n\n[Verse 7: PEZ]\nIt sounds good but I'm still kind of depressed\nIt's combined from the test and tryna win the title in chess\nAnd I'm stressed, lookin' like I'm Frankenstein in a vest\nGotta try to get dressed with this fuckin' pipe in my neck\nUh, think you can kill me, take my life in a sec?\nWell, you're wrong, I'm too good, I won't even die when I'm dead\nMy rhymes are the best, look, see my mind in effect\nNah, really you can, I'm missin' the eyes in my head\nI'm fine now but there was nine straight nights where I bled\nBut I guess that's what you get for havin' lions as pets\nWere they tigers? I forget (ha ha)"}]}