{"artist": "Gangsta Boo", "songs": [{"title": "Nigga Yeah Know", "album": "Enquiring Minds", "year": "1998-09-29", "image": "https://images.genius.com/5283d1f21d20bdec4953ec12b3d4e43a.300x300x1.jpg", "lyrics": "[Intro - Gangsta Boo]\nYo, yo... What the fuck's goin' on\nWith all you undercover-ass playa haters\nAll motha-fuckin' snitch\nMy nigga T. Rock shit\nWhat the fuck y'all tryin' to do?\nY'all tryin' to hold us down or somethin'?\nYa know what I'm sayin', you niggas can't do that\n'Cause we 'bout it baby\nYa know what I'm sayin', it's all good\nWe can see you, but you can't see us nigga\nMe and the Rockafella, T Rock baby\nATL, Memphis, the whole motha-fuckin' south\nAnd you know that nigga\n\n[T. Rock]\nCan I begin the story of a nigga\nTryin' to make a million for eternity\nIn the city of Atlanta\nReapin', wreck an angel from a grandma\nBut it ain't no way for me to make green\n'Til my nigga T-Low introduced me\nTo Mac and The Kaze\nThen no one could stop me\nAll that juice to her, I swear ?\n? Prophet P and recruited me\nNigga I turned to Prophet Posse\nNot a gangsta, but a getter, intellect, nationwide\nSpittin' fury out my Range and ride\nBurnin' rappers like bacon fried\nWon't you tell me who'll stop a playa 50 rollin' nationwide\nProvin' high niggas that you anxious\nReplace his thang on busterous trains and camps\nWatch us from gauges, we snatchin' your soul\nAnd vote it Heaven or hell, you lames can vamp it\nAnd you's a nigga tryna spread a story\n'Bout some shit that didn't happen in my lifetime\nAll you fakers and phonies are on the edge\nLike a superstar man walkin' tightlines\nEver want a nigga on the white grind\nNationwide niggas on the rise\nSportin' a disguise, creep up on ya\nAnd it don't matter what ??\nTriple 6 kill like clan and T. Rock\nRockafella stretch a million other papers\nWon't you realize\nA nigga finally came up in the game\nAll you freaks who used to dis know what you can kiss\nAct like I don't know, you got to deal it straight\nNow you burnin' niggas down to a crisp\nAnd I don't risk 'cause I'm T. R-O-C-K\nTryna reap pay, other tricks sleeze ways\nRunnin' hoochies with gold in their mouths\nAnd take all of their goods, and not leave with no leave-way\n\n[T. Rock]\n1 - Nigga yeah know\nNigga, yeah know\nWe rollin' clean rides\nAnd we blowin' hella dope, nigga\n\nRepeat 1\n\n[Gangsta Boo]\nDo a motha-fuckin' S.O.S\nStep on sight, what the fuck you gonna do when you bleed?\nI'll be comin' with the Prophet Posse\nKnow that Gangsta Boo\nI'm 'bout the baddest bitch that you ever seen\nHow many times you wanna hold me down\nBut like that named Puffy, bitch, I would not go\nAll the other stupid shit that you be kickin'\nWhen I'm pimpin', when you slip, run into my front door\nI be rollin' with them niggas that's out the projects\nYou wanna bet\n?W-L? dub your whole motha-fuckin' chest\nBet you bottom dolla, make you holla, wanna come and hit me\nIt's money over bitches, yeah\nI'm the type of bitch that be kickin' shit\nThe type of bitch that be takin' other bitches' dick\nThe type of bitch that be all about a paper chip\nThe type of bitch that ride with the Triple 6\n\n[T. Rock]\nMiss steady and the Rockafella crew can load clips\nWith lyrical ???? the whole slip\nGangsta Boo got ????? take and slap a trick down to the floor\nAnd give her swole lips\n\n[Gangsta Boo]\nIt's all good, I think I got her to a 5\nGot you finally realizin' you be hypnotized\nMe and my nigga T. Rock ???\nWe smoked out straight to Atlanta, live\n\nRepeat 1 to fade"}]}