{"songs": [{"year": "1998-04-28", "image": "https://images.genius.com/b55066a4d9c23965c80b13a93ffa9cd0.640x640x1.jpg", "title": "Tres Leches (Triboro Trilogy)", "album": "Capital Punishment", "lyrics": "[Intro: Roc Raida & Prodigy]\n\"Wake you up and as I stare in your face you seem stunned...\" \"Wake you up and as I stare in your face you seem stunned...\" --> Rakim\n\"Wake you up and as I stare in your...\"\n\"Wake you up and as I stare in your...\"\n\n[Chorus]\n\"I wake you up and as I stare in your face you seem stunned\"\n[Prodigy] Remember P, the one you got your whole style from?\n\"I wake you up and as I stare in your face you seem stunned\"\n[Prodigy] Remember me, the one you got your rhyme style from?\n\"I wake you up and as I stare in your face you seem stunned\"\n[Prodigy] Remember P, the one you got your rhyme style from?\n\"Yo it's the P\" *cut and scratched*\n\n[Verse 1: Prodigy]\nYo, disperse from off this, who the culprits\nThat claim to be the newest, rappin' bullshit\nMy rhymes get Ruger endorsements\nMy song boost Intertec sales through the ceiling\nLet's talk with guns, convos 'til the po-lice come\nGive you a red shirt with the wet hat to match\nBurst macs like it's Hamburger Hill for real\nIt's Red Dawn when the Mobb get it on\nMy outfit stuck on some wild out shit, all about it\nWe move gambit through the overcrowded\nForthwith, pull out long fifths, extended clips\nPoint the nozzle and shift your back disc\nMe and the clique-ah sit down and eat dinner\nWake up every mornin', write a new banger\nThat strike harder than your best attempt to sound like P\nOr the H-A-V-O-C, nigga\n\n[Chorus]\n\"I wake you up and as I stare in your face you seem stunned\"\n[Rebel INS] Remember me, the one you got the technique from?\n\"I wake you up and as I stare in your face you seem stunned\"\n[Rebel INS] Remember me, the one you got your freestyle from?\n\"I wake you up and as I stare in your face you seem stunned\"\n[Rebel INS] Remember Deck, I told y'all, Protect Ya Neck\n\n\"I'm Rebel INS your highness\" *cut and scratched*\n\n[Verse 2: Inspectah Deck]\nFake one, take one, no ultimatum, face one\nThere's no escape from\nStraight from the grain come the great one\nMy blade swung, decapitate your snake head\nSlit your snake tongue, make one false maneuver - you a mystery\nUnsolved, the mob that revolves automatically involved\nMusclebound sounds surround commercial thugs\nRock turtledove Bowery suits and purple gloves\nMe and you can have some fun, make it a blast\nYou couldn't take the impact with steel shoulder pads\nBlood for blood, veteran covered in mud\nWounded in the midst of war, still tradin' slugs, gettin' major love\nWay above you newcomers\nI come thunderin' with the heat of two summers\nWhen I enter the zone, move mountains with the presence alone\nBefore the words rip through the microphone\nChrome dipped lyrics are known to split stone\nYou privatize, home in but can't seem to clone\n\n[Chorus]\n\"I wake you up and as I stare in your face you seem stunned\"\n[Big Pun] Remember Pun, the one you bit your whole shit from?\n\"I wake you up and as I stare in your face you seem stunned\"\n[Big Pun] Remember Pun, I snatched away the moon and blew away the sun\n\"I wake you up and as I stare in your face you seem stunned\"\n[Big Pun] Remember Pun, the one with over a thousand guns\n\n\"You start to suffer\" *cut and scratched*\n\n[Verse 3: Big Pun]\nYo, Big Punisher's ready\nProdigy, Deck and me, QB (\"Shaolin\") and Bronx trilogy\nLyrically hazardous for your wealth, swing on your world's piece\nFoil your plans, boil your grams, take your shine\nFold all your hands, spoil your mans, make him mine\nTake all you made, call you gay on Hot 97\nDrop by your dwellin', got the nueve right behind your melon\nAin't no tellin' when the bullet's behind the trigger\nI do it to live niggas and Pulitzer Prize winners\nYou wouldn't survive, nigga, if I chose you\nFroze you from ear to ear, showin' your whole vocal\nWho told you, you could roll through?\nMy lyrics practically rose you from the grave like The Crows do\nI told you a long time ago, don't ever fuck me\n'Cause if I leave you half dead, consider yourself very lucky\nVery ugly from the face up, leave you laced up\nJoey Krillz, Pros, Cuban Link, Triple Seis, WHAT?!\n\n[Scratches: Roc Raida]\n\"Soon you start to suffer\"\n\"The RZA\"\n\"The Inspectah Deck\"\n\"Yo it's the P\"\n\"The Punisher's ready\""}], "artist": "Big Pun"}