{"songs": [{"lyrics": "[Verse 1]\nIan why don't you say grace\n\"dear god thanks, and if you loved me vegetables would be extinct\"\nNow I'm looking down the barrel of a string-bean side like an exodus of biblical proportion redefined\nRectangle seat 4, squeeze 5\nEach one may not be excused from the table ‘til the green gone\nStomach revvin‘ up an episodic rerun\nWhere's a dissipating plume of smoke when you need one?\nChris and Graham hate ‘em too but advocate a braver chew invented for the code red, cola chaser, nose held, gulp!\nMoments later 2 have been released\nLeaving me the legroom and the legume police\nGoing \"freeze, you with the pretzeled arms\nSend your fabricated nausea my best regards\nAnd know this kitchen as a prison ‘til the pea pods die\nI could sit here all night\"\nSo could I\n\n[Hook 1]\nWho was at the door just now?\nKids on dirt bikes asking you to bunny-hop the curbsides Really?\nYup I told em \"oh he busy, he staring at his green beans being a total pussy\n\n[Verse 2]\nBlink Twice if you are being held hostage\nI speak and spell of a sleeper cell in the hospice\nWoke, impersonating busy little helpers\nThat intimately purr between the hiccuping up of feathers\nPick a porcelain dish\nA single portion canned\nFrozen or fresh\nDefies the glory of the Poultry or fish\nVia communal bloodletting that rupture the spud levy\nNo '87 supper-scape was truly flood-friendly, ever\nIncluding at your basic cemetery for contaminated textures 60 minutes into never\nWhere room temp heirlooms emanate a crude black mist\nTo a rendition of \"dude, dad's pissed\"\nTell dad dude's pissed too\nNot to mention genuinely brandishing a the new gill hue\nStill out-mule any last strafing watchmen\n‘Til the lord taketh waiting as an option\n\n[Hook 2]\nWho was at the door just now?\nKids on dirt bikes asking you to bunny-hop the curbsides Really?\nYup I told em \"oh he busy, he staring at his green beans being a total pussy\nWho was at the door just now?\nKids on skateboards asking you to navigate the claymores Really?\nYup, I told em \"oh he can't, he in the kitchen pouting and terrified of a plant\"\n\n[Verse 3]\nLess like toes in a tide pool\nMore like, left, right, poached from notable giant Kaiju\nFat neck, fine tooth, rock and lean, yelling\n\"This ends now eat the god damn beans!\" Ah!\nHangdog mouth talk slang wrong and that there's flatware exhumed by a crane arm\nTime for some action\nStab one ripe for a swipe and extraction\nBrined in malpractice\nCarried to the cavernous yap and obliged access\nIf only in compliance with a deep-fried fascist, peep\nLiterally bite down once\nAnd my tongue get a flooding from my uninvited guts\nPointer finger plug a hole in the dam\nMa notice, \"ok gross, blowfish, dinner's over, go spit\", pop call \"bullshit\"\nBoth of my brothers break in, like \"he's on his Davie Hogan no mistakin'\", by the way\n\n[Hook 2]\nWho was at the door just now?\nKids on dirt bikes asking you to bunny-hop the curbsides Really?\nYup I told em \"oh he busy, he staring at his green beans being a total pussy\nWho was at the door just now?\nKids on skateboards asking you to navigate the claymores Really?\nYup, I told em \"oh he can't, he in the kitchen pouting and terrified of a plant\"", "title": "Grace", "album": "Skelethon", "image": "https://images.genius.com/be7ecb35b49d25728281da97d28c2ca1.1000x1000x1.jpg", "year": "2012-07-10"}], "artist": "Aesop Rock"}