{"songs": [{"year": "2018-12-07", "album": "Subtle Meditation", "image": "https://images.genius.com/06c2afa0f8860f128094b4fd2880238d.668x668x1.jpg", "title": "1492 Conquest of Paradise", "lyrics": "[Intro]\nWhat the fuck?\nUh-huh, uh-huh\nSay what the fuck?\nUh-huh, uh-huh\nYeah what the fuck?\nYe-yeah, ye-yeah\nSay what the fuck?\n\nAnd we back, yeah we back\nSaid we back, so relax\nYeah we back, and we back\nSo relax, just relax\nSaid we back, yeah we back, yeah we back, yeah we back\nSo relax, just relax, just relax, just relax\n\nSay how you feel, nigga tell 'em how you feel\nSay how you feel, nigga tell ’em how you feel\nSay how you feel, nigga tell 'em how you feel\nSay how you feel, nigga tell 'em how you feel\n\n[Verse 1]\nShit\nI’m feeling like fuck it I'm taking mines\nAlways been a nigga with a disposition\nDidn't ever listen so I played the villain\nPacing like a mental patient, 'bout to kill it\nGotta get it while the getting's good\nI'ma strike while the iron's the perfect heat\nMan I make all these niggas look obsolete\nThe examples of what you should never be\nTake the pen and I create a masterpiece\nDa Vinci for the beat, let it rest in peace\nI'm an anomaly that you never seen\nOn the course for the wealth, I’m not talking green\nLooking for the knowledge, nothing in between\nSaid my pendulum swing like a guillotine\nI’m convinced I can really do anything\nSaid my shit is dope, it sound like Medellin\nYou fuck around, they'll find you in the mezzanine\nI wanted better things, a mausoleum dream\nI’m the immortalized now treat me like a king\nI'll fill the void you're feeling\nIt's the craziest thing that  I make ’em swallow\nYou should [?] see tomorrow\nCause the time we living on is fucking borrowed\nGotta pay into this if you play the way you try to get out the same position you been in\nIt appears that you fought wit' yo' back to the wall if you really gon' rat on them all\n\n[Verse 2]\nI payed the cost, I took a loss\nYeah I got [?] and I know this\nBut I regroup, then I recoup\nGot off the ground and then got on my grind\nMoving forward, I'm not looking behind\nSecond guessing wasting all of my time\nDon't block out my light, just let this shit shine like aah\nCan I breathe?\nCan I think?\nCan I just be me?\nIndentured servitude, y'all act like it's a crime to be free\nWhen I rhyme, I release, this tension on my mind\nCan you please show some compassion to a nigga before the day that I leave?\nI'm tryna float like a butterfly, and sting like a bee\nPerspective I speak, can show you how the caged bird sings\nA black mans nightmare is the new American dream\nLet's make it great again\nBut can you inform me when this shit was great for everyone and not just some, I wonder\nColumbus stumbled upon the mainland by making a blunder\nA couple more days at sea, the Nina Pinta and Santa Maria would have definitely fucking gone under\nA fleet of pagan savages led by a broken compass\nSaved by the same people, they were than slaves\nSpreading disease, they rape and pillage everything that they seen\nWhat do you mean American history?\nThey hideously hidden everything that they've done\nThat can't be forgiven, look but that's just me\nAnd when the land and acres were split for the bread\nWell, that's when it stopped being the land of the free"}], "artist": "K.A.A.N."}