{"artist": "​iLoveMakonnen", "songs": [{"title": "SINCE 17", "lyrics": "[Intro]\nYeah\nMake a nigga not send me no beats no more\nYeah\nChris this shit so for real\nYeah, nigga\n\n[Chorus]\nSince 17 boy, since 17\nI been running with the plug since I been 17\nBeen really had them things boy, since 17\nBack on every scene we sell 'em all for 17\nFor 17 boy, for 17\nI been the man since 17\nBeen countin' big bands since I been fuckin' 17\nMy homeboy just came home, that nigga did 17, ayy\n\n[Verse 1]\nNow I'm out here selling molly again 'cause I need more\nNigga selling more coke than I be making at a show\nAin't that a motherfucking shame, fucking with them lames\nBut goddamn every city swear they know my fucking name\nI be whipping, I be cripping\nAnd my cousins be blooding\nWe out here making so much money\nNiggas' streets I be flooding\nTold these niggas that I'm back\nNigga stack that shit up\nI wish a nigga would hate on me 'cause I will pull up\n\n[Chorus]\nSince 17 boy, since 17\nI been selling dope since I been fucking 17\nBeen really on the scene since 17\nCounted big bands hey, on every scene\nTell me what you mean boy, since 17\nReally got them things, I sell them all for 17\nBeen running with the plug since I been 17\nBeen, been the man since, I been 17, hey\n\n[Verse 2]\nHold on, ever seen a young nigga selling lean?\nGot that purple shit, motherfucker what you mean?\nLooking like a Laker, don't have no time for haters\nOld shit, you know I tell 'em see you later\nAll down in Florida, check my shoes nigga, gator\nMotherfucking escalators\nAs we riding up to the penthouse, nigga what you talkin' 'bout\nBitches wanna tweet me and niggas wanna meet me\nHey, won't you pay that fee\nAt my fucking meet and greet\nHey, we could smoke and dro\nYou know that my shit come from\nAye, out in valleys, niggas swear they know me\nHuh, fuck around and I hit 'em with the old me\nLike uhh, since I'm 17, nigga been sellin' strong, goddamn\nWhat you mean? I be snappin' on every song\nTell them niggas to end the beats and don't send me no fucking beats\nCause I been going so damn hard since a nigga been 17", "image": "https://images.genius.com/aa3839c02d2e9a443ff81d45f35e5c84.1000x953x1.jpg", "album": null, "year": "2017-03-21"}]}