{"songs": [{"year": "1999-10-26", "title": "Pokerface", "image": "https://images.genius.com/9841a200e7b94485d7e2a91b3dbd2520.700x700x1.jpg", "lyrics": "(Gamble) (gamble)\n(Nobody move) --] Smoothe da Hustler\n\nUgh\nYeah\nUgh\nYeah now fuck that\nCheck this out, man\nYouknowmsayin?\nAll you niggas with them muthafuckin pokerface on\nAnd don't know how to pull no real-ass cards\nYou step your punk ass back into the plaster, nigga\nYou understand me?\nI'm not tryin to feel you\nStraight up\n\nPokerface\n\n[ VERSE 1: Saafir ]\nCash in your chips, I'm hot, I got the fever\nWhere the dealer?\nNobody move, it's my turn\nI'm shakin the dice of life with a tight grip\nI'm flippin the numbers, mayn, a hustler that be lovin pain\nYou better watch the dice cause they be runnin game\nThe name don't fit the face mask and all my whole nine\nYou ???? with a .45\nAnd I bust it through your pokerface\nCause I know it's fake and simple ??? pimp\nSeein through your face like ??? on a ho named Pimples\nYeah that's what you covered with\nPits all in your face, no deeper than dimples\nNiggas is shallow but I'm knowin\nCause I got the nostrils that knows I'm the shit\nSmell me, really do ???? a lots intoxants\nYou can't peep me, keep my face, you frostbitten freaky\nMy grill stayin in 3-d\nYou, you, you can't, can't, can't see, see, see me, me, me\n\n[ Hook ]\nWho got the dice so I can take your life\nCash in your chips, I'm hot, I got the fever sittin on a block of ice\nStill can't peep me, keep my face, you frostbitten freaky\nAnd I stay cocked\n\n[ VERSE 2: Saafir ]\nYou cats is rappin with jokerlips\nWith them corny-ass stiff comedian-ass ingredients\nFly niggas get broke like (what?) kites\nWhen you gamblin for your life with only two poker chips\nStrip, click-clack, you know that shit\nNiggas shakin the dice like mice runnin a rat race\nWell in that case rewind a nigga twice like Christ\nI'm rockin his daddy's ice (that's some cold shit)\nWe give a fuck about ridin a trick in a Six\nOr decoratin a vagina with diamonds\nPlayas that need to get traded\nAnd dropped off on a slave island in the Caymans\nA granddaddy at phrasin\nAnd a master at assemblin ass in pasture when it's grazin\nI'll pull your broad like a horse\nAnd I'm holding the reins cause I'm alway reignin, I'm always flamin\nI stay high when I'm bustin, I stay cock-poppin\nYou cocky-ass Rocky's\nAnd lady, I ain't the father of your baby, ho\nWhen your pokerface look like mashed potatos and gravy though\nYou need to eat, huh? You look the part\nBut you don't walk the talk\nThe toes are like ten lies on your feet\nWhen you speak no heed\nYou couldn't bake big pies with the recipe\nIf I leave you in a darkest den you likes to see the rest of me\n\nPokerface\n\n[ Hook ]\n\n[ VERSE 3: Saafir ]\nMy pokerface is so straight\nI can buy the painting of Mona Lisa\nWith a Visa\nOr you can invest in me\nA real shark at the bottom of an infested sea\nThe style is on the run, my rap sheets is deep\nBut the hip-hop police ain't arrestin me\nMove that vehicle, this ain't the streets you park on\nStart dippin into some parkin lot pimpin, move out that marked zone\nUnplug your microphone and turn on your VCR\nAnd watch this porno star\nLeave your ass like gas\nStuck and fucked and mad\nRippin the doors off the hinges\nJealous niggas wanna kill me cause I'm in they hood like a engine\nI'm just idlin with a game of God fame\nAnd broads got you doin strict crossovers like Iverson\nThese herbs be herbed, Chinese vitamins?\nNah, these niggas need verbs\nThat's so cold to keep hype niggas in furs (brrr..)\nI'm gone, one, bum-ass dumb nigga\nMy pokerface got nerves\n\n[ Hook ]", "album": "The Hit List"}], "artist": "Saafir"}