{"artist": "50 Cent", "songs": [{"album": "The Massacre", "image": "https://images.genius.com/ca36dfbff5c6dfcea453afdb61476f86.1000x1000x1.jpg", "title": "Outta Control", "lyrics": "[Intro]\nYeah, Shady, Aftermath\nI - guess - you didn't know\nI - be - back for more\nEvery-body's - on the floor\nGoin goin outta control\nSet it off on yo' left, dog\nSet it off on yo' right, dog\nSet it off\nNigga I said set it off!\n\n[Verse 1]\nHa ha...\nSick with it, boy better get with it, what?\nIn the club I get it goin, goin, uh\nJust movin to the music it's on\nAnd the sounds of 50 and D-R-E\nEverything's calculated and sound precise\nAnother move another mill', let's get right aight?\nSuccess is my drug of choice, I'm high off life\nFeelin lucky enough to bet it all on the dice\nShorty do what you wanna do, hit the dancefloor\nAnd move how you wanna move, later on\nWe can cruise if you wanna cruise, it's whatever you want\nThe fact is I got more than I flaunt, yeah\n\n[Hook: 50 Cent]\nI do my thang, in the club\nEvery chance I get, I tear it up\nDancefloor jampacked, look\nI got 'em goin goin outta control\nSet it off on yo' left, dog\nSet it off on yo' right, dog\nSet it off\nNigga I said set it off!\n\n[50 Cent]\nSystem thumpin', dancefloor jumpin'\nWe 30 deep in this bitch, we stuntin'\nThat's what you get, you in my hood\nI thought you understood - you know me\nV.I.P., no ID\nBottles of DP, I do it real B-I-G\nBitches break their neck to be where I be\nTake 'em to ecstasy, without ecstasy\nI'm a chef you need the hit I got the recipe\nDoc got the antidote, it's in the drums and the notes\nCan you feel it? Em said for me to make you feel it\nAnd remind you that you rockin with the realest\n\n[Hook: 50 Cent]\nI do my thang, in the club\nEvery chance I get, I tear it up\nDancefloor jampacked, look\nI got 'em goin goin outta control\nSet it off on yo' left, dog\nSet it off on yo' right, dog\nSet it off\nNigga I said set it off!\n\n[50 Cent]\nI'm hot boy, I'm burnin up\nI do my thang in the club with the burner tucked\n'Til the speakers all blown, we gon' turn it up\nAnd do that damn thang, yeah do that mayne\nShorty, hit me high then hit me low\nGet to poppin and shakin that thing on the flo'\nA little dose of it, now I want some more\nNobody put that thang on me like that before\nI be a fiend for it, it's the way you move\nBut I ain't payin for it, cause I ain't no fool\nIf you okay with it, tonight I stay with it\nHit the telly play with it in a major way get it\n\n[Hook: 50 Cent]\nI do my thang, in the club\nEvery chance I get, I tear it up\nDancefloor jampacked, look\nI got 'em goin goin outta control\nSet it off on yo' left, dog\nSet it off on yo' right, dog\nSet it off\nNigga I said set it off!", "year": "2005-03-03"}]}