{"songs": [{"year": null, "image": "https://images.genius.com/d530c52ed07699f53b2c873775b96848.500x500x1.jpg", "title": "He Told Me", "album": "Speaking in Tongues", "lyrics": "[Chorus: Kahnma]\nOur father, what's your desire?\nWe give you things in praise, your name we call upon\nThrough these trying times we have come to find\nWe put our trust in you\nYou give us strength to do the things we wanna dooooo\n\n[Bizzy Bone]\nNot a party, but we did it like children study in school\nI refuse to get deep deep inside of the mystery to know that it's you\nHow many people are true?\nNever could stress me out, thinkin attention of who?\nMention the representation of plus dedication I'm lacin up the boots\nHappily out of the wonderment now\nMassage a thought, never could be my style\nShoulda been bred they brought, go and provide some perfect wild\nForever in a day and including now, beautiful love when nobody's around\nHow could I clown when it's so profound, you know what I'm talkin about\nRound for round and pound for pound, Heavenly Father I praise him now\nOur lord and savior Jesus Christ, Lord comin in on a cloud\nNever commit adultery, phsyical thinkin outtakes the spiritual\nNever neglect the fact that, bad medicine, leads to sickness literal\nI think you think too hard\nAnd yes, we're comin up out they yard\nWhat do you see? I see them soldiers takin charge, march\nI see them soldiers takin charge, march\n\n[Chorus]\n\n[Bizzy Bone]\nIn the God of the name of Jesus Christ\nThe father, the son and the holy spirit\nSaid in Psalm 7, \"You do unto others as you would want them to do to you\"\nHonor mother, honor father, praise God\nLove your brother and it'll be one love\nTo the day way sinnin be livin and it'll be alone, oh - feel it, heh, ooh\nWhat they wanna do? I see jealousy, element of people in the family\nCheck out the medley, ow, we sinnin up felonies; thank you\nPraise God runnin and the police thank you\nElementary in the love school 'til the women come out to beef\nAnd I'll shank you, shook you, shank you - heh, heh\nAnd runnin in the belly of the beast I stank you, element shank you\nAnd it's worse than a canker sore, don't let 'em flank you, thank you\nDon't let 'em flank you, haha\nI think you think too hard\nAnd yes, we're comin up out they yard\nTell me what do you see?\nI see some soldiers takin charge as they march\n\n[Chorus]\n\n[Bizzy Bone]\nBring that song to the Bentley{?} swangin\nThe wind is changin, spirit be arrangin\nStrange as it seems in these crazy dreams, lean, on Jesus he's as one\nThat's the real thing, that's the real team, got some real cream\nPoppa makin honey, not money but the real bling\nBada-boom bada-bing, and let your freedom ring\nOh me, I'm mystical as ever all clerical, no little bits in the wind today\nCannibals pullin out a can of that bullshit\nThat bullshit, tell the bitches plan away\nScan away, literally been broke with a script\nIn the name of our lord and savior; Jesus Christ\nIn the name of the father and the son and the holy spirit all of it wise\nThat's why\n\n[Outro: Bizzy Bone]\nHolla back, one true God\nI want you to spit it just like that\nWhatever, whatever happen happen\nThey ain't gotta like this shit\n{*starting to mumble*}\nTell them motherfuckers out here it's for me\nI want you tell 'em somethin\nI want you to tell these mudder-fuckers\nThat I said they can kiss my ass!"}], "artist": "Bizzy Bone"}