{"artist": "Vanilla Ice", "songs": [{"title": "Stop That Train", "year": "1990-09-03", "lyrics": "1,2,3,4\nIt was an average night backstage at a show\nI seen this girlie that I knew, she was a cutie and Yo!\nShe had it goin' on from her head to her feet\nHer shape was so petite, and so unique\nHer eyes flamed with passion like she was possessed\nAs I shivered and quivered while she rubbed on my chest\n'Slaved and engraved I couldn't scream\nMoaning and groaning like she could take on the A-Team\nI was one of many that she'd choose\nDo me, pursue me, twice as nice but don't refuse\nLeaving her breathless as the sweat poured on\nThe spot that I was in was so soft and warm\nThis was far from a story you will find in a book\nHot off the platter, and boy, could she cook\nRoastin' my body it left a stain in my brain\nAnd all I kept sayin' to myself was\n\nStop that train, I wanna' get off\nStop that train, I wanna' get off\n\nOh my God, what have I got into?\nSooner or later I thought she'd get the clue\nCause my body was tired and full of sweat and perspire\nThe situation I was in could've started a campfire\nNo more skeezin' and teasin' for the Ice right now\nI found me a corner, play it cool for a while\nJust mackin' and schemin' on a woman I thought was cool\nBut now I realize that the Ice was the fool\nCause a woman will play you, lay you and obey you\nYou better watch your back cause a woman will slay you\nNot to mention the one who got me\nYea, she got me, the I-C-E\nBut, back to the story of a one night stand\nI thought I was strong but she was He-man\nLovin' every second tryin' to make me blush\nAnd all 'n all it was for the lust\nI though, she was an angel and soft as a cream puff\nUntil I seen her come out with the whip and handcuffs\nBreathin' down my neck I was scared to death\nThe sweat from my body as it rolls down my neck\nAnd out of all nights, where was my crew?\nCause this was somethin' I didn't know what to do\nD already told me that the girlie was strange\nBut I didn't know until she pulled out the chains\nWalkin' and stalkin' towards me with a plan\nAnd now I regret all the things I was sayin'\nNow the moment is critical, so what should I do?\nLeave while I can, or just take the abuse\nNow I'm drippin' with sweat, Why? Cause I'm afraid\nHandcuffs and chains is a game I don't play\nNo doubt in my mind that the girlie is the boss\nStop this train cause I wanna get off\n\nStop that train, I wanna' get off\nStop that train, I wanna' get off\n\nLater on that night as it got worse\nMy body's steamin' up and I was ready to burst\nShe had me hot as a skillet taken from a flame\nAnd my admission was free for me to ride on this train\nYea, I must admit to myself, it was fun\nBut, now I'm lookin' for my shoes, I'm ready to run\nSo, now I'm hopin' and prayin' for the moment to come\nCause I couldn't move and my body was numb\n\nSo, now what have I done to get myself into this?\nIt started from a kiss, now I'm ready to resist\nI couldn't take it no more, on the bed, or the floor\nMy knees were gettin' weak and my back was gettin' sore\nThe room was destroyed, not to mention my body\nWhy did I ever tell her to \"Pump it, Hottie?\"\nWhat could I do to just ease the pain?\nI think I'll let the hook just try to explain\n\nStop that train, I wanna' get off\nStop that train, I wanna' get off", "album": "To the Extreme", "image": "https://images.genius.com/5078fff4f8c0f4d1704f492654dc4064.1000x1000x1.jpg"}]}