{"songs": [{"year": null, "title": "Sauce for Birdheads", "image": "https://images.genius.com/f9892894da5ef46b99300e48b63438cd.1000x1000x1.jpg", "lyrics": "[Hook: 8x]\nYeah, yeah\nLet's get it on\nDon't sleep cause you might slip, yo\n\n[Verse 1: Shawn Black]\nEyes was gazin' as we came through blazin'\nHoneys gamin', I caught this money maintaining, uh!\nNow back to the problem that just ocurred\nYo, you reap what you sew, peep my flow really dope, yo\nThe drug traffic, crack packin', Shawn Blackin'\nBrother in the back, he with the nickel-plated Mac 10\nActin' as if, but son caught the 4/5th\nSpittin' out clips, he's shootin' down with 6/6\nNow went side the rooftop, I had 2 Glocks\nMy bitch had the out of town tickets right in the shoebox\nNow we all settin' up shop with Pearl Drops\nConnect our props, my click don't tickety-tock\nClientele, word is born, quite strong\nWith Black Shawn the bitch slid, with a stash of two bricks\nI had to see you when we reached Connecticut\nNow I jumped on the celly, bad feeling in my belly\nThat war broke I left the whole crib smelly\nWe all about ballin', yo you slip when you fuckin' fallin'\n\n[Hook: 8x]\nYeah, yeah\nLet's get it on\nDon't sleep cause you might slip, yo\n\n[Verse 2: Sadat X]\nHey yo, 2 bricks lost, that's a lot Black\nHey yo, I told you 'bout them ho's dick\nHo's will be the death of you\nThey'll lead you in ambush\nAnd there won't be nothin' left of you\nThat's hard-earned, I ain't got no money to burn\nAy yo, where's this chick at? Uh-huh, For real get my money back\nCause I don't give a fuck where she go or who she know\nJust recover that, don't make me smother this witch\nAin't you with me Shawn Black? Don't you want to be rich?\nCause I'm too old and it's too cold to pick\nOutside hand-to-hand, I don't wanna be the man\nYa understand?\nFed's hate him for years, totalin' up to a grand\nKids in Virginia is gettin' football number\nThe thinking man thinks while a sleeping man slumbers\n\n[Hook: 8x]\nYeah, yeah\nLet's get it on\nDon't sleep cause you might slip, yo\n\n[Verse 3: Shawn Black, Sadat X]\nAin't no trace, I guess murder is the case\nHey yo, honey look good so don't rock in her face\nI seen ya type of action in the discotecs\nShe had this nigga from behind the speaker, you didn't peep her?\nShe smokin' reefer and drinkin' Harvey's Bristol\nCream on the plate with the ice\nI will entice the hoe and then price the hoe\nAnd then grab my dough and leave his flog on the floor\nNo traces, cause rap stars can't change their faces, ahh!\nThe faces and places have been slid to the rear\nThere's blown trees off the bridge\nThe convoy of cowboys with there\nHey did we do our thing Black?\nYeah we put her in the smash\nNow the 25th to the 30th precinct\nCan't see us cause we move on basic instinct\nThey want to be us but that ass is just too stink\nWhat the hell they think would happen?\nDuck down; niggas is clappin'\nIt's lifeless and always does it trife trick\nOut of my strip, everybody gotta represent\nForget a motorbike, I wanna lamp in a GS legit\nSo I can get that same bitch stressed\n\nYeah, yeah, the great Shawn Black and Sadat X\n\nDon't sleep cause you might slip\nDon't sleep cause you might slip\nDon't sleep cause you might slip (Lets get it on)\nDon't sleep cause you might slip (Lets get it on)\nDon't sleep cause you might slip (Lets get it on)\nDon't sleep cause you might slip (Lets get it on)\nDon't sleep cause you might slip (Lets get it on 2x)\nDon't sleep cause you might slip (Lets get it on)\nDon't sleep cause you might slip (Lets get it on)\nDon't sleep cause you might slip (Lets get it on)\n\n(Lets get it on) x2\n\nKilla Columbus\n\n(Lets get it on) x5\n\nOG x4", "album": "Wild Cowboys"}], "artist": "Sadat X"}