{"artist": "Isaiah Rashad", "songs": [{"title": "Webbie Flow (U Like)", "lyrics": "[Produced by Mr. Carmack]\n\n[Intro]\nMy dick I know it's, yeah, it sound familiar, yeah\n\n[Verse]\nLike, baby, can you sucky on my dick? I know it's big enough\nRide with a nigga from the South, I know you feel the rush\nFucking with a nigga, bitches rarely ever get to touch\nBetter feel privileged, catch a nut or you can hit the dust\nI done grown up for my child sake, black and mild face\nBlick and blaow place, never crowd spaced\nNever skirt chased, maybe first grade\nNever last place, never had brakes\nPop a transmission, always had faith\nAlways had trace, always had James\nIn that duplex, hit a suplex, fuck a crew neck\nSpottie solo up in recess\nNever regress, Georgia peaches\nGrab her cheek ass, such a slutbag\nBaby nut rag, never cuff that\nLove a hood rat, where this puss at\nBrittany have me going on that Sosa, I'll never go back\nI never hit her raw again, fucking with the law again\nPicking up trash on highways, never my way\nBlasé blasé, sneaking shotty\nFuck a Friday, I'm with Robert\nChugging bombay, fuck your turn up\nFuck your turn out, we gon burn up\nFuck your mosh pit, I'm on my shit\nOn that Tribe shit, got that Phife Dawg\nI might bite, bitch, I'm on tablet\nScribble down, I'm rapping like Kool\nInspire all my local jokers who be quitting that school\nThey be hating that job, I was hating that too\nI was flipping your burger high as a bitch, but I'm cool\nI think I'm blessed now\nI only stress about the stress now since I'm fresh now\nPull that motherfucking dress down (dress down, dress down)\n\n[Bridge]\nAnd I'm gon' test the fire, girl\nAnd I'm gonna touch your thigh, girl\nI'm gon' spend the night, girl\nYou like, You like, You Like, You Like, You like, You like\n\n[Outro]\nI heard that you serving all that pussy, what's it going for?\nI heard that you serving all that pussy, what's it going for?\nI heard that you serving all that pussy, what's it going for?\nI heard that you serving all that pussy, all that pussy, uh\nI heard that you serving all that pussy, what's it going for?\nI heard that you serving all that pussy, what's it going for?\nI heard that you serving all that pussy, what's it going for?\nI heard that you serving all that pussy, all that puss-", "image": "https://images.genius.com/88da1904fb461fae943c2c34f20bda85.600x600x1.jpg", "album": "Cilvia Demo", "year": "2014-01-28"}]}