{"artist": "A$ton Matthews", "songs": [{"title": "Hallelujah", "image": "https://images.genius.com/a35331da3e4f69231777fdcf47364505.500x500x1.jpg", "album": null, "lyrics": "[Intro - Excerpt from the film 'Goodfellas']\nJimmy: There was a kid we knew, turned out to be a rat\nHenry: Really?\nJimmy: Yeah. Found him hiding in Florida. How would you feel about going with Anthony, take care of that guy?\n\n[Verse 1]\nPay me everything you owe me, Boy I need every nickel, dollar out a fiend\nStarted from a dollar and a dream but everything ain't always what it seems\nAlot of real ones died behind the scenes\nAlot of cowards taking all the fame\nKnowing if we pressin' ain't nobody bout to die about yo name\nWho u think you foolin?\nIf yo name ain't holding weight then what you think you really movin?\nMy dogs eatin' full plates - you niggas gettin' full clips\nLoose aim for the loose lips\n6 holes for your face, send them black rose for ya wake\nYou ever been so close to the gates\nThat God will look you right up in yo face\nAnd say he never knew you\nYeah -\nHe look you right up in yo face and say he never knew you\n\n[Hook]\nGlory Hallelujah, Oh Glory Hallelujah, Oh Glory Hallelujah, Glory Hallelujah, Oh Glory Hallelujah\n\n[Bridge - The Lord's Prayer]\n\n[2nd Verse]\nLiving like I'm in and outta coma\nXannie's, lean and tree's my persona\nShe don't need a man she need a owner\nWhip her, flip her, sit her on a corner\nMake her go bring that back - put that money in my hand\nI don't need no lip just a couple bands\nGet a couple people out them jamz\nKnock a couple people off them stands\nWhile I got my feet up in the sand\nForeign bitch bouncing on my lap\nShe jus tryna fuck me for a visa\nHer baby daddy paying for a feature\nI ain't really into doing business\nSayin' where you hangin, where you slangin, pussy boy but you could've been a witness\nAnd we don't ever ever play that-\nAin't no better way for me to say that\nYoung looney rida out the set-\nTrippin since I came up out the womb - know I'm down to ride for my respect\nYamborghini got it on the neck\nYou looking at the God up in the flesh\nEver since I walked across the water\nAnd led up all the lambs up to the slaughter\nAnd knocked the world up out its order\nFlair", "year": "2016-05-31"}]}