{"songs": [{"album": null, "year": null, "title": "Still Tipsy (Remix)", "image": "https://s3.amazonaws.com/rapgenius/qlffff0000000000000000000000000000072bc0.jpg", "lyrics": "[Intro - J-Kwon] w/ (ad-libs)\nAyo Track Boys\nThis could possibly be the biggest remix ever\nLets go!\nTrack Boys! (J-Kwon)\nYeah (Ching-a-ling, Murph Derp)\nTrue story, true story\n\n[Verse 1 - J-Kwon]\nA here comes the B to the C to the D\nNo cat out the Lou gangsta as me\nY'all hit two, I'm just goin for three\nBottle full of Cris, but I still rock a tee\nAnd you got a little fat denim, from the streets\nDrink so much that it fucked up my tee\nPeople wasn't drunk, so why they wanna be\nCause you get eleven thousand spins in a week\nHere comes the C to the B to the A\nNever fall off like B2K\nWanna get tipsy, you one drink away\nWhy would I buy when it's better when you pay\nTrack Boys from the Lou, Jermaine from the A\nBut they got the boy gettin tipsy with Sway\nThen she said she had somethin to say\n\"One hit wonder\" please I'm here to stay!\n\n[Hook - J-Kwon]\nNow e'rybody, e'rybody, e'rybody, e'rybody\n(E'rybody in the club get tipsy)\nOo-ooh, Now e'rybody, e'rybody, e'rybody, e'rybody\n(E'rybody in the club get tipsy)\nOo-ooh, Now e'rybody, e'rybody, e'rybody, e'rybody\n(E'rybody in the club get tipsy)\nOo-ooh, Now e'rybody, e'rybody, e'rybody, e'rybody\n(E'rybody in the club get tipsy)\n\n[Verse 2 - Chingy]\nStop! I pulled up to the club already filthy\nShe say she don't give head, she innocent til proven guilty\nWalkin VIP, cats screamin \"GIB!\"\nSkull cap with a bib on the back DTP\nThis girl starin so I put a spell on her like a gypsy\nWe bought up the bar with hundreds some drunk not tipsy\nDon't trip cause the whole St. Louis is ridin with me\nCats start hatin, tell them people come get me\nYeah! here comes the king of the Midwest C\nH to the I to the N to the G (Y)\nMy homies in the back puffin on some ooo wee\nI know the owner so I snuck in the Uzi\nPlus if I blow somebody they gon' try to sue me\nIf rappin was a film I'm starin in this movie\nThe Git It Boys hurr, they gon retch and boozee\nLet's take it from the club to the ja-cuzzi\n\n[Hook]\n\n[Verse 3 - Murphy Lee]\nAyo one I am the dude that the people call Murph (Murph)\nCheck my resume you can see I put in work (work)\nTwo new women that I add to my phone (phone)\nThree roll joints, smoke one when I get home (home)\nFour real dirty you and I versale (sale)\nThose the people I thank, when my damn record sales (sale)\nFive new problems and one ain't broke (broke)\nWhite Porsche truck wood grain like Coke\nNow e'rybody in the club lookin spiffy\nMama got on a dress, boots from the sixties\nOh girl pissy, Shantay tipsy\nKim, Kesha, and Pam all leavin wit me\nJackers wanna get me, it's not that simply\nSeventeen fillin up, but you can make it empty\nNow which one of y'all niggas wanna tempt me\n(Now which one of y'all niggas wanna tempt me)\n\n[Hook]\n\n[Outro]\nE'rybody in the club gettin tipsy\nE'rybody in the club gettin tipsy\nE'rybody in the club gettin tipsy\nE'rybody in the club gettin tipsy"}], "artist": "J-Kwon"}