{"artist": "Papoose", "songs": [{"album": "You Can’t Stop Destiny", "title": "Mobbing", "image": "https://images.rapgenius.com/e0064530cd5348a62973603ab6e18572.500x500x1.jpg", "lyrics": "*Electric Prunes sample*\nThere is no God but you...\n\n[Intro: Papoose (Troy Ave)]\nReal niggas, we back in style!\nIt's Thugga!\n(Troy Ave)\nPapoose, Papoose!\n\n[Hook: Papoose]\n50 deep in the club, homie, we mobbing (We mobbing!)\nStick-up kids with me, killas with me, we mobbing (Mobbing!)\nFuck a guest list, we gon' mob regardless\nM-O-B-B-I-N-G, we mobbing! (Yeah!)\nEven brought my connect with me, we mobbing (Mobbing!)\nHomies from every set with me, we mobbing (What!)\nBalenciagas, bitches in red bottoms\nM-O-B-B-I-N-G, we mobbing!\n(There is no God but you)\n\n[Verse 1: Papoose]\nFuck who niggas out here buzzing, I'm 'bout to buzz with 'em\nYeah, they say his cousin be bugging, well hit his cuz with him!\nMollies make 'em feel like they tough, he got them drugs in him\nLead shower, bloodbath, he in the tub with 'em!\nHeard his girl riding and dying, she in love with him\nThey say only God can judge, she getting judged with him (Damn!)\nSensitive thugs need hugs, I don't fuck with 'em\nRight after I hug 'em I slug 'em, you could get hugged with 'em\nOn that Bobby Schmurda shit, homie, I grew up illing\nEver since I been in fifth grade, man, I been drug dealing\nNiggas trying to tell me to chill, motherfuck chilling\nIf he tell you to chill, then he ain't got no thug in him!\nHer shoes be red bottom like she got blood in 'em\nStomp a mudhole in your ass, put some mud in him\nYou be gettin high with them dudes, smoking bud with 'em\nBut you never eat with them niggas, why you don't grub with 'em?\n\n[Hook: Papoose]\n50 deep in the club, homie, we mobbing (We mobbing!)\nStick-up kids with me, killas with me, we mobbing (Mobbing!)\nFuck a guest list, we gon' mob regardless\nM-O-B-B-I-N-G, we mobbing! (Yeah!)\nEven brought my connect with me, we mobbing (Mobbing!)\nHomies from every set with me, we mobbing (What!)\nBalenciagas, bitches in red bottoms\nM-O-B-B-I-N-G, we mobbing!\n(There is no God but you)\n\n[Verse 2: Troy Ave]\nMobbing, \"money over bitches\" be the motto\nMade mines gambling my freedom, what's a lotto\nJackpot when you got crack spots?  Protect mines\nHop out with two nines like jackpots, really nigga!\nYoung willing nigga working toward a milli, nigga\nIf you ain't about that paper, you don't fuckin' feel me, nigga!\nBlew 50K in the summer, word to my mother\nBefore we bought the Benz or that Hummer, we bought that butter!\nMellie took the oil then you hit it with that cold\nI was using microwaves in hotels that ain't have stoves\nI'm a H-U-S-T-L-E-R, hustler\nNo tolerance for silly hoes and bustas\nBut I still moves, BSB, you can trust us\nTroy Ave bringing the city its due justice\nNo peace, except on the car, you see the sign?\nGold piece flooded in stone, you see me shine?\n\n[Hook: Papoose]\n50 deep in the club, homie, we mobbing (We mobbing!)\nStick-up kids with me, killas with me, we mobbing (Mobbing!)\nFuck a guest list, we gon' mob regardless\nM-O-B-B-I-N-G, we mobbing! (Yeah!)\nEven brought my connect with me, we mobbing (Mobbing!)\nHomies from every set with me, we mobbing (What!)\nBalenciagas, bitches in red bottoms\nM-O-B-B-I-N-G, we mobbing!\n(There is no God but you)", "year": "2015-06-11"}]}