{"songs": [{"year": "2005-06-28", "image": "https://images.genius.com/989cba8a29e0880306781855e77f4a35.500x491x1.jpg", "title": "Bad Day", "album": "Hannicap Circus", "lyrics": "[Bizarre] This is a bad day\n\n{Motherfucker you need to get up and find yo' ass a job!\nI'm sick of you just laying around all day long playin Nintendos\nThey don't even make Nintendos no more\nWhere the hell you find that shit at?\nAnd I KNOW that you can find a job, yo' bus pass is in yo' wallet\nI seen that shit yesterday, you just sit up all day\nLie lie lie, eat eat eat, drink drink drink\nYou don't do SHIT, I'm SICK OF YOU!!}\n\n[Bizarre]\nYeah - just wakin up in the mornin gotta thank God\nGot my ass cheeks stuck to a fishing rod\nWhere's the dogs, ain't no frogs\nMomma cookin breakfast with no logs (yeah)\nI got my grub on, but didn't pig out\nNo Thanksgiving so we eatin, carry out (damn)\nThis dude came through my front do' (you dead punk!)\nHe said I wouldn't live to see a twenty-fo'\nI gotta go cause I got on flip-flops\nIf I slow down, then my feet'll drop\nHad to stop, at the red light\nEverybody laughin at my yellow dirt bike (ha ha!)\nAnd everything's all right\nI got a beep from Sherri, she's a transvestite\nCalled up my homies and I'm askin y'all\nBring twenty, bottles of alcohol\nPlayin football and I'm trouble\nThey gave me the ball, I fumbled (oh shit!)\nAnd I can't believe, my best friend's gay\nToday was a bad day\n\n[Interlude]\nYeah, today was fucked up\nAy man get a scene for these niggas\nToday was a bad day (ooh-ahhhhh, ohhhhhhh)\nLet 'em know how fucked it was (ooh-ahhhhh, ohhhhhh)\nGoddamn, today was fucked up!\n\n[Bizarre]\nI bust my ass in the shower\nGot on this fresh new baby powder\nJust yesterday these fools tried to blast me\nSaw the police, and got my ass beat (oh shit!)\nNo flexin, whooped my ass, in the intersection\nShould I shoot, that's the question\nWent to Big Fam house, they watchin \"Rap City\"\nShootin them craps, I got fifty\nShake 'em up, shake 'em up, shake 'em up, shake 'em\nA circle of niggas, watch me all fake 'em\nThey beat my ass, I need nine, nine-eleven\nThey threw my ass through the back do' (ohhhhh)\nAnd took all my cash flow\nPunched me in the chest, and kicked me in the asshole\nI just found out, my best friend's gay\nToday was a bad day\n\n[Interlude]\nToday was all fucked up, rainin and shit\nAy (ooh-ahh, ohhhhhh-ohhhhhhh)\nToday was a bad day - sing that shit (ooh-ahh)\nHahahaha (ohhhhhhhh)\nYeah (ooh-ahhh, ohhhhhhh)\nSing that shit nigga - today was fucked up!\n\n[Bizarre]\nLeft my homey's house paid\nPicked up this chick been tryin to rape since the 12th grade (bitch)\nIt's ironic, the pistons is the man\nAnd Artest fired on a fan - damn! (I seen that shit)\nTook a trip to Miami\nGot my ass beat at the 21st Grammy's\nMy dick is so weak, so weak\nSo weak I put my own ass to sleep (damn!)\nWoke her up around one (get up)\nAnd didn't hesitate, to say that she didn't cum (I didn't cum)\nRidin down 7 Mile coastin\nSmokin on the potion, rubbin on some baby oil lotion\nAnd nothin seems to work out\nShe smacked me in the face, and murked out\nToday was like one of those bad dreams\nJackin off, with a bowl full of whipped cream (ahh, ahh!)\nHelicopter looking for the murder\nTwo in the mornin got the Coney Island burger\nEven where the lights of the Goodyear Blimp\nAnd it read, \"Bizarre ain't shit!\"\nDrunk as hell, and I'm throwin up\nPager cut off, so you know it ain't blowin up (nah, uh-uh)\nI found out that my best friend was gay\nToday was a bad day\n\n[Outro]\nIt's been a fucked up afternoon\nBeen a fucked up weekend - ay (ooh-ahhh)\nSing that shit nigga (ohhhhhhh)\nToday was a bad day\nSing what that bitch be singin (ooh-ahhhh, ohhhhhhhh)\nJust like Ice Cube be singin, sing just like that (ooh-ahhhh)\nHahahaha (ohhhhhhhh)\nThe \"Hannicap Circus\" y'all - today was fucked up!\nComin soon, Bizarre, \"Hannicap Circus\"\nToday was a bad day motherfucker\nFuck y'all..."}], "artist": "Bizarre"}