{"songs": [{"title": "100 Shots", "lyrics": "[Intro]\nYeah, it's Dolph\nHey, bring me some Backwoods up outta there, homie and a cup of ice\nAnd some rubber bands up outta there too, homie, yeah\nIt's 3 PM, 80 degrees outside\nI'm in somethin' that go real fast, sittin' outside the cornerstore\nSix figure client, got no business in this area\n\n[Verse 1]\nIf it ain't one thing, it's a motherfuckin' 'nother (goddamn)\nWe trapped together than that's my motherfuckin' brother (that's my dog)\nI pay her bills and buy her designer but I don't love her (hey, what you need, lil' mama?)\nShe just play her part when it's time to smuggle (ayy, you ready?)\nI pull up, pick up that bag, and burn rubber (skrrt)\nI got a sweet tooth but I stay away from suckers (for real though)\nNobu in Malibu was my last supper (we eatin' good)\nI fucked her in rush hour traffic, Chris Tucker (haha, yeah)\nEverybody screamin' gang gang gang (gang)\nThem folks come and get you, you gon' tell on the whole gang (gang)\nShe said can she fuck me with my diamond chains?\nIf I ain't in the bank, then I'm on the plane (yeah, hey)\n'Bout to go get some money or go spend some money (yeah)\nThey stopped me in the airport, had too many benjis on me (Franklins)\nThey don't want you to live, they don't want you to ball\nThem pussies smile in your face, yeah, then they pray for you to fall, hey\nYoung nigga stay focused (yeah)\nBut I really want to crash (damn)\nThink about where you at (okay)\nThen think about your past (alright)\nYeah, I really came from shit (yeah)\nBut I won't change for shit (nah)\nMy bitch say I'm stuck in my ways (yeah)\nMy wrist say I been getting paid (yeah)\n\n[Chorus]\nA hundred shots, a hundred shots\nMe and my niggas pull up in a hundred drops (skrrt)\nMy role model used to get a hundred blocks (hey)\nStreet niggas in a tuxedo, we the mob (yeah)\n\n[Verse 2]\nShe looked at my watch too long, now she see stars (blow, blow)\nI got so high last night I did a show on Mars (woo)\nYour bitch ate my dick, I caught her on them bars (Xanax)\nMy pinky ring extra large (yeah)\nForeigns all in the garage\nRemember my first menage (yeah)\nYeah, Tori and Brittany (yup)\nI'm shoppin' for diamonds at Tiffany's (Tiffany's)\nNo, I don't got no sympathy (nah)\nShe blew my whistle like a referee (wet)\nBroke black nigga, remember me? (Hey)\nUntil I found out that recipe (yeah, woo)\nStarted getting about ten a week (yeah)\nFinger on the trigger when I sleep (yup)\nYeah, nigga, I rather you than me (yeah)\nBackseat, smokin' good weed (gelato)\n\n[Chorus]\nA hundred shots, a hundred shots\nHow the fuck you miss a whole hundred shots?\n\n[Verse 3]\nYou not welcome at my trap if you don't shop (ayy, get out, bro)\nBefore you come through that back door you better knock (ayy, get the door)\nThey been waitin' on this gangster shit to drop (bulletproof)\nEven them fuck niggas that wish I could be stopped (hey, hey)\nHow many dicks you sucked to get that couple million? (Hahaha)\nSelf made millionaire, oh what a feelin' (yeah, yeah)\nMy niggas came from dealin' (ayy)\nFuck nigga get out your feelings (ayy)\nYour bitch gave me sexual healin' (woo)\nGuess who just walked in the buildin'? (It's Dolph)\nCame out with six bitches (wet)\nMy uncle said that's pimpin'\nMy diamonds always hittin' (uh)\nYou lookin' for your bitch, she with me nigga, she ain't missin' (nah)\nI told you fuck nigga stay out my way, but you didn't listen (stupid ass niggas, yeah)\nBig rocks, in my watch (hey, hey, in my watch)\nAnd we put extensions in all of the Glocks (haha)\n\n[Chorus]\nA hundred shots, a hundred shots\nHow the fuck you miss a whole hundred shots?\nYeah, it's Dolph\nHow the fuck you miss a whole hundred shots?", "album": "Bulletproof ", "year": "2017-04-01", "image": "https://images.genius.com/29fa753e2bd1858eb69c5dceb7d28c64.1000x1000x1.jpg"}], "artist": "Young Dolph"}