{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": "2014-01-04", "title": "Doe B Eulogy", "lyrics": "I'm up here to celebrate the life of a young man, who's path I crossed I say about a little over a year ago and the story Doc told was 99.9 percent accurate. I'm a tell you what happened from where he left off. I get a call. Doc say \"you gotta meet my cousin, he on his way up to see you.\" I said \"alright man, tell him to meet me over here at [?]. I was at [?], I think [?]'s mall, [?] plaze or something. So me, Doe, Frank White. And Frank said to me \"alright, what we need to do to get out of Montgomery, Alabama. I say \"well a...if you look around man you'll see that you already done made it out of Montgomery, Alabama. We ain't [?] enough man. You guys done did a pretty good job so far, already\n\nWe sat here man, you know, we sat here for about an hour. Then we went out to the truck man, Doe playing some unreleased music so. I sat there and I said, \"so y'all really got something huh?\" From that day forward, I admire Doe because as a young man, the age that he was he always presented himself to be more mature. It’s very rare that you find somebody at the age of 20, 21 and sit them down, in front of you know, someone I guess, they aspire to be like. And they are as composed, they're poised and posture like and looking, eye with this person, like you know, I got the same ability and the same talent, and the same potential to be on the level that you are right now. It's very rare that you find that somebody the age of 20, 21 and you could walk them into a room with a Nelly, or you could walk them into a room with a Timbaland or Jay Z, and they not lose their cool, they’re composed, postured, with the morals, the standards, and the principles that were instilled in him from his family: his mom, his dad, grand-mama, brothers, sisters, aunts, uncles. He walked like these people are watching him all the time. You know what I'm saying? Like he had people to answer to, so he can't carry himself nothing less than. Know what I'm saying? And I saw that in him day one, off the top, and that is what drew me to him even more so beyond the music\n\nOver here at Hustle Gang, we have a host of artists. All of them know that I tell them ‘listen, your talent is only going to get you so far’. It’s the things that you learn, the things that you are able to do outside of the booth, is what's going to separate you from the rest. I said the same thing to Glen. He never left the studio… he said ‘I’d rather be here than the club, simply because I know this is going to pay off.' Remarks like that man, it was extremely rare to hear a man, at a young age, speak in that manner. Over here man, a lot of people look at us like a record company. A lot of people look at us like a entertainment house. To be honest with you, this is a family, this is a family business. I will never let his life be lived in vain. All of my resources, all of my relationships, all of my efforts, all of my energy will be put forth to make sure that his dream lives on. And I speak on behalf of myself, I speak on behalf of the entire Grand Hustle, Hustle Gang family. I speak on behalf of Blueprint. I speak on behalf of anybody who got any love for me. Show some love for Doe B. Love"}], "artist": "T.I."}