{"artist": "Anderson .Paak", "songs": [{"title": "Smile / Petty", "album": "Oxnard", "year": "2018-11-16", "image": "https://images.genius.com/f86cd94b8dc54301943533fa84ca4350.1000x1000x1.jpg", "lyrics": "[Intro]\nWhat is it about my smile that makes you lie to my face?\nIf I close my eyes to your bullshit, I could still smell it on you\nI could smell it from a mile away\nYou can't be the truth and be loved\nOh no, hey\nMake up your mind, baby\nWhat is it about my smile that makes you lie to my face?\n\n[Verse 1]\nLet me ask this, just what does it take to be the apple of your iris?\nHow much of this bullshit until we reach the pasture?\nAin't no need to gas me, it was lit from the lashes\nBack when chit-chattin' casually 'bout how you think monogamy is somethin' of the past\nBut, baby girl, your actions speak somethin' totally opposite\nAnd you have to pardon me, 'cause I am a dog, you see\nAnd if you lead me to the park, I break up off the leash\nWhat is it about my smile that would make you ponder kickin' dirt in my water?\nSpillin' bleach in the laundry bag and stressin' my momma\nPushin' dents in my armor, scratchin', dentin' my Pontiac\nBitch, are you off your shit?\nI bag another one just to piss you off and shit\nDon't make me put the shit I bought you up for auction, bitch\n\n[Break]\nHold on, hold the fuck up\nPause this shit\n\n[Verse 2]\nMy lady drives me high up the wall\nShe keeps me up and locked in the bathin' room\nWhy am I screamin' at the top of my lungs?\nWhen she can't hear a word that I say to her?\n\n[Chorus]\nYou petty, petty bitch, (Huh, petty)\nCalculate (All of it)\nTrackin' (All of it)\nAll of this (Bullshit)\nWorthless shit, you packaged up\nDon't stop my shit, (All of it, all of it, all)\nBitch, now you know that was totally out of pocket\n\n[Break]\nWould've let me fall off\n(Would you catch me when I fall?)\nI won't sweat the small stuff\n(No more chasin' business, no)\nI can't keep from fallin' off\nKeep me from these useless bitches, these ruthless leeches\nI might catch you all alone\n(I don't need it, I don't need it!)\n\n[Verse 3]\nNow bro, he lends me no help at all\nHe's out there chasin' money that's far too small\nLately, he's talkin' 'bout investin' withdraw\nBut the loan of which you owe me is far from paid off\nOh, Lord\n\n[Chorus]\nYou petty, petty bitch, (Huh, petty)\nCalculate (All of it)\nTrackin' (All of it)\nAll of this (Bullshit)\nWorthless shit, you packaged up\nDon't stop my shit, (All of it, all of it, all)\nBitch, now you know that was totally out of pocket"}]}