{"artist": "Big Ed", "songs": [{"lyrics": "[Mia X]\nSee niggas be screamin TRU like it's the new thing to do\nBut TRU is the way of life nigga\nThis ain't no motherfucking fad\nMama Mia, Big Ed, Master P, C-Murder, mister Silkk The Shocker\nFirst family, Mr. Serv-On, TRU yall\n\nChorus (In background while she's talking)\nWe come strapped and we roll thick\nWe represent that TRU click x4\n\n[Mia X]\nNow your better off chasing waterfalls\nCause yall ain't even much tryin to fuck around at all\nWith these TRU plum act a fuckin fool nigga\nNo Limit soldiers knock your head off your shoulders\nWe done showed you that we been bout puttin in work\nBut you bout to have your dick knocked dead in the dirt\nSo I can show overseas with the Japanese\nWhile you tied up, shit in your pants, on your knees\nPlease, but ain't no reason once it's time for war\nSo if you start it best believe we're gonna take it as far\nAs it goes puttin holes in your door while you lay\nAnd your automobile is gettin sprayed on the real\nFuck the drive by shootin and them public affairs\nWe ain't wastin no bullets bitch we know where you are\nAnd we coming like big dick buried deep in the cock\nAnd hoe we ain't goin stop till your last man drop\n\nChorus x2\n\n[Big Ed]\nNow when I said take a bullet for my homie I meant it\nBefore crushed out tanks I was down to did shit\nFist fighting in clubs cause we had to run it\nC-Murder was the first with TRU on his stomach\nDown to die for TRU so bitch don't flinch\nWe been click tight way before we were rich\nSee this tatoo embedded deep in my skin\nBefore I take it off I give my right hand\nI love these niggas, bust slugs, take slugs for these niggas\nEven when they do wrong it ain't wrong cause they my niggas\nCut my chest and blindfold me\nMy niggas say they put that on TRU and I believe them like God told me\n\n[C-Murder]\nI represent that N-O nigga L-I-M-I to the motherfucking T nigga\nMotherfuckers dont really wanna go to war with a nigga like me nigga\nI'm Bossalini, they ain't know they better respect a nigga like me fool\nI ????? videos doin shows representing my TRU tattoos\nI've been a tank dog first family member since day one\nP was the only nigga rapping\nI wasn't tripping I was there cause I ruled that gun\nThat's why I get mad when niggas talkin bout TRU this TRU that\nNo Limit this, went and got a tatoo but nigga, I ain't approve of that\nNow don't make me lose my mind and go snatch all my logos\nEverybody know you ain't a soldier cause P ain't in none of your videos\nSo motherfucker stop rappin like you down with my shit\nFirst liutenant of the motherfucking tank represent a real TRU click\n\n[Mia X]\nChorus x2\n\n[Mr. Serv-On]\nAaaaaah!\nWhen you see us, all you see is fame and bitches\nWhen I see myself in the mirror I see a nigga bounded in bloody kisses\nWishes to see my enemies slaughtered\nDon't make me harder\nWake up in the morning with this tank on my chest, that makes it easy\nFor me to digest the stress\nKnow my nigga P screamed for many years to make some money for us all\nAnd now you niggas tryin to take off my tattoos\nAnd name me tryin to ball (Never)\nBelieve me nigga when I see ya, you gots to fall (Believe that)\nAll my tears in my heart (You never know)\nAnd you feel me and this motherfuckin tank will never go (Never never)\nI was taught to ride for this, do some time for this\nSlang some dope for this and if it came down I'd fuckin die for this\n\n[Silkk The Shocker]\nNigga fa sho (Fa sho)\nI'm down to die for this shit\nThis No Limit shit bigger then this motherfucker\nNiggas just wanna be down\nWearing tanks and tatoos and shit\nKnow what I'm sayin?\nNiggas wanna get high with me\nKnow what i'm sayin, niggas wanna ride with me\nNobody wanna die with me or do twentyfive with me\nKnow what I'm sayin?\nNigga let me tell you somethin\nP run this shit\nKnow what I'm sayin, you know what the fuck TRU is\nAll of a sudden niggas wanna leave and shit through the struggle\nAnd now a nigga on top everybody wanna come back and shit\nI tell my new No Limit soldiers nigga, you gotta be military minded\nReady to go to war\nCause uh, everybody want a nigga\nKnow what?\nI'm a die for this shit cause uh, this is all I got\nNo Limit\nI'm out bitch\n\n[Mia X]\nChorus x2", "image": "https://images.genius.com/d1645663d13224ddd74a3441afd4c58c.772x768x1.jpg", "year": null, "title": "We Represent", "album": "The Assassin"}]}