{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C", "title": "Diamond", "image": "https://images.genius.com/6a5406166b09f9389383b8e5cab645ef.599x599x1.jpg", "lyrics": "{*whispered in the background: \"diamond, diamond..\"*}\n\n[Bars & Hooks]\nWe ain't goin platinum (nope) we ain't goin gold\nWe goin diamond - ten million sold\nWe break records (records) and move units, that's how we do it\n(Do it do it) Makin millions and billions from movies and music\nWorld tourin, shows, performin\nThe deals, the budgets, accounts, enormous\nWe got it (got it) you frontin, you need it, you want it\nThe Mobb, and Bars, and Hooks, we comin\nDelorean, and Mr. Bars, how about that?\nWe some Queensbridge niggas that ain't all about rap\nWe own streets, run websites, log on\nTo the one and only, InfamousStores.com\nWe load up the tour buses, to get these checks\nWe independent, we don't need your respect\nWe +Infamous Minded+, you've been blinded\nIt's Bars & Hooks nigga, we.. goin.. diamond!\n\n[Hook: Prodigy]\nYeah, what more do y'all want from us?\nWe spill our hearts out and it still ain't enough\nYears we got crumbs, doin the supplyin\nWe independent now - we.. goin.. diamond!\nYeah, what more could you ask for?\nWe the team, we deserve everything and more\nAll the blood and sweat for our dead we stopped cryin\nSwallowed it, survived it - we.. goin.. diamond!\n\n[Prodigy]\nYou might catch me steppin out the Lamborghini\nWith ashy legs, my chain swingin\nI grab my piece, so that shit won't damage the paint\nChest naked holdin a drink\nWe got these hoes by the brain, we black rap moguls\nWe the most poppin, we the illest niggas rhymin\nLet's go team for team, you don't want that\nWe make niggas quit rap, we so violent\nThe only thing that calm us down is more dollars\nWe need NBA cash, the yachts, the labs\nThe Porsche, Ferrari, the Hummer, you mad?\nAK-90, the sigs, the macs\nGrenades, silencers, sterlings that blast\nTo Linden, the sweeper to murder yo' ass\nYou doubted my niggas (WORD) now we up\nYeah, you musta been wildin - we.. goin.. diamond!\n\n[Hook: 2nd half + 1st half reversed]\n\n[Bars & Hooks]\nWe gon' kill 'em with this here, and ship ten million\nThis year, look on the charts it's there\nAt the number one spot, locked of course\nBy these ghetto street pharmacist entrepeneurs\nWho woulda thought? The car I always wanted get bought\nSittin on ten times twos, rollin by you\nIt gets bigger, I remember bein broke\nSo the plan now is to get richer\nAin't gon' be no scufflin my nigga, I ain't gon' fight ya\nI'mma pay the piper to snipe ya, it's real like that\nGoin diamond make you feel like that\nCause I done been through the bullshit, dealt with the bullshit\nNow I'm lampin, mansion, and a few whips\nAin't nothin but a thug thing, this the club theme\nBars & Hooks to H.N.I.C. we climbin\nFinally we shinin - we.. goin.. diamond!\n\n[Hook]\n\nFuck y'all niggas man\nWe goin diamond.. we goin diamond..\nKnahmsayin? Move these units.. do these shows..\nAnd hold this money.. hold the cash\nWe goin diamond.. goin diamond..\nWe goin diamond.. diamond diamond diamond\nWe goin diamond.. we goin diamond..\nWe goin diamond, we goin diamoind..\nWe.. goin.. diamond!", "year": "2000-11-14"}]}