{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C Pt. 3", "title": "Life is What You Make It", "image": "https://images.genius.com/65ddd77ff59df02b544ca7aecbd742a1.500x442x1.jpg", "lyrics": "[Intro:]\nDon't let 'em ever tell you dreams dont come true, Don't ever let them shoot down your dreams. No Dream big! Come here man, look me in my eyes now tell me who will stop me...\n\n[Verse 1:]\nListen I can burn like the sun\nOr be cool as the moon\nOr depend how I feel at the time\nAnd my mood could just flip like breezy\nOr be easy like neyo was nothing Like a\nDub but something like a kilo if I want it I pursue it I don't Let up Till I have it like presto you can call me Mr. Magic\nWhen I focus\nMy attention on the things I desire, those things get\nAcquired no I\nNever get tired I run the longest run and\nI don't fatigue\nWhat more\nThen what\nI need no this is not greed this is lust for the\nStuff that\nI See I vision got this picture in my head that leaves with\nEverything Listen\nIf it doesn't exist I bring it to existence difference between me and You is this you see obstacles\nI see optical illusions I can not be Slowed down stoped or fooled with\n\n[Hook:]\nAnything that can be done\nI can do it better\nAnything is possible\nI can do whatever\nI chose life is what you make it\nI chose my own path\nLife is what you make of it\n\n[Verse 2:]\nListen I believe I can fly on that G-650\nYeah I know I was born to live affluently\nAll this expensive shit is just grown folk toys\nWhen your swamped with your money and\nYou get to enjoy it but the best part\nAbout my life is all the people\nWho tell me how much they love me\nYeah I love you too\nMobb Deep is for life P is forever\nThe infinite infamous man is like we never\nFall short, fall off fall Back theirs never been a\nTeam in the history Of rap with this Guinness Book of intelligent hard shiet only thing This game missing is more of\nThis mobb shieet your strippers dance on\nPoles of them strip songs but In the car on the way home she puts on\nThat HNIC\nBack to the real world\nBack to reality\n\n[Hook:]", "year": "2012-07-03"}]}