{"songs": [{"title": "Realist in It", "album": "Street Gossip", "year": "2018-11-30", "image": "https://images.genius.com/0b3e3715e866a25acbab1c5f64779d6e.1000x1000x1.jpg", "lyrics": "[Chorus: Lil Baby]\nRealest (Realest), in it (In it)\nI was on the block because I was suspended\nNiggas, bitches (Bitches)\nI ain't takin' shots, I hope they don't get offended\nG550, this is not a rental\nNew AP, limited edition\nStill be in the trenches, still be totin' pistols\nI done went to jail, I still can go and get 'em\n\n[Verse 1: Lil Baby]\nHold up, Baby (Baby)\nYou been goin' crazy, who said you wouldn't make it?\nI keep somethin' to say to dopeboys 'round the nation\nI won't stop for nothin', I'm chasin' after paper\nTalkin' like I'm basic, really that's some hate shit\nSee I'm out in public, why don't never say shit?\nThey know I would pay for them to get a facelift\nPenthouse at the top, I come from out the basement\nOpps talkin' crazy, hope my Glock don't jam\nGotta make it back home, take care of my lil' one\nWhen it's time to ride, I'm like fuck makin' a diss song\nWent and bought a Wraith just for somethin' for us to sit on\nEvery rapper on the come-up send a song for me to get on\nAin't nothin' wrong, I used the plug for me to get on\nTen thousand dollar outfit, I got this shit on\nDM-in' my ho, another nigga I'ma shit on\n\n[Chorus: Lil Baby & Gucci Mane]\nRealest (Realest), in it (In it)\nI was on the block because I was suspended\nNiggas, bitches (Bitches)\nI ain't takin' shots, I hope they don't get offended\nG550, this is not a rental\nNew AP, limited edition\nStill be in the trenches, still be totin' pistols\nI done went to jail, I still can go and get 'em (Wop)\n\n[Verse 2: Gucci Mane]\nGucci cuttin' up, Tom Ford button-up (Huh)\nHaters face crunched up like I cut an onion up (Damn)\nYour rent pay for what I paid for the temp fade (Huh?)\nGot the blocks any day, yeah, them Dikembes (Blockies)\nGot the trap goin' up on a Wednesday (Up)\nSamurai, choppin' up work like a sensei (Wop)\nKeyser Söze, vibe out like Coldplay\nThey don't really know no nothin' 'bout the old Ray (No)\nTrappin' out my Box Chevy, me and OJ (Huh)\nMichael Jackson with the glove, Annie, are you okay? (Wow)\nJunkies in the hood singin' like the O'Jays\nDope so good, make your uncle sell the Bluray (Damn)\nDrop the top off the Rolls like a toupée\nFiasco when I pull up like I'm Lupe (Uh)\nCastro, but now in the new day\nShoot him in the head, I ain't never like him, no way\nBillie Jean, bitch, I'm tryna see your whole team\nHe think he slick so I shot him in the doorway (Huh)\nAnother murder, boy, I'm known for duckin' murder charge\nDouble murder, tried to pin it on me like I'm OJ (Wow)\nQuadruple-cross him like a nigga owe me\nCold-hearted like I never had a vertebrae (It's Gucci)\nBoss talk, make 'em bring it to your doorway\n4 Pockets Full, whippin' up a four-way (Skrrt)\n\n[Chorus: Lil Baby]\nRealest (Realest), in it (In it)\nI was on the block because I was suspended\nNiggas, bitches (Bitches)\nI ain't takin' shots, I hope they don't get offended\nG550, this is not a rental\nNew AP, limited edition\nStill be in the trenches, still be totin' pistols\nI done went to jail, I still can go and get 'em\n\n[Verse 3: Offset]\nEngine in the rear, put a million in the front (Rear)\nWhat the fuck is fear? Chopper eat you like it's lunch (Fear)\nFourth and long, nigga, but we don't go for the punt (Long)\nLookin' at the thottie body, this ho is a runt (Thottie)\nWait, when we draw the chopper, niggas start to run? (Wait)\nWait, these bitches wanna come fuck with a don? (Woo)\nWait, if a nigga talk about some funds, I relate (Relate)\nYou hate, I did the race, Tay-K (Skrrt)\nThinkin' like I'm Meech, M's in the vase (Meech)\nPractice what I preach, money on the daily (Practice what I)\nShe not NeNe but she leaks oh so crazy (She not NeNe)\nNiggas plottin' and I peep with a lazy (What I peep)\nPush the money out, I'm in labor (Woo)\nShe tryna fuck me for some clout, hurt my baby (Clout)\nI got money stashed somewhere in my acres (Stash)\nMy left wrist sad 'cause my right glacier\n\n[Chorus: Lil Baby & Offset]\nRealest (Hey), in it (In it)\nI was on the block because I was suspended\nNiggas, bitches (Bitches)\nI ain't takin' shots, I hope they don't get offended\nG550, this is not a rental\nNew AP, limited edition\nStill be in the trenches, still be totin' pistols\nI done went to jail, I still can go and get 'em"}], "artist": "Lil Baby"}