{"artist": "Antoinette", "songs": [{"title": "Unfinished Business", "image": "https://images.genius.com/cedf38034fcd790a206ac8754336b99e.416x420x1.jpg", "album": null, "lyrics": "I need a title for this, make it simple and short\nThis well sounds good and holds up fort\nCuz I'm back y'all what I mean my friends\nAntoinette take two, here we go again\nBack on tracks, hit a smack the stack\nAnd when it come to this, I don't lax\nSo fall out, I go all out\nWhen I clutch it\nThe mic I get paid, soon as I touch it\nSo get up, way up, gather around\nWhat's next? Yo Hurb change the sound\nMake it hyper, a little riper so I can pick it\nDrop the bass, so I can kick it\nMost say I'm the best I'll let you make that choice\nIt ain't an Antoinette rhyme if it ain't got my voice\nThe rhyme timer, the one that's liver\nFemale extraordinaire\nThere's no one like me, so don't compare\nJust chill, this is unfinished business\nA little louder, now I'ma kick this\n\nNow I'm in no position to flake\nJust like water I'll pour em\nAnd those who got beef I ain't got nothing for 'em\nBut hard times, and def rhymes is I how I'm breathin'\nSeein' is believin' and doing is achievin'\nThat's a fact, matter of fact you can quote it\nI think you better note it if you ain't yet wrote it\nI gets paid and play every time I come hyper\nWord up, I never say I wanna be like her\nOr him or them cuz I'm living reality\nStraight up and down with enough originality\nThat's how I come and that's how I'm going\nWhen I rhyme offbeat you know what? I'm still flowin'\nIt's like that and you can bet your last penny on it\nI got it good and I'm sure the many want it\nBut it's a blessing and I'm professing\n? is a lesson I'm guessing those that need a lesson on it\nDiscipline, articulation and tone\nYa gotta have it when you're clutching a microphone\nDon't forget this, say you bit this\nOne time for your mind and I'ma hit this\nCan I get a witness cuz what I'm saying is strong\nI can handle the mic so don't tell me how long\nYou've been rockin' parties or rippin' up the roof\nKill that noise and don't treat me like a youth\nI can do this, ain't nothin' to this\nGive me the mic\nGive it some bass and I'll show you how to rock right\nI go on and then I pause\nFrom the way I hold a crowd, they treat me like an outlaw\nCuz I hold em, rock em and control em\nAnd if they stop it's only cuz I told em\nSome think I'm jokin' but this I vow\nI always keep ? you should know that by now\nI'ma get mines, because it's only right\nAin't a soul alive that's gonna take my mic\nCuz I'm a girl you got bold\nWhat's up? You feel like a troop?\nI had you sippin' on soup\nA fruit playin' a flute\nDrop the beat in\nAnd I'ma go this way\nI just knew some chick would have something to say\nLike I'm a biter, a non-writer\nYou're misbehaving\nAttention is what you're craving\nYou should be saving\nThat basement mumble, crumb just a crumble\nAbout nonsense, now let's tumble\nI'm going to defend this, we can't end this\nUntil I finish, the unfinished business\n\nNow here comes a girl scout rhymin' like cookies\nCame in like a champ, went out like a rookie\nBut that's alright cuz Antoinette ain't with it\nI got it good, that's why I hit it\nThem ? from a ? with a block or more\nGame plan come apart ? strong and score\nWhatever is said whatever is read\nGet it in your head I'm outta date like a thoroughbred\nPuttin' ducks in line going for mine\nHold up! Did someone say I can't rhyme?\nHuh, you must be jokin' or smokin'\n? ?\nOrder, I got the tab, cuz I continue\nTo serve and get to step like I was holdin' a gun on ya\nMust be my vocals and the way I lay em on ya\nI got it good now it's time to end this\nCase closed on the unfinished business", "year": "1988-01-01"}]}