{"songs": [{"lyrics": "[Hook]\nGet up to get down now\nGet up to get down now (like this)\nGet up to get down now (like this)\nGet up to get down now (alright)\nI don't wanna do it anymore\nCouldn't do it if I tried, wouldn't do it if I wanted it\n\nHey\nI don't wanna do it anymore\nCouldn't do it if I tried...\n\n[Verse 1]\nOkay, the moments were subtle, but unstolen, and guess who owns them?\nNo friendly, non-threatening corporate, lacky-mucks, in the totem\nLucy was In the Sky with Diamonds,five dollars to hold 'em\nThe summer, Van Eek beat Pac-Man, with acid behind his molars\nLittle white tab tolerant, little white flag, waggling\nInorganic, pat on back, trim the panic, flat on backer\nBack to back like Mad Hatter magic, rabid mastiff collaborative  - Splatter,bachelor fabric fatter, with cabbage patch lit\nDark days, Ben and Louie-Louie, park blazed, chemically -\nBent-up but eager to crash for that one, two, three repeater\nGood Morning Vietnam!Whose couch is this? Whose house is this?\nWho are you down with bitch?I'm sorry, dog, I dreamt the foulest shit\nThere was this rabbit foot talisman, drowning out of my arm-span\nWhat's fouler, was the other farmhand's growing gills, and shark fangs\nWhat's fouler, was my torso stripped to ribbons, in the marshlands\nBut I'm up now\nLet's get this window pane, and shut the fuck down\nDown by the river, where the litter sits -\nAnd lion-heart critters, smoke dope, and act like illiterates\nI ran with a brat pack of loose bolts, and high social maladjust-ees\nSacred, numb and boundless went to St. Protocol, cut me, well -\nI was dummy to some, when the tongue was cradled, and my skin looks crazy\nPocketbook mirror courtesy Amy,spiders in the  -Mattress,paisley sunglasses, dilated eyes green\nIce grill that could burn through, your picture-in-picture widescreen\nPoison late late show, starring Aes' and in a jigsaw face of -\nTwelve hour, solid gold entertainment, utter shit to self -\nFrom mothership to stealth, ADD pace be, Space Invader\nThis one's for the Labor Days, work for rent and rolling papers\nOnly the illest beats leak absurdly out the boombox\nThe Daytripper anthem goes: wake, drop, walk to aquarium\nWhistle while you work, like a canary lung,\"All work -And no play makes Jack a dull boy\", to carry drugs\nI sorta see it, as my last blast in summer (Uhn!)\nSkateboards and sloppy psychedelics and big numbers\nGood times, good people,all airbrushed -\nOn a collapsible easel, peace man, easy\n\n[Bridge]\nAnd I knew the permanancy would drift\nAnd I knew the pH balance wasn't right\nAnd I knew the crash and burn, how to caress it\nL.S.D. flashed the message\nAnd I knew the gash wasn't gonna stop bleeding\nAnd I knew the ph balance wasn't right\nAnd I knew how September would then affect it\nL.S.D\n\n[Verse 2]\nLazy summer days\nLike some decrepit land shark dumb luck squad dog lurks, sicker deluded\nLast sturdy domino lean's secluded\nDon't let stupid delusions lesson super-duty labor students\nDragnet lifer solutions\nDaddy loved sloppy dimensions like son-daughter links\nSuch determinated lepers, successfully disheveled\nLittle soliders developed like serpents despite life sentence ducking\nLemmings\nSome don't like sobriety's dirty lenses\nSome do\nLet sleeping dogs lie still\nDon't look so damn lackluster\nSuck defeat\nLump summed damage\nLoad sample, delete\nLate Show Dave Letterman, shitty diner lip-slide dutch\nLow self-discipline leaders see dead lung self-destruct\nLife sucks dickhead\nLost summers display laminate showcasing divinity live\nSystem definitive\nLiturgy soaked, depict lowly spectactular delight\nWhy, what kind of L.S.D. you like?\nYour lizard king has spoken (all hail)\nYou in the back of the muck, those trails aren't necessarily bunk\n(Summertime)\nSome'll try and recapture the same flag\nBut I played it smart and recognized the summertime passed\n\n[Hook]", "title": "The Greatest Pac-Man Victory in History", "album": "Bazooka Tooth", "image": "https://images.genius.com/5a2c7b8825768526d90927046bb22cfe.1000x1000x1.jpg", "year": "2003-09-23"}], "artist": "Aesop Rock"}