{"songs": [{"year": "2002-03-26", "album": "Exit", "image": "https://images.genius.com/dcee8e66d8bfbca61e739b2be7ba65e6.352x350x1.jpg", "title": "Masquerade", "lyrics": "[Intro]\n(Masquerade) One two, see this?\nRight here this is heat, yo, yo\nMassive massive\n\n[Hook]\nThere's something deep inside\nThat's telling you that love's so much more\nThis is just a masquerade\nWhen everything's alright\nYou know it's time for the writing wars\nIf it's just a masquerade\n\n[Verse 1]\nWhen I feel the way of my lost innocence\nLooking for emotions that all fall aside\nEverything is waiting on that dominance\nHoping for new opuses and alibis\nAnd I'm with you, oh ohohohoh\nIf I could starve from falling\nAnd I bet you, oh oh  oh silenced the\nVoices in your head but there's no place to go\n\n[Hook]\nThere's something deep inside\nThat's telling you that love's so much more\nThis is just a masquerade\n\n[Verse 2]\nYo, yo\nI sit back with the microphone\nWatchin' these MC's turn to actors\nProducin' all the factors\nThat flip life, into a masquerade\nWe like a bunch of mannequins\nBattery operated, inoculated\nWith five sentences connect us to the Earth\nRich sinners since the days of my birth\nFor what it's worth, dissuaded love\nI'm steadily spreadin' love over the beat down\nLet's meditate and feel the heat now\nLike beautiful rain, on the desert plain\n'Cause the sun parch the ground on the weak sound\nI break it down, to elements H2O\nA place to go, that you can't escape the flow\nDoes not exist, I love the truth so I persist\nIntelligent men? Or just \"Gorillas in the Mist\"\nClenchin' a black fist, for the size of dollar bill\nI leave the space so you can think about it now so just chill\n\n[Hook]\n(There's something, there's something deep in)\n(There's something)\nThere's something deep inside\nThat's telling you that love's so much more\nThis is just a masquerade\nWhen everything's alright\nYou know it's time for the writing wars\nIf it's just a masquerade\n\nBlack shit, ration, tryin' to step up\nBut they can't even cash it\nKick that shit\n\n[Outro: ?]\n(Kamau)\n(First saved message)\nIn this venture, nothing gained\nI've only just touched the surface\nOnce nervous, when writing for a worthless purpose\nIt was once more than this, before the heart left the beat\nThe soul left the speech, I'm still trying to reach\nMy niche, and teach the love again\nInside the hate of a present day\nGot stepped after, being genuine we're swept away\nBefore the importance of diamonds, bells\nAnd a platinum place, fallen from grace\nNot my campus with another trace\nOf the same thing I came in, this thing is worth saving\nStanding in the pockets holding tongues of what I'm saying\nBlaming myself only for supporting what they're playing\nI may peek through the storm, but now it's raining\nUnchanging of late, it's hard to be creative\nAlthough creating is native to me, I tried to be\nEven patience couldn't save it, from the days of pages\nThey couldn't believe I would say this\nNo longer without wings, Kamau is what my name is\nToo many undermind, what I underline\nPlacing my poetry underneath their making of rhymes\nIt was a creation of frustration\nBrown bricks or blank slates\nSubway trains and cardboard bound with masking tape\nIt was the sound of the evening, the way the day grew late\nWords tumble from lungs over my tongue\nAnd gave a new taste to my fate\nIt doesn't even matter how the chatter would paint us\nWith love on our side they could barely stand against us\nUm, what up? Uh Kheaven, what's goin' down?\nUm I got your message, and uh yeah, basically call me back\nBasically call me back and tell me\nSorry about the length of the message, but you know\nYou feelin' it? Aight man peace\n(End of message)"}], "artist": "​k-os"}