{"artist": "Ice Cube", "songs": [{"title": "Hood Mentality", "lyrics": "[Intro: Keith David]\nThe hood mentality is a crippling disease that attacks your nervous system\nIt makes you nervous of the system\nGangsters and hood rats are especially susceptible to this grown-stunting mentality\nThe hood is where I'm from, but it's not what I am\nThe hood is where I'm from, but it's not what I am\n\n[Verse 1: Ice Cube]\nFuck school nigga, I'mma be a dope dealer\nI'mma be a killer, yep a urban guerrilla\nI'mma stack scrilla, yeah buy me a villa\nSell a 5-0 to my auntie Priscilla\nI don't give a fuck that she look like \"Thriller\"\nHit that shit one more time and fuck around and kill her\nCause I got the heart of a Pittsburgh Steeler\nBlack nigga draped in gold, with a nine milla\nLove money, love jail, love that penitentiary mail\nLove the way these niggas smell, keep coming back, can't you tell?\nLove to see my mama cry, love to see my babies struggle\nLove to see my woman juggle nuts cause she got to hustle\nI don't give a fuck how my life go\nNow I'm a slave man to this caveman without Geico\nEverybody wanna call Michael a psycho\nBut he ain't never came through the hood with a rifle\nGunning niggas down cause they don't got the right clothes\nHit the wrong person cause we shoot just like hoes\nFirst I was blood thirsty, Mister Mister Controversy\nNow I wanna beg for mercy, should have took my ass to Berkeley\n\n[Chorus]\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\n\n\n[Verse 2: Ice Cube]\nFuck school nigga, if I grow a little taller\nEverybody tell me I'm gon' do it, I'm gon' be a baller\nSo fuck that thinking, fuck that thinking\nFuck them Lincolns, I want Franklins\nCome back through here with my crew, I'm gon' have my own shoe\nI'm gon' be that little fool coming in your living room\nStarting point guard nigga, fresh out of middle school\nEither it's the NBA or it's the NFL\nI don't know what else I can do to keep my ass up out of jail\nI wanna be like Tiger Woods, swing that club, make you sick\n(I wanna be like Pacman Jones), (I wanna be like Michael Vick)\nI wanna be like Barry Bonds, (I wanna be like O.J. Simpson)\nLeave this field, leave this prison\nTell you motherfuckers where to kiss 'em\nI wanna be all broke up, moving all old and slow\nI wanna be a alcoholic just like Broadway Joe\nI wanna be a sideshow, kinda like Iron Mike\nUsed to have a few Bentleys, now I just ride a bike\n\n[Chorus]\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\n\n[Verse 3: Ice Cube]\nFuck school nigga, they ain't trying to educate me\nAll they give a fuck is what I memorized lately\nI'm gon' have to teach myself, clock that money, get that wealth\nI wanna be like Santa Claus, I don't wanna be no fucking elf\nNo kid left behind but he get the runaround\nCan't you motherfuckers see that they trying to dumb us down?\nDon't trust the government, President is for sale\nHe don't give a fuck about a nigga, just a oil well\nSell crack, go to jail, bust a rap, go to hell\nDo I got to sell my soul if I wanna go to Yale?\nGo kiss Oprah's ass if you wanna be Gail\nI'd rather have my ass kissed up in Bloomingdale\nYou can go be a pimp, you can go be a ho\nBut you only gon' get paid off what you know\nIf you don't know shit, then you can't work for me\nCause you read your first book in the penitentiary\n\n[Chorus]\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?\nIf you don't wanna shake that hood mentality\nHow the fuck we supposed to change our reality?", "image": "https://images.genius.com/284f4145950de6c7f91a598379e2bb40.1000x1000x1.jpg", "album": "Raw Footage", "year": "2008-08-19"}]}