{"artist": "E-40", "songs": [{"title": "Block Boi", "image": "https://images.genius.com/7d8ec825cf8205054cbe1700cab81ef8.1000x1000x1.jpg", "album": "My Ghetto Report Card", "year": "2006-03-14", "lyrics": "[Intro: E-40]\nUhhhh! Ah-ah-ah\nStudio Ton (E-Feezy) Studio Ton\n\n[Verse 1: E-40]\nOut here it's sick, AR-70's and albino pits (albino pits)\nPatriots and bushmasters, home invasions and licks\nI'm in it to make the most, you in it to flamboast\nYou in it to trick it off to them hoes\nI'm in it to make her buy me some clothes (clothes)\nI be treatin' my scraper like a Rolls\nLemme stop lyin' no I don't (don't)\nI be sideways on two toys, all the rappers call me Unc (Unc)\nFeasible, unbeatable, the best thing that ever did it (did it)\nIncredible like Ichiro, you pitch it I'ma hit it (hit it)\nOne of my youngsters just got popped with a thumper (thumper)\nThey tryin' to wash him, they talking football numbers (football numbers)\nThey tryin' to stop him, it's merk in the air (in the air)\nTake one of mines I'ma take three of theirs (three of theirs)\nSome of you suckers can't tell a lettuce from a cabbage (cabbage)\nA coon from a plumber, a kangaroo from a rabbit (from a rabbit)\nLook at my life, look at my guys, look at my fame (look at my fame)\nLook at you guys, look in my eyes, look at my cane (look at my cane)\n\n[Chorus: Stresmatic]\nBlock, block, block, block boi\nBlock, b-block, b-block, block, block boi\nBlock, block, block, block boi\nRide with a thang to put yo' head on flat\nBlock, block, block, block boi\nBlock, b-block, b-block, block, block boi\nBlock, block, block, block boi\nRide with a thang to put yo' head on flat\n\n[Verse 2: Miko]\nM-1 in this piece, already (already)\nSquat a 33-year-old Chevy (Chevy)\nReplace everything, on them heat cherries\nSo much chrome under the hood, straight scary\nGet my grown man on, Sacramento Valley\nOn 22's, playboy vet rallies (rallies)\nTremendo, to the extreme where I go\nPimpin I'm cleaner than a San Jose car show\nHotter than Barstow in August\nChevyLand love me, I'm year one flawless (one flawless)\nThe law just, pull up beside me give me the thumbs up\nI turn the beat up like \"That's what up!\"\nHuh, Studio Ton, ya'knahda'mean?\nGot it smobbed out, smack it like magazines (like magazines)\nWhen I want to roll deep, I got a van (got a van)\nBut right now it's Young Mik' in the waterman\n\n[Chorus: Stresmatic]\nBlock, block, block, block boi\nBlock, b-block, b-block, block, block boi\nBlock, block, block, block boi\nRide with a thang to put yo' head on flat\nBlock, block, block, block boi\nBlock, b-block, b-block, block, block boi\nBlock, block, block, block boi\nRide with a thang to put yo' head on flat\n\n[Verse 3: E-40]\nOoh! Sick of turfs scorchers smokin' hot like a broken stove\nMe and my Filipinos, Tongans and cholos\nOn the soil, taking precaution\nOn the roof in the trees, with them Latins listenin' and watchin'\nOoh - good grief!\nIt's never been this ugly out here, we in some heavy beef\nThey left his body in the streets for twelve hours\nCandlelight vigils, sidewalk funerals and flowers\nOoh! These youngsters ain't listenin' they disrespectin' it\nAin't no O.G.'s to holla at, no one to deaden it\nOoh - chemical babies, the parents smokin' rock\nPlus they ain't never had a chance to know God (to know God)\nIn my days, I was raised in the church\nMomma did what she could just to keep us off the turf (keep us off the turf)\nBut it ain't no one to blame (but who?)\nBut Noriega and Reagan and rock cocaine\n\n[Chorus: Stresmatic]\nBlock, block, block, block boi\nBlock, b-block, b-block, block, block boi\nBlock, block, block, block boi\nRide with a thang to put yo' head on flat\nBlock, block, block, block boi\nBlock, b-block, b-block, block, block boi\nBlock, block, block, block boi\nRide with a thang to put yo' head on flat\n\nBlock boi... block boi\n(Ride with a thang to put yo' head on flat)"}]}