{"songs": [{"title": "100 Grand", "album": "Signed To The Streets 3", "year": "2018-11-09", "image": "https://images.genius.com/77f5319786472dc130c83ed82cc7e31f.1000x1000x1.jpg", "lyrics": "[Intro: Lil Durk]\nIn this motherfucker smellin' like a hundred racks\nSmellin' good with this Bond No. 9 (Hitmaka)\nHundred racks, hundred racks, hundred racks, oh my God\nMarii Beatz, turn me up, up\n\n[Verse 1: Ty Dolla $ign & Lil Durk]\nIt's all these diamonds on her 'cause she mine (She mine)\nYeah I do this shit for fun (For fun)\nChampagne showers 'til she cum ('Til she cum)\nI just popped a perc for everyone (Everyone)\nWraith, watch, PCA drop (Turn up)\nTime machine the road, suicide the top (Top)\nDowntown parking lot, penthouse shot (Turn up)\nYou just wifed a thot, she up but she not (Yeah yeah)\n\n[Chorus: Ty Dolla $ign & Lil Durk]\nI just spent a hundred grand on my jewelry (On my jewelry)\nI just spent a hundred grand on my jewelry (On my jewelry)\nYou say, you say that's your mans, are you sure-y? (Are you sure-y?)\nHe done told on the whole squad, no sorry (Turn up, come on)\n\n[Verse 2: Lil Durk]\nI just blew a big bag today on my diamonds (Turn up, come on)\nEverything too real, be honest\nUh, uh, we be pushing the Porsche in the trenches (Skrrt)\nCame a long way hopping fences\nCash, credit, shawty fix her titties\nBut these niggas don't get it, ooh\nI just bet 100K on Floyd, oh (Cash)\nI ain't going if I ain't on that floor, oh\n100K bust out the plastic (Turn up)\n100K flood out the Patek\nWest coast we hot in (JoJo)\nFuck around, hide in the attic (Go, go)\nUh uh, tell that DJ play this shit right back, uh-huh (Turn up)\nYoung fly nigga, pick up where he slack (Where he slack, ayy)\nToo hot up in this club, get off my back (Get off my back, ayy)\nDon't wanna hit your cup if it's not Act, Act\n\n[Chorus: Ty Dolla $ign]\nI just spent a hundred grand on my jewelry (jewelry)\nI just spent a hundred grand on my jewelry (jewelry)\nYou say, you say that's your mans, are you sure-y? (sure-y)\nHe done told on the whole squad, no sorry\n\n[Verse 3: A Boogie Wit Da Hoodie]\nYeah, look at my wrist, that's a Patek, yeah\nLook at my neck, that's another Patek, yeah\nGivenchy sweats with a Moncler vest, yeah\nFuck my ex, fuck all my exes, yeah\nShe cut me off, so I fuck her best friend, yeah\nShe hit me up and I seen a message, yeah\nSmith & Wesson, fuck a Tekken, yeah\nHit his head then that's a dead man, yeah\nHit his head now he a dead man, ooh\nHit his head now learn a lesson, ooh\nI'm so blessed now, I'm a blessing, ooh\nYou a dub now, I'm finessing you\n\n[Chorus: Ty Dolla $ign]\nI just spent a hundred grand on my jewelry (jewelry)\nI just spent a hundred grand on my jewelry (jewelry)\nYou say, you say that's your mans, are you sure-y? (sure-y)\nHe done told on the whole squad, no sorry\n\n[Outro: Ty Dolla $ign]\nIt's all these diamonds on her 'cause she mine (Wow)\nYeah I do this shit for fun (Fun)\nChampagne showers 'til she cum ('Til she cum)\nI just popped a perc for everyone (Everyone)"}], "artist": "Lil Durk"}