{"artist": "R. Kelly", "songs": [{"album": null, "year": "2000-12-31", "lyrics": "{R. Kelly Humming}\n\n[R. Kelly]\nChillin in my four point six, at the light\nBout to be V-I-P for the night\nShorty in the drop top V, made alright\nPull up to a bumper baby, beep twice\nJumped out the whip like I was the police\nDidn't have a gun but my wrist said freeze\nThat Friday on a dvd\nShe's a baller and I'm a baller, what what\n\n[Hook: R. Kelly]\nTo all my hot girls livin, fiesta\nTo all my hot boys livin, fiesta\nTo all my Chi-Town niggas, fiesta\nAnd all my uptown niggas, fiesta\n\nTo all my players and my hustlers, fiesta\nAnd iif you sittin on them thangs, fiesta\nTo all the honies in the club, fiesta\nAnd if you rollin wit a thug, fiesta\n\n[R. Kelly]\nWe be off in the club sippin la\nRed eyed deep in the cut puffin la\nStrippers in the back of the club showin la\nSoon as I get a buzz, I'm showin la\nHouse on top of the hill, got 'em what\nWho's gonna by the bar? Got 'em up\nTake the haters out in the back rough 'em up\nI'm a baller, now where's my ballers? What what\n\n[Hook]\n\n[Bridge: R. Kelly]\nWe pop Cris' on a daily base (Come on)\nPlus we got honies all up in the place (Yeah)\nBout to wild out in a major way (That's Right)\nSo put your hands up if you made your pay (Come on)\nAdd a little juice to the Tanqueray (Yeah, Yeah)\nAnd let the ice show up to the diamond face (Uh huh)\nRockland sittin on Capitol Hill (Come on)\nTrackmasters make Capitol deals\n\n[Jadakiss]\nYo you can catch me blowin fresh Chronic\nIn the new Charcoal Gray M-5 step tronic\nAnd I don't pimp, I just keep my hoes in order\nAnd I keep my neck full of frozen water\nAnd we usually wear jeans, but it's linen tonight\nI'm spendin tonight, everybody spendin the night\nWe gon flick it up and hit my man off wit a kite\nSo when he see it, he can visualize livin the life\nIf I do somethin to you, then you guys could tell\nBut you know that I still got pies for sale\nA plane and a boat cause I like to fly and sail\nDid you ever think you'd hear the *muah* and Kel?\nSippin bottles and everything\nHittin models and everything (Fiesta)\nYou can spot me and R by the bar wit heavy bling\nThe east side to the west side, live it up (Fiesta)\nWhile you cause even the best die so (Fiesta)\n\n[Hook till fade]", "title": "Fiesta (Jadakiss Remix)", "image": "https://images.genius.com/e54b7a47c059f99afc5429a8709acf02.400x400x1.jpg"}]}