{"songs": [{"year": "2018-09-19", "image": "https://images.genius.com/ea16dd136dff0755c92524eb329d220c.612x623x1.jpg", "title": "Love Tap", "album": null, "lyrics": "[Intro: Bizarre]\nGet the fuck up\nHa, ha, yeah, yeah\n\n[Chorus: Bizarre]\nEverybody, get the fuck up\nGet the fuck up\nEverybody, wild the fuck out\nWild the fuck out, wild the fuck out\nEverybody, get the fuck up\nGet the fuck up, get the fuck out\nEverybody, wild the fuck out\nWild the fuck out, wild the fuck out\nWild the fuck out\n\n[Verse 1: Bizarre]\nHoly moly, no one knows me\nThis white chick, she says she wants to blow me\nSmokin' reefer, I'm a chiefer\nBlaze enormous, brand new Wiz Khalifa\nPoppin' pills, I need to chill\nI need to get a r-r-refill\nBaby talk, won't even see a baby walk\nPop shit, outline her in baby chalk\nI'm vicious, terrific, out of my mind\nWe share the same bloodline like Royce da 5'9\"\nFuckin' legend, been a goat\nPoppin' pills, I'm into dope\nShady Records, used to be signed to Interscope\nI'ma start hookin' niggas from Jersey to Brooklyn, niggas\nAin't got no apron on and I'm already cookin' niggas\nMan I'm out, are you a man or mouse?\nBring 'em one by one, I start airin' 'em out (anybody)\nDrugs and pills, that's all I'm carin' about\nHe cappin', I'm rappin', he snap, it's gon' happen\nA kidnappin', he laughin', I'm clappin', you rappin'\nBlowin' four pipes, fuckin' four dykes\nBeen up four nights, goin' to war like Fortnite\nOne eye like Fetty Wap, get your belly flopped\nCooked up, beat up like Betty Crock\nI ain't no sucker, I stay sucker free\nI ain't duckin' niggas, niggas duckin' me\nDrink Champs, I should go on N.O.R.E\nGet fucked up and tell the whole world my story\n\n[Bridge: Bizarre]\nWhy they dissin' Eminem? Why they ride with MGK?\nThey gon' learn today\nNiggas singin' like Monica\nWho the fuck is a Jay Electronica?\nWho is that? I'm tryna, tryna remember...\nOh, it's Jarice, the guy that carried the bags\nThe one that used to sleep on the floor and call Denaun dad\nThe one that sold the tape to The Source\nLet me chill, I'm gettin' off-course\n\n[Verse 2: Bizarre & Joe Budden]\nDon't tell me on your album how much you love D12\nWhen I look at Bizarre, he don't look like he's doing very well\n*Pow-pow-pow* Just pump it up!\nNext time I see your jaw I'ma lump it up (bitch)\nNo offense (no), straight defense\nFuck around and put your son on the remix, punk\nI'm a mothafuckin' hog\nDisrespectful, I'll shoot your fuckin' dog\nDamn, you loved that dog to death\nGood, you can watch it take its last breath\nJoe say he clean and sober\nBut asked me for a Percocet last October\nWe was on a tour called Never Say Never\nI gave you some cocaine when you was under the weather\nDamn, am I talkin' too much? (Shut up)\nKeep sayin' my name, you ain't gon' be walkin' too much, bitch (old ass nigga)\nI don't be doin' no runnin'\nI ain't gon' say come to Detroit 'cause I know you ain't comin', damn"}], "artist": "Bizarre"}