{"artist": "Kid Ink", "songs": [{"image": "https://images.rapgenius.com/9f484e80ff2ebf41057d4477f9c99b17.500x500x1.jpg", "title": "Blunted", "year": "2015-01-30", "album": "Full Speed", "lyrics": "[Intro]\nI got 1.5 for the blunt\nGo ahead and pass me a Swisher\nBlunted, blunted, blunted, where the blunt at?\n\n[Verse 1]\nI got 1.5 for the red eye flight\nIf you tryna get high bitch just my type\nSitting in the room full of disco lights\nPair of shades on, who the coolest nigga on site\nTell 'em hide that, where the fuck you buy that?\nI can't even try that, glad I got my own shit with me\nCatch up, if it's OG match up\nBut you ain't got a Swisher then we ain't gon' session\nThis motherfucking weed so sticky\nBreaking this down get ya fingers so messy\nYou gon' put a hole in the blunt, keep rushing\nShoulda used a grinder ho, them buds chunky now\nYou could say I'm an addict\nGot a gram of the wax if you need a dab hit\nMust keep it in a jar cause these niggas cabbage\nWhat you smoke, 420 is my fucking average, imagine\nBlunted, blunted, know you can smell me coming\nSaid blunted, blunted, everybody always like \"Sell me something\"\nBut this sack cost more than a 20\nYou can roll one of mine just wrap it like a mummy\nStraight top shelf in the store\nStole the connect, now I get it for the low\nSo you know I got..\n\n[Hook]\n1.5 for the blunt\nGo ahead and pass me a Swisher\nSmoke about a pound in a month\nI don't even pay it no attention\nGot 1.5 for the blunt\nGo ahead and pass me a Swisher\nStay blunted, blunted, blunted\nWhere the blunt at?\nBlunted, blunted, where the blunt at?\nBlunted, blunted, where the blunt at?\nI got 1.5 for the blunt\nGo ahead and pass me a Swisher, stay\n\n[Verse 2]\nRoll one for the niggas who fronted\nFor the bitches who want it, roll one for the money\nRoll one to the face, that's 4 if you counting\nHigh as a mountain, all for these ounces\nUh stuck in the middle of the couch with cotton mouth\nI need a sip from the Fanta\nSo gone think I left a couple nugs at ya crib\nMake sure you hit a nigga when you found 'em\nBlunted, blunted, me and my niggas treat weed like money\nSaid blunted, blunted, if I smell another seed I'm running\nSaid, no sticks, taking shots while you hitting bricks\nKnow I got the juice and you niggas nowhere in the mix\nBe consistent, what you smoke hit or miss\nI roll up OG every intermish\nO-OG, might make a motherfucker OD\nHit ya body like morphine, army\nBabysitting the blunt, I'll get you a car seat\nFuck what it cost me, these dividends is all going to the medicine\nIt ain't one of the 7 sins, rolling with these 7 grams\nSorry baby if there's weed hanging out the end, but it's\n\n[Hook]\n1.5 for the blunt\nGo ahead and pass me a Swisher\nSmoke about a pound in a month\nI don't even pay it no attention\nGot 1.5 for the blunt\nGo ahead and pass me a Swisher\nStay blunted, blunted, blunted\nWhere the blunt at?\nBlunted, blunted, where the blunt at?\nBlunted, blunted, where the blunt at?\nI got 1.5 for the blunt\nGo ahead and pass me a Swisher, stay"}]}