{"artist": "Bone Crusher", "songs": [{"album": "Release the Beast", "title": "Danger", "year": null, "lyrics": "[Chorus w/ police sirens, and honking horns]\n[Bone Crusher] You about to approach\n\"Danger, danger, danger, danger\nDanger, danger... {*scratch: danger*}\nDanger, danger, danger, danger...\"\n[Bone Crusher] You fuckin with me! You about to approach\n\"Danger, danger, danger, danger\nDanger, danger... {*scratch: danger*}\nDanger, danger, danger, danger\nDanger, danger, danger, danger\"\n\n[Bone Crusher]\nYeah! Thug nigga, make that paper\nHustle hard, HEAVYWEIGHTER\nA big Chevy 57 Bel-Air\nAnd niggas wanna know why I really don't care\nNigga, ha, I dare a nigga step up\nUntil his ass fucked up, I let the tommy throw up\nYeah! And scared money don't make money\nYeah, and bein broke ain't never funny\nNigga, I represent them streets\nFrom the asphalt pimpin to the 40's on my feet\nNigga, so pump your brake like Midas nigga\nAn ass-whoopin is the price\n\n[Chorus]\n\n[Tezy]\nYou 'bout to push a 155 pound nigga\nQuick to come in your hood and lay your ass down nigga\nBest believes I don't play around nigga\nLeave it up to Beaver and we'll both lay ya down nigga\nCause this a new trend brought from the South nigga\nWhere nigga wear afros and golds in they mouth nigga\nAnd have you waitin for a long time like Snickers\nOr catch me in the Bassment talkin bitches with my nigga Tigger\nIt's B.G. nigga thinkin 'bout the bigger figures\nThink wisely, think about your life nigga\nThink about your family and your kids and your wife nigga\nIt's gettin hectic in these streets\nSo I suggest you think twice nigga\n\n[Chorus]\n\n[Bone Crusher]\nHere comes trouble motherfucker sound the alarm\nI'm an elephant, ridin like Genghis Khan\nThese niggas claimin hardco' but they wishy-washy\nBatter bruise your body, leave you sloppy sloppy\nHey speak clear I can't hear what you sayin nigga\nOpen up your mouth when you talkin to a real nigga\nAnd if you hardco' pimpin why'ontcha bring the heat\nAnd we can get it on in the middle of the street\n\n[Chorus]", "image": "https://images.genius.com/8238f0468ca00f9904b8a992b5eed5d2.620x620x1.jpg"}]}