{"songs": [{"year": "1996-11-26", "album": "Enigma", "image": "https://images.genius.com/482eea61300bdf72a62b443973fd7a5c.1000x1000x1.jpg", "title": "Yeah", "lyrics": "Verse One: Erick Sermon\n\nYo Troy, turn me up so I can conductthe disco inferno\nOklahoma aroma (uh)\nI smell the roof on fire without Parliament\nJust Def Squad shit, dig it\nRhymes I be like liquid swords\nYou abandon ship, real niggas stay aboard (word)\nI'm flexin' hittin' you in the mid-section\nDrop for protection. Cuttin' you clean like a \"C\" section\nI puts it down in my field. I sport a vest\nNo need for a Brooke Shield kneel\nE, an African boy with charisma\nA lyrical giant bigger than Lane Bryant\nSu-per rhymes be twilight zone warp speed true indeed\nDon't forget boy I'm still hittin' swithes\nIn my Lexus truck, flaggin' down ugly bitches (word up)\n\nVerse Two: Busta Rhymes\nErick Sermon ya'll yeah, yeah, yeah\nDef Squad ya'll yeah, yeah, yeah\nFlipmode Squad ya'll yeah, yeah, yeah\nExcitement, my lights be shinin' on\nNiggas. Hit with more enlightment (yo)\nThe major difference is in many different instances\nYou drinkin' too much Guinesses\nNow look at all the witnesses (huh)\nI told you one thing for sure\nWhen I gets down son, I keep it raw\nBreak the law from here to Arkansas\nFocus, I be the mostest, the dopest\nRhyme flow bounce atrocious\nBag of weed, my niggas smoke this. Shit\nI be stacking in jams\nWhile I be packin' in what's happening\nI'm charged with interstate trafficking\nRhyme calisthenics will make you see the the medic\nShit will break you down in order\nFor to make M.C.'s like the alphabetics\nYo, yo just go there practice\nThe fact is you do not listen\nYou go ahead and get slapped up with a cactus\nAss backwards, fart on mothafuckas just like BDP\nI'm fresh for 9-6 you suckas. Keith Murray now\n\nYeah, yeah, yeah (Word up)\nYeah, yeah, yeah, yeah Busta Rhymes\nYeah, yeah, Yeah, yeah\n\n[Verse 3: Keith Murray]\nNow if you know the words then you can surely rap along\nGo against the grain and surely get stomped strong\nMy squad is too high to get over\nL.O.D. is too low to go under\nI'll rain on your brain and give you visions of thunder\nSee everybody loves Keith Murray 'cause I'm on the top\nBut i know ain't nobody fuckin' with me if I ever drop\nIt's all about the bread. Spread taught to me by E and Red\nFuck them niggas talkin' out the side of their head\nDifferent day same shit. I heard a dope beat\nBut if E didn't do it, then you know I can't fuck with it\nHere's something you all can understand\nFuck you coming from the fuck you man\nLivin' in drama comma, trauma bubbling like lava\nOn site bomber to all wack rhymers\nAnd if you ain't tough don't wear my logo\nAnd if you ain't fly you can't play with my yo-yo\nCause who's pockets is fattest matters\nI'll serve famous Keith Murray's beef curries\nScattered rappers on platters\nFor tryin' get at us, knowing we the baddest\nWith major operation, mental observation status, see\nI used to love her then I got some common sense\nNow it ain't funny, the bitch better have my money (word up)\n\n[Verse 4: Jamal]\nLace the chronic with the bomb-ba, hash the tye\nBlaze 'em up 1 time for my partner in crime\nWho can I on my hip (why) cause niggas trip\nPull a burner, all you know is a murder occurred\nA curb swerver wannabe server slash baller. Got\nDome call hauled to the mortician for silly ambitious\nI'm nice and precise, hard like rock\nYou shook like dice and pop like Glock\nAmy shit knock the shelves (yo, yo)\nWitness this nigga ro, trigga flow, digga ho\nNiggas ass out, passout, excessively\nFuckin' with this manic-depressive will be the lesson of your life\nPoiled rotten and plottin' and double shottin'\nPackin', always rapping but smacking a lot of action\nI am in the house smelling like contra-band\nI demand your mic in hand, seriously as a man run it\n\nVerse Five: Redman\nAy yo, watch these 5 niggas stand up in triple pod\nCircle back to back scoping all angles\nWhy does hip-hop circumference start gettin' tangled?\nThey drop 1 by 1 in the dark gettin' strangled\nI come fresher than Summer's Eve please\nSqueeze your wack-ass amphetamine rhyme drug-related\nI'll make sure your loot and your wife and kids are confiscated\nThe lawnmower, Red do damage to circuit breakers\nGo ahead and hype them niggas up, let 'em go\nJust a blow from the invincible will show 'em I'm original\nFreeze, I'm like, Baskin and Robbin I'm robbing Haagen-Dazs\nAnd the whole Hit Squad target\nAin't nobody fuckin' with me, the potency\nThat I blow from my mouth will no doubt choke Jesus\nTravelin' around the world with no Visas or American Express\nJust Jamaican excess (ha!). Can I impose on your cipher?\nBeen rippin' shows since your moms was foldin' your diaper\nNiggas see me up top, dolo daily\nCatch ease 600 V on the mobile trailin' back to A.T.L\nSwell some more heads with that Long Island sound\nThat be thicker than cornbread (money)\nJersey tales from from the hood without Sonny\nAnd I know niggas want me\nThat's why my blade keep me company\nSlice your neck, stick my arm down your throat\nRip out your artichoke"}], "artist": "Keith Murray"}