{"artist": "Pacewon", "songs": [{"album": "Won", "title": "Sunroof Top", "image": "https://images.genius.com/51988e399d7fd0c27dc7bf9671e91b51.600x600x1.jpg", "lyrics": "[Pacewon]\nAhhh.. yes.. one life.. and what a life it is\nThe new millenium.. everything's beautiful\nEverything's bright -- EXCEPT in the underground\nHu-hu-huh, yo, yo, yo, EXCEPT in the underground\nAnti-theft devices.. stolen cars.. mad drugs\nChancellor Avenue! (Yo yo yo YO! Pace! Whattup nigga?)\n(Yo yo yo!) HUH!\n\nSunroof top, built-in stash spot\nChillin on the scene with a gangsta lean, OOH\nUh, yea-yea-yea-yea-YEAH\nYea-yea-yea, yo-yo-yo, UH!\nSome do clock like neighborhood watch\nJealous of the team that's makin the cream, OOH\nYea-yea-yea-yea-yeah\nAnd it go like this\n\nI don't be battlin average men, I rip your establishment\nSemi check they're after us - 260 Madison\nAvenue, New York, New York\nMy crew walk through y'all like MOVE IT, MOVE IT\nDon't make me holla holla that your raps need improvement\nYour best track get left back like stupid students!\nAnd while I show you new kids how to do this\nLet me break down how I be movin units, yo\nI talk about stealin you and how your label beatin you\nExploit the weakness that I see in you\nCrack on your Mom Duke and talk about your vehicle\nBig time FAG, not doin what you need to do, YO\nI'm the unbeatable, non-stop eager to\nStep up to the plate nigga like a major leaguer do\nSee jail, get a R.O.R\nCome back home like a hardcore star!\nTake over the streets, move that cardboard car\nDoin two hour shows, no encores y'all!\nGat blow, rap pro, style is supernatural\nHave hoes packed 'til they can't move 'em back - YO!\nWho been imitatin? Who wanna be like me?\nRap all day, fuck all night WE..\n.. are the debonnaire, never scared\nPush it 160, mad tipsy off of Everclear\nGot guns and Knicks like Marcus Camby\nI hide 'em in the darkest alley\nIf a snitch drop dime on my crimes I'mma have to park at Rally\nRun up and spark his family; sing the hook!\n\nSunroof top, built-in stash spot\nChillin on the scene with a gangsta lean, OOH\nYeah, yeah, huh, yo\nYo-yo-yo-yo-YO, uh!\nSome do clock like neighborhood watch\nJealous of the team that's makin the cream, OOH\n\nHuh, yeah yeah yeah\nI'm the man at the show that the women come see\nStrippers say, \"Fuck it - we all fuck free!\"\nMr. Intangible, can't touch me\nRoll up on you hungry, only one deep\nSlug three fools in the leg and the tummy\nY'all can't take nuttin from me, DUNNY\nSilly-ass niggas like Cole on \"Martin\"\nI go to jail, either get paroled or get pardoned\nSee who the snitch get the fifth then I spark him\nNext time you see him, he on a milk carton\nListen, how we Detroit like the Pistons\nBURIED SIX FEET SOMEWHERE\nI raise my glass in the air, drink about five beers\nCome up with all these ideas, TO SPARK IT\nOpen up a market, rentin out apartments\nGive it to a nigga when he act like he want it\nAny situation, my crew down to solve it\nNine to sixteen ex-convicts\nBetter save comments for bullshit crews that need polish\nThis one here got the phonics, bitch!\n\nSunroof top, built-in stash spot\nChillin on the scene with a gangsta lean, OOH\nYea-yea-yea-yea-YEAH\nY'all can't fuck with Da Bricks, UHH!\nSome do clock like neighborhood watch\nJealous of the team that's makin the cream, OOH\nYea-yea-yea-yea-YEAH\nPace.. WON!", "year": null}]}