{"songs": [{"year": "2004-10-19", "image": "https://images.genius.com/d6fd033db31db720da7b9183bf57cc98.591x591x1.jpg", "title": "If I Fall", "album": "Colton Grundy: Tha Undying", "lyrics": "(Blaze)\nEver since back when I was alive\nI always thought to myself what it would be like to die\nToday I'm more dead than a doornail\nWhether I succeed or fail, only time will tell\nAnd if I ever fall short of the gold\nI'll fall back on a nickel-plated chrome and take everything you own\nI'm a pure-bred hustler, gang-bang affiliated\nI pack a heater bitch, this ain't entertainment\n\n(Chorus)\nIf I fall only time will tell\nAnd if I fall of out of control\nMy pockets is bound to swell\nIf I keep reppin the cheese, will they feel me?\nYou know you know it my nigga\nThat's treal best believe me\n\n(Lavel)\nThe shadow, back up in you like a pap-smear\nNo I'm not a player, wearing sweaters made of cashmere\nWith matching boots\nI came for the loot, I'm riding shotgun and bitch\nI'm prepared to shoot\nDuck low unless you want to get hit with the blast\nI'll blow a motherf**kers hair in and out his baseball hat\nAnd if I catch him hard grinding with some shit that's phat\nI'm gonna lay him on his back, you bitches better believe that\n\n(Chorus)\nIf I fall only time will tell\nAnd if I fall of out of control\nMy pockets is bound to swell\nIf I keep reppin the cheese, will they feel me?\nYou know you know it my nigga\nThat's treal best believe me\n\nFall down, if I fall, get back up again\nI'm gonna get back up again, when will this ride be over\nDid it begin, no more slipping\nYo' I had it up to here, cause I've had enough\nThis shit's all f**ked up\nWhen times get tough you need to pick yourself up, and brush off\n\n(Blaze)\nI'm not afraid to fall, I fell, got up\nKept moving while my body repeatedly got shot up\nI even tried to stand up\nAfter taking a the clip and a half from a bitch-ass rocking a ski mask\nIn a dark alleyway, I was killed on a Sunday night\nBody recovered on a Monday\nNews covered the gunplay\nThe same dude that killed me\nDead body discovered in the subway\n\n(Chorus)\nIf I fall only time will tell\nAnd if I fall of out of control\nMy pockets is bound to swell\nIf I keep reppin the cheese, will they feel me?\nYou know you know it my nigga\nThat's treal best believe me\n\n(Jamie Madrox)\nMadrox and I'm round like the earth\nI done fell so many times, I'm accustomed to all the hurt\nNo work, and no jobs, and people are unemployed\nMost of the people just filling the void\nAnd I'm one of them\nJust because I'm in front of them\nMean I'm ahead of the game\nAnd when you clear away the shit, we basically all the same\nAll going against the grain and hope for some better days\nIn the meantime, we all just trying to mantain\n\n(Chorus)\nIf I fall only time will tell\nAnd if I fall of out of control\nMy pockets is bound to swell\nIf I keep reppin the cheese, will they feel me?\nYou know you know it my nigga\nThat's treal best believe me"}], "artist": "Blaze Ya Dead Homie"}