{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/02e6397ba24dce78293ef731b7c0ed8b.1000x1000x1.jpg", "year": "2018-06-19", "album": "LA Leakers Freestyles", "lyrics": "[Intro, Justin Credible, DJ Sourmilk, YBN Cordae]\nYes, sir\nIt's the L.A. Leakers, man\nThat's right\nPower 106, liftoff show\nJustin Credible, SourmilkWe've been invaded by the DMV, man\nWe had to stay, yeah\nWhat's up man, what we doin'?\nOh, alright bet (ah)\nRight into it, let's get right, this history shit\nRemember this\nClassic moments on liftoff with the L.A. Leakers\n\n[Part 1]\n\n[Verse 1 YBN Cordae]\n(Okay, uh)\nWhy everybody always seem to give me half effort?\nI guess I need more clout, I know I rap better\nI gotta stack cheddar, apply max pressure\nSki mask, black sweater, the daily attire\nIt made me acquire effort, my lazy is fired\nGod damn, why the fuck do I feel so entitled?\nBeef comin', I take the high road, my life spirals\nI'm longevity chasing, you overnight viral\nI fight rivals, and stand taller than five Eiffels\nUsed to trap in the tower, made a stack in an hour\nMoney, immaculate power, is what we all desire\nI got a passion, raw as fire that can fan the flame\nFuck your company name, homie, your brand is lame\nI know the panic came, when I arrived\nSoon controllin' the game, one of the flyest guys\nMama, please dry your eyes, you might decide\nThat your son a king\nA crazy youngin' with a ton of dreams\nI've seen a bunch of things that would make the average man commit suicide\nBut God know I had a plan\nThey sellin' souls, nigga, grab a stand\nAnd for a bargain and a half a xan\nYou can buy the next mumble rapper, who\nHad to humble after the label dropped him and robbed him (Woah)\nGame is the Gotham, my vice is sex\nDodgin' the Feds\nMy foot on the pedal,  my brake in the cycle\nGot the heart of a rebel\nYou see, the way it gotta be\nI stack a lot of cheese\nAnd I keep my mob deep with rap prodigy\nNever say my name, spit flame, who as hot as me?\nBro snatched a chain from a lame, diabolically\nImma be myself, with the wealth, no apologies\nNever fuckin' switch it up, this rap shit ridiculous\nThey can't get rid of us, they tried it all\nEvery power has its rise and fall\nHear my phone, I'll decline the call\nPlease, do not disturb\nGot a presidential flow, I'm Barack with words\nNew age, but they still puttin' rocks in herb\nPray to God, and I know that's gonna block the curse\n'Cause I'm ill, nigga\n\n[Interlude: Justin Credible, DJ Sourmilk, YBN Cordae]\nOkay!\nHold up, hold up\nLet's keep going, let's keep going\nKeep goin? Yeah, what's next, nigga, what's good?\nYBN Cordae is here\nYeah, I'm here to stay for a while\nWith the L.A. Leakers\nOoh! Ooh! Came with diversity\nThe Los Angeles Leakers\nLet's switch it up a little bit, let's switch it up a little bit\nLet's show them how we do this\nThey tried to throw me off\nOnly real MCs can come on L.A. Leakers show\nThey tried to throw me off, okay\nYBN Cordae\nLet's get it\n\n[Part 2]\n\n[Verse 2: YBN Cordae]\nI need a new Bugatti for the few who got me\nKillin' beats is a ruthless hobby\nYou say your shooters caught me, never do what's floppy\nDrop a kid like they do karate\nI'll be the first, never lied in rap\nI am a great, no denying that\nI spit the high on the fire tracks\nI cannot wait to blow up, when they say he acquire racks\nI switch the style, and I make it easy\nI changed my friend, because they was greedy\nI'm makin' money, they pay to meet me\nI give a fuck if a hater's scheming\nI gotta grind and make every dollar\nMy money stronger than Larry Lobster\nI work that magic, that Harry Potter\nYou niggas scared I'll bury ya, ayy\nAll my niggas rich, essketit (huh)\nJust dropped a bag at Lenox, (huh)\nNew black whip, all tinted (huh)\nNew black whip, no renting (ayy)\nKill the freestyle on the Leakers, (huh)\nUsed to get head from the teachers, (ayy)\nSmokin' that gas, no reefer (ayy)\nShit loud like the speakers (ayy)\nLook, mama proud like Penny\nCracked the code, no DaVinci, (ayy)\nLook, all my niggas wear Givenchy\nChoker on me, no lynching (ayy)\nLook, plenty ya bitches is fine\nWhen ya cash out on designer (ayy)\nLook, I need a bitch like Madonna\nWe'll take a trip out to China (ayy)\n\n[Interlude: Justin Credible, DJ Sourmilk, YBN Cordae]\nThe Los Angeles Leakers\nYBN Cordae\nLet's keep it goin', man!\nHe flexin' on ya'll right now, MCs\nLet's keep it goin', it's the L.A. Leakers, man!\nAin't no cell phones in sight, this real hip hop shit!\nWoo, alright, alright\nLet's get it, no\nAnd he said no cell phones\nWe gotta end it with a bang, man!\nYBN Cordae! History shit!\nThe Los Angeles Leakers\nDamn, this shit drop hard!\nIt's classic, still slaps!\n\n[Part 3]\n\n[Verse 3: YBN Cordae]\nAlright\nCheck it out, listen (uh)\nBlessed with a mind to help me shine to the throne\nDidn't have any support, I had to grind on my own\nAnd where I'm from, you get sprayed like the finest cologne\nSo if they shoot, you better duck, unless you dyin' alone\nConsider yourself lucky if you listen to this\nI told you I was the greatest, I predicted this shit\nIt's funny 'cause the same girl suckin' and lickin' the dick\nWill go home and just start huggin' and kissin' the kids\nAnd they always back for more, why they bother us?\nI told you I'll call back, as soon as your father does\nAnd when he doesn't, I know it build up a lot of lust\nYou do it all to make him proud, but that's still not enough\nBut fuck it, that's just the art of intimidation\nSee, fuck the judge and the litigation\nAnd why these niggas hatin', 'cause I be fowin' like irrigation\nThey fear the nation\nHad to rush and drop the tape, because the meal was patient\nNo pun intended, I'm at the doctors, I'm ill as fuck\nI'm healin' up, they not feelin you, you not real enough\nAnd to be honest dog, ya really suck\nFind another hobby, ASAP\nPlease give it up\nPlease, nigga\nY'all niggas suck, like shit man\nI ain't fuckin' with the rap niggas, yo\n\n[Outro: Justin Credible, DJ Sourmilk, YBN Cordae]\nYou at the doctor, you ill?\nYeah! Hahaha!\nYBN Cordae\nSee how we doin' it with the L.A. Leakers, man!\nClassic material, L.A. Leakers' liftoff show\nJustin Credible, Sourmilk\nPower 106 is #1 for hip hop", "title": "YBN Cordae Freestyle | LA Leakers Freestyle #045"}]}