{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "We Violent", "year": "2003-06-24", "album": "The Entity", "lyrics": "I am a phenomenon...\n\n[Verse 1]\nDon't get it twisted for a minute\nLike I won't enter your skin and\nCreate havoc all through your respiratory system, now you asthmatic\nSad and tragic, but through the madness I laugh at it\nI start to unravel like gum wrappers. Stab 'em with thumbtacks\nAttackin all you wack bubble gum rappers\nI am not human\nI can get rushed and socked by thirty-two men and I am not movin\nConfusin you with this new shit, I will influence what you spit\nI'm choosin all of this music, you're stupid. Your musics useless\nY'all ain't stoppin my verse\nHope you got faith, you're locked in a church\nIt ain't safe to walk through this Earth\nThere's a man with two horns in his head - he's quite sickening\nThey're saying he was born from the dead - Gothic description\nOn stage chokin himself to he's dyin\nGot a million of my fans screaming loud WE VIOLENT!\n\n[Hook]\nY'all don't wanna get in this mosh pit WE VIOLENT!\nY'all don't want my fighters to start shit WE VIOLENT!\nStage grabbin the crowd\nGet crazy and wild\nGot a million of players screaming loud WE VIOLENT!\nY'all don't wanna get in this mosh pit WE VIOLENT!\nY'all don't want my fighters to start shit WE VIOLENT!\nStage grabbin the crowd\nGet crazy and wild\nGot a million of players screaming loud WE VIOLENT!\n\n[Verse 2]\nEverybody in the house tonight (uh huh)\nTurn to the person next to you (ok)\nNow soon as this motherfucking beat drops (WHAT!?)\nBalls your fists up, you know what to do\nSwing on him, kick him and punch him\nHit him in the stomach till he shit out his lunch and\nHis pupils is dialatin. His balls, they vibratin\nThe crown rushin the stage, I love it\nThis is the same shit and I made it\nI get off on chaos, I'm sniffin up napalm\nGo on stage at a rage, half of my face ate off\nPut eighteen holes in your chest like the game golf\nI spit crazy pores from the head, I am way off\nThey callin me hell's spawn. A terror never capture America terrified\nThey sayin I shouldn'ta left it\nNow I'm in the industry, smokin weed wilin\nGot a million of my fans screaming loud WE VIOLENT!\n\n[Hook]\nY'all don't wanna get in this mosh pit WE VIOLENT!\nY'all don't want my fighters to start shit WE VIOLENT!\nStage grabbin the crowd\nGet crazy and wild\nGot a million of players screaming loud WE VIOLENT!\nY'all don't wanna get in this mosh pit WE VIOLENT!\nY'all don't want my fighters to start shit WE VIOLENT!\nStage grabbin the crowd\nGet crazy and wild\nGot a million of players screaming loud WE VIOLENT!\n\n[Verse 3]\nLight of a God, heart of a soldier, blood of a king\nLightning rod, shockin your shoulders buckle your knees\nVarious fight techniques. You watchin the right, then the left'll swing\nTake your best swing, now meet the seven piece\nRumble in the jungle, ballin knuckles\nThrowin punches at him till he stumbles\nDrips of blood become in bundles\nI like fight songs that make y'all violent\nLike them girls in them thongs that be sayin \"he wilin\"\nDon't grab the mag if this man touch you\nMike Tyson his ass if his man punch you\nAnd bite off his ear is he head-butts you\nWhere my Fat Killahz at?\nIf you beefin we eatin, know where he livin at\nKick him and beat him and leave in his kitchen smacked\nThis is for all my crazy fans that like to woop some ass\nDrinkin on that Jackie Dan cause it's gets them mad\nI can't believe, it I think I'm dreamin\nI got a million motherfuckers screamin\n\n[Hook]\nY'all don't wanna get in this mosh pit WE VIOLENT!\nY'all don't want my fighters to start shit WE VIOLENT!\nStage grabbin the crowd\nGet crazy and wild\nGot a million of players screaming loud WE VIOLENT!\nY'all don't wanna get in this mosh pit WE VIOLENT!\nY'all don't want my fighters to start shit WE VIOLENT!\nStage grabbin the crowd\nGet crazy and wild\nGot a million of players screaming loud WE VIOLENT!\n\nWE VIOLENT! WE VIOLENT! WE VIOLENT! WE VIOLENT! WE VIOLENT! WE\nVIOLENT! WE VIOLENT! WE VIOLENT! WE VIOLENT! WE VIOLENT! WE VIOLENT! WE\nVIOLENT! WE VIOLENT! WE VIOLENT! WE VIOLENT!"}]}