{"songs": [{"year": null, "title": "Gotta Believe It", "image": "https://images.genius.com/ba2ca8f14b0677073955b40f4f7a416f.1000x1000x1.jpg", "lyrics": "[Hook: Just Blaze] + (Saigon)\nWhoa-ohh, we keep risin to the top\nWhoa-ohh, and keep eyes out for the cops\nWhoa-OHH! And that's what it's gon' be\nWhoa-OHH! Cause you ain't gon' stop me\nThey got you workin two jobs tryin to make ends meet\nYou just tryin to keep yo' kids off the street\nYou gotta believe it (best believe if you dream it)\nOh, you better believe it (you too can achieve it)\nUh-oh, they got you locked in a hole, 19 years old\nTen years, no chance for parole\nYou better believe it (that's right, tell 'em again)\nOh, you gotta believe it (after that, tell a friend)\nOhhh-ohhh\n\n[Verse 1: Saigon]\nAfter the sunshine come the rain, after the fun time come the pain\nI often wonder if it's gonna change\nI caught a bad case of Smack-a-Bitchy-Itis (what happened?)\nI came home, my wife got my daughter in shitty diapers (damn)\nThe rice is still raw, and the meat is still frozen in the freezer\nI hate that I'm too close to her to leave her\nEither I hit the street to do some pitchin, knowin these dudes is snitchin\nOr die tryin to make it as a musician\nMy livin condition is not in the greatest position (nope)\nAnd nah I ain't bitchin, I just gotta make a decision\nShould I breeze past, hop out in a ski mask\nRob everything movin and cruise in a G-Class (vroom!)\nBut keep writin the heat that the street like it\nYoung'uns is recitin my lyrics, so keep bitin\nY'all niggas thinkin shit is easy, it's hard\nOne thing I know I'mma do is keep believin, keep believin in God\n\n[Hook]\n\n[Verse 2: Saigon]\nAfter the fast songs come the slow, after the sad songs come some mo' (mo')\nThis is the life I have come to know\nPolice is in Marquis', Chevy Caprices stroll\nThe young hood boogers idolize Keyshia Cole\nThe rap figures throwin money in the air like it's pizza dough\nPeople in the hood ain't eatin though (though)\nI tried to help the labels see the vision\nBut they lowered me to a subdivision, you gotta be fuckin kiddin\nThey'd rather me pretend to be somethin I'm not\nI'm the new Public Enemy, I'm different than Yung Joc\nAnd nah, I ain't dissin, this nigga's up in the Forbes\nShit I ain't made a dollar tryin to rap for the cause\nBut in these next four bars, I'll tell you about maleviolent laws\nThey enforcin on North American shores\nDawg, if they could have rifles on their farms\nThen I don't see why they knocked T.I. for tryin to bear arms\n\n[Hook]\n\n[Verse 3: Saigon]\nTell 'em wave at the artist, I feel like I'll make it regardless\nDon't forget I'm the ex-con that made it the farthest (yup)\nUntil the day that I lay with the martyrs\nOr until the day I'm parlayin, playin with my sons and my daughters (uh)\nI'mma remain the smartest, hardest workin nigga in the business\nJust Blaze, can I get a witness? {YESSIR!}\nSee that they probably get it if I come out and flop\nGet dropped, go back to my block and get shot (pop)\nAs they puttin my body in that life-size Ziplock\nThen you'll be sayin \"Damn, Giddy died for this hip-hop\"\nOr maybe it'll tell you to get locked\nTo another 20 in the rock for them to give me my props\nWhatever the case may be\nYou do a census on who is the sickest lyricist, they say me\nAnd that's without a album out, y'all rated me\nI drop one and I'mma bow out gracefully\n\n[Hook]\n\n[Outro: Just Blaze]\nKeep keep keep rising, whoa-ohh\nKeep keep keep rising, whoa-OHH!\nKeep keep keep rising, whoa-OHH!\nKeep keep keep rising, whoa-ohh\nWhoo! We on the radio (we on the radio!)\nYo turn up the radio! (we on the radio)\nYo we got one, now we got the game on lock!\n{*radio changing stations*}\nTurn it up! C'monnnnn\nWe got on the radio", "album": "Warning Shots 2"}], "artist": "Saigon"}