{"artist": "Astronautalis", "songs": [{"title": "Fourth Of July (Feat. Radicalface)", "image": "https://images.genius.com/6d6417ddb03147c661bdcad9af2745ae.533x800x1.jpg", "album": null, "lyrics": "Three hundred butterflies they wrapped them in her ribs\nAnd now she cuts across the interstate the world will choke on traffic\nMe and cannonballs looking at the moon\nWho\u0092s peeking over the edge like no good kids with water balloons\nI wanna swallow the wind let it hollow me thin and\nCall a friend who\u0092s laughing like a, laughing like a criminal\nShe watches fireworks, launching and sparkling, spinning\nAnd twenty kids live like giants making yearbook material\n(Step by step by misstep oops I found myself in someone else\u0092s shoes) 4X\nNothing more heartbreaking than a car that\u0092s been stationed since\u0085 well long enough to let the grass grow up around its feet, 2X\nLater I\u0092ll kiss the smile off your face and toss this shape into the Rio Grande\nI could follow it along the riverbank to reach the beach\nAnd we could roll around in the sand\nI wanna break the bank and crush the glasses, chase the tape, combat molasses\nFace to face I punch the mattress: awake escape and trace the atlas\nThey case the place and ban the back flips. Leave the flashes to the books of matches\nToday\u0092s the day, today\u0092s the day they catch us; today\u0092s the day, today\u0092s the day we turn it backwards;\nToday is the day amazing things happen\nPass the buck, I\u0092ve got a head full of handshakes. Dig a little deeper \u0091til the hole runs dry as the light from the television flickers on the table and the angel on my shoulder rubs the sleep from his eyes. 4X\n(Nothing more heartbreaking than a car that\u0092s been stationed since\u0085 well long enough to let the grass grow up around its feet. 4X)\n(We\u0092re looking in, I\u0092d never lie, that face is pressed against the glass and now you\u0092ve turned to grey.)\nI wanna Jump a million miles and look back at the lights, I wanna run so fast they get left behind 4X\nTeeth bared broken noses twisted fingers swollen toes and I could do with another drink, I could do with another drink 2X\n(I wanna Jump a million miles and look back at the lights, I wanna run so fast they get left behind 16X)\nNothing more heartbreaking than a car that\u0092s been stationed since\u0085 well long enough to, long enough to let the grass grow up around its feet. 4X", "year": null}]}