{"artist": "50 Cent", "songs": [{"album": "Bulletproof (Soundtrack)", "image": "https://images.genius.com/a67b37e2a3aaa0ddad59cdae813b6aa8.500x500x1.jpg", "title": "I Run NY", "lyrics": "[Chorus: 50 Cent]\nThe walls have ears lil' nigga, I run New York\nEven when I ain't there lil' nigga, I run New York\nI said the walls have ears lil' nigga, I hear when you talk\nLet's get this shit clear lil' nigga, I run New York\n\n[Verse 1: 50 Cent]\nI wake up, stare at the ceilin'\nI'm alive, what a beautiful feelin'\nI put my vest on right after I put on my drawers\nIt's a habit I'm always prepared for war\nSee my life's like some shit, you seen in a flick\nBitches act like pornstars when they sit on a dick\nWhen I was hit and out the game I said \"one more flick\"\nTest my aim in the range I'm like \"one more clip\"\nIt's my brain, I'm insane, I be on some shit\nMan I run Interscope, Jada's tryna annoy me\nNuthin' but another disgruntled employee\nHe been in the game ten years and he still ain't rich\nEven his mama upset that he still ain't shit\nAnd he keep runnin his yap, like I'ma take all that\nOne more word out his mouth I'll push Style's shit back\nSee the nozzle on my tre pound is three inches long\nAnd the trigger on the fo' fo's extremly strong\nWith a little tre douche is like pop, pop\nChase his ass up the block til his bitch ass drop\nAnd the verses he be kickin' none of 'em hot\nCos he ain't got none of that shit he says he got\nAnd he ain't did none of that shit he said he did\nAnd I ain't got time to be talkin 'bout this shit, (fuckin' faggot)\n\n[Chorus - 50 Cent]\nI guess it's easy to see lil' nigga, I run New York\nYeah I live in CT lil' nigga, but I run New York\nAnd I don't go to parties lil' nigga, but I run New York\nAnd I stay gettin cheese lil' nigga, cos I run New York\n(Yayo, tell 'em I run New York)\n\n[Verse 2: Tony Yayo]\nMy gun is longer than yours, nigga, call your recouster\nLOX made more money than them thin tiny suits\nThe game around south, drugs and rappin\nJada fuckin punchlines, my serp went platinum\nStyle's and Sheek Louch went double plastic\nYayo, Buck and Banks was puttin out classics\nA hundred shots, a hundred clips, y'all ready to die\nFat Joe ain't a gangsta, he scared to fly\nAutomatic mossberg, who want a piece of this punk\nI had Ja Rule buryed in some high heel punk\nFeds stuck in a bullet-proof, man fuck that\nHomie, shoot up my whip, you only leave a scratch\nYo, I slip cocaine, in your hotel lobby\nAnd beat you wit my pistol like Caine did Chauncey\nIt's T.O.N.Y.Y.A.Y.O.,\nMy whole clique, gotto,my Os on the fly hole\nC4s, we fly on linz\nAnd my rocks lookin like, Flex likes yo' benz\n\n[Chorus - 50 Cent]\nWhen I'm down in DC lil' nigga, I tell 'em, I run New York\nWhen I'm out in Philly lil' homie, I run New York\nWhen I'm in VA I tell niggas guess what, I run New York\nI'm in NC niggas holla at the moon, cos I run New York\n(Yayo tell 'em I run New York)\n\n[Outro: 50 Cent]\nNow who the fuck told that lil' nigga he can talk to me like that? Catch my bottle up and roll him somewhere, [laughing] D.Y. wanna talk to me, wanna tell\nMe what's goin on. Want me to serve him somethin' for real, cos I'll serve, murder [laughing] eh, eh get Puffy on the phone, tell him I said, tell the\nNigga I said get out the mil for a second let me talk to him. Puffy da only nigga a muthafucka pops, tell him I won't buy the nigga Jadakiss pokes. Nigga\nStill ain't a coupe. Ah, nigga, you in da way. You owe money nigga, aw man, now why you make me put yo' business in da street. Now niggas know you ain't\nShit, damn! I see yo' punk ass in da paper, cos you ain't returnin them jewels you borrowed, you better give 'em back, you dirty nigga. Ain't none of that\nShit you be wearin yours. [laughing] We coulda kept this secret, nigga. These niggas I'm supposed to beef wit. Aw man, this fight is fixed, you been set\nUp, [laughing] that's what he gonna say, \"they set me up, man.\" I ain't even go through that", "year": "2007-07-23"}]}