{"artist": "Fabolous", "songs": [{"year": null, "album": "Street Dreams", "image": "https://images.genius.com/4b857fc26420a638d0085145c7bcd7f3.1000x1000x1.jpg", "lyrics": "Ha ha ha ha ha\nSee ma, I think you took it\nI think you took it wrong like\nYou got it misunderstood or something\nYou got it confused\n\nI'm thinking about the one night we have spent together\n(I mean, when was this ma?)\nThat I'd cherish the love I thought would last forever\n(I never said that, I never said forever)\nCall meee (Na, I don't do this. You already knew this, ma we been thru this)\nCall meee (Na, I can't do that, once I done blew that. Ma, we been thru that)\n\nGirl, that was a one night fling\nYou was turned on by the moonshine and the sunlight bling\nYou kept licking your tongue at me, knowing how quick that this young'n be\nTo pull out his dick from his dungarees\nBesides, we had enough liquor and jungle trees\nThat both of us woulda got sick or had lung disease\nI remember every gesture made (ooh)\nDuring the escapade (ooh)\nIn the back of the Escalade (whoa)\nWhen it come to tricks, I have some up my sleeve (uh huh)\nBut Shorty dived in head first and didn't come up to breathe (shit)\nI usually don't get to rag em (uh)\nBut it's so real, I made the caddy chauffer hop out and get the magnums (uhhhh)\nWe getting close the Parker Meridian (uh huh)\nShe pulling her skirt down (uh huh)\nAnd tucking her titties in (uh huh)\nI'm walking this biddy in (uh huh)\nCaressing her pretty skin\nShe said \"I love the video that you and P. Diddy in\" (yeah right)\n\nI'm thinking about the one night we have spent together\nThat I'd cherish the love I thought would last forever\nCall meee (Na, I don't do this. You already knew this, Ma we been thru this)\nCall meee (Na, I can't do that, once I done blew that. Ma we been thru that)\n\nThis girl hobby was to slob me down (uh)\nGot me walking wobbly thru the lobby lounge (ohh)\nIn the pent house blasting Mobb Deep and some Bobby Brown (uh huh)\nDo not disturb sign probably woulda not be found (yeah)\nIf theres one thing I'm giving her, it gotta be back shots (uh)\nShe screaming like she just won the lottery jack pot (ahhh) (uh)\nAt the same time she jerking and wiggling (uh huh)\nSmirking and giggling (ha ha ha)\nCuz I'm like Dirk when I'm digging in (uh)\nThe way she working and figuring\nShe must have be a gymnast\nCuz the positions wasn't hurting her ligaments\nMa I know you got centerfold measurement features (uh huh)\nBut after a nut, it was a pleasure to meet ya (uh huh)\nGet ya under and outta wear (uh)\nYou ain't gotta go home, but you gotta get outta here\nSo write your number on this paper (uh)\nI might wanna scrape ya (uh)\nNext year when I go on TOUR\n\nI'm thinking about the one night we have spent together\nThat I'd cherish the love I thought would last forever\nCall meee (Na, I don't do this. You already knew this, ma we been thru this)\nCall meee (Na, I can't do that, once I done blew that)\n\nNow I ain't seen Shorty since the spot last summer\nAnd she still calling and paging (what the fuck)\nI don't even know how she got my numbers (damn)\nBut I been hiding (uh huh)\nCuz, this girl looking for the kid like Bush was searching for Bin Laden (damn)\nBefore I didn't care if she where I be (ut uh)\nBut now I mean it be scaring me (uh huh)\nTo get year of free therapy (uh huh)\nShe said her heart broken; it caused her to start smoking (uhhh)\nAnd the hours of deep thinking, making her keep drinking (uhhh)\nSince Hiedi started stalking me (uh huh)\nI hadda get body guards to walk with me (yeah)\nIf you wanna get Fabolous, that's on you, that's on you (okay)\nLong as you know they at on you (I said okay)\nI'm looking at her ways and reactions (uh)\nHoping that this don't turn into a fatal attraction (ut uh)\nShe screaming \"fabolous give me one more chance\nFabolous give me one more chance\" PLEASE?!\n\nI'm thinking about the one night we have spent together\n(I mean, when was this ma?)\nThat I'd cherish the love I thought would last forever\n(I never said that, I never said forever)\nCall meee (Na, I don't do this. You already knew this, ma we been thru this)\nCall meee (Na, I can't do that, once I done blew that. Ma we been thru that)", "title": "Call Me"}]}