{"artist": "Canibus", "songs": [{"title": "Bis vs. Rip", "album": "Mic Club: The Curriculum", "year": "2002-11-19", "image": "https://images.genius.com/b9fe759f8aa3195631fd3906b4b1ed0a.1000x1000x1.jpg", "lyrics": "[Intro: sample]\nThe Ripper, *echoes*\nDear Boss\nI keep on hearing the police have caught me but they won't fix me just yet. I have laughed when they look so clever and talk about being on the right track....\n\n[Rip]\nYo, you fucking hate me, you fucking lock me in the basement\nAnd you still want me to protect you, it doesn't make sense\nCan-I-Bitch, I supported you like a weight bench\nWithout me you're defenceless you better face it\nYou ain't show me love when you was at your apex\nGetting paychecks up at the radio with DMX and Flex\nCatching wreck while Noreaga was catching his breath\nI had to keep the situation in check\nLook at the varicose veins in my neck, Germaine is the best\nThe industry fucked you, I'm just paying 'em back\nWhat's the matter with slaying jackers? That's all I've been doing\nBesides talking shit I ain't done nothing to 'em\nThey just mad cause when I see 'em I don't run up to 'em\nBetween me and you, yo you know I run right through 'em\n\n[Bis]\nCalm down\n\n[Rip]\nWho you telling to calm down nigga, I'm a ripper remember?\nI told you not to do \"Gone Til November.\"\nBut you wouldn't listen. I always had your best interests in mind\nI wrote all your best lyrical lines\nIf it wasn't for me you'd be writing pitiful lines\nOn stage if you was tired, I was spitting sometimes\nNobody knew you bit off my rhymes\nI would just be quiet, stand to the side and let that shit ride\nBut I'm getting tired of having to remind you Bis\nIf it wasn't for me nobody would've signed you Bis\n\n[Bis]\nWhat Rip?! Why you tripping, you know it's a crazy business\nYou a lying ass bitch and you know it\nGroup Home was part my company, I co-owned it\nIf its one thing I learned in show biz\nStay focused and don't quit Rip\nWhy you talking 'bout old shit?\n\n[Rip]\nGermaine, you fucking water brain\nDon't you understand, fuck the mainstream\nYou should just call out names\nThe industry's all about game I shit on 'em all the same and I leave spit stains on their brain\nLike liquid chocolate spilling over their new white trainers\nInsane is an understatement, I'm Satan\nCanibus is a Mason, I don't know what the fuck Germaine is\nI just know that both of y'all are trying my patience\nI don't give a fuck about a beat, I've been rhyming for ages\nRippers are dangerous, all jackers are afraid of us\nYou wanna face me Bis? Kick a rhyme!\n(That's ridiculous), aight then, listen to mine\nI jump in a costume impromptu just to rob you\nPut the nozzle to your eye ball and tell you what not to do\nRip your tonsils out through your nostrils\nBury you next to shark fossils, make it impossible to find you\nDepths that Jacques Cousteau himself wouldn't dare to dive to\nWith goggles, oxygen bottles and Doppler effect modules\nLock you in a time capsule, smash the console\nShit on you in reverse and suck you in a brown hole\nSuck the power out of your soul\nYou're nothing but a coward in the cold freezer with a hour to go\nWatching my Casio stop watch, counting it slow\nLike drug lords checking to see if it's talcum or coke\nI can kill you by drowning the globe\nOr I can just spit inside of a hole and put an ounce in your throat\nIn battles I'm a thousand & 0, I silenced the Pope\nDo you know how many rhymes I've economically grossed?\nNo? I thought so, neither do I\nIts a dick between your mother's thighs divided by pi\nI'm the sickest linguistically, illicit lyrical misfit, in the business\nAnd probably in existence. What's your consensus?\nStudy my own syntax statistics since '96 with CPA certified assistance\nI made a decision that my standards are above precision\nThe only thing I can honestly say I love more than women are dope writtens\nIf it ain't dope then don't spit it\nDon't be sensitive and get on the defensive, just practice your penmanship\nIf you can't spit at high temperatures then just quit\nBe careful of the tongue it tends to bend to the left\nAccording to manufacture's specs you'll make a mess\nAnd rupture the blood vessels in your neck fucking with Rip\nGot millions of blueprints on zip disk\nStock versions of sick verses that come with conversion kits\nWith a course every Thursday that teaches you how to burst like Rip\nYou never experienced work like this, Bitch!\nWelcome to the serpentine world where I spit\nThe world where I twist, the world that I rip, the world where I live\n\n[Bis]\nOkay Rip you made your point, I can't out-rap you\nYou said you was the illest, I would never doubt that too\nA lot of these rappers is jealous that's why they attack you\nThey think you the best, that's why they wanna battle you\nAt the moment of truth I let you design the tattoos\nYou are the illest alive, that's a fact that you proved\nJust a couple rappers don't want it to happen for you\nRagging on you like battling is all you can do\nYou didn't sell enough units to be honest with you\nNobody knows the truth, you got talent out the gazoo\nWhen niggas first heard you it was like \"Man on the Moon\"\nYou got dissed by a legend but you damaged him too\nSo what if the ladies think he's more handsome than you\nWhat happens if the rumours about being a faggot are true?\nLook what it's running into\nI don't feel like having this discussion with you, I'm tired of fucking with you\nNiggas in the game don't wanna do nothing with you\nBussing with you, going one on one with who?\nThey wanna get rid of you. Shit is too lyrical\nHeadhunters out to get you. That's why I had to protect you\nI wouldn't disrespect you as another intellectual\nWithout you I'm unsuccessful, God bless you\nWhat makes you think I left you or why I'd ever be tempted to?\nEver since my third album I've been mentioning you\nI got your name on my arm, I'm representing you\nYou Rip the Jacker. I would never question you\nI respect your opinion as a professional nigga\nI just want you to listen to what I'm telling you\nWhat happened between L and you, forget it\nPeople know you won the battle, they won't give you the credit\nA lot of people don't want to admit it\nBut I consider it a real privilege to bear witness to your lyrics\nAnd be involved in sharing the merits, I'm forever indebted\nI just need you to chill for a second\nSo I can send a positive message like 2Pac before he left us\nThe author of the work ethic Genesis\nHas inspired me to write the ExeBis scripts as a constant reminder not to forget Bis\nBut I've reached a precipice, remember Rip\nYou can't rhyme forever, there's always somebody with better shit\nI keep you out the public eye for a reason\nYou're a commodity Rip, ain't that how you wanna keep it?\nI keep your whereabouts secret\nI bring bitches to the crib every weekend so why is you beefing?\n\n[Rip]\nAiyo, stop patronizing me, you despise me\nAll you wanna do is steal rhymes from me\nYou constantly keep me behind walls of concrete\nLock me in the basement like a fucking zombie\nIf I was a priority, you'd acknowledge me\nYou ain't shit neither, you ain't got no college degree\nYou can't rhyme without me, stop smiling at me\nGive me the keys to the garage, I need to borrow the Jeep\nGet the fuck out my face, Bis"}]}