{"artist": "R. Kelly", "songs": [{"album": "Chocolate Factory", "year": "2003-02-18", "lyrics": "[Hook: sample] + (R. Kelly)\nSaid I'm sorry for everything that I ever done to you\nYeah\n(The apologies of a thug)\nSaid I'm sorry for all the pain that I ever brung to you\nBaby\n\n[Verse 1]\nI'm sorry for all the times that I hurt you\nLied, cheated on you\nLeft, committed every crime except for murder (oh)\nBut you still didn't judge me\nIn fact you found a way to love me (yes)\nSometimes I really messed up and you still found a way to hug me\n(yes you did, lord)\nLayin your hands on me, cryin, callin out to God (oh my)\nI want up out these streets but ma, it's so hard (oh yes it is)\nI'm so scarred, my monster is so large\nIf it wasn't bad luck, it'd be no luck for R. (no luck for R.)\nAnd I'm sorry baby, for bein so connivin (yeah)\nCursin you out, arguin in public, drinkin, drunk drivin (mmm)\nGirl I need you to believe that I... can make it better (make it better)\nI'm in the belly of the beast\nBut still believe in a change of weather (change of weather)\n\n[Hook: sample] + (R. Kelly)\nSaid I'm sorry for everything that I ever done to you (ohh, I'm sorry)\n(The apologies of a thug)\nSaid I'm sorry for all the pain that I ever brung to you (oh yeah, babe)\nSaid I'm sorry for everything that I ever done to you\n(said I'm so, so, so sorry)\n(The apologies of a thug)\nSaid I'm sorry for all the pain that I ever brung to you (ohh yeah, mmm)\n\n[Verse 2]\nI'm sorry baby for stormin out of the house\nGivin you them lame excuses just to get, out of the house (mmm-mmm-mmm)\nAnd I apologise for all of those times that I made you cry (yeah)\nLike when you busted me up North\nWith that girl and still took me back (oh yeah)\nI could never forget that, all the pain and drama I caused you\nJust never forget that every day\nAnd night I used to cll you (call you, yeah)\nWe were best friends, we put our chips all in (ohh)\nWe bet we'd never be separated by no men (no men)\nWhat I feel, you feel, what I go through, you go through (you go through)\nThat's why I have no right to hurt you (hurt you)\nAnd even when I was goin through all that bullshit in the media (mmm)\nGirl it was you who made it easier\nWhich is why I write this piece to ya (ohh)\n\n[Hook: sample] + (R. Kelly)\nSaid I'm sorry for everything that I ever done to you\n(said I'm so sorry baby)\n(The apologies of a thug)\nSaid I'm sorry for all the pain that I ever brung to you (oh yeah, yeah)\nSaid I'm sorry for everything that I ever done to you (so, so, so sorry)\n(The apologies of a thug)\nSaid I'm sorry for all the pain that I ever brung to you\n(ohh, to you, I'm sorry)\n\n[Verse 3]\nNow I'm sorry for all of the times that I didn't take you out (mmm)\nWalk the park, holdin hands or family cook outs (ohh)\nWe were headed same direction 'til I chose my own route (yeah)\nWhen knowin my life's a dead end without ya, no doubt (mmm-hmm)\nI wanna be that man inside for you that's so great (oh yeah)\nNow I may not go to church every Sunday but I always pray (ohh-ohh)\nCause in the midst of this fame my life is like a buffet (yeah)\nQuick to drink, quick to smoke, quick to fornicate\n(quick to fornicate, ooh)\nBut you done been beside me just like my shadow (ooh)\nPlayin warriors standin on the front line ready to fight battles (ooh)\nI cannot ask for more in a woman (oh-oh)\nWhat I need to do is pour back into my woman from now on (oh girl)\nI'm sorry\n\n[Hook: sample] + (R. Kelly)\nSaid I'm sorry for everything (ohh, sorry) that I ever done to you\n(all the things I've done to you)\n(The apologies of a thug)\nSaid I'm sorry for all the pain (oh yeah) that I ever brung to you\n(all of the pain I've caused you)\nSaid I'm sorry for everything that I ever done to you\n(whoa, I'm sorry, I'm sorry, I'm sorry)\n(The apologies of a thug)\nSaid I'm sorry for all the pain (yes I am) that I ever brung to you\n(brung to you)\n\nBaby I apologise\nNever meant to make you cry\nCan you find it in your heart\nSomewhere girl to take me back?\n\n[Hook: sample] + (R. Kelly)\nSaid I'm sorry for everything (oh yeah) that I ever done to you\n(said I'm sorry)\n(The apologies of a thug)\nSaid I'm sorry for all the pain (mmm) that I ever brung to you\n(that I ever brung to you)\nSaid I'm sorry for everything that I ever done to you (I'm sorry)\n(The apologies of a thug)\nSaid I'm sorry for all the pain (baby) that I ever brung to you\n(I ever brung to you, yeah)\n\nSaid I'm sorry for everything that I ever done to you\n(said I'll never hurt you again)\n(The apologies of a thug)\nSaid I'm sorry for all the pain (oh) that I ever brung to you\n(oh you just let me back in...)\nSaid I'm sorry for everything that I ever done to you\n(I'll never ever break your heart oh)\n(The apologies of a thug)\nSaid I'm sorry for all the pain that I ever brung to you\n(I'll never, never ever break your heart oh)\n\nSaid I'm sorry for everything that I ever done to you\n(said I'll never never, never, never, never, never, never, never\nNever, never ever break your heart)\n(The apologies of a thug)\nSaid I'm sorry for all the pain that I ever brung to you...", "title": "Apologies of a Thug", "image": "https://images.genius.com/c23c7ad166aff9317b7dbbc35ffe83db.1000x1000x1.jpg"}]}