{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/2435f727d48cd3047e7ebf62372980b1.500x500x1.jpg", "title": "4 Tomorrow", "year": "2008-05-20", "album": "Behind the Stained Glass", "lyrics": "(Hook) Priest\n4 Tomorrow\n4 Tomorrow\n4 Tomorrow\n4 Tomorrow\n\n[Killah Priest]\nThe cargo ships rocked in ocean tides\nTheir freedom watched from the open skies\nCried for his chosen tribe\nThe great Amistad wave goodbye\nYou'll never see her again\nCurrents of strong wind\nTook niggas on the long ride\nNaked have I came, naked shall I leave?\nThis hell I see, I've written it in my form\nSo if my time calls you can press play like it's yesterday\nIt's been a decade since the best say (Heavy Mental)\nY'all hear 'em again, my serum's the pen\nIf death follows, so lie for now\nThe apostle, grace be unto you\nTill the coming of shallow, I wrote this...\n\n(Hook) Priest\n\n[Killah Priest]\nWhat's sufficient for the ears?\nRedemption is near\nThe hope of Christian, religion is listen but fear\nThis desire put us back in bondage\nTo weak and begging elements\nLiving devilish in our conscious\nWe became monsters\nCause all we want is the chronic and some liquors\nAnd tat on some scriptures and I miss my sister\nPictures haunts my mind, it turns realer\nLook inside my memories mirror\nHeron had her in sedation, till she became an AIDS patient\nHer last days she laid shaking\nI stood by her grave waiting\nFor the preacher to finish his sentence\nI dropped the rose in the hole then I left repented\nIt took part of my soul; turned my soft heart into stone\nWhen I strike my chest it hurts my hand\nIs our freedom even worth the plan?\nThe dope merchant glance\nThen look back at the fiend like \"you heard the man\"\nWho wanna take a stand? Hopes are hollow\nThe adolescent hand chokes a bottle\nNo role models, wherever the streets leads ye shall follow\n\n(Hook) Priest\n\n(Priest talking over the hook)\nI see the future\nThis for the future man\nHa-ha, I want the future to hear me\nI want everybody to realize\nThat when I sat and I wrote this\nThis was for...\n\n[Killah Priest]\nHe quickened my heart after foolish women ripped it apart\nSwimming in a dark sea that was living with sharks\nThe last enemy to destroy his death, what's next?\nGiven the power, all things wicked will end in an hour\nThe corruptible, must put on end corruption\nAll this and his destructions\nGod to men discussions, he looks at us in disgusting\nSky erupting when my pen is touching\nDeliverance from this ignorance\nIdiots are oblivious, it makes God furious\nSurrender yourselves, ye members of hell\nOffenders are given to jails\nThe devils agenda's to get in oneself\nAll we wanted was help, the common mind is blind\nThe honorable is hard to find, there should be no sign\nLiberty is defined, the spirit must be circumcised\nIt's deeper than just tribute time\n\n(Hook) Priest"}]}