{"songs": [{"lyrics": "[Verse 1: Action Bronson]\nFrom the Colosseum Block to the Island, \"What the blood clot?\"\nStay designing, always wiling, and we puff pot\nQueens to Brooklyn, no lies, give 'em 'nought shot\nChicken been getting jerked before your little nuts dropped\nYou know the mantra, Tyson in [El Fonta?]\nThe i-tal jockey keep me fucking like a monsta'\nHer landing strip is red like hair that's on Tatanka\nI'm steady diving in chocolate like Willy Wonka\nI take a knee and shoot a duck in the air\nFive minutes, I'm making stuffing filled with truffles and pears\nI'm lapping \"Go,\" while you only move a couple of squares\nBut still take out some time to do some drugs in the stairs\n\"Freeze! Lay on your stomach,\" what the popo said\nMy team selling the patties, getting cocoa bread\nBabylon, them have to catch me, burn up on the irie!\nNever die, I'ma give it to you my way!\nYo, peace to the chicken spot, peace to patty spot\nPeace to the types of spot that Veggie Castle dready spot\nThe dollar van, the Wallabe and Reggie spot\nAnd if a coward wanna rump I give him seven shots\n\n[Hook]\n[Y'all won't test we?] I'm in the corner puffing Marley\nGot the knife inside the boot, hoping they don't shoot\nCuz I don't want to hurt nobody, Ow\n\n[Verse 2: Maffew Ragazino]\nAy, ya no wan' rump with the senior\nWho lean like he mixed Jamaican rum and tequila\nTrail a load of hoes from Kingston and Montego\nKeep dick hard like Rottweiler Mandingo\nBob Marley ganja, stuffed up in the fanta\nPass dutchie towards San Fransisco\nWhere your nephew bout to bounty kill a punaani\nHoes know the movado!\nLick a shot for [windsweep?]\nI am living dangerously, Barrington Levy\nMake the girl wine like Beenie \"Sim Simma\"\nKeys to my new bitch bimma, her name Serena\nRastafarian reefer got me feeling so irie, tranquil and leisure\nBerry salmon and jerk chicken\nOxtail, gravy on white rice and fried plantain", "title": "Jerk Chicken", "album": "Dr. Lecter", "image": "https://images.genius.com/9b10376fe5cc5f697702488523dba2cd.580x521x1.jpg", "year": "2011-03-15"}], "artist": "Action Bronson"}