{"songs": [{"title": "When You See a Devil Smash Him", "album": "The Lost Tribe of Shabazz", "year": null, "image": "https://images.genius.com/ccff32ca0eedb6ac1f785643772e94fa.400x399x1.jpg", "lyrics": "[Verse 1: Lakim Shabazz]\nI see a devil I pulverize him, what else?\nSmash him and beat him into little small particles\nYou'll realize that I'm here to do away with\nNegativity and [?]\nThis is the topic, what?\nThe devil or Satan, or better yet three times two\nI got a question, I just gots to know, does it equal you?\nConniving are devils, devils are sneakish\nI'm a rebel when I appear, they get weakish\nI'ma drop jinx no matter what some think\nYou're [?] crash on the floor soon as the punk winks\nI spot 'em by they ways and actions\nI do the knowledge, I catch 'em and start taxin'\nThey show you pictures of him, it's not him\nThey conceal this, you don't know you livin' amongst him\nThey tell you that Heaven is in the sky\nHell is underground, come on now, open your eye\nYou're a snake, you do dirt\nSome stray away from what I say 'cause the truth hurts\nBut I'ma keep droppin' bombs\nMakin' hip-hoppers swarm\nThey know the tricks, so don't pass him\nYou come across a 666, then smash him\n\n[Verse 2: Lakim Shabazz]\nDevils (devils) come in all shapes, forms and fashions\nRebels (rebels) created for the purpose of simply smashin'\nDevils (devils) someone that I can't stand with a passion\nLevels are set, I'm a definite threat, I'll find me a devil, I smash him\nSo listen as I speak\nOpen your eyes and get wise while I teach\nSome people don't like what I like, they can all take a hike\nIt's the youth I reach\nDon't sleep, see devils attack\nSome devils are white, some devils are black\nNevertheless they're all sorts of meanings\nSome of us think of him as some sort of demon\nSome call him Satan, some call him Lucifer\nI'm not scared, I'm prepared to tell the truth to ya\nMy meaning of the devil is raw\nHe's nothing but a bloodsucker of the poor\nI push lyrics, you don't know how to push\nI'm quite serious, far from a sourpuss\nReady to roll, hands above your head\nYou make one move - you're dead\nThis is a land under siege\nBy a lyrical militant force, a rougher breed\nA terrorist, lyrical terrorist\nI advise you - what? To never diss\nSee, I never miss when I aim\nDevils swished, they never came\n'Cause I smash 'em\n\n[Verse 3: Lakim Shabazz]\nWhile Mark brings the beat Just bring the cuts\nI'll bring the rhymes and get praise like King Tut\nIt's no wonder my people\nGet beated and treated unequal\nDevils are made for devil missions\nThey've been doin' this since they existed\nMade to take over, bruise and make lower\nClass of another man and it stinks\nThat they rule the country, 10% of 'em\nI found it was time to make a rhyme to get at him\nI lead 'em out on a open plane\nThen found that his brain was a bit strange\nHum, what a difference between him and us\nBut they still try to put a end of us\nIt won't work 'cause I'm a renegade\nOf the nineties stage and I'm into\nWhat goes on in my community\nI strive for peace and unity\nAlthough some can help, they choose to be greedy\nAnd refuse to help the needy\nBut I'ma fight this with a righteous format\nAnd use the devil like a doormat\nThey full of tricks, so don't pass 'em\nYou come across a 666, then smash him"}], "artist": "Lakim Shabazz"}