{"artist": "Beanie Sigel", "songs": [{"lyrics": "(Chorus) Scratching w/ Background voice\n\n[Beanie Sigel]\nAiyyo Memph what's wrong with these niggas man?\nThese niggas ain't sayin shit man\nThese niggas on mute man\nI'ma make you blind motherfuckers feel some real\n\nAiyyo the guc is here dog I'm back to work\nI took time off a couple niggas had to get hurt\nDue to the fact they wack and wasn't strapped\nPackin they gat, now they layin' flat\nIn six in green (you know wut i mean?)\nMan I need a new gat for that\nYo, I'm the coke copper plus the rock chopper\nDown wit M. Bleek, the Marcy prock clocker\nOne wreck, the other destroy\nAnd with that bullshit vest on, I'm killin' your boys\nI don't play when it come to yae\nI cop cook and collect my dough in one day\nBook rock and collect my dough at one show\nFalse looks, Memph let one go from the floor\n\n[Memphis Bleek]\nYo, yo\nWell I'm known to be the master in the M.C. field\nOh-oh got respect, oh-one I still\nTote guns to the show and then I jet wit a hoe\nBitch niggas want to front and get clapped\nGet on the floor, clap a second time\nAnd make sure I flat-line you\nLet a whole round go, hit niggas behind you\nSee the gleam on the Glock, know the beam on top\nGet shot, popped, and drop, yo the team is the Roc\nAs I glance at Mack, a-k-a B-Sigel\nKnow we comin' with the macks and the extra Eagles\nI'm not playin, you dudes know what I'm sayin'\nI make a call to my dogs, them niggas comin' through sprayin'\nWhat you sayin?\n\n(Chorus)\n\n[Sigel]\nI'm puttin heads to beads, gun straight out the box\nB-Sige, I put up all the roofs and Glocks\nI'm not playin, see these guns that I'm sprayin?\nTwin sub oozies, can't budge or move me\nNickels stay chubby, smokers never choosy\nDon't gotta yell up the block, they come to me\nPacks with colorful tops just like coochies\nNew jacks with they pack they like, who he?\nI'm not playin, knock them things off quick\nGot game still think off shit\nWhat you say?\n\n[Bleek]\nWith a partner like Sigel, don't come a dime a dozen\nWe could be brothers, we better known as cousins\nAs we climbed the chart with who the fuck want what\nMy hood to your hood, we showed the world crew love\nWho wanna play with that Roc-A-team?\nKnow that I tote that thing that knock sixteen\nYou walk around talkin' this and that\nHow I sound like Jay and all my records is wack\nBut when I dropped the LP, niggas thought it would fold\nThirty days later, Coming of Age went gold\nWhat you sayin?\n\n(Chorus)\n\n[Sigel]\nNow party people it's time for this question\nNo knock knock, who's that? who's there? or who is it?\nIt's the M-A-C-K\nYes the gun clapper, the duct tape, rope, black mask and kidnapper\nThe flow dope, the beats just blazin\nLike Luther Vandrow says, yo 'I am so amazing and I've been waiting'\nFor a sucker to attack the cat with two gats\nYo Bleek, you got my back, show 'em how we do\n\n[Bleek]\nYo, I fight fire with fire, I make crews retire\nI spit 9 to 5 nines, Bleek for hire\nYour crew murderize, see the guns that I'm bringin\nIn an all out battle, Bleek come out swingin'\nMemph the type of nigga that'll spit off quick\nBiggs push the Benz and we spin off quick\nTake a sip of the Cris pour the Belvy with lime\nCrack the Arma del Lope and then I'm goin for mine\nSo what you sayin?", "image": "https://images.genius.com/bf8c5034f8552cd568d53398bc41222f.500x500x1.jpg", "year": "2001-06-26", "title": "So What You Saying", "album": "The Reason"}]}