{"artist": "C-Rayz Walz", "songs": [{"title": "Pots and Pans (DJ Cheapshot Remix)", "album": "Singular Plurals", "year": "2002-01-22", "image": "https://images.genius.com/e7001fbe65afddf468ba3eb1746ab880.722x723x1.jpg", "lyrics": "C-Rayz Walz - “Pots and Pans (DJ Cheapshot Remix)”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): DJ Cheapshot]\n\n[Intro: C-Rayz Walz]\nLeave it.  Leave that in\n\n[Bridge 1: C-Rayz Walz]\nYou make me sick, then you get me better\nYou crack me up just to put me back together\nInfinite wisdom.  Now and forever, overstand\nPots and pans, real trendsetters\n\n[Hook: C-Rayz Walz]\nMany couldn’t see the light when the Sun was dawning\nTried to play me like a crackhead—four in the morning\nSelling VCRs.  If you C-Rayz Walz, then\nYou know who I are.  Exactly\n\n[Verse 1: C-Rayz Walz]\nI swim with planks, walk the sharks\nBlow up the charts with explosive darts, then part\nMe and Noah went to McDonald’s and stole the Ark\nIn the huddle cut to construct the double-up mission like, “What?”\nNever beef with burgers—I’ll burn before flipping\nPolly with parakeets, hear myself speak and listen\nThe fast life: blast mics.  In the house, I’m street\nDon’t sleep.  I could reenact yours in a week\nThe Lord of the Flies born in disguise (Surprise!), Superion\nNagasaki blaze, Autopsy Five\nThis flow wet, at shows get with more water than Frisco\nWe old vets fully erect in the presence of your bitch flow\nFunk Buddha.  Off the top, I jump tutors\nTrack-movers backsmack rap acts and hack computers\nCats pursue the heavy shit I drop like stacked manure\nK. Lew produced the wax.  Don’t let the facts confuse ya\n\n[Hook: C-Rayz Walz]\nMany couldn’t see the light when the Sun was dawning\nTried to play me like a crackhead—four in the morning\nSelling VCRs.  If you C-Rayz Walz, then\nYou know who I are.  Exactly\n\n[Verse 2: C-Rayz Walz]\nYo, I’m murking\nVerbs, kicking the bass with my car dirking ‘burbs\nThen squirt on birds who act like they ain’t slurping turds\n(Fuck you!) You get on my flurking nerves.  Broken words\nIn the hospital talking to the nurse with a curse and slur\nYou ever notice cowgirls always lurk in herds?\nAnd moose dudes with a loose fuse look so absurd?\nI’m cool.  I’m just came home from hurricane verb\nGet your purse disturbed for rocking iceberg furs, you heard?\nI’m killing the streets—I’ll be hurting curbs\nThree-time felon, I’m telling you second person’s first\nMy splurge in blurts, so I’ll make sure my weapon works\nHave you burst in splurts, bizarre like bourbon burps\nSurfing the ‘burbs, observing worthless jerks, searching\nThe Earth, preserving the purpose is my curse and worse\nNervous birds perch in the church and chirp and rehearse\nKilling the sixteen while I’m burping the verse and still thirst\n\n[Hook: C-Rayz Walz]\nMany couldn’t see the light when the Sun was dawning\nTried to play me like a crackhead—four in the morning\nSelling VCRs.  If you C-Rayz Walz, then\nYou know who I are.  Exactly\n\n[Verse 3: C-Rayz Walz]\nSnatch your patch out space, smack myself in the face\n‘Til the good’s in the hood.  Out of states, I’m to the greats\nYou see me in the news rocking lightning shoes\nLike I went to Mount Olympus and robbed Zeus\nWrite rhymes on Pampers, drop shit often\nTuberculosis brothers in a day room coughing\nWhile the end begins, I see slaves with freedom\nWhy politick with derelicts?  I independently need them\nI’m serious.  You think I’m funny, fool?\nYou son of a gun, your mother’s a broke twenty-two\nYour pops is a forty-five with an empty clip\nThe sperm cell met the egg like, “He sent me...”\nLike spliffs that don’t lie/lye, this is my true joint\nCrossbred with pig cows, make you scream, “Moo, oink”\nWe off the roof, land on clouds, get it on\nOff the top.  Yeah, you know how we get down\n\n[Hook: C-Rayz Walz]\nMany couldn’t see the light when the Sun was dawning\nTried to play me like a crackhead—four in the morning\nSelling VCRs.  If you C-Rayz Walz, then\nYou know who I are.  Exactly\n\n[Verse 4: C-Rayz Walz]\nYo, if the streets is crying, the crib is hurting\nMad ‘cause the bonus track on your bootleg C-Rayz tape ain’t working\nSink overflower, you pink Motorola.  I think I’m\nStronger than ginseng, ginkgo biloba\nI’ll work out while I’m driving, pushup and pull over\nWhile you stand still, running your mouth with a broken molar\nUtilize fans when my chapter’s bent.  And with\nThe right hook, this could be a car accident\nI’m the type to spit a hot verse that deserves replay\nThen get on some humble shit like, “Yo, give it up for DJ!”\nI’m blessed with the WPIX flow.  (What?) “What?\nWhat’s your opinion?  We’d like to know”\nOn the permanent vacation, I’m temporarily stuck\nPlus, I’m overly concerned about not giving a fuck\nDeep work cold chilling with no T-shirt.  Dropping\nThis shit twice, call it the “Returd” until we return\n\n[Hook: C-Rayz Walz] (x2)\nMany couldn’t see the light when the Sun was dawning\nTried to play me like a crackhead—four in the morning\nSelling VCRs.  If you C-Rayz Walz, then\nYou know who I are.  Exactly"}]}