{"songs": [{"year": "2014-01-01", "title": "Breaking 2Bad", "image": "https://images.genius.com/2d3132b618224e9b8e4070a8514ed16f.1000x881x1.jpg", "lyrics": "“Too bad you fucked up, dummies\nToo bad you fucked up, dummies”\n\nJesse Pinkman: Tell me why you’re doing this. Seriously\nWalter White: Why do you do it?\nJesse: Money. Mainly\nWalter: There you go\nJesse: Nah, come on, man\nJesse: What?!\n\n[Verse 1: B. Dolan]\nNow let me say a little prayer before we eat\nThis is dedicated to the news that we delete\nAssociated guilt, bye bye, sucker freeways\nHard time rumbling, you wonder how we sleep\nI’ll tell you: the answer is seldom and lightly\nRecord by the head, ball pen right beside me\nYou could choose one if you feel lucky\nEither way you’re losing, it’s too bad you fucked up, dummy\n\n[Hook: Sage]\nTough titties said the kitty\n(Epic Beard Men! No pity!) No!\nAs an emcee it doesn’t matter how important being modest is\nI hold this … arrogance over you Donovans\nI’m Quasimodo, pseudo-mono, semi-automatic\nI challenge a 40-ounce to my 4.0\nYou left crews battered, cut up, and bloody\nToo bad (Too bad you fucked up, dummy!)\n\nWalter: I’m thinking maybe you and I could partner up\nJesse: Sage, you and me?\nWalter: That’s right\nJesse: Sage…\n\n[Verse 2: Sage and B. Dolan]\nOne for the one who couldn’t slow his roll\nTwo for the crews who broke up on the road\nThree for the plea you copped and got old\nBut that was a long time ago\n\n[Sage]\nI’m not wasting time pushing my CDs to stores\nI’m too busy just convincing people not to buy yours\nI cock block, I black ball, no pause, no stalls\nBrother B. Dolan got a story for y’all:\n\n[B. Dolan]\nNow once upon a time not too long ago\nA local opener or two played the fool in a show\nDude, how you in the dressing room touching my shit?\nI’m living out of that suitcase, you’re leaning on it\nAnd every drink that you leave down next to my laptop\nI think about stomping your teeth into the blacktop\nFifteen minutes over time (Oh hell no!)\nAnd came back stage looking for dap, holding demos\nI paid you a compliment, you asking about money too much\n(Too soon) Too puffed-up, sonny (Too gas)\nToo high (too funny) Too few paid dues\nDo you, little bunny\n\nYo, it’s just too bad you fucked up, dummy\nToo bad you fucked up, dummy (“Oh well”)\nToo bad you fucked up, dummy\nToo bad you fucked up, dummy\n\nWalter: Did you learn nothing from my chemistry class?\nJesse: No. You fucked me. Remember? Prick. And let me tell you something else: This ain’t chemistry. Okay? This is art\nWalter: Oh ho ho. I saw your setup. It was ridiculous. You and I will not make garbage\nJesse: Yeah, well, we’ll see about that\n\nToo bad you fucked up, dummy\nToo bad you fucked up, dummy\nToo bad you fucked up, dummy\n\nWalter: You know the business. (“Strange Famous!”) And I know the chemistry", "album": "Sick to D(eat)h"}], "artist": "Sage Francis"}