{"songs": [{"image": "https://images.genius.com/ffa9dd98b9dc6e743ed58e3af39e190e.640x640x1.jpg", "title": "Dreamin’", "album": "The Marathon", "year": "2010-12-21", "lyrics": "[Intro: Vanessa Williams]\nHow to put it together?\nHow to say it right\nYo, yo, Ralo\nHan, look\n\n[Verse 1: Nispey Hussle]\nI'm like\nFollow my steps, and you see what I'm bout\nI keep that money coming in and never going out\nYou wanna fuck a fly nigga that you heard about\nI beat that pussy up until it's watered down\nShe call me once a day to see if I'm around\nBut 9 times out of 10 I'm probably out of town\nI told you ease up you more persistent now\nI'm fronting though cuz if you stopped I'd probably miss the sound\nSomewhere in between us it's attraction and I see that\nYou make me wanna make you tat my name up on your cleavage\nI know it's just a song but when it stop I'm still gon' mean it\nSent your picture to my ex, told her this is why I'm leaving look\nCouple stacks in my pocket and I'm fiending\nTo down a glass of Reisling and go blow it at Neiman's\nHop in the coupe I know that ass will fill my seats in\nSomething decent then ride to the remix\nHan, Hussle\n\n[Hook: Vanessa Williams]\nHow to put it together?\nHow to say it right\n\n[Verse 2: Nispey Hussle]\nNow I was driving down Wilshire\nJust left the label\nLit my Swisher Sweet then we made a left on Rodeo\nLife is beautiful if I might say so\nI live it unrestricted, it ain't a place that I can't go\nGyu Kaku, hot shots and cold fish\nPints of dolce and coconut Ciroc fifths\nLiving drama free, Roosevelt cabana suites\nTMZ questions me about my strands of weed\nI like to vacation on Miami beach\nCouple homies from the set, some Atlanta freaks\nUsed to have them pounds cheap in 2003\nMost of the niggas from back then in penitentiaries\nAnd now they see me on they TV like \"how can it be?\"\nIt's complicated how I made it like Avril Lavigne\nThat's why they rooting for me, I'm speaking what they think\nWithout no pieces I could show you how to build a dream\nHussle, Hussle, Hussle\n\n[Hook: Vanessa Williams]\nHow to put it together?\nHow to say it right"}], "artist": "Nipsey Hussle"}