{"artist": "Isaiah Rashad", "songs": [{"title": "Don’t Matter", "lyrics": "[Intro: Isaiah Rashad]\nFree, free, free, free, free yo mind (Hey)\nFree, free, free (Hey)\nFree, free, free, free (Hey, hey)\n\n[Verse 1: Isaiah Rashad]\nMy shit go good with your mouth, don't it feel good?\nIt's a number 3, buckle up\nGot to the scene it was bonafide pocket book\nAnd 'cause you hide all my secrets from that bitch\nThey keep callin' your phone, I know he hate it\nBut the comet go\nKeep us in tune and my hooker got another show\nI'm on the road just to see if I can make it back\nWith just a scar and a carcass and a flaw\nLike God and his kids\nI know you hate us but it's nothin' else\nThey told me that I had to see it for my fuckin' self\nAnd if I make to the gates and he don't recognize\nThat I had all them traits of greatness and the starlight at my feet\nSo don't you take me to the preacher\n\n[Pre-Hook: Lance Skiiiwalker]\n'Cause I might testify, ay\nBaby today\nI might testify someday\nGet it on my way\nAnd I'm just a boy\n\n[Hook: Isaiah Rashad]\nAlright pimps, hoes, fingertips, masturbate\nAlright pimps, hoes, fingertips, masturbate\nAlright pimps, hoes, fingertips, masturbate\nAlright pimps, hoes, haha, yeah\n\n[Verse 2: Isaiah Rashad]\nAnd I ain't done with your mouth\nSay that as good as a number 3\nWant some more? you got away with the tongue-in-cheek\nNever seen, I know the code to your body\nAnd the road to the vision is all communication\nAnd we bust a nut\nI left a stain in your innard, don't you let it grow\nI know the words to your favorite and your everything\nBut I don't have time for you baby\nI am all for the profit, I'm past my self-destruction\nBut you bring it back\nI got a line for you waitin' in my Cadillac\n'Cause you describe all the symptoms of a common fiend\nYou said you read to the fire\nIt was good with the preacher and all the congregation\nWould you testify?\n\n[Bridge: Isaiah Rashad, Isaiah Rashad & Lance Skiiwalker]\nI guess he at it again like\nI guess he at it again like\nI guess he at it again like\nLet me put your knees to your chest and get ready\nLet me put your knees to your chest and get ready\n\n[Hook: Isaiah Rashad]\nAlright pimps, hoes, fingertips, masturbate\nAlright pimps, hoes, fingertips, masturbate\nAlright pimps, hoes, fingertips, masturbate\nAlright pimps, hoes, pimps, pimps, pimps, ah\n\n[Outro: Isaiah Rashad]\nHuh, huh, huh\nHuh, huh, huh\nEverybody's invited\nEverybody", "image": "https://images.genius.com/63ae3497b74634d538e6bd9eeaaac0a8.1000x1000x1.jpg", "album": "The Sun’s Tirade", "year": "2016-09-02"}]}