{"songs": [{"year": "2005-06-01", "album": "Training Day", "image": "https://images.genius.com/0d736130ef89ba0b866b3b01fad325c1.500x500x1.jpg", "title": "Blame God", "lyrics": "[Intro: Kendrick Lamar]\nBeen ready\nJay, I been ready\nHOV, I been ready\nThey say patience\n\n[Verse 1: Kendrick]\nEverybody wanna know why my game plan so strong\nCuz' I ain't gotta think with a light bulb on\nNigga I eat, sleep, and shit rap; I never relax, been a busybody since I was born\n\"Is he really fucking with Sean?\"\nI reply, \"His pick, I would take a tool on.\"\nDolce brown nigga, I'm right now, you ain't gotta wait later\nWhere the CD at? Put it in the disc player\nTell ho ride to it, I do it like none other\nCame back definition of a \"young motherfucker\" with a problem\n\"Future of the West Coast\" I am\nAnd that's real tough\nSouthern California, Angels, AKA LA's Chucks\nMake comparisons when I seen him duck\nMan you think \"What was to Pac and Big, before?\"\nAnd that was before\nI picked up a pen, and when I did, my thumb and my index sore\nAnd then I started writing with it\nFound that it flows better, like a Venice Beach sea shore\nHe don't wear the same clothes as ya'll\nHe is cut from a different cloth\nYa boy is cool, but I'm a different frost\nLike igloo, every time I come off\nEvery time I take off\nPandemonium when I take off\nThey hanging on the wing of that G4\n30,000 feet and still won't fall\nWhy you do that for?\nWhy you had to sell out that store\nYou made my record sales come up short\nMy reply is that it ain't my fault\nBlame God\n\n[Hook: Kendrick]\nI can't wait when its my time (I'm coming)\nNo I take that back, cuz' I got time (I'm coming)\nI know that patience is virtue\nBut that being said, you can't time beef, or I'll hurt you\nNo lie (No lie)\n\nI can't wait when its my time (My time)\nNo I take that back, cuz' I got time (Got Time)\nI know that patience is virtue\nBut that being said, you can't time beef, or I'll hurt you\nNo lie (No lie)\n\n[Verse 2: Kendrick]\nWhen the lights get dark\nAnd every body quiet, know its my part\nI might start a riot\nThe main event\nBulletproof under that black tent, you can't shoot through shit\nI never played the bench\nStar Point Guard\nNever pass up money, I'm a ball hog\nTouch anything I get my hands on, into pushin' like Ray Charles\nI never had no flaws\n\"Ooos\" and \"Ahhs\" after every bar\nTake your bitch, then give her back\nFor no reason for, just because, ya'll actin hard\nI'm bein myself\nAnd I got some plastic under my belt, so rest assured\nYou don't want your moms thinkin' bout pullin' that hospital cord\nWent from a Honda Accord, to a Bentley Azure\nBack seat got a flock of broads\nAnd I ain't gotta say to kiss it, just like \"Sure\"\nMomma gon' clean or fix it\nUse Terrific, Easter Brum????????\nAll it need is a little season on\nWho said a veteran can't be so young?\nI sound better than half ya'll on\nDamn K. Dot, let me see your arm\nI ain't gotta do a show, my jewels perform\nI ain't gotta do a show, my jewels perform\nPrincess cut looks stupid dumb\nEyes close shut, all I see is dollar signs\nAnd I won't get enough till I'm layed in the grave or hand cuffed up bout one time\nNo Lie\nBlame God\n\n[Hook]\n[Hook 1: Kendrick]\nI can't wait when its my time (I'm coming)\nNo I take that back, cuz' I got time (I'm coming)\nI know that patience is virtue\nBut that being said, you can't time beef, or I'll hurt you\nNo lie (No lie)\n\nI can't wait when its my time (My time)\nNo I take that back, cuz' I got time (Got Time)\nI know that patience is virtue\nBut that being said, you can't time beef, or I'll hurt you\nNo lie (No lie)"}], "artist": "Kendrick Lamar"}