{"artist": "Andy Mineo", "songs": [{"title": "12 Days of Christmas", "album": null, "year": "2016-12-17", "image": "https://images.genius.com/492858bf325f1e60ad2a1fbd4272bf4d.1000x563x1.jpg", "lyrics": "[Intro: Wordsplayed]\nOh, heh, heh. Hello everyone. Season's greetings. You got here just in time. The mulled wine is almost ready, the tree is up, the stockings are stuffed, and my Facebook post about Merry Christmas vs. Happy Holidays has started a thoughtful discussion about... \"Post here one more time and I will burn your house down you liberal freak\" *record scratch* Heh, heh. Excuse me. People all over the world are making the pilgrimage back home to wait for St. Nick, explain to their parents why they only visit once a year, and track down those pesky pesky gift receipts. Babe, you should've just gotten me a gift card. Oh, what's this? Looks like Andrew is home for the holidays. Let's how he likes to celebrate the twelve days of Christmas\n\n[Intro part 2: Andy Mineo]\nHey grandma, hey\nOh, hello\nHow are you?\nIt's been so long\nIt has, one year\nI'm glad you came to visit me\nAbsolutely\nWhy don't you sit down and I'll show you the gifts I got you\nYou gon like 'em\n\n[Verse: Andy Mineo]\nIf you love your grandma then raise eggnog with me\nHer gifts are full of love, a little lot of touch\nBut she's amazing and she's got some bad knees (help her get off the couch)\nOn the first day of Christmas my grandma bought for me\nAxe body spray, I don't mess with that\nI'm not in high school and I rock with Old Spice (the best)\nOn the second day of Christmas my grandma bought for me\nA pair of cotton gloves from the dollar store, nasty cologne samples\nAnd this lowkey fresh Mickey Mouse tee (it's kinda fire though)\nOn the third day of Christmas my grandma bought for me\nA hundred pack of pencils\nI ain't been to school in ten years, plus we all got cellphones\n(I use the note section)\nOn the fourth day of Christmas my grandma bought for me\nOne home drug test kit, Shake Weight, that's disgusting\nWhat you think about me?\nPlease stop asking when I'll get my degree (I already got it)\n\n[Outro]\nI don't have any more days of Christmas after that\nWell, I don't any gifts left\nWe don't even celebrate four days\nThat's just the number of days that leftover's last\nYou want some leftovers?\nWho in the world has twelve days of Christmas?\nI don't know\nWhere did we even get that from?\nThe Jews only get eight\nI mean, we get an extra four\nSomeone, someone do your Googles\nWhat's a Google?"}]}