{"songs": [{"album": "My Moment", "image": "https://images.genius.com/fb4345ee45eee0cb673ca7133397f303.1000x1000x1.jpg", "year": "2017-04-07", "title": "My Moment (Intro)", "lyrics": "[Intro]\nI ain't gonna use the beat this time, I'ma get, I'ma get a little more intimate with 'em\nYou ready?\n\n[Bridge]\nOoh, ooh, ooh\nOoh, ooh, ooh\nOoh, ooh, ooh\nOoh, ooh, ooh\n\n[Chorus]\nThis is my moment, this is my moment\nThis what I wanted, this what I wanted\nYou know that I'm with it, you fuck with me, I'm goin'\nWhen that money callin' I throw a bitch off me, I'm on it\nI'm on it, nigga\n\n[Verse 1]\nI sat there and waited\nFor niggas to help me\nAll that talkin' they did, them niggas ain't show it\nI sat there and starved, I remember the hunger\nAyy, when I got a plate, bitch it was over\nGame over\nNigga, back the fuck off me 'fore them killers get on you\nOoh, I ain't gotta be steamin', for these bitches to blow me\nOoh, beat my case in Kentucky, but they wanted to stone me\nOoh, one time for my bitch, I won me a trophy\nOoh, Neil mama know that her son safe\n'Cause at all times I'm ridin' with him\nDeangelo ever get killed, I can't tell the story 'cause I'm dyin' with him\nI was just broke without a dime with him\nAnd Cody, countin' pies with him\nMatchin' APs, it's our time, nigga\nFeel good to be alive, nigga\nI know niggas, niggas cool\nFuck 'em, I'll kill anyone\nBut my niggas ain't gettin' touched\nIf they ever call me, I'm whippin' up\nHoppin' out and I'm liftin' up\n50 shots on that glizzy drum\nNiggas coppin' pleas, I ain't hearin' 'em\nObituaries gettin' printed up\nAin't no beef with you niggas\nYou niggas can blow me\nOoh, 50 racks on me, that's after the Rollie\nOoh, I wasn't comin' home? Oh that's what they told you?\nI ain't killed nobody, bitch you know they couldn't hold me\nOoh, one time for my codefendants\nNigga, everybody stayed silent\nAyy, Theo, we goin' to the grave\nIn assessment, nigga, we was wildin'\nAyy, Juan tho when they split us up, my blood felt like lava\nPointin' out them niggas that shot you\nSo I can set them niggas on fire\nAyy, Big T if you can hear me, dawg\nI can't breathe without you, I'm drownin'\nWhen Suge called with them bad news\nAll them tears had a nigga blinded\nAyy, mom dukes, when you fought the feds\nI just knew that you was gon' beat 'em\nWhen they gave you all of that time\nIt ain't hurt 'cause I couldn't believe it\n\n[Chorus]\nBut look, this is my moment\nAnd this what I wanted\nBefore you fuck with me, just know that I'm with it\nWith whoever I'm goin'\nReal niggas gon' listen 'cause I'm a real nigga\nCan't nobody clone me\nYou fuck with my niggas, I'm comin' to get you\nI swear that I'm on it\n\n[Verse 2]\nOoh, ten bands for a feature\n500 to answer my phone for you\nI ain't got room for no leechers\nMothafuckas only call when they want somethin'\nNiggas really out here snitchin'\nStill runnin' 'round like they ain't told nothin'\nAnd real talk, I'm scared of y'all niggas\nY'all will get a nigga Super Bowl numbers\nDon't do it just for the money\nYou ain't gon' always get rewarded\nWhen you one hunnid don't nothin' come with it\nAnd when you're real you don't get nothin' for it\nLong as them circles stay silent and loyal\nWhat else is really important?\nWatch me do this shit for all of my niggas\nWatch me get this money tellin' my story\n\n[Chorus]\nNigga, this is my moment, this is my moment\nThis what I wanted, this what I wanted\nYou know that I'm with it, you fuck with me, I'm goin'\nWhen that money callin', I'll throw a bitch off me, I'm on it\nI'm on it, nigga, like ooh, ooh, ooh\nOoh, ooh, ooh\nOoh, ooh, ooh\nOoh, ooh, ooh"}], "artist": "Tee Grizzley"}