{"songs": [{"year": "2008-10-28", "image": "https://images.genius.com/91b9a76e50f5301dcd3a2c0ffcb542c7.425x425x1.jpg", "title": "Bounce", "album": "Tronic", "lyrics": "[Intro]\nYeah, yeah, yeah, yeah, yeah\nAyo, what's this? Feel good\nYeah, yeah, like how that feel right there\nI gotta let some shit off my chest\nReady? Aight\n\n[Verse 1]\nLive, in my own flesh\nIn my own breath, on my home steps\nIn the Mo' where my home rests\nAnd I hope what I hold gets\nIn the car for the doe for a pimp and a pimp's job is to get mo' doe\nLike the 17 year old's on the steps in the ghetto\nWhere they won't let you get bored and the moral of the story is death\nAnd the moral of the story got everybody worried and stressed\nTo the point where my niggas wear vests\nUp under they white T with a strap\nUp under the car seat with a Tec\nSo I made this for my niggas that made it onto the next\nLevel, level, level\nCelebrating in the club with the Moet\nBottles to the good life, no more hood life\nSo if you cashed out, mash out let me see you just...\n(Bounce)\n\n[Hook]:\nTo the top of the world we goin' and we goin' in\nHoods to the borough, we here, let me see you just\n(Bounce)\nIn the mornin', in the evenin'\nDo it for the fam that be in the streets and\nLet me see you just\n(Bounce)\n\n[Verse 2]\nAnd the hits ain't change\nBest artist not on your radio play\nStill gettin' blazed, gettin' head from a centerfold\nWhile Radiohead is played on my radio\nAnd it's so sad\nArtist's soft as a pillow, front tough as a Brillo pad\nI got fans that feel the same way\nLike 'Ditto Black\nGave up, can't depend on rap.\"\nBut it ain't just us where the pain struck\nEven old school artist's feel like the game's fucked\nThat's when I clock in as an option when\nYou need a breath of fresh oxygen\nAnd whoa\nI feel it ain't no balance\nClass of my own so I feel that there ain't no challenge\nWhen I see that there ain't no talent in most niggas\nNot tryin' to boast, just showin' you how most niggas feel\nRap deals, stack mills\nTell me where the rap game went over the past year\nUnderground fans said \"nowhere\"\nAsk record execs they're tryin' to find what's next to blow\nOh\nGot doe from the fans\nIt's just business, yeah I understand\nTryin' to find a new dance like the Running Man\nBut when it's all out\nI'd rather see 'em all\n(Bounce)\n\n[Hook]:\nTo the top of the world we goin' and we goin' in\nHoods to the borough, we here, let me see you just\n(Bounce)\nIn the mornin', in the evenin'\nDo it for the fam that be in the streets and\nLet me see you just\n(Bounce)"}], "artist": "Black Milk"}