{"songs": [{"year": null, "image": "https://images.genius.com/8bcb4f13231c32e3d05c93927a59e931.300x300x1.jpg", "title": "Put It in the Air", "album": "The Purple Tape", "lyrics": "Feat. Joe Scudda\n[Intro]\nYea! RAPPER!\nJ-O! Hah!\n\n[Rapper Big Pooh]\nI'm rap's Lamar Odom, bunch of new niggas\nWanna hang by the scrotum, peep what I told 'em\nDope shit find dope ears (oh!)\nIf you ain't dope, nigga don't shed tears\nDon't ask yo' momma, she don't count as a peer\nDon't ask ya boys, they just wanna be near\nThe money rollin, they ain't bein sincere\nGot a hot line, nigga what about career?\nWanna scrutinize every move I engineer\nAs the world turns, I begin to see clear\nI'm an art teacher, homie this is my craft\nCan't fuck with me, you can transfer out the class (damn~!)\nJust cause you young, don't mean you get a pass (nah)\nExcuses y'all make make a nigga wanna laugh (HahAHA!)\nLet out a big chuckle - hardy har har\nI'm eight years in, will you make it this far? (Naaaw!)\n\n[Chorus]\nDon't com-pare (pare) me to your average\nKnow it ain't fair (fair) standin room money\nSo you know we in here (here) Reservoir Dogs\nSo you best beware - PUT IT IN THE AIR\nDon't com-pare (pare) me to your average\nKnow it ain't fair (fair) standin room money\nSo you know we in here (here) Reservoir Dogs\nSo you best beware - PUT IT IN THE AIR\n\n[Joe Scudda]\nChiddy Chiddy Bang Bang\nWhy do you remain on doin the same thang?\nRidin on the same lane, as I beez in\nYou the 55, I'm doin a buck breezin\nGot all the haters wheezin, from the joint\nThat the weed's in, sit it down, let ya knees bend\nJust don't compare to no regular cham\n(No!) Joey just a regular man\nThough would lend a hand for a fam\nBut damn! I don't fuck with stans\nTryin to see a buck or a euro\nMe and Rapper, like Pacino and Deniro\nPut it on a C-note, doin like \"Casino\"\nOr maybe \"Righteous Kill\" and I might just peel - BAP!\nAny rapper think he write this ill is wack\nYeah I said it and I don't regret it\nSo go and tell 'em 'bout it\n\n[Chorus]\n[Outro: Rapper Big Pooh]\nDiplomacy season is over, muh'fuckers!\nDiplomacy season is over! I ain't takin no more shit!\nI'm 'bout to take this thing to another muh'fuckin level\nHOJ, Reservoir Dogs, muh'fucker\nBlack Milk, waddup?! Hex Murda, uh!\nAll my Midwest niggas! Heh... IT'S THE NEW ME, NIGGA!\nYou muh'fuckers better get ready\n\"Dirty Pretty Things\" is on the muh'fuckin way\nThis is what we do all day, nigga!\nAll muh'fuckin day, how you say it, J-O? Aw-riiiight!\nHahaha! Dey ain't ready, dey ain't ready\nHAHAHAAAAAAAAAAAAAAA~!!!"}], "artist": "Rapper Big Pooh"}