{"songs": [{"title": "1 (773) Vulture", "album": "Just Cause Y’all Waited", "year": "2018-01-11", "image": "https://images.genius.com/b2cba5a923a6afe7615832d96ffe3c02.355x355x1.jpg", "lyrics": "[Chorus]\nWhy the opposition callin' my line?\nTellin' me to come outside\nI would, but I know they lyin'\n(I been through this shit before, you know?)\nFoe'nem told me keep my iron\nMy momma had a dream about me dyin'\nI told her that I hope she lyin'\nIt's gon' be a homicide\nIt's gon' be a homicide\nFuck with Durk and they dyin' today (facts)\nThey told me they sick and tired\nThey don't want to die today\n\n[Verse]\nWhatever my niggas be wantin', know I got 'em (I got 'em)\nI be off them drugs, addicted to narcotics (narcotics)\n2012 niggas wasn't with me in the 'partments\nI'ma take a risk, carry my guns inside my joggers (yeah yeah)\nWhy you steady playin' hoe? Let me be their father\nKill his ass in the streets, we hope they don't charge us (don't charge us)\nWe can't find your ass, we gon' kill your artist (On God)\nAnd you know it's guaranteed when I say promise (yeah yeah)\nAnd I got some shawtys that gon' shoot\nThey gon' do the shit you ain't gon' do\nThey gon' slide through your block, they make calls on you (Let's get it)\nYou hang with them and don't supposed to, it's gon' fall on you\nSpit on me bad when I was down, I'ma ball on you\nAnd you ain't thinkin' 'bout getting no money, til' it dawned on you (yeah yeah)\nAnd nigga I'll drill for 'em (drill for 'em)\nI ain't still signed to French but I'd kill for him (Let's get it)\nWho said I ain't got no money, I'm like a mil' on\nYou tried to turn a hoe into a housewife, watch, she still goin' (still goin')\nVoice of the trenches, talkin' for the streets (for the streets)\nTeachers said I might be dead 'cause I love the streets (Bitch)\nAnd she still told me that my grades above a B\nThe streets don't love anyone, but they in love with me\nFuck with me and it's a homicide\nTry to clean my image with a turkey drive\nWent in 18 he gettin' out when he like 35\n2018 I'm goin' up, my shows a hundred racks (Damn)\nLie to you none, but in jail I say a hundred lies\nHow the fuck you mad, and I gave your ass a hundred tries? (ohh)\nAnd from them brothers that I love, I dropped a hundred, why?\nDon't feed your gang when they snake you, you gon' wonder why\nTryin' tuck my pride away (tryin' tuck my pride)\nI ain't really tryin' to die today (I ain't really tryin' to die)\nCertain shit I can't tolerate (no)\n\n[Chorus]\nWhy the opposition callin' my line?\nTellin' me to come outside\nI would, but I know they lyin'\n(I been through this shit before, you know?)\nFoe'nem told me keep my iron\nMy momma had a dream about me dyin'\nI told her that I hope she lyin'\nIt's gon' be a homicide\nIt's gon' be a homicide\nFuck with Durk and they dyin' today (facts)\nThey told me they sick and tired\nThey don't want to die today"}], "artist": "Lil Durk"}