{"songs": [{"image": "https://images.genius.com/8b85f0ed9200b8df277ffa6a0112e36e.1000x1000x1.png", "title": "Heaven", "album": "M.O.", "year": "2013-09-02", "lyrics": "[Intro: Daley and Nelly]\nSaid it feels (Yeah)\nIt feels like heaven (feels like heaven)\n\n[Verse: Nelly]\nYeah, take it to the head then take it to the floor\nThis feeling heaven-sent\nEvery single time me and you roll\nTen bottles and up, yeah we livin' it up\nFly high ‘bove the clouds, you'll never get stuck\nAnd you can take your take your time, my attention’s on your angles\nOh say can you see? Ya got me seeing star spangles\nAnd I’m going for the Superbowl field goal\nI know you feeling it right, hard liquor tonight\nIt ain’t no stopping when we poppin', girlfriend, go in\nYeah ya got high, all because you touchin’ and rubbin'\nPlus I’m above it. I know you gotta be sick\nLet your light shine, baby, every time, you're tick\n\n[Hook: Daley and Nelly]\nIt feels (it feels good)\nIt feels like heaven (feelin' like heaven heaven heaven heaven heaven)\nAnd I don’t wanna go there no time soon\nSo won’t you please come down here (Better come 'round here here here here here)\nIt feels like heaven!\n\n[Verse 2: Nelly]\nDon’t hold your breath, don’t listen\nFeel like you going through hell – it’s just a visit\nFeel like everything you going through — you’re on your own\nTake a shot of the Silver Bullet, thank God for Patrón\nThank God for the men that hurt you\nYou can separate the boys from the men now ‘cuz you see your virtue\nYou know when you're in comfort and it feels like heaven\nEven though we wasn’t gonna work your body\nShake it up and down to the ground\nBaby I just wanna feel right here, right now\nOne time, one choice\nBaby, it’s called for\nI’ll hold you down, never let you go\nCause it feels like\n\n[Hook: Daley and Nelly]\nIt feels (it feels good) (Hey)\nIt feels like heaven (feelin' like heaven heaven heaven heaven heaven)\nAnd I don’t wanna go there no time soon\nSo won’t you please come down here (better come 'round here here here here here)\nIt feels like heaven!\n\n(Oh the sun shine every time we roll)\nIt feels like heaven!\n(My arms around her, love her, never leave her, never let her go)\nIt feels like\n(Yeah, Rolex still spinning, so we good on time)\nIt feels like heaven\n(No braking lights, baby, go hard it’s fine)\n\n[Verse: Nelly]\nNever hate the ladies that make the babies\nGirl you could be anything you want\nAnd you deserve it, I know you’re worth it\nNever ever let the feeling go\nNever hate the ladies that make the babies\nGirl you could be anything you want\nNow put your hands up high, ‘cuz you’re going for a ride\nAs the feeling overloads, keep the feeling inside\n\n[Hook: Daley and Nelly]\nAnd it feels (it feels good)\nIt feels like heaven (feelin' like heaven heaven heaven heaven heaven)\nAnd I don’t wanna go there no time soon\nSo won’t you please come down here (better come 'round here here here here here)\nIt feels like heaven!\n\n(Yeah, the sun shines every time we roll)\nIt feels like\n(Got an angel, gonna love her, never leave her, never let her go)\nIt feels\n(Yeah, Rolex still spinning so we good on time)\nIt feels like\n(No braking lights, baby, go hard it’s fine)\n(Yeah)"}], "artist": "Nelly"}