{"artist": "ILL BILL", "songs": [{"title": "Severed Heads Of State", "lyrics": "[Verse 1: ILL BILL]\nLet's play Dungeons & Dragons on mushrooms and acid\nLike Ricky Kasso, smoke angel dust and kill these hippie assholes\nLight the chemicals ablaze, relevance appraised\nVenomous exchange of terrorist acclaim, inheritance of hate\nSevered heads of state in a parade of chanting Satanists\nActs of heinousness are sprinkled on our plates like bacon bits\nSwallow while you raise your fist in protest\nYour true emotions camouflaged like God\nIt's convenient like Amazon.com\nAnd we're all guilty as charged or just simply involved\nOften brainwashed by quick money, loose women and cars\nBut maybe that's the way we're meant to be\nIgnorant mutants for nukes\nTrapped in a Matrix ruled by shooters in suits\nI think we're more than that, I'll quarterback\nTime to clean our house and take our cornerback\nPut a message in the music, this is more than rap\nOr at the very least, it could be and it should be\nSo I gotta pay it forward 'cause I learned alot from Chuck D\nAnd Henry Rollins, college was an empty promise for me\nMusic's influence was way more honest to me\nOr maybe that's just my excuse\nBecause I dropped outta high school at fourteen to pursue music\nIt was all a dream\n\n[Verse 2: EL-P]\nLive in a still from the worst movie ever's worst scene\nAntagonists stand proudly in the stench of all their dirt sheen\nLooks like God and them forgot to take their happy pills again, scream\n'Cause every shisen-eater from your nightmares getting top cream\nMud is the name you been give, shit is for dinner\nYour average beginner might wanna take a fetal position\nI feel that, nothing's promised but static and dirty conscience\nOr waking up like the dawn is the start of another problem\nThat's real fact!\nTrust me the dustedest type of function's you having to sit there\nGrumbling while dummies run the discussion\nSo I'm a master of the numb it down, drown the voices choice\nEvery drug invented got attention from me\nDesperate to avoid the noise\nAnd I never learned a fucking thing\nExcept I don't know fucking shit\nAll that I ever had was madness\nAnd the luck to get the chance to spit\nAnd I'll take that!\n'Cause by my calculations that's as good as any day job\nThought I told you that I'm fucked\nWhy you surprised I always stay hard?", "image": "https://images.genius.com/3c85efb9b9e6e7efc21e7b0199174306.800x800x1.jpg", "album": "The Grimy Awards", "year": "2013-02-26"}]}