{"artist": "Anybody Killa", "songs": [{"title": "Oh No", "image": "https://images.genius.com/e8235b7763da2f99c14011dff35a2d0f.400x400x1.jpg", "album": "Dirty History", "lyrics": "[Hook] -x2\nOh no! Oh, oh oh oh no!\nAin't nothin' holdin' me back now!\nHoldin' me back now!\n\n[Verse 1]\nOh no motherfucker, suck up that lip\nBecause I'm back in this bitch and I'm ready to trip\nSo I hope you never doubted me, cause here I am\nPacked in ya ear drum like a can of spam\nAnd I wouldn't give a damn if you hated me now\nBecause my family hears me out and bumps this shit out loud\nYou can call us psycho, crazy, insane\nWith no one to blame, so we just sit in the rain\nWaitin' for the right day to get what we deserve\nLike respect from the cops on the curb at the concert\nNice titties, my oh my\nBut when the tear gas fire, you better close your eyes\nEvery time a new adventure, punch a horse in the face\nSmoke a blunt in the forest while you piss in the lake\nSituations fucked up, fun and foul\nBut it's a whole new year so try and stop me now\n\n[Hook] -x2\nOh no! Oh, oh oh oh no!\nAin't nothin' holdin' me back now!\nHoldin' me back now!\n\n[Verse 2]\nDo you believe in what you do?\nDon't stop, don't let no one hold you\nBack from what you really wanna do\nBesides in this life all you got is you\nKeep your heart clear (Keep your heart clear)\nDon't let go..go..go.. so emotional\nBelieve me, I know!\n\n[Hook] -x2\nOh no! Oh, oh oh oh no!\nAin't nothin' holdin' me back now!\nHoldin' me back now!\n\n[Verse 3]\nYou can't hold me back, because I'm comin' full throttle\nHand on my hatchet, who wanna see a head bobble?\nI see my streets, like it's a native warfield\nAnd I'm the only redskin left, standin' with no shield\nSo I started to chop cause I can't stop\nIt's looking too peaceful up there on the top\nSo I'm, doin' everything that I must\nEven if I gotta bust the ones I can't trust\n\n[Break]\nAin't nothin' holdin' me back!\nAin't nothin' stoppin' me from takin' what's mine!\n(You can't stop me! you can't stop me! you can't stop me!)\nAin't nothin' holdin' me back!\nAin't nothin' stoppin' me from takin' what's mine!\n(You can't stop me! you can't stop me! you can't stop me!)\n\n[Hook] - Repeat Until End\nOh no! Oh, oh oh oh no!\nAin't nothin' holdin' me back now!\nHoldin' me back now!\n\n(Skit)\nViolent J: Fuck him then, for real\n(What up baby, I got that dope)\nDamn Killa, there go weedman right there\nABK: Man my feddy ain't ready\nVJ: I got that 50\nABK: Shit, hook it up then big dollar\n(I got that 30 baby)\nABK: What's up?\nVJ: What's up on a 50 sack?\n(Hey look man I got 50's, 100's, 200's)\n(Whatever you tryin' to do baby I got all the weed you need)\nVJ: Yeah dogg! That's what I'm sayin'!\n(Yeah well check this 50 out right here man peep that man)\nABK: Lemme see this shit (*sniffs*)\nVJ: Ight?\n(Right right, Yeah that's that deal baby)\nVJ: Whoa man (What?)\nABK: Man that's a lot of weed for mu'hfuckin' $50 dogg\nVJ: Hold up man, what's ya name dogg?\n(I can do deals man, what's up?)\nABK: Man what's ya name dogg?\n(Y'all want the weed, why?)\nVJ: What's ya name though?\n(Man, my name Chuck man)\nVJ: Damn, I knew it!\nABK: Man! that's-that's Charlie Brown dogg!\n(I mean, what?)\nVJ: Fuck man!\n(Y'all don't want the weed? Y'all don't want the weed?)\n(If y'all change y'all mind, y'all know where to find me)\n(I be down on Sesame Street fool!)", "year": "2004-07-27"}]}