{"songs": [{"year": "2015-09-04", "album": "Only Way Is Up", "image": "https://images.genius.com/3b1383e768b84255f7aee1d94135fee4.680x680x1.jpg", "title": "Control", "lyrics": "[Intro: K Camp's dad]\nWhen you were growing up, I missed the laughs, I missed the fun\nEvery time you left heading to ATL, I felt undone\nSometimes I wanted to talk, but hustlin' took its toll\nDamn near gave the streets my soul\nI will never be able to replace the time lost\nBein' a daddy and not a father is a hell of a cost\nA big piece of me is you\nAs I reflect the man in the mirror, he gets so clearer\nHe wants to pull me in to start over\nBlack Ops this is not\nThis is something inside deep from your pops\n\n[Verse 1]\nShit get better with time\nYou ever heard me say one lie in my rhyme?\nBeen doing a lot of thinking and a whole lot of praying\nIt's my only way to vent, what the hell is you saying?\nFeel like I got a lot of people that's depending on me\nBuilt a solid foundation, put the building on me\nYou remind me of myself so why you tripping on me?\nI remember how it felt when my tank was on E\nI remember how it felt when the money was low\nDirty dishes in the sink, mouse traps on the floor\nNeed to buy a bakery, the way I'm after the dough\nWonder why the hating me, I just practice and go\nOne thing I learned, time don't wait for nobody\nLove the feeling I can finally tell my momma I got it\nLove the feeling I can finally take a look in my wallet\nSee some hunnids in that mothafucka, maybe I'm wilding\n\n[Chorus]\nShit get better with time\nI said shit get better with time\nShit get better with time\nShit get better with time\nLet's go\n\n[Verse 2]\nR.I.P. aunt Randie, I got something to say\nKeep ya head up unc, trust the lord and your faith\nMomma just told me grandma ain't doing too well\nEver sicne she gave me hope, I've been giving them hell\nBack then with the juice jugs shooting the cans\nWhere I come from, from niggas shooting they mans\nWhere I come from, nigga, nobody safe\nWhere I come from, like no other place\nAnd I love that I'm just trying to be around where the love at\nNiggas beefing over bitches, we above that\nI ain't smoked all day, where the drugs at?\nShawty tryna go some rounds, where my gloves at?\nEven though you wasn't around, I can't blame you\nYou is who you is, I can never change you\nLife lessons that will show me what the game do\nIt made me who I am so I got to thank you\n\n[Chorus]\nShit get better with time\nI said shit get better with time\nShit get better with time\nShit get better with time\nLet's go\n\n[Verse 3]\nHold up, wait can't believe they want more\n30 cent bag of chips on the corner store\nDoing 'bout a hunnid, youngin' always on go\nSay you getting pussy, why you stressing 'bout a ho?\nNigga pay attention, I'm the man on the low\nFuck that shit, I'm the man on the high\nLast time I checked, the only time I got fooled\nWhen R Kelly told me he believed he could fly\n\n[Outro: K Camp's mom]\nI knew how passionate he was (forreal)\nYou know, he used to write every day\nHe'd go downstairs, stay down there for hours\nThat's all my house was, a studio\nWhen you find the one, that he stays up all night for\nThat's the one that you need to get behind and push him\nHe's been consistent since day one"}], "artist": "K CAMP"}