{"artist": "Cam’ron", "songs": [{"title": "Fuck You", "album": "Confessions of Fire", "year": "1998-07-21", "image": "https://images.genius.com/3c9078c99248a02e298976d5d0e167be.600x600x1.jpg", "lyrics": "Mase:\nB, I'm feeling it from the heart now, B\nYo straight up, yo, this Murda, Harlem World is the clique\nI'm with my nigga Killa, and we bout to lay it down for y'all niggas\nAll ya'll faggot ass niggas out there that wouldn't give us $300 dollars for\nThe tape\nTo make a demo, FUCK YALL NIGGAZ!\nAll y'all bitches that wouldn't suck my dick when I was Mason Betha\nFUCK YALL BITCHES!\nAnd all yall bitches that wanna fuck my nigga*\nHuddy Combs cuz he roll with me, FUCK YALL BITCHES!!!\nAll y'all niggas that fucked around and made my nigga Blood can't be here\nPoppin' on niggas, mayn, FUCK YALL NIGGAZ!!\n\n*background chorus starts, goes all throughout song until noted otherwise\n\nBackground chorus:\nAaah, oooh\nFuck you, fuck you!\n\nCam'ron:\nThis goes out to Mr. Fuckin' Russell\nWho never let me gamble or play numbers, you always talkin' bout\nI'm fuckin' too young\nAnd what about that fuckin', that fuckin' transit cop\nWho was there every time I had to fuckin' hop the train\nWanted to play like he fuckin' ran the whole station\nLike he, like he had to run the whole fuckin' shift\nAlso yeah, yeah...\nTo the teacher who failed me\nTo the bitch who never bailed me, yeah, you thought I wasn't getting out\nRight, bitch?!\nWell now, I got out, fuck you!!\nPlus she never gave me no bread\nPlus she never gave me no head\nAnd that pussy was soooo wack\nIt was wack, B. Yo, fuck you!\nYeah, you thought I wouldn't go pro\nBut now I'm fuckin' yo' ho!!\nHaHa!! Fuck you!!\nBut I know these, these bitches wanna say ' fuck these niggas', too, right?\nHe want you to lick his balls\nBut, yo, his dick is small. Ha!\nTell that nigga, fuck you!!\nFuck him, B\nYah, he always wanna come beat it\nBut the nigga never wanna eat it!\nFuck that nigga, Cam will eat it, I really don't care. Fuck him!\nHe never spends a dime\nAnd yo he never comes home on time. Fuck them, B\n\n(Background chorus stops)\n\nCam'ron, Mase, Lance \"Un\" Rivera, and Darryl \"Digga\" Branch:\nFuck you, fuck you, fu-u-u-u-uck you! FUCK YOU!\nFuck you, fuck you, fu-u-u-u-uck you! FUCK YOU!\nFuck you, fuck you, fuck you, fuck you, fuck you, fuck you, fuck you, fuck you\nFuck y-o-o-o-o-o-ou! Hey!!\nFUCK YOU!!!!\n\nCam:\nMayn, fuck you!\n(laughter)\n\n[Production By Lance \"Un Rivera\" & Darrell \"Digga\" Branch]"}]}