{"artist": "Aminé", "songs": [{"title": "Turf (Stripped)", "album": null, "year": "2017-06-16", "image": "https://images.genius.com/d99bf37e5864818738ac80b5b6619171.630x625x1.png", "lyrics": "[Verse 1]\nWalking on the pavement I check my pride and my teeth on\nThe girl I grew up with lives a couple houses down\nThe 8 Bus run the same, dogs howl when the train\nComes like me ex girl and next girl\nUsed to rock the S curl\nWanted me a Nextel but my momma copped a Razr\nThat's why I couldn't blame her\nFlipping through my past like I used to flip the phone\nThey kicking out the blacks and all the houses getting clones\nFriends used to do pills and only eat at Deuce Grill\nThe food was pretty good but the times was better\nThese are the only days I missed\nLike the first shawty I kissed\nI used to have dreams now I dream\n\n[Chorus]\nI look around and I see nothing in my neighbourhood\nNot satisfied don't think I ever wanna stay for good\nPacked up my bags, told mom and dad I gotta go, go\nAnd once I do they'll finally see the enemy\n\n[Verse 2]\nEverybody wanna be a star, everybody want a nice car\nEverybody wanna live great, have a good damn time, never trip with the law\nThe popo up in PO, dirtier than VO\nPolice from the past act like I'm they fucking hero\nLiving in LA for the weather, I facetime mom when I miss her\nI got some homies that'll never leave my home\nWhen I pull up to the corner, it smell like Miley Cyrus\nI told em' I don't smoke, they say \"boy, you fucking wildin'\"\nInnocent and young, reckless and we dumb\nOur heart is like our earth and memories the sun\n\n[Chorus]\nI look around and I see nothing in my neighbourhood\nNot satisfied don't think I ever wanna stay for good\nPacked up my bags, told mom and dad I gotta go, go\nAnd once I do they'll finally see the enemy\n\n[Verse 3]\nMentality the same from my folks\nMomma wanna see me happy, she don't wanna see me broke\nI said \"bread wine, sauvignon, rastafari, babylon\"\nYou can never die if I live it like a prize (hey!)\nWho knows who I am, who knows who I are\nMost people pretty sketch like a night at Echo Park\nThat's why I just keep it cool but my time is in a leisure\nEverytime I'm home I catch emotion like a seizure\n\n[Interlude]\nI cut the first night, we fuck around, I put my finger in her bootyhole cause you know you gotta test the water with hoes. A-a-and then.. *laughing*\nI slip and slide through the times in my youth\nWhat's the age? Too young to worry, too old to dream\nWhat's the age? Imagination to me, tragedy to some\nWhat's the age? I guess we'll find out when we're older. Touché\n\n[Chorus]\nI look around and I see nothing in my neighbourhood\nNot satisfied don't think I ever wanna stay for good\nPacked up my bags, told mom and dad I gotta go, go\nAnd once I do they'll finally see the enemy\n\n[Outro]\nOh\nOoh, oh, ooh, oh yeah\nOoh, ooh, oh yeah, ooh\nYeah-eah-eah-eah-eah\nOo yeah-eah-eah-eah\nOhhhh hmm\nOhhhh hmm\nHmm\nHmm\nTurf"}]}