{"songs": [{"album": "K.O.D.", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg", "year": "2009-10-26", "title": "B. Boy", "lyrics": "[Intro: Tech N9ne]\nB. Boys and B. Girls stand up\nDown south, midwest, east coast, west coast\nGlobally, everywhere, yeah!\nTech N9ne now! Let's go!\n\n[Hook: Tech N9ne] (2X)\nSwing first, I'mma destroy\nYou a curse, I'mma B. Boy!\nCherried up, got 'em P'noid\nLet the whole world know, I'm a B. Boy!\n\n[Verse 1: Big Scoob]\nI watched Snoop do it, he let that blue flag hang\nSo watch Scoob do it, I'mma let the brown rag swang\nMiddle deuce to it, boy that's just a five six thang\nNow SOO WOO! WOO! That's how we rep this gang\nI ain't new to it, vill I got that bang in my veins\nAnd I'm true to it, all I know is bangin' and 'caine\nSo get used to it, validation now I'm with Strange\nOG villain off the block representer of them flames\n\n[Verse 2: Kutt Calhoun]\nI pledge allegiance to the flag, my united hoods of Damu and trees\nI'm certified, around the top banging was so influencing\nI made it with my heart, a vendetta, in hopes of unity\nAnd left out a with family, a forty cal and a newer me\nDeuce click represent, red rag regiment\nRedrum replicants, whips runt recreate\nRest won't recommend, refs don't let you win\nRed Rider Warriors we rectify the testament we\n\n[Hook]\n\n[Verse 3: Skatterman]\n5'10\", 235, hell of a left hook\nNiggas think the feds came and got me when they got West Crook\nA vet, look, pull up stuntin' and get your vet took\nOr we could stand mano y mano and get your best whooped\nKnuckle up knucklehead, nigga been with this knuckle game\nStill fuckin' with Scoob, Kutt and Kali, baby ain't nothin change (STRANGE!)\nI ride for em without the paper work, and organize drive-by's that have you and your neighbor hurt\nSend a couple down and hey you and your neighbor mercked\nShow you I ain't playin' fuck around and knock your neighbor first\nIt's Skatterman, pussy more than just the verses son\nWho you think Tech gonna call to make sure that the dirt get done\nRed cap, red shirt, red shoe strings\nMy .45 is a bitch, and I think she havin' mood swings (mood swings?)\nYou think them boys got guns watch what your dude bring\nFully auto AR-15, wipe out the Blue Team!\n\n[Hook]\n\n[Verse 4: Tech N9ne]\nBeats bangin' better bring it big or bounce bitch\n'Bout to blast it in blood I'm back in this black brick\nBoss balla, been breakin' bread 'n baguettes brie\nAnd beautiful biancas, bideos, and Begas with big B\nBow been for brilliance, stressed to be buildin' it\nBest in this barrio bane and bazaar be more bills in this\nBankin' his babies be blingin' and his boo be that big booty!\nBig bust! Be in his Benzo bronze and get big bucks!\nI'm a black baboon, bring me bags of bananas\nBona fide, billy bad ass with a brown bandana\nBeen gone on Bacardi 'bou Lou but I'm 'bout to be bigger bent\nBetter break if you bustin' before I'm blown and belligerent\nSix deuce brims biggin' it, I'm bloated than Blimpy\nBroads be blowin' me in the back of the black Bentley\nNever been about no babblin' not bringing no bootsy\nBut I've been in the bay with big bond like shaboobalaboopy!\n\n[Verse 5: Bumpy Knuckles]\nYo it's the OG Bumpy Knucks, Knucks I rolls with them B. Boys\nB' walkin' round strapped up-up\nYou can talk that killer shit if you want my niggas, spit it\nGuarantee that you'll get clapped up-up\nSee I'm the beast, you the bitch, I'm better battling baby\nMe and the blood Tech Nina saddled up-up\nAnd for the record nigga, check mines and you will find\nThat I shoot legendary status niggas up-up\nCome on, to be like Bump ya gotta be a big ball breaker (Pow!)\nCrack a nigga whole rack I'm like a jaw breaker (Crack!)\nKnock you out and and hit them pockets like a cold hand\nI'll bust your motherfuckin' shit and I'm an old man\nThey said my music was Strange until I made\nMe sum change and now they ridin' my nuts-nuts\nTech N9ne's out the window, you see them\nKC Killers ridin' by y'all niggas better duck-duck!\nCome on!\n\n[Hook]"}], "artist": "Tech N9ne"}