{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/d55597aef7ddcd938a2bfc161537e7d5.1000x1000x1.jpg", "year": "2011-11-21", "album": "Radioactive", "lyrics": "[Intro: Yelawolf & Eminem]\n(In this world, in this world!)\nYeah, aight Marshall, uh\n(Well, I'm think you can tell 'em today)\nWho am I? (Yelawolf)\n(And now you need to bring 'em into this world!)\n\n[Hook]\nIt’s getting hard to be me\nEvery where I go, somebody’s looking at me\nAnd If I ever need something, I’mma get it for myself\nCause I’m the only person thinking ‘bout me\nIt’s getting hard to be me\nEverywhere I go, somebody’s looking at me\nAnd if you gon’ compare me at all best compare me to myself\nCause I’m the only person fucking with me!\n\n[Verse 1]\nIn this world of sticks, hicks and chicks with aqua net spray\nShhh-shut up motherfucker don’t disrespect these country ways, yeah!\nAlabama, if yeen know, I ain’t hiding a damn thing, I just like to lean low\nYeah, I’m the theme show stereotypical beanpole\nSlim, tall, tatted, let me add that I gotta green glow\nFrom all the Mountain Dew that I consume from a mason jar\nIn a racing car, chase it with a tall ice brew\nLet me not leave you confused, what I represent culturally\nTrash bag full of freon, I’m huffin’ puffin’ on potpourri\nThat gummo’s squeaky swingin’ gate in front of that trap house\nTrailer park is sewed up and Billy done pulled that ac out\n\n[Hook]\nIt’s getting hard to be me\nEvery where I go, somebody’s looking at me\nAnd If I ever need something, I’mma get it for myself\nCause I’m the only person thinking ‘bout me\nIt’s getting hard to be me\nEverywhere I go, somebody’s looking at me\nAnd if you gon’ compare me at all best compare me to myself\nCause I’m the only person fucking with me!\n\n[Verse 2]\nWonder what I got inside this Chevrolet Trunk I’m hiding\nAbout ten Bodies on a fishing line with baby clothes on consignment\nCame to the Game so broke that I still find one-dollar bills and get a thrill\nThat’s the kind of shit that leaves my pickle dill'd\nSiding on the single-wide got icicle steel, too cold\nGot a kerosene heater to heat up the grill, meatloaf?\nDaddy’s in jail again for shuffling pills, we know\nMan I’ve only come to give you a peep show, (In this world)\nI run across the South Like a wild stream, smiling\nI’ve seen more colorful mushrooms than a child’s dream on an island\nDesolate left behind, cause my state is a state of grime\nGod said, 1979, go change the minds (In this world)\n\n[Hook]\nIt’s getting hard to be me\nEvery where I go, somebody’s looking at me\nAnd If I ever need something, I’mma get it for myself\nCause I’m the only person thinking ‘bout me\nIt’s getting hard to be me\nEverywhere I go, somebody’s looking at me\nAnd if you gon’ compare me at all best compare me to myself\nCause I’m the only person fucking with me!\n\n[Verse 3]\nYelawolf, Hi my name is\nPresident O' Bama, I’m so shameless\nI’m taking it all, so what am I saying?\nI’m the voice of every small town (In this world)\nLike a light in the pipe, with a mic\nAnd take flight in this life, I'm a sight\nPut a vice-grip lock on my right to fight\nDespite the way you may feel about sights and sounds\nThat I might put down, about prices found on a sack of that white\nHeaven is a place in a 7/11, I can never get away from hell\nFound hell in the bible-belt, and found love in a 6-pack on the shelf\nWent to the seashore to see more, but Leroy didn’t seem sure to me\nSo I took Leroy to Alabama, he bought the hat and bought the tee\nConverted him y’all, I gave him convertible thoughts\nWhen he saw that big buck hangin’ on the wall (Yeah)\nI’m off by a millimeter, I’m on by a million light-years and 2 liters\nA pint of moonshine, I ride in two-seaters\nTake a ride (In this world)\n\n[Hook]\nIt’s getting hard to be me\nEvery where I go, somebody’s looking at me\nAnd If I ever need something, I’mma get it for myself\nCause I’m the only person thinking ‘bout me\nIt’s getting hard to be me\nEverywhere I go, somebody’s looking at me\nAnd if you gon’ compare me at all best compare me to myself\nCause I’m the only person fucking with me!", "title": "In This World"}]}