{"artist": "Westside Gunn", "songs": [{"year": "2017-10-31", "lyrics": "[Intro: ? + ?]\nThere you go, there you go\nWhat I'm getting from this is really that feeling you were describing before about how it's a very physical act\nA big part of it is me being in the studio all of the time and you know, a huge passion of mine is to be able to\nTake it to the streets, getting that sort of feedback as I work\nIt's kind of, like, you get the people to, like, kind of bear witness to your passion manifest and, like, feel it with you or see\nAbsolutely, and they become part of the process\n\n[Pre-Verse: Westside Gunn]\nBrrt, boom boom boom boom boom boom boom, ayo\nBrrt, brrt, boom boom boom boom boom boom boom, ayo\n\n[Verse: Westside Gunn]\nMAC in the Supreme with the mic jack (brrt)\nThese niggas actin' like they ill, they ain't like that\nGator ray 6's, yay flippers, we in the cell reminiscing\nAll you heard was, \"CO, I'm hit\", they caught him slippin\nLord forgive him, robbed the dice game, bought a 100 suits\nHad the joint on 'em, ten flights, threw 'em off the roof\nHe landed on Mercer by Versace\nLast time they see me I'll be shootin' out the Masi\nGucci tearaway suits, Jesus, make two bricks out of one\nWipe your fucking prints off and we bool\nGold horse from '76, I think this Nicky Barnes shit\nUnwrap the third crystal, you know the god fish\nBalenciaga bucket shot the whole whip up, he launched it\nI make the sky gray, rain yay, Canali jumpers (boom boom boom boom boom boom boom)\nAyo, I make the sky gray, rain yay, Canali jumpers\nHollow points for throwaways\nI know they jam, but I'ma hit you five times in the gut\nHe need another rib\nFieg purple Maestros on the tight rope\nBags was 35, I had them for 32, they gave them hope\nDavey Boy Smith with no kick, with the rubber handle\nA new yacht every week, John Sanden sandals (lalalalalala)\nAyo, a new yacht every week, John Sanden sandals\n\n[Verse 2: Keisha Plum]\nIf Greselda and Adolf had a baby, he would be a little Shady\nHe would make me his lady\nRed roses and blood diamonds for his lady\nHe would let me read poetry to his enemies\nBefore he chopped their heads off\nPyramid schemes iller than Madoff\nSticky weed and bulletproof vests\nTalk slick, dump a clip in your chest\nPoisoning puppies for practice, murderous tendencies\nGiving bitches a buck fifty for fun\nPacking grenades, he's sipping Perignon\nBut it's Ace of Spades in my flute\nNo words exchanged, just give him the signal, my nigga shoot\nJapanese denim and Fendi ankle boots\nCoconut color Carreras\nA hundred for the lipstick, fifty for the mascara\nFour-hundred on something see-through from the La Perla\nSkin and hair scented in Clive Christian, number one\nBaron spectacular, he knew fucking her would be dangerous fun\n\n[Outro: ? & ? & ?]\nTell her, tell her\nCan I get my 75 cents?\nTell her, tell her again\nDamn, he gon' give it to you\nNo, I need 75 cents out of you\nI got you\nOoh, lemme see that [?]\nI want it outta her\nWhat you need to do, is you need to tell her-\nGuess what, guess what. I got the [?] and I want [?]\nSay it, say it again\nGive it, give me my 75 cents and I'll show you how I go brrow, he haw, he haw, he\nWell, how much, how much?\n75 cents\n[?] this bitch\nYou gon' do all that under what?", "image": "https://images.genius.com/6f088af884ee0598899d8d3e40397a00.275x275x1.jpg", "album": "Hitler Wears Hermes 5", "title": "Hebru"}]}