{"artist": "Warren G", "songs": [{"year": null, "lyrics": "[Hook]\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?\n\n[Verse 1]\nLet me tell you bout the village where I dwell, it's a...\nLiving hell still tryin to make a heaven outta this right here\nWatching fo' the postman hopin fo' paper\nPlease stop the bus mister driver, wait up we got...\nRock fights where the dead end meets\nThe stop lights is out so it's dead in the streets\nThe countyline look long, but I'm kinda hungry\nSo I pack a sack lunch, and got on\nLate for class again, it's half past 10\nAnd moms gonna whoop ma ass again\nNow and then I get the feelin that the world is mine\nI start sittin back watchin time fly by\nBut uh, I'm so proud to say\nThat the ghetto is the reason that I'm loud today\nAnd you come get a glimpse of what's happenin\nSee for yourself how it is where I live at\n\n[Hook]\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?\n\n[Verse 2]\nIt shouldn't take long to see, the place that belongs to me\nIt's all good, ain't nothin like home to me\nNo Diplomas but I, got some knowledge out of\nMy other partners that made it up outta here\nAnd now not a whole lot of us get rich\nBut like the old saying goes \"Ain't life a bitch?\"\nAh shit, the Landlord just raised the rent, fuck that!\nDem old days that came and went like this\nThere's more ways you can use your time instead of\nLooking for shit that you used to find\nBy the age of 16 ya finally come to grips\nLivin life like this and nothin else mean shit\nLooking for a smooth getaway\nCool, cuz soon I'll see a better day\nAnd if not - then I gots to deal with it\nI ain't makin this, up hell naw it's real nigga\n\n[Hook]\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?\n\n[Verse 3]\nNo more suprises hopin I can open your eyes\nAnd so I'm trying, instead of lookin up in the sky\nI'm in the fast lane speed dreaming\nNappin on cruise control please believe it!\nIn my city when you see it at night, look different than it does in the day\nAin't no tellin what'd happen if it wasn't this way\nI ain't trippin off of shit it's a good thing\nI made a name off the local neighborhood gang\nAnd at that time I started rhyming\nAnd, set up a hill without help to start climbing\nAnd I've been around this for a minute\nYou gotta get your own mix and get wit it\nI made myself, learn to pay myself\nNigga the game don't wait so I'ma stay myself\nAnd now you can go and tell another nigga\nOn how the real ones is livin in the ghetto\n\n[Hook]\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?\nWould you like to go with me, down my dead end street?\nWould you like to come with me, to village ghetto life?", "image": "https://images.genius.com/0b2cb81a248357890a0f837ed5dc331a.1000x985x1.jpg", "album": "Return of the Regulator", "title": "Ghetto Village"}]}