{"songs": [{"image": "https://images.genius.com/a850400541f0d88c618c08586a9713e4.503x503x1.jpg", "lyrics": "[Verse One]\nLand mines wheel chairs toilet snakes\nI'm rolling downhill on broken brakes\nHit it like a squirrel when I fuck rapping\nWear a Fallopian tube as a necklace fuck platinum\nAnd fuck having nice cars suck my dick\nI wanna blow up to get my bike fixed\nAhhh they put a probe in my urethra\nThe free clinic test hurts worse than the disease does\nMy mouth is mechanical\nI'm a flesh-eating serial killing stuffed animal\nMac Let lactose\nHit'em with a missile launcher cock like Orgazmo\nDark divine type of charcoal mind\nI like chicks that shave their pussy in a heart design\nKansas Citys crazy I'll be walking up the street\nAnd get my arm chewed off by octopus with teeth\nI'm in my laboratory building a disease\nMy wife has a tail and our children grow on trees\nPoke my brain until my fingers purple\nPull the wrecking ball chain off a crane and swing it in a circle\nPut your tongue where the mic gets plugged\nI got antennas and a slimy body like a slug\nI'm not even old enough to get into the club\nSo I'm with this rolling chick sniffing Vick's vapor rub\n\n[Hook]\nMr. Mac Lethal whatcha want to do today\nProlly pass out drunk in the street\nMr. Blockhizzle whatcha want to do today\n(He's not on the mic bitch he's on the beat)\n\n[Verse Two]\nFuck Krys we pop bottles of Windex\nMy name is Mac Lethal king of the midwest\nAnd that's Blockhead you know about him\nYeah ha he's, he's the champion\nAhh, Mr. Blockhead supplies me the ammunition\nAnd I lick the beats pussy and give it an orgasm\nMy pen is filled with Lava lamp liquid\nI'm sicker than those punk rock Gothic damn bitches\nSitting up at Perkin's with black nail polish\nLike \"You got a dollar, man?\" With their fishnet stalkings\nLips bless intoxicated cocky humans\nGrab an cup of ice and fill it up with body fluids\nIt takes one Catholic school girl to please the whole crew\nShe'll be riding home in the trunk when we through\nPsycho bitches, yeah they love to prick the cock\nLike putting Hellraisers skull in the fucking scissor lock\nI never even make it to the club\nI'm wasted by eight standing in the tub\nWith pajamas on I pull the hairdryer off the cabinet\nAnd plug it into learn electrical safety by accident\nI salivate your moms stench\nOn the dance floor playing hockey with a urinal mint\n\n[Hook]\n\nGet a mermaid naked get loose\nAnd fuck champagne we drinking vaginal juice\nAt the mermaid party six thousand, ha ha yay\n\n[Hook]\nHey yo, yo why do you always ask that\nYou know I'm gonna beat the shit out of you if you as again\nI'm on the mic not him...", "year": "2002-01-01", "album": "Men Are From Mars, Porn Stars Are From Earth", "title": "Mermaid Pornography"}], "artist": "Mac Lethal"}