{"songs": [{"lyrics": "[Produced by 9th Wonder]\n\n[Intro: 9th Wonder]\nMan you know, I don't think we decide our own legacy. To be honest with you. When you leave the game or you leave this earth, people will decide a legacy for you. We're just here to do what we're supposed to do. Everybody else will decide what was your legacy, he was this or he was that, or he did this he did that. People are gonna decide that for you. You have no control over it, you know. I just wanna make the best music I possibly can and that's in my realm uphold the culture of hip hop cause so many people my age have abandoned it. Maybe cause their lack of knowledge about it whether to uphold the culture of hip hop, cause it is my culture. And, uh, that's about it\n\n[Background voice]\nYou are a storm\nYou are a storm\n\n[Hook: 9thmatic]\nUh, I'mma make it big\nUh, I'mma make it big\nThey said I wouldn't make it big\nI'mma make it big\nLike Tom Hanks nigga I'mma make it big\n9thmatic and 9th Wonder\nI'mma make it big\nYea, I'mma make it big\n\n[Verse 1: 9thmatic]\nMatic, 9 one of the best two on test\nI was like the freshest lil nigga in sixth grade\nUsed to rock Jays, Gazelles and tight fades\nSeven grade came, I jam to Public Ene'\nMe and the homies, the classes that I was in a\nCircle for a square then eight grade was here\nNinth grade came and I was like \"yeah!\"\nFreshest lil nigga became a freshman\nFan of the DOC and X-Clan\nJ brother P you ready for tenth grade?\nSophomore b-ball team that I made\nMade out with a girl that was in my grade\nWith the green eyeshade and the patent leather shoes\nJunior year time came the real good news\n1080 SAT score yeah dude\nN to the C to the C to the U\nDurham 85 exit 172\nIt's senior year, what the hell you gonna do?\nStay around here and work a nine to five gig?\nNah homeboy, shit, I'mma make it big\nLike Tom Hanks, nigga, I'mma make it big\nNah homeboy, shit, I'mma make it big\nNinth 9thmatic, shit, I'mma make it big\nWonder wonder 9, shit I'mma make it big\n\n[Verse 2: Khrysis]\nI'm on that supercalerfragalisticfragonago bullshit\nWith more lines to the word than your tagonago pulpit, church\nYoung Khrysis the rebel\nI get down do my dance on instrumentals\nAnd blast that beat slamming on cats like heavy metal\nDon't try this at home kids get on my level\nHuh, we don't ever ever settle\nWack niggas try and tuck us they some Brokeback fuckers\nAin't got time for them suckers, I work too hard\nYou wanna take mine, well, hardy har\nIn your dreams this ain't easy as it seems\nBeen doing this since the teens\nYou can say it's in the genes\nUncle on the sax, granny singing in the opera\nRest in peace Uncle Mark tourin' with the gospel\nGroup that he started, he was living out his dream\nThen he passed it on to me, I told him I'mma make it big\nSaid I'mma make it big\nKhrysis in the booth and I'mma make it big\n'Matic on a tranic and said make it big\nYeah nigga I'mma make it big come on\n\n[Verse 3: 9thmatic]\nBig boy showing style get a pancake\nSyrup type sweet on the beats I made that\nLike [?] said \"'ey yo pimp, it's Threat!\"\nThen Jay start spitting and I was like \"Yes!\"\nAnd Jay called 9th, \"9th wonder of the world\nWe need some beats\" so then we did \"Girl\"\nAnd \"Is She The Reason\" and then \"Game Over\"\nOverseas international bonjour\nTour with R Kelly and Jay got jumped off\nJigga man stayed and Kels got kicked off\nMary J jumped on tour, now who knew?\nThe very next year I'm on The Breakthrough\nThank you 9th Wonder she said, \"ode to two\"\n\"Good Woman Down\" with a Grammy nigga ohhhh\nNow here comes Badu\nHoneyyyyyy Yeah you know the tune\nYou so sweet nigga sweet like syrup\nBack to the syrup then Luda was like \"Wake up!\"\nAnother 9th banger with Common on the jam\n1989 \"Do The Right Thang,\" bam!\nSal's Pizzeria type pieces like big\nYeah home boy nigga I'm a make it big\nI'mma make it big\nI'mma make it big\nYeah 9thmatic, yeah I'mma make it big\nI'mma make it big", "title": "Make It Big", "image": "https://images.genius.com/8d727a22a4d1d05ff7dc9a2ed5ca0c53.1000x1000x1.jpg", "album": "The Wonder Years", "year": "2011-09-27"}], "artist": "9th Wonder"}