{"artist": "Bow Wow", "songs": [{"album": "Wanted", "title": "Fresh Azimiz", "year": "2005-09-30", "lyrics": "[Verse 1: Bow Wow]\nWhen I was 8 I was rhymin not backyard game playin\nWatchin Snoop anxiously and waitin for my chance man\nHot and cocky wit it cause I kno that I am man\nI'm goin down in history like American Bandstand\nI stay fresh to def like the neighborhood dope man\nI stay on the top cause I keep comin wit dough man\nYou steady watchin stealin but there ain't no hope man\nYou dealin wit somethin bigger than the US Open\nAnd ain't no jokin\nFresh like fatlaces and dukey ropes and I keep on smokin\nYoung but I'm ready so that means I'm strokin\nLook at me now days girl a dawg is pokin\nAddicted to it J.D. say I got it bad\n18 nigga makin more than yo dad see\nThey think they doin it but I'mma out do 'em\nIf you know somebody like that pull up and say to 'em\n\n[Hook: Bow Wow] + (J-Kwon)\nYe ain't ridin (ye ain't ridin)\nYe ain't bumpin like I'm bumpin\nYe ain't sayin nuthin homie\nYe ain't fresh azimiz\nYe ain't got it (ye ain't got it)\nYou don't keep it Doug E. like I keep it Doug E\nLil buddy you ain't fresh azimiz\n\n[J-Kwon]\nYe ain't big (big) whippin\nYe ain't steady tip tippin\nNo girl gettin homie\nYou ain't fresh azimiz\nThink ye iz (think ye iz)\nBut cha ain't (but cha ain't)\nThink you can get it crunk like me but you can't\n\n[Verse 2: Bow Wow]\nNow every record that I make I'm tryin to get up out the store man\nEvery car I drive I'm tryin have you sayin whoa man\nFourth album comeback power like rogaine\nRecords say Columbia but I'm So So man\nI stay on my grind bringin in that dough man\nFrom records to movies now a TV show man\nAnything given to me I'm gon rep man\nBig house, big cars what you expect man\nJust to get a glimpse girls breakin they neck man\nBlinded by the light glistenin off the Breitling\nBow hot as ever I ain't lost no step\nStraight t-shirt, sneakers I ain't tryin to go prep\nLike these lil r 'n' b groups that need my help\nWish they had my style wish they had my rep\nBut oh no, you'll never have it like me man\nAnd if you can't understand this is what I'm sayin\n\n[Hook]\n\n[Verse 3: Bow Wow]\nI got a spot in M-I-A to get away from the cold weather\nTalk around town as if I'm wit Ciara\nBow fall off nigga that'll be never\nI'm rich (yea I'm rich) I can do whatever\nI get a kick outta shuttin suckas down in the parkin lot\nEspecially when they tryin to stunt thinking they hot\nAll out the window talking loud like they runnin my block\nThat's when I come through (come through) and all that stop\nAnd ain't another younger keep it fresh like dis man\nEvery year, same time come wit them hits man\nTired of makin girls fall out wit a kiss man\nWell listen and you're stuck music just like quicksand\nOlder people say that lil young dude sick man\nYoung A.I. and we crew thick man\nDifference between me and you is you be bricklin\nAnd I ain't never ever done that before (no)\n\n[Bow Wow]\nYe ain't ridin (ye ain't ridin)\nYe ain't bumpin like I'm bumpin\nYe ain't sayin nuthin homie\nYe ain't fresh azimiz\nYe ain't got it (ye ain't got it)\nYou don't keep it Doug E. like I keep it Doug E\nLil buddy you ain't fresh azimiz\n\n[Hook]", "image": "https://images.genius.com/c31e82700b0078d6105302d26898085a.500x500x1.jpg"}]}