{"songs": [{"lyrics": "[Intro: Action Bronson]\nAyo Al, aye Al\nDanny get the car\nWe gotta get the fuck outta here Dan\n\n[Verse 1: Danny Brown]\nMurder, death, kill pull a 187\nIf you ain't gon' give it motherfucker I'ma take it\nBoy I'll turn ya' to a raisin\nJust to bring home the bacon\nFor me to see heaven I would need to meet Satan\nSo my heart so vacant\nMy mind's on some \"take shit! break shit! spray shit!\"\nHit you broad day shit\nFace-lift braces, unsolved cases\nHittin' up the witnesses so can't nobody say shit\nI think the reaper callin'\nPicked up the phone and said\n\"I got a couple coming\"\nCause blood in my eye and I'm thirsty for death\nFor the paper you’ll fo' sho' be walking up heaven’s steps\nGot a getaway driver, just chillin' in a stolen\nParolee with a 40 that'll take what you owe me\nCause I'm no herb\nAnd the last thing yo' ass wanna hear is these words\n\n[Interlude]\n(They've seen us already man)\nGuns are in the trunk\n(What are we gonna do they've seen us)\nMoney in the seat\nGuns are in the trunk\nThink they come and get us, never\n\n[Verse 2: Action Bronson]\nUh, the white OJ in the hallway\nThe long .44 spray\nOne leg up on the Velour grey\nGettin' straddled while I'm eatin' strudle\nWe fuck you up so bad that you will never take a normal doo-doo\nOr a pee-pee, bedridden\nNow I'm laughing while head is given\nNo fucks are given ever cause I'm rotten to the core\nYa-ya-ya-ya-ya-ya right into the door\nAah, cross the street when you see us by the store\nI'm off the leash, dick hanging on the floor\nBox cutters rolled up in the waistband of the 09's\nYou thought you had your little shit\nFigured out, but no mas\nMy bitch will choke you out with strong thighs\nStrong features in the face from the winny\nSmokin' dope, doing 360's in a Mini\nShe half Dominican and Trini\nBad news", "title": "Bad News", "album": "Radio Los Santos [GTA V]", "image": "https://images.genius.com/2680b469ad4094f67d48fef549174459.1000x1000x1.jpg", "year": "2015-04-14"}], "artist": "Action Bronson"}