{"songs": [{"title": "Only as Good as Goodbye", "year": null, "album": "2Mex", "lyrics": "[*Answering machine message*]\nHey what's up yo this is Alex\nHey hey thank you for the email\nUh you got the flyer already then?\nOk you know cool cool good good\nI'm coming in today I'll be there like at 5\nGo to the venue meet me at the venue\nYeah I miss you too its been so long\nSee you there bye\n\n[Awol One]You got one night in town break out\nOf the ground baby doll are you down\nOnly got one night in town\nBaby doll are you down\n\n[Verse 1: 2Mex]\nHey yo thank you\nFor coming out to the sound check\nI haven't even started running around yet\nWe just got here not to long ago\nIs it me or did your hair get longer? No?\nWhy do you still think we met on the legends tour\nI know I met you before that I'm just not sure\nI think I met you on the flow and tell\nI think we just said what's up to each other we didn't know each other\nThat well\nAnyway\nWhy don't you take me away for part of the day\nI'm down if you roll a j\nYo just take me away from this tour van\nI'd love to walk around the city holding your hand\nSo is it all right if I stay with you so\nI can pocket the money the promoter gave me for the hotel\nCool you're the best\nNo ones gonna take that away from you yes yes\nSo what up now I heard you have a man now\nHey that's cool whatever\nI understand how you get lonely yo\nBusdriver told that on the other tour you came to his show with some homie\nHey that not your man no more?\nThat not my business what happens\nI'm just letting you know I know that it happened\nHey I know your in the mix\nDon't front it sucks we only get to kick it once\nEvery 6 months\nLets not talk about that tonight\nShoot me back to the venue cuz I got to go rock the mic\nYo really though\nI got to get to work\nBut its so cute you came to my show wearing my shirt\nNo I don't think that your stalking me its funny\nHow you chased away the only other girl that wanted to talk to me\nBut for real though its cool\nAll the love an affection your giving me is cool\nThank you\nFor all the drawing pictures and letters\nThank you for letting me kick it with you tonight whatever\nYeah I know you wanna talk about that song\nI haven't thought about it in so long\nI don't know if you like me or just my music\nI like looking in to your eyes just like a muse\nIts an even trade\nBelieve me if I could I would have stayed in a room we haven't made in the shade\n\n[Awol One]\nYou got one night in town break out\nOf the ground baby doll are you down\nOnly got one night in town\nBaby doll are you down", "image": "https://images.genius.com/1ef89fa326d5eee915df867494b6233c.700x700x1.jpg"}], "artist": "2Mex"}