{"songs": [{"year": "2005-09-13", "image": "https://images.genius.com/8f42b22ec5549467826fbd0c750ab571.450x450x1.jpg", "title": "What’s Really Real?", "album": "Who’s Hard: Gang Starr Presents Big Shug", "lyrics": "[Intro 4x: Scratches by DJ Premier]\n\"The real\"\n\n[Verse 1]\nIn this rap game, you ain't never been able\nYou've been slapped in the face and kicked under the table\nAnd I don't even know how that feels\nI'm too quick to flex the steel upon you dead off your heels\nYou's a millionaire, I'll say that's fair\nWithout that hip-hop yeah, you's a motherfucking square\nYou pay niggas just to calm your fears\nBut step aside when you see real niggas here\nAnd your man is a comedian\nThink I remember him upstate, his name was Zan\nHe was intrigued by the drugs and the steel\nBut had no idea on what's really real\n\n[Hook]\nWhat's really real?\nWhat's really real?\nYou don't know\nYou don't know\n\n[Verse 2]\nLook at your bank account, now sit your ass down\nLook in your child's eyes, now sit your ass down\nLook at your record deal, now sit your ass down\nCause you're really starting to look like a motherfucking clown\nWant us to think that your big killa killa\nBut you rich now, plus you soft as a pillow\nLeave that real shit for the niggas in the street\nCause you just raw meat, and we just ready to eat\nI'll slap you with this barrel to see how you feel\nCause you have no idea on what's really real\n\n[Hook]\n\n[Bridge]\nWhat's really real?\n\n[Verse 3]\nI harras cats get baby niggas cradle capped\nSuckas get back slapped, this is the real rap\nYou's a pathetic cat, tryna wear your man's cap\nYou ain't never seen or heard the sounds of a gun clap\nYou's a coward with a pen, hide behind your song\nYou's a bitch with baggy jeans, hide behind your thong\nYou's gay without the Marvin, let's get it on\nPull back to squeeze, nigga you're gone\nAnd I hope your man still hold you down like Alchemist\nBut I know he won't, cause you straight up bitch\nPreem is real, Shug is real, the music's real\nLook at your man, now tell me, that nigga's real?\n\n[Hook x2]\n\n[Outro]\nYeah what's really real?\nBig Shug\nI'm out baby"}], "artist": "Big Shug"}