{"songs": [{"title": "Addicted (Mary Jane)", "album": "I Need Mine $$", "year": null, "image": "https://images.genius.com/ec6fd0ec1dc958208ad742d28e069f81.800x800x1.jpg", "lyrics": "(*Talking*)\nYeah, I wrote this song for Mary Jane\nIt's only one bitch I trick my dough fo'\nHaha, a lotta y'all niggas spendin y'all money foolishly man\nInvest in that Purple Haze, that Train Wreck\nThat Capiss, knawI'msayin\nIt'll have you right,oh boy\n\n[Chorus] - 2x\nI be smokin on that Mary Jane\nDo you be smokin on that Mary Jane? (I wanna know)\nSee I'm addicted to that Mary Jane\nAre you addicted to that Mary Jane? (I need mo')\n\n[Verse 1]\nAy, the first time you let me hit I really wasn't with it\nNow look, I need yo' ass every minute\nI wake up early, fiendin for a big blunt\nPlus tonight, I got a show in Romant\nI know you heard about the Dirty, we so crunk\nGimme a swisher fill it up, with Super Skunk\nThat Hash Flynt got me swervin when I drive\nEven when my money low I find a way to get high\nIf you a bud smoker, come blaze with me\nHave a cup of lean, now you feelin dizzy\nYou know I gets busy, chiefin back-to-back\nAbout to cough up a lung nigga hit that\n\n[Chorus] - 2x\n\n[Verse 2]\nAy, go get a highlife, this weed messin up my eyesight\nAt night time I can't drive right\nYou wanna feel what my vibe like\nThen put 28 grams, in my pipe, I bet it get you right\nAnd fuck what you heard, weed is the best thrill\nSo lil' mama you can keep them (X pills)\nCali got the best kill\nBut Amsterdam got everything all year, huh\nAnd you can smoke on the streets, watch my DVD\nI'm in love with W, E-E-D\nPlease pass the blunt, don't hold the blunt\nCause if the laws come, you gon be the first to run, bitch\n\n[Chorus] - 2x\n\n[Verse 3]\nAy, ay, this last verse gon be short as fuck (why?)\nCause Verse 1 I had a ounce (but I smoked it up)\nGot game from the OG's (and I soaked it up)\nIn three years, three albums (I'm platinum plus)\nNow I'm coppin Blueberry like it ain't no thang\n(But not on Tuesdays and Thursdays) cause the people swang\n(And why you chokin my nigga?) you can't handle it\n(Well take this, gimme that) smoke a cancer stick, trick\n\n[Chorus] - 2x\n\n(*Talking*)\nYeah, if you in yo' whip rollin, even if you ain't a baller\nEven if you gotta roll up one of them small ass little-bitty cigarillos\nDo what you do man\nOver here we ball outta control man, fo' real man\nWe take two blunts and put them sideways to make them fat\nThen we take another one and put it the other way to make it long nigga\nYou ever put a whole ounce in a bone nigga?\nHave you ever been to Amsterdam nigga?\nYou ever smoke Purple Kush, Purple Haze, OG Kush\nMaster Kush, Train Wreck, Maui Waui, all that shit man?\nAh man, we do it big man\nWhite Widow, Triple X, Sweettooth\nSometimes niggas be havin sweetooths man\nHaha, youknowI'msayin\nWe ball outta control baby\nAnd don't hate on me man, cause I smell like that doja\nAnd you smokin on that Bobby Brown\nUh, yeah"}], "artist": "Lil Flip"}