{"artist": "Asher Roth", "songs": [{"title": "DEY KNOW ASHER", "image": "https://images.genius.com/37ecaf6c9555728334720ebfc29f7ffa.950x950x1.jpg", "album": "The Greenhouse Effect Vol 1", "lyrics": "[Intro]\nOh my god yeah, oh yeah, oh my god yeah\nThis is awesome, so awesome, Cannon\n\n[Asher Roth]\nThey know me this, yo I spit like a little kid\nRap thinks I’m a dirty hippie, icky\nHarry Potter, don’t you try nothing tricky\nMuggles befuddled by my wizardry\nPancake misery of all any beat\nI am instinctively syncing my energy with the high heavens\nSecretly developing a brand new pedigree, specialty, a better me\nI essentially must defeat what is left of me\nThe evil me, may you rest in pieces\nRecently deceased, I believe that world peace is easily in reach\nIf religion is decreased, eh geez\nI don’t believe in Jesus, does that mean that I am a demon?\nCouldn’t God and Allah have the same meaning?\nGiving someone something to believe in?\nCause these days between the TV and what I read\nI don’t foresee a brand new way of living in the U-S of A\nDo us a favor, I think we need to smoke some weed\nYes, excuse me waiter, where are my capers?\nFor real, I don't wanna be a pain in the ass\nBut I wanted some capers on this salad, yeah boy\nAnd we act like they know but it’s clear that they don’t\nSo we bitch and we moan it won’t switch till we vote\nAnd pick a new leader for the new year\nYes we can, did you hear? That’s the new cheer\n2012, did you hear? That’s the new fear\nSo oh well, roll a blunt, get a new beer\nAsh be the truth, sorry yo, I’m new here\nDid not introduce me, I am so rude\nArrogant shoes, hell yeah, they be a new pair\nHell oh well, tell me who cares\nWho dares to play musical chairs with the fair-skinned Farrah Khan of hims?\nI am sitting, sticking my one dick in writtens\nA Maryland terrapin, American lyricist with a pen\nThey call me a terrorist cause I can embarrass the top ten\nI guess I am Clark Kent, Ash Roth uh, add me as a top friend", "year": "2008-06-15"}]}