{"artist": "Prodigy of Mobb Deep", "songs": [{"album": null, "title": "Warning: I Don’t Fuck With Prison Surprise (Excerpt From Commissary Kitchen)", "image": "https://images.genius.com/d18050987bd2343e1afe5f9c4c3cb7ef.300x300x1.jpg", "lyrics": "When I first got to Rikers Island, I met this one dude. I forget his name, but he was a little Guyanese kid. He knew one of my mans on the street, and was like, “Yo I know so-and-so!” And I was like, “Aight, wassup.”\n\nSo he was cooking and he was like, “I want to show you how to make this shit.” He was right about it being “shit.” It’s called Prison Surprise in most prisons, and inmates modify it however they want. So I tried it, and it tasted like shit. Then I went to lay down and go to sleep hours later. All of a sudden I was feeling nauseous.\n\nI was like, why am I feeling so fucked up? I started sweating, like I was sweating bullets! I’m like yo, what the fuck? Why I’m sweating like this? Then I just started throwing up. I ain’t know what was wrong with me, but I figured something must have been in that food I just ate. I caught the ill food poisoning or something real quick, yo. So I threw up like three times, and then they took me to the infirmary and just gave me an IV. That was my first day there!\n\nAt that point, I was like, I’m never eating somebody’s creation ever again. Don’t make me nothing. A lot of people fuck with prison surprise. I’m not one of those people. But if you wanna be stupid enough to try it, I have the recipe for you.\n\nP’s Don’t Try\nThis At Home\nPrison Surprise\n• Ramen noodles\n• Doritos (you could also substitute with Cheez-Its or sliced cheese)\n• Jack Mack (tuna works fine too)\n• Hot sauce\n\nOpen the can of Jack Mack, and rinse the fish off gently. Take a bowl of water and microwave it for a minute or until it boils. Throw in Ramen noodles and stir it. Grab the chips and crush them up until they’re a fine powder and mix them in with cooked Ramen noodles. It’ll make like a cheese sauce. Throw in the Jack Mack, and then you eat it. Good luck, yo.\nFrom commissary kitchen: my infamous prison cookbook published by Infamous Books.\n\nYou can download the audio version of commissary kitchen: my infamous prison cookbook for free on Amazon", "year": null}]}