{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "R.I.P.", "title": "Great Spitters", "image": "https://images.genius.com/b7b5106532f23217d46a0d126c3da364.800x800x1.jpg", "lyrics": "[Hook x2: Prodgy & Cory Gunz]\nRapping is my religion\nBrings me the finest women\nGives me them eight figures\nCause we some Great Spitters [Prodigy]\n\nRespect that M O B B\nD Double E P\nReal rap, real shit, real spit\nNiggas pray when they see me [Cory Gunz]\n\n[Verse 1: Prodigy]\nIt's that real conversation, my mu'fuckin' occupation\nHitman I body that with a contiac, with a track, I slay it\nWith a little bit of grass, little bit of class\nLittle bit of brashness I mix it up, till it's just enough\nTo have me on that best rap list\nIt's that empire state shit, where we love the entire nation\nNiggas that want to stunt on us, they deserve to die, don't try my patience\nPaint prov, like a bass kick, thank God, I erase this, big boy to head boy\nTake that as a fuckin' favor\nI know, I know, I know, you niggas think P be poppin' shit\nAnd probably don't know that everything P be poppin' is\nLouder than words, my niggas ain't clowns, we not herbs\nI bounce yo head off that curb, I'm just a rhymin' expert\nWhat you niggas want me to be, your Grim Reaper see?\nI can see through you snake ass eyes\nAnd you know misery loves company, and they hate when they see me shine\nSee these dimes, see this cash, see me on tour with the infamous\nI'll see you in hell, my gun ring bells, puts all that bullshit to rest\n\n[Hook x2: Prodgy & Cory Gunz]\n\n[Verse 2: Cory Gunz]\nI've got niggas on lock, doin' time\nCleanin' Mac's, right off the block, movin' dimes\nWho wanna ride, where to?\nChicks told me I'd be there in a year or two\nGoin' at the mall, corners appear poof\nDeath is just around the corner, it's here too\nGot a little brother, I'mma give a better life\nBeautiful little girl's I'mma put to bed at night\nI was 12 in the kitchen, when they let in white\nR.I.P. my nigga Beretta Mike\nI'm affiliated with the renegades\nI don't got juice, pop you, now I'm Minute Maid\nIn the bucks we trust, when they lust me\nI'll be givin' a fuck to dust into disgust we bust\nMom left me, she was too young, she would've kept me\nStill wouldn't be able to run, bad-ass loud tell a nigga to hum\nDessert too hot nigga eat wit ya tongue\nMilitia, Mobb Deep, YMCMB, I'm done\nLike Charlie, see me have a gun\nTell an old girl, party with a nigga til' one\nShe got a body, harder to beat on a gun\n\nI got keys to the spot with a G and a Pump\nD's on the block just screamin' to jump\nP tell 'em stop 'fore I be in the front\nWhen niggas get caught, catch me if you want (x2)\n\n[Hook x2: Prodgy & Cory Gunz]", "year": null}]}