{"artist": "King Los", "songs": [{"image": "https://images.genius.com/af979fd34aa3f95d652a83f4bdfdf39a.538x538x1.jpg", "title": "American Gangster", "year": null, "album": null, "lyrics": "[Los]\nListen okay, last time I Hustled Hard ‘cause rappers just pussy\nAnd The Crown Ain’t Safe in the hood, what’s goody?\nUh, I picture my goal, picture this go getter. Y’all niggas is slow\nI’m pitching this no hitter. No nigga paint pictures with this fly repetition;\nDon’t I paint the perfect picture like it’s high definition?\nI’m too Jurassic, future classic, class-act, Louie backpack - do the math\nBitch, don’t make me black ‘cause it’s ugly. I’m back on my study\nLoosen up the snap backs, back to the skullies\nMake me flashback to the Lacs and the Cudi’s\nDon’t make me relax, and run laps around dummies\nRelapse, he’s back, it’s a wrap for you mummies\nWeak rappers, ease back to the background for me, trying to handle more biz\nSo I can get that Rolls(Rose) on them 23’s - something like Amber on Wiz\nCrown ain’t safe, so all you niggas screaming out you \"got next\"\nTell them I said now it ain’t safe! I eat off rap, I eat rappers\nKeep snapping, so keep slacking, I’m lap running and speed bagging\nHeavy bagging, body hooking and left jabbing\nMake you miscount an attack, then I step back in it’s one hit, two hit\nThree, hit you four like a one dick, two chick, threesome these whores\nOne watch, two chains like a three degree breeze\nI’m the one air like the 23’s on my sneakers!\nIt's a lot of Big K.R.I.T.(c)'s every time the kid blink, another comment\nTalkin the Kid’s Ink. Fuck y’all think? I get the job done\nI ain’t make XXL but they can’t God(guard) son, it’s game time, y’all pretending to ball\nI got a flow that school boys, no Kendrick Lamar. Oh, let me stop it\nI’m just killing every topic. I ain’t dissing, I ain’t bitching if a nigga dissing me\nI don’t know ‘cause I ain’t listen, I ain’t missing, I ain’t missing\nI’m the nigga with a mission, got a plan and a vision\nI want the crown, you don’t understand that? Fuck it, I want the ground\nNiggas run around blocks, I run the town\nI don’t chase a dream nigga, I hunt it down and never close an eyelid\nNever met Los, you never known fly shit, but try this on;\nSee how its fitting you could never be number two so see, I ain’t shitting\nYou could only be number one and I see why it’s pissing you... off\nSoft niggas lack the backbone and the heart, you don’t even act grown in your thoughts\nIn this movie the nigga that act wrong get the part(Depart), hope we can take two\nNo \"Drama Queen\", you'll get director cut, I don’t mean behind the scenes\nI’ve been doing this shit since Francis and Yao Ming, 80’s baby, fly on the low life\nTracy McGrady’s eye on the low, when I had gold teeth and I was high on the 'dro\nAnd my big homie had a whole pie on the stove. Had my eye on the goal\nHog tie on the floor and even when I ain’t drive, I walk fly on a ho, Los!"}]}