{"artist": "V-Nasty", "songs": [{"title": "All The Money", "year": "2013-10-16", "lyrics": "[Hook]\nI got all the fuckin' money in the world right now\nSo I'm all up on yo girl right now\nAll this fuckin' money don't know how to spend it\nFuck it my team winnin' so I throw a couple millions\n\n[X2]\nSaid that Maybach I'm in it\nCredit card no limit\nBad bitches be grinnin'\nFuck yo ho, we winnin'\n\n[Verse 1]\nRolex on my wrist, 40 on my hip\n50 round my neck, 60 hoes on my dick\nWe all got Benz, you ain't fuckin' with my clique\n\n12 our flights so you know I'm takin' trips\nRich forever like I ain't never goin' broke\nBillion dollar bitch that you'll never get to know\nCame from nothin', straigt up out the O\n\nMillion on my mind, man you know this kid go\nMaybach I'm in it, you could call that livin'\nCredit card no limit, I just bought out True Religion\nMy whole team winnin' so you know we all on\nJust bought a whole street, my money still on\n\nBought a new [?] gave the keys to moms\nG5 jets, takin' trips to Mars\nWhat I'mma do with all these cars?\nI don't know, I'm on one\n\nGet money on deck\nB-bitch I'm only 21\nYou better ask about me\nDon't fuck with too many fake hoes\nSo bitch get the fuck from 'round me\n\n[Hook]\n\n[Verse 2]\nI parked the all black Phantom, at the all white Mansion\nYour hoes stay be active\nAll them hoes is ratchet\nFuck the law enforcement!\nI'm looking for endorcement!\n\nBrand new Lamborghini, bitch I'm ridin' in them horses\nMoney talk to the ceiling, your must have a shortage\nShoes $1500, and yo ass can't afford it!\n\nI'm always countin' money, said I always got a profit\nIf I ever went broke, I'd be runnin' through your pockets\nI'm a millionaire, you could call me a rich kid\nBuy new whip every month cos bitch I'm on my rich shit\nGirl you can not fuck with me unless you is a rich chick\nI'm on my Dave Chapelle shit\nI'm rich bitch!\n\n[Hook]", "album": "The Words I Wrote EP", "image": "https://images.rapgenius.com/32d15623007af77281aac2886a490083.640x640x1.jpg"}]}