{"artist": "YG", "songs": [{"image": "https://images.genius.com/46b3a8826081b1d6675c55e03a09a50e.672x672x1.jpg", "year": "2014-12-15", "album": "Blame It On the Streets", "lyrics": "[Intro]\nSuwoo business on mines, blood, Bompton Inglewood, nigga. This the mothafuckin' Woo mix, on Piru!\n\n[Hook: YG]\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back, bicken back, bicken back, bicken back being bool\nI'm just bicken back, bicken back, bicken back, bicken back being bool\n\n[Verse 1: Big Wy]\n(Woo woo!) Where I'm from you hear that, the wolves come out\nLike on Bloods, what's happenin'?\n(Woo woo!) Cause when it's on, we're front line\nAin't no bicken, the whole hood get brackin'\nI'm from the bottoms where marks get chastised\nBefore Worldstar, head ups weren't televised\nCrack sales with shoe box deposits\nHomie lived outside and the cleaners was the closet\nWork got swallowed, enemies got knocked off\nGive her to the driver have the nigga's top gone\nWork, sold for it, young niggas flocked for it\nI represent Inglewood and the whole corner pop for it\nEnemies all foul, snitch when you bust at 'em\nBut they the enemy, fuck it, still bust at 'em\nOriginal young gangsters, the ones with the say-so\nWe bicken back being bool, but on Bloods, we don't play though\n\n[Hook]\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back, bicken back, bicken back, bicken back being bool\nI'm just bicken back, bicken back, bicken back, bicken back being bool\n[Verse 2: Mack 10]\nIt's Mack 10, Blood, what it do\nI'm from the 400 block of the Q\nI put the Wood on the map, niggas say what they want\nBut thank me for puttin' the Su in the Woo\nAnd all I think about is money, nigga rollin' in that fast shit\nWhat's the next move, homie, how we get the cash, yeah?\nWater in that soft white, get to rockin'\nI'm a D-boy, never did no flockin'\nReal Inglewood nigga with a real fuckin' attitude\nBlood had a 9 but the chopper is a fatter tool\nIt's who bangin' so we shootin' out of Rovers\nAnd them 223 shells be knockin' shit over\nLay 'em down, spray the whole situation\nYou with this gangsta shit, throw up your affiliation\nI wrote the book and all the rules\nI can act a fuckin' fool but I'm bicken back being bool\n\n[Hook]\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back, bicken back, bicken back, bicken back being bool\nI'm just bicken back, bicken back, bicken back, bicken back being bool\n[Verse 3: DJ Quik]\nDo anybody remember the CPD?\nLook who outlast 'em, that's that TTP\nArabian spruce, the cranberry's the juice\nThat we drink with that vodka cause they don't make Super Socco\nThe first platinum nigga with some big red plaques\nThen Mack-10 hit the scene, that nigga had me backed\nAnd I kept pushin', drinkin', smokin' kush and\nPuttin' money back in my hood and rollin' bushes\nNow who the fuck would say that? Find out where you lay at\nBring it right up to your porch, your home, stay back\nNigga I'm the unofficial mayer, a surreptitious player\nAnd I'll burn my wallet up before I pay her, mothafucka\n\n[Hook]\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back being bool\nI'm just bicken back, bicken back, bicken back, bicken back being bool\nI'm just bicken back, bicken back, bicken back, bicken back being bool", "title": "Bicken Back Being Bool (Remix)"}]}