{"artist": "The Game", "songs": [{"title": "Ali Bomaye", "album": "Jesus Piece", "year": "2012-12-11", "image": "https://images.genius.com/7f202dac21f248f9a27882186d85a2f1.1000x1000x1.png", "lyrics": "[Intro: Game]\nGet my people out them chains, nigga\nI mean handcuffs, time to man up\nPut my hands up? Fuck you sayin', bruh?\n'Cause I'm a black man in a Phantom\nOr is it 'cause my windows tinted?\nCar cost 300 thou' and I blow Indo in it\nYou mad 'cause your daughter fuck with me on spring break\nWell, I'ma fuck her till the springs break\n\n[Verse 1: 2 Chainz]\nYeah, roll another one 'cause I'm winnin'\nIn my four-door, lookin' real photogenic\nGentleman attire, in threads that won't expire\nI'm in a class of my own, my teacher got fired\nMoney gettin' long, pussy rate keep risin'\nVersace outfit cost me 3,000\nFrom the P houses, did it from the wee hours\nSellin' that chicken; no lemon pepper, no sweet and sour\nFirst you get the power, then you get respect\nI'm gettin' so much money I can buy your bitch\nTake it how you wanna, if you wanna take it\nI like clubs where all the women workin' naked\nFell in love with a waitress—what the fuck I'm thinkin'?\nBought that ho a ring, it was for her pinky\nUhn, that's pimpin', that's slick\nGot a bottle of cologne that cost more than your rent\n\n[Verse 2: Game]\nFuck y'all mad at me for? Got a black card and a black Phantom\nWith a white bitch in Idaho, I do the same thing in (Montana)\nGot a thick bitch in Atlanta, got a redbone in the Chi\nGot two chains, they two-tone, two hundred racks, no lie\n\n[Chorus 1: Game]\nAli Bomaye! Ali Bomaye!\nI'm 'bout to rumble in the jungle in these new Kanye's\nAli Bomaye! Ali Bomaye!\nMy lawyer threw them gloves on and beat another case\n\n[Verse 3: Game]\nFuck y'all mad at me for, 'cause my belt got two G's on it?\nHer bag got two C's on it? My daughter's stroller got D's on it?\nFree Big Meech, free Boosie and C-Murder\nLike New Orleans, like Baltimore, come to Compton you'll see murders\nAnd my AR see murders, that's beef, nigga; no burgers\nI'm insane and you Usain, nigga better turn on them burners\nGot coke swimmin' in that glass jar, bitch, go turn on them burners!\nGot dope to sell in this hotel, no half price, no retail\nYou a bitch nigga; no female, I smack niggas; Sprewell\nI'm on the block like D12, I got the white; no D-12\nLike a little nigga in Africa, I was born totin' that K\nAnd that's real shit, no Will Smith and no Nona Gaye\nBut they yellin'…\n\n[Chorus 2: Game]\nAli Bomaye! Ali Bomaye!\nThank God that a nigga seen another day\nAli Bomaye! Ali Bomaye!\nGot a chopper and a bottle—fuck it, let 'em spray!\n\n[Verse 4: Rick Ross]\nI take my case to trial, hire the Dream Team\nRobbie Kardashian, Johnnie Cochran; I seen things\nI dream big, I think sharp\nInhale smoke, Hawaiian tree bark\nHumble yourself, you not a G, keep it one with yourself\nRun to niggas for help, favors I keep one on the shelf\nI got rifles with lasers, swing it just like the majors\nHit you right above navel\nNow you swimmin' in pavement\nGold medals on my neck, I call it Michael Phelps\nHoes settlin' for less, I call 'em bottom shelf\nNiggas tough on them blogs and never did nothin' at all\nOn the road to the riches, bitches not taggin' along\n\n[Verse 5: Game]\nUnless it's ass in a thong, hit that ass and I'm gone\nDisrespect my nigga Boss and I'm flashin' the chrome\nI'm wavin' the TEC, Tity sprayin' the MAC\nExtendos in the back, gonna lap\nI got a bitch that look like Laila Ali sittin' in my lap\nGot a call from Skateboard, pick 'em up at LAX\nSpeakin' skateboards, where Tune at? Fuck with him\nI'll break a skateboard on a nigga back, 2 Chainz!\n\n[Verse 6: 2 Chainz]\nSkateboard on a nigga track\nNo lie, \"No Lie\" already got a plaque\nMama got a house, daughter got accounts\nJust to think a nigga like me started with a ounce\nBad bitches and D-boys, we bring 'em out\nIf them niggas pussy, we douche 'em, we clean 'em out\nThis the voice of ghetto intelligence. If you got work\nGo to work, don't work at your residence\n\n[Verse 7: Game]\n…For presidents\nWord to Muhammad, that triple beam is heaven-sent\nRidin' through the jungles in that mothafuckin' elephant\nThat's a gray Ghost, with the ears on it\nSwimmin' through the hood like it got fins on it (Tell 'em!)\nYou know I got that work on the foreman grill\nWeigh the mothafuckas in, made another mil\nGot a nigga feelin' like Cassius Clay\nThrilla in Manilla, nigga want it, whip his ass today\n\n[Chorus 2: Game]\nAli Bomaye! Ali Bomaye!\nThank God that a nigga seen another day\nAli Bomaye! Ali Bomaye!\nGot a chopper and a bottle—fuck it, let 'em spray!"}]}