{"songs": [{"year": "2009-03-24", "image": "https://images.genius.com/a822e5595fc1eee33d5cbbfa1ae70b68.500x500x1.jpg", "title": "On the Real", "album": "Delightful Bars", "lyrics": "[E. Ness]\nFrom the depths of the sea back to the block\nLoch Ness motherfucker representing up top\nNuts in your mouth, sort of like a gumdrop\nDrum roll, be-de-de-de-de-de-de, I'm gun ho\nMy story unfolds right before your eyes\nNiggas swallow my career then read between the lines\nYou never will appreciate the vast amount of time\nThat I put into my craft, it's more than beats and rhymes\nConfined to a cell with a pen and a pad\nTo discipline the potential I already had\nTook a crack at this rap shit, go hard for once\nToo many 40 bottles of beer, too many blunts\nAs the days turn to weeks, weeks turn to months\nBeen sentenced, you knew what I was doing from the jump\nFell into a slump, climb my way up out the hole\nDamn, Devil tryna steal my soul\n\n[Hook: DJ scratches]\n\"Now I'm the average nigga in the street life God\nI try to beat trife odds\"\n\"New shit is real\"\n\"Now I'm the average nigga in the street life God\nI try to beat trife odds\"\n\n[Rapper Big Pooh]\nYo, I hear the rumors, they grow like tumors\nBut when you have humor, you learn to laugh it off\nNiggas cast you off then they toss you to the side\nI'm a backseat driver just here for the ride\nBeen sick and tired, Rapper been denied\nBut I don't care now cause I ain't scared of hard work\nRead a couple books, my vocabulary stretched\nI think it's time now to put my seeds in the dirt\nDo a track here, do a track there\n'til I attract the attention of my rapping peers\nGot a few cheers, heard a few boos\nGather up some tools, time to make a move\nTime to make news, put my name on the scene\nGet a little fame, make a lot of cream\nI'm living the dream while you all mad\nI just took advantage of the chances that I had\n\n[Hook: DJ scratches]\n\"Now I'm the average nigga in the street life God\nI try to beat trife odds\"\n\"New shit is real\"\n\"The only way I can escape is by vocals\"\n\"I try to beat trife odds\"\n\"Nevertheless\"\n\"Now I'm the average nigga in the street life God\nI try to beat trife odds\"\n\"Nevertheless\"\n\"The only way I can escape is by vocals\"\n\n[Jozeemo]\nJo' Mo cock back, squeeze at your cantaloupe\nThat you can quote, plus I'm fresh off the banana boat\nViolence is in my DNA, what can I say?\nAnd the game is the only thing I know, I came to play\nDamn right I got dreams... \"But dreams don't keep the lights on\"\nFuck being wrong, damn right I got fiends\nYeah I rap but the hood in me, I should've been dead\nBut I'm still here, God must've seen some good in me\nI ain't getting the respect that you should give me\nSo my attitude like \"I wish a nigga would\", hear me?\nDrugs, I done sold that, blocks, I controlled that\nBallers wanna shine? Nice chain! Let me hold that\nUsually I hold back but now you need to learn about me\nThose who've never hit the bottom shouldn't be concerned about me\nNon-believer number two, it's your turn to doubt me\nFire to the fuel, how the fuck you 'posed to burn without me?\n\n[Hook: DJ scratches]\n\"Now I'm the average nigga in the street life God\nI try to beat trife odds\"\n\"New shit is real\"\n\"The only way I can escape is by vocals\"\n\"I try to beat trife odds\"\n\"Nevertheless\"\n\"Now I'm the average nigga in the street life God\nI try to beat trife odds\"\n\"Nevertheless\"\n\"The only way I can escape is by vocals\""}], "artist": "Rapper Big Pooh"}