{"songs": [{"lyrics": "[Chorus]\nAll my life I wanted to get some money\nAll my life since I was born I wanna see some money\nAll my life I'm loyal, niggas love to give me money\nAll my life I told that bitch to go and get some money\nYou know that I had to take a loss to be a boss\nNo more loss, I took that shit and ran till I'm exhausted\nNinety three I smoked so much gas I'm 'bout to fall\nKnocked off your bitch like china, shooters say it ain't my fault\n\n[Verse 1]\nRunning with that paper like a soldier\nHe ate my pussy then asked me do I want a Pink Rover\nI said \"Okay, but you can't be no crazy ass stalker.\"\nBy tomorrow that nigga called me forty fuckin' times!\nCoochie dripping glo, yeah you know, I'm a dime\nAsian doll for queen, bitch that's easy like some pie\nSay my name everywhere, I bet they know who I is\nIn my gang, can't no bitches look like this\nI'm in the field I'm doing drips because I feel like Eminem\nLil' boy you just a middle man, get shot just like a camera man\nWhy talk when I got guns bitch?\nDon't beef I need funds bitch\nSneak diss you better run bitch!\nWant them problems, call my phone like a real bitch!\n\n[Chorus]\nAll my life I wanted to get some money\nAll my life since I was born I wanna see some money\nAll my life I'm loyal, niggas love to give me money\nAll my life I told that bitch to go and get some money\nYou know that I had to take a loss to be a boss\nNo more loss, I took that shit and ran till I'm exhausted\nNinety three I smoked so much gas I'm 'bout to fall\nKnocked off your bitch like china, shooters say it ain't my fault\n\n[Verse 2]\nTexas young bitch, born and raised\nHe like my lingo, I be talking crazy like \"You my slave.\"\nBitch hell nah, I don't do no minimum wage\nOnly get them grands, go and watch, they be amazed\nI'ma savage ass, young bitch my swag glazed\nTokyo and Cuban bitches strapped up with them K's\nAnd we want them M's I ain't never going back\nThey just want to see me fall, so they turnt they back\nTwo, two, three like titty\nBallpoint eight I just finessed the boy\nDumb bitch you can't finesse the doll\nTop shots, I'll blow your muffet cap\nMayo, I spread your sandwich back\nNo bitch can never say I rat\nI rather die then look at you\nI'm cocky like some bulletproof\nBitch niggas I can't be with you!\n\n[Chorus]\nAll my life I wanted to get some money\nAll my life since I was born I wanna see some money\nAll my life I'm loyal, niggas love to give me money\nAll my life I told that bitch to go and get some money\nYou know that I had to take a loss to be a boss\nNo more loss, I took that shit and ran till I'm exhausted\nNinety three I smoked so much gas I'm 'bout to fall\nKnocked off your bitch like china, shooters say it ain't my fault", "album": "Drippin In Glo", "year": null, "title": "All My Life", "image": "https://images.genius.com/5f07bc0ee61d34fd46035587b5f03d13.1000x1000x1.jpg"}], "artist": "Asian Da Brat"}