{"songs": [{"year": "2005-08-30", "album": "Late Registration", "image": "https://images.genius.com/20be4a5ccc57daf3577b7e0d12f092f8.1000x1000x1.jpg", "title": "Addiction", "lyrics": "[Produced by Jon Brion & Kanye West]\n\n[Intro: Etta James]\nYou make me smile with my heart, ohh\n\n[Hook: Kanye West, Etta James]\nWhy everything that's supposed to be bad make me feel so good?\nEverything they told me not to is exactly what I would\nMan, I tried to stop man, I tried the best I could\nBut You make me smile\n\n[Verse 1: Kanye West, Etta James]\nWhat's your addiction? Is it money? Is it girls? Is it weed?\nI've been afflicted by not one, not two, but all three\nShe's got the same thing, about me, but more, about us\nShe's coming over, so I guess, that means, I'm her drugs (You make me smile)\nJust let me peek now, I mean damn, I'm so curious\nShe's got a lover, so the lies, and the lust, is a rush\nTime's of the essence, I need, you to be spontaneous\nRoll up the doja, Henny and Co-Co-Coca-Cola (You make me smile with my heart, ohh)\nThen I'm co-coming over cause it's ne-never over\n\n[Hook: Kanye West, Etta James]\nWhy everything that's supposed to be bad make me feel so good?\nEverything they told me not to is exactly what I would\nMan, I tried to stop man, I tried the best I could\nBut You make me smile\n\n[Verse 2: Kanye West, Etta James]\nI see the emotion in your eyes, that you, try not to show\nWe get the closest when you high, or you drunk, or you blown\nSo I pour the potion, so we could both get high, as we could go\nThen I'll get the lotion, and do somethin' to me, when your thighs is exposed (You make me smile)\nThere's no turning back now, I mean I don't mean to impose\nNot now but right now, I need you to undress, and then pose\nI'm into that now, catch a vibe, when the doors, get closed\nRoll up the doja, Henny and Co-Co-Coca Cola (You make me smile with my heart)\nAnd I keep co-coming over cause it's ne-never over\n\n[Hook: Strings, Etta James]\nWhy everything that's supposed to be bad make me feel so good?\nEverything they told me not to is exactly what I would\nMan, I tried to stop man, I tried the best I could\nBut You make me smile\n\n[Hook: Kanye West, Etta James]\nWhy everything that's supposed to be bad make me feel so good?\nEverything they told me not to is exactly what I would\nMan, I tried to stop man, I tried the best I could\nBut You make me smile\n\n[Outro: Kanye West]\nI just wanted to ask you\nJust wanted to um, let me, how would I put this uhh\nLet's say all your friends, remember the one\nYou said if you ever she would be the one\nOk, ok, ok (You make me smile with my heart)\nWell I was thinking, hypothetically\nI mean don't take this seriously\nDon't take me: I mean just, uhh, not credibly\nI'm feeling incredibly, I mean let it be\nI just let it be\nI mean you, her and me (You make me smile with my heart)\nI mean you, her and me\nMaybe, baby, baby\nYou know I was just kidding\nUnless you gon' do it (You make me smile)"}], "artist": "Kanye West"}