{"songs": [{"year": null, "title": "Battle Drill", "image": "https://images.genius.com/32dac835a69d095e96fcbbc2afb2d6e6.1000x1000x1.jpg", "lyrics": "Artist: Saafir the Saucee Nomad\nAlbum: Boxcar Sessions\nSong: Battle Drill\n\n[Intro]\nI'm a king pin you can't win (3x)\n\n[Verse 1]\nBoxcar sessionist black magic is the magnet\nBreakin' 'em down to micro fragments\nI might go dragnet\nShoot Joe on Friday\nIf I miss I'll get your one day\nWon't forget officer Monday\nI'm good with gun play I get wreck check the boss\nDon't remove your firing pin, punk, cause I get off...\nComes the safety\nFreak a clip or get plugged with the four - 5th\nOff my niggas hip best believe the triggers gettin' gripped\nWe stroll the back doors to the railroad\nIs where we go when we flow\nHell knows and elbows are shot\nThrown don't blink an eye get\nRuff when I flex the Ingrim chrome don't even try it\nI'm the arsonist cause I'll burn you with the slug I'm...\nFunky plus I got carpet fresh in my rug\nTug a war and get dug\nSix feet under\nFloor plans are banned\nCombat hand to hand\nCowards clocks is gettin' cleaned with detergent\nIf you want to freak a funky flow we can splurge it\nSo I'll perk like an expert I'll...\nSend a flow that'll kill\nBut I won't break a sweat in a\nBattle drill\n\n[Verse 2]\nStart ya engines\nBut you look exhausted like carbon...\nMonoxide. I'm sly like a foxeye...\nSee me?\nI'll jack you for your bundle G\nI'll be lurking in the rear smirking when you're crumbling\nThe hobo junctionist...\nFunction is...\nTo freak the lyrical\nSmoke a blunt to the grill\nTill we reach the spiritual world\nThen get wit ya girl dip her like a tea bag\nUp it another notch for the flea bag\nKing queens be freaky fiends don't sleep, or fall off\nThink the cocks the bomb but like Tom you'll get brokawf\nSheer energy so u know I be stockin' rear entities\nEatin' linto beans and I do reek\nWhen I speak... true who's this ya girl?\nNice to freak you\nLet me freak a clip slip one in the chamber\nClick clak that's the sound of the gat\nRight before the jack comes true I thought you knew\nThat's the cue oh! But you're a hero\nMuscles kinda swollen but you ain't\nReal you wouldn't strike if we was bowlin'\nTo the left march arch ya back\nThe impact is fat when I tag a grill\nFor a battle drill\n\n[Verse 3]\nThe funky nomadic attic dweller never\nOn the cheddar cheese\nGrease down the plank yankin' mentals\nClean slates are freaked treats for the tricks like\nA magician doin' halftucks genies\nAnd Arabian's chest be cavin' in\nAnd I be in the rubbish\nRubbin' this like Aladdin\nThrough obstacles my saliva be\nLiva than stoppin' foes in they tracks\nCuttin' the tape it's nutthin' to debate\nFate tells me this is the last grape to be cracked\nRippin' the plaque between the gums\nHums this lift ya lip a little more to the chef's recipe\nFor flavor they be beggin' me to stop\nThe torturing but forth I bring a subconscious\nWhich means no consciousness\nOn this effort\nNo mercy on a groove\nNo space to move\nCheck mate\nIt's reserved for the disinfecting\nI'm projecting flavor till you choke, chalk one\nAdd a kill\nFor battle drill", "album": "Boxcar Sessions"}], "artist": "Saafir"}