{"artist": "Porta", "songs": [{"album": "Reset", "title": "Palabras mudas", "image": "https://images.genius.com/0786171922516cdb77f0f7ea0149854a.953x953x1.jpg", "lyrics": "(Estrofa 1)\nQuiero decirte tantas cosas que no pude, asume que te amo por encima de todo\nAunque a veces lo dudes, Cada discusión nos hizo mas fuertes\nNo fue la suerte quien nos unió, y no me alejaría de ti\nNi ante la muerte. Nada fue tu culpa amor\nNada de lo que sucedió, no quiero verte llorar mas\nHazlo por mi por favor. Pienso y pensaré\nQue fui un idiota, lo daría todo\nTan solo por poder escribirte solo una nota\nAhora no puedo, desespero joder, que duro resulta\nEstar tan cerca y saber que no me volverás a escuchar nunca\nEl tiempo pasa lento aquí, no hay pared de cemento\nQue me pueda separar de ti, No sin que antes puedas sentir\nMi aliento en el viento cuando sopla\nYo planeé un futuro pero no lo imaginé así te lo juro\nY me pregunto si es verdad que podrás perdonarme un día\nCondenado a estar contigo cuando no puedes ser mía\n\n[Estribillo] [Gema]\nEsto se nubla y veo que ya no estás\nNo podré salir de todo esto si tú, te vas\nQuiero que decirte que ya no hay calor en mi\nQue la esperanza se me escapa y deja de existir\n\n(Estrofa 2)\nCometí tantas cagadas que si te fueras tú, yo lo perdería todo\nYéndome yo tu no pierdes nada, ahora mis palabras se han quedado\nMudas, confía en mi, he oído decir por ahí que el tiempo\nTodo lo cura, sentí el dolor solo un instante, ese\nInstante ya te anhelaba. tantas cosas por decirte\nTanto tiempo nos quedaba, cuando todo se acaba\nCuesta creer, puta vida injusta, asusta saber\nQue lo que mas quieres lo puedes perder\nJoder, dame una ultima oportunidad, no lo puedo aceptar\nSolo pido un día mas. De todo a nada en cuestión de segundos\nEl dolor de ver con tus propios ojos como se derrumba tu mundo\nNo llores, No voy a dejarte sola, me oyes?\nTe intenté decir que no sufrí por mucho que me ignores\nAunque lo merezco, porque la culpa ha sido mía\nY he salido por la puerta sin decir que te quería\n\n(Estribillo) [Gema]\nEsto se nubla y veo que ya no estás\nNo podré salir de todo esto si tú te vas\nQuiero que decirte que ya no hay calor en mi\nQue la esperanza se me escapa y deja de existir\n\n(Estrofa 3)\nNo sé que esta pasando, tampoco se donde estoy\nMe siento solo, como si ya no supiera ni quien soy\nHay lluvia en el arcén y el tiempo se ha parado\nNo veo mi reflejo pero si imágenes que han pasado\nNo entendía nada hasta que vi mi cuerpo en el suelo\nNo podía creer este destino cruel que me enveneno\nPude ver lo que sentiste tras recibir la llamada\nVi tu cara pálida, sin alma sin nada\nLagrimas caen de tu rostro sobre nuestras fotos\nSeré tu relato corto, el retrato que cubre tu corazón\nRoto. Y aunque me joda, vete con otro y que te cuide\nVIVE!, Tan solo te pido que no me olvides\nSe que no hay salida y que ya es tarde\nRecuerdo la conversación que tuvimos aquella tarde\nY me lo juraste, por favor no hagas ninguna tontería\nJoder, deja esa cuchilla me dijiste que no lo harías!\nHay lluvia en el arcén y el tiempo se ha parado\nNo veo mi reflejo pero si imágenes que han pasado\nY las veo junto a ti, que estas a mi lado ahora\nCon ganas de volver porque nuestras familias lloran\n\n(Estribillo) [Gema]\nEsto se nubla y veo que ya no estás\nNo podré salir de todo esto si tú, te vas\nQuiero que decirte que ya no hay calor en mi\nQue la esperanza se me escapa y deja de existir", "year": "2012-05-07"}]}