{"artist": "Kitty", "songs": [{"image": "https://images.genius.com/ff349502ffcbfd8f7bdac9fe013f2b15.600x601x1.jpg", "title": "​scout finch bitch", "year": "2013-01-30", "album": "D.A.I.S.Y. rage", "lyrics": "[Verse 1: Antwon]\nAntwon came swaggier than most\nWhite people love me like chipped beef on toast\nI coast with the ghost smell of nectarines\nThe truth with the saber-tooth; Victor Creed\nBlack and brown people puttin' they faith in me\nDown the bill which up just please have weed\nCame with the dutchy nigga had to scheme\nBut a nigga so cozy, smoke weed, and scary dreams\nNigga, I'm barely seen\nA nigga touch my face, his whole team bleed\nThese niggas want beef, but they say it on Tumblr\nSo what that make you, motherfucker?\n(Half-dead, motherfucker!)\n\n[Bridge: Antwon & Kitty]\nI got weed on me\nNo you don't, stop\nI got cocaine on me\nYou're gonna get me in trouble\nI'm on probation, nigga\nNo!\nAnd I smoke weed too, nigga, what's up\n\n[Verse 2: Kitty]\nNo, mom, don't listen to 'twon\nNobody has cocaine on 'em and I never do anything wrong, 'kay?\nShe's always so suspicious, lurking kittydothedishes\nIt's the business, so why you wanna witness\nThe innocence I assassinate with rings up in my cartilage?\nA yard I bring the boys to, I don't need a guardian\nTo keep me in the party dress I started in\nThe yellow with the polka dots\n'twon, can you teach me how to smoke a pot?\nBut I been runnin' yellow lights\nAnd making sure that everything I type, I fuckin' spell it right\nAnd learnin' how to blur out all my cellulite\nAnd write about how bad I wanna have a Cinderella night\nSo I can make a frog a prince and\nThe audience has always got a sprinkle\nOf bitches that I wanna pinch and\nWanna punch 'em in their stupid face\nBut I'm busy rappin' Super Bass\nIn the passenger seat, and if you're passing on me\nMy pack of backup'll be cracking your teeth\nAnd you'll be smacking your lips\nAnd I'll be laughin' while they're ashing their cigs\nOut of the back of my whip 'cause\nI bes the DDs, no weaving in and out\nAnd never, ever speeding\nScout's honor mama, scout's honor, Mom!\nI'll never get in trouble, Mom I love ya"}]}