{"artist": "Boosie Badazz", "songs": [{"album": null, "title": "Dear Mama (Freestyle)", "year": null, "lyrics": "I'm a do this one here for my momma\n\n[Verse 1: Boosie]\nWhen I was young me and my mama rolled deep\nWatchin daddy lose his mind to these muthafuckin streets\nRunning in rooms, scared to go home, living in dooms\nSaying prayers looking at the moon\nAnd you've always been a black queen momma\nCause ye'en never been no crackfiend momma\nLook, and when my daddy fuckin life was over\nI watched him cry for two hours on your mommas shoulder\nThis for them soldiers who was raised by they momma\nCause daddy was gone, she had it down for thanksgivin\nMade her kids be strong, expelled from school\nNot scared to go home shit 'cause my momma's fuckin cool\nBut when I started sellin dope she used to search for me\nRidin cryin, thinkin somebody they gon murder me\nShe put me out her house, cuz I was hurtin her heart\nShe askin God \"Why are you doin this to my babyboy\".?\nShe teachin kids, and she tryna teach a babygangsta\nShe cookin meals everynight, for dat I thank her\nShe used to send me to my relatives, cause it got to a point\nWhere momma she couldn't tell me shit, and I was missin my dad so bad\nThat I ain't listen to my momma, and that was all I had\nNow I bless her everynight, cause I'm grown\nOur love super strong, and she gotta hol' on\n\n[Chorus: Boosie]\nShe sweet as sweet Sady\nMomma!\nDats my baby\nMomma! Momma!\nU remember how daddy used to act\nAct so crazy...\nAnd I thank you for the Blessings you did\n\n[Verse 2: Boosie]\nI used to always tell you momma, keep ya head up\nTears dropping from your eyes, I kno u fed up\nFresh outta work, to the kitchen tryna fix a plate\nBefore work she in the mirror, tryna fix her face\nNoone could ever take her place cause u my one and only\nYou my nigga, and forreal you my closest homie\nShe used to iron my clothes, everytime I go to school\nWiping the cold out my eyes, that's my baby boo\nShe gotta heart made outta gold, like she God angel\nShe go to church every Sunday, and say \"God Thank Ya\"\nAnd when my daddy used to hit me, she would holla \"stop\"\nGot to the point, where she would threaten to even call the cops\nShe used to be like \"why are you hittin him and you smokin rocks\"?\nI used to be like ooh I wish I had a 40 Glock\nBut daddy wasn't always mean forreal\nWhen he was sober he a soldier on da battle field\nAnd my brother stayed quiet he ain't talk at all\nMe n Taquari tryna lock my daddy out da house\nDo u remember playin bingo when times was hard\nYeah I remember fightin nyja and teasin shard\nRemember momma put me on a plane at 9 or 10\nShe try to get me out dis hell dat I was livin in\nRemember momma on her knees cause her baby wildin\nNow when she see dat rose gold, my baby smilin\n\n[Chorus: Boosie]\nShe sweet as sweet Sady\nMomma!\nDats my baby...\nMomma! Momma!\nU remember how daddy used to act\nAct so crazy\nAnd I thank you for the Blessings you did. [x2]\n\n\nI did that for my momma cause she sweet as sweet Sady\n(I love u Momma)\n\n\nMissin a lesson plan\nIt's time to go stay n da room cause daddy comin with dat mess again\n\nMomma I did that for u.and yo momma\nAnd her momma.and momma Jessy my great great grandmom 'n' my momma\n\nShe sweet as sweet Sady", "image": "https://images.genius.com/681f4bb9ff46a631f887773f54f74156.1000x1000x1.jpg"}]}