{"songs": [{"lyrics": "[Intro - Orson Welles]\nThou mayest indeed\nTune onto the forbidden channel\nAnd see it like it is baby\n\n*Record Scratch in*\nWho shall be our champion?\nWhat manner of channel beholdest thou\nShall it fall on me?\nDeceit, deceit, deceit\n*Record Scratch out*\n\n\"Getting dusty in the cellar\"\n\n[Verse 1 - Aesop Rock]\nYo\nI always think about my sick friend\nStringing a ring around my wit's end\nThirteen loops later his feet hung inches out the pig pen\nMotley day goblins brought up pillage to pass the stillness\nWith bad javelin tip dipped inside barrel black magic brilliance\nWho rose at the tomb of the Unknown Soldier?\nTo capture the fascist fragment choreographed in traffic dancing for nickels\nHooked like sickle cells to the principles of comradery\nOne hope distortion odyssey sputters itself to my how not example sample\nDivvy the bread crust while considering the littering\nI don't pity the head rush or the whimpering, spill\nAnchor to rock bottom, rocks bottom packs a ravenous catalyst\nSprung alacritive, leashed by the carnal tirade\nI choked when the cage bird sings it stings\nSprings me up delirium to stitch the clipped wings\nI sink instinctively brinked through while clinging the shrieking souls\nMourning the death of annal logs /analogs and quality control\nQuality control, stand still string up the banner\nFrom the beehive to the anthill; rag dummy\nIncorporate the unison of Vikings Ship Rowers PLUS the perfection\nOf the twice the Birds with half the Stone Throwers, speak your assessment\nMy communicative hindrance pleads the needs\nOf a billion hungry victims gripped by the hell that's left to splinters\nShiving up the mass of natives and it's league marvels\nOne component's sure to shock a mass burial, breeze\nBroken penny bank fragments float up at staggered seas\nDirty work plus applicants with chatter box disease\nIron bandit, give them the stars, the head balloons and rubies\nAsked for many moons and I can't stand it any more\n\n(Orson Welles)\nIs that how I feel when I sling?\nAnd the regulars were so amazed\n\n*Record Scratch in*\nI'm the mightiest slinger of them all!\nThere is a time for war and a time for peace\nAnd a time to run and a time to split\n*Record Scratch out*\n\n\"Getting dusty in the cellar\"\n\n[Verse 2 - Aesop Rock]\nI run a funny race, malnourished monarchs and loopy admirals\nWhere 99.9% swear by their broken axles\nI built boats of a pack rat bats of bully club swung\nPost utility inhalants nail it to stability and sail it\nLopsided starboard bow, crooked mass makeshift\nPatching holes with chewing gum and sticking sail to dirty bases\nObserve me sitting with my eyes tied to the clock, Cause\nI know that once that wind kicks up you and your motors left rope to the dock\nAnd it's the, art of clarity married to slender extension\nOf blue sky over happy neighborhood\nString on my ring has left me dancing like wooden dummies in a paper nature\nMerry etiquette is a door nail, Friends is little brittle dolls of paper\nIn assembly, I tremble with a crocodile smile\nHiding a fish out of water complex provided upon entry\nNow if I, were to fall to speeds\nTo levigate the game plan, would you honestly impede?\nI mean I guess, I can just divorce me from the rest\nAnd blame my chemical imbalance for the fact I've made a mess\nBut my loyalty supply hints on which inkling I should run with\nAnd I'm thinking that damn town crier's about to fill this here bucket\nIt's that, grand precious that precious that part of you wants to touch\nAnd part of you just wants to sit and be impressed with\nTainted agony induct in barnacle attachments\nMood swinging upon the barnstorm with perpendicular traffic\nSpread, Circa 4000 circuitry burns cicada wings\nAbove alkadiene Townsman spoon-fed the shadow\nI'm tired of being wired into the thief ratio\nIt's gnawing a hole through my scheme so I leave (know what I mean?)\n\n[Outro - Unknown man]\nIt is the molotov cocktail hour\nHaven't I brought you blessings without number?\n\n*Record Scratch in*\nThey have plenty of nothing and nothing is plenty for them\nYea\nI've never had it so good\n*Record Scratch out*\n\n\"Getting dusty in the cellar\" x3", "title": "Sick Friend", "album": "Appleseed", "image": "https://images.genius.com/f515b4ae044f84fd9925d86f6dca5cfa.200x200x1.jpg", "year": null}], "artist": "Aesop Rock"}