{"songs": [{"year": null, "title": "Out There", "image": "https://images.genius.com/ece3d210dc35f31beebaff89c8ab6f36.996x1000x1.jpg", "lyrics": "[Intro – Saigon and (Diana Ross Sample from “Sleepin’”)]\nYeah (He's tired of runnin' his game...)\nUh huh.  They calling out there, man.  Check.  Shiet…\n\n[Chorus - Saigon and (Diana Ross Sample from “Sleepin’”)]\nOut there… (He's been out there, out there, out there…)\nIn the streets you know… (In the street you know…)\nI was out there, man.  Really doing the years.  Really busting guns, man.  Let me talk to ‘em.  (And strugglin', scufflin' trying to survive…)\n\n[Verse 1 – Saigon]\nI’ve been out and about there\nWiling since ten and a half\nRunnin’ from cops, ‘cause I ain’t never like gettin’ harassed\nI would tell them niggas to kiss my ass\nThey’d tell me, “Get on the wall.”  (Phoom!)  And that’s when I dashed\nUsed to flash my lil’ du-knot—20’s, over one-hundred ones\nEating Chick-O-Stick and Big Bol bubble gum\nWas young but hung with niggas that slung jummies\nBeing a dumb dummy who disrespected my mummy\nAnd I never forgot who put me on this Earth\nWho brought me up right and who loved you since your birth\nBut that didn’t stop me from stealing money out her purse\nCursing at her worse than an Eminem song verse\nThirsty for street love ‘cause I ain’t feel itthat home\nThree years later, I’m thirteen, concealing that chrome\nReady or not, like L-Boogie, Pras, and Wyclef\nI promised my cousin Woody I’d ride to my death\n\n[Chorus - Saigon and (Diana Ross Sample from “Sleepin’”)]\nI was out there… (He's been out there, out there, out there…)\nIn the streets you know… (In the street you know…)\nIn the muthafuckin streets, man.  Brooklyn, Spring Valley, New Berg, Virginia, B.A.  (And strugglin', scufflin' trying to survive)\nNigga, out there… (Out there, out there, out there…)\nBustin’ shit.  Robbin’ shit.  Rap niggas make me laugh, man… (In the street you know…)\nBitch-ass muhfuckas… Check… Talk… Go in… (And strugglin', scufflin' trying to survive…)\n\n[Verse 2 - Saigon]\nI’ve been out and about there\nSellin’ cocaine to my kin\nPlayin’ the game, I know ain’t no way I can win\nEither I die or get locked in then pen\nI try to pray and even hope to God I’m not, but I am\nI’m feelin’ as if I’m all in\nThey say that rapping is my calling—I just feel like I’m some bastard alcoholic\nWho drink, get shit-faced, and I’m back over the toilet\nI can’t call it.  Why?  Nigga, I might spoil it\nIt’s not fair, we out there.  They rap about it and live\nThey act like it ain’t, but nigga that’s what it is\nIf you really did what you said, you would’ve been dead\nWith ten in your head or on the Feds with me in yo’ bed\nMe, I’ve moved on.  I was doing wrong for too long\nTorn, watchin’ Satan, miseducatin’ the newborn\nRead the Qur’an, check atrocity, [?]\n\n[Chorus - Saigon and (Diana Ross Sample from “Sleepin’”)]\nOut there… (Out there, out there, out there…)\nEvery day, man… In the street, man… (In the street you know…)\nTeaching the youngsters, know what’m saying?  (And strugglin', scufflin' trying to survive)\n(Out there, out there, out there…)\nThis your boy Saigon.  In the building with my nigga, fuckin’ Whoo Kid, my nigga, Just Blaze… (In the street you know…)\nIt’s the invasion, we taking over the fuckin’ street, nigga… (And strugglin', scufflin' trying to survive…)", "album": "Abandoned Nation"}], "artist": "Saigon"}