{"artist": "Fashawn", "songs": [{"year": null, "album": "Champagne & Styrofoam Cups", "image": "https://images.genius.com/09dcf1a0e7f7a1c4eac047d2fc35bd69.500x500x1.jpg", "lyrics": "[Verse 1: Fashawn]\nI used to play the corner store market\nNow I plan on cornering the market\nCall the coroner I sent, 4 about that lock\nAnd I hit you and your whore in y'all apartment\nLeave nothing but y'all corpses on the carpet\nI spark it, got the arsenal of an arsonist\nA narcissist hardly concerned with these other artistsss\nThis ain't a rap it's a biography\nYeah, copy writ in case they copy me\nS. Leyva, the F's top player\nRespect I hater, left side's greatest\nYeah, angel with a battery in his halo\nIn another tax bracket your majesty gettin' mayo\nSay bro, tell these pussy niggas lay low\nFuego, that's all you feel when that AK blow\nYeah, just for playin with my pesos\nParagraphs picture perfect I paint 'em like play-doh\nTwice baked you can call me Mr. Potato\nShawn Stacks I move them blocks like legos\n\n[Hook: Fashawn]\nHola Santiago! (2x)\nNah I ain't playing grab this cannon and I aim it\nGive 'em something strictly for the gangsters\nThey hollerin' out Hola Santiago! (2x)\n\n[Verse 2: Fashawn]\nI used to have dreams of bagging an R&B bitch\nNow I'm thinking Victoria Secret\nSomething foreign I can creep with\nThrough the streets of California for the weekend\nMonday morning I'll ignore it, Diadora's hit the cement\nWhich means that I'm on my toes\nTo all these niggas and all these hoes\nI got my friends and I got my foes\nBank account not enough 0's\nToo much weed in my lungs, new tags on my clothes\nFull clip in my chopper, boy I wouldn't come close\nFuck around and be ghost just for running around that coast\nWestbound, tech rounds, real shit the sound of that toast\nPraise due to the most, but still I brag and I boast\nAnd it's bear gang over everything I live and die for that oath\nThey say hola Santiago while I'm smoking my cubano\nEl Chapo, sippin' mojitos out in Cabo\nYou ain't about gettin dinero get out the way loc\nOnly real niggas on my payroll\n\n[Hook: Fashawn]\nHola Santiago! (2x)\nNah I ain't playing grab this cannon and I aim it\nGive 'em something strictly for the gangsters\nThey hollerin' out Hola Santiago! (2x)", "title": "Hola Santiago"}]}