{"artist": "Phora", "songs": [{"album": "Angels With Broken Wings", "title": "Halos & Devil Horns", "image": "https://images.genius.com/30bbb3fc8287c5bd85c986ce58ef300a.640x640x1.jpg", "lyrics": "[Verse 1: Phora]\nSometimes I feel like I got a halo over my devil horns\nNot really knowing was worse or better for it\nThe world turns and over time I really learn\nNever judge someone taking steps in shoes you've never worn\nSo why would they judge me?\nBet they couldn't walk a couple feet in my chucked T's\nIt's been rough for me since I ain't even had front teeth\nJust a young buck bumping Pac and BIG\nWhile I was saying Super Nintendo Sega Genesis\nWhen I was 15, homie, I couldn't picture this\nI was up in the hospital without a chance to live\nGod had plans for me, it's my chance to give\nBack to the fans and the kids and the people tryna do good in life\nAll my homies pleading guilty, the case is they couldn't fight\nStay strong, be positive, keep yo head up\nInstead of finding someone to wet up just keep yo bread up\nDon't wrap yo hands around that Beretta, it's all a setup\nI'm tryna spread the love, it's nothin' these cats can't tell us\nI speak for my generation, watch me open these doors\nNas told me the world was mine, now I'mma show you it's yours\nOne love!\n\n[Chorus: Notorious BIG - Juicy]\nIt was all a dream\nUh, damn right I like the life I live\nCause I went from negative to positive\nAnd it's all\nAnd if you don't know\nAnd if you don't know now you know, nigga\n\n[Verse 2: Phora]\nYeah, I remember, getting kicked out of my pop's house\nSleepin' in my homie's Honda till I got locked out\nAnd had no where to go tryna make dough to help moms out\nPicked up my pen and pad and that's the second I dropped out\nSee, I done risked it all to follow a dream they said I couldn't reach\nSpent the rest of my child hood running' on the streets\nNah it's ironic, they called me up last week\nSaying' that teachers having trouble teaching they think\nI should give a speech, haha\nIt's funny how that works, huh?\nFunny I believe in God, but not the church, huh?\nAnd it's funny how my demons get a hold of me\nI don't need to read the Bible, I just need to write a verse, huh?\nI done went through it all\nSippin' 40s, little shawties, taggin' up on the walls\nAll I really had was a heart of steel and my dirty chughs\nLate nights in the city, taggin' like hurry up\nWe gotta catch the bus down beach boulevard\nThat was before my cousin started sneakin' out granny's car\nRound the same time my heart first broke, that shit changed me\nBut help me see the difference between a trick and the lady\nSo watch for these cats that got they eyes on yo steps\nThey ain't holdin' you down then they just holdin' you back\nI'm speakin' for this generation, watch me open these doors\nNas told me the world was mine, now I'mma show you it's yours\nOne love!\n\n[Chorus: Notorious BIG - Juicy]\nIt was all a dream\nUh, damn right I like the life I live\nCause I went from negative to positive\nAnd it's all\nAnd if you don't know\nAnd if you don't know now you know, nigga\n\n[Outro: Phora]\nYeah, this song was inspired by\nThe great words of the Notorious BIG, rest in peace\nYeah, 1,2, we still sip 40 ounces\nAnd birthdays was the worst days, we still sip 40 ounces when we thirsty ain't shit changed\nI just had to do that one time I just had to\nYeah we still sip 40 ounces when we thirsty ain't shit changed\nNo nigga ain't shit changed", "year": "2015-10-11"}]}