{"songs": [{"image": "https://images.rapgenius.com/8f10eb5ab61c365e388a080591b9065d.960x960x1.jpg", "title": "Intro", "album": "Mansion", "year": "2015-03-17", "lyrics": "[Verse]\nI'm lookin' like I'm gonna get it, you prolly don't get it\nI come in your house with a microphone\nLookin' like I'm 'bout to set up a show in your kitchen\nI'm out of my mind, but I feel like I'm in it\nIf I never make it, don't make any difference\nI'm still gonna kill it, you know what the deal is\nAin't never no chillin' when I'm in the buildin'\nNF is a monster, I am a villain\nMy music is sick, and you don't know what ill is\nYou better get back, I don't write any filler\nI write what I feel and I'm feelin' a million\nSo you better shh, be quiet, you hear it?\nI'm 'bout to lose it\nI'm on a whole different level of music\nDon't treat me like I have no clue how to do this\nYou better rethink what you're thinkin' and move it\nNow picture me writin' when I was a kid\nTryna make it in music, I think it is crazy\nI spent all my money on studio time\nTryna get on my music so people could play it\nI'ma keep it one hundred, my music was terrible\nLearned to get better the more that I made it\nGo back to my Moments album, most of you people\nYou prolly don't know what I'm sayin', hold up\nWhat you're witnessin' now? Don't try to figure me out\nI grab on that microphone, jawin' the crowd\nThey was laughin' at me, who they laughin' at now, huh?\nI laugh at myself, some people they lookin' like, \"Wow\nThe moment you told me that you was a rapper\nI couldn't believe it,\" you believe it now?\nStep in the booth and I murder it\nYou never heard of a rapper that kill it like I do\nI sleep on the couch in the studio\nStay up till three in the morning, and write till I get more\nThe moment I wake up I feel like I don't even sleep\nAnd I'm ready to put out my record\nWhich, thank you for buyin', maybe you burned it\nBut either way, I'm gonna wreck it\nI look at the industry, look what it did to me\nYou'll never make it if you never grind\nYou put a whole lot of money into it\nYou better be ready to give it your time\nI look at the past awful years of my life\nAnd I promise you I have been givin' it mine\nTry to keep up with this, I'm not a puppet\nNo string on my back, I'm one of a kind\nMusic is changing, no way to tame this\nI am an artist, look what I painted\nHang up the caution tape, I'm dangerous\nDoes anyone know where my brain is?\nRappers are comfortable knowin' they're famous\nBut I, really don't care what your name is\nAnd I, really don't care if I'm nameless\nY'all just drivin' around, I know where my lane is\nCocky? Nah, I'm competitive\nThis is a job for me, it's adrenaline\nDon't try to box me in, I am Mayweather\nI come in the ring, my punches are way better\nI never drink, but I live in these bars\nThe moment you blink is the moment you lost\nSay you a king, who put you in charge?\nDon't care what you think, I'll break in your car\nClimb on the top of it, sound the alarm\nAnd wake up the neighborhood, rap in your yard\nAnd carry the speakers on both of my arms\nTill you keep sleepin' on me, I'm at large\nEnough with the jokes, I ain't jokin'\nYou come in a session with me, I'ma show you what dope is\nAnd when I say dope, I ain't talkin' 'bout smokin'\nI'm talkin' 'bout music that has an emotion\nI look at this mic, it's part of my family\nTake it away, I'm comin' to find you\nI've been through a lot in my life\nAnd it's hard to get people to listen when no one's behind you\nAnd then Capitol came in the picture and gave me a shot\nAnd look at it now\nI look at the team I'm dealin' with, agh\nThese people ain't playin' around\nLookin' back, I gotta laugh\nI was in a whole different place a year ago\nI look at the math, I look at the map\nAnd thank you God, I swear it's a miracle\nAnd I'm sorry, but I gotta leave\nBut, man, this track was beautiful\nThe least I can do if I murder a beat\nIs take the time to go to its funeral, haha"}], "artist": "NF"}