{"artist": "Wax", "songs": [{"year": null, "lyrics": "[Intro]\nOH!\nC'mon, baby baby\nC'mon, baby baby\nC'mon, baby baby\nC'mon, baby baby\nC'mon...\nCh-ch-ch-ch-ch check it out\n\nIt's like this and a... (and ya don't stop)\nIt's like that and a... (and ya don't quit)\nIt's like this and a... (and ya don't stop)\nIt's like that-tha-tha-that-tha-that-that... (and ya don't...)\n\n[Verse 1: Wax]\nCheck it out, man\nIt ain't nothin' you can bear with\nAbove y'all swinging like skis that be danglin' from the chairlift\nAirlift crews to the hospital-\nWe belittle\nY'all dudes to the most possible level of embarrassment imaginable\nBe civil, be fashionable\nGet there late\nThen get scared straight\nBy a hungry duo who don't ever get their plate\nOn time, 'bout to fight for your prime\nRib loose bib but I'm tight with the rhyme\nAny cypher that I'm in\nStifles your mind\nIn the grand mal dance-off sight will define\nOur swing style\nWe just do our thing while\nY'all sling piles of shit at us, we ridiculous\nWe told you that on Liquid Courage\nAnd that's some speech slurrage we stick wit'\n\n[Hook x2]\nThrow your hands in the air like it ain't no thing\nCause it ain't no thing without the Elements swing!\nThe Elements swing, the Elements swing\nIt's the... swing that my man Elements bring!\n\n[Verse 2: Wax]\nSkilled heat gettin' spewed from the vocal cords\nGiving chilled feet to the crews that we open for\nE builds beats makin' dudes wanna focus more\nOn their craft while we chill in our lawn chair rafts\nCupholders on both sides\nY'all's mental battles are rental paddle boat rides\nRide the beat like slide guitar note slides\nFretboard guides, with a quote: \"Just glides.\"\nIt's the bottle-neck linguist\nWith a king twist\nReal squad'll get rings kissed\nGotta bring this 'til it can't be brung no\nMore, fuck a score - we just doin' it for fun, yo'\nMad rappers\nTry to battle 'em, we laugh at y'all\nAfter all, this is just music - have a ball\nThat's just what we 'bout\nSwing batter-batter\nSwing batter, strike three - OUT\n\n[Hook x2]\n\n[Verse 3: Herbal T]\nElements got swing like sets kids play on\nOutside the lines like reckless crayons\nCheck this today on your iPod touch\nAnd you'll never hear your girl say \"Oh my God\" so much\nShe keeps sayin' that we verbally orgasmic\nDoesn't matter if it's Herbal T or Wax with\nE what we do is sure to be pure classic\nFinishing first like the turtle before rabbit\nSlow and steady is the pace to win a race\nUp in the place, wasted\nWe lounge like chaise\nSo y'all can scream 'til your face turns red we-\n-calmly kill it 'til the place turns dead\nIt's Herbal T, motherfucker - flow sickening\nHot like a buffalo chicken wing\nGot these whack MC's in front of the show picketing\nWanna protest - it's unfair, we flow so fresh, man\n\n[Hook x 2]", "image": "https://images.genius.com/6f0817252fcc664558dc80369900bc26.320x320x1.jpg", "album": "Scrublife", "title": "Elements Swing"}]}