{"artist": "YG", "songs": [{"image": "https://images.genius.com/6d9597606099b223fdd3ad68fa232887.1000x1000x1.jpg", "year": "2016-06-14", "album": "Still Brazy", "lyrics": "[Produced by DJ Swish]\n\n[Hook: SadBoy Loko & YG]\n(Don't come to LA) Nobody fucking with me\nI go broke, rob fools for their jewelry\nStick your hand up like you guilty\nDoing things that my momma said I shouldn't be\n(So don't come to LA) Nobody fucking with me\nI go broke rob fools for their jewelry\nStick yo hand up like you guilty\nDoing things that my momma said I shouldn't be\nSo don't come to LA\n\n[Verse 1: YG]\nI don't give a fuck who you niggas paying\nWho name you saying, you ain't good around here\n'Cause y'all niggas fucking up the rep\nY'all playing with the set, it's really war around here\nShit, I'm even having problems in the set\nBut I'm really from the set, and y'all don't come around here\nSo when y'all niggas hop off your jet\nYou better tuck what's on ya neck\nAnd get the fuck from 'round here\n'Cause y'all paying for the lifestyle that's watered down\nBompton! That where I'm from, this shit not allowed\nY'all out of bounds, keep that out of town shit out of town\nYou wasn't banging out of town, it's too late to holla now\n(Whoa!) I'ma get the OGs on board\nAnd press the issue on you suckers, oh lord!\n(Whoa!) Or hit you with a price you can't afford\nThen catch your ass slipping at the BET Awards\nYeah!\n\n[Hook: SadBoy Loko & YG]\nSo don't come to LA\nNobody fucking with me\nI go broke, rob fools for their jewelry\nStick your hand up like you guilty\nDoing things that my momma said I shouldn't be\nSo don't come to LA\nNobody fucking with me\nI go broke, rob fools for their jewelry\nStick your hand up like you guilty\nDoing things that my momma said I shouldn't be\nSo don't come to LA\n\n[Verse 2: AD]\nYeah! Don't come to LA, cuz (nah!)\nOutta town niggas watchin', wrong words get you sprayed, cuz\nThis shit for real, this ain't for play cuz (Nah!)\nLil' homies bustin' missions, ain't a match\nYou ain't a thang cuz (Yeah!)\nDon't give a fuck who you gone call, nobody scare me\nPirus love me solo all inside a rare breed (Yeah!)\nAnd shit, I'm coming from a rare breed (Yeah!)\nNowadays, these niggas snitching (Bop!)\nGive you digits off a scared plea (Uh-huh?)\nHold on, YG, since you came out with BPT (Uh-huh!)\nThese niggas think it's cool to come down to the CPT (Uh-huh!)\nRemember back when rappers was scared to come into town (Yeah!)\nNow it's Hollywood passes man that shit all watered down, damn!\nA lil' change got you workin' like a slave (Fuck!)\nPac prolly rollin' in his grave, shit is sad, cuz\nAin't no more passes on the set\nAll you niggas out here fucking up the West, on God!\n\n[Hook: SadBoy Loko & YG]\nSo don't come to LA\nNobody fucking with me\nI go broke, rob fools for their jewelry\nStick your hand up like you guilty\nDoing things that my momma said I shouldn't be\nSo don't come to LA\nNobody fucking with me\nI go broke, rob fools for their jewelry\nStick your hand up like you guilty (Ahhh, yeah)\nDoing things that my momma said I shouldn't be\nSo don't come to LA\n\n[Verse 3: Bricc Baby]\nUgh! First off, this a no-fly zone\nIf you ain't laying with the chrome, better take your ass home\nLike it's the first of the month, cash the checks and c'mon\nYeah, you better check in if you niggas want room\nLook, one call on my phone\nMy Tiny Locs pull up, put that thing on your dome\nYour money chain and Rollie, 60 seconds is gone\nMan, I rather text a nigga\nFuck a feature for songs (Give it up, buddy!)\nRun up on 'em like\n\"Nigga, where the scene at?\" (Give it up, buddy!)\nMy niggas on go like 60 green lights\nJust (*static*) got jacked tryna eat right\nWhen my niggas off drugs, they don't think right\nIt's a recession, man, the hood fucked up\nIf a nigga ain't tripping, got the heat in the club\nYou walk around like you can't get touched\nBut JFK was the president and still got his head bust\n\n[Hook: SadBoy Loko & YG]\nSo don't come to LA\nNobody fucking with me\nI go broke, rob fools for their jewelry\nStick your hand up like you guilty\nDoing things that my momma said I shouldn't be\nSo don't come to LA\nNobody fucking with me\nI go broke rob fools for their jewelry\nStick yo hand up like you guilty (Ahh, yeah)\nDoing things that my momma said I shouldn't be\nSo don't come to LA\n\n[Outro]\n*Gunshots*\nAHhhhHHH!!", "title": "Don’t Come to LA"}]}