{"songs": [{"album": null, "year": null, "title": "Change The World", "image": "https://images.genius.com/2cd936e786e1ab454043327d585c7702.1000x1000x1.jpg", "lyrics": "[Verse 1: J. Cole]\nLet me tell you a little story about my homie Corey\nRight now he's locked down serving at least forty\nBut excuse me, I got ahead of myself, I'm sorry son\nThis story starts in his youth, he was hardly one\nWhen his pops got knocked for coping rocks\nFrom under cover cops on the corner of his block\nAnd he never got a chance to meet him\nCause the very next year his pops is laying still in the prison cell bleeding from stab wounds, fatal\nBad news Corey's mother and older brother already caught in the struggle\nBrother barely ate tryna hustle just to carry weight\nThe whole family underweight cause they rarely ate\nOne thing my nigga never got was love\nAnd his whole childhood he was watching drug addicts\nHis brother supplying it, old mother buying it\nYou expect a scientist to come from this environment\nGet real!, this shits hard enough brought up black\nBut being poor plus your mums on crack\nAnd your brothers a hustler tryna take you under his wing shit, just a fucking wonder his breathing\n\n[Hook: J. Cole]\nIf I could change the world I would\nSnap my fingers and bad would turn to good\nLet me change the world, I'm wishing\nI promise you I'll make a difference\nIf I could change the world I would\nSnap my fingers and bad would turn to good\nLet me change the world, I'm wishing\nI promise you ill make a difference\n\n[Verse 2: J. Cole]\nAge five, Corey had dreams to be a cop, but\nAge six, his older brother passed the Glock, let him hold it\nPlans change, he started his campaign\nAge thirteen, little boy doing big man things\nAnd that's what he thought\nHe was jacking rims from mustangs\nBeating down on his class mates for chump change\nRunning round with the tough gang\nThe older niggas he sold dope for 'em, they bought clothes for him\nHowever, soon he got older and selling petty dimes turned into some pretty heavy crimes\nThe shit got to the point where he was stealing rides from his block\nEven robbing quick stops\nLadies loved him, he was crazy fucking\nKnocking boos daily, pretty soon he had a baby coming\nBut he didn't claim it, his baby mother was crazy loving him\nShe said \"Baby, let's settle down,\" he left her hanging\nHe'd rather be on the streets slanging a wild cat\nBut god damn i seen it coming a mile back\nA drug deal gone bad guns bursting\nNow Corey lying in a cell cause he merked him\nWhats the moral of the story?, figure it out\nSo the next time you ask why niggas are wild\nYou know with out a doubt, don't try and deny the shit\nYoung black male, a product of his environment\n\n[Hook: J. Cole]\nIf I could change the world I would\nSnap my fingers and bad would turn to good\nLet me change the world, I'm wishing\nI promise you I'll make a difference\nIf I could change the world I would\nSnap my fingers and bad would turn to good\nLet me change the world, I'm wishing\nI promise you ill make a difference\n\n[Verse 3: J. Cole]\nCause i can't stand to see my people struggling\nBut what we up against? tough conditions in this life\nAnd they wonder why these niggas all get hype, get high and fist fight\nOr why they live like they living, to get ice and cars\nNo type of jobs, income coming from dicing and robbing niggas in broad daylight\nIts hard cause all they know in this life is scars\nThis mic is all i need to change the globe, re-arrange it and make it so\nNiggas ain't in pain no more\nCause they they don't pay no more mind to all youth\nTill they got to locking them up and dawg that's the truth yo\nThats the truth yo, that's the truth"}], "artist": "J. Cole"}