{"artist": "Iggy Azalea", "songs": [{"title": "D.R.U.G.S.", "lyrics": "[Verse]\nTire marks, tire marks, finish line with the fire marks\nWhen the relay starts I’m a runaway slave-master\nShittin’ on the past gotta spit it like a pastor\nAfter, bash her, did it like doe like dasher, faster-motorbike faster\nIggy gotta get a bitch watch for my rapture\nWhite bitch go, ’bout to blow like the wind\nPenthouse too, roof top at the Wynn\nWhen I win, when I win I win\nNo when I wid ’em they good like shin\nGot hoes on call, got hoes on call\nTo come through take a pro-to-call\nJust damagin’ that’s my protocol\nDismantle ya, Australians on Slauson\nNo camera, I don’t care who you are\nNo condom rap gotta give it to you raw\nPitchfork point, better pass me the joint\nGotta twist this beat I’ma sprain my joint\nStraight crack rock, ball till I pop, pop\nPull my trigger, Rap City, no Tigga\nYeah shorty do it illa’ I’m raw no Digga’\nWhat’s my muthafuckin’ name it’s Iggy not Jigga\nDon’t compare me to her, throw the bitch in the ditch\nRuff ruff ho, kill the bitch I'm Vick\nSewed the game up stapled up in a stitch\nClick-click pow D.R.U.G.S. gang, my clique\nLook at my heels LV on it, ignorant art, everybody on it\nEverybody want it, 666 got a three-car garage\nDriveway be The Omen, boss like Cohen\nHate me, Chordz 3D can’t see me\nPockets better than a H3, I don’t see you like mace-me, ugh\nD.R.U.G.S - click oh and we on - hater\nOn these hoes hairs no activator\nWhores fuck up when he activate-her\nCuz I’m goin’ out with my hand raised\n’Bout to smack, smack, smack till my hand cave\nOn the bitch-made, honey I’m paid\nI’ma get laid fuck yer man cave\nYa act like ya real, be real, son\nKinda spaced-out you bitches be duckin’\nBetter than ya girl, than the best, make the competition rest\nUnless it’s sex, no less, I’ma fuck the whole game, I’m best\nWith my strap on, my vibrator, ’bout to bust a rhyme, no violator\nCourse no, I’ma feel myself\nI’m a masturbator like \"uh uh uh uh, fuck me, fuck me\"\nNow I’m off beat, my head hurts, I murk shit, I gets paper\nWash my mouth, I curse like a sailor - bitch!\n\n[Outro: YG]\nIt's YG 4 Hunnid!\nDrug money, fuck with a nigga\nPushin' it like we up in this bitch! Ayy!\nIggy spitting, y'all bitches better get y'all bars up in this bitch\nFor real though\nFor real though, for real though\nI show y'all, mmm, snapping up\nMan, what the fuck?\nWhat the fuck is she doing on Slauson? Somebody tell me\nWhat the fuck is she doing on Slauson?\nHa-ha!\nPussy flavor!\nD.R.U.G.S!", "image": "https://images.genius.com/1ae524c63f9e7e7295d0ffd804190c62.610x608x1.jpg", "album": null, "year": null}]}