{"songs": [{"lyrics": "Why you always all on my back?\nWhy you gotta do me like that?\nWhy you gotta act like a bitch when I'm with you?\nBaby girl I'm blue\nBecause you treat me like shit\nI paid for the bed and never even slept in it\nI paid for that crib and never stepped foot in\nAnd now somebody else is eating all the pudding\nThings change, now my dashboard wooden\nAll black Benz, like a young Doc Gooden\nDark shades, cause I'm stone crazy\nGirl, we grown, stop playing on my phone, baby\nAll your childish attempts to make me angry fall short\nWhich only fuels the rage you have, because you have nothing\nUnderstandable, I'm shining brilliant with five Brazilians\nThere were times I used to hide my feelings\nNow I'm butt naked in the Lamborghini\nAnd motherfuckers can't see me\nWait 'til this chick see me on TV, I make the shit look easy\nWho would've thought I hit you right back?\nWhy you always all on my back?\nWhy you gotta do me like that?\nWhy you gotta act like a bitch when I'm with you?\nBaby girl I'm blue\nSo many women wanna call me baby\nAnd you wonder why the fuck that I ain't call you lately\nSome would say that I'm the symbol for sex and uh\nOthers would hate, but I don't give 'em no breath\nGo on a date, I'm at the crib with the chef and uh, that's me\nAnd you could order whatever\nThe specialty is white snake and underwear sauce\nYou could probably catch me somewhere where the sun is next\nAnd I understand that's only cause I'm popular\nI'm getting topped off in the front row of the opera\nAs Bocelli sings the celly rings\nI gotta go, you'll never know how good it feels to lay in bed with king\nI'm not exactly flawless, but I'm gorgeous, just like a horse is\nI know the thought of me succeeding makes a lot of people nauseous\nStill I'm on the back of the boat taking pictures with the swordfish\nWhy you always all on my back?\nWhy you gotta do me like that?\nWhy you gotta act like a bitch when I'm with you?\nBaby girl I'm blue\nI hope you get a paper cut on your tongue\nFrom a razor in a paper cup\nI hope every soda you drink already shaken up\nI hope your dreams dry like raisins in the baking sun\nI hope your titties all saggy in your early 20's\nI hope there's always snow in your driveway\nI hope you never get off Fridays\nAnd you work at a Friday's that's always busy on Fridays\nI hope you win the lottery and lose your ticket\nI hope it's Ben and Socrates poop all up in your kitchen\nI hope the zipper on your jacket get stuck\nAnd your headphones short, and your charger don't work\nAnd you spill shit on your shirt\nI hope your tears don't hurt, and I can smile in your face\nCut my losses, how Delilah changed my locks to a fade\nI hope you happy, I hope you happy\nI hope you ruined this shit for a reason, I hope you happy, igh\nWhy you always all on my back?\nWhy you gotta do me like that?\nWhy you gotta act like a bitch when I'm with you?\nBaby girl I'm blue\nLa la la la", "title": "On The Real", "album": "Bon Appetit..... Bitch!!!!!", "image": "https://images.genius.com/75abbfb23805726a9e4ff6f386222ddd.500x500x1.jpg", "year": null}], "artist": "Action Bronson"}