{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/9e883c930374c1c92c7094a3280231be.491x491x1.jpg", "title": "Brooklyn Style", "year": null, "album": "I Killed the Devil Last Night", "lyrics": "(Intro) Starkim\nWhat's poppin' world? (What's poppin' y'all?)\nI gotta go hard my nigga, (Geah, I gotta go hard)\nNot cuz everybody doin' it, not at all, (Nah)\nCuz they fabricatin' it, lyin' to y'all, true story (Word)\nI mean, I don't like to be lied to (Not at all)\nI tell you like this tho my nigga (Whaddup?)\nIf you hood, you hood, if you not, you not, ya dig? (You heard that)\nShit runs thru my veins tho, (Yeah) I was born this way (Uh-huh)\nI gotta question for you tho? (What's poppin'?) Are you?\n\n[Starkim]\nNiggas talkin' bout they ghetto but they don't really live it\nThey usin' the hood as a gimmick, come to my neck of the woods\nWatch you play the role of being timid\nQuiet, soft, tuckin' jewels as you walk\nMe? I'ma young nigga, but I swag thru any hood wit the hawk\nLet the haters talk, nah, approach, press 'em\nYou talkin' shit, actin' like a bitch\nSee that's what happens, dick\n08 shit, you will get jumped quick\nYou too been in tape flicks\nGet high and laugh till we sick\nPointin' at us, sayin' that's what you get\nNah that's G'd up, you want hood, that's the block\nGettin' high, duckin' cops\nThere's bitches in the streets, I don't wanna get knocked\nMoney neva pop, time is money, time neva stops, tick-tock\nThat's why I always watch\nAnd everything I do, you get the best of me\nWhatever you do, do it the best my G\nYou probably could get legacy, let me see\nI go hard for the hood; Brooklyn sweater, Brooklyn hat\nBrooklyn this, Brooklyn that\nProject stores, me and my niggas 20 deep in the halls\nYact up and high, back out and fly\nFuckin' bitches, do it till we die\nThug mansion, do it again in the sky\nReal shit, no lie, I'm the hardest King takin' what's mine\nTakin' my pie, my parents raised a thug prince\nSo my bitches and niggas don't cry\nWhen I die, just know I rhyme for the hood, that's why\n\n(Outro) Starkim\nGeah, geah, Starkim, that's some real hood shit for y'all niggas\nCheck it, y'all betta get in tuned"}]}