{"artist": "Angie Martinez", "songs": [{"title": "What’s That Sound", "image": "https://images.genius.com/fa4abffe2c6164a010ae6b833f491d67.1000x981x1.jpg", "album": "Animal House", "lyrics": "[Intro: Angie Martinez]\n{*laughing}\nWhoo! Cool & Dre baby\nOh! {*laughing}\nIt's club but it's still sexy\nHey! life is good\nYea, uh, uh, uh, yo\nWhat is that?\n\n[Angie Martinez]\nWhat's that sound?\nIf you outside the club, and your joint c'mon\nYou just pop the truck\nPull the car up and the line is packed, and you far\nYou tired a' waiting, you  better be catch a charge like\n\"Move bitch, get out the way\", flash the bouncer to get out a payin'\nAnd that sound make you wanna get on stage\nOh, you gotta' \"move dem thangs\"\nBeat change, it's a Cool & Dre thing\nThat'll move your thang thang, remove your ring change the sound\nGet your jewels all sweated up, the booze is deaded up\nAnything goes bring it back, if you just catchin' up\nThe sound coming outta' the club - that's wassup!\nAnd they let you up, finally, dancing it up\nMovin' aroung, DJ Keith - I need that sound (da-mn)\n\n[Hook: Angie and Missy]\nThat new shit, that hot shit\nMake you move shit - what's that sound?\nThat move crowds, that new sound\nMake you can kick down - who's that chick?\nThat's Angie, them bambi's\nScreamin' Angie - what's that sound?\n[Missy] And this Missy gettin' tipsy off the wiskey\n\n[Missy Elliott]\n2002 be sceered, cause I'm runnin' this shit this year\nHaters 'n haters you better be clear\nOr you'll be kissin' my pussy on the rear\nWhat I'm talking 'bout, with my filthy mouth, from the Dirty South\nIs a drug-drop, c'mon check me out\nAin't nobody does it easy-seezy\nAnd ain't nobody got the dick to sling me (owwww!)\nGod damn, what's that sound?\nDidn't I tell you I'm about to shake it down\nI'm no punk, but a killa like Cam\nGet on the flo', yes yes mam\nWhen I show up the club get cram\nInsecure bitch watch yo man!\nMe and Ang like butter on toast\nI don't mean to boast, but we do\n[Angie] I need that - yea\n\n[Hook]\n\n[Angie Martinez]\nHello-oh? oh that's my ears ringing\nI'm sitting here thinking that sound is still bangin'\nAs we leavin' the spot I'm still drinking\nGotta' leave cause the cops are still waiting\nSo we circle the block, as we workin' to blot\nThen purposely watch - we so blingin'\nAnd the truck is bright, light up the night\nBlinking, as we stuck in the chair feel like we sinking\nThat sound still drowned the air waves\nThe echo in my head feel like a bear cave\nSo I sit back to the sound of this track\nPlayin' on my way home - I can't forget that\nThat beat when you hear from the street\nMake you wanna get on the floor and don't even speak\nCause it don't even matter who be around\nGet.. and that's DJ Keith - playin' that sound (I need that)\n\n[Hook] - 2X", "year": null}]}