{"songs": [{"title": "Lost Ones", "album": "The Miseducation of Lauryn Hill", "year": "1998-08-25", "image": "https://images.genius.com/183da2198bbbc2e491fa0ed92a83a8bd.600x600x1.jpg", "lyrics": "[Verse 1]\nIt's funny how money change a situation\nMiscommunication lead to complication\nMy emancipation don't fit your equation\nI was on the humble, you on every station\nSome wan' play young Lauryn like she dumb\nBut remember not a game new under the sun\nEverything you did has already been done\nI know all the tricks from Bricks to Kingston\nMy ting done made your kingdom wan' run\nNow understand, L-Boogie, non-violent\nBut if a thing test me, run for my gun\nCan't take a threat to my new born son\nL been this way since creation\nA groupie call, you fall from temptation\nNow you wanna bawl over separation\nTarnish my image in the conversation\nWho you gon' scrimmage, like you the champion?\nYou might win some but you just lost one\n\n[Chorus]\nYou might win some but you just lost one\nYou might win some but you just lost one\nYou might win some but you just lost one\nYou might win some but you just lost one\n\n[Verse 2]\nNow, now, how come your talk turn cold?\nGain the whole world for the price of your soul\nTryin' to grab hold of what you can't control\nNow you all floss, what a sight to behold\nWisdom is better than silver and gold\nI was hopeless, now I'm on hope road\nEvery man wanna act like he's exempt\nHim need to get down on his knees and repent\nCan't slick talk on the day of judgment\nYour movement's similar to a serpent\nTried to play straight, how your whole style bent?\nConsequence is no coincidence\nHypocrites always wanna play innocent\nAlways want to take it to the full out extent\nAlways want to make it seem like good intent\nNever want to face it when it time for punishment\nI know you don't wanna hear my opinion\nThere come many paths and you must choose one\nAnd if you don't change then the rain soon come\nSee you might win some, but you just lost one\n\n[Chorus]\nYou might win some but you just lost one\nYou might win some but you just lost one\nYou might win some but you just lost one\nYou might win some but you just lost one\n\n[Refrain]\nYou might win some, but you really lost one\nYou just lost one, it's so silly how come?\nWhen it's all done, did you really gain from\nWhat you done done? It's so silly how come?\nYou just lost one\n\n[Verse 3]\nNow don't you understand, man, universal law?\nWhat you throw out comes back to you, star\nNever underestimate those who you scar\n'Cause karma, karma, karma comes back to you hard!\nYou can't hold God's people back that long\nThe chain of Shatan wasn't made that strong\nTrying to pretend like your word is your bond\nBut until you do right, all you do will go wrong\nNow some might mistake this for just a simple song\nAnd some don't know what they have 'til it's gone\nNow even when you're gone you can still be reborn\nAnd, from the night can arrive the sweet dawn\nNow, some might listen and some might shun\nAnd some may think that they've reached perfection\nIf you look closely you'll see what you've become\n'Cause you might win some but you just lost one!\n\n[Chorus]\nYou might win some but you just lost one\nYou might win some but you just lost one\nYou might win some but you just lost one\nYou might win some but you just lost one\n\n[Refrain]\nYou might win some, but you really lost one\nYou just lost one, it's so silly how come?\nWhen it's all done, did you really gain from\nWhat you done done? It's so silly how come?\nYou might win some, but you really lost one\nYou just lost one, it's so silly how come?\nWhen it's all done, did you really gain from\nWhat you done done? It's so silly how come?\nYou just lost one\nYou just lost one, you just lost one\nYou just lost one, you just lost one\n(How come, you lost one? It's so dumb)\nYou just lost one, you just lost one\nYou just lost one\nWhat a bam-bam!... hehehe\n\n[Skit]\nTeacher: Alright people, I'm gonna write something on the board. Let's spell it. First letter\nClass: L, O, V, E\nTeacher: What's that?\nClass: Love\nTeacher: What?\nClass: Love!\nTeacher: How many people know any songs about love?\nClass: Right here! I know a lot about love\nTeacher: Tell me some titles, titles of some songs\nBoy: Love\n(Laughter)\nTeacher: There's a song called love?\nBoy: Yeah!\nTeacher: There's no song called love!\nBoy: Yeah, it's by Kirk Franklin\nTeacher: Ok ok how it go?\nBoy: It go \"Love\" (Laughter)\nTeacher: Bet, bet, okay. Anybody else know any songs about love?\n(Mumbling)\nTeacher: I can't hear you\nGirl: I Will Always Love You\nTeacher: What about any movies about love? Know any movies about love?\nGirl: Titanic\nTeacher: Alright\nBoy: Romeo and Juliet\nTeacher: You didn't know that was about love till you saw it on TV and they said it was about love"}], "artist": "Lauryn Hill"}