{"songs": [{"lyrics": "[Intro: Dr. Dre + MC Ren]\nYeah, right about now Compton's in the mothafucking house Yeah do it, do it, do it\nN.W.A's in full effect\nHey yo Yella boy, kick me that funky-ass beat\nPump it up, pump it up\nYeah, who's in the mothafucking house right now?\nPump that shit up\nYeah, Compton's definetly in the house\nHey yo Ren, what we're gonna do?\n\n[Verse 1: MC Ren & Dr. Dre + Eazy-E]\nTo the people over here\nTo the people over there\nTo the people, the people, the people, people, the people, the people, people\nFrom everywhere watching the show\nPaying top dollars because they know\nWhen we're on the stage, we're in a mothafucking range\n[R] So Dre\n[D] What up?\n[R] Why don't you get the 12 guage (yeah)\nAnd show them how Eazy-Duz-It\nSo if you punks wanna make something of it\nStep up, run up, get up, what's up suckers\nYou want some of this?\nThen you're a stupid mothafucker\nKicking, like the kick from a kickdrum\nYella boy on the drum getting dumb\nProgramming - a beat that's hitting\nAnd if you listen then you know we're not bullshitting\n\n[Verse 2: MC Ren]\nDope - like a pound or a key (yeah)\nSo shut the fuck up and listen to me\nI make a killing - I got money to the ceiling (why's that?)\nCause I'm a mothafucking ruthless villain\nMC Ren - stomping any fool in my way\nWith some help from my homeboy Dre\n\n[Verse 3: Dr. Dre]\nNow my name is Dre - the mothafucking doctor\nRipping shit up (oh yeah) and here to rock ya\nWith some help from my homeboy E\nThe criminal of the ruthless posse\nFucking it up (word up) is what we do\nThe reputation of the N.W.A crew\nGetting busy because we're cold stomping\nAnd we're born and raised\n(And we're born and raised)\nAnd we're born and raised in Compton\n\n[Verse 4: MC Ren & Dr. Dre]\n[R] Speaking of Compton, it's making me sick (why?)\nEverybody's talking that crazy shit\n[D] Saying they were raised in the CPT\nJust as I was, they try to be like me\n[R & D] Popping that shit, get the fuck out my face\nKnowing that they never even seen the place\nClaiming my city is my city they claim\nMuthafucka we're about to put some salt in your game\n\n[Break: Dr. Dre (MC Ren)]\nYeah I'm tired of these mothafuckers running around town Talking about they're from Compton and shit\nTrying to get on the bandwagon\n(Yeah Dre, I know what you're saying man, but let's tell them who we're talking about)\n\n[Verse 6: Dr. Dre & MC Ren]\nWhat do you call a crew that can rap like that?\n[R] Yo N.W.A call them muthafuckers wack\n[D] Yeah you know what time it is, listen to why we call them wack\nThey got a wacky wack record with a wacky wack crew\n[R] Yo what about the lyrics?\n[D] That shit's wacky wack too\n[R] With a fucked up style and a fucked up show\n[D] Hey yo Ren, what about the scratching, is it def?\n[R] Fuck no!\nThe mothafucking record is so mothafucking wack\nThe mothafucking cracka jack needs to step the fuck back\n\n[Break: Dr. Dre (MC Ren)]\nDo you want some of this? Hell no\nDre the mothafuckin' doctor\n(Well for the record it's Ren and for the street it's Villain)\nDre the mothafuckin' doctor\n(Well for the record it's Ren and for the street it's Villain)\nYella boy, why don't you kick me one of them funky-ass beats?\nMy boy, my boy, my boy Ice Cube\n(Yo we got my homeboy Eazy E in the house)\nWon't you tell 'em what your name is?\n\n[Verse 7: MC Ren]\nMC Ren is the mothafucking coroner\nI'm getting rid of mothafucker as if they was a foreigner\nShow no grief to pretend when I sin\nA punch you can block it but I'm a still get in\nThis ain't a TKO in the first\nBut it's some shit from a nigga in black it's much worse\nThan a beat from Tyson, cause Ren is not nice and\nYour ass is better off just rollin' a dice and\nFinding you a number for luck\nCause you'll need it when you see I don't give a fuck\nMy identity, and the shit is getting shown\nWithout a video I'm still getting on\nI'm at a show then my picture is taking\nOne click of the flash and punk niggas are breaking\nTo the door, trying to join my fan club\nLip-syncing over one of my dubs\nThe instrumental will scratch for the moment\nUntil I fuck up the so called opponent\nThat's standing in the zone of the twilight\nSaying how in the fuck did he get mixed up in my fight\nIt wasn't a mistake, it was a set-up\nSo until I'm finished popping my lyrics you should shut up\nAnd don't attempt to speak\nBecause it's bad enough you rolling up shit creek\nWith a nigga like Ren about the hit\nNow let me hear you mothafuckers talk some more shit\nI'm a bust your ass in your mouth\nYo, unless you're saying - \"Compton's in the house\"\n\n[Verse 8: Dr. Dre]\nWho realy cares - about a sucker on a take off\nBust a move, we can have a shake n' bake-off\nMe and you can go cause I don't care yo\nRap fight or guerilla warfare\nWe can rumble, cause when my lungs go in and out\nI kick rhymes in a bundle to win a bout\nOr scurry or scuffle\nI just muffle the opposition, there's no competition\nLet them know that Dre is getting stronger\nCompton's in the house but now it's some longer\nI won't get set-up, shut up, I'm kinda fed up\nYou can say uncle and I still won't let up\nCause Dre is the mothafuckin' doctor\nAnd if me and Ren's on the mike it's like propaganda, no doubt\n(Boy you should've known by now) - Compton's in the house\n\n[Outro: Dr. Dre]\nYeah, it's time to put Compton on the map\nDon't ever think you can get it on, you stupid mothafuckas!", "album": "Eazy-Duz-It - Single", "year": null, "title": "Compton’s N The House (Single Version)", "image": "https://images.genius.com/89a572206fb4dcf4eed8fdcda372e536.293x294x1.jpg"}], "artist": "N.W.A"}