{"artist": "Positive K", "songs": [{"album": "The Skills Dat Pay Da Bills", "title": "One 2 the Head", "image": "https://images.genius.com/b2d81beafa9044cc3f1c0d999d00b913.640x640x1.jpg", "lyrics": "\"You're on the air\"\n\"Positive and L.G.\"\n\"That's that you know that really sounds\nThat that sounds uhh provacative\"\n\n[Verse 1]\nJump, jump, jump, jump, jump, jump, jump, jump!\nJump up and down and yo get excited (uh, yeah)\nPositive K, L.G. reunited (step up)\nGot a Phillie blunt, now don't ya dare light it (uh, c'mon)\nThis is my rhyme and I'm gonna recite it\nFirst up to bat, Pos K the party wrecker\nGot more moves than an effin' game of checkers\nAskin' if I'm nice with mine, don't say sorta\nI can sell an Eskimo a glass of cold water\nIt ain't no doubt you get knocked in ya mouth\nBe the eighth MC, that Rakim didn't talk about\nAll types of Positive, that's what the girls say\nGrown damn man, got no time for child's play\nScoop your daughter, be scared you oughta\nI'm so bad, that I can rob a drip of water\nI'm a new breed far from a young seed\nLike a Boy Scout daily do my good deed\nThe rhyme was speed but like a turtle be movin'\nI'm slow and funky in other words - I be groovin'!\nCause I'm the master, quenchin' your thirst just like a Shasta\nBecause he wanna - no, say because he has ta\nI satisfy, get 'em high just like a spanish fly\nOnce and for all, let me tell you who the eff am I\nCause I'm the man, from here to Afghanistan\nCambodia, even Iran\nBut I never ran, and matter of fact I never tried it\nIn a contest me fess, man you just the next man, got it?\nGood, he didn't know I coulda woulda shoulda meant\nAnd if he coulda, I think I he woulda shoulda went\nIf I didn't tell ya, then how would you know?\nPositive K's not your ordinary Joe\nI slay the dragon and freak the evil king;\nScoop the princess, put her under my wing\nMake her sing a song sayin', \"What a relief it is\"\nIf that ain't flavor - pssh - what is?\n\n{*\"In comes the one\"*} One to the head y'all\n{*\"In comes the one\"*} One to the head y'all\n{*\"In comes the one\"*} Uhh one to the head y'all yeah c'mon\n{*\"In comes the one\"*} Uhh one to the head y'all\n{*\"In comes the one\"*} Uhh one to the head y'all\n{*\"In comes the one\"*} One to the head y'all\n{*\"In comes the one\"*} One to the head y'all\n{*\"In comes the one, the one\"*}\n\n[Verse 2]\nLadies look at me as a man of leisure\nCause I can do the things that can definitely please her\nBrothers like to scramble, hustle, gamble\nWomen take the skin when I got a hell of a handle\nA chip off the block cause my daddy was a player\nOther words, hon, that means you don't have a prayer\nI gots the gifted tongue; the thing's from a cobra\nIf I kick it to ya baby, it's all over\nBeen around the world and my style nobody's fazin' it\nCause I'm sweet, sweeter than a Raisinette\nBut on the other hand I'm hotter than Tabasco\nYou rhyme first and I'll be the last to go\nI might win, lose or even draw\nBut it ain't nuttin' that I ain't never seen before\nThe only thing is yo, I never lost it\nAll I did was reinforce it\nNow I'm sturdy, sturdy as a girder\nVersatile with capabilities of murder\nProtectin' my honor as if I was a samurai\n\"Oh my back!\" is the sounds when I slam a guy\nI'm not above comedy and playin'\nThat's just my simple way of sayin'\n\nUhh, a-like that y'all one to the head\nUhh, like that y'all one to the head\nUhh, like that y'all one to the head yup\nA-like that y'all one to the head y'all\nUh like that, uh like that\nUh to the head y'all one to the head y'all\nA-like that y'all, one to the head y'all\nA-like that y'all\n\n[Verse 3]\nI'm gonna drop this rhyme!\nI'm gonna drop this rhyme!\nI'm gonna drop this rhyme!\nI hope it does skyrocket\nIf it does I'll be paid in my pockets\nWith fly things like Rolex watches and\nFur minks and diamond links\nYou see I got over the hump, bumped a lot of chumps\nJust like the mumps my pockets got lumps\nOn the contrary, as a kid I was seein' every\nSanta Claus didn't bring me things I wanted him to carry\nLike a, mansion and yacht, a big fat knot\nA girl with a Benz who love me a lot\nNevertheless there's things about me that you probably would never know\nDatin' back, to when I was just an embryo\nBut that's a theory matter of fact a hypothesis\nComing from the abdomen directly to the esophagus\nProtect myself against mishaps and tragedies\nAgainst backstabbers, faggot MC's I didn't leave\nSo welcome me back, as if I'm Kotter\nFor starters I'm gettin' more points than the Harlem Globetrotters\nNot flexin' or vexin', I'm a man who's modest\nAnd when I speak, I just likes to be honest\nSome say how I got famous this quick:\nCause I'm original like Kentucky Fried Chicken and the biscuit\nLoop your beats and save it on the diskette\nFor girls in the mini-skirts and the fishnets\nHigh heel pumps and their hair all done up\nI see 'em like that, I can't help but run up\nKick the gab and throw 'em in the limo\nTake 'em to the crib just to make a little demo\n\nUh, one to the head, one to the head\nOne to the head, one to the head\nOne to the head, one to the head\nOne to the head, one to the head y'all", "year": "1992-11-03"}]}