{"artist": "Apathy", "songs": [{"title": "Be A Better Man", "image": "https://images.genius.com/56863a1fcce089af3f654431482571b2.1000x1000x1.jpg", "album": "It’s The Bootleg Motherfuckers! Vol. 3: Fire Walk With Me", "lyrics": "[Verse One] [Apathy]:\nI've been sinning since I was seaman swimming fiending to be born\nDidn't respect women, my wisdom wouldn't be formed\nTill my father dropped knowledge on me, now I'm so torn\nRead the Bible during day, then at night I watch porn\nI need to transform, take the bull by the horn\nBut it's hard when I'm hard and the pussy look warm\nIt's harder when I'm broke and that coke make money\nEven harder when I'm hungry and there's air in my tummy\nMy outfit is bummy, I try to avoid greed\nBut this money in my pocket give me everything I need\nThe hoes and the clothes take a toll on my soul\nBut the soles in my Nike Air bubble got a hole\nAnd my goal is the gold then the silver but I'm told\nThat it's old and a platinum grill will keep your drink cold\n31 years old and I'm still being controlled\nBy the devils on the television eating at my soul\nI'm ducking 5-0, get a slut to try blow\nListening to Lil' Wayne on my stere-stereo\nA sinner, I know, but I figure I'll grow\nOne day when I'm grey and my life goes slow\n\n[Hook] [Apathy]:\nI'm trying to be a better man\nTrying to do the best I can\nTrying to come up with a plan, fuck the money in my hand\nGotta find a way to pull my soul up out the garbage can\n\n[Verse Two] [Bishop Lamont]:\nDepression is a motherfucker\nI said depression is a motherfucker\nCan't understand how, don't understand why\nWake up sometimes feeling like you wanna die\nChest all heavy\nMind all froze\nBullet in your brain\nSuck some pills, overdose\nLooking at the bottle, do you really want to take 'em?\nThink it over all night, in the morning DJ AM\nAfraid to live\nAfraid to die\nCan't tell if God listening, it's hard to yell that high\nSo you hit him on Skype, can't get no reply\nYet the devil live next door always waving hi\nIs he punishing me?\nIs he running from me?\nIs God real, are y'all just fucking with me?\nMy prayers don't get answered, my life is in a slump\nI'm a walking portapotty, whole world take a dump\nMy friends ain't shit, cause I ain't shit\nAnd the bitch that I'm with, she really ain't shit\nAnd you are what you eat, so she's really a dick\nYou good for nothing slut\nBut she keep me warm\nMake me feel like I'm alive when she lay in my arms\nEven though it's all a lie cause she don't want to go home\nThis ain't love, it's more of a convenience\nSo we pretend we in love, in real life we don't see it\nPull a Sixth Sense and just cover our eyes\nHope the ghost go away that keep haunting our lives\nBut you know it don't stop, it's never gon' cease\nWill you find peace of mind or just rest in peace?\n\n[Hook] [Apathy]:\nI'm trying to be a better man\nTrying to do the best I can\nTrying to come up with a plan, fuck the money in my hand\nGotta find a way to pull my soul up out the garbage can", "year": null}]}