{"songs": [{"image": "https://images.genius.com/9e73d61260db8a05228006f73422ec67.500x500x1.jpg", "title": "Can’t Spell Success", "album": "Famous Lies And Unpopular Truths", "year": "2016-08-22", "lyrics": "[Verse 1: Nipsey Hussle]\nFuck high school I'm trying find a lick\nCan't spell success, but I can buy a Six\nKicked me out the house, and told them they can split\nMoved off of 60th, and on to 5th\nStood in front of Nix and sold 200 nicks\nDrop it on the hood, by some scandolous crips\nBought my first Cutlass, eyes on my tip\n30 in the .40 incase you wanna trip\nBlacc Sam told me, Hussle, that's 200 cent\nIt was when I knew the world was mine without a fucking blimp\nMostly 50s, 20's and a couple 10's\nMoms counted with us, then she got a Benz\n\n[Verse 2: Cuzzy Capone]\nThanks to my mother, both my aunties and my grandma\nGod bless you, cause I know I was a handful\nThe foundation, I was running through the sandbox\nWith the growing pains, but the love never ran out\nBecame a man watching uncle Reg' and grandpa\nCorey taught me how to squabble with my head up\nHe told me, you will stop losing when you're fed up\nShow me how to get my own fucking handout\nWhere I'm at, niggas die walking to the corner store\nInstead of progress, candles burn and the Remy pours\nKeep an extra set of eyes if you're getting yours\nDesert Eagle shells flying straight through them hemi doors\nAnd back at Charlie's with the cavi when I hug floors\nLeft Slip rocks, wanting to be drug lord\nAt Penny Pinches used to hustle to the crack of dawn\nIf you ain't tryna get the money, what you in it for?\nWhat you in it for?\nI'm trynna get the dough (Cash!)\nCount me up\nStay on the lot\n\n[Verse 3: Nipsey Hussle]\nMoney, power and respect for the chosen few\nCame through on low pros now they know to shoot\nNineteen, fuck rap, I'm the local truth\nMe and Hub had the Alpinas, we the only two\nPromote the gang, live and die for my rollie chain\nRich, gang banging music, I know my lane\nCurb servin' off the corner was a protege\nPop the trunk and I'm manifesting my mobile ways\nReal Estate, repossessed and do you know the pain?\nBrodie in the state, I'm on the block quarter ounce of 'caine\nLife cycles and circles that bubble into rage\nTurn to self-destructive behavior, somebody light some sage"}], "artist": "Nipsey Hussle"}