{"songs": [{"image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg", "lyrics": "[Sample]\nHe's never going to stop being the juice\n\n[Verse 1]\nYeah, they told me, \"Don't make a promise you can't keep\"\nAll the drugs in your system, you can't sleep\nHow many times you had to buy a Plan B\nFor a girl you never bring back home to meet your family, man\nMan, I swear it's what I dream about\nEver since my mom told me that she need me out\nAlways smoking weed, 'causing trouble, never clean the house\nBut I paid her back for everything, I guess we even now\nNothing better than some head after a long day\nThat's the only thing that ever keep mine on straight\nAnd she asked me, \"Why the long face?\"\nHow I spent 350 dollars on this entré\nI drown my sorrow in that bottle\nToday is full of regret, fine forever in tomorrow\nMan up, what's the problem?\nEverything is Jazz and I'm Stockton (Haha)\n\n[Chorus]\nYeah, I know it seem a little bit strange sometimes (Yeah, yeah)\nEverybody live a little, everybody die (Yeah, yeah)\nThat's life (That's life), whatchu gonna do? (Whatchu gonna do?)\nThat's life (That's life), baby, I would spend it all witchu (Yeah)\n\n[Verse 2]\nAnd I'm headed to the other side, where the grass is always greener\nAnd your bitch is down to ride, but that ass is always meaner\nSee, my cash got deeper and my morals disappeared\nNever thought I'd be a asshole, this my last show\nCan I please get a standing ovation?\nA hundred naked bitches in my dressing room waiting\nWe lost a lot of blood for this fucked up nation\nBut me, I'm getting high, making love in that spaceship\nSo what are the basics? Tell me your problems\nYou losin' your job or, even worse, you don't got one\nSo hard to stay sober when you feeling fucked over so much\nAlways coming up short, you like the roach of a blunt (Yeah)\nAnd I could never sleep at night\nFuck paying bills, I need a brand new lease on life\nWhy does doing wrong always feel so right?\nWell, I guess, fuck it, that's life (That's life)\n\n[Chorus]\nYeah, I know it seem a little bit strange sometimes (Yeah, yeah)\nEverybody live a little, everybody die (Yeah, yeah)\nThat's life (That's life), whatchu gonna do? (Whatchu gonna do?)\nThat's life (That's life), baby, I would spend it all witchu (Yeah)\n\n[Outro]\nSay you running out of time\nThat's life, babe, that's life, babe (Yeah)\nWrong things on your mind\nThat's life, babe, that's life, babe (Yeah)\nSaid your heart been broken\nThat's life, babe, that's life, babe\nJust pick it up and keep going\nIt's alright, babe, it's alright, babe", "year": null, "album": null, "title": "Benji The Dog (That’s Life)"}], "artist": "Mac Miller"}