{"songs": [{"album": "Juice CD #059", "year": null, "title": "Bird Call", "image": "https://images.genius.com/6e60a7bdfc540196bfecd89695d4b4a8.600x600x1.jpg", "lyrics": "[Hook: J.R. Writer]\nTo all my hustlers, rock smugglers, strugglers\nBlock bubblers, pushers, cookers, pot jugglers\nWhats the word y'all, flip that herb, raw\nClap, that's the byrd call\nIf the cops are coming, get to hop and running\nQuick and drop that onion, ain't no stopping, young'un\nPut away that herb, raw, let us know the word or\nClap, that's the byrd call\n\n[Verse 1: J.R. Writer]\nI still be where the weed flip, in the P's with the trees lit\nSo much water in the order, it's just leaving them seasick\nWith a ski in my V6, trying to skeet on a b lips\nDown low, like I'm trying to keep her a secret\nAct wrong, chrome, passing me dome\nNext minute -- shit, I'm finished; she'll be flagging it home\nBut I always keep a straggler that's known to bone\nAnd run through a lap faster than Marion Jones\nMan listen, I still got them grams flipping, tan pitching\nCorner to the damn kitchen\nGained a couple fans, had to make a transition\nBut I'm still in the hood like a transmission\nNo cat can match me, I'm passing fastly -- who's half as nasty?\nI got it locked from here all the way to Cak-a-lacky\nBut keep a Mac for Scrappy, thinking its just laffy taffy\nShit, this beat'll be the only thing clapping at me\n\n[Hook: J.R. Writer]\nTo all my hustlers, rock smugglers, strugglers\nBlock bubblers, pushers, cookers, pot jugglers\nWhats the word y'all, flip that herb, raw\nClap, that's the byrd call\nIf the cops are coming, get to hop and running\nQuick and drop that onion, ain't no stopping, young'un\nPut away that herb, raw, let us know the word or\nClap, that's the byrd call\n\n[Verse 2: Lil' Wayne]\nBirdman J.R. and J.R., pigeons know who they are\nNiggas gotta pay off, snitches know to say y'all\nIf chickens on the radar, I’m at it\nCause I get it on my day off, ain't nothing like getting weight off\nScrape off the plates, shake off the flakes\nBag that and make all the cake\nI gotta lay off, the way y'all hate me like I’m Adolf\nBut y'all can't see me: Ray Charles\nI steal whores, I’ll probably take yours\nBecause you peel off and I take off\nGive me no space; whatever I want I takes\nWhatever I need I bleed and succeed\nBitch nigga, don’t breathe on the weed\nI’m fucking with them birds without feeding them seeds\nThat’s creed, you don’t know about it\nFull clip how I go about it, full body\nHard body, I’m like \"God got 'im\"\n\n[Hook: J.R. Writer]\nTo all my hustlers, rock smugglers, strugglers\nBlock bubblers, pushers, cookers, pot jugglers\nWhats the word y'all, flip that herb, raw\nClap, that's the byrd call\nIf the cops are coming, get to hop and running\nQuick and drop that onion, ain't no stopping, young'un\nPut away that herb, raw, let us know the word or\nClap, that's the byrd call\n\n[Verse 3: Cam'ron]\n\"Damn, homie\nIn high school you was the man, homie\"\nThat's what a fan told me, shit\nSame old cat, get his Kangol clapped\nBrains blown back; dissing Dame, Dame don't rap\nShame on black, the game's so whack\nDame sonned you children\nFrom in front of your building right to a hundred million\nG'head pimp it, pimping; g'head act up, doggy\nGet your limp on, pimping; if they acting froggy\nTell 'em back up off me; I come down, clap the forty cal\nThat's a badder story, not in my category\nMess around, Dame held Def Jam down\nPardon my back, jacking and the left hand pounds\nRedneck found, Tec Tec pound\nDuck duck goose, pump pump shoot\nShoot, lets get down\nIt may seem petty, but we all turn mean deadly\nFor green-fetti, my whole team ready\n\n[Hook: J.R. Writer]\nTo all my hustlers, rock smugglers, strugglers\nBlock bubblers, pushers, cookers, pot jugglers\nWhats the word y'all, flip that herb, raw\nClap, that's the byrd call\nIf the cops are coming, get to hop and running\nQuick and drop that onion, ain't no stopping, young'un\nPut away that herb, raw, let us know the word or\nClap, that's the byrd call\n\n[Verse 4: J.R. Writer]\nThis ain't only bars and tracks, this is for the hardest cats\nFlipping all the hard in back, make them catch a heart attack\nWhen you see the narcs attack, let me know\nStart to clap, clap, clap\nA star with a deal, Chopard be on chill\nThe car is DeVille, it's real ill, heart in the grill\nIt's foreign, my nills\nCruise the city with the semi or the celly\nOn skinnies like I'm starving my wheels"}], "artist": "J.R. Writer"}