{"songs": [{"album": "I Really Rap", "year": "2017-11-30", "title": "100 Percent", "image": "https://images.genius.com/8c75d09384d3e2e7dd519dae8ec8c1f5.1000x1000x1.jpg", "lyrics": "[Intro: J.R. Writer]\n100 Percent (100 Percent)\n100 Percent, 100 Percent (100 Percent)\n100 Percent (100 Percent)\n100, 100 Percent (100 Percent...)\n\n[Verse 1: J.R. Writer]\nLook... I'm why ya lady is missin'\nMike Tyson on the rooftop, I got a way with these pigeons\nI flex on 'em for the kill, then send it straight to the kitchen\nYa ex all in my grill, like she got face recognition\nMy corner looking healthy, I slide on you in the Shelby\nLaughing at you while I ride by, goin' Al Sharpton wit the selfies\nWide closet full of LV, I been ballin' nigga, who cares\nMy flow is off the charts, the Billboard, ain't nothin' new here\nI don't care about a just-due, I just do what I just do\nBurn the chicken, 'fore I pluck you, Russell Simmons know I crush grooves\nWant war, you will die hard, I don't really gotta come thru\nTop floor of the five-star, they like 'nigga, what you up to?'\nI come and loiter the scene, that's 'cuz my aura is mean\nFeel like I'm workin' for Motown, how I put on the Supremes\nI bring the horror to dreams, you cannot spar with the team\nYou don't see I'm off the hook? How could you ball wit Kareem?\nPlay wit me, you gettin' bogart I make a meme outta ya whole squad\n'Causin' ruckus with the long nose, Hazel-E before the nose job\nCatch Writer in the trap, black Viper with the black piping\nWhile you catch rides from where you at\nYour last Tidal was an App (facts)\nYea, I'm bout as rare as it be (Zeus)\nYou don't compare to a G, go get this weirdo a seat\nI heard the flow that you write, bet you ain't hear it from me\nThat's cuz I always been nice, nigga, Teairra Marí\nZeus!\n\n[Chorus: J.R. Writer]\nI'm dumbin' again, I'm bouta fuck up the rim\nI never come off the bench, soon as I come in the gym\nI put in 100 percent, I put in 100 percent\nI put in 100 percent (yeah), 100, 100 percent\n\n[Verse 2: Don Q]\nI put in 100 percent, I never come off the bench (nah)\nThis shit been comin' intense, I'm the nigga they don't wanna defend\nI might just take off and jump out the gym (yeah)\nThen I pull off in a Bent (skrt)\nThis where the stuntin' begin, I'll never be humble again\nWatchin' out for the sneaky vibes\nMovin' funny get'chu curbed quick\nFor the bird shit, I got a Eagle Eye\nI been here before and I seen ya kind\nHope this money never leave my side\nWho dat nigga? Let the streets decide\nSaid he lookin' at a 3 to 5\n'Cause none of these pussies is legalized (nah)\nNigga (yeah yeah), she said I'm covered in ice\nMet her twice at the Waldorf, I bet she gon' fuck for a flight\nWesley Snipes on the ball court, I had to hustle the white\nThe money the love of my life, tell the promoters to double the price, bitch!\n\n[Chorus: J.R. Writer]\nI'm dumbin' again, I'm bouta fuck up the rim\nI never come off the bench, soon as I come in the gym\nI put in 100 percent, put in 100 percent\nPut in 100 percent, 100, 100 percent..."}], "artist": "J.R. Writer"}