{"artist": "C-Rayz Walz", "songs": [{"title": "Body You", "album": "Singular Plurals Vol. 2", "year": "2003-01-01", "image": "https://images.genius.com/2238501193360671579094625bde2e3b.300x300x1.jpg", "lyrics": "C-Rayz Walz - “Body You”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): Jo Chris]\n[Sample: Johann Sebastian Bach - \"Brandenburg Concerto No. 3 in G Major\"]\n\n[Intro: C-Rayz Walz]\nBody you (x10)\n\n[Verse 1: C-Rayz Walz]\nRound Table talk from the psycho-faced author\nPut your money on this one that is a scorcher\nHot like summer days on Mars, some of these are stray bars\nInnocent emcees might get hit and scarred\nYo, shit's bananas, wild for the night.  Kids get hit\nWith the quickness, those metallic hoes leave no witness\nCrucial conflict is police containment.  My arraignment\nIs verbal.  I heard you, merge through\nSH5, herbal lye, disturbing news\nGetting my tax return for paying dues\nGassed up like poots in a space shuttle booth\nEn route to the sun in a jumping jack suit\nJheri curl juice on your sheep skin, short off\nThe deep end with spiked pillows sleeping\nFrom my passion in life, I'm splashing the mic\nYou want to body me?  (What?).  You must've seen a casket you like\nThis tip is hollow. One mistake, someone could borrow your life\nSo deal in the now (Blao!) or tomorrow's tonight (Blao!)\nI aim to laugh at your craft and blast silver (Blao!)\nAnd if you ever write rap, we'll kill ya\n\n[Hook: C-Rayz Walz] (x2)\nBody you lobby or stoop.  Body you\nFront of your building, elevator, back step, or the Coupe\nBody you on the mic, show and prove my sound\nBody you, bring it to the final round\n\n[Verse 2: C-Rayz Walz]\nMy new script is front-row music, stupid\nWant to reduce this.  Flows clog like mucus.  My exclusives:\nBody-you tracks.  Clue can't get his true spit\nIn life's movie, I direct like Kubrick.  You clueless\nI was born to do this.  You got no props\nCalled your girls house.  She was like, \"Who's this?\"\nImpromptu improvement nullify the nuisance\nTwist your wig like hurricane musician movements, show, prove\nAnd move quick.  See the aura from this brightly lit human?\nScientists wondering what I'm doing.  Poems on bones\nNear stones in Rome ruins.  Fuck police!\nThey'll body you—tune in full-frequency\n[?] you on the wrong side for choosing.  Be born\nAgain, body yourself in seclusion.  The rest\nOf fluid flows in my pen to paper unions, scripts I write\nBe sunlight hype like little children, but ain't nothing\nSweet like cotton candy, so slow your stroll\n‘Cause, in real life, I'm fat like Rolli Roll\nI'll body you and whoever you’re spitting close to\nApproach you where you lay your vocals and choke you\n\n[Hook: C-Rayz Walz] (x2)\nBody you lobby or stoop.  Body you\nFront of your building, elevator, back step, or the Coupe\nBody you on the mic, show and prove my sound\nBody you, bring it to the final round\n\n[Bridge 1: C-Rayz Walz]\nRun up, run up, run up on you\nAnd with the right crew...\n\n[Verse 3: C-Rayz Walz]\nOn the rise, [?] your fat snot.  Sleeping on\nThe D Train from the first to the last stop.  This is for\nThe have nots—take that.  I sing boasts\nFloat notes while my quotes crash yachts—take that\nDrop sixteen on an 8-Track, B.C\nDate cats: Before C-Rayz.  I was firedread\nRocking the solar cap, Red Rover rat\nGreen light, but I can't go for that\nNow go for this and get your wrist split with a hatchet\nPut holes in your cipher like a tennis racket\nBe a tough character: too petty to stress cats\nI'll body you on an MTV Celebrity Death Match (Kill him!)\nA smart kid grew up on a dumb block.  Kill you at\nA basketball game with a jump shot.  I'll body you\nFor thinking you could fake the art\nVampire bloodsuckers get a stake through the heart\n\n[Hook: C-Rayz Walz] (x2)\nBody you lobby or stoop.  Body you\nFront of your building, elevator, back step, or the Coupe\nBody you on the mic, show and prove my sound\nBody you, bring it to the final round\n\n[Outro: C-Rayz Walz]\nBody you!  NASA, Jo Chris, C-Rayz Walz, Def Jux, Definitive Jux, Ravipops, C-Rayz Walz, NASA, C-Rayz.  Word"}]}