{"songs": [{"title": "Make It Hot", "album": "VYP: Voice of the Young People", "year": "2008-04-28", "image": "https://images.genius.com/638b0a7f368a3faa2d1adfb605f4b99c.400x400x1.png", "lyrics": "Chorus\nI, I came to put it down\nStraight from New York to da A-Town\nHaters wanna see me down\nI ain't even put, put, put it down\n\nAnd when I'm flippin' the script and they gon be like-Oh\nAnd if I skip em' or chip em' they gon be like-No\nCause when I'm spittin' they sittin' cause they already-Know\n\nThis Real Music I Make It Hot\n\nVerse\nIt's Little Mama voice of the young people\nMouthpiece for the young breeze so slow ya speed..Whoa!\nI'm about dat fetty, about that dat dough, about dat flow\nAfter me that's as far as it goes\nCause Little Mama got whips and chains\nThe only time you see it bark is at a tear for I'm a walk ya game\nBeen G'd up since Hawk was lain\nSo you doubt me you doubt ya brain\nMust, must be insane to ever thinkin' that a chick like B could ever, ever see a chick like me\nThat's Crazy!\nAnd if you ever thought that it might be\nThen you betta step ya J-O-B, Up Baby!\nBeen crazy since I was a baby!\nNow ya girl switch write bars and spit crazy\nLet the whole world know I gets crazy!\nWit da music I make it hot\n\nChorus\n\nHot, hot my lyrics be popping\nOh how I could just spit it so sloppy\nThe way that I be rocking they probably think I'm cocky\nBut they don't know about me I grab it til I lock it-Down\nThey pointin' fingaz and chose me cause I'm a hold it-Down\nI'm spittin records and bet this you can't control it-Now\nThey spinning' records and notice that I'ma hold it-Down\nWit da music I make it pop\n\nPop, Pop dough school, pro tool\nGet in da booth and I'ma show you how a pro do\nMe to you whom\nNot even I could stand up when I\nWhy try look, my eyes don't lie\nI don't see nobody close as I\nI been lookin' through my periphial vision and I\nStart to wonder hypnosed is I\nNobody as nice as I remember that I, I, I\n\nChorus\n\nIt's Little Mama!\nVoice of the Young People!\n\nThis Real Music I Make It Hot\n\nIt's Little Mama!!!!"}], "artist": "Lil’ Mama"}