{"songs": [{"title": "No Bap Freestyle", "lyrics": "[Intro]\nAre you tryna say we ain't out here?\nAre you tryna say gang ain't still out here?\nWe still out here, nigga, it's real life\nI'm still 'round my city too, no bap\nYou heard?\n\n[Verse]\nPosted on that block, my niggas deep round here (Gang)\nM.A got it locked, still got the keys out here (Still)\nPolice got it hot, can't move no keys out here (Can't move that)\nSo much NYPD, blue can't see no green out here (Can't see it)\nDamn, these niggas snitchin', eatin' cheese out here (Damn)\nLike how the fuck y'all still let niggas be out here? (Like what)\nAyy, still move by my lonely, it's just me out here (It's just me)\nAsk about me in my city, they like, \"She out here\" (Facts)\nI'm the queen out here (Facts), ayy\nAnd I drop that top, make sure I'm seen out here (Skrrt)\nSmoke this dope up 'til I choke up, ain't no green out here\nWe big chief out here, exotic, no Reggie out here\nDon't drink no lean, no, we ain't leanin, we tipsy out here (Ayy)\nHennessy out here (Ayy), no, ain't no things out here (No)\nLouis V's, Christian D's, double C out here (Ayy)\nYeah, we drippin' drippin', that's how we bleed out here\nWe got dirty money but we clean out here\nAyy, don't you clean that bitch (Ayy) 'cause she a freak out here (She a freak)\nQuick to take your bitch, yeah, I'm a thief out here, ayy\nPistol toted, locked and loaded, don't you creep out here\nYou won't leave out here, R.I.P I'll hear (R.I.P)\nPut your picture on a poster, say \"Last seen out here\" (Damn)\nPolice asking questions, we don't speak out here (We don't speak)\nMan, bitch, I'm makin' millions, I'm barely out here (Facts), ayy\nBut I got them H-I-T-A-Z's out here (Them hittas)\nSo I'm quick to drop a P-R-I-C-E out here (Facts)\nThat's a price right on your head, blow 50 G's out here (50K)\nStuck in traffic in that Lamb', can't even speed out here (Skrrt)\nI was tryna do the dash like one-fifty out here (Skrrt, skrrt)\nEven when the sun ain't shine then I still gleam out here (Gleamin')\nVV's out here (Gang), can't even see out here (Okay)\nAyy, pull up to the club and make a scene out here (Make a scene)\nAyy, just landed in Miami, I'm papi out here (No cap)\nSend a DM to your bitch like, \"Ayy, meet me out here\" (Hello?)\nAnd I bet a hundred G's she meet me out here (Hello?)\nI book her flight but that's it, no trick or treat out here (No, no)\nNever cuff a thot by any means out here (No)\nI'm bobbin', weavin' hoes, I'm like Creed out here\nAnd, bitch, I'm 'bout my cake but nothin' sweet out here (No, no)\nI get paid, stay out the way, that's how I eat out here (That's how I eat)\n\n[Outro]\nNo cap (No cap, haha)\nGet money, mind my business, man\nThat's how we doin', man (Facts)\nNot for 2019 but for the rest of our lives\nYou know what I mean, that's how we move (You heard?)\nFuck all that street shit, we tryna eat, bitch (No cap)\nYou know what I mean?\nThese niggas tryna, these niggas still sleepin' still\n[?] like come on, shit\nI just freestyled this whole shit, swear to God, I swear to God\nKnow I ain't write shit, you can ask the engineers too (Facts)\nNo cap, man, for real just freestyled this whole shit, man\nShoutout to—, to the whole gang man, the whole real life\nYou already know the vibes\nBrooklyn, what's poppin'?", "album": null, "year": "2019-09-19", "image": "https://images.genius.com/f24b9d86557d73f3e78ce5caaabf3f17.500x500x1.jpg"}], "artist": "Young M.A"}