{"artist": "Canibus", "songs": [{"title": "Canibus /\\ Cambatta", "album": "Full Spectrum Dominance 2", "year": "2018-09-07", "image": "https://images.genius.com/fea25ba78bd67acfe5ae5963f098c1ed.804x804x1.png", "lyrics": "[Verse 1: Canibus]\nI'm a nine-dimensional being spitting photon directional beams\nCBD serve my medical needs\nMove your ass, nigga ain't got no gravitas\nI'ma tell you one time, me and you are not sized\nThere is no secret for patience, the key to being patient is sacred\nAnd those results are not easily taken\nYou want to build? Do it for real\nUnite, brother, steel sharpens steel\nListen to me, just (breathe)\nYea, I be old-school growling, communities by the thousands and counting\nComing down off a Mingledorff mountain\nWith books and tube pouches and million dollar equipment vouchers\nEducation, you ain't shit without it, how about it?\nThey took the game make it hard to support that lane\nYouTube views probably bought that fame\nI'd rather go to bass shop pro than deal with yo ignorant ass, yo\n'cause our people are always last to know\nRap music should have been had unions, but it don't\nTry to get 'em to stop the confusion, but they won't\nAnd now here we are, 2018, still got the same problems\nChaos a prelude to conflict\nYou know necessity is the mother of ideas\nAnd a bad idea is the father of all fears\nThe black and loud herd mentality crowd dreadlocks\nBe looking like some dirty ass black and mild's\nIf you ain't melanated? Black or brown? You ain't down\nHow that sound? Who's possessed by the spirit of a savage now?\nYou better check them false facts in your files\nDivision'll have your mouth starving looking for a hand out\nMan down, everybody fan out, it's your fault the plan went south\nSay the word you the big man now\nI don't think so, they move every way the wind blow\nKimbo, purse snatch a bimbo don't get shit though\nHomie, these niggas lonely and phony\nCrowd-funded for groceries, some of these Hotep niggas is hungry\nI germinated the waters, you just tasting out of my faucet\nYou like the taste? We created the sources/sauces\nThe Jamaican mason cooking Cajun bacon with a fig-leaf apron\nWith the information to raise a nation\nThe green is the Ankh, the black is the God\nMy gold staff is a stick that makes buckets of lard\nLord Have Mercy, that nigga got bars\nJames Bond with a turbo-saw, but still they resent the God\nSpit bars til my voice goes hoarse, circular saws slice jaws\nNo novacaine but take twice as long\nI am the monk of Mingledorff, I mutilate every single song\nMy drum machine cut your fingers off\nLet's talk; I see where you went wrong\nYou was smoking embalming fluid out the morgue and held your breathe too long\nYea, I'm floored but my God is an awesome God\nMeanwhile, your paws are too short to walk with dogs\nMt. Rushmore Olmec face; your security clearance not up to date\nSo I'ma have to stop you at the gate\nThermovision whistles and bells, your superheat smells\nSo on your way to Hell let me give you this cool gel\nSound off, let me hear you yell; who you gonna tell?\nWhen I was proof-reading the grail? You was learning how to spell\nTalk to my abbot; I hooked the dragon up to your wagon\n2018, you talking about horsepower, you lackin'\nLayerin raps, matching, you still mackie-board four tracking\nRip the Jacker got all the action\nCanibus, canned by the classic, Full Spectrum Dominance\nTriple blackness, release the albino kraken\n\n[Verse 2: Cambatta]\nOn the bible, I swore solemnly\nLord watching me, born of a moor progeny\nSource of a pure prophecy\nBefore Constantine, travel to Nicaea and courted a core following\nModestly, freedom before sovereignty\nI don't believe in the theme of a war policy\nAmistad, land of the street and like four blocks from me\nCinque speaking and God orator pompously\nMy phrase couplets change the way brains function\nHard metal skin brown 'cause it's rain rusted\nTie ropes to your limbs then i play puppets\nCut a hole in your stomach then i make munchkins\nI ate tongues to taste tastebuds\nIf you taste my tastebuds you'll taste bud\nI showed up at gunfights and gave hugs\nMake em put they guns down\nShoot em with the same gun, blame drugs\nFailure is the best lesson\nShe didn't know my name but she kept guessing\nI told her gold string makes the best threading\nWhen I rump, my steel skin deflects weapons\nTeflon chest vested, lungs burning\nBreath ganja, sweat resin, ep-lep-tic (epileptic)\nBefore the beginning I knew the best ending\nThought of the answer before the next question\nSoothsayer, earth sun moonmaker\nBorn instantly, mother never knew labor\nShroom taker, Obi with the blue saber\nLegend King James left out like a new maker\nWho's greater? I draw a circle on a Etch A Sketch\nNo birth defects but I got death defects\nExhale, reach out, catch the breath\nWe inhale it back in before the second breath\nMelchizedek, hope is like a god that I never met\nSleeping so hard that I rest erect\nI found a treasure chest\nI'ma carry as much as my hands hold then I'm leaving you whatever's left\nI rotate the earth with my feet\nLike I'm running on the top exterior of a hamster wheel\nHe's the Morpheus, I'm the Exile\nIn the simulation, we got the keys and the pills\nDr. Seuss talk to Zeus\nJump up, grab the sun, alleyoop\nBreak the chain to the subconscious loop\nProphets' moms are commonly prostitutes\nGod's recruit, lies are the honest truth\nCrabs are big spiders in lobster suits (cute)\nPen sharp, when I write cut a desk in half\nMy writtens are better chiseled than metal slabs\nLift iron, my sceptre's a magnetic staff\nLong blade hidden inside like a machete has\nRepenting penning a pentagram in a pantograph\nFresh up out the pen in a pentagon with a weapon stash\nGet it past, sleight of hand, Penn & Teller fast\nFast like the Pentium i9 that Dell'll have\nHeavy like appendix that Adele'll have\nWhite singer, Lightbringer, let the devil cast\nHorse legs, Annamite figure goat head attached\nBorn Siamese till I ate the second half like a breakfast snack\nColorblind, only see things in the three that my spectrum has\nGreen, red and black like the Kenyan flag\nEvery fella Helen Keller ever met is black\nI love neck so much I bought a pet giraffe\nBang arm like funny bone and then I laugh\nFist iron, beat sand out a heavy bag\nRight jab, right jab, tip to the left and jab\nLeft body uppercut, head hit the leather mat\nHopefully he wakes up after ten seconds pass\nI hit him harder than gettin past a depressin past\nI throw my du-rag in the sea and trigger a three\nHundred and sixty degree tidal wave\nWe are each one cell in a giant brain\nLife a game, self is the boss in the final stage\nCompared to the Nephilim, Yao Ming's a dwarf\nKing of lords with double door to Mingledorff\nCambatta, Canibus, bring a cross\nCarry it up a mountain till we exhaust"}]}