{"artist": "Vanilla Ice", "songs": [{"title": "Fame", "year": "1994-03-22", "lyrics": "[Verse 1]\nNow everybody wants to have fame\nBut you'll pay the price if you're not playin' it by the game\nCuz this game is made up of a bunch of crazy rules\nAnd fools get took if they're not playing by the rules\nNow, the Ice is kickin' it, kickin' it kickin' it like a champ\nBut don't try to play me like some wet food stamp\nThey say that it was a fluke\nCuz I used a fat loop\nBut here's the sccop, troop\nThe Ice is back to make it hoop\nAn' since it's 94, and now I'm back on the scene\nEscapin from the hell of takin' it to the extreme\nIt's kind of strange, cuz people say you've changed..\nBut I never changed\nEven though I got Fame\nYo, I'm still the same... Ugh!\n\n[Verse 2]\nFame, I'm still the same person\nI never ever switch, an' even if I'm rich\nBut now it's like an itch\nCuz I love the music\nThey say I do it for the money\nAnd it's funny, clockin' all the honeys:\nThe ones that used to dis\nNow they wanna kiss\nLookin' at what my troops got\nNow they're getting their boots knocked\nDamn it's a shame - do I love 'em\nNo I don't \"G\"\nA couple of years ago, they didn't want me\nNow I got these so called friends\nIt's down with the Ice, Cuz they know I'm makin' ends\nBut my real friends have been friends through the fame\nAn' since I have fame ain't a damn thing changed\nYo I'm still the same... Ugh!\n\n[Verse 3]\nAnd let me tell you about the pros and the cons\nFame only lasts if you keep droppin' them bombs\nNow in the public eye - you know I'm havin' to admit it\nYou become a target for a whole lot of critics\nReporters stickin' to ya like white on rice\nNow everywhere I go they wanna interview the Ice\nBefore every show it's like I'm steadily surrounded\nBy all of my fans and the media's houndin'\nThis is not a dis cuz I love all my fans\nBut the media doesn't really understand\nThey take what ya say, twist it around into lies\nAnd the next thing ya know\nA bunch of rumors start to fly\nThen they try to make you out to be a straight liar\nAnd next you'll be the front page of the National Enquirer\nOh what a price to pay to play this crazy game\nYou betta' be prepared if you ever reach fame\nYo, I'm still the same... Ugh!", "album": "Mind Blowin", "image": "https://images.genius.com/f7a76335917daad02db3cc269ea9667e.498x500x1.jpg"}]}