{"songs": [{"year": null, "image": "https://images.genius.com/9c7203e565e56a244f10c1741d29f204.640x640x1.jpg", "title": "Money", "album": "A Song for You", "lyrics": "[Intro: Bizzy]\nBizzy Bone, you know what it is baby\nAfter Platinum Records\nLet's get this money '07 style\n\n[Hook: Bizzy Bone]\nMon-eyyyyyyyyyy (yeah, yeah, yeah)\nMon-eyyyyyyyyyy (yeah, yeah, yeah, yeah)\nMon-eyyyyyyyyyy (yeah, yeah, yeah)\nGotta get that money money, gotta get that money money money money\nMon-eyyyyyyyyyy (yeah, yeah, yeah)\nMon-eyyyyyyyyyy (yeah, yeah, yeah, yeah)\nMon-eyyyyyyyyyy (yeah, yeah, yeah)\nGotta get that money money, gotta get that money money money money money\n\n[Bizzy Bone]\nI don't give a fuck what they sayin!\nBuck buck buck buuuuuuck!\n\nI'm ridin the Caddy and daddy I'm rollin it sadly, but I don't mind\nIf they laughin at me the movie I hardly think they be singin Sadie\nI never gave up on my lady, but she still ain't listenin to me\nGotta let them 24's spin, chins ain't chippin or flippin\nAnd let me get another victim again, gain-gain-gain\nThey win in the beginnin in the endin I'll befriend 'em, where they say I was\nBut I been right here cuz, you know what it is, you know what it was\nSo they wanna move, do what'chu gotta do, who? Not me!\nI said I'm glossy, and who you callin flossy baby\nBut baby I'm not 'Pac, no! And I'm not God, no!\nBut I float like a butterfly, sting like honey\nMo' money money money money money money, in the face of the crowd\nLighter now, I don't need no pride to hide, oh wow, oh wow\nMo' money money, in the face of the crowd\nLighter now, I don't need no pride to hide, oh wow\nBut baby I'm not 'Pac, no! (buck buck buck buck buuuuuuck!)\n\n[Hook]\n\n[Twista]\nGet knocked out by the Windy City southpaw (uh)\nNo cookin in the kitchen homie we put out raw (yeah)\nMidwest outlaw, fuck with it? I doubt y'all\nSomewhere between Chi-Town and Cleveland is where they found y'all (woo)\nRollin through the alley in the Caddy\nBlowin Cali to the haters, oh what a pity (uh-huh)\nWhen they hit it nigga Twista rockin city after city\nThey gon' ask, \"Is he doin it with Bizzy?\" (what?)\nAnd you know why they done that (why?)\nBecause we two of the coldest motherfuckers\nTo spit these fast lyrics on one track (woo)\nBuck 'em with a lyrical bullet in the body\nBecause I gotta get the spot, I know the shit don't stop\nPull up in the Lamborghini or the Ferrari\nI know I gotta get the guap, cause I gotta get the drop\nGotta get the dough and get the money money\nI can really feel it when a hater comin for me\nTry to get it if you think you feelin kinda lucky\nTwin Glocks so you know you better bring a buddy\nAnd I got the ammunition for anybody\nThat wanna go against the Midwest Militia\nA whole clip at the competition for Bizzy\nA whole clip at the competition for Twista\nA whole clip at the world, because it's us against it\nAnd this shit about to get ugly\nFor static, I'mma hit 'em with the automatic\nRun and do murder after murder but I'm a baller so I gotta get\n\n[Hook]\n\n[Bizzy Bone]\nBuck buck buck buuuuuuck!\n\nMe and my brother Twista gettin it crunk\nAnd drinkin that Goose-y witta me brew\nDoin whatever we want to do, get to the club, ain't nobody knew\nThought that we beefin they try to divide the troops\nTalk about who really started the style\nHow 'bout everyone livin in harmony, look at the army now\nGeneral sendin a bevy of spirits and we gonna get it\nLike heaven we dancin our way to the gates\nIf you comin with me and we Muslim\nWe human with all of the brethren (brethren)\nVeteran deep in the city, I pity the foolish that ride with the snake\nWhat do I look like massagin the thought\nWhen they come with the matrix and say that we fake\nWe'll never break, 'member that Kanye and Twista\nWe're gonna go through the fire\nNever expire, give it the way that they want it\nThey'll find out from you if you tired (what about)\nMoney you tell me what's money to you, paper that represent currency?\nOr is it worm wood, better burn good\nThan a brain ray, with the energy certainly\nI don't have time for emergencies\nBaby the word that be rollin the covenant\nJump in the - party and pop in the melody baby\nI know that the ladies be lovin it\nBrush the dust, enemies way, get 'em a drink, we look too lovely\nThe spirit is present and never be hesitant\nTwista and Bizzy be gettin this money, nucca\n\n[Hook]"}], "artist": "Bizzy Bone"}