{"artist": "Inspectah Deck", "songs": [{"title": "Do My Thang", "lyrics": "[Intro: Inspectah Deck]\nPsycho LES, what's good?\nIt's like my nigga Dirty would say\n\"Come on, baby baby, come on, baby baby, come onnnnnnnnnn\"\n\n[Hook: Inspectah Deck]\nI make shots ring, watch poppa swing\nI said I shine in the mind, plus the watch and ring\nI get down, when I do my thing\nI get down, when I do my thing\nLittle hot thing, wanna rock the king\nSo I put the stroke to it, and broke the box spring\nI don't play, when I do my thing\nI don't play, when I do my thing\n\n[Inspectah Deck]\nWho the block king, nuff rocks and things\nAny spot that I pop, cause cops to sting\nAny spot that I rock, gotta pop for C.R.E.A.M\nFor my thugs thats locked in the box and bing\nI rip the roof off, this dude's the boss\nTo start a war, we can fly and catch my music off\nI said I'm like Skywalker, when I use the force\nBad broad on my side when I cruise the Porsche\nCross state line, all drapped in shine\nI make minds with the tape, or the cakes or pies\nShopping fives on you mami, how you shake your thighs\nGirl you fronting, you ain't cutting, why you waste your time?\nI hit the Power-U, for bout an hour or two\nGirl you took it like a champ, how down are you?\nI said you took it like a champ, like you now my boo\nSmash it, no attachments, is how I do\n\n[Hook]\n\n[Inspectah Deck]\nNow watch Deck go, rep sets for dough\nI spend time with a dime, I don't sweat no ho\nSon shine with the rhyme, yeah, Deck's a pro\nAnd since I lived the wild life, yeah, checks'll blow\nCome and test I, many heads'll fly\nI said enough men'll die and the best'll try\nAny bets on the side, that's a bet for I\nPep step with a glide and I rep my side\nGet your bounce on, we be out til dawn\nAnd I'mma bounce with a tall chick around my arm\nIn the Porsche, wicking off with an ounce of charm\nYou were try'nna play that wall shit, you now went wrong\nPoppa got this, go pop your Cryst'\nI said, even super thug gotta rock to this\nShe was creeping through the club, I spot ya miss\nIs you dancing to the song, or is you riding the (riding the)\n\n[Hook]\n\n[Outro: Inspectah Deck]\nJust do your thing..\nNew York niggas do your thing..\nOut of town niggas do your thing..\nOver seas niggas do your thing..\nYeah, we in the place..\nUnda Dogz, UD'z, Urban Icon..\nYou dig?", "image": "https://images.genius.com/b594b451e76ffa06266ec5bb5611cfd9.500x500x1.jpg", "album": "The Resident Patient", "year": null}]}