{"artist": "Warren G", "songs": [{"year": null, "lyrics": "Intro* Ooh yeah, yeah, What's\nLove got to do Warren\nG rap, for me yeah-eah, yeah, mm, mm Verse\n\n* 1 When G-dog the, hog come, up in the place There's\nDollar signs in your eyes and a smile in your face You\nWanna live fat all, for my sack You\nGot more drag than a low lo-do cut, the act 'Cause\nBack before '92 and '93 You\nDidn't give a damn about Warren G But\nNow that I'm slingin' platinum lp's All\nOf a sudden you, on my N You. T's. Ain't\nNothin' you can do to make it stop 'Cause\nMoney makes the world go 'round and the panties drop I\nAin't in love though I, don't need the pressure I\nJust wanna dig it like I'm diggin' for treasure Some\nOf y'all had a good thing that you couldn't keep Thought\nYou was tlc you, had to creep You\nSay you had love I, said you need to quit It's\nAll about the dough so, what's love got to do with it Chorus?\n\n* What's love got to do got, to do with it (that's right) What's?\nLove if you don't respect the game (uh-huh) What's?\nLove got to do got, to do with it If?\nYou lack in this game it's, a shame you, won't make it Verse\n\n* 2 Now I'm, the type of brother that's down for mines Before\nI made beats I, was down to grind Back\nThen every, single homey had my back Now\nThey're peepin' my stack and they're talkin' bout jack But\nI'm the same brother day in and day out And\nI'm-a stay that way until the day I lay out in a casket It's\nDrastic 'cause, homies is plastic Break\n'em off some bread they, want the whole damn basket If\nYou's a true homey you, would wish me well Not\nPlot to see a brother fell jealous, as hell We\nUsed to get the same riches Now\nYour trigger-finger got the itches schemin', on my riches Which\nIs not a suprise my, eyes peep game 211's\n187's, it's all the same It's\nAll a shame homies'd, jack you for your grip Ain't\nNo love involved because, it's all about the chips Repeat\n\n* chorus Verse\n\n* 3 Now for these labels tellin' fables Makin'\nThe messed-up deals under the tables You\nThink that you smart but, fool, I'm, the smartest You\nCan't make no money if you can't keep an artist Sign\nThe dotted line put, 'em on the shelf Break\n'em off some crumbs keep, the rest for yourself I\nKnow how it goes treat, an artist like you know Fly\nCars gold, clothes, but, no dough Since\nIt's all business I'm-a, handle mine Keep\nTrack of my stack down to the very last dime 'Cause\nIn this rap game it's, all about the buck You\nBend over for the label and you will get bucked Like\nHow we run up in the skirt and, then you're through The\nRecord label do the same thing to you 90%\nBusiness 10%, show Ain't\nNo love in this game 'cause, it's all about the dough", "image": "https://images.genius.com/5686f9398745abf989ef2336fa794264.307x307x1.jpg", "album": null, "title": "Do What It Do"}]}