{"artist": "Kid Ink", "songs": [{"image": "https://images.genius.com/a0ff5f67f4b877d8884d12fcc5f17237.500x500x1.jpg", "title": "Feel It", "year": null, "album": "Crash Landing", "lyrics": "[Hook]\nCan you feel it?\nYou can turn me up\nCan you feel it?\nYou can turn me up\nSo you can feel it\nYou can turn me up\nI got a bottle on me\nShots on three, Can you feel it?\n\n[Verse 1: Kid Ink]\nYeah, I could feel it on the way, never fray\nIn the building like, this is where I stay\nMy estate, put your drink in the air if you relate\nPlenty fish in the sea, we throwing money like bait, uhh\nNow let me see you shake your body off tempo\nYour body so cold and I can see all of the symptoms\nIf you come into my section, you ain't even gotta mention\nIt's about a couple bitches, bag of Swishas on my niggas and we\nGetting it, you should come and feel this\nLive the sweet life, need a filling\nTake a hit then inhale and release\nGotta pocket full of trees, baby we ain't gotta leave till you feel it\n\n[Hook]\n\n[Verse 2: LoS] Let's go baby\nI told her honey how you feel?\nIf I could I would marry you, But for now I just bury you\nIn 20 dollar bills, uhhhh\nMy watch be winking at you, my link be blowing kisses\nYea bitch I’m blowing money, like Ink be blowing swishes\nI’m swinging low on dishes, them guts all yellow\nMy paint sky blue, you could say my car mellow\nI get your girl to get ghost bored, I go hard\nIf I post up on this, she’ll be sending you post cards\nShe love how fucking a celebrity feel\nI Roberto Cavali her body, Giseppi the heel\nI’m definitely chill, we drop top in them Beverly Hills\nAnd we be rolling rolling blowing strong\nGoing going going, gone\n\n[Hook]\n\n[Verse 3: Milli Millz]\nUh uh, Ho you don’t feel it when I guess you paraplegic\nStart sunning niggas, I think I’m playing with Phoenix\nAnd I’m balling with my shot like I’m Gilbert Arenas\nAnd I’m breaking birdies down, Serena and Venus\nGo turn it up, set a nigga steady burn it up\nClothes stay hotter than furnace, they waiting on me like hurry up\nYea, I’m on the web like Charlotte\nDon’t panic, don’t clutch, Glen Rice with the Hornets\nShe’s like real city nigga, I need me a Bugatti\nTalking bout the game, in a pocket like polly\nAnd all my niggas that he ride with, chrome\nPut that metal to your side like an iphone 4\nAnd that’s when you\n\n[Hook]"}]}