{"songs": [{"year": "2018-12-22", "title": "Rush Hour", "image": "https://images.genius.com/bfaec1a0bac7ea0de2beca8ef167e036.500x500x1.jpg", "lyrics": "Yeah...Tie!\n\nThese niggas giving me hard time\nAnd I'm kind of sensitive its part of my star sign\nSe me dropi punch pe me commiti mass crime\nKill niggas that shit is part of my part-time\n\nSpending my last dime on rolly but that’s fine\nCos half a milli anytime I'm dropping a hard line\nWhat the fuck is there for me to proof? I'm not lying\nY’all niggas can take over the game when I stop trying\n\nMike Mill nigga tryna put me in beast mode\nStreet niggas now violating the street code\nFucking just be dope just come let me see close\nYour body your mind I mean i'm just tryna read both\n\nNiggas is shallow its all because of the fucking people you follow\nOrganising a gallow you run away from your shadow\nNiggas be throwing the arrow they tryna get me to wallow\nWo cash a wode rushi no to tilapia wo Balo\n\nMesrew Capo rap mu El Chapo\nDie me ba beye no nti menua  charlie hye wo sapo\nMu nsuo Yese ye hwihwe me wo Interpol\nMe menta nsere even my daughter dey give ****\n\nFirst of let me break it down\nWho is the best in Africa who deserves the crown?\nIts a conversation when a king is not around\nYou ain't gonna understand shit you like the way it sounds men I came in unannounced\n\nTruth is we gonna decide who the shoe fits\nSwag is impeccable dont compare me you stupid?\nWay before the drums I was still doing acoustic\nInsecure niggas be kissing ass for blue***\n\nI'm the realest already told you\nDo we have to go back and forth? I'm not supposed to\nI stay relevant dawg let me coach you\nI'm the type of nigga you talk shit I approach you\n\nThe return of the realest so what the deal is?\nThis is the Game of Thrones me ne me killers\nMo mma me a couple Tequilas I hope you feel us?\nWe no be normal rappers a bunch of Gorillas\n\nMe rap style ye heavy\nMe squad ba a ye ready\nMo nye ready to beef me ba Titi kora aye pedi\nEba no rap a enka bi\nNa kasahare ye me mpena a mo mofre no rap me mefre no Derby\n\nStraight outa oven baby niggas is still hot\nEya a na monte mase all the skill that I still got\nAnka wo ye me a anka sese mere yi you got some pills pop\nBut I dey age like wine rap mu chilled Scotch\n\nBeen to the BS I'm still relevant\nEverybody get on your knees ladies and gentlemen\nBoys copy me blueprint I need some settlement\nIts Rapperholic time baby i'm in my element\n\nThe flow tight my whole life I chose mic\nI’m so nice murder the beat with no knife\nMo nye me level Obidi be living the dope life\nMe nipa ko wo akyi na wo antete wo Ajos Pipe\n\nA divine leader\nI was born to do this and I’m still eager\nI'm always keeping it real-not a crowd pleaser\nMe kaase ye kom and listen to your class teacher!\n\nThis is some suicide shit charlie who is that chick?\nFre no ma me whoever the true cap fits\nMa relaxi na me massage two black bitches\nFirst question ohemaa do you suck dick?\n\nSorry I don’t fuck with hoes\nMete stripclub but I'm still catching the Holy Ghost\nObi se Sarkodie nrapi well I guess its only those\nNiggas a omo claimi designer Polo na omo hye Fos", "album": null}], "artist": "Sarkodie"}