{"songs": [{"image": "https://images.genius.com/859f21e88f70d1ad36d049e5cd7f2f90.750x750x1.png", "title": "Blacc Ice", "album": "Bullets Ain’t Got No Name Vol. 2", "year": "2013-10-02", "lyrics": "[Intro: Nipsey Hussle]\nTake y’all on a little trip\nTo my side, Slauson Ave\nTop of the mornin’\nAin’t nobody out yet\nPaint this picture for you\n\n[Verse 1: Nipsey Hussle]\nI’m Slauson Ave. and everything on that street\nUsed to carve our names into wet concrete\nUsed to sell dope, and I still smoke weed\nJust got a record deal, but I been had cheese\nLookin’ at my pieces, like I been had these\nLookin’ at these streets like there is no peace\nFaded off a strain of that strongest leaf, like\nIf only these damn palm trees could speak\nBut they can’t, so they don’t, I could, so I will\nSome people never do it, they just wonder how it feel\nIn the hour of chaos, come the water by my wheel\nLike, it’s all an illusion and the only thing real\nIs me, and we, whatever we believe\nAnd that’s what we project, so that’s what we perceive\nEmbedded in my mind, it’s the code and the creed\nNever went against it as I rose in these streets\nWe was, two deep in a cuddy on E\nAnd Fats dropped a blunt and burnt a hole in my seat\nUsed to get butterflies when I roll with the heat\nBut, not for long, say goodbye to the sweaty palm\nYoung nigga on a mission, tote heavy arms\nYoung nigga wanna bang, it’s a heavy cost\nNow what he got up in his brain, that’s a heavy thought\nTurned a nigga out, had us murderin’ for clout, look\nAnd this is it\nMy reality is creep\nSlauson Ave. gangbang shit\nNip Hussle, look, look\nAnd this is it\nMy reality is creep\nSlauson Ave. gangbang shit\nNip Hussle\n\n[Verse 2: Question]\nI’m Military Drive, everything on that strip\nWest Avenue and Fresno, heritage to the sticks\nThat ole trailer park out on highway 90\nOr down on Colobra road, you might find me\nBlindly pacing in the darkness, heartless\nLivin’ out my car, gotta find a place to park it\nSwisher full of dirt weed, spark it up\nLookin for change like a bum with a plastic cup\nLike fuck the police, I been harassed enough\nWhere good men get turned to ash and dust\nWhere cash is lust, with massive nuts I hold\nThey bust AK47’s 'til their guts explode\nAnd they stain the asphalt permanently\nDaemons hold a player down when he determined to leave\nBut my kid’s graduation, I’m determined to see\nNever knew how right Jeremiah’s sermon could be\n‘Cause God damn America, the system is flawed\nSo we pump this d, avoid apprehension by law\nLay and brawl, and the black ice invisible\nIt’s either Mickey D’s or be a full time criminal\nYeah\nAnd this is it\nCause my life is shit\nHip hop is all I got\nKnow what I'm talkin' about?\nTexas out to Cali' baby\nEssay to L.A\nNip Hussle\nSlauson Boy\nQuestion\nFuture of the south"}], "artist": "Nipsey Hussle"}