{"songs": [{"title": "If I", "image": "https://images.genius.com/6c258cf65eef13108dc10c3720ad2a25.1000x1000x1.jpg", "year": "2017-07-26", "album": "Purple Summer 03: Purple Hearted Soldier", "lyrics": "[Intro: 03 Greedo]\n03\nGirl how you ain't keep it G?\nYeah, touch down\n\n[Chorus: 03 Greedo]\nIf I went down would you stay round?\nIf I went down would you stay round?\n\n[Verse 1: 03 Greedo]\nIf i admit that I'm a fugitive\nIs you gon' ride and save the pussy if I do a bid?\nSkinny nigga but I do it big\nI'm paranoid so I keep a chopper and a SIG\nIf it get down and I can't get to it\nWould you burn a nigga down, smoke him like a cig\nI need the type that don't run from the dick\nAnd she don't leave a drop on my fit when she swallow this shit\nUnload it, I hollow the tips\nMight put a hole in your wig\nI'ma murder that pussy like it come from across the tracks\nMight get fucked in the lot in the back\nKeep it G, stay Jordan down\nProjects support him now\nNow you lay up, no relax\n'Cause you ain't never fucked on the racks\nWho put that arch in your back? 03\n\n[Chorus: 03 Greedo]\nIf I went down would you stay round?\nIf I went down would you stay round?\n\n[Verse 2: G Perico]\nIs you gon' do me like them other bitches?\nLast time that they sent me away to prison?\nTop tier views of the building\nThe day room, the tower, and a whole gang of killers\nI'm used to riding Gran Coupes, G sliding\nMy streets is private and the view's worth a million dollars\nIs you gon' sit still while a nigga walk it off?\nWhen they crack the gate I'm right back balling\nWould you come to the visits?\nIf they say I murdered a nigga and they had an eyewitness?\nWould you help me hide if I jumped bail?\nWhen they ask questions bitch don't tell\nWould you have another nigga driving in my car?\nTake the money out the safe and then fuck it off?\nI'm asking all these lil questions 'cause I gotta know\nIf you don't answer right, bitch you gotta go\n\n[Chorus: 03 Greedo]\nIf I went down would you stay round?\nIf I went down would you stay round?\n\n[Verse 3: Lil 100]\nIf I was locked up in the county would you write me?\nCan I count you to be there, support me mentally?\nFuck your sympathy, I want your energy\nTurn it into loyalty, name our daughter Royalty\nPay them lawyer fees if I go down\nWould you hold me down, would you hold it down\nWould you stay around?\nOr would you switch like a snitch\nTurn your back, get cold feet and jump ship\nI don't need no broke bitch\nI need a bitch who gon' listen\nCook dope out the pot, clean the kitchen\nDon't be so promiscious\nCan I trust you with my stash?\nIf they pop me would you secure bags?\nWould you spend my last?\nIf I lost all I had\nWould you visit me behind the glass?\nI just have to ask, if I went down\nWould you hold it down, would stay around\nWould you hold me down?\n\n[Chorus: 03 Greedo]\nIf I went down would you stay round?\nIf I went down would you stay round?"}], "artist": "03 Greedo"}