{"songs": [{"year": "2007-11-23", "title": "In a Mess", "image": "https://images.genius.com/957f0d0a594a246a123db431c7990d2a.1000x1000x1.jpg", "lyrics": "[Intro: Saigon and Kid]\n[Kid]\nUncle Giddy\n[Saigon]\nYeah?\n[Kid]\nCan you give us a bedtime saga?  Please, huh, please?\n[Saigon]\nI don’t know, man.  My saga’s a little deep, man.  You kids get in the bed.  I’ll get the rhyme book.  You all tucked in?\n[Kid]\nYeah\n[Saigon]\nHere we go\n\n[Verse 1: Saigon]\nI start the saga in the ‘ville.  Police, twenty-one narc fleet\nCreeping on Christopher deep in a unmarked jeep\nHalf of us was sitting dirty—how we clock on the block\nHad the .40 cali cocked—I rocked with extra clips in my sock\nThe blow had me stuck on slow mo.  Still on point, though\nReacting once I heard “Yo, low!”  Somebody screamed “Popo!”\nFast, I passed the chunk to this youngster that was amongst us\nRan behind [?] stashed the weapon between the dumpsters\nSo cold.  Messiah play [bowl?], annihilate the soul\nFresh up out the North Pole ain't tryna violate parole\nOne grabbed my son and then, hold on, started to snuff him\nBut son was resistant, so he told his partner to cuff him\nI ran over the van.  The Ds was nonchalant—the sham\nThinking “Damn.  Prolly seen me hand Scram the contraband”\nFelt the coke withdrawal.  Wished I had’ve sniffed more\nThinking ‘bout the rest but they probably guarding the fifth floor\nSwerving back up the staircase and out on the roof\nMaybe I could do some shit like Q and Bishop in Juice\nBut not.  A nigga stopped as soon as I heard the warning shot\nSomething saying “Jump” but I’m fronting ‘cause that’s too long a drop\nThen they hit me with some shit I never heard of, dun\n“You’re under arrest, son—robbery and murder one”\n\n[Interlude 1: Saigon and Police Officer]\n[Saigon]\nMurder...  What?\n[Police Officer]\nGet against the wall!\n[Saigon]\nRobbery and murder one?\n[Police Officer]\n[?]\n[Saigon]\nFuck off me, dog!\n\n[Hook: Saigon] (x2)\nI’m in a mess.  Locked up and type stressed\nThey questioning me to death and want a DNA test\nThere’s been a murder—somebody caught a body with a burner\nAnd now the DTs is blaming it on me\n\n[Verse 2: Saigon]\nI mingle with murderers, repeat offenders, carjackers, burglars\nCrackers with tax evasion, state max classification\nMy thoughts are long gone, play the horn\nTalked to Rough and Kayvon.  One told me “Hold my head,” the other “Stay strong”\nDouble-bunked me with this fat, dark-skinned cat named Rock\nPlayed the cot on the top.  He used to talk about his bitch a lot\nI pictured not too long ago, shot, he played the Don there\n[Daughter him?] jiggy, this brown-skinned shorty with blond hair\n[Fills about?] the crib in drug dealing—illegal living\nOn how he pushed a Inf and bought wifey a Eagle Vision\nEntrappted by her.  She spit game like rapid fire\nNot knowing who he desire is nothing more than a liar\nOn January 10th, caught a letter half-page length\nExplaining how some other brother pimping the Inf\nIt said \"Rocky, that's on the strength, she fronting like you the herb or something\nSo what’s the verdict?  Say the word and I’mma murder something\nAnd yo, P.S., try to cope with this B.S\nLately, niggas want test.  I got the Colt in the vest\nSigned, your baby brother, Bless.\"  Rock, he looked me straight in the eye\nI turned (Why?)—I know how niggas be hating to cry\nYo, not to claim clout, he jump back on the same route\nYo, when Rock came out, he flipped and blew boo brain out\n\n[Interlude 2: Saigon]\nClick, bang!  Click, bong!  Yes, he did.  (Dang).  You know what?  But now...\n\n[Hook: Saigon] (x2)\nHe in a mess.  Locked up and type stressed\nThey questioning Rock to death and want a DNA test\nThere’s been a murder—somebody hit a hottie with a burner\nThe homicide cops is blaming it on Rock\n\n[Verse 3: Saigon]\nAnd this is not where the story stop\nThere’s a deeper reason to why he shot shorty wop\nNot only was the bitch tricking off at the coffee shop\nShe had slept with over a hundred-and-forty cock (Damn)\nAnd while a nigga Rock was doing his bid\nShe was letting niggas come to the crib, sucking dick in front of the kids\nThat prolly would have been water under the bridge\n‘Til Rock went to the doctor and they told him the biz\nTold him he had just contracted the HIV\nThis the only bitch that Rock had been with since the cat was a kid\nThen to add insult to injury, she told him that she was leaving him\nAfter she gave a deadly disease to him\nRock, he couldn’t take it, so murder became his medium\nThe only way to cope with the fact the bitch was a sleazy bum\nHe went home, fill a clip up with lead\nDrove down to her house, shot the bitch in the head\n\n[Outro: Saigon]\nBang!  Hey.  Y’all sleep?  Y’all sleep yet?  Yeah, I think they’re asleep.  I’m out", "album": "The Moral of the Story"}], "artist": "Saigon"}