{"artist": "Anybody Killa", "songs": [{"title": "Rage", "image": "https://images.genius.com/7945b3f0891a67b88547eeaf85512b1d.355x355x1.jpg", "album": "Road Fools", "lyrics": "(Break)(x2)\nI don't know, I don't know\nWhat this world is coming to\nAll this rage, all this rage\nAll this rage, all this rage\n\n(Anybody Killa)\nLet me set the world straight\nFuck the hate, man you actin' fake\nWalkin around like you somebody\nLet me catch you in my path\nYou little mark, why you flinchin'?\n\nDetroit Streets means take precaution\nYou and your ? means you stuffed in a coffin\nAll this rage means I'm fed up\nNow I'm back to my old ways cause I had enough\n\n(Lavel)\nTo the people on the streets with the murder mentality\nSlippin' in the alley, gettin' stuck\nWhy the fuck must I put up with this?\nI would put up a fist but muthafuckas are trippin'\nBookin' shots like a coward that graduated from power\nEducation ain't shit, gotcha workin' by the hour\nSociety got you sweatin', I suggest you take a shower\nNeed to pay attention, even Bin Laden gots some power\n\n(Chorus)\nAll I wanna do (all I wanna do) is hit back the world with rage (im frustrated!)\nAll I wanna do (all I wanna do) is hit back the world with rage (im frustrated!)\nAll I wanna do (all I wanna do) is hit back the world with rage (im frustrated!)\nAll I wanna do (all I wanna do) is hit back the world with rage (im frustrated!)\n\n(Anybody Killa)\nExplosions, self destructions, this world is going under\nAll this murder that we do, should be used in self-defense (tell 'em again)\nExplosions, self destructions, this world is going under\nAll this murder that we do, should be used in self-defense\n\nScream for help and hope somebody listens\nEverybody's worried cause they loved ones is missin'\nCould you tell me why does everybody have a bomb? Explosions...\nCould you tell me whats the cause of this? cause of this...\nCould you tell me does everybody have a bomb? Explosions...\n\n(Chorus)\n(Shaggy 2 Dope)\n\"SEE RIGHT NOW, WHAT THIS SHIT, RIGHT THE FUCK HERE, IS ABOUT\nITS ABOUT THE JUGGALO, MOTHERFUCKER!\nUNDERSTAND, WE ALL FAMILY IN THIS BITCH\nAND IF YOU AINT FAMILY THEN FUCK YOU!\nIM SAYIN', BECAUSE WE ALL IN THIS BITCH TOGETHER MOTHERFUCKER!\nIN ALL THIS SHIT...\"", "year": "2005-03-22"}]}