{"artist": "Kirk Knight", "songs": [{"image": "https://images.genius.com/ea9e28bdbfa070b01c969d3ce06cd467.1000x1000x1.jpg", "title": "M.O.", "year": "2018-11-16", "album": "IIWII", "lyrics": "[Verse 1]\nI think I need Visine, been hopping off so many red eyes\nNow kids look up to a nigga like a need a picture just to put on my head I-\nSo I stick and move, onto the bed I-\nI am a person of interest, I think I need all of my cred, I-\nBut this here debit (This here debit), watch me flex it (Watch me flex)\nAs I exit (As I exit), just to kill (Always)\nLethal weapon (Lethal, lethal), with my whole gang (Whole)\nYou half-steppin' (You half-steppin')\nFuck girls with fingers 'round my throat like a necklace (Like a necklace)\nI'm used to the cold my niggas, born in the trenches (In the trenches)\nThis that new Kirk, heat for the street, for my Mecca\nSharp tongue I talk that shit that leave you headless (Cut you headless)\nYou get the message (You get the message)\n\n[Chorus]\nYou heard the memo (Heard the memo)\nThis my M.O. (This my M.O.)\nThis that I have been the shit since from the get-go\nYou heard the memo (You heard the memo)\nThis my M.O. (This my M.O.)\nThis that I have been the shit man, this that I have been the-\nYou heard the memo (You heard the memo)\nThis my M.O. (This my M.O.)\nThis that I have been the shit since from the get-go\nYou heard the memo (You heard the memo)\nThis my M.O. (This my M.O.)\nThis that I have been the shit man, this that I have been the-\n\n[Verse 2]\nUgh, fly on the wall, I've been buggin' out (Damn)\nStop and chase, runnin' up bank accounts\nStill down to earth, guess I'm underground\nNew school, but this ain't no cap and gown\nOnly L here that we pass around\nPaint her face now she look like a class clown\nFronted before, but yes I would've passed out\nFinger fuckin', now she looking for handouts\nTook a flight, landed in Moscow\nHaters stay watchin' they ass out\nJordan shoe boxes, a stash house\nLivin' my life 'til I pass out\nCan't fuck with you dawg, I'ma hell hound\nYou washed up and you let your mans drown\nSlide on your block, it's a man down\nSlide on your block I'm the man now\n\n[Chorus]\nYou heard the memo, this my M.O\nThis that I have been the shit since from the get-go\nYou heard the memo, this my M.O\nThis that I have been the shit man, this that I have been the-\nYou heard the memo (You heard the memo)\nThis my M.O. (This my M.O.)\nThis that I have been the shit since from the get-go\nYou heard the memo (You heard the memo)\nThis my M.O. (This my M.O.)\nThis that I have been the shit man, this that I have been the-"}]}