{"songs": [{"title": "Gangsta Gangsta Remix", "album": null, "year": null, "image": "https://images.genius.com/334d02ee258544e3ac2bc2392d939fb5.405x405x1.jpg", "lyrics": "[Intro]\nZone 3, Aye!!\nWe finna crunkin' bitch up (BME!)\nShow yall what some real gangstas is at\nSome of yall niggas just dunno (G-Unit!)\n\n[Chorus w/ Lil Jon ad-libs]\nI'm a (Gangsta gangsta), 2-4-5\nGotta charga on the boost, baby girl you wann' ride?\nWit a (Gangsta gangsta), Aye!\nYea dat's me, tinted out ridin' durrty - comin' down ya street\nI'm a (Gangsta gangsta), Git triggas squeez'd up!\nGot fitty killas with me, Strap'd down - G's up!!\nCuz I'm a (Gangsta gangsta), Yea top of the list\nBME motherfucker - Git cha mind right bitch!\n\n[Verse 1 - Lil Scrappy]\nSo many ways, you can spray, git hit\nWith tha' K, anyday, ain't gon' motherfuckin' say (Aye, Aye!!)\nDat you might git touched\nCuz 'em gangsta ass niggas, they don't talk too much\nCome around, fuck with me, and then you might git rushed\nNawh, I ain't with the yappin', but I make the gat go bust\nKeep fuckin' with us, we off the danger-ous\nShow you the meanin' of Ash 2 Ash, is just a Dust\nIf you laid back in the 'Lac\nI dunno if them hatas gon' handle dat\nKeep my motherfuckin' hand on my fuckin' gat\nAye, yall motherfuckers betta git back\nYea, all the young ladies call me +Get It Mayn'+\nI don't know if yall lames gon' undastand\nYou can see the phat stacks off, in my pants\nTried to keep it like a lame, you ain't got a chance bwoi, cuz\n\n[Chorus w/ Lil Jon ad-libs]\nI'm a (Gangsta gangsta), 2-4-5\nGotta charga on the boost, baby girl you wann' ride?\nWit a (Gangsta gangsta), Aye!\nYea dat's me, tinted out ridin' durrty - comin' down ya street\nI'm a (Gangsta gangsta), Git triggas squeez'd up!\nGot fitty killas with me, Strap'd down - G's up!!\nCuz I'm a (Gangsta gangsta), Yea top of the list\nGuerilla Unit motherfucker - Git cha mind right bitch!\n\n[Verse 2 - Young Buck]\nYou thank you a killa, but we gon' just pay 'em a visit\nPut the potato on the barrel, so no body hear it\nI keep a holsta on my shoulda like I'm John Wayne\nShootin' these niggas lights out like Lebron James\nHolla my name, gimme a reason to see you bleedin'\nAfta you feel these hollo' tips, nigga - then we eatin'\nFull of anger until there's no mo' bullets in the chamber\nAin't nothang like when you git popped and don't know who to blame-a\nNigga told me, \"Do ya durrt all by your lonely\"\nSo I go hit 'em niggas 'fore 50 couldn't even hold me\nI'm waitin', anticipatin' to put a nigga unda\nSmokin' like we some Jamaicans fuckin' with this ganja\nRide with no hesitation, retaliation is a must\nBad as I want to, some shit I just don't discuss\nSo point 'em out and watch how I knock him off\nErr'where you bitches go - I got a nigga watchin' yall, motherfuckers!\n\n[Chorus w/ Lil Jon ad-libs]\nI'm a (Gangsta gangsta), 2-4-5\nGotta charga on the boost, baby girl you wann' ride?\nWit a (Gangsta gangsta), Aye!\nYea dat's me, tinted out ridin' durrty - comin' down ya street\nI'm a (Gangsta gangsta), Git triggas squeez'd up!\nGot fitty killas with me, Strap'd down - G's up!!\nCuz I'm a (Gangsta gangsta), Yea top of the list\nBME motherfucker - Git cha mind right bitch!\n\n[Verse 3 - B.G.]\nIt ain't easy livin' where the young die fast (Fast)\nIt's eitha rap, or take a penitentiary chance (Chance)\nThis rap shit too easy fo' me to go back\nTen fo' a piece of crack, fifty to rap on a track\nBut I ain't lyin', the streets call sometime\nI could go to Detroit, sell 'em a thousand a pound\nAnd git 'em fo' bout two-hunned in H-Town\nFo'git it, I ain't even goin' dat route (Fuck it)\nI just do it like I do it, cuz the streets love it (Love it)\nI hold it down, neva bow, gotta stay thuggin'\nI don't be trippin' when the hatas go to mean-muggin' (Muggin')\nI keep a strap in the hand so I keep stuntin' (Stuntin')\nNow it's known by the whole world who a joke (Joke)\nHe ain't a man - got dreads, you already know (Wayne)\nAll my gangstas, gon' put ya hands up (Put 'em up)\nAnd all my hott gurls, back dat azz up\n\n[Chorus w/ Lil Jon ad-libs]\nI'm a (Gangsta gangsta), 2-4-5\nGotta charga on the boost, baby girl you wann' ride?\nWit a (Gangsta gangsta), Aye!\nYea dat's me, tinted out ridin' durrty - comin' down ya street\nI'm a (Gangsta gangsta), Git triggas squeez'd up!\nGot fitty killas with me, Strap'd down - G's up!!\nCuz I'm a (Gangsta gangsta), Yea top of the list\nGuerilla Unit motherfucker - Git cha mind right bitch!"}], "artist": "Lil Scrappy"}