{"songs": [{"image": "https://images.genius.com/47207e665143f3261b03238b454b685b.1000x1000x1.jpg", "title": "Gore", "album": "Murder Murder Kill Kill EP", "year": "2012-01-01", "lyrics": "[Verse 1: Necro]\nGore!\nSome cat will leave you dead and won't know what he did\nCoz what goes on inside his head says its ok to cut up kids\nGore!\nInside his crib you'll find some body's ribs\nCatch a meeting of victim rockin a pair of bloody lips\nGore!\nThe doctor that you go to on the local is loco he be killing patients but sedation so they’ll croak slow\nGore!\nIf someone gets suspicious he ditches a mission's to a new town and when he visits there be more victims\nGore!\nYour girl is kidnapped wrapped up and packaged in a crate like baggage sent to a sheik in Iraq\nGore!\nEnslavement the biggest racket in Europe to stirrup more controversy then Michael Jacksons jacket\nGore!\nThe person you least expect it is performing operations in morgues havin conversations with dog's\nGore!\nWe hustle violent rap coz times are ?trife?\nIf you disrespect us in the street we'll burn these rhymes to life\n\n[Hook: Necro]\nGore!\nSquirting like theres a vent in your head\nGore!\nThe culture that represents the dead\nGore!\nLow budgets and explotations\nGore!\nThats what we spit\nGore!\nYour wrist is slit\nGore!\n\n[Verse 2: Mr Hyde]\nPurposefully we sure to start a squirting spree\nIts a certainty when we cut your veins vertically\nGore!\nA nun rapped painfully by 28 escaped inmate apes full of hate anally\nGore!\nA homemade abortion with the hanger rip the foetus out now the seed is found bleeding on the couch\nGore!\nA soundtrack like goblin playin the background while gorillas viciously issue a pounding\nGore!\nA mess of retard body parts found flouting in the pound right near a deserted barn\nGore!\nYour attacked by a pack of maniacs the impact of the axe hax leave you handicapped thats:\nGore!\n20 shmucks abducted now there fucked get connected mouth to mouth human centipede's the structure\nGore!\nSevered limbs soakin up in acid still dissolving while the killer bumps the gruesome twosome album\n\n[Hook: Necro]"}], "artist": "Necro"}