{"songs": [{"album": "Truly Yours 2", "year": "2013-04-30", "title": "Head Bussa", "image": "https://images.genius.com/eea3c8d569aba2182316f265944de431.896x896x1.png", "lyrics": "[Intro]\nNow do I roll up, get higher?\nOr po' up, get tired?\nDo I roll up, get higher?\nOr po' up, get tired? Yeah\n\n[Verse 1]\nOkay, I'm back on a mission to pay my tuition\nGot loans out the ass, what you know 'bout my past?\nI was so late for class, hit the probate, get trashed\nFell asleep off the Henny, back in '08, I crashed\nWith my foot on the gas, thank the Lord I'm still here\nNo insurance, so now I'm racin' home on first gear\nOn that morn' I shed tears, asking what I'm doing here\nI should be rich, I'm sick, it's like I got the fuckin' flu in here\nBut yet I'm just chillin' like I'm back on the yard\nMy niggas say I'm the truth and when I rap they applaud\nThat what was my Unsigned Hype like in the back of The Source\nIt's like I'm tryna get the head, but she just jackin' me off\nI needed more\nHad to earn stripes, no Adidas store\nPut my feet on floor, borrow money from mi amor\nJust to cop a microphone, the same one that put me on tour\nShe held you down, now you out here fuckin' 'round\n\n[Hook: J. Cole]\nNow this is for my broke niggas, rich niggas, what?\nGold diggers, Crys sippers, what?\nCold nigga, flow sicker, what?\nMuh'fucker, I'm a fuckin' head bussa, go\nComing down on the strip, liqour in the whip\nParking lot pimp, enough game to be sold\nLearn from me, fuck bitches, burn money\nSomeone told me boy you got your whole life to get old\nBut everything that glitter ain't gold\nThe grass ain't greener, I've been told\nShe told me, \"Boy you want your cake and eat it too?\"\nI said \"It's cake, that's what you're supposed to do?\"\n\n[Verse 2]\nOk my granny just died, but I'm too broke to go\nAnd she asking my fears but she too close to know\nGot trust issues I'm trying, where it come from? Don't know\nI just block out the pain, blow the fuck up, get dough\nSee, I thought that would help me, it turns out it's worse now\nMy girl want her first child, my label won't work out\nMy mama don't see me unless I'm on TV, I pray she (dont break down)\nShe strong, but she need me\nThey killed Saddam, now I wonder who's sane\nHow you balance being Batman, Bruce Wayne?\nOld chick callin', but I'm onto new things\nShe still a dime, but I always lose change\nYoung Simba, went from bottom of the food chain to a few chains in a new Range\nShe tellin' me \"So much has happened, would've thought you changed!\"\nWe ain't fuck in nine months its safe to say I'm due man\n\n[Hook]\nNow this is for my broke niggas, rich niggas, what?\nGold diggers, Crys sippers, what?\nCold nigga, flow sicker, what?\nMuh'fucker, I'm a fuckin' head bussa, go\nComing down on the strip, liqour in the whip\nParking lot pimp, enough game to be sold\nLearn from me, fuck bitches, burn money\nSomeone told me \"Boy, you got your whole life to get old.\"\nBut everything that glitter ain't gold\nThe grass ain't greener, I've been told\nShe told me, \"Boy you want your cake and eat it too?\"\nI said \"It's cake, that's what you're supposed to do?\""}], "artist": "J. Cole"}