{"songs": [{"year": "2015-03-28", "album": "YouTube Promotion Tracks", "image": "https://images.genius.com/2d7d03d992cd5e101d783c58041bf947.480x360x1.jpg", "title": "Let Me Chill", "lyrics": "[Verse 1]\n\nPick the ball up, I ain't even drop the shit\nMy mind's in a race, tabs make the clock tick\nA bit quicker, I spit sicker than sick spitters\nAll lined with ARIAs and I ain't get my shit, listen\nWhat a fuckin' joke, industry a puff of smoke\nI get the last laugh 'cause I'm still makin' fuckin' dough\nBut on another note, I'm dealin' with my mood swings\nPoppin' shit just to function and to do shit\nMy brain plays games, am I in the right place?\nLike I ain't even wanna rap but it's my life mate\nTryna' stand forward but it's like I'm steppin' backwards\nLabels only talkin' 'cause the fact that I can rap good\nI'm in a black hoodie, smashed, I can barely talk\nThey told me \"look at yourself, you can barely walk\"\nIf I'm fallin' apart, at least I noticed this shit\nAnd if I fall will you laugh and push me over to the\nProgram damn, just to get me off the Xan man\nI don't think it's workin', should I end it with a bam? Damn\nCrazy thoughts that I'm livin' amongst\nThey won't leave my fuckin' brain 'cause there's a blizzard of dust\nRidiculous stuff, I see the bitch in you cunt\nJust jealous 'cause I made it and I'm livin' it up\nI don't know what to do, should I be zippin' it up?\nNot my mouth or body bag on you conspicuous cunts\nJust let me chill\n\n[Bridge]\n\nFuck\nJust let a cunt chill\nI need some space brah\nLook\n\n[Verse 2]\n\nKeep my name out your mouth, 'cause I'm cruisin' in my own lane\nLeave the scene behind, sorry but I gotta go mate\nIt's that simple, crash and smash into\nNoddin' at the wheel, shoulder impact through the window\nThat's leavin' the scene with a bang yeah\nSee that phone still mine, yeah the same chair\nI don't take care, I think I care-take\nProbably 'cause there's too much on my damn plate\nTen for ten, that's the aim with the Nebs One\nWill keep the promise 'cause I can't see a next up\nThat could do what I do in the booth\nThat could move, that could soothe, what I do for the youth\nI work harder with rap, than any rapper in Aus\nIt ain't a diss, that's a fact and I swear it to God\nStop comparin' me, I'm on my own level bitch\nAnd it's scary 'cause I kinda hear the Devil twitch\nNo thinkin, what am I drinkin'? What am I mixin'?\nWhat you might listen? Scot, your right, we think...\nStop, I might be the option I see, then what, is he dreamin'?\nStop, I'm not bleedin', lost enough demons\nPlot a rough secret, see your team decrease\nMe, I been seein' shit, leave me in pieces\nTwo-two-five to the death, I've been reachin' up\nBut it's never like I'm ditchin rap\nStill with the crew I'd be with if I didn't rap\nThat's some brotherhood shit, we the best team\nYour girl plays this at night, it's a wet dream\nNow let's see and emcee like me\nI create the air and I can split the sea\nThat confidence shit, no arrogance bitch\nUnless you tryna' take shots, we retaliate quick\nBut I'm here for a good time, not for some suppy shit\nUnless you see me in the club and I fuckin' flip\nHad enough of it, shit I had to air it out\nIf I left, would you care? You have to swear on that\nKerser"}], "artist": "Kerser"}