{"songs": [{"image": "https://images.genius.com/588bdc5a721ff6b2b58c31ccf8bffa9d.500x500x1.jpg", "lyrics": "[Intro: Mac Miller]\nAround a fire doing a thunder dance\nYou know what's a funny word? Underpants\nLet's go to Syria and have a war\nStop fucking calling me Macklemore\nThat's not my name, well kinda\nIt's kind of my name\n(A little bit louder)\n\n[Verse 1: Mac Miller]\nYeah, so I sold the mansion and moved to my mom's attic\nLife was a blockbuster but now it's a cult classic\nSmoke 'til I'm asthmatic, embracing my bad habits\nTravelling down the hole, I'm chasing a fast rabbit\nWell that's acid, still weird from my last tablet\nI love like a folk singer, but fuck like a crack addict\nPracticing black magic and watching some car crashes\nSnapchattin' a dick pic and sent it to Bob Saget (I'm a faggot)\nWord, the aliens have landed\nI don't panic in my fortress made of granite\nTake life for granted, probably won't when it ends\nThank God I'm sober again\n\n[Hook: Treejay]\nRun away, run away\nRun, run, run away\nOh my...\n\n[Verse 2: Mac Miller]\nWho let the dogs out?\nStop what you're doing and put 'em back in the doghouse\nI was a human, I'm feeling like I'm a god now\nBut most of the time I don't even know what I'm talking 'bout\nBitch, I'm a walking, talking crocodile\nTake a picture with my mom and crop her out\nGo to her house, coked up, and lock her out\n(Sorry about that)\nI'm possibly a phony, don't believe me\nYou can't tell that I'm so lonely from the TV\nI hate myself cause I'm a white rapper\nI hate white rappers but an industry of kike masters made me rich\nShort shorts and high socks\nI feel like chalk without a sidewalk\nBack in the 'burgh I'mma eat at my favorite Thai spot\nAnd smile as the hungry eyes watch\n\n[Hook]\n\n[Verse 3: Mac Miller]\nYeah, still having sex with blind people (it feel good)\nThey say my pussy smell like pine needles (as it should)\nBust a nut in the poultry section at Giant Eagle\nStare a chicken in the face like, bitch, I'mma eat you\nYea, I'm all kinds of evil\nEating mushrooms out in London trynna find the Beatles\nI'm still sick of people\nGo back to St. Bede, chief and kick it with Mr. Roedel\n(That was my English teacher)\nRetina display on my Macintosh\nThat's high definition jacking off\nIn LA trying to get me an acting job\nCause my idol David Hasselhoff\n\n[Interlude: Mac Miller]\nMan, Germans love David Hasselhoff\nI hear they like David Hasselhoff more than they like Jews\nAnd they love Jews out there\n\n[Outro: Treejay]\nRunaway, catch a plane\nOn my dick, ooh\nOoh, ooh\nRunaway, Runaway, Runaway\nOoh, ooh\nGirl, Runaway\nYou better run away", "year": null, "album": null, "title": "Erica’s House"}], "artist": "Mac Miller"}