{"songs": [{"year": "2008-11-04", "album": "The Renaissance", "image": "https://images.genius.com/5d721c8b6f6e8f0141dafa2547e2bd79.500x500x1.jpg", "title": "Dance on Glass", "lyrics": "[Hook]\nThe people at the label say they want something to repeat\nBut all my people really want something for the streets\nSo keep hooking (Hey ya'll what's goin on?)\nSo keep hooking (It's time yo word is bond)\nSo keep hooking (Let's do what we must do)\nSo keep hooking (Ah, ah, ah, let's hear it for)\nKeep, keep\n\n[Verse 1]\nWho can make it up? Dark ages here in rap\nAnd the constant conversation has been let's bring it back\nCorny rap style niggas, they lack the pedigree\nDeep waters they be in when they are just the manatee\nWho, me? I am unaffected the Whale, the Hammerhead\nThe magnanimous decision, unanimous, I am fed\nWhat you looking at? Wait, I can help you with that\nThe formidable, unforgettable painting Abstract\nOn the wall amongst them all from Warhol to Jean-Michel\nA commodity, hot property, here's the morning bell\nGuantanamo Bay and niggas deferring routes\nYour soliloquies are trash, inferring that you got clout\nBut homie, what's that about? You should revisit your scheme\nBefore the schemin' seems real, reverts back to a dream\nInto that pea head of yours, you ain't commanding no tours\nYou seeing fee and per diem, we seeing that in the door\nPlus a little bit more because she choosing the prettiest\nThe wiliest, wittiest, on the low, we the grittiest\nTaking the task, these barbaric insurgents\nWho nursery-rhyme niggas and play like they are crime figures\nMan, what could give you such a naive belief?\nThere's examples all around of careers being brief\nThe Luke Cage of the loose leaf page, run and hide\nComin out in the yard, bona fide to be hard\n\n[Hook]\nSo keep hooking\nKeep hooking\nKeep hooking\nKeep hooking, keep, keep\nSo keep hooking\nKeep hooking\nKeep hooking\nKeep hooking, keep, keep\n\n[Verse 2]\nAs if we reading pressures higher, we should all be that inspired\nToo just lift it and take it higher, peep the name that's on the flyer\nThe Midnight Marauder, low end theoretical\nRing tone rappers rockin shades are forgettable\nPhantom of the rapper (Boo!) Yo, you Puss in Boots\nEnergies electricute, looking for a love recruit\nHigh definition for the fortunate you to view\nChallenges with riches we will put you on strict review\nTime to turn the tide around, comin with the tribal sound\nBrandishing these microphones, we outlaws in the town\nCorruption in the fool pit, we witness the jam\nAcquisition of materials the evil of man\nTrickles down to MCs, we combat the disease\nWith the good and hardy measurement, a real rap sediment\nDegenerate genes and your bodies the host\nYou need to open up wide while we give you the douse\n\n[Outro]\nGather round\nGather round\nGather round\nIt's the hottest thing\nGather round\nGather round\nGather round\nIt's the hottest thing"}], "artist": "Q-Tip"}