{"artist": "Cardi B", "songs": [{"title": "Styling*", "album": "Tiger Woods", "year": null, "image": "https://images.genius.com/efba646d9bf480acc5f45dbe39a9d6f4.999x999x1.jpg", "lyrics": "[Full lyrics available upon release of the song]\n\n[Chorus]\nStylin' on these hoes, I'm stylin' on these hoes\nI be stylin' on these hoes, I'm stylin' on these hoes\n[?] wrist full of gold\nI be stylin' on these niggas, stylin' on these hoes\nGrind up a check, got it at the store\nRunnin' through the checks till the club close\nStylin' on these niggas, stylin' on these hoes\nI be stylin' on these bitches, stylin' on these hoes\n\n[Verse 1]\nI gotta get it, I need the chicken, I need the bread\nThat's why I'm workin' and I'm in the Benz 'cause you in the bed\nBitches is sleepin', fuck is they thinkin'? What is you doin'?\nThen they be mad, lookin' at me like I did something to 'em, uh\nBank account on racks, pussy still on drip drop\nPut this pussy on wax, took me straight to the tip top\nI might race with the Wraith, ain't no space in the safe\nNext bitch in my face catchin' case, catchin' case\nBut anywho, anywho, Birkin bag, Jimmy Choos\nAll my bitches say \"Eeeeooowwww!\", all my guns go \"Boom!\"\nMore guns than the warden, smack hoes with my Jordans\nPussy's floodin' New Orleans, kiss a bitch and I'm gorgeous\nNever been no pussy, yo, I'm always with the shits\nI ain't never been no dirty broad but now I'm filthy rich, bitch bitch!\n\n[Chorus]\nStylin' on these hoes, I'm stylin' on these hoes\nI be stylin' on these hoes, I'm stylin' on these hoes\n[?] wrist full of gold\nI be stylin' on these niggas, stylin' on these hoes\nGrind up a check, got it at the store\nRunnin' through the checks till the club close\nStylin' on these niggas, stylin' on these hoes\nI be stylin' on these bitches, stylin' on these hoes\n\n[Verse 2]\nMoney, money, money, money's all I think of\nI swear to God, I wake up and get the green stuff\nYou put your money on these hoes, get your refund\nI just got my nails did, I just got my weave done\nIf you want a fly press put Bardi on that shit\nI just bought a new gun, put a body on that shit\nShe upstairs, I'ma wait in the lobby for that bitch\nI got my bitch and a man that can buy me all that shit\nYou can find my fine ass\nBathtub with a wine glass\nAll these hoes wanna bring me down\nI don't never ever mind that\nCan you show me where your money is?\n'Cause I know where mine's at\nAll the energy you put in me\nYou just tryna get the top back\nLately I been on some conceited shit\n'Cause I don't need a bitch\nBlast off, I don't feed a bitch\nThat's how I treat a bitch\nIn my hood I got hella stripes\nStraight Adidas shit\nHope she got the same energy\nWhen I see that bitch, bitch!\n\n[Chorus]\nStylin' on these hoes, I'm stylin' on these hoes\nI be stylin' on these hoes, I'm stylin' on these hoes\n[?] wrist full of gold\nI be stylin' on these niggas, stylin' on these hoes\nGrind up a check, got it at the store\nRunnin' through the checks till the club close\nStylin' on these niggas, stylin' on these hoes\nI be stylin' on these bitches, stylin' on these hoes"}]}