{"songs": [{"image": "https://images.genius.com/8e2d598b1ac927904dd1b99901be5a5d.1000x985x1.jpg", "lyrics": "[Verse 1: Mac Dre]\nI'm into parties that don't end at four\nBitches that keep lingerie in their drawer\nBack in '84 I swore\nTo peel straight dimes, no more twos or fours\nNot looking for \"My Cherie Amour\"\nI'm a mack, I pimp whores, got CD's in stores\nI'm hardcore like the almighty Thor\nCampaign with this game man, like Al Gore\nDrink Mickey's not Coors, no sticky pot wars\nGot wounds and sores, boy I been through wars\nI want to party until I fall to the floor\nGet drunk, pass out, then snore\nMrs. bartender come pour me some more\nWhat no more? Fuck you, up yours!\nI'm into whores that wear Christian Dior\nNo pimples or clogged up pores\nI don't bark, I roar, catch me on tour\nIn a velour, ho's screaming for more\nFuck it, you want me to come with some more whores?\nOr cutthroat up and take this shit outdoors?\n\n[Hook: Mac Dre]\nAll I ever want to do is party\nCatch me at the club trying to holler at somebody\nI'm rolling with the bumps in the trunk\nTrying to have fun 'cause you only live once\nAll I ever want to do is party\nCatch me at the club trying to holler at somebody\nI'm rolling with the bumps in the trunk\nTrying to have fun 'cause you only live once\n\n[Verse 2: Mac Dre]\nSee them other niggas be mean mugging\nCatch me MD on the scene bugging\nHanging out the hole in my groove\nSun shining off the diamonds on my tooth\nMan, I'll tell you the truth\nRapping to you is like selling you some food\nI'm dope, like a pound or a key\nLook what they done found in the V\nMD, Ew-we, rolling like Bart or a SUV\nMy things got spin wheels that spin like pinwheels\nMight be getting fucked with the hutch she in heels\nPlay infield, outfield and pitcher\nI'm an all around player, nigga I'll hit ya\nGet with ya? I'd rather have fun\n'Cause it's no fun, being on the run\nAnd that's what I'm finna be, get from in front of me\nAnd quit acting like a thug you fucking wannabe\nPop a pill and wake up nigga, you'll never be like us\n\n[Hook: Mac Dre]\nAll I ever want to do is party\nCatch me at the club trying to holler at somebody\nI'm rolling with the bumps in the trunk\nTrying to have fun 'cause you only live once\nAll I ever want to do is party\nCatch me at the club trying to holler at somebody\nI'm rolling with the bumps in the trunk\nTrying to have fun 'cause you only live once\n\n[Verse 3: Mac Dre]\n\"Funky Cold Medina\" have you seen her?\nShe be with Tina, drive a green beamer\nI be seeing her at every function\nI'm trying to get her to uh, suck something\nPut something in that jaw\nI'm not interested in her friend at all\nKinda slim and tall, I need 'em short and thick\nNot some dumb unfortunate\nI need it big, I mean bigger\nNot that big, bitch watch your figure\n\n[Hook: Mac Dre]\nAll I ever want to do is party\nCatch me at the club trying to holler at somebody\nI'm rolling with the bumps in the trunk\nTrying to have fun 'cause you only live once\nAll I ever want to do is party\nCatch me at the club trying to holler at somebody\nI'm rolling with the bumps in the trunk\nTrying to have fun 'cause you only live once", "year": "2003-11-04", "album": "Al Boo Boo", "title": "All I Want To Do"}], "artist": "Mac Dre"}