{"artist": "Andy Mineo", "songs": [{"title": "Benjamins", "album": "Saturday Morning Car-Tunez", "year": "2012-05-26", "image": "https://images.genius.com/2f9cf695968b74ddbacf05e3de6499c3.300x300x1.jpg", "lyrics": "[Intro]\nGettin money, Gettin' Gettin money(x2)\n\"It's all about the Benjamins baby\"\nIs it really now?\n\n[Hook]\nWhat y'all wanna do\nWanna be ballers?\nShot-callers? Brawlers?\n[X2]\n\n[Verse 1: Andy Mineo]\nI know some dudes up on my block\nPush that green to make that guap\nThey so paranoid they hear a noise\nThey fear for all they got\nTell me, is this life? I think not\nWhat's money if you don't got peace homey?\nThey tell me 'What's life if you just can't eat\"\nSo preacher don't preach at\nMe, homey\nI'm ain't against you, I'm for you\nI'm just another young boy who\nFound\nGrace, mercy, and joy\nI want you to know joy too\nThat's why I want to be\nHonest\nAnd tell you\nIn the dollars you're never gonna find it\nPeace is too big to fit up in your wallet\nBut you wanna be fly, Mister Co-Pilot?\nI know the television promised\nIf you get it then you gonna be good\nBut\nStop it\nTell me what a man profits\nIf he gains the world\nBut loses his\nSoul in the process?\nI know you heard it all before\nBut the words cut deep\nBecause them words\nFrom the Sword\nAll for Pete sake\nCall that a cliché\nI call them dull ears\nThat don't hear what we say\nI'd hate to see you fresher\nThan some Listerine\nWith two girls like Mr. Sheen\nYou bald out like Mr. Clean\nYour life passed & you missed the meaning\nAw man\nDon't miss it\nIf you flirting with death\nDon't kiss it\nYou extra fresh and you ready to go out\nBut you ain't ready to go out\nMoney is good, but don't spell it with one \"o\"\nWhat's the score? Jesus:1 Death:0\nBut they tellin' me\n\n[Hook]\n\n[Verse 2: Rich Perez]\nLet's keep it straight like a toupé\nHe kept his word, touché\nSo we applaud like \"Hooray\"\nWe reppin' the name, we keep it the same, we do it again and again\nWe doing it all unashamed\nI'm keeping my hands up, never about the Benjamins, nay!\nThat stuff fades like a haircut, but he died without dark spots on his body like a leopard, so...\nNow the reason we all going in, brother:\nWe got the Spirit of the King, Romans 10:9\nMy confession: I know I'm His\nSaved - co-heir, no error kid\nHe the head like New Era lids\nWhy you chasing after things that be perishin'?\nI am rich - He's the treasure\nSo I share the wealth, it's my pleasure\n\n[Hook]\n\n[Verse 3: Izz]\nYo, show me where your hundreds is, show me where your stacks at\nShow me what's your treasure and I'll show you where your heart is at\nRacks on racks, I've got plenty stacks\nBut it ain't on earth cause ain't no ceiling where my Daddy's at\nI got a crew spittin' Jesus in the speakers\nNot worried 'bout the fame or the crease up in the sneakers\nAt work ain't got no feet up\nIn the word cause you gotta read up\nWhen we be coming up empty, boy, you know it's time to re-up\nBut the world keep tellin' me to make that dough\nGet it while I got it cause it ain't that low\nEverybody do it, they won't know\nBut I got the calling and it ain't gon' blow\nAnd I'mma show you why the paper never coincides with the sinful nature\nAsk the Savior, He say \"Sho' you right\"\nI make it plain, boy, I can live without 'em\nCause it's up in that name that I know I'll never doubt Him\nAnd I'll invest it cause my money's all about Him\nRather need money with Him than have them hundreds without Him\n\n[Hook x2]"}]}