{"artist": "Wale", "songs": [{"title": "Chain Music", "year": "2011-09-02", "lyrics": "[Verse 1: Wale]\nDMV up, roll up and kick my feet up\nThis shit was for a ticket, man -- I call that shit that free lunch\nI tell a ho to speed up\nShe slow and she can keep up\nWe know we always out\nBut somehow they would never see us\nKeep a gold chain, hoes changed, I didn't\nThey say that karats help your vision\nBut somehow it made them listen\nNo this ain't silver, this is my dilemma\nArrogant when I finish\nI came from humble beginnings\nSo it's nothing to finish\nI put my hundred percent in\nPut my pride in the pen, cuh\nAnd modify your opinion\nTrying to give them light and a message\nBut you rather have some fucking V.V.S.'s\nShe said I'm charming and I meant it\nBut she was talking about my pendant\nI got geechi on her, came back with thirty chains\nNow she attentive, I bet she listen to everything\nStraight geechi on her, came back with eighty chains\nNow them silly bitches calling me like everyday\n\n[Hook: Wale]\n(Work) Now them broads gon' follow\n(Chain so big, can't pop my collar)\n(Work) Silly bitches gon' follow\n(Chain so big, can't pop my collar)\n(Work) Now them broads gon' follow\n(Chain so big, can't pop my collar)\n(Work) Silly bitches gon' follow\n(Chain so big, can't pop my collar)\nGeechi on 'em\nStraight geechi on 'em\nYou talking greasy\nBest believe they gon' see it, darling\nGeechi on 'em\nStraight geechi on 'em\nLet's keep it G, nobody see you when you being humble\n\n[Verse 2: Wale]\nLook, she so stingy with vagina\nBut why it open when them niggas get to shining?\nI was hoping you would notice where my mind at\nPut money in the book, I bet these bitches wouldn't find it\nLook, okay this chain music, fuck how them lame's do it\nYou chained to it, your brain has been way too influenced\nI been dope, cold nigga for sure nigga\nBut where I'm from there ain't no love for no broke nigga\nShe seen that geechi shit, ain't been to church since\nPray to whoever got on the biggest of crucifix\nLord Lord forgive us, personalities clash\nAnd my license is suspended, so I hide it\nI don't spend it, did I get y'all attention?\nShe can't escape the chain, shoutout to Mrs. Tubman\nShoutout to Maybach Music, my logic is getting money\nSpitting something real, let the people know, and still love it\nShady flow: Johnny Cage, chain flow: Johnny Dang\nBen Baller, six bottles, talk with such expensive slang\nI got geechi on 'em, now they notice a nigga\nSo who that chain change? It ain't both of us nigga\nI got geechi on her, came back: a hundred chains\nAnd now these geechi motherfuckers all know my name\nGeechi on her, came back: a million chains\n\nI see these geechi motherfuckers all know my name\n(Work) Broads gon' follow\n(Chain so big, can't pop my collar)\n(Work) Bet this niggas gon' follow\n(Chain so big, can't pop my collar)\nGettin' geechi on 'em\nStraight geechi on 'em\nYou saw best believe they gon' see it, homie\nGeechi on 'em\nStraight geechi on 'em\nLet's keep it G, nobody see you when you being humble\n(Work) Broads gon' follow\nHolla\n(Work) Silly niggas gon' follow\nBitch\nBroads gon' follow", "album": "The Eleven One Eleven Theory", "image": "https://images.genius.com/19ad518dfdf298ef659b84ca9eeeea3f.1000x1000x1.jpg"}]}