{"artist": "Warren G", "songs": [{"year": "1999-10-12", "lyrics": "[Kurupt talking]\nY'all don't know nothin about this HEE-ARE\nHahahahahahaha, yeah! It's Kurupt Young Gotti\nHehaha, sup Warren G? It's my homeboy, huh?\nWith my niggas Crucial Conflict, huh?\nChillin, huh? Bumpin, puffin on a little bit of that Hay\n*TOKE* Aaaaaaaaaaaaaaah\n\n[Warren G]\nDollars make sense, it's all incorporated\nI'ma get it all, since a BG I done did it all, was in it all\nWhen I first thought I was in the wrong\nCouple tokes, alcohol\nGot everything I need, Hennessey and weed\nSince my arrival, based on this modern-day survival\nEvrything is technicality, everything based on reality\nSo how do I get paid, all these licks nowadays\nThey want me laid, dropped and plagued, AK mouth is sprayed\nIt's like I'm blind, and I just can't see\nWarren G, I'ma holler at the homey Shorty B\n\"Shorty B IT'S ME!\", G Dove, I'm out to make a grip\nSo call Crucial Conflict and let's make us some bomb shit\n\n[Wildstyle]\nLook at me on the M-I-C\nTryin to stack my tips, comin in a big ole ride\nWith all that bumpin side, livin up in your eyes, surprise\nHangin on the corners where the young brothers be comin up\nThe gangbangers be gunnin up, the type of brothers that roll with us\nHigh tech with much respect, with all that G's swarmin\nLike G-Funk in your eyes and make you see we about that cashflow\nPut em in a lasso, don't try to sweat, no joke\nWe illa your side, in the back we get hot, trade bump and hit em up\nWith the jigs up\nFreaks from the West to the east to the South where they chief\nKurupt in the mind, Young Gotti down with the raw dog Flict\nI ain't no tricks, nigga Wildstyle, enemies get closed down\nWe rock the shows, slammin do's, Cali to Chi-town\n\n[Coldhard]\nSo chop it up, I'm gonna kick some shit about what's goin on\nHave to get my loot up so I suit up\nLooked in the mirror said to myself \"It's gon' be gone\"\nI'm sick of goin thru the things that I have to do do\nCops are happy to jack fools, I'm strictly ever gon' gank move\nI hate to be the one that have to take it\nBut you best believe I'd die to make it\nAnywhere in the world I'm standin with my pockets naked\nSet it out set it out, that's what I'ma holler\nOn some slick, tryin to come up quick, witta trusty ole dollar\nWatchin you watchin me, hope I slip and bust my knees\nI'ma have to greet you at the pond, you should just be thinkin C's\nComin out at ease, no matter what I'm still hard to please\nFlap flappin sky, be real til the day I leave so sneeze\n\nChorus: Reel Tight\n\nTalin bout that money, dollar\nGettin that money, gettin paid\n*repeat x3*\n\n[Never]\nWe, smackin and stackin, packin, strappin, what's happenin? Rollin\nCruise-controllin, the fo' and Daynes swell up\nGet the hell up, trump-tight click just in case I'm lavish\nTryin ta fade me, you crazy ladies, babies created\nMen are shady, straight make me drink til my thoughts get swavy\nI think, maybe if I blink things will get back gravy\nBut loccs in the hood they lord be makin it hard so lately\nBut I gotta stay at the table, cos that raw dope is that will pay me\nWestside of California, on these corners pimpin daily\nRetire out on the lakefront, smokin blunts\nTakin the sale G, trap me like the male be\nTo the Westside I'm a mental, all the regulators trail me\n\n[Kilo]\nDon't kick it out, let's do this\nComin out the do', we down to wall\nGotta get in the business\nTell me waht's the call, we to the fall to ball\nWe can't just fold up\nGotta whole bunch of homies dependin on this, sho'nuff\nThis only hustle is for brothers\nFeel to bring the business so slow up\nAnd we still up on a mini gold rush\nReady to make the world go down\nBound to get it cos I'm down wit it\nNow shitty the city, Conflict's causin critics to bite tongues\nAin't the one, with the shotgun, showdown\nMy town to your town on the rebound for them papers\n\n[Warren G]\nIt's like brother brother brother how you make em get down?\nFrom the LBC to the Chi-town, Westside straight gettin down\nHittin switches and we checkin all snitches\nGettin all riches, and flossin in our pictures\nIt's time for some new hits, one of us\nYou know I spit some coast to coast love from your homey G Dove\n\nChorus (x7)", "image": "https://images.genius.com/fc9c13a653a7912a5dca703cc2caab0a.800x800x1.jpg", "album": "I Want It All", "title": "Dollars Make Sense"}]}