{"artist": "Apathy", "songs": [{"title": "Fist of the North Star", "image": "https://images.genius.com/e0fd6f4042838cf24cc48a890f2b142e.1000x1000x1.jpg", "album": "The Widow’s Son", "lyrics": "[Verse 1: Apathy]\nI radiate excellence, stay strong as exoskeletons\nMurder with elegance, rollin' deeper than a herd of elephants\nStampeding, deleting, eating anything before me\nEnd of story, I'm catastrophic in every category\nEvery battle's gory orry, trap 'em in the laboratory\nLaparoscopic surgery while I'm faded, pass the forty\nSlap a corny rapper for me, unfortunately for you\nI'm in the studio studyin' how to brew a human stew\nCannibalism, a little liver, lightly salt and peppered\nAll your records get rejected, ejected and disrespected\nEvery effort is \"Ef-it\", fuck it without the edit\nRewind it and write it down on paper if you still don't get it\nFoes on shit, leave all of your protons split\nTurn your whole skull red like you was Johann Schmidt\nHoes on the dick beggin' me to blow it on her tits\nGet below me, better blow me or I'll blow ya to bits\nIt the midst of the sinners will emerge a messiah\nTo murder these liars and light all of their words on fire\nEvery verse and flow - is like \"1st and Goal\"\nCover the earth with snow, words that curse your soul\nRead from cursive scrolls and scribble raps in calligraphy\nBiblically blessin' you, bliggity-blow, then destroy you physically\nPhonographic devices are vital to reverse vinyl\nFor devil music, recitals and soldiers load up your rifles\n\n[Chorus: Apathy and Diabolic (Method Man Sample)]\nTry to act hard but you won't get far!\n(I'm the true fist of the North Star)\nCatch a bullet scar no matter who ya are!\n(I'm the true fist of the North Star)\n\n(I'm the true fist) Pump your fists like this!\n(I'm the true fist) Pump your fists like this!\n(I'm the true fist) Pump your fists like this!\n(I'm the true fist of the North Star)\n\n[Verse 2: Diabolic]\nI got some shit in store, horse manure, I owe sick\nSaw the future; I exist, born to rule with iron fists\nGot the shortest fuse, I'm warnin' you the fire's lit\nAnd all of you are dyin' if I'm forced into retirement\nWhen I decide to quit I'll morph into a scientist\nAnd build a cyborg who thrives off computer viruses\nSend him back in time on that Goonies pirate ship\nHe'll construct the pyramid and draw my crew in hieroglyphs\nFrom the kind of shit I heard y'all been misinformed\nIt's Mike Tyson's Mysteries, you birds talkin' is the norm\nI hate you rappers, every verse off your list of songs\nMy dick givin' chicks anal, a turn off when shit is on\nShitted on for the shit you're on, then I'm gone\nSketchin' each Yosemite Sam gun, my pistols drawn\nIf that’s the case then actin' fake is what you bitches want\nYou did it wrong, arms and missiles launch, use a wizard's wand\nSippin' D.O.M. with Lil Jon up in a haunted house\nBitches on the intercom and Biggie sittin' on the couch\nHypnotized by Beyoncé rippin' off her blouse\nGettin' finger popped with her titties in Rihanna's mouth\nI'm about to get ruthless, I'll kick in doors\nWeapons drawn when heads are on some bullshit like minotaurs\nRich or poor, I'll act stupid and immature\nBipolar, might cause the blueprint for civil war\n\n[Chorus: Apathy & Diabolic (Method Man Sample)]\nTry to act hard but you won't get far!\n(I'm the true fist of the North Star)\nCatch a bullet scar no matter who ya are!\n(I'm the true fist of the North Star)\n\n(I'm the true fist) Pump your fists like this!\n(I'm the true fist) Pump your fists like this!\n(I'm the true fist) Pump your fists like this!\n(I'm the true fist of the North Star)\n\n[Sample from Fists of the North Star]\n[Yuria] This is madness. The fists of the north and south aren't ever supposed to fight, you know that!\n\n[Shin] Perhaps that was true once, but now rules are meaningless. Defend yourself!\n\n*Both Scream and Attack*\n\n[Outro: Diabolic (Method Man Sample)]\nSoldiers pump your fists!\nThis that punch you in the face and fuck your girlfriend type shit. Apathy, Diabolic, Sleeper Cell motherfucker\nFuck ya!\n\n(I'm the true fist of the North Star)\n(I'm the true fist of the North Star)\n(I'm the true fist of the North Star)\n\n[Sample from the film The Holy Mountain]\n\"With the correct formula, any human being can become enlightened.\"", "year": "2018-03-02"}]}