{"artist": "Aminé", "songs": [{"title": "Zzzz", "album": "Calling Brio", "year": "2015-08-31", "image": "https://images.genius.com/408c3f7046860c8aa8e6eb685126ccfd.500x500x1.jpg", "lyrics": "[Verse 1]\nScreaming west side\n'til I D-I-E, bitch\nYou can see I'm in line\nTo be the messiah, call me spit fire\nThat's a fact, me no lie\nYour girlfriend hit me like \"H-E-Y\"\nShe said, \"Young easy, come please me\"\nI [?], so she love me long time\nShake that ass\nShake it fast, girl, make it clap\nBend your back\nBend your back, girl, make it clap\nMr. O'Reilly, please don't try me\n[?]your daughter for Topenga the mighty\nG-O-D to the five-o'-three\nAnd I tell 'em wake up so the rap game see\n\n[Bridge]\nIn the jungle, the mighty jungle\nThe rap game sleeps tonight (awimbawe)\nIn the jungle, the mighty jungle\nThe rap game sleeps tonight (awimbawe)\n\n[Verse 2]\nI'm a young killa\nFuck any dum-diddy-dum dum nigga\nCallin' all my real men, this shit so cold\nThat my nigga put his headphones on and they froze\nAskin like, \"How much a feature?\"\n\"Do you do eagers?\" say, I mean, hey\n\"You like the coldest,\" \"You prolly don't notice\"\nI say \"Okay, k\"\nI-I, don't want a rap again\nCause everytime I slip, these niggas gettin' too [?]\nDon't hop on the beat if you can't hip-hop\nRappers get scared when they shit gets flopped\nIf you start to warm up, then they say it's all up\nCause nobody give a fuck about they shit they drop\n\n[Bridge]\nIn the jungle, the mighty jungle\nThe rap game sleeps tonight (awimbawe)\nIn the jungle, the mighty jungle\nThe rap game sleeps tonight (awimbawe)\n\n[Bridge]\nSpit them bars, innit yute\nI need bars on top of bars, den\nAll this melodic thing cool and all, but dem [?]\nMe need a rap, den, yutes\nStraight rap me some want\nWhat, ya think ya bad now?\nBars, mi say\nRun it\n\n[Verse 3]\nIf I'm not in your top 5, I'm in the Tahoe\nGetting top by 5 hoes\nFuck a mention, I don't pay attention\nTwitter make a [?] better makin' niggas do the most\nLook, I'm a R-A-P-P-E-R nigga\nSo sick I'm always in the E-R nigga\nYou a donkey of the day like a \"he-haw\" nigga\nAnd these niggas switch sides like a see-saw nigga\nLook, I don't get lost in the sauce, I'm gucci\nIf I was a Pitt, man my nick name pucci\nHoes comin' easy, I say for cheesy????\nSome days I'm Ghandi, and some days I'm Boosie\nThe rap game sweet-ah, put the sour innit\nThe rap game sweet-ah put a power innit\nI could spit all day this easy money\nRappers get scared so they reaching for me\nWait, should I stop? No\nPardon my menace, not here for dollars and carrots\nI am a rapper, mother fucker, D-D-D-D-D-Damnit\nDon't need to go for the kill, never gotta do plan it\nI got a tip top bitch, she in tip top shape\nNeed protection like I got All-State\nDon't worry, baby, you in \"good hands\"\nWoulda, coulda, shoulda, niggas never do plan\nFor the worst, Baby thats a shame\nThe foolest mans do the foolest things\nThe cutest kids do the darndest things\nBut these rappers can't shine so they cop the bling, ding\nIs that a light bulb? Maybe it is\nThe way the game lookin, man, it's breakin and bits\nIf your promoter wanna act like he ain't payin me\nWe'll give him hits and go ghost like we [?]"}]}