{"artist": "Pouya", "songs": [{"album": "Stunna", "title": "Stunna", "image": "https://images.genius.com/f47c0db4ac75993f9d601d63ecf0f4ff.500x500x1.jpg", "lyrics": "[Verse 1: Pouya]\nBaby Bone, on my own, got these rappers on they toes\nAsking me about my flows, like a magician I can't let you know\nAbout my tricks, about my bitch, lately been on some savage shit\nI know you mad cause I won't commit, baby girl don't trip just bounce on this dick!\nSTUNNA! Always rollin' with a hunnid, dudes by my side and they ready to die, bitch!\nI do it for me, and all of my god help my family first, and then it's I\nI gotta get mine, until it's my time, to rest in my grave, I'm not a bad guy, I just don't behave\nI don't like what they say so I disobey\nHit up 2phonez shawty like what's the play? He said let's get it, I said let's go!, (let's go!)\nPlus me and Braddy fucking the same ho'\nAnd me and Fat Nick live in the same crib\nBeen known him since I was a jit, been holdin' it down for the kids\nDon't let nobody tell you how to live, ho!\n[Hook]\nYou hate the bitches that love you\nYou love the fact that I'm fucking all these rappers up\nCause they bluffin', tryna see me do nothing, cause I roll 10 deep when i'm coming, something down got ya bitch cummin' still!  Really and really and nothing baby bone never be fussin'\nBitch don't tell me turn down the cussin'\nKick it to the curb with ya bitchass cuffin'\nLook in ya eyes I could tell that you bluffin'\nThey been sleeping on me concussion, get buck inside the function, ya pussy smell like a dumpster, so I don't want nothing from ya\nNo I don't need nothing from ya\n\n[Verse 2: Pouya]\nHol up, we finna blow up\nShe finna deepthroat that dick 'til she throw up!\nYou don't know us, so don't act like you do\nYou wasn't with me or none of my crew\nBitch back in the day so get back from my face\nBack of out civic and back into yo place\nI go, you already know, what I came here for\nGive it up lil ho bitch!\nThe game is over, press ya luck like a 4-leaf clover\nBitch ya luck is up like the cops pulled over\nTop off come on bend em over, spread ya legs cuff em and take it over, downtown where he stay, baby bone do not play\nYa ass got caught slipping today lil bitch!\nLearn from ya mistakes, Don't sleep on me ho, flawda boi I go, (flawda!)\nNo paycheck but i've been on my job, no 9 to 5 but i've been workin' hard\nBaby Bone bitch i'm going hard, and ya bitch wanna make me hard, the pussy easy but the life is hard\nWith my migos i'm takin' off\nSee ya bitch she wanna take it off\nYou didn't see me then I wasn't involved, waking up and I'm feeling clean, skip the shower get on the scene\nGotta be who I gotta be, Pouya ho, and that's all me, double S that's the team, ho\n[Hook]", "year": "2014-03-05"}]}