{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro]\nHa, ha\nUh-huh\nIt's kinda strange ain't it?\nFeel that separation?\nDon't know how to feel\n\n[Verse 1]\nI've been on this rock now too damn long\nI never thought I'd feel so far away\nI'm seeing everything you do all day long\nReading everything you've got to say\nYou never even gave me a chance to miss you\nI see you out sharing everything you've got\nWe really need to disconnect the picture\nI'll tell you that there's one thing for sure I'm not (I'm not)\n\n[Hook]\nI can't be alone, can't be alone, can't be alone\nI never knew a world so big could feel so close\nI can't be alone, am I alone? Leave me alone!\nI've got all these numbers that I never call on my phone\nDon't leave me alone, don't leave me alone\nDon't leave me alone, don't leave me alone\nAh-ah\n\n[Verse 2]\nI've been drinking at this bar now too damn long\nI always knew the J.D. would be my friend\nThat's probably why I'm always singing drunken songs\nI hear 'em say \"Look Wrek's at it again\"\nThey take pics and post 'em\nI pull the Dylan, follow 'Clef too close son\nIf you need to watch me bleed, I guess that's cool\nBut take a break from the sharing you do\nLord knows that I need one too\nThe whole world's gone mad and it's sad but true\nThat I've grown to be such a recluse\n\n[Hook]\n\n[Bridge]\nJust need some time\nYou still there?\nWait now\nNah, nah, nah\nCome back, come back, come back\n\n[Verse 3]\nCheck status of all the baddest\nRatchets on the atlas, using an apparatus\nThey can get at us through the line they tappin'\nSince I know my quirks and bad habits\nWhat you need a camera for?\nNeed a minute, need a second, instagram or more\nNothing to say hey, but runnin and play lame\nAnd snap snap another it's capture from the playpen\n\"Mikey likes it\"\nWell if you knew how the kid felt then you might be psychic\nEverybody workin' for the paparazzo\nI report nothin' cause the block been hot sooooo\nEverybody cameras down\nLook me right up in the eyes and I'mma hand it round\nSet 'em up right now when I be puttin' the mic down\nTo have some words with you cause the future is now\nI couldn't tell you this on the phone\nYou needed to know no matter where you are that we are not alone", "title": "Can’t Be Alone", "year": "2013-06-25", "album": "The War Within", "image": "https://images.genius.com/e384fbb42e445fb209514af1582b2973.440x440x1.jpg"}]}