{"songs": [{"image": "https://images.genius.com/09888ad57b8d303deaafa146482c700a.500x500x1.jpg", "title": "Bulgari Shades", "album": "The Marathon Continues: X-Tra Laps", "year": "2012-02-13", "lyrics": "[Bridge]\nLook, I'm like, \"Ooh, girl, what's your name?\"\nI got this cash\nI know a place that we can go and trick off on someone of ten Bulgari Shades\n\n[Verse 1]\nI've been goin' hard so long without takin' no breaks\nFeels so right, I booked two flights, we leave tonight, and get away\nIt's not about no chase, 'cause for your pussy I won't pay\nBut I'm inspired and refreshed by somethin' beautiful with brains\nWe both have broken hearts so it's alright to love again\n'Cause when you let go of your pride, you'll find a lesson in your pain\n\n[Chorus]\nPut your guard down, girl, put your guard down\nPut your guard down, girl, put your guard down\nPut your guard down, girl, put your guard down\nPut your guard down, put your guard down\nAnd that's when the-and that's when the guitar come in\n\n[Break]\nPut your guard down\nYou got to, you know?\nOr you can't be mad if youll never feel that feeling again!\n\n[Bridge]\nLook, I'm like, \"Ooh, girl, what's your name?\"\nI got this cash\nI know a place that we can go and trick off on someone of ten Bulgari Shades\n\n[Break]\nThat's Harrods in London\nLike twenty racks, you know?\nFoolish hoes, uh-huh\nAnd I got like sixty buck too\nThat's 'cause the marathon continues, nigga\nGet the breathin' right\nYuh\n\n[Verse 2]\nThat made her smile but she said, \"Boy, don't even play\nI got two jobs, I go to school, I got responsibilities\nBut I kinda like that type of fly shit that you say\nSo if you give me yo number, I might call you up one day\nAnd by the way, I know that game you play\nWith all your money and your fame\nBut to me it don't mean a thing\nSo, just take a seat, don't introduce me to Nipsey\n'Cause what good is the hood if its no engine underneath?\"\n\n[Outro]\nAnd that kinda fucked me up, it did\nThat's true\nSo I took a seat, took off all my jewelry\nPut my blunt out, took my hat off\nAnd took two shots of that coconut Cîroc\nAnd bring some of that pineapple juice"}], "artist": "Nipsey Hussle"}