{"artist": "Immortal Technique", "songs": [{"title": "The Martyr", "lyrics": "[Intro]\n\"I am content to die for my beliefs\nSo cut off my head and make me a martyr!\nThe people will always remember it.\"\n\"No, they will forget.\"\n\nA man who walks with God can walk anywhere\nHence I fear nothing\n\n[Verse 1]\nThe point of guerilla war is not to succeed\nIt's always been just to make the enemy bleed\nDeprivin' the soldiers of the peace of mind that they need\nBullets are hard to telegraph when they bob and they weave\nThe only way a guerilla war can ever be over\nIs when the occupation can't afford more soldiers\nUntil they have to draft the last of you into the service\nAnd you refuse because you don't see the purpose\nThe only way to counter the insurgents that are well-equipped\nIs to paint the people fightin' for freedom as \"terrorists\"\nThen find a faction, lookin' for foreign investment\nInstall them in power and murder any objections\nYou can't stop a revolution from breathin'\nSo to beat 'em, they offer people the illusion of freedom\nBut when you're done dreamin' and wake up tortured for treason\nThen you can see them, hidin' behind the god they believe in\n\n[Hook]\nDeep in the trenches, in the heart of a war\nThat's the place a martyr is born (Motherfucker, it's on!)\nDuring the night before the start of the dawn\nThat's the place a martyr is born (Motherfucker, it's on!)\nWhen gunshots are raining in the heart of a storm\nThat's the place a martyr is born (Motherfucker, it's on!)\nGuerilla war when the army is gone\nThat's the place a martyr is born (Motherfucker, it's on!)\n\n[Verse 2]\nThe purpose of life is a life with a purpose\nSo I'd rather die for a cause than live a life that is worthless\nI don't need the circus or the day of national observance\nI need you to think for you and stop bein' a servant\nPawns only move a square in the game that they're used in\nAnd realize it too late, like the shooting of Huey Newton\nOr Patrice Lumumba and Salvador Allende\nSlaughtered by the power-hungry branches of their own gente\nGhandi wasn't killed by Pakistani nationals\nHe was assassinated by a Hindu radical\nAnd Che Guevara, rebel to a U.S. continent\nWas sold to the C.I.A. by Bolivian communists\nWasn’t Yitzhak Rabin murdered by a Zionist?\nAnd Anwar Sadat a victim of the same violence?\nMalcolm X was seen as a threat to the F.B.I.\nBut to blast ‘em they used Muslims from the N.O.I.\nEven the 35th President of the Republic\nWas murdered by factions of his own government\nSo now that it’s proven, that a soldier of revolution\nOr head of an empire, disguised in a constitution\nCan not escape the retribution or manipulation\nOf the self-appointed rulers of the planet's corporations\nSo I'ma need every generation to put your hands up\n‘Cause you can only get ‘em off your back when you stand up\n\n[Hook]\nDeep in the trenches, in the heart of a war\nThat's the place a martyr is born (Motherfucker, it's on!)\nDuring the night before the start of the dawn\nThat's the place a martyr is born (Motherfucker, it's on!)\nWhen gunshots are raining in the heart of a storm\nThat's the place a martyr is born (Motherfucker, it's on!)\nGuerilla war when the army is gone\nThat's the place a martyr is born (Motherfucker, it's on!)\n\n[Outro]\nI was a man blessed by God\nTo survive some of the worst circumstances\nI had many things: a beautiful woman I loved, a home, money\nAnd I gave it all up to bleed and to die free\nSometimes I look back on that life\nAnd I wonder what it would've been like\nAnd in moments of weakness I think about trading it\nThen I snap the fuck out of it and I get back to my reality\nAnd I realize that I'm in the heart of a war\nAnd that's the place a martyr is born", "image": "https://images.genius.com/d17ee30cab427a6ea7fa3bfa64561580.400x400x1.jpg", "album": "The Martyr", "year": "2011-10-27"}]}