{"artist": "Isaiah Rashad", "songs": [{"title": "Heavenly Father x TDE", "lyrics": "[Verse 1]\nNow, everybody tellin' me a lie\nLordy, give me something for my soul\nSee, I don't wanna think of suicide\nSo please don't take the lock key off my door\nSee, I've been tired of fucking all these girls\nAnd I've been tired of spending all my dough\nAnd if I give my story to the world\nI wonder if they'd book me for a show\nSee you can't handle pressure on your own\nSo why you carry boulder by yourself?\nThe story’s storyteller tell it wrong\nAnd glorify the horror and the wealth\nAnd Mama call me, tell me coming home\nAnd I just need some guidance in my steps\nI know I'm not the only one alone\nI know I'm not the only one who felt\n\n[Hook: SZA]\nHeavenly Father, why are you so far away?\nHeavenly Father, why are you so far away?\nHeavenly Father, why are you so far away?\nHeavenly Father, why are you so far away?\n\n[Verse 2]\nNow, I'm praying that I make it twenty-five\nThey be calling doctors for my health\nAnd \"no\" is kinda hard to say to drugs\nCause I been having problems with myself\nAnd I been asking questions, where the love?\nAnd they don't give me answers, just a check\nAnd they don't know my issues as a child\nCause I was busy cutting on myself\nAnd hanging from the playground wasn't wrong\nUntil you got a rope around your neck\nAnd I been losing more than just my mind\nGathering what's left of self-respect\nAnd Daddy, why you call me while you're drunk?\nAnd why you never love me when I need it?\nAnd I don't wanna be like you no more\nAnd I been trying to cope, I'm getting weeded\n\n[Hook]\n\n[Verse 3]\nI smoke too much: The problems of a twenty-something\nI drink too often, there's liquor pouring from the faucet\nYou would assume by following the tunes\nThat I'm doomed to die young, addicted to dry plum\nThese bitches ain't shit, and pussy is my greatest vice\nI love smoking weed, I hate advice\nI know some niggas that talk good\nThe wise men from a long line of bitch-made and brides-men\nYou never had nothing but fucking dreams\nYou just caught up in the hype\nThe fashion and so it seems, the limelight\nI know that I rhyme tight\nNo need for your two cents and burning your blueprints\nThese people think I really give a fuck about the shit they give a fuck about\nJust need a moment of silence, just close your fuckin' mouth\nInfatuated with violence, gun in my fuckin' mouth\nSo you don't even know that I'm serious, know what I'm talkin' 'bout\nLike you got punchlines for days\nSo generic your flow\nYou're too cold, you're aged\nAnd you got punch lines for days\nSo generic your flow\nYou're too cold, you're aged\nYeah, and I'm so misrepresented by niggas that claim trill\nAnd they souls was never in it, like\nAnd I'm so misrepresented by niggas that claim trill\nThey souls was never in it, like...", "image": "https://images.genius.com/f3bf7e237d3161e1014a53c4a379c197.300x169x1.jpg", "album": null, "year": null}]}