{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Intro: Rock City]\nRight about now...\nAnthalon time\nNow dun Tell em Rude bwoy\nEast coast, west coast all the way to da down south\nEverybody this [?] kicking em out\nLet da man know we large\n\n[Verse 1: Beanie Sigel]\nIt's the Broad Street Bully Back, ready to lock in\nMy hand on my twins, underneath where my cock ends, (No no no, no no no)\nNiggas got cute once they heard I was locked in\nBut here's where all the bull shit 'bout the Roc ends, (Ay)\nFresh over the barbed wire it's the live wire\nDisrespectful, ignorant nigga, You suck my dick\nDrink my piss, can eat my shit\nStrictly raw-dog when I enter you niggas, (No no no, no no..)\nNo pause, no homo, no vaseline\nWhen I end a nigga slowmo with that broomstick nigga, (Yeah)\nThe boss'll dash when that glick start chopping\nAll y'all fags is drag bitch you'll lip off poppin'\nWhatchu know about the S.P. hardheads\nRuthless then them niggas that ran in Jabar crib, Flood that strip\nWith 50 shakes, big beards and bald heads\nScared couldn't rent no space where law fear, (No no, no no)\nYou Niggas don't want it with fat boy\nYou'd rather get your hair permed & pulled, Hit with a strap on\nI'm a grown ass man, I don't play no games\nDeath could be your destiny child if you say my name\n\n[Hook]\nWe fire gun shots to the ceiling\nYo disrespected us you're bleeding now\nNo witness na leavin'\nWe puttin' everybody down on the floor, (Hey)\nSo go low, (Low)\nEverybody go low\nSo go low\nEverybody go low\n\n[Verse 2: Beanie Sigel]\nI'm what the game' missin' (Yes)\nYoung nigga old soul still kickin'\nNew game old rules no snitchin'(Yes)\nNew connect fewer digits, Old money new bitches, (HEY)\nPaper ain't shit, I pistol whip\nA hundred thou' on the swiss movement\nAbout a dolla imma get to it\nAnd I'm a monster on that thick fluid\nI run through problems like Tony but I don't sniff through it\nI just rock it and spin it the water stick to it\nEvery Day I'm Hustlin', Push It harder than Rick do it, (Yeah yeah yeah yeah)\nI keep it Cannon like Nick do\nSee me in the streets U Don't Know Me like Flip do ya? (Whoa!)\nDisturb the Peace like Cris do it, (Hey!)\nI bring the Rucker like Skip to ya, (Hey!)\nHey young worl'\nDo you like it when I talk slick to ya\nBroad Street Bully Back bitch!\n\n[Hook]\n\n[Verse 3: Beanie Sigel]\nI'm what the game lackin'\nLike Joe no Jackson's\nLike Kobe' no Shaqin'\nLike James no Magic\nYou niggas got the game bass akcwards, Same by rights\nNobody sufferin' the repercussions for they actions\nI'm 'bout to get back on my geographic\nYou know South Philly muhfuckas kill at will\nOn site, broad daylight, (We killin' it, We killin' it)\nPeel that steel\n30 shots in the extended, Don't tempt me\nShort fuse no wick on it\nBroad shoulder with a chip on it\nGet off my dick put yo' bitch on it\nMan I'm the shit with no stink on it, You smell me? (No no no no no)\nFuck you gon' tell me nigga\nSee it's the real dookie\nYou just a new jacked pookie\nI ain't one o' yo' boys in da hood\nI'm a menace in dis\nWaste deep repin' State P biotch!\n\n[Hook]\nNo no no, no no no\nYeah yeah yeah, yeah yeah yeah\nBeanie Sigel\nAnd Rock City you know see you in trouble now\nKonvict Music & State Property a run dem down (dem down)\n\nStop it!\n\nHey!", "image": "https://images.genius.com/356ca6b0db6d8d8b7be50568bdfb53c0.700x695x1.jpg", "year": null, "title": "Go Low", "album": "The Solution"}]}