{"artist": "Professor Green", "songs": [{"album": "Unreleased", "title": "Just Be Good To Green (Original)", "image": "https://images.genius.com/8af669cea7b836e5762c2fa13521b751.1000x1000x1.png", "lyrics": "[Intro: Neon Hitch (Professor Green)]\nFriends tell me I am crazy\nThat I’m wasting time with you\nYou’ll never be mine\n(Just be good to me)\nJust be good to me\n\n[Verse 1: Professor Green (Neon Hitch)]\nHuh, just be good to Green\nAll I need is a woman to be good to me\nI'm an easy man, I’m easily pleased\nAnd you provide me with everything that I need\nLook, you know I make ends, I grind\nSo hold on to yours, we’re spending mine\nThough you try, I never let you buy\nBut if I was broke, would you still be spending time? (Yes)\nAnd I believe you would\nDon’t think P’s too fucked to treat you good\nI’ll walk street with you (Yes)\nTalk deep with you (Yes)\nEven sleep and spend all week with you\nAnd I’m off\nYou wish I’d put an end to the torment\nStop, but one thing it’s not ever is boring\nWhat would you rather me be that?\nI ain’t ever gonna change; are you ever gonna to realize?\n\n[Hook: Neon Hitch] (Professor Green)\nPeople always talk about\n(Look, people are always going to talk, babes)\nReputation\n(I ain't even gonna lie, shit\nBut it ain't like you don't know what mine is)\nI don’t care what you do to them (Nah?)\nJust be good to me\n(I’ll try, I’ll try, I’ll try)\n\n[Verse 2: Professor Green (Neon Hitch)]\nLook, babes, you know who I am\nBut as crooked as I am, I’ll be as good as I can\nI can try and try, though it's evident\nMy angel face is disguise for the devil inside\nYou’re good to me; I ain’t good to girls, me\nI’m a bad boy, something every good girl needs\nHey, honesty could avoid all your tantrums\nBut I’m a naughty boy and I always have been\nWhat? And that ain’t changing anytime soon\nI can’t have you with me whenever I move\nWhatever I do, I come back to you\nSee, the good attracts me and the crook attracts you (Whatever)\nWhat? We all got our ways, remember us talking\nOf course it was game\nBut it’s all gonna change. Now she got me cutting off links\nLike I’m trying to shorten my chain\n\n[Hook: Neon Hitch (Professor Green)]\nPeople always talk about\n(Look, people are always going to talk, babes)\nReputation\n(I ain’t even going to lie, shit\nBut it ain’t like you don't know what mine is)\nI don’t care what you do to them (Nah?)\nJust be good to me\n(I’ll try, I’ll try, I’ll try)\n\nFriends are always telling me\nYou’re a user\n(Not me, not ever; ain’t no other man gonna treat you better)\nI don’t care what you do to them (Nah?)\nJust be good to me\n(I’ll try, I’ll try, I’ll try)\n\n[Coda: Neon Hitch (Professor Green)]\nI’ll be good to you, you’ll be good to me\nWe can be together, be together (just be good to me)\nI’ll be good to you, you’ll be good to me\nWe can be together, be together (just be good to me)\n\nI don’t care what you do to them\nJust be good to me\nJust be good to me", "year": "2007-01-01"}]}