{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/af724b9ba541090b48f84b5fd730c26d.820x820x1.jpg", "title": "Out for That Life", "year": null, "album": "Return of the Don", "lyrics": "[Intro: Kool G Rap]\nYo, Moss, let's go in\nYeah, act like you know\nI'm out for that life\n\n[Verse 1: Kool G Rap]\nGimme a check\nYou know the team making mad noise\nReal on the code, Richie bitches in the lab, boy\nSick as shelter life, wanna run with the bad boys\nHelicopters snap shots, poppin' for the tabloids\nUp in the club, burner tucked in the ass, boy\nVintage whip like Charlie Sheen's dash boys\nGettin' oral, from a bitch with a name that be immortal\nGet stripped of all morals\nFrom a nigga hardbody on that Queens shit\nStay robbin' hard, now world on the team dick\nExotic bitches, fat asses with the mean lips\nPalm trees, water caves and serene shit\nThe arsenal up in the crib, take my ring clips\nTape her too, your girl wanna be on the scene with\nGas operator, rifle with 'em for the clean hit\nLifetime hood nigga, now it's time the scene quit\n(I'm out for that life)\n\n[Chorus: Kool G Rap]\nDid every hood nigga wanna live?\n200 on the whip, half a mil on the crib\n200 on the whip, half a mil on the crib\n(I'm out for that life)\n\n[Verse 2: Raekwon]\nLavish dinners, I smoke with the winners\nSippin' Crew, blunts is big, Uzi's is new\nFresh pair of British, yo I sit with the chemist\nUsing iodine and morphine based in Guinness\nSneaker game is famous, jewelry from Qatar to Bar\nUp in my G9, that's wood Mercedes\nLiving raw, clean cut, just me and a mean plug\nSell a few tons to my sons, Moroccan rum\nGet burnt, light ounces, back in the mountains\nWe can pray, train with the bears and give 'em Airs\nTry not go in there, press play, lines that Chef say\nEstablished from under the building, we're the best today\nDisrupt the leaders, it's on, yo, I'm squeezing\nThat's that, this is simple, plus a Biblical fact\nTo slay matyrs, yo we partners\nIn the culture, no vultures\nStreet legend, a legend\n(I'm out for that life)\n\n[Chorus; Kool G Rap]\nDid every hood nigga wanna live?\n200 on the whip, half a mil on the crib\n200 on the whip, half a mil on the crib\n\n[Verse 3: Kool G Rap]\nYo, you can take a nigga out the hood\nBut not the hood out a nigga\nBe in Hollywood OD'ing like River\nMe and all my niggas in and out of dope cars\nBut bread can't hang from your favorite show stars\nCage these stingrays, shades for the sun rays\nChick with a head scarf, Marilyn Monroe shades\nMade by Chloe, that's at least three-thousand\nOn a bitch eyes, act like you know me!\n90 on the highway, you looking at him sideways\nBlinded by the Liberace diamond, a peon way\nDoing it the live way, black unlimited\nPull up in some shit that make the city look primitive\nK-G-R carved in the gates on the premises\nLime on the eyelids, taking off the blemishes\n20 to the tailor for the suits with suspenders\nHood nigga tryna bag a bitch for the winter\n(I'm out for that life)\n\n[Chorus: Kool G Rap]\nDid every hood nigga wanna live?\n200 on the whip, half a mil on the crib\n200 on the whip, half a mil on the crib\n(I'm out for that life)\n\nI'm out for that life"}]}