{"songs": [{"year": null, "image": "https://images.genius.com/3749c060f89eca4eb3dac2193a559a45.991x1000x1.jpg", "title": "Highdollaz", "album": "Be Yo Self", "lyrics": "Verse 1:\n\nI'm high till I die\nDrunk till I'm gone\nEverybody wanna talk but leave me alone\nHomies sayz about the feds, little brothers dead\nAnd all I see is murder and trouble always ahead\nSo I'm trapped in pain, cause momma won't stop cryin'\nGot nothin' to gain in the game forever tryin'\nWill I lose so I choose to be a killa\nSo when you mention Syke they say, fuck that nigga\nBut I don't give a fuck I'm drivin' buckets\nStackin' duckets, tryna get my mail\nConstantly warned about death in jail\nSo I'm high why even try, Glocks to the sky\nIt's either me or the enemy somebody gonna die\nBut nobody cares the world is so ungrateful\nIt ain't fair my woman dropped me after being faithful\nI can't take it I smoke a pack a day\nIt's like I'm goin' cracked away\nWhat you say...\n\nChorus:\nTime's revolvin' can you see the change?\nNever solvin' things will always stay the same\nTime's revolvin' can you feel the pain?\nNever solvin' things will always stay the same\n\nVerse 2:\n\nDear mister president I represent the ghetto\nTell ya wife hello, I'll be brief wid this kinda grief\nNiggas is locked up set blocked up penetentiary lies\nMo' niggas in jail than baptised\nFor centuries my loyalty family pockets stay lackin'\nHomie's stretch is overcrowded and you still taxin'\nHomies dyin' now who got the clout, not me\nYou get more time for 5 grammes and a half a ki\nBlacks poppin' rocks, whites on the powder grind\nYou wanna test mine, rather die than let you see me cry\nSo I'm lost what's the cost for a crime boss\nIt depends on the color of the sauce\nDemocrats Republicans stumblin' to the concrete\nCause they covered by white sheets\nCan't compete wid you scandalous politicians\nSo every fuckin' night, I'm on a mission\nHighdolla gangbangin'\n\nChorus\n\nVerse 3:\n\nStill caught between my woman and my pistol and my chips\nI'm surrounded by blood and crips, will I trip?\nI need money disjunction, so I'm wild can't function\nAin't that something for nothing?\nWho the fuck do I look like?\nTo go from Lil Syke to Big Syke overnight\nBangin' tights in '79 rollin' perimeters\nFrom January to December, can you remember?\nBig homies puttin' in work, 6-4s in the dirt\nGoing body wid your Gs till ya knuckles hurt\nIn the land of the lost where it cost to bang\nSo I made it off the street fame fuck the rap game\nIt's a shame so much pressure and pain\nNiggas can't maintain cause on the streets they got bustas scandalous\nNow you a killin' apparatus nigga come now\nVow to stay a hog till the day I die\nWhile busta niggas wanna try\nThis highdolla gangbangin'\n\nChorus (2x)"}], "artist": "Big Syke"}