{"artist": "Wiley", "songs": [{"year": null, "lyrics": "[Intro]\nEskiboy (Eskiboy)\n10 Pound An Hour Volume 1 (Hello)\nYou know me, (10 Pounds An Hour) the work rate's is tight\n(Yeah)\n(Yeah) And the snow follows me everywhere, trust me, (Snow following)\nI remember the last time, man went Switzerland and the snow was right behind me (Yeah)\nMan went Germany, snow was right behind me (Right behind me)\n(Grimey) That’s how it goes, listen\nIt's Eskiboy, 10 Pound An Hour Volume 1 (Hold tight [?])\nI got a new one, listen\nYo, yo, yo, yo\n\n[Verse 1]\nI got a new one, white, red, and blue one\nNike sweater, new one\nBike's [?] new one\nMan looking for the ride\nAnd I got the new one\nGlassy, new one\nNasty, new one\nWhat have you and who done?\nWhat do you and who do?\nJack shit, guess you’re a liar, that's a new\nDidn't know you was a fuckin'\nYeah that's a new one, true one, Marcus blue one\nHad an old gun but now you got a new one\nHad old fund now I'm looking for new fund\nHad a couple of choongers on campus\nI had to let 'em all go but now I got a new one\nIf I hear anybody in the game try and copy this flow\nI'll go and do a new\nYou dun know the MySpace but I was thinking\n\"shall I go and do a new one?\"\nNew one, new one, yeah I got a new one\nMy ting’s real, your bredder’s got a glue gun\nBattle with your crew til the whole of your crew's done\nMy empire weighs fully, you’re a two ton\nNot bad but now your flow's shit, get a new one\nAnd I don't wanna hear anybody say \"old one\"\nGetting them hyper, yeah that's an old one\nBut I’ve got a bad boy lyric, it's a new one\nTiger bang, that's two more old ones\nWiley ain't broke, I'm still spending old funds\nLet's talk about property houses\nI'm not a loser, I just got a new one\nCan't stop raving bars, Prada shoe ones\nBlack Prada shoe ones\nI've been introduced to a couple of new ones\nYour girl rang me, it don't matter anyway\nYou said you had a new one\n\n[Outro]\nYeah, you said you had a new one\nSo if you see me rolling with her, you can't be complaining because you said you had a new one fam\nYou get me?\n10 Pound An Hour Volume 1\nEskiboy AKA Wiley\nIn the building, Boy Better Know, Roll Deep\nWatch out for Eskibeat Recordings\nEskibeat Recordings\n10 Pound An Hour Volume 1\nYou dun know the MySpace", "image": "https://images.genius.com/69962f266a3b134c548bf544c8c645de.700x700x1.jpg", "album": "Tunnel Vision Volume 6", "title": "10 Pound An Hour Trailer"}]}