{"artist": "Westside Gunn", "songs": [{"year": "2019-07-05", "lyrics": "[Verse]\nAyo, Burberry rain shoes for a rainy day\nHangin' out the Bentley coupe with the throwaway\nA horse ain’t the same\nHeadshots so all you see is brains\nThe whole hood know my name\nPut my first gat in the hall of fame\n\n[Chorus]\nI do you filthy for the bag\nI do you filthy for the bag\nDo you filthy for the bag\nDo you filthy for the bag\nDo you filthy for the bag\nA little nigga do you filthy for the bag\n\n[Outro]\nYou ever seen brains before? (Ever seen brains before)\nYou're sellin' ’caine raw (Sellin' 'caine raw)\nA hundred bricks in the wall (Hundred bricks in the wall)\nWe the flyest of them all (We the flyest of them all)\n\n[Skit]\nI'm, I'm wondering if I can get a man in\nIf I can get a man in with, uh\nA little, a little lower profile\nLadies and gentlemen, certainly a man who needs no introduction\nAnywhere, of course, ha, in the greater New York area and certainly around the country watching at this point in time\nUh, we saw you earlier, Andy Warhol, your impressions of what took place earlier on here\nUh, I'm speechless\nWell, you've gotta be, I mean, so many\nI mean, I saw jaws drop to the, to the floor\nUh, it's just so exciting, I just don’t know what to say\nHave you, have you ever seen such total bedlam and pandemonium in your entire life?\nNever\nYour impressions of the rock and wrestling connection? Don’t, don't you think that they got together tonight here and band together, and stood on firm ground?\nIt’s the best that I've ever seen in my whole life, most exciting thing\nWell, I tell you what, I thank you very much\nUh, Andy Warhol, I thank, I thank you very much for joining us\nGood luck, and one of the greatest wrestling fans, always a pleasure seeing you here at Madison Square Garden\nThanks a lot\nGood luck to you, I thank you", "image": "https://images.genius.com/cba8fa98f034da65ce2df6fa9da711cf.1000x1000x1.jpg", "album": "Flygod Is An Awesome God", "title": "Birkin"}]}