{"songs": [{"year": "2009-12-07", "image": "https://images.genius.com/272474ceee5319b4c45197976f4e918f.564x564x1.jpg", "title": "4 My Town (Play Ball)", "album": "Pricele$$", "lyrics": "[Intro: Birdman]\nPlay ball!\nYeah, so priceless\nLife's so priceless nigga, you understand me? It's just like that\nMy car so priceless, my bitch so priceless, my familia is so priceless nigga, ya understand me?\nEither you wit us, or you ain't wit us\nOr either you in the huddle or yall could huddle\nEither you ridin up or we pass some flyin by sayin \"Fuck it\"\nIt's Young Money Cash Money playboy\nThat's bout the size up\nAt the rooftop, so hot up in here nigga\nYeah, let's go\n\n[Chorus: Drake]\nTake yourself a picture when I'm standing at the mound\nAnd I swear it's going down, I'm just repping for my town\nOff a cup of C.J Gibson, man I'm faded off the brown\nAnd I’m easily influenced by the niggas I'm around\nSee that Aston Martin, when I start it hear the sound\nI ain't never graduated, I ain't got no cap and gown\nBut the girls in my class who were smart enough to pass\nBe at all my fucking parties, grabbing money off the ground\n\n[Verse 1: Drake]\nYeah, all hail Mr. Lyrical\nSpades or the Opus, baby, what you got a feeling for?\nI can show you new things, have you feeling spiritual\nPastor Kerney Thomas to these hoes - miwacles\nYeah, okay, they say that I'm the one, in fact\nSome say that I'm their favorite but I ain't hearing none of that\nI’m about my team, ho, Young Money running back\nCash Money superstar, where the fuck is Stunna at?\nDamn\n\n[Verse 2: Birdman]\nUntouchable 40 with my AK\nMastermind, big money heavy weight\nOn the grind, flipping money in every way\nHeadline, my bitch shine everyday\nPearl white Don P, Marc Jacobs gloves\nCartier Louis case with a dope plod\nFrom the mud where they what you leave in your blood\nGoing in, flipping hundreds get the young plug\nShow ‘em where it go\nFloating on the floor, getting more dough\nGrind hard, go, black diamond show, watch the flame blow\nAnd how you stay grounded? Cash no go\nAnd how you stay mounded? Cash no flow\nAnd how you stay shining? Bentley off the floor\nAnd how you stay high? Purple pine dro\nDiamond minks, fur, February snow\n\n[Chorus: Drake & Lil Wayne]\nTake yourself a picture when I'm standing at the mound\nAnd I swear it's going down, I'm just repping for my town\nOff a cup of C.J Gibson, man I'm faded off the brown (CJ)\nAnd I’m easily influenced by the niggas I'm around (yeah)\nSee that Aston Martin, when I start it hear the sound\nI ain't never graduated, I ain't got no cap and gown (Stunna)\nBut the girls in my class who were smart enough to pass\nBe at all my fucking parties, grabbing money off the ground\n\n[Verse 3: Lil Wayne]\nUhh, you know you paid when you got Baby with ya\nIt's Young Money like Ben Frank's baby pictures\nI’m a lady twister, I kiss her whiskers\nI been running this shit - blisters\nSticking to the script: movie star money\nAnd if you gassed up, I leave the car running\nI’m a big smoker, I’m a little drinker\nMy peace sign is just the trigger and the middle finger\nWha-what you know about it, man ya’ll clueless\nI let two women ride me, that's car-poolers\nI rock stupid ice, Mr. Water Coolers\nIf y'all in the building then we are intruders\nSimmer down, pimpin', let me handle this\nI know the game: analyst\nMan I’m the shit, and y'all janitors\nBlow out the kush and crack a smile for the cameras\n\n[Chorus: Drake & Lil Wayne]\nTake yourself a picture when I'm standing at the mound (Tunechi)\nAnd I swear it's going down, I'm just repping for my town (Yeah)\nOff a cup of C.J Gibson, man I'm faded off the brown\nAnd I’m easily influenced by the niggas I'm around\nSee that Aston Martin, when I start it hear the sound\nI ain't never graduated, I ain't got no cap and gown\nBut the girls in my class who were smart enough to pass\nBe at all my fucking parties, grabbing money off the ground\n\n[Outro: Birdman]\nI see you boy\nMula, ya [?]\nBehind the sky\nWho next, [?], believe that\n[?] cloud and smoke, yeah\nWe up here boy\nStraight over old school, just like\nJust like that, CMB\nDrizzy, 1 hunnid\nBrr-eah"}], "artist": "Birdman"}