{"artist": "Angie Martinez", "songs": [{"title": "New York, New York", "image": "https://images.genius.com/640767a123d7da2b7b75c5a07ab025a4.355x352x1.jpg", "album": "Up Close and Personal", "lyrics": "[Clue]\nDJ Clue.. Desert Storm.. Angie Martinez.. Prodigy..\nLive from New York, nigga..\n\n[Angie]\nUhh.. uhh.. yo-yo, uhh, yo\n\nThey say it ain't where you from that it's where you at\nBut where I'm from, y'all can tell\nDon't matter where I'm at\nBorn and bred in the streets of New York, New York\nIt's evident in the way that I talk-a-talk\nI travel abroad by the Concorde, with a Clue tape (Clue!)\n\nStop in Sicily and tell 'em they pizza fake\nAnd I keep the faith in the Knicks, them fuckers\nAnd I'm quick to get slick with the lip\nAnd word to mother\nLove a dude with a doo-rag from where we suffer\nFrom growing up too fast\n\nI'm a rude ass bitch when I need to be\nBut I'm cool as shit if you real with me, you feelin me?\nI never sleep like my city\nWhen it's time to get this money\n\nGot game, spot game\nSo don't act funny (hah hah)\nWe the block, we the ave\nWe the Bronx, we Manhattan\nFrom Staten, to Long Island\nWe make it happen, out in\n\n[Hook: Prodigy] + Clue {​ad libs}​\nNEW YORK, NEW YORK\n[P] The city, the buildings\n[P] The big rotten apple, old timers and children\nNEW YORK, NEW YORK\n[P] We trendsetters\n[P] We gave birth to rap music, y'all niggas know better\nWe NEW YORK, NEW YORK\n[P] The latest fashion, listen\n[P] We get our jewels from the Diamond District\nOut in NEW YORK, NEW YORK\n[P] The brave, the great\n[P] The Eastside nigga, the Empire State\n\n[Prodigy]\nNigga we gangsta, we dress to kill\nWe on some real live Mobb shit, pullin up in trucks flossing\nThe bosses, we scare 'em straight, it's not a game\nHow we bully shit, you fuck around and get your food ate boy\nMy razor make your face ke-loid\nThen I throw my drink at you (woo!) just to make that shit burn\n\nWe make heads turn when we step in\nYou starin at my piece swinging\nIt might hypnotize you\nDunn, we never had to tuck our chains\nMarquis diamonds all up in your face\nWe the hood, we the projects, we Brooklyn, we Queens\nIn the streets, our music is murder, ya heard me?\n\nIt's P (yeah) loud and clear\nIt ain't fair\nHow I keep droppin that shit that make you look stupid\nMe and Angie\nGot the hottest shit movin on the block right now\nY'all bitches bow down, to..\n\n[Hook]\n\n[Prodigy]\nYo, we don't negotiate, we move on impulse\nYou try to insult me and my associates\nSo that note, we let the guns speak on our behalf\nWe got dough to keep dirt up off our hands\nC'mon, we the M-O-B-B nigga\nWe the Mobb\nWho the fuck did you think it was?\nStep aside youngbloods when you see New York niggas come through\nSilent murder, that's how we do\n\n[Angie]\nOut in NEW YORK, NEW YORK\nWhere they tend to wild out\nWho am I?\nEverything bitches pretend to be about\n\nAngie, yeah baby, you thought it was me\nNotoriously, N.Y.C\nAnd y'all can see\nI'ma be that chick you remember for life\n\nI got niggas sick trying to make me they wife\nI'm in the 5 overdrive as I glide across the bridge\nRockin my sunglasses\nSigning pictures for the kids\n\nI demolish from Tribeca to Hollis\n+Sky's the Limit+ like Chris Wallace - you can't stop it\nComin through respect due cause I'm the people's choice\nStop actin new yo, cause you know I'm the voice of\n\n[Hook]\n\n[Clue]\nBig shout to Queens, Brooklawn..\nUptown, the B.X., L.I., Shaolin, Y.O\nNigga!\n\nDesert Storm, Roc-A-Fella, it's William nigga..\nHolla!\nHev. E Components nigga, we built like that!", "year": null}]}