{"artist": "A$AP Rocky", "songs": [{"title": "Brand New Guy", "image": "https://images.genius.com/5fb9bbbba50174ef41a0dd1f68902363.500x500x1.jpg", "album": "LIVE.LOVE.A$AP", "lyrics": "[Intro: A$AP Rocky]\nYou know these big mouth niggas don't know how to act. I got my West Coast connection. These dead in the street industry mothafuckas talking 'bout \"We can't eat,\" talking 'bout \"we brand new guys,\" tell them niggas \"suck a dick!\"\n\n[Verse 1: A$AP Rocky]\nI'm camo down to my boxers, gold teeth, a Bathing Ape\nIt's animals in my projects like monkeys, orangutans\nBanana clip on that chopper, I hold heat, bangers bang\n(Let Chiquita speak) Bet it keep the peace that Lil B, brrangadang\nI don't care if you blue or you red flagging, hair swinging, my pants sagging\nHoes all on my bandwagon, your bitch gagging, she jet lagging\nAll my cuz niggas, what's cracking? All my blood niggas, what's popping?\nI ain't set tripping, I just happen to know who click-clacking, you mismatching\nFuck swag and you been jacking, fuck fly, I am fashion\nTryna cop that Benz wagon, my bitch drive it and my friends crash it\nNiggas threat with the chit-chatting, see a nigga don't shit happen\nI'm finna blow on that Bin Laden, so talk money, pig latin\n(Suck my fuckin' dick, bitch!)\n\n[Chorus: A$AP Rocky]\nBrand new clip, brand new nine\nBrand new bitch, brand new ride\nBrand new weed, brand new high\nBrand new me, meet the brand new guys\nBrand new clip, brand new nine\nBrand new bitch, brand new ride\nBrand new weed, brand new high\nBrand new me, meet the brand new guys\n\n[Verse 2: Schoolboy Q]\n345 be the big toy, now which nigga want it with the fat boy?\nClipped-up like I'm paranoid, high as hell nigga, Fitzroy\nPull it off through the city like \"errt\"\nSeen that ho nigga like \"errrr,\" hopped up on a nigga like murk\nPut that pussy nigga in a purse\nYou wouldn't be the first, cover him with dirt\nPut him in the ground, he was down to Earth\nNapped up nigga, I been down since birth\nBackpack full of random work\nWith two bad hoes, I'll teach you how to jerk\nTeach you how to jerk, swaggin' in my Js\nPop me a pill and throw that pussy a rave\nMy prerogative ways\nNappy chin hairs with the brand new fade\nBrand new nigga with the brand new venue\nSold that bitch out shoulda made that ho bigger\nKilling careers make these cupcakes remember\nMy objective is to serve your agenda\nBiggie and Nas put they ass in a blender\nSprinkle some 50 and came out this nigga\nEquipped with a gat and the dick in your mouth\nBalls in my hands and your bitch in my house\nTwisting up weed, I'm digging her out\nJust filling her out\nDo all that shit you be talking about\nWhile you gone? Shit, Netflix on your couch\nWhat this popcorn about?\nMicrowave oven while you out there cuffin'\nYou over there lovin'\nThat bitch be my stuffing, like...like we really be fucking\n\n[Chorus: A$AP Rocky]\nBrand new clip, brand new nine\nBrand new bitch, brand new ride\nBrand new weed, brand new high\nBrand new me, meet the brand new guys\n\n[Verse 3: Schoolboy Q & ASAP Rocky]\nBrand new shirt to the brand new drawers\nBrand new socks to the brand new Glock\nThis mothafucka hold 15, slap that ho in, tell the clip get lost\nBitch, I'm a boss, pulled up clean, don't you hear the exhaust\nGot my tie on, gripping on my iron, who I'm 'bout to fire on?\nRap game fucked up, boy, fuck you think I rap for?\nCrack game fucked up, boy, fuck you think I trap for?\nRiding 'round with that mask on, like a Mac attack when that strap on\nLike a Shaq attack on that backboard, clap on, clap off\nBlue pit in my back yard Red nose my bad broad\nTitan full of that hydro Pretty nigga, no catwalk\nBig burner in your big mouth Pussy niggas suck lead off\nI pull it up then skirt off, vodka shots, he Smirnoff\n40 ounce of that Cristal, Rose, that Rick Ross\nGot it jumping like Kriss Kross Mismatching, no jigsaw\nNo horseplay when we quick draw Pussy nigga get a tit job\nHands up, stick your mans up, your time's up, the new brand's up, Q!", "year": "2011-10-31"}]}