{"artist": "Azealia Banks", "songs": [{"title": "JFK", "image": "https://images.genius.com/4bb9df7f0fa6fa6ee25e87e45758a634.1000x1000x1.jpg", "album": "Broke with Expensive Taste", "lyrics": "[Verse 1: Azealia Banks]\nFirst lady on the floor, move sexy in Dior\nAs we, go on and on and on from the dusk till the dawn\nFully vampin' on the song, it’s a ball not a prom\nHave a pour at the bar, at the promenade- yo shorty lookin' gorge\nThe allure of a star\nThey applaud and in awe...\nThe chips in her palm, what’s a pigeon to a swan?\nA queen to a pawn?\nLuxury is on looking to explore, the Bambi on the lawn\nRed carpet to the car, in a garment from the gods\nI drips and Bogart - you're a target from the start\nAssassinate the look - murdering the gown\nFashion-Killa, the body dipped in brown\nGet the picture, nobody fit the crown\nShe’s the winner, (in) the lobby with a smile!\nJet black weave bout the length of a mile\nJet black feet while I clever craft styles\nMiss I’ll flip this and dip-dip twaow!\nMiss, I been this, you must’ve missed out\nDope when dressed up, ya boy strung out...\nHis Girl is pressed, now behave, calm down\nSip on old grapes and be laid lounge...\nBaby you look late, come peep my now\nGiving them good taste, the great’s don’t have\nMommy keep blaze, better get that cake\nShimmy it on stage, i’m giving them good face...\nSomebody on her page, somebody is amazed...\nIt’s just another day for the dame, just another day for the dame\n\n[Chorus: Azealia Banks]\nI am Miss Icon and I swore, I saw...\nA shade of green on ya and I took (I took)\nTime to teach ya, taught an allure, allure...\nA la-dy you wasn't before..\nFiner, free, high-modern and more (and more)\nYou favor me, now how I adore ya!\nDo you, dine or tea, Italian for two?\nA day to be around here with you.. with you\n\n[Verse 2: Theophilus London]\n(Hey!)\nGrand champ, it’s the bougie - the handsome\nRomance in advance, hit ya boo on her Samsung\nBeach bunnies, from Aruba to Cancun\nYa bitch save money just to move with the anthem\nSo prepare my niggas, gourmet grape taste, we rare my niggas\nHe where? He wear flair, beware my niggas\nYou scared, you see-through, you clear my nigga\nYou boys Scooby and Doo, I’m really groovy and frost\nYou niggas cooped in a hoop, i’m Cooley High in the Porsche\nI put these niggas on mute, to whom it may not concern...\nI got the bitch with the juice, you got the bitch with the germ\n2Pac in the coup, westside with the herb\nI got a flock of the hoots, a-list of the birds\nWhite model the muse, Arizona the first\nI took a trip from the Moon, to JFK for that work\n\n[Reprise: Azealia Banks]\nI am Miss Icon, I’ve seen you all of green, high-modern miss, I taught - I’ll teach you how to allure! Dine or Tea, Italian miss, I oughta meet ya darling, how finer free now how I adore - ya!\n\n[Chorus: Azealia Banks]", "year": "2014-11-08"}]}