{"songs": [{"year": null, "image": "https://images.rapgenius.com/61456b856546aa659dfd2021519e7443.500x500x1.jpg", "title": "Been A Minute", "album": "Strange Days Tour: A Decade of Excellence", "lyrics": "[Verse 1: Big Scoob]\nOn top now, that's why they love me\nHad to fall, heard them all say \"fuck me\"\nWhat goes around, villian, always comes back around\nCome on with it, man\nYou had to know they couldn't keep me down\nIt's been a minute\nSince I yelled out \"Hog style\"\nStranger danger, now you show me homie's hog wild\nIt's been long since my villains had me in a zone\nI'm in the club, see 'em shaking to our last song\nSo long, since I hit the states, what a rage\nFair warning, back stormin', these your last days\n[?] mass appealin', pussies take aim\nPlace a target, we the hardest in this rap game\nI don't stutter, if I said it then I meant it\nBeen a minute since we did it, ain't gon' lie, a nigga missed it\nBack at it now, Strange Music plus a gutter movement\n[?] the world, 'bout to shake the world, watch us do it\nBig Scoob!\n\n[Chorus: Bakarii]\nIt's been a minute, my nigga\nStill rubber bands, on my 50, still Killa City, my nigga\nStill on my grind for this mob shit\nI got you blunted before, now nigga [?] this\n\n[Verse 2: Bakarii]\nIt's been a minute, but I'm still Vill living\nYour cerebellum bitch, I will still peel it\nI'm hog stylin' for my skrill, still get it\nI represent the [?] Vill still [?]\nIt's been a minute, but my pinky still shining\nCanary yellow nigga, I'm still grinding\nStill mackin', pull in super bad bitches\nStill stackin' on a super cash mission\nIt's the Whitebear\n\n[Chorus: Bakarii]\nIt's been a minute, my nigga\nI had just been chillin' but I'm certainly still a Villian my nigga\nIt's still 57, 56\nThink I was stuntin' before well bitch watch this\n\n[Verse 3: TXX Will]\nIt's been a minute since I hit the town\nA villain in dookie brown, hella gone off Crown\nIt's been a minute since I hung with my dogs\nOn 56 and Highland, drinkin' leanin' on the walls\nIt's been a minute though\nSince a nigga hit the liquor store\nGrab the dice, shake 'em up, what they hittin' for?\nMoney down, watch a cold nigga roll\nTake the cash and go to Go-Chicken-Go\nIt's been a minute since I lost my temper\nShut down the [?], y'all fools remember?\nI think it was back in September\nIf you don't believe me, ask that chick named Jennifer\nIt's been a minute since they heard my flow\nWell shit, they still trippin' off the shit I said years ago\nSo we can all get drunk\nHand me my cup, and nigga pass the blunt\nT-Will\n\n[Verse 4: Legion]\nNow look, watch this, no hands\nWe can get up on the floor, make up our own dance, look\nWe can get down on my floor, take off our own pants\nYou know you get cut up when you fuck with a grown man\nThat won't fuck up my plans\nI got time management skills and I'll be damned if\nMy Vill they called me, real ready to party\nSay no more [?]\nAll of my niggas stupid\nTell 'em Legion is coming out of retirement soon, haha\nYeah, been a minute my nigga\nBut I still keep pretty bitches, a pistol, and plenty liquor, my nigga\nHonorary supervillain, you bitches\nHo yes, you can take my picture when you see me with 57 and 56\nI am Legion\n\n[Chorus: Bakarii]\nIt's been a minute, my nigga\nI had just been chillin' but I'm certainly still a Villian my nigga\nIt's still 57, 56\nThink I was stuntin' before well bitch watch this\nIt's been a minute, my nigga\nI had just been chillin' but I'm certainly still a Villian my nigga\nIt's still 57, 56\nThink I was stuntin' before well nigga watch this\n\n[Verse 5: [?] & Big Scoob]\nIt's been a minute since me and my villains did it, been in it\nSince '98 when the Lord's cries have been givin' them sinners\nShort Nitty, livin' and never dyin'\nRogue Dogs for life, stay lifted until we high\nWhat you know about it?\nIt's on now\nBloody Kutty 'bout to move the croud\nIt's on now\nWon't you turn this motherfucker out?\nIt's on now\nShow these niggas what you all about\nIt's on now\nMake these pussy niggas scream and shout\n\n[Verse 6: Kutt Calhoun]\nSince Dickies was dookie browners\nAnd niggas were sackin' baggin'\nMy crack on the corner, hustle [?] was my shit\nNiggas wasn't roguish 'til 56\nMade you cautious of what you should ride with\nNigga, that's on blood\nI ain't never repped it with more love\nLike I repped it for niggas that throw gloves\nOn the Deuce, nigga\nSo come and get a dose of your boy Kutt\nTalking to you while I'm fucking you up\nSo what it do?\nCalhoun!\n\n[Chorus: Bakarii]\nIt's been a minute, my nigga\nI had just been chillin' but I'm certainly still a Villian my nigga\nIt's still 57, 56\nThink I was stuntin' before well bitch watch this\nIt's been a minute, my nigga\nI had just been chillin' but I'm certainly still a Villian my nigga\nIt's still 57, 56\nThink I was stuntin' before well nigga watch this"}], "artist": "Big Scoob"}