{"songs": [{"image": "https://images.genius.com/3be60a8ec3e7fbe6085040a57f724a02.939x939x1.jpg", "album": null, "title": "Trill", "lyrics": "[Intro]\nYah, yeah-yeah, yeah\nStay prayed up\n\n[Verse 1]\nDid you see how many feds were at my door, wow\nShould've seen how many paps were at the courthouse\nDo you know how much I have had to fork out?\nWho's that fucking banging on the door now?\nIt's cool, let them in, it's only few of my lot from round the way\nShout out to the dawgies dem from day\nYeah they might come in a pack\nBut they all got my back so I'll never lead them astray\nI nearly lost my boy the other week\nThese streets will swallow you up, it's peak\nOne minute he was running his mouth on his celly to me\nAn hour later, he could just about speak\nWe addicted to diamonds\nWe ain't scared of no sirens\nWe just drive past the feds twice but they're none the wiser\nI'm repping for the underdogs\nYeah I'm a scumbag, watch me light up this nightclub\nDonny in a Nike glove\nSee I ain't no gunman\nBut chat shit in person, you'll get the one bang\nSwear down, next time it's gonna be a mad ting\nThat was the last time I get called a hasbeen\nI mean let's be real, I've got half a mil'\nTo get ... by Lulu and Jasmine\nMy YGs do what I say so\nWhy you think I'm always tryna lay low\nThey could boot me off of them airways\nBut that will never dictate my payroll\nWe had my tunes before iTunes\nBebo before Myspace\nThe whole gang got some deepthroat\nThe first time that they ever booked my face\nI never had a pot to piss in so fuck off, I'll call you later\nHad enough of giving all these handouts\nSo get your hands out my pot of paper\nNo matter how much that I spend or how much scrilla I earn for my gigs\nIf you're my bro then you already know that you never ever have to ask for a thing\nFuck sticking to one lane, I've got ten bruv\nIt be a wrap when I bring back N-Dubz cuz\nWhatever they say won't faze me 'cause I don't need to react, my friend does\nNow that's love\n\n[Chorus]\nOi that's love\nOnly thing that can buy my trust\nSeems like they only wanna do us any favours when we up\nThat's what's up, ay what's up\nYou know it's nothing but love\nBut I ain't always gon' be there when you run out of luck\nAnd that's trill\nNot everybody ends up with a house on the hill\nBelieve me, I know how you feel\nBut for now let's just be real\nActing like you the only one out in these streets\nWe all got families to feed\nSo all I can do is be trill\n\n[Hook]\nSo we come from the manor\nWhere's there's nothing but pasta\nAnd that doesn't matter\n'Cause when you take a L, you go get your hammer\nOi, oi, oi\nNot everybody ends up with a house on the hill\nSo if I can help then I will\nNo one can tell me about being trill\n\n[Verse 2]\nI mean why are you vexed?\nI told you that I would be back in a sec\nFuck that, give me an hour\nYou take all this money and power\nBut show no respect\nMatter fact, what's the point us even trying\nEvery time we try and talk you start crying\nYou know you're acting silly when you say you wanna end it with me and you're lying\nWhen really you dig me 'cause I'm a [Gassbag]\nTriple hashtag\nSmiley face and I'm feeling you 'cause you are body with a big ego and a tiny waist\nYou'll feel the love when you show me your loyalty\nWhat do you mean what do I mean?\nPlease stop annoying me\nAct like a queen and I'll treat you like royalty\nTo be fair I ain't gotta worry about a thing\nI ain't gon' keep asking you where you've been\nIf you're a whore and you're going on raw\nI'ma put you on the tour bus with the uck queen\nUh, that's what I thought, carry on acting a fool\nYou gassed little bruddas, back to the board\nWhat, has cat got your tongue?\nYou're actually dumb?\nAs for the funds and everything I've done\nThat was all out of love\n\n[Hook]\nOi that's love\nOnly thing that can buy my trust\nSeems like they only wanna do us any favours when we up\nThat's what's up, ay what's up\nYou know it's nothing but love\nBut I ain't always gon' be there when you run out of luck\nAnd that's trill\nNot everybody ends up with a house on the hill\nBelieve me, I know how you feel\nBut for now let's just be real\nActing like you the only one out in these streets\nWe all got families to feed\nSo all I can do is be trill\n\n[Hook]\nSo we come from the manor\nWhere's there's nothing but pasta\nAnd that doesn't matter\n'Cause when you take a L, you go get your hammer\nOi, oi, oi\nNot everybody ends up with a house on the hill\nSo if I can help then I will\nNo one can tell me about being trill\n\n[Outro]\nI done lost a hella stacks\nSo it's only right I get it by ya\nI done lost a hella, uh", "year": "2017-11-24"}], "artist": "Dappy"}