{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/85f538a44febd6cf0a31867a37173978.432x432x1.jpg", "title": "Down South", "year": "2017-10-29", "album": null, "lyrics": "[Verse 1]\nI know you from the Bronx\nHeard it's cold, it's like my heart\nLet me book ya a first class flight to Florida where it's hot\nI'ma take ya down south, show you what I'm rappin' 'bout\nYoung niggas, 14, permanent golds in they mouth\nI be jumpin' on these beats, remember sleepin' on the couch\nEvery nigga in these streets know about me, they can vouch\nI'm still wearin' Ree's like I'm still out here sellin' rock\nLike my Ree's, you gon' let me tie ya down or you not?\nWhen you wanna vacay? MIA is the spot\nWhere you hop on jet skis, niggas ridin' on yachts\nFour wheelers, cuban links, niggas hoppin' out the drop\nShow ya 'round the Noya, Ugly Corner, 1800 Block\n\n[Hook]\nGirl you motivate me, I been wonderin' lately\nAnd I was thinking, you and me\nI be smilin' baby when you call me baby\nYou know how to drink me, make me weak\nBaby girl you special\nI'ma try my best to, give you enough effort in the week\nAm I bein' extra?\nAm I oversteppin' my boundaries?\n\n[Verse 2]\n'Cause girl you got me singin'\nI feel like I'm figulatin'\nI might switch my occupation and just open up a bakery\n'Cause every night, we cakin'\nGirl you sweeter than Miss Allie\nI might eat ya like a pastry, and keep ya like my .380\nSay I been trippin' lately\nI been in my feelings lately\nI ain't even been jiggin', while they stickin', we conversatin'\nI ain't been trickin' with these bitches even though you ain't my lady\nWe ain't seal the deal but I'ma keep it real and be patient\nI'm runnin' with them Z's, remember dancin' with the devil\nYou 26, but I'm 2613 forever\nYoung rebel but I'm clever\nI don't get too sentimental\nNow I got you where I want you\nI know the spot like a freckle\nI know what it is now\nI know how I feel now\nI wanna build now, me with you\nCall me on the FaceTime\nHeard it through the grapevine, that I wanna plant my seed with you\nYou gon' make me change my ways\nPostin' on my page, WCW\nI want you to be my main\nI don't want no one but you\n\n[Hook]\nGirl you motivate me, I been wonderin' lately\nAnd I was thinking, you and me\nI be smilin' baby when you call me baby\nYou know how to drink me, make me weak\nBaby girl you special\nI'ma try my best to, give you enough effort in the week\nAm I bein' extra?\nAm I oversteppin' my boundaries?"}]}