{"songs": [{"image": "https://images.genius.com/c100b3565c638ca7d04eb7af1658f708.500x500x1.jpg", "album": "Generation Gaming V", "title": "DayZ", "lyrics": "[Verse 1]\nLook I know it's not often it's a zombie apocalypse\nBut I've got a big blow nobody can soften it so\nWithout further ado let me disclose what it's urgent to do\nTo avert your certain doom\nI urge your alertness to the words in the tune\nThe last survivors band together\nGrab supplies, ammo, whatever\nIt takes to stay ahead of the others\nAnd run from them Hell For Leather\nThere's bad manners in the Soviet bloc\nPeople call and they don't even knock\nI was brought up and thought people owe me a lot\nBut I learned very shortly I'm only a dot\nIn the sight of a scope of a rifle a blokes aiming\nRight at my dome and I'm going to be shot\nI'm going down quicker than the blood that I'm losing\nOh my God I've got to get a blood transfusion\nHow am I going to get it? Man, I better get moving\nBefore the other humans move in\nThe hammer in my head's getting madder and I'm woozy\nThought I heard a man shout \"Friendly\", Who's he?\nCan I trust him? Or should I bust him?\nFull of bullets, finger on the trigger and I'm gonna pull it\n\n[Chorus]\nI shot a zed in the head\nBut he didn't die because he was already dead (x2)\n\n[Verse 2]\nI've got a backpack full of mad crap\nWhatever you imagine I can craft that\nMags, maps, rags, raps\nI can turn a gas can to a gas lamp\nGas canisters, magazines, bandannas and batteries\nI'm an athlete, a survivor\nTry attacking me, then I'll find ya'\nThis is a patch that's full of disease\nSo you could catch a bullet with ease\nDeath comes as a sudden release\nFor he or she that'll struggle to see the wood for the trees\nI've never had such hunger for beans\nAnd I've drunk everything from the canteen in my jeans\nI've got to stay hydrated to make it\nBut I might die from the painkillers\nAt the rate that I'm taking them\nA bit of bacon would be amazing\nMy veganism dissipated and I'm a carnivore\nStarting wars, turn a bad situation to a carnival\nYou can't say that you aren't involved\nThe outbreak of the plague took part of your soul\nHumanity's hard to keep hold of\nAfter you've halted the heart of a soldier\n\n[Outro]", "year": "2014-01-31"}], "artist": "Dan Bull"}