{"artist": "Bobby Shmurda", "songs": [{"album": "Shmurda She Wrote", "title": "Hot Nigga", "year": "2014-07-25", "lyrics": "[Intro]\nY'all tryna make a next motherfuckin' scene up in here, huh?\nIt's fucking Shmurda she wrote (Ah-ah-ahh)\nHow much Shmoney''s that?\n(Nah-ah-ahh! Ah-ahh!)\nJahlil Beats, holla at me\nGrr-r-r-r!\n\n[Verse]\nI'm Chewy, I'm some hot nigga (Hot nigga)\nLike I talk too Shyste when I shot niggas (What's good?)\nLike you seen him twirl, then he drop, nigga (Seen him drop!)\nAnd we keep them 9 millis on my block, nigga\nAnd Monte keep it on him, he done dropped niggas\nAnd Trigger, he be wilding, he some hot nigga\nTones known to get busy with them Glocks, nigga\nTry to run down and you can catch a shot, nigga\nRunning through these checks 'til I pass out (Pass out)\nAnd shorty give me neck 'til I pass out (Pass out)\nI swear to God, all I do is cash out (All I do)\nAnd if you ain't a ho, get up out my trap house!\nI been selling crack since like the fifth grade (Like the fifth grade)\nReally never made no difference what the shit made (What the shit made)\nJaja taught me flip them packs and how to maintain (How to maintain)\nGet that money back and spend it on the same thang\nShawty like the way that I ball out (Ball out)\nI be getting money 'til I fall out (Fall out)\nYou talking cash, dog, I goes all out (All out)\nShorty love the way that I floss out\nFree Greezy, though, let all of my dogs out (Let my dogs out)\nMama said no pussycats inside my doghouse (Easy, nigga)\nThat's what got my daddy locked up in the dog pound (Huh)\nFree Phantom though, let all of my dogs out\nWe gon' pull up in that hooptie like we cops on 'em\nWith them 16s, we gon' put some shots on 'em\nI send a lil thot to send the drop on him (Send it, send it)\nShe gon' call me up and I'ma sic the hots on him (And I'ma, and I'ma)\nGrimey savage, that's what we are (We are)\nGrimey shooters dressed in G-Star (Star)\nGS9, I go so hard (Hard)\nBut GS for my gun squad (That's for my gun squad)\nAnd, bitch, if it's a problem, we gon' gun-brawl\nShots popping out the AR (B-B-B-Bow, nigga!)\nI'm with Trigger, I'm with Rasha, I'm with A-Rod (B-B-B-Bow, nigga!)\nBroad daylight and we gon' let them things bark\nTell them niggas free Meeshie, ho (Free Meeshie)\nSUBwave, free Breezy, ho (Free Breezy, ho)\nAnd tell my niggas, Shmurda teaming, ho (Shmurda teaming, ho)\nMitch caught a body about a week ago, week ago\nFuck with us and then we tweaking, ho, tweaking, ho\nRun up on that nigga, get to squeezing, ho, squeezing, ho\nEverybody catching bullet holes, bullet holes (B-B-B-Boom!)\nNiggas got me on my bully, yo, bully, yo\nI'ma run up, put that gun on him (That gun on him)\nI'ma run up, go dumb on him (Dumb on him)\nNiggas got me on that young shit (That young shit)\nGot me on that go-dumb shit (Dumb shit)\n\n[Outro]\nGot me on that go-dumb shit, man\nTrap mode in this motherfucker\nHotter than a bitch\nAyo, pour up! I need some more drank", "image": "https://images.genius.com/7707ee18291376fff38fe7b1bb137554.1000x1000x1.jpg"}]}