{"artist": "Wiley", "songs": [{"year": "2012-10-04", "lyrics": "[Verse 1: Wiley]\nI was on a path to the limelight\nNow I'm on another one it's a night flight\nWhen they say I'm a star I say thank you\nIt's all due to the scenes that I ran through\nSo I keep flyin the flags for all people\nNo messing about we're all equal\nVibe alive in the club when I roll in\nI get around with the crowd when I'm roaming\n\n[Hook: Ms D]\nEverybody right now, can you hear me?\nThrough the speakers turn me up if you hear me\nAyayaya, ayayaya\nAyayaya, ayayaya\nEverybody right now, can you hear me?\nThrough the speakers turn me up if you hear me\nAyayaya, ayayaya\nAyayaya, ayayaya\n\n[Verse 2: Wiley]\nThey should know I bring vibes on a club night\nKeep the crowd hyped up brother party\nRed, she wanna say words in my earlobe\nReminds me there's an hour of the party left\nSee the fireworks, celebration, team winning the Grey Goose amazing\nSend them Jägerbombs, I got a craving\nSo many women I don't wanna stop raving\nThey should know I got tunes for the gyal dem\nOnce the ladies are there see the man dem reach\nThey wanna leave there with a number\nCheck the peng ting she's gonna hang with me\nI'm skanking all round the party I'm skanking\nI got girls to the left and girls to the right\nWhen we're at the bar we ain't ramping\n\n[Hook: Ms D]\nEverybody right now, can you hear me?\nThrough the speakers turn me up if you hear me\nAyayaya, ayayaya\nAyayaya, ayayaya\nEverybody right now, can you hear me?\nThrough the speakers turn me up if you hear me\nAyayaya, ayayaya\nAyayaya, ayayaya\n\n[Verse 3: Skepta]\nWiley called me on the iPhone\nHe said get my passport, told me to come through\nPut your sun cream in your suitcase\nWhen I arrive I'm causing a heatwave too\nGot my snapback and my vest on\nLooking at the hot girl with the red dress on\nLight skin with a beautiful body like Kim so I had to get my Kanye West on\nShe told me she's feeling my jewellery\nShe said that she's in love with my Jesus piece\nI told her to look again closely\nIt's not Jesus, baby, it's Jme\nAnd I was like baby, come over\nI don't bite girl, come a little closer\nCome a little closer\nI don't bite girl, come a little clo-\n\n[Hook: Ms D]\nEverybody right now, can you hear me?\nThrough the speakers turn me up if you hear me\nAyayaya, ayayaya\nAyayaya, ayayaya\nEverybody right now, can you hear me?\nThrough the speakers turn me up if you hear me\nAyayaya, ayayaya\nAyayaya, ayayaya\n\n[Verse 4: Jme]\nYou know I don't usually party\nBut Skepta and Wiley said it's a hype\nI can't find my phone or my car keys\nLike Zippy Tafari said on the mic\nThe vibe is off the Richter\nAnd I can't even tweet a picture\nI'm on the dance floor, the joke is\nI never had a drink but I'm acting the drunkest\nShe's staring like I'm a weirdo\nOr then again maybe she likes me\nI'm not supposed to be here though\nHaven't got a wrist band for the VIP\nNo triple A pass\nBut I'm partying with the stars\nYep, I can't complain\nI just enjoy while it lasts\n\n[Hook: Ms D]\nEverybody right now, can you hear me?\nThrough the speakers turn me up if you hear me\nAyayaya, ayayaya\nAyayaya, ayayaya\nEverybody right now, can you hear me?\nThrough the speakers turn me up if you hear me\nAyayaya, ayayaya\nAyayaya, ayayaya", "image": "https://images.genius.com/4fc74e022a19f7157b419f8ea7b838e0.500x500x1.jpg", "album": "The Ascent", "title": "Can You Hear Me? (Ayayaya)"}]}