{"songs": [{"lyrics": "[Intro]\nHey sugar how you doing huh?\nYour pretty face don't match that nasty attitude\nWhat you mean where my girl?\nProbably with your man\nCan we fuck?\n\n[Chorus]\nShe won't let me fuck (babyyyyy)\nI really need to bust a nut (ohhhhhh)\nShe won't let me fuck (honeyyyy)\nI really need to bust a nut (ohhhhhh)\n\n[Verse 1]\nIt's so flustrating, yeah, being a man\nAll these sexy women don't understand\nThings we need to do yeah\nEvery other day or two\nLike take you home baby yeah\nAnd make sweet love to you\nBut you you won't let me fuck\n\n[Chorus]\nShe won't let me fuck (You say the mood ain't right uh)\nI really need to bust a nut (I know that pussy's tight)\nShe won't let me fuck (oh give it to me baby)\nI really need to bust a nut (ohhhhh)\n\n[Verse 2]\nHer heart is still broken, her emotions are sore\nShe's trying to recover from the man before\nHer ex boyfriend, he probably can't see\nThat it was easy for him, but, uh, he made it hard for me\nCause she she won't let me fuck\n\n[Chorus]\nShe won't let me fuck (oh give it to me baby)\nI really need to bust a nut (you know just what I need yeah)\nShe won't let me fuck (girl you eating all my food\nGirl drinking all my beer)\nI really need to bust a nut (you're smoking all my weed yeah)\n\n[Verse 3]\nYou rub your ass against me on the disco floor\nI asked you for your number and you said hell no\nYou always hang around me, everyday\nDifferent women wanna kick it, but you scare them away\nNow I get up offended when you come around\nCause I'm tired of my organs, going up and down\nThat sucks, cause she won't let me fuck\n\n[Chorus]\nShe won't let me fuck (oh give it to me baby)\nI really need to bust a nut (don't play with my head again)\nShe won't let me fuck (let me hit it baby\nYeah let me hit it baby)\nI really need to bust a nut (are you a lesbian?)\n\n[Bridge]\nOh let me lick it baby\nYeah let me stick it honey\nI'll give you my money\nGirl you can have it all\nGo ahead and have a ball\nIf you want you can take em both, baby\n\n[Verse 4]\nIn the year 2000, I see thousand\nOf pretty young women I found arousin\nGrocery store shoppin, magazine browsin\nMany different ways to keep their hair styles in\nFull of boredom, I walk toward em\nGet em close to me, cause I'm suppose to be\nMale aggressor, female impresser\nSay the right things possibly undress her\nBut that's the post game\nThis is still the pre game\nSilly woman, she game\nBaby what's your name?\nEven though I'm a freak\nI play it off like a college geek\nCrack a smile and politely speak\nWith intellect to the women I select\nHoping that she don't detect\nMy egotistical chauvinistical lust\nI thrust till I scream like Mystikal\nYAAAAAAHHHH!\nThe wrong message I hope I'm not sendin\nLaughin and pretendin my dick's not extendin\nCan't be over zealous she might discover\nShe's walking away, BITCH!, blew my cover\n\n[Chorus]\nShe won't let me fuck (you know I love it)\nI really need to bust a nut (please don't change the subject)\nShe won't let me fuck (we could've fucked all night long)\nI really need to bust a nut (but you telephone number is bone)\nShe won't let me fuck (girl you got a lot to give)\nI really need to bust a nut (you dress so provocative yeah)\nShe won't let me fuck (I can see your lingerie from real far away)\nI really need to bust a nut (bitch! you must think I'm gay)\n\n[Outro]\nAw don't make me beg\nBaby let me rub your leg\nDon't make me cry\nLook into my eyes\nGirl you so damn pretty\nStop acting so sadiddy\nLet me rub some oil on your ti hahaha\nYo I'm up outta here she don't want to fuck cuz", "title": "She Won’t Let Me Fuck (Palmdale Sessions)", "album": "Happy to Be Alive", "image": "https://images.genius.com/5833155c0c1381ea982132707226ffa9.800x800x1.jpg", "year": null}], "artist": "Afroman"}