{"artist": "Immortal Technique", "songs": [{"title": "Peruvian Cocaine", "lyrics": "[Intro Dialogue from Scarface, 1983]\n\n[Interviewer]\n\"I've heard whispers... about the financial support your government receives from the drug industry?\"\n\n[Gutierrez]\n\"Well, the irony of this, of course, is that this money, which is in the billions, is coming from your country. You see, you are the major purchaser of our national product, which is, of course, cocaína.\"\n\n[Interviewer]\n\"Cocaine. On one hand, you're saying the United States government is spending millions of dollars to eliminate the flow of drugs onto our streets. At the same time, we are doing business with the very same government that is flooding our streets with cocaine?\"\n\n[Gutierrez]\n\"Mm, mm, si, si. Let me show you a few of the other characters that are involved in this... tragicomedy.\"\n\n[Spanish Dialogue]\n\n\"Oigan ustedes ahi! Ustedes trabajando! Sigan trabajando carajo!\"\n\"Oye Luis, ¿Cuándo van a terminar?\"\n\"Ahorita.\"\n\"Bueno que se apuren los burros. Ahorita viene el camión, apúra, diles!\"\n\"Ahorita van a venir para recoger los productos, apúrate!\"\n\n[Verse 1: Immortal Technique]\nI'm on the border of Bolivia, working for pennies\nTreated like a slave, the coca fields have to be ready\nThe spirit of my people is starving, broken and sweaty\nDreaming about revolution (\"¡Revolucion!\") looking at my machete\nBut the workload is too heavy to rise up in arms\nAnd if I ran away, I know they'd probably murder my moms\nSo I pray to Jesú Cristo when I go to the mission\nProcess the cocaine paste, and play my position\n\n[Verse 2: Pumpkinhead]\nOk, listen, Juan Valdez, just get me my product\nBefore we chop off your hands for worker's misconduct\nI got the power to shoot a copper, and not get charged\nAnd it would be sad to see your family in front of a firing squad\nSo, to feed your kids? I need these bricks\nForty tons in total, let me test it, indeed, I... [sniffs]\nShit, this is good.  Pass me a tissue\nAnd don't worry about them, I paid off the official\n\n[Verse 3: Diabolic]\nYo, it don't come as a challenge, I'm the son of some of the foulest\nElected by my people, the only one on the ballot\nBorn and bred to consult with feds, I laugh at fate\nAnd assassinate my predecessor to have his place\nIn a Third World fascist state, lock the nation\nWith 90% of the wealth in 10% of the population\nThe Central Intelligence Agency takes weight faithfully\nThe finest type of China white and cocaine, you'll see\n\n[Verse 4: Tonedeff]\nHoney, I'm home!  Never mind why your bank account's suddenly grown.  It's\nFunny we're so out of this debt from this money we owe!  Would you\nRun if I told you that I had two governments overthrown\nTo keep our son enrolled in a private school and to keep our tummies swollen?\nCome on, our fucking home was built on a foundation\nOf bloody throats.  The hungry stolen of their souls.  Of course this country's\nRunning coke.  I took a stunted oath to hush the ones who know\nThe CIA conducts the flow for these young hustlers that lust for dough\n\n[Verse 5: Poison Pen]\nI don't work in the hood.  Hit my connect.  That’s\nWhat's really good.  They supply work to the hood\nThese dudes fucking crack me up.  Scrutinized like\nWe inferior.  Petrified when we meet in my area (Calm down)\nMy dudes don’t shoot until I say so.  You got the loot?\nGive me the \"Yay-Yay!\" like Ice Cube, so don't play with\nMy llello.  We won't stop for you bastards\nMy street scramblers chop it and bag it\n\n[Verse 6: Loucipher]\nTaking pictures and tapping phones, debating snitches and\nCracking codes.  Fast to cuff or blast the fo' on any\nHustler stacking dough.  There’s probably crack or blow\nAnd my overtime is where your taxes go.  I’ll gain your trust\nGet you to hand weight to us ‘cause we paid up front\nOn the low with cameras taping ya.  Getting popped\nWith weight?  The prison sentence is due.  Make the call\nAnd then leave with two kis out the evidence room\n\n[Verse 7: C-Rayz Walz]\nWith my fame.  Truck, boat, or plane, they’re watching you\nYou think you got work?  They’re copping too!\nWe control blocks.  They lock countries and own\nCompanies.  We had nice cars and sneaker money!\nNow there's players out there talking 'bout they holding\nWith bugs in their house like they down South with windows open\nYour dough ain't long—you wrong—you take shorts and soon\nFeds’ll be up in your mouth like forks and spoons\nSo enjoy the rush, live plush off coke bread.  Soon\nYou'll be in a cell with me like Jenny Lopez\nIn a school, I was a bully.  Now life is fully a joke\nI’ll keep afloat on a boat for Peruvian coke\nPlayers do favors for governors and tax makers\nFat Quakers smoke crack and sex acts with bad mayors\nThe walls got ears.  You bigmouths probably scared\nNot prepared to do years like Javier\n\n[Outro: Immortal Technique]\n\"The story just told is an example of the path that drugs take on their way to every neighborhood, in every state, of this country. It's a lot deeper than the niggas on your block. So when they point the finger at you, brother man? This is what you've got to tell them.\"\n\n[Edited Outro Dialogue from New Jack City, 1991]\n\n[Nino Brown]\n\"I'm not guilty. You're the one that's guilty. The lawmakers, the politicians, the Columbian drug lords... all you who lobby against making drugs legal, just like you did with alcohol during the prohibition! You're the one who's guilty. I mean, c'mon, let's kick the ballistics here: ain't no Uzis made in Harlem! Not one of us in here owns a poppy field! This thing is bigger than Immortal Technique. This is big business. This is the American way.\"", "image": "https://images.genius.com/a47358fc5623b27b86b1276273a55bef.600x600x1.jpg", "album": "Revolutionary Vol. 2", "year": "2003-11-18"}]}