{"artist": "Papoose", "songs": [{"album": "The Underground King (Mixtape)", "title": "Hail Mary", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "While ya’ll was winning Grammy’s, I was gripping jammies\nI know you niggas fear me, cause I spit it scary\nAll the dead rappers, I resurrect them daily\nThis is Hail Mary\nWho got the thugs grabbing they semis? (Papoose)\nWho got the bad broads grabbing they titties? (Papoose)\nWho the nicest out of New York City? (Papoose)\nYou don’t exist, son of a bitch, vamoose!\nThese rappers don’t want to be introduced to me\nMaybe because I got too much Papoose in me\nI drop too much material exclusively\nIt’s because I’m everything that he used to be\nA lot of shit would be way different if Moose was free\nBut Moose is free now, motherfucker, Moose in me\nI represent the boy well, even Snoop could see\nI bang like he in the booth with me\nI don’t trust you as far as I could throw you, truthfully\nI'll throw you, don’t come on the roof with me\nI rock canary yellow diamonds at your eulogy\nKill you like vitamins, I got juice in me\nAll the old school rappers, I rep them all the time\nNow whose Jesus piece rules in '05?\nI make the motherfucking ground shake wherever I walk at\nDirty South, West Coast, where the fuck is New York at?\nIt’s right here homie, got Nike Airs on me, you know me\nKeep tight gear on me, your ice wear rollies, for surely\nDon’t like near bogey but light queers slowly for surely\nDon’t fight fair homie your light stares only provoke me\nYou play tough Tony get left holy moly for doly\nJoey's Chromey homie owe me homie don’t even know me\nSipping moey fat roly-poly phony bologna\nI give him a slice, you like anchovies, you phony\nI’m Shaq, you Kobe, I’m Kunta, you Toby\nI do my dirt up on my lonely\nYou do your dirt with a co-D\nI’d rather be a prisoner than a parolee\nDon’t want to own no time, I’d rather time own me\nThe upcoming rapper, I represent Duke\nWho want to play Monopoly? This is Papoose!\nYou grew up on the block, I hustled and banged on it\nParked the all black Lex, a buzz and a chain on it\nI’m thorough on the block, you’re a troublesome lame on it\nThink you’re making songs cause you mumble a name on it?\nWhy would I make a song and put your nickname on it\nWhen I got a bullet with your government name on it?\nProud on the block, you should be ashamed on it\nBlood, tears are streamed on it\nI’m the moment of silence uh, slump you on your hallway banister\nA lot of you niggas be wearing wires and cameras\nListening to my shit, biting like Dracula\nYou an amateur, the only one nicer than me is myself\nSo why battle ya?\nI go on 106th & Park if I’m the champion and the challenger\nAin’t drop an album, but a legend like Acura, I spit spectacular\nYour man got you carrying a gun, you ain’t going to bust a 40 caliber\nYou like a person with HIV, you a carrier\nEngaged to the 12 gauge, I’m going to marry her\nCrush all of your barriers, they say pressure busts pipes\nBut only crackheads fuck with pipes\nThe only thing pressure do is get me hyped\nI spit hard, like Mike Tyson when he strike\nTrue champion like Michael Jordan, I’m precise\nTake shots like Michael Bibby do all night\nBadder than Michael Jackson before he fucked up his life\nAnalyze the comparisons and all of the likes\nTell the facts like Michael- strong, always right\nI got the characteristics of five elite Mike’s\nSo it’s impossible for me to get three mics", "year": "2005-01-01"}]}