{"songs": [{"album": "Gutter Rainbows", "image": "https://images.genius.com/195bc58c1487ceee38b62b9e3ae90bdb.300x300x1.jpg", "year": "2010-11-16", "title": "I’m On One", "lyrics": "[Intro: Ed Lover]\nAiyyo this is Ed Lover man\nYo Talib, show these niggas what it is man\nYou're a real rhymer man, you're a real emcee man\nThese old doo-doo ass, bonehead\nFuckin Squarehead Spongebob-head motherfuck those kids\nThey ain't got no skills son, they can't do shit\nAiyyo Talib, tell 'em man, \"C'MON SON~!\"\n\n[Talib Kweli] + (Khrysis)\n(Yeah!) No sleep 'til Brooklyn\n(Khrysis on the board with the heat y'all, Kweli)\nYeahhhh!! (Let's get 'em)\n\n[Talib Kweli]\nSon... c'mon son\nYeh, yeah, I'm on one\nSon... c'mon son\nI, I, I'm on one\nSon... (yeah that's what you been waitin for) c'mon son\n(You are now in TUUUNE!) Yeh, yeah, I'm on one\n(You are now in tune) Son... c'mon son (Gutter Rainbows)\nYeah\n\n[Verse One]\nThis be that, crack it must be what you're usin if you challenge me\nYou're sniffin on that white girl\nThe Valeries, the Natalies, the Mallorys\nGot you sweatin like you're losin calories\nBattle me? You confuse illusion with reality\nBack up off me you had your glory\nMan I never seen a sadder story\nBlame yourself you mad at me you mad at Corey\nI left the maze you still the white mice in the laboratory\nDon't test the brain son, I'm quite nice at Scattergories\nMetaphors and allegories speakin at your colleges\nPathologies I keep my ghetto promises, I promise this\nThe rhyme'll leave you bloody as.. first responders get\nYou hear em coming with the sirens of titans like Kurt Vonnegut\nThey appetite for dominance rival that of the Ottoman\nPhenomenon, I'll eat you after dark like this was Ramadan\nAin't no patience for the whack emcee\nThis ain't WorldStar, homey this ain't Vlad TV\nSo stop posin for the camera, I'm showin all you amateurs\nLife is a bitch, it's how you handle her\nYou let the chips (uh uh) drop, let 'em fall where they may\nThis an \"Everyday Struggle\" like Notorious say\n\n[Hook]\nSon {*scratched: \"YEAH!\"*} c'mon son\n{\"YEAH!\"} Yeh, yeah, I'm on one\n{\"YEAH!\"} C'mon son\n{\"YEAH!\"} I, I, I\n\n[Verse Two]\nI got the recipe for rest in peace\nI never ran, but I'm lookin so Presidential\nI still command you to arrest the chief\nRebellion is my specialty\nWhile the mad cows convince you to invest in beef\nI play this game without a referee so there ain't no official\nSo even Too $hort couldn't \"Blow the Whistle\"\nOh yeah I flow a little! You mighta heard of me\nProducers got restrainin orders.. I murder beats\nState of emergency like Dudus Coke\nYou hate it but you love it though\nWe smoke and roll one up a double Dutch but I ain't jumpin rope\nMy gutter flow, ice cold like the love below\nBring the hood right into your bungalo\nTeach you how to start, ironically bionic Lee Majors\nNow you can do us a favor and stop your coonish behavior\nYou rude as Judas who was an intruder truly a hater\nStab your neighbor in the back, you'll do anything to be famous\nStop posin for the camera, I'm showin all you amateurs\nLife is a bitch, it's how you handle her\nYou let the chips (uh uh) drop, let 'em fall where they may\nThis an \"Everyday Struggle\" like Notorious say\n\n[Hook]\nSon {*scratched: \"YEAH!\"*} c'mon son\n{\"YEAH!\"} Yeh, yeah, I'm on one\n{\"YEAH!\"} C'mon son\n{\"YEAH!\"} Yeh, yeah, I'm on one\n\n[Talib Kweli, with \"YEAH!\" scratching]\nNow where y'all at man?\nThis is America ain't it?\nWhere can I be free?\nAy, you can do what you wanna do man\n\n[Outro: Ed Lover]\nYo what the fuck happened to skills man?\nY'all, y'all ain't go no skills man\nYo Kweli man, show these niggas what's goin on son\nShow these niggas man that\nTha-tha-tha-that that old A-B-C shit\nThat they talkin 'bout is bullshit son\nGet the FUCK outta here with that bullshit~!\nMan where's Mos Def at anyway son?\nF'real son, c'mon son!!"}], "artist": "Talib Kweli"}