{"songs": [{"album": "T.I. vs T.I.P.", "image": "https://images.genius.com/2f70d0ed3d87a3cc476cfb530ff86686.600x600x1.jpg", "year": "2007-07-03", "title": "Act III: T.I. vs T.I.P.: The Confrontation", "lyrics": "[T.I.P.:]\nMan Meet Me At The Mirror Man\nHurry Up\nCome Holla At Me\nNow!!\n\n[T.I.:]\nI See What The Fuck Going On Man\n\n[T.I.P.:]\nOh Bout Time\n\n[T.I.:]\nLadies And Gentleman I Apologize For The Confusion\n\n[T.I.P.:]\nWhat The F... Fuck Them Man You Better Holla At Me\n\n[T.I.:]\nSee If You Recall Back Trap Muzik We Had This Problem Once Before\n\n[T.I.P.:]\nMeet Me At The Mirror Man, Come To The Mirror Man\n\n[T.I.:]\nI Thought We Had This Shit Under Control Though You Know What I'm Saying?\n\n[T.I.P.:]\nNah Home Boy Man I Told Ya’ll I Was Going To Let You Do This Shit For A Minute\n\n[T.I.:]\nNah Man Hold Up Man I'm Talking, You See?\n\n[T.I.P.:]\nMan You Can't Shut Me Up Man I Got It From Here On Out (Yeah)\n\n[T.I.:]\nWell It's Obvious That We Can...\n\n[T.I.P.:]\nWe Doing This Shit My Way Now\n\n[T.I.:]\nMan This Dude Is Impossible Man\nMan Why Can't You Just Talk About What The F**Ks Wrong With You?\nMan Why Can't You Just Say What The Fuck's On Your Mind Man?\nQuit All That Acting Out\n\n[T.I.P.:]\nMan Talking Don't Do Motha F**Kin Good Man\nMan This Shit Got Way Out Of Hand Now\n\n[T.I.:]\nMan I Understand All That Bhuh Man But Look Though Man\nAll You Gotta Do Is Ride Out\n\n[T.I.P.:]\nRide Out My Ass That What Got My Motha F**Kin Partna Killed Man\n\n[T.I.:]\nMan You Think I Meant For That Shit To Motha F**Kin Go Down?\nDog You Think It was suppose to be Like That?\n\n[T.I.P.:]\nIt Don't Matter What The F**K You Meant To Happen Home Boy That What It Is\n\n[T.I.:]\nI Mean All In All Bra I Told You Do It My Way And That Wouldn't Had Happen\n\n[T.I.P.:]\nMan Doing It Your Way Is What Got Us Here Right Now\n\n[T.I.:]\nSo What You Saying?\n\n[T.I.P.:]\nWhat The F**K, You Heard Me Say Nigga\nYa’ll Out Here Man, All On T.V, Man Flossing With Your Hollywood\nMotha F**Kin Outfits And Shit. Bra I Ain't With This Shit Home Boy\n\n[T.I.:]\nWell F**K It Then Since You Know Every Motha F**Kin Thing\n\n[T.I.P.:]\nNah I Don't Know Everything But I Know Bullshit When I See It\n\n[T.I.:]\nMan\n\n[T.I.P.:]\nYa’ll Be Trying To Put Me On Front Of Every Motha F**Kin\nCamera Lights\n\n[T.I.:]\nThe F**K You Mean Man? What You Talking Bout?\n\n[T.I.P.:]\nAy Look You Need Me Partna Man\n\n[T.I.:]\nYou Need Me\n\n[T.I.P.:]\nIt Don't Want None Of That King Of The South Shit If It Wasn’t For Tip\n\n[T.I.:]\nMan Tip Your Ass Get Locked Up Every Chance You Get If I Let You\n\n[T.I.P.:]\nIf You Let Me? You See What The F**K I'm Saying Man?\nHow The F**K You Gonna Let Me Do Somthing?\n\n[T.I.:]\nMan, Why You Take It Like That?\n\n[T.I.P.:]\nAy Look Man I'm Sick Of You And These Other Ho Ass Rappers Out Here\nYa'll Can Kiss My Ass. You Can Tell Em I Said That. Fake Ass Niggas\n\n[T.I.:]\nMan I'm Done Talking To You.(Glass Breaks) Man, Just Go To The Next Song\nF**K It Man"}], "artist": "T.I."}