{"songs": [{"album": "DiCaprio 2", "year": "2018-10-03", "title": "Workin Out", "image": "https://images.genius.com/a24486c6e4c335d50ce79fdcf7bef5ac.1000x1000x1.jpg", "lyrics": "[Intro]\nTake your heart, don't let me break it in two\nI'm sure that I could possibly do nothin' for you\nI'm nearly on the edge, I'm bout to jump in a few\nI'm really not afraid of nothin'\n\n[Verse 1]\nLook, on everything\nI gave everything and got nothing back\nAin't looking for no pat on backs\nThat ain't how we got where the fuck we at\nMama called, \"Where the fuck you at?\"\n\"On the road, and I ain't coming back\nUntil my hundred stacks make a hundred racks\nAnd that hundred racks bring a bundle back\"\nI was blowin' gas like the Honey Badger\nJ.I.D, bitch, the money snatcher\nC'est la vie, shit I'm coming after everybody\nDon't get the bloody splatter\nI'm fly and I got my niggas fly too\nShit is like buddy passes\nI wanna cry cause I'm numb inside\nIf you wonder why, ask, \"What's the matter?\"\n\n[Chorus]\nCause I been working hella hard, shit ain't really working out\nI been praying to the Lord, shit ain't really working out\nI been looking to the stars, keep my head up in the clouds\nShit ain't really working out, shit ain't really working out\nShit ain't really working out\n\n[Interlude]\nQuiet, don't explain\nWhat is there to gain\n\n[Verse 2]\nShit, shit ain't really working out, huh\nNow I got a little bread, got my niggas working out, damn\nBaby your ass fat, I can see you working out, shit\nAnd you got a new job? Tell me, how that shit working out? Heh\nHeard you doing pretty good, yeah, people talk, word of mouth\nWasn't 'round when you had the dirty house\nNow they won't leave when you kick 'em out\nThese type of people can't stick around\nOnly down when there's liquor 'round or the spliff around\nThat's why I don't fuck with niggas now\nWell I fuck with all my niggas, you know the difference\nYou been living with tunnel vision\nYou and all of your friends are like wonder women\nWonder Woman working for it if you ever wanted something\nSearching for a purpose, I see what you on\nThe difference in how you be using your gifts\nIn the midst of the shit that you dealing with\nReally specific, you paid attention, panoramic\nYou got the vision like a fer-de-lance\nYou attack and you kill it, sinkin' your teeth with the venom\nKinda like me with these instrumentals\nOr the pen and the pencil or off the temple\nPimpin' since been pimpin', keep it sensible\nSince you winning, you a object of ridicule\nObjects appearing closer than you ready for\nObviously you don't know what's ahead\nBut that's the reason you can work 'til you dead\n\n[Chorus]\nI been working hella hard, shit ain't really working out\nI been praying to the Lord, shit ain't really working out\nI been looking to the stars, keep my head up in the clouds\nShit ain't really working out, shit ain't really working out\nShit ain't really working out\n\n[Outro: Zack Fox]\nC'mon bruh, come to the booty club one time\nThrow some of that Dreamville money\nThrow some of that Dreamville money at these hoes, bruh\nThey got dreams too, nigga\nThey got shit to do too nigga\nThey got dreams too bruh bruh\nY'all Dreamville-uh aye aye, aye aye, uh uh\nNext time you see that nigga J. Cole bruh\nYou tell that nigga the same thing man\nI fuck with y'all niggas, bro, why that nigga J. Cole\nGot all this money, look like he 'bout to\nBorrow somebody charger or something\n\"C'mon bruh, let me get your charger bruh\nLet me get my shit to uh, uh 10% percent\nAnd I'll give this shit back to you bruh bruh\"\nC'mon bruh flex some of that Dreamville money, let me see it"}], "artist": "JID"}