{"songs": [{"album": "Forest Hills Drive: Live from Fayetteville, NC", "year": "2016-01-28", "title": "Fire Squad (Live)", "image": "https://images.genius.com/6affcd514d0bc308d7761e9589cd9abc.1000x1000x1.jpg", "lyrics": "[Intro]\nHey, hey!\nHey, yeah!\nYeah yeah yeah yeah, yeah yeah yeah yeah\nYeah yeah yeah yeah, yeah yeah yeah yeah\nYeah yeah yeah, up top, hands, sing\n\n[Chorus]\nNigga why you actin' like a ho?\nKnow that I'ma ride for ya, either way it go\nTell me, girl why you be stressin' me for time?\nWhen you tell me you love me, can't you see I'm tryna climb?\nDamn my nigga why you actin' like a bitch?\nIf you scared to take a chance, how the fuck we gon' get rich?\nCome here baby why you always insecure?\nHold on tight to a nigga and be sure\n\n[Verse 1]\nAin't a way around it no more, I am the greatest\nA lotta niggas sat on the throne, I am the latest\nI am the bravest, go toe to toe with the giants\nI ain't afraid of you niggas, I'll end up fading you niggas\n'Fore it's all said and done, this nigga need medicine\nMy uzi, it weighed a ton, I need me a better gun\nIn fact I just might need two, cause niggas say they the one\nAnd I got something to prove\nForgive me lord here they come, BLAOOW\n\n[Chorus]\nNigga why you actin' like a ho?\nKnow that I'ma ride for ya, either way it go\nTell me, girl why you be stressin' me for time?\nWhen you tell me you love me, can't you see I'm tryna climb?\nDamn my nigga why you actin' like a bitch?\nIf you scared to take a chance, how the fuck we gon' get rich?\nCome here baby why you always insecure?\nHold on tight to a nigga and be sure\n\n[Verse 2]\nMy inhibition's fighting my intuition\nPremature premonition, showing me the demolition\nOf these phony niggas, so ahead of my time\nEven when I rhyme about the future I be reminiscing\nYou want the truth well come and listen\nI'm like that time you bagged a dime and checked ya phone\nAnd saw it was a number missing\nAs fate passes you by, half of you try\nThe other half of you fry, too high to actually fly\nOne day you'll have to decide, who you gon' be\nA scary nigga or a nigga that's gon' rule like me\nKeep it true like me, Cole you might be\nLike the new Ice Cube, meets the new Ice-T\nMeets 2 Live Crew, meets the new Spike Lee\nMeets Bruce like Wayne, meets Bruce like Lee\nMeets '02 Lil Wayne, in a new white tee\nMeets KD, ain't no nigga that can shoot like me!\nBLAOOOW!\n\n[Chorus]\nNigga why you actin' like a ho?\nKnow that I'ma ride for ya, either way it go\nTell me, girl why you be stressin' me for time?\nWhen you tell me you love me, can't you see I'm tryna climb?\nDamn my nigga why you actin' like a bitch?\nIf you scared to take a chance, how the fuck we gon' get rich?\nCome here baby why you always insecure?\nHold on tight to a nigga and be sure\n\n[Bridge]\nWho's the king?\nCame from the bottom nigga, with stains on my shirt\nWhat you expected from me, I came from the dirt\n(Who's the king?)\nMoney my motivator, the songs that I sing\nPicture a peasant passin' from pawn to a king\nYou tell me ya still love me, if so then let me go\nWill I return or will I burn, never know\nLook in my eyes and see the future\nBut don't sugar coat it\n\n[Verse 3]\nListen...\nHistory repeats itself and that's just how it goes\nSame way that these rappers always bite each others flows\nSame thing that my nigga Elvis did with Rock n Roll\nJustin Timberlake, Eminem and then Macklemore\nWhile silly niggas argue over who gon' snatch the crown\nLook around, my nigga, white people have snatched the sound\nThis year I’ll prolly go to the awards dappered down\nWatch Iggy lose the Grammy as a nigga crack a smile\nI'm just playin', but all good jokes contain true shit\nSame rope you climb up on, they'll hang you with\nBut not Jermaine, my aim too sick\nI bang nigga, I came to bring the pain my brain too quick\nYou see how I maneuver this game, I ain't stupid\nI recognize that life is a dream, and I dream lucid\nAnd break the chains and change minds\nOne verse at a time, and claim 2-6\nAnd fuck it, if the shoe fits, who's the king?"}], "artist": "J. Cole"}