{"artist": "Kodak Black", "songs": [{"image": "https://i.genius.com/3941e86de29bdcae016880005b231918b972fe2e?url=https%3A%2F%2Fstatic1.squarespace.com%2Fstatic%2F5533ecbfe4b03cb74b7d2d5e%2F55341c54e4b0cb1542aca8f9%2F577f27da5016e1cada2a7c2b%2F1468553047752%2FHeart-of-the-Projects-by-Kodak-Black.jpg%3Fformat%3D2500w", "title": "Benji’s", "year": "2014-12-30", "album": "Heart Of The Projects", "lyrics": "[Chorus]\nI'm about to go and see the dentist (\"diamonds! diamonds!\")\nBout to go out lurkin’ for them benji’s (\"hunnids! hunnids!\")\nIn the jag, I’m splurging on you bitches (\"skrr, skrr, skrr!\")\nFuck a paragraph, they gave my dawg a sentence\nTold her mind your fucking business (\"mind your damn business!\")\nHe don't know his bitch is in here trickin’\nI’ve been catchin’ flights, ain’t catching feelings (\"No, No, No!\")\nI pass her the molly, made her lick it\n\n[Verse 1: Kodak Black]\nI told that bitch I really really want her\nI-It took me so long to get her number (\"so much time\")\nI told her please be with me, Imma cuff her (\"please be mine\")\nI got her I just fucked her then I dumped her (\"I fucking lied\")\nI'm the shit, call the motherfuckin’ plumber\nI'm a motherfucker, I will fuck yo momma\n40 on me, I ain't got no time to rumble\nA-all these pieces I can make my own puzzle\n\nI’m from 18th street, I blow you like a bubble (\"I will blow you up\")\nI don’t take no shit, I get that from my momma\nI won’t take your shit, I get that from the struggle\nHit that bitch and kicked her out, cause I don’t cut up\n\n[Chorus]\nI'm about to go and see the dentist (\"diamonds! diamonds!\")\nBout to go out lurkin’ for them benji’s (\"hunnids! hunnids!\")\nIn the jag, I’m splurging on you bitches (\"skrr, skrr, skrr!\")\nFuck a paragraph, they gave my dawg a sentence\nTold her mind your fucking business (\"mind your damn business!\")\nHe don't know his bitch is in here trickin’\nI’ve been catchin’ flights, ain’t catching feelings (\"No, No, No!\")\nI pass her the molly, made her lick it\n\n[Verse 2: Kodak Black]\nH-Homerun, I knocked it out the park (“Swing, Batter-Batter!”)\nI left the deck, I hit the front like Rosa Parks\nI won’t catch no feelings, I’d rather catch a charge\nI ain’t goin’ home, I be goin’ hard\nI told her go home, I kicked her out my car\nI love my down for, them junkies go bizarre\nPolo on me, horses jumpin out the barn (Yeehaw!)\nPromise I ain’t never slippin', I am armed (“No, not I”)\nI took his pot of gold, I got the lucky charm (\"I’m a leprechaun!\")\nI pull up she say hey I feel like Arnold! (\"Hey! Arnold”)\nDiamonds on my watch, they look like marbles (ooh they glistenin’!)\nYou a character, I call you marvel\n\n[Chorus]\nI'm about to go and see the dentist (\"diamonds! diamonds!\")\nBout to go out lurkin’ for them benji’s (hunnids! hunnids!)\nIn the jag, I’m splurging on you bitches (\"skrr, skrr, skrr!\")\nFuck a paragraph, they gave my dawg a sentence\nTold her mind your fucking business (\"mind your damn business!\")\nHe don't know his bitch is in here trickin’\nI’ve been catchin’ flights, ain’t catching feelings (\"No, No, No!\")\nI pass her the molly, made her lick it\n\n[(\"Turn up, 'fore you burn up!\")]"}]}