{"artist": "Cam’ron", "songs": [{"title": "Bottom of the Pussy", "album": "Crime Pays", "year": "2009-05-12", "image": "https://images.genius.com/92496cfcc2e09bf599c5704239d3db57.1000x1000x1.jpg", "lyrics": "[Hook]\nYo I hit the bottom of her pussy yall\nYo, I hit the bottom of her pussy yall\nNope I ain't talking bout her pussy walls\nYo, I hit the bottom of her pussy yall\n\n[Verse 1]\nYo I be lying, denying that theres a pimp in me\nBut I apologize sorry you have my sympathy\nWhen I hit that spot why you ain't tell me nothing\nI swear to god yo, I thought it was your belly button\nNope, it was the bottom of your pussy hole\nHer legs was shaking like she's trying to do the tootsie roll\nWe make the sweetest merger, should I keep or curve her\nThe sex agreed its murder, plus she's a squirter\nYeah baby girl drenched the bed\nSprinkler system, right on my expensive spread\nBut she made it up, gave me extensive head\nIntensive, mention her man it don't make sense he's dead\nPlus I like her cuz mami made me say mama mia\nPlus she PYP, right Condoleezza\nI george bushed her what she don't know what ima teach her\nIm her teacher she's a libra, leave her nope ima keep her\n\n[Hook]\n\n[Verse 2]\nNow I ain't seen her in two weeks, that's the wire\nNow she sending threats saying that my ass a liar\nWhen she see me she gon set my ass on fire\nCame out the crib, got damn she slashed the tires\nKeep it up ma, I'll call your mother\nShe said I already did, why don't you call my brother\nAnd tell him what \"you hit the bottom of my pussy ho\"\nAnd you is a bitch nigga, faggot ass, pussy ho\nI said your brother don't want to know how his sister is\nAnd with that same mouth you go home and kiss your kids\nBut lets shift gears, its maybe you, its maybe me\nMaybe, \"buts whats wrong baby?\"\nBaby said \"don't baby me.\"\nOh don't baby you?\nYou acting shady boo?\nThat ain't the way we do shit, im on my way to you\nAnd you gotta love it, when I got there she start to touch it\nAnd the pussy hole I hit the bottom of it\n\n[Hook]"}]}