{"artist": "Andre Nickatina", "songs": [{"title": "Raven", "album": "Raven in My Eyes ", "year": "1998-06-23", "image": "https://images.genius.com/7e1daec351ffc7c86dc485eebe9de835.220x220x1.jpg", "lyrics": "You know god, the devil is acting a mother fucking fool\n\nWell yes, watch out for those buster\nBusters and you never can trust them\nSooner or later gotta me a hafta dump them in the ocean\nAnd them them girls around them we gonna get rid of them, second\nWatch that four blown, gage on time (tragic, tragic, tragic, tragic)\nAnd you know that cinnnomon bread that you didn't want to give me?\nSo when me get down, me bring my rotwilder round\nAnd make them shake that thang\n\nThe raven in my eyes got me going against the grain\nIf you purple like the rain\nFeel me nigga now check the grip, Get rich quick or die\nSome can't get rich so god damn quick, so they suffer and get high\nGod fearin niggas, who sin and make they ends\nCorner store ballas who can't think without they gin\nMandadory consequence if you spit this busnuiss splittin rocks\nBullets connect with red dots, shit this ghetto red hot\nA vision like twelve monkeys, split the blunt and fill her up\nWe ready to cuss and dump on niggas who wanna buss\nSpittin 45 and newer nines mindstate on barrcudda\nNigga watch the heat cuz the heat will seek and the heat will go right through ya\nMy mouth a make an attitude and hall game\nStreet chemist ghetto star dealin with the pain\nThey say \"Andre Nickatina keep it comin\"\nThe game done got so thick that I can't even have a woman\nLet me look into your eyes, witness all the lies\nSomewhere down the line you made a grown man cry, why?\n\nRaven in my eyes put a man to test\nMan not bullet proof, man be made of flesh\nYou know me keep on singing\nThe raven in my eyes put a man to test\nAnd I say\nMan not bullet proof, man be made of flesh\nYou know me keep on sayin\nA raven in my life put a man to test\nAnd you know me sayin\nMan not bullet proof, man be made of flesh\n\nB. Adams do ya still love me?\nCuz your first born is struggeling (tragic tragic tragic)\nAnd its hard to stay drug free, mama do you love me?\nX2"}]}