{"songs": [{"album": "Blacklight", "image": "https://images.genius.com/7024230a664e26c9a3b0c4fc89609ef5.1000x1000x1.jpg", "year": "2011-05-30", "title": "Bravo", "lyrics": "Two... Ladies and gentlemen put your hands together please\n\nYeah, two claps as I applaud every saint who goin' hard\nCatching heat; refusing to live discreet for the Lord\nYeah, and this the life, there ain't nothing better\nEven in the trial and the error this the best thing ever\nWouldn't trade it for the world\nThat's how you lose your soul so I'm lettin' go of everything\nTryin' to take hold of abundant living whether in the streets or prison\nHappiness forever and today, that's a given\n\nAnd you need it for when times get hard\nOh Lord, people comin' sideways like my car\nYep, sittin' on chrome as if it was a throne\nMakin' judgements from afar; doubleminded; two-toned\nBut in the moment baby that's where He is strong\nYou're powered by His power so you can keep movin' on\nSo this is for the saint who feels defeated by the hater\nThey come because of Him, but in Him you can take it\n\nThey want me to fail but I can't do that\nSometimes it gets hard, I already knew that\nBravo! (Bravo!) [x4]\nCan I get a round of applause for the haters?\nThey can talk down but they won't ever shake us\nBravo! (Bravo!) [x4]\n\nEmbrace when them hate me, I already knew that\nYep, them fate, no escape, unless He do that\nSo two hands together for the ones who never let up\nHe said that it would happen so you can expect the pressure\nHe told us it would come, only a matter of time\nAnd it's something I expected even after He died\nPeople turned away from the One who can give them real life\nRealize it's the truth, that's the reason they despise\n\nMan it's [?], the fact that you chose to become a Christian\nThe Gospel is offensive, hard hearts barely choose forgiveness\nAnd if they hated Him, what makes you any different?\nIt doesn't; man I pray to God that you listen\nCount it all joy when the persecution comes\nCelebrate, it's the proof that to Him you belong\nSay He wrong, but it's truth, the Scripture said it's right\nNone above the Master, hey they gon' hate you if they hated CHRIST\n\nThey want me to fail but I can't do that\nSometimes it gets hard, I already knew that\nBravo! (Bravo!) [x4]\nCan I get a round of applause for the haters?\nThey can talk down but they won't ever shake us\nBravo! (Bravo!) [x4]\n\nClap clap, bravo; clap clap, bravo\nThis is for the people in the pain and the sorrow\nClap clap, bravo; clap clap, bravo\nThis is for the haters who hate us 'cause who we follow\nClap clap, bravo; clap clap, bravo\nThis is for the people in the pain and the sorrow\nClap clap, bravo; clap clap, bravo\nThis is for the haters who hate us 'cause who we follow\n\nThey want me to fail but I can't do that\nSometimes it gets hard, I already knew that\nBravo! (Bravo!) [x4]\nCan I get a round of applause for the haters?\nThey can talk down but they won't ever shake us\nBravo! (Bravo!) [x4]"}], "artist": "Tedashii"}