{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f5e81e5d5f74cbb217e8988eb2ac58e7.400x400x1.jpg", "title": "Gorilla Pimpin’ (Ghetto Extraordinary)", "year": "2008-01-04", "album": "Ghetto Extraordinary", "lyrics": "[HOOK 2x]\nI'm so pimpish that I'm damn near gorilla, baby\nI'm the coldest of the cold, do ya feel me baby\nGhetto Extraordinary, do ya hear me baby\nOH, OH WOW!   OH, OH WOW!\n\n[VERSE 1 - MJG]\nThey call me M.J. Fuckin G. \"Pimp Tyte\", ridin in the Cadillac\nWith 3 women on the passenger side/\nAnd in the back of the ride/\nI gotta pump, witta trunk full of ammo, nigga wanna act \" Rambo\"/\nImma slip into the ski mask,get in the old school, young nigga I am no/\nRookie. Way way back when you were buyin those 1's & cookies/\nI was already deep in the pimp shit, Hoe work out for that, the Bitch break that nookie/\nImma show you where to take that pussy, but ya gotta choose me don't push me/\nAWAAAYY!!! On the top of the \"Pimp Shit\" list, you can put me/\nImma represent Memphis 10, Orange Mound, Dirty south/\nDon't sit there & run yo mouth, get up off of that dirty couch/\nI gotta hoe that can go & get another hoe, tell the hoe to holla at my other hoe/\nWhen you get her on the phone, tell the hoe to tell my Bitch to bring my shit/\nNever did I need no practice, Ghetto Extraordinary the mack shit/\nI'm strapped I'mma keep 5 guns in the house, 5 mo' up under the mattress/\nGorilla pimpin', poke & leave, physically I'm chokin mics/\nI'mma cut the music off & call this shit ?????\n\n[HOOK 1x]\n\n[VERSE 2 - KILLER MIKE]\nKilla Kill is that ya Bitch? Na young pimpin that's my hoe/\nYou breakin bread for the head she'll hop right out that cadillac do' /\nWhen I met her she was workin clubs,workin the poles, workin her monkey/\nI showed her how to twerk in a skirt, hit that strip, get my money/\nI walk witta super limp, super pimp got SUPER HOES/\nMight see me wit Superhead gettin super bread at the Super Bowl/\nMight see me at the Pro Bowl witta pro hoe, With a pro hoe?/\nOn a Tahoe witta tall hoe, witta pussy bout as big as a pot hole/\nI am no, boy I ain't no chump, no simp, no muthafuckin' sucka/\nTeach any broke bitch how to make a pimp rich, usin' her dick sucka/\nCuz I'm the shit muhfucka, thats right young Mikey, so icey/\nWhite tees, white Nike's & a bad white bitch like ice T/\nA fat black, born to mack, body built like a cadillac/\nUntil the day my casket close, I will slam them candy do's/\nBreak a trick & pimp a hoe, drank mo' .  80's Steak & Shrimp/\nKing Kong standin strong, baby I gorilla pimp/\n\n[HOOK 1x]\n\n[VERSE 3 - 8BALL]\n\n[HOOK UNTIL FADE]"}]}