{"songs": [{"title": "Need a Best Friend", "album": "Hoodie SZN", "year": "2018-12-21", "image": "https://images.genius.com/557f4ca436aaabc4210bd3850f96b954.1000x1000x1.jpg", "lyrics": "[Intro]\nWhoa Kenny\n\n[Verse 1: A Boogie wit da Hoodie]\nIn the jungle with my feet up, lookin' like King Caesar\nI got my felonies up, I had the wrong demeanor\nI got sick of fake love, I started sippin' lean up\nThey get scared and turn blood and tell you different reasons\nAnd I don't wanna make love with you to beat my meat up\nYou wanna be my main slut, you gotta eat up, eat up\nYou wanna be my sweet love but you is not Anita\nI feel like I'm a baker, always got my heater\nYeah, that's your best friend (Yeah)\nShe told you that I bought all Hermès shit, yeah\nMmh, that's your best friend\nI might as well just fuck you both, you're best friends\nMmh, yeah, you know you love me, bitch\nAnd you know I love it when you start doin' that slutty shit, yeah\nFuck you so good, I should just start sellin' dick, yeah\nI'm only 22, I just started havin' fun with it, yeah yeah, ayy\nTellin' me I'm so humble now, I'm so done with it, yeah yeah, ayy\nI been thuggin' on AP, you suckin' dick, yeah yeah, ayy\nYeah I'm up now but I miss bein' on the block, yeah yeah\nWill you be my best friend, girl? Yeah or nah? Yeah yeah\n\n[Chorus: Lil Quee]\nHey, 'cause I need a best friend, uh\nPlay the block like Tetris, uh\nYeah, I'm sorry to be selfish\nBaby girl, it was worth it\nYeah, 'cause I need a best friend, uh\nPlay the block like Tetris, uh\nYeah, I'm sorry to be selfish\nBaby girl, it was worth it\n\n[Verse 2: Quando Rondo]\nEvery nigga in your clique, yeah they gon' feel me\nIf I ever cheated on you, would you still leave?\nNo impersonatin' nigga, this the real me\nConvicted felon, but that pistol, yeah, I still keep\nI really came up from the bottom, they didn't believe us\nAnd I can't show that ho respect because you not Aretha\nI swear I came up from the 'partments, runnin' with that nina\nI'm pourin' all this Hi-Tech inside an Aquafina\nAnd ever since I got a check I feel like I don't need 'em\nI got my mind on that Corvette, see I don't want the Nissan\nNo I don't fuck 'round with these niggas 'cause they really peons\nI'm drippin' sauce, that's on the daily, this that brand new VLONE\nI'm only human, so baby, no I ain't perfect\nFifteen hundred on Jimmy Choos, you deserve it\nI'm only human, so baby, no I ain't perfect\nFifteen hundred on Jimmy Choos, you deserve it\nAnd if I cheat I know that you gon' close the curtains\n24 hours, that's out the week, yeah, we were certain\n\"Do you love me, Quando?\" That be that girl's favorite question\nI reply with, \"I love you,\" 'cause I really need a best friend\n\n[Chorus: Lil Quee]\nHey, 'cause I need a best friend, uh\nPlay the block like Tetris, uh\nYeah, I'm sorry to be selfish\nBaby girl, it was worth it\nYeah, 'cause I need a best friend, uh\nPlay the block like Tetris, uh\nYeah, I'm sorry to be selfish\nBaby girl, it was worth it\n\n[Outro: Lil Quee & A Boogie wit da Hoodie]\nHey, 'cause I need a best friend, uh\nPlay the block like Tetris, uh\nHey, 'cause I need a best friend, uh\nBaby girl, it was worth it\nHey, 'cause I need a best friend, uh\nPlay the block like Tetris, uh\nHey, 'cause I need a best friend, uh\nWill you be my best friend, girl? Yeah or nah? Yeah yeah"}], "artist": "A Boogie Wit da Hoodie"}