{"artist": "C-Rayz Walz", "songs": [{"title": "Paradise (The Beatnikz Remix)", "album": "Year of The Beatnikz", "year": "2005-05-11", "image": "https://images.genius.com/7831f8f52321349fa4de48c10b092b4c.624x624x1.jpg", "lyrics": "C-Rayz Walz - “Paradise (The Beatnikz Remix)”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): The Beatnikz (Frank Blank and Lil Jay)]\n[Sample: [?] - “[?]”]\n\n[Hook 1: Sample: [?] - “[?]”] (x2)\nLiving in a paradise\nYou’re living in a paradise\n\n[Bridge 1 (Overlapped with Hook 1): C-Rayz Walz]\nI command you to riot and overthrow your\nMind\n\n[Hook 1 (Overlapped with Hook 2): Sample: [?] - “[?]”] (x4)\nLiving in a paradise\nYou’re living in a paradise\n\n[Hook 2 (Overlapped with Hook 1): C-Rayz Walz] (x4)\nKeep it\nMoving.  You could hold it down when you\nKnow and control the sounds\n\n[Verse 1: C-Rayz Walz]\nI’m the\nAmerican Dream in action, the veterans of steam\nThe fractioned piece of forbidden holiness recaptured\nWatch news columns combine, blow your mind at nine.  Read\nThe signs, or should I say this forty-one times?  Rush\nThe floors.  Dope before?  You can’t get out the train and y’all\nCan’t out the box.  Yo, get in.  You train.  Do not\nHold doors, do not lean on walls/Walz, do not\nPee on floors.  This is beyond war.  We are\nPeon pawns, Red-neon Dawns.  Watch\nThe Bushes—Patriot games get prolonged.  Snakes\nSuper-sperming, aim, shoot the vermin.  Ch-ch-\n-ch-ch.  Is it burning?  Well, see, now you’re learning.  And don’t\nThink that your gun could protect your girl.  This is\nNew York Hell.  This affects the world.  Para-\n-dise, green grass, meditation, calm breeze, fresh\nFruits, veggies, clean mountain valley streams.  I mean\nCheckers are chess, truth is the square root of life\nProof is the beats eats when reality bites.  Pan-\n-dora’s Box, Radio Raheem's battery charged.  I'll Lean\nBack like Pisa to the dark side of the dart.  The speech\nIs salt—it sucks hearing leeches talk.  Think it’s\nThe force?  We in Mordor—police is the orcs.  Walking\nCerebus with the Raising Hell t-shirt.  Crackheads\nGet locked up for stem cell research\n\n[Hook 1: Sample: [?] - “[?]”] (x2)\nLiving in a paradise\nYou’re living in a paradise\n\n[Bridge 2 (Overlapped with Hook 1): C-Rayz Walz]\nYou’re in-\n-volved with something beyond your comprehension\nThe real millennium X-Files, daily conditions\n\n[Hook 1: Sample: [?] - “[?]”] (x2)\nLiving in a paradise\nYou’re living in a paradise\n\n[Bridge 3 (Overlapped with Hook 1): C-Rayz Walz]\nSecret missions caught in the middle of conspiracy and\nEspionage.  Go against all odds\n\n[Verse 2: C-Rayz Walz]\nParadise.  My pupils travel like the old priest, and I’m told\nWe need bullet holes like police need more heat (We’re living in)\nParadise.  Psalms in your palm like a pair of dice\nYou could peep Christ if you pay the passion of the price (To get in)\nParadise.  Perhaps, through perception, you’ll get a percentage of\nPower prophesized in points of progression (Within)\nParadise.  Don’t plagiarize, premeditate your position\nFuck props, prosecute Pulp Fiction.  Perse-\n-cuted poison from the pulpit proving the\nRich lie.  The poor procrastinate, die, and make excuses\nProphets past prime pick pockets and\nPractice pointing pistols at feces with plans to pop shit (This paradox)\nGive you the poetic premonitions of Pac\nPreaching to P.O.W.s in prison with props (Paradise)\nTake it back to the block when creativity was god\nEverybody wasn’t chasing the dollars, scared of jihad (The paradox)\nIt ain’t the church, the mosque, zen, or the temple or shrine\nCathedral or the synagogue—nah.  It’s just\nThe one sentiment that’s in us all: hate.  Confu-\n-sion an act of being unaware and stuck in the fog, but this ain’t\nMission from Mars.  This more like Walz spitting these\nBars to ensure my position tomorrow.  Digital\nBible rap prophecy, watchtower mockery.  I mean\nYour mind’s been molested sloppily.  I got a\nBomb in my beeper, a laser in my sneaker\nRadiation reapers, students kidnap the teachers, but there’s\nCameras in the bleachers, police dogs with six heads\nTwelve grenades in my dozen of eggs.  Trying\nTo stop the plague before it spreads, striving not\nTo fall off ‘cause I know I know I Know the Ledge.  Allegiance\nTo my soldiers what I truly pledge.  Like babies after\nSix bottles, with this, I’m truly fed.  I checked\nThe weather: the forecast is pollution.  My reso-\n-lution—(What?)—some radiation suit shit.  They’re intro-\n-ducing teen execution by the Constitution\nConfusion’s the illusion, so I think straight\nWhether using my hood to duck toxic waste, I got this\nCase but I ain’t trying to see the judge.  I got this\nWound.  I feel the heat but I ain’t trying to see the blood.  Still got this\nHeart but I ain’t fitting to bleed love.  I see the\nPlug but I can’t pull that shit out (And you)\n(Know who control the sound).  (Can’t get out) Too much ex-\n-cuses.  They’re bringing back the nooses.  With no\nStrings attached, chemical-drug-abusing pass crack\nUsing NASDAQ to kill black, brown, yellow, and white\nThe A-Alike fight vs. Illuminite might.  Para-\n-dise.  Seeing buildings crumble, the Towers\nBabel, manifest the meaning in the mumbles\n\n[Hook 1: Sample: [?] - “[?]”] (x2)\nLiving in a paradise\nYou’re living in a paradise\n\n[Bridge 4 (Overlapped with Hook 1): C-Rayz Walz]\nYou’re in-\n-volved with something beyond your comprehension\nThe real millennium X-Files, daily conditions\n\n[Hook 1: Sample: [?] - “[?]”] (x2)\nLiving in a paradise\nYou’re living in a paradise\n\n[Bridge 5 (Overlapped with Hook 1): C-Rayz Walz]\nSecret missions caught in the middle of conspiracy and\nEspionage.  Go against all odds\n\n[Hook 1: Sample: [?] - “[?]”] (x2)\nLiving in a paradise\nYou’re living in a paradise\n\n[Hook 2 (Overlapped with Hook 1): C-Rayz Walz] (x2)\nKeep it\nMoving.  You could hold it down when you\nKnow and control the sounds"}]}