{"songs": [{"album": "Cam’Ron Presents DukeDaGod - DipSet: The Movement Moves On", "year": null, "title": "Getting Money", "image": "https://images.genius.com/ab7fbc8260d362511ebef8206fd74571.300x300x1.jpg", "lyrics": "[HOOK]\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\n\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\n\n[J.R. Writer]\nThat's word buzzen, I swerve cousin (errr!)\nIn that 2006 like it's worth nothing\nGot these bird's bugging, I'm on 1st stunting\nWith no stick-shift just a reverse button (the Aston Martin)\nBut I ain't Hollywood hater, I'm still serving them like a Volleyball player\nSpare 8 keys, the gear chase me\nYou need two? Meet me in Staircase B\nI'm pitching em, you ain't never seen hard\nYou little creeps starved, you niggas need jobs\nI do this steam large, bottles after bottles...\nThen dismiss the case like a judge on a weak charge\nPeep .R....scrapper this shit is nothing\nYou actors are into cuffing, these scragglers are disgusting\nAsk 'em all how I'm bubbling...\nI spray more Alcohol around then a barber after he finished cutting!\n\n[HOOK]\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\nWE GETTING MONEY OVER HERE....WHAT IT DO PIMPIN?\n\n[40 Cal.]\nI...GET MONEY, GET MOOGA\nGET MONEY, GET MOOGA\nGET MONEY GET MONEY GET MOOGA......40!\nI...dress gully, vest with the fresh skully\nLex buggy, no cologne cause I'm smellin like fresh money\nYou better tell thunny you never will sell bunkies\nYou can't hold nothing but shells that dwell from me\nProlly go to jail, praying like HELP dummy\nWhile I'm diddy bopping out, waving like jail funny\nI get locked up by twelve, say around 12:20\nCall me Slater & Screech, get Saved By The Bell money\nThen I ice grill the judge cause it just felt gully\nLeave an ape nigga bloody s'what I call a \"Red Monkey\"\nYeah....the champion cheering, man of the year when...\nI go to the store copping what the mannequin wearing!\nServing grams to ya parents, I get the ounce flippin\nI admit....I'm the reason the shit in ya house missing!\nI'm in ya spouse kitchen, making other figures\nWith dick in her mouth like Killa, \"I'm getting money niggaaaaa!\"\n\n[HOOK] - 2X\n\n[J.R. Writer]\nYa shines are simple, mine's offend you / (heh!)\nYours \"bling bling\"....my shit dingles! (ding!)\nYou don't know the grind I'm into, check the rose I floss\nYeah I put 'em on but the shit's keep going off\nI'm glistening gold, wrissery froze\nBoogers all in my ring and I ain't digging my nose\nToo much digits to fold, what I'm spending is old\nBut I still will mack a chick and tell a pigeon like \"YO!\" /....WE GETTING MONEY OVER HERE!\nFix ya face ho, why? cause I say so\nWhat part don't you understand? I'm getting peso's\nThey know not to stunt on me with some liquor\nI'll buy out the bar just for me and my niggas\nNobody drinks, look fam that's the crew\nI'll have the whole club sipping Cranberry juice (sober lmaoo)\nYou hungry in the rear, my money in the air\nI don't know what y'all doing over there, but look......WE GETTING MONEY OVER HERE!\n\n[HOOK]"}], "artist": "J.R. Writer"}