{"songs": [{"image": "https://images.genius.com/6tetlmlkzc3lziitg3f9dor0u.500x500x1.jpg", "year": "2009-07-24", "title": "A.D.D", "album": "Everybody’s Nobody", "lyrics": "Intro:\nOne day the world will stop moving, but we don't abide by rules\nAnd everything that we're doing, they told us that we couldn't do\nEveryone said I was different, than all the only kids at school\nI never really could pay attention; all I did was just move\n\n[Verse 1:]\nEighties baby, millennium\nMy dunks is crazy but never made the team\nIt's never what it seems like you never wore jeans\nAnd I never ran track but I chase my dreams\nSo, you should do like so\nLuckily I had a bright light bulb\nAn MP3, my whole CD so they jumped on stream on my tight flow\nFly boy, flight control, that boy's tight, hello\nBorn in July so I'm shooting for the sky and I might get mad if I don't blow\nSo, if I don't hear the thing when I bowl this\nI'll come out the gutter more focused\nEyes on the pens when I wrote this\nAnd I don't know if you noticed but\n\n[Hook:]\nWe won't stop like we got A.D.D. (x3)\nWe won't stop because we can't stop, nah\nWe won't stop like we got A.D.D. (x3)\nWe won't stop because we can't stop\nSo move, so move, so move (like you got A.D.D.) (x4)\n\n[Verse 2:]\nThis my stop let me get off\nTell them other boys they can get lost\nI don't give a damn if they roll with Peter Pan\nMan them colors ain't been fly since criss-cross\nI'm in the Mid where the bids don't look (look)\nWhere the kid gets booked\nI'm on a plane with a dame that wanna join the fly-high club\nTell the kids don't look (ha)\nThey tried to say that he won't blow (why)\nCause I'm a nerd but she don't know\nUntil she come to my home and get on her knees (and what)\nAnd play with G.I. Joes\nCause I'm a nice guy in some mean ass clothes\nAnd flow so cold even freon froze\nSho nuff' I got a Leon flow\nSo you gotta say yes if you don't know, now\n\n[Hook]\n\n[VERSE 3:]\n\nLook, I know you ain't used to me\nAnd I know what I used to be\nAnd I know that we just met\nBut baby girl would you move with me?\nI mean truthfully, I mean usually\nI mean actually, I just happened to be\nJust writing to waste time and I happened to see\nThat all the words rhymed so naturally\nSo naturally, honey actually\nIt was rapping to me without rapping to beats\nEverybody got a story that's what happened to me\nAnd the very next day I was sagging my jeans\nI felt cool, they was laughing at me\nHad a veelie skullie and like half of my teeth\nThings got ugly when my mom said honey\nYou trying to be a rapper I ain't happy to see\nBut I promise Ms. Lagranze, I'mma prove to you if I can\nThat this is all gonna pay out in the end\nAnd we gon play this loud in the Benz\nTryna lay up in the hills when I'm paid\nWith a girl named Beverly house is a maze\nOn the beaches kept chair raised\nSitting back, nigga, when I begged for a raise\nMaybe I'll get a girlfriend\nOr maybe it's too soon\nMaybe she'll think I'm cool\nCome over and we can spoon\nBut I never get comfortable\nCause I always gotta leave\nAnd it's hard to keep my attention\nCause they say I got A.D.D. but\n\n[Hook]"}], "artist": "XV"}