{"songs": [{"image": "https://images.genius.com/91da51c7ed14c805c492a0346f54d465.1000x1000x1.jpg", "title": "Highly Favored", "album": "The Lost Tapes 2", "year": "2019-07-19", "lyrics": "[Verse 1]\nPatient\nMy faith is highly favored by the father, love to all\nRest in peace to Zanu, the barber brought cases\nCelebrate and take us back to thought\nThe real New York, death to rapists and rats\nThe touch school to Brooklyn stories\nThe kings, the lifers, the lords of Queens\nOr the stories on Puerto Rican righteous, I heard things\nKnow some people who know people\nGetting money, the broke people claim you owe some people\nIt's easy to explain anything to a real liver of life\nWho live where you live and see shit the same\nGotta watch who you joke with or get checked\nWe easily mistake jokes for disrespect\nWhere I'm from, it's never over if somebody dies\nSomebody gon' ride, years later, somebody son, double 4-5\nYou laid up in ICU, hoping you survive\nToo many stories like this one\n\n[Chorus]\nWhat's shaking?\nMy faith is highly favored by the father, peace to all (Peace to all, yeah)\nPatience\nMy faith is highly favored by the father, peace to 'yall (Peace to y'all, yeah)\nWhat's shaking?\nMy faith is highly favored by the father, peace to all (Peace to all, yeah)\nWhat's shaking?\nWhat's shaking?\n\n[Verse 2]\nUh, yeah\nSome are caricatures, amateur boys\nI'm like a classic pianist with a handful of sores\nBandages on my finger, still managing chords\nLike a live band, performing in a sand storm\nBlind, but I still hit the right keys\nSwift as a life breeze, dripping\nIn fear of God, scented in Diptyque fragrance\nSome nights Creed flavors, I am motivation\nI don't talk on the next man, I am never hating\nThis daily bread, holy bread\nAlphabetical numerals, codes of red\nWhat's more dense, gold or lead?\nWhat's more expensive?\nThe OG said, \"No matter what it is, rent it\nAnd never buy it, it's all temporary possessions\nWe don't own nothing on this Earth but our soul and that's the lesson\"\nProject apartment parties, rest in peace to Marley\nTry not to get booked by Officer Laverty\n\n[Chorus]\nWhat's shaking?\nMy faith is highly favored by the father, peace to all (Peace to all, yeah)\nPatience\nMy faith is highly favored by the father, peace to y'all (Peace to y'all, yeah)\nWhat's shaking?\nMy faith is highly favored by the father, peace to all (Peace to all, yeah)\nWhat's shaking?\nWhat's shaking?"}], "artist": "Nas"}