{"artist": "Booba", "songs": [{"album": "Futur 2.0", "title": "A.C. Milan", "year": "2013-11-25", "lyrics": "[Couplet 1]\nPour eux y'a plus d’espoir, rouge-noir\nKopp A.C. Milan, j'fais le bilan\nPlus violent qu'du MMA\nQu’une double frappe de Benzema\nTu croyais quoi, me baiser moi ?\nJ’suis dans l'tur-fu, oublie-moi\nMais qui es-tu ? N’intéresses personne\nNi LCI, ni Neuf-Deux-Izi\nPersonne te respecte ici\nJ'te l'dis, j'te l'redis\nJ’ai une bad bitch sur ma bite'zère\nDe vendredi à vendredi, si-si\nM’attaquer, vous n’auriez jamais dû\nDétrôner le Duc restera du jamais vu\nQui vous met en hass ? Grand Sénégalais au sexe long\nR.O.H.2fesses, tu n'peux braquer qu'ton petit frelon\nJ’attaque quand tu ne m’attends pas\nMi-homme, mi-attentat\nTLF ton O.V.N.I. crame\nChez nous personne vous aime, ni homme ni femme\nVous n'vendez aucun disque, ne bicravez pas d'milligrammes\nVos lyrics se résument à \"pouèt pouèt, prout prout, bam bilibam\"\nBienvenue en 2013, Kopp A.C. Milan, j'fais le bilan\nJ'suis venu mettre les tibias sur les \"i\", craint comme l'Iran\n\n[Refrain]\nChez nous on fait ça bien, tu sauras pas d'où ça vient\nMissile, boloss, anti-aérien : cela ne mène à rien\nIl n'en restera qu'un, il n'en restera qu'un\nIl n'en restera qu'un, négro il n'en restera qu'un à la fin\nIzi, izi, biff, izi, izi, biff hé\nIl n'en restera qu'un\nIzi, izi, beef, izi, izi, beef\n\n[Couplet 2]\nIls ont insulté ma mère, elle qui a tant souffert\nJe n'leur pardonnerai jamais, même quand ils seront six pieds sous terre\nMoi j'suis frais, j'suis rezefaitzait jusqu'à la fin du siècle\nEt les vrais négros le savent bien, donc eux, ils ne savent rien\nRafale en Kawasaki, eux n'feront nada, klaoui\nBienvenue sur Tataouine, vous êtes à sec, clique Sahraoui\nOui oui, je win win, tu refuses de monter sur l'ring ring\nNi couilles, ni bling-bling\nOn t'fait les poches, ça ne fait que \"gling-gling\"\nFFHOR, t'es grave en chien, comme Émile Louis Laounizi\nLe premier rappeur pointeur, double Uzi pour mes ennemis\nIkbal t'étais au habs, tu m'envoyais des paquets d'pâtes\nAujourd'hui tu parles mal, wallaye bilaye ne t'inquiète pas\nIl parle français, dit de la merde, peut-on dire qu'il est bilingue ?\nEn tout cas il est vilain, oh mon Dieu, qu'il est vilain\nÇa joue les criminels, ça braque des foufounes : oh non !\nLa Fouine n'as-tu pas honte ? Agression sexuelle sur enfant\nLe savoir est une arme, j'suis calibré, j'lis pas d'bouquin\nJ'ai des pics sur le cœur comme sur une paire de Louboutin\nSi le rap n'était que vous deux, il n'serait vraiment qu'une grosse putain\nPas d'diplôme, mais j'suis heureux, fuck les zéros sur mon bulletin\n\n[Refrain]\nChez nous on fait ça bien, tu sauras pas d'où ça vient\nMissile, boloss, anti-aérien : cela ne mène à rien\nIl n'en restera qu'un, il n'en restera qu'un\nIl n'en restera qu'un, négro il n'en restera qu'un à la fin\nIzi, izi, biff, izi, izi, biff hé\nIl n'en restera qu'un\nIzi, izi, beef, izi, izi, beef\n\n[Outro]\n\"- C’est Laouni Mouhid, né le 25 du 12 en 81 à Trappes ?\n- Ouais, ouais, il est super connu. Et une menace avec arme blanche, dégradation de bien privé, encore un recel, une extorsion de fonds. Agression sexuelle sur mineur.\"\nBah bravo Morray !\n\"- Outrage à personne chargée d'une mission de service, une atteinte sexuelle, deux violences volontaires.\"\nSale pointeur ! #ÉmileLouisLaounizi\nR.O.H.2fesses, Housni Couilles-de-bois, Zoulette Empire\nIzi, il n’en restera qu’un Morray, t'as j'veux dire ou pas ?\n92izon dans la maison", "image": "https://images.genius.com/8105ce9b527f125adf707faecd0797be.1000x1000x1.jpg"}]}