{"artist": "50 Cent", "songs": [{"album": "Curtis", "image": "https://images.genius.com/ce65e8440aa270dba82df26ce2179aa1.900x900x1.jpg", "title": "Movin’ On Up", "lyrics": "[Produced by Jake One]\n\n[Intro]\n(The realest thing you could do is put a drumbeat with nothing but a drum beat)\nNiggas, niggas copied my style, Russ\nThat's why I had to switch up on 'em\nKnow what I mean?\nMad niggas sounding like me\n\n[Verse 1]\nI run the show now, I got the blow now\nYou wanna hold now? You can come cop\nI'm on the low now, I got the four pound\nIn case a motherfucker got to get shot\nThe only time is coming, slow down\nSee they know now, I won't hesitate to make shit hot\nD's will shut your block down, after you're shot down\nWe gonna come through and set up shop\nYou niggas gone work for me now, you gone see now\nHow I change shit, re-arrange shit\nSee for you, dawg, this is new shit\nI'm from Southside, nigga we do this\nThey say I'm grimey, it's hard to find me\nWhen  the sun lighten up the sky\nNiggas wanna line me, try and kill me\nGo ahead nigga, I dare you to try, fuck that nigga\n\n[Hook]\nWe moving on up\nYeah, we gettin' that dough for sure, we moving on up\nYou'll get chromed up\nCash is flow for sure, the dough, nigga you know what?\nWe moving on up\nYeah, we gettin' that dough for sure, we moving on up\nYou'll get chromed up\nCash is flow for sure, the dough, nigga you know what?\n\n[Verse 2]\nI'm 'bout my bread now, I'll cut your head now\nYou know you eating niggas, you should be dead now\nI hold a Glock down, I gotta drop now\nNigga I'm eating, you know I ain't gone stop now\nOne more trip, one more flip\nI move a truckload, nigga, not one brick\nThey make me so sick, fucking sick to my stomach\nYou niggas talk shit, but they know that I want it\nMy clique's so sick, niggas know how we on it\nLight up more shit, the car there when we on it\nI spit a gem star, get your name carved into neck\nHave my little homies run up on your ass with the Tec\nYeah, I stunt in the Vette, got stash in the Vette\nI get head in the whip, I get ass on the jet\nI'm oh so fresh, so motherfucking clean\n24 inch gleam, when I pull up on the scene\n\n[Hook]\nWe moving on up\nYeah, we gettin' that dough for sure, we moving on up\nYou'll get chromed up\nCash is flow for sure, the dough, nigga you know what?\nWe moving on up\nYeah, we gettin' that dough for sure, we moving on up\nYou'll get chromed up\nCash is flow for sure, the dough, nigga you know what?\n\n[Bridge]\nBeen smoking that dip\nThe PCP got them thinking they can walk on water\nThat ecstasy will have a nigga rock hard\nTrying to fuck your daughter\nThe LSD will have niggas running round\nTrying to kill you for us\nSmoking that piff, sipping that yak\nTalking that shit, loading that strap\n\n[Hook]\nWe moving on up\nYeah, we gettin' that dough for sure, we moving on up\nYou'll get chromed up\nCash is flow for sure, the dough, nigga you know what?\nWe moving on up\nYeah, we gettin' that dough for sure, we moving on up\nYou'll get chromed up\nCash is flow for sure, the dough, nigga you know what?", "year": "2007-09-11"}]}