{"artist": "C-Murder", "songs": [{"title": "Watch the Police", "album": "Training Day (The Soundtrack)", "year": "2001-09-11", "image": "https://images.genius.com/9ccc9d447773d69712060f30d66a6f8d.500x500x1.jpg", "lyrics": "T-R-U ya heard me?  Trick Daddy Dollars y'all huh\nC-Murder, Trick Daddy, No Limit, Slip 'N Slide\nWhatever, uh huh, watch 'em\n\n[C-Murder]\nWatch the police when I'm rollin through the projects\nMy pants sag so I'm labelled as a suspect\nWho gave the boys in blue, the authority\nTo harass me cause I live in the minority\nCheck yourself player, cause I ain't the one\nYou look plain, and kinda lame without your badge and a gun\nYou been harassin me, since I was a teenager\nBut now that I got a Roley with a Benz and a pager\nThey pull me over and search in my car\nSo you lookin for the product, but could it be narcotic\nAnd just because I'm from the CP3\nI gotta watch the police because they scared of me\n\n[Chorus]\nWatch the police - coming straight from the underground\nWatch the police - a young nigga got it bad cause I'm brown\nWatch the police - if you a teenager (watch, watch)\nWatch the police - with a little bit of gold and a pager\n\n[Trick Daddy]\nI'ma teach they motherfuckin ass 'bout playin with me\nI'ma take they ass on one\nThug Life, for them niggas in the county jail\nState pens and feds, nigga\n\nI'm tired of the motherfuckin po'-po'\nThey keep sweatin a nigga, sittin all in the do'\nPo' flashin the light in the dark and for what?\nIs it cause the trunk make so much thump?\nSee I'm Trick Daddy Dollars, and hoes they call me Mr. Scholars\nYou could lock me up, but I'll make bail regardless\nYou wanna know have I ever been arrested?\nMisdemeanor, felony or domestic\nSo I confessed it, damn right you guessed it\nDid time for work, but I ain't seen a brick since\nI don't fuck with niggas who I don't know\nI'm gettin money, gettin blunted, nigga watch the po'-po'\n\n[Chorus]\n\n[Interlude]\nWatch the police - in my hood, they'll pull you over\nAnd put dope on you, and bring you to jail\nMakin twenty-four a year\nThey catch you with 70K, they gon' keep it\nC, tell 'em what's happenin\n\n[C-Murder]\nI'm tired of the jackin and harassin (and harassin)\nEvery time I see you pass, it make me wanna blast\nI'm C with the criminal behavior\nI'm a gangsta with paper, and plus I got flavor\nMy identity by itself causes violence\nI catch them without they badge and gun and then they silent (Shhhh)\n\"Get out of the car!\" It don't matter if you smaller or bigger\n\"You're under arrest!\" When a sucka in a uniform run up on a TRU nigga\nShinin that light in my face and for what?\nMaybe it's because I kick so much butt\nAnd I can't be touched, that's why I laugh when I get away {*squeals*}\nBut to my homie, this is what I say\n\n[Chorus]\n\n[Outro]\nAround my neighborhood, they just be hackin you up for no reason\nJust askin you all kind of questions\nPuttin the light all in your face\nMan, what's wrong with them? Man, that's why we gotta watch 'em\n\n[Chorus]\n\nYou're gonna die (*repeat 3X*)"}]}