{"songs": [{"image": "https://images.genius.com/8897c028bcb810c4ca4c847cf55cd43f.500x500x1.jpg", "lyrics": "[Verse 1: Mac Lethal]\nNow in my mothafuckin' heart I got a lot of real love, but my brain's unstable\nI just wanna wish death onto major labels\nI just wanna wish death onto basic cable\nAnd the fuckin' radio station too fake to play true shit\nReal music... kill the industry, body bag it with blue lips\nOhh shit, drop the casket in tulips\n2 clips pop attacking you move quick! Woo!\nGotta warm it up I'm guessing\n'Cause I'm flowing like I'm stepping with an AK-47\nSemi-automatic, MAC-11 weapon and eleven methods\nOf making medicine out of madness in a session\nMan my vocal chords are bleeding 'cause I'm rapping with aggressiveness\nIt doesn't matter if I'm hoarse I'm practically a Pegasus\nYou're looking at a lunatic, I'm bigger and sicker\nAnd every time I fucking pick up the liquor\nI'm ripping it quicker and I don't give a fuck about the gimmick, I'm sick of it\nThis is the end of it, this isn't intimate\nI don't wanna underestimate the fact that I got endless influence\nI could probably make a couple children end up as idiots\nAll I gotta do is settle an argument with the devil\nMy heart isn't made of metal\nBut part of me's just an artist\nAnd part of me is a martyr of marketing\nAt a level that's arguably incredible\nPardon the schizophrenia!\nDemons are always talking to me and I fuck 'em often\nMy feet are up in a coffin, not breathing not fuckin' talking\nI need you, I'm fucking stalking you\nSearching until I find you\nI'm LURKING I'm RIGHT BEHIND YOU\nI'LL MURDER YOU: ON THE BIBLE\nI admit that I'm a little loony\nYou could prolly stick me in the psycho ward\nI'm thinking of leaving the planet earth and flying towards Heaven...\nWalk in, holding two guns up\nSince she's been gone, I ain't ever seen the sun up\n\n[Bridge 1: Mac Lethal]\nI lost my mom when I was 23\nAnd all I wanna know is what the Angel of Death wants from me\nI wrote this song holding a baby she slept\nNow I'm hoping I can save her from the mothafuckin' ANGEL OF DEATH\n\n[Chorus: Mac Lethal]\nAngel of Death (angel of death) (angel of death)\nAngel of Death (angel of death) (angel of death)\nAngel of Death\n(angel of death) (angel of death) (angel of death) (angel of death)\n\n[Verse 2: Tech N9ne]\nSit in my cinema, get to sippin' with a spliff\nI got a soul, it be sinister with the sick, a lot of shit\nI'm 'bout to give you the killer drama like Brian De Palma\nWho be the angel that got me flying? My mama\nDevil don't wanna see me tight as string in a piano\nMy levels equivalent to flight over when you see animals\nOver the aircraft and into the universe\nA lunar curse, when I sit down I'm ready to groom a verse\nIn the middle of a murder I kill up everything\nI'm taking the title from the idol for the meddling with the metal head\nNigga better go hit the pedal, 'cause an angel don't ever give a damn what the devil said\nAnybody wanna battle I'ma decapitate\nI can do it, the fluid'll kill 'em off when I activate\nI'ma laugh at a lot of a little lames, I lacerate\nMurder masses with my mic I'ma masturbate\nLeave y'all, with the tongue and these jaws\nI'm incredible, haters don't wanna never recall\nThat I come to beast all, they free fall, 'cause we raw\nN9na be heavy, you be the leaf on the seesaw\nSo competitive they gimme the bucks\nThey don't wanna step into me, 'cause I'm rippin' 'em up\nAnd all the people that wanna get it\nI'm ready, so come on with it\nBut if you a critic, we never giving a fuck, we living it up\n\n[Bridge 2: Tech N9ne]\nI'm in a mess, I lost Maudie\nI don't want anybody to call me\nI'm really vexed and not jolly\nShit I been thinking is ungodly\nWill I reign, will I stress?\nEither way I'm gonna aim at your chest\nI ain't tripping off the Angel of Death\n'Cause Maudie Sue Yates is the Angel of Tech\nCha!\n\n[Chorus: Mac Lethal]\nAngel of Death (angel of death) (angel of death)\nAngel of Death (angel of death) (angel of death)\nAngel of Death\n(angel of death) (angel of death) (angel of death) (angel of death)\nAngel of Death (angel of death) (angel of death)\nAngel of Death (angel of death) (angel of death)\nAngel of Death\n(angel of death) (angel of death) (angel of death) (angel of death)", "year": "2016-09-06", "album": "Congratulations", "title": "Angel of Death"}], "artist": "Mac Lethal"}