{"artist": "50 Cent", "songs": [{"album": "I’m Good", "image": "https://images.genius.com/9e8c59349a0337188ba7d78588103880.600x600x1.jpg", "title": "In Cold Blood (Remix)", "lyrics": "[Verse 1: 50 Cent]\nWise came home Far Rock edge, man; I figured I'd drop in (WHOOOO!)\nBless him with a lil' short change to go shoppin'! (YEAH!)\nBuzzer don't work! - Elevator shitty staircase pissy\nHis sister ran out huggin' on a nigga, she missed me! (what?)\nMomma living room, she sipped Cristy till she was pissy! (whoooo!)\nTold 'em niggas tried to blaze me last night but they missed me\nIn the CL, some niggas wet the driver side door, (uh-huuuh!)\nI had my vest on. - I put the fuckin\\' pedal to the floor! (AAAAAHHHH!)\nHer son facin' her - for a less or tens, he hurtin'\nThey be hollerin' like: \"50, let us put some work in!\"\nToday's a nice day if tonight's a nice night, - somebody gon' die\nIt is what it is my nigga; why ask why?!\nSee? I stay with some s*it in the street\nBut the niggas Uptown love me like they love Pistol Pete. - You heard me?\n\n[Interlude: 50 Cent]\nHaha, haha!\nBRAAAAAAAAAAAAATT!\nY'all n*ggas eat that, n*gga!\nLive with that!\n\n[Verse 2: Scarface]\nI started small time, dope game, pushin on the corner\nTwenty cent cook-up, fifty flippers if you want 'em\nFull of formaldehyde, my clothes wreakin marijuana\nCops rollin up on us, my neighborhood's like a sauna\nPistol-grippin, insurin won't nobody run up on us\nBut if they do, fuck 'em, we murderous nickel-dome 'em\nI ain't playin no games, I'm on a mission fo' the change\nMotherfuck bein a lame, I'm ten toes in the game - deep\nI can't slip, this whole world want me sleep\nSee I hustle like a predator and prey on the weak\nAnd playin for keeps, cause see, it's a thin red line\nBetween a nigga gettin his, and me gettin mine\nAnd plus I'm a nigga with that feelin like it's my time\nAnd anybody standin in the way of that is dyin\nI bust nine, how many times I gotta warn you?\nI ain't the one, be pushin buttons in the sight of my gun\nI'm the real live version of the Corleone family\nSo I spit this clearly, so you hoes'll understand me..\n\n[Verse 3: Lloyd Bank$ {50 Cent}:]\nI had my eyes on the Mascara, - mami, the Maybelline queen;\nDolce Gabana, Fergano gettin' choked in the sauna. [explosion]\nShe had a - dot on her face like Madonna, (Madonna!) dressed like she date a designer. (designer!)\nLooks so good, I spent a day with her mama. {whoooo!}\nTried to break her, bring her, beat her, eat a plate of lasagna, {uh-huuuuh!}\nGrab some paper, bring the heater in case it's haters behind her. {AAAAHH!}\nThey call me \"Bandana Bank$\", baby, I clap your homie, homie\nThen I'm through with her, - go holla at Macaroni Tony, {TONY YAAAAAAAAAAAAAAAYO!}\nIn the back with a few cup of Henny, baggy pants to tuck the semi\nIn case you get to fuckin\\' friendly. - My clique as tough as any! {any!}\nStuntin' plenty, I don't trick a penny; {haha!} get your own shit!\nCallin' me with questions will only get you a phone click. - ! (!)\n\n[Hook: Scarface]\nI can squeeze without blinkin', I'm a cold-blooded nigga\nBank robber (ooooh) I'm a natural born killer\nDrug dealer, anything it took to survive\nEven if it took a nigga to die, I'm a gangsta", "year": null}]}