{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/5b472f0faec75a7ea8e5ca246c5f8acf.1000x1000x1.jpg", "title": "Brilliantaire", "year": "2013-02-25", "album": " The Psychic World of Walter Reed", "lyrics": "[Alan Watts]\nAn Alternative Myth:\n\nIf, there is any such thing at all as intelligence\nAnd love, and beauty, well, you found it in other people\n\n[Killah Priest]\nSitting in my chair, then the vision appears\nStaring at the wall, the wall turned into the spheres\nAnd the spheres held the planets\nSome were distant, some near\nOuter limits, I in a instant was there\nWarm currents were rushing, infinities came in abundance\nCenturies seasons Zodiac by the dozens\nProphesying thy coming, and it was told\nI hold the mic way beyond the hundreds\nThe mic turned to greatness\nGreatness took me to the sacred places to give\nThrew glory over me like a blanket\nThen I reclined so I can see the design\nVoice said close your eyes, cuz all we need is your mind\nAnd the rhyme like a storm as the currents blew me on\nThrough gasses, I saw places where planets were born\nAnd the voice that spoke to my ghost majestic\nLet's show you the essence\nLet's reveal to you the presence\nThe Seventh Seal of the heavens\nWithin the will of the legend\nThe seal of the lessons\nThe skill is perfection\nKnights kneel before the weapon\nAlchemist of the sinister\nTo heal within the message\nTo build effervescent\nI feel shadows all around me\nThey said they're just the pharaohs tryna crown me\nThere's tarots of crystal balls within your boundaries\nYou're now free to explore\nAll the visions encountings your mind can soar\nFor all the wisdom and counseling\nA psychic mystique; I've been writing for weeks\nEvery time I say a rhyme it whitens my teeth\nMake angels pillars of stone - people pillars of salt\nWhat I reveal under the cloth, when Killah would talk\nSwimming in the cosmic gulf, and the rivers of thought\nWhere the healers was taught\nBut in the mirrors seem lost\nAnd they finished the planet Tiamat on the Shabbat\nThen they planted Eden crops when the evening would drop\nWhen there was nothingness\nThat's when Yah made the covenant\nOn the cross' blood would drip and the corpse buzzards pick\nTime and admiration, stress and aggravation\nI don't do yoga but I can stretch your imagination\nGod tears turns into prayer beads\nFalls over the neck of Cardinal wearing the wooden Mary\nWhisper verses over the buried, in the Celtic cemetery\nAnd he held it till his visions were heavy\nLike a time machine saw the dynasty of kings\nThrough the mind it was seen, the skyline turned to wings\nWe wear paint beads, water or oil\nSaint holy men, beggar or royal\nAngels, devils, or aliens, which do you believe in more?\nDo you receive or restore?\nDo you want peace or war?\nDo you wish to live free or by law?\nIt gets deep to the core\nWe perform prayers faster than charities\nGo on pilgrimage but do we know what real healing is?\nResearch a million in years, the real healing is here\nWithout the billion, I became a billionaire\nFrom natural disaster, till the days of dinosaurs, the raptors\nTo common laws, to all kinds of war, till the rapture"}]}