{"songs": [{"image": "https://images.genius.com/3a2b5d523ed4c1887dcd3d37b71c01d9.1000x1000x1.jpg", "title": "Get Down", "album": "God’s Son", "year": "2003-07-08", "lyrics": "[Produced by Salaam Remi]\n\n[Chorus: James Brown sample]\nGet, get, get down!\n\n[Verse 1: Nas]\nUh.. uh.. uh..\nNew York streets where killers'll walk like Pistol Pete\nAnd Pappy Mason, gave the young boys admiration\nPrince from Queens and Fritz from Harlem\nStreet legends, the drugs kept the hood from starvin'\nPushin' cars, Nicky Barnes was the '70s\nBut there's a long list of high-profile celebrities\nWorldwide on the thorough side of things\nLivest kings, some died, one guy, one time\nOne day grabs me, as I'm about to blast heat\n40-side of Vernon, I turned while he asked me\n\"What you up to? The cops gon' bust you.\"\nI was a teen drunk off brew\nStumbled I wondered if God sent him\n'Cause two squad cars entered the block\nAnd looked at us; I ain't flinch when they watched\nI took it upstairs, the bathroom mirror, brushed my hair\nStarin' at a young disciple\nI almost gave my life to what the dice do\nYeah man, throwin' them bones\nHopin' my ace get his case thrown\nHis girl ain't wait for him, she in the world straight hoein'\nWhile he lookin' at centerfolds of pretty girls showin'\nThey little cooch; gangstas don't die, he's living proof\nThe D.A. who tried him was lyin'\nA white dude, killed his mother during the case\nHung jury, now the D.A. is being replaced\nPre-trial hearing is over, it's real for the soldier\nWalks in the courtroom, the look in his eyes is wild\nTriple-homicide, I sit in the back aisle\nI wanna crack a smile when I see him\nThrow up a fist for Black Power, 'cause all we want is his freedom\nHe grabbed a court officer's gun and started squeezin'\nThen he grabbed the judge, screams out, \"Nobody leavin'\nEverybody—\"\n\n[Chorus: James Brown sample]\nGet down, get down! Get down, get down!\nGet, get, get, get, get, get, get down!\nEverybody\nGet down, get down! Get down, get down!\nGet, get, get, get, get, get, get down!\n\n[Verse 2: Nas]\nSome niggas fuck their enemies in their ass when they catch 'em\nWeird-ass niggas who dangerous so don't test 'em\nThey make you disappear, this a year that I won't forget\nSold CD's double platinum, met mo' execs\nSouthern niggas, independent label, real killers\nKnow the business, ran Tennessee for years, now they chillin'\nThey had the coke game somethin' crazy\nSold music out the trunk of their car, that shit amazed me\nPut me onto her-on blunts, sherm or somethin'\nTook a puff, what the fuck? I turned to punch him\nSouthern niggas ain't slow, nigga tried to play me\nI left from around them dudes, they cool but they crazy\nNow I'm back around the old school that raised me\nNew York gangsters, we loungin', out in L.A. see\nA dude wrote my dog from Pelican Bay\nThe letter say, \"Nas, I got your back, the fools don't play.\"\nI rolled with some Crips down to a Crenshaw funeral\nNever saw so many men slaughtered and I knew the ho\nResponsible; the nigga still alive in a hospital\nMidnight they crept in his room and shot the doctor too\nSee, my cousin's in the game, thuggin' and thangs\nHe plugged me with a dame who was half-Mexicano\nGave the ass up, I'm a mack daddy Soprano\nShe passed me the indigo, but the imbecile\nShoulda never tippy-toed, thought my eyes were closed\nOpenin' the hotel room door to let her goons in\nBut I moved in a manner on some Jet Li shit\nI let the hammers blow, wet three kids\nSee honey thought I had somethin' to do with all the drama\n'Cause I was with a crew that had her people killed\nCalled up my cousin, told him I ain't fuckin' with you\nHe responded \"cool,\" but told me out here this how motherfuckers—\n\n[Chorus: James Brown sample]\nGet down, get down! Get down, get down!\nGet, get, get, get, get, get, get down!\nEverybody\nGet down, get down! Get down, get down!\nGet, get, get, get, get, get, get down!\n\n[Outro: Salaam Remi]\nAll I really gotta say is that\nIf that's how our people gon' get down, how we ever gon' get up?\nHow we ever gon' get up if that's how we get down?\nA shame when you really look at it\nMy folk against your folk, but we all kinfolk\nSomebody got to make a change"}], "artist": "Nas"}