{"artist": "Kid Rock", "songs": [{"image": "https://images.genius.com/84a4fa521196d02b636ed358ac28f69d.600x600x1.jpg", "title": "Care (Demo Version)", "year": "2010-11-16", "album": "Born Free", "lyrics": "[Kid Rock]\nDay by day my life gets colder\nMy ice grows thin as I get older\nPeace in pieces, bloody and bruised\nI feel so helpless and confused\n\n'Cause I hear screamin' on the left, yellin' on the right\nI’m sitting in the middle tryin' to live my life\n\n[Chorus: Kid Rock]\n'Cause I can't stop the war\nShelter homeless, feed the poor\nI can’t walk on water\nI can’t save your sons and daughters\nWhile I can’t change the world and make things fair\nThe least that I can do...\nThe least that I can do...\nThe least that I can do is care\n\n[Mary J. Blige]\nI pray and pray for life’s salvation\nFaith is tried and true in tribulation, yeah\nLove is lost and lonely, check the news\nAnd with these open arms I’ll wait for you\n\n'Cause I hear screamin' on the left, yellin' on the right\nSitting in the middle trying to live my life\n\n[Chorus: Kid Rock & Mary J. Blige]\n'Cause I can't stop the war\nShelter homeless, feed the poor\nI can’t walk on water\nI can’t save your sons and daughters\nWhile I can’t change the world to make things fair\nThe least that I can do...\nThe least that I can do...\nThe least that I can do is care\n\n[T.I.]\nFor the life of me, I can’t see how the devil keep enticing me\nAll you sees a felon, I know God can see whats right in me\nHow I can be labeled as a villain in the first place\nWhen the worst case scenario is my birthplace\nI'm just tryin' to keep from fallin' victim to the murder rate\nTake my life lesson convincing the adolescents\nThat a God up in heaven, sending down blessings\nAnd your future ain’t brighter than your present, quit stressin'\nScreamin' on the left and yellin' on the right\nWhile I'm sittin' in the middle trying to live my life\nLet's go\n\n[Chorus: Kid Rock & Mary J. Blige + (T.I.)]\n'Cause I can't stop the war\nShelter homeless, feed the poor\nI can't walk on water I can't save your sons and daughters\nWhile I can't change the world and make things fair (Wish I could, though)\nThe least that I can do is care\n\nNo, I can't stop the war\nShelter homeless, feed the poor\nI can't walk on water\nI can't save your sons and daughters\nWhile I can't change the world and make things fair (I wish I could, though)\nThe least that I can do...\nThe least that I can do...\nThe least that I can do...\nOh is CARE\nYes, I can...CARE\nYou know I can...CARE\nYes, I can...CARE (It's what you can do)\nOh, care"}]}