{"songs": [{"year": null, "title": "We Gonna Rock", "image": "https://images.genius.com/6b4f873431041165fe1193e317d621cf.700x700x1.jpg", "lyrics": "Never send a boy to do a man's job\nYou know?\nI think we got away from what the fuck this is all about\nWe forgot - how to spit\nMuthafuckas is makin all these crazy-ass fuckin records\nStop puttin your dirty laundry out in the street, muthafucka\nFollow me now\nFuck with me\n\n[ VERSE 1 ]\nSammy Sosa slugger, hip-hop nigga, touch em all\nSome cute, but suck em all, I say fuck em all\nEat a dick too, soloist choose another route\nG.H. form now, go and break my brother out\nHenny out the bottle, nigga, eyes low in the truck\nNothin but that good smoke, hydro in the dutch\nAin't no probably, Sauce Money, fool, got to be\nChicken eggs grits, California, call it Oscar E\nEverything I spit hot, baby boy, you're kiddin me?\nHit Flex with it, Stretch with it, then Mr. Cee\nMarley Marl Sunday night, can't forget Kid Capri\nHit the turnpike where all my niggas down in Philly be\nJust passin through, son, still many guns to cock\n30 miles from the bridge where anyone can cop\nChillin at my bitch crib, sip plenty rum and scotch\nPut it in the air for them niggas Biggie, Pun and Pac\n\n[ Hook ]\nHaters frontin in the club\nReal gees show us love\nBust slugs for my nigga\n(We gonna rock)\nAnywhere we do shows\nCome through, two hoes\nKillers with new flows, playa\n(We gonna rock)\nEven when eyes low from hydro\nCan't another brother cock-block my flow\n(We gonna rock)\nCan't stop our ones\nCan't block our guns\nGet your triggers\nAnd squeeze for these Faculty niggas\n\n[ VERSE 2 ]\nHaters hate me cause I'm a big nigga with mass appeal\nThey can suck a dick with ghonorrhea and that's for real\nAin't no secrets, muthafuckas know I might clap the steel\nBe ready any given time, I'm like grab the wheel\nLet the window down slow, kid just bought the farm\nTwo chicks in a Yugo, damn, it's a false alarm\nNot on this joint, Sauce usually calm with the grammar\nBut right now I'm like baking soda, armed with a hammer\nSummertime comin, now they wonder what I drive next\nRepresent for big niggas, 3-4-5-X\nWide body jeeps, little dimes puff the herb slow\nKnow the drill, bubblegum, rubbers in the 3rd row\nSUV tinted out, frontin on the hands-free\nReal gees happy for me, haters like 'it can't be'\nFighter and a lover, worst enemy or your brother\nJust don't forget to call me Dad too cause I'm a motherfucker\n\n[ Hook ]\n\n[ VERSE 3 ]\nI know bitches who love Sauce for the dicko, straight Gorilla\nFatally, more than likely take at least eight to kill a-\nDdicted to my flow, doggy style ain't the way I make my scrilla\n[Name], [Name], [Name], [Name], those my niggas\nHit the club half-cocked, niggas shoulda knew me better\nJim Star dillinger, that's under my Gucci sweater\nThrough the crowd thugged out, took my stance and I spit\nScreamed on this one chick like, \"Bitch, dance to my shit\"\nPart the club with elbows, bump a nigga, love that\nNigga read my eyes and it said 'step the fuck back'\nThis Gorilla Hill shit, we don't give two fucks\nOn Gorilla Hill, kid, you tryin to do too much\nMust've had a sixth sense, how he knew I clutch chrome?\nProbably this a big bitch, front and left his nuts home\nFuck that weak Gotti shit, nigga, let your shotie spit\nSauce Muthafuckin, get your punk-ass body whipped\n\n[ Hook ]\t(3x)\n\nWelcome to Gorilla Hill", "album": "Middle Finger U"}], "artist": "Sauce Money"}