{"artist": "Big Boi", "songs": [{"lyrics": "[Intro: Big Boi and Gucci Mane]\nYeah! All the ladies say hoooo\nAll the hoes say (Hah! Hah! Hah!)\nGucci! Here we go, A-town, C-port\nCutmaster Swift down your throat, shawty\n\n[Verse 1: Big Boi]\nBoy, stop, Sir Luscious Left Foot's on fire\nTryna block my shine just ain't gon' happen, so don't try\nEvery time I get on this microphone I like to spit\nInking hit up after hit, this penmanship is so legit\nI came equipped like a prophylactic, now they riding dicks\nLike styling on these suckas out here tryna buy their bitch\nNow they rich, try convince everybody to trick off\nBut a true boss done paid the cost, she giving away them drawers\nWord to the brown James, he some chicken chow mein\nReally mane, you done say some silly things\nAnd the fella Dana Dane, boy, you cuffed, claimed a dame\nHey, my main thang got my last name, know what I mean?\n\n[Hook: Gucci Mane]\nI'm on my grind, shawty, don't block my shine, shawty\nHold up, hold up, guess who just showed up?\nRolled up, rolls cut, drop with the doors up\nI'm on my grind, shawty, don't block my shine, shawty\nWait a minute, wait a minute, chill a little, sit a minute\nI can't close my safe no more 'cause I got too much money in it\n\n[Verse 2: Gucci Mane]\nThey put Gucci in a cell then Madea went to jail\nI make music, I make movies, I need Tyler Perry sales\nLoud smell coming out the Lamb', fuck it, what the hell\nGucci Mane, so I'm Gucci'd down, she got on Chanel\nIn the cut rolling stupid kush like I'm in a rush\nIn the club with a half a pound, 150 blunts\nZone 6, East Atlanta's own, fuck with Nia Long\nSo I shine like it's showtime, all my jewelry on\nOn the block with my stupid watch, boy, you need to stop\nWhen I stop, everybody watch, car don't have a top\nIn a stretch, cost a stupid check, roll another pack\nAnd I'm gone, I can't even flick; Eastside, where you at?\nGucci!\n\n[Hook: Gucci Mane]\nI'm on my grind, shawty, don't block my shine, shawty\nHold up, hold up, guess who just showed up?\nRolled up, rolls cut, drop with the doors up\nI'm on my grind, shawty, don't block my shine, shawty\nWait a minute, wait a minute, chill a little, sit a minute\nI can't close my safe no more 'cause I got too much money in it\n\n[Verse 3: Big Boi]\nCan't be trippin' 'bout no paper 'cause the safe is not so safe\nThe piggy bank got legs and feet and can get up and walk away, shawty\nWith my southern drawl, awkwardly I spray\nLike the backside of a skunk and the stash house with the pump\nPistol grip in my lap at all times in the 'lac\nFrom Atlanta to Savannah, can't a nigga stop that\nNot when God's got his hands on me, only the strong survive\nAnd the weak-minded are falling by the wayside, they try\nBut which I overcome and succeed, indeed\nWith success comes a great responsibility\nWe chose to lead not follow, it's a hard pill to swallow\nBetter get prescriptions filled 'cause there might not be tomorrow\n\n[Hook: Gucci Mane]\nI'm on my grind, shawty, don't block my shine, shawty\nHold up, hold up, guess who just showed up?\nRolled up, rolls cut, drop with the doors up\nI'm on my grind, shawty, don't block my shine, shawty\nWait a minute, wait a minute, chill a little, sit a minute\nI can't close my safe no more 'cause I got too much money in it", "image": "https://images.genius.com/5d3c5ec44cd684d9d325d94eb82ba629.400x400x1.jpg", "year": "2010-07-06", "title": "Shine Blockas", "album": "Sir Lucious Left Foot... The Son of Chico Dusty"}]}