{"songs": [{"album": "Friday Night Lights", "year": "2010-11-12", "title": "Back to the Topic (Freestyle)", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg", "lyrics": "[Intro]\n\"Yeah, nigga\nI'mma go ahead and murder this shit\nVoice gone and shit, I think it's gon' make it sound a lil'–a lil' ill...\nA lil' iller\nYeah, fayettenam... nigga.\"\n\n[Verse]\nYeah, Carolina blue kicks, pedal to the metal\nFeeling like a puppet and the Devil is Geppetto\nLetter to the ghetto, hold your head high\nYou can pick apart my raps, I ain’t told ya na’ lie\nMy world a little darker, like a fuckin' tan line\nGo on, look for a better nigga: girl you can’t find\nFine young man with an old man mind\nNo time for the chick who fucked the whole mankind\nAw, no ma’am, I’m an old land mine\nI been waiting to blow up for a long damn time\nNow I’m armed and I’m Fayetnam’s finest\nCarolina’s savior, marijuana blazer\nOnly on occasion 'cause my mind be racin'\nLost in my thoughts so my eyes be Asian\nThinking how these rap niggas gotta be fakin'\nWhole style obviously copied, pasted\nPlagiarized swag, may arrive last\nBut when it’s all said and done I’mma be ahead of them\nWay that I describe it, prescribe a nigga medicine\nWhat that I be fly I be higher than the Jet-a-sons\nMoving on up, nigga higher than the Jeffersons\nAll about the Benjamins. Bad chicks? Send em in\nBasic hoes? Toss em out, can’t even get Waffle House\nHatin’ niggas? Chalk em out. Go on, get the coffin out\nWhat you talking about? Lil man\nMy shit here burning, you not even lil’ tan\nI’m ill enough to kill cancer: baby, I’m chemo\nDown in Miami and I'm throwed like Marino\nGet a whole lot of you-know and she bald like an Eagle\nNo, not on top but down there\nShe say she want to hop on top, \"girl, I don’t care\"\nYou better get yours fore I reach mine\nCause then I’m throwing peace signs\nIf you a freak, I can take you to your peak\nGirl, I do it to the maximum: Nissan\nAnd I hope you a believer\nI’m quarterbacking, trying to get you open like receivers\nFar from an overnight achiever, Cole is like the leader\nOf the new niggas, to tell the truth I’m only fucking with a few niggas\nIf that, the rest of you niggas get lapped, I sit back\nAnd reflect on the rap game\nI came from out of nowhere\nNigga, I swear them lames ain’t know how to prepare\nGot niggas shouting out “The ‘Ville, I gotta go there”\nBoy don’t you know you get shot over there?\nI say my prayers cause this life ain’t fair\nA bunch of backstabbing niggas, hope the knife ain’t there\nA bunch of temptation facing when your wife ain’t there\nYeah late at night, when I got the phone call and made a right\nBut my crib was straight ahead, shorty gave me head\nHit it then I quit it ‘fore she even made the bed\nDamn I’m no good, but damn it’s so good\nI’m picturing that body like a camera phone would\nSomething like Rihanna while I’m up in that vagina\nType of chick that only dress in something that’s designer\nI could give a fuck as long as there’s something that’s behind of her\nGot the type of bump that make a dog wanna hump\nBack to the topic, actually forgot it\nHoes, money, I’m the shit...oh yeah, I’m reminded\nThe way I put the words together, cleverly align em\nThese other rap niggas should never be a problem\nAnd I’m ghost"}], "artist": "J. Cole"}