{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "Rock 4 Rock", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "[Intro: Pimp C]\nUh! Uh! Check one two, one two, one two bitch! (bitch!)\nIt's goin down (goin down!).. know what I'm talkin 'bout!? (talkin' bout!?)\nSweet Jones! (Jones!) It's goin down! Hold up...\n\n[Pimp C]\nThey wanna talk like us, wanna walk like us (us!)\nPussy ass niggas wanna bark like us (us!)\nSuckin hoes' pussy that I used to fuck with\nIn ya mind, you a bitch, you really wanna suck my dick (you a bitch!)\nI'm puttin fresh coke on the corner (uh!)\nGot the ghetto set hot as a sauna (uh!)\nI-10, I'mma win if I make it back (uh!)\nGotta take shit slow, through that Anahuac (Anahuac!)\nThe laws colder than an icicle (icicle)\nUh! And mine sour as a diced pickle\nUh! My Pyrex game is legit\nMicrowave, I'm the shit, rippin business from 36 (36!)\nYou wanna know how I did that?\nGet my blow from Mexico, that's where the scammer at (scammer at!)\nI'm talkin 'bout that flaky, flaky\nCause you ain't gon' win the life, hittin strippers like the dykes get\n\n[Hook: Pimp C]\nMore bounce to the ounce, cause the porm is shit\nI done got me 50 ounces, I done permed this bitch\nTightened up, no slack, bitches checkin my stock\nGot some birds that set a nigga, some I go rock for rock\nMore bounce to the ounce, cause the porm is shit\nI done got me 50 ounces, I done permed this bitch\nTightened up, no slack, bitches checkin my stock\nGot some birds that set a nigga, some I go rock for rock (rock for rock)\n\n[Scarface]\nI started small time dope game, you know the tale\nTennis balls, flipped to 7 ounces on the steel\nOpen pot full of yellow bag of razors and resumes\nNigga standing at the door with AK's and Desert's\nStash spot for the glass, I was pushin the tinted\nLow hats, college shirts on, lookin to get it\nHit a small town, get a room close to the block\nHit the scene and shoot that bitch up and wait for the cops\nWhen it cool, put my work out, issue the passion\nShoot that motherfucker up again when niggas get back\nThese motherfuckers got a death wish, fuckin with 'Ak\nPlayin games like it ain't no consequences of that\nYeah I said it and I meant it, I got brave for a rep\nPlayin cool, put my bait out and just wait for the cat\nBloodline, purified, I'm so gangsterous with it\nCan't a motherfucker out here breathe and tell you no different, bitches\n\n[Hook]\n\n[Willie D]\nHere it is, motherfucker, let the champagne hold\nK-si-si pimpin, Willie D in the do'\nIt's a free world, gon' hustle, get yo' scrill\nYou can do what you wanna do, just not 'round here\nCause this is, my hood, my block, my street\nYou wanna sell a cool cup? You gotta go through me\nIf the po' po's jam you up, I ain'st to talk\nI'm the cat with the H-Town, gangster walk\nBaby want me cause she saw me in that Chinchilla coat\nI'mma fuck her in the mouth, let the nut in her throat\nBefore buddy get out of line, I'mma get him fo' sho'\nBut it's gon' be about my respect, not over no ho\nLet my work come up missin, you gon' kick it with dead men\nCause bitch I'mma beat yo' head in\nI been paid, been makin fast bucks\nNigga you work with Whitney, shut yo' broke ass up!\n\n[Hook]\n\n[Bun B]\nI'm in the project, parkin on the Westside of town (town)\nIn the kitchen tryna cook myself up a couple of pounds (pounds)\nWith a 4 gallon pot, a beaker kit and B-12 (twelve)\nTry to whip me up a 5 piece my muthafuckin self! (self!)\nThe focus's on how to win, doors cracked open\nNiggas peekin through the blinds, (for what?) incase somebody scoping\nRag tied around my face, (why?) the fumes real strong\nAnd I'mma be over the stove cause it's all night long\nO.G. rock bone done been out on the scene (scene)\nA cocaine cowboy just like Will-Lean (Will-Lean)\nMy reputation is stronger than rat piss\nLegendary for the lyrics and my muthafuckin wrist (huh!)\nThe brokedown seven, brought back fifteen\nThat was still so strong, (and what?) it killed ten fiends\nThat's a mean whip game (game), if ever there was\nBut it ain't nothin cause a trill nigga do what it does with more bounce\n\n[Hook]", "year": "2006-07-11"}]}