{"artist": "Boogie", "songs": [{"album": "Thirst 48", "title": "Do It Like We", "year": "2014-06-24", "lyrics": "[Intro]\nWho can do it like you, who can do it like you?\nWho can do it like you, who can do it like you?\nWho can do it like me, who can do it like me?\nThey might try you nigga\nName a nigga that can do it like me\nThey ain't ever gon' get close though\n\n[Chorus]\nWho can do it like you, who can do it like you?\nWho can do it like you, who can do it like you?\nThey can’t do it like you\nI swear these bitches can’t do it like you\nAnd who can do it like me?\nName a nigga that can do it like me\nWho can do it like me?\nBetter yet, who can do it like we?\nWho can do it like we?\n\n[Verse 1]\nAnd you my little desert eagle\nBlessing all you people but you killing all these bitches\nAaliyah flow, one in a million to these bitches\nI know you seen them, I got no feelings for these bitches\nAnd you stay in your position\nI write a check just to pay for your attention\nAnd you ain’t really in the plan of the victim\nYou just tell ‘em when it’s done, just don’t tell ‘em how did it\nWoah, and your last nigga weak\nNigga when I told you it’s that nigga last week\n‘Cause a week never lasts, I creeped on your ass\nLet me teach your home for you, this a beat for your ass\nLook at you stopping all the traffic\nYou all never really care about the laughing\nPlus you know that I don’t do it for the ratchets\nYou get a satisfaction when we look at they reaction\n\n[Chorus]\nWho can do it like you, who can do it like you?\nWho can do it like you, who can do it like you?\nI swear these bitches can’t do it like you\nAnd who can do it like me?\nName a nigga that can do it like me\nWho can do it like me?\nBetter yet, who can do it like we?\nWho can do it like we?\n\n[Bridge]\nStill tryna figure out how they can do it like we\nThey can't do it like we\nSo you might as well cheer, real\nNiggas still ain't fucking with my Gita though\n\n[Verse 2]\nLet’s talk about me though, now let’s talk about me though\nHow I got these other niggas PO, checking like a PO\nHe mad cause he ain't me though\n‘Cause niggas always lying that’s why you don’t fuck with Leos\nTell ‘em we know, and you running from my D tho\nGot you looking like you Tebow, ain’t no nigga to you knee though\nAnd they be asking where do we go?\nShit they could come to our casino, but you know they gotta deal with it\nI swear your pussy is a meal ticket\nAnd if I put it on a plate, I make a meal with it\nIt feel different when you real with it\nYou never change but we still different\nI rather aim when I kill niggas\nAnd from this height ya’ll just little niggas\nShe don’t trust it if there are problems with the clique\nYou could tell, without Michelle that Obama don’t exist", "image": "https://images.genius.com/967988d72ade953e4d1121eb78757aa7.1000x1000x1.jpg"}]}