{"artist": "King Los", "songs": [{"image": "https://images.genius.com/b05590daa61f6ea285b4a5563f3e26ad.500x500x1.jpg", "title": "Don’t Shoot Me Down", "year": null, "album": "G5.2", "lyrics": "[Verse 1:Los]\nThey watch me, they trace me, copy\nThey plottin' to make me sloppy\nThey hate that they could not stop me\nBut not me, they rotten\nHow could they knock me?\nI ain't too cocky, I'm confident\nI need no compliment for my accomplishments\nNo sponsorships, you start some shit\nI flush it, I blush in the face of danger\nI smile in the face of anger\nHow ya dern, I have earned\nSomething that they can't take away but they would rather shoot you down\nLike Tyra Banks\nAnd how you learn the fires burn inside my soul and I am so\nMuch better than these rappers and now you know cause valuable\nIs only valued to he who values it\nSo now you sit you ass down and see if you amount to it or counterfeit\nYou sound a bit astounded by the sound of it\nIt's so deep that you could drown and then get found in it\nFloatin' lifeless, Los the nicest\nAnd I could bring you back with spoken righteous flows that's priceless\nYou see me hurtin' but you never see my cryin'\nJust do me a favor when you see me flyin'\nDon't shoot me down\n\n[Hook]\nPlease don't shoot me down\nCause I'm flying\n(On G5.2)\nI'm flyin'\n(On G5.2)\nI'm higher\n(Then I ever been, how 'bout you?\nSo I asked the man:)\n\nPlease don't shoot me down\nCause I'm flying\n(On G5.2)\nI'm higher\n(Than I ever been, how 'bout you?)\n\n[Verse 2:Los]\nIt's only right that I only write about what's only right\nTie my left behind my back fight you with only rights\nYou still get left behind my back cause I don't just write\nMy flows ambidex-tree-ous (ambidextrous), you see how you get left, right?\nTake a southpaw he write with his left, right?\nBut right or left we all read from the left, right?\nSo I just laugh when MCs say \"Let's write.\"\nI say \"I'd rather left,\" they say, \"Is that right?\"\nYo, why when you come from left they call it weirdness\nI'm goin' confuse a lot of mother fuckers when they hear this\nCause this is genius, your genes is nowhere near this\nThis is a lyrical scientific experiment\nBy a rapper who's fresh as a stick of spearmint\nI come with flows the pierce your flesh and hit your spirit\nAnd freeze your soul, no rapper cold as the kid\nMy whole verse just went over your head\nSo don't shoot me down\n\n[Hook]\nPlease don't shoot me down\nCause I'm flying\n(On G5.2)\nI'm flyin'\n(On G5.2)\nI'm higher\n(Then I ever been, how 'bout you?)\n\nPlease don't shoot me down\n(Don't shoot me down baby)\nCause I'm flying\n(My swag on a billion and three)\nI'm higher\n(Ya dig)"}]}