{"songs": [{"image": "https://images.genius.com/b05d503168258badad9b337231b642c2.897x897x1.jpg", "album": null, "title": "Yaroslav Maly (“Machete”) and producer of the band Mikhail Peleg spoke about new projects", "lyrics": "According to Mikhail Peleg (Machete producer), a multi-million-strong audience of fans loves the work of the band due to  their soulful and deep-meaning songs in which there are just no empty lines.\nThe famous singer, songwriter, and musician Yaroslav Maly (better known to the general public as the frontman and creator of the band Machete) spoke about his new projects and shared the recipe for writing real hits.\nAlmost all the band’s tracks transmit a charge of love, kindness, and inspiration. Yaroslav Maly believes that poetic lines and catchy motifs are the key to the future success of a song. There are many philosophical, moral, and aesthetic thoughts on the most diverse topics of our everyday life in his compositions.\nMikhail Peleg stated that over time different aspects of the artist’s creative activity have undergone significant changes. In lyrics written today by the Machete frontman, we hear discussions about our internal struggle, the different facets of love, humanity, the power of justice, and belief in the best.\nYaroslav admits that he does not always write his verses on paper or any other medium. Recently, the singer has started just coming to the studio, turning on the microphone, and writing a stream of his thoughts and personal experiences in real time. After that, he and his team select musical accompaniment and the necessary tempo for the future track. Many of his songs have been written in such a way and have become not only favourite hits of his huge army of fans but also the hallmarks of the band. One of these fan-favourites is the track “Нежность” (“Tenderness”), whose official video has nearly 34 million views on YouTube.\nThe producer of the band Mikhail Peleg emphasized that Machete is always working hard on the quality of their music and constantly strives for impeccable sound. Subsequently, during long rehearsals, they experiment with new genres and styles. Fans will get to experience this new sound soon as this year, the musicians will be organizing tours in support of their new album. The first track from this album is called “Небо – мой дом” (“Sky is My Home”), and in this song, Machete fans will hear a vivid musical transformation of the whole group.\nNowadays, people are sorely lacking music that is understandable and deep in meaning,andmost contemporary performers, according to Yaroslav, the Machete soloist, are focused on material rather than spiritual values. Therefore, many musicians do not even try to make their work more meaningful. As an artist, Yaroslav believes that personal development is necessary for each of us, but especially for musicians. Music not only contains ancient knowledge but also transmits huge energy that can be used for this vital purpose of personal growth.", "year": "2019-09-25"}], "artist": "Dave"}