{"artist": "King T", "songs": [{"image": "https://images.genius.com/9237fb9d9d02dfa6ba7044be1eb6cced.599x601x1.jpg", "title": "Ya Better Bring a Gun", "year": null, "album": "The Ultimate Collection Vol 1", "lyrics": "[ VERSE 1: King Tee ]\nThey live on the street and they hustle for fame\nSome kill for a livin, some sling cocaine\nBecause it's now a lifestyle and a full-time job\nAnd if you live in Compton, it's like at McCobb\nFrom block to block everybody's bad\nAnd if you don't know where you're at, then your life's been had\nCause they walk in the street with intentions to meet\nSome sappy lookin punk with Fila on his feet\nAnd if you try to act tough, well Mr. Tough, you're through\nCause everybody's a family, if not, they're a crew\nI'm here to give some advice advice (Run!)\nCause if you're ever in Compton, you better bring a gun\n\nYo, here come my homeboy Mixmaster Spade\nMan, what's up, man?\nHey man, ain't you from Compton, man?\n(Ah yeah)\nAlright man, tell em what's up, man\nWhat you used to do\n\n[ VERSE 2: Mixmaster Spade ]\nI used to cut up the beat on the two turntables\nNow I'm rappin on the mic, cause I'm willin and able\nWhen I'm on the mic I take no slack\nAnd everytime that you see me I'm tearin a gat\nI got .380s and .22s\nYou messs with me, I'm gonna bust on you\nI got a .357 and a M-16\nThey call me Master Spade, and Tee's the King\nNow Compton is the city where the homeboys stay\nRollin in a different car everyday\nCan't roll too hard, gotta watch my back\nCause if I don't, I just might get jacked\nNow Compton is a city of a lotta fun\n(Can't walk down the street\n(Can't walk down the street\nCan't walk down the stree without my gun)\n\n[ female voice ]\nNow you know this just don't make no kinda sense\n\n[ VERSE 3: King Tee ]\nNow the next place is kinda risky if you're walkin with your mother\nY'all can get shot if she wears the wrong color\nThey're all from the old school, nobody's modern\nThe place I'm talkin 'bout is the Nickerson Gardens\nYou can get away with murder, cause they murdered the cops\nCause they said they tried to run a bumrush on Watts\nBut they took control, slingers walk real tall\nWhile real down gangbangers write their set on the wall\nIf I was you I wouldn't visit here, it's like hell\nAnd if you get robbed, who you gonna tell?\nI'm only here for advice advice (run!)\nAnd if you're ever in Watts, you better bring a gun\n\n[ VERSE 4: King Tee ]\nNow you got a nice car with a brand-new paintin\nRag top convertable with all-gold Daytons\nYou decide to take a ride down the Crenshaw strip\nYou stop at the Fat Burgers to feed your lip\nYou got your sounds bumpin, playin Zapp and Vibe\nA skeezer comes your way, you say, \"Let's take a ride\"\nSo you're cruisin Crenshaw with her, you're goin to bail\nA brown Cutlass pulls up, they put a gauge to your head\nThey say, \"(Get our your car) if you value your life\n(And leave your money) if you love your wife\"\nNow you're standin in the street lookin like you're on crack\nAnd you say to yourself: I can't believe I got jacked\nYou call the police because your car they stole\nBut when you get in touch with them, they put you on hold\nYour car is gone, nothin could be done\nSo next time you cruise Crenshaw, YOU BETTER BRING A GUN!\n\nAlright, I wanna thank Mixmaster Spade for comin out to rock with me\n(And Greg Mack) the Mack Attack\nAnd I also wanna thank J-Ro and Sweet Tooth for comin out rockin\n(And DJ [Name])\nAnd I wanna thank Scotty D, Cold-Crush Chris\nAnd DJ Pooh, the Hip-Hop Gangster\n(When he say beat em up he don't be bluffin)\nWord\nAnd oh yeah, I forgot somebody\nUnknown!\n\n(Yo man\nWho blew up that McDonald's on Central and Rosecrans, du?)"}]}