{"songs": [{"title": "Ghostrider", "lyrics": "[Verse 1]\nImagine riding in the dark with no heart\nWhere bodies lay and trigger spray paint is an art\nSwamped in it from start, as two depart\nFrom that you're dying to flex\nHead and chest, so protect your life with a vest\nAs I confess deadly sins, born again\nThrough the hearts of murder men\nSince the age of ten been tryin' to stay out the pen\nAnd ain't no friends in the game, they died young\nWhere I'm from you get hung\nIncarcerated while the rest lay numb\nTo Kingdom Come from the ghetto\nI tell the story with more nuts than glory\nFor my peers in purgatory, tryin' not to worry\nGet 'em off in a hurry, back to my ride\nTo the other side, where my homies died\nAnd they mommas cry, get it?\n(Niggas give a fuck if you big)\nThat's how it be but I don't mean no harm\nBut any fool that disagree with me wave your arm\nEnough said, I'm misled walkin' around half dead\nBroke and unfed, trippin' off voices in my head\nThey hollerin' 'bout...\n\n[Hook]\nGhostrider, tell me how you feel\nDo you really got the balls to get your cap peeled?\nThem niggas ain't that real, totin' steel with murder skills to kill\nYou ride for me, I'll ride for you. We'll keep it real, though\nMakin' a key\n\n[Verse 2]\nI pack a pistol when I ride\nHavin' thoughts of suicide and homicide, while my brain collide\nLet it ride on my positive side\nAnd keep flippin' and watch him die\nFeel the negative vibes for set trippin'\nHa ha, see me laughin' like a nickel platin' up\nMad doggin' all of y'all 'cause I just don't give a fuck\nPlayin' it rough with no regards for the law\nAnd they gets the buck and doin' bitch\nLike the last outlaw, fatal flaw\nIn a ball of confusion niggas picture me losing\nWith my back against the wall with no conclusion\nStill refusing to die\nDon't, pretend to fuck, to the murder show\nI'll be liquor step, plan it like you go\n'Cause you never know\nAnd everyday could be your last day\nSmokin' blunts, flickin' ashes in your ashtray\nWith a pistol full of lead, when the light turns green\nSteady trippin' off them voices in my head\nThey hollerin' 'bout...\n\n[Hook]\nGhostrider, tell me how you feel\nDo you really got the balls to get your cap peeled?\nThem niggas ain't that real, totin' steel with murder skills to kill\nYou ride for me, I'll ride for you. We'll keep it real, though\nMakin' a key\n\n[Verse 3]\nI wonder why, I live to see the killers cry\nMuggin' without a tear in my eye\nBut if I die ask my father up in heaven Pop, take me wit you\nI forgive them all because they know not what they do\nJust set me free and let me flee with a smile\nLike every ghetto born child\nEver since a juvenile, been know for liftin', buckin' 'em wild\nWith a murderous style, wonder why\nWanna murder me mama\nWith this delay and misconceptions got me lost in the jungle\nThey say they'll offer me up\nWith those who thump and survive\nThey always light paper and put his name on the wall\nRest in peace here lies the thug\nWho run the  high school halls\nWithout no meaner that fell a victim to a murder cop\nBack in the block\nAfter the bury him and life goes on\nStuck in a daze tryin' to figure out what's right and what's wrong\nSingin' that same song, trying to balance close to the edge\nSteady trippin' off them voices in my head", "album": "My Balls and My Word", "year": "1998-01-20", "image": "https://images.genius.com/1613c69d81c9bbfbbbbe477f2130bb6f.500x500x1.jpg"}], "artist": "Young Bleed"}