{"artist": "Cadet", "songs": [{"title": "Little Bro", "album": "The Commitment 2", "year": "2017-07-21", "image": "https://images.genius.com/5820d2dba0549dbc477fc37bf62ae455.1000x1000x1.jpg", "lyrics": "[Intro]\nAy Yo, can I ask you a question innit? Urmmm whats it… do I know [?] lot innit? And I said “Yeah I know cah, obviously now… you get me shit, all that you got me, all man games and all that rubbish.\" But the reason I say no in a way yeah is cah if you actually think about it, we don’t really know each other that well, if you actually deep it and I barely see you and that innit. But obviously now, keep on doing what youre doing innit\n\nUh, look\n\n[Verse 1]\nLittle bro, little bro, you’re the apple of my eye and like\nMore time when I don’t give up, listen you’re the reason why\nTurned 17 and got an attitude so sometimes talking to you gets long\nBut I need to give you my advice, I don’t call I put it in a song\nSee first things first I apologise. Yeah this is me apologising\nPut your name in stereotype, didn’t even ask you if you minded\nAnd I can't stunt like I know what it’s like, I don’t know what it’s like being my little bro\nBut I need to prepare you for the world, ay look come look here it goes\nYou see first things first when it comes to chicks, don’t run around with your fucking dick\nYeah man that girls gonna hurt your heart, and trust me bro it’s gonna hurt your piss\nBut I’m hoping that you go through it early, Some lessons have to be taught\nAnd don’t worry about that heartbreak bro, you lose them battles to win the wars\nAnd know all these girls ain’t the same, theres bad ones that how it goes\nBut you’re a king so go find your queen, don’t be bitter like your big bro\nSee listen bro, Man have been a wrong'un so heavens gates I may never see\nBut the reason why I’m telling you, 'cause I’m hoping that you’ll be a better me\n\n[Interlude]\nI need you to be a better me. Just be a better version of me you get me. I’ve fucked up bare times man, so just don’t be like your big bro man, be a better version of me man\n\nUh\n\n[Verse 2]\nLittle bro, little bro, be the better one of me\nDo all the shit that I couldn’t do, see all the shit I couldn’t see\nTurned 17 and got an attitude, that’s sports games and a lot of clothes\nBut honestly, I’ll buy you anything because I’m just glad you ain’t on the roads\nBut I still need you to be your own man, while I’m trying to build this legacy\nTo give you a little head start in life so when they see you they don’t think of me\nYou’re my little bro, my big son, my inspiration that’s all I've got\nBut all now I ain’t seen your pops, since I told him that I got *bang noise*\nAnd secondly bro help your mum, there's no time to think about yourself\nIt seems like all she does is moan, but all she’s asking for is help\nIt feels like say she’s on your back, when she walks in it’s like a hurricane\nTo just tidy up before she gets in because that way she can’t complain\nSo I beg you bro just help me out and all that pain I’ll reimburse\nBecause when I make it with this music thing, you and Chana won’t have to work\nYour big bro I’m no role model. I’ve see shit you shouldn’t have to see\nBut the reason why I’m telling you, because I need you to be a better me\n\n(Outro)\nBe a better version of me man. Be a better version of me man, you know I love you\n\nAnd sometimes you might think I don’t love you, but I love you. I swear I love you"}]}