{"artist": "Vakill", "songs": [{"title": "The Creed", "year": null, "lyrics": "I granted my neighborhood immunity\nDuring the Rodney King riots when niggas burnt down and looted they're communities\nInstead I pulled bricks from the walls of my imagination and threw 'em\nThrough the window of opportunity\nEvery studio date booked is a date closer to death procession\nWe in overtime with 0.6 seconds left, possession\nStill life's depth perception begins at the rectum\nSo I'm defecating from opposite ends of the spectrum\nSo, take these gems and stick 'em in y'all (?)\nMy definition of on-point affect hemophiliacs and virgins all in the same\nManner, one prick and it's all over\nAnd you can lick the gun clips\nBut it's a sin to wet me like nun clits\nNone spit, with my ferocity\nI over shadow passion\nTake my brain off safety and watch my Eydeas drop Shells in Blaze Battle fashion\n\n[Hook]\n\"Yo, the spotlight is mine!\" (sampled from Big L - Flamboyant)\n\"So betta get the name right\"\n\"V to the Izzay\" (sampled from Jay-Z - H to the Izzo)\n\"I only want to build wit skill\"\n\"That's what I consider real...\" (sampled from O.C. - Time's Up)\n\nThere's more to Va than sick rhymes invented\nI gas hoes with lines demented\nAt times I'm timid cause\nWhen niggas talk dirty to women\nThat's sexual harassment\nBut when women talk dirty to niggas it's $5.99 a minute\nAnd it's an ongoing living feud\nThe sisters driven, fueled by maxing credit cards and getting jewels\nAnd we motivated by getting screwed\nAnd running up in bitches ribs like Adam in the Indian-giving mood\nAnd we all getting (?); shit, if I was Adam\nEve would have to count my ribs every night to see if I tricked off\nPlease - hoes is like tornadoes\nThey scream when they come/cum, and take everything when they leave\nI give a bitch a warm reception instead of fur\nShould the crazy notion of marriage in my head occur\nAnd lawfully wedded her\nIt's all good, WIFE's an acronym for Wash, Iron, Fuck, Etcetera\n\n[Hook x2]\n\"Yo, the spotlight is mine!\" (sampled from Big L - Flamboyant)\n\"So betta get the name right\"\n\"V to the Izzay\" (sampled from Jay-Z - H to the Izzo)\n...scratches and sampling of \"uh-huh\" and \"alright\"...\n\"I only want to build wit skill\"\n\"That's what I consider real, in this field of music\" (sampled from O.C. - Time's Up)\n\nI surgically carved my niche in the face of adversity\nTill it cursedly inherit Jack-O-Lantern's like scars irreversible\nChicago only get dispersed\nCuz most of us that successfully get our foot in first\nClose doors on those that put in work\nAnd I can count on one hand, how many succeed in this occupation\nOut of a city with a two million nine-hundred and seventy-seven plus population\nNot including fertilized eggs and ovulation from copulation self-mission\nOne reason why the presence of a Vakill and Juice album waits on a record store shelf missing\nThought you knew, niggas here blow-up and move out-of-state\nFuck the share-the-wealth vision\nBlow up or not, I'll never sever my block ties\nMy determination's magnified 800 times over, watch my stock rise\nI'm so against the grain, when I'm dropping shit my toilets flush clockwise\n\n[Hook x2]", "album": "The Darkest Cloud", "image": "https://images.genius.com/f0fa8d572f04773a721576175bcefb21.488x500x1.jpg"}]}