{"artist": "YBN Cordae", "songs": [{"image": "https://images.genius.com/c745ea4fa9e163f061115c6de7fdc488.500x500x1.jpg", "year": "2018-12-31", "album": null, "lyrics": "[Intro]\nYeah, uh\nI said I think I do better\nThat I think I do better\nUh\n\n[Verse]\nWhat is life without love? What's life without dreams?\nWhat's life without goals? Everything ain't what it seems\nWhat's life without friends who remain genuine?\nDon't care about the money or what type of crib you in\nWho can withstand the test of time? As it's a guess of mine\nHere in real life homie, this is not a set design\nNot on TV screens or the magazine covers\nSitting and observing as the travesty flutters\nWhy we gotta beef shit, I'd rather be brothers\nTrips to Tokyo with some Japanese lovers\nLost boy in this world full of hatred and greed\nSee a young nigga make it what they hating to see\nNever complacent I be on the chase for the cream\nCash rules everything but you facing a king\nLet's step up to this parliament, every fucking bar legit\nI know you in denial like an alcoholic father is\nHold up let me pause a bit, nobody is as raw as this\nWord to Jesus Christ I hope nobody ever cross the kid\nDamn, yes men of the main Judas\nBut I will remain as true as my problems I aim through it\nThis that thought-provoking that leave you lost and hopin'\nVoices in my head be lying so my heart has spoken\nRap niggas far from potent, they just out here saying random shit\nHad to drop a classic 'cause I heard they was demanding it\nAnxiety is damaging, but what's the pressure?\nMake that shit that's from the soul but with a touch of effort\nNothing lesser; real love, it ain't nothing better\nI swear I need that real love, it ain't nothing better\nSee what's life without purpose? What's life without verses?\nLost boy in this shit, what's life without churches?\nWhat's life without belief? What's life without goals?\nWhat's life without me? What's me without soul?\nMy God\n\n[Outro]\nI said I think I do better\nI said I think I do better", "title": "What’s Life"}]}