{"artist": "Cam’ron", "songs": [{"title": "Horse & Carriage (Remix)", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "Intro: Silkk (Cam'Ron)\n\nRemix\n(That's right) Silkk the Shocker\nUh, Cam'Ron (You ain't know) No Limit\n(That's right) Untertainment\n(I'm here and there) mo' money\n(I'm here and there)\nYa don't know?\n\n[Verse One: Cam'Ron]\nAye yo I just walk wit' ya'll, I don't wanna rhyme\nI just need talk wit' ya'll\nMamacita, senortia\nI'm lookin' for my wifey\nCats always love me, till they girls start to like me\nThey don't know I'm sheisty, and all my jewels Icey\nTryin' to settle down Ma, stop actin' all fiesty\nCause 'I don't wanna be a playa no more'\nKnow it's soft, but I cam with a 'core\nFor the love of Money, Charli, whoa It Ain't My Fault\nLike Silkk, it's so timid, my trunk, it go wit' it\nThe whole Squad is Terrorin', cats is No Limit\nAnd I'm a diplomat, I'm a diplomat\nWhere my honies at?, where my money at?\nThat's why we act like that\nClak clak clak!, pat pat pat!\nSo all you girls bring your thongs and shit\nDon't front, cause you know what song this is\nJu don't know\n\n[Hook: Wyclef]\nYa don't know what we're going through\nYa don't know the things that Cam is showing you\nWhat we're about to do\nYou don't know\nYa don't know what we're going through\nYa don't know the things these thugs will do to you\nYou and your family through\nYa don't know\n\n[Verse Two: Big Punisher]\nYo, yo\nAll the mami's know me, the Spanish kid wit' the goatee\nIf this was L.A., I'd be a motherfuckin O.G\nYa my taste, thick in the waist, pretty in the face\nDominican race, like my twin Triple Seis\nHot as hell, I'm trickin' in\nShorties sharp as nails, the official chick\nReppin Uptown to Harlem World, where we at\nI'm up coughin in the ambulance\nFrom way downtown, they got the Horses and the Carriages\nFor 40 bucks, you can ride and get ya hug on\nAnother 20, puff lye and get ya crush on\nIt's all love, just like the Bud' when ya hit it\nCause way downtown, you know the fuzz is tryin' to hear it\nSo when ya spark, ya make sure it's in the dark\nAnd most importantly, stay away from Central Park\nCause cops live, just to put away a thug\nBut not today, cause me and my baby in the Cabaret of Love\n\n[Hook]\n\n[Verse Three: Charli Baltimore]\nYo yo yo yo yo yo yo, uhh\nI thought I already barked on cats about Westhaven\nIt ain't work, gotta Scream on cats like Wes Craven\nOwwwww!, they ain't know I hadn't in me\nLike lil' dicks, didn't know they had it in me\nDon't you know don't you know, we pull up from a show\nCam and chrome bag the hoes, I Prada bags all the dough\nAnd caked out, break out, uh\nHorse & Carriage, forced to marriage, been had too many carats\nAnd they ain't know, passin' that down\nWhere I come from\nAsk Jane, that's my dun-dun\nHow we handle them dumb dumb's\nAnd we like, Siskel and Elbert\nWe review cats, thumbs up if they they shit's right\nAnd down if they new jack's\nYou might see Charli, in a Benz or Ferrari\nHennesey or Pacardi, gettin' bent at a party\nBut I flip, be the new face, cover of Trace\nThis the motherfuckin remix, we ain't need no {Mase}\n\nUh huh uh huh\nWe like it (Slikk the Shocker)\nUh huh uh huh (Cam'Ron, No Limit)\n(Untertainment)\n(Mo' money, ya heard me)\n\n[Verse Four: Silkk the Shocker]\nI live life like a thug, cause time's is rough\nConvicted felon; now I like, rhyme for bucks\nBall till I fall, should I say, my time is up\nAnd I cop you diamonds, never diamond cut\nForget the money, cause I could ball with or without the shipment\nAnd I'm down girl, but I could ball with or without the chick\nSillk the Shocker, Cam'Ron, now how you gonna doubt us a hit\n(Must be a car), Miss I could pull you, with or without the six\nNow I ain't the C-E-O, but I ain't far from it\nSo if I ain't far from C-E-O\nThat mean I ain't far from havin' C-E-O money\nCan't discuss what I'm worth, but I'm worth this much\nLike Mantigo, fall back like snatchin' purses for bust\nSo many styles - drop a beat, I'mma drop a hit\nRap game stop for the dope game - and cop a brick\nNo Limit Soldier baby, so watch the talk\nGet lost like ohhhhhhh, \"It Ain't My Fault!\"\nI'm from the N-O, L-I, M-I to the T\nTru my click, Silkk, the Shocker, yeah that's me\nNow look, money I'm tryin' to make it\nBustas I'm tryin' to break, girls is like\nOoh I love Silkk, and then, ooh I hate him!\nCause they can't have me, but I don't look\nI can't afford to live average\nSo senorita, let me walk you to my carriage\nNow I don't wanna settle down, but we can do it like we married\nCheese!\n\n[Hook] - 2X\n\n(*music till fade*)"}]}