{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Verse 1: Akinyele]\nIt's the Ak that rock that freaky beats\nStaying on the job like them niggas home from work release\nI hear rappers talk like they're the hardest\nWell, I be in jails trying to get bails to come over from the real murder charges\nI put you in a hearse, kid\nRock with vanity virgins so fuck her right in the rhyme without the cursive\nHuh, I get illy ripping this shit like a villy\nYou fish ass niggas, you best go free Willy\nI recite paragraphs that'll razor label rappers who bite\nSo I can rip it from their ass to their appetite\nYou not ready for this y'all, nope\nYou silly dopes know that I cut your throats like Stacy Lattisaw\nRugged Man\n\n[Hook]\n(Cause we was up in the prison, prison, prison\nUp in the prison\nRugged Man, what the fuck is going on?\nCome on, word bond)\nWhat the fuck?\n(Rugged Man, what the fuck?)\nWhat the fuck?\n(Akinyele, what the fuck?)\nWhat the fuck?\n(Rugged Man, what the fuck?)\nIs going on?\n(Up in the prison, prison)\nWhat the fuck?\n(What the fuck?\nWhat the fuck?\n(Up in the prison, prison)\nWhat the fuck is going on?\n(Up in the prison, prison)\n\n[Verse 2: R.A. The Rugged Man]\nYo, down with my man Akinyele, rock well east in L.I\nI know the spot well, when we die we go to Valhalla, not hell\nWe vikings, see the way I trill, spit the real shit, don't care about selling\nThat's how shit is, I don't need shit, remix\nLarry Holmes, 81 inches, that's what the reach is\nEat this, lay down, face down, stay down, way down\nIt's too late now, you ain't safe now\nIt's getting crowded as Auschwitz\nYou fuck without shit\nHow's this on some hillbilly down south shit, acknowledge\nRugged Man always bring the wild shit\nI'm sick of big budget videos and shiny outfits\n\n[Hook]\n\n[Verse 3: R.A. The Rugged Man]\nSome people hate us, some people love us\nSee us in the club getting fat bitches' numbers\nI'm scared to get tested cause I never wear rubbers\nThe basics, break it, race kids\nSee us spray kids, dangerousness, dangerousesses\nPeople too scared to walk where we live\nYou got beef, I'm at the crib\nAnd I'll be waiting with my shorts off\nSitting on the porch with the sawed off\nBlow your balls off, you all soft\n\n[Verse 4: Akinyele]\nGuys, you better recognize\nI'm one of the illest lyricists that ever exist\nSo watch your back like Zorro\nI take a toll on your ass like the crown Burrough\nFuck it, I'm thorough\nNiggas better face the facts or get smacked\nIn the face with the gat\nI turned pretty boys into Craig Mack's\nSometime it be's like that\nThe name Akinyele remains a true remaining fact\n\n[Hook]", "title": "What The Fuck", "image": "https://images.genius.com/6c5a71cd1b560bcf519adbe42cf4f4ff.500x500x1.jpg"}]}