{"songs": [{"image": "https://images.genius.com/e399df9f21d61887d873989c807edcfd.500x500x1.jpg", "lyrics": "It's that California Livin', Young Black Brotha\nBoatin' that '73 Chevrolet burnin' rubberrrr\nLike my nigga, Rich the Fact\nNigga it's the Mac in the back of the 'Lac\nSoakin' tact, big indo many clouds of smoke\nMake old school dance when I dip and yoke\nIt's like M-A-C D-R-E\nWay up in KC with the boy Arby\nYeah biatch, it's presidential\nOn the under chronic comin' through in a rental\nI'm undetected, I come protected\nTwo 4-4 pistols, a mask and vest biatch\nDown and dirty, the cuddies call me Curty\nFrom Mark and Leonard to Howard Hurty?\nFrom Missouri don't worry we keep it ragooey\nMD and Luni, from Sac to the Boonies\nWe gangsta niggas ready for some tension\nFool we ain't trippin' we tryin' to keep it pimpin'\nPimpin' what does it mean?\nPaper in my pocket, hoes on my team\nThey call me Coleone thug real McCoy\nI'm a rider bout mine cause trust ya boy\nGet shit crackin' like eggs in a pan on fry\nThis do or die lifestyle got my brain on high\nI hit the city streets mean mug, chip on my shoulder\nYoung punks they mug back but ain't no balls in these soldiers\nI'm in the Mid-West, KC, N-O-K-C\nEvery show, every in-store the hoe framed me\nColeone (got game?) Hell yeah by the pound\nNiggas hate (On my name)\nCause they hoes crack smiles (What a shame)\nPimp nigga how ya do that there\nTalk a bitch up out her check book and the weave in her hair\nI bust rap cats in lips on a square ass nigga\nGetting grub in an old school with a dent in the fender\nMe and Mac Dre bitch stayin' on our toes\nWhat, what, what, what they call me Coleone!\nWe gangsta niggas ready for some tension\nFool we ain't trippin' we tryin' to keep it pimpin'\nPimpin' what does it mean?\nPaper in my pocket, hoes on my team\nWe global, travel the bubble duckin trouble\nDon't make us get the bury body shovel\nWe vicious, dumpin' bodies in ditches\nAnd runnin pimp game on these punk ass bitches\nYeah, I'm the mack of the year like placa bitch\nMy guys they drive by with the best of the clip\nColeone, young creeper flippin shit like chitlins\nRagglin, scragglin, and cappin' I'm a handle my business\nWe dog niggas, straight hog niggas\nWell connected and when we call niggas\nIt goes down, down, bodies bein' found\nGangsta mack shit that's how we clown\nAnd we down, like 4 flex on a f*cked up hoopty\nBig bread and get big head from a fine ass hoochie\nThey call me, nah f*ck it can't waste my time\nNuts hangin like cellulite on yo' grandma's thighs\nWe gangsta niggas ready for some tension\nFool we ain't trippin' we tryin' to keep it pimpin'\nPimpin' what does it mean?\nPaper in my pocket, hoes on my team", "year": null, "album": "Mac Dre’s The Name", "title": "From Sac To The Boonies"}], "artist": "Mac Dre"}