{"artist": "Astronautalis", "songs": [{"title": "Meet Me Here Later", "image": "https://images.genius.com/81fdfca910c475d1405c73c585bd6612.1000x1000x1.jpg", "album": "The Mighty Ocean & Nine Dark Theaters", "lyrics": "Baptized and salt skinned with bitten lips\nI pass by all lost in the sketchy lead\nLines of breadcrumbs retraced for the ride\nBathed in the blue light of perfect American nights\nAmerican nights\n\nFunny ride, lovely night, song sets pace\nYoung lovers sing along through touched face\nTrue love waits in shallow waters under darkened skies\nPreying on handcuffed hands of solid plans and blacked out eyes\n\nWe're killing cowboys left and right again with guilty little trips, recycled cans\nGimme whiskey lips and dirty hands\nEveryone's got a ribbon all of a sudden and a soapbox to stand\n\nStarry-eyed and shitfaced on their plans, let's call the supermodels\nAnd of your fucking favorite bands\nAnd ask them just exactly what they've got planned\nTo save us from our own impending doom\n\nThey were baptized and salt skinned with bitten lipped smiles\nBitten lipped smiles all lost in (all lost in)...\n\"Oh God, how you grow, oh God how you grow.\"\nMeet me here later and we'll make out\n\nThey were broke bones and paint chips\nWith bitten lip smiles, bitten lip smiles and soft hands\n\"Oh Lord, how you shine, oh Lord how you shine.\"\nMeet me here later and we'll make out\n\n[Interlude]\nReady?\nYeah I'm ready\nOK, let's do this then\n\nThe last ones roll bowling balls right down 3rd street\nDoing donuts through the front lawns, keg in back seat\nPaint stained pants, gas huff, make out, and bleed\nMr. Mouthful of bugs has pockets packed with popcorn seeds\nIt cost me nothing, cost me nothing, cost me nothing, cost me\nAssholes all obsessed with spelling\nSweaty out of breath from yelling\nChase them up and down the ceiling\nFuck your bleeding heart\nTake another twenty, buddy\nAll we need is murder money\nCzek swore I'd laugh at anything\n\nThey were baptized and salt skinned with bitten lipped smiles\nBitten lipped smiles all lost in (all lost in)...\n\"Oh God, how you grow, oh God how you grow.\"\nMeet me here later and we'll make out\n\nThey were broke bones and paint chips\nWith bitten lip smiles, bitten lip smiles and soft hands\n\"Oh Lord, how you shine, oh Lord how you shine.\"\nMeet me here later and we'll make out", "year": "2006-05-23"}]}