{"songs": [{"image": "https://images.genius.com/8b85f0ed9200b8df277ffa6a0112e36e.1000x1000x1.png", "title": "IDGAF", "album": "M.O.", "year": "2013-09-30", "lyrics": "[Verse 1: T.I.]\nHold up hold up\nHey you got me more of me on the motherfucking train\nHit the club till the DJ run that motherfucking thang\nGone bout that action shawty you ain't gotta ask\nYe ain't seen king with a bitch if she ain't gotta ass\nMan a nigga be about that game I ran that\nIf I throw over some [?] she ain't my main thang\nWhen I run that rough shit a honey wanna run from me\nCall 911 shawty\n\n[Verse 2: Nelly]\nIf they call the cops on me, IDGAF\nI won't stop no, IDGAF, baby\nBaby girl you should call me tonight\nThem other niggas don't know how to talk to you right\nYou understand what I'm offering right? IDGAF\n\n[Bridge: Nelly]\nShake your thang one time for me, (then repeat, repeat, repeat)\nFill my glass one time for me, (then repeat, repeat, repeat)\nI’m even talkin’ to the girls outside (then repeat, repeat, repeat, repeat)\nShake your thang one time for me, (then repeat, repeat, repeat)\n\n[Chorus: Nelly]\nGirl, let's do it over and over again\nI'm not selfish, bring your friend\nSee the morning ain't up, so repeat\nYou gotta repeat\n\n[Verse 3: Nelly]\nEverybody watching, ho IDGAF\nAin't no way you stopping, no IDGAF\nBaby girl we play that shit\nYou don't like country niggas\nI'ma change that shit\nHomie where is your chick?\n(I'm not telling!)\n\n[Bridge: Nelly]\nShake your thang one time for me, (then repeat, repeat, repeat)\nFill my glass one time for me, (then repeat, repeat, repeat)\nI’m even talkin’ to the girls outside (then repeat, repeat, repeat, repeat, yeah)\nShake your thang one time for me, (then repeat, repeat, repeat)\n\n[Chorus: Nelly]\nGirl, let's do it over and over again\nI'm not selfish, bring your friend\nSee the morning ain't up, so repeat\nYou gotta repeat\n\n[Verse 3: Nelly]\n(Come on, sing it!)\nI got this new whip on and ride it, ride it\nYou sit on top, I be inside it, inside it\nYou know, you know\nLet's go, baby\nLet’s back on the R8 out, IDGAF\nDrop the top throw the deuce we out, IDGAF baby\nShe wanna hang with the turn up crew\nTelling I ain’t no tell 'em when you turn up proof\nCame with it, got my turn on you ‘cause IDGAF\nHold up!\n\n[Verse 4: T.I.]\nHold up\nWould you light that you say you, well what now?\nI park in the pussy now get the fuck out\nEverybody know when I get high it go down\nA fuck I been there once, take and one\nMan the niggas talkin’ all the shit I gotta laugh\nDon't BS’n with your bitch, you know I gotta ask\nI gotta lot of cash, you want some? Well come get it\nLet me eat that pussy, beat it\nThrow it out, I’m done with it\n\n[Chorus: Nelly]\nGirl, let's do it over and over again\nI'm not selfish, bring your friend\nSee the morning ain't up, so repeat\nYou gotta repeat"}], "artist": "Nelly"}