{"songs": [{"image": "https://images.genius.com/5cf926857ea50a9127019d93750f202f.642x642x1.jpg", "title": "Take Off", "album": null, "year": "2013-10-12", "lyrics": "[Hook: Nasty_C](2x)\n(Why they hating on me?)\nI hustle hard and I cake up\nYoung nigga I take charge\nI'm gassed up and I take Off\n(Why they hating on me?)\nMy speakers knocking my bass hard\nMy sneakers rock with no lace on\nI'm gassed up and I take off\n\n[Verse 1: Erick Rush]\nLook, They say you are what you eat, and all I eat is MC's\nAnd each one of them said they were beasting, Now what does that make me?\nI see these niggas is scared, How come ya'll wasn't Prepared?\nMan I thought Einstein explained E=MC squared\nBoy don't stare too long cause your eyes might burn\nIf it ain't about the dough it's none of my concern\nSomeone should have told you not to leave a stone unturned\nAs I hopped up, snuck up, and I stole my turn\nNow it's Rush Hour, I run Howard\nJust kush clouds and blunts showers\nIn Baton Rouge I used to Eddie Bauer\nBumping' Jubilee, What you Know about it?\nI roll a Bla and I \"Take Off\"\nLearn the rules and then break them\nThat's enough to make society forsake him\nBut in due time they'll see it's all innovation\nI started from the bottom, 3rd World Problems\nFleed to the states then we ran into some poverty\n03' Migrated to the YEG\nDropped O-E-N-C-E Took off wit Nasty_C\nWe in M-V-P League, You're not even P.E\nGroupies say Hehe, Then whip out my peepee\nThey wanna get needy but only get CDs\nWhat a pity..Damn\nBet against me then you a shitty gambler\nThey only breed winners in the City Of Champions\nA savage! I'll leave a nigga pissing in his pants where he stands\nI'll embarrass him, Why you think they hating me?\n\n[Hook: Nasty_C](2x)\n(Why they hating on me?)\nI hustle hard and I cake up\nYoung nigga I take charge\nI'm gassed up and I take Off\n(Why they hating on me?)\nMy speakers knocking my bass hard\nMy sneakers rock with no lace on\nI'm gassed up and I take off\n\n[Verse 2: Nasty_C]\nMy bass banging, my pants sagging, my sneakers rock with no laces on\nMy speakers rocking that bass hard, Test me and I'm knocking your face off\nI'm the shit y'all niggas can't wipe out\nWith your chick my nigga, just wilding out\nTest my niggas and you know we finna ride out\nPack that heat, burn skin like iron spout\nI be the illest my nigga I said it\nGrizzly bear grind, y'all niggas just teddies\nI shit and piss on rappers when I record, young nigga tryna be R-Kelly\nNiggas can't test me. I'm godly and I'm hardly all in\nI'm Bobby Lee Swag on the roof and your main artist is my target\nI ball like Spalding\nI'm eye-balling the broad that you calling a goddess\nShe's eye-balling me back\nAnd I beat that obese ass with my T-rex while bumping my t-racks\nAnd I eat rappers for breakfast, I rap fast till my head aching\nI'm god nigga, slow down boy, you're gonna break fast like egg and bacon, I swear\nI'm ruthless, so fly I can trip and fall where the roof is\nAnd the truth is I'm stupid but the groupies give me brain like an A-class student\nAnd they make excuses as to why they ain't as sick as the kid, y'all fake hoes\nI'm a young nigga, I'm 16, about to murk niggas\nTake note while I take off\n\n[Hook: Nasty_C](2x)\n(Why they hating on me?)\nI hustle hard and I cake up\nYoung nigga I take charge\nI'm gassed up and I take Off\n(Why they hating on me?)\nMy speakers knocking my bass hard\nMy sneakers rock with no lace on\nI'm gassed up and I take off"}], "artist": "Nasty C"}