{"songs": [{"year": "2013-10-25", "album": "S.C.O.T.", "image": "https://images.genius.com/84085e89142cb021fb85634062e40a2b.700x700x1.jpg", "title": "Bible 4 My Enemies", "lyrics": "[Intro:]\nKerser\nI'm just chilling in the studio with Nebs\nYou know turch\nNever know you down like this, Look\n\n[Verse:]\nABK heard that clique\nEven coppers getting stomped squashed at the gigs\nI've learned a lot in the last past five years\nI can get your brain shot grab your mum wipe tears\n'Cause when you make it to a certain success\nYou got the boys in the street who want to come with you, yes\nSo in order for that, that's how they're paying me back\nTo fuck you up on any circumstances, play with me lad\nThis ain't a gangster act, not by any means\nThis the bible for my enemies\nI'll leave a legacy behind they can blame me\nThe first Oz rap to bring the street to the mainstream\nAnd I ain't main stream, but it's strange see\nAs many people sussing that seem to play me\nNinth wonder of the world, you can lock it in\nRead the bible, even close it says I'm gonna win\nSays I gotta win, you a ought to been\nI'm a fresh motherfucking rocking solid bling\nYou won't understand if you ain't come up like I did\nThat's why we laughing when these young-in's fucking biting this\nI'll have a stub nose put to your grub nose\nPlan the shit perfect even coppers thinking \"fuck knows?\"\nMy boys crazy and they wiling out\nIf you diss me man I hope that they don't find you out\nYou'll be six feet under that's a final round\nAnd I don't give a fuck if you want vinyl sound\n'Cause we group up and we learned in a violent town\nNo disrespect but this shit ain't the 90s now\nThis a whole new era I'm the king of it all\nYou gotta move with the times or get evicted and walk\nWe gonna bully all these rappers cos they softer than a waterbed\nSaid you wanted war instead, man you should've thought ahead\nStreet shit, backed by the best\nX on your chest, hacked to your death\nKers, Rates, ABK and a bunch o' 'nother cunts\n225 signing out, didn't think we running up what's up?\n\n[Outro:]\n[?] 225\n[?] ... sickest cunt out there\nIf they spit a diss to Kers [?], fuck 'em\n[?] maximum security jail\nAnd what?\nCunt we hate these fuck wits\nBitches 225\nAll the way"}], "artist": "Kerser"}