{"artist": "Willie D", "songs": [{"year": null, "lyrics": "[Verse 1]\nFuck Rodney King in his ass\nWhen I see tha mothafucka I'mma blast\nBoom in his head, boom, boom in his back\nJust like that\nCause I'm tired of you good little niggas\nSaying increase the peace and let the violence cease\nWhen the black man built this country\nBut can't get his for the prejudiced honky\nRodney King, god damn sell-out\nOn TV crying for a cop\nThe same mothafuckas who beat the hell outcha\nNow, I wish they would've shotcha\nCause this shit is deeper than Vietnam\nAnd ain't no room for the Uncle Tom\nLet the white man dress you up and mess you up\nI wouldn't be surprised if he sexed you up\nCause you look like a gay\nLetting them white folks tell you what to say\nBut I'm glad that niggas stayed out of check\nCause that's the only thing rednecks respect\nWe don't want your welfare checks\nNigga need a real job to buy a Rolex\nAnd until we get it, we gonna keep throwing them things\nFuck Rodney King!\n\n[Hook]\nFuck'em, fuck'em, fuck'em, fuck'em, fuck'em, fuck'em\nFuck that nigga!\nFuck'em, fuck'em, fuck'em, fuck'em, fuck'em, fuck'em\n\n[Interlude]\nNow the Negro National Anthem:\n\"We shall overcome\nWe shall overcome\"\n\n[Verse 2]\nFuck all that singing\nI'ma be too busy swinging\nThat's the problem with the black folks\nAlways wanna bust a note\nAnd hold hands and form rallies\nAnd down niggas for fighting back in Cali\nI'm down with the niggas who's nexting\nFuck all that god damn protesting\nSo don't try to pull it\nFifth Ward niggas fight bullets with bullets\nRight between the eyes\nSo you can keep your mothafucking Nobel Peace Prize\nI said fuck Rodney King and I mean it\nAnd any mothafucka out there who resent it\nCause didn't nobody set a fire for Willie D\nWhen the laws beat the fuck out of me\nFuck Rodney King!\n\nFuck'em, fuck'em, fuck'em, fuck'em, fuck'em, fuck'em\nFuck that nigga!\n\nFuck'em, fuck'em, fuck'em, fuck'em, fuck'em, fuck'em\nFuck that nigga!\n\n[Verse 3]\nFuck that mothafucking sell-out ho\nThey need to beat his ass some mo'\nFool talking about stop the violence\nWhen niggas can't even shit in silence\nI can't ride up the street with my homies without 5-0 all on me\nRiding my tailgate and running my god damn license plate\nSweating Willie D since I'm a minority\nThey fuck with me, I still got a lot of grudges\nIt's high time that we take out some judges\nAnd some congressmen and senators who cheat us\nAnd all of these so called black leaders\nLike Craig Washington, nigga sound dense\nTrying to play both sides of the fence\nBrown nosing cause he was chosen\nBy the whites to make niggas act right\nYou can't lead the black struggle\nAnd be friends with the enemy, mothafucka\nWhile you trying to keep your fucking job\nBlack folks getting robbed\nBut when it's time for the revolution\nI'ma click, click, click, fuck this rap shit\nCause money ain't shit but a grief\nIf you ain't got no peace\nGotta come on with it, get down for my little Willies\nSo they con come up strong and live long\nAnd not to be scared to get it on...", "image": "https://images.genius.com/99c31136e48907dfc450b10677d10058.400x397x1.jpg", "album": "I’m Goin’ Out Lika Soldier", "title": "Rodney K."}]}