{"songs": [{"image": "https://images.genius.com/65c28c46b1de126581120a8f4784c7e0.300x297x1.jpg", "title": "Errtime", "album": "The Longest Yard (Music From and Inspired by the Motion Picture)", "year": "2005-03-15", "lyrics": "[Intro: Jazze Pha]\nLadies and gentlemen, ladies-and-gentlemen\nThis is a Jazze Phizzle, producshizzle\n\n[Hook: Nelly]\nYou see, errtime the beat go (beat go), I need you to shake that thang girl\nYeah, errtime the beat go (woah, woah, woah, woah)\nYou see errtime the beat go (beat go), I need you to break that thang girl\nYou see errtime the beat go (woah woah woah woah)\nWon't ya, break it down, break it down for me\nDon't run out of gas girl\nBreak it down, break it down for me\nDon't run out of gas girl\n\n[Verse 1: Nelly]\nSee his hat cocked, can't see his eyes, who could it be?\nWith the blue STL on, who that but me?\nWho else behind the tints of the new GT?\nThe continental all blue got them feeling real blue\nTill they stomachs stick too, for real, they grossed out\n19's I come, 22's poke out\nJust to see when they roll out, I'm killing the folks now\nHis money just +Chingy+, my money it fold out\nMan, this happened Vegas, and they hit me for a mil' worth\nHow many rappers man can tell you what a mil' worth\nAll my life damn worrying bout a meals worth\n\n[Hook]\n\n[Verse 2: Jung Tru]\nDeafer than Jermaine, you can say that I'm So-so\nPlayer Taylor Made, that's a no no\nSure it a Aftermath, but I ain't a doctor\nSquad full of B.G.'s, city full of them choppers\nWay more game than the kid in the G-unit\nCracks by the gram an hour, that's a G-unit\nLike Ciara when I'm kicking them +Goodies+\nCause I'm Jazze like Pha with a tank in the hoody\nI'm like...\n\n[Verse 3: King Jacob]\nYeah, better make your mind up\nAin't see her by now, you ain't go find her\nShe looks good, but she looks finer like (woah *4X*)\nYeah, King Jakob you ain't gotta know me\nBut you soon will, cause you gotta know me\nGot that type to make your mama OD\nLike (woah *4X*)\n\n[Hook]\n\n[Verse 4: Nelly]\nOkay, now let me see you do it baby\nDon't be, afraid go now\nDon't be, ashamed of how you do it just\n(Woah *4X*)\nSee I'm tired of playing games\nWith niggas with money names\nFor real, money you lame\nI put you money to shame\nThis ain't cynical\nThis ain't subliminal\nI'm physical, financial, and mental to be a general\nWhy, lil mama case you want a (Soldier!)\nNot the type that's in a tank but in a (Rover!)\nYeah man you at the game ordering refreshments (where you at?)\nI'm on the floor watching my investments\nButtoned up some call it grown up look\nI like to call it having money that fold up look\nThat Don Perignon, Cristal cold up look\nGot her (woah woah woah woah)\n\n[Hook]"}], "artist": "Nelly"}