{"artist": "Big Daddy Kane", "songs": [{"lyrics": "Mmmm, mmm, mmm!\n\n..\n\nMy my my my my my my my my\nThis must be what you call, love at first sight\nWhen you commit yourself to someone\nAnd don't even know wrong from right (wrong from right)\nLooks like my feelings been united with you baby\nBut maybe just a little bit too soon\nI realized that hearts get broken, sweetheart\nI couldn't stand the wound (can't stand the wound)\nSo I put mines in your hands girl\nAnd it's all yours my dear\nBut you got to be gentle, cause it's fragile see\nThat means handle with care (handle with care)\nHeh, reminisce on how I first met you\nYou remember -- backstage at my show\nI thought that I was the star until I saw you\n(but I did not love her) (I did not love her)\nEscapin from the crowd to be alone witchu\nCause I had oh so much to say\nAs we sat down in my dressin room girl, huh\nAnd just talked the entire night away\nFrom that moment on I felt that I knew you\nJust like the back of my hand (I love you, I love you)\nLoved you like I never loved another (I loved you)\nAnd dreamt of bein your man\n\n*sung* How would it feel? To be your man? (2X)\n\n..\n\nJust think of the first time that we went out to the movies\nWhen we went to see that picture\nIahhhhhh, I was the on the first thing smokin\nJust to fly that head to getcha (I gotta getcha)\nAnd what about the time that I called you long distance\nOn my car telephone (and I was alone)\nNow that's what I call reachin out to touch somebody\nAt a million dollar zone\nBut you see, it didn't matter sweatheart, nah baby\nCause I'd call Mars for you\nClimb the highest mountain to be by your side\nWord to MOTHER, cause my love is true (my love is true)\nGirl, if you could just understand (try to understand)\nAll the things that I'd do\nJust for the sake of me, Kane, bein your man\n\n*sung* How would it feel? To be your man? (2X)\n\nDo it to em Blue Magic!\n\n*sung* How would it feel? To be your man? (2X)\n\nSo whatchu sayin baby?\nSo whatchu sayin baby?\n\n*sung* How would it feel? To be your man? (2X)\n\nCan I be your man? (I'll be good to you)\nSo good to me..\n\n(I'll be good to you)\n\n*sung* How would it feel? To be your man? (1X)\n\nC'mon girl, yeah, yeah (be so good to you)", "image": "https://images.genius.com/e5112b31d8bd715b9e736175eff672d9.1000x1000x1.jpg", "year": "1989-09-19", "title": "To Be Your Man", "album": "It’s a Big Daddy Thing"}]}