{"songs": [{"image": "https://images.genius.com/5735f357bf630e06a450f1aebacee90b.968x968x1.jpg", "year": "1999-01-01", "lyrics": "Akrobatik - “SayYesSayWord”\n[Emcee(s): Akrobatik]\n[Producer(s): Akrobatik]\n[Scratches: DJ Sense]\n[Interpolates: Micranots - Preparations\"]\n\n[Intro: Akrobatik]\nYo, yo\n\n[Hook 1: Akrobatik and (Samples with Scratches by DJ Sense)]\nNow if you loving hip hop, say, “Yes” (\"Yes, yes”)\nAnd if you feeling hip hop, say, “Word” (“Say, ‘Word’\")\nSay, “Word,” if you love it when a nigga grab the mic\nAnd kick some shit that you was glad you heard (“Word up”)\nNow if you loving hip hop, say, “Word” (“Word\")\nAnd if you feeling hip hop, say, “Yes” (\"Yes\")\nSay, “Yes,” if you love it when a nigga grab the mic\nAnd every time he do, the shit sound fresh (“Yes”)\n\n[Verse 1: Akrobatik]\nYo, I must initiate lyrical inertia\nThe type that'll coerce ya to elevate your shit\nI devastate your situation, build and destroy\nWhen it comes to Satan, I kill and enjoy\nI chill and employ the tactics of stretching\nEmcees’ minds like prophylactics, turn methods of meaning\nIntergalactic.  Right now, they think too locally\nSo when they grab the steel, they tend to bullshit vocally\nOld-school like rotary phones and Roto-Rooter\nBut, still, I got the vision for the future (Aight?)\nYo, I shoot to fill heads—dreads or otherwise\nCheck it as this brother rise over these other guys\nWho smother lies all in your face—fuck that!\nI'm bringing skills back to where the previous sucked at\nNo time for slacking during the verbal slaughter\nThe sharks swim the other way when I'm in the water\n\n[Hook 1: Akrobatik and Samples with Scratches by DJ Sense]\nSo if you loving hip hop, say, “Word” (“Word\")\nAnd if you feeling hip hop, say, “Yes” (\"Say, ‘Yes’\")\nSay, “Yes,” if you love it when a nigga grab the mic\nAnd every time he do, the shit sound fresh (“Yes”)\nNow if you loving hip hop, say, “Yes” (\"Yes”)\nAnd if you feeling hip hop, say, “Word” (“Say, ‘Word’\")\nSay, “Word,” if you love it when a nigga grab the mic\nAnd kick some shit that you was glad you heard (“Word”)\n\n[Interlude 1: Akrobatik and Samples with Scratches by DJ Sense]\n[Akrobatik]\nDope shit.  Yo, check it out, yo\n[Samples with Scratches by DJ Sense]\n“Come on and, come on and just” - Sample from [?] - “[?]”\n“Come on and, come on and just” - Sample from [?] - “[?]”\n\n[Verse 2: Akrobatik]\nYo, the outcome's already determined.  This joint\nIs burning whoever it's concerning, so start learning\nFor this type of shit, hip hop fans is yearning\nAs the world keeps turning, respect I keep earning\nSending sonic waves to the globe's four corners\nReaching happy, carefree kids to war mourners\nSupporter of the cause to uplift the craft\nSo the average emcee can't fuck with the half\nThe illest scientist can't fuck with the math\nOf the rugged Black Avenger on a mission like Shaft (Yo)\nYou could check the graphs, statistics, and percentages\nThey all say that Akrobatik's style is what vintage is\nBreaking down integers to fractions.  Brothers hear\nThe facts, then ask when Akrobatik's coming back in\nNo time for slacking during the verbal slaughter (What?)\nThe current swims the other way when I'm in the water\n\n[Hook 1: Akrobatik and (Samples with Scratches by DJ Sense)]\nSo if you loving hip hop, say, “Yes” (\"Yes”)\nAnd if you feeling hip hop, say, “Word” (“Say, ‘Word’\")\nSay, “Word,” if you love it when a nigga grab the mic\nAnd kick some shit that you was glad you heard (“Word up”)\nNow if you loving hip hop, say, “Word” (“Say, ‘Word’\")\nAnd if you feeling hip hop, say, “Yes” (\"Yes, yes\")\nSay, “Yes,” if you love it when a nigga grab the mic\nAnd every time he do, the shit sound fresh (“Yes”)\n\n[Hook 2: Samples with Scratches by DJ Sense] (x4)\n“Yes” - Sample from [?] - “[?]”\n“Word” - Sample from [?] - “[?]”\n“Word up” - Sample from [?] - “[?]”\n\n[Outro (Overlapped with Hook 2): Akrobatik]\nWhat?  Yo.  Yo, yo.  Say, “Yes.”  Say, “Word.”  Say, “Yes.”  Say, “Word.”  Yo, this shit is absurd, uh.  Yo, yo, yo.  Mmm", "title": "SayYesSayWord (Clean)", "album": "SayYesSayWord / Militant Raw & Live"}], "artist": "Akrobatik"}