{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/8ada2910bdaab0ce3196f9ccd706d775.500x500x1.jpg", "title": "Gotta Eat", "year": null, "album": "View From Masada", "lyrics": "Masada\n2000\n\n[ VERSE 1 ]\nMy .44 calicol will silence y'all souls, Masada\nThe ghost of the most prolific writer\nUpon my death bed I roast in fire\nSee my most desires\nSmell the smoke from my flesh as my ghost rise up\nHear the voices of 100 choirs\nAnd angels looking down at my body attached to wires\nPriest kissed by the widow spider that spit saliva\nI write for lifers and boxers at Rikers\nI write pain\nBlue ink replaced the blood in my veins\nThug in this game, flooded up rings\nCluttered up change, quick to pop a slug in your brain\nIf you a killer, then slugs we exchange\nWe like the mobsters, bullet shells and choppers\nCop cars and road blockers, they tryin to knock us\nCatch us duck behind the bitches, d's tryin to pop us\nOn CBS News while the world watch us\n\n[ Chorus ]\nI do this shit for my thugs\nI do this shit for the chicks at the club\nI do this shit for the niggas that I love\nI do this shit for the streets, cause a nigga gotta eat, luv\t(2x)\n\n[ VERSE 2 ]\nI write theories that's motion pictures, y'all hear me?\nI spit it clearly to roast y'all niggas, feel me?\nGangster, life of a don my icon\nSling on my right arm, rubber grip tight in my left arm\nBody suited with teflon, it's Brooknam\nRaise a eyebrow at the child, respectfully bow\nPay hommage, gold studs in my garment\nHot slugs miss me cause I'm God-sent\nIf it hit me, it's God's wish\nNo man taketh a life, I'm late in the night\nCatch me in the hood shakin the dice\nContemplatin a heist\nSome say my team is Satan's alike\nCartel, pop shells till our heart fails\nBrooknam, a.k.a. Roswell\nClappin at the spaceship\nBitches with fake tits\nAt nightclubs\nWe live the life of a true thug\n\n[ Chorus ]\n\n[ VERSE 3 ]\nI feel a holy spirit comin on me\nMy lifestyle: based on a true story\nRead the credits: name appears alphabetic\nOn clear film with no edits\nMasada bleedin in the hands of medics\nPriest, I live it epic\nSpoke on records, majestic\nPhysique: I stand six feet\nObserve my posture, my click's deep\nDirector's edition, just listen\nThe words breathe on my sheet, I write a novel\nSpeak on behalf of every slain apostle\nMy slang's hostile, say my name as gospel\nMasada, pop 2 through the confession booth\nDon't say nothin, pull my weapon and shoot\nBullets wettin their suits\nHerut's lady put death in my shoes\nCats die violent in war, silence the .4\nThe fall slow motion, seen the silent applause\n\n[ Chorus ]"}]}