{"songs": [{"title": "Cold Summer", "album": "The Port of San Francisco", "year": "2019-04-10", "image": "https://images.genius.com/3cd4d264fc905b591e7a6c56f3fb1dd7.1000x1000x1.jpg", "lyrics": "[Intro]\nHey, hand me that lighter\nAlright, yeah\n\n[Verse]\nOn my way to Costa Mesa (Costa Mesa)\nTrunk full of heels (Heels), pocket full of Franklins (Franklins)\nStay for a week, after that, hit San Diego (San Diego)\nMan, another day, another quaalude (Sock it to me)\nRidin' by my lonely (To the neck)\n'Cause one thing I don't need is more fake homies (Groovy)\nA flight to Miami (Yeah, baby)\nTouched my first ten thousand in Miami, understand me?\nWhy you think I like mojitos? (Man)\nFlight to Puerto Rico (For real)\nIt was me and Wayne, no matter what, that's my bro-bro (I love you)\nTimes got hard, bagged it up and then we sold those (Yeah)\nK-9s hit the train, I'm thankful they didn't find those (Thank you so much)\nThey lookin' down on me (Yeah, they lookin' down on me)\nMy son three months, I turned to that fast money (Damn)\n30 days in the rental (The rental)\nReno, Tahoe, L.A., let's get it (Yeah)\nThen hit the tri-city (Tri-city)\nMan, Jersey, Philly, D.C., she with it\nIt was nothin' like that feelin' (That feelin', swear to God)\nTwo-piece at 19, sent the uh on the doubles\nNow we out in Santa Cruz (Santa Cruz)\nOrder some pancakes from Denny's (Man)\nBaby bustin' a move\nFive hunnid, that's cool (Good job)\nYour first car, that's smooth (Yeah, baby)\nI really came from nothin' so I'm humble with it\nMake the right move, don't stumble with it (Stumble)\nLife get crazy, I just rumble with it (Rumble)\nI ain't goin' out like a bitch, I want it, I'ma get it\nI ain't stressed out by a chick, it's way too many\n\n[Outro]\nYeah\nFor real, nigga\nCold summer\nCheck it out\nCold summer\nIt's way too many\nMan, yeah\nCold summer (Now y'all feel my pain)\nCold summer\nUh, groovy, yeah baby\nUh, you're doin' good\nNumbers, uh, groovy, man\nAyy-ayy-ayy-ayy"}], "artist": "Larry June"}