{"artist": "Iggy Azalea", "songs": [{"title": "Just Wanna", "lyrics": "[Intro]\nWe were paired up, and she actually thought of me\nThought of me enough to decide that I was the guy she could trust for the whole fun-ness of her party\nShe wanted to fuck me, she wants my dick (Ah, push it)\n\n[Chorus]\nI just wanna fuck\nAh, push it, ah, push it\nI just wanna nut\nAh, push it, ah, push it\nI'ma put this pussy on your face\nAh, push it\nOpen up boy, come and get a taste\nAh, push it\nI just wanna fuck\nAh, push it, ah, push it\n\n[Verse 1]\nThey call me big Iggy, and I’m a bit freaky\nIf he hit it, then he love it, there's a big reason\nI'm tryna take a ride, I’m on the dick speedin'\nCan you come and lay some pipe? 'Cause my shit leakin'\nI'm tryna bust it open, I ain't strip teasin'\nIf we fuck, we stuck together like pits breedin'\nWhen I put it on his face, I think he quit breathin’\nLike \"ah\"\nSweet Jesus\nBreak him off proper, booty like a model\nMake him give me head, medulla oblongata\nI take care of my business, let me move into the office\nMake me hush, I’m doin' too much talkin’, baby\n\n[Chorus]\nI just wanna fuck (Fuck, fuck, fuck, fuck, fuck, fuck)\nI just wanna nut (Nut, nut, nut, nut, nut, nut)\nI'ma put this pussy on your face\nAh, push it\nOpen up boy, come and get a taste\nAh, push it\nI just wanna fuck\nAh, push it, ah, push it\n\n[Verse 2]\nI can tell that you want it by the way that you want me\nGo on and put on your saddle, I'm 'bout to hop on the pony\nWhen we fuck, I’ma go in, I be screamin' and moanin'\nYour face like a litter box, I put the pussy right on it\nI am not tryna cuddle, so don't get caught in the moment\nI'ma need you to kill it, then after, send your condolence\nWhen it come to pleasin' you, baby, I'm really devoted\nThen like a skeleton, we need to be bonin'\nI'm tryna tell you, I'm a freaky ass, nasty muhfucka\nAnd if I let him hit, then he a happy muhfucka\nAnd when I throw it back, you better smack it, muhfucka\nI grab his hard drive and then I hacked the muhfucka, baby\n\n[Chorus]\nI just wanna fuck (Fuck, fuck, fuck, fuck, fuck, fuck)\nI just wanna nut (Nut, nut, nut, nut, nut, nut)\nI'ma put this pussy on your face\nAh, push it\nOpen up boy, come and get a taste\nAh, push it\nI just wanna fuck\nAh, push it, ah, push it\n\n[Interlude]\nHey, so did you bring a condom for tonight?\nYou brought a condom with you?\nYeah, I figured I might as well, you know\nI bought a little bottle of spermicidal lube, too\nBut you laughed at my face when I said I'd be having sex tonight\nYeah, that doesn't mean you shouldn't\nJust always be prepared, you know?\nYou didn't even bring a condom?\n\n[Outro]\nAh, push it, ah, push it\nAh, push it, ah, push it\nI'ma put this pussy on your face\nAh, push it\nOpen up boy, come and get a taste\nAh, push it\nI just wanna fuck\nAh, push it, ah, push it", "image": "https://images.genius.com/73a5ae3e7c0b2ad0252755badae63f8f.1000x1000x1.jpg", "album": "In My Defense", "year": "2019-06-28"}]}