{"artist": "King Los", "songs": [{"image": "https://images.genius.com/8e90feefe2d222694fac72b208976a5a.750x750x1.jpg", "title": "Ghetto Boy", "year": null, "album": "God, Money, War", "lyrics": "[Verse 1]\nI got that, B-More in me yeah that's my problem (what what)\nI rep my city, yeah bitch I got em (na-na-na)\nFuck what you heard, niggas be wildin'\nYou got me fucked up, I'm from the bottom\nOh yes lord! Walk like I'm pimpin, talk like I'm mackin'\nThe projects love me, yeah boy what's happenin'\nI'm finna kill em, I'm finna kill em\nI'm on a hunnid, I done hit the ceiling\nI'm thinkin fuck these bitches, we go for dollars\nAnd my brothers keeper  bitch and Nino at The Carter\nThe equalizer bitch I'm deeper, wiser, handsome, smarter\nThey call an ambulance they ass don't stand a chance in Sparta\nOh no no! I'm out the west side, just ask my grandma\nI used to move the pack, had a pack of blamma\nMy niggas stacked with AKA's and ain't no Kappa Gamma\nAnd now we laughing to the bank like na-na-na-na\nFuck with me!\n\n[Hook]\nNo sunshine or feeling better (the ghetto)\nWatch em all scatter they'll kill each other (the ghetto)\nIf yo daddy dead, can't make him proud in (the ghetto)\nDamn little boy, how you make it out of (the ghetto)\n\n[Verse 2]\nI got that hustlers desire, that fire burning\nI got that Boyz n The Hood mixed with that higher learning\nNa-na-na, niggas is bugging, niggas ain't fucking with me\nThey not on my planet, why should I panic, motherfuckers should be\nThanking the lord that I'm building the ships\nSo you niggas won't drown in the midst of the flood\nCuz I'm giving you prophecy\nNiggas ain't watching me properly, bitch I be switching it up\nLike a gear on a bike, play if you want\nSay what you want, hear what you like\nBut take what you need, cause they dear to your life\nFake if you want, I'll be there on the flight\nLike, free my ghetto cause we the ghetto\nReal boy, cut the strings, we don't need Geppetto\nThey say there's levels to this shit, well you can't see my level\nThis a reach, you would need the devil, he would need a shovel\nBitch I'm deep, all I beat is odds\nAll I get is that, at least I know\nAll I need is God, and I can bridge the gap, Keyshia Cole\nOMG, he's so cold, I know it's me, at least I'm told\nLos bring rap back to life, this shit needs some soul!\nYou can ask my grandma\nI roll because I miss my dad, you can ask my mama\nThey shot my nigga in the head, ain't no happy camper\nNow I'm the best rapper alive, na-na-na-na-na-na\nFuck with me!\n\n[Pre-Hook]\nLost souls and dope fiends (the ghetto)\nFrom what we're told there ain't no kings in (the ghetto)\nGun shots and caution tape (the ghetto)\nWhy is an honest dollar so hard to make in (the ghetto)\n\n[Hook]\nNo sunshine or feeling better (the ghetto)\nWatch em all scatter they'll kill each other (the ghetto)\nIf yo daddy dead, can't make him proud in (the ghetto)\nDamn little boy, how you make it out of (the ghetto)"}]}