{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/c347081c7afabbcba96aea0847886344.758x738x1.jpg", "title": "Can’t Stop the Shine", "year": "1998-10-20", "album": "Roots of Evil", "lyrics": "[Production by Kool G. Rap]\n\n[Miss Jones]\nDon't you know that G Rap's straight thuggin\nAnd you know you can't stop the shine\n\n[Kool G Rap]\nUhh, uhh\nKool G Rap, Underworld, Illville\n\n(Whatcha gonna do, whatcha gonna do?)\nWhattup, whattup, whattup\n\nUhh, uhh\nDaddy Bigbucks, got the forty-five cal' tucked\nGiovanni style tux, see the Cristal erupt\nBe up at the bar what? Diamonds, carved and cut\nThe sluts get starstruck wonder if the car's what\nThe new BM, rimmed up, the Navigator truck\nFeet be like skinned up in only gator stuff\nFor fly mami get hemmed up, she got the Jada cuts\nThese cats pushin they lens up, they can't hate enough\nThey countin what I spend up, already made enough\nTo live plush, you must eat out a fat plate of mush\nGot what you lust, the Bulgari smothered with slush\nYours covered with rust, diamonds studded with dust\nMine flooded with crush, rides big as a bus\nThirty-two plus, what can you and your crew do to us\nBut look in disgust, plot to seize the shinin sea\nFrom coppin the V-T-W-E-L-V-E\nPissed off at G's but we don't believe in knockin knees\nWe cock and squeeze, and leave some shit shot and breeze\nAttractin these chicks mixed, black and japanese\nAnd slappin these nitwits, with fat stacks of G's\nBag your rat, she should lack, grabbin the back of threes\nOn her knees, see more semen than all the seven seas\nShe goldminin, lookin for new fashion designin\nRings with rocks blindin cause my world started shinin, uhh\n\nChorus: Miss Jones and G Rap\n\n[MJ] Whatcha gonna do, whatcha gonna do?\n[GR] When you see mines and can't stop the shine\nSippin wine from up a little grapevine\nToo much ice up on the wrist to tell the time\n[MJ] Whatcha gonna do, whatcha gonna do?\n[GR] When you see me up in the 6 with a dime\nYeah, chicks of all kinds, mad concubines\nWill you cock the nine and sneak me from behind?\n\n[Kool G Rap]\nMy jet leaves, down to the beaches in the West Keys\nWith jet skis, only sex G's, with S-E's\nAnd Lex G-S-3's, cheese to bless G\nBaguettes be the ice makin my neck and chest freeze\nVietnamese, Tibetan G's with wet beads\nIn sets of three, breasts in 3-D that slept with me\nThe sexy, beauty of the week of the ? G's\nBangladesh G's, on the other side of the Red Sea\nThe lefty, sippin Remi inside the Pepsi\nJew-els shinin, holdin down what you fell behind in\nMink shit with silk linin, penetrate right through\nYour hymen, handle a nine like I'm Lex Diamond\nOrganized crimin, bank rolls yeah we get those\nFly clothes, slip those, spot foes then we hit those\nThe whole click glow, click the sickoes\nWith the chick-o's, hit the ones with the six-oh's\nHollow tops spit those, let the dough pile\nLeave no profile, drama wild leave you layin Castellano style\nWith ? llama cows, whole click be kinda wild\nOn a mission, get the death kiss end up missin\n\nChorus w/ variations to end"}]}