{"artist": "Yukmouth", "songs": [{"album": "Godzilla", "image": "https://images.genius.com/06ce9a2ae3e7a9474fcfc10e00a00df9.500x494x1.jpg", "year": null, "lyrics": "(feat. Nyce & Who'z Who)\n\n(Yukmouth)\nHey girl what you doin? (Wooooooh)\nYou busy? (ooohhh)\nWell let a nigga come kidnap you, ya dig?\" (ohhhh)\nScoop you up take you on a lil' adventure, ya dig? (Yeaaaaaaaaaah)\nAiight I'm commin round\n\n(Verse 1 – Yukmouth)\nShe said her nigga used to scoop her at the boxer\nTake her for shrimp and lobster (uh-huh)\nRock her wrists out but bitch he ain't a mobster\nYukmouth your best friend your lover and your father\nThe baller, I'll be the first to fuck you in the prowler (that's right)\nHuh, I ain't gon call ya like them niggas that jock ya\nBitch I ain't gon follow ya like niggas that stalk ya (uh-huh)\nHuh, I give ya space, call me up just to rock ya\nKnock ya boots break ya off proper\nGet loose ya head doctor\nLet me kidnap you, hold you for ransom\nNo holdin' hands or romancin' just fuckin' to this anthem\nPoppin champagne bottles and then some\nI'm a boss like Tony Dense and money make me handsome\nThe coup make them wanna fuck a nigga on the fluke\nAnd them jewels make them bitches pop that Gucci like glue\nSo what you wan do? Barbeque a meal do?\nI'll wheel through; steal you for a night, what's the deal boo? (Whooo oh oh)\n\n(Hook – Who's Who)\nLet me take you away to ecstasy (Baby)\nBaby done where you wanna be (ooh yeah)\nLet me kidnap you\nLet me kidnap you tonite (c'mon baby)\nDo everything you wanna do (c'mon baby whatever you want)\nI jus wanna spend the nite with you (baby)\nLet me kidnap you (yeaah)\nLet me kidnap you tonite (ooohhh)\n\n(Verse 2 – Yukmouth)\nShe said her nigga used to take her to the tropics\nAll of the diamonds flawless\nPrada boots he copped it, Gucci shoes he copped it\nNow, switch the topic\nYou like the chronic or that hypnotic or ex pills, let's get it poppin'\nI have you dancing topless don't stop it\nDropping of that chronic, hypnotic its only logic\nI put it deep in ya stomach and make you run from it, cum from it\nThe pun ani get crushed like pun done it\nYa man, ya husband, ya dude, ya fiancé\nNeed to cherish you; you got an ass like Beyonce\nA face like Mya a body like Free\nTits like the queen bee with tattoos like eve, Bo!\nYour man a geek he borin' out, tourin' out\nScoop you up at 3 in the morning ridin something foreign\nAnd get ya wetter than rain wen its pourin'\nI bang, bang, bang till six in the mornin'!\n\n(Hook)\n\n(Verse 3 – Nyce)\nWell it's the heartbreaker, Mack makeup and mark\nJake up at the large paper and spill ya pockets for me boss player (???)\nI make em floss now make em think they'll toss later\nTake me shoppin' for jew-ells and minx in Las Vegas\nI cause paper Nyce-tee ain't a bimbo\nI drive the Benzo the back seat is where ya friends go\nPedal to the metal in Gucci stilettos\nI will punch the shit out-a bitch I'm still ghetto\n22 inch mo mo's them other hoes is so so\nMe nolo trim's Louie bag colourful logo's\nHah, federal niggas is a no no\nI can't stand you hobo's\nSo step it the fuck up if your doe low\nYour hoe, your bitch, your wife, your fiancé\nNeed to cherish you you got more whites than libera chi\nSo let's pretend like we both got nobody\nLet's hop in the Ferrari and jump start this party\n\n(Hook)", "title": "Kidnap U"}]}