{"artist": "Fam-Lay", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/9127665738535e7306181973e9c0b9b9.356x237x1.jpg", "lyrics": "[Intro - Lil Jon]\nYeah! Yeah! Yeah!! Star Trak!!\nYeah! Yeah! ah BME Clique!!\nYeah! Hey! That nigga Fam-Lay bitch!\nYeah! Yeah! Lil Jon and them East Side Boyz!!\n\n[Hook - Lil Jon & (The East Side Boyz)]\nPussy nigga won't ya (STEP THE FUCK BACK!!)\nBitch nigga won't ya (STEP THE FUCK BACK!!)\nYou're too close nigga (STEP THE FUCK BACK!!)\nWe'll bend ya back nigga (STEP THE FUCK BACK!!)\nPussy nigga won't ya (STEP THE FUCK BACK!!)\nBitch nigga won't ya (STEP THE FUCK BACK!!)\nYou don't want it nigga (STEP THE FUCK BACK!!)\nI take bigger niggas (STEP THE FUCK BACK!!)\n\n[Verse - Fam-Lay] (Lil Jon)\nFam-Lay don't give a flying fuck\nWhen I see him, time is up\nNext time his family see him, his eyes are shut\nUh! Fuck a heads up, whachu scared for?\nYou'll be a dead duck riding in that flat bed truck\nUh! Let em go? (NO WAY!!) Lil Jon let em know (OOOKAAYYY!!)\nSoon as you say it I'm a said it\nHe getting scared when I spray it in this dead end\nHe gon be dead in a second, uh\nLet em run cause my legs in the Jetta so\nRun nigga run, you'll only die tired\nThem dum dums come, you're done and I'm not lying\nTec nines rain like a shower head\nThen put your whole crew remains on the flower bed\nDistribute pain, gun power spray\nUh! Leave your blocks in flames then we outta there\n\n[Hook]\n\n[Verse - Fam-Lay]\nStand and clock, while I supply planted rock\nMy hand is hot, but hotter when them cannons pop\nThe gamblest spot, I breaks em, grab dice and shake em\nLet em go, 4 - 5 - 6, dead em go\nS-T-A-R Trak, dot com (Star Trak)\nGot guns, got bombs, that make ya act calm\nLeave ya whole neighborhood like 'Nam\nBring the thunder and the rain when I strike like light-ning\nGot a Puerto Rican chick wit a white mom\nChick trifling, chick like cum\nAnd I'm often asked, I'm out for cash\nMotherfuckers kill, we playing hard\nWhile y'all soft as ass\nChew you up, screw you up, do you up\nI DON'T GIVE A FUCK nigga! who the fuck?!\nWant beef wit the F-A-M, L-A-Y?\nI keep shit burning like the LA riots, tell his guy\n\n[Lil Jon] I told y'all niggas to step the fuck back!\nNiggas ain't listening in this motherfucker!\nSo we gon show y'all how niggas set this shit off for real!\n\n[Fam-Lay]\nFam-Lay'll leave you wit a holy temple\nNow you rest in peace in a Holy Temple\nNigga didn't know what he was in for\nAll my bullets hit everyone they was meant for\nMan it's time to notify all his kin folk\nMailing out letters that you had to write in pencil\nMy condolences, East Side on the side of me\nAnd I'm a ride till them niggas get tired of me\n\n[Hook]\n\nSTEP THE FUCK BACK!!", "title": "Step Back"}]}