{"artist": "Wax", "songs": [{"year": null, "lyrics": "[Intro: Excerpt from Price is Right]\nFemale contestant: \"Gentlemen, do I have at least one number right?\"\nBob Barker: \"OH - ah... Was that a horn? No number right... Not. One. Number. Right. That has never happened before, y'know!\"\n\nYeah, in fact I do know, Bob...\nMan, these rappers remind me of that kid that falls off the log on YouTube into the creek\nCheck it out, uh\n\n[Hook]\nAll we do is inhale, exhale\nWe succeed while y'all motherfuckers fail\nIt's as easy as breathin' for me to combine with the rhythm\nEOM, I'm thinkin' that it's time that we hit 'em with the..\n.. The price is wrong\nWe're thrice as good and been doin' this for twice as long\nWe're 'bout to go skiing in Vail\nWe succeed while y'all motherfuckers fail, FAIL\n\n[Verse 1]\nAyo, I been making music ever since I was a mini tyke\nSince Bob Barker started rockin' skinny mikes\nSpent many busy nights tryna get it tight\nRappers tryna give advice, but the price isn't right\nI heard your shit on facebook, I didn't like\nIt made me navigate to a different site\nYour rhyming is terrible, you ain't spittin' right\nYour timing's unbearable, man, your rhythm's white\nBetter take that test and get that GED, sir\nYou could still be a substitute PE teacher\nYou will never be as capable as me and E were\nAt thirteen\nYou are hurting\nI'm asserting my point using evidence that you provided\nI've come to the conclusion that you are too misguided\nMusic ain't somethin' everyone can supply well\nYou are an F TO THE A TO THE I, L\n\n[Hook Version 2]\nAll we do is inhale, exhale\nWe succeed while y'all motherfuckers fail\nIt's as easy as breathin' for me to combine with the rhythm\nEOM, I'm thinkin' that it's time that we hit 'em with the..\n.. The price is wrong\nWe're thrice as good and been doin' this for twice as long\nWe just got accepted to Yale\nWe succeed while y'all motherfuckers fail, FAIL\n\n[Verse 2]\nWe took a shit where the Grammy red carpet starts\nSo all the celebrities left our skidmarks\nWe did the fuckin' national anthem at the Superbowl with armpit farts, man\nWe set trends...\nYou ain't shit, follower\nAs a kid you were a paint-chip swallower\nHow does lead-based fire-engine red taste?\nYou were forced to sniff glue and were fed paste\n'Til you were dumb and delirious\nDon't let it get you down\nYou're just young and inexperienced\nI've gripped hold of a few more mic stands\nI spit cold like a blue Coors Light can\nYou must've fell from the Fail Tree\nAnd hit every branch\nYou like a fat girl ordering heavy ranch\nOn her fried chicken salad with a diet coke\nWhen pressure's on every time you choke\n\n[Hook Version 2]\nAll we do is inhale, exhale\nWe succeed while y'all motherfuckers fail\nIt's as easy as breathin' for me to put rhyme with the rhythm\nEOM, I'm thinkin' that it's time that we hit 'em with the..\n.. The price is wrong\nWe're thrice as good and been doin' this for twice as long\nJust got a million dollar check in the mail\nWe succeed while y'all motherfuckers fail, FAIL\n\n[Hook]", "image": "https://images.genius.com/6f0817252fcc664558dc80369900bc26.320x320x1.jpg", "album": "Scrublife", "title": "FAIL"}]}