{"songs": [{"year": "2010-02-07", "image": "https://images.genius.com/bc0d5e581a1e57fb3922cd6b074f0397.472x471x1.png", "title": "Resurrection", "album": "DJ Soul Tribute", "lyrics": "[Intro]\n\nI'd rather be a dead man\nAnd go out of this world as a man\nThat stood for something\nThan to bow down like a dog\n\n[Verse 1: Big Punisher]\n\nI know you heard the stories\nPun's a killer\nOn a search for glory\nThe Heavens cursing on me\nThat's why I'm stuck in purgatory\nNiggas bore me with rough raps\nMy shit is truly for the cats that bust gats\nWhere's the noise, where my thugs at?\nWhere my dogs at?\nWhere my love at?\nWhere my squad at?\nWhere my motherfucking nigga Joe the God at?\nReady for combat, being long-strapped, long gat\nNow disarm that, physically, making contact\nWe the wrong cats, you don't bark at\nBetter spark that, walk that, lock that\nTrigger pump, cock back, park that, pop that\nRight where the heart at\nTake the Glock, like make sure I don't pop that\nYou don't want that\nThat's the final chapter\nFeel you spinal rapture when I rip through your vinyl\nLike a rhymin' raptor\nI'm the Cappa like Don\nI'm not a rapper I'm on\nA fortified killer from the back of the Bronx, What!\n\n[Interlude: Big Punisher]\n\nFirst album\nI let everybody know who the nicest, you know what I'm sayin'\nNow we take it to the next level, the whole world know who the nicest, know what I'm sayin'\nNow you know, we finally get our due, you know what I mean?\n\n[Verse 2: Big Punisher]\n\nFuck all y'all non-believers\nI roll with God, the squad n' TS\nOut with the BS, we platinum, they even doubted Jesus\nNiggas is 85%, I'm 400 solid\nBrain-bolic with knowledge, cock-diesel scholars\nHoldin' it down\nWalkin' around with gold by the pound\nFrozen and drowned with diamond boulders, all in the crown\nTalk of the town\nSoakin' you down with toasts 'til you drown\nGhost you and grind your corpse with a force that'll open the ground\nSave the jokes for the clowns\nI'm on a serious tip\nYou keep playin'-\nAnd I get furious quick\nAnd I'll take you for a walk through the ghetto\nYou either spark your metal\nOr get outlined in chalk by the devil\nI rep' the borough that mothered this rap shit\nI used to clap shit\nNow I just lay back and mack on some mack shit\nI used to have to pack a Mac in the back of the Ac'\nNow I relax and stack platinum plaques in my shack\nIt's like that, but don't think I won't counter-act\nMy niggas is strapped\nAnd quick to lay a bitch on his back\nI'm swift with the Mac, quicker than Kung-Fu\nWith the reflexes of a cat, and the speed of a mongoose\nStupid!"}], "artist": "Big Pun"}