{"songs": [{"title": "Came Up Pt. 2", "album": "Good Job Larry", "year": null, "image": "https://images.genius.com/370d4ac4ef482ad0445cf73fb72bfc4f.600x600x1.jpg", "lyrics": "[Intro]\nShit!\nAye Aye aye\nDamn\nGot damn\nYes lord\nSock it to me\nYeehee!\n\n[Verse 1]\nI don't save hoes, not a captain\nBeat the pussy up I got it clappin\nBitch done fucked up my damn mattress\nVersace covers bitch I'm really mackin\nAt the farmer's market strapped with the cannon\nYou never knowing when this shit could happen\nI was playing the net you was playing Madden\nBroke your baby mama for a hundred thousand\nI know I hurt your feelings bruh my bad\nYou wanna beat the bitch up real bad\nI serve them papers to him but he still calling\nThe bitch chose up now he hella mad\nI'm in New York but I'll be gone tomorrow\nAll I know is ball, bitch I'm cashing out\nShe be like \"I knew June when he was in high school\"\nBitch shut the fuck up I'm balling now\nGot a bad bitch making egg whites\nBitch looking like a Tommy Hil model\nI just left the Bay, I'm on Fairfax\nI'm finna take a job, she finna go tanning\nShe like why you never call\nAye sweetie, hand me that Palm Pilot please, thank you\nI don't shop at malls (GOD DAMN)\n(I don't shop at malls)\n\n[Hook]\nMy cell phone ring\nAnd I got the text\nI just made a touch down\nI just made a touch down\nHe told me it was good\nDidn't need to know the rest\nI just made a touch down\nI just made a touch down\nI done came up\nI done came up\nI done came up\nI done came up\nI done came up\nI done came up\n\n[Verse 2]\nChoppa ringing like a doorbell\nPyrex got the coke smell\nI hit the Henny then I fishtail\nThen check my phone another brick sell\nFuck the bullshit bitch I got a type\nI ain't just fucking anything\nBaby I can get your credit right\nThen put a Range Rover in your name\nI'm a big tipper, Bimmer dipper\nEverything organic got these niggas in they feelings\nGot the ho the new Balenciaga's told the bitch you fucking with a real one\nTwo hoes took my bitches for a hike\nWe gon chill today but we gon trap tonight\nTwo bands for my Specialized bike\nEating sushi sipping fine wine\nCrab meat in my wontons (scrumptious!)\nBefore I ate I had to hit the blunt\nSwagger on a hundred million thousand\nThat's why these bitches steady choosing up\nIt's a nice day I took the bitch for lunch\nMaybe your ex was, but I'm not in love\nBitch I got a plan, we can make some bands\nFlip it to a million, god damn\n\n[Hook]\n\nSock it to me!\nYeeeeeeheeeeee!"}], "artist": "Larry June"}