{"songs": [{"lyrics": "[Intro]\nDoll, Eskimo, ayy\n(BankRollGotit)\n\n[Chorus]\nI'm so icy, I'm so uh, I'm so icy\nI'm so icy, I'm so uh, I'm so icy\nI'm so icy, I'm so uh, I'm so icy\nI'm so icy, I'm so uh, I'm so icy\nI'm so icy, diamonds on my neck and wrist, they pricy\nI'm so icy, VV tone, my shit biting\nI'm so icy, bitch, get back, you know you don't like me\nI'm so icy, niggas wanna cap, you niggas just hypebeast\n\n[Verse 1]\nI'm so mothafuckin' icy, these diamonds on me biting\nThese niggas won't excite me, it's flooded so the time freezed\nTen for the fit, no cap, ain't gotta shoot, all the gang goes zap\nShould've made a livin' cookin' niggas for the camp\nI'm so icy 'cause it's them\nBitches want my Glock\nThrow that shit back, let me take off my socks\nBeat up the pussy then beat up the block\nRidin' with killers, bitches ridin' with the ops\nAyy, ayy, I'm so mothafuckin' icy\nBitch I'm icy, I'm so mothafucking icy\nIce, ice, ice, ice, ice, rollin' the dice\nBet on lil' Asian, I'm winnin' the fight\nPut in my hands, you can build tonight\nBitch, in your head, it was light\nBitches be choosin' dykes\nRunnin' the game, you rat, nigga, mice\nFuck with my stacks, them I'm beatin' him twice\nForeign was rented, I wrecked at the light\n\n[Chorus]\nI'm so icy, I'm so uh, I'm so icy\nI'm so icy, I'm so uh, I'm so icy\nI'm so icy, I'm so uh, I'm so icy\nI'm so icy, I'm so uh, I'm so icy\nI'm so icy, diamonds on my neck and wrist, they pricy\nI'm so icy, VV tone, my shit biting\nI'm so icy, bitch, get back, you know you don't like me\nI'm so icy, niggas wanna cap, you niggas just hypebeast\n\n[Verse 2]\nIcy Lambo in the driveway\nGirl, I ran my bands up, you ain't have it my way\nBend that shit over, the back of the back\nYoung nigga hungry, he eat with a strap\nCame with a thottie and left pack\nDon't how to act, I gotta jugg you for that\n\"Ayo, Asian, you ain't Asian, why you actin' persuasion?\nWhy you be dubbin' niggas daily? Ate me up, left 'em crazy\nWhy you be actin' like you made it? Bitch, we know we in danger\nWhy you dropped out just for the wigs?\"\n'Cause I'm so mothafuckin' icy\nIce, ice, uh, uppin' the price\nBitch, she bad, she from the hood, uh, roll the dice\nForeign tinted, you the tenants, ayy, niggas mice, ayy\nCount my guap, then whip the pot, ayy, drip on ice, ice", "album": "So Icy Princess", "year": "2018-10-17", "title": "So Icy Princess Intro", "image": "https://images.genius.com/041218418233476d7ebce34aad3d3544.1000x1000x1.jpg"}], "artist": "Asian Da Brat"}