{"songs": [{"image": "https://images.genius.com/6bb3e1691f3789354cba18fb4b109a8d.640x640x1.jpg", "year": null, "lyrics": "[Produced by Chris Calor]\n\n[Hook: Kembe X]\nI got ten hoes on ten hoes\nBeen throwed off indo\nThe Benzo's a fishbowl, no tints on my windows\nGettin' chose by them hoes\nMy sis knows from En Vogue\nThese blunts can't get no bigger\nI'm doing hoodrat shit with my niggas x2\n\n[Verse 1: Alex Wiley]\n44's I'm tippin', big blunts I'm splittin'\nThese bitches be bitter, heard me spit, now she strippin'\nCause this Village shit too hittin', and you know we gon' grind\nIn your lovely crib with your lovely bitch, but I hope you don't mind\nCause I'm ridin' 'round with my dick out, Toyota Prius is tricked out\nYo' grandmama taking me shopping, she's buying whatever I picked out\nAnd you know The Village gon' stick out like a sore thumb, bitch I'm goin' dumb\nHotboxing the whip, ain't stoppin' for shit\nWhen you hear the fucks, then you know what's up\nYou ain't down with that money team!\n10 Honda Civics, parked outside\nFuck Whoopie G for 100 Gs? Hit me up, Whoopie, I'm 'bout that life\n'Bout that life, thick than a motherfuckin' Snicker\nAll I wanna do every day of my life is hoodrat shit with my niggas\n\n[Hook]\n\n[Verse 2: Chance the Rapper]\nGet off, sick cough, hit licks, don't get caught\nKidnap like Jigsaw, Big Meech, bitch, I'm Rick Ross\nGot a odd to the liquor, got a Swisher to the weed\nThat's that Save Money militia till my niggas rest in peace\nHit that Zan, that's my dance, that's just Chance rappin' raps\nIn the land with the fam, and my man's super slapped\nThrowing bands in the stands to my Stan's, them my fans\nThis for real, this for free, this for playing at the trap\nGood God, them good raps, you gave up for them hoodrats\nBeen a Long Time, since Hey Ma'cause you burned down on your good shit, like Fuck is You Tahmbout?\nTrill niggas still switchin' lanes, lil' niggas still hit them stains\nReal niggas still hit them bangs\n\n[Hook]", "title": "Mo’ Purrp", "album": "Club Wiley"}], "artist": "Alex Wiley"}