{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Verse 1: Beanie Sigel]\nAshes to ashes, dust to dust\nIn other words, he shall live but die you must\nInstill your faith in ever whom thy trust\nInstill your faith, get crushed my a man like such\nDon't let them niggas gas you up like Sig is, but\nSig the shit, but far from ass\nStop the blood clot crying, the pain shall pass\nBut for now meet the reaper and feel thy rath\nGreen as the grass shall be on the other side\nAnother lie told to you by old blue eyes\nBlue is the color of deception, so my recollection\nNow you're lost with no direction\nI'm a stand up man, I stand on my own two, firm\nWhy fool never learn? Play with fire, get burned\nBut my word you don't trust it, now it's too late once you touch it\n\n[Verse 2: Young Chris]\nUh, Young C, SP, yo\nI love my niggas for life, ain't no doubt about that\nMy nigga Free, nigga Crack, throw a shout for Mac\nOschino and Sparks, them niggas my heart\n(insert lyric) Kept them one hundred from the start\nHOV prop, we was fresh off the block, like what?\nCame at Nas, came at The LOX, ain't give a fuck\nWhoever came at big homie had a problem with us\nSee we was all we knew, in Roc-a-fella we trust\nNow this bullshit split up, fucked the whole shit up\nKnocked us back to scratch, how the fuck we get back to that\nNiggas need you big homie, gotta get back to rap\nI mean, facts is facts, 16 you had my back\nNow we back corner to corner, niggas laugh at that\nSeeing me firing the streets, how you ain't mad at that?\nLet alone niggas plan my demise, tough love\nBig homie you ain't stand by my side. How can I (run to the ROC)\n\n[Verse 3: Omillio Sparks]\nIt's death before dishonor and I'm a fucking rider\nFlicking my middle finger to all the corporate liars\nJuelz can feel the fire, cause he's a fucking traitor\nI'm far from a hater, I never been a liar\nMy fucking youngest riding, it's like they let us suffer\nMaking they skins thicker, making they circle tighter\nAnd they ain't relying on us, to get them out the gutter\nSee what I want for myself, I want for my brothers\nCalm as a mother fucker, and ya'll some fronting niggas\nI'm trying to feed my babies, ya'll trying to starve my siblings\nI ain't received the cheques since my boy Mac was sentenced\nLaw sent us back, what's your personal business\nNow we back in the trenches in this hurting position\nImagine me in the kitchen somewhere working the dishes\nYou get your wish if you ever planned my demise\nTough love, big homie you ain't stand by my side, how can I (run to the ROC)", "image": "https://images.genius.com/ab96938fb9e7942e0247017db33b339d.316x316x1.jpg", "year": "2009-09-01", "title": "Run To The ROC", "album": "The Broad Street Bully"}]}