{"songs": [{"year": "2003-08-12", "image": "https://images.genius.com/bfa643a9b092649cde87d123dc281f11.500x500x1.jpg", "title": "Steppin’ Out", "album": "Mutant Mind Frame", "lyrics": "[Intro: Sleepy Brown]\nMirror Mirror on the wall..\nWho's the freshest of them all, Baby?\nOooooh..\n\n[Chorus: Sleepy Brown]\n(We're Steppin Out!)\nFeeling good with the smoke just like I would\n(We're Steppin Out!)\nDon't really care long as you and I are there\n(We're Steppin Out!)\nCause we're on the scene\n(We're Steppin Out!)\nWith the gangsta lean\n(We're Steppin Out!)\nYou wanna be on my team?\n(oooOOohhh ooooooh, We're Steppin Out!)\n\n[Verse 1: Bigg Gipp]\nMirror, Mirror, Mirror\nTell me what do you see?\nMy face, I.D. emilio pucci's\nPants by Gucci, cordoroy chucks, cordoroy cap\nPresidential smoking the strawberry wrap\nSo chilly my reaction to my presence, like Burrr\nMinks, lambskins, gorillas, the fox furs\nWhatever the flavors that she would like to see\nI'm a Doctor peep me in my Fruit of my D's\nOff in my closet alone with my favorite cologne\nThat I condone I'm ma skeet skeet skeet skeet on\nFresh feet on so much candy on my boat\nYou can eat on the hub\nPut my heat on the wood\nSpeed on, is good\nTonight there will be no commercials or re-runs\nJust coolin sipping freon\nTalking to my folks on the phone on the freon\nTakin my favorite rocccck whenever we steppin ouuut\n(We're Steppin Out!)\n\n[Chorus: Sleepy Brown]\n\n[Verse 2: Big Gipp]\nYou wanna meet the authentic\nThe way I walk it, the way I talk it\nThey can't be ready\nMy hat bent smoke scent blueberry scent\nEither I'm a B.R.O. or your mind just moving too slow\nGipp..\nFlip it at best give it right back to you in gifts\nAs I slide peering out the doulley wop window\nChecking out the talk that walk the sidewalk\nAs I critique the streetbeat on this street called\nBeatstreet\nOl boy yall killing me what will it be\nVisions of level 3 or one tweezzy\nCatch 'em breezy sometimes its just too easy\nStar struck to eager to please me\nShould I play pimp make 'em pay feezy\nStraight fucking 'em up leaving these crows dizzy\nWithout a doubt you see me\nBigg Gipp Steppin Out I'm the king to the city\n\n[Chorus: Sleepy Brown]\n\n[Verse 3: Big Gipp]\nNo matter the cost still floss ross\nPost up charlie trading post\nButtondown dickies hips still squeaky\nPost fly ladies in them 240 E's now oooh weee\nIf the world could see me really how it be\nSo cashmatic acromatic then when I proceed\nLet it subseed, bungalow overseas\nKeep an attitude like Dame Dash look at that ass\nI can't, let that pass not that fast\nAnd I ain't spending no cash I bring color to the outside\nGo head and decide unlock your car doors\nAnd let a G-Ride that stay sit\nNow I'm on the inside let's slide\nSpare a doobie for the jacuzzi\nMe and my new fluzy\nThat's how I put on thats what I'm talkin bout\nThe lights and the phone off finger snap\nThat's a wrap\n\n[Chorus: Sleepy Brown]"}], "artist": "Big Gipp"}