{"artist": "AZ", "songs": [{"title": "Live Wire", "image": "https://images.genius.com/f7164c7711f98cbf75acb3b0f523d851.744x728x1.jpg", "album": "A.W.O.L.", "lyrics": "(AZ talking)\nYea ok...motherfuckers wanna be gangsters now huh\nThis how we gon do it\nEverybody thuggin now right...ok\n*gunshots*\n\n(Verse 1- AZ)\nThis is that thunder five mossberg AR shit\nPearl handle black leather glove rubber grip\nBuckshots hollow heads front cover shit\nI'm on some other shit laying on the mothership\nAdvertised as a street wise Malaika\nFeastin the Allen I's you beef and you paralyzed\nTeddy P pumpin out the GT\nIn 93 niggas had it jumping in DC\nA lot of dickriders got amongst us slipped by us\nBit a lot of shit but this is how you spit fire\nGut stroking four pound on the duck broking clutch toting\nHush or get your face bust the fuck open\nFrom floor level to the ice pebbles in the bezel\nFrom pedal bikes to them Teterboro flight shuttles\nStyle sicker big quench through the Nile River\nNow verbally versatile when I deliver nigga\nSnuffing, I'm hip hop all day\nUsed to hustle in the hood heavy, knock off trays\nHad to scuffle for my blue Gazelle's ?cop door shades?\nHow ya'll niggas gon fuck with the A?\n\n(Chorus)\nThis is that thunder five mossberg AR shit\nPearl handle black leather glove rubber grip\nCrowbar gem star on some other shit\nMy niggas love to flip never on that sucker shit\n\n(Verse 2)\nI rep rap for my niggas up in Cossack\nFor ya'll crab niggas this is how you clap back\nBlack beretta hot barrel like Miami weather\nHomocides late 80's early 90's ever\nNiggas crime together get a run get time together\nNever minor league I breed a different kind of cheddar\nChilly chill now chump fix your silly grill\nShit is still a fuck around and tell me how the semi feel\nI'm on some Farrakhan Conrad Elijah shit\nFrom the bottom pit forming my conglomerate\nA young dominant pro black Communist\nAnonymous been rhyming since released on my recognizance\nNow greater, 2 felonies later, the heat melody maker\nThe streets heavily favored, player\nPretty chicks clean kicks whips, creased in the jeans\nMy self esteem's like Idi Amin\nFor the cream I'm like Hakeem the Dream puffing my green\nGuaranteed to get a ring for the team\n\nI rep rap for my niggas up in Cossack\nGreen in comstop? knock with they last pack\nSingin nap nap them kings they clap back\nI'm just a fiend trying to bring this rap back...\n\n(Chorus)\nThis is that thunder five mossberg AR shit\nPearl handle black leather glove rubber grip\nCrowbar gem star on some other shit\nMy niggas love to flip never on that sucker shit\n\nI rep rap for my niggas up in Cossack\nGreen in comstop? knock with they last pack\nSingin nap nap them kings they clap back\nI'm just a feen trying to bring this rap back...\n\n(Chorus)\nThis is that thunder five mossberg AR shit\nPearl handle black leather glove rubber grip\nCrowbar gem star on some other shit\nMy niggas love to flip never on that sucker shit\n\n(Beat w/ gunshots til fade)", "year": "2005-09-06"}]}