{"songs": [{"lyrics": "[Steele]\nFeel this, feel this\nBrooklyn's in the house\nBrooklyn's in the house\n\n[Verse 1: Steele of Cocoa Brovas]\nS-T, Supreme Teacher, read you like a preacher\nSeat you down, make you pay close attention to my ether\nMy aura illuminates, removin' the snakes, who lay and wait\nLovin' to hate, but we still elevate\nMassagin' the brain, utilize the wisdom contained\nThrough the knowledge of my circumference and how to maintain\nSome nights I, walk with the understandin', build cypher\nLike Charles Bronson, vigilante ready to snipe ya\nIgnite the marijuana, roll a cigar from Havana\nTony Santana, smokin' in the Coco Cabana\nOr in the sauna, after doin' my calisthenics\nUniversal metrics, reversin' the hex, cursin' the sexist\nAcceptin' my blessings, rememberin' my lessons\nTake my dog's suggestions when he told me keep my Smith & Wesson\nFor protection, the streets is watchin', and they testin'\nThey know when you're frontin', and when you're representin'\n\n[Hook]\nIt's not where you be, or how you be\nOr who you be, or what you got\nUnique sounds, grounds is hot\nWe comin through, we tidal waves in this rap shit\nNow how you be, now who you be, and where you be?\n\n[Verse 2: Afu-Ra]\nYou wanna get, with, the brothers that's the illest?\nThe microphone, have sex with my lyrics\nHit shit off, first move is doggy style\nNo premature ejaculation, last for a while\nFlippin' and turnin' and splittin' it, all type positions\nGrabbin' and tuggin' and yokin' it, all type of missions\nCrazy - nah, I'm not that type of brother\nMy verses, when they out in the streets, they carry rubbers\nI heard you're drippin', your rap style got gonorrhea\nExploitations of nations, look at this, it's here, yo\nSeven days around the clock ass all in the videos\nI know you like it, I do too, love the cheese, yo\nBut this is Hip-Hop, stop it, go make a porno\nNot player-hatin', on the mic, I'm player-scrapin'\nNobody seen it, whole eons change to zeniths\nI bounce styles that's sexual, plus I'm intellectual\nThoughts transverse to physical, I keep it spiritual\nI got the motts, you bust the dutch, I got the hydro\nI just sit back on tracks and let it flow\n\n[Hook]\nIt's never where you be, or how you be\nOr who you be, or what you got\nUnique sounds, grounds are hot\nWe comin' through, we tidal waves in this rap shit\nNow how you be, now where you be?\nWho you be?\n\n[Verse 3: Tek of Cocoa Brovas]\nI give you agony, agony, agony, you wanna rump with me?\nConstantly, constantly, constantly, rollin' a Phonta leaf\nYou know it's beef, when you gettin' stomped losin' teeth\nBecause you sweet and you ain't got no claims to the street\nYou'se the type to get shot and go explain to the cops\nCome to court every day, make sure a nigga get locked\nBut I thought you had that big Glock, that you bust a whole lot\nThen why my nigga's sittin' up, in that little cell block?\nI'm tellin' ya, ock, the world is a spot for snid-akes\nNiggas who hid-ate, do anything to get the pid-apes\nLove to see me down and out, blood in my mouth\nSteez all sweated out, tied up in my house\nCan I live and still give, take my team on sprees?\nTwistin' out skeeze out of custom drop-top V's?\nYou know the pedigrees, always stay blowin' the dick\nWhen B.G.S. is the squad, dice stay on the six\n\n[Verse 4: Jahdan]\nNuff of dem still in di valley of dry bones\nDem ah search dem Seven Seas, dem ah throw stick and stone\nM-mh, dey gonna melt like snow cone\nDa minute di countdown say dis ah di final showdown\nWell some ah said dem ah star, dem love car\nDem at war, and a blur, dem nah really reach far\nBut nuff ah dem ah buffoon, dem ah goon\nCartoon, dem nah put out no conscious tune\nA-fi warn dem, if dem nah listen, so we scorn dem\nWe gonna steer far from dem\nI know that we are kings and we love nice things\nBut we not sell out fi no diamond ring\nYo, I got da Lord in ah mi mind\nSo any which part mi come, mi ah go shine\nTrust me, we don't fear nothin'\nSo don't boost up yourself like you are gon' do me somethin'\nMi turn dem off like mi turn of mi light\nJah control di better part of mi life", "title": "D&D Soundclash", "album": "Body of the Life Force", "image": "https://images.genius.com/aa852f9ec66d870bcbb3fbbb78cb0785.1000x1000x1.jpg", "year": "2000-10-24"}], "artist": "Afu-Ra"}