{"songs": [{"image": "https://images.genius.com/3f2040bca1feff51a85c56dd0f3cb107.500x500x1.jpg", "year": "2012-06-15", "title": "Be There, Be Square", "album": "Popular Culture", "lyrics": "[Intro]\nYea!\nVizzy! Popular Culture!\nAy, Xaphoon you crazy!\nYea!\nSee my grandma she would always tell me, set out to be something, not someone. You’ll figure you out\n\n[Verse 1]\nI used to rap like Mase, back in 9-8\nWith a bubble goose and black pager strapped to my waist\nActing like Harlem was a half a mile ‘way\nThem niggas at the mom and pop would laugh in my face\nForgot I was a dude from a very small place\nSmallville fills, mama brought me my cape\nSaid if they call you a square, don’t get bent out of shape\nLet them gay niggas hate boy cause you gon’ be straight\nYeah, I used to rap like Biggie\nBut I wasn’t from Brooklyn and weighed less than 150\nShoveled snow to get Versace, girls still didn’t dig me\nI was like Dwayne Wayne if he didn’t have Whitley\nBobby without Whitney, Stooges without Iggy\nMickey without Disney, in other words it ain’t fit me\nSo that lasted long as the braids on 50\nI decided to be myself even if they didn’t get me\nI’ma\n\n[Hook x2]\nBe there, be square\nAnd I’ma see y’all when you get here\nLet me see those L7’s in the air\nLet me see those L7’s in the air\n\n[Verse 2]\nI used to rap like Hov before I got signed\nHigh school talent shows, throw up the Roc sign\nPouring liquor on hoes, sipping on white wine\n‘Til I realized that whole life was not mine\nI never seen Jigga play Chrono Trigger\nSneak out the house just to go out and skateboard with his niggas\nTell me if his favorite Nirvana song is Sliver\nCut down the family tree, I just can’t relate to you niggas\nSo I speak for those who are not spoken for\nOn Twitter and Bossip, gossiping if I’m gonna blow\nI’m on they heels, they probably wearing open toes\nSold out shows across the globe, my label barely even knows\nYou watch a throne, I just see a chair\nAnd a crown that I’ma get and not even wear\n‘Cause before I got on, they didn’t seem to care\nSo I said fuck yo circle, I’ma be a square\n\n[Hook x4]"}], "artist": "XV"}