{"songs": [{"year": "2005-06-01", "album": "Training Day", "image": "https://images.genius.com/0d736130ef89ba0b866b3b01fad325c1.500x500x1.jpg", "title": "Gz and Hustlas", "lyrics": "[Intro: Kendrick Lamar]\nWhat I look like, a sucker to you, nigga?\nFuck you, rookie\nSomethin' incredible, heh-heh-heh\n\n[Verse 1: Kendrick Lamar]\nHey, hey, hey, hey\nTurn that shit up, boy, bump that shit\nNigga, hold a handgun and dump that shit\nNigga, buy that borough and fuck that bitch\nAnd kick her out before the sun come up\nNigga, my funds is up\nI got my money right\nBusiness movin' like New York City lights\nBitches all over that boy\nCause they know that young boy got a cold strut\nBut I don't fuck with them hood rats, they'll set you up\nAnd I ain't goin' out just like that\nI'd rather go out over a shoot-out, plow\nLand of the scandalous, every corner got a candle lit\nEvery stop sign got a hollow tip\nEvery sunshine got a hood under it\nAnd you know we Marilyn Jones runnin' that shit\nMy bones made out of cement, strong arm\nExplode on y'all, Vietnam, boom\n\n[Bridge: Kendrick Lamar]\nHeh-heh-heh, okay, I'm ready, ha-ha\n\n[Verse 2: Kendrick Lamar]\nTell your boyfriend to do it like this\nA thousand for the jeans, three hundred for the kicks, bitch\nI was born with diamonds in my wrist\nSo, it's only right for your boy to talk shit, yuck\nStraight nasty, don't walk past me\nI just might grab it, just might pull a blade out and stab it\nI would kill it only if you say\nI'm more than willin' to take advantage\nLegs to the ceilin', ho, throw away your panties\nTell 'em that we chillin' if your boyfriend harassin'\nI take 'em, then I perform magic\nHead on the freeway, seatbelt fastened\nAnd go and tell the DJ to play my shit\nYou never heard nothin' like this, yuh\nThe new West Coast's best-kept secret\nChronic smoke comin' out my throat, ha-ha\n\n[Bridge: Kendrick Lamar]\nShit, ay, ay, heh-heh, fuck it, I'm goin' in\n\n[Verse 3: Kendrick Lamar]\nThey say, \"Who that?\" K. Dot, no roof, new top\nThey hate, they watch, speed down the block\nIn a Porsche Box, stashbox, got a new Glock\nIn a shoot-out with anybody that you got\n.45, no lie, no problem\nIf he got his jewels on, I'm a Black Rob him\nNigga, I'm a bad boy, I'm a black ski mask, boy\nI'm a run in his house, then ask, \"Where the cash, boy?\"\n\"Tell me where the safe or this'll be the last time\nThat you ever have a gun in your face\"\nMight be the last time that somebody run in your place\nYou picked a bad time to be at fuckin' home today, stupid\nI'm ruthless, I'm Eazy-E, I'm Snoop, shit\nI'm 2Pac, I'm inferno, I'm so hot, no chicken\nTell it to the Colonel Sanders, do it for that Compton campus\n\n[Bridge: Kendrick Lamar]\nHeh-heh, I'm done with the fourth quarter\nShit, psych, Rock, get 'em\n\n[Verse 4: Jay Rock]\nGuess who's back? Fresh new fitted, turned back\nFresh new spinners on the 'Lac\nNever knew Rock could do it like that\nI'm a mack for real, I hit more pussy than Vagisil, yeah\nWho got this game in a chokehold?\nWe'll make your best rapper submit\nPack up and quit cause we the shit\nPlus, that Calico hold more shells than El Pollo Loco\nTurn you to a dough salt\nTake your ho to the mo-mo quick\nShe want to bounce up and down on my pogo stick\nMe n' Dot spit raw, deejays,  Mr. Miyagi\nYour records wax us on and wax you off, ha\nYou come frontin', get slammed like Onyx\nWe the West Coast classics, you better pay homage\nYou want problems? The kings of the shoot-outs\nLeave your block smokin' like a luau\nTop Dawg E-N-T, bitch\n\n[Outro: Kendrick Lamar]\nWe told you, heh-heh-heh, we told you, ah\nTop Dawg, nig, we told you, nigga done did it\nYeah, yeah, aye"}], "artist": "Kendrick Lamar"}