{"artist": "Cadet", "songs": [{"title": "Dungeon Dragon", "album": null, "year": "2011-10-04", "image": "https://images.genius.com/151b2403378944fad5b8558a02e3932b.845x427x1.png", "lyrics": "[Verse 1: Cadet]\nI am not Aladdin, no, I am a genie\nSo far ahead that my shadow can't see me\nBelieve me, something 'bout the swagger von deezy\nGucci outfit has got me covered in GG\nRah, rah, got me covered in GG\nGucci outfit has got me covered in GG\nAnd if you get to talking like you're mobbin' on me G\nA headshot and then I'm Audi like a TT\nYeah, I said it, TT\nGun roll waistcoats, freebies\nCadet, stop it\nI don't beef with knuckles or gauntlet\nI grab the desi for niggas who acting heavy\nNever thought it would get messy but it's ringing like my celly\nC-A-D-D-D-D-D-D, I can feel it in my belly\nWay you slaughtering the tunes, you got me feeling like you're Freddy\nAll I need is a bottle of the Martel\nI go hard, I never go like Vybz Kartel\nBury man around eleven feet, you would pass hell\nThey know I'm pissing on the game like R. Kell\nThey don't wanna battle with me cuh I'm so raw\nHeard every one of your tunes, so poor\nShit's easily kicked off like an old door\nRob Ps and rob her Ps, cold sore\n\n[Hook 1: Cadet]\nRah, rah, yeah, the guns be banging\nRah, rah, yeah, the guns be banging\nRah, rah, yeah, the guns be banging\nYeah, the guns be banging, yeah, the guns be banging\nRah, rah, yeah, the guns be banging\nRah, rah, yeah, the guns be banging\nRah, rah, yeah, the guns be banging\nYeah, the guns be banging, yeah, the guns be banging\n\n[Verse 2: Stormzy]\nI ain't one to boast but my shit's off the chain\n18, I'mma take the piss out the game\nGot the whole scene wrapped in a little bit of Riz\nBut the spliff just dropped, I ain't billing it again\nYou don't like it? Then fuck off, bitch\nEvery last prick on the ends I'll mug off and you still couldn't fight back\nJakes got my line tapped, cut off, I make the something buss off\nGets peak, guarantee they run off\nWalk in the shubs, turn the lights on\nFind a yout with ice on\nSomebody's pissed that they become my dons\nCould never [?] dons, check one two, turn my mic on\nPrick, get rude? That's your life gone\nI swear to God that they won't like it when I'm coming\nHave 'em running, I don't rave unless the bouncers let my gun in\nAnd I'm all about my guala, putting money first like Yungen\nAnd the way a nigga's talking makes a nigga wanna bun him, yeah\nAll I need is a bottle of the Henny\nPlus the all-black swag has got me looking like I'm Pecky\nIf he's burny, man will wet him up or hit him with the semi\nI ain't tryna be the baddest, I'm just tryna hit the belly\nTalking like you're bad, don't beg it\nThe girlies and the guala, yeah, we get it\nI make the something ring, no credit\nEff it, rasclart Stormzy and Cadet\nGot my dons locked like some dungeon dragons\nWe be OT up in country slanging\nWaved off, chilling with the blunt and the magnum\nPlus I'm sick in the head, call me Marilyn Manson, but\n\n[Hook 2: Stormzy]\nRah, rah, yeah, my guns be banging\nRah, rah, yeah, my guns be banging\nRah, rah, yeah, my guns be banging\nYeah, my guns be banging, yeah, my guns be banging\n\n[Verse 3: Cadet]\nIs this the thanks I get for bringing you niggas in?\nIs it my fault that you couldn't aim his ting?\nYou was aiming, arm was shaking, saying how you'd get to blazing\nBut I dodged it and evaded it and smacked him in his shin\nMan, they just mad and they ain't got your punches\nDoing ACs and working on the abs like it's crunches\nHow you gon' forget? You a motherfucker B\nFam, I'm C-A-D-d-d-det-D-d-d-det, me\nI hear the mumbling, I hear the cackling\nBut beefing me? There's no chance, nobody be backing him\nThey really wanna swing but they say knives got a smack on it\nThe luger ruger roots to have you stiffer than a mannequin\nYou wanna sleep on C? Overnight\nSwing till there's not a thing left, you can hold a right\nNiggas know the swag Cad's smoother than the Dolemite\nAnd if I swing, you better lean back like you hold a kite\nYou see my shiny arse brudda, my brudda?\nWhere I'm going with the food, you should be saying walla\nSorry, man, I'm tired of your voice, say nada\nYou can lose your head right now, just a tada\n\n[Outro: Cadet]\nC-Cadet, Cadet, Stormzy\nC-Cadet, Cadet, Stormzy\nC-Cadet, Cadet, Stormzy, Stormzy\nC-a-d-d-d-d-d, Stormzy, Stormzy\nCadet, Cadet, Stormzy, Stormzy\nC-a-d-d-d-d-d-d-d-d-d-d\nStormzy, Stormzy\nAhh"}]}