{"songs": [{"year": "2005-08-30", "album": "Late Registration", "image": "https://images.genius.com/20be4a5ccc57daf3577b7e0d12f092f8.1000x1000x1.jpg", "title": "Drive Slow", "lyrics": "[Produced by Kanye West]\n\n[Chorus: Kanye West]\nDrive slow, homie\nDrive slow, homie\nYou never know, homie, about these hoes, homie\nYou need to pump your brakes and drive slow, homie\n\n[Verse 1: Kanye West]\nMy homie Mali used to stay at 79th and May\nOne of my best friends from back in the day\nDown the street from Calumet, a school full of Stones\nHe nicknamed me K-Rock so they would leave me alone\nBulls jacket with his hat broke way off\nAnd walked around the mall with his radio face off\nPlus he had the spinner from his Daytons in his hand\nKeys in his hand, reason again to let you know he's the man\nBack when we rocked Ellesses, he had dreams of Caprices\nDrove by the teachers, even more by polices\nHow'd he get the cash? The day his father passed away\nLeft him with a lil' somethin', sixteen, he was stuntin'\nAl B. Sure! nigga with the hair all wavy\nHit Lake Shore, girls go all crazy\nHit the freeway, go at least 'bout eighty\nBoned so much that summer, even had him a baby\nSee back-back then-then, if you had a car\nYou was the Chi-Town version of Baby\nAnd I was just a virgin, a baby\nOne of the reasons I looked up to him crazy\nI used to love to play my demo tape when the system yanked\nFelt like I was almost signed when the shit got cranked\nWe'd take a Saturday and just circle the mall\nThey had they Lincolns and Auroras, we was hurtin' 'em all\nWith the girls a lot of flirtin' involved, but dog\nFuck all that flirtin' now I'm tryin' to get in some drawers\nSo put me on with these hoes, homie\nHe told me don't rush to get grown, drive slow, homie\n\n[Chorus: Kanye West]\nDrive slow, homie\nDrive slow\nYou never know, homie, about these hoes, homie\nYou need to pump your brakes and drive slow, homie\n\n[Verse 2: Paul Wall]\nWhat it do? I'm posted up in the parking lot, my trunk waving\nThe candy gloss is immaculate, it's simply amazing\nThem elbows pokin' wide on that candy 'Lac\nTrunk open, screens on, neons lit with fifth relaxed\nI'm on a mission for dime-pieces and sexy ladies\nAllow me to introduce you to my CL Mercedes\nIt's a star-studded event when I valet park\nOpen up my mouth and sunlight illuminates the dark\nYou see them fours crawling? You see them screens falling?\nThe disco ball in my mouth insinuates I'm ballin'\nI'm leaning on the switch, sitting crooked in my slab\nBut I could still catch boppers if I drove a cab\nA young Houston hardhitter all about the scrilla\nRidin' something candy-coated, crawling like a caterpillar\nI'm tipping on them fours, I'm jamming on that Screw\nI'm looking for them hoes, baby, what it do? Drive slow, homie\n\n[Chorus: Kanye West & GLC]\nTurn your hazard lights on when you see them hoes\nDrive slow, homie\nIf you're riding around the city with nowhere to go\nDrive slow, homie\nLive today, cause tomorrow, man, you never know\nYou never know, homie, might meet some hoes, homie\nYou need to pump your brakes and drive slow, homie\n\n[Verse 3: GLC & Kanye West]\nMy car's like the movie, my car's like the crib\nI got more TVs in here than where I live\nAnd that don't make no sense, but baby, I'm the shit\nAnd everything I flip, you know it's something serious\nI got the custom grill, I got the Brabus rims\nI got the baller genetics, baby this evidence\nYou see a player flicking, and how you ain't convinced\nThat you should go on and kiss it, just a lil bit (just a lil bit)\nI got my custom kicks, I got my Jesus chain\nMy canaries is gleamin' through my angel wings\nThey see me, hoes actin like they seen a king\nWith that mean lean, smoking on that finest Cali green\nMy woodgrain oak, I'm ridin on Vogues\nMy cylinder quiet, like tip-toes\nI sold O's, and this I know\nWhen you see them hoes, lil' homie, drive slow\n\n[Chorus]\nDrive slow, homie\nDrive slow, homie\nYou never know, homie, might meet some hoes, homie\nYou need to pump your brakes and drive slow, homie\nDrive slow, homie"}], "artist": "Kanye West"}