{"artist": "Planet Asia", "songs": [{"album": "The Grand Opening", "title": "Real Niggaz", "image": "https://images.genius.com/cb88bb05cdeba97350da2c7dd2f127f2.500x492x1.jpg", "lyrics": "[Asia] Yeah\n[Ghost] Yo, yo Asia, whattup God?\n[Asia] It's the God Wu-Tang shit\n[Ghost] Uh-huh, yeah baby, let's just murder this track\n[Ghost] That's my word\n[Asia] Yeah, Supa Dave West\n[Ghost] Uh-huh, yeah (yeah) aiyyo Lord spank 'em\n\n[Planet Asia]\nYo, powerful rap robotic style off chronic to cosmic\nFollow this flow from out the projects\nMy shine timeless, clique +Criminal Minded+\nMy time spent, knockin out daily assignments\nThe capacity of my writtens make y'all niggas look mindless\nIn Mortal Kombat, I leave my challenger spineless\nThis five-five-nine shit, three strike law\nDirty cop killer music that the streets can absorb\nOld souls run deep in my pores, your desperation\nPredate the Earth, forming the path of civilizations\nNappy academy, manufacturers the new slang\nMy singles be the jingle like, pockets of loose change\nMy crew bang to set the mic a-fire with Wu-Tang\nSchool y'all, Wu-Tang all in your poontang\nBullies of the block knock, gun in your face\nRun in your house, tie you up and run in your safe\nI'm from a sheisty-ass place where the gangsters dwell\nCrack sellin to rap federal, we takin this mail, what?\n\n[Hook: Planet Asia]\nFrom borough to borough, block to block\nIt don't stop like paper when the new shit drop\nTo all my peoples in the hood on their way to the top\nGet yours, whether anybody likes it or not\nFrom city to city, and coast to coast\nReal niggas in the spot gotta profit the most\nTo all my peoples in the hood on their way to the top\nGet yours, whether anybody likes it or not\n\n[Ghostface Killah]\nAiyyo it's Tony the rapper, Starks the ballplayer\nI won't rock Wally 'til they make more flavors\n+Bulletproof Wallets+, take off gators\nAnd my .22 shotty'll take off faces\nEighty-eight Pumas, velour laces\nDusted out in the staircase where {?} pays me\nSo many hits I need both stages\nYour two.. your two cars can't touch my four bracelets\nOne of the most Williest niggas from Staten\nRan through Manhattan with Wally's made of satin\nCherry-pop coppertop niggas rattin, guest what happened?\nHad to end a nigga with the mac-10\nMasquerades, feds ask and raid like\nRaekwon shallah still be in my PJ's\nThey knew it was them, plus they saw him do well\nOn tour with Theodore Genie actin full ill\n\n[Hook]\n\n[Planet Asia]\nBust your gun, but I still touch ya son\nI don't run cause a nigga got, dusty lungs\nAnd when I talk people be like, you must be from\nThe N.Y. but them I tell 'em nah I'm straight Californian\nBlunts make me born again, ballin where the Warlords dwell\nI still rank first place in the tournament\nGo 'head, act cocky, and meet your match\nNext time I see you bet you'll be one of the speechless cats\nVoice raspy suddenly all the hoes wanna gas me\nHeard I did a song with Ghost nasty\nMy murder rap murder tracks, clean like a cat who dress flashy\nY'all niggas what's the ass be, they whole style trashy\nUncut live I got to say one thing\nI'm the hardest workin EVER to step foot, in Chung King\nUnclean, this year, show you who run things\nDumb things, more than a hundred thousand funding\n\n[Hook]\n\n[Ghostface Killah]\nYeah, yeah whattup? Ghost Deini, Planet Asia\nY'all know how we do, straight up\nI got my man Perm meetin me in the booth\nA.C.T., word up, it's like that\nStark Enterprise, screw y'all\nThe W, the Clan, for real\nHotter than a gun on the sun motherfucker\nYo...", "year": null}]}