{"songs": [{"album": "Planet", "image": "https://images.genius.com/9512e7de485fe45a8b0365fd80465887.1000x1000x1.png", "year": "2017-10-31", "title": "Brightfall", "lyrics": "[Verse 1]\nI come from it, but it seems impossible to run from it\nAll the evil I did to people then could none stomach?\nNo, 'cause when my spirits go up, now every one plummets\nI can light all, with this angel but that demon will make the brightfall\nWhen your angle is to reason with those who night crawl\nPsycho searchin' so they get even with a life you lost and was leavin'\nBut it might be costin' this season, when the fight calls\nPeople change their life of sin\nThen try to negate the back, they aimed the knife within\nA shame, I can win the game, be nice to friends\nThen bang, my revenge, it came to wipe this grin then pain\nFight your demons I'd advise it, it's there no matter how you try to hide it\nIn private, you're runnin' from the people that despise it\nDon't you lie and deny this, sick hybrid\nAngel demon ain't no leavin' either one\nCan't take it back where you got the evil from\nThis magnitude, the angel will need a gun\nSo much evil I saw, in the past when I was bad, now I'm right y'all\nBut evil remains to make the brightfall\n\n[Chorus]\nGod knows I'm trying\nIt seems like I'm always fighting\nFor my life, for my soul\nThis won't bring me down\n\n[Verse 2]\nAll I want is heaven but evil forces, they follow me\nPlottin' on my body to attempt to torch it or hollow me\nI cannot let the depths of Hell to rise up and swallow me\nI'm tryna make it where the other angels and God'll be\nThis is terrible, fightin' the past me is unbearable\nNever really mattered if my symbols and outfit were clerical\nJudgin' today for past demons make me hysterical\nDarkness is blindin', take me back in the city of Jericho\nDarkness will not win, my heart is really not grim\nBut the chances of me becomin' pure angel has got slim\nI'm stuck and I'm blocked in, brightness, the plots been\nWanna frolic in God, I'm lookin' for solace but it got dim\nHow can I detach from the past, the heinous acts\nWill I last? Will they attack with a blast?\nWhen the night calls, it's gonna be a nice brawl\nFor the darkness to come and make my brightfall\n\n[Interlude]\n\n[Bridge]\nGet it out! Spit it out! Evil in ya mix, rid it out\nDon't ever wanna see, what that pit about\nWe just stomp, we just thump, we just grit it out\nGet it out! Spit it out! Evil in ya mix, rid it out\nDon't ever wanna see, what that pit about\nWe just stomp, we just thump, we just grit it out\n\n[Verse 3]\nI'm fighting for a bright life\nBut evil wanna consume me and my soul is the right price\nThat would literally be a fright night\nBut I ain't sellin' my soul to hell, angels yellin' propellin' flight heights\nWanna spread these angel wings\nBut they have wicked entangled things\nLike steamin' hot tar with the stench of brimstone\nKnee in God's yard, can I repent the sin gone?\nDid that, done that, then the evil comes back\nRunnin' from myself, it seems it ain't no runnin' from that\nJust when you wanna start anew\nThey judge you on what you used to be, thus makin' it harder to\nBut I refuse to lose, even if I gotta be banged and bruised\nWhy do we have to battle just to go the bright route?\nOh well, I'm 'bout to beat this Hell until it's lights out\n\n[Outro]\nAlive and I'm well, did I win in hell? The fight just to save my soul\n'Cause time and time again, when I crawl to the light, I land in sin\nNow my sins so far away, that darkness will never find me\nHideous, hideous, grotesque, grotesque\nHideous, hideous, grotesque, grotesque\nHideous, hideous, grotesque, grotesque\nHideous, hideous, grotesque, grotesque\nHideous, hideous, grotesque, grotesque\nHideous, hideous, grotesque, grotesque\nHideous, hideous, grotesque, grotesque"}], "artist": "Tech N9ne"}