{"artist": "6ix9ine", "songs": [{"year": "2018-08-06", "title": "FEFE (Original Version)", "album": null, "lyrics": "[Intro: Shotti, Nicki Minaj, 6ix9ine & Baka]\nIt's TR3YWAY, we the mob!\nAnd the king of New York is looking for a queen\nScum Gang!\nUh, you got the right one\nLet these dirty bitches know, nigga\nQueens, Brooklyn, brrr, ah!\nMurda on the beat so it's not nice!\n\n[Verse 1: 6ix9ine]\nPussy got that wet, wet, got that drip, drip\nGot that super soaker, hit that, she a Fefe\nHer name Keke, she eat my dick like it's free, free\nI don't even know like \"Why I did that?\"\nI don't even know like \"Why I hit that?\"\nAll I know is that I just can't wife that\nTalk to her nice so she won't fight back\nTurn around and hit it from the back, back, back\nBend her down then I make it clap, clap, clap\n\n[Chorus: 6ix9ine]\nI don't really want no friends\nI don't really want no friends, no\n\n[Verse 2: 6ix9ine]\nDraco got that kick-back when I blow that, they all do track\nThey don't shoot back, one shot, close range, red dot\nHead tight, yeah, I did that, yeah, I live that\nCall a Uber with my shooter, with a Ruger, we gon' do ya\nNiggas say they killin' people, but I really fuckin' do it\n\n[Chorus: 6ix9ine]\nI don't really want no friends\nI don't really want no friends, no\n\n[Verse 3: Nicki Minaj]\nHe-He-He tryna 69 like Tekashi, call him papi, word to A$AP\nKeep me Rocky, I'm from New York, so I'm cocky\nSay he fuckin' with my posse, copped me Khloé like Kardashi'\nKeep this pussy in Versace, said I'm pretty like Tinashe\nPut-put it all up in his face, did I catch a case?\nPussy game just caught a body, but I never leave a trace\nFace is pretty, ass for days, I get chips, I ask for Lay's\nI just sit back and when he done, I be like, \"Yo, how'd it taste?\"\n(Yo, how'd it taste?)\n\n[Chorus: 6ix9ine]\nI don't really want no friends\nI don't really want no friends, no\n\n[Verse 4: Nicki Minaj]\nAyo, Draco got that kick-back\nWhen it kick-back, you can't get yo shit back\nIn fact this that bitch that\n\"I hate small talk, I don't fuck with chit-chat\"\nAC just stopped workin'\nSo they hit me, told me bring my wrist back\nCome through rockin' fashions\nThat got all these bitches like \"Yo, what's that?\"\n(Like \"Yo, what's that?\")\n\n[Chorus: 6ix9ine & Nicki Minaj]\nI don't really want no friends\nI don't really want no friends, no\n\n[Bridge: 6ix9ine & Nicki Minaj]\nEenie meenie miney moe, I catch a ho right by her toe\nIf she ain't fuckin' me and Nicki, kick that ho right through the door\n(TR3YWAY)\nI don't really want no friends, my old ho just bought this Benz\nNicki just hopped in this shit, now I won't see that bitch again\nEenie meenie miney moe (no), I catch a ho right by her toe (no)\nIf she ain't fuckin' me and Nicki, kick that ho right through the door\n(no, TR3YWAY)\n\n[Outro: Nicki Minaj]\nMmm, Young Money, Young Money bunny\nColorful hair, don't care\nI don't really want no friends\nI don't really want no friends, no\nI don't really want no friends\nI don't really want no friends, no", "image": "https://images.genius.com/cdfc1c86634d97b8aa6675ae57219768.640x640x1.jpg"}]}