{"artist": "Westside Gunn", "songs": [{"year": "2016-07-19", "lyrics": "[Sample]\nIn the world of luxury goods\nBoth France and Germany boast no figure that comes quite as close to a living national icon as Karl Lagerfield\nHe's best known as head designer and creative director for both the house of Chanel, and the Italian fashion brand Fendi\nAnd he enjoys great success with his own Karl Lagerfield label\nBorn in Hamburg, he has been a fixture on the Paris fashion scene for over 50 years\nIf ever two nations had a private sector soft power asset at the center of the creative industries\nIt's the man with the skinny denim, frockish coat, pulled back hair, and sunglasses\n\n[Intro]\nAyo\nAyo\nKarl Lagerfeld, trying to get money like that nigga, ayo\nKarl Lagerfeld, trying to get money like that nigga, ayo\n\n[Verse]\nFear Of Gods tucked in the 950s\nThey need to chill, God, these niggas can't fuck with me\nI put this on the record, I'm the flyest ever\nJust Don Two Beaches, different kind of leather\nI cruise my city seeing poverty\nBulletproof the Mulsanne in case they trying to body me\nI done sold more dope than you ever seen\nAll black war face painted, I'm looking like Sting\nRemember graduating and selling them whole\nSpending nights in the Feds, my own family done told\nMoney falling apart, this shit's so old\nUsing clear tapes, Cheerios in Versace bowls\nWhile bolan bottles no milk, nigga\nDon't fuck around and get killed, nigga\nA hundred round drum, I call it Wilt, nigga\n'93 Scott Hall shit, Versace silk, nigga\nI'm God, nigga, can't take my niggas on tour, they wanna rob niggas\nI'm way doper, dope spot looking like a Supreme drop\nLine wrapped around the corner, nigga\n\n[Hook]\nHe got a gun\nYo, he try to run\nHe got a gun\nAyo, he tried to run\n\n[Outro: Sample]\nBless me, Father, for I have sinned\nIt's been one month since my last confession\nAnd these are my sins\nI missed mass on Sunday twice\nI lied about witnessing a murder once\nI ate meat on Friday once\nWait a minute, can you back up a little bit and say that again?\nI ate meat on Friday once?\nNo, not that one\nBack up a little more\nI lied about witnessing a murder once\nYeah, that's the one\nDo you realize what you said?\nIt was only once, Father\nDo you know what the fifth is?\nYes, Father, I know what the fifth is\nThe fifth is \"I refuse to answer on the grounds that I'm incriminated\nThe fifth commandment\n\"Thou shalt not kill\"\nThat's right\nNow I want you to tell me what happened\nNo, Father, I'm not telling nobody nothing\nDon't be afraid, my son\nNobody's more powerful than God\nI don't know about that, Father\nYour guy is bigger than my guy up there\nAnd my guy is bigger than your guy down here\nYou got a point", "image": "https://images.genius.com/ff68e71f6caf9475c860c32bc0d0ab9d.500x500x1.jpg", "album": "There’s God, Then There’s FLYGOD, Praise Both", "title": "He Got A Gun"}]}