{"songs": [{"album": "Karma", "image": "https://images.genius.com/211c21c0869ddd68f21635a1a425f464.600x600x1.jpg", "year": null, "title": "Point of No Return", "lyrics": "[Intro: Hard Target]\nYeah, uhm, now's not the best time...\nYeah...\n\nHave you ever been driven to the point you feel like\nThat everything you worked for is nothing at all?\nTo the point in your heart that don't feel right\nAnd everytime I ask you don't come when I call?\n\n[Verse 1: Hard Target]\nIt's like that negative energy burning up inside of you\nFor all the people that let the stuff that they got to proof\nThis for everyone of the motherfuckers that doubted you\nI ain't tryin' to give you a depth, I hold you accountable\nThis for all the times they would fuck up and they blame us\nThis for all the times I would call and you would hang up\nDream and need to wake up, staring at the sky\nJust to see how far wishing on a star would take us\nPush on but can't budge, it took long but came up\nThey rough around the hedges, count them bitches to shape up\nGet 'em stenches for make ups, well-equipped with a blade\nOf a razor papier-mâché and it's basically safe to say\nIf you're crazy, come play with Satan, I give an atheist faith\nAnd forsaken it what you gave him, the rest of the shit is made up\nI know you're thinking, in your head it's getting dangerous\nWe're only driven to this point, cause you make us\n\n[Chorus: Hard Target]\nYou ever driven to the point you don't got stuff to say?\nYou've had it up to here, you've had enough today\nSo you feelin' like you don't give a fuck today\nCause I don't give a fuck today\nYou ever driven to the point? The point of no return\nAnd you know that it's close, cause you can feel it burn\nYou can feel it burn, you can feel it burn\n\n[Verse 2: DZK]\nI can't feel a fucking thing these days\nExcept pissed off, I wonder why I think these ways\nI've been ripped off, I wonder why I drink these days\nThem questions were rhetorical, I'm miserable, I'm horrible\nThere's not a decent fibre in my whole entire being\nAnd I only feel alive when either lying or cheating\nAnd when I cross a mirror, I don't know who I am seeing\nI'm becoming what I hate, it's genetics or it's faith\nAnd it's getting pretty late in the game to make change\nSo it's time to buckle down, 'bout to take off in this plane\nAnd I don't know the destination, I know not what I'm facing\nBut I am estimating we'll be crashing so I'm bracing\nFor impact, please keep me intact, I'm praying\nBut me, I'm not a believer, so what the fuck am I saying?\n\n[Chorus: Hard Target]\nYou ever driven to the point you don't got stuff to say?\nYou've had it up to here, you've had enough today\nSo you feelin' like you don't give a fuck today\nCause I don't give a fuck today\nYou ever driven to the point? The point of no return\nAnd you know that it's close, cause you can feel it burn\nYou can feel it burn, you can feel it burn\n\n[Verse 3: Cryptic Wisdom]\nYeah, I been feeling like the real and the fake and I separated\nIn relationships, it felt like they're breaking in several places\nI've contemplated, just fading away and staying away from the shadiness\nCause I'm feeling played and I hate it!\nBut maybe it was me and not the others\nIf you know me, then you know that I'm stubborn and like to suffer\nI've discovered that people will let you down\nAnd I don't give a fuck about 'em, I've learned to expect it now!\nRespect? Never, they're only there when I'm loaded with money or drugs\nHoping to take a shot of my focus\nI've broken my bank for the people that just spit at me\nI've broken my back for bitches that are history\nI know they're missing me now that I'm outsellin'\nBut emotions have been tricking me, dawg, and there's no tellin'\nThis is fucked up! I need a break from it all\nJust to save a little face cause face it, I'm 'bout to fall\n\n[Chorus: Hard Target]\nYou ever driven to the point you don't got stuff to say?\nYou've had it up to here, you've had enough today\nSo you feelin' like you don't give a fuck today\nCause I don't give a fuck today\nYou ever driven to the point? The point of no return\nAnd you know that it's close, cause you can feel it burn\nYou can feel it burn, you can feel it burn\n\n[Verse 4: Adil Omar]\nYeah, yo\nMy safety and my energy, my privacy and sanity\nMy entire fucking well being invested in this music\nAnd it's crazy, I'm in jeopardy, they think it might be vanity\nThat drives me to work and it's getting mad abusive\nAnd I'm grateful for the nature have inherited\nI'm grateful for the people who were there when I was settling\nNow it's like I'm a star with all this press and shit\nBut still the most hated in the nation since the President\nI've been motherfucking demonized beyond belief\nIlluminati allegations from these hordes of sheep\nI can't walk around the public like it used to be\nUnless I got a fucking entourage, a couple goons with me\nI've stayed true to me, I've stayed true to you\nAnd all you do is spit in my face! It's nothing new to you\nTo drag me down, I've had it now, so Pakistan start begging\nWhen I've packed my bags, I'm out of town\n\n[Chorus: Hard Target]\nYou ever driven to the point you don't got stuff to say?\nYou've had it up to here, you've had enough today\nSo you feelin' like you don't give a fuck today\nCause I don't give a fuck today\nYou ever driven to the point? The point of no return\nAnd you know that it's close, cause you can feel it burn\nYou can feel it burn, you can feel it burn\n\n[Verse 5: Marpo]\nYo, uh, yo\nThey told me break a leg, I kept the firm stands to the point of no return\nAnd never fucking turned back!\nYou can feel the tension in the bars that I'm making\nTo the point I'm getting pissed off and going fucking crazy!\nLookin' in the dark, if you try, you can barely see\nThey're tryna knock me down for anything to embarrass me\nSaying that they're crowned with their hands out like it's charity\nI hear a clever bar but I don't hear its sincerity!\nAll these other rappers that are around me hating in my bracket\nI'd be knockin' it up out of the park and they givin' me practice\nOnce they start, there ain't no way you could stop or contain a savage\nYou flipped the switch and I've had it, I've been driven to madness\n\n[Bridge: Hard Target]\n'Till I'm gone, until you feel it building up in me, strong\nThey tell me calm down, it won't be very long\nYou better leave me the motherfuck alone\nMotherfuck alone!\n\n[Chorus x2: Hard Target]\nYou ever driven to the point you don't got stuff to say?\nYou've had it up to here, you've had enough today\nSo you feelin' like you don't give a fuck today\nCause I don't give a fuck today\nYou ever driven to the point? The point of no return\nAnd you know that it's close, cause you can feel it burn\nYou can feel it burn, you can feel it burn\n\n[Hidden Track]\n[Verse: Hard Target]\nAs I look up to the sun, I see a burn in the sky\nSilhouettes just pass by\nRather losing your control, you're just doing what you're told\nYou have a question but you never ask why\nTo the point of no return, returned and dull-witted\nI purposely burn it down, I'm never rebuilding bridges\nI say it in different ways, I'm praying to hell get it\nTakes more than the fame and the claim you're ill with it\nFuck it, I tried my hardest, though\nWhen it's too hard to go, we're breaking down like particles\nTo get my heart and soul ??? place, there is no heart and soul\nI have no interest in so I'll just play my part and go\nAnd this is all fake\nYou keep pushing the edges and tell it all breaks\nSo I stand and shout\nCause I'm trapped inside that place that you can't get out\nAnd as I'm beating on the sides of the walls\nYou hear I'm caving in everytime that you talk\nYou're thinking that they'll find you but the irony they won't\nCause you'll never find yourself and you're denying that you're lost\nYou're denying that you're lost\n\n[Bridge: Hard Target]\nI said, somewhere along the lines, I've lost my way\nAnd I try to run away for the price I had to pay\nBut if we both say bye tonight, with both of us wrong, we could never go right\nI said, somewhere along the lines, I've lost my way\nI said, somewhere along the lines, I've lost my way\nI said, somewhere along the lines, I've lost my way\n\n[Outro: Hard Target]\nAs I look up to the sun, I see a burn in the sky\nSilhouettes just pass by\nRather losing your control, you're just doing what you're told\nYou have a question but you never ask why"}], "artist": "Hard Target"}