{"songs": [{"year": null, "album": "Kardi Gras Vol. 1: The Clash", "image": "https://images.genius.com/fc8095744814616ac0f10409c5c72099.640x640x1.jpg", "title": "Tattoo (Rudebwoy)", "lyrics": "[Verse]\nI ain't really into showin' off, rudebwoy!\nJah could sell sixty yo car, rudebwoy\nI ain't really trouble nobody, rudebwoy\nNo coke, no (sniff) that's a joke, rudebwoy\nSince when is it cool to be a fiend, rudebwoy?\nI grew up on Biggie, how you mean, rudebwoy?\nThe charters never taste what you be sellin', rudebwoy\nNow that pill poppin' what you yellin', rudebwoy?\nYou came up on the turf, that ain't us, rudebwoy\nDon't make an OG call yo bluff, rudebwoy\nIf you talk tough, back it up, rudebwoy!\nYou see me got first, that's enough rudebwoy\nI ain't really lookin' for no stripes, rudebwoy\nI be at the gates, yell at yo face, rudebwoy\nIce water in the bloodline, rudebwoy\nNinty percent of these rappers lyin', rudebwoy\nSaying you think to be a star, rudebwoy?\nWho you parr wit is who you are, rudebwoy\nI'm no hypocrite, I did my dirt, rudebwoy\nI'm livin' everyday tryna benefit the earth, rudebwoy\n\n[Hook]\nCause I know I liquidate veteran yesterday, yo\nBut betta don't ask me nothin' bout tomorrow\nIs the ? pajama in sorrow\nIrdy why I sing aye\nAye aye ayeyeye\nWe'll never back down, and I can tattoo that to my arm\nJano say you can tattoo that to my heart\n\n[Verse]\nI don't like most 5O rudebwoy\nBust some of them coll carolie, rudebwoy\nSome of them will shoot without blinking, rudebwoy\nTake ya hand outtta yo pocket, whatcha thinkin', rudebwoy?!\nYou tellin' the media it's racism, rudebwoy?\nBut you ain't tell 'em bout the animation, rudebwoy\nCops got you slippin' in the whip, rudebwoy\nThe breeze couldn't cover up the trees. rudebwoy\nCursin' wit yo bulletproof vest, rudebwoy\nYou stupid to be resisting arrest, rudebwoy\nNow you got 'em reachin' for the Glock, rudebwoy\nAssume the position, no talk, rudebwoy\nYo friends might snitch and switch on you, rudebwoy\nThey ain't goin' to the don for you, rudebwoy\nWhen you back home from yo bed rudebwoy\nAct like a man\nBut remember what you did, rudebwoy\n\n[Hook]\nCause I know I liquidate veteran yesterday, yo\nBut betta don't ask me nothin' bout tomorrow\nIs the ? pajama in sorrow\nIrdy why I sing aye\nAye aye ayeyeye\nWe'll never back down\nAnd I can tattoo that to my arm\nJano say you can tattoo that to my heart"}], "artist": "Kardinal Offishall"}