{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "In the Shadow of the Sun", "image": "https://images.genius.com/937a22b3dfa62548d1013d052f733535.1000x1000x1.png", "lyrics": "[Intro: Max Elto]\nThey say that life is always easier\nAfter you let yourself come undone\nThey say they'll give you whatever you want\nAnd they'll be waiting in the shadow of the sun\nAnd I'll be waiting in the shadow of the sun\nSeizing time where no one's been before\nClose the curtains, what you waiting for?\nAnd I'll be keeping secrets\nTill I'm in the ground\n\n[Verse 1: Professor Green]\nKeep your past your own, I don't care about before\nI don't wanna know your secrets, I wanna help you keep yours\nNo one needs to, no one'll ever know what we do\nWhere we go, why don't we go to a place where only we know?\nWhere we escape from real life and it feels good and it feels nice\nThat we ain't yet but we still might\nCause we go with it if it feels right\nAnd it feels... feels amazing\nWe ain't ready to see the day\n\n[Hook: Max Elto]\nAnd I'll be waiting in the shadow of the sun\nSeizing time where no one's been before\nClose the curtains, what you waiting for?\nAnd I'll be keeping secrets\nAnd I'll be waiting in the shadow of the sun\nSeizing time where no one's been before\nClose the curtains, what you waiting for?\nAnd I'll be keeping secrets\nTill I'm in the ground\n\n[Verse 2: Professor Green]\nLet go of fear\nThis can be a secret that we both keep, that we both share\nHidden behind the smiles we both wear\nAs the sun creeps through the curtains\nOn the walls we become two silhouettes\nAs we close our eyes\nLet go of the lies that fill our heads\nLet's light it up, live life in the moment\nWhy would we worry about where we might end up?\nThey can't see us, they can't judge us, it's just us\nThey might wonder but only know where we go when the sun comes up\n\n[Hook: Max Elto]\n\n[Bridge: Max Elto]\nI'm in the shadow of, the shadow of the the sun\nWhere I belong, girl, there's something coming on\nI'm in the shadow of, the shadow of the the sun\nOh, and I need you\n\n[Verse 3: Professor Green]\nChasing it, chasing it\nI don't know what I'm chasing is\nAll I know is I've been craving it\nEver since I had a taste of it\nLife is what you make of it\nWe're just here writing our own books\nThis is just a page of it\nBefore you wave your fingers at us\nYou better make sure your hands are clean\nWe all obey, our hands are tied\nAnd I don't wanna have to leave\nI don't wanna say goodbye\nThey say life is always easier when you come undone\nWhen I go, you'll know where I've gone\n\n[Hook: Max Elto]", "year": "2014-09-22"}]}