{"artist": "E-40", "songs": [{"title": "California", "image": "https://images.genius.com/2680b469ad4094f67d48fef549174459.1000x1000x1.jpg", "album": "Welcome to Los Santos", "year": "2015-04-14", "lyrics": "[Intro: E-40]\nThrowin’ up the upside down M (the upside down M)\nE-40, the W, like the hotel\nWest Coast! Y’all picked the right person to bring this shit to life\nI’mma speak some real this\nThis how that shit go down\nI’m the soul narrator\n\n[Verse 1: E-40]\nIt’s zany on these dumping grounds\nDon’t be slippin’ with your pants down\nThey got some big shit hundred rounds\nThat’ll knock you out your shoes and spin your neck around\nCrooked cops, crooked dice, crooked streets\nDark guns, dark alleys, dark reefs\nDon’t get fooled by the palm trees and the beach\nThey wake your ass up, put the pistol to your teeth\nWhere the safe at? Where the shoe box? Where your duffel, patna?\nLost souls, they don’t believe in karma\nThe fast lane, fast cars, fast cash\nBad bitches, big titties, big ass (who out here?)\nCelebrities and socialites\nPimps, gangstas, and hustlas under the streetlights\nThey’ll run up on ya, make sure you with some real ones\nWhen you come in California\n\n[Hook 1: Ariel Pink]\nEven when it’s flying high\nWatching the weather\nUp above, the city skies\nAnd gettin’ it together\nCalifornia, California\n\n[Verse 2: E-40]\nCali, the land of opportunity\nSan Quintin and Silicon Valley\nWhere they learn to play the corner\nWhere they play with drumsticks that’ll go through body armour\nIn the Pacific to be specific (what they like to do?)\nWhere they’ll follow you on the freeway\nCatch you gettin’ off an exit when you least expect it\nUnexpected, in the middle of the daylight where the traffic hectic\nBold, cold, these judges ain’t plannin’ on gettin’ old, old\nGot hit now he layin’ up in the road, road\nHis mama outside up in her robe, robe (her robe?)\n(Where you from?) West Coast!\nYou sick out this bitch, as I squash like this\nThe fog and the mist (West Coast!)\nI yell that shit out, that’s all that I know, that’s how that shit go\n\n[Hook 2: Ariel Pink]\nEven when it’s flying high\nWatching the weather\nUp above and try hard to\nGet it together\nCalifornia, California\n\n[Outro: Ariel Pink]\nUp above the cities skies in California\nAnd soon we'll be flying high in California\nIn California"}]}