{"songs": [{"image": "https://images.genius.com/c4d8605dff947c8e53f29c6880512a28.645x645x1.jpg", "title": "Hold Up", "album": "Brass Knuckles", "year": "2008-09-16", "lyrics": "{*whispered*} Free Agentz\n\n[Intro: T.I.] + (Nelly)\nAy, y'all already know what this is homeboy\nNah Mo', no no, no nigga\nThese niggas done done it this time\nAy, ay (You like that? OOOOOOOH!)\nFuck what ya heard homeboy! (That feel good to you?)\nReal niggas on deck! (What about now, oooh)\nGoons is out nigga! (OOOOH!)\n\n[Nelly]\nWe doin 100 on the highway switchin lane after lane\nIf the po-po come in then let 'em, ain't no stoppin today\nWe brought them horses out tonight (hey!)\nThem big locks, duel cams, chrome pips (hey!)\nI know you hear 'em\nPlease, who in yo' hood wouldn't trade places with me\nIf I ain't what you tryin to be then why you hustlin, see\nTo be young, black and rich (OOH!)\nIf that ain't the combination tell me when it switched (OOH!)\nI need to know; listen\nMaybe the problem is you're thinkin too small\nYou niggas only wanna rap and that's all\nYo' only goal is to buy out the mall, I go to buy me a mall\nYou wanna stunt for the summer, I'm tryin to buy me the fall\nAnd catch a MySpace lick (YEAH!)\nYou know how many hits MySpace get? (YEAH!)\nHey! Man it's like, I'm hurtin feelings just by tellin the truth\nI'm hurtin feelings in and out of this booth; now listen\n\n[Hook: Nelly] + (T.I.)\nYou see me sittin in the turnin lane\nYours big but mine bigger mayne\nYou out here braggin 'bout a little change\nYou need to step up your game; lil' boy you better\nHold up (ay) hold up (ay) hold up (ay) hold up (ay)\nHold up (ay) hold up - you better sit ya ass down\nHold up (ay) hold up (ay) hold up (ay) hold up (ay)\nHold up (ay) hold up - you better sit ya ass down\n\n[T.I.]\nAy, well 'Pac, I see these haters watchin me\nBut I ain't trippin when y'all see it ain't no stoppin me\nWay in the million and I'm steady buyin property, I got land\nCome catch me you hit the lottery, nigga so stop playin\nAnd I ride what I want to, and ya ain't know?\nSee me buyin what I want to, then walk out the sto'\n100 thousand in my pocket, you can tell how I'm walkin\nKick my ball like a dog just to keep these haters off (OHH!)\nPosted at the red light, on chrome\nDrop-top candy red tight, 454\nA nigga want it better bring it on\nFresh off vacation, all that hatin got me paranoid\nYeah, you better know it\nWhat I'm bringin you ain't ready for it, no right now\nOnce I tell 'em go and get 'em boy, it's lights out\nNigga I ain't playin wit'cha, come any day I'll hit ya\nDon't let me pull up on you in that turnin lane nigga\n\n[Hook]\n\n[LL Cool J]\nHey, hey, hey\nMy bread stack high like Mike in NBA highlights\nMansion means jacuzzi bubblin with skylights\nUncle L jew-els, killin niggas eyesight\nWal*Mart stocks since '87 (yeah you damn right!)\nMy wrist stay glistenin, two birds kissin and\nI'm sick of all this money, somebody call a physician in\nThe American dream, I'm what niggas is envisionin\nYou clowns ain't makin it rain, it's just drizzlin (hey!)\nActin like I ain't paid, what you talkin 'bout?\nI throw a party at the bank, walk a million out\nGot over 30 movies, what you think you doin to me?\nYou sold a couple records, how you think you gon' outdo me?\nYou know I'm in shape, I slap you you gon' try to sue me\nI buy you off, slide off with your lil' cutie\nAll this money is a goddamn nuisance\nLook at my career, yeah I'm the blueprint (OOH!)\n\n[Hook]"}], "artist": "Nelly"}