{"artist": "G-Eazy", "songs": [{"title": "Blazin On a Sunny Afternoon", "album": "The Outsider", "year": "2011-03-31", "image": "https://images.genius.com/d0943d53e3f6e80197033e1234942e19.800x800x1.jpg", "lyrics": "[Intro]\nOh well is it heavy stuff man? Will it blow me away? Daw-gone man I'll tell you that much. I've been smoking since I was born man I can smoke anything\n\n[Verse 1: G-Eazy]\nYeah, I woke up around 12\nLooked to my right found a bag on the shelf\nI twist one up burn a zag to myself\nAnd i don't give a fuck if it's bad for my health\nI'm mad stressed out\nCause last week see my girl just left out\nI went to roll another j and I'm fresh out\nAnd see I'm bummed i ain't even get none last night when i went out\nDamn, and now the room's all hazy\nEyes start to look Asian when I'm blazey\nThink I'm about to lay around today and be lazy\nMaybe might call a squeeze over to amaze me\nYeah, as you can see i've got some issues\nI've got my medical card it's gettin' misuse\nSo I'm stop it if it's bammer? I'm off it\nI'm cheech with a fatty full of maui wowie dog shit\n[You mean we're smokin' dog shit, man?]\n\n[Verse 2: MOD SUN]\nG-Eazy, Mod Sun!\nNow I ain't gonna do that regular stoner rap type shit where I like\nTake a hit to the mic right before my verse but..\nI'm hippie hop, 70's mentality type shit\nCame from a family, hipp-ays\nMy parents both smoked J's in '70s\nShit, even when my mom was pregnant she still blazed\nSo i've been high before I even lived one day(zed)\nBut I ain't confused\nCould chop it any way, whatever paraphernalia you choose\nAin't nothin' bar on top night for solar puffin vapor\nSpace cake whatever [it takes to get us copper?]\nAnd we do that!\nYeah we blazed it and strained a lot of eyes? for tastin?\nSour d without the Brooklyn based me\n[?] straight from the guy that raised it\nDon't say shit\nFaded but not so vibrant\nNever been to high to keep climbin'\nGot a fresh crop but a harvest moon\nWake and bake with me I guarantee every day just like a sunny afternoon\n\n[Outro: MOD SUN]\nG, hit me up\nSaid he was on some 1967 type shit\nSee that's where I am\nMod Sun\nHippie hop\nM.O.D. and some air"}]}