{"songs": [{"year": "2015-10-30", "album": "Kardi Gras Vol. 1: The Clash", "image": "https://images.genius.com/fc8095744814616ac0f10409c5c72099.640x640x1.jpg", "title": "OG", "lyrics": "[Intro: Assassin]\nMad something!\nOh Assassin, Kardinal a bad something\nSearch ya know!\nKingston!\nI don't know 'bout ye\nMan a real OG\n\n[Verse 1: Kardinal Offishall]\nWhen you the realest\nYou don't need to try to be relevant (OG!)\n416 all we doin' is stick to the regiment! OG!\nMy Gosh\nMoney is talkin', de madem a try to be eloquent (OG!)\nI'm friends with the hustlers  and I give the daps to the reverend (OG!)\nI told them to pray for the block and to pray for my brethren OG! (Pray for me!)\nThe ghetto is hungry, they robbin', shootin' and embezzlin' OG!\nWherever there's love I am home\nWelcome to my residence (OG!)\nThey talkin' bout all that they doin', but where is the evidence? (OG!)\nI do this for all of my kings that's living in tenements (OG!)\nA moment of silence for haters\nWe offer remembrance (OG!)\nI give you opportunity, you talkin' bout opulence OG!\nYou couldn't see what we doin' with Gucci binoculars\n\n[Verse 2: Assassin]\nTell me!\nWhat a nigga know about me?\nI get L-I-V-E\nYou don't want beef and you the king\nAnd all you wanna do is just preach?!\nNiggas want everything free, you can get this D-E -L-I-V-E-R-A-N -C-E\nS to the T-R-A-I to the G\nH-T still in HD, holla at me,  OG!\n\n[Chorus : Kardinal Offishall]\nOG! With no T-wop in my life my niggas is nothin'\nThe devil talkin' so loud, but we know he bluffin'\nYoungsters don't provide info, yeah, we know nothin'\nTell me somethin'\n\n[Hook: Kardinal Offishall & Assassin]\nTell me somethin' OG!\nOG! Tell me ye ain't heard about me!\nTICKA TICKA Real OG\nOG! Tell me ye ain't heard about me!\nTICKA TICKA Real OG\nOG! Tell me ye ain't heard about me!\nTICKA TICKA Real OG\nOG! Tell me ye ain't heard about me!\nTICKA TICKA Real OG\n\n[Verse 3: Kardinal Offishall]\nNowadays...you can see me drive slow\nThrough the west side (OG!)\nBig up all da man upon road, I was born on di East Side (OG!)\nSum' o' dem pull bad, I don't really trust da police out here (OG!)\nSpeed bad, doin' 80 in a 50, goin' straight through Leaside (OG!)\n808's in the trunk, slave to fashion with a chain on (OG!)\nKunta Kente, still have plenty, I'm you're neighbourbhood Trayvon (OG!)\nSo many killed, don't have names, don't get reported on the TV (OG!)\nSo many illiterate, ignorant, that can't even spell LV (OG!)\nYou don't really know about me!\nTrust we ain't from the same scenes\nTrust we ain't' from the same genes\nTrust we ain't inna dem tings\nNah, you ain't on my team!\nCuz all of us are born kings\nAnd Queens respect the crown when you see it\nSome wanna be it\nBut got they eyes focused on a Beamer\nTryin' hard but I'm still a sinner\nOh God, OG!\n\n[Chorus]\n\n[Verse 3: Assassin]\nReal OG manna real OG\nYa girlfriend said that I'm a D-O-G\nCold-breaded assassin call me Kobe\nOperator to the ting I'm like a D-O-C\nFear no man it's only G-O-D\nReal OG no real orgy\n'Nuf of dem a talk 'bout OG\nThey don't know 'bout the gangsta C-O-D-E\nDat dem with a big man\nBig papa soldier with\nBig man thirty\nWe a G-major dem a g-minor\nMe g-shocks put them in a big flat\nThen G pon\n[?]\nPulla envy\nOr we up a inna club where we drop 10 Gs\nOr a 100 Gs pon a new Benzi\nPartna's like \"OG\" When dere girlfriend see it\nOG no hse up in the front seat\n[?]\nMission complete\nEverybody dun speak!\nOG!\n\n[Outro]\nMe do me research!\nWhat I can't cuss?\nMe do me research!"}], "artist": "Kardinal Offishall"}