{"songs": [{"lyrics": "These wings have seen things most men would melt apart from\nIt's like, wait, wait, wait, wait, wait\nAll my drunk destiny pushed was one radio flyer chock-full of halo parts\nRingin this chime like, \"Man, I could fix your broken shine\nWe're all Saints swept serpentine 'round charcoal tomorrow\nBunk holiday damned. Easy now, brother, I'm here ...\nI'm here, I'm now, then and there.  I'm, we?  Us?  Them?  It?\nI'm sorry, I'm ...\nGod, this final extension's beautiful but, friend, I don't deserve it\nI beg of you sweet Father please detach my chest's polar lining\nI can't handle asymmetry\nAnd if it means my grand finale don't tally the votes\nFinish me, dormant, with torture-machine silencer-piece\nPositioned where eyelids will reach R.E.M. well before I'm torn\nI've never asked for much (Never) never felt golden-benefit worthy\nI gots what I gots and what I don't gots don't concern me\nI'm no model, I never aspired to be Velociraptor fossil\nMan, there wasn't no arrangement\nMan, I never had a say in this\nI wanna be the normalcy that normalcy was jealous of\nNo shimmer, no celestial flight mid-winter\nEnter me now\nSee through Cretin low-life iris\n(Uh, I, I'm, I'm not, I'm not ready) I'm not ready for all this business that for some reason you all refer to as a privilege\nUh, take a look at me, my feathers drag, this harp plays out of tune\nI fly about as straight as a blind tugboat through my legacy\nI accidentally killed cupid with his own weaponry\nAnd man that was my homie\nTalk about not cut out for these pristine pearly robings\nWhat could I possibly have done? You really want me to steer child populace back on beaten path?\nOh god, like teachin morals!\nI can't be a part of something I ain't soaking my feet in, man\nI'm from the dungeon So from here on out it's hark the herald nothing\nListen, I quit.  That's it\nBut for the life of me, one thing has plagued my being from the get-go\nWhy place these most blessed and sacred honors upon an alley cat like this\nI just don't get it\nOh... my god, it just dawned on me... wait a second, oh... god...\n\n[2x]\nYou have been a witness\nYou have seen the days when\nI applied lies in a billion different ways, and now I harbor bad karma\nDoomed to cope with the fact I dodged the ring but gotta show these cats the ropes\n\n\nBad karma\nPlease leave these little wings to erode\nPlease leave this little halo to a child with a lighter load\nI'mma hold this tight like a life lesson told through a mic", "title": "Bad Karma", "album": null, "image": "https://images.genius.com/64fbb9620a6b5e79e87c654b74da5441.640x640x1.jpg", "year": null}], "artist": "Aesop Rock"}