{"artist": "V-Nasty", "songs": [{"title": "The Breakup ( Hate U)", "year": null, "lyrics": "[ Talking]\nGirl let me see your phone my babydaddy is not answering my phone call\nAgain? \nAgain hell yeah\nGirl I told u leave that nigga alone a long time ago\nDayo Dayo, man I'm about to but u gonna answer my fuckin phone call right now\nNiggas like him ain't shit u need to leave him alone\nYeah I know that's right  \n\n[ Hook - Magneto Dayo]\nI hate you bitch don't you ever come in my life again\nBut its all good cause now I'ma Fuck all your friends!\nI hope it hurts when you see me on the Grammys with my new chick\nAnd you gon wish it was youuuuu\n\n[ Verse 1 Magneto Dayo ]\n\nI picked you up from work\nYou had an attitude!!!!/\nI'm like save that shit for\nWho it matters to!!!!/\nCan't be mad at me cuz\nI'm mad at you!!!!!/\nAlways using excuses when it's something I had to do/\nAct like you don't wanna see me succeed/\nBrain full of jealously, deceit and greed/\nI'm like let me breathe, you act like I'm your son/\nI already got a mother I don't need another one/\nBecause you harass, nag and ask aggravating questions/\n[ V Nasty ]\nWhere you at? What you doing?\n[ Magneto Dayo ]\nWhat you had for breakfast?\nAnd that's sickening/\nI wanna know what it feels like to take a piss again/\nWithout you listening\n\nHook - Magneto Dayo] X2\nI hate you bitch don't you ever come in my life again/\nBut its all good cuz now Ima Fuck all your friends/\nI hope it hurts when you see me on the Grammys with my new chick/\nAnd you gon wish it was youuuuu\n\n[ verse 2 - V Nasty ]\n\nI hate you! Hate you! Wish I didn't date you\nThought you was real you turned out to be fake dude\nCan't fuck with you, you on some other shit\nStop calling me boy go find another bitch\nPack your shit, Get out skedaddle\nGo far away, go to Seattle\nIt don't matter just know its a wrap/\nYou erking my nerves I  can't handle that/ wasting my time I can't get it back/ stupid ass punk didn't know how to act/ changed my number he got it right back/ lemo pulled up they like who is that/\nSyrup goin down ounce after ounce/\nBouncing out things that you can't pronounce/\nNo looking back to busy in the industry/\nIf I get killed everybody gon remember me\n\n[ Magneto Dayo ]\nAnd don't u call back\nI'm in the I'm hanging up right now so\nDon't you call back\nI'm in the club right now so\nDon't you call back\nShit I'm bout to Fuck right now so don't you call back \n\n[ Hook ]", "album": "Doin numbas 2 / The Maury show ", "image": "https://s3.amazonaws.com/rapgenius/1316103302_v_nasty.jpg"}]}