{"artist": "Bow Wow", "songs": [{"album": "Bow Wow (That’s My Name) 6\" Single", "title": "Bow Wow (That’s My Name) (Remix)", "year": null, "lyrics": "Hair nappy but I'm happy pocket full of dough\nFrom the C-O representin' So So\nThe girls recognize and these {niggas} do too\nI'm the flyest thing walkin' through junior high school\nSo make room next to your little backstreet poster\nCause Bow Wow's here and it's over! YA HEARD!\nI'm this, I'm that, I'm all of the above\nIn a big body shotgun ridin on dub's\nI've been seen with the baddest, heard with the best\nAnd I got it locked down from the East to the West\nLook at my eyes, ya know; I ain't playin'\nThat's why all through the streets\nAll I hear {niggas} sayin' is\n\nChorus 2X: [Lil' Bow Wow]\nBow wow wow yippie yo yippie yay\nWhere my dogs at? Bark with me now\nBow wow wow yippie yo yippie yay\nAnd all my girls around the way that love how it's going down say\n\nBow wow wow yippie yo yippie yay\nWhere my dogs at? Bark with me now\nBow wow wow yippie yo yippie yay\nAnd all the girls around the way that love how it's going down\n\n[Lil' Bow Wow]\nNow that the gates wide open\nIt is I who they runnin' from\nLittle with the ill, cross over like\nIverson in 2k my way and I'm the first to rock\nFirst to drop ice in the bezel of a G-Shock\nLike B.I.G. and Pac, I'm hard to forget\nWhat makes it even worse, I'm just getting started\nYeah that's me; that's got your daughter in a frenzy\nYeah that's me; that's got her arguing with her friends about\nWho? Gone, gimme when they see me\nSayin', \"Do you?\" See him, \"Ooh he the man!\"\nThirteen, game lock, don't trick\nAll that and a bag of chips; Hi! My name is\n\nChorus 2X\n\nBeware of tha dog screamin', in tha front now\nIt's-a, must-I, put my stunt down\nWho you know my age that spit like me\nStep on any stage anywhere and rip like me\nHit the studio with J and make a hit like me\nSee I am what others cats just might be, dislike me\nOnly those that's scared of what's trill\nI'mma Steven Seagal type {nigga}, I'm \"Hard To Kill\"\nCash, flashin', girls, that's what I'mma bout\nThose that don't believe get stomped out\nThe game is in a twist now, I'm to blame\nBut those that don't know, ladies what's my name\n\nChorus 4X", "image": "https://images.genius.com/844b5db73af7bb364b18f75f3b06eb51.600x600x1.jpg"}]}