{"artist": "Bhad Bhabie", "songs": [{"lyrics": "[Intro]\nOh my God, Ronny\n\n[Chorus: Bhad Bhabie]\nWhite J's, white Porsche\nWhite wrist, white horse\nHi, bitch, hi, bitch\nHi, bitch, hi, bitch\nI do not sniff it or roll it (no)\nIt do not drip when I pour it (no)\nI do not run, I reload it\nI do not save it, I throw it\nWhite J's, white Porsche\nWhite wrist, white horse\nHi, bitch, hi, bitch\nHi, bitch, hi, bitch\n\n[Verse 1: YBN Nahmir]\nLil' nigga, got bands in my pocket\nYou lil' niggas broke, all that flexin', just stop it\nI cop me an Audi, that top, I'ma drop it\nI pick up your bitch, now them panties keep droppin'\nI'll fuck a nigga's bitch on a Sunday\nOne night, then I pass her back Monday\nLil' nigga want smoke, then it's gunplay\nCaught him in the field, left him on the runway\nWe packin', you lackin', you talkin', so bitch\nYeah we finna get on that\nThat pistol be hot, it go in slow motion\nThat blower, you know it got blow back\nI'm stickin' you up, bro takin' you down\nSince you flexin' like you got that\nWe run through the back, get hit with this Mac\nWe got guns like it's Baghdad\n\n[Verse 2: Rich The Kid & Bhad Bhabie]\nAyy, ayy (hi, bitch, rich)\nShe ain't got FaceTime, I'ma Skype it (what?)\nGet her head one time, tell her, \"Bye, bitch\" (bitch)\nDrop an all white Bentley on my right wrist\nI might take her on the jet if I like it (woah)\nSide bitch, Kylie\nIf I dick her one time, what she gon' buy me? (buy me)\nCome straight out the sky like I'm E.T\nFuck that, bitch, my pinky ring 3D (ice)\nYoung CEO, I could sign ya\nQuarter mil' on my neck, I'ma blind ya (woah)\nCut her off, she ain't havin' no purpose\nBitch bad, still buyin' no purses (hell no)\n\n[Chorus: Bhad Bhabie]\nWhite J's, white Porsche\nWhite wrist, white horse\nHi, bitch, hi, bitch\nHi, bitch, hi, bitch\n\n[Verse 3: Asian Da Brat]\nBitches deceased\nSmokin' on dick, she not better than me\nPop out, lil' birdie, you speak with a beak\nSend your location, then Uber to me\nBitches been hangin' diamonds on my face\nKick her to the curb, she ain't gang anyway\nAsian on the beat then the beat gets slayed\nI took it offensive, so watch what you say\nHi, bitch, got a .30, don't try it\nBall out the mall, like I'm Kobe, just buy shit\nSick of these bitches, they lie quick\nClip shoot a movie, now talkers, directors, you dyin'\nSend her ass on a hike\nI don't wanna kick it with a bitch for the hype\nReal pretty, beat her ass in a street fight\nYou know I'm flyer than these hoes like a pink kite, Asian Doll!\n\n[Interlude: Bhad Bhabie]\nBitch!\nYou mad, ho\nWhy you so mad, ho?\n\n[Verse 4: Bhad Bhabie]\nHo don't want no drama, yeah that's on my mama, commas\nCommas run on sentences are running up\nNever wanna line up, I don't do McDonald's\nFuck crazy you know I'm breakin' necks when I'm pullin' up (skrrt)\nAll my numbers lookin' outrageous\nNow the blogs handin' out praises\nGot the world usin' my phrases\nHoes keep my name in their mouth\nHope it tastes like shit when they say it (don't say my name, bitch)\nBarrin' out, I ain't got Xans in me, no\nYoung but I'm ballin' like a damn CEO\nBentley truck, said don't give a fuck\nCame from the street, Boynton Beach\nYeah, they know what's up\nBitches that hold no position, come at me, fall in my mentions\nHoes be thirsty for attention, knock a ho out this dimension\nThen continue my ascension (why you so mad?)\nHow you hoes livin' with no purpose?\nI be pumpin' venom in my verses\nBitch, you worthless, you ain't fuckin' with my worst shit\nDoubted me, now it's all comin' together like cursive (like cursive, bitch)\n$50K a show, I'm doin' 30 of 'em\n5 million by the summer, keep the numbers runnin'\nBitches showin' everything, I be understuntin' (damn)\nUnderstand, a year ago I really had nothing (shit)\nBut now I'm breakin' records and I'm makin' history (wow)\nHow can they stop me? I swear it's a mystery\nParents so sick of me, source of their misery\n(Let your kids listen to me!)\nHo, I do a million views on a slow day\nAnd I ain't gotta go to school like a snow day\nBut my... in the stu' so it's okay, bank account look like a lick\nBroke ho, you look like you sick, slide on the beat like it's slick\nBitch don't compare me to Iggy, that old ho is washed and I'm lit\nWouldn't pay her to wash up my whip (bye, broke bitch, bye, ho!)\n\n[Chorus: Bhad Bhabie]\nWhite J's, white Porsche\nWhite wrist, white horse\nHi, bitch, hi, bitch\nHi, bitch, hi, bitch\nI do not sniff it or roll it (no)\nIt do not drip when I pour it (no)\nI do not run, I reload it\nI do not save it, I throw it\nWhite J's, white Porsche\nWhite wrist, white horse\nHi, bitch, hi, bitch\nHi, bitch, hi, bitch", "image": "https://images.genius.com/e94afc30c8d7c5d54716dc9a7e4eb3b2.1000x1000x1.jpg", "year": "2018-01-16", "title": "Hi Bich (Remix)", "album": null}]}