{"artist": "Yung Gravy", "songs": [{"album": "Thanksgiving’s  Eve", "image": "https://images.genius.com/bddb28c3144dd0b8e8f7fe9cd2b85f86.500x500x1.jpg", "year": "2016-12-10", "lyrics": "[Intro: Yung Gravy]\nWhat's good baby\nIt's holiday season\nKind of sad Thanksgivings over but you know it's all good still got Christmas\n\n\n[Hook: Yung Gravy]\nI get up in it, you know I eat my spinach (aye)\nTryna stay nutritious 'cause I gotta flex on Christmas\nBring the litness, yo Momma is the witness\nGold chain with the turtle neck 'cause it's Christmas\nGot the ice, ice, ice, ice, aye, ice, ice\nAll I want for Christmas is some ice, ice, ice ,ice, aye, ice, ice, ice\nBitch\n\nI don’t really know what else I would ask for for Christmas baby\n\n[Verse 1: Yung Gravy]\nAll I want for christmas is some ice (aye)\nLook down at my wrist, it look like the Northern Lights (aye)\nSugar with the spice bitch\nEverything nice bitch\nI pull up my sleeve it feel like I hit the light switch\nI feel that Christmas weather so I got my crispy sweater\nSippin' on some scotch while I write yo bitch a letter\nBout how I’m better, and how I get this cheddar\nYung Gravy how you so fucking clever?\nWatching ink dripping of my pen feather\nGot a girl you need finessed? It would be my pleasure\n\n[Hook: Yung Gravy]\nI get up in it, you know I eat my spinach (aye)\nTryna stay nutritious 'cause I gotta flex on Christmas\nBring the litness, yo Momma is the witness\nGold chain with the turtle neck 'cause it's Christmas\nGot the ice, ice, ice, ice, aye, ice, ice\nAll I want for Christmas is some ice, ice, ice ,ice, aye, ice, ice, ice\nBitch\n\nWell I hope you guys enjoyed what we brought you today, and merry Christmas\n\n[Verse 2: Yung Gravy]\nBitch i ain't finished, my side bitch is a gymnast\nBefore I lay the pipe I gotta stretch for thirty minutes\nCause it’s Christmas\nShe can do it by herself\nBut she got real excited when I dressed up like an elf\nYou know I got the whole outfit\nBells on my kicks just so I can see some tits\n\n[Outro: Yung Gravy]\nLickety split\nFuck around and make a snowman on yo bitch\nAin’t that some shit?\nThis time of year I’m usually pouring egg nog on some tits", "title": "Flex on Christmas"}]}