{"songs": [{"year": null, "title": "So Cruel", "image": "https://images.genius.com/38dbc5d88a2b014d9a0742ef1f2f1887.500x500x1.jpg", "lyrics": "[Intro: Saigon]\nI ain't no joke, '09\nUh huh.  S to the A\nMan...\n\n[Verse 1: Saigon]\nI'm the same kid that tried to murder your brother\nNow I'm on the muhfuckin' Murder Dog cover\nAct like a nonbeliever—go 'head\nAct like you ain't read about a nigga in the Don Diva\nIt wasn't for my rhymes neither\nIt was 'bout how I cocked the gat, shot a cat back in nine fever\nWhy The Source gave me Rhyme of the Month?\nWhen I shoulda got the rhyme of modern-day time\nFuck these niggas\n\n[Bridge: Saigon]\n(Hold on) Let's see\nThis is, this is some MC shit, yo\nYou gotta be a real MC to spit on these beats man\nHell yeah, man\n\n[Verse 2: Saigon]\nI could be richer than Phil Drummond and still bummin'\nAnd I know the difference between a bitch and a real woman\nNiggas stay up 25 hours a night\nAny coward could write\nThey bark but they bite, don't devour the mic\nI am the wildest in sight\nBeen in the pen, so I can tell you how it was like\nI done seen Bloods faces pourin' it out\nSix in the morning, COs yellin', \"Order: get out!\"\nNow fuck that—it's not what the song is about\nThis is about you weak rap niggas that's out\nAnd y'all bitches in the crowd that wouldn't give us no rhythm\nWhen my shit pop, I ain't gon' give you no jizzle\nNothin' but \"fuck yous\" and bad criticism\nObama is the pres but I voted for \"?\"\nI'm the meaning of lyricism\nIf it's somebody that feel different, give him my digits—tell him to hit 'em\nHe can call me on the late night or early in the morn\nAnd that's my word, bond—we gon' get it on\nAnd I don't care if y'all get along\nCause y'all niggas is cum\nY'all niggas just ain't that strong\n\n[Chorus: Sample]\n\n[Verse 3: Saigon]\nI'm showing off with Statik—it ain't only Just now\nAnd I don't smoke cigs, but I'll give you a bust down\nCreep by wherever you hang and bust rounds\nYou gon' hear the sound of the pound—now\nThou shall not fuck with nor say B.I.G. rhyme\nIf you ain't one of the Sean's the shits corn\nMoving right along, my name's Saigon\nThe future of rap, faggot, the next icon\nIf I could just keep that gun in the house\nOr for five fucking minutes, stop runnin' my mouth\nShit, I'd be alright.  Niggas ain't tight\nThey don't write the kind of rhymes that I write\nRight, right, I'm lyrical, five-mic material\nNigga, you love the rizzle and I like to give it to you\nSo let's make things nice and clear\nI'm shitting on the whole game twice a year\nAnd they scared\nBitch\n\n[Chorus: Sample]\n\nLet my people go\nI did my time {*Echoes*}", "album": "All in a Day’s Work"}], "artist": "Saigon"}