{"artist": "Boldy James", "songs": [{"album": "Trapper’s Alley 2: Risk Vs. Reward", "title": "Costco’s", "year": "2015-02-27", "lyrics": "[Chorus]\nWhy these niggas so mad at Blocks for?\nShit, I don't know\nIs it 'cause a nigga get his bag from Costco's?\nYou got those from Costco's?\nIn a kitchen with a bird on a hot stove\nI could cook a brick with my eyes closed\nChicken and serve like Roscoe's\nMy Tahoe, ridin' round servin custos outside blow\nFree Baby Pablo, screamin \"fuck the Colombos\" since Donnie Brasco\nTryna smoke me out the foxhole\nThey just mad I'm a don like Bosco\nI put cheese on your head like a nacho\n'Cause a nigga get his bag from Costco's?\n\n[Verse 1]\nWe cruise down to El Paso, finna meet me at the Del Taco\nWas just in the mountains on the Chavo\nOut in Cabo with El Chapo\nMe and Hector, no Camacho\nAt the racetrack with Benny Blanco\nTold him \"speedboat that shit back to me, ASAP, Pretty Flaco\"\nSippin Rose, no Moscato. Castro, that's my Capo\nI'm the boss hog, head honcho\nBut the plug call me \"muchacho\"\nMuchacho, El Gato\nYeah, I get 'em for the deuce cuatro\nIf them bricks flaky, we'll re-rock those\nIf them O's shaky, we could swap those\nIf them bowls stanky, we could pop those\nGot that old lady for ya nostrils\nI've been known to hail it since a snot-nosed\nTryna bang the hinges off the spot doe\nWolves walkin' on egg shells\nNow I'm tippy toein' on hot coals\nMoon walkin' into cosmos\n\nLet's get it\n\n[Chorus]\n\n[Verse 2]\nYou got those from Costco's?\nStraight to Trapper's Alley, Alejandro\nI'm going going, back back to Cali Cali, nigga pronto\nFor them marijuana from my vatos\nSend that heroina from Morocco\nDown to Tijuana, now we outro\nTo the Caribana in Toronto\nThough you knew a couple niggas cop bowls\nMy Ricans(sp) grab it by the crop load\nDuckin long ranger on the desert trail\nStrap a mule down, they call her \"Santo\"\nR.I.P. Cecil Bri Santos, you could sell beans off Montrose\nBad bitch remind me of Salma Hayek, said she overheard the nigga convo\nWhen we was checkin into the Heights, she was checkin out my ensemble\nSaid her father sentence got overturned\nWhere she come from, it's a lot mo'\nWhere the coca and the pot grow\nWe got mo' keys than a locked door\nReppin Brick Life, shouts to Zo Sheeze(sp)\nBo Ski(sp) to Uncle Glasco(sp)\n\n[Chorus]", "image": "https://images.genius.com/1c398d15552acb2f6b9a4e1bafbb83b1.500x500x1.jpg"}]}