{"songs": [{"lyrics": "[Police Officer]\nAlright motherfucka come on!\n\n[Warren G]\nGet yo' motherfuckin' hands off me motherfuckin' police officer\nHey, fuck you!\n\n[Police Officer]\nI ain't bullshiting!\n\n[Warren G]\nMan fuck that shit man, I'm tired of you motherfuckers fuckin wit me!\n\n[Police Officer]\nFuck you up!\n\n[Warren G]\nThat's why y'all always gettin' bust on, motherfucker, shit. Y'all always tweaking man!\n\n[Police Officer]\nJust get in the motherfuckin' cell and shut the fuck up!\n\n[Warren G]\nShit man, I'm tired of you motherfuckers fuckin' with me all the time man, I'm tired of this shit man. I'mma call my bitch, she gonna come get me up out this motherfucker, aye, what you smiling at in the corner nigga? Shut up and pass me a cigarette fool. Man I'm tellin' you my bitch gonna come get me up outta here!\n\n[Phone Ring]\n[The Girl] Hello?\nWarren: Hello\n[The Girl] Leroy?\n\n[Warren G]\nBitch this ain't no motherfuckin' Leroy, aye I'm in motherfuckin' jail, you better come get me up outta here, it's me baby wassup!?\n\n[The girl]\nFirst of all I ain't yo' bitch, Second of all I ain't commin' to get you out of\n\n[Warren G]\nAhh fuck that!\n\n[The Girl]\nMotherfuckin' nowhere, motherfucker!\n\n[Warren G]\nNah Fuck you\n\n[The Girl]\nFuck you!\n\n[Warren G]\nFuck you!\nAye, thi ye, you better come pick me up from this motherfucker, that's all I know. Aye aye what you talkin' bout phone check nigga, you better wait your turn foo. Aye come get me up outta here baby, that's on the real real. Aye, if you don't i'll tell my other bitch to come get me, fuck it, I'll just drop you, fuck it!\n\n[Music/Parliament- Wants To Get Fucked Up]\n\nYo' wassup niggas and niggettes. If you ever have a problem like this don't call that broke ass nigga you got, and don't call that sorry bitch that don't give a fuck about you anyways. What you need to do is call 1-900-2-Compton (well all right!)\n1-900-2-Compton, that's 1-900-2-Compton. This show was sponsored by the niggas that don't give a fuck phone line!", "album": "Efil4zaggin", "year": "1991-05-28", "title": "1-900-2-COMPTON (Interlude)", "image": "https://images.genius.com/3ca4da71fc3013722afaf26fcb385c8f.1000x1000x1.jpg"}], "artist": "N.W.A"}