{"songs": [{"title": "Fire in The Booth Part 4", "lyrics": "[Intro]\nYo, listen\nTen year anniversary, Akala\n\n[Verse 1 ]\nUncle Akala, the FlowFather\nYou already know that I’m smarter than Arthur\nThe darker the shit get, harder I spit yet\nFools want to act like they can’t get a quick death\nHow many careers have been ended\nIn the time that I’ve only ascended?\nJust telling things how they are\nNow why would the truth be offensive?\nI was independent when everybody signed\nStill independent, respect my grind\nOwn my own masters, know what that mean?\nUnderstand back catalogue or are you green, seen?\nMeans that my kids have a pension\nI ain’t got kids just thought I would mention\nSee my intention, mangle a mention\nMurder a syllable and strangle a sentence\nStand to attention, all of your henchmen\nStill couldn’t bench him, cause he’s too heavyweight brethren\nLike old school jungle selection, come through humble a veteran\nTen years since the first album\nTen years no daytime radio\nTen years still touring that's real supporters\nWe all know why they don’t play me though\nI’m that rapper, rap about matters that actually matter\nChallenging power, what?\nEvery single tour is ten percent more\nNow why do you think that happens?\nContent matters, albums matter\nSongs they matter, lyrics they matter\nIntegrity matters, flows it matter\nIt’s word to Skiba we deal with the matter\nNo industry hype, just write what I like\nThis is Steve Biko with the mic, this iron mic\nIron Mike wouldn't like cause a fight is a roll of the dice\nLike rolling on knives, organs openly sliced\nCold, I told you the price\nColder than ice, nah, colder than life\nLiving in a warzone, hold my advice\nTake shortcuts and get cut short\nLong road, hard road but more sure\nRoad tour that I’m doing at the end of the year\nShould make all this clear\nSome only get visibility\nSome silly fool called me a failure\nI smiled to myself, these times I was on a plane to Australia\nSold out shows on the other side of the globe\nBut fools only know what’s in front of their nose\nSo they stunt, pose but they can’t sell shows\n‘Cause their music is poo and they got no flow, I know\nYou might be astonished, dog shit cannot be polished\nNo matter how you push it on the public, son\nYou cannot make them love it, son\nYou know how many rappers can pack out a venue at Addis Ababa\nGuess what? It was the only one Bob Marley ever did play in Africa\nYou write raps, I write history on the page\nAnd quite literally, an elder statesman to my own generation\nAn inspiration cause the flows that I came with is a solo play by Miles Davis\nWho don’t know he’s the greatest?\nSo if Charlie tells anybody else their fire in the booth is the best there’s been\nIs he high? Does he lie?\nNah, he knows that I’m in my own league\n\n[Verse 2]\nI’m judged totally separate\nIf we are actually going on the evidence\nYou wanna be a foe? Do you know what the level is?\nYou wanna be a pro? Can you roll with the cleverest?\nGenius, I know it\nKinda like a road side thug yet a poet\nKinda like a warrior, kinda like a scholar\nBut I can be an asshole, don’t make me show it\nI know a certain kind of supporters\nDon’t like it when I get this boasty\nYou think that I care?\nAll that show, you don’t really know me\nSee, I’m an arrogant fuck on the mic\nI am not humble, I’m only nice in real life\nWho wants an MC that does not think they’re the shit?\nThat defeats the whole point - combat sport's this rap stuff\nThat’s why a man gets slapped when he act up\nThey cannot catch us, they will get backed up\nYou can feel the energy coming through the chakras\nNo aggression, the hood’s not listening\nCause aggression is what they’re living in\nSo I keep spittin’ it, everyday I’m spinning ‘em\nCall me Akala, there is no synonym\nNobody’s similar, not the same\nI rap about life, they rap about chains\nYet, we all get dough and we all drive Mercs\nAll do festivals, all get work\nWe don’t all lecture at Oxford with a hoodie on\nCause I got no response for their nonsense\nDon’t all do education in warzones, man are shook to go Peckham\nDespite all the big talk\nThey would not walk in half of the places I step in\nCatch me in anyone’s hood on my own\nKids act like they seen a ghost\nI’m like little bro, \"I’m thirty-two years old, you think I care about a postcode?\"\nI am not invincible, I could get removed from the physical\nBut if I get murked, probably be political\nCause the things that come out of my mouth is a madness\nI am a rebellious bastard with no respect for authority\nSo I don’t suggest that you follow me\nIt’s true this could all end horribly\nBut I’ll still be the anomaly, an entrepreneur\n\n[Verse 3]\nI don’t say it cause it sounds cool, it’s actually true\nAin’t got a diamond chain, I admit it\nBut I do got an office with employees in it\nDo take youngsters all around the globe\nGet them paid for their brain and their lyrics\nWhile our media want to still paint us like we are just nothing but crooks\nAlong comes one so cool\nHe can make it cool to rap about books\nAnd you can think that’s neeky and stupid\nBut all that shows that you’re clueless\nCause the global revenue for books every year is like ten times more than music\nHmmmm, now I have sold how many books?\nAnd self-publish, how does that look?\nFor those that only respect cheques\nSwear the accountant ain’t cookin’ the books, son\nAnd I don’t even think that capitalism should decide how you rate a rap on a rhythm\nThat is the age we’re living in, isn’t it?\nIt’s all about materialism\nMore important than any paper debt, do you check for the youthdem?\nLet’s see, any one of them little thugs right there\nHe could have been me, he could have been me\nIt could have been me\n\n[Verse 4]\nFifteen, I was in chimes[?] and trends\nColiseum way back then surrounded by big men\nIn the clap of a skeng\nYou know what was being smoked in green, but everybody pretends\nThis time I kicked ball for the Hammers\nWeed and the girls put a spanner in the matters\nFact of the matter is, lost my discipline\nLate night bredrin, whip with a stick in it\nHe took it from under his dad’s mattress\nI never grew up with dad, who’s better off?\nComplicated, I’m undercompensating\nEverybody talks road, I let ‘em fake it\nMy olders would organize crime, they lick banks\nSo I ain’t gassed when you say you bag grams\nBadman, what's that? Madman, stop that\nThey manufacture gats, we just pop that\nThey import, export, we just shot that\nHustle, I ain’t saying I knock that\nI’m just saying we should see it’s deliberate\nAnd by now we should all be sick of it\nI’m working on ways to get rid of it\nMass incarceration, ridiculous\nSo I go to jail and I chat to the mandem\nFire in the Booth Part 1\nWhat I rapped them? Explaining the system and how it will trap them\nAction more than rap then, hmm\nAll my Fire in the Booths, they have been studied as texts\nBy countless PhDs ‘round the globe\nMy youth now have some respect\nAnd they still bang on the block, from Brixton to Brooklyn\nPalestine to West Papua\nBut despite all the personal comfort, I still feel sick when I think of the massacres\nThe world is fucked\nThere is enough to go around, but we are ruled by -(cunts)-\n\"There he goes preaching again\nAkala, Stick to the script, just stunt\nTell ‘em about your whip, brand new something and sit\nHow many girls wanna...\nWell cuz’, come on, let’s be honest\nI was not ugly before this shit\n\n[Verse 5]\nSo you can imagine, but the brain power you cannot fathom\nI mean it truly from the bottom of my heart\nThough please jump on the bandwagon\nI’ve made it cool to be conscious again, say thanks\nCause I know that you’ve got more sense\nI know that you know yourself\nWhen you are sat down with your gran and her friends\nThat’s our culture, respect for the olders\nIf you snort coke then we call you a cokehead, no biggie\nWant to rap with Akala? So silly\nI’m like my gran’s name, so Millie\nTen years first album, ten years no daytime play\nBut in October we’re selling out KOKO\nCome along learn about a show and a stage\nNo hype man, no cupping a mic\nMusicians and visuals all mixed right\nAnd like forty songs squeezed into an hour and a half\nThe supporters actually like\nConsistency matters the rest is just package\nImagining these rappers is tragic\nSitting at home, having to watch me\nThey’re like, \"I swear its black magic, yeah, black magic, Griot, tradition of the rappers\nI studied my craft, you mandem are slackers\nBow in the presence of greatness\nCause you’re only trained to rate fakeness\nLove that I get is so overwhelming\nI don’t even see no haters, yeah\nFew men have got more status, but which one has more respect?\nThat’s what I thought, Akala’s the one that they still can’t get\n\n[Verse 6]\nCause I’m like Dennis Brown meets DMX\nI’m like Shabba and Brockie and Det\nBurning down old school, Stratford Rex\nI feel sorry for whoever comes next\nThat’s like running after Usain Bolt\nThat’s like singing after John Holt\nThat’s like trying to floss on the Pope\nHe’s so beyond money he tries to act broke\nI’m like every book written at once\nSo I got the youths’ head fucked like Skunk\nLittle bit of reggae mixed with a bit of punk\nAnd the discipline of a Buddhist monk\nLike, how it feels when you come she comes at the same time, now you are one\nOof, you would swear there’s a god when you’re done\nEven if you don’t believe in one, son\nAll of my children have left the building\nCharlie can’t have them back, cause I have killed ‘em\nIf I don’t feel them, they ain’t real then\nFate is sealed then\nJust don’t deliberate over the Illa State soldier\nThe middle weight roller, didn't we take over?\nDidn’t we take over? The middle weight roller\nThe Illa State soldier, deliberate over\n\n[Verse 7]\nLines that I rhyme with a force\nSo hard it’s separating your mind from your thoughts\nKnow that I am inclined to divorce\nYour little big mouth from the height of your horse\nSee it’s a sign of the times that we walk\nThose that talk sense get outlined in chalk\nThose that talk shit get a line of support\nRight round the block for the minds that they bought\nFor the dominant philosophy, the legal armed robbery\nThe global monopoly that’s fucking up the only planet that we got\nIf I had my way I’d tell the truth, I’d let them rot\nBut unfortunately, it’s not, fuck off\nThis is so easy I love this shit but I’m almost bored\nI could write one of these every month\nBut to give them a chance I only wrote four, cor\n\n[Verse 8]\nMan are not training\nThey’re not ready for the levels of Shaolin\nThat’s almost an hour of bars, my dog\nNone of which is on my albums\nAnd I got six, and I write books and plays and scripts\nStill find time to go teach in the bits\nWho told you that he’s not the shit?\nWell, a bloody liar he is\n\n[Verse 9]\nA wha' dis? Dis lickle idiot try chat to me, you know me can't feel it\nA boy try swarm me\nYour eyes, dem tarly too damn big for your belly\nNot on your nellie, not on your life\nCould you find one to touch him on the mic? Yeah right\nImagine a famous rapper from the States barin’ for ten minutes straight\nWith the bloody cheek to do it double time, every time\nHow much piss does he take?\nKnows that he’s great, knows that you’re fake\nKnows that he won’t ever barf on your mate\nKnows that you’re late\nLook how they anticipate every word that I say when I speak\nCause it’s the knowledge of Timbuktu\nMixed with the slang of a London youth\nAdding in the heart and the soul of blues\nMy youth, now how can I not go true?\nHalf of a cracker, plus half of a coon\nHalf of a celt, plus half a maroon\nIf I'm feeling anything that’s close to half-hearted\nYou’re half more than half doomed\nHalf of my tune contains more content than every single thing you’d ever do\nGassin’ is easy, but only a few can spit content and still slew\nI’m sure you noticed it’s true, true\nOne of them is not you\nYou wot?\n\n[Verse 10]\nYou wanna have a barney?\nWith the magic mountain machine gun army?\nWith the only one that is channeling Marley?\nYou watch rappers while I’m studying Garvey\nLeft that, we can all see who’s the best at\nYou came for connect four, I came for a chess match\nNot the same league, even the same sport\nLiterally hundreds of stamps in the passport\nNot the same league, even the same sport\nLiterally hundreds of stamps in the passport\nAnd I ain’t diss black women, to make my livin’\nSo who’s more successful then him?\nYeah I got love in my heart\nBut it’s not all peace and love, nah nah are you kidding?\nYes there are things worth killing and dying for\nEnds ain’t one of them tho, why you lying for?\nNow if a man runs in your house\nThumps your mum on the side of her mouth\nWho in the right mind wouldn’t understand why you ended up taking him out?\nYes, love is not soft or sorry\nLove is so tough it can make your mum catch a body\nLove’s the only thing worth killing and dying for\nThat’s what I’ve learned in my time on this Earth\nThink that I’m wrong? Go to a lifer’s wing\nLook the mandem in the eyes\nDone that many times, got one too many rhymes\nThe London in my lines, a dungeon for these guys\nQuestioned them to find, a hundred at a time\nMuster and define, the cusp of what is rhyme\nClutchin’ and I climb, I pop the level line\nWas always at the top, but now they recognize\nTrust that you recline when I go double time\nThe flow is so ridiculous, I be the prophesised\nGuys are ill-advised to dive into a fight\nWith I, the wicked eye, you will never get a blight\n\n-Ruins Of Empire Piece-\n\n[Verse 11]\nAnd it seems I was there\nWhere? Everywhere\nEvery battle ever fought\nEvery stab, every shot\nThrough the ages of humans, this killing machine\nI could feel everything though\nIt wasn’t a dream\nI was every soldier that had ever fought\nWith a shield and a sword\nAll the blood ever drawn\nFrom a dagger, or a bayonet\nAn axe that will slay your neck\nAutomatic gats that clap only spraying, death\nI was in a tank that exploded in Iraq\nIn a drive-by in gang wars spraying out of cars\nI was in ‘Nam, dropping napalm, but it burned my skin\nI was also Viet Minh\nI was an Italian massacring Ethiopians\nBut the bullets only pierced my flesh because I was both of them\nI could feel every single wound of the flesh\nBut also the pleasure of causing the death\nI was a soldier of the Caliphate on a crusade, a killer\nUsing Christ in exactly the same way\nI was every woman ever killed in a witch hunt\nOr every little girl forced to grow with a split soul\nCause men like to snip clits and zip bits closed\nSo the rape feels nice\nBefore they take my life\nI was fighting for liberation, a woman and general\nBringing death to cowards that sold my genitals\nOne moment I killed to be freed\nThe next, I was a monarch that killed for my greed\nThutmose the Third\nAlexander the Fake\nCaesar, Napoleon, Francis Drake\nThe arms of the state, the armies that are great\nBut I was also the resistance that’s hardly ever praised\nI was every indigenous person of America\nThat died trying to protect their homes from a predator\nThen the robe-cladden Roman senator\nAnd every noble that showed you the ways of the treacherous\nI was in the Belgian Congo hacking off limbs\nIn Rwanda, Akazu doing the same thing\nI was a Japanese general occupying the Philippines\nA Filipino child too young to know what it means\nI was at Sharpeville, I was just two\nMy mother, with a bullet in her head, and I knew\nBarely out of her womb, I played with her wound\nI knew life was a cycle, she’ll be back soon\nI was a soldier of Ashanti resisting the British\nBut at the same time still selling humans to the Dutch\nIf you’re honest with yourself and you look back through human history you’d see that we’re totally fucked\nCause I was that little girl in that church in Alabama\nThen [?] was a [?] Margaret Sanger\nThen I was Paul Warfield Tibbets Jr\nFeeling just fine in a B-29\nI did my job\nOne-hundred thousand dead\n-(Greasy. Yellow. Japs)-\nI went home to relax\nThen I was every child ever born with deformed limbs\nCause they were just pawns on a board to inform kings\nI saw sharks following ships, intrigued by the trail that comes overboard\nI saw sharks following the ship I was on I knew then that it couldn’t be long\nWe had tried to get free\nBut as if that were wrong\nWe were thrown overboard from the deck of the Zong\nSo many bodies that the sharks couldn’t finish the flesh\nIt took the waves to administer death\nAnd I joined the rest at the bottom of the sea\nThe uncounted millions that dreamed to be free\nThe next minute I was back on a ship\nThis time as a soldier of the French\nRight off the coast of Haiti we made a gas chamber for African rebels, I couldn’t deal with the stench\nThen my head was chopped off\nBy one of Dessalines’ henchmen\nHe gave the order for killing all Frenchmen\nThen all I could see was pyramids\nCan you see?\nDesigned by man's mind but built by his greed\nThe strangest pyramids, I ever did see\nWas not built by stones, but the bones of families", "year": "2016-06-04", "album": "10 Years of Akala", "image": "https://images.genius.com/bd174bbb42265536ee1741370f5dc593.600x600x1.jpg"}], "artist": "Akala"}