{"songs": [{"title": "Bonafide Hustler", "lyrics": "[50 Cent]\nYeah, I'm a special kind of nigga with mines, y'know?\nI grind, I gets my paper, y'knahmean?\nHa ha ha, oh yeah\n\n[Hook: 50 Cent]\nI'm a bonafide hustler\nNigga get out of line I'll gut, ya\nMe - I'm bout my paper it's fuck, ya\nIf you, play games with mine\nI come at you from behind with my nine\n\n[50] I'm a bonafide hustler\n\n[Verse One: 50 Cent]\nThey say heaven's for churchgoers and hell's for the heathens\nSo I'mma just ball the fuck out while I'm breathin\nEighth after eighth, what'chu know about that fast flip?\nCrack spots, smoky fiends sucking on that glass dick\nNow Sham stay askin for a dime for 9\nI'll tell you what, I'll hook you up just one last time\nCustoms is comin son is pumpin watch the packs dissolve\nSingles, C-notes to food stamps, we stackin it all\nThat's that joint what's his name son? I don't remember\nThat Haitian nigga with the guitar that sing \"Gone 'Til November\"\nI do a buck-forty in the rain, hydroplanin\nLamborghini Diablo, candy painted\nGot that hydro burnin, got the burner in the stash\nHit the hazards, hit the AC, then it come out the dash\nIf I go in the club son and niggas start dumbing\nStart shooting and I ain't strapped, fuck it I'm running\n\n[Hook] - repeat 2X\n\n[50] I'm a bonafide hustler\n\n[Verse Two: Young Buck]\nI been out here for too long, I deserve to get a bird\nThe fiends know my name now from standin on this curb\nI got blood on my shirt, and a handful of crack\nA bunch of lil' niggas with dime sacks in they backpacks\nCome and get it we got it, take a trip to the projects\nYou see the police, but we gon' sell our dope regardless\nYou niggas know me, from fillin up your heroin needles\nI'm connected with them people who don't speak no English\nWe ain't scared of the roll, we just get it and go\nYou see them Tennessee tags nigga you already know\nI don't trust no ho, that's how T got popped\nHe showed a bitch where his stash was, she told it to the cops\nMe and Priest had the streets on lock\nHe'd break down the blocks, I'd open up shop around the clock\nAnd I ain't gon' stop, so soon as you come home from the pen\nWe at it again, we gettin 'em for ten my nigga\n\n[Hook] - repeat 2X\n\n[50] I'm a bonafide hustler\n\n[Verse Three: Tony Yayo]\nYou know I'm a hustler ey\nNow I'm headed down South and that's my word\nI'm on the Greyhound bout to move these birds\nAnd if these niggas don't let me sling\n{*click clack*} I'm out there robbin everything\nGot a brand new MAC, and a P-89\nYa's a hustler, man I stay on the grind\n9 grams of heroin, 100 grams of coke\n12 o's of mushrooms, 2 pounds of smoke\n3 gal's of dust juice and a tank of LSD\nAnd a thousand pills of every kind of ecstasy\nHash, hashish, I bought a sixty-two\nWhen I was younger with my crew I had them niggas sniffin glue\nIt's 40's for the gram to them truckers in Bamas\nAnd I can chef up a miracle with Arm & Hammer\nI'm a hustler, man I supply the fiends\nI'm a hustler, nigga I'll sell you a dream\n\n[Hook] - repeat 2X\n\n[50] I'm a bonafide hustler", "album": "Straight Outta Ca$hville", "year": "2004-08-24", "image": "https://images.genius.com/c4f8631214daf9f3357f633e0f045d6c.1000x1000x1.jpg"}], "artist": "Young Buck"}