{"songs": [{"year": null, "image": "https://images.genius.com/bb2a12043d5bed3ffa2d2b0d3814b69b.600x600x1.jpg", "title": "The Grimy Way", "album": "Lyricist Lounge 2 ", "lyrics": "One time..\n(There's really, nuttin, realer than this, realer than this)\nOne time\n(This is it right here Dunn)\nOne time, before I go Dunn this is it right here\nRight here, this is it right here Dunn\nOne time, right here one time\nAiyyo, you know how it goes, aiyyo\n\n[Big Noyd]\nAiyyo, aiyyo, I produce threats, tecs\nThe underworld sweat when I rep for my set\nI pull out tecs and let wet, ice drip\nFroze on my neck, explode when my 2G whip correct\nOut of respect, M-O-double-B top shit\nBut logic, y'all niggas know y'all can't fuck wit\nFrom past incidents, shootouts, and fist battles\nScuffles through state lines, you can't stop mine\nIt's a crime to the dumb deaf and blind\nWay before your time out of line niggas walk straight\nWhen I approach my I, rep my Infamous bloodline\nNiggas get your guns it's thug time\nCame from no frills to skips, nights that gat clips\nA cold cold world to this icy hot shit\n(Nigga) Scars, bars, tappin niggas shit\nI'm cuttin 'em, buckin 'em, and fuckin they bitch\nYou like, \"Who that nigga?\" A smooth cat nigga\nWalk around with two gats too nigga\nStraight like that nigga, smack that nigga\nIf I don't know him then blast that nigga\n\n[Hook repeat 2X: Prodigy]\n(Aiyyo) The only way to live is the grimy way\nThe only way to get ahead is the gun way\nWe don't play, I can't let 'em stop me and shock me\nThey try it I pulled out and pop three\n\n[Big Noyd]\nThis one right here Dunn, aiyyo aiyyo\nThis goin out to my dearest, realest\nColdest most closest holdin me down\nChrome double digit cali-BLAOW, never apart with it\nCock and spark with it\nGet down on my knees and cross my heart with it\nCause it's real, when I use it to protect my life\nShit was real when he shot a nigga over his wife\nThem be the breaks, guns, drugs, (??)\nClown tried to give me pound I threw it down in his face\nI get down - in any town, get down in any ghetto\nAny time spit rounds, what the fuck y'all niggas thinkin?\nYo for the dough we can spit, my style flow sick\nFor them sixteen bars, I get in you God quick\nYou don't want none of this, shit I'm hot as a pit\nCheck the shit I got 'em shook now they ride on my dick\nDon't forget I rock for those lovin it, those thuggin it\nHoles in they clothes and the less unfortunate\n\n[Hook]\n\n[Big Noyd]\nAiyyo, aiyyo\nAiyyo y'all niggas can't stop me, watch me then\nCatch me flyin in my Benz, lovin it\nThe trey-double-zero, thuggin it, I was born to floss shit\nBut never could afford it\nBut now I got ones and guns to re-insure it\nReach for my spine, pull out a fuckin nine Tourist'\nThe road to the riches, what I'm on it\nAll I need was the ones, and my Dunns\nThe motherfuckin beats, I'm makin choruses where my name be\nNoyd, N for Nasty\nO, you obsolete, Y? I got Demons\nThat's what that D be, check me when you see me in the streets\nBelieve I got toast cause we close like uno dos\nAnd floss and of course Q.B. nigga rep\nSee you ain't hear me yet, Q.B. nigga\nFuck bein affiliate with, I'm official\nDie with the initials on my chest\nBe damned if I don't rep the hood to the death\n\n[Hook] - 2X"}], "artist": "Big Noyd"}