{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/4fb504d5b4dda8a236c224bb1cc11e2a.800x800x1.jpg", "title": "CuDi Spazzin’", "year": "2008-07-17", "album": "A Kid Named Cudi", "lyrics": "[Intro]\nCleveland style\nYeah, yeah, yeah\nPlain Pat, what up\n\n[Verse 1]\nWhoa, Nellie, I don't even think they ready\nThey flow is too shitty, not me I can't get with it\nGon with it, Kid Cudi the illy, rep my city\nIn the navy blue Cutlass, no roof above him\nHoes, they love 'em, model girls I cut and fuck em\nHey, I rep that double-O, you ain't on the ho\nI got my man Chip the Rip wit' a Spanish bitch takin' flicks\nAnd she gon take a lick, yeah, mami\nLater on, we gettin' sushi, mami eatin' edamame\nWest Coast so I'm ghost, holla at my nigga Travie\nWe wheelin', pick up the Heroes or the Gym Class topping\nThe charts with the art that exhibits couldn't exhibit\nThe grizzle, I live it, run passed the timid livin'\nIn the bubble, keep the number when I mumble\nWit skill, red-rum them trynna figure out him\nBaptize myself in the river of Henn-essy\n\n[Chorus]\nOpen up your heart and you will understand me\nFall into the music and let yourself go\nOpen up your heart and you will understand me\nFall into the music and let yourself\n\n[Verse 2]\nGo, go, my Mach 5 flow\nDo you want mo' you shall receive with a sea\nDeep in the realm if you felt like you were alone, no fair\nSalute the underdog, I am here in the clear\nOver there, niggas ain't diff, what if\nI was them, I would be a simp, no dopeness\nWill ever, ever be my aura (Aura)\nSteve Urkel nigga, lookin' for a Laura\nProceed, I am the One, too cliché to call me Neo\nIf anything dope has arrived rap wise as far as overall killin'\nBody, embody him, now that the mores to accommodate the caucuses (Caucuses)\nMy heart is titanium alloy\nSo if you come up with ploys to destroy my passion\nI'ma tell you now, you are better off passin' (Passin')\nStop writin' checks that your ass can't cash in, bro (Bro)\n\n[Chorus]\nOpen up your heart and you will understand me\nFall into the music and let yourself go\nOpen up your heart and you will understand me\nFall into the music and let yourself\nOpen up your heart and you will understand me\nFall into the music and let yourself go\n\n[Outro]\nYeah, yeah, yo, yo\nPlain Pat, what up? Emile, what up?\nDot Da Genius, what up? Rob Walker, what up?\nWale, what up? Travis, what up?\n88, what up? Kanye, what up?\nSK, what up? My nigga, Hawk, what up?\n10.Deep, what up? Choo Choo, what up?\nMy nigga Ritz, what up? My nigga Zully, what up?\nPitbull, what up? Big Poe, what up?\nMickey Factz, what up? Kidz in the Hall, what up?\nBrooklyn, what up? Cleveland, what up?\nCincinnati, what up? Columbus, what up?\nToledo, what up? Ohio, what up? Uh"}]}