{"artist": "Professor Green", "songs": [{"album": "Alive Till I’m Dead", "title": "Closing the Door", "image": "https://images.genius.com/03dd13269b9289e452bde3eb7d1a6577.1000x1000x1.jpg", "lyrics": "[Verse 1: Professor Green]\nI don't mean to be ungrateful\nAnd I could never tell you something if it ain't true\nI'm stable and I find it's easier for me\nBeing single than it is being faithful\nI guess I'm where I gotta be and I can't take you\nAnd you deserve more so why would you make do?\nI ain't no angel, and there ain't nothing you can say to me\nTo save us cause it ain't you\nI hold onto everything we went to\nI'll always remember what you meant to me\nNow there's business I've got to attend to\nMoney for nothing and the drinks are free\nWhere I'm going, there's no place for\nAll the little things we kinda got a taste for\nBut you know, there's a lot I'm gonna miss\nThere ain't a page long enough for me to write a list\n\n[Hook: Fink]\nIs this as good as it gets?\nIs this situation gonna turn into one of life's regrets?\nIs this as good as it gets?\nIs this situation gonna turn into one of life's regrets?\nThis is how it goes\nEverything around me's so full of possibles\nClose the door behind me, start thinking bout what's in front of me\nOoh\n\n[Verse 2: Professor Green]\nI don't mean to be ungrateful\nAnd I could never tell you something if it ain't true\nI'm stable and I find it's easier for me\nBeing single than it is being faithful\nI'm not alone cause I know you've got needs too\nAnd from a distance it's nothing I'd concede to\nI'd rather leave you than insult you with the lies\nCause I'm really not as sly as to deceive you\nTime for us both is so precious\nBut selfish is never what I meant to be\nA business where sin is relentless\nAnd nobody sees nothing in the VIP\nI don't know if it's a place I was meant for\nOr if it's everything I always ever dreamt for\nBut I know there's a lot I'm gonna miss\nThere ain't a page long enough for me to write a list\n\n[Hook: Fink]\n\n[Outro: Professor Green]\nOnly time will tell if I'm doing the right thing\nSee, honesty's all about the timing\nIt's frightening but I'm tryna make it easier for you\nBy closing the door behind me", "year": null}]}