{"artist": "Inspectah Deck", "songs": [{"title": "Uncontrolled Substance", "lyrics": "*eerie winds blow*\n*winds die down as beat drops*\n\n[Inspectah Deck]\nIt had to be this way\nThis is for real\nNobody said it would be easy\nSo let it be (ooh.. oh yeah)\n\nAiyyo, S.I.N.Y., Killa Bee hive\nEastside, duckin' the 5, roll wit' the live\nSweet Love, sweep me in the bug eye, we 'bout to glide\nHead fried, spittin' the scribe, move in disguise\nWan' test I? Access denied\nI live and die by the motto: let none survive\nLivin' off my last cut, can't hold the sword up\nYou can have that for free before I take your best offer\nStalker, preparin' for your sayonara\nTorture, test my waters I come like orca\nNiggas need life supporters, for bein' so weak\nI speak as a veteran and lace the heads I've creased\nAnd leave my footprints wherever I've blessed my presence\nI.N.S., livin' legend 'til the essence\nGiven with no prescription, this is the medicine\nSettin' a new standard, they fail measurin' up to\nThey suck too, thorns in the hustle\nPawns in the struggle, darts fly like C.I.s beyond the jungle\nTrouble Man can't dance the Hollywood Shuffle\nKnees buckle when the Killa Bees come thru\nAll you heard was \"1, 2\", then the gun blew\nQuestion is, \"From who?\", numb you\nLike a 100 CC's of morphine, taken daily\nKeep out of reach of your offsprings\n\n[Hook: Shadii of The Force MD's]\nToo hot to handle, too cold to hold\nYou pumpin' that substance, that's uncontrolled\n*repeat 2x*\n\n[Inspectah Deck]\nToo cold to hold, substance uncontrolled\nFive-O said, \"Tell it to the judge\"; I never told\nNever fold, though some turn like fake gold\nYoung and old I lock down like parole holds\nIn the midst where the clips blow, I rip shows\nHit your zip code, my sick flow condones\nSoon to spread like Ebola, the autopsy showed\nThe reports, another John Doe — overdoser\nOverexposure, facin' the flame thrower\nI hold ya hostage — code name's the Ayatollah\nMind controller, 2009 time quota\nThe high roller, sting like a king cobra\nBlow the whistle on kids who unofficial\nPistol pops, ceremony deep within the gristle\nNickel and dime, rhymes sign of the times\nMy lifeline, bubble like a fine wine, dyin' for mines\nThe dopeman, deliver like the postman\nPatrol man, saw the hand-to-hand, did I run?\nThey know I got the teens strung, plus the fiends come\nIn abundance, lined up, spendin' 100's\nThe substance provides, continuous high\nI'll give you one free for every 5 sides you buy\nGettin' high off my own supply, low in the ride\nWith the low eye, daybreak and makin' dough rise\n\n[Hook: repeat x2]\n\n[Inspectah Deck]\nMy style's so underground, I write rhymes on fossils\nUse as directed and wear protective goggles\nShaolin's the borough, rap Picasso\nBlow like a hollow-point, foes sure to follow\nPop a bottle forever, can't stop tomorow\nChewin' all food for thought, hard to swallow\nCold like Chicago winds, taps on my convo\nEl Diablo cross the Verrazano\nP.L.O. Style, released while the beasts raid\nAnd those who can't stand the heat, they seek shade\nThe rapture was told of how one man tackled the globe\nWe go so deep, it rattles your soul\nI see many have come, but few are chose for the role\nIn this ritual, rhymes walkin' on hot coals\nQuick to spot those who pose as friends and foes\nWind up violated like I was the P-O\n\n[Interlude: Shadii of The Force MD's]\nSatisfaction or your money back\nGotta keep to makin' comebacks\nIt's the best that you ever had\nGot you fiendin' on the next bag\n\n[Hook: repeat 2x]\n\nUncontrolled...", "image": "https://images.genius.com/19b06abfed788ae492f578fa0afb063f.1000x1000x1.jpg", "album": "Uncontrolled Substance", "year": "1999-10-05"}]}