{"artist": "Doughboyz Cashout", "songs": [{"title": "Bitch Be a Bitch", "album": "Free Roc", "year": "2010-08-25", "image": "https://images.genius.com/886f76cc82f02926641911a86165a7dc.500x500x1.jpg", "lyrics": "[Hook]\nYou let a bitch be a bitch, and a ho be a ho [x4]\nYou got the game fucked up and I'mma let you know\nYou let a bitch be a bitch, and a ho be a ho [x3]\n\n[Quis]\nYou know how these hoes be\nMost of them stone cold freaks\nI'm iced up and you not, so she chose me\nWhat you the police? Loosen up them cuffs\nLil boy you must be nuts wifin up that damn slut\nBut you ain't heard all the rumors?\nYou don't know by the rep?\nWhy you trying to keep a bitch that don't wanna be kept\nNow it seem like everyday its something new\nTrying to argue over a ho, man wassup witchu?\nWe beefin over bitches now? Whats the world coming to?\nYou should be proud that a bitch thats fucking me is fucking you\n(Man but I love her!)\nShutup, let me talk for a second\nCause all this arguing back and forth is really getting pathetic\nAt first I only fucked the bitch just to teach you a lesson\nNow I'm scared you gone kill yo self how much you stressin\nAt the end of the day, a ho gone be a ho\nI'm on my street lord shit, never love em like my dough\n\n[Hook]\n\n[Payroll]\n4-1\nYou let a bitch be a bitch, don't fuck up the rules\nYou put yo trust in a ho, you getting set up to lose\nI been fuckin hella hoes since my younger days\nI den see it all, heard it all, I know how these bitches play\nI know this ho from round the way, that got cuffed by a lame\nWhile she running round fucking every nigga with a name\nShe a cute bitch, but really she a rat ho\nI ain't even get a room, I fucked her on the trap floor\nNaw I ain't a asshole, I'm just being real\nThis bitch out here hoeing, and got her nigga ready to kill\nHe all beefing with hoods, tryin to claim his goods\nI wasn't raised that way, dude I wish I would\nI'll let a ho go quicker than a low bow\nShe fucking withcha enemies, you know thats a low blow\nBut she really ain't caring, and she had a nigga starin\nBut she fucking everybody going overboard with sharing\n\n[Hook]\n\n[Kid]\nSuck it up, nigga don't be a dumb fuck\nYo bitch cold hearted, nigga so button up\nLet her get the wifey role you must be dumb as fuck\nShe'll let the crew hit if she get drunk enough\nWhat the fuck, wrong with you niggas?\nThat's everybody ho she don't belong to you nigga\nIt was only right to make a song to you niggas\nNot a diss, so don't take it wrong lil niggas\nI'm trying to put you on some game\nMy man say he saw her slanging pussy up on backpage\nGive her 20, no prob blow job\nAn extra 40? She go dumb as ghost ride\nDon't stick by that ho side, all she doing is cheating\nOnly time she ain't fuckin is when she come on bleeding [Ugh]\nDon't be a fool\nYou hear all the rumors and they true\nLet that ho do what she do\n\n[Hook]\n\n[Dre]\nYou let a bitch be a bitch\nI'mma put her in her place\nI ain't got time to waste\nBitch I'm on a paper chase\nSee you chase these hoes\nI chase this bread\nI'm at the crib in yo bed\nGetting some head\nYou a lame\nI'm a baller\nI prolly get the pussy and prolly won't call her\nSee I don't trust hoes\nI'd rather count my paper\nShow every weekend gotta get this paper\nFuck a hater\nAnd fuck a ho\nI'd rather cop jewels in the dark yeah they glow [Bling!]\nGot killas from 7 mile to the Mo\nFucked her on the bed, then we went to the floor\nShe really ain't shit, but she a bad ass ho [Bad Bitch!]\nFuck with every nigga from the hood that got dough\nShe wanna fuck me, now she wanna fuck pay\nBitch you don't know Doughboyz don't play?\n\n[Hook]"}]}