{"artist": "Warren G", "songs": [{"year": null, "lyrics": "[Verse 1]\nMusic open up your arms, take a brother in\nBass take me to a place I ain’t never been\nMy ink pen touch pace, take my pain away\nSongs, take away my wrong, make it right again\nI know we’ve been through some bad shits\nA lot of ups and downs, just me and my bitch\nBut every defeat only made me stronger\nI rose to my feet and I stood up taller\nFor you at the end of the day\nWhen I say I'm gon' stop this shit, turn around and walk away\nI can't, ‘cause that bitch pay a nigga so good\nI wouldn’t do it different if I could\n‘cause it’s me for you and you for me\nAnd all I see is you and me\nBaby, I’m\n\n[Hook]\nStill in love\nSho' 'nuff in love with you, hey\nStill in love\nSho' 'nuff in love with you, hey\nStill in love\nSho' 'nuff in love with you, hey\nStill in love\nSho' 'nuff in love with you, hey\n\n[Verse 2]\nIt feels like we’ve been together for so long\nMe and my two turntables and a microphone\nHold on tight, I can’t let you go\nBringing Snoop to Dre? That was a stripper’s stool\nBuilding blocks, west coast infrastructure\nFrom hip hop to the whole gangster rap culture\nFirst California nigga on Def Jam\nNowadays niggers getting signed out of webcams\nLook at some of these damn labels I grew up with\nThey got rich and switched up on some other shit\nWe millionaires, damn near billionaires\nI’m like damn, I helped all these fools get there\nBut now niggas only call when they need something\nI’m in the lab, puttin' to Al Green\nBaby, I’m\n\n[Hook]\n\n[Verse 3]\nI ain’t write this for nobody, I ain’t trying diss nobody I’m just being real\nUp and down since training wheels\nAnd I’m fly, no co-pilot\nNow what you know about it?\nMe, my stuff and I, respect my rep\nWest up, chest up, vest up\nRecognize the real lies, who’s next up?\nIf you ain’t ready for a ride, don’t step up\nI’m OG’ing the lane, gotti in the league\nSo how the fuck you gonna coach me in your league?\nPut the wrong out fire for another kush tree\nHaven’t seen more dollars that you ever could see\nSum it all, rap it ain’t nothing but love\nI’m just saying what’s on my mind\nBaby, I’m\n\n[Hook]", "image": "https://images.genius.com/5686f9398745abf989ef2336fa794264.307x307x1.jpg", "album": null, "title": "Still in Love"}]}