{"songs": [{"lyrics": "[Verse 1]\n6AM and I’m dyin' for breakfast\nYawn and stretch then I’m diving for shellfish\nBack up at the surface in a second or three\nWith a trophy Abalone from the depths of the sea\nWater front critters in a symphony of sniggers\nThat’s a pretty big meal for a pretty little dipper\nHow you gonna carry home all that food\nI’ma kick back slow and point my toes at the moon\nCause\n\n[Hook]\nMy Belly is a table\nMy Belly is a table\nWhen I’m laying on my back\nSnack plate upon my navel\nEscargot, crab salad on a bagel\nMy Belly is a table\nSay, say say what!?\n\n[Verse 2]\n6PM clam diggin all day\nBig fat Belly like the grand buffet\nYou bobbin with the best back stroke on the river\nPotlucks stretch from his throat to his liver\nI’m never late for dinner, I make no reservations\nAll I do is pirouette into a den of celebration\nWith a delicate maneuver truth be told\nMy otter pop used to call it the sushi roll\nYou see...\n\n[Hook]\nMy Belly is a table\nMy Belly is a table\nWhen I’m laying on my back\nSnack plate upon my navel\nCrawdad, cocktail, prawns, basil\nMy Belly is a table\nSay, say say what!?\n\n[Bridge]\nShhh shhhh who’s making all that noise!\nWe’re trying to sleep!\nI’m trying to sleep over here!\nMe too, me too, me too\nMe too, me too, me too\nWho’s that?\n\n[Verse 3]\nTwelve o’clock midnight quiet on a beach\nNot a creature is stirring they’re defiantly asleep\nAll except one, eyes peeking at the shore\nMind on his stomach and his stomach on more\nSlip in to the water where he nestled with the bottom\nIf he wrestle with the mussel he will render it forgotten\nRise with the take found lights in his face\nAnd the whole wide lake lights like surprise we’re awake!\n[Surprise yayyyy!!]\nI hope he caught more than one!\n[That'd be great, food, food, foood, food]\n\n[Hook]\nMy Belly is a table\nMy Belly is a table\nWhen I’m laying on my back\nSnack plate upon my navel\nCalamari pan fried scallops and potato\nMy Belly is a table\nSay, say say what!?\nSay, say say what!?\nSay, say say what!?", "title": "My Belly", "album": "My Belly", "image": "https://images.genius.com/6358fbb1b1e756544a5c431721d5b1fa.1000x1000x1.jpg", "year": "2016-09-09"}], "artist": "Aesop Rock"}