{"songs": [{"year": null, "title": "Let’s Get Smart", "image": "https://images.genius.com/bdd653946582aa8175d2fe527924778f.500x500x1.jpg", "lyrics": "[Intro]\nThe Works of Mart\n“Plus I’m very smart”\nIt’s different\nJust different\n\n[Hook]\nYes, this is Saigon, yes it’s Mart\nThey done dumbed it down, now let’s get smart\nThey done dumbed it down, now let’s get smart\nLet’s get smart “plus I’m very smart”\n\n[Verse 1]\nNah Preem, I ain’t come around to dumb It down\nI done started a revolution, I ain’t running now\n‘Cause I don’t yab about having fun, I’m underground?\n‘Cause the industry couldn’t get me to become a clown\nMel said don’t push him ‘cause he’s close to the edge\nThe one to fail shit, most of them dead\nIt’s ironic if have some bread to put some toast to your head\nYou just wanted to go to bed, you wanted a wanted poster instead\nTrying to be something you’re not got you fronting a lot\nStop using hip-hop to corrupt the block\nThis nigga preaching the life that he doesn’t live\nThat ain’t the fact of the matter, look what it does to the kids\nMake them want to grow up to be drug dealers\nLeading them down a dead end, you’s a fuck nigga\nIf I can bring Pac back and send y’all to wherever he’s at\nGuess what, black people, we back\n\n[Hook]\nYes, this is Saigon, this is Mart\nThey done dumbed it down, now let’s get smart\nThey done dumbed it down, now let’s get smart\nLet’s get smart, let’s get smart\nIt’s bigger than business, this is art\nWe done dumbed it down, now let’s get smart\nWe done dumbed it down, now let’s get smart\nLet’s get smart “plus I’m very smart”\n\n[Verse 2]\nWhoever own Worldstar’s a motherfucking genius\n‘Cause he ain’t paying for that content\nNiggas grab cameras and record all this nonsense\nSending it to them and they get rich from advertisements and sponsors\nAll you get is a fucked up conscience\nOf being a part of depicting your people as some kind of monsters\nI’m from the true religion of Clark Kents\nBig as just living as hip-hop since it was still on the park bench\nThat’s why my bars strong as cigar stench\nDeadly like Agent Orange, or AIDS, arsenic\nCan’t defend myself ‘cause I’m always on offense\nThe two don’t give you a clue, the nine will give y’all hints\nThis Saigon and Premier up in here (yeah, yeah)\nAnd we’re giving them think rap this year (yeah, yeah)\nSelling it to them shrink rap this here\nHottest shit in the streets, this is heat right here\n\n[Hook]\n\n[Verse 3]\nPreem, they tried to turn the art form to popcorn\nLong as we still rocking, that is not for long\nI dwelled here twelve year, that’s ‘cause I belong\nYou drop a couple hot songs then your rocks is gone\nHow many niggas can call themselves what I did?\nHow many brothers done suffered as much as I did?\nYou see the pain whenever I lift my eyelid\nThat’s why I’m not in the category as Talib\nI give you the greatest story ‘cause that’s what I lived\nWhen I say it’s pain in my life, that’s what I had\nAlright, so what, I have money now, why should I brag?\nIn the hood, they still can’t afford iPads\nWho you know just goes and switch flows\nLike this, this the show, I have lyrics to go, you know\nIt’s one thing when you’re just having fun with it\nY’all taking that dumb shit and running with it\n\n[Hook]\n\n[Outro]\n“Plus I’m very smart”\n“Plus I’m very smart”\n“Plus I’m very smart”\n“Plus I’m very smart”", "album": "G.S.N.T. 3: The Troubled Times of Brian Carenard"}], "artist": "Saigon"}