{"songs": [{"album": "K.O.D.", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg", "year": "2009-10-26", "title": "Demons", "lyrics": "[Intro: Tech N9ne]\nI'm an angel/demon, man\nYou know what I'm sayin', what makes me a demon is lust a girl crazy and that's why I couldn't keep my wife\nYou know what I'm sayin', and that's the lust demon livin' within me\nAnd, uh, but my heart love big, you know what I'm sayin', so\nI know a lot of demons come to my shows, as well as angels\nYou know what I'm sayin', a lot of demons\n\n[Hook: Mackenzie Nicole]\nWhen I was one, and-a two, and-a three, and-a four\nI knew I was a special one who had a little more\nAnd they wondered why I was plum rotten to the core\nIt was nothing but an itty-bitty demon\n\n[Post-Hook: Tech N9ne]\nThere's a demon inside of me, can I kill it? (Hell no!)\nCan I kill it? (Hell no!) Can I kill it? (Hell no!)\nThere's a demon inside of me, can I kill it? (Hell no!)\nCan I kill it? (Hell no!) Can I kill it? (Hell no!)\n\n[Verse 1: Tech N9ne]\nYo, it make me wanna drink a lot, go up in the pink with not\nThis the reason I ain't at ease and currently on the brink of pop\nThis the reason I sit at the window with the millie\nWishing a nigga gon' come break in\nThis is the reason I be freaking a woman deeper\nLoving making her silly because I done they friends\nIt is the reason I bang, it is definitely the reason I slang\nDistributed the 'caine\nThe reason I'm super-soaking in the pain, and starting to love it\nIt's wanting to give me way more of it, they want me to lug it through the mud\nAnd thus the reason with happy people I'm disgusted\nI'm talking about those thangs that make you do bad thangs\nLiving the evil up in the fast lane\nMaking me want to have a wicked persona\nBeating the hell up out of people making me mad, mane\nGave me the gun when I ran up in dealings in the ninth grade, with a slight rage\nI was Ice Age, another reason Tecca Nina won't have any light days\nVoted me the King of Darkness, voted me to be really heartless\nAll up in my spirit they march, they making me start sparking other targets\nWoke up today I was steaming, cause when I found out I was not dreaming\nBecause the host that influenced me the most was a goddamn demon\n\n[Hook: Mackenzie Nicole]\nWhen I was one, and-a two, and-a three, and-a four\nI knew I was a special one who had a little more\nAnd they wondered why I was plum rotten to the core\nIt was nothing but an itty-bitty demon\n\n[Post-Hook: Tech N9ne]\nThere's a demon inside of me, can I kill it? (Hell no!)\nCan I kill it? (Hell no!) Can I kill it? (Hell no!)\nThere's a demon inside of me, can I kill it? (Hell no!)\nCan I kill it? (Hell no!) Can I kill it? (Hell no!)\n\n[Verse 2: DJ Paul]\n(Three 6 Mafia!)\nSee there's a demon inside of me, and I'm thinking it's that dope\nIt's got me doing shit a nigga never even had done befo'\nIt got me kicking in the door of folks I don't even know\nStraight wilding, nine-eleven times a fucking thousand\nBuck like public housing, my Glock is so arousing\nMake you stand atten-hut the way that bitch be shouting\nSomething like a scary movie, nigga but I'm scarier\nBury ya, Memphis Ten Black Haven area\nBuck nigga, get buck bitch, get with me\nAnd I'mma show you how this Triple 6 will get silly\nPsycho, like no other individual\nGlock with the red beam to keep you in my visual\nThree 6 and Tech Nina wet you like an Aquafina\nDesert Eagle, .50 Cal', tell me have you seen her\nPussy juice, still on my shit from this ho I just raped\nIn her fucking husband's face, shot him in his fucking face\n\n[Hook: Mackenzie Nicole]\nWhen I was one, and-a two, and-a three, and-a four\nI knew I was a special one who had a little more\nAnd they wondered why I was plum rotten to the core\nIt was nothing but an itty-bitty demon\n\n[Post-Hook: Tech N9ne]\nThere's a demon inside of me, can I kill it? (Hell no!)\nCan I kill it? (Hell no!) Can I kill it? (Hell no!)\nThere's a demon inside of me, can I kill it? (Hell no!)\nCan I kill it? (Hell no!) Can I kill it? (Hell no!)\n\n[Verse 3: Juicy J]\nThat fishscale powder will make you hype\nGo into a bar, get into bar fights\nHave you walking around all night\nLooking like a fool, like something ain't right\nThat Ecstacy pill will make you feel it\nLook at a bitch, girl you gon' get it\nYou wanna act kinda funny with me?\nYou can suck my dick until I nut on titties\nLoritab pills, any kind of pills, Vicodin, Xanax, Ambien yeah\nAll geeked up, wash it down with a beer\nDig it to myself, nigga it's your year\nNigga I party like a goddamn fool\nBackyard barbeque, hoes in the pool\nJacked like a motherfucker, strapped like a motherfucker\nThis my life nigga, so fuck you!\nThese funk niggas can't trust niggas\nYou'll get lit up nigga, get stuck nigga\nThese choppers buck nigga, nigga buck nigga\nAll in yo' guts nigga, nigga guts nigga\nA liquor store gotta get the dough nigga\nWalked in with the fo', get 'em on the floor nigga\nI'm so damn cold, I ain't tryna fold nigga\nI kick in doors if you got to go nigga\nYeah we murder, put the clip in, check the list and put the hit in\nKill her, kill him, don't kill children, kidnap her half for some millions\nJuicy J yeah I'm the realest, in the game I'm gonna get it\nCoke and weed and plenty women, yeah I'm out here making them killin's\n\n[Hook: Mackenzie Nicole]\nWhen I was one, and-a two, and-a three, and-a four\nI knew I was a special one who had a little more\nAnd they wondered why I was plum rotten to the core\nIt was nothing but an itty-bitty demon\n\n[Post-Hook: Tech N9ne]\nThere's a demon inside of me, can I kill it? (Hell no!)\nCan I kill it? (Hell no!) Can I kill it? (Hell no!)\nThere's a demon inside of me, can I kill it? (Hell no!)\nCan I kill it? (Hell no!) Can I kill it? (Hell no!)\n\n[Outro: Tech N9ne]\nNowhere to ru-u-un, nowhere to hi-i-ide\nDemon insi-i-i-i-ide\nNowhere to ru-u-un, nowhere to hi-i-ide\nDemon insi-i-i-i-ide\n\nTo all the people, at the therealtechn9ne.com or siccness.net\nHa-ha-ha-ha, it's no longer a joke, Demons is real"}], "artist": "Tech N9ne"}