{"songs": [{"album": "Foxy Lady (Demo)", "image": "https://images.genius.com/a72c0c7054085e408feb16e52d14aa45.1000x1000x1.jpg", "year": "1989-08-08", "title": "Foxy Lady", "lyrics": "[Verse 1: Tairrie B]\nTairrie B is on the mic\nQuincy D is on the mix and...\nWhen it comes to rhyme I’m the hip hop vixen\nFox! Knocks, Knocks em out the box\nAin’t taking no shorts or riding no jocks\nMy bodyguard’s strappin', packin' a weapon\nSuckas start backin' up there’s no steppin'\nThis is my show, I flow, lyrics like a faucet\nSo, get out my way when I toss it\n\n[Verse 2: Tairrie B]\nCause I'mma get raw, get rough\nCall your bluff and break\nAnd I’mma do it all in one take\nThis type of style will gets ya hype and while\nI’m down with Comptown, I get wild\nI’m the girl extraordinaire\nThe girl they call Tairrie B\nAh yeah\nSo when I rock the M.I.C\nI get hyped cause I lust it\nPen to paper, mouth to mic then I bust it\nNow I’m a type the girl who don’t play no game\nGet on the microphone and treat em all the same\nNo face, no name, just another emcee\nTryna get what I got or tryna get with me\nBut...\nThey can’t get none, cause I’m a pro\nSo you little league punks\nKnow where you can go\nTairrie B’s at bat no if, and or maybe\nFoxy Lady!\n\n[Verse 3: Tairrie B]\nNow when the T is on the set\nI suggest you keep a distance\nA female rapper who needs no assistance\nRen is producing the style I’m introducing\nMy DJ’s getting loose and all the men I am seducing\nIn steel toed boots I walk\nYo...If I were a man on the mic y’all’d jock\nTairrie B’s in the place with a rhyme so def\nI rock the house front, back middle, right to left\nAnd I’m built like Miss Monroe, ya know Marilyn?\nYa’ll bust this beat it be barreling\nRollin over rappers like a brand new tractor\nCrushing emcees like a trash compactor\nWearing Chanel while you’re wearing Max Factor\nYour sis tried to did this so I smacked her\nGoddess, Is what they call me baby\nFoxy Lady!\n\n\n[MC Ren]\n\"Hey yo Tairrie why don’t you tell em what you are\"\n\n[Verse 4: Tairrie B]\nNow I be what is known as a moll\nThe gangstas girl, the Comptown doll\nI’m wearing diamond rings and running things\nRock the microphone till it sings\nKings I’m stunning, Queen’s I’m shunning\nA wack rapper can never get none\nIn fact I find fun in emcee’s running weak rhyme\nI ain’t about to be done in\nKill that noise from a Mafia tip\nCause Tairrie B don’t play that shit\nI go the length on the strength or haven’t ya heard?\nThat I’m a Ruthless woman\n[MC Ren] \"Word!\"\nI got the men saying\n[Crazy Toones] \"Man, I bet a man wrote the jam\"\nI got the girls saying\n[Joycey Joyce] \"Girl, the girl can slam\"\nI got em all saying damn knowing who I am\nI knock a sucker wham bam and leave em a fan!\n\nComing correct in effect in a fly girl pose\nYou’re in check and everybody knows\nYa stupid hoes who talk chit-chatter\nWell I’m here to make it clear it don’t matter\nFlattery, is what you’re giving me\nIf every rapper was a singer, I’d be Teena Marie\nSo fasten your seatbelts, hold on tight\nTairrie B is on the mic ready to rock ya tonight\nYou never thought you’d see a lady looking like me\nGetting dumb, getting some in the place to be\nAnd if other girl rappers try to dis this\nI’ll say, sista mind your own business\nCause the time has come to put ya all on the run\nAnd you’ll be over and done like last Christmas\nThe name is Tairrie B but when I emcee it’s…\nFoxy Lady!\n\nComing to get ya…"}], "artist": "Tairrie B"}