{"artist": "Ace Hood", "songs": [{"title": "Bugatti (Remix)", "album": "Trials & Tribulations", "year": "2013-07-16", "lyrics": "[Intro: Future and DJ Khaled]\nWe the motherfuckin best nigga\nRemix motherfucker!\nAce Hood!\nThis the remix!\n\n[Chorus: Future]\nI come looking for you with Haitians\nI stay smoking on good Jamaican\nI fuck bitches from different races\nYou get money they started hating (Turn Up!)\nI woke up in a new Bugatti (Remix!)\nI woke up in a new Bugatti (Remix!)\nI woke up in a new Bugatti (Remix!)\nI woke up in a new Bugatti (Remix!)\nI woke up in a new Bugatti (Remix!)\n\n[Verse 1: Ace Hood]\nI woke up in a new Bugatti\nTats all over my body\nGettin' real money, niggas still hatin' on me\nMan y'all need a new hobby\nOr they won't talk to me, what they gon' say?\nI ball, you a waterboy, Bobby Boucher\nOn top, toupée, y'all niggas fruitcakes\nI don't really play games but I keep 2 K's\nDamn, Mr. Hood why you do 'em like that?\nPull up in the drop with the ceiling top back\nCouple weeks old, \"Bugatti\" done went gold\nYou ain't even know, I deserve that plaque\nWe the best, runnin' every summer in fact\nJuly 16th I'm bringin' the real back\nBroward! Pussy\n\n[Bridge: Future]\nI woke up in a new Bugatti\n\n[Verse 2: Meek Mill]\nHold up, double M back in this bitch\nWalk in the club with a MAC on my hip\nDiamonds look like niggas snappin a flick\nBallin' I blow fifty racks in the VIP\nI back in the whip, Maybach with your bitch\nA new Mussolini in back of the six\nI'm shittin' on rappers, these rappers is sick\nCause my homies got whips that these rappers ain't get\nCause we crackin' them bricks and I package the zip\nAnd I'm switchin' my flow, I spit crack in this bitch\nAnd I been hit your ho, now she back on my dick\nBut I get to the dough and get back at your bitch\nLike hollup, I woke up in Coon new Ferrari\nWith all my motherfuckin' jewelry on me\nNew Aston Martin plus a Rolls Royce\nAnd a new Ferrari, that's a new Bugatti\n\n[Chorus: Future]\nI come looking for you with Haitians\nI stay smoking on good Jamaican\nI fuck bitches from different races\nYou get money they started hating (Turn Up!)\nI woke up in a new Bugatti\nI woke up in a new Bugatti\nI woke up in a new Bugatti\nI woke up in a new Bugatti\nI woke up in a new Bugatti\n\n[Verse 3: T.I.]\nAnd it's paid for nigga\nGot racks, stack 'em up like Lego nigga\nI'm a motherfuckin' G, I don't play with no nigga\nMulti-millionaire self-made ho nigga\nH-U-S-T-L-E gang\nFor that, in God we trust, we bang\nI'm the new John Gotti in a new Bugatti\nI got a few young hotties wanna get shit poppin'\nRight, put it in the light\nNigga got ice but it don't look right\nIf a nigga buy a brick and it don't cook right\nI'll whip that shit for a rack, sit tight\nI got a bag full of tools and some yay to move\nAnd all I want is money, leave the fame to you\nI graduated out of gladiator school\nSo all I know is go like I'm trained to do\nRight now, turn my Mazy pedal to the metal I'm ashin' out\nI let the top down in my Phantom drop\nBlowin', I'm high as an astronaut\nWhen you see me, I'm cashin' out\nWalked into Mercedes bought half the lot\nYou keep carrying on, you getting carried out\nCause I don’t take ass whoopins, just pass ‘em out\nIs this worth getting blasted about?\nNo forreal, is it worth getting blasted about?\n\n[Verse 4: Wiz Khalifa]\nMoney conversation, get so high, I be scrapin'\nGot my eyes like a Asian, in my ride, like I'm racin'\nIn the sky, like a plane, it's Gang or die\nAin't no lames up in my circle, ain't no ho shit in my eyes\nThrowin' money in the air, poppin' bands and let it fly\nWhere I'm from, you come up short, pull that thing and let it fly\nYou know me, blow so much dank, think I'm Marley\nGot so much ink on my body, brought so much drink to the party\nI fell asleep and woke up in a new Bugatti\n\n[Chorus: Future]\nI come looking for you with Haitians\nI stay smoking on good Jamaican\nI fuck bitches from different races\nYou get money they started hating (Turn Up!)\nI woke up in a new Bugatti\nI woke up in a new Bugatti\nI woke up in a new Bugatti\nI woke up in a new Bugatti\nI woke up in a new Bugatti\n\n[Verse 5: Birdman]\nFresh, whips, candy on that money dip\nFive hundred, I'm hood rich, put in work, did a hundred flips\nBeen about them mansions, Stunna island, we packin'\nRich Gang, we uptown, nigga hardbody and mackin'\nTool on that back, nigga, money and that power\nMansion on that beach, nigga, blood red Bugatti\nVersace on my bitch, nigga, blow a mil' like it's a dollar\nStunt!\n\n[Bridge: Future]\nI woke up in a new Bugatti\n\n[Verse 6: French Montana]\nWoke up with the crown nigga, serving Bobby Brown, nigga\nStarted from the bottom now it's Carter, Nino Brown nigga\nTake my spot nigga never will, now I know how 'Melo feel\nWe both shooters from New York (Turn up!)\nBut I shown nigga how the metal feel\nFidel Castro with them Cuban Links\nWith Mark Cuban where them Cubans link\nExcuse My French nigga, no France\nHottest new niggas in ten years\nCoke boy deal like ten M's\nDJ Khaled up in there\n\n[Bridge: Future]\nI woke up in a new Bugatti\n\n[Verse 7: 2 Chainz]\nFlow hot as the Mojave, gimme that sloppy shit\nAll on my car stick, give her some hundreds she did\nLike this, I'mma say this! Fuck it, I'll say it!\nIf you got good pussy you should always have your rent paid\nChoke on some bands if I'm not mistaken\nAdd up my outfit, fashion statement\nThis the school of hard knocks; graduation (Tru!)\n\n[Bridge: Future]\nI woke up in a new Bugatti\n\n[Verse 8: Ace Hood]\nI'm sick of y'all niggas all talkin' crazy\nHottest nigga spittin' and they can't debate it\nI didn't really know 2Pac or Big\nBut know the beast within'll reincarnate 'em\nFuck underrated, I'm constipated\nI'm shittin' on 'em, fuck toilet paper\nYou're now tuned into the fuckin' greatest\nAce Hood, congratulations\nSay name one nigga that's rockin' with him\nFlow like a hundred round choppa nigga\nMade a way out of the jungle\nAnd now they in trouble, I used to be humble as shit\nRecently flooded my neck and my wrist\nTell all them critics to suck on the dick\nNigga\n\n[Bridge: Future]\nI woke up in a new Bugatti", "image": "https://images.genius.com/fd10f6966d666486d2f60d595f5bfd2b.300x300x1.jpg"}]}