{"artist": "6LACK", "songs": [{"album": "East Atlanta Love Letter", "title": "Balenciaga Challenge", "lyrics": "[Intro: LightSkinKeisha]\nListen, okay? Let me just say this: if a nigga wanna fuck with me, he gon' fuck with all of me, he ain't gon' fuck with me sometimes, he gon' fuck with me at all motherfucking times, period. I ain't going for none of that bullshit. You know, these niggas be out here tryna play mind games and shit with a bitch like, I ain't got time for that! You know what I'm saying? I ain't got time for that! Niggas ain't the only one that's getting money too, like, bitches is getting money too, nigga. My time is money, nigga! Don't waste my time, nigga!\n\n[Verse 1: 6LACK & Offset]\nI am not like these niggas, I be penicillin in the cut (woo)\nThat mean I'm chillin' in the cut (woo)\nMade a million in the cut (woo!)\nI'm Balenciaga challenge\nTryna find my balance\nOffset with the bag\nThat mean I ain't goin' out sad (woo, woo, woo)\nMy melodies came from everything I came from\nThey talking to God, everything I got came from him\nAin't no fatigue in my blood\nIt's just a lot of weed in my blood\nHad to finish\nKeep running your mouth like Akademiks\nIt's a everyday struggle\nBut I still remain humble\nWe can compare and all that\nBut you know it ain't all that, yeah\n(Ayy, ayy, ayy, yeah, ayy)\n\n[Chorus: 6LACK]\nI pick up the pace, up the pace\nI can never take a break (nigga, break)\nThen I brought my trouble where I stay\nSo I cannot run away (yeah)\nI pick up the pace, up the pace\nI can never take a break (nigga, break)\nThen I brought my trouble where I stay\nSo I cannot run away\n\n[Verse 2: Offset]\n800 racks in my safe (racks)\nUsed to have dope in the base (dope)\nNigga, I'm a Nawfside native (Nawf)\nI was never understood, they hated (no)\nGrow dope with the wolves with the slave (wolves)\nPistol P got shot and couldn't make it (pow)\nI had case after cases (cases)\nI never switched up, 'cause I'm gangsta (rah)\nThese diamonds is hues like Langston (rah)\nI wear diamonds and gold cause we ancient (ancient)\nShe wanna expose me, she anxious (expose)\nHad to cut off my bro, on some lame shit (cut off)\nIt keep burnin' my soul that these lames switch (girl)\nThe rings of trophy on banquette (yeah)\nI'm geeked up on codeine, I can't quit (yeah)\nGot a bust down Patek, a plain bitch (Patek)\nHad 'em bust that bitch, what her name is (smash)\nM-I-G-O where the gang is (gang!)\nYou know that we armed and dangerous (rah)\nI'm havin' thoughts of knockin' 'em off\nMy mind is cautious (hrr)\nI had a heart 'til grandma had died and now I am heartless (heartless, hey)\nI’m movin' smart, my money Colossus\n\n[Chorus: 6LACK]\nYeah, I pick up the pace, up the pace\nI can never take a break\nThen I brought my trouble where I stay\nSo I cannot run away (yeah)\nI pick up the pace, up the pace\nI can never take a break\nThen I brought my troubles where I stay\nSo I cannot run away", "year": "2018-09-14", "image": "https://images.genius.com/68d505210dfe645f563d657a5dd75757.1000x1000x1.jpg"}]}