{"songs": [{"year": null, "image": "https://images.genius.com/9c7203e565e56a244f10c1741d29f204.640x640x1.jpg", "title": "I’m the One", "album": "A Song for You", "lyrics": "[Intro: Joel Madden]\nOhh! (Ohh!) To the sects (to the sects!)\nOhh! (Ohh!) This the one right here!\nOhh! I'm the onnnnne\n\n[Bizzy Bone] + (Joel Madden)\nThrough the fire wire, through the rain\nThrough the rain, through the rain\nThrough the fire wire, through the rain\nThrough the pain, through the pain (Ohh! I'm the onnnnne)\nAnd only one can be the one, it better be\nGet out of my way, say (Ohh!)\n\n[Bizzy Bone]\nThrough the fire wire, through the rain and pain and pyre\nThe temperature hotter then lava, the medium, medium meetin 'em tedium\nB.B. The Kid sire, Allah the king administer candles, kiss the ring\nDig in the brain and find the Ying, part of the negative there go the Yang\nThinkin they're deep and they're ready to get with the glory thang\nSteady the people that think that we whisperin\nBaby we born in the sin and we bang\nSteady the thugs and look at the buzz\nI look at the drugs, I look at the buds\nOut of their minds, you know what it is\nIf you're gettin mad you don't know what it was\nMemory blood the duster, the dust in the wind, I don't need to cuss\nIf I was a woman I'd come as a woman\nAnd give you an angel you never could touch\nThe spirit the light, the birds the flight, the bread and even the rush\nI don't need nothin, whatever you're doin is makin my brain feelin the touch\nEliminate hate, open the palms and carry your babies, I sing this song\nWalk in the garden open arms, disgusted, gotta stay calm\nLook at the angst of angels, they walkin the earth, they miss their spouses\nHumans homes and houses, mini-mansions and mountains, all will be found and\n\n[Chorus: Bizzy] + (Joel Madden)\n(Ohh! I'm the onnnnne) And only one can be the one, it better be\nGet out of my way, say-ay-ay-ay-ay\n(I'm the onnnnne) Yeahhh, and only one\nIt's only one, it's only one one one one\n(I'm the onnnnne) And only one can be the one, it better be\nGet out of my way, say-ay-ay-ay-ay\n(I'm the onnnnne) Yeahhh, and only one\nIt's only one, and only one (Ohh!)\n\n[Bizzy Bone]\nCrush yo' ass..\nI know what they're lookin for, huh, they never will find it though\nOverflowin the cup, and then what? Shall I go further yo?\nShalt never murder though, shalt never covet another man's propert-o\nShalt never steal, never use thy Lord's name in vain and though\nMany more to go, never act like you the Lord and you'll see\nNo adultery, gotta be all you can possibly be\nAnd don't make out to be a lion, funny you think I'm lyin, it's me\nAnd walkin the streets and ridin an ambulance straight to the bed and an IV\nAn eye for an eye, I never go by, you gotta forgive 'em and let it be\nThink of the sign, the temple the mind, we get on the grind and decree\nBy any degree, feelin the burn, the family sayin they love me\nIs that what I see? Is that what is after everything nothin but your greed?\nRemember the vibe, remember the tribe, you never could murder me twice\nRemember the pride, I got rid of mine in '89, still got a life\nAfter all you handle your promises, it's so many lies, a smokin gun\nI forgive you, but I know who is the one - Allah\n\n[Chorus]\n\n[Bizzy Bone]\nHow many men you know that can birth up a baby\nAnd burpin my baby and don't have a lady\nCome back from the walk and she actin so shady\nAnd smokin with homie, it still doesn't phase me\nAnd leave, it's nothin to eat, the baby is cryin\nI walk him to sleep and he wake up as Bryon\nNo money, I crawl out the gutter\nAnd tell me to whoop on the child\nYou better believe, when the beatin is what you receive\nWake up and you'll wind up in the beginnin\nWith no precious metals and demons are pleased\nNow you in the breeze, why you fuckin with me?\nYou're visibly stripped to your knees\nAnd givin yourself more credit then you deserve\nI worship the Lord, you worship a dream\nThe triple the beam, the trinity, and eyein the fiend\nThe theory of rocks, you know what I mean? (The Big Bang)\nYou know what I mean? (what?)\nDuster, with the dust of wind I don't need to cuss\nIf I was a woman I'd come as a woman\nAnd bring you an angel you never could touch (woo!)\nThe spirit the light, the birds the flight\nThe bread and even the rush\nI don't need nothin, whatever you're doin\nYou're makin my brain feelin the touch\nEliminate hate, open the palms, carry your babies, I sing the song\nWalk in the garden with open arms, disgusted but I stay calm\n\n[Chorus] - first 6 lines\n\n[Joel Madden] + (Bizzy Bone)\nI'm the onnnnne (yeahhhh, yeahhh)\nOhh, ohh! (Yeah, yeah)\nOne one one... one one one one..."}], "artist": "Bizzy Bone"}