{"songs": [{"image": "https://images.genius.com/04c4987a35d026d1c52f477d7d8c2cf0.199x199x1.jpg", "lyrics": "[Verse 1]\nLive from the working class trash bin\nWhere I'm surrounded by tax payers and soon-to-be has-beens\nWhere Afghanis in tents are in the past-tense\nAnd black families are pissed on with harrassment\nSee everynight there's gun shots a couple streets from here\nWhere young Chris and both his brothers tuck and sleep in fear\nWhere runny streams of tears pour down they faces\nThe way they treat this shit gets on my nerve agents\nApparently my arrogance is feeling like the air against\nThe gate up at the cemetary in the sanitarium\nThe Aryans and all of the nefarious amulet wearin Libertarians is scared to\nDeath tearin the hair again\nAmerican marriages wearin thin as parents prepare to carefully bury their\nCherished kids in a garrison\nAttackin full speed with torches in their chariots like\n\"Dont listen to Jay-Z that supports the terrorists!\"\nYou gotta understand people Iraq is strong\nThey got 2 headed soldiers and secret magic bombs\nAnd flying dragons that'll eat the stomachs out their victims\nAnd magic wands that'll cripple cable television\nLook Bush, there's a difference between change in regime and blowin half the\nWorld off the face of the map\nBut if the Muslims got it right\nI promise you Allah's gonna be pretty upset at you for that\n\n[Hook]\nI never fought for a cause I did not believe in\nEspecially if the cause did not believe in me\nSo (Pow, Pow) would you pass me the ammo?\nAnd hang me from my family tree\nI never fought for a cause I did not believe in\nEspecially if the cause did not believe in me\nSo (Pow, Pow) would you pass me the ammo?\nSo I can shoot my t.v\n\n[Verse 2]\nI'm feeling so disgruntled and aroused to pull it\nTo shoot a conservative with a liberal amount of bullets\nThis is America...we roll thick\nLike natives traded their land and souls for casino chips\n2,000 died for you to unite\nBlood shot eyes and pissed because it ruined your flight\nTaking silencers and screwin them tight durin the ride home\nTo smell the apple pie, green grass, and pinecones\nA different type of threats upon the soccer-moms\nIt's blackness to the Sun's corona during Ramadan\nDavid Koresh doesn't represent you blue-eyes\nBut Bin Laden started a sick perverted holocaust\nMy Muslim friends never acted like villains\nBut these yuppy women see em' and they grab their 5 children\nCause Christ turned water to wine, but blood is thicker\nWhat are you people representing with these bumper stickers?\nA place where inner-city kids play reluctantly?\nAnd, F.D.N.Y.'s the #1 clothing company?\nAnd, the Presidential niece is sniffin all the drugs\nBut kids up in Rawanda shrug while eating water bugs\nWe all got a jug of brew cracked\nIn the Center of attention thinkin World Trade means shoot back\nGenius Anglosaxons\nThat think if you move a million units overseas you go platinum\nBut nah go back to your reality show\nYou in the front row, just sit and let the casualties grow\nAnd even though I pay these veterans respect\nI won' pick a gun up and shoot and kill someone I've never even met\nIt's alright to the point their ain't shit left\nExcept a blizzard of ashes and radiated insects\nYou see these parents want these kids to enlist\n'Til their kids are the ones who get murdered by this bullshit!\n\n[Hook]\nI never fought for a cause I did not believe in\nEspecially if the cause did not believe in me\nSo (Pow, Pow) would you pass me the ammo?\nAnd hang me from my family tree\nI never fought for a cause I did not believe in\nEspecially if the cause did not believe in me\nSo (Pow, Pow) would you pass me the ammo?\nSo I can shoot my t.v\n\nI never fought for a cause I did not believe in\nEspecially if the cause did not believe in me\nSo (Pow, Pow) would you pass me the ammo?\nAnd hang me from my family tree\nI never fought for a cause I did not believe in\nEspecially if the cause did not believe in me\nSo (Pow, Pow) would you pass me the ammo?\nSo I can shoot my t.v", "year": null, "album": "The Love Potion Collection", "title": "Pass The Ammo"}], "artist": "Mac Lethal"}