{"songs": [{"image": "https://images.genius.com/508b912f569b8bb0c6714a8272e0e931.400x397x1.jpg", "title": "12 King Pimp Commandments", "album": "Gory Days", "year": "2007-09-11", "lyrics": "1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11. The 12 king pimp commandments!\n\nUh\nIt's pimp gator\nPeep the jewels\n\nA king pimp's been here for years representin'\nThere's rules to this shit I'll break down a lesson\nStep by step\nLike a booklet for you to sweat\nAnd try to apply\nTo make yourself fly\nNo. 1: must be strong in mind and spirit\nWhen idiots talk inferior shit\nBrush it off when you hear it\nNever fear it\nDon't put a knife to a broad\nCause the penis is mightier than the sword\nPeep the metaphor\nYou'll find more\nCats invaded your crib with nickel-plated\n38's imitatin' Satan you wouldn't be intimidated\nYou must play past the devils trickery\nPrison, liquor and hits of E\nNicotine and chicks with V.D\nNo. 2: must control seven or eight cunts at once\nA freak for each day of the week, the eight is a lottery stunt\nMust handle them with cleverness, kindness, shrewdness\nIntelligence but never with an iron-fist\nNo. 3: only fuck with a bitch when you're both clickin'\nSparrows don't fly with eagles, peacocks can't strut with chickens\n4: must withstand all criticism\nCause a man whose wife is gettin' pimped doesn't understand her sippin' Jizzm\nIt's a profitable business to rationalize into cynicism\nThat it's wrong but it isn't\nNo. 5: never let a female be equal with you\nEqual right's a fantasy it will come back to normal soon\nRefuse to have oral-sex with your woman unless you choose\nDo not accept: if you do me, I'll do you\nShe was put on earth to serve men\nShe may enjoy a cuntlick, but deep down she'll loose respect for you then\nOnly animals you see lickin' sex organs are dogs and cats\nFemales know, during their period cunts are filthy like rats\n6: you'll use violence in self-defense\nTo protect yourself, friends, family, women and what you possess\nNo. 7: never strike a bitch with a pipe or a knife\nOnly strike 'em to shock 'em back to reality's light\nToss a bottle at her, hit her with a golf club\nBreak a mirror over her head but never make her draw blood\nYou can start flippin'\nGrippin' her like a victim\nBut never start hittin'\nThis is called the king pimp's whippin'\nNo. 8: since Cleanliness is next to godliness\nYou must keep your hygiene clean regardless\nA shower a day'll do and keep your physical being\nIn the best condition possible it could be in\nNo. 9: you're never stingy, greedy, drifty or cheap\nWhen it comes to you and your peeps\nYou owe yourself the best treats\nNo. 10: never sweat when a bitch leaves you knowing\nThe story of a man's life, a bitch coming and one going\nThey come better the next time\nThey only make room for a higher grade bitch, the next one is always a\nBetter kind\n11: you're only expected to keep a woman a term of four years unless\nYou're fortunate enough to get re-elected\nAnd if she leaves before her term is up, she faked it\nCause she wasn't ready for a king pimp anyway, kid\nLet her fuck with the other 51 pimp-types, they're better for her\nWelfare pimp, blind pimp, dumb pimp etcetera\n12: there's leaders and followers\nA king pimp never follows a hollow-headed dick swallower\nOr a trick equipped with a wallet full of dollars\nEven a scholar\nOf Cabala doesn't get followed\nThe only one that got it like that solid is god, kid\nCause he's brolicy, understands every topic on how a pimp rocks shit\nFollow these rules, you'll have mad D-cups and A-cups\nBitches runnin' around butt naked with pretty make-up\nThe respect these bitches will have for you will be sacred\nSlut, pay up\nI'll put your fuckin' head in the toilet, wake up!\n\nThe 12 king pimp commandments\nNo doubt\nRespect it\nIt's pimp gator\nAll you pimps all over the earth\nRock with this"}], "artist": "Necro"}