{"artist": "Wrekonize", "songs": [{"lyrics": "[Verse]\nOkay, welcome to another retrospect\nWrekonize, you recollect we share the same perspective\nDown on Sobe where the people may not wish you well\nHomeless people smell like shit and talkin' to themselves\nThis is that iMayday! iMayday! shit so sound it, please\nBetter look around for the thousand fees\nLivin' in the city where they found in greed\nI-I-I'm down to breeze\nJD in a walking bottle, scooped her up and told her\n\"Suck for luck ain't just the Dolphin's motto!\"\nYou silly girl, asking for rapture\nLike this your Armageddon and I'm just your capture\nToday I'll play ya slave and let you be my master\nSo when you look me in the eye and tell me \"faster\"\nI pull up to the city and I get 'em in a frenzy\nWith a little bit of Indo and some X\nAin't gunnin' for a minute but I'm ready to replenish\nCause Tech said \"We should retrogress!\"\nThis Strangeland Band with a mainland tan\nGotta make that grand while I'm still breathing!\nTake me to your leader even\nIf we've been livin ' in the badder season, ha!\nW-W-Welcome to Miami ho\nHaters in the crowd that's how you know it's a Miami show\nRoad rage will get ya make you wanna scream \"Miami blows!\"\nBut at the end of the day we all just plainly love Miami so\nRaise the heat with amazing speech and I maybe beat but not today\nKC Tea and the JD thee got my lady deep like Macy Grey\nIf they ain't tryin' to work with iMayday! then just fuck 'em all\nTake 'em to the bottom and like lotto they can suck my balls!\nHeh, childish, but you lost your sense of humor\nIf you're not careful in this place you may invent a tumor\nI hear the pavement talkin', here's what they says the rumor:\n2012 is ours and it really can't be here no sooner!\nAnd another fallin' fast, on an out 'bout haulin' ass\nFeel like we're on the path, when she's \"all of that\" and want an autograph\nI'm reachin' Heaven fast, just tryin' to get some cash\nAnd not go fall into the red like I'm Kevin Clash\nThis is your first and final breather\nBump up your receiver, take it to your speakers\nBane with a little bit of hang\nSangin' out into the bleachers\nNow prepare yourself for the best in hell and\nTAKE ME TO YOUR LEADER!", "title": "Good Good Night (Freestyle)", "year": null, "album": "The Rooftops Mixtape", "image": "https://images.genius.com/88e068903a4f33a883dd03382fcde905.700x700x1.jpg"}]}