{"artist": "Papoose", "songs": [{"album": "The Beast from the East (Mixtape)", "title": "Mixtape Murder", "image": "https://images.genius.com/1f0610556cd8c8a1a7211ed687430f27.500x500x1.jpg", "lyrics": "Papoose Street Sweeper Ent\n\nThis Is Mixtape Murder I Say Some Of The Illest Shit They Herd Off!\nThey Betta Off Going To Get They Burner!\nThis Is Mixtape Murder, Mixtape Spit-Strait Murder!\nThis Is Mixtape Murder,Mixtape Murder-Mixtape Murder!!!\n\n-Its Street-Sweeper To The Death On You Bastards\nWhen I Die Put A Street-Sweeper In My Casket And Close It\nJust Let Me Lay There With The Rachet..Yeah\nDust To Dust & Ashes To Ashes...So The Snake Who Killed Me\nCould Walk In Acting -By The Grace Of God I'm Jump Up Blasting\nActing Like You Build You's A Fucked Up 'hasbeen I Dress With A Gun Tuck Fashion..\n!I'm A Monster Son Of Raw!\n\n-I Spit Americas Most Wanted Bars My Will-Power Got More\nWill Than 100cars I'm Show This Niggas How To Deal Just Cuase Of Cards You's A Cock-Sucking Brawd Look..\nYou Got Something You Wanna Get Off Your Chest\nBesides Your Fucking Bra? Stop Throwing Hits\nThrow Shots Confront It 'poau\nI Dont Got Drama With None Of Ya'll But I Hope You Niggas Kill Each Other I Dont Like Neither One Of Ya'll!!!\n\n-You Could Go Try Get Who Ever You Want Invole Tell'em Im A Problem That They Can't Fucking Solve,Acting Like You Really Thuging Hard\nAnd Buckin Cons He Thuging Becuase Of Ya'll They Put The Battery In Ya Back Now You Think You A Fucking Star...\n!Hit You In Your Back And Blow The Battery Outta Ya Stomach'poau!\nWho Died?-Left Them In Charge\nCarry So Many Hoods On My Shoulders I Need Somebody To Give Me A Massage\n\n-Selling Jars Of Weed? If He Pull Out Another Jar.. Fuck Huging The Block..\"Ama Have Him Huging God!\" Cross Me Your Heart To Won't Live To Beat Another Throbe My Gun Got Fired So Much It Need Another Job\nI Told You In Alphabetical Slaughter I Was'nt Large My Whole Borough Be Buckin Cons Yo Can't Walk Tru Coney Island Bumping Niggas You Buggin 'poau You Ain't Just Brushing Pass Niggas You Bumping Hard\nNext Time You Make Sure You Know Who You Bumping 'poau Most Of My Coney Island Niggas Will Leave You Slumpt On A Bucket Cars...\nStop Saying You Won't Get A Nigga Who Front & Rob I Dont Care If You Won't I Wood(Would) Like A Lumber Yard!\n\n-Evertime You See The Entourage We Come To Rob\n-Charged With Aborah\n-Reguardless Cuase Its Hard\n-Hit Harder Than Bernard\n-We Parked In Your Garage\n-Your Brawds In A Manuge\n-Hearts Become Enlarged\n-Your Dogs Is Duck & Dodge\n-Your Squadgers Running Jaw\n-Arson Grand Larceny Larsen Rip Bars- Apart In Font Of Ya'll\n-Compare Color,Scars\n\n-Harlem Sold Parts Of Yonkers Way Across The Bronx & From Strait\nTo The Coffin Give 'em Fatal Abortion I'm Able To Off 'em Brooknam\nThe Puasing's Buzzing Hard Dont Cross The Reservoir Dogs See You In The\nNext Morgue ..Decent Of Song..\n\nWhat???\nThis Is Mixtape Murder I Say Some Of The Illest Shit They Herd Off!\nThey Betta Off Going To Get They Burner!\nThis Is Mixtape Murder, Mixtape Spit-Strait Murder!\nThis Is Mixtape Murder,Mixtape Murder-Mixtape Murder!!!\n-Papoose", "year": null}]}