{"artist": "Kool G Rap", "songs": [{"image": "https://images.genius.com/c347081c7afabbcba96aea0847886344.758x738x1.jpg", "title": "Da Bosses Lady", "year": "1998-10-20", "album": "Roots of Evil", "lyrics": "[Production by A. Evans]\n\n[Imitation of excerpt from the movie \"Scarface\"]\nThat chick he's with... (huh) she like me\nOh, she likes you huh? How do you know?\nI know.  The eyes Chico... they never lie\nWhat, are you serious?\nI'm serious... what do you think?\nMan that's the boss's lady\n{​*sarcastic*}​ The boss's lady\nYou're gonna get us killed\nFuck you mayn! The boss's lady... that guy's soft\nYou got some of that for me?\nWould you kiss me if I wear the hat?\n\n[Verse 1: Kool G. Rap]\nHad to have her\nSince my first glance at her, pimp stance at her\nWatchin men throwin Banjamins and Grants at her\nBottles of Italy and France at her\nAdvanced at her, spit romance at her\nChampagne glasses chatter\nAss fatter than that actress up in Family Matters\nLips thicker than Mick Jaggers\nDick so hard the shit could stab her\nShe pushed a sick Jaguar\nPaint shined like it was black lacquer\nCarried a small gat for back up, whole shit spectacular\nPeepin out her frame walkin in back of her\nShe had the hourglass shape, girls disgraced stay out her way\nPast late, get that ass raped, fast tied up with mask tape\nMad papes, I could tell by the way she was draped\nHer sex mate's caked up like Drake's\nHe got the crib by the lake\nWanted by the Jakes for takin powder weight outta state\nStraight surrounded his grounds with tower gates\nGarden lookin like a flower wake\nEvery hour he make about enough dough to spoil this bitch sour\nSex, money, and power, pussy good enough to devour\nHit her up inside the marble tiled shower\nSnapped back to reality, told me her name was Valerie\nDon't fuck around with the help\nNigga on the salary, pockets too low calorie\nHer man'll send the cavalry, straight turn the town to a shootin gallery\n\n[Hook: repeat 2X]\nOff his life\nTo get in good with the boss's wife\nCross his life just to floss his ice\nTo get him hit for the cost of rice, tossed at night\nIf the thoughts is right\nBodies could get lost in sight\n\n[Verse 2: Camileone]\nThe boss's lady, I cocks the four-fifth and hold it steady baby\nMy man ship mo' weight, than the fuckin Navy\nOut to get this gravy, so you can't take mine\nYou crossed the line, fuckin with the boss's devine\nAiyyo, his mans, they commit crimes (yeah right)\nFound out you tryin to fuck with his dime, you lay your life on the line\nBut the cards are in my hands\nI love this rich man, and fuckin you is not in the plans\nI'm out to get grands and livin on my own land\nSo why fuck with that help? I'm livin in wealth, you under his belt (whatever)\nHourglass shape I know you felt, wonderin how the pussy smelt\nLavish taste'll have you livin in debt\nFantasizin 'bout his wife's sex, how could you disrespect\nThe man who supply the cash for yo' checks? (So what?)\nOn the low cause you know he blaze tecs, and you fear for what's next\nYour life could be dead, for tryin to get my pussy wet\nRealize the bigger picture, I deal with bigger figures\nDon't have time for affairs, with the average niggas\nKeep the lustin to a limit, cause ain't no benefits in it\nToo much to lose if I let you hit it\nYou know the force is deep, and you wanna creep\nThinkin how sweet it would be if I just let you eat\nBut till the boss show, I gotta stay true, the chump change won't do\nFor me with you, isn't evident boo\n\n[Kool G. Rap]\nI like your style, kid you get wild, let the chips pile\nMy click slit smiles across your man's throat, so look who big now\nBarkin on shit like a big growl, lame chick you got this shit foul\nWe got the big bricks shipped in from miles\nWhile I'm whippin shit, 6 plus 6 valves\nDo a milli' from sick style, we regulate it\nYo boo I guess you haven't heard the latest about these new ages\nStackin outrageous\n\n[Camileone] + (G. Rap)\nYeah, I heard about the way you flip birds\nGot these niggas standin on the curb, leafers and herbs\nYou and my nigga exchanged words then parted ways\nYou swore to God all day your squad would spray\nMy man in all kinds of sick and retarded ways\n(Straight gave him a harp to play)\nI peeped your resume (You with me Angel?)\nYeah no doubt, but I should bang you\n\n[Hook]"}]}