{"songs": [{"year": null, "album": "Firestarter Vol. 1: Quest For Fire", "image": "https://images.genius.com/d1c3e48f7789c764dbfe19acbf9cb0b9.300x300x1.jpg", "title": "Maxine", "lyrics": "[Kardinal Offishall]\nWha wha wha what\nYo yo yo yo\nSit me down\nMr. Kardinal\nKardinal Offishall, number one bad bwoy heheheh\nYeah, yeah\nIt's all about this girl, ya know, drive de man crazy\nGoing out to the raspberry crew, Circle\nHear me now, hear me now\n\nLet me tell you a liccle story bout this girl I used to nkow\nUse to come and tell me she love me since me sing Onwiddasho\nShe say she loves do way me represent de whole of T dot O\nShe say she love me on de TV, love me in a de video\nShe say she sit dung pon ar' bed and listen to de radio\nAnd wen me sing 'bon-diddley-bong' she haffe run an change ar' clothes\nShe say me kill ar wit de styles and just a murda wit de flow\nMe juss a sweet ar with the riddim tun ar eena yo-yo\nYO!\nShe comin in like she don't know\nSeh me 'ave a girlfriend and she don't play (no)\nMight box her in ar mout and chop off she toe\nLawd God why did Kardi haffe so sexy though?\nShe try fe kiss me pon me neck, mi haffe tell de gyal 'Yo!'\n'Walk and live-touch and you've got to go'\nYuh body look good, yes sweet like mango\nBut you know the story girl, come on 'a ho is a ho'\nYuh nuh 'ave nuh drawz on how yuh skin dry so?\nFavour one ol' piece of dry up cho-cho!\nYes girl yuh batty big but you know how dat go\nI'm a very tall yout because I won't stoop low for...\n\nCHORUS [Kardinal Offishall]\nMaxine, oh Miss Maxine\nYuh body look ready, for you I am waitin\nIt goes Maxine, oh Miss Maxine\nYuh body look ready, come make we rock steady\n\n[Kardinal Offishall]\nYo, I was walkin down de street and this girl said 'Hi!'\n'Aren't you that rapper named Mr. Kardiny?'\nChuh, see me yah-yes girl dat's de I\nLyric specialist, number one bad bwoy\nGive tanks to de most high for lookin so fly\nSo pretty sometime mek yuh eye dem cry\nDrip out eye water and flood up de sky\nRush de man dem first in case de youth dem waan try\nShe said 'I like your style and yo Kardi mi nuh shy\nMe want strip off yuh Karl and den rub up yuh Kani\nSqueeze up yuh brugah and nyam off yuh fry\nBlow off yuh top and show you mi two ply!'\nI told ar 'Hol' on girl, a musse die - you waan die\nBetta wash yout yuh mout bout you a nyam out mi fry\nClean up yourself and meet me top a Mount Zion\nCause only one girl mek de Kardinal high\nAnd that's\n\nCHORUS\n\n[Kardinal Offishall]\nDiamond, and Gold, and platinum next to she\nLook like a big ol' rusty tin a bully beef!\nShe lip dem juicy and sheleg look sweet\nBody just a shine from she head to she feet\nNice type of girl dat you waan yuh moumma meet\nEvery time yuh talk ar name, yuh haffe skin teet'\nPretty like a who? The gyal bad yuh nuh see it\nEverytime she want a slam mi haffe get up and dweet\nClothes dem cris bran new Parasuco\nGrip de bamsee like noby livin' in Toronto\nBoassy whe she walk-never listenin' to 'Yo!'\nShe only listen to ar man when she walk outta door\nAnd that's Maxine\nLord let me tell you something about Max--ee-een!!!!\nHahahaha\n\nCHORUS X2\n\nYeah yeah yea\nYou don know, zeen\nHahahaha\nYou don know\nLeave me alone now, chuh"}], "artist": "Kardinal Offishall"}