{"artist": "Canibus", "songs": [{"title": "Die Slow", "album": "2000 B.C. (Before Can-I-Bus)", "year": "2000-07-18", "image": "https://images.genius.com/e0d83a5acc29c3591a0ecf95686b2db4.1000x1000x1.jpg", "lyrics": "[Canibus]\nYo (Die Slow)\nYea (Die Slow)\nYa niggas better..(Die Slow)\nUh (Die Slow)\nAll you can do is (Die Slow) nigga (Die Slow)\n(Die Slow) 4x\nAll you can do is die (Slow)\nYea\n(Die Slow) 2x\nFuck ya'll\n(Die Slow) 2x\nDie Slow nigga\n(Die Slow)\n\n(Canibus)\nYo\nYou against me.. No contest\nMy tongue hydraulics\nStrong enough to flip a 64 Impala with 3 adult passengers\nAnd a 400 pound driver\nAnd drown you in less than an ounce of your own saliva\nRubberface rappers get, stretched like elastic\nClaymation characters wit verbal vernacular\nSlappin' ya, like a white water rafter\nOr a Olympic kayaker, paddlin' across the Niagara\nMy afterburners'll be burnin' you after\nYa' body already been splashed with acid\nAnd you turn to ashes\nAssassins camouflaged in the grass blastin'\nLeavin' blood all over ya' lady like Jackie Onassis\nI'll fly ya' body outta Dallas\nPerform plastic surgery while we airborne and switch caskets\nThen lie to the masses\nI'll tell'em that you got murdered over some East West beef, between rappers\nRadio stations'll express they sadness\nPlay classics back to back and pass out \"Stop The Violence\" pamphlets\nJust imagine, every night ya' girls fuckin' ya' best friend\nWhile you in hell throwin' tantrums\nI'll be lampin' in a mansion somewhere out in the Hamptons\nGivin' some pretty ass bitch a spankin'\nNigga you can't win\nI'm laughin' cause you a has been\nYou can't get ya' groove back\nSo don't even bother askin' Angela Bassett\nYou just get ya' ass kicked\nGet ya' head chopped off and dropped in a basket\nMy left arm's taken but my right one's free\nThat means I could diss another muthafuckin' emcee\nWit rhymes that appear clearer than liquid crystal\nMy lyrical is more visual than television screen pixels\nI fire pistols, hit you wit' miniature missiles\nRiddle ya' body wit' holes then watch the blood sprinkle\nYa probably had no idea what you was gettin' into\nOn the mic, Can-I-Bus is invincible\nFuck you\n\n(CONVO 1)\n(\"Die Slow\" through out the convo)\nAyo that nigga got an attitude\nYeah he be actin rude\nAnd he's always trying to battle you\nThat last album was terrible\nWhen he's on the radio he never got a clean mouth\nYeah every time he freestyles, his words be gettin' bleeped out\nYou got the album?\nNaw I heard that shit was weak\nYou got the album?\nI said it was weak\nBut the shit don't come out till next week\nYou know I like the nigga's beats\nYo that shit be soundin' bugged out\nYo that nigga Bis dumbs out\nHe waited too long to come out\n\n(Journalist)\nTo you bitch niggas who talk a lot\nBut walk the block, in halter tops\nLeft side of ya chest, mark the spot\nThat's where a nigga put it, when I'm hooded\nThen fill you up wit big bullets\nPrepare you for some channel 6 footage\nKnow what is, Me and Bis, runnin' through ya courtyard\nCreepin' wit a four-five and reachin for ya door knob\nThrow a gun under ya chin, see how quick your whore rise\nOne shot could have a thought slide, right out the North side\nYour whole flow is pork rind\nSpit your small oinks\nI'm nasty, with my small joints gripped to ballpoints\nDrop on top of the blue line, right beside the red one\nKeep the flow fearsome, 'til the day my career done\nBring it to ya ass if you the challengin type\nEspecially those, surroundin' the mic\nSounding alike\nTo the Journ, y'all ain't no suitable spitters\nShoot at you niggas\nLay you out in MD's, recoupin' ya liver\nShoutin' my name\nBest control the noise soldier boy\nOr homicide be over you poys with Polaroids\n\n(CONVO 2)\n(\"Die Slow\" through out the convo)\nYea, yo that nigga Journalist gets busy yo\nI heard he from Philly yo\nI seent him in Bis video\nHe's so skinny tho'\nNow he's rollin' wit Canibus?\nI don't even understand his shit\nThat nigga sounds like an amaetur\nYo I heard Jay manage him\nYo he got some heavy gold shit\nMan, that's some old shit\nYea the niggas that he roll wit' probably let 'em hold it\nHe got alotta Benji's - no he don't!\nEverytime I see him in the back of The Source, he look dingy!"}]}