{"songs": [{"year": null, "title": "Doomage (Damage Remix)", "image": "https://images.genius.com/bc93d9a1f10bf994d92790c0d8a53c75.1000x1000x1.jpg", "lyrics": "[Brother Ali]\nDamage, uh, damage, uh (4x)\n\nY'all know good and goddamn well\nYou're fucking with a brother who ain't never had his hand held\nAnd never seemed passed out\nRolling baby strollers over broken floating bottles\nIn a shredded forest with a dying shred of hope inside you\nFor this respect, I sweated and bled\nAnd have yet to be discredited by what a critic ever said\n\"We're unaware of his racial make-up\nWe know he's an albino but can't science the face up!\"\nNever question what I am\nG-O-D knows if you don't, you can never understand\nSo you need only know that I'm unrelenting\nNothing breaking, never ending, seldom bending\nCast shadows like light descending\nMust not discuss divorce with the case still pending, but\nI got some shit to tell you on my next record\nFor now, we and Sage Francis connected and did--\n\n(*whispers*)\nDamage, uh (repeated)\n\n[Slug]\nWrote this one a couple days after Christmas\n'Hope' is one struggled game thats persistent\n0 plus 1 2, for Self, no assistance\nPistol clear before this new year existed\nSomebody get the door\nFuck it, let 'em snore\nIt's all been said before\nBuried in a metaphor\nLucy is hip-hop, and Jacob's a prince\nSean is an old man, and Slug is a PIMP now\nThey say I'm buggin, because of the way I love 'em\nNervous, cause I know I'll never make the perfect husband\nWhat, they treat me like LL for art fucks\nThey hang out and argue about my clown thought and *snort rocks*\n[---(reversed)\nFrom the twin cities, call it the deuce\nSkinny grizzly-bear alcoholic on the loose\nSing with me, show your love, give me proof\nFlip the switch to damage and make this planet move\n\n[Sage Francis]\nNever intended on making records that seemed too slick\nPeeps move quick from cheap music to G-UNIT!\nWeak bullshit pulls chicks, but Joe Beats..\nFlosses every day\n\"Ain't he ain't talkin' 'bout my gold teeth!\" [---(Joe Beats)\nMy hobo teeth is no sleep for seeking soulmates\nGetting cold feet, if my queen don't awake\nMy feeble bones break, spines curve (now I'm serious)\nPeople don't take time to learn outside the pyramids\nWHAT THE DILLY IS? I'm unsure, but so sin-surr\nGet your hurr did, that ain't a perm yo, that's a temporary\nThat ain't a wormhole, that's a cemetary where they bury the lies..\nI'm lampin', I'm cold cold lampin'\nOut in the snow, campin'\nCuttin' wires so your phone can't ring\nYou don't know a damn thing after your city gets undertaken\nPass me a sissy so sucka I'll slay him\n\nDamage, uh (repeat)\n\nDances\nFamine\nDamper\nDancer\nFrancis\nHah, MF Doom on the beat\nNon-Prophets, Slug and Ali\nTogether at last, like cocks and cunts\nYeah, let's fuck it up! Clip that beat\n\n(spoken interview clip)\nYou know, we're pretty much humanous\nAnd that's where we'd like to work from\nFrom that vantage point\n\nExactly, and you know Non-Prophets is spelled\nLike you know, like P-O-R-P-H-E-T like meaning\nLike Non-Prophets, almost like a pun in the word", "album": "Sickly Business"}], "artist": "Sage Francis"}