{"songs": [{"image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg", "lyrics": "[Intro]\nUh, Uh. Yeah yeah, uh\n\n[Verse 1: Mac Miller]\nWhen you finally gettin' paid, everything be feelin' great\nWent from diggin' in the crates, to chillin', gettin' faded\nDon't live a normal life, but I hope you can relate\nAnd it's hard to see it right, blowing smoke in all your faces\nCoolin' at the crib, can't believe it's where I live\nCan't believe it's what I'm doing, can't believe I got this big\nCan't believe this what I'm driving, can't believe this what I'm wearin'\nYeah the Benz is pretty cool, but I need me a Maclaren\nWhen they see me out in public, dap me up, say what's good (What's good?)\nDon't need to take a picture, it's better if you look\nGoing for your Queen, give a fuck about a rook\nPapa was a player; took some pages from his book\n\n[Hook: Mac Miller]\nSpendin' time on this money, I get money all the time\nSpendin' time on this money, I get money all the time\n[X8]\n\n[Verse 2: Mac Miller]\nTo the seven telly and it's peanut butter, jelly\nChillin' with da homies, smoking weed and watching Belly\nHeadin' to the deli, rollin' with some Pirelli's\nNow I'm gettin' money like 2001 Nelly\nThey wanna take my photo, my finger in my nose though\nDutch's from the Cogos\nPlayin' water polo\nAbove the ozone, young Han Solo\nYou start rapping and I'm like no no no no no, no\nDo you get it? Tell me can you feel it\nI'm only gonna get a bottle from you if you steal it\nTime on this money, money all the time\nLookin at me funny cause your money in decline\n\n[Hook]\nSpendin' time on this money, I get money all the time\nSpendin' time on this money, I get money all the time\n[X8]\n\n[Verse 3: Ab-Soul]\nBig bank won't throw loans or free things\nStack that dough, go get yo paypuh!\nDividends could devastate ya\nMake it but don't let it make ya\nBig bank won't throw loans or free things\nStack that dough, go get yo paypuh!\nDividends could devastate ya\n\n[Hook]\nSpendin' time on this money, I get money all the time\nSpendin' time on this money, I get money all the time\nSpendin' time on this money, I get money all the time\nSpendin' time on this money, I get money all the time\n\n[Outro]\nAll the time, all the time, all the time, all the time\nAll the...", "year": "2013-01-03", "album": null, "title": "All The Time"}], "artist": "Mac Miller"}