{"songs": [{"year": "2002-03-26", "album": "Exit", "image": "https://images.genius.com/dcee8e66d8bfbca61e739b2be7ba65e6.352x350x1.jpg", "title": "Fantastique", "lyrics": "[Verse 1]\nYo, uh uh uh uh uh\nThis is the mission out a small time thing\nLet me tell you bout what happened when the phone went\nI was chillin' at the crib with this girl named Wise\nShe was kissin' my brain, caressin' my third eye\nWhen the phone rang, I couldn't believe it\nTold myself to forget it, ignore it, leave it\nBut just when things started goin' great\nIt rang again, I said hold up, wait\nPicked up the phone, \"Yeah who the hell is this?\"\nSomebody said, \"This is serious business\nHip hop is dyin' it's all Darth Vader\nSo pick up your mic and swing your light sabre.\"\nThe Skywalker, the fly talker from the T-dot\nWe got, beats and lyrics to get you up\nKick in the door, wavin' my ASR\nWho got my back? In fact it's Figure Four\nI keep it raw, cross the city just like Bloor\nRappers are claimin' to be hardcore\nBut never no more\n\n[Hook]\nSome just lost, they floss they don't get it\nWhen I fall off things I'm quick to admit it\nIf you love this life I know you'll get with it\nCause all in all it's fantastique\nSome just lost, they floss they don't get it\nWhen I fall off things I'm quick to admit it\nIf you love this life I know you'll get with it\nCause all in all it's fantastique\n\n[Verse 2]\nThere's only two digits; zero and number one\nBut some get fooled by countin' bullets in a gun\nI make a run, with that renegade Red 1\nWe so close you can figure us cousins\nSo step up if you want to get taxed\nHip hop used to be black, but now it laxed\nThe brick cause they mostly spit like demonology\nMy psychology not dependant on pimpology\nCause pimps just react to things, men make 'em happen\nThis rappin' dedicated to soul clappin'\nIf you got soul, then The Infinite's in control\nStop using mine, people to legitimize\nYourself cause you raped the Earth and tell lies\nMy man positive intelligent and wise\nI don't suck energy son, I energize\nThis is dedicated to make it live, bring it back\n\n[Hook]\nSome just lost, they floss they don't get it\nWhen I fall off things I'm quick to admit it\nIf you love this life I know you'll get with it\nCause all in all it's fantastique\nSome just lost, they floss they don't get it\nWhen I fall off things I'm quick to admit it\nIf you love this life I know you'll get with it\nCause all in all it's fantastique"}], "artist": "​k-os"}