{"artist": "Will Smith", "songs": [{"year": null, "lyrics": "[Will Smith]\nMic check, one two one two\nThis dedicated to an old friend of mine, Michelle\nShe a holy roller now, turned over a new leaf\nNow e'rything old gon' burn (please help me not do it again)\n\n[Hook: Will Smith]\nMs. Holy Roller, new angel\nWit'cha bible out shoutin and you ringin a bell\nMid-life, REBORN! And can't wait to tell\nIf I don't believe what you believe I'm goin to hell\n\n[Verse One: Will Smith]\nYo, I've been down with Jesus since Sunday school and Easter speeches\nThe, bible was survival that's what my grandma would teach us\nSince I was 5 I've been dyin and tryin to read it\nAnd when I did, it redefined it\nNow you was 34 when you found Jesus after your life fell to pieces\nWife two times with two guys, now enlightened the speeches\nSeem to flow out your mouth with the hype of a preacher\nTook your whole life to reach ya, now I'm a triflin creature?\n\n[Hook]\n\n[Will Smith]\nC'mon, if I die right this second, I reckon that God\nWould simply check into my life and times, dissectin my rhymes\nHe'll see how I've been leadin his troops\nYou can't do dirt your whole life and say - OOPS!\n\n[Interlude: Will Smith]\nNow where was Jesus when you was cheatin and you was deceivin me?\nWhere was Jesus when you was greedy, your lawyers was bleedin me?\nWhere was Jesus when every weekend, a new man was livin wit'chu\nOh wait, he was with me, tryin to keep me from killin you!\nNow where was Jesus when you was lyin and you was betrayin me?\nWhen I was tryin to make it and you was hatin delayin me huh?\nWhere was Jesus when the ICE was thrillin ya?\nOh wait, he was with me, tryin to keep me from killin ya!\n\n[Verse Two: Will Smith]\nIf I ain't know Jesus, ain't no tellin where we'd be\nIt's been nights I felt like beasts, I needed to fight to release it\nI'm in the limelight, it's hot and the heat is ceaseless and\nHoldin my tongue while lil' bums cut me to pieces\nThe only reason's cause I studied the life of Jesus and\nVentin with my pen and intendin to write and release it\nBut when an ex-friend slight me and slam me pretendin\nI hate it, I can't stand, damn it I really resent it\nI always strive to be righteous, my version of God\nThe reason why I never write rap verses with curses inside\nThe reason I never purposely hurt person I've replied\nMany teachers of God, searchin to reach as a God\nPondered the mysteries of why you be dissin me\nI adore you, all I hope for you is freedom from mysery\nYou made mistakes and blunders, you breakin from under but yo\nIf I'm goin to hell, it's makin me wonder\n\n[Interlude]\n\n[Will Smith]\nThe greatest atrocities ever committed on this planet have been in the name of God\nThis country was founded by the Puritans for the express purpose of oppressin free worship\nYour attitude is the same arrogant fearful fundamentalism\nThat fueled the hatred, of the Crusades and the attacks of 9/11\nIf we are not allowed to worship God as groups and individuals free from persecution\nAnd respect for tolerance, there's only one outcome\n\n[Hook]\n\n[Smith] Yo\n\n[Hook]", "image": "https://images.genius.com/b6862accc0e70d12f7d4a50c2aee85da.1000x1000x1.jpg", "album": "Lost and Found", "title": "Ms. Holy Roller"}]}