{"artist": "9th Prince", "songs": [{"album": "Revenge of the 9th Prince", "lyrics": "[Intro: 9th Prince]\nYeah, this is for all, my niggas locked down\nYa'll know what it is, you know, pictures on the wall\nNahwhatimean, fantasizing about all kinds of bitches and shit\nYou know, word up, models, actresses, you know what it is, knowhatimean?\n\n[9th Prince]\nYo, Dear Beyonce, I fantasize about you every night\nTherefore I'm sending you a kite\nI'm working out, reading books, trying to get the body and mind right\nWhat up with Kelly? Word on the street, she was sleeping with Nelly\nI heard it from my cellie\nPaparazzi spotted them, coming out of a telly\nBut anyway, I seen your videos, \"Deja Vu\"\n\"Ring the Alarm\", \"To the Left\" had me illing yo\nYou the illest chick, I got all your flicks\nForget Trina, you the baddest bitch\nI love the way you smile, sexy profile\nWe probably would of met, if I didn't blow trial, but anyhow\nYou my 'Dreamgirl', with a 'Supreme' style\nA lodi dodi, I can tell you like to party\nEvery inmate in jail is loving you hardbody\nSend a word to Michelle, my cellie said she can sing like hell\nAnd when he touchdown, like LL, he wanna rock her bells\nBut for now, I got to end this letter\nYou a black queen like Coretta Scott King, shine like a diamond ring\n\n[Chorus: 9th Prince]\nDear R&B chick, for you I catch a vic'\nI know this sound sick, in my cell checking out your flicks\nYou so hot, laid back on my cot\nYou got a body that will never rot\nOne love to Keyshia Cole, Ciara, Beyonce\nAlicia Keys, Rihanna\nYou ladies stay on fire like ganja\n\n[9th Prince]\nYo, Dear Mary J. Blige, what's the 411, hon?\nLike Wyclef warn me, somebody call 911\nBesides going through the law library\nAll I do is dream about you, reminisce about \"Real Love\"\nOff my convict crew, all I wanna do is be happy\nCongratulations, I heard you was married\nYou deserve the best, my life tatted on your chest\nNice firm breasts, make a thug wanna caress your flesh\nGhetto queen wife, \"No More Drama\" in your life\nAlot of fights in prison, I gained stripes\nTake me as I am, you're a Superwoman like Karyn White\nI'm praying you get a divorce, so I can come\nScoop you like a prince and a horse\nBe your knight in shining armor, like a thug in a bulletproof Porsche\nBut for now, I got to end this letter, sincerely yours\nSend another kite next winter, I want to eat you out for dinner\n\n[Chorus]\n\n[9th Prince]\nYo, what up Keyshia Cole? I love your old from the stroll\nThe way you sing it so bold, a thug like me would never fold\nLike wine I get fine as I get old, I remember you was sent from heaven\nProtected by the seven, I'm just like you\nAlmost got defeated, I should of had cheated if it was needed\nLuckily, I succeded, I like 'em light skin like Alicia Keys\nOr brownskin like Rihanna, smoking on ganja\nLong legs like Ciara, you promise your goodies sweet like cookies\nI wanna taste your nookie, the Granddaddy Flow is a pro, these other\nCats is all rookies\n\n[Chorus]", "year": null, "title": "Dear R&B", "image": "https://images.genius.com/af61f0ef977c2f691226fe0ab315bfd9.500x500x1.jpg"}]}