{"songs": [{"title": "Picture On Your Myspace Page", "lyrics": "[Intro]\nGood morning, Marvin\nMorning, baby\n\n[Verse 1]\nWoke up in the morning, turned on the PC\nChecked the inbox, who emailed me?\nHit the MySpace, got a friend request\nFrom a lady that I met at a show out west\nI clicked on her page, went to her site\nAnd I knew right away something was not right\nCause the age on the page said \"21\"\nBut her favorite TV show was Sanford and Son?!\nThe picture looked close, but it wasn't exact\nMade her look a lot younger, as a matter of fact\nIt was dark in the club when we started to chat\nYo, but I don't remember homegirl lookin' like that\nShe wanted to talk in the dark with the crowd\nI was headed backstage where it wasn't so loud\nBut she didn't come into the light backstage\nSo is that really your picture on your MySpace page?\n\n[Hook]\nIs that really your picture on your MySpace page\nOr is it of a girl that's like half your age?\nI should've known when you didn't come backstage\nThat that wasn't your picture on your MySpace page\nIs that really your picture on your MySpace page\nOr is it of a girl that's like half your age?\nI should've known when you didn't come backstage\nThat that wasn't your picture on your MySpace page\n\n[Verse 2]\nNext morning, turn on the PC again\nSome other young lady wanna be my friend\nHope this one don't wanna play pretend\nAfter yesterday, I didn't have the time to spend\nSo I looked at the page in a careful manner\nA lady in her twenties with a hair bandana\nShe said that she worked as an event planner\nBut her favorite TV show was Hannah Montana?!\nHer messages had a bunch of high school chat\nEvent planners I know don't talk like that\nHow the daddy look cute when she babysat\nYou a high school girl, where your mom and dad at?\nCause grown folks here just can't relate\nTo a little girl lyin', said she want to date\nBetter slow your road, girl, and act your age\nAnd go change that picture on your MySpace page\n\n[Hook]\nIs that really your picture on your MySpace page\nOr is it of a lady nearly twice your age?\nFifteen'll get me twenty inside a steel cage\nSo change that picture on your MySpace page\nIs that really your picture on your MySpace page\nOr is it of a lady nearly twice your age?\nFifteen'll get me twenty inside a steel cage\nSo change that picture on your MySpace page\n\n[Verse 3]\nThere's a rapper I met after doing a show\nWho said, \"I got the style that could make big dough\"\n\"I don't have a CD I could handle, bro\"\n\"But check out the MySpace, you could hear my flow\"\nSo I checked out the site, but the kid was wack\nKickin' boo boo lyrics over boo boo tracks\nThere were so many things yo the homeboy lacked\nThat it didn't make sense to even call him back\nAnd the face in the picture wasn't who I met\nCause this guy had a face I could not forget\nSo I searched online, and what did I see?\nHe was wanted by the cops for a robbing spree\nDid two gas stations and a liquor store\nIf we don't get him soon, then he might do more\nHe was last seen with a sawed-off 12 gauge\n\n[Hook]\nIs that really your picture on your MySpace page\nOr are you better known rocking a 12 gauge\nAnd running in the street on a crime rampage?\nMan, that ain't your picture on your MySpace page\nIs that really your picture on your MySpace page\nOr are you better known rocking a 12 gauge\nAnd running in the street on a crime rampage?\nMan, that ain't your picture on your MySpace page\nIs that really your picture on your MySpace page\nOr is it of a lady nearly twice your age?\nFifteen'll get me twenty inside a steel cage\nSo change that picture on your MySpace page\nIs that really your picture on your MySpace page\nOr is it of a girl that's like half your age?\nI should've known when you didn't come backstage\nThat that wasn't your picture on your MySpace page", "album": "Relentless", "year": "2008-08-01", "image": "https://images.genius.com/08c3be4c0ddd7a7107b37d924261e3a0.500x500x1.jpg"}], "artist": "Young MC"}