{"artist": "King T", "songs": [{"image": "https://images.genius.com/30c6eab012e1a146f54e9641cc725716.600x607x1.jpg", "title": "Payback’s a Mutha", "year": "1987-01-01", "album": "Act a Fool", "lyrics": "(Intro)\n\nSee, not long back when I was seventeen\nWhen I rocked at the jam, suckers looked at me mean\nThey wouldn't give me respect, told girls I was wack\nYou shouldn't have did that brother, I'm here for the payback\n\n(\"I'm mad!\")\nYou know what?\n(\"I'm mad!\")\n\n(verse one)\nThey spreaded rumors about the king, they said that I was a front\nAll my rhymes are wack, all my cuts are bunk\nThey said I live in a slum, my father's a bum\nThey said my sister's a crackhead, my brother's drinkin' rum\nBut I didn't let it bother me, took my time\nSat at the kitchen table, wrote my rhymes\nAnd now that I'm eighteen, I'm not a kid no more\nI could walk in a nightclub and wop across the floor\nI'ma show you I'm good, make you wish that you could\nDo the things that I do, if I could teach you I would\nSee, back then you didn't like me but I stayed in your path\nSee my name on a flyer, you giggle and laugh\nTell people I'm soft when I could really get off\nYou didn't know it,now I show it, I'm the Hip Hop boss\nSee, people like you are known for fakin'\nFrontin' and bluffing and perpetratin'\nBiting and lyin' and always waitin'\nFor me to come around and see how much I'm makin'\nSee, money I get, cause I'm a pro at this trade\nYou thought you got away, but you're about to get paid\nYou told girls I was wack, shouldn't have did that brother\nHuh, I'm King tee and my payback's a muther\n\n(\"I'm mad!\")\nYou know what?\n(\"I'm mad!\")\n\n(scratch freestyle)\n\n(verse two)\nAs I talk you get madder, because the crowd starts to notice\nA professional rhymer, yeah, you must know this\nI'm cooler than most, most of all I'm so cool\nNever smacked on no crack because I'm too busy in school\nSee, I just think you're jealous and you envy my style\nYou hear my rhymes,say it's weak, but in your mind you're sayin' \"wow\"\nTellin' people I'm ugly and I got big lips\nBut as I walk by your girl, she wanna ride King's tip\nGoing down in fame just remember my name\nNot a sapoe with a afro, a king with a brain\nIf a sucker gets beef and wanna battle let 'im come\nWe'll discuss it over lunch and drink some one-fifty-one\nAfter that I set a trap even though I feel tipsy\nThe crowd starts to clap and I ain't even got busy\nI'm great, some people say that I'm a genius\nYou said my crew was wack, you haven't even seen us\nSo I'll get you back, can't survive too long\nTellin' lies about the king but I could take it I'm strong\nGot a Emmy in rap for usin' my cool strategy\nRappin' was nominated to get a Academy\nThe girlies I get, suckers probably get mad at me\nI don't care, King tee is the baddest, see\nFila's my trademark, I'm going for a medal\nLetting off some steam like fire to the kettle\nSportin' white gold and a baseball cap\nYou better look out suckers I'm here for the payback\n\n(\"I'm mad!\")\nYou know what?\n(\"I'm mad!\")\n\n(scratch freestyle)\n(\"That ain't right!\")\n(\"You wanna fight!\")\n\n(verse three)\nSee, I'm macho supreme, head honcho of the team\nNumero uno, Kadafi of the Hip Hop scene\nAnd I could be a cool rebel, I'm already tough\nDominant rap artist, never spoke on a bluff\nDown and I'm hard, when I'm rockin' I'm smooth\nI get a trophy for mostly doin' B-Boy moves\nAffiliated with a posse, let me go down to the list\nScotty Dee, Keith Cooley, and Cold Crush Chris\nVatchiek's a pro, he's also down with the krew\nThe master mind of the drum, DJ Cool Pooh\nIf you ever get souped up, you'll look like a poot butt\nYou'll ask me to stop, and I ask you to \"Do WHAT?\"\nI won't stop till I paid you back\nBy the time I'm through with you, you'll wanna smoke some crack\n'Cause I'm the King tee, there is no other\nYa better get ready, my payback's a mutha\n\n(scratch freestyle)\n(\"Hey!\")\n(\"Woo!\")\n(\"Get down!\")\n(\"I'm mad!\")\n(\"I'm mad!\")"}]}