{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "Gitcha Mind Right", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "[Hook]\nNow getcha mind right, baby you a siiimmmppp\nAnd I'ma real hot undercover piiimmmppp {*4X*}\n\n[Pimp C over Hook]\nUhhh... Tony Snow knalmtalkinbout? Tony Snow bitch!\nYoung Pimp, Young Pimp! Sweet Jones! Yes it is, it's goin down!\nUh! Huh! Dedicated to Fat Pat, Lil' Daddy knalmtalkinbout?\nBig Dog and Biz... Baby Looney\n\n[Pimp C] {*singing*}\nI'm so throwed in the game\nGettin my paper, takin over they brains\nThe drank over the ice is so cold\nPulled up to the light and let my diamonds strike a pose\nThese niggas in this game they wanna stop the Pimp\nDon't wanna see me comin up and flyin like a blimp\nI think they feel like I'ma threat\nBut I'ma old school motherfuckin vet\nSo getcha mind right!\n\n[Hook]\n[Pimp C]\nUh! Pimp C, Sir James\nY'all can't fade this country thang\nNigga in \"The Source\" tried to hate on me\nBut bitch I got the whole South ridin wit' me (ridin' wit me!)\nAsk this nigga Jeezy, bitch I'm the truth (I'm the truth!)\nMe and Short Dog go and smoke in the coupe\nI'm talkin 'bout Too $hort not that fake nigga (uh!)\nThe rap game full of all you fake niggas (fake niggas!)\nNigga in ya booty gettin raped nigga\nIf you ever take a trip upstate nigga (state nigga!)\nI don't wanna see them niggas in the city\nHis gal head was good but her pussy was shitty (pussy was shitty!)\nThat's right nigga, I flipped ya bitch (flipped ya bitch!)\nShe a three-way freak, every ho take a dick\nSent her on a mission, go hit that lick\nYa dick is so weak and my game is so slick\n\n[Hook]\n\n[Cory Mo]\nYeah, uh.. getcha mind right nigga, act like y'know\nCory Mo pimpin that pen with Tony Snow\nOnce again in the lab with a pen and a pad\nI'm been payin my dues since early '94\nMe and Mike Mo both got a wall full of plaques (plaques!)\nTen car garage and it's all full of 'llacs ('llacs!)\nFront to the back, Seville to the fleet\nCan't miss me bitch, keep a ear to the street (huh!)\nGotta trunk full of beef for you ho ass niggas (ho ass niggas!)\nI'm eleven steps ahead of you slow ass niggas (slow ass niggas!)\nGotcha gal on my team and she kiss my pinky ring\nEverytime I tell her to, \"Nigga, who the hell is you?\"\nI'ma underground king with a hell of a slang\nPimpin and pampering women with a hell of a game\nI'm tellin ya man, I'm making some incredible change\nSo getcha mind right ho, stay the hell outta my lane ho\n(get the hell outta my lane ho!)\n\n[Hook] - 1/2", "year": "2006-07-11"}]}