{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/4b94adf039cd60481b11a123e817daec.662x566x1.jpg", "title": "HICKORY", "year": null, "album": "WORD O.K.", "lyrics": "[Hook]\nOh my god what the fuck oh my god it's all love\nSometimes we do it for the kids other times we gotta do it for us\nSomebody always wanna tell you you ain't doing enough\nBut if you listen to everybody you'll be looking all crazy and fucked up\n\n[Verse 1: KOOL A.D.]\nEvery one is stupid, every one is dumb\nShout out to the moon, shout out to the sun\nPeace to the ocean and shit. Pacific, specifically\nBut it's all the same ocean literally\nDog I'm greased up haters can't stick to me\nRollin' even if you can't picture me\nSticky green leaves, pussy smell victory\nSee me sittin' on the dock—hickory\nNever really fuck with fuckery or dickery\nShout to Amaze 88\nMy grace slicker than Jefferson's Airplane, Starship, whatever mane\nStick with what's in front of me until I see a better plan\nSee me on Conan, next time Letterman\nIf not like I said \"whatever man\"\n\n[Hook]\n\n[Verse 2: Talib Kweli]\nHickory dickory dock\nThese haters want my victory stopped\nWish you would flock\nThese hits they consider me pop\nMy rapport with the fans more complicated than a mystery plot\nMy future brighter than your sisters reebok's\nFrom uptown make you duck down like KRS used to\nFuck it duck down like Dru-Ha\nCrush wild cuz you softer than a loofa\nBlack plus a watch still a rock thats a trutha\nReconzie the real homie you don't look too familiar\nMy familia we be hanging like mothafuckin Mr.Cooper\nNever the ku klux\nNiggas is important like a black man with a new tux\nCuz they sellin out for a few bux\nGot this shit backwards like one girl two cups\nWhen it comes to these rhymes who do you trust?\nIm here forever fuck a buzzer, I ain't a crew cut\n\n[Hook]\n\n[Verse 2: Boots Riley]\nFull cup pasificts, drank tenacity\nHustle till the sundance not Butch Cassidy\nI am a revolver semi-automactically\nYelling \"fuck the police\" quiet emphatically\nLight the flames of the gasoline dreams\nIn flicker of the fire is power never seen\nThere's a hope for better dreams\nSelling coke from Medellín\nTagging names on the wall and I hope each letter sings\nI write with lead pipes and hammers\nWords are my weapons and I better not stammer\nProving this is science and action is better\nShut down the city you can beat it like a banner\nCampaigns reversed by champagne and cursive\nGot pain in our purses, bartenders and nurses\nYou motherfuckers nervous when we put them out of service\nCall security with curses cuz we taking what our worth is\n\n[Hook]"}]}