{"artist": "Professor Green", "songs": [{"album": "Alive Till I’m Dead", "title": "Crying Game", "image": "https://images.genius.com/03dd13269b9289e452bde3eb7d1a6577.1000x1000x1.jpg", "lyrics": "[Verse 1: Professor Green]\nNo religion, all I follow is my feet no psalms\nAs far as holy water I would need a bath\nEven breathing stressing he didn't even ask\nSo far passed stressed that I can't even see the 'r'?\nHis is as I am truly, high at times I'm ruly\nMy minds screwed, and my moods blew as a lazuli?\nAdd to that my heart isn't good I lie to these groupies\nLike I like em I don't like em I just like to get the goodies\nSo disrespectful giving your chick a neck full, of salty water\nShe sorta looks like she bit on a pretzle\nSkilled I'm passed that, I'm past them\nGot that lemon pass that, then you lucky if you see it passed back\n\n[Hook]\n\n[Verse 2: The Streets]\nNever trust a man with two phones\nYou couldn't throw Pro Green like you'd throw two stones\nAnd Pro Green knows, I'm in the gap in this market\nFor the gafts and sharp wit, I laugh it off partly but\nHave to start to think, no parteners in this\nJust a part of the business, after the party is finished\nWe part with a wish, Danny Dyer eating Paella, in that dire dwelling\nSo badly wanted out, one more try on the selling\nThe 80's dream was the fate of our scheme\nMe, Ted Mayhem and team, In sport we were taught to be sporting\nBut in law we were courting something\nBut don't rate me in the 80's we were naughty in the noughties\nThere's a parroty, now I see, that's between charity\nI beat you at your peak, I'll beat you on the beak\nAsk me anything, many men end here\nMany never made lengths, I'll tell you when your spent\n\nNow you care for me\nYou see it Mike, they think I speak as nice but I don't belive the hype\nNow you care for me\nThem man are idiots, there's no defeating us, soon they'll see that it's a *crying game*\n\n[Hook]\n\n[Verse 3: Professor Green]\nI'm on jet fuel, them man are on fumes, dizzy\nI guess them man are on shrooms\nI'm as bad as an animal got loose\nIt's sticky in the manor?\nOh when your moving Mike, why you still moving why?\nWhen they look at you like when you move\nDon't matter what you do with the mic", "year": null}]}