{"songs": [{"year": null, "image": "https://images.genius.com/f85c1a562a0a260e061aa6a73251d4ef.1000x1000x1.jpg", "title": "Bring It 2 Tha Table", "album": "Monsterifik", "lyrics": "[Intro: Big Scoob]\nEvery time I'm out tryna enjoy myself, man, I got all these lil motherfuckers in my face tryna talk bout rap shit, you hear?\nI'm so sick of talkin bout rap, man\nWhat you niggas do before this rap?\nDid you niggas make a mark before you started rapping?\nIf you niggas ain't talkin bout money, man, stay the fuck up out my face in public, you heard me?\n\n[Chorus: Big Scoob]\nWell if it's bout money, bring it to the table\nBring it to the table\nWell if it's bout money, bring it to the table\nI got everything that you need\n\n[Verse 1: Big Scoob]\nMake them run for the boarder, place an order, bring them in\nFuckin with these Mexicans, never bring less than 10\nSnatch a nigga's necklace, then [?]\nMan I love this life I'm in [?]\nI'm a grinder, and I get it from the F13\nBefore the V, I crossed the line, and hit the grind 13\nVersital criminal, guess it runs in my jeens\nGeneral really hard, I go so hard for the cream\nTwistin beakers, bouncin pots, I'm the chef for the team\nGood creature, I can teach you bout money making skemes\nRather eat on that reefer, you can get it froI fill the table if I'm able, nothing less from me\n\n[Chorus: Big Scoob]\nWell if it's bout money, bring it to the table\nBring it to the table\nWell if it's bout money, bring it to the table\nI got everything that you need\n\n[Verse 2: Skatterman]\nWell if it's bout money motherfucker, why won't you bring it to the table?\nI'm connected in the naborhood, like tied water cables\nIf you got 'm, I can pump 'm in a week\nGot a deal if you're buyin, get your price straight to me\nCoke under my fingernails, Crack all on my tank top\nTold my daughter that I was, but baby,I can't stop\nWanna be down, homie, you gotta be up\nA hundred eighty thousand to the plug just to re-up\nNo tank, so I'm back to pushing goddamb white\nOn the streets with my pistol, all damb night\nSkatterman and Big Fella, yeah, you're goddamb right\nI'll probably hustle till the feds take my goddamb life\n\n[Chorus: Big Scoob]\nWell if it's bout money, bring it to the table\nBring it to the table\nWell if it's bout money, bring it to the table\nI got everything that you need\n\n[Outro: Big Scoob]\nYeah, me and my nigga Skatt Nasty, man\nYou niggas know man, it's big paper trains still rolling, man\nI wish my nigga Snug was in this motherfucker with me\nBut with or without these niggas, man, I gotta get this money, man"}], "artist": "Big Scoob"}