{"songs": [{"year": "2015-11-13", "album": "Next Step", "image": "https://images.genius.com/623f415517090669819e4d39e8a4e309.600x600x1.jpg", "title": "Life’s a Race", "lyrics": "[Hook]\nIs it worth the money? Should've stopped me at the start\nAin't shit funny when you watched me fall apart\nIf I could turn the time and rewind to a nicer place\nI wouldn't, no way, 'cause I learned that time's a race\n\n[Verse 1]\nThey asked me why I took the heavenly step\nAnd tried to quit what I was on, ain't got no serotonin left\nAlmost impossible to have fun, shit what if I collapse on\nStage next birthday? I just hope that I have one\nGetting blazed from an age, I barely had pubes\nIf I leave this world, just know that I fuckin' had too\nI'm in a bad mood, what have I done?\nThe doctors tell me they can fix me tell me what have I won\nOkay, with rap, I topped that, but then I thought I dropped back\n'Cause I realised, at the top, is it really hot lad?\nI just wish I could change up some certain shit\nAnd open up my brain like a brain surgeon is\nLooking in like \"what have you done?\"\nAin't know happiness left it's just a bottomless rut\nI've had enough of this game and the fame, it's ridiculous\nCan't go anywhere without someone wanting pictures, shit\n\n[Hook]\nIs it worth the money? Should've stopped me at the start\nAin't shit funny when you watched me fall apart\nIf I could turn the time and rewind to a nicer place\nI wouldn't, no way, 'cause I learned that time's a race\n\n[Verse 2]\nSometimes you see me smile but I'm hiding my tears\nYou can call it bipolar but I'm writing my fears\nI can say I'm fearless, I'm fearless of a human\nBut I ain't fearless of this feeling I'm consuming\nWish this would stop, yeah, Scott's got a weak side\nPop another pill, go to sleep and hope I did die\nWhat the fuck I thinkin'? Man, I need to get away\nDoctor's blame the Xanax, codeine and the Marryjane\nHopefully by the time that this shit drops\nI'm clean and they don't find me in a snip knot\nOn the fucking program wish I took it slow man\nI dove into rap and took over, what you know man?\nAbout bein' poor as shit\nAnd your missus goes to work, you try ignore the shit\nAnd suddenly you're rich, you're buying houses by the water\nStill you're depressed, I want an answer from the lord brah\n\n[Hook]\nIs it worth the money? Should've stopped me at the start\nAin't shit funny when you watched me fall apart\nIf I could turn the time and rewind to a nicer place\nI wouldn't, no way, 'cause I learned that time's a race\n\n[Verse 3:]\nStanding on the cliff edge, bout to jump dickhead\nI'm in a dark place do you wanna see this shit end\nOh poor me, why I whinging on tracks?\n'Cause I'm addicted to tabs and I'm admitting it lad\nI ain't got shit to hide, And don't you sympathise\nI'm in the middle of the ocean, wanna sink and die\nWill this feeling fly? And will I be all right?\nOr am I better off ending everything I tried? Why?\n\n[Outro]\nIs this worth the money?\nIf I could turn back time but then time gets away"}], "artist": "Kerser"}