{"artist": "The Game", "songs": [{"title": "240 Bars (Spide Joke)", "album": null, "year": "2006-01-26", "image": "https://images.genius.com/9c29ee407cd2d88f01ce08743e61d3b1.614x614x1.jpg", "lyrics": "[Verse 1: The Game]\nHere the break down\nSpider Loc is a joke\nNigga sound like chunk off the goonies\nYa life is a movie\nYou ain't a factor you a actor fifty gave you a script\nWent from runnin with the bloods to a g-unit crip\nWhat's a g-unit crip? not a gang in LA\nBang on records but nigga won't bang in LA\nWhy the fuck you wake me up. .. nigga I'm tired\nYou a busta, so I'mma light your ass on Fire\nNigga want my spot so he runnin with buck\nKeep tryna play The Game, and u 'gon get fucked\nI heard diss after diss, lil nigga you suck\nLike yo baby mama, in the third row of my truck\nNaw-vail ill whoop your ass in your own hood\nYou so hard why didn't u put out that song about Suge\nTrapped in the closet, R. Kelly ass nigga\nGet swiss cheesed up, ol' deli ass nigga\nT.boz in belly ass nigga\nBetter ask around, I been the truth since Makaveli passed nigga\nAnd I ain't wanna have to do this shit\nI'd rather be at home listening to the Cam'ron diss\nDr. Dre said it best 'a bitch is a bitch'\nYou a myspace gangsta nigga suck my dick\nYour flow is budweiser, mines is crystale\nPut the faggot on ice he gon be there for a while\nNow watch me put my chest out like 10 og's\nI wore this G-unot shirt to show m.o.p\nI'm gutter mutha fucka\nTell you fuck you to Fifty face, and won't st-st-stutter muthafucka\nAnd now that I put the kids to bed\nI tell you a story about a spider caught in his web\nMarvel williams, a well known crip\nNot cause he put in work, but cause his brother a snitch\nHe belong in g-unit, I'mma tell you the truth\nFifty, this nigga brother tell more than you\nSo I'mma break it down like an ounce of glue\nI met this nigga spider at Alliyah video shoot\nTrue, true, he had on no blue\nDmx start laughin he said 'this nigga think he better than you'\nSo I kicked a freestyle, and in the meanwhile\nThis nigga soakin up game tryna copy my style\nGave him a hundred bars, all he did was smile\nAnd DMX named me the fuckin problem child\nNow back to the future, you got a problem now\nSnoopin around my hood, get fucked doggy style\nI pull ya faggot ass out them g-unit sneakers\nAnd let ya soul burn in hell on the anniversery to 'ether'\nYou g-unit crip, used to be a piru\nYour name marvel, all you need now is a spiderman suit\nBlack wallstreet bitch you can't fuck wit my crew\nMy flow blind baby, I'mma make you do what it do\nLets take a ride Nigga I'mma make room in the coupe\nPut the shovel in the truck, throw you in there too\nBitch in the passenger side, say she hear somebody screamin\nTurn the music up.. baby that's comin from the speakers\nShe said I ain't trippin I hear somebody screamin\nI had to throw her off so I start singin\n\nI know you don't love me\nYou ain't the same when 50 Cent's in town\nI know you don't love me\nYou always talkin' bout how Ma$e get down\nI know you don't love me\nYou scream and holla when Spider Loc's around\nGot me fucked up wit them g-unit crips\nTryna run game on me you punk bitch\n\nGet yo ass in the trunk\nProdigy know that I ain't a punk\nKeep these rap niggas in check like a pair of ducks\nWho can flip like I do?\nSpit like NaS too?\nRock a yankee fitted, still throw up piru?\nRock a dodger fitted in the middle of the bronx\nI shine in any hood like paul wall fronts\nNigga my flow foolish sit back while I do this\nWatch me manuever threw cedar block, and end up in hoover\nI spit like a Ruger\nYou spit crap like a rookie dice shooter\nSnake eyes to the loser\nNigga I'm grand pooba\nGave em somethin' grand nubian\nCreated g-unot, fifty tried to sue me and\nSay he kick me out the group nigga I left\nSpider, you want my spot nigga? clean up my mess\nDirty ass nigga, fifty give him a check\nAnd if you sign, nigga put ya contract on the internet\nI been bangin for 10 years, muhthafucka I been a vet\nFor 500 dollas he'll claim any set\nGive him a 1000 dollars hell tat it on his hand... damn\nThat's worse than me lyin sayin olivia was a man\nYa XXL cover look like makin of the band\nYou mad, cause I got my own shoe\nAnd my nigga take shots for the game like MJ do\nSome say its bullshit till I pull quick\nTill I empty a full clip\nGet on the horn, meet me in the bullpit\nTony yayo you old ass coward\nYou 36 and u spit your hottest verse on my album\nNow.. I ain't sayin that you dope nigga..\nBut you better than spider loc Nigga...\nFifty saw the opportunity and thought he could use him\nI know he don't be listenin' to that wack-ass music\nYou got the west on your back? you a lyin bastard\nYou the reason niggas push mute when they play madden\nWhat the hell made you think you could fuck wit the game\nWhen yo claim to fame was Yukmouth's chain\nTake my advice and lay low\nHeard you and your uncle Yayo\nGot ran the fuck outta san diego\nI'll give you 5 shots when the 38 blow\nLeave a hole in your chest.. the size of a bagel\nWe can do it when you say so\nWait till the Lakers on the road, shoot it out at the staples\nOpen your chest, show the world what you made of\nMy dick hard I can't wait till the day come\nWhen I can put the infared on him\nLet billboard rest, don't speak on my dead homie\nAll you new west coast niggas chill\nThe city is mine, Eazy left it to me in his will"}]}