{"artist": "Inspectah Deck", "songs": [{"title": "Certified (Chamber No. 9)", "lyrics": "Beware the Ides of March\nMen at times are masters of their fates\n\n[Verse 1]\nNow I couldn't stop, even if I came with ABS\nWavy‚ fed‚ cashing crazy checks‚ that's why they be vexed\nGot they lady wet, 'cause I'm far out, Space Cadet\nI've been breaking necks‚ since the boombox tape cassettes\nI ain't faded yet, place your bet, Deck's a major threat\nSort of like a portrait of nature the way I take your breath\nCoast-to-coast‚ no boasting, yo, you're the favourite, Deck\nEveryday I'm making boss moves, y'all been taking baby steps\nPull up in the Navy stretch next to the grey sea, yes\nNobody guards homie, I'm straight in the shady set\nI get paid for rec petrifying like the face of death\nHow I handle these kids got niggas calling ACS\nHate to check me out, no doubt, I'm out the spray the set\nAimin' vet, pushing more raw than the way connect, make them sweat\nImma blow your mind like the greatest sex\nLines so defined, like I wrote it with a laser jet\n\n[Bridge]\nWhen I introduce you, I'm gonna say, \"This is a friend of mine\", that means you're a connected guy\nNow if I say instead that, \"This is a friend of ours\", that would mean you're a made guy, \"A Capiche?\"\n\n[Verse 2]\nCertified, rappin' fire verse, once the curtains slide\nLeader of the rebellion, yo, this could turn the tide\nStay killing it, my God, watch the murder rise\nInput my output watch the server fry\nI let the burner fly dickheads get circumcised\nMy life is one big dream like in the workers eyes\nI hear the whispers I heard the murmur lies\nSo what the snakes in my circle I bear no further ties\nSir, I, bring the pain like the hurt inside\nOr when the person died you should've heard the cries\nWord of wise, fuck with rebel, it ain't worth the prize\n'Cause I be deep in the crease right where the serpent lies\nI make your lady clap that ass maybe twerk her thighs\nMerrily these words go round like a circus ride\nTrying to tell him Rebel won't be commercialized\nWorldwide delivery to your curbside\n\n[Outro]\n\"This is my friend, more even than my own family\"\n\n\"Is that right?\nFriend of mine, friend of ours?\nWhat do I - What do I call you? Friend of ours? or-or-\"\n\n\"Keep your fucking mouth shut about me. You know what I'm saying? Hey, Don.\"", "image": "https://images.genius.com/df4bc3c22c4376e2b600dbcdec1d3543.1000x1000x1.jpg", "album": "Chamber No. 9", "year": "2019-07-12"}]}