{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/0042c9ded9794acfd385d53c944fe819.600x600x1.jpg", "title": "Gods of E.din", "year": "2015-06-04", "album": "Planet of the Gods", "lyrics": "[Verse 1]\nHe first appeared with workers and engineers\nThrough the Earth’s hemisphere and the Ozone layer\nWith angelic space gear, the Sky God\nThat travel in celestial pods of bright stars\nThe father called his children, the children came down began building\nA technology brilliant, they flying stealth along the Cosmic Belt\nThese gods had help, but the help disagreed and went for self\nThat split the team of the Elohim, they came for Isis blood\nThe Nine wore righteous above the 24 sat on the left and the right of the judge\nCarried their creation across the darkness to the Earth they set up bases\nOne shot a laser and left craters in their faces\nThey had lovers and enemies, discover the infantry\nThe Mother of Divinity storm like wizardry\n\n[Chorus]\nThe gods of E.din the stars there’s a meaning\nWho do you believe in Angels or Demons?\nDid man come from Earth or somewhere in the universe?\nWho was here first un-pure birth – Gods of E.din?\n\n[Verse 2]\nGivin’ birth to a race of reptilians in the base of a pyramid\nEscape, create apes before the Genesis\nGenetics impregnate the gods Kings were beheaded\nWorkers were murdered, along with the seven scientists\nMeaning of Orion’s Disc\nSpirit Kings put Zion at risk, did the Mayans know this?\nOr the Sumerians? Winter Solstice fill the Vatican with explosive\nThen there was war in Heaven, the angels were spiritual weapons\nVerses alien god legends all brethrens, Michael with his rifle\nAnu and his disciples, wars before the Bible\nDestroying stone work in a huge domed church\nCatacombs out in Rome digital network – web search\nCan you perceive god consorting Eve?\nWhile Adam slept after eating from the tree of knowledge\nAbout his colleagues and the walls in his palace\nAdam never had a naval,  Adam was never born\nAdam the angel fell from storm, made after they form he was warned\nAnu verses Set, the cube is the net if YouTube is the set\nHe chopped his body into thousand pieces\nBut the gods kept on increasin’ until they overpowered the region\nGods over E.din"}]}