{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "Maryland", "album": "The Chalice", "lyrics": "[Intro: billy woods]\nRemember how we used to push the lawnmowers all around this neighborhood, man?  Just to get money ‘cause niggas didn’t want a real job and shit.  Soon as they gave us the money, we’d just go sit on our lawnmowers, get some weed out and just smoke that shit, play ball all day, man.  That was back in the day, man.  Shit.  And one time, my lawnmower just broke, we just left it in the woods and shit?  Damn\n\n[Verse 1: billy woods]\nThanksgiving Day, Barry Sanders on the breakaway\nEarly on, I went to his house, he came\nTo mine, so we ate twice.  Cornbread\nTurkey, wings, peas, and rice.  We went in the shed\nThat night with four bottles of 800 Ice\nI’m telling you: by midnight, we was crazy nice\nSharing the jack, my man gave me some advice\nLike, “Everything comes with a price\nAnd change the only guarantee in life.  One day\nWe might not be so tight.”  I was like, “Come on\nDude, always be me and you,” but, inside\nI knew in some ways it was true.  He said\n“Be careful what you do ‘cause that’s what you are\nAnd every day you open your eyes is the one to be thankful for\n‘Cause everybody gets a lifetime, nothing\nLess, nothing more, so before you step\nBe sure and know there’s always a time for war\nBut you can never really even the score\nOr see what’s behind that door\nWhen I’m gone, just pour a little on the floor”\n\n[Bridge: billy woods]\nMaryland, you’re my life\n\n[Outro: billy woods]\nYo, nigga always keeping wood for you, nigga, always, ‘til we going to meet the man!  Yo, you remember that time I was running, we was both running from the cops and shit and hopped that fence and I lost my backpack down in that grass and shit, and I was scared to go back and shit ‘cause it had mad weed in it, and you just went back, I was just waiting for you on the porch and shit like, “Yo, this nigga probably got arrested.”  You came back with the bag, and we just smoked the biggest fucking Philly you ever seen, nigga"}], "artist": "​billy woods"}