{"songs": [{"image": "https://images.genius.com/02543f01dfa688d0e7de36632a1cd58b.1000x1000x1.jpg", "title": "Lie", "album": "Perception", "year": "2017-10-06", "lyrics": "[Chorus]\nI heard you told your friends that I'm just not your type\nIf that's how you really feel, then why'd you call last night?\nYou say all I ever do is just control your life\nBut how you gonna lie like that, how you gonna lie like that?\n\n[Verse 1]\nYeah, I heard you said I ain't the type for you\nI don't regret it though, I learned from it\nThey should have you locked up for all the time you stole from us (Woo)\nTook you out when I had no money\nOnly person that you ever cared about was you, that's why it's so funny\nYou want somebody that'll keep you warm at night\nThen, tell me, why you actin' cold to me?\nYou ain't the only one to blame, no, I'm the one that made you rich\nWhen I bought every lie you sold to me\nYeah, heard you threw away the pictures\nBut you still got the memories of us\nSo I guess I don't really make a difference\nFlippin' through 'em in your head\nGot you texting me all hours of the night\nYeah, you told me that you needed distance\nWhat's the deal with you?\nYou say you want a man that keeps it real\nThen why you mad when I get real with you?\nYou want someone to pay the bills for you\nWent from feelin' you, now I feel for you, liar\n\n[Chorus]\nI heard you told your friends that I'm just not your type\nIf that's how you really feel, then why'd you call last night?\nYou say all I ever do is just control your life\nBut how you gonna lie like that, how you gonna lie like that?\n\n[Verse 2]\nLook, let me guess, you want to stay friends?\nTellin' people that's how we been?\nTellin' everybody, yeah, that we was barely speakin'\nAh, that's kinda funny, why'd you call me every day then?\nIt's immaturity, you goin' off the deep end\nYou just want somebody you can chill and get some drinks with, cool\nThen don't hit me on the weekend\nTellin' me you missed the way we talked and how I listen, yeah\nWhy you playin' with my mind, huh?\nWhy you playin' with my time, huh?\nTold me, \"We should let it go and put it all behind us\"\nThat's what I did, now you askin' me what I done, I was\nWaitin' for this day, I saw it comin'\nI think you just like attention, tryna tell me all your problems\nI got issues of my own, I ain't got time for all this drama\nYou told me that you don't really wanna talk—then why you callin', huh?\n\n[Chorus]\nI heard you told your friends that I'm just not your type\nIf that's how you really feel, then why'd you call last night?\nYou say all I ever do is just control your life\nBut how you gonna lie like that, how you gonna lie like that?\n\n[Bridge]\nHow you gonna lie, how you gonna lie like that?\nBaby, how you gonna lie, how you gonna lie like that?\nHow you gonna lie, baby, how you gonna lie like that?\nNo, no, how you gonna lie like that?\n\n[Chorus]\nI heard you told your friends that I'm just not your type\n(Baby, how you gonna lie like that? No, no)\nIf that's how you really feel, then why'd you call last night?\n(Tell me how you 'bout to lie like that)\nYou say all I ever do is just control your life\n(No, no, no)\nBut how you gonna lie like that, how you gonna lie like that?\n(Oh, yeah)\n\n[Outro]\nTell me how you 'bout to lie like that\nTell me how you 'bout to lie like—\nYeah, yeah, hey"}], "artist": "NF"}