{"songs": [{"image": "https://images.genius.com/70b2ca5e1882a2f184d45a2e6ccb37eb.916x916x1.jpg", "lyrics": "Ladies and gentlemen, we are gathered here today\nTo remember the life of many\n\nWhat makes this world so cold?\nPeople have to die before they even get old\nStories untold, hog with a ho\nTell the homies and the hoes to leave me alone\nCause I know that all I gotta do is stay focused, stay dedicated\nI'm tryna get a bank with a better statement\nAnd this is for the people said I'd never make it\nAnd for the hoes who won't fuck me unless I'm famous\nMind educated by the world around it\nBeen elevated in the Himalaya mountains\nSo now I'm drinking from the fountain of life\nThey wonder \"why this white boy stay sounding so nice?\"\nMaybe cause I was meant to speak the truth to em\nOver melody, I'm in the booth flowing\nWith a pen and a pad and a glass of some gin\nMe to music like this hat to a brim\nClean and simple, I can't be separated\nYou got a dream, but you scared and you yet to chase it\nSo you ain't going nowhere fast\nThink you fresh cause your clothes got Polo tags?\nI'm on a journey boy, I don't look back\nPlus I'm fresher than a laundromat, now look at that\nI can change the world on a Monday through a Friday\nAnd turn around and get fly straight 5 days\nJust gotta do this shit my way\nYou ain't an artist cause you got your own MySpace\nPlease don't waste my time\nAnd if you got a lot of hobbies, don't say you grind\nCause you way behind, I'm on my way to shine\nIn a hurry, ain't taking my time\nCause I waited long enough, my time is now\nAll these bloggers online tryna find my style\n\"He a stoner, he don't know shit\nAin't a struggle in his life he gotta cope with\"\nI'm just telling you what's in my mind\nCause I'm finna be the best when I'm in my prime\nNow they got the High Life playing in rewind\nSay I'm something of a different kind...I guess\nHomework must've slipped my mind\nWhere the fuck you find a young'un who can spit like I?\nMy button down shirt equipped with a tie\nCause boy, I'm on the business side\nYoung entrepreneur, no Diddy though\nWho makes movies while you making home videos\nI just wanna let my whole city know\nThat a young boy finna blow\nYou either with me or against me\nThe death of the emcee", "year": "2012-01-27", "album": null, "title": "Death Of The Emcee"}], "artist": "Mac Miller"}