{"songs": [{"title": "Get Low", "lyrics": "[Intro]\nOh nigga guess what?\nWord got back about them lil marks who jacked you and harold\nI know where they be kicking it at!\nDown with a 187?\n\n\n[Hook - Rico Love][x2]\nBack up in this bitch, fiends going HAM like it's crack up in this bitch\nLike I bought a pack up in this bitch\nErrybody on the fucking floor click clack up in this bitch, tell em\nDuck! get low [x3]\nComing for your head bout that motherfucking bread\n\n[Verse 1 - Young Chris]\nHad my shooters smoke em like Buddha\nYou losers, study up this [?], I make a move, bitch Luda\nWe loading it up and letting it rain until they check ya\n'Sheed Wallace right on test we bring them techs out\nBlow the ces out, cave his chest in, leave a mess out\nNo need for the stretcher when it's death out\nRevolver, ain't a shell case left out\nY'all running out of petrol, It don't ring outside of the city\nYou niggas metro, [?] loco, we do it global\nFor real, check out my mojo, make all the hoes go ew\nWe count boxes for you young impostors, you can't stop us\nBig choppers, ready to die big poppa?\nAddicted to the watches, bitches in my boxers\nFiends shooting up like helicopters\nNigga you's a witness to the coppers, death to all sammies\nI got em in line for raw candy, guess who's back?\n\n[Hook]\n\n[Verse 2 - Young Chris]\nWe be clubbing, fucking, puerto rico, ski-o\nSend the work through the CO's dirty piss for the pee-os\nBright white for the pipes, SD for the woods\nNigga your pass expired, you gotta sneak in the hood (You's a bitch)\nLittle sucker ass nigga from the block\nWe don't fuck with that nigga get him shot\nWe rush down to clip up, it's murder when she lift up\nMore dirt to dig up, more work to whip up\nShe say she on her period, I let her eat the dick up\nI'm taking all y'all bitches, it's a stick up\nYou faggot niggas switch up\nShit go down, first to bitch up\nRapping ain't for you niggas, give up\nCould buy a nigga tie, faggot somebody get him a casket\nGet the bitches in traffic, they deliver the package\nI don't stay with a bitch, Y'all live with a rachet\nWord to prodigy, any nigga can have it\n\n[Hook]\n\n[Outro]\nY'all niggas hurry up\nGo in there, buck them niggas, and get the fuck out\nDon't be playing\n\nAy nigga I wanna know if you ready to do this shit\nIs you ready to do this shit or what motherfucker?\nAnd don't be acting like no pussy, fuck out the way\n\n\nAy homie you need some help?\nPunk ass nigga! C'mon niggas!", "album": "Gunna Season", "year": "2014-05-06", "image": "https://images.genius.com/6ce854a7d0e3a0fdc9d99f8087542d8f.500x500x1.jpg"}], "artist": "Young Chris"}