{"artist": "360", "songs": [{"album": "Loosies", "year": "2017-02-12", "title": "Panda", "image": "https://images.genius.com/abe3cfc92fbcdff0e796fa77de4fbcea.479x479x1.jpg", "lyrics": "[Intro]\nUh, yeah\nGet down with fucking trap arms and shit, nah\nI'm not gonna rap like a young thug on this shit, ayy\nAyy\n\n[Verse]\nI've got broads in Dromana who listen to Korn and Nirvana\nThere's plenty of fish, I went and caught a piranha\nDon't jump the gun\nListening to this shit'll pump you up\nShit's so raw but it's never underdone\nYour top five better have six number one\nBut I'm proud as fuck if I swallow it\nBetter be getting ready for stomach pump\nIf I leave it, I better get a tummy tuck\nNot ready to be a rapper with a chubby gut, no\nI'm the highest I have ever gone\nOn a level you were never on\nIn the best shit I have ever worn\nAll I'm hearing's \"where'd you get it from?\"\nThis isn't cute\nRappers are terrible, this is the truth\nI'm thinking this shit so I'm thinking of you\nLike \"what the fuck have I been listening to?\"\nIn the studio, they rock up\nThey walk in, they're like \"what's up?\"\nFind them a beat where the drop's tough\nAnd spend a minute in the shit like \"job done!\"\nIt's like damn, you and your man\nAll you be thinking when making your jams\nKicking catchphrases and making a slam\nThink of words that they can say in their chant\nKnow it's working so you cater to fans\nFuck 'em all, you? I'll be making a stand\nSee that label? They will pay your advance\nStab you in the back while shaking your hand\nSee to them? Real shit's corny\nThey don't listen to shit, they ignore it\nTheir condition to think that it's boring\nThey want that ignorant shit inapplaudded\nRather be hitting a lick, dick in a chick\nDrinking at six in the morning\n'Stead of political shit that is riddled with everything that you think isn't important\nThis is your warning, smarten up\nSay how you feel, they're like harden up\nAll I want, a culture that's hard as fuck\nIn order to do that, they target us (wooh)\nThe powers to be they not being honest\nAmerican radio got them some bosses\nAnd look at the prisons, he got ‘em some stock in (wooh)\nWhy? When prisons are filling the stock hits a rocket\nSo, what is the logical model to fill all them pockets with dollars? It's gotta be obvious\nWhat is a prominent topic of all of the songs at the top is\nThey talk of a life in a popular genre\nThey glorify crime and they want you to want it\nThey don't want your conviction, they want you as convicts\nEven provide you that rock in your pocket\nBut they are the ones who are profiting from it (wooh)\nThe cops on the block, they don't want you to want it\nTheir jobs are more promised when locking up convicts\nYou go to prison, you top up their wallets (yeah)\nYou learning that life is not what you wanted\nSo, when you get out, you promise to stop it\nBecause of your past, you not get a job again (nah)\nApologies, sorry, I gotta be honest\nYou needing to eat, you gotta get dollars\nYou're forced to go out on the block and just hock again\nI sorry to say they don't want you to change\nWhat good are morals? There's dollars to make\nThe US of A, convict anonymous (yeah)\nI sorry to say they  want you to change\nWhat good are morals? There's dollars to make\nThe US of A, convict anonymous\n\n[Outro]\nYes, I'm so fucking glad that I did that in one take\nFucking, fucking gl- I'm so gleeful now\nI've-I've been like fucking doing this\nSo many times and just fucking it up\nBecause I haven't got it downpat yet\nBut, that time, I just fucking did it\n[?] Got a fucking semi now\nYou should see my dick, it's like that big\nBut like, on a floor, it looks- kind of looks mad\nI'm just joking, eh, my cock's like that big on a floor"}]}