{"artist": "Wale", "songs": [{"title": "Blood Money 3.5", "year": "2014-12-23", "lyrics": "[Verse 1: Wale]\nNew York get the blood money\nReal niggas smoking loud ass weed\nStill counting my math, La Marina\nSummertime I be in the spot\nOn the hood shit, smell me niggas, it’s all\nDC got love for me\nYoung niggas sippin’ all that lean (try slowin’ them down)\nReal live at the town, they be go-go’d out\nI play the let out, smell me, nigga, still flat out, uh\nChilly weather, Balmain with many zipper\nI’m ballin’, see my closet a dollar of Penny's in them\nAnd ain’t talkin’ about no problems\nCause problems get finished quick with ‘em\nNiggas ch-ch-chopper brat-tat-tat any nigga\nKnow that the city vicious\nDrug dealing right here appealing\nLike they some villains or something they at the hero in again, uh\nNow here I come and who carries Maryland with ‘em?\nThe crabs in the bucket?\nFuck it I’ve been aquarium clearin’, uh\nComing through with some young Surulere goons\nRest in peace to Boo\nUsed to rock them Melo number two's\nThat was ’02, maybe ’03, oh, please\nStop it, you’re Origami, I’m finna fold crews\nUh, overseas to the back block\nUh, straight G’s where I’m at Bob\nUh, and we done seen it growing up\nWhen the fiends get they look\nThey always jukin’ like it’s black rock\nSpin it, you know let’s get it\nTake this money, I’ma take your bitches\nAnd no I’m not a gangsta, but I stay authentic\nThat’s why I go up to any place and remain unblemished\n8 for the tennis, I’m great with the lyrics\nThe niggas upstate saying \"'Le niggas tellin'\" like “'Le niggas tell it\"\nSay the niggas tell ‘em\nI swear a nigga heard I ain’t e’er been a weller\nRedbone redbone, well put together\nPut it in my cell, I can put it in your belly\nKentland. what’s up? Landover. what’s up?\nRoll pass Ardmore, feeling local as fuck\nAudemar keep it on, niggas won’t even touch\nWhen you home and you humble you get a lot of respect\nAnd niggas trappin’ trying to get at all the bread\nGet up out of the jungle, get his daughter a bed\nGet his son some gear, find a pot he can piss in\nSo quarters moving back and forth like it's a lottery ticket\nAnd to be honest who gon' want McDonalds position?\nNo time for chicken nuggets but somehow they find all the dippers\nThey slipping\n\n[Clip from Elaine]\nHey. I just spent a lot of time and I have eaten a lot of crap to get where I am today. And I am not throwing it all away now\n\nBlood money (yeah yeah)\n\n[Verse 2: A$AP Ferg]\nAh (blood blood)\nDaddy, daddy was a legend\nHarlem born, money gettin'\n'til he pull an armageddon\nTrigger brrrr cerebellum\nMellow at the 7/11\nMama had to call the reverend\nDaddy teach your hood a lesson from the seven Mac-11\n8:30, eight Mac 10's, crack been\nPutting genocide on my Black friends\nRichard Porter seen the slaughter\nAlpo kinda sorta was a ho\nCause he left the whole hood in heated water, damn\nShit niggas still glorify\nHe had all the rides\nHe had all the bitches fucking all the thots\nHe the man, rocking Dapper Dan\nWith a gun in hand, Pakistan\nI don’t understand how you kill your man (damn)\nI don’t understand how you kill your man\nGoddamn, how you kill your man over money when\nTwo Harlem kids in a gang do the devil’s dance\nCause the greed of money had them caught up all up in a trance\n\n[Verse 3: Wale]\nFuck niggas taking nothing from me\nSun going down in a town, ain’t nothing funny\nLittle buddy on a corner with a quarter\nOn 'em, father with the law and the the mom trippin' off the water\nTalking to herself in public\nI’m looking out South Florida Avenue\nHaven’t you heard of the dealers and loiterers\nThe trappers and murderers\nI could see Sursum Corda from the Mandarin Orien\nTal, you see the glory in this?\nI don't see it nigga\nThey keep it G, you can't see it, nigga\nThey see you on tees and see you on the scene slipping\nYou being hot, you see I’m Pac\nDon’t be in public\nWe ain’t seen peace around these parts\nSince Teen Summit, blood money", "album": "Festivus", "image": "https://images.genius.com/988a0210cfb98b5e09ff91b6b9760a0a.514x514x1.jpg"}]}