{"artist": "CalBoy", "songs": [{"title": "Nina", "album": "Wildboy", "year": "2019-05-31", "image": "https://images.genius.com/33eeaabad87daf9980dfa3a693243128.1000x1000x1.jpg", "lyrics": "[Intro]\nHey, yeah\nWhat up, Super? What up, Super?\nWoah, hey, oh\nHey, hey\n\n[Chorus]\nThink I fell in love with Nina\nI been lookin' for my baby, have you seen her? (Can you tell me, have you seen her?)\nI know niggas out here lurkin', so I need her (Niggas lurkin', so I need her)\nAnd I love the way she bust it when I squeeze her, oh, oh (Way she bust it when I squeeze her)\nI'ma hand my bitch to bronem if I'm leanin' (If I'm leanin', oh)\nBetter grip her tight when I'm thinkin' 'bout them demons, oh (When I'm thinkin' 'bout them demons)\nTryna keep her quiet, but I love it when she singin' (And I love it when she singin', oh)\nAnd she stick to my side 'cause my bitch know that I need her, oh (And my bitch know that I need her, oh)\n\n[Verse]\nHave you ever had a little bitch save your life?\nSame bitch want me, finna take your life\nNiggas playin' games, we could play all night\nNigga fucked the bitch, make it spray all night\nHeard them niggas want war, me and gang don't fight\nGot to take her on the road, can't take no flight\nOn the block with the bros, helped me earn my stripes\nAnd she soft with the blow 'cause these niggas ain't right\nAnd she hate when I mess with her\nTold her she belong to a rich nigga\nTold her she could blow at a bitch nigga\nWent up at a nigga dome, get him disfigured\nSo I don't wanna miss with her\nIf I tell my bitch to blow, she gon' flip niggas\nOn the road doin' shows, take a trip with her\nAnd she love when she ridin' in the whip with us\nAyy, think I fell in love with Nina (Think I fell in love with Nina, oh)\nNigga, tell me if you've seen her, oh (Nigga, tell me, have you seen her?)\nAnd I heard that nigga tweakin' (And I heard that nigga tweakin', oh)\nBut she blow his ass to pieces, oh\n\n[Chorus]\nThink I fell in love with Nina\nI been lookin' for my baby, have you seen her? (Can you tell me, have you seen her?)\nI know niggas out here lurkin', so I need her (Niggas lurkin', so I need her)\nAnd I love the way she bust it when I squeeze her, oh, oh (Way she bust it when I squeeze her)\nI'ma hand my bitch to bronem if I'm leanin' (If I'm leanin', oh)\nBetter grip her tight when I'm thinkin' 'bout them demons, oh (When I'm thinkin' 'bout them demons)\nTryna keep her quiet, but I love it when she singin' (And I love it when she singin', oh)\nAnd she stick to my side 'cause my bitch know that I need her, oh (And my bitch know that I need her, oh)"}]}