{"songs": [{"title": "No Love", "lyrics": "[Intro]\nYou've always been a good child\nCome on, let's talk\nNo, mommy\nI wasn't always a good child, mommy\nY'all niggas think I ain't come from the bottom, man\nOh, y'all think I ain't still speakin' that street shit?\nCome on, man\nFuck the streets, man\nThe streets don't love us\n\n[Verse 1]\nMan, we livin' to die\nFor my fam, man, I'm willin' to die\nThat image of my brother layin' dead is still in my mind\nYou can see the pain still in my eyes\nThat smile you see me with, man, that shit a disguise\nI ain't happy, nigga (Happy)\nAin't shit sweet (No)\nSeein' a young black man goin' six feet (Damn)\nOh, you tough nigga (Oh, you tough)\nBut you ten deep\nI got two lions with me, you got ten sheep (Pussy)\nStreet math, Blood (Huh?)\nAin't no time for no beef, I'm chasin' the bag, Blood (Huh?)\nI left my opps in the past, Blood\nAin't no bad blood (Nah)\nI got three eyes open, one in the back, Blood (Huh?)\nJust in case these niggas get out of character (Grr)\nI'm runnin' from police, hoppin' the banister (We out)\nI'm takin' risks for my mother, just to take care of her (I love you, ma)\nAnd you can call me a dyke, but niggas was scared of her (They was scared)\nI swear my heart colder than winter in Canada (Huh?)\nThat's why I carried the heater\nUsed to drink the Hennessy by the liter\nI used to be at Blu crib, weighin' and baggin' the weed up (Fact)\nStuff the pack in the box and brief a little bit in my sneaker\nPosted up in the V, seein' the D's try and creep up\nJust to harass us, just to be dickheaded bastards\nSearchin' the car, tryna trap us\nBut can't prove that we trappers (No)\nNever went to church, 'cause I believe in God, not a pastor\nYeah, the Devil work, but God work faster\nI seen my brother go from human to Casper\nFrom a bed to a casket\nTryna move on, but it's like my life goin' backwards\nLife a bitch, man, I swear every nigga done smashed her\nSometimes I hate that bitch with a passion\nI believe in real life\nY'all niggas believe what y'all read in the caption\nWe ain't tweetin', I ain't preachin'\nMan, we really in action\nNothin' change, still quick to crack the egg in ya basket, motherfucker\n\n[Chorus]\nAin't no love in the streets\nFuck you, if you ain't fuckin' with me\nAll that love that you showin', that mean nothin' to me\nI don't trust niggas, niggas be plottin' and schemin'\nReally tryna rock you to sleepin'\nLike why they hate a nigga for no reason?\nWhy they hate a nigga for no reason?\nIs it because the money bustin' out the seams?\nI swear there's no love in these streets\nAin't no love in these— (Uh)\n\n[Verse 2]\nI couldn't thank my mama enough (Thank you)\nShe the reason I don't give up\nShe the reason I'm tough (I love you, ma)\nShe the reason if a bitch leave me, I don't give a fuck (No)\n'Cause a bitch is just a bitch and a nut is a nut\nThese hoes choosin' (Huh?)\nThis world is full of fake and confusion (Facts)\nI'm just married to the money and committed to music (Facts)\nReal niggas still exist, I'm one of the few who can prove it (Facts)\nLoyalty nowadays is just a painted illusion\nCrazy, you can have heat with the same nigga you cool with (Uh)\nEnd up shootin' the same nigga you shoot with (Grrr)\nMoral of the story, man, watch who you move with\n'Cause that jealousy ain't nothin' to fool with (Uh, uh)\nMan, they left my brother dead on that pavement (On that pavement)\nThe same niggas he would hang with and bang with (What the fuck?)\nAnd we claimin' this gang shit (What?)\nThat's why I keep the Glock when I'm sleepin'\n'Cause I don't even trust the niggas I eat with\n\n[Chorus]\nAin't no love in the streets\nFuck you if you ain't fuckin' with me\nAll that love that you showin', that mean nothin' to me\nI don't trust niggas, niggas be plottin' and schemin'\nReally tryna rock you to sleepin'\nLike why they hate a nigga for no reason?\nWhy they hate a nigga for no reason?\nIs it because the money bustin' out the seams?\nI swear there's no love in these streets\nAin't no love in these—", "album": "Herstory In The Making", "year": "2019-09-27", "image": "https://images.genius.com/f06180c99d3e1065bc630862c9787d3d.1000x1000x1.jpg"}], "artist": "Young M.A"}