{"artist": "Drake", "songs": [{"year": "2007-01-01", "album": null, "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg", "title": "Doing His Thing", "lyrics": "[Intro]\nT. Slack, I promise I got 'em, homie!\n\n[Verse 1]\nI turn the phone off, I let the seat back\nI'mma be out for a minute, I'll bring the heat back\nThe jet-setta and forever will I get chedda\nAnd y'all will only get cash when you get betta\nCheck luggage, flow to a new city\nPlus, the hoodie cover my eyes\nI'm too pretty, nah, I'm just playin'\nHeavy is how I weigh in\nTop floor with a view of the water is what I stay in\nBut y'all don't hear me, yeah, y'all ain't relatin'\nWell, let me tell you what happens when I be datin'\nThese chicks with ass fully skip they class\nCatch me at the hotel and try and get they cash\nBut, I'm not stupid, nah -- I'm tight fisted\nYou tryna sex me for money is quite twisted\nPrior to fall, I was lying to y'all\nSo if you gettin' one ring, I'm denyin' ya call\n\n[Hook]\nLet him breathe, let him live\nLet him be, let him do it on his own\nHe a G, he just doing his thing\nGotta love that\nLet him go, let him fall\nLet him grow, if you feeling where he's at let him know\nHe just doing his thing\nGotta love that\n\n[Verse 2]\nNow my momma kinda iffy, My uncle kinda shifty\nExpenses at this point have cost a little over fifty\nThe hummer and the range was in someone else's name\nHope my city's reputation for the summer's gonna change\nI hope you stick around and see it\nCause if you ain't around I'll bring your chick around to see it\nUntil she catch feelings and I have to let her go\nAnd when I park my car outside she'll stick around and key it\nRepercussions of a cheap lash\nHad me doing repaints, just to get em re-scratched\nAnd get attached do insane things\nTake new jewelry and put it down the drain things\nBut, that's just the drama that the fame brings\nFresh prince tryna touch sky like\nMr. Busy, Mr. Recieve the shipment\nIt's Mr. big dreams, no more than 2 months commitment\n\n[Hook(2x)]\nLet him breathe, let him live\nLet him be, let him do it on his own\nHe a G, he just doin his thing\nGotta love that\nLet him go, let him fall\nLet him grow, if you feelin where he's at let him know\nHe just doin his thing\nGotta love that"}]}