{"artist": "Asher Roth", "songs": [{"title": "Ash Wednesday ’18", "image": "https://images.genius.com/7edd56ad6fa2961e9b056b3edae5846f.1000x1000x1.jpg", "album": null, "lyrics": "[Verse]\nFor no apparent reason, I felt the calling of the east\nI need a change in seasons\nIt’s like I long for something deeper, but what is we seeking?\nAlthough I cannot see it\nBut see I still believe it, it's like faith its in Jesus\nI ain't driven this religious truck\nHard believing anything, nobody seems to give a fuck\nMurder, guns, sex, drugs, anything for little buzz\nSell it for a couple bucks, no wonder I be feeling stuck cause\nWhen I wish on constellations to bring me my information\nFeel like communication gets lost in translation\nMaybe it's for the better, replace us with their intelligence\nUs flawed humans is too prone to own negligence\nToo doomed to decadence, new clones is evident\nNew dope is president, nuke hopes to jettison\nNews home, truth gone\nToo stoned forgetting we better than so we loop on\nEmbedded, need a new song\nProve wrong, they blue ball y’all til ya mood stall\nBlue collar hooha, nah dog we too strong\nWork around the clock for what? A million dollar yacht\nCome on we ain’t needing a lot, just a blue ribbon and shot\nBro its city wide, this Philly vibe\nWe sick and tired of lily lies\nTried to see the best but why y’all do it to us every time?\nNext in line, wrecking jobs, blame it on the Mexicans\nHomie we know the robots way more of a threat to rise\nGet your mind right\nFor what? Minimum wage\nWhen it’s 40 hours retail till Comcast paid\nSo I don’t rhyme fast on my tracks, you hear what I say\nSell a dime to a pay ya mom back, get locked in a cage\nIt’s ridiculous the system consistently sticks its dick in us\nKicking no resistance and hitting us till we’ve given up\nY’all kidding if you thinking I ain’t bending down to pick us up\nThe only way they listen is pick a beat and rip it up\nThen best believe each evening I'll be writing down new literature\nTill little kids is giggling say kill it ash you litty bruh\nReally tho, we feel it, they ain't never getting rid of ya\nThis spitting ain't chlamydia just setting up to titty fuck, what", "year": "2018-02-14"}]}