{"artist": "6LACK", "songs": [{"album": "FREE 6LACK", "title": "​here’s to being free", "lyrics": "In July 2011, I signed to an independent record label owned by a popular artist at the time. The deal came with an advance that was little to nothing but at the time it was my only way out and the artist who I was signed to was very popular so I took the chance. After spending a year in college chasing love and studying shit I could care less about I finally had the opportunity to do what I loved so I seized it. I didn’t even withdraw from VSU, I just dropped everything and left. Initially it wasn’t that bad, but it never is in the beginning. In the years to follow I found myself at my absolute lowest. After the little advance money ran out I was unable to eat most nights, had no stable place to stay, and found myself living out of a ripped up backpack. They had me making hundreds of songs I hated to meet their criteria of what they viewed as “hit records”. All I ever heard in that place was hit record hit record hit record hit record. I watched so many people go in and out of that studio, they always used to tell me that I was special, that I was next up. All I felt was jailed. Instead of doing their whole two-step and dancing in the shackles they set out for me, I chose to sit in that cage and not release any of the music they forced me to make. They wanted me to just be a hit song and I wanted to show them I was more than that.\n\nFor the next three years I had to make moves in secrecy. I put music out on my Soundcloud even though my contract didn’t allow me to release any music on my own. With the few songs I put out I grew enough of a following and established my brand. When the label found out I thought they would start taking me seriously but they didn’t and that’s when I knew I had to get the fuck out of there. I needed to work with people who understood my vision and would get behind it. People who understood what was going on in popular culture and not just popular radio. I eventually found that team in LVRN. I remember sitting down for our first meeting, thinking about how much I was over the industry and hated the people in it, but I listened and all of my doubt quickly disappeared. They understood that music is so much more than just making hit records and they understood everything I wanted to establish with my brand. I believed in them and they believed in me. When I met them I had recently gotten out of the contract I was trapped in for so long. It’s amazing how something so small as a piece of paper can control you for life. For five years I felt owned. There were so many times I wanted to upload my entire hard drive of songs to Soundcloud and just put it out, but I couldn’t sell myself short so I waited. It was painful at times, like I just wanted to quit and never make music again, but when you have a vision it’s kinda hard to call it quits.\n\nI’ve always known what I wanted to do but I couldn’t do it alone. The one thing that has gotten me through all of these years of living in captivity was love. Love from friends, family, fans and even strangers. So much of it that I often look at the little I’ve done so far and wonder what the hell people see in me. I’ve had the opportunity to meet some amazing people in my life and the fact that most of them remain regardless if I ever released another song is a blessing I’ll never take for granted. After five years I’m free from my first contract, I now have an amazing team in LVRN and I’m finally able to do shit the way it should’ve been from the jump.\n\nHere’s to being free.", "year": "2016-11-18", "image": "https://images.genius.com/9f111ac21b205f296ae84413d00f14a2.1000x1000x1.jpg"}]}