{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/9e883c930374c1c92c7094a3280231be.491x491x1.jpg", "title": "Color of Murder", "year": null, "album": "I Killed the Devil Last Night", "lyrics": "(Intro)\nDo you know the color of murder?\nDo you understand what the color of murder is?\n(You'll be written out the will of Priest)\nIt's what I write, this is Priesthood\nNeo... You know, Angel of...\n\n[Killah Priest]\nYo, my ink bleeds fatigues on paper\nPlace it on gangstas, beneath light poles\nI write scrolls of hood tales\nMy tight flow's a blood trails of ink\nI dreamt of rhymes and crayons, color to spray on\nBrothers, my rap is like drawn book of crooks\nTo sing along wit covers, made from concrete\nOpen, it in ciphers, I paint flows\nAs they come off the Prophet tongue\nI rock a King's robe, holdin' my papa's gun\nMy metaphors is hard like the feathers on thorn\nHelmet, it's Leo' Di's letter, dawg\nRockin' bluish velvet, this man is no rapper\nThe pen in his hand is used to cast a spell\nBlack Israel, my fist hail like the Panther\nLaugh at rappers like they stand-up\nThe man gon' hand touch my gat\nAnd my words are, the colors of murder\n\n(Hook) 2x\nHe's like Michael Angelo wit the flow\nOr Leonardo Da Vinci, his pen squeeze like a burner\nIt could hurt y'all, and these are the colors of murder\n\n[Killah Priest]\nI sat my pages wit the poison pen\nMy choice of gin is anything earlier than 1600's\nHell of a stomach, I take straight shots from the shells of gunman\nInvade your block wit elephants comin'\nLike Hannibal comin' from Carthage\nBut it's more like the Priest comin' from his projects\nLoad the cartridge in my marker\nAnd my pen is a scope, check the murder I wrote\nThe flow gets darker (What's the color dawg?)\nTwo cups of Dracula's blood\nThree teaspoon, a goon, a gat and a couple of thugs\nA small funeral room, a fitted cap and a ice mug\nThe skies color of maroon\nWhere young brothas doomed\nOver crack, his shoulder shrug\nThe little brotha went too soon\nFrom a hot bullet, from a burner\nWonder if he suffered?, I don't know\nBut I write the color of murder\n\n(Hook) 2x\n\n(Interlude)\nThis is it, the colors of murder\nHa-ha-ha-ha-ha, I laugh at ya rappers man\nYo, y'all niggas gon' make me laugh son\nYo, this is the color of murder now I'm writin'\nCheck it out, uh, uh, uh - ha-ha-ha-ha\n\n[Killah Priest]\nFuck y'all rappers, I love to war\nWhat do you think all my armor's for\nTake ten paces back, then draw\nBut the draw dunn revolves wit the pen\nColors that blend, the complex to your end\nDress me as your Highness\nIf you get me mad, throw you in my wine-press of my wrath\nNow I'm drunk from the grapes of violence\nI sip the colors from the Devil's chalice\nChemicals imbalance, and my brain, migraines\nI can't go further, and my words are, the colors of murder\n\n(Outro)\nDawg, the colors of murder\nGet 'em in the righteous circles\nTear these rappers in half\nI ripped my book apart\nThis is it, told you I could write it\nThe colors of murder\nColor this, and color the bullets and color the thugs\nWhatchu mean? What is it?, What do you mean?\nI just finished writin' these colors of murder\nIt's gon' be so good, what rhymes wit hematopenic\nWhat blends, I need the words, to just match\nGotta attach this to that, sorry\nWhat did you say? I have to finish this\nThe color of murder\nSincerely yours: Priest, leads of Lards\nThe Duke of Larks, the Duke of the hood nigga"}]}