{"songs": [{"image": "https://images.genius.com/553d4b761df5a646e5bc9a86be3cf74c.1000x1000x1.jpg", "album": "Six Paths - EP", "title": "Picture Me", "lyrics": "Picture me, 23, a bag of sold out shows\nI made it out of music, I took all my bros\nAnd this merchandise is poppin, I sell all my clothes\nAnd all these hoes are ghost, I got one real girl\nPicture me, 23, I didn't chase my dreams\nMy mum wanted me to do finance, so I came off beats\nAnd now I'm sitting at a desk, with a 2:2 in finance\nEating pasta on my lunch break\nWhile I'm scribbling my rhymes\nAnd picture me, 17, in an all black suit\nLaying still in a coffin, surrounded by my crew\nGiving half-heart apologies\nFor watching while they bottled me\nOr running when they shot at me\nYou're next up if you prodigy, wait\nI meant poke a G\nPicture me, a road banger, I hope that you don't notice me\nNo face for the road, my G\nKill him in seven ways, lemon haze how I smoke a G\nName can get you out the beef, pissed if you owe me Ps\nThem boys try and piss take, boy, what a mistake\nI'll come back with a shotty\nAnd blow your lungs out your ribcage\nPicture me a snitch, nah I couldn't picture that\nPicture me a snitch, nah I couldn't ever think of that\nPicture me with a baby mum\nThat didn't wanna see me blow\nSo she let my talent go to waste like Robinho\nI've been involved, I've seen the roads\nWhere the good die young, and the bad get life\nAnd the ugly is the ugly, but\nPicture me, a legend, worldwide or in Streatham\nKnown for words in a sentence\nI put verbs in a sentence\nThere's action in my letters\nAnd I never compromise\nNor follow what the trend is, I create my own style\nCos I got my own agendas, I got music all that matters\nBut what about the yutes that ain't athletes or rappers?\nWhat about the yutes that ain't athletes or rappers\nPicture you, I don't know your picture can you paint it for me?\nAnd can you take out all the man thats gonna taint it for me?\nAnd can you take out all the girls that's gonna waste it for me?\nOr illustrate how you're gonna get to all these places for me?\nAnd if you can't, then don't worry g you got time\nBut you just need to paint a picture, or just sketch a draft\nCos, how you know you're going down the wrong road\nIf you're in a dark place, and you don't select a path\nBut picture you talking loads about goals and riches\nWith a phone, full of cro shots, hoes and bitches\nAnd a head filled with fast dreams\nI talk to God like it's RE\nAbout my picture cause I can't see\nI'm at war with my mind\nSo I'm still with a sket getting Ed like Hardy\nAnd I don't mind\nCause them man there all speakers like Parties\nI'm conflicted on this mission\nSo I'm still in the mist with a black star on my waist like Kwame\nGuys are on my case\nIt's like i wasn't dialling banks for some pay\nWhile you was busy flicking shanks for a name\nOr busy robbin' drugs, with a dipper\nOr you could call me Scofield\nWhy? cause I got prison in my skin\nBut I won't ever have a prison in my picture\nListen to my scripture, like teachers with teardrops\nPrinciples a killer, all for the skrilla\nBut, it's not hard\nIt comes from within\nSo don't let anybody tell you to put drugs in the cling\nAnd don't let anybody tell you you can't run, dance, sing, or be a baller\nYou can be a king\nNow you can work a 9 to 5 if it makes you smile at night\nMoney ain't a measure of success\n'Cause you can have a billion and dead\nYou can have 20 grand flat and live a long, long life with no stress\nSo listen\nI don't know your picture, can you paint it for me?\nAnd can you tell me where you batch of friends is taking you\nAnd can you tell me what your aspirations are, your dreams\nForget the money brother, tell me what makes you you\nCan you tell me why you wake up, what makes you tick\nWhat makes you smile, what makes you laugh\nWhat makes you sick\nCan you tell me why you're on this earth\nCan you tell me why you're living\nIs it in and out of prison\nAre you tryna touch a nation?\nOr are you tryna touch a paigon?\nYou get your picture, get to painting\nAre you playing in a stadium?\nOr are you sitting in a station?\nYou get your picture, get to painting\nAre you the guy inside the hospital\nThat's praying that he makes it\nOr working with the surgeons and the nurses tryna save him\nAre you buried in a grave?\nFor some pennies and a chain\nA memory that fades\nA picture you didn't paint\nI bet them boys think I'm panicking\nPep Guardiola, G, I'm managing\nStop saying that you beef me, it's embarrassing\nI never had these paigons, till my face was on this rapping ting\nNow every other yute is on chatty ting\nSee me in a rave, it's black blades, lightsabers call me Anakin\nMusic, money, paigons, education, fam I handle it\nI try so hard in my tracks to give a message\nBut it's messed cah I'll still get you shredded by some savages\nI swear you don't know pressure\nAsk Jack, I had labels playing deal or no deal like I'm Noel Edmonds\nIndependent, no pressure\nMy whole team Nike'd out to the socks you should know better\nA-levels, no pressure\nAnd my ex just text me, she should know better\nI can still paint a picture, put a pen into my hand\nIt's time to paint your picture my brother\nNow you can go get it", "year": "2016-08-26"}], "artist": "Dave"}