{"songs": [{"album": "Gutter Rainbows", "image": "https://images.genius.com/195bc58c1487ceee38b62b9e3ae90bdb.300x300x1.jpg", "year": null, "title": "Cold Rain", "lyrics": "[Intro]\nLet's try somethin' new\nIt’s been a long time coming!\nLet me try something brand new\nHey yo Ski!\nWe overdue, man\nCome on!\nYo what we do it for?\n\nThis is for the day-trippers and the hipsters\nWhores and the fashionistas\nSpiritual leaders practicing all the laws of attraction\nThe teachers who read the passages\nFrom the Bhagavad Gita\nWe bustin off Dalai Lamas and flashin' heaters (?)\nWith the shooting, the thugging and all the spooning\nThe crooning, the auto-tuning. Alas\nYou be tellin', peddlin' to consumers\nI'm helping them to see through it\nGet with this new movement\nLet's move it!\n\n[Hook]\nThrough the cold rain\nI’m still standing right here\nEven though it (?)\n\n[Verse 2]\nYeah I’m a product of Reaganomics\nFrom the blocks where they rockin' the feds like Jay Electronica\nDrop and make this a lock that the crime is where the heart is\nCould drop, and make us (?), that the crime is where the heart is\nWhere the Jesus or Muhammad regardless of where the mosque is\nThey hope for the Apocalypse like a self-fulfilling prophet\nTell me where do we stop it?\nDo they ask you your religion before you rent an apartment?\nIs the answer burning Qurans so that we can defend Islamics?\nThe answer's upon us with a hash tag, a trendy topic\nYou take away the freedoms that we brought in the game\nThen you disrespect the soldiers; you ask them to die in vein\nIn a desert praying for rain\nMy music's like a drug, and they tend to take it in the vein\nIt ain’t for the well-behaved\nThe soundtrack for when you're braver, the score when you felt afraid\nMore than your average rapper so you sort of felt the (?)\nThe brain is like a cage, you a slave, and that's why they lovin' you\nThis is the book that Eli that start with a K-W\n\n[Hook] x2\n\nI do it for the trappers, other rappers\nThe backbackers, the crackers\nThe niggas, the metal-packers\nThe victims of ghetto factories\nI do it for the families\nThe citizens of humanity\nMCs endangered species like manatees\nI do it for the future of my children\nThey the hope for the hopeless\nWhen karma approaches we gon' be food for a flock of vultures\nThe end of the world, ain't nothin left but the cockroaches\nAnd the freedom fighters\nWe freedom writers like Bob Moses\nThey chose us, freedom writers like (?)\nFor my block, my boro, my hood, my city, my state yea\nMy obligation to my community is so clear\nYea, we gotta save them, this opportunity so rare\nWe do is so big over here that it's not fair\nTo the punks, the bitches, the chumps, the snitches that sneak in the game\nWe let them live although they weak and they lame\nThey posers and jokers, promoting when they speaking my name"}], "artist": "Talib Kweli"}