{"songs": [{"year": "2008-11-04", "album": "The Renaissance", "image": "https://images.genius.com/5d721c8b6f6e8f0141dafa2547e2bd79.500x500x1.jpg", "title": "Believe", "lyrics": "[D'Angelo]\nI believe... that's love, that's love\nI believe... that's love\nI believe... that's love, that's love\nI believe... that's love\nI believe... love, love\n\n[Q-Tip]\nUh, of the things we believe\nThere's a whole lot of work, we should roll up our sleeves\nAnd we got to hold firm when fateful sight conceiving\nWhy doubt your plans? Cause it's all worth believing\nWe can make it work, do believe that\nLeave mistrust in the dust and believe fact\nWe can achieve tact by tuning out negative feedback\nNaysayers can hate, we concentrate to bring belief back\nInto ourselves, into the world, into the rap game\nEmcees are miserable, their music should be leaving mics maimed\nMan, look we holding out for the truth\nIf we alone and aloof, we gon' hold for the proof\nMan put it in believing, believe in believing\nSeeing ain't believing, it's the feeling that we needing\nBelieve in each other, put the question to the system\nThey promising returns? Then question what you getting\nWe should believe in the reasons we existing\nTime for Renaissance to reawaken what is withered\nBelief can confirm, make it is what it isn't\nSometimes I wish I had belief when I didn't\n\n[D'Angelo]\nI believe... that's love\nI believe... that's love, that's love\n\n[Q-Tip]\nIn the land of make-believe, time to make unbelief believable\nTaking belief to the realm of the real\nBelieving this shit that's force-fed through the media\nBelieving it's real when it's really a raw deal\nNever disbelieve when you see human miracle\nLike ghetto children shining bright in Babylon\nBelieve in that, don't believe in stats to the contrary\nGotta be weary of them theories, carry on\nPeople find belief when they don't find identity\nBelieve in your friends, don't believe in your enemies\nMountains of doubts and disbelief right in front of you\nTroops on the other side, what you gon' do?\n\n[D'Angelo]\nOooh... oooh, oooh, heeey\nOoh that's love, that's love\nOooh... oooh, oooh, heeey\nOoh that's love, that's love\nI believe...\nI believe...\nI believe..."}], "artist": "Q-Tip"}