{"artist": "R.A. The Rugged Man", "songs": [{"album": "American Lowlife", "year": null, "lyrics": "[Intro]\nYo, yo, they asked me where the fuck I been for all this time\nI been fucking poor out of my fucking ass\nEating fucking shit, fucking ugly bitches\nCause everybody knows that pretty bitches ain't down to fuck nobody poor and shit\nBut that shit don't even matter\nIt's all about you faggot-ass motherfucking rappers\nThinking y'all dope, driving Lexuses and shit like that\n\"Every Record Label Sucks Dick\"\nBut yo, yo, but but but you be sucking on your record label's dick\nWord up! This is just a little something\nFor motherfuckers to let them know I didn't fall off the Earth\nYou know what I'm saying?\nAt 5, 4, 3, 2 in the morning, losing my fucking mind about to murder people\n(Fuck them motherfuckers)\nYo, yo, yo, yo, check it out, yo yo yo yo yo, like this\n\n[Verse]\nThey snakes in this rap field, fuck the fat deal\nCap peeled, how does choking on the smoke from the gat feel?\nThe Rugged Man, record label suicide, move aside\n(R.A. calm down) Who the fuck you think you are?\nI smack that bitch who works the front desk\nThat strictly be there for high school credit\nBut sucks dicks of all the rap stars\nPut me behind bars, cause Mister A&R Man's\nBout to get fucked in his asshole and brother I'm not even gay\nShay, shay, shay! The president of the company\nDon't care if I'm dead or if I'm bleeding\nI'm not succeeding, they turned my mindstate into evil\nCause I want everyone dead on this fucking Earth\nIt really hurts, cause if music doesn't work\nI got nothing left to live for except dying in the poorhouse\nAnd bitches hate my fucking guts\nThose sluts loved me more than Patrick Swayze\nWhen I had my steady income\nI need a spot that I can sin from\nSuicide, never, but I got plots of taking out the other people\nAnd I ain't doing jail time, that shit is wack\nAin't no coming back, once I lose control my shit is finished\nSo don't get in this, you record label people gonna die\nAnd your family gonna die too, motherfuckers!\n\n[Outro]\nHahahaha, yo, yo\nYo, that's just a verse, one verse\nYou can't buy this shit, this shit is not for sale\nThat's for the real rap fans\nBut see, real nowadays is just a fucking gimmick anyway\nI'm keeping it real, I'm staying real, all this bullshit\nYo, yo, how the fuck is you supposed to be real\nIf you can't rap for real or can't flow for real?\nYou got your hip-hop styles on and you reading them fucking rap magazines", "title": "Flipside", "image": "https://images.genius.com/db5f1be160a3b09ca4a61618f595fe41.400x396x1.jpg"}]}