{"songs": [{"image": "https://images.genius.com/93191e5fbb9c92f68382ad93094246f5.500x500x1.jpg", "year": null, "title": "Hold On (What’s a Thug to Do?)", "album": "Vengeance is Mine", "lyrics": "First Verse:\n\nWhen I was young, I wanted to be man of the house\nHave a car, kids, and Vanessa Williams as my spouse\nA dog in the yard, to protect the premises\nFuck Good Times, I'm talkin' about some of that Cosby shit\nFour bedroom home, white trimmed with green\nI'll be a doctor, regular American dream\nI'll go to college, obtain some knowledge and a degree\nI'll go to Stanford, CSUS, or maybe UCB\nCould go to law school, try to pass the bar\nI could be a fireman, maybe a movie star\nCould play hoops and be the next Mike J\nGettin' paid for a game I like to play anyway\nMan, so many options, which will I choose?\nPursuin' my dreams and I'm willin' to pay dues\nGotta take care of Mama, I'ma buy her a house too\nLook out for my sister, the first thing I'ma do\nWhen I'm rich, no more apartments full of roaches\nWe'll have the best of everything, at least that's what I'm hopin'\nSo in the innocence of youth, I stand strong\nAs my future unfolds I keep holdin' on\n\nChorus:\n\nHold on, never let 'em see you shed a tear\nMy soul's gone, on the inside I've been dead for years\nHold on\nMama, all my love's for you\nSo much drama in the World, what's a thug to do?\n\n(2x)\n\nSecond Verse:\n\nNow it's deep, it's gettin', it's gettin' kinda hectic\nCuz life as an adult ain't quite what I expected\nBills to pay and mouths to feed\nEverybody askin' for what they want, instead of what they need\nI thought it would be easy, I was mistaken\nThought my folks would have my back, but they be fakin'\nI went to the pen instead of college\nTryin' to have more than a dollar in my wallet\nFucked around and got a girl pregnant\nMy baby\nWon't be neglected the way my Daddy did me\nAll of my dreams turned to nightmares\nAnd if I tell you about it, maybe you might care\nI got a (???) girl pregnant but she got an abortion\nSaid I wasn't disciplined and didn't have caution\nDidn't want her only child to be fatherless\nShe told me I would be dead before next autumn hits\nI disagree, but maybe she's right in a sense\nCuz I'm a \"G\" until the day they put me in the crypt\nNo bullshit\nHard livin' got me on one\nUntil the day I D-I-E I'ma be holdin' on\nStandin' strong\n\nChorus\n\nThird Verse:\n\nHolidays come and go kinda quick in the pen\nI got a call from my sister, it's my birthday again\nI barely noticed, deuce-five to life for murder\nOn Thanksgiving they fed us potato tots and hamburgers\nI made my bed, but it's too hard to be layin' in it\nFightin' the drama, but for some reason I'm stayin' in it\nWritin' to Mama, \"Can your son get a visit?\"\n\"I'm feelin' a little depressed, can you tell me what is it?\"\n\"What you suggest?  I'm stressed out beyond belief.\"\n\"So much weight on my chest daily, I'm missin' the streets.\"\nGot me stretched out like a pregnant lady's belly\nX-Raided is stagnated and it's drivin' me crazy\nI created this situation, I know that's the truth\nNo father figures in the ghetto, but that ain't no excuse\nMama excuse my behavior please\nFeels like my soul's gone\nPray for your only son, need to be strong\nAnd hold on\n\nChorus:\n\nHold on, never let 'em see you shed a tear\nMy soul's gone, on the inside I've been dead for years\nHold on\nMama, all my love's for you\nSo much drama in the World, what's a thug to do?\nHold on.......shed a tear\nMy soul's gone.......dead for years\n(No father figures in the ghetto but that ain't no excuse)\nHold on\nMama, all my love's for you\n(Mama excuse my behavior please, feels like my soul's gone\nPray for your only son cuz you need to be strong)\nSo much drama in the World, what's a thug to do?\nStretched out like a pregnant lady's belly\nX-Raided is stagnated and it's drivin' me crazy\nI created this situation, I know that's the truth\nNo father figures in the ghetto, but that ain't no excuse\nMama excuse my behavior please\nFeels like soul's gone\nPray for your only son, need you to be strong, and hold on"}], "artist": "X-Raided"}