{"songs": [{"title": "Nice For What (Remix)", "album": null, "year": "2018-07-01", "image": "https://images.genius.com/e3ada7df039a9896767990224e92a217.500x500x1.jpg", "lyrics": "[Intro: Big Freedia]\nI wanna know who mothafuckin' representin' in here tonight\nHold on, hold on\n\n[Pre-Chorus: Lauryn Hill, A Boogie Wit Da Hoodie]\nI keep lettin' you back in (Back in)\nHow can I explain myself?\n\n[Chorus: Lauryn Hill, A Boogie Wit Da Hoodie, & Drake]\nCare for me, care for me, you said you'd care for me (Yeah, this that real west side shit)\nThere for me, there for me, said you'd be there for me\nCry for me, cry for me, you said you'd die for me (That Highbridge shit) (Murda on the beat)\nGive to me, give to me, why won't you live for me? (That wave)\nCare for me, care for me, I know you care for me (This that wave)\nThere for me, there for me, said you'd be there for me\nCry for me, cry for me, you said you'd die for me (Die for me, give to me, give to me)\nGive to me, give to me, why won't you live for me?\n\n[Refrain 1: A Boogie Wit Da Hoodie]\nCan you come close?\nOnly time I get to see you through the photos\nOn Instagram talkin' to my old hoes\n'Til my girlfriend hear this shit she won't know\nBut it's alright\nWhat you don't know won't hurt you\nGotta keep your elbows in my mattress\nAnd you smell good, and it feel good\nAnd you arch right, and I love that\n\n[Chorus: A Boogie Wit Da Hoodie]\nAnd you care for me, care for me\nYou said you'd care for me, there for me, there for me\nSaid you'd be there for me, cry for me, cry for me\nYou said you'd die for me, give to me, give to me\nWhy don't you live for me?\n\n[Refrain 2: A Boogie Wit Da Hoodie]\nCome close\nOnly time I get to see you through the photos\nOn Instagram talkin' to my old hoes\nHavin' mood swings, bipolar\nFirst your hair low, then your hair long\nCan't control her, you know her\nShe's a demon\nI hope you tighten up on these bitches\nYou've gotta be nice for what to these bitches?\n\n[Verse 2: A Boogie Wit Da Hoodie]\nI understand\nShe just want to be famous, takin' all the snaps\nPlayin' tricks got me hesitatin' about that ass\nMy nigga, we don't eat cheese, no we don't fuck with rats\nI be missin' the streets, I hope they miss me back\n\n[Chorus: A Boogie Wit Da Hoodie]\nI hope they care for me, care for me\nI hope you care for me, there for me, there for me\nSaid you'd be there for me, cry for me, cry for me\nYou said you'd die for me, give to me, give to me\nWhy won't you live for me, care for me, care for me\nYou said you'd care for me, there for me, there for me\nSaid you'd be there for me, cry for me, cry for me\nYou said you'd ride for me, give to me, give to me\n\n[Post-Chorus: A Boogie Wit Da Hoodie]\nDon't come close\nGot the strap on me like it's velcro\nMichael Jackson, I make them moonwalk\nIt get bad for you, shoot her goons up\nYeah, YOLO\n\n[Bridge: Big Freedia, Letitia Wright, & A Boogie Wit Da Hoodie]\nUh-huh! (Oh yeah!)\nThese hoes! (They mad!) (YOLO)\nYour boy! (I had!) (YOLO)\nI made! (Watch the breakdown)\nDrop it low-low, yeah, can you come and drop it low-low?\nBaby, can you come and drop it low-low?\nYeah, can you come and drop it low-low?\nYeah\n\n[Breakdown: Drake]\nGotta make that jump, gotta make that, gotta, gotta make that\nGotta make that jump, gotta make that, gotta, gotta make that\nGotta, gotta, gotta g-g-gotta, g-g-gotta, gotta\nGotta, g-g-gotta, gotta, gotta make that jump, jump (Let's go)\nBend it over, lift it up, bend it over, lift it up\nMake that jump, jump\nBend it over, lift it up, bend it over, lift it up\nMake that jump, jump\nBend it over, over, over, over, over, lift it up\nMake that jump, jump\nBend it over, lift it up (Make that jump, jump)\nBend it over, lift it up (Make that jump, jump)"}], "artist": "A Boogie Wit da Hoodie"}