{"artist": "Pharoahe Monch", "songs": [{"album": "Desire", "title": "When the Gun Draws", "image": "https://images.genius.com/9550ab49453d639d9e2d3a07226ff0ed.500x500x1.jpg", "lyrics": "[Intro: Tom Mauser]\nSomething is wrong in this nation\nWhen a child can grab a guns—grab a gun so easily\nAnd shoot a bullet\nInto the middle of a child's face, as my daughter experienced\nSomething is wrong\n\n[Chorus: Mr. Porter]\nFirst the gun draws and you know that something's happening\nThen darkness falls and, oh, your heart beats rapidly\nBe prepared because war is coming\nYou can't be scared now, when the streets is calling you\n\n[Verse 1: Pharoahe Monch]\nGood evening, my name's Mr. Bullet\nI respond to the index when you pull it\nThe trigger, so make a note, take a vote\nQuick man, nickname's Quaker Oats 'cause\nWhether domestic violence or coke deals\nSee, I lust to change brain matter to oatmeal\nAnd when I kill kids, they say, \"shame on me\"\nWho the fuck told you to put they names on me?\nWhite man made me venom to eliminate\nEspecially when I'm in the hood, I never discriminate\nJust get in 'em, then I renovate\nFlesh, bone, ain't nothin' for me to penetrate\nAnd it can happen so swiftly\nOne false move just might shift me\nIf I'm enlodged and your soul's not claimed\nI'll remind that ass when it's about to rain like\n\n[Chorus: Mr. Porter]\nFirst the gun draws and you know that something's happening\nThen darkness falls and, oh, your heart beats rapidly\nBe prepared because war is coming\nYou can't be scared now, when the streets is calling you\n\n[Verse 2: Pharoahe Monch]\nWould the new method of murder be arson or firebombs\nIf the cost of a single bullet was more than the firearm?\nStrange, that is, when all exits are final\nPoint blank; range, that is\nMy attitude is cold and callous\nKilled kings in Tennessee, presidents in Dallas\nAnd if the past be known, at last we know\nWhat happened that afternoon on the Grassy Knoll\nIt's what made a widow of Jackie O\nThe government hired Lee Harvey to blast me, though\nFatality shot entered from the right temple\nWas not fired from a six-story window\nCan it be that it was all so simple\nBut yet remains so painful to rekindle?\nI come through your city, I'm hot\nWhether you're jiggy or not, whether you're Biggie or Pac\nWhen the gun draws\n\n[Chorus: Mr. Porter]\nFirst the gun draws and you know that something's happening\nThen darkness falls and, oh, your heart beats rapidly\nBe prepared because war is coming\nYou can't be scared now, when the streets is calling you", "year": "2007-06-26"}]}