{"songs": [{"year": "2017-04-14", "album": "DAMN.", "image": "https://images.genius.com/d25e7043f51c2de6acaf6c39caa60da2.1000x1000x1.jpg", "title": "GOD.", "lyrics": "[Chorus]\nThis what God feel like, huh, he-yeah\nLaughin' to the bank like, \"A-ha!\", huh, he-yeah\nFlex on swole like, \"A-ha!\", huh, he-yeah\nYou feel some type of way, then a-ha!\nHuh, he-yeah (A-ha-ha, a-ha-ha)\n\n[Verse 1]\nEver since a young man (Since a young man)\nAll I wanna be was a gunman (Was a gunman)\nShootin’ up the charts, better run, man\nY'all gotta see that I won, man\nSlick as El DeBarge with the finger waves, work it, JT\nHandle bars like a fade, watch me work it, JT\nI'm at large, runnin’ plays like a circuit, JT\nI'm sellin' verses, JT, watch me work it, JT\nLook, look… hol' up!\nDon't judge me! My mama caught me with a strap\nDon't judge me! I was young, fuckin' all the brats\nDon't judge me! Aimin’ at your head for a stack\nDon’t judge! Don't judge me! Now my home got a Valley peak\nDon’t judge me! If I press your line you a freak\nDon't judge me! Won't you tell a friend? Y'all gon’ see—\n\n[Chorus]\nThis what God feel like, huh, he-yeah\nLaughin' to the bank like, \"A-ha!\", huh, he-yeah\nFlex on swole like, \"A-ha!\", huh, he-yeah\nYou feel some type of way, then a-ha!\nHuh, he-yeah (A-ha-ha, a-ha-ha)\n\n[Verse 2]\nFuck is you talkin' to?\nAyy, do you know who you talkin' to?\nSlide on you like fallen drapes\nGod toss full of carnivals\nI kill 'em with kindness\nOr I kill 'em with diamonds\nOr I put up like fifteen hundred\nGet yo' ass killed by the finest\nEverything in life is a gamble\nNothin' in life I can't handle\nSeen it all, done it all, felt pain more\nFor the cause, I done put blood on sword\nEverything I do is to embrace y'all\nEverything I write is a damn eight ball\nEverything I touch is a damn gold mine\nEverything I say is from an angel\n\n[Bridge]\nI don't rush shit, fuck shit, always your shit, my shit\nCannonballs to ignite shit, morning to the night shift\nI'm on, I ain't sorry for it\nAsk for a piece of mine, you charged me for it\nI wanna see sometimes if you ignore it\nI'm in the streets sometimes and can't afford it\nI got a bad habit, levitatin', duckin' haters\nOh my! My heart is rich, my heart is famous\n\n[Chorus]\nThis what God feel like\nHuh, he-yeah (This what God feel like)\nLaughin' to the bank like, \"A-ha!\"\n(This what God feel like)\nHuh, he-yeah (This what God feel like)\nFlex on swole like, \"A-ha!\"\n(This what God feel like)\nHuh, he-yeah (This what God feel like)\nYou feel some type of way, then a-ha!\n(This what God feel like)\nHuh, he-yeah (This what God feel like)\nThis what God feel like"}], "artist": "Kendrick Lamar"}