{"songs": [{"image": "https://images.genius.com/b256017f3b831150266cf5131d761bfe.600x599x1.jpg", "title": "Ease Up", "album": "Playtime is Over", "year": "2007-07-05", "lyrics": "Look, it's ya girl Nicki Maraj\nMy nigga Ru Spits\nGetcha... G's up\n\n[Hook]\nWhere my niggas that's getting they G’s up\nIn the back and you rolling your trees up\nWhere my bitches that's getting they freeze up\nAnd getting they tease up, just tell em to ease up\nWhere my niggas that's getting they G’s up\nIn the back and you rolling your trees up\nWhere my bitches that's getting they freeze up\nAnd getting they tease up, just tell em to ease up\n\n[Verse 1: Nicki  Minaj]\nSee I don’t know what they take me for\nAnd I don’t know what they hate me for\nI gets cake fo-sho\nAnd I don’t know how to take it slow\nI’m the type to get right, stay in the limelight\nThese broke niggas always re-ing up\nNiggas see me in the beam now he speeding up\nI’m like \"Duke holler at me! When ya G’s is up\"\nOh, that’s the Kanye piece? Throw your Jesus up\nWhen I say I’m bout my guac, I don’t mean amole\nFeel like I’m being watched, I don’t mean a rollie\nI’m half past seven o' clock, all by my lonely\nSpits got the dessie on cock, don't run up on me, blocka\nBitches getting mad, cause they know they can’t, stop her\nNickname should be TV, the way they, watch her\nRun with a, shotter\nGotta be at least six feet to break me off, proper\n\n[Hook]\n\n[Verse 2: Nicki Minaj]\nSee, I don’t know what they take me for\nAnd I don’t know what they hate me for\nI gets cake fo-sho\nAnd I don’t know how to take it slow\nI’m the type to get right, stay in the limelight\nI’m at the bar getting Rémy on rocks\nI’m coming for these rap bitches if they ready or not\nYou know the girl, I already was hot\nYou tell 'em fuck a new bitch, I want a veteran spot\nLook, it’s Nicki M. in the place so stay back\nI stay around the white like I’m Pat Sajak\nPlus I had my A-game up since 8-track\nI’m Diddy with the flow, “Take that, take that”\nMy flow say ca-ching and my pockets say cheese\nI ain’t got a bag but my wrist say freeze\nDick em, trick em, I know how to pick em\nBeeeeert! Stick em, ha-ha-ha, stick 'em\n\n[Bridge]\nIf you wanna me sweat me\nThen baby let me\nTell you, I’m not like them other girls you've been with\nCause I know you think I’m sexy\nYou wanna sex me\nRolling with Ru Spits\nWe make hits\nWhere my chips, bitch?\n\n[Verse 3: Ru Spits (Nicki Minaj)]\nI don’t know what you chasing dog\nCause I ain't got patience for (nope, nope)\nAll these dudes that be hating ya’ll\nCause money we be taking more, getting cake for sure\nOnly think about making more\nGrey Azzure, mink drag, let it scrape the floor\nDon’t be mad when I take your broad\nRock stone, can’t trace the flaw\nSo I guess in a way, you could say I was made to ball\nAct out and the K applaud\nMe and Nicki gon’ pay the cost\nYou wanna play the boss, you gon' learn how to take a loss\nOf course I’m back, kid still torch the track\nI'm getting paper like Office Max\nBranch house with the horse to match\nPink gems, and the cross attached, hit you then I toss the gat\nSo, G’s up, niggas get your B’s up\nChick act up, tell a hoe to ease up\nIn the back of the club, homie roll that weed up\nIf you wanna jump bad, a beat down’s the out come\n\n[Hook]"}], "artist": "Nicki Minaj"}