{"songs": [{"image": "https://images.genius.com/ef1a5d9441bc333a96d37c7212da57b8.500x500x1.jpg", "title": "Big Dreams", "album": "Road To Till The Casket Drops", "year": null, "lyrics": "[Intro: Pusha T]\nTill the casket drops in '09\nPlay Cloths in stores\nHappy holidays\n\n[Verse 1: Pusha T]\nIt's the reincarnation of Raekwon in an apron\nLou' Vuitton printed and coke scented\nWinding through the flow cuz it's so vintage\nNothing like these timid gimmick, prepaid rappers with no minutes\nThe real niggas live it; they mimic, they H-O-V lane it and don't pin it\nThe difference, the Blue Magic ain't in it\nWe should form a senate to govern critic opinion\nI watched them niggas throw away the pennant\nTo he who claims to be the heir, how dare Pusha nay-say it\nThem niggas hear me and they mayday it\nSo I could care less if Jay say it, it's too political when Jay say it!\nHe play the game, just instant replay it\nThe best duo ever\nI hangman these words together, pouring passion into every letter\nThis my letter to the better, I Masta Ace\nYou niggas standing in a master's place\nFuck out my way\n\nFuck out my way niggas\nClipse!\nTill the casket drops\n'09 man\nUh\n\n[Hook: Pusha T]\nStop searching for the e's cuz the o's is long\nNow go and put ya Play Cloths on\nStop searching for the e's cuz the o's is long\nNow go and put ya Play Cloths on\nStop searching for the e's cuz the o's is long\nI spell it how the fucks I want\nStop searching for the e's cuz the o's is long\nNow go and put ya Play Cloths on\n\n[Verse 2: Malice]\nFor all the mothers crying at the sentencing\nFinger to the judge, echoing our sentiments\nIt's in the blood, we play the street diligent\nPrepare for the flood, as written in Genesis\nWith more birds than Noah\nNo escape, trapped in the whale like Jonah\nThe SL showing I'm grown up\nPassenger side, a bitch prettier than Sho'nuff\nNo bluff, I cuff that nine milli\nI show 'em I'm a soldier, boy - I get silly\nMy pigeon flown the coop, I free Willy!\nMy cup too full, I know niggas'll kill me\nBut I don't bow, even though the crown's heavy\nTable cracks, they saying they found Wezzy\nLabel me the rock king like Presley\nBut I prefer that hard rock especially (yuugh!)\n\n[Outro: Pusha T]\nHaha\nPlay Cloths in stores man\nHappy holidays\nYou addicted to the fly, go get that shit\nShout out to my nigga Papi\nDown there in Miami\nI hear you rockin' that shit\nFly nigga shit, yeah\n[?]\nMy brother, I love you nigga\nFam-lay, uh huh"}], "artist": "Clipse"}