{"songs": [{"image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg", "year": null, "title": "Killin’ It", "album": null, "lyrics": "Xzibit\nMiscellaneous\nKillin' It\n[Tash]\nAhh, ahh\nI be killin it (why Tash?) cause I be feelin it\nI get money so no need for stealin it\nI work diligent beneath the Earth's soil\nWhere I write rhymes so fresh it's like I wrapped my styles in foil\nBut I sit at home and boil spicy rum when it's freezing\nCause I from the Likwid crew where we got drinks for every season\nMaybe that's the reason why I live high all July\nAnd the place I buy my beer is callin in for more supply\nMaybe not, maybe so, maybe yes, maybe no\nMaybe niggas got some friends that wanna battle for some dough\nIf you know somebody holla, cause I take those extra dollars\nSplit that shit with J and Swift, buy a ninety-six Impala\nAnd lace it with the deez out my own stack of cheese\nGet a extra flossy floss and toss King Tee the keys\nAnd say, 'Nigga that's yours, cause you opened up doors\nBefore Tha Liks had a deal, you had a nigga on tour\nSo God bless ya, never let this rap pressure test ya\nYou know who got your back when them other niggas sweat ya'\nSo check uno dos while I roast this coast a toast\nWhen it comes to beats and rhymes, you know who got the most\nI be killin it (killin it) killin it (killin it)\nTha Liks rock that shit that have all ya niggas feelin it\nKillin it (killin it) killin it (killin it)\nJ-Ro is up next to flow\n[J-Ro]\nDat's me\nI be killin it (killin it) when I be feelin it\nGot rum in my cup, best believe I won't be spillin it\nYo Xzibit (whattup Ro) I got to know\nDo I got that Likwid flow (oh fo' sho') well here I go\nMida, mida, down the barrel of my heater\nI torch ya, then skeet out in my Porsche two-seater\nI'm from the home of rattlesnakes and golden bears\nAnd Astro-vans with swivel chairs hoes come in pairs\nPlus, makin money's in my genes\nThat's why I got money in my jeans, I got a cravin\nMy mind craves the knowledge, my pockets crave the cash\nMy mouth craves the brew, and my Johnson craves the ass\nWho's on blast, Tha Liks baby, don't twist it\nJust rock it, got your girl's number in my change pocket\nWhat's her name Stella, if she's on me kinda hella\nVoulez-vous coucher avec moi? is what I tell her\nI get freaky like Friday, why dey, try to get loose\nWack MC's are like ?brown guts?, they have no use\nI just got off the court, where I was whoopin some cats\nIn basketball, here's a question that I have to ask y'all\nWho be killin it, is it the ladies?\nWho be killin it, is it the fellas?\nWho be killin it, is it the b-boys?\nWho be killin it, is it the gangsters?\nWho be killin it, is it the rastas?\nWho be killin it, killin it, killin it, killin it...\n[Xzibit]\nSee I be killin it, yeah, when I be feelin it\nThis is dedicated to the niggas that be stealin shit\nStraight from the bottom of my black-ass heart\nThe untamed feel no shame, on top of the game\nMr. Big Bad Insane, black John McClane\nLook listen and learn, you only get what you earn\nSo I'ma hustle like fuck regardless, watch my smoke\nGo straight for the throat, we known for rockin the boat\nIt's hard to find like the grade A shit, with no cuts\nTryin to stack like King Tut, and still bang the microphone up\nDemandin, clear lane for crash landin\nIf anything I'm guaranteed to be the Last Man Standing\nPick a number motherfucker whassup?\nThe circumstance make you shit in your pants, and we advance\nAs an avalanche of soul, and everything that shine ain't gold\nJust cause niggas got brew don't make em nickel proof\nMy record contract reads hit man for hire\nXzibit showin grace under fire\nTha Alkaholiks killin it (killin it) killin it (killin it)\n[Tash] Tha Liks rock that shit that have all y'all niggas feelin it\n[Xzibit]\nOnce again, feelin it\nKillin it (killin it) drillin it (drillin it)\nWhat, yeah, bring it live with the... yeah\nFeelin it (feelin it) killin it (killin it)\nLike this\n[Tash] Party down, party down, party down!\n[Xzibit] Bringin it live once again, yeah, cause I be killin it\n(What, stabbin it, beatin it, yeah)\n[Tash] Y'all niggas ain't heard no shit like this out the West coast\n[J-Ro] Say what, wha-what, wha-what what?\nI say what, wha-what, wha-what what? It's the likwid crew\n[Tash] We be killin it, uhh, cause we be feelin it...\n[J-Ro] Say what, say what, say what wha-what wha-what what?"}], "artist": "Xzibit"}