{"songs": [{"title": "Gonna Make You Move", "lyrics": "[Intro]\nGonna make you move\nGonna make you move\nMake you move\n\n[Verse 1]\nNow its a hot time in the old town tonight\nWith a hot rod mama throw down tonight\nCause I got time for the whole crowd's delight\nAnd when you spot my neighbors, no doubt its tight\nCause when you sit still and you need some rest\nI bet the fact is that you need it less\nYou need to rise up and you need to dress\nYou need to do something or you'll feel depressed\nSo the sun goes down and the night come on\nWalk in the nightclub and a light come on\nYou feel the work week's just a night too long\nWell, give me just a minute, I'mma write that wrong\nCause this right here with excite the throng\nHave the girlies saying, \"Baby, I like this song\"\nI'm fighting strong when I bring this groove\nAnd I'm gonna make you what?\n\n[Hook]\nGonna make you move\nGonna make you move\nGonna make you move\nGonna make you move\n\n[Verse 2]\nNow I came here just to rock for you all\nTo make you dance and make you rock till you fall\nThe place is hot, how could you not have a ball?\nAnd did you notice there's no clocks on the wall?\nThe time is now, there's no time to stall\nYou wanted to party, I do recall\nYou better get up and get off that wall\nGo ahead and dance with that baby doll\nThere you go, now you're feeling free\nYou're being the best now that you can be\nYou're shaking all insecurity\nYou can go for south, man you don't need me\nThere ain't no doubt, now we rockin', G\nIt's going throughout the whole property\nIts got to be the whole place approved\nSo now I'm gonna make you what?\n\n[Hook]\nGonna make you move\nGonna make you move\nGonna make you move\nGonna make you move\n\n[Verse 3]\nNow, I've been making people move for quite a long time\nEven when I didn't need to write a long rhyme\nPeople moving to the beat, looks like they don't mind\nIf you give the people heat, you most likely gon' shine\nI'll tell you something, baby, no doubt I'm gon' grind\nForget about the rest, I'm the best you gon' find\nA nice guy don't need to treat you all kind\nI'd rather just chill so that we can unwind\nFine, we're moving to the beat out here\nLoud enough to hear it in the street out here\nThe girlies in the place are looking sweet out here\nAnd the brother on the mic is bringing heat out here\nIt's time for y'all to take the lead out here\nI did my job, gave you what you need out here\nIndeed, out here, we can all improve\nAnd I'm gonna make you what?\n\n[Hook]\nGonna make you move\nGonna make you move\nGonna make you move\nGonna make you move\nGonna make you move\nGonna make you move\nGonna make you move\nGonna make you move\n\n[Instrumental Outro]", "album": "Relentless", "year": "2008-08-01", "image": "https://images.genius.com/08c3be4c0ddd7a7107b37d924261e3a0.500x500x1.jpg"}], "artist": "Young MC"}