{"songs": [{"lyrics": "[Intro]\nUh huh, uh huh\nRoc-a-fella y'all\nTurn my headphones up\nHip-hop y'all\nTurn my headphones up\nBe high y'all\nTurn the headphones up\n\n[Verse 1]\nJigga man huh\nBig freak y'all\nJigga man huh\nYou know what I do\nI remove your roof homie let the sun shine in\nThirty eight waist enough to keep one nine in\nReally a thirty six without the gun I'm thin\nBut when the gat is tucked I'm fat as fuck\nIgnorant bats I'm taking y'all back to day one\nNo kids but trust me I know how to raise a gun\nNiggas that think I spend my days in the sun\nWell here's the shock of your life the Glock not the mic\nHow you gonna talk about MCs on my heel\nI just copped that thing homie, the chrome wheels\nBoth arms is chunky, the sleeves on chill\nAny given time's a hundred g's in your grill\nDon't talk to me about MC's got skills\nHe's alright, but he's not real\nJay Z's that deal, I be's in the field\nLove affair for war, hug, squeeze that steel\nYou gotta flow that's cool with me\nYou gotta little dough that's cool with me\nYou gotta little car little jewelry\nBut none of y'all rappers can fool with me\nYou know the wrist's frostbit minus two degrees\nAbout as blue as the sea the way I maneuver the beat\nCan't see his eyes who could it be?\nWith that new blue Yankee on, who but me?\nYeah I blew, few million than I blew to three\nThen I skated to four, 'fore I went on tour\nCame back and it's plain\nRappers ain't rapping the same\nTheir flow they jacking my slang\nI seen the same shit happen to Kane\nThree cuts in your eyebrows trying to wild out\nThe game is mine I'll never foul out\nY'all just better hope I gracefully bow out\n\n[Instrumental Change]\n\n[Verse 2]\nYou know I'm heavy on your mind\nYou know it's annoying the fact\nThis wristband over my forearm, the Jordan of rap\nTwenty three of MCs, what y'all recording is crap\nAnd I would name names but they ain't as important to that\nYeah, yeah, Jigga man huh\nYeah yeah, I come through getting money, sitting on twenties\nHomies throwing me shade ain't shit sunny\nHot shell all that them niggas can get from me\nCocktails thrown in your living room, boom\nI'm so confrontational\nThey should have never let me out on probation yo\nI'm a hustler, accept that\nNo correctional facilities can correct that\nI took a step back I viewed myself\nSee where my head was at\nIt's where that dough is homie I gotta get that\nGotta get away some tried to head back\nThree smart niggas got left back\nSome died but left stacks\nMe I balled right, and on top of that I'm dog nice\nJigga been cold as fuck before ice\nNot before Christ, but a long time homie\n\n[Instrumental Change]\n\n[Verse 3]\nYou know me, you know me\nYeah, poppin' Chrissy\nBuck sixty through the gothic city\nI'm in the back, got my partners with me\nWho do you trust (sirens) got to get him\nOf my CDs, 'Pac, and Biggie\n'Face and Juvie, looking at her face, she cutie\nPerfectly, this perfect booty\nShe wanna hear Ma$e\nI pull up to the store in front of Sam Goody\nI hop out, I throw on my hoodie\nI don't hate, chick carried work for me from state to state\nIt's the least I could do\nOrder LL too\n\n[Interlude]\nHaha, keep that\n\n[Verse 4]\nI put the car in drive baby let's go\nThrough the traffic lights, fuck traffic at night\nWe here having the time of the life\nLittle party bullshit me off guard? not hardly full clip\nThis chicks the black barbie, my car be\nIn the robbery, p-o-r-t\nI'm a heartbeat away from deep thinking\nIt's just the clarise\nClose my eyes can you see me thinking?\nCan you see the chick panicking when she see how we drinking\nMind full of intoxicants my thoughts shadow boxing\nDemons struggling, tryna figure life's meaning\nHave I truly arrived or am I somewhere in between?\nI mean I got my niggas, got my chick that pull triggers with me\nI got my (shh) outside of the city\nI'm just coming to terms with the night they killed Biggie\nAnd I sold 5 million records damn I'm pretty\nNow one has to wonder has he lost his hunger\nBut niggas rest assured I'm even rawer than before", "title": "1999 Westwood Freestyle", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}