{"artist": "Kid Capri", "songs": [{"image": "https://images.genius.com/3ab7e648317c8fc3f7e94ef00586a381.400x400x1.jpg", "title": "Joke’s On You Jack", "year": null, "album": "The Tape", "lyrics": "(The joke's on you, Jack )\t--] L.L. Cool J\n\n(Ha-ha-ha)\n\n[ VERSE 1: Kid Capri ]\nOh you (you) started somethin new\nSorry, that is somethin that you're used to\nKeep quiet, cause Kid Capri is teachin this\nSure you think I slept, but only if\nWe can conclude this matter\nBut your last feelings will still be the same\n(The joke's on you, Jack)\nYes, it's on you, Jack\nDon't understand? Then let me explain\nHow I can get funky like this all day\nYou really didn't think that this could be done\nStep into my path, you will feel the wrath\nHow many take me out? None\n\n(The joke's on you, Jack )\n\n(Ha-ha-ha)\n\n[ VERSE 2: Kid Capri ]\nSwish (swish) Lords of Funk from the foul line\nBoom-bammin, slammin like a Alpine\nI know you hate us, but you better think ahead\nYou try to dis us - you're dead\nFor no reason at all\nYou made yourself look like a crumb\nMan, you flipped, mouthed off with the lip\nYou ended up bein Kid Capri's son\nTake your dukes, punk, show me what you got\nThen maybe you can fit in with the rest of the rookies\n(The joke's on you, Jack)\nYou wanna make a bet?\nThe Lords of Funk is the hip-hop bookies\n\n(The joke's on you, Jack )\n\n(Ha-ha-ha)\n\nBreak it down\n(The joke)\n(Ha-ha-ha)\n(The joke)\n(Ha-ha-ha)\n(The joke's on you, Jack )\n(Ha-ha-ha)\n\nSilver D (Silver D) take it to the breakdown\nMoney Mark, please scratch to the northbound\n( *scratching* )Okay, that's enough\nD and Mark, he's beefin, call the kid's bluff\n( *scratching* )\n\n[ VERSE 3: Kid Capri ]\nOh man, you never heard it this good\nYou wanna battle? Do you really think you should?\nYou got a crew that like to start trouble\nBut in the end they get bust like a bubble\nNow, you should get taught some manners\nCome into my party and act polite\nTalk to the cuties and dance with some honeys\nAnd don't you come here lookin for a fight\nThis is a party and not a warzone\nSo open up your eyes, then maybe you'll see\nI'm bad like Rambo, sort of like Commando\nWhat's my name? (The Kid Capri)\nMan, I'm a bone-breaker, pounder like a heavyweight\nA rap teacher, here, let me demonstrate\nBetter than ever, I'm tougher than leather\nGotta make sure Lords of Funk stay together\nTo rock violators one by one\n(Yo man, why you do that, Kid Capri?)\nCause it's fun\nStay away, close is prohibited\nGettin dissed, well, how could you live with it?\nYou're broke, you're weak, you're starvin, you're hungry\nYou're lost, you're gone, you're dissed\nYou are so mad, you're angry, you're upset, you're hurt\nAnd you're steamin and you're fumin and you're pissed\nYou're ready to rob and steal, kidnap and kill\nRape a woman with a bat\nNow let me make sure that you understand\n(The joke's on you, Jack)\nHah, the joke's on you, Jack\n\n(The joke's on you, Jack )\n\n(Ha-ha-ha)\n\nMan..\nYou!\n\nHey, the joke's on you, Jack\nHa-ha-ha-ha!\nCome on"}]}