{"artist": "Cappadonna", "songs": [{"title": "Broken Glass", "album": "The Struggle", "year": "2003-10-23", "image": "https://images.genius.com/f7a7e9bd3d16cfdfd266ae989d07c7b8.500x500x1.jpg", "lyrics": "[Intro: Cappadonna]\nShake 'em... post up.. (move... yeah)\nHold that nigga..\n\n[Verse 1: Cappadonna]\nIt's like a snake bites the flesh, I damage and leave the poison\nRuckus in the Square, it's me who brought the noise in\nThe vocab killa, usin' my words like matches\nSettin' fire to the jam like Backdraft & Hellfire\nLatches, start to unlock when I rock\nYou with the ready rock, hip hop feels the block\nYou can't stop, bouncin' and movin'\nCuz I walk these dogs like I'm righteous\nBuildin' in the cypher with twelve Gods\nPeople from all over flood the street like cars\nTo hear the drama, who's that spectucular rhymer?\nIt's me: C-A-P-P-A, D, double E\nCappadon' brings the shit from cross the sea\nWith the laid back style that pump inside the Porsche\nIf this was the Olympics, I be holdin' the torch\nWith the phat golden 'dallion hangin' down from my neck\nWe the slang prostitution get the dookie respect\n\n[Interlude: Cappadonna]\nYeah, talkin' bout, get that money up\nBirth of Don'... what up Rae? What up Ghost?\nLook at this..\n\n[Verse 2: Cappadonna]\nI'm a lyrical arson, my technique is awesome\nVerbal murderer darts and suttle the beat metamorphis\nStep into my office, I torch this, for chips I cost this\nMore hits, no water hits, unrecord this\nI swing a sword quick, original Don' for hire\nI attack microphones and set 'em on fire\nWelcome to my environment of ill vocal attire\nPass the wire, it's the twelve o'clock rock\nThat makes the hip hop beats, dart armanilla\nStraight Killa Hilla, ol' school joints and Miller\nBaggy jeans, the gun-gums vest in the dumb-dumbs\nCome on my team pick corns and we rump-a-pump-pump\nCoins, and we dumb-dumbs be Donna Goines and my niggas\nNo feds, easy on the pictures (come on now)\nWatch everything and search those bitches\n\n[Outro: Cappadonna]\nSee you, word up\nWe don't get no prop-love\nRump-a-pump-pump-pump\nCome on, can I say it?\nPass the tape, get the fuck up\nWhat, what, Homicide, S.I\nWhat, baby? The hustle... come on\nSurrender! Move, haha, grab 'em, what's really good?\nYou fuckin' faggots!\nI tried to tell ya niggas, we won't be opressed no more..\nWe ain't takin' it, nigga, this shit is real!\nThis album right here is called \"The Struggle\"\nDon't forget! It's my fuckin' word..\n2003, slash, Code:Red, nigga! *three gun shots*"}]}