{"songs": [{"album": "Braille", "year": null, "title": "Play My Song", "image": "https://images.genius.com/6014fd37d6c92cafb49c7530025244ca.1000x1000x1.jpg", "lyrics": "[Verse 1 – Flame]\nHey Mr. DJ, come and holler at your boy\nPut me on replay, I got bars that won’t destroy\nSee I got bars that make sense, and I got truth that sets free\nAnd I got beats that go hard, and their not playing don’t make sense to me\nSince I ain’t rappin’ about poppin’ mollies, tryna get spins like boxing Ali\nIn his prime, but I got the dolly, I’m lifting up the K-I-N-G\n“They don’t play yo song?” I’m like, “not probably”; boxing me out, I’m like Yali\nUnless I’m rapping that nonsense, or conscious rapping – Talib Kweli\nA-I-N-T that conduit, I’m the emcee with the kind of rap\nWhere the far-reaching, where Ghana at, Uganda at, Botswana at\nBy the God in the flesh incarnate, perfect life that they hear and hate\nCrucified, resurrected, the kind of rap with them kind of facts\n\n[Chorus – Flame]\nThey cut on the radio, they say they can’t find me\nThey cut on the video, they say they can’t find me\nDJ, play my song\nDJ, play my song\nDJ, play my song\nDJ, play my song\n(Repeat)\n\n[Verse 2 – Json]\nYeah, got the truth packed into them lines, boy\nGod just fixed our broken lives, boy\nHomeboy, you know what we do\nTell the DJ go’n and spin me truth\nEvery station playin’ these same songs, I’m tired of hearing dudes grind and shinin’\nSelling drugs to these minors, ‘cause all I hear is dope lines, I promise\nKush this, pack that, spin this, wrapped up\nIce this, ride that, that’s all that they rap about\nWe act out what we rap ‘bout, no max out on that crack route\n‘Cause with Christ back it’s Beyoncé – Super Bowl blackout\nCan we hear a song that raise the cross in it? No gun bars and all the floss in it?\nWith the Lord in it, but it go hard and it’s authentic? Tell the DJ that he knew he been avoiding it\n\n[Chorus – Flame]\nThey cut on the radio, they say they can’t find me\nThey cut on the video, they say they can’t find me\nDJ, play my song\nDJ, play my song\nDJ, play my song\nDJ, play my song\n(Repeat)"}], "artist": "Json"}