{"songs": [{"title": "Ain’t No Tellin’", "album": null, "year": "2019-06-11", "image": "https://images.genius.com/484bd8d058e932651c1c91ab6c5f9ddb.1000x1000x1.jpg", "lyrics": "[Intro: Lil Jon, Mac Dre]\nYeah, what's up?\nLil' Jon and my muthafuckin' nigga\nMac muthafuckin' Dre\nLet's go\nIt's been a minute since they heard you, Dre\nCheck this out\nFinna get to some pimp playa shit on they punk asses, though\nYou know?\nSpit that shit, though\nLet's go\n\n[Chorus: Mac Dre]\nAin't no tellin', no tellin', no tellin' what a bitch'll do\nAin't no tellin', no tellin', no t-no tellin' what a bitch'll do\nAin't no tellin', no tellin', no tellin' what a bitch'll do\nAin't no tellin', no tellin', no t-no tellin' what a bitch'll do\n\n[Verse 1: Lil Jon]\nWhole lotta A shit, whole lotta Bay shit\nIf you ain't gettin' hyphy in this bitch then you're basic\nAin't no tellin' what she did, she ain't say shit\nI'm on that gas, on mama, got me higher than a spaceship\nI got hella hoes and they all gettin' swooped (They all go)\nShe get me, got it mean in the coupe (Coupe)\nGettin' to that new Lil' Jon, Mac Dre shit\nGettin' stupid, dumb, nigga, extra lit\nShe gon' pop that ass, shawty extra thick\nAnd I'ma pop my collar 'cause I'm extra lit\nBring the bottles, do a split and get some extra tips\nAnd if the boppers outta pocket we got extra chicks\nWe on stage (Stage), perkin' on stage (Stage)\nI got two girls and they goin' both ways (Both ways)\nAsked her where she from, she said \"Boy, I'm from the Bay\" (From the Bay)\nWho her favorite rapper? She said, \"Nigga, Mac Dre\" (Mac Dre)\n\n[Chorus: Mac Dre]\nAin't no tellin', no tellin', no tellin' what a bitch'll do\nAin't no tellin', no tellin', no t-no tellin' what a bitch'll do\nAin't no tellin', no tellin', no tellin' what a bitch'll do\nAin't no tellin', no tellin', no t-no tellin' what a bitch'll do\n\n[Verse 2: Mac Dre]\nMac named Dre is a big fool, sick fool\nAnd if you ain’t down then suck my dick, fool\nI don’t give a fuck about a nigga or bitch, too\nI run with a big crew, and yeah, they sick, too\nAs I get to bustin' this introduction\nOf mind corruption and rhyme seduction\nI spill and fill brains with game and mo' thangs\nLike them dope thangs and what that ho brang\nCreep on Crest streets, speak on fresh beats\nHit the motel, and freak on fresh sheets\nAnd wet sheets, is the end result\nBeen killin' on cock since ten years old\nSee I blend this old game with this new\nAnd ain't no telling what a bitch'll do\nNow picture you in my position\nSteady getting sweated by the opposition\nCould you handle all this scandal\nAnd keep on steppin' like boots and sandals?\nMy handle, is young Mac Dre\nSilky Slim, is my A.K.A. (Ugh)\nAnd you know that Bay is my Rompin' grounds\nI mean stompin' grounds, but I like the way Rompin' sounds\nSo I'ma keep it Romp-related\nAnd if it ain't down with the Romp, I hate it\n\n[Chorus: Mac Dre]\nAin't no tellin', no tellin', no tellin' what a bitch'll do\nAin't no tellin', no tellin', no t-no tellin' what a bitch'll do\nAin't no tellin', no tellin', no tellin' what a bitch'll do\nAin't no tellin', no tellin', no t-no tellin' what a bitch'll do"}], "artist": "Lil Jon"}