{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "Blowout", "album": "The Chalice", "lyrics": "Billy woods ft. Priviledge - “Blowout”\n[Emcee(s): billy woods and Priviledge]\n[Producer(s): 007 (AKA Bond)]\n\n[Verse 1: billy woods]\nHail Marys get tossed.  Playmakers on one knee\nGenuflect an inverted cross.  Looks like\nYou lost, boss.  That’s how the cookie crumbles\nWelcome to the jungle.  Crush rappers\nRecover the fumble (First down!).  The way\nI play, ain’t no out-of-bounds.  Keep swinging\n‘Til you stay on the ground.  Keep a Pound like the\nCleveland Browns.  Baltimore when I’m out of town\nTwist up when I touch down.  Rhyme\nCannon never out of rounds.  Win, lose, or\nDraw, close with raw cigar.  Every-\n-body by the ball, lift the glass for these I-95\nAll-Stars.  Been doing it since sax\nIn backyards, juking squad cars on boulevards\nStiff-arming security guards in Juilliard\nLook at the motherfucking scoreboard\n\n[Bridge: Priviledge]\nLook at the motherfucking scoreboard\n\n[Verse 2: Priviledge]\nPriviledge on the mic, massive yard, flash gas\nFaggots need to quit rapping, take a step\nWhen shit happens like gats, you’re wrapped in an ill faction\nThinking you can still master top mics, shows rock\nTight flows.  God guys grown, you the deacon, I’m the\nPastor, rhyme disaster, spit a mind-mes-\n-merizing, spine-tingling, bursting at\nDisperse.  When the word’s worth less than your life, murk\nCrushed is what you get when you cook with the crockpot\nI mean, the pot cooking, grub-robbing all hotspots\nOn fan shows, we dove, freak hoes need clothes\nAss out the steeple, preaching math to the people from\nPhilly to Indonesia.  Dawg, I see you when I see you like\nMartin told Gina.  Started off in the arena.  If you\nWant to get down with this evil, be either crushing\nMeters in the measure, plus I heard you’re living single like\n[?], spit your facts.  Plus, I keep\nThe meters intact while I’m on stage rhyming, sound\nBleeding through your speakers like a hemophiliac, slice\nLeaking on the sneakers.  For all these cats who wanna\nScream on receivers, start it off if you\nWanna harness the prowess.  Smack\nEmcees like baby powder (Uh, uh)\nIt’s the ladies hour (You nah’mean?).  Come\nReceive my baby showers (What?  Yeah)\n\n[Verse 3: billy woods]\nVictory slid through my hands.  Back on\nThe run like the Taliban, brass bands\nDirty Dozen, village of the damned hatching\nPlans.  Fuck Afghanistan.  Colt\nTwo’ll be on 125 with an M1 Garand\nKickstand Cannondale, Uncle Sam\nDrawing lines in the sand with Iran.  I got a bird\nIn the hand—the fuck I need two grams?\nA Bush, shove comes to push, shove comes to\nPush.  When they came for the jewels, you said\nNothing.  When they came for the Muslims too\nYou said nothing, so don’t call my crew when it’s\nYour spot they’re rushing"}], "artist": "​billy woods"}