{"artist": "The Game", "songs": [{"title": "Basic Bitch", "album": "The R.E.D. Album", "year": "2011-08-23", "image": "https://images.genius.com/5f5301fa46a1afd76d0d034e80d23434.1000x1000x1.jpg", "lyrics": "[Verse 1]\nAll you bitches is Nicki Minaj's sons\nSo get her a trash bag so she can pick up a one\nShe bend down, I see her tracks\nI make it rain, she throw it back\nAnd all this money keep me in pussy, no cat\nStacks, but I got racks on racks on racks\nPool side at the W, take a puff and relax\nThis that millionaire lifestyle, audemar iced out\nOrder more spades then, hit her with that lifestyle\nBut these fake hoes won't leave me alone\nFake bag, fake ass, and she beggin' for patron\nMy credit Meagan Good, my money Nia Long\nAnd them heels you got on, pound sign\n\n[Hook]\nBasic bitch\nI gotta bitch with me, she gotta bitch with her\nAnd I ain't talkin' bout no basic bitch\nBeyoncé, laced front on\nWho you trying to front on, and stunt on?\nBasic bitch, she gotta fake Louie\nFake loobies, fake booty\nSo she a basic bitch\nAt the club all weekend, she trying to get rich\nBut all I got is this dick for a basic bitch\n\n[Verse 2]\nSo knock it off with your knock-off\nYou give head to any nigga riding with his top off\nYou the type I'd knock off, forget I ever met you\nBlock you on Twitter, never BBM or text you\nLookin' for the next you, I just wanted to sex you\nHit you on the D-Low, I'm Cee Lo, F You\nCause everytime I'm up in the club looking for hoes\nEverything look good off a couple bottles of rose\nDownloading your swag, Starting off with your toes\nAnd paintin' a mental picture of you without all your clothes\nHave you ever fucked a millionaire in the back of a Rolls rose?\nWith Amber Rose? I ain't talking 'bout no\n\n[Hook]\n\n[Verse 3]\nI can tell by your avatar, you never had caviar\nYour friends can't go, you can't go, you don't have a car\nBut that weave hanging down to your ass\nBitch ain't from Dallas, but she routing for the Mav's\nYou a bandwagon ho fo sho'\nYou up in every video takin' off your clothes\nI thought I told you that you wouldn't get far\nMelyssa Ford tears, seen her, her child's mad, that Honda Accord is\n2012 Range, now look how times change\nYou bitches'll never get a ring, LeBron James\nCause I got all the game, used to move Daddy the King\nGettin' dirty money with my lil'\n\n[Hook]"}]}