{"artist": "Waka Flocka Flame", "songs": [{"year": "2012-09-13", "lyrics": "[Intro]\nI be like, I be like\nWe be flexing with the check, grindin'\n\n[Hook: Waka Flocka Flame]\n24 hours, still blowing strong\nI want the money and the power bitch I been in my zone\nBitch I been in my zone, hater leave me 'lone\nI get money by myself you know kush is my cologne (x2)\n\n[Verse 1]\nI play Sosa you Montana, you niggas not my type\nI'm a get money nigga shawty all my bitches dyke\nI know your background boy you ain’t really right\nFlexing like you chirping you ain't never sell that white\nMC Gusto ass rapper  shawty you ain’t 'bout that life\n24 hours, that’s all a nigga need to get the money and the power\nBitches on my dick, I’m from Clayton County, Georgia\nGrew up selling ??\nEverybody head-busting, plotting on a lick\nFor let you out of cast serve your ass a dummy brick\nThese hoes ain't nothing and these the bitches ain’t shit\nThey fucking for some red bottoms and an outfit\n\n[Hook]\n\n[Verse 2]\nI be doggin' these hoes I’ll pass ‘em to my bruh\nChaz off the chain he don’t fuck with no lame\nStay to myself cause these niggas always change\nKicked them out the clique now we screaming out they changed\n24 year old nigga I can never scream your name\nShout out to some real niggas from the damn belaine\nThem boys say they’re robbing we on the same thang\nMy young boys crazy they'll bust your brain\nWaka Flocka Flame you can call me Ric Flair\nI'm rocking five chains and I'm lit up like a flair\nMy dogs selling dope where he sleep he don’t care\nI want the money and the power the rest don’t care\n\n[Hook]\n\n[Verse 3: S.O.N.Y.]\nWait, hold up. Can I come down? I’m too high\nShop out of your price range, fuck nigga I’m too fly\nAy'body like who that? Is some nigga that new got\nTake your bitch and I break your bitch\nYea I make your bitch say \"Oh my god.\"\nYou soft nigga, I peep that\nYou pussy nigga, I eat that\nMy roof gone, my seat back\nThat change nigga just keep that\nI’m just getting this cake bro\nThese other nigga be fake though\nBrought your nigga from N.Y. but I’m riding around through Clay-Co\nYou don’t know me so fall back\nYou try to fly get shot nigga\nFuck telling me keep it cool\nI told your ass I’m hot nigga\nAll these nigga be rap beefing\nFuck niggas ain’t g though\nPull up on you let it go\nI hit the gas and I speed up", "image": "https://images.genius.com/71fc1c76d09b0094fc67661f5b94b689.612x612x1.jpg", "album": "Salute Me Or Shoot Me 4", "title": "24 Hour"}]}