{"artist": "YG", "songs": [{"image": "https://images.genius.com/13e0c11c5b46547c8ec3c9f0a44c643e.1000x1000x1.jpg", "year": "2019-05-29", "album": "4REAL 4REAL", "lyrics": "[Intro]\nMustard on the beat, ho\n\n[Chorus]\nI'm that nigga, that motherfucking nigga, nigga\nI'm that nigga, that motherfucking nigga\nMy bitch that bitch, she that motherfucking bitch\nShe got her own shit, natural, pretty, slim thick\nI'm that nigga, that motherfucking nigga, nigga\nI'm that nigga, that motherfucking nigga\nMy bitch that bitch, she that motherfucking bitch\nShe got her own shit, natural, pretty, slim thick\n\n[Verse 1]\nYou madder than a bitch 'cause a nigga glowed up\nI'm in a 'Ventador, this is not a Lambo truck\nI ain't the only one lit, my whole clique run it up\nYou want a G for free? For free? What the fuck? (What the fuck?)\n\n[Interlude]\nI'm tired of these broke ass niggas standin' at the table\nThey wanna pull up and fuck with the bitches, but they ain't buying no bottles\nNigga, buy some motherfucking bottles, you broke-ass nigga\n\n[Verse 2]\nI can't stand a broke nigga, I can't stand a broke bitch\nFive bands, ain't all-ones, I just threw a whole fit\nI'ma whole boss nigga, I keep me a boss bitch\nI write it down on paper, then I check it off the list\nAll day, I'm running plays, running plays, I'm running plays\nAin't got time to clean the house, bitch, I got a maid\nI came to make a movie, lil' bitch, I think I'm Blade\nI'm a movie star, tell the promoter I need a raise\nI don't talk in circles, no, this not a maze\nI just fucked a bad bitch, ooh, I'm in a daze\nNo, I'm not a water boy, nigga, I'm in the game\nPut some money on your head, twenty piece, chump change\nNigga\n\n[Interlude]\nHell nah, hell nah, nigga, move the fuck out the motherfucking way\nI'm tryna get to the niggas with the bag, I'm tryna get flewed out\nAnd not like that, but you look like you ain't flyin' out shit, nigga\n\n[Verse 3]\nPull up in a drop top, Uber, they ain't even hot\nShe was a good girl, but I turned her to a thot\nRight pocket is a knot, left pocket hold a Glock\nYou can be the next 50, nigga, take these nine shots\nYou always got somethin' bad to say, you a hater\nYou niggas penny pinching, man, I'm itching for that paper\nI want a big crib, glass floors, elevator\nI like that in-house pussy like Flava Flava\nYou in that baby mama Benz, that is not a stunt\nYou swear you doing somethin', man, your head is corrupt\nGet you a nigga like me, bitch, I'm what's up\nI just had to take her to brunch, she let me fuck\n\n[Interlude]\nYou talkin' like you got the motherfucking check, but is you cuttin' it?\nNigga, that's your motherfucking homeboy's section, nigga\nTalkin' all that shit with a G-Shock on\nGot your phone out, recordin' like a bitch, nigga, put your phone down\n\n[Verse 4]\nCame through with a hunnid niggas with me, I'm a leader\nIf he say he about to shoot the shit up, you better believe him\nI'm a dog, I'm a lion, I'm a fucking hyena\nGot it out the mud, you can't get dirty 'cause you a diva\nLil' Boosie in the speaker, so you know I don't give no fucks\nYG hit your bitch, I really hit it, wasn't luck\nThe war cost money, nigga, get your dollars up\nI'm buyin' handguns, choppers and bulletproof trucks\nStill standin' ten years plus, I really do this\nPull your hair, hit it from the back, I really do this\nDiamonds dancing, got these bitches jumpin' to conclusions\n\"YG ain't got a bag\", Bitch, is you stupid?\n\n[Interlude]\nWhat kinda car you drivin', nigga?\nWhat kinda bitches is you fucking?\nI'm a top notch bitch and I like top notch shit\nYou better get your bag together, lil' nigga", "title": "Bottle Service"}]}