{"artist": "Andy Mineo", "songs": [{"title": "Bitter", "album": "Heroes for Sale", "year": "2013-04-16", "image": "https://images.rapgenius.com/8a55cc8338a6cac2eace527876aa91d0.540x540x1.jpg", "lyrics": "[Intro]\nYou didn't know I was proud of you up there singing, huh?\nYou don't want your father to see you?\nHuh, C-Lite?\nCome on, man\nYou're supposed to call me! What's the matter with you, huh?\nYou don't like me no more?\nYou tell Mark you're here, but you don't call your dad\nAlright, give your dad a call, bye\n\n[Hook]\nI don't wanna be bitter, bitter, bitter\nI don't wanna be bitter, bitter, bitter\nI don't wanna be bitter, bitter, bitter\nI don't wanna be bitter\nSo take it all away\n\n[Verse 1]\nAnybody know the feeling of rejection?\nFeels like you was kicked in your midsection\nWhen you feel like you simply just lost your best friend\nEverybody play the game of love, you 'bout to bench and\nYou start thinking she's chillin' with other men, and you gettin' jealous\nStart beefing, and harboring harsh resentment\nI'm asking Jesus to keep me from being bitter\nGo skeeming on Twitter, get mad and post it on my statuses\nBitterness can make a heart numb, but hope is like a star\nYou don't see it shine bright until the dark come\nSo don't just scoop the dust, remove the rug\nIf I got unforgiveness in my heart\nThen there really ain't no room for love\nPlus it's stupid cause, I've been so forgiven\nThat if I hold a grudge, I don't show He's risen,\nBut I know my sins removed since Jesus came\nWith no reason to forgive me, but He did, so I do the same\n\n[Break 1]\nSometimes things just happen in life that don't make any sense\nBut bitterness is a choice\n\n[Hook]\n\n[Verse 2]\nYea, I gotta tread softly\nDon't wanna be a hypocrite\nPlus I got some bitterness I wanna get up off me\nWhere should I start?\nWell, I feel like I'd be sorta frontin' to say\nWhen my father calls that I don't hit ignore button\nIt's probably cause we never kicked it at a younger age\nI know when he's calling but I don't have got his number saved\nI keep dodging him but I'm just being honest\nAll he wanna do is talk football and how I should play in college\nI get bitter, kinda cold like the winter\nIt's so hard for me to forgive him then I remember that I'm a sinner\nAnd Jesus forgave me and washed away my sins\nWhen I didn't deserve it then I could forgive him\nHis power in such amazing love like\nWhen Jesus forgave the ones that pinned him up on that cross\nAs he was hanging from it\nHoly Spirit, teach me to be just like the Son\nRemove the roots of bitterness\nDon't stop until your work is done\n\n[Break 2]\nGod I don't wanna be bitter, teach me to forgive\nLet me see my own sin\n\n[Hook] (x2)"}]}