{"artist": "Pimp C", "songs": [{"album": "Pimpalation", "title": "I Miss You", "image": "https://images.genius.com/3220e8a9ee54b203ec94c4ba716d6c0c.500x500x1.jpg", "lyrics": "[Pimp C] + (Tanya Herron)\nHuh!! (I miss yooouuu, I'm talkin to you baaabbbyyy)\nDedicated to everybody that lost somebody knalmtalkinbout? (I miss yoouuu)\nKnalmsayin... (I miss yooouuuu, I'm talkin to you baaabbbyyy, I miss yooouuu)\nGotta give 'em they flowers while they living knalmsayin\n'Cause ain't nothin promised, one day you here, the next day you gone\nFor real....\n\n[Pimp C]\nUhh! A lotta shit done changed, dope man since you been gone\nI did a whole lotta good, I did a lotta wrong\nI made a whole lotta change, I wrote a lotta songs\nSometimes I felt weak, most times I stood up strong\nYeah I got three kids now, Natasha had a son\nWe ain't together no more, I guess we was just too young\nTo even try to start a family in the first place\nBut I get happy every time I look into his face\nEver since you went away, man it's been hard for me\nDidn't know 'til you died, how much you meant to me\nAll the time and the patience you put into me\nYou showed me how to be the man that I was meant to be\nTaught me how to play music and 'bout the melody\nAnd to this day, I remember what you was tellin me\nYou told me, \"Son, most of this rap shit is just noise\"\n\"But if you put some music in it, you'll get rich boy\"\nThat's why I stay up in the studio, up all night\nI fuck with live musicians to get the groove right\nYeah I'ma rap star now, yeah you could say that\n'Cause now my walls is filled with gold and grey plaques\nDoin shows and videos and makin big stacks\nBut if it would bring you back.. I would trade all that\nI wanna thank ya for everything that you did for me\nI'm on my knees praying to God that you hearing me\n\n[Chorus: Tanya Herron]\n(Oooohhh yeeaahhh) I miss yooouuu, I'm talkin to you baaabbbyyy\nI miss yooouuu (you know that I miss, I'm missing you)\nI miss yooouuu (ooohhhh), I'm talkin to you baaabbbyyy\nI miss yooouuu {*harmonizing*}\n\n[Pimp C]\nI know you watch me up there and it's gettin hard for me\nWhen you get a chance, put a good word into the Lord for me\nI been got caught up, got sent to the pen\nI let ya down, I'm in a place I know you never thought you see me in\nBut all these things is happening for a reason\nI guess God saved my life and put me up to see another season\nAnd all my so-called friends don't even write to me\nThey don't go check on my momma, don't send no price to me\nI'm tryna raise my kids from a penitentiary\nStayin on my knees, praying they don't grow up to be like me\nDo you remember when my parents thing ain't worked out?\nYou let me and my momma come live in yo' house\nKnowin already you had too many people livin wit'cha\nYou always treated me special, I never could forget cha\nCook me breakfast and lunch and dinner everyday\nYou wiped my tears away, tried to explain why my life had to be this way\nAlways gave me the real, you never bullshit me\nI wish I woulda said thank you when you was here with me\nMy uncle miss ya and I know you know his heart is blue\nBut he ain't the only one 'cause Annie I miss you too\n\n[Chorus]\n\n[Z-Ro]\nA house is not a house if ain't nobody livin in it\nTell me why black life isn't life unless there's prison in it\nGeneral population of super cell, or Johnny or some Jack Man\nPowdered coffee, peppermint, peach cool offs, but a paint I wish I had that\nAnd even more than my freedom, I wish I had somethin else\nI would give back everything I've accomplished 'fore this one thang and nothin else\nI ain't talkin about a relationship 'cause broads bring too much drama (drama)\nI'd even pass the chance to be a millionaire if I could hug and kiss my momma (momma)\nI remember like it was yesterday, although I was six years old\n\"Momma what's wrong, wake up, wake up! Why yo' forehead hot and yo' hands so cold?\"\n\"Who all these people up in our room? Auntie tell 'em put my momma down!\"\nI didn't understand what was goin on, but it felt wrong 'cause so many people came around\nI didn't have to go to school that day (that day), and everybody was buyin me shit (buyin me shit)\nTellin me everythang was alright but they was sad and cryin and shit\nAin't that a bitch? My momma ain't never came back, I wish I could hug and kiss her\nEven though Auntie and Grandma Dorothy raised me right, I still miss her\n\n[Chorus] - 'til fade", "year": "2006-07-11"}]}