{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/2df76f5be8e481c4a5e06d60a13adbe0.662x566x1.jpg", "title": "CNN", "year": "2013-12-21", "album": "Not O.K.", "lyrics": "[Del tha Funkee Homosapien]\nNowadays the power plays make you wanna about face\nEnough to give you the sour face once you hear what the crowd say\nSee I be around the way where you can hear the sounds of today\nSome of that sound is bound to escape through the urban city whirlwind\nCall me the epitome of wordsmith, every bit as enduring\nAs your commercial favorites, save you from the surface chambers\nI'm giving birth to bangers, underground, they surface later\nFurthermore, I'm squirting flamers when I hear the words from haters\nYeah, that's words of fury when I'm on my tour of duty\nI stay calm, you're unruly, Quiet Storm, you're too moody\nPirates on the open waves, fire on the hopeless knaves\nTime moves on, I grow with age, biting down with cobra fangs\nEyes wide open, I know the game, divide my focus, I know my lane\nTrying to ride over my flow to reign, asphixiate you like a choke chain\n\n[Sample]\nSet me free\nSet me free\nSet me free\nSet me free\n\n[Ladybug Mecca]\nI'm in the core with the surreal, no ordinary feel\nDreams pass into action and mingle with Sir DZL\nIlluminate, don't fizzle, then find me in the zone\nStand alone in my duality, we taste life twice\nI see it as I am, as I like\nFeeling light and vaporous\nWordplay with A.D. and us\nKool as fuck\nAnd Coolie High\nIn the shire\nReplenish me\nI'm the source to core, you return for more\nGuidance\nThrough this delicate play\nHeadfirst in too deep\nIt's the shallow lane we avoid like creeps\n\n[Kool A.D.]\nMy raps run laps around tracks like Usain Bolt\nMichael Phelps with insane gold, I trained for it\nEasy listening pissing confetti from your car's stereo faceplate\nThere he go, vacate\nAway, way on some other necks\nFresh, the brother flex\nVagabonding in the Western world, yo\nI think I'm Phil Lynott, or was it Phil Lie-not? Sure, why not?\nI think I'm Jim Fitzpatrick in a Che Guevara t-shirt\nI'm so Anne Frank, I hit that attic with a bad bitch\nAnd hide out for about two weeks\nJust to meditate on the two cheeks\nDawg, I Federlined that [brooney?]\nWait, oops oops, I mean Britney\nMan, I'm off a deuce-deuce of that O.E\nNow she calling me like \"boo, see\"\nHa-ha, hee-hee, ha-ha, ooh-whee\nYou're [?] tooth and no speak\nKool bring the news like it's Newsweek\nY'all not... me, y'all\nToo weak\nI'm like CNN, go ask Chuck D and them\nGet the R. Kelly tape, see how we pee on them\nAll the new moves, please know that we on them, heh\nYou see my friends? Sip beers, burn trees\nKick weird words, B\nThis here, surely\nCould lift ears to worlds we could miss if\nWe did not listen properly\n\n[Sample]\n[laughing] Oh, but seriously\n\n[Sample: Q-Tip, \"Oh My God\"]\nI don't know, man\nI don't know, man\nI don't know, man\nI don't know, man\nI don't know"}]}