{"artist": "Wale", "songs": [{"title": "Body Body Body (Freestyle)", "year": "2018-05-08", "lyrics": "[Intro]\nHehehe\nHey, let's fuck around\nLook\n\n[Chorus]\nBody, body, body, body (yeah)\nI'ma need that right on me (ha)\n(Yeah, let's have some fun, ah)\nNow body, body, body, body (yeah)\nI'ma need that right on me (waddup)\n\n[Refrain]\nPick it up, she drop it low\nI pick it up, she drop it low\nI pick it up, she drop it low\nI pick it up, yeah\n\n[Chorus]\nNow, body, body, body, body\nI'ma need that right on me (look)\nNow, body, body, body, body\nI'ma need that right on me (Oh now in my bag though, yeah)\n\n[Verse 1]\nI got love for you, via cup for you\nBeat it a couple times, just having a cuff on it\nI never loved women, they outta time now\nAnd since I had a baby girl, I'm in my vibe now\nWho gon' fuck with us? One of the realest niggas\nI got a million from Nima from being independent, feel it\nFear of God, zipper on, J. Lorenzo dog, let me get like four, bruh, uh\nFolarin season, nigga stop sleepin'\nEarly morning hit a sermon, that be plot speakin'\nSweet pussy, sat days like I can't speak\nNever ever, ever kiddin', bitch I don't play\nTell these mad rappers, I'ma lead this John Blaze\nStupid ass nigga, that was a reference to Mase\nRemember the days, Harlem World, all the girls\nJealous guys still around and they in the way\n\n[Chorus]\nShawty, shawty, shawty, shawty (yeah)\nWhat these little bitches want from me?\n(Do you ain't hear me? I said, I said)\nShawty, shawty, shawty, shawty\nWhat these little bitches want from me?\nWon't give em' a goddamn thing\n\n[Verse 2]\nFlows on flows, they float, they don't miss\nBoats and hoes, my little rubber band, bitch\nCoast to coast, like John Wall and Harden\nMy dogs in Palmer Park put paws on your posse\nImpossible is nothing, I'm livin' it up\nIndian soul, and shawty look like India Love\nI'm into your love, I'm into your mind, into your vibe\nIt's in your stomach, and one day it'll get you to shine\nThe old album title\nWas so-so with the sales, but did it without a writer\nSomebody want a problem with us, better buy a bible or rifle\nAnd hire a fire ass Nascar guy to drive\nYeah, I'm on my Earnhardt shit\nWant my young niggas to earn y'all shit\nNiggas think I ain't got the word out shit\nMan, I know the little niggas that serve y'all shit\nPull up in the Ghost at the carry-out, bitch\nNiggas never know about my whereabouts, bitch\nSomewhere in Carol City, a carousel whip\nMeaning there's so many horses it's like a marathon, bitch\n\n[Chorus]\nBody, body, body, body (yeah)\nCan I get my cheek popped, please? Do it for my PYT\nI wanna love you, pretty young thing\nAnd that single still was platinum\n'Cause academically they fuck with me\nThat's why I'm struggle-free, yeah\n\n[Refrain]\nThey droppin' off, I'm pickin' up\nThey fallin' off, I'm fuckin' up\nThe fuckin' charts, they fuckin' up\n'Cause I ain't on 'em, but me and Bonnie gon' see what's up (right)\n\n[Verse 3]\nI hope my woman ain't scorned\nShe see me on that Tidal, so her entitlement gone\nI ain't findin' no wife, and that's probably 'cause of myself\nHeaven knows mental health is a detriment to my wealth, nigga\nMahershala, let me rock\nShout out to Rockville, I was out in Lincoln Park\nUp in Mark Twain with the savage\nAll my friends crazy, my bitches was the baddest\nIceberg shit, you thought it was one of the brothers\nShit ain't been the same, since I signed to Warner Brother\nDouble up the hate, all the shade, all the money\nI'm tryna find a way to order Momma a little daughter\nShoutout to Baltimore, you ain't know it's like a war\nYoung niggas dyin', they tryna weather the storm\nThe Chi niggas shovelin' snow to weather the storm\nAnd Chi niggas dyin' (no, no, but it go like)\n\n[Chorus]\nBody, body, bodies, bodies\nAnother black man dead in the street (hey, hey, look)\nBodies, bodies, bodies, bodies\nThey just don't like my people (black lives still matter to me)\nOne time\n\n[Outro]\nThey droppin' off, I'm pickin' up\nThey droppin' off, I'm pickin' up\nThey droppin' off, I'm pickin' up (hey)\nNow, body, body, bodies, bodies, what is...", "album": "Self Promotion - EP", "image": "https://images.genius.com/55e33e28cddf467b1bc875153cde6fdb.630x630x1.jpg"}]}