{"artist": "King Los", "songs": [{"image": "https://images.genius.com/916a912809348b0dcc67ff098d44c1fa.500x500x1.jpg", "title": "Boom Boom", "year": null, "album": "Welcome To Swaggsville", "lyrics": "Ok I roll up on a rapper and I smoke em' like Swisher\nLeave me with your bitch & I'm gonna stroke her like I'm Fisher\nLet her the ride wheel, ill send you her back to you in splinters\nPincher, cut her off like Sprint\nAfter that I'm running to the money like a sprinter\nI dont know want your honey cause she dont give me any dentures\nI lash out & put her ass out in the winter\nIm bias because I'm a buyer & your a renter\nDamn, niggas still don't get the picture\nIm significant because im Signature\nYou better look me up & read some literature\nAbout me, Doubt me?, How D You?\n.....? see you\nCan't see me, but I see you\nWhy be you?, When I be you, I shit that you can't get, because I be too fly\nSwagger be too high, Daiquiri Coupe ride, Whip cream seats, Whip cream seats\nGot a girl named Cherry, met her on a Monday\nSaid she got girl, named sprinkles & one day\nWe could all hook up, have a little fun day\nCall a nigga up & we did it on a Sunday\nMonday, Tuesday & Wednesday\nI got the old school sittin' on them Lindsay\nLohan's and you better believe it\nThe tires so skinny, that they look they Bulimic\nYou say that your ill, but when I'm in the building ya'll niggas dont seem sick\nBet I fucked this shit up, I mean cut this bitch up just like a Seamstress\nOr OJ with a knife, Say guys who the best rapper a-live?\nThey lied, They ain't nowhere near me\nIm a Monster, Monsters dont scare me\nSeri-al Killer, Stere-o Murderer, Scenari-o changer\nDanger, Everything I spit comes from the pain\nI, feel nigga, thats real nigga\nPut this on the list, with the shit that I Ripped\n& I kill nigga, You ill nigga?\nDamn Los, you still ain't got any deal nigga?\nI guess these A&R's is lazy\nNobody say bars is crazy\nMaybe they too busy applauding Jay-Z for killing the Auto-Tune\nI rebuild with all the gloom\nMaybe he'll look up & see that I'm illest artist soon\nI feel the hardest, im still the smartest, I'm still the dopest\nIf I feel it, wrote it, I kill it, Smoke it nigga, I'm focused\nIf I ain't better than Jay, than I'm the closest\nHow the whole world don't know who Los is?\nLook, I said Louis sneakers, Fly Jeans & a fucking nice Shirt\nRest In Peace to this beat, I killed it boy this light work"}]}