{"artist": "E-40", "songs": [{"title": "7 Much", "image": "https://images.genius.com/3351b3d2fd23556c86b023d292cf44cc.1000x1000x1.jpg", "album": "Grit & Grind", "year": "2002-07-09", "lyrics": "[Hook: Kokane]\nDoin too much (too much), seven much (too much)\nDon't you know that I'm the one\nYou can't get nothin over on me\nDoin too much (too much), way too much (too much)\nYou doin too much - I'm the one\n\n[E-40]\nI see you over there peepin a player out from hella far away\nTryin to get with some of this here mackin\nApparently you ain't tryin hard enough cause if you was\nYou woulda been made your way over here to the V.I.P. with us\nWhere yo' man at? What's the matter with that clown\nLeavin a sharp-ass lil' broad like you up in here with all us players?\nHopefully you up in here with some of yo' friends, so some of my friends\nCan get with some of yo' friends and turn it into somethin\nI'm - fin' to walk over here to the bar and get the bartender\nTo mix me one of my customized drinks without the blender\nGet everybody up in the club up in here off the numb-numb juice\nVodka, 7-Up, and cran-apple juice (eww)\nThe ladies outnumber the fellas six-to-one\nAnd me and my fellas up in here like good one pimp, we all won\nThe pretty ones in here are hot like a dog in heat\nTouchin they toes, backin it up, and dancin like a freak\n\n[Hook]\n\n[E-40]\nMAN! I'm over here on super-purp' (super-purp')\nUp in the club hollerin at somebody else's work\nYeah pimpin I'm up on all the slang that you make up\nBut I believe you stay about your marbles and be about your bacon\nYouse a player about yours and I'm sensin and smellin\nThat youse one of them sharp-ass lil' sisters huh?\nMight even want you to be my baby, maybe ma\nSpeakin upon my baby ma, here she comes\nAnd she hoodrat, hoodrat, hoochie momma\nSame ol', same ol', dry-ass drama (drama)\nComin up in my face about the, child support\nTalkin about, takin me to court (to court)\n\n[Kokane]\nEww eww eww, takin me to court, can't work me\nMost of these hoes be mo' full of shit than a Christmas turkey\n\n[Hook]\n\n[E-40]\nWell alright ho\nBoss mo', player hater hater my noggin\nD-Boy, people swear up and down I'm a rocker\nBut I'm a soil block turf hog built for battle\n15's in the trunk, like a snake they rattle\nLeave skid marks all on the gravel\nDrivin like a bat outta hell to the hotel\nBounce roll rock skate side to side\nBaby got the gin and the Astroglade (and the Astroglade)\nI hopin that the jimmy don't bust\nWhile I thrust much cush gush knock boots with lust\nSwish swush loose nuts drop juice drip stuff\nOne two three fo' five six seven much!\n\n[Hook]\n\n[Kokane]\nBaby baby baby baby you doin too much (and all the fellas say)\nAh la la la la, la la (and all the ladies say)\nOhh la la la la, la la (and all the fellas say)\nOhh la la la la, la la (and all the ladies say)\nOhh la la la la, la la (and all the fellas say)\nOhh la la la la, la la (and all the ladies say)\n{*fades out*}"}]}