{"songs": [{"album": null, "year": "2013-06-17", "title": "Funkmaster Flex Freestyle (Part 1)", "image": "https://images.genius.com/e4cf26a0c85c9d4ef26ff299a3a40694.500x500x1.png", "lyrics": "[Intro: Funkmaster Flex]\nWe out here moving, J. Cole is here\nThis has happened before\nWhen the mics are set up like this\nYou know something's gonna happen\n\n[Break: J. Cole]\nIs it on me?\nIs it on me?\nHmmmmm, hmmmmmm\nHmmmm, hmmmm\nNYC, Cole World\n\n[Verse 1: J.Cole]\nLook, they say I'm something like a teacher\nI guess they right, I'm with your bitch on her\nHow to play FIFA, kick game Messi\nSwitch lanes while I get brains, bet me\nI don't whiff stain anything these pricks aim at me\nI am hater proof, the straight up truth\nWent and got my weight up God\nNow I'm straight-up Zeus\nSilly little rappers rhyming 'bout their made-up coupes\nThat you ain't ever gonna drive, jets you will never step inside\nSo just step aside, rather look up at the sky\nDon't you see this middle finger from my big ol' G5, I\nChartered planes, ballin' blowin' money fast though it's all in vain\nYou only live once, so fuck the cops\nWho'd rather see us all in ball-and-chains\nMy aim is to stretch my name in your Hall of Fame\nNext to Elvis, paint a vivid picture of where hell is\nAnd crawled out, heart froze and it never thawed out\nSo I balled out, with my balls out\nScreamin' live for the moment, make sense don't it\nMy mama need a crib I'm gon' cop it and she'll own it\nWe gon' toast to the days when they foreclose our shit\nNow we livin' better thanks to the flows I spit\nAnd I'll make sure she paid like she wrote my shit\nThat's a Wayne line, no time to count this dough I get\nAll this gear I don't wear, I need four closets (damn)\nGo figure, my pockets got bigger\nNow all those I don't fuck with say \"That's my nigga\"\n\"That's my nigga\"\n\n[Interlude: Funkmaster Flex]\nYou see us, baby\nFunk Flex, J. Cole\nWho you mad at, me or yourself\n\n[Verse 2: J.Cole]\nLook\nThey give props to the others but them niggas ain't help\nTake a look around, girl I built this shit up myself\nAt a time when niggas cry 'bout how they sit on the shelf\nI gave the world 2 classics to put on my belt\nWay before \"Work Out\" I did them sit-ups myself\nToo many hands in my pockets, niggas hit at my wealth\nI gotta, re-maneuver these deals, they need improving drastically\nCause homie if you asking me\nI'm supposed to be the richest nigga since Master P\nIf not, at least half, my nigga at least half\nAfraid of 30, still looking twenty, like he's Fab\nSubtle shit, throwing these jabs like he's Zab\nI seen, Mac Miller, that nigga got mad millers\nThe rap Brad Miller and even a tad iller\nYou see me, salute me, it's crazy the way they do me\nYou would feel me if you niggas knew me, let's make a movie\nOut this shit, cause these hoes getting choosy out this bitch\nPlaying \"Juicy\" in jacuzzis, getting woozy I could sip\nChampagne and hopefully forget the whole damn thing\nWe pullin' hoes like a ol' hamstring\nCole so damn mean, and high as fuck nigga no landing\nLong as I'm alive, no man king\nAnd nigga that was the hook\n\n[Interlude: Funkmaster Flex]\nHOT 97, baby!!!\n\n[Verse 3: J.Cole]\nLook\nThis music's my weapon so anyone that's interrupting\nGet a Colin Kaepernick bullet straight to the chest\nTryna make an impression, so if I aim to the left\nAnd you can't make the reception, ya man'll catch a great interception\nI'm nice nigga, could've dropped the album like twice nigga\nSo nigga fuck your advice nigga\nStarted off friendly, now all these niggas my enemies\nWhat could you say to offend me?\n\n[Break: J. Cole]\nI could go forever, Flex, I could go forever\nBorn Sinner, TOMORROW, June 18th\nI could go on forever"}], "artist": "J. Cole"}