{"songs": [{"title": "Letter to God (goldUn Child)", "image": "https://images.genius.com/246fd3cffefeef5a40c25b269d06df23.500x500x1.jpg", "lyrics": "[Verse]\nDear God if you listenin', I know you are\nYou're so far, I feel like I gotta yell to the stars\nAll of my silent prayers don't seem like they gettin' answered\nFrustration grows, it's like it's cancer of the soul\nYou told me give all my problems to you\nI can't carpool, but I got no problem followin' you\nJust gimme a sign, let me know I ain't miss my exit\nI prayed and you helped me not to miss my exes\nI prayed and you helped me not to fuck up the next shit\nShe stayed and I thank you for that shit, God knows\nWell, you know that I'd be lost without her\nIt's bad enough the music ain't turn out to be what it was\nIn my eyes, just two years ago, it seemed so sacred\nThe deeper I get into this, the people get faker\nI hate it, I thank you for my fans for real\nWell, if not for them, I prolly woulda' killed myself\nSo many nights I spent, cryin' in my lonesome\nHere with the same people years ago that killed your only son\nI'm livin' with them, but I'm livin' for you\nMakin' the most out of this mission I've been given to do\nEnlighten the World with my music\nAnd I think that I'm doin' it\nMessages from my listeners tellin' me to stay true to this\nTellin' me I save they life\nBut in retrospect, they be savin' mine\nWaitin' for my chance, I'mma stay in line\nThis frustration, won't outweigh my patience\nI got her and music, so I ain't mind waitin'\nFor short, thank You for the sun and the rain\nI learn joy, I learn pain, but you always remain\nEven when I questioned your loyalty\nYou would bring more to me\nBecoming a man, but keepin' in touch with the boy in me\nI know the future gon' be brighter than this\nAbout time I get this light bulb switch\nI swear God\nKnow the future gon' be brighter than this\nTo get this light bulb switch\nSincerely yours\n\n[Outro]\nAlright, the thought has crossed my mind, yeah. If something should happen, yeah I'll go along with it. But if it doesn't, it's no, no thing to me because that's not what I'm out here for. I'm out here to bomb, period. That's what I started for. I didn't - I didn't start writing to go to Paris. I didn't start writing to do canvases. I started writing to bomb... destroy all lines. And that's what I'm doing\n\nHow long do you think you'll do it?\n\nTil I'm finished", "year": "2015-11-19", "album": "goldUn Child"}], "artist": "Ace Hashimoto"}