{"songs": [{"year": null, "lyrics": "Feat. Tokie Renet\nBash Intro: Smokin nude with a ultra fly attitude (repeat x4)\nTokie Intro: Boy don't be afraid, I see you lookin at me baby. Want you to come and talk to me, you know you wanna talk to me\n\nPre Chorus: We could do whateva, let mama make it betta. It's hotter over here we're not talkin bout the weather. What's on your mind cause I know what's on mine, I know what's on mine,know what's on mine...\n(oh, oh, oh, oh)\n\n[:: Chorus ::]\nCome with me and I can show ya, I got what we need to roll up, and can't wait to turn the lights off, so we can light the fire. We don't need no alize, we don't need no cocaine, if you wanna turn me on, lets get naked and smoke\n\nRap Verse: Now let me roll this up while you take your clothes off. What you undress while I get my smoke on, and yea the mood is set, and yea the candles lit. We smokin big and we ain't talkin bout no cigarettes. Im in the zone and I'm blown touchin on your flesh. Mi corazone and like that song baby you the best. Spark it up flame flash I can see your eyes your pretty flowers got your boy straight mesmerized, and you the sh*t lookin sexy when the cherries lit\n(oh, oh, oh, oh)\n\n[:: Chorus ::]\n\nVerse 2: Smokin a bowl, lovin the flame, lovin the kush whatever the name whatever the strain never the game menage et trois a tre with maryjane. Me and u one on one and i got that antidote, turn up the music touch my body baby have a toast. Break down another boulder, kiss my naked shoulder, we love the munchies room service baby place the order. The whole scenery smellin like some greenery, i love you down so cold and make you bust so easily\n(oh, oh, oh, oh)\n\n[:: Chorus ::]\nTokie Spoken: So, you know I was just thinking, that we need to get to know each other a little better... I mean I did say that we could do whatever, take off your clothes, and break this down, and ima roll up\nBash Spoken: You a boss, Girl you so cold, I love it tho", "title": "Smokin Naked", "album": "Unsung The Album", "image": "https://images.genius.com/2a44649dea5495a5f66acbff67cf86cb.600x600x1.jpg"}], "artist": "Baby Bash"}