{"songs": [{"lyrics": "[Hook]\nPower up (x32)\n\n[Verse 1]\nI hit 95, then charge\nI don't fuck with bitches that lie\nI keep bitches pissed\nMy flow underrated\nI dig bitches grave when they think they want beef\nKick the hole in, yall on me\nPut 33 shells in yo shit, stay tough on the net you lil bitch\nI stop at the store and post up with my niggas\nThey geekin' with tecs, they ready for war\nThese bitches pretenders, they wish they was hood\nI'm ghetto, I grew up off henny and chicken\nCan't never go back, finesse for a sack\nYou die if you lack so I'm never gon lack\nConsistence the key\nSo if you not humble, yo life is in danger\nI belong on a beach\nI belong in a foreign\nI belong with them bands\nSo when I get M's, split that shit with my mans\nStop talking to me, I don't give a fuck!\nLike why do these niggas be bothering me?\nMy pussy so good, these goofies they wishing they could\nBut I am no lame, I'm too cool\nDon't never say bool\nWe crippin', we crazy, my block is a fool\nPark Row been a zoo\nI do this for me, and all of my haters thats watching me close\nCould never get up\n\n[Bridge]\nThey pray that I fail\nWhy bitches be capping?\nReally ain't trapping, ain't breaking no bails\nYou living a lie, can't fuck with you wannabe's\nAsian Da Doll, taking a flight\nLet me be great\nI'm grinding from money to money\nI'm sunny, I never take breaks\nYou stay in less place\nI win every race\nI eat with my fingers like I am Jamaican\n\n[Verse 2]\nYoung bitch, whole lot of setting-trendsetter\nI'm a lil cool, gettin rich\nYou know I'm barbie to the doll\nGot bitches from Paris wanna buy all my new new shit\nThese hoes be hating\nThese hoes turned fake for the dick, that shit be so weak\nListen up close;\nNever gave a fuck\nAlways been tough\nIon gotta shoot, bitch!\nLets meet\n(Grrraah!)\n\n[Hook]\nPower up (x32)", "album": "Drippin In Glo", "year": null, "title": "Power Up", "image": "https://images.genius.com/5f07bc0ee61d34fd46035587b5f03d13.1000x1000x1.jpg"}], "artist": "Asian Da Brat"}