{"songs": [{"image": "https://images.genius.com/cfbf9bb0c16d5a7d8f2bf05b2dc70cae.500x500x1.jpg", "album": null, "title": "Election Debate Rap Battle", "lyrics": "[Intro]\nIn a bid to appeal to the younger electorates\nThe leaders of the three main parties have agreed to a fourth televised debate\nIn the form of a rap battle\nGentlemen, introduce yourselves\n\n[Verse]\nBrown: Gordon Brown, Labour Prime Minister\nMy style's like my temper, quite sinister\nCameron: I represent the Tories, my name's David Cameron\nThe chap with more flash than a cameraman\nClegg: I'm Nick Clegg, the head of the Lib Dems\nMy timing on the mic is precise as Big Ben\nBrown: Labour's done amazing things over the past ten years\nCameron: Two wars, a recession, and cash for peers\nLike I said, too many twits make a twat\nAnd too many years in power make that\nBrown: Vote for Labour\nCameron: No, vote Tory\nBrown: Labour\nCameron: Tory\nClegg: Hello! Don't ignore me!\nWhile these two are stuck in an argument\nI'm the one with real power in a hung Parliament\nTo vote Lib Dems is to vote for change\nCameron: Uh, no, it's to throw your vote away\nClegg: We're not like the other two, we don't pretend to be\nBrown: We know, you haven't even governed for a century\nClegg: There's no confidence in the encumbrance and Cameron's incompetent\nCameron: Well, you're a (bleep), Nick\nThe Tory party's all about family\nThat's why I like to drag mine out to stand with me\nBrown: Well, I'll never use my kids as props\nThat is until my approval rating drops\nClegg: Talking about my private life's forbidden\nAlthough I have slept with thirty women\nBrown: Personally, I don't like women, they're bigoted\nClegg: Uh, Gordon, your mic's still transmitting\nBrown: Flipping heck, I offer my sincerest apologies\nCameron: That gaff was a bigger cock-up than your policies\nBrown: How can you talk about democracy\nWith that spoon stuck in your mouth by the aristocracy?\nCameron: I don't approve of this\nBrown: Then get on your bike\nClegg: Can I sit in the car following behind?\nBrown: No, you're a third wheel\nCameron: Unstabilised\nClegg: Whoever wins, I'm being taken for a ride\nBrown: Right, there's only one fair way we can decide\nCome on, posh boy, step outside", "year": "2010-05-04"}], "artist": "Dan Bull"}