{"songs": [{"image": "https://assets.genius.com/images/default_cover_image.png?1570807223", "title": "5 O’Clock (BLAK Productions Remix)", "album": null, "year": null, "lyrics": "(intro)\nWhere you at? Where you at?... Yeah\n\nNow where you at, where you at? (x4)\n\n(chorus)\nIt's really real, the way I'm feelin' right now\nAt 5 o'clock in the mornin-a\nThe crack of dawn-in-a (x4)\n\n(verse 1)\nIt's really real, when I feel the way that I do right now\nI see all my brothers underground\nPushing up daisies, man, it amazes me\nThat you can't see where you gonna be\nA statistic, everybody's gon' call ballistic\nIf you had a good day, damn, I must have missed it\nCause you mad at the Universe, going to hell with everybody else\nCause you want your own first\nI got the urge to let you in on a little secret\nCause you keep dying if I keep it\nAll the killing that you're feeling is from within\nFor the copper check the color of your skin\nWhy lie? I couldn't try even if I had to\nBorn with the bullet-proof vest when I had you\nA black woman trying to get through to the few\nSo you can live the next crew\n\n(chorus)\n\n(verse 2)\nWella, Mr. Black Man tell me where you're heading\nThe last few years I watched while you were sheading\nPounds and pounds on growth for the population\nSoon we won't be able to have a strong black nation\nA shooting here, a stab there will it ever stop\nCause now you're dying from the dose of the crack rock\nI'm just a Nubian Queen that needs a king to stand strong\nAnd try to press on\nIt's not white man's finger on the trigger\nCar-jacks, drive-by's, callin' each other \"nigga\"\nI'm not here to scold but rather shape n' mold\nA young black mind that won't live to grow old\nCause you're fronting smoking on the blunt and\nDown with your friends cause you think you're making ends, but you're not\nAnd it's the truth of the matter\nYour brother gettin' skinny, cause you want your pockets fatter\n\n(chorus)\n\n(verse 3)\nIt ain't no lie, I'm sick and tired, I feel the fire\nSo baby can you grab my hand so I can take you higher\nCoz I've seen you sinkin'. so get your mind to thinkin'\nBut all of that shit you did has got you shrinkin' low\nThe moves that you made, got your faith in the wrong direction\nBut some love and affection would change that\nWith the quick-mix, could this sickness\nIs spreadin' so damn fast, a black major can't last\nBut what can I do, a strong black woman\nGive you loving and affection keep you focused when you come in\nCause it's real, I've got to find out how you feel\nTo keep your shit fixed, and your hands up on the ceil' (yeah yeah)\n\n(chorus)\n\nNow where you at?\nNow are you a criminal? (repeat)\n\nA where you at, where you at? (x4)\n\n(chorus)"}], "artist": "Nonchalant"}