{"artist": "Cam’ron", "songs": [{"title": "Dead Muthafuckas", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "\"Dead Muthafuckas\"\n[Indistict female singing sample in background]\n[Cam'Ron]\nKilla!\nJones\nWe told niggas about eight years ago\nWe had this shit in the smash right (Aight)\nThis shit too light man\n(In the building)\nI got us, Dipset\nLets go\nFreekey\n(I'm sorry I'm late, lets get it rockin')\n\n[Verse 1]\nEverybody out at the \"Rock The Mic\" tour (Word?)\nI'm back in the kitchen rocking the white raw (Right!)\nCoping your pie for\nLocking your nice doors\nI pop up in like four wit chicken that like gores\nThey click if they like war\nFixing to fight for, me\nLook at my ice for sure your sight sore (Whoa)\nWe all wearing links\nAs I prepare a drink\nGlare and think how I got the whole new york wearing pink\nGirls they stare and wink, how I flare the mink\nDrop the top\nPop a throttle\nHock a Glock\nPop a bottle (bottle)\nSeen \"Paid In Full\", now I'm up in \"Blockbuster\"(Busta!)\nAnd I'm paid in full, still on the block busta\n'94 rock \"Rucker\", '01 rob \"Rucker\"\nShoguns show guns, Blow one, you're not gutta\nLittle inside joke for you cocksuckas (sucka)\nMy Block, sucka, pop corn and hot butta\nLike its the movie theater\nBut its the oozie area\nHoody Hoo, call hoody hoo produce hysteria (Hoody Hoo!!!)\nAnd me I ain't no coattail bitch\nI get the Motel 6, where them hoes sell bricks\n[Sample of female singing in background Overlaping]\nKilla\nDipset!\n\n[Chorus]\n[Cam'Ron and (Juelz Santana)]\nJump! Back!\nGlock! Cock!\nAim! Shoot!\n(Y'all some dead motherfuckers)\n[Repeat Twice]\n\n[Verse 2]\nI bitch straight up, get in the car (Oh Shit!)\nI'm the shit in the car\nI do like Alfre-do, shit in your car\nPop-a-squat in the drop\nTake a drop in the drop\nWhile you dropping the top, unlocking your locks\nDamn!\nLast year y'all got a mask in your ride\nY'all imagine its hard, y'all asking for jobs (Jobs?)\nRealize I'm attached to the mob\nSelling crack in the park, blowing sacks in the Saab\nAnd chrome, give you skin burns\nLeave your dome like ringworms (Worms)\nAnd niggas coming home, they my interns\nWe the cake couple, put together great puzzles\nHood they love us, the hood together we stay subtle\nJuggle bubble, why you niggas hate tussles? (Y'all don't wanna fight)\nI didn't always hustle, I was Ma$e muscle\nHe had the ones so he bought the body\nI had the guns so I caught the body\nDone son off in the lobby (Finished)\nI stay wit the gun shooters, drum movers\nRaazoo Kahlua turn one ruler to son doola\nAnd the same brother that you knew\nCame through in the rain same color as +Yoohoo+ (Y'all don't know)\nNow you know thats the same color as doo doo (Shit)\nI'm the shit, call me Pepe Le Poo-Poo\nAnd I got eses thats cuckoo\nYou freshe like they LuLu\nFrom freshe they don't doo you\n[Sample of female singing in background Overlaping]\nKilla....Killa\nDipset!\n\n[Chorus]\nKilla!"}]}