{"songs": [{"album": "Hood Hop", "year": "2004-02-10", "title": "Tipsy", "image": "https://images.genius.com/dd5c87b377f25bc5548679e744e75f73.600x600x1.jpg", "lyrics": "[Intro]\nTeen drinking is very bad\nYo, I got a fake ID though\nYeah, yeah, yeah\nYo, two step with me, two step with me\n\n[Verse 1]\nOne, here comes the two to the three to the four\nEverybody drunk out on the dance floor\nBaby girl ass jiggle like she want more\nLike she a groupie and I ain't even on tour\nMaybe 'cause she heard that I rhyme hardcore\nOr maybe 'cause she heard that I buy out the stores\nBottom of the ninth and a nigga gotta score\nIf not I gotta move on to the next whore\nHere comes the three to the two to the one\nHomeboy trippin', he don't know I got a gun\nWhen it come to pop, man, we do shit for fun\nYou ain't got one? Nigga, you better run\nNow I'm in the back gettin' head from my hun\nWhile she goin' down, I'm braggin' on what I done\nShe smokin' my blunt sayin' she ain't havin' fun\nBitch, give it back, now you don't get none\n\n[Chorus]\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\n\n[Verse 2]\nTwo, here comes the three to the four to the five\nNow I'm lookin' at shorty right in her eyes\nCouple seconds pass, now I'm lookin' at her thighs\nWhile she tellin' me how much she hate her guy\nSay she got a kid but she got her tubes tied\nGirl, you twenty-one? Girl, that's alright\nI'm wonderin' if a shake comin' with them fries\nIf so, baby, can I get 'em super-sized?\nHere comes the four to the three to the two\nShe started feelin' on my Johnson right out the blue\nGirl, you super thick so I'm thinkin' that's cool\nBut instead of one life hat, I need two\nHer eyes got big when she glanced at my jewels\nExpression on her face like she ain't got a clue\nThen she told me she don't run with the crew\nYou know how I do but that's just what I gotta do\n\n[Chorus]\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\n\n[Verse 3]\nThree, here comes the four to the five to the six\nSelf explanatory, I ain't gotta say I'm rich\nYes, single man, I ain't tryin' to get hitched\nLiquor wasted on me, man, son of a bitch\nBrushed it-it off, now I'm back to gettin' lit\nWith some orange juice, man, this some good ish\nHomeboy trippin' 'cause I'm starin' at his chick\nNow he on the sideline starin' at my clique\nHere comes the five to the four to the three\nHands in the air if you cats drunk as me\nClub owner said, \"Kwon put out those trees!\"\nDude, I don't care, I'm a P.I.M.P.\n\n[Chorus]\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\nNow, everybody in this bitch gettin' tipsy\n(Everybody in this bitch gettin' tipsy)\n\n[Outro]\nEverybody in this bitch gettin' tipsy\nEverybody in this bitch gettin' tipsy\nEverybody in this bitch gettin' tipsy\nEverybody in this bitch gettin' tipsy"}], "artist": "J-Kwon"}