{"artist": "Ant Banks", "songs": [{"title": "Players Holiday", "image": "https://images.genius.com/f5e3b268f1ab7a632ba28e1447e73a94.774x768x1.jpg", "album": "Derty Werk", "lyrics": "[Too $hort]\nWhat?\nYou say what?\nThe president did what?\nAh man, that's hey, that's all good baby\nHe got rid of the player haters too?\nAh man, we need to declare this a national holiday\nWe gonna call this Players Holiday\nAnt B-Z what up man?\n\n[Ant Banks]\nRise and shine, make you wanna say\nDear God, let me thank you for another day\nFor livin' life on the edge and I'm tryin' to break it\nTired of duckin' the Feds, but it's a struggle to make it\nSo this is your day homey, now it's time to shine\nIf a player's only trickin', you can wine and dine\nStress free from the drama, better go get your ticket\nThen come on cause some squares can't lie to kick it\n\n[Mac Mall]\nIt feels good not to grind no more\nDon't get it twisted cause I still hustle\nMaintainin' just tryin' to reach my goal\nLivin' life truly successful\nSo that my little soldier never have to sell no dope\nAll the Cutties from the pens comin' home again\nAnd we ain't tryin' to kill each other cause brother we all in\nBeautiful black women give 'em much respect\nAnd ain't no funk 'tween the east and the west\nIt's just a Player Holiday\n\n1 - Today's the day the Players play\nSo you better be on your way\n(On your way, your way)\nNow it's time to celebrate\nHurry up and don't be late\nCause you know it's gonna be a lovely day\n\n2 - Lovely day, lovely day, lovely day, lovely day\nLovely day, lovely day, lovely day, lovely day\n(A lovely day)\nLovely day, lovely day, lovely day, lovely day\nLovely day, lovely day, lovely day, lovely day\n\n[Too $hort]\nJanuary 1 the year 2000\nWe gettin' all the money and we ain't through clownin'\nYou can tell everybody that stays around your way\nToday is the official Player's Holiday\nShort Dog I'm lovin' every minute of it\nCause pimpin's been around since the beginning of it\nWe barbecuin' chicken, that's what we doin'\nGot some breezys and we kickin'\nAnd Cap what you doin?\n\n[Captain Save Em]\nI'm just sittin here timin' like a Rolex watch\nI figured by now y'all realize that Hip-Hop and Rap won't stop\nPuttin' it together like a racing track\nWhere's all my Latino, Philippino, and Ese partners at?\nI know you feel me when I say that life's a struggle\nBut God first, y'all know we all can't help but bubble\nSo keep your head up\nAnd know that things are changing for the better\nTalkin' 'bout the youth, the little kids\nForget about you, never\n\nRepeat 1\nRepeat 2\n\n[Ant Banks]\nNow all the real players throw your Rollies in The air\nAnd wave 'em all around like you just don't care\nFrom side to side and from front to back\nThrow the peace sign baby, show me where you at\nDollar bill y'all, and we could scream it out loud\nAnd Mac Mall's here, homey that can move the crowd\nSo what the deal with you nigga, you could cross the town\nPut the squeeze on the haters, ain't no need to clown\n\n[Rappin 4-tay]\nNone of the homies got pop\nNone of the spots got batteram\nAnd I'll be damned, it's crackin' like a Summer Jam\nBarbecues, no more feuds, players embracin'\nSlammin' dominos, bustin' raps, still paper chasin'\nCompetitors keep a distance, it's all love baby\nRub-a-dub-dub love, welcome to the Players Club baby\nA family affair, a toast to the bay, hey\nLooks like it's gonna be one of them lovely days\n\nRepeat 2\n\n[Mac Mall]\nMama used to put my clothes on layaway\nNow I'm dipped everyday and every C-note got big face\nHoller at me man, used to ride the back of the bus\nNow I'm spinnin V-12's though the times is rough\nIn God we trust haters, you can only hate us\nBut can't front cause you knew that we was bound to blow up\nGettin' paid what we can, Short Dog and Ant Banks\nMac Mall do it big on a Players Holiday, yeah", "year": null}]}