{"artist": "Wale", "songs": [{"title": "Freedom of Speech", "year": null, "lyrics": "[Intro]\nYou really don’t understand, do you?\nHey man, don’t you realize in order for us to make this thing work man\nWe’ve got to get rid of the pimps and the pushers and the prostitutes\nAnd then start all over again clean?\n\nHey look, nobody's pushing me anywhere, ok?\nI mean not you, not the cops, nobody man\nI mean you wanna get rid of the pushers I'll help you\nBut don't send your people left to me\n\nOh come on John\nCan't you see that we can't get rid of one without getting rid of the other\nWe gotta come down on both of them at the same time\nIn order for this whole thing to work for the people\n\n[Verse 1]\nGood things to those who wait\nI don't involve wth those who make noise or indulge in hate\nI pray to God, may Allah make my bars be great\nSo my job secure in case my broad is late\nI got no time to slow it down and contemplate\nNiggas hungry for a change so Obama eight\nYears, safe here never, Rayful\nKept it moving, reindeer weather\nCrack babies turned crack sellers, still got nada\nThat happens when you black nigga with no product\nUnathletic, it's sad though when it's no calling\nSo now you with the strapped niggas that want problems\nNo problem, and the hood ain't changed in years\nAnd I'm optimistic at times for politics can't erase the fear\nPro-black is dead, self-loathing and shit\nWhole race feel misplaced since the Reagan Era\nWhere's Che Guevera ??\nHear cries from black moms for convisary\nAnd the cops'll stop now, the town is different\nSee the blocks like black mamba, brown omitted\nLittle gentrification which ain't gender-specific\nAll us niggas is niggas, a few of niggas is bitches\nDig it, cigar lit up, Obama got a longer tenure\nYou ain't gotta get involved unless that boy sizzle\n\n[Bridge]\nYeah, one nation under God\nPolitics about the guap, I hate to break your heart\nJust play my part\nStay low, pray to God\nFor all the hate shown, it made it hard to watch\nCould be a race war, niggas on your mark\n'Til somebody start\n\n[Verse 2]\nConspiracy theorists in my lyrics\nAnd feel like my shit is somehow different albeit\nIt could be the image of my niggas\nAnd your perception is ruining my vision, dig that\nMy president mulatto, a resident of many of serato\nA penny for your thoughts, my retorts worth a dollar\nGet off my fucking George Carver\nAs far as little Bush, I'm thinking more little Rallo\nDo you follow or did I lose you?\nMs. Dash, yeah, she bad, but the broad still clueless\nReese get her, not little\nWitherspoon feeder 'til the seats fill up, get me\nParanormans on my feet nigga, jiggy\nI, commander in chief, nigga, Bentley\nExercise of free speech, nigga, get me\nBut politics just ain't me, nigga, feel me?", "album": null, "image": "https://images.genius.com/e0cde0eabe61c1ddca97cce2386792d2.421x421x1.jpg"}]}