{"songs": [{"title": "Again (Unofficial Remix)", "lyrics": "[Intro]\n[Sample Quote from “Don't Be a Menace to South Central While Drinking Your Juice in the Hood”]\n[Ashtray’s Mother]\nI don’t want you hanging out in the streets.  I want you to finish school.  ‘Cause without an education, the only kind of work you’re gonna get is selling drugs, pimping women, or working security for Eddie Murphy.  Now, I’ve done all I can.  I got my education, I worked two jobs to support you.  But I can’t teach you how to be a man.  Now, give me a kiss and be a good boy\n\n[Akir]\nAgain?  Big shout to John Legend.  It’s Akir.  We dedicate this to everybody with they eyes on the prize\n[Statik Selektah]\nStatik Selektah, Akir.  It’s “The Secret.”\n\n[Verse 1 – Akir]\nSong-writing again\nGotta show the industry I’m nice, lightning when I strike with the pen\nBlao!  Getting older.  Just got sober.  But I’m drinking again\nAnd we performing at ten.  And if she caught it to then\nHope I don’t fuck up my rhymes again\nI got over.  Shit, I’m a soldier\nI freestyle mean styles until the end\nBut I’m tired of performing the same shit\nI had to get back on the street—the hustler’s language\nAnd though I thought [?] time, my lane switch\nFree shows, gotta eat mo’ the same shit\nPromoting, still faking\nI’m getting much love from my fam\nBut those close to the grams\nBroke while they shaking my hand\nSo I explain who I am\nThey don’t give a fuck\nOnly shorty’s hitting me up\nI wanna quit the nicotine, but\nI light ‘em up again (light ‘em up)\nAnd make progress to show change\nBut thug niggas go hard to the cage\nMy OG of old age\nComplaining of wage.  Go back to old ways\nAlmost as slaves\nI never, ever wanna have to say: goodbye\n\n[Verse 2 – John Legend]\nSo I’ve got a new friend\nI wish I could forget you but I miss you, wanna kiss you again\nBut she’s like you\nBut she not you\nGotta find you again\nWe remember again\nThe middle of the summer and I take you out to dinner again\nBoy, I love her\nIt’s not over\n‘Cause I love her again", "year": "2009-10-28", "album": "The Secret", "image": "https://images.genius.com/69cdf875f4c2405e3ab5b52878542f48.500x500x1.jpg"}], "artist": "AKIR"}