{"songs": [{"image": "https://images.genius.com/74dc0d9154e959ecdbf4c402a161c05b.1000x1000x1.jpg", "title": "Warm Up", "album": null, "year": "2016-09-08", "lyrics": "[Intro]\nYeah\nSomething for the fans\nYeah\n\n[Verse]\nI'm the type to rent a hotel room just to feel at home\nI'm the type to rent a hotel room just to be alone (yeah)\nI got an issue with people pretending they like what they don't\nPlease don't bring up my issues unless you gon' deal with your own\nPlease don't try to pretend like you keep it real, though\nYeah it's funny that you got a lotta money\nBut that money doesn't buy you skills, though\nI don't care if I am on the billboards\nOn a killing spree, I'm about to kill more\nGot a chain on you paid a mill' for\nI mean what you people even live for?\nI write raps, you steal yours, oh Lord (haha)\nWe just getting warmed up\nYeah, I said I was coming, I warned you\nSo close to the fans\nI feel like they ride on my tour bus\nYou wanna know what I do in my downtime?\nThey come to my fortress\nI apologize for all the corpses\nIt's a mess right now\nBut I haven't had time to put the rappers in the coffins\nWe ain't talked in like six years\nWhy you writing me now?\nI just turned 100k down\nJust to keep the brand looking right, now (that's real)\nI ain't bragging about the money\nI'm just saying I ain't controlled by the bank account\nOr the bank amounts\nI'm a business man\nBut don't touch my money\nI don't play around, woo!\nLights out when the mic's out\nAbout to hit the West Coast\nHype crowds\nI just put a record out\nWhat you think I'm gonna pipe down?\nNah, I've been looking for a beat\nLook what I found, woo!\nI mean everything is coming out of my mouth\nTried to tell me, yeah, I ain't had the right sound\nOh yeah? Well\nTell me what you think now\nTwo records in the bag, I ain't done though\nWhat's coming next year?\nLet me hear the drum roll\nDon't flow\nAnybody wanna be the one to make an issue out of nothing?\nImma hit you with my iPhone\nI know\nI'm a little out of hand now\nI ain't looking for a handout\nYou ain't like what I was doing last year\nWhich is funny 'cause you lookin' like a fan now\nAre you a fan now?\nI kinda miss being broke\nNow let me go back to my old days\nWhen I used to walk into high school\nAnd hand out my CD in hallways\nI told all my teachers that I'd be a rapper\nThey smiled and looked at me, \"Okay, that's a pretty nice dream, but you better get a real job.\"\nMmm, no way\nYeah, I live what you dreamin'\nI could do this while I'm sleepin'\nI ain't the type that will bring up your name for nothing\nBut please, don't give me a reason\nI'm on the edge now, I ain't playin' with you\nNever really been a fan of takin' pictures\nI'm just being honest, yeah, I'll take it with you\nShows sellin' out, better get your tickets, oh Lord!\nI got a love for the fans\nI can't express what it feels like\nSometimes I wonder if it's even real life\nSometimes I look at the past and think about how I got here in the first place\nYou know the glove is my birthplace\nI don't wanna be rude\nBut I could get you on my worst days\nSay nothing for me\nDo it all the time\nYeah they barely workin' while I'm workin' overtime\nLast year they like, \"Who am I?\"\nNow this year they like, \"You the guy.\"\nHere's a little something for your car rides\nIf they said I fell off, they all lied\nYeah, you know the logo\nBetter recognize\nYeah, it's Real Music 'til the day we die\nYah!"}], "artist": "NF"}