{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/ac60efef8cca00a893f65b5ddd7347d1.640x640x1.jpg", "title": "#1 Fan", "year": null, "album": "It’s Pronounced “Five Two”", "lyrics": "[Verse 1]\nYo! This is what happened\nYo! I woke up late it was like 10 in the mornin\nI was still half asleep and sleepy eyed, still yawnin'\nI checked my voice mail to see who'd been callin\nI turned on my computer\nChecked my email logged on it\nJunk mail, junk mail dog-on-it\nEverybody just tryin to sell me they product\nBut there was one email that cought my optic\nIt said suicidal, took the mouse and clicked onit\nShe said, \"Dear KJ, you don't know who I am\nYou probably don't care 'cause I'm just another fan\nI doubt you ever read this, now but if you can\nSometimes I slash my wrists and even cut my hands\nAnd I feel all alone like nobody understands\nAnd I'm gonna end it tonight I got the whole thing planned\nPop pills, leave a note on my night stand\nSigned sincerly, Your Number One Fan\n\n[Chorus]\nCan someone now please help me?\nWill someone now just please help me?\nCan someone now please help me?\nWill someone now just please help me?\n\n[Verse 2]\nMy heart is poundin' as I start to type back\n\"Why do you feel this way, do you mind if I ask?\nWhat's the source n' causin' the pain that ya have?\nHow'd you get this way, is it somethin' from the past?\nGod cares about you, hope you understand that\nPlease don't end your life, I'm beggin', please write back!\"\nI finished typing, I sent the email quite fast\nI bowed my head and prayed with the strength that I had\nShe said, \"Man, KJ, I didn't even know you'd write me\nLet me explain why no one could ever like me\nIt all started when my father used to strike me\nRape and abuse since 1990\nHe's gone now but I can't put it all behind me\nI tried to run away, but my trouble'll always find me\nIs God really just the one that can help me?\nSigned now, your number 1 fan sincerely\"\n\n[Chorus]\nCan someone now please help me?\nWill someone now just please help me?\nCan someone now please help me?\nWill someone now just please help me?"}]}