{"artist": "Cage", "songs": [{"title": "Adlibs In My Head", "album": "For Your Box", "year": null, "image": "https://images.genius.com/87b1349e0e88f091194f97717dba4022.300x300x1.jpg", "lyrics": "[Intro]\nEverybody!! all together now!\n(this is the way bump your head\nBump your head, bump your head)\nYou can hear the ablibs in my head\n(this is the way we bump your head!!)\n\n[Verse 1]\nAndroid typewrituh kills all psyche-\nDelic takers, now dead out for brain cider\nWrote trees off my boots with pictures of L's\nMy shits harder to swallow with jagged.. little.. pills\nBe up at night in cold sweats with insight\nOn how make bombs blow through the bomb spirit like\nAs my soul decays from life to life relays\nI keep my flesh wrapped around my skeleton cage..\nAll you females ribs are like abortion cribs\nChick could reel hibiscus angelically morbid, how you call it!!\nPontius Pilate see the juice through your skins violet\nEchoes of gun blast!!.. hybrids!!.. see me for who I really is\nKinda like some black shade shit from they lip\nYou get your ribs.. barbecued boneless..\nDeeper than pentagon foundations can't tone this-\nShit down, pulling your FBI file\nWith flicks of toast stuck in your girls pink smile\nIf Edgar Allen battled Moses\nYou'd taste your last breath that's a puke burp, loath this\nNeed you to hate this, you can't take me alive, anxious\nWatching your own shit, and never out rank this\nBank-less, I pull black blankets over sunny days\nIf I ain't happy we all feeling like Cage!!\nMy fate probably lies in some creamy white thighs\nPuss taste like dust and she talk with her eyes!\nPlus she living off the drippings of my semen\nTried to crawl up in a box, trapped in her chest cavity fiending-\nFor real oxygen, my wounds too deep for doctoring\nVomit grammar like that vodka when\nI took the shit to Mesc' to avoid breasts\nSmoke the dip to kill stress\nIf you can't hear the adlibs they in my head!\nSex this little rave chick with 34 piercings\nTwo bottles of K and her hair dryer made her flyer\nPushed her spirit through the mattress slashes crazy\nMy seeds procreate I ejaculate grown babies!!!\nSpeaking the paragraph leaking, to build up the peaking\nRight before the detonation of the heat seeking!! BLAOW!!\nBlaow!! (blaow, blaow!!)"}]}