{"songs": [{"album": "Trap Muzik", "image": "https://images.genius.com/7838dfd33d240a2ae4643e282380e595.170x170x1.jpg", "year": "2003-10-07", "title": "Be Easy", "lyrics": "[Intro]\nUh-uh, uh-uh, uh\nAye, where the piano at shawty?\nYe-ye-ye-yeah\nY'all ain't never seen a dope boy play the piano and rap at the same time, have you?\nI'mma show you somethin', dig this\n\n[Verse 1]\nI'm 22 and a vet in the game\nSay I'm, I'm supercool, still a threat at the same time\nRhyme 'bout the times I invested in 'caine\nPleasure and pain in every aspect of the game\nI'm the answer to your prayers if you prayin' for change\nSo, I dare you compare us and say we the same\nWhen I'm, I'm climbin' the ladder, they stuck in the same mindframe\nThey accomplishments are nothin' to gain\nEventually, see I'm outta your range\nExcept this rose gold glow from my wrist and my chain\nI entertain young niggas who slang\nLike a picture, no frame, see it's simple and plain\nMy shit bang, spit flames, put niggas to shame\nFlow so insane, lyrics sick and derranged\nNow you can't, mention my city unless you mention my name\nT-I-P-I-M-P, I'm the man\n\n[Hook]\nAy be easy - you don't want no trouble with me\nJust be easy - the drama ain't nothin' to me\nAy be easy - before you have problems just breathe\nAy be easy - you ain't worth dyin', believe me\nJust be easy - you don't want yo mama to grieve\nBe easy - well mind yo bizness, don't bother the G\nBe easy - swear you stuntin' but you frontin' to me\nBe easy - behind the scenes or behind yo ?\nAy, be easy\n\n[Verse 2]\nCame in kissin' ass when I came to lead\nSet the standard for Atlanta, rearranged the lead\nOkay, so what tha fuck is fame to me?\nI been plottin' since kindergarten, you'z a lame to me\nI give the niggas what they came to see\nA reflection of one self where they aim to be\nAs you can see it ain't no change in me\nAnd you won't meet another nigga off the chain as me\nI'm so fly, no lie, don't deny it, ya feel it\nSo inspired by my style, decided to try it yoself\nBet you won't, meet nobody ranked as high as myself\nThe checks you waitin' on, homes, I can sign them myself\nTote gats, dro smoked that, now I'm high\nSeats way back in the Maybach I ride\nThrough the streets of the westside, I slap five\nAnd throw dubs, show love, nigga\nHate me, why?\n\nRepeat Chorus\n\n[T.I. talking] (\"Be easy\" in the background)\nWhat it iz pimp? T.I.P., Trap Muzik, understand that?\nGrand Hustle pimp! Ay, whus hattnin' Toomp?\nLet's ride out homie! What it iz mayne?\nP$C, Pimp Squad Click, shawty!\nUh, uh... A-Town... stay down..\nKeep it pimpin', pimpin'!"}], "artist": "T.I."}