{"artist": "Young Thug", "songs": [{"year": "2015-10-31", "lyrics": "[Intro]\nWe came a long way and that's why I say\n\n[Chorus]\n'Bout time, 'bout time, 'bout time, 'bout time, 'bout time\n'Bout time, 'bout time, 'bout time, 'bout time, 'bout time\n'Bout damn time, I swear to God\nGod damn time, ayy\n\n[Verse 1]\nI done ran that money up, 'bout time\nI used to stack a five, now I'm stacking dimes\nI don't care if none of y'all ain't my kind\nYour watch cost 5000, you wasted your time\nAnd I'm finished, why you still at the line?\nIf you ain't Damu nigga, you must be blind\nAnd I ain't turning down, turn down for what?\nI'ma turn up every time, every time\nEvery time, every time\nI cop a ten thousand pimp belt\nI told the bitch she gotta suck and fuck\nOoh, in front and back and make her double nut\nWrapped up in towel, got out my cat plug\nI swear to God she wetter than a tub\nI supply real niggas and they show me love\nI fuck three, four hoes every time I'm in club\nCrack pack count, I gotta see these fucks\nMommy wassup? No gives, I got kilos\nShe'll cook up a four\nI wanna be that nigga, my Denali truck stand tall\nI can't even see these niggas\nIf I wanted to I still couldn’t see these niggas\n\n[Chorus]\n'Bout time, 'bout time, 'bout time, 'bout time, 'bout time\n'Bout time, 'bout time, 'bout time, 'bout time, 'bout time\n'Bout damn time, I swear to God\nGod damn time, ayy\n\n[Bridge]\nI came from the bottom, 'bout time, yeah\nI know these niggas want fuck with me, 'bout time\nI'm a footballer bitch, for a long time\nCame from smoke in the cup, quite a long time, yeah\n\n[Verse 2]\nThese bitches know I wanna fuck 'em all\nYoung Money shit\nThese bitches know they come round me with no drawers\n('Cause what?) I'm on that horny shit\nThis that horny shit, I don't care, I got horns bitch\nA capella now, I'ma beat your fucking clique\nI might mail this shit, I won't never tell no bitch\nAll my bitches thin and brown, this that pretzel shit\nMiss Chelle, Miss Chelle\nShe got bumps and rumps all over BB\nI buy her CC, then I turn that shit to BB\nI'm like feed me, feed me, feed me\nI don't wanna eat ye\n\n[Chorus]\n'Bout time, 'bout time, 'bout time, 'bout time, 'bout time\n'Bout time, 'bout time, 'bout time, 'bout time, 'bout time\n'Bout damn time, I swear to God\nGod damn time, ayy\n\n[Outro]\nIt's 'bout time bitch\nHe ain't have nothing to say nigga\nAin't going back, nigga\nI drank pints a day, bitch\nLoaded, ayy", "image": "https://images.genius.com/2b1dcde62657935e97ccf20a99636263.1000x1000x1.png", "album": "Slime Season 2", "title": "Bout (Damn) Time"}]}