{"artist": "Webbie", "songs": [{"year": null, "lyrics": "[Intro: Webbie talking]\nBoo... I mean you my baby man\nAll that other shit, that shit ain't fucking real\nLook, I love ya. I don't even be remembering these bitches names the next day\nSometimes I don't even know they name before it even happen\nKnow what I'm saying?\n\n[Verse 1:]\nWhen you be gone I'm wonderin where you at, what U doen and who U with. Lookin at da phone wonderin what's takin so long for you to get back. Kiss U where I miss U at. Know where I'm finna take it at, say U not in da mood... So it's cool watch I'm a get U wet. U my Night, Day all dat. U my what ya call, when ya wanna take ya time settle down and shut off. U can have half of all this, U my baby gal. Da way I feel if U ever disappear, I swear my heart'll just stop! Even if I never ever make it to the top, be here to make me feel good... U give me a natural high. Done quit messin around, told all dem other girls byeeeee. If I wasn't paper chasin probably wouldn't even much leave ya side. Bonnie, Clyde... Everybody eyes on us look and listen to me, everything gon be fine. Ya brighten up my days when the sun don't shine. I tell ya all da time\n\n[Hook: Bobby V.]\nShe got dat pretty brown round, drivin me wild. Can't let ya go girl, so if ya wanna holla, holla back! Cause baby I want you, baby I need U. So if U wanna holla, holla back! Cause shawty know she lookin like whooaaaa. Shawty know she stuntin like whooaaaa and shawty know she lookin right. Shawty know she stuntin like whooaaaa!\n\n[Verse 2:]\nJust like I told ya... After all of this over when da smoke clear from da dosha, still gon have U a shoulder fo to lean on. No roses, I don't need dat to show ya, I know ya feel it when I hold ya, dat I love yo ass more den anything! Den I'm sayen we done been threw da pain and all da rain, done dried up! Cleared all of my lies up. Feel like I done growed up and opened my eyes up. Focusin more on us. Let's face it we in love! And ya make me so mad til I hate ya so bad. But, I love ya so much and the break ups just never last. Sometimes this shit get too ignoring, know U tired of hearin I'm sorry, but I am. I took yo hand and walked and bought U with me, gotdam! Sometimes U be trippen, be forgettin what we have and when it come to fuck ups, baby U done had yo share. Yaaa, and U be forgettin dat and da reason why U sittin where U sittin at\n\n[Hook: Bobby V.]\n\n[Verse 3:]\nU know, I just been thinkin dat when I get through hustlin, we gon move away, it's just gon be me and you okay, I promise. Right now I ain't got time, I'm on da grind. It don't sound right, U like my wife but all my life boo I just wanna be a timer. In just a few more months and a few moe blunts I can retire. Look at me, to keep U happy I do all dat it require and tell yo bullshit friends, stay out our business fucken liars! Yo birthday cumin up, I got yo present, hope U like it. If U got a real ass bitch, dat U in love with holla right chea! Hoes, I can't love ya, but I'll probably first night ya! Savage, Sweet Jones Jones ya back at it. If I'm with my main squeeze get back at me. I treat ya like my momma, but U kno U my baby, don't U ever forget it, I know I ain't told ya lately, but...", "image": "https://images.genius.com/227b6afa7fbd4987b3d7a6e63507e0c3.316x316x1.jpg", "album": "Savage Life 3", "title": "Shawty Know"}]}