{"songs": [{"title": "Good Lord", "image": "https://images.genius.com/1d12d7dc0eb80df9792dceff1153791b.1000x1000x1.jpg", "lyrics": "Bismillah Ar-Rahman Ar-Raheem\n\n[Hook - Brother Ali]\nI said the good Lord made me what I am and I play this game for keeps\nGot to use what I have to get what I want, all the dreamer got is his dream\nAnd the good Lord made me what I am and I play the hand I'm dealt\nSaid sometimes the hardest thing to be in this world is just yourself\n\n[Verse 1 - Brother Ali]\nBest believe the Qur'an influenced all of my songs\nMy fans run and tattoo 'em all on they arms\nWanna travel, be there every time I perform\nNow look me in my eye and tell me, how am I wrong?\nAnd who would of thought\nJust givin 'em the truth from my heart, both the ugly and the beautiful part\nWould give 'em food from thought, let 'em chew it apart\nAnd they'd all crowd around me and my movement would start\nAnd how you gonna hate me for being what God made me?\nIt's not a game, I ain't sayin it playfully\nThey relate to the joy and the pain in me\nAnd seein me make it be watchin a slave get free\nHoller like Bilal in the tower\nHayya alal falah, Allah is the power\nGivin voice to the dream and let it be seen\nI admit it's obscene but deen recognize deen\nSo it isn't pristine when I spit a sixteen\nClean words don't describe the (shit) that I've seen\nBut layin in the alley, I whispered the Shahada\nBullets fly by from the drive by\nSo Imam Mohammed might pound on the podium\nPopmaster Fabel work it out on the linoleum\nChappelle bust funnies, Mos Def bust rhymes\nMuhammad Ali is the greatest of all time\n\n[Hook]\n\n[Verse 2 - Brother Ali]\nSomething spiritual happen when them hands get to clappin\nCan you tell me, what language do you laugh in?\nThe human reaction of smiles and cries\nWhat language are the tears when they're fallin from your eyes?\nYou've probably seen the sunrise hundreds of times\nBut let a painter paint it or a poet describe\nThe very moment where heaven and Earth might collide\nAnd God let the breath of life come outside\nUh, Satan doubted it, angels bowed to it\nI'm so beautifully human and I'm proud of it\nSoul of a soldier, heart of a scholar\nI wrote this poem with the blood of a martyr\nImam Mohammed might pound on the podium\nPopmaster Fabel work it out on the linoleum\nChappelle bust funnies, Mos Def bust rhymes\nMuhammad Ali is the greatest of all time\n\n[Hook] - 2X\n\n[Outro - Man - talking]\nA lot of cats\nGet up in an age around\nIn their early 30's\nAnd they start to think of like lifetime companionship\nAnd that's when they start to meet ladies who\nAre not too prone to trust anybody\nAnd they got plenty of history to prove to you\nWhy they shouldn't trust nobody\nI didn't know you then, when all that stuff was goin down\nPut them other cats away man\nAnd let me try to make somethin in your life", "year": "2009-03-09", "album": "The Truth Is Here EP"}], "artist": "Brother Ali"}