{"artist": "Watsky", "songs": [{"year": "2009-10-14", "lyrics": "[Chorus]\nIt’s a song about girl the next door\nI love the girl next door\nThe world’s next door\nThey see her- everybody melts\nShe’s the girl next door to everybody else\nIt’s a song is a song about the girl who sings\nAnd every time you hear her sing\nShe sings for you\nAnd you alone\nAnd every other guy you know\nShe loves you back\nShe says she’s with it\nLoves you back\nBut wait a minute\nAll along she loved ya back\nEnough to put a dagger in it\nCause it's a song about girl the next door\nI love the girl next door\nThe world’s next door\nThey see her- everybody melts\nShe’s the girl next door to everybody else\n\n[Interlude]\nSo, funny story. I was was really into this girl, a great singer, and I had a musician friend who was really into the same girl. She ended up essentially playing us off eachother. But, we both had these songs that we were gonna do with her, so we just put 'em together\n\n[Verse 1]\nIt’s like a fairy tale!\nAbout little chickenhead\nThought the sky was falling\nSo she kicked it sick in bed\nI came calling (she pretended she was dead)\nFeeling she was healing but the ceiling fell instead!\nDo you feel stellar in your skeleton?\nTell a guy you fell for him then tell him he’s irrelevant?\nIt’s evident you think you’re Helen of Troy\nBut you’re hell in a handbasket\nHell of a coy little Cruella de Vil\nIt’s fitting you fill in\nAnother filthy felony with every fella you thrill\nYou’re cellophane\nBut there’s a spell on us still\nA man goes window shopping\nAnd you sell him the sill\nYou give an illness that isn’t a silly pill or some silvery penicillin\nOr pity gonna fulfill and so willing my pen is spilling I’m drilling my point until\nThe pen point’s dull\nThe end point’s still\nIn sight, i’m inside, i’m insisting\nGet wise and quit with the lip synching\nIn christ you entice the quick kissing\nRise in a bathtub full of ice with a rib missing\nIt’s been decided\nYou can lie, but you can’t hide behind your eyelids\nI provided rhymes and had to plan a hybrid\nWith the man that led this band who might have liked you more than I did\nOr maybe as much\nCause baby that’s what\nMake me want to laugh\nJust, breaks me right in half cause\nIt really adds up\nDwelling on this sad stuff\nCellibacy mad sucks\nWhen everybody tapped once\nIncluding a best friend\nThen one of my roommates\nYou said it was just then\nBut shit it was too late\nSo what’s your group rate\nCause we’ve waiting our turn\nTo watch you eat your words\nAnd catch some heartburn\n[Interlude]\nI guess that's the problem, when you have a bunch of people who are artists. You end up falling in love because they're-- they're amazing, y'know you see them on stage, and it's too bad because she really does sing like an angel\n\n[Verse 2]\n(Here) is where you would have sung the verse\n(Here) is where you’d have to catch a breath\n(Here) is where you might forget the words\n[haha] that where you’d laugh to fill the rest\n(Here) is where you’d hit another high note\n(Here) is where you’d make it pretty, shit if I don’t\n(Here) is where we’d really try to be friends\nFunny how the shallow girls end up off the deep end\n(First) I met your ass last year\nFirst day of class, you were mad sincere\n(Then) you went and chose my friend for benefits\n(Then) he did the same and said it was the end of it\n(Then) funny thing, I got on TV\n(Then) coincidentally you said you’d like to see me\n(Then) you stood me up on just our second date\nOut with mister music\n(Then) you used him for a your serenade\n\n[Chorus]\nIt’s a song about girl the next door\nI love the girl next door\nThe world’s next door\nThey see her- everybody melts\nShe’s the girl next door to everybody else\nIt’s a song is a song about the girl who sings\nAnd every time you hear her sing\nShe sings for you\nAnd you alone\nAnd every other guy you know\nShe loves you back\nShe says she’s with it\nLoves you back\nBut wait a minute\nAll along she loved ya back\nEnough to put a dagger in it\nCause it's a song about girl the next door\nI love the girl next door\nThe world’s next door\nThey see her- everybody melts\nShe’s the girl next door to everybody else\n\n[Outro]\nWooh! Ha ha! Top of the pops, dude. I feel like, my vocal chords are like, a free dove. I feel like a kastrati. Of course she did it with this one\nI feel like, I feel free. Sing it Watsky", "image": "https://images.genius.com/3433966a73a598eca7e6120b7f0cbab3.1000x1000x1.jpg", "album": "Guilty Pleasures", "title": "Girl Next Door"}]}