{"artist": "Post Malone", "songs": [{"album": "Hollywood’s Bleeding", "title": "A Thousand Bad Times", "image": "https://images.genius.com/456a385f5f9741e2202331ac8d06e1f2.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, oh, whoa, ooh\nYeah, yeah\n\n[Verse 1]\nSaid you needed a ride, but you wanted my car\nWithout that face, girl, you wouldn't get far\nI really like you, despite who you are, oh (Who you are)\nYou see me on TV, you know I'm a star\nYou say you don't know me, but I know that's false\nI'll pay the price, girl, whatever that cost, oh (What it cost)\n\n[Pre-Chorus]\nYou make my life so hard\nBut that's what gets me off\n\n[Chorus]\nI had a thousand bad times\nSo what's another time to me? (What's that to me, yeah)\nYou try to burn my house down\nBut what's another house to me? (What's that to me, yeah)\n'Cause I can take anything that you give me (What you give me)\nIt's gonna take a lot more to kill me, bitch\nSo thank you for the grave (Yeah)\nI needed me a place to sleep (Place to sleep)\n\n[Verse 2]\nAnd I don't wanna meet your mama (No)\nShe prolly crazier than you (She prolly crazier than you)\nI'm gonna need some thicker armor (Armor)\nTo spend another night with you (And on and on and on)\nBaby, I know just what to do\nEvery time you fuck me over, I'll come back to you\nBaby, I don't want to know the truth (Know the truth)\nI ignore them when they tell me all the shit you do (Shit you do)\nI always get my heart broke like I needed the practice (Needed)\nFoot on my throat 'til my world is collapsin' (Damn)\nBut this what I chose, it's the law of attraction, yeah (Attraction)\n(And on and on and on)\n\n[Pre-Chorus]\nYou make my life so hard (So hard, so hard)\nBut that's what gets me off\n\n[Chorus]\nI had a thousand bad times\nSo what's another time to me? (So what's that to me, yeah)\nYou try to burn my house down\nBut what's another house to me? (So what's that to me, yeah)\n'Cause I can take anything that you give me (What you give me)\nIt's gonna take a lot more to kill me, bitch (Kill me)\nSo thank you for the grave (Yeah)\nI needed me a place to sleep (Place to sleep)\n\n[Bridge]\nI should get out, but I still want more\nI should get out, what am I waitin' for?\nIt's all the same to me, it's all a game to me\nIt's all the same to me, it's all the same\n\n[Chorus]\nI had a thousand bad times\nSo what's another time to me? (What's that to me)\nYou try to burn my house down\nBut what's another house to me? (What's that to me)\n'Cause I can take anything that you give me (What you give me)\nIt's gonna take a lot more to kill me, bitch (Kill me)\nSo thank you for the grave (Yeah)\nI needed me a place to sleep (Place to sleep)\nWe go there, oh", "year": "2019-09-06"}]}