{"artist": "G-Dep", "songs": [{"title": "I Am (feat. Kool G Rap & Rakim)", "album": null, "year": null, "image": "https://images.genius.com/e809032be49dc1abed1b3b49bf50e014.620x400x1.jpg", "lyrics": "G. Rap and my nigga G-Dep\n'Bout to do it Gorilla style, you heard\nIt's a Igloo-Bad Boy collabo thing you know?\nY'all niggas ain't ready for it\n\nComing Rambo style nigga\nTwo guns up\nY'all niggas better duck down or get your cap lifted off\nThat's how we doing it for the new millennium, you heard?\n\nRegardless of the wait, I'm gonna stay straight ghetto\nEverybody high, don't nobody say hello\nEven when the sun shining it ain't yellow\nGet out of the borough if you know it ain't thorough\n\nNiggas play ball, AWOL, on the furlow\nStill came down on the furl and pumped hero\nRed and gray Max's keep as clean as Ajax\nGhettos sling cracks while you niggas pay tax\n\nNow how ghetto is this?\nYou can catch me in your hallway taking a piss\nOne hand on my dick, one hand on a spliff\nBurnt lips from the roach clip, yellow tips\n\nIf we ain't closed, it I get ferocious\nBlow this whole shit and leave me in them roaches\nIn your car motion I cause commotion\nAnd I probably need some lotion but I don't get fucked\n\nI am a ghetto nigga, you can tell in a talk\nOn the corner selling the snort\nIt's hell in New York\nWon't stop for a minute cops telling you walk\n\nFake guards telling you pork\nSettle for shorts, running from court\nNewports, criminal thoughts\nOn the blocks bodies a court nobody supports\n\nWhat's a ghetto nigga? Thorough niggas that get cake\nFive boroughs of niggas do his [unverified] a [unverified] flip weight\nChange garments to trick jake, yo dis jake\nI want it, yo I got warrants in six states\n\nStay calm in a stolen whip with switched plates\nSnitches hate, I never leave a print to trace\nOnly evidence I leave is hickies on chicks' face\nOn the corner with the crooked niggas, but yo shit's straight\n\nWe start war to leave with these seven revolvers\nShell case never touch the floor, sneaky ain't slick enough y'all\nI'm man enough to put on a dress\nCreep up like grand-mama and bust y'all\n\nGet close enough to part your vest and tux off\nWho would have thought the lady with the car crush y'all\nToo smart to get caught, but I got fam up north\nSo if they put me in cuffs and court, fuck y'all\n\nI am a ghetto nigga, you can tell in a talk\nOn the corner selling the snort\nIt's hell in New York\nWon't stop for a minute cops telling you walk\n\nFake guards telling you pork\nSettle for shorts, running from court\nNewports, criminal thoughts\nOn the blocks bodies a court nobody supports\n\nCock back the hammer, slow and pop that cantaloupe\nFor the venom in my python spit, it ain't no antidote\nJackpot from crack blocks, I was a man of dope\nSnapshots'll get your camera broke\n\nYour hoes used to plan a gross with the hands toast\nClose and stand opposed\nRubber bands of C-notes, grams of the coke\nRazor blade tuck the side the line, the banter of the coke\n\nWatching niggas die with my hand on they throat\nSinkin' river banks and wash up on land when they float\nChoking on your own words, should've watched the grammar you spoke\nOne last final approach, make your whole family ghost\n\nBust bottles of cham and we toast, to your photo stamped in the post\nSex gland cut off jammed in your throat, man are you gross\nBitch hanging from a lamppost, we shoot from up close\nBlow cannons the most, catch an overdose\nNigga, we own the coast\n[Unverified]\n\nI am a ghetto nigga, you can tell in a talk\nOn the corner selling the snort\nIt's hell in New York\nWon't stop for a minute cops telling you walk\n\nFake guards telling you pork\nSettle for shorts, running from court\nNewports, criminal thoughts\nOn the blocks bodies a court nobody supports\n\nI am\nI am"}]}