{"artist": "Prince Paul", "songs": [{"album": null, "title": "Put the Next Man", "image": "https://s3.amazonaws.com/rapgenius/1360464569_princepaulpic.jpg", "lyrics": "What? Shit, I could definitely sell for y'all brothas\nWe could all get this money\nGet paid, I'm just I'm just tryin to get down wit y'all brothas\nY'all brothas got, I'm sayin y'all, y'all got all that shit together\nI'm just tryin to yo, be like y'all brothas, Big Will yaknawsayin?\nBut yo I gots mines, you know niggas call me around the way\nCheck it aiyyo\nThe Green Bandit, son the beats handed over like jugling\nAnd the only slight trouble is keep it up\nSleepin, what? I flips more weight than Oprah\nStrips or fate than hope, my skills superb\nCrills to herb, to dope I lace brothas\nButter wounds, I bless the spend-er, but test\nI bend or waste mothaf*ckers, rules are broke\nGet smoked free of charge\nWe not drugs but hot slugs, see I'm Large like Mister\nI gots no shame, irrational nigga, the cash clouts\nShit ain't no game, it's more like a national past time\nYour sales pitcher, down the pipe\nCome get a hit, I never fail to get your clown types\nI never quit persuing these crabs, recruiting rehabs in churches\nMy search is ongoing, but yo f*ck it I want the dough in\nCan I please this crime, cool shit Genovese times two\nBe in drug store to thug lore\nIf you got some flow, and I got some flow\nYou gettin dough, baby doll and I'm gettin dough\nWe can chill on the hill, word bond\nAnd put the next man on like we supposed to put him on\nAiyyo, that's my son, I state that on my word\nPlace that nigga on a hundred-third, then make cream off of bird\nYo I'ma watch em, he come up short and I'm gon' smoke em\nEither way you could say I'm that bronc' that broke em\nHe wanna learn, I say give em a chance\nHe f*ck up and the devil'll be havin a last dance\nI think he'll do it right, he knows the consequences\nThe f*ck up after that, that shit's true extenses\nEvery time came we took out, he was the lookout\nWanna know how much I made?\nJust ask one of them niggas to pull the book out\nI state this on my word bond, just put him on\nIn time he'll come up shinin like a mothaf*ckin Don\nI Gets Money like Lil Kim\nCould take a facial, to make em paint skill forget it dunn\nMy shit'll win you jackpots\nCommishion be officially a crack spot wit a purpose\nI get my service then niggas serve us\nA neighborhood infested, that's the good investment\nI peeps your operation, let a nigga give me most high\nI never been arrested, but expect the unexpected\nWit full pre-meditation, when I run in wit po-nine I freaks the amnesia\nOr maybe like I be strung out\nCatchin a damn seizure, f*ck it I bites my tongue out\nNuttin to lose, cousin your crews a top notch, Lex and Benz\nRun through niggas blocks like hop scotch\nI'm sayin, complete and total detriment to society\nYo, a match made in hell, word is bond\nA wonderful day for the organization\nIt's just gon' be perfect for everybody involved\nYou get money, I get money, everybody get money\nEverybody shine, as neighborhoods decline\n(\"How could anything go wrong?\")\n(\"Whooooaaaa\") (\"How could anything go wrong?)", "year": null}]}