{"artist": "Porta", "songs": [{"album": "Trastorno bipolar", "title": "Confesiones", "image": "https://images.genius.com/ec7576ec2a69ce3191bf6b35e2d3e238.953x953x1.jpg", "lyrics": "[Letra de \"Confesiones\"]\n\n[Intro]\n-Hola, hijo\n-Padre, he venido a confesarme\n-Ven conmigo\nAve María Purísima ¿Qué tienes que contarme, hijo?\n\n[Verso 1]\nPadre, he pecado y confieso, no busco perdón\nOdio a Dios sobre todas las cosas y esa es mi primera razón\nDe visitarte a ti, puto pederasta\nLa Casa del Señor es de los negocios que mueve más pasta\nY si no díganselo al Papa\nCon su capa de razo y oro (Yuh) las más grandes mentiras tapa\n¿Rezar por ayudarme? Me mienten (Me mienten)\nDios no es más que la fe por el miedo que sientes\nY si no fallan mis matemáticas\nLa religión no ayuda, mientras millones se mueren en África\n¿Y qué hace él para evitarlo? (¿Eh?)\nY encima ¿Si no es para bien, no puedo ni nombrarlo?\nDictador que expulsó a Satanás del Edén, borracho de poder\nY en serio ¿Aún pretendes que yo crea en él?\n¿El señor es bondadoso? Discrepo\nNo me arrepiento, no lo siento\nDe haber cumplido solo dos de los diez mandamientos\n\n[Coro]\nPadre, he llegado a una conclusión\nOdio todo lo relacionado con la religión\nTe juro por Dios, que yo no busco tu perdón\nLas puertas del cielo me han cerrado por esta confesión\nPadre, he llegado a una conclusión\nOdio todo lo relacionado con la religión\nTe juro por Dios, que yo no busco tu perdón\nLas puertas del cielo me han cerrado por esta confesión\n\n[Verso 2]\nEstate tranquilo, todavía no he matado\nPero cuántos lo hacen mientras él se queda de brazos cruzados\n¿Y dices que nos quiere a todos por igual?\nLa Biblia es una gran historia, pero no es una historia real\nNo existe persona que se libre de mentir\nY yo el primero, mensajero seré sincero para ti\nHijo de puta, dime ¿Qué ha hecho por mí el cristianismo? (¿Eh?)\nPura ficción que alcanza alto nivel de realismo\nHe pecado y algunos me llaman inmaduro\nY es que a menudo suelo tener pensamientos impuros\nPero a mí me domina la desidia (Sí)\nClaro que deseo bienes ajenos (¿Por qué?)\nYo también siento envidia\nRobar sube mi adrenalina, otros lo necesitan de verdad\nProhibido buscarse la vida, tu única salida es su piedad\nBien o mal, dudas al elegir un lado\nSe implora piedad al único resucitado\n\n[Coro]\nPadre, he llegado a una conclusión\nOdio todo lo relacionado con la religión\nTe juro por Dios, que yo no busco tu perdón\nLas puertas del cielo me han cerrado por esta confesión\nPadre, he llegado a una conclusión\nOdio todo lo relacionado con la religión\nTe juro por Dios, que yo no busco tu perdón\nLas puertas del cielo me han cerrado por esta confesión\n\n[Verso 3]\nNunca pensé en irme virgen al matrimonio\nY juro que antes de morir pactaré con el demonio\nTengo insomnio, porque me repugna que le recen\nPorque es un ser que no se lo merece (¡Le odio!)\nY envidio al ignorante que aún confía en el de arriba\nPadre, va a resultar que en el altar, sólo gasta saliva (¿Qué?)\nSolo decís mentiras (Sí) Para atraer adeptos\nA la Casa del Señor y eso no es hacer lo correcto\nNo existen los milagros, sólo la fuerza de voluntad\nMe siento encerrado como en la casa de Fermán\nYo jamás tendría que haber nacido\n¿Es un castigo sin destino?\nLa vida no tiene ningún sentido\nY no santifico las fiestas, pero celebraría\nLa muerte del Señor, si existiera, te juro que me alegraría\nHonro a mis padres, pero no lo hago por él\nPorque son lo que más quiero, a Dios jamás le seré fiel\n\n[Coro]\nPadre, he llegado a una conclusión\nOdio todo lo relacionado con la religión\nTe juro por Dios, que yo no busco tu perdón\nLas puertas del cielo me han cerrado por esta confesión\nPadre, he llegado a una conclusión\nOdio todo lo relacionado con la religión\nTe juro por Dios, que yo no busco tu perdón\nLas puertas del cielo me han cerrado por esta confesión\n\n[Outro]\nEsta es mi puta confesión\nYo ya me siento en paz conmigo mismo\nQue lo sepa el de arriba, si me escucha\nEsto es lo que pienso de ti", "year": "2009-10-06"}]}