{"artist": "Waka Flocka Flame", "songs": [{"year": null, "lyrics": "[Verse 1]\nI'm drinkin' champagne one-deep in my Phantom Ghost (Uh)\nBad bitch with me-with me, where my manners go? (Turn up)\nMy youngin' sick-sick, where the antidote? (They geekin')\nAy, man, that's your top? Bust your cantaloupe (Pussy)\nHe fought a six and he still sellin' dope (OT)\nHow the fuck you ballin' with a car note? (How the fuck?)\nI'm in the trap, real shit, where the felons go (Squad)\nCurry never had a job, he always used a bow (With it, with it)\nThem youngins run up in your house, what it's hittin' for?\nNo mask just to let you know who did it, ho (Bow)\nI'm from Riverdale, all I know is get it in (Where it at?)\nI got weed, I got hotties, what you tryna spend?\n\n[Chorus]\n50K for a show and my niggas sellin' sacks\nShe a red-bottom bitch, Versace shirt, Birkin bag\nI'ma get money nigga, don't use a card or keep a tab\nBefore I leave my fuckin' house, grab my pistol and my flag\n50K for a show and my niggas sellin' sacks\nShe a red-bottom bitch, Versace shirt, Birkin bag\nI'ma get money nigga, don't use a card or keep a tab\nBefore I leave my fuckin' house, grab my pistol and my flag (Whoo Kid)\n50K for a show, 50K for a show\n50K for a show, 50K for a show\n50K, 50K, 50K, 50K\n50K for a show and my niggas sellin' sacks\n\n[Bridge]\nTurn up\nTurn up\nBricksquad\n\n[Verse 2]\nMy foreign car painted flat back (Turn up)\nMy girl hopped out, ass fat (Damn)\nPaparazzi keep flashin' pictures (Flocka)\nBroke niggas lookin', wanna be these niggas (Pussy)\nFour grams in my Backwood (I'm smokin')\nMillionaire nigga still keep it hood (Riverdale)\nPaid a extra sixty for that steel hood (Haha)\nPhantom Ghost have a nigga livin' good (Turn up, turn up)\nI bet your bitch want a nigga (Ay, come here, shawty)\nI bet she wanna fuck a nigga (Ay, come here, shawty)\nNever be a broke nigga (Damn)\nShe like, \"Fuck gold\", shawty, she a platinum digger (Flocka)\n\n[Chorus]\n50K for a show and my niggas sellin' sacks\nShe a red-bottom bitch, Versace shirt, Birkin bag\nI'ma get money nigga, don't use a card or keep a tab\nBefore I leave my fuckin' house, grab my pistol and my flag\n50K for a show, 50K for a show\n50K for a show, 50K for a show\n50K, 50K, 50K, 50K (Let's get ready to rumble)\n50K for a show and my niggas sellin' sacks\n\n[Outro]\nTurn up\nTurn up\nBricksquad", "image": "https://images.genius.com/189808028ff3721b725ccb6dc4c3e8ae.1000x1000x1.jpg", "album": "The Turn Up Godz [Spring Break Edition]", "title": "50K (Neon Dreams Remix)"}]}