{"songs": [{"title": "For You", "album": "Perfect Timing", "year": "2017-04-14", "image": "https://images.genius.com/46a8d88cbf18555315ca17d0d54d07c4.800x800x1.jpg", "lyrics": "[Chorus]\nBaby why you trippin', I be right here for you\nI be right here for you\nAnything that you want I will provide that for you\nI provide that for you\nYou know I got bitches, never put none 'em before you\nNever put them before you\nI get you everything that you want\nAll I ask that you don't blow my phone up\n\n[Verse 1]\nBaby I'm in love, I admit it\nI know that you think I want to hit it\nBut baby I ain't got time for no visits\nBut baby when I get some time we gon' kick it\nBaby we gon' live it all the way up\nJust stay down for me, I'm on my way up\nThem other bitches already done changed up\nBaby is you real or you gon' change up?\nFuckin' with a nigga like me dangerous\nWould you still be here if I got banged up?\nMan I been through that before, they changed up\nNow they be like why he actin' famous?\nBaby would you ride for a nigga?\nGet on top and do the job for a nigga?\nIf I need you to run to a nigga (would you run?)\nBaby tell me you gon' run to a nigga (you better run)\nIf you need me I'ma come for you baby (here I come, here I come)\nI'ma be right there\nIf you need me I'ma come to you baby (here I come, here I come)\nI'ma be right there\nBaby why you trippin', I ain't got time for that\nI been tryna get it on my grind for that\nTold you pull up, you trip, never minding that\nI ain't never answer that, I'm twine with that\nYou say that you gone well then I'm fine with that\nI will never trip, I'm never calling back\nI can never fall in love with you no more\nI done gave you all of that\n\n[Chorus]\nBaby why you trippin', I be right here for you\nI be right here for you\nAnything that you want I will provide that for you\nI provide that for you\n\n[Verse 2]\nForgi's on your whip, I'ma tryna slide on\nI been tryna kick it with a rider\nBaby I be busy, I be tied up\nYou ain't gotta love me, just don't lie though\nWe gon' take them trips 'cause ain't nobody else as fly as us\nBaby we gon' let 'em have it\nWe go where they can't go\nPimpin', where'd my cane go?\nI'm the same lil nigga, I ain't changed though\nThey get salty when I pulled up in that Range Rover\nYeah, yeah\n\n[Chorus]\nBaby why you trippin', I be right here for you\nI be right here for you\nAnything you needin', I provide that for you\nI provide that for you\nYou know I got hoes, I never put none 'em before you\nNever put none 'em before you\nBaby you my world and I swear I adore you\nAnd I swear I adore you\n\n[Verse 3]\nLate nights, call on the phone\nYou say where I'm at, I'm on the way\nTwo hours later you be callin'\nThought you told me you was on the way\nTell you I got caught up, I got busy\nBut I had another bitch with\nStill when I get it there you gon' get it\nSoon as I pull up she gon' get it\n\n[Outro]\nI ain't got no time for these bitches 'cause I'm on my grind\nBaby are you trippin', I been on my grind (I'm grindin')\n4PF, you digg?"}], "artist": "Lil Baby"}