{"songs": [{"year": "2016-10-27", "title": "Photosynthesis", "image": "https://images.genius.com/fd18d90f88a239743c1ad2caf0ed2a60.496x497x1.png", "lyrics": "[Produced by Phoelix and Saba]\n\n[Intro: Jean Deaux]\nGot it, I got it, oh\nSay what you're looking for, 'cause I got it, yeah, ayy\nI got it, I got it, oh\nI got it, yeah\n\n[Hook: Jean Deaux]\nOh yes I made it alive, Lake Shore Drive, headed to paradise\nIn this moment of mine, I can't recognize\nOr see that the glare is bright\nAnd what you compromise, I almost died\nI doubt the water is red as mine\n\n[Verse 1: Saba]\nAyy, how you lonely in a room with God?\nNever slow up, not even a pit stop\nPraying my niggas'll never get caught\nOvercame it all, like I'm some big shot\nWas taught to be a man, up to the wrist watch\nTo the collar shirt tucked, with the front pocket\nPart of adolescence when they go blossom\nWhen your stars align, I hope there's no comet\nSo far it's...\nOh yes, I made it alive, on the West Side, still at my momma house\nThe kids on my conscience now, coz the youth dying and it's just more common now\nCommon ground, stuck through it all like we Carmelo\nComin' down, high offa life, arrive unannounced\nSummonin', numbin' the pain of when I'm in doubt, high school\nMy head in the clouds, like I learned about\n\n[Hook: Jean Deaux]\nOh yes I made it alive, Lake Shore Drive, headed to paradise\nIn this moment of mine, I can't recognize\nOr see that the glare is bright\nAnd what you compromise, I almost die\nI doubt the water is red as mine\n\n[Post-Hook: Jean Deaux & Saba]\nWhat are you looking for?\nI got it (I got it)\nI got it (I got it)\nAll the things you adore\nI got it (I got it)\nI got it (I got it)\n\n[Verse 2: Saba]\nRunnin' through my city like a tour bus\nHopin' one day I can have a tour bus\nI can see the planets from my window sill\nAnd I tend to tell what is honest\nI don't wanna fight no one, no contest\nI just wanna undress my conscience\nI just met a killer that's bent in his ways\nTry to raise a family with minimum wage, what can I say?\nBesides the demons, it's reality for the people that we love\nAnd we are the ones that will team up and tee up the party\nDead end the school, bet that they'll show up real tardy\nThe audience awfully ready and rowdy\nI meant it if I said it, you get in writing\nGot into a science, but write with the lightning\nLike soil, I'm grounded, the seed has just sprouted\n\n[Hook: Jean Deaux]\nOh yes I made it alive, Lake Shore Drive, headed to paradise\nIn this moment of mine, I can't recognize\nOr see that the glare is bright\nAnd what you compromise, I almost die\nI doubt the water is red as mine\n\n[Post-Hook: Jean Deaux & Saba]\nWhat are you looking for?\nI got it, I got it (show what you want)\nI got it, I got it (show what you want)\nAll, the things you adore\nI got it, I got it (show what you want)\nI got it, I got it (show what you want)\nShow what you want, show what you want\nShow what you want, show what you want\n\n[Outro: Billy Williams]\nI just wanna be the plug so my people can eat\nI just wanna play soccer on rooftops in Tokyo\nI just wanna find somewhere I don't gotta put a face on for people no mo'\nYours truly, Billy Williams", "album": "Bucket List Project"}], "artist": "Saba"}