{"songs": [{"image": "https://images.genius.com/670d09da3481911f94fb0c1c7e260e7e.1000x1000x1.jpg", "title": "When I Grow Up", "album": "The Search", "year": "2019-06-27", "lyrics": "[Verse 1]\nYeah, when I grow up, you know what I wanna be?\nTake a seat, let me tell you my ridiculous dreams\nI wanna rap, yeah, I know it's hard to believe\nAnd I can tell you're already thinkin' I will never succeed\nBut I'm okay with it, I admit the lyrics are weak\nI've been workin' on 'em, I'll be good eventually\nI understand you gotta crawl before you get to your feet\nBut I been running for a while, they ain't ready for me, ahh\nI know this prolly isn't really realistic\nAnd honestly, I might not ever make a difference\nBut that don't make a difference, I'ma have to risk it\nI've been crunchin' numbers, you ain't gotta be a mathematician\nTo see the odds ain't rootin' for me\nI can't lie though, it's kinda how I like it to be\nThe underdog, yeah, you prolly think you know what I mean\nBut what I'm saying is they ever push me, I'm gonna swing, yeah\nI could go to college, get in debt like everybody else\nGraduate and prolly get a job that doesn't pay the bills\nThat don't make a lot of sense to me, forget the Happy Meals\nI don't like the dollar menu, I would rather make a meal\nHuh? Make a mil'? Nah, I said make a meal\nHome-cookin', get the grill, how you want it? Pretty well?\nEverything I see is overdone to me, I'm not Adele\nBut I'ma get a record deal and say hello to mass appeal\n\n[Chorus]\nWhen I grow up, I just want to pay my bills\nRappin' about the way I feel (Oh, yeah)\nI just want to make a couple mil'\nLeave it to the fam in the will (Oh, yeah)\nI just want to sign a record deal\nMaybe buy a house up in the hills (Oh, yeah)\nMight not be the best in my field\nBut I guarantee that I'ma die real\nWhen I grow up\n\n[Post-Chorus]\nYeah, ayy\nWhen I grow up\nYeah, yeah, ayy\n\n[Verse 2]\nI'ma make 'em notice me, rhymin' like it's poetry\nEverything I oversee, I just like to overthink\nMockin' me, you pay the fee, no return and no receipts\nThose of you that don't believe, quiet, you don't know a thing\nQuiet when I'm tryna sing, quiet when I'm making beats\nQuiet when I'm tryna think, sorry, I don't mean to scream\nI just feel like no one really gets me and it's sad to see\n'Cause someday I'ma grow up and show all of you it's meant to be (Yeah)\nAnybody wanna hear me rap? \"No\"\nCome on, let me play a couple tracks, \"No\"\nCome on, I can spit it really fast, \"No\"\nYou think I should throw this in the trash? \"No\"\nTricked ya; haters, go away before I hit ya\nI am not a beggar or a kiss-up\nYou don't understand? Well, I forgive ya\nI am not a quitter, you ain't really think that, did ya?\nMaybe someday I could even be up on the radio\nHave a tour bus and maybe even play a couple shows\nEverybody in the crowd singing every word I wrote\nTellin' me that I am not the only one that feels alone\nHuh? You feel alone? Yeah, I kinda feel alone\nWonder if that feelin' ever goes away when you get old\nWill I ever make it as an artist? I don't really know\nMight not make a lot of dough\nI'ma have to try it, though\n\n[Chorus]\nWhen I grow up\nI just wanna pay my bills\nRappin' about the way I feel (Oh, yeah)\nI just wanna make a couple mil'\nLeave it to the fam in the will (Oh, yeah)\n(Leave it to the fam in the will)\n(Yeah, yeah, yeah, yeah)\nI just wanna sign a record deal\nMaybe buy a house up in the hills (Okay, oh, yeah)\nMight not be the best in my field (Ayy, ayy, yeah)\nBut I guarantee that I'ma die real\nWhen I grow up\nI just wanna pay my bills (Woo)\nRappin' about the way I feel (Oh, yeah)\n(Yeah, the way I feel)\nYeah, I just wanna make a couple mil' (Ayy, couple mil')\nLeave it to the fam in the will (Oh, yeah, to the fam in the will)\nI just wanna sign a record deal (Woo)\nMaybe buy a house up in the hills (Oh, yeah)\n(House up in the hills)\nYeah, I might not be the best in my field\nBut I guarantee that I'ma die real\nWhen I grow up\nWhen I grow up"}], "artist": "NF"}