{"songs": [{"title": "Break A Bitch Neck", "lyrics": "[Intro]\nA: Akinyele, you know I break a bitch neck!\nK: Kool G. Rap, you know I break a bitch neck!\nA: Yeah break a bitch neck!\nK: Break a bitch neck!\nA: Break her neck, aiyo G catch the fucking wreck, set it! (come on)\n\n[Verse 1: Kool G. Rap]\nI can't stand a bitch so I don't treat 'em I don't date 'em\nThey want a nigga stuck, so I just fuck 'em like I hate 'em\nHoes wanna impose, like they know me or they knew me\nBut bitch you never blew me, so don't say a fuckin' thing to me\nCause I'm too fly to say hello HA HA\nSee you later, or good-BYE\nBitch I wish you would die\nA: But the bitches look so good\nBut it don't mean I give a fuck\nIf there's one less bitches out the neighborhood\nBecause I never did respect 'em\nYou know you could never get from\nKool G. Rap just a swift kick in the rectum\nChecked 'em, be careful of the chick that you pick\nBecause mad niggas bitches\nThey put they lips around a nigga dick (Come on niggas)\nThen they tell me how my dick is so much bigger (Uh)\nSwallow my nut up and don't be call me (Kiss-The-Nigga?)(Ah)\nThe mac slap-a-bitch, Kool G. Rap\nBitch runnin' off for the track\nThen a bitch gotta get slapped\nSo don't be a nigga sex-slave bitch\nDon't try to be brave bitch\nYou be a dead bitch in the grave bitch\nBitches be think a nigga come and beef out\nDumb bitch this is G's house\nBitch I slap your motherfucking teeth out (Aight, my man)\nBring it on bitch you want the drama bitch\nI left the (homa?) bitch, you broke as (lever bomber?) bitch\nI slap your mama bitch (Whoo-hie)\nPull out my dick and start suckin' bitch\nOr keep on truckin' bitch, you stupid motherfuckin' bitch!\nHog bitch you come and stalk bitch\nYou got a lot of heart bitch\nBut you to me you ain't too smart bitch\nSlap a bitch, I got a bed full of bitches\nTry to steal a bitch, you get a head full of stitches\nI'm hittin' bitches with a tec\n\n[Hook]\nK: Aiiyo break a bitch neck, break a bitch neck\nA: Come on!\nK: Break a bitch neck!\nA: Break a bitch neck!\nK: Break a bitch neck!\nA: Come here bitch, let me break your neck!\nK: Yeah break a bitch neck!\nA: Break a bitch neck!\nK: Break a bitch neck, aiiyo Ak catch some motherfucking wreck\n\n[Verse 2: Akinyele]\nYo, beatin' bitches up ain't nothing new to me\nWhether you're down with social security\nOr you're just hittin' puberty\nAge ain't nothing but an agenda\nYou young (grab your gums?), and if you're old\nYou better hold on to your (....ges?)\nDon't come talkin that slappin' shit\nJust cause you're a woman, Miss\nDon't think that it can't happen bitch\nI make, bitches panic and sweat for their life\nIt's panicked bitches mostly get\nStabbed to death with they own knife\nDark skin bitches turn black and blue\nI cruise around town, and bruise their ass with a damn .22 (Bitch)\nCali bitches get the gat that I'm blastin'\nA bitch stay slagged\nBuy Sprinklers so Imma dope em' when they askin'\nGet your man and his wolfpack\nI play em like Pity Pat\nEach and everyone of them bitch niggas get smacked\nMartial arts bitches get me fed\nBut she's long and gone\nYou say: Return of the living dead (Huhh)\nKarate shit don't last\nMiss Hong-Kong bitch\nI break my foot up off in your ass (Yeah)\nAnd drunk bitches I keep 'em falling\nFirst I turn em' into alcoholics\nMake them think St. Ides is a Church\nAnd Jewish bitches they know the settings\nCause I be stompin' they ass\nJust like the glass at the weddings\nAnd dancin' girls get me pissed\nI'm the first spectator to yell out:\nGo stupid bitch! Go stupid bitch!\nAin't nothing good about me, girlfriend\nYou want a good boyfriend, check the Marines\nI heard they got a few good men (Yeah!)\nOver here you don't get no love (Fuck that)\nA member of the bitch haters club\nI don't kiss or don't puck or hug bitch\nYou stuck up bitch\n\"Don't call me a bitch\"\nOh shut the fuck up bitch!\nYou don't catch no respect (hell no!)\n\n[Outro]\nA: Break a bitch neck!\nA: Break a bitch neck!\nK&A:Yeah ahahaha, word up!\nA:See that fuckin' bitch\nK:Bitches must be fuckin' crazy (Bitch, bitch)\nYou must be out your fuckin' mind hoe (Bitch, bitch)\nSuck my motherfuckin' dick!(Bitches ahaha)\nA:You look like thaaaat\nK:Bitch haters come, come and act up baby (Stop me)", "year": null, "album": null, "image": "https://images.genius.com/9930b12b428e16aeaa47d79eb5259bb4.300x250x1.jpg"}], "artist": "Akinyele"}