{"songs": [{"lyrics": "[Produced by Ski Beatz]\n\n[Chorus: Nas]\nPresidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for dead fuckin' presidents to represent me (whose...)\n\n[Intro: Jay-Z]\nRock.. on, Roc-A-Fella y'all\nThe saga continues.. (what the fuck?)\n\n[Verse 1: Jay-Z]\nAhh, who wanna bet us that we don't touch lettuce?\nStack cheddars forever, live treacherous, all the et ceteras\nTo the death of us, me and my confidants, we shine\nYou feel the ambiance, y'all niggas just rhyme\nBy the ounce, dough accumulates like snow\nWe don't just shine, we illuminate the whole show, you feel me?\nFactions from the other side would love to kill me\nSpill three quarts of my blood into the street, let alone the heat\nFuck 'em, they hate a nigga lovin' his life\nIn all possible ways, know the Feds is buggin' my life\nHospital days, reflectin' when my man laid up\nOn the uptown high block, he got his side sprayed up\nI saw his life slippin', this is a minor setback\nYo, still in all we livin', just dream about the get-back\nThat made him smile, though his eyes said \"pray for me\"\nI'll do you one better and slay these niggas faithfully\nMurder is a tough thing to digest, it's a slow process\nAnd I ain't got nothin' but time\nI had near brushes, not to mention\nThree shots, close range, never touched me, divine intervention\nCan't stop I, from drinkin' Mai-Tai's, with Ty-Ty\nDown in Nevada, ha ha, poppa, word life\nI dabbled in crazy weight without rap, I was crazy straight\nPartner, I'm still spendin' money from '88, what?\n\n[Chorus: Nas]\nPresidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for dead fuckin' presidents to represent me (whose...)\n\n[Verse 2: Jay-Z]\nGeyeah, know what?\nI'll make, you and your wack mans fold like bad hands\nRoll like Monopoly, advance\nYou're coppin' me like white crystal\nI gross the most at the end of the fiscal year than these niggas can wish to\nThe dead presidential candidate\nWith the sprinkles and the Presidential, ice that'll offend you\nIn due time when crime flees my mind\nAll sneak thieves and player haters can shine\nBut until then, I keep the trilliant cut diamonds shinin' brilliant\nI'll tell you half the story; the rest, you fill it in\nLong as the villain win\nI spend Japan yen, attend major events\nCatch me in the joints, convinced my iguanas is bitin'\nJ-A-Y hyphen, controllin', manipulatin'\nI got a good life, man, pounds and pence\n'Nough dollars make sense, while you ride the bench\nCatch me swingin' for the fence\nDead presidents, ya know? Uh-huh\n\n[Bridge: Nas]\nDead fuckin' presidents to represent me (whose...)\nDead fuckin' presidents to represent me (whose...)\n\n[Chorus: Nas]\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for dead fuckin' presidents to represent me (whose...)\n\n[Verse 3: Jay-Z]\nHa ha, yeah (ha ha) yeah, so be it\nThe Soviet, the Unified steady flow\nYou already know: you light, I'm heavy, roll heavy dough\nMic-macheted your flow\nYour paper falls slow like confetti, mine's a steady grow, perico\nPay 580 for blow, better believe I have 1160 to show\nMy dough flip like Tae-Kwon\nJay-Z the icon, baby, you like Dom?\nMaybe this Cristals'll change your life, huh? Roll with the winners\nHeavy spinners like hit records: Roc-A-Fella\nDon't get it corrected, this shit is perfected\nFrom chips to chicks to strippin' a Lexus\nNaked without your gun, we takin' everything you brung\nWe cakin', you niggas is fakin', we gettin' it done\nCrime family, well-connected, Jay-Z\nAnd you, fake thugs is unplugged like MTV\nI empty three, take your treasure, my pleasure\nDead presidentials, politics as usual—BLAOW!\n\n[Bridge: Nas]\nDead fuckin' presidents to represent me (whose...)\nDead fuckin' presidents to represent me (whose...)\nDead fuckin' presidents to represent me (whose...)\nDead fuckin' presidents to represent me (whose...)\n\n[Chorus: Nas]\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for presidents to represent me (get money!)\nI'm out for dead fuckin' presidents to represent me (whose...)", "title": "Dead Presidents II", "image": "https://images.genius.com/29af67d9261dd90dadd43f96370b477d.1000x1000x1.jpg", "year": "1996-02-20", "album": "Reasonable Doubt"}], "artist": "JAY-Z"}