{"songs": [{"year": null, "album": "Who Is KB?", "image": "https://images.genius.com/cc0b72e73e609b19ba9fe03fa5eac73b.757x759x1.jpg", "title": "Head to the Heavens", "lyrics": "[Hook (x2)]\nYou can knock me down\nHe gon' pick me up\nWho can keep me down\nWhen He gon' get me up?\nI got my head to the heavens\nGot my head to the heavens\nI got my head to the heavens\nGot my head to the heavens\n\n[Verse 1]\nAy, I done lost my mind and I know it's true\nYou see me but I don't see You\nMy eyes are where the Savior's at, the leadin' role in how I act\nBut it ain't no act, Jack Black, I live for His Son\nThe star of my movie, I'm truly owin' my will, son\nThere'll be no sufferin', hated for makin' much of Him\nChasin' us through the jungles hear \"Allahu Akbar\" with guns and clips\nLeukemia in our daughters, cancer came through and took our lives\nWhile the world says that's a crooked God, we know He will be glorified\nYou wit' me calculatin' my steps, I count on You\nIn the womb You knit me with intensive care, call it ICU\nSo when we suffer let me take it and show the how much we value Him\nThough the body they may kill, the truth of God abideth still\n\n[Hook (x2)]\n\n[Verse 2]\n(Yo my marriage)\nI done lost my mind and I know it's true, who marries at twenty-two?\nDon't you wanna live your life? The last thing you need is a wife\nOne woman all ya days, sounds like a ball and chain\nWell, if my wife's a ball and chain then boy I love bein' a slave\nYou don't know my aim but I'm on display, showin' the world how He loves His church\nAnd it ain't easy, look at the cross homie, you think love doesn't hurt?\nThey treat they women like Mickey D's, select a chick and make 'em strip\nWe lookin' for a help meat I guess Michelle's my prime rib\nYeah, that's where I be on light to my home where I belong\nWanna give my sons and daughters more than child support and chromosomes\nGirl, I made my vows a I.O.U. regardless if I'm lovin' it\nDivorce is not an option, I will die keepin' this covenant\n\n[Hook (x2)]\n\n[Verse 3]\nThey say livin' for Christ is to limit your life\nBut when did we start takin' wicked's advice?\nLivin' for nights, fights, women are nice\nWhen the riches of life are in it in Christ\nIf your vision is right\nYou don't have to fear 'bout the end of your life\nIt's the end of your night, you enter the light\nYou go to be with the One Who is bendin' your sight\nI used to be that boy, lovin' my sin is a trap boy\nTrap boy, I would put I before everything, like a Mac store\nI will be mastered by that boy, puffed up, bad boy\nFlesh get whatever it ask for\nUnless I keep my eyes on that Lord, Jesus\n\n[Hook (x2)]\n\n[Outro]\nEternal perspective baby\nAs we head to the heavens\nWe keep our head to the heavens\nFocus on Jesus, Colossians 3:2\nWas it Colossians 3:2 or 3:3?\nLet me see..."}], "artist": "KB"}