{"artist": "Ice Cube", "songs": [{"title": "It Takes a Nation", "lyrics": "[Ice Cube]\nThere are seven known wonders of the world\nYeah, hehe, you about to witness the 8th muh'fucker\n\nI got King Kong in my trunk, King Kong in my doors\nMy nuts play ping-pong from the noise\nYou can hear me from a block away\nI'm sittin next to yo' ass and can't hear, what you got to say\nMy shit is loud, my ears is ringin\nMy paint job is wet, my chrome is gleamin\nI feel like a vet ballin on these rookies\nAn old school bully, you must have played hooky\nI bring it like a bookie my aggression is depressin\nDon't give a motherfucker time to learn his lesson!\nA LUNATIC~! Y'all know what I represent\nThe only rapper who wanna fistfight the President!\n\n[Hook: repeat 4X]\nIt take a nation of niggas to hold us back\n\n[Ice Cube]\nWhen I bang this is dangerous, niggas go brainless\nSo bang this with the fo'-five stainless\nAnd understand that you lookin at the famous\nWest coast rapper, who act like a anus\nHollywood! They thought they could tame this\nPitbull, but I know what the game is\nThem fuckers cheat like a NBA ref\nIf you smoke one they'll electrocute you to death\nI got God on my intellect, Godzilla by the neck\nWhen a nigga come through, who you wanna holla at\nGhost writers hit the deck, when your boy got a tec\nWhere the fuck is, Afrika, Bambaataa at?\nWe need to take it back, fuck Viacom\nClear Clear Channel, and Radio One\nYou motherfuckers programmed by the programmers\nThat's why you gettin locked up by the do' slammers\nNot me!\n\n[Hook]\n\n[Ice Cube]\nThey music so fluffy, I'mma stay gutter\nThat shit is kind of popcorn, my shit is so butter\nMy style never change, in 22 summers\nStraight independent, and doin my numbers\nThis shit don't sell, you know I'm still paid\nSo sourpuss niggas, can drink lemonade\nI'm doin it for the love, you doin it because\nYou need that advancement to spend on them dubs\nI don't need a penny, but I need many\nDon't worry about my money boy cause I got plenty\nYou muh'fuckers worry about flossin so much\nYou don't know the fundamentals you forgot how to brush!\nThese 32 teeth, will give yo' ass grief\nBite you like a Fatburger if you got beef\nSo who's it gon' be? Your favorite MC\nYou scared of the government they scared of me\nNow what?\n\n[Hook] * except last line changed\n\n* It take a nation of niggas and streets of crack {*echoes*}", "image": "https://images.genius.com/284f4145950de6c7f91a598379e2bb40.1000x1000x1.jpg", "album": "Raw Footage", "year": "2008-08-19"}]}