{"artist": "Ace Hood", "songs": [{"title": "Father’s Day", "album": "Starvation 5", "year": "2016-06-17", "lyrics": "[Verse 1]\nTears still rolling down my face\nSimple fact it being Father's Day\nMy confidence was confiscated\nMore confrontations, shortened patience\nI'm aggravated, agitated\nHate to say this, I ain't been a father lately\nAnd I feel like I been a screw up\nBut then again everybody needs to tune up\nSelf observation, conversations\nChoices made, I'm tryna find some confirmation\nDamn, how the fuck did I get here though?\nMy own pops wasn't round to see his kids grow\nAnd I be damned if I follow where his foots go\nMy baby mom took my kids about a year ago\nI can't lie, shit is hard, she don't get it though\nEvery day the kids asking where their daddy go\nShit, still praying for a better way\nI visualise good times when I meditate\nTo be alone on my own on this Father's Day\nTears still rolling down my face\nTo God I pray\nTo each his own, I can't condone\nI compensate, the weed relates\nAnd freeze the mind of my mistakes\nI smoke and drink, I contemplate\nI start to think, I hate my baby mama\nBut that ain't true, but that ain't you\nWear my shoes, I bet you couldn't fit in 'em if you tried to\nI'm sick of lies, I'm tired of what I'm going through\nIt all starts with your kids not knowing you\nAm I putting too much time in this vocal booth?\nAm I spending too much time with my new boo?\nOr do you do it for your fam or the new coupe?\nHolidays of change ain't what I'm used to\nI was tryna refrain from doing court moves\nNever, ever a fan of doing court rooms\nToo many regrets, it's all in my head\nIt's really not true cause all that I do was for my kids, damn\nLiving on edge, I'm praying for help\nIt's Father's Day and I'm feeling like I hate myself\nI hate this fame and sometimes, I hate this game\nBut it's gon' change, yeah yeah, this shit gon' change\n\n[Hook]\nHappy Father's Day\nHate it had to be this way\nHappy Father's Day\nI hate it had to be this way\nMy heart beats this way\nThat why my heart beats this way\nI hate it had to be this way\n\n[Verse 2]\nAs the tears rolling down my eyes\nOne day, wonder if my girl think it's kinda weaker to cry\nBaby mom sending threats, tryna seek and divide\nAttitude hella rude cause I'm happy inside\nMet a queen, Lord knows he just give me a sign\nWho gon' grab my hand? Who gon' wipe my tears?\nShe gon' pat me on the back like it's alright, my dear\nStill wishing every day I had my grandma here\nBut hey, that's the way that life is though\nWe all living just to die, the way this script goes\nShit, no answers, screaming fuck cancer\nStaring at a pic of my son, he so handsome\nFirst born, my baby girl, it's so special\nFaceTime to see 'em smile and say I love 'em\nFirst Father's Day alone, I had to suffer\nStill counting blessings cause they ain't got to struggle, Lord\n\n[Hook]\nHappy Father's Day\nHate it had to be this way\nHappy Father's Day\nI hate it had to be this way\nMy heart beats this way\nThat why my heart beats this way\nI hate it had to be this way\n\n[Verse 3]\nSee a nigga going through\nMake a change what I'm going through\nSometimes people never understand 'til it all hits the fan\nShould have listened to 'em, warned you\nBut that's life and we never get to do it twice\nI understand not many of us ever get it right\nBut hopefully you kinda close before you see the light\nThe realest shit I ever wrote in my whole life\nYeah, and to my son and my beautiful daughter\nI'm sorry I wasn't better for you and your brother\nThat bad blood in between me and your mother\nWe both did things back and forth to each other\nI apologize, go and dry your eyes\nThere's gon' come a time when it's all aligned, daddy's singing you them lullaby's\nMe and baby boy, throwing up the high five\nAnd baby girl probably passing me the pompoms\nNot mine but on God's time\nStill wishing y'all was close cause I know the way that time flies\nOn this day I was really in my feelings\nRoll another blunt cause I been trying not to feel it\nTears falling down on the pad on what I've written\nPart of me just gotta forgive, my daddy missing\nCause I am nothing like him\nI'm so unlike you, going through it like them\nShit, growing up right in front of your eyes\nFar from the perfect that we seeking to find\nThere's a beauty in the struggle when you growing inside\nAll my insecurities just on a platter besides\nI'm alive, I'm alive\nAnd besides, shit, I'm alive\n\n[Hook]\nHappy Father's Day\nHate it had to be this way\nHappy Father's Day\nI hate it had to be this way\nMy heart beats this way\nThat why my heart beats this way\nLove y'all", "image": "https://images.genius.com/15e2634e9261a18b03c9fc88c7fcdd4c.791x791x1.jpg"}]}