{"songs": [{"image": "https://images.genius.com/75a265916a97836aa5ab08c709a44211.1000x1000x1.jpg", "album": "PSYCHODRAMA", "title": "Environment", "lyrics": "[Intro]\nWhat do you think people see when they look at you?\n\n[Verse]\nLook\nYou see our gold chains and our flashy cars\nI see a lack of self worth and I see battle scars\nHe has to be with twenty man when he wears jewelry\nAnd you see it as gangster, I see it as insecurity\nWhere I'm from, everybody wants to make it out\nBut nobody wants to see somebody make it out\nIt ain't about who came around but more about who stayed around\nBehind the scenes, they said God gave us eyes to see\nYou see the video vixens and all their pearly whites\nBut you don't see the dirty nights, long days and early flights\nYou see the deals and think all these rappers laughing now\nBut you don't get that if we weren't already, we're a target now\nYou see, all the groupie girls and think they're heaven sent\nI see twenty-five minutes worth of empty sex\nTo tell a lie, it wasn't my intention to objectify\nBut I can testify, I've seen some shit you couldn't rectify\nYou see this industry where everybody came up\nI see a bag of weird rappers and some fake love\nFake handshakes and fake spuds with fake comments\nWhere everybody covers costs but never pays homage\nThe scene turned on me, people tryna ruin me\nWhere most would see a problem, I'm seeing an opportunity\nTo drop a freestyle and kill them niggas that were booing me\nI made my haters watch and put the screw inside of scrutiny\nBeautifully, also, if I am attending\nSecurity's coming first like I was trying to shop at Duty Free\nWhere the fuck’s the unity?\nWhere I come from there's no class, forget truancy\nWe have got nowt in common\nThem niggas see a molehill and make a mountain from it\nThey see a Cuban and a whip, I see a house deposit\nHow to stop it?\nNiggas saw keys and went to trial for shottin'\nI saw keys, learned to play, and made thousands from it\nYou see the club poppin' when we do the show\nBut you don't see the studio, my life is not a movie, bro\nChampagne bottles and all the screaming girls\nIt's ironic how you'll never hear a scream for help\nFuckin' hell, why do you think we're going through the same thing?\nDepression when you make it, the pressure and the hatred\nYour people talk about you, you can't say shit\nThe moment that you ain't it\nThe labels are looking for replacements\nSame shit, people start forgetting what you've done for them\nEveryone in music's gonna take until there's nothing left\nYour fans are switching up on you\nAnd they don't know how tough it gets\nReading through your old comments, trying to feel some love again\nI see karma\nGo to work but God schemes harder\nI heard success can come quickly but it leaves faster\nSecrets are what my enemies have been after\nOnly L's I'm hiding in my closet have a V after\n\n[Outro]\nSo looking at it from another perspective, playing devil's advocate\nConsidering you know you're obviously becoming famous, so to speak\nBut you still deal with a lot of issues on a human level\nDo you ever just sit and wonder about the stories behind the people you meet day by day?\nDoes it make you feel grateful, in a weird way, for your life and problems?", "year": "2019-03-08"}], "artist": "Dave"}