{"songs": [{"title": "The Louisiana Purchase", "lyrics": "[Akir]\nWhere was FEMA? What do they gain from Katrina?\nAnd why it take so long to save us but so fast to clean up?\nWho's in charge of them green bucks?\nCause they supposed to give survivors least two G's plus\nI need much in answers; was it because, they live below standards\nAnd drugs ran rapid that it's quiet up in the cabinet?\nWho was on call, did they really drop the bomb?\nDid they say {fuck} it? We're reminded 'bout them damn walls\nCan we call 'em levees? Did the water get heavy and overrun the town\nOr did people come knock 'em down?\nAre they trying to help 'em out or trying to kick 'em out?\nWhen you see them come around to evacuate a house\nWho has insurance in one of the country's most poorest, communities?\nIsn't this country for you and me?\nSeparating families, destroying unity, conquer through divide\nAre they gonna help us survive?\nOr is it genocide, do they wanna help and all revive?\nOr will it be, gentrified? Watch the choppers in the skies\nNo supplies, devils in disguise, spinning stories on my people's lives\nStanding by while they just letting us die (die)\n\n[Immortal Technique]\nI feel like the whole world gone crazy\nThe stadium smells like {fucking} dead babies\nAnd old people, going through rigamortis\nWhile the government tortoise, slow to support us\nInstead they record us and give us self-righteous orders\nReporters implore us, not to break the law\nI saw a {bitch} talking on TV, I wanna break her jaw\nA teleprompter, can never describe what I saw\nThe phones are dead, no police and no E.M.T\nPowerless like we got hit, with an E.M.P\nIt reminds me of the days when we lived as slaves\nThey just denied the migrant workers, federal aide\nAnd people tell me poverty, doesn't have any color\nWell it does down here mother-{fucker}\nAnd now they talk about, rebuilding where nothing is working (Nothing)\nJust lawyers getting more contracts by Halliburton\n\n[Poison Pen]\nWe restored the French Quarter on some Mardi Gras {shit}\nSwerving down Bourbon - on some party town {shit}\nDrinking {fucking} liquor, I'm speaking real candid\nWho knew, N.O. would turn president land this\nDude got us looking savage - like newer reports\nGet the rich ones out, and ignore the warts\nScores of people perched on top roofs\n96 hours with no damn rule, but who the {fuck} wouldn't shoot?\n\"So would I\" says the cat\nBrother stranded, wife and seed on his side, {gat} on the lap\nNow anarchy, rule the street\nMayor cuss the government out, on the TV all you hear is bleeps\nDespair dro, some the same\nSuper dope synonymous with pain, ironically they change quotes the same\nI know firsthand I got blood (yeah) you heard from me\nSecond line been should be playing for eternity\n\n[Mojo]\nWalk with imagination, prepare for the devastation\nOf these poor people being displaced in our own nation\nNo food or water with four days waiting\nFearlessly they're flying over to assess the situation\nDirt they doing to my folks blatant\nSatan they causes, breaking they clauses, lying to our faces\nTake a step back, let's retrace this\nCats were breaking into stores cause they were running out of patience\nMost of them gunshots you heard about, yeah\nThey were pointed in the air cause the bullets were flares\nBut regardless if the media cares or not\nWe should still share a lot of truth, keep stirring the pot\nInto a spicy gumbo, dig deep, let your funds go\nNever know a storm might hit Flatbush or Ludlow\nWho do you think they'll save, them or us?\nMother Nature doesn't choose sides, cash flow does (that's right)", "year": null, "album": "Legacy", "image": "https://images.genius.com/ec568067b0f966b9ee18a0f87677e60e.1000x1000x1.jpg"}], "artist": "AKIR"}