{"songs": [{"year": "2019-09-20", "album": "Requiem For A Dream Deferred", "image": "https://images.genius.com/ab06fa058e6a40e16a762e584f6c95aa.690x690x1.png", "title": "Entertainment", "lyrics": "[Verse 1]\nI been lookin' for a means to an end\nI been tryna find peace once again\nMan I sound my lows with the highs\nIf it went into your soul, it's in your eyes\nThen it's best you keep those wide\nNever let that light inside you die\nNothin' worse than a dream that's been deferred\nI concur, I agree, I relate, true indeed\nGod speed, hope you find the right direction 'fore you make a wrong turn\nBridges burned, lessons learned\nWe still risin' from the rubble like a phoenix out the ash\nTime moves as the sand trickles down the hourglass\nGot these blindfolded bifocals, prayin' I don't crash\nIf I do, no regrets, it was a blast\nNothing lasts, can't move forward if you livin' in the past\nNever really been that sentimental\nYou can say I been a little temperamental\nTo the detriment of my inner sanctum, my sacred temple, my fragile mental\nIt's instrumental, [?], you get the sentiment\nI make it evident so that the universe can then leverage it\nI'm a testament of pure energies and how beautiful that this life can be\nI'm an example of true potential, reach\n\n[Hook]\nBackstab, is the world that we livin' in that bad?\nI survived in the terrordome, Mad Max\nA Rolex don't co-exist with a Timex\nA diamond in the rough, where the fuck you find them?\nI get a cheque, nigga you know I'ma blow it all\nI should save it, yeah I know you fuckin' know-it-all\nReal nigga shit, I see the fuckin' hoe in y'all\nLet me guess, you do this shit for entertainment, huh? Huh?\nYeah it's pretty entertainin' huh? Huh?\nYeah it's pretty entertainin' huh? Huh?\nYeah it's pretty entertainin' huh? Huh?\nYeah\n\n[Verse 2]\nI done been around the world, only seen a few faces I could recognize\nSome'll plot on your demise but the others are just surprised\nYou alive, survived and thrived\nInternally your drive is an engine with unlimited horsepower inside\nTake a look under the hood, what do you find?\nSomething sublime\nGettin' off your ass, gettin' on your grind, no that is not a crime\nYou gotta read between the lines and decipher the bullshit\nPractice what you preach, no pulpit\nBut don't you be comin' around with that foolishness\nThese niggas sellin' snake oil and hair-brained schemes to get rich quick\nGot a viper in your cypher I suggest you dismiss\nThat poisonous, venomous, envy that they carry with them and hidin' within\nI'm not here to enlighten mortal men\nThere's a glitch inside the matrix, this just a portal of sin\nThey got you believin' Jesus really had porcelain skin\nOr that it was even Jesus to begin, god damn\n\n[Hook]\nBackstab, is the world that we livin' in that bad?\nI survived in the terrordome, Mad Max\nA Rolex don't co-exist with a Timex\nA diamond in the rough, where the fuck you find them?\nI get a cheque, nigga you know I'ma blow it all\nI should save it, yeah I know you fuckin' know-it-all\nReal nigga shit, I see the fuckin' hoe in y'all\nLet me guess, you do this shit for entertainment, huh? Huh?\nYeah it's pretty entertainin' huh? Huh?\nYeah it's pretty entertainin' huh? Huh?\nYeah it's pretty entertainin' huh? Huh?\nYeah"}], "artist": "K.A.A.N."}