{"songs": [{"year": "1997-12-09", "album": "Eye & I", "image": "https://images.genius.com/f1579141bc34038372c5f692cd18be20.636x636x1.jpg", "title": "P.W.O.T.", "lyrics": "[Verse 1: Kardinal Offishall]\nOffishall (right)\nNappy heads true to the words aristocrate (true)\nBrother function with an automatic slang\nYang makes the ying, we slang rhyme banging off the walls\nLike Brooklyn Smalls, yo we Biggie\nYo must trust bust, though it's my time to bust too\nHustle you I must, cause your crew might get dust too\nFrustration, cause I can't make a mil\nWithout Jully burst, follow a my burst, try burst\nMakes my niggas crackhurst, and dispersed in the realm\nMy timing is perfect like synchronized rewinding\nOf my lining (style), moving (style)\nLike keys we the freshest, believe it or not like Ripley's\nYo, them G's ain't really heard about my (flow)\nCause they too hardcore to (know)\nThat I am the flow (pro), my bro pocket stretch like Armstrong\nYo my niggas got it going on, it's right where I belong\nOn top, never will we be stuck at number ten\nNumber one is where start and number one is where we end up\nAnd up friend up, niggas fronting jewels (lets do this)\nCause my crew will bring the real ting\n\n[Chorus: Kardinal Offishall]\nWe always look like we have a million\nWe gets down yo, regardless of what we feeling\n(Say what?)\nReal niggas make moves by the hundreds\nWe straight up or you blunted, yo this is how we run kid\nWe always look like we have a million\nWe gets down yo, regardless of what we feeling\n(Say what?)\nReal niggas make moves by the hundreds\nWe straight up or you blunted, yo this is how we run kid\n\n[Interlude: Kardinal Offishall]\nYo babes, what's up?\nNothing much, what's up with you?\nYo you ever hear this nigga named Afrolistics?\nNo, who's that?\nYo check this shit out, aight!\n\n[Verse 2: Afrolistics]\nI consume the hydro weed, for hyper speed\nAfro and Kardinal, two officials making the new breed\nCircle productive, poetic structure\nAlways intent to blow you out the frame\nWe tied you down, I contain\nParanormal and F.O.S. are out for the platinum, that be framed\nWe scoped out the terrain, to find niggas that was slain\nServing 25 to lifers, for they weren't sufficient writers\nI be pulling all nighters, to increase my penmanship abilities\nWith no trace of leakage, my CPU\nFully programmed, while yours suffers from (glitches)\nYou love to chat, no you getting popped from the hinges\nYou entered the game you couldn't handle, now you shitting\nCause you got disqualified from your mission\nNow listen, Aftrolistic only operates on precision\nHibernates only with those that have ambition\nNever ass kissing, unless it is my wifey\nRocking beats with ease, like Saukrates\nIt's all about the connect of the two families\nThe scholars with the entities collecting the cheese\nEqual ways, 3-60 degrees\nOur anthem is, vandalous marvelous\nPass the trees, it's all about the will\nAnd this is how we chill, with our players on Capitol Hill\n\n[Chorus: Kardinal Offishall]\nWe always look like we have a million\nWe gets down yo, regardless of what we feeling\n(Say what?)\nReal niggas make moves by the hundreds\nWe straight up or you blunted, yo this is how we run kid\nWe always look like we have a million\nWe gets down yo, regardless of what we feeling\n(Say what?)\nReal niggas make moves by the hundreds\nWe straight up or you blunted, yo this is how we run kid\n\n[Outro: Kardinal Offishall & Afrolistics]\nYeah\nYeah yeah\nKardinal Offishall\nAfrolistics\nF.O.S. Crew\nParanormal\nThis is how we do\nThe Circle\nDon't stop baby, KC and Thomas\nChoclair\nBJ Supreme\nLock Jaw\nBucktooth\nThis is how we do\nThis is how we do this\nFor real\nNigs from outta town\nYeah"}], "artist": "Kardinal Offishall"}