{"songs": [{"album": "Eardrum", "image": "https://images.genius.com/36dc52e92a9d27102149cf08b1a7f326.936x936x1.jpg", "year": "2007-08-21", "title": "Give ’Em Hell", "lyrics": "[Intro: Talib Kweli]\nReady or not\n\n[Hook: Coi Mattison, (Talib Kweli)]\nWe know\nThat what we reap we sow\nBut we forget how low\nWe can go\nIt’s bad here on Earth, but if we don’t get to heaven\nIt’s hell (it's all going to)\nHell (it's all going to)\nHell (yup, we living in)\nHell (yup, they giving us)\nHell (it's all going to)\nHell (it's all going to)\nHell (yup, we living in)\nHell (word)\n\n[Verse 1: Talib Kweli]\nEvery Sunday dressing up catching gossip at its worst\nCouldn't see the difference in the Baptist and the Catholic Church\nCaught up in the rapture of the first chapter and second verse\nIf we all God's children, then what's the word of the reverend worth?\nTaught early that faith is blind like justice when you facing time\nIf we all made in God's image, then that means his face is mine\nWait or it's that blasphemy it's logical it has to be\nIf I don't look like my father, then the way I live is bastardly\nNaturally that's confusion to a young'n tryna follow Christ\nTaught that if you don't know Jesus, then you lead a hollow life\nNever question the fact that Jesus was Jewish not a Christian\nOr that Christianity was law according to politicians\nWho was King James? And why did he think it was so vital\nTo remove chapters and make his own version of the Bible?\nThey say Hell is underground and Heaven is in the sky\nAnd they say that's where you go when you die\nBut how they know?\n\n[Hook: Coi Mattison, (Talib Kweli)]\nWe know\nThat what we reap we sow\nBut we forget how low\nWe can go\nIt’s bad here on Earth, but if we don’t get to heaven\nIt’s hell (it's all going to)\nHell (it's all going to)\nHell (yup, we living in)\nHell (yup, they giving us)\nHell (it's all going to)\nHell (it's all going to)\nHell (yup, we living in)\nHell (yup, they giving us)\n\n[Verse 2: Talib Kweli]\nI've been to many churches, I've quoted many verses\nI've dealt with my base self, I controlled my many urges\nI used to study my lessons, it was a blessing, not a curse\nI learned that Heaven and Hell exist right here on Earth, word\nStudied with Rastafarians and learned from the dreads that hell\nIs called Babylon and that's where them crazy baldheads dwell\nThey got us thinking that Muslims like to make bombs\nBut real Muslims believe in paradise and the resist the Shaitan\nSo it all sound the same to me\nThat's why when they say one is right and the other is wrong\nIt just sound like game to me\nIt's like God skipped past the church and came to me\nNo that ain't vein to me\nIt's just a particular way that I came to see\nThe difference between those who claim to be\nReligious and those that say they spiritual\nAnd recognizing that life is full of miracles\nYou could see my glow in a rhyme\nThe poem divine cause it coincide with a grow in the time\nThat those who looking for God knowin' to go inside\n\n[Hook: Coi Mattison, (Talib Kweli)]\nWe know\nThat what we reap we sow\nBut we forget how low\nWe can go\nIt’s bad here on Earth, but if we don’t get to heaven\nIt’s hell (it's all going to)\nHell (it's all going to)\nHell (yup, we living in)\nHell (yup, they giving us)\nHell (it's all going to)\nHell (it's all going to)\nHell (yup, we living in)\nHell (yup)\n\n[Verse 3]\nLiving in mass confusion, looking for absolution\nThe gas seducin' and psychopath produce the last solution\nBased on his interpretation of what the words were saying\nTrying to get to God but ended up doing the work of Satan\nReligion create division, make the Muslim hate the Christian\nMake the Christian hate the Jew, make the rules of faith\nThat you condition to and to you gotta follow\nAnd God forbid you go to Hell\nBut if you ever walked through any ghetto then you know it well\n\n[Bridge: Lyfe Jennings]\nMomma say it's her after me\nPreacher say it's blasphemy\nI say there's gotta be a better explanation\nThis dance is just me and you\nI pray to God, here's you\nTake one look at your rear view\nAnd you can see what I see\nThat could only mean\n\n[Hook: Coi Mattison, (Talib Kweli)]\nWe know (hey)\nThat what we reap we sow\nBut we forget how low\nWe can go\nIt’s bad here on Earth, but if we don’t get to heaven\nIt’s hell (it's all going to)\nHell (it's all going to)\nHell (yup, we living in)\nHell (yup, they giving us)\nHell (it's all going to)\nHell (it's all going to)\nHell (yup, we living in)\nHell (yup, they giving us)\nWe know\nThat what we reap we sow\nBut we forget how low\nWe can go\nIt’s bad here on Earth, but if we don’t get to heaven\nIt’s hell\nHell\nHell\nHell\nHell\nHell\nHell\nHell\n\n[Outro]\nThe Lord is my shepherd I shall not want\nJust because the lord is my shepherd don't mean I gotta be no sheep\nYou feel me?\nMore blood is spilled over religion than anything in world history\nWe saying the same thing\n\n."}], "artist": "Talib Kweli"}