{"songs": [{"image": "https://images.genius.com/294a7b3b0009e710be0cc01db8c6fa70.874x874x1.jpg", "title": "Get Away", "album": null, "year": "2012-09-10", "lyrics": "[Intro]\nYeah, why would I stop?\nWhen you get money like this, you gotta ask yourself that question\nThey say the greatest threat to your future success\nIs your current success, that’s why I go hard\n\n[Verse 1: Nipsey Hu$$le]\nAh, look, 7 Series black Benz, gun metal Mac 10\nYellow bone trophy, she gonna blow me as I back in\nMarijuana smoking, black Versace shade glass tint\nCover up my bloodshot eyes like an aspirin\nNigga, ballin', that’s your past tense\nI’m the present and the future of this rap shit\nDon’t act like you can’t hear it, you should fear it\nKill me, can’t mute my spirit\nWant a feature? Cut the check or nigga, you can’t clear it\nUndisputed on the West — if not, who came near it?\nGet at him with respect or young dude won’t hear it\nIt’s 20K in some states just for dude appearance, and look\nYou start getting rap money, they say you act funny\nBut I remember how I thought when I was that hungry\nYou let them take your sack from you, you’ll be back bummy\nSo niggas be ready to kill, 'fore they let crew take all their racks from them\nSame mind state, different grind rate\nThe desperation tenfold 'cause the price changed\nMake a hundred thousand dollars off a lick, or you can make 10 million off a hit\nNigga, not to mention, all the glamour and the glitz\nSold his soul for the fame - damn, ain’t that a bitch?\nAh, and when I pull up they say, \"Ain’t that the 6?\"\nYou talk money but I ain’t that convinced\n\n[Chorus: Nipsey Hussle]\nI’m getting paid, sometimes I wanna get away\n'Cause these days niggas fake\nI’m on my grind, I'm thankful I ain’t doing time\nThat’s why I’m solo when I ride\nI’m getting paid, sometimes I wanna get away\n'Cause these days niggas fake\nWake up on my money with no emotions on my face\nKeep a choppa at the house and a .40 on my waist\n\n[Verse 2: Ken Malik]\nMy strive, that’s all a nigga got\nI’m the last one to lead, the first one to bleed the block\nNow that, grind mode can’t stop, won’t stop\nI’m just tryna turn that 1997 to a yacht\nUh, and put my son in the spot\nSo he ain’t never gotta worry 'bout the shit that he ain’t got\nJust watch how I put my niggas in position\nWithout a handout given, we was out here fly living\nAh, I’m innocent until the jury plead\nGuilty, your bitch feelin' how my jewelry bleeds\nBro, what? You niggas ain't no kin to me\nA bunch of broke niggas suffering from in the breeze\nHopeless ass rap bitches in it for the cheese\nCan't get comfortable, I’m working on that enemy\nThe hustle there, my nigga, though you're lacking energy\nEvery 16 will bring you closer to Ken Malik\n\n[Chorus: Nipsey Hussle]\nI’m getting paid, sometimes I wanna get away\n'Cause these days niggas fake\nI’m on my grind, I'm thankful I ain’t doing time\nThat’s why I’m solo when I ride\nI’m getting paid, sometimes I wanna get away\n'Cause these days niggas fake\nWake up on my money with no emotions on my face\nKeep a choppa at the house and a .40 on my waist\nAy"}], "artist": "Nipsey Hussle"}