{"artist": "C-Bo", "songs": [{"title": "Black 64", "album": "Gas Chamber", "year": "1993-04-20", "image": "https://images.genius.com/381c1e664e41b91bd02e7d0dad1745b9.1000x990x1.jpg", "lyrics": "Black six-four, gold Daytons roam\nAnd hit the block non stop nigga straight out bone\nAnd just passing through, didn’t have no strap\nPoint my finger at your asses says smoke like that\nHit your enemy block, rolling four cars deep\nTwo Chevs, one 'Lac and a IROC-Z\nRiding low shotgun gauge ready to peel\nWindows down, top drop, bumpin' Realer Than Real\nHit the block, gauge cocked, hangin' over the do'\nSeven shot, one squeeze, ride pump, ya know?\nNever slip in the streets of the Garden Block\n'Cause muthafuckas get smoked a lot\n\nHit the flow and I come, you try to run you get gunned down\nFour deep on the creep, I’m about to put your ass to sleep\nAnd ain’t no sense in locking up the door\n'Cause one kick from one the cliques we'll be in that hoe\nSo make way as I unload my A-K on your house\nThen degrade as I take one of your closest family members out\nIt’s the Bo, I thought you knew, oh punk you didn’t know?\nWell meet my forty-four (four, four, four, four)\nFace to face we shoot out with the next hood\nOn the creep, they say the Bo-loc’s no good\nAnd it’s your ass that got me pulling a mask, popping a cap\nWant me to tap daddy on that ass with my mask?\n\nIt’s all for one and one for all\nFucking with the Bo and I'll be bustin' and getting AWOL\nPulling a gat, going in for the big jack\nCaught them fools on they back\nWoke them up with the mac, now give me the scrap\n'Cause that’s how we living in ninety-three\nI watch my back plus I’ll be strapped 'cause ain’t no jacking see\nSo don’t try, this punk tried denyin' I knew was lying\nI started firing, now one at a time they all retirin'\nClose range, living in strange, can’t be tame\nI pull the mac and take the police out the fucking game\nI been a slave, and I ain’t going back\nPolice jacked with the intentions to sendin' it back"}]}