{"artist": "C-Note", "songs": [{"title": "Take 1", "album": "B.A.R.$(Broke Ass Rapper $hit)", "year": "2018-05-23", "image": "https://images.genius.com/405af1827bee3e1fdf111426fc330a21.846x846x1.jpg", "lyrics": "[Verse: C-Note]\nNew day but still the same me\nI ain't rocking to the same beat\nCatch the wave, I'm feelin wavy\nOn top of the rock like Jay Z\nSmoking trees, Im feelin shady\nShoutout to the Chi, it made me\nWhat yall niggas can't be\nThat's why these niggas hate me\nWaking up and counting all my dollars\nGrinding hard like its no tomorrow\nTaking off and take this shit to Mars\nStill a $olja, never camouflaged\nStill a $olja, yes I'm a sarge\nMilitary pressin all the bars\nNever let my talent go to waste\nTeam full of shooters, Golden State\nTrying to get them rings like Im Sonic\nIm just trying to be the trending topic\nTrying to be real big out here and these niggas seem microscopic\nAll the shit they talking on the net\nDon't mean a thing we ain't impressed\nYall know that we be whats up\nHit the blunt and pass the shit to Knuck\nPlugga be rollin the dope\nSmoke gas I just go\nLungs healthy I don't choke\nStunned ya girl this dick be stone cold\nShe say she wanna get in the ring\nBut she can't run through the ropes\nSold her a million dollars and a dream\nOnly thing I have for bitches is hope\nSee I ran all out of fucks but my fucks ran a good race\nAnd you ran all out of luck and its just yo luck yo girl give me face\nAnd I got her down on all fours, I guess you can say it was fate\nAnd I got her screaming out \"Oh Lord!\", yeah that mean she got good faith\nMan I been A1 since like day one\nI been a boss like Shang Tsung\nShe ain't never fucked with a real nigga and she fuck with you\nSo you ain't one\nNow she fuck with me she can claim one\nIm a god you better pray son\nYou can hide but you can't run\nYou been taking Ls so you ain't won\nYou been hating yes I can tell\nOn the internet you been typing well\nIm taking off cause Im fly as hell\nI been hot ring the fire bell\nThese new rules you better honor dude\nDont like Mr. T cause Im a fool\nAnd yo girl give me head like she in honor school\nDamn Im rude, ooh!\nMiddle fingers to my enemies\nThem niggas ain't kin to me\nYall heads up each others asses\nModern day human centipede\nMixing light and dark in champagne glasses\nFeels like Im doing chemistry\nThey went hollywood, Johnny Cage glasses\nBut them niggas never finished me\nThis is a shock I ain't talking Raiden\nI step in the game I start hall of faming\nThis shit ain't sweet, ain't no Walter Payton\nBut you better believe it that Im the greatest\nNo room for your hating\nWe don't need your input\nSo end of discussion, lets not debate it\nMy nigga we made it\nNow I can sit back, hit the blunt\nLike percussions and now Im faded\nAAAH\n\n\nBitch"}]}