{"songs": [{"title": "Don’t Waste Your Life", "album": "Rebel", "year": "2008-09-30", "image": "https://images.genius.com/203d6f5e6f6426f878ba3ff2a016c5e6.1000x1000x1.jpg", "lyrics": "[Intro: Lecrae]\nDon't waste your life, man\n\n[Verse 1: Lecrae]\nI know a lot of people that are scared they gon' die\nCouple of 'em thinkin' they'll be livin' in the sky\nWhile I'm here livin', man, I gotta ask Why?\nWhat am I here for? I gotta figure out\nWaste my life? No, I gotta make it count\nIf Christ is real then what am I gon' do about\nEverything in Luke 12:15 down to 21 you really oughta go and check it out\nPaul said if Christ ain't resurrected we wasted our lives\nWell that implies that our life's built around Jesus being alive\nEveryday I'm living tryna show the world why\nChrist is more than everything you'll ever try\nBetter than pretty women and sinning and living to get a minute of any women or men that you admire\nIt ain't no lie, we created for Him\nOutta the dust He made us for Him\nElects us and He saves us for Him\nJesus comes and He raises for Him\nMagnify the Father, why bother with something lesser?\nHe made us so we could bless Him\nTo the world we confess Him, resurrect Him\nSo I know I got life\nMatter fact better man, I know I got Christ\nIf you don't' see His ways in my days and nights you can hit my brakes, you would stop my life\nThen I lost my rights, lost my life\nForget the money, cars, and toss that ice\nThe cost is Christ\nAnd they could never offer me anything on the planet that'll cost that price\n\n[Chorus: Cam]\nDon't wanna waste my life\n\n[Verse 2: Dwayne Tryumf]\nArmed and dangerous\nSo the devil just can’t hang with us\nChristian youth them a stand with us\nLivin' and driven, given a vision\nFullfillin' the commission He handed us\nLondon to Los Angeles\nThe rap evangelist\nMy Daddy wouldn't abandon us\nI got a backpack full of tracks, and I keep a Johnny Mac\nSo are you ready to jam with us? So let's go\nGive me the Word and let's go\nPersecution–let's go\nTribulation–let's go\nAcross the nation–let's go\nProcrastination–best go\nHung on the cross in the cold\nDied for the young and the old\nCan't say you never know\nHeaven knows\nHow many souls are going to Hell or to Heaven so we gotta go in and get 'em\n\n[Chorus: Cam]\nDon't wanna waste my life\n\n[Verse 3: Lecrae]\nSuffer, yeah, do it for Christ\nYou tryna figure what to do with your life\nYou make a lot money? Hope you doin' it right because the money is God's, you better steward it right\nAnd stay focused, you ain't got no ride?\nYour life ain't wrapped up in what you drive\nThe clothes you wear, the job you work\nThe color of your skin, nah, you Christian first\nPeople get to living for a job\nMake a little money, start living for a car\nGet 'em a wife, a house, kids, and a dog\nWhen they retire they livin' high on the hog\nBut guess what? They didn't ever really live at all\nTo live is Christ, and that's Paul, I recall\nTo die is gain, so for Christ we give it all\nHe's the Treasure you can never find in the mall\nSee, your money, your singleness, marriage, talents, your time\nThey were loaned to you to show the world that Christ is divine\nThat's why it's Christ in my rhymes\nThat's why it's Christ all the time\nSee, my whole world is built around Him\nHe's the life in my lines\nI refuse to waste my life\nHe's too true to chase that ice\nHere's my gifts and time cause I'm constantly tryna be used to praise the Christ\nIf He's truly raised to life\nThen this news should change your life\nAnd by His grace you could put your faith in a place that rules your days and nights\n\n[Chorus: Cam]\nDon't wanna waste my life"}], "artist": "Lecrae"}