{"artist": "Anderson .Paak", "songs": [{"title": "Mansa Musa", "album": "Oxnard", "year": "2018-11-16", "image": "https://images.genius.com/f86cd94b8dc54301943533fa84ca4350.1000x1000x1.jpg", "lyrics": "[Chorus: Anderson .Paak]\nBack on my bullshit\nI got some money to blow, I'm lookin' good, bitch\nEven as the king, I stay hood rich\nMansa Musa, gold jewelry\nOoh, what'chu talkin' 'bout? Shit, gold toothpicks\nEvery day is Christmas, Santa got his roof missin'\nAll they do throw shots at the king, it's foolish\nIt's Mansa Musa, power, move, bitch!\n\n[Verse 1: Cocoa Sarai]\nUh, my money, money\nPocket so dummy\nThat mean my money so sick, I might just cough up a hunnid\nRich gyal in me own time zone, fuck whoever\nShit, you gotta love me\nNow if you owe me mine, better run it\nA hunnid miles and runnin', yeah, I'm comin', still gunnin'\nShit that we be on, you could hate it or love it\nAnd if I said it, then I meant it, muh fucker, who want it?\n\n[Verse 2: Dr. Dre]\nNow I've been on some different shit lately\nLike I need to dumb it down for this hip hop scene\nLike I only come around for this type shit here\nIf I have to bust around, it's on the hits, my dear\nNow what we gwan do with all these hits over here?\nGo up in smoke when I disappear, reappear\nHah, I'm just bein' sincere\nBoss shit, how we do it?\nCrack music, top tier, nigga\nShut it down, my nigga, chill\nWe could see right through that bullshit, you pussy, nigga, we could tell\nBetter believe my product sell\nMade a billion off my bullshit and did it, nigga, high as hell\nOverachiever, nigga, I excel\nIf my name is on this muh fucker, better believe the stock's up\nProfessional winners around us\nGotta fly, leave the buildin', levitatin' on you mother fucks\n\n[Chorus: Anderson .Paak]\nBack on my bullshit\nI got some money to blow, I'm lookin' good, bitch\nEven as the king, I stay hood rich\nMansa Musa, gold jewelry\nOoh, what'chu talkin' 'bout? Shit, gold toothpicks\nEvery day is Christmas, Santa got his roof missin'\nAll they do throw shots at the king, it's foolish\nIt's Mansa Musa, power, move, bitch!\n\n[Verse 3: Anderson .Paak]\nMummy wrap, double back, gimmie that\nReal rich niggas never advertise that\nBroke niggas always playin' rich, puttin' on an act\nWhoa, nigga, when your money grow, maybe we could chat\nBut in the meantime, I remain streamlined\nStackin' my ends if ever my money decline\nI double my wins, now look how my whole team shine\nHell no, blow out my dough, I'm tryna keep mine\nNigga, fuck that snow up your nose, it's fuckin' ski time\nHo-ho, call up the hoes, it's shoppin' spree time\nDon't nobody roll in a Rolls Royce where we from\nSo I'm goin' stupid as soon as I get a lil' sum\nDumb, they should have never gave you niggas money!\nHey, watch your mouth boy\nYou don't ball, boy\nYou don' maxin' out credit cards, boy\nI'ma cash cow, you a hog wart\nTell you anything, you would fall for it\nGet the piece, you don't really want war\nWhy the mean mug? That's uncalled for\n\n[Chorus: Anderson .Paak]\nNow I'm back on my bullshit\nI got some money to blow, I'm lookin' good, bitch\nEven as the king, I stay hood rich\nMansa Musa, gold jewelry\nOoh, what'chu talkin' 'bout? Shit, gold toothpicks\nEvery day is Christmas, Santa got his roof missin'\nAll they do throw shots at the king, it's foolish\nIt's Mansa Musa, power, move, bitch!"}]}