{"artist": "Professor Green", "songs": [{"album": "Growing Up In Public", "title": "Name In Lights", "image": "https://images.rapgenius.com/e0c11580b188962b9150009afd2fd50c.1000x1000x1.jpg", "lyrics": "[Intro]\nPeople always ask me how I write songs\nI tell them it's not complicated\nI quite simply take everything one line at a time\nListen\n\n[Verse 1: Professor Green]\nEverybody knows what my name is\nBut I'm still out pulling faces\nCara Delevingne\nHave you got any cocaine, please?\nNight out, cause it's my night off\nI need a day off cause when I crash I'll be a write-off\nWhat a fucking sight, fuck it, what a fucking night\nWho the fuck are you to tell me how to live my fucking life?!\nLoving life, me I'm dandy\nHow quick can you get rid of a bottle of brandy?\nIn a rave listening to Trinidad James\nThough we don't pop mollies, we drop bombs of Mandy\nI go in if I'm out, but I'm in a pickle now\nI think Sha put something in my drink\nAnd before I got back from the pissery pizzled out\nDamned it, didn't I? And now I'm dizzled up\nFuck, what if I get pictured out?\n\n[Chorus: Professor Green]\nCause I'm shameless, young and I'm famous\nI'm shameless, young and I'm dangerous\nI'm shameless, young and outrageous\nThey never should have put my name in lights\n\n[Verse 2: Jordan \"Gnarly Ventura\" Stephens]\nAww, you get famous and then you seem naughty\nLook at Stephen and he's like 40\nYo, got a little buzz, now it's funny\nCause the honeys make a B-line for me\nTurn the lens with a bright light\nBut I'm alive and every tunnel I finds got a white line\nKeep on running to the loos, magazines' chatter\nAin't substance abuse, I got a weak bladder!\nCall it the Bieber effect young too silly\nPro's pissed and in a year I'll have a few millis\nWhoop diddy, now they're calling me an influence\nThey might as well say that Eddie Murphy is impotent\nI told my label I'm not a pisshead, I'm vibrant\nAnd I only drink to make celebs more exciting\nYou should try this cause no one's really saying much\nUntil they roll the Queen's face into a cylinder\nAnother one sniffs the dust!\n\n[Chorus]\n\n[Post-Chorus: Rizzle Kicks]\nPut my name in lights\nCreatures of the night\nYeah, my mind is rolling\nMy eyes wide open\n\n[Bridge: Rizzle Kicks]\nFall down on the table\nI'm crazy and I'm feeling quite unstable\nMy head spins, feeling reckless\nI should probably slow right down but I'm too tempted\n\n[Verse 3: Professor Green]\nI'm a bastard, yep\nMy mother had me before she and my father had married, I'm a bastard\nAnd I'm plastered, my god, honestly what have I started?\nWhy is my face on pages of papers that I wouldn't even wipe my arse with?\nWhy are they so nasty to me?\nI think I preferred it when they arse kissed\nOh and Cara, I'm sorry Cara\nBut I can't promise I won't take this any farther!\n\n[Chorus]\n\n[Post-Chorus]", "year": "2014-09-02"}]}