{"songs": [{"lyrics": "[Intro: Beastie Boys sample]\nHelloooooooooooooo!!!!!!!! Brooklynnnnnnnnnnnnnnnnnn!!!!!!!!!!!!!!!!!!!\n\n[Chorus: Lil Wayne]\nHello Brooklyn, how you doin'?\nWhere you goin'? And can I come too?\nAnd If I can, I'm a be your man\nYou could be my lady, and have my baby\nAnd drive my cars, and drive me crazy\nWherever you goin' baby girl just take me\n'Cause I'm so taken, if you taken\nI'm just sayin' baby, I'm just sayin'\n\n[Verse 1: Jay-Z]\nLike a mama you birth me, Brooklyn you nursed me\nSchooled me with hard knocks, better than Berkeley\nThey said you'd murk me, by the time I was 21\nThat shit disturbed me, but you never hurt me\nHello Brooklyn, if we had a daughter\nGuess what I'ma call her, Brooklyn Carter\nWhen I left you for Virginia, it didn't offend ya\n'Cause you know I only stepped out to get dinner\nAnd I'm eatin', so much I bought extra\nSo much so that dinners now turned into breakfast\nI only roll Lexus, to hug your road\nI love your corners, I'm half your soul\n\n[Chorus: Lil Wayne]\nHello Brooklyn, how you doin'?\nWhere you goin'? Can I come too?\nAnd If I can, I'm a be your man\nYou could be my lady, and have my baby\nAnd drive my cars, and drive me crazy\nWherever you goin' baby girl just take me\n'Cause I'm so taken, if you taken\nI'm just sayin' baby, I'm just sayin'\n\n[Verse 2: Lil Wayne (Jay-Z)]\nHello Brooklyn, what's your story?\nShe said she eatin' on the run but she ain't N.O.R.E\nShe said she got a man but he ain't worried\nBut baby I'ma have to rob him like Horry\nShe said she love B.I.G. and she like 2Pac\nAnd when I said Jay-Z she say \"It's The Roc!\"\nAnd I'ma leave it like this, like this like that\nWhere Brooklyn at? Where Brooklyn at?\nHave you seen her?\nAnd when she tell you somethin' you better believe her\nShe told me she like my New Orleans demeanor\nAnd so I said goodbye Katrina, and hello Brooklyn\nBut baby you are, the sweetest sight eyes could see\nI said hello Brooklyn\nBut baby I hope you never say goodbye to me\nI said hello Brooklyn, buh-buh-baby you are so damn fine to me\nAnd I remember the time (time), place (place) and the weather\nOn the day you said hi to me and let's say hello Brooklyn\n\n[Verse 3: Jay-Z]\nBrooklyn you crazy, look how you made me\nRazor blades in my mouth walkin' 'round behavin'\nAll demented black hoodies and Timberlanded\nAlways schemin', \"you see the gleam on that niggas pendant?\"\nHello Brooklyn, you bad influence, look what you had me doin'\nBut I ain't mad at you, look at my attitude\nIt says my life's too real, check out my ice grill\nBaby I'm cold as ice, like I'm from Brownsville\nBut my Bed's in the Stuy though I'll lie flat in your bush\n'Til we smoke a C.I., what up to the boy B.I\nYou know I handle B.I., I don't half-step on the 'caine\nAsk the dreads 'bout I, how you gwaan so?\nShe like it hardcore, so I grind slow\nIller than Albee Square Mall back in the 9-0\nMy fine ho, we got some victims to catch\nSo in a couple years baby I'ma bring you some Nets\n\n[Chorus: Lil Wayne]\nHello Brooklyn, how you doin'?\nWhere you goin'? And can I come too?\nAnd If I can, I'm a be your man\nYou could be my lady, and have my baby\nAnd drive my cars, and drive me crazy\nWherever you goin' baby girl just take me\n'Cause I'm so taken, if you taken\nI'm just sayin' baby, I'm just sayin'\n\n[Outro: Lil Wayne]\nAnd hello Brooklyn, buh-buh-baby you are\nThe sweetest thing eyes could see\nHello Brooklyn, baby I hope\nYou never say goodbye to me\nI said hello Brooklyn, buh-buh-baby you are\nSo damn fine to me\nBut I remember the time, place, and the weather\nOn the day she said goodbye to me\nSo I say hello Brooklyn", "title": "Hello Brooklyn 2.0", "image": "https://images.genius.com/778c1892b8a2f5aee554c4c797ca8915.1000x1000x1.jpg", "year": "2007-11-06", "album": "American Gangster"}], "artist": "JAY-Z"}