{"songs": [{"year": null, "title": "Oh yeah (Our Baby)", "image": "https://s3.amazonaws.com/rapgenius/1374583262_saigon.jpg", "lyrics": "[LeAlan Jones]\n\"I remember one time I was over at my Auntie house\nSpending the night. And we playin' Super Nintendo\nI hear this lady: 'Yo, I heard you been looking for me, nigga'\nThen she just -- boom-boom-boom-boom-boom!\nShe let off about eight shots. Then I heard the other gun fire off\nAnd we were just still there playing there, like nothin' happened\nAnd then Vietnam, them people came back crazy. I (live) in Vietnam\nSo what you think I'ma be if I live in it and they just went and visited?\"\n\n[Verse 1]\nSuckas can't survive without philosophyin'\nWhen somebody dies you see why I'm not surprised\nHad a plot to rise since I looked into the doctors eyes\nSince I started drinking milk that was homogenized\nI was strived with or without a pops to provide\nMom still cries cause she fell for a crock of lies\nI try to teach her to fight her fears\nI try to teach her to wipe her tear\nDon't worry, shit gon' be a'ight this year\nI'm at the top of my game, just watch for my name\nBetter off popping my brain than poppin' my chain\nI claim king without dropping a thing\nWhen they ask if I'm best I reminisce to the banging'\n\n[LeAlan Jones]\nWhen I was ten, I seen my first automatic weapon\nA Glock Nine -- two clips\n\n[Lloyd Newman]\nI seen all kinds of guns -- .44, .22, (Techs!) Techs. I saw rifles\n\n[Jones:] Mac 10, Mac 11\n[Newman:] Living around here. You hear shooting all the time\n\n[Verse 2]\nDamn...\nThe drama's pitiful, little niggas is homicidical\nCouple meals ago shorty was eating through his umbilical\nNow he feel he unkillable\nShit is all amazing\nThe wrong altercation will leave his ass with a long abrasion\nI try to make my life the focal through rhyme\nThese niggas do vocal booth crime\nI shot niggas multiple times\nYou sold a few dimes\nBut when you rapping, you the crack king\nI sold it to whites when you thought it was just a black thing\nI'm filled with this realness, rappers happen to lack it\nI'm flabbergasted you got a platinum plaque for that whack shit\nAll the real gangsters, they're on their way to being dead or in jail\nThey don't make records to sell\n\n[Lloyd Newman]\nI asked my father, Chill, what his best memories of my mother are\n\n['Chill']\nMe and her have fun, putting our feet in the water together\nWe were sober then... but once we started gettin high..\nThem memories gone... They gone\n\n[Newman:] Why are you drinking?\n[Chill:] I don't understand why I'm drinking\n[Newman:] Do you think you're gonna stop?\n[Chill:] Yeah, I'm going to rehab, and take care of myself\n[Newman:] What do you drink?\n[Chill:] I drink about two or three pints of wine a day\nBut it ain't helping me, ain't doin nothin' but killing me\nDon't people understand it's destroying you?\n[Newman:] If it's destroying you, why do you still drink?\nDo you think you've been a good father?\n[Chill:] Yes, I have, to the best capability I could\n[Newman:] I have no further questions\n\n[Verse 3]\nThe drama's pitiful, little niggas is homicidical\nCouple meals ago shorty was eating through his umbilical\nNow he feel he unkillable\nShit is all amazing\nThe wrong altercation will leave his ass with a long abrasion\nI try to make my life to focal through rhyme\nThese niggas do vocal booth crime\nI shot niggas multiple times\nYou sold a few dimes\nBut when you rapping, you the crack king\nI sold it to whites when you thought it was just a black thing\nI'm filled with this realness, rappers happen to lack it\nI'm flabbergasted you got a platinum plaque for that whack shit\nAll the real gangsters, they're on their way to being dead or in jail\nThey don't make records to sell\nThey don't make records to sell\nThey don't make records to sell\nThey don't make records to sell\nThey don't make records to sell\nThey don't make records to sell", "album": null}], "artist": "Saigon"}