{"songs": [{"image": "https://images.genius.com/ee6c6181ebd522da5b345ff9cd0a61f9.1000x1000x1.jpg", "title": "#1", "album": "Nellyville", "year": "2001-08-29", "lyrics": "Uh uh uh\nI just gotta bring it to they attention dirty, that's all..\n\nYou better watch who you talkin bout; runnin your mouth, like you know me\nYou gon' fuck around and show why the \"Show Me\" get called the \"Show Me\"\nWhy one-on-one you can't hold me if your last name was Hanes\nOnly way you wear me out is stitch my name on your pants\nNo resident of France; but you swear I'm from Paris\nHundred-six karats - total? Naw that's per wrist\nTrying to compurr this - my chain to yo' chain\nI'm like Sprint or Motorola - no service, out of your range\nYou out of your brains, thinkin I'mma shout out your name\nYou gotta come up with better ways than that to catch your fame\nAll that pressure you applyin it's time to ease off\nBefore I hit you from the blindside takin your sleeves off\nAs much as we's floss, still hard to please boss\nDon't be lyin bitchin and cryin - suck it up as a loss\nCause your, acts is wack, your whole label is wack\nAnd matter fact, eh eh-eh eh a-hold that\n\n[Hook]\nI.. am..  #1 - no matter if you like it\nHere take it sit down & write it\nI.. am.. number one\nHey hey hey hey hey hey - now let me ask you man\nWhat does it take to be #1?\n2 is not a winner and three nobody remembers (hey)\nWhat does it take to be #1?\nHey hey hey hey..\n\nDo you like it when I shake it for ya, daddy? Move it all around?\nLet you get a peep before it touches the ground?\n\nHell yeah ma I love a girl that's willin to learn\nWillin to get in the driver's seat and willin to turn\nAnd not concerned about that he say, she say, did he say\nWhat I think he said? Squash that, he probably got that off eBay\nOr some, Internet access some, website chat line\nMad cause I got mine, don't wind up on the flat line\nOhh if my uncle could see me now\nIf he could see how many rappers wanna be me now\nStraight emulatin my style right to the \"down down\"\nCan't leave out the store now better wait 'til they calm down\nI got hella shorties, comin askin, \"Yo where the party?\"\nOhh lordy - will I continue to act naughty?\nMixing Cris' and Bacardi, got me thinkin fo' sho'\nI'm not a man of many words but there's one thing I know - Pimp\n\n[Hook]\nI.. am.. number one - no matter if you like it\nHere take it sit down and write it\nHey I.. am.. number one\nHey hey hey hey hey hey hey hey\nTell me now Dirty\nWhat does it take to be number one?\nTwo is not a winner and three nobody remembers (tell me)\nWhat does it take to be number one?\nHey hey hey hey hey hey hey hey\n\nCheck it, uhh, check, yo\nAiyyo I'm tired of people judgin what's real Hip-Hop\nHalf the time you be them niggas who fuckin album flop\nYOU KNOW! Boat done sank and it ain't left the dock\nC'MON! Mad cause I'm hot; HE JUST - mad cause he not\nYou ain't gotta gimme my props, just gimme the yachts\nGimme my rocks, and keep my fans comin in flocks\n'Til you top the Superbowl, keep your mouth on lock\nShhhhh.. {*crickets*} I'm awake, ha ha ha!\nI'm cocky on the mic but I'm humble in real life\nTaking nothin for granted blessin e'rything on my life\nTrying to see a new light at the top of the roof\nBaby name not Sigel but I speak The Truth\nI heat the booth - Nelly actin so uncouth\nTop down shirt off in the coupe, spreadin the loot\nWith my family and friends, and my closest of kin\nAnd I'll do it again if it means I'mma win\n\n[Hook]\nHey\nDirty I.. am.. number one - no matter if you like it\nHere take it sit down and write it\nI..I..I am.. number one\nTwo is not a winner and three nobody remembers\nNumber one\nCause two is not a winner and three nobody remembers"}], "artist": "Nelly"}