{"songs": [{"album": "Teairra Mari", "image": "https://images.genius.com/b191e7973f10a4a5cc6205915f705ef2.220x218x1.jpg", "year": null, "title": "Make Her Feel Good", "lyrics": "Go stars, go stars, go stars, go stars...\nAnd the R. O. C. Niggas, yeah, introducing (uh huh) newest appasition, to the R (the star) rocka fella ya, young Chris' to the rock, Teairra Mari\nWe gets busy...\n\n(Hook:)\nIs there any boys around\nKnow how to make a girl feel?\nThat wanna make a girl feel\nMake her feel good?\nAll I wanna know\nIs there any boys around\nThat know how to make a girl feel?\nThat wanna make a girl feel\nMake her feel good?\nI just wanna know\n\n(Verse 1:)\nDo I have to tell a nigga how to touch me?\nDo I have to tell a nigga how to hold me?\nDo I have to tell a nigga when to call me?\nDo I have to tell a nigga I'm lonely?\nDo I have to feel wrong\nWhen it ain't strong?\nKeep my mouth closed?\n(huh, huh, huh)\nCan't a girl from tha hood find a homie\nThat ain't just tryna hang around me?\n\nDo I have to show a nigga I'm a woman?\nDo I have to apologize for my emotions?\nDo I have to tell a nigga what to say to me\n\nEverytime he wanna get next to me?\nDo I have to set a full cat black case?\nStroke 'cause he go (mmh girl no)\nCan't a chick from tha hood find a homie\nThat wanna do more than spend money on me?\n\n(Hook)\n\n(Verse 2:)\nHow come I got a nigga but can't trust him?\nWhy every answer to my question is a question?\nWhy can't my nigga be my own lil somethin'?\nAnd every girl on my block can't say they don' bumped wit?\n\nI'm so tired of these so called wanna be hard cold pretenders that (have. no. clue.)\nCan't a chick from tha hood find a homie\nThat I ain't gotta tell how to put it on me?\n\n(Hook)\n\n(Bridge:)\nWhy why is it so hard\nHard for a girl like me to find a boy\nThat really knows how to make a girl feel (girl feel, feel)\nWhy is it so hard\nHard for a girl like me to find a boy\nThat really knows how to make a girl feel (girl feel, feel)\nI just wanna know\n\n(Hook)"}], "artist": "Teairra Marí"}