{"songs": [{"year": "2014-06-20", "title": "Death Warrant", "image": "https://images.genius.com/5ac985192ecf998a6a862a00118c5d82.977x1000x1.png", "lyrics": "[Verse 1: Sadistik]\nMarijuana that I light when I’m alone\nReaching ultraviolet heights to kill the spiders in my skull\nI'm a recluse, reçue, hiding in my home\nM. Bison when I light up, doing spirals when I roam\nWith the buffalo, puff of smoke, get stigmata\nBuffalo Soldier, dreadlock Rasta\nI'm with the vultures, get some drama\nDon’t believe in karma, head shot (BLAT BLAT)\nTwo can keep a secret if one of them is dead\nOh there’s three left in the chamber with the gun against the head\nRussian roulette, one of ‘em’s left\nLeft wondering, \"Was it something I said?\"\nThese motherfuckers run for cover when I hum a number\nSomething other, muttered thunder, hunger\nFor the blood of others, hunting, Hunter S\nJunkie huffing puffing, under stress like gutter slug\nWith nothing but a stuttered des-tiny\nTiny ants dance beneath this giant’s feet\nRival me and get the iron lung for irony\nIre breeds, I am me, Ayatollah fire breathes\nFrom the mouth of madness\nMichael Myers when the smiles cease, idling\nThey talk shit on Wi-Fi bout the best\nBut their fingers stick to text nine times out of ten\nYeah, watch 'em die by fountain pen\nA pound of flesh, and it better not be counterfeit\n\n[Hook: instrumental break 8 measures]\nDie, die, die (x2)\n\n[Verse 2: Sticky Fingaz]\nYou think you can take me? Well, come on with it\nI'm a sick, twisted fuck, I leave you tormented\nSo if you got a weak stomach then you better forget it\nI'm a shark, I smell blood, it's too late to forfeit it\nDeading y’all niggas is what I do for a living\nAnd I'ma leave a scar so you never forget it\nHave you dripping out of windows, while we robbing your credit\nRun it by me, you won't be able to walk to the clinic\nI'm a pathologist, Dr. Kevorkian\nNigga, I promised this, the Hip Hop scorpion\nI turn all y’all kids into orphans then\nRaise them as my own, shit that’s better off for them\nI know I'm going to the place that's too hot for me\nCause I'm a fallen angel, something in me gots to sink\nAin't no way in hell I'm not top of the ten\nIf I'm not number one, I must be zero then\nYou dead in my sights, it's over once I zero in\nDead to rights for try'na be a hero again\nTime to sign your death warrant, nigga hand on a pen\nPut your best foot forward, take it on the chin\nPlus whenever I'm on track pain get inflicted\nPunchlines hit your head, your brain gets shifted\nI'm vicious, have you screaming, “Abort the mission”\nRelentless, I like to see you hurt, that's sadistic\n\n[Hook]\n\n[Verse 3: Tech N9ne]\nAhga beeba fee a lotta booby\nDada boba shabaland who be hotta? not a man!\nWho ever think different's in lala land\nAllah crammed scholar and a lot of K.O.D\nInside of my knot then bada bam\nStrange Music, my gang ruthless we Bang you if\nLame stupidness out ya fangs true is the pain you get\nFrom brain shoe kicks my aims lucid my name shoot this thang\nHang nooses we flame crew it's no dang blue shit!\nSick with Sticky and Sadistik suddenly something shifted\nSimple Simon suckas seemin' submissive\nSee us and some surely substitute sis's\nChakratease spit shit psycho scripts is scripted syphilis!\nYou haters don't ride on my dick but yo mamma there\nShe like to play in my goat she call it Osama hair!\nSo now you wanna go get yo llama pair and shoot me\nI'll die cause my insurance was fucked up by ObamaCare!", "album": "ULTRAVIOLET"}], "artist": "Sadistik"}