{"songs": [{"year": null, "album": "Enigma", "image": "https://images.genius.com/482eea61300bdf72a62b443973fd7a5c.1000x1000x1.jpg", "title": "Rhymin’ Wit Kel", "lyrics": "Intro:\nCome on, Yeah\n\nHook:\nWho you wit? Where you at?\nWho you wit? Where you at?\n\nKel-Vicious:\nI'm stanking strong, 23 years old now\nWith the big, bang boogie and the big pow pow\n(Ay, yo, you Kel) Not much, just keepin' it tight\nWith the Philly Blunt King gettin' high as a kite\nI got no time for bullshittin', I have to start lickin'\nCause niggas get jeal off the shit Kel be kickin'\nGet your free head ups, cause I'm seven foot tall\nAnd I ain't scared of none of ya'll\nThis shit is off the wall\n\nKeith Murray:\nI be the genie in your lamp, the face on your stamp\nThe hip-hop rocker stompin' all through your camp\nWe went from smokin' weed in bullen therapy\nTo takin' suckers out on national TV\nSo on and so on, furthermore in other words\nWe kick niggas heads to the curb\n\nHook:\nWho you wit? (Def Squad) Where you at? (L.O.D.)\nWho you wit? (Def Squad) Where you at? (L.O.D.)\nWho you wit? (Def Squad) Where you at? (L.O.D.)\nWho you wit? (Def Squad) Where you at? (L.O.D.)\n\nKel-Vicious:\nI shook hands with all across the land from here to Japan\nBack to the motherland up to Canada\nNigga I\"ll Jeru the Damaja\nYour rap style is weak and it has no stamina\n\nKeith Murray:\nAy yo, this is for the big quzzlers\nGun smugglers, drug jugglers and chelua puffers\nMister Armor to all, you gonna take a fall\nFor tryin' to walk before you crawl\nWe'll kick 120 rhymes in 60 seconds\nNiggas standing on the sideline feeling disrespected\nWhile I dissected your shit get ejected\nI got Kel-Vicious the malicious next to wreck it\n\nKel-Vicious:\nWe can make this shit hot or we can keep it cool\nBut as soon as a nigga violate the rules\nI get the spot hot quick, (Yo, Kel be illin' and shit)\nCause I be comin' down the block with the pistol grip\nWith all this violence in the world how could I not be a crook?\nI could stick a nigga up with my mean fuckin' looks\nMake a bitch drop her draws, gab the microphone and pause\nThere's many casualites of war, Killer Kel is at the door\n\nHook\nWho you wit? (Def Squad) Where you at? (L.O.D.)\nWho you wit? (Def Squad) Where you at? (L.O.D.)\nWho you wit? (Def Squad) Where you at? (L.O.D.)\nWho you wit? (Def Squad) Where you at? (L.O.D.)\n\nKeith Murray:\nI be the mad, mad scientist, mad conquesting\nGetting quick dough like off-track betting\nOverall you niggas be dead on arrival\nMeanwhile me and Kel be buggin' off survival\nMy supporting cast will bust that ass\nI got a beeper and a phone but you can find me on the Ave\nY'all niggas definitely ain't got nothing fur us\nWe'll take it to the streets on Stallone and Chuck Norris\n\nKel-Vicious:\nYou can wake up call, I got the intchy finger ya'll\nCan''t be sleeping on the block cause that's when I clock\nAnd it's New Jack City\nSmackig Motherfuckers out like bitties\nBoy your bad, boy your rude, boy our vicious\nFuck it, niggas get bust now for lookin' suspicious\nI got a 9, pack 9 lives like a cat\nWord is bond, niggas try to bust I bust em back\nAnd I don't give a fuck about me or you\nI damage your whole family plus your crew"}], "artist": "Keith Murray"}