{"artist": "Warren G", "songs": [{"year": null, "lyrics": "[Verse 1 - Warren G]\nPut it together from the start with the homie\nCouldn't picture ever having to part with the homie\nAnd even though you're still here in the flesh\nIt's different on the West, your voice is truly missed\nThe missing piece, I'm saying it ain't the same\nNever leave you alone, praying for one more day\nWho these niggas come and get their hooks from\nWhen they need their radio shit spun? Nate number 1!\nA true artist indeed, you made your own lane\nAll these albums we drop will never be the same\nWithout your voice on them. I'm thinking that's the key\nChoked up, smoked out, riding to these melodies\nReminiscing memories, on my way to visit you in therapy\nHoping God make it clear to me on what the plan is\nThis dirty game is hella-scandalous, so this right here\nIs dedicated to Nate\n\n[Hook]\nThis is dedicated to you\nIt's really something special\nMaking dreams come true\nSeems hard to figure out\nBut that's what it's all about\nThis is dedicated\nThis is dedicated to you\n\n[Verse 2 - Warren G]\nFrom the dope spots, to popping on the charts\nGrinding in the beach to make it on the streets\nTouring overseas, submitting legacies\nWriting history with every song you sing\nRegulating the era, staying side-by-side\nAnd we gamble whatever. was the days of the past\nNow I'm looking to the future like\nI don't even wanna do music!\nBut I gotta keep it crackin\nIt's a challenge when your homie's talent\nHanging in the balance and life is such a trip\nI know the world is full of maddness\nLearning how to walk and talk again? I can't imagine..\nWhat that rehabilitation is like\nWhen that doc said that you couldn't sing on the mic\nWhat the Hell is going on?\nHe's been writing songs\nHell no, that ain't Nate Dogg!\n\n[Hook]\nThis is dedicated to you\nIt's really something special\nMaking dreams come true\nSeems hard to figure out\nBut that's what it's all about\nThis is dedicated\nThis is dedicated to you", "image": "https://images.genius.com/5686f9398745abf989ef2336fa794264.307x307x1.jpg", "album": null, "title": "This Is Dedicated To You (Nate Dogg tribute)"}]}