{"artist": "Young Thug", "songs": [{"year": "2015-04-17", "lyrics": "[Intro: Young Thug]\nPour that shit up fool, the sauce\nHa\nMonster!\nMan so you ain't gon' pour?\nOh so you're gonna make a nigga beg you to pour?\nOkay bool, You dig?\n(Wheezy Beats)\nUh\n\n[Verse 1: Young Thug]\nHopped out my mothafuckin' bed\nHopped in the mothafuckin' coupe (Skrrt)\nPulled up on the Birdman (Brr)\nI'm a beast, I'm a beast, I'm a mobster (Ayy)\nYou got 50 whole bands, you'll be my sponsor (Just for the night)\nThem snakes on the plane, me and Kanye-conda (Anacondas)\nYeah (Them anacondas)\nI might piece him up and let my partner smoke him (Triple cross)\nChuck-E-Cheese him up, I pizza him, I roll him (Cross)\nI'm a gangster, I don't dance, baby I poke\nRight now I'm surrounded by some gangsters from Magnolia\nI heard I put it in the spot, yessir she told me\nMy niggas muggin', these niggas YSL only\nI heard my Nolia niggas not friendly, like no way\nBut we not friendly either, you know it\nHa!\nYeah, thumbs up\nI've seen more holes than a golf course on Donald Trump's course\nMy bitch a tall blooded horse, nigga, bronco\nAnd if you catch us down bet you're not gon' trunk us (No)\nYou got a body, lil' nigga, we got a ton of 'em (Yeah)\nYou got some Robin's, lil' nigga, we got some Batmans\nI let that choppa go \"blocka, blocka,\" get back, son (Back)\nYou got them MJs, nigga, I got them Jacksons (Racks)\n\n[Chorus: Young Thug]\nBut really what is it to do\nWhen the whole world constantly hatin' on you?\nPussy niggas hold their nuts, masturbatin' on you\nMeanwhile the fuckin' federal baitin' on you\nNigga tell me what you do\nWould you stand up or would you turn to a pussy nigga?\nI got a hundred things to do\nAnd I can stop rappin' but I can't stop stackin' fuckin' figures\n\n[Verse 2: Birdman & Young Thug]\nYeah, I'm from that mothafuckin' 'Nolia, nigga ('Nolia, nigga)\nBirdman'll break a nigga nose, lil' nigga (Nose, lil' nigga, ah)\nYou need to slow your fuckin' roll, lil' nigga (Roll, lil' nigga, Thugger)\nWe created Ks on shoulders, nigga (Shoulders, nigga)\nI'm a scary fuckin' sight, lil' nigga (Sight, lil' nigga, ah)\nWe won a hundred mil' on fights, lil' nigga (Fights, lil' nigga, hey)\nA hundred bands, sure you're right, lil' nigga (Right, lil' nigga)\nI keep some AKs on my flights, lil' nigga (My flights, lil' nigga)\nBirdman Willie B (What?)\nSmoke some stunna blunts, now my eyes Chinese (Chinese)\nHundred K on private flights overseas (Overseas)\nChoppas City nigga, free BG (BG)\nBentley with the doors all 'round, not a Jeep (Jeep)\nRich nigga shit, smoke two pounds in a week (In a week)\nCan't find a bitch that don't know we them streets (We them streets)\nBitches know that I am Birdman, that's OG, brrat\n\n[Chorus: Young Thug]\nBut really what is it to do\nWhen the whole world constantly hatin' on you?\nPussy niggas hold their nuts, masturbatin' on you\nMeanwhile the fuckin' federal baitin' on you\nNigga tell me what you do\nWould you stand up or would you turn to a pussy nigga?\nI got a hundred things to do\nAnd I can stop rappin' but I can't stop stackin' fuckin' figures\n\n[Verse 3: Young Thug]\nNigga, I'm a crack addict\nThought about lettin' them get a cut\nThen I went and snagged at it\nYeah, the new Boosie Badazz at it\nI'ma drop a nigga life, just like a bad habit\nI stick to the ground like a mothafuckin' rug\nI'm a big dog, lil' fuck nigga, you a pup\nLil' bitch, clean your drawers before you think you're a thug\nBefore I be in front your shows, just like your pub\nI ain't even lyin', baby\nI swear to God I ain't lyin', baby, no\nFirst I'll screw you without these pliers, baby, or\nI might dap you like, \"good try, baby\"\nBig B livin', baby\nThem boys on my left throwin' up Cs\nI promise their mama see them this week\nAnd I don't break promises with my Ds (Them my dogs)\nI want Ms and cheese, mister Mickey Ds\nShe know I am a beast, I am so obese (Rrar)\nIn Miami I swear they don't got good weed\nWiz Khalifa can you send me some weed please?\n\n[Outro: Birdman]\nYeah, overseas, nigga, top floor, clear windows, nigga\nGlass house, drankin' GT, you understand?\nWe in that Red Light District, you understand?\nWe 3 and 1, that mean 3 on me, nigga, you understand me?\nJust livin' the life, boy, ayy, Thug, just a dollar for a 1, nigga\nWe can blow a mil', boy\nRich Gang, YSL, blatt!", "image": "https://images.genius.com/084203fc03bd5fad8a33a46d02f4a265.1000x1000x1.jpg", "album": "Barter 6", "title": "Constantly Hating"}]}