{"artist": "R. Kelly", "songs": [{"album": "Untitled", "year": "2009-11-30", "lyrics": "Yo drama, Skee, lets do a lil something for the ladies\n(gangsta grills) (dj skee)\nEh, Eh Ehyo, ehyo, ehyo\nFeel so freaky\nI...feel so freaky\n\nTheres something 'bout, the way you look at me\nAnd its got me imagining and seeing things\nLike us both in a room, in my domain\nIm bout to blow up in here like a hurricane\nAnd I can't take it no more and you can't fake it no more\n(playing hard to get girl), Please leave that thought outside the door\nCause the truth of the matter is that you want me and I want you uh\nSo lets quit playing around and lets get our ass under this cover\n\nTheres so many things (i wanna do to you)\nAnd theres so many things (i want for you)\nOn this night, ill make sure you won't regret\nWhat you and me did in this bed\n\n(chorus)\nGirl, we'll be banging, banging, banging, b-banging the headboard\nBanging, banging, banging, b-banging the headboard\nBanging, banging, banging, b-banging the headboard\nBanging, banging, banging, b-banging the headboard\n\nAnd oooohhhh, it feels just like we're floating in this room\nAnd no water could put this fire out in you\nAnd ain't no other girl on this earth I choose\nBaby but you\nAnd Im gonna rock that body fast asleep (girl once you've had enough)\nAnd you're gonna give that body back to me (as soon as you wake up)\nStart it all over again\nSecond, third, fourth, fifth, sixth wind\nTo the morning comes, i'll be going in, yea\n\nTheres so many things (i wanna do to you)\nAnd theres so many things (i want for you)\nOn this night ill make sure you won't regret\nWhat you and me did in this bed ohhhhh\n\n(chorus)\n\nBaby, hold the pillow tight, its 'bout to be a wild night\nSqueaking the bed (and we're gonna make the walls bang)\nSqueaking the bed (and baby girl, I hope that you can hang)\nOooohhhh. oooohhhh. those are the sounds that we're making\nWhen we're banging, banging, banging\n\n(chorus)\n\nWe're gonna wake the neighbors up\nCause you're screaming whiles im tearing it up\nBaby, dont stop 'till the morning comes", "title": "Banging the Headboard", "image": "https://images.genius.com/5a944a10bb0940f7591a3793da77ca12.550x550x1.jpg"}]}