{"artist": "Pacewon", "songs": [{"album": "Telepathy", "title": "Rocking with the Best", "image": "https://images.genius.com/a4515dd8ef93057384710db06a2ce521.500x500x1.jpg", "lyrics": "[samples from KRS-One]\nYes... say yeahhh!\nYes... yeahhh!\n{\"You now rockin with the best\"} say yeahhh! {\"So why try and test\"}\n{\"You now rockin with the best\"}\nHerrrre we go\n\n[Pacewon]\nThe rabbit kicks the bucket I could give a fuck about it\nYo I'm still the same nigga that a motherfucker doubted\nBut succeeded you can't beat it guess you niggas need to join it\nI'm responsible as shit, never leave you dissapointed\nI'm the underground legend, the lord of the realm\nWhere you battle for your name then record it on film\nThen you send it to the internet, flexin your intellect\nBitches goin crazy, little kids start spinnin it\nReply that quick, reporters askin for details\nMy fuckin inbox jampacked with e-mails\nI'm fuckin blown up, I never knew I'd be well known\nGettin caught creepin bitches checkin my cell phone\nBut, other teenyboppers hang with a rhyme clique\nBe hawkin me to smoke and always want me to sign shit\nSo I tag 'em up, smoke they weed then step\nWhat can I say?  I'm they dog like DMX, the one!\n\n[Hook]\n{\"You now rockin with the best\"} yeahhh! {\"So why try and test\"}\n{\"You now rockin with the best\"} yeahhh! - PACEWON!\n{\"You now rockin with the best\"} yeahhh! {\"So why try and test\"}\n{\"You now rockin with the best\"} yeahhh! {\"So why try and test.. the best\"}\n\n[Pacewon]\nNine said to be the best you gotta challenge the best\nSo to some I pay homage and embarass the rest\nGet a talented test, keep a balance in this\nLike the bond between parents and kids you see\nIt's a whole lot of MC's crowdin the throne\nSo I stepped up and pulled the sword out of the stone\nLike, gimme mines, speed across city lines\nCock the semi-9, could flip at any time\nAnd uhh, I know that you know that, you know that I know that\nYour lil' freestyle raps ain't where my flow at\nMy flow is well thought out, plotted and planned\nHotter than that white boy is, hotter than Cam\nMore hotter than Loon and that's just to start with\nI piss on your wall, shit on your carpet\nTake your homey to trial like Ken Starr did\nSee 'em drivin and scream \"Get out the car kid!\"\n\n[Hook] w/ variations\n\n[Pacewon]\nAll I do is write raps, smoke weed and guzzle Henny\nCame and broke down the door when you niggas wasn't ready\nNow you hatin on a brother cause you hungry cause you envy\nWant my Beamer, want my Benji's, bitch nigga come and get me\nYou can find me in New Jerz, in the Bricks, on the same corner\nWaitin with a 9M slug with your name on her\nCatch your lil' punk crew in the streets\nKnock off the top dog, give him 2 in the knees\nSnatch lil' man, smack dude in the teeth\nI do it with ease, it's like shootin the breeze\nI'm the reason and the rhyme, the style you don't lose\nYou niggas all talk, no soul/sole like old shoes\nYou nice?  The king of the mic?  Show proof\nGo platinum, 1 point 5, go 2\nGo anything you can, go gold, go copper\nGo triple diamond, I'ma still flow hotter\n\n[ad lib scratches to the end]", "year": null}]}