{"artist": "Cage", "songs": [{"title": "Cage, Vast Aire, El-P & Mr. Len’s MySpace comments on Camu Tao and Def Jux", "album": null, "year": null, "image": "https://images.genius.com/f01cacc8ef712f592d3a44e9ad9a2392.285x285x1.jpg", "lyrics": "Cage\n\n\n\nRemembering Camu Tao\nMay 25th 2008 I got a call informing me Tero had passed away.I had just spoken to him days before this call.We were working via phone on a song he produced for me(Follow the Bleeder)I could hear he was in the hospital and I asked him if he was alright and he said he wasn’t feeling well and just had to get some things checked out.”Don’t worry”he said”I will be okay, I will talk to you later when I get out of here.”That was the last thing Camu ever said to me.Life hasn’t been the same.He was my closest friend.I spoke to him more than I spoke to anyone in life.I am still bitter and everything has lost it’s flavor no matter how surreal everything is right now.And I know he would be jumping up and down saying ‘YEAH WE DID IT” (something he would always say whether or not it had anything to do with him)He had the ability to celebrate the smallest accomplishments and get me in hysterics about anything.He helped me in music and more importantly he helped me in life.He was a beautiful person with an effortless talent and I know people throw the word genius around loosely to compliment each other or in some cases themselves but TERO SMITH WAS A MUSICAL GENIUS.I miss him very much and I will never be the same again.I think of him everyday\nRest In Peace brother\n\n\n\nListen to Camu Tao songs all day today and remember\nI listen to Camu Tao songs everyday and so should you\nIt bothered me very much to see a lot of his enemies claiming this Love they had for him the day after he passed but none when he was dying for a year and a half.Some of you made it right with him before he died.I can understand except one person and in honor of Tero a true shit starter and fire ignitor I would like to out VAST AIRE you are a LIAR and Camu hated you and you know it.You shit on him when you knew he was dying.You disrespected his fiancee weeks after his passing with disrespectful emails.”Camu is in heaven looking down at you laughing at you” said Vast Aire to Camu’s fiance when she asked him to not go on a “hold the floor tour” and profit off of his death.”Camu owed me money from years ago” said Vast Aire(which is a lie)If those emails ever see the light of day you would vomit upon reading. The last you spoke to him was about 05 I believe.What goes around comes around.It was Camu who ousted you from WM when you were stealing from Yak and Tame on The Teen Wolf Tour and it was Camu who named you “SLOB BLOB SWEAT PANTS” If you use this day as a day to remember you should remember how you wronged a dying man with Cancer before AND after his death\nYou use my beloved friends passing as a fucking tag line in your interviews and it is Vast Aire who I am talking about in Nothing left to say\nThat was for you Mu\n\n\n\nI am deleting this section. I was extremely angry this morning and I lashed out. I shouldn’t have and I know it’s still out there. I know Camu would be laughing at this because this was right up his alley but I was wrong. I guess in doing this I felt closer to Mu. I wasn’t advised by my publicist to write this, I am doing so on my own accordance. This is a day to remember the fallen. It was childish to indulge in this negative act of hatred\n\nI apologize\n\nBelieve me there is no other reason I am taking this down.I don’t want to promote this sort of thing and it will ultimately bring me back to a negative path\n\nC.Palko\n\nA message to Theodore Arrington becauseI was blocked on his myspace:\n\nI attacked you unsolicited and I should have let it be.I miss Camu that much.You can keep your threats up if you like and attack me if you are hurt by the blog.This has nothing to do with anyone else you attacked in your blog I acted alone.There is no need for your racist remarks either,thats just pointless.I was wrong to disturb a day of remembering people we lost. If you do smack my hair wait a little while,I just got it cut\n\nPeace\n\nI will NOT approve slander against this dude in comments\n\nPeople make mistakes\n\n\n\nVast Aire\n\n\n\nFUCK CAGE & WEATHERMEN\nFirst off RIP TO CAMU TAO-, i know how close we were, and i dont have to flash it over the net, like some of these fake wannabe’s\nCage shitted DEF JUX, he used to shit on EL-P & EL-P’s girlfriend kathrine!!! who works for BIZ 3 ENT. HE EVEN Wanted to leak EL-P’S FAN DAM LP!!!!!!!!\nCage is a liar and a fake. i remeber when cage hated on def jux and wanted to put WEATHERMEN records ONLY on EC. BUT NOW THERE NO EC, HE HAS TO JUMP ON DEF JUX’S DICK\nI think CAGE IS AN ATTENTION WHORE, I FIND IT FUNNY THAT HE PUTS OUT THIS BLOG RIGHT AFTER SLIM SHADY’S NEW LP???? I GUESS HE STILL ENV’Y SLIM AND NECRO’S CAREERS?????\nON THE REAL, STAY IN YOUR HOUSE CAGE, LIKE YOU ALWAYS DO, YOU KNOW DONT LEAVE THE SAFETY OF YOUR QUITE WHITE SUBURB!!!!!\nYOUR FULL OF SHIT, HOW DARE YOU START BEEF RIGHT NOW, WHEN YOU SHOULD BE THINKING ABOUT YOUR CAMU??? INSTEAD YOUR WRITTING BLOGS ABOUT ME?\nTAKING CHEAP SHOOTS!!!!!!!!!!!!!????????/\nI HAVENT SEEN OR THOUGHT ABOUT YOU IN 4 YEARS??? I HAVENT BEEN IN WEATHERMEN IN 3 YEARS? I DONT THINK ABOUT YOU???\nSO WHY ARE YOU BRINGING ME UP?\nLAST BUT NOT LEAST, I WILL FUCK YOU UP, AND YOU ALL KNOW THIS!!!\nWE CAN SHOOT THE FARE ONE WITH A CAMERA ON SINCE YOU LIKE TO MAKE SEENS!!! CAGE IS A WANNABE THUG WITH FAKE PAIN!!!!????\nWHERES YOUR BLACK FRIENDS AT? EVERY BLACK KID HAS LEFT DEF JUX BECAUSE WE ARE TIRED OF THIS “WEAK WHITE BOY ….IM ON PILLS THAT NEED ALOT OF ATTENTION BULL SHIT!”\nIM RIGHT HERE!!!! I LIVE IN BKNY! GUNSET! YOU CAN ALWAYS CATCH ME IN HARLEM!\nIM RIGHT HERE!!! CAGE IS A BITCH\nALL REAL HEADS DONT FUCK WITH THEM ANY MORE!!!!\nWHERES SPACE AT?\nWHERES BMS AT?\nWHERES MR LIF AT?\nWHERES CANNIBAL OX AT?\nWHERES C-RAYZ WALZ?\nWHERES MURS?\nWHERE DJ LEN?\nWHERES BIG JUS?\nWHERES RJD2?\nWHERES COPY?\nWHERES ALL YOUR STREET CRED????\nCAN ANY WEATHERMAN TALK A WALK IN EAST NY OR HARLEM?\n{I GOT LOVE FOR THE JUGGANOTS} BREWIN IS THE ONLY ONE I TRULY RESPECT AFTER ALL THIS TIME!!!!!!! I BET YOU BREWIN ONLY HAS ONE OR 2 VESES ON THAT NEW TRASH WEATHERMEN LP!!!!\nAS YOU CAN SEE, EVERYBODY WITH A LIVING SOUL HAS LEFT YOUR FAKE DEF JUX / WEATHERMAN CAMP SO YOU AND YAK-BALLZ CAN HAVE SWORD FIGHTS IN THE DARK!\nBY THE WAY THE REAL WEATHERMEN ARE DOWN WITH REAL BLACK PEOPLE IN THE STRUGGLE\nALL YOU DO IS SIT AT HOME, AND CRY ABOUT YOUR DAD WHO PUT HIS FINGER BUTT WHILE HE DID HERON!!!! GO WRITE A SONG ABOUT THAT!\nYOU ARE A REAL LOW LIFE! I DARE YOU TO COME OUT OF YOUR HOUSE FOR 20 MINS!!!!\nWHAT PART OF NEW YORK DP YOU LIVE IN NOW? THE TRASH CAN?\nYOU LOOK LIKE A FAKE BEATLE, IM GONNA SMACK THAT HAIR CUT RIGHT OFF YOU HEAD!!!\nVAST AIRE-\n\n\n\nSAY WORD…CATS GOT BEEF?\nIts this simple, cage was wrong to come out of his face, and now he has dug his own grave. why disrespect camu tao like this? i dont have to prove anything. SA SMASH HAS ALWAYS BEEN MY FAM!\n\nIts sad to know these kids are holding mad shit in their little heads,  all i know is NOBODY can say i stole anything!!! you should get the facts before you run your mouth and make a fool out of yourself, you should be thinking about your transformer “buddy” and not me!\n\nHow could i steal form tame? who told you that your girlfriend yak ballz?\n\nAll you do is talk shit on a comp, or a 2-way, this is why you dont know shit\n\nBut its cool\n\nI will see you-\n\nV-\n\n\n\nFIRST, PEACE LOVE AND RESPECT TO CAMU TAO {R.I.P.}\n\nI would like to say i never started any beef, but i will put an end to it\nIm going to answer some questions from the fans so a basic understanding can be reached\n\nWHY DID YOU LEAVE DEF JUX? AND WHEN?\n\nI left def jux in late 2002 / 2003, i started working on my lp “Look Mom No Hands”\nAt this time, me and camu {SA SMASH} were living together in BKNY. camu was working on “Smashy Trashy” his only lp on Def jux. at the time, Def jux was trying to expand their amount of artist, and they started giving out “recording advances”. at the time COLD VEIN had sold over 100,000 cd’s and a maxi single of the F-word sold about 30,000 at the time {140,000 records sold}\n\nCan ox at the time didn't have a “deal”, we recorded everything as friends, but we blew up over night, and def jux didn't know how to handle it, so you can imagine that can ox was mad! {CAN OX WAS ONLY MAKING MONEY FROM SHOWS}\n\nWe built this label with you {el-p} but your giving money to outsiders first????\nDEF JUX SHOULD HAVE PAID CAN OX AND RJD2 BEFORE YOU PAID MURS AND 9TH WONDER, C-RAYZ AND ETC? {PEACE TO THEM, IM JUST MAKING A POINT}\n\nAt this time, dj Mr Len told me that El-p’s biz-partner {DEF JUX / OZONE} Ameechi stole $5000 from co-flow, and this is why MR LEN didn't hang around or do cuts for def jux any more!!!!\n\nSo, its 3 years after my great lp {cold vein} blows up, but el-p and ameechi dont have any money for me and vordul??????? but more than 5 groups are getting advances????\nAND MR LEN SAID $5000 WAS GONE! DUE TO AMEECHI!???\n\nTHAT STARTED A HUGE BEEF! me and el-p had some VERBAL fights, and i moved to red hook brooklyn. this is when me camu and metro had a crib, they moved from ohio to do their lp for def jux\n\nCAN OX GOT A LAWYER AND THEIR MONEY…but the vibe was different, its like when your girl friend catches you cheating, its never the same after that! we should have never had to chase our own money!!!! we could record as friends, but when it was time to pay me i was told to get a lawyer?????\n\nSo we {can ox} wanted to move forward, but when it wasn't the biz problems, we had creative problems and lack of control\n\nEl-p is a control freak, if he can't produced every song, he starts to throw fits! at this time {2003} im getting crazy ill beats from Mf doom, Madlib, Ayatollah Camu tao etc\nI wasn't thinking about el-p, his sound was dope, but its was limited. it was the same type of style, i wanted something new, and i wanted control! hence the name LOOK MOM NO HANDS! all that meant was “freedom” at def jux in those days, el-p was censoring a line or 2 out of dudes rhymes. i watched him do it to camu tao and vordul mega!\n\nEl-p told camu tao he could not “slap a girl” in his rap song, and he told vordul “you put to many ‘nigga’s’ in your raps”\n\nThe last thing i needed was some emo white kid telling me how many ‘niggas’ i can have in my rap songs! and one of my favorite hip hop songs is “top billing” and in that song milk says very clearly “if your girl is out of line…its your girl i slap” and as far as black people using the word ‘nigga’ Q-tip already broke that down! so ME CAMU AND VORDUl hated that day! this is why i left def jux bad biz and lack of creative control!\n\nWHAT WENT DOWN WITH CAN OX’S 2ND RECORD?\n\nTo be real, we started that project, but vordul dropped the ball on that, vordul became very distant and was drunk and coked up all the time, he became this way after his jaw was broken in a bar fight that was ment for el-p. long story short, that helped wake up vorduls “dark side” and we only did like 5 songs. El-p got mad at me as if i should have been vordul’s baby sitter! vordul is a grown man, he made his choices, dont get mad at me! so then we had our final fall out and the last thing we recorded was Mr Lif’s songs “Brothaz rmx wit can ox” me and vordul are cool, and we still are recording! thats my family! he’s on my new lp “OX 2010″\n\nWHY DID YOU LEAVE WEATHERMEN CREW?\n\nAT THIS TIME….I WASNT ON DEF JUX BUT I WAS STILL A WEATHERMAN MEMBER!\nI did a Tour with SSS {TAME ONE AND D-DONS in late 2006} with my homie 4th p, it was called the teen wolf tour, it was fun and cool, but then it turned for the worst!\nCage claims i took money from yak ballz and tame one????\nAccording to whom since cage wasn't on the tour??????\n\nThe tour was set up for me to get an average of about $850 a night {i was told i was going to get $1000 to head line, but i left it alone because im wit my peoples, SO I THOUGHT}\n\nOne of the shows was not part of the tour, it was a show i already had as a solo artist, but i added it to the tour {teen wolf tour} long story short, I should have gotten $900 dollars that night, but yak ballz felt i should take $750. now….i understand yak ballz was paying for extra gas {and i was also} and i understand that yak was feeding Tame one {and so was i} but he had no right to to try and get more money from a show that was never his? he got the same money he got every night, that $150 or $75 bucks had nothing to do with him? AND ITS IMPOSSIBLE FOR ME TO STEAL MY OWN MONEY!\n\nSo if that makes me a crook, then im muthafuckin robin hood!\nI dont have anything to hide! i gave yak the $150 THE NEXT DAY! we had 4 more shows and i wanted to dead the beef, but i made it clear it was my money to begin with!\n\nAlso on that same tour we had dinner at a mexican spot, and we all are talking about projects etc. i told every one at the table {yak included} that i didn't like aesop’s new lp at the time {bazooka tooth} I LOVE AESOP! but i didn't like that record, all i said was “you can't hear his words anymore” and yak turned that into me being a hater!!!!\n\nMeanwhile all these bitch emo kids do is talk shit about you in emails, blogs and or 2-ways!\n\nTame showed me a 2-way convo with cage trying to get votes to kick me out of weathermen! THATS RIGHT TAME SHOWED ME A 2-WAY EMAIL WIT CAGE TRYING TO VOTE ME OUT! SO BEFORE THE ELECTION WAS DONE, I LEFT THE NEW LEFT. BECAUSE I KNEW THEY WERE ALL FAKES\n\nAT THE END OF THE DAY IF CAMU HATED ME, WHY IS HIS RIGHT HAND MAN {METRO} CLOSE FRIENDS WITH ME AND IS ON MY NEW LP? WHY AM I STILL COOL WITH ALL OF CAMU’S OHIO PEOPLES LIKE BIG JT!!!!!!!!!!!!!\n\nMETRO IS PROOF THAT ME AND CAMU WERE GOOD, HOW ELSE DID I GET MY BEATS FOR MIGHTY JOSEPH {BLOOD SPORT PROD BY CAMU!}\n\nTHE ONLY LIARS AND CROOKS HERE ARE THESE EMO BITCHES!\n\nLike i said before if they are angels that never did nothing wrong\n\nWHERE IS\n\nSPACE?\nBIG JUS?\nMR LEN?\nJ-TREDS?\nBREEZLY BREWIN?\nC-RAYZ?\nMASAI BEY?\nMURS?\nRJD2?\nCAN OX?\nMR LIF?\nAND B.M.S.?\n\nNONE OF THEM WORK WITH DEF JUX ANYMORE…LETS BE REAL ABOUT THIS!\n\nAnd look at cage’s history!!!!\n\nHe worked with NECRO?\nAnd HIGH AND MIGHTY?\n\n…ONLY TO TURN ON THEM???\n\nHE TURNED ON COPY, MASAI BEY, B.M.S. SPACE AND ME!\n\nJUST THINK ABOUT HOW CAMU FELT WHEN EL-P’S CENSORSHIP DESTROYED SMASHY TRASHY THE LP! CAMU HATED DEF JUX’S CENSORSHIP, IF HE HATED ANYTHING AT ALL!\n\nWHAT TYPE OF RECORD LABEL IS THAT???\nAND I CANT BE DOWN WITH A CREW OF “YES MEN”\n\nIF I DONT LIKE YOUR BEAT I DONT LIKE IT, YOU FUCKING EMO BITCH!\nAND EL-P IS A BITCH BECAUSE HE KNOWS CAGE SHITTED ON HIM!!!! BUT HE KISSES HIS ASS!\n\nANY REAL FAN CAN LOOK AT THE PATTERNS AND FIGURE IT OUT!\n\nLAST BUT NOT LEAST, I HAVE A SECRET UNRELEASED “BLAIR COSBY” SONG OF CAMU TAO DISSING DEF JUX AND EL-P!\n\nBUT, DID I RELEASE IT, NO!\n\nIM GONNA LET THEM KEEP DIGGING THEIR SHIT HOLE\nAND THEN IM GOING PRESS PLAY AND BRING CAMU BACK TO LIFE DISSING THEM!\n\nIF IM A LIAR, ASK METRO!!!!!!!!!!\n\n\n\nPEACE-\n\nOX 2010 COMING SOON!\n\nREAL RAP IS BACK!\n\n\n\n\"Battle of the Planets\"\n\n\n\nEl-P\n\n\n\nOk\nI have never wanted to participate in any sort of public ugliness with people i once considered friends.  its negative and builds nothing.  its only purpose is to hurt.  its a shallow action.  a desperate attempt to satisfy the ugliest parts of your ego.  there is no example of me disparaging, insulting, blaming, defaming or casting doubt on anyones character who i’ve had any type of real love for and considered crew at one point no matter how things may have turned out… no matter what they may say about me or what i may think about them behind the scenes. for me, i always thought it made one look small and angry.  i always felt like that type of public ranting and vitriol reflected failure, weakness, insecurity and pettiness and i’ve seriously regretted it when i’ve been involved in anything that resembles that, even peripherally.  as good as it feels in the moment it almost always backfires.  the same person who (non artistically) desperately seeks public affirmation of his anger and resentment ends up actually hurting himself more in the eyes of the strangers he’s trying to communicate with.  by the same token, defending yourself against that type of attack plays right in to the whole thing and immediately puts you on the same level as the person attacking you.  beyond that the fact is that for me,  the relationships that i’ve had in my life that have fallen apart make me sad, not angry.  the friendships that have ended in my life are a source of huge regret for me and i constantly wonder if there was something i could have done to change the outcome. so i don’t have it in me to kick and scream and curse the world for not handing me everything i think i deserve.  i’ll do that in my music, if need be.  its better that way.  that much i have learned\n\nI’m also not the type of person who feels like he’s a victim of circumstance.  every choice made along the line has different results.  it seems irrational and immature to me to create a world in ones head in which somehow, magically, there is an external reason that justifies every single reality of your life… and not one of those reasons is you.  a world in which you are just in every action and innocent in every interaction.  a life in which you only consider and retain the ideas that justify your perspective and completely ignore all other realities that exist and might, if you took a moment to consider them, make any (rational) person think a little longer before they lashed out and tried to destroy some one else’s character\n\nIt takes a special type of ego to literally delude oneself in to thinking that you have the moral right of way in every scenario.  it takes clinical insanity to think things are one way when in fact they are the opposite.  for instance:\n\nLets say (as a metaphor, of course) someone was morbidly obese but thought he was a ninja.  that would be kind of crazy, wouldn’t it?  or if that morbidly obese person didn’t make the connection between his eating habits and his weight.  crazy.  now if that same massively, morbidly obese person walked around calling people who were less than half his weight “fat”, how should they react?  on the one hand its obviously crazy for this hugely fat man to be calling you fat.  but on the other hand he keeps fucking saying it.  over and over.  to anyone who will listen\n\nI’ve tried to ignore it.  i’ve tried to squash it.  i’ve tried to take the high road because i assumed that like me, everyone must have better things to occupy their time with.  apparently not.  every other day there is a new vitriolic rant aimed at dismantling me or someone i care about, despite the fact that i haven’t fired one single shot in the direction they are coming from.  not one\n\nNow i don’t have any interest in trying to make anyone see things the way i see them or arguing about/defending the past.  i won't do the back and forth point by point defense with someone whos only path to generate any type of publicity for himself seems to be exactly that type of public argument.  a person who literally is interviewing himself in order to push a smear campaign forward.  a man who has made it his personal mission in life to focus all his energy on the very people who were close to the friend he claims to have loved with a constant barrage of misspelled and badly punctuated lies, insults, accusations, epithets, slander and threats.  someone who seemingly has no humility or perspective on his own fallibility.  someone whos anger has driven him to the edge of sanity.  whos own life is seemingly so joyless and directionless that the only thing he can think to do is reach out and try and inflict pain\n\nAnd by the way, when i say “close to the friend he claims to have loved” i mean close.  I’m talking that our lives will never be the same close.  the real deal.  the kind that comes with pain no one wants and that no one with a soul would brag about as though it were a credibility issue or as though love were something you had to prove as opposed to just feel.  not the idea constructed to make you feel good about yourself or justify your perspective in the eyes of other people or yourself.  friendship isn’t the collective little favors you’ve done for someone that you keep record of and hold against them even after they die.  its not a song you may have recorded with someone years ago and its not a conversation you may have had.  its bigger than that\n\nIts sad to me that you, and you know who you are, don’t understand that.  its painful to sit here and take your abuse knowing the true nature of your character and how utterly easy it would be to expose it.  the temptation to publish certain correspondences you’ve been a part of is overwhelming.  i have no doubt in my mind that any one who would see those would walk away from reading them with a very different perspective on your moral fiber and your character in general.  a younger me would do it in a heartbeat.  and yet what good would come out of it?  what are we all trying to prove to each other?  it would only lead to even more ranting, more insults and more bullshit.  no one would learn a thing and i would have wasted another minute of my life\n\nAnd i don’t hate you.  i don’t want to hurt or destroy you.  you were my friend.  i wanted you to succeed.  now i just find you to be a sad character.  twisted, angry and resentful and squandering your time on mean spirited pursuits.  its depressing\n\nNow i’m sure the person i’m writing this all about will just respond in his usual manner after reading this.  denial, anger, threats, capital letters, misused question marks and exclamation points and more accusations.  but i’ve got a suggestion for a better way to proceed… just let it go.  you’ve gotten your rocks off.  you’ve said your peace.  now make some music.  stop lecturing the world and contribute while you still have time.  none of this shit means anything.  at all.  go make the art you believe in and spend not one more second trying to take other people down or blaming people for the place you find yourself in life.  spend time with and cherish the people you love while they are still alive so you dont find yourself feeling like you have to defend the validity of your commitment to them after they’re gone.  be grateful for the things you have and wish no man harm.  be happy or die trying.  i know i will\n\nBy the way if you truly did love Camu and were close to him then I’m sure you feel the same pain my friends and i do.  if that really is the case then I’m sure the futility of arguing and fighting with people has never been more obvious to you.  it is to me\n\nIf you loved him then you are one of us… the heartbroken members of a club we never wanted to join… and I’m sorry for your loss\n\nEl\n\nPs:  im not going to be approving comments about this blog.  i didn’t write it to rally people against anyone or to create “sides”\n\nPps:  this is the only thing i have to say and i won't engage in any more and i won't be leaving this blog up for long\n\n\n\nMr. Len\n\n\n\nWant to set the record straight. I have no problems with Amaechi, El-P, or Def Jux. In fact, I did a little voiceover on EL-P’s last record. Amaechi didn’t steal money from Co. Flow. He and I have worked out our issue and its not anything for Vast to speak on. I can’t speak for anyone else, but as far as things with Mr. Len go, there are no problems. Not sure what is going on with Vast, but I’d appreciate if my name was left out of all things foolish. ie drama and beef"}]}