{"artist": "Waka Flocka Flame", "songs": [{"year": null, "lyrics": "[Chorus: Waka Flocka Flame]\nNiggas killin where I'm from, straight head bussin, nigga\nTell your ass I done be done, that's a done deal, nigga\nClame county Riverdail, we all\nBeat a nigga ass till they turn the lights off\n\n[Verse 1: Kebo Gotti]\nI'm Kebo Gotti, you know the name\nYou see the flare, you know the game\nSo what? you bang? I be on the same thing\nI got my money right now, you niggas can't maintain\nRunnin through a lame, stop all that puttin on\nI know you broke, you swairin that your money long\nYou the type to get mad when your girl speak to us\nCatch her in the club, she wanna leave with us\nTry me in the club, I bust you till your speaker bust\nAnd your nose runnin, and your head leakin stuff\nI got lil goons, that got lil goons\nLeave you all tied, in your living room\nMGM, that's my Cartell\nI got big deals, drugs, lean and pills\n\n[Chorus: Waka Flocka Flame]\nNiggas killin where I'm from, straight head bussin, nigga\nTell your ass I done be done, that's a done deal, nigga\nClame county Riverdail, we all\nBeat a nigga ass till they turn the lights off\n\n[Verse 2: Cartell MGM]\nWhere I'm from, you come up sellin Coakcaine\nSellin pills, sellin sweets, sellin everything\nSouth Atlanta raised, that's all I fuckin know\nRollin up a Cali blunt, flyin on the kick door\nUzis, fool, I got like 40 of those\nThat's a good lick, if you ask me though\nGoin all black, deep in the Tyhoe\nWe hit the front door, psycho hit the back door\nSlappin with the tool, dream like a fuckin hoe\nThey don't cooperate, make 'm kiss my 44\nStraight profit, gotta keep the cash flow\nIn my side of town, we keep it cutthroat\n\n[Chorus: Waka Flocka Flame]\nNiggas killin where I'm from, straight head bussin, nigga\nTell your ass I done be done, that's a done deal, nigga\nClame county Riverdail, we all\nBeat a nigga ass till they turn the lights off\n\n[Verse 3: Lil Capp]\nMy bros in this motherfucker, we on\nTrappin in this motherfucker, everybody knowin\nEveryone think we hustlers, cause we try to sell it\nHope you bout that action, hope you got your boots on\nOne phone call, you get your troops gone\nNiggas killin where I'm from, hope you bout your strap\nCause everybody from the Grove don't know how to act\nMy cousin down the road, he say he need a pack\nSo we kickin in them doors, where them niggas at?\nPut your set up, nigga, get your head wacked\nYou's a target pussy nigga, you's an easy jack\nSouth side on deck, nigga, we on\nBeast moad bullshit, that what we on\n\n[Chorus: Waka Flocka Flame]\nNiggas killin where I'm from, straight head bussin, nigga\nTell your ass I done be done, that's a done deal, nigga\nClame county Riverdail, we all\nBeat a nigga ass till they turn the lights off\n\n[Outro: Gucci Mane]\nSwag, call my swag stupid\nI pull up in a Mozerati, with aros like I'm Cupid\nAlli niggas hustle, all I do is hustle\nTrap boomin hard, how the fuck you think we trust you?", "image": "https://images.genius.com/2cdfcf18134d3a1853e72dd64f5b97e0.320x320x1.jpg", "album": "Duflocka Rant V.1 - 10 Toes Down", "title": "Clayco"}]}