{"songs": [{"album": "Strangeulation", "image": "https://images.genius.com/a97c6b9421fc6142eef43b7f37277096.500x501x1.jpg", "year": "2014-05-06", "title": "Fear", "lyrics": "[Intro: Mackenzie O'Guin & Tech N9ne]\nFear\nThis was the moment I feared\nFear\nThis was the moment I feared\nFear\nThis was the moment I feared\nFear\nThis was the moment I feared\n\n[Verse 1: Tech N9ne]\nReoccurring dream, I was falling\nDroppin' from something tall and\nJesus name that I'm calling\nThis is pretty deep how I'ma decorate the city street\nLittle bitty pieces, there's really gonna be some chalky drawings\nIn this dream I had, when I land\nI can taste the blood, I can smell the concrete\nAnd I can feel my bones crush on a calm street\nDark and desolate, my heart'll never get\nAnother beat I'm gonna be other head to split, my hell is credited\nWhere the red is in, I'm down and dead admit in light I'm dreadin' this\nIf we're created of God than predestination\nShould not be looked at as odd, when we're blessed to wake in-\nSide of a dream, like I've been here before\nAnd we sum it up with some french expression like we didn't hear the lord\nSo I'm hopin' and prayin'\nThat I won't be opened and sprayin'\nIn real life and it's just a dream, and it's not a thing that can sway my view\nBut my fear is that I end up layin' and ready for decayin'\nWhat I thought was a dream now it's Déjà vu\n\n[Chorus 1: Mackenzie O'Guin & Tech N9ne]\nFear\nIf I fall will the angels catch me?\nFear\nOr end it all is it my destiny?\nFear\nIs there a sound when the ground absorbs me?\nFear\nOr a dream tellin' me my story\n\n[Verse 2: Tech N9ne]\nI called up my mother, but who answered my brother\nHe said \"she real sick but I'm gonna put her on just tell her you love her\"\nMy heart it just fluttered when mama picked up she would utter\n\"Who is this?\" I said \"Donnie\", but she thought I was another\nDidn't even know me, and she's not an oldie\nIt's the lupus or epilepsy\nMaybe the psychosis solely\n\"This your son I just called to say happy birthday\"\nNot really knowin' me hit me in the worst way\nThen she said \"Oh yeah, little Donnie, how you doin' in school?\"\nI said \"I'm 42, mommy!\"\nI'll give my arm, leg, leg, arm, head if that means my momma get better\nToughest thing to swallow is when someone who raised you, they gonna forget ya\nI'm feelin' sadness, I'm feelin' anger\nSteady praying for the higher power to come down and change her\nRearrange her 'cause my fear is that the sickness in her mind\nIn due time it'll make her son a stranger\n\n[Chorus 2: Mackenzie O'Guin & Tech N9ne]\nFear\nA stranger to the one who raised us\nFear\nNameless to the one who named us\nFear\nBack to the place where it all began\nFear\nI'm seeing heaven but I fear it's the end\n\n[Verse 3: Tech N9ne]\nTaught to have faith in God\nBreakin' bread then we bakin' cod\nMakin' plenty then spread it abroad\nWash it down with a glass of Shiraz\nI try to walk the path of the righteous one\nBut this life is one, that's full of strife, let's run\nTo the mountain top\nWhat I'm 'bout to say if suckas starts to thinking this holy name\nI denounce then stop\nMan, I'm just sayin'\nI do a whole lot of prayin'\nAnd I wonder if it's listenin' to Aaron's nightly whisperin'\n'Bout mom in the tithe she's weakly payin'\nI know it's a blessing, that I raised kids 'cause I got skill\nAnd thank God that gangbang thing didn't bring me hot steel\nNow my mom's worse and a lot ill\nMy fear is that this God I'm prayin' to for my mother is not real\n\n[Chorus 3: Mackenzie O'Guin & Tech N9ne]\nFear\nExtinguish me from this world of fire\nFear\nFalse teachings taught by liars\nFear\nPrayers echo in an empty asylum\nFear\nNo salvation from man's messiah"}], "artist": "Tech N9ne"}