{"songs": [{"title": "Stop Playin", "lyrics": "AKIR - “Stop Playin”\n[Emcee(s): AKIR]\n[Producer(s): [?]]\n\n[Intro: AKIR]\nYeah.  I should have brought some cognac for this track, you nah’mean?  [?].  I guess we didn’t have to go through all this, man.  Stop playing them games, stop playing them games\n\n[Verse 1: AKIR]\nYo, yo, just for me to notice the way that you move, you got\nTo realize you got a brother losing his cool, hot on\nThe dance floor, smooth.  Tips on my shoes\nIs elegant.  Eloquent, you fit right in my groove\nI like your outlook on life, insight, and attitude\nGet hype, never fight, and just laugh and change the mood like\nThe Sun and the Moon, butterflies out of cocoon\nWe consume each other.  Lately, I’m feeling smothered, so I\nTry to make it work—though it hurts—and say it first\nAnd, ever since, you’ve been on defense, making it worse\nFlipping on me one day, telling me to go away.  “It’s over”\nAnd, on the next, telling me you want sex.  “Come over”\nAnd, at the same time, my frame of mind is like\n“It’s game time.”  Off the bench, nigga catching hang time\nFocused until the fame’s mine.  You got me still dealing\nWith strain, trying to get you off my brain.  Stop playing them games\n\n[Interlude 1: AKIR]\nWhy they be tripping, man?  All the damn time.  I don’t want to fight with you no more, baby\n\n[Verse 2: AKIR]\nYo, uh, uh.  She was a vibrant thing\nHer queen’s move checkmate the King Solomon\nIt’s time again.  Heineken from five again.  Me and\nCocoa first met as friends.  Now and then\nWe would talk, but then the script flipped.  [?]\nDarkness massaging my back.  Your dick lick the hardest\nShe laughed, saying I’m a game artist, gave me\nA kiss.  I felt her lips, grabbed her hips, and that was it\nQuick grabbed for the rubbers.  Now a slugger\nUndercover, watching, chasing lyrics, getting ideas\nAnd smash each other in the library, turn and laugh\nTurn and pass.  In the bathroom, in the pool, had this\nWoman gassed in excitement.  She liked it\nThe way she ride dick, I’m in love with this chick\nWhat girl you know that’s as real as a peep but keep\nIt elegant when you take the same girl in the streets?\nShit’s deep [?].  Yo, shit’s changed\nNew style, new age.  To be a player was\nThe way I was raised.  It’s a booby trap trying to get\nThe booty smacked.  Moody cats ratted on AKIR to mack\nCocoa hurted, then she snapped.  Thought I’d never get\nIt back but I did.  Come on, you know the kid\nShowed up.  We broke up.  No longer we roll\nSix months later, I seen her with my man on a stroll\n\n[Interlude 2: AKIR]\nDamn.  I don’t believe this shit, man.  There’s more fish in the sea, though.  Stop playing these games (Next chick, uh)\n\n[Verse 3: AKIR]\nPorto Roc, almond eyes, said I resembled Nas\n[?] she said, “Nah.”  Come on, AKIR’s on the rise\nI was young, dumb, full of cum.  Shorty type wise\nLast time I went to town, she said she recognized\nAnd, by surprise, I find myself chilling with Catty da\nIn a dorm room, lamping with my hands on her thighs\nPussy tight, shorty right.  She hit the books.  It was right\nKiller wife and she had the iller looks.  I did\nA show—you know how that go—after the show\nGrab some hoes, pour oz., blunts, and [?]\nFucking so much, a nigga need a tourniquet.  Came back\nTo Catty’s room, laying in the bed with a dirty dick\nCrazy heated, she asked me if I beat it\nWhat the fuck you dealing with?  Don’t worry ‘bout what Steve did\nKeep your questions.  The lifestyle of a wild ado-\n-lescence.  I was just coming in my effervescence", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}