{"songs": [{"year": null, "image": "https://images.genius.com/a0cc8fe946c04554a7d8c0e1032677bd.450x450x1.jpg", "title": "Double Shots", "album": null, "lyrics": "It's a celebration y'all, let's do it!\n\n(Havoc)\nYeah y'all\nBounce, yeah, bounce\nYEAH! Aight? Aiyyo..\n\nCats like, \"Hav', what the deal Dunn?\"\nNigga back on his grind, tryin to kill son\nA little shorty on some shit, oh she still frontin?\nBut jumped back on the dick when she saw me thumpin\nStraight short nigga oxin niggas givin 'em doctor stitches\nFirst chance I get, you know I'm shittin\nOn them fake-ass thugs, stuntin in the club\nDon't get scuffed in front of these broads\nHomey so pussy, what they do to they broad\nBeat them bitches up if they dance to the Mobb\nType of shit is that?\nThat won't stop her from lettin us blow her back, bounce to that\nHomey we got this locked\nLike champagne in a wino hand we gon' pop and\nHate on you lame-ass niggas, we need not\nCause first niggas hate on us, they get shot\n\n(2X Chorus)\nJust party, don't get yourself shot (uh-huh)\nLeave all the drama back home at the block\nAt the bar double shots goin down, straight chillin\nWhile the DJ, playin what I'm feelin (pimpin them hoes)\n\n(Prodigy)\nYeah, aiyyo\nI'm -- permanently bugged, genuinely thugged\nI'm hot-blooded, don't have me with the snub\nAll at you with the bullets that spray pellets, you fucked\nAnd I'm back up on shorty with the hourglass cut\nWe got mountains and we gon' have a smokefest son\nC'mon, feel like Vegas, we bringin home used paper\nAin't it amazin I'll stretch how we keep bangin\nWe got thousands to spend on them drinks gangsta\nQueensbridge, Mobb Deep like terrorists\nWe come through, blow shit up, America's\nNightmares right here live in the flesh\nOur blood and bone be sittin in Ferraris and better\nWe out in L.A. we drive our own cars, they not renters\nAnd take flights back home to hop up in some next shit\nWhile you tryin to get your hand on some cash\nWe never gotta touch money again, we got plas-tic\n\n(Chorus)\n(Noyd)\nFeel that nigga, yeah\nOkay yo, aiyyo\nAiyyo we ain't gotta lay, we can bang it out neighbor\nShit, 'til them fuckin flamers empty out player\nCause boy I thought you knew, don't confuse me with the music\nI'm on loadin nines up, ridin up, shootin it\nI'm hotter than the corner on the ave out in Newark\nI'm grimy, you find me where the loot is with Lugers\nThe bodies, the hotties, the hustlers and the shooters\nWith dudes that'll cut ya, that's what eatin your food is\nFools know the rules pull out your tools better buck it\nCause niggas be flaggin and braggin when they cut up your nugget\nKnee deep in the grind like \"fuck it\"\nWe gotta keep it real son that's only how the people gon' love it\nAnd learn to respect the Infamous to the death kid\nWe on another level, yeah we really on some next shit\nGot the techs spittin and makin more connections\nMakin more cash and blastin more weapons\n\n(Chorus)"}], "artist": "Big Noyd"}