{"artist": "Kevin McCall", "songs": [{"image": "https://images.genius.com/dc474965c85fc1ff8098634c82f6b64f.677x677x1.jpg", "title": "Yo Chick", "year": "2014-01-01", "album": "A.D.H.D.", "lyrics": "[Intro: Ty Dolla $ign]\nShe let me tag from the front (front), tag it from the back (back)\n(Dolla $ign)\n\n[Verse 1: Kevin McCall]\nTold myself I would never fight over a broad\nTill i was heartbroke and couldn’t get over a broad\nWas it true love? Who the fuck knows?\nWhacha think I did? Recruit a new ho\nI see bitches cheat on me with a nigga they love (love)\nSo when it come to bitches, I dunno who to trust (oh no)\nRick James said cocaine was a hell of a drug (yeah)\nBut cocaine ain’t got shit on fornication and love\nHow would you feel that I told you that I fucked yo bitch? (I did)\nNot yo EX girl, the-the-the-the one you with (???)\nYou should be ashamed for the shit she did (oooh)\nShit, whacha expect, these bitches devilish\n\n[Hook: Kevin McCall]\n\nYou already know that you can’t trust these hoes (Nah, nah)\nSo before you try to wife her up\nI think you should know, I...\nI fucked yo chick (chick) (Oh!) x2\nI'm telling you the truth, and now it's on you\nThese hoes ain’t sh... shit\nAnd you know this (Oh, woah) x2\nShe know it (Ooh woah)\nShe ratchet\n\n[Verse 2 : Ty Dolla $ign]\nShe let me\nTag it from the front (front), tag it from the back (back)\nIf I was you, I wouldn’t kiss that rack\nI was balls deep in yo bitch like a hole in one\nCall me Tiger Dolla $ign, bitch, I got more than one\nI don’t stress a bit, I just stretch yo bitch\nNow yo key don't fit, she call the locksmith\nI’m in this bitch, gynecologist\nI beat it up, I squashed it\n\n[Hook: Kevin McCall & Ty Dolla $ign]\n\nYou already know that you can’t trust these hoes (Oh nah) (These bitches devilish)\nNah, nah, so before you try to wife her up (wife her up)\nI think you should know, I...\nI fucked yo chick (chick) x2 (You know I did)\nI'm telling you the truth, and now it's on you\nThese hoes ain’t sh... shit\nAnd you know this (Oh, woah) x2\nAnd she know it (Oh, woah)\nShe ratchet (Yeah, ooh yeah, I fucked your....)\n\nAnd you know this"}]}