{"artist": "Bankroll Fresh", "songs": [{"lyrics": "[Verse]\nMy eyes on the estate, a couple whips, just need a lake\n5 star chef when we ate, asparagus filet the steak\n24K Fendi plate, Ace of Spade by the case\nAK come from Kuwait, AP get it up the face\n1.3 in the safe, 2 pairs of [?] came in today\nSaltwater aquarium, fish and squid versace gate\nLiving life like a don, no more living life on the run\nLouis Vuitton by the ton, sushi roll made by [?]\nFive hundred dollar lunch, lavish living that shit was nothing\nLost count on what I spent, muthafuck it I'm living once\nDesigner made vase interior, decorate my place\nMy lay couch for extra space, fresh as fuck ain't come to play\nMy bitch with me, yeah she likes Burberry drapes that cut the cake\nMore running, fuck the chasers\nBlue in master, blue in grape\n50 asking why you stay, 2 bad bitches to feed me grapes\nPour out a bottle of don, look how far a nigga come\nBrought out all the stick, all the clips, all the drums\nQuarter million parked in the project in the slums\nHandin' out hundreds to the kids, fuck ones\nSomething just to remember,  something you niggas never done\nWeekend in the cabin, me and my niggas having fun\nWeekend in Miami, beach crib bitches drunk\nMaybe at the lows royce, your palms are the sold\nRocking white ones, bubble gum on the soles\nRocking white ones, bubble gum on the soles\nWalking round this muthafucka, loaded fully loaded\nDully truck computer tho, FTZ the newest truck\nSuper model chew me up, Cuban link rubied up\nHow you living nigga? Im living fabulous\nCame from roaches everywhere, but now I'm having shit\nHow you living nigga? Im living fabulous\nWent from not having shit, to cameras bitch\nHow you living nigga? Im living Fabulous\nFuck all the average shit, I'm having it\nHow you living nigga? Im living Fabulous\nMan, Fabulous", "image": "https://images.rapgenius.com/17d26fbee2e0aad66471fb38d4353a50.400x400x1.jpg", "year": "2015-04-24", "title": "Fabulous", "album": "Life Of A Hot Boy 2: Real Trapper"}]}