{"artist": "Ice-T", "songs": [{"title": "Freedom of Speech", "lyrics": "Intro\n\nA-yo Ice, man. I'm working on this term paper for college. What's the First Amendment?\n\nVerse 1\n\nFreedom of Speech, that's some motherfuckin' bullshit\nYou say the wrong thing, they'll lock your ass up quick\nThe FCC says \"Profanity - No Airplay\"?\nThey can suck my dick while I take a shit all day\nThink I give a fuck about some silly bitch named Gore?\nYo PMRC, here we go, raw\nYo Tip, what's the matter? You ain't gettin' no dick?\nYou're bitchin' about rock'n'roll, that's censorship, dumb bitch\nThe Constitution says we all got a right to speak\nSay what we want Tip, your argument is weak\nCensor records, TV, school books too\nAnd who decides what's right to hear? You?\nHey PMRC, you stupid fuckin' assholes\nThe sticker on the record is what makes 'em sell gold\nCan't you see, you alcoholic idiots\nThe more you try to suppress us, the larger we get\n\nVerse 2\n\n[You have the right to remain silent]\nFuck that right! I want the right to talk\nI want the right to speak, I want the right to walk\nWhere I wanna, yell and I'm gonna\nTell and rebel every time I'm on a\nMicrophone on the stage cold illin'\nThe knowledge I drop will be heard by millions\nWe ain't the problems, we ain't the villains\nIt's the suckers deprivin' the truth from our children\nYou can't hide the fact, Jack\nThere's violence in the streets every day, any fool can recognise that\nBut you try to lie and lie\nAnd say America's some motherfuckin' apple pie\nYo, you gotta be high to believe that\nYou're gonna change the world by a sticker on a record sleeve\nCos once you take away my right to speak\nEverybody in the world's up shit creek\n\nVerse 3\n\nLet me tell you about down south\nWhere a motherfucker might as well not even have a mouth\nColumbus, Georgia, said they'd lock me up\nIf I got on the stage in my show and said \"Fuck\"\nSo I thought for a minute and said \"No\nI wasn't even gonna do a damned show\"\nCos for me to change my words from my rhymes\nIs never gonna happen cos there's no sell outs on mine\nBut I vowed to get those motherfuckers one day\nThey even arrested Bobby Brown and Cool J\nYo, they got their's comin', cos I'm mad and I'm gunnin'\nHomeboys, and there's no runnin'\nI'm gonna tell you how I feel about you\nNo bull, no lies, no slack, just straight fact\nColumbus, Georgia, you can suck my dick\nYou ain't nothin' but a piece of fuckin' shit on the damned map\n\nVerse 4\n\nFreedom of Speech, let 'em take it from me\nNext they'll take it from you, then what you gonna do?\nLet 'em censor books, let 'em censor art\nPMRC, this is where the witch hunt starts\nYou'll censor what we see, we read, we hear, we learn\nThe books will burn\nYou better think it out\nWe should be able to say anything, our lungs were meant to shout\nSay what we feel, yell out what's real\nEven though it may not bring mass appeal\nYour opinion is yours, my opinion is mine\nIf you don't like what I'm sayin'? Fine\nBut don't close it, always keep an open mind\nA man who fails to listen is blind\nWe only got one right left in the world today\nLet me have it or throw The Constitution away\n\nOutro (Jello Biafra)\n\nWhat they're trying to do with radio, with this, uh, McCarran-Walter Act and a lot of other ways, is start by saying that they're protecting the public from wicked rock bands, or girlie magazines, or whatever. But, if you follow the chain of dominoes that falls down what they're really trying to do is shut off our access to information itself\n\nIf they can't do it by law they know there's other ways to do it", "image": "https://images.rapgenius.com/8130dc496c2cedd8004532bb340c7c91.800x800x1.jpg", "album": "The Iceberg / Freedom of Speech... Just Watch What You Say", "year": "1989-10-10"}]}