{"artist": "Fat Joe", "songs": [{"year": null, "album": "Jealous Ones Still Envy (J.O.S.E. 2)", "image": "https://images.genius.com/4b84a410c9b855ea9a89253794bfc54b.500x500x1.jpg", "lyrics": "[Intro: Fat Joe]\nHo! Yeah\nCoca\nI can make you famous, ow~!\nWe live from Zip's in Harlem tonight\nTwo in the mornin (c'mon) Krillz!\nYeah, yo, yo\n\n[Fat Joe]\nHe thinks he's A, she thinks she's VA\nSingin in the mirror they think it's ea-sy\nBlue Lamborghini cause you heard Jeezy\nYeah your +Block Is Hot+ but you're not Weezy\nFirst class flights, star for a night\nBe like Russell, have a model for a wife\nSee Lorraine Schwartz, go and cop some ice\nHey! Even if you're dumb, you'll still be bright\nYeah, the red carpet, flashin lights\nJoan Rivers, shake face lookin extra tight\nUrbane leisure, lookin next and right\nAnd let me guess, man you probably havin sex tonight\nAnd you probably gon' give a rapper head tonight\nAnd when your dress come off he see the cellulite\nThen off you go, let the trumpets blow\nSpotlight is off ya it's the end of the show (y'know)\n\n[Hook - sung]\nEverybody wants to be famous\nBut the famous wants more to be left alone\nCause no one really wants to go through these changes\nPaparazzi snappin pictures at your home\nCongratulations (woo) baby you're a star\n(You hear that baby? You're a star, hahaha)\nCongratulations - the world knows who you are\n(The world knows you, at least for today)\n\n[T.A.]\nYo, yo\n\nI wanna be like Diddy, I wanna run my city\nA Billboard in Times Square, see that's me, yeah\nBest rap album what I'm shootin for every year\nPick a place player my name is heavy there\nIt's groupies everywhere and they all want me\nEven the young ones so I need ID\nStill ride hat low two-deep in a two-seat\nWhen I flow through don't ever try to confuse me\nI ain't tryin to be rude so excuse me\nWatch me two step in my brand new Louis'\nBounce, bounce bounce on the track\nEvery girl wanna know when T.A. comin back\nI'm famous, I made it, successful\nNow I'm less stressful, only eat the best food\nIf you work hard enough your dreams'll come true\nA star could be me or a star could be you\n\n[Hook]\n\n[Rico Love]\nYeah\nYo, too easy y'all, hahaha\nYo, hahaha\n\nAs we said I ain't a boss to not be lyin\nNow why you bitches labels got me drivin{?}\nNigga I'm in orbit, ball a whole bunch\nYou call that mortgage, I call that lunch\nAnd I'm so gorgeous, your wife might hunch\nAnd I ain't even gotta spike her punch\nWon't lose the end even if I lose a friend\nPen the big hits, I don't even use a pen\nHehe, I'm like Luther and them\nI cheese hard, now they wanna shoot through my grin\n... but I got bulletproof cheeks\nBust off on her like she got bulletproof sheets\nAsk B, rope for us\nPeep the fee, boats are plush\nAnd maybe I spoke too much\nBut if you want to win you gotta go through us\n\n[Hook]", "title": "Congratulations"}]}