{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/deada0ff4e2dc2960604dcfeac9f702a.720x720x1.jpg", "title": "Cool Points", "year": null, "album": null, "lyrics": "[Verse 1]\nLouis Vuitton, Dior for sure\nI just touched down, I'm tryna score some more\nMy personality is insanity mixed with wisdom\nToday the day they let my nigga Arc up out that prison\nSo we bout to hit the mall as soon as I come off tour\nHe showed me how to live, I owe him a little more\nIn this world where they say that you don't owe nobody nothing\nAll I ever had was my niggas, since a youngin\nOn the front porch, heard them shots it was nothin'\nDope boys had what the celebrities had, stuntin'\nSo being starstruck by the nigga from St. Clair\nBringing two or three whips out a year just wasn't fair\nAs a young nigga I looked up to that\nBut now I'm older, wiser, I don't fuck with that\nI'm trying to live for real, and get this paper and chill\nSometimes I wish the fame ain't come with these raps I spill\nAnd I blast to kill, I got that 40 on me all times, that's for real\nThis really my life, these ain't no acting skills\nCause you can act like you 'bout to bust a move and get killed\nWhoever look like they up to something, that's they ass\nI'm from where niggas shoot first and don't never ask, nigga\nYou better stay up on your current events\nFuck the mainstream, the world don't deserve this\n\n[Hook]\nNow have you heard of this nigga named Chip? (Cool points)\nChange up your life a bit\nDon't forget who got you here (Cool points)\nDon't be bumping that bullshit\n\nNow have you heard of this nigga named Chip? (Cool points)\nChange up your life a bit\nDon't forget who got you here (Cool points)\nDon't be playing that bullshit\n\n[Verse 2]\nI'm scared to go to sleep at night, I might not wake up\nI'm trying to shine, like something fresh out of Jacob\nI want to be good, but nigga I'm trying to cake up\nI need a bitch who a 10 before the makeup\nAnd if not, give me the pussy with no hassle\nI'm a king, where my crown, where my castle\nOn average I come near death like twice a week\nSee a Cleveland nigga on the street, we don't like to speak\nIf these hoes know what's up, are you DTF or what?\nMy lifestyle too fast to be your man, bitch don't hold me up\nAfter I ooze, I gots to make moves\nNiggas end up on the news for running up on them fools\nYo, my hood got its own government, fuck the rules\nLittle niggas in my hood got way too much to prove\nAnd not too much to lose, cause most of they fam in jail or dead\nAnd you wonder why them young boys never scared\nJust tryna get hella bread, too much pussy, hella (?)\nI'm just tryna do what I done cause these niggas never did\nTry to keep a level head, show 'em what this life about\nCorny-ass niggas stepping up to bat and striking out\nIf I hit the club I got that weapon on me always\nBut all I get is love, so we party and we all blaze\nVaporizer, get higher than the stratosphere\nAnd get some money, get some dome, and we outta here\n\n[Hook]\nNow have you heard of this nigga named Chip? (Cool points)\nChange up your life a bit\nDon't forget who got you here (Cool points)\nDon't be bumping that bullshit\n\nNow have you heard of this nigga named Chip? (Cool points)\nChange up your life a bit\nDon't forget who got you here (Cool points)\nDon't be playing that bullshit"}]}