{"songs": [{"year": "2010-11-22", "album": "My Beautiful Dark Twisted Fantasy", "image": "https://images.genius.com/e75f4944f774ecf594a06abb7482175e.620x617x1.jpg", "title": "Devil in a New Dress", "lyrics": "[Produced by Bink! and Mike Dean]\n\n[Intro: Kanye West]\nUh, uh\nI love it though\nI love it though, y'know?\n\n[Chorus: Kanye West]\nPut your hands to the constellations\nThe way you look should be a sin, you my sensation\nI know I'm preaching to the congregation\nWe love Jesus but you done learned a lot from Satan\nI mean, a nigga did a lot of waiting\nWe ain't married but tonight I need some consummation\n\n[Verse 1: Kanye West]\nMay the Lord forgive us, may the gods be with us\nIn that magic hour I seen good Christians\nMake rash decisions, oh, she do it\nWhat happened to religion? Oh, she lose it\nShe putting on her make up, she casually allure\nText message break ups, the casualty of tour\nHow she gon' wake up and not love me no more?\nI thought I was the asshole, I guess it's rubbing off\nHood phenomenon, the LeBron of rhyme\nHard to be humble when you stunting on a jumbotron\nI'm looking at her like, \"This what you really wanted, huh?\"\nWhy we argue anyway? Oh, I forgot, it's summertime\n\n[Chorus: Kanye West]\nPut your hands to the constellations\nThe way you look should be a sin, you my sensation\nI know I'm preaching to the congregation\nWe love Jesus but she done learned a lot from Satan\n(Satan, Satan, Satan)\nI mean, a nigga did a lot of waiting\nWe ain't married but tonight I need some consummation\n\n[Verse 2: Kanye West]\nWhen the sun go down, it's the magic hour, the magic hour\nAnd outta all the colors that'll fill up the skies\nYou got green on your mind, I can see it in your eyes\nWhy you standing there with your face screwed up?\nDon't leave while you're hot that's how Mase screwed up\nThrowing shit around, the whole place screwed up\nMaybe I should call Mase so he could pray for us\nI hit the Jamaican spot, at the bar, take a seat\nI ordered the jerk, she said you are what you eat\nYou see I always loved that sense of humor\nBut tonight you should have seen how quiet the room was\nThe Lyor Cohen of Dior Homme\nThat's \"Dior Homme\", not \"Dior, homie\"\nThe crib Scarface, could it be more Tony?\nYou love me for me? Could you be more phony?\n\n[Chorus: Kanye West]\nPut your hands to the constellations\nThe way you look should be a sin, you my sensation\nHaven't said a word—haven't said a word to me this evening\nCat got your tongue?\n\n[Instrumental Interlude: Mike Dean Guitar Solo]\n\n[Verse 3: Rick Ross]\nLookin' at my bitch, I bet she give your ass a bone\nLookin' at my wrist, it'll turn your ass to stone\nStretch limousine, sipping Rosé all alone\nDouble-headed monster with a mind of his own\nCherry red chariot, excess is just my character\nAll black tux, nigga, shoes lavender\nI never needed acceptance from all you outsiders\nHad cyphers with Yeezy before his mouth wired\nBefore his jaw shattered climbing up the Lord's ladder\nWe still speeding, running signs like they don't matter\nUh, hater talking never made me mad\nNever that not when I'm in my favorite papertag\nTherefore G4's at the Clearport\nWhen it come to tools, fool, I'm a Pep Boy\nWhen it came to dope, I was quick to export\nNever tired of ballin' so it's on to the next sport\nNew Mercedes sedan, the Lex sport\nSo many cars DMV thought it was mail fraud\nDifferent traps, I was getting mail from\nPolk County, Jacksonville, rep Melbourne\nWhole clique appetite's had tapeworms\nSpinning Teddy Pendergrass vinyl as my J burns\nI shed a tear before the night's over\nGod bless the man I put this ice over\nGetting 2Pac money twice over\nStill a real nigga, red Coogi sweater, dice roller\nI'm making love to the angel of death\nCatching feelings never stumble, retracing my steps"}], "artist": "Kanye West"}