{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/cdf1ad4d6b7cb878d3c76d84b28d9639.350x350x1.jpg", "title": "Hyphy Ballad", "year": "2011-01-01", "album": "Hyphy Ballads", "lyrics": "Nineteen-ninety something and the party is jumping\nHaters mean-mugging like they carved in a pumpkin\nTrick or treat, the stupidest Spic kicking is sweet\nMake a(bacon?) ritualistic trick for the idiot kids to get lit with\nA little trinket take a little sip of the drink\nIt's not what you think, it'll shrink you\nCake'll remake you, now the wonderland is devil fakery\nTake two Little Drake cakes from the bakery and call me in the morning\nAlonzo gonzo journalist eternalist(?)\nServing this stupid ass shit from the Hornets to the Jersey Nets\nShouts to Nardwuar, the Human Serviette\nShout out to BASIF, see me swirly as swirly get\nPuff a loose leaf cigarette\nRhymes like towels his or hers or Bernadette's\nSpurious, serious, natural mystic\nKiss up on my African lipstick\nRabbity rap rap, rabbity rap rap rap rap\nRap rabbity rabbity rap rap rap rap\nBlood in my eye dog and I can't see\nWhy can't we all just get along?\nColors united like Benetton, yo\nIf it doesn't fit, you must acquit\nIf you don't like this song go suck a dick\nAlright? Let me say the rest of the rap now\nOK, speaking defeated slangs\nForgotten every heated to heathen in Jesus chains\nA creature in Fila’s gray t-shirts\nWith brown powder with laughter, and surround sound\nAfter a casual rip, but fuck it, it’s actual shit\nA slap on the wrist is all I would actually get\nFrom someone who understood half of this shit\nAnyone else could practically give two halves of a fuck\nFans of this stuff probably do acid and fuck\nDon’t really bother to think about if it’s classic or what\nFind a bump while they cutting they classes and smoking they grasses\nAnd that is enough\nKool A.D. and I’m rapping and stuff\nDoing some shit, fucking around\nEating some food, smoking some weed, drinking some beer\nSee me saying Hi to a girl, giving pounds to a dude\nPaying money for shit, hanging out with some people\nDrinking a drink at a hotel, writing a rap on a smart phone on an airplane\nAyo I know it’s not fair mayne\nNo one really said it was a fair game\nBooty in the air, dang, it’s like I’m riding for freedom\nWhite people like what I read them\nI’m calm as alopecia but deeper than a jeep full of people\nFly like a lesbian seagull, high up at Wesleyan, regal\nMind isn’t everything, people assign(?) it to everyone\nEqual lines of amphetamines, Deebo(?) prime is unsettling\nWe know why is it getting me cheetos? I don’t know, check if it’s legal\nZydeco sprechen sie Cheedle I don’t what that last part meant, it just rhymed, OK?\nYo young crossword, see me in the Lost World, Bieber holocaust\nGirl clans got the soft pearl, fuck that, fuck what it means\nI’m a boss, Earl, Duke, Chief, Prince, King, whatever you think, geez\nLeave me alone or fuck with me\nYo, love it and get stuck with me\nI’m not a killer, man, I love hippies"}]}