{"songs": [{"title": "Rollercoaster", "year": "2010-10-26", "album": "My Fanbase Will Destroy You", "lyrics": "[Hook] [x2]:\nShe's my\nRoller coaster so I hold her tight\nShe says\n\"Take a ride\"\nSo I\nHop inside\n\n[Verse One] [Murs]:\nShe said she never did it before\nSo we did it before\nShe changed her mind, because she seemed unsure\nPure\nEcstasy I gave her my legacy\nWoke up the next mornin', and you know what she said to me?\n\"We only fuck. You don't really love me\nWe never make love and that makes me feel ugly\nYou push and you shove me, you pull my hair\nGrab me around the throat then you choke me and stare.\"\nYou stare at me like you hate me, so do you?\nThat look in your eyes seems like I never knew you\nLike every other week I receive the same speech\nCause she's feelin' guilty cause she really a freak\nSo when she's off to work, I'm makin' somethin' to eat\nI sneak and put rose petals all over the sheets\nTurn on some slow jams and we have simple sex\nAnd the very next night we back to the triple X\n\n[Hook] [x2]:\nShe's my\nRoller coaster so I hold her tight\nShe says\n\"Take a ride\"\nSo I\nHop inside\n\n[Bridge]:\nShe puts her hands in the air\nLike she's reachin' for clouds\nBut she won't sit down, cause she's screamin' so loud\n\n[Verse Two] [2Mex]:\nShe's so hard to stay away from\nMy friends always say I'm dumb and that she's dangerous\nBut I'm so insane I trust my lust for her\nOther girls are a lackluster blur\nShe wack, but I always end up thrustin' her\nAgainst the wall\nFuckin' her should be against the law\nThe contradictions in her are the contradictions of us all\nWith that ADHD, I'm like, \"Baby it's me\nCan I ABC/see you out of that baby tee?\"\nThere's no maybe G, she's fuckin' crazy\nAnd that's the fuckin' trick, that we be fuckin' crazy\nI'm losin' it\nI'm think she's startin' to phase me\nEvery time I leave her she looks at me like, \"Save me.\"\n\n[Hook] [x2]:\nShe's my\nRoller coaster so I hold her tight\nShe says\n\"Take a ride\", so I\nHop inside\n\n[Bridge]:\nShe puts her hands in the air\nLike she's reachin' for clouds\nBut she won't sit down, cause she's screamin' so loud\n\n[Verse Three] [Murs]:\nShe's got split personalities, she ruined my life\nIt's like I wifed one chick and got two for the price\nI really wanna leave her but I thought about it like\nIf I wanna break up, then I gotta call her twice\n\n[2Mex]:\nShe's bi-polar, bi-sexual and buy's me issues of my favorite comics\nWhen my sinks dirty she buys me Comet\nWhatever I need, homie, she's on it\nA woman like this, is rarely seen like Hailey's Comet\nBut then she changes up, just like a Coin Star\nTell me we're not goin' far like I don't even know who you are\nAnd this ain't workin' right\nWhen last night she complimented me of how I was workin' it right\nDamn Sybil\nAlways givin' me mixed signals\nDo you wanna be single or do you wanna be under my wing\nGo away\nIf you're really going to stay\nStop tellin' me you love me and don't in the same day\n\n[Hook] [x2]:\nShe's my\nRoller coaster so I hold her tight\nShe says\n\"Take a ride\", so I\nHop inside", "image": "https://images.genius.com/3c7b52a25e2f0fa9c9f27fb27115c584.1000x1000x1.jpg"}], "artist": "2Mex"}