{"songs": [{"year": "2010-09-14", "album": "Overly Dedicated", "image": "https://images.genius.com/9e1efc6d0a7044dbf2f0776a12ed85b8.620x620x1.jpg", "title": "Average Joe", "lyrics": "[Intro]\nThe hardest thing for me to do\nIs to get you, to know me, within sixteen bars\nThat's the hardest thing\n\n[Verse 1]\nWho is K. Dot? A young nigga from Compton\nOn the curb writing raps next to a gunshot\nOn the corners where the gangsters and the killers dwell\nThe fraudulent tender scars that get unveiled\nEveryone I knew was either Crip or Piru\nCousins in elementary, relatives in high school\nWith that being said, each one of their rivals\nWas aiming something at my head, I needed survival\nGot jumped, got jacked, shot at, shot back\nAnd I don't even push a line, I'm just tryna push these rhymes\nIn the midst of staying neutral and discrete\nMy momma said you're judged by the company you keep\nBut what you can consider, that if it goes down\nThey'll kill you if you kill me, it gets deep nigga\nSo if you ask what I'm doing\nI'm tryna duck the influence of my city that's brewing, real talk, and\n\n[Chorus]\nThis is why they fuck with me (real talk nigga, believe it)\nThis is why they fuck with me (do what I do, ya know?)\nI'm no gangster, no killer, I'm just your average Joe (know that)\nBut one thing you should consider, I'm the realest you know\n\n[Verse 2]\nI was walking from Centennial\nWhen an unidentified vehicle rolled up, and I was like \"hol' up\"\n\"Where you from?\" I don't bang\n\"Where you stay?\" Westside, that's a Piru gang to be exact\nWell aware they had blue across they hat\nDropped backpack and ran inside of the cul-de-sac\nShots rang out, hoping to God I wasn't wet\nCrossed across Rosecrans and ran inside of the yet\nChirped the homies on the I-95, they said they already knew\nWhat happened, and meet 'em outside the garage\nNever seen that many guns in my life\nI was paranoid like a fiend in the night, but needed revenge\nGrabbed the nine-ball, opened up the door, then got in\nSomebody said, \"fall back, we gon' make these niggas suffer\nYou my brother like a frat, and that's just to remind you\"\nThought about that so long I had failed my finals, fuck, but\n\n[Chorus]\nThis is why they fuck with me (I told you, nigga)\nThis is why they fuck with me (you fake nigga)\nI'm no gangster, no killer, I'm just your average Joe (you fake)\nBut one thing you should consider, I'm the realest you know\n\n[Verse 3]\nI don't do black music, I don't do white music\nI do everyday life music\nGive 'em cuts like a nigga pierced a knife through it\nYou say you through, but I've been through it, now that's cold\nAnd this is for my county building children\nIn Hub City on hubcaps, no power-steering\nI use perseverance in this mad city\nWhere the niggas drink Remy and hold semis for cutthroats\nBernie Mac died, it's no joke\nDon't ask why if you don't know about these killers and thieves\nSeven grams of weed, you smoke that, but I'm high off life\nI could fall out the sky like twice\nAnd land in the land of the AKs\nAnd the minivans where the fan never on\nCause it's hotter than a lunatic's underarms in a straitjacket\nIn other words, we get it cracking, but I keep it cool, you know?\n\n[Chorus]\nThis is why they fuck with me (haha)\nThis is why they fuck with me (real talk)\nI'm no gangster, no killer, I'm just your average Joe (come on)\nBut one thing you should consider, I'm the realest you know\n\n[Outro]\nSo there you have it\nBut I'mma leave you with this\nAn O.G. once told me\nA real gangster is either dead or in jail\nOr behind the scenes getting real money\nI'm gone"}], "artist": "Kendrick Lamar"}