{"songs": [{"year": "2007-05-08", "title": "Midgets and Giants.", "image": "https://images.genius.com/cb391d97ea1e67f146589b798b0e7b0a.306x306x1.jpg", "lyrics": "[Hook]\nYou are really not all that dope\nYou are really not all that dope\nNo-no-no no-no-no (Shooting all the midgets and I'm shooting all the midgets)\nNo-no-no no-no-no (Shooting all the midgets and I'm shooting all the Giants)\n\n[Verse I]\nYou read me all wrong, fellow\nYou need to do your research\nAn emcee with a 4-song demo and you've got t-shirts?\nHell no\nI don't want to do a cd trade\nI want to see your made-for-TV DJ fade\nInto the rave scene it seems he just came from\nGlow sticks and energy drinks\nGetting hyped up on white stuff\nNever meant to be sniffed\nYou like dust?\nI might bust your whole family\nBut y'all ain't hippie chicks\nAnd pixie sticks ain't nose candy\nYou're servin' bags with herbal magic\nSellin' placebos to too many people\nGot your girl's ass kicked\nYour lady got overpowered and you got played sellin' baby powder\nIt's over-the-counter drug trade\nOh, you a big shot?\nNow you hip-hop?\nShall I stop?\nNah, I think not\nI rip shop like parking tickets\nUse sling shots to target bigots\nCause I don't really kill cops\nI just want you to think it\n\n[Hook]\n\n[Verse II]\nDJ Undercutter\nHe wants to feed his turntable scraps\nTo MC Hollywood who's only fly until his cable snaps\nHe's a rapper thinking battles were a meal ticket\nCame time for the album and he couldn't write real lyrics\n8 Mile wasn't true, shithead\nIt was a promotional tool, but not for you, shithead\nSo let me tell you exactly what to do, shit head\nDon't be a fool, stay in school\nShit head\n\n[Hook]\n\n[bridge]\nBut am I really all that fresh?\nBut am I really all that fresh?\nYes\nYes\n\n[Verse III]\nFake friends ain't got nothing to do with my world\nIf you ain't dead, you ain't a suicide girl\nYou can tattoo that to your back with the broken wings\nThen hope for the best while you jump from buildings\nI wanna levitate like the featherweights huffin' helium\nAnd float outta this place if I ain't fuckin' feelin' em\nThey need to study lessons and then posse up\nFuck an apprentice, I've got more firepower than Donald Trump\nBB Gun, one hand on the pump\nWhen I run outta' ammo Imma slap shot this hockey puck\nSoccer moms are copulatin' with hockey dads\nHousewives wear maternity dresses like body bags\nThey pull out novelty dildos as a party gag and dilly dally at a women's rally where they lollygag\nY'all wear poetry around your neck\nIt's an outdated laminate and they can't make it to sound check?\nYou wave your new jack flags like a late pass\n\"Oh, they ain't all that bad\"\nNah, they just fake jacks\nThey've got a new street slang?\nOh, I'll keep current\nNo command of language but they act like they're deep cuz of it\nFuck a Def Poet and all the concessions they make\nI just filled another pinata with demo tapes\nI'm gunnin' for you, chump\nWith a triple barrel shotgun\nDon't try to cover up\nMy nipple grabs are Awesome\n\nShooting all the midgets and I'm shooting all the midgets\nShooting all the giants and I'm shooting all the giants\n\nYo, peep this, La di da di\nI hate party people\nHate the way the DJ just plays pop when he drops the needle\nI don't want to socialize with guys that I can't speak to\nOr women who are see through\nCause I don't need to\n\n[Hook]", "album": "Human the Death Dance"}], "artist": "Sage Francis"}