{"artist": "Fabolous", "songs": [{"year": null, "album": "There Is No Competition 2 (The Funeral Service)", "image": "https://images.genius.com/3e48ad4f20cefa049457664b2bdd197d.320x320x1.jpg", "lyrics": "Intro:\n\nFuneral service music! (Uhh, uhh) that nigga's lyrics sound like he passed away, I'm sending a hearse..\n\n(Uhh). Hahahaha. Ahh, man. Street fam AMG!\n\n(Uhh). hakeem\n\nYou know talking shit right!hakeem (Right). Now funerals, those shits are expensive. Haha.. Ahh...\n\nNice\n\n(Verse 1: Fabolous)\nYeah, I mean what I say like the dictionary\nI don't write rhymes, I write obituaries\nNew state, new date, I got a bitch in every\nI picked you up, I knocked you down, get the picture Carrie\nI get you buried, Trey Ocho speci\nFuck it, I dig the hole, I'm so Joe Pesci\nGoodfellas shit, rose gold Presi\nKush in attendance, Rose moe presi\nIf they don't like yo' boy, those hoes lezzy\nWe loose lucille ball, and blow those dessies, (heh, heh, heh)\nYeah, Ricky Ricardo, sit in the car door\nThat black Gallardo, Freck tell em \"ahh\" doe, max Wells Fargo\nTen gees in every pocket, and we wearing cargos\nHit them with the hook like killah Kareem on em\nOr barcode niggas, put that red beam on em\nAt baggage claim, Louie luggage, like a ? on em\nSemi ?, coming to America, coming through with Erica\nHer style head shot em, my bitch won't miss em\nHer swag ? got em, her ?\nSomething need to be said bout em\nSanta Claus pants, yeah, that's some red bottoms\nHer ex used to get em 'til the feds got him\nStory made a cover, y'all probably red bottom\n\n?, ain't worry bout the next nigga, we got that ?\n?, you're now rocking with the best nigga\nAnd ? yeah\nI do it, eh, eh, eh, eh, eh, I do it, yeah, yeah\nDon't worry leave it to me, it ain't no ?\n\n(Verse 2)\nYou know me, in all black like I'm in a funeral\nBlack Louies, black Tru's, the usual\nI don't mourn life, I celebrate your death\nTake too long, to more accelerate your death\nAnd the last cat that came with a squad to see him\nSaid he was a rider, so I parked him in the mausoleum\nNo witness or bystanders when I start to squeeze\nTake him on a long ride, spark him, then ? leave him\nRed and blue M6, Peter Parker BM\nBig rims, tint's dark, you can hardly see him\nPaparazzi outside o' every party we in\nThe boy so far gone, you can hardly see him\nDifferent mind state, tax bracket and plateau\nSix deuce s, with the curtains in the back closed\nFar as rap goes, the best couldn't match flows\nNigga, it's the funeral, bury him with a black rose\n\nHook\n\n(Verse 3)\nBlood on my apron, blood on my guillotine\nBody on the patio, torture, ?\nStrap make the room hot, radiator on\nAmerican gangsta, aviators on\nBoss of the underworld, New York and the mainstream\nStreet fam certified, considered the ?\nReal spit, when drama unfold\nSucker shit get broadcast, the truth untold\nWe raise the murder rate, that you can't avoid\nOnly thing similar is Philly and Illinois\nReal hood work, never no sun dance\nHolla to me on the ?, homie, freelance\nWhat's your order I deliver to your dope spot\nJust say mine and we smooth like botox\nMoney come short, I squeeze heat on arrival\nCook beef, partner, leave ?\nKnife work awful, gun work awful\nJig you, then you bye, bye, just another barcode\n? through rap, and get hella checks\nStreet patriot, and get ? checks\nPhone tapped, but fuck it I still promote crack\nAudio crack, uncut coke rap\nStrapped with Taurus or Berettas\nPop, pop, body fly high, no feathers\n\nHook\n\n\n(Verse 4: Willie The Kid)\nI said umm\nFlick the headlights on the hearses\nSymbol at the churches, speaking at the service\nSpeaking of a service, I do a disservice\nAnd this nigga certainly superb with the verbage\nDead niggas, ? your whole movement\nMoney talks, I've been fluent, I'm congruent\nWith Ben Franklins, I'm frank, put you on to it\nAnd put you niggas in suits, like ?\nThis a funeral, finna be a burial\nMatter of fact, cremate you bastards, scather ashes\nClose caskets, handing out gas masks\nWillie The Kid, biblical flow, book of Damascus\nRest in peace, niggas\n\nOuttro:\n\nI'm not laughing, (yeah) I'm trynna keep from crying, man\nAll of you niggas dead man, it's so sad, it's so sad..", "title": "Funeral Service Music"}]}