{"songs": [{"image": "https://images.genius.com/4e8ce9b96a29fb75af27298e283b406b.500x500x1.jpg", "album": "Glitter", "year": "2017-04-23", "lyrics": "[Intro]\nDesigner bitch, yeah, hope you know you signin'\nNight and day, fuck about what time it is\nThis won't get you high, don't ask me why I'm tryin' it\nDesigner bitch, she just want the finer things\nAnd day, every day, give a fuck about what time it is\nThis won't get you high so don't you ask me why I'm tryin' it\nDesigner bitch\nNight and day, every day, give a fuck about what time it is\nThis won't get you high so don't you ask me why I'm tryin' it\n(How you know? How you know? How you know?)\n\n[Chorus]\nHow you know?\nHow you know, how you know, how you know? How? How?\nHow you know?\nHow you know, how you know, how you know?\nHow you know?\nTell it to me straight, tell it to me straight, tell it to me straight\nTell it to me straight, or am I too much of a stranger? Stranger\nMy momma said, \"Don't talk to strangers\", like me\nBaby I'm a stranger, stranger, stranger to you\nBaby I'm a stranger, stranger, stranger to you\n\n[Post-Chorus]\nDon't you be ashamed, show your face if you feel a way\nYou know it's earlier when we sleep today\nDon't you be ashamed, show your face if you feel a way\nYou know it's earlier when we sleep today\nTook it to the left, we don't slow at all\nWicked, wicked rush, we don't stop at all\nTook it to the left, we don't slow at all\nWicked, wicked rush, we don't stop at all\n\n[Verse 1]\nWe ain't surprised, we doing fine, we-, we doing fine\nHave you lost your mind? Oh, we doing fine, we-, we doing fine\nI expected all of this from one of these niggas all around me\nOnly we live forever, so don't you ever time me\nI expected this from all the niggas all around me\nOnly we live forever, so don't you think 'bout timin' me\n\n[Chorus]\nHow you know?\nHow you know, how you know, how you know? How? How?\nHow you know?\nHow you know, how you know, how you know?\nHow you know?\nTell it to me straight, tell it to me straight, tell it to me straight\nTell it to me straight, tell it to me straight, tell it to me straight", "title": "Stranger"}], "artist": "070 Shake"}