{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/101ec9acebacbc3b7d2c51ebd7abe4b6.960x960x1.jpg", "title": "La Familia - 1518727", "year": "1995-10-24", "album": null, "lyrics": "[Intro Dialogue]\nHomeboy 1: Hey, there goes that mother fucker Kid Frost. (whistle)\nHomeboy 2: Hey Frost come here, ese!\nFrost: What's up?\nHomeboy 1: Hey what's up, holmes?\nHomeboy 2: What's up, how you doing?\nLady: Hey guys!\nLittle Girl: Hi Guys!!!\nHomeboys 1,2, and Frost: Hey what's up?\nLady: Hi Guys!\nHomeboy 2 - Hey Frost I want to introduce you to one of the homeboys from the neighborhood. This is Little School\nSchool, that's Kid Frost\nFrost: What's up, holmes?\nLittle School: Hey Frost, bust an old school jam!\nFrost : Alright little homie, yeah. Heh Heh!\n\n[Verse 1: Frost]\nQ-vo, aqui estoy, yeah it's the big boy\nDown with the homegirls, down with the homeboys\nKicking back, listening to a Huggy Boy rola\nWaiting for the night to hit so we can find some cholas\nI told you I'll come back in nine tray\nBumping in my six tray\nCruising in the calle\nI gots my parle, horale ese\nCause when I do it, I do it all day (all day)\nAnd then I come back again\nWith another stack to spin\nOn all my friends\nAnd now I get my gangster roll on\nBrand new clothes on and so on and so on\nAnd now I need to beat the flow on\nHere it is right here Frost man go on\nYeah it's smoke going out with a bang\nCause it ain't nothing but a family thing, yeah\n\n[Chorus: Rich Garcia]\nIt's a family affair\nIt's a family affair\nIt's a family affair\nIt's a family affair\n\n[Verse 2: Frost]\nOye vato (What's up loco?)\nCheck out the style of my vocal\nAnd take a look and see what the cab dropped in\nOne big bad ass mexican\nAnd I'm ready for anyone, down for anything\nAnd I can pass any test that many bring\nVatos wanna know where I'm from\nI'm from the varrio East Los Aztlan\nAnd ain't no nieghborhood can mess with that\nCause it ain't where your from it's where you're at, now\nChavalillos in the park after dark\nAnd the hoodlums run scared when the dogs bark, so\nGet out the nieghborhood and don't look back\nBecause I cut no slack when I'm holding a tech\nAnd it's all about backing up your last name\nWe in the same game, it's a family thing\n\n[Chorus: Rich Garcia]\nIt's a family affair (Me and la familia)\nIt's a family affair (Always)\nIt's a family affair (Together forever)\nIt's a family affair (Ooh yeah)\n\n[Verse 3: Frost]\nKid Frost back and I'm down\nAnd my familia is anyone whose skin is brown\nRancheros and the trucks so the grey vans\nTaggers in the alley with a bag full of spraycans\nHere come the jura gotta bail out\nAnd even them coconut cops bug they sell out\nThe cholos, the cholas who ain't soft\nIt's the mean mafioso gangster Frost\nComing at ya, don't try to slam me\nCause mexicans always got a big ass family\nThe quetes, the valas, the Chevy Impalas\nThe gang bang cycles with the media collars\nSo if you're brown you're down, so stay proud\nAnd remember no busters allowed\nCause the mexican people is a big ass gang, yeah\nIt's a family thing, huh\n\n[Chorus: Rich Garcia]\nIt's a family affair (Hey now now yeah)\nIt's a family affair (Me and my familia)\nIt's a family affair (It's a family affair)\nIt's a family affair (La la la la la la la)\nIt's a family affair (Kicking it with the homegirls)\nIt's a family affair (Kicking it with the homeboys)\nIt's a family affair (All night, all night, all day, all day)\nIt's a family affair (All day, having a good time, yeah)\nIt's a family affair (Eeeee)\nIt's a family affair (En la familia)\nIt's a family affair (Together, together)\nIt's a family affair (Forever, always)\nIt's a family affair"}]}