{"artist": "Immortal Technique", "songs": [{"title": "Watchout", "lyrics": "[Immortal Technique]\nYou know back in the day, some of y'all\nWould shout out Allah's name like he was hosting yor mixtape\nThen after 9/11 you got scared and shut the fuck up\nDidn't talk about the demonization of a culture, immigrants, nothing\nNow you show up, talk about we taking it too far\nDie slow! MOTHERFUCKER!\n\nYeah, 100 percent independent, I'm the fuckin boss\nThe only unsigned nigga, with a quotable in The Source\nThe hood is not stupid, we know the mathematics\nI made double what I would going gold on Atlantic\nCause EMI, Sony BMG, Interscope\nWould never sign a rapper with the White House in his scope\nThey push pop music like a religion\nAnorexic celebrity driven financial fantasy fiction\nContradiction cause the life we was given resembles life in prison\nFed time with Manuel Noriega\nThe real Noriega, who did America 100 favors\nWith Contras, the Shah and the CIA\nMovin Escobar's coke through the M-I-A\nThis is The 3rd World speakin, through a dead man walkin\nAnd everybody talkin 'bout the South takin over\nIt's true motherfucker, but it's comin over the border\nFuck your chain, my people'll kill you for water\nFuck fans nigga, I got soldier supporters\nThat'll cut your throat if you strapped with a tape recorder\nThat's right motherfucker, welcome to the New World Order\nWhere the truth is always censored by corporate reporters\nThe government, runs the drug politics on the corner\nThat's why I never stress rappers and their employers\nI put a bag over his fuckin head and torture your lawyer\nCause it's too simple to shoot ya - I'll taser the roof of\nYour mouth and electrocute ya, I'll root you out with the Ruger\nThe German Luger, U-boat, and the troops in the scuba\nNigga you can't overthrow me like the island of Cuba!\nNiggas'll never find your body, like the bitch in Aruba\nAnd I maneuver through the state department and their friends\nWith secret deals like the Nazis and IBM\nAnd now you know this ain't a trend or a fashion\nThis is my life and my passion, FUCK tryin to cash in nigga!\nI need more than advancements and a rented mansion\nSo while you little house niggas is singin and dancin\nI'll kill you and take your land like an Israeli expansion\n{​\"Invasion\"}​", "image": "https://s3.amazonaws.com/rapgenius/1-immortal_technique-20101005.Jpg", "album": null, "year": null}]}