{"artist": "Cage", "songs": [{"title": "Daydreams", "album": "For Your Box", "year": null, "image": "https://images.genius.com/a6aca3eb5aae1296ebfa9d51f15e38af.600x381x1.jpg", "lyrics": "[Intro: Cage]\nWho called 911? Did you call 911? Who called 911?\n(Get this press outta here)\nDid you kill this girl?  Did you kill the girl?\nHey get this press outta here; get everybody outta here!\nDid you kill the girl?\n\n[Verse 1: Cage]\nI met this chick in the club\nTook her to the telly for back rubs\nSplit a dozen Dutches, ate a hundred drugs\nWe trippin' face, I'm like yo sit on my face\nShe like \"I got a rag unless you like the way it taste\"\nShould I kick you in the cunt?, no?\nSo pass the blunt\nShe bent over the bed and said \"yo, do what you want\"\nSo I entered like a bull, til the cavity was full\nLooked down my dick was a knife and I took her life\n\n[Hook]X2\nDaydream being a murderer, killer\nAssassinator, death coordinator, executioner\nWith a presidential finger\nI blow up countries in death lips my name linger\n\n[Verse 2: Cage]\nWake from this nightmare can't even see clear\nShootin' my grip off through the wall catch my moms in the ear\nRun downstairs tripped over dead siblings\nCovered in my sister's blood\nFell out the crib limbs\nHanging from chains and red sky while black rains\nFloatin' the bodies of the slain cloggin' up sewer drains\nTrying to save the drowning, clingin' on to\nMy kayak but I slice off their hands as I paddle through\nWith razor oars, 16 hearts pump darts out of my pores\nAnd killed passersby doors\nPerception, close up, ketaset cloggin' my nose up\nSee myself in a precinct and my head blows up\n\n[Hook]X2\nDaydream being a murderer, killer\nAssassinator, death coordinator, executioner\nWith a presidential finger\nI blow up countries and dead lips my name linger\n\n[Verse 3: Cage]\nSo I'm in front of the judge the jury says \"you fucked\"\n\"slice his knife with his own fucking throat...\"\n[overlapping] \"suck the life out of his eyes..\"\n(\"Kill him\") till the piece of shite dies\nFuck it do as you will I welcome all flies\nI jumped from my seat attacked the judge with his mallet\nMy girl was like \"chill Alex\"\nI bust the judge head till he dead \"see you with the worms\"\nHung the jury \"this court is adjourned\"\n\n[Hook til fade]\nDaydream being a murderer, killer\nAssassinator, death coordinator, executioner\nWith a presidential finger\nI blow up countries and dead lips my name linger"}]}