{"artist": "Half A Mill", "songs": [{"album": "Milíon", "lyrics": "(Half-a-Mill) We got alot of guys out there tryin' to disrespect the\nFamily\n\n(Ali Vegas) what they gon' do with us? nothin'...\n\n(Half-a-Mill) do you know what we do to guys that disrespect the family?\n\n(Ali Vegas) We rub 'em out...kill 'em\n\n(Half-a-Mill) We cut their fuckin' throats....\n\n(Ali Vegas) I feel you...so lets just do it...who the problem now?\n\nVerse 1: (Half-a-Mill)\nSix Million ways to die, which way you want?\nSpray at players, have 'em runnin' with one gator on\nGunmen come in and kick the doors to your Hummer in\nMafia style, nothin' but sin\nYou poppin' Cristal\nI pop Four-Fifths, pow!!\nPush your cap back\nSend your head back to the hood in your knapsack\nMobster traits, Billy the Kid robbed banks\nMe? I put the scar on Tony Montana's face\n\nVerse 2: (Ali Vegas)\nAiyo, Half-a-Mill\nThey got Cat and Will trapped in jail\nThey found mad concealed crack and steel inside the Black Deville\nSomebody had to squeal\nSo here the shotty and the hitlist\nDo what you wanna with the informer just make sure you body the witness\nThey call him the Don of luck\nWe ride around in a army truck armored up\nIt won't take much to get in his crib, all we gotta do is put the X on\nHis duck\n\nVerse 3: (Half-a-Mill)\nFuck it dun, bomb him up\nI already done marked him up\nBarked him up, bodies is ready for the garbage truck\nSon, their heart is stuck\nThey followin' the same path that left their Fathers fucked\nBrain blast, bulletproof Five, I spray through the glass, it's hard to\nDuck\nWe mobsters, what\nWhite wine and Lobster shells crushed\n\nVerse 4: (Ali Vegas)\nThe informers name was Rudy the vet\nHim and his young team of gunslingers palm Uzi's and Tecks\nWe could bloody up his Coogi's and sweats\nAnd mail his family a head attached to a Koofi and specs\nYo Half, lets start a crack war\nRun in the crib, put the gun to his wig and body him as he exit the\nTrapdoor\n\nVerse 5: (Half-a-Mil)\nSon, what the fuck you think I got the MAC for?\nPackin' guns that only blow backs off\nYou know the crack law\nWho ever broke it their necks are supposed to get axed off\nSmoke the culprit\nAli Vegas, close associate\nPolly with players who hold bricks\nI'll probably shoot the whole click\nBuilding lobbies filled with bodies and shit\n\nChorus (Ali Vegas) -\nNo matter how much you keep it real\nYou gotta sleep with steel\n'cause if your foes don't kill Lord knows your peoples will\nThink you a tough guy 'cause you puff lye?\nEveryday around my way bullets bust by\n(Repeat)\n\nVerse 6: (Ali Vegas)\nThe young Don 'll drench you\nSneak up on you calm and gentle\nInside a Lincoln Continental\nThing I'm into is beyond your mental\nAli Vegas will hunt for you\nSend a violent ho to every talent show to make you uncomfortable\nGet approached by Multiples\nHalf of my peers' scarred catchin' a beer charge for a open brew\nSnipers scopin' you from out of stairwells\nWhen it comes to my Fam there ain't no fair ones it's only farewells\n\nVerse 7: (Half-a-Mill)\nUzi in my hand\nTwo-piece suit with Coogi pants\nFuck a hooptie, two seater with my Mira\nI'm rollin' weed up\nNiggas holdin' dough, slowin' me up\nI'm'a see him when he go and re-up\nHe's a wild out cat who supposed to be nuts\nAnd thats what I bust, especially over these bucks\nHe's in a Cherokee with Melanie\nHe don't know she tellin' me every place he ever be and stay though\nSniffin' Yayo\nEyes red like two Tomatoes\nHidin' from the FEDS\nPlus he lied on Lopez\nOld school cat, used to stick guys on Mopeds\nCoke head who used to rock Pro Keds\nThinkin' he Gotti, he's about to be a body with no head, cold led\nThis Man's brains are 'bout to be like Champaigne, mo' wet\nNo vest, poiliticin' next to a Gold Lex\nCock the oowop\nMake his squad bounce like Doowop\nTake it to the heart with a few shots\nBlazed their cars, turned 'em into two drops when I blew off the tops\nI'm rollin' out but when will this holdin' out shit stop?\nIt seems like it never ends 'till a nigga gets popped\nBut yo, we still holdin'\nNothin' can stop the dollar bill foldings\nRaw deals will cause your grill to blow in\nConcealin' dough Men usually get thrown in Oceans\nFoldin', Toast to their chin and they roll to the cement\n\nChorus 2X\n\n(Half-a-Mill) Ask around in the old neighborhoods....they know about\nHalf-a-Mill...they know about Ali Vegas...fuck with the Bulls you get\nThe horns...", "title": "Tuff Guy", "year": null, "image": "https://images.genius.com/23e45bc88de0a6f6a0ac73d6b9f6b05f.500x500x1.jpg"}]}