{"artist": "Andy Mineo", "songs": [{"title": "Doomsday Cypher", "album": null, "year": "2015-01-05", "image": "https://images.rapgenius.com/6e695edc8e14e4f1a83b7e52fe8a095b.1000x551x1.jpg", "lyrics": "[Verse]\nI am not gangsta, I am me, I am not you\nI'm an anomaly like black anchors on Fox News\nI'm livin' uptown, where if you talk slick they comin' after ya\nCallin' for that shotgun, they tryna ride passenger\nMaskin' up, packin' that pump like it's asthma lungs\nThese bum rappers been bitin' on some Dracula\nAs for the bars, this is Attica\nBut that don't matter, cause that will never get no platinum plaque for ya\nNobody cares if you could body a verse if you never put together dope bodies of work\nAnd even worse, you never love somebody 'til it hurts?\nYou know your self-worth never been connected to your net worth, right?\nMy next verse might perplex those like\nI need to Wiki that, side tab, search for my dad's Christmas present\nMaybe an iPad, dang, my bad\nI been gettin' sidetracked, I don't know where my mind's at\nSomebody said I'm goin' Hollywood\nYou ever been to Hollywood?\nThat joint is dirty and it's kinda hood\nIt's all good, guess I get the sentiment\nWhatever then, pull up on my block ridin' a elephant\nWearin' some M3's with the elephant print, I had to match\nI'ma take this up to Pelham then back\nYou see them dudes on my block?\nThey been sellin' them packs\nYou prolly think they lowlifes or some felons\nIn fact, I see math teachers who know how to add and subtract\nBusiness owners, entrepreneurs, intelligent cats in the wrong element\nBut ain't nobody tellin' them that, I see it\nYou get told you dumb long enough, you might believe it\nSo give me dumbbells, I exercise demons\n'Til the Father say, \"You done well\", on the day that I see him\nSee, a white man kill somebody then he's insane\nA black man kill somebody it's, \"I told you that they all the same\"\nStrange, the picture that the media paints\nTeachin' us how to hate any and everything not the same\nI threw on a wedding ring, now shawties wanna holla\nIt's ironic, I wonder if she grew up with a father\nIf the devil wears prada, let's be honest\nWe all got a pair of luxury kicks in the closet\nSo, here go the white boy\nYeah, I know they doubt me\nEven on Black Friday you couldn't discount me\nI know they hate the fact that I am a believer\nThey said I couldn't hack it, I guess I'm North Korea\nSo, here we go, hand in the sky now for a single God\nI don't mess with them singles like Forest Hills Drive\nI'm married now\nEven when I'm plain I'm still fly, cause I'm gonna point 'em to the Most High\nYou see me?"}]}