{"artist": "Drake", "songs": [{"year": "2006-02-14", "album": "Room for Improvement", "image": "https://images.genius.com/c85f36c02060316fcec1ed423c60f0da.1000x1000x1.jpg", "title": "AM 2 PM", "lyrics": "[Verse 1: Nickelus F]\nYo I wake up every morning, shower, gather my belongings\nHead to works, I get some breakfast cause, still a nigga yawning\nFrom the night before, at the club I was up I'm trynna live\nOnly twenty two my nig, 'bout to be twenty three ya dig?\nYo I wake up every morning, shower, gather my belongings\nHead to works, I get some breakfast cause, still a nigga yawning\nFrom the night before, at the club I was up I'm trynna live\nOnly twenty two my nig, 'bout to be twenty three ya dig?\nTime don't wait for none of us that's why I gotta chase my dreams\nMake my momma proud so she can show off all her pearly teeth\nAnd be half the man my dad was, I thank God he was in my life\nI realize how many leave they wives so deep inside\nEither I, need to make this music work or move from the Earth\nI'm preachin' fire, need a choir, 'bout to take you all to church\nMy congregation bombed the nation with this hip hop\nWe in the race to fame, blowin' pass the pit stops\nI heard the prize was some chicks and a wrist watch\nAnd all you gotta do is go to jail or get shot\nYeah Nick cop but he ain't never get popped\nHow we gonna get pop fans? Give 'em a quick shot\nNow I get ya chick hot with my wrist watch\nYeah shorty drip drop when it tick tock\nIt's kinda sick huh? Ay Jay, put an end to all the bickerin'\nAnd tell them niggas this is Nick's spot\nThey don't keep it fresh enough I got it zip locked\nSaran wrap, anthrax, it make ya sick huh?\nI'm hot as fire wanna put me out with piss huh?\nReached to do it and realized his dick stuck\n\n[Hook: Drake]\nIt ain't as easy as it looks, we go through some shit\nYou cut us a check, then we go through some hits\nThen you show us respect, then we'll say you legit\nAnd this is the life that I lead from AM to PM\n\nI'm trynna get that cash, then watch how tall it grows\nSoon as we get the ass, we start callin' 'em ho's\nThe concept you don't grasp, I'm guessin' you too old\nAnd this is the life that I lead from AM to PM\n\n[Verse 2: Drake]\nAyo I stay up every evening, write that shit that they believe in\nDJs run it, they approach me, and it's praise I be receiving\nFrom the night befo', at the club, fake I.D. my record spins\nGot me dancin' right outside since these niggas won't let me in\nWell guess again, slip around the back and get it crackin'\nAnd all the bottles wrapped in cellophane and party where the best have been\nHundred grand, Nickle F, that nigga's the next to win\nVirgina gon' rep for him, and Memphis represent for me\nTo the tenth degree, Tennekey, T Dot to the country y'all\nOrange Mound and Whitehaven, and back up north to Montreal\nI ain't ashamed, my city ain't on the map\nPeople get to thinking they really light that fire, realize they ain't born to rap\nSo they give it pass the torch and sell they soul for enough to throw cash in storage\nMaybe they can bring they career back\nBut these niggas right here ain't trynna hear that\nCause I'm on set, make it work, break even on 9 to 5's\nCigarettes and lotto tickets, tryna keep that grind alive\nAll my uncles, they hit the casino when they get they check\nMy cousins, they paint they slabs and pop pistols to get respect\nThis can't be life, dominoes and chief and dro and twenty stacks\nSingle mothers phonin' cheaters just to get they honeys back\nPurple drink and trips to Kroger's just to get they money stacked\nRest In Peace to SKUMMY this reality not funny rap!\nYou think it's funny till these youngings suck a bunny\nPull the jackrabbit out and get to screamin' where the money at?!\n\n[Hook]"}]}