{"songs": [{"image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg", "year": null, "title": "Hurt locker - main", "album": null, "lyrics": "Welcome\nAll foreign passports to the left\nAll resident passports to the right\nYa dig?\nWelcome to my world of hurt, where I put in work\nI got guns that knock you off of this earth\nStand up let yourself be heard, I ain't hear one word\nI'm just bringing through what the crowd deserves\nCause what you want that's what we got\nOnce things begin, my n**** it won't stop\nLock down your blocks lets flood the streets\nNow welcome to the world of Mr. X to the Z\nMotherf***** I'm\nBack with a vengeance, back with the business\nI'm a vet with a pension, a man with a vision\nI'm a man on a mission, so crowd around listen\nThis that hardcore heavy head bang, you've been missing\nGo to Defcon one, if you don't comply\nI might explode like a meth lab, there is no rehab\nB****es need knee-pads, a pound of some Zig Zags\nThat last like Etta James, I'm back let the cage rap\nCharles Bronson, visionary marksman\nHeartless, Leave your intellect on your carpet\nI don't really start s***, I just like to finish it\nDismember with a hacksaw, getting rid of it\nI'm so militant, you so Gilligan, killing it\nHeard you want the coast on your back\nYo, be careful what you wish for, good luck with that\nYou could be found in your trunk, with your chest collapsed. Relax\nWelcome to my world of hurt, where I put in work\nI got guns that knock you off of this earth\nStand up let yourself be heard, I ain't hear one word\nI'm just bringing through what the crowd deserves\nCause what you want that's what we got\nOnce things begin, my n**** it won't stop\nLock down your blocks lets flood the streets\nNow welcome to the world of Mr. X to the Z\nMotherf***** I'm\nMade for the masses, chromed out classics\nBlock after block, when I park so Jurassic(?)\nCameras start flashing, everybody asking\nHarassing, suck my d*** with six aspirins\nThat'll keep your head tight, back from the afterlife\nLocked in my hurt locker, built up my appetite\nYou need your name in lights, when I just need a mic\nAnd I can level any playing field, like a sheet of ice\nIt's going down like when you cuffed, and they read your rights\nI'm going higher, better bail, if you're scared of heights\nI'm ritual killing prepare for a sacrifice\nRoll her like a pair a' dice, lounging in paradise\nJealous n****s want to feed, like a parasite\nBurn leeches off with cigarettes, I just need a light\nI been around, seen the press get it shut down\nI'm stadium status, the crowd got to move NOW!!!\nWelcome to my world of hurt, where I put in work\nI got guns that knock you off of this earth\nStand up let yourself be heard, I ain't hear one word\nI'm just bringing through what the crowd deserves\nCause what you want that's what we got\nOnce things begin, my n**** it won't stop\nLock down your blocks lets flood the streets\nNow welcome to the world of Mr. X to the Z\nMotherf***** I'm\nA man dies once, a coward dies a thousand times\nYour b**** a**es on nine hundred and ninety nine\nYou only got one more, you better make it last\nBefore a lay this hurt locker, to your fucking ass\nLock chop choppers, chop shop droppers\nFresh state to state, until the feds came knocking\nCall us in the clutch, when your shows ain't popping\nWhen your hoes ain't dropping, when your flows ain't rocking\nWelcome to my world of hurt, where I put in work\nI got guns that knock you off of this earth\nStand up let yourself be heard, I ain't hear one word\nI'm just bringing through what the crowd deserves\nCause what you want that's what we got\nOnce things begin, my n**** it won't stop\nLock down your blocks lets flood the streets\nNow welcome to the world of Mr. X to the Z\nMotherf***** I'm"}], "artist": "Xzibit"}