{"songs": [{"title": "Cloudy Skies", "album": "Life of a Dark Rose  ", "year": "2017-12-12", "image": "https://images.genius.com/d3e98968f6e47fdf4e54a33d2b9367f8.1000x1000x1.jpg", "lyrics": "[Intro]\nGirl, never lie to me\nAyy, girl, never lie to me\nDuck from the flashin' lights, watch out when the tide comin'\nAll these people judgin'\nTake a sip out the double cup, can't tell me nothin'\nI know it's all for the better and I'm never stuntin'\nI just want a girl who gon' really tell me somethin', ayy\n\n[Chorus]\nAyy, girl, never lie to me\nGirl would you ride for me? Pull up on the side for me\nDuck from the flashin' lights, and watch out when the tide comin'\nI know it's hard to be yourself when all these people judgin'\nTake a sip out the double cup, can't tell me nothin'\nI know it's all for the better and I'm never stuntin'\nI just want a girl who gon' really show me somethin'\nGive you the time of your life if you would stop frontin'\n\n[Verse 1]\nRollin' cookie in L.A., I think I found my bae\nShe roll my weed, so she gonna be hard to replace\nWe takin' shots of that Henny, I don't need a chase\nAlmost forgot where I'm at, can barely feel my face\nRockstar lifestyle, might just die tonight\nIf I was down and had nobody, would you sacrifice?\nThey said loose ends break friends, I ain't tryna fight\nFuck bein' sober, girl, come over and enjoy the high\nSo don't fuck up the vibe, don't ever waste my time\nAnd when I'm feelin' down, will you come stay the night?\nAnd if you far away, then will you book a flight?\nMy neck flooded with ice, she grip it like a vice\nCan't ever play it nice, the world so full of lies\nAnd I'm not bein' them, 'cause I'm just not that guy\nYou wanna be somebody, so put aside your pride\nSo open up your eyes, they talkin' from outside\n\n[Chorus]\nAyy, girl, never lie to me\nGirl would you ride for me? Pull up on the side for me\nDuck from the flashin' lights, and watch out when the tide comin'\nI know it's hard to be yourself when all these people judgin'\nI take a sip out the double cup, can't tell me nothin'\nI know it's all for the better and I'm never stuntin'\nI just want a girl who gon' really show me somethin'\nGive you the time of your life if you would stop frontin'\n\n[Verse 2]\nGive you the time of your life if you would stop frontin'\nI know they hatin' on me 'cause I really came from nothin'\nI just wanna talk to you, can we have discussion?\nWhy you frontin' on me, shawty, better stop the bluffin'\nYou better stop the bluffin', I really know you want it\nYou push that thing up on me, so I'ma jump up on it\nI ain't gonna fake it because I know I want it\nThese niggas so 50, I keep my shit a hundred\nRoll this Wood and we gettin' high\nShe say she love me, I know that's a lie\nAnd you know we up in the sky\nRoll this Wood and we gettin' high\nShe say she love me, I know that's a lie\nAnd you know we up in the sky"}], "artist": "Lil Skies"}