{"artist": "Problem", "songs": [{"album": "O.T. (Outta Town)", "title": "Andale", "image": "https://images.rapgenius.com/ee124180c2d07c8859e07bc9c767c540.500x500x1.jpg", "lyrics": "[Produced by Jahlil Beats]\n\n[Hook: Problem]\nAndale, andale\nThat's how the money come\nAndale, andale\nThat's how the money come\nAndale, andale\nThat's how the money come\nThat's how the money come\n(Turn up, turn up)\nAndale, andale, andale, andale\nAndale, andale, andale, andale\n(Zoom, zoom, turn up, turn up)\nAndale, andale\n\n[Verse 1: Problem]\nAriba, Ariba, Ariba, where's the bitches?\nThis crazy boss just fucked up the game word to the clippers\nMy enemies bitch got her face right by my zipper\nTequila is laced, give me my space\nThe weather is thick give me a case I'm tryna get fucked up\nKeep looking crazy from across the room you're about to get fucked up\nWe always pack, but I don't feel like tripping tonight\nCause I am too busy living the life, pass me the drugs\nAndale, andale\nI don't think these niggas wanna go there\nYoung rich nigga and I don't care\nSame crew since I was a little one\nSince day one  been a real one\nAnd I put that on all my children\nWalk in and the hood start cheering\nNo pom poms I bomb bomb\nI touch that motherfucking ceiling\nI'm on your side fuck that side the gang is the gang\nYou say you're my friend but you standing with them so you are the same\nYou gotta get it with them\nOh ah oh ah and I get a rhythm\nIn us we trust sucking my nuts try, good luck\n\n[Hook: Problem]\nAndale, andale\nThat's how the money come\nAndale, andale\nThat's how the money come\nAndale, andale\nThat's how the money come\nThat's how the money come\n(Turn up, turn up)\nAndale, andale, andale, andale\nAndale, andale, andale, andale\n(Zoom, zoom, turn up, turn up)\nAndale, andale\n\n[Verse 2: Problem]\nHere we come trying to make dough\nMy bitch fatter than my bank roll\nWe look fly nigga we don't try\nNigga poppin' that shit like an 8 hole\nWartime boy I don't lay low\nReal real ready for the y'all know\nNigga pop at me nigga that's OG\nBetter bring K wherever they go (pop)\nDiamond Lane yea that's the label\nDiamond Lane yea that's the label\nI don't gotta brag nigga they know\nKeep your head hanging from the cable\nWatch me boy I'm on cable\nI'm fucking on these bitches\nWhip color of that yayo\nSniffing coke on the way to day gold\nTurn your hood up nigga bang your gang\nTurn to your homeboy watch him bang the same\nI don't hit no signal when I'm changing lane\nYou woulda think I pulled madden out put it up\nGrabbed 2K then put it in by the way\nYoung nigga just changed the game\nProblem, Jon just say your name\nJust got your tip tongue let em hang\n(Swear I'mma ball 'till I die nigga)\nBe yourself stop, take off, touch the sky nigga\nIt's captain California every time I ride\nAnd when that money counter ring it's a fuckin' brag\n\n[Hook: Problem]\nAndale, andale\nThat's how the money come\nAndale, andale\nThat's how the money come\nAndale, andale\nThat's how the money come\nThat's how the money come\n(Turn up, turn up)\nAndale, andale, andale, andale\nAndale, andale, andale, andale\n(Zoom, zoom, turn up, turn up)\nAndale, andale\n\n[Verse 3: Lil Jon]\nWhere you from nigga? represent your shit\nWhere you from girl? represent that shit\nWhere my west coast niggas at in this bitch\nDirty south niggas yea, we in this bitch\nWhere you from nigga? represent your shit\nWhere you from girl? represent that shit\nWhere my west coast niggas at in this bitch\nDirty south niggas yea, we in this bitch\nAct a fool in this bitch shake them bottles up\n28 still spend that shit, we don't give a fuck\nWe don't give a fuck, we don't give a fuck\nWe don't, we don't, we don't give a fuck\nWe came to fuck shit up and leave with all your hoes\nFuck niggas don't even think about it, that's a no no", "year": "2014-11-14"}]}