{"songs": [{"title": "Hos Hos", "lyrics": "[Eminem]\nWhat the fuck?\nAyo, Whoo Kid, run that shit back\nGod damn\n\n[Intro: Young Buck & 50 Cent]\nYeah, I like to shout out my nigga 50\nYou know, for introducing me to so many celebrity hoes, homie\nThese hoes love me, my nigga\nI want you to meet this new bitch\nLook my fucking phone ringing right now\nWho is this? Monica? Trina? Some fucking god damn bitch\n\n[Verse 1: Young Buck]\nSomebody Cali bitch, the gangsta hoes not the average\nHave a nigga feeling like, I'm gonna mary this\nAnd you don't know how many kids she done have with this\nBut, I gotta thing for my down South hoes\nPussy stay wet and their mouth stay cold\nTurn that ass around girl, touch your toes\nThrow it back to me, let me hear you holla OH!\nYour man ain't nothing like me\n7 figga nigga, still in a white T\nPimp the game, like the homie Ice-T\n10 years, ain't no telling where I might be\nDo it for the money, you can keep the fame\nI'd rather be a rich nobody, then broke with a name\nChinchilla with a Cardi F Frame, wreck the range\nBut ain't a damn thang change\n\n[Chorus: Young Buck & 50 Cent]\nTrying to fuck with these Hoes\nHoes Hoes Hoes Hoes Hoes\nWe trying to fuck with these Hoes\nHoes Hoes Hoes Hoes Hoes\nWe trying to fuck with these Hoes\nHoes Hoes Hoes Hoes Hoes\nWe trying to fuck with these Hoes\nEverybody on the count of three, let me hear you holla P.I.M.P\nWe work them Hoes\n\n[Verse 2: 50 Cent]\nHo stroke first and I stroked her even faster\nHad her in the telly with her ass up\nYou know the 21 questions that I asked her\nHad her feeling good man, I gassed her\nSoon as we were done, there was laughter\nYou know damn well her daddy ain't a pastor\nSeen her at the college and I asked her\nIf she wanted to roll after her class done\nCame through picked her up in my Aston\nMartin Vanquish drop with the glass up\nTold her how i hustle, got my cash up\nShe saw the ice on my wrist I like to flash uhh\nWhen it comes to getting bitches I'm a master\nBut when it comes to trickin' I'm the last to\nBreak bridge, don't believe me nigga, ask her\nShe'll tell you I'm stingy as hell with these Hoes\n\n[Chorus: Young Buck & 50 Cent]\nTrying to fuck with these Hoes\nHoes Hoes Hoes Hoes Hoes\nWe trying to fuck with these Hoes\nHoes Hoes Hoes Hoes Hoes\nWe trying to fuck with these Hoes\nHoes Hoes Hoes Hoes Hoes\nWe trying to fuck with these Hoes\nEverybody on the count of three, let me hear you holla P.I.M.P\nWe work them Hoes\n\n[Outro: 50 Cent]\nYeah, It's big pimping going on\nWe trying to fuck with these Hoes\n50 Cent, Young Buck, HAHA\nWe trying to fuck with these Hoes\nAww man, we known internationally right now\nWe overseas nigga, In Dubland, Ireland, Naa mean?\nI asked a nigga, if he knew Fat Joe\nHe said \"Yeah, you mean the man from the pizza shop around the corner?\"\nI said \"Nah, not that Fat Joe. Was talking about the Rap\"\nHe's like \"Nah Nah, we don't know him. We know you 50\"\nYou know, so sign autographs HAHA\nSo I sign autographs, man go back to the hotel\nAnd fuck with these Hoes HAHA\nYo, play it back one more time", "album": "Back to Business (G-Unit Radio Part 14)", "year": null, "image": "https://images.genius.com/12620b28e1a9d995a1170129faf26152.500x500x1.jpg"}], "artist": "Young Buck"}