{"songs": [{"year": null, "album": "Allow Me To Re-introduce Myself", "image": "https://images.genius.com/3b2283d9008265c54952b9dadead1160.360x360x1.jpg", "title": "I Wish I Could Talk To You", "lyrics": "[Ex's voice]\nI love you!\n\n[Verse One]\nYeah, Hmmm\nI guess I could have learned to love you\nReplace my sanity\nWith Kotex on the vanity\nPut up with your habits\nReward your anxiety with carats\nSubstitute freedom for a marriage\nI was quite in love with your odd behaviour and acting out\nWaited quite a while just to tap you out\nThought you was digging Saukrates\nCame to find out that me and you couldn't wait to get down to knocking knees\nThe first time I dug you out raw!!!\nPussy so good I disobeyed the first law\nNever fall hard for the skin too soft\nUnless you been through some real shit, beating the odds\nYeah\nBut I was still in love with my ex\n[Ex] Hello?\nI erased the pain every time we had (kiss) you know\nLooking in your face but thinking about her\nIt's interesting seeing what we were\nI wish I could talk to you\n\n[Hook: Peter Jericho]\nWe once were\nWhat we are\nNever to be again\nNow I look back\nAnd laugh now\nBut it sure wasn't easy then\nLoving you and wishing you genuinely felt the same\nBut it doesn't matter now, that was just a thought\nWe moved on\nI just wanna talk to you\n\n[Verse Two]\nGirl you used to impress me\nClean the house and undress me\nGiving me the sugar like Nestlé\nNever seen a girl from Jamaica who\nCame to Toronto and celebrated Canada Day more than Gretzky\nBig smiles\nBut when I found out about your ex man\nBeing abusive I couldn't understand\nHow did you believe in that?\nYou were nothing greater than a whore\nSometimes mental abuse hurts more\nSo I showed you what love should feel like\nIce cream dates on a late night\nVery long talks on the phone\nWhen you would breakdown and you stayed downtown\nWhen you felt you couldn't reach home\nI wonder what marriage would feel like\nYou never left me but something didn't feel right\nYour red eyes were spelling it out\nAnd you wondered what the yelling was about\n[Ex] Hello?\nI wish I could talk to you\n\n[Hook]\n\n[Verse Three]\nWe almost had a child\nBut we made mistakes that we couldn't take back\nI hope God forgives for that\nI used to look up at the moon, waiting outside your workplace\nMe and you together seemed good on the surface\nTil we flew out to my homeboy's wedding\nWhen they exchanged vows, I knew I wasn't heading\nTo the same place with you, reality set in\nI loved you but didn't like the feelings that you let in\nInsecurity, jealousy, envy, no self-esteem\nIt's like I woke out of a bad dream\nAll the drinking and the smoking and the going out\nNever mind all the shit I ain't know about\nI had to free my future\nLet go of your grip with Kama Sutra\nSleep alone and feel like I lost my world\nMy axis was spinning with you girl\nThe other day I heard my cell phone ring\nAn unknown caller calling in, hold up\nThe other day I heard my cell phone ring\nAn unknown caller calling in\nI wish I could talk to you\n\n[Phone Conversation]\n[Ex] Hello?\n[Kardi] Yo!\n[Ex] Hello?\n[Kardi] (laughing) What up miss thing? What's good?\n[Ex] Hey, who's this?\n[Kardi] This is Kardi\n[Ex] Wow... What's going on?\n[Kardi] (mumbling)\n[Ex] Say what?\n[Kardi] Same shit. You know what I'm saying. Same thing\n[Ex] I haven't heard from you in five years\n[Kardi] I know man. I just been chilling you know? That's it\n[Ex] That's cool\n[Kardi] You know what's funny? (laughing) I ended up moving in with old girl that you ain't like. (laughing)\n[Ex] When was this?\n[Kardi] About a year after you left I guess\n[Ex] You happy?\n[Kardi] I mean yeah she treats me good. You know what I'm saying... You married yet?\n[Ex] No...\n[Kardi] No?\n[Ex] Not yet. I've been seeing somebody\n[Kardi] That's good, as long as he ain't putting no hands on you. You know? You think about our old shit? Like how it used to be? Back in the day? (laughing)\n[Ex] I mean... maybe a little bit. I think about it from time to time\n[Kardi] Yeah, me too... Is somebody in the room with you?\n[Ex] No, nobody's here\n[Kardi] You know you was wrong right? You know that\n[Ex] I mean... (sighs)\n[Kardi] Hmm... Alright alright check it. Never mind that. You still think about me though?\n[Ex] I think about you... yeah. You think about me?\n[Kardi] Nope!\n[Ex] (laughs)\n[Kardi] (laughs) ... You still love me?\n[Ex] Of course. You still love me?\n[Kardi] No I do not!!! (laughs)\n[Ex] (laughs) Fuck you nigga! That shit's not funny\n[Kardi] (continues laughing)\n[Ex] Ha ha ha nothing\n[Kardi] Hey yo. Say the thing\n[Ex] Say what?\n[Kardi] Say the thing for me\n[Ex] No, you gotta tell me first\n[Kardi] Yo I asked you to say it first man. Why you always want me to tell you first man damn? Fuck\n[Ex] Hey\n[Kardi] Hey nothing. But I know if you didn't though, you wouldn't, you know what I'm saying, you wouldn't entertain that shit\n[Ex] There you go\n[Kardi] Yo! Just say it for me one time and I'll never bother you again. I just want to hear you say it. You know what I'm saying?\n[Ex] Are you ready?\n[Kardi] Yeah...\n[Ex] I love you! (echoes)"}], "artist": "Kardinal Offishall"}