{"artist": "Fat Joe", "songs": [{"year": "2011-10-31", "album": "The Darkside Vol. 2", "image": "https://images.genius.com/f2f9e529c5e6328625a53474a16fcb2a.640x640x1.jpg", "lyrics": "[Intro]\nMark Henry...\n\n[Verse 1]\nYeah, uhh, yo\nFamiliar sound of the trumpets\nTriumphantly, playing in my circumference\nThe sound of the substance\nBubbling in my mind, every time I'm touching hundreds\nHustlers know this feeling and they love it\nBut God bless the men serving years by the dozens\n'Cause all I ever wanted was the finer things, who doesn't\nNow (?) getting knocked, it break a brother heart\nAll our shit is wired, tapped, I said it from the start\nAround (?), dead a nigga, made it out of hell\nI started my journey the day they taught me how to sell\nTo this day they still trying to get niggas to tell\nSo fuck the DEA and fuck sitting in a cell\nI'd rather sit comfy on a 90 foot yacht\nAll aboard, model hoes and my criminal confidants\nToast champagne celebrate that we living\nAnd if you disagree, a 1000 shots is what I'm giving, nigga\n\n[Chorus]\nUh, drop a body on 'em, uh huh\nDrop a body on 'em, yeah\nDrop a body on 'em\nClose casket, nobody saw him\n\n[Verse 2]\nCrime sagas from an entrepreneur\nOf white powder, distributed clean at night hours\nPurchasing firearms, praying God forgive us\nBut thank God for money and the pussy that it bring us\nIf hell has a penthouse, I'll be up in it\nThe mind state of a desperate nigga chasing digits\nRoam the yard with the Grim Reaper, watch ya step\n'Cause your very last breath could lead you to your death\nPicture got money, you can keep your thoughts\nJust give me head and (?) hills and bleed you (?)\nAnd recognize a Don when you in his presence\nAnd ask Bishop Eddie Long if dogs go to heaven, woo! Uh\n\n[Chorus]\nUh, drop a body on 'em, uh huh\nDrop a body on 'em, yeah\nDrop a body on 'em\nClose casket, nobody saw him\n\n[Outro]\nYeah, I told you nigga I go hard\nVery hard, nigga\nDarkside 2 coming your way nigga, arrr!", "title": "Drop a Body"}]}