{"artist": "The Game", "songs": [{"title": "All I Know", "album": "The R.E.D. Album", "year": "2011-08-19", "image": "https://images.genius.com/5f5301fa46a1afd76d0d034e80d23434.1000x1000x1.jpg", "lyrics": "[Chorus: Luu Breeze]\nAll I know is this pain in this life\nAnd this struggle, it troubles me so\nAll I know is that I'm stuck on this road\nOf success so I gotta get mine\nAll I know is this pain in this life\nAnd this struggle, it troubles me so\nAll I know, all I know\n\n[Verse 1: The Game]\nRed phantom, they say I look like Josh Smith from Atlanta\nI do, hachoo, excuse you, that nigga look like me\nHe from the G.A., and I'm M easy, that's Game\nI don't do what you niggas do, that's lame\nI Soo Woo with my crew from the Bird Gang\nI Soo Woo with my crew, from under Young Wayne\nA walkin' motherfuckin' flame\nLivin' up to my brother's name\nRockin' that red shit, wasn't fuckin' with them other gangs\nAmongst other things, they wasn't fuckin' with me\nAin't your average motherfucker, I'm a motherfuckin' G\nI got some shit on my chest that I want to get off\nI got some shit for that vest that'll knock that bullshit off\nMoney like Madoff, kill 'em like Adolf\nRoy Halladay, I'll let a fuckin' K off\nAnd I don't take a fuckin' day off…\n\n[Chorus: Luu Breeze]\nAll I know is this pain in this life\nAnd this struggle, it troubles me so\nAll I know is that I'm stuck on this road\nOf success so I gotta get mine\nAll I know is this pain in this life\nAnd this struggle, it troubles me so\nAll I know, all I know\n\n[Verse 2: The Game]\nCincinnati C hat, Boston B hat\nThem is me hats to the Philadelphia P hats\nBelieve that; bring it to the hood so you can see that\nDumb ass niggas like \"Game, where the keys at?\"\nAutomatic start, nigga where the trees at?\nRed boned bitch like Alicia, where the keys at?\nFreeze that, like a fuckin' picture\nIf you ain't a Blood, I ain't fuckin' with ya\nNah I'm just fuckin' with ya\nStay on my hood shit, hop in the bucket with ya\nThrow the ski masks on and get to straight buckin' with ya\nAin't that some shit, that bastard's sick\nYou wanna know how I'm livin' nigga, ask your bitch\nTold you precisely how the Aston sit, and she a nasty bitch\nI came in her mouth ask her lips, you know why?\n'Cause I had to go past them lips, Trick\nYou probably paid for those ass and tits for…\n\n[Chorus: Luu Breeze]\nAll I know is this pain in this life\nAnd this struggle, it troubles me so\nAll I know is that I'm stuck on this road\nOf success so I gotta get mine\nAll I know is this pain in this life\nAnd this struggle, it troubles me so\nAll I know, all I know\n\n[Verse 3: The Game]\nFuck with the Blood clot, smile for my mug shot\nCan't go out like 'em but I love Big, I love Pac\nLove Fab, love Kiss, that's where the love stops\n'Cause I sleep with the enemy and I hug blocks\nBirthed me in the drug spot, nigga with a attitude\nSearchin' me and it's\nFuck cops, nigga pay your gratitude\nBefore you say I'm actin' rude\nUnderstand I'm tryna feed my people\nHati just like Compton the way I'm packin' food\nBut I will act a fool, put cheese on your head\nMotherfucker I will Green Bay Packer you\nHave a whole football team of niggas after you\nLike the punt return, when will you fuckin' learn\nNow take your ass back to school\nWait 'til 3-o-clock click clack at you\nAnd fuck with your conscience like back packers do\nAnd I ain't Talib, Black Thought or Mos Def\nBut I've seen the most deaths\nAnd nigga I'm just tellin' you\n\n[Outro: Luu Breeze]\nAll I know\nAll I know\nAll I know\nAll I know\nAll I know"}]}