{"artist": "The Weeknd", "songs": [{"year": "2015-02-23", "lyrics": "[Intro: The Weeknd]\nI don't got a single sober vein in my body\nI don't got a single sober vein in my body\n\n[Verse 1: The Weeknd]\nDon't apologize, I quite enjoy messy\nI see that bottle after bottle got you goin' crazy\nAnd doin' shows after shows got me so lazy\nSo ride it out for me, and take it off for me\nIt's a good vibe, good vibe, good vibe\nDon't you ever threaten niggas with a good time\nShe wanna buy a dream, I said I don't sell it\nBut she can rent it for a night, I don't mind, open wide\nCause all this fame, I earned it, I might as well use it\nPrivate elevator goin' straight to my unit\nAll my niggas 'round me, gettin' kickback pussy\nAll my killas 'round me, all be hiding in Stussy\nCan't nobody stop me, used to be homeless\nNow that penthouse at the Ritz where my home is\nTour bus like a National Geographic\nBitches runnin' wild gettin' faded in the bathroom\n\n[Hook: The Weeknd]\nIt makes me smile, it makes me smile\nCause I got it\nIt makes me smile, it makes me smile\nCause I got it\nAll the pain, sweat and tears, just to get a piece\nBut now we got it\nMan look at the kid now, can nobody stop me?\nI don't got a single sober vein in my body\n\n[Intro: Wiz Khalifa]\n*Wiz laugh*\nI got a lotta cash\nI don't mind spending it\n\n[Verse 2: The Weeknd]\nDo you like the way I flick my tongue or nah?\nYou can ride my face until you're drippin' cum\nCan you lick the tip then throat the dick or nah?\nCan you let me stretch that pussy out or nah?\nI'm not the type to call you back tomorrow\nBut the way you wrapping 'round me is a prob\nAin't nobody tryna save ya\nBaby, get that paper\nProbably got a lot of other bitches owe you favors\nPussy so good, had to save that shit for later\nTook her to the kitchen, fucked her right there on the table\nShe repping XO to the death\nI'm tryna make these bitches sweat\nI'm tryna keep that pussy wet\nI'm tryna fuck her and her friends\n\n[Bridge: Ty Dolla $ign]\nYou gonna run it for these hunnids, girl, or nah?\nShow me, is you really 'bout your money, girl, or nah?\nDon't play with a boss, girl, take it all\nTake it for a real one, you gon' get it all\n\n[Hook: Ty Dolla $ign]\nIs you really 'bout your money or nah?\nCan you really take dick or nah?\nCan I bring another bitch or nah?\nIs you with the shits or nah?\nOh nah, oh nah\nWould you ride for a nigga or nah?\nWould you die for a nigga or nah?\nWould you lie to a nigga or nah?\nOh nah\nCan you really take dick or nah?\nCan I bring another bitch or nah?\nIs you with the shits or nah?\nOh nah, oh nah\nWould you ride for a nigga or nah?\nWould you die for a nigga or nah?\nWould you lie to a nigga or nah?\nOh nah", "image": "https://images.genius.com/3cd68c66d12d757c908ddbdcefb581e8.441x441x1.jpg", "album": null, "title": "In Vein (remix)"}]}