{"artist": "Valete", "songs": [{"title": "O 1º MC Português (Curta Metragem)", "year": "2018-06-13", "lyrics": "[Intro - Locutor]\n“11 de agosto de 1973, hoje é o dia da coragem\nA vitória está perto irmãos! Acreditem!\nVamos ouvir outro tema depois do intervalo! Até já!”\n\n(Telefone toca)\n\n[Diálogo]\nMário - Estou?\nRececionista - Estou sim, Sr. Mário, eu peço desculpa\nÉ aqui da receção, está aqui uma rapariga chamada Floribela\nEla diz que é sua fã, diz que o quer conhecer\nQuer uns autógrafos também…\nMário – Podes mandar subir\nRececionista - É, pronto. Então eu vou mandar subir\nObrigado, Sr. Mário\nMário - De nada\nRececionista - Olhe, pode subir. É o quarto 115, no 1º andar\nFloribela - Obrigada\n\n[Verso 1 - Valete]\nEle diz, podes entrar Floribela\nEla passa por ele e ele olha po’ booty dela\nRabo diferenciado, parece que foi ampliado\nArrepiado ele fez cara de quem quer dar uma mordidela\nO andar dela já o ‘tá a desgraçar\nEla olha pa ‘trás e ele tenta disfarçar\nFicou sem jeito sentiu que foi apanhado e\nComo um suspeito, larga um sorriso acanhado e\nFala do céu cinzento e do tempo chuvoso\nPa’ ver se alivia o momento embaraçoso\nEla fala do vento, diálogo infrutuoso\nDiz que amanhã o tempo será mais impiedoso\nNão se importa de estar na conversa merdosa, mantém a nota\nMas nota-se muito que está bem nervosa\nNão contava em baquiar, fraquejar\nNão diz uma frase sem gaguejar\nPõe uma mão na almofada e começa a espremer\nE fecha a outra mão pra’ ver se deixa de tremer\nAceleração cardíaca sufocante\nTranspiração respiração ofegante\n\n[Diálogo]\nMário - Então estás nervosa?\nFloribela - Sim, estou um bocadinho nervosa\nMário - Fica à vontade, eu sou da paz, fica à vontade\nQueres beber um copo de água ou algo assim?\nFloribela - Sim, pode ser um pouco de água, por favor\nMário - Ok… Toma, segura!\nFloribela - Obrigada\n\n[Verso 2 - Valete]\nInquieta com uma mão na mala a outra no cabelo\nEla fala mas não consegue olhar nos olhos dele\nDiz que a irmã Lúcia também acha que ele é o maior\nMas ela é a única que sabe todas as músicas de cor\nDiz que até cantava mas não quer ser atrevida\nDiz que canta tão mal que tem medo de ser agredida\nMas diz que a mãe gosta e até fica aturdida\nEla diz que canta todas, ele diz que não acredita\nPede-lhe pa’ cantar pa’ ver se desaparece a descrença\nEla diz que dispensa fazer figuras porque ’tá muito tensa\nDiz que seria uma ofensa seria um momento triste\nEle sente o acanhamento dela mas ri-se e insiste\n\n[Diálogo]\nMário – Anda lá, Coragem!\nFloribela – Ok, vou cantar mas só um bocadinho!\nMário – Força\nFloribela – \"Nesta Selva, Coragem\nP'ra seres, tu mesmo, nesta selva\"\n\n[Verso 3 - Valete]\nDesfilou uma voz rouca com um timbre esbelto\nEle ficou louco, quieto, boquiaberto\nDiz: “A tua performance merece champanhe\nNunca pensei que cantasses tão bem”\nNão és como as rainhas da cocada, tens a voz dourada\nMereces ser honorada, ela ficou logo corada\nSe ela lançasse um disco todos ficavam reduzidos\nAbafaria todos, seria um genocídio\nCanta com mestria, ele nunca teria deduzido\nMelodia na voz dela, deixou-o mais seduzido\nCanta a donzela e a língua dele congela\nEle já só pensa em enrolar-se com ela\nTantos atributos deixaram-no abalado\nEmbalado só pensa em dominá-la e possuí-la\nEle fica quase um minuto calado\nRalado a pensar como irá provocá-la e seduzi-la\nDiz que ela tem a voz da Rosa Atalaia\nPergunta se ela quer um coche de Moskovskaya\nEla sorri e diz que de vodka nunca foge\nDiz que bebida é droga mas pode beber um coche\nEle diz: “É suave, não precisas de ter cautela!”\nTranquiliza-a enquanto enche o copo dela\nDiz que ela é singela, encantadora, arrebatadora e\nPergunta se ela não sonha ser cantora\nEla diz que se fosse nunca se desleixaria\nEla até sonha mas sabe que o pai não deixaria\nEla até entende o pai por isso nunca se queixaria\nO presente e o futuro dela é vender na peixaria\nEla bebe enquanto lamenta-se à janela\nEle tenta pôr mais vodka no copo dela\nEla sente os sinais, ele é igual aos demais\nAfasta o copo e diz que já não quer mais\nVê que ele quer embebedá-la pa’ furnicá-la\nCamasutrá-la na cama, fulminá-la\nVê que ele quer embebedá-la pa’ furnicá- la\nInfernizá-la na cama e fulminá-la\n\n[Diálogo]\nFloribela – Olha tenho que ir embora! Que pena!\nMário – Já?!\nFloribela - Tenho o meu pai à minha espera, tenho mesmo que ir, mas podes-me dar o teu autógrafo, por favor?\nMário – Sim. Claro\nFloribela - É pena, mas tenho mesmo que ir\nMário – Olha, podes-me dar o teu número?\nFloribela – O meu número?\nMário – Sim, quando voltar para Lisboa, ligo-te\nFloribela – Oh! Já sei que não vais ligar\nMário – Olha que eu ligo!\nFloribela – Quero ver isso…Adeus\n\n[Refrão]\nCoragem, p'ra seres tu mesmo nesta selva\nCoragem, p'ra seres tu mesmo nesta selva\n\n(Telefone toca)\n\n[Diálogo]\nFloribela – Estou, quem fala?\nMário – Sou eu o Mário, estou cá em Lisboa, tudo bem?\nFloribela – Ligaste?!\nMário – Eu disse que ligava\nFloribela – Que bom!\nMário – Queres ir jantar ou algo assim?\nFloribela – Sim, podemos ir jantar\n\n[Verso 4 - Valete]\nClima radiante e amoroso\nEle levou-a a um restaurante glamoroso\nColorida ela ofusca toda a gente\nVeio vestida principescamente\nRestaurante num dos prédios pombalinos\nEles já todos vibrantes e descontraídos\nVinho já todo bebido, jantar de arromba\nEles comeram até ficarem combalidos\nNoite terminada e ela emocionada\nEstava intencionada e ele não tentou nada, nada\nMaroto quis guardar a ousadia\nCombinaram outro dia e outro dia e outro dia\nE noutro dia lá no jardim aromático\nOs dois loucos no sexo acrobático\n“Lembras-te no jardim aromático\nNós dois no sexo acrobático”\n\n[Refrão]\nCoragem, p'ra seres, tu mesmo, nesta selva\nCoragem, p'ra seres, tu mesmo, nesta selva\n\n2ª Parte (O Parto)\n\nEnfermeira – Isso, respire, calma, calma, respire comigo, isso, coragem!\n\n[Verso 5 - Valete]\nO parto ’tá iminente, corpo debilitado\nVai começar, o colo do útero completamente dilatado\nEla sente uma dor hedionda, vê aumentar as palpitações\nE sente-se, cada vez mais frágil, tonta e cheia de contrações\nO feto já desce pelo canal vaginal\nNo hospital é o primeiro parto do período matinal\nBarulhenta, quarenta minutos de horrores\nTurbulenta, liberta vários odores\nO líquido da placenta corre na vagina sangrenta\nPura tormenta ela grita e diz que não aguenta com tantas dores\nTentam acalmá-la ela ‘tá muito frenética, elétrica\nE a médica da lhe outra injeccão analgésica\nE diz que com tanto esforço o bebé sairá forte, lindo\nO bebé sairá rugindo e ela diz “Que Deus a ouça!”\nAbdómen vai contraindo o útero vai-se expandindo\nA médica vai gerindo tudo e pede lhe p'a fazer mais força\n\nForça! Força!\n\nO pai tá nos corredores em gritaria e desabafos, louco\nQuer assistir ao parto quase provoca desacatos, louco\nO polícia tira o cacetete e começa a ostentá-lo\nEle vira as costas e o polícia nervoso expulsa-o do hospital\nNa sala de parto ela grita e tenta dar-lhe com mais fé\nNum ápice na vagina já se vê a cabeça do bebé\nA enfermeira segura – o e sente a aura angelical\nDelicada e logo a seguir corta o cordão umbilical\n\n3ª Parte (A Primeira Rima)\nNilton – Mãe, mãe!\nFloribela – O quê Nilton?\nNilton – Ouve a minha música na rádio, ouve, ouve! Ouve, ouve!\nFloribela – Na rádio? O quê?\nNilton – Sim, liga a rádio, ouve!\n\nLocutor: \"12 de novembro de 1987, recebemos uma maquete de MC Nilton que se autointitula o 1º MC Português\nEsta deve ser provavelmente a primeira música de rap em Portugal. MC Nilton, vamos ouvir!\"\n\nAntes da letra, do flow ou da imagem\nSer MC é uma questão de coragem\nSempre uma questão de honestidade\nTu tens coragem de dizer a verdade\nJá sabemos que tu és memorável\nMas tens coragem pa' te mostrar vulnerável\nCoragem pa' andar como os sonhadores\nCantar o que sentes sem ter seguidores\nCoragem pa' habitar no desconforto\nQuem tem coragem de não viver para os outros\nP'ra ti que és Mulher 'tas na barricada\nTu tens coragem pa' ser emancipada\nLarga esse trabalho e essa vida mediana\nQuem tem coragem pa’ viver do que ama\nAntes do flow, da letra ou da imagem\nSer MC é uma questão de coragem\n\n[Bridge]\nSê fiel a ti, sê fiel a ti, coragem, coragem\nSê fiel a ti, sê fiel a ti, coragem, coragem\n\n[Refrão]\nCoragem\nSei como é duro ser real aqui\nQuem tem coragem de ser MC\nCoragem pa’ florescer\nE de ser fiel a si mesmo até morrer\n\nCoragem\nSei como é duro ser real aqui\nQuem tem coragem de ser MC\nCoragem pa’ florescer\nE de ser fiel a si mesmo até morrer\n\nCoragem\nSei como é duro ser real aqui\nQuem tem coragem de ser MC\nCoragem pa’ florescer\nE de ser fiel a si mesmo até morrer\n\nCoragem\nSei como é duro ser real aqui\nQuem tem coragem de ser MC\nCoragem pa’ florescer\nE de ser fiel a si mesmo até morrer", "album": null, "image": "https://images.genius.com/1ec9a704e065eb4f5b2125cdfb6cd195.429x429x1.jpg"}]}