{"songs": [{"year": "2009-12-18", "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "A Little Appalled", "lyrics": "Gimme that '94 Puff shit, Ali\nI'm so appalled, Louis Vuitton draws\nThe shit, a booth for me is a bathroom stall\nIf you're not fond of me, you're comedy, Little Duval\nI have a lot of flaws, I'm human before all\nI wake up in the morning smell some coffee, then tell your bitch to get off me\nMos Def, word to every autopsy\nMan that boy bad, man that boy spaz\n'Til he crash like Sandra Bullock and Luda on the ave\nHe changed his name, he a conscious rapper\nNaw mutha'fucka I'm just Compton's rapper\nI might spit some intricate shit for retards not to get\nBut really I'm just as rude as Marshall Mathers\nIs that a contradiction? He contradicting himself again?\nOf course that's a contradiction, the fuck you think life is?\nWe not like like Christ is\nWe all want ices and devices to make the bitches say I like this\nPeople don't understand why I went southpaw\nI looked in the mirror and said I can't be like y'all\nI can't be like Game, I can't be like Eazy\nTo get in this rap game, I know it won't be easy\nCause my shit different\nI know\nHe from Compton, where he from, have he killed before?\nTruth is, I ain't the most ruthless, but I'm not cupid\nBefore she had two kids my momma worked two gigs\nTo get out Chicago\nTo move right back to another ghetto, on Sante Fe playing the lotto\nI used to want a champagne two door Tahoe\nUntil I seen that same truck shot by five-o\nDead with his eyes closed, y'all should've seen him\nOff a gallon of cough syrup, but rifles had leaned him\nThat's why these tough rappers man I don't believe 'em\nY'all wanna be 'em, I wanna grab bats and beat 'em\nSo they can feel the pain of the blocks I'm from\nWhere my heart turned numb\nAnd the powder and the shells come up off that gun\nCome up off your chain, or come up off your life and have a fatherless son\nIt's the syllabus for the ignorant militant mind\n'quivalent crimes for jail sentencin'\nNo one preventin' this war\nYou sure, you sure\nSure as the edges on every ocean, now let's explore\nThe Kendrick Lamar LP I been promotin' for 'bout a month\nDon't worry its comin' soon, like a fast nut\nI never be gassed up, some labels they passed up\nNow the industry crashin', I guess they got bad luck\nYour bad, you don't write neither? There goes another fad\nShit I write ether\nI get it in like the Vanna on Wheel of Fortune forcin' your forfeit\nWith the strength of the prime forces of four fork lifts\nThis is very extra necessary\nThis extra scary, this is Amityville\nThis the Exorcist on ecstasy pills\nAnd if I can't do it my integrity will\nHead dog wishes, every Compton bitch is\nI mean this shit is\nFucking ridiculous\nFucking ridiculous\nThey all got a fat ass but lower case titties\nNow I gotta mix and match, jungle fever, white and black\nDouble D, Brittney, Becky get your mouth intact\nReg call 'em Jabberjaw, she gon' hop skip and jog\nJust to read my twitter blog\nMan these hoes pitiful\nAnd to you bloggers that say I'm weak\nYou know how long I took to chop this fuckin' beat?\nY'all don't 'preciate shit\nAll y'all do is hate shit\nAnd if I don't say shit y'all still say I ain't shit\nAnd that's ridiculous\nI mean that shit is\nFucking ridiculous"}], "artist": "Kendrick Lamar"}