{"artist": "IDK", "songs": [{"title": "She Blocked Me / Brian Arsinal", "lyrics": "[Verse 1: Jay IDK]\nI think she blocked me\nThe block usually blue but now the block green\nShe text me every time she had a few drinks\nI text her back but she never reply\nI think she blocked me\nI know she blocked me\nCause every time I call its only one ring\nAnd then a voicemail and then I hang up\nI wish I only wanted her for one thing\nI wish I knew the difference between a groupie and girl\nI wish I didn't think that she was number one in my world\nI wish I didn't think that she would be the one for the ring\nI wish I didn't wish that she would be the one when it rings\nBut instead its a bill collector, how funny is that?\nFunny enough to probably make me cry instead of a laugh\nBut I'm a guy I don't cry I sigh or maybe a gas\nBut that's the most that you will ever get from out of my ass\nWhy did she block me? Why did she block me?\nThe block usually blue but now the block green\nAll I see is blues, its like I'm boxing\nAnd got hit in the eye I'm such a mockery\nAll of my friends laughing, they like I...\n\n[Verse 2: Femdot]\nTold you nigga, I tried to warn you nigga\nShe Dikembe with blocking you exhausted your options\nI mean I really don't wanna help you, if we being honest\nCause I done told you man, its not you man, she the problem\nI'ma break it down like this\nShit, hitting cool, but find out what makes 'em smile and sick\nWhat makes 'em laugh, what makes 'em cry, find out what makes 'em tick\nCause if you find out they emotions, find out how they live\nShit everybody's insecure, that stable talks a myth\nWe'll both fall down if you move an inch\nYou move the bit, now she took the a mile and ran with it\nAnd I'll be damned if you chase on that while she scandalous\nShe got you trippin' out here dryer then Los Angeles\nWhen opposite December hit, I mean gonna handle this\nLike damn here we go again, maybe I'm just trippin'\nBut I told you not to mess with shorty from the beginning\nMy nigga so live with it...\n\n[Verse 3: Jay IDK]\nI think she blocked me\nAnd that's the shit that makes me turn to stalking\nI walk inside of her house wearing a stocking and (Beep)...\n\n[Outro: Brian Arsinal]\nMr. Mills, this is Brian Arsinal, giving you a call back. You have a past due balance of $243 dollars and 68 cents. You have been given 2 extensions and you've requested a third one. I'm just gonna go ahead and be honest with you, a third extension is out of the fucking question, okay. $243 funky, fuckin' dollar... I can understand 30,000, right. Nobody just walks around with that much money on 'em but 243 bucks is fuckin' pathetic. Here's an idea. Why don't you call whoever this diamond bitch is that keeps poppin' up on your call history and ask her to fund you the money until you get your first advance? Give me a call back", "image": "https://images.genius.com/d97b0ca6e4041c74908a8955878702c7.500x500x1.jpg", "album": "The Empty Bank", "year": "2016-09-09"}]}