{"songs": [{"title": "Kunta Kinte (Just Blaze Mix)", "lyrics": "AKIR - “Kunta Kinte (Just Blaze Mix)”\n[Emcee(s): AKIR]\n[Producer(s): Just Blaze (Original Instrumental from [?] - \"[?]”)]\n\n[Intro: AKIR]\nUh.  AKIR.  AKIR, One Enterprises.  Uh.  Come on.  Kunta Kinte.  Yo, yo\n\n[Verse 1: AKIR]\nNotice they try to own us in several ways, and ‘til\nThe grave, more than physically, we’re locked in a cage.  They want us\nEnslaved.  Respect money, hustle for pay\nStruggle for wage.  Turning the page, suddenly aged\nChristmas all lay away—working your whole day away\nOvertime tomorrow just to borrow so your kids can play today\nHoping that you get a raise for a better place to stay\nWell-fleshed, then you’re home, standing up while dwindling gold\nTwenty-one years old and you roll for your mom\nBeing molded, thinking adult with the moves of\nA grown kid trying to focus though the images are bogus\nFeeling hopeless, scrambling for crumbs like roaches\nTrying to be a player, but nobody coaches\nConsuming with your credit cards, they’ll swarm you like locusts\nThough they show interest, you never know to invest\n‘Cause they know the interest’ll lock you deep in the debt\nRewriting checks for the rent is garbage.  Praying direct deposit\nDrop before they stop it.  It adds to your profits\nGhetto Economics—fuck a written promise.  As long as\nNiggas got dollars in his pockets, I’ma keep rocking\nHard to deal between that and my auto-\n-mobile shit.  I wish somebody told me the deal\nNow there’s kids with their bellies to fill.  Better deal with\nBaby moms or the government will.  The plot’s ill\n\n[Hook: AKIR]\nYo, they could care less how the fuck a nigga feel\nI’m struggling with bills—the slavery game is ill\nAccosting, a flossing nigga behind the wheel.  Foul\nCards in the deal—the slavery game is ill (Yeah)\nYanking up the ghetto youth, scramble for their meal, hand-\n-cuffed against will—the slavery game is ill\nHating on each other, my brother, the scene’s real.  Share-\n-cropping in the field—the slavery game is ill\n\n[Verse 2: AKIR]\nYo, yeah, yo\nHustle to buy realty until my pockets filthy\nDime dropped, dime stopped, nigga found guilty\nCall and come and get me.  My plans of living simply\nNow remain history.  Wondering really lynched me\nSlow cats move quickly when it comes to hate\nFighting for bones off his dog plate, he’s upstate\nAsk him, he says, “Fuck it.  We’re crabs in a bucket”\nThe darkest women let the lightest men fuck it\nStuck in a syndrome since we rob from our home\nCalling women “hoes” after the cash, cars, and clothes\nAnd what’s the odds of those who stuck fucking become foes\nFulfilling family roles ‘til the family close?  Nope\nNot trying to be broke, we’re weed-smoke thugs\nWho bag a bitch and handle shit to handle, hit behind the club\nGovernment projects, bricks built to echo garbage\nLooks like the same place we go to gain knowledge\nThe afterschool centers where niggas grab wallets\nLook like the jail cells, conditioning hidden progress\nGirls on the way to college getting the grease and make\nDollars.  When we come together, all we do is holler\nFar from the same pace, the same race.  Just to save face\nNiggas go get a job for minimum wage\nOn the subway, the elders shake their head at the way\nYoung people still complain, though it’s better today\n\n[Hook: AKIR]\nAyyo, they could care less how the fuck a nigga feel\nI’m struggling with bills—the slavery game is ill\nAccosting, a flossing nigga behind the wheel.  Foul\nCards in the deal—the slavery game is ill (Yeah)\nYanking up the ghetto youth, scramble for their meal, hand-\n-cuffed against will—the slavery game is ill\nHating on each other, my brother, the scene’s real.  Share-\n-cropping in the field—the slavery game is ill\n\n[Verse 3: AKIR]\nYo, yo\nEmcees on the radio spitting their rhymes inspire\nKids to start flipping their minds, saying, “This is the time”\nMimicking gimmicks ‘til they’re fitting in stride\nFree shows so they can get it to you live ‘til you’re feeling the vibe\nGood luck selling it for ten, so cut it to five\nMost people won’t give you the time just to come and rely\nLet alone go in their pocket to give you a dime\nBigger shows, now they’re jocking you to get something you sign\nA&Rs with their contracts and dotted lines\nFrom one block to another, being sold with\nThe other brothers, slave chains on the cover of a\nClassic.  Tragic, the company trashed it\nWondering “where’s the cash?” when advanced debt\nWith no assets, indentured service, slave bastards\n\n[Outro: AKIR]\nYeah.  Uh huh (Ahahahahahahahahaha).  Don’t get trapped, nigga", "year": "2004-12-09", "album": "Various Tracks (AKIR)", "image": "https://images.genius.com/87db06ea18ca66b21b525e747a189b60.1000x1000x1.jpg"}], "artist": "AKIR"}