{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/ddb74dfab0d2ccdc33403725587ccf5f.1000x1000x1.jpg", "title": "Gentry", "year": null, "album": "51", "lyrics": "[Interview of Huey P. Newton in jail]\nIn America black people are treated very much as Vietnamese people or any other colonized people because we're used, we're brutalized. The police in our community occupy our area- our community- as the foreign troops occupy territory. And the police, they are not to- in our community- are not to promote welfare or our security, our safety, but they are there to contain us, to brutalize us, to murder us because they have their orders to do so. Just as the soldiers in Vietnam have their orders to destroy the Vietnamese people. The police in our community couldn't possibly be there to protect our property because we own no property. They couldn't possibly be there to see that we receive the due process of law for the simple reason that the police themselves deny us the due process of law, so it's very apparent that the police in our community are not for our security, but the security of the business owners in the community and also to see that the status quo is kept in tact. When we first started, we had a police alert patrol. We would patrol the community; if we saw the police brutalizing anyone we would put an end to it. Usually, the police wouldn't brutalize anyone if we were on hand because we were armed and if the police arrested the individual, we'd follow them to the jail and bail the individual out- whether if he was a Panth or not. We would gain many recruits like this so therefore the community started to say \"well, these people are really concerned about our welfare.\" We feel that the white students should relate and pay more attention to the colonized situation here of the blacks first because, after all, this is home. This is not to say that they should not denounce Americas treacherous actions abraod. I think that can be done at the same time. It’s just a matter of placing emphasis upon the criminal activities of America here in the homeland"}]}