{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "I Run New York", "lyrics": "[Intro: 50 Cent]\nOh! Please don't play with the animal\n\n[Hook: 50 Cent] (Tony Yayo)\nThe walls have ears lil' nigga, I run New York\nEven when I ain't there lil' nigga, I run New York\nI said the walls have ears lil' nigga, I hear when you talk\nLet's get this shit clear lil' nigga, I run New York\n(Here we go now!!!!!!!!!!!!!!)\n\n[Verse 1: 50 Cent]\nI wake up, stare at the ceilin', I'm alive, what a beautiful feelin'\nI put my vest on, right after I put on my draws\nIt's a habit I'm always prepared for war\nSee, my life's like some shit you seen in a flick\nBitches act like porn stars when they sit on the dick\nWhen I was gettin' out the game I said one more flick\nTest my aim in the range I'm like one more clip\nIt's my brain, I'm insane, I be on some shit\nMan, I run Interscope, Jada's tryin to annoy me\nHe's nothin' but another disgruntled employee\nBeen in the game ten years, and he still ain't rich\nEven his momma upset that he still ain't shit\nBut he keep runnin his yap like I'm a take all that\nOne more word out his mouth I'll push Styles shit back\nSee, the nozzle on my trey pound is three inches long\nAnd the kick on the four-fours is extremely strong\nWith a lil' trey deuce it's like pop, pop\nChase his ass up the block till his bitch ass drop\nAnd them verses he be kickin', none of 'em hot\n'Cause he ain't got none of that shit he sayin' he got\nAnd he ain't did none of that shit he sayin' he did\nAnd I ain't got, time to be talkin' 'bout this shit, fuckin' faggot!!!!\n\n[Hook: 50 Cent]\nI gets busy lil' nigga, I run New York\nYeah, I live in CT, lil' nigga, but I run New York\nI don't go to parties, lil' nigga, but I run New York\nAnd I stay gettin' cheese, lil' nigga, 'cause I run New York\nYayo, tell 'em I run New York\n\n[Verse 2: Tony Yayo]\nMy money longer than yours, nigga, call your recruits\nThe LOX made more money in them damn shiny suits\nThe game about sales, drugs and rappin'\nJada, fuck your punchlines, my shirt went platinum\nStyles and Sheek Louch, went double plastic\nYayo, Buck and Banks is puttin' out classics\nA hundred shots, a hundred clips, y'all ready to die\nFat Joe ain't a gangsta, he scared to fly\nAutomatic Mossberg who want a piece of this pump\nI'll have Ja Rule buried, in some high heel pumps\nVest up in the bulletproof man fuck that\nHomie shoot up my whip, all you leave is a scratch\nYo, I flip cocaine in your project lobby\nAnd beat you with my pistol like Kane did Chauncey\nIt's T.O.N.Y. Y.A.Y.O\nMy whole clique got dough, my hoes on the fly home\nG4's, we fly on Lears\nAnd my rocks lookin' like flashlights in my ears, nigga\n\n[Hook: 50 Cent]\nWhen I'm in D.C. lil' nigga, I tell 'em, I run New York\nWhen I'm out in Philly lil' homie, I run New York\nWhen I'm in V.A. I tell niggas guess what I run New York\nWhen I'm in N.C. niggas holla at me cause I run New York\nYayo tell 'em I run New York\n\n[Outro: 50 Cent]\nYo who the fuck told this lil' nigga he can talk to me like that?!!\nIf I catch him I'll bawl him up and roll him somewhere, ha ha ha ha!!!!\nDee! Waah! wanna talk to me?! wanna tell me what's goin on?\nYou want me to service him for real cause I'll service him! I'll murder!!!!\nHa ha ha ha ha ha!!!! Hey! Hey get Puffy on the phone!!!!\nTell him I said, tell that nigga Puffy I said get out the mirror for a second let me talk to him\nPuffy own the nigga motherfuckin publishing!!!!\nTell him I wanna buy the nigga Jadakiss publishing! nigga still ain't recoup!!!\nAwww nigga you in the red, you owe money nigga!!!\nAwww man!!!! Now why you made me put your business in the streets!\nNow niggas know you ain't shit!!!! Damn!\nI see your monkey ass in the paper, cause you ain't returned them jewels you borrowed\nYou better give them back! you dirty nigga\nAin't none of that shit you be wearin yours!\nHa ha ha!!! We could've kept it a secret nigga\nThese niggas I'm supossed to beef with!?\nAwww man!!!! This fight is fixed, you've been set up!\nHa ha ha!!! That's what he 'gon say they set me up man\nI ain't know the nigga was gonna do that\nHa ha ha ha ha!!!!!", "year": null}]}