{"artist": "YG", "songs": [{"image": "https://images.genius.com/f6422bec920003ac3fdebe1ccdb5bddb.1000x1000x1.jpg", "year": "2012-04-01", "album": "California Livin", "lyrics": "[Intro: Nipsey Hussle]\nAnd now for my next number, I'd like to return to the classics\n(Cookin' Soul)\nUh, uh, yuh\nWest Coast (West Coast)\nHussle, Hussle\nYa know\nNeighborhood\nWest Coast, who ride?\nBlanco\nLabeled as a thug\nAyy, yo, B\nWest Coast (West Coast)\nUh, look\nLabeled as a thug\nWest Coast, who ride?\n\n[Verse 1: Blanco]\nAin't the type of white dude sippin' Bud Light\nI'm the type with my nine screamin', \"Thug life\"\nA bad bitch wanna fuck tonight\nYou ain't shit, motherfucker, so it's fuck your life\nFuck the D.E.A., I.R.S., and F.B.I\nThere, I said it, won't regret it 'til we start trial\nI don't ever leave a paper trail\nAnd best believe I'ma G, I will break the scale\nI'm a hustler, give a fuck about a budget\nI'm a gangsta, give a fuck about the judges\nI'm a monster, middle finger to you suckas\nI'm a mobster, Mr. Untouchable\nCan't fuck with me, I'm so on some other shit\nOn a road trip, gotta bring my other bitch\nNot my other bitch, my other, other, other bitch\nEvery brick I flip, the more I'm like, \"Fuck, I'm rich\"\n\n[Chorus: 2Pac]\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nFuckin' mob figga, west coast\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nFuckin' mob figga, west coast, who ride?\n\n[Verse 2: YG]\nNiggas hate daily, Glock is my protection\nI'm the nigga that your mama told you not to mess with\nCaught a interception on your bitch now that's a wridnap\nGive her some dick quick, now watch how fast she collapse\nPusha Ink the label, yeah, been that way from day one\nThe hoes get around me and me? I just got to say somethin'\nI let my chain speak, I ain't really gotta say much\nIf see me in the streets, holla, \"Suwoop, nigga, stay up\"\nI'm all about my dollars, pop my collar on a hoe bitch\nShe say, \"All you wanna do is fuck me,\" I say, \"You know it\"\nMy bitch rollin', my bitch bad\nDon't trip 'cause the homies got the strap\nRun up in your pad like the motherfuckin' police\nWith pistols in your face like, \"Nigga, don't you owe me?\"\nI'm tryna steal the rap game like the house lit\nI'm from the west but I'm tryna fuck a south bitch\n\n[Chorus: 2Pac]\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nFuckin' mob figga, west coast\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nFuckin' mob figga, west coast, who ride?\n\n[Verse 3: Nipsey Hussle]\nLook, look\nI'm fresh off the block, I ain't even really left yet\nBest on the west, hands-down, no question\nAnd my Adidas got the Slauson Boy etched in\nAnd Black Sam keep the money invested\nAll I do is check rappers off the checklist\nAnd I don't beef, I eat beef for breakfast\nAnd I don't sleep 'cause these streets is hectic\nI don't make peace, I just put 'em on my necklace\nReal nigga, never ran, never snitched\nThe old lady on Fifth ain't raise no bitch\nAnd we some real niggas, not like the niggas in your clique\nAlways runnin' 'round talkin' about the little shit that you did\nWe'll never say nothin' 'bout that big shit that we did\nWe just see each other and nod, and you know what it is\nAnd we don't talk about the big shit we did\nWe just see each other and nod and you know what it is, nigga\n\n[Chorus: 2Pac]\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nFuckin' mob figga, west coast\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nFuckin' mob figga, west coast, who ride?\n\n[Verse 4: DB Tha General]\nDB nigga I be on that dope shit\nMy junkies be stay ready, be heavy and get your dope, kid\nTalkin' pussy, boy, on my mama, you ain't shot a stick\nThis nigga mad, oh well yeah I got your bitch\nI heard that he snitching, paperwork bands circulating\nHeard this nigga snitch, I swear to God, how the fuck he ate?\nKnown to bang hands down, I got the brown\nYou can ask around the town, DB I'm gettin' down fast\nI got the gas and gas, gas, gas on top of gas\nI'm like, \"Fuck school,\" fuck school, never went to class\nI act a ass and act a ass I'm like, \"Fuck math\"\nThey talkin' shit, I swear to God them niggas dumb trash\nBlack mask, I'm hoppin' out with that black mask\nHe's talkin' California, we like, \"Fuck fast\"\nI had cash and had cash and had cash\nMe, YG, Nipsey, Blanco, I had to ask\n\n[Chorus: 2Pac]\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nFuckin' mob figga, west coast\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nLettin' niggas have it, I've been labeled as a thug\nFuckin' mob figga, west coast, who ride?", "title": "L.A. Confidential"}]}