{"songs": [{"image": "https://s3.amazonaws.com/rapgenius/MV5BMTY0MDY3MjQxN15BMl5BanBnXkFtZTcwODQ2NzE1NA@@._V1._SY314_CR11,0,214,314_.jpg", "title": "Big Spender", "album": null, "year": "2005-01-01", "lyrics": "[Hook: (Kid Talking)]\nHey big spender, hey big spender, hey big spender\n\n[Bridge: Nick Cannon]\nI don't see no shows, I don't see no rolls\nI don't see no lolos, and a low profile\nAs far as the wardrobe goes, all those ain't your clothes\nThe product placement videos with no logos\nYou got a chain, no glow\nGot a deal, no dough\nJust the same, Joe small throwbacks and corn ropes\n\n[Verse 1]\nNot a good first weeks, worry gonna blow\nBut there's no need to front you broke we both know\nHad the hoes rolling in drows\nNow you over exposed\nPointing to your account and the amounts you owe\nYour record was so close not def just so so\nHow you label don't know you on talking no show\nThe only time you in the streets is just signs for promos\nYo everybody know who wrote your stole flow\nYou gotta pay him too, your publician's a no go\nI got speddy gonzales dollars and yours is slow mo\n\n[Hook]\n\n[Verse 2: Kanye West]\nYou never seen a nigga quite like this before\nHe was stunting hard as hell before you even got to blow\nMagazines claim he gassed like Texaco\nCause Jesus walk with him in Mexico\nBack when the cars cost too much to floss\nThem alligator boots? I stitched those\nBody official, how, when my money stayed in the rear like Game or DJ Quik's clothes\nAnd I just wanted to go platinum one time\nNick, he still spending money from Drumline\nMan when I finish this Usher tour up\nI'ma try my best to clear my credit score up\nIt it cause the Yves Saint Laurent on the glasses?\nOr is it cause my name on them backstage passes?\nNiggers always asking where his maybachs is\nMotherfucker have you seen my taxes?\n\n[Hook](x2)\n\n[Verse 3: Nick Cannon]\nThey thought you was gonna blow, but now you weren't\nI got good news though, I just saved the car insurance\nYou probably learn and this music game all in crack\nNeed to go back to slinging crack\nIn fact you wasn't even good at doing that\nYo your street credibility, you ruined that\nTrying to be [?] and pursuing rap\nFar as wack contracts, you was doomed from that\nManger threw your door, now you sewing black\nWhat I get for a track you never make in life\nI'm like when coke just hit, I make a million a night\nYo what happened to your [?]?\nYeah I seen you on cribs, that's not what you live\nMan  I know your babies mom\nWhy you dodging your kids?\nYeah I make big money, yeah I drive big cars\nBut I can do that dog, I'm a movie star\n\n[Hook](x2)"}], "artist": "Nick Cannon"}