{"songs": [{"year": null, "title": "Come Again 2012", "image": "https://images.genius.com/dacb6f69fe5b86a67f2ad154712c7ba5.404x404x1.jpg", "lyrics": "[Verse 1]\nLikkle Saigon what are you doing back here?\nThey said that you were supposed to retire last year\nTell em don't believe everything that you hear\n2012 things finna get clear\nThem talk like a batty boy, must be a queer\nGo upside his head with the Heineken beer\nI reinvent myself, why you think I'm still here?\nSeen...me never care\nIt's getting so obvious you people can't hear\nIf so, my audience'll be up near there\nThe Shawns, the Marshalls, the boy Nasir\nThe little d boy still with the long hair\nThe light skinned kid they gave rookie of the year\nSeen...me never care\nLikkle Saigon, you're gonna kill your career\nOJ da Juiceman, I tell him hell yeah\nMy cousins in the south dig that right there\nThey say, you and shorty did that right there\nDon't play it up here, see if I care\nSeen...me never care\n\nNah (me never care)\nYou think I give a fuck now nigga (me never care)\nI just lost my mama man (me never care)\nI ain't got nothing to lose man (me never care)\nI blow your motherfucking head off nigga (me never care)\nFuck with me now nigga (me never care)\nSay my name now bitch (me never care)\nI'm on a rampage nigga, brrrrat\n\nI could rap true blue, I could rap red\nCause I'm one of the few dudes that really popped lead\nFree Tru Life, ya heard what I said\nNigga violate, we murder the guy dead\nIt's boom bye bye in a batty boy head\nSeen...come again\nSome niggas found guilty, some niggas plead\nWhy would you go to trial if you ain't got that bread?\nCause look at ya now, you're doing life in the fed\nYou won't be the last brown they turn to a egg\nThat's short for example, in case y'all wondering\nSeen...come again\nAnd fuck my pops, that motherfucker ain't shit\nSame to the cops, y'all make too many arrests\nThe prisons is packed, and why y'all still make beds?\nY'all make them beds to lay the black man head\n\nMotherfucker (come again)\nIt's the good guy gang (come again)\nI told you man (come again)\nAbandoned nation (come again)\nSeen (come again)\nWe not going nowhere (come again)\n(Come again)\nWe here nigga, drop that\nTwo thousand two hundred nigga\nSing to em", "album": "Warning Shots 3: One Foot in the Grave"}], "artist": "Saigon"}