{"songs": [{"image": "https://images.genius.com/826c5df8eea3fb88d213c3fb10f319a8.1000x750x1.jpg", "lyrics": "(Verse 1:)\nMy depression is so severe\nIt’s impressive that I’m still here\nEverything disappeared\nBut The Devil that’s in the mirror\nAnd the message is crystal clear\nThe sky is beautiful tonight\nBut all the stars you see have been dead for a billion years\nOut the bullet wound up on my heart I saw an orchid grow\nPush the creativity out of you, never force it though\nI orbit slow around the outer-rim of outer space\nI’m like a fucking thorn bush growing inside a flower vase\nChop it down and make a crown that’s fit for a king\nMy flow is hot — melt the wax — like it’s Icarus’ wings\nKeep saying “Mac Lethal sucks, He’s a loser that lives in Kansas.”\nAttention equals money, I’ll use it to my advantage\nI’m a God, when I die, my funeral’s in Atlantis\nI’ll use my blood and paint something beautiful on the canvas\nAn unusual blend\nYou’re wrong when you say “The Sky’s the limit,”\nWe don’t even know where the fucking Universe ends\nLet's go\n\n(Chorus:)\nI’ve been doing this a long time\nI’ve heard it all before\nI’ve been doing this a long time\nTell me is this what you’re looking for\nX2\n\n(Verse 2:)\nPayback is a filthy bitch\nLay back and I’ll kill this shit\nIt’s hard to count a million wrapped in a straight jacket\nI still seem sick\nIn a small town with big dreams\nI spray raps, I say facts, I pay taxes and get cream so…\n(Tell me is this what you’re looking for)\nSomething must be broken in my brain\nPeople prolly think that I’m insane\nI spent $50,000 bucks on a\nHouse that I could flip\nNot a fucking chain\nI don’t care about views and likes\nI abuse the mic, and bring truth to light because\nDeep in your heart there’s a fuse to light so\n(Tell me is this what you’re looking for)\nLet’s keep it real\nMy writing prowess is incredibly ill\nBut what’s the point of having it if I don’t help people heal?\nI used to wanna just destroy, I’d rather help you rebuild\nBut test me: get killed…\n(Tell me is this what you’re looking for)\n37 times, traveled round the Sun\n36 of those, absolutely numb\nCelebrating every battle that I won\nTough as ever — look how fragile I’ve become\nLook at me like I’m a shadow on the Sun\nSavage on the drum\nFuck with me you’ll get a dagger right in your tongue\nWithout fighting I won. Easy\n\nSee I been doin' this a long time\nIs this what you're looking for?\nCuz i've heard it all before\nYeah uh\nTook a little vacation, put my feet up and celebrated my win\nI know that pisses you off\nThanks for the promo you silly bitch", "year": "2019-07-12", "album": null, "title": "Mac Lethal Sucks pt. 2"}], "artist": "Mac Lethal"}