{"artist": "Z-Ro", "songs": [{"album": "Legendary", "title": "Ain’t No Love", "lyrics": "[Hook]\nAin't no love.....\nDo she really love me or the fame?\nAin't no love.....\nAnd would my niggas, still be my niggas if I didn't pay for everythang?\nAin't no love, love, love, love; do she really love me or the fame...?\nAnd would my niggas, still be my niggas if I didn't pay for everythang?\n\n\n[Verse 1]\nTold the bitch not to do it but the bitch did it anyway\nThen she wonder why when she talk to me I'm like \"Anyway...\"\n'Are you walkin' away from me, Joseph?' I'm like \"Bitch, anyway..\"\nBreak up with me then, to me, I was still single anyway...\nWe ain't engaged, we just engage; that's it--\nMake sure you cum after I come; I'm on my way, that's it\nAnd the same time tomorrow we can do it again\nMake love to you or fuck the shit out you and ya friend...\n15 years old-- I was already keepin' it real\nAnd 22 years later, that's how I'm keepin' it still\nDefinition of an OG, baby, you should already know\nI don't want no ass; gimme my cash, I'm out the do'....\n\n\n[Hook]\nAin't no love.....\nDo she really love me or the fame?\nAin't no love.....\nAnd would my niggas, still be my niggas if I didn't pay for everythang?\nAin't no love, love, love, love; do she really love me or the fame...?\nAnd would my niggas, still be my niggas if I didn't pay for everythang?\n\n\n[Verse 2]\nI wish a bitch even act like she gon' touch my phone\nKnock her ass out-- I hope I don't fuck up my phone\nShe wanna know if her homegirls numbers fill up my phone\nSo many relationships within, if I give up my phone\nNiggas would be so mad at me but they stay mad at me anyway\nSayin' what they gon' do to Z-Ro, Z-Ro be like, \"Anyway..\"\nGet rich or get rich-- fuck dyin', I'm like, \"Anyway\"\nCan't even concentrate on fuckin', I'm like, \"Bitch, anyway..\"\nGet the fuck up off me, hoe, I'm a mother fuckin' hustler...\nNo disrespect but I need to be with my customers....\nI'm addicted to blue bills, Macallan 18 and a few pills--\nAin't never gave a fuck about what the world doin' and I promise that's what I do still....\n\n\n[Hook]\nAin't no love.....\nDo she really love me or the fame?\nAin't no love.....\nAnd would my niggas, still be my niggas if I didn't pay for everythang?\nAin't no love, love, love, love; do she really love me or the fame...?\nAnd would my niggas, still be my niggas if I didn't pay for everythang?\n\n\n\n[Talking]\nZ-Ro the Crooked\nAKA the Mo' City Don\n'Ro-ther Vandross...\nThe one thing 'Ro-ther Vandross never, ever, ever, ever, ever do?\nIs show love.... That's showin' weakness, ya dig?\nMy backbone straight; don't ever bend, ya feel me?\nCuz, uh... once you bend, it's too hard to go back straight, ya feel?\nVandross...\nNo love for a nigga, and no love for a bitch, ya dig?\n\n\n\n[Hook]\nAin't no love.....\nDo she really love me or the fame?\nAin't no love.....\nAnd would my niggas, still be my niggas if I didn't pay for everythang?\nAin't no love, love, love, love; do she really love me or the fame...?\nAnd would my niggas, still be my niggas if I didn't pay for everythang?", "year": null, "image": "https://images.genius.com/799a9f5c14f8c15dbd33ecb8fe6a4906.640x640x1.jpg"}]}