{"songs": [{"year": null, "image": "https://images.genius.com/8bcb4f13231c32e3d05c93927a59e931.300x300x1.jpg", "title": "Impatient", "album": "The Purple Tape", "lyrics": "Feat. Ms. Cris\n\n[Ms. Cris]\nI'm growin impatient, I'm growin impatient\nI'm growin impatient, I'm growin impatient\n\n[Rapper Big Pooh]\nI'm up with the roosters, niggas ain't used ta\nPullin ya own weight, your life needs producers\nWon't be Medusaed, turn off the radio\nI tried to warn 'em, Black, but they ain't ready yo\nAim, steady flow, rank confetti mode\nPeople know about struggle then they gettin dough\nYou either get low or become a victim\nYo' peoples ain't good. better get 'em, here I come\n\n[Chorus: Rapper Big Pooh] (Ms. Cris)\nMy mind keep runnin, niggas stay frontin\nTime to start somethin (I'm growin impatient)\nMy mind stay spinnin, why I ain't winnin?\nEven though a nigga grinnin (I'm growin impatient)\n(I-I, I'm growin impatient)\n(I-I, I'm growin impatient)\n(I-I, I'm growin impatient)\n(I-I, I'm growin impatient)\n\n[Rapper Big Pooh]\nBottle of Jack in my hand, stumbled off stage\nSaid a few words that I crumpled on the page\nDiscarded my shirt, baby this is work\nThat real rap shit, I ain't talkin 'bout a jerk\nIt's back to the room, and back to the ebb\n'Bout a week from now, I won't remember I was here\nThe white people stare, fuck 'em~! I don't care\nLet the tats on my arms explain why I was here\nA fort for the share, yeah run your budget\nNiggas bein cheap, Hammer +Can't Touch It+\nCouple hours down then it's back to the sound\nOne phone call and I'm back to the ground, runnin!\n\n[Chorus]\n[Rapper Big Pooh]\nThis is dedication, things that I'm facin\nWill never get the best of me, simply outpace 'em\nGlass in case 'em, spoils at the end\nThey smile in your face but we are not friends\nWhy should I pretend when you will never extend\nYour hand out the end when I started to win?\nHah, the rain is now comin to the end\nThe sun always shines on the sun I ascend - the end\n\n[Outro: Ms. Cris]\nI-I, I'm growin impatient\nI-I, I'm growin impatient\nI-I, I'm growin impatient\nI-I, I'm growin impatient"}], "artist": "Rapper Big Pooh"}