{"songs": [{"lyrics": "[Intro]\nI like this Asian Doll!\nAye, I just got to get some shit straight man\nA lot of y’all don’t even really fucking know me\nDa Doll Way!\n\n[Verse]\nNiggas thinking we the same\nNah bitch you must be drunk or some\nI did my research, you was home hugged up or some\nNow you rap all of a sudden, hoes tough or some?\nI think a lot of y’all got me fucked up or some\nThis fucking label got a bitch leered up out West\nHold up lemme get this nigga beard off my dress\nThey saw I up’d the thirty, make them cheer up I bet\nAyo sauce, let me get some shit up off my chest\nMoms caught a case she up in the jail thuggin'\nHad to move him out here, they was tough on my lil' brother\nI promise you where I’m from you’ll be lucky to sell water\nI ain’t a rapper, fuck you and that XXL cover\nStanding over the stove in a lil' kitchen\nHooked up with Beecher Boys, I’m a lil' richer\nBut I ain’t sounding like no doll, I’m a little bigger\nI originated this shit, I’m little Richard\n14 on my own, I was swerving out\nHad to wrap it up, cause it was smellin' like I was serving trap\nBelieve all of what you see and half word of mouth\nCause I done caught a few body’s like I’m working out\nAnd I ain’t out here fucking all them rap niggas\nI hit the block middle school it was a wrap nigga\nWhat you know about eating out of the trash nigga?\nCaught him by himself I ain’t wear a mask nigga\nThese niggas asking me questions like we in preschool\nShade me and they hate me, see me and try to play it cool\nAnd that’s all I'ma say, read between the lines\nI'ma have to do you to, if you see the crime\nThey be thinking that I’m Haitian\nI done seen the packs move like it’s migration\nSeen a bitch get stomped right out of her braces\nI got something for her, but chicken the favorite\nKnow some niggas that’s wildin' in Tennessee\nKnow some niggas that’s bond to listen to me\nRolling loud booking all of my mini me’s\nThey got me fucked up! I’m the Queen Of Any Teen!\nSelling shit, I make guapo like everyday\nDetach a nigga skull from his vertebrae\nThe style is pretty big, I seen you with the metal\nEvery hour I live, I see it on my schedule\nMascara and wigs don’t mean you on my level\nWanna fuck me nigga? Dream on!\nWhat up gangsta, 50 cent that’s my theme song\nBitch when you was in the house playing ping pong\nI was getting to it in a drop with them thangs on\nBitch we at the awards shows saucin’ with my mink on\nDid a song with that rap bitch, who ain’t really nasty\nSmoked a blunt, and that bitch didn’t match me\nCaught her at the Walmart, that bitch was lackin'\nLeft her scarred on her face, like acne\nGotcha nigga on my phone, he wanna be with me\nSaid he always loved me, he wanna be Whitney\nNiggas left and came back, I call them team frisbee\nI got these rap bitches scared like a 360\nEverything I’ma fucking do, I’ma do major\nWhere my fucking dogs at?\nWoof, woof, Asian!\nCartier bracelets, Chanel and Gucci\nNiggas doing anything just to smell my coochie\nI ain’t tryna go pop, I’m tryna got block\nBaking soda and some water, bitch I’m tryna go rock\nYeah, I got a lot of challenges\nI'ma eat, make you bitches lose weight like Khalid did\nThe girl came along way, with my mileages\nI see myself with Madonna at Jimmy Fallon crib\nAnd we all gotta go, so nigga why fear?\nA lot of y’all stalking my page and getting ideas\nBut it’s cool tho, you the least one I fear\nAsian Doll, I got the shit that the streets wanna hear!", "album": "Doll Szn", "year": "2018-02-16", "title": "Queen of Nightmares", "image": "https://images.genius.com/251a4547c250423f671dbd9c9b448577.1000x988x1.jpg"}], "artist": "Asian Da Brat"}