{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Intro]\nC'mon let's try this Guru\n\n[Verse 1]\nWhen I was five years old, I realized it was a road\nBut at the end, I ain't seen lots of pots of gold\nI seen a long cell block, the box, the hole\nSix hundred fenced in - some innocent, some rotten souls\nSome men with men - stop it, whoa\nI ain't runnin up in shit but a broad or a bank\nTryin to cop a small hammer, move out like Shawshank\nWith Redemptions, I got my mind on revenges\nThey tryin to kill me at the same time keep me alive\nI'm movin out like Adebisi on Oz\nWith my skully on tilt, two whacks in my palm\nPosted up in the yard, everyday I think of pokin the guard\nThrow a crack a nigga turnin me in\nTryin to crack a nigga, turnin me thin\nFood soakin in lard, news fools get opened in cards\nFor deputy drapes, in this prison life, what you livin like?\n\n[Hook]\nCan you tell me what you live like?\nCan you tell me what that bed like, what's that cell like?\nWhat's livin in hell like? Tell me do you eat right?\nDo you even sleep right?\nYo, tell me what your life like\nTell me do you sleep nights, tell me what that life like?\nGettin no kites like, no flicks like\nMake you wanna quit life\n\n[Verse 2]\nThem four letters is a motherfucker\nThat's forever like a motherfucker\nWithout a letter from a motherfucker?\nIt ain't even bout the cheddar from a motherfucker\nWrite a kite, some flicks from a motherfucker\nSome drawers, some socks, some kicks from a motherfucker\nI can't believe I'm doin this bid for you motherfuckers\nI'm down for another joker case\nI was dealt this hand, and I'ma play it with my poker face\nOn the block ready to POKE a face\nI got an L goin around with a smokin case?\nYou steal the deoderant out of CVS, you locked for retail theft\nI got it body half a block stolen DT vest\nMy rap sheet read three deep breaths\nDangerous, duct tape daughters\nI take to the street, like a duck take to water\nGet your duck game in order\nMy bust game in order, I fluff 'caine with water\n\n[Hook]\n\n[Verse 3]\nThat's fucked up, you bout to take your longest trip\nAnd can't do shit, but suck it up, be strong and shit\nHandcuffed, ankle to wrist, in back of the bus\nFlashbacks of you back in the world\nCan't fuck now you thinkin bout who in back of your girl\nGot her ass up (kill this bitch) playin your crib\nThinkin bout who raisin your kids\nShit was all good a week ago, 'fore they came and raided your crib\n6:30 in the morning, they kick your door in\nFeds pour in, snatch you out your bed while you snorin\nYou unaware of what's goin on and\nCome to find out, clients you had for years, turned informant\nTold the law about the drops you make\nHow your clientele first started to escalate\nGivin him keys to your crib, was your next mistake\nAt that dinner table, breakin out that extra plate\nYou can't turn a career addict off his coke habit\nPut him on post with the toast that promote static\nBack to the operation, they got you locked at the station\nFuck your back time, you worryin about what you facin\nHeart racin, situation gettin scary\nOld clients are showin up, at the preliminary\nD.A. tryin to bury a nigga to Neveruary, 31st\nGoddamn, that gotta hurt", "image": "https://images.genius.com/bf8c5034f8552cd568d53398bc41222f.500x500x1.jpg", "year": "2001-06-26", "title": "What Your Life Like 2", "album": "The Reason"}]}