{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "Blood on the Leaves - VMA Performance 2013", "lyrics": "Http://www.schaulager.org/smq/files/lynching_tree.jpg\n\nThis performance features a clear example of using symbolism to enrich the message of the song\n\nBlood on the Leaves tells the story of a relationship torn apart by materialism, unprotected sex, and drugs. West samples Nina Simone's rendition of 'Strange Fruit', a song that paints a vivid picture of racial violence in the segregated South. West samples the line: \"Black bodies swinging from the summer breeze; strange fruit hanging from the poplar trees.\" The frenzied, pitched up use of this line cast the song in a racial light. The characters in 'Blood on the Leaves' become the lynched victims in 'Strange Fruit'. Instead of racial violence, these characters have fallen victim to the perils of materialism, drugs and unprotected sex, all of which are issues that disproportionately affect the black community\n\nWest performed this song,already saturated with meaning, at the VMA awards in front of a purposefully lighted and positioned backdrop of a photo by film director Steven McQueen. The photo depicts a tree in New Orleans that was the site of racially charged lynchings. It’s lit and positioned in such a way that as West performs in front of it, he appears as a shadow, his erratic movements almost resembling a man hanging from the branches. The shadows of the audience’s raised hands appear at the bottom of the frame, as if coming out of the ground, representing the scores of victims buried at sites like this across America\n\nHttp://divaartist.com/divablog/wp-content/uploads/2013/08/Screenshot_2013-08-26-00-20-13_1.jpg\n\nAfter the performance West posted a picture of the tree captioned: \"those who were murdered are buried in the ground around the tree.\"\n\nHttps://s3.amazonaws.com/rapgenius/1377548967_JKYK1ZZ.jpg\n\nThis nuanced imagery, rife with symbolism, paints a powerful and disturbing scene that adds potency to West’s message of the relics of slavery in today's society"}], "artist": "Kanye West"}