{"songs": [{"album": "K.O.D.", "image": "https://images.genius.com/de5c12836aa9b9bbb55356aafbf1fa0a.900x900x1.jpg", "year": "2009-10-26", "title": "Check Yo Temperature", "lyrics": "[Verse 1: Tech N9ne]\nI keep my temperature on 74 when I'm at the crib\nAnd 79 in the winter time that's just how I live\nBut when the homies call and say let's hit the town\nWhen we do them haters frown, nigga turn the heat down\nI know we skip the line and bitches think we fine\nI know you feelin' drunk and tough but you best recline\nYou don't wanna get stained, it's pain in this lane\nI'mma check they temperature, they all up in my mix, mayne\nWhat up, suckers, ain't no lookin' back\nI just wanna know: What you niggas lookin' at?\nI just come to kick it with the bitches, I ain't come for you\nIf you really want it, yeah my homies got a gun or two\nI take on every one of you, what you wanna do?\nDon't forget I got this whole club on my side trippin' is dumb'a you\nStop! Everybody, what's that sound?\nIt sound like a hater 'bout to get the beat down\nWith the quick and why they wanna go and get me pissed?\nWhen they know I'm with me clique and a real nigga like Mitchy Slick\nOn this Hennessy, Sprite and lemon, fuck these niggas, invite the women\nBusters wanna insight the grimin', now you gotta invite the crimin-nals\nDon't gimme that bullshit, nigga don't gimme no looks\nYou better get over the shit, a veteran knowin'  you pathetic\nAnd let 'em fuck up and hit me on kush\nSo you better snap your fingers and then rock with it\n'Cause if you chops spit it, I'mma let somethin' hot hit it\n'Bout a hundred somethin' he looked like he wanted somethin'\nRemy had him beefy now he like a honey bun or somethin'\n\n[Hook: Tech N9ne]\n(AYE!) Why they always gotta trip with you?\nI'm minding my bidness now I gotta check yo temperature\n(AYE!) Player hater man you fixin' to\nMake me lose it if you heated when I check yo temperature\n(AYE!) Now I ain't come to play games\nSo why you gotta make me check yo temperature, mayne?\n(AYE!) And I guess we all gon' bang\nIf you heated when I check yo temperature, mayne\n\n[Verse 2: Sundae]\nAh, kick it, stay, fresh, step out, in my, sunday's best\nBitches, trippin', you'll get slapped, hold up wait, what you bitches lookin' at?\nI'm callin' askin' why you askin' 'bout me, if for that liquor\nShe said 'cause she spittin' vixen in a mix of Tech N9ne and Twista\nLip singing and quick sand, flippin' bricks and gettin' chicks mad\nHundred grand they spick-and-span, with Louie V and my whip is wet\nWho is she? 'Cause I been there, who is he? He ain't a threat\nWho am I? KC Boss bitch, what you doin'? Tryin' to snap back\nA hundred degrees, I'm heated, eat it, like it was your dinner roll\nYou've never been a friend to me, bitch better check yo temperature\nRocky on rocky i'm cocky, catch a lot of bodies\nTry to knock me from my hierarchy, straight down on Kawasakis\nThese poppies like that seed that come from over seas\nWe G's living in that clipse so hard, that sundae is a superstar\nWhat the fuck you hoes staring for? Knowin' you all are some scared hoes\nMake me start a girl fight, better check this bitches' Fahrenheit\nBlowin' niggas I Be Be, see broke niggas I skeet skeet\nI'll choke your head, because see they gon' drop you like my CD\n\n[Hook]\n\n[Verse 3: T-Nutty]\nTo tell you the truth we havin' a ball, there's bitches all over the place(x2)\nThere's bitches all over the place\nWhy is you niggas all up in my face?\nI'm finna flip the script and start trippin' on them like\n(What you niggas lookin' at?)\nI think these niggas might need some glasses what they lookin' at?\nA poodle tuckin' its tail I ain't ever been mistooken for that\nPlus I can read your game plan like my book of raps\nLast nigga that tried it caught a right and then he took a nap\nSleep go night-night for fucking with niggas that fight-fight\nAnd some of you suckers be hating 'cause we shining like some bright lights\nT-Nutty your street buddy\nTech N9ne and the clique, niggas better act like they got sense\nStop looking at me and go get in a bitch\nThat nigga stretched the flex but won't flinch\nFlipped the script and my nigga bow down\nStraight from Cal with a .50 cal wow\nAsk around and they tell you blaow-blaow\nAin't nobody tripping off of you, I just wanna kick it and be cool\nHalf of these niggas up in this motherfucker wanna be part of the crew\n'Cause they know we do the fool, go dumb and act retarded\nDon't ever like to start it but you can be our target\nIf I lose it open your mouth for this thermometer\nI'm checkin' niggas' temperature then sliding off\nWith your chick and smokin' bomb with her\n\n[Hook]"}], "artist": "Tech N9ne"}