{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "The Hustle’s On", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[*police sirens*]\n\nTRU: Ahh, shit! C-Cyph…\n\nTARIQ: Yo, what’s go— what’s going on, yo?\n\nTRU: It’s— What the fuck? You know how jake be pulling a brother over ‘cause he got a fat whip!\n\nTARIQ: True…\n\nTRU: It’s aight, I got it\n\n[*officer’s footsteps*]\n\nOFFICER O’MALLEY BITCHKOWSKI: Ah! Mr. Tru! Nice to see you again. License and registration, please? As a matter of fact, uh, why don’t you step out of the vehicle and come back to my car?\n\nTRU: Why, sure, officer!\n\nTARIQ: Yo, son, you gon’ be aight?\n\nTRU: Yeah, yeah, I got it, son!\n\n[*footsteps, footsteps back, car door closes*]\n\nTRU: Ready to bounce?\n\nTARIQ: Ayo, Tru, what’s the deal?\n\nTRU: Just had to hit him off with a lil’ something! You know C-Cypher don’t fuck with me. I got ‘em locked down!\n\nTARIQ: True…\n\nTRU: But anyway, about that G? How ‘bout a lil’ moonlighting? You know what I’m saying!\n\nTARIQ: Pssh, what? Hustle like you?\n\nTRU: Yeahhhh, man!\n\nTARIQ: Nahhhh, too risky! Plus, you know Ma Dukes gon’ flip on me!\n\nTRU: C’mon, man, I got yo back! I’ll hook you up with my peeps in the East, and you be mad protected. C’mon, son! I been doing this shit for years! You know I wouldn’t put you in no fucked up predicament!\n\nTARIQ: True…\n\nTRU: Ayo, bust it. In five days, you be paid out the ass. Yo, studio money, rent money, gear, hit moms off\n\nTARIQ: No doubt, I hear that\n\nTRU: Ayo, that job we got ain’t none but some old nickel-and-dime shit. It’s just a front!\n\nTARIQ: No doubt\n\nTRU: Yo, I— I stay paid, word!\n\nTARIQ: True…\n\nTRU: Yo, you know brothers can’t fuck with the rich! Every day my income switch, bitch! Word! Man, bottom line? Is I’m your boy! Trust me!\n\nTARIQ. Aight, five days. That’s it! You know how bad I want this deal. Aight, then. Yo, when do I start?\n\nTRU: Ayo, right now!", "year": "1999-02-23"}]}