{"artist": "Phora", "songs": [{"album": "Sincerely Yours", "title": "Forgive Me Mother", "image": "https://images.genius.com/806e5111ecab1cdf6ceb69d9f637d892.500x500x1.jpg", "lyrics": "[Hook: 2Pac, Biggie Smalls, Nas]\nWhen I was young, me and my mama had beef\nForgive me for my disrespect, forgive me for my lies\nI wonder if I died, would tears come to her eyes?\nYou'd love to hear the story how the thugs live in worry\n\nWhen I was young, me and my mama had beef\nForgive me for my disrespect, forgive me for my lies\nI wonder if I died, would tears come to her eyes?\nYou'd love to hear the story how the thugs live in worry\n\n[Verse 1]\nHe had the heart of a soldier in a city full of bandits\nRan with the cold spirits, couple of bad habits\nHeart full of pain and a pipe full of magic\nGetting him high, he's feeling like he's ready to die\nBut his girl just told him she pregnant, he don't know what to do\nThe word \"Father\" was just something that he never knew\nSo hows he gonna be one\nHows he gonna raise child in a city full of demons\nWhen his mother had three sons\nAnd two of em' dead, one took two to the head\nThe other took three to the heart, he never knew what was said\nBut he knows, he's all his mother got now\nHe ain't got no feelings, they say he's numb to the pain\nHe on the corner with the Glock now\nMomma always told him he was God's son\nBut he's feeling like the Devils advocate\nRunning streets with the lost ones\nAnd he don't wanna lose touch with his soul\nBut he's feeling like he ain't got nowhere to go\nNowhere to go\n\n[Hook: 2Pac, Biggie Smalls, Nas]\nWhen I was young, me and my mama had beef\nForgive me for my disrespect, forgive me for my lies\nI wonder if I died, would tears come to her eyes?\nYou'd love to hear the story how the thugs live in worry\n\nWhen I was young, me and my mama had beef\nForgive me for my disrespect, forgive me for my lies\nI wonder if I died, would tears come to her eyes?\nYou'd love to hear the story how the thugs live in worry\n\n[Verse 2]\nHe wanted to be like Nas, Biggie and Pac\nHe used to bump em' in his uncles whip until he got shot\nThe first time he ever saw tears coming from his mother's eyes\nToo young to understand, so he just wondered why\nHe always used to ask the Lord if heaven had a ghetto\nAnd when he tries to end it all, he just can't seem to let go\nHe shed so many tears, so many times, so many lies\nAll he feels in his heart is hate, so he never cries\nHe's running with the pack like a wild coyote\nRunning the city sticking nigga's up like \"Pay what you owe me\"\nIt's just him against the world, all his homeboys turned on him\nThey plotting to get him, they asking \"What's the word on him?\"\nThey heard his mother stayed a few blocks down\nHopped in the ride, got to the house and let off some rounds\nTwenty-five shots through the window, ten through the door\nOpened his eyes and he seen his mother dead on the floor\nMother forgive me\n\n[Hook: 2Pac, Biggie Smalls, Nas]\nWhen I was young, me and my mama had beef\nForgive me for my disrespect, forgive me for my lies\nI wonder if I died, would tears come to her eyes?\nYou'd love to hear the story how the thugs live in worry\n\nWhen I was young, me and my mama had beef\nForgive me for my disrespect, forgive me for my lies\nI wonder if I died, would tears come to her eyes?\nYou'd love to hear the story how the thugs live in worry", "year": "2014-05-17"}]}