{"songs": [{"album": "Slam: The Soundtrack", "image": "https://images.genius.com/2eda58ee0adb9d194b1c6b8bf821922c.500x500x1.jpg", "year": null, "title": "I Can See", "lyrics": "[Intro: Cappadonna, (Tekitha)]\n{What's up? Where the music at?}\n'donna and Tekitha (ohhhh... ohhhhh)\nBig boys hold they weight and one shotty\n(Noo... noo...) Killa-professionals, word\nPirates (Ohhh...) Murder on TV or on the CD\nBless me, Killa Bees, RZA paint\nYo, I could see, I could see\n\n[Hook x2: Tekitha]\nI can see clear like a vision\nNo mystery to realize\nThe decision, no, no, no, no\nIs no longer in me...\n\n[Cappadonna]\nYo, I could see, yo, I could see like owls in the night\nThieves' blindness no longer exist, uplift\nBehold the life of a chemist, used to be a menace\nBut Don-Don never could form, my mind's like Anaconda\nNever sore, forever see thru over the trees\nEyes like a bird, Jay Bird, best seen and best heard\nW.T.C. never sold out for no body (no longer in me....)\n\n[Tekitha]\nTryin to rush them, swing around me\nGood an author, lies you told me\nNow I can, now I can see...\n(W.T.C., the best in the facility)\nNever raise at harmony\nNow I know I must simply release\nThat I did amd what's right\nChanged my mind...\nAnd recoginzed that only I can see me...\nAnd you can't, can't deny it\nThat the things you've done effected me...\nOhh... I can see\n\n[Hook x2]\n\n[Cappadonna]\nKnowledge come first, regardless of the hardest\nSome get trapped, some couldn't adapt\nWhen the Wu-Tang Pillage came back, it's like life\nShed life, from a dart came a whole world\nClear like a vision, I'm inside of a pearl\nWith my whole heritage, we tight like panthers\nTake chances and be the all eye seein\nDonna and Tekitha, anti-easter\nWe 3 peice suit and tie, asiatic\nSee thru the bullshit, come with the static\n\n[Tekitha]\nI can see... clearly... yea...\nMy eyes have been opened to you now\nHey.. hey (I could see you clear like a vision)\nHey.. hey... still see clearly\nI can see your ways and actions\nYou've shown me, I can see, I see\nYour ways and actions, you've shown me\nOhh... I can see\n\n[Hook to fade]"}], "artist": "Tekitha"}