{"songs": [{"lyrics": "[Intro: Action Bronson & Unknown person/Answering machine]\nYo, yo, I need a car. I have to go to the garden. I'm gonna be late. I need one right now. Can you please call La Luna?\nAlright\n(Phone ringing) Hello. You've reached La Luna Luxury Car Unlimited Services. If you need a ride to the airport call 1-800 [?] airport. Please hold\nYo, what beat is that, huh? Oh, that shit is funky, what is that? Yo, what beat is that?\nIt's from the phone\nCould rhyme on this. Oh, hell yeah, hahah, yeah\n\n[Verse 1]\nCame out the pussy wearing Timbs\nOh, my lord, it's him\nTime to put the toys back in the bin\n'Cause I'm sick of this shit\nMotherfucker sweeter than a licorice stick\nAnd it's rubbing me the wrong way to say the least\nI'ma say my piece\nAnd I'ma breeze in the caprice with the gold seats\nBumpin' Boosie on a slow creep\nOn Collins Ave looking stoned, man, you know me\nAsian shooter with the blonde hair, Street Fighter character\nFuck around and suplex 'em through the salad bar\nMy life is greenlit, no script\nAnd we all know that money be the motive for this whole shit\nBitch, I'm focused like none other, the number one Don Dada\nDrop-top, jokes on the youngster, now look at him\nLooking slim in the red '89 Testarossa with the wing\nMind blown\n\n[Interlude]\nA customer representative will be with you shortly. Did you know we can get to you in just seven minutes? Seven minutes. Call 1-800-80…\n\n[Verse 2]\nYour shit lack quality\nI'm sittin' right behind my chick makin' pottery\nMy first joint was like an odyssey\nThe second joint straight raw like the shaman's feet\nClimbed the stairs to the sun\nSacrificed myself for protection of my only son\nKeep the bloodline strong while I watch close\nTo another thousand years, here's a toast (clink)\nChampagne drippin' down the beard hair\nSupermodel sucking while I steer the long pink Fleetwood\nRoll a big fat blunt so you know I'm gonna sleep good\nNow\n\n[Outro]\n(Uh)\n(Rock-a-bye baby, yeah)\n(Rock-a-bye baby, uh-huh)", "title": "La Luna", "album": "Blue Chips 7000", "image": "https://images.genius.com/8b36a83780b8c85770c8ae21c12d19ad.1000x1000x1.jpg", "year": "2017-08-25"}], "artist": "Action Bronson"}