{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/d098075a677d44022667137d3c0db87a.320x320x1.jpg", "title": "Cactus", "year": null, "album": "Tell Ya Friends", "lyrics": "[Verse 1: Chip]\nUh, wa-wa-watch your head in my spaceship\nMe plus two cause I'm in third person (Hey, Chip!)\nFloating to another destination, resperating\nVapors coming from a volcanic eruption, roll up son\nAnd blaze up the cactus, red carpet actress\nDropping on you dingleberries who can shart with that shit\nDon't you start with that Chip\nLiterally killing fools by dropping all these syllables\nI love watching you niggas lose\nAnd me I just keep growing like a sour diesel plant\nI'm Mr. let you hold a stack and by the hour need it back\nAnd sprinkle in a little interest and since\nHad to new play 2k12 with my N's bitch\nAnd Swish! Dropping trays on you hot dog mans in the stands\nAll these rappers is is a bunch of fans; fucking Stans\nI ain't with no major but got bunch of fam, crazy fans\nAny major want my publishing, they must be crazy. Damn!\nGuess I gotta pull up to your city with the semi\nAnd a bunch of bum ol' shit to get your girls attention with\nBut, really I don't need none of that I'm really in the streets\nGot a couple O's, pullin sweets, gettin fried When I\n\n[Hook: Chip]\nWa-wa-watch your head in my spaceship\nFloating to another destination, resperating\nVapors coming from a volcanic eruption, roll up son\nBlaze up the cactus [12X]\n(Wa-watch your head in my spaceship) [2X]\nBlaze up the cactus[4X]\n(Wa-watch your head in my spaceship) [2X]\n\n[Verse 2: Chip]\nYeah, roll up the vegetables, go and pour that lean up\nChilling with your fiance no wonder you ain't seen her\nUp all night with two girls like \"fuck sleep\"\nShe got BBC (What's that) Booty Butt Cheeks (Damn)\nWe live life on the edge, ain't no fearing us\nI'm always sad but some head sure would cheer me up\nI'm in the telly with these chicks hoping I get lucky\nMe and four girls thats eight legs getting octo-pussy\nLets wrestle this money, nigga tag team\nYou gotta get it by any means what does that mean\nMany eyes watching even when you don't know\nSome genuine ally, most heartless foe\nI know, lets live the happy life and get paid people\nThe lack of money is the root to all evil (Word)\nI'm that off white UFO chilling I'm finna knock in this weed\nI gotta make the ceiling drop, so\n\n[Hook: Chip]\nWa-wa-watch your head in my spaceship\nFloating to another destination, resperating\nVapors coming from a volcanic eruption, roll up son\nBlaze up the cactus [12X]\n(Wa-watch your head in my spaceship) [2X]\nBlaze up the cactus[4X]\n(Wa-watch your head in my spaceship) [2X]"}]}