{"songs": [{"title": "Hey Ya! - Single Version", "album": "The Videos (DVD)", "year": "2003-12-16", "image": "https://images.genius.com/3e4ff7fcbf45adf3a22baa4a26a704bf.1000x1000x1.jpg", "lyrics": "[Intro: André 3000]\n1, 2, 3, uh!\n\n[Verse 1: André 3000]\nMy baby don't mess around\nBecause she loves me so, and this I know for sure (Uh)\nBut does she really wanna\nBut can't stand to see me walk out the door? (Ah)\nDon't try to fight the feeling\n'Cause the thought alone is killing me right now (Uh)\nThank God for Mom and Dad\nFor sticking to together 'cause we don't know how (C'mon)\n\n[Chorus: André 3000]\nHey ya! Hey ya!\nHey ya! Hey ya!\nHey ya! Hey ya!\nHey ya! Hey ya!\n\n[Verse 2: André 3000]\nYou think you've got it, oh, you think you've got it\nBut “got it” just don't get it 'til there's nothing at all\nWe get together, oh, we get together\nBut separate's always better when there's feelings involved\nIf what they say is “Nothing is forever”\nThen what makes, then what makes, then what makes\nThen what makes, what makes, what makes love the exception?\nSo why oh, why oh, why oh, why oh, why oh\nAre we so in denial when we know we're not happy here?\nY'all don't want to hear me, you just want to dance\n\n[Chorus: André 3000]\nHey ya! (Uh-oh) Hey ya! (Uh-oh)\nDon't want to meet your daddy\nHey ya! (Uh-oh)\nJust want you in my Caddy (Uh-oh)\nHey ya! (Uh-oh)\nDon't want to meet your mama (Uh-oh)\nHey ya! Uh-oh\nJust want to make you cumma (Uh-oh)\nHey ya! Uh-oh\nI'm, I'm, I'm, I'm just being honest (Uh-oh)\nHey ya!\nI'm just being honest\n\n[Bridge 1: André 3000]\nHey, alright now, alright now, fellas (Yeah?)\nNow, what's cooler than being cool? (Ice Cold!)\nI can't hear ya\nI say what's, what's cooler than being cool? (Ice Cold!)\nAlright, alright, alright, alright, alright, alright, alright, alright\nAlright, alright, alright, alright, alright, alright\nOkay now, ladies (Yeah?)\nNow, we gon' break this thing down in just a few seconds\nNow don't have me break this thing down for nothing\nNow I want to see y'all on your baddest behavior\nLend me some sugar, I am your neighbor\nAh, here we go!\n\n[Refrain: André 3000]\nShake it, sh-shake it, shake it, sh-shake it (Uh-oh)\nShake it, sh-shake it, Shake it, shake it, sh-shake it (Uh-oh)\nShake it like a Polaroid picture, hey ya!\nShake it, sh-shake it, shake it, sh-shake it\nShake it, shake it (okay), shake it, sugar\nShake it like a Polaroid picture\n\n[Bridge 2: André 3000]\nNow all the Beyoncés and Lucy Lius\nAnd baby dolls, get on the floor\nYou know what to do, oh, you know what to do\nYou know what to do\n\n[Chorus: André 3000]\nHey ya! (Uh-oh) Hey ya! (Uh-oh)\nHey ya! (Uh-oh) Hey ya! (Uh-oh, hey ya!)\nHey ya! (Uh-oh) Hey ya! (Oh, oh, uh-oh)\nHey ya! (Uh-oh) Hey ya! (Uh-oh)"}], "artist": "André 3000"}