{"artist": "Will Smith", "songs": [{"year": "2005-03-29", "lyrics": "[Intro]\nHe's a nice guy - how ya doin?\nHe's a nice guy - good to see ya!\nHe's a nice guy - how your mom an' 'em?\n\n[Verse 1]\nMr. Nice Guy, relationship advice guy\nLight on the vices, priceless smile\nLook at the eyes, got the look\nOf a survivor, husband, father\nDissed by Eminem but didn't bother him\nYup well he classy\nBig Will just did another 20 mill', walk right past E\nI'm a nice guy, why y'all harassin me, huh?\nOn the radio they be over-exaggeratin\nSo blase with they lies, they be aggravatin me\nAgitatin me, but they be waitin and hatin\nAnd they be makin me crazy but I be takin it patiently\nPeople be messin with me, testin me, f'n with me\nI wanna send a message to 'em, teach 'em a lesson quickly\nThey publically addressin me, disrespectin me heavily\nThey better be lucky the way my blessings affected me, but\n{*deep breath*} Calm down Willie\nYou don't wanna go drop the bomb now Willie\nKeep a nice flow for your mom down in Philly\nOn the news you go if you blow and act silly, y'know?\n\n[Hook]\nHe's a nice guy - how ya doin?\nHe's a nice guy - good to see ya!\nHe's a nice guy - sometimes y'all\nMistake nice for soft, so I before I go off I just\n\n[Will Smith]\nRAH RAH RAH RAH RAH RAH RAH RAH\n\n[Verse 2]\nWill's a nice guy, why he's so nice I'd\nLet him date my daughter like he was a white guy\nNot like the rest, he's a private flight guy\nWhy, if I were gay on Friday night I'd...\nLarry Elder - Uncle Tom?\nYou're lucky I ain't make you the whole damn rhyme\nWendy Williams, you don't know me\nI'm not your punchin bag, you gon' blow me\nOff, girl, better leave me alone\nBefore I buy your radio station and send you home\nYo, it's a warnin shot over the bow\nTruth be told, this ain't my style\nYou gotta understand some stuff a man can't allow\nYou better chill 'fore you climb a tree you can't get down\nOkay - people dissing Will sat on a wall\nPeople dissing Will had a great fall\nAll the king's horses and all the king's men\nCouldn't put none of their careers together again\nYou get it?\n\n[Hook]\nHe's a nice guy - how ya doin?\nHe's a nice guy - good to see ya!\nHe's a nice guy - sometimes y'all\nMistake nice for soft, so I before I go off I just\nHe's a nice guy - how ya doin?\nHe's a nice guy - good to see ya!\nHe's a nice guy - sometimes y'all\nMistake nice for soft, so I before I go off I just\n\n[Outro]\nRAH RAH RAH RAH RAH RAH RAH RAH", "image": "https://images.genius.com/b6862accc0e70d12f7d4a50c2aee85da.1000x1000x1.jpg", "album": "Lost and Found", "title": "Mr. Niceguy"}]}