{"artist": "Cardi B", "songs": [{"title": "Press", "album": "Tiger Woods", "year": "2019-05-31", "image": "https://images.genius.com/7d65c78b1024461b607b96b4806b69f2.1000x1000x1.jpg", "lyrics": "[Intro]\nMonsta's gon' tear it up\nBardi\nWoo, yeah\nBitches be pressed (Woo)\nBitches be pressed (Pressed)\nWoo, yeah, yeah, woo\n\n[Verse 1]\nBitches be pressed (Pressed)\nThey knew how I'm coming, real bitch in the flesh (Woo)\nWho the fuck she gon' check? (Who?)\nShe be talking that shit, talkin' out of her neck (Brr)\nPut blood on her dress (Woo)\nBitches be mad when they see Cardi step in the spot (Woah)\nSaid that you 'bout it, we know that you not\nI'ma pull up on bitches as soon as I drop\nBought a new foreign, I might cop a yacht (Skrrt)\nBitches in my business, they tryna plot (Woo)\nHoes poppin' shit like they hot but they not (No)\nJust flooded the wrist, the Patek, the watch (Woah)\nNiggas be flexing, we know what you got\nCardi done had got the game in a knot\nFuckin' your nigga, I got him on lock\nThis go bang bang like I'm choppin' them chops\nVVS chain, I'm in love with the rocks (Woah)\nYou said you gon' take it, bitch, you got me chopped (Woah)\nThey throwin' shade 'cause they see me on top\nTell that bitch to pull up, I'ma send you the drop\n\n[Chorus]\nPress, press, press, press, press\nCardi don't need more press\nKill 'em all, put them hoes to rest\nWalk in, bulletproof vest\nPlease tell me who she gon' check\nMurder scene, Cardi made a mess\nPop up, guess who, bitch?\nPop up, guess who, bitch?\n\n[Verse 2]\nDing dong\nMust be that whip that I ordered\nAnd a new crib for my daughter\nYou know a bad bitch gon' spoil her\nGot one in New York, need one in Georgia (Yeah)\nNew Bentley truck cost a quarter (Quarter)\nMy money still long like weave (Woo)\nPussy still wet like Florida (Woo)\nEveryone drop on the floor\nShe was talkin' but not anymore (No)\nMAC to your face like contour (Brr)\nThis chopper come straight from Dior\nDone with the talkin', I'm open to violence\nAsk anybody, they know I'm about it\nHashtag whip that ho ass\nFuck around, we gon' start a new challenge (Woo)\nI come in this bitch and I'm strapped up and ready\nRidin' that dick like I'm Cardi Andretti\nFuck at your crib, we don't go to no 'telly\nI sit on his face whenever I'm ready (Woo)\nBitch I'm a freak like Greek (Like Greek)\nGot the biggest house on my street (My street)\nAll you little hoes look cheap (Look cheap)\nThey suckin' on my dick with no teeth\n\n[Chorus]\nPress, press, press, press, press\nCardi don't need more press\nKill 'em all, put them hoes to rest\nWalk in, bulletproof vest\nPlease tell me who she gon' check\nMurder scene, Cardi made a mess\nPop up, guess who, bitch?\nPop up, guess who, bitch?\n\n[Outro]\nPress, press, press, press\nPress, press, press, press\nPress, press, press, press\nPop up, guess who, bitch?\nPop up, guess who, bitch?"}]}