{"songs": [{"year": "2019-07-12", "image": "https://images.genius.com/b3ca34e630840f075584e97e1dbfae6f.1000x1000x1.jpg", "title": "Blue Flame Ballet", "album": "K.R.I.T. IZ HERE", "lyrics": "[Intro: Rolynne Anderson]\nFly\n\n[Chorus: Rolynne Anderson]\nI saw ballet at the strip club\nSat and watched the whole play at the strip club\nI'm talkin' shows on Broadway at the strip club\nI saw ballet at the strip club\n\n[Verse 1: Big K.R.I.T.]\nYeah\nUnder light, she shinin'\nThrough the smoke and mirrors, I could see a diamond\nThis is art\nHangin' from the rafters like a jersey in Toronto\nShe was used to gymnastics or run track\nShe said she used to do both\nShe volleyballed all through college, now she just ball off the coke\nIt came in handy, she demand it, 'cause the techniques never vanish\nShe just stretch it, then she prep it, when she come down, perfect landing\nApplause\nI gave her a ten on my scorecard\nShe make that shit look so easy, but that shit hard\nHad me lookin' around, like, \"Oh my God, did you see that?\"\nCan't believe that she in here when she could star\nOn the Olympic team, nutcracker on Christmas Eve\nNYC, London, all way to Paris\nRoyal ballet on they ass\nMake a nigga rock some cufflinks and a tux while throwin' cash\n\n[Chorus: Rolynne Anderson]\nI saw ballet at the strip club\nSat and watched the whole play at the strip club\nI'm talkin' shows on Broadway at the strip club\nI saw ballet at the strip club\nI saw ballet at the strip club\nSat and watched the whole play at the strip club\nI'm talkin' shows on Broadway (Fly), at the strip club\nI saw ballet at the strip club\nFly\n\n[Verse 2: Big K.R.I.T.]\nYeah, yeah, yeah\nI feel like I should've brought a trophy\nOr a judges' table just so I could sit down and get noticed\n'Bout your backbends and you snatchin' off your heels\nAnd those tattoos of those flowers on your side, it look so real\nHow it feel\nTo win 'em off the dances? So prestigious with your mantle\nWhen you tippy-toe, you far from \"Tip Drill\"\nYou got skills\nYeah, I thought that you'd be ratchet, but you classic with your stance when you still\nWhy you here?\nI'm just sayin', you might wanna go on Dancing with the Stars and sign a deal\nYou would kill\nMake a nigga rock some cufflinks and tux while throwin' dollar bills\n\n[Chorus: Rolynne Anderson]\nI saw ballet at the strip club\nSat and watched the whole play at the strip club\nI'm talkin' shows on Broadway at the strip club\nI saw ballet at the strip club\nFly\n\n[Outro]\nOh\nAt the strip club\nOh, oh, oh, oh\nTake it easy"}], "artist": "Big K.R.I.T."}