{"artist": "ZelooperZ", "songs": [{"year": null, "album": "Coon N The Room", "title": "Tunk", "image": "https://images.genius.com/33eef4e459a769730be55158ee218523.500x500x1.jpg", "lyrics": "[Intro]\nIf I lie, I die\n\n[Hook 1]\n? hustle was the realest nigga never know\nBut it's not what you know it's who you know\nMy uncle said, never chase the hoes\nChase the dough; the money bring the hoes\nMy mama said yo friends not yo friends\nYo bros yo bros they gon' roll in the end\nIt's not what you know it's who you know\nThis the realest shit I ever quote\n\n[Verse 1]\nI keep it realer, my mama is a gold digger\nShe just got stuck with a broke nigga\nAnd I just got with a so-called dad\nWho got stuck with a son he wish he never had\nWalkin in the crib with skinny jeans, they call me fag\nNow I'm in them Gucci loafers stuntin' on his ass\nI should laugh, like why you mad?\nShould I bust this nut, in the fuckin' mag\n? ? ? ? ? ? ? ? I get more head than no bodies\nNever had shit since the days of whitey tighties\nMy twelth grade year, I was floodin' like tsunamis\nBut I still got love cause they seen a nigga grindin'\nLet me simulate this picture worth paintin'\nThey try to leave these young niggas stankin'\nSlaves was first people plankin'\nLife's a bitch, no matter how you take it\n\n[Hook 2]\nTunk was the realest nigga I never know\nBut it's not what you know it's who you know\nMy uncle said never chase these hoes\nChase the money, the money bring the hoes\nMy mama said yo friends not yo friends\nYo bros yo bros they gon' roll in the end\nIt's not what you know it's who you know\nBoy, this the realest shit you ever quote\n\n[Verse 2]\nWhy lie, just to keep hope alive?\nDon't know who my dad is, you think Imma cry?\nIF the good die young do the bad die?\nIf I say it once do my ass fry?\nHope not, cause this life we livin' is so hard knock\nPolice invade yo home, after some hard knocks\n80's fucked us up after that hard rock\nThese niggas bucked up, they call it Woodstcok\nNo fear, no belief\nI shed so many tears I could fill a sink\nNo God, no relief\nLove run deep, share it with me\nCause Imma die one day\nHope it's on Monday cause Jesus rolls on a Sunday\nI feel like every day is judgement day\nHell is my dream, Imma wake up one day\n\n[Outro]\nMy life was ill, hard to get a meal\nBut when I got a meal, still searchin' for a mil\nMoms told I was gon' make it, only came to one of my shows\nHusband not really my dad, so I don't expect much mo'\nBut til 3 months ago, I didn't know that shit\nI'm 'bout to have a Kanye moment in this bitch\n18 years. 18 years, I'm 18 years old and my real dad long gone?\nRIP Tunk, the realest nigga I never know\nCause he passed away, before I got grown\nThat's my grandpa, they say I got his looks\nNamed after him, that's probably why I'm overlooked\nSo it gotta be somebody prayin' for me\nCause I done had crackheads stayin' with me\nHavin to sleep on the boxspring, windbreaker in the winter nigga it is not spring\nHavin' to put on clothes when I know they not clean\nHavin' to empty out a toilet when I gotta pee\nHavin' to put on a coat when I gotta sleep\nWakin' out my fuckin' sleep, cause my momma gettin beat\nBut shit, this just real life scenarios\nGettin' jumped at the bus stop, headed to the studio\nMy nigga Cari know, man these niggas slow\nDay after day, I go through this shit\nSkinny nigga; they say I'm unfit\nThey shot my uncle until he looked like Emmett Till\nThis can't be life, this can't be real\nThey hate behind yo back\nI know they place they bets\nCan't tell if you bein sarcastic when you tell me to break a leg\nThese niggas bitches\nTalkin' bout they bustin' lead\nNigga, you wouldn't even break a leg\nStupid\nI wouldn't either, why lie nigga\nI wanna go to heaven, when I die nigga\nSo god, please forgive me for my sins\nI was just brought in this world\nI don't even know how this shit gon' end\nThat's just real shit"}]}