{"songs": [{"year": null, "album": "Get Well Soon...", "image": "https://images.genius.com/96319570be9d2165984a99be5ecf2edf.500x500x1.jpg", "title": "A Million and One Freestyle", "lyrics": "[Intro: Kanye West]\nYeah\nIt's (a million)\n\n[Hook: Kanye West]\nI freestyle battle niggas for (a million)\nHow many niggas bit the soul? 'Bout (a million)\nHow many hoes did I bone? 'Bout (a million)\nUh-uh, uh-uh, it's (a million), uh-uh\nThere's (a million) ways to die, choose one\n(A million)\n\n[Verse 1: Kanye West]\nLot of people askin' 'bout the money I made, even Just Blaze\nHow are they for real, is them niggas really paid?\nRappers I met or dealt with direct\nIs it true he won't send a beat tape until he get a check?\nWhat's the position you hold?\nCan you really match the Neptunes, check\nBy check if \"H to the Izzo\" is the only single that went gold?\nIf Roc-a-Fella shit fold and you move back to the 'Go\nIs it back to ghost producer for D. Dot on the low?\nFor the millionth time askin' me\nQuestions like Toni Braxton, harassing me\nLike you don't care about my son's feelings?\nCan I get a minute, you wack bitch? I ain't gotta jack shit\nYou heard \"Takeover\", who running this rap shit?\nUgh, fake tits, shut up and make hits\nCan't we all just get along, spread love like Take 6?\nWhat, you doin' beats in LA for Eminem and Dr. Dre?\nThem niggas sold ten mill, I'm trying to get paid\nWe do this shit for entertainment\nBring guns to the arraignment\nWhile the judge in the chamber\nLet one up out the chamber, BLAOW!\n\n[Hook: Kanye West]\nHow many years did I wait? About (a million)\nHow many niggas tryin' to hate? About (a million)\nBut when a nigga count his cake, it's 'bout (a million)\n\n[Verse 2: Kanye West]\n'04, College Dropout, I make the game different\nI don't know what the hell y'all niggas been sniffin'\n'Ye still flicking, hoes is my addiction\nFive days out the week, you'll find me in the kitchen\nSmashing the game, nigga, unlike you\n'Cause these beats change the game and the hook's right too\nI'm a crook like you\nCats back in the Chi was buying tracks for dirt cheap\nMan, what could I do?\nKnowing I supposed to style, I'm the fly boy poster child\n'Bout to be on Oprah now\nIt's ironic and whatnot how I put no ice on the Bulgari watch\nJust to make it hot\nNow you see me on stages, my hit resumes is two pages\nFor them niggas who played us\nFeet just raises, booming like Master Aces\n\"Stand Up\", number one, and there's more to come\nAll I got for hoes is hard dick and bubble gum\nWhile y'all brick like Fred, Barney Rubble and them\nChi-Town in this bitch, what's fucking with them?\nNot a damn thing, nigga, we doing our damn thing, BLAOW!\n(A million)"}], "artist": "Kanye West"}