{"songs": [{"album": "Grand Theft Auto IV Soundtrack", "image": "https://images.genius.com/432417c737cde8ee6bf2ad847ca38a42.594x600x1.jpg", "year": null, "title": "It’s Yours", "lyrics": "[Produced by Rick Rubin]\n\n[Intro]\nCommentating, illustrating\nDescription giving, adjective expert\nAnalyzing, surmising, musical\nMyth-seeking people of the universe, this is yours!\n\n[Chorus]\nIt's yours! Do you like it? (Yeah!) Do you want it? (Yeah!)\nWell if you had it, would you flaunt it? (Hell yeah!) Well it's yours!\n\n[Verse 1]\nTaking a record that's already made\nWith the help of a mix board using the cross-fade\nRhythm can be kept to a self-choice pace\nDepending on moment or depth of bass\nI don't really know, but somebody said\nSome musical rhythms can mess with your head\nI don't know – if it's true\nI leave it up to you – it's yours!\n\n[Verse 2]\nSound plus rhythm done up with finesse\nIs equivalent to the adjective “best”\nNow it's time to introduce\nNeo-rhymes combined with a group with juice\nDance - to the musical tune\nOn the microphone, gonna make you swoon\nT L-A R-O-C-K\nUsually the reason for a very nice day\nI came here to represent the ultimate act\nWhich only occurs when the party is packed\nSo full of endurance, for your insurance\nEverything’s fixed, just listen to the mix\n\n[Chorus]\nIt's yours! Breakdown!\nBack to the beat! DJ Jazzy Jay!\n\n[Verse 3]\nCommon talk deserves to walk, the situation’s changed\nEverything said from now on has to be prearranged\nDefinitely, you will agree, just let your mind be free\nRelax yourselves, do your dance, this is the place to be, listen\n\n[Chorus]\nIt's yours!\n\n[Verse 4]\nComputer programmed with just one finger\nMade complete for the chosen singer\nOnce lyrics are finished, the picture is done\nThe difference is this picture has no sun\nBut there's plenty of bright, kaleidoscope light\nNo color supersedes cause the balance is right\nListeners are pleased cause anxiety is freezed\nAnd can only be thawed when the music is ignored\n\n[Chorus]\nIt's yours!"}], "artist": "T La Rock & Jazzy Jay"}