{"artist": "BONES", "songs": [{"album": "TheManInTheRadiator", "title": "BluntGutSonata", "year": "2018-11-01", "lyrics": "[Verse 1]\nBefore the sun rise I am\nAlready up and at 'em it’s the corpse with a plan\nManual labor I got the world in my hands\nThey see me out in public hit me with the audible glance\nTwo left legs, do not invite me to dance\n'Cuz I will cut the rug up and go rob your advance\nY'all so typical with your obvious rants\nMe I stay unorthodox that’s how I enhance\nThe life I'm livin' now wasn't possible then\nStill I picked my little dreams up took 'em and ran\nSmall town too small for me to advance\nTook 'em to the extreme I saw the limit and passed\nNow I'm on the dash runnin' away from my past\nFrom a place where nobody pitched in for the gas\nNo words of encouragement had to give ’em to myself\nTalkin’ in the mirror like you'll have to do it yourself\nWhen I did, cold shoulders got so frozen\nMisterTenBelow drop ’em all in the ocean\nChange my phone number so now they all holdin'\nI knew they'd come around pussies always foldin'\nAskin’ how I did it hit 'em with the \"I don't know\" shit\nEverybody has their preconceived notions\n'bout the dead man 'fore words are even spoken\nHopeless, don't involve me in your showbiz, bitch\n\n[Verse 2]\nWho do it better I'm fed up I got the medicine\nFor those seekin', asylum I'm bout to let you in\nDropped out at 15, what the fuck's a letterman?\nDo not ask me shit about graduation day\nI just do this shit that you see when dreams flashin'\nAt the international terminal checkin' bags in\nLong flight to Moscow, wake me when we land\nShit, my lady, my brother, 14 hours and then we landin'\nSpasibo to the real fans, just know you got me this far\nI short circuit press to talk, just like a discord\nI'm a flashdrive with a hundred billion terabytes\nNever runnin' out of shit that's why they runnin' for their life\nLights out for any competition, though\nYet to see one, though, within my peripheral\nHold on, here we go, send 'em off, cheerio\nGood day, chaps and now relax I am imperial\nFeet up just like a king should\nWho the fuck else done as much as I done?\n\"Lord Bones, do you ever take a break?\"\nEvery day's a vacation, where you become the wave\n\n[Outro]\nWhat?\nSESH, Bones", "image": "https://images.genius.com/53c1a643679f1960eec8f434e246657d.499x499x1.jpg"}]}