{"songs": [{"title": "Gangsta Of The Year", "lyrics": "[Hook: Yo Gotti]\nIt's a new year, I can think clear\n$1000 shades, I can see clear\nEuropean made, motor in the rear\nGettin' the phone tapped, Feds gettin' near\nNear, near, Feds on a sweep\nShut the trap down, moved it down the street\nKush super strong, Jakes took the pier\nI'm multi-nominated, Gangsta of the Year\nYear, year, Gangsta of the Year\nMulti-nominated, Gangsta of the Year\nYear, year, Gangsta of the Year\nYear, year, Gangsta of the Year\n\n[Verse 1: Yo Gotti]\nAll I rock is white, bitch, I'm cocaine crazy\nFirst check I cashed was like a half of mill' from Baby\nLove for my homies, don't give a damn 'bout a lady\n125 grams, that's four and a baby\n20 cent 50, shooters coming with me\nBody hit the ground and your soul be uplifted\nBeat break down, them racks add up\nAnd all these haters actin' mad at us\nGangsta of the Year, and I don't want a trophy\nI just want these fuck niggas to pay me what they owe me\nGangsta of the Year and I don't mean to brag\nBut the title with the tags is 200 on the dash\n\n[Hook]\n\n[Verse 2: Jeezy]\nGangsta of the world, know I'm nominated\nBring it home every year, my own mama hate it\nTwelve hundred on my face, velour, Versace shots\nI left my filling on her face, yeah that Versace top\nI'm the last man standing, bitch, I need a trophy\nSo much bread in my pocket, bitch, I'm feeling toasty\nHeard them snitch niggas singing, yeah, that karaoke\nDon't fuck with police-ass niggas, bitch, don't even approach me\nDon't you niggas know you can't stop a moving train?\nLook at me now, getting paper, still moving, mane\nShip it up in your face just like Benihana\nTold that bitch she make it back, I'll buy the bitch a Honda\nAnd I ain't see 'em move shit, call me Jeezy Wonder\nIf ain't nobody vouching for him, that make Jeezy wonder\nGangsta of the Year, human chandelier\nWould tell you, feel my pain, you might shed a tear\n\n[Hook]\n\n[Verse 3 : Jadakiss]\nYo - I'm really in the 'hood, all they do is pass through\nSo hands down I've been a winner for the past few\nI got the work to prove it and I got the cash, too\nA couple niggas still breathing, guess they passed due\nThat ain't no surprise, sitting on these pies\nLB, millionaires, sitting on his eyes\nWe at the table sipping red and we puffing Cubans\nI done made a bunch of bread with a couple Cubans\nYeah, you got a bunch of guns but you never use 'em\nEverybody get a run, is you win or losing?\nShut the trap down - nothing moving\nGangsta of the Year 'til they nominate a new one (what's up?)\n\n[Hook]", "album": "Who You Mad At? Me Or Yourself?", "year": "2013-04-18", "image": "https://images.genius.com/43cf4f7fb829f88b270853d2534b8f0f.1000x1000x1.jpg"}], "artist": "Yo Gotti"}