{"songs": [{"title": "Orjazzmic", "image": "https://images.genius.com/f4f3c6f692c6f2761ee246e4d88da1a0.500x500x1.jpg", "lyrics": "[Verse 1: brandUn DeShay]\nShe said, \"I wouldn't kiss you even if you was the last man on Earth\"\nBut what if I was the first?\nWhat if the ones that you had in the past was really your worst and I was your best?\nTell me, how could you rest?\nI'm sorry, I had to get that off of my chest\nIt just kills me to know you deserve much better\nDon't mean to sound harsh, but I was taught\nWhen you see a girl you want, then you need to go get her\nI got your attention, that's half of the battle\nI know you're feeling me, I can tell like a tattle\nAnd honestly, it don't really matter to me\nThat your ass fat 'cause, girl, you look bad in jeans\nPassionately, I love it with a passion\nBut I still love you, even without the fashion\nYou ain't high class, but you so high fashion and that's it\nThe reason why you got me, you got it\n\n[Chorus]\nUh, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, for us\n\n[Verse 2: brandUn DeShay]\nDamn, girl\nEverything I need, girl, you got it\nYou got hips and you got tits\nYou got wits and you got steez\nBut most importantly, you got me\nYou got me going and I don't know when I might stop\nI'm trying to see where this can go when the lights off (turn the lights off)\nI already got enough money in my pockets\nSo work, I be taking off like a rocket\nAnd we could stick together like pocky and ride to the beach\nDrowning in an ocean of sheets back at the crib\nYou can see the pad where I live\nDon't pay me no mind while I admire your lips\nThe more you give for me, the higher you get\nI ain't dope, I'm more like the high that you get\nWe could put my tape in and rewind it\nI'll never let your head hit the bed without my hand behind it\n\n[Chorus]\nUh, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, for us\n\n[Verse 3: brandUn DeShay]\nWe got about an hour to get intimate, an hour to get into it\nAn hour to get out of it before we get grounded, heh\nI can hear the leaves whisper in the trees\nEverybody's got a secret, but they're keeping it from me\nBut maybe I'm the secret and they're keeping me from thee\nI'm the best kept secret, but the whole world peeping\nI know that you can see it in my eyes, I see me in yours\nCan you feel my heart? I see me in yours\nAccess grant you whatever you wish for, it's yours\nI'm a lamp in the sand, boo\nI'll on-demand you, learn to turn you on\nIt's a lot more fun without using the manual\nI know it ain't much that I can't do, it's you\nFor doing can't do's, I can do it for you. for you\nFor real\n\n[Chorus]\nUh, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, for us\nUh, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, its not the end, um\nUm, for us", "year": "2010-05-25", "album": "Volume: Three! To Get Ready"}], "artist": "Ace Hashimoto"}