{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/21af1b75150287897aef54312f0bc97a.500x500x1.jpg", "title": "Sing For The Dead", "year": "2010-07-13", "album": "Xerxes the God-King!", "lyrics": "[Intro]\nRise children\nRise children!\nRISE!\n\n[Verse 1]\nYou got lions and tigers that hiding inside of this jungle, they are asleep\nI think that it's time that we find and invite these animals to a feast\nThey tummies are hungry, they hold me, they know me, but what do I have to eat?\nWell it's something so sick and the wickedest, bet you this shit'll give you the creeps\nThe horrorcore king, you don't believe\nKnock on your door, kill everything\nWife on the floor, bitch don't you scream\nYou know you want more, give me your spleen\nNow watch me eat it, shit it, and pee it, eat it again\nYou seen it, even thinking bout puking, dryheaving\nHe can't believe it, he bout to see it again\n\n[Hook](X2)\nSing for the dead\nSing for the dead!\nNow wake em up\nRaise em up!\n\n[Verse 2]\nNow whether your smoking, or whether your drinking\nArms are broken, severed and bleeding\nYou stay martian, at all costs and if you shall fall in They stuck with ya'll winning\nYou don't ever see another night and day, just know you'll die rocking\nThats the only way, for a juggalo to know\nRaise your horns up, even if your dead, face ripped and torn up\nJump out your brains and catch the horrorshow\nKing Gordy's on he's testing to grow\nWith Strange and Psychopathic rolled into one\nKeep telling Potluck to roll another one\nOne Ton, Suburban Noize heard ya boy\nThey love me\nThe rockstar life is lovely\nTo all my kids that keep their hair braided, drug related and they faces painted\nYo!\n\n[Hook](X2)\n\n[Verse 3]\nYour filled up with hate, no one can relate, you live in eternal hell\nCan't wait til you waste, your family's fate, they grin only for themselves\nYour funeral's boring, now they are snoring, only time will tell\nWhen my soul will leave, so I can see King Gordy rocking well\nI'll cheer and I'll scream, jump off the stage\nSing all the songs, I'm in a daze\nHitting the bong, blunts to blaze\nWatch him go hard, look at his face\nHe entertains, he is Cobain\nHe is insane, he is in space\nOut of this galaxy Gordy straight laughing and actually man he's a natural catastrophe\n\n[Hook]"}]}