{"artist": "Watsky", "songs": [{"year": "2009-10-14", "lyrics": "[Verse 1: Watsky]\nSpun a web of lies, took notes from Charlotte\nThrow a red herring, paint the White House scarlet\nPennsylvania Ave was the last red carpet\nThen Bush relapsed like a rehab starlet\nI feel carsick\nStop the Paris Hilton carousel\nHot as hell and smells like kerosene and caramel\nAmerica's flaring and we're carrying parasols\nParanoid of terror cells, parents scared of aerosols\nSaid if you care at all, fight for the ones who fall\nFight for the ones who can't, fight for the one for the all\nAnd fight for the ones who rep, and fight for the one percent\nAt the bottom against the one-two-one-two step for the ones who come correct\nI don't wanna sit back with a Big Mac and a rack of natty ice\nSix pack on my lap, skinemax on blast, sticking to the facts of life (Right)\nSaid if you're taller better follow who you're steppin' on\nCause I'll be brawling like the fightin' Irish leprechaun\n\n[Chorus]\nTill the roof comes off, till the lights go out\nTill my legs give out, can’t shut my mouth\nTill the smoke clears out - am I high? Perhaps\nI'ma rip this shit till my bone collapse\nTill the roof comes off, till the lights go out\nTill my legs give out, can’t shut my mouth\nTill the smoke clears out - am I high? Perhaps\nI'ma rip this shit till my bone collapse\n\n[Verse 2: Dahlak Brathwaite]\nSince I was little I’ve been fiddling with the riddle\nFocus like folks addicted to Ritalin craftin' it with no chisel\nYou soft as Malcolm in the Middle\nI’m strong as the Nation of Islam with Malcolm in the Middle\nUh Izza, Uh Izza, can you save them\nPlayful like skittles or that little minstrel delicious was kissing like a switch\nSwitch it up like a schizo\nPretty motherfucker would get ugly like Gizmo\nIt’s okay maybe it’s not your day\nI’m a winner couldn’t even get beat by Dr. Dre\nI couldn’t even get beat if I was your slave (Yay)\nI got [?]\nMy designer clothes look like [?]\nAngry like sin case thoughts once his chains unlocked\nAnd this is why I’m hot\nBut not in that M.I.M.S sort of way\nMore like you better get him sort of way\nCause until I kill Bill he won’t put his sword away\nBeen a professor like you got your tenure today\nGot my vendetta to settle I ain’t settlin' for close\nWhen it comes to wantin' change I’m as unsettled as Mos\nSpittin' live from the boondocks\nWith my boombox\nSittin' on my soap box\nSpittin' got my folks locked\nThey patiently waiting for me to give em' some of freedom fighter\nKind like Huey Freeman of 21\n\n[Chorus]\nTill the roof comes off, till the lights go out\nTill my legs give out, can’t shut my mouth\nTill the smoke clears out - am I high? Perhaps\nI'ma rip this shit till my bone collapse\nTill the roof comes off, till the lights go out\nTill my legs give out, can’t shut my mouth\nTill the smoke clears out - am I high? Perhaps\nI'ma rip this shit till my bone collapse\n\n[Verse 3: Watsky]\nI don't need a chart to see that I look hard to me\nThere's no Chardonay pumping through my arteries\nAnd my heart’ll say I should take the harder way\nIf I got a part to play, I won’t make it Bartleby\nAt least this Starter T is feeling like an armor piece\nIt's guarding me like it’s righteous artistry\nSo far to lead us to inagaddadavida\nTo seeking god in your freedom\nTo God I gotta lead a vida bonita\nCause see to lead a beautiful life\nIs more than eating, sleeping, and meeting suitable wife\nYou gotta fight\nWhile luda’s throwing bows in A-town\nI’ll be throwing blows like little children on the playground\nYou should know the bay, we're seeming sorta tame\nBut we can go insane\nAnd if you’re on lower plane like when a boeing lands\nMy fist detaches at the wrist, so I’ll be throwing hands\n\n[Chorus]\nTill the roof comes off, till the lights go out\nTill my legs give out, can’t shut my mouth\nTill the smoke clears out - am I high? Perhaps\nI'ma rip this shit till my bone collapse\nTill the roof comes off, till the lights go out\nTill my legs give out, can’t shut my mouth\nTill the smoke clears out - am I high? Perhaps\nI'ma rip this shit till my bone collapse", "image": "https://images.genius.com/3433966a73a598eca7e6120b7f0cbab3.1000x1000x1.jpg", "album": "Guilty Pleasures", "title": "Fight! Fight! Fight!"}]}