{"artist": "Casey Veggies", "songs": [{"title": "Encore", "album": "Customized  Greatly Vol. 1", "year": null, "image": "https://images.genius.com/dd17019850fcbc3859bfd737bd599ed8.500x500x1.jpg", "lyrics": "[Intro]\nYeah\nI don't think they ready man\n(Customized Greatly)\nWe gon' do it like this\n\n[Verse 1: Casey Veggies]\nI'm tired of fake teachers cause life is real\nAsk some niggas how many mics I kill\nThe [?] the feel\nCustomized Greatly man I like the meals\nStayed in now, I'ma become more\nDidn't do hooks but I needed the encore\nI'm about my cheese [?]\nSean handed me the bars of professional class\nFell asleep in class and lectures pass\nBut it was a bunch of shit I already knew\nHeard another rap song, now I'm ahead of you\nI've been custom, you niggas so basic\nSo I had to [?] just to chase it\nCasey Veggies put a little  hot sauce on it for y'all to taste it\nDon't you crave it? Yeah you might get it for free\nSean told me I was Vitamin C\nYoung nigga flow man, he's about to [?]\nI don't know how to act, I'm too real\nIt's me, I don't care how you feel\nAnd the legacy has just begun\nKRS, I'm number one\nI'm God's son, it's just some fun\nKill y'all niggas on this lyrical shit\n[?] we got miracle chicks, yeah\n\n[Interlude: Jsean]\nThis nigga coulda gave me some kind of introduction or something\nDo I even got to say my name anymore?\nWell, I would like to present to some and introduce to others\nThat nigga that's bad than a mother\n\n[Verse 2: Jsean]\nCan I get an encore if you don't want more\nI'ma spit this raw til you get each bar\nI don't care less if you guys don't feel me\nI'ma keep spitting til you get some feeling\nNow motherfuckers put your hands to the ceiling\nTo the ceiling, to the ceiling\nI came, I saw, I conquered\n[?] at the sold out concert\nEven though my songs skip a beat, Jsean didn't skip a beat\nI need no beat, that's all [?]\nI was just sick til heal me\nFucking with that white bitch, tried to [?] me\nSpitting all this, y'all still don't feel me\nWhy? Cause I'm not Pac? I am hip-hop\nAnd I am not dead, I am 2Pac\n(They not gon' catch that, I got to dumb it down)\nThey said Pac was alive, he was living in Cuba\nI'm just comparing hip-hop to that rumor\nIf you ain't alive, you can't have no future\nBut I see my future, it's looking kind of bright\nAt night time with the lights off\nIt's so bright that you could leave the lights off\nEvery rapper want a chain and shine\nBut I something different in mind\nEvery rapper want a chain and shine\nBut I got something different in mind\n(What the hell are you waiting for?)\nAfter Casey's verse, it was me, me, me\n(What the hell are you waiting for?)\nBut after me, there will be no more, more, more\nWhat the hell are you waiting for?"}]}