{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "The Hegelian Dialectic (The Book of Revelation)", "title": "No Religion", "image": "https://images.genius.com/b22dd2158bc588f2bd24f8844f87f648.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, that's right!\n\n[Verse 1]\nMy raps scare the fuck outta people, but I'm just misunderstood\nBut if you were to listen real good\nThen you wouldn't mistake me for being crazy\nYou would learn to love and appreciate me\nNow! hear me clearly\nThe reason I am how the I am, they don't scare me\nI'm not under the spell, I'm not trapped in the cycle\nThey can't pull the wool\nOver my eyes, I see the truth\nFor all of our lives, we've been lied to\nAnd I know, it's hard to accept\nSo we drink away the pain and party to death\nHave so much sex, smoke so much weed\nWe just wanna have fun, we don't wanna think\nWe just wanna make dollars, we don't wanna make sense\nWe don't wanna pay attention, we just wanna pay the rent\n\n[Chorus]\nYoung niggas that blast for me, no religion\nYoung niggas that blast for me, no religion\nYoung niggas that blast for me, no religion\nYoung niggas that blast for me, no religion\n\n[Verse 2]\nI don't wanna hear about your spiritual epiphanies G's\nI'm not a role model, I just care about what make me\nMore money and celebrity power\nMore sex, drugs and fame, a star for my fame\nOn that L.A. sidewalk, that's how you want me to be ain't it?\n'Cause when I do good you hate it\nBit when I'm evil and reckless you love it\nFanatics, y'all a bunch a sick motherfuckers\nYou need to grow up and open your minds\nI put truth in the song, but you want lies\nI put real in rap music, but you want fake\nBy the time you understand me it'll be too late\nYou're so caught up in fantasy land, you're so under the spell\nI wish you luck, I wish you well\nReal men drink water\nWe stay with our women, and raise our daughters\nAnd our little men too\nAnd teach them the things they won't teach 'em in school\nLike ancient Black history and how to survive in these modern times\nIt's no games bein' played, no kiddin' no bullshittin' and, nigga\nIt's no games bein' played, no kiddin' no bullshittin' and\nNo religion\n\n[Chorus]\nYoung niggas that blast for me, no religion\nYoung niggas that blast for me, no religion\n(Ooh rev ain't right)\nYoung niggas that blast for me, no religion\nYoung niggas that blast for me, no religion\n\n[Outro]\nThose who have understood this have manipulated people for centuries and deep millennia by manufacturing and controlling religion\nYoung niggas that blast for me, no religion", "year": "2017-01-13"}]}