{"artist": "Fashawn", "songs": [{"year": "2015-02-24", "album": "The Ecology", "image": "https://images.genius.com/5ad462cd1ac1f9a505d5e0408eceecef.600x600x1.jpg", "lyrics": "[Verse 1: Fashawn]\nTell me, what means the world to you?\nYour spouse, or your house with the gorgeous view?\nIs it the sand white and the water blue?\nBut your priorities are out of order, true? (You've got a good thing)\nIn an empty pursuit of profit and respect\nPreoccupied, you collect more problems to neglect\nEvidently a success, and obviously depressed\nBut the drama, the stress, it's probably for the best\nWhen will we all start realizing that we are blessed?\nExcess expectations we accept\nLet's make a bet, homie\nYou stay in debt, don't ya?\nYou take an L while your lady takes the rest\nEnough is never enough, we want everything\nLike every baby mama want a wedding ring\nWhile you're stuck on this planet\nFocus on what's important\nAnd try to take nothing for granted\n\n[Hook]\nAnd it's all good (You've got a good thing)\nTill it goes bad, till it goes bad\nAnd it's all good (You've got a good thing)\nTill it goes bad, till it goes bad\n\n[Verse 2: Aloe Blacc]\nWhat can I say? Good Things was my good thing\nNeed a dollar, got a dollar, move out the hood thing\nGoodbye 12th Street and Hoover, we won't miss you\nNow sirens and gangbanging teens ain't the issue\nPapa's got a new bag to be concerning with\nLike how my piece of the pie look when the earning's split\nSeason it with sugar and spice\nCause the good things I have in my life is\nThe butterfly in the belly of my wife\nSame time, make lightning strike twice\nThunder shake me up\nOne hit wonder, while the world screaming \"Wake Me Up\"\nBut I'ma sleep just a little bit longer\nEvery night my daydreams get a little bit stronger\nEvery day my nightmare's worst fears subside\nThree years in the making, let me swallow some pride\nGot another good thing for ya, when you hear it\nHopefully it's gonna lift your spirit\n\n[Hook]\n\n[Verse 3: Choosey]\nWe got simple needs and complicated means\nTop Ramen in the pot again and probably all week\nBow your head and give thanks, say grace before you eat\nA couple blocks down they pouring gravy on they feast\nI had a complex about my family tree\nMy apartment complex full of convicts and fiends\nDrug dealing, gunfire right across the street\nWe stuck inside the crib, drop and duck when them guns ring\nWe're dysfunctional, fussing over dumb things\nMom and Pops fighting really just because we\nAin't have the funds to be spendin' it on drugs, he\nEnded up in county, we ain't seen him in a month, see?\nI used to dwell on that until I felt bad\nTook a look around and felt blessed to understand that\nWe ain't had the wealth, still we had a present Dad\nThrough the struggle, that's a good thing to have\n\n[Hook]\n\n[Outro]\nFashawn got a good thing, hey\nAloe Blacc got a good thing, hey\nChoosey got a good thing, hey\nExile got a good thing, hey\nBear Gang in the house and you don't stop\nDirty Science in the house and we don't quit\nBlu in the place, you don't stop\nCo$$ Dollars\nJohaz in the house\nAdidas Cool, yo we gotta be the ultimate", "title": "It’s a Good Thing"}]}