{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/d51a09ab284e0481b02b4d6ecfda5c73.1000x1000x1.jpg", "title": "FiveTweezy", "year": "2005-02-01", "album": "Behind The Musik (A Boy Named Jonah)", "lyrics": "[Intro]\nIt's Fivetweezy, KJ Fivetweezy\nIt's Fivetweezy\n\n[Verse 1]\nWell, I've been gone but I'm back again\nIt's been too long, you wondering where I been\nWell, I betcha I though I would pack it in\nSince I got dissed on MTV for dear slim\nAw, man why'd yall play me?\nTRL, you drive me crazy!\nNow everybody really hates me!\nI thought we were friends, Carson Daley?\nSo when I tried out for American Idol\nI got up and sang for Simon Cowell\nBut he said I was 'absolutely horrible'\nHe said I was worse than William Hung, too\nNow what do I do, please help me, could ya?\nI keep getting punk'd like Ashton Kutcher\nSince my name's still bashed and butchered\nBut I was just changing, so listen would yah\n\n[Hook]\nIt's Fivetweezy, KJ Fivetweezy\nIt's Fivetweezy\nThat's what my friends just call me\nIt's Fivetweezy, KJ Fivetweezy\nIt's Fivetweezy\nThat's what my friends just call me\n\n[Verse 2]\nNow I don't know if I'm past my prime\nI'm feeling old, I just turned 29\nIt's crazy; I think I lost my mind\nCause lately it shows I forget my uh:\nSometimes I feel like my brain is missing\nSometimes I feel like Jessica Simpson\nDon't know if tuna's fish or chicken\nI told ya it's five two, nobody's listens\nOkay, you don't believe that it's true\nEven my mom still thinks it's fifty-two\nNow I tried to explain but it's no use\nAt least the kids say 'man your cool, ha'\nNo, really man, I can't complain\nKids take puff paint and write my name\nOn their t-shirts and they be like WAH!!!\nThat's why it's time for me to change\n\n[Hook]\n\n[Verse 3]\nNow I used to come through my system blasting\nPeople couldn't miss it when I tried to pass them\nIn a Honda civic with the muffler dragging\nShoes off, hairy feet like Bilbo Baggins\nBack when I was living wrong\nI need to get tipsy like J-Kwon\nBut know a days all I need is God\nAnd a mic and a DJ and my I-Pod\nAll righty put your dance shoes on\nAnd everybody just get your groove on\nWe'll rock the party till the break of dawn\nAnd even get your grandma to sing along\nNow what I say, don't take this lightly\nGod runs things, not Bruce Almighty\nHe's Jesus, the only one I need\nNow Fivetweezy, yall know what I mean\n\n[Hook]\n\n[Interlude]\n\n[Hook]"}]}