{"songs": [{"image": "https://images.genius.com/89026ea1dc7518eef373c3891314768f.300x300x1.jpg", "year": "2002-03-28", "lyrics": "[Intro]\nUh uh, Ali and Murphy\nUh uh, School Boy with the College Boy\nAnd ah, and ah..\n\n[Hook: Murphy + Ali]\nAli and Murphy is bougie, baby\nIf it ain't ghetto, it don't move me, baby\nGot a lake, a pool, and a jacuzzi, baby\nBut it's still McDonald's and a movie, baby\nThat's so crazy!\n\n[Ali]\nCheck\nI'm at the bar, industry party, caviar\nDenim suits, superstar, Cigarello cigars\nSpittin' bars to this footer in stilettos\nShe boughetto, that mean she bougie and ghetto\nBougie 'cause her shoes alone cost a grand\nGhetto 'cause she cuss too much and talk with her hands\nShe say she don't fuck wit rap since Ma$e got saved\nBut baby got back like mace got spray\nYou know the bougie type, ass boombastic\nMaybellene queen, titties all plastic\nNiggas front with they tank on empty\nPay cash for err-thang 'cause the top off her Bentley\nI roll the truck slow, the gas; I ease on it\nI got a trailer on the back, four-wheeler with D's on it\nGot the leather with the G's on it, gangsta gangsta\nGotta get it get it good and...\n\n[Hook: Murphy + Ali]\n\n[Hook 2: Ali + Murphy]\nIf you got an expensive weave - that's boughetto!\nSpend six hundred on weed - that's boughetto!\nBenz while ya sittin on D's - that's boughetto!\nTell 'em what's boughetto - Bougie and ghetto!\n\n[Murphey Lee]\nYo Murph' is bougie - School boy; ghetto\nWhat more can I say? I'm boughetto\nAiyyo I'm beautif-hetto, that's beautiful and ghetto\nI got plenty war stories, plenty hood medals\nDid alotta wrong with alotta good fellows\nBut I got my shit together (Hello!)\nI took my hustlin ways from them scufflin days\nTo eight million copies on my resume\nI moved right out the hood, 'cause I don't like the hood\nI tell all my people to think twice in the hood\nThe police; man they don't even like us\n'Cause they got Spud in Booneville, 'Trelle up in Riker's\nAnd I just like what the money can get\nA little head e'ry now and then so honey can spit\nChrome tips, a hundred an forty four of them shits\nAnd a big ass crib 'cause...\n\n[Both Hooks]\n\n[Ali]\nA boughetto pimp juice and I know it 'cause I come to party\nLate, smellin like weed, no matter who throw it\nI'm in the curl cap, didn't get paid but done a rap\nDem ain't Rolex diamonds - what the fuck you done to that?!\nThrowin trash out the Benz on the highway\nBut the old school still spillin all in the driveway\nAnd if it stop, never a towtruck pull me home\nFuckin I keep the socks, had the jewelry on\nI'm like a pimp in the 80's, a Reverend Run\nPreachin it to em, gassin em up like Chev-e-ron\nGot the D's the beeps and the televis-ion\nAnd my Sprint (Brrrrr..) like a boughetto telethon\nBut I'm bougie forever 'Cause I got it to spend it\nGhett-o, put rims on the car that I rented\nTrump money, but it's still the motel and Kyjuan\nAnd Slo and Nelly and...\n\n[Both Hooks] - 2X\n\n[Murphey + Ali]\nAli and Murphey is bougie, baby\nBougie, baby\nBougie, baby\nBougie, baby\nAli and Murphey is bougie, baby\nThat's boughetto... bougie, baby\nThat's boughetto... bougie, baby\nThat's boughetto... bougie and ghetto...", "title": "Boughetto", "album": "Heavy Starch"}], "artist": "Ali Jones"}