{"songs": [{"title": "On Fire", "album": "VYP: Voice of the Young People", "year": null, "image": "https://images.genius.com/638b0a7f368a3faa2d1adfb605f4b99c.400x400x1.png", "lyrics": "Hot Hot Hot\nHot Hot Hot\nI'm Burnin Up\n\n[Chorus:]\nOh! I'm On Fire Hit Me I Gotta Stop Hay! I Gotta Drop (Whoah) And Roll! Cause I'm Burnin Up!\n\n[Lil Mama:]\nIf You A Fan Hands In The Air Spend 360 Hot Cool Me Down Many Drinkin Ish See I'm Blowin Flames At You Girls Like The Back Of The Bat Mobile Or The Front If I Front You Steal Wouldn't Be Able To Practice Well Cover You Up Like Gasoline And Matress Well (Boom!)\nBlow You Away Have You Lookin Like Chucky At The End They Threw Him In The Fire Can't Play In The Park With Me Sumthin Like The End Of The Day Roll With Me I'm a Show You Where You Gon Lay Where I Put You Is Where You Stay Should Of Known When The Street Lights Is On You Off I'm On Been Hood Since Born So Strong So Long To The Rest Of You Youngins Sit Around Watch Now Bout To Teach You Sumthin\n\n[Chorus:]\nOh! I'm On Fire Hit Me I Gotta Stop Hay! I Gotta Drop (Whoah) And Roll! Cause I'm Burnin Up!\n\n[Lil Mama:]\nListen To This They Feelin My Style Lovin My Posture The Way I Break It Down The Industry Got A Problem 16 Spit A Hot 16 Like No Problem Yeah The Deal 16 Mill You Got A Problem You Start Them I'm a Come Finish Them Like My Name Sonya Blaze I? Most Chick Teenage Rappers Kno I Put It In I'm Gowin In Everytime I Touch The Pen Then Again Is What They Say Before They Test Me My Hot Tracks They Keep Gowin Like I'm Jetly Trust Me All Who Write Gotta Respect Me Trust Me I Dos Right Gotta Contest Me Don't Let Me Get Beside Myself Cause Then I Double Myself That's How You Trouble Yourself Me Plus Me Equals Eweee She Got It Bad Skill-Sum Path Of Mine Grown Women Never Had\n\n[Chorus:]\nOh! I'm On Fire Hit Me I Gotta Stop Hay! I Gotta Drop (Whoah) And Roll! Cause I'm Burnin Up! [x2]\n\n[Lil Mama:]\nSo Far Ahead Of Myself I'm Bout To Start A New Life Me Slaughter You Not Nice Mama Mc But She Kno I Spit Light Right You Betta Think Twice So Let Me Do What I Dos Dos And Stick To Flows M A Sticker Heard You Stick To Yours I Deliever A Quick My Union Is Busting To Make You A Believer Even Bruce Springstings\n\n[Chorus:]\nOh! I'm On Fire Hit Me I Gotta Stop Hay! I Gotta Drop (Whoah) And Roll! Cause I'm Burnin Up! [x4]"}], "artist": "Lil’ Mama"}