{"artist": "Ace Hood", "songs": [{"title": "Da Streets", "album": "Birdman Presents: Rich Gang All Stars", "year": "2013-07-16", "lyrics": "[Intro: Birdman]\nKnow I might say YMCMB a lot\nIt's cause I love my squad\nShoutout to that we the best music\nPlay that new Ace Hood!\nGuess what? YMCMB!\n\n[Verse 1: Ace Hood]\nOK, now God that's above, the only man who can judge\nFlip a brick to a Benz, never reveal who the plug\nOver money, I know some young'ins who turned on their blood\nIf niggas' bitches, just dig em ditches, that's rule number one\nAin't never gonna turn on my niggas, I put that shit on my sister\nKeep that ho when I ride, and I'm talking about my lil pistol\nThat's cause the streets hella cold, most of my friends turn to foes\nSome of these niggas are bitches, most of these women be hoes\nBut I just stay on my grizzle, fuck we get money, niggas\nMost these pussies just talk it, I really know me some killers\nDon't even go there, don't even go there!\nMost of my niggas labeled felons boy don't make em go there\nI holler, fuck a man, that pussy shit you stand for\nThese people hate that I done made it, what you mad for?\nI'm doing me, my truey jeans , is full of cash flow\nAnd that real nigga shit the only thing I stand on\nI'm out of my mind, I'm going 200 on the dash board\nMy whips so foreign, it's a must I keep my passport\nMy chopper gold, I mean that Trinidad James ho\nIn twenty jesus pieces, bury me with chains on, pussy!\n\n[Bridge: Birdman]\nShoutout to that boy stunner!\nShoutout to that boy George Dukes!\nShoutout to my nigga Wayne!\nMac Man, I see you!\n\n[Verse 2: Ace Hood]\nOK, now two jesus pieces running\nThese streets and my loafers\nEvery day I'm a hustler, I gotta meet my new quota\nRest in peace all my niggas, I'm trying to find me some closure\nNiggas ain't who they say they are, it's 'bout time expose em\nFresh and I'm in that new Lotus, I block the fake like a golie\nKilling these niggas I promise, just wanted to send my condolence\nBetter know we out here, yeah boy, we out here\nAnd it ain't no limes you know them couches, I'm paper counting\nThem cowards piling, take a trip overseas then come back and buy me beamer\nTippin' toe on the forges, that's a new ballerina\nOnly eat up the pussy if you smell like a finna\nKeep some shit in the trunk, that just might clear out arenas\nI'm talkin' Starvation 2, the beast is back in the booth\nI got that shit off the muscle, I'm only preaching the truth\nI thank the Lord every morning, I'm not that boy on the corner\nGot a crib big as walmart and ho I'm the owner, yea!\n\n[Outro: Ace Hood & Birdman]\nToe tag, nigga!\nAce Hood!\nTrials and tribulations, the new album, 2013, nigga\nWe the hottest\nWe the bidness, nigga, we them niggas\nYa feel me?\n(We got too much money to be fuckin around with ya'll niggas)\nWe the best!\n(See sometimes you gotta understand)\nYMCMB!\n(We don't personally have to come see you\nBut we will have somebody personally to come see you)", "image": "https://images.genius.com/c45c4266cad03c4aecbe6fadb721163f.400x400x1.jpg"}]}