{"artist": "Pharoahe Monch", "songs": [{"album": "Desire", "title": "Bar Tap", "image": "https://images.genius.com/9550ab49453d639d9e2d3a07226ff0ed.500x500x1.jpg", "lyrics": "{\"They don't dig the urgency\"}\n\n[Intro: Pharoahe Monch]\nOkay, so boom like\nI'm at the bar right, I'm at the club\nI'm chillin' at the bar\nI got my drink, you know I drink my Grey Goose\nSo I turn around with my drink in my hand\nShorty all over me, you know what I'm sayin?\nEverybody lookin at my face like \"Yo what you gonna do?\" you know what I'm sayin?\nSo I'm like, yeah I'm lookin at her and like...\n\n[Verse 1: Pharoahe Monch]\nWooo let me adjust myself\nShe making it hard, I don't trust myself\nBut you throwin' it back, I might bust right here\nYou dancing like you're really tryna fuck right here\nIf you don't feel that roll of quarters\nMove that bubble back whole at boarder\nAnd if you turn around and bend\nI will show you one and again\n{\"Goddamn, what are those 2 midgets in her back pocket?\"}\nShe said, \"Who you know, how you get a .9 in the club?\"\nI said, \"That's not a nine ma, that's merely an 8\nBut if I buy you drink could we go out on a date\n'cause you sound like you wasn't born inside the Empire State\"\nShe said, \"I'm not from here, it's hot in here\nBut you're popular, so I'm not secure\"\nEverywhere she was walking dudes was stoppin' her\nThe smoke was irritating to her ocular\nI said, \"Your contacts\", she said, \"Huh?\" \"Give me your contact\"\n\"I'm going to the bathroom, can you buy me a cognac?\"\nOkay, okay...\n\n[Hook: Mela Machinko]\nOoh ooh, you sexy (sexy)\nBaby won't you let me (let me)\nBaby, oohh, show some secret thangs to you\nOoh ooh, you sexy (sexy)\nBaby, won't you let me (let me)\nBaby, oohh, all the things you want me to\n\n[Verse 2: Pharoahe Monch]\nI got you Hennessy and coke but shoulda got a diet 'cause if you watching your calories, now where's my hospitality?\nAnd if I got it straight... shiet, what if it's straight?\nCause after a couple of those you start to relate\nShe dancin' better than savion, workin' her lady charm\nBattin' her eyelashes, finaglin' her baby arm\nAnd all up in my space, next day I'm on her myspace top eight\nWe contemplating a hot date\nGot poolside flicks for the cool fly blogs\nWith the rules I kicked about the yuletide logs\nShe like low cut jeans with the real high clogs\nAnd dig music so much she got two iPods\nI'm tryna make it to third base like A-rod\nThrew a couple of Guinness stout back just to stay\n[So qu'est-ce que c'est?] now let's just say\nI'm tryna get horizontal like yesterday, she say..\n\n[Hook: Mela Machinko]\nOoh ooh, you sexy (sexy)\nBaby, won't you let me (let me)\nBaby, oohh, show some secret thangs to you\nOoh ooh, you sexy (sexy)\nBaby, won't you let me (let me)\nBaby, oohh, all the things you want me to\n\n[Outro: Mela Machinko]\nAll the things you want me to", "year": "2007-06-26"}]}