{"songs": [{"year": "2017-09-11", "image": "https://images.genius.com/84420a132152a19b7d6b4521e6e94937.1000x1000x1.jpg", "title": "No Topic", "album": "The Purple M&M", "lyrics": "[Verse]\nMade this song and it got no topic, fuckin' your thottie\nJust got off the phone with Yo Gotti, he like what's poppin'?\nI moved that pound like a man\nDown on my knees, I stayed low for some bigger plans\nYou used to ball, call you Chris Grant\nFull of gelato, bitch you know the stench (gas, gas, gas)\nSmoke an O so that's full court\nAdd it up bitch, that's a dollar worth\nYour bitch she all on my collared shirt\nBitch I told you this ain't Holister\nI make her walk like I'm out of there (walkin')\nWrist gold, mouth gold, really everything gold on me\nI unload my pistol, turn an opp to a dead homie\nYou gotta roll though, pull up in four door (skrrt skrrt)\nThat nigga a bitch (why?), he shoot with his eyes closed\nI ain't no ordinary nigga, bitch I'm an ordinary killer\nI got like seventeen choppers and at least forty-seven pistols\nDrippin' sauce in this bitch, now they like whoa\nRock Revival jeans, fresh from head to toe\nSay I'm ugly, yeah I know so (I know so, I know so)\nBut I still can fuck on your ho (that's my ho bitch)\nBitch, go get you some new clothes (some new clothes ho)\nYou had them black pants up in school ho (you did)\nI had them Dickies in that motherfucker (in that motherfucker)\nWe smokin' sticky in this motherfucker (gas, gas)\nHer name Vicky, have a quickie in this motherfucker (I'm finna fuck her)\nShe might give my dick a hickie in this motherfucker (might give a sucker)\nHit the club, got my glizzy in this motherfucker (yah)\nTwo hitters outside in the car, call them the splash brothers (that's on my mama)\n\n[Outro]\nNo topic\nNo topic, no topic, no topic\nNo topic, no topic\nThree niggas outside, best believe that they Bloc\nYeah they Bloc\nHello?\nWant that nigga out of there man, I want that nigga dead man. I don't want that nigga livin' no more man, I'm just, I want him assassinated, on crip god, for real, you hear me?\nCatch that nigga outside loafin', loafin'\nChopper gon' bust his ass open, open\nIf you do that, them young niggas loc-in', loc-in'\nWe can't claim no hoes, fuck a trophy, trophy\nAyy, I don't even know what to say, ayy\nDamn I'm finna go to the bank, bank\nGo get me some more cake, cake\nAnd right in your bitch face, face\nFinna bring her, beat the face, ayy\nFinna go and beat that case, yeah\nMight of [?] earth with the ace, ayy\nBall like a Pacer, yeah yeah\nBall like a Pacer, ayy ayy\nBlocBoy JB bitch, ayy\nKnow how much money I'm making?\nMoney that I'm making --\nYeah man, y'all know what's goin' on man"}], "artist": "BlocBoy JB"}