{"songs": [{"year": "2010-06-22", "image": "https://images.genius.com/094639b25f790dc7c57451247197cfd7.360x360x1.jpg", "title": "Birthday", "album": "Gang Rags", "lyrics": "[Hook]\nHow bout a birthday? Fuck another funeral\nWe're only here to live one time, you know?\nHow bout a birthday? Fuck another funeral\nAnd how I live my life, they don't control\nHow bout a birthday? Fuck another funeral\nWe're only here to live one time, you know?\nHow bout a birthday? Fuck another funeral\n'Til the day I die, you can label me a juggalo\n\n[Verse 1: Blaze Ya Dead Homie]\nMy homeboy's dead, he been gone 3 days\nAnd now I'm with his family in a funeral parade\n'Til the wake, split stories over chicken and biscuits\nAnd I contemplate all the shit that he's missin'\nIt's fucked why folks die so young\nI bet he had the chance to get my dry-cleaning done\nOh no here it comes, guess it's time to get the soup\nInstead of the cigars 'cause my homie's wife is due\nHere's what's true, there's an obituary page\nWith no section devoted to new lives being made\nSad to say, easy to see when you look\nThe birth rates decline while the death rates off the hook\n\n[Hook]\n\n[Verse 2: Violent J & Shaggy 2 Dope]\nBad news, so much fuckin' bad news\nWhat the fuck is the matter with these sad fools?\nNobody cares what they buildin', just what they tearin' down\nIt's hard time on your spine, it's heavy on your mind to carry 'round\nTell me 'bout what's coming, fuck what's goin'\nDrama we already knowin'\nBodies fallin', whistle blowin'\nShow me what's alive & growin'\nTell me about the trees reachin' the sunshine\nTell me about some soldiers coming home safe, just one time\nLet somebody blind look around\nLet the deaf hear a sound\nHow 'bout a hidden treasure found?\nSpread some fuckin' pleasure round\nHow bout a birthday? Fuck another funeral, BOO!\nThat's like 2 in a row too, with more to go through\nShow me some white clouds, beaches with seagulls in the sky\nNo more white gowns, gurneys [?]\nSomebody slow down, relieve some of this pressure\nLet's try to focus on some positivity\nSo much fresher\nHow 'bout it?\n\n[Hook]\n\n[Verse 3: Blaze Ya Dead Homie]\nNo more funerals, no more wakes\nNo more eulogies, give my birthdays\nIt's time for first crawl, first tour, first walk\nI don't wanna see no homies outlined in chalk\nThis year is our years, we livin' without fear\nBut so many folks dying, that the future's never clear\nIt's cloudy & overcast with the past, it's a reminder\nThere's nowhere safe for you to hide 'cause death showed behind ya\nAnd if this is God's plan, then help me understand\n'Cause I'm losin' my fade in a world in atom, man\nHow 'bout a birthday, not a funeral possession?\nWe'll party 'til the lights go out, without question\n\n[Hook]"}], "artist": "Blaze Ya Dead Homie"}