{"artist": "6ix9ine", "songs": [{"year": "2018-08-31", "title": "BEBE", "album": "DUMMY BOY", "lyrics": "[Letra de \"BEBE\" ft. Anuel AA]\n\n[Intro: 6ix9ine]\nHaciendo el amor, a la misma vez tú te toca' (Te toca')\nBebé, no te pasa nada, vuélvete loca (Lo-loca-loca)\nY tu novio te trata mal, él no te controla (No, no, no, no)\nHe said…\n\n[Pre-Coro: Anuel AA]\nMi diablita (-blita)\nElla se pone pornográfica en la intimidad (Baby)\nY su marido no la valora y la deja sola (La deja sola)\nY yo siempre la estoy esperando con mi pistola (-tola)\nY conmigo ella siempre se moja\n\n[Coro: Anuel AA & 6ix9ine]\nBebecita (Uah)\nTu hombre te ama pero tú le ere' infiel (Bebé)\nPorque tú ere' una diabla dentro de una mujer (Oh-oh, oh-oh)\nY cuando se esconde el sol tú quiere' beber, hija 'e Lucifer\nBebecita (Mi baby; uah, uah)\nTu hombre te ama pero tú le ere' infiel (¿Por qué-é-é?)\nPorque tú ere' una diabla dentro de una mujer (Muje-e-r)\nY cuando se esconde el sol, tú quieres beber, hija 'e Lucifer\n\n[Verso 1: 6ix9ine & Anuel AA]\nBaby, con ra-ta-ta-ta-ta\nBaby, yo soy tu criminal\nBaby go ra-ta-ta-ta-ta\nBaby, tu novio lo va a olvidar\nBaby, con ra-ta-ta-ta-ta\nBaby, conmigo te va' a mudar\nBaby, con ra-bang-bang-bang-bang\nBaby, do' un tiro', lo voa' matar (Pa' afuera)\n¿Pa' qué?, ¿pa' qué?, ¿pa' qué?\n¿Pa' qué vas a serle fiel?\n¿Pa' qué?, ¿pa' qué?, ¿pa' qué?\nBaby, olvídate de él\nTú ere' mi diablita y yo soy tu demonio\nUn amor de manicomio\nY si te veo con él, yo te odio\nSiempre me tiene' en insomnio\n\n[Verso 2: Anuel AA]\nMedusa, Versace (Versace)\nSiempre hacemo' la \"sei'-nueve\" como Tekashi (Yeh-eh)\nY yo te rompo to' en secreto, Illuminati (-nati)\nY ella se baja conmigo en la disco en el Ferrari (-rrari)\nFumando mari' (Uah)\nY tú te hiciste tu cuerpo, bebé, en R.D\nY chingamos y siempre nos venimos a la vez\nTe hice el amor y en tu piel me enredé\nY mi bicho en tu totito te tatué\nOh-oh-oh (Uah)\nBebé, tú eres mía, ese hombre olvídalo-o-o\nY rebota esas nalgas bailándome reggaetó-ó-ón\n\n[Coro: Anuel AA & 6ix9ine]\nBebecita (Uah)\nTu hombre te ama pero tú le ere' infiel (Yeh-eh)\nPorque tú eres una diabla dentro de una mujer (Oh-oh, oh-oh)\nY cuando se esconde el sol tú quiere'  beber; hija 'e Lucifer (Oh-oh, oh-oh; uah)\nBebecita (Mi baby)\nTu hombre te ama pero tú le ere' infiel (¿Por qué?)\nPorque tú eres una diabla dentro de una mujer (-er)\nY cuando se esconde el sol tú quiere' beber; hija 'e Lucifer (Beber; -er)\n\n[Outro: 6ix9ine]\nMi diablita (Mi nena)\nElla se pone pornográfica, no es tímida (Mírame, mami)\nY su hombre no la valora, la deja sola (La deja sola, sola)\nY siempre la estoy esperando con mi pistola (Ra-pa-pa-pa)\nSiempre se enamora, mi diablita", "image": "https://images.genius.com/66e72febe4c5cb2e9cf2bf927aea5e9b.939x939x1.jpg"}]}