{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/770790566878699d43ed58ab69a253ba.1000x1000x1.jpg", "title": "Do You Want It", "year": null, "album": "Black August", "lyrics": "[Killah Priest]\nWhiny, whiny\nUh, yeah, turn it up\nThere you go\nLadies, yo\nLegs, y'all know I like dem\nWhite or black or light skinned\nChinese, big or tiny\nRight between the legs is where you find me\nIn the bed, gettin mad head\nHit it from the back, made her bite up on the spread\nGrabbin pillows, yo ass right in the middle\nShe gets excited, and calfs start to tremble\nI rough ride her, when my dick up inside her\nHave em buggin out and actin all retarded\n'Damn, Priest, look what you started'\n(Hush) Lemme finish my job then\nRoll over, roll one, I'm sober\nCome back to the bed with a snicker and a soda\nWas it good? (Hmm)\nWell that's what I told ya\nWas it hood? (Hmm)\nFrom the bed to the sofa\n\n[Chorus: Woman Voice (Killah in CAPS)]\n\nDo you want me? (YEAH)\nIf you had me would you freak me? (YEAH)\nDo you wanna feel me deeply? (HELL YEAH)\nThen come here and give it to me (UH HUH, UH HUH)\n\nDo you want me? (YEAH)\nIf you had me would you freak me? (YEAH)\nDo you wanna feel me deeply? (HELL YEAH)\nThen come on and put it in me (UH HUH, UH HUH)\n\n[Killah Priest]\nI love fat hips, full lips and thick thighs\nNow ladies, take down my dick size\nAbout that long, or maybe this wide\nShe says she love the way that it fits inside\nHave em catchin fits, throwin up gang signs\nOld school cat, hit em off Saint Ives\nTalking in tounge til the bitches go blind\nSlow down baby, bout to lose yo mind\nNow, I lick on breasts, the honeys impressed\nTalk about sex til we both undressed\nTil she's in bed, tryna put me to the test\nThen I beat upon that flesh to put her ass to rest\nI can, go for hours, control my power\nThis position is called the lotus flower\nNow the chick is strung, like the way that I'm hung\nCause I could drive it like a slave all the way to her lungs\nAaaaahhh\n\n[Chorus]\n\n[Killah Priest]\nHold up ladies, lemme tell y'all one thing\nG strings and I like that tongue ring\nYou really freaky, come over and freak me\nGet on top, you all hot and leaky\nOh you need me, know how to please me\nYou just like the way the ring is on the pinky\nCalling me daddy, talkin all trashy\nI'm into that fatty, bring that wagweed\nI pulled that hair, put that there\nPut those up there, lets use that chair\nBring those fruits out, I got ideas\nBelly to belly, hands cuffed under that jelly\nSplit that muff and disrupt the tele\nDamn girl, you got a six pack\nSmall pack, honey sit back\nI'ma freak ya like 'How you did that?'\n\n[Chorus x2]\n\n[Fade]"}]}