{"artist": "Asher Roth", "songs": [{"title": "Hellafaded", "image": "https://images.genius.com/9da820494f0481947a0c330df3cf71b1.320x320x1.jpg", "album": "Seared Foie Gras W/ Quince and Cranberry", "lyrics": "[Hook - Asher Roth x6]\nWe getting\nWe getting\nWe're Getting Hellafaded\n\n[Pac Div]\nWhat up C-A? What up P-A? You're girl playing us she got us on replay\nYou're girl playing you she all up on a speed date\nYou're old style like you got it on eBay\nThis rap shit, we finna run it like a relay\nYour chick come around, I'mma cut her like a DJ\nCool out man, whatchu 'bout, man?\nWe from the rest where they pull out things that go \"BANG\"\n\n[Hook - Asher Roth x4]\nWe getting\nWe getting\nWe're Getting Hellafaded\n\n[Pac Div]\nGimme that watch, gimme that ring, and whatever else bling\nIt's that 2-11 music bitch you know what I mean\nAnd if you ever come to my city you know who my team is\nWilly, Magic, Kareem, Byron Scott on the wing, man\nI'm clean, I'm shinin', I sparkle like a diamond\nBeen running this for years, nigga, I should win the Heisman\nShe love it, she like, she said I am the flyest\nSo she put it in fifth gear any time I let her ride it\n\n[Hook - Asher Roth x4]\nWe getting\nWe getting\nWe're Getting Hellafaded\n\n[Pac Div]\nIt's getting, It's getting, It's getting kinda nasty\nOne blunt rolled, other one where my stash be\nIn the game, something like Milton Bradley\nOld school nigga, man I still roll up black street\nWe go back like hot wheel tracks\nIn the box heels back, bring that Pac feel back\nFuck around, get your top peeled back\nNiggas drop real rap we don't want none of that\n\n[Hook - Asher Roth x4]\nWe getting\nWe getting\nWe're Getting Hellafaded\n\n[Asher Roth]\nFirst off Ash Roth says fuck the game\nI've been a bum for a month and I still ain't changed\nI got clothes with some holes and they still all stained\nBut I will show up to your show and then steal the stage\nYeah the crowd getting buck like they couldn't get enough\nEverybody in the front do the guido fist pump\nI be humpin' on a bum, she got junk up in the trunk\nLike I met her in Miami hanging on the bang bus\nI be playing in them panties like my man Brain does\nAnd they kick it to the corner right when the brain done\nThey be calling up my celly (cell phone) I just fucking hang up\nI be wifin' up a muffin who just went and gave it up\nI'm straight, I'm young, I'll wait, not done\nPut your titties in my face, play the nipple with my tongue\nIt's my favorite instrument, I like to practice when I'm drunk\nSo pour up a shot of remmy and roll up another blunt!", "year": null}]}