{"songs": [{"album": null, "year": null, "title": "Control Yourself", "image": "https://images.genius.com/cf5f9dac15a8dd46feb029634a1ae995.749x749x1.jpg", "lyrics": "Uhh\nGet in tune with a spitter\nExcuse me I'm sicker\nWhat you divin' in ain't a pool full of liquor\nYou rap like you used to share a room with your sister\nTrap life, we lookin' at two diff'rent pictures\nYou animal food\nI'll be damned if I lose\nTo the cat that lost to the Charles Hamilton dude\nHow could you claim you nice\nYou let him take your mic\nMiddle of your rap, couldn't even say it right\nMust be gettin' high\nThinkin' you as sick as I\nWhat tracks you killin', you wouldn't kill a vibe\nYou went in why? Take a stroll thru writer's block\nUse your Gemini's-\nYou don't see I'm twice as hot\nYou sound weird when you jump on the verse\nNigga I'm outchea when it comes to the first\nBundles of work (that crack)\nYa'll gon' make me duct tape Mr. Duckworth into dump what he's worth\nGet a pushed wig-\nYou don't know what good is (why)\nLike your first album title you's a good kid\nTime to show this amature a lesson-\nHis whole schemes are full of bad cannabis impressions\nA Big L offspring, I off kings\nTim Dunc when he's balling-\nFalse ring\nAct silly-\nGet lapped 'till the track dizzy\nTwist straps that'll smoke you, I call 'em the Black Hippies (blah blah)\nDebt it\nThis justice is poetic-\nI'm dumpin' the pump until they yell cut, nigga, no credits\nYou know you haters frontin'-\nHow could he be claimin' somethin'?\nWhen all he do is switch his flow and don't be sayin' nothin'?\nI sketch draw\nTime to let the lead pour\nWatch them niggas hauled when it get messy at the mess hall\nDead raw\nYa'll gon' hafta beg more-\nYou rappin-\nI'm metaphor punchin' niggas' heads off\nWhat you gon' tell a don\nI gotta check a pawn?\nJust put a check up on his head, that nigga dead and gone\nHow could you tell me 'wrong'?\nDominicans don't wish that you was born there, they wish that you was never born\nWhat's his Twitter?\nSend this body to this nigga-\nOn Control?\nYou named everybody but the spitters (like what?)\nLike I ain't right here\nIn my Nik' Airs-\nWhite pair-\nI'm the Harlem nigga in your nightmares\nYou really ain't hot\nI got this thang locked\nBuncha hard bars, I don't need to name drop\nBanks stop-\nEverytime I aim shots-\nI just had to school boy, he ain't know how J rock"}], "artist": "J.R. Writer"}