{"songs": [{"image": "https://images.genius.com/280c33eca871f16981ce3abbe9c9ea6f.500x500x1.jpg", "lyrics": "[Intro]\n2014 was crazy\nWoah\n\n[Verse]\nI heard Puff put hands on Drake\nTroy Ave got the \"Tuesday\" kid punched in his face\nChris Brown went on Instagram and told us that his girl fucked Drake\nThe 'Gram took niggas' followers, they violated Mase\nThey took 1.5 million, I seen that shit\nMase was so embarrassed, he deleted his shit\nJ. Cole sold three sixty his first week\nNicki broke up with Safaree and start fucking Meek\nLil Wayne don't want to fuck with Baby\nBut the contract he signed got him stuck with Baby\nI say shit that make niggas think\nFive niggas told me K. Michelle pussy stink\nSeen Bobby Shmurda on Jimmy Fallon\nJimmy Kimmel, now they got him on Riker's Island\nFree the whole GS9\nThe law hate seeing niggas shine\nWhat they won't say, Im'ma write it\nTwo cops got killed cause two cops ain't get indicted\nThey took Eric Garner, shot Mike Brown in the head\nAnd now two innocent cops is dead\nAnd real talk, that's not what's up\nThe KKK laughing like \"ha, that wasn't none of us\"\nThat probably went over your head\nY'all rather talk about Bill Cosby instead\nOr Jay and Solange in the elevator\nDo ya know the police upset with the mayor?\nCause he supported the protest\nThe revolution coming, people just don't know it yet\nThey know what happened on Love & Hip Hop\nDon't know what Young Thug said but still think his shit hot\nThe realest yearly rap up you ever heard\nI'm just stating a few facts and some shit that I heard\nG-Unit back together minus The Game\nAt Summer Jam on stage, niggas took Slow chains\nThen Slowbucks tried to set it on Fab and 'em\nCause they was on stage when it happened, they was mad at him\nI got to talk about this shit\nI'm still bugging now how Angie made that Power switch\nAmber and Wiz going through that divorce now\nThe other day, I seen her twerking on Chris Brown\nSuge got shot in the club in front of Chris Brown\nThen they tried to say it was meant for Chris Brown\nT.I. swung on Floyd and 'em\nRest in peace to Earl Hayes, I did a song with him\nRest in peace to his wife\nHe killed her then took his own life\nBoosie home, Remy back home\nLeBron left Miami and went back home\nThat Ebola had niggas shook\nRay Rice knocked out his wife with the left hook\nFrench got a Kardashian under them sheets\nMy nigga Jeezy and Rick Ross deaded their beef\nBut everybody beefing with Iggy\nDre & Jimmy sold Dre Beats for 3 billi\nThe realest yearly rap up you ever heard\nI'm just stating a few facts and some shit that I heard\n\n[Outro]\nYo know\nYou need people like me so you could\nPoint your finger at and say\n\"That's the bad guy\"\nYeah\n2015, what's good\nGMG\nATM\nNew Money\nWoah\nIt's the Rap Up\nBrooklyn", "title": "Rap Up 2014", "year": "2014-12-31", "album": "Rap Up Series"}], "artist": "Uncle Murda"}