{"artist": "L’A Capone", "songs": [{"title": "Wit the shits", "album": "Separate Myself", "year": null, "image": "https://images.genius.com/086ed874c1108cee242267fa19737166.500x500x1.jpg", "lyrics": "[Hook - Lil Chief Dinero:]\nMy niggas with the shits, my niggas they 'bout that life\nMy niggas shoot shit, my niggas they toting them pipes\nThese hoes on our dick, these hoes wanna be our wives\nBut we don't love these hoes, they good for just one night [x2]\n\n[Verse 1 - Lil Chief Dinero:]\nMy niggas with the shit, my niggas will take your life\nPull up on your block, 30 shots\nYeah, we toting them pipes\nKeep cool, get money, smoke dope\nI live this life\nIf a nigga try me, that's the day he gone meet Christ\nI'm getting hella money, I'm counting all hunnids, I got these bands\nAll these damn bands, can't hold these bands\nI need an extra hand\nThese hoes on my dick, these hoes know they my fans\nBut you can't fuck me unless you finna suck my mans (YOU GOTTA FUCK BRO!)\nKnow a lot wild boys\nE.D.E, G.M.E\nCall up lil mans (SQUAD)\nMoney up them macs, got Murder in the cut\nThey blowing like a fan\nIf you ain't talking money, what the fuck you saying?\nI don't really understand!\nThat's why I'm thumbing through a check\nIt ain't shit to spend these bands!\n\n[Hook x2]\n\n[Verse 2 - JP Armani:]\n(SQUAD!)\n(GLOBAL GANG!)\nMy niggas with the shits, my niggas stay with them poles\nKeep my circle small so I know my niggas gone blow\nThese bitches ain't worth shit, so I can trust no ho\nWe ain't worried about no guns, we got shit that explode\nA opp running down RoeBlock, leave a nigga on his nose (MAN DOWN!)\nThis 7 block strapped twice, I got niggas get you gone\nThe 40 dirty with the 30 plus is 1 in the dome\nYour man is boring, pull up in that foreign\nYo bitch, bet she gone (SKURT!)\nGot bitches kissing, bitch on the squad we'll leave yo ass missing\nThere with the pistol, do a hit, leave the scene\nThrow the pump in the river\nLay low, smoke dope\nThey'll be gone in a minute, sit back tell them boys go get him\nDon't aim with the tec cause I know it's gone hit him\nWanna go to war, we got shit to blow the whole city\nAnd I'm posted on 7 RoeBlock, say the city\n\n[Hook x2]\n\n[Verse 3 - L'A Capone:]\nMy niggas with the shits, everybody off yops all night\nGo grab that nick\nNine times out outta 10 won't fight (NO I WON'T FIGHT!)\nYou ain't did no hit, I can tell you ain't took no life! (YOU AIN'T TOOK NO LIVES!)\nHit a crib for the racks\nAnd the flats when I gotta get right\nKnocking niggas down my sport\nInternet goon, but he still on the porch!\nI catch a opp lacking then he gone get torched\nWe the Mustang Gang, can't run from a horse\nWe don't give a fuck, shoot him in the airport\nWe don't give a fuck, leave him on the back porch\nWe don't give a fuck if his mom and his dad looking sad\nToo bad we still gone torch!\n600, we holding up\nI don't think niggas wanna blow at us!\nIn the foreign riding fast\nJust me and cuz!\nOTF, O'Block they roll with us! (SIX HUNNA!)\nAnd we toasted up\nRiding through the Drive and we posted up\nAnd the party get loud when we showing up\nI be high as fuck!\nBut the hoes on me and they feel that pole on me\nI'm just in my RayBans tryna see what I could see\nAnd my goon keep heat so he won't go sweet!\nDouble-0 be the squad, swear to God Double-0 go hard!\nAnd my nigga Lil Chief, you know bro gone squad!\nBetter keep your piece/peace, cause we stopping the yard\nNiggas stink, like bro did you fart?!\nDo a drill out the top of the car\nPopping pills, now I'm staring at the stars\nMy niggas with the shits, we are!\n\n[Hook x2]"}]}