{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/d5f54a0dd532fc36efa92d14a85f01c2.400x400x1.jpg", "title": "Angels", "year": null, "album": "Welcome EP", "lyrics": "First came the wings, then the angel\nHis spirit actually appeared to you?\n\n[Intro: Killah Priest]\nWord, know what I'm saying?\nStraight up. I gotta talk to y'all about angels right now\n(Don't be bugging) I dunno if you be knowing that you having them all around you?\nProtecting you, angles, just wanna talk about angels\nSomething different we ain't discussed\n\n[Hook: Killah Priest]\nYo, Angels Elohim in the skies, fly with eagle wings\nAngels Elohim in the skies, fly with eagle wings\nAngels Elohim in the skies, fly with eagle wings\nAngels Elohim in the skies, fly with eagle wings\n\n[Verse 1: Killah Priest]\nFirst Genesis mislead us, fist of all\nWe have to discuss who is the us\nWho helped form the man from out of the dust\nWho helped make the lands and fill the sea up? It was us\nIn greater form, we helped create the storms\nThat take newborns and embrace them in their arms\nThey hold harps and play God his favourite songs\nTouch the heart and make it warm\nThey taught the preachers, they sit on ether\nSome say they touch women in the bleachers give them seizures\nThey fight demons, they like creeping\nAngels, they govern kingdoms, yo come on\n\n[Hook]\n\n[Verse 2: Killah Priest]\nAngels, they brought the message from the heavens\nConfused man about immaculate conception\nThey dress in all black in their presence\nThey know the answers to mans questions, while he's questing\nThe cherubim in the jeroboam\nMan should cherish them, but don't worship them\nWhy? 'Cause they here to service men\nAngels, they walk with plain clothes never let their wings show\n\n[Hook]\n\n[Verse 3: Killah Priest]\nAngels in which you imprisoned, show us visions\nPlay with your children, introduce us to women\nThey surround leaders and politicians\nAcknowledged by Christians, followed by wisdom you can hear them\nThey could be around you right now, sitting with their wings hidden\nThe ghosts of the night drifting, float on the night skipping\nPut my soul in conviction\nJust listen to the energy, channels into the angels, come on\n\n[Hook]"}]}