{"songs": [{"year": "2011-01-01", "lyrics": "[B.o.B - Verse 1]\nWell this is the mysterious case of Dr. Aden\nLooking after her patients was her only obligation but\nThat was back before, back before the situation\nBefore she got a visit from an agent\nHe introduced himself as an employee of the nation\nHe asked would she be willing to offer cooperation\nYou fit the job description and all the qualifications\nIf interested I need your signature on this paper (sign here)\nShe signed the dotted line without the slightest hesitation\nShe then received a letter stating the rules and regulations\nAnd the military bases where she must be relocated\nShe is not to discuss any business thats work related\n\n[News Clips - Talking]\n\n[B.o.B - Verse 2]\nIn Central America on a classified location\nBefore border control before a illegal immigration\nInside a lab where chemicals are manipulated\nIs where we see Dr. Aden, she’s very concentrated\nBut her concentrations broken\nWhen she hears a conversation down the halls\nSmall talk about destabilization and\nOutta curiosity she wanders from her station\nInside a unlocked office she did some investigation\nShe breaks into a file with top secret information\nProbably some of the most disturbing documentation\nShe ever saw in her life - the article simply stated\nHer study being conducted on human civilization\n\n[News Clips - Talking]\n\n[B.o.B - Verse 3]\nDeep down inside she wished it was all her imagination\nShe couldn’t doubt it, cause there it clearly stated\nShe works in a facility where viruses are created\nAnd not only that, but ‘member when she had her patients\nShe wrote out prescriptions for what she thought was medication\nHer office was really just a part of the operation\nShe wipes her eyes as they water full of frustration\nHow a victim of government experimentation\nWhere's the justification, where's the justification\nWhere's the judge when you need him\nHe's probably on a vacation\nProbably inside of the same country that these events takes place in\nBut as the puzzle pieces fall into proper arrangement\nYes we began to see the intentions of these creations\nThe patterns of epidemics like H.I.V. in the 80′s\nBiological chemicals designed to be contagious\nThere’s nothing in the business of controlling a population", "title": "Dr. Aden", "album": "No Genre", "image": "https://images.genius.com/d18ebaef113d710715491da16422feee.1000x1000x1.jpg"}], "artist": "B.o.B"}