{"artist": "Immortal Technique", "songs": [{"title": "Freedom of Speech", "lyrics": "[Intro]\nFreedom of speech, motherfucker!\nOkay, somethin' for the kids (hahaha)\n\n[Pinocchio sample]\nI got no strings to hold me down\nTo make me fret or make me frown\nI had strings, but now I'm free\nI got no strings on me\n\n[Verse 1]\nStep into the club smoothly with a L in my hand\nBitches know that I'm a freak like the Elephant Man\nIntelligent plans, fuck a record deal!\nI want development land, with my benevolent clan\nAnd that's the reason that I only trust my fam\n40,000 records sold, 400 grand\nFuck a middleman! I won't pay anyone else\nI'll bootleg it and sell it to the streets myself\nI'd rather be that than signed and stuck on a shelf\nAnd because of this, executives try to diss me\nRacism frozen in time, like Walt Disney\nAnd now they say they wanna get me signed to the majors\nIf I switch up my politics and change my behavior\nTry to tell me what to rhyme about over the beat\nBitch niggas that never spent a day in the street\nBut I repeat that nobody can hold my reins\nI put the truth on tracks, nigga, simple and plain\n\n[Pinocchio sample]\nI got no strings, so I have fun\nI'm not tied up to anyone\nThey've got strings, but you can see\nThere are no strings on me\n\n[Verse 2]\nI guess to America I'm a disaster\nA slave that was destined to own his masters\nIndependent in every single sense of the word\nI say what I want, you fuckin' little sensitive herb!\nThis is America, I thought we had freedom of speech\nBut now you want try to control the way that I speak\nAnd O'Reilly, you think that you a patriot?\nYou ain't nothin' but a motherfuckin' racist bitch\nFull of hatred, pressin' a button tryin' to eject me\nBut I ain't got no motherfuckin' deal with Pepsi\nNo corporate sponsor tellin' me what to do\nAskin' me to tone it down during the interview\nTryin' to minimize the issue, but I'm keepin' it large\nI love the place that I live, but I hate the people in charge\nSpeakin' is hard when you got strings attached\nSo, I'ma say it for you, ‘cause I ain't got none of that\nAnd if you didn't understand what I spit at your brain\nAyo, son, let this little nigga explain!\n\n[Pinocchio sample]\nI got no strings, so I have fun\nI’m not tied up to anyone\nThey’ve got strings, but you can see\nThere are no strings on me\n\n[Verse 3]\nCome on, son, y'all niggas know the way I do\nImmortal Technique dot com live for you\nAnd I know sometimes it be makin' you nervous\nThe way I snatch puppet rappers that belong in a circus\nYou motherfuckers just can't compare\nLookin' for a fan base that's no longer there\nI know that you're scared, and you're hidin' up in the cut\nBut this is freedom of speech, nigga, tell 'em what's up\n\n[Outro]\nWord, nigga! Fuck John Ashcroft!\nNigga, fuck Fox News! Fuck those snake-ass bitches!\nTryin' to manipulate your opinion, tellin' you what to think\nWord the fuck up!\nLike, \"We invaded niggas ‘cause we wanted to free them.\"\nYou racist mothafucka!\nYou don't give a shit about those people\nYou can suck my dick! (hahahaha)\nAnother rum and coke at the bar, nigga!\nIt's my day off, word up!\nFuck, for the kids, (ha) for the kids (hahaha) Beat Bandits!", "image": "https://images.genius.com/c628c98f9d53f039b060e7f0369c15b4.220x220x1.jpg", "album": "Revolutionary Vol. 2", "year": "2003-11-18"}]}