{"artist": "Yung Ro", "songs": [{"album": "Welcome to Nobody Land", "image": "https://images.genius.com/a3621ce8171d94bca6d1e12de28ce669.389x389x1.jpg", "year": null, "lyrics": "[Mixing by OG Ron C]\n\n[Yung Ro]\nYou dont really want beef with us\nCause we the only niggas that's beatin us\nLate night at my spot, we meetin up\nEither the block or the booth, we heat it up\nAnd I'ma heat it up, plus eat it up\nWith my heater up, ready to heat it up\nShow me a mill and I'll eat it up\nPlus me and my niggas can't eat enough\nAnd I'ma run this race til my features bust\nOverload the gas and mash, til I crash\nOr my meter bust\nI can see it, I'm goin, my meter's up\nMy adrinaline pumpin, to feed the stuff\nBut your a female dog, and I don't feed the pup\nMatter of fact, I really don't need a pup\nKick the ho out the door, and I recieve a nutt\nYou say me and what?? Him? wassup?\nDawg I'm bout to EAT 'em up\nNaaaw I'm bout to BEAT 'em up\nBut I dont wanna scuff my Fila's up\nCut ya speakers up, til the tweaters bust\nNobody language, we and us\nAnd I fuck with Nobody but We and us\nBut yall think Nobody means me and what?\nLook, 1, 2, 3, Noobooody!\nWho fuckin wit us in this muthafucka? Noobooody!\nPut a hollow tip, put it in your boooody\nFlip my tongue, got 'em like - Oh Gaaaawdy\nHe's on fire, look STOP\nLet me slow it down and change the flow\nCause it really ain't no thang to roll\nChange the flow, cause I am the flow\nI AM the Ro, It's Cammron Ro\nIn a land where No-Boooody lives\nYou should see what goes in-siiide of here\nAlotta straight prayin, Alotta tears\nGet the fuck up outta here\nNobody's allowed, and you off limits\nI spit the real, and you talk gimmick\nSome about cash, you about pennies\nI'm about women, cash, and checks\nAss and sex, hash and wet, blastin Tecs\nYou outta line, your rent is due, and you past the debt\nMath and sweat, grind on a everyday thing, way down in Tex\nAnd that's it, Naw nigga\nCause even if I ran outta shit to say\nI just hit Cham on a 2-way\nAnd tell 'em to throw me click, Okay? (I'm ready)\nYall don't wanna see 'Ro come\nWith four guns, then blow some\nOne into no one, Nobody did it\nYou can't find NO one\nA snitch, not even a bitch\nCause soon as it's over, and court is ajurned\nWE - will go and find an Attorney\nAnd wet 'em up like a shern Sweet\nWe don't turn cheeks, we burn beef\nThink about it, who really got beef?\nMessin with me, you get shot B\nNooBooody! Who got me?\nYou don't want it with us!\nYou don't want it with we!\nYou don't want it with me!\nYou don't want it with C\n\n[D-Black]\nShiiiiiit\nThey don't want it with D\nDash capital Black lettas\nYou betta watch them cats in the back of us\nCause we always keppin our gats with us\nThey don't know Mista Maximus\nCause if they did, then they wouldn't get out of line\nIf it's plex, we'll get out the nine\nThese cats must be out their mind\nLook at how we spit out this rhymes\nThey don't wanna see black come\nWith a black gun, when I clap one\nInto ya back son, cause Black's dumb\nNow that's done\nCause you could get his with a hotshot to ya facial features\nSo stay in ya place while I sip on a ?? and peep our prey like creatures\nNow I'm back with the Glocks out\nBetter cover your ears, cause we knock loud\nIf we go, toe to toe, you get knocked out\n??? you get blacked out\nBetter watch out now, Cause nothin says bustin\nLike ??? cousin, gotta ounce on the stove and\nA key in the oven, these bitches be lovin\nThe way that we comin\nIf we peep then we bustin, No need for discussion\nI think that your bluffin, we keep the adrinaline rushin\nI ?? backwards, then I go backward\nCause it's some serious fuckin\nI could pull your bra without even tryin\nAnd we can take flight, without flyin\nAnd we could cook chickens, without even fryin\nAnd we could shed tears, without even cryin\nBitch, These ?? G's Recognize that Nobody is us\nWe come with Nobody with us\nSo you niggas no it's Nobody but us\n\n[Chamillionaire]\nAy..\nI'm allergic to pussy ass niggas\nAnd pussy ass niggas always be the one tryin to come around\nI'm not some kinda gynecologist\nSo I'm not gunna sit, here and be dealin with all you vagina's\nAllergic to niggas who be thinkin bout jackin\nThem be the main niggas pullin up beside us\nSay 'Ro ahh - ahh - chu (gunshot)\nHand me the gat and maybe that'll clear my sinus\nCan't see me, I promise\nIt's kinda like ya eyes is, starrin off into your eye lids\nWannabe riots\nI don't see yo team, cause them niggas be invisable as my smile is\nNigga be quiet, My team we some grinders\nI'm the King, I'm ya highness\nAnything ya can think of, I'm probably the king of\nLike Krunk music and Lil'Jon is\nPlaya I promise, You can search, but won't find it\nAround me, the sicker my rhyme is\nThere's no minus ahead of what my mind is\nSo tell yo mind, to get in line and stand behind his\nHere's put it on ya mind kids\nMy lyrics bring violence, so please don't buy this\nPlease don't try this at home, cause it's known\nTo start cool and end up in three riots\nNigga we giants\nThere's nobody in here - YEP, Maaaan\nHe get money\nCause Nobody niggas get leaves of Chronic\nWhat about Lew Hawk man? He's dishonest\nHe probably got more speed then Sonic\nAin't talkin bout runnin nigga, he will front it\nWhat about Twin? Too much weed in his stomach\nNigga call on a hater, til he get hunted\nWhen the laws interrogate and ??? from em\nRunnin with Nobody, how you seem 'em comin?\nNigga..Koop!\n\n[OG Ron C scratches and mixes]", "title": "Y’all Don’t Want Us to Come!"}]}