{"artist": "Casey Veggies", "songs": [{"title": "Perfect", "album": "Sleeping in Class", "year": null, "image": "https://images.genius.com/aaf0da7a07e05d17ff3c822d7769bd09.500x500x1.jpg", "lyrics": "[Verse 1: Casey Veggies]\nWhen I was younger, I dreamed of flying, an acrobat\nDreaming, uh, scheming, imagine that...\n\nI never say never, that's lack of ambition\nLining out tracks, I'm rapping like I'm fishing\nSaw Customized Greatly? I was tryna do it different\nYoung kid doing me, it's like I'm rappin with a mission\nPassing through the hood, I knew niggas from the city\nThat ain't really had nothin', so they started bangin' 60s\nMy big cousin told me gang-banging ain't good\nI really listened to him, cause he was really hood\nHe was really in the streets, just tryna eat\nAnd I really love dude he was the realest to a G\nThat's why I'm just spittin, young star on the beat\nCause when I make one, give it to him, he make three\nI love my mama man she there for me no matter what\nNot saying she know everything I do do, but what is tough\nI ain't a bad kid, but regular ain't enough\nSo I got on my DTA, and that's something you can trust\nYeah, whats up?\n\n[Hook:]\nI ain't perfect, but I'm workin'\nI ain't perfect, but I'm workin',*I'm not perfect but,*\nI'm not perfect, but I'm workin'\n*I'm not perfect but I'm working...*\n\n[Verse 2:]\nPocket full of dreams, was it love or was it lust?\nMountain of success, all the rest ain't enough\nI ain't sus, but salty niggas is wack\nJust put my shades on and threw on my all black\nWas always a cool kid, always know how to act\nShe just calling my house, I'm like what's up with that?\nAlways played ball, but then started to rap\nI don't know what to love less, so father what's wrong with that\nFather you like my brother, I be seeing you and me\nI can take care of myself, but at the end it's you and me\nI'm so ambitious, my mom said that's true\nCause no matter what, I'm gonna do what I do\nGirl you say you love me, then what you gon' do?\nCause I can't play games, and if not we through\nI ain't sayin' I'm right, but what you want me to do?\nAin't nobody perfect ask some girls in your crew\nI was there for you, you was there for me\nBut now I feel alone, guess that's how it's gonna be\n\n[Hook]\n\n[Verse 3:]\nHave you ever just been irritated with life\nIf I spit it from the heart then it'd be alright\nUsed to see her all the time, now I swear she's outta sight\nAnd I can't even give her a phone call outta spite\nFor myself, but it's cool alone good for my health\nAnd as I look into the future it is good for my wealth\nI'm so focused on my life, I'm enjoying myself\nThe new champ of this rap shit, I need a belt\nDamn\nAll my niggas tryna live life perfect, get on the stage go and do your thang don't get nervous\nFor a purpose you gotta find, I feel like I gotta shine\nDiamonds are forever, used to play that shit all the time\nIt's Young C. Veggies, I'm ready I'm on my grind\nAbout to kill them all, I'm spittin that Columbine\nFosho for the dollar sign, fosho girl I'm outta time(?)\nMy mind is somewhere else, I'm workin, I'm tryna find myself"}]}