{"artist": "R. Kelly", "songs": [{"album": "TP-2.com", "year": "2000-11-07", "lyrics": "[Chorus]\nDon't you say no tonight (ooh)\nDon't you say no tonight (don't you say no, baby)\nDon't you say no tonight (don't say it)\nDon't you say no tonight (no)\n\n[Verse 1]\nAfter cheesecake with all of your friends and family\nWho's gonna front the bill? Me\nValet your gator at the club, plus buy you drinks\nWho gon' show you love? Me\nSpend lots of money wining and dining in expensive suites\nCompliments of who? Me\nOpen doors, take you to the movies, treat you like a beauty queen\nNow it's time to please me\n\n[Chorus]\nDon't you say no tonight (don't)\nDon't you say no tonight (don't you say no, babe)\nDon't you say no tonight (mmm)\nDon't you say no tonight ('cause I'm ready to go)\n\n[Verse 2]\nAlways dropping you off at the beauty shop\nWho's gonna pick you up? Me\nI be's there, nigga you can call on around the clock\nWho gon' be that thug? Me\nTook you shopping down in Cancun first class\nWho gon' keep you frost? Me\nBuying flowers, acting like we lovebirds\nAll I wanna hear right now is you saying the yes word\n\n[Chorus]\nDon't you say no tonight (no)\nDon't you say no tonight (don't you say no)\nDon't you say no tonight (not tonight)\nDon't you say no tonight (not when I'm ready to go)\n\n[Bridge]\nBaby say the words I want hear\nThis can be kept between me and you\nBaby give me something I can feel\nI've waited long enough\n\n[Chorus]\nDon't you say no tonight (don't say)\nDon't you say no tonight (don't you say no, baby)\nDon't you say no tonight (not right now)\nDon't you say no tonight (not tonight)\n\n[Bridge 2]\n(I been doing these things for you, now what you gon' do for me?)\nI ain't trying to spend no cash if you ain't spending that ass, no\n(I been doing these thing for you, now what you gon' do for me?)\nI ain't going down on you if you ain't going down on me, no\n(I been doing these things for you, now what you gon' do for me?)\nSay you wanna take first-class trips\nWell I wanna work those first-class hips, yes I do\n(I been doing these things for you (yeah)\nNow what you gon' do for me?)\nYou wanna ride all in my truck\nBut you don't wanna let me fuck you\n\n[Chorus]\nDon't you say no tonight (don't you say no)\nDon't you say no tonight (don't you say no)\nDon't you say no tonight (not tonight)\nDon't you say no tonight (not when I'm ready to go)\nDon't you say no tonight (don't you say)\nDon't you say no tonight (don't you say no tonight)\nDon't you say no tonight (we're spending all of this time)\nDon't you say no tonight (watching these movies)\nDon't you say no tonight (if we're not gonna bump and grind)\nDon't you say no tonight (I'm gon' get some sleep)", "title": "Don’t You Say No", "image": "https://images.genius.com/5acbe804ec2fa1b1dc93fe639f643117.640x640x1.jpg"}]}