{"artist": "Ant Banks", "songs": [{"title": "U Just a Punk", "image": "https://images.genius.com/992e30f2e51c18bd369b9f8badc632a5.772x768x1.jpg", "album": "Sittin’ On Somethin’ Phat", "lyrics": "Yeah, c'mon, yeah\nSome of this ol' hype shit, you know what I'm saying?\nFuck with it, punk nigga, yeah\n\nHere we go with this ill shit, I knew I had to kick it\nBout these punk ass niggas in the town thinking they wicked\nIt's my time, thought I couldn't spit rhymes?\nWell my shit grinds, so kick back and watch me get mine\nYou fake ass popping that shit but can't fade\nTalking about you're better, but nigga who's getting paid?\nSo wake up, your wack ass is weak as fuck\nRaise up off my fucking nuts cause nigga your shit sucks\nFake rapper with your fat-ass ego\nBoy you ain't moving shit in the E-A-S-T O\nCause it's the city where the boys side, fool\n(Awwwwwwww shit!) Now you know what they riding to\nStraight funk from the Crew that's Dangerous\nAnd punk niggas like you can't hang with us\nSo get your bitch ass back before you get smacked\nWith the motherfucking rat-tat-tat-tat-tat\n\nMotherfuckers don't fuck around, with the big Banks from Oaktown\nMotherfuckers don't fuck around, or your punk ass will get beat down\n\nYeah, it goes down in the motherfucking town of Oakland\nTry to clown and your ass gets smashed and smoked and\nA lotta niggas I know grew up straight marks\nNow they think they hard\n(Nigga what's up, you want some funk, what's happening boy?)\nRolling with the crew, niggas deep as fuck\nBut when the shit goes down, your ass gots to cut\nPunk nigga needs his ass kicked\nShow that noggin on my block and I'm a blast it\nCause I done had it with the bullshit\nYou tapping all that lip, you wanna scrap, you getting fooled, bitch\nThink you tough with the shit you talk\nBehind a nigga back, ain't setting it off\nYou wanna go toe-to-toe come with it\nOh I forgot, you just a punk, forget it\n\nMotherfuckers don't fuck around, with the big Banks from Oaktown\nMotherfuckers don't fuck around, or your punk ass will get beat down\n\nI know you jealous of my crew and that's funny as hell\nAnd all the hoes in the town know it's easy to tell\nYour bitch is creeping to my house on the late night\nSucking on my dick like a motherfucking base pipe, yeah\nThat's why I'm like breaking it down to ya\nThe whole click is making their rounds, nigga\nTramp slut with the big ol' butt\nDrinking gallons of nut, so boy you know what's up\nStop fronting, and playing them bitch-ass games\nBefore your ass gets smoked and I ain't playing no games\nDon't trip just because you know I'm talking to you\nAnd when my boys catch you slipping, your ass is through\nCause I come from the crew that's Dangerous\nAnd punk niggas like you can't hang with us\nSo get your bitch-ass back before you cold get\nSmacked with the motherfucking rat-tat-tat-tat-tat!\n\nYeah, punk motherfucker, know what I'm saying?\nDangerous Crew in that motherfucking ass, nigga\n\nMotherfuckers don't fuck around, with the big Banks from Oaktown\nMotherfuckers don't fuck around, or your punk ass will get beat down", "year": null}]}