{"artist": "Sky Wikluh", "songs": [{"year": null, "lyrics": "Kad setim se odakle je krenulo, koliko se stvari promenilo\nOd nule do cele priche, kad svi znaju koji si car\nI kad znaju da si iscimo sebe do kraja, znaju da si pobednik\nOvi napadi panike pogorshavaju se svaki dan\nDlanovi znoje se, razmishljam na shta se zhalim sada\nDo pre dinu dana nisam imao leba da jedem\nDo pre dinu dana, pravo da vam kazhem, nije bilo ni bog zna shta da se jebe\nOrtaci me gledaju kako sam istripovao sranje\nNa sto litara piva dnevno, kao, viklere, treb'o bi malo manje\nOtkino, mozak cao, vidimo se juche, polako lagano momak\nTi si javna lichnost, pa da, pijan i poznat\nNaduvan kao svinja, teturam se. padam. neko snima\nRibe prevrcu ochima, a opet mogu svaku da imam\nHi 5, ortaci u prolazu kao bacaju neki rispekt\nI chim prodjem bice, taj skaj je jbn mentol bre\nI ne secam se dogovora, planova ni svadje sa bivshom ribom\nKo je jebe, a da. sad se jebe s drugim poznatim tipom\nOdakle je krenuo, gde ide na kraju stoji upitnim\nZa sad znam da je super, ovaj dan je moj, ja sam pobednik, slushaj to\nKlaustro i agorafobobija, to sam ja, lice s tva, iz novia\nMozak, mm, i dalje saradnju odbija\nI dalje pijem ko svinja, izgleda to prodaje ploche\nIzuo eksere, otkin'o povario boga oca josh uvek loche\nJebeno me smaraju ponekad svi, treba mi mir\nZnam da to nekom nisu problemi, ali ludim ljudi, verujte mi\nSuper mi, kao muzicar jel? kao furam sharenu lazhu, jel?\nA to shto sam sahranio caleta pa isto veche na gazhu\nPa takvih sranja josh kilo, jbt gubim svest\nAl borim se da opstanem, to je bes na sve\nTo je les Džek + Becks na eks\nI ne pada mi na pamet da budem genksta, krimialac\nVikler odlichno zaradjuje, mozhete ga zvati calac\nIzdrzhavam, chupam se, ne znam kuda na kraju, i dalje je upitnik\nTeshim se, i ovaj dan je moj jer ja sam pobednik\nI niko mi to nece uzeti jer kidam, shibam k'o lud\nChuj ko? odavno sam ti ja prolupo skroz\nIpak kad setim se bude mi drago\nJosh jedam dan, josh jedan pobeda\nBilo je vreme sad mi je 26, sve vreme radih na tome da krene\nI ne da je krenulo, burazeru, ja ne vidim kraj\nFamozni vikler skat, svi znaju ko je taj\n\"hocu josh\" vichu mi \"daj\"\nImam sve shto mi treba, ne zhelim tudju dragu\nNisam karijeru ostavario zahvaljujuci jebenom porodichnom blagu\nStvaram epove, sagu, ne prodajem maglu\nBio u paklu, zhiveo ko daklu al vishe ne zivim u strahu\nJer kad setim se odakle je krenulo\nA sad znash da si pobednik i da si pobednik i da si car to znash, to da!\nOd nule do cele priche, kad svi znaju koji si car\nI kad znaju da si iscimo sebe do kraja, znaju da si pobednik", "image": "https://images.genius.com/ee2904df18d0e9f24a226140c7df893b.600x600x1.jpg", "album": "Ortaci Ne Znaju", "title": "Pobednik"}]}