{"songs": [{"album": "Friday Night Lights", "year": "2010-11-12", "title": "2Face", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg", "lyrics": "[Produced By Syience]\n\n[Intro]\nHey I got a dolla and a dream\nBut its all a nigga got so its about that green\nAnd I'm all up in that spot\nHey\n\n[Verse 1]\nYeah the mental state of a young black genius conflicted\nThe fast life I done seen on the screen is addictive\nMoney and clothes I done dreamed about\nAnd all the hoes that I fiend about\nEy tell me am I wrong for visualizing material shit I never had?\nWaving gats instead of flags, the American Dream\nWhy do we cling to the villains?\nKnowing they kill 'em\nMy niggas high enough to swing from the ceiling\nInk from the pen spilling on my notebook\nFilled with dreams, this is my hope book\nStill the screams from little girls shot and killed fill my head on the daily\nAt times I question God can you blame me? They can’t tame me!\nMy voice screech through the street..I'm a beast on em!\nOh no he will not fold, you will not see a crease on him!\nHe will not slip or lose his grip, they got them cleats on him!\nBut never will he run unless you call police on him\n\n[Hook]\nOne time, two times, three times\nSometimes I scrap sometimes Im throwin up the peace sign\nIts two sides to a nigga though\nI said Its two sides to a nigga yo\nAy look sometimes I'm feeling high\nThen I'm feeling low\nLord will I die will I survive let a nigga know\nYou say you know me but what side did you get to know?\nIts two sides to a nigga yo yo yo\n\n[Verse 2]\nYeah some pussy niggas pulled out on me and my mans\nWasn’t for the pistol we drop em right where he stands\nBut still we never ran, foolish pride made us stand right there\nNot understanding we could lose our life there\nAnd then it hit us, thinking bout the close calls from long distance\nUgh as lil niggas in the Ville we was trippin\nType of nosy ass niggas to watching the fight until its over\nThey ran when the gats came out, I moved closer\nFoolish what was I thinking? wasn’t trying to be cool, its\nJust the thrill of the danger get so filled up with anger\nWhen a stranger get to violating\nHe sleeping on me wide awake, bitch I'll annihilate him\nI'm tired of waiting on my ticket out this mothafucka\nHope they don’t kill me before I get up out this mothafucka\nI gotta go\nNow can I be that nigga I thought I was? I gotta know\nWill I make it like I thought I would? I gotta blow\n\n[Hook]\nOne time, two times, three times\nSometimes I scrap sometimes Im throwin up the peace sign\nIts two sides to a nigga though\nI said Its two sides to a nigga yo\nAy look sometimes I'm feeling high\nThen I'm feeling low\nLord will I die will I survive let a nigga know\nYou say you know me but what side did you get to know?\nIts two sides to a nigga yo yo yo\n\n[Verse 3]\nYeah I seen heaven, seen hell\nThe two faces of the Ville\nOne side dreams, the other sides real\nOne side schemes, the other side deals\nWhat the pain brings another mother cry still\nWhy the fuck am I here God?\nThat nigga died why the fuck am I still alive?\nI feel ashamed cause the good Lord done brought all this success to me\nAnd all I seem to focus on is all this stress on me\nBless homie we breathin\nCold world got me sneezing\nWrote this when I was broke so hey I guess we even\nThrowin' blows fighting demons trying to stop from bustin semen\nIn an unfamiliar bitch I know my niggas feel this shit\nHow could I fuck her raw? And I just met the ho\nMy dick took over it ain't never felt this wet before\nIm stressing in my mind but its way to late to stop it\nMake this shit so bad, I had a condom in my pocket\nLets change the topic\nBefore I go berserk\nI’m so alert, riding down 95\nNaw I ain't finna to go to work\nI’m headed back home ain't staying that long\nI’m chasing dreams shawty im paying back loans\nI’m paying dues that a nigga paying tax on\nIm tryna blow like a nigga playing saxophone\nI'm playing daddy to another niggas daughter\nDon’t worry even Jesus never saw his real father\nIt don’t bother me at all though\nYeah say it don’t bother me at all\nThey got me thinking bout my mom though\nMan I can't wait to sing this song I be like, I be like\n\n[Outro]\nHey don’t cry hey ohh no\nWe ain't gotta worry bout the money no more\nWe ain't gotta worry bout how them bill get paid\nWe ain't gotta worry how the meals get fed\nHey don’t cry hey ohh no\nWe ain't gotta worry bout the money no more\nWe ain't gotta worry bout how them bill get paid\nWe ain't gotta worry how the meals get fed\nHey Hey Hey"}], "artist": "J. Cole"}