{"artist": "Doughboyz Cashout", "songs": [{"title": "Numbers", "album": "We Run The City Vol. 2: Floodzone ", "year": null, "image": "https://images.genius.com/59f198bec988a12b66d3578574d37830.600x600x1.jpg", "lyrics": "[Verse 1: Payroll]\n\nI’m in a 550, countin’ my cash\n20 in my lap, another 50 in the stash\n8 for the bow’s. 25 for the slabs. Hit the mall and buy whatever I can grab\nTru’s stuffed with rubber bands. Stakes courtesy of my trap\nI’m trying to count it in the coupe; I think I need 2 laps\nLook at the fit you can tell that I move packs\nI fucked a lot of bad hoes and knocked down a few rats\nNiggas want to mug cause my belt and my shoes match\nThe Vette jet black and you know that the shoes match\nPull up in a spaceship, the hoes like “who that”\nThose fake chains popular but we don’t do that\nWe throw 10 carrots in one charm, 20 tattoos on one arm\nFit 30 in one car, spent 10 in one bar\n100 round clips if these bitch niggas want war\nCall up the plug tell him “spend em I need more”\nYou know I’m all out. We can buy through a drought\nI call shots from my couch. Garbage bags full of stacks. I couldn’t tell you the amount\nNot cause I’m counting slow but it’s way too much to count\n\n[Hook]\n\nMy trap doing numbers; My phone doing numbers\nSell it for the high; get it for a low number\nOn the back of the coupe of you niggas see is numbers\nYou say you need some work. Nigga you the number\nAll I talk is numbers\nAll I know is numbers\n\n[Verse 2: Mack Nickles]\n\nMy spot doing numbers; my block doing numbers\nI ain’t gone lie; I dun shitted 12 summers\nI been getting money so they calling me a vet\nWhat I paid for the piece I could of cashed out a Vette\nWhen the bows got slow I ain’t slack on the bils\nI hit the stash; spent 60 racks on the pills\nMack ain’t a slacker. I’m a Ziploc packer\nFashionista , hushy jeans, Louis sneakers\nI put you on last week, damn you moving slow boy\nYou ain’t really getting cheese. You don’t fuck with Doughboys\nTo be honest; I can see you low boy\nDude you need to chill out. You better ask Lo boy\nThese ain’t lies; I spit the truth. $650 for the belt, yea receipts tell the truth\nI get it for the low but I sell it for a high number\nOnly way I fall off, they gotta put a kid under\n\n[Hook]\n\n[Verse 3: HBK]\n\nFlying down Six, switch whips to the 6, 16 in the clip that’s wishing a nigga a trip\nSwooped up a bitch, and we about to pop a fifth\nEverytime I drop a whip she calling to mop a dick\nShe call me number 2 cause she know that I’m the shit\nShe glanced at my wrist, she asked if I’m selling bricks\nYou know what it 2676 I’m on seven deuce where nigga getting rich, hitting licks\nCall up the plug; nigga in his late 30’s\nI'mma be there 8:30 to pick up 8 birdies\nI got it bitch; you heard me\nNextel service need work nigga chirp me\nYou broke niggas irk me\nPosted on the block when I turned 17. Bows of kush for 7 G’s. Knots in my Seven Jeans\nKeep a spot with some hoes\nGot em taking of the jo’s\nGetting loose for my bro’s\nCause we making all pros\n\n[Hook]\n\n[Verse 4: Doughboy Roc]\n\nFuck them other niggas, I’m just trying to get paid\nRock a crispy as Taper; I don’t fuck with them fades\nWe gettin bread like wonder. All I talk is numbers\nYou get to talking; nickels on yo head (quick numbers)\nYou make your money double but I make my pro’s triple\nMy worker came up short I put his ass in a (unknown word)\n24 grams, that’s a whole zip. I can get for the 6. 2 for 60 for the bricks\nLow key as whip when I’m trafficking the work; And If I’m middle manning then I’m taxing on the work\nGot a couple cell phones, yea I’m known to hit the road\nFluffy grey bo’s yea I’m know to get the low\nAK-47 hold 100 I let that hit blast. All I talk is number, I think I need to teach math\nNigga stop lying you “beginners stack” money\nI got the OT; West Virginia trap money\n\n[Hook]"}]}