{"artist": "Canibus", "songs": [{"title": "Cingularity Point (Original)", "album": "The C of Tranquility Demo", "year": null, "image": "https://images.genius.com/54d1baac58d099271d2b89cd350cd0fa.180x135x1.jpg", "lyrics": "[Hook: Canibus]\nThe C of Tranquility, what will it really be?\nWhat does the future hold? What do you really see?\nI see a revolution in the industry\nThat will ignite the rebirth of MCs lyrically\nThe C of Tranquility, what will it really be?\nWhat does the future hold? What do you really see?\nI see the partition of God's religion\nBecome united by our bars and our common visions\nThe C of Tranquility, what will it really be?\nWhat does the future hold? Yo, fuck the hook!\n\n[Canibus]\nThese rhymes resemble knots being tied\nThe timeline becomes a nonlinear noose that will snap your mind\nFirst: Sever your spine, Second: Normal limb configurations\nAre dismembered and disconnected, very unpleasant\nMy third effort employs absurd ethics\nKangaroo execution court is in session after dawn but before breakfast\nExpert effective mass burial method so well measured\nIt's impressive and intensive, not to mention expensive\nExtensive templates taken from all global nano-industrial sectors\nNo wonder I'm so aggressive at Tetris\nPardon me, but I must beckon your attention\nFor no more than several seconds with the minor hypocritical questions\nLet's say, I had to make an exception\nWhere I complied to exhume a body for postmortem autopsy inspection\nI request the best yes-men\nThat promptly recovered the radio frequency identification pin\nThen trigger the transponder located under the skin\nOf the deceased until it showed me a grin\nIf that went over your head then I'll be more than pleased to show you again\nBut I must rescind, I have pressing matters to attend\nIt's my wife's birthday and I can't be late for delivery\nOf her customized marble grey bidet, good day\nWhat the fuck did he just say? See, why can't I bust my way?\nSince '98 you could trust my name\nI've adapted and adjusted my aim accordingly\nThe leap years are boring to me, I speed up quarterly\nThe Golden Era of Rap will always be apart of me\nThe future talks to me because the present is ignoring me\nMy destiny is calling me, the armory of God is guarding me\nBut all you can see is holographic artistry\nThis is were the road forks, my rhymes leave you lost\nUnder a blue moon, ice crystals, fog, and snow fall\nBeen a long time, spitting long rhymes, but I never left you\nI always came back busting rhymes that were special\nBack then, I wanted to impress you by addressing the truth\nNowadays, I'm just confessing in the booth\nThe music is layered, not computer generated\nA human made it to satisfy unusual craving\nThe mystic in a room with crystal walls and floors\nLooking into a crystal quartz orb, reciting lyrical law\nThat cause warm feeling sensations precipitating from the finger tips\nTo the arms, to the lips, to the jaws\nTo a gold tongue that spits to the tone of the drum\nWith the oxygen that flows down the throat to the lungs\n'Til every color of my Chakra glows brighter than the Sun\nYou and I become We, We become One\nAnd the clarity of Singularity has begun\nBetween zero point zero and zero point one\nCombinatorics, anything of this persuasion\nIs considered ageless beyond the matrix\nBeyond time displacement of space and spaceships in oasis\nBeyond the reach of human contemplation\nThrough my music, magic and convoluted interaction\nRip The Jacker shows you the future in fragments\nThrough madness my view is expanded\nRequest passage permission is granted\nI'll introduce you to the language of dragons\nTo help balance near impossible trances in the labyrinth\nOf the enchanted where air quality is unbearably rancid\nFrom evil spirits, temperatures frigid\nI cross wooden bridges over methane rivers, it sounds crazy, but listen\nConcise lyrics strike down from the heavens\nA titan like Mike Tyson, 'Beastmaster' with a Tiger and Pigeon\nA four finger ring with a eyeball in it for vision\nCause I ain't scared of no 9 foot 11 winged lizards!\nI'm known as the Ripper, my soul was delivered to a wizard\nFor spiritual slave labor in a prison\nMy life is my sentence, so I live it\nBut I studied the physics and understand it, so it's only a visit\nI look at myself in the mirror, I see a stereoisomer image\nI know it's cryptic, but you like what I'm spitting\nM-M-M-M-Master in the art of rhyming, yield so many surprises,\nI've found excessive ferric-iron in my perinatal sinus\nRemote viewing the globe, what I am shown runs my blood cold\nMy occipital lobe might explode!\nThe Godzilla Zillah God, enscripter encryptor\nI drink the Elixir of Knowledge like it was a liquor!\nI ain't a rapper, I'm a Ripper Slasher, Supreme Dream Catcher\nBrother Frater who'd rather attend to other matters\nLike mastering words, spell cast a curse you haven't heard\nIncense I burn smells like a bag of herb!\nI walk among the living hidden, but spitting, they bid me good riddance\nCause nobody knows what I've written!\nZecharia Sitchin in Hell's Kitchen, heavy lifting\nMixing, vocals switching with no mittens, my women keep bitching\nBitches drug experimenting, bed wetting and blood letting\nWhite witches, black magic, rough wedding, with a fuck ending!\nI ain't into fashion, think I got jokes?\nKeep laughing, we'll have the ceremony in a cabin\nRapping my only compassion that outlasted everything I ever had in life\nAnd it still respects the Master\nDuring the brides reception, the Tree of Life supplied me the weapons\nInside the zodiac, divided in sections\nI categorized five elements inscribing the lettering\nBaphomet's unintelligible intelligence is benevolent!!\nThe initiate magician, not ready but willing\nTo perform molecular fission with emotions and feelings\nI stand before the Rabbi with cat-eyes, he looked high\nI don't mind, the motherfucker look crazy all the time\nHe asked me for the wedding band, I gave him the bride's severed hand\nPunishment for touching another man\nI'm just a poor shoe cobbler from Guadalajara\nWho came in contact with scholars that studied Kabbalah\nI do not wish to be a martyr and follow the footsteps of my father\nI want to live the live of an 'honest farmer'\nWe all became sombre as I placed the animal on the altar\nStarted the fire, rinsed my hands in some water\nLook into my eyes, I hypnotize my bride as I walk towards her\nThe congregation wouldn't take their eyes off her!\nI hear moans and weeping coupled with soft but laboured breathing\nI pinch myself, am I dreaming?\nInvisible people speaking, we've met, but I don't remember meeting\nI don't remember these traditional teachings\nI know I'm reaching into unallowed boundaries, but the rhymes are increasing\nMy mind is breaching, I find it pleasing!\nInside the Theatre of Bar War, unlimited seating\nThe kills, still fresh, the cadavers, still bleeding\nThe war drum pounds like the wings of a owl beating\nRight before it snares its prey and it begins feasting\nHow nice of you to join me this evening\nTo see the symphony for its surface complexity out of deep simplicity\nYou see, I achieve tranquility with obscure metaphors\nEntering doors not placed between walls, but in the floor\nMidnight strolls through groves of roses, sharing moments\nWith whatever hostess is closest, before the solstice approaches\nThe fire burns, but it burns smokeless\nOgres on flying locusts screaming, “Buenos noches!!”\nThe final battle with Vrill, the war cries build\nRun them over on the battlefield with chariot wheels\nMy shield is composed of meteorite stone\nMy sword is honed from a red dragon's rib bones\nRipping and spitting basic complex combinatrix\nFor the agents trying to hack into my Matrix!\nFive out of ten cases are found with their heads hacked off\nIn several places, hanging from metal braces\nLong ago, the ghost of Plato befriended me\nWith a amulet intended to anchor my memories\nTabula Smaragdina, glow greener than any known reefer\nHarness the ether, talk to your leaders\nThe seekers of beautiful bars, recording the position of the stars\nUndermining these immutable laws\nCorrelating, DNA crossed-fading, what's the point in waiting\nWe're all aging, it's yours for the taking\nA black hole in the making, nothing but a wound gaping\nFrom a womb where there's no escaping\nOnly life-forms racing before and after mating and merry-making\nWith partners that aren't even facing, what are we chasing?\nOur ancestors asked the same thing\nAnd we've gotten no closer then they've been, so I prey for the day when\nWe don't even need eyes to confirm\nThe science and the poor education we've put our faith in\nI don't write this to perform it, nor do I say it, to record it\nI feel that I am answering a calling\nFantastic, rhyme mechanics, like that of a blind pianist\nThe keys are metallic, my fingers are magnets\nThe music is magic, what is this madness?\nThe stanzas are rites of passage\nYour left brain habits become your baggage\nThe masses become savage, roaming the streets with torn fabrics\nCreativity is less than average\nEvery baby is born a bastard, so why did you have it?\nThis question requires no answer, I understand it\nThe \"C\" of Tranquility, that is all I seek\nNothing is complete without every separate piece\nThe \"C\" of Tranquility, that is all I seek\nNothing is complete without every single piece\n\n[Hook: Canbius]\nThe 'C' of Tranquility, what will it really be?\nWhat does the future hold,? What do you really see?\nI see a revolution in the industry\nThat will ignite the rebirth of emcees lyrically\nThe 'C' of Tranquility, what will it really be?\nWhat does the future hold,? What do you really see?\nI see the partition of God's religion\nBecome united by our bars and our common visions"}]}