{"artist": "Wale", "songs": [{"title": "Albert Pujols", "year": null, "lyrics": "[Intro: Rick Ross]\nBoss is my position, I got the ammunition\nAll Wale talking is Ambition\n\n[Hook: Rick Ross (Wale)]\nIn the caravan with some Latin bitches\nTalking caramel with them asses like the strippers\nOye mami, ven aca, come her for papi chulo\nLet me knock it out the park, I'm talking Albert Pujols\n(Albert Pujols, trial left two hoes up in my new muh-fucking two door\nThis shit ain't nothing new though\nI'm tryna knock that out the park, Albert Pujols)\n\n[Vamp]\nSchematic, hold the fuck up nigga\nBring that shit the fuck back\nThis the big boss Ricky Ross nigga\nWe ain't playing no fucking games\n\n[Verse 1: Wale]\nMade a million with the pen\nMake my women follow dreams, pussy popping follow head\nBitches check on my stats, women get too attached\nFuck what them niggas saying I hit whoever at bat\nJohn Rocker Atlanta's Bravest know that I'm awesome\nBet I be like Fenway out in Boston, my green is a monster\nWe don't speak to informants, they just look for a way out\nThey just hating on the game, they just way too Canseco\nGotta thank my crew, my label, everything I do they ate, Oh\nK with, who the fuck gon' say something?\nShit grand like a muh-fucking bass load\nThree strikes put a muh-fucking K up\nDouble M nigga now we up\nThree strikes like a muh-fucking C.C\nYou wife ain't shit, we G'd her\nHuh, we G'd up, G'd up\nUp in my new two door\nKnock it out the park, Albert Pujols\n\n[Hook]\n\n[Verse 2: Fabolous]\nFeel like I seen it all, but I can't say so\nBe a snitch? No way, Jose Canseco\nFace down, ass up, ain't none of my bitches planking though\nWe got stripes in my city, ain't none of my niggas Yankees though\nIt's going down in history, the way I valet two doors\nShe blew a kiss at me, I told her da le culo\nListen b, just give my stylist kudos\nAnd my consistency? I call that Albert Pujols\nShouts out to St. Louey, swag champ I got the belt\nBig H if it ain't Louie, cuffing you bitch is not gon' help\nThey asking me what I wear, I think YSL is how it spelt\nAnd I might just let you touch it if you don't go tell 'em how I felt\nReal nigga, that's just how I'm built\nFrom turning white into cream, powdered milk\nTo getting rich off a dream, I throw it the bag\nThis the Ambition anthem, I flowed it to the flag\n\n[Hook]", "album": "Live from the DMV, Vol. 2", "image": "https://images.genius.com/491702e2daec090ce56ac78c8d5f1d26.1000x1000x1.jpg"}]}