{"songs": [{"image": "https://images.genius.com/0f83f6339684287642e452f3aa527238.600x600x1.jpg", "year": "2014-03-29", "title": "All Over You", "album": "March Madness Vol. 3: Elite Eight", "lyrics": "[Intro: CrushBoys]\nBaby I can't wait to be all over you\n\n[Hook: CrushBoys & XV]\nBaby we had a time (yeah-yeah, yeah-yeah)\nWe pressed rewind (yeah-yeah, yeah-yeah)\nFor tonight (Unh, unh)\nThough I said it's over for myself [?]\nBaby I can't wait to be all over you\n(I.can't.wait.To.Be.All.Over.You.)\nThough I said it's over for myself\n\n[Verse 1: XV]\nLook, I felt like this would all work\nBreak up, hang up, make you call first\nThat's my job, so when you off work\nI take off like skrrr and you take off skirt\nKenan & Kel, they say \"you all that\"\nThe type to hang up with just a call back\nSo give the rest room, you just can't stall that\nHer ex bring up (what?), summer tell him fall back\nLay back in my ride and puff lye\nAnd don't about your ass or front side\nThen you hit me like \"baby come by\"\nI be on it in a flash, cause that's that jump drive\nAnd I can't wait to scream out \"fuck you!\"\n'Til you can't wait to scream back \"fuck me!\"\nMr., Mrs. Smith, she wished we could be\nBut she digging up the past, Angelina Jolie\n\n[Hook: CrushBoys & XV]\n\n[Verse 2: XV]\nHigh heels and high standards (unh)\nAlways saying \"hi\" to the camera (unh)\nAnd I try to say \"bye, I can't stand ya\"\nBut then you ride 'til no is not an answer\nRiding like Winona through good times like Willona\nEven if I'm still on the corner like [?]\nYou got me, I got you, you know this is not new\nWe've been this way since we came together in high school\nShe going \"Where the fuck have you been? I seen your twitter.\"\nI'm like \"who the fuck is this new friend? Is he your nigga?\"\n(Then I) then I tried to pretend that I didn't kiss her\nGet her to reconsider and witness the bigger picture\nShe replying \"like I'm all over you\nBut my eyes is looking all over you\"\nAnd then them hands is going all over you\nThen I said \"What about your man?\"\nShe said \"It's all over, you?\"\n\n[Hook: CrushBoys & XV]\n\n\n(Yeah. Vizzy. I don't know how you do it, but you do it. Yeah, you do it. You doing it right now)\n\n[Hook: CrushBoys]"}], "artist": "XV"}