{"songs": [{"album": "Friday Night Lights", "year": "2010-11-12", "title": "Farewell", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah, farewell\nHey, farewell\nAll my niggas farewell\nFayettenam\n\n[Verse 1]\nLook, some niggas let their dirt out some just keep it all in ‘em\nSo when a man dies all his secrets go with him\nAnd fade; a part of history no longer known\nDone did a lot of dirt I’ll bury with me when I’m gone\nWhen my story’s told, how will they tell it?\nWill they say I was a giver or remember I was selfish?\nWill they say I was a sinner or pretend I was a saint?\nWill I go down as a winner, what's the picture they gon' paint?\nWouldn’t say that I’m a quitter, that's one thing I know I ain't\nWill they tarnish, will they taint? Glorify me, over-think?\nSay they know me, say I’m great? Say I’m phoney, I was fake?\nSay the things about me that they never told me to my face?\nI was loved I was hated, just a nigga with a dream\nI’m a liar, I was honest, I was all of these things\nWhen I’m gone let em talk, they discussing who I am\nWhen they bury me just know I wasn't nothing but a man\nWasn’t nothin’ but a man\n\n[Hook]\nThis for them niggas climbin’ heaven's stairwell\nYeah, hey farewell\nYeh, hey farewell\nThis for niggas climbin’ heaven's stairwell\nI pray you farewell\nI bid you farewell\nYeah, hey, farewell\nYeah, yeah\n\n[Verse 2]\nIf I should die Lord this here is my will\nReincarnate a nigga send me right back to the Ville\nLet me relive my younger days just once again\nReenact my memories from every friend to every sin\nKeeping demons buried in my closet\nBut yet I put in work like a deposit on my bank account\nMy eyes lit while I think about my childhood now I'm blanking out\nThose were truly my best days\nThe only thing I had to stress was how the hell to get laid\nGradually turn into me stressin’ how the hell to get paid\nBeen making songs so long, now how the hell they get played\nOk, I’m blowing up quickly, I guess the flow is sickly\nBut yet I can’t forget my past and hope it won’t forget me\nGot good grades but A's can’t stop strays so pray for me\nPour liquor for my niggas but hey, don’t wait for me\nCause I’m trying to cheat death, she out to bury my ass\nYou know the cliche “life's a bitch” well I’m gon marry that ass\nAnd sign a pre-nup, think back to when we tore the skating rink up\nRapping and we scrapping, we got older hit the teen club\nGave mean mugs to niggas but we winked to all the girls\nThen we went back to the crib thinking we had saw the world\nNo sir, came a long way from having momma chauffer\nIt's hard to think these hoes at some point were so pure\nBut now we play the game, when it's over send me back\nI swear I’m not gon change a thing\nI swear I’m not gon change a thing\n\n[Hook]\nThis for niggas climbin’ heaven's stairwell\nYeah, hey farewell\nYeh, hey farewell\nThis for niggas climbin’ heaven's stairwell\nI pray you farewell\nI bid you farewell\nYeah, hey, farewell\nYeah, yeah"}], "artist": "J. Cole"}