{"songs": [{"title": "Eviction Notice", "lyrics": "[Intro: Young Buck]\nWe gon judge shit\nYa naw mean?\nIts my motherfucker\nIts my motherfucker shit this\nThis is what the fuck the worlds been waitin on\nYa think I ain't finna get out here\nLook at all these motherfuckin people out there man\nStraight up and down\nThey got they hands up in the air baby\nAnd they love me, Young Buck\nOh I'm on my grind now, yea!\nI'm feelin myself with this shit, woohh!\nHey! (hey, hey)\nPut your motherfuckin hands up\nAye! Put your motherfuckin hands up, yea!\nAye, look at them people out there man!\nAll them people up top!\nAll my people in the back!\nStand up, let's go!\n\n[Verse 1: Young Buck]\nDedicated street nigga, you can hear my voice echo\nFrom the penitentiary walls to the ghetto, rider!\nMan of the house I'm the provider, I'm Yayo\nOnly Banks I need is Tyra, (only Banks I need is Tyra)\nHood nigga fresh in this butterfly collar\nIts why your baby mama wanna holla\n0-60, 72 Chevelle now fuck with me\nThey miss me\nIf I die tonight, I made history\nI quickly, pack my bags\nMade my flight, went n got my cash\nCame out right, like I just popped tags\nSo that’s the reason, why I'm not mad\nBottles in the air, I just dropped my glass\nThe fake gon' hate, but the real gon' last\n(Its gonna take a while)\n\n[Bridge]\nIt ain't me home boy, it’s the South that wrote this\nThey found out about my eviction notice\nMy eviction notice, (what happened Buck?)\n(ha, ha) They found out about my eviction notice\n\n[Chorus]\nI'm gon' party till they put my ass out\nGet in my Ferrari, and I'mma mash out\nAsk anybody, you know what I'm about\nThis what I do! (This is what I do!)\nThis is what I do! (This is what I do!)\n\n[Verse 2: Young Buck]\nFrom the big excitement\nServin y'all like a federal inditement\nI'm seein how I feel on top, and I like it\nLet em hate on, I get my Kanye on\nI'm a big boy, listen to my Andre song\nNever have tried get back I spent\nOr have to borrow every cent try to pay my rent\nMy boo, tell em bitch what I do\nEven you can't count what Ive been through\nAnd I never will talk about what I knew\nOr no, its just some shit you don’t do\nLets roll, I __?__ where the rappers don’t show\nThe heart of a humble hero, getting doe\nToo slow! I already got em on the floor\nWith they __?__ in the air, and we blowin on the dro\nYeaa we blowin on the dro\n\n[Bridge]\n(Hey take the choir) It ain't me, the West Coast wrote this\nThey found out about my eviction notice, (aye you hear that?)\nMy eviction notice, (damn they kicked you out Buck?)\n(Yea, fucked up) They found out about my eviction notice\n\n[Chorus]\nI'm gon' smoke my weed till they put my ass out\nI got cheese, it’s why I'm pullin cash out\nIts ten a key, you know what we about\nIts what I do (This is what I do)\nThis what I do! (This is what I do!)\nHeeey!\n\n[Verse 3: Young Buck]\nThe coupe devilish red, I'm getting my bread\nTakin flicks, with no signs I'm sending to the feds\nI ain't shy about the money\nDidn’t lie about the money\nCause I am the money\nI die for my money\nReal niggas ride for me like I gassed em up\nRight out the hoe, when my ass is stuck\nIt's all over now nigga, I ain't stoppin, for what?\nOr who? Don’t talk too much I'm not you\nFuck these haters, I'm tryin to out live my paper\nBig block my Chevy with the inside gator\nThe state seemed bigger, I was just one nigga\nLet's ball I'mma get at them later\nPay attention to the city, I'm the motherfuckin Mayor!\nShawty fuck with me I'm a motherfuckin player!\nHey! I'm a motherfuckin player!\n\n[Bridge]\nNaw, It ain't me, the East Coast wrote this\nThey found out about my eviction notice, (ayee, damn)\nMy eviction notice, (aye you heard about that?)\n(fucked up) They found out about my eviction notice\n\n[Chorus]\nLet's pop these bottles till they put our ass out\nThrow these dollars, when we pullin' cash out\nYou don’t want no problems, you know what we about\nThis what we do (This is what we do)\nThis what we do! (This is what we do!)", "album": "I AM TN - Young Buck Edition", "year": "2012-09-21", "image": "https://images.genius.com/ef640e81bc8c2642cf295c57b50fc99d.640x640x1.jpg"}], "artist": "Young Buck"}