{"artist": "C-Rayz Walz", "songs": [{"title": "Pink", "album": "Year of the Beast", "year": "2005-05-17", "image": "https://images.genius.com/566d299c2471c83ab1595731e9242047.1000x1000x1.jpg", "lyrics": "C-Rayz Walz ft. Jean Grae - “Pink”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): Belief]\n[Hook/Vocals: Jean Grae]\n\n[Hook: C-Rayz Walz and (Jean Grae)]\nYou ain’t\nA thug.  (You just acting bugged) ‘cause you\nWant a hug from shorty, (but she don’t got love).  And when you\nGot slugged, she said, (“It must be drugs.  That ain’t my)\n(Man.  Why’d you fuck him up?”)  Pink.  You ain’t\nA thug.  (You just acting bugged) ‘cause you\nWant a hug from shorty, (but she don’t got love).  And when you\nGot slugged, she said, (“It must be drugs.  That ain’t my)\n(Man.  Why’d you fuck him up?”)  Pink, pink\n\n[Verse 1: C-Rayz Walz]\nOh, you a thug now?  ‘Cause you involved in gunplay\nWifey acting funny like the bus on Sunday\nWanna make a U-turn?  Dummy, this is one-way\nYo, that’s your man?  Hmm, I think he’s gay\nYou thought you was tough like them guys who robbed you\nFronting like you sell drugs, you know you got a job, duke\nAlways ice-grilling, fucking up the barbeque, fronting\nWith your boys like, “That’s the murder-drama crew.”  It’s chumps\nLike you that give us a bad name, telling my\nLife’s story in your weak/week rap game.  I know\nYou was watching me.  I used to see you peep.  You was\nSo interested.  Why you ain’t never sleep?  It’s deep\nIt goes back to childhood in the streets.  You was\nLying ‘bout pussy, beating your meat.  Imagi-\n-nary friends, things you did, places you be.  Basic-\n-ally, you the same thing that gave birth to me (Pussy, pussy)\n\n[Hook: C-Rayz Walz and (Jean Grae)]\nYou ain’t\nA thug.  (You just acting bugged) ‘cause you\nWant a hug from shorty, (but she don’t got love).  And when you\nGot slugged, she said, (“It must be drugs.  That ain’t my)\n(Man.”)  Pink.  You ain’t\nA thug.  (You just acting bugged) ‘cause you\nWant a hug from shorty, (but she don’t got love).  And when you\nGot slugged, she said, (“It must be drugs.  That ain’t my)\n(Man.  Why’d you fuck him up?”)\n\n[Verse 2: C-Rayz Walz]\nAll the\nThugs I know is really into calmness while y’all\nWanna walk by and scream, “Onyx!”  Boxing\nOxygen, making gunshot noises\nTalking to yourself like you really hear voices.  You\nThugs is killing me.  I only fear God.  You think you\nLook tough?  In my eyes, you got on leotards.  Keep\nPlaying the role, yeah, get your head bent ‘cause you\nSo pussy, you could get pregnant.  It’s\nSad.  You act like your gun blast math, but you the\nSame one that used to get hurt for your bus pass.  It ain’t\n2Pac, four.  Y’all just followers.  Thanks to\nJa Rule, we got a whole bunch of \"Hollarers,\" dollar-\n-borrowers, gold chain gossipers, Acade-\n-my Award killers who deserve Oscars.  Y’all ain’t\n‘Bout it, but since your fronting got no limit, I see the\nFuture—wait, you about to die in a minute\n\n[Hook: C-Rayz Walz and (Jean Grae)]\nYou ain’t\nA thug.  (You just acting bugged) ‘cause you\nWant a hug from shorty, (but she don’t got love).  And when you\nGot slugged, she said, (“It must be drugs.  That ain’t my)\n(Man.  Why’d you fuck him up?”)  Pink.  You ain’t\nA thug.  (You just acting bugged) ‘cause you\nWant a hug from shorty, (but she don’t got love).  And when you\nGot slugged, she said, (“It must be drugs.  That ain’t my)\n(Man.  Why’d you fuck him up?”)\n\n[Verse 3: C-Rayz Walz]\nYou need a\nWhole borough, black, to fight one thorough cat.  You wasn’t\nBroke and hungry—that ain’t why you started selling crack.  You’re a\nClown.  You wanted to be down to sound gritty\nYour life was inspired by New Jack City, King of New\nYork, Mobb Deep, DMX, and Biggie\nI’m tired of you cowards.  I’ll fuck you up!  Menti-\n-roso.  You know, in jail, you was butt.  You wasn’t\nManito.  Uribe then stuck you up.  Real\nVolcanoes don’t smoke—they just erupt.  No\nPhone calls for you.  They would have cut you, plus you\nSuck.  No, really.  You suck\nBulletproof vest, man?  You need D-cups\nAnd just like this song, you’re funny, son.  Woke up\nIn your cell, laying next to Snickers and honeybuns.  You just\nWanted attention like a live Giga Pet, so to\nLook the look, you started smoking cigarettes.  You never\nUsed to puff weed, true indeed, ‘til you heard Boot\nCamp.  Now it’s like, “Yo, what up with the trees?”  They’re in a\nForest—same place your corpse gon’ be ‘cause\nFantasy never brings L-O-V-E\n\n[Hook: C-Rayz Walz and (Jean Grae)]\nYou ain’t\nA thug.  (You just acting bugged) ‘cause you\nWant a hug from shorty, (but she don’t got love).  And when you\nGot slugged, she said, (“It must be drugs.  That ain’t my)\n(Man.  Why’d you fuck him up?”)\n(You just acting bugged)\n(But she don’t got love)\n(“It must be drugs.  That ain’t my)\n(Man”)\n\n[Outro: Jean Grae]\nCome on, man.  You ain’t no goddamn thugs.  “But she not in the streets.”  Why everybody gotta be from the streets.  Y’all playing from the sidewalks, y’all living in the streets where the cars at.  Come off this, please.  Haaa.  I be sighing.  It’s hot.  C-Rayz, I’m out of here.  I want my money for this"}]}