{"songs": [{"image": "https://images.genius.com/f3dc932dcf3a3d218d8e387297bf5afe.1000x1000x1.jpg", "title": "Thinking", "album": "The Search", "year": "2019-07-26", "lyrics": "[Verse 1]\nYeah, growing up, yeah\nKnow a lot, but I don't know enough\nWhat you doin' here?\nWhy you even showin' up? Yeah\nShowin' up for tryna show me love\nWhy you look confused like you don't really know what's up? Yeah\nWhy you always tryna judge?\nI know who you are, yeah\nWhy you tryna, tryna front? Yeah\nI am not the man I was, look\nAyy, made me a promise, I just hope you keep it\nI don't like to get involved with things I don't believe in\nI don't like to hang with people I don't trust to speak with\nIf you tell me that you mean it, then I hope you mean it\nYeah, feel like I don't deserve you when I hurt your feelings\nI'm vulnerable, you got the keys to open all my secrets\nYou've always been there when I'm low to help pick up the pieces\nI know I act like I don't need you yet, but lately, I've been thinking\n\n[Chorus]\nYeah, lately, I've been thinking\nYeah, yeah, I have been thinking\nYeah, I have been thinking\n\n[Verse 2]\nYeah, I wish that I was optimistic\nI wish that I could trust my intuition\nTo most, negative thinking makes you a pessimist, but\nTo me, negative thinking means I'm just realistic\nThat's how I feel, ain't that a twisted view?\nClaim that I don't care what people think, but is that really true?\nThose the type of questions that I struggle with\nThat's the type of thing to keep me up at night\nWondering, I wonder if the pressure I've been under is too much on my shoulders\nWho gon' care when this all fades, I turn gray and get older?\nYeah, that's the type of thing that I don't wanna answer\nBut just 'cause I don't wanna do it don't mean I don't have to\nSee, these are lessons that you learn in life\nAnd we only get one of 'em, hope I'm learning right\nI know that everything comes with a price\nYeah, yeah, everything comes with a price\nY'all got no clue what I have sacrificed\nAnd lately, I've been thinking\n\n[Chorus]\nYeah, lately, I've been thinking\nYeah, yeah, I have been thinking\nYeah, I have been thinking (I have been thinking)"}], "artist": "NF"}