{"songs": [{"image": "https://images.genius.com/1e9d47cc7d2d89c839c4ec32d0815a5e.929x929x1.jpg", "lyrics": "[Verse 1 Uncle Murda]\nEverybody like you heard what that nigga said?\nNiggas getting offended\nEverybody running to the studio\nTrying to make a diss record about Kendrick (one, two, one, two)\nTell Kendrick I ain't mad at him, (I ain't mad at you)\nThis is exactly what the game needed\nEverybody want to be homeboys, rappers competition, start competing\nFor calling niggas names out, Kendrick I thank you\nBut for saying you the king, niggas want me to spank you\nI am like yeah I heard what Kendrick said\nBut lil homie ain't a threat (he not)\nMaybe if Game or Snoop said it\nThen I would be more upset (word)\nJay not dead, Nas alive\nYou the king? Kendrick, come on how do that sound?\nOkay say if they don't count no more\nThen it's me and Fab fighting for the crown\nA$AP Rocky hotter than both of y'all\nYears niggas like that fucking up yo culture y'all\nThis what niggas get for not checking Snoop\nWhen he kicked down the building, that's why Kendrick getting cute\nHow you gon' claim something that you not\nOh I get it this nigga wanna be 2Pac\nAnd I am a west coast crip on the blood block\nKicking it with bloods, talking about all the bloods I shot\nKing of Oakland, why you ain't say that?\nCause them niggas that robbed 2 Chainz don't play that\nDamn Murda I know you ain't gonna say that\nFirst 50, now Drake trying to bring Mase back\nBut P Diddy wanna get paid\nHe ain't letting niggas eat off of niggas he made\nAnd son I can't front I respect that\nPuff like y'all know what I want where the check that\nI don't hold mine gun sideways I shoot straight\nRemember when Dr. Dre used to dress like a fruitcake\nLet them out of town niggas know shit done change\nNiggas can't party out here if they don't get a pass from me and Maino\nMotherfucka we brooklyn\nAnd that crown I said me and Fab was fighting for? I just took it!", "title": "The Response (Kendrick Diss)", "year": null, "album": null}], "artist": "Uncle Murda"}