{"artist": "Plies", "songs": [{"album": "Da Last Real Nigga Left", "title": "Eerythang Eerythang", "image": "https://images.genius.com/876d3a6d9b8a3dddfffdd0a2bd1ba3a5.500x500x1.jpg", "lyrics": "Why the real niggas gotta die?\nWhy do real niggas, why do real niggas gotta die?\nWhy the real niggas gotta die?\nWhy the fuck niggas can't die?\nWhy we can't free the real niggas?\nAnd get the fuck niggas all the time\nWhy the real niggas gotta die?\nWhy the fuck niggas can't die?\nWhy we can't free the real niggas?\nAnd get the fuck niggas all the time\n\nRIP to the fuck niggas, ain't like the niggas in the way\nRIP to all the real niggas, I salute you to your grave\nShout out to niggas on the rep, y'all, try to release some of that stress\nThe land taught you what you know, nigga, you always talk about your J\nDon't give a fuck about your ice, nigga, don't give a fuck about your car\n'Cause none of that shit make you real, nigga, than keep it reel with your dog\n\n[Chorus:]\nWhy the real niggas gotta die?\nWhy the fuck niggas can't die?\nWhy we can't free the real niggas?\nAnd get the fuck niggas all the time\nWhy the real niggas gotta die?\nWhy the fuck niggas can't die?\nWhy we can't free the real niggas?\nAnd get the fuck niggas all the time\n\nEerythang called respected, eerythang, eerythang\nAnother day, another dollar, that's why I ride with this thang\nMy dawg Jake crossed the frontier, crack'em them shit among the road\nYeah, that's why the nigga stood low\n'Cause he won't fuck with one his own\nFive days, five bitters, nigga, that what the new paper say\nAnd all my mo'fucking five bodies\nA nigga caught one in the head\n\n[Chorus]\nMy Mr. Dawg, nigga, he been jailed for 8 years\nDamned my nigga wife and dog, so I had to see that he got killed\nThey say this shit is dirty game, nigga\nBut I'm a play it cut through\nI'm glad they came with the crack law\nHe gave the real niggas loan\nIt ain't no crying on this scene, nigga\nIt's all good in the hood\nThey keep it real with your people\nThey like a real nigga should", "year": "2014-01-17"}]}