{"songs": [{"year": null, "image": "https://images.genius.com/a0cc8fe946c04554a7d8c0e1032677bd.450x450x1.jpg", "title": "Queens", "album": null, "lyrics": "[Big Noyd]\nYeah-Yeah, Yeah, grab the pump pump\n(yeah) It's on we 'bout ta thump thump...\n...aiyo aiyo my left eye jump, I feel bad luck upon me\nMake me grab my pump and call my Brook-Lyn army\nWe by Q.B. and N.C. - niggas dont want it\nDebate ta the G's and the west all on it\nWe all flaunt it, guns and chicks\nAnd, all my dunns rhyme hold'ng they dicks\nWit' a .9 on they side from hip ta hip\nYou know the +Mobb Niggas+ is sick and stay bent\nTwisted, get right, me and my guns is tight\nAnd we both heated when the funds ain't right\nBecause we know someone gett'ng stuck tonight\nBefore I crash I'ma fucks me some ass tonight\nWit' a pocket full of dough and bottle of that 'dro\nWit' dreams of fuck'ng some R&B hoe\nThey call me N.o.y.d. baby, from Q.B\nBaby don't hate me, We live, I rep...\n\n[*Hook 2x - Godfather + (Big Noyd)*]\n(Queens!) - Where niggas they get caught up in between guns\n(Queens!) - Casino cash, cream killa Queens Dunn\n(Queens!) - Where I live, what I rep\n(Q.B. Dunn, Queens!) - The Mobb rep\n(Queens!) - You know we rep\n\n[Big Noyd]\nCom'n from Queens, wear'ng diamond rings\nCall me a highness, Ima king niggas rap about gats I blaze\n.4 pound in a .12 gauge, no I never knock the hustle\nDunn crime pay, keep it gangsta on this side\nYou know I put 2 in your stomach\nYa niggas front'ng, y'all dont really want it\nYou know who I be, Noyd from Q.B\nG' you upset, cuz I spit profinity-dity\nI kick that real shit, fuck-a-bitch, get rich\nYou say Im noth'ng, Im lift\nAnd you gangsta - Bullshit!\nGet ya .2's ready ta flip, ya fools better hit\nGot my shit fully gripped aim it, at ya shit\nWhy you think'ng I'ma miss, keep think'ng\nYou get twist, I runn'ng wit the Grimiest\nShit +The Infamous+, while you bang'ng our hits\nWe bang'ng your bitch, and you down ta turn around\nAnd blow you down wit' the 5th\n\n\n[*Hook 2x - Godfather + (Big Noyd)*]\n(You know its Queens!) - Where niggas they get caught up in between guns\n(Queens!) - Casino cash, cream killa Queens Dunn\n(Queens!) - Where I live, what I rep\n(Q.B. Dunn, Queens!) - The Mobb rep\n(Queens) - You know we rep.....\n\n(Queens!) Where niggas they get caught up in between guns\nQ.B. - Casino cash, cream killa Queens Dunn\nQ.U. - Where I live, what I rep\nWhat, what - The Mobb rep\n....you know we rep\nWhere niggas they get caught up in between guns\nAh...Queens - Casino cash, cream killa Queens Dunn\nQ. Double - Where I live, what I rep\nQ.U. nigga - The Mobb rep\nQueens - you know we rep"}], "artist": "Big Noyd"}