{"songs": [{"title": "Gangsta Shit", "album": "Prince of Compton", "year": null, "image": "https://images.genius.com/50658067c9d28ff25b3852f99e9b37fb.442x442x1.png", "lyrics": "[Intro]\nThis...\nThis is, Compton's in the house, niggas\n(Compton, Lil' E) You know what this is\n\n[Hook]\nNiggas keep screamin' that gangsta shit\nSo I'mma give niggas that gangsta shit\nMama I dig the way you dip & move ya hips\nSo come here let me whisper you some gangsta shit {It go}\nPop that ass like a '64 (Impala)\nDrop that ass like a '64 (Impala)\nBaby drop your ass like a '64 (Impala)\nBaby poppin that ass like a '64 (Impala)\n\n[Verse 1]\nIt ain't nothin' to a boss when you gettin' it\nIt's the jump off now let the Crip in it\nJoint hittin' it, eyes low stay steamin'\nI'm the dopeman, dope hands stay fiendin'\nEverybody wanna see a G, back in the phat rollin' thru the city streets\nI guess... I guess I'm the one they wanna be\nFirst son of a legend named Eazy-E\nAnd now little E so famous\nHands on action, everybody so anxious\nGame gon' change it, nigga face facts\nYou can hate it or love it while I just lay back\nThis Maybach put the loop on 'em\n'64 Impala no roof on 'em\n100 proof on 'em, I'm real with it\nThink otherwise homie we can deal with it\n\n[Hook]\n\nWork it, on the block I work it, rock it up then serve it\nWatch how fast fiends purchase\nNervous 'cuz cops is passin'\nHustle hard for the dough with the cops harassin', mashin'\nStill tryin' to duck the coppers, see we all gettin' money so they love to watch us\nFeds can't stop us, choppers is circlin'\nFiends need another fix so they chirped again\nKeep a murk in him\nWhen I'm stuck in the zone, back seat with the chrome\nHomie trip then it's on (Then it's on)\nGot the throne I'm just waitin' on the crown\nComp. town is the city, he just wanna be down\nHe a fake and he know that I'm the truth\nI'll show 'em streets already know, so it's nothin' (So it's nothin')\nStop frontin' and you will be fine\nYou was once number one now that spot bares mine, boy!\n\n[Hook]\n\nSo flawless, I'm lawless\nRoll out the blue park, and I'm lookin' for targets\nWatch them, he's hot don't knock him\nThat dude can't stop him, I'm one big problem\nSee (See) I told them that the game's over\nI'm commercial without havin' to change over\nA-1 bakin' soda, this that uncut\nKings of L.A. who tha fuck want what? (Yeah)\nMarcy, Marcy what since I retired, that's when Marcy lost me\nI'm a west coast ridah, flossy, flossy\nGrind hard for the dough dog, and rocks is costly\n(Yeah) Still servin', still pitchin' it\nMoney on my mind so I'm still gettin' it\nMav. In the six, D.L. in the five\nFour, three, two, one homie let's ride (ride)\n\n[Hook]"}], "artist": "Lil Eazy-E"}