{"artist": "Anderson .Paak", "songs": [{"title": "Yada Yada", "album": "Ventura", "year": "2019-04-12", "image": "https://images.genius.com/93a042aff45826b8e533047fbb3d78a7.1000x1000x1.jpg", "lyrics": "[Intro]\nCan't do it\nCan't do it\nHuh, and there it is, my wit's end\nThey brought me out my mind\nYou know I'm caught beside myself\nPissed off and shit outta luck\nHey, I've thought 'bout puttin' up\nI don't have the time, oh, not today\n(You know that's impossible)\n\n[Chorus]\nDoes somebody got some shit to say?\nYou know what? Fuck it\nLike yada yada\nOh, you know everythang (Can't do it)\nBut not today (Can't do it)\nBut not today\n\n[Verse 1]\nMy one and only, closest homie, we've carried on for days\nI wanna burn another one down, but I'll go off in a blaze\nYeah, I need to put it out\nBut I don't have the time, oh, not today\n(You know that's impossible)\nDoes somebody got some shit to say?\n\n[Verse 2]\nDarker days were bound to come (It's what it seems)\nThrough eyes of Brenda's only son (All I could see)\nWhen the dreams become reality (Could it be)\nIt's hard to keep a smile off the mug (Look at me)\nCasually talkin' that global warmth\nAs if the temperature didn't blow out your perm\nOur days are numbered, I'd rather count what I earned\nMy greatest summer was spent on festival runs in Europe\nChicken wings and sushi, I've gotten used to the perks\nNarrowly escapin' the holy war on the turf\nTurf, yes, Lord\n\n[Verse 3]\nCame a long way from them open mics at Leimert\nForgive me if I walk like I got a chip on my shoulder\nLabel tried to play me like I didn't do all the work\nI found another way through the open gate and my purpose\nNow I'm goin' crazy like (Right)\nIf they forget the dot, I'm chargin' double for the purchase\nLo and behold, my little one\nI've been gone for far too long\nIf I ever take this life for granted, you showed me just how dumb\nBut the longer I stay, the less I'm paid (I don't have the time)\nOh, not today\n(You know that's impossible)"}]}