{"artist": "Paul Wall", "songs": [{"album": null, "title": "Right Now", "image": "https://images.genius.com/f4538d52cd44a5a6367fd1c32b9e3a87.781x781x1.jpg", "lyrics": "I need drugs in my life like right now\nSome oil in my cup like right now\nI need kush in my blunt, like right now\nA bad bitch that could fuck, like right now\nRight now, right now, right now\nI don't want it later, give it to me right now!\nI on it and I know it, I ain't afraid to show it\nGotta a pocket full of bread, bitch, I came here to blow it\n\nSo bitch, get your mind right, pull out I'm talking some\nSwagged up I be killing, killing\nMy car ain't got no ceiling\nI know these boys don't talk down\nBut for haters I've got no feeling\nThe paper in my pocket, my bitch ain't got no panties\nA tall Puerto Rican that I met that in Miami\nI went to her apartment so she act like she could spare me\n'Till I seen her with her friends all boppin at the grammies\nSo I fuck her at the Grammies, I keep condom handy\nMy Chevy sittin' slanted told eddie paint it candy\nI'm blowing on the Cali my hand full of skittles\nTreating broads like stitches I could split them down the middle\n\nI need drugs in my life like right now\nSome oil in my cup like right now\nI need Kush in my blunt, like right now\nA bad bitch that could fuck, like right now\nRight now, right now, right now\nI don't want a later, give it to me right now!\nI on it and I know it, I ain't afraid to show it\nGotta a pocket full of bread, bitch, I came here to blow it\n\nYou know when a nigga want it, your bitch now that I get it\nShe graduated from Florida state, but I hear\nPulling up in a fo' do', with fo' ho's, and fo' fo's\nAll I smoke is good dro, mid grade a no-no\nShe told me come and get that pussy right know\nI had to tell her \"momma, please pipe down! \"\nI'll be on my to put that pipe down\nWell I gotta go and hit a nigga right now!\nYeah D-Boss in the building when you hit yes\nCali, kush up in my blunt relieve the stress, yes!\nTheir prices going up, mine going down\nIf you want it, come and get it right now!\n\nI need drugs in my life like right now\nSome oil in my cup like right now\nI need kush in my blunt, like right now\nA bad bitch that could fuck, like right now\nRight now, right now, right now\nI don't want a later, give it to me right now!\nI on it and I know it, I ain't afraid to show it\nGotta a pocket full of bread, bitch, I came here to blow it\n\nI on it, I'm zoning, I grind hard, I'm flowing\nSo I'm not only the boss, but homie I'm also the one that own it\nI own it, in A-T-L with that bonus, I gotta a super broad that will blow me\nAnd I'm not about to wait for not a dollar if you owe me\nThe double cup is lonely, so pour some of that juice\nI'm leanin' tough, that ain't enough, I need at least a deuce\nThese tricks about to get loose, get loose\nA bad bitch to the roots, I'm papered up she tatted down, my waistline to her boots\nI'm on one or two, but I'm a need me a few\nI'm gone off in bananas like gorillas in the zoo\nDon't worry if I run out, I keep something in my shoe\nAnd the broad riding with me, ready to blow some\n\nI need drugs in my life like right now\nSome oil in my cup like right now\nI need kush in my blunt, like right now\nA bad bitch that could fuck, like right now\nRight now, right now, right now\nI don't want a later, give it to me right now!\nI'm on it and I know it, I ain't afraid to show it\nGotta a pocket full of bread, bitch, I came here to blow it", "year": null}]}