{"songs": [{"image": "https://images.genius.com/f7d42d0db13086f046e08faacf066ef0.500x500x1.jpg", "year": null, "lyrics": "[Intro - Akrobatik - talking]\n(Gimme some)\nUh, move your body like\nThrow your hands up\nMove your arms around\nYep (I got soul)\nNod your head like (This nigga got soul)\nYo, yo\n\n[Verse 1 - Akrobatik]\nThis is just another take on the age old question (uh)\nWhere's the rappers that's prepared to rip a stage show fresh and\nGet the jam started based on talent and not gimmicks? (word)\nIt's like that across the board though, we all critics\nYou could be white and good, but don't prep the role\nCause it don't mean shit if it ain't got soul (soul, soul, soul, soul)\nYou could be a hard brother from the grittiest streets\nBut you ain't got soul if you can't ride beats\nSo, so, where the soul go?\nIf you got holes through your whole flow, you need to know your role bro\nBut see I rip it like an old pro\nAnd leave my mark like rap is a wall and I'm soul glo\nI'm just a kid you heard about through word of mouth\nWho grew up in the gutter but avoided the murder route\nWhile other cats were pulling the burners out\nI was on the field, playin fullback, runnin a mean corner route (true)\nThe line of scrimmage kept me focused on a finer image\nSmoke a oolie? Nope, I got a fuckin rhyme to finish\nI got my whole life to smoke weed\nBut for now I know what the people need\n\n[Break - Akrobatik]\n(Gimme me some ...) (*\"soul\" repeated throughout Chorus*]\nUh, move your hands like\nMove your head like\nMove your body 'round, yo\nPut your hands up\nNod your head like\nMove your body 'round (gimme some soulllllll)\nYeah, uh\n(Gimme some)\nPut your hands up\nMove your body 'round\n(Gimme me some soulllllll)\nYo\n\n[Verse 2 - Akrobatik]\nMove your body with it, party with it\nThem who lack soul, you know they probably hardly get it\nGrab a little hottie, hit it, crack it while I oddly spit it\nPack in lots of spots, so when I hit you know you won't forget it (uh)\nMany know I'm nice, the insecure won't admit it\nSince I don't put a gangsta lifestyle on exhibit (uh)\nBut that ain't me, I refuse it, to do this\nShit for y'all is a privilege, I can't abuse it (word up)\nAnd after all this is music doofus (uh)\nAnd all I have to proof is my nice with the usage\nRight about now get loose b-boys (uh)\nWhile my soul glo like Bruce Leeroy (Who's the mack?)\nSho nuff, the flow is so rough\nKick back, watch a fly ass show and go puff (puff)\nMe? I got the whole night to smoke weed\nBut for now I know what the people need\n\n[Outro - Akrobatik - talking]\n(Gimme me some ...) (*\"soul\" repeated until the end*)\nYeah\nMove your body like\nNod your head like\nMove your hands around\nUh, yeah\nPut your hands up\nMove your body like\nMove your head like\n(Gimme me some soulllllll)\n(Gimme me some)\nUh, put your hands up\nWave your arms around\nMove your body like (what?)\n(Gimme some)\n(Gimme some)\n(Gimme some)\n(Gimme some)", "title": "Soul Glo", "album": "Absolute Value"}], "artist": "Akrobatik"}