{"songs": [{"image": "https://images.genius.com/bfd5b295c4625e047172ee9ed359e213.426x426x1.jpg", "year": null, "lyrics": "I need a dollar, dollar, a dollar is what I need\n- Hey, hey\nWell, I need a dollar, dollar, a dollar is what I need\n- Hey, hey\nSaid I need dollar, dollar, a dollar that's what I need\nAnd if I share with you my story would you share your dollar with me?\n\nBad times are coming and I reap what I don't sow\n- Hey, hey\nWell, let me tell you something, all that glitters ain't gold\n- Hey, hey\nIt's been a long old trouble, long old troublesome road\nAnd I'm looking for somebody, come and help me carry this load\n\nI need a dollar, dollar, a dollar, that's what I need\n- Hey, hey\nWell, I need a dollar, dollar, a dollar, that's what I need\n\nWell, I don't know if I'm walking on solid ground\n'Cause everything around me is falling down\nAnd all I want is for someone to help meeeeeeeeeeee\n\nI had a job but the boss man let me go\n- He said\n\"I'm sorry but I won't be needing your help no more,\"\n- I said\n\"Please, mister boss man, I need this job more than you know\"\nBut he gave me my last paycheck and he sent me on out the door\n\nWell, I need a dollar, dollar, a dollar is what I need\n- Hey, hey\nSaid I need a dollar, dollar, a dollar is what I need\n- Hey, hey\nAnd I need a dollar, dollar, a dollar is what I need\nAnd if I share with you my story, would you share your dollar with me?\n\nWell, I don't know if I'm walking on solid ground\n'Cause everything around me is crumbling down\nAnd all I want is for someone to help meeeeeeeeeeee\n\nWhat in the world am I gonna to do tomorrow?\nIs there someone with a dollar I can borrow?\nWho can help me take away my sorrow?\nMaybe it's inside the bottle...\n- Maybe it's inside the bottle\n\nI had some good old buddy, his names is whiskey and wine\n- Hey, hey\nAnd for my good old buddy, I spent my last dime\n- Hey, hey\nNow wine is good to me, it helps me pass the time\nAnd my good old buddy whiskey keeps me warmer than the sunshine\n- Hey, hey\n\nYour mama may have missed, a child has got his own\n- Hey, hey\nIf God has plans for me, I hope it ain't written in stone\n- Hey, hey\nBecause I've been working, working, myself down to the bone\nAnd I swear on grandpa's grave, I'll be paid when I come home\n- Hey, hey\n\nWell, I need a dollar, dollar, a dollar is what I need\n- Hey, hey\nSaid I need a dollar, dollar, a dollar is what I need\n- Hey, hey\nWell, I need a dollar, dollar, a dollar that's what I need\nAnd if I share with you my story, will you share your dollar with me?\n\nCome on, share your dollar with me\nGo ahead, share your dollar with me\nCome on, share your dollar, give me your dollar, share your dollar with me\nCome on share your dollar with me", "title": "I Need a Dollar (live in studio)", "album": null}], "artist": "Aloe Blacc"}