{"artist": "The Game", "songs": [{"title": "California", "album": "Purp & Patron: The Hangover", "year": "2011-01-31", "image": "https://images.genius.com/9cb20d1b358d4aa81552492ba838d34f.750x750x1.jpg", "lyrics": "[Intro]\nPeople tryin'\nTo do what?\nTo find a way out\nOh yeah, that was me in 2004\nLove ain't around\nAin't never been around\nLook at California\nYeah, that's right (That's right)\nEvery time you look at me (Look at me-look at me)\nLook at California\nYou look at California\nI am the West side (West side-West side)\nLook at Cali-look at Cali-California\nLook\n\n[Verse 1]\nPalm tress, beautiful women\nDrop-top Phantom, now this is livin'\nStarted off choppin' crack in my Grandma kitchen\nBut y'all know that, so let's get down to business\nOut of towners beware of what you wear\n\"Yo, son I'm from New York,\" but we don't care\nThe Crips, the Bloods, the Eses\nThe Daytons, the Dubs, the Chefes\nWhat you know about Cali, everything irate\nI make the dinner, you be sure to scrape the plate\nFrom Compton's Most to N.W.A\nFrom Snoop Dogg to Dr. Dre, niggas love us\nWhat about the bitches?\nYou mean these bitches bouncin' in my backseat when my Impala hit switches?\nThey ridin' with a king, a California king\nIf it ain't about that, it ain't 'bout a mothafuckin' thing\nI'm livin' the American dream, sittin' fat but I don't sing\nI don't fuck with rats if you know what I mean\nYou thinkin' 50 but I'm talkin' Christina Milian\nSucked a million dicks but still ain't sold a million\nBitch tryna get a rock like a milli on\nI know you like, \"what this gotta do with L.A.?\"\nBitch tried to fuck me and she almost fucked Dre, so\n\n[Interlude]\nYeah, slow this shit down, man\nI'ma let California fuck you now, yeah\nThat's right, yeah, how it feel?\nKnow California niggas got big dicks, big trucks, big mouths, big guns\nWe'll fuck you all night\nStraight R&B, Black Wall Street Records we don't play no games\nI mean, after four albums, what the fuck you want from a nigga?\nI got the houses here, Miami, condo in New York, condo in Wilshire\nI done lived in Beverley Hills\nLook down the street at Range Rovers, Bentleys and Phantoms passin' by\nAs the wind blows through my fuckin' fade\nNiggas know what it is with me, nigga\nCalifornia King and that's for life\nDon't give a fuck what a nigga say\n\n[Verse 2]\nLet me introduce ya to somethin' you're not used to\nI'm California's future, sit back, watch what I do to\nThese Dre beats, these Timbaland tracks\nI Just Blaze 'em, I spit crack\nI Scott Storch 'em, you can't afford 'em\nEvery hot producer seen Game record\nMy flow out of this world like Neptune\nCalifornia was dyin', I came to the rescue\nFirst time Snoop Dogg ever heard me spit\nHis reply was like, \"Damn, nephew\"\nThat was '05\nNow it's '011, four albums, six years, I'm ahead of my time\nI let you niggas be LeBron\nEven he can't see Kobe in his prime\nPicture Kobe and LeBrons, that's too much game, I'm outta my mind\nThat's a hot line, I think niggas wanna hear me say that one more time\nPicture Kobe and LeBrons, that's too much game I'm outta my mind\nOutta my soul\nBeen havin' out of body experiences since I was seven years old\nLook at California, he ain't scared\nShot a deuce-five 'fore he had Nike Airs\nMy pops like, \"There goes the block\", I'm like, \"Where?\"\nBrass knuckles in my Levi's, never fight fair\nTwenty years later, I'm right here\nRed rag wipin' off all white Airs\nLet a nigga step on 'em, I'ma go Wyclef on 'em\nCould go Raekwon the Chef on 'em\nThrowin' up a dub, bangin' Wu-Tang\nRidin' wit' a chopper like a young Hussein\nIn a new range\nFuck with the Crips but I'm from the P-I-R-U gang\nMomma, I did it, you told me to so I spit it\nI don't just talk Cali, I lived it\nFrom Aftermath to Sick Wit It\nI'm sick wit' it, so, nigga, admit it\nYou will never be Game, never be Pac, never be Doggy Dogg\nI don't know why you spit 'cause, nigga, you ain't shit\nYou writin' for Detox? Nigga, suck my dick\nMe and Hittman did that before\nFirst Mel-Man left and then I seen the trapdoor\nCame in through the back, nobody can stop him\nNot E-V-E, Busta Rhymes or Rakim\nAnd Bus my nigga, so I would never diss 'em\nFuck over any other rapper with Henny in my system\nWho want it? Not Jigga\nI'm treacherous like Trigga\nI'm Naughty By Nature, nigga\nWith more priors than Richard\nAnd I can say whatever 'cause I made Jimmy Iovine richer\nAnd he get richer every time I call you a bitch ass nigga\nLet Chris Bosch run up on Kobe again\nI'ma catch him in the club and open his chin\n'Cause I ride or die for this Cali shit\nBreak a nigga off proper like a Valley bitch\nI chop a nigga down like a brick of raw\nI'm Notorious like Biggie Smalls\nI know he from New York, but he like me\nLast thing I wanna do 'fore I D-I-E is\nLook at-look at-look at California\nLook at-look at-look at California\nLook at-look at-look at California\nLook at-look at-look at California\n\n[Outro]\nI know New York the mecca of hip hop\nA-Town stay doin' they thing\nChi-Town breed Kanye and muh' fuckin' Common\nSometimes y'all gotta look at California\nAyo, Jimmy Iovine, tell Dre these headphones the shit"}]}