{"songs": [{"year": "1998-10-06", "image": "https://images.genius.com/408f7ad14b984b84913605cf7b4b6645.500x500x1.jpg", "title": "Menensky Mobbin’", "album": "Heaven’z Movie", "lyrics": "(Bizzy)\nMenensky-muthafuckin'-Tribe mobbin' on muthafuckas\nSee, it's like the Menensky Mob, see\nThey used to be the ones who was fightin' the slave master\nSo the people didn't go on the boat, you know what I'm sayin'?\nB-L-A-C-K-H-O-L-E\n(Shit, smoke, can a black man get some paper up in this place, man?)\n(But I'm a black man in a white man's world)\nFuck this shit\n\nOh, Menensky (Menesky!) mobbin'\nMenensky mobbin', nigga\nOh, Menensky (Menesky!) mobbin'\nMenensky mobbin', nigga\nOh, Menensky (Menesky niggas around the muthafuckin' world) mobbin'\nMenensky mobbin', nigga\nOh, Menensky (Menensky!) mobbin'\nWatts niggas with problems\nAnd the ?? thugs are from the projects\nSmokin' chronic with love with the gun in the glove\nNigga run, nigga run, nigga run\nMenensky mobbin' muthafucka!\n\n(Bizzy)\nMenensky mobbin' muthafucka with Watts niggas\nIn Cali ready to riot and rally around\nBrawlin' in my back door ready for warfare, declare like my Capo\n?? Gettin' wacko and smokin' tabacco\nYeah my niggas with tatoos, a sack of crack, and I'll pat you down too\nMy voodoo with that flip flop flow, don't make me blast you\nRight past you with the mask on, bitch\nSippin' the passion, get it twisted mister bitchafied\nThis introduction bustin'\nI'm bumpin' properly, property of my poverty, God we need a job\nClock me in my Saab, Menesky mobbin', bobbin' and weavin', no pron\nYou niggas' sloppy, don't copy, get popped, nigga don't jock me--you're raw\n\n(Chorus)\nOh, Menensky mobbin'\n(I'm tryin' to get high muthafucka')\nOh, Menensky mobbin'\n(You're over here trippin' and shit, man what the fuck's wrong with you?)\nOh, Menensky mobbin'\nMan, we mobbin' on niggas\nYou niggas can't fuck with me\nWatts niggas with problems\nAnd the ?? thugs are from the projects\nWe smokin' chronic with love with the gun in the glove\nNigga run, nigga run, nigga run\n\n(Bizzy)\nHock my Benz\nFuck a bitch for the babies and Christmas gifts\nWhen I'm lifted ridin' down the strip: same niggas, the same shit\nWorkin' the graveyard shift back on Brackland where the broads flipped like a\nMovie\nAnd my raw dogs trip in the line of duty\nLook at the groupies, holler, holler, from the hoopties and my Lucciano's\nGroovy\nJudge and jury my movie confuse me with those other thugs\nOn a high speed chase say\nSay don't swerve in the mud, and the tight weed taste like love\nWe thuggish in Columbus slums, suburbs, muthafucka word\nSift through my proberbs\nAnd I heard that we're rockin' up birds\nWhen out in Florida and CaliforniaNew York, Little Pomona, shookin' soldiers\nSmokin' doja, composure suppose\n\n(Chorus)\nOh, Menensky mobbin'\n(Menensky muthafuckin' mobbin')\nOh, Menensky mobbin'\nOh, Menensky mobbin'\n(Watts niggas. With Watts with muthafuckin' problems, c'mon, c'mon)\nOh, Menensky mobbin\nWatts niggas with problems\nAnd the ?? thugs are from the projects\nWe smokin' chronic with love with the gun in the glove\nNigga run, nigga run, nigga run\n\n(Bizzy)\nBorn to be ?, crushin' crucial, not the conflict, and b-b-b-bomb shit\nI'm on the chronic chokin' bubonic, harmonic\nEyes blood-shot red, loc'd out like Eazy--he dead, surprise\nFuck the Feds, fuck the bitches instead\nStep in the bedroom, I'm about to get some head soon\nShe's wet in the womb\nI'm kinda nast and mad at ya, but boom, it's till the sun up\nWhat up, done up, shut up, it's all in the game, it shouldn't be painful\nWell why the fuck I feel so much pain stressin' my brain?\nLet the train pass, look at the sky, play, laugh\nWith visions back in May on how I played dad\nDon't say that and criticize yourself, I'm'a tell the truth\nRoof nigga from Glock-Glock, no truce, the punk enemies deadly\nAnd shoot if you wanna\nSmoke water, but you can die, bitch, it's normal\nEventually your number's called through the portal and muthafucka fall\nHere's a quarter to call your dogs\n\nOh, Menensky mobbin'\n(Nigga, Menensky mobbin' world-muthafuckin'-wide on these hoes, c'mon!)\nOh, Menensky mobbin'\nOh, Menesky mobbin', Watts niggas with problems\nAnd the ?? thugs are from the projects\nWhoo!\nWe're smokin' chronic with love and the gun in the glove\nNigga run, nigga run, nigga run\nFor sure\n(Menensky niggas mobbin' world wide\nAre you down with the Menensky Tribe? Getready for war)"}], "artist": "Bizzy Bone"}