{"songs": [{"lyrics": "[Intro: Jay-Z]\nThis that futuristic shit, bitch\nIt don't stop, I can't stop\nThese cats ain't never touched nothing, ain't never gonna touch nothing\nSpend too much of their time gossiping and shit\nYou know?\nThat's something else though\nWe'll address that at a later date though\nEverything must be addressed though\nYou know?\nNothing slides\nWord up\nIt's murder\nDead or alive\n\n[Verse 1: Jay-Z]\nMy skills are, and will remain, ahead of you guys\nAnd ain't nothing gon' change that, dead or alive\nAny ill feelings I harbor y'all can blame it on the vibe\nDon't know when to let go and let young souls die\nSee a nigga diss me, ain’t nothing new, understand?\nBut it's how I retaliate which defines who I am\nJay-Z, ain't nothing dead or alive playing me\nI take beef to the grave, that's how my momma raised me\nShe told me, \"Fight in your afterlife, never revamp your story\"\nSo Heaven or Hell, niggas better have some answers for me\nHollering shit from '89, Hawaiian Sophie\nGod damn y'all been on my dick a long time\n(It's murder)\n\n[Verse 2: Sauce Money]\nWelcome to the Terror Dome\nYou error prone niggas sick\nRoc-A-Fella clique thick as herring bones\nWhat legends are made of\nLike whenever accurates hit\nMy voice locked behind bars to a bid for this spectacular shit\nFake kids fold and lie, holding why?\nSaw a half a million sales with a golden eye\nPatrol the sky to see bucks\nGS the fucks Yukon GMC trucks\nSlugs ease the pain to your brain when thugs squeeze\nMore we stuck in, bust shots till we chuckin'\nYou saw the faggot let em know more could have it\nAutomatic rhyme spot 4 shot towards his attic\n\n[Hook: Both]\nIt's murder\nDead or alive\n\n[Verse 3: Jay-Z]\nIf it's jewels you like\nYou fools gonna fuck around and lose your life\nAnd I just bruise your wife\nDon't get it confused right cause we in the spotlight\nStill I hold the Glock with the wrist twist like these\nGangsta shit no thanks to shit\nNiggas selling a million records more banks to split\nJay-Z motherfucker, who you think this is?\nIntroduction Sauce motherfuckin' crank this shit\n\n[Verse 4: Sauce Money]\nI heard his body was too hot to get near it\nToo late to hear it\nTwo slugs wait to release his spirit\nThe known truth: had a bad habit for blowing loot\nTwo niggas on the roof busting down at the phone booth\nRunning for cover at point blank cause bullets is hovering\nDrug them in after the slug went in\nI take a phrase in God we trust it's a must\nLive by the gun die by the same shit you bust\nFly bitches with waves from DC to Cali\nRally and tally up my dough for the grand finale\nGrapevines throughout the alley unknown figures said\nTrigger lead knew how bad we needed the nigga dead\nThoughts of hating sober intoxicated minds is taking over\nConjure all ways escape closer\nNever spar drove the car to the edge of the tar\nWith intentions to scar, shooting motherfuckerss to Allah", "title": "Dead or Alive, Pt. 1", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}