{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "More Than U Know", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "[Intro: Sample]\nAnd now for my next number\nI'd like to return to the classics\nPerhaps the most famous classic\n\n[Verse 1: Posdnuos (Breeze/Tariq) {Dave}]\nYo, yo, excuse me, I heard the word from word of mouth\nThat you were into booking flights\nMy travel agent took a trip up north\nAnd I need to book a flight tonight\nI enjoyed a getting away from day-\nTo-day stress so I need to leave, soon!\n(If that's a case, I have no space\nBut for later I'd be sure to leave)\nNah, nah, that's not gonna do, I know that you\nCan find another flight leavin the same time\nI need to get aboard. I can't afford\nAny penalties to sit in the main cabin\n{Yo, that didn't rhyme} It doesn't matter\n(What does is the money\nShow the cash and the ticket is yours)\nCool! Here's your green, now I'm up outta the scene\nBut I'll be back to purchase some more, jewels\n\n[Chorus: De La Soul]\n(I like it) More than you know it\n(I like it) More than you know it\n(Do you want me, baby?) I want some mo'!\n(Do you want me, sugar?) I want some mo'!\n(I like it) I like it! (I like it) I love it!\n\n[Verse 2: Posdnuos]\nNow I'm comin down outta the clouds\nAnd I'm runnin into turbulence, need to get up\nUp higher again, feelin like my soul's on fire again\nDon't need no belt for safety\nShow me where the safe be, so I can take me another trip\nTo the agency, cause the travel unravel my woes\nBut now the craving grows, so\nI need to get a ticket cause, man, oh I\nNeed to get aboard a plane again, some\nSay I'll crash, but It's my life and cash\nGonna ride it out until the end, numb\nTo the lift of the whiff, grown, when I vacate frequently\nAnd I got frequent flyer, when I retire to death\nTell 'em that the big C sent me and a lot\nOf brothers, man, I'm not the only brother\nAt the airport, needin a lift, off\nWas a agent 'til I was caught and brought\nTo an unfair court, pleadin the fifth, soft\nGround I prefer upon the mound\nWhen I pitched a rock for a fee\nNow others say standing at the bat isn't where it's at\nBut taking hits is where I'd rather be\n\n[Verse 3: Dave (Pos)]\nAyo, my cousin used to tell me 'bout this dime named Addie\nHustled with the big boys who pushed the Caddy\nSee, when I was young, I was told to stay clear\nBut sometimes, she pitched her game in my ear\nTold me 'bout the ways she'd make me feel good\nBragging 'bout how she controlling the hood\nNot me, I'm just a youngin' interested in the streets\n(But in the future, I think Addie had plans for me)\n\n[Chorus: De La Soul]\n(I like it) More than you know it\n(I like it) More than you know it\n(Do you want me, baby?) I want some mo'!\n(Do you want me, sugar?) I want some mo'!\n(I like it) I like it! (I like it) I love it!\n\n[Verse 3: Dave (Pos)]\nNow I bagged this chick but she got me wide\nMade me lose my friends and my pride\nHad me cashing my checks for her\nLost all my self-respect for her\nWhen I was broke, she'd go solicit other guys\nAnd if we made love, you could see it in my eyes\nMy fantasy was one day to be a millionaire\nSo I could reassure that my baby girl was there\nI could feel her love, son, I taste it in her lips\nMentally, she was a trip, had a nigga whipped\nA lot of other cats got strung out in the past\nBut I'ma get the love last, then I make the dash\nThat's what I thought, but Miss Thing was too appealing\nWhen I had no dough for her, she had a nigga stealing\n(Hands hot) Now I'm incarcerated, honey ain't around\nInto withdrawal from her, while I'm locked down\n(Two years done) I hear she's still a thick dime (Word)\nControlling niggas pockets and even ladies' minds\n(Here she come) I'ma ignore her with her tempting proposition\n(Approaching me) But when she said, \"Hi,\" I had to listen\nI'm sweating beans cause I know I'm gonna bait her\n(Better do it now cause you're bound to do it later)\nI can't refuse her, my denial's a wish\nFell into her arm when I gave her a kiss, cause I liked it!\n\n[Chorus: De La Soul]\n(I like it) More than you know it\n(I like it) More than you know it\n(Do you want me, baby?) I want some mo'!\n(Do you want me, sugar?) I want some mo'!\n(I like it) I like it! (I like it) I love it!", "year": "1999-02-23"}]}