{"songs": [{"year": "2014-07-15", "title": "Comfort Food", "image": "https://images.genius.com/a4d52942eb4b120225094d0e316c3b15.800x800x1.jpg", "lyrics": "[Part 1]\n\n[Intro (Sample): Richard Pryor]\nAnd I always had to box them dudes that looked like they just killed their parents. You know, have you ever seen them niggers with them big rusty ass hands, the kind of hand you can strike a match in the middle of it? Right. They come out at the bell beating themself up. Right, (ding, boom, boom… ) I’m saying, well, he don’t give a fuck about me!\n\n[Verse 1: Saba]\nUh, look, I'm ridin' like I fell in love\nDown Roosevelt like Eleanor\nWe out the hood it's better for us\nA private school in the suburbs\nThe quiet kid, he know his scores\nDo he even have vocal cords?\nThey wanted me to speak up more\nAnd I took this shit overboard\nWorn like the mileage high, turned to a violent guy\nI walk up in this bitch like y'all know my name but it's funny\n'Cause I used to be kind of shy\nLike, remember when Jenai said hi, and I would just walk past her\nI got a lot to say but not a lot of space so I talked faster\nNow I'm far from the silent, feelin' less lost and misguided\nCollege course is horse shit, no offense and I'm still undecided\nOn the fence like I was just here for the ride\nI'm not up for election but could probably suffice as a write in\nSo quiet, because rejection like my biggest fear\nMy only phobia was growin' up and watchin' no one care\nMy character embarrassed, that it´s hard to just be myself\nMy cellphone went from zero contacts to 'bout a million in a year\n\n[Chorus: Saba]\nIf it’s flawed, it falls\nIf it's real, it won't\nJust look at the stars, and know\nLove is found, when it's lost\nIf it’s flawed, it falls\nIf it's real, it won't\nJust look at the stars, and know\nLove is found, when it's lost\nWhen it's lost\n\n[Verse 2: Saba]\nAll I can be is myself\nAll I can do is me, R.I.P. to my stealth\nInvisible but not invincible\nPenetrable mental words like projectiles\nHow many of them went through\nWent too far without talkin'\nTalk about some shit you've been through instead of Bentleys and bent knees\nThat's a pet peeve I have when a rapper act like they can't breathe\nThey not alive but one dimensional, he went to the bank and withdrew his soul\nBut my soul is what I give you\nLike Cassius duckin' the draft, now the fight is over hopefully I can win\nAt war with yourself when you look in that mirror you realize who you been fightin'\nMy father told me I'm 'bout to take it over, been recordin' since 10\nYears old, not PM\nThese songs, these hymns\nMy life literally on wax from wacker to back out west though\nOnly nigga from the block that dream of different success\nYou think that he accept himself just cause he made acceptance speech?\nI'm out my comfort zone, I found myself, now accept me for me\n\n[Chorus]\nIf it’s flawed, it falls\nIf it's real, it won't\nJust look at the stars, and know\nLove is found, when it's lost\nIf it’s flawed, it falls\nIf it's real, it won't\nJust look at the stars, and know\nLove is found, when it's lost\nWhen it's lost\n\n[Outro]\nWhen it's lost\nWhen it's lost\nWhen it's lost\nJust look at the stars, and know\nLove is found, when it's lost\nWhen it's lost\nWhen it's lost\nWhen it's lost\nWhen it's lost\n\n[Part 2]\n\n[Verse 1: Saba]\nFake girls callin' me by my real name\nReal people fuck with me cause I feel pain\nAm I insane\nFor thinkin' that it's possible for me to blow up and I ain't deal 'cane?\nI'm from the same street that fo' nem on,  grew up on\nThat corner like they foundation is more like a cornerstone\nWell wishes like a quarter thrown, even if it's sorta wrong\nI'm 'bout to take it back like the waiter got your order wrong, crack epidemic\nFast forward thirty years, rap epidemic\nFashion and linen, fast bitten rhythm\nI'm from the D, that's division, they put my nigga in prison\nHe wrote me every month and told me I'mma get it\nI don't need your opinion, you don't gotta believe in me\nThere's niggas that'll bleed for me, the same go equally\nBlack ops lurkin' like COD\nAnd white cops wanna kill me\nOnly cause I'm a black boy\nThe only rap boy that spit facts and I factoid\nThey kill niggas for their Concords\nMe, I'm just tryin' to go on tour\nMy niggas comin' up with me out in carpool\nTo Toronto to something you all know\nTo something that you all know\n\n[Verse 2: LeGit]\nYou must got your finger pricked on a spindle\nFriends call me L'z, but you can call me Vincenzo\nMinus the Uzi and kitchen I'm on a mission 'til it's\nBreakfast at Wimbledon, turkey sausage and French toast\nWith all my niggas, I swear I tell 'em we this close\nYou need a dollar I got ya, spot ya like Glenn Close\nI'm twenty two with dreams of payin' off them Benz notes\nThey pulled me over, L'z suspended, damn, I didn't know\nDidn't matter, cuffed to a banister, finger prints on a scanner\nMost niggas that talk about shootin' dudes is actors\nTo keep it real you probably hard as chutes & ladders\nMy next shit a brick of piff, you smell it through the plastic\nSonnin' all you bastards, and you gon' meet the parents like a male nurse\nCause when it come to these sixteens I'm well versed\nFew thousand fans in one room, we send that bitch to the moon\nRemind me to let you know if the hammer fell first, they probably yell church\nBut I might show up to the function in a tinted Hummer\nWith a Zoe Saldana, just left Benihanas\nMight cut her off right after summer, I don't really want her\nKeep it a hundred, she just a prima doma that's on a scholarship\nSay she do this as often as the apocalypse\nI told her save that shit to a floppy disk\nGirl save that shit to a floppy disk\n\n[Outro]\nSay where-where-where you are\nIs a reflection of where we start\nIf you shine your light on the world\nPromise that you'll go far...", "album": "COMFORTZone"}], "artist": "Saba"}