{"artist": "Vado", "songs": [{"title": "55", "year": null, "lyrics": "[Hook: Vado]\nYo, lets pull out the 750 get the semi live\nMy bitch is twenty got her bussin em for 55\nBut her age say she 55\nPlus we outta town hope these crackers let it slide\nLets pull out the Californias get the corners live\nMy bitch is twenty got her bussen em for 55\nHer I.D. say she 55\nBut she got pretty eyes hope she on a nigga line\n\n[Verse 1: Vado]\nUgh, You pop shit but never there\nFuck your pela gear\nHollow tips make your lever tear\nLike box breaks dont get twisted my beretta here\nUnder my R.L. sweater wear with the teddy bear\nIf there's nine of us then nine hammers then\nIts tall handlin with the rock like Kyle Anderson\nGave her one hit and wonder shine Anderson\nConnect keep hittin my number I'm not answerin\nLike Hello? they just role yellow\nRan outta Knicks line they told me no Melo\nHand never take on master go fellow\nWon't settle I'm killin em dog\nOld yellow\n\n[Hook]\n\n[Verse 2: Vado]\nYou got beginner shine rich and me lay thats milla time\nGave the bear three faces and every bit of mine\nSaid you flowerd I can't see it a nigga blind\nI tell my slime make em get it line get a line\nJersey mansion watching Scarface like this shit is mine\nVersace robe with slippers with three bitches high\nNeed a passport where Im getting fly\nGY my nigga dont ask for but he gettin by\nWanna rock? then cop a quarter\nOn a block thats not for you\nFill the pot with hot water\nIm focused word to my God daughter\nOn the journey to get that\nMy Melo jersey and Knick hat\nYou fellas urk me with that chit chat\nSince my mother birth me Ive been that\n\n[Hook]\n\n[Verse 3: Gunplay]\nI do my thug dizzle\nOn you cunt pussies\nBitch you know what this is\nStraight raw and viscious\nSeabass and foreign fishes\nGold dreams and hard wishes\nFight like I got four fists\nGoing through these more issues\nThrowin disses, know I'm baggin, blowin dishes\nKitchen like a cook out, look out watching all four fences\nBenzes and Lorenze's til they ex name my existence\nMy lawyer's a beast\nI watch him feast on my offenses\nMe and my comrades bout that vida\nClap clickin quicker than I out that reefer\nHop out that G4\nLike what the fuck you lookin at me for? why?\nCause I'm lookin like C4?\nThese nigga be perpin\nTurning the amp on\nFor the same bitch I put a camera and lamp on\nSmokin woods and my camp on\nLooking good brick of yam and a hand gun\n\n[Hook]", "album": "Slime Flu 3", "image": "https://images.genius.com/8066555d470cc6c865fd602c0153957a.500x500x1.jpg"}]}