{"artist": "Awkwafina", "songs": [{"title": "NYC Bitche$", "image": "https://images.genius.com/7499b3edbf9d7e74a817bda35bd7049f.500x500x1.jpg", "album": "Yellow Ranger", "lyrics": "[Intro]\nOh my god\nDo not look, but that guy has a crack pipe and it's out right now\nHe's beckoning toward us\nDon't drop the subway map, bitch\nIf you drop the subway map, we're never gonna get outta Queens\n\n[Verse 1: Awkwafina]\nWhat's poppin' in the BK, Prospect Expressway\nFuck that museum shit unless it's first Saturday\nBitches be in Bushwick, they all live in Bushwick\nThey all love Bushwick but I say \"FUCK DAT SHIT\"\nPull over by the Burg\nHipster pussy market\nFeelin' on these vegans despite the smell of armpits\nThe skinny ones are artists, it's obvious they starving\nYour shit art don't pay bills it eats Ramen\n\n[Hook]\nNew York City Bitch, that's where I come from\nNot where I moved to on Mom and Dad's trust fund\nNew York City bitch, that's how I'm rolling\nYou out-of-state fakes get your iPad stolen\n\n[Verse 2: Awkwafina]\nWhat exactly is in Red Hook, aside from Ikea\nCan I take a train there? No idea\nTraffic on Atlantic, bitches stay alien\nYo peep that mess Jay-Z call a stadium\nUptown bro-fest, 20-something douchebags\n\"Let's get a pint bro, yo where the skanks at?\"\nEast Village poppin', college kids coppin'\nDrank too much now the IVs droppin'\nWest Fourth pizza, stop in front of Joe's\nChillin' with the lezzies outside of the Cubbyhole\nAve of the Americas, driving in the bike lane\nSloppy ass bitches coming out of the PATH train\nBitch, where your pants at? It's 25 degrees out\nYou eatin' nachos on the block with your pussy out\nQueensbridge Projects, Long Island City\nForest motherfuckin' Hills, bitch, get shitty\n\n[Hook]\nNew York City Bitch, that's where I come from\nNot where I moved to on Mom and Dad's trust fund\nNew York City bitch, that's how I'm rolling\nYou out-of-state fakes get your iPad stolen\n\n[Verse 3: Awkwafina]\nNo I'm not from Flushing, I wonder why you think that\nCiti Field, bitch, where the overpriced drinks at\nWhat's poppin' in the Bronx, Third Avenue Bridge\nAll the tranny hookers on the point get it in\nBlunts in the whip, now we got the munchies\nI wonder if the corner store still sell loosies\n\n[Hook]\nNew York City Bitch, that's where I come from\nNot where I moved to on Mom and Dad's trust fund\nNew York City bitch, that's how I'm rolling\nYou out-of-state fakes get your iPad stolen\n\n[Outro]\nBitch\nOh my god, oh my god. Wait, here's...\nOkay, okay. To your right, there's this Asian girl. She has two live chickens in cages. She just punched a man for a subway seat, and she is coming toward u---This is Awkwafina, bitch. I just stole yo iPad and now imma sell it to buy more live chickens", "year": "2012-12-04"}]}