{"artist": "Cage", "songs": [{"title": "Teenage Death", "album": "Movies For The Blind", "year": null, "image": "https://images.genius.com/a543bef5a47f37a8aeba1d69065b95ac.500x500x1.jpg", "lyrics": "Man talking:\nThe old cynicism is gone\nWe have faith in our leaders\nWe're optimistic, as to what becomes of it all\nIt really boils down to our ability to accept\nWe don't need pessimism\n\nTeenage death, girls want dick not words\nFlicks, got her's\nTits, not hers\nWent to the park at dark and shot birds\nWith a Mossberg\nGet a lot stirred\nFuck gimmicks\nThen quickly abort to duck image\nOccupy the same space bet you can't fuck with it\nI'm ready verse tasting\nLike the most anticipated works of violence since Freddy vs. Jason\nI'm worth patience, a worth in greater market\nSo I can shoot up your chest like them little paper targets\nI donate sluts, never pitch in to pay tricks\nHow'd you get your shit on billboards? Bitch, glitch in the Matrix\nAnd that's for Sci-fi flies and conformist kids\nThat may or may not know what a Cage performance is\nThe latest installment is not to unplug you\nBut if you don't get this by the 13th listen then fuck you!\n\n[Hook]\nFuck this rap shit, it's what you weigh in the street (right)\nDon't shit where you sleep, better lay with your heat (tonight)\nAll praise G.O.V. cause that's who's comin'\nLookin' for huntin' with the gunnin'\nWhites and blacks are runnin'\nIt's like he's already dead if you're saying he sleeps (right)\nThey're comin' real deep and they're playin' for keeps (tonight)\nRun for the hills cause they're comin' for kills\nYou got fuck to loose, you got nothing to bill\n\nIt's like money is God, y'all worship church rappers\nI cut Rock 'N' Roll High School with purse snatchers\nIf the clocks are all evil then Orange's guns peal\nDrop food on my fr-enemies like Donald Rumsfield\nI run with the brokes\nSpent to much on choke\nHad a PCP overdose and I still smoke\nCan't get locked down how my brindle enters\nAnd won't come down like New York's two burning middle fingers\nStreet journalist\nEven written down to this\nMost of my rap colleagues sittin' down to piss\nBookstore revolution\nTelevised execution\nWhere I put my dip Newports at Susan\nWhat if Kurt were to put a hole in Courtney chest\nThat frame of mind went and caught me a vest\nFor Cage is anarchist games evolved\nWhile the most wild mannered piss, brains dissolve\n\n[Hook]\n\nRead and study while my boots bloody\nSo fuckin' milky homogenized loops love me\nAnd in a company of wolves they respect I eat first\nBut doctors can't stitch up for your stomach leak bursts\nMix max with half-wits\nThe task flips\nIn Middletown they'll shoot you over a fuckin' trash bitch\nGrew up with no pop and a crazy ho\nThat's why I need no play on commercial radio\nUnravel the mind, around the room frozen sides\nSheep too tired to fight, close your eyes\nPut vanilla dutches in the sky, when the kinds on the table\nKnife to the tits, 9 to the navel\nIt's like a self-righteous path to line these pockets\nY'all got sideways knowledge dollars, (at least he's honest!)\nStick a fork in his tail, then jux the crowd with it\nIf there's bite marks on my dick I guess your girl's mouth did it\n\n[Hook]"}]}