{"songs": [{"image": "https://images.genius.com/98b2e94f0abf851dbfe0bee40a3ce053.600x600x1.jpg", "lyrics": "Is this muthafucka on?\n(Check-check 1-2\nYeah bitch, go check your muthafuckin puss\nYeah, this's your homeboy Jay from the Romper Room Crew\nWe just lounge here in the Country Club right about now\nYou know what I'm sayin?\nBut now I'm gonna pass this to my young dog Mac Mall)\n\n[ VERSE 1 ]\nPassin Mac Mall the mic is like lighting a fuse\nTo a fat pipe bomb in a packed-ass room\nFull of broke pimpetrators who be all tryin to dis\nAnd them hairshop hoes playa-hatin for the dick\nNow naw, I can't forget all them rumour-spreadin tricks\nChocolate nuts for your mouth when this dope album hits\nLike a ??ho?? out of China, ballers say I am a timer\nCause I was shootin game since I was a minor\nSome of these rappers is liars, candy-coated and shit\nCounterfeit-ass nigga, you can't blow up in this shit\nI went from bein broke to havin fat accounts\n]From Ben Davis to wearin clothes you can't pronounce\n]From spittin lines to the ladies to bust the game to a bitch\nFirst they hung up in my face, now I got em doin flips\nSo when my cuddies ask, \"Mall, you stress offa what suckers say?\"\nI tell em, \"Naw folks, it's all in the game\"\n\n[ Hook ]\nI'm comin up on the playa tip\nYour boy done bubbled, so be prepared for some major shit\nNigga, we comin up on the playa tip\n(So shake them squares and start chosin on some playas, bitch)\n\n[ VERSE 1 ]\nStill got a Tec-9 in my cream creased Dockers\nHang with big timers, hustlers and bank-robbers\nPlayers who be real about they money, you know\nMy dick get harder with every dollar, so who needs a ho?\nBut sometime I like to get my tip ate\nAnd if you ain't careful, it might be your bitch, mayn\nV-Town hog, so I dog her like a doorway gap\nI'm from the Crestside, partner, and fool, we do em like that\nOne-time, they be on me, cause my pockets is paroley\nSippin Hennessy not 40's, stayin far from the phoneys\nFuck a homie, nigga, but you can be my cuddy, though\nYou got a microphone, some money, or a sack to roll\nIn the Country Club Crest we can have a choke fest\nThem six figure-digits got a young mac possessed\nTo the point, if it ain't about money, then it ain't mandatory\nI keep my business and pleasure in different categories\nCause once they mix, then you trip, man fool, you lost control\nWent broke behind a punk-ass ho\nNigga\n\n[ Hook ]\n\n[ VERSE 3 ]\nDome loaded, ripped off Hen'\nHell of g's addin up in my countin machine\nI count them endless dollars before I have a dream\nOf a muthafuckin heist or a gafflin scheme\nP-89 Ruger with the red beam\nIs the tool I use when I let off steam\nI'm out here gettin famous, and you're just a fiend\nThat's why everytime you see me you be muggin me\nIs your system on that morphine?\nNow did your your lungs get sprung on the ice cream?\nNow playa-hatin niggas, this rap's for y'all\nYou know I got a middle finger and a cap for y'all\nAs long as my name is young Mac-ass Mall\nThis game won't stop, won't pause, won't stall\nNow nigga, get rich, read a bitch and kill a snitch\nBut make sure your actin's on the playa tip\nNigga\n\nOn the playa tip\nYou know\n\nYeah nigga\nWe live from the muthafuckin Country Club\nYou know what I'm sayin\nSmokin the dank down to a nud\nAin't even trippin\nWe got bitches all out here\n[Name] and shit, you know\nAnt Banks all around this muthafucka burpin and fartin and shit\nI don't know\nWe just live it, boy", "year": "1996-04-23", "album": "Untouchable", "title": "Playa Tip"}], "artist": "Mac Mall"}