{"songs": [{"lyrics": "Dad i wanna be a rapper can i make a song with you?\nNot right now man dad kinda busy\nWell e40 let his son rap and master p let lil romeo rap how come you dont let me rap\nOk...i'll let you rap man..uhh you know we just...ya know we need some beats and you need to write some lyrics ya know you just can't rap homie\nI got some beats\nWhere you get some beats from\nI made em up in your studio\nYou made em up in my studio? what you doin up in my studio\nWorkin on my new album\nWorkin on your new album? who let you in my studio\nMomma\nTtt man i'ma kick\nI mixed it down and burnt it to a cd here ya go...by the way man thats a cheap CD burner\nWhat?...man you better not be talkin about my cd burner man i'ma play this shit and it better bet tight and if its not i'ma take off my belt and whop your ass you and your mom\n\nOk...you made all this by yourself?\nYea?\nHmmm\nHey dad why dont you and me have a freestyle session you and me right now\nHahha uhhh yea...hey get the headphones come in the booth couse\nWith the one two three, three two one [whaa] i'm in the booth freestylein with my son\nTrippin on the beat he just made might as well get paied in the sixth grade\n[rings]\nMy phone is ringin....while i'm singin\n[i wonder who that is]\nHahaha cmon\nWhat up...hello...recordin a song with my son its almost done\nI'm freestylin on the mike i got on some dirty nikes\nI done walked through the yard watchin them do the lap around the house\nTalkin to my spouce\nDad...my and my dad we rap so tight every word we say it sounds so right\nWe just like to do this and that cause all of the sudden our pockets were phat\nWhen i was up little bittie kid hey dude guess what i did\nI did good in school i did good in readin all of the sudden i did good in readin\nAll of the sudden man i wasn't cheatin on my tests and i did my best cause with god\nI just passed the test\n\n\nYea...uhh..i useta alwase cheat catch me lookin at the next mans sheet\nBut i'ma tell you in the song we got our tests back and they both was wrong\nHe got a f i got a f i can do bad by my damn self, dont ever copy off your buddy take your ass home and study\n[yea, damn]\nCmon man cmon..cmon up to the mike...go go go go\n\n\nDad let me tell you one thing you just can't go around living like this man what you doin\nCause all of the sudden you gonna get picked\nCause if you go ahead and rob that dude cause he got more food\nMan...what you doin you can't live life through suueing...man\nMan i dont like this because man you alwase gettin pissed\nBecause every time you get mad some dude walk around bein sad\nWhen you walk over their and cheer him up all of the sudden he got pride in his cup\nThen you share with him and you share with he man thats the ultimate\n\n[random laughing]\n\nSon we got some work to do...yea....i wanna chill in my coop deville", "title": "Me & Kenny", "album": "Afroholic: The Even Better Times", "image": "https://images.genius.com/c4fd850563348aed762e3d484ea76e19.500x500x1.jpg", "year": null}], "artist": "Afroman"}