{"artist": "The Game", "songs": [{"title": "Bills Is Paid", "album": "California Republic", "year": "2012-04-05", "image": "https://images.genius.com/e6b76fdc2635fdc0e9d62ceb9907eb3c.750x750x1.jpg", "lyrics": "[Intro: DJ Skee]\nUnfortunately all great things must come to an end\nIt looks like that time is upon us\nBroadcastin' live from the Skee Lodge in Hollywood, Californ-I-A\nInside the great California Republic\nI'm the world-famous DJ Skee signin' out with my brother, The Game\nAnd before we do that, we still got a couple treats for y'all\nWe need to bring it back to the West Coast\nShout to my brother, Nipsey Hussle\nUncle Snoop, what up?\nAnyways, 'til we meet again\nSee y'all on Skee TV\nMoney Gang, we out\nDJ Skee\n\n[Chorus]\nMy bills are paid\nAnd everything's okay\nIt's like every day\nSummertime in L.A\n\n[Verse 1: The Game]\nYeah, I'm from Compton, home of the fiends\nHome of the monsters, home of triple beams\nHome of the shattered fuckin' dreams\nWhere most niggas I grew up with ain't make it to see they teens\nAin't no Freddy, ain't no Jason, but niggas too scared to dream\nAnd they rippin' pages out of them books 'bout Dr. King\nYou don't wanna know half the shit I seen\nWhere readin' a magazine get you hit with a magazine\nNiggas ain't scared to murder 'cause the jails too packed\nKill a nigga, he be out before the R.I.P. tat\nI seen Raider snapbacks by Starter\nThen I seen Dre make that Sox hat harder\nThen I seen Makaveli go at Shawn Carter\nThen I seen that block where B.I.G. got slaughtered\nThen I knew it was my callin'\nG the fuck up or die ballin'\nLace them red Chucks up, but die fallin'\n\n[Chorus]\nMy bills are paid\nAnd everything's okay\nIt's like every day\nSummertime in L.A\n\n[Verse 2: Nipsey Hussle]\nYuh, let's go\nI'm risin' in this game and it feels great\nStill tryna keep it real, niggas still fake\nI'm so impatient, but I still wait\nDropped The Marathon in November, niggas still late\nStill show love when I feel hate\nOn a scale of one to ten, need a high heel eight\nOr better, blowin' this cheddar like I'm Bill Gates\nWhatever, I'm in to win 'til this movie ends\nSmokin' California, eatin' Peruvian\nOut on Miami Beach, my niggas, a few of them\nDressed like Beverly Hills, the benches we usually wear\nFrom wishin' on a star, nigga took it far\nAnd if I lost it all to war, I wouldn't trip at all\nLook, It sound crazy when I say it\nBut the fear of fallin' off is the only thing that could take it\nI'm straight\n\n[Chorus]\nMy bills are paid\nAnd everything's okay\nIt's like every day\nSummertime in L.A\n\n[Verse 3: The Game]\nI got my hoodie on, it's a Starter\nI'ma rock this motherfucker for Trayvon Martin\nI'ma rock this motherfucker for Trayvon's daughter\nThat he coulda had, where's his killer at? The whole hood is mad\nThat ain't the first time, won't be the last\nSee reflections of my past while I guzzle through this glass\nMake me want to run up on you with the muzzle, \"Where the cash?\"\nRetaliation is none, niggas can't afford the gas\nGot a mansion in the Hills, Rottweilers by the gates\nRed Ghost's in the driveway and ducks by the lake\nSpendin' time with my daughter so them ducks gotta wait\nLet a nigga call her a duck, he gon' eat a thirty-eight\nI'm supposed to be this fuckin' rich\nI'm supposed to be this fuckin' great\nI'm a menace to society, no Larenz Tate\nBut me and my niggas straight and\n\n[Chorus]\nMy bills are paid\nAnd everything's okay\nIt's like every day\nSummertime in L.A\n\n[Outro: The Game]\nDJ Skee"}]}