{"artist": "Ice-T", "songs": [{"title": "Personal", "lyrics": "[Intro]\nAnd the guitar's on there?\nDo this (do this, do this)\n\n[Verse 1]\nEmcee's no time out, it's time to rhyme out\nYou dug your own grave, now you must climb out\nDig out, crawl out, hide from the fallout\n'Cause when I get mad, I go all out\nIce, cooler than the coldest cube, dude\nAnd when I'm micin', boy, I'm known to get rude\nCriminal background,it's time to get down\nI use a silencer, don't like the loud sound\nOf my mic blast, you better run fast\nThe last punk that popped junk passed\nSpit on his grave, laughed, jumped in my stretch\nSigned his bitch an autograph\nSyndicate boy, I don't fool out\nYou're full grown, school's out\nYou try to diss? I think you better cool out\n'Cause your butt is smoke, if we ever duel out\nThis jam is directed to all of those who expected\nFor me to cold be rejected, but now I'm highly respected\nAnd now their ears are infected with dollar signs I collected\nJealous punks, I said it!\n\n[Chorus]\nTake it personal\nPersonal, personal\n\n[Verse 2]\nTake it personal, punk, I'm talkin' to you\nAnd if they agree with you, then your crew too\nI never diss an emcee, I wish 'em all good luck\nBut if you diss me to my face, duck\nMy style don't ramble, you shouldn't gamble\nWith your grill, I got a fist like an anvil\nI write a record, lock it on the topic\nEvil and Iz dog the track, then we drop it\nRecord stores rock it, stock it, fans buy it\nPeople that never heard of Ice-T, try it\nThen you try to diss? You got gall\nI got gold on my neck and gold on my wall\nGold in my fingers, gold in my ear\nWhen this jam's spinnin', gold's what you hear\nToy, this ain't Christimas, no time to play\nI ain't no child,punk,you'll get sprayed\nIllin' on a mega-villain\nYou must want a pine box to go chill in\nBuried deep, creep, no one will weep\n'Cause the next night, with your bitch I'll sleep\n\n[Chorus]\nTake it personal\nPersonal, personal\n\n[Verse 3]\nI ain't East Coast, West Coast, new style, or old style\nYou wanna know about me? Check police files\nGet out my face or you might have a bruised one\nBrass knuckle prints? Yes, I used some\nI ain't here to boast, I don't do that\nWhen I talk it's straight dope, pure facts\nI rock hard but still called a new jack\nBut talk shit, you're sure to get head-cracked\nI don't drink or smoke or do dumb drugs\nBut my posse's still labeled street thugs\nLAPD's got all my boy's mugs\nCan't use my phone for the damn bugs\nI live in privacy, don't like suckers hawking me\nNews reporters, some think they can talk for me\nLies, misquotes, changin' all my words around\nBut if I catch 'em on the street, they'll get beat down\nThey get money for hype-type publicity\nThey don't think twice about dissin' me\nBut that's a mistake, with the Syndicate you shouldn't mess\nI hope those punk reporters wear vests\n\n[Chorus]\nTake that personal\nPersonal, personal\n\nNow the words I speak to some may sound radical\nBut I'll explain, it's simply mathematical\nYou diss, I diss, this is creates an equal\nYou reply to my diss, this is called a sequel\nI reply to your diss, this is called a battle\nNot intelligent, not very adult\nSo I don't battle, I just put heads out\nA straight line is always the direct route\nI write lyrics clear to leave no doubt\nDon't even have to say who I'm speakin' about\nYou know who you are, you just jealous\n'Cause you hear my records are million sellers\nTry to say I'm wack out on the streets\nWhile your whole crew is jockin' my beats\nSee me on TV and in the papers\nSee me at a jam, catch vapors!\n\n[Chorus]\nPersonal\nThis shit is personal\nPersonal, personal, personal\n\n[Outro]\nPersonal", "image": "https://images.genius.com/90b363e617bc82f06e45c5cc1d830e6a.1000x1000x1.jpg", "album": "Power", "year": "1998-09-13"}]}