{"songs": [{"album": "Welcome 2 Detroit", "year": "2001-02-27", "title": "Beej-N-Dem, Pt. 2", "image": "https://images.genius.com/04c2a42dc85ee38b17d2284777a99745.700x700x1.jpg", "lyrics": "(Intro)\nOff the wall\nOff the wall\nOff the wall\n\n(Beejtar)\nNigga I peeped your persona\nI'm not impressed\nAn anthem that was stepping wit his ??? clone candidates\nOur mission is wit bass soul music to use it\nJay Dee perfect the snare\nDroppin dark from the beats\nSo I can spit the bullets that I'm\nNow the puzzles complete\nWhile you screamin hot wobbly wobbly\nScreamin yes\nWhile the lyrical slug go through a thug nigga's chest\nAll due respect let's balance it out\nCause the negativity is really stressing me out\nIn a house or a crib\nRidin in a hoopty\nYour getting upset\nNo game, no coochie\nI once was like you but a car don't make the man\nWhat makes the man is his game plan\nIf you don't have a plan then you sinkin in the sand\nLook back one minute later all I saw was your hand\nIn your hand was a grand so I took it and ran\nDrop the LP and dedicate it to you my man\nTilly Mos call me BJ Ski\nRepresent the glove from above\nNot down below like a ho\nLet a ho be a ho\nI know everybody gonna give love to the Mo\nYo we never left we just kept it on the low low\nLow low like the wizard in Mo Joe\nLet me let the chorus flow then you hear the blow\n\n(Jay Dee)\nMake me wanna sing to it Ha\nKeep fuckin around Ah\nOh You know you fuckin around Uh\nYou think you fuckin around with this\nOhh oh Ohh oh Ohh oh\n\nHuh? What? Who got dough? Let me see it\nDilla show you how to MC it\nBeats bang the fuck out the MP kid\nPop shit we got clips and we empty it\nY'all will agree its simply the truth\nWe keep niggas in line like simply do\nAnd the envious hater they wastin my time\nIf you not in my face then you not on my mind\nThey wanna hate Jay cause Jay done got on the shine\nSee they don't this nigga Jay done got on the grind\nGot a lot on the mind and bout to let it all out\nDon't wanna see me ball out\nBut come down to the D baby\nWe can bounce to the key and the city\nHit the VIP wit a fifty for a head shot in the head\nNot bad at all\nShow you how a player do it\nIt'll take Jay to do it\nNext year grammys niggas wearing gators to it\nFuck it stupid and y'all made us do this\nWho this click I'm rollin wit we holdin it down Hey\nIt's the Theloneus\nWe owning it now\nNow now now now now\n\nUh yeah\nFuckin around\nAh"}], "artist": "J Dilla"}