{"artist": "Baka Not Nice", "songs": [{"lyrics": "[Intro]\nYeah, yeah\nI'm countin' the money, I'm chasin' the money, I'm wantin' the money, I'm gettin' the money\nYeah, yeah\nI'm runnin' the money, I'm gettin' the money, I'm chasin' the money, I'm wantin' the money (Yeah, yeah, yeah)\n\n[Verse 1]\nI'm high in the Hills (Yeah)\nI'm high off the pills (Yeah, woo)\nI got no chill (No chill)\nA killer for real (Uh, killer)\nI flooded my AP (Flood)\nSo I keep it off safety (Yeah)\nYou cannot play me (Woo)\nThat's why they hate me (Gyeah, yeah)\n\n[Chorus]\nI've been runnin' on these streets, yeah (Runnin, yeah)\nWe been all these streets now, hey\nI'm Steph Curry with the thirty, yeah\nCall me Steph Curry with the thirty\n\n[Verse 2]\nWith a thirty (With a-)\nYeah, two big MACs on me gully-gully, yeah (Blap, blap)\nIf you talk you gon' feel yeah-hey\nI got two MACs on me homie, yeah (Blap, blap, blap, blap)\nWhen niggas see that shit they gonna go crazy\nYou know what that means? Yeah\nYou know what that fucking means?\nI'm-I'm-I'm in the hole, I'm on the love, call it lockdown (Rah)\nI did a bid, I'm on the road, call that touchdown (Yeah)\n\n[Chorus]\nI've been runnin' all these streets, yeah (Runnin, yeah)\nWe been all these streets now, (Runnin, yeah)\nI'm Steph Curry with the thirty, yeah\nCall me Steph Curry with the thirty (Yeah)\nI've been runnin' on these streets, yeah (Woo, yeah)\nWe been all these streets now, (Nigga, runnin, yeah)\nI'm Steph Curry with the thirty, (I'm Steph Curry, nigga), yeah\nCall me Steph Curry with the thirty (Gyeah, gyeah, gyeah)\n\n[Verse 3]\nI'm popping the Xan (Popping the shit)\nI'm high in demand, Peter Pan (Peter Pan, hey)\nI'm copping couture (Copping couture, hey uh)\nI'm going on tour (Going on tour)\nI'm splashing galore (Splash, splash, splash)\nIt's a body for sure, yeah\nBack on the road (Woo)\nI'm in a Ghost (Gyeah)\nI'm here on my throne (Woo)\nCounting balance (Yeah)\nI make a toast (Yeah)\nMy ice on glow (Woo)\nAKA a light show (Ayy)\nWe dripping galore\n\n[Chorus]\nI've been runnin' all these streets, yeah (I've been runnin nigga)\nWe been all these streets now, (We been runnin nigga, yeah)\nI'm Steph Curry with the thirty, yeah (Swish, swish, swish, swish)\nCall me Steph Curry with the thirty (Yeah)\nI've been runnin' on these streets, yeah\nWe been all these streets, yeah\nI'm Steph Curry with the thirty, (Yeah, yeah, yeah), yeah\nCall me Steph Curry with the thirty (Gyeah, gyeah, gyeah)\n\n[Outro]\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nYeah, yeah, yeah\nWoo", "image": "https://images.genius.com/7efc29f965bb689063e8ace18db32472.1000x1000x1.jpg", "year": "2019-03-22", "title": "30", "album": "no long talk."}]}