{"artist": "Watsky", "songs": [{"year": "2016-12-05", "lyrics": "[Verse 1]\nYou know, I think it's hella cool\nMy mom's a librarian at an elementary school\nI'm proud of her, she taught me how to be\nAnd what's awesome is my mom is also proud of me\nHer greatest compliment was paid\nWhen she invited me as speaker to the whole fourth grade\nShe wanted me to kick some spread your wings and fly shit\nCrushing on some inspiring touch the sky shit\nWhat sucks is that before I did\nMom couldn't show my videos to any of the kids\nShe realized all my clips had alcohol and opiates\nAnd none of them had language that was close to age appropriate\nSo she said, \"so be it just come be you today,\"\nAnd that was cool until we got into the Q&A\nThey raised their hands but all the questions that they had\nWere why I used so many words that were considered bad?\n\n[Hook]\nBad words\nThe shit's pretty complex\nBut kids, bad words are all about context\nWhat the fuck is a bad word?\nI don't know what's real\nWhen you call \"fuck\" a bad word\nHow you think that makes \"fuck\" feel?\nProbably pretty bad\n\n[Verse 2]\nThe deal is I think it's a real pity\nIf you use a word to make a person feel shitty\nLike saying \"Arab\" to make a Persian feel shitty\nNot like saying \"pussy\" when you mean a real kitty\nOr even saying \"pussy\" when you're stuck and you're tryna\nFind a loving way to talk about your wife's vagina\n\"I'll love my wife until the fucking world stops\nAnd when it comes to fucking pussy, Dinah's pussy is the tops\"\nSee? That shit's positive\nBut when you're cursing\nJust be careful that you don't objectify a person\nSee, I would tell my mom that she's the motherfucking shit\nBecause she is and 'cause it fits our hippy Bay relationship\nYou see, \"shit\" just means \"poopoo\" or \"caca\" or \"doodoo,\"\nBut we say that it's a nono which I just think is cuckoo\nOr loco or bullshit\nYeah, but it's okay because the fact that words are bad\nAre what make them fun to say\n\n[Hook]\nBad words\nAre just our invention\nKids, bad words\nAre about our intentions\nWhat the fuck is a bad word?\nI don't know what's real\nWhen you call \"shit\" a bad word\nHow you think that makes \"shit\" feel?\nProbably shitty", "image": "https://images.genius.com/1aacc5c51f6e3a30a154e12a7fc3100f.1000x1000x1.jpg", "album": "Oops! All Berries", "title": "Bad Words"}]}