{"songs": [{"image": "https://images.genius.com/6723f478cff14a2ba2cbe0ce2ad7d4c2.320x320x1.jpg", "title": "Cuchi Shop", "album": "Sucka Free", "year": "2008-04-12", "lyrics": "[Intro: Cuchi Shop Customer, Cuchi Shop Employee, and Nicki Minaj]\nWelcome to Star Box\nYeah shorty, I'm trying to get me some thick thighs and some chinky eyes\nI need a real good box\nOh ok\nA real good box\nOkay, hey, yo Nick!\nYo?\nYeah, shorty out here want want, uhm, a number three\nOh, alright tell him to come around to my window, I got him, it's nothin'\nOh alright\nAnd yo, you know the slogan right?\nYeah, I know how it go\nPussy by any means\n\n[Hook]\nFirst I take their order at the Cuchi Shop\nThen I send 'em a girl that can make her coochie pop\nAnd then I smuggle all my money through the coochie spot\n(Up in the Phantom, have you wishing you had 'em, I'm the madam)\nAnd there ain't no returns at the Cuchi Shop\nWe don't wanna hear \"it burns\" at the Cuchi Shop\nJust listen and you'll learn at the Cuchi Shop\nUp in the Phantom, have you wishing you had 'em, I'm the madam\n\n[Verse 1]\nWhat you need thick thighs and some chinky eyes\nSuper size all your sides like your biggie fries\nFor a better price you can get some better pie\nStrawberry, apple, cherry, even lemon lime\nWhat you want them B cups or them C cups?\nFor your ice cream, chocolate or butter P cups\nFrench vanilla threesomes that come in D cups\nThey eat each other but otherwise they don't eat much\nI'm bout that fast money, money ain't got no patience\nBut if them boys come, run like you on probation\nListen up, I'm a send ya to the location\nWrite it down, take a picture, make a notation\n\n[Hook]\nFirst I take their order at the Cuchi Shop\nThen I send 'em a girl that can make her coochie pop\nAnd then I smuggle all my money through the coochie spot\n(Up in the Phantom, have you wishing you had 'em, I'm the madam)\nAnd there ain't no returns at the Cuchi Shop\nWe don't wanna hear \"it burns\" at the Cuchi Shop\nJust listen and you'll learn at the Cuchi Shop\nUp in the Phantom, have you wishing you had 'em, I'm the madam\n\n[Verse 2]\nRelax lil' nigga, cut the bull (cut it out)\nWe tax niggas, no deductible (get it out)\nSo what it is, what it ain't, nigga state ya name\nYou know we got them umbrellas if you make it rain\nSo what you want them good girls or them bad ones?\nI got them girls make ya wish you never had none\nCause you'll be spending beaucoup in my spot, shorty\nThis nigga acting brand new like he just bought it\nUp and away like Mighty Mice\nYou can say I am the rap game Heidi Fleiss\nCause my flow crazy, Hussein like Sadam\nYou getting it, I got 'em, I'm the rap bitch madam, I'm the madam\n\n[Hook]\nFirst I take their order at the Cuchi Shop\nThen I send 'em a girl that can make her coochie pop\nAnd then I smuggle all my money through the coochie spot\n(Up in the Phantom, have you wishing you had 'em, I'm the madam)\nAnd there ain't no returns at the Cuchi Shop\nWe don't wanna hear \"it burns\" at the Cuchi Shop\nJust listen and you'll learn at the Cuchi Shop\nUp in the Phantom, have you wishing you had 'em, I'm the madam"}], "artist": "Nicki Minaj"}