{"artist": "Pharoahe Monch", "songs": [{"album": "Internal Affairs", "title": "No Mercy", "image": "https://images.genius.com/3f6b75e56c302232d6cdbcbfbb1501c3.1000x1000x1.jpg", "lyrics": "[Intro: Pharoahe Monch]\nOhh, hear me though\n\n[Verse 1: Pharoahe Monch & M.O.P.]\nThey'll bury me with my SP-1200 (For sure!)\nFuck the trinity, inseminate the earth, now take its virginity\nIn my vicinity, rap is like energy pack\nSending me back behind enemy line to rap too melodic\nMelodies, never melodramatic but hypnotic like cellos for fellow fanatics\nI fiend for who fuck wits, inappropriate\nFill 'em with so much lead I'll call Berger and Associates\nThis rhyme will remain in the minds of my foes forever in infamy\nThe epitome of lyrical epiphanies\nSkilfully-placed poems and carefully planned symphonies\nWho would be ignorant enough to have the audacity\nTo fuck with the likes of I and my tenacity?\nThis is what you get when you fuck with the likes of\nThe magnanimous flows of total assholes and ignoramuses\nM.O.P. slash Pharoahe Monch cause damages\nThe advantage is we banish artists, labels and managers\nAmateurs found six feet deep in metal canisters, we\n\n[Chorus: Pharoahe Monch & M.O.P.]\nShow no mercy\nFor the love of this shit, here niggas are bloodthirsty\nTry, load\nLock, hammer\nAim, cock\nShow no mercy\nFor the love of this shit, here niggas are bloodthirsty\nTry, load\nLock, hammer\nAim\n\n[Verse 2: Lil' Fame]\nLil' Fame bring it live, yo, that's what I strive for\nI'mma settle this before you get to call five-o\nYou wanna see me four-five blow?\nNigga, put the phone down 'fore I dump two times four\nWhat you wanna cry for? You know that my hammer is heavy\nAnd it got kick like taekwondo, now you gwon die slow\nI'mma show you how to stretch a motherfucker if you wanna watch tae bo\n(Yo, we down by law) And when I hold this pound down for\nIt's for me to put it down (By war), shit is like downhill\nI'mma make a nigga smell the corpse from Kings County Morgue to Brownsville (Ohhh!)\nRep your hood and wave the flag\nFor almighty Pharoahe, Fizzie Womak, and Danze\n(Guns up) Guns down\n(From sun up) To sundown\nMake you sing 'til ya a-la-la-la-la-la-la-la, dow!\n\n[Chorus: Pharoahe Monch & M.O.P.]\nShow no mercy\nFor the love of this shit, here niggas are bloodthirsty\nTry, load\nLock, hammer\nAim, cock\nShow no mercy\nFor the love of this shit, here niggas are bloodthirsty\nTry, load\nLock, hammer\nAim\n\n[Verse 3: Billy Danze]\nI'mma put you cowards in perspective\nIf you looking for child's play, don't look my way\nThey have never gave me any credit\nSo I developed a homicide fetish, deal with it, motherfucker, it's your call\nIt's only seven ways a nigga usually fall, I'm abusin 'em all\nNow will the real comers please stand? Get up against the wall\n(Brrrrrrrrrrrrrrrrrrrrrrrr!) Yes, yes, y'all\nMake it easy on yourself, Danze don't sleep\nWhen I catch you on a creep, I'll lift the ground right from up under your feet\nThat's word to 'Lah, be a man and prepare to die\nIt's the return of the hooded soldier, your man should've told ya (Be cautious if it's walking sideways)\nIntended to blaze (First family) and Pharoahe Monch, studying criminal ways\n\n[Chorus: Pharoahe Monch & M.O.P.]\nShow no mercy\nFor the love of this shit, here niggas are bloodthirsty\nTry, load\nLock, hammer\nAim, drop\nShow no mercy\nFor the love of this shit, here niggas are bloodthirsty\nTry, load\nLock, hammer\nAim, cock", "year": "1999-10-19"}]}