{"songs": [{"image": "https://images.rapgenius.com/ce56fbe1f263b9cd246801f694730b48.540x540x1.jpg", "title": "Wake Up", "album": "Mansion", "year": "2014-08-05", "lyrics": "[Intro]\nYou spend your life in a dream that you can't escape\n'Cause you live your life in a coma, you're never awake\nIf you'd open your eyes then maybe you'd see what's at stake\nYou're sleeping, you're sleeping\n\n[Verse 1]\nYou make a lot of money and you live in a mansion\nAnd pretty much got everything that you could ever imagine\nBut you feel like even though you got everything in the world\nYou got nothing\nSo what you do then is you start going backwards\nYou runnin' in a direction\nAnd you lookin' for something that isn't real\nAnd all you know is that you just gotta have it\nWhat you're doin' is sleepin'\nAnd thinking that you're awake and you're not\nAnd the problem is that you don't know what you're after\nSo you put everything that you have into what you do\nHoping that one day maybe you don't have to feel like you're empty\nBut as you get older a lot of weight on your shoulders is getting heavy\nThen you look back and you start to regret things\nYou only get one life\nAnd every time you lookin' at yours\nYou feel like everything you have is a waste!\nAnd the problem and the reason you could never fill a hole in your life\nIs because you were never awake\n\n[Pre-Chorus]\nYou spend your life in a dream that you can't escape\n'Cause you live your life in a coma, you're never awake\n\n[Chorus]\nWake up, wake up, wake up, wake up!\nWake up, wake up, wake up, wake up!\nWake up, wake up, wake up, wake up!\nWake up, wake up, wake up, wake up!\n\n[Verse 2]\nYou wake up in the morning\nBut you feel like you never got up and go to work\nAnd you feelin' like you ain't got a purpose\nAnd you tryna get motivated but everything you do turns into a mess\nLike you ain't nothing but worthless\nAnd, yo, you look around\nA lot of these other people you lookin' at\nTo you, you describe as perfect\nSo you point a finger at God and tell him to do his job\nAnd fix ya life up 'cause nothin' is workin'!\nAnd you will try to hide it and make it seem like it's nothin'\nBut really you feel like everything is crashin' around you\nAnd you developed a problem in trusting in other people\nWhich later became an issue that would mentally pound you!\nYou only get one life\nBut every time you lookin' at yours you feel like all you ever see are mistakes\nAnd the problem and the reason you could never move forward in life\nIs because you were never awake!\nWake up\n\n[Pre-Chorus]\nYou spend your life in a dream that you can't escape\n'Cause you live your life in a coma, you're never awake\n\n[Chorus]\nWake up, wake up, wake up, wake up!\nWake up, wake up, wake up, wake up!\nWake up, wake up, wake up, wake up!\nWake up, wake up, wake up, wake up!\n\n[Outro]\nYou spend your life in a dream that you can't escape\n'Cause you live your life in a coma, you're never awake"}], "artist": "NF"}