{"artist": "Kid Rock", "songs": [{"image": "https://images.genius.com/1fbf9a936a0cdaed4ea023465d6655c6.500x500x1.jpg", "title": "American bad a**", "year": null, "album": null, "lyrics": "Yeah! and I've set up and turned out this state\nWith my own two hands\nWe've traveled this land packed tight in minivans\nAnd all this for the fans, girls, money, and fame\nI play their game, and then they scream my name\nI will show no shame, I live and die for this\nIf I come off soft, then chew on this\nAre you scared?\nDevil without cause, and I'm back\nWith the Beaver hat and Ben Davis slacks\n30-pack of Stroh's, 30-pack of hoes\nNo rogaine in the propane flows\nChosen one, I'm the living proof\nWith the gift of gab from the city of truth\nI jabbed and stabbed and knocked critics back\nAnd I did not stutter\nWhen I said that I'm goin platinum, sellin rhymes\nI went platinum, seven times\nAnd still they ill they want to see us fry\nI guess because of only God knows why why why why why\n\n[Chorus]\nOh, they call me cowboy, I'm the singer in black\nThrow me the finger in the air, let me see where you're at\nAnd say hey, hey\nLet me hear where you're at and say hey, hey\nI'm giving back so say hey, hey\nShow me some metal and say hey, hey, hey, hey\nI like AC/DC and ZZ Top\nBocephus, Beasties, and the Kings of Rock\nSkynyrd, Seger, Limp, Korn, the Stones\nDavid Allen Coe, and No Show Jones\nYeah! Pass that bottle around\nGot the rock from Detroit and soul from Motown\nThe underground stoned fuckin pimp\nWith tracks that mack and slap back the whack\nNever get in the way, I don't play with with that\nBut watch me rock with Liberace flash\nPunk rock the Clash, Boy Bands are trash\nI like Johnny Cash and Grandmaster Flash\n\n[Chorus]\nYeah, I saw your band\nJumping around on stage like a bunch of wounded ducks\nWhen you gunna learn sucker?\nYou just can't fuck with Twisted Brown\nTrucker\nI'm an American Bad Ass\nWatch me kick, you can roll with Rock\nOr you can suck my dick\nI'm a porno flick, I'm like Amazing Grace\nI'm gunna fuck some hoes after I rock this place\nSuperfly living doublewide\nSide car on my Glide so Joe see can ride\nFull sack to share, bringin' flash and flair\nGot the long hair swinging, middle finger in the air\nSnake skin suits, 65 Chevelle\nSee me ride in sin hear the rebel yell\nI won't live to tell, so if you do\nGive the next generation a big 'fuck you'\nWho knew I'd blow up like Oklahoma\nSaid fuck high school, pissed on my diploma\nSmell the aroma, check my hits\nI know it stinks in here, cause I'm the Shit\n\n[Chorus]\nI'm a cowboy, bad ass in black singing hey, hey, hey, hey\nFrom side to side from front to back say hey, hey, hey, hey\nI put Detroit City back on the map by singin hey, hey, hey, hey\nKid Rocks in the house and that's where I'm at!"}]}