{"artist": "Cam’ron", "songs": [{"title": "Chop It Up", "album": "The Program", "year": "2017-11-09", "image": "https://images.genius.com/2d988f3cf7ed4e06f71fc90a8d5abc57.1000x1000x1.jpg", "lyrics": "[Sample of piano from Donny Hathaway and Roberta Flack's \"Be Real Black For Me\" plays]\n\n[Verse 1 - Cam'ron]\nLived by Ohio State, but never seen the Buckeyes\nBut I served students, ask the alumni\nKis of heroin, yeah, Killa had 'em dumb high\n4-6 AM, I was done before sunrise\nScope in the trunk (for what?)\nIn case anyone tried\nLike Fetti Wop though, I only needed one eye\nBaby in love with the aura\nDefense on point, but I'm more of a scorer (splash)\nHit the border, tell papi, yo, triple my order (Donde)\nPhelps can't fuck with me when it come to the border\nYeah the water boy, Killa Bobby Boucher\nNew jays, .45 blow off his toupee\nNew girl, you stay; old girl... salute, babe!\nIt's a fiasco, they wanna be Lupe!\nPeep it, succeeded\nI got it, you need it\nWhite, real white, so white, look like I bleached it\n\nHook: Mimi & [Cam'Ron]\nI'm in, I'm in love with him! [and then I don't text her back, man!]\nI don't, I don't fuck with him! [next day, I'm at her house, right...]\nI'm in, I'm in love again! [and then I disappear on her]\nWhat the fuck is up with him? ['cause I know how to chop her up!]\n\n[Cam'Ron]\nGet the work man, I chop it up!\nI don't wanna talk or chop it up!\nChop, chop, chop, chop it up!\n\n[Verse 2 - Cam'ron]\nLet me tell y'all from the start again, never needed marketing\nI'ma make another hundred thou' before it's dark again\nFeds rush the crib, shit, I'm shaking like Parkinson's\nLooking at my co-d, oh no, not again\nI'm not selling druuuuuugs agaaaaaaain\n(Until I'm what?)\nDown on my hard luck agaaaaaaaaain\n18 wheeler, just another heist (that all)\nRegular though, just another night\nBread on your head, dread, yeah I'll pay the cover price\nWhat I need that for? I'll kill him with a butter knife!\nMalcolm X Boulevard, Lennox got the butter off\nY'all like my leathers though, baby, butter-soft\nSponsored the game, where A butterballed (swish)\nY'all all suckers, turkeys, Butterball\nMy life, what a ball\nHad cover-girls under covers, y'all yeah we undercover lovers\nAwwwwww....\n\nAnd what they say man?\n\n[Hook]"}]}