{"songs": [{"title": "All About Money", "lyrics": "[Young Buck]\nYou a thug like me\n\n[Verse 1]\nYou can catch me green stick it up\nDick it up\nCut a nigga shit over 50 bucks\nNeed work on the low nigga hit me up\nNever quick enough after pickin up\nFeds on a nigga block ridiculous\nCuz the game done brought all our shit to us\nI done bit the dust-countinus\nNow I ride double ? to the ind you bust\nOh no wrong move if my ind you touch\n17 but its real when you playin with much\nOne in the chamber on the table when you chillin for lunch\nAnd head up with your door open feelin your blunt\nWhere im from 20 gone by the end of the month\nI get drunk smoke the weed to the end of the blunt\nMake sure 10 shells done been in the pump\nIf its on-first draw thats a nigga wit luck\nAll niggas playin games start endin 'em up\nCause your block young buck will start bendin 'em up\nAs soon as your adrenaline pump\nMake way dear lord cause im sendin 'em up\n\n[Hook x2]\nIts all about money\nGettin major paid\nStack your cheese in all different ways\nTote your strap and keep your khakis creased\nYeah nigga, you a thug like me?\n\n[Verse 2-D-tay]\nThey call me D-tays up\nGet 'em up put the aks on\nLet 'em know we don't play sir\nAnybody in the way gets sprayed brah\nAnybody in the way gets sprayed brah\nWanna play rough?\nY'all cats wanna play tough\nTay wanna spray stuff, erase stuff\nNiggas wanna start shit with they gun then run\nTay don't wanna chase ya\nBullets wait ta, replace ya\nHit 'em with the shells of the 45\nMake 'em all duck, with the four-five buck\nPut 'em all up\nGot 2 so we got you but we don't give a fuck\nSeals comin gunnin out the cut\nSpittin at you cats\nSpittin 50 rounds like im spittin on a track\nY'all niggas know that you can't hold that\nIma spit the gat 'til the gat click-clat\nThen chit chat\nNiggas gun learn that you beef with this here this heat gone burn\nIma show ya cats how to bus y'all guns\nHit a nigga up and leave his ass left numb\nDont play with me\nYou know I spray the heat\nThe A.K. gun niggas down fatefully\nYou think expectfully, just wait and see\nYoung buck and D-tay nigga ready to g\nIf it pays to be, the boss in the cause\nMy gun so big gotta limp when I walk\nDont talk the talk cause T.I.P. we comin\nFirst go about money\n\n[Hook x2]\n\n[Verse 3-Young Buck]\nIts all bout thuggin\nGettin paid and shit\nYou either slang the dope or hit major licks\nThats why all my niggas be sevin bricks\nY'all gunna see what we workin with\nNot me baby doll\nI ain't hurtin for shit\nG.S. 400 with a leather kit\nOh you don't wanna holla?\nWell whatever bitch\nDont say shit when the bezzle flip\nSee a nigga tote straps for the hell of it\nI ain't givin a fuck about jealous shit\nAnd I don't smoke weed for the smell of it\nJust before I kill, I inhale the shit\nYou can't trail me bitch I be in 50 states\nParanoid, with about 50 cakes\nOnce a nigga find out its all heart no shake\nThats when I infest the place\nIm thugged out\nUp in the drug house\nGot it all-from the beer to a quarter ounce\nWe da real ass niggas, all work no slouch\nCan I get that there? all that count\nAll they amount\nBut when it go down and a nigga make all ya say all that out\nWhat you gunna do nigga what you about\nEither ride or die, when im raised in the south\nLove the block, when a nigga wake up, I wash my face and then hug my Glock\nBrush my teeth and scream south side, smoke a blunt and put on my socks\nBut it still don't stop, from dusk to dawn\nA nigga been out here on his own-livin day to day\nSee im only 17 but a nigga out here just gains farm", "album": "T.I.P.", "year": null, "image": "https://images.genius.com/d018174ecb7b887477659509ddf44ca3.499x499x1.jpg"}], "artist": "Young Buck"}