{"songs": [{"album": "Politics as Usual", "image": "https://images.genius.com/1d41e14a37194abf4f8777c7434614de.500x500x1.jpg", "year": "2008-09-30", "title": "How We Rock", "lyrics": "[Intro: Termanology] (DJ Premier scratching)\nUh! Premo, Pre-mo, Bun B, Bun-B (Now-Now-Now this is how we rock!)\nThis is how we (ROCK) This is how we (ROCK)\nThis is how we (R-R-R-ROCK-ROCK)\nThis is how we (You ready?) Let's go, yeah!\n(Now-Now-Now-Now-Now-Now-Now-Now-Now this is how we rock!)\n\n[Verse 1: Termanology]\nYo! Hopped off this phone with Bun, rolled this blunt\nTold him son your album so cold I'm numb\nFittin to go plat, but If I go gold just once\nI copped enough coke and guns to open Trump\nTowers of my own, then I control the slums\nWhere the birds and the rats and the roaches from\nFar as rap goes, I'm the coldest one\nJust gimme the mic, I'll show you the soul of Pun\nLike, I'll grip the mini matic irratically fat as family\nSnatchin vanity Violator couldn't manage me\nUh! They don't really want it what Tony Montana be sniffin\nDanity Kane so insane is reality\nMy pain is reality, grippin this mic\nAfter me other rappers don't sound that TIIIIGHHHHHHHHHTTTTTT!!!!\nOlogy in the place with Bun B\nAnd we got what it takes to rock the mic RIIIGHHHHHHHHTTTTTTTTTT!!!!!\n\nChorus: Termanology] (DJ Premier scratching)\nThis is how we (ROCK) This is how we (ROCK)\nThis is how we (R-R-R-R-ROCK-ROCK)\nThis is how we (ROCK-R-R-R-R-ROCK)\nThis is how we (ROCK-ROCK-R-ROCK\n\n[Bun B] (DJ Premier scratching)\nThis is how we (ROCK) This is how we (ROCK)\nThis is how we (R-R-R-R-R-R-R-ROCK)\nThis is how we (ROCK-R-R-ROCK-R)\nThis is how we (ROCK-R-ROCK-Now this is how we rock!)\n\n[Verse 2: Bun B]\nI be jumpin out the bushes like a jag, boy\nBetter watch yo' back boy, the king of the trill is in the buildin\nKillin the track boy, act boy, like you want do it\nGet smacked, boy, head cracked boy, I thought you knew it\nMatter fact, boy, you in the wrong place with the wrong one\nOn the shark pier and you 'bout to walk the long one\nSing a sad song son, play a violin\nTo your preacher to the choir, G I'm about to end you\nBun B, the best that did it and still doin it\nCut on the track and I'm black and blue in it, ruin it\nLike a, wet dream better keep it movin like a jet stream\nWith me and Termanology out to get cream\nWe on the next scheme while you still plannin the first\nDyin of thirst, I po' out a bottle for Pimp C!\nUGK fo' life, nothing above it\nWith Premier on the beat and Termanology you gotta love it!\n\n[Hook: Bun B] [*Termanology] (DJ Premier scratching)\nThis is how we (ROCK) *This is how we (ROCK)\nThis is how we (R-R-R-R-ROCK)\n*This is how we (ROCK-R-R-R-ROCK-)\nThis is how we (R-R-R-R-R-R-ROCK-ROCK)\n*This is how we (ROCK) This is how we (ROCK)\nThis is how we (R-OCK-R-OCK-ROCK)\nThis is how we (ROCK-ROCK-ROCK-ROCK)\nThis is how we (ROCK-R-R-R-R-R-ROCK!)\n\n[Verse 3: Termanology]\nPut the mind and the body with the rhyme and the shotty\nGonna find me a mami sippin lime and Bacardi\nGet down like John Gotti with the mafia behind me\nGettin profit like the sign me army closin when ya find me then\nUh, I keep bombin that Osama ship predominately coffins\nAt the novelist involed in this more tonic shit\nYou gotta follow it the cat you pop a bottle with\nStill, go on and rock this shit Bun what's the politics?\n\n[Verse 4: Bun B]\nTerm, you already know it's Obama '08\nCats in the streets is like, mo' skama, mo' weight\nThe rap industry is mo' drama, mo' hate\nMo' Money means you got Mo' Problems on yo' plate\nIt's all good though cause we still in the hood though\nGettin love where these fake rappers wish they could go\nI wish they would show they face in the ghetto\nWe put 'em in a nice, deep, dark place in the ghetto, for real!\n\n[Hook: Termanology] [*Bun B] (DJ Premier scratching)\nThis is how we (ROCK) This is how we (ROCK)\n*This is how we (R-R-ROCK-R-R-R-ROCK)\n*This is how we (R-R-R-R--R-ROCK)\nThis is how we (ROCK-ROCK)\nThis is how we (ROCK) *This is how we (ROCK)\nThis is how we (ROCK)\nThis is how we (R-R-ROCK)\nThis is how we (ROCK-Now this is how we rock!)"}], "artist": "Termanology"}