{"songs": [{"year": "2006-10-10", "album": "Atlantis: Hymns for Disco", "image": "https://images.genius.com/d7c9472cd5fb6703b27f2eb1f517e8f1.1000x1000x1.jpg", "title": "FlyPaper", "lyrics": "[Intro]\nFeeling stuck?\nSelf-loathing?\nShoe gazing?\nPesky flies getting you down?\nTry new supersonic FlyPaper\nIt's catchy, and it's pop\n\n[Bridge]\nFlyPaper, do it again, do it again\nDo it again, can he do it again?\nDo it again, do it again\nDo it again, can we do it?\n\n[Verse 1]\nYa, you see it everyday\nAll the people standing at the train station\nLeft, right, left, right, left, right\nWe don't talk to each other now\nWe're an alien nation\nUp, tight, up, tight, up, tight\nI hope one day some things can get better\nI hope some way our hearts can change the weather\nAs we walk this yellow road\nAnd try to shake the load\nIn this 4-1-6 area code\nIt's another night in TV land\nI say\n\n[Chorus]\nI'm not one to repeat myself\nBut if it ain't broken\nDon't fix it\nI see you burning all that midnight oil\nBut I'm caught between a rock and a hard place\nThat's why I'm walking in the city with a hard face\nSeems I'm afraid of being afraid\n\n[Bridge]\nDo it again, do it again\nDo it again, can we do it?\n\n[Verse 2]\nYou think I don't know\nOh how I see your\nEyes run dry\nSubliminal pro\nI've got to go\nPlus I couldn't be the\nPawn in your chess\nGame for fame\nBut checkmate, I've got a new mind state\nPlus I've got the power of the cat, rotate\nI'm, straight digging in my record crate\nLights-only party so delete the hate\nTime is a thief that leaves nothing behind\nAnd I've got no grief for acts of crime in this fair city\nI'm just a man who wants to understand\nWho wants to know the plans, tell me the plans, tell me the plans\n\n[Chorus]\n\n[Bridge]\nDo it again, do it again\nDo it again, can we do it?\n\n[Verse 3]\nYo, ok it seems at times that I'm under hypnosis\nI suppose this city life is a process\nI wrote this, like a million years ago\nTried to get out of the game a million tears ago\nBut I'm back, chillin', illin' for top billin'\nLevitate to the ceiling by resurrecting the feeling\nHip-hop, it started out in the park\nAre we lost in the dark? I think we maybe forgot?\nBut never mind that, we like to party\nWe don't start trouble and we don't bother nobody\n'Cause Y is a letter with a long long tail\nAnd I write these lyrics you can feel like brail\nHail, the most high, I post high\nI used to swing low, now I let the crabs know that\nMy antimatter is shattering any ladder thats crawling with snakes\nMake no mistake we not fake, wake up\n\n[Chorus]\n\n[Outro]\nOoh, got stuck, ooh, FlyPaper\nI don't care, I don't care\nWho's that girl? She's FlyPaper\nShe don't care, she don't care"}], "artist": "​k-os"}