{"artist": "A$AP Ferg", "songs": [{"title": "Furious Ferg", "image": "https://images.genius.com/afffcb545c2460afe7c97abc46e6a2a0.488x490x1.jpg", "album": "Furious Ferg", "lyrics": "[Verse]\nYeah!\nWhip, whip, whip time to show the diamonds dancing (Yeah!)\nDiamonds in my mouth you see me talking lavish (Right!)\nWe was in the church we ain't have nobody (Yeah!)\nWe was in the sand and about that action (Uh!)\nAll my niggas in the field what ya wanna do? (Yeah!)\nWork, work, work, know you niggas gettin' murked (That's right)\nYammy was the worst when he was off the percs (Yeah!)\nLive it up for Yambroghini, now we gettin' turnt (O!)\nNiggarachi hit the gram with the snake pants (Yeah!)\nAdidas deal got me looking like I break dance (Yeah!)\nIce bucket challenge on my chain dancing (Alright)\nRainbow wrapped around my wrist like a ace band (No!)\nWhip, Whip, Whip time to show the diamonds dancing (Yeah!)\nDiamonds in my mouth you see me talking lavish (Get down!)\nWe was in the church we ain't have nobody (Alright)\nWe was in the sand and about that action (No!)\nAll my niggas in the fed what ya wanna do? (Yeah!)\nWork, work, work, know you niggas gettin' murked (Right!)\nNiggas is the worst when they off the syrup (O-o)\nRest in peace to poppa Ferg\nWe gon' go berzerk (Oo!)\nPlease don't get me started I'm the king of Harlem (Ye-yeah!)\nI'm the king of New York\nMy throne is in the garden (Alright)\nI'm a baller, just signed a deal with starter (Ye-yeah!)\nI hop from sister sister like my name is Roger (Rawrr!)\nGotta get my credit up gotta get some houses (Yeah!)\nI take my girl and cash out I buy her different blouses\nDamn, I remember sleeping on 'em different couches (Yeah!)\nAnd now I fly to places and I can't pronounce it (Rawr!)\nTake the Henny bottle to the face and douse it (Rawr!)\nWorkin' at am lookin' stucky like I play for dolla's (Rawr!)\nForeign chick up in my crib she said my place a palace (Rawr!)\nBut I never noticed that because I'm chasin' dolla's (Rawr!)\nWhip, Whip, Whip time to show the diamonds dancing (Ye-yeah!)\nDiamonds in my mouth you see me talking lavish (Right!)\nWe was in the church we ain't have nobody\nWe was in the sand and about that action (Rawr!)\nAll my niggas in the field what ya wanna do? (Ye-yeah!)\nWork, work, work, know you niggas gettin' murked (Alright)\nPut a nigga in my verge didn't he get murked (Ye-Yeah)\nRest in peace to poppa Ferg\nWe gon' go berzerk (Oh!)", "year": "2017-06-13"}]}