{"artist": "Valete", "songs": [{"title": "Rap Consciente", "year": "2017-06-02", "lyrics": "[Intro: NBC]\nTu sabes o que é um Homem?\nUm Homem não tem preço...\nTu sabes o que é Hip-Hop? Hip-Hop? Hip-Hop?\n\n[Refrão:Sergin]\nSe é para morrer, morremos de pé\nSe é para morrer, morremos de pé\nSe é para morrer, morremos de pé\nDe pé...\nDe pé...\n\n[Verso 1: Valete]\nMorte do meu pai afundou-me no alcoolismo\nTu sucumbias se vivesses o meu transtorno\nQuerem que eu faça música no meio do cataclismo\nEu estive perto do abismo sem retorno\nXeg, viu a minha aura dissolvida\nNão vou dizer aqui aquilo que fizeste por mim, X\nViste a minha paz absorvida pelo desgaste\nX, salvaste-me a vida, tu sabes\nEstava em silêncio a viver a minha miséria\nDecadência funérea como dezembros na Sibéria\nEu vi a vossa caminhada para o universo Pop\nE vi como emporcalharam o Hip-Hop\nBué sons de brisas e primaveras\nAté curto sons de amor mas bro, tu exageras\nCom jeitinho faz beicinho, exibe autoestima\nE acaba esse videoclip com um beijinho na menina\nPiroso do caralho!\nProdigioso para eles, para nós mais um paspalho\nCrónica ânsia para ser a estrela propalada\nQueres ser a estrela mais falada, com a música mais badalada\nQueres ir da calada até à ascensão supersónica\nCom essa salada sinfónica de baladas radiofónicas\nPiroso do caralho!\nÉs mesmo o tipo de MC excrementoso que eu estraçalho\nComo se a cultura tivesse sido subornada\nEstamos sem voz há muito tempo, nação desgovernada\nLetras eram granadas, agora são gangrenadas\nRap burro, não temos opinião sobre nada\nManos em Angola perseguidos por activismo\nGeração Snapchat, ancorada no narcisismo\n3.ª Guerra Mundial entre Ocidente e Jihadismo\nE nós com rimas de ostentação e materialismo\nHip-Hop em chamas, tenho de ser o MC bombeiro\nDizer que somos azeiteiros, vendidos, é lisonjeiro\nAntes sentias o frisson do nosso rap guerrilheiro\nAgora já fazemos alianças com kizombeiros\nObservo as sinalizações\nE o teu estilo de prostituta nessas ritualizações\nNós só queríamos saber de rimas e inovações\nAgora só preocupados com visualizações\nTu viralizas, enquanto vigarizas\nDez milhões de views mas quem é que visualiza\nEssas mesmas pitas atadas na alienação\nDesesperadas por atenção, descascadas no Instagram\nNunca conquistas a fama, tu és só cobaia\nCapas de revista, deixa isso para a Maya\nDeixa a passadeira vermelha e essa azáfama\nGlobos de Ouro, deixa isso para a Ágata\nFalo sem superioridade moral\nNo passado em momentos também fui paradoxal\nFaltou-me essência, para manter a dissidência\nFaltou-me cadência, firmeza, coerência\nMas estou de volta para dar a reviravolta\nDe volta ao rap de revolta, pronto para qualquer embate\nNão há empates, de volta ao rap com tomates\nNão há derrotas, de volta ao rap de combate\nDe volta à nudez, yeah, de volta à rudez\nOutra vez de volta para acabar com tanta mudez\nOutra vez de volta com o feeling do rap português\nSem porquês, morte ao rap burguês\nComo um bruxo, com o capucho na cabeça\nRimámos pobreza hoje rimamos roupas de luxo\nMuito rap meigo, muito rap murcho\nNão se poupa cartuchos, estou de volta ao rap sujo!\nDe volta ao rap sujo!\n\n[Refrão:Sergin]\nSe é para morrer, morremos de pé\nSe é para morrer, morremos de pé\nSe é para morrer, morremos de pé\nSe é para morrer, morremos de pé\nSe é para morrer, morremos de pé\nSe é para morrer, morremos de pé\nDe pé, de pé...", "album": null, "image": "https://images.genius.com/009c99ddac6ccae54a2adcba9cc66f15.1000x563x1.jpg"}]}