{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "D", "lyrics": "Into:\n(Kendrick Lamar speaking)\n\n\"Nah, what you get outta, outta not writing your stuff down on paper, you get the more-you know the...expression, the feeling yourself. You know what you want to say; instead of reading a paper that sounds read, it sounds narrated. Unless you wanna do it narrated...\n\n[Hook: Kendrick Lamar]\n\nWhat if a dream was reality and reality was a dream?\nAnd as complicated as it seems, if things we imagined actually happened?\nAnd real life situations was artificial\nThey say we only live finna die\nImagine if we're already dead, waiting to live, living in hell\nTrying to cross over to heaven we're confusing ourselves\nPlanet earth's like Oceans 11, we're plottin' for the getaway\n\n[Verse 1: Kendrick Lamar]\n\nWhen my childhood friends get sent away to prison on their first offense\nIt's fucked up but listen, we study God but don't know him\nCriticize people that work on Sundays, two jobs just to feed their kids\nWell, momma's scratching lottery tickets knowing that it's just a fairy tale\nCus' we ain't gonna win\nEvery time that she's bubblin' in, it feels like the devil's holding a pen\n(shit)\nDon't mind me I'm just thinking again\nThinking out loud, thinking the opposite of proud\nCus' I'm disappointed at my self sometimes\nSelf-esteem gets lower than night strippers\nHard to write the right rhymes, inspired by true crimes\nIt's not a game, it's nothing to play with\nTurn it off then come back the next day, it's here to stay\nShow what it is\nI'm so infatuated with knowing something that's waiting after this life\nThat means what I'm thinking is right\nPunch, loop the beat for a minute\nMoment of silence for J. Dilla, he on his way home\nKnow he see me spillin' my heart, hope for it soon\nWait a minute [K. Dot!) you said turn it back on, bring it back\nIf dreams was reality\nIf it was cool for you to be a casualty\nThe only way you can escape poverty\nSay that I'm weird but obviously you didn't get it when I said it the first time\nYou're listening too far if you hear this part\nI suggest you go back and press rewind\nI fast forward to common thrust of a human\nDeep in my thoughts like Patrick Ewing in the paint\nLook what I brought to my state that they can't bring - the industry need a fix\nStick heroin needles inside politics, this is crack music\nO-pi-um, inside the veins of them, I don't abuse it\nCapture each moment like film, photo-shooting all my enemies moving\nDirect them to a casket\nGive it to 'em only if they ask for it, if they want...\nIf they wanna see reality [haha]\nI'm losing you again ain't I?\nAin't I, the perfect candidate to represent the fifty states?\nBlack President, they don't wanna see that\nIt's evident...pain is pain\nWe only love to hate each other that's striving for great-ness\nI swear to God that we live in a Matrix\nTake that blue pill then we start seeing spaceships\nKanye, west-coast niggas do it the best\nBring each other down, crab in a bucket of fit\nWe learn to live with it I guess\nI mean dive with it, since we're already dead\nTrying to cross over to heaven, that's what I said the first time\nGet it? Now little boy I gotta sit you down\nTeach you about the things that we live around\nMaterialistic things that we buyin' now means nothing later when the dream kick in\nFade me out, fade me out, fade me out, fade me out, fade me out, fade me out, fade me out, fade me out...\n\n[Verse 2: Punch]\nWhen the dreams was reality and money was love\nWhat would we do for a buzz to maintain our sanity\nChasing the wind, striving after this vanity\nTraveling, no direction, the aim is casualty\nAmerican dream or Scarface fantasy\nKilos of coke and the arms of black families\nWe use to it, our hearts draped in stone\nA mother's dreams for her baby boy to come back soon\nCus' he out pushin' that chrome, pursuing that cash\nEnd another niggas dreams when the fo-fifth blast\nNow another mother screams picking out his casket\nHarsh reality, it seems like it's simple mathematics, it's not\nIt's trigonometry (trigganometry) divided by some real life\nAnd he'll do it again just to get a mill' twice\nThe streets mowed him, can't make past that\nIt's not a dream it's reality, look where it's at [ugh]\nWhat happened in Manhattan happens all the time\nIn the hood, conspiracy to cover up crime\nNo nickel and dime, one shot pettiness\nI wrote it in my mind as a letter to the president\nWorld trade happened on the world stage\nSame stage look at us as some educated apes\nOn video stations women gyrating\nParading around, mind-raping the youth\nFade me out, fade me out, fade me out, fade me out, fade me out, fade me out, fade me out, fade me out...\n\n[Hook: Kendrick Lamar]\n\nWhat if a dream was reality and reality was a dream?\nAnd as complicated as it seems, if things we imagined actually happened?\nAnd real life situations was artificial\nThey say we only live finna die\nImagine if we're already dead, waiting to live, living in hell\nTrying to cross over to heaven we're confusing ourselves\nPlanet earth's like Oceans 11, we're plottin' for the getaway"}], "artist": "Kendrick Lamar"}