{"songs": [{"year": null, "title": "I’m Saafir (The Saucee Nomad)", "image": "https://s3.amazonaws.com/rapgenius/5500.JPG", "lyrics": "Artist: Saafir a.k.a. Mr. No No\nAlbum: Trigonometry\nSong: I'm Saafir (The Saucee Nomad)\n\nI'm Saafir, the Saucee Nomad (repeat 5X)\nAll day, all day, ery day, always\nI'm Saafir, the Saucee Nomad (repeat 2X)\n\nOut the side of the beat I slides out the gate like Snake Pliskin\nWith, heat fuming got more sauce than, Paul Newman\nI'm the shit I'll make you bowel, movement\nRunnin through em without the celery\nNever embraced when thinkin cleverly is a felony\nHey hey, hey-hey hey, I got an A A-A in mixing elixirs\nRemedies putting you under the laughing gas, like a dentist\nIf you seek I got prescriptions that work in three minutes\nAnd some change, here's your receipt, here's your re-ce-ee-hee-pt\nI keep saying that al-lee-hee, couldn't help me from these\nEm-cee-ee-hees, that keep saying wack rhizymes to enzymes\nI regurgitate and reverse your fallopian tube growth, rate\nYou so fake you belong with a strong ass-whooping\nI got your ass cooking, ho ho ho like turkey beefy bacon\nIs what you're feelin, just a professional opinion from the doc-torrr\nYou don't believe me then, let's take tests test me\nPlease do so so I can have ya, full Stranded at Sea like Caruso\nHave you lookin over The Aftermath like Dr. Dre\nMe make a mill-ion, lambingas they say\n\nI'm Saafir, the Saucee Nomad (repeat 4X)\nEry day, all day, all day, always\nI'm Saafir, the Saucee Nomad (repeat 4X)\n\nI'm the type of ninja that'll laugh, then blast your ass\nThen pass the bomb that'll fuck with my concious a little but I'll stay calm\nIn it, armed, I'm all about self-preservation in a fighting stance\nAlways ready to get down then run up in your ass like ants\nBut I'd rather pull plants by the root and get, smoked\nWith my crew makin greenery, and scenery the vision of a landscape is\nWith a handful of papers, get the papers\nWith the President faces on the front, with the eagle grabbin arrows\nAnd the pyramid, and the owl that shrunk, huh dollar bill y'all\nIt's amazing how you keep paper grazing my palms and I make it stick\nLike a magnet like a magnum never stagnant when I'm stickin it\nMovin keep my motion, all blurred most likely, a visuallusion\nI have you on the search for attachment, but not to focus\nHave you won a contest as a finalist, on whose the brokest?\nFlows stay saturated and drenched, I've never had to soak it\nI'm the wrong breed to fuck with, I'm mixed with Grinch and locust\nHocus motherfuckin pocus, say what?\n\nI'm Saafir, the Saucee Nomad (repeat 4X)\nI'm Saafir everyday all day always\n\nPsssssh, nigga please while you countin sheep it's Z's\nI be countin cheese curin that, wack rap disease\nMe and Doctor Dot Blocker on the off switch leavin\nYour highbeams frost-bit, with overdose\nHomo songs don't swing on the long, microphones\nAnd if you're rich I'll send that doc-torrr to your mansion\nWhile I'm, rock shit like avalanches\nMakin your broad do dirty dances\nYou takin chances with them sleepin pills\nCause that's what got your conciousness\nThat's why I'm droppin this, don't sleep...\n\nI'm Saafir, the Saucee Nomad (repeat 5X)\nI'm Saafir, all day ery day, always\nI'm Saafir, the Saucee Nomad\n\nIn here... (I'm Saafir) ...with the Porch Monkeys\n(I'm Saafir) Bananas, Knuckles (I'm Saafir)\nBringin it to you (I'm Saafir)\nOne love to Mr. No No, for lettin me come on this track\nAnd rip it for my poleops, that's it, hip-hop junkies and Porch Monkeys", "album": "Trigonometry"}], "artist": "Saafir"}