{"artist": "Wale", "songs": [{"title": "5 Minutes", "year": "2008-10-10", "lyrics": "[INTRO: Wale]\nThis is only for the hip-hop lovers\nYou want that bullshit - turn the radio on\nSkyzoo, Wale\n\n[Verse 1: Wale]\nThe one and only, homey still Thelonius with it\nThe only one spittin' like no one else livin'\nNo one that's breathin' is seen as an equal\nCould breathe on the mic and give it epileptic seizures\nThey turn narcoleptic when them niggas start speakin'\nRidin' in that ES with my Nefertiti queen\nAnd eyes low, pardon me, hah\nWe smoke the kind of green that turn the Simpsons Bruce Lee on\nHi-Ya, the higher part of my hierarchy\nMy mind potent like you high off keys or something\nShit, we don't believe none of them\nMotherfucker, your career is a conundrum\nAnd none drum, iller than Ninth Wonder\nIV, no I can sell like mitochondria\nI'm out the country, I'm jet lagging\nThey can't see me, I'm like the team that brought Brett back\nAnd I'm man-genie, flyer than the rest of them\nWale Ovechkin\nFuckin' with that ice, them Landover niggas check ya\nCheck one-two, the mic is my weaponry\nLyrically or physically, step to me, you rest in peace\nWatch what I do to beats, I don't need no jewelery\nI was underground but wasn't trying to renew the lease\nYeah, hello mainstream, I'm a walking dollar bill ain't a damn thing changed\n\n[Verse 2: Skyzoo]\nI got mine while the rest of ya'lls was still looking\nI'm top five, but no begging, dawg, I for real took it\nSo how they grilling me is literally just serenity\nLiterally, if you say you feeling me, then you feel Brooklyn\n[Wale: Whatup!]\nAnd I don't do colorful jeans or shiny kicks\nMy shoe game is Penny in ninety-six\nI move aim, hit 'em and final flip\nWhether it's a beat or a scam\nI gave ya'll wizardry with my hands\nI made ya'll want to be what I am\nAnd as far as your fades I raised them all underneath where I stand\nI'm pushing it for the corner\nKeeping them on the hip\nAnd, yup, I gave lyrics a reason to want to live\nFresh off the plane, Hong Kong, Beijing\nFelt like I was home, the groupie love was the same\nI'm Kobe in an orange jersey\nAnd wrote this from 4:25 to 4:30, hah\n\n[Wale] Okay\n\n[Skyzoo] Yeah, I mean, I literally wrote that from 4:25 to 4:30\n\n[Wale] That's about five minutes, guy\n\n[Skyzoo] For real\nThey call me, S-K-Y-Z-O-O\n\n[Verse 3: Wale]\nAnd I'm Wale Folarin, was raised on go-go\nThey style is so-so, my Louis from So-Ho\nHoping that hip-hop can surface and go-go again\nThey go major, the flow is no longer\nSo everything retro come across so corny\nEverything from Bradfords to gimmick spitters\nTo every nigga who rap and say, 'My shit's different!'\nSo get with us or lose like them niggas\nSpent more on these kicks than Pac-Man spent on strippers\n\nHaha! This just the beginning of the, uh, you know, the whole process of this Back to the Feature mixtape\nDC whatup?\nBK whatup?\nPG whatup?\nMoCo whatup?\n\nLet me do some shoutouts\nMo betta - what up?\nUCB - what up?\nHey Sycamore, whatup?\nYou ain't' doing shit til you put 10 gees on fantasy football\nThat's when you know you doing shit\nYeah, bitch", "album": "Back to the Feature", "image": "https://images.genius.com/5c5f10369e0207f5cea994743acd45c2.500x500x1.jpg"}]}