{"songs": [{"year": null, "image": "https://images.genius.com/beef62d8ea8657f2a6cd799581e7499b.600x600x1.jpg", "title": "Blood Money", "album": "See Me On Top III", "lyrics": "[Hook:]\nNiggas gettin' in my way, don't wanna see me get paid\nBlood money, same place that nigga talk be the same place that nigga lay\nBlood money, keep the heater close to me, it gets cold off in these streets\nBlood money, can't starve watching niggas eat, I'm takin' food out the belly of the beast\n\n[Verse:]\nI reign supreme, give me the cream or I'm shootin'\nPistol whip the driver in the head just for movin'\nI got the scoop\nFrom this ho that I knew\nShe talked about the lick\nAs she sucked on my dick\nI called up my big bro, couldn't do it solo\nLate night mission, so I popped a couple (?)\nSki mask and black glove, I hit 'em with the fire\nIf niggas actin' tough then we takin' niggas lives\nThe play was in motion, I grabbed the nigga ear (?)\nThe stupid nigga (?), the chrome millimeter\nExtra clips in case a nigga in the bushes\nTear through him like tissue, I leave his chest mushy\nThe hit was spectacular, miraculous\nScored some keys, now I'm feelin' fabulous\n100 thou in the duffle\nI'm leavin' niggas muffled\nNo witnesses for the shit we did\nButch Cassidy and the Sundance Kid\nGot a house being built, so I stack them bricks\nI'm livin' large, Lambos in garage\nCredit is A1, no more knives and guns\nShit was gravy, I got a little lazy\nNiggas start talkin' in that hood, bitch page me\nRaided a spot with AKs and Glocks\nThey got her and her boyfriend tied up at the docks\nShe ain't know who to call so she call my phone\nNow they ask you who done it? So you call my phone\nHang up, grab the banger, threw Biggie in the changer\nI'm seein' cars pull up, so I know I'm sensing danger\nGet on the phone, call my big bro up\nYo, we got beef over cheese and it ain't cold cut\nHe (?) no surprise, wipe the cold from your eyes\nEither rally the troops or your little brother dies\nBlood money!\n\n[Hook:]"}], "artist": "Big K.R.I.T."}