{"artist": "Immortal Technique", "songs": [{"title": "Harlem Streets", "lyrics": "[Verse 1]\nYeah, Harlem streets stay flooded in white powder\nLike those motherfuckers runnin' away from the Twin Towers\nGunshots rock the Earth like a meteor shower\nBowlin' For Columbine, fear givin' the media power\nInnocence devoured like a chicken spot snack box\nGovernment cocaine cooked into ghetto crack rock\nCorrupt cops' false testimony at your arraignment\nCheck to check, constant struggle to make the payments\nWorkin' your whole life, wonderin' where the day went\nThe subway stays packed like a multi-cultural slave ship\nIt's rush hour, 2:30 to 8, non stoppin'\nAnd people comin' home after corporate sharecroppin'\nAnd fuck flossin'! Mothers are tryin' to feed children\nBut gentrification is kickin' them out of their buildin'\nA generation of babies born without healthcare\nFamilies homeless, thrown the fuck off the welfare\n\n[Scratching]\nHomicide Harlem, blaow! What's the problem?\nHomicide Harlem, blaow! What's the problem?\nHomicide Harlem, blaow! What's the problem?\nHomicide Harlem, blaow! What's the problem?\n\n[Verse 2]\nIt's like Cambodia, \"The Killing Fields\" uptown\nWe live in distress and hang the flag upside down\nThe sound of conservative politicians on television\nPeople in the hood are blind, so they tell us to listen\nThey vote for us to go to war instantly\nBut none of their kids serve in the infantry\nThe odds are stacked against us, like a casino\nThink about it: most of the Army is black and Latino\nAnd if you can't acknowledge the reality of my words\nYou just another stupid motherfucker out on the curb\nTryin' to escape from the ghetto with your ignorant ways\nBut you can't read history at an illiterate stage\nAnd you can't raise a family on minimum wage\nWhy the fuck you think most of us are locked in a cage?\nI give niggas the truth, 'cause their pride is indigent\nYou better off rich and guilty than poor and innocent\nBut I'm sick of feelin' impotent watchin' the world burn\nIn the era of apocalypse, waitin' my turn\nI'm a Harlem nigga that's concerned with the future\nAnd if you're in my way it'd be an honor to shoot ya\nUproot ya with the evil that grows in my people\nMakin' them deceitful, cannibalistic, and lethal\nBut I see through the mentality implanted in us\nAnd I educate my fam about who we should trust\n\n[Scratching]\nHomicide Harlem, blaow! What's the problem?\nHomicide Harlem, blaow! What's the problem?\nHomicide Harlem, blaow! What's the problem?\nHomicide Harlem, blaow! What's the problem?\nBlaow!", "image": "https://images.genius.com/c628c98f9d53f039b060e7f0369c15b4.220x220x1.jpg", "album": "Revolutionary Vol. 2", "year": "2003-11-18"}]}