{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/70c6e506a91f6dabdd23cad304812ce3.533x533x1.jpg", "title": "Arguements", "lyrics": "Martin Lawrence(speaks while choruses are sang):\"look here, lemme tell you something, ya know. I'm tired a arguin im tryna share this wit chu,ok? I'm tryna giv this to yooou, ya know what im sayin? To Yooou, you know? This..if you don't, y-you can't get wit the indoor pool, the outdoor pool, or lil music studio thing, the little bowlin thang, ya know what im sayin? Hm, this is yours. But chu don't like that, then fiiine man. You can leave. You can allllways leave. I'm not holdin you here\"\n\nChorus)\nWe can't even sit & talk\nWitout chu arguin\nGirl you must be outta your mind\nYou're the one who started it\n(Gangsta, ugh!)\n\n1st Verse:\nI gotta girl at home\nBut she don't cook\nI have my condoms in the store cause she won't look\nAnd she neva-eva go to the grocery sto\nSo I figure it's safe to pull a grocery-ho\nShe was buyin Alize out the liquor aisle\nShe said, 'i hope its not too ghetto'\nRock-Dawg, Gold Force, Baggy style\nI kept her number on file\nFor my girl be actin wyld\nLike last week, I told her take me to the mall\nBut she don't drive\nMy otha girl picked me up at 3:05\nShe got a brand new car, sixteen\nNow the car only 1 yrs old, oh\nMan, but the body look grown, \"whooa!\"\nBefore I catch a case I betta take my ass home\nWhere the problems is\nArguments be daily like\nCarson is\n\nMartin again:\nFuck you. Fuck yooou. I on't give a fuck whatchu have. This little indoor-indoor, outdoor pool, little bowlin alley. Material buuullshit. It don't mean shit. It don't make what's in the muthafuckin heart\"\n\n(Chorus)\nWe can't even sit & talk\nWitout chu arguin\nGirl you must be outta your mind\nYou're the one who started it\n(I'm gangsta, ugh-ugh)\n\n2nd Verse:\nHol' up, wait a second man\nThat's that thrift sto info\nThat's sauce again\nWhy don't chu talk to the mouth a the horses\nBout my porshes?\nCondo's in front a the golf courses\nInstead you stay up\nCount every second like a fake rolley\nI'm real, so you know I move real slowly\n\nThe way this relationship should go if you know me\nI ain't call you\nYou wanna know why? I mean you know why\nHow on the low I push jet-skee's so I\nCouldn't return them pages, on my motorolla\nNextel, my cell it don't work down there\nAnd what happened in cancun, stay down there\nWhat's happenin here, made me wish I stayed down there\nTake a seat. Why you always makin a beef?\nYou know these walls too thin in this apart-a-ment\nNow everybody hearin our arguments\nWhat the problem is?!?!?\n\nMartin again: (audience laughs & applauds) \"Why you actin like this? But letchu have some fly shit. Some nice beautiful shit. (Gangsta) They act like they gon leave yoou. You can tell em look here, Ya know. I'm tired a arguin\"\n\n(Chorus)\nWe can't even sit & talk\nWitout chu arguin\nGirl you must be outta your mind\nYou're the one who started it\n(I'm gangsta, ugh-ugh)\n\nLast Verse:\nMan boo you know what I do\nSo don't trip when I come home after two\nOr three or four\nI ain't messin wit them girls no more...this week\nThe benz coup is so sweet\nWhen I roll down the street\nTears roll down her cheeks\nShe said, 'you must love that car more than me'\nA nigga I was wit chu before the cheese\nSo you need to work on your priorities\nIf she went wit 'Fabulous'\nI bet that she'd be a:\nAR-GU-IN-G, Please\nI'm not actin like this cause I'm gettin spins on\nWU-KR, Cin-ci-nat-ti\nYou think I get my voice so deep\nLike WU-KR, cin-ci-nat-ti\nThat's how much of a fuck I give\nYou seen cribs? That's how the fuck I live\nAs far as this...\n\n(Chorus)\nWe can't even sit & talk\nWitout chu arguin\nGirl you must be outta your mind\nYou're the one who started it"}], "artist": "Kanye West"}