{"songs": [{"year": "2015-02-12", "image": "https://images.genius.com/bc3682694015b348b51fa65b502ea038.715x716x1.jpg", "title": "Stop", "album": "Words Paint Pictures", "lyrics": "[Sample]\nTake your time\nDon't be in a hurry\nYou don't have to...\n\n[Verse 1: Rapper Big Pooh]\nLuxury vehicle, not a drop of white in it\nPersonal license plate so they know it ain't rented\nCruising by the Cruiser so they got to see who in it\nA young black male with the intent to sell\n\"Happy\" through the speakers bump a lil' bit Pharrell\nGo easy on the gas cause these cops now shell\nFive miles later there's another on the trail\nA nigga sweating bullets like he moving by the scale\nLights flash and life does too\nMake a decision, what the fuck you suppose to do?\nWhen the law is in the rear view to serve no protection\nFiring shots off, no discretion\nFirst impression can be your last one\nYou visualize when you pass 'em\nWe know the stories and the scene is a continuation\nQuiet street to enforce this extermination\nThrough your mind reverse the situation\nMike shot with his hands held high\nAnd John got killed because of a damn lie\n[Kasheem] killed blocks away from where Big Mike died\nOscar got shot with his hands cuffed behind\nShawn killed the night before his wedding that was tough\nDiallo shot at 41 times, these cops are nuts\nVictor shot handcuffed in the cop car\nThey ruled it suicide so tell me I'm not far\nFrom being off when I'm thinking just to run\nIt don't matter that I'm innocent when they pointing the guns\nMy life is in the balance\nAnd I was never trained for this challenge\nSo to me that's a lose/lose\nThis ain't the way we trying to make it on the news\nMama hearing stories 'bout her baby that ain't true\nSlander in the first\nDehumanized before you even lowered in the dirt\nShot at nine times when you was just leaving work\nNow who afraid of whom?\nCops drawing guns on black males like high noon\nGuilty I assume what they thinking cause I look\nLike one of them guys featured in they book\nThey ask me where I'm going\nState the violation\nRight on red light\nWhat's my occupation?\nLicense and registration\nTell me where you coming from\nI search your car, any drugs any guns?\n\"That's only if you plant it\" I respond with a smirk\nHe shot a look back, my response was knee jerk\nLet off with a warning consider myself blessed\nOnly a few alive can understand that stress\n\n[Hook: Steve Roxx]\nAnd there is sometimes that everybody gets lucky\nAnd I know the feeling\nWhen I'm stopped\nI wanna go somewhere\nSo far away from here\nBut I don't think he getting me\nSo what? When I'm stopped"}], "artist": "Rapper Big Pooh"}