{"songs": [{"year": null, "image": "https://images.genius.com/15a6f267cd4cff3d055d74576b9029ee.500x500x1.jpg", "title": "Bigger Pimpin (Chopped & Screwed)", "album": "See Me On Top", "lyrics": "[Hook:]\nBigger pimpin' they know me\nKilla K that OG\nGive respect that they owe me\nGive respect that they owe me\nBigger pimpin' they know me\nKilla K that OG\nGive respect that they owe me\nFuck niggas can't hold me\n\n[Verse 1:]\nSitting low in my seat drop it's top down it's summer cuh\nNever falling off, all day for ballin', my flow stay magnificent\nKnow the K got flow for days, I raise the bar, and I'm stabbin'\nMotivated by all these haters, so celebrate my action\nBigger pimpin' while I diminish all terrorists and competition\nThat (?) with me going gold, set a plan, I'm making millions\nHow I learned means how I'm livin', so I be tellin' her till I'm gone\nIn a Jag with a yellow throne and a yellow bone (?) on\nDVD's in my dash, pimpin', 24 with that glass in it\nStretch my paper like rubberbands, my nickname's elastic\nBattle me in that 8-Mile, I'm similar to that rabbit\nTrack poppin', my (?), you just got your ass kicked\nBe amused by trappin' nigga, either way I'm slabbin' nigga\nShine out, shine later, either way I'm makin' paper\nClose mouth, don't get fed, that's why I hit the block\nTwistin' corners and breakin' laws, paper chasin' and wreckin' shop\n\n[Hook:]\n\n[Verse 2:]\nSecond round, it's going down, I go hard in the paint boy\nHate me and my (?) boy\nSecond round, it's going down, I go hard in the paint boy\nHate me and my (?) boy\nSittin' pretty where I wanna be, I'm the first pick of this industry\nWhole team, going hard, write tracks and making beats\nClear as day, I gotta grind and gotta shine to get on\nOh shit you might (?), Oh shit you might (?)\nLay it down all on the table\nI'm spittin' facts, they tellin' fable\nMoral of day kids? Don't believe that fake shit\nWanna learn? no problem cuz, I'd gladly be they teacher\nShowin' out, you leanin' like the tower of Pisa\nEither respect my grind or keep your ass on the sideline\nEverytime you seein' me, you slowin' up like caution sign\nOften I'm labeled the best\nNorth, South, East, and the West\n(?) with K, do a show?\nSee a 10, nothin' less\n\n[Hook:]"}], "artist": "Big K.R.I.T."}