{"artist": "Pimp C", "songs": [{"album": "Long Live The Pimp ", "title": "Ain’t Said Shit", "image": "https://images.genius.com/674567be14a7f8b6e0eee4a149f04bd4.220x220x1.jpg", "lyrics": "[Hook: Ty Dolla $ign]\nIt's realness over millions\nYou niggas fake it till you make it though\nIt's love over money\nWon't put my bitch over my niggas though\nYeah I had done seen a lot of fake shit\nThis bitch ain't bad, she basic\nThese niggas ain't said shit\n\n[Verse 1: Pimp C]\nUh uh\nHoes sell pussy and I be selling rap's\nI don't gamble with this game I ain't in to shooting craps\nI don't fuck with no dice and I don't play with no cards\nBut I know how to get some paper with my dick when it's hard\nI squeeze it like some lard, I'm a pimp like a hoe\nI get down and dirty like a pit bull dog\nLose or fall, all jumping love it\nI got the Bentley through the fall with having money\nI've been hearing Devin since the Odd Squad\nOriginal, them other niggas broads and frauds\nWalking over your for sure pussy\nTryna get some more pussy\nThem nigga gave my piece to suck in the right lane\nTell my bitch she still on my team\nCause she know if I was with it was all about some cream\nTell my bitch she still on my team\nCause she know if I was with it was all about some cream\n\n[Hook: Ty Dolla $ign]\nIt's realness over millions\nYou niggas fake it till you make it though\nIt's love over money\nWon't put my bitch over my niggas though\nYeah I had done seen a lot of fake shit\nThis bitch ain't bad, she basic\nThese niggas ain't said shit\n\n[Verse 2: Devin The Dude]\nIt's time to roll, who got a cigar?\nOh shit I do, let me get that hoe from out the car\nFix it up and twist it up right quick\nThere's no surprise why my eyes like this\nSee I keep a cold blank\nI smoke and hang all over the wall\nThe weed is good and stink\nWhile putting my thing all over you love\nBut I'm never hard on them, I pet the cat softly\nIf papers involve I pull out my black sharpie\nBecause I'm much too cool to lose\nTo hot to be held\nIt's time to bail when the pussy starts to smell\nAnd grip the grain like my man C\n'Cause strangely mainly lames be tryna hang me\nBut I keep flipping keep stepping\nKeep repping keep accepting all the head the hoes be giving\nIts Devin in the house\nSweet off in my mouth\nAll the time I'm high high high\n\n[Hook: Ty Dolla $ign]\nIt's realness over millions\nYou niggas fake it till you make it though\nIt's love over money\nWon't put my bitch over my niggas though\nYeah I had done seen a lot of fake shit\nThis bitch ain't bad, she basic\nThese niggas ain't said shit\n\n[Outro: Pimpin Ken]\nYeah yeah yeah man\nThis your boy www.pimpinken.net\nWelcome back\nHey man dig this man\nMe and my man Pimp C often times had conversation\nAnd I always used to say \"hey yo pimp man\nListen man pimping got to be in your blood man\nBut not in your surf mud\nAnd definitely not up under yo rug, you dig?\"\nSo man like these guys want to simp to pimping man\nBut you know what I'm saying\nYou can't simp to pimping\nYou know pimping got to be in you man\nAnd not on you man, you know what I'm talking bout?\nYou got to have your pimp cologne on man\nYou got to smell like pimping man\nKnow what I'm saying\nYou roll up on the set, you feel what I'm saying?\nHey man you understand me?\nA lot of guys thought that this pimping died\nHey man but Ken made sure that it multiplied\nThat's right man ain't no more itty bitty comity man\nWe doing big things\nBig things popping little things dropping man\nYou know what I'm talking bout?\nWe dropping big oh books laying  around here man\nYou know what I'm talking 'bout?\nThe Art of Human Chess\nYou dig what I'm saying?\nWe making major moves man you know what I mean?\nWe still busting it real live you understand me?\nHey man how about the bitch man theirs the book now man\nKnow what I'm saying?\nWe sending the bitch out the door man you know what I'm saying\nSo she go get some more you know what I'm talking about?\nHey man we sliding that bitch know what I'm saying?\nAround the world man you know what I'm talking about?\nInternational bitch you know what I'm saying?\nHey man hey I just checked some money from Canada man\nHey man Pimp would be real proud of me man\n'Cause you know what I'm saying?\nPimp said man\nThat pimping is moving to the net man\nFor all you hoes you understand, theirs vets\nAnd all you niggas that move like corvettes\nHey man listen man\nPut your pimping on the net man\nYou know what I'm talking 'bout?", "year": "2015-12-04"}]}