{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/101ec9acebacbc3b7d2c51ebd7abe4b6.960x960x1.jpg", "title": "Homicide - 1584248", "year": null, "album": null, "lyrics": "(Frost): This is a dramatization. The names have been changed to\nProtect\nThe innocent ones not involved in the stories I'm about to tell. So\nListen up and listen up well. Here are the true accounts and incidents\nAnd still to me, it makes no sense. Ignorance is a major role, but\nHere's a fact I feel you can ignore no more\n\nVerse One: Frost\nHomicide, on the murder scene\nAnother frustrated gang-related senseless slaying\nVictim: a young product of the project system\nThe sad fact is nobody's gonna miss him\nTrue, a few may stand in disbelief, but\nThe majority will sigh a relief\nBecause of the fact he was a menace to society\nAnd gang violence was his first priority\nSo, now you take a look to see what this abouta\nSomeone quicka with the trigga, straight cold shot him\nDead, in a puddle of blood he lay\nAnother typical day in the streets of L. A\nHomicide on the murder scene, on the murder scene, on the murder scene\nHo-Homicide on the murder scene\nHomicide on the murder scene, on the murder scene, on the murder scene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene\nHomicide on the murder scene, on the murder scene, on the murder scene\n\nVerse Two: Frost\nHo-Homicide, and just for trying to act brave\nTryin' to be a hero sent you to a early grave\nThe violent death, it took place at around six\nAnd eyewitnesses say that it went like this\nThere was this lady who was chillin' in a alley\nPositive I.D. included that her name was Sally\nSally had just got off the bus from a job\nWhen she met three young thugs who decided to rob\nA man heard the screams comin' from her mouth\nRan down the deserted alley just to check it out\nAnd when he came across the scene\nHe knew what was happenin', but by then it was too late\nThe thugs started blastin'\nNow, asked in this situation, exactly what would you do?\nIf you heard someone screaming, would you go to the rescue?\nMy man, he tried, that's hwo he died\nHe was shot right between the eyes\nTryin' to do a good deed, shoot, that could've been me\nI'm glad I'm not the one who must explain this to his family\nHomicide on the murder scene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene, on the murder scene, on the murder\nScene\nHo-Homicide on the murder scene\nHo-Ho-Homicide on the murder scene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene\nBreak it down!\n\nVerse Three: Frost\nHomicide, it's also know as manslaughter\nIt can be a father, mother, son, or daughter\nIt can happen at anyplace, at anytime\nIt can happen as I'm runnin' down this rhyme\nFirst degree murder, blood flows red\nOne day you're alive, the next day, you're dead\nNobody seen nothin', the suspect fled\nShot on the spot with a bullet to the head\nAs soon as it happened, everybody broke\nNobody seen nothin', and of course nobody spoke\nBein' questioned, it doesn't pay to rat-a-tat-tat\nFor if you rat, you might too get the gat\nAnd get added to the list of those who fatally died\nIn the statistics, that's known as homicide\nHomicide on the murder scene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene, on the murder scene, on the murder\nScene\nHo-Homicide on the murder scene\nHo-Ho-Homicide on the murder scene\nHo-Homicide on the murder scene, on the murder scene, on the murder\nScene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene\nHo-Homicide on the murder scene, on the murder scene, on the murder\nScene\nHo-Homicide\nHomicide on the murder scene, on the murder scene, on the murder scene"}]}