{"artist": "WC", "songs": [{"year": "2007-08-14", "lyrics": "[Chorus 1: W.C.]\nNoid, I got these niggas all paranoid\nNoid, I got the big boy joint (Dub Sizzle)\nNoid, we got these niggas all paranoid\nBoy, Lench Mob is on point\n\n[Chorus 2: Ice Cube]\nI got to warn ya, this is California\nHome grown, get ya dome blown (Blow it back)\nSouth Central couldn't hold his potential\nMonumental, hood credentials (Dub Sizzle)\nW.C. is like the fundamentals\nIn the back of Winchell's, with the .4-5 cocked\n(Keep it hood) Everybody better hold they spot\nNiggas think they hot but no they not (No)\n\n[Verse 1: W.C.]\nWestside, the city where we ride\nThe city where that niggy put that green up in the sky\nOff that Al Green, sippin' a O.E\nWho that G from the L to the E to the N-c-H, M-O to the B?\nBustin' a 'chanical, back for the cash loc\nIt's that ignorant ass nigga, that motherfuckin' asshole\nBackhandin' ya, strapped with another anthem\nHood nigga eatin' pastrami cheese fries in a Phantom\nProduct of them palm trees, make your lungs bleed\nThe Coast without me is like a sack of buck weed nigga\nWithout me on the list the West is like a Chevy on stock rims\nBetter throw some D's on that bitch and lay low\nCause erasin' me out the strip loc\nIs like Ray J and Whitney, that shit's a joke\nWho made it safe for y'all to Walk and took it back?\nSomebody hand me my locs, punk bitch what you lookin' at?\n\n[Chorus 2: Ice Cube]\nI got to warn ya, this is California\nHome grown, get ya dome blown (Blow it back)\nSouth Central couldn't hold his potential\nMonumental, hood credentials (Dub Sizzle)\nW.C. is like the fundamentals\nIn the back of Winchell's, with the .4-5 cocked\n(Keep it hood) Everybody better hold they spot\nNiggas think they hot but no they not (No)\n\n[Chorus 1: W.C.]\nNoid, I got these niggas all paranoid\nNoid, I got the big boy joint (Dub Sizzle)\nNoid, we got these niggas all paranoid\nBoy, Lench Mob is on point (Keep it hood)\n\n[Verse 2: W.C.]\nPackin' the heat, now back in these streets\nAllow me to touch on y'all like a Catholic priest\nWestside gritty hood nigga, kickin' mud on the glitter pants\nOn all you Pretty Ricky lookin' niggas\nW.C. baby, I got it locked down\nGot the chopper-chopper that'll knock yo' ass down\nGot the Harley if you niggas wanna ground pound\nGot the rag '57 with the top down - follow me\nAlive and kickin', pimpin' it's that Westside\nDippin' in a stretch Hummer eatin' Church's fried chicken\nWith that big double-barrel on me, niggas can't ignore me\nIn a pair of Chuck Taylor's reclaimin' my territory\n\n[Chorus 2: Ice Cube]\nI got to warn ya, this is California\nHome grown, get ya dome blown (Blow it back)\nSouth Central couldn't hold his potential\nMonumental, hood credentials (Dub Sizzle)\nW.C. is like the fundamentals\nIn the back of Winchell's, with the .4-5 cocked\n(Keep it hood) Everybody better hold they spot\nNiggas think they hot but no they not (No)\n\n[Verse 3: W.C.]\nDamn, c'mon, back to the streets with it\nGrip the TEC-9 like a spoon cause I eats with it\nAnd I ain't a nigga to talk peace with it, I'll squeeze with it\nPlay for keeps with it, put you under the white sheet with it\nIt's back on, Lench Mobbin' in a big Brougham\nIt's been a while but nigga not that long\nStill Westside, dumpin' chronic ash with the cannons\nBustin' on you niggas with them gay ass dances\nFrom the t-shirts and Starter caps. Real recognize\nReal, but y'all niggas know where gangsta rap started at\nYeah I said it and ain't afraid to say it\nI'm from where the sun sit, bitin' my tongue for shit\nYou know the place that introduced the world to thuggin' and dippin'\nThe place that got these out of town niggas Bloodin' and Crippin'\nThe place where we gun slang. The same place Kobe\nScored 81 in one motherfuckin' game\n\n[Chorus 2: Ice Cube]\nI got to warn ya, this is California\nHome grown, get ya dome blown (Blow it back)\nSouth Central couldn't hold his potential\nMonumental, hood credentials (Dub Sizzle)\nW.C. is like the fundamentals\nIn the back of Winchell's, with the .4-5 cocked\n(Keep it hood) Everybody better hold they spot\nNiggas think they hot but no they not (No)\n\n[Chorus 1: W.C.]\nNoid, I got these niggas all paranoid\nNoid, I got the big boy joint (Dub Sizzle)\nNoid, we got these niggas all paranoid\nBoy, Lench Mob is on point... (Keep it hood)\nLench Mob is on point... (Keep it hood)\nLench Mob is on point", "image": "https://images.genius.com/d4ed6bd2c7a379500fac9a01a4457d66.300x300x1.png", "album": "Guilty by Affiliation", "title": "Paranoid"}]}