{"songs": [{"lyrics": "[Intro]\nAye, aye aye! Yah! Check on my neck! Asian Doll I flex! Bitches ain't on shit! Huh?\n\n[Verse 1]\nChoppa got a stand clip, longer than a broadway\nRoll a nigga body, like a swisher in the broad day\nCatch ya in the hallway, shoot you like you Spaulding\nHeavy artillery, no makeup snatch ya bald face\nSlow the beat down, Texas style, imma gangsta doll\nGrew up in the trenches, south side, I turn bitches hard\nNo matter of the struggle, be yourself, and patience is the key\nSome niggas fu, can't eat with them, steak on my plate bon appetite\nThirty rounds, they gon aim at you\nIn yo mouth like juicy fruit\nYo bitch she call me Betty boo\nHer nigga wanna fuck me too\nI can't pick a car today, Aston foreign Martin okay?\nPull up to the bank and buy the bank, emoji smiley face\nTell me why these bitches acting weird, like they don't know wassup?\nCooking bricks like here come Michael Vick, I pass these rookies up\nI don't wear no J's, cause I'm a doll I got my money up\nDesigner when I wanna, trendsetta, I been having stuff\nHe gon break his neck, throw this pussy, watch he fetch\nDrive a Benz, want a 'Vette, haters mad, watch me flex\nWent melodic, I ain't like it, ain't shit friendly, I be hype\nMotorola, trap phone, hit the plug, the work gone\n\n[Hook]\nLemme tell you why, I'm the youngest bitches doubt it\nLemme tell you why, I get that bag, because I persue it\nLemme tell you why, they wanna be me, cause the music\nLemme tell you why, I don't give a fuck because I'm booted\nLemme tell you why, I'm the youngest bitches doubt it\nLemme tell you why, I get that bag, because I persue it\nLemme tell you why, they wanna be me, cause the music\nLemme tell you why, I don't give a fuck because I'm booted\n\n[Verse 2]\nLemme tell you why, I ain't coolin' with no hoe\nCourt side, tight jeans, with some pretty pink toes\nPaparazzi wanna know, telling lies Pinocchio\nBitch holding up that gun, you gon talk or let it blow?\nLil bitch rollin' up that onion, crucify you on a sunny\nI just called a play like NBA Boy, you can't take none from me\nDuh really bitch, how you ain't know me? See me out, don't speak in public\nWater drippin' like my pussy, ghetto bitch I draw attention\nCheck on my neck, come give me sex, sleepin' on the doll\nMillions what I flex, PNB my shordy, he gon fuck you cause he next\nImma down ass bitch, the type finesse you outcha check\n\n[Hook]\nLemme tell you why, I'm the youngest bitches doubt it\nLemme tell you why, I get that bag, because I persue it\nLemme tell you why, they wanna be me, cause the music\nLemme tell you why, I don't give a fuck because I'm booted\nLemme tell you why, I'm the youngest bitches doubt it\nLemme tell you why, I get that bag, because I persue it\nLemme tell you why, they wanna be me, cause the music\nLemme tell you why, I don't give a fuck because I'm booted\n\n[Outro]\nAye, check on my neck, come give me sex, check in with me, aye aye aye, check on my neck, Asian doll she flex, yeah, gang gang gang, yah!", "album": null, "year": "2017-05-17", "title": "Lemme Tell U", "image": "https://images.genius.com/b3186b41df3ccc805c9b3501713ab0c8.499x500x1.png"}], "artist": "Asian Da Brat"}