{"songs": [{"image": "https://images.genius.com/b31a7953f972e19de03a73c72e698e38.1000x525x1.jpg", "lyrics": "(Hahahahahaha)\nHey babe\nI wasn't born yesterday (oh word)\nI was born tomorrow (oh, I get it, I get it, I get it haha)\nShimmy, shimmy sit me in cages\nI'm so sophistimicated\nBut LSD just sent me back into these intricate stages\nSo I'm a get me some gauges, a couple choppers\nAnd go rob a fucking doctor for his pain pills (yeah)\nYou grind a page but these emotional bitches\nAre finding ways to pine away in songs\nLike \"oh my girlfriend left me. I don't like it\"\nThese girls ain't bitches, the world's just vicious\nAnd love's not pretty it's a sickness, bitches\n(Mac you said bitches twice!)\nWell great minds think alike, like thoughts are like in pairs\nAnd if you don't get it you're, like, impaired\nI guess it's quite imperative for me to write my narrative to see\nAnd every word gotta be spelled out in fucking pretty water colors right?\nWell, I can hear my neighbors fucking\nAnd if the egg is fertilized the baby's gonna be born\nWith it's heart pumping like the thumping pattern of the drums\nI scribble out a little psycho babble from the lungs\nWhere you from?\n(The mother fucking junkyard boy)\nJust have a meltdown\nJust have a meltdown\nJust have a meltdown\nHave another meltdown\nSee, I don't really give a fuck about fame\nI gotta a couple screws loose and they're shaking in my brain\nHear the studs burbling, blood curdling\nLung murdering, drum hurdling visions\n(Minus all the cheap jokes?)\nFear the present type of iridescent light\nThe piercing pressure bite that makes you\nClear your crescent pipe of all the weed\nJust my irrelevant irreverence and every other measure's\nBeen realigned inside a shiny metal splint\nThe devil sin, another psycho somatic and flabby pachyderm\nCrabby foaming out the mouth from rabid germs\nShe was a taciturn woman that had a trashy perm\nPoking at the holes in my brain, the Lysergic acid burns\nWell burn motherfucker, burn that shit\nIt helps me justify taking all these risks, bitch", "year": null, "album": "The Love Potion Collection 4", "title": "Pachyderm"}], "artist": "Mac Lethal"}