{"artist": "Ice Cube", "songs": [{"title": "Endangered Species (Tales From The Darkside) (Remix)", "lyrics": "[Produced by Sir Jinx]\n\n[Male News Reporter]\n\"Good evening. This is Los Angeles, a city with many claims on America, including this one: It is now the gang capital of the nation. Last year alone there were 452 gang-related murders in the  greater Los Angeles area. And we'll see if there is anything that can be done about all of this.\"\n\n[Verse 1: Ice Cube]\nPeace!? - don't make me laugh!\nAll I hear is motherfuckers rappin' succotash\nLivin' large, tellin' me to get out the gang\nI'm a nigga, gotta live by the trigga\nHow the fuck do you figgure?\nThat I can say peace and the gunshots will cease?!\nEvery cop killer goes ignored\nThey just send another nigga to the morgue!\nA point scored- they could give a fuck about us\nThey rather catch us with guns and white powder!\nIf I was old, they'd probably be a friend of me\nSince I'm young, they consider me the enemy!\nThey kill ten of me to get the job correct\nTo serve, protect, and break a niggas neck\n'Cause I'm the one with the trunk of funk\nAnd \"Fuck tha Police\" in the tape deck\nYou should listen to me 'cause there's more to see\nCall my neighborhood a ghetto 'cause it houses minorities\nThe other color don't know you can run but not hide\nThese are tales from the darkside...\n\n[Chuck D]\nAll of us are endangered, DAMN!\n(A young nigga got it bad cause I'm brown)\n(A young nigga got it bad cause I'm brown)\n\n[Verse 2: Ice Cube]\nYou wanna free Africa, I stare at yuh\n'Cause we ain't got it too good in America\nI can't fuck with them overseas\nMy homeboy died over a key of cocaine\nIt was plain and simple\nThe 9mm went (gunshot sound) to the temple\n(gunshot sound) (gunshot sound) was the sound I put the bitch down\nAnd ran to the schoolyard bathroom\nLooked in the trash can, yo it had room\nSo I ducked my ass in it for a minute!\nCovered with trash I had to lay back\nMad as fuck!\nThinkin' about the payback\nTonight the crew gonna have a little fun\nI went home and cut the barrel of my shotgun\nIt's gettin critical - I stole a 5.0\nI let it go - drive real slow\nI yelled out 'Ice Cube sucka'\nThe shot-gun kicked - and it murdered motherfuckers\nI told you last album\nWhen I got a sawed-off, bodies are hauled off\nIt's a shame, that niggas die young\nBut to the light side it don't matter none\nIt'll be a drive by homicide\nBut to me it's just another tale from the darkside...\n\n[Sampled guitar riff]\n\n[Verse 3: Chuck D]\nStanding in the middle of war\nIn the middle we flex\nWhen we die, we won't make Jet\nEbony can't see to the lightside\nThe term they apply to us is a nigga\nCall it what you want, cause I'm comin’ from the corner\nSame applies with a Ph.D\nWho's black - don't wanna roll - sells his soul\nWatch his head go rollin’\nWho the fuck are they foolin’?\nNobody knows, but I suppose the color of my clothes\nMatches the color of the one on my face\nAs they wonder whats under my waist\n(Standin' on the verge) of them gettin’ brown\nThat's a fact\nGot a fear of the bozack\nRun, run, run, their ass off, they can not hide\nYet Cube, they can't fuck with the\nDarkside!", "image": "https://images.genius.com/6c223fafae72a06b4952ce4b3f7e6b7a.992x991x1.jpg", "album": "Kill at Will EP", "year": "1990-12-18"}]}