{"songs": [{"title": "Right Now", "album": "Harder Than Ever", "year": "2018-05-18", "image": "https://images.genius.com/9103682e86932ec8232f7eef978e10ed.1000x1000x1.jpg", "lyrics": "[Chorus: Lil Baby]\nI can't wait around for nobody, I need it right now\nI might buy that car if it make the right sound\nSolitaire earrings bling blingin' from a mile away\nI can't do what she want me to do, she tryna take my child away\nI think my past tryna haunt me (Haunt me)\nWhat do everybody want from me?\nWhat do everybody want from me?\nWhat do everybody want from me? (From me)\nI gotta give it to 'em, if I don't\nI might go to the hood, I'll make a song\nTurn the trap spot to the studio\n\n[Verse 1: Lil Baby]\nI'm tryna make a way for my folks\nSeein' how I'm Oakland City only hope\nI gotta get it, I ain't got time to play\nAin't got no time to waste\nI've been havin' nightmares about goin' back to jail, so I wake up\nDrankin' all this lean, poppin' Adderall so I can stay up\nNiggas that I used to love actin' like they're mad 'cause I got my cake up\nAin't gon' never let it get to a nigga, keep on grindin', tryna get another million\nCondo on Peachtree, I paid the rent for the closet\nThey just wanna talk about my past, they don't wanna accept the fact that I'm a boss\nEverything I wanted, I'ma go and get it, I ain't trippin' 'bout a cost, yeah\nEverybody want a piece of the winnings, they're never there when you're lost\nSeen my main man try to cross me, I'm tryna pass it down to my offspring\nAll these hoes see me flossing, seen my first mil', felt awesome\nThey can't follow me, I lost 'em\nHad to boss up, so I bossed up\nNow I'm bossed up\n\n[Chorus: Lil Baby]\nI can't wait around for nobody, I need it right now\nI might buy that car if it make the right sound\nSolitaire earrings bling blingin' from a mile away\nI can't do what she want me to do, she tryna take my child away\nI think my past tryna haunt me (Haunt me)\nWhat do everybody want from me?\nWhat do everybody want from me?\nWhat do everybody want from me? (From me)\nI gotta give it to 'em, if I don't\nI might go to the hood, I'll make a song\nTurn the trap spot to the studio\n\n[Verse 2: Young Thug]\nShe gotta be piped up to feel my emphasis\nShe hot, yeah, she sizzlin'\nBut can't love her more than a studio\nSerena and Venus, yeah most of my chains tennis\nSo I wore it all to the studio (Studio)\nMy baby mama got pregnant, had to buy a bitch a car to get an abortion\nShe just wanna see tears and sad faces on my shorty\nBut I can't get mad, that's the way it go when you're fortunate\nLeave a million cash in the street, nigga better not touch it (On God)\nAct like they came to lay hands so their trust don't get busted (No cap)\nStraight from Mossberg to Hillsborough\nBirds, bless the J's on that cizzurb\nRidin' in the Lambo that the lil' kids say \"Bingo\" to\nMy last two years were the worst ones in my career, but I'm still rich as you\nDisneyland's where your kids go, on a private jet when I'm into you (When I'm into you)\nThem lil' bitches that be hatin' need to pipe down (Pipe down)\n\n[Chorus: Lil Baby with Young Thug]\nI can't wait around for nobody, I need it right now\nI might buy that car if it make the right sound\nSolitaire earrings bling blingin' from a mile away\nI can't do what she want me to do, she tryna take my child away\nI think my past tryna haunt me (Haunt me)\nWhat do everybody want from me?\nWhat do everybody want from me?\nWhat do everybody want from me? (From me)\nI gotta give it to 'em, if I don't\nI might go to the hood, I'll make a song\nTurn the trap spot to the studio"}], "artist": "Lil Baby"}