{"songs": [{"image": "https://images.genius.com/525377dd6bd0f221ead9371b7b53d9a8.1000x1000x1.jpg", "title": "Album Intro", "album": "It Was Written", "year": "1996-07-02", "lyrics": "[Produced by Nas & Trackmasters]\n\n[Various Speakers & Nas]\n\"Hey Nas, hey hey boy, you see what they done did to Jimmy and Lee?\"\n\"Mmmhmm. Damn, man\"\n\"I can't take it man\"\n\"Sho' can't\"\n\"You think this is gonna eva' change?\"\n\"Man, damn this place, man! Damn these chains! These damn chitlins every damn night\"\n\"This cotton\"\n\"Shit!\"\n\"I can't take it man\"\n\"Harriett done left the night befo'. It's time we go\nAin't no place for black folk here. Man, promise land callin' me man\"\n\"It's callin' me too\"\n\"It's time we go\"\n\"Yeah, I'm wichou!\"\n\"Hey man, hey damn these chains, man. Damn you master, you ain't my master, man!\n\"You ain't nothin', you ain't nothin'\"\n\"Hey Bandit, Bandit, get the dogs! Get the hounds, we gonna\nHave ourselves a hangin' tonight!\"\n\n[Nas & (AZ)]\n1996!\nBack up in this nigga\nThe right way, though, you know?\n(Double-tre son, you know ain't nothin' coincidental or accidental, dunn)\nNo doubt!\n(You know how it's goin' down, man)\nIt was all written\n(No question, I'm sayin' man, I mean, how we playin' man\nYou know what I'm sayin', they dealt us in, son\nThey playin' with a 54 deck, you see with the jokers in and everything, you know what I'm saying?)\nSon, I'm playin' with the 52\n(You wanna stress on how I used to play, that's how I playin')\nBut, yo, they takin' us into this next millennium, right now\n(I'm sayin' law, you know what I'm sayin' we gotta lay the law\nCause without law ain't no order, you know what I'm sayin'\nThat's why these cats are slippin' through, you know what I'm sayin? They got the rules missin' though)\nTrue\n(Yo, word up, though, you know what I mean?)\nSon, these niggas look faker than the new hundred dollars, son\n(Yeah, you see that they look Monopoly money, right?)\nWord, with the big ass face on it\n(Yo, what I'm sayin', we see through all that, though\nYou know what I'm sayin?)\nNo question\n(All eyes seein', son, you know it was written, no question)\nYo, no doubt. In the Qu'ran it says Nas, the men\nNesa's the woman, you know? It was written"}], "artist": "Nas"}