{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/deada0ff4e2dc2960604dcfeac9f702a.720x720x1.jpg", "title": "The Jam", "year": null, "album": null, "lyrics": "[Hook: Cam'ron sample]\nIn Chi I'm mike\nBoston I'm Kenny\nMiami I'm Timmy, in Phoenix I'm Penny\nWhere my thugs with the hollow tips\nGirls that acknowledge it\nPolish it, after that swallow it\n\n[Verse 1: King Chip]\nYeah, whassup bitch\nLet me hear all that tough shit\nNaw nigga don't get scared now\nI heard niggas saying, \"Fuck Chip\"\nLike, \"That nigga must be a lame, yo!\"\n\"Why you ain't got no chain on?\"\n\"Wonder how you got them J's on...\"\n\"Aw damn, I ain't see them rings tho.\"\nNiggas ain't playin' no games ho\nTurn yo soul to an angel\nI done had so much to say, Ion mind going to jail yo\nSticking to the script like velcro, got bullets that's bigger than elbow\nNaw nigga I ain't never sell blow, and if I did nigga what would I tell ya fo'\nCause real niggas move in silence, niggas only respect violence\nYou gotta Rollie, but you don't what time it is?\nGimme that nigga, this my shit, yeah how you like me now?\nTurtle wax me up, then wipe me down\nNiggas talking 'bout they hungry, wow. No wonder they bite my style\nAll the hoes love me, if you hatin' on Chip then you hatin' on money\nCartier champagne, I know you ain't never had that honey\nYo broke ass, I hate yo fake eyelashes\nYou won't be living off my cash, you ain't the only bitch wit' lots of ass\nAnd a flat stomach, and cold swag, and face like a Goddess\nChip don't fuck wit' broke hoes, Ion give a fuck how fine you is\nIf they say they see me, its cause they don't see me often\nPull up on you while you walking and make you Macaulay Culkin\nNaw bitch I ain't gon' ask you, I know you want me to harass you\nHere bitch take my number, text me a picture of that ass too\nAsk around I'm is the man, love weed like hoes love Instagram\nCasey and that nigga Chip, hell yeah nigga this the Jam\n\n[Hook]\n\n[Verse 2: Casey Veggies]\nI'm rollin' five deep. Five tries, fine me\nI'mma stuck up guy girl call me \"Papi\"\nIn the back of the club, I ain't show no ID\nEighteen, mo' cream than yo fuckin' daddy\nGirl I can be your sponsor, put you on to somthin' proper\nThis what I call a wave, make that shit live doppler\nThree racks, bring the squad in\nPapa get that shit poppin'\nWatch us. Look what we rockin'\nMet a girl straight from Compton and my homegirl function\nLife is like a strip club, I'm just throwin' dollars\nIf she ever throw it back, I'll pick it up. Pop my collar\nI ain't trippin', money high, sittin' low\nTakin' her in, give it and go\nNever pretend, do it fa'sho\nSo historical, I'mma young legend\nPray to God I go to heaven, stay grinding like 7-11\nThat's Kobe Bryant, 24. 42 Mill when I'm twenty-four\nStack it real high, watch her get low\nThat's real life, this how the shit go\nThat's my dream, killed my scene\nThese hoes can't see me, they need visine\nSwaggin' for the masses, drop it slow like molasses\nYoung Veggies 'bout that cabbage, if some niggas ever asking\nSpeedin' straight, pedal smashin'\nI'm just caught up in the rapture\n\n[Hook]"}]}