{"songs": [{"title": "Famous Dude", "album": "So Hard", "year": "2013-05-22", "image": "https://images.genius.com/701a46350909affbfec12488b53a9b66.500x500x1.jpg", "lyrics": "[Verse 1: Lil Dicky]\nIt's like, these days Dicky been up on his grind\nTryna spit a rhyme\nFly enough to get cracker signed\nIt's aight tho\nI been typing all damn night bro\nKikes gotta write raps right, no typo\nNice flow\nBest up in the game, no Michael\nI guess I gotta wait for the fame, no lipo\nBut damn, if ya man had a hoard of fanbase\nI'd have a lot to cover like a corpulent klan face\nGo on some man dates\nWith D'Caprio and Drake\nAnd make a man cave full of chronic and pancakes\nA handshake's all I'm really wantin' from LeBron tho\nI dunno, think I'd rather get up with his mom\nAnd do it delante, couple bottles of Andre\nIn Pompeii, getting dirtier than some laundry\nI'm freakin' every ho just for Cleveland man\nBut first thing I'mma need some fans\n\n[Hook: Lil Dicky]\nCause Lil Dicky tryna make that cake like a balla do\nAnd denigrate Lil Wayne up at a barbecue\nAnd I just wanna hit the floor with Pauly D\nAnd cross swords up with Tommy Lee\nSo where the muh'fuckers drinkin' the Cîroc at?\nWhere the fuck the Rock at?\nWhere the bad bitches on this mediocre cock atttt?\nI'm tryna make the move\nFrom gay, lame, dateless jew to famous dude, ya dig?\n\n[Verse 2: Lil Dicky]\n(Verse two)\nFirst grade and I was thirsty\nI was wantin' fame up in the muthafuckin' worst way\nWord play, gotta get ya boy up on some first take\nSkip Bay, Steve A, get up in they ass ya dig\nIf I'm celebbin' then I'm getting with McAdams's\nThe hottest women on the muthafuckin' planet, kid\nI'm tryna get up at Selena\nMess around with Mila\nI remember when it was Christina\nGenie up in a bottle, but now she couldn't fit up on a waterbed\nI wanna score a ten, imagine Natalie Portman\nAnd if she borin' then I'll get a ride in my DeLorean\nAnd go before it, securing the whore I been adoring since\nI was a teen, yada mean\nBritney Spears, whacha doin'\nCouple years, that career and that metabolism ruined\nYa ain't know about me yet\nBut the future do\nOn Youtube, I been getting some views\n\n[Hook]\nCause Lil Dicky tryna make that cake like a balla do\nAnd denigrate Lil Wayne up at a barbecue\nAnd I just wanna hit the floor with Pauly D\nAnd cross swords up with Tommy Lee\nSo where the muh'fuckers drinkin' the Cîroc at?\nWhere the fuck the Rock at?\nWhere the bad bitches on this mediocre cock atttt?\nI'm tryna make the move\nFrom gay, lame, dateless jew to famous dude, ya dig?\n\n[Verse 3: Lil Dicky]\nAy, enough about a boo, I ain't need a bitch\nBut I need a clique\nFull a people Derek Jeterish\nLove the Bieber kid\nThat's a hell of a dude\nWell I ain't met him but his documentary was the truth\nI'd holla back at Snoop, drop a couple tracks in the booth\nHe'd prolly have me high enough to take a nap as I poop\nI'm callin Kobe Bryant up because I'm fucking with his game\nBut it's such a shame, I can tell that muthafucka lame tho\nFlame flow\nAin't nobody even know ma name tho\nAnd all I wanna do is know if Channing's really gay tho\nAll I wanna do is play Durant up in some Halo\nPlay shows, date hoes, where the fuck Diddy at?\nWhere Lil Dicky gon' spit at?\nAnd where the crib at?\nAnd where da rose gold shit at?\nI'm tryna get that\nI wish that I was sitting courtside for games\nAnd lickin' on Kate Upton's titties\n\n[Hook]\nLil Dicky tryna make that cake like a balla do\nAnd denigrate Lil Wayne up at a barbecue\nAnd I just wanna hit the floor with Pauly D\nAnd cross swords up with Tommy Lee\nSo where the muh'fuckers drinkin' the Cîroc at?\nWhere the fuck the Rock at?\nWhere the bad bitches on this mediocre cock atttt?\nI'm tryna make the move\nFrom gay, lame, dateless jew to famous dude, ya dig?"}], "artist": "Lil Dicky"}