{"songs": [{"year": "2016-07-28", "album": "Tradition", "image": "https://images.genius.com/2d30393f8f61ea7e724356fcf7ab938b.395x373x1.png", "title": "Bad Habits", "lyrics": "[Verse 1]\nI don’t know how deep to go\nBut I'ma let it all out so come peep the show\nGot my first Xanny of my mate, I ain’t gonna say his name\nIt was fun at the start, I used to treat it like a game\nThis around the time when The Nebulizer dropped\nI was on all types of shit, but there’s one I couldn’t stop\nAnd it played with my brain, but I focused on the music\nI focused so much, didn’t realise I abused it\nNever had a plan to stop, not in that prediction\nGoing through fame, couldn’t see I had addictions\nOne turned to two, turned to three, turned to four\nThen I need about six a day, a little bit more\nMixing it with lean, gotta stop people seeing\nWhat damages can be by looking at me, shit\nWhat to do cause I feel like a fool\nAnd I hate any rapper making Xannies look cool\nShit was getting bad I was filled up with hateful\nThoughts in my mind, I would argue with April\nAgreed I would stop, shit I’d give it a go\nBy the first fucking night, felt like slitting my throat\nSecond night, my body shaking\nThe ambulance appear and I’m thinking in my mind, what the fuck they doing here?\nSuddenly I’m caught up and there’s no time to muck round\nLucky I got here, cause my body ‘bout to shut down\n\n[Verse 2:]\nBack to square one, nah man you can’t quit\nYou gotta wean yourself off, that’s some hard shit\nWhat the fuck man, my brain is a mess\nI can’t remember that much, feel the pain in my legs\nI wish it was that easy, I could give up and go\nAnd people still got the hide to tell me pick up my phone\nMaybe that’s my fault, I didn’t speak on it much\nI didn’t see if as a problem, I would keep it from cunts\nRates could always tell, when I couldn’t pronounce certain words, brain dead\nYeah should I be proud?\nAnxiety was killing me, the doctors couldn’t deal with me\nPut me on a program cut me down on the pills and weed\nAll scared, cause I feel on my own\nI told ‘em “let me chill’, now they think I’m dissing them bro\nWaking up tired, I gotta take more pills\nAnd I didn’t even wanna take ‘em, is this fucking for real?\nLosing touch of myself, it’s like reality’s false\nIt’s like I’m walking around without having a pulse\nIt’s a feeling of death, or like nothing is left\n'Cause there I’m holding my chest, just put a hole in my head\nYou see the older I get, It’s getting scary as fuck\nI’m like an eighteen in the head, I weren’t aware of those drugs\nThe shit that they cause, I talk to mirrors on walls\nI don’t need this shit ever, but to pills I will fall\n\n[Verse 3:]\nI opened up on ‘No Rest’ told cunts everything\nThat I done ice, didn’t leave out anything\nI quit that shit, yeah I left it flat dead\nThat was 5 years ago, they still think I’m a crackhead\nIf that’s what we going off, fuck me dead\nIn 5 years I’ll be clean, they’ll be calling me a Xanny head\nFunny how the world works for a paycheck\nOnce the fame hit, I became a train wreck\nI wasn’t shit anyway, so why does it count?\nWhy so many people love me? I can’t figure it out\nBut I’m telling you now, don’t you follow my path\nLook you couldn’t if you tried, cause I’m going in hard\nFuck a poppin a pill, just to go out today\nHow’d I end up like this? I don’t know, it’s a way\nWell I’m blaming the fame, yeah I said it before\nBut it’s enough to make me high, feel like ending it all, but I\n\n[Verse 4:]\nBrush it off got my fans on my side too, and my girl and my brothers\nAnd the whole crew\nSpilling the truth, it’s like all I can do\nThat’s why I don’t have time for rappers that are saying they’re true\nWhen they lie to their fans, apologise in the end\nI never lied to mine and this is why I’m the man\nI tell you what I’m going through, I don’t care what they think\nThat’s why I’m triple popping pills, leaning over the sink\nI’m almost fuckin crying as I’m writing this shit\n'Cause of all my close ones, and the lives I affect\nI came from the bottom, I made it my problem\nCreated the option, now fame has adopting\nMy brain gotta stop it, insane I am not this\nStrange we got Scott sick, imma watch a clock tick\nJust fuck off, I said it just fuck off\nIf I won’t have my tablets I’ll find a bridge to jump off\nFucking idiots, thinking that the shit is cool\n‘Till they dyin’ in the vomit of there own drool\nWhat I meant to say? Don’t do what I done\nI’ve cut down on the program, yeah I’ve won\nRepped it from the street, turned into a star then\nCaught a fucking habit on the Xanex but the bars went\nCrazy and I’m just dealing with fame\nI just want my fans to know that I’ll still be the same. I’m good"}], "artist": "Kerser"}