{"artist": "B-Legit", "songs": [{"album": "The Hemp Museum", "title": "The Hemp Museum", "lyrics": "Where me and the homeboys ya know?\nWe get together you know what I'm sayin?\nWe might uh, shoot some pool, play a little dominoes\nCall a few tenders over\n\nI kick it in the Bay\nYou know where I stay\nThe V A to the Double L\nThe homey flossin in the V-12\nSo when you comin' to kick with it\nWith the Sick Wid It\nYou bring the whole team\nWhen you hit magazine\nLike the other day a car low from E-P-A\nCame through with some Hennesey and Alize\nI'm on the corner gettin' burnt with the chili mac\nThey hit the block in a dark blue ville 'lac\nWassup wit y'all?\nNuthin, tryin' to get it jumpin'\nAnd it's the first can we go to the mall or sumthin'?\nI got to laughin' but now I was pimp the baby(?)\nLookin' like she want to tongue kiss my Mercedes\nI got a spot where we all can go kick it at\nWe got the bomb and y'all got the Cognac\nDon't even trip I got a click and I want you to meet 'em\nOnce we make this left we to the Hemp Museum\n\nChorus:\nGrab your sex and your beach\nHit some corners let's get keyed\nThe Hemp Museum\nThe Hemp Museum\nGot my drank and my blunt\nCheck that bullshit don't be no punk\nThe Hemp Museum\nThe Hemp Museum\n\nI'm sittin' real low tip toen' the block\nI watch they mouth drop as I hit the lot\nNow peep the plot\nThe gates open up slowly got they eyes on it\nSpotizotic 'cuz I spent the M5 on it\nYou ladies help y'all self and pour the do it fluid\nWhile I break down the pound and manicure it\nAl Greens with the Victor Barons got her starin'\nTryin to get her out here Donna Karan\nUh...I'm callin all top notches\nHomies with the rolex\nWatches slide through\nLike the thing to do\nWe're all players\nNo square be allowed in the house of hemp\nWe campaigns like the President\nI got four or five dank rooms\nBig screens with playstations\nWet bar, perculation\nA vacation?\nNo, more like the Mardi Gras\nWith hurricanes and thangs that you ain't ever saw\n\nChorus:\nGrab your sex and your beach\nHit some corners let's get keyed\nThe Hemp Museum\nThe Hemp Museum\nGot my drank and my blunt\nCheck that bullshit don't be no punk\nThe Hemp Museum\nThe Hemp Museum\n\nI'm seeing 'stangs in the game of the young stages\nBut I'm a hog like the pig on Momma day\nProked out today was a good day\nA baby Freaknik jumped off in the bay\nI told baby maybe later on we can chill\nAnd we can meet at the Denny's up at ???ville\nBut as for now your playa patna gettin' hot\nAnd a quarter mile runners linin' up at the light\nThey gettin' tight and I got G's off in the Nova\nA big block and I'm hot\nI'm trynna told ya\nMini mart turned side show\nTear 'em off no need for the nitro\nI'm known to give it from the gate like every time\nMake the 6-8 skip and walk the line\nI got a dime in the pink if you down to see it\nAnd we be posted at the Hemp Museum\n\nChorus:\nX2\nGrab your sex and your beach\nHit some corners let's get keyed\nThe Hemp Museum\nThe Hemp Museum\nGot my drank and my blunt\nCheck that bullshit don't be no punk\nThe Hemp Museum\nThe Hemp Museum", "image": "https://images.genius.com/7574453e12b1725bce203ba430c52902.599x594x1.jpg", "year": "1996-11-26"}]}