{"songs": [{"image": "https://images.genius.com/ffa9dd98b9dc6e743ed58e3af39e190e.640x640x1.jpg", "title": "A Million", "album": "The Marathon", "year": "2010-12-21", "lyrics": "[Intro]\nAll Money In (All Money In, All Money In)\nYuh, real shit\nCookin' Soul\n\n[Chorus: Aaliyah]\nA million, a million-million, a million\nA million, a million-million, a million\n\n[Verse 1: Nipsey Hussle]\nI got my mind on a million 'fore I turn 26\nBut that's just what it costs for that condo at the Ritz\nI got this European belt (Belt), European bitch\nEver seen an African in a European whip?\nI got my top off in traffic playin' this, got 'em pissed\nPolice hot 'cause my operations legit, suck my dick\nAll my life they've been shootin', thank god they miss\nI'm convinced that I'm here for a reason, it don't make sense, how they miss?\nAll my niggas is gone, but I still exist (I exist)\nSo I got on my knees and I told him this (I repent)\n\n[Chorus: Nipsey Hussle & Aaliyah]\nOne in a million, a million-million, a million\nThat's real talk\nOne in a million, a million-million, a million\nWe made it\n\n[Verse 2: Nipsey Hussle]\nI got my first hundred thousand 'fore I turned 22\nAnd then I went to jail for some shit I did not do\nThem niggas think it's rap, huh, 'til bullets make 'em back up\nKnow I'm in them movies, bro, but I am not no actor\nWay before these contracts, I knew I was all that\nBet she say Nip Hussle if you ask her where that bomb at\nShe don't even smoke weed, she's just high off contact (All Money In)\nWay before I launched that I understood the concept\nGot it from my bro, bro, never drove a six-four\nUsed to push that Cut, dawg, but now I drive that Benzo\nI don't got no girlfriend 'cause, baby, I'm against those\nWe say that we just friends, but really know that is one in a\n\n[Outro: Aaliyah & Nipsey Hussle]\nA million-million, a million\nA million, a million-million\nOh yeah, Hussle\nOne in a million (One in a, one in a)\nA million\nA million, a million-million\nA million, a million, a million\nA million, a million, a million"}], "artist": "Nipsey Hussle"}