{"artist": "Baeza", "songs": [{"lyrics": "[Hook] When I walk thru the door bitches like woah maralin monrse guaranteed they gon' blow you no why Mojo. Bitches love my Mojo. All these bitches love my Mojo.All these bitches love my Mojo. All these bitches love my Mojo. When I walk thru the door bitches like woah Hol'up maralin marose ya guaranteed u gon' blow ha you no why Mojo ya. Bitches love my Mojo ya. All these bitches love my Mojo aye.All these bitches love my Mojo aye. All these bitches love my Mojo aye\n\n[Verse1] When I come to ur city a niqqa feel bad like Diddy. Cause I bring Kim Kays with me. Im a dog so u no I get the kitty. 18 with a bad bitch every niqqa hate cause they dont have this (Ya) Bitches stoppin me like traffic. One day let her in that ass tap it.Ha tell her get it get it let a niqqa no u wit it wit it (aye). Tell her get it het it let a niqqa no u wit it wit it (aye). Break it down drop it. Move that ass on the floor call it mobin mobin. Me and my girl stay mobin mobin. Reckless city bitch you get it\n\n[Hook] When I walk thru the door bitches like woah Hol'up maralin monrose guaranteed u gon' blow ha you no why Mojo. Bitches love my Mojo ya. All these bitches love my Mojo aye.All these bitches love my Mojo aye. All these bitches love my Mojo aye\n\n[Verse2] Niqqa fuck ur swaqq thats why ur bitch ain't bad. Yeah I got me some Mojo.All my bitches look like go goes. Tell that girl hit the flo doe' flo doe'. Get it bouncin like a Pole go. And ur girl wanna blow doe.We gon keep it on the low doe. Tell her get it get it let a niqqa no u wit it wit aye. Tell her get it get it let a niqqa no u wit it wit it aye. Break it down drop it move that ass on the floor call it mobin mobin. Me and my girl stay mobin mobin. Reckless city bitch u get it\n\n[Hook] When I walk thru the door bitches like woah maralin monrose ya guaranteed u gon' blow ha you no why Mojo ye . Bitches love my Mojo ye. All these bitches love my Mojo aye.All these bitches love my Mojo aye . All these bitches love my Mojo aye", "image": "https://images.genius.com/c745aedceea9692c66022a8535961ed3.720x720x1.jpg", "year": null, "title": "Mojo", "album": null}]}