{"songs": [{"title": "Faneto (Remix)", "album": null, "year": "2015-03-27", "image": "https://i.genius.com/0b03e91fdfd3df0854d8660cbff3936e5b6ee8b5?url=http%3A%2F%2Fbaseshare.com%2Fuploads%2Fsongs%2F03272015%2Fdrkfn_600.png", "lyrics": "[Intro]\nGang, squad\nAin't gon' lie, I'm squad and I'm gang, they the same thing, feel me?\nKing of Chicago once again, shout out Sosa\nRemember My Name, pussy\nGang, gang\nNigga we ain't goin'\nI just made 200 off tourin'\nBang, bang, bang\nBang, nigga, bang, gang, nigga, bang\n\n[Verse 1]\nI'm an OTF boy recruit\nFinna pull up to the zoo, nigga\nLoose nigga, free my nigga Zoo, he a loose screw\nShoot nigga, we don't give a fuck, who is you, nigga?\nFood nigga, run up on Durk, he gon' lose, nigga\nAye, 3K on the shoe, ho\nPussy nigga softer than some NuVo\nI just took his brain, faneto\nI just hit a stain, faneto\nAye, aye, aye, gang, gang, gang, aye, aye, faneto\nWorld around, they say they snatchin' Lil Durk's chain\nI be on Normal with 30's yellin' gang\nBitch I terrify my city, nothin' changed (what you want?)\nTwitter niggas throwin' emojis by my name\nBitch I'm ridin' through the opps\nFinna go and shoot Young Money up\nGrease my trigger finger, it ain't stuck\nI just told Kendall Jenner, can I fuck?\nAin't no gang like my gang and they know\nSouth By SouthWest, I ain't goin' (Worldstar)\nHit the stage with Meek Milly at his show (in Philly)\nHe got Nicki , I just want me Dej Loaf\nTh-thirty on me, steady bumpin' at the opps\nNiggas hate I got my city shit on lock (Chiraq)\nI don't like Rugers, I like Glocks\nNiggas mad I'm steady screamin', \"Free my pops\"\nWe gon' take some down, Faneto Gang\nI just told my lawyer, \"Beat that case\" (He beat that case)\nCall all the promoters, I need that change\nRun up on his ass, I need that face\n\n[Outro]\nGang in this bitch\nWe snatchin' chains in this bitch\nShout out Sosa, man, shout out to the whole 300 movement\nMay 12th, Remember My Name, the album droppin' man\nYou know, they know I'm on this shit\nI'ma fuck somethin' up, man\nTake something down gang\nOTF gang, 300 gang, OBLOCK\nHit a stain, faneto\nAye this my city, nigga\nAin't any competition"}], "artist": "Lil Durk"}