{"artist": "Vast Aire", "songs": [{"title": "Horoscope", "year": null, "lyrics": "[Verse 1]\nI see through confusion like the eyes of Heru\nDescended like Dante to come out like Jesus\nWe in the ninth ring, how exciting\nI'm King Indra I slay demons with lightning\nBlack ether though your speaker\nIf you find a planet that's useful then keep her\nHer mind is a reflection of my fire\nAnd her body is 3/4ths of water\nShe's my cosmic order\nShe's my mother, my wife, sister and daughter\nAnd our love is timeless\nJust like Nick and Norah's Infinite Playlist\nWow, isn't life great\nShe fell for me after she heard my mixtape\nShe would use music to escape\nPress play close her eyes and dreamscape\nAnd isn't that foul\nEverybody with a asshole thinks they can rap now\nThat's not logical how?\nYou can't get chocolate milk from a brown cow\n\n[Verse 2]\nMaybe she's perfect that's what it seems\nMaybe she was born with it, maybe its Maybelline\nAnd I wouldn't put nothing past her\nI got nothing but love for my Noxzema... Girl\nAnd I'mma rock her world\nDuro on the bed and make her feet curl\nShorty had the strawberry shortcake\nAnd I came through with the banana nut swirl\nAnd we mixed them both I hope she heard\nWhat I said when I read her our horoscopes\nIt was pretty clear like a kaleidoscope\nThat we were soulmates, that time eloped\nI usually don't kiss and tell\nCuz I'm the frog prince by the wishing well\nWhy is there so much hate? Wish me well\nWhen I look in her face my heart excels\nI love her exhale when she pulls my lapel\nI'm ready to rock them bells\nScratching on her thigh looking in her eye\nShe's ready to get impaled\n\n[Verse 3]\nIt's gonna get wet in the final hour\nCuz I rain down like a meteor shower\nShe said, \"Boy you make my love come down\"\nI said, \"I know when I'm under you I drown\"\nCheck the vibe when she's next to me\nWe be rubbing each other like ecstasy\nWith no X in me cuz I don't dig designers\nUnless it's Mecca 13, Eddie Bauer\nBrainstormin' keep pourin'\nI'm ready to rush the store for Ralph Lauren\nI get a sugar rush when I hear her callin'\nSome say cloud 9, free fallin'\nLife is great when you manifest destiny that's your fate\nRomeo and Juliet phillies might hate\nLife is too short why should we wait?\nWe go together like sweet and sour\nThe sky and the ground bees and flowers\nThis is not for the weak so leave cowards\nThe sun and the moon have attracting powers", "album": "Ox 2010: A Street Odyssey", "image": "https://images.genius.com/0d6b7e7116f168fcf3808d98ee452aa5.949x949x1.jpg"}]}