{"artist": "IDK", "songs": [{"title": "Last song (Jay)", "lyrics": "[Verse 1: Jay IDK]\nLook I don't mean to hate\nBut these niggas ain't great\nThese niggas ain't hungry\nIt's crumbs left on they plate\nThese niggas don't know how it feel\nTo see you building thousands of fans\nThen come to find out half of them fake\n'Cause you thought that you paid for real fuckin' promotion\nBut them niggas weren't giving a fuck about your emotions\nNo them niggas was trying to use your dream as\nA steam to power they selfishness\nFor a year I put 'em in motion\nY'all thought it stopped me from going?\nHe been rapping and flowing\nHe been shoulda' been tourin'\nHe been shoulda' been on\nHe been shoulda' been rich\nHe been shoulda' had a deal\nGuess the only been I did was keeping trill alive\nA lot of these niggas not real\nA lot of rappers signed, but they claimin'\nThey indie like they ain't really got deals\nUsed to be blind 'til I took the time to find\nThese niggas is only beatin' me\nCause they push like a cargo and downhill\nSo I'ma take my 150 fans\nThat I built by myself with my business plan\nTryna' play the starving artist and fucking business man\nFeed them niggas great music\nAnd hope that they tell they friends\nAnd maybe it'll expand\nMaybe I'll feel the feeling of being the fucking man\nMaybe then\nFuck that maybe was never in the plans\nI will\nDon't need no co-sign or none of your bullshit deals\nFor real\n\n[Hook: Jay IDK]\nThis song's so you remember me\nGot love for all my enemies\nThis one is for all my every things\nThe broken promises I never made\nThis one is for all my better days\nThe people looking for a better race\nI pray this song will be the remedy\nAt least I hope that you remember me\n\n[Verse 2: Jay IDK]\nIf you a blogger that I met when politicin', we build\nIf you want dollars for posting me on your site then I chill\nSee you can keep the post if your love for my music ain't real\nThe money I'm makin' from flipping all these adderall pills\nIs to continue making music, maybe make me a mill'\nMaybe see Sway in the Morning, Charlamagne, XXL\nI gotta pay for visuals before I pay my phone bill\nBut find a way to keep the service and the internet still\nThat's how I know that I am not gonna' fail!\nMy love for rapping is real!\nI studied niggas like Melle Mel, Big L, and LL\nI used to bump the chronic heavy back when I was jail\nThat was my bible when I felt like I was going through hell\nI used to rap for all the inmates in the dorms and the cells\nThey said I had bars, ironic, but I'm being for real\nThey said you got the flow like Lupe and the style like Pharrell\nSo when you make bail, you better take your ass out and tell your story!\n\n[Hook: Jay IDK]\nThis song's so you remember me\nGot love for all my enemies\nThis one is for all my every things\nThe broken promises I never made\nThis one is for all my better days\nThe people looking for a better race\nI pray this song will be the remedy\nAt least I hope that you remember me\n\n[Verse 3: Jay IDK]\nNumber 11 on Graduation, I felt the Glory\nThe pressure's the reason none of the shit I make is boring\nThe reason why I put all of my heart, all of my time\nAll of my effort, into making sure you know my story!\nI never knew my father, fuck it I don't need no Maury\nI never graduated, never told my mom I'm sorry\n'Cause I ain't trying to, I'm tryna' do a substitute\nThat's different from throwing a fucking tassle like the rest of you!\n\n[Outro]x2\nI pray to Lord that my time never ends\n'Cause this life has to end\nIt won't come back again\nOh no, no\nAnd when it comes\nI won't take it for granted\nFaith in my passion\nIs why this gon' happen\nFor sure!\n\n[Hook: Jay IDK]\nThis song's so you remember me\nGot love for all my enemies\nThis one is for all my every things\nThe broken promises I never made\nThis one is for all my better days\nThe people looking for a better race\nI pray this song will be the remedy\nAt least I hope that you remember me", "image": "https://images.genius.com/8e99e1b317f29d4cc517906d77c12fe3.500x500x1.jpg", "album": "SubTRAP", "year": "2015-08-25"}]}