{"songs": [{"image": "https://images.genius.com/6695d2bb24f7779de6a82b14bfd69716.350x350x1.jpg", "album": "You Can Be a Daddy, But Never Daddy-O", "title": "East Coast Funk", "lyrics": "{Don't worry about it..}\n\n[Daddy-O]\nYeah.. whassup niggas?  We in here, uhh..\n\nNow do you wanna start this?  Well I don't think you do\nIf we was in L.A. boy, a martyr's what they'd call you\nBut since we're on the East coast, I'll just say ya punk\nA little nuttin ass frontin ass nigga poppin junk\nYou can say this beat's, a little somethin for you to ride to\nI might be kickin your hyde too, so watch it where you step\nThis is deep fried funk, like the chicken in the chop\n{NOW, NOW, Now we gonna show you how the East coast rocks}\n\nChorus: {unknown singers}\n\nEast coast is funky, so funky\nSo parlay to the Daddy-O funk\nEast coast is funky, so funky\nSo parlay to the Daddy-O funk\n{NOW, NOW, Now we gonna show you how the East coast rocks}\n\n[Daddy-O]\nNow this ain't Oaktown, it's New York son\nBut the funk still flows like it does with Ant Banks and Spice 1\nTakin no prisoners, makin sure I come off\nCause iffin I don't, niggas think I'm goin soft\nI had to come back strong, cause it was quiet on the Stet\nSo I'm givin you a taste of how funky I can get\nKickin a do-re-mi-fa-suck-my-{TASTE}\nTwelve cuts on the LP, so what's your pick?\nAnd if you can't take it, then back up off my ego\nGimme a break, or just let a nigga know\nSo when you start askin me, who got the props?\n{NOW, NOW, Now we gonna show you how the East coast rocks}\n\nChorus\n\n[Daddy-O]\nI grew up po', and the streets were rough\nAnd when times were hard, a nigga had to get tough\nSo when I was broke, I had to take to the street\nTen and twenty deep, duckin from the heat\nEast packin no chrome, cause it shines in the dark\nOnly black steel as I roll through the park\nPeople said I was mean, I was doin what I had to\nNeeded some dough, I wouldn't hesitate to rob you\nAnd I might get stopped by the cops\nRipped of my props and I might get locked\nBut I don't care, at least I ain't concerned\nAnd if this is a lesson then I guess I gotta learn\nBut I ain't goin out like a sap\nCause if they lock me up you best to think I'm comin back\nGrabbin my gun, and as the hammer gets cocked\n{NOW, NOW, Now we gonna show you how the East coast rocks}\n\nChorus\n\n{NOW, NOW, Now we gonna show you how the East coast rocks}\n{NOW, NOW, Now we gonna show you how the East coast rocks}\n\n[singers ad lib to end + Chorus again at end]", "year": null}], "artist": "Daddy-O"}