{"artist": "Drake", "songs": [{"year": null, "album": null, "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg", "title": "Days In Toronto", "lyrics": "[Drake]\n\nYeah\nWhy you keep askin' me about her?\nShe's not here right now, she's not here right now\nWhy am I the one you wanna get into it for the drama\nI got a lot to say, and that's the last thing a nigga wanna hear right now\nSpendin' all my days on the Eastside oh\nForgettin' who I was on the other side oh\nYoung nigga switchin' up the program right now\nTryna put the power in my own hands right now\nI'm about to ride through the old hood right now\nGot too much pride for my own good right now\nWaitin' on you to give in and hit me up\nSo I could fall through like old times and hit it up\n\nI'm terrible at inviting myself, call me over\nThose nights when you need someone else call me over\nYou can be the one to take control call me over\nWhen I get there, you already know, call me\n\nWhy you keep askin' me about her?\nCouple of other things I'd rather do than talk about that right now\nTold you about giving him chances on chances on chances\nHe’s not holding you down, he’s holding you back right now\nSpendin' all my days on the Eastside oh\nForgettin' who I was on the other side oh\nYoung nigga switchin' up the program right now\nTryna put the power in my own hands right now\nLove it when your ass speak the truth to me oh\nTryna wake up and have you with me oh\nWaitin' on you to give in and hit me up\nSo I could fall through like old times and hit it up\n\nI'm terrible at inviting myself, call me over\nThose nights when you need someone else call me over\nYou can be the one to take control call me over\nWhen I get there, you already know, call me\n\nYeah...hey...yeah...hey\n\n[PartyNextDoor]\n\nI try to play numb to shit like this\nBut I'm cool 'cause this isn't love\nWe all have obsessions\nOh, sometimes, sometimes\n\n'Cause when I'm on the road I be on a roll\nI mean you can hold me down, but I'm not to hold\nRiding with my niggas, we the ones they chose\nRunning through the city like, \"I know you know\"\nYeah, my name is PARTY and the trigger finger function\nSilly nigga might lose his life on assumption\nYoung nigga from the city\nAin't shit pretty, but my bitch and my mama\nAnyone can get the drama, even the Dalai Lama\nStrippers in the club and my cup's half empty\nRiding with my niggas 'cause my niggas understand me\nStill on plan A, pussy niggas on plan B\nJust a young rich nigga, you don't have to understand me forever\n[x2]\n\nForever\nBaby, can you hear that?\nThis story that you gonna make tonight\nYou gone tell that shit for life\nI don't want it just tonight, I want forever\nI don't only want that shit tonight, I want that shit forever\nYou can make the story better, make it last forever\nI ain't only wanna fuck tonight, baby, it's whatever\nTell me baby, if I fuck you right, can I fuck forever?\nTell me, should a real nigga feel this way?\nTell me, doesn't anyone feel this way?\nTell me, doesn't anyone feel this way?\nTell me, should a real nigga feel this way?\n\nI've been already gone, baby\nSmoking and I'm drinking strong, baby\nEven though I'm living long, baby\n\n'Cause niggas only singing songs, baby\nI'm true to you, I'm true to these words\nBaby, getting through to you\nHow I'm getting through 'cause I'm concerned, baby\nIs it true to you? How's it feel with me?\nThis story that you gonna make tonight\nYou gone tell that shit for life\nI don't want it just tonight, I want forever\n\nStrippers in the club and my cup's half empty\nYou know I'm riding with my niggas 'cause my niggas understand me\nYou know I'm still on plan A, pussy niggas on plan B\nAnd I'm just a young rich nigga, you don't have to understand me forever\n\n[Drake]\n(Breakdown)\n\n(I threw my hands in the air and said show me something)\nRemember one night I went to Erykah Badou house\nShe made tea for me\nWe talked about love and what life can really be for me\nShe said when that shit is real you just know\nAnd I was thinking about you, you already know\n\nRemember one night I went to Erykah Badu house, she made tea for me\nWe talked about love and what life could really be for me\nShe said when that shit is real, you just know\nAnd I was thinking bout you, you already know\nYeah, the other night Chubbs showed up at my house\nHe had weed for me, that's my nigga till we gon'\nKeeps his ear to the streets for me\nSaid the city stress him out on the low\nI said, \"I feel you, nigga, I already know\"\nYeah, already\nGirl's talkin' bout you, gotta leave already\nDamn, my lil' nephew turned four already\nGave you a little help, you need more already\nDamn, you need more already?\n'Fore you said, \"You're mine,\" I was yours already\n22, had the Bentley 4 door already\nEven as a boy I was the boy already\nSo you know that mean the pussy galore already\nMention other girls, you get insecure already\nThat was in the past, I've matured already\nFuck them hoes, you got the award already\nYou go to Chanel and get the rewards already\nKnow I do this shit for 3rd Ward already\nKnow I do this shit for H-Town already\nAlready, already\nBack up in this thing, it's a go\nHad a couple niggas out of pocket, now they know\nAin't the first time cause I've lost you before\nHad to get it back, had to get it back\nHad to pull it back because I know I'm on the road\nHad to take you back because I know you're down to roll\nIf you can get it from me, you can have it, now you know\nAll your friends asking where you stand with the boy\nFaceTime saying you got plans for the boy\nStudying your body, that's exams for the boy\nTake a flight here, pop a xan for your boy\nWaking up in Amsterdam with the boy\nLong flight home, another xan for your boy\nYou would probably fly out to Japan for the boy\nYou would probably kill another man for the boy\nYou would probably...\nYou would probably lie 'bout it on the stand for your boy\nPut the Bible to your right hand for the boy\nThat's why you I ain't never got to worry 'bout the boy\nYou know you got...\nYou know you got that really good insurance on the boy\nYou just gotta pack a bag and hurry to the boy\nYeah.... Why...\n(Fring)"}]}