{"artist": "Papoose", "songs": [{"album": "The Nacirema Dream", "title": "Mother Ghetto", "image": "https://images.genius.com/d281c499b368d1c0cfbf223752dedd45.1000x1000x1.jpg", "lyrics": "(Intro)\nBrooklyn, rise to the occasion\nPapoose, PK\n\n(Hook)\nWhere Brooklyn at? Where Brooklyn at?\nWhere Brooklyn at? Where Brooklyn at?\nWhere Brooklyn at? Where Brooklyn at?\nWhere Brooklyn at? Where Brooklyn at?\n\n(Verse)\nAll the thorough bread borough heads, where yall from?\nAll the hundred dollar billers villains, where yall from?\nAll the low key OG’s, where yall from?\nGot a gat, cock it back, let me hear yall gun\nCome and take a walk through my horde, I’ll guide yo vision\nWhen niggas who ain’t ready to die get shot for livin\nStepped out the building another day, my time was tickin\nBut had to make a U turn, damn forgot the biscuit\nI stashed it on the side of the sink, behind the dishes\nOn Sundays I praise gun plays, that’s my religion\nWalking down the block with a boppin rhythm\nHad to take a leak behind the green garbage can\nWho needs a pot to piss in?\nThat’s when I bumped heads with my man, he out of prison\nWuddup son? Noticed his grill looked kinds different\nHe had a long scar on his face, somebody jigged him\nI got away when he got knocked, wish I was with him\nThey put the green light out, know how the game go\nNiggas die for they colors, gotta respect the rainbow\nTake John through the slums just to get a coliday come\nHoodlems through they guns in the sewers and swallow they jums\nSnitches stopping the funds, when they hear the drama they run\nSo we throw the slugs to their tumors and silence they tongues\nRaw ball heist, hand to hand is far more trife\nCustomers be bangin on the spot doors all night\nI told the last customer yo next time not lite\nHe knock hard so I cocked back and took his hard knock life\n\n(Bridge)\nThe mother ghetto went in first up, want the crook bone\nMy borough led the thoroughbred, Brooknam\nYall outsiders better come right, don’t look wrong\nMy borough led the thoroughbred, Brooknam\n\n(Hook)\nWhere Brooklyn at? Where Brooklyn at?\nWhere Brooklyn at? Where Brooklyn at?\nWhere Brooklyn at? Where Brooklyn at?\nWhere Brooklyn at? Where Brooklyn at?\n\n(Verse)\nHome of the time of hoax with money missin and drama talks\nAnd you can tell a nigga from Brooklyn just how he walks\nThem Brownsville dudes carry gats in they draws\nCome through rockin a Rollie, better have it ensured\nEast New Yorkers will stab a millionaire til he bleed riches\nCop work for uptown niggas, fuck Queens bitches\nFort green killas run up in yo living room quick\nThem boys at canal, see you lay yo clique on the strip\nNobody politics in Bed-stuy, who cares for that political shit?\nWe`ll rob a dog for his kibles and bits\nBushwick got beat cops, they actin like they own the streets\nThat’s why we drop em like a verse and lay em on the beat\nCelebrate easter by goin to Cony Island wit heat\nJust to have a slash out and bang it out on the beach\nIn Crown Heights they be workin them 2’s, redhook hoodlums\nCome around yo way or put yo turf on the news\nDown town in Pican Ave got the flyest niggas\nYoungins takin over the trains, cursin over the loud speakers\nFlatbush they be totin, leave yo top smoking\nSince the trains had tokes them boys kept it locan\nFrom LG to Albany we was born to be thorough\nCypress Hill’s the kings but now we the king borough\nI’m from Bang Bridge, we broke the law for the fun\nThe cats at Marcy will make you cough up a lung\nWherever you from, represent the hood you live\nWell keep it that way, don’t come across the Brooklyn Bridge\n\n(Bridge)\n\n(Hook)\n\n(Verse)\nIn the heaven of Bob, my hood, them pearly gates is locked\nWe the reason that cops traded 38’s for Glocks\nWe the reason them cabs drive by, never trust you\nWe the reason you couldn’t rock shines in the tunnel\nNiggas be starin and walkin, lookin back\nBut I rob a nigga blind and ask him what the fuck he lookin at?\nPatrol cars just wanna get essential book in pack\nDon’t get caught in alleys with Brooklyn cats\nFace the fact that what you worship\nSo I pray with my backs towards the serpent\nHit the underground and changed all the rappers to the circus\nCelebrated Ike after he was murdered\nDue tradition we had him cremated\nPut his ashes in the shone and I wish I could’ve did magic when they burned him\nCuz the depths of this devilish fire within these matches don’t deserve him\nIt’s when life stay on the abs of the earth and where the staff givin sermons\nKnowledge beneath the records of a turban\nSecurity stay harassin and lurkin\nWhen a Brooklyn thug walk in the club, bounce his ass or skin they search us\nWhy pattin by my burners? You actin like you nervous\nMake a mistake and get shot by accident on purpose\n718, 187 yall faggots must’ve heard us\nOur area code got the same factors of a murder\nWherever you from, represent the hood you live\nWell keep it that way, don’t come across the Brooklyn Bridge\n\n(Bridge)\n\n(Hook)", "year": "2013-03-26"}]}