{"songs": [{"image": "https://images.genius.com/02543f01dfa688d0e7de36632a1cd58b.1000x1000x1.jpg", "title": "Know", "album": "Perception", "year": "2017-10-06", "lyrics": "[Intro]\nYeah\nI wanna know, I wanna know\nI wanna know, I wanna know\n\n[Verse 1]\nBeen sick with the pen since I was ten inches tall\nI'm relentless, you guessed it, back with the vengeance\nIn the set list, every sentence so raw you can sense it\nNo question, tryna be the best that\nEver walked this earth, if I'm not, then I'm next up\nDressed up like I'm 'bout to hit a bank or somethin'\nYeah, I am not the one you wanna mess with, no!\nWhen I come into the room, put your heads down\nI'm a little bit TØP, Stressed Out\nWhat does that mean?\nI'm a rap fiend with a bad lead\nYou could run if you want, but you'll never catch me\nSo cold with it, y'all don't get it\nLet you put me in a cage just so I can open it\nHandcuffed, hands up, this is dope to me\nOh, you thought you had me captured? So funny\nBetter run from me, I don't think you really understand what this does for me\nI dress bummy, but I clean up nice, they ain't never seen this side of me\nLong T-shirt, they eyein' me\nRules don't apply to me\nYou better give me my privacy\nI got the fans I got because I'm takin' them behind the scenes\nYou played hide-and-seek, I played hide-from-me, agh!\nYeah, look at all that we accomplished\nQuittin' for me's not an option\nI wanna look at my kids in the face when I'm older and say I did something admirable\nFast checks, fast women, that don't inspire me, no!\nYou don't wanna know what's goin' on inside my personal life? Then get out my diary, yeah\n\n[Pre-Chorus]\nI wanna know what it's like to be happy\nI wanna know what it's like to wake up in the morning and feel like it's real when I'm laughin' (Yeah!)\nI wanna know what it's like to sit down with my friends and feel like they might understand me (Woo!)\nI wanna know that the people around me care less about Grammys and more about family\n\n[Chorus]\nI wanna know, I wanna know, I wanna know (Yeah, yeah!)\nI wanna know, I wanna know\nI wanna know, I wanna know (Yeah, I wanna know)\nI wanna know, I wanna know\n\n[Verse 2]\nYeah, record labels' signin' artists they ain't got a clue what to do with\nWhy would I put my career in the hands of someone that don't even know what they doin'?\nWhy would I sit in a room full of people that don't even care about me or my future and tell me they ain't really feelin' the vision, then hop on the wagon the moment it's movin', huh?\nHeard you tellin' people you don't really like the content\nWhatchu wanna hear me rap about?\nHow I'm on the road gettin' side chicks?\nYou should treat your mouth like your phone in a movie theater, put that on silence\nI don't care what everybody else is doin', I'm just bein' me and that's not how I live\nOh my, oh my, yeah, I'm in the zone now\nZoned out, come to my show with they phones out\nWhole crowd, oh wow, that's wild, tone down, no!\nI have created my own style\nI have created my own sound\nOh, you didn't know? Well, you know it now\nSlowin' down\nLivin' happy, this is what I was made for\nThey say you get what you paid for\nGrandpa told me, \"Always look to Heaven, try to pay attention when you talkin' to God,\" yeah\nI wish I'da paid more, I shoulda prayed more\nEverybody's out here shoppin' tryna find a different product in the same stores\nEverybody wants they dream to fall in they lap, but don't wanna work for it\nI've been doin' this since I was just a kid and mama bought me 8 Mile at the movie store\nHopin' someday maybe I could do what I love for a livin' with people I care for\nPeople that care more about me as person than money I make for 'em, yeah!\n\n[Pre-Chorus]\nI wanna know what it's like to be happy\nI wanna know what it's like to wake up in the morning and feel like it's real when I'm laughin' (Yeah!)\nI wanna know what it's like to sit down with my friends and feel like they might understand me (Woo!)\nI wanna know that the people around me care less about Grammys and more about family\n\n[Chorus]\nI wanna know, I wanna know, I wanna know (Woo! Yo!)\nI wanna know, I wanna know (Yeah, I wanna know)\nI wanna know, I wanna know\nI wanna know, I wanna know (Woo!)\n\n[Chorus]\nI wanna know, I wanna know (Woo! Yeah!)\nI wanna know, I wanna know (Yeah, I wanna know)\nI wanna know, I wanna know (Yeah, I wanna know)\nI wanna know, I wanna know"}], "artist": "NF"}