{"songs": [{"album": "Hood Politics II", "image": "https://images.genius.com/9a8ec0a9ea2c0ad58a5ecd3b17f9a826.400x400x1.jpg", "year": "2005-02-16", "title": "What Do You Believe In? (Remix)", "lyrics": "[Intro]\nYeah\nWoo! Shit, take 'em to church\nThis make me feel good, man\nSo much negativity, man\nI'm tryna bring somethin' positive back, you know\nTell you a couple of things I believe in\nYep\nSo there it go, couple of things I don't believe in, too\nWoo!\n\n[Verse 1: Termanology]\nYeah\nShit, they say: 'What do you believe in?'\nI'd rather tell you what I don't believe\nSoldiers overseas, dyin'\nFor some shit that they don't believe\nAnd lil' kids in the hood with no groceries, scared\nTurn on the lights and the roaches leave\nSo they tip-toe with ease like: 'Oh no, please!'\nI ain't a player, I don't need nobody coachin' me\nUp in the government we ain't bringin no cocoa leaves\nShit is so fucked up, niggas so coked up\nThey don't see their whole check in their ass smoked up\nNiggas screamin': 'Folks up!', niggas screamin': 'Folks down!'\nNiggas screamin': 'Blood in!', niggas screamin': 'Blood out!'\nThat gang shit got the youth ready to bang shit\nNiggas dyin' for colors, everywhere it's the same shit (same shit)\nIt seems I've been goin' through this for years\nThey say the good die young, but I don't know how I'm here\nThey say: 'What do you believe in?'\nI believe if you don't stand for somethin', you fall for nothin'\nThey say: 'What do you believe in?'\nI believe in karma, that's 360, my niggas ridin' with me\nThey say: 'What do you believe in?'\nI believe, all my brothers in the pen, we gon' see you again\nThey say: 'What do you believe in?'\nI believe that Bush is on my [?], still I keep my head up\n\n[Hook: singers]\nYou can turn your back and then walk away\n(You can turn your back and then walk away)\nSoon be comin the judgement day\n(Ahh, soon there be comin the judgement day)\n\n[Verse 2: Xzibit]\nC'mon..\nWhat do you believe in? I believe in karma\nAnd that fo'-five to drop that drama\nCan't wait for the time when I meet my maker\nPicture everlasting life in Jamaica, time to wake up\nWatch your thoughts, your thoughts become words\nYour words become actions when the bullshit happens\nKeep laughin', that's when the gauge start clackin'\nFeel the buckshots smackin' have your body mismatchin'\nYo, I feel the devil tryin to force my hand\nSteady bringin' out the soldier in a peaceful man\nSee I was born to be all that I can, without a Uncle named Sam\nAs you can see we just a part of his plan\nCause first there was a war on blacks\nAnd then there was a war on crack, now it's war in Iraq, c'mon\nI never give up, I only give back\nI ain't preachin, I'm just statin the facts\nSo let the choir SING!\n\n[Hook]\n\n[Outro: Statik Selektah]\nOne time!\nBig shout-out my man Dan Green\nClockwork Music\nThe whole ST The Squad\nPayroll, Lawtown\n617, all the ShowOffs\nThat's it!"}], "artist": "Termanology"}