{"artist": "Bas", "songs": [{"lyrics": "[Produced by BBP]\n\n[Verse 1: Bas]\nI thank god for the blizzard, we snowed in\nGirl you lookin' like you rode in on a piff cloud\nWas it frozen? and where the piff now? are you holdin'?\nCause I damn sure is lil' mama, newsflash, this shit potent\nLil' mama leave ya baggage at the door, please check yo shit\nCause that's yo biz, lil' mama me and you\nWell we here for another reason\nIt's December but i'm feelin' like another season\nCause the flowers in June gon' sing a love tune\nAnd a howl at the moon, tell her bring ya love soon\nSharper than a harpoon, yeah, shorty wetter than a monsoon\nYeah, I read your colors like a cartoon\nBut this purple say we depart soon, gone\n\n[Hook]\nCan we take a little trip?\nWe'll be gone couple hours\nWe don't need a private jet\nShorty get up on this dower\n\n[Verse 2: Bas]\nYou take me high like a seaside tidal wave\nFinal days we spend 'em confined inside a cave\nWith a moat of Hennessy, marijuana blaze\nLiquor flowin' in the sleet, whole 'lotta haze\nWhole 'lotta chicks wanna take ya place though\nYou the only one I could never replace though\nThey might replicate yo style\nCan't replicate yo smile, you on hold\nAin't no doubt, could you wait here for a while?\nCould you be the one that's always gon' look out for me?\nSee them birds on my arm and know it's falconry\nCause you elevate me higher than a balcony\nBut when you high, girl you always start to doubtin' me\nWhy? I know, that kush is paranoia\nType of shit to make 'em look and think they never saw ya\nI ain't toyin' wit ya girl, I'm tryna tell ya\nI'll be ya Ray Liotta, now that's a good fella\n\n[Hook]\nCan we take a little trip?\nWe'll be gone couple hours\nWe don't need a private jet\nShorty get up on this dower\n\n[Verse 3: Bas]\nWe super mooked, high, I look in ya eyes\nAnd, ask you if you down to take a ride, yeah\nStroll up on a prairie house and steal the pie from 'em\nNo need to roll another one cause you a fly woman\nKind woman, divine woman\nBut if you disrespect [?] Genghis Khan woman\nI'm pullin' for you cause you marathon runnin'\nLife is so cruel you had better times honey but\nIt's always stormy 'fore the beautiful day\nAnd, sometimes you corny in the cutest of ways\nAnd, a bit annoying cause you blew all my haze, but it's cool\nNow you horny cause you blew all my haze\nGot me in a daze girl, yeah, cause ya strength make me brave girl\nTake a gaze, I know it's dark, but me and you?\nCould never get estranged world\n\n[Hook]\nCan we take a little trip?\nWe'll be gone couple hours\nWe don't need a private jet\nShorty get up on this dower", "image": "https://images.genius.com/90ed5acc5725bddf1d8feb24c15ed9f9.300x300x1.jpg", "year": "2013-05-22", "title": "Trip", "album": "Quarter Water Raised Me Vol. I "}]}