{"artist": "Andre Nickatina", "songs": [{"title": "My Homeboy’s Chevy", "album": "A Tale of Two Andres", "year": "2008-06-17", "image": "https://images.genius.com/3a3ece1aeebe42ccdf5af52cbe4dba9a.450x444x1.jpg", "lyrics": "[Intro: Mac Dre]\nWe out here on the streets man thowin' ribs down and shit\nFinna roll up this God's Gift to purple\nCan you get a good focus on that? (Read it read it)\nPull up in something like that\nGo get yo weed from the store the legit way\nQuit thuggin' out\nQuit drivin' yo buckets to the turf and gettin' yo weed\nDrive something legit and buy yo weed from the store\nLike real bossy\n\n\nVerse 1 (Mac Dre)\nI'm on a block stacked up\nGot twamps of kill\nBurpin' out my 74 Bonneville\nNo time to chill\nI'm on the grind for real\nWhat you want?\nWhat you need?\nTryin' to find some pills?\nWell come holla at yo neighborhood thug supply\nGot everythang that a nigga love to buy\nIt's me, M-D\nSkirtin' from the killer whales\nBlack and whites is always on a nigga's tail\nBut I'm hypo, nitro, keep the Chevy Vogue'n, floatin'\nFrom Sac to Oakland but the sack you smokin'\nNobody does it better, Gangsta Mac, kill a nigga and the bitch I sweat her\nI gets my cheddar\nChing ching and all that\nPut it in a Backwood\nNigga roll that\nIt's nothing playa\nA little game and muscle\nIt's all it takes to get a gang a rustle\n\n[Chorus: Andre Nickatina]\nI sit low in my homeboy's Chevy\nMy Makaveli hat pulled down by my eyes\nYo baby peep the science of something that's an actual fact\nYo you can't mix love with rap\nYou better step back\nMy K Swiss, like the step on the gas\nAnd if you knew how fast, you'd think I just might crash\nI think I saw the devil all up in my purple bag, and still I have to roll fat\nCan you believe that?\n\n[Verse 2: Andre Nickatina]\nCan I believe that?\nDid you retrieve that?\nThe money in the bag\nHomie I'ma need that\nMy Blackberry cellphone confuses me\nI got women talking about Nicki you using me\nI got Kool Gee Rap yo, in my speakers in the back\nMy car shine like a new gat, I'm with the \"Genie of the Lamp\"\nComin' off the exit ramp\nI grab cash like a calf cramp\nI like garlic butter with Alioto's crab\nMy son had a fight\nI told him work the jab\nSometimes I'm very stingy\nBut yo I'm mostly greedy\nBeen eatin' onion rings\nOn Polk street, that's very greasy\nMan it's cracking like a flower seed\nBlowing off a gang of weed\nNext to the authority\nPicture four or more of me\nRacing through this shit like the Olympics\nRunning red lights\nNever caring about a witness\n\n[Chorus: Andre Nickatina]\nI sit low in my homeboys Chevy, my Makaveli hat pulled down by my eyes\nYo baby picture tryin to sell somethin that's an actual fact yo\nIf you can't mix love with rap\nYou better step back\nMy K swiss, like the step on the gas\nAnd if you knew how fast, you think I just might crash\nI think I saw the devil roll up in my purple bag, and still I have to roll phat\nCan you believe that?"}]}