{"artist": "King Los", "songs": [{"image": "https://images.genius.com/af979fd34aa3f95d652a83f4bdfdf39a.538x538x1.jpg", "title": "I Do (Freestyle)", "year": null, "album": null, "lyrics": "[Verse 1]\nNow from my manicured hands to my totebag, I'm so bad\nMy grammar, my vocab, my manners, my whole swag\nDog, please, from my heart beats a story\nLeaving odds beat by large leaps, to God be the glory\nYour facade to me is boring\nAin't a fucking way that you could clown me\nI'm so hot, even summer play it cool around me\nI sweep the town like a king, baby, peep the crown\nWho else you know could tell a skyscraper, \"Keep it down\"?\nBut that ain't bout shit, my style just appear fresher\nI'm really bout this, my outfits is peer pressure\nWatch your mouth, bitch\nThese ain't Guccis, they YSL\nBut fuck, if it was shit on a stick\nI'd make it look fly as hell\nI say I got mo' pads, that's cribs for us to go tonight\nHe say he got mo' pads, this nigga's on a motorbike\nBut fuck it, pop a wheelie, throw the deuce up\nIf you pimping, tell your bitches pop a pill and pull some juice up\nI'm too pumped on the track, I need to calm down\nI'm so over the top, I climb a mountain for the climb down\nYeah, I said climb down, nigga, my work has just begun\nWhy celebrate on top of a mountain if I ain't fucking done?\nI'm the one, I be a bastard to assume\nYou still'll be mountain climbing when I'm dancing on the moon\nSuccess loves to hide but I go seek\nEver if I sat my passion down, it would grow feet\nI'm talking walk, crawl, jog, nigga, run to me\nAnd I ain't gotta run game, it really run through me\nShe said, \"Ain't you Los? Well, what it do, nigga?\"\n\"You feel that breeze?\" I said yeah boo-boo, I'm a cool nigga\nNow she stay in arm's reach; as far as she know\nI could stand on a beach and make a palm tree blow\nSpeaking of blow, met this freak at the show\nTold her give me some head and\nShe began to go\nShe was geeking and blow, put it deep in her throat\nTitties and ass need to be on a pole\nAttempt to get high but she frequently low\nPicked a spot on the map and a weekend to go and we gone\nBody so soft and I'm blowing that strong\nGot me saying, \"I do\" like it go in this song\nI do, I do, I would, I will\nFor your love, who should I kill?\nHow good I feel, I kill myself\nI'm fresh to death, I feel myself\nYou don't get it, feel myself?\nFresh to death, I kill myself\nI'm still myself bro, who are you?\nBitch, you sound like so-and-so\nRapping about such-and-such\nI wish your motherfucking flow would grow\nNo chance\nNigga so watered down\nIf you put him in the ground he'd probably grow plants\nCall it flowers for the dead\nYeah bitch, I'm far out like I'm hours from the crib\nI heard when they get thick, you turn diva\nMe, I'm riding out, and I ain't making u-turns neither\nBet you turn zero when them lions out there\nTake your stripes like a tiger, leave you lying out bare\nHold up, wait a minute, nigga come back, I said\nHad to slow that down, had to speed that up\nDamn, I'm just freestyling, nigga, what the fuck\nThis shit was over a long time ago\nBut fuck it, I said it's time to show\nThese niggas that\nI care, I care\nI make home look good like I'm Ikea\nDamn nigga, this is my year, my year\nAnd it feels so good\nSay yeah baby, it feels so good\nI said, I'm singing to you motherfuckers\nI'm like a friend to you motherfuckers\n\n "}]}