{"artist": "Watsky", "songs": [{"year": "2009-11-01", "lyrics": "[Intro: Watsky & Guy]\nHaha ha ha, that was funny man\nThat was funny?\nYeah. So what's the, uh, what's the real track 4, though?\nThe real track?\nYeah. That's- you're not actually gonna put that on the record though\nYeah. That's actually track number 4 on the record\nWatsky\nI'm telling you man, it's not a stretch. It's possible to be funny and serious at the same time\nY'know. Poignant\nWatsky\nYes?\nYou have to like, disrespect women and talk about clubs and shit, like, that's really important nowadays. That's what they want on the radio man\nY'know, it's a track about, y'know, juvenile epilepsy and I feel like it'll be touching and-\nSee okay- You shouldn't have gone anywhere past juvenile. Think JUVENILE. You didn't say bitch ONE TIME IN THAT RECORD\nNo, but at the end of that, eh-\nSprinkle it man. Sprinkle some disrespect on it\nSprinkle it?\nSprinkle a little disrespect on it. There's no disrespect on the record, it's too nice\nYou need to have the big fucking glasses, a funny hat, where's your T-Pain effect?\nI want you to go back, go home, and write a better song with more bitches, fuck more peoples'... mothers. and sisters. and brothers. and grandmothers and shit\nThen come back here, and we'll talk\nLemme bounce with the beat for a second. No homo\n\n[Verse]\nUhm, yeah. Whoo !\nGet in bed like I'm at war\nMake your vagina more than kinda sore\nI'm hung like a dinosaur\nShit your hymen tor\nYou're busted\nYou never grew up like a Toys R Us kid\nI'm well-adjusted like jock strap crutches\nBang my old teachers while the preschool watches\nMet a slow girl, I was fucking her fast\nHad some tight old pussy and got stuck in the PAASSSTTTT\nI molest old age, Grab the best old babe, in a breast hold babe\nIs your chest cold babe?\nAre those boobs your goosebumps?\nHey sugar tits, can a pimp have two lumps?\nMeasure my heart prick, whatever the night\nI use my dick as a yardstick to measure my height!\nI'm healing myself, I have a hole in my pocket\nAnd I'm feeling myself\nI'm like WuTang, your arts cookie cutter like a Warhol soup can\nThe rapper who can destroy mere humans\nFuck your facelift, fuck your played whip\nI built a spaceship, to ride in while you're crusing Earth\nLampooning all the aliens that emcee in the Universe!\nThe ten best rappers is a list of me\nI exist to be, the greatest rapper in history\nBuilt a time machine from Flava's clock and a saddle\nTaught Plato to rap, then kicked his ass in a battle\nI'm the best rapper alive\nThat gets mistaken for Michael Cera everywhere he drives\nFUCK MICHAEL CERA\nYou weren't so super bad\nWhen I was writing and\nYou were running around Rodeo yelling\n\"Who's your dad?\"\nUH!\nMan, fuck this", "image": "https://images.genius.com/72d4e2e214e6ae7ec9aea6dbfa9623c0.224x224x1.jpg", "album": "Watsky", "title": "G.O.A.T.(W.G.M.F.M.C.)"}]}