{"songs": [{"image": "https://images.genius.com/a47da8bd79cb73aa52f09bd933f5f5f9.1000x1000x1.jpg", "title": "Mansion Party", "album": "Cool Patrol", "year": "2018-08-17", "lyrics": "[Spoken Intro]\nAyo girl\nYou wanna come to a party at my house tonight?\nEveryone who's anyone in LA is gonna be there\nI'm extremely rich\n\n[Verse 1]\nHey, girl, welcome to my house party\nIt's a giant mansion baby, don't slip on all my money\nYeah there's a lot of models and some supermodels too\nDon't touch my diamond fridge, it costs more than the country of Peru\n\n[Spoken Interlude 1]\nSeduction is like a game of chess and I'm the queen, wait...\n\n[Chorus]\nCan't stop, won't stop dancin' deep into the night\nIt's a mansion party, yo that tiger's super tight\nAnd if you're feeling naughty we'll snort champagne by candlelight\nIt's a mansion party, and later on's a panda fight\n\n[Spoken Interlude 2]\nYou've really gotta agitate the pandas to get them engaged in combat\nThey're very docile by nature\nI laced their bamboo\n\n[Verse 2]\nHey, girl, heard you couldn't find the dancefloor\nJust walk right past the garden, go through the Spanish French doors\nTurn right at the 7th bathroom then a left at my laser car\nYou can ride my purebred stallion; if you hit my moat you've gone too far (You've gone too far)\nTake an upside down left at the M.C. Escher stairs\nOkay, you're almost halfway there!\n\n[Chorus]\nCan't stop, won't stop dancin' deep into the night\nIt's a mansion party, I bought a yacht just for tonight\nAnd if you're feeling naughty we'll smoke champagne by candlelight\nIt's a mansion party, now let's watch two pandas fight\n\n[Bridge]\nWoo-hoo-hoo\nWoo-hoo-hoo\nWoo-hoo-hoo-hoo-hoo!\nHoo-hoo!\n\n[Spoken Interlude 3]\nMy God, the battle pandas have escaped from the panda-gon and they're murdering the guests\nUh, it's last week all over again. Let’s get the hell outta here!\n\n[Chorus]\nCan't stop, won't stop, nonstop runnin' for my life\nIt's a mansion party, I pray to God we all survive\nAnd if you're feeling saucy we'll grab some spears by candlelight\nIt's a mansion party, we're droppin' pandas left to right\n\n[Spoken Outro]\nSave yourself!\nArgh, this party's awesome!\nSo many pandas!\nSo glad you've come to this party, baby..."}], "artist": "Ninja Sex Party"}