{"artist": "Rich Homie Quan", "songs": [{"lyrics": "[Intro]\nYeah, you know, if you thought I was going to stop goin' in\nYou can ask double R, nigga\nThat's Royal Rich\n\n[Hook]\nCould've been a doctor\nBut I chose streets\nI could've been a lawyer\nBut I chose streets\nCould've been anything I wanted to be\nBut I chose streets\n(Nah, but be honest) Hm, the streets chose me\n\n[Verse 1]\nHey\nStarted with it, I ain't start with paper, started with nothin', uh\nDroppin' out the hot bars that'll let me hit the ground runnin', uh\nI was thirteen when a young nigga just don't know how to put it, yo\nI was drivin' at fifteen got tired of the bus, ha\nFor the yellow cheese, I was gettin' cheese for the guy that wasn't, and\nNigga wouldn't try me in high school cause I had alot of buzzin'(?)\nFuck that, I'mma take shit like bloods and\nTalk like Thug when you see me in public\nYou the predicate, nigga, I am the subject\nAnd I'm still goin' in but\n\n[Hook]\n\n[Verse 2]\nHey some type of way went gold yea i got my first plaque\nThen my Hitta went platinum then went n got me some racks\nGot a black card, Visa cards, I don't like to walk around with cash\nI might kiss in the front, just know I don't kiss no ass\n\n[Interlude 1]\nI ain't drop no mixtape in two years, but I been still on that roll\nI been here for 25 years, thank God I'm still here\nBut I know I gotta go, know I gotta go\nYou ain't gotta go\n\n[Verse 3]\nGet money, don't play my nigga, I ain't never change, still goin' in\nWho the fuck said I wasn't gon' drop no mixtape?\nWho the fuck y'all think I'm is?\nGot alot of money, got alot of bitches, got alot of places that I still ain't been\nBut I got more problems than all of that\nThat's why I'm still goin' in\n\n[Interlude 2]\nStill goin' in, still goin' in\nI said I'm still goin' in, I'm still goin' in\nI'm still goin' in, when I start?\nHey Double R, when I start?\nRoyal Rich\n\n[Verse 4]\nI done made so much money, I got like four bank accounts\nI put this pistol to your head, give you somethin' to think about\nI ain't on vacation, I was chilling, they thought I was in a drought\nFuck a rap career\nI'll make a transaction if it's for the right amount\nI got my hands on her she know that i feel her\nHanged with drug dealers and nuthin but killers\nMy money got stacked from the floor to the ceiling\nYeah, yeah, yeah, the ceiling\nI ain't have no more room in the attic, we filled it\nYeah, yeah, yeah\nWanted for murder, but scoota make the beat\nAll i just did was killed it\n\nI'm a rapper now but\n\n[Hook]\n\n[Outro]\nStill goin' in x7, aye\nI told y'all niggas man\nR.F(?) style for life", "title": "Intro (If You Ever Think I Will Stop Going In, Ask Double R)", "year": "2015-04-28", "image": "https://images.genius.com/de2fdc28861bb7f4b83adb4771a85acc.412x412x1.jpg", "album": "If You Ever Think I Will Stop Going In, Ask Double R"}]}