{"artist": "Iggy Azalea", "songs": [{"title": "Middle Man", "lyrics": "[Verse 1]\nI only got five motherfuckers saved in my phone\nEverybody else blocked\nI'm goin' through five court cases, goddamn go home\nI win, this ain't gon' stop\nI'll be the underdog, so fuck it, woof, woof\nAin't nobody think I'd make it so, bye\nYou should take a sec to learn who I am\nBefore they talk fuck shit like a hotline\nNever put my chest out ever like I'm the best\nLost friends by the loads, they didn't try to flex\nWhile I'm on the helicopter flyin' skylines\nYour ass shoppin' at CVS\n\n[Pre-Chorus]\nFake people wanna kick it like they Liu Kang\nAs if I'm blinder than a bat, look at Bruce Wayne\nHow the hell am I the villain? I became Bane\nThey tryna take my head off, Ichabod Crane\nFuckin' hard bein' Iggs, I ain't ever vain\nBut I do have a vine if I need to swing\nOut the motherfuckin' way when the lies come\nIn your ass where you put your opinion, uh\n\n[Chorus]\nYou need people like me to get through your day\nGot my name all in your mouth, how does it taste?\nGot someone for you to meet, got someone for you to meet\nNot the pinkie or the ring boy, but a bird who speaks\nSay hi to the middle man, hello to the bad guy\nSay hi to the middle man, hello to the bad guy\nSay hi to the middle man, hello to the bad guy\nSay hi to the middle man, ayy, say hello to the bad guy\n\n[Verse 2]\nWhat you mean I don't write my lyrics?\nI'm not real rap, I don't talk about feelings?\nYou are a trap queen on fleek all summer\nI'm tryna understand why it change when I come out\nIs this about image? Do I need permission?\nTo love hip-hop, pay word to Stevie J\nCan't help that I rap, oh my accent's fake?\nGuess I'm Joseline, they gon' talk anyway, way\nLife move fast so I drive slow\nAnd my life move fast so I drive slow\nUh, ain't tryna say I'm not a pop star\nLike Jay say, \"Ayy, you are who you fuckin' are\"\nUh, and I ain't tryna change that\nMillion dollar bills ain't tryna change that\nNever had the feelin', take a sip of this tack\nYou want me to leave you, along with the stacks\n\n[Pre-Chorus]\nFake people wanna kick it like they Liu Kang\nAs if I'm blinder than a bat, look at Bruce Wayne\nHow the hell am I the villain? I became Bane\nThey tryna take my head off, think about cryin'\nFuckin' hard bein' Iggs, I ain't ever vain\nBut I do have a vine if I need to swing\nOut the motherfuckin' way when the lies come\nIn your ass where you put your opinion, uh\n\n[Chorus]\nYou need people like me to get through your day\nGot my name all in your mouth, how does it taste?\nGot someone for you to meet, got someone for you to meet\nNot the pinkie or the ring boy, but a bird who speaks\nSay hi to the middle man, hello to the bad guy\nSay hi to the middle man, hello to the bad guy\nSay hi to the middle man, hello to the bad guy\nSay hi to the middle man, ayy, say hello to the bad guy\n\n[Interlude]\n\"It's not real rap, rap, like, that's the pop shit, you gotta do some like corny shit\"\n\"I'm tired of listening to her on the radio like all the time, unfortunately, my kids love her though\"\n\"Ayy, where the fuck did she learn to talk like that? Is she taking an Ebonics class?\"\n\"You're Australian, but you're like a white rapper, like you can rap but...\"\n\n[Chorus]\nYou need people like me to get through your day\nGot my name all in your mouth, how does it taste?\nGot someone for you to meet, got someone for you to meet\nNot the pinkie or the ring boy, but a bird who speaks\nSay hi to the middle man\n(Hello) Hello to the bad guy", "image": "https://images.genius.com/a5c16badc65ae40f6034b0d404bab2c9.1000x1000x1.png", "album": "Digital Distortion [Shelved]", "year": "2017-06-01"}]}