{"songs": [{"album": "A Year and a Day", "image": "https://images.genius.com/07b58bbb55162f134918e0fb84589756.500x500x1.jpg", "year": null, "title": "At It All Night", "lyrics": "[Intro:]\nYeah yeah\n\n[Verse1:]\nOk you see me in a packed club, vip\nSee me doing me,I be\nPoppin bottles tossin dollers out to every freak I see haters be, looking hard maybe cause we took they broad simmer down guard you know you don't want\nIt with the squad.aye listen, hear me loud and clear even though it loud in here hit the bar and grab a beer then get your ass dragged out of here king\nOf the club same captain of the dream team big bank avalanche hit me watch me as your ship sink, you be on that sucka shit I be on some other shit meet\nA bitch, fuck a bitch, drop her, find another bitch sucka hate my gut for dis n dat but ho's be loving it whatever you had budgeted my pocket money double\nIt. rich kids like my lil cousin, still thuggin it\nIt hurts to see me do it big then get out ballin doesn't it?\nNow wasn't it, the rawest shit you saw in your life how we took a 100 rats to the club and spent it all in a night\n\n[Hook:]\nPoppin bottles in the club, buckets on ice haters in the corner mean muggin alright watch us while we ball like... heeey! we gon be at it all night...\nBall like... heeey! we gon be at it all night... I seperate you from your girl cause I know what they all like, black, white, latin, short tall, all types\nLove it when I ball like... heey! we gon be at it all night... ball like... heey! we gon be at it all night\n\n[Verse 2:]\nAlways been the judge wouldve threw the book at me cause I show up to the club super cool look at me everything brand new, you get money like who? spend 150 on my car and my automar too since I walked up in the spot\nAin't nobody saw you, they see me like \"they he go!\" look at you like aww boo, bought\nEvery bottle at the bar shawty you know how I do I take them all across your noggin I ain't finna argue It's still big shit poppin nothing changed but\nMy clothes, triple digits in my pockets rubber band bank rolls tell your bitch I'll take her places where ya man can't go, can't be, he ain't doin shit\nIf he ain't me can't you see the difference between us when I walk up in the door get 20, 000 worth of ones start lettin that money go let it fly throw\nSome 20 when my ones running low 50 stacks ima show you how to ball double dat\n\n[Hook:]\nPoppin bottles in the club, buckets on ice haters in the corner mean muggin alright watch us while we ball like... hey! we gon be at it all night... ball\nLike... hey! we gon be at it all night... I seperate you from your girl cause I know what they all like black, white, latin, short tall, all types love\nIt when I ball like... hey! we gon be at it all night... ball like... hey! we gon be at it all night\n\n[Verse 3:]\nHe can't hit it unless he pay her, dat nigga ain't a playa, you say it's a recession shit and me I can't telll... watch us while we ball like... hey! we\nGon be at it all night... ball like... hey!... we gon be at it all night... now throw it in the air representin ATL let it hit em in the hair... all the\nBitches like yeahh! love it when I ball like... hey! we gon be at it all night ball like... hey! we gon be at it all night\n\n[Hook:]\nPoppin bottles in the club, buckets on ice haters in the corner mean muggin alright watch us while we ball like... hey! we gon be at it all night... ball\nLike... hey! we gon be at it all night... I seperate you from your girl cause I know what they all like black, white, latin, short tall, all types love\nIt when I ball like... hey! we gon be at it all night... ball like... hey! we gon be at it all night"}], "artist": "T.I."}