{"songs": [{"album": "The Last Street Preacha", "image": "https://images.genius.com/0dfcbb4206d4275d62c5313a39527a03.300x300x1.jpg", "year": null, "title": "Tru 2 Life Playas", "lyrics": "[Verse 1]\nKinda like tha mafia if you ask me, who's that?\nAll of them ridas from ORC, why's that?\nCuz we bad like 3 strikers when we spit rhymes and preach to street bikers\nOr convicts in ricers\nThere never ain't no telling what we gonna do\nCuz when you think we through\nWe come back hit you\nWit another hit, ain't no stopping me and my gang\nBoneybone Corleone from the MTV cut fame\nSame rapper and same rider, Westsider\nOnly difference is my beats and rhymes tighter, that's real\nNow throw in tha sky if you down wit me\nI represent that organized rhyme family\nFamily tree consist of demon killas\nReaching drug dealers and top billas making scrilla\nLivin' in white villas, using guerilla tactics to reach crypts and bloods\nAnd all tha thugs that are looking for love\n\n[Hook]\nWe's them rhyme sayers, true 2 life plays\nDippin' in navigators not trippin' on all you haters\nMaking rider music strictly for tha Creator\nWit more game from tha bay than the Oakland Raiders\n\n[Verse 2]\nFrom tha land of Chuck Taylors, khaki wearers and gang bangers\nWhere rap sangers lowride and talk about 'em colored bandanas\nDucking from one time, California sunshine\nProjects and streets infested wit thugs that are doing major crimes\nPrimetime couldn't paint a better picture\nBest beware of them locs and O.G.'s from them thugs hit ya\nCuz where we from it's straight scandalous, Los Angeles\nAin't too many players or ridas that can handle us\nSlugs flying in every direction you look\nGot homeless people living under bridges and drug addicts hooked\nAin't this a shame, that's why me and my gang preachin', like deacons\nTo bloods, crips, Latinos, Blacks and Puerto Ricans\nEvery weekend we be speakin' and preachin', teachin'\nHow we need to be reachin' tha heathen, sleepin'\nWhile tha devils creepin' meetin' to put these suckas names on contracts\nAnd lift up and raise up tha King of kings like a car jack!\n\n[Verse 3]\nWe making moves like a U-Haul\nPlaya haters don't get it twisted like RuPaul\nWe don G's and family, that stick together like Siamese twins\nAnd Chinese steam rice from Chang Lee's\nI'm tha, Bone Corleone wit Lucky Luciano, Kevin Blanco and Mr. Donnie Brasco\nE-Doggie Montana from Nicaragua, my little patna that we be calling Jimmy Hoffa\nCan't forget about Chase Gigant, cuz when I rhyme say he makes'em beats bomb bay\nHot like picante, this is tha click that I be talking about\nSo if you ain't down wit us then back up before you get clowned"}], "artist": "T-Bone"}