{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "Nobody Hates Nothin’", "year": "2003-06-24", "album": "The Entity", "lyrics": "[Chorus]\nNobody wants you, they're all gonna laugh at you. (Laugh at you)\nCuz in reality, everybody hates your guts. (Yeah, they hate your guts)\nI never loved you even though I know that you loved me\nGordy, you're nothing. Gordy, you're nothing. Gordy, you're nothing\nYeeeeeaaaaaah\n\n[Verse 1]\nNobody loves me, nobody likes me\nWhy am I rhymin? Ain't nobody gon buy me\nCan't even get nobody\nNo woman wants to hold me, I'm lonely. I'm a big nobody\nNobody smokes with me neither\nNobody's there to put five or get high off of my own reefer\nNobody to chill with\nGet tipsy when I get rimy, kill fifths\nAin't nobody with me\nAin't got nobody to slide with me\nI got a cut list on twenties, nobody rides with me\nWe copin with the loud sounds\nNobody give a fuck, cuz I'm the nobody around town\nDon't even beef with nobody\nI'm nobody to beef with, e, I got heat with nobody\nCan't even sell yay on my corner\nFiends won't buy me like they ain't see nobody, guess they ain't want him\n\n[Chorus]\nNobody wants you, they're all gonna laugh at you. (Laugh at you)\nCuz in reality, everybody hates your guts. (Yeah, they hate your guts)\nI never loved you even though I know that you loved me\nGordy, you're nothing. Gordy, you're nothing. Gordy, you're nothing\nYeeeeeaaaaaah\n\n[Verse 2]\nI used to hate myself. I hated everything about me\nI hated everything that breathed around me\nBut I'm also the most hated\nWhen I roll on chrome they so hate it\nWhich one of y'all got the most hatred?\nCan't get a record deal. Major labels hate me\nI got no sex appeal, that's why no ladies will date me\nPlus lately the daughter of my baby's been kind of crazy\nSayin she never loved me.. Aw bitch quite hating\nI just hit that a week ago\nThen you see me with a chick and you become a hater\nSwing and hit the ho\nYou got too much hate in your heart, I seen this before\nOnce the hatin in you starts it just eats at your soul\nWill the hatred in you stop? I think not\nUntil you drop all your hater ways, put down the haterade and drink pop\nI classify you as a hate monger\nIt makes me wonder if anybody ever told you they loved you or hugged ya\n\n[Chorus]\nNobody wants you, they're all gonna laugh at you. (Laugh at you)\nCuz in reality, everybody hates your guts. (Yeah, they hate your guts)\nI never loved you even though I know that you loved me\nGordy, you're nothing. Gordy, you're nothing. Gordy, you're nothing\nYeeeeeaaaaaah\n\n[Verse 3]\nI guess I'll never be nothing\nThey say nothing from nothing leaves nothing\nI'm blind, I sees nothing\nMy mind forsees nothing\nI'm racing, running into nothing\nTrynna make me something, I am nothing\nNothing ever goes my way\nYou try fucking me, it's nothing\nThe shit you took was nothing any way\nOr maybe I was just never nothing to you\nLike our friendship meant nothing and I never did nothing for you\nEvidentally I been nothing since the beginning\nFrom out the womb until my funeral, I'll be nothing\nI never wanted nothing\nThen again nothing ever wanted me\nNow we are a couple\nTwo nothings marry happily\nUntill she divorces me ending it horribly and leaves me with nothing\nIt's just so sad to see..\nI'm such a nothing, everybody laughs at me. [*Crying*]\n\n\n[Chorus]\nNobody wants you, they're all gonna laugh at you. (Laugh at you)\nCuz in reality, everybody hates your guts. (Yeah, they hate your guts)\nI never loved you even though I know that you loved me\nGordy, you're nothing. Gordy, you're nothing. Gordy, you're nothing\nYeeeeeaaaaaah"}]}