{"songs": [{"album": "No Filter", "year": "2015-03-10", "title": "Remember", "image": "https://images.genius.com/ea5b028a5a57768ca3e6307f55ae4c34.1000x1000x1.jpg", "lyrics": "[Intro]\nMemories is such a beautiful thing\nI don't wanna take ’em for granted\nSo let me reminisce for a minute\nYa'll reminisce with me\nLet's see if you all remember this\nLet’s go\n\n[Verse 1]\nRemember when we youngins'?\nBefore we ever knew we was poor?\nSix of us in the bed, others sleep on the floor\nRemember Leave It To Beaver and hide and go seek?\nThree Stooges, late night, that was all we was doin'\nRemember Hawaiian Silky and the S-curl?\nTo get them naps out, that was our back route\nRemember you might get killed for a starter coat\nA starter hat, that's where them snap-backs started at\nYeah, I remember knockin' on doors and runnin', was all in the name of fun, we just had to be into somethin'\nRemember, I remember truth and dare with the homies, things happened that I probably shouldn't share with you homie\nI remember though\n\n[Hook - J.R.]\nDo you remember way back when?\nAll those crazy things happened\nWe were young, we was fun\nSaid some things and some things got done, yeah\nAnd I ain’t seen you all in so long\nBut I promise I’ma hold on\nTo the memories way back when\nWay back, way back when\n\n[Verse 2]\nRemember British nights?\nLadies and college bros\nJodeci boots were poppin'\nRemember nineties clothes?\nWho had a pair of bibs, cross colored, I guess\nEither a Turkish chain, a hair and bone on your neck\n(Fellas, there’s a jealous girl in our town)\nMusic by ABC\nPoison by BBD\nSWV had every girl weak in the knees\nWhatever group we was on, listenin' to R&B\nThem paper food stamps, boy that was way back\nYour mom would say, \"Go spend a penny and bring some change back\"\nBoy, I remember havin' fun on the block but anybody momma allowed to whip your but on the block\nI remember though\n\n[Hook - J.R.]\nDo you remember way back when?\nAll those crazy things happened\nWe were young, we was fun\nSaid some things and some things got done, yeah\nAnd I ain't seen you all in so long\nBut I promise I’ma hold on\nTo the memories way back when\nWay back, way back when\n\n[Verse 3]\nRemember?\nToday was a good day, them was good days\nWatchin' Cube in the drop as he would switch lanes\nCut off khakis, a Jerry curl and tube socks\nWhen every video we watched was on a jukebox\nForget a cellphone, we had a page on\nAnd when it beeped we had a quarter for the payphone\nRemember watchin' Good Times what it done for you?\nWe can't lie, we all wanted to be a Huxtable\nRemember Boyz N The Hood put the block on the map?\nAnd how it felt when Ricky ran and got shot in the back?\nSo many things to remember, I'm just thankful to God\n'Cause what we've seen and what we've been has made us who we are\n\n[Bridge] x2\nYes, I remember\nYes, I remember\nYes, I remember\nI remember way back when (way back when)\nI remember way back when (way back when)\n\n[Hook - J.R.]\nDo you remember way back when?\nAll those crazy things happened\nWe were young, we was fun\nSaid some things and some things got done, yeah\nAnd I ain't seen you all in so long\nBut I promise I'ma hold on\nTo the memories way back when\nWay back, way back when\n\n[Outro] x2\nYes, I remember\nYes, I remember\nYes, I remember\nI remember way back when (way back when)\nI remember way back when (way back when)"}], "artist": "Json"}