{"songs": [{"title": "Hellsing Station", "image": "https://images.genius.com/f1efeb048121b1a7bb012bbb3c44023b.220x220x1.jpg", "album": null, "lyrics": "[Intro: ZillaKami & 6ix9ine]\nScum Gang!\nTaking passage\nProject GHXST\n\n[Verse 1: ZillaKami]\nDrugs in my veins, taking passage (Hey!)\nLaid out tripping, flipping, addict with the habits\nPaid a couple thousand for the casket (Go!)\nNiggas won't sleep well after being savaged\nVertical face split, skip the fucking casings\nBags in my eyes and my dreams in the Hell pits\nBurning all the pictures of the dreams and the mansion\nUsing dirty dishes, mentally I'm Charles Manson\n(Yeah!)\n\n[Verse 2: 6ix9ine]\nSmooth nigga, false step, you rise (Baow!)\nDon't move nigga, cross-hairs in sight\nThe zoo nigga, concrete, both sides\nWho are you nigga? One step, you die (Brrr)\nTEKA$HI69 from that Scum fucking Squad (Aah!)\nNo doors, break the walls, Scum Gang 'til I fall ('Til I fall!) (Squad)\n\n[Verse 3: ZillaKami]\nZilla, resurrect outta the crypts (Hey)\nThe Loch Ness off-rip, green, yellow, the piss\nThe Palm grip, four-fifth, running 'round in the trench (Who?)\nYou want shit, talk shit, might rip off your lips\nIf you God, I'm Kratos, the black is the rose\nThe flower that bloomed at Selena, it's grown\nThe Yokai killer, creeping in the grove\nY'all niggas pose, I'm gone bake in the stove\n(Yeah!)\n\n[Verse 4: 6ix9ine]\nCame to the God then your jaw got bent\nBig shit loud, like the block got hit (Grrrah!)\nCame outta jail, still hitting them licks\nOff on bail, still flicking that wrist (Yeah!)\nWant collabs? Ain't doing it for nothing (Project GHXST)\nWanna meet up? Scum Gang ain't trusting\nGetting beat up? Not slick, we busting\nSwitchblade hip, square up, I'm cutting\n(Yeah!)\n\n[Verse 5: ZillaKami]\nActing like you Scum, but it ain't in your veins\nActing like you Scum, but it ain't in your brain\nLord of the gauze and the God of the pain\nMan, I draw with force of the Four Horse-mane\nHundred through a thousand to a gold fucking brick\nYou fucking with the rawest of the raws with the grip\nWith the white tee cotton and the shirt say \"R.I.P.\"\nTen-toes never ever trip, bitch!\n\n[Break: SosMula]\nTime slow, eyes closed, I know I ain’t no blind fool (Hey!)\nSomething media blindfolds, body or mind (Hey!)\nTime slow, eyes closed, I know I ain’t no doctor\nSomething media blindfolds (Who? Who? Who? Who?)\n\n[Outro: ScumBagChad]\nScum Gang, nigga, still no charity\nSuck my dick, Scum Gang forever, nigga\nAye, Scum, Gang, Scum, Gang\nUh, reaching for the knife, come all the way to murder\nDeal with it. You got a what now?\nI got one deal. Shut up, nigga\nAye, fuck you, nigga. Scum Gang, nigga\nFuck the police, fuck the non-believers, all those niggas\nProject GHXST\nScum. Y'all niggas out here get Scummy, same thing", "year": "2016-08-07"}], "artist": "ZillaKami"}