{"songs": [{"album": null, "year": null, "title": "IC IC (feat. St. Lunatics)", "image": "https://s3.amazonaws.com/rapgenius/qlffff0000000000000000000000000000072bc0.jpg", "lyrics": "(feat. St. Lunatics)\n\n(Intro - Murphy Lee - talking)\nI-I-I-I-I-I see some hoes..\nIn herrrre..\n\n(J-Kwon - talking)\nAyo TrackBoyz..\nIts cool if I bring my other cats\nFrom St. Louis on this one?\nCome on..\n\n(Verso - Nelly)\nGirl as you came through the door, you heard it before\nErrbody in this bitch better hit the floor\nYour man got some money, but I bet I got more\nI heard he got a Bentley, but I bet it ain't a Zoure\nShe braggin' bout his Cadillac, bitch I got four\nShe keep runnin' his mouth I might go climb in four more\n\n(Verso - J-Kwon)\nI like 'em heavily beated, conceited, you can't beat it\nBust some pussy like a cookie wit no milk I can't-can't eat it\nOkay you love me? no lie, but watch it my charm bright\nThat don't mean that you can kick it, from grippin' my arm tight\nPlus you lookin good, that-that I can't perform right\nIn a U.S. club, down the lot p-p-pourin' right\nJamaica born, I don't mean to toot your horn right\nBut ya ass super fat, w-w-was you b-born right?\nAnd right now, I'm just chillin' with MURPH DERT!\nYour girl's in the club, but feelin' on MURPH DERT!\nAnd half of these hoes be askin' for Nelly team\nI don't know where Nelly team, but I know where my ding-a-ling\nKwon the new cat, who on the scene of things\nAnd I'm pimpin' HOOES! you really ain't seen a thing\nMaybe a moon ring or maybe some jelly beans\nI mention the Four Seasons, I'm hittin' by any means\nCause..\n\n(Hook: - J-Kwon x2)\nI.....I see some hoes in herrrrre\nAnd I.......I see some hoes..\nIn herrrrrrrrrrre\n\n(Verso - Murphy Lee)\nAyo I'm Murphy Lee +The Ladies' Man+, I'm Leon Phelps the go-getter\nI've been pimpin' since pimpin', even was pimpin' my babysitter (You not no pimp!)\nI beg yo pardon I've been pimpin' since Kindygarten\nShe had the nicest boobies and remind me of Dolly Parton (Tits)\nMy First grade teacher bought my first set of markers\nMy Second grade teacher, she kind of favor Ms. Parker\nThird grade: I switched schools, then my teacher was a dude\nHe taught me how to pimp the teachers into breakin' the rules, shoo\nMy Fourth grade teacher man she had a badunkadunk\nIf I would shot from a 'A', she would give me a couple points\nFifth grade: I exposed my first ass, Sixth grade: I skipped my first class\nSeventh grade: is when I first smashed, Eight grade: I smoked my first grass\nUh, I'm not a bad dude been on more backs then tattoos\nGirl's scarred to say \"Hi\" so they just blush and just ask you\nTo ask me, autograph, pictures and hugs\nI see a whole lot of women on the parking lot but more in the club\nWhat up..\n\n(Hook: - J-Kwon x2)\nI.....I see some hoes in herrrrre\nAnd I.......I see some hoes..\nIn herrrrrrrrrrre\n\n(Verso - Ali)\nNow in the V.I.P. I see so many hoes its hard for a playa to make a decision\nOne in therre with an ass so fat I seen it with my pimp view vision (OOH!)\nYou ain't got no panties on, my rep name: The Panic Zone\n(Ali, is you a pimp?) Till I die, and I'm standin' on\nIt's nothin' to a boss, you'll fuck on what it costs\nI'm the type to lose at dice and rob for what I lost\nGod Glory Hallelujahs, you miss a call I knew ya\nAnd what's ya name? My name Ali, I wanna stick it to ya\nNow as I sit therre and check ya, ya lookin' kind of tight but you act too fly to me\nPush this thing in ya mouth and right before I nut I pull it out and get ya E-Y-E\nNow you know I go hard on them know, got a pimp card that I show\nAnd a bourgeois bitch, I dump cigars on that ho\nGive a model something to swallow, send her back on the runway\nDay off bitch? please we gon' double up on Sunday..\n\n(Hook: - J-Kwon)\n((x2) until fade out)\nI.....I see some hoes in herrrrre\nAnd I.......I see some hoes..\nIn herrrrrrrrrrre"}], "artist": "J-Kwon"}