{"songs": [{"album": "Activated", "image": "https://images.genius.com/dbf64d5289adc1fb1c700f63f63dfe25.945x945x1.jpg", "year": "2018-05-11", "title": "I Remember", "lyrics": "[Intro: Tee Grizzley]\nAye, I look at 50 dollars like, it's still 50 dollars\nI don't give a fuck how much money I got\nChopsquad\nI remember my struggle so vividly, that every dollar still count to me\nA lot of niggas be like 10 bands, oh that ain't shit, that's a 100 to me\nLook, I remember that struggle vividly man, call me petty or whatever man\nChopsquad DJ on the beat so it's a banger\n\n[Chorus: Tee Grizzley & YFN Lucci]\nI remember sleepin' on the floor (on the floor) (yeah)\nI remember being broke (bein' broke) (yeah)\nI know if all this money go\nI'm gon' look up like where everybody go? (everybody go?)\nYeah, I remember sleepin' on the floor\nI lost everything but hope (lost everything but hope)\nI know if all this money go\nI'm gon' look up like where everybody go? (everybody go?)\n\n[Verse 1: Tee Grizzley]\nUsed to carry bottles to the store\nThinkin' to myself like I can't do this shit no more\nI did 4 months in the hole\nThinkin' to myself like I cannot wait to go home\nStay strong, right or wrong, I'm gon' grind it, they like keep it up\nWe just wanna get money, they just wanna beef with us\nIt's guaranteed you gon' die one day but I'll speed it up\nPolice get behind the SRT, don't stop it, speed it up\nGot no problem cuttin' day ones off, these niggas be fu\nEverybody always talkin' 'bout what they would do\nNigga speak before they know the truth, these bitches too\nYou can be blood, I'm not goin' broke for you 'cause\n\n[Chorus: Tee Grizzley & YFN Lucci]\nI was sleepin' on the floor, yeah (on the floor)\nI remember bein' broke (bein' broke)\nI know if all this money go (if all this money go)\nI'm gon' look up like where everybody go? (where everybody go?)\nI remember sleeping on the floor (sleepin' on the floor)\nI lost everything but hope (I lost everything but hope)\nI know if all this money go (I know if all this money go)\nI'm gon' look up like where everybody go? (where they go?)\n\n[Verse 2: YFN Lucci]\nUh, I remember, I remember a whole lot of bad winters, yeah\nI remember goin' juggin' before Christmas, yeah\nI remember when I got my first pistol, yeah\nI remember, sleepin' on the floor at [?]\nI remember puttin' that money in my Timbs\nI remember when they snatched up an L\nThey they got styrofoam, then Stan came home, the whole gang on\nAy that my dawg, that my dawg we shared the same bone\nThe same couch, the same house, even the same phone\nThe same .357 that got your man gone, that's on the zone\nI wonder why the real don't live long\nSometimes I wonder who gon' be here if he gone\nSometimes I ponder, I got so much on my dome\nI got so much in common, I can't even keep calm\nSticks with the drums, they don't want no problem\nNiggas know how we come and yeah, I'm from the bottom\nWe was sleepin' on bunk, yeah end of road, that's a lot of humps\nYeah, can't forget where we came from\n\n[Chorus: Tee Grizzley & YFN Lucci]\nYeah, I remember sleepin' on the floor\nI remember being broke (being broke)\nI know if all this money go (if all this money go)\nI'm gon' look up like where everybody go? (where everybody go?)\nI remember sleepin' on the floor (sleepin' on the floor)\nI lost everything but hope (I lost everything but hope)\nI know if all this money go (I know if all this money go)\nI'm gon' look up like where everybody go? (where they go?)\n\n[Verse 3: Tee Grizzley]\nI remember when me and Rell were sharin' clothes\nLike when you wear my shit, don't post, I don't want nobody know\nReal shit had my heart and soul\nProbably don't know how much she used to love me, we slept on the floor\nI remember back in middle school, we used to walk home\nYou hate what I said on 'Win' but I can't lie in my songs\nTell the truth on all my audio, keep it real until he call me home\nWhere the fuck did all my niggas go when I needed them around?\nI hope she don't have no baby on me, that might break me down\nThey ain't visit me upstate, no, so they ain't gon' visit my grave, no but\n\n[Chorus: Tee Grizzley]\nI remember sleepin' on the floor (I was sleepin' on the floor)\nI remember being broke (I remember being broke)\nI know if all this money go (if all this money go)\nI'm gon' look up like where everybody go? (where everybody go?)\nI remember sleepin' on the floor (sleepin' on the floor)\nI lost everything but hope (I lost everything but hope)\nI know if all this money go (if all this money go)\nI'm gon' look up like where everybody go (where did everybody go)\nI remember sleepin' on the floor (sleepin' on the floor)\nI remember being broke (I remember being broke)\nI remember being broke (being broke)\nSleepin' on the floor (on the floor)\nI remember being broke\nIf all this money go\nDamn where everybody go?\nDamn where everybody go?"}], "artist": "Tee Grizzley"}