{"artist": "Fashawn", "songs": [{"year": "2012-11-20", "album": "Champagne & Styrofoam Cups", "image": "https://images.genius.com/09dcf1a0e7f7a1c4eac047d2fc35bd69.500x500x1.jpg", "lyrics": "[Background Sample] Blue is the color of the red sky X 4\n\n[Verse One: Fashawn] Uh, I’ve seen the crip lying dead with blood on his chest\nNext to an AK slug to the vest there was no rest before it’s all set\nLike a young playing poker with a old deck\nSame tricks, same cards\nLife for a life, your game of ours\nThe game is flawed, we can’t afford to have more casualties in an aimless war\nNow you tell me really what you banging for\nI ain’t trying to preach and tell you praise the Lord\nYou try to save my own, but it all starts at a place called home\nThe ghetto sounds like the shooting range\nWe’re the proof, won't remove the pain\nLet’s do the training, let’s choose the claim\nRed and blue with every hood you bang\nWe all the fuck the same\nFive shootings, twelve hours don't need yours just shell showers\nIt's in hell of ours keep a black suit\nA bouchet of flowers better safe than sour\nNo seat belt, but they strapped it up\nPack it on if you face the cowards\nStole the graveyards the only finish line in the race for power!\n\nBlue is the color of the red sky\nBlue is the color of the red sky\nBlue is the color of the red sky\nBlue is the color of the red sky\n\n[Verse Two: Fashawn]\nWe live a life that’s do or die\nEven the blood feel blue inside\nWe’re victims of our own desire\nLiving in a city where the skinny niggas ride,uh\nThe only remining is that it’s getting high\nPouring Hennessy for those that are still alive\nSome say nevermind be unified\nSo we separate you like you and I, oh\nThey’re be sending kids to their maker, uh\nIn my neck of the woods\nGot no love for my neighbor, much love of my hood\nI will program the whole can is that 44 make your dude vanish\nNow it's yellow tape, ambulances\nBullet holes and no news cameras\nThe question is when will it stop?\nDefend your own, can’t depend on the cops\nLet the Lord strike me if that ain’t true, true\nFact remains that they are gang too\nWe're forever at war , please , somebody tell us what for?\nIf there's the shells on the floor\nNobody uses their heads anymore\nSo I'm asking\n\nBlue is the color of the red sky\nBlue is the color of the red sky\nWe gotta stop killing each other man\nBlue is the color of the red sky\nIt’s no purpose\nBlue is the color of the red sky\nKill your brother, kill your enemy\nIt's the same thing\nBlue is the color of the red sky\nWalk as a king, my nigga\nThink like a king!\nIt’s real, we’re all kings!\nIt’s gotta think like that, think what I’m saying", "title": "Color Blind"}]}