{"artist": "Big Daddy Kane", "songs": [{"lyrics": "(Verse 1:)\nHere I am . . . R-A-W\nTerrorist, here to bring trouble to\nPhoney emcees, I move on and sieze\nI just conquer, and stomp another rapper with ease\nCause I'm at my apex and others are be-low\nNothing but a milliliter, I'm a kilo\nSecond to none, making emcees run\nAlso don't try to step to me, cause I ain't the one\nI relieve rappers just like Tylenol\nAnd they know it, so I don't see why you all\nTry to front, perpetrating a stunt\nWhen you know that I'll smoke you up like a blunt\nI'm genuine like Gucci, raw like sushi\nThe Sage of Rage is what rap did to me\nTo make me want to create chaos and mayhem\nCold rock a party, until the A.M\nI'll make a muscle, grab the mike and hustle\nWhile you stand dazed and amazed, I'll bust a little rhyme\nWith authority, superiority\nAnd captivate the whole crowd's majority\nThe rhymes I use definately amuse\nBetter than Dynasty or Hill Street Blues\nI'm sure to score, endure for more without a flaw\nCause I get RAW!\n\n(Verse 2:)\nI give a speech like a reverend, rappers start severin\nAnd in my lifetime, believe I've never been beaten\nOr eaten, or just tookin out\nYou know, come to think about, I keep emcees lookin out\nAnd real nervous, when I'm at your service\nAlso give me that title boy, you don't deserve this\nI work like a slave to become a master\nAnd when I say a rhyme, you know that it has ta\nBe perfectly fitted, cause I'm committed\nThe entertainer and trainer and Kane'll get with it\nI go and flow and grow to let you know, I'll damage ya\nI'm not an amateur but a professional unquestionable, without a doubt superb\nAlso full of action, my name should be a verb\nMy voice will float, on every note\nWhen I clear my throat, that's all she wrote\nThe minute that the Kane starts to go on\nBelieve it's gonna be smooth sailing so sail on\nAs I put other rappers out of their misery\nGet em in a battle and make them all history\nRulin and schoolin, emcees that I'm duelin\nWatch em all take a fall, as I sit back coolin\nOn a throne, with a bronze microphone\nUhm, God bless the child that can hold his own\nCause I get raw!\n\n(Verse 3:)\nChillin, killin like a villain\nThe meaning of RAW is Ready And Willing\nTo do whatever is clever, take a loss never\nAnd the rhymes I bust, comin off is a must\nAnd I come off hard with rhymes that are odd\nI rip the microphone and leave it scarred\nNever smokin or hittin or takin a sniff\nOnly crushin emcees that be tryin to riff\nI get strong and titanic, do work like a mechanic\nMake emcees panic, they all get frantic\nAnd skeptic, like a girl on a contraceptive\nAs I rocked, but hey, what you expected?\nI'll get raw for ya, just like a warrior\nRather like a samurai, and I;ll be damn if I\nEver let a Fisher-Price emcee hang\nTheir rhymes are toy, nothing but ying yang\nSo if we battle on the microphone\nBring your own casket and tombstone\nAnd I'ma preach your funeral, tell me who in the world\nCould ever come with more, I get RAW!", "image": "https://images.genius.com/a3044a73939ccd541c13cf37d29d70bb.1000x1000x1.jpg", "year": null, "title": "Raw (Remix)", "album": "Long Live the Kane"}]}