{"songs": [{"year": null, "image": "https://images.genius.com/6478121f52fa3b0248edb20e7d06e076.300x300x1.jpg", "title": "Lemonade Delight", "album": "Damn Fool", "lyrics": "[Chorus: Krizz Kaliko and Crystal Watson]\nIt goes one bottle of vodka, two for the Country Time\nThree's Everclear, what you sippin'? Any kind\nAlright! Drunk out of your mind\nEverybody what you drinkin'? Lemonade delight\nWant something they can feel, that'll give a little thrill\nPut your cups up, get drunk with the fill\nTonight! Drunk out of your mind\nEverybody what you drinkin'? Lemonade delight\n\n[Verse 1: Big Scoob]\nMake a mixed of this elixir, get the party hot and heavy\nYou'll be ready, hot and sweaty, pussy gushy like the levy\n[?] your nights, got the party right\nAll we do is fuck or fight\nThis is fuel for the fire, guarantee to spark the light\nMe? I don't drink it, I just mix it for the bitches\nI'm a witness all this fruity shit, make 'em get explicit\nChanging, acting different, help 'em carry out their wishes\nThey say it's so delicious, when really this is vicious\nWicked on these bitches, they just love it, it's magnificent\nIf I spoke in righteous terms, I would say it's heaven-sent\nWhole party hella bent, Sodom and Gomorrah\nSexing every room, all positions on the floor up\nEverybody's tore up, ease up or throw up\nTake her car keys, then so what? Throw up\nParty till the morning till you start to see the sun\nThat's the way we party, it ain't over till it's done\n\n[Chorus: Krizz Kaliko and Crystal Watson]\nIt goes one bottle of vodka, two for the Country Time\nThree's Everclear, what you sippin'? Any kind\nAlright! Drunk out of your mind\nEverybody what you drinkin'? Lemonade delight\nWant something they can feel, that'll give a little thrill\nPut your cups up, get drunk with the fill\nTonight! Drunk out of your mind\nEverybody what you drinkin'? Lemonade delight\n\n[Verse 2: Big Scoob]\nI would drink it if I could, but I'm a beast off the white\nGet to sippin', get to trippin', then I'm far from the light\nTryna fight, hella hype and get to fuckin' up the night\nDestroying everything in site (so I hold off the white)\nLike ice it conniving, [?]\nInside of your vices, where I'm tryna go\nBartender with the mixer, tryna get you in the blender\nTwist you up, and mix you up, I'm [?] beginners\nSimilar to Caribou, careful how you drink it, boo\nSweet and hella tasty, but, Everclear is in it too\nWhen it gets the best of you, the things that you gonna do\nThings that you wanna do, but really didn't mean to do\nLemonade gets into you, freaky shit comes out of you\n'Member, ain't no blaming Scoob, I told you what this shit'd do\nLemonade delight made right, is the bidness\nKeep the party hype all night, I'm a witness\n\n[Chorus: Krizz Kaliko and Crystal Watson]\nIt goes one bottle of vodka, two for the Country Time\nThree's Everclear, what you sippin'? Any kind\nAlright! Drunk out of your mind\nEverybody what you drinkin'? Lemonade delight\nWant something they can feel, that'll give a little thrill\nPut your cups up, get drunk with the fill\nTonight! Drunk out of your mind\nEverybody what you drinkin'? Lemonade delight"}], "artist": "Big Scoob"}