{"songs": [{"year": "2014-07-01", "title": "The Rabbithole", "image": "https://images.genius.com/5ac985192ecf998a6a862a00118c5d82.977x1000x1.png", "lyrics": "[Verse]\nHow far does this rabbit hole go?\nAlice in a Blunderland, flammable soul\nAnimals roam and the catacomb slows\nSearching for capital, searching for hope\nChurning the sad into tangible goals\nThey’re burning their flags to adapt to the cold\nRation control, happiness sold\nEye-for-eye habits, a cannibal cult\nThey feed me cyanide tablets\nThey breathe low at the sight of my panic\nHeavy-hearted, mind if I stab it?\nDepths of my sanity, height of my madness\nI’m on prescriptions, Iodine tablets\nI don't trust the water, so why would I have it?\nJim Jones with the Kool-Aid, sip slow\nTwo faces, one slit throat\nAnimals pile in the ocean's of medicine\nAlcohol vials Coke and the Mescaline\nAntidote style, I smoke for adrenaline\nAnd I don't smile, it exposes my skeleton\nI got the soul of an elephant\nGrieving the lost on a road that’s so desolate\nEchoes are still resonant, the ghost of the Oedipus\nAnd Dear God letters that I wrote for the Hell of it\nYou see the tendencies\nFor them, it’s to tend and cease, but not me\nSee, I can attend and get ten degrees\nAttention-piqued, to ten ‘til the tenure’s reached, but not me\nIncrease intensity\nI’ll walk 'til the tendons cease, Achilles\nI can walk to attend Dead Seas, and drown myself in it\nNarcissus did it, give it any minute\nI'll admit that I am just an artist that's a part of this equation, huh?\nNah, I’m a part of this aphasia\nI fucked myself, I’m so auto-nymphomania\nI gotta make-up words, it’s getting harder to explain it but\nThe particles in my brain erupt\nThe pace is up, when I’m vulnerable and caught up in the mania\nI’m in the cut off that Indica, inner-cuts\nNever seem to cease and so I zip it shut\nI’m on a 50, a milli, a milli grams\nEnough so I’m not a killi, a killing them\nI feel a million, I'm the villain I'm\nAntagonistic, vicious obsidian\nBut so purple inspired\nCirclin' tired in a circus attire\nBumbling bumble bee, worker for hire\nBuild prisons to live in, and churches for liars\nPerfect environments to purchase desire\nSelling their souls for which version is higher\nParents used to listen to that Earth, Wind and Fire\nBut I like Cohen, bird on a wire\nMoral compass is like, \"Fuck it, I don’t need it\"\nIf it bleeds, then it can die, and if it dies then I can eat it\nThat includes my inner demons, platitudes and my secrets that I keep\nAtlas with the clavicle, so creep\nWith me as I crawl through the hood, maniac\nLunatic, or just unimpressed, yeah I've felt a hundred deaths\nFacing all the greatest odds, but I’m in the hunt again\nPacing ‘til it makes me lost, swell until I’m puffer fish\nRazor in an aching jaw, red all in my upper-lip\nTake it with a grain of salt, set it in the cut you left\nPainting on the caveman walls, sentences my lover said\nI'll chase you down the rabbit hole until I lose my breath", "album": "ULTRAVIOLET"}], "artist": "Sadistik"}