{"songs": [{"lyrics": "[Intro]\n\"In my lifetime\"\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\n[Verse 1: Jay-Z]\nIt's the thought of a ride that make my eyes wide, I'm caught up\nI'm tryna make all of my dreams materialize, so I sorta\nSay my goodbyes to the straight and narrow\nI found a new route, you 'bout to see my life change\nI make the means justify the ends\nI make the cream, materialize keys to a Benz\nAnd so I'm rollin'\nFor now, holdin' down the fort, who's controllin'?\nThe ground's gotta blow 'em, yep, y'all shoulda told 'em\nUhh, my first felony's approachin'\nCopped my first key, took a freeze, now I'm frozen\nI bought a black MAC, I'm outta control\nLosin' bankrolls on blackjack, you gotta know\nIt always crossed my mind\nThat Feds be tappin' the lines like Gregory Hines\nStill on the phone, discussin' my biz like it could never be mines\nI know the price, know the risk, know the wrongs and the rights\nStill my blood flows ice, it's just my life, uh\n\n[Chorus]\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\n\n[Verse 2: Jay-Z]\nI'm like the bass with the ass, splashin' cold cash\nThe Big Willie get you chilly when I pass, brrrrrr\nIs it, just a mirage all these girls thankin' God?\nIs this, world my world? Am I the star of stars?\nBaby, pimped out, I'm gettin' too large and smokin' cigars\nAll chicks is hollerin' about Jig-ga, the whole city's buzzin'\nWasn't checkin' for me a dozen or so, months ago\nNow I'm all they know, I'm a person (yeah)\nLettin' the Cristal's breathe at the Barnacle Bar\nUnder my sleeve, vernacular, 50 G's\nI'm talkin' big cheese, you gotta be down to dig these (uhh)\nUhh, give me a rush like you wouldn't believe\nMy head's about to bust, acceleratin' what drives me\nHope I don't gotta die to see, see, I can't lie to me\nI know the price, know the risk, know the wrongs and the rights\nStill my blood flows ice, it's just my life\n\n[Chorus]\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\n\n[Verse 3: Jay-Z]\nUhh, from the beginnin', see, we never seen the endin'\nRunnin' up in all the women, all the linen, all the jewels, huh\nWe sported Pele's, gold diamonds and Pirelli's\nSports cars, the good life'll give you a belly\nBut that's cool, as I zone in the Al Capone, watch me\n'Cause the Medusa's head on Versace turned me to stone\nNow my poems just ain't poems, they bloody when I recite 'em\nBones get disconnected like the phones\nNow, I'm a hardened criminal with game\nLike the Garden, all my penpals life controlled by the warden\nStill the thrill makes me blind to the fact\nI could do real time, I'm a prisoner of my crimes\nKnow the price, know the risk, know the wrongs and the rights\nNow I'm incarcerated for my life\n\n[Chorus]\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"\nWhat's the meaning, what's the meaning of life?\n\"In my lifetime\"", "title": "In My Lifetime (Remix)", "image": "https://images.genius.com/27d47c63a65d2f2dd93e8d05b73afab3.983x1000x1.jpg", "year": "1997-11-04", "album": "Streets is Watching Soundtrack"}], "artist": "JAY-Z"}