{"songs": [{"title": "The Voice of Power", "album": "The Lost Tribe of Shabazz", "year": null, "image": "https://images.genius.com/ccff32ca0eedb6ac1f785643772e94fa.400x399x1.jpg", "lyrics": "[Verse 1: Lakim Shabazz]\nI come across louder than a bull horn, a full-born\nHuman ghetto blaster that has to move on\nThe voice of choice to pound the sound that Mark made\nIf you sleep, huh, you catch a heartache\nTweeters scream, woofers blow when I flow\nBiters bite actin' like they didn't know\nRhymes I make take the cake, they have to be\nSweet like sugar, Strawberry D'Acquery\nI'll dilute your brain like Mohawk\nBrandy I'm dandy if you can't flow\nWalk off the set, go and get\nReinforcements or new concepts\nSee if you can match the man that has to stand\nMilitant and armed, ready to cold bomb\nGet in your stance, here's your chance\nNow you're gettin' a blast from Lak Shabazz\nThe voice of power, the voice of power\nI got the voice of power\n\n[Verse 2: Lakim Shabazz]\nSee, I been waitin' to catch you, now I got you\nI'ma mop you, make you walk the desert like Jacub\nGreatest [?] and slob\nAny negative thoughts? Yo, save it, hops\nFor the wack ones, I simply attack them\nDo what I wanna do with 'em and ransack them\nGather your fortress, I run through y'all\nYou're nothin' but a bunch of knuckleheads, screwballs\nThis were a contest for money you wouldn't win a nickel\nYour rhymes are too wack, you whimsical\nMy impact is that of a nuclear explosion\nI'm unloadin', comin' through to ya\nLoud and clear, proud to bear witness\nTo the fact that I'm packed with swiftness\nNow what you gotta say for yourself?\nYou might as well pray for help\nRappers like you, I eat 'em and plow rhymes\nWhen the dinner bell ring, it's chow time\nI rush the stage, grab the mic and rock a party for hours\nI got the voice of power\nI got the voice of power\nI got the voice of power\n\n[Verse 3: Lakim Shabazz]\nRhythms I ride with ease to please a crowd\nWith lyrics that totally tower\nWhen I was young I made a vow\nThat thou will always possess the voice of power\nI kick science you're bein' dropped on\nGimme the mic, look at how the props swarm\nAnd see the brother cold undertake\nGimme the cue, watch me stun the break\nI'm gettin' fed up, you're so wack, dag\nYou're like roaches and I'm the blackflag\nYou little insect, I put heads out\nRappers check in, but they don't check out\nYou waste time, you should learn to make\nDeffer rhymes so I don't have to exterminate\nI wasn't made to be ruled by no one\nAnd it ain't no fun if I don't get none\nThe voice of power longs for strong rhymes that penetrate\nListen as Lakim demonstrates\nVocals I flow styles, I like the track\nI sound crisp and some whisper, \"How's he do that?\"\n5'4\" and a connaisseur, so step slow\nWhile you intake a vision from a video\nI'm known to rock a party for hours\nI got the voice of power...\nI got the voice of power\n\n[Outro: Lakim Shabazz]\nAh yeah, Flavor Unit in effect\n1990, Lakim Shabazz, all that\nYou know what I'm sayin?\nPeace"}], "artist": "Lakim Shabazz"}