{"artist": "Canibus", "songs": [{"title": "Dreamzzzzz", "album": "For Whom the Beat Tolls", "year": null, "image": "https://images.genius.com/cd5c66f7b1bcf568cbc8f3532e097f26.500x500x1.jpg", "lyrics": "[Hook: 4X]\n+Dreamzzzzz+ of fuckin' a female news anchor\nI'm just playin', but I'm sayin'\n\n[Canibus]\nYea, this isn't excellence in journalism\nI prefer to call it conservative words of wisdom\nMixed with perverted visions\nI can't help it; I was bitten by the Celtic Woman\nWho spoke elvish, who told me I was selfish\nNah honey be friendly you're my Ms. Money Penny\nI love you because when they hate me; you defend me\n+Dreamzzzzz+ of fuckin' a female news anchor\nWelcome to my world of fantasies and fandom\n0330 central news network\nI filled out visitor's paperwork 'til my head hurt\nKey words bees and birds can't help but to be perverse\nAbout anything over 30 in a skirts\nI get up stairs to search who's doin' their leg work\nI seen her walk in to the coffee room, I go there first\nShe was beautiful in burgundy, Zane Verjee\nI said \"Allah have mercy\", she heard me and turned to me\nShe showed me her breast, I was impressed\nShe suggested I lock the door so we could both get undressed\nQuick start, quick finish, I gently kissed her\nThe phone rang; it was Wolf Blitzer sayin' \"He missed her\"\nI was not surprised, I ain't want the bitch to lose her job\nOH MY GOD! Is that Sumi Das?\nStill hard from Zane givin' me brain, but I can't complain\nI'll take wrinkles over stains anyday, anyway where did the Sumi go?\nShe reminds me of this ho I used to bang on a Pakistani Sushi boat\nHer trail went cold; I stole me an access card\nPicked up the trail in the parking garage\nI pretended I was an intern\nI said \"Ma'am you left this upstairs; a huge diamond earrings\"\nShe just stares, standin' there in a dress with a delicate smell of vinaigrette\nShe placed the palm firmly on my chest\n\"Are you St. Germaine?\" she said, I said \"Yes\"\nAnd I seek to have sex with the Dragon Princess\nShe circled her hips slow, dancin' to Calypso\nShe brought her lips close, my dick grows, she sniff Coke\nI couldn't believe the nerve of this\nCircus Witch with burger itch\nYou tried to curse me with a kiss\nNosferatu practitioner, I don't even think about kissin' her\nShe will remain my prisoner\n\n[Hook: 4X]\n\n[Canibus]\nYea, check the defense mechanism of this next woman\nShe's the real Lara Croft; I couldn't wait to have sex with her\nArwa Damon so calm under pressure\nBut our hormones start raging as soon as I undress her\nStarted to speak in discreet descriptive speech\nI tasted her nipples and told her \"Her tits taste like a peach\"\nShe had congressional oversight, over the mic\nA young Black man obsessed with her egg shell white\nHer body was tight, \"Ok\" I said but not tonight\nYour life is your job; my job is my life\nFilled with gold spindles, a positive polarity signals\nBut when I talk to strippers I'm simple\nLike screwin' Julie with the booty dimples\nShe act moody cause she's mental\nTry to imagine what she's been through\nJulie Banderas got what I call a rare ass\nThat's the type of ass that could tear pants\nI let her dance on my Fer-de-lance, Caliente Sangre\nAnd life goes on like John Mellencamp\n\n[Hook: 4X]\n\n[Canibus]\nYea, yo, I don't wake up 'til 12:00\nSoledad O'Brien don't wake up 'til she feels cock\nI love these women so much, I can't stop\nSir Lancelot givin' Guinevere a shamrock\nAccompanied by a rose, she smelled it with her nose and froze\nIt was the perfect time to take off her clothes\nThe tale of the Princess and the P and MC\nMr. C; really? A magnificent read\nIn a dream I had about my favourite anchor of them all\nIn my dream I wrote a name across The White House wall\nSuzanne Malveaux - oh I have love you so\nSo much so I let the whole world know\nHer pastry is so tasty; I don't care if her husband hates me\nI'm still in my dream, DO NOT WAKE ME!\nIn the dream she and I share pound cake and tea\nIn between her shifts on the silver screen\nShe lays her head on my arm during The White House conference, at dawn\nImagine that when you listen to my song\n\n[Hook: 4X]"}]}