{"artist": "King T", "songs": [{"image": "https://images.genius.com/29aa192b53a73f6e6499d36c4a49b0e4.600x600x1.jpg", "title": "Played Like a Piano", "year": "1990-01-01", "album": "At Your Own Risk", "lyrics": "[Intro: King Tee]\nKing Tee's drunk again\nYo, check this out! Awww shit, aw shit\nI wanna dedicate this song\nTo all them motherfuckers out there\nThat-that-that-that-that-that-that (not again)\nPerpentratin'… perpetratin'… perpintratin'… wait, rewind\n(But yo, King Tee, man, what is this? What is this?)\n\n[Verse 1: King Tee]\nSome cool shit for the King's anthology\nAnd when I'm done, don't expect no apology\nStupid motherfucker shoulda stepped when I warned him\nI'm from the Boondocks of Compton, California\nI'm just anxious to whoop some ass\nI went to high school, but I flunked every class\nSo what makes you think I give a fuck about respect?\nI'll put your bitch in check, and I'll bet\nYou won't run up, son of a punk and a bitch, too\nI shoulda did a drive-by on you and your crew\n'Cause y'all be poppin' some shit that's unheard of\nFor you, what's the word? Uh… (wack!) — it's murder\nSon, when I be crushin' your hood with a passion\nAnd I ain't talkin' that Action Jackson\nWhen I come, you better run for ammo\nOr get played like a fuckin' piano\n\n[Interlude: King Tee]\nAnd yo, we got my homeboy Ice Cube in the house\nFrom the motherfuckin' Lench Mob ('Sup, nigga?)\nAnd yo, Ice Cube, I heard you're a singer now\nMan, what's up? Yo, yo\n\n[Verse 2: Ice Cube]\nDo-Rae-Me, but I don't sing, mothafucker\nI kick shit with the King, mothafucker\nIce Cube will clock the cash, rock the mass\nAnd if you run up, I'll sock your ass\nAnd watch that eye get swollen\n'Cause I'm playin' punk niggas like Beethoven\nSo bust a cap, or swing and die\nFuck Yul Brynner, it's still The King and I\n'Cause where I'm from, the sun don't shine\nSo One-Time hope I only bust one rhyme\nBut I bust one mo' for the suckers\nLast year I was ruthless, now I'm lynchin' mothafuckers\nAnd you'll see in a tree, MC's and crews\nNow they're lookin' for me, King Tee, and Pooh\nNow every nigga that crossed me's soprano\n'Cause I played their ass like a fuckin' piano\n\n[Interlude: King Tee]\nYo, check this out\nWe got my homeboy Breeze in the motherfuckin' house\nFrom the L.A. Posse, and he got some shit to holler\nCome on, man, bust this shit!\n\n[Verse 3: MC Breeze]\nWell, I'ma take the mic like it was a jack move\nRun with the beat as long as the track moves\nHot as lava, organized like a seminar\nServe you, your crew, him, and them and a\nCouple of rap-saps who think they can get butt\nYou slipped and shit, so nitwit, just get the nuts\nStealin' your high hopes, watchin' you write notes\nBetter walk a chalk line, not fuckin' a tightrope\nRap slicker, thicker, quicker than others, then I stop swift\nShift from 1st to 5th, while you stop to shoplift\nTake the mic stand whenever the duty calls\nIf I bust a nut for every rhyme I had, I'd get blue balls\nSerious as drama, I'ma watch her say \"Me too.\"\nYou're shorter than Michu, your rhymes are see-through\nYou're nothin' like GQ, transparent, I made it apparent\nI'm here to wax and tax the incoherent\n'Cause B-R-E-E-Z-E will eas-i-ly\nRe-main to be-e a top MC\nWhen you see me, I wear a beanie, and not a Kangol\nNow you got played, like a fuckin' piano\n\n[Verse 4: King Tee]\nThis is just a sample of three black nig-roes\nWho grew up in the heart of the ghetto\nDoin' what we had to just to make ends meet\nSome steal for a livin', some stand on the street\nJust slang; some gang-bang, but big deal\nThey say in Compton, you gotta kill or get killed\nMothafuckin' police pull you over, slam you down\nThen tell you that your hood is their town\nAnd I ain't goin' for no shit like that\nCuff me up, take me to jail, I'll come back\nTalkin' much shit, 'cause I talk what the fuck I feel\nA few weeks in the county ain't no big deal\nSo a punk like you can't fuck with me\nThat big ballin'-ass nigga named King Tee\nYou think you can? I don't think that you can, though\nPeace to Ice Cube and Breeze and the fuckin' piano"}]}