{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/57fc91d7548f4e591a971ea7f5443a88.355x355x1.jpg", "title": "Get It In", "year": null, "album": null, "lyrics": "[Verse 1: Kid Cudi]\nHot damn, I am the man, I don't even need a scheme\nI don't need a planI just say \"Hi\" then grab her hand\nTold her I'm a dog with a birch to relax him\nSay she want to window shop, I just laugh\nGirl thought I was trickin', baby that's just sad\nI pop so many tags, like I give grab bags\nSo when they see me, bitches do the mad dash\nHe will motion approaching up in the slab\nDrink and smoking when they come to the pad\nShe just looking at me cuz she know I wanna smash\nEyes on my pockets now she checking out for my stash\nNow this is the part where personalities clash\nI subtract her then a nigga must add\nI just need another to be ahead of the class\nCudi McLovin bitch I'm Superbad\n\n[Hook: ?]\nWhen they street or see me in the club (in the club)\nAll the girls always wanna show me love\nWatch a playa get it in\nWatch a playa get it in\nWatch a playa get it in\nWatch a playa get it in\nYou don't got to know my name to know ?\nBut You know I'm gonna do my thing\nWatch a playa get it in\nWatch a playa get it in\nWatch a playa get it in\nWatch a playa get it in\n\n[Verse 2: Kid Cudi]\nJust young nigga on my motherfuckin' grizzle\nOther cats simple but your boy Cudi sizzle\nGot your main line when I'm all up in the middle\nAll because of my songs, all because of riddles\nThat is amusing to me cuz I'm the niggy\nAll these women they all so pretty\nWhich one I need? Which one I want?\nThe one that like drinkin' and good rolling blunts\nI had one chick she called herself Tila\nShe was so hood kept a chrome nina\nWhen I first met her we was over on mulas\nSaid she was interested on getting on some new cock\nShe was so cool jumped right in my coupa\nAll of this ? Tila threw my a loopa\nGave me neck while I gripped up on the wheel\nEyes looking at me like :\"Cudi how it feel?\"\nI'm probably the coolest motherfucker ever rappin'\nNext to Snoop Dogg and Devin the Dude\nWhen I touchdown I won't clown and do the Deion\nI'mma keep winning because the rest of them are peons\nPlus I'm a fool for gold, so I'm shinin'\nFerris in a bimmer, sittin' back reclinin'\nBack in the day bitches told me \"Dream on!\"\nNow at the shows in the front screaming \"Lean on!\"\nAin't that something? (Haha haha)\nAin't that something?\n\n[Hook: ?]\nWhen they street or see me in the club (in the club)\nAll the girls always wanna show me love\nWatch a playa get it in\nWatch a playa get it in\nWatch a playa get it in\nWatch a playa get it in\nYou don't got to know my name to know ?\nBut You know I'm gonna do my thing\nWatch a playa get it in\nWatch a playa get it in\nWatch a playa get it in\nWatch a playa get it in\n\n[Outro: Kid Cudi]\nIf you zooted and booted\nGirl just do it, do do do it\nGirl just do it,do do do it\nGirl just do it, do do do it (One more time!)\nIf you zooted and booted\nGirl just do it, do do do it\nGirl just do it,do do do it\nAll them boys get all them girls\nAll them girls need to rock their world\nOWWW\nAll the kids do something (Yeah)\nAll the kids do something (Yeah)\nAll them boys get all them girls\nAll them girls need to rock their world\nOWWW\nAll the kids do something (Yeah)\nAll the kids do something (Yeah)\n\nHaha\nUhh\nUhh\nKid Cudi mane\nAnd it's like that\nThat's what you keep doin'\nOver and over\nOh mane"}]}