{"songs": [{"year": "2019-07-07", "album": "I.C.a.B.S.", "image": "https://images.genius.com/223cb1288fedb4f41d9c1f909207de02.1000x1000x1.jpg", "title": "Growth", "lyrics": "[Verse 1]\nJust thought I'd call to say what's up, I'm just checking in\nAnd even though you ain't my blood, you like my closest kin\nBefore the money and accolades, you was my only friend\nForever grateful, you were the only one that I would ever depend on\nI know I lose track of time, I know I ain't hit you back\nI know you think I changed but I'm the same, that's in full effect\nA phone full of missed texts, I ain't mean no disrespect\nSo before you tell me 'bout myself man just let me interject\nIt's like no one can recall when I was broke and starving\nBack when I would pray for better days and bright tomorrows\nI ain't no fool, I know this time we living on is borrowed\nI had to be real with myself, reality can be the toughest pill to swallow uh\n\nHello, we are not available now. Please leave your name and phone number after the beep. We will return your call. *BEEP*\n\n[Chorus]\nI just been working on myself, yeah\nI just been working on myself, yeah\nI ain't mean to miss your call, I ain't mean to do no harm\nI'm just focused on myself, damn\nI been too proud to ask for help, declining mental health\nI'm in the process of tryna learn to love my fucking self\nIf I can't do for me, then I can't do for no one else\nI ain't tryna drink or smoke nigga, that's gon' make this shit worse\nI just keep working on myself, damn\nI just been working on myself, damn\nI know I missed your text, I lost track of time, damn\nBut for the sake of my sanity, I'll keep working on myself\nI'm just working on myself\n\n[Verse 2]\nI feel like I'm at my wits end, wonderin' when this happiness gon' kick in\nAll I do is work, you can't tell my life ain't no different\nDealing with frustrations, it's daily, derails my vision\nThis is something I can't explain, you gotta see it for yourself\nThis shit is sick, this is everything that I hoped it wasn't\nBack when niggas had dreams and aspirations of becoming something\nI coulda never imagined I would see all of the shit I seen\nBlind to all the warning signs and red flags in front of me\nThere's no relief, on a search for peace, follow my path faithfully\nI can't believe we at a dead end, how can it be?\nTrials and tribulations, not meeting expectations\nLooking inside and realizing you broken and vacant\n\nHello, we are not available now. Please leave your name and phone number after the beep. We will return your call. *BEEP*\n\n[Chorus]\nI just been working on myself, yeah\nI just been working on myself, yeah\nI ain't mean to miss your call, I ain't mean to do no harm\nI'm just focused on myself, damn\nI been too proud to ask for help, declining mental health\nI'm in the process of tryna learn to love my fucking self\nIf I can't do for me, then I can't do for no one else\nI ain't tryna drink or smoke nigga, that's gon' make this shit worse\nI just keep working on myself, damn\nI just been working on myself, damn\nI know I missed your text, I lost track of time, damn\nBut for the sake of my sanity, I'll keep working on myself\nI'm just working on myself\n\n[Outro]\nHello, we are not available now. Please leave your name and phone number after the beep. We will return your call. *BEEP*"}], "artist": "K.A.A.N."}