{"artist": "G Herbo", "songs": [{"title": "Eastside Stories", "album": null, "year": "2019-03-07", "image": "https://images.genius.com/910ed08cc34641e27befd74b7e35304f.480x480x1.jpg", "lyrics": "[Intro]\nYeah\nKid!\nWe don't even say it\nWe don't even say \"R.I.P\" nigga\nWe just say \"Long Live\", all my niggas gone, ya know\nNiggas that we lost to this shit\nNiggas really out here\nIn the streets\nYou know, for real, living this shit that I'm rappin' 'bout, you know, I'm just\nLike, I'm\n\n[Verse]\n'Member what it used to be like\nI was seventeen\n'Member what it used to be like\nI was off the lean\n'Member what it used to be like\nAll I had a dream\n'Member what it used to be like\nWe ain't have a thing\nBut I turned it to some shit that they all wanna be like\nAin't gon' never get like this cause you don't wanna be right\nI make all the sacrifices so you live a better life\nSomebody told me leave your legacy while you're still alive\nSomebody told me leave your legacy while you're still alive\nI wonder what it be like if G-Fazo was still alive\n'Member when Kobe died I drank that shit right out the bottle\nWe went to war for Rock, wonder if he was here, would he have had a body?\nWe gon' fall out this rap shit, wonder wonder what Slim would've felt about it\nTurned all the way up in this rap shit, but I wish Cap was right here beside me\nNow a moment of silence\nWhere we grew up all we knew was violence\n2012, we was strapped, used to play with them bitches like violins\nWe ain't even get to make it back safe if we hearin' the sirens\nWe gon' get put with the opps on the air, phones wildin'\nMatter fact, fuck that, if you want smoke we can dial in\nJust hit a lick, we gon' pull a [?]\nWe ain't broke no more, how do you end up on an island?\nTrash lil' niggas get rich though\nKeep it on my hip with his headphone\nHe be shooting dice with his hand full\nTen four stack with a hand fold\nFuck a nigga bitch like a nympho\nBeen in the streets whats the Info?\nDrako make him duck like limbo\nLeaving him stretched out, no limo\nGet money, stay 100, my M-O\nKnow I'ma stay 150, 50 on a chain, 150\nYou know this gang-gang 150\nFoe nem tote big as 50's\nThey don't want no lil ass glizzy\nBetter at least put .30 in it\nI ain't gon lie, this shit serious\nThese lil niggas here 'bout they buisness\nThey in this shit tryna finish\nI got real niggas doing sentences, they in that bitch tryna finish\nI'ma help put on for my hood and my city while smoking OG in Givenchy\nI was smelling like pot store in school, I was seventeen they gave a nigga detention\nWent to school, had to dip wit' from glick with the 17, niggas be greetin' with tension\nAnd big bro was ready to park by the school till I left, just in case he was itchin\nFree [?], niggas is snitches\nLong live Playboy, niggas bitches\nFree T-Slick, I miss him\nFree Lil [?], he innocent\nNo Limit Gang, finna get the pendant did\nAnd still doin' this shit independant, you dig?\nAnd I'm iced out, these pointers big\nThem bitches only gon' get bigger, you dig?\nA nigga only gon' get richer, you dig?\nMy fans ain't gotta pay for a picture, you dig?\nJust support a nigga, you dig?\nY'all know I on a mission, kid\nGotta move on, I'll be on my way, I'ma miss you kid\nI gotta keep gettin' money, if you get in my way I hope you kissed your kid (Goodbye)"}]}