{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro:]\nOn today's episode of beats that weren't produced for me\nMarvin Gaye & Chardonnay, Strange Music\nYou know I've never really seen Miami from this angle, but uh\nI gotta be honest with you, haha, I kinda like it\nI'mma borrow a few styles on this one if you don't mind, let's go!\n\n[Verse 1: Wrekonize]\nKill 'em with a little bit of kindness, mine yes\nMiller in the middle of a minus, mine is\nDivvy a retail, you give me my three sales\nPut kitties in the video behind us, minors\nKillin' every last city we run through\nYa late to get the message I'mma figure ya gum's chewed\nYa hatin' on the presence but the method is dumb cool\nYa done fool, I'mma let you wait for the 1-2\nSalute to the general Tech N9ne!\nMovin' subliminal but they let us get by\nTryin' to sign you'll never catch Wrek's rhyme\nEvery battle is mine, I smile and tell ya \"Next time!\",\nJust another early warning\nFrom another alien in the dirty sormon\nGive me just a mallion and I'm good for touring\nHungover like I'm fucked but I'm up good morning\n\n[Hook:]\nEarly in the morning, when she's all alone\nI'mma sneak into her room put new shit on her phone\nI'mma have her hooked on that Strange Music and ¡MAYDAY!\nAaay-aaay!\nEarly in the morning, when she's all alone\nI'mma sneak into her room put new shit on her phone\nI'mma have her fiendin' for that Strange Music and ¡MAYDAY!\nAaay-aaay!\n\nAlright I'mma pull my dick out on this one\nSo you prolly wanna step back...\n\n[Verse 2: Wrekonize]\nSippin' on the KC Tea like Aquafina\nChillin' in Miami where the broads are meaner\nStock is cheaper, blocks are greener\nThen again I prolly shouldn't drop this ether\nWhy the walls all shaded Easter?\nMushrooms got me lookin' at some crazy features\nNow I'm in here feelin' like Satan's teacher\nNah I'm kidding I'm a atheist preacher!\nGet it poppin' while I'm all up in the Denver scene\nNext to me up in the Texas dream\nWorld's outta shape and we bent the beams, shit\nPregnant teens are takin' Mescaline\nI'm that menace with the roaring drum\nKillin' time waitin' for the next tour to run\nI'm the new code killer, filling whores for fun\nSo you motherfuckers know that when the morning comes\n\n[Hook 2x]", "title": "!Mayday! & Chardonnay", "year": "2013-01-31", "album": "The Rooftops Mixtape", "image": "https://images.genius.com/88e068903a4f33a883dd03382fcde905.700x700x1.jpg"}]}