{"artist": "Asher Roth", "songs": [{"title": "Cheat On Your Boyfriend", "image": "https://images.genius.com/d2428ce0d129ae1116dae83c31fd96ce.800x450x1.jpg", "album": null, "lyrics": "Yeah, uh. Ha ha. Yeah, uh, uh, uh, uh, uh\nWhen the song comes on, cheat on your boyfriend. Say what?\nCheat on your man\nGet off the wall and cheat on your boyfriend. Whatever\nCheat on your man\nWhen you hear this beat, just cheat on your boyfriend. Do what?\nCheat on your man\nGet on your feet and cheat on your boyfriend. Whatever\nCheat on your man\n\nI'm in the club with a purpose\nThe first girl that moves is getting hurt, getting worked, getting served\nGet it, get it girl. Go ahead with your bad self (you bad)\nCuz if anybody dance, Ash will\nOn the floor, all joke no business\nI'ma make you work, no slow all fitness\nSeek her out in the crowd, separate you\nShow me now how the ass operates\nI'ma rock this way, possibly, do the thunderclap and rockaway\nBut maybe not today, let me take the percalate, work your hips in the circle shape\nThat's good, right there like that\nHold that I'll be right back\nNext chick that acted all affectionate, hitting bout sex and I hope she ain't affected\n\nWhen the song comes on, cheat on your boyfriend. Say what? Cheat on your man. Get off the wall and cheat on your boyfriend. Whatever. Cheat on your man. When you hear this beat, just cheat on your boyfriend. Do what? Cheat on your man. Get on your feet and cheat on your boyfriend. Whatever. Cheat on your man\n\nYes. You heard what I said. Any idea how dirty I get? Ummm. Like booty like breasts (yup yup) bet your man couldn't do it like this. (Like this). Little peck, kiss on the lips. Or instead we can play just the tip. (Just the tip). Better yet, we can be more direct. All due respect, I just want to have sex. Sex sex, go ahead and undress. What he don't know won't make him upset. And I can see your cheetah thong, does that mean he's been cheated on?\n\nWhen the song comes on, cheat on your boyfriend. Say what? Cheat on your man. Get off the wall and cheat on your boyfriend. Whatever. Cheat on your man. When you hear this beat, just cheat on your boyfriend. Do what? Cheat on your man. Get on your feet and cheat on your boyfriend. Whatever. Cheat on your man\n\nCheat on your boyfriend with me! Cheat on your boyfriend with me!\n\nI know I look good, but it ain't that easy. I want nice things, but I ain't that sleazy. (Hell no). You talk like you want to please me, real slick like, real greasy. I know I be the one you choose, but I got a man I ain't trying to lose. (Hell no). Let it just do the do, I ain't trying to leave the club in the back of your\n\nWhen the song comes on, cheat on your boyfriend. Say what? Cheat on your man. Get off the wall and cheat on your boyfriend. Whatever. Cheat on your man. When you hear this beat, just cheat on your boyfriend. Do what? Cheat on your man. Get on your feet and cheat on your boyfriend. Whatever. Cheat on your man\n\nCheat on your boyfriend with me! Cheat on your boyfriend with me!", "year": null}]}