{"songs": [{"year": null, "title": "Illuminati (Remix)", "image": "https://images.genius.com/bfaec1a0bac7ea0de2beca8ef167e036.500x500x1.jpg", "lyrics": "Sarkodie\n(Verse 1):\n\nArhh, yeah, ahah, arhh\n\nYo, tia First na monka masem, fisa na meni bi\nEnna cash aba nti mob fra me illuminati\nSorry, moany lucky on my way to grammy\nMako join group wae anka men push bugatti\nMe i think its funny, cuz i keep on making money\nTwadiampon no blessing reflect tisa tsunami\nDJ Mensah, Kess ne Giovanni\nNyankopon se ama men shaky walking through the valley\nYou believe in Juju i believe in power\nKristofo a mo doubt Nyame, mo gyedia muaha sa asaawa\nNyame twan me heaven, i dont have to give up\nMoa mosei me din no, monni vim, you better speak up\nMe swag, me chemistry, me flow, ya legendry\nAmfa soho ancompare Sarkodie cuz i’m da best you’ve ever seen\nMe style especially me hustle, me courtesy\nMa bri me mogya anim a hustle afea dieaa mose meya\nIlluminati!\n\n(Chorus) (x2)\n\nAfea dieaa omo se sarkodie oya illuminati\nObidiponbidi\n\n(Verse 2):\n\nHwa pause beat no second\nI think its controversial\nBaileys fo contacti me, omo pa commercial\nHalf a milli, for me, never\nAfei dieaa oma double up, next time, better\nThe Lord is still my shepherd, aponkye biara nni\nCrossing\nMo feel sa ma speed up, still mehu no sa trotting\nSammy Forson, you better do the talking\nMa moo nti asea cash ahe a me spendi just on shopping\nMeya mason koraa aka menya free, i swear walaahi\nMeya illuminati anka mentu nkotina Hawaii\nNyankopon ni makokyam, me mefra no daddy\nNti daa me praisi Yesu still aa mose meya illuminati!\n\n(Chorus) (x2)\n\nAfea diea omo se Sarkodie oya illuminati\n\nK9\n(Verse 3):\n\nOkay now 1st of all I had to put my verse on this beat\nI know that time is money but you gotta wait/weight like Fg\nSalute the real gawd, ain't talkin Pistol, Sabza, Thai-Chi\nA grade 10 falling from the sky, I dropped a 16\nShit! If you hating, hala back\nI juss sold a heart attack\nGot numbers like starter pack\nImpossible, I can't be whack\nI do it big but I ain't fat\nMoneoa's P, I'm gona tap\nEx be wanting S-E-X\nK9 on this fucken track\nYo Sarkodie, move aside\nAnd Lemme kill you on this beat\nI'm killing niggas who are 27, I'm juss 17\nI'm spittin sick, you would think Eminem wrote this shit for me\nYou hatin' niggas at the bottom like AKA's new gold teeth\nThe name is K9 if you asking who's this -\nNew kid on the block like Tetris\nI put Vaal rappers in a casket\nThese niggas gon try and bite my style, they'll need a dentist\nK-Bosso ntwana, rappers know it's lunchtime\nI got another brain, you can say I changed my mind\nMotherfuck yo 4 cousins, they like to wine\nFuck you niggas talkin, you my sons, it's bedtime!\n\n(Verse 4)\n\nTea, afea moti me ni aa na moti pai mo\nNti meya bonsam, sa modi nkra no\nAkoma moadanfo fo\nAba no saa no, sa mo dea adwen fen nti Nyame nhyira\nMo\nAnya mo na mo hwa me nti montumi nkyere me foko\nMofeeli me style, me flow ne me shoto\nMopa sa mo claimi anso mona moni kobo\nMoni no be problem, ano eni me moto\nAnya mona me nia medi nti woka meho asam aa\nMenka no by force\nOmo si Obidi ya illuminati, gya rough\nYa di Nyame so ne titi me\nNti na me ba stage aa, me se oh my God\nMa me nkyere mosa Nyame na waya efisa mogyedi\nTisa Nylon\nWoba wu ansa na wanya din pa\nAsamoah Gyan na oya aginkwa\nNfumso baako na biribia asesa\nWobe hwe na wodin apepa\nAdan na mose meya Demon\nObidi my legacy go live on\nRap no ahye ma ti sa weavon\nMeya stubborn but manfra me illuminati!\n\n(Chorus)\n\nAfea dieaa omo se sarkodie oya illuminati", "album": null}], "artist": "Sarkodie"}