{"songs": [{"image": "https://images.genius.com/f7d42d0db13086f046e08faacf066ef0.500x500x1.jpg", "year": null, "lyrics": "[Intro - Akrobatik - talking]\nHAAAA ...\nBack on the front steps, you know what I'm sayin?\nCity done took away the jobs from all the youngins\nCats got nothin to do and shit\nShit is whack man\nThe summer days be hot (yeah)\nShit\n\n[Verse 1 - Akrobatik]\nYo, to my niggas on the block, hangin out on the stoop\nWith your team you slang with and your little rap groups (uh)\nNotorious throughout the low income neighborhoods\nAccused as the reason why the hood'll always stay the hood\nOrganized to set up the trap, to set up the raps\nBut what if you organized your people dog, imagine that\nYou could be a young entrepreneur, never wantin for more\nWhen po' come through, you not duckin to the corner store\nThey make us hate each other, by keepin us poor\nBut if you got your shit legit, tell 'em \"fuck you!\"\nThey shit outta luck too\nLong as you pay your federal and state\nThey gotta keep their filthy hands off your general estate\nTake it from a brother that been there, we in here\nPeople livin in the hood, in prison, and in fear\nSame thing they did to the Jews after the Holocaust (what?)\nStuff us in the ghettos and then we all are lost\nAnd when we riot, they won't care about the dollars lost (uh)\nThey sippin cocktails, while we throw the Molotovs\n\n[Break - Cuts by DJ Jayceooh]\n\"Kick the truth to the young black, black, black\"\n\"Kick the truth to the young black youth, youth, black youth\"\n\n[Akrobatik - talking behind Break]\nWhat, yo tough love\nYo, listen\n\n[Verse 2 - Akrobatik]\nMy high school had no black teachers (true)\nAnd very few students, who had similar features\nThat's where I caught my very first glimpse of how they do us (yep)\nThe privileged are learnin how to be entrepreneurs\nWhile we die in the sewers\nAnd the gutters, murkin each other with box-cutters\nFrom one man's sin, the whole block suffers\nStreets are floodin with the tears of distraught mothers\nWe have been trained to believe we are not brothers\nYou wouldn't say shit to Ted Danson\nBut if a brother's black, we act like Charles Manson (Manson)\nWhat the fuck happened to advancin? (uh)\nSee, heads is too concerned with romancin the stone\nCook it up and serve it, then your hood rep's blown\nBut when po' enter the zone and handcuffs are shown\nAnd your shorty's left alone at home with no pops\nAnd mama you was tappin ain't givin you no props (props)\nThat bus is takin you up north with no stops\nAnd you getting hosed down and laughed at by cops (uh)\nYou sayin that's the way you want to live, dude? (word?)\nNever getting pussy and you eat what they give you\nThis ain't no war on drugs, it's a war on thugs\nThey supply the guns, we supply the bodies with slugs (slugs)\nMost of these crack-dealer rappers is herbs\nSee they 35, married, and they livin in the 'burbs (true indeed)\nMakin money off of your lifestyle\nBut you idolize 'em cause they move units and that's wild (wild)\nThese labels ain't fuckin with you if you ain't coachable\nThese labels ain't fuckin with you if you ain't approachable\nYou see, there's more to life than rap and crack sales (sales)\nBut that info ain't made readily available to black males\nThey shut down the conscious rastas\nBut talk about being a pimp, you'll get an Oscar\nI'm sick of seeing y'all locked up and killed\nAnd if the O.G.'s don't tell you, tell me who the fuck will?\n\nTough love, tough love, tough love, tough love, tough love\n\nYeah, kick the truth to the young black youth, what?\n\n[Outro - Cuts by DJ Jayceooh]\n\"Kick, kick, kick, kick, kick the truth, truth\"\n\"Kick the truth to the young black youth, youth\"\n\"Kick, kick, kick the truth, truth, truth\"\n\"To the, to the young black youth, youth\"\n\"To the youth, to the young black youth\"\n\"To the young, young black youth\"\n\"To the young black, black, black, black, black, black, black, black, black, black, black, black youth\"\n\"Black youth, black youth, black youth ...\"", "title": "Front Steps Pt II (Tough Love)", "album": "Absolute Value"}], "artist": "Akrobatik"}