{"songs": [{"title": "Murder Runs The Globe", "lyrics": "[Intro]\n(Murder, murder 8x)\n\n[Verse 1]\nEvery shot that thunders\nThrough the nighttime don't you wonder\nWhat potential was extinguished\nTo keep the flames burning under?\nThrough the underworld and over world\nPrinciples are so the same\nThough we pretend they're not as if they do not control cocaine\nBut you'll find it's connected\nEvery kid in the hood that's living with a death wish\nIs the same as the King who kills for the bling\nBut he is just much more reckless\nIt's the King that I'm talking about\nThough he is born with a silver spoon in his mouth\nHe still gonna clap for the slightest of chat\nAt any world leader that can't back it\nIf he is sitting on the boxes\nThey are just oil or mineral deposits\nFood he is moving fucking with our profit\nSo he better stop it\nThey say money makes the world go round, but it don't\nThat is just not true\nIf you ain't got guns to protect that money\nI'lI regret that, Sonny, it is more fool you\nOnly murder further agendas that money couldn't force\nEliminate the foes who propose\nTo suppose a different course, of course\nA little torture is usually a big supporter\nThough there's nothing quite like killing\nGood riddance to non supporters\nWe demonize the man on the corner\nPaint him as a thug\nWe worship murder so much\nIt's just that he ain't killed enough\nYou wanna commit murder\nBut not end up in cuffs?\nYou gotta make it to the Premier League\nA thousand murders plus\n\n[Hook]\nWho said money makes the world go 'round?\nThey just didn't know\nMurder runs the globe\nM-m-murder runs the globe\n\n[Verse 2]\nEvery knife that puncture lungs of sons\nDon't make you wonder Mums?\nIf he was born to billionaires backed by a hundred guns\nWould he be living still, drinking, sleeping, eating meals?\nInstead of dead where it don't count\nWe expect you to be killed\nBecause living as a pauper is a fate that is tainted\nAcquainted with torture\nWe ain't debating the rape of the daughter\nIf she was raised in particular borders\nPlace that fate made particular slaughters\nNo fate just particular orders\nIt's the way of the world no accident\nIn fact it's immaculate\nYou got a big gun start clapping it\nCause the language of power devour quick\nAny silly biddy little pacifist or activist or challenges\nBrown or black skin savages\nWho inhabiting land with minerals in it\nWho think for a minute that the rhetoric we spoke\nHope? Was not meant to be a joke\nDon't dream compassion will happen it won't\nJust go straight for the throat\nBecause any nation or races\nThat prove themselves incapable\nOf matching modern murder machines\nMake themselves enslavable\nIt is murder not money we desire insatiable\nThe thrilling of the killing it's million dollars sensational, YES!\nWhat you can't do with a bribe\nCan be achieved in a breeze with a gun and a knife\nBecause only murder further agendas that money couldn't grind\nNothing like a couple dead kids to change a parents' mind\n\n[Hook]\nWho said money makes the world go 'round?\nThey just didn't know\nMurder runs the globe\nM-m-murder runs the globe\n\n[Verse 3]\nLet's get a little clarity\nYou ain't got the capacity to internationally\nHave a say in the ways things happening\nYou expect to collect more battering\nYour arsenal it ain't got no nukes\nArmies equipped with too few troops\nWe're laughing at you when you call truce\nIt's part of the ritual to shoot-shoot-shoot\nYou got no background in colonization\nOr public resource privatization\nYou can't bang with the big boys, face it\nBut you still wanna play like Satan\nYou got no death squads to call your own\nOr a pilot to fly your drones\nMuch less bulldozers for their homes\nTalk gangster and you want to name Al Capone?\nHe was an amateur, silly little boys don't understand\nEven he went jail for tax evasion\nFor missing a payment in the payment plan\nTo the man, one with invisible hand\nAnd a hidden fist to enforce my plan\nI am just because I can more wicked than the Summer of Sam\nKick your shit and I kick mine fam\nYou bust your gun and I bomb your land\nOnly murder further agendas that money can't control\nNothing like a massacred village to get the problem solved!\n\n[Hook]\nWho said money makes the world go 'round?\nThey just didn't know\nMurder runs the globe\nM-m-murder runs the globe", "year": "2015-02-06", "album": "Knowledge Is Power II", "image": "https://images.genius.com/7c518a58eebfd479e5ad2216b0cd1a85.1000x1000x1.jpg"}], "artist": "Akala"}