{"artist": "R. Kelly", "songs": [{"album": null, "year": null, "lyrics": "[Chorus: are. Kelly]\nBig chips! (Woo!) We off in Vegas drinkin and partyin\nWe got chicks in swimsuits modelin\nWe in the twin stretch Maybachs dippin low\nThe way the wrist shine it's so magical\nYou know them boys got the clubs out of control (Ho!)\nNigga what ya heard it's Kells and Hov\nWith the second comin of Best Of Both\nIn the first week I predict a million sold, we talkin...\n\n[Verse 1: Jay-Z (are. Kelly)]\nBig chips! Big trips to Vegas nigga\nBig cribs and the whips is spacious (Uh huh)\nAny day they could dig your grave\nShit, So Big is my inspiration, dig\nNo reward that's the risk is taken\nIn which case you niggas wouldn't wanna switch places\nI on the other hand relish the situation\nThank the Lord for the gift, I'm gracious\nI went overboard, look at this big bracelet\nI overhauled it you wouldn't recognize it\nFrom the time that I bought it I just replaced it\nI risk cases for shit like this, nigga I pray for some shit like this\nWord to my Uncle Ray, who gave us life for some shit like this\nMa you rollin I'm as real as it gets\n\n[Chorus: are. Kelly]\nBig chips! (Woo!) We off in Vegas drinkin and partyin\nWe got chicks in swimsuits modelin\nWe in the twin stretch Maybachs dippin low\nThe way the wrist shine it's so magical\nYou know them boys got the clubs out of control (Ho!)\nNigga fuck what ya heard it's Kells and Hov\nWith the second comin of Best Of Both\nIn the first week I predict a million sold, we talkin......\n\n[Verse 2: are. Kelly]\nBig chips! I can't take this\nThe way you move your ass slow like Matrix\nYou make me wanna toss chips in Vegas\nBefore I toss chips first, get naked\nI can't fake it, girl you got the club shut down when you freak it\nSuperstar honey, so mean and vicious\nGot a lot and comin, I'm so mean and vicious\nBark bark farmer, this chicken layin platinum ex-farmer (preach!)\nSo go low mama, give it a go\nAs I punch 170 on stretch roads, must turn up the radio!\nGirl you so good I'm swervin like whoa! Whoa!\nUh oh! Uh uh oh! From the club to the stretch\nOut the stretch to the Hotel, into the hotel suite!\n\n[Chorus: are. Kelly]\nBig chips! (Woo!) We off in Vegas drinkin and partyin\nWe got chicks in swimsuits modelin\nWe in the twin stretch Maybachs dippin low\nThe way the wrist shine it's so magical\nYou know them boys got the clubs out of control (Ho!)\nNigga fuck what ya heard it's Kells and Hov\nWith the second comin of Best Of Both\nIn the first week I predict a million sold, we talkin......\n\n[Verse 3: Jay-Z]\nBig chips! I'm a boss I said\nTilt my hat and I cross my legs\nLike old ladies at the park, I toss my bread\nAnd the pigeons start flockin, ballin like Bishop [?]\nAnd stick Cochran on any da, to try to stop him\nSo any gunplay that is an option\nI been doin this since niggas was woppin\nRockin Izods with the matchin socks, and\nSlap boxin in the back park and when the girls start watchin\nTry to get real, you had to drop 'em\nSee I ain't never been a fronter\nOr fake it till I make it tight nigga ma I don't want ya number\nEither you're comin or I one ya\nEither you know what you want ma, I don't even want ya\nYou play pretty if you wanna\n\n[Chorus: are. Kelly]\nBig chips! (Woo!) We off in Vegas drinkin and partyin\nWe got chicks in swimsuits modelin\nWe in the twin stretch Maybachs dippin low\nThe way the wrist shine it's so magical\nYou know them boys got the clubs out of control (Ho!)\nNigga fuck what ya heard it's Kells and Hov\nWith the second comin of Best Of Both\nIn the first week I predict a million sold, we talkin... Big chips!\n\n[Bridge: are. Kelly]\nAll around the world, stop where the sun sets\nSpendin big chips you wanna go (Uh oh, uh uh oh!)\nYou wanna go (Uh oh, uh uh oh!)\nSay we goin around the world, stop where the sun sets\nSpendin big chips you wanna go (Uh oh, uh uh oh!)\nDo you wanna go (Uh oh, uh uh oh!)\n\n[Outro: are. Kelly]\nUh, come on, Tone, I see ya, Jigga, Kells, uh, yeah, Track Masters\nWhat's really good, we in the islands chillin in the shade and shit you know\nBlue waters, yellow sand, uh\nEither I'm high or, I think I just saw a dolphin", "title": "Big Chips", "image": "https://images.genius.com/e54b7a47c059f99afc5429a8709acf02.400x400x1.jpg"}]}