{"artist": "Ace Hood", "songs": [{"title": "Born an OG", "album": "Ruthless", "year": null, "lyrics": "[Intro: Ace Hood] + (Ludacris)\nI wake up and got four or five bitches in the bed (in the bed)\nSmokin' weed, drinkin' liquor by the keg (by the keg)\nI was born an O.G. if you ain't heard about me\nI put four or five bullets in your head, Ace Hood!\n(Yeah, Luda!)\n\n[Verse 1: Ludacris]\nAs if the guillotine chopped off my noggin\nI got my head gone\nGot my pedal to the metal\nAnd my Lambo poppin' in the red zone\nSpeedin' like demons is reason\nHeathens is breathin' hard\nBut I roll with some heathens\nThat just, just don't seem to believe in God\nThey'll whoop your head boy\nPut your body in the bottom of the ocean\nMean while Ludacris is in the MIA\nWith Ace Hood somewhere smokin'\nGot a pound of the purp and the smell on my shirt\nSo I'm lookin' like roll it up\nI be swimmin' in a pool of blood\nCause the A.K. super soak it up\nHahaha, nah fuck that\nI'mma come back with it right quick like this\nCome back with it, ha ha ha ha\nNasty and Ludacris on the track with it\nGot enough ammo to blow you out of proportion\nAnd put a motherfucker on his back with it\nI'm so wrong, I'm so Gutta\nI'm so dangerous, ain't I?\nI'm so gone off these suckers\nBut the flamers will bang you cause I'm a solid aimer\nThe fat lady got a song to sang ya\nMeanwhile I stashed all your bricks\nIn my [?] million airplane hanger\nI'm so high, I'm so fly, that is a fuckin shame\nSmokin' weed by the bush with that kush\nAnd you's a fuckin' lame\n\n[Hook: Ace Hood] + (Ludacris)\nI wake up and got four or five bitches in the bed (in the bed)\nSmokin' weed, drinkin' liquor by the keg (by the keg)\nI was born an O.G. if you ain't heard about me\nI put four or five bullets in your head (in your head)\nI wake up and got four or five bitches in the bed (in the bed)\nSmokin' weed, drinkin' liquor by the keg (by the keg)\nI was born an O.G. if you ain't heard about me\nI put four or five bullets in your head (in your head)\n\n[Verse 2: Ace Hood]\nIn your head nigga, Young Gutta, Ace Hood homie\nYo! Luda I got 'em, \"Ruthless\" homie\nAnd I'm a ball like a dog and I'm never gon' fall\nYou can call me Jordan baby\nIn a Lamborghini drop top\nAnd I can't stop myself from stuntin' lately\nAnd I'm stickin' to the dollars and my motto\nYou can follow, tell them holler, it's \"Fuck you, pay me\"\nI'll meet those hollows in the back of the Tahoe\nThey comin' at a spiral, borrow that\nAnd any nigga want to get it, I ain't trippin'\nI'll send about 50 with a body bag\nZip it up, ship, ship his ass at the bottom of the ocean fast\nThen I sit back, laugh, with a pound of that hash\nMe and Ludacris pass that\nYou will need a gas mask, think you can still bag that\nMmm, haha, Ace Hood, Ace Hood, G's hood homie\nAnd guess who, guess who I'm back with it\nAce Hood motherfucker don't act with it\nRuthless than a motherfucker, tell them other brothers\nDon't try cause they know that I'm packin' it\nGive me your car, then your keys, then your jean\nThen your green, if you sneeze then you comin' up absent\nAnd I roll with a pack of them goons\nAnd they only think tools with bodies packed in it\nMore money I'mma keep on stackin' it\nHundred thousand for the chain, immaculate\nNew whips I'mma keep plate taggin' it\nNew swag and a Louis duff bag with it\nAce Hood, that's who, you mad with it\nTo all you haters and you fake antagonists\nI got a hit, what's your name? You can have it!\n\n[Hook: Ace Hood] + (Ludacris)\nI wake up and got four or five bitches in the bed (in the bed)\nSmokin' weed, drinkin' liquor by the keg (by the keg)\nI was born an O.G. if you ain't heard about me\nI put four or five bullets in your head (in your head)\nI wake up and got four or five bitches in the bed (in the bed)\nSmokin' weed, drinkin' liquor by the keg (by the keg)\nI was born an O.G. if you ain't heard about me\nI put four or five bullets in your head (in your head)", "image": "https://images.genius.com/53ac3721e503404e628fbbe13e8ddd8e.600x600x1.jpg"}]}