{"artist": "Asher Roth", "songs": [{"title": "Hot97 Funkmaster Flex (Freestyle)", "image": "https://images.genius.com/d2428ce0d129ae1116dae83c31fd96ce.800x450x1.jpg", "album": null, "lyrics": "[Intro]\nI think it's that time man\nLike you said, we're partying man\nThis is your show but, I just wanted to come in\nShow some love, you know what I mean?\n\n[Verse 1]\nWelcome to the show folks, I'm glad you can join us\nFor all these slow-pokes and slow learners\nI'll tone it down, they ain't ready for my sound yet\nBut funkin' round, they funked around and found it\nI'll put it down, leave the whole town astounded\nRhymes stay stout, no doubt, well-rounded\nFest the plump, call me Professor Clump\nThe best is yet to come so let's tell 'em where I'm from\nUm, Morrisville 'bout thirty minutes north\nOf the first exit saying next to Philadelphia\nAnd for the health of ya, use all your stealth\nOr you catch a healthy helping of some brotherly love\nDon't you dare, this is where we declared independence\nLet's not forget all our friends out in Trenton\nNot far from where G. Wash crossed\nHome of Ben Franklin and Rasheed Wallace\nRip it like a Piston on a Ducati Engine\nIf you in it, then you in it\nIf you splitting, get it stepping\nThis unfinished business with me and the record\nFifteen minutes of me funk flexing\nYes! Throw away your weapons\nDidn't Virginia's Tech tech teach you a lesson\nCheck (check), what the heck? Where's ya head been?\nIt's Ash Roth with the change in a segment\n\n[Interlude]\nChange it up Flex, Change it up Flex\nWhat's next? What's next? Change it up Flex\nWhat's this? What do we got here?\nOh shooooo-\nThis is it, this is the jam right here\nLittle Redman\nAnyone rhyme on this before?\n\n[Verse 2]\nIt might be the summer heat, got me thinking differently\nBut, it seems to me that I seem to frequently (uh)\nFreak a beat, see I'm freakish lyrically\nSneaking on the scenery, no more swearing secrecy (nuh-uh)\nBeat sneakers keep creeping through the streets\nKeep keeping on, keep thinking I can leave\nBut, I'm knee deep, got that feeling when I breath\nEvery breath, every step, I can see it in my dreams\nEven though I don't sleep, third song this week\nI am haunted by demonic ambiances usually\nYeah I think they call it fear, he's strong, you're weak\nWell I whispered in the ear, you're wrong, I'm free\nCause there's no wrong way to word a perfect verbalist\nIt's hard to come across, mother F-ers done it all\nNothing left to touch upon, yeah I might just touch a star\nPuffing on a stuffed cigar, huffing just to rust my thoughts\nRust my thoughts, me and Flex going off of thought\nGoing off of tough, yeah this is rough\nNot rider like DMX but dang, what is next?\nThis is live, we ain't taking off but I'm vexed\nPiece to it, peace to New York and everybody into it\nMight move here cause I stay fluent\nThey show me love on the streets, I was sitting on the streets\nWhen three kids came up to me and said \"peace\" and asked for an autograph\nThey was like, \"You is Ash? You're the kid that did I Love College\"\nI laughed and I said \"man, there's so much more to it than this\"\nAnd if you don't get it by now that I spit, then split!\nSo back to it now, I represent\nNah this is what I do when I repent\nBut I never do, I come into it like full force\nThis is Fort Knox in Flex's building, fort box\nAnd if you don't get it, you'll see the video\nYeah I get video hoes, kick 'em out of my party yo\nBecause we only rock with 8s that get down and stay late\nAnd they drink blunts, but who drinks blunts? Only I do\nAnd that's what I do when I come through, and get sick from the flu\nBut it was food poisoning from Noboo\nI had red snapper, yeah Asher Roth is a rapper\nBut f it, I don't really give a ish\nI don't mean to curse but I do just a little bit\nYeah I'm not perfect, I brush my teeth too hard\nThen my gums bleed, yeah I don't mean no bars\nBut these bars got 'em locked down, chip it on pop down\nI don't give a F, I'm not New York like the lox now\nBut I still keep it on lock down\nNow I'm in Flex putting it off on the top now\nSo off the top, this is how it goes\nThis ain't a miracle, no spiritual lyrical thing\nThat's like elementary rhyming to me\nBut please, that's what I do when I have to speak a free\nFreedom of speech, the first amendment what it is\nI amend it, the second amendment\nAnd get them kids out of the streets\nCus we gotta teach 'em education\nThey wasting them times and they gotta be patient though\nCus mother nature takes the same pace, we taking it\nRan in the amazing race, the amazing race\nBut we in survivor mode, this is like an NBC show\nI can't believe it yo, I gotta pass go\nCollect a couple dollars, and then set up a place on Park Place\nNow I'm amazing, I got this look on my face\nThey're like, \"Damn he's crazy, I can't believe what he be doing\"\nA college kid and he straight screwing up the industry\nTell 'em you don't have to be street to be a G\nAnd that don't mean a G, I mean a G-E-N-T-entleman\nThat's kind of an Andre 3000 thing\nBut I don't care, I still like it so I take it\nAnd I put it in a freestyle, I never bite it\nI just bit a sandwich the other day cus I liked it\nIt was good, had avocado in the middle\nGot my fatty-asses and you know it, mega threes\nBut this be a free so please\nI'm just having fun, see my teeth?\nI'm smiling, you can't believe this can you?\nTom-boy be wild and Brain-bang behind him\nGot my man Funk Flex on two's wilding\nOut scratch it up, take it back to the ninety's\nWe be rhyming all day dog, look behind me\nThere's a- There's a camera right there\nAnd I will stare for five seconds and check my hair\nI'm cool, and even if you thought it was a wig, I'm good\nI'm Zach Morris spitting on it, cat goring litting on it\nYeah, ha, what what it is?\nFlip the beat up a bit, nah this is it\nThis is spit, I don't know we got all day\nI be on the air for awhile this is hey\nHey how you doing? What's up?\nChill for a little bit\nCheck my sideburns and my little beard stubble\nStubble, Barney Rubble little look alike\nBut I don't care, Fred Flintstone roll it up right\nPut it in a J, and I don't mean to talk about that smoke all the time\nCus you know that these kids listen to every rhyme we talk about\nSo I need to talk about more stuff like not talking about knocking em out\nTalk about build em up\n\n[Verse 3]\nBuild em up!\nSo, I swear to god what it is! What it is!\nAsh from the east, Philly rep-represent\nBut we just took that beat off and slid it to the right\nThis another Nas joint, make 'em look all night\nWhen I walk into the room, Tiger Woods what you doing?\nShook his head said, \"Nice putt last year dude\"\nI think you lost this year to a dude who didn't know what he was doing\nOn a far par four-park fork course, hit the par ohh.. Fore!\nYeah that's what I do when I tell em to watch out for who?\nAsher Roth, white kid from the truth\nThe truth, what I do when I'm in the booth\nBut I'm not there right now, I'm in front of the Hot97\nMike Jackson, rest in peace in heaven, we miss you already\nAnd it's only been 3 hours and I don't know if the news is ready for it\nI think you in a coma from cardiac arrest\nBut still I wish my best, you left a leg-\nAcy, please, my legs is going out from under me\nBut I never stop like I was Donavan McNabb\nFrom the line of scrimmage in the last SuperBowl\nTerrell Owens was waving on 'em, but who cares ?\nThat's a Philly word if you don't know it from New York\nBut who cares? Pop the cork let's celebrate dog, put it in the air\nBut this is how we do it\nAnd I don't care if I don't have a rapper voice that you used to\nTruth dude, I be in the booth and I'm chilling all day sipping ?\nNew boo? What? Who knew?\nI don't know, I'm just sipping on a Miller Lite\nAnd I'm chilling here, I'm not tryna fight\nNah, I'm tryna be alright, lean back with my boat shoes on\nTruth dog, I don't give a F which you on\nYou on something that I'm not on\nAnd all I'm tryna do is get my swerve on\nOr my swag on, whatever Soulja Boy talking 'bout\nBut truth be told, Asher Roth knocked 'em out\n\n[Outro]\nMade you look\nI made you look, Flex!\nI made you look", "year": null}]}