{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/4b94adf039cd60481b11a123e817daec.662x566x1.jpg", "title": "I’M ON A PLANE", "year": "2014-03-19", "album": "WORD O.K.", "lyrics": "[Hook]\nI’m on a plane\nI can’t complain\nI’m on a plane\nI can’t complain\nI’m on a plane\n\n[Verse 1]\nKool A.D., like the refreshment powder\nThe blessing counter, the lesson doubter\nMessing with the freshest flowers\nBring the heat like a Smith and Wesson touter\nProfessional freak-outer\nSpeak the English language, it’s the slang I learned to bang with\nIf I came from Denmark then I’d probably freak the Danish\nManage with the Spanish but I’m godly with the Spanglish\nTomo como vaso de agua, Vicky lake-ish\nMOMA couldn’t frame it, I been famous\nGhetto music, the game been racist\nGeppetto movements, the game been salacious\nConsider all the names of race, we been nameless\nHalf black power, half white guilt, I’ve been raceless\nKahlua vodka in milk, I been wasted\nMight jack one mil' I been chasing\nThink I might just quit rap and live basic\nWhat’s it all mean? Who cares?\nFear not of man because man must die and that's fine I ain't too scared\nI'd be lying if I said I’ve never resorted to crime for a new pair\nBut what I know about life? It ain't too fair\nSo I see why the youth wanna get the little ice and the new gear\nBut fuck it, I be nice off a few beers\n\n[Hook]\n\n[Verse 2]\nKool A.D., the navel gazer\nThe wavy bather, the lazy shaver\nThe gravy taster, the crazy caker, the paper taker\nThe lady chaser, the Jake Braker, the grape laser\nThe lane changer, the game changer, the chain claimer\nThe brain breaker, the strange stranger, the \"brang-dang-er\"\nThe anger, the danger\nMajor, like I sprang from a dame in the manger, framed by the angels\nBut the frame ain't the same man, it change with the angles\nGang bangers engaged that make bagels and pastels that make the pages\nEnraging the blank statesmen that play with the bank statement\nLike it’s just another day at the races, let's face it\nIt’s all basically apeshit crazy, sincerely Kool A.D., baby\nPay me, gravy train, wavy\n\n[Hook]"}]}