{"artist": "Andre Nickatina", "songs": [{"title": "Little CoCo", "album": "Daiquiri Factory: Cocaine Raps, Vol. 2", "year": "2000-06-06", "image": "https://images.genius.com/938e1205f8900a38bea9cfb2f96124ae.220x220x1.jpg", "lyrics": "[Verse 1]\nI was the itty bitty cat\nWith the itty bitty bat\nWith the itty bitty gat\nWith the itty bitty rap\nThey like who not you?\nI'm like Yeaah nigga me!\nI only come around when niggas pay me\nI love Bruce Lee with a cup of ice tea\nFully dressed smoking weed in a hot Jacuzzi\n\nLittle Coco x 3\n\n[speaking}\nA young tiga\nRide around on the left\nCame out kickin' it live you know?\nThey was like \"is that you Dre?\"\nI'm like yeeah nigga it's me\nWhatsup?\nBruce Lee playing down at the St. Francis\nGet your money nigga lets go!\n\n[Verse 2]\nBig bank in the fishtank\nSideways on the streets when I dip mayne\nDrinkin' pineapple crush with a blunt, don't touch\nCheck it showin' my luck, with this girl named Nicky Punch, what?\nSpare me your thoughts, pass the hot sauce\nYou don't know how much these shrimp cost!\n\nLittle CoCo x3\n\n[speaking]\nYeah, these Tiger Prawns is the bomb, uh-huh\nAdd a little hot sauce here\nI remember I used to reminisce in the cold\nRidin' through the city at 3 A.M you know?\nBlow a lil' weed, watchin' my red deviled fish fight, all night\nRight?\n\n[Verse 3]\nThe homie baked his cake\nThe warden's like \"wait!\"\nCause' everything we do is like a dope case, yeahh!\nRippin' through The City at a fast pace, yeeah!\nTryna' make money fore' its too late, yeeah!!\nFall or rise, chicken tiger banzai\nLivin' like the Jefferson's, piece of the pie\n\nLittle CoCo x 3\n\n[speaking]\nYou remember George and Louise?\nYeah nigga, the Jefferson's, playboy\nGet your bread like George was\nWhippin' in the whip at a fast pace\nSo fast\nSpittin' game with my homeboy Tony Banks\nI can't wait\n\n[Verse 4]\nKill the noise that you spittin' baby\nTalkin' is for spectators\nFascinated by the brain and multiple game\nTryna' get you open way out of your frame\nYou dancin' with the devil when you mention my name\nLike Caine and thangs, nigga buka bang bang!\nI hope thats my lady when the fff- phone rangs\n\nLittle CoCo x 3\n\n[speaking]\nWhatsup?\nYeah\nI'm comin\nWhat you got\nIm hungry\nYour puddin' is like Yayyyyooo\nYeah, you gon' you kiss me on the back of the neck, twice?\n\n[Verse 5]\nLike a Ferris wheel\nI get the fairest deals\nBecause I love long legs and the highest heels\nI love a Coupe De Ville, and up a Sedan De Ville\nAnd I kick it sometimes up in Vacaville\nGirl relax and chill\nWe got weed for real\nAnd would you please make sure them dranks don't spill?\n\nLittle CoCo x 3\n\n[speaking]\nYou know?\nI used to take the Caddy up the 707\nKick it up there at Funky Chicken record store with my man Chauncey\nEatin' on hot wings and lemonade\nLadies would walk in every 10 minutes man\nIt was all real proper man you should have seen it\n\n[Verse 6]\nYou know we kick it hella wicked on a ticket to Atlanta\nMindstate thinkin' like a 60's Black Panther\nLike Jo Jo Dancer\nBaby what's the answer?\nYour partna' is a libra, I'm a pisces youse' a cancer\nPranca! Thats my tiga from the five\nThey told me to park, and I put it in drive!\nThey told me tell the truth and a nigga straight lied!\nI had 'em all twisted like a bag of curly fries!\n\nLittle CoCo 'til the end\n\n[speaking]\nKeepin' it live\nAnd I'm keepin' it live\nTwizzle it like a twizzla you know?\nI represent all pisces!\nCheck it out, whatsup Pranca?\nIt's me, A-N-D-R-E!\nRemember we hit the ATL like Huey Newton and Bobby Seale?\nBack in '88\nIt was great!\nCheck it out\nWhen it's poppin\nNo stoppin'\nIn Frisco\nIn Fillmoe"}]}