{"artist": "Andre Nickatina", "songs": [{"title": "Piece of My Mind", "album": "I Hate You With a Passion", "year": "1995-04-19", "image": "https://images.genius.com/caf6d8331e5ef8bd79cb75fa64fb6144.1000x1000x1.jpg", "lyrics": "Punishment is painfull when you know that you deserve it\nIt's like a hustla on a clucka let me show you how I serve it\nNigga I see you, it's the tall bald eagle\nRepresentin somethin but you respresentin seagull\nPigeoun! Yeah you's a dirty flyin rat\nYou carbon copy cattapiller or should I say fax\nRelax and get jacked like that nigga in Menace\nFuck around patna and get smacked like a tennis\nBall! Man did my niggas juss call?\nIt's 911 it's yo nigga Dre Dog\nSo nigga fuck around and get cut like a canteloupe\nTry ta run and get chewed up like a cheetah on a anteloupe\nPayback's a motherfucka sour dope deal\nTargets make noise like a mutilated seal\nDead with a scared look on they face\n1995 it's a cocaine race\nThe Firm!\nMothafuckas doin that sherm\nSlug ass niggas get treated like a germ\nSo when you see me nigga you'll refer to me as mista\nOr brother in law nigga cause I'm fuckin yo sista\n\nMore bass!\nAnd it goes like that\nMore bass!\nAnd it goes like this\nMore bass!\nAnd it goes like this\nMore bass!\n\nYeah, I chews gum and beef jerky\nEats chicken and turkey\nNigga you might wound me but you neva will hurt me\nHe's cut!\nThe left eye's all fucked up!\nOne hitta quita got em walkin like a drunk! (hehehehe)\nSkunk and a blunt nigga all rolled up\nTug boat nigga in the sea juss sunk\nI'm a yacht\nMothafucka gimme what you got\nAll packed in like them nappy dreadlocks\nSardines, all cluckas get that cream\nAnd ta get it outta you, man I fucked up\nRaise up!\nThat paybacks pimp's on the hunt\nDarker than a tinted window, quiet like a monk\nI wanna hear ya cry so I ain't gonna pop ya\nI wanna see ya scream right before I drop ya\nSo check this out mothafucka when I got ya\nI'm gonna knock the wind up out ya\nPanic!\nMothafucka yeah it's the indo mechanic\nQuick until ya start this\nColder than the arctic\nStep up in the mind of a creep thief artist\nHungry for the bankroll\nStripes like a sergeant\nAnd that's a piece of my mind"}]}