{"songs": [{"title": "A Game Named Life", "lyrics": "[Intro - Akala]\nUm, In a game named life\nIn a game named life\nIn a game named life\nIn a game named...\n\n[Verse 1 - Akala]\nA game named life where fools make the rules\nAnd poets paint pictures with words that change nothing\nSurvival of the fittest they say, are they sure?\nOr just the survival of those with the will to kill more?\nThe heart that thinks itself purely, surely is not hungry?\nHungry hearts know too well, the world is fuckery\nAnd nature is indifferent to the suffering of infants\nThat think ourselves growing human beings and something special\nBut as fate would have it, I ain't buying the idea of fate\nIt seems we shape every place that we grace with hate\nDepending which side of the fence or which epoch\nYou die a slow death or be singing from the treetops\nPraise for the status quo, cus you're comfortable\nThose who lost out in this lottery, ha, fuck 'em all\nNice with this roll of the dice, I'm quite proud and\nI don't know if we will ever roll another time round\n\n[Hook - Mai Khalil]\nIt's a game named life\nIn a game named life\nIn a game named life\nIn a game named life\nIn a game named life\nWhere the dice decide where I go\nThere I go, in a game named life\nI dream to be let go\n\n[Verse 2 - Akala]\nA game named life, where fools make the rules\nAnd poets paint pictures with words that change nothing\nYoung child soldier, revolver not bluffing\nIn a game that teaches children to kill but can't love them\nWhat is the journey of a bullet from the ground until we pull it?\nA piece of earth made to blow holes in souls\nI'd like to know does a child choose in its mother's core or before as just a sperm to be born in war?\nDoes another sperm choose greatness floating in his father's pleasure?\nOr does the game only begin when the umbilical's severed?\nIs that the reason babies born screaming?\nBecause they know they left the spirit world\nTo live here with no meaning among demons\nThat see them as nothing more than chess pieces\nIn a game named life where even the winners stop breathing\nAnd the whole thing is as tedious as a tale that is told twice\nWe clone life but don't even own our own life\n\n[Hook - Mai Khalil]\n\n[Bridge - Mai Khalil]\nSacrifice, pain and strife\nThis game named life is over\nBefore we even know\n\n[Verse 3 - Akala]\nLife is a mirror always looking at you\nIt's not what we say or think, we are just what we do\nWith the time that is given it comes with no ribbon\nBecause life is not a gift to everyone that's living\nMost of the moves are made before you took your first go\nSome got a huge head start before their first role\nSo you could play with more skill than the other players\nThey will still be ahead because the past generations\nAccumulated spaces so they could practice with acres\nIlluminated arrangements so they could manage retainers\nAre you foolish? They ain't racing we're chasing the pay slip\nSo they have won before even the game starts unless we change it\nTo another set of rules different from the fools\nBut to do that we are going to have to use their tools\nAnd therein lies our greatest dilemma\nIn this game named life, who's playing it better?\n\n[Hook - Mai Khalil] x2", "year": null, "album": " The Thieves Banquet", "image": "https://images.genius.com/acaf5708a18660f33365d7d63e4937b7.500x500x1.jpg"}], "artist": "Akala"}