{"artist": "Cappadonna", "songs": [{"title": "Power to the Peso", "album": "The Struggle", "year": "2003-10-23", "image": "https://images.genius.com/f7a7e9bd3d16cfdfd266ae989d07c7b8.500x500x1.jpg", "lyrics": "[Intro: Lounge Mode]\nYeah, nigga!\nAiyo, what up man? This is all BB right here\nWord, yo, we just slid in from the back door\nIt's Code:Red, nigga, level four, ya'll know what it is, man\nI told ya'll, huh? I didn't? Watch this one, though (Goon Squad!)\n\n[Verse 1: Lounge Mode]\nAiyo, I know niggas that get dusted and wild out\nThey foul out, talk to the cops and play they style out\nMe? I'm real hood, and them niggas that was fakin' before\nI take they jaws, cuz Lord, I wish they would\nYes, Lord, it's all good, you know I hustle\nIn the tanktop with no muscle, all in the hood\nAnd roll dice by the elevator, and post up\nAnd wait there, if he comin' in, dog, gotta wait til later\nI squeeze off, ease off from the nine milly\nAnd my niggas be like, \"Watch how he whine, Billy!\"\nAnd for the record, these niggas gotta come kill me\nWhere I'm at, in the Hill, by the Ooh, silly\nDanger, danger, ain't nothin' change but space\nAsk Space and Daxe, in how they manage\nAnd how I do damage, fuck takin' flicks for cameras\nYou know them bandanas, run with them clip bananas\nI'm on the hunt for the big dough to stick Santana\nPlus these labels exec's come in a calm manner\nN.S.Beezy, I stay easy\nFuck what ya'll niggas is talkin', I'm off the heezy\n\n[Verse 2: Cappadonna]\nIn the hood, you get fake hugs and cold stares\nHeat holdin' niggas with the apple colored wears\nTry'nna get them greens, premature niggas get knocked out and dope fiend\nNiggas stand up, Staten Island, rip you and ya mans up\nHands up, yeah, kid, it's the real\nRough necks on this side, cats makin' a deal\nCoke in the bill, weapons appeal, do what ya feel\nFrom Park Hill to Jungle Nillz\nSo much that we gotta pay the bills\nGive us the cream or get killed....\n\nGoon Squad!\n\n[Verse 3: Wigz]\nAiyo, my jewels so chunky, I got a brass monkey\nWith a, rock in his ear, two chips in his tooth\nNo cuff', I throw the ol' joint off the roof\nIt's a new year, I'm layin' new words in the booth\nFuck \"The Truth\", I'm \"The Reason\" why rap needs to +change+\nThe same four quarters in +the game+, I got change\nNickles and dimes, rhymes, styles of Beneen\nSee, Cash Rules Everything, lord, I need C.R.E.A.M\nGotta team that could elbow out the meat cooler\nI'm a hustler, I could sell a brick to a jeweler\nOff your front porch, g off ya back deck\nThis me, Lounge and the team, we dishin' up the projects\n\n[Verse 4: Solomon Childs]\nWe killas as sharp as knives\nWork for hire, special key be the paralyzer\nGot my own killa slang and dancers\nCertain hammers for certain circumstances\nThese the roads of Allah's deed, knawhatimean?\nI took the advances and bulletproofed the Suburbans\nNo handouts, stay earnin' mine\nThe hood hate to see a nigga shine and now I know\nThat a ho gon' always be a ho\nAnd 23's can't fit on a '98 Tahoe\nAnd ain't no superstars comin' off Apollo\nThe chicks around the way frontin' with tongue rings, don't swallow\nMy mind was raped as a child, Rocky could of never beat Apollo\nThe feds could of never caught 'Cino\nP. Diddy would of never fell for a bird like J.Lo, power to the peso, nigga!"}]}