{"artist": "Paris Shadows", "songs": [{"album": null, "title": "Different", "image": "https://images.genius.com/1a6b93967c39b7153c6d7a6692756540.987x987x1.jpg", "lyrics": "[Intro]\nMarz\nYuh\n\n[Hook]\nIf a nigga like me pull up in the hooptie\nWould you think any different?\nThink any different\nAnd you pull up on me, new bags and new keys\nKinda funny how we don't talk no more\nCause you think a little different, think a little different\n\n[Bridge]\nI ain't seen you in a while, you looking different\nAnd I don't know know know nothing at all\nAnd you calling me when you know I'm not home\nAnd I know and I know and I know know know know\n\n[Hook]\nIf a nigga like me pull up in the hooptie\nWould you think any different? (think any different)\nThink any different (oh)\nAnd you pull up on me, new bags and new keys\nKinda funny how we don't talk no more\nCause you think a little different, (think a little different)\nThink a little different\n\n[Verse 1]\nYou don't wanna be alone, nah\nYou the one that a nigga wanna hold down\nI bet you wanna post now, yuh\nOn the gram girl, can you put your phone down?\nGirl I wanna talk to you, talk to you\nIt can be me, you, and your friends\nIt ain't even gotta stop with you, stop with you\nI mean anything is possible\nSmokin', drinkin', it's a lot to do\nBut of course this shit is optional\nNone of these niggas is obstacles\nNone of these bitches is on to you\nNone of these bitches is on to you\n\n[Hook]\nIf a nigga like me pull up in the hooptie\nWould you think any different? (think any different)\nThink any different (oh)\nAnd you pull up on me, new bags and new keys\nKinda funny how we don't talk no more\nCause you think a little different, (think a little different)\nThink a little different\n\n[Outro]\nYuh\nI'm back on the road and I thought you\nShould know that these niggas ain't close to me\nText on my phone and your girl all alone and she tell me that openly\nShe not coming home\nNow you calling her phone and she answer that hopefully\nFuck all of y'all that switched up on\nThe boy yeah you niggas are ghosts to me\nDropping my top and your boy out the\nTop yeah I'm right where I'm s'posed to be", "year": "2018-12-09"}]}