{"songs": [{"album": "More Politics", "image": "https://images.genius.com/2b173e3d3bd02f85d5edd743f3588568.600x600x1.jpg", "year": "2016-11-18", "title": "Krazy Thangs", "lyrics": "[Hook: Cyrus DeShield]\nLove, love, love\nLove can make you act so crazy\nLove can make you act so crazy, baby\nLove, love, love\nLove can make you do some crazy thangs\nSome crazy, crazy,crazy thangs\n\n[Verse 1: Termanology]\nUgh, woke up stressed, two hundred texts\nNow both of us vexed, and it’s a mess\nEvery other convo, somethin’ bout my ex\nShould we just put this relationship to a rest?\nI mean it’s common sense, time and time again\nWe stay in the same struggle that we shouldn’t be in\nLike, where should I begin?, should I leave again?\nMy ex did me dirty, so now I just need a friend\nPop a couple bottles so I could try to fit in\nI don’t really wanna party but I could try to pretend\nI know she lying again, flippin’ crying again\nThe feeling is so distant, it’s different I really miss her\nOvercome by the feelin’ that you could do better\nYou post a IG pic, type out a whole letter\nThis is the last time I swear I mean never\nLike never never again but, but never say never cuz..\n\n[Hook]\n\n[Verse 2: Termanology]\nYou know the feeling you get? Your chest get tight\nSomebody took you for granted, messed up your whole night\nYou knew something was off, the feeling ain’t right\nAnd you ain’t tryna hear shit so you text the whole fight\nNext day you wake up, here comes the break up\nYour heart shattered to pieces now you wanna make up\nCalls and texts, they ring in but more or less\nIt’s seems all the same, we lost all respect\nI used to say I love you, now I say fuck you\nFunny I would’ve let ‘em kill me before they touch you\nAnd I don’t even trust you, I’m missin’ the days I did\nBack when was cooped up, lazy in the crib\nHow it go from, “Bae I love you and I miss you\"\nTo “Bitch you ain’t shit\" and “Man I wish I could hit you”\nWay too many issues, tears dripping in tissues\nEven through all this, I still wish I was with you cuz..\n\n[Hook]\n\n[Bridge: Cyrus DeShield]\nI say do you love me or do you love me not?\nIt’s always something girl, we gon’ blow up the spot\nAnd I’m talking about blowing up forreal\nWe gon’ need a fireman to cool the fire down\nAwe man\nI can't fight it\nI won't like it\nIf you said it was over right now\nI be in ya face with this, I couldn’t lye down\nI’m more than crazy for ya love, I'm grateful for ya love\nAnd if we lacking patience, there’s no us\nI know that ain’t enough\nBut we be goin’ back and forth like we don’t give a flyin’ fuck about how we feeling\nTryna hurt each other’s feelings\nWhen I know that you love me anyway, I love you just the same\nSo baby I ain't going no where\n\n[Hook]"}], "artist": "Termanology"}