{"artist": "Drake", "songs": [{"year": "2009-07-30", "album": null, "image": "https://images.genius.com/e8e4af9d70633a1703ccd3faf671871c.640x640x1.jpg", "title": "Can We Be", "lyrics": "Uh, yeah, alright\nUh, well alright\nYeah, well alright\nUh huh\nYeah\nFeel good\n\n[Verse 1: Drake]\nIt's a celebration clap clap bravo\nLobster and shrimp and a glass of Moscado\nFor the girl who's a student and her friend who's a model\nFinished the whole bottle...and we gonna do it big like this\nYea and he was just practice\nHe ain't in your world you can take him off ya atlas\nGirl you on fire can I be the one you match with\nI give you a credit card and baby you can max this out\nShow me where ya tats is, show me where ya heads at\nMaybe I can grasp it\nThey say if you get her you can understand her better\nAnd she known to be a cheater but that's only if you let her\nYea... and I got it together so when they talk\nThey try to deter me it's like whatever\nTell em' I appreciate the help, but I just gotta know for myself\n\n[Chorus: Marleik]\nCan we be? Tell me can you handle this lifestyle that I'm in?\nBeen with all these other girls around me, just wanna get to know me\nCan we be? I wanna know, I wanna know, I wanna know\nC-Can we be? I wanna know, w-wanna know, I wanna know\n\n[Verse 2: Drake]\nThis lifestyle is foul this sh*t'll damage her\nEspecially when you think no one is understanding you\nThese girl groups with they overprotected managers\nGot paparazzi over my shoulders clickin' they camera\nSnap snap snap until they runnin' outta card space\nYou remind me of Tony's sister in Scarface\nJust take it easy on love and slow ya heart rate\nGirl there's graces atop but it's such a hard place\nYea... but if you never even been there\nIt kinda make sense why you dying to pertain there\nSpillin' all your drinks, takin' pictures in your swimwear\nHead up in the clouds you survivin' on the thin air\nI know that sh*t is exhausting girl\nAnd your mistakes are costing girl\nAnd maybe you don't need the help but I just wanna see for myself\n\n[Chorus: Marleik]\nCan we be? Tell me can you handle this lifestyle that I'm in?\nBeen with all these other girls around me, just wanna get to know me\nCan we be? I wanna know, I wanna know, I wanna know\nC-Can we be? I wanna know, w-wanna know, I wanna know\n\n[Verse 3: Marleik]\nSo baby say what it is about you\nHave been thinking to spend a day without you\nGirl I hope you're ready, see I'm really busy\nIf you wanna be my girl\nCause babe I'm so curious, you're so mysterious\nSo figure what you want, cause this is what you see, bein' with me\n\n[Chorus: Marleik]\nCan we be? Tell me can you handle this lifestyle that I'm in?\nBeen with all these other girls around me, just wanna get to know me\nCan we be? I wanna know, I wanna know, I wanna know\nC-Can we be? I wanna know, w-wanna know, I wanna know"}]}