{"songs": [{"image": "https://images.genius.com/a69b6ff9152c67baee9402cf5ffdff26.1000x1000x1.jpg", "title": "Dragon Slayer", "album": "Attitude City", "year": "2014-02-19", "lyrics": "[Intro]\nWhy hello there. You're a very attractive young lady\nI'd like to ask you out on the hottest of dates\nI see that you have a lot of other gentlemen suitors\nAllow me to make my case...\n\n[Verse 1]\nThis guy plays football\nBut I once won the whole super bowl by myself\nThis guy is a weightlifter\nBut I can bench an entire continental shelf\nThat dude is a scientist\nBut I already cured all diseases last week\nAnd if that's not enough lemme ask\nWhen was last time one of these dicks killed a motherfuckin' mythical beast?\n\n[Chorus]\nOh yeah, I will rock your world\nCause I'm a dragon slayer, girl\nI shall now expose my chest\nDon't act like you're not impressed\nHow hard did I just seal the deal\nWith my dragon slayer steel\nDo you feel all my sexy appeal\nAnd my story that's so very totally real\n\n[Verse 2]\nI rode up to the mountaintop\nIt was ninety million hundred fifty thousand hundred feet in the air\nTil I found the Dragon's cave\nAnd I fought through his army of awesome karate bears\nThe Dragon's breath was a blast from hell\nAnd we fought so hard I missed a longstanding appointment for brunch\nThen I swung my horse like a club\nAnd it caused a sonic boom that ruptured space and then exploded the sun\n\n[Chorus]\nOh yeah, you are now in love\nWith both my dragon slaying nuts\nI killed a demon with these hands\nDid I say I'm also in a band?\nIn case you might need more proof\nI brought the dragon right to you\nOoh! it's the one that I slew\nHe'll attest that my story is totally true\n\n[Bridge]\nDragon dance!\n\nI am a dragon!\nNot some guy Dan met at the bus station in a dragon suit\n\n[Chorus]\nGirl let's go back to my place\nNothing fancy, just a huge mansion in space\nCan you guess what's coming next?\nHere's a hint: I'm talking about sex\nThis is the best day of your life\nYou'll be my dragon slayer wife\nAll right! Now it's time to decide\nWhich lucky one of us is gonna be your lover tonight?\n\n[Outro]\nOh, I see you've chosen the football player...\nAnd the scientist...\nAnd apparently the weightlifter as well...\nAnd the dragon...\nAnd Ninja Brian...\nAnd the Manticore!? He wasn't even in this song!"}], "artist": "Ninja Sex Party"}