{"artist": "Fat Joe", "songs": [{"year": "2016-07-22", "album": "Freetracks & Exclusives", "image": "https://images.genius.com/7423c1c85a958d89bdd10bc960c157a3.1000x563x1.jpg", "lyrics": "[Intro: Fat Joe]\nAll the Way Up Remix\nFarid Bang, Kollegah, Summer Cem, Seyed\nBanger Musik!\n\n[Part 1: Farid Bang]\nEs fallen ein paar Schüsse und ich lass' deine Beschützer sterben\nIch fahr' im Lambo, denn er ist gut gegen Rückenschmerzen (ah)\nDeutscher Rap ist Comedy Club\nIch komme in' Knast\nDenn diese Nuttensöhne callen die Cops\nUnd ich fick' eine polnische Slut\nHalt das Bügeleisen, Bitch! Ich übertreibe nicht\nDoch diss' mich und ich werd' der Entführer deiner Kids\n\n[Part 2: Kollegah]\nLaber nicht von Showgigs und Platin oder dass du hoch in die Charts willst\nEy, wenn du Piç es nach oben schaffst, dann nur beim Obstkisten Tragen, yeah\nAll the way up, ich zähl' die Dollars, zieh' die Kalash\nAlpha-Banger-Kommando, Killer-Kollabo, Bitch, das ballert\nWie das Crystal von Heisenberg\nDas Motto: Money over Bitches, wie wenn ich im Stripclub mit Scheinen werf'\nWenn wir deiner Bitch Cumshots verpassen\nDann heizt du schnell ins Zimmer kid, denn du willst keine Cumshots verpassen\n\n[Hook: Infared]\nNothing can stop me, I'm all the way up\nAll the way up\nI'm all the way up\nI'm all the way up\nNothing can stop me, I'm all the way up\nI'm all the way up\nAll the way up\nI'm all the way up\nI'm all the way up\nNothing can stop me, I'm all the way up\n\n[Part 3: Seyed]\nWenn ich zu Bitches sage: „Ich schenke dir Produkte vom Mac!“\nMein' ich kein' Lippenstift, sondern Deus-Maximus-Caps, yeah\nVor zwei Jahren hab' ich mal Tinder probiert\nWar nicht schlecht, aber heute reicht mein Insta-Profil\nBin am texten, bin am flowen, das' kein Fashion-Dialog\nWenn die Bitches meinen, Seyed ist die Freshness in Person\nZu viel Cash gemacht, muss jetzt meine Kohle vergraben\nGeh du weiter deine Pokémons jagen, tze!\n\n[Part 4: Summer Cem]\nI'm all the way up wie der Neptun\nBitches rufen an, mein Handy ist auf meşgul\nWährend andre Rapper Bomben kassieren\nIst mein Becher voll mit Bombay Sapphire\nEure Texte hören sich friedfertig an\nIch ficke deine Frau und hab' den Dsquared noch an\nFeatures haram, mich kenn' alle Fotzen in der Stadt\nWeißt du auch warum? I'm all the way up!\n\n[Hook: Infared]\nI'm all the way up\nAll the way up\nI'm all the way up\nI'm all the way up\nNothing can stop me, I'm all the way up\nI'm all the way up\nAll the way up\nI'm all the way up\nI'm all the way up\nNothing can stop me, I'm all the way up", "title": "All the Way Up [Official Remix]"}]}