{"songs": [{"lyrics": "[Intro: Agallah talking]\nYeah yeah. Yo yo. You know the world getting ready to cease. So everybody rest in peace, yanah'msayin? Here's your life pleas. At least, nahm'saying? Y'all ain't gon' be looking forward to be trying to go to Hell or Heaven. Cause we all know we goin' one place. Haha. Yeah, yeah. To all the...double platinum rappers, I'm coming after ya. Haha. Think not? As the words...\n\n[Verse One]\nWho told God to create the Heavens?\n8-Off did\nWho told the Devil, \"Yo, step off.\"\n8-Off did\nWho told the Dominicans to take Spanish Harlem?\nAgallah did\nExcuse me for a moment but anybody know where Agallah is?\nWho told Manhattan we need to fix up that old Brooklyn Bridge?\nSo we can have a place to walk and chill with Brooklyn kids\nI'm in Jersey, straight up looking for my man Viz\nThat's my dude right there\nAnd we gon' get in this biz\nY'all know what time it is\nDamn skippy, watch Rolly\nYou know we do when this world blow up, I wish I knew\nMade this whole jam just for you and your crew\nDrop the single '95 and it still sound new\n\n[Hook]\nTo the 5 star millas\nThe big wheelers\nThe world where girls fall in love with drug dealers\nThree piece suiters, Buicks, limos and music\nBig stars next to the bars, money and cars\nTo the wild brothers\nAnd pregnant baby mothers\nBreaking MC ass brothers who still love us\nOn the jail to the PJ's struggling to survive\nI'm here to tell y'all keep your dreams alive\n\n[Verse Two]\nWho told all the record labels, \"On the real, y'all need to team up\"?\nWho told Jordan to retire, \"The dream is up\"?\nMy flows like straight cream right inside of a cup\nTake one sip and then I rip, y'all niggas get stuck\nA battle me?\nNone of y'all rappers don't even want it\nShows this is record family, and that's how I'm on it\n600's and mansions duke, that's how I flaunt it\nSipping Grand Monya right outta antique gauntlets\nI be like, \"Mirror mirrors on the wall\n8-Off the Assassin you're the best MC overall\"\nThis is for my peoples out there that just don't care\n[?] rap niggas that's killing, get yo' ass the fuck outta here\n\n[Hook]", "title": "5 Star Millas", "album": null, "image": "https://s3.amazonaws.com/rapgenius/220px-Agallah_2011.jpg", "year": "1999-01-01"}], "artist": "Agallah"}