{"songs": [{"year": "2014-01-31", "album": null, "image": "https://images.genius.com/25d8a9c93ab97e9e6d5d1d9d36e64a53.1000x1000x1.jpg", "title": "Facebook Q&A 1/31/14", "lyrics": "Q: Did you your self struggle with alcholism? Or some one you love? - Brittany Kyle\n\nA: everyone I loved, friends to family\n\nQ: You have an pure heart and a clear sense who you are through your awakened soul, it's what connects many fans to you on a different level, beyond recognizing you're real. Was it the moment you saw your soul at the age of 9 that you can pin point yourself reaching that spiritual level? Elaborate on another experience that has made you now live in the 4th dimension, opposed to the 3rd. - Chaz Willams\n\nA: thankyou, talking to God and hearing him talk back.... 4th.\n\nQ: Who is your inspiration - Alishias Tawengwa\n\nA: my family\n\nQ: What was your favorite song to record? - David Matias\n\nA: madd city\n\nQ: Do you have plans to come to Sweden? - Sam Mohammedpour\n\nA: yea ill come back\n\nQ: SHEEEEIIT What you thinking for the collabs on the new album? - Jose Vigo\n\nA: haven't thought it, but in this moment.... nobody.\n\nQ: I've seen a photo with you and Nas, Are you about to make a collab? Or maybe a full album haha? by the way it would be AMAZING! - Fisnik Ramadani\n\nA: lol I'LL quit rapping after that project.\n\nQ: How do you master the skill of making a legendary bowl of Fruity Pebbles? - Luca Mancuso\n\nA: its all about balance. how long u let it settle in milk, not crunchy not too mushy... the same with life\n\nQ: will there be Black Hippy album? - Robert Wodzicki\n\nA: soon enuff\n\nQ: What do you think about adding a female artist to TDE? - Dejanae Payton\n\nA: Who sza? she dope\n\nQ: how do you feel about having so much 'pressure' lying on your shoulders, since good kid m.A.A.d city was so hute that your next album can't possibly top it? - Sebastian Wallner\n\nA: they put the word ''pressure'' on me a million times before good kid drop\n\nQ: What's your favorite song of all times? - Bogdan Mot\n\nA: theme song to duck tales\n\nQ: where's your favorite place to perform? - Chanté Ferrao\n\nA: in the booth!\n\nAre you realy coming to South Africa on the 7th february mrKendrick? - C'ya Last Born\n\nA: question is, are u coming?\n\nQ: Who's project from TDE and you more excited about? - Jess Torres\n\nA: oxymoron\n\nQ: What was it like working with Imagine Dragons? Would you ever consider doing a rap/rock album? - Jeremy Morrell\n\nA: great artist to work with! that would be a dope challenge\n\nQ: What are your ideas on coming up with hotter concepts to assure that your next album will be better than section 80 and gkmc? Those are dope ass albums and I'm sure the next will set the bar higher then you have. - Jonathan Puchie\n\nA: thankyou, truth over facts\n\nQ: How old were you when to wrote your first rap? - Ker Moua\n\nA: i was 13 yrs old\n\nQ: What are your top three favorite beats? (Other than the ones you have rapped on) - Adam Lopez\n\nA: these three instrumentals that didnt make good kid\n\nQ: If you could party with any celebrity who would it be and why? - Angel Fernandez\n\nA: i would party with prince, he go bring all the woman.\n\nQ: What's your favorite tracks off Oxymoron? - Michael Hale\n\nA: the hook be like....my waaayyyyy....\n\nQ: How come when first start rapping you can't articulate what you want to say to when you get your big break your able to formulate flows - Lawrence Burke\n\nA: its not about the big break. its about work ethic!\n\nQ: how old are you? - Ongeziwe Ongieh Jack\n\nA: 8 or 80. depening on the day\n\nQ: now do you think you won they heart before you won that Grammy? - Amir Gf\n\nA: few more hearts to win, feel me!\n\nQ: Are you and Jon Connor cooking up a lyrical master piece? - Ronnie Robinson\n\nA: aftermath gets the last laugh!\n\nQ: Do you Know at what level you are? - Sizwe Nkosi\n\nA: have no clue\n\nQ: How did you develop that flow? - Adam Hodgson\n\nA: bad raps and critism\n\nQ: What is competition? - CLaudia Marchen\n\nA: glass mirrors\n\nQ: Are you planning on creating your own label in the future? - Stampede Heemz\n\nA: god willing, when im ready. shout out to cole. huge step.\n\nQ: Is there any chance you could do a track ft. Em and Tech N9ne? Just all 3 of you killin a dre beat. On some straight llyricist shit. - Ray Sauce\n\nA: thats a lot of words one track\n\nQ: Kendrick.. ma nigga. u gotta remix that Cartoons&Cereal shit'd b ill af - Bj Ibreaks'em Sayers\n\nA: one of my favorite joints still\n\nQ: Who was your favorite rapper growing up? - Shawntre Mcneil Jr\n\nA: snoop pac, dj quik,,,, mid 90s\n\nQ: When did you first realize that shit was about to blow up for you?? - Chris Tian\n\nA: when snoop took me under his wings on stage. a moment\n\nDo u have a pet lama named ya bish? - Bryan Nonis\n\nA: naw, a blue nose pit tho\n\nQ: best and worst parts of increased fame? - Noah Sheir\n\nA: A: travelling and reduced privacy\n\nQ: ''She needs me'' needs to be on the radio. Can you make that happen? - Crystal Brown\n\nA: your right... power 106 in La was playing it early on tho\n\nQ: Do you think a Mexian Rapper could ever be in TDE? - Orlando Guevara\n\nA: no question!\n\nQ: When is sing about me part 2 dropping - Kendrick Harrison\n\nA: no time soon. im always on to the next bro\n\nQ: Are you thinking about making more music with Eminem? Peace K-Dot, congratz from Portugal ! - Simäo Costa\n\nA: god willing main!\n\nQ: What is the song in your Dr dre commercial called that you were recording - David Reisenauer\n\nA: its alivvvvveeeeeee lol\n\nQ: How do you come up with your rhyme schemes? - Garrett Burrow\n\nA: i turn off the radio\n\nQ: Not a day one fan, but you and the crew got me back into hip hop. Just showing some love. Keep up the good work, bro.\n\nMy question is, Playstaion or Xbox? - Ray Mills\n\nA: Playstation tho\n\nQ: whats ya motivation? - Latasha 'Shine' Mack\n\nA: the concept of no limits"}], "artist": "Kendrick Lamar"}