{"artist": "Capital STEEZ", "songs": [{"title": "Panties Down", "album": "King Capital*", "year": "2017-12-23", "image": "https://images.genius.com/9f1a8c8f2453ef562bec24a22e116fb9.500x500x1.jpg", "lyrics": "The lyrics will be completed upon the release of \"King Capital\". Stay tuned\n\n[Rokamouth]\n[?] with money\nStay supplying all these J's, no longer just you and me\nThree way with Mary Jane, then I take it down slow\nYou know she ease the pain\nSmoke in your veins\n\n[Hook: Capital STEEZ]\n47 be them niggas you should ask around\nI just got to say the word and it's panties down\nSkirts up, panties down, panties down\nI just got to say the word and it's panties down\n47 be them niggas you should ask around\nI just got to say the word and it's panties down\nSkirts up, panties down, panties down\nI just got to say the word then it's panties down\n\n[Jakk the Rhymer]\nI broke you down quite clever, I'm tryna get together\nShe said she heard it all before, but I had said it better\nCan feel the chemistry with every seventh letter\nBut I just met her, it was late, lets set a different day\nShe on my head like a bounty, I can't shake it\nLast night, turned the studio to a spaceship\nCooking my brain like I'm skipping [?] spitting game and\nEvery time I kick with the dame, it's a different strain\n[?] psychic advancement, psycho fancy\nI like [?], life only throws you so many chances\n\n[Capital STEEZ]\nAll it took was some bubbly wine and a couple of dimes to corrupt my mind\nLuckily I'm synchronized so I knew they should be coming in time\nWho's coming inside? You plan on [?]\nPass me the jay, if you can't even wait, we can astral project to a comfortable spot\nYou love when it's hot, boosting my testosterone\nI'm sweating like a [?], her body odor is my cologne\nNever pursue her, like these dirty water is mighty cold\nIt's 747, that fly shit, you know what I be on\nSee her in the kitchen, you shinning like a crystal\nI know you got potential\nAnd girl I keep it individual\nSo can I put seeds in the middle, middle?\nCapital STEEZ in the meadow\nCan I put seeds in the middle, middle?\nCapital STEEZ in the meadow\n\n[Hook]\nCause 47 be them niggas you should ask around\nI just got to say the word and it's panties down\nSkirts up, panties down, panties down\nSaid I just got to say the word and it's panties down"}]}