{"songs": [{"year": "2015-10-28", "album": null, "image": "https://images.rapgenius.com/a0cc83eaa36dc85bc39818df061eedfc.1000x417x1.png", "title": "Behind the Walls: A Black Comedy", "lyrics": "[Corey Holcomb]\nYeah, yeah. So, y'all all curious. That's fine. That's fine, man. I'm – look, I'm a tell ya how ya boy, Moochie, landed his ass in this goddamn slammer. It was Kendrick. Yeah, Kendrick Lamar.\n\n[Prisoner]\nYeah, right. This motherfucker.\n\n[Corey Holcomb]\nThat's right. Shit was wild, goddamnit.\n\n[Prisoner]\nThis motherfucker.\n\n[Corey Holcomb]\nWe had a ball. Ay, nigga, you ain't gotta believe me, nigga. Goddamnit.\n\n[Prisoner]\nHe's just talkin' about it.\n\n[Corey Holcomb]\nMan, you ain't been in here that long. Your perm still new. So, anyways. You know what I'm sayin'? We had some strippers. They let us do everything we wanted to do, touch anything we wanted to touch. I was puttin' my finger in places, but my nail 'bout to fall off.\n\n[\"These Walls\"]\n\n[Driver]\nKill these motherfuckers. You hear me?\n\n[Back seat passenger]\nI hear you.\n\n[Driver]\nGet that money and come out.\n\n[Back seat passenger]\nMan, you should a heard what this li'l' nigga was talkin', man. Talkin' so much shit on the block. Man, I been tryin' to tell ya. He talkin' 'bout he gon' get more money than me, he gon' get more money than you. I said, \"Fuck this motherfucker, man. This li'l' motherfucker 'bout to get hit right now. Fuck him. Fuck this motherfucker right now.\"\n\n[Kendrick Lamar]\nMan, Malcolm, shut the fuck up. We gon' go in here, get the money, get out. Simple as that.\n\n[Back seat passenger]\nBut you ain't hear what he said.\n\n[Terry Crews]\nNigga, I'm a smoke yo' ass. Now you fi'n' a get smoked, talkin' shit. What, bitch? What? What? Let's go. Let's go. Come on. You're talkin' that shit. Where is this motherfucker? Nigga, fuck outta here.\n\n[Dancer]\nWhat the fuck, man?\n\n[\"Hit the Quan\"]\n\n[Terry Crews]\nPeople can get murdered. Yeah. Here we go. Yeah. Yeah. What? What? What? What? Pull him up. Uh. We 'bout to murder this shit.  Murder this. Murder that. Yeah. Murder that and this. Ha, we killin' this bitch. We killin' this bitch. We killin' it. Get the fuck up. Get your standin' on, niggas. It's a stand-on, motherfucker. Y'all ain't seen no shit like this.\n\n[Corey Holcomb]\nHey, boy. By the time I got there, I was already two bottles and three pussies-deep. [Laughs]. You hear what I'm sayin'? It was on, boy. I was barely standin' up by the end of it. Aw, yeah, it was cool, man. We was gettin' down, havin' a good time, dancin', groovin'. Everything was smooth. They was showin' your boy love. [Laughs]. But somethin' was off. I knew somethin' was wrong, man. You know, you get that feelin' sometimes. Like, when a real, cute woman is showin' you genuine love. Ay, that ain't right. But that's when I saw Kendrick out there gettin' down wit' my lady. Man, I spent the night at her house and walked her daughter to school. You know, that means you obligated to me. But I wasn't trippin' too much, you know? Like I said, I was already three pussies-deep. You know, I got respect for your boy, Kendrick, a little bit. Yeah, everythin' was cool, man. Well, shit, man, ain't nobody told me.\n\n[\"These Walls\"]\n\n[Corey Holcomb]\nI got these cops runnin' up on me 'cause I hit the back of the goddamn cop car. It wasn't my fault. I'm all ready to kick it with K-Dot and them tenders, man, and these cops sweatin' me about hittin' the ass of the car, goddamnit. I told them I hit the ass. I don't give a fuck if it's a fly.\n\n[\"These Walls\"]"}], "artist": "Kendrick Lamar"}