{"songs": [{"image": "https://images.genius.com/3e23ee9a3d502053e3229d43412c034e.500x500x1.jpg", "album": "Generation Gaming VI", "title": "Bloody Murdered Bloody Soul Bloody Suspect", "lyrics": "[Verse 1]\nMy name’s Detective Ronan O’Connor\nIn my line of work, I’m facing death daily\nBut now it’s me who’s a goner\nIn Salem P.D. of all the homicides, Lord\nI’d never say that it’d be me lying on the sidewalk\nBut whatever I thought, it’s become irrelevant\nMy skeleton’s regressing through the elements\nAnd evidently, I’m undead ‘til I seek and get the evidence\nOne foot in the grave has made me one step ahead of him\nI’ll make him taste his own medicine: the Bell Killer\nDevout sinner, I doubt we’re dealing with a swell fella\nHow did it happen? I need help with it\nThrow the laws of physics out the window, go to town with it\nI can walk through substances to suss out who the suspect is\nBut can’t discuss or talk about the subject with them ‘cause I must exist\nI’m an ethereal, pulp noir serial star\nBut this is real despite appearing immaterial\n\n[Pre-Hook]\nI can’t explain it, I’m on a hunt for the truth\nTo why my assailant made me plummet from under the roof\nSalem is a place containing hundreds of clues\nAnd my presumption is that somewhere in it somebody goofed\n\n[Hook]\nWoke up in a murder scene, a ghost interred in Purgatory\nA dude determined to determine who has murdered me\nWoke up in a murder scene, interred in Purgatory\nA dude determined to determine who has murdered me\nMurder scene, Purgatory\nA dude determined to determine who has murdered me\n\n[Verse 2]\nHow can I trust girls I find in the Dusk World?\nIts dank musty musk must just blur lines\nSlur words, disrupt and usurp minds\nA corruption of the worst kind\nBut I need all the aid that I can find\nBetween mediums and demons, I will mainly have to pry\nMaybe have to find, a shady patch and hide\nFrom their crazy appetite, I’m not a tasty snack, am I?\nI've already made the sacrifice of life\nAnd the fact is I would like to not have to die twice\nMy mind keeps rewinding back to that night\nThe facts of what happened don’t just stack up quite right\n\n[Pre-Hook]\nI can’t explain it, I’m on a hunt for the truth\nTo why my assailant made me plummet from under the roof\nSalem is a place containing hundreds of clues\nAnd my presumption is that somewhere in it somebody goofed\n\n[Hook]\nWoke up in a murder scene, a ghost interred in Purgatory\nA dude determined to determine who has murdered me\nWoke up in a murder scene, interred in Purgatory\nA dude determined to determine who has murdered me\nMurder scene, Purgatory\nA dude determined to determine who has murdered me\n\n[Outro]\nWhodunit? Who-a-whodunit?\nWhodunit? Who-a-whodunit?\nWhodunit? Who-a-whodunit?\nWhodunit? Who-a-whodunit?", "year": "2014-08-29"}], "artist": "Dan Bull"}