{"songs": [{"album": "Radio Silence", "image": "https://images.genius.com/25f545688171433c422bdbaf45bd1392.1000x1000x1.jpg", "year": "2017-11-17", "title": "Chips", "lyrics": "[Intro: Talib Kweli]\nIndie 5, Collins\nJavotti, our time, north time\n\n[Hook: Talib Kweli]\nFlatbush to Abbey Road, who got that soul?\nWe 100 on the road, 100 at home\nRose from the ruins like a Pac poem\nWe ain’t going back to the Brook without the chip\nWe ain’t going back without that chip\nWe ain’t coming back to the Brook without that chip\nWe ain’t coming back without that chip\nYou got next, we got forever, join the list\n\n[Verse 1: Talib Kweli]\nFresh from the lab like I got the cure\nNothing but the pure for the world to hear\nIt’s like gravity cause it pulled us here\nRed carpet, world premiere\nCinematic, they know the score\nInstant classic, tour de force\nI paid the price, I know the course\nI shake the dice, I know the toss\nIt’s simple really but you know it’s deep\nWhen the angel and the devil on the shoulder speak\nTwo voices, two choices\nPrepare for war or go in peace\nThey don’t believe I’m touring overseas\n“Nah, he don’t even rap about coca leaves”\nThink globally, not locally\nYou ain’t woke as me, nigga go to sleep\nThank God I’m back, this ain’t hard in fact\nThis target practice, red beams\nStanding up cause I’m man enough\nAnd then turn her on like wet dreams\nYou can wet it up, you can step it up\nYou ain’t catching up with my jet stream\nAnd I’m going too fast so I put ‘em up last\nWhy you showing yo ass? This ain’t sex scenes\nThey ain’t built to last, they bust quicker\nFast talking like tongue twister\nThese young spitters can’t fuck with us\nPardon my French like I tongue kissed her\nBack in the day they used to hunt niggas\nAnd they hung niggas for being hung niggas\nNow the guns are spittin’ when the hunger hit us\nThese young niggas like come and get us\n\n[Hook: Talib Kweli]\nFlatbush to Abbey Road, who got that soul?\nWe 100 on the road, 100 at home\nRose from the ruins like a Pac poem\nWe ain’t going back to the Brook without the chip\n\n[Verse 2: Waka Flocka Flame]\nWaka! Waka! Waka! Flocka!\nFlocka! Flocka! Flame! Hah!\nFuck that shit, this is quality trap\nY’all really thought I could hardly rap\nBetter watch ya front, better guard ya back\nEvery muh'fuckin’ bar is a heart attack\nBetter work out hard, watch your cardiac\nWhere my shawty at? Where my 40 at?\nMy shit a event, you shit a show\nNigga I could still get a brick for the low\nNigga I could still put dick in ya hoe\nAnd I’d rather die rich than live po', oh\nBusta Bust better give me some mo’\nWe gon’ hit a lick then divvy the dough\nI’ma sell again one minute ago\nI don’t give a fuck if you friendly or foe\nI need the ring, gimme the ring\nI don’t diss rappers, get in the ring\nSit in the clink before I ever sing\nYou see me winning, chips with my team (Brick Squad!)\nReal shit you gotta deal with\nBetter check the torch, we still lit\n\"Flocka, who you wanna get a mil with?\"\nNiggas I ain’t used to have a meal with\nI’m enlightened now, they frightened now\nSo excited, you like it then bite the style\nThey did it before, they’ll do it again\nI’m a motion picture, let the movie begin\nScared to hit niggas, they’ll sue me again\nGot platinum plaques, I’m a truly gem\nI’m a rudeboy, roll the doobie again\nForward marching, we moving in\nFlocka!\n\n[Hook: Talib Kweli]\nFlatbush to Abbey Road, who got that soul?\nWe 100 on the road, 100 at home\nRose from the ruins like a Pac poem\nWe ain’t going back to the Brook without the chip\nWe ain’t going back without that chip\nWe ain’t coming back to the Brook without that chip\nWe ain’t coming back without that chip\nYou got next, we got forever, join the list"}], "artist": "Talib Kweli"}