{"artist": "Bone Crusher", "songs": [{"album": "Fight Music", "title": "Take Ya Clothes Off", "year": null, "lyrics": "{Intro}\nOHHHHHHHHHH!\nBreak em off records have entered the building\n\n[Bonecrusher]\nYeah, Bone Crusher\nYing Yang Twins (Yeah)\n\nTake Ya Clothes off get bucked necked\n{*HAHAHA we ain't never scared - repeat 8X*}\n\nThis is a county park musical production yall\nLil' Smurf...this a hot one boy\n\nTake Ya Clothes off get bucked necked\n(OHHHHHHHHHHH!)\n\n[Chorus]\nEenie meenie minee moe\nTo the booty club we go\nWhere y'all boys goin?\nTryin' to go and see some necked hoes\nLike it when they touch they toes\nShake it like a jelly roll\nShake it shake it shake it shake it shake it shake it (OHHHH!)\nAnd let me see you shake it baby\n(OHHHHH!)\nAnd shake that behind baby\n(OHHHHH!)\nAnd let me see you grind baby\n(OHHHHH!)\nTake ya clothes off get bucked necked!\n\n[Bone Crusher]\nHer nickname Gyro\nA super booty hoe\nShe put that thing on you niggas 'till you lose control\nIt's a dollar rate to enter the pearly gates\nFor the sex and the love niggas gon' pay\nShe got a thing bout the way she move her body baby\nCuz she can pop that pussy till it's skeet baby\nOh she's a sexy bitch\nShe loves that hard shit\nI put a ten dollar bill in her fuckin' clit\nBut I ain't mad though\nShe take it to the floor\nThe way she bouncin' that ass let a nigga know\nOh she a pro at this\nA one-way hustle shit\nOh shake that ass baby, work for these presidents\n\n[Chorus]\n\n[D-Roc]\nFreaky bitches in the club gettin necked for cheese\nLike a girl on Sunday night off in Jazzy T\nMake the pussy breathe for Kaine, Bone Crusher, and me\nDo a magic trick you know thats what we came to see (hoe)\nBitch you make it hang low (Bitch I love that)\nCuz ain't nothin wrong with a good shakin'(I love that)\nNow do your thing baby make your ends\nNow run along and let me holla at your friends\n\n[Kaine]\nShake it like a motherfucker\nMove it like a vibrator\nShorty kinda sweet, got that sugar like a Now and Later\nHoe with them bed raiders\nOnly bout that bread makin'\nOther hoes ain't but this bitch bringin' home the bacon\nBaby boy needs you\nCuz he bout to start school\nMomma gotta work\nGotta do what she gotta do\nTake off the two -piece\nShe was down on the low\nThe Red Man ball so she went to work at 10 though\n\n[Chorus]\n\n[Bone Crusher]\nIt's the hustle man\nMoney and diamond rings\nShe gon' make sure she stackin' all the paper man\nIt's a grinder's party, 365\n7 days; She gon' make sure she stay fly\nHere's a hundred baby\nI dont need change\nJust make sure you keep movin' that thing\nI love the way the pros do it, you know that!\nYou gon' make me revert back to 7-9\nAnd to the floor with that thing baby\n(Phone Call!)Take off that bra\nTake off them draws\nGet on all 4's- do the doggy crawl\nYou so fine you gon' make me stand and applaud\n\n[Chorus]", "image": "https://images.genius.com/92770ac604729fe9a8b1f8e91150ba74.600x600x1.jpg"}]}