{"songs": [{"image": "https://images.genius.com/b494ca4151f14803123849b4f34be37f.700x700x1.jpg", "title": "Breathe", "album": "Untitled", "year": "2008-07-11", "lyrics": "[Chorus]\nIn America, you'll never be free\nMiddle fingers up, fuck the police\nDamn, can't a nigga just breathe?\nBraveheart, still QB's Finest\nGrinding, enough diamonds to change the climate\nNot only do you see a nigga shining, you can see a nigga breathe\nJewels enchanted, like they was new from Atlantis (uhh)\nCruise with the hammer, jealous hearted, can't stand him\nHaters are scandalous, damn, can't a nigga just breathe? (woo!)\nTo all my niggas getting money in the streets (yeah)\nMiddle fingers up, fuck the police\nLight up my trees, and I just breathe...\n\n[Verse 1]\nI twist 'em, baby mama beef victim\nChronic leaf hitting, all kinds of heat with him, wisdom\nFrom pot to piss in to high position\nIntense hustle, it's pain like a pinched muscle\n'Til it rains and my Timbs stain my socks\n'Til I dodge enough shots and the presiding judge slams a mallet\nAnd says life I'ma guap, then I cop\nThen I yacht, then I dock\nIsland hopping away from nightmare holders\nOr cowboy slingers, who shoot up any club\nTo see they names ring loud on some FBI poster\nMust be on X or they coked up\nSuggesting I post a, bail, I'm like, \"Yes\" 'cause we soldiers\nWe just getting older, in time, we still in our prime\nI can't afford a new arrest on my folder\nNigga, breathe...\n\n[Chorus]\nIn America, you'll never be free\nMiddle fingers up, fuck the police\nDamn, can't a nigga just breathe?\nBraveheart, still QB's Finest\nGrinding, enough diamonds to change the climate\nNot only do you see a nigga shining, you can see a nigga breathe\nJewels enchanted like they was new from Atlantis (uhh)\nCruise with the hammer, jealous hearted, can't stand him\nHaters are scandalous, damn, can't a nigga just breathe? (woo!)\nTo all my niggas getting money in the streets (get money)\nMiddle fingers up, fuck the police (fuck 'em)\nLight up my trees, and I just breathe...\n\n[Verse 2]\nI'm, fresh out of city housing, ain't have too many options\nPennies on a pension or penitentiary bounded\nPlenty Henny in me, envy was simply they trend, see\nMy enemy was every hater that was bigger than me\nThe high life, the fly life\nPierre Hardy, imitation of Christ\nIce-wear gaudy, since '94 flossy\nThe Lex was an excellent choice now fast forward me\nThe pestilence of the ghetto informed me\nAs a shorty, to push nothing less than a 740\nWith fresh linen, sip Pellegrinos with Airs on\nThey sick, mixing they water with Airborne\n\n[Interlude]\nOh, they so sick!\nLook how I got 'em going crazy, look at that!\nYou gotta let it out, stress, ain't good man\nYou gotta breathe (breathe...)\nAnd America, we gotta be free\n\n[Outro]\nBreathe...\nBreathe...\nBreathe...\nBreathe..."}], "artist": "Nas"}