{"songs": [{"year": "2012-12-18", "title": "Matilda", "image": "https://images.genius.com/8a1a25547f15c6e748c64b8b7c6f3e65.500x500x1.jpg", "lyrics": "[Verse 1 – Joseph Chilliams]\nGet caught up in a reflection like Narcissus\nMy heart is like waves with a part in it\nYou should brush up on it\nGet familiar, Joseph Chilliams kill ya\nYes he can, like Bob builder\nFirearm wielder, with a pen in my hand\nMy thoughts move you like Matilda\nPerform voodoo with diction\nThe one that flew over the cuckoo’s nest like chickens\nAm I sensing resentment? Well stop watching the lifetime channel\nCause this here is primetime ammo\nLike Janet, and the tit seen around the planet\nGet to know, like Bobby Brown and blow\nEverybody knows, like I’m in the garden growing vegetables\nCause it shows, like I bruise easily\nLosings predetermined if we need to vis-à-vis\nThe unflappable vanguard\nYou already know it, fucking with me, you better come hard (no homo)\nMaybe that was out of order\nLike this whole courtroom, but there is no justice it’s just us\nBrother\nBlack exploitation like the undercover brothers\n\n[Verse 2 – Saba]\nGet caught up in a reflection like kiddy pools\nMy art is like the babes in the video\nYou ain’t touching me (bounce that ass)\nGet comfortable, class in session like summer school\nI’m the last one standing like royal rumbles with 100 dudes\nSo who’s that? You got a hunch or two?\nI’m back like the hunchback after 300 lose (spartans)\nKing Leonidas, I’m on top of my flow like Poseidon\nPissing on everything in the water coming through\nSo find me, with a gun and [?]\nBombing bodies at parties for nothing, just because it’s fun to you\nSo turn up, turn up\nAin’t no telling where you turn up, on the furniture or furnace\nBurn ya, iron and scorch and abort this mission\nI’m sick of this like Aborigine must be pissed with location switching\nRadio station switching, please do not play that here man\nI bet they pay to see me, remake a pay for CD's\nLike screw your internet and your cable, push it to the max like beta\nSo I Dreamcast like a forecast, nigga it don’t rain it’s Sega\nVincent Vega, your diction is fiction\nI send it to you like my curtain then burp like I’m finished with him\nMe and your girl bump and grind like a pendulum nigga\n\n[Outro]\nBack up in that ass\nFor the 9 dre\nAftermath production\nMotherfucker\nPIVOT!", "album": "GETCOMFORTable"}], "artist": "Saba"}