{"songs": [{"title": "Black Is Back", "album": "Pure Righteousness", "year": "1988-06-15", "image": "https://images.genius.com/2ff29bb967f2167ea9af1a77ecb49aee.300x297x1.jpg", "lyrics": "[Malcolm X sample]\nConcerning the difference between the Black revolution and the Negro revolution\n\n[Verse 1]\nWell, I’m Black - the dominant shade, I'm an upgrade\nA hip-hop musician, so listen as I get paid\nCee Just rips the cut with the dope stuff\nCan the 45 King \"Sample a Dope Noise\"?\nSho’ ‘nuff!\nI know the ledge, over the edge I won’t fall\nThis rhyme was designed for The Final Call\nWe got to struggle and fight against apartheid\nWho are these people telling us where to live and die?\nI’m sorry to say, but one day we are gonna die\nI don’t know about you, but I’m here, and I’m gonna try\nTo make the Black man understand that we can\nGet the Qur’an back in our hands in the Motherland\nYou say it’s gonna be hard, but I’m god, I got the proof and truth\nAnd now it’s time to get loose\nSpread my Wisdom, educate the people\nForget these Divine Evils\nJust leave them- the hell alone\nPick up your telephone\nDial some positive brothers so they can join in\nAnd come along\nPeace unleashed upon Minister Farrakhan\nFor preachin’ and teachin’ the truth\nTo the deaf-and-blind\nWith negative brothers, you know Shabazz don’t bother\nMost brothers strive, but I strive harder\nThese are Actual Facts, the dominant Black, I’m right and exact\nI came to tell you my brother\nBlack is back\n\nBlack is back!\nConcerning the difference between the Black revolution and the Negro revolution\n\n[Verse 2]\nSee, I’m real, rougher\nI had enough a’\nYou poppin’ off at the mouth, so Midas-ize that muffler\nThe hype, I don’t believe the white\nI do conceive, imagine\nWhile you’re gaggin’, smoking’ weed\nBlack man from Asia, I will amaze the\nCrowd, kick it loud boy, this is not a déjà vu\nWho in the world is gonna stop me?\nYou, you souped-up sucker? You slip and you’re sloppy\nRhymes are retarded, separated, departed\nFrom real to unreal - don’t get me started\n‘Cause once I start unleashing my talents\nPeople take a vote - so place your ballots\nNine times out of ten the god will win\nHear some boos - I lose to you, tell me how you’re livin’?\nYou must be livin’ like a snake in the grass\nMy name is La, I’m descended from the Tribe of Shabazz\nI am original, critical, you wanna hear a lyrical\nMenace, when it’s battle, go against me? I pity the fool\n‘Cause fools are those who oppose the right way\nThe rules are chose, don’t go, nobody knows, I might stay\nHere to endear, persevere with my skill\nI'll drill with science of self inside your head\nAnd then I’ll build a strong foundation\nNow tell me if I lack\nI came to tell you, my brother -\nBlack is back!\n\nBlack is back!\nConcerning the difference between the Black revolution and the Negro revolution"}], "artist": "Lakim Shabazz"}