{"artist": "Bow Wow", "songs": [{"album": "The Price of Fame", "title": "Damn Thing", "year": null, "lyrics": "[Intro]\nYo, you ever be out and see somebody\nThat you want right then and there?\nYou know when they feel like talkin'\nYou just wanna walk right up to 'em and be like\n\n[Refrain: Bow wow and Da Brat]\nHey shorty, what I gotta do? Say what?\nTo get one night with you, one night\nI ain't tryna play no game, is that right?\nI'm just tryna do to the damn thang\n\nHey boy, first lemme say, what up?\nIf I ever let you play\nYou never would leave, you'd wanna stay, why?\n'Coz I'm known for doin' my damn thing\n\n[Verse 1]\nPump no gas liquid in this young fly mister\nI could turn a Honda to 745 whip\nShorty, if I ride wit you, that would be a nice picture\nIf somebody say cheese, they talkin' 'bout me like hey\n\nNo holla back, though I got a lotta that\nI could have you in some True Religious, Louis this, Gucci that\nShake what she gave you, your momma would be proud of that\nOnce I get you back some, you ain't gon' know how to act\n\nYou on fire, oh I think I, oh I think I like ya\nBoy, I think I, boy, I think I might just\nLet you hold the Lambo, let you ride the Coupe\nSpin rubberband banks, girl, tell me, tell me\n\n[Refrain: Bow wow and Da Brat]\nHey shorty, what I gotta do? Say what?\nTo get one night with you, one night\nI ain't tryna play no game, is that right?\nI'm just tryna do to the damn thang\n\nHey boy, first lemme say, what up?\nIf I ever let you play\nYou never would leave, you'd wanna stay, why?\n'Coz I'm known for doin' my damn thing\n\n[Verse 2]\nI see you runnin' 'round with these regular cats\nI was just thinkin' to myself you could do better than that\nI'm so ahead of the pack, be normal [Incomprehensible]\nThat's how you say what you spread in the back\n\nLike hey shorty, what I gotta say?\nWhere I gotta take you, what I gotta pay?\nEven it's for a night or if it's only for a day\nI promise Bow won't bite, Bow will behave\n\nEven though you on fire, oh I think I, oh I think I like ya\nBoy, I think I, boy, I think I might just\nLet you hold the Lambo, let you ride the Coupe\nSpin rubberband banks, girl, tell me, tell me\n\n[Refrain: Bow wow and Da Brat]\nHey shorty, what I gotta do? Say what?\nTo get one night with you, one night\nI ain't tryna play no game, is that right?\nI'm just tryna do to the damn thang\n\nHey boy, first lemme say, (what up?)\nIf I ever let you play\nYou never would leave, you'd wanna stay, (why?)\n'Coz I'm known for doin' my damn thing", "image": "https://images.genius.com/aaeccb678c5c9313bc6b49f17af6c3b4.1000x1000x1.jpg"}]}