{"artist": "Ace Hood", "songs": [{"title": "December 31st", "album": "Starvation 2", "year": "2013-01-10", "lyrics": "(Dj Khaled Talking intro for 1:21)\n\nTake a look into my eyes\nAnd just tell me what you see\nTell me do you you see the beast\nThey wanna let me off the leash\nWay too many of them niggas sleep\nI spit fire third degree\nPussy niggas dont wanna believe\nOn my momma they gon see\nGot the hottest flow, and im honest though\nFuck witha nigga be modest for\nMy concsious know im kinda dope\nSomebody let them bloggers know\nThey dont wanna let this problem in\nEvery year is my time again\nUnderrated they contemplating\nI'm top 5 in they conversations\nThey heard the people been hating on me\nOh well nigga, whats new?\nStill riding in a maybach\nAnd they face mad when I came through\nThese niggas hate that I made it\nGotta make a way for my baby\nMy momma crying in that other room\nAnd them tears were falling, I hate it\nNext day I made me some change\nMan up nigga no complaining\nDaddy left my younger stages\nAin't no choice I had to make it\nWill not quit, and I will repent\nAnd I won't consent, with a nigga who snitch\nCoupe no top it dont make no sense\nLike a nigga who broke it dont make no cents\nJust stay friends in a whip no tint\nAnd that rolex glist oh boy they pissed\nYall fuck boys do make me sick\nYour bitch blow me, C4, tick tick!\nAnd I got this shit, Khaled I got em\nHe going to war, standing beside em\nYou gon need army! You gon need navy!\nYou gon need soliders! Maybe OBAMA!\nIt's that W-E, T-H-E, B-E-S- carry the T\nNone of you niggas dont matter to me\nSlaughter ya feature, just slaughter your beat\nFeed me rappers, bon appeite!\nNiggas be trippin, them choppers will speak\nCame for the war, no longer the peace\nTime for the blind and be able to see\nNone of these niggas is ain't nothing like me\n24 years ain't get no sleep\n26 inches on my jeep, feeling like shackles on my feet\nKnow the day that they let me free, Yall in trouble O-M-G!\nPlease oh please nigga pray for me!\nKilling this shit boy, RIP!\nI'm back with a B and a mac on me\nIn the back of the jeep yall looking for me!\nCapital A ! Capital C ! Capital E !\nH-double O, D\nFree my niggas till they all get free!\nRep my city, gotta rep my team!\nBroward county President\nThats that shit that I represent!\nQuarter mill for that whip im in\nPussy boys I never mind they diss\n80 thousand thats on my wrist\nTake your chick and I make that bitch\nHit the dick, then take a flick\nSend that shit, you'll have a fit\nL-O-L im outta state\nYoung nigga tryna get filthy rich\nIm outchea, better bring your voucher\nBetter call your counsler, shit get real\nWanna think im coward? Oh I ain't bout it\nNow your family, is pushing flowers tears to your momma\nHeard it got em, never want that drama!\nNever want that drama ohhh Lord!\nI pray the world dont end in January\nDecember 31st I made obituaries!\nAll you niggas sleeping, meet the cemetery\nAll you niggas sleeping, meet the cemetery!!\n\nStarvation...\nStarvation...\nGod Bless this proud Nation... Two\n\nOutro\n(Obama Speech)\n\n\"If there is anyone out there that doubts its been a long time coming but tonight, tonight, is your answer!\"", "image": "https://images.genius.com/a8ccf68732bfc41deafb0b2d7ab2be48.500x500x1.jpg"}]}