{"artist": "Apathy", "songs": [{"title": "Can’t Leave Rap Alone", "image": "https://images.genius.com/b57752a92a71efe68eafb568aa250d5b.800x792x1.jpg", "album": "Eastern Philosophy", "lyrics": "[Verse 1: Apathy]\nYeah...\nI'm like a '88 classic, Apathy goes back\nTo Filas with straps and Don Mattingly throwbacks\nI'm back bitch, on some asshole rap shit\nRarely ever seen like Asian dudes with black chicks\nYou muthafuckas wanna scrap? Be quiet!\nYou know when Apathy drops, you happily buy it\nAll these cats are a riot, wanna rap, so they try it\nBut'll quit as quick as Ruben Studdard on the Atkins diet\nI ain't the type to blow scratch on tricks\nSlap tricks in the trap if teeth scratch the dick\nChicken's in the kitchen makin' chicken from scratch and shit\nCheck it, Chum's on the track with the scratch and mix\nY'all don't even understand who you scrappin' with\nI got Timbs in the trunk, won't scratch my kicks\nY'all are brewin' up a plot, tryin' to get Ap to flip?\nDo yourself a favor - scratch that shit, cause...\n\n[Hook]\nEven though muthafuckas tryin' to see me...\n\"Can't leave rap alone, the game needs me\" [- Jay-Z\nThe way I think, I make it look easy\n\"Can't leave rap alone, the game needs me\" [- Jay-Z\nYou got doubts, but please believe me\n\"Can't leave rap alone, the game needs me\" [- Jay-Z\nGo ask your mom to cop this CD\n\"Can't leave rap alone, the game needs me\" [- Jay-Z\n\n[Verse 2: Celph Titled]\nThe Rubix Cuban's at your door, but I ain't singin' no carols\nI'm like Donkey Kong, I got you niggas dodgin' my barrels\nDon't give a fuck where your label's from\nWe runnin' up in your office, holdin' your CEO hostage with a staple gun\nAnd ain't no stoppin' this don; I got soccer moms\nPuttin' Glocks in their palms and wildin' out to opera songs\nBlow off your brim, turn your fitted to a kufi\nI'm like Ricky Ricardo except, \"I Love Uzis\"\nWhen I'm in the crowd, these rappers are shook\nThey won't stage dive unless they got a harness with a grapplin' hook\nDamn right, my raps are real ill\nThe Celph Titled talkin' doll says, \"Kill, kill\"\nOh, you's a tough guy, sayin' that you brawl in these fights?\nBut you got your nose broken by a white bitch from a volleyball spike\nOld timers ask me where I got my pimp game from\nCause I got 99 bitches and ain't a problem with one\n\n[Hook]\n\n[Verse 3: Ryu]\nI'm the one to call when your third verse is free\nSlip slugs in a pump and disperse emcees\nSix gunner with a potty mouth, spittin' up mud\nI stay trippin' with a 40 oz., sippin' them suds\nOutta Cali with a bang, bitch! Fuckin' insane, bitch\nThe man savin' L.A., forget about Game, bitch\nI never claim Crip, but I'll murder my language\nIf I can't handle it quick, I'll have it arranged then\nLast nine summers, you been suckin' the same dick\nBut Jay's gone, and I'm still fuckin' 'em brainless\nAt the Holiday Inn, my Doc Holiday grins\nA little too much for one, so I'll probably get twins\nLet the party begin, take it back to the telly\nYour body is doper than coke, but your crack is smelly\nAt the show, they was rippin' all their panties and bras down\nThey love it, cause officially I'm one of the 'godz now\n\n[Hook]", "year": "2006-03-21"}]}