{"songs": [{"year": null, "image": "https://images.genius.com/15624b4dce6b2d79919cdb6d2afbada5.325x325x1.jpg", "title": "Smile in Ya Face", "album": "The Black Rob Report", "lyrics": "They smile in ya face, but they ain't lovin you\nTurn your back, they tryin to break your J-A-W\nWho a nigga on the run, eatin P.O.W.s\nStrapped with arrows, and the chrome b-o-w?\nIt's no act yo, no\nThis chick can keep my dick between her cheek and gums, like tobacco\nOn the F.D.R. doin like 90 a pop\nFuck five-0 niggas too grimey to stop\nAll we came to do was tear up the spot\nThink we care if you, you, you, roll behind us or not?\nI'm the one man army, the one hand on the tommy\nIf you standing next to me, one hand on your mommy\nYour arms too short to box with Rob\nSwipe your face like the Bad Boy corporate card\nA lotta shit I do is off the hard\nAnd I be like shhh, thats why the Feds dont wanna talk to Rob\nYall had to go force the god, naw I ain't got nothin to prove\nAin't gotta carry the two, see my daddy told me bury them fools\nAnd remember this rule: don't fuck with niggas that ain't fuckin with you\nSo when you're home with nothin to do\nJust get comfortable, cause they ain't doin nothin to you\nAnd they can take it like they wanna take it, I ain't just a rapper\nCertified Harlem knight, Mister Will-Bust-A-Cap-er\n\nHeyyo, one two three, to get to them you got to get through me\nAnd its the Bad Boy family tree, like I said we gonna do this shit, nonstop\n\nAnd my sole purpose is makin you dance\nLadies scream \"Blackie, Blackie gimme one more chance!\"\nNow she backstage hand in my pants\nI been tryin to tell myself, I gotta stop fuckin my fans\nLike Mi-chelle, uh, my belle\nSucked my dick so well I took her on tour, bitch was so raw\nNice tits, fat boomty, ak, y'know what I'm sayin?\nPassed it off to Puff and Loon, wit no delayin\nThe average nigga walk around here sad\nGet the chronic now he honest he gon' bust that ass\nGet home, she ain't there, bitch musta mashed\nAnd she caught you for furs and your jewels and cash\nShoulda known it\nMe, I could never condone it\nBum bitch walk around my shit like she own it\nShe got some bitch niggas involoved, they be in cars\nThat used to shoot dice in back of the ?m rob?\nAll praise due to them papers, got me watchin my neighbors\nIf I dont know you do me no favors\nAnd thats comin from the horses mouth, reppin east west and south\nNigga front we airin him out\n\nOld timer said \"Don't leave the label 'til you're paid\nAnd hold yours down from the cradle to the grave\"\nSharp as the cut the barber gave you with the shave\nHandgun, but you harder wit the gauge\nSo go ahead front for us, we savage\nIt's war, consider this collateral damage\nAnd we even did some joints in spanish\nWe control the entire zone and punks sayin ?bi amon?\nThat explains why I'm not home\nThat explains why I'm low, in videos I'm not shown"}], "artist": "Black Rob"}