{"artist": "Fat Joe", "songs": [{"year": "2001-12-04", "album": "Jealous Ones Still Envy (J.O.S.E.)", "image": "https://images.genius.com/4a7618aab6a23480b8790a58ffad66c8.1000x1000x1.jpg", "lyrics": "[Fat Joe]\nWhoa, whoa, whoa\nAll you frontin-ass niggas\nCallin all frontin-ass bitches, hahahaha!\nYo, get the hell on with that (say what, say what what?)\nGet the hell on with that (say what, say what what?)\nYo, yo, yo, yo\n\nWhy you over there lookin at me, while my girl standin there?\nThese bitches actin like they never seen a millionaire\nFeel my pockets, wanna really get your hands in there\nNow what it be like?\nYou confused man, that shit don't even seem right\nHow you cats on your album only three mics?\nLike 'Pac shit is funny to me\nAll you niggas livin bummy wasn't fuckin with me\nNow nigga get it on, soon you be dead and gone\nShorty got a bubble all she need the silicone\nLove my A-T-L bitches, pay my bail bitches\nType to let you fuck but never tell bitches\nDown-ass hoes that'll grind that dough\nCatch me with another chick and beat 'em down to a pulp\nIt's the F-A-T, to the, J-O-E\nDrink Cris' with the Feds when they come for me\nNo cuffs, no guns, they respect a G\nNumber one with a slug, what you expect from me, huh?\nAre you serious?\n\n[Hook: Fat Joe]\nIf you see a nigga frontin fake shit on his wrist\nWalk around all night, same bottle of Cris'\nGet the hell on with that - say what, say what what?\nGet the hell on with that - say what, say what what?\nIf you see a bitch frontin in her best friend's clothes\nNew sass weave and fucked up toes\nGet the hell on with that - say what, say what what?\nGet the hell on with that - say what, say what what?\n\n[Armageddon]\nNow all my ladies put your hands up\nNah mami, if you fuck for dough then you's a ho\nAnd no I'm not the one that don't drop the notes\nI only ice the beef and rock the coat\nThink you gettin somethin from me your thoughts are broke\nMight get a little wheeze and a salty throat\nSo get the hell on with that, don't you even feel it\nGet the hell on with that, I'm aight I'm chillin\nChicken neck-ass bitch tryna palm the dough\nShould've charged me at the door, I woulda let you know\nCoulda saved you a mouth full of head y mo'\nCoulda made you a thug from the guy with the mo'\nBut yo, I ain't never met a chick that was innocent\nThey all fuck some, eat some, never kiss\nI know a lot that got skeed on and that was it\nSee me in the video like, \"Bitch is suckin dick!\"\n\n[Hook: Fat Joe]\nYou let him in at one time cause you thought he was fly\nNow you see him at the clubs, he don't pay you no mind\nGet the hell on with that - say what, say what what?\nGet the hell on with that - say what, say what what?\nYo, every time you smoke, dude puff your 'dro\nBut when it's time to go cop, he ain't got no dough\nGet the hell on with that - say what, say what what?\nGet the hell on with that - say what, say what what?\n\n[Ludacris]\nLudacris be the number one street - clown wishin 'em luck\nCause I'm bout to make 'em break a leg thinkin I'm givin a FUCK\nAnd you catch a beat - down, bottles is breakin, craniums crack\nChairs thrown when the heat is attacked\nAnd you hear the street - sound, hitters and runners\nKillers and gunners, winter to summer the niggas that want us\nAre headed East - bound, trouble in West other than South\nCover your chest, they cover your mouth\nI'm goin deep - down Dirty indeed, birdies in need\nThirty degrees and you heard it from me\nBut I'm bout to reach - 'round grabbin my gun\nThey scatter and run but I'm handlin and havin some fun\nThey gotta keep - rounds up under the bed, up under the spread\nIf it ain't then it ain't, no wonder you dead\nSo go to sleep - now, throats is splitted\nAnd folks that get it they gotta get the hell on widdit, BIATCH\n\n[Hook: Fat Joe]\nYo, yo, all these niggas that claim thug like they're the type\nBut when it's time to go to war they runnin for dear life\nGet the hell on with that - say what, say what what?\nGet the hell on with that - say what, say what what?\nGot this clown runnin around like he's my fam\nWe did time in what joint? I don't know you man!\nGet the hell on with that - say what, say what what?\nGet the hell on with that - say what, say what what?\n\n[Fat Joe]\nYeah, haha, T.S., Terror\nGet the hell on with that, get the hell on with that\nYeah, Charlie Rock L.D., uhh\nTon' Montana rest in peace, 2001\nGet the hell on with that, get the hell on with that\nYeah..", "title": "Get the Hell On With That"}]}