{"songs": [{"year": null, "image": "https://images.genius.com/15624b4dce6b2d79919cdb6d2afbada5.325x325x1.jpg", "title": "Watch Your Movements", "album": "The Black Rob Report", "lyrics": "Lights, camera\n\n[Verse 1: Black Rob]\nYour man Black on the rise\nAddress the lies as those who plan my demise\nThrough the white man's eyes, I came through with guys\nThe same guys who gave the whole hood pies, this was back in '95\nHow the lame dudes lie\nTalking about how I changed my strive, when I was locked inside Brothers identified\nUnderstand they only getting three tries, then the heat gon' fly\nNow it's me, you and I\nTop of the world, but it's still do or die, can't wait for you to fry\nAs I scream \"bye, bye\"\nI notified, personified, who am I? The occasional fly?\nMr. Fourth of July\nSometimes Mr. Shoe, Shirt and Tie\nGet the loot, hit'em high, big sevens slurve by\nAnd people like it's the nerve of I\nNothin' worse than I\n\n\n[Hook: Akon]\nI came home from doin' time, it's do or die, ain't losing\nI've been roaming through and wide ??? just cruising\nThinkin' 'bout these goons alive, but the truth is I ain't losin'\nAin't no time for you and I, so you better watch your movements\n\n\n[Verse 2: Black Rob]\nMr. Unorthodox\nPlus we got the weed on lock, couple C's gon' pop\n? in the drop\nWe comin' through with some brand new drop\nDope phat, don't stop\nThis is serious knock\nThe workshop is so hot, honeys rockin' their pants\nNo tops, and we hit the whole flock\nNext year, anticipate it like Pac\nY'all the laughing stock, with the strength of an ox\nI locked down a couple blocks up top, and let my young gunners rock\nMakin' sure your head bop\nThe same cat that took your watch, the same cat that went to war with Ed Cox\nThis is just another notch\nFamily, the bars rep for those who drink bourbon instead of scotch\nMan, just give me my props\nI'ma invest in the stocks\nPlus turn back the hands of the clock\n\n\n[Hook: Akon]\n\n\n[Bridge: Akon]\nI got locked for moving crops all day\nCircle blocks in a different drop all day\nThe fat not made them watch all day\nAnd they still couldn't deal with me\nAnd now I'm home, it's still hot all day\nOn the block where they toting Glocks all day\nAs long as the shots don't rock my way\nThen they won't have to deal with me\n\n\n[Verse 3: Black Rob]\nSince the day of my birth\nI was comin' up the worst, snatch the purse\nPut my hand up her skirt, put the body in the earth\nThen I thought what's it worth\nNow forever, I'm cursed, I'm cursed\nBowin' down in the church\nTryna' pray to stay away from the hearse\nAnd away from the nurse, make my rap thing burst\nMan, this is for the fans, fans who slam dance like Fred Durst\nUnderstand it's my turf\nSo put your boys in reverse, before I have to call ? to do work\nSittin' high on your perch\nSee, I came from the dirt\nNo name in the game, I'm the hurt\nThis is just another perk\nIt's for those puttin' out that street shit, come through with that jerk\nCertain words I blurt\nFam, you can get a price on your head\nThen some holes in your shirt\n\n\n[Hook: Akon]\n\n\n[Bridge: Akon]"}], "artist": "Black Rob"}