{"artist": "Boogie", "songs": [{"album": "Thirst 48", "title": "J#m#sh#", "year": null, "lyrics": "[Intro]\nThirsty\nThirst 48\nThirst 48\n\n[Verse One]\nWhoa, you ever seen a blessing?\nShit, I seen a blessing\nFirst time I seen Jamesha as a freshman\nMan, I know that she could tell by my aggression\nI was on it, yeah, I was on it\nAnd really, I was tryna own it\nAnd you know that you be killin’, I condone it\nSilly how you had me caught up in the moment\nLike how long you been a quarterback?\nHike a trail for a tour of that\nTryna find where they pull you at\n\n[Interlude]\nThirsty\nThirst 48\n\n[Verse Two]\nAnd you get better as the time pass wit yo fine ass\nThought yo mama was a wine glass, then our minds crashed\nWe was on the same road, thought I showed you\nYeah, dammit, I thought I showed you\nIf you ever break down, you ain’t even gotta worry\nI’ll be there like triple-A, I thought I told you\nAnd you know the saying’s so true\n“The best friends make the best couples”\nLet’s weigh more, get the best muscle\nOr stay friends, it’d be less trouble\nAnd I ain’t never hit that end zone\nCause I been stuck up in that friend zone\nAnd you the type that need commitment\nAnd I ain’t really with it, it ain’t nothing that I’m bent on\nShit, but I was on it, think that was only for the moment?\n‘Cause you gotta understand, as a man\nChasing you ain’t in my motherfucking plan, Thirst 48\n\n[Interlude]\nThirst 48, Thirst 48, Thirst 48\n\n[Verse Three]\nDiscussion with the homegirl\nNow I’m crushing on the homegirl\nLet me stop lusting for the homegirl\nReally, we both stuck up in our own world, thirsty\nHuh, I’m fucking with the homegirl, she fuckin’ with me back\nI’m fucking with the facts, when you stumble on a crack\nGet it? If we try and we fail then we start to hate each other\nWe get nothing out of that\nYou stayed up on my side, I never left your side either\nA nigga take over, I’ma have to try ether\nCall me by my government ‘cause you ain’t like it either\nI see it, shit, I think I might need ya\n\n[Interlude]\nThirsty\nToo thirsty\n\n[Verse Four]\nIt’s never “fuck you,” girl, you know I fuck with you\nI pray if I hit that I never do miss you\nFunny how these other niggas really don’t get you\nNever call ‘em “bro” unless you really do assist ‘em, my nigga\nAnd that’s why I was on it, really, I was tryna own it\nIt ain’t a lie, you can quote it\nThe reason I was caught up in the moment\nLike how long you been receiving?\nTell me where the fuck this leading\nTell me if you really need it, shit\nI swear your words won’t offend me\nJust know your street never empty\n‘Cause look, we was on the same road, thought I showed you\nYeah, dammit, I thought I showed you\nIf you ever break down, you ain’t even gotta worry\nI’ll be there like triple-A, I thought I told you\nAnd you know the saying’s so true\n“Good friends turn to great friends”\nA risk we ain’t tryna take then\nIt’s better off that we stay friends\n\n[Interlude]\nHoo\nThirst 48, Thirst 48\nYeah, uh\n\n[Coda]\nBut that’s why I was on it\nReally, that was for the moment\nCause you gotta understand, as a man\nChasing you ain’t in my motherfucking plan, Thirst 48\n\n[Outro]\n(Daddy, why you so thirsty, bruh?)\nYou thirstier\n(No, you thirsty!)\nYou thirsty!\n(Don’t say thirsty!)\n(Thirst 48)", "image": "https://images.genius.com/967988d72ade953e4d1121eb78757aa7.1000x1000x1.jpg"}]}