{"songs": [{"album": "Shut Up And Rap", "image": "https://images.genius.com/22af45710b74abb23f51b1a75a855114.1000x1000x1.jpg", "year": "2014-12-09", "title": "Can’t Take It Anymore", "lyrics": "[Intro: DJ Doo Wop]\nWhat's poppin', y'all? This the DJ Doo Wop! I'm in the buildin' with 3 hungry emcees that's 'bout to go in! First up reppin' Boston, Mass, he stay schemin'! Ayo Chilla Jones, set it off playboy, come on!\n\n[Verse 1: Chilla Jones]\nCan't take it anymore, you better recognize\nThese pupils is cornier than ever so I'm wreckin' eyes\nPushin' up on the top spot, it's Texas size\nThey flow plain and that's why I won't let it fly\nTerm on tour out in Europe\nSchoolin' me on the game, like look at the scoreboard, homie you're up\nYou're badder than every batter swingin' out Europe\nI guess I gotta floss now\nEvery battler get a loss now\nGot every major city screamin' \"Boss Town\"\nCheck the news, and respect the views\nI'm fire, just set the fuse\nI'm a guillotine, extra sharp\nTryna get ahead so you're next to lose\nYou can't overlook me, when leagues overbook me\nMe afraid? Them cats kiddin', I ain't close to pussy\nNever showin' fear, so quote it clear\nCall me Chipper, cause Jones been brave his whole career\nI can't take it\n\n[Interlude: DJ Doo Wop]\nDamn! I told you I'm in the house with 3 monsters! Straight up! DJ Doo Wop! That's how we do this right here! Next up, reppin' that Murder Ave Gang! Yeah! Straight out of Brooklyn, New York, we top tier battlin' right here, baby! Ayo Cortez, you ready to catch a body, my dude? Brooklyn what up!\n\n[Verse 2: Cortez]\nLet me talk my shit though!\nRims crackin' through the potholes\nRaised with them [?]\nTriple beam scale, saran wrap, blindfold\nRe-up, guapo, this cheese, not yours\nInspired by the game, I'm yellin', \"Free El Chapo!\"\nI'm street smart, nah I don't know what your mans think\nIdiot, should diary: Anne Frank\nRespect is much more than just a handshake\nI'm starin' still [?] 'til I can't break\nBoss B, off of my hand, but never force me\nI'm no angel, handin' out wings if niggas cross me\nI'm grindin' on the wake-up, let it sit by the coffee\nRevenge bittersweet, that's why these niggas be salty\nI'm smokin', gettin' high, started thinkin' dollars\nAnd I moved up, 3 O's and started thinkin' commas\nYeah I'm from the zoo, nigga's packed with them llamas\nGotta keep it a buck, I wouldn't change for Obama\nCan't take it\n\n[Interlude: DJ Doo Wop]\nWow, say it though - Cortez goes in, baby! Up next though, [?] brother, reppin' that Lawrence, Mass! Reppin' that ST Squad, what up! Reppin' Show Off and all that! He calls himself the Super MC! Termanology! You ready, playboy!? Bounce on the twin, just bounce on the twin!\n\n[Verse 3: Termanology]\nI'm the greatest, got two lasers like Darth Vader's\n45 with an Inf beam that's calibrated\nGive it a little kick, it'll open your soul\nAnd let the vultures pluck the eyeballs out of your skull\nFuck a collab, I could get you snuffed on the ave\nBucked and then stabbed, pistol whipped and stuffed in a cab\nYou a small guy, spreadin' all them immature lies\nMake me wanna pull a Joker, stab this pen in your eye\nI hate you like I hate cops, chase you down for 8 blocks\nHit you in the stomach and have you burnin' like straight shots\nMake me wanna spray shots, snatch ya Rollie, take clocks\nIt's gettin' out of hand, this time, you know, take it off\nRun it, the last one you would think of done it\nCause you changed over them dollars, couldn't keep it a hunnit\nGive me patience, 'fore I pistol whip his fuckin' face in\nAnd use the blood for my lil' daughter's face paintings\n\n[Outro: DJ Doo Wop]\nDamn, slow down Term! The mic is officially dead, rest in peace to the microphone! Tonight I told y'all I was in here with straight monsters! Real emcees, baby, Boston, Mass! Brooklyn, New York! Lawrence, Mass! Y'all was representin' so beautifully tonight! DJ Doo Wop, I'm signin' off right now - I can't even say nothin' else, man. This is crazy, this the new hip hop!"}], "artist": "Termanology"}