{"songs": [{"year": null, "title": "Say Yes", "image": "https://images.genius.com/e419c674f3606427aa03bb9748a8b873.360x360x1.jpg", "lyrics": "(Intro)\nYo, lets get it popping up in here yo\nYeah, there it go\nYeah, thats what I was lookin' for\nAyo, check it out son\nIm'ma show these cats how we do it\n\n(Verse 1)\nBefore we did raps, we did kidnaps\nMurders, muggings\nCousin, what you know about thugging?\nWhen y'all niggas be out clubbing\nI be deep in discussion tryin'a convince my little cousin not to blood in\nKeep love for the Pimps, Lucky he got another buck in\nDamn shame his motherfuckin' baby mother cluckin'\nShe be out with some coward that ain't about shit\nRumors say she put out quick for not even an outfit\nNowadays everybody riding or dying\nWe own this game, stop tryin'a buy in\nFrontin' like you pop iron, stop lyin'\nI'm a nigga so ill I punch Math and then drop Science\nSaigon, the man with the 2 brains and 3 hearts\nSwift enough to build with retards\nRap epitome, academically street smart\nThat ain't even the deep part\nMe and my men end every fight that we start\nIf I ain't one of the lot of you, the stacks is unstoppable\nOn as long as Macks poppable, Cracks is choppable\nIf its logical, I'll body you, beat the shit outta you\nGo to your Wake and beat shit outta whoever says \"Bye\" to you\nThis is what I would do, and if you was me? you'd body you too\nCause you'd hate a bitch nigga like you\n(Word to mother nigga, if you was me?\nNigga you'd fuckin' put 1 in your brain too nigga)\n\n(Chorus)\nIf you be living for death and dont be giving an eff\nThen hit a pig in the vest and say yes (yes!)\nIf you be puffing the cess and laying sunk in the S\nThen punch a punk in the chest and say yes (yes!)\nIf you a gangsta, hustla, thugsta that bust slugs\nNigga that dont trust hugs, and dont fuck with the bustas\nHold a blunt in your right and raise your left\nYou blessed so you should just say yes (yes!)\n\n(Verse 2)\nAyo they trapped me in this violent enviroment\nBlocks so hot, they need to fire the cops and hire some Firemen\nThugs get forced to early retirement\nIf they blaze your head, you made your bed, nigga, now lie in it\nNeed to stop denying it, pressure? you ain't applying it\n1 nigga get mercked, look at you on some cryin' shit\nYeah I cried when I see my little nigga get murdered\nNot cause he died, but cause the shit looked like it hurted\nAnd I'm a nigga that's observant\nI seen the bullet when it first hit, his face when it first split\nAnd still no longer than 20 minutes later\nI'm on the same block, same Glock, with the same pen and paper\nYou analyze an innovator\nS to the A to the I, show niggas what men are made of\nBefore you see me in The Source, you'll probably see me in the paper\nFor poppin' a cop or dockin' shots at a women raper\n\n(Chorus)\nIf you be living for death and dont be giving an eff\nThen hit a pig in the vest and say yes (yes!)\nIf you be puffing the cess and laying sunk in the S\nThen punch a punk in the chest and say yes (yes!)\nIf you a gangsta, hustla, thugsta that bust slugs\nNigga that dont trust hugs, and dont fuck with the bustas\nHold a blunt in your right and raise your left\nYou blessed so you should just say yes (yes!)\n\n(Verse 3)\nAyo, you knew I'm better than you\nFront, get a few embedded in you\nJust cause I ain't have nothing better to do\nSee what this Beretta will do?\nTurn a perfectly functioning human being to a veg-et-a-ble\nWe wettin' you from your head to your shoe\nYo the only attention you gon' need now is medical dude\nAnd if the shotty pops you, fuckin' coroners will body box you\nCall the guy that I bought to Karate chop you\nTo hell with ya crew, you be spittin' that shit thats not true\nMy niggas have lived and died for this shit since Junior High School\nFunny how rappers talk out they ass but ain't about shit\nSo I set 'em on fire and use gas to put it out with\nThey cowards, talking bout they 'bout it, but we doubt it\nThe rhyme won't make you a thug, nor do fatigue outfits\nWe box, nigga we plots tempers shorter than Ewoks\nLace the Reeboks, chase you three blocks then *Gunshot noises*\nUnload 33 shots biaaaaaaatch\n\nLittle faggot, stupid motherfuckers in the game\nYo yo, I rep for real niggas son\nYou know what type of niggas I rep\n\n(Chorus)\nIf you be living for death and dont be giving an eff\nThen hit a pig in the vest and say yes (yes!)\nIf you be puffing the cess and laying sunk in the S\nThen punch a punk in the chest and say yes (yes!)\nIf you a gangsta, hustla, thugsta that bust slugs\nNigga that dont trust hugs, and dont fuck with the bustas\nHold a blunt in your right and raise your left\nYou blessed so you should just say yes (yes!)\n\n(Outro)\nWord is bond son, I told y'all like 15 thousand years ago\nThat niggas was coming back for that shit\nThat real niggas was gonna re-emerge and take fake niggas off the map\nAnd now that time is here baby, its 2K", "album": "The Best of Saigon A.K.A. The Yardfather Vol. 1"}], "artist": "Saigon"}