{"artist": "Knoc-turn’al", "songs": [{"image": "https://images.genius.com/4c50173e2bd3fb16450053d6e2eac177.500x500x1.jpg", "title": "The Knoc", "year": "2002-02-19", "album": "L.A. Confidential", "lyrics": "Whatchu want?\nWhatchu want?\nGet off me\n\n[Knoc] I pull quick, it's useless\n[Knoc] I'm fully clipped, 6 fo' fully dipped\n[Knoc] Throw chrome whip with three freaks and full hips with firm tits\n[Dr.D] Yeah we fully chipped, been on gangsta shit\n[Dr.D] It's ruthless, drunk off two fifths\n[Dr.D] Who make hits? (Dre)\n\n[Knoc-turn'al]\nWho we wit? (Knoc)\nWestcoast parties don't stop\nWho drop head-boppers? (The head doctor, bed-rocker)\nPolice pursue me in squad cars and helicopters\nCheckin lockers, Mexican connect to play soccer\nPH's and cockblockers\nHo-hoppers, weez niggas is off the rocker\nSippin cranberry juice on rocks with vodka\nWith 'Pac and Poppa, and Redd Foxx's doctor (for real?)\nTakin names and takin orders\nYa fake ya name, and I'm all up on ya\nNigga that's Cali-fornia\nPalm trees and 6-3's on deez\nRims dip to make the spokes gold-a\nSlangin boulders, thought I told ya\nTrue soldiers, comin from the motherfuckin shoulders (WOOP!)\n\n[Hook: Missy Elliott]\nTake it ea-say! (ea-say)\nCuz it's the motherfuckin KNOC!\nHotter than yo' block fulla motherfuckin COPS!\nBow down when ya see me!\nKnoc the truth best believe it!\nTake it ea-say! (ea-say)\nCuz it's the motherfuckin KNOC!\nHotter than a freak who givin head who won't STOP!\nBow down when ya pass thru!\nKnoc-turn'al God damn you!\n\n[Knoc-turn'al]\nWhat's the difference between us? (Nah not that again)\nNew songs, and new cars, and new broads, and new thongs\nOn Crenshaw Boulevard - Line 'em up at the bar\nGirl you know who we are, hip-hop superstars\nRoll deep? Nah, we roll hard and deep\nBogart yo beef get the fuck off my street\nGetcha motherfuckin ass beat\nL.A., Compton, Long Beach, whooptie-whoop nigga what?\nI don't give a fuck\nHustlers, hood-rats, sick-ass thugs - Crips and Bloods\n(Hell nigg-uh!) All my real niggas raise it up\nNuttin but dubs, you got a sack, nigga what?\nBlaze it up\n\n[Hook: Missy Elliott]\n\n[Knoc-turn'al]\nBitch you ain't 'bout shit, my bad\nTurn off the lights, don't trip\nGive a nig' some ack right and act like..\nYou might.. lick balls tonight\nGirls all pause, hell nah, girls drop draws on site\nDo drugs, shroom cups, smoke bud, all night\nThat's right, I like.. bi-sexual women, fuck dykes\nSuck dick? No, but your father might\nFuckin hermaphrodite!\nDuck the IRS, fuckin Howard Stern's wife\nIn traffic, bitch gave me head in real life\nL.A. city lights, C.A. get it right\nWestcoast on the grind, these niggas done lost they minds\nStraight loungin in the sunshine\nHere's one thing you bitch niggas must know\nFuck you! Please believe that, and I mean that\n\n[Hook: Missy Elliott]"}]}