{"artist": "Ya Boy", "songs": [{"image": "https://images.genius.com/7d6c85c21606e66f4b33129af53e1f71.500x632x1.jpg", "year": null, "album": null, "lyrics": "[Verse 1]\nPops used to ride me around in an Alfa Romeo\nFeel the sweat so rockin them gazelles\nHead it down knife middle left on fail\nTalkin on the sale when the agent's getting mail\nI just soaked it up peek game let it dwell\nNow in my twenties and I’m doing quite well\nIt ain't hard to tell she loves it when I smell\nLike Chanel when I love her when she bring another gall\nThirty one flavors and spit the hotel\nThirty one favors promise I won’t tell\nShe wanna fuck a hustler so I let her try me\nMight let her ride me but don’t need to beside me\nI’m tryin get money and hoes be the speed bump\nAll she keep telling me is everything that she want\nTell me to slow down I tell her to keep up\nIf you can’t be down baby you could be up\nI ain’t got time to catch feelings\nI’m sitting here tryin to catch a million\nTryin to make my money stack up to the ceiling\nRemember when I used to hit the block and make a killing\n\n[Hook]\nI’m just sitting back loungin\nGetting high counting my thousands\nWaiting on the call from my accountant\nTalking bout a dealing god damn for real man\nCan a street nigga make a million?\nI'm talking bout thousands, millions, thousands, millions\nRemember when I used to hustle in front of the building\nThousands, millions, thousands, millions\nCan a nigga make a million?\n\n[Verse 2]\nCountin' more road day all\nWhip like four days old\nRose bottle came slow\nPocket full of bank rolls\nTrappin and they finna send 'em when I say go\nBad bitch and she never ever say no\nEvery other day never with the same ho\nEvery nigga rappin but they all can’t blow\nI must be dead if a nigga ain’t on\nSay it ain’t so, tell me I ain’t on your screen\nBuried bombs with the whole team\nI don’t need love I just need lean\nPour a double cup while I roll my weed\nPut it on me, young YB let the world know I hold down the SFC\nStarted on the bridge when it cross the sea\nGot it how I live, it's the boss in me\n\n[Hook 2x]\nI’m just sitting back loungin\nGetting high counting my thousands\nWaiting on the call from my accountant\nTalking bout a dealing god damn for real man\nCan a street nigga make a million?\nI'm talking bout thousands, millions, thousands, millions\nRemember when I used to hustle in front of the building\nThousands, millions, thousands, millions\nCan a nigga make a million?", "title": "Thousands Millions"}]}