{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C", "title": "What U Rep", "image": "https://images.genius.com/6a5406166b09f9389383b8e5cab645ef.599x599x1.jpg", "lyrics": "[Intro: Prodigy, (Noreaga)]\nWha, what the fuck yo? Fuck yo?\nIs it real? Really?\nTeach y'all niggas how to rap yo\nShow y'all niggas how to expose a sound\n(Spit on these cats nigga, spit on these cats what, what?)\nFuckin dickblower... (thug like what?)\n\n[Verse 1: Prodigy]\nYo (yo!) At ease! Back where you supposed to be\nP put it back where it's supposed to be\nSupposedly, niggas comin close to me\nTrash rap niggas can't fuck with the...\nExulted, affluent life style I kick\nCalm shit that make your livest rep wanna harm shit\nDon't be alarmed when the guns bang (why?)\nIt's only natural for my dunns to hurt something\nCop a squat though, you might learn something\nWe givin' out back braces and arm slings\nReality rap, the only song I sing\nNuttin fugazi, strictly the real thing\nLive in the flesh, my niggas fresh out the pen\n(When you see dem) When I see you dunn, new guns, money ain't a thing\n(Money ain't a thing, nigga what, what?)\nYou could catch me and the clique, in the spot everyday\nNore guzzle the Crist', I down Chardonnay\nPardon me, 'fore you get knocked out the way\nEveryday it's like a title fight take place (no doubt)\nAiyyo Nas - fuck that nigga just say? (What he say, huh?)\nAiyya Noyd, tell Manny P. to pass me the shank (shank nigga)\nI think it's time to take 'em to the hood, let's play\nEse, I like it when it get that way\n\n[Chorus: Prodigy + (Noreaga)]\nSo what you rep dunn?\n(Iraq, where niggas burst guns\nAnd everybody on the block pump junk\nSo what you rep dunn?)\nDunn the infamous, Q.B. houses\nWhere niggas stand out all night, and make thousands\nWhat you rep?\n(Iraq, where niggas get buried\nAnd we fight dirty, and stay hungry\nSo what you rep dunn?)\nQ.B., we like to blow faces\nAnd pop slugs in your illest nigga's rib cages\n\n[Verse 2: Noreaga]\nAiyyo, yo\nStick it to you, black magic like voodoo\nThey can't fuck with us, 'cause y'all cats straight doo-doo\n(You niggas stink like shit)\nI'm from Iraq, home of the snakes\nNiggas ain't got love for the jakes; do whatever it takes\nClimbin' down terraces, and the fire escapes\nYo we move money, money move me\nYo I'm usually, livin' it up (livin' it up nigga what?)\nGettin my dick sucked\nBone a bitch in the butt, make her say what-what\n\n[Verse 3: Prodigy]\nNow gun talk, do you speak the same language?\nFor your sake, I hope so, let's rap a taste yo\nMy shit spit like a retard, and plus boss\nI drool for the day me and you could face-off\nIt gets gangster, when my clique step in the room\nWe blow torches, and celebrate good fortune\nThis is for my dunns who rest in coffins\nI wish y'all was, wish y'all was here\n\n[Chorus: Prodigy + (Noreaga)]\nSo what you rep dunn?\n(Iraq, where niggas burst guns\nAnd everybody on the block pump junk\nSo what you rep dunn?)\nDunn the infamous, Q.B. houses\nWhere niggas stand out all night, and make thousands\nWhat you rep?\n(Iraq, where niggas get buried\nAnd we fight dirty, and stay hungry\nSo what you rep dunn?)\nQ.B., we like to blow faces\nAnd pop slugs in your illest nigga's rib cages\n\n[Verse 4: Noreaga]\nYo what the deally P? Iraq combine Q.B\nAnd you know we smash the industry, negatively\nSo fuck a good boy, I always been a foul hood boy\nYo as a youth I had ring-worms, and all that shit\nA lil' dirt ball nigga, throwin' dirt at ya clique\nCause me an Aknel nigga ain't packed no bags\nWe rather, be in the streets, sellin yellow mesc' tabs\nCause where we from, muh'fucker yo the game don't stops\nOr we was, out thuggin yo we had chicken-pox\nMe Mus', Maze, Outlaw, +Final Chapter+ brigades\nIt definitely get real, on stage\nI ain't the Madd Rapper, but I'm mad at rap niggas\nThey're sellin' records yo, actin like they clap niggas\nCause me and P. get money like L.S.G\nWhile them cats small change like a E.S.3\nYo I'm still the same cat, that I used to be\nOften, I'm on tour with my rosaries\nCoastin', always hit 'em with the thug potion\nLook at you now, now you just full emotion\nPrankster height, my peoples like the gangster-type\nQueens niggas like to shoot, ain't afraid to fight\nWhile y'all niggas wear Pampers like the cradle type\nMainly hype, thugged-out, shined with light\n\n[Chorus: Prodigy + (Noreaga)]\nSo what you rep dunn?\n(Iraq, where niggas burst guns\nAnd everybody on the block pump junk\nSo what you rep dunn?)\nDunn the infamous, Q.B. houses\nWhere niggas stand out all night, and make thousands\nWhat you rep?\n(Iraq, where niggas get buried\nAnd we fight dirty, and stay hungry\nSo what you rep dunn?)\nQ.B., we like to blow faces\nAnd pop slugs in your illest nigga's rib cages", "year": "2000-11-14"}]}