{"songs": [{"lyrics": "[Intro: Jay-Z]\nUh\nThis beat is like you just walking in place like this\nLet me try to get through this here...\n\n[Verse 1: Jay-Z]\nY'all wanna take my life, then come and get it\nI'm so committed to street life, sometimes I don't sleep nights\nIf y'all ain't ready to die, my advice would be to\nBack up and live, cause the fact of this is\nI keep .44s in the sky, mind on my money\nNigga, I'm so for real, I hope you're not finding this funny, nah\nLive everyday like my last, fast money\nFast cars, fast temper, draw down faster than y'all\nI got to get my shit off, I came from nothin'\nBut pop's dick, mom's egg, hungry like a hostage\nWith every step that I take I use my hood sense\nStudy my footprints, learn from my mistakes\nI'm much braver than most, got the heart of ghost\nI was born dead, baby, my life is all gravy\nReporting live from the ROC, I rep for my set\nTill the date of my death, I will die for my block\n\n[Chorus: Jay-Z & Timbaland]\nI gotta get my shit off (get off, get off)\nGet off my ass and get about that cash\nI gotta get my shit off (get off, get off)\nLive everyday like my last, like death's approaching fast\nGotta get my shit off (shit off! get off, get off)\nGet off my ass and get about my cash\nGotta get my shit off (shit off! shit off! shit off!)\nLive everyday like my last...\n\n[Verse 2: Jay-Z]\nIf there was heaven above us, I was living in hell\nMy neighborhood was the roughest, I never complained\nI just adjusted my game, pushed 20s of 'caine\nBush and Reagan couldn't stop me from makin'\nI wish I could dream about being a lawyer\nBut I had dealers in my hallway, death around the corner\nCouldn't tell right from wrong, pimps will spoil you\nGive you dollars for errands when nobody was carin'\nI got to get my shit off, it rang true every time\nI heard it or every time somebody got murdered\nWe pour liquor on the curb until the cement stain\nI cried enough tears from my eyes to equal 3-inch rain\nMotherfuckers, I deserve it when I be in the Range\nI copped them uncut stones that be freezing the chain\nI done been through enough shit to make you pee in your pants\nMan, I'm sorry if we ain't seeing the same, I seen it rain\n\n[Chorus: Jay-Z & Timbaland]\nI gotta get my shit off (get off, get off)\nGet off my ass and get about that cash\nI gotta get my shit off (get off, get off)\nLive everyday like my last, like death's approaching fast\nGotta get my shit off (shit off! get off, get off)\nGet off my ass and get about my cash\nGotta get my shit off (shit off! shit off! shit off!)\nLive everyday like my last...\n\n[Verse 3: Jay-Z]\nThat's why I give you my up and downs, my pain, my passion, my pleasure\nMy good and bad times, niggas, my whatever\nMy hopes and dreams, blood, tears and sweat\nMy version of R. Kelly, this is a nigga's threat\nMy life is an open book, nigga, I hope you took from it\nWhatever works for you, I was put on this earth to move\nMountains, I think, I'm almost sure\nBut I've been smoking a lot lately, not counting my drinks\nI got to get my shit off, for that I'm certain\nThat's why it's less than 8 months, I am back to work\nNigga, I'm clear, I done seen my cupboards bare\nHeard money mentioned in my mother's prayer\nHad nights my stomach filled up with nothing but air\nGot 10 dollars to eat for 4 of us to share\nThat's why Hov' act like that, quick to snap\nMAC-11 ready, I ain't going back\n\n[Chorus: Jay-Z & Timbaland]\nI gotta get my shit off (get off, get off)\nGet off my ass and get about that cash\nI gotta get my shit off (get off, get off)\nLive everyday like my last, like death's approaching fast\nGotta get my shit off (shit off! get off, get off)\nGet off my ass and get about my cash\nGotta get my shit off (shit off! shit off! shit off!)\nLive everyday like my last...", "title": "Get My Shit Off", "image": "https://images.genius.com/bf0f68ee56f29c8542ad805c6419682b.676x676x1.jpg", "year": null, "album": null}], "artist": "JAY-Z"}