{"artist": "Isaiah Rashad", "songs": [{"title": "S.B.B.B. (Goblin)", "lyrics": "[Intro: TUT (High-Pitched)]\nYeah\nI'm in this ho\nAnd tell your girl to learn how to read nigga\nI text her one time and she ain't never text back\nI told her I was like \"What happened?\"\nShe was like \"I don't even know how to read.\"\nYour girl stupid nigga\nShe went to Ooltewah, and she was in the special ed class\nI know her\n\n[Verse 1: TUT]\nAnd my bitches be bow-legged, butt-naked, get in between them legs\nAnd slang them 'round my head, that dog he be lookin' four-legged\nI got five legs and my [?] bitch had her leg amputated\nI'm amputating all these bitch ass niggas, ain't be so fake\nAnd be celebrating that ho shit, man I be like ohh shit\nWeak ass niggas really thinkin' they be spittin' that cold shit\nTalkin' 'bout you really got them racks on racks\nNigga please, shit, man you need that Axe on Axe\nMusty ass niggas, I must have been hot, I'm boilin'\nShittin' out you niggas, leave you floatin' in my toilet, ha\nSippin' on Cuervo as we speak\nAnd please don't ask your girlfriend why she got ashy knees\n[?] resentin' you pussies, y'all wack as fuck\nPuttin' me right back in the eighties, y'all got me crackin' up\nTraffic jam booty player, tell your girl to back it up\nTell your girl to back it up, put my key in, crank it up\n\n[Hook]\nSay you got a bad bitch, why ain't she fuckin' with you?\nStop stuntin' nigga, you know she fuckin' with us\nSay you got a bad bitch, why ain't she fuckin' with you?\nStop stuntin' nigga, you know she fuckin' with us\n\n[Verse 2: Isaiah Rashad]\nDouble cup, I'm leanin', ridin' 'round, that bad bitch\nHer ass big and she fiendin', for my dick\nMoney in my pocket, you can smell it when you see me\nGot some tens, seventeen, catch me rappin' like I'm Gucci (Gucci!)\nMoney comin', them ho cumin', problems comin', my lows comin'\nBullets flyin', my bros comin', chop chop chop chop nigga\nMotherfuck them cops nigga, niggas still need pussy nigga\nNiggas still eat pussy nigga, we don't need no pussy nigga\nFast cars got pistol whips, Nascar, I'm crashin'\nSmokin' on that reindeer, on Donner, I'm Dashin'\nI'm high as fuck, I'm hungry too, UGK, what it do?\nHow it is no motions, slow motion, I made screw\n\n[Hook]", "image": "https://images.genius.com/f3bf7e237d3161e1014a53c4a379c197.300x169x1.jpg", "album": null, "year": null}]}