{"songs": [{"image": "https://images.genius.com/a771fd3e611d5c86a13b17b05dbb15f9.500x500x1.jpg", "lyrics": "EMT Dispatch: This is the ambulance emergency line. Do you have an emergency?\n\nCaller: I ... I need a bambalance\n\nEMT Dispatch: Who is this?\n\nCaller: Uh ... Joe\n\nEMT Dispatch: Okay. Where do you need it?\n\nCaller: I'm in the mutha fuckin phone booth\n\nEMT Dispatch: Okay, what's the address there?\n\nCaller: Hold on\n\nEMT Disptach: Okay sir. Did you call through 911?\n\nCaller: Uh, no\n\nEMT Dispatch: Okay Joe. I need a location. What street are you on?\n\nCaller: Uh ... I'm in a mutha fuckin phone booth at the Stop N Go. I'm at the ... that's it. I'm at the mutha fuckin Stop N Go ... on a ... wait a minute. What's the mutha fuckin street? Corvel and sumthin. At the mutha fuckin Stop N Go\n\nEMT Dispatch: Corvel and what?\n\nCaller: Hold on\n\nEMT Disptach: Joe!\n\nCaller: Uh huh? Let me see, Coffee, Coffee ...\n\nEMT Dispatch: Caffee?\n\nCaller: There ya go. There ya go, I'm in a mutha fuckin phone booth. Let me tell ya what. I'm at the ... I'm goin down the mutha fuckin road, drivin my car, mindin my own God damn bizness and a mutcha fuckin deer jumps out and hits my car\n\nEMT Dispatch: Okay sir? Are you injured?\n\nCaller: Now let me tell ya. I get out and pick the mutha fuckin deer up. I thought he's dead. I put the mutha fuckin deer in my back seat and I'm drivin down the mutha fuckin road and mindin my own bizness. The mutha fucka woke up and bit me in the back a my god damn neck. It bit me and done kicked the shit outa my car. I'm in the mutha fuckin phone booth. The deer bit me in the neck. A big mutha fuckin DOG came up and bit me in the leg. I hit him with the mutcha fuckin tire iron and I stabbed him ... I stabbed him with my knife. So I got a hurt leg and the mutha fuckin deer ... bit me in the neck. And the deer ... and the dog won't let me outa the mutha fuckin phone booth cuz he wants the deer. Now who gets the deer? Me or the dog?\n\nEMT Dispatch: Okay sir. Are you injured?\n\nCaller: Yeah! I'm ... a mutha fuckin deer bit me in the neck! Hold on. (Unintelligible) The mutha fuckin dog is biten me. Hold on. God damn! Git outta (unintelligible). The mutha fuckin dog is biten my ass!\n\nEMT Dispatch: (Unintelligible)", "title": "Bambalance", "year": "1990-01-01", "album": null}], "artist": "Unknown Artist"}