{"artist": "Pastor Troy", "songs": [{"album": "Face Off Part II", "title": "I Wanna Taste You", "image": "https://images.genius.com/5577ba6e03c019a4576f271bbcf87fb4.500x500x1.jpg", "lyrics": "Yea\nWhat's up baby, you know what time it is\nCome here\nYea come here baby\n\nI wanna taste you, (ooohhhh)\n'cause you look so good to me. x2\n(Ohhh babah)\nP.T. baby\nF**kin jeazy\nVerse One\nNow im jus sittin here, watchin my, baby in her lingerie\nIm kissin her, holdin her, listenin to 12 play\nAnd im sunk in one, hopin one, day she could be wifey\nThugged up from da flo up but hell dats why she like it\nSo politely, I asked her, why does she love da pastor?\nDid she love me combo or was it just my condo?\nShe answered me, pronto, why don't you believe me?\nIf you don't believe me then motha f**ka leave it\nI loved it, her answer; it killed me like a cancer\nAll I could do is smile; she knew it the whole while\nI could see you wit my child, look me in my face boo\nHow can I replace you? Baby, I wanna taste you\n\nI wanna taste you\n(Said I wanna taste you babah)\n'cause you look so good to me. (Wohhwohh)\n(I wanna taste you baby)\nI wanna taste you\n\n'cause you look so good to me\n\nVerse two baby\nVerse Two\n\nOk\nVery few sights, Light da lights, how you light em up\nLove how we f**k, love when I get my dick sucked\nWhat tis up? Layback down, you know im gon hold you down\nGot dat thang all nice and shaved, im bout'a let my tounge cave\nLickin ha neck, lickin ha ear, girl don't run bring yo ass here\nLickin her spine makin her cringe, then I suck her titties, then\nLick around her belly ring, ('cause) imma bout'a do da thing\nKissin on her thigh, as I listen to r Kelly sing\n12 play soft, in the back-ground its goin down\nI just feel her finga tips, every time I lick her lips\nShe grabbin on my dreads, im cummin out dat head\nAnd gon give her breakfast in bed…. that's my baby\nI wanna taste you\n(I wanna taste you baby! yeahhh)\n'cause you look so good to me\n(Said you look so good baby Ahhhhahhaahaahaa)\n\nI wanna taste you\n(I wanna taste you baby! Yeahhhwoohhh)\n'cause you look so good to me\n(Wheneva you want it baby. yeahhawohhh)", "year": null}]}