{"artist": "Yung Lean", "songs": [{"album": "Warlord (This Record is Dedicated to the Memory of Barron Alexander Machat (6/25/1987 - 4/8/2015))", "image": "https://images.genius.com/df175fd992fdb8d50e42725d11196c1b.1000x1000x1.jpg", "year": "2016-04-28", "lyrics": "[Intro]\nTell me why I wanna die when I, uh\n\n[Hook]\nGod only knows what I might do\nGod only knows what I might do\nI don't fuck with god, I'm my own proof (SBE!)\nGod only knows what I might do (Leandoer!)\nTake two of these, I feel like Goku (Like Goku!)\nEyes Chinese when I roll through (Skrt, skrt, skrt!)\nMixing medication up, no tofu\nI'm soul-less, my soul loose\n\n[Verse 1]\nTake two of these, I feel like Goku\nMy eyes Chinese when I roll through\nWhere the fuck my soul at? I need soul food\nI gotta run for my life, I can't hold you\nIf you want me to know, I can show you\n6 inches on my sword, I feel like Kung-Fu\n(Ooh sleep, Ooh sleep, I don’t give a fuck, my pills look like scooby-doo)\nI don't give a fuck (SBE)\nI blow my mind up in pieces\nWish I never lived in this secret\nAy I'm me, I'm me, I'm free bitch\nNothing ever comes for free bitch\nI can't even count to three bitch\nIf you wanna tell me what the fuck to do\nI don't fuck with you\nHow many times I gotta prove to myself what I do?\nMy gadgets they be waterproof\nI'm stuntin' on my exes\nSee me out in Texas, riding in the Lexus\nI call that \"Texas Reckless\"\nCandy coloured painted necklace, on my face\nFlamingos rushing if you wanna take a chase\nI run fast bitch\nR-R-Run\n\n[Hook]\nGod only knows what I might do\nGod only knows what I might do\nI don't fuck with god, I'm my own proof\nTake two of these, I feel like Goku\nEyes Chinese when I roll through\nMixing medication up, no tofu\nWhere the fuck my soul? My soul loose\n6 inches on my sword, I feel like Kung-Fu\nTake two of these, I feel like Goku\n\n[Verse 2]\nI feel like Goku, like GG Allin\nDon't be fucking up my fun\nPink skies, fuck life bitch, you know I'm fucked\nI'm smoking purple snakes, I'll never be done\nGot a stun gun\nMaking songs like it's my last one\nTryna get this cash, you know it's coming, son\n61 sum, never done, never done\nChain made Swiss lace\nA bow and arrow when I come through\nMirror antique, I'm not looking like you\nAnd I don't work for you\nI don't do nothing for you, I do it for me-e-e-e\nI'm smoking lavender\nLike Swiss caliper\nYou know my birdies purr\nI got a pink fur on my girl\nYou know I don't go with her\nGot pearls on my necklace\nI be stuntin'\nLil bitch", "title": "God Only Knows"}]}