{"songs": [{"album": "2014 Forest Hills Drive", "year": "2014-12-09", "title": "03' Adolescence", "image": "https://images.genius.com/2f88c0a52697a42d3d0fb1e3276d2411.640x640x1.jpg", "lyrics": "[Produced by Willie B]\n\n[Verse 1]\nI grew up, a fucking screw up\nTie my shoe up, wish they was newer\nDamn, need something newer\nIn love with the baddest girl in the city, I wish I knew her\nI wish I wasn't so shy, I wish I was a bit more fly\nI wish that I could tell her how I really feel inside\nThat I'm the perfect nigga for her, but then maybe that's a lie\nShe like a certain type of nigga and it's clear I'm not that guy\nBall player, star player, I'm just watchin' from the side\nOn the bench, 'cause my lack of confidence won't let me fly\nI ain't grow up with my father, I ain't thinkin' 'bout that now\nFast forward four years or so from now I'll probably cry\nWhen I realize what I missed, but as of now my eyes are dry\n'Cause I'm trying to stay alive\nIn the city where too many niggas die\nDreamin' quiet trying to dodge a suit and tie\nWho am I?\nAyy, who am I? (Yeah)\n\n[Chorus]\nThings change, rearrange and so do I\nIt ain't always for the better, dawg, I can't lie\nI get high 'cause the lows can be so cold\nI might bend a little bit but I don't fold\nOne time for my mind and two for yours\nI got food for your thoughts to soothe your soul\nIf you see my tears fall just let me be\nMove along, nothing to see\n\n[Verse 2]\nI always did shit the hard way\nMy nigga [inaudible] slangin' in the hallway\nBurnt CD's and trees like this was Broadway\nTimes Square, kept the dimes there in the locker\nSome Reggie Miller\nWith more brown hairs than Chewbacca\nWhispers that he got it for the low-low, sell a\nDime for a dub, them white boys ain't know no better\nBesides, what's twenty dollars to a nigga like that?\nHe tell his pops he need some lunch\nAnd he gon' get it right back\nI peep game\nGot home snatched my mama keychain\nTook her whip, the appeal, too ill to refrain\nI hit the boulevard pull up to my nigga front do'\nHis mama at home, she still let 'em hit the blunt though\nI told her hello, and sat with my nigga and laughed\nAnd talked about how we gon' smash all the bitches in class\nI complimented how I see him out here getting his cash\nAnd just asked, \"What a nigga gotta do to get that?\nPut me on,\" he just laughed when he seen I was sure\n17 years breathing his demeanor said more\nHe told me, \"Nigga, you know how you sound right now?\nIf you wasn’t my mans\nI would think that you a clown right now\nListen, you everything I wanna be that's why I fucks with you\nSo how you looking up to me when I look up to you?\nYou bout to go get a degree, I'ma be stuck with two choices:\nEither graduate to weight or selling number two\nFor what? A hundred bucks or two a week?\nDo you think that you would know what to do if you was me?\nI got, four brothers, one mother that don't love us\nIf they ain't want us why the fuck they never wore rubbers?\"\nI felt ashamed to have ever complained about my lack of gear\nAnd thought about how far we done came\nFrom trailer park to a front yard with trees in the sky\nThank you mama, dry your eyes, there ain't no reason to cry\nYou made a genius and I, ain't gon' take it for granted\nI ain't gon' settle for lesser, I ain't gon' take what they handed\nNah, I'm gon' take what they owe me\nAnd show you that I can fly\nAnd show old girl what she missing, the illest nigga alive\nAyy, who am I?\n\n[Chorus]\nThings change, rearrange and so do I\n(Ayy, who am I?)\nIt ain't always for the better, dawg, I can't lie\n(Who am I?)\nI get high 'cause the lows can be so cold\nI might bend a little bit but I don't fold\nOne time for my mind and two for yours\nI got food for your thoughts to soothe your soul\nIf you see my tears fall just let me be\nMove along, nothing to see\n\n[Outro]\nI never felt better"}], "artist": "J. Cole"}