{"songs": [{"year": "2005-06-01", "album": "Training Day", "image": "https://images.genius.com/0d736130ef89ba0b866b3b01fad325c1.500x500x1.jpg", "title": "Blow Them Horns", "lyrics": "[Verse 1: Kendrick Lamar]\nBear witness\nWatch me get it in like underage club attendants\nThe roof go back like it's vintage\nThe young boy's back to burn your village, the fire touching the ceiling burn\nWhat's God willing when HOVA retired?\nNow he back, guess he got some competition on his hands\nWho is that? I...am...\nK-Dot, I'm claustrophobic don't put me in the box with you niggas\nYou can't categorize me\nI'm already convinced that I'm the hottest nigga out\nAny comments? I thought so\nYou niggas is gassed up like ALCO\nScared to play Madden on All-Pro\nStep your game up\nI'm here to fuck up niggas' barcodes\nSoundScan'll never read your albums again (whoo!)\nI take 99.9% of your fans\nThe last one left is your moms (and she even iffy about you...)\nAin't nothing gifted about you\nPut a bullet in you, tell a doctor get it up out you\nI'm 'bout to, send him right there, he shark food\nPiranhas is coming I put beat on you rap dudes\nI don't wait on you rap dudes\nNigga NASA couldn't reach my altitude\nSky's the limit, and your body ain't airborne...\nIs it? Are you?\n\n[Hook: Kendrick Lamar]\nMy real niggas, once again it's on\n'Til we load the ammo and drop the bomb\nI kick up destruction and when I'm done\nMy city blow them horns, it sounds like...\nWHOOOOOOOOOOOOOO OOOOOOOOOO!!!!!!\nWhen they blow dem horns I'm coming\nTorch in hand, yes, I'm running\n\n[Verse 2: Kendrick Lamar]\nI told you Rock, I like red too\nBut you gotta kill these niggas out the blue\nThey don't see it coming\nWho ain't a part of the family tree\nDo 'em like Paul Bunyan, axe about him\nWe travel like an ant colony, you can't count us\nSip Henny 'til my throat drown\nNew Benz, No Malice\nCount money 'til our hands get calloused\n40 caliber in the Cavalier, welcome to Los\nAngeles, you might leave with bandages\nReal life, no mannequin\nYou pull out, no panicking, you better shoot\nOr have something fall on your rooftop, no raindrops\nI'm talking 'bout gold bullets and black suits\nNo magician, no magic, POOF\nClosed casket fatal attraction\nSon 3 hit you like John Paxson, I ain't bullshitting\nThem veterans been loved 'em\nTalk about bars I got a life sentence of 'em\nAnd I'm just like spitting cousin, ciao\nNo man get the best of him\n\n[Verse 3: Punch]\nThe way I see, why rap?\nI'm just wasting my breath\nY'all don't hear me\nI'm just chasing my death\nIt's all over, the end's here so I'm pacing my steps\nTry not to recollect what I know\nThese pregnant quotes meaning, they give life like semen\nBe the reason my heart's bleeding\nI'm coughing up blood in my palms as I recite the book of Psalms\nOver a slow clap and kick drum, wis-dom\nThe application of your knowledge is me\nPay your tuition, this verse is like a college degree\nY'all don't hear me, y'all fear me like a doomsday prophet\nWhen I'm focused, nothing under the moon can stop it\nI leave you off the Earth's surface, that's what you get\nFor trying to test my patience like nurses\nThis ain't a verse this is a Kennedy curse\nPut your brain on your lady's purses, you niggas crazy\n\n[Hook: Kendrick Lamar]\nMy real niggas, once again it's on\n'Til we load the ammo and drop the bomb\nI kick up destruction and when I'm done\nMy city blow them horns, it sounds like...\nWHOOOOOOOOOOOOOO OOOOOOOOOO!!!!!!\nWhen they blow dem horns I'm coming\nTorch in hand, yes, I'm running\nMy real niggas, once again it's on\n'Til we load the ammo and drop the bomb\nI kick up destruction and when I'm done\nMy city blow them horns, it sounds like...\nWHOOOOOOOOOOOOOO OOOOOOOOOO!!!!!!\nWhen they blow dem horns I'm coming\nTorch in hand, yes, I'm running"}], "artist": "Kendrick Lamar"}