{"artist": "Fabolous", "songs": [{"year": "2014-11-03", "album": "Mac & Cheese 4 (Original)", "image": "https://images.genius.com/8f2349ff38cc10de1c85b2f9c6cc471c.602x609x1.jpg", "lyrics": "[Hook: French Montana]\n\nBust a dance move\nPop a bottle, pop a tag, and bust a dance move\nBust a dance move, like a damn fool\nDo the money dance, hundred racks a watch\nHundred grand, tell em’ bring a mop\nPop a bottle, pop a tag, and bust a dance move\nBust a dance move, bust a dance move\n\n[Verse 1: Wale]\n\nLook, look\nYeah lot of strong\nAll up in they V.I\nSmokin’ on what seems to be loud\nEyes lookin’ like Mr. Miya\nLot of shones\nNigga can’t you tell that we high\nAnd before I leave, I’ll peace out\nLet me see that camel, three times\nSlight work though, lightwork though, my girl don’t\nY’all girl go where my girl go and you there alone\nTwo nights, made a hundred grand\nPair of Nikes like one to ten\nIt was hustle time and y’all walked it out\nWhen the money right, y’all runnin’ man\nPullin' up the whole cabbage patch\nThis is not from no cataract\nIf you could understand what this watch cost\nYou would understand why I try and adapt\nMe and him cannot shake hands, why trap when I’m a free man\nYou so a loss, you a robot, who done told y’all niggas to break dance\n\n[Hook: French Montana]\n\n[Verse 2: Fabolous]\n\nI think the NFL must think I'm a damn fool\nEvery time I touch down I bust a dance move\nThey used to have a movement now they can't move\nUsed to be on they Grizzly like Vancouv\nBout to make them grams move, L.A. to St. Lou\nSay you got them toys, that Santa story just ain't true\nSay you got this money, I'm no snitch I can't tell\nCall me M.C. Hammer name a bitch that I ain't nail\nCan't Touch This, You know that You Can't Touch this\nAll black jewelery, now that should do it justice\nTold her come and bust this, you look like you does this\nCome and rub my head girl, teach me how to douglas", "title": "Dance Move"}]}