{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/2df76f5be8e481c4a5e06d60a13adbe0.662x566x1.jpg", "title": "Insane Computer Raps", "year": "2013-12-21", "album": "Not O.K.", "lyrics": "[Kool A.D.]\nRap rap rap, Kool A.D. best rapper\nKool A.D., best rapper\nKool A.D., best rapper in the world\nKool A.D., rap rap rap\nKool A.D., best rapper\nKool A.D., rap rap rap\n\nAy-yo, computer rap\nIt's Kool A.D., I got a computer, I'm computer man\nA lot of MCs probably thinking they Superman (computer)\nA lot of MCs like to use the word \"grammatical\"\nCool professorial, I need me a sabbatical\nKool Africa demasiado to flossy opera singer to blue-eyed Petey Pablo\nI think I'm Petey Crack (computer)\nBleed... blues blood, brother\nHemophiliac, We be that\nAfrodisiac\nYoung Fidel cash cow, see me rap\nCop weed in Glasgow from Indian fans of 50 Cent\nGimme the cash, gimme the loot\nGimme the pretty penny\nHenny sipping mane\nHeavy with the [?]\nThey ready with the flippy cam\nOr the flippy phone with the cam in it\nStreets all salute the kid like I'm Cam, innit\nShouts to Busdriver on the can\nKick it slippy like I'm born that way\nI think I'm tricky, plus I'm Chucky B\nU-K, O-S-K, W-I\nI don't mean to trouble you guys, but Kool A.D. the best rapper like, under the sky\nPlus the brother fly\nAnybody other than me, why?\nSee I... go by the V-I-C-T... O-to-the... R-to-the...\nSo you know I got cars in the photos so y'all know how hard I roll\nWack rappers go extinct like dodos\nWho you trying to get crazy with, ese? You know I'm loco (Don't you know I'm loco?)\nKool A.D. (computer)\nBest rapper, best rapper (in the world)\n\n[Alim]\nInsane in the membrane, and uh\nWe don't give a shit about what the critics say\nCool as fucks\nIce cool halo\nBlack and yellow sweater\nThird video on YouTube\nIt sounds better (it does)\nI lean with Vic Kool with the two letters\nAndy Dick initials\nI repped Altadena and rapped over El-P instrumentals\nAnd called it the Razor Diet\nUse your mind and think\nEyes And Teeth\nTalking to myself, bragging like \"Yo, who rhyme like me?\"\nAnd \"Nobody\" was the immediate response (uh-huh)\nDoing mixtapes with DJ Sicksentz (what up?) (bitch)\nRing the alarm\nGreet my balls, repeat my songs\nI think I'm cash piece\n[?] is very rare [?]\nThat's very rare, if you ask me\n[?] with brash reality trees\nNow they gotta leave\nRap tricks up my sleeve (get it?)\nI think I'm Ali\nPretty sure that\nPure at rap\nMy new name should be Rap\nCall me Young Rap, the Little Rap\nThe Kool G Rap\nRappadonna, Rappacino\nRappin 4 Tay\nYou washed-up athletes wasn't rapping back in the day (nope)\nNo NFL, no NBA, now all you got is wack shit to say\nYou sell crack? You gonna shoot me with a Louis AK?\nMan, shut the fuck up\nI'm on the song with the best rapper in the world\nYou niggas go to the studio and make songs about another dude's girl\nThe rap game needs me, leave me alone\nAnd I say what I wanna say, especially when I say so"}]}