{"songs": [{"image": "https://images.genius.com/5558befb83c1a20447e8e59fc8c93648.999x1000x1.jpg", "title": "Edge Play", "album": "The Sexorcist", "year": "2005-08-02", "lyrics": "[Sample]\n\"You're gonna like that, faggot... You're gonna like that you faggot fuck!\"\n\n[Hook: Katja Kassin]\nEdge play\nSexual Torture\nBondage and S&M\nWhite slaves, hardcore domination in boots\n\nEdge play\nSexual Torture\nBondage and S&M\nWhite slaves, hardcore domination in boots\n\n[Verse 1: Necro]\nStick your panties up your ass slut bag for a few minutes\nThen pull em out slowly stinking like manure shit and gag you with it\nVegas girls abducted for a price, force you to fuck a cat, saying that you don't fuck for your life force you to suck a knife\nSmothered in shit like a pig on the ground\nYour pussy on a sharp piece of wood called the horse, diggin into your mound\nYou were stripping for clinetel now your a kidnapped victim in a cell slippin into sickness whippin you with the cat-o-nine tails\nBitch fuck your butt with no lubrication, My pooper scooper got you in the stouper give you a new asshole OPA\nFuckin bitches to death, then fuckin them once again durin the autopsy before the mortisions stiches the flesh\nYour tied up in a lasso from your tits to your asshole\nMake you swallow a ribbed dildo covered with tobasco\nStick a blade in your nipple then burn em ima slide through fuck you raw dog while you dangle from the ceiling then cum inside you\n\n[Hook]\n\n[Verse 2: Mr. Hyde]\nThey say girls are made of sugar and spice and everything nice but on the real some of ya'll bitches are mentally trife\nBeggin for choke outs almost be on the edge of your life\nI seen it all when this weirdo fan of mine lent me his wife\nDouble D's a hotter version of Jessica Alba\nBeofre he left he told her to call me master and set up a camera\nI said \"Bitch I ain't down to be video taped!\"\nShe said \"Okay, Master, but please take a shit on my face!\"\nShe had a big bag of dildos, handcuffs, whips and chains, clamps, suction toys ball gags the shit was insane\nIt did intrigue, up til now i thought the bondage was creeper but admit i got a hard on when she begged me master please beat me\nWhat happened after that was a blur\nSniffed some coke, skull fucked her face till she hurled it was absurd she loved it\nShe forced my hands around her throat during sex'\nIt was amazing until I accidentally chocked her to death\n\n[Hook]\n\n[Verse 3: Ill Bill]\nLet's start the snuff cinema, now it's spiked paddles, pound your pussy 'til you're paralyzed and barb-wire bound\nThat's an M edge place, let 'em dress up like the gimp, chains, straps, whips and tournequets, your pain and pleasure pimp\nThere'll be thirty dirty dicks alternating in your slit, a big GG Allin fuckfest you'll eat a ton of shit\nBitches, double penetration, sharp knives and powerdrills\nYour mouth is tastin sour when my golden shower spills\nYo, I'll cut your little clit off with a pair of clippers, hun\nLeft raped and blood-caked with the grimace have been cummed\nMake you strip, bitch, my whip bitch, whose lashes I'm a sado-masochist, smash your tits til they look like mashed potatoes\nFour fingers ain't enough when I'm penetrating muff, it's more like forty fists and there's still room for stuff\nHandcuffs with no keys, slavery's my hostiest, fuck whores with no teeth, get forced to blow piece!\n\n[Hook]\n\nEdgeee Plaay\nSexual Torture\nBondage\nS&M\n\n[Katja Kassin]\n...Yeah yeah yeah yeah\n\nUh, Necroo, the sexorcist baby, oh\n\nThis is Katja Kassin, uhhh, I love edge play\nSexorcist, please choke me while fucking, I love this so much\nMach mich heiß und geil, ich wills so hart von dir..."}], "artist": "Necro"}