{"songs": [{"image": "https://images.genius.com/91673d26db6cbf8e9e68b973976ed74f.1000x563x1.jpg", "year": "2011-02-23", "title": "Finally Home", "album": null, "lyrics": "[Hook]\nLook at where we at, look at where we been\nLook at every place we roamed, don’t know where you at\nI’m all over the map but right now, we finally home\nAre we there yet? Hell yeah, are we there yet? Hell yeah\nAre we there yet? Hell yeah, okay cool, we finally home\n\n[Verse 1: XV]\nOkay I’m back on my B.I., aw so plug in your two D.I’s\nLets take these niggas where I reside\nThe W-I-C-H is I, the greatest from my sis-side\nThe truest, you deny, than who is, down to blow like a match to a bomb\nI set fire to the web, Match.com, we going up, you coming?\nBetter grab my arm to the place I ran, I’m the black Saddam\nNo wonder these bad bitches wanna hang\nOn a niggas’ ass like the bitches on my jeans\nRiches on sag and my fitted on lean\nAnother album in the can, doing what you niggas can’t\nSetting flames around here like So Glow\nPlayed the game, say yes to a city that they don’t know\nRight next to KC like JoJo, you phone everybody, says tell ‘em I am home bro\n\n[Hook 2]\nLook at where we at, look at where we been\nLook at every place we roamed, don’t know where you at\nI’m all over the map but right now, we finally home\nAre we there yet? Hell yeah, are we there yet? Hell yeah\nAre we there yet? Hell yeah, okay cool, we finally home\nCar service on its way to me, brand new jeans with all room keys\nWe home but where haven’t we been? Tell shawty to get lost or get in\nFor the win, been gone for so damn long, passports and a carry on\nTrying to be home, where haven’t we been? Tell shawty to get lost or get in\n\n[Verse 2: XV]\nEven Christ isn’t passsionate as I am\nBel to the air, Fresh Prince Will-I-Am\nWhat you see, look at me from the sky cam?\nA couple girls named Mary and a Tri-Lam\nEvery since I got my deal, I feel high as a necrophobiac’s light bill\nSleep on me like night quilts and I'mma get out my dreams\nWithout Ye or a Nyquil, now open up your pupils for your mentors\nI’m coming for your soul like Dementors\nWith the hood on my back like the Sith Lords\nMade it on top of my foes like fifth floor\nNow stand up like a judge when you know the ending\n‘Cause my Rockets come home like Toyota center\nThe hottest loser and the coldest winner\nTurn the street lights on, I’ll be home for dinner\n\n[Hook 2]\n\n[Verse 3: Machine Gun Kelly]\nKells!\nSay goodbye to the street lights, bye to the I can’t eat nights\nSo hello to new countries and new languages, I can’t speak right\nFalling out the sky like cheap kites and now I’m in that um...\nI’m don’t know, I'm bad with cars, but my backseat got some of the baddest broads\nAnd up front, I got my fam with me, Cleveland with me\nTwo L’s and Cool J like Def Jam’s with me\nI’ve been all around the world and back\nNow I play all around the world with Shaq\nOne touch of this blunt right, here, pushed the curtains back\nFeel like Aladdin with this Persian mat, blow O’s with XV\nHead to the coast to jet ski and anywhere I go, my set be\nEST tattooed right above my chest P, respect me or skate like Gretzky\n\n[Hook 2]"}], "artist": "XV"}