{"artist": "Pharoahe Monch", "songs": [{"album": "Internal Affairs", "title": "Simon Says", "image": "https://images.genius.com/981cc15d7fc00e281aefe7e9282090fb.594x600x1.jpg", "lyrics": "[Produced by Pharoahe Monch]\n\n[Intro]\nUh-uh, uh-uh, uh-uh\nUh-uh, uh-uh, uh\nUh-uh, uh-uh, uh-uh\nUh-uh, uh-uh, ahhh\n\n[Hook]\nGet the fuck up\nSimon says, \"Get the fuck up\"\nThrow your hands in the sky (Buh-buh-buh-buh-buh!)\nQueens is in the back sipping 'gnac, y'all, what's up?\nGirls, rub on your titties (Yeah!)\nYeah, I said it, rub on your titties\nNew York City gritty committee pity the fool\nThat act shitty in the midst of the calm, the witty\n\n[Verse 1]\nY'all know the name\nPharoahe fuckin' Monch, ain't a damn thing changed\nYou all up in ya Range and shit, inebriated\nStrayed from your original plan, you deviated\nI alleviated the pain with long-term goals\nTook my underground loot, without the gold\nYou sold platinum 'round the world, I sold wood in the hood\nBut when I'm in the street and shit, it's all good\nI'm soon to motivate a room, control the game like Tomb Raider\nRock, clock dollars, flip tips like a waiter\nBlock shots, style's greater, let my lyrics anoint\nIf you holding up the wall, then you missin' the point\n\n[Hook]\nGet the fuck up\nSimon says, \"Get the fuck up\"\nPut your hands to the sky (Buh-buh-buh-buh-buh!)\nBrooklyn in the back shooting craps now, what's up?\nGirlies, rub on your titties (Yeah!)\nYeah, fuck it, I said rub on your titties\nNew York City gritty committee pity the fool\nThat act shitty in the midst of the calm, the witty\n\n[Verse 2]\nYo, where you at? Uptown, let me see 'em\nNotorious for the six-fives and the BMs\nHeads give you beef, you put 'em in the mausoleum\nAnd shit don't stop pumping 'til after 12pm\nUh, ignorant minds—I free 'em\nIf you tired of the same old everyday you will agree—\nI'm the most obligated, hard and R-rated\nSlated to be the best, I must confess—the star made it\nSome might even say this song is sexist-es\n'Cause I asked the girls to rub on their breast-eses\nWhether you're riding the train or a Lexus-es\nThis is for either or Rollies or Timex-eses\nWicked like Exorcist, this is the joint\nYou holding up the wall then you missing the point\n\n[Hook]\nGet the fuck up\nSimon says, \"Get the fuck up\"\nThrow your hands in the sky (Buh-buh-buh-buh-buh!)\nThe Bronx is in the back shooting craps now, what's up?\nGirls rub on your titties (Yeah!)\nI said, rub on your titties\nNew York City gritty committee pity the fool\nThat act shitty in the midst of the calm, the witty\n\n[Outro]\nNew Jeruz (Get the fuck up)\nShaolin (Get the fuck up)\nLong Isle (Get the fuck up)\nWorldwide (Get the fuck up)", "year": "1999-10-19"}]}