{"artist": "Problem", "songs": [{"album": "Mollywood 3: The Relapse (B-Side)", "title": "50 Shades Of Grey", "image": "https://images.genius.com/063f502efdbb339e3872ba76a3b978be.950x950x1.jpg", "lyrics": "This for all you niggas\nThinkin' I'm too scared to respond\nTo these angry ass niggas throwin' stones at a don\nI mean, honestly, it's like bubble bath to a pond\nGram polkin' every shirt, Hordio and Quran\nThey all wanna know my take on it\nI ain't got one, ask around\nReal niggas know\nThey seem to settle where the metal is\nFuckin' between, then the rules on both sides\nPapered on limousine, what?\nTint darker than killas dreams\nHeavenly motifs, the devil stay tryna intervene\nFuck it! Be higher than Levine\nThen call my bitch up, lit like a light bulb\nBut won't neva eva switch up\nIndustry nigga calling my phone I rarely pick up\nCuz all they talk about is what new rapper they sick of\nThen 3 months later I'm checking music on Fader\nAnd its him and the same rapper’s new record titled won't switch up (go figure)\nI won't feel 'em with yo hands\nIt's a fact I'm on these tracks just doin' wheelies with no hands\nNiggas like to ask me like wassup with me and Wiz\nIt was what it was, now it is what it is\nMe, Prez and Nick, no bags, meetin' up at the clear port\nRumor has it me and Meek Mill fought at the airport\nWon't go in detail cause that ain't how I conrole\nBut respect was the air result and at least he got down, tho\nThat's more than I can say about a lotta these niggas\nThese iFights I'm gettin' tired of, niggas\nWhere the love? Fuck the subs! It's the hood\nWhere we at, YG? We both responsible fo' bringin' this shit back, YG\nFuck the money, fuck the crew, we need to chat, YG\nBoth our first time on TV was together\nRemember that, YG? Ball's in yo court\nEither duck it or pass\nBuckets of blood or buckets of cash\nReady either way, it's enough of that\nSnapbacks, no bucket hats\nNo more free verses, where yo muthafuckin' budget at?\nI'd done put way too many niggas on fo' free\nThat get deals off my buzz and get mad when I want my fee\nHomeboy, I could tell ya I neva hustled befo'\nYa supposed to respect the connect, so the hustle keep gon'\nFo' the connect disconnect everything you got going\nShit, I can't blame you fo' not knowing\nShould just say that then\nThe rap game would let a lay back in\nFinally forgave us fo' that shit that went down way back when\nIt's about progression, we too rich for all this agression\nBottles of bad bitches, now I feel the section\nOh yeah, no tough shit, I ain't tryna be thug\nThis ain't a mask on, cause deep down...", "year": "2015-07-02"}]}