{"artist": "9th Prince", "songs": [{"album": "One Man Army", "lyrics": "[Intro: 9th Prince]\nFucking hot, man, yo\n\n[9th Prince]\nAiyo, I spit a verse that'll put ya'll niggas in a hearse\nStraight out the soil of the Shaolin dirt\nTommy Hillfiger slippers, fine wine sippers\nN.Y.C. killas, Slick Rick is slick, but 9th Prince is slicker\nAll this talk about Drake and Nicki Minaj\nThey got 'Young Money', but Wu-Tang still living large\nRZA parked the Maserati inside the garage\nWe ain't home, we at the Mirage, partying hard\nShoot at the devil for wearing Prada, verbal globetrotter\nMicrophone doctor, never wore silk but I'm still the shocker\nSit back and laugh with my own staff\nOn corny rappers trying to live out they past\nYou ask and your raps is trash\nI'm rough like Bronze Nazareth beats, and smooth like jazz\n\n[Chorus: sample]\nConcrete jungle...\nConcrete jungle...\n\n[9th Prince]\nAiyo, I'm starting to get restless, I aim the best to test it\nSee me hanging out with Bill Murray and the GZA in Texas\nMy catalog manifest through the analog\nSit down and relax and have a conversation with God, Pelle Pelle leather\nI'm heavyweight, ya'll niggas is lightweight, lighter than a feather\nWhatever, Killarm' let's get together\nReturn of the Six Men Wetting, in your area\nLive from a hundred and fifty-fifth\nShoot the gift, that's swift, when I uplift the four-fifth\nWelcome the party crashers, cut you in your face, slash ya\nMake your body disappear, abracadabra\nYour stranded in another hemisphere, I'm dressed in military gear\nSincere verbal warfare, put me on the top of your list\nWith Rakim and Nas, Kool G. Rap, Slick Rick and a few other guys\nBut that's it, I split niggas wigs and shit\nI wild out like Jesus with a hoodie, sipping on wine\nTalk like a bully when I rhyme\nArts and crafts, money flows and hoes and bubble baths\n\n[Chorus]\n\n[Outro: 9th Prince]\nYa'll niggas know what time it is out there\n9th Prince and my man Division\nWe up in here, escaping the wordly prison\nYou know, 9th Prince slapping ya'll bitch ass niggas\nCheck it out, yeah yeah I'm out of here, out of here\nKilla Sin, come home, son\nKillarmy, what up, niggas?\nWu-Tang", "year": null, "title": "Concrete Jungle", "image": "https://images.genius.com/21cb3399de2cfe8fac890083e9323314.940x940x1.jpg"}]}