{"songs": [{"album": "Still Standing 3", "year": "2011-12-06", "title": "100 N The Clip", "image": "https://images.genius.com/8924e1ffcd33797e4f7d831374eda3b5.500x500x1.jpg", "lyrics": "[Verse 1]\nI'm self-made, well-paid\nEven though I only made it to the twelfth grade\nTwelve gauge, twelve K's, 12-12's, I was getting it from twelve ways\nV-12 while I inhale haze\nWith the baddest female in Chanel shades\nWhat you could tell J? Better play it smart\nHave to write you out the script, you don't play your part\nYou ain't a shark, I'll take your heart\nBuck fifty in the air, I just made a mark\nI don't need a damn gimmick to try to get listens\nFind me in the kitchen, supplying the fixing\nYour favorite rap spitter be lying and snitching\nBunch of basic-ass niggas, trying to be different\nI'm an addiction, you should know the G\nBut I got a gun that be yelling, \"Get a load of me\"\nGet a load of me, get a load of me\nHad to read it over cause you niggas ovaries\nYeah, red dot leave 'em red hot\nI portfolio the block, bunch of head shots\nMade man, mayhem\nYou don't watch yourself, you gon' need an Ace ban'\nDamn, I'm somebody you cannot avoid\nI Chris Farley O.D. with the tommy, boy\nI go Almond Joy\nDon't get J.R. annoyed\nAin't heard of me, but my weed make a lot of noise\nLoud pack, bout to smoke a pound\nSo loud that they telling me to hold it down\nHold it down, hold it down\nThey just mad I'm blowing on the illest smoke around\nI don't roll with clowns, I just navigate\nYou don't know the town? Well, go that-a-way\nHey, off the top, I call the shots\nAnd I do mean shots -- I don't talk a lot\nThat ain't all you got\nIs you kidding me? You got shitty weed\nCall it port-a-pot\nFrom the corner block where you should never go to cop\nYou hit 'em with that dough you got, they hit you with a load of throp\nRun up with the blickers at your coca spot\nAnd rearrange your pictures, nigga -- Photoshop\nI live it, the point is to get it\nWay over the limit, hope I don't get a ticket\nKnown as the sickest, Writer's shit mean\nHundred bars to me is like a sixteen\nGot me mad already, I'm 'bout to grab the Desi\nI separate the real, them guys imaginary\nMy nines are rather heavy\nSo you gotta catch a flurry\nFor fronting when you pass, nigga -- now you Makaveli\nLeave the dude alone, I'll bulletproof your dome\nI'll hit you Internet thugs with this Google Chrome\nThis ain't new to holmes\nGet your doobie blown\nDead by Smith & Wesson, that's your new cologne\nFew beans, sweep your crew clean\nEven though those dudes seem liver than a UStream\nI don't lose steam, let a dude scheme\nTake a shot, you a sleeping nigga -- hoop dreams\nHow you claim you better? I'm amazing, heifer\nFly nigga out of Harlem, I ain't Mason Betha\nPaper stretcher, tell him get his cake together\nHow the fuck you niggas checking me? I ain't playing checkers\nCheck it -- I spill Mo' just because\nI got the biggest bottle of Rose in the club\nStill got a flow made of drugs\nEquipped with a dime so thick, she could go for a dub\nYou still known as a scrub\nWhen you gonna learn? Motherfucker, it's a veteran's turn\nBeyond a don, I ain't never concerned\nYour raps got condoms on, they don't never get burn\nPut up a little cake, you'll never return\nYou ain't heard? My money straight -- cheddar with perms, nigga\nI been eating, this is spring cleaning\nI'm at the showroom picking up spring season\nYou misleading, lying to the people\nI just keep it G, boo -- I ain't gotta G you\nHigher than a eagle, you riding in a Regal\nI speed through, acting like I don't even see you\nWho you kidding? Y'all don't even need to\nThat ain't True Religion -- y'all got on Evisu\nPlease, duke, we know corny\nI'll school you, but you don't never see notes, shorty\nSwing a new ride through, three hoes on me\nBumping 2 Live Crew, \"Me So Horny\"\nGot your team all salty\nI should send them all uptown to get Nemo's for me\nNiggas real fake, but I get real cake\nWaiting on a deal, nigga? I'mma deal weight\nSix figgys, Writer deal straight\n360? I better be signed to Bill Gates\nThat's why I'm laughing out loud when a nigga see you\nThinking how you come out in them skinny Diesels\nLooking like you got styled by the Village People\nOr you bout to go out with your Village peoples\nBut I guess that's the new trend\nThat's why I do me, and let 'em do them\nSuper-cute twins in a new Benz\nDo the ho dash like I'm trying to get to 210"}], "artist": "J.R. Writer"}