{"songs": [{"year": "1993-06-02", "image": "https://images.genius.com/9703d795ec6c8c350b9674639f3fa5b8.500x500x1.jpg", "title": "Funk is Back", "album": "All Samples Cleared", "lyrics": "[Verse 1]\nGet up out your seat, the grand groove is back\nWith a beat to sink your teeth in like Wolfman Jack\nI'm bringing in the swing like ching a-ling a-ling\nGuaranteed to rock and make the microphone sing\nI combine funk with a make-a-monk piano\nI'm nuts, I'm crazy, I lost it, and man a\nDifferent type of bud in my veign and hey\nLike I'm *cookoo cookoo* like a nappy dread\nNow it's me, the B-I-Z, M-A-R K-I to the E\nAs you can see, going to the T-O-O, mo mo most definitely\nI concoct to rock, and put you in shock\nNot from the past, but I blact like Binac-a\nYeah, the one foots getting ill\nCause nobody beats the Biz still\n\n[Hook]\nThe funk is back! (Repeat 4x)\n\n[Verse 2]\nOoops, well I'm the original B-I-Z Mark\nHere to let you know my bite is worse than my bark\nI'm coiming out with some freakified funk\nIf Joanie was around, then I'd be a hump\nBut since she ain't, I still am the\nHellified king of the R-A-P\nI'sa I'sa I'sa here to let you know\nI'm the hypnotizing, mezmorizing, stealing the show\nUh-oh, I'm hitting hitting just like a speaker\nMy mom dropped the bomb, then God said \"Eureka!\"\nTo say a lay masterpiece that's long overdue\n]From the streets of California to Kalamazoo\nDon't look at me like I'm crazy or dumb\nCause my jinlge will tickle you cerebrum\nMy sensational delivery will give you a chill\nThat's why nobody beats the Biz still\n\n[Hook]\nThe funk is back! (Repeat 4x)\n\n[Verse 3]\nI'm the super, duper, party pooper\nWith my loop I'll put you in a stupor\nChump, thump, with doctor's bump\nWith the trunks of funk to make the heartbeat pump\nM ah Z R, K har, I har, E har\nTry hard, a star, rocking the Casbah\nMy brain maintains with no restraints\nNot John Doe or Jane, here to entertain\nFeul a, deuler, plus an old schooler\nFunk from the crack keep me kicking like I'm ruler\nDunky, drunky, skunky, funky, and pokey\nChunky, a junkie with the monkey on my back\nKnack, opposites attract\nBiz being wack? Get the bozack!\nSkill to ill, plus always thrill\nAnd I be sure that no one beats the Biz still\n\n[Hook]\nThe funk is back! (Repeat 4x)\n\n*the Biz goes off til the song's end*"}], "artist": "Biz Markie"}