{"artist": "C-Rayz Walz", "songs": [{"title": "Protect My Family (Clean)", "album": "We Live / Protect My Family / Rain Forever", "year": "2004-07-16", "image": "https://images.genius.com/35ae941bf2842319b29cff816482f761.529x529x1.jpg", "lyrics": "[Hook 1: C-Rayz Walz] (x4)\nLoving, giving, living my life\n\n[Verse 1: C-Rayz Walz]\nI’ma protect my family—that's my word\nMy wife, child, my dog, cat, and my bird\nI got a happy house home—you can't disturb (Word)\nYou might clapped in the dome—clap—now you heard\nI'm walking these dogs, putting in work, got the coroner locked\nCome on, dogs.  Don't be a jerk and have to gargle the Glock\nMy brother got his spot down on hold, a hop, skip, and a cold\nI'm from the old school, fam—I don't lock my door\nAin't no more arguing, negative screaming, and fighting\nAll that's gonna do is leave the little residents frightened\nI bring home groceries, packed bags, stacked cash\nStay gracious, use patience, don't get mad\nAnd I’ma be the dad my father couldn't be ‘cause he died\nOne of the many reason I've cried.  Could it be?  I find\nI take Bacardi shots ‘cause the youth is illing\nBut I'm Ravipops—that's my excuse for living\nForgiving myself for not learning a trade in school\nNow my eyes stay red like I just came out the pool\nI want my son to learn to build, write, and read from me\nAnd not have cocaine plans with weed money\n\n[Hook 2: C-Rayz Walz and (Killa Kal)] (x2)\nI’ma protect my family—that's my word\nLiving on the corner, left that life on the curb\nI’ma protect my family—that's my word\n(No need to get around.  I got that good stuff at home)\n\n[Verse 2: Killa Kal]\n“I’ma protect my fam” is what this jam be about\nMy sons, my daughter, and definitely my spouse\n‘Cause when the going got tough, she got rough—no doubt\nAll you chickenheads clucking, break out\nSince July 4th, 1993, there's been a change in me\nMy baby boy Khalil made a man of me\nMade daddy think to stop hustling in these streets\nMade daddy think “Would I live to see my son reach three?”\nEven though daddy didn't have his daddy there\nDaddy's gonna make sure you never have a care\nIn this world.  Now I got a baby girl\nBorn a day after my birthday, Lena changed my world\nAnd put my life into a proper perspective\nAnd now respecting women is my only objective\nSee, I used to treat women real bad\nAnd now I feel bad because my baby girl could get had\n\n[Hook 1: C-Rayz Walz] (x4)\nLoving, giving, living my life\n\n[Bridge 1: C-Rayz Walz]\nYo, I'm not trying to die in the street but\nMy people need something to eat and\nI'm just trying to feed my fam\nStraight up, I need cash in hand\n\n[Verse 3: C-Rayz Walz]\n“Protect my family” my political statement\nWhen it's time to get foul, my whole style's flagrant\nWhen my little girl cries, it's a thunderstorm (What?)\nBecause of raw talent (Yeah), my son was born\nThey say God made man (When) man made God\n(Then) man made child with no job—life's hard (Hard)\nMan try to be man, steal and rob\nDamn, man with no plan behind steel bars and guards\nNow the next man's doing it right, doing your wife\nDoing your son's homework.  Man, he's doing your life\nYou ruined your flight.  It could’ve been a walk in the park\nOr a talk in the dark.  Now it's a union of strife\nI'm like “Protect your family no matter who you are”\nIt all comes down to the sun, moon, and stars\nIf you know these “Degrees,” then you knowledge me, pa\nIf you think it's all \"Old Joke,\" well hardy, hardy, har"}]}