{"songs": [{"year": null, "title": "Pop Quiz (Multiple Choice)", "image": "https://images.genius.com/6525d1888947cc49b5c9274e9ee2e289.400x400x1.jpg", "lyrics": "[Verse 1]\nFirst question for motherfuckers that's spittin' this \"I'm a thug shit\"\nYou claim you blew out a nigga brain, then what color was it?\nA) Reddish like the dark shade of oxygenated blood\nB) Brownish like water that's mixed with dirt to make mud\nC) Whitish like the man that created the virus to slay us or is it\nD) Grayish like a gloomy and rainy day is\nSecond question strictly for players so state your biz\nTell me exactly what the definition of player is\nA) Duke that rock links, flossin' the club and pop drinks\nB) The jail nigga that stash the mop ringers and slop sinks\nC) The rich rapper who depict the pictures of bigger sixes\nD) That broke nigga fuckin' the richest nigga bitches\nMovin' right along, question number three is for the females\nNever generalize, I'm into details\nOther than the fact chicks is too quick to strip and spread\nWhat is it exactly that make a honey a chickenhead?\nA) If she'll fuck her girl man on some shady shit\nB) Go to clubs but'll leave her mother to babysit\nC) Swap sex for materialistic objects\nD) All of the above, love, you fucked up\nThe fourth question's a question that still ig me\nWho do y'all niggas think that it was that killed Biggie?\nA) Southside Crips cause Puffy owed 'em a grip\nB) Some crazy 'Pac fan that flipped and unloaded a clip\nC) Missiles from pistols from government officials\nD) The same cat that came back and then sang \"I Miss You\"\n\n[Hook] x2\nYou never was a killa; you never bust a gun\nYou never held the spot down; was never on the run\nYou never lived my life; you dead in the wrong\nCause you never did none of the shit that you said in your song\n\n[Verse 2]\nWith the strength of a hundred baboons\nI'll beat your eyes black as a fuckin' raccoon's\nLeave you covered with stab wounds\nDead in a public bathroom\nYou like to tighten your face and cuss when you spit\nKnow what I noticed? That tough shit is just when you spit\nI couldn't picture you bustin' a clip\nI could see you suckin' a dick or probably getting fucked with a stick\nDrama with me, son, your baby mama will be\nFound in the woods, hangin' by her thong from a tree\nYou spit my life and won an award\nBut you can't get my stripes cause you the type to run in a war\nSlung jums in front of the store; done it before\nHeld guns, I'm talkin' at least a hundred or more\nShould put a gun to your jaw, to one of your whores\nFuck under the covers; we all lovers under the floor\n\n[Hook]\n\nWord is bond, word is bond\nAbandoned Nation, we up in this bitch, nahmean, 2k\nNiggas is outta jail, niggas is coming for niggas heads nahmean\nAll these fake ass MCs advocating real niggas lives and shit\nLike it's some sweet sheet, nahmean?\nShit is, shit is, shit is aggravating god, word up man\nBig up my nigga Shyne son, word up, hold your head man\nI'ma make sure niggas take care of you up north son\n\nYou never was a killa, you never bust a gun\nYou never held the spot down, was never on the run\nSo why you wanna live fucked up like us?\nIf they convict J and Puff, good luck on Rikers", "album": "Warning Shots"}], "artist": "Saigon"}