{"songs": [{"title": "Church In These Streets", "lyrics": "[Produced by Zaytoven]\n\n[Intro]\nYeah\nOh man, you know what this shit is my nigga\nI'd be lying to you if I wasn't telling you the truth. You know?\nBow heads, let's pray\nI just call it how I see it my nigga\nI don't know no other way, you know?\nNeed everybody to  gather 'round, know what I'm sayin'?\nI got somethin' to say\nYeah, church off in these streets my nigga\nCame to bring the good word\nPastor Young, amen, amen\nYeah\nYeah, yeah\n[Hook]\nWhere my street disciples? Church off in these streets\nCall my congregation, church off in these streets\nCall me Pastor Young, I came to spread the word\nSpread the word like my partner spray them birds\nIf you gettin' it how you live it, just say hallelu\nIf you out here and you poppin', best to have your shooter\nI said it and I meant it so you know it deep\nI came to spread the word, it's church off in these streets\n\n[Verse 1]\nHeard he took a unit, broke it down to singles\nTake them one by one just like them bitches Pringles\nHeard he lost it all and then he got it back\nAll them folks a tell that's why I got attacked\nI'm in this bitch, I'm feelin' like a million dollars\nOkay I'm loungin' know I'm short a million dollars\nThe first around the corner got a nigga stressed\nJust hope he send a blessin' off in my direction, hey\n\n[Hook]\nWhere my street disciples?  Church off in these streets\nCall my congregation, church off in these streets\nCall me Pastor Young, I came to spread the word\nSpread the word like my partner spray them birds\nIf you gettin it how you live it, just say hallelu\nIf you out here and you poppin', best to have your shooter\nI said and I meant it so you know it deep\nI came to spread the word, church off in these streets\n\n[Verse 2]\nMy nigga got a plug and then he got indicted\nSaw him in that foreign thing then got excited\nGraduated from the streets and I ain't have a tutor\nIf you see another day then just say hallelujah\nAin't no fuckin' secret, know I came from nothin'\nTold myself that I'mma go and grind for somethin'\nHustle cause I gotta splurge when I can\nJust know you lookin' at a God-fearin' man\n\n[Hook]\nWhere my street disciples?  Church off in these streets\nCall my congregation, church off in these streets\nCall me Pastor Young, I came to spread the word\nSpread the word like my partner spray them birds\nIf you gettin' it how you live it , just say hallelu\nIf you out here and you poppin', best to have your shooter\nI said it and I meant it so you know it deep\nI came to spread the word, it's church off in these streets", "album": "Church In These Streets", "year": "2015-11-23", "image": "https://images.rapgenius.com/0ca6ad07b1ccd8baeb3b14638bee61a6.477x440x1.png"}], "artist": "Jeezy"}