{"songs": [{"title": "Give Myself", "image": "https://images.genius.com/f2cb28c772fe54a0b546ca701e04f426.640x640x1.jpg", "lyrics": "[Hook]\nI give myself, is that enough for you?\nI will give myself to you\nI give myself, is that enough for you?\nI will give myself to you\n\n[Verse 1]\nShe got a face like a porcelain doll\nAnd her big brown eyes make me feel so small\nPorcelain dolls are so fragile, she breaks when she falls\nBut I will catch you, that’s what I promise\nShe got a smile that could light up the room\nThe smell of her perfume got me high as the moon\nThe way she moves entices, but stay away\nI'm convinced I could kill a man like Cyprus\nAnd she knows that I would die for her\nBut that wouldn’t save her soul so I live\nGive myself, I know I’m not Jesus, but\nI wanna love her like he does\nThis is free love, it only works two ways\nYou can accept what I offer, or throw it back in my face\nAnd I take this woman to be\nBut I don’t wanna take from her, I wanna give myself\nAnd all that I have, to have and to hold, for as long as I live\nI give myself and all that I have\nTo have and to hold, for as long as I live, I give\n\n[Hook]\nI give myself, is that enough for you?\nI will give myself to you\nI give myself, is that enough for you?\nI will give myself to you\n\n[Verse 2]\nShe looks good even when she don’t try\nEveryone tells her but she doesn’t know why\nI said ‘Girl, if you lived in the sky\nI would buy a telescope just to look in your eyes’\nShe laughed a lil’ bit and she brushed it off\nBrushin’ her hair it’s so black and soft\nShe said her hair is just like her heart\nIt might look strong but it’s fallin’ apart\nAnd she knows that I got love for her\nI spend my life making sure I’m the one for her\nShe was with me on almost every van or bus\nYou’re not a fan of me, you’re a fan of us\nThe man I’ve become, husband and daddy\nI wanna make these two beautiful girls happy\nI wish that I could offer the world\nBut all I got is these words and a promise to give myself\nAnd all that I have, to have and to hold, for as long as I live\nI give myself and all that I have\nTo have and to hold, for as long as I live, I give\n\n[Hook]\nI give myself, is that enough for you?\nI will give myself to you\nI give myself, is that enough for you?\nI will give myself to you\n\n[Verse 3]\nShe's got a face like a porcelain doll\nHer big brown eyes make me feel so small\nShe got a smile that could light up the room\nThe smell of her perfume got me high, high...\nAnd she knows that I would die for her, but that wouldn’t save her soul so I give myself\nAnd all that I have, to have and to hold, for as long as I live\nI give myself all that I have, to have and to hold, for as long as I live, I give\n\n[Hook]\nI give myself, is that enough for you?\nI will give myself to you\nI give myself, is that enough for you?\nI will give myself to you", "year": "2010-04-27", "album": "Weapon Aid"}], "artist": "Braille"}