{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Sigel] It's a man's world\n\"This is a man's world!\" -] James Brown\n[Sigel] Bitch, uhh\n\"This is a man's world!\" -] James Brown\n[Sigel] Man's world prick, yeah\n\"This is a man's world!\" -] James Brown\n[Sigel] Man's world - all y'all little kids out there\n[Sigel] run around with y'all little gats, man\n\"This is a man's world!\" -] James Brown\n[Sigel] Man's world - go to summer school nigga, get your G.E.D\n\n[Beanie Sigel]\nYeah, this a man's world pricks, no broads allowed\nAll my niggas with that raw allowed\nAll my niggas with they fours allowed\nWho won't hesitate to bang a nigga - right in between they brows\nLet's roll, fuck them bitch-ass niggas, wearin thongs and skirts\nTryin to catch 'em while they goin to work\nHit them niggas on they job at they lunch break, make the pump quick\nLeave 'em ump-slayed when the fuckin pump spray\nI roll with a sick all-out squad\nTen deep, let's roll-out squad\nBring heat when it's cold outside\nMack stick to script and stick to street\nStick in clip and flip your Jeep\nGot extended shit and different heat\nMack M-1 double now {*bluk, bluk, bluk*}\nI'm knockin feathers out your bubble-down\nStop the blood claat cryin\nBlood claats from the iron, you're dyin, no lyin\n\n[Hook: Beanie Sigel]\nThis a man world nigga, sit down you girl niggas\n\"This is a man's world!\" -] James Brown\nMan, this a man world nigga, sit down you girl niggas\n\"This is a man's world!\" -] James Brown\nThis a man world nigga, man.. man..\n\"This is a man's world!\" -] James Brown\nThis a man world nigga, FUCK what people think\n\n[Beanie Sigel]\nThis a man's world bitch, all you whores bow down\nIt's B. Sig., I pimp like TA-DOW - peep game\nI sling meth in vials, hit your kitchen cook your pies up\nBring the coke back in piles, I'm that (?) ..\n.. oh yeah I almost forgot\nBitch, get a foot up your ass\nIf you don't get your foot on that ave and start lookin for cash\nJust get mine right, your money like, don't make me come out there\nI smacked you whore and get you done right there\nLeave this imprint 'cross your forehead, from the moray\nBitch know my forte, I'm not for-play\nHit your block, let the Glock four-play\nFinger fuckin a trigger is not fore-play\nOne more time - I'm not for-play\nIt's a man's world - how it's supposed to go\nOnly the soldiers roll, you young like Calogero\nI move like Sonny, but never backwards\nWeave in and out of traffic, holdin that package\nWeight don't get moved, it get pressed off the bench\nMove through an alley and a hole in the fence\nI see when you move you tense\nIt's a man's world nigga, sit down you girl niggas\nIt's a man's world kiko, they shoulda told you from the get-go\nThat you fuckin with them South Philly sickos\nThink it's all raps 'til them gats start to hit you\nBlack talons cripple, Operation Lockdown the town with them nickels\nDopeman, dopeman!\nBut peep it, I ain't goin to court\nI bang people that be goin to court\nAnd know people I ain't goin for shorts\nBring straight money, cake money\nThat tan coat, razor blade, straw plate money\nThat grab coke, never weigh to pay for it money\nGrab toast laser hater break for it money\nShit, you think you fast? Run nigga, dumb nigga\nDon't get your skin grafted up, chin tacked up\nFuck around, and get your men racked up\nWhatchu think all the gats is for, you can't last a war\nIt's a man's world nigga, sit down you girl niggas\n\n[Hook]", "image": "https://images.genius.com/bf8c5034f8552cd568d53398bc41222f.500x500x1.jpg", "year": "2001-06-26", "title": "Man’s World", "album": "The Reason"}]}