{"artist": "Canibus", "songs": [{"title": "Freestyle 97", "album": null, "year": null, "image": "https://images.rapgenius.com/9097bb4ab35b75bd04dfc1e9b8d6049f.236x236x1.jpg", "lyrics": "Yo!, i speak at frequencies dogs would have trouble hearing\nCanibus is the lyrical version of german engineering\nRaw metaphors keep you high for months\nFly around the earth twice without refueling once\nAin't too many categories i can fit in when it comes to spittin'\nCause i'm over-qualified for the position\nThe laser-guided lyrical hybrid creating scripts so sick\nI gotta arm-wrestle my pen to write it\n\nDon't get excited\nCause if I ever catch one of you wannabees bitin\nWe gonna be fist-fightin\nSo mother-fuckers, what you want? i got the shotgun, pumped\nYou feel like a frog nigga then jump\nI possess the lyrical ammo to battle\nI'll rip any one of you warm-blooded mammals to shambles\nI'll make examples of you and eat a mouthful of your crew\nThe kind of MC you can't outdo\nI battle you on the 'net, I battle you in the flesh\nI battle you over the phone, you can call me collect\nI battle you for the respect, I battle you over a blank check\nI battle you with a gun to my neck\nI battle you standing over the toilet with my dick out\nI battle you juggling a hand-grenade with the pin out\nIn a stolen car with the VIN number ripped out\nDrinking a guinness stout doing a 360 spin-out\n\nI stay righteous like Farrakahn puffing on the marijuana\nYou understand where i'm coming from?\nYou're number 1, then i'm negative 2\nBasically nigga that means I'm still better than you\nBasic mathematics the verbal mechanics of rhyming\nBehold, i crush a piece of coal and create a diamond\nOn the microphone i'm sicker than those\nWho have acquired immune deficiency syndromes\nAnd every word i utter for hip-hop lovers\nWill reflect forever like two mirrors facing each other\nThe baddest  m-other  f-ucker\nLet me break the style down so you don't have to wonder\nI walk the b—lock with  G—lock    C—ocked\nTrying to get the D.R. OP    on the C—ops\n\nBlow spots, capsize boats, shipwreck yachts\nHeadshots hit you with 300 nautical knots\nYou calling the cops complaining about the hip hop\nGettin benjmanis like the L-ocks; it don’t stop\nEh-eh-eh-eh  put away your burners/ You can't serve us\nMy whole camp is allergic to being murdered\nMetaphors are proof\nI got more than just a couple screws loose\nLatinos call me da black Jesus\nSo all who believe in telekenesis and Jesus\nI'll touch a parapalegic and heal him"}]}