{"songs": [{"year": "2010-11-22", "album": "My Beautiful Dark Twisted Fantasy", "image": "https://images.genius.com/31f9198f646ae211d8fe2c855e6ea4d0.998x998x1.png", "title": "Blame Game", "lyrics": "[Produced by DJ Frank E, Kanye West & Mike Dean]\n\n[Intro: Kanye West]\nWhose fault?\n\n[Chorus: John Legend]\nLet's play the blame game, I love you more\nLet's play the blame game for sure\nLet's call out names, names, I hate you more\nLet's call out names, names for sure\n\n[Verse 1: John Legend]\nI'll call you bitch for short\nAs a last resort and my first resort\nYou call me motherfucker for long\nAt the end of it, you know we both were wrong\n\n[Chorus: John Legend]\nBut I love to play the blame game, I love you more\nLet's play the blame game for sure\nLet's call out names, names, I hate you more\nLet's call out names, names for sure\n\n[Verse 2: Kanye West]\nOn a bathroom wall I wrote\n\"I'd rather argue with you than to be with someone else\"\nI took a piss and dismiss it like \"fuck it\"\nAnd I went and found somebody else\nFuck arguing and harvesting the feelings\nYo, I'd rather be by my fucking self\nTill about two a.m. and I call back\nAnd I hang up and I start to blame myself\nSomebody help\n\n[Chorus: John Legend]\nLet's play the blame game, I love you more\nLet's play the blame game for sure\nLet's call out names, names, I hate you more\nLet's call out names, names for sure\n\n[Verse 3: Kanye West]\nYou weren't perfect but you made life worth it\nStick around, some real feelings might surface\nBeen a long time since I spoke to you in a bathroom\nGripping you up, fucking and choking you\nWhat the hell was I supposed to do?\nI know you ain't getting this type of dick from that local dude\nAnd if you are I hope you have a good time\n'Cause I definitely be having mine\nAnd you ain't finna see a mogul get emotional\nEvery time I hear bout other niggas is strokin' you\nLying, say I hit you, he sitting there consoling you\nRunnin' my name through the mud, who's provoking you?\nYou should be grateful a nigga like me ever noticed you\nNow you noticeable and can't nobody get control of you\n1 AM and can't nobody get a hold of you\nI'm calling your brother's phone, like, what was I supposed to do?\nEven though I knew, he never told the truth\nHe was just gon' say whatever that you told him to\nAt a certain point, I had to stop asking questions\nY'all got dirt on each other like mud wrestlers\nI heard he bought some coke with my money\nThat ain't right, girl\nYou getting blackmailed for that white girl\nYou always said, \"Yeezy, I ain't your right girl\nYou'll probably find one of them 'I like art'-type girls\"\n\"All of the lights,\" she was caught in the hype, girl\nAnd I was satisfied being in love with a lie\nNow who to blame? You to blame?\nMe to blame? For the pain\nAnd it poured every time when it rained\nLet's play the blame game\n\n[Chorus: John Legend]\nLet's play the blame game, I love you more\nLet's play the blame game for sure\n\n[Interlude: Kanye West]\n\"Things used to be, now they not\nAnything but us is who we are\nDisguising ourselves as secret lovers\nWe've become public enemies\nWe walk away like strangers in the street\nGone for eternity\nWe erased one another\nSo far from where we came\nWith so much of everything, how do we leave with nothing?\nLack of visual empathy equates the meaning of L-O-V-E\nHatred and attitude tear us entirely\"\n—Chloe Mitchell\n\n[Chorus: Kanye West]\nLet's play the blame game, I love you more\nLet's play the blame game for sure\nLet's call out names, names, I hate you, more\nLet's call out names, names, for sure\n\n[Bridge: Kanye West]\nI can't love you this much, I can't love you this much\nI can't love you this much, I can't love you this much\nI can't love you this much, no, I can't love you this much\nI can't love you this much, I can't love you this much\n\n[Outro: Kanye West]\nAnd I know that you are somewhere doing your thing\nAnd when the phone called it just ring and ring\nYou ain't pick up but your phone accidentally called me back\nAnd I heard the whole thing\nI heard the whole thing, the whole thing, the whole thing\n\n[\"The Best Birthday\": Chris Rock & Salma Kenas]\nOhh, my God\nBaby, you done took this shit to another motherfucking level!\nNow, a neighborhood nigga like me ain't supposed to be getting no pussy like this\nGoddamn, Goddamn!\nWho taught you how to get sexy for a nigga?\n(Yeezy taught me)\nYou never used to talk dirty, but now you God damn disgusting!\nMy—my God, where'd you learn that?\n(Yeezy taught me)\nLook at you, motherfucking butt-ass-naked...\nWith them motherfucking Jimmy Choos on...\nWho taught you how to put some motherfucking Jimmy Choos on?\n(Yeezy taught me)\nYo you took your pussy game up a whole 'nother level!\nThis is some Cirque du Soleil pussy now! Shit!\nYou done went all porno on a nigga, okay? And I, and I love it...\nAnd I thank you, I thank you, my dick thanks you!\nHow did you learn, how... how did your pussy game come up?\n(Yeezy taught me)\nI was fucking parts of your pussy I'd never fucked before!\nI was in there like \"Oh, shit! I never been here before!\nI've never even seen this part of Pussy Town before!\"\nIt's like you got this shit reupholstered or some shit. What the fuck happened?\nWho, who the fuck got your pussy all re-upholstered?\n(Yeezy re-upholstered my pussy)\nYou know what, I got to thank Yeezy. And when I see that nigga, I'ma thank him. I'ma buy the album, I'ma download that motherfucker, I'm-a shoot a bootlegger!\nThat's how good I feel about this nigga\nOww, I still can't believe you got me this watch!\nThis motherfucker is the exact motherfucker I wanted!\nEven with the bezel! This is the motherfucker I wanted!\nI saw this shit, I saw it, Twista had this shit on in The Source!\nI remember, Twista had this motherfucker on in The Source!\nThat's right, that's right! Yo yo babe, yo yo this is the best birthday ever!\nWhere'd you learn to treat a nigga like this?\n(Yeezy taught me)\nYeezy taught you well\nYeezy taught you well"}], "artist": "Kanye West"}