{"artist": "King T", "songs": [{"image": "https://images.genius.com/1be8875f252ab97264f07d49cfc3aac4.599x599x1.jpg", "title": "Check the Flow", "year": null, "album": "IV Life", "lyrics": "* not 100% sure this is the MC's name\n\n[Hook]\nWe got them, Sledge, (?) ruff heads (check the flow)\nKing Tee's on the set (check the flow)\nWhen niggas try to get high-tech (check the flow)\nThe dialect's on the flex\n\n[Sledge]\nWatch this, when I shine I bring rain\nClouds, bust storms, yo, this ain't the norm\nWhen I perform, I get you up out your seat\nGet down with the real deal skills, then chill\nThen show your ass how to get amped, then lamp\nStretch, flex, then tackle what's next\nCause MC's, that luck up, need to hush up\nWho can't brush up, on their rap style, shut the fuck up\nThen duck from the one that gets buck-wild\nI chop your ass in half, with a smile\nBig grin, all teeth, for those who got beef\nFuckin with me ock, you're six feet deep\nDown in the ground, alone with no sound\nWhile I'm up here CHILLIN, top billin\nAnd illin, on all those, who oppose\nI wanna take one more shot, strike a pose, uhh!\n\n[Hook]\n\n[King Tee]\nSmash, here comes the one that talks trash\nTo garbage MC's, who try to diss me\nAnd my crew - the ill ville animal cannibal\nBackbreakers, government amputators\nBounce to this if you think you know the hits\nAnd all you gassed-up critics, put the brakes on the shit\nCause I'm tired of this, and I'm tired of that\nMotherfuckers sayin King Tee's shit was wack\nBut in fact, my rhymes crack backs and make money stacks\nBy the truckload, now let's go for the gold\nSo strap on your seatbelt yo and let's go\nAnd get down, to the sound that burns quick\nCause I'm about to burn rubber, on this number\nAnd any MC who claims his style is legit\nSuckers wanna try me? (I know not why Tee)\nI light that ass up like the 4th of July G, uhh!\n\n[Hook]\n\n[T] Check the flow, check the flow, check the flow yo\n[S] Check the flow, check the flow, check the flow yo\n[T] Check the flow, check the flow, check the flow yo\n[S] Check the flow, check the flow, check the flow\n\n[Sledge]\nCapital S-L, crooked letter humpback fuck that\nThump that, shit that's never wack\nCause this goes out too all the niggas that we rushin\nTo hear the shit I'm bustin over ruptured percussion\nIt ain't my fault that I'm layin niggas down like asphault\nAnd blow your ass away like chalk, dust\nThen crush your monkey-ass unto the side\nCause wrecked dialect is causin lyrical genocide\n\n[King Tee]\nI stress facts like IRS wants tax\nFrom anyone claimin that they're livin, kind of fat\nYou see, I could get sick in the thick of shit\nI turn my toes up, when it goes up, my foe's butt\nHey nigga back-steps, even you can get hit\nI'm more crankier than a bitch on the shit!\nNiggas get heated cause they just got defeated\nBy the two man team, the Sledge and the King, uhh!\n\n[Hook]"}]}