{"songs": [{"title": "Really Scared", "album": "Hump Days", "year": "2014-10-01", "image": "https://images.genius.com/75145c356837ef95317b2e1192749c65.1000x1000x1.jpg", "lyrics": "[Intro: Lil Dicky]\nYeah, I feel like people are really weird about admitting when they're scared\nIf you're not scared ever, you're just lying or something. You're being weird\n\n[Verse 1: Lil Dicky]\nTen days in the Bay left\nAnd I don't mean to overthink that\nGot a one-way straight to LAX\nAnd I ain't blinked yet\nI know you think that\nI done figured out this whole thing\nLike where his chink at?\nSegue to Lil Dicky getting bigger than Yao Ming\nBut can I shrink that? Where my shrink at?\nI don't know what to feel, everything has gotten totally real\nEverything I always wanted right in front of me with nobody near\nSo it's weird that I'm overly scared, but I'm so unprepared\nHolding a beer, I'm witholding the fear\nNot in the clear but I'm kind of revered\nAnd yeah I might appear like the chill type\nThe veneer's not real in the real-life\nWhat it feel like?\nThanksgiving I was missing, I ain't even miss 'em\nGirlfriend hella distant, I ain't even listen\nOnly shit I really care about is spittin writtens\nThis is the beginning\nI'm just getting into the game\nMy world's not spinning the same\nThe shit looking like it's bigger than Dave\nIt's so crazy\nBut when all this sit in the stake\nI can't brake\nEven if I'm afraid it might change me\n\n[Pre-Chorus: Azadeh]\nBaby if you let me\nYou know I could get deep\nBaby hope you ready\nI'm coming through\nRunning you\nThat's what I do\nJust know that it's all for you\nSo what you gonna choose?\nAfraid to say OK\n\n[Chorus: Azadeh]\nAnd I know I'm not gonna get in the way\nBut I'm afraid\nWho I want to be is what I became\nBut I'm ashamed\nAin't no coming back\nFacing what I wanted\nBut it's all fucking weird\nAnd now I'm really scared\n\n[Verse 2: Lil Dicky]\nI ain't made from the projects\nBut you know I treat the game like a project\nSo you know it's not the same kind of progress\nDifferent process, but I digress\nOther rappers didn't blow overnight\nThey ain't have a 9-5 that was totally ripe\nThey was all up on the grind from the moment they write\nAt 25, hadn't even done a show in my life\nIt's like - \"Damn, I'm a rapper, how did that happen?\"\nI was making ass then back when\nOnly used to rapping to my Mac then pack then\nViews came through, like \"Shoot, let's practice\"\nTrying to tell you I'm not bred for this shit\nDespite that, feeling like I'm meant for this shit\nBut like that, everything depends on this shit?\nAnd I ain't betting against it\nBut I ain't had a moment to reflect what I'm betting against it\nI'm next even though it's pretentious, I sense it\nRelentless, but it leave me defenseless\nI guess I should learn to accept it but it's hectic\nOh, you want a condensed list?\nI'm worried that I'm about to give my all to it, 100%\nYou ain't got to know it all to discover what's left\nPretty fucking intense\nAnd I'm worried that I got a lot of gall when it comes to success\nTelling y'all that it's 100%\nBut what happens if I fall short of what I call the surest of bets?\nCause what's 100%?\nWhat's 100% is that it'll take a lot to make me content\nAnd I'm about to chase around a legend that I fucking invented\nWhile I'm neglecting everybody that I love and respected\nBecause I hate the thought of coming in second\nAnd I don't want to do no second guessing when it comes to progressing\nBecause I really couldn't stomach regretting my effort\nWhen I'm at the end and I'm assessing if I could have done better\nI better be able to be it than never, or be the best ever\nBut if somehow I'm really that special then I'm about to deal with mad pressure\nI fear that when I finish my assessment I'mma be in depression\nBecause I'll see a lot of me is regressing\nIt's obvious to me that to be the best a lot of me is repressing itself\nI wonder what I'll see in reflections?\nI wonder if I'll run into a woman, cool, but come in second\nOr if I'm bound to be the fool at the weddings\nAlone and regretting the whole thing\nNow you're seeing why it's so big\nWhat would y'all do if y'all were the old me?\nGet involved and you gotta give the whole thing\nThis is no fling, this devoting\nEvery mother fucking part of yourself\nNo matter whatever the cards you was dealt\nYou going all in\nI don't know about y'all, but I'm gone\nAnd I don't know if I'm balling or bawling\n\n[Pre-Chorus: Azadeh]\nIf you let me\nYou know I could get deep\nBaby  hope you ready\nI'm coming through\nRunning you\nThat's what I do\nJust know that it's all for you\nSo what you gonna choose?\nAfraid to say OK\n\n[Chorus: Azadeh]\nAnd I know I'm not gonna get in the way\nBut I'm afraid\nWho I want to be is what I became\nBut I'm ashamed\nAin't no coming back\nFacing what I wanted\nBut it's all fucking weird\nAnd now I'm really scared"}], "artist": "Lil Dicky"}