{"artist": "Kid Cudi", "songs": [{"image": "https://images.genius.com/854fa85e9ebd6f2af80c0040cdd56b2e.1000x1000x1.jpg", "title": "Handle With Care", "year": "2015-12-04", "album": "Speedin’ Bullet 2 Heaven", "lyrics": "[Verse 1]\nPardon me babe, there are instructions I think that you should read\nI'm a madman, I cause problems that I truly never mean\nI'm damaged, I trust no one, sometimes I can be real mean\nTo a magnitude extreme, I'm sorry but\n\n[Chorus]\nHandle with care, so fragile and delicate\nHandle with care, I'm so fragile and delicate\nHandle with care, so fragile and delicate\nHandle with care, here's your warning\n\n[Verse 2]\nPardon me babe, there are instructions I think that you should read\nMy heart it has no chill, I can sense everything\nI love from deep inside, but there are pains I hope to fix\nI have no bag of tricks, it's just you should\n\n[Chorus]\nHandle with care, so fragile and delicate\nHandle with care, I'm so fragile and delicate\nHandle with care, so fragile and delicate\nHandle with care, here's your warning\n\n[Outro]\nWhy, why, why, why, why, why, why, why, why, why, why, why\nWhy, why, why, why, why, why, why, why, why, why, why, why\nWhy, oh why me, me?\nWhy, oh why me?\n\n[Skit]\nBeavis: \"I don't know, Butthead. I'm feeling kind of... I don't know.\"\nButthead: \"Wuss.\"\nTeacher: \"Come on, Butthead, m'kay? Sometimes when you have a very powerful artist like Cudi, it's possible that his songs invoke certain emotions and feelings and those feelings are valid, m'kay? You know, another thing that brings up some of these feeling is hallucinogens, which I know both of you have been doing, m'kay? So why don't you just sort of relax and take this as an opportunity to meditate, m'kay? Go inside yourselves, look inward\nButthead: \"Yeah Beavis, look inward. Look up your butt.\"\nBeavis: \"Shut up Butthead, your vibe's all wrong. You're not on the same frequency, butthole. You just don't get it Butthead, you just don't get it.\""}]}