{"songs": [{"title": "Deja Vu", "album": "Church Clothes 3", "year": "2016-01-15", "image": "https://images.genius.com/ecf271772aa0af61304b89a07eb15401.1000x1000x1.jpg", "lyrics": "[Intro: Lecrae]\nYeah, the whole world's gone crazy\nPeople riot in the streets\nKillin' unborn babies\nCatchin' shots from police\n\n[Verse 1: Lecrae]\nNever thought that I would see the day\nWhen I would have to pray for God to hold me down\n'Cause Lord, I feel like giving up today\nI feel like giving up the faith\nI swear these people fake, I swear they full of hate\nI swear to tell the truth until I'm in the grave\nShots-shots fired, everybody quiet\nTryna hear the preacher, he ain't preachin' to the choir\nPreachin' to the riots that he got fired\nHe ain't got no Medicare, sippin' liquor in his chair\nBlank stare, need a blank check, where your bank at?\nBabies had a birthday, they gon' need a rain check\nRich man need a vacation, hop a plane\nBroke man need a vacation, Mary Jane\nWalk outside and everything is lovely\nButterflies in my stomach from this girl I wanna see\nParty in the neighborhood and everybody on the street\nThey was on that Stevie Wonder now it's Frankie Beverly\nI done seen days go crazy, time fly by\nMaybe it was yesterday or maybe 65\nPeace then war, born then die\nAll too familiar, more lifetimes\n\n[Chorus 1: Lecrae]\nOne time for the memories, two times for the crew\nThree times for the love, y'all\nAnd four times for the truth\nAnd some days are a nightmare\nAnd some dreams come true\nBut the Lord's still right there\nIt's just déjà vu\nIt's just déjà vu, déjà vu\nIt's just déjà vu, y'all\nIt's just déjà vu\nIt feel like Tribe Called Quest, it feel like De La Soul\nIt feel all too familiar, it feel like déjà vu\n\n[Verse 2: Lecrae]\nI said I love you, hit the door\nGot a mission, gotta go\nYeah, it's cold, but I'm gon' pursue that\nShe said she love me but she know\nI'm too old to be waiting for a handout, boy you knew that\nAnd if they try to keep me down\nHold my ground 'til they all look around\nAnd they wonder, \"Who that?\"\nThey don't respect my mind or respect my grind\nSo I told her, \"I got to do that\"\nNow maybe I was talkin' to my lady\nBut I think I told my mama same thing\nI told her I was all about the action\nAnd then I got Ghostface in my dream\nDéjà vu, parlez-vous français? Quoi de neuf?\nEverything the same under the sun, that's why we burnin' up\nDon't believe astrology, but man, I hated cancer\nBreast, lung, throat, blood, prayin' for an answer\nSeem like it was yesterday, they came and took your breath away\nAnd I ain't get a chance to tell you everything I want to say\nNow they say your sister got it too\nYeah, they say it's true\nGuess it's never finished 'til it's you\nDéjà vu\n\n[Chorus 2: Lecrae]\nOne time for the memories, two times for the crew\nThree times for the love, y'all\nAnd four times for the truth\nAnd some days are a nightmare\nAnd some dreams come true\nBut the Lord's still right there\nIt's just déjà vu\nIt's just déjà vu, déjà vu\nIt's just déjà vu, y'all\nIt's just déjà vu\n\n[Outro: Lecrae]\nIt's just déjà vu, déjà vu\nIt's just déjà vu, y'all\nIt's just déjà vu\nAnd some days are a nightmare\nAnd some dreams come true\nBut the Lord's still right there\nIt's just déjà vu"}], "artist": "Lecrae"}