{"artist": "G-Eazy", "songs": [{"title": "Legend", "album": "The Beautiful & Damned", "year": "2017-12-15", "image": "https://images.genius.com/0d2177adfa27f145143e3e5a0ec2e943.440x440x1.jpg", "lyrics": "[Intro]\nYeah\nI'm back drinking whiskey\nOZ on the beat, yeah\n\n[Chorus]\n(Aight, aight)\nNeeded a reason to go off I think I found one (I think I found one!)\nDon't know what legend is until you been around one (been around one!)\nWe poppin' champagne on a jet, think I been wildin' (you're wild!)\nBottle after bottle, I just drank a gallon (yee! yee!)\nSince I was young they say that boy he got some talent (he's good!)\nI put some gold up on my teeth and my medallion (bling!)\nMy favorite time of day, the name my second album (yeah)\nThe sun go down it's like a monster just came out him\nYeah\n\n[Verse 1]\nI just wanna chill and tuck off with a bad one\nMan, y'all be stressing me, ah, fuck I need a Valium\nI remember when I first made thirty thousand\nAnd now I spent that on some dinner, eat Italian (yeah, linguine!)\nWe really did it, bruh, we came up from the bottom (yeah)\nIt's what it is, I swear I see it how I call it (yeah)\nI swear you're lookin' like a L, you're not far from it (yeah)\nAnd I just go into the booth and then I vomit (yeah)\nThe neighbors knocking, all complaining bout the volume (yeah)\nI bought the house, bitch I don't understand the problem (yeah)\nThey bite the swag off, stealing juice, I swear they robbin' (yeah)\nI swear my lifestyle '97 Dennis Rodman\n\n[Chorus]\n(I-I)\nNeeded a reason to go off I think I found one (I think I found one!)\nDon't know what legend is until you been around one (been around one!)\nWe poppin' champagne on a jet, think I been wildin' (you're wild!)\nBottle after bottle, I just drank a gallon (yee! yee!)\nSince I was young they say that boy he got some talent (he does!)\nI put some gold up on my teeth and my medallion (bling!)\nMy favorite time of day, the name my second album (yeah)\nThe sun go down it's like a monster just came out him\nYeah\n\n[Verse 2]\nI just want to pull off in that Testarossa (Vroom!)\nI just sent a text and then that bitch came over (hi!)\nMan, I be faded, faded, rarely am I sober (I'm gone!)\nAnd you ain't got it, you a muthafuckin' poser (bitch!)\nShe wanna fuck, eeh, I'm not mad at it\nIt's all right there, man, you just gotta go and grab it (yah!)\nI text I want her, then I fly her like Aladdin (woo!)\nBut if she ain't the baddest, then I put her in main cabin (sorry)\nThey follow me at the party, I walk around it (yeah)\nLike, \"Is it me, or did this room just get crowded?\" (fuck off)\nAnd they's some sixes up in here, like who allowed in? (who?)\nShe thinks she's got a chance, I really fuckin' doubt it\n\n[Chorus]\n(I-I)\nNeeded a reason to go off I think I found one (I think I found one!)\nDon't know what legend is until you been around one (been around one!)\nWe poppin' champagne on a jet, think I been wildin' (you're wild!)\nBottle after bottle, I just drank a gallon (yee! yee!)\nSince I was young they say that boy he got some talent (he's good!)\nI put some gold up on my teeth and my medallion (bling!)\nMy favorite time of day, the name my second album (yeah)\nThe sun go down it's like a monster just came out him\nYeah\n\n[Outro]\nDr. Jekyll and Mr. Hyde, yeah\nYeah\nWoo!\nYee!\nHa ha ha"}]}