{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/388a3fc91272e70e238175478ed0b1f1.1000x563x1.jpg", "year": "2019-03-10", "album": null, "lyrics": "[Intro]\nYelawolf\nCatfish Billy\nM.W.A., Ghetto Cowboy, motherfucker\nBrian Jones\n\n[Verse]\nYeah, never had to walk away from anybody\nAlways been about it from the jump\nYeah, never been a hater, never gave a fuck about a hater\nNever been a punk\nYeah, been an innovator, fuck a imitator\nDrop another hot potato, son\nTake 'em back to Piedmont Park\nWith Baby D and the Kings of Crunk\nRest in peace Grip Plyaz, Speakerfoxxx, and Lenny's Bar\nRest in peace Zoo, you ain't dead but to me you are\nStill Dixie Mafia bitch, still wavin' that flag, I'm\nNew South in everything I drop, whether I sing or rap, ask Dax\nSuit up, you gonna need a hazmat\nLeavin' these fuckers chewed up\nLike a muskrat in a backpack\nI'll hang up the Ku Klux and I ain't got to act black\nI'll crack a cracker like I crack a plastic bag of Cracker Jacks\nPull up your bra, quit spillin' your guts\nYou better cork your bottle\nYou feelin' yourself, like jerkin' off to my tunes\nYou willin' to bet, I'll make a splash like potholes\nAfter it rains, with your name just like a snot nose\nYou'll be runnin', tryin' to escape what's comin'\nBut the exit's blocked, you're fucked, oh to be a woman\nThere's only one Michael Wayne, there's only one Klever\nAs for the other white boy from Gadsden, psh, whatever\nYou're welcome, now take that petty diss and run with it\nFuck around and I'll surround you like circumferences\nYou build a house of hate around what I have brung to this\nGame, I'll make that place your home\nLike the Sons of Mumford did\nLame, I'm all the way up, woke, turnt\nYou think you flame, you all the way suck, choke, burnt\nBitch I'm on fire like holiday nuts, holdin' firm\nYou want the doe, I'm all the way buck, you'll learn\nHop in the backseat bitch, hip-hop is snoozin'\nYou could use an Uber, like a student pupil\nI'm a teacher, reach ya hand for the ruler, I'ma bruise your ego\nAbuse and move into the hall, against the wall, stupid\nWho's the man? Who's the tutor?\nLead is flyin' 'til they dead or cryin'\nThe police are saying now, \"Who's the shooter?\"\nHere I go, with a trench coat and a black rifle\nTen toes down up like a light pole\nMiddle finger up like a black rhino's horn\nI was born for the storm, I'm at home in a shit cyclone\nNever let bygones be bygones\nRather I'll say, \"See ya later, adios,\" bitch\nRappin' obese is just bygone\nNever thought the culture that I loved would be this sleazy\nThese videos all look alike, no wonder they can't see me\nIs this the guy that said he was the hottest white boy\nSince the one with dyed blonde hair? What the fuck?\nHold up, G—easy\nI can't let this Tom Cruise-lookin' motherfucker just paddle by\nDon't know if I'm watchin' Vanilla Ice or Vanilla Sky\nMarshall Mathers may have ignored you\nBut if you want the smoke, bring the foil\nI'll boil you 'til the kettle's dry\nHave a nice day, suave\nI'm a different breed, I'm a wolf, okay?\nGot so many styles I could be a wardrobe, boy\nSo little boy flows some O.J. poured in the glass\nWith your buttermilk pancakes\nMama's little helper, Daddy's little bae\nPut the Bébé Kids in my Chevrolet\nBrought the pepper spray and a banana for AKs\nBitch, holler, \"Mayday, mayday\"\nThen take it to the bank, it's another payday\nOh, you a baller? Well, take the ball and\nLet me here kick that shit, Pelé\nThe nerve of the shit they say, I'm permanently amazed\nAnd your whiskey sucks, fuckin' one sip\nI wanted to go straight back to AA\nWho else? I would diss Post Malone but he don't even rap\nFuck it, fuck Post Malone, just because\nLet's see if he answers back\nAll that chain stitchin' from Chill Bill\nAnd the cowboy boots and hats\nDamn, Posty, can't we be friends?\nOur clothes already match\nPoser, biter, appropriation thief\nGive a fuck how many records you sold\nEvery fan you made is a leaf off of my tree\nBoy, you're my seed\nAnother mullet in the gang with the teeth icy\nI just picked a bone with Post Malone\nAnd did it all on a B-side beat\nDribble through the middle up\nCrossover on 'em like I'm in the NBA\nLook, I don't really give a fuck\nTell me, what do I gotta lose anyway?\nStill mobbin' in the pickup\nThrow a middle finger out the window when I wave\nTrunk Muzik III, bruh, you gon' know how I feel about MGK\nBeethoven is rollin' over in his grave\n'Cause I'm a conductor and a conduit\nOf musical energy, electrical wave\nProdigy of an anomaly, Shady\nBumpin' daily somethin' crazy, someone save me\nNothing made me somethin', baby\nNo one's playin', fuck you, pay me\n\n[Outro]\nTrunk Muzik III", "title": "Bloody Sunday Freestyle"}]}