{"songs": [{"title": "Benihana", "lyrics": "[Verse 1: Jeezy]\nI had P's, I had keys and them shits don't open doors\nGot a house full of tanned white girls, Jersey Shore\nGot a thing for Ferraris, Lamboginis I adore\nAnd I treat em like my bitches, in and out em like they whores\nI say I love the way you grind but you shine even better\nWhen I take the time to shine I’m on my grind even better\nGot me hyped up in Valejo, they say they got that yayo\nThey say it’s weighin' up like a big bag of potatoes\nSomething 'bout them freak hoes, a song to my ego\nDamn right I’m talkin' chips like a big bag of Doritos\nWhip that pistol and that work all day, Three Amigos\nWhat’s it take to brighten up your day? 30 kilos\nYou can send the clucker so you don’t know me sucka\nI ain’t no Tiger Woods, I took them golf balls to Augusta\nI hit the highway, Rush Hour, Chris Tucker\nI'm ridin' dolo, Lethal Weapon, Danny Glover\n\n[Hook: Jeezy]\nI know it’s gotta make ya wonder, my chain lightning and thunder\n10 years in the game, now I keep from going under\nThe money in my bag smell like blow and marijuana\nI’ll whip it right here in yo face, Benihana\nWhip it right here in yo face, Benihana\nDon’t make me whip it right here in yo face, Benihana\nGotta make you wonder, keep him going under\nI’ll whip it right here in yo face, Benihana\nYea, hah! Paula Deen, we in the kitchen nigga (kitchen nigga)\nHey! I’m at Gio’s cookin chicken nigga\nHuh! Greg Maddux, yeah we pitchin' nigga\nThey call him Frank Lucas cause he snitchin' nigga\n\n[Verse 2: Rocko]\nSpot, doin numbers, got a valet car\nHour 30 minute wait, gotta stand at a bar\nNo shirt, iced out ho, Liberace\nStand up over the stove, cook it right in front you, Hibachi\nNigga try to repeat the recipe but they some shrimps\nI'm a don, nun but lobster for the mobster\nFish fish fish, yo salmon want beef, nigga what’s happenin'?\nCook you well done, filet mignon\nScramble the eggs, chop the onions\nShit stink, baby say it smell like funions\nRocko the Chef, no Raekwon though\nKarate chop that chicken… taekwondo\n\n[Hook]\n\n[Verse 3: 2 Chainz]\nFire fire fire, killed him double life\nSea food combination, give me double rice\nPoltergeist got your girl freakin' out\nPut me on a box of Arm and Hammer, fuck a Wheaties box\nCity locked and I got my semi cocked\nPull up in that motherfucker with the titties out\nPut me on the block, bet I’m sellin' out\nPut me on a boat, yea I’m sailing out\nGot my bank account hyperventilating\nIf I say fuck you that mean I’m penetrating\nReal nigga shit, I represent the south side\nI spell it with a F and the F stand for fire!\n\n[Hook]", "album": "ItsThaWorld Vol. 2", "year": "2013-11-15", "image": "https://images.rapgenius.com/e87acbfc443e3edd4fe7bb89c1ef20ad.500x500x1.jpg"}], "artist": "Jeezy"}