{"artist": "Rich Homie Quan", "songs": [{"lyrics": "[Intro]\nDaddy this for you\nHm, haha\n\n[Verse 1]\nDaddy\nI had just got off the plane, I needed some sleep (I did)\nMontae kept calling my phone, repeatedly\nI didn't wanna talk, I ignored his call 'cause I was sleepy\nThen when I picked up at 2 p.m\nHe told me my daddy had got shot, four times\nImmediately tears start coming down my eyes\nAnd I started crying (I cried)\n'Cause I ain't know if he was gon' make it\nThem hospital folks weren't sayin' shit (What?)\nI was just tryna be patient (Yeah)\nWhen I seen him in that ICU room\nBoy, you know I went crazy (Oh, man)\nCause I couldn't see my daddy like that, that's my baby (My daddy)\nIn other words, he my best friend, talk to him daily (Okay)\nThem niggas who did it to him, I hope they praying (To who?)\nTo God but he can't help you in this situation (Nah)\n\n[Chorus]\nDaddy I gotchu (Daddy)\nDaddy I love ya (Daddy)\nDaddy my partner (Daddy)\nDaddy my best friend\nDaddy, this one here is for you (Daddy)\nDaddy, I'ma do it for you (Daddy, daddy)\nI'ma find out who did that to you (Daddy)\nI'ma find out who did that to you (Daddy)\nDaddy, just put your trust in me\nDon't worry about nothing\n'Cause I got 'em\nI'ma do it for you (Daddy)\n\n[Verse 2]\nI lost my mind when it happened at first (Daddy)\nDropped down straight to my knees and told God I'm glad I serve him (Daddy)\nTo see them tubes in his mouth yeah, it sadly hurt me\nMy mind, I wasn't tryna lose\nI was ready to kill any person (Daddy)\nAnybody who had anything to do with it\nI'm by myself, I don't need no help, no crew with me\nShot your daddy in his barbershop, nigga how would you feel? (Daddy)\nI pray that my daddy hang out, walk around for the rest of his life wit' a limp (What the news say?)\nThey hit him in his side four times\nTalk to him today, he said he walking with his head up so high\nAsked him how he made it through it?\nHe said one word, \"God\"\nPulling up like the Mob (Yeah)\nI know that he hurting but I just want to let you know\n\n[Chorus]\nDaddy I gotchu (Daddy)\nDaddy I love ya (Daddy)\nDaddy my partner (Daddy)\nDaddy my best friend\nDaddy, this one here is for you (Daddy)\nDaddy, I'ma do it for you (Daddy, daddy)\nI'ma find out who did that to you (Daddy)\nI'ma find out who did that to you (Daddy)\nDaddy, just put your trust in me\nDon't worry about nothing\n'Cause I got 'em\nI'ma do it for you (Daddy)\n\n[Outro]\nI'm gon' do it for you (Daddy)\nI'm gon' do it for you (Daddy)\nI'm gon' do it for you (Daddy)\nIf they ask me who I do it for\nYou gon' know I'm gon' tell 'em I do it for my\n(Daddy, daddy, daddy, daddy, daddy, daddy, daddy, daddy)\nThis is for my (Daddy)\nThis is for my (Daddy)\nThis for my daddy\nThis for my daddy\nI said this for my daddy\nThis for my daddy\nDaddy, get well soon\nWhy did you do that to my daddy? (Daddy)\nWhy did you do that to my daddy (Daddy), my daddy\nMy only question is \"why did you do that to my daddy?\" (Daddy)\nWhy did you do him like that\nHe ain't hurt nobody\nWhy you do him like that\nPlease don't ask no questions\nWhen I do you like that", "title": "Daddy", "year": "2015-04-28", "image": "https://images.genius.com/de2fdc28861bb7f4b83adb4771a85acc.412x412x1.jpg", "album": "If You Ever Think I Will Stop Going In, Ask Double R"}]}