{"songs": [{"title": "Feel Good", "album": "Debbie", "year": "2016-07-15", "image": "https://images.genius.com/797f7db266863fadcf70bc9358166861.1000x1000x1.jpg", "lyrics": "[Verse 1]\nYou know you fuckin' with the real now\nLi'l bitches better chill down\nFuck the fame, started out I didn't have a crumb to my name\nWe eatin' five course meals now\nAnd I'm still down, couple bands in the paper bag\nSwitchin' lanes with the paper tags\nType of swag that can make 'em mad\nTellin' bitches tryna take a jab\nI just fuckin' laugh, ha\nBitch, you better get it right\nI don't need the love, can I get a light?\nSpotlight, fuck your oversight\nBitches must've thought I got this overnight\nSilly hoes, really though\nBitch, you better know the deal\nHit 'em with some new shit\nSo you bitches know it's real overkill\nYou in the presence of the motherfuckin' ruler\nJust point me to the mission, I'm the driver and the shooter\nBitch, I get it\n\n[Hook]\nWhat it look like? Bitch, I feel good\nLeft the trap for this rap, but I'm still hood\nBitches livin' shit but they ain't livin' this good\nGot this paper on my own, wish a bitch would\nWhat it look like? Bitch, I feel great\nTop down, buck 50 on the interstate\nUsed to get it by the gram, now it's real way\nTurned the bitches that are hatin' and I'm still straight\n\n[Verse 2]\nStraight down so it's only looking up now\nAnd your city gettin' busy when I touch down\nMy days one's the only bitches that I trust now\nAll I need is weed and a swisha for me to buss down, on gawd\nBitches always asking how I do this shit?\nTime again I remind them I ain't new to this\nNumber one stunna always see me in the newest shit\nCouple bands, can't remember how I blew this shit, oh lawd\nToast to the bitches who told me I'll never do this\nLaughing at them bitches who told me we never be up\nNow the same bitches is salty and lookin' foolish\nNow it's paparazzi, red carpets I know you bitches see us\nI know you see us, and you hate to see me winnin' ha\nLove me back when I was broke in the beginnin' ha\nStill the same, I just had to change a lane up\nGet my change up, bitch, but I ain't never change up\n\n[Bridge]\nSo pour a cup, roll a blunt it's a celebration\nTo you sour ass hoes, it's a dedication\nSmilin' in my fuckin' face, they be hella hatin'\nCuz we eatin' over here, bitch, we hella cakin'\nYeah we hella cakin'\nYeah we hella cakin'\nIn the kitchen whip it proper, yeah we hella bakin'\nYeah we hella bakin'\nYeah we hella bakin'\nDebbie back to killin' bitches only god can save\n\n[Hook]\nWhat it look like? Bitch, I feel good\nLeft the trap for this rap, but I'm still hood\nBitches livin' shit but they ain't livin' this good\nGot this paper on my own, wish a bitch would\nWhat it look like? Bitch, I feel great\nTop down, buck 50 on the interstate\nUsed to get it by the gram, now it's real way\nTurned the bitches that are hatin' and I'm still straight"}], "artist": "Lil Debbie"}