{"artist": "Fat Joe", "songs": [{"year": "2005-06-14", "album": "All or Nothing", "image": "https://images.genius.com/07b605de3e64892070232ced7e01e190.1000x1000x1.jpg", "lyrics": "[Sample of \"If and When\" by The Three Degrees] + (Fat Joe)\nI can see loneliness, heading my way\nThe light, of love has blown out (it's a new day y'all)\nNow your shadow's gone away, you took awayyyyy\n\n[Fat Joe speaking over sample - can't be heard]\nCrack, uhh\nYes, things of that nature, uhh\nYeah, uh, yo\n\n[Verse 1]\nNo I'm not lettin y'all take me out the game\nAnd no I ain't lettin y'all niggas ruin my name - it's CRACK!\n... That's right, the welcome mat on the ground ain't the same\nDamn right ya homie Joe done changed\nLet's be honest\nY'all niggas left me to die on that cold December day\nBUT, I survived; so much if you thought I\nWould pull up in the corner and die, not I\n... No people, not me\nAs long as Streetrunner keep makin them hot beats\nI +SHIT+ on you haters on that 'Beat Novacane'\nMake hits for the ladies with my niggas Cool and Dre, CRACK!  Know if you mention the name\nYou mentionin, Big Pun, Terror Squad and the pain\nAnd the pain has been the only status cat in the game\nRelevant, guess why so much niggas love to take aim\nCause I'm...\n\n[Interlude]\nYeah I'm lonely\nIt's hard bein the only real nigga in this shit man\nCook Coke Crack, Terror era's the Squad cocksuckers\nThings of that nature\nIt's a new regime, it's a new day cocksuckers\n{*sample: \"I need your love\"*}\n\n[Verse 2]\nI spit lazer, napalm, the mic technician\nCoulda blazed y'all but gave y'all a slight condition\nNever to defy my wishes\nI'm the king of NY, all these other niggas liars and bitches\nWho you know spit dope, with a name like Cook?\nNiggas say, that he ain't, but ain't I good?\nGot the whole fuckin industry shook; matter fact the streets\nCause all the killers come home clappin for me\nAin't no peace on the streets with these Spanish kids\nJust another cop beating in Los Angeles\nYup!  You guessed it the President didn't say shit\n'Nother vacation, chillin in Camp David\nAnd they wonder why the hood's so hot\nMy pops locked up, my moms cooked rock\nAnd just the other day Lil' Troy got shot\nOver a 2 dollar dice game, way to lose your life mayne\n\n[Outro]\nYeah, this is things of that nature\nYou gon' get a variety of shit, a-ha-ha\nIt's a new day, new regime, new change\nYou don't like it fuck you\nBut thanks to e'rybody who bought this album\nBig Pun forever, Ton' Montana forever\nUhh, Kato, yeah - CRACK! {*echoes*}\nSHIT on y'all niggas, uhh\n\n[R&B sample to fade]", "title": "Intro"}]}