{"artist": "Yelawolf", "songs": [{"image": "https://images.genius.com/a8906126ae46a874605d38c7d1e89e9e.1000x1000x1.jpg", "year": null, "album": null, "lyrics": "[Intro]\nGadsden, Alabama water park\nIt's the first\nAsTheWorldSpins.com mixtape\nDJ Hotsauce, DJ Jelly\nLet's go\n\n[Verse 1]\nSunday morning and the priests are saying save yourself\nCatfish is doing things in the Bible Belt\nDJ Jelly, Yelawolf is on it\nCountry boys are dropping heat again Doggone it\nCall the Chevys out I'm riding for the dunks again\nGoing out to all my homies with the trunks again\nYah I'm on shallow black buddy buddy it's on\nI need a dollar cmon' uh\nPardon the future buddy\nExcuse the fuse\nLook for the bomb baby please check the room\nCan't reject the broom, I'm a born street sweeper\nDropping on beats like a born meat cleaver\nLeave it to beaver\nI'll leave you with a pot of gold\nDrained up the creek like a hip hop swimming hole\nDive in headfirst\nWeak ones go leg first\nI got that dirty bong water I can make a dredger\nLook at the lead work\nA tundra from the number two\nAbove you like the color blue\nLook up to your cloud now\nAnother story for your website to talk about\nRetweet retweet internet it blog about it\nYeah that's me homie\nMullet to the back, yeah\nWhat I'm 'bout to do with all this culture\nIt's like lemonade\nSqueeze it, drink it, sell it, hustle hard\nRunning over rappers like a big block, muscle car\nBeez in a honey jar\nLet me get a hold of that\nI run into an hour journey class and take off your cap\nRacing through my city, no sweat, take off my cap\nHome is where I lay it down, gotta leave my hat\nAnywhere I move I'm looking to be meeted back\nSeeds in the stash, keys in the 'Lac\nTornado flow, a breeze in fact\nHoller atcha' homie, ever seen a slum crowning?\nMove horsie I ain't fucking with no dumb pony\nHoes jump on it, do slang to it\nThrough color poppin', working class music\nWork-working class music\n[Outro]\nDJ Jelly, Hotsauce\nYou wanna know what I put Jelly and Hotsauce on?\nLook at these uninteractive motherfuckers though\nYou tried dealing with them in studio?\nI put Jelly and Hotsauce on chicken biscuits\nAll on the same time\nIt's Yelawolf I'm happy to be here\nThank for having me\nThis is AsTheWorldSpins.com mixtape\nI might not even make the cut cuz of that shit\nPsych, you know Catfish, holler", "title": "I Need A Dollar (Freestyle)"}]}