{"artist": "A$AP Ferg", "songs": [{"title": "Shabba (Cookin’ Soul Remix)", "image": "https://images.genius.com/c9440ee0b76ac4cc57b13638e1b04b1b.500x500x1.jpg", "album": null, "lyrics": "[Intro: Shabba Ranks]\nYes ya creation!\nAnything test ya creation, annihilation\nWhere da fuck boy? No sa'pussy man\nNo informant, no orders, get loose\nShabba!!\n\nCookin' Soul!\n\n[Verse: ASAP Ferg]\nShort nigga but my dick tall\nWhat I told your bitch dog\nOnly thug nigga down at the Pitchfork\nDirty van bitches wanna suck my dick off\nPop a Xany 'fore her panty get to hit floor\nRun up in this shit raw\nI got a girl, I ain't never got no fuckin' condoms\nIf she caught me, then that bitch would be pissed off\nReal nigga shit, Fergy be mobbing all day, prolly with Marty or Jay\nThem my niggas from back in the day, Tarzan ain't showing his face\nHe prolly the one with the K, fronting then he letting it spray\nTwo shots to a bumboclaat man, Shabba Ranks let it go in your brain\nFront then he coming your way\nLet the semi dump, dump then he coming your way\nDump when the bad man come, my yute don't ramp with me\nCoupe full of bad hoes, they all wanna come with me\nYou got a coupe with a sad ho cause she wanna come with me\nShabba!\n\n[Hook]\nSha-Shabba Ranks, Sha-Sha-Shabba Ranks\nEight gold rings like I’m Sha-Shabba Ranks\nFour gold chains like I’m Sha-Shabba Ranks\nOne gold tooth like I’m Sha-Shabba Ranks\nSha-Shabba Ranks, Sha-Sha-Shabba Ranks\nEight gold rings like I’m Sha-Shabba Ranks\nTwo bad bitches like I’m Sha-Shabba Ranks\nOne gold tooth like I’m Sha-Shabba Ranks\n\n[Verse 2: ASAP Rocky]\nSkinny nigga but my dick long (Pause!)\nStank puss make my dick soft\nProbably bumping R. Kelly sipping Cristal\nSo you know the whole world getting pissed on\nI don't really give a fuck if you pissed off\nI just bought a Mac 11 from the thrift store\nTraded for my gold chain and my pistol\nShoot a rocket make a mothafucka lift off\nFlacko be mobbing all day\nWith niggas that's chopping that yay\nThey chopping them choppas they handle my problems\nCause niggas be plotting these days\nBut the 'Rari kinda fast though, (probably with a bad ho)\nShe told me pump my brakes\nYou stuck with a fat ho (stuck with a fat ho)\nShe wanna stuff her face\nTo all my Dominican girls dem, all my Caribbean girls dem\nAll my West Indian girls dem, I done fucked a million girls, dem\nWith a little ting a ling ling school bell a ring\nHit her with my ding-a-ling-a-ling, maybe run a train\nAnd tell her that my niggas wanna bang and a little brain\nAnd she wanna hang with the gang what a nigga named\nShabba!\n\n[Hook]", "year": "2013-07-17"}]}