{"artist": "Willie D", "songs": [{"year": null, "lyrics": "[Opening Skit: Phone Beep and conversation]\n[-] Hello!\n[+] Hay, girl what's up?\n[-] Girl, nothing, what's going on?\n[+] Girl, I got something to tell you\n[-] What? girl!\n[+] You know that bitch named Kim, that got into us?\n[-] Oh! yeah, yeah, what about?\n[+] Bitch got talk to Kendy\n[-] No! Oh!\n[+] Whore said she's my friend and tried to fuck my man\n[-] That's my refine to her\nThe whores stayed with the BoDagar for three years\nBut you ain't even got to worry about that girl\nLooks like she got dancing doing anyway! ha ha ha\n\n[Verse One: Willie D]\nThere was a bitch named Choice AKA Kim Davis\nShe do anything to be famous\nSuck James' dick for a record contract\nAnd dropped some shit called Payback\nWhether the shit was whack, I got proof\nIt's still sitting in the warehouse troop\nCollecting dust, like an old antique\nAnd everybody is mad at the freak\nWhose stuck the shorts up her ass to be desired\nWith no booty, to playing back five\nYou're little knot neat whore you should've hear\nCause you look like one of Jerry's kids\nBut you think that you're pretty\nNineteen and you look like you're fifty\nNext time, you wanna wear hot shorts\nGet rid of them goddamn stretched marks\nCause you ain't no looker - you're little hooker\nI said you ain't no looker, you're motherfucking little hooker\n\n[Verse Two: Willie D]\nYou're little hooker, use some protection\nAnd stop giving niggas these infection\nPut a fan in your pussy, and give it a break\nCause it's hotter than the Musking license plate\nAnd let's get it straight, who's stinky?\nI'm stiffing your pussy with my pinky\nOh! what a drag (Clap that ass, clap that ass in Astro Van)\nTrans vest dight, you can't fight\nGot your ass whipped in the club one night\nBut Fuck it! - some girls mad, and your motherfucking so-cold friends\nWearing them cheap ass fur from the Swap Mark\nThat your friend named Tasha mama bark\nCause y'all wanna be stars, act like you're large\nRiding around in rented cars\nI know the story behind the Rolex on your wrist\nYour butt still smelling like dicks\nFrom the trips to all the big fights\nWhere the trick is getting tricked and the price is light\n\n[Verse Three: Willie D]\nDumb whore, you stuck your foot in your mouth\nNow, the fuck-lady slanging her ass off\nAnd it's just lovely\nWith all that make-up on you're still ugly\nSo change your name once more to so or so\nCause you ain't Choice whore\nBut you think you're the shit, freak riding around Houston\nIn that Peter fast Jeep, so go to hell like the devil do\nCause you can't fuck with the fucking W\nAnd don't drag your mark friend into this (Fuck! that punk)\nCause he will get his ass kicked quick\nWhen you get on, you have a big butt\nSucking somebody's nut, you're sleazy slut\nYou got all the symptoms, it's in your blood to fall victim\nCause your grande was a whore, and your mama was a whore too\nAnd then came you, and if I dug up the rest of your family roots\nI find nothing but some bitches and prostitutes\n\n[Verse Four: Willie D]\nComing pretty good with some things\nBitch you forgot I was the capper of the cappers\nSo when I see you I'ma slap ya\nAnd make you take off them dirty cheeks fool\nThat you've been having on since middle school\nI remember when your pussy was tighter\nNow wait on, so you find yourself a new rider\nChange your style, fronting like you're classic\nBut everybody knows you know your ass is nasty\nI went to see your show it was whack\nNiggas started fighting cause they wanted the money back\nYou're not legit, you need to quit\nYou couldn't drive Vice to a pile of heart shit\nNappy headed bitch, you will get your duck sick\nI won't fuck that bitch with Joe dick\nCause her pussy is stuck with herpes, syphilis and gonorrhea\nGoddamn! I wouldn't wanna be ya\nNext time, your ass wanna step\nCome back with a lot of fucking help\nBut you still get trash, a low class\nLittle snake in the grass, nasty ass\n\nWe got the little hooker on tape, now! ----- Ice Cube", "image": "https://images.genius.com/99c31136e48907dfc450b10677d10058.400x397x1.jpg", "album": "I’m Goin’ Out Lika Soldier", "title": "Little Hooker"}]}