{"songs": [{"image": "https://images.genius.com/fa5c6d6b015409c1064a8e70ace78f2c.480x360x1.jpg", "lyrics": "[Verse]\nEven though I like to get dough certainly\nSpit them fast raps and flip flows urgently\nEverybody thinks that I’m gonna go pop\nLike the Bitcoin bubble, that crypto-currency\nI hate taxes. I like getting bucks\nI don’t like fake asses, don’t like lil rumps\nI don’t like face tats, you look like lil' punks\nI don’t like fake rap, I don’t like Lil Pump!\nI heard a new song today and the words were just\n“Gucci Gang, Gucci Gang” over and over\nJust “Gucci Gang”\nThat’s it? That’s all you gotta do for fame?\nWhatever happened to pushing music to a new terrain?\nThis motherfucker sounds like Gucci Mane removed his brain\nWent up in the bathroom to toot some 'cain\nThen started rappin' 'bout jewels and chains\nLet me rap a little faster, I’m too insane\nChop the microphone up into bits because my tongue is like a mothafuckin' razor blade\nI open up your throat with it, I swear to god I’m 'bout to go decapitate a rapper with the flow\nFor you fake thugs there ain’t no love in here\nYou going to fucking war with Lucifer pal\nI’ll put the gun up to your head executioner style\nFuck Jake Paul, man, he got the douchiest smile\nAnd fuck these new rappers with the rainbow colored hair\nGod damn it I sound like a hater\nI don’t care bitch, you wack I said it\nYou rap pathetic\nMac is on your girl’s face, call me Mac Cosmetics\nI’m iDubbbz to you Ricegums\nMake you cry on Twitter like Logan Paul\nI don’t give a motherfuck, I’mma choke 'em all\nI smack 'em with the microphone, give 'em broken jaws\nIt's me: the Bernie, the Madoff\nThe beats I certainly break off\nA beast, I’ll murder you\nTake off the gloves and beat you worse than Khabib Nurmagomedov\nI’ll hurt you\nI know Jiujitsu and a lil' karate, I’mma kill somebody\nIf they run up on me talkin' 'bout Lil Uzi Vert and fuckin' Lil Yachty\nIs the music that they play when they take pills and party\nDamn it, I’m itchin' for slammin' and rippin'\nI’m sick of these idiots kicking the glorification of Xanax addiction\nYou dummies just stop it, there’s children jamming and listening\nQuit acting like you a gangster from jail\nYou ain’t really real\nTaking your hands and making 'em flail\nOn Worldstar fighting like somebody scared they'll be breaking a nail\nI don’t give a fuck about the rappers or producers or the labels\nOr the cash under the table or the managers or agents\nOr the confidential payments or the record deals with Satan\nI don’t give a fuck about you bitch, I’m hatin'\nSubscribe to me up on YouTube\nMotherfucker, I'm the savior of hip-hop\nNow go to Starbucks right now\nAnd get me an Americano with 6 shots. Blaow!", "year": "2018-01-04", "album": "YouTube", "title": "Blazing Hot Fast Rap (Mumble Rap/Jake Paul Diss)"}], "artist": "Mac Lethal"}