{"songs": [{"year": null, "title": "I Apologize", "image": "https://images.genius.com/b062f30e6b899f980e62e8fa0825fbc1.500x500x1.jpg", "lyrics": "      No one else make notes to know thyself\nThose who loathe?...love them\nThose who love?...show them what it is to loathe\nIf they don't show you love still...fuck em\nEveryone's potential enemy who loves to diss\nVirtual acquaintances only exist on a buddy list\nI'll hug and kiss myself to sleep\nWhile needing something else to eat\nWhile needing someone else to feed\nBut eggshells are stuck in my feet\n\nI'm sick of beating around the bush\nWhile needing to push past creative limits\nAnd I don't have anything else left to say to the critics\nIs it just because we're different y'all can't stand it?\nOr that I backstroke against the current and the culprit is aerodynamics?\nHeroes might panic though I clown around to be the silliest...\nMan alive, well I'm dead serious\nTake me for a jokester and you'll only miss the punchline\nEvery friend of mine has dissed me at least one time\nI've come to find life is consistently unkind\nI've kissed the sunshine. sip it sometime until your lips become blind\n\nNow i've lost it, or am I losing it, or did I never have it?\nAspirin addicts are avid advocates of happiness in tablets\nThey're adamant about their acid trip\nI want a bite of the apple Adam bit. Catholics don't know the half of it\nImmaculate magic tricks. experimenting with alliteration and assonance\nBut speaking too many cold words chapped my lips\nThere's an asterisk up on my left arm\nBut my foot notes are out of tune from my music always getting stepped on\nShould've kept calm when I was granted the chance\nBut that's my song getting me amped, so god dammit let's dance\nDammit, bring this stuff to fisticuffs if that's the only thing that'll help\nSomeone like you feel good about yourself and the things your dealt\nI'll win the belt but if you need to keep your pants on...\nHere another battle for you to talk about in your damn song\nHere another battle for you to talk about, wow, look at that...\nAnother...battle...rap\n\nYou won't have to duck, i'll just talk over your head\nKnowing your dead career has one year left\nTil everyone else knows what I said\nThey're laughing at you but you don't know it yet\nI'd say it to your face but I don't want to waste the moment. Let...\nEveryone first understand the open threats that poets get\nWho's wet behind the ears? who broke a sweat?\nJiggy man - sip your moet\nThuggy dun- hold your tek\nNetcee - go on the net and keystyle '\nBout how we gets no respect", "album": "Sick of Waiting Tables"}], "artist": "Sage Francis"}