{"songs": [{"image": "https://images.genius.com/b0dcab7759816b8e3cf45e78f11f883a.800x800x1.jpg", "lyrics": "Saturn, hahahahaha, yeah\nYou need a job girl\nFind something to do, you know\nI just hopped out, hopped out of bed\nGot a couple cob webs tangled in my head\nI get dressed show the world what fresh is\nAnd then i have a bar of xanex for breakfast\nMmm, thats a tasty remedy\nLast night we ran KC didn't we?\nWhat the hell do you want me to say?\nKeep it Irish get drunk every day\nWe stay fly like an albatross\nOf this love not an ounce is lost\nBlack clover the style is boss\nAnd we shallow like you\nI wanna make a toast\nTo the renegades getting paid\nIn the shade drinkin lemonade\nWhen they're selling dope\nYou wanna know how i live with my baby's momma?\nI don't, oh let's go\nListening to my favorite song\nWithe the curtains closed till the day is gone\nThe suns outside and the rain is warm\nAin't no radio they'll play me on\nListening to my favorite song\nDon't remember what drugs im on\nDon't remember what the fuck is wrong\nThen it hits me again my love is gone\nYou know im hustling in this bitch\nIm hustling to forget\nIm hustling just to rinse you out of all my memories\nYou know im hustling in this bitch\nIm husling to forget\nI hustle just to rinse you out of all my memories\nI just walked in, walked in the door\nShit heeled drunk, fall on the floor\nI drove drunk like a durche im guessing\nIf I got a DUI then I'd learn my lesson\nBut fuck that, fuck you\nYou're the reason gonna deep six float right off the deep end\nIt was hard waking up this evening\nBut at 9pm i should not be sleeping\nWe get fly like a vulture babe\nThe bubblegum and the smoke is sweet\nI got a new girl so discrete\nAnd we shallow like you\nI wanna make a toast\nTo your new boyfriend threatening he gunna kick my ass\nWanna fight me motherfucker gonna get choked\nMy new girl is the baddest chick\nAnd her kiss feels like an acid trip\nListening to my favorite song\nWith the curtains closed till the day is gone\nThe sun's outside and the rain is warm\nAin't no radio they'll play me on\nListening to my favorite song\nDon't remember what drugs I'm on\nDont remember what the fuck is wrong\nThen it hits me again my love is gone\nYou know im hustling in this bitch\nI want some cheese and Ritz\nI'm gonna bleach and rinse you out of all my memories\nYou know im hustling in this bitch\nI'm hustling to forget\nYour new boyfriend's a punk\nHe works at the T-Mobile kiosk\nHa, put a ring on it?\nYou got me so twisted imma pee vomit\nHell no I don't need a rescue\nMust I remind you girlfriend I left you\nI thought stalkers were only found in the horror movies with creeper sounds\nUntil this morning when i looked outside\nAnd saw you standing there with a freakish frown\nWhat the hell is wrong with you?\nI think you need a talking to\nFuck it imma get a cop or two\nAnd then I'm gonna snitch to your mom on you\nDon't treat this as flattery\nYou text message me so many times that you ran down my battery\nAnd honestly i think you might be the only person in the history of cellphones to pull that off\nListening to my favorite song\nWith the curtains closed till the day is gone\nThe Sun's outside and the rain is warm\nAin't no radio they'll play me on\nListening to my favorite song\nDon't remember what drugs im on\nDon't remember what the fuck is wrong\nThen it hits me again my love is gone\nHeyyo heyyo I'm hustling they can't stop me\nHeyyo heyyo got vodka in my coffee\nHeyyo heyyo I'm hustling they can't stop me\nHeyyo heyyo got vodka in my coffee", "year": null, "album": "North Korean BBQ", "title": "My Favorite Song"}], "artist": "Mac Lethal"}