{"songs": [{"image": "https://images.genius.com/3e7b9418455789c0190eaf6df988fdd7.1000x1000x1.jpg", "title": "For Sarah Baartman", "album": "Creature!", "year": null, "lyrics": "(One, two...one, two)\nUh, yo\nBody hurtin, seen a world still turning\nA witch that wouldn't burn, to be brown and to be woman\nTo be permanently stuck in the skin of a sinnner\nLike bitter cinnamon and broken mahogany splinters\nMy role is holy and my mother is too\nIs it because I'm magic that my veins are not blue?\nSisters and hoes know the woes is the same\nIf you, you found me slain, would you still say my name?\nSee, I know about the black man and what he been through\nWhat about if I sung about the woman that he brought it home to?\nI been crying for my brothers, but I cry for me, too\nCause I'm the only one left to be more powerless than you\nEven though it was she who taught the son to get melodical\nI'm plenty blended but don't call me exotical\nLike I was half black and half beautiful\nIt's so methodical I find it diabolical\nAll encrypted in a code, it's biological\nYou stripped the pride that is rising in my follicles\nBut these curves are not a caricature for your capitalizing\nDon't decolonize me\nAs a westerner metropolis, yes\nDown to money, Mississippi all the way to the west\nI feel my back is breaking and they yanking my chest\nThe fruit is getting stranger and the streets never rest\nBut this is for you, Sarah Baartman\nYou were art to these marksmen\nShow you in the town square, put you up to buy\nAnd with your wildest cries I identified\nSee, I been on display like items for their eyes\nAnd I tried to board a midnight train\nI said I have no money but I have a lot of pain\nAll I wanted was to leave my father's house, make it out\nBut every time I sing they remind me of disdain\nAnd I wonder who's gonna know, who's gonna hold her\nThe last of left out, lost and looked over\nThe songs of [...] only rain on some\nAnd it's man's world, the change gon come"}], "artist": "Nitty Scott"}