{"artist": "Ant Banks", "songs": [{"title": "Late Night Fuck", "image": "https://images.genius.com/992e30f2e51c18bd369b9f8badc632a5.772x768x1.jpg", "album": "Sittin’ On Somethin’ Phat", "lyrics": "I was sitting at the house on a late night\nWorking hella hard trying to make my fucking tape tight\nMusic hella loud and the TV was on\nBumping so strong that I couldn't hear the phone\nI looked at the tube and the shit was kinda wild\nA bitch getting served straight doggy style\nI hit the \"off\" button on the drum machine\nSat down on the bed and I peeped the scene\nAnd the ho getting fucked, oh man she was so fine\nAfter hours, 1 o'clock on Showtime\nBut what I saw, it made me wanna ball\nI grabbed the telephone, it's time to make a few calls\nWho can I get to be a ho for me tonight?\nI think I'll call Tish cause her shit's hella tight\nHit it on the nose cause the bitch was on horny\nI hung up the phone, put my tongue on the fork\nSo I can be ready for some body and some soap\nThe 40-oh of Mickey put my dickey on pole\nNow I'm hella anxious, waiting for the cock\nSo I can keep her yelling \"Ant Banks don't stop!\"\nHa ha, I can't wait to lay the pipe now\nBut I hope she comes around before my high goes down\nOh knock knock knock on the door, what do ya know\nI opened up, sure enough, I'm in luck, it's my late night fuck\n\n(Don't you wanna do me?) Yeah, give it up\n(Ooooh, do it from the bacK) C'mon, c'mon\n(Don't you wanna do me?) Give me some of that coochie coochie\n\nI said \"Come on in\" and \"Oh hi, how ya doing?\"\nConversation was fake, cause I was thinking bout screwing\nShe gave me a hug and a real wet kiss\nZip goes the zipper and I whipped out my dick\nI know you're wondering, what did she think?\nShe got on her knees and started sucking my beef link\nAnd believe me, the head was kinda right, bro\nI got served like a Cutlass in a side show\nAnd the nut came gushing like Niagra falls\nShe took it out and I nutted in her eyeball\nNow what's next, is it time to get some dick?\nShe said she wanted to get licked\nEat the pussy? That ain't fly, no\nI'm not a lick 'em low, Pooh-Man lied, ho\nAll I wanna do is knock some boots\nSo let me see you in your birthday suit\nEvery bone in the cock I was preparing to break\nCause the bitch had a fucking Ms. America shape\nNow it's time for the sticking, watch the bitch get stuck\nBy the big-dick gangsta Banksta and the late-night fuck\n\n(Don't you wanna do me?) Yeah, give it up\n(Ooooh, do it from the bacK) C'mon, c'mon\n(Don't you wanna do me?) Give me some of that coochie coochie\n\nI was chopping up the cock just like a Ginsu\nShe opened up her legs wide enough to ride my Benz through\nThat's about the time I stuck it in her socket\nShe shouted \"Pop my coochie!\" Best believe that I popped it\nAnd I kept on stroking\nBut I couldn't feel the pussy with the old-school Trojan\nI had to wear it last week, I heard she burnt Pooh\nI slapped her ass cheeks til they turned blue\nI had her hanging off the bed with her hands on the floor\nJust like a pro, hitting nothing but pussy hole\nShe started wiggling, I couldn't keep the bitch still\nJust like En Vogue, I'm giving her something she can feel\nI was sweating and dripping cause we was working out\nShe started moaning cause the nut came squirting out\nHuh, now it's time for me to bust mine\nI'm a have to end it and shit, I'm finna finish up this fuck rhyme\nNow I think I had enough\nOh shit, my late night fuck! (echos)", "year": null}]}