{"songs": [{"year": "2002-01-01", "title": "Do You Know", "image": "https://images.genius.com/9817f1884f3ccbc4ed6fd77a8d9049eb.300x300x1.jpg", "lyrics": "[Verse 1]\nI got out of the pen in the year 2000 (and then?)\nHooked up with my man, DJ Mark Ronson (and then?)\nStarted making records with him and this kid Ben (and then?)\nMet dead prez, stic.man and big M (and then?)\nMade a lil' demo, that joint was potent (and then?)\nThe streets recognized I was better than most men (and then?)\nAlchemist laced me with not one joint but ten (and then?)\nMet my man Gotti (who Irv?) no, Jonathan (and then?)\nMade a little label we called The Nation (and then?)\nDecided we better off independent (and then?)\nCame out with that Kay Slay joint and it went\nAnd I was really just giving niggas a hint (and then?)\nMet Sha Money XL and 50 Cent (and then?)\nThem niggas said, \"Work hard\"—I knew what that meant (and then?)\nWent back to the lab and now it's evident (and now)\nNiggas know Saigon flow is heaven sent\n\n[Hook]\nDo you know that you ain't got a style like I do?\n(Nah, nigga, not you)\nDo you know that you can't walk a mile in my shoe?\n(This is real gangsta shit)\nDo you know that you ain't got a style like I do?\n(Who you?)\nDo you know that you can't walk a mile in my shoe?\n(Gangsta shit)\n\n[Verse 2]\nI ain't the number one stunner\nBut best believe I be amongst some gun runners\nTest me if you wanna\nI ain't gon' front, you impress me with your Hummer\nBut son fucking yo' bitch impressed me even min-ore\nMin I mean more, you don't want a win-ar\n‘Cause you'll be deader than a nob on the din-or\nMade my own language, now I'mma stop\nI quit fucking with wankstas, now I'mma drop\nAyatollah laced the beat like, \"Whoa, that boy bad\"\nWhat you thought, 'The Life' was all he had?\nThis a taste of the new shit to make 'em lose it\nYou ain't gotta stand in front of the speaker to face the music\nI was a thug before it was a gimmick to be\nI feel like all you rap niggas is mimicking me\nI'm sick and tired of saying this damn shit\nBut I'mma say it one mo' 'gin so yo' men understand it\n\n[Hook]\n\n[Verse 3]\nWhat you know about guns in the glove compartment?\nWhat about the thugs that love to start shit?\nWhat about the ones that hug the park bench?\nSlugs flying out of a car with dark tint\nLook, I don't know what you know but I know ‘cause I go\nBack like Kareem Abdul Jabbar's goggle\nBack like a CXR throttle and y'all know my motto\nWhere ever I go I got the roscoe\nWhen I blow the cannon at your cabbage\nThen slide off with my bitch like Macho Man Randy Savage (oh yeah!)\nRap about love and your mama will pick it up\nCould rap about the government, Osama will big it up\nRappers can't see me ‘cause they minds ain't big enough\nThey need to fuck raw ‘cause they rhymes ain't sick enough\nYou homosexual thug, gay killer\nNiggas like you cross over like Andre Miller\nNigga\n\n[Hook]", "album": "Abandoned Tracks Vol. 2"}], "artist": "Saigon"}