{"songs": [{"year": "2019-01-01", "image": "https://images.genius.com/32cdfc1a51a747c7baf7c378971cad7e.537x514x1.png", "title": "Leatherface*", "album": "RUFUS", "lyrics": "[Chorus: King Gordy]\nUh\nWe get to slicin' and stabbin’\nWe got no mask with axes\nLeatherface\nWe will pull op on your avenue, slaughter your family like animals\nLeatherface\nWe eat your body like cannibals\nRun and the wolves will come after you\nLeatherface\nSorry we won't stop attacking you, chop you and fuckin' kidnap you bitch\nLeatherface, Leatherface, Leatherface\nLeatherface, Leatherface, Leatherface\nLeatherface, Leatherface, Leatherface\n\n[Bridge: King Gordy]\nWe eat your body like cannibals\nRun and the wolves will come after you\nLeatherface\nSorry we won’t stop attacking you, chop you and fuckin' kidnap you bitch\nLeatherface\n\n[Verse: King Gordy]\nI'm sicker with verses\nThis clip is dispersin' you into hearses\nThen into the church and into the dirt\nYour body will fill up with worms then\nI am psychotic, erotic, bionic\nHigh of the chronic and I don't think logic and I'm in your closet I'm hidin'\nAs fucking as soon you walk\n\n[Verse: Hopsin]\nListen\nIt’s 11.30 p.m. and you ’bout to fall asleep and I'm at your window with a mask on (Shh! Huh?)\nI proceed to climbin’ through the gatter on with a machete that I'm 'bout to shove into your backbone\nThen cut it down until your asshole, I bloody up your fuckin' bathrobe (Bitch)\nAnd if your wife is awake and she witnessin’ what I'm doin'\nI kill her then I fill her pussy up with tampons\nYes I'm that gross (Yeah)\nWhen it rains it pours\nEspecially when my blade is pulled\nThe deeds paid it for\nI'm butt naked in your neighbors pool\nI stay stuntin' when I'm face fuckin' a decapitated skull\nYou ever seen that before?\nFreak nasty gore\nI need asking lord\nSo please ask the lord\nFor three trashy whores with knee pads of course\nWho deepthroat while my balls swing back and forth\nI like it like that (Yeah)\nBitch don't you try to fight back (No)\nAll you now realizing I have (What?)\nI can't allow the fluid I'ma jam e'rybody to your fuckin' cleavage area\nAnd damn it I'ma"}], "artist": "Bizarre"}