{"artist": "Kodak Black", "songs": [{"image": "https://images.genius.com/00182a249cf80a48b47ce8eb29bcc329.1000x1000x1.jpg", "title": "4th Quarter", "year": "2013-12-26", "album": "Project Baby", "lyrics": "[Intro: Kodak Black]\nKodak, Kodak Black\nDon't act like you don't know\n\n[Verse 1: Kodak Black]\nMe and momo riding in the Chevy\nSay my neck about to break my chain too heavy\nRebirth of Lou Scott Makavelli (ooo purp)\nBorn stacking bread like the deli (I've been rich)\nSo you can take it where you want\nI'm kamikaze wanna try me? Suggest you dont\nOh, I told you boy, I'm riding the donk\nOh, I got shooters posted by my door\nI'm from the Noy, yeah I stay Polo to the floor\nOh, my money long, I cut my homies short\nFrom Golden Acres, what it is, it really ain't\nI'm lyrical and what I be saying gon' make you think\nI'm all in, I be solo, don't need no friends\nI fuck with Lil Soto, that's my cuh-in-law, he get it in\nLil Jackboy, he just wrote me, that nigga he like my kin\nI be up all night on M's, I don't fuck around with no Xans\nSuper charged, I'ma hit the game like a ram\nYou niggas lame with a lil fame on Instagram\nI do my thing, I'm about to make you niggas flame\nAin't holding back no more, I'm finna make you feel my rage\nNigga please? Nigga what? Nigga who?\nYou running your mouth, your lips bigger than your shoe\nMe and my pocket monster, us two, that's my crew\nE-Pimp, that's my blood, that's my thug, he bring it through\nOh, I'm about to make you niggas feel it\nMurder charge, fresh to death, I'ma make a killing\nOh, I can turn your state into a city\nI'm a CEO, I can turn a Drake into a Diddy\nOh, bout to hit you niggas where it hurt\nWhy you go so hard? Why they put Wayne head all on my shirt?\nI'm riding on 26 plus 4's, free Lil Turk\nHe just caught 30, that shit'll make me go berserk\nPunchline, I hit the beat with a jab\nThe difference between me and you, I pull up in a Jag\nFingers inching like a rash, fiending for that cash\nThey say \"Kodak living good but all his bitches bad\"\nI ball so hard, my homie fouled 'em, my cast on\nI rob so much, I'm in the booth with my mask on\nOh, I'm riding in the coupe, I'm the truth\nThat money running, I'm outchea chasing it, how about you?\nYou should get on a track and chase it too\nI can turn a lake into a pool\nMy diamonds shining, why your ice look like it's blue?\nWhile you out here lame vibing, you should be out here grinding too\nThey say time is money, I'm showing what timing do\nSay grind turn into shine, I'm showing what grinding do\nLil Kodak Black, I'm the truth\nProject baby, I'm the truth\n\n[Verse 2: One Grand]\nYou ever get the feeling that time is now to make a killing?\nBut you the only one that's standing round here with a vision\nEverybody knows somebody, knows somebody, knows somebody different\nThat's what I'm tryna tell my people but my people don't wanna listen\nWe was brought up in a city where niggas, they hate on niggas\nBitches, they hate on bitches, and all of us is on assisted\nAin't watching my neighbor's paper cause that ain't none of my business\nNiggas can't get it in cause they worrying bout how I'm living\nMe, I'm my competition\nMe, hit me on a mission\nMe, I gotta get me, so I'ma make me be consistent\nFuck it, I'm all in, ain't doubting God's plans\nNot on tour but I know they get easy in the end\n23, I'm the man, I'm the fucking bird nigga\nI done seen more chickens than Kentucky Fried Chicken\nAin't falsifying facts, ask a nigga in my city who the first one to get 'em, to get down with them triggers\nI am only one man but a different kind of nigga\nLeft the game without a stain like a fucking place kicker\nAnything, any lane, any time I'ma get it\nPut my all in it, when it's empty fall in it, fill it\nGo hard from the start, from the start to the finish\nDone it all, college ball, worked a job, ran a business\nBroke the law, broke a heart, broke my foot up in some niggas\nStab me up and shoot me down, but you can't knock me off my pivot\n\n[Verse 3: Koly P]\nI'm a reaper, don't be hollering bout your people\nI got a stick, it's a fuck nigga beater\nFucked the bitch cause I don't really need her\nI'm on point like I'm blowing on keisha\nI get cheese like I'm going on pizza\nWhite girl, Ricki Lake, Mona Lisa\nNigga go and get your people then\nAin't nothing, ain't tripping, we can spend a band\nYeah, niggas getting crossed every day\nI was taught every dog got his day\nWhen them bullets go to spark and the dog gotta lay\nBetter hope to God he don't jump with the K\nMr. (?), by the park they'll break\nWhen you getting money, fuck niggas gon' hate\nOnly real can relate\nFour years in the state\nAnd I seen niggas break\nBetter watch your mouth nigga, jumping on your case\nNiggas in disguise, they deciding off of hate\nChain gang now dying bout the case\nKnow some niggas lying locked behind gates\nSurrounded by them snakes\nThey be all up in your face and\nTryna talk the fire and crack on statements\nDon't pen the affidavit\nMan I shouldn't have to say this\n\n[Outro: One Grand]\n4th quarter and we down by two\nYou gon' pass or shoot?\nIt's 4th quarter and we down by two\nIs you gon' pass or shoot?\nIt's 4th quarter, 4th quarter and we down by two\nIs you gon' pass or shoot?\nIt's 4th quarter, 4th quarter and we down by two\nIs you gon' pass or shoot?\nGatorade on the coach"}]}