{"artist": "Antoinette", "songs": [{"title": "Shake, Rattle & Roll", "image": "https://images.genius.com/6048fbc409cf8026ef1821747507c396.400x400x1.jpg", "album": "Who’s the Boss?", "lyrics": "[ VERSE 1: Antoinette ]\nAin't I something? So many rappers wanna get me\nThey stand in front of me and can't hit me\nSo sling, hm, I just love it\nAnd if you're jealous, I think nothin of it\nCause with me, you can't mess with\nYou wanna try this? That's a death wish\nAnd survival is unrealistic\nAnd if you're broken up, let me fix this\nMatter of fact, I can't let a rapper win\nI ain't re-run, that ain't happenin\nThey try to sample me everyday somehow\nAnd try to dis this? Ts.. come, come now\nWhy move in my direction?\nPlay it safe, get some protection\nSilly rabbits, they bring a condom\nSo I laugh, and then I bomb them\nBring the bomb squad, I'm a time bomb\nI explode, even when I rhyme calm\nTakin titles, what is that, some type of joke?\nOh - I hoped\nCause if it was, you'd be in trouble\nHurry, quick, move on the double\nIn this rap game you're a reject\nSo make like a tape and eject\nNow there, don't try to play bold\nHalf-step to Antoinette, you shake, rattle & roll\n\n[ male voice whispering ]\n(Knock em out, come on girl, knock em out\nKnock em out)\n\nShake, rattle & roll\n\n(Knock em out, come on girl, knock em out\nKnock em out)\n\n[ VERSE 2: Antoinette ]\nWe can do this, cause you're child's play\nDon't toy me, or must I say\nYo, break north, step back one\nHold your eye, or it'll be a black one\nSo get Red Cross, cause that's your need\nAnd as for me, I'm a rapper of a raw breed\nYou wanna move on, then move quick\nWho's the best? Let's see who you've picked\nTs, ts, ts... go get her\nBring two, we're havin double head up\nIt's such fun puttin two heads out\nYo G Off, get a few ???? out\nCause they believed the hype and\nNow they'll be wipin\nUp the mess I left behind me\nI lose myself so they can't find me\nNow the Gangstress is at large and\nYou're a private and I'm a sergeant\nSo troops, it's time to get fresh\nAnd follow Antoinette as I do the Kick Step\n\nShake, rattle & roll\n\n(Knock em out, come on girl, knock em out\nKnock em out)\n\nShake, rattle & roll\n\n(Knock em out, come on girl, knock em out\nKnock em out)\n\n[ VERSE 3: Antoinette ]\n(Ready?) I'm ready as I'll ever be\nI use deodorant, but some still sweat me\nBut I stay calm with a smooth tone\nHurry quick, buy a tombstone\nCause playin is somethin that I don't do\nMake my day, why won't you?\nI'm the host, but this ain't a game show\nThat only takes place over the rainbow\nI chase chuckwagons, let's get so\nYou're like my pet, so play petro\nSave Chuck for the wagon, it fits\nAmongst all the pieces of kibbles and bits\nCause I'm good (ahh) to the last drop\nOf course, I just can't stop\nAnd stardom is where I'm destined\nIn this profession, yup, I'm the best in\nYou're still riffin? Yo, bank that\nHit the side door before I spank that\nStop scrappin, huffin and puffin\nSorry, Sally, you ain't sayin nothin\nMuch, you can't school this\nAnd if you thought so, that's quite foolish\nSo remember, don't try to play bold\nYou half-step to Antoinette, you shake, rattle & roll\n\n(Knock em out, come on girl, knock em out\nKnock em out)\n\nShake, rattle & roll\n\n(Knock em out, come on girl, knock em out\nKnock em out)\n\nShake, rattle & roll\n\n(Knock em out, come on girl, knock em out\nKnock em out)\n\nShake, rattle & roll\n\n(Knock em out, come on girl, knock em out\nKnock em out)\n\n(Knock em out\nCome on, knock em out\nKnock em out\nKnock em out\nCome on girl, knock em out)", "year": null}]}