{"songs": [{"title": "Paranoid", "image": "https://images.genius.com/de7d460818e06f5e3512c1c81109fccc.1000x750x1.jpg", "year": "2015-04-25", "album": "Purple Summer 2: Son Don’t Shine", "lyrics": "[Intro]\nWe could kill it, yeah\nWe could, we could, we could\n\n[Chorus]\nWe could kill the radio but we make killer music\nWe make drug dealer songs but we gon' still abuse it\nAin't that what keep these niggas paranoid?\nI like to keep these niggas paranoid\nWe could kill the radio but we make killer music\nWe make drug dealer songs but we gon' still abuse it\nAin't that what keep these niggas paranoid?\nI like to keep these niggas paranoid\n\n[Verse 1]\nI could be on Billboard, we'll get to that\nGotta do it for the streets, so I remember that\nI'ma let 'em see me struggle, let 'em see me hustle\nI be in the field tryna ball and you ain't in my huddle\nI'ma put on pieces, meet your pieces, leave your peoples puzzles\nI went from that Polo puff to Moncler, you see me bubble\nGreedy tryna eat Ruffles, all over the seat, rushin'\nTryna leave the scene, I'm Mr. Clean in the kitchen\nWipe me down off the muscle\nPaint the perfect picture, we be totin' and we don't tussle\nDrop single after single, tryna get up there to platinum\nDouble times, hustle grind, drugs and lines\nChopper jump like Busta Rhymes with suppressors, uh\n\n[Chorus]\nWe could kill the radio but we make killer music\nWe make drug dealer songs but we gon' still abuse it\nAin't that what keep these niggas paranoid?\nI like to keep these niggas paranoid\nWe could kill the radio but we make killer music\nWe make drug dealer songs but we gon' still abuse it\nAin't that what keep these niggas paranoid?\nI like to keep these niggas paranoid\n\n[Verse 2]\nLil bitch, I'ma let you trip, right here front your peoples\nIf you really was a threat I'd have my peoples come and meet you\nGot guns when we greet you, done drums when we beat you\nI be creepin', I'm a creature, fold you up, gon' do a feature\nLike it's nothin', buck buck, blowers buckin'\nGot the rock, smashing pumpkins, got the blow if you be bumpin'\nGot the glass but I don't touch it like I'm fresh out of the car wash\nLike bitch don't push my buttons, like the window, blow the AC\nGotta get gone, time for her replacement\nYoung nigga started from the motherfucking basements\nStacks off a pack, bring it back, re-up and I put up\nThen I go and blow the rest at Saks, I got stacks off a pack\n\n[Chorus]\nWe could kill the radio but we make killer music\nWe make drug dealer songs but we gon' still abuse it\nAin't that what keep these niggas paranoid?\nI like to keep these niggas paranoid\nWe could kill the radio but we make killer music\nWe make drug dealer songs but we gon' still abuse it\nAin't that what keep these niggas paranoid?\nI like to keep these niggas paranoid"}], "artist": "03 Greedo"}