{"artist": "B-Legit", "songs": [{"album": "What We Been Doin", "title": "Marijuana", "lyrics": "[Intro: B-Legit]\nCheck one\nI'm back in the piece man\nYou know what I'm talking about, yeah\n'Bout to roll em in one of these motherfucking\nRaw papers\nWith gelato, you dig?\nPut a little Cookie crumb on that motherfucker\nSee what that do\nA little bit of that Snowman oil, you dig?\nMan, we just gettin' high\nI mean, what else you gonna do, nigga\n\n[Verse 1: B-Legit]\nAsk me how I feel about the marijuana\nI tell you that I love it like I love my mama\nWe don't do confusion and all the drama\nWe be with the crew, little Benihana's\nCalifornia state, Chico up north\nGet it to the Bay, it's some buckmore\nTravel up top with some fuck foe\nThey ain't even got what a nigga ride\nGelato with my raw with the Cookie crumb\nOn my Instagram putting hella thumbs\nFuck around, you gonna need another lung\nProbably where your favorite rapper get it from\nWhite boys and the tube rolling B-La's up\nNew strain, 'bout to enter that in the cup\nWith the harvest coming up, I'mma' move around\nHigh as health care, nigga, I ain't coming down\n\n[Interlude: B-Legit]\nFor what?\nNigga, thats what we do\nIt's what we been doing\nNigga, hit me on the next album dank site\nAy B-La\nI want some of that shit you and Berner be having on your IG\nI said man, you have to get at Berner about that, boy\n\n[Verse 2: Berner]\nRoll another one smoke the pain away\nI'm in the Bay getting paid in a major way\nWhen that box show up, how you supposed to feel?\nA hundred-fifty grand wrapped with a vacuum seal\nTook Sherb, put his back on the map again\nLong nights, no sleep, sick of traffickin'\nWax made me never want to dab again (Ouch)\nBuy more bags to put the candy in\nIt's outdoor season and I'm loving it\nPrice so low, they can't get enough of it\nSnowman got me on my own hype\nFuck a new chain, baby, buy me grow lights\nI'm in the G-Spot, yeah, the weed spot\nThe shit will make you sweat like a key shot\nClear on my Rolly, no G-Shock\nNew Benz cost about three blocks\nLet the smoke clear, homie, I'mma' pot-head\nWeed got him noddin' like a hot pad\nF-1 burning, now the room smell\nLike the pelly did back early two-thou\nNice boy, pretty bitch, few pre-rolls\nWe let the coke bricks fly with the eagles\nI'mma' beast with the weed shit\nMe and B-Legit, we let the P's flip\n\n[Outro: Berner]\nWe're certified\nAnd I do appreciate all the game given\nYou know how we get down in the Bay\nYou know fourty-eight, fifty-eight-hundred\nSix G's in the A1 was like that\nHa, double up and triple up every time off 'em like that\nB-Legit, Berner, how we get it, uh", "image": "https://images.genius.com/524b1780a681f5c9b3fcc743538490cf.1000x1000x1.jpg", "year": "2015-04-04"}]}