{"artist": "Wiz Khalifa", "songs": [{"year": null, "lyrics": "[Verse 1]\nUh\nYa'already know what it is man\nTaylor Gang And I’m still talkin' champagne\nGood weed, bad bitches and airplanes\nNigga's get extra likes, spare change\nLeave your bitch around my gang then she fair game\nGets so hot, you standin' near a flame\nTwenty thousand on my wrist, fifty on my chain\nClub owners mad, We drinking all the Rose\nAnd niggas hate but I just go off what the hoes say\nHe a skinny nigga, but he do it big\nYeah, it's looking like a movie, but it's how I live\nYoung boss, Taylor Gang General\nDrinking out the pink bottle Rose Imperial\nAnd my bad bitch look like a center fold\nCook like a chef, smoke weed like it’s medicinal\nSmell the engine burning you hear my tires murk\nWe be poppin' corks like fireworks\n\n[Hook]\nI'ma' need more champagne\nTell the waitress just grab a couple more bottles and bring'em up\nWe got a bar for every nigga that came with us\nWe got the buzz now bring'em up grab your drink and get\nFucked up. Champagne, Champagne.. Lahh ah...\nSee bottles of rose when they think of us\nSee all of'em in the club gonna pay for us\nBut you ain't gonna fuck the waitress Brah\nI'mma need more champagne!\n\n[Verse 2]\nVIP's full of red bottles\nIn the city that I come from I'm the head honcho\nOunces full of Kush, bottles full of more wet\nSeen me in my yellow car, she got all wet\nUse to smoke blunts, now she roll plane\nQuit fuck'n with her nigga, he was so lame!\nShe said she love the taste, but she don’t know the name\nDrinkin by the case, I’m gonna needyea ta bring\nMore Champagne!\nI’m with my goons getting liquored up\nMake this money, then blow it like I don’t give a fuck!\nShow up to the club they pull them bottles out\nYou get'in paper you should know just what I'm talk'n bout!\nUh, I live the life you write a song about\nBitches think I'm famous favors come in larger amounts\nStanding on the table, standing on the couch\nSomebody tell the waitress that we almost out. Hahaha\n\n[Hook]", "image": "https://images.genius.com/2ba15f623d81eda09cdc07f50dde02ad.400x400x1.jpg", "album": null, "title": "Champagne"}]}