{"songs": [{"year": null, "title": "ID Thieves", "image": "https://images.genius.com/272fb5e65bfaf7694e7ceb8c53b5c715.1000x891x1.jpg", "lyrics": "[Verse 1]\nWhile taking deep, slow breaths I try to grow wings\nDecided to stay low, the halo was a smoke ring\nFell around my neck, I started choking\nMy soul got stuck looking for openings\nI thought ghosts weren’t supposed to sing like cage birds\nIf you’re a free broken spirit let the pearly gates burn, baby, burn\nThe muted trumpets in my chest take turns\nWhen I release the spit valves gag on Gabe’s germs\nSome of this is fiction written all across it\nBut this bathroom lit and I’m too busy spitting in a faucet\nShitting blood thinking of the quickest drug to heal me\nBut I’m not lovesick, your sick idea of love would kill me\nTime to pry open the truth\nApply pliers to my own broken tooth\nDIY or die, no health care benefits\nYou could spare me the ‘'I know, I’ve been there’‘ sentiments\nI sense a sentimental song coming along, run along\nBefore I ask you to dance and all you get is trampled on upon faces\nMainly my own though, I’ve lost patience\nI’m painting over old photos, I’m new now\nFresh out the box all bloody\nSomebody cut me loose, slap me, call me ugly\nSay it how you see it, buddy, I’m a hurting hot mess\nA constantly inconsistent work in progress\nFat girl in a prom dress, do more, talk less\nThey wanna assassinate your character content\nWhen pressed like ab-workouts, super thin\nThe whitest looking Jew screaming ’‘Jerusalem’'\n\n[Hook]\n(Got my ID ready)\nWho are they?\nThey are the identity thieves\n(Got my ID ready)\nWho are they?\nThey speak war and pretend that it’s peace\n(Got my ID ready)\nWho are they?\nThey are killers by association\n(Got my ID ready)\nWho are they?\nThey’ll hurt your credits with misappropriation\n\n[Verse 2]\nYou can’t just get comfy and stand in one spot\nLike a king of the mountain whose been planted on top\nSurveying the land of your family plot\n‘Til it’s all been abandoned, you're the man 'til you’re not\nIt happens like that when you rest on your laurels\nLike a shot to your back, it’ll mess with your morals\nIt’s a matter of fact I’ve consulted with oracles\nPrecaution of a shaman who was dressed so informal\nI’m a poor man with cash making points with no fingers\nBringing popular back 'till the smell of sex lingers\nHard bodies will stack more neatly and tidy\nBut I swallowed her visions, now she sees inside me\nShe-devil so chiesty, deceptive and sexy\nWalk with me, I’ll give your legs epilepsy\nMy game is so shaky, if you love pain but hate me\nThat’s a paradox I’m unable to explain\nConspiracy exposed, it’s the way in which we fold the bill\nTrying to overdose, instead you just choke on your pills\nIt’s overkill if you’re just going for thrills\nSeek a mountain you can punch 'til it explodes into molehills\nI’ve done this yodel ever since I was a child\nI’ve got this other yodel I ain’t done in a while\nIt goes pure Himalayan intelligence\nBraving the elements from a man cave and haven’t shaved ever since\nNever forget, you were the sperm that made it\nPlus the unexpected pregnancy could have been terminated\nSo thanks to chance, and romance, and dancing\nWe’re here to our own damn thing, prepare kid\nWhy you think I let you get away with doing radio-friendly versions of what I do?\nLike I wouldn’t chide you, out perform, out write, and out rhyme you\nOutsmart, out heart, and out grind you\nOut shine you with the torch that was given to me\nTorches are not passed to the bastards of the little league\nIf rap was a game you’d be M.V.P\nMost Valuable Puppet of this industry\nGet your I.D, Independent? Fuck you!", "album": "Copper Gone"}], "artist": "Sage Francis"}