{"songs": [{"album": "Para Tu", "year": null, "title": "Creep Inspire", "image": "https://images.genius.com/7eee6dd3e21895d3b7efbd8f0ac69d8b.566x566x1.jpg", "lyrics": "[Intro: J.I.D, Girl, Guy]\n\"You have to be the life coach!\"\n\"I'm not trying to laugh\"\n\"Haha! No real, like, real though, okay? What we suppose to be talkin' about. Well?\"\nYo, yo, yo, yo\nYo, yo, yo, yo\nYo, yo, yo, yo\nYo, yo, yo\n\n[Verse 1]\nI was on some other shit, now I'm back to this\nI had my humble pie, now it's time to take a shit\nShe wanna suck my (Hahaha), only if you insist\nOnly because I'm lonely and only cuz I ain't shit\nOf course she say she won't, then go on with the lists\nI wanna slit my wrists, I'm horny as a bitch\nHer brother and her sister act too, father crisp\nShe givin me her maybe's, she tellin me her if's\nHer then statements, her family, even the rips\nI tell her take a sip, grab her neck and start kissin\nShe said I'm too explicit, I'm thinkin like a midget\nGettin fisted, I just wanna stick it, maybe fifty\nAnd I'm back to the digit, she think about it\n\"Mmmmmm\", JID, don't be so sadistic\"\nI'm tryna get her to fuck, so this dick can get stuck\nBut she can't get, past the fact that I'm fuckin brilliant\nMost niggas act, retarded off [static]\nI don't really rap, I'm just followin the tick-ticks\nThe booms, and the claps, it just so happens\nThat the kid keeps it accurate, used to whip the Acura\nBack in the days when I was young\nI'm not a kid anymore\nBut now I'm grown and my women are gorg'\nShe prolly just want my heart, and to surrender the sword\nBut I'm a Ginsu warrior, slingin dick victoriously\n\n[Chorus: Doctur Dot]\nYou think you clever huh\nYou looking at me so passionate let me know that the nigga that you been tappin is actually unimpressive huh\nOh well\nI see what I can do about you, see what I can do about you\nYou think you clever huh\nYou looking at me so passionate let me know that the nigga that you been tappin is actually unimpressive huh\nOh well\nI see what I can do about you, see what I can do about you\n\n[Verse 2]\nBaby you interestin, and I'm interested after havin long sex\nEight sets of ten that's a long set\nBend that ass over like a long snap\nShe ain't say nothing just supply me with the bone grip\nTell me it's a full ass moon that shit glowing\nLittle nigga put your coat on your Scorpio showing\nI never told her my birthday, not even the first date\nAnd then I made it worse then my October the 31st\nNo wonder you kinda thirst\nAnd then she laugh it off\nYou freaky nigga I wonder if you be jackin off\nBad bitch with a sense of humor\nFuck a fan it don't get cooler\nFuck your ice and your bed it don't get cooler\nThink I won gettin cooler like I'm Don Shula\nGot a piece like a damn Budda\nSmoking a gram I'm the Grand Puba\nGot a gun fuck your shooter anyway\nLittle shawty got me amazed\nThe fact, the fact, the blood leaving from my dick to my brain\nIt's cool how we converse never say conversate\nShe said I know I always had a way word with ways\nWay with words, wayward sons lit up with jay\nThey finna leave, I'm finna to sleaze to the back room\nTryin see if I can get me a little vacuum\nBefore the moon change clothes with the sun\nAnd presume another day another doom\nShe say if I stay then I got to sleep in the other room\nI said it's cool cause around 3 I'll probably come and creep in your room\n\n[Outro]\nYou, you ain't got to be so cold\nYou, you, you, you ain't got to be so cold (so cold)\nYou ain't gotta to be\nYou ain't gotta to be so cold (so cold)\nYou, you, you ain't got to be so cold\nYou, you, you ain't got to be so cold (so cold)\nYou, you, you ain't got to be so cold\nYou ain't gotta to be"}], "artist": "JID"}