{"artist": "Immortal Technique", "songs": [{"title": "Industrial Revolution (Clean)", "lyrics": "[Intro: Immortal Technique]\nYeah, nigga.  Immortal Technique.  Metaphysics\n\n[Verse 1: Immortal Technique]\nThe bling-bling era was cute but it's about to be done\nI leave you full of clips like the Moon blocking the Sun\nMy metaphors are dirty like herpes but harder to catch\nLike an escape tunnel in prison, I started from scratch\nAnd now these parasites want a percent of my ASCAP\nTrying to control perspective like an acid flashback\nBut here's a quotable for every single record exec\n\"Get your fucking hands out my pocket, nigga!\" like Malcolm X\nBut this ain’t a movie.  I'm not a fan or a groupie and I'm not\nThe type of cat you can afford to miss if you shoot me\nCurse the Heavens and laugh when the sky electrocutes me\nImmortal Technique stuck in your thoughts, darkening dreams\nNo one's as good as me.  They just got better marketing schemes\nI'll lead you to your own destruction like sparking a fiend\n'Cause you got jealousy in your voice like Starscream\nAnd that's the primary reason that I hate y'all faggots\nI've been nice since niggas got killed over 8-ball jackets\nAnd Reebok Pumps that didn't do shit for the sneaker\nI'm a heatseaker with features that'll reach through the speaker\nAnd murder counter-revolutionaries personally\nBreak a thermometer and force-feed his kids mercury\nA&R's tried jerking me, thinking they call shots\nOffered me a deal and a blanket full of smallpox\nYou're all getting shot, you little fucking treacherous bitches!\n\n[Hook: Immortal Technique]\nThis is the business, and y'all ain’t getting nothing for free\nAnd if you devils play broke, then I'm taking your company\nYou could call it reparations or restitution\nLock and load, nigga.  Industrial revolution\n\n[Verse 2: Immortal Technique]\nI want fifty-three million dollars for my calloused hands\nLike the Bush administration gave to the Taliban\nAnd fuck packing grams, nigga.  Learn to speak and behave!\nYou want to spend twenty years as a government slave?\nTwo million people in prison keep the government paid\nStuck in a six by eight cell alive in the grave\nI was made by revolution to speak to the masses\nDeep in the club, toast the truth.  Reach for your glasses\nI'll burn an orphanage just to bring heat to you bastards\nInnocent deep in a casket—Colombian fashion\nIntoxicated off the flow like thug's passion\nYou motherfuckers will never get me to stop blasting\nYou're better off asking Ariel Sharon for compassion\nYou're better off begging for twenty points from a label\nYou're better off battling cancer under telephone cables\nTechnique chemically unstable, set to explode\nForetold by the dead sea scrolls written in code\nSo if your message ain’t shit, fuck the records you sold!\n'Cause if you go platinum, it's got nothing to do with luck\nIt just means that a million people are stupid as fuck\nStuck in the underground, a general that rose to the limit\nWithout distribution managers, a deal, or a gimmick\nRevolutionary Volume 2 murder the critics\nAnd leave your fucking body rotting for the roaches and crickets\n\n[Hook: Immortal Technique]\nThis is the business, and y'all ain’t getting nothing for free\nAnd if you devils play broke, then I'm taking your company\nYou could call it reparations or restitution\nLock and load, nigga.  Industrial revolution", "image": "https://images.genius.com/77d11425b9e1387078d4ea29c59b96e2.600x600x1.jpg", "album": "Industrial Revolution / Peruvian Cocaine", "year": "2003-01-01"}]}