{"songs": [{"year": null, "album": "Times Up", "image": "https://images.genius.com/2f6d89afef7f95ca5bcc656f6a1db33d.700x683x1.jpg", "title": "Who’s Killin’ Who?", "lyrics": "Black America, tell me who's killing who?\n\nBlack America\nKilling each others\nDying in the hands of the young black sisters and brothers\nThey're killing their own race\nGo anywhere in black america and you'll see that's only face\nTo watch Black America cry, no one see no one, DIE\nI blow this delight to keep'em alive\nWe've got to change the reflexions of the majority\nYou look in the mirror of Black America\nTell me who's killing who?\n\nDrug dealers are doin' the cherry in our community\nDestroy Black America, brother where's your unity ?\nAnd see throughout the subject that we must talk about\nThat we can point the Black America that sells drugs to\nA kid who don't even know her mom's your biggest customer\nThey're home starving cause you're always selling drugs to her\nAnd what did you do with the money?\nYou went and bought mo' drugs so you can make mo' money\nAnd kill the hope and dreams right in Black America eyes\nLettin' the few to know that drug is a way to survive\nIf you don't respect one another then help one another\nWill destroy one another and that's what they want my brother\nYou killing me, and I'm killing you\nNow stop and ask yourself how can the black dream come true\nWe got to change the reflexions of the majority\nYou view in the mirror of mirror of Black America\nTell me who's killing who?\n\nBlack man gotta stop calling the women a bitch\nYou're mother is a black woman too\nSo that's make you a son of a bitch\nThis is the wrong word to use my brother\nThat same word kept our black women back in the gutter\nNobody was there to pick a black lady up\nIn Black America, where time is rough\nU didn't care and it went away cause she was that to you\nMy point is Black America\nTell me who's killing who?\n\nWe fought together, lived together\nAnd if we don't get it together we all die together\nCause all we got is each other\nBlack american girls and boys and black fathers and mothers\nGet involved with the children, it starts at home\nThe Black America we save, could be our own\nWe gotta change the reflexions of the majority\nYou view in the mirror of Black America\nTell me who's killing who?\n\nBlack America tell me, who's killing who?\nKilling me, killing you, killing you\n(5X)"}], "artist": "K-Solo"}