{"artist": "Yukmouth", "songs": [{"album": "Thugged Out: The Albulation", "image": "https://images.genius.com/6dcb01d30774cfc257eef87de8bad453.500x500x1.jpg", "year": null, "lyrics": "Yes!\nIt's that nigga U Love 2 Hate!\nYes!\nU Love 2 Hate!\nThis the song I dedicate to niggas who love to hate!\nLook me in my face, I'm that nigga U Love 2 Hate!\nYes! (Fire! Fire! Fire!)\nIt's that nigga U Love 2 Hate!\nNigga U Love 2 Hate\nStop it\n(Ah, ah)\nNigga U Love 2 Hate\nNigga, I ain't fake!\n\nVerse 1\n\nBefore this rap shit\nI used to slang crack wit ghetto bastards\nPack automatic gats an kept scratch up under the mattress\nFuck this rap shit\nYay wrapped in plastic everyday practice\nRunnin away from task tactics\nHop fences leavin 'em ass backwards\nBefore this music\nI used to be the Ice Cream Man since 1992 biatch!\nDon't you hear the mutha fuckin muzik?\nI got a head but ain't no screws in it, losin it\nSlangin narcotics, them men two steps away from usin it\nAbusin it\nI moved then it was all bad\nIt seemed like soon as a nigga moved, then it was all bad\nBecause of this music, my whole block double crossed me\nGot shot in the ass, bra\nBut ain't no love lost see\nCuz now I have yo ass off the g's\nAn niggas found off the beach, wit holes up in they body for tryin to\nDouble cross me\nI could move across seas, and outta state\nSmokin weed\nHand yo ass an 8 to smoke to the face\nYa still hate nigga\n\nChorus *(Yukmouth)*\n\nCuz I'm that nigga U Love 2 Hate\nTell yo bitch it's that nigga U Love 2 Hate\nSmoke-A-Lot, Regime, nigga U Love 2 Hate\nAlbum to the face, nigga U Love 2 Hate\nYes, it's that nigga U Love 2 Hate\nYoung nigga, wit money, U Love 2 Hate\nMutha fuckas lookin at me funny, U Love 2 Hate\nCheck it\nWhat?\nNigga.... uh\n\nVerse 2\n\nIs it because I went on tour wit Biggie Smalls?\nOr is it because yo bitch will to drop to the floor an lick my balls?\nOr is it because a nigga sky ball, since juvenille hall?\nTo make these niggas straight talk shit, about me in front of they\nBroads, listen!\nOr is it because I'm ridin around in Range Rove's?\n4 point 6, G-S 400 on dubb mo-mo's\nAn both of my shit's got T.V.'s in 'em, what you don't know\nWhat the fuck you grind fo?\nJuss to pay note to the nine-four\nI'm ridin 9-8 shit\nIs that the reason for all the hatred\nI flipped Townhouse, you still at mom's house basement\nMad, walkin around tellin my friends I ain't shit\nBack when, you used to be that nigga who I smoked my dank wit\nRob a bank wit, because I trust you\nProbably take a slug fo you\nBut now a nigga got no love fo you\nNigga!\nBest friends became enemies for centuries\nAn jealousy juss means you mutha fuckas envy me\n\nChorus *(Yukmouth)*\n\nHate\nIt's that nigga U Love 2 Hate\nLabled to the face, nigga U Love 2 Hate\nDrugged out, smoothed out, U Love 2 Hate\nPoppin Xtacy an shit, nigga U Love 2 Hate\nUh!\nI'm that nigga U Love 2 Hate\nTell yo potnas it's that nigga U Love 2 Hate\nPlaya hate all the time, U Love 2 Hate\nWhat?\nWhy you hate me nigga?\n\nVerse 3\n\nUh\nIs it because yo bitch love me?\nOr is because I stay whipped in all the latest rugby's\nThugged Out, sippin bubbly\n\"Da Good, Da Bad, Da Ugly\", nigga finally livin lovely\nSignin autographs\nLil kids run up an hug me\nI'm from where they from, I was raised by crackheads an junkies\nHighschool flunky\nToo busy out there tryin to get my money\nHungry, I had to get it myself nobody dishin fo me\nAn now my niggas mad, claim that I ain't dishin fo he\nBut fuck ya'll nigga!\nWhat the fuck you done fo me?\nBut talk shit behind my back, and try an smoke my weed\nOr is it because I used to funk wit $hort an Master P\nHatin niggas after me, but now won't capture me\nNigga you can't even go gold\nWhat the fuck you sold?\nFive thousand units, nigga my shit went platinum across the globe\nOr is it because these fake ass hoes claim they got my baby\nAct shady, an crazy, reverse the game an now them bitches pay me\nThe day a nigga signed wit Prince J\nGot rid of them other niggas, became my own sensai\nSmoke-A-Lot, I got to record lable also\nPhats, L.Q., Maxx, KeKe, my nigga Gonzoe\nColloso, cheddar to make the nitros soggy\nRidin Harley's, die smokin juss like Bob Marley\nI died in the wide open, at the Mobb party\nWit yo eyes open, slugs through yo hard body\nPick up\nCuz it's that nigga U Love 2 Hate\nSincerely yours mutha fucka\nU Love 2 Hate!\nYours truly\nDone deal\nThat nigga U Love 2 Hate", "title": "U Love 2 Hate"}]}