{"artist": "Papoose", "songs": [{"album": "Cigar Society", "title": "John F Kennedy", "image": "https://images.genius.com/fe9456080b3cffa1c0ae0e9cb4218fd8.640x640x1.jpg", "lyrics": "[Hook]\nYou think it can't happen?\nEven Kennedy got shot\nThink you untouchable?\nEven Kennedy got shot\nThink you Big Willie?\nEven Kennedy got shot\nThis ain't a dance record\nThis is real hip hop\nRather eat crumbs with bums\nThen stakes with snakes\nLook me in my eyes, face to face\nI hit you on camera and take the take\nEven Kennedy got shot (blaow) stay in yo' place\n\n[Verse 1: Cassidy]\nYou not The President, You not the Pope, you not the king\nSo it's not a thing\nFor you to get shot and them shots to sting\nThey shot Abe Lincoln, Kennedy, Dr. King, Malcolm X, Biggie and 2Pac when they popped the thing\nSo yo, you should know if it's goons that want you dead\nAnd they comin' for your head\nWhen they see them shots will bring\nShells will make you yell and it sound like an Opera singing\nWhen the pistol hits you with more rounds than a boxing ring\nMan, they could give a damn if your chains and watches bling\nAll them clothes and them cars ain't gonna stop a thing\nSeriously, this Murder rap, I murder cats lyrically\nI'm reckless, Papoose might get arrested for Conspiracy\nYou should be scared of me\nI'll embarrass ya\nListen if you think you are competition then you tripping like a traveler\nI was a battler\nBut I made it so you stranglers could get assassinated\nFor assassinating my Character\n\n[Hook]\n\n[Verse 2: Papoose]\nI got bullets with rappers names on 'em\nAll loaded up in my black fifth\nBoy, my clip look like a track list\nHow you gonna stop me from popping hammers, dropping proper grammar?\nI'm a tell you like Kanye told Sway, \"You ain't got the answers!\"\nBig Gun Terminator searching for Syracona\nGangsters move in silence just like they J in Marijuana\nI pack a weapon\nA grown man with underage guns, my teck 9 and my MAC 11\nI'm a pimp boy particular\nPenmanship distributor\nPeriod at the end of a Paragraph finisher\nAlways been on the grind of my work, drive is vehicular\nHomicide with the Horse Power of Six Cylinders\nDrown in your own blood, die slow, you deserve it\nYou can suck a big fat dick, swallow, slurp it and burp it\nYour a serpent of the devil\nYou serpent, don't want your service\nBecause you rather serve swine instead of serving a purpose\n\n[Hook]", "year": "2014-03-05"}]}