{"artist": "IDK", "songs": [{"title": "Trippie Redd’s Freestyle", "lyrics": "[Video Intro: JFK]\nI can give you some people that were some of my personal favorites that didn't make it. In a lyricist lane, I do like- I'm a fan of IDK and uh...\n\n[Intro: IDK]\nThis next verse, these bars\nYeah, uh\n\n[Verse: IDK]\nI just realized that I'm a rich nigga\nMy mama and papa never made six figures\nBy 2019, I'll be at seven figures\nThis my moment of clarity, let me tell it jigga\nI gave up liquor, I gave up smoking\nKnowing that the green from being sober is way more potent\nNow people poking noses in my business\nPinocchio and they lying, trying hard to figure out\nWhich ho I'm strokin' to use they lotion\nI don't fuck no bitches, I got a wife now\nYoung nigga, grown rich nigga lifestyle\nI could line every rapper up right now\nAnd fade 'em with the bars to make every one of 'em lie down\nSleep, Poké Flute couldn't wake 'em up\nPoke a stick at they body\nNow po-po about to bring the cuffs\nOh no, I'm 'bout to do a bid\nOh shit, they 'bout to free the kid\nKillin' bad rappers is legal across the nation, bitch\nDie, die, die, die, die and I say it with passion\nHalf these people talkin' shit don't say shit\nWhen you leave the Internet\nAnd you happen to see 'em in passin'\nIt's just harder to see them outside of the actin'\nIt's more harder to see them outside of the laughin'\nWhen they only with they friends and sayin' that your album trash\nWhen right before they looked you in your face\nAnd told you you were snappin'\nThey the ones that stab your back in when they catch you lackin'\nThey the ones that shouldn't have been in the womb instead of napkin\nCapitalizin' off of these niggas lackin', what the fuck happened?\nNiggas turned to kingpins, Twitter fingers they get to tappin'\nMust've pushed the key under the tab, all your words is cappin'\nBitch, I am the captain, bitch, I am the chief\nBitch, I am the priest when I wake, bitch, you are deceased\nBitch, you are control, alt, delete, bitch, be gone for me\nBitch, you need to think before you speak\nBitch, you Candace Owens\nBitch, you panic knowing I don't need no XL stamp to excel\nI just got 20 bands and transportation in a XL\nTo make them throw they hands and scream my lyrics\nMeanwhile, people talkin'\nGot me askin' \"Where you at?\" without a Nextel\nNo, for real, where you at? The internet still?\nNo, for real, where you at? Your mama crib still?\nNo for real, where you at?\nMy comment section usin' cracked  iPhone 5Ss to hate my blessin's\nWildin', click your page\nAll I see is, \"This profile page is private\"\nWith a profile picture of Michael Jordan's face cryin'\nProbably 'cause I'm ballin' like I'm Lebron and you retired\nWhile a nigga still chasin' them rings like Blac Chyna\nNo major labels, keepin' up with niggas on major labels\nWhen I sign, the label's keepin' up with me, you won't be able\nEatin' at my table, you ain't cool enough and that's the lingo\nNow I put the classmates that used to laugh up on my payroll\nHo, I think I'm better than Cole, better than Dot\nFuck a tweet, bitch I'm just as good as Biggie and Pac\nR.I.P., this my Kodak, Lil Xan, and Yachty talk\nAkademiks cover him, Adam 22 with the shots\nY'all ain't got No Jumpers, double entendre, double entendre\nYou ain't catch it? Well, that's yo problem\nNow listen, this ain't no dissin', this ain't no hate\nBut keep it real, this is the Freshmen I didn't make?\nIn other words, all of you rappers is just steak\nWhen you fallin' off the bone of them charts, I'm eatin' your plate\nYou can't put me in a class when I'm busy teachin' 'em lessons\nSo next year, don't even hit me to be a Freshmen\nI'm gon' fuck it up, too many bodies, too many stretchers\nBetter buckle up, too much gas and I'm in a Tesla\nTesta Rossa in my future, they sleepin'\nI got the rooster, they seated\nI got the booster, I'm seein' over these losers\nPlease book me, Lollapalooza, I'm blowin', it's like a tuba\nI'd blow his head with a Ruger if he hot and can't cool up\nI'm blowin' like I'm a cougar's jaws, who's involved?\nWhose acoustics make his sonics look like he's infused with Nas\nMixed with Gucci, cross him without a cross light\nAnd you gon' see the crossroads twice, rest in Peace Phife\nYou gon' see life, pass before you better be nice\n'Cause I will body everybody\nIf I see sight of a nigga that don't even blink right\nShoutout YBN Cordae, IDK is my name\nHi, this Trippie verse, bye", "image": "https://images.genius.com/2269efa8c2519b59688897d7dc78f6f3.500x500x1.jpg", "album": null, "year": "2018-06-28"}]}