{"artist": "Valete", "songs": [{"title": "Roleta Russa", "year": "2006-10-05", "lyrics": "[Verso 1: Valete]\nAcabo de vir da festa de anos do meu mano Rogério\nFoi tudo bué bacano, ainda rachamos, lá, umas battles\nManos sabem que, quando é battle, eu sempre impero\nAbafei cinco wacks, só com um coxe de lero-lero\nAgora tô aqui na paragem, à espera do autocarro\nSão duas da manhã e rapo um frio do caralho\nNão podia sair mais tarde, isto é longe e não trouxe o carro\nE amanhã é dia, huh, é dia de trabalho\n\n[Diálogo 1: Vanessa e Valete]\nOlá, Valete. (Hm?) O meu nome é Vanessa\nCurti ver como esmagaste os rappers lá na festa\nSempre fui tua fã, mas é a primeira vez que te vejo\nJulgava-te mais velho, mas tu parece que tens uns 16...\nNão, mana, eu tenho 25 anos\nCarinha de puto, mas funciono como homem grande\nAinda bem que vieste, precisava mesmo de companhia\nTô aqui, a morrer de frio, com medo de uma pneumonia\nA esta hora duvido que tenhas alguma sorte\nSão duas da manhã e já não passa nenhum transporte\nVem para a minha casa, ficas mais aconchegado\nEu vivo sozinha e moro mesmo aqui ao lado\nAh, é? Moras aqui?\nSim, moro aqui há mais ou menos 3 anos!\nAh... Ok, ok\nPronto, esta é a minha casa, tás à vontade\nÉ como se fosse tua\nAh... Obrigado, obrigado!\n\n[Verso 2: Valete]\nEla pôs-me no quarto dela, bro, e dei por mim estupefacto\nQuando vi as centenas de CDs que ela tinha comprado\nCDs de Tote King, Gil Scott e Edo G\nMusiq, Jean Grae, Kanye e Kweli\n\n[Verso 3: Vanessa]\nValete, não sou como essas pitas que tu vês por aí\nVazias, papam toda a bosta que dá na TV\nNão curto G-Unit, P. Diddy, nem o Jay-Z\nCresci a ouvir EPMD e Chuck D\n\n[Verso 4: Valete]\nAhn... Eu nunca vi damas assim, por isso ainda tô pasmado\nAo mesmo tempo cativado, preso, entusiasmado\nEla tinha bué livros amontoados por todo o quarto\nA bibliografia toda do grande Jorge Amado\nDeixamos as horas passar, jogamos conversa fora\nFalamos de política, hip-hop e literatura\nTrocamos olhares, sorrisos e algumas histórias\nMaior intimidade, fez subir a temperatura\n\n[Verso 5: Vanessa]\nNão gosto quando me olhas, assim, tão intensamente\nAssim, até parece que consegues ler o meu pensamento\n\n[Verso 6: Valete]\nEu não falei, não tirei o olhar, aproximei-me\nNão perguntei, foquei nos lábios e beijei\nE saboreei-os bem, deixando-a sem reacção\nMinha língua entrelaçou na dela, pura conexão\nSussurrei no ouvido palavras de excitação\nSem pudor, bué tesão, roupa já tá no chão\nLambuzei os mamilos dela com dedicação\nBué calor, os corpos já tão em ebulição\n\n[Verso  7: Vanessa]\nValete, sente a minha cona, vai enfiando o dedo\nVê como tá toda molhada, suculenta e quente\nDeixa-me pôr a mão no teu pau e senti-lo teso\nDepois quero chupá-lo todo e pô-lo cá dentro\n\n[Diálogo 2: Valete e Vanessa]\nEpa, tô sem preservativos... Tens aí alguma coisa?\nTambém não tenho... Mas não te preocupes com isso. Vem\nNão, não dá, Vanessa.. Não dá, a sério...\nVem! Não me deixes assim... Deixa estar isso!\nNão, não dá..\nVem...\nSó com preservativos, mesmo, a sério\nUff... Foda-se! Que cena! Que é que queres fazer?!\nEpa... Não dá... A sério...\nOlha, só se fores à farmácia. Ao fundo da rua, tá de serviço hoje\nAh, é? Ok... Eu vou lá num instante... Epa... mas só tenho aqui dois euros\nTambém tô falidíssima... Acho que também só tenho dois euros, aqui\nYa... Passa-me estes dois euros... Acho que 4 euros chega. Acho que dá pra alguma coisa. Eu visto-me rápido e venho já\nVai lá, então... Leva as chaves\n\n[Verso 8: Valete]\nSaí cheio de pressa, atrapalhado à beça\nNunca me tinha calhado uma Vanessa destas\nEssa dama excita-me, bué, eu tenho que afundar o martelo\nPus-me na farmácia em dois segundos, Valete Obikwelu\n\n[Diálogo 3: Valete e farmacêutico]\n[Valete]\nBoa noite, eu queria uma caixa de preservativos\n[Farmacêutico]\nSó tenho Control e são 5 euros e 15\n[Valete]\nSó tenho 4 euros, falta-me 1 euro e 15\n[Farmacêutico]\nProblema é seu, isto não é a casa do senhor Joaquim\n[Valete]\nFoda-se!\n\n[Verso 9: Valete]\nSaí da farmácia, sem saber o que fazer\nVejo um mano no outro lado da estrada e vou lá ter\n\n[Diálogo 4: Valete e mano]\n[Valete]\nDesculpa, mano, eu nem sou de fazer estas merdas\nMas será que tens 1 euro e 15 pra eu comprar uns preservas?\n[Mano]\nTá fodido, brow, eu também tô liso\nNão tenho guito, mas tenho aqui umas camisas comigo..\n[Valete]\nObrigado, mano, tu nem sabes do que tu me safaste!\n[Mano]\nVai lá, despacha-te... E vê se fazes um bom trabalho! Haha!\n\n[Verso 10: Valete]\nCheguei à casa, outra vez, num ápice, como se eu voasse\nE vi a Vanessa toda nua, na cama a masturbar-se\nA contorcer-se, a lambuzar-se... Yo, a descontrolar-se\nMeu pénis que murchara, começou logo a elevar-se\n\n[Verso 11: Vanessa]\nValete, olha só pra isto, já não tá a aguentar\nVem, penetra-me violentamente, faz-me delirar\nTira essa roupa depressa, vem pra cima de mim\nEu quero que me comas toda, em posições sem fim\n\n[NO ACTO]\n\n[Diálogo 4: Vanessa e Valete]\nEspera, espera\nTão? Que é que se passa?\nO preservativo incomoda-me, tá-me a doer. Acontece-me imensas vezes\nQueres que eu faça alguma coisa? Que é que queres que eu faça?\nQuero que tires\nFui comprar preservativo e agora não uso? Isso tem algum sentido?\nVá lá, vá lá... Tira..\nNão... Deixa-te disso...\nTira... Vamos acabar isto...\nNão... Não vou fazer isso... Não tem sentido...\nTô cheia de vontade...\nNão, não vou fazer isso...\nNão compliques\nEpa, foda-se... Não vais insistir, não vale a pena\nNão te preocupes, não vai acontecer nada\nEu não vou fazer isso, Vanessa... Eu não vou fazer isso...\nVá lá...\nNão\nVá lá, vá lá... Tira..\nNão, não, não...\nValete...\nNão...\nTô toda excitada, vá lá...\nNão, não... Não vale a pena\nVá lá... Não há problema nenhum...\nNÃO! Foda-se! Não... Não vou fazer, não tem sentido...\nOlha, então, vai-te embora... Não tás aqui a fazer nada\nTás parva ou quê?! Tás-te a revelar agora ou quê?\nUma gaja aqui toda excitada e tu nem és capaz de servi-la\nFoda-se... Baza, mazé!\nNão! Bazo mesmo! Foda-se!\nBaza!\nFoda-se! Vim cá perder tempo\n\n[Outro: Valete]\nEsta história é semelhante à tua, provavelmente com um final diferente, né super-homem?\nTu que andas, a navegar aí à toa, desprevenido e desprotegido\nTu sabes das doenças que andam por aí?\nTambém sabes que existem 40 milhões de seropositivos em todo o mundo?\nTu podes ser o próximo, super-homem!", "album": "Serviço Público", "image": "https://images.genius.com/d3741ecc251896ab2b2ce66b00104389.800x800x1.jpg"}]}