{"artist": "Killer Mike", "songs": [{"image": "https://images.genius.com/f5e81e5d5f74cbb217e8988eb2ac58e7.400x400x1.jpg", "title": "Aye O", "year": null, "album": "Ghetto Extraordinary", "lyrics": "[Hook 1]\nYou're gettin' to your money holla\n(Aye Aye Aye Aye)\nYou ain't broke, pop a bottle go\n(Ooh Ooh Ooh Ooh)\nWhen Killer hit the stage they say\n(Aye Aye Aye Aye)\nAnd after the show they goin'\n(Ooh Ooh Ooh Ooh)\n\n[Verse One]\nAnother Sunday\nAnother show in the country\nGirl pussy poppin', shake that monkey\nFire up the [?] put the 'dro in the air\nNiggas throw up your set, put your hood in the air\nHalf the club on the pill, the other half on drank\nThe parking lot full of old schools with wet candy paint\nShit, just last week a young nigga got shot\nPlaying Superman, racing bullets in the parking lot\nEverybody know left him leaking in the street\nBut we'll hand it our self\nWe ain't talkin' to police\nYou already know the next day the hood put in work\nAnd came back to the club in R.I.P. T-shirts\n\n[Hook 2]\nYou're gettin to your money holla\n(Aye Aye Aye Aye)\nYou ain't broke, pop a bottle go\n(Ooh Ooh Ooh Ooh)\nIf you're riding candy paint say\n(Aye Aye Aye Aye)\nIf you're burning good dank go\n(Ooh Ooh Ooh Ooh)\nIf I gotta pull the K they sayin'\n(Aye Aye Aye Aye)\nAnd if I let it go they like\n(Ooh Ooh Ooh Ooh)\nWhen Killer hit the stage they say\n(Aye Aye Aye Aye)\nAnd after the show they goin'\n(Ooh Ooh Ooh Ooh)\n\n[Verse Two]\nI'm looking for the girl with Mike rolls in her hair\nTake a picture with me mama, put your ass in the air\nOne [?] in her mouth and her outfit tight\nShe ain't lookin' for a man she just wanna fuck tonight\nShe got titties like (Aye Aye)\nAnd ass like (Ooh Ooh)\nI'm firing up the 'dro while she pop a pill and roll\nI love a girl from the hood, fuck a video hoe\nBut y'all niggas know, I'll fuck a video hoe\nKiller been around the world, did sold out shows\nAnd came back to the hood and bought a Vert on vogues\nYou can call me Santa Clause cause I keep three hoes\nAnd even in the summer I'm knee deep in snow\nJeah!\n\n[Hook 2]\n\n[Verse Three]\nDeep in the south what do DJ's play?\nScarface, Eightball, UGK\nAnd G's don't dance, we bounce and step\nThrow bows to the right and stomp to the left\nWhat's up to all the young G's with a head full of locks\nGetting money on the block with a pocket full of rocks\nWe headed to the club, swerving and reckless\nCreased jeans, white tees, Bob Marley necklace\nYou know about the south\nYou know what we about\nGirl with short shorts and they asses hanging out\nDope boys on the grind with a grill in his mouth\nWe getting money down here, what the fuck is y'all about?\n\n[Hook 2]\n\n[Outro]\nPut your G's in the air for Grind Time Official. Purple Ribbon in the sky. David Banner. Killer Mike. History. Je-je-je-jeah!"}]}