{"songs": [{"title": "Narcotics", "year": "2016-03-09", "album": "Imperial", "image": "https://images.genius.com/5334159e716285acddf8b027463431ad.500x500x1.jpg", "lyrics": "[Intro]\n\"Why these, why these, why these, why these\"\n\n[Hook]\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\n\n[Verse 1]\nAye, smoking and twisting I'm black and I'm gifted\nThese crackers be thinking that niggas get wicked\nFerocious and vicious they bust out and diss us\nImperial pistols that Narc on a mission\nThat's another nigga dead, hit 'em with the beam infrared\nFrankly I'm fed up with Feds\nProfiling because my dreads, long\nNigga that's Biggie, it's dead wrong\nHead home, dro in the atmosphere\nWondering why they think a nigga selling narcotics\nAll because we niggas that be living in the projects\nIf I move funny they gon' hit me with the object\nObjective is subject watch kill\nTake you down if they know you got it\nBrains in the street they'll leave you thoughtless\nDamn\n\n[Hook]\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\n\n[Verse 2]\nKing of the mischievous South\nSpeaking with my deviant mouth\nHow do I feel since I'm black? Proud\nWhat's the shit you represent? Cloud\nNine on the side of my hip, bow\nThis the return of the black, owl\nMax Julien, bring the mac, out\nRaven Miyagi is back, ow\nBlack metal fist got these other motherfuckers caught up in the mix\nPut 'em in the bars when they didn't do shit\nGot the opposition living on the offense\nIt's why I gotta grab my rifle\nThink about survival, hand on the Bible, so\nI won't let none of them take my soul\nThat's why a nigga stay on ten toes down\n\n[Hook]\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\nWhy these crackers thinking that a nigga serve narcotics?\nJust because I'm living doesn't mean a nigga got it\n\n[Outro]\nWhy these niggas thinkin on the low that we got it?\nBitch because I got it doesn't mean a nigga got it\nWhy these niggas thinkin on the low that we got it?\nThinkin' every nigga is selling narcotics\nWhy do I have a lot of arrests? Because of harassment. Why is there harassment? Because them people that harass me, have set up a problem that made me, disagree with them violently and, and they, they set up these problem, in order to exploit me and other people like me\nThey think they're living in a police state and they become hostile toward the policemen\nAnd why they wanna get rid of me? Because I'm saying something that might wake up other exploited people and some depressed people and if all these people ever get together, then these pigs that are exploiting us we'll be able to run them into the lake. That's why they wanna get rid of us\nI want when they see me, they know that every day when I'm breathing, it's-it's-it's for us to go farther, you know? Every time I speak, I want the truth to come out, you know what I'm sayin'? Every time I speak, I want to shiver, and even if I get in trouble you know what I'm sayin'? That, ain't that what we're supposed to do?"}], "artist": "Denzel Curry"}