{"songs": [{"lyrics": "[Produced by: Statik Selektah]\n\n[Hook: Lil Fame]\nTime for some action\nYeah, but you don't hear me though\nCome on, here we go\nWe put it down everywhere we go\nSo motherfucker come on cause its\n\n[Verse 1: Action Bronson]\nHere's a toast to the fact that I'm a man and I can stand alone;\nAnd all my suits are made by hand in Rome\nRicotta stuff the cannellon'\nI'm in the garden smoking roses;\nDeliver like Malone, I'm talkin' Moses\nPart the ocean, spark the potion, diamonds in the rough\nWe shine 'em up, make a necklace, dive up in the muff\nThen wash my dick, straight to breakfast, hop up in the truck\nGot more flavor than some Dr. Pepper, hottest stepping struts!\nAnd the streets paved with concrete\nI'm known to smoke the same shit that makes the lawn green\nGaze at the moon right off the shore, dream—\nBut me no worry got a strong team\nJust like my Knick's '94 team—we winnin' though!\nGo 80 layers on the Baklava\nThat's hand made by my nana, peace to Antigona\nThe whole shkup, Bill Clinton Boulevard\nSince a youth Bronsolini known to put it on\n\n[Verse 2: Action Bronson]\nAlready mentioned with the people I respect up in the rap shit\nCouple of months you probably see me with an actress\nGetting my ass licked, while she driving never crashed it\nSmoking on that shit, fantastic\nA little breezy off the coast as the sun set\nGallop on beach on the horse cause we young vets\nLimited edition, signature inscription\nCertificate of authenticity, I'm on a mission\nQueens representative, dismember your genitals\nNow you got a pussy, fuckin with the general\nBas Rutten, I'm ass bootin', I'm past shootin'\nDisplay fast movements, know that cash rules\nDrug clothes and I ain't talking 'bout a bento box\nPenetrate your mind, spice it with the mental lox\nFundamental Soundgarden verbal Black Hole\nSon at the flicks getting sucked in the back row\n\n[Verse 3: Action Bronson]\nLungs filled, smokey like the pork shoulder\nLash out, one second in the fourth quarter\nTriple penetrate, pussy meat I renovate\nFuck 'em like a dog and leave 'em twisted like my mental state\nOff the deep end, snorkel in a river\nI take it back to Walkman's and tape decks\nIn Great Neck, having great sex\nI didn't even have a hair on my face yet!\nMy feet were always classic though\nPinky up, classy flow\nIf you know me, you know never to pass me blow\nStraight shitting on these songs so the grass can grow\n'Til we sitting in the garden, smoking\nListening to Marvin go\nI treat the shit just like a title fight, you sparring\nSooner dip Ferrari, sexin models straight from Holland\nLamb encrusted fennel pollen\nWhen I rhyme it's like the metal hollow\nThese other motherfuckers smell of flowers\nSissy", "title": "Time for Some", "album": "Starving on Reality", "image": "https://images.genius.com/c1ede5df22693a914ce708ed308bbad9.316x316x1.jpg", "year": null}], "artist": "Action Bronson"}