{"artist": "Petey Pablo", "songs": [{"album": "Diary of a Sinner: 1st Entry", "title": "Raise Up (All Cities Remix)", "image": "https://images.genius.com/0d2bbb0b347544f2a5d6ad0222f2fcda.220x220x1.jpg", "lyrics": "[Hook 1]\nThis one's for North Carolina! Come on and raise up\nTake your shirt off, and twist is 'round yo head\nSpin it like a helicopter\nSouth Carolina! Come on and raise up\nThis one's for you, uh-uh\nThis one's for who? Us, us, us! Yes sir\nOoh, Hot Atlanta! Come on and raise up\nTake your shirt off, and twist is 'round yo head\nSpin it like a helicopter\nStand up Virginia! Come on and raise up\nThis one's for you, uh-uh\nThis one's for who? Us, us, us! Yes sir\n\n[Verse 1: Petey Pablo]\nWho am I? Petey Pab motherfucker\nI'm The First puttin' it down for North Carolina\nBut guess what? (what) it's been worth it\nI'm a superstar, bought me a big ol' car\nFour point Six (see the car?)\nBlack fifty four, from the front to the back\nGot a button in the middle that makes a trunk go, eh eh\nBut it ain't bout that, it's about getting what you get and driving all back here\nBig Fellas (six fellas)\nHalf of me, and Carolina niggas don't have enough time together\nPolk, Bladen, Marshall, Hoke, Green County, Tillary (damn!)\nTransfer, Sandy Ridge, browns over here (greens over here)\nPasqoutank, down on the Odom East (let me think)\nJohnson County, Franklin, Burgaw, Newport, Warren, Shelby, Kenansville\nMan Catantwa Tarboro, Triangle, Goldsboro, Halifax, Statesville\nAnd all my niggas doing life behind the walls\nThis right here, right here, right here, this one's for\n\n[Hook 2]\nNew York City! C'mon and raise up\nTake your shirt off, and twist is 'round yo head\nSpin it like a helicopter\nAh, Jersey To Philly! Come on and raise up\nThis one's for you, uh-uh\nThis one's for who? Us, us, us! Yes sir\nAy, D.C. To Maryland! Come on and raise up\nTake your shirt off, and twist is 'round yo head\nSpin it like a helicopter\nHouston to Dallas! Come on and raise up\nThis one's for you, uh-uh\nThis one's for who? Us, us, us! Yes sir\n\n[Verse 2: Petey Pablo]\nBeat it, Beat it\nYou remember them days y'all, we use to play y'all\nThe radio and put our own little part in the song y'all\nWe use to (rep our city! rep our city!)\nRunning through the school halls\nJust before our basketball pep rally jumped off\nMy house, my home, my hood\nMy brother my sister my cous'\nMy nigga that was there from the beginning\nBeen wit me, even before I even been wit the world\nY'all niggas just glanced at it, then we got y'all staring at it\nBut it's been the same old North Carolina that's been there\nY'all niggas is getting it, oh it's a shame isn't it?\nOh you thought we said we were coming with a whole lot of songs\nWe were bullshh!\n\n[Hook 3]\nNew Orleans! Come on and raise up\nTake your shirt off, and twist is 'round yo head\nSpin it like a helicopter\nAh St. Louis! Come on and raise up\nThis one's for you, uh-uh\nThis one's for who? Us, us, us! Yes sir\nMan, M-I-A! Come on and raise up\nTake your shirt off, and twist is 'round yo head\nSpin it like a helicopter\nAll the way to L.A.! Come on and raise up\nThis one's for you, uh-uh\nThis one's for who? Us, us, us! Yes sir\n\n[Verse 3: Petey Pablo]\nMan I had to do it\nJust in case you were one of the ones that wanted to come and ask something stupid!\n(What you think you doing?) What it look like? Putting it down for my niggas on the south side\nNorth Carolina, South Carolina, and all my little bitty, hooks and cape towns\nWe gon' hit y'all ass, it's nothing but a T.D. blast, that we got coming at ya\n(Beat) slamming, (first) classic, go for this, what's after platinum?\n(Baby you'll walk the ball) and I don't mean to scare y'all but I'ma bout to bring it home\nBlow these fellas, these hills, these things and N.C. out the water\nHow's it feel to lose a motherfucker that's real\nTell 'em (I TOLD EM!)\n\n[Hook 4]\nThis one's for Chi-Town Playas! Come on and raise up\nTake your shirt off, and twist is 'round yo head\nSpin it like a helicopter (come on come on, come on )\nLas Vegas! Come on and raise up\nThis one's for you, uh-uh\nThis one's for who? Us, us, us! Yes sir\nThe Bay Area! Come on and raise up\nTake your shirt off, and twist is 'round yo head\nSpin it like a helicopter\nGot the whole world baby! Come on and raise up\nThis one's for you, uh-uh\nThis one's for who? Us, us, us! Yes sir", "year": null}]}