{"artist": "C-Murder", "songs": [{"title": "Concrete Jungle", "album": "Trapped in Crime", "year": "2000-09-05", "image": "https://images.genius.com/415d3692989ebe9e5966bfe9f80905c3.500x500x1.jpg", "lyrics": "[Intro: Snoop Dogg & C-Murder]\nHoody-hoo! C-Murder, wassup nigga?\nYou know how we doin No Limit D-P-G-C For the R-2-G\nYeah, thats right, check this out my nigga\nWhat? what? hahahaha, hahahaha, hahahahaa\nOh shit\n\n[Snoop Dogg]\nI sees the nigga on the tank with the bank and the cash\nA house down South, where I plants my stash\nGold medallions locked up with hash\nAnd the best weed you never had, haha\nI'm, lookin at mu wody its about that time\nMaster P hooked me up so now I got to get mine\nThese diamonds on my neck let you know I'm fine\nBut man, I'm so anxious like genuine\nRap lables, turn tables, it's all a fable\nSo many niggas'll sell their soul for a gold cable\nI refuse to lose, I want the walkin' G shoes\nSpit at you about these issues, I bless you\nI'm not here to diss you, the issue is relevent\nThis cold world'll make you kill a nigga\nEspecially one that's 'bout a dollar bill nigga\nDo you got it? do you want it? Do you need it?\nOr will you get it? I get it Big Snoop Dogg said it (nigga)\nI'm here to shead it , get down Right now (what?)\nTRU motherfuckin records (who?) in\nIn effect with the Dogg Pound (DPG) We're open now\nAnd all you niggas from the ghetto lookin' up at me\nAnd can't believe I went from nothin' to somethin', believe it G!\nPicture it, see it, touch it And watch how a real motherfucker does it\n\n[Chorus: KoKane]\nIt's like kill or be killed, in this here concrete jungle\nFor black folks, sometimes no don't love no one\nBut if I die before it's time, let it be known, let it be shown\nI was true to the game full blow\nAnd you know....\n\n[Goldie Loc]\nYeah, real niggas don't give a fuck\nWassup? keep it crackin', Lil Tray Deee\nBang back lil' homies, don't let them get your chest seen\nWatch your homies they waitin for you to slip\nIf I was sellin' in yo' shoes them nigga would have been the trip\nGhetto see ridin', rollin' till the sun come up\nNo second thoughts about my killin' I'm the first to duck\nBlue rag damp ni'a in every one of my pockets\nThrowin' up high in the sky Known you pissed off\n\n[Tray Deee]\nIt ain't no fakin of mine It's what I place on the line\nPaper chase is a crime So ain't takin' no time\nIt's all out till I fall out, full assault\nI'm on mission with No Limit trying full assault\nI want it all like my dog, fresh socks and growth\nBitches jockin' how I ball, shit drops the chrome\nBlazin' chronic, sippin' tonic, how we live for the three\nOn the street corner, heat, cause it's kill or seek he\n\n[Chorus]\n\n[C-Murder]\nI'ma steal this boo, when the cops behind me\nIt's kill or be killed, but them niggas can't find me\nIt's a test everyday, from the South to the West\nNiggas mad, cause my nigga Snoop is labelled the best\nGuess what? OG, in the game of rap\nAnd everytime that i see 'em, I get a nigga dept\nWhats up, to my partners Tray Deee and Goldie Loc\nQuick motherfuckin' niggas, always gon' smoke\nIn the concrete jungle, man you know where it's at\nIt's the place, where you wanna leave, don't wanna be at\nBelieve that, you can check in, but you can't check out\nLike Rae, everybody doin' their own shit to get paid\nYou might die, but it all, goes along with the job\nEven ride, do whatever it takes to survive\nYou a bitch! If you snitch on your friends\nBut you a true motherfucker, you don't fuck with the pigs\n\n[Chorus]\n\nC-Murder talks 'till fade"}]}