{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/632ff5f3c8fae5efa81d3b73cdef6b41.300x300x1.jpg", "title": "All Talk", "year": "2010-07-05", "album": "Independence Day", "lyrics": "[Intro: Christian Bale]\nThink for one fucking second, what the fuck are you doing? Are you professional or not? No! No! Don't shut me up!\n\n[Verse 1: Kid Cudi]\nEx-juvenile delinquent\nYes, relapse when I fuck with Jameson\nI'm thinking 'bout death like it's pussy in my mind\nAnd the vibe, and I'm feelin like life's so lame\nHeaven's probably iller, with way more babes\nWay more ways to get faded\nMy first album was emo? What the fuck\nCats tryna play me, now I gotta show 'em what is what\nI'm the one who comes when you're feeling so numb\nYou're the one who runs so I'm the one who hunts you\nHoes try to remember it's so fun to confront you\nI am the rager, I am forever\nHalf of the time most the time I'm blunted\nIf I die it wouldn't all be for nothing\nAnd all my life I'm doin what I wanna\nSo I'm livin' in the moment til God push the button on me\n\n[Hook: Kid Cudi]\nHmm, these niggas all talk hey\nHmm, these niggas all talk\nOver here we ain't half stepping\nOver here we ain't half stepping\nHmm, these niggas all talk hey\nHmm, these niggas all talk\nOver here we ain't half stepping\nOver here we ain't half stepping\n\n[Verse 2: Chip tha Ripper]\nI'm a cold young man Midwest Cleveland representer\nMy bitch could take your bitch home with her\nI'm hot and cold, but never lukewarm\nAnd niggas always talking 'bout what they can do for 'em\nI'm the prince I came royal penis stay clean\nAll the shit that I seen you can only day dream\nRunnin my city since I was 18\nThe coldest, so fuck what a hater might think\nChillin on the higher side of the clouds\nLife was nothing like life is now\nJust wanna have a couple dollars on deck\nAnd change their perspec I'mma aim for the neck\nIn the club I see you niggas jumping up and down sweating\nOnly for attention\nPathetic\nYou only paid twelve hundred dollars for that old school\nName dropping ass nigga, don't nobody know you\n\n[Hook]\nHmm, these niggas all talk hey\nHmm, these niggas all talk\nOver here we ain't half steppin\nOver here we ain't half steppin\nHmm, these niggas all talk hey\nHmm, these niggas all talk\nOver here we ain't half steppin\nOver here we ain't half steppin\n\n[Bridge]\nI can show you how to do this lame nigga\nUneducated nigga I can show you how to do it\nI can show you how to do this lame nigga\nUneducated nigga I can show you how to do it\nI can show you how to do this lame nigga\nUncultured motha fucka I can show you how to do it\nI can show you how to do it lame nigga\nOver here we ain't half steppin\n\n[Outro: LCD Soundsystem]\nTalking like a jerk except you are an actual jerk and living proof"}]}