{"artist": "Pacewon", "songs": [{"album": "Telepathy", "title": "Take Me with You", "image": "https://images.genius.com/a4515dd8ef93057384710db06a2ce521.500x500x1.jpg", "lyrics": "[Intro - female singer]\nEvery morning, every evening\nOh I love love love love loving you\n\n[Pacewon]\nMy girl love me, no question I guess\nNot to mention the attention I get\nBut sometimes I get mad though, like what're you, cattle?\nMary's little lamb, what are you my shadow?\nAnd when I don't run to you, you be off\nWith some ugly motherfucker, chillin in his Porsche\nGettin so fucked up that you start seein double\nAnd he see that you seein double, so it's trouble\nAnd here I am, just playin myself\nStayin to delf, walls, tucked away on the shelf\nWatchin every little step I take like B. Brown\nBet my conscience fuck with me now\nCause I'm not the one to throw a heart in the air\nAnd to tell the absolute, I'm startin to care\nBut if she playin with my head, I'd rather be dead\nWhen I asked her, this is what she said\n\n[Hook - female singer]\nTake me with you, take me with you\nIt would break my heart and soul if you left me behind\nTake me with you, take me with you\nI don't wanna stay around when you're gone\n\n[female singer]\nI can hear you, when you're callin\nAlways always always, always there\n\n[Pacewon]\nTake her with me?  Maybe I should\nOr maybe I shouldn't, like baby I'm good\nQ&A, what to do and say\nGot me takin Valium, at least 2 a day (gulp)\nGot me on the bottle, drinkin my joint back\nMade me a misfit, don't know where my boys at\nWhat's the deal?  What's today's mathematics?\nGot me in a daze like crack addicts\nGot me in a +Bond+ like +James+, I wanna respond and take aim\nBut these females play games\nSo I, keep it movin, play it like a b-boy\nNo feelings, cold as Leonard Nimoy\nHands crossed, one eyebrow up\nNot speakin, like I'm bugged, but no\nI guess it's just a couple things in the mind\nGoin on about you that made me think of a rhyme\n\n[Hook]\n\n[female singer]\nTo be with you is, all I wanted\nYes so c'mon, c'mon, c'mon, c'mon, take me with you\n\n[Pacewon]\nI would if I could but I can't so I won't\nBut it's good in the hood, I'll be back with a coat\nAnd a full length fox, if it's hot then it's rocks\nTo cool off the attitude you got\nEverytime I reach for my belt and my keys you don't breathe\nAnd you start turnin blue when I say I'm 'bout to leave\nI'm head over heels cause of you, what to do\nCan't handcuff her, can't cut her loose\nCan't pack her up, and sneak her on the plane\nSo you get mad and you creep to Lover's Lane\nI come home early, you know I don't play\nCatch you just like OJ\nThen I just kick you in the belly, do the man you with awful\nPunch him in the jaw, dismantle his torso\nThen I go to jail, I'm not on the road\nAnd all you ever send me is a carton of stogs?\n\n[Hook]\n\n[female ad libs to fade]", "year": null}]}