{"artist": "Prodigy of Mobb Deep", "songs": [{"album": "H.N.I.C Pt. 3", "title": "What’s Happening", "image": "https://images.genius.com/65ddd77ff59df02b544ca7aecbd742a1.500x442x1.jpg", "lyrics": "[Featuring: T.I.]\nYeah, let them know chip, hey\nI'm just saying lil shawty, what it do?\nHey, what's happening?\nOnce you get that map to a nigga ma\nAnd bring that back to a nigga ma\nOh yeah you scared of a nigga, huh?\nBut what you running from a nigga for?\nGet right, roll the dice\nIf you knew how I do it, you would roll it nice\nSo what you scared of mama, I'm getting bread lil mama\nHey all I wanna do is get a handout\nWhat's happening? Hey lil shawty, what's happening\nGet your mind right, hey what's happening?\nWhen I was doing my sets up in the yard\nAll that was on my mind was my broad\nMy star, you the bassest bitch\nJust the thought of us together got me extra bit\nI went extra hard, so I can sex you long\nSo it's not just good, it's extra raw\nBaby feel on my chest, I made that for you\nAnd you can squeeze off my back and scratch up my tattoos\nI'ma show you how love is supposed to feel\nIs supposed to be fun, we're supposed to chill\nI'ma be your fairytale story book dream\nLeave all the lights on, this needs to be seen\nSo we can remember this forever\nLike gucci embedded in your brain I'm better\nThan any of these boys you was toying with\nWhile I was gone so long on that up north trip\nHey, what's happening?\nOnce you get that map to a nigga ma\nAnd bring that back to a nigga ma\nOh yeah you scared of a nigga, huh?\nBut what you running from a nigga for?\nGet right, roll the dice\nIf you knew how I do it, you would roll it nice\nSo what you scared of mama\nI'm getting bread lil mama\nHey all I wanna do is get a handout\nWhat's happening? Hey lil shawty, what's happening\nGet your mind right, hey what's happening?\nWhen I was in the can I was getting my back strong\nOn the while thinking of you when I get back home\nDrinking pine apple juice all night\nSo I can taste sweet in your mouth is alright\nI'm taking you to new heights and new dimensions\nSunsets, sunrise, we still ripping\nThe hotel same beach and apart\nWe scream jesus, how could it still be so hard\nWe take breaks for cold drinks and dinner in bed\nAnd after we finish, you know what desert is\nThe real flavor of love\nDamn is so good, I ain't tryna share none\nThis is real gangsta love\nMatching attitude, yeah, his and hers\nBeat it up so right, the feline will go numb\nIt's big novocain needle of mine, it's like waaaa\nHey, what's happening?\nOnce you get that map to a nigga ma\nAnd bring that back to a nigga ma\nOh yeah you scared of a nigga, huh?\nBut what you running from a nigga for?\nGet right, roll the dice\nIf you knew how I do it, you would roll it nice\nSo what you scared of mama\nI'm getting bread lil mama\nHey all I wanna do is get a handout\nWhat's happening?", "year": "2012-07-03"}]}