{"artist": "King T", "songs": [{"image": "https://images.genius.com/641a3479424d2748b1235e965b5adbcc.320x320x1.jpg", "title": "6 in Tha Moe’nin", "year": null, "album": "Thy Kingdom Come", "lyrics": "[King Tee]\nSix in the mornin', awakened by a knock on my door\nGrabbed my fo-fo' before I put my feet on the floor\nAnd yelled \"Who is it?\", peeped through my blind just a smidget\nMy nigga Bone stood in some cold black lizards\n(What's up!?) Nigga how ya been, what ya doin'?\n(Ah, some niggas havin' problems with my money so I flew in\nYou know this kid Juan, got a sista named Chatan?\nLive up in the Palms sellin' chronic by the tons)\nAs ya mention, he got that woodgrain Expedition\n60's tried to kill him but they missed him\nThey said that nigga got a big mouth, boastin' bout some hustlers\nThat he hit from Down South, what's that all about?\n(That nigga's crazy, show me where he hang, it's all gravy\nPut on some clothes, I'm double parked in my Rolls and niggas hate me)\nI feel ya baby, let me grab this linen\nAnd slip on these sandals with the ostrich all in 'em\n(Man call them stripper hoes, tell 'em call all they people\nI hear that nigga hidin' out, trickin' at the Nikko)\nDon't worry 'bout a thing (Yeah I need to calm down)\nWell let me grab some mary jane, get higher than a plane\n(Do you still got that Glock that I gave you on the block?\nSome funk was 'bout to pop then you ran up in that spot)\nAh shit, I forgot all about that heat Bone\nI got the stash spot in my Brougham (Well nigga it's on)\n\n[Hook #1]\n\"Who the fuck\" - \"Who the fuck is this?\"\n\"Big black motherfucker with G's\"\n(It's King Tee)\n\"Who the fuck\" - \"Who the fuck is this?\"\n\"Big black motherfucker with G's\n(It's King Tee)\n\n[King Tee]\nLookin' shady, doin' 80 (babay!) Don't temp me\nThe weed smoke floatin' like the Bentley\nLay back on a gangsta mack strictly\n(Man just wait 'til I catch that young fool that tried to get me\nThey says he probably rollin' around like he ownin' the town\nNot knowin' I'm down, not knowin' I clown) *phone rings*\nWell loc, them stripper hoes just hit me\nThat nigga at the Century Club playin' Big Willie\nDancin' with the Cristal, the ho had the nerve\nTo say a nigga missin' out (What?! Who the fuck is that?)\n(Tell them stripper hoes to pop that twat and keep 'em hot)\nAnd when he come out (Loc, that nigga gettin') *gun shot*\n\n[Hook #2]\nOoh, his first mistake was\nHe had to do the crime\nHe had to hustle mornin' to the night\nIf, he would have known then\nThe things that he knows now\nHe might not have got that time in Wayside"}]}