{"songs": [{"year": "2008-10-15", "album": "The Renaissance", "image": "https://images.genius.com/2de689e653558c368ee0ee2d5b9d131f.220x220x1.jpg", "title": "Move", "lyrics": "[Intro: Q-Tip]\nHere we come yo, here we come\nHere we come yo, here we come\nHere we come yo, here we come\nHere we come yo, here we come\nHere we come yo, here we come\nHere we come yo, here we come\n\n[Verse 1: Q-Tip]\nI'm just a brotherman, descendant of the motherland\nI fuck with blackberries and dimes and butter tens\nGood on my right and trouble on my other hand\nLife is a tight rope I'm dyin' the balance in\nAnd by the end hopefully I be the balance-man\nA simple dude who can exude the talents and\nI am the captain of the hot blooded caravan\nSpread in a different look to charred and battered lands\nIt's outta function I see girls that can top it off\nI hold mines while these cowboys pop it off\nYou just a movie-dude claimin' that you pop-soft\nThis shit's like cold grits without the hot sauce\nThis government seems to me like it's off course\n\n[Hook: Q-Tip]\nCome on, come on, let's move! And get down (like it's off course)\nCome on, come on, let's move! (This government) and get down\nCome on, come on, let's move! And get down (ride with me)\nCome on, come on, let's move! And get down\n\n[Verse 2: Q-Tip]\nYour dubious style may rock for right now\nBut in the long run, you really lost one\nJamaica, Queens, man, land of the tossed gun\nIt's never easy, po-lice not sees we\nGo through the checkpoints birds flip to po nine\nI got a bad bird nicknamed her sunshine\nI treats her so kind sweetening her at nighttime\nInto the right tunes we hit the right rhymes\nI dig her fashion smash into my memory\nAnd in the club shorty stays real into me\nA humble dude and never will pretend to be\nThe type of artist that's desired for the industry\nCame in this fucka me and I'm a leave me\nAnd in the end B you would believe me that I'm a leave me\nSo what's a industry if the listeners will always stand beside me?\n\n[Hook: Q-Tip]\nCome on, come on, let's move! And get down\nCome on, come on, let's move! And get down\nCome on, come on, let's move! And get down\nCome on, come on, let's move! And get down\n\n[Outro: Q-Tip]\nHere we come yo, here we come\nHere we come yo, here we come\nHere we come yo, here we come\nHere we come yo, here we come\nHere we come yo, here we come\nHere we come yo, here we come"}], "artist": "Q-Tip"}