{"artist": "R.A. The Rugged Man", "songs": [{"album": "Night of the Bloody Apes ", "year": "1994-11-05", "lyrics": "[Intro]\nHurragh!\nYo, R.A.? Get these bitches on my house, man, what's goin' on?!\nYo, this is rocking real!\nBLAOW!!!\n\n[Hook]\nFat bitch (Hookin' with the hookers!)\nStank whore (Hookin' with the hookers!)\nCave bitches (Hookin' with the hookers!)\nSmelly snatch (Hookin' with the hookers!)\n\n[Verse 1: R.A. The Rugged Man]\nRrarrghoh, check out the flow but the brothers can't get with the program\nBut they bitches don't debate us they respected now (?)\nSo play this rock a bitch like Amadeus (suck my dick!) I don't let 'em\nThe man Gibbs is in the house, ya better know this cat\nI got my Basket Case shirt on my back\nSo I got 10 Joe so I fuck 10 hoes\nI got more raps then ya mother got dildos\nAnd I suppose, I take off the phat bitches clothes\nThen I feel upon a fat bitches rolls\nI drink ya blood of an ignoramus got to have a pregnancy test\nI dismember a million dead rabbits, why do you do it to me?!\nI don't care who she be that I stick any fat booty, I see\nNow I'm impressed by the Cap, pick up the mic slow would ya get me now!\n\n[Verse 2: Glen Gibbs]\nStick 'em up, shut your idol up, aw fuck\nI got the bitches turning tricks doing backflips to this funky stuff\nEnough's enough it's time to get down, and I mean on it\nNot like this punk ass bitch kids who claim they the hardest\nJust grab the mic, pick it up and do your thang\nIf you get some props, cool but if not you'll proper get a karate kick\nSo reminisce on this quick\nAnd bust and boom the cats, rats growing like a fucking monsoon\nYou know they hitting hard word up, cuz I'm hard at hitting\nI'm leaving MC shitting and girls extremely dripping\nSo check the fact ass black dope enough to slay\n'Cos hey, hey, Cap, don't give a motherfuck what they say\n\n[Verse 3: Capital T]\nAw shit, give me a drink, bitch\nGive me a drink because these niggas on the brink\nNow who am I let's try a stiff one I'm that tight maniac\nSo get the fuck back or get ya ass cracked\nNigga like I don't fuck around, I don't play-play\nI rip shit, backflips and I'm (?) like O.J\nCrustified niggas pullin' triggers on the flip\nTip, with the dibbs (?) bring ya fuckin' whips\nTherefore, I'm do it on ya handle\nThe niggas talkin' shit but you see I Do-ray-Me yo\n'Cos I hit a hoe, I make a hoe take a bath\nHit the hoe, make it last swing around her snatch (whoo shit!)\nYou wanna know me? You wanna know me but ya gotta blow me\nAnd when you (?) I let you do my homies\n\n[Hook]\n(Undecipherable) (Hookin' with the hookers!)\nHookin' with the hookers!\nHookin' with the hookers!\nMichael Jackson (Hookin' with the hookers!)\n\n[Verse 4: Glen Gibbs]\n(Ya big faggots)\nAm brag-a-docious, ferocious I hold this: two-tonne magnificent\nRhyme, my nigga R-A, I knows it's\nAttractin' emcee's, and hip hop fanatics, addicts\nIt's so dope, they got a fuckin' habit, but just chill you can't\nStick it in ya vein, pain, ya need the boombox that rock that get into ya brain\nAs I flip it on and off, and on/off, I flip it\nSo make some fucking noise if you down with it (Raarg!)\nYo ya bought it\nI'll school ya ass, likes a kid from kindergarten\nI take a bat out ya ass like a hood they robbin'\nWhat you startin', ya better smarten up\nBefore you get shut down like a sitting duck rip shit quick\nOn the mic, yes, I snap (yo, kill 'em, Cap!)\nNow you bitches know who the fuck I am?\n\n[Verse 5: Capital T]\nI knew I could flow but you never knew how good\nBitches know I'll be cos they I'm no good (aah!)\nQuick where's my drink, I think I can see clear now\nI get so fuckin' hype, I do it.. triple sound\n'Cos I flip with the lyrics, while my lips\nTic-tac-toe a hoe while tip toe thru her tulips\n'Cos I get diesel, fuck Evil Knievel\nIt's not one of my idols, I fuck-a upon my bibles\nIt's lunatic on the music, get ya corny ass crew\nAnd get ya ass kicked, let me get ya Crustified mad trip\nCatch a cap thru the back or an axe to the torso\nThen ya girl ride me like a horse, yo!\n\n(Do me, do me like that... YA FUCKIN' WHORE!)\n\n(It's the children!)\n\n[Verse 6: R.A. The Rugged Man]\nLook what she sees, the goal is not crusta-female species\nYo, baby, I get props, he chased this girl for in her species\nAnd with that B, ya better batter me\nYou front on real motherfuckers, I could piss on your whole posse\nRaaaorrgh, I might not be cute, without a second doubt\nWith my (??) pick up the boots, so don't test, arrest this testis\nI put my nutsack in your raps until she looks like Dizzy Gillespie\nWhy no team better than meeee now\n(?) on ya titties\nI got my (?)\n\n[Hook]", "title": "Hookin’ With The Hookers", "image": "https://images.genius.com/0459459cdc2f6a1ba50292d192b060db.500x500x1.jpg"}]}