{"artist": "Benzino", "songs": [{"lyrics": "MT, Benzino, Daz Dilly\nYeah, yeah, yeah, yeah\nYeah, yeah, yeah, yeah\nHey, I'm back with a hit at this dumpster\nPlus your speakers dump that real shit to blow out your twist\nPull out your heaters if you're cold, warm it up, get it up\nMy niggas and my bitches get your hands, get 'em up\nI gets rough ride, get it raw like never before\nHard core explore, nigga to knock down your door\nIt seems you can't take no more, so stick 'em up\nNow give it up to get your nigga's buck, what the fuck?\nI struck a match, I tip my hat to the left\nI get them niggas, with the laws of death, I got the rep\nMotherfucker, my name is Daz, I'll whoop ass\nEveryday, all day, I count big ass cash\nIt's just I keep on comin' with it, I know you're scared with it\nIt's Diggy Daz and Benzino back on a fuckin' mission\nOh no, nigga I'm back with another dose\nAnd if you niggas don't know, I rock coast to coast\nI hit you with that click-clack, in that pick-pack\nNiggas wanna do that and they said that I did that\nThe D A to the Z and Mr. Dillinger willin' to fuck a priest\nNow my niggas, you know who run the streets\nEvery time I come around to your club or the spot, we got it hot\nAll my niggas and bitches, why don't you yell it out?\n(Daz)\nAnd if you see me coast to coast\nDon't act like you seen a ghost\nJust scream it out\nBenzino, temperature is risin'\nI want you inside me, touchin' on my body\nBoy, you got me burnin' and I can't hide this feeling\nExtra hot and I'm waitin' for you\nI'm steady livin' and shit, you see it's evident\nI canary wearin' it, I'm not even not even hearin'\nYa meet her at the Meridian\nUnforgettable experience, hit that\nI'm killin' it, macked out, I'm swervin' it\nCrapped out your nervousness stacks\nI be deservin' them cats\nI'm not concerned with them\nWho do I never heard of ya act out?\nI murder ya, blast out I'm burnin' ya\nNiggas ain't that appalin'\nAnd chicks I be importin' them\nFly that ass Zino, put you up in first class\nShe bring a coat for D A Z at the crib with L-T\nFeelin' doggy-style, part three\nEvery time I come around to your club or the spot, we got it hot\nAll my niggas and bitches, why don't you yell it out?\n(Daz)\nAnd if you see me coast to coast\nDon't act like you seen a ghost\nJust scream it out\nBenzino, temperature is risin'\nI want you inside me, touchin' on my body\nBoy, you got me burnin' and I can't hide this feeling\nExtra hot and I'm waitin' for you\nClick-clack, I'm bustin' 'em, hit stacks, I'm clutchin' 'em\nThis track, I'm crushin' 'em, back door, I'm rushin' it\nFlip rhymes, complete with it, hit dimes, I'm sick with it\nGrit nines, I'm spittin' it, ass hard, he feelin' it\nBlast off, I'm pealin' it, drop-top, be wheelin'\nAnd everybody be sayin' that \"Benzino is the realest thing\"\nNow here we go again, let's get this dough again, fuck it\nI fly to Logan and Zino rip up the show again\nChronic steady, smokin' it, the drama never provokin' it\nNiggas already knowin' that Jacob, he keeps me glowin'\nAnd East we keep it hustlin', South they keep it crunk\nAnd West they keep it comin' and West they keep on gunnin' it\nEvery time I come around to your club or the spot, we got it hot\nAll my niggas and bitches, why don't you yell it out?\n(Daz)\nAnd if you see me coast to coast\nDon't act like you seen a ghost\nJust scream it out\nBenzino, temperature is risin'\nI want you inside me, touchin' on my body\nBoy, you got me burnin' and I can't hide this feeling\nExtra hot and I'm waitin' for you\nEvery time I come around to your club or the spot\nWe got it hot, all my niggas and bitches, why don't you yell it out?", "image": "https://images.genius.com/6e1c33f62c229b45d503c4857602a733.1000x1000x1.jpg", "year": null, "title": "X-Tra Hot", "album": "Redemption"}]}