{"artist": "Porta", "songs": [{"album": "Reset", "title": "Los sin nombre", "image": "https://images.genius.com/0786171922516cdb77f0f7ea0149854a.953x953x1.jpg", "lyrics": "Somos los sin nombre...\nVivimos en las sombras...\nAusentes... SI! AIGH!\nSomos los sin nombre...\nVivimos en las sombras...\nAusentes... SI! AIGH!\n\nDentro\nCon lanzar mis dardos y dar siempre en el centro\nVen te invito a la soledad de mis adentros\nEl mundo que se abre ante ti si me concentro\nNo vayais a sacar el monstruo que llevo dentro\n\nCon lanzar mis dardos y dar siempre en el centro\nVen te invito a la soledad de mis adentros\nEl mundo que se abre ante ti si me concentro\nNo vayais a sacar el monstruo que llevo...\n\n[PORTA]\n\nNo se qué soy, pero se que soy diferente\nSin miedo a llorar ni a aparentar ser el más fuerte\nNo temo al dolor ni a la muerte\nPero pensaba que el amor duraba para siempre\n\nDeja que te tiente\nPasarme por ensima te va a costar\nPAM PAM, para pararme tienes que matar\n\nSoy único, el último de mi especie,de una pieza necios\nCreen que pueden encontrar su ansiada salvacion si rezan\nYo tengo una habilidad especial como giro por ellos\nToy en la lista negra de Dios, se que me tiene a tiro\nY no le tengo miedo\nCon medio pie en el infierno y el otro en el cielo\nNo se yo, pero este rap sera eterno!\n\nCon un Mic. hablo con mi cuaderno\nSoy distinto a ti\nNo se fijaron en mi solo por lo externo\nPara nada, muchos me apodaran monstruo\nYo soy de los otros\nNo oculto este rostro...\n\n[ISUSKO]\n\nSin mojar mi identidad camino sin direccion\nQuiza nos hayamos cruzado en alguna ocasion\nNo es facil reconocerme, parezco del monton\nPero no te equivoques yo soy uno entre un millón\n\nSe creen estrellas\nUn eclipse solar es lo que traigo\nDoy un paso hacia adelante aunque parezca que me caigo\nEstoy en busca y captura, ofrecen recompensa\nExtraño, dono maldiciones a ver lo que piensas\nNo me canso de decirlo, lo he repetido tantas veces\nNo eres mas por lo que tienes, sino por lo que mereces\n\nSi pagaran por pensar quiza yo ya seria rico\nSoy un chico normal que sabe que lo que hace es unico\nNo se que les doy, no se qué tiene mi rima\nPero la gente se amansa cuando se les pone ensima\nEs el tsunami de la India\nTerremoto en Lima\nUna bomba nuclear parecida a Hiroshima\n\nDentro\nCon lanzar mis dardos y dar siempre en el centro\nVen te invito a la soledad de mis adentros\nEl mundo que se abre ante ti si me concentro\nNo vayais a sacar el monstruo que llevo dentro\n\nCon lanzar mis dardos y dar siempre en el centro\nVen te invito a la soledad de mis adentros\nEl mundo que se abre ante ti si me concentro\nNo vayais a sacar el monstruo que llevo...\n\n[ISUSKO]\n\nQuieren conocer a quien oculto tras la mascara\nFrotarse con migo a ver si salgo de la lampara\nNo me encontraran vivo escondido entre la gente y\nSoy como la desgracia que aparece de repente\n\nSolo son palabras\nHe aqui mi obra\nMi solidaridad doy de lo que no me sobra\nAsi cobra vida un pensamiento, cojo un micro y vibro\nTe doy una leccion que no aparece en ningun libro\n\nPor eso hablame, rap pasion del llanto del sofoco\nQue yo no conozco genio que no tacharan por loco\nAntes busco al zaperoco (QUE?) huellas de elefantes\nQue le jodan a la vida si la vida te dio poco\n\nEs de heroe sonreir con el corazon llorando\nFracasar mil veces y aun asi seguir luchando\nTengo un mensaje que decir al mundo\nEs tan facil ganar que prefiero ser segundo\n\n[PORTA]\n\nExito en fase de prueba se que soy un sujeto especial\nAun no han descubierto ni la mitad de mi potencial\nMe estudian como a un fenomeno paranormal\nEsta habilidad para expresar es sobrenatural y punto\n\nBusco mi equilibrio justo, tu llamame como quieras\nSoy la fiera sin bozal no busques mas pegas\nTemes lo que desconoces\nA veces oigo voces que tu reproduces\nEstos dos son la luz que te abduce\n\nSoy el anti-raper, sin capa ni antifaz\nNo soy uno mas, soy distinto, fijate en mis pintas\nNo busco agradar a los demas\nMe guia mi instinto animal\nTu lo llamas sangrar, yo, sudar tinta\n\nEste jamas se rinde sin luchar\nSolo salgo cuando llueve\nCon walkman y mi capucha\nEstoy cercano a ti aunque viva alejado de todo\nMe han intentado hundir de mil maneras y aun no han encontrado el modo\n\nDentro\nCon lanzar mis dardos y dar siempre en el centro\nVen te invito a la soledad de mis adentros\nEl mundo que se abre ante ti si me concentro\nNo vayais a sacar el monstruo que llevo dentro\n\nCon lanzar mis dardos y dar siempre en el centro\nVen te invito a la soledad de mis adentros\nEl mundo que se abre ante ti si me concentro\nNo vayais a sacar el monstruo que llevo...\n\nLo que\nNo te\nMata te hace diferente\n\nSe que\nTemen\nEl poder de nuestras mentes\n\nTu eres\nMi hombre\nNo intentes hacerte el heroe\nY menos en frente de uno de los sin nombre\n\nLo que\nNo te\nMata te hace diferente\n\nSe que\nTemen\nEl poder de nuestras mentes\n\nTu eres\nMi hombre\nNo intentes hacerte el heroe\nY menos en frente de uno de los sin nombre\n\nPORTA!\nISUSKO!\n\nEsto es lo que ocurre cuando los sin nombre vuelven a juntarse, SI!", "year": "2012-05-07"}]}