{"artist": "Andre Nickatina", "songs": [{"title": "Cobra Status", "album": "Raven in My Eyes ", "year": null, "image": "https://images.genius.com/c1330c23535f72013404c70819b54875.500x500x1.jpg", "lyrics": "[Verse One]\nMy drug/rap competitors, they come in flocks\nI can't sleep cause when I do I think the game gon' stop\nSo I'm awake like an owl at a quarter to three\nI hit your window with a nickel, \"What's up baby, it's me\"\nWhere I'm from we hate cops like we were bred to do it\nBelieve in Nike signs and gettin' high, so bitch just do it\nRight or wrong, wrong or right, we'll disobey\nSmokin' weed, plottin' greed, listenin' to Sade\nMan I hustle all day, eatin' cat fish and snapper\nBattle everything from gat clappers to rappers\nTry'na have paper from the bottom to the tip\nTwo words I can't resist; Motherfucker or Bitch\nI lost a few nickels but I never drop dimes\nHuh, Pisces is the rap sign\nCobra Status!\nSwimmin' like the man from Atlantis\nA ho like Whodini, but like Houdini I will vanish\nBaby was nineteen with a big ol' ass\nShit, damn near gave a nigga whiplash\nDon't ask me for money because I'm not gonna share it\nSmokin' weed for Bob Marley because he bucked down the sheriff\nYou best hope this wax don't cut you\nHope one time don't bust you\nThis style will finger fuck you\nAnd patna I just can't trust you\nCobra Status!\n\n[Verse Two]\nRecognize game when it's on yo' mind\nYou and that bitch playin' Andre rhymes\nLooping situation like an SP-12\nGo to hell, I made bail, Nigga fresh outta jail\nWith the look of the replicant, shit gets deep\nAlready blunted up, and man I'm bumpin' the beat\nReal pimp shit all in your bra\nThought it was me, but it's my little cousin Bobby Shaw\nCobra Status!\nNigga I'm the lost pimp of Gladis\nColder than a forty hard to shake like a habit\nNigga I'm a hawk, you a forest bunny rabbit\nMy crew stay true but we can also get savage\nCobra Status!\n\n[Verse Three]\nBitch don't call me unless the party is packed\nAnd gangsta shit is bumpin' on every track\nNigga them dice ain't got no love\nShakin' like a nigga scared behind his gun\nCause see, I tick like time and man I time like tick\nMan niggas don't forgive and we sure don't forget\nIt's the receiva, the six feet and ova, female ice creama\nRollin' cheeba in a beama\nWith a poetic passion, in a functional fashion\nA full tank of gas, and man I'm mashin'\nSpeed like a Z-28 tinted crow\nLook if you want, your reflection will show\nCobra Status!"}]}