{"songs": [{"title": "Liquor Sicc", "image": "https://images.genius.com/8r8ajx2cbm92408bt8tkjbsdy.300x300x1.jpg", "lyrics": "[Intro]\n(Q-Ball, Q-Ball, Q-Ball, Q-Ball)\nSo what really happened, nigga?\nI understand ain't nobody did shit\nAin't nobody did shit for my cuz\nWhere them niggas at that said they'd put it all on the line?\n'Cause nigga\nOnly chop they emptied went up toward the sky\nI gotta know where niggas heads at\n'Cause my cousin still ain't got no peace yet\nSo all you motherfuckers wanna know where I stand?\nNigga, I stand right next to my cousin Emil, nigga\nYou know what I'm sayin'?\nAnd that's on the Blocc nigga\nHowever you wanna handle this shit, nigga\n\n[Verse 1]\nLook up in the sky, it's a motherfuckin' slug\nSome nigga done let one off and only my cousin's sheddin' blood\nThat loccest muthafucka from 29th Street throwin' up his flag, some nigga got mad\nAnd went to the crib for the forty-four mag, returned to the set-up and let my cousin have it\nThat nigga that died for the Garden Blocc gang, did time for the Garden Blocc\nAnd ended up stuck in a muthafuckin' casket, but I don't be givin' a fuck\nI'm tappin' up in your program\nBefore you know it I'm creepin' up on you in a licorice dark, black, drop-top Brougham\nWith a twelve gauge pump in the trunk and a clip full of funk\nAnd a fat Purple Kush blunt, so call it what you want\nI call it the fever of the funk house, dumpin' gauge shells in that ass\nLeavin' you face down, chest down with a gang of guts hangin' out your ass\nNigga you know the process, they wanna kill me now\nI'm a dead man walkin' to my funeral, can you feel me now?\nAnd if I die before your set gets blasted\nThat's on the Gardens I'm gon' rise up out my casket\n\n[Chorus]\nI'm liquor sick and I just might lose control\nSo load your clips, locs, 'cause we ridin' for my folks\nI'm liquor sick and I just might lose control\nSo load your clips, locs, 'cause we ridin' for my folks\n\n[Verse 2]\nAnd I'm out in six-five hardtop Impala lookin for that one eight seven\nThere he go and I'm right behind him bustin' with my MAC-11\nStraight bumper-to-bumper twelve gauge pumpin' was that Lil X Loccsta\nGivin' up his set and dumpin' on niggas just like he's supposed to\nNigga this is real deal shit\nIt's not about Crip or Blood, it's about payback\nThat family love, so nigga now fuck your whole clique\nLike 24 Deep they tryin' to kill me for my fuckin' tapes\nThem baby rapes, so nigga get out my fuckin' face\nIf I was really bangin' niggas would know, 'cause I'd have they whole set\nLookin' like L.A. when the earthquake hit, nigga, fuckin' with my Tec\nI'm from the Garden Blocc, no matter what nobody say\nI'm makin' my money, not lettin' that bangin' shit get in my way\nNiggas get mad, they wanna see the Lynch rippin'\nI'm wearing blue, yeah, but motherfucker I ain't even trippin'\nBut for my cousin Q-Ball, Mr. Doc and Sicx\nMy cousin Eklypss and two of my kids, nigga, catch these clips\n\n[Chorus]\nI'm liquor sick and I just might lose control\nSo load your clips, locs, 'cause we ridin' for my folks\nI'm liquor sick and I just might lose control\nSo load your clips, locs, 'cause we ridin' for my folks\n\n[Outro]\nThere ain't no fuckin' way\nMy cousin's gonna lay up in a casket with no retaliation\nThere ain't no fuckin' way\nThat motherfucker died for the Blocc, so lets heat them motherfucking Glocks\nThere ain't no fuckin' way\nMy cousin's gonna lay up in a casket with no retaliation\nThere ain't no fuckin' way\nThat motherfucker died for the Blocc, so lets heat them motherfucking Glocks", "year": "1995-02-28", "album": "Season of Da Siccness"}], "artist": "Brotha Lynch Hung"}