{"artist": "Wale", "songs": [{"title": "DNA", "year": "2017-04-28", "lyrics": "[Chorus]\nCome and talk to me, I'm serious, yeah\nCome and talk to me, I'm curious, yeah\nMoney I can bring but I'm serious, yeah\nShawty, I can bring you somethin' different, look\nGood dick and advice, I'm 'bout it\nGood dick and advice, I got you\nIf you need it in your life, I got that\nI might put it in your life, you won't go back, go back\nCome and talk to me, I'm serious, yeah\nCome and talk to me, I'm curious, yeah\nMoney I can bring but I'm serious, yeah\nShawty, I can bring you somethin' different, look\nGood dick and advice, I'm 'bout it\nGood dick and advice, I got you\nIf you need it in your life, I got that\nI might put it in your life, you won't go back, go back\n\n[Verse]\nWhat would you do if I told you my need to know you\nWas as sweet as no one's?\nWhat if a brother was ill enough to kill your fears and lovin' in the convos he brung you was as deep as the condolences from a loved one, I wonder?\nWhat if I told you, I just wanna hold you, until\nI know you, And I'd rather know you before we go do what grown ups do, closed room\nPost honeymoon, would you\nRun away or run up to?\nIf I gave you the right of way, would you give it up right away like that last scribble with that number two?\nShoot, let's have a, sip from my affection and expound on this new found friendship as we share and reciprocate wisdom\nOnly difference with my particular curriculum is I'm here to lecture and listen, shawty, get it together\nSo you can take this as the takin' me, takin' my charm, or take me by the hand or rather arm, and hold me tighter than a hope, of this potential bond can be if you honestly ponderin', callin' on me\nSee right now, the only thing between us makin' universe smile, is what you want me to call you 10 hours after you give me them 10 numbers to dial, and if\nIt's any consolation, I feel some type of havin' some type of honour in havin' a conversion with a number 10 right now\nI see you later and see if you like it\nSee you later, see if you love it\nSee you later, you can see some effort\nI see you later, so, so much, you wanna see me forever\nThat's all the advice I got\n\n[Chorus]\nGood dick and advice, I'm 'bout it\nGood dick and advice, I got you\nIf you need it in your life, I got that\nI might put it in your life, you won't go back, go back\nCome and talk to me, I'm serious, yeah\nCome and talk to me, I'm curious, yeah\nMoney I can bring but I'm serious, yeah\nShawty, I can bring you somethin' different, look\nListen to me, good dick and advise, I got that\nGood dick and advice, I'm 'bout it", "album": "SHINE", "image": "https://images.genius.com/df9fa223157bf569597dc7509274af28.1000x1000x1.jpg"}]}