{"songs": [{"album": "Para Tu", "year": "2013-10-21", "title": "Pro - Verbs", "image": "https://images.genius.com/7eee6dd3e21895d3b7efbd8f0ac69d8b.566x566x1.jpg", "lyrics": "[Intro]\nBe you\nYou focus on one, you'll never be two\nAnd then number two, most niggas see through\nBut now that I think, that's probably number three too\nHuh, yeah\n\n[Verse 1]\nY'all want that real shit back, then please say so\nYou niggas got it Manti Teo'd\nOn the eighth show\nI'm walking 'round with the eighth tryna fuck Jhene Aiko\nHowever you say the name\nI cream that pussy like a bagel\nYou know how the play goes\nStunt a little then lay low\nNames, never say those\nYour girl in Giuseppes on Quavo\nDancing on top of tables\nI'm finna pick six like 22 with son Tadoe\nI hop in her whip, she bumping Gucci Mane and Zaytoven\nShe get in mines I'm bumping Beethoven\nIts to the crib ain't gotta say nothing\nI send her back to ya\nBlood drained, J.I.D. and yes the \"D\" for Dracula\nCrack her back play the sax, call Satchmo\nHe ain't gon' react\nJust relax bro, it ain't for a show\nI'm just waterin' my lawn 'cause I turn on the hose\n\n[Chorus]\nRule number one: be you\nYou focus on one, you'll never be two\nAnd then number two, most niggas see through\nBut now that I think, that's probably number three too\n\n[Verse 2]\nAnd then number four is like pour D'ousse D'ousse\nNow this the wrong book, I'm looking at the wrong rules\nCause then number five says \"purchase a coupe\"\nAll black no shoes, then T-top the roof\nAnd then get your windows and doors bulletproof\nSo the shots can't come in\nBut then we spray out the roof\nDog niggas like \"ROOF\" at your bitch like a wolf\nOr a pack of Spill-niggas, government my own troops\nGive me some of that Gil-Scott, bitch turn on the loops\nMotherfuck your drums, I'm finna spit it to the flutes\nTalk around my city, just point him out who got the juice\nCouldn't quote my shit, you'll probably break a fucking tooth\nYou're talking about Richter scale, I earthquake the fucking booth\nI shake it 'till its fucking loose, so fuck a rapper, fuck a cougar\nPut my dick like right into her\nFuck a mattress, fuck theatrics\nUnless your ass is an actor\nThen fools need to be captured\nI'm the master, I'm the massa'\nAnd they wanna assassinate me\nWhy they wanna hate me?\nI just need a cure for these rap bar rabies\nAnd a Beijing bitch to come massage then rape me\nXvid tape me\nTaste these kids then I'm on back to my day scheme\nYou living single like Regin and Queen La\nI'm prolly coaching your team, I'm J.I.D, JoePa\nMy D.C. girl tell me she love Sosa\nPut her hair in a pin, bang bang in O-Block\nShots rang, cops came, nigga no sir\nArrividerci and bonsoir\nYeah"}], "artist": "JID"}