{"songs": [{"lyrics": "[Hook x2:]\nSwag when I swag when I swag when I swag when I swag\nSwag when I swag when I swag\nSwag when I swag and I own all the swag, when I swag\nWhen I swag when I swag when I swag when I swag\n\n[Verse 1]\nI bet you ain't know that my money be real funny\n50s and 100s, I'm stunting\nNever goin back to them days\nPromised my mama a house on the beach, I'm finessing my ways\nNow all my jewelry on chill\nThese rappers be talking 'bout murder, ain't touching no field\nYo party is fraud\nSneakin' and geekin' I'm spinning my head is on mars\nYou know I'm outta they lead\nThis is not football but how am I still undefeated?\nWhy am I running the game? This is too far\nI'm driving these rappers insane\nShe wanna be Asian Doll, I get it, I get it\nNo drake, but I am a star!\nRoll me another one up\nI don't smoke them Dutches, smoke grams\nMy swishers stay stuffed\nPass me the mic I'm so reckless\nShoppin on budget but are you just flexing?\nYou bitches pathetic\nI'll teach you a lesson\nHad to get off of my ass, had to go chase me a bag!\nOnly 18 but my birthday December, will be a relief\nDon't wear Louis V\nCan't go out in public, I am not regular\nI am the one that be trending for nothing\nEnd of discussion, you talking and bluffin' it's whack\nGet lit with this tec or this mac, bitch!\nAnd no, I never lack\nWooden shots at your back (boom bitch!)\nI'm real, can't squeal, don't chill to much\nI beez with benji frank-alins\nWe eating lots of food and stuff\nMy pockets never empty nothing\n\n[Hook x2:]\nSwag when I swag when I swag when I swag when I swag\nSwag when I swag when I swag\nSwag when I swag and I own all the swag, when I swag\nWhen I swag when I swag when I swag when I swag\n\n[Verse 2]\nI pop me a flat and I'm rolling\nI am so high in the sky that I can't even control it\nYou is not Barbie Doll Gang, I made it, I'm living\nCan't hurt, no stress, no pain\nMy shooters are shooting to kill\nSo word is saying, you niggas pretend, you ain't real\nI have a veil\nI am a army of one\nI am the greatest, playing everyones part\nFrom Dallas to Houston I march\nPull up in a foreign, my ego on sharp\nThese bitches no bark\nI'm taking yo bands, not friendly but I have a heart\nThis choppa? It shoot with a spark\nAin't finishing school, I left it but I am still smart\nNot going to college I'm soning them knowledge\nMoney mutt, colleges only speak dollars, woah\nAnd these bitches wanna diss me, my swag on fleek, don't tweak bitch, woah!\nSally pay the nigga, where the bands at? Pussy game stay on outta control\nImma go and get the check, and I'mma flex\nBeen up next lil bitch\nCan't trust these niggas, can't friend these hoes\nThey'll tell it all to the next bitch\nPop out I swag\nCar gon' hit the dash, yo bitch gon' be in last\nAsian riding past, shawty waiting to blast\nI keep my head up, step yo bread up\nWatch yo back, that thot a set up!\nImma teach you how to flex\nSwag school, bitch I'm the best\nLets get it\n\n[Hook x2:]\nSwag when I swag when I swag when I swag when I swag\nSwag when I swag when I swag\nSwag when I swag and I own all the swag, when I swag\nWhen I swag when I swag when I swag when I swag", "album": "Da Rise of Barbie Doll Gang Empire", "year": null, "title": "Swag", "image": "https://images.genius.com/476438c7af2c75e12c800726181336b3.500x500x1.jpg"}], "artist": "Asian Da Brat"}