{"songs": [{"title": "Stubborn Ass", "lyrics": "[Intro]\nLike, what's wrong with you man?\nI don’t understand, like\nI say one thing, you got something to say after that\nI'm trying to talk to you, you don't want to talk\nLike, come on man\n\n[Verse 1]\nDoing shit for attention won’t get my attention\nInstead of hitting me up you do shit with intentions\nI thought we was grown\nLike, who are you kidding?\nI guess trying to make it work now is out of commission, huh?\nCompromise\nDon't make selfish decisions\nAdmit when you're wrong\nThe only way we can fix it\nBut you doing that is like Mission Impossible\nLike it's hard, like it's logical\nLike you going through obstacles\nTrust me it's easy, it's like eating a popsicle\nIt's like tying a shoe, easy as buying shoes\nYou get me? You get the point that I’m trying to prove?\n’Cause admitting you wrong is like pulling a tooth\nThat's still in the root that ain’t even loose\nOh, and you love to assume\nAnd instead of confronting me\nIt's this big elephant inside of the room\nNow you don't speak, now you a mute\nSo used to holding your feelings in\nNow your mind is immune\nYour heart is hurting\nYour body is confused\nYou rather be stubborn\nThan sit and confront it\nCome on, like we gotta improve\nThat's not even cool\nTalk, even when you not in the mood\nThis is love, gotta apply by the rules\nYou leaving now is like a 12th grader deciding to drop out of school\nThat’s like being dumb and a fool\nSweeping shit under the rug\nFuck that, I'm breaking the broom\n\n[Chorus]\nWith your stubborn ass\nSuch a stubborn ass\nYou lucky I fucking love your ass\nWith your stubborn ass\nSuch a stubborn ass\nCome here rub my head\nWhile I rub your ass\n\n[Verse 2]\nOne minute you love me, the next minute you hate me\nThis is Nascar love, you driving me crazy\nWe gotta take it slow, like we driving Ms Daisy\nIf I say that they roses you say that they daisies\nThis is not a competition\nI'm not your opposition\nYou say don't call you a bitch, but you bitching\nInstead of being defensive, just take a moment to listen\nAs soon as you can't take the heat\nYou walk your ass out the kitchen\nSpeaking of kitchen, I see a sink full of dishes I didn't wash\nAfter you cooked dinner, that pissed you off\nI should have took out the trash before I walked out the house\nYou right, I guess this the small shit you be talking about\nBut what about the make-up that's all over the bathroom\nAnd when I'm 'sleep that's when you decide you want to turn on the vacuum\nWhen I'm mad and I grab you, you say I'm trying to attack you\nLike you ain't just swing on me, bitch, I'm trying to relax you\nIt's never good when I'm mad and you mad too\nWe both act a fool like kids when the teacher not in the classroom\nNow we both in a bad mood and that never mixes well\nLike a stomach and bad food, girl we bad news, huh\n\n[Chorus]\nWith your stubborn ass\nSuch a stubborn ass\nYou lucky I fucking love your ass\nWith your stubborn ass\nSuch a stubborn ass\nCome here rub my head\nWhile I rub your ass\n\n[Outro]\nStubborn ass\nYou lucky I fucking love your ass\nCome here let me touch your ass\nStubborn ass", "album": "Herstory In The Making", "year": "2019-02-14", "image": "https://images.genius.com/abbdef6b9886a8d242aecd4d1783e4e3.750x750x1.jpg"}], "artist": "Young M.A"}