{"songs": [{"year": null, "album": "Lord of the Metaphor 2", "image": "https://images.genius.com/89aac007f78355bd982485c91bb0fdd8.1000x1000x1.jpg", "title": "He’s Back", "lyrics": "Yo Rock, cue me in..\nWe, got, that, funk\nMurray's, packed, with funk (you need to know)\nWe, got, the funk for yo' ass (let's go)\n\n[Keith Murray]\nYo, a lot of rappers holler tough stuff, they don't live it\nWhen you hear me emceein I'm speakin from experience\nKeynote speaker, Rock funk freaker\nThis lecture is conducted from the mic and through the speaker\nNow who gets weaker, not this dunn\nLook I'm never shook down even when, I was on the run\nI'm A REBEL! I love REBEL PEOPLE!\nYou're not equal, you damn creep you\nI, wake up in the morning with my game face ON\nAnd play hard all day - WORD IS BOND\nBy the way whatever happened to - WORD IS BOND?\nThe brother Ak lied to me during RAMADAN\nI'm takin no prisoners, takin no shorts\nStill drink Olde E, cans 40's and quarts\nWith creativity, and original thought\nAnd a twist of fate I twist your face, don't get caught\n\n[Hook: Keith Murray]\nYo, we got the ghetto funk, you need to know\nWhere the funk is at, funk dat bump that\nMurray's back with that\nFunk to make a person catch a heart attack (he's baaaack!)\nYo, we got the ghetto funk, you need to know\nWhere the funk is at, funk dat bump that\nMurray's back with that\nFunk to make a person catch a heart attack (you need to know)\n\n[Keith Murray]\nWe, got, funk, for, y'all, stank, ass, C'MON!\nYo - here's, what I'mma do for you\nChoke you out 'til your lips and your face turn blue\nOOPS! Now look what you done made me do\nI, did it again - and the joke's on you\nI'm more than official reputable undisputable\nLyrical phrasologist (you know how I do)\nNot one of you or any combination of you\nCan ever mess around (boy you know how I do)\nDialectical linguist, unlimited thinker\nDescriptive mental photographer\nL.O.D. and P.P.P. gets it on\nWe strong to cause bodily harm to King Kong\nStock lock and barrel, empty, reload whoa\nThis funk here, Glocks up, c'mon\nI'm not an R&B pop star rock'n'roller\nI'm a underground rapper with a chip on my shoulder\nYou mindless, spineless, jellyfish I eat MC's..\n.. which is my favorite dish\nI sailed the seven seas, pack 'em in like sardines\nAnd eat fruit right off the stress tree\nKeith kill beef like Mad Cow Disease\nSpazz on me? NEGRO!\nSome say I'm sarcastic, with a bad reputation\nBut ignore 'em, don't listen, they Mr. Murray hatin\n\n[Hook]\n\n[Keith Murray]\nThis is to my, negroids, spaniels and caucasoids\nEven chisel-faced, hardcore, rap b-boys\nWith my high wire, tightrope, trampoline STYLE\nTear your ass up, with service and a SMILE\nI'm the, local hero, global player\nMake your grandmother get up and do the Murray rainer\nGrab you goin to a death row, like an alligator\nGood God, my Squad got too much flavor\nRainbow style like a pack of Now or Laters\nThis funk shit gon' shake the equator\nMy, Squad, stay true to the game\nWe the trillest mother-effers this side of the grave\n\n[Hook] - {*repeat to fade*}"}], "artist": "Keith Murray"}