{"artist": "Phora", "songs": [{"album": "Angels With Broken Wings", "title": "God’s Plan", "image": "https://images.genius.com/c6d78da02b33b6464f3dc0ec14848a24.1000x1000x1.jpg", "lyrics": "[Intro]\nGod gives the toughest battles to the strongest of his people\nJust make sure you good with karma when it meets you\nIt's evil, it'll haunt you, it'll eat you\nIt'll take away your peace of mind and blind you and deceive you\nNever let 'em get to your soul\nCause we all got a place in this world\nWe just might not know where to go\nSee, I'm here for a reason\nAnd I'm right where I'm supposed to be\nAnd all I know is that God is watching over me\n\n[Verse 1]\nLook, this life's a blessing for real\nJesus on my necklace, man the pressure is real\nAmbulance and gunshots, ghetto bird on my block\nCan't even trust the cops, they don't protect, they just kill\nSo pops told me, pack a weapon, for real\nCause the world is cold and they'll never respect how you feel\nI know exactly what he meant when he said jealously kills\nAs I try to take a breath, but I feel like I'm choking on my own blood\nSick of these streets cause they show us no love\nI'd have seen cats bag up drugs and slang to their own son\nThis shit ain't no fun\nThey're carrying heaters cause they got cold blood\nThey'll never see me weak and I won't run\nGot to watch my back every motherfucking day\nAt the same time, never look back and look for a way to make it out these streets\nYeah, some people never make it out these streets\n\n[Verse 2]\nAnd they shooting at me, felt like a nightmare\nNever understood why these cowards just couldn't fight fair\nAlways need a weapon, but this life is such a blessing\nThey pull the trigger, my guardian angel was sitting right there\nYou don't believe in God? Explain this\nThey killed my ass twice and I still lived and all it did was make me famous\nAnd appreciate life in ways I couldn't explain\nBullet in my head a few inches away from my brain\nHomie, I'm blessed to be alive and still breathing\nBut what's it going to take to show these people that I'm here for a reason?\nI said I'm blessed to be alive and still breathing\nBut what's it going to take to show these people that I'm here for a reason?\n\n[Verse 3]\nOne o'clock in the morning, heading back home\nDriving down the freeway, just me and my girl\nTalking 'bout our future, talking 'bout life\nTalking 'bout these places that we trying to be in this world\nAs I look to my left, I seen a car approaching from a distance\nAnd all I heard was, pop-pop-pop, What?\nI'm tripping? Could this be a hit-man? They letting shots off\nWent ninety off the freeway and dipped as soon as it popped off\nBullets burning in the back of my neck\nBlood leaking down my back\nWindows shattered as I'm gasping for breath\nBullets scorching as it ran through my flesh\nHeart pumping, blood rushing\nFelt the adrenaline pass through my chest\nThinking if I die tonight, they'll probably laugh at my death\nBut God has my back and that's why I'm blessed\nI asked my girl if she was hit, but she was panicking\nI checked her body, she was fine\nBut she seen I got shot and called the ambulance\n\n[Verse 4]\nYeah, in the back of the ambulance\nI just thought, \"Are they following me?\"\nDid someone set me up? Is somebody plotting on me?\nThey trying to kill me, they really tried to kill me again\nDon't wanna die without saying, \"Bye\" to my mama, my friends\nOnly twenty years old living in this world, so cold\nHoping my family don't have to see me go\nI'm in the hospital fighting to survive\nFighting to stay alive\nDoctors keep telling me not to close my eyes\nThey saying, \"Stay with me. Deep breaths. Just breathe.\"\nIn and out, out and in, veins filled with IVs\nI closed my eyes, thought of the skies and the trees\nAsked God to bless me just one more time\nAlmost dropped to my knees\nNow I'm back up on my feet, I should've died that night\nThree shots from a .45 went through my ride that night\nHit me two inches from my spine, I could've been paralyzed\nGuess you can say that destiny was by my side that night\nI should've died that night\nThree shots from a .45 went through my ride that night\nHit me two inches from my spine, I could've been paralyzed\nGuess you can say that Destiny was by my side that night\n\n[Verse 5]\nCause everybody wanna ride or die chick\nBut she the true meaning of ride or die when them bullets went right through my whip\nCause she was by my side the night I got hit\nAnd still riding with me till the day I die\nSee, that's a wife, not a bitch\nJust wanna see her happy, I'd give my life for that shit\nI'd take a .45, a 9, even a knife for that shit\nI know I wasn't perfect, we had our fights\nBut I'mma make things right cause we only got one life and that's it\nBut never let these cats take your peace of mind or your smile from you\nNo matter how hard they try, no matter what they try to do\nI'll always be right there to the side of you\nWe got the choice to be happy or not\nThe only one that can decide is you\nBut sometimes I'm mad at myself\nSometimes I ask these people questions I can answer myself\nSometimes I wish I could show these cats how I felt\nBut I know karma's a motherfucking bitch and its gon' handle itself\nThree people in my car that night\nMe, Destiny, and God\nLike, why the Lord keep letting me survive?\nI'm so blessed that I'm alive\nBut truth is they could've put that bullet through my head\nBut dawg, legends never die\nI said legends never die, I just want to be remembered\nThey can kill me, but that'll only mean I'll live forever\nI said legends never die, I just want to be remembered\nThey can kill me, but that'll only mean I'll live forever\nMotherfucker", "year": "2015-10-11"}]}