{"artist": "Cage", "songs": [{"title": "A Crowd Killer", "album": "Movies For The Blind", "year": null, "image": "https://images.genius.com/a543bef5a47f37a8aeba1d69065b95ac.500x500x1.jpg", "lyrics": "[Cage]\nI'm an anarchist, no wait, I'm an Antichrist\nCouldn't find a third six of my scalp so I used a knife\nScratched it in, I'm wasted, getting trashed again\nAn active ten, laughing and slashing friends\nSelling dust to kids is how I used to spend the day\nCause I was only trying to live like Tim McVeigh\nI respect woman's lib by letting them get their mace off\nMy dogs are hungry so I flick 'em with cutting your face off\nFollow my lead, smoke weed and bleed sloppy\nIf you see me selling out in the store one more copy\nJump in the crowd and start swinging the cordless\nThen dismember all you high-tech spy kids with a swordfish\n\n[Hook: Cage]\nSee these cats in the streets off TV, they all bitch!\nFans with a mic wanna battle, they all shit!\nSo I push cop killers in things they call clips!\nThen let off one in the crowds, they all hits!\n\n[Cage]\nMy career's low on gas, I'm stabbin the rapper in sight\nA suicidal failure like Shady's ex-wife\nOne day got too pissed and sliced open two wrists\nI punch lines 'til there's coke all over my two fists\nLook off over crowd, connect nicotine buzz\nThen find your bitch dug out like the headrest where them screens was\nFuck your six, I got sixteen waiting\nAnymore patient than when they switched me to out-patient\nLeft the hospital and dissed my whole crew\nEven pop knew the deal and walked out when I was two\nGet slammed in the dirt, murked and earth plate shaked\nYou ain't stirrin' hurricanes, you breath on birthday cake\nSee some more fags, we'll choke them herbs\nAnd beat promoters down and be booked on spoken word\nIf I'm too sick, I'm sorry, I'm trying to get my head right\nWrapped up in this cult that I started on my website\n\n[Hook: Cage]\nSee these cats in the streets off TV, they all bitch!\nFans with a mic wanna battle, they all shit!\nSo I push cop killers and things, they call quits!\nThen let off one in the crowds, they all hits!\n\n[Cage]\nI snap a copy of Blade on DVD in half\nSlice your neck and hand you a pamphlet on AIDS\nSmut Peddlers, break up is apparent\nWhen I put shit together like Malcolm McLaren\nSo Keep staring, I keep feeding your brain flaws\nI'm Porn Again like the scam that got me in chain stores\nCage, number nine on Billboard, fuck\nNow I gotta sick Kubrick on Lil' Bow Wow's nuts\nLong range shots to where you and your mans is\nMissed and hit some skinny ugly white bitch in Kansas\nScratch her eyes out right where the evil itched her\nNeed a Haldol elixir or head from Beetle's sister\n\n[Hook: Cage]\nSee these cats in the streets off TV, they all bitch!\nFans with a mic wanna battle, they all shit!\nSo I push cop killers and things, they call quits!\nThen let off one in the crowds, they all hits!\nSee these cats in the streets off TV, they all bitch!\nFans with a mic wanna battle, they all shit!\nSo I push cop killers and things, they call quits!\nThen let off one in the crowds, they all hits!\n\n[Cage]\nSee these cats in the streets off TV, they all bitch!\nThey all bitch! They all bitch!\nFans with a mic wanna battle, they SHIT!\n(*Overlapping Cage lines*)"}]}