{"songs": [{"title": "Funkmaster Flex Freestyle 8/13/13", "album": null, "year": null, "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "[Verse]\nMan, they be talking to me like:\n\"Hurry up nigga, swear you taking too long\nSpring break already passed, you been breaking too long\n20 year restaurant shit, we waiting too long!\nHall of Fame on the way? On the way too long!\"\nI know, I been, saying the, same to myself\nI treat the studio like I'm laying in the cell\nTrying to raise the bar, staying to myself\nIs it an oxymoron; niggas praying on my hell?\nThat don't make sense\nI never hear these words again: \"late rent\"\nTime is money, nigga tell me how your day spent?\nMine is doing business with people who got paid\nAnd been paid since, \"Sean changed since\nHe broke his high school girlfriend's heart\nYou know how niggas are\"\nReally? Shit, really?\nThat's hurtful seeing from your friends and fam\nAnd the internet, even Necole Bitchie?\nHow many of you made it with your high school romance?\nI made a visit to the school, role modeled to the youth\nAnd had the teachers and the students hold hands\nBut they rather show a strip club pic: pole dance\nYeah, I guess\nFuck it I'm not a good person just to get the press\nLike how he used to smoke and drink just for the stress\nBeing blessed, made a Lex on some Detox shit\nLately I'm reading books on some Deepak shit\nStill rocking more Adidas, less Reebok, bitch!\nWe want songs like \"Memories\", \"Desire, Want & Need\"\nMotherfucka you can keep \"Guap\", bitch!\nTake it back to the old Sean, before you had a Rollie\nMan when you was wearing that G-Shock shit!\nSaying\n\"I'm gonna make a million... Just wait till tomorrow\"\nWent from sleeping on floors, to making them marble\nAnd to make it out my hood, is harder than leaving Argo\nYou got all the drive in the world, but your car broke\nYou up so late, the motherfuckin bar closed\nBut you need a drink \"why you work so hard bro?\"\nIts for moments like this!\nMoments for interview sentences is\nHow close you, Royce, and Em is?\nHow big is your mom new crib, and\nStupid shit like, is G.O.O.D. still your imprint?\nBut this for the ones that already know\nWho been working all month just to save up for the show\nWho paid the babysitter extra so they can go\nWho paid a little more, to get early front row\nLike \"I'm your biggest fan, I can't believe I met you\nCan we pose for Instagram?\nI'm the one who knew every word, then \"swerve\"!\nDrove eight hours here, I swear to God\nThis well desereved\", Man, this one for you"}], "artist": "Big Sean"}