{"artist": "Half A Mill", "songs": [{"album": "Da Hustle Don’t Stop", "lyrics": "[Intro: Sluggy Ranks]\nThe arrangers of sinisters\nI wanna give from John, symbolize the life\n(Half-A-Mill, Sluggy Ranks, ya know)\n\n[Chorus: Sluggy Ranks]\nAnd this is Sodom and Gomorrah\nYour not sure deceive to murder\nAnd this is Sodom and Gomorrah\nRappers are not sure deceive to murder\n\n[Half-A-Mill]\nWe don't cry for them players in 'em Bentley Coupes\nWe don't cry for them ballers gettin big willy loot\nWe don't cry for them hustlers in 'em Gucci suits\nBut we cry man we cry for the youths cuz they innocent\nThe Government is killin shit\nWhile niggas in the hood is dealin bricks, big shit\nWe sell Coke, they sell Countries\nWe cop ice niggas workin Diamond mines for the rest of they life\nNeva to see they seed or their wife\nJacob neva threw a block party in my hood\nThis is our live, Mercedes Benz ain't neva did for us\nExcept help victims micro-chip so they can put 'em in us\nThe hood is in lust, big brother got footage of us\nExecutive orders, 6-6-6 put 'em in cuffs\nPut 'em on the bus, Concentration Camps waitin for us\nMoney and material they soon to take it from us\nTake it from us!\n\n[Chorus: Sluggy Ranks]\n\n**Half-A-Mill in the background**\nWord, yo they lockin us up everyday son\nThey treatin us down like 30 stores\nNuttin, puttin us on highways for nuttin\nKnawmean?, its aiight though, its aiight though\nYou know why, word! yo\n\n[Half-A-Mill]\nNow in days they arrest preachers\nCan't see you in school (why?) they might get molested by teachers\nDon't run through red lights the cops might beat ya\n20 of 'em, they lock you up they might not feed ya\nIn this new world they might not need ya\nThey got nuetra-noise robots to replace man computer to leech ya\nHigh tech features, they plan to spread us wit heaters\nAnd effect us all wit the most dangerous disease's\nChicken heads soon to be sickened dead\nThugs carry four-fifth wit inferred to send us to Imhotep\nBut now we the lost race\nEveryday is another court case\nEither you sell or torch base\nWe livin in hell, its written all over your face\nIn the eyes of the most high we all disgrace\nFrom the cradle to the corner, greed, lust, envy and hate\nGot us all in this negro state...\n\n[Chorus: Sluggy Ranks] **repeat 2X**\n\n**Half-A-Mill in the background**\nYea, uh huh, concentration camps they say\nAll these fake politicians actin like they our leaders\nWe know what time it is, we know y'all against us\nYea, this goes out to the streets son, soon to take over yo\nSoon to take over son\n\n[Sluggy Ranks]\nFor the youths dem live so strange\nSlingin their guns just like John Wayne\nAnd everyday another rapper gets slain\nSmokin Cruk and smokin Cocaine\nAnother brother live spends in takin boys\n\n[Half-A-Mill]\nBreezin in the Range, got G's in the Range\nFreezin wit bling, I was raised in the street to be King\nFired that heater thing, project Messiah speakin the slang\nIn these streets niggas bang and put holes in your brains\nYa'll know Half-A-Mill Sluggy Ranks, Capro via Metro\nWe know parsh, whips like the car show, but God know\nWe livin in time thats hard yo\nWicked men leave the blind straight Sodom And Gomorrah\nBestialities, sexual acts of Guam show\nThe Devil or God, which one do you follow?\n\n[Chorus: Sluggy Ranks] **repeat 3X**\n\nThe youths are still dyin, my sisters are still cryin\nMy children are cryin, and I still feel the pain...\n\n[Outro: Half-A-Mill]\nYea, word, knawmean?, knawmean?\nYea, you not sure, you not sure\n\nIts a small chance, real range\nWhat! your not sure, your not sure\nWord! you know y'all tryin to take us down\nYou know y'all tryin to make it hard for us\nKnawmean?, ya feelin it, uh this goes out to the hood\nUh, 'member, 'member where you at?, 'member how we got here?\n'member who runs this country? (Crown Heights) yamean?\n(Queens) 6000 year rule", "year": null, "image": "https://images.genius.com/cdace55ea46853fe392a282bca193979.600x600x1.jpg", "title": "Sodom and Gomorrah"}]}