{"artist": "G-Dep", "songs": [{"title": "Blast Off", "album": "Child of the Ghetto", "year": "2001-07-10", "image": "https://images.genius.com/bddcce4afa23dd703cfaf4bd2ea9dfe7.300x300x1.jpg", "lyrics": "* originally appeared on P. Diddy's \"The Saga Continues...\"\n\n[G. Dep]\nYeah...\nYeah, me and my man's and them\nWe gon' blast off\nBad Boy nigga, and we don't stop\nCome on to the top, blast off\nYeah, yo\n\nAiyyo, I take it up top for my peeps\nCracks in they Jeeps, don't sleep till they 6 feet deep\nNo 'lax' in my tracks they potent\nFuck homicide, I'mma ride, keep smokin'\nI keep smokin' till the bullshit filter\nLike cigarettes, Dep came through, killed ya\nWhen I swerve hit nerves\nNumber 1 contenders, I put 'em on injured reserve\nAnd everybody know what's golden, matter of fact platinum\n?mores trap to mold in?\nOnce I explode and I, burn up the road and\nCruise around the globe, the cops thinkin' it's stolen\nUnderstand, the world's in my hand\nG. Dep in this scam, no stunt\nBitch play the front\nAnd I'mma show you how to lay back do a buck while you puff on a sac\nCause yo, I'm about to blast off -\n\nStraight to the chase, cause everybody know what's the case\nAiyyo, I'mma about to blast off\nStraight to the point, aiyyo, yo, light another joint\nNigga, I'mma blast off\nRight to the top, aiyyo, no, I ain't gon stop yo\nNigga, I'mma blast off\nStraight to the dome, you entered in the Bad Boy zone\n\n[Mark Curry]\nYo, yo, uh\nWho's a nigga harder than me?\nOn the boats, make it known how the slaughterin' be\nDamn, Curry ain't the shit? Put the name in your mouth\nGot it different? You ain't on what you talkin' about\nBustin' off in her mouth, catch me\nI'm feelin' for whoever test me, pity for whoever second guess me\nKnow how to ?manhand'? it's real as it get\nFeelin' my shit, straight through the cealin' with this\nBet your block love it, find me only with the grimy\nGutters of the street where my mind be\nPlay the game, get you a 'zil'\nForever, put you until, it fit me to kill\nHeat, got it with me still\nFlip the game over, see me, we be, untouched\nOut like your motherfuckin' guns bust, BLAOW\nSure shot, hit again, spit it grim, anytime, anyplace\nBitch, I'm about to-\n\n[G. Dep]\nBlast off, yo I get it poppin'\nWhen I rock, yo it's non-stoppin'\nYo, I'm about to blast off\nSee me at the show, when I rock everybody know\nAiyyo, I'm about to blast off\nBottles gon' pop, cause when I rock, everybody rock\nAiyyo, I'm about to blast off\nStraight to the top, cause everybody know this is hot\n\n[Loon]\nAiyyo son, I'm about to blast off, like an astronaut\nNiggas don't wanna see a nigga blast the Glock\nNiggas don't wanna see a nigga flash the rocks\nAnd pop up in the flashy drop - motherfuckers\nNiggas know me, Loon's a gunslinger\nFuck fightin' a nigga, I'm usin' one finger\nCatch one of you rap cats in the 'Humdinger'\nSome niggas get shot, live and become singers\nExpect to die, I'd rather sit in a chair, electrified\nThan to stand here and testify\nBut, other than that though, we never get caught\nWe George Jefferson walk out of federal court\nWe gettin' bread in New York, ain't better the sport\nSo whatever you thought, you can use whatever support\nBut, I think it's best you go 'head and just walk\nOr have the cops find traces of lead in your corpse\nYo, I'm about to-\n\n[G. Dep]\nBlast off-\nStraight to the chase, cause everybody know what's the case\nAiyyo, I'mma about to blast off\nStraight to the point, aiyyo, yo, light another joint\nNigga, I'mma blast off\nRight to the top, aiyyo, no, I ain't gon stop yo\nNigga, I'mma blast off\nStraight to the dome, you entered in the Bad Boy zone"}]}