{"songs": [{"album": "DiCaprio 2", "year": "2018-11-26", "title": "Off da Zoinkys", "image": "https://images.genius.com/a24486c6e4c335d50ce79fdcf7bef5ac.1000x1000x1.jpg", "lyrics": "[Intro]\nI, I am so grateful\nI'm very, very, very grateful\nYeah yeah yeah\nYeah yeah yeah\nUh\nAlright, J.I.D and (Christo)\n\n[Verse]\nY'all niggas need to lay off the drugs\nSome of y'all need to lay off the dope\nMy niggas gettin' it straight off the boat\nPure cut, put it straight to your nose\nI ain't nosy, but I know what I know\nMr. Know-It-All, \"oh here he go\"\nI'm the GOAT, I never go with the flow\nThrowin' shots, boy, it's blow for a blow\nI'm the nigga kick the do' with the do'\nI'm the nigga fuck the ho with the ho\nI'm the nigga lit the blunt with the blunt\nI'ma get it 'cause I want what I want\nI'ma say this shit again and again\nI'ma go and put this shit to an end\nI'm the sickest with the pencil and pen\nHit the blunt and mix the Hen' with the wait\nI'ma go ahead and lay off the Xans\nI'ma fall back sippin' the lean\nI gotta make sure my vision is clear\nOh God, no, it's not what it seems\nSix, five, four, one, two, three\n.45 tote, you know me\nYou don't want smoke, so what it's gon' be?\nGotta watch what you say when you lookin' at me\nLookin' at God, lookin' for leaders, lookin' for keys\nLook at the pain in your eyes, nigga, look where we been\nLook at our wins, look at our sins, and look at our skin\nI've been on a frenzy binge tryna get me a Benz\nAnd then your fuzzy ass lens wanna fuck up the ends\nOh God, no, where are my friends?\nLord forgive me, yeah, I need to repent\nMind blurred, need to lay off the drugs\nYeah God, they ain't prayin' enough\nNiggas dyin', we ain't sayin' enough\nCops fire, stockpiling rottweiler\nTell my little niggas lay off the stuff\nRonald Reagan, I can't thank him enough\nNah, I'm playin', nigga racist as fuck\nTold my nigga if he leave a pack of ports around me, I'ma take em'\nAnd throw em' away\nHe smoke em' around me, I'ma break em'\nAnd we almost had got into fightin'\nI'm talkin' 'bout dead that, finna fade it\nBut shit, but maybe I did too much\nBut fuck it, I love my nigga, I'ma save him\nAnd he prolly thinkin' I'm a player-hater\nI don't hate a player, I just need all my niggas to wake up\nAnd take a real good look, we a long way from Decatur\nLong days still ahead of us, grown dads still scared of us\nI'm just workin' my incredible\nStick my dick in the inevitable\nSo fuck whatever happen, fuckin' cinematic\nSins of the father, I'm a fuckin' addict\nUnderstand addiction, so I'm sympathetic\nBut I know, I know, I know that I gotta be strong\nI ain't tryna be where I don't belong\nLittle syrup sippin' out of a foam\nLittle powder, put the pot in the bong\nI ain't trippin', I ain't sayin' it's wrong\nBut, it's some other shit we can be on\n\n[Bridge]\nGangsta Gri-zillz\nOh, now that I may be free, yeah\nAnd he, he...\n\n[Outro]\n...if you need it\nYeah\n'Cause we the old people, you know\nThat's way you get blessed\nYeah\nThat's comes to you, people don't know\nBless, you can see it\nGod, He come, He come, He come\nHe come depending what... what you do to people\nUh-huh\nThat's where bless come from, you know what I mean?\nYeah\nYou see, you can see that\nLook at that, look at how fast President Reagan dead\nYou don't know him right?\nYeah, I did\nRight okay, He was a criminal, you know what I mean?\nBut look at... at Jimmy Carter\nUh, uh\nJimmy Carter all... more older than Reagan\nUh, uh\nReagan gone already, Carter still here\nThe good person?\nYou know what I mean, 'cause he got a open heart\nHe never do war, when he was President\nHe never hurt nobody, he help people"}], "artist": "JID"}