{"songs": [{"title": "Right 1", "album": "Mooktoven Season 4", "year": "2019-01-27", "image": "https://images.genius.com/715056157bf2ef105d3420339404276a.1000x1000x1.jpg", "lyrics": "[Intro: Lil Keed]\nAyy, where you get that beat from? Mooktoven\nYeah, you know what I'm sayin'\nYSL, let's go\n\n[Chorus: Lil Keed]\nI put the shoes on with the jewels on, finna have a long day\nShe kept her thong on, took her clothes off, gave a nigga nothin' but face\nI got a big bankroll on me, and it's nothin' but blue faces\nHeard a nigga switched on his homie, ain't know he two-faced\nKeed talk to 'em, na na na na na na na\nWhat goin' on? Na na na na na na na\nWhat y'all niggas want? Na na na na na na na\nI bring this shit home, na na na na na na na\n\n[Verse 1: Lil Keed]\nI bring it home, I bring it home\nI put that bag down, the right one 'cause I'm a real one\nI make y'all niggas food, Tyson chicken\nStack it up to the ceiling, bring the ice, yeah, quickly\nYeah, I want you, I can't choose\nWith my gang, doin' that, that do\nYeah, I'm with King Slime, that Maybach, talkin' 'bout choppin' the roof\nI'm with Duke in that Maybach, yeah, we smokin' fruits\nYeah, these niggas lyin' 'bout their background, nigga, I know the truth\nDifferent diamonds, all colours, look like Fruit Loops\nYeah, I broke her spine on the court, had to free the roofs\nYeah, got designer of course, bitch, you know what do\n\n[Chorus: Lil Keed]\nI put the shoes on with the jewels on, finna have a long day\nShe kept her thong on, took her clothes off, gave a nigga nothin' but face\nI got a big bankroll on me, and it's nothin' but blue faces\nHeard a nigga switched on his homie, ain't know he two-faced\nKeed talk to 'em, na na na na na na na\nWhat goin' on? Na na na na na na na\nWhat y'all niggas want? Na na na na na na na\nI bring this shit home, na na na na na na na\n\n[Break: Young Nudy]\nAnyways, real rich, yeah, real rich, bitch\nAnyways, they be thumbin' through this shit\nI be countin' this shit, I be havin' this shit\nYeah, yeah, I pop that shit, nigga\nWhat's happenin', bitch?\n\n[Verse 2: Young Nudy]\nI'm a motherfuckin' rich nigga, get fly, yeah, Zone 6 nigga\nLick, nigga, yeah, I hit licks, tote a stick, nigga\nBrick, nigga, ran off with that brick, that's my shit, nigga\nFacts, nigga, y'all niggas snitchin' on y'all rap nigga\nPaperwork, you and paperwork, how that work?\nI can't fuck with jerks, get a nigga put in the dirt\nDoin' that paperwork, you know how that work\nI got shooters, they gon' do you the worst, yeah, 4L, slime, yeah\n\n[Chorus: Lil Keed]\nI put the shoes on with the jewels on, finna have a long day\nShe kept her thong on, took her clothes off, gave a nigga nothin' but face\nI got a big bankroll on me, and it's nothin' but blue faces\nHeard a nigga switched on his homie, ain't know he two-faced\nKeed talk to 'em, na na na na na na na\nWhat goin' on? Na na na na na na na\nWhat y'all niggas want? Na na na na na na na\nI bring this shit home, na na na na na na na"}], "artist": "Lil Keed"}