{"artist": "King T", "songs": [{"image": "https://images.genius.com/641a3479424d2748b1235e965b5adbcc.320x320x1.jpg", "title": "Da’Kron", "year": null, "album": "Thy Kingdom Come", "lyrics": "[Verse 1: King Tee]\nWhile these other cats are flashing their guns\nI got my barrel down your throat, you're coming up shook\nI brought that gang bang boogie, you must've mistook me\nFor a coward, I'll wet you with the tech nine shower\nAnd man I gives a damn who the fuck you down with\nWho part of town and shit, you get your crown split\nFucking with the Likwit expansion assassins\nHeard about them fo' older anthems, now speak on that\nThese fools got that home grown rap\nI got da kron, talking bout the bomb, say what?\nI got the hood rats shaking they tails to excel\nCause Aftermath laced me with the shit that won't fail\nI used to rock the module sitting in the county jail\nNow I'm fresh out balling on bail\nThese fools better check the credits, I'm hanging platinum on the walls\nWhile your baby mama playing with my balls, yes y'all\n\n[Chorus]\nI got the Da'Kron, talking 'bout the bomb\nSay what? I got the hood rats shaking they tails to excel\nI got the Da'Kron, talking 'bout the bomb\nSay what? 'Cause Dr. Dre laced me with that shit that won't fail\nI got the Da'Kron, talking 'bout the bomb\nSay what? I got the hood rats shaking they tails to excel\nI got the Da'Kron, talking 'bout the bomb\nSay what? 'Cause Dr. Dre laced me with that shit that won't fail\n\n[King Tee]\nSomebody let me out this cage, I feel like I'm about to burst\nSnatching props and reps just like it was your mom's purse\nFirst thing's first, I'm the King {where you from?}\nThe streets of Compton {what?}, a nigga stay down {right?}\nSay what? I represent the khaki wearing, weed smoking\nGun toting, never broke niggas from L.A. to Oakland\nTalking that shit will get you nowhere, cause I hear no, or fear no\nRoll up and you be the last action hero\nI'm from the land of the calm breeze, palm trees\nLow riders rolling on roadies\nDrop tops, crooked cops, carjacks\nAnd earthquakes, chronic bud, yeah nigga all that\nThe place where Gs be hitting switches\nAnd I'm down with a gang of niggas but I got a gang of bitches\nKids from birth born and bred to be hustlers\nSipping on the {?} to say I got it going on\nAftermath, I represent it to the fullest\nSpitting at hoes like my tech nine be spitting bullets\nPassed ya, I blast at ya, faster\nSomebody gassed ya now you lay before your pastor\nThese other clicks know they ain't fading us\nCause even Treach said my niggas was the craziest\nRemember before I told ya bring a gun\nCause it ain't where you're at, it's where you're from fool\n\n[Chorus]\nI got the Da'Kron, talking 'bout the bomb\nSay what? I got the hood rats shaking they tails to excel\nI got the Da'Kron, talking 'bout the bomb\nSay what? 'Cause Dr. Dre laced me with that shit that won't fail\nI got the Da'Kron, talking 'bout the bomb\nSay what? I got the hood rats shaking they tails to excel\nI got the Da'Kron, talking 'bout the bomb\nSay what? 'Cause Dr. Dre laced me with that shit that won't fail\n\n[Verse 2: King Tee]\nY'all niggas don't know me, low key Riviera\nComing through your hood with the terror\nI got it rocked up, I got it locked up, locked up\nFools in they trunk chopped up, nigga like \"what?\"\nPosing, cause I know these niggas scoping\nThe Rolex full of ice frozen\nI think around eighteen karat golden\nCan't match what I'm holding, pockets stay swollen\nCasinos in Reno to blow dough in\nNiggas stay out our pimp business cause you hoes ain't knowing\nAbout the years that I paid dues, hoes that I ran through\nNiggas asking going platinum, I plan to\nSo kick back and let the King pull rank\nNo need to gas me up, I'm already on a full tank\nSo roll it up, light the bitch and inhale\nCause Dr. Dre laced me with that shit that won't fail\n\n[Chorus]\nI got the Da'Kron, talking 'bout the bomb\nSay what? I got the hood rats shaking they tails to excel\nI got the Da'Kron, talking 'bout the bomb\nSay what? 'Cause Dr. Dre laced me with that shit that won't fail\nI got the Da'Kron, talking 'bout the bomb\nSay what? I got the hood rats shaking they tails to excel\nI got the Da'Kron, talking 'bout the bomb\nSay what? 'Cause Dr. Dre laced me with that shit that won't fail\nI got the Da'Kron, talking 'bout the bomb\nSay what? I got the hood rats shaking they tails to excel\nI got the Da'Kron, talking 'bout the bomb\nSay what? 'Cause Dr. Dre laced me with that shit that won't fail\nI got the Da'Kron, talking 'bout the bomb\nSay what? I got the hood rats shaking they tails to excel\nI got the Da'Kron, talking 'bout the bomb\nSay what? 'Cause Dr. Dre laced me with that shit that won't fail\n\n[Outro: King Tee]\nYeah, for my niggas on the west side\nRoll it up"}]}