{"artist": "Inspectah Deck", "songs": [{"title": "Friction", "lyrics": "[Intro: Inspectah Deck]\nIs you ready?\nBack by popular demand...\nMurderous specialist tactics\nWu-Tang Clan, no rehearsal or practice\nNiggas ain't ready for this...\nNiggas ain't ready for this...\nNiggas ain't ready for this...\n\n[Verse 1: Inspectah Deck]\nChrome dips beaming off July sun rays\nCaesar fade, blending with the side burn shades\nCotton club status, clientele, SL, heavy jewel\nNiggas jail, young niggas screw well\nSwinging like Smokey on the slow beat\nJohnny walker hold me, closely as I mosey on the low key\nIf you don't know by now, you'll never know me\nYou know me, I swing it to the young-ins and the OG's\nWitnessed by notary public, certified rough shit\nDoes it feel good, how was it? Gritty like the subway tracks\nMy protocol permanent like graffiti on the project walls\nOn the AWOL, alias Jamal Duval\nRoam through the universe, plans of owning it all\nIn the meantime, in between time, we shine\nDangerous minds travel on this uphill climb\n\n[Hook: Inspectah Deck]\nIf you want some, get some\nThis is it, son, this one\nMake 'em feel the friction\nGuaranteed hit, son, miss none\nFlip one, you better bring your big gun\n\n[Verse 2: Masta Killa]\nSome niggas I'd rather not spar minds with\nThey can't stimulate my thoughts or fuck with\nCreative testosterone, mic-phone\nCalms the menopausable hormone quakage\nTrapped like estrogen, we making\nAll of the above, supremely I hold my shit, when I run\nI hesitate to stomp the come\nBring water from the brain, nigga\nThey tried to send me back, but still I came\nTerraform mind frame contains\nElements of iron which began steel, healing men life\nAllah Just brought me forth to bust mine\nThis time I spare no one\nPoison sword seed technique, breathe the Earth\nTake the head of those and feed 'em to the universe\nBlessed with volts of electric, life threatning segments, it's hectic\n\n[Hook: Inspectah Deck]\nIf you want some, get some\nThis is it, son, this one\nMake 'em feel the friction\nGuaranteed hit, son, miss none\nFlip one, you better bring your big gun\n\n[Verse 3: Inspectah Deck]\nPoetry in motion, east to west coasting\nOverseas blowing with lines tightly woven\nStill going full speed, pulling g's\nTrying to eat 'til my mouth gets too full to feed\nI excel, cast spells similar to Merlin\nMic surgeon, hang like Dr. J. Erving\nSplurge inner city like uncensored version\nMerging with the fast lane, stained with the urban\nWord in the street, his work was dirt cheap\nSynthetically weak, make the fans start beef\nAny comeback attempts would only be in repeats\nThey soon fall off, be mentally lost beyond reach\nMy technique's heat leaves a permanent crease\nPlant my 2 feet, shooting with the quick release\nNever cease fire from a Street called Desire\nThe sire, disturbing the peace with c-ciphers\n\n[Verse 4: Masta Killa]\nWho dare comes amongst and tries to peep it\nThe secret of the deadly art, then leak it\nSnakes, leeches surround the righteous\nI lick a diversion shot\nThen slip with the swiftness to weave a raindrop\nLeaving the eye confused understanding blurred\nCloudy electrical storms occur\nFrom the Masta, classical head bang slang\nThe deaf tone rises like the blind and dumb\nLicking shots at the microphone, Iron Lung\nWe the first to set off shit, last to run\nWho want some, come and get some, motherfucker!\n\n[Hook: Inspectah Deck]\nIf you want some, get some\nThis is it, son, this one\nMake 'em feel the friction\nGuaranteed hit, son, miss none\nFlip one, you better bring your big gun", "image": "https://images.genius.com/19b06abfed788ae492f578fa0afb063f.1000x1000x1.jpg", "album": "Uncontrolled Substance", "year": null}]}