{"artist": "50 Cent", "songs": [{"album": null, "image": "https://images.genius.com/3ac0369e9af7e95b4d1574832fafebfe.430x430x1.jpg", "title": "Magic Stick", "lyrics": "Artist: Lil' Kim f/ 50 Cent\n\n[50 Cent]\nAaah!\n\n[Chorus: 50 Cent]\nI got the magic stick\nI know if I can hit once, I can hit twice\nI hit the baddest chicks\nShorty don't believe me, then come with me tonight\nAnd I'll show you maaagic\n(What? What?) Maaagic\nI got the magic stick\n\n[50 Cent]\nI'm a freak to the core\nGet a dose once, you gon' want some more\nMy tongue touch ya girl, ya toes bound to curl\nThis exclusive shit I don't share with the world\nI have you up early in the mornin, moanin\nBack shot proper, the law can't stop us\nBeen a fiend for this since Rakim made hits\nGet the position down pat, then it's time to switch\nI'll rock the boat, I'll work the middle\nI speed it up, straight beat it up..\n.. And I ain't in the hood with my toast out loc'n\nI'm in the telly workin up a sweat strokin\nTonight's the night, you can fall in love\nYou can call your mama right now, tell her you met a thug\nI pop a lot of shit cause I can back it up\nMy left stroke's the death stroke\n\n[Chorus: Lil' Kim]\nI got the magic clit\nI know If I get licked once, I can get licked twice\nI am the baddest chick\nShorty you don't believe me, then come with me tonight\nAnd I'll show you maaagic\n(What? What?) Maaagic, uh-huh uh-huh\nI got the magic clit\n\n[Lil' Kim]\nLil' Kim not a whore\nBut I s** a nigga so good, he gotta tell his boys\nWhen it, come to s** don't test my skills\nCause my head game have you head over heels\nGive a nigga the chills, have him pay my bills\nBuy matchin Lambo's with the same color wheels\n.. And I ain't out shoppin spendin dudes C-notes\nI'm in the crib giving niggas deep throught\nTonight Lil' Kim gon' have you in the zone\nGirls, call ya crib, I'm answerin the phone\nGuys wanna wife me and give me the ring\nI'll do it anywhere, anyhow, I'm down for anything\nCouple of humps, give a nigga goosebumps\nThis junk in my trunk ain't made for chumps\nWhen Lil' Kim's around you don't need to lie\nIt's the \"Drugs\" baby, I'm makin ya high!!\n\n[Chorus: 50 Cent] + (Lil' Kim)\nI got the magic stick\nI know if I can hit once, I can hit twice\n(I am the baddest chick)\n(Shorty you don't believe me, then come with me tonight)\n(And I'll show you maaagic - what? What?)\nMaaagic (uh-huh, uh-huh)\n(I got the magic clit)\n\n[Lil' Kim] + (50 Cent)\nNow put your face in it\nI know you sprung off in your tongue, I know you tastin it\n(s** ain't a race) But I have a thug nigga breakin records\nAnd the time is (one minute, six seconds)\n(Magic stick) I got the magic box\nHave that ass trickin after one back shot\n(The gifts, the ice, I like that a lot)\nThe minks, the leathers, the cl drop\n\n[Chorus: 50 Cent]\nI got the magic stick\nI know if I can hit once, I can hit twice\nI hit the baddest chicks\nShorty don't believe me, then come with me tonight\nAnd I'll show you maaagic\n(What? What?) Maaagic\nI got the magic stick\n\n[Chorus: Lil' Kim]\nI got the magic clit\nI know If I get licked once, I can get licked twice\nI am the baddest chick\nShorty you don't believe me, then come with me tonight\nAnd I'll show you maaagic\n(What? What?) Maaagic, uh-huh uh-huh\nI got the magic clit", "year": null}]}