{"artist": "C-Rayz Walz", "songs": [{"title": "Classic (Clean)", "album": "Classic / Rhyme Doublin’ & A Bonus", "year": "2002-06-14", "image": "https://images.genius.com/31f0f9722ac8884f9a381226a030b02c.529x529x1.jpg", "lyrics": "[Hook: C-Rayz Walz] (x2)\nClassic when I’m kicking a flow\nClassic, never switching for dough\nClassic when I’m ripping a show\nIt’s classic, classic material\n\n[Verse 1: C-Rayz Walz]\nI can’t stand this just like a ham sandwich\nAnd I’m Fidel Castro rhyming in Spanish\nVersus Bill Clinton in a blaze battle\nA Leo blasting Sagittarius arrows\nAll twelve temples.  Life’s an instrumental\nI walk crooked baselines with a straight pencil\nLead foot show you what I’m into (Yo, yo)\nYou can’t copy the form until I sell a stencil\nStrike drastic, write graphic, classic\nYou know the mathematic static in my Asia attic\nPragmatic, swift change and remain\nCreate fly shit, give birth to funky airplanes\nI’m tranquilo but my rap steelo\nCould make me pull out mad metal like Magneto\nI might die quick in attempts to live long\nSo I got to come off every time I get on\nIf you see me drooling, I’m thinking ‘bout spitting\n‘Bout to smoke y’all—I should be quitting\nBut I’m stupid—I put Band-Aids on blood money\nMy girl got me on some Pooh-shit—I love honey\n\n[Hook: C-Rayz Walz] (x2)\nClassic when I’m kicking a flow\nClassic, never switching for dough\nClassic when I’m ripping a show\nIt’s classic, classic material\n\n[Verse 2: C-Rayz Walz]\nI got enough issues to start my own catalog\nAnalyze me as Allah in analog\nI ask about dinner during breakfast\nAhead of my time like a helicopter Lexus watch\nWe blow out the wind in trees, surfing a breeze\nWith condor feather skis.  Made from tough jeans\nLike leather Lee’s.  Trick, please\nI make shells a part of your life forever like Run DMC\nIn divine order, I make mistakes on purpose\nWalk the lunar land, tag my face on the surface\nDance on tap water perfectly\nLike the spirit of Gregory Hines or mercury, certainly\nBeing too close to the Sun is urgently\nWorse than burnt toast.  Get blind when observing me\nYou don’t like me?  Who cares?  I’m the spit you fear\nMy presence alone could end your career for a year\nYou want to hear heat?  I’ll take a dump in your ear\nBust a pump in the air, make clouds disappear\nNo mystery from Shaolin to Sicily\nTyson to Tiger Woods, I’ll strike consistently\n\n[Hook: C-Rayz Walz] (x2)\nClassic when I’m kicking a flow\nClassic, never switching for dough\nClassic when I’m ripping a show\nIt’s classic, classic material\n\n[Verse 3: C-Rayz Walz]\nThis for all my peeps who rock the permanent crease\nBrung shells out the house ‘cause life was a beach\nDrink seaweed, eat rocks\nNo talk of diamonds.  I spit ice—my shit’s hot\nI’m too/2 ill—1-plus-1 sick\nA smart guy who always did dumb shit\nSo get your script right.  Using my feet in a fist fight\nI’m not pussy—I don’t care what you dicks spit like\nShooting arrows at charts, using bow-legged girls\nThen splash out like the king of Waterworld\nBeware of stitches in your genes/jeans like denim\nBefore I stab a track ‘til it bleeds rhythm\n[?] was an X-Man before [rose-white streets?]\nBefore visions of rock raining on techniques\nI Rob Swift with beats with sinister [bees?]\nNow that the Sun’s out, come on!  Total-eclipse me\nSome fold in they sleep, turn cold in the heat\nI stroll through the belly of the beast, holding my meat\nI rep MCs who sow what they reap\nAnd keep it funky underground like Ed Norton’s feet (I’m)\n\n[Hook: C-Rayz Walz] (x2)\nClassic when I’m kicking a flow\nClassic, never switching for dough\nClassic when I’m ripping a show\nIt’s classic, classic material\n\n[Bridge (Overlapped with Hook Adlibs): C-Rayz Walz]\nR.C.P\nGreen Regime, T.O.P\nStronghold, NYC\nP-E-O-P-L-E Army\n\n[Outro (Overlapped with Hook Adlibs): C-Rayz Walz]\nYin and yang.  Y’all got the CD, Plain Pat and me (The Prelude).  Just like that.  O.B.S., y’all.  Brooklyn Academy, Spit Squad.  Strongheezy, money.  Classic, classic, classic, cl-cl-cl-classic material"}]}