{"songs": [{"year": "2009-12-08", "title": "Come On Baby", "image": "https://images.genius.com/af4025d67875bf5404a4f8df1787e394.500x498x1.jpg", "lyrics": "[Just Blaze]\nYou know we had to do a remix, right? (Yea, Jus Bleezy)\n\n[Swizz Beatz]\nHey - hands UP!\nHey - hands UP!\n\n[Saigon]\nLadies and gentlemen, you now rockin with the best\nI bought a few friends along, we gon do it like this, c'mon\nONE (ONE) TWO (TWO) THREE - HERE WE GO!!!\n\n[Saigon]\nIts the critically acclaimed, lyrically insane\nThe rhyme like her-oin, you stick it in ya vein\nThe track somethin like crack, it hits ya in ya brain (ya brain)\nC'mon baby, c'mon c'mon and get with the gang\nThey put the world's most underrated\nOn the record with the greatest of all time, can't no one debate it\nSome made it fun to say that I am goin to make it\nI will not lose, some of the shit he do is too understated (I...will...not...lose)\n(Who you?) Saigon the Don\nLet it be proved to people that I'm a phenomenon\nI'll pop a pussy person that play with my parmasean\nC'mon baby, c'mon come get it on with the 'Gon\nYou gotta be kiddin me! Who you think can body me lyrically\nGet him - I'll gladly provide his ABSITE, sissy\nMy name Saigitty, this is MY city!\nHov' spit it with me - go get 'em Swizzy!\n\n[Hook: Swizz Beatz]\nHold up, the pump will make you jump up, put ya body in the tr-unk\nKeep goin now..\nNew York, and all the way to Cali and the South'll make ya ju-ump\nDon't touch the boy, yup!\nHold up, the pump will make ya jump up, put ya body in the tr-unk\nI'll whip ya ass from\nNew York, and all the way to Cali and the South'll make ya ju-ump\nONE, TWO, THREE, WE GONE!\n\n[Jay-Z]\nYou ain't crazy, don't you play me, don't you know it's Jay-Z?\nWhen internets ask who's the best, why won't you say me?\nDon't you hate me? C'mon baby, wasn't all gravy\nI took my lumps comin up just like a boxer baby\nMy first style - hmm, maybe if I stuttered, maybe\nBut then I slowed it down, brought it from the gutter baby\nMatter fact, I don't give a FUCK where you rate me\nRecord labels told me, \"No\" - guess what the fuck they made me?!\nSuper rich! Stupid bitches know I'm super vicious\nLike, standin over a wounded man wit, two biscuits\nLet's get it clear like eucalyptus, if you conflicted\nMy flow is like the Cuban Missile Crisis\nNigga, my near misses are crisis\nI hide a couple rare jewels in a verse\nFor my niggas that like to listen like this\nHahahaha - you gotta let it do what it do, baby\nC'MON!\n\n[Hook]\n\n[Saigon]\nFour finger, three finger, two finger, one finger\nHumdinger, gun slinger, that's what I am\nI spit it slick as the shit that's in a Crisco can\nSo you should, c'mon baby, c'mon c'mon and get witcha man\nGot the rap shit down to a chemistry\nLotta fakes in the industry, but I don't let them get to me\nI rock for my brothers that's locked in the penitentiary\nMe, Jay and Swizzy got the \"Symphony of the Century\"\nRoc-A-Fella, Fort Knox, fucker ya heard that!\nI don't know where you be, but see I be where the birds at\nShe ask me buy her a drink, I get her some 'gnac\nThen it's, c'mon baby, c'mon c'mon let's merk to the back\nAnd way before my contract, I had hoes\nRappers claim that they had broads, but I doubt that they was bad broads\nI'm feelin disrespected\nIf everybody fuckin dimes, who got all these UGLY bitches pregnant?!\n\n[Hook]", "album": "The Greatest Story Never Told"}], "artist": "Saigon"}