{"songs": [{"title": "Do it Myself", "lyrics": "[Intro: Young Buck & 50 Cent]\nK'Yeah!! (Man I been tellin' niggas ova and ova man..)\nAye yo, whuddup niggas (Not to play wit' this nigga mayn'..)\nAye yo mayn', there be alot of niggas out here (Nigga on SSK program)\nTalkin'bout they got beef wit' G-Unit, ya'know.. (Shoot, stab, kill nigga)\nAnd I be seein' these niggas..\nI be by myself and shit, niggas be like 100 deep and shiit..\nI be like: \"Wussup nigga?!!\" (Don't say I ain't tell ya..)\nNiggas be like: \"Nah man..\" (I warned ya!)\n.. \"It ain't like dat.\"\n\n[Verse 1]\nLook up it's a full moon the sound of the wind blowin'\nAnd you don't know you 'bout to git killed, but I been knowin'\nTha nite still young, I mite as well come 'round midnite\nJust me all by my lonely, my homies gon' sit tight\nI'm workin' wit' a Glock and just a lil' bit of gas money\nBut bet I come back, wit' what dem niggas done snatched from me\nMy Crip & Blood thugs, they wanna git witcha\nThey mad at me cause I'm tellin' em \"It's personal, nigga.\"\nI wanna see, if this motherfucker want it wit' me\nSo on 3, I'mma hop up out this SUV\nIf ya around 'em, I feel like you down wit' em\nAs soon as this round hit 'em, you'll lay in the ground wit' em\nAwaken by Satan but bein' carried by Tha Lord\nWhat ya life costs Bill Gates couldn't even afford\nAin't nuthin' that can stop reprucussions if I die\nThis ain't got nuthin' to do wit' Dr. Dre mOthafucker\nJust you and I\n\n[Hook]\nI don't need 10 niggas wit' me\nI don't run and go git the police (I will do it myself)\nYou know me, I'mma motherfuckin' G\nIf it's beef, bitch nigga will see (I will do it myself)\nLet 'em hate, homie you know where I be\nYou done seen me git down on TV (I will do it myself)\nAnd I brought the whole Unit wit' me\nBut they already know how I be (I will do it myself)\n\n[Verse 2]\nIn the beginnin' I was humble\nJust thankful fo' makin' it out the jungle\nI've never eva sayd nuthin' on this mic' I didn't want to\nI'mma soulja, as soon as 50 give me a mission\nI mark my enemies territory, then play my posission (Let's go!)\nAnd homie know me even that nigga dat's wearin' ya chain\nSee we both from the South but homie, we ain't the same\nAnd I remain in the same fuckin' project buldin's\nI got guns everywhere, bullet-holes in the ceilin'\nMy adrenaline pumpin', got this 12 gauge dumpin'\nOut the back of this cutless if I git hit up, then fuck it (yeaaaa)\nTha Reaper comin', so don't look back, just keep runnin'\nTell 50 fo' this hit I don't need nuthin', you owe me one\nNow show me sonny where he be at\nDat's all I need to know, you can go - I'mma be back\nAny other time I probably would've asked Banks to ride\nBut this ain't nuthin' to do wit' G-Unit, nigga\nJust you and I\n\n[Hook]\n\n[Outro: 50 Cent]\nYeah!\nY'all niggas know whudd it is man, G-Unit South, Young Buck\nI've been holdin', I've been savin' y'all niggas man.. I Swear to God!\nI've been savin' y'all niggas!!\nOva and ova I'm tellin' him: \"Fall back, Buck!\"\n\"Don't cut these niggas, don't shoot these niggas.. Fall back!\"\n\"It's not good fo' business!\"\nRight?!.. Well now I'mma let up on him, I'm let yall niggas know\nThey gotta green light man\nFuck these niggas man!!\nGit right man, whateva..\nYou know whudd it is fo' me, mayn'..\nIt's Tha Unit nigga, HUH!\nFuck, I told ya..\nI see niggas.. Fix ya motherfuckin' face, nigga!!\nLook at these fuckin' chimpanzees, bunch of fuckin' monkeys, HUH!\nBurgers, you fuckin' meatheads!\nYeah, Go!! Go shoot yaself motherfucker!\nBefo' I lose one of my good niggas on dat, you hear me?!\nIt's Tha Unit, 50!!", "album": "Chronic 2006", "year": null, "image": "https://images.genius.com/63d4f02e882f231c8e92bf801e2994d2.626x626x1.jpg"}], "artist": "Young Buck"}