{"artist": "50 Cent", "songs": [{"album": "War Angel LP", "image": "https://images.genius.com/ddcb110037c817943db4819e7ee6759a.600x600x1.jpg", "title": "Cocaine", "lyrics": "[Intro]\nWhere did you get this stuff?\nColumbia\nOh, uhh... well, do you mind if I do a line?\nYeah, go ahead; fuck it, let's all do one\n{*All sniffing*}\nI can't feel my face\nI mean I can touch it, but I can't feel it... inside\n\n[Hook: 50 Cent & Robin Thicke]\nCocaine – I know police is watchin' (I see 'em watchin')\nCocaine – Hustlin', I'm not stoppin' (I got to eat)\nCocaine – I got to get my money, you think shit is funny\nMe I'm 'bout my business (you're motherfuckin' right) – Cocaine\n\n[Verse 1: 50 Cent]\nColumbian girl, Peruvian chick\nShe make the money roll and I love the bitch\nKnow she ain't a virgin, but she pure\nFor the right price I'll let you fuck with her raw\nA little like a pimp, I'm your pusher man\nShe could make us both rich nigga, yes, she can\nYou want your own spot, let's talk locations\nThen talk market and the public relations\n\n[Bridge: Robin Thicke & (50 Cent)]\nEverybody's watchin'\nBut no one talks about it (shut your mouth)\nRight now – that's all it was, anything call it\nShe said ''Sex just ain't the same without it''\n\n[Hook: 50 Cent & Robin Thicke]\nCocaine – I know police is watchin' (I see 'em watchin')\nCocaine – Hustlin', I'm not stoppin' (I ain't stoppin')\nCocaine – I got to get my money (I got to eat), you think shit is funny\nMe I'm 'bout my business – Cocaine\n\n[Verse 2: 50 Cent]\nEvery little step I take (come on), you will be there\nEvery little step I make (look, bitch), we'll be together\nSo grateful (yeah), so faithful (uhh)\nEvery gram in the hand's more paper (c'mon)\nI'll cut it, you sniff it, or smoke it, terrific\n\n[Bridge: Robin Thicke]\nMovie stars, models and blondes and cocaine\nNew York, L.A. – 's all the same\nThe angels look the other way\n'Cause they can understand my pain\n\n[Hook: 50 Cent & Robin Thicke]\nCocaine – I know police is watchin' (I see 'em watchin')\nCocaine – Hustlin', I'm not stoppin' (naw, I ain't stoppin')\nCocaine – I got to get my money (yeah), you think shit is funny (c'mon)\nMe I'm 'bout my business (business) – Cocaine\n\n[Outro: 50 Cent]\nYou niggas got a problem, yeah\nA big motherfucking problem\nAt a minimum, I'ma have a nigga put speedknots all over your motherfucking head, ya dig?\nOh shit\n\n[Robin Thicke]\nCocaine {*echoes*}", "year": null}]}