{"songs": [{"lyrics": "[Pre-Chorus]\nI got this pretty thang from the west side\nFace tatted like I grew up on the east\nShe ain't foreign but my baby get the best ride\nOoh, she a muhfuckin' beast\nAnd she say I don't pay her attention\nI said, \"Baby, I'm chasin' these millions\"\nScratch my back and say, \"Baby, I feel you\"\nI told her, \"Stay down and stay patient, let's get it\"\n\n[Chorus]\nI need you\nGirl, I need you, I need you, girl, do you believe in me?\nI need you\nGirl, I need you, I need you, girl, do you believe in me?\nGirl, I'm not finna play with your time\nThem lil' niggas just wasting your time\nAnd I need you\nGirl, I need you, I need you, girl, do you believe in me?\n\n[Verse 2]\nYeah, I can never ever ever ever ever trust another woman\nAnd she can never ever ever ever ever ever trust another nigga\nAnd she know all them funny niggas that she fucking with ain't fucking with me\nAnd any time that it's on your mind, baby, you can come and get it\nI be rather waiting, it's not what that other bitch\nOne of the other ones I say I wasn't fucking with\nI'll drop you off and come pick up another bitch\nI'll drop it off in her drawers and she loving it\nDo what I do, but I swear I don't love a bitch\nDon't have the patience, no I cannot take it\nI just want the face, yo, I don't want relations\nI want you to save it, I know you insane, yeah\nShe say that she with it, now girl, don't you lie to me\nYou need to quit it, now girl, don't you lie to me\nShe know I'm that nigga, I look like the lottery\nDon't play with my pistol, you gon' get shit up out of me\n\n[Pre-Chorus]\nI got this pretty thang from the west side\nFace tatted like I grew up on the east\nShe ain't foreign but my baby get the best ride\nOoh, she a muhfuckin' beast\nAnd she say I don't pay her attention\nI said, \"Baby, I'm chasin' these millions\"\nScratch my back and say, \"Baby, I feel you\"\nI told her, \"Stay down and stay patient, let's get it\"\n\n[Chorus]\nI need you\nGirl, I need you, I need you, girl, do you believe in me?\nI need you\nGirl, I need you, I need you, girl, do you believe in me?\nGirl, I'm not finna play with your time\nThem lil' niggas just wasting your time\nAnd I need you\nGirl, I need you, I need you, girl, do you believe in me?", "album": "So Disrespectful", "year": "2015-09-25", "title": "I Need You", "image": "https://images.genius.com/7afb7bfd76fac1340f1ee1e9722050fd.910x910x1.jpg"}], "artist": "DaBaby"}