{"artist": "Benzino", "songs": [{"lyrics": "[Intro - Benzino]\nOh you really think I wasn't comming back?\nMan you got me all twisted, c'mon man\nBeat Focus yeah\nYo ugly turn it up man\nZno, Sis Meazy, whatup\n48, Alize, whatup\nJB Jakes, 2 Times\n\n[Hook - Faheim]\nWhen I roll up low in that new wide body, please don't hate\nWalk through the door, shorty look my way, it's ok\nI ain't worried about, I'm here to party, here to party\nSee the ladies get low, get low, my hip kno! ws\nWrist glow it's a party, aiyo\n\n[Verse 1 - Benzino]\nNevermind if my pants sag\nJust as long as my earrings light up the skylight, bombs over Bahgdad\nI hope you haters act fast\nCause I'm about to change my name from Benzino to Mad Cash\nYou know what I'm starin\nI told my rims to stop spinnin, they ain't listen cause they hard of hearing\nTinted coupes, Christal, then you loose\nMama you rollin with a G, no more gin & juice\nGangsters don't take it light\nAny night, dime pieces, got em shaking like Vegas dice\nSee ID, VIP, Benz do everything B.I.G. *Baby*\nBeantown what I do rep, weed from the dred, got me right for the two step\nIce on my wrist, glist flash, ring to em\nShorty's a done deal, go ahead homie sing to em\n\n[Hook - Faheim]\nWhen I roll up low in that new wide body, plea se don't hate\nWalk through the door, shorty look my way, it's ok\nI ain't worried about, I'm here to party, here to party\nSee the ladies get low, get low, my hip knows\nWrist glow it's a party, aiyo\n\n[Verse 2 - Benzino]\nI got Cris by the case, lil pocket full of pesos, you can come party with me\nMe in the back, plays sittin on stacks, you can get the party started with me\nSticky ! icky in the air, run my fingers through your hair, all the time while I'm sizing you up\nI can tell she's a freak, I ain't even gotta speak, fill it up to the top of a cup\nOne more a drink, I ain't gotta think, already know soon she'll be naked in a mink\nTryin' to make the world spin, diamonds and pearls when\nShe make the call to menage with her girlfriend\nI can not lie, I love when pretty girls got their toes pointed at the sky\nSendin them, back home barely remember them\nFour tim! es a week at least, that's the minimum\n\n[Hook - Faheim]\nWhen I roll up low in that new wide body, please don't hate\nWalk through the door, shorty look my way, it's ok\nI ain't worried about, I'm here to party, here to party\nSee the ladies get low, get low, my hip knows\nWrist glow it's a party, aiyo\n\n[Bridge - Faheim]\nHow many ladies wanna party with us\nShake their bodies for us\nSip Bacardi with us\nLeave in Ferrari's with us\nHow many ladies wanna party with us\nShake their bodies for us\nSip Bacardi with us\nLeave the party aiyo\n\n[Hook - Faheim]\nWhen I roll up low in that new wide body, please don't hate\nWalk through the door, shorty look my way, it's ok\nI ain't worried about, I'm here to party, here to party\nSee the ladies get low, get low, my hip knows\nWrist glow it's a party, aiyo", "image": "https://images.genius.com/945c7322d9672c48d11afc32d5031058.500x500x1.jpg", "year": null, "title": "Wide Body", "album": "Arch Nemesis"}]}