{"songs": [{"year": "2017-09-28", "image": "https://images.genius.com/f2443103e58169f5d436350b69e9c89d.1000x1000x1.jpg", "title": "Confetti", "album": "4eva Is a Mighty Long Time", "lyrics": "[Chorus]\nYour confetti ain't even heavy, nigga\nGot the win, I want the record, nigga\nWhat's a crown if you don't protect it, nigga?\nWhat's a name if they don't respect it, nigga?\nNah, your confetti ain't even heavy\n\n[Verse 1]\nThese niggas fuckin' up the game, this shit is so suspicious\nYou ain't buy it all unless you blew a ticket\nAll off in the VIP, but you ain't fuck them bitches\nI'mma ball all summer just to flex for Christmas\nAngel wings on the doors, I gotta suplex 'em\nMoney don't make you fly, that's just my perspective\nRunnin' up the score to expose a bluff\n'Cause nowadays gettin' a win just ain't enough\nFuck the check up last week, I got a new agenda\nThe last time I couldn't buy some shit, I can't remember\nThe last time I fucked the world, I might've bust the center\nI bought a crib and set that bitch on top of Mount' Olympus\nWhen you livin' that high up, it's hard to see the tension\nI'm only sellin' game, I'm all out of simpin'\nGrip the foreign like a trophy, gotta hold it steady\nFuck your party when your confetti ain't even heavy, nigga\n\n[Chorus]\nGot the win, I want the record, nigga\nWhat's a crown if you don't protect it, nigga?\nWhat's a name if they don't respect it, nigga?\nNah, your confetti ain't even heavy\n\n[Verse 2]\nWe all off in the club like Sincere on Belly\nCan't even drink my liquor, money on my celly\nAccountant like, \"You got a check, spend it when you ready\"\nI'm giving niggas hell, pray I go to Heaven\nNailin' in they coffin, the cost of them being off it\nBallin' since Iverson crossed you, winner's circle my office\nFuckin' off with these wins, you fuckin' up with this loss\nWaiter forgot my season, I'm glad that they throwin' that salt\nMight just throw a toss and holla, \"Fuck it!\"\n'Cause when your wrist game know the grip changed, niggas' buckets\nChip rain in the strip game, hoes will bust it\nSnakes come, chop they heads off\nCobra clutchin' on a meal ticket\nMotherfuck you if you feel different\nI caught a break, no debate, and you still fishin'\nThe genie out the bottle and you still wishin' on my downfall 'cause you petty\nConfetti ain't even heavy, nigga\n\n[Chorus]\nGot the win, I want the record, nigga\nWhat's a crown if you don't protect it, nigga?\nWhat's a name if they don't respect it, nigga?\nNah, your confetti ain't even heavy"}], "artist": "Big K.R.I.T."}