{"artist": "360", "songs": [{"album": "Scar-Non III: Kick to the Head", "year": "2006-08-24", "title": "In Da Chub", "image": "https://images.genius.com/abe3cfc92fbcdff0e796fa77de4fbcea.479x479x1.jpg", "lyrics": "[Intro]\nHa ha, yeah!\nIt's 360\nForthwrite, '60 Cent\nI like 'em fat\n\n[Chorus]\nYo fatty, eat some more cake\nAnd when it comes to food that's your forte\nNever skip dessert unless it's a sorbet\nI know that you don't give a fuck because it's gourmet\nYou can find me up at Smorgy's lookin' for an orgy\nSearchin' for a fat-arse girl that's over forty\nHanding out my digits, I'm gettin' 'em to call me\nI'll go and give 'em cards if I'm really feelin' horny\n\n[Ad-Libs]\nYeah, Weapon X and Ken Hell\nA-Style, Forthwrite\n\n[Verse]\nI like fatties with attitude with boulders for tits\nWhere you don't need to raise your voice, you control her with chips\nAfter you roll 'em in dips, they're so fat\nThat you face the sun holding their hips to cause a solar eclipse\nYeah, I like girls the obese type\nWho don't eat right, with steamed rice but deep-fry their meat pies\nOn week nights they go shopping for Levi's\nBut they know their jean size is way over three-five\nAlways moody, they're too huge to be nice\nLegs are so big they wear boob-tubes as knee highs\nLet's get it straight, yo, I feed force 'em lemonade\nBetter than the featherweights who never takin' Jenny Craig\nAnd if your girl's fat, there's no need to be whipped\nAll you need is full cream and it needs to be whipped\nIf you get the booty goin', grab the keys to your whip\nFatties like it rough, homie, yo, they need to be whipped\nAnd I like it when their chin's saggin' below their titties\nYou know that '60 likes 'em over fifty like Oprah Winfrey\nThis one fatty fucked up her bandwidth\nShe went insane, tried to download a sandwich\nWhat the fuck? I get 'em off the weight program\n'Cause they ate smoked ham like the great Rosanne\nI know there's a high rate of spike rape\nBut me? Fuck drugs, I spike 'em with carbohydrates\nI love fat booty as big as Denmark\nThey're so fat on trains they purchase two Metcards\nYeah, I said the best arse is kept large\nBut fuck J-Lo, yo, I get hard for stretchmarks\n\n[Outro: 360 & PEZ]\nWhat? (Fuckin' fatties)\nFatties, come to me (Yeah!)"}]}