{"songs": [{"year": null, "title": "Hype Shit", "image": "https://images.genius.com/32dac835a69d095e96fcbbc2afb2d6e6.1000x1000x1.jpg", "lyrics": "Artist: Saafir\nAlbum: Boxcar Sessions\nSong: Hype Shit\n\nYou like classics well I'll stock that ass\nWit a 454 hypo, nitro hooked through the trunk\nI'm a flowmaster monk you'll get smobbed on\nI'll smoke that ass like skunk. You better\nRotate them drums locate that hum\nNo alignment\nMy rhymes remind me of ya suspension\nOff to the left section off the strip\nLet's strike a got a 7-deuce mali with sauce\nBrandy wine gloss, releighs edelbrock manifold\nHeader chrome kit, aluminum tips and I'm\nAssumin he'll slip and want to race me\nFor some scratch. I'll hook em in and pretend\nMy shit ain't tight. Let him bite then suck his ass\nAt the light - red light, smash - green light\nI lit up a lotta stares, now he wanna fight\nNigga swing ya shit, I gets up outta there\nJust me & him on the B & M shift kit from a rich b-\nYou wanna ride, unlock the shicks on tha cock\nI'm smockin engine blocks overheatin oil level\nRebels cause I'm rollin in hype shit\nI'm in some hype shit\nI'm in some motherfucking hype shit\n\nHigh speed chase down 280, I'm\nLookin at my oil gauge &\nIt read \"you can't fade me.\" I'm floatin\nThrough traffic\nLaughin 'n' shit but I wasn't trippin cause I had a gat\nWit a clip under the seat, then I heard the loud speaker\nSpeak, \"pull your ass over on the offramp &\nDon't try to vamp.\" Heart was on thumpa\nThe mark was on my bumper plus I had a zip\nOf bomb on my lap, I couldn't dump the gat\nGoing into custody can't fuck with that, plus\nI got a 396 with a trick in my trunk & I'm not\nGoin out like a punk so I bounced - fuck it\nThe way he was in me you would think his slary poppin\nBut I got mallory hook up & I'm not stoppin for shit\nI'm smobbin through tricks & trucks\n5.0's gettin\nSucked and I'm caught up in the rear-view\nDidn't see Linda Woo tryin to merge lanes\nShe almost hit me. (you biatch!) Took the Richmond turn off\nHit the switch on the nitro in a lean\nI felt my shit was Christine\nI'm out like a motha fuckin fiend, in hype shit", "album": "Boxcar Sessions"}], "artist": "Saafir"}