{"artist": "Pras", "songs": [{"album": "Ghetto Supastar", "title": "Murder Dem", "image": "https://images.genius.com/cf6a65fdae367a2af61e2514cba1f7cf.500x500x1.jpg", "lyrics": "Intro:\nHeh, yeah.  Aaight.  Just count me up in here, aaight?\nYeah.  Uhh.  Uhh.  Uhh\n\nVerse 1\nFirst and foremost let's distinguish the boys from the men\nThe start to a end, a foe from a friend\nWho next of kin when I bust this iron across yo' chin, nigga?\nLet me extend payments due on your arrangements\nTurn on the news, nigga, listen to the latest development\nExtra extra, read all about it\nMaster Pras always Bout-It-Bout-It\nBring tears to your fears when I shout it, shout it\nBetter believe, though he doubt it, doubt it\nYeah, what's all the fussin' and bickerin' for\nYeah, few shots up your ass, hear from you no more\nFor sure you belong with an M-16\nStand in front of the door, that you just can't ignore\nGo figure.  Hit the floor, nigga\nRandom shots - run for your life, nigga\nThis goes for my niggas who gets no bigger\nSweat on your forehead, let's see who pull quicker\n\nChorus:\nYeah, murder dem.  Murder dem.  In a, competition me go, murder dem\nWha' what, follow dem.  Hm.  Follow dem\nIn this, situation me no, follow dem when me gone\nAll pussi haffi run when me gun.  All cowards haffi run when me gun\nNo man haffi come 'cause we, murder dem.  Hm.  Murder dem\n\nVerse 2\nI'm livin' on danger's ground, where the danger's mine\nHold firm, stand strong, 'bout to blow like land mine\nNever mind, draw, reach for yours, I'ma go for mine\nLeave you paralyzed with a broken spine\nThey seize and they shrine in the line of fire\nRetreat, recline, from all firearm\nRing the alarm, bring the bomb squad, word to God\nGot your number, nigga, watch I'll pull your cord\nPardon me, sincerely yours\nDown by law, out to settle the scores\nHaters shoutin', \"No, he can't be no more!\"\nParasite, leachin' down, rottin' to the core\nCash rule, jewels cool, drown in my whirlpool\n'Scuse my rudeness, rudeboy from Providence\nThese fists of fear remain to be fearless\nMove like flyin' fators, full automation\nPumpin' carbon monoxide through your blood circulation\nSeparate these facts like segregation\nTrial and tribulation, high expectation\nThe brigade shut off, backs seen me run off\nCagein' with Nicholas, it's a face-off\nWhat?  Yeah!  Hah, mmm!\n\nChorus\nYeah, murder dem.  Murder dem.  In a, competition me go, murder dem\nWha' what, follow dem.  Hm.  Follow dem\nIn this, situation me no, follow dem when me gone\nAll pussi haffi run when me gun.  All cowards haffi run when me gun\nNo man haffi come 'cause we, murder dem.  Hm.  Murder dem\n\nVerse 3\nIn case you didn't know, it's the P-R-A-S\nGot strategies like playing chess\nPenetrate through your flesh, yes, hit me with your best\nGot issues to address, nonetheless\nCheckmate, only makin' moves with my playmate\nPrakazrel is Pras when it's abbreviate\nMy puncture is accurate, nigga you dead weight\nDislocate every bone in your body\nThen sit back and evaluate\nEvery mental thought process is isolate\nPreception is clear with my steel, I should demonstrate\nYou were last seen gettin' head from a drag queen\nCome clean, nigga what, with an 18\nThe supreme dream team, cash rule and CREAM\nWhile your body lies up in a neoprene\nWhat, yeah, wha'what, wha'what, hahh!\n\nChorus\n\nHmm.  Uh huh uh huh.  Refugee Camp All-Stars.  Uh huh.  Uh huh uh huh\nYeah, yeah\n\nChorus", "year": null}]}