{"songs": [{"year": null, "album": null, "image": "https://images.genius.com/bff1176ed6deb6d256cc9e04734b0136.365x365x1.jpg", "title": "Numba 1 (Tide Is High) (feat. Keri Hilson)", "lyrics": "(Kardinal Offishall)\nLight it up, everybody\nLight it up, fi Kardinal\nLight it up, everybody\nLight it up\n\n(Keri Hilson)\nThe tide is high but I'm holding on\nI'm gonna be your numba 1\nNumba 1\nNu-u-u-u-u-umba 1\n\n(Kardinal Offishall)\nKardinal!\nShe's just my part time lover\nPretty little thing\nNothin i would ever think about givin no ring\nNothin but a pretty little overnight fling\nEven though she wanna be the queen to my king\nShe ain't nothin but a work for my ginseng\nSomeone I would use to buss mi backspring\nShe woulda be numba one at the badda bing\nBad man nah go badda wid di wife wife ting\nShe gotta know she's the girl on the side\nOn the left are the rest numba 2 on my mind\nThere no way she could be my girl\nAnd she's steady tryin to come into my world\n\n(Keri Hilson)\nThe tide is high but I'm holding on\nI'm gonna be your numba 1\nNumba 1\nNu-u-u-u-u-umba 1\n\n(Kardinal Offishall)\nYow, She's just my trophy piece\nMi hot hot gal\nNever ever woulda call her Mrs. Offishall\nNever ever woulda bring her around my fam\nShe'd be cryin on the phone but she knows who i am\nI'm Mr. Kardinal\nVoice to the people\nBlack J's family and verses are lethal\n\nI dont have time for the play play\nShe a good chick yo but i'm married to the game\nMarried to the fame, related to the paper\nTryin to get my name put upon a skyscraper\nThere's no way she could be my wife\nBut she's steady tryin to come into my life\n\n(Keri Hilson)\nThe tide is high but I'm holding on (i ain't going nowhere)\nI'm gonna be your numba 1\nNumba 1\nNu-u-u-u-u-umba 1\n\nThose other girls ain't nothing like me.(done know Keri)\nJust give me the chance and boy you will see that\nI'm not the kind of girl who just gets down like that\nOh no\n(Kardinal Offishall)\nOn the real I ain't gonna front\nYour the fox to a lotta hound dogs on the hunt\nYou the push to a lotta cush rolled in the blunt\nYou the hottest in the dance but you ain't what i want\nI'm a business man tryin to get the business\nJust tryin to walk out you physical fitness\nThere's no way you could get that ring\nBut i hear all the hottie hotties in the place sing\n\n(Keri Hilson)\nThe tide is high but I'm holding on(the tide is high baby)\nI'm gonna be your numba 1 (numba 1)\nNumba 1\nNu-u-u-u-u-umba 1\nThe tide is high but I'm holding on\nI'm gonna be your numba 1 (i'm gonna be your)\nNumba 1 (numba 1)\nNu-u-u-u-u-umba 1\n\n(Kardinal Offishall)\nKardinal, Keri Hilson, Linda P\nLight it up, everybody\nLight it up (music fades)"}], "artist": "Kardinal Offishall"}