{"songs": [{"year": null, "image": "https://images.genius.com/283cd237d7c947223a80f65f3252599e.500x500x1.jpg", "title": "Fickle Mind$", "album": "Nehruvia", "lyrics": "[Produced by: Ghost McGrady]\n\n[Sampled Intro: 2Pac]\nI would tell each and every person out there\nDoh-Forget about that click n up Sh-thing, you know what I mean?\nBe to yourself, stay to yourself, trust nobody\nTRUST NO-BODY\nAfter dark, you know what I mean?\nStraight up, my closest friends did me in\nMy closest friends, my homies, people who I done took care of they whole family\nI done took care of everything for em, looked out for them, put em in the game\nEverything! Turned on me!\nFear is stronger than love, remember that\nFear is stronger than love, all the love I gave, didn't mean nothing when it came to fear\nSo it's all good, but I'm a soldier, I always survive, I constantly come back\nYa know what I mean? Only thing that can kill me, is death, that's the only thing that will ever stop me, is death\nAnd even then my music live forever\n\n[Verse 1: Bishop Nehru]\nCheck!\nI'm a genius when it comes to spittin' flows\nMy sixteens hard, don't act as if you didn't know\nI'm laying low, not in a circle\nBut blowing O's and hoping that Buddha knows\nThat there's plenty of foes with four fours\nTryna get a nigga clipped quick!\nIt sick shit going on, but I try to stay calm, and focus on songs\nBecause ones that's doing wrong, tryna have me tag along\nAnd word is bond, I rather bomb word vapor from bongs\nThat's word with no friends\nNo games when I hold pens, and these hoes, they hoping\nThat my heart, will open, and let em into the cash\nBut my mind sets lab\nLike they did when I was in class, just struggling to pass\nBut at last I past them, with the stash and my live 10\nYou boyfriend ask him, he know that there's crack in my\nTracks when I rap, people clap and react fast\nBecause they know that Nehru and this rap shit is gonna last\nIt's the fact that I'm everything that you lack, nigga you whack\nDon't act like I ain't murder these rappers with one track\nThe lights leak, the bright peak, start of the show\nNow I got you, and your ho front row at my show, whoa!\n\n[Bridge]\nNow I got you, and your ho front row at my show, whoa!\nYou and your ho front row at my show, whoa! (whoa)\nNow I got you, and your ho front row at my show, whoa!\n\n[Verse 2: Bishop Nehru]\nBut shit slow, cause there's no entry\nFor ones that tryna tempt me\nWith ounces of sticky, and icky bitches that's tryna get me\nHit with a charge, cause the kid live large\nIn the stars is where I rest, and my bars they be the best\nAnd I bust it out my chest\nAnd clowns, I never stress\nThey seeing, they could progress\nSo they tryna get with the cheques\nHah! Fickle Mind$ tryna blind a nigga shine\nMy grind, never combine with people that's on the side\nBecause all of them living lies, and I be living these lines\nLike lives, below foes, there's always a no-soul\nDon't go \"Oh No\", when you notice the kid is global\nWhen your ho's backstage giving me a slow blow\nI know I spit advance right? That's why my advance right\nI'm killing any rapper that stand with a pen and mic\n\n[Outro]\nStay outta sight, and I'm tryna be polite\nBut I swear when a nigga write from the pen acetyl ignite\nIt's like(x3)"}], "artist": "Bishop Nehru"}