{"songs": [{"title": "Get ’Em", "album": "Finally Famous: The Mixtape", "year": "2007-11-24", "image": "https://images.genius.com/e4311df795cf4c9077ccbb609da0c55a.500x500x1.jpg", "lyrics": "[Hook]\nUh Man verse by verse\nI'mma make these weak niggas disperse\nMan I swear verse by verse\nI'mma make these weak rappers disperse\nMan I'mma get 'em\nI'mma get 'em\nWatch me get 'em\nI'mma get 'em\nI'mma get 'em\nI'mma get 'em\nWatch me get 'em\nI'mma get 'em\n\n[Verse]\nI'm very instrumental, to any instrumental\nYou ain't on my level my nigga, even a little\nYou at the bottom, not even at Malcolm in the middle\nYou homo ass nigga, (shh) go-N eat some skittles\nNow hop up on the rainbow try to reach where I hang though\nI'm a little further up then and near the angels\nSo at your highest point you still wouldn't reach my ankles\nYou are what you eat but that ain't true cause im anal? (eww)\nAnd the people show love like a bear hug\nI'm here to last, they temporary call em' haircuts\nFair enough I stand behind my balls like a felon does\nIf you a boss, meet the executor and when it come to paper, meet the editor\nA little better brah you need to step, step it up\nI'm on my business that's my forte, you?\nYou beat around the bush like foreplay\nAnd they anticipating me like a court date\nSo for the bars Im'a charge like the court say\nAnd if the court say they know I did it like OJ (what?)\nThen im in the next city like a tour date\nThere ain't no I in team but it's in I in win\nAin't no \"I\" in lose but there's an \"I\" in him\nMeaning me meaning moi, so beat the repertoire of the upper echelon\nThat's high, high in the sky, high to the point that I almost saw God. (Wow)\nI stand out from the rest like Yao\nBut ain't gotta play ball to have you cheering\nPerform so well I might as well take a bow\nShitting on these niggas' like a movement from my bowels\nPeople wanna know how if feels in the clouds\nBut I guess they'll never know cause im never coming down\nI started with a dream, added a little faith in\nMixed it with adversity and let it marinate\nI put it in the oven for a while and let it bake (yup)\nCall it food for thought, put it on your plate\nA friend of mighty Motown, home sweet home\nWhere I roam like a phone in the unknown zone\nMy niggas roam like a phone in the unknown zone\nAnd we condone a tone a money hoes and clothes\nAnd my record sell like a boat load\nFam you couldn't fill my shoes like bozos\nAnd im solo, cause I herd that what hoes really want is a ring like Frodo. (no)\nCoastal, man my nickname postal\nWhy they local like they old schools\nI should beat them like pro tools\nWill Farrell nigga started out Oldschool\n\n[Hook]\n\nNote to the world, I made it\nI promise I'mma change it\nThank god to my Momma that I'm finally famous"}], "artist": "Big Sean"}