{"artist": "50 Cent", "songs": [{"album": "Get Rich or Die Tryin’", "image": "https://images.genius.com/17bdb55979efe915f90e0fa67b92ad61.1000x1000x1.jpg", "title": "Patiently Waiting", "lyrics": "[Intro: 50 Cent]\nHey Em, you know you're my favorite white boy, right?\nI owe you for this one\n\n[Hook: 50 Cent]\nI been patiently waitin' for a track to explode on\nYou can stunt if you want and yo' ass'll get rolled on\nIf it feels like my flow's been hot for so long\nIf you thinkin' I'ma fuckin' fall off, you're so wrong\n\n[Verse 1: 50 Cent]\nI'm innocent in my head, like a baby born dead\nDestination heaven\nSit and politic with passengers from 9/11\nThe Lord's blessings leave me lyrically inclined\nShit, I ain't even got to try to shine\nGod's the seamstress that tailor-fitted my pain\nI got scriptures in my brain, I could spit at your dame\nStraight out the good book, look, niggas is shook\n50 fear no man, warrior, swing swords like Conan\nPicture me, pen in hand, writin' lines\nKnowin' The Source will quote it\nWhen I die, they'll read this and say a genius wrote it\nI grew up without my pops, should that make me bitter?\nI caught cases, I copped out, does that make me a quitter?\nIn this white man's world I'm similar to a squirrel\nLookin' for a slut with a nice butt to get a nut\nIf I get shot today my phone'll stop ringin' again\nThese industry niggas ain't friends\nThey know how to pretend\n\n[Hook: 50 Cent]\nI been patiently waitin' for a track to explode on\nYou can stunt if you want and yo' ass'll get rolled on\nIf it feels like my flow's been hot for so long\nIf you thinkin' I'ma fuckin' fall off, you're so wrong\nI been patiently waitin' for a track to explode on\nYou can stunt if you want and yo' ass'll get rolled on\nIf it feels like my flow's been hot for so long\nIf you thinkin' I'ma fuckin' fall off, you're so wrong\n\n[Bridge: Eminem]\nIf you're patiently waitin' to make it through all the hatin'\nDebatin' whether or not you can even weather the storm\nAs you lay on the table, they operatin' to save you\nIt's like an angel came to you, sent from the heavens above\n\n[Verse 2: Eminem]\nThey think they're crazy, but they ain't crazy\nLet's face it, shit, basically\nThey're just playin' sick, they ain't shit\nThey ain't sayin' shit — spray 'em, 50!\nA to the K, get in the way I'll bring Dre and them with me\nAnd turn this day into fuckin' mayhem, you stayin' with me?\nDon't let me lose you, I'm not tryna confuse you\nWhen I let loose with this Uzi\nAnd just shoot through your Isuzu\nYou get the message? Am I gettin' through to you?\nYou know what's comin'?\nYou motherfuckers don't even know, do you?\nTake some Big and some Pac and you mix 'em up in a pot\nSprinkle a little Big L on top, what the fuck do you got?\nYou got the realest and illest killers tied up in a knot\nThe juggernauts of this rap shit, like it or not\nIt's like a fight to the top just to see who'd die for the spot\nYou put your life in this, nothin' like survivin' a shot\nY'all know what time it is, soon as 50 signs on this dot\nShit, what you know about death threats, ‘cause I get a lot\nShady Records was eighty seconds away from the towers\nSome cowards fucked with the wrong building\nThey meant to hit ours\nBetter evacuate all children, it's nuclear showers\nThere's nothin' spookier\nYou now about to witness the power of fuckin' 50\n\n[Hook 2: 50 Cent]\nI been patiently waitin' for a track to explode on\nYou can stunt if you want and yo' ass'll get rolled on\nIf it feels like my flow's been hot for so long\nIf you thinkin' I'ma fuckin' fall off, you're so wrong\nIf the gun squad hearin' all the shots go off\nIt's 50, they say it's 50\nSee a nigga laid out with his fuckin' top blown off\nIt's 50 — man, that wasn't 50, don't holla my name\n\n[Verse 3: 50 Cent]\nNiggas shouldn't throw stones if you live in a glass house\nAnd if you got a glass jaw you should watch your mouth\n‘Cause I'll break your face\nHave your ass runnin', mumblin' to the jake\nYou goin' against me, dawg, you makin' a mistake, I'll split ya\nLeave you lookin' like the Michael Jackson jackets\nWith all them zippers\nI'm the boss on this boat, you can call me skipper\nThe way I turn the money over, you should call me flipper\nYour bitch a regular bitch, you callin' her wifey\nI fucked and feed her fast food, you keepin' her icey\nI'm down to sell records but not my soul\nSnoop said this in '94: \"We don't love them hoes.\"\nI got pennies for my thoughts, now I'm rich\nSee the twenties spinnin' lookin' mean on the six\nNiggas wearin' flags ‘cause the colors match they clothes\nThey get caught in the wrong hood\nAnd filled up with holes, motherfucker\n\n[Hook: 50 Cent]\nI been patiently waitin' for a track to explode on\nYou can stunt if you want and yo' ass'll get rolled on\nIf it feels like my flow's been hot for so long\nIf you thinkin' I'ma fuckin' fall off, you're so wrong\nI been patiently waitin' for a track to explode on\nYou can stunt if you want and yo' ass'll get rolled on\nIf it feels like my flow's been hot for so long\nIf you thinkin' I'ma fuckin' fall off, you're so wrong", "year": "2003-02-06"}]}