{"artist": "Immortal Technique", "songs": [{"title": "Beef and Broccoli", "lyrics": "Look, let me make something abundantly clear for people that are so bereft of activities they feel like they gotta comment on every one of mine.\nFirst of all, being a vegetarian should never be associated with being a revolutionary or being open-minded—that's a dietary choice.\nIf someone wants to proliferate the type of ignorance we're supposed to be fighting by thinking that, you're just fuckin' yourself.\nI don't go around promoting beef and poultry, shoving it in people's faces, I don't castigate people for not eating steak sandwiches, and I would never diss someone for being a fuckin' broccoli head, or living off radishes or eating grass with tofu.\nI like a lot of vegan cuisine, but the illogicality of expecting everyone to adopt your particular idea of what being healthy is, is just preposterous.\nI've seen some of you herbivores, and if you wanna argue health, y'all need to eat some kind of supplement, because some of y'all are so skinny that it's disgusting.\nLookin' like the only hip hop motherfuckas on Schindler's list.\nBeing a malnutrition ass got nothing to do with being revolutionary or being on point.\nI'll be damned if I let somebody else push their agenda on me.\nYou know, I don't eat pork, not 'cause I'm a Muslim—I just don't really like it, but I really will fuck a bird up, and fish is good when that shit is fresh.\nIt's like my nigga Vast Aire from Can' Ox said, \"If you don't like the smell of burning meat, then get the fuck off the planet!\"\nYou know, I don't criticize people for eating moss.\nAnd don't open your fuckin' mouth about my food, man!\nI like beef and broccoli, motherfucka.\nMind your goddamn business!\nMatter of fact, you know what? I'm out.\nI feel like asome arroz con pollo, a banana daiquiri, and a motherfuckin bistec empanado.", "image": "https://images.genius.com/9c9631e16897ed9bc090afd0a05da5ae.1000x974x1.jpg", "album": "Revolutionary Vol. 1", "year": "2001-09-18"}]}