{"songs": [{"title": "My Shit", "album": "Artist", "year": "2016-01-17", "image": "https://images.genius.com/692320b09f1871c9d062bc89073fc2b8.500x500x1.jpg", "lyrics": "[Intro]\nIn my bag now, In my bag now (Bag now)\nWhat the fuck is that sound? (That sound)\nWhat the fuck is that sound? (That sound)\n\n[Verse 1]\nBrought the MAC out, niggas sat down\nI got shit I never had now, I could brag now\nGot my bitch a Louis bag now, she could brag now\nBought my bitch a Birkin bag now, she a brat now\nNow I'm sittin' in the club in a different bag now\nBaby when I pick it up you gon put that ass down\nTell 'em you don't give a fuck, baby spin that ass 'round\nTell the DJ turn it up, what the fuck is that sound?\nA Boogie Wit Da Hoodie and it's always foreign\nYeah I know she like my style, them other niggas borin'\nWhen I pull up it go skrrt skrrt, that's a foreign\nWhen I pull up on a red light, they don't want it\nYeah I came up from the mud and my baby know that\nIntroduced her to my plug, now she think she all that\nWhen I first hit her up, no she never wrote back\nThen I saw her at the club so I got up on that\n\n[Chorus]\nNow every time they play this song she say \"This is my shit\" (This is my shit)\nSee the flick of my wrist (Flick of my wrist)\nAnd I know she know wassup, baby this is my shit (This is my shit)\nSee the flick of my wrist (Flick of my wrist)\n\n[Verse 2]\nThey know that's my bitch, that's a fact and she stuck with me\nWhen you in my section, fill it up when my cup empty\nI can't fuck with rats, that's a fact, that's a dub nigga\nAll about my F, can't put water over blood nigga\nTrust me, it get ugly\nIf I wasn't gettin' money would you still want me?\nIf I told you I was broke would you start actin' funny?\nThis is all I ever wanted, you can't take it from me\n\n[Chorus]\nNow every time they play this song, she say \"This is my shit\" (This is my shit)\nSee the flick of my wrist (Flick of my wrist)\nAnd I know she know wassup baby this is my shit (This is my shit)\nSee the flick of my wrist (Flick of my wrist)"}], "artist": "A Boogie Wit da Hoodie"}