{"songs": [{"image": "https://images.genius.com/8e0e23387237dba2d30a8940f7e1740a.550x550x1.jpg", "album": "Glitter", "year": "2018-03-23", "lyrics": "[Chorus]\nAnd my eyes start to wander to the other girls, to the other side, yeah\nAnd my heart starts to wonder, is it okay, is it alright? Yeah\nAnd I'm not too fond of all the arguin' and all the fightin', yeah\nAnd I'm lost in love, I just want to hug all through the night, yeah\n\n[Verse 1]\nIt's the morning baby, I'm about to slide, no cha-cha\nYour girl ain't passion, more like Prada\nWe don't do the potion, man we always take alot of it\nI wash it down just with a little molta\nLittle silver, little gold, and I want both\nThere's freaks in the street so you know you gotta hold\nScreamin' in my face and you're gettin' real bold\n\n[Pre-Chorus]\nGettin' real tough, you know, you know\nI don't want to get rough, you know, you know\nI don't want to lose your love, you know\nI don't want to lose your love, ayy\nI don't want to lose your love\n\n[Chorus]\nAnd my eyes start to wander to the other girls, to the other side\nYeah, yeah, and my heart starts to wonder, is it okay, is it alright? Yeah\nJersey, who next? jump in, let's go\n\n[Verse 2]\nNow you see, see, see, see, see what I mean\nShe walk, she walk\nShe said things with her art, she doesn't really talk\nI'm racin' with the time and I'm fightin' with the clock\nTock, tick tock, tock tock\nI'm fuckin' with the band baby, this is how we rock\n\n[Pre-Chorus]\nI don't want to get rough, you know, you know\nI don't want to lose your love, you know\nI don't want to lose your love, ayy\nI don't want to lose your love\n\n[Verse 3]\nIt's later in the evening, I'm playin' on her keys and, ayy\nAs down as one can be, yeah, what's goin' on inside of me? Ayy ayy\nI just want time, I want a dream, ayy\nI try want time, I want a dream, ayy\nI smoke one time, I want a dream, ayy\nI want one time, I want a dream\nI want a dream, I want a dream", "title": "Lost In Love"}], "artist": "070 Shake"}