{"songs": [{"title": "Everyday", "album": null, "year": null, "image": "https://images.genius.com/37d697fdf2a877e070869cbcf7cc9322.151x151x1.png", "lyrics": "[Verse One: B.G.]\nOn the block avanna to magnolia tryna shine\nI scored a bird and I flipped dat bitch forty times\nNow we ballin from Houston to New Orleans seven figures (ya'll lyin)\nGot the baddest broads callin cause I'm rockin ice (bling!)\nGotta 2000 Benzy Bike rrrroooommmm rrrooommmm! loud pipes loud pipes\nGotta house on Washatona thats laid out\nShort Bentley on dubs paid out\nMy niggas homes said wodie be bout cha' paper\nHe said you got ends dem feds will try ta hate ya\nI said look here you know I'm bout my change cousin\nI can spend a grand a day like it ain't nuttin\nCause I got money to blow I can spend a mill a day\nAnd be far from broke ya heard me believe dat!\nIf it ain't ice it ain't ya heard me!\nIf it ain't platinum it ain't right\n\n[Chorus 2X: Lil' Flip]\nEveryday I'm ballin (ooohh da way y'all ball)\nBourbon is crawlin (ooohh da way y'all ball)\nTexas to New Orleans we ballin (ooohh da way y'all ball)\n\n[Verse Two: Lil' Marice]\nI'ma balla-shot calla and I'm seven years old\nMy blades gon' chop and my pop trunk low\nI chill wit my boys I might ride tan\nI'ma H-town playa and ya'll can't stand me!\nWhen I'm at school I make good grades\nYa know I'm Sucka Free and we all playa made\nChop chop twist twist I got rocks on my wrist\nI'ma million dollar balla wit a million dollar kiss\n\n[Verse Three: Lil' Flip]\nWell...\nI got rocks on my wrist head lights on my fist\nWit all dis platinum in my mouth playboy I'm da shit!\nI gotta Bourbon, a Jag, and one Durango\nIf you lookin at my watch you might see a rainbow\nAnd when I pull up on da scene I'm hangin out da sunroof\nFo' 15's in my trunk kick like kungfoo (hhhuuwwwhhhaaii!)\nYou say you ballin like me what you gun' do\nWhat you got on yo' watch I got on one tooth\nI like to spend 50 and ball in da mall\nGo to Gavleston and crawl on da wall\nMe & Duke spend money and roll on 3's\nI spend money like it grows on trees!\n\n[Verse Four: Taz]\nIf you ain't a millionare you can't ball wit me\nGirl if you ain't a star you can't get caught wit me\nAin't nobody gon' represent the south like me\nAin't nobody got rocks in they mouth like me\nI'ma shine no matter what the cost\nMaybe I'm da boss nobody play the flaught wit me\nYou claim you ballin hard you ain't spendin G's\nWe only roll 20-inches on our Bentley's\nT-A-Z ballin is what you hate ta say\nTwenty D's in my rang can you pay da fee\nWit out money I dont know how my day would be\nIt's Hill Wood puttin it down playa we Sucka Free, that's right!\n\n[Chorus 4X: Lil' Flip]\nEveryday I'm ballin (ooohh da way y'all ball)\nBourbon is crawlin (ooohhh da way y'all ball)\nTexas to New Orleans we ballin (ooohh da way y'all ball)\n\n[Verse Five: Lil' Flip]\nLook everybody in my click got Ninja bikes\nPlease take off ya ring I got bigger ice\nI shoot craps in Vegas they got bigger dice\nI re-did my teeth platinum for a bigger price\nI got drop-top toys like Fisher Price\nI like 2000 cars they got bigger lights\nI got 20's at night jus' ta blow ya mind\nI pull up in a crawla jus' ta slow ya down (*tires schreeching*)\nWhen I pull up at da light women stop and giggle (Girls:Hey Flip,Hey Flip)\nI tell em girl ya look good hop in da middle\nI'ma Texas boy and I like ta ball a lot\nI got 2 Prime Co's women call a lot (Hello,Hello)\nI can't help dat I'ma star its in my Jeans-N-Trace\nI got my name on my arm ScreensNPlates\nI'm Lil' Flip and I'm all about stockin change\nYou say ya gotta million nigga that's pocket change\nI'm ballin, I'm ballin!\n\n[Chorus 4X: Lil' Flip]\nEveryday I'm ballin (ooohhh da way y'all ball)\nBourbon is crawlin (oooohh da way y'all ball)\nTexas to New Orleans we ballin (oohh da way y'all ball)\n\n[Harmonized: Lil' Flip]\nSippin on lean ya know I'm lookin clean\nWatchin T.V screens 20 diamonds in my rriinngg!\nWe bbbaaallllliiinnnggg!\nKhakis wit a creese platinum on my teeth\nYa know I'm Sucka Free till I DDDD-III-EEEE!\nWe bbbaaallliiinngggggg!\n\n[Girl Singing]\nI like da way you playas ball I like\nDem diamonds when ya smile it jus da way\nYou playas shots and roll on 20's all da time\nOoohhh!drastic!da way ya'll ball!"}], "artist": "Lil Flip"}