{"songs": [{"title": "A Town Summer", "lyrics": "One of the realest niggas to ever bless a beat (told these niggas mane)\nYa'll gon miss me wen I'm gone nigga\nCTE in the buildin nigga (yuh)\nSlick Pulla whats good nigga? (ya'knamsayin)\n4th Ward representin' (huy)\nBloodraw whats good nigga?\nF-L-A representer (you wanna feel this nigga pay attention)\n\nAim for the sky, thats all I can tell ya (yup)\nRoll the purple up and get high like Delta (aye)\nNow I'm in my own world, way up in the clouds (clouds)\nGangsta's paradise, no haters allowed\n\n[Slick Pulla talking]\nHold on hold on hold on hold on hold on Drama\nI don't think these niggas heard my big homie nigga\nPlay that shit back in the re-bump nigga\nThis CTE USDA the voice box of the block\n\nAim for the sky, thats all I can tell ya (yup)\nRoll the purple up and get high like Delta (aye)\nI'm in my own world, way up in the clouds (clouds)\nGangsta's paradise, no haters allowed\nIt all happened so fast, take time think\nPinch myself, take time to blink (aye)\nSo what do ya do wen the whole world loves ya? (loves ya)\nThe hustlers and the gangstas put nuttin above ya? (chea)\nLove is love, ya just can't fake it (uh uh)\nThese niggas really happy to see one of us make it\nDon't talk much, do a whole lotta thinkin'\nMy nerves still bad, do a whole lotta drinkin' (deeam)\nHot summer nights wake up in a cold sweat (sweat)\nGave my partner ten he ain't came home yet (nope)\nStill I ride big boy coupes through traffic\nCan get 20 years for what I got in this plastic (ha ha)\nAnd it don't stop there, look at my passenger seat (aye)\nCan getta another 10 for just packin the heat (deeam)\nCuz nowadays, man, these niggas'll kill ya\nThink ya hard like concrete? These niggas'll drill ya\nIt ain't a criiiiime until ya get caught\nJust thought I'd take a minute to bless ya with my thoughts (ya know)\nMoney is a terrible thing to waste\nThats why ya stack it to the ceilin' hide it all in ya safe (whoo)\nI'm so complex, I got a beautiful mind\nI'm such a hustler, I got a beautiful grind (I know)\nAnd I can take ya niggas back to the gentlemen's club\nYou can catch me upstairs I'm such a gentlemen's thug\nGet off my dick thats what you need to do (need to do)\nO.G. and Shuga can't vouch for you (ha ha)\nIn '98 I had the GS4 (wha?)\nGettin' my Busta Rhymes on, nigga gimme sum mo'\n\nYou niggas just rap about it, I was livin it\nTake ya back when Timbo and Dave and them was gettin it\nCook it on the stove, not the microwave\nBack when niggas rolled around and had finger waves\nCan't forget them Edward J mixtapes\nWhen niggas went to Mechanicsville just to get straight\nSee these rap niggas wouldn't know nuttin' 'bout that (nah)\nLike a V.H.S., just rewind it back (deeam)\n\nI risk my life just to talk like this (yup)\nAnd this the motherfuckin' thanks I get?\nI swear I ride through the city in a two-seater (yuh!)\nFo-Five on my hip, black wife beater\n\nAll I need is one mic, or a half a brick\nGimme a, half an hour I be on some shit (yeeeahhh)\nTrap stay boomin', yeah, we breeze through the packs (packs)\nThis rap shit easy, I just breeze through the tracks\n\nWhen you hot, ya hot, when ya not, ya not (not, ya not)\nProlly why them white boys keep rushin' the spot (yuh)\nAn errbody tellin me how nice I am\nBut I'm a real street nigga so ain't givin' a damn (uh uh)\n\nA day in the life, just another episode\nI'm in the streets like them lines in the middle of the road (aye)\nNew Lambo got the feds all curious (curious)\nSo you can stop watchin' me, I take this rap shit serious (yuh)\n\nSo why not stay in the studio for hours?\nWhen you can make same pay as you do wit powder (yuh)\nChi-town's lovin me, L.A.'s feelin' me\nThis clown keep talkin lil' nigga ya killin' me (ha ha)\nOr better yet, ya killin yaself (yup)\nFuckin' wit the big boys could be bad for ya health\nI take shit personal I'm so sincere\nLil' nigga talk at me so I'll end his career (ha ha)\n\nCatch me cruisin through the city in sum'n bout a buck-fitty (neeermm)\nTop down, iced out, won't na'an nigga fuck wit me\nAnd I was shinin' like this before my album dropped\nThat was right around the time that yo album flopped", "album": "4th Ward Day", "year": null, "image": "https://images.genius.com/5a5f84227541c5d1933ff7d2480faeaa.500x500x1.jpg"}], "artist": "Jeezy"}