{"songs": [{"image": "https://images.genius.com/3407e464b90665cb8b7267df3541d089.500x500x1.jpg", "title": "Be a Nigger Too (Remix)", "album": "The Nigger Tape", "year": "2008-06-09", "lyrics": "[Intro]\nTurn your radios up\nThe real niggas are back on the radio\n\n[Hook: Dante Hawkins (Nas)]\nThis is for my niggas, niggas, niggas\nThis is for my niggas, niggas, niggas (So I salute my \"Niggas!\")\nThis is for my niggas, niggas, niggas\nThis is for my niggas, niggas, niggas (So I salute)\n\n[Verse 1: Nas]\nUh, no slackin', no beggin', no askin', no fastin'\nNo disrespect to Islam, no Imam or Pastor\nNo answers to questions the media's askin'\nWhy we fight each other in public in front of these arrogant fascists?\nThey love it; puttin old niggas verse the youngest\nMost of our elders failed us, how could they judge us? Niggas\nThere's verbal books published by niggas, produced by niggas\nGenuine niggas, so I salute my niggas\nNot mad cause Eminem said nigga, cause he my nigga\nWigga, cracker, friend, we all black within, okay?\nWe all African, okay, some Africans don't like us no-way\nA killing happened in Johannesburg yesterday\nSlain artist named Lucky Dube, hijacked\nSome say N-double A-C-P, keep us sidetracked\nBut I don't buy that, I buy Aston Martins\nFaster cars than NAS-a-CARs and, sparkin while ridin\nCritics, eat a dick! Journalists see I'm rich\nWith this N-word jargon I'm just starting, bitch!\n\n[Hook: Dante Hawkins (Nas)]\nThis is for my niggas, niggas, niggas\nThis is for my niggas, niggas, niggas (So I salute my \"Niggas!\")\nThis is for my niggas, niggas, niggas\nThis is for my niggas, niggas, niggas (So I salute)\n\n[Verse 2: Nas]\nWake up in the morning, shake my third leg in the toilet\nUzi on the nightstand, I'm the man you go to war with\nNot the man you go to war against, patience, I'll get you\nIf that means I can't sleep a whole year, I'mma get you\nI'm official, not a-tisket or a-tasket\nI'll put you in the casket, with the biscuit or the ratchet\nThey smoke hibiscus, they plants or trees, advanc-ed weed\nDon't forsake us, you all are fake bloods like move make-up\nI flow tighter as Tootie's braces, who he hatin us?\nI be on a state bus in shackles if my .8 bust\nCause y'all some tellers, opposite of bankers\nI'm the shit for ages, my clique still real QB gangsters\nClique still movin' like Freemasons, so if I'm on the flow\nFrom the law, there's lodges all across the nation\nNas is bred for the plan\nTo hold the Grand Dragon's head in my hand\nCome and get me, here I am\n\n[Hook: Dante Hawkins (Nas)]\nThis is for my niggas, niggas, niggas\nThis is for my niggas, niggas, niggas (So I salute my \"Niggas!\")\nThis is for my niggas, niggas, niggas\nThis is for my niggas, niggas, niggas (So I salute my \"Niggas!\")"}], "artist": "Nas"}