{"songs": [{"year": "2018-12-21", "title": "​a lot", "image": "https://images.genius.com/fdf55cd3f0aaf3b48e1437d99bdfbcd1.1000x1000x1.jpg", "lyrics": "[Intro: 21 Savage]\nI love you\nTurn my headphone down a little bit, yeah\nFor so many reasons\nYeah, yeah, yeah, yeah, yeah, yeah (I do), yeah, yeah yeah yeah\nYeah, yeah, ah, ah, whoa, whoa, whoa, yeah\n\n[Pre-Chorus: 21 Savage]\nHow much money you got? (Straight up)\nHow much money you got? (Straight up)\nHow much money you got? (Straight up)\nHow much money you got? (A lot)\n\n[Chorus: 21 Savage]\nHow much money you got? (A lot)\nHow many problems you got? (A lot)\nHow many people done doubted you? (A lot)\nLeft you out to rot? (A lot)\nHow many pray that you flop? (A lot)\nHow many lawyers you got? (A lot)\nHow many times you got shot? (A lot)\nHow many niggas you shot? (A lot)\nHow many times did you ride? (A lot)\nHow many niggas done died? (A lot)\nHow many times did you cheat? (A lot)\nHow many times did you lie? (A lot)\nHow many times did she leave? (A lot)\nHow many times did she cry? (A lot)\nHow many chances she done gave you fuckin around with these thots? (A lot)\n\n[Verse 1: 21 Savage]\nEvery day that I'm alive, I’ma ride with the stick\nI'd rather be broke in jail than be dead and rich\nTold my brothers take my breath if I turn to a snitch\nBut I'm 21 4L, ain’t no way I'ma switch\n\n[Interlude]\nBreak it down, I break it down\nI break it down, I break it down\nI break it down, I break it down\nI break it down, I break it down\n\n[Verse 2: 21 Savage]\nPenitentiary chances just to make a couple bucks\nMy heart so cold I could put it in my cup\nGang vs. the world, me and my dawg, it was us\nThen you went and wrote a statement, and that really fucked me up\nMy brother lost his life and it turned me to a beast\nMy brother got life and it turned me to the streets\nI been through the storm and it turned me to a G\nBut the other side was sunny, I get paid to rap on beats\n\n[Chorus: 21 Savage]\nHow much money you got? (A lot)\nHow many problems you got? (A lot)\nHow many people done doubted you? (A lot)\nLeft you out to rot? (A lot)\nHow many pray that you flop? (A lot)\nHow many lawyers you got? (A lot)\nHow many times you got shot? (A lot)\nHow many niggas you shot? (A lot)\nHow many times did you ride? (A lot)\nHow many niggas done died? (A lot)\nHow many times did you cheat? (A lot)\nHow many times did you lie? (A lot)\nHow many times did she leave? (A lot)\nHow many times did she cry? (A lot)\nHow many chances she done gave you?\nFuck around with these thots (A lot)\n\n[Interlude: J. Cole]\nBreak it on down, I break it on down\nI break it on down, I break it on down\nYeah, I just came from the A\nI drove back home, six-hour drive, six-and-a-half\nBefore I left I stopped by to see my nigga 21 in the studio\nHe had two of his kids with him right in the studio, that's when I knew\nYou a stand up nigga, I love seein' shit like that\n\n[Verse 3: J. Cole]\nQuestion\nHow many faking they streams? (A lot)\nGetting they plays from machines? (A lot)\nI can see behind the smoke and mirrors\nNiggas ain't really big as they seem (Hmm)\nI never say anything (Nah), everybody got they thing (True)\nSome niggas make millions, other niggas make memes (Hmm)\nI'm on a money routine\nI don't want smoke, I want cream\nI don't want no more comparisons\nThis is a marathon and I’m aware\nI been playing it back from a lack of promotions\nI never was one for the bragging and boasting\nI guess I was hoping the music would speak for itself, but the people want everything else\nOkay, no problem, I’ll show up on everyone album\nYou know what the outcome will be\nI'm batting a thousand\nIt’s got to the point that these rappers don't even like rappin' with me\nFuck it 'cause my nigga 21 Savage just hit me\nAnd told me he saved me a spot on a new record he got\nHe call it \"a lot,\" I open my book and I jot\nPray for Tekashi, they want him to rot\nI picture him inside a cell on a cot\n’Flectin' on how he made it to the top\nWondering if it was worth it or not\nI pray for Markelle 'cause they fucked up his shot\nJust want you to know that you got it, my nigga\nThough I never met you, I know that you special\nAnd that the Lord blessed you, don't doubt it, my nigga\nDennis Smith, Jr., stay solid, my nigga\nI'm on a tangent, not how I planned it\nI had some fans that hopped and abandoned ship\nWhen they thought that I wasn't gone pan out, I got a plan\nThey say that success is the greatest revenge, tell all your friends\nCole on a mission, cementin' the spot as the greatest that did it\nBefore it all ends, nigga\n\n[Chorus: 21 Savage]\nHow much money you got? (A lot)\nHow many problems you got? (A lot)\nHow many people done doubted you? (A lot)\nLeft you out to rot? (A lot)\nHow many pray that you flop? (A lot)\nHow many lawyers you got? (A lot)\nHow many times you got shot? (A lot)\nHow many niggas you shot? (A lot)\nHow many times did you ride? (A lot)\nHow many niggas done died? (A lot)\nHow many times did you cheat? (A lot)\nHow many times did you lie? (A lot)\nHow many times did she leave? (A lot)\nHow many times did she cry? (A lot)\nHow many chances she done gave you?\nFuck around with these thots (A lot)\n\n[Outro]\nBreak it on down, I break it on down\nI break it on down, I break it on down\nI break it down, I break it down\nI break it down, I break it down\nI break it on down, I break it down\nI break it down, I break it down\nI break it down, I break it down\nI break it down, I break it down, I br-", "album": "i am﹥i was"}], "artist": "21 Savage"}