{"songs": [{"year": null, "album": "Kardi Gras Vol. 1: The Clash", "image": "https://images.genius.com/fc8095744814616ac0f10409c5c72099.640x640x1.jpg", "title": "That Chick Right There", "lyrics": "[Verse 1: Kardinal Offishall]\nPst, hey x3\nI ain't never seen terrible fold\nOne pretty little chick trying to run out through the back door\nSo I stepped to the left, puffed out the chest\nSo fly had to show her that S\nThat action, distraction, make this a chain reaction\nShe was more than a ten\nHer and her friends made their own money and had their own ends\nYeoah, Yeoahh\nCome here and let me show you, show your pretty face more than dough, d-dough\nYou stay here and let your girl go\nI don't mean, mean no harmin'\nI want to show you the Rude Boy charmin'\nGive me the signal I'm on it\nThat there body need wantin'\n\n[Chorus: Chaisson]\nYo that chick, she's fine\nAnd you know she's 'bout it\nAnd how she looks, she's mine\nShe's all I want and I need\nNo lie, I ain't wasting no time\nYou see no fooling around because\nHol' up, wait a minute\nThat chick, that chick right there [x8]\n\n[Verse 2: Kardinal Offishall]\nShe seem like a quiet girl\nYou know I don't buy it, not for a sec, on your mark, get set\nEverything you protect is out\nAnd I'm trynna see what you all about\nAre you a Gemini? Or a Leo?\nI'm a Taurus check out my ego\nA little famous, check out your te-vo\nWant to see a pretty gal go weeoh\nYo I'm on in good company\nAnd a quick check, let me put you in check\nCome erect when it comes to the sweat running down your neck from the DJ set (pull out pull out)\nBlonde, red head or brunette (pull out pull out)\nI see you rollin' it like roulette (pull out pull out)\nFrom the front view to the silhouette, you a threat\nEven now they boy in debt\n\n[Chorus: Chaisson]\n\n[Verse 3: Kardinal Offishall]\nShe a little off to the left\nSkirt showing all the goodies that she got left\nNow you off to the right\nWith about five guys following behind her all night\nShe comes them seems to the test\nThat seam cannot cover the breast\nHeart pumping like a twenty minute workout\nShe in control, keep Captain Kirk out\nSee the twerk that, see the body bounce\nYou know that she only dips when it really counts\nAnimal prints on all them garments, give me one touch I'm on it\n\n[Chorus: Chaisson]"}], "artist": "Kardinal Offishall"}