{"artist": "Yung Gravy", "songs": [{"album": "Sensational", "image": "https://images.genius.com/0e38e15ab88a2ee62e4bda7159fbfa06.600x600x1.jpg", "year": "2019-04-05", "lyrics": "[Intro]\nOh-oh-oh-oh\nOh-oh-oh-oh\nIt's Jason Rich, baby\nBum, bum, bum, bum, bum, bum, bum, bum\nOhh, baby\n\n[Chorus]\nGravy get near, your bitch disappear, I call that shit magic (Woah)\nShe was your B, now she with me, ain't that shit tragic? (Baby)\nGravy get close, you get comatose, that shit automatic (Woah)\nI'm castin' spells, you takin' L's, shit is fantastic\n\n[Post-Chorus]\nPull up on a bitch it get steamy\nThink I'm Houdini, lookin' like a genie (Ayy)\nGot that sauce, Fettuccine; Gravy so creamy, wrist so gleamy (Ayy)\nShit, I'm in it, eatin' that God damn spinach\nWit a bad bitch, she Finnish\nGravy get near, your career get finished\n\n[Verse 1]\nI'm like open sesame, now your bitch right next to me\nPipe up, that's my destiny, call that shit finnessery, baby\nOoh, that's a flex; do a little trick, now your bitch is your ex\nHeard my voice, now she tryna have s— (Woah)\nFlexin' ain't too complex, baby\n\n[Bridge]\nAlaka-fuckin'-zam\nI'm like, \"Bitch, who is your mans?\"\nAbracadabra with these hands\nHit yo' bitch with the shazam\n\n[Chorus]\nGravy get near, your bitch disappear, I call that shit magic (Woah)\nShe was your B, now she with me, ain't that shit tragic? (Baby)\nGravy get close, you get comatose, that shit automatic (Woah)\nI'm castin' spells, you takin' L's, shit is fantastic\n\n[Post-Chorus]\nPull up on a bitch and get steamy\nThink I'm Houdini, lookin' like a genie, baby\nGot that sauce, Tortellini; Gravy so creamy, wrist so gleamy (Ooh)\nShit, I'm in it, eatin' that God damn spinach\nWit a bad bitch, she Finnish\nGravy get near, your career get finished\n\n[Verse 2]\nI'm so sorry, that I had to end it\nGravy serve it up like I'm playin' fuckin' tennis\n2018, I'll be runnin' for the Senate\nGravy took your bitch, that's a fuckin' epidemic (Crazy)\nHit a bird call and your bitch come hither\nYour bitch hit my line and the goods get delivered\nPull up and I splash like a motherfuckin' river\nWrist so cold, make a grown man shiver\n\n[Outro]\nGravy get near, your bitch disappear, I call that shit magic (Woah)\nShe was your b, now she with me, ain't that shit tragic? (Baby)\nGravy get close, you get comatose, that shit automatic (Woah)\nI'm castin' spells, you takin' L's, shit is fantastic\nBum-bum-bum-bum, bum-bum-bum-bum", "title": "Magic"}]}