{"artist": "Beanie Sigel", "songs": [{"lyrics": "[Hook x2 James Blunt]\nAnd I see no bravery\nNo bravery, in your eyes\nOnly sadness\n\n[Verse 1: Beanie Sigel]\nDear self, can I talk to you?\nI been trying to have this conversation for years but you won't listen\nDamn, are you that plain ignorant? You're so indignant\nPlease come off that high chair your sitting in\nBefore you snatched from it, or strapped to it\nYa body used as a conduit, a thousand volts flow through you\nYa life gone over something foolish\nTalking to you is so useless\nYa heads harder than them walls you'll be housed in soon\nBefore ya body's embalmed and you lie in tomb\nOpen ya ears, eyes and heart, cause that hour's soon\nAnd the hour shall cometh, when Israfel blows his trumpets\nThe sky shall crack, the stars will plummet\nThe sun will rise in the West you'll drown in your own sweat\nAnd when that day shall be, I'll bet I'll see no bravery\n\n[Hook James Blunt]\n\n[Verse 2: Beanie Sigel]\nDear self can I talk to you?\nDear self can I talk to you?\n\nWho are you to lecture me? You question me about my life and the choices I made?\nHow dare you to place me in an early grave? (whoa)\nWhy you gotta talk to me in that fashion?\nYou bury me face down with an open casket, this whole world can kiss mine\nTell me what this life got to offer him\nA crooked preacher and a church alter?\nA short speech and a long offering?\nA deep grave and a short coffin?\nOh I get it... you righteous now (haha), well let the truth be told\nYou done smoked every blunt I rolled\nYou done drove every car I stole\nCooked up every crack I sold\nYou done slept with every trick I laid\nCollected off every bet I made [laughs]\nBut I guess you done found Christ, I ain't know he was missin (Whoa)\nWatch your Blasphemy\nMan I ain't asked to be\nJust let me live my life\nNow hold on - No you listen\nYou was there on every decision\nWhether it was right or wrong\nAnd now you trying to right my wrongs\nYou got some nerve - you even give me the words I write in this song\nYou see, my vision's much clearer\nIt's not me but it's you that I see when I look in the mirror\nAnd you call yourself saving me?\nBut it's through your eyes that I see, No bravery", "image": "https://images.genius.com/356ca6b0db6d8d8b7be50568bdfb53c0.700x695x1.jpg", "year": null, "title": "Dear Self (Can I Talk To You)", "album": "The Solution"}]}