{"artist": "YNW Melly", "songs": [{"image": "https://images.genius.com/077f633f603d1257f475e91f551b152e.1000x1000x1.jpg", "year": "2019-01-18", "album": "We All Shine", "lyrics": "[Chorus]\nI ain't tryna get in my feelings, but damn (But damn)\nWhat's goin' on, bro? I thought you was fam (Was fam)\nAnd you mad at me about a bitch Instagram (Like damn)\nGot me like, \"What the fuck wrong with him?\"\n\n[Verse 1]\nTryna beef over some pussy, that's funny (That's funny)\nCan't believe this ho made you her crash dummy\nThe way you act, that ho pussy better be squirtin' out money\nPlatinum diamond, VVS' payin' taxes or somethin'\nBut it's okay, I understand, you just couldn't keep it a hunnid\nWhile you locked up somebody else shovin' that dick in her stomach\nI can't be beefin' bout these bitches, bruh, this shit gettin' old\nKnowin' that pussy stainless steel, but yet you treat it like gold\nThey been showin' me that these niggas ain't real (Ain't real, fuck nigga)\nGet caught up with that time, they gon' squeal (Gon' squeal)\nThese bitches ain't shit, these niggas ain't real (Ain't real)\nKeep playin', your ass fuck 'round and get killed\nWhat's goin' on, bro, I heard you been trippin' (Was trippin')\nI thought you kept it real from beginnin'\nUntil I heard that track you made and I came to some suspicions\nI can't believe to my surprise, one of my woadies sneak dissin'\n\n[Bridge]\nYeah, you turned cold, I can't fuck with you\nIt's like that Molly done turned you into a fuck nigga\nHold up, wait, bro, pose for the picture\nYou officially have been framed as a fuck nigga\nAnd that's truth, this... ain't fuckin' with you at all\nAnd Lil Baby snapped, but this fuck nigga ain't my dawg\nThat ain't my dawg no more\nThat ain't my dawg (No)\nThat ain't my dawg no more (Nah)\n\n[Chorus]\nI ain't tryna get in my feelings, but damn (But damn)\nWhat's goin' on, bro? I thought you was fam (Was fam)\nAnd you mad at me about a bitch Instagram (Like damn)\nGot me like, \"What the fuck wrong with—\"\n\n[Verse 2]\nI can't be fuckin' with none of these niggas\n'Cause all of these niggas be actin' like bitches\nYou know that I'm straight out of Indian River\nI don't give no fuck about none of these niggas\nWe just tryna run up this mothafuckin' skrilla\nAll of my niggas, they really some killers\nSee you a pussy, I used to fuck with you\nBut then you turned cold on me, nigga what's up?\nI cannot go, oh, oh like that (I can't go like that)\nCan't believe you switched up like a ho like that\nLike bruh, I know you ain't got many hoes like that\nI would have let you have the bitch\nI would have let you smash the bitch\nI don't give a fuck, nigga (What?)\n'Cause you're still a fuck nigga (What?)\nAnd that time you let me hold your pistol\nYou should have bucked, nigga\nWait, I should've bucked you, nigga\nBut now I'm feelin' like fuck you, nigga (Fuck you)\nAnd if this chopper ever catch you, it's hungry\nIt eat your bitch ass up for supper, nigga (Yum, yum, yum, yum)\nSometimes I wake up and I be in my feelings all night\nSometimes tell that I was reminiscin'\nAll of these bitches, they wasn't even missin' me\nNow they all on me and they tryna kiss me\nI thought that we were 51-50, but you could never be with us\nThese niggas claim they fuck with us, but really be the enemy\n\n[Chorus]\nI ain't tryna get in my feelings, but damn (But damn)\nWhat's goin' on, bro? I thought you was fam (Was fam)\nAnd you mad at me about a bitch Instagram (Like damn)\nGot me like, \"What the fuck wrong with him?\"\n\n[Outro]\nTryna beef over some pussy, that's funny (That's funny)\nCan't believe this ho made you her crash dummy\nThe way you act, that ho pussy better be squirtin' out money\nPlatinum diamond, VVS' payin' taxes or somethin'\nBut it's okay, I understand, you just couldn't keep it a hunnid\nAnd you just couldn't keep it a hunnid", "title": "No More"}]}