{"songs": [{"title": "Anger Management", "album": "Rehab: The Overdose", "year": "2011-01-11", "image": "https://images.genius.com/f4cd18c738c90184c647f29ea90867c6.540x540x1.jpg", "lyrics": "[Intro: Lecrae]\nAye, what if\nWhat if we all need anger management?\nWhy don't we just\nTreat this song like a, an anger management class?\nYou feel me?\n\n[Hook: Thi'sl & Lecrae]\nI'm angry, and I don't really care what they say\nI'm angry, nobody better get in my way\nI'm angry, I'm fighting, I'm busting, I'm poppin'\nI'm caught up in a rage, man somebody better stop me\nI'm angry, I'm hating, I'm pushing, I'm shoving\nSomebody better get me cos I'm 'bout to do something\nI'm angry\n\n[Verse 1: Lecrae]\nBeen up all night, Got me feeling weak\nNo sleep on the first day of a long week\nI guess I'm still in school,These people testing me\nBut disrespecting me I will respond aggressively\nA long day short fuse in the worst mood\nMy temper red hot I will get these boys blues\nHard livin got me feelin very selfish\nCrab in a bucket tryin' crush these other shellfish\nForget the chip upon my shoulder man I carry boulders\nI don't know how to control them when they get to rollin'\nWhen people pop off at the mouth I try to keep the cool\nBut all I wanna do is fix 'em, troubleshoot\nYeah they say I'm wrong if this carries on\nThe faith I claim to have I'll probably never own\nEmpty waiting pool running out of patience\nThis is anger management get me another agent\n\n[Hook]\n\n[Verse 2: Thi'sl]\nI'm angry every morning before I get up off the bed\nThis dog keep on barkin I'mma bust em in the head\nUncle keep on trippin if he want to he can get it too\nAnybody say another word I'mma act the fool\nI hit the dough, push my fitted to the side\nHeart full of pride, anger in my eyes\nBeen this way since the day I seen my homie die\nNow I'm mad at the world and I hate that I'm alive\nReally hate to say it cos it's killing me inside\nAll I wanna be is loved and it's eating me alive\nDon't nobody love me man my momma and my daddy don't\nMy uncle ain't my uncle cos I'm living in a foster home\nI say I'm saved but I'm scared of the truth\nCus I read Galatians 5 and I didn't see the fruit\nI don't know what else to do, I don't know what else to say\nSo I hit my knees and pray, God take this thing away\n\n[Hook]\nI'm angry, and I don't really care what they say\nI'm angry, nobody better get in my way\nI'm angry, I'm fighting, I'm bustin, I'm poppin\nI'm caught up in a rage, man somebody better stop me\nI'm angry, I'm hating, I'm pushing, I'm shoving\nSomebody better get me cos I'm 'bout to do something\nI'm angry\n\n[Verse 3]\nI would die for my respect\nBut I got no humility\nAnd Jesus paid my debt while\nI reject him willingly\nMan I got some nerve\nHolding anger in my heart\nThe Father could have come serve me that beef up A La Carte\nNot to mention torture, Jesus took all my misfortune\nI’ve been freed from the Law, but I'm serving these court orders\nUnforgiveness is my pedigree, you say you’re sorry better be\nBetter bein' mad at you, than try'na be a better me\nAin't nothin' in my workin' tryna demonstrate His worth\nAnd though He show me plenty grace, I don't extend to other persons\nAnd that anger led to murder\nWhen you pull up on that murder scene\nIt's Jesus nailed upon that cross, yeah the murderer was me\n\n[Outro]\n1 Peter 2:23 man, when they used to hurl insults at Jesus, He didn't retaliate\nHe entrusted Himself to the One that judges justly. The gospel manages our anger, ya feel me? The solution is to gain a heart that's thankful for grace in Jesus Christ!"}], "artist": "Lecrae"}