{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/3067c302983abed2fb91504570362e92.640x640x1.jpg", "title": "Every Year", "year": null, "album": "The Cleveland Show", "lyrics": "[Verse 1: Chip]\nI woke up, yes, I woke up\nThank god I woke up\nI didn't have to woke up\nI woke up your bitch and told her roll up coffee\nAnd hopped up in the shower, washed yesterday off me\nThen hopped out the bathroom, threw on the polo\nFew sticks of diesel got my morning in slo-mo\nBut that's how I like it, taking it easy\nReally ain't no need for all the energy, you can save it\nMatter fact, you can replace it\nThis shit is great, nah this shit amazing\nWe on the freeway, smokin' and leanin'\nWe ridin' dirty so no need for speedin'\nOn the turnpike to whichever city we pull up\nDon't be surprised if I'm in your hood like \"what up?\"\nI'll be in chicago like what\n(?) full of sluts, south side with ya chutch\nWith GL in the CL, bendin' through the community\nGun shots, ciroc, same shit I usually see\nHell yeah, real niggas every year\nNiggas hustle where I live, swish rips every year\n\n[Hook]\nYeah\nNiggas gettin' money 'round here\nNiggas hustle where I live\nSwish rips every year\nYeah\nNiggas gettin' money 'round here\nNiggas hustle where I live\nSwish rips every year\n\n[Verse 2]\nNow listen up, no need to act stiff\nToo fresh, under arrest\nI plead the sax fifth\nLet them packs flip\nFuck them other niggas get dumb rich\nGrip the grain til the polish fade off that son'bitch\nCash rules, I know some seven deadly sinners\nWho be shining every summer cause they grinding every winter\nGet paid, my nigga, they don't like when I stunt\nFuck a soundcheck bro, just come and mic the fuck up\nPut your hands up high if you a stand up guy\nAnd is there any bad bitches in the spot tonight?\nI'm pretty high, liquor party with my nigga Cudi\nI'm just looking for a bad chick with a little money\nAnd he just wanna high class chick who ain't slutty\nI'll be ducked off them hoes be looking for me\nIncognegro, sipping on mojito, money go every where we go\nWe ain't poor!\n\n[Hook]\nYeah\nNiggas gettin' money 'round here\nNiggas hustle where I live\nSwish rips every year\nYeah\nNiggas gettin' money 'round here\nNiggas hustle where I live\nSwish rips every year\nYeah\nNiggas gettin' money 'round here\nNiggas hustle where I live\nSwish rips every year\nYeah\nNiggas gettin' money 'round here\nNiggas hustle where I live\nSwish rips every year"}]}