{"artist": "50 Cent", "songs": [{"album": "The Lost Tape", "image": "https://images.genius.com/ec16b41f3ee318d52d31bf3312db8b9c.1000x1000x1.jpg", "title": "All His Love", "lyrics": "[Hook]\nHe gonna give you all his love\nHe gonna give you all his time\nHe won't let a minute go by\nWithout the thought of you crossing his mind\nI be like fuck a bitch, I'm trying to stay rich\nI'm trying to concentrate on hoes\nEven if I fuck that bitch do the freakiest shit\nBy the mornin, I got the go\n\n[Verse 1]\nYeah, I got all kind of bitches, a vet bitch, a beginner bitch\nMy phone ringing and I ain't answering cause I'm in a bitch\nI'm more like a pimp than a trick, I send a bitch\n50's and lead escorts, call me the runner bitch\nIf we going out we going Dutch pay for your dinner bitch\nLook bitch, this is my life I'm on some different shit\nEvery different day I wake up to play with a different bitch\nBitches love me, just like I love me\nFat bitch, skinny bitch, short bitch, tall bitch\nYou wanna buy me shit, meet me at the mall bitch\nIn the strip club, let her lick your ass bitch\nGet the cash bitch and then go back to your man bitch\n\n[Hook]\n\n[Verse 2]\nI got a ghetto bitch, a good bitch, a certified hood bitch\nShe with me to do the to the end, bitch fuck me and her friend\nI said I'm headed to the top bitch I'm trying to get it all\nA real bitch will be there for a nigga if he fall\nThe club pack front to the back up in this bitch\nGot on my Louie checkers grey and black up in this bitch\nDiamonds on my neck, diamonds, diamonds on my neck\nBitch niggas front if you want, we got swimmers on deck\nGet your ass hit over a bitch\nThe bitch ain't shit she in a porno clip with a bitch\nShe can't suck dick but damn nigga use your head\nShe gonna find another dick to suck when you're dead\n\n[Hook]\n\n[Outro]\nWest side\nThis that shit right here!\nFeel like it's supposed to be on that Detox!\nYeah\nNiggas think they're better than me, but they're not!\nFuck that! I'm just gonna start over\nSo we gonna act like I ain't been that nigga for 8 years\nAnd I'm a new nigga! Call me Ferrari! GGGGGG-UNNNIIIT!", "year": "2012-01-01"}]}