{"songs": [{"image": "https://images.genius.com/d33b436f964a5b9c4b66f58542fe964c.1000x1000x1.jpg", "title": "Chun-Li", "album": "Queen (Bonus Version)", "year": "2018-04-12", "lyrics": "[Verse 1]\nAyo, look like I'm goin' for a swim\nDunked on 'em, now I'm swingin' off the rim\nBitch ain't comin' off the bench\nWhile I'm comin' off the court fully drenched\nHere go some haterade, get ya thirst quenched\nStyled on 'em in this Burberry trench\nThese birds copy every word, every inch\nBut gang gang got the hammer and the wrench (Brrr)\nI pull up in that quarter milli off the lot\nOh, now she tryna be friends like I forgot\nShow off my diamonds like I'm signed by the Roc (By the rock)\nAin't pushin' out his babies 'til he buy the rock\n\n[Chorus]\nAyo, I been on, bitch, you been corn\nBentley tints on, Fendi prints on\nI mean I been Storm, X-Men been formed\nHe keep on dialin' Nicki like the Prince song\nI-I-I been on, bitch, you been corn\nBentley tints on, Fendi prints on\nAyo, I been north, Lara been Croft\nPlates say Chun-Li, drop the Benz off\n\n[Interlude 1]\nOh, I get it, huh, they paintin' me out to be the bad guy\nWell it's the last time you gonna see a bad guy do the rap game like me\n\n[Verse 2]\nI went and copped the chopsticks, put it in my bun just to pop shit\nI'm always in the top shit, box seats, bitch, fuck the gossip\nHow many of them coulda did it with finesse?\nNow everybody like, \"She really is the best\"\nYou play checkers, couldn't beat me playin' chess\nNow I'm about to turn around and beat my chest\nBitch, it's King Kong, yes, it's King Kong\nBitch, it's King Kong, this is King Kong\nChinese ink on, Siamese links on\nCall me 2 Chainz, name go ding dong\nBitch, it's King Kong, yes, I'm King Kong\nThis is King Kong? Yes, Miss King Kong\nIn my kingdom wit' my Timbs on\nHow many championships? What? Six rings on\n\n[Interlude 2]\nThey need rappers like me\nThey need rappers like me\nSo they can get on their fucking keyboards\nAnd make me the bad guy, Chun-Li\n\n[Chorus]\nAyo, I been on, bitch, you been corn\nBentley tints on, Fendi prints on\nI mean I been Storm, X-Men been formed\nHe keep on dialin' Nicki like the Prince song\nI-I-I been on, bitch, you been corn\nBentley tints on, Fendi prints on\nAyo, I been north, Lara been Croft\nPlates say Chun-Li, drop the Benz off\n\n[Outro]\nI come alive, I, I'm always sky high\nDesigner thigh highs, it's my lifestyle\nI come alive, I, I'm always sky high\nDesigner thigh highs, it's my lifestyle\nI need a Mai Tai, so fuckin' sci-fi\nGive me the password to the fuckin' wifi"}], "artist": "Nicki Minaj"}