{"artist": "Young Thug", "songs": [{"year": "2014-09-29", "lyrics": "[Intro]\nOoh\n730, 730\nOoh\n730, brazy brazy\nGet with me bro\nWe got London on da Track\n\n[Verse 1]\nThese niggas ain't loyal they ridin' with royal\nHe play I'mma leave him on fire, boil\nI'ma, I'ma, I'ma stunt the lil baby, yeah, spoiled\nFuck nigga cannot be blood, he might as well be royal, blue\nShoot up the coupe\nPull up in Audi's the carbon will smoke the fuck nigga like Snoop\nRichie pass Thugga the boot, take off like a troop\nBloods are with me back in 21 gun salute\nEverything come out your mouth is a fairy, no tooth\nIPhones and Blackberries when I pull up and serve you\nI might get gangster pull up to the set and murk too\nNine racks inside of my pockets same size as my shoes, damn\nStill got yams, ya'll got grams\nI fuck ma'ams, y'all fuck grams\nWhoa, why so harsh?\nWhy so dark?\nI got lotsa white, Bubba Sparxxx\nKnow your bang royal, high as Sequoia (whoa)\nI got loaded, now I don't know you\nBitch I'm slime, king cobra (slime)\nI drink sodas, no coke cola\n\n[Hook]\n(chee, chee) 730 (chee, chee) 730\n(chee, chee) 730 (chee, chee) 730 (730!)\n(chee, chee) 730 (730!)\n(woo!) 730 (brazy brazy)\n730 (go brazy, go brazy)\nI go, 730 (brazy)\nI go, 730 (ooh I'm going brazy)\n730, 730 (hey), 730\n\n[Post-Hook]\nI go 730 when I get the birdies\nWhen I go 730 do not get discouraged (go brazy, go brazy)\nI go 730 even if you nerdy\nI might go 730 if it's too perfect (go brazy, go brazy)\n\n[Verse 2]\nSlime these lil bitches, I slime these lil niggas\nI slime em, I slime em, I slime em all\nI'mma still slime your ass out if its not percocets its just tylenol\nI'mma slime your ass all by myself, I do not need no help at all (on blood)\nBitches and niggas gonna come and gonna go and I know how to deal with ya'll (on blood)\nCome and enroll to the YSL school and I swear I'm the principal (slime)\nI do not care if you start from a dollar, it changes the principle (slime)\nSend a lil bitch inside the boy trap, slime him for his utensils (slime)\nAnd bring it back\nSlatt, slatt, slatt, whoa\n\n[Hook]\n(chee, chee) 730 (chee, chee) 730\n(chee, chee) 730 (chee, chee) 730 (730!)\n(chee, chee) 730 (730!)\n(woo!) 730 (brazy brazy)\n730 (go brazy, go brazy)\nI go, 730 (brazy)\nI go, 730 (ooh I'm going brazy)\n730, 730 (hey), 730\n\n[Outro]\nCall up them crips and they goin' 630\nCall up them bloods and they goin' 730\nCall up them slimes and they goin' 730\nCall up Rich Gang and they goin' 730\nCall BMG and they goin' 730\nCall YSL and they goin' 730\n1,2,3,4,5,6, I go 730\nCall up my crip partners, they goin' six-30 (woo!)\nThey go bix-30\nPussy nigga thirsty", "image": "https://images.genius.com/07e1a913522c1d895f518d7ebf9ad7f0.640x640x1.jpg", "album": "Rich Gang: Tha Tour Pt. 1", "title": "730"}]}