{"songs": [{"year": null, "title": "Bent", "image": "https://images.genius.com/32dac835a69d095e96fcbbc2afb2d6e6.1000x1000x1.jpg", "lyrics": "Artist: Saafir the Saucee Nomad\nAlbum: Boxcar Sessions\nSong: Bent\n\nI've been down this corridor -\nBefore you enter you have to bring\nBack the creator of winter damn\nToo late I'm spoiled, I need the napalm\nI got it, I shot it in my left sector\nBlew up the timing device on the reactor\nTime shifted I had to remold the floor\nThe foundation for creation - mate's blend\nThe pleasure dome into another roam -\nA walk stalked nightly by the ogre\nThat's rarely sober. But there's no tracin\nI see the place in the flow. I'm beyond dawn\nNo I'm not in the lawn under pawns -\nDon't rest, never possessed stagnate magnets\nI never pulled slits lips wit no braille skilled eyes -\nBalls through eyesockets. I'm currently current\nCurrents of electricity; They can't get wit me\nInvisible to the retina half - way reality part limbo\nA nervous laugh while ya climbin through windows\nNever spin ho's on merry-go-rounds\nBe the ground level for ghouls, schools of fish\nVictims on a hit list me like Geronimo on a pratt -\nTackle patt tacklin patterns addin in seasonings, flavor\nNo false teeth for beef, catapulting fingers to light\nSwitches so you can see the real, I feel the tension\nMy sight twitches - I'm bent\n\nSecond Scene: I'm the star in a step show\nAround corners, the coroner's office;\nWhere my rep grows. I'm on some sort of drug\nLike the President, it's evident that I'm noid\nA little bit of pizza - the riddle gets deeper\nI'm lookin for outs n ins, stolen isotonas\nThe gloves, the bout begins three jabs on a transport\nIt's a sport for me to take another life on landing\nBranding wit a prattle prod designed by God\nIt's my job to resign frauds\nThe odd is against you got a degree in me\nSo I know that I flow, credentials are essential -\nIt's blasphemy the type of shit they be askin me\nI don't feel the vibe, abstract art the veal\nDoesn't heal this deprived stomach from a plummet\nSwinging on a duet with the bullet\nI never pull out for suspense - I'm on a bent mission\n\nJack Cousteau couldn't take it no deeper -\nI'm a resident in Davey Jones micro-locker\nHolds the phone, foamin at the mouth:\nMad Dog, a taste, never had hog I'm droppin\nThe scrooge, makin fools hit the log - axe it\nI seen it beneath where the cowards hope\nTrembled sleeper see if you can find the lost\nTreasure through measures in bars - I'm bent", "album": "Boxcar Sessions"}], "artist": "Saafir"}