{"songs": [{"album": "Out the Gate", "image": "https://images.genius.com/fb8fd2499219f912bd3c07c3a8b03ad5.500x500x1.jpg", "year": null, "title": "When We Were Kids", "lyrics": "[Termanology & Akrobatik talking]\n\n[A]Hahahha what up Term-ti-term-term\n[T]What up Ak. How you feeling man?\n[A]Aight\n[T]So what's on your mind brother?\n[A]I was just thinking back to. Back when cats was younger\nYou know I'm a little older than you and shit, but\n[T]Couple of years\n[A]That back in the days type of shit, shit was different man\n[T]Yeah, yo I was born in the 80's man, shit was crazy man\n[A]Yeah, it's just like it was a whole different point of view\nA whole different perspective. Let me build on this with you, son\n[T]Word up spit that shit\n\n[Akrobatik}\n\nThinking back to 88, the memories will live on\nThe box of cereal and wrestling every saturday morn'\nI remember one day I was mowing grandpa's lawn\nI had the radio outside; \"You Got's To Chill\" came on\nI used to run home from school for Rap City at three\nBut now they only give the shorties ass and titties to see\nMy homegirl said: \"These rappers now-a-days is prettier than me\"\nWhatever happened to days of Tribe and BDP\nWe used to get up and run to the basketball court\nBut now with everybody high NBA Live\nIs the closest thing we gettin' to sports\nThese girls are 14 years old in they coochie cutter shorts\nIt's innosence is lost\nBut some things are still the same though, keepin' a nigga raw\nChris is still rippin' Rick Flair still gotta the figured form\nLet's take it back to the essence\nSo that the next generation could be happy with the presence\n\n[Hook: Jordan & Termanology]\n\n[J]Ain't like it used to be - (Ain't like it used to be)\nWhen we were kids\n[T]The 80's is crazy for the babies\nAnd now-a-days these little shorties amaze me\n[J]Ain't like it used to be - (Ain't like it used to be)\nWhen we were kids\n\n[Scartches]\n\n\"Back in the day when I was younger\" \t\t\"Remember\"\n\"Back in the days\"\n\n[Termanology]\n\nWay back, when Anni used to sit with us and talk\nAnd we was poor, so we used to take the bus or walk\nMy mom schooled me, not to ever touch the rock\nTouch the white, or cook cocaine in a pot\nListening to Pac, me and my brothers would box\nAnd write graffiti on the ground with the coloring chalk\nMy brother was taught, never hang with them gangs\nCuz when them things bang, you can lay in a box\nTake care what you rock, just for sayin' your not\nFrom another side of town, and the colors you rock\nCould your crib shot up, like your mother is not\nSound a sleep with hoax like the government got\nI suddenly thought; look how much the world changed\nAnd life in general, dark nights and cold days\nSittin' in hallway's listening to old J's\nThinking of the old days, like P i reminice\n\n[Hook: Jordan & Termanology]\n\n[J]Ain't like it used to be - (Ain't like it used to be)\nWhen we were kids\n[T]The 80's is crazy for the babies\nAnd now-a-days these little shorties amaze me\n[J]Ain't like it used to be - (Ain't like it used to be)\nWhen we were kids\n\n[Scartches]\n\n\"Back in the day when I was younger\"\n\"Back in the days\"\t\t \t\t\"Remember\""}], "artist": "Termanology"}