{"songs": [{"year": null, "title": "I Keep Calling", "image": "https://images.genius.com/8b24619eca032daebf0caa5c44aa746d.512x341x1.jpg", "lyrics": "AUTHOR: Sage Francis\n\nChorus\n\nIntro:\n\nPick up, Pick up...Pick up, Pick up...\n\nVerse One:\nNow I can't even think back. Self-induced amnesia has made its impact /\nMental health produced at leisure was frayed once it was intact /\nI voluntarily refuse to remenisce /\nIf I could choose any wish...I'd lose my genesis /\nAnd prove to my nemesis that I don't need Memory Lane on my way home /\nBut I got lost and I needed a pay phone /\nBecause I was in an unsafe zone...inside of a place unknown /\nWhere unfamilliar faces roam (...and it's so strange)... /\nI've got no change...I could've sworn that I did when I left /\nMy breath gets heavy with every lie and theft /\nI looked right and left...then I called people at my home collect /\nTo tell them, \"Things changed.\" But they just won't accept /\nI'm out of range...with no respect. Every time I asked for directions /\nAll I got was dead air, cut lines, and bad connections /\nPeople who would help changed their number to unlisted /\n411 info left me unassisted. Wickedly twisted... /\nIncidents. Is it coincidence? I choose to think so /\nDeep in thought, my eyes blink slow. Pictures appear like slide shows /\nMy mind knows each and every single detail /\nTotal recall is leaving me pale /\nSick to my stomach...nautious...forces of nature bring my homing instinct /\nIts stink...is so distinct...now let me think...a minute /\nEpiphany: This is the much traveled trail from my past /\nNow an unbeaten path...unfunny memories are now making me laugh\n\nChorus\n\nVerse Two:\nHaaaaaa! The flashbacks of my past acts are numerous /\nSince out the uterus...Earth encounters ain't been that humerous /\nHeheheheh...my laugh lines have been faked for the last time /\nI'm past my prime. Climaxing again is a task of mine /\nI'm homeward bound. Break out the map and atlas /\nI ask gas station attendants...and they just act pissed /\nI'm black listed...for not staying true to white lies /\nI fight lies...in darkness...heartless...until the night dies /\nThen I shed some light on what's the matter /\nReflections in the looking glass self scatter when the hard stares make it shatter /\n7 years bad luck? Time's irrelevant /\nI'm searching for signs of intelligent minds, but find the element /\nWhich blinds what the hell I think. Now I'm thinking... /\n\"What time is it?\" I see the 12:00 blinking /\nCheck the position...of the sun...to see there is none /\nI figure there's an eclipse...so I look away to save my wisdom /\nThe solar system left me stranded in a universe /\nWhere I do reverse psychology. Apologies are made through my verse /\nAin't nothing to do but curse when I'm frustrated /\nMaking people disgusted. Plus, I'm mistrusted and hated /\nThat's an understatement, but who really cares about my failure years? /\nI'm on an expedition...following my trail of tears /\nFrom when I cried, but...it dried up...and vaporized /\nI played your game, so where's my consalation prize? I'm taking lies /\nFrom faking guys...and gals...who want to be my pals...and peers /\nAt this here pace, it'll take me a thousand years /\nTo fins my way back...encompassing what they lack /\nIt cost me most of my life, but still I'm thinking about a pay back /\nDecapitated...I lost my head, and fear is activated /\nI'm in a fog. My blood, sweat and tears evaporated /\nI back track to find my lost sense of direction /\nStop, look, and listen...before I cross the intersection /\nThere's much construction. I'm signaled with morse code /\nTo take a detour. Somehow I end up on an off road /\nI squint my eyes...trying to find some street signs /\nI can only read strong thoughts. These people have weak minds /\nTrapped in a desert that to me looks like a sandbox /\nWith damn NARCS...hold up, son...I'm noticing some landmarks /\nI rack my brain...knowing that I can't attack in vane /\nUpon return I promised myself not to act the same /\nBut every so often my selective screen memory...will be my enemy /\nMetamorphasize and say, \"Remember me?\" /\nGetting me petro...wish I could kill the retro /\nBut heck no...to much of my past I just can't let go /\nI'm just a stone's throw away from my home turf...which really is this whole earth /\nBut claims like that have no worth /\nEpiphany: And then it hits me...the reason why I'm dizzy /\nIs because I've been traveling in circles keeping myself busy\n(Where is he?)\n\nChorus\n\nOutro:\n\nDeejay Perseus drumming", "album": null}], "artist": "Sage Francis"}