{"songs": [{"image": "https://images.genius.com/f5c5d75e5a52f8df5fa4820d6ec6dfc9.550x550x1.jpg", "year": "2014-05-01", "lyrics": "[Intro]\nGentlemen, we can rebuild him\nWe have the technology\nI can't feel anything\n\n[Verse 1: Akrobatik]\nIt started as the first steps towards a man’s endin’\nAn ended up being more like Johnny Depp in Transcendence\nThe numbness, how did I become this\nWill anybody learn anything from this\nWe’ve all felt like a shell of a man\nBut imagine a man without a shell – that’s a livin’ hell\nVirtual prison cell murdered my existence\nOr is it preserving my existence\nI can’t feel but this is colder than the worst December\nI’m like that Captain America flick, the First Avenger\nMind’s intact, but yet and still it hurts to remember\nWhere’s my home? Did it burst into embers\nWhat about my loved ones? Are they gone forever\nDid we take our last road trip singin’ silly songs together\nWho’s in charge here? Who do I talk to\nWhat kind of time portal did I walk through\nSomebody tell me where am I\n\n[Cuts]\nWhere Ya at?\nI black out and wake up to catastrophe\n\nWhere Am I?\n\n[Verse 2: Mr. Lif]\nYo, Ak - You have questions a many. your mind's in a frenzy\nHold up for a moment - calm down, let me tell thee\nYou are you in the truest form\nJust with no human form - nowadays, human ain't the norm\nYour body would roast, the sun is too close\nWith new types of bacterias, our bodies fell host\nIt's 80 years beyond when you've last yawned\nYou missed the earth splitters and the winters with the nuclear dawns\nAk, it's me Lif - I stored your consciousness on a disk\nI'm leader of a team of scientists\nConsidered unethical or ill-advised, but we're alive\nPlease Don't cry with virtual eyes\nBut visualize the new body you'll have soon\nThat we've built, powered by the light of 2 moons\nWith new alloys that I found in Beloize\nA new planet that's arisen since earth became void\nFree yourself from the who and how\nDon't grasp at the past, your path begins now\nYour question haunts me every now and again\nAs I look into the sky and see a mountain of flame\nWhere Am I\n\n[Cuts]\nWhere Ya at?\nI black out and wake up to catastrophe\n\nWhere Am I?", "title": "Where Am I?", "album": "Built To Last "}], "artist": "Akrobatik"}