{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/3067c302983abed2fb91504570362e92.640x640x1.jpg", "title": "Owe You", "year": null, "album": "The Cleveland Show", "lyrics": "[Verse 1]\nCheck\nYou can catch me down in Santa Monica with Veronica Kim and Monica\nHoping that one of them play me like I'm a harmonica\nLong as they don't ask for nothing we won't have no problem bruh\nI'mma just pull some tree and then go hit your college up\nFitted to the max yes, I get total access\nWe coppin' all these asses, my girl look like a actress\nShe realer than you ever been, fuck who you said you better than\nThat shit you kick irrelevant, call me the benevolent\nDef spot, the rest not, fucking with this nigga from the CL who added [?] to be\nFuck these other niggas cause, when you poppin' niggas run at you like it's a track meet\nSome trying to get money some just do it for they rap sheet\nTo just to say I fuck with that nigga to build they brand up\nMake your own lane nigga stand up\nMy shit originated from the hood where it's supposed to\nWhy you niggers coming at me funny like I owe you?\nNiggas where was you at when we was killin' shit?\nThey don't want to hustle, they just wanna reap the benefits\nNiggers coming out the woodwork, that shit be so true\nMy status got them looking at me jealous when I roll through\n\n[Hook]\nOwe you? Owe you? Nigga what I owe you?\nOwe you? Owe you? Nigga do I know you?\nOwe you? Owe you? Nigga what I owe you?\nWhere was you at when we was killin' shit on the road dude?\n\nOwe you? Owe you? Nigga what I owe you?\nOwe you? Owe you? Nigga do I know you?\nOwe you? Owe you? Nigga what I owe you?\n\nNigga what I owe you\n\n[Verse 2]\nYou can catch me down on ocean drive posted up chillin' out with my partners\nCrack a shelly twist one up and then dip back over the columns\nGot a problem, I'm addicted to tats and wonderful reefer\nWant some pounds?\nJust have one of my gangster bitches meet you and\nThey don't play around nigga, they 'a lay you down\nEvery dime toting seventeen rounds for you clowns\nKeep the peace, keep the peace, I keep my eyes underneath\nWhen I ride through the streets\nSome niggers want us deceased\nCause we doing everything they wish they could do\nBut I just got this all from doing everything you should do\nHeaded to Detroit blazing tree until I'm brainless\nBout to fuck with Finally Famous we lions don't try to tame us\nWe grindin' we get this paper, we flying to other places\nFlyer we makin' statements so why is you niggers hatin'?\nThey 'posed to, and when I speak it so true\nMy status got them looking at me jealous when I roll through\n\n[Hook]\nOwe you? Owe you? Nigga what I owe you?\nOwe you? Owe you? Nigga do I know you?\nOwe you? Owe you? Nigga what I owe you?\nWhere was you at when we was killin' shit on the road dude?\n\nOwe you? Owe you? Nigga what I owe you?\nOwe you? Owe you? Nigga do I know you?\nOwe you? Owe you? Nigga what I owe you\n\nNigga what I owe you"}]}