{"artist": "Fat Joe", "songs": [{"year": "2002-11-12", "album": "Loyalty", "image": "https://images.genius.com/334c85de50c53fc4f55c9f3af9218739.800x800x1.jpg", "lyrics": "[Intro - Fat Joe] - *Lamajic talks & harmonizes in background*\nYeah, it's time baby\nIt's time to speak the truth, maturity\nHuh, niggas gotta evolve to let niggas know the real\nYa call yourself real, ya gotta start speakin about the real\nThis is Joe Crack The Don, and this is what I'm bringin to you\n\n[Fat Joe]\nUh, yo, nowadays, I'm flirtin with uncertain death\nLord I gotta be dyin, cause after all this cryin, how much more hurtin's left?\nWhen will the pain stop?\nThis depression and anxiety, is gonna make me show another side of me\nMy niggas ride with me cause I'm the truth\nThere's benefits to rollin with this clique, don't nobody fuck with you\nStill they label me a tyrant and a backstabber\nBut study the facts of crack, the shit don't add up\nI'm bringin opportunity to my community\nProbably the only rapper that cares, but still you out to ruin me\nWho you foolin B? I'm for unity, latins and blacks\nCould you fathom the strength, we have of the two it attach\nBorn together, voted alike\nThese uncle charm politicians ain't holdin us right\nHow could the same nigga be 20 years in office\nWhen it's clear the only thing that's risin is unemployment\nAbortion, little kids havin kids\nThe school system is failing us, now ain't that some shit\nWhile the rich keep gettin richer, the poor keep dyin young\nI can't hide no more, the time has come\n\n[Hook - Lajamic] - w/ ad libs\nI was born in the ghetto\nTremblin, tryin' a stay alive\nCause when you're born in the ghetto\nNo one seems to hear your cry\n\n[Fat Joe]\nBrown skin, you know I love my bra-ha-own skin\n\nEveryday I'm confronted with racism\nThese motherfuckin coppers, wanna bag us and have us shackled up in state prisons\nAfter all the taxes I pay\nYou would think when they stop us, they would have something nicer to say\nThan \"get the fuck out the car, where the drugs at?\nAll the jewelry you wearin, where the fuckin guns at?\"\nOnce they search the car clean and find nothin\nThe same crooked cops try to act like they know us or somethin\nLaughin, tellin jokes by the thousands\nTwo seconds ago they tried to send us to the mountains\nLeave my son without a father, my wife without a husband\nThe more I think about it, man it's just disgusting\nStill we live amongst 'em, everybody wants out\nThat's why we rap like we got silver spoons in our mouths\nLike we ain't grow up on welfare\nNigga don't even go there, you probably wore Pro Players\nWe need to educate the youth, tell our seeds the truth\nToo much to share, the bare minimum will exceed the proof\n\n[Hook]\n\n[Lajamic - singing until fade]\nOh, yeah, so much pain\nTryin hard to stay alive, stay alive\nOut in these streets, oooh (*harmonizing*)\nMan sometimes in can get so tough\nOh yeah, yes it can\nYes it can, yeah\nIt can get so hard, so hard, so hard", "title": "Born in the Ghetto"}]}