{"songs": [{"year": "2019-09-20", "album": "Requiem For A Dream Deferred", "image": "https://images.genius.com/ab06fa058e6a40e16a762e584f6c95aa.690x690x1.png", "title": "Hate Me Now", "lyrics": "[Intro]\nI need you to hate me, so I can use you for your energy. It's real shit man, feel this\n\n[Hook]\nBefore I die, I'm gon' rise\nNever seen a tear fall down my eye\nBut I can't lie, it's hard sometimes\nFeeling like I just might lose my mind\nBut I'm trying to survive through the lies and deceit\nThese are a few of the things that I've seen\n\n[Verse 1]\nI've seen the real turn to fake, I've seen the love turn to hate\nI've seen best friends turn into enemies, I just can't relate\nKillin' off my ego day by day until that bitch dissipates\nI've been fallin' back, tryna put some points on the board Kobe fade away\nThey wanna take my soul, wanna take my heart, eat me like a Frito-Lay\nAs the lights get dimmer, I feel triggered, trackin' my train of thought\nYeah, the air gets thinner higher you go ain't no room at the top\nI'ma do my thing, I'ma make a million whether you like it or not\nAnd it's been this way since I was knee-high, nose running with snot\nNever off my shit, I'm on my J-O-B, your bitch gon' K.O.D and crown a nigga king of them thighs\nI know these niggas plot, envy and lies in they eyes\nYou see myself in your reflection, it's really you you despise\nDo me a favor, go and google Mob Ties\nYou only see the fairest skin and lightest hue of eyes\nZero correlation between you and I\nHatred of ones self, that sentence putrified\nPurify these useless minds\n\n[Hook]\nBefore I die, I'm gon' rise\nNever seen a tear fall down my eye\nBut I can't lie, it's hard sometimes\nFeeling like I just might lose my mind\nBut I'm trying to survive through the lies and deceit\nThese are a few of the things that I've seen\n\n[Verse 2]\nI've seen the mighty fall far, off a high horse to the floor\nLord, give me the strength to endure\nTo always bounce back for more\nTo never let my vision, foresight or my perspective become small\nCountin' all my blessings through this test of will and faith\nBut the game is like a fuckin' episode of Will and Grace\nTryna be calm, cool and collected but respected above all\nWhen you're down and out without a dime to your name, who you call?\nWhen the feeling hits your stomach like you're going through withdrawals of [?], lawd\n\n[Bridge]\nI need you to hate me, so I can use you for your energy. It's real shit man, feel this\n\n[Hook]\nBefore I die, I'm gon' rise\nNever seen a tear fall down my eye\nBut I can't lie, it's hard sometimes\nFeeling like I just might lose my mind\nBut I'm trying to survive through the lies and deceit\nThese are a few of the things that I've seen\n\n[Outro]\nIt's real shit man\nIt's real shit man\nI need you to hate me, so I can use you for your energy. It's real shit man, feel this"}], "artist": "K.A.A.N."}