{"songs": [{"image": "https://images.genius.com/ff86c67b2b24d56ab53e7113fd4cd475.500x500x1.jpg", "lyrics": "[Verse 1]\nWhen we pull up to the light, the people all stare\nFour niggas in the Benz with the dreadlock hair\nSmoke everywhere, wavin at Madeline\nOn them woodgrain Davins with the license plate rattlin'\nDoin' what we want to, hangin' out the sunroof\nMental, we ignorant, boy we go dumb dude\nGas break dip, we call it yokin'\nDo a donut in yo whip, we call it dosin'\nGet stupid, is what we do good\nGhost ride the whip while we dancing on the hood\nI'm amped feeling good, I'm hyphy\nIn a bitch face with a thizz face off a Nike\nThe women like me, I'm dipped in butter\nI'll rob your brother pimp the blood out your mother\nI'm mister stupid doo-doo dumb\nSumthin' Terrible, tell 'em how we come\n\n[Chorus]\nWe go S - T - U - P - I - D\nWhen we go to the club we don't need ID\nEverywhere we go its a party yall\nWe gone get it cracking like the Mardi Gras\nGet stupid, get stupid, get stupid, get stupid\nGo stupid, go stupid, go stupid\nCome and go stupid with me\n\n[Verse 2]\nI'm a dog, hound, Crestside clown\nGig so hard make my pants fall down\nThis beat pounds, cutty where'd you get it?\nOh you ain't know, Dr. Dre did it\nI come wit it, rapping and rhyming\nDancin, pantomiming, acting like I'm driving\nThen switch it up, dance like him fishing\nSee in the bay area we dance a lil different\nThe bay bounce to thizzle, the west coast wizzle\nDo they get stupid, come fuck with Drizzle\nCall the hospital, he's having convulsions\nNo he's gettin' stupid, in his load yokin'\nIs the store still open?\nWe need heem, that Privilege thing...yadadamean?\nAll in the throw like yee\nS - T - U - P - I - D\n\n[Chorus]\nWe go S - T - U - P - I - D\nWhen we go to the club we don't need ID\nEverywhere we go its a party yall\nWe gone get it cracking like the Mardi Gras\nGet stupid, get stupid, get stupid, get stupid\nGo stupid, go stupid, go stupid\nCome and go stupid with me\n\n[Verse 3]\nAlright, let me tell you why we call this thing stupid\nCause, when I dance the chicks, say: 'you stupid'\nYou can do it, it ain't that hard\nBaby get dumb, act like a retard\nShake your hair, make it blow in the air\nYou gotta get into it, growl like a bear\nNow say Wha! 'What?' No, Wha!\nDo the damn thing girl cut that shit up\nFill your cup, don't be no punk\nIt don't look right if you really ain't drunk\nCome on, repeat after me we go S - T - U - P - I - D\n\n[Chorus]\nStupid? Hahaha\nWe go S - T - U - P - I - D\nWhen we go to the club we don't need ID\nEverywhere we go its a party yall\nWe gone get it cracking like the Mardi Gras\nGet stupid, get stupid, get stupid, get stupid\nGo stupid, go stupid, go stupid\nCome and go stupid with me", "year": "2004-07-20", "album": "Ronald Dregan: Dreganomics", "title": "Get Stupid"}], "artist": "Mac Dre"}