{"songs": [{"title": "Hold On (Alternate Version)", "lyrics": "[Intro:]\n[50 Cent]\nThat's how it is, you know\nEverything's good till it starts to go bad\nAnd then it just gets worse, and it gets worse, and it gets worse\nI guess that's just Hip-Hip\n\n[50 Cent & Young Buck alternate]\nYeah\nYeah niggas\nNiggas be frontin' man\nG-Unit in this motherfucker\nTold niggas man I'm cool, calm, and collected man\nAyo 50, ayo this nigga barely breathing, nigga!\nI say the word, nigga blow 'im!\n\n[Bridge: 50 Cent] x2\nIt won't be long 'fore you dead\nYou wanna run your mouth crazy, talk about me\nNigga I come for your head\nAnd leave your monkey ass laid out in the street\n\n[Verse 1: 50 Cent and Young Buck]\n[50 Cent]\nI hit your heart you dead\nI squeeze till the semi run out\nNiggas who know me good in my hood call me a dumb out\nI'm the nigga in the hooptie with my hat down low\nCan't tell that this a hit until the MAC-10 blow\nI got 32 shots, I ain't got to aim\nI'll wave this bitch in your direction mayne (Ha-ha)\nBeams, clips, and grips, it's a sticky situation (Yeah)\nAdrenaline rush, I squeeze, my heart start pacing\n\n[Young Buck]\nAyo 50 let me Mossberg pump and put some bricks in his pocket\nPush him off the Manhattan bridge while you watchin'\nWe spit in his bitch face and pissed on his grave\nThis is the way that Guerillas behave\nWhen you let 'em out the cage, I'm military raised\nAnd I'm not the only one, we all carry K's\nI don't fuck with them niggas, they got scary ways\nShots ringin', niggas start singin' like Mary J\n\n[Hook: 50 Cent]\nIf you can\nHol' on, nigga, hol' on\nSeems like an ambulance always takes so long when you're hit\nIt won't be long 'fore you dead\n\n[Verse 2: Young Buck and 50 Cent]\n[Young Buck, (50 Cent)]\nDesert Eagle, .50 caliber, it came with a silencer\nI beat another case, (Haha Buck, I'm proud of ya')\nBrooklyn showed me how to put a razor in my mouth\nQueens niggas do it too, I had to bring it to the south\nNow I ain't gon' give you this gun if you playin'\nAnd you might want to hold this bitch with two hands\nI'm a marksman, I can hit ya' right where ya' stand\nWhile you on the ground layin', your momma right there prayin'\n\n[50 Cent]\nI put the fifth to your head, your white T turn red\nNigga now give the bread, I'll fill your ass with lead\nPut a hole in ya' wig, with the SIG, ya' dig?\nShouldn't fuck with the kid — I don't play that shit (Come on)\nIt's all part of the game, man the game ain't fair\nThe trigger gots no heart, nigga my gun don't care\nThe hammer hit that shell, homie you see that flare\nYour life start to flash, your dead, nigga who cares? (Yeah!)\n\n[Hook: 50 Cent]\nIf you can\nHol' on, nigga, hol' on\nSeems like an ambulance always takes so long when you're hit\nIt won't be long 'fore you dead\n\n[Verse 3: 50 Cent and Young Buck]\n[50 Cent]\nMe and my bitch: We break up, we make up; see Jacob for the stones\nWe kicked up, that's what's up, 'cause I'm out with the chrome\nYou fuck up, you get bucked, Buck'll get ya'\nPush a knife through your chest, boy I ain't fuckin' with ya'\n\n[Young Buck, (50 Cent)]\n50, let me see your Glock for a minute, (My nigga, bring it back)\nIf it's blood on the barrel, homie take care o' that\nYayo pick me up, and don't be late\nI need to try and buy some shells for this old .38\n\n[50 Cent]\nThe Unit's my gang, my set, my MAC, my TEC\nMy protection, my family; do you understand me?\nMy knife, my gun, my wife, my son\nMy love, my niggas, my stacks, them figures\n\n[Young Buck]\nWe got lives to take, we got wives to rape\nI had to cut the grass down just to find the snake\nEverytime I mate, everytime they hate\nI got a bad temper nigga, just rewind the tape (Yeah!)\n\n[Hook: 50 Cent]\nIf you can\nHol' on, nigga, hol' on\nSeems like an ambulance always takes so long when you're hit\nIt won't be long 'fore you dead", "album": null, "year": "2007-03-02", "image": "https://images.genius.com/787eb0fed4a05aa802dee3238c64431a.792x792x1.jpg"}], "artist": "Young Buck"}