{"songs": [{"lyrics": "[Intro]\n*Phone rings*\nSgt. Kickass: Police Department, Sgt. Kickass speaking\nThe D.O.C.: Yeah, uh, Kickass, hey it's me again\nSgt. Kickass: Hold on... hold on a fuckin' minute!\n*door opens, then closes*\nSgt. Kickass: What the fuck is your problem? I told you not to call me here! This better be some good shit\nThe D.O.C.: Yeah, yeah, yeah, I got a big one, it's going down tonight. B-B-B-But it's gonna cost you two thousand\nSgt. Kickass: Wha, you cluckerin' motherfu--\nThe D.O.C.: Listen if you wanna make the deal, you fat motherfucker! It's at 477 Savona Way, 4 A.M.! And don't fuck me!\n*phone hangs up*\n[Police 1]\nHey I don't feel good about this one man\n[Police 2]\nHey we been fuckin' doin' this for 10 years and we haven't been caught yet\n[Police 1]\nYeah I just don't know about this one\n[Police 2]\nHey just shut the fuck up and pass me a donut\n\n*phone rings*\n[Dr. Dre]\nYeah, what's happening?\n[D.O.C]\nHey what's up Dre?\n[Dr. Dre]\nAyo Doc, what's happenin' man, you hook that shit up with 5-0?\n[D.O.C]\nOh I hooked that shit up man, this shit's jumpin' off tonight\nIt oughta be happenin' at 4 in the morning\n[Dr. Dre]\nAh alright, we got somethin' for their ass\n[Police 1]\nQuiet... quiet... Sgt. said this was gonna be pretty easy\n[Police 2]\nYeah, but never underestimate those fucking niggers\n[Police 1]\nAlright are you ready?\n[Police 2]\nYeah, I'm as ready as I'll ever be\n[Police 1]\nAlright, on 3\n1... 2... 3!\n*door busts open*\n[Both Police 1 and 2]\nFREEZE MOTHERFUCKERS!\n[Eazy-E]\nShoot that motherfucker!\n[Dr. Dre]\nThat's mothafuckin' police\nPunk mothafunka\n\nSA PRIZE NIGGAZ!\n\n[Hook]\nFuck the police! Fuck, fuck, fuck the police!\n[Fuck them motherfuckers!]\nFuck, fuck, fuck the police!\n[The big payback] You're motherfucking right, yo\n\n[Verse 1: Dr. Dre]\nFuck the motherfucking police!\nThey don't want peace, they want a nigga deceased\nSo he'll cease to be a problem, and by the way the perform\nIt seems the Klan gave the white police another uniform\nAnd yo the black police, the house niggas\nThey gave you a motherfucking gun, so I guess you figure\nYou made out, good to go, but you didn't know\nThey would stick your black ass back in the ghetto, yo\nTo kill another nigga, catch him with crack, in fact\nFreebase - they put in the neighborhood in the first place\nBut the brothers ain't stupid, remember that\nYou got a gat, I got a gat, so whassup with that\nA to the motherfuckin K\nThe last words you hear, then the smoke appears\nTears, from your motherfuckin family\nThey're starin at me, but I'm goin gun happy, fuck 'em!\nShootin everything in sight tonight's the night to get hyped\nAnd fight for what's wrong, fuck what's right!\nAnd by the way, my name is Dre\nSo listen up motherfucker to what I gotta say, yo\n\n[Hook]\n\n(Now for the first episode)\n\nYeah that shit's hittin man, where the volume at?\nHold-up, hold-up, hold-up, one-time, one-time, one-time\nPut the joint out! Put the joint out!\nHey you motherfuckers want to step out of the car?\nDon't you know it's against the law to play music so god damn loud?\nShut the fuck up! Go to jail? Or gimme that shit you was just smoking\n\nMotherfuckers from high crime areas view the police as a threat\nAnd that's some shit you betta not forget\n\n[Verse 2: Eazy-E]\nEazy E's the name feared by most\nWhen, a lil nigga is thrown in the pen\nBut on the streets there's two kinds of people\nWhite rich fucks and the ones who get harassed like me\nPull over to the side, routine for me\nTearin' up my shit, like they lookin for a key of cocaine\nBut they never find the shit\nAin't got nuttin better to do and nobody else to fuck wit\nThinkin' everything is stolen\nBut can't face facts that a young black nigga's just rollin\nMaking more money than they ever make\nTaking more shit than they ever take\nYo pigs are made to kill, and no regret and\nKeep your hand on your weapon shoot his ass and start steppin\nCause I'm a nigga that don't give a fuck about nothin\nSo let me explain a lil somethin, yo\n\nSee, I got this problem, a big problem...\nCops don't like me, so I don't like motherfucking cops\n\n[Hook]\n\nEpisode Two:\nGet out of the fuckin car!\nWait a god damn minute what the hell did I do?\nHey just shut the fuck up black bitch\nWait a minute, you ain't gotta be pullin me by my motherfuckin hair! Let\nGo of my motherfuckin hair!\nHey just step the fuck back and shut up!\nGet your motherfuckin' hands off of me!\nCalm down, calm down now... listen, we're gonna go around this corner, and\nYou're gonna suck me and my partner's dicks, or you're gonna\nBe one black dead nigga bitch\n\n[The D.O.C.]\nPolice brutality is common in my neighborhood\nThat's why I hate them motherfuckers\n\n[Verse 3: MC Ren]\nI said fuck the police but with a little more force\nAnd maybe now I get my point across\nIt's a massacre goin on, just open your eyes and look\nEveryday a young nigga is took\nOff the face of the street by a police\nIt's like they gotta a nigga chained on a short leash\nYou can't leave out the city that they shacked up\nCause if you do that's the right they got you jacked up\nIt's embarassin because you know they justice, but all you can do\nIs say fuck this, because if you move, that's all she wrote\nSo what? The excuse to shoot, or they rather stomp your head\nTil you're dead with the steel-toe boot\nHarassin me with some kind of mind game\nActin like a nigga just was born with a gang-name\nYou call that right but when you're black there's no right\nSome recreational shit was only a gang fight\nSo shootin at the cops was a street thing\nTo waste time as we slanged off the cocaine\nBut everything was done just for peace\nTo retaliate, on the fuckin police, so I'm sayin\n\n[Hook]\n\n(The final episode)\n\nEpisode Three:\nHey Juan, look at the piece of ass man\nWatch out watch out watch out homes!\nOh shit man you fucked up, you hit a police car\nI didn't see that piece of caca!\nBetter act like you don't speak ingles homes\nWhat the fuck? Get your ass out of there, I've had enough\nOf your raggedy ass motherfucking shit!\nOh man no me pegues! por que me pegas? No! por favor no! No! Por que?\n\n[Hook x2]\n\nChinga tu pinche madre, pinche policias weys, pendejos, salvajes, culeros…", "album": "100 Miles and Runnin’", "year": "1990-05-29", "title": "Sa Prize (Fuck Tha Police - Part 2)", "image": "https://images.genius.com/1f1306ebc3ce5d611ce103d6c1bc8880.944x936x1.jpg"}], "artist": "N.W.A"}