{"songs": [{"title": "Can I Get", "album": "Free Crack II", "year": "2014-08-29", "image": "https://images.genius.com/6ab445e6a0d96f5a96b60b009e6c0463.500x500x1.jpg", "lyrics": "[Hook]\nThey like can I get a pic?\nCan I get that?\nCan I get this?\nCan you do that?\nCan you lend me out a stack?\nI'm like call me right back\nI just wanna pic I know I'm good for that\nBro can you do this?\nCan you do that?\nCan you lend me out a stack?\nI'm like is you smoking crack?\nSee I got it on my own now\nNiggas callin' my phone now\nAll i see is new faces cause they see that I'm on now\nTakin' care of so much shit, young nigga feeling grown now\nI just wanna be alone now\nEverybody just go on now\n\n[Verse 1]\nI pulled up flexin\n20 on a necklace\nYoungin got bread but a nigga still stressin\nDid it by myself bitch i ain't had help shit\nWord around town is the kid got selfish\nI just might spend 30 grand on my wrist\nFeelin like the mothafuckin man in this bitch\nNiggas lazy as shit tried to teach em how to fish\nBut these niggas just want you to hand em some shit\nWhen shit get crazy they leave you in the dark\nWhen you on top they act like they played a part\nThey done left Bibby in the water with the sharks\nHomie switched on me stuck a knife threw my heart (damn)\nI swear to god that shit hurt the most\nMade it threw the struggle I deserve a toast\nAlmost drowned but I learned to float\nNow a nigga got fans from coast to coast\n\n[Hook]\n\n[Verse 2]\nI'm tryna hide the pain\nTryna stay the same\nThese niggas tryna throw dirt on my name\nMoney on his brain\nGet you murked for some change\nWith the money and the fame you see everything change\nI know the game like a mothafuckin ref\nThis the blueprint I'ma teach you the steps\nEverybody in it for they mothafuckin self\nYoungin chasin money niggas mad cause I left\nWhat you wish I was broke or somethin\nRunnin round the hood sellin dope or somethin\nNiggas wish i woulda lost hope or somethin\nWhen i told them thought it was a joke or somethin\nI pull up stuntin\nMake em wanna do me\nMan I'm thinking bout going out like Boosie\nBibby on some slow shit\nGotta stay focused\nStreet shit\nBeef shit\nGotta make it out it\n\n[Hook]"}], "artist": "Lil Bibby"}