{"artist": "Will Smith", "songs": [{"year": null, "lyrics": "[Will Smith]\nYo, if you can't dance, it's cool to get up now\nYeah see usually y'all stand off on the side\nY'know you're a lil' embarrased or whatever\nBut this one of them joints for e'rybody\nSo get up on up, but keep it simple, slide\n\n[Hook: Smith + Scherzinger]\nIf you can't dance then this is your jam, baby\nLeft to right, all night, slide - that's all you gotta do\nIf you can't dance then this is your jam, baby\nLeft to right, all night, slide - that's all you gotta do\n\n[Verse One: Will Smith]\nNow we all know the boy at the club, all liquored up\nOr with the bub tryin to pick 'em up\nWhack dancin, wookin pa nub\nHis shirt too bright, pants too tight, boy settle down\nNow I ain't just messin wit'chu\nI got better things to do, I'm tryin to help\nI got a lesson for you, I know you do the best you could do\nWanna get next to boo? Then the less you do, the better\nCause women equate dance with sex\nThey gon' see you, and be like - next\nBut you gon' be like, hold up ma! - next\nBut she gon' be like, uh-uh pah! - next\nNow looka here, rule number one, know your name\nIt ain't Usher, Justin, Hammer? Then we can touch ya\nRule number two, never do a dance you can't do\nWhy stupid? You can't do it\n\n[Hook]\n\n[Will Smith]\nSo I'm up in my spot in Miami the other night right\nAnd this dude out on the floor OD'n, just way overdancin\nYou know so his mami wanna holla at me\n\n[Verse Two: Will Smith]\nShe thought my name was Billy, I told her it was Willie\nShe said she watched my TV show and I was very silly\nTold her I was from Philly, she looked at me said really?\nAnd judgin from her t-shirt I could tell that she was chilly\nSo I gave her my sweater, she said her name was Etta\nShe said she come from Cuba and she just had bought a Jetta\nShe said she glad I met her, let's go somewhere together\nShe said she'd ride in my car, cause she knew my car was better\nThe conversation cookin, attention gettin tooken\nMy Spidey Sense is tinglin, I felt somebody lookin\nNow who this brother lookin, and now he runnin bookin\nI'm mad I'm like the fisherman I almost had my hook in\nI figured I should get up, and quickly clear my head up\nRosetta got a man, got me feelin kinda set up\nNow dude was really fed up, and yo he wouldn't let up\nHomey if I hit you you might never ever get up\nNow he was not a dancer, plus he wasn't handsome\nComin like Mel Gibson like I had his girl from ransom\nPedro wanna go outside\nYo amigo, tranquilo, slide\n\n[Hook]\n\n[Verse Three: Will Smith]\nNow rule number three is easy\nPlease re-member that you ain't on Beach Street\nThe sweet beat you ain't tryin to win no TV\nAnother dude get a move no need to outdo it\nRule number four, out on the floor\nDon't be doin moves that don't nobody do no more\nDraw too much attention it be adventureous on the floor\nThere's a reason that don't nobody do 'em no more, you feel me?\nThis may be hilarious\nBut rule number five is SERIOUS, uh\nIt's a shame to even have to discuss\nBut it's no lip bitin or pelvic thrusts, I mean\nYou think that move'll put the sting on her?\nYou too close, tryin to put a ring on her?\nYou don't know that girl, don't cling on her\nAnd don't put your thing on her, cool?\n\n[Hook]", "image": "https://images.genius.com/b6862accc0e70d12f7d4a50c2aee85da.1000x1000x1.jpg", "album": "Lost and Found", "title": "If U Can’t Dance (Slide)"}]}