{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Kane]\nQuestion.. what has he done, for you lately?\nTell me.. do y'all go for walks on the beach?\nI just wanna know, if you had dinner at the pond\nOr the drive-through at Mickey D's\nYou say the last movie y'all saw was _Jaws_? Mmm\nWell never fear baby, the Big Daddy is here\n\nI come up upon the scene to romance thee\nWith a little bit of T.L.C. to tickle your fancy\nGive you protection, warmth and affection\nMake sure you never feel any rejection\nWithout a doubt, I admire you, I have a desire to\nBe a more better man prior to\nYour past relationships, you've been datin\nWith all the wrong gentlemen, I'm more sentimental\nIn my own little way so (HEY!)\nWhattaya say about givin a play okay?\nCause I'm not here to impress you, I wanna caress you\nPosess you and bless you, nevertheless\nTo make you feel secure, and real sure\nMon cheri amore, pretty woman I adore\nDon't shed a tear never fear my dear I'll be there\nAnywhere with some Tender Lovin Care\n\nChorus: repeat 2X\n\nJust a little bit of T.L.C\nTender Lovin Care you'll get from me\nJust a little bit of T.L.C\nTender Lovin Care is what you need\n\n[Kane]\nIn the beginning I only wanted to be your friend\nBut then..\nIt may sound strange, but my feelings started to change\nAnd now I wanna sustain..\nSomethin more closer, give you the most of my love\nAnd my time and respect as opposed to\nSayin she's \"Just a Friend\"\nI may sound like Biz, but you know what time it is\nI want us to be together and benevolent\nWith reverance to give you the best relationship there ever been\nSo consider me as as as as as a-a-as your lover\nDamn baby, you make me stutter\nBut I'm still able to, clearly say to you\nThings that I feel *smooch* and kiss your navel too\nGivin much T.L.C\nAs I make love to you constantLY\n\nChorus\n\n[Kane]\nMay I?\nHe ever treat you with the\nProper amount of chivalry, would be so, mmmm\nBreak!\n\n* just the drums for a bit *\n\nBass!\n\n* bassline comes for a bit *\n\n* music by itself comes in, then.. *\n\n[Kane]\nI hope to form a special thing that we can cherish\nEverlasting, it won't perish\nEstablish a special thing that's based on love\nAnd trust, in other words, it's all about us\nYou won't have to ever search for Tender Lovin Care\nCause for you I got it right here\nYou'll never find none greater\nSincerely yours\nThe Smooth Operator\n\nChorus", "image": "https://images.genius.com/f2f313ca094b7792e9d4a77d69784d4d.475x473x1.jpg", "year": null, "title": "T.L.C.", "album": "Prince of Darkness"}]}