{"songs": [{"year": "2014-11-27", "lyrics": "[Intro]\nYou can break my bones\nBut your heart of stone can't break the seal\nCan't break the seal\n\n[Verse 1]\nThat's right I'm on the edge\nDamn right I'm on the line\nBlame it on my attitude\nAnd the thoughts that's on my mind\nAll because I came up on the poorer side\nWhere the don't provide\nOver time you tend to feel like you supposed to sail\nOr you supposed to fail, or you supposed to die\nOr you supposed to fly\nDecatur's own, poster child\nMy \"day one team\" still hold me down\nNew niggas just want to get closer now\nI'm like hold up now\nWhat do I know you now? We are we homies now?\nLookin' at me like I'm holdin' out\nWhat do I owe you now?\nIt ain't shit  that nobody can tell me\nThey look at my train of thought\nAnd they try to figure a way to derail me\nBut the way that they verbal assaultin'\nAs big as they thought it was not necessarily\nThat's the way it is so apparently\nOne day you're the hero, the next you're the villain\nYour own people ready to bury ya\n\n[Hook]\nYou can break my bones\nBut your heart of stone can't break the seal\nCan't break the seal\nYou can take all I own\nBut you can never take the soul away from me\nAway from me\n\n[Verse 2]\nRest in peace, rest in peace\nTo my pastor, rest in peace\nCan't look back at yesterday\nWhat can they say, what's left to see?\nI flip the style up and became the thing  they said I'd never be\nWhatever obstacle they threw I have surpassed successfully\nAnd you can try to overlook me but I'm too much of a giant\nAnd if I ain't at the top, shit I must be right beside it\nSo don't try to sell me bullshit, I'm too gifted to buy it\nIf I sold common sense, you'd be too stupid to buy it, uhh\nI can't dumb it down, how the fuck I sound?\nTryin' to dumb it down\nYou just thought you knew me 'til you figured out\nWhat I was about\nCause what I was is not the same as now\nI ain't jaded that's just how I view the game and how I play it\nIt's just greed and entertainment\nBut it ain't so entertainin'\nWhen niggas is hungry and you in they city\nYou lookin' like money and fingers is itchin'\nYou won't see it comin' you totally ignorant to it\nNo one in your clique is a shooter\nEvery killer say that he'll do it\nEvery nigga claim that they is the truest\nBut you couldn't prove it until they go through it\nWhen temperatures flare up and niggas get stupid\nThere's no longer hype it's no longer 'bout music\nThere's no more illusion\nNo more confusion\nKnow who you can trust, who you can fuck\nThat bitch that you with, she settin' you up\nBut never forget that karma's a bitch\nWhen she comes around, remember to duck (duck)\n\n[Hook]", "title": "Broken Bones", "album": "New Black", "image": "https://images.genius.com/54ff9f204f4b8fc3528da5fc7e538aa9.500x500x1.jpg"}], "artist": "B.o.B"}