{"artist": "Cappadonna", "songs": [{"title": "’97 Mentality", "album": "The Pillage", "year": "1998-07-21", "image": "https://images.genius.com/a0de9ba12455d35ac16b7d5a8d3a6379.500x500x1.jpg", "lyrics": "[Intro: Cappadonna]\nYo! It's the burial ground sound, Dunn!\nIt's real out here\nStaten Island puttin chills in y'all niggas\nForever in it.. yo\n\n[Verse 1: Cappadonna]\nMy devastating hot '97 mentality\nKeep me on point for my four-digit salary\nHeavyweight lyric never lost one calorie\nI'm soon to be seen on the TV screen\nGambino Cappaccino to the Afro Sheen\nStay black, where I'm at, high road to rap council\nSplash love to Wu in a orderly tonsil\nNever limit to the diction, cause chaos to mixin\nBrutalize a sound check, ripple through the intermission\nRap's under siege, held tight like a squeeze\nForced in the world 'Donna nuclear freeze\nDoing damage to the wannabe Flip Mode and Def Squad\nRuckus a whirlpool in the rap entourage\nIf you dare to test thirty-six, chambers of strangers\nNot word of mouth, or song, real wigs might peel\nLivin large and in charge branch out Bon Voyage\nTwenty-four diamond government named God\nAlias Daryl Hill bring thugs back to kill\nCircle around my son, Daryl Jr. never eatin lard\nAuntie Dauntie sixteen holdin me down\nAIDS of rap music may be contagious to sound\nVerbal the slang pushed back to create pronoun\nMethod forcin J-Love to Bring the Pain from underground\nRealizin food for thought is self-compromising\nShaolin cut the crack into a triple-O sizin\nBlue do what he do to keep that currency risin\nHopin I catch a deal so we can catch a four-wheel\nInstead of catchin bodies, niggas not keepin it real\nI dirt bomb niggas that steal cake from stores\nThat's my type of niggas I be wanting on my tours\nCan't help it, my styles stay fat like Roseanne\nRuckus in the square I stay rough like the Clan\nPanther on my arm, pen and pad in my hand\nPunk motherfuckers better beware of the Shaolin\nDefy interactive project Children of the Corn\nGats on my man keep em bustin till ya gone\nStyle so ancient it sparks just like the unicorn\nDonna come through everyday my uniform\nChanges and switches, I came to make ladies out of bitches\nCrackhead niggas get stitches\nSo what up with that kid, danger when I attack, kid\nWatch how the slang hits you just like a bat, kid\nForm another pyramid, look how we slid\nAll over Park Hill, Stapleton politic\nOn a twenty dollar bill all in it together\nYou can't fuck with the stormy weather, yaknahmean?\n\n[Hook x4: Ghostface Killah]\nTo the year Born God all the Gods strike hard\nFast from the swine hold down your boulevard\nFather-U the C-Cipher, start the revolution\nMiddle finger in the air, for slang prostitution"}]}