{"songs": [{"title": "Half On a Baby", "album": "Highbridge the Label: The Takeover, Vol. 1 ", "year": "2016-05-18", "image": "https://images.genius.com/2dbfdf79ead68254b3f231e80ee65d53.500x500x1.jpg", "lyrics": "[Intro]\nYou didn't tell me you love me until I said I loved you\nBut I didn't love you until after I fucked you\nAre we both guilty? Do you feel me?\nI was tryna go half and half with you on a baby\nI must've been crazy to let you play me\nBitch, I'm too wavy, you can never replace me\nAnd I can't take it, you was amazing\nI would've went half and half with you on a baby\n\n[Verse 1]\nYou was the one, I said I loved you so I fucked with you\nI was hearing rumors, hoping that they wasn't true\nYou would call my phone thinking it was cool but you knew\nEverything that you told me that you wasn't doing\nYou do girl, it was true girl\nNow I got a couple new girls in my new world\nAny different type of mood, I can pick and choose girls\nTell me what you wanna do, I can pick you up\nIn a two door, that's a new sport, come and hop in\nAll them niggas talking nonsense, they don't want this\nGirl I prolly would've gave you anything you wanted\nGirl I prolly would've put a baby in your stomach\n\n[Chorus]\nHalf on a baby, Na Na Nah\nHalf on a baby, Na-Na Nah-Na\nHalf on a baby, Na-Na Nah Nah\nNah Na-Na Nah Na\nShawty, me, you, and a baby\nCould've been me, you, and a baby\nHalf on a baby, on a baby\nHalf on a baby, on a, ha!\n\n[Verse 2]\nI told her the moment that I approached her\nCome closer, I needed a little closure\nHeart colder, I'm looking over my shoulder\nThen I showed her something to make her come over\nI put lemons in the jacuzzi, if you see\nHow I move, we might end up making a movie\nCome through, see what I'm talking is really true things\nWe can do things, girl we can do things\nIf you wanna do it on the low, we can do it that's cool\nBut if you fuck it up that's you\nI can cut you off in a second if you try to act new\nOh, I'll be throwing up my deuce, yeah\n\n[Chorus]\nHalf on a baby, Na Na Nah\nHalf on a baby, Na-Na Nah-Na\nHalf on a baby, Na-Na Nah Nah\nNah Na-Na Nah Na\nShawty, me, you, and a baby\nCould've been me, you, and a baby\nHalf on a baby, on a baby\nHalf on a baby, on a, ha!"}], "artist": "A Boogie Wit da Hoodie"}