{"artist": "Paul Wall", "songs": [{"album": null, "title": "My City FAKE", "image": "https://images.genius.com/f4538d52cd44a5a6367fd1c32b9e3a87.781x781x1.jpg", "lyrics": "[Chorus]\nI believe I can fly fly fly\nI believe I can fly fly fly\nI'm so high\nI'm so high\nI'm so high\nI'm so high\nI believe I can fly fly fly\nI believe I can fly fly fly\nI'm so high\nI'm so high\nI'm so high\nI'm so high\nI Believe I can fly\n\nAye Aye Aye\nBitch I'm sittin' so high, I believe I can fly\nThe coupe looks delicious the rims are waving bye\n? long like Diddy, I put on for my city\nCologne Kush and Henny, I'm gone in that Hemi\nI'm gold but you don't hear me, four to the dome if you can hear me\nThey say I need a pull-up when I pull up I'm the shit man\nWhen I grow up I wanna be like t-pain a hit man\nBut do yourself a favor partna don't be talkin' shit man\nYour broad done up and broke your heart my whole squad hit man\nHold up I see dead people, its just the dead white guys on my bread people\n\n[Chorus]\nI'm high as the moon and I'm flyer than a mosquito\nStacking my chips I got a bank full of Doritos\nI'm too cool for school so I'm teaching a class\nChiefin' on that purple rain partna puff puff pass\nSee im higher than the price of gas gone off vanilla cream\nRolling off of mac Dre leaning like a triple beam\nI got my wrist froze up like computer screens\nSo fresh so clean exhale sticky green\nI got the top steady droppin' like record sales\nPaint changing colors like Tyra bank's finger nails\nChoose the fast life I'm the flashy type\nDiamonds in my mouth sparkle look like sprite\nI'm so high\n\n[Chorus]\nI believe I can lean spite and codeine\nSomeones sleeping on the scene\nThat's a hell of a dream I'm a hell of a guy\nThat's a hell of a blunt fire it up lets get high\nYou can call me g5 cause I be in the clouds\nSomewhere in the club with my clothes smelling loud\nAnd never will I smile cuz I be biting down\nRollin off a p probably muggin' with a frown\nBut naw ain't nothing wrong how could he be on rich\nBitch looked at my whip bitch looked at my wrist\nMy wrist is tricked in ice my neck is dripped in ice\nBitch look at my life don't you wanna be my wife?\nWould you like to be my girl? dont you wanna change your life?\nI can change your life grab the credit card and swipe, like see?\n\nFly fly fly\n\n[Chorus]", "year": "2010-07-13"}]}