{"songs": [{"year": "1996-06-25", "title": "(Stay Away From the) Nasty Hoes", "image": "https://images.genius.com/46ae6bed252bb3c7764ab0e91a3893ee.500x500x1.jpg", "lyrics": "Intro/Outro: all\n\nHey brown suga, you know my name\nNo need to front, if the thought's the same\nI got one night in town don't play no games\nLet's get it on no need for shame\n(repeat 2X)\n\nVerse One: Sadat X\n\nThe X is like a monument, I'm old New York\nI hope you know where I'm comin from\nYou got to take some, and then you leave some\nGood food, shoes and clothes\nStay away from the nasty hoes\nYour old pops he don't like my style\nHe resort to callin names as long as names stay names and no games\nI resist the urge to blast his old ass to flames\nA long hot summer, with no contract\nOne-twenty blocks, breakin open that pack\nYour role models, now down with the bottles\nThat's over near the store with the reinforced door\nAnd the breakaway for a pitbull named Thor, hah\nFor real Slim, for real cause I can't stress no ass\nCause it's, one where you came from, just like the same one\nThat was there yesterday, today, tomorrow\nAssembly car lines, line em up from behind\nSick that ass like a cactus, react to this dick, uh!\nHelmet wrapped tight sees no daylight\nI roll two-ply duke and that's a must\nPicture me knockin off shorty here with the rawness\nA year or two later got ta hear it\nAnd ain't got long to live, and ain't got long to live\n\nGood lovin, food and clothes\nStay away from the nasty hoes\n(repeat 2X)\nJust live, and let live... niggas, live, and let live\n\nVerse Two: Fat Joe\n\nWelcome to the world of AIDS is what she wrote\nOn the mirror with the red lipstick before I woke\nWho would ever think that this would happen to me\nBitch hit me off with HIV, purposely\nMet her at the club, think it was the Copa\nScopin out her thighs and, sizin up her chocha\nSeductive red dress, lookin Halle Barry-ious\nWhat's your name Miss? \"Sixty-Nine\" Nice alias\nNext thing you know, face up the asshole\nTongue on the clit, chick screamin \"Ay Fat Joe!\"\nDidn't have to taste her, but the puss was callin me\nThink that I should lace her \"Nah it's much safer orally\"\nThe moral to the story is the mustard's all around\nSo boricuas watch to see that you can catch it goin downtown\nPractice safe sex never flex unprotect\nI ain't really got AIDS, it's just a motherfuckin record\n\nIntro/Outro", "album": "America Is Dying Slowly "}], "artist": "Sadat X"}