{"artist": "Plies", "songs": [{"album": null, "title": "Honest (freestyle)", "image": "https://images.genius.com/142f4d6c2e6ce44c7607f441746bff25.1000x1000x1.jpg", "lyrics": "I'm the last real nigga left\nI'm just honest!\nI took a fuck, nigga best\nI'm just honest!\nI'm the last real nigga left\nI'm just honest!\nI'm riding dirty right now\nI'm just honest!\nOut here, bend no pussy\nI'm just honest!\nI'm just honest!\nI'm the first nigga drink Remy\nI'm just honest!\nYou know that you won't fuck niggas\nJust be honest!\n\nI keep a gang of young niggas here with me, too\nAnd ain't no telling what these young niggas won't do\nBut one thing I know these young niggas won't do is spook\nI'm just being honest, (honest), fucking two niggas\nLadies right now, they're being honest (being honest)!\nI kill one of you niggas now, I'm being honest!\nYou felt really one day, I'm just being honest\nGot bodies on these Ks, I'm just being honest\nGot.. on you niggas, I'm just being honest\nMy young niggas on flippers, I'm just being honest\nI fuck a bitch, but I ain't kiss the bitch, and I'm being honest\nAnd some of my niggas talk pussy, I'm just being honest\nAin't never gave a fuck though, I'm just being honest\nThat cap take on talk, I'm just being honest, being honest\nNo red bottles with chucks, niggas, I'm just being honest\nTell Boosie he dont owe me shit, nigga, I'm just being honest\n\nHook:\nI ride dirty right now, I'm just honest\nI'm just honest!\nOut here, bend no pussy\nI'm just honest!\nBut the first nigga drank, I'm just honest!\nI'm just honest!\nYou know that you're a fuck nigga, just be honest!\nJust be honest!\n\nI keep a gang of young niggas here with me, too\nAnd ain't no telling what these young niggas won't do\nBut one thing I know these young niggas won't do is spook!\nI'm just being honest!\n\nAin't never lied to my dick, I'm just being honest\nCan't nobody make me snitch, I'm just being honest\nIt's a ho nigga in every clique, I'm just being honest\nGot a kilo on my wrist, I'm just being honest\nAin't never trust no ho, I'm just being honest\nThese niggas on the road, I'm just being honest\nI see you real niggas fall, I'm just being honest\nAnd most of these rap niggas hoes, I'm just being honest\nAnd nigga begging more hoes, I'm just being honest\nI'm still sticking to the code, I'm just being honest\nI taught Meek how to cook dope, I'm just being honest\nHe turn fuck nigga when he went broke, I'm just being honest!\n\nHook:\nI ride dirty right now, I'm just honest\nI'm just honest!\nOut here, bend no pussy\nI'm just honest!\nBut the first nigga drank.., I'm just honest!\nI'm just honest!\nYou know that you're a fuck nigga, just be honest!\nJust be honest!\n\nI keep a gang of young niggas here with me, too\nAnd ain't no telling what these young niggas won't do\nBut one thing I know these young niggas won't do is spook\nI'm just being honest!", "year": "2013-10-03"}]}