{"artist": "Will Smith", "songs": [{"year": null, "lyrics": "[Will Smith]\nOriginal - a first form from which varities arise\nAn authentic work of art as opposed to an imitation, or reproduction\n\n[Verse One: Will Smith]\nWhy should I try to sound like y'all sound?\nThat's what's wrong with the rap game right now\nMan it's like a circus with a bunch of clowns\nWith a bunch of cliques I'll probably rap circles around\nI spit heat rock, and I ain't talkin rollin\nSoon as the beat knock I'm crown controllin\nWhen I hear y'all that's an awful sound\nI don't ride beats, I take 'em off the ground\nLand 'em somewhere, show 'em the town\nEven on foreign ground let 'em know I'm around\nI don't follow e'rybody when it's time to rap\nAt one time e'rybody thought the world was flat\nSounds like you? That was my intention\nI paid dues, now dudes pay attention\nI live for it, even though the flicks is hittin\nCrib's sick, you can see the booth from the kitchen\nSpeak on it, cause I saw it happen\nThis is hip-hop, dawg I ain't just rappin\nY'all lookin at a real MC man\nYou couldn't check a mic from me\n\n[Hook: Will Smith]\nWhy should I try to sound like y'all sound?\nThat's what's wrong with the rap game right now\nWhy should I try to flow, the way y'all flow\nOr do a show like y'all show, nah that ain't where my head at now\nY'all in the hip-hop lost and found\nThat's what's wrong with the rap game right now\nMan it's like a circus with a bunch of clowns\nWith a bunch of cliques I'll probably rap circles around\n\n[Verse Two: Will Smith]\nLet's talk about rhyme capability\nLet's talk about hip-hop versatility\nLet's talk about takin the game beyond\nHow the hell we gon' have a battle of wits? Trick you unarmed\nLet's talk about love for the game\nI mean real love, back before there was fame\nI'm real with it, I ain't claimin to reign\nBut when y'all talk about rap, y'all gon' start sayin my name\nF'real though, I ain't playin\nPlenty of y'all love a brother, just scared to say it\nYo, first ever rap Grammy\nLet's talk about the only reason yo' ass went to Miami - yup!\nTruck with rims - check; throwback jersey - check\nChampagne bottles - check; lots of models - DAMN!\nThat's the list for 90% of y'all videos and songs\nAm I WRONG?!\n\n[Hook]\n\n[Verse Three: Will Smith]\nLost - when you a slave to the biz\nWith no care for the cost of what you sayin to kids\nFound is when your lyrics are a test of time\nAnd your mind hear that your spirit is blessed divine\nLost is when you rhyme 'til your throat gets sore\nBut you don't even believe what you say no more\nFound is when you bleed heart into the mic\nAnd the pain you sustain it could change a life\nLost is when you hide behind the freedom of speech\nWell sure you're free to do it, but what it mean to do it\nDid you mean to do it? Did you need to do it?\nDid you take time to think about the seed you ruined? (HUH?)\nFound is Esco, Dead Prez and them\nFound is Lauryn Hill\nFound is Rakim\nFound can be you if you felt the message\nAnd ask yourself this question\n\n[Hook] - 2X", "image": "https://images.genius.com/b6862accc0e70d12f7d4a50c2aee85da.1000x1000x1.jpg", "album": "Lost and Found", "title": "Lost & Found"}]}