{"songs": [{"album": "Velvet Portraits ", "image": "https://images.genius.com/4fede9c46e82209513b015717d331109.600x600x1.jpg", "year": "2016-04-01", "title": "Patiently Waiting", "lyrics": "[Verse 1]\nIt’s been a long time since I held your hand\nGirl I've been waiting turn like this I don’t understand\nBut I'm patiently waiting for you to come home\nWhere your love still stands strong\nSo let’s try again till we get it right\nTonight is the night Let me hold you tight\n\n[Chorus]\nCoz it’s been a long time since you’ve been here\nAnd I'm patiently waiting for you to come home\nBack again\nHooooo\n\n[Verse  2]\nNight time is the right time to be with the one you love\nBut doing what I do ain’t no telling will I'm gonna\nBe home to you\nTill sometime you get worried\nYou think I'm out there doing what to do?\nAnd all I'm doing baby is working\nSo I can spend my life with you\n\n[Chorus]\nit’s been a long time since I smelled Josie\nI'm patiently waiting for the time to come again\nGirl I need you  I need you here with me\nThat’s why I'm patiently waiting for you to come home again.\nPlay your [?] though\n\n[Verse 3]\nIt’s been a long time since I got kissed your name\nIt’s been a long time just I held you close\nOh I have been waiting\nGirl I know you’ve been doing the most\nBut I've patiently waiting for you to come home again\nOhhhh (patiently waited)\nOh patiently waiting\nLooking at my window\nLooking at [?]\nOhh\n\n[Bridge]\nOh patiently waiting baby\nYes,I'm patiently waiting baby for you to come home\nWe love you so\nIt’s been a long time since I see your face\nPatiently waiting to see you again\nI know I heard you but won’t do it no more\n\n[Chorus]\nGirl I'm patiently waiting\npatiently waiting\nWaiting to come home\nI'm patiently waiting\nI even call you in my house\nPatiently waiting\n[?] me we all get the patience\nYou told me you don’t love me right then\nI'm patiently waiting\nI'm patiently waiting\nCome on back baby\n(patiently waiting)\nCome on back baby\n(patiently waiting)\nCome on back baby\n(patiently waiting)\nI need you I need you I need you\nI need you I need you\nCome on back baby\n(patiently waiting)\nCome on back baby\n(patiently waiting)\nCoz I'm patiently waiting for you to come home back again.\nCome on baby\nCome on baby\nYeah"}], "artist": "Terrace Martin"}