{"songs": [{"image": "https://images.genius.com/f7d42d0db13086f046e08faacf066ef0.500x500x1.jpg", "year": null, "lyrics": "[Intro - Akrobatik]\nAll my hardcore heads, middle fingers up (uh, uh, uh, yeah, yeah)\nAll my hardcore heads, middle fingers up (what?)\n\n[Bumpy Knuckles]\nIf we can't build, then you will be destroyed (uh, what?, c'mon, yo)\n\n[Akrobatik]\nAll my hardcore heads, middle fingers up (one time!)\nB-boys in the place (yeah), middle fingers up\n\n[Bumpy Knuckles]\nIf we can't build, then you will be destroyed (yo, c'mon)\n\n[Verse 1 - Akrobatik]\nBumpy Knucks, Big Ak, yeah we doin it big, pack\nThe spots, make it hot and never be where the pigs at (uh)\nI miss that money, when I don't make it\nSo if your nose is all up in my biz, I gotta break it (no doubt)\nI don't burn bridges and such\nBut if you fuckin with my business, you gettin fucked up\nBroke legs, hurt feelings and dreams deferred\nAll I gotta do is give my team the word (yeah)\nThen the vision of your scheme is blurred (blurred)\nCourtesy of the illest cats that you ever seen or heard (what up!)\nThe third rock away from the sun is now mine (mine)\nSo to anybody fuckin with me or my shine (yeah!)\n\n[Hook - Akrobatik]\nIf we can't build, then you will be destroyed (now, now)\nNow Bumpy Knuckles has a title, title\nAnd Akrobatik, has a title, title (c'mon!)\n\nIf we can't build, then you will be destroyed\nYo, A to the K has a title, title\nYo, Freddie, Freddie Foxxx has a title, title (c'mon!)\nAnd Illmind has a title, title (yeah!)\nAnd Fat Beats has a title, title (yeah, buck, buck, buck, buck, buck)\nIf we can't build, then you will be destroyed (yeah!)\n\n[Verse 2 - Bumpy Knuckles]\nYo, it's the dopest MC, with the O.G. flow\nThat real nigga shit, I spit, will drop you yo\nDon't act like Ak won't come back with Bumpy, to clap\nThat's how I rock for my comrades, black ,\nIn a hoodie, all black, carhartt, forty belows\nAnd it ain't no talkin, just two 40's that blow (BLAOW!)\n\"How You Like Me Now\" like Moe Dee\nIf niggas murder you, I'm the Co-D (what?)\nSince I was a roadie, I was studyin oldies and O.G.'s\nAsk any gangsta, they know me (that's what he do, my nigga)\nSee if we can't build, then you will be destroyed\nStartin them bullshit beefs, you should avoid\nIf I get annoyed\nYou'll make the Amber Alert like a missing little boy (whoa!)\n\n[Hook - Akrobatik]\nIf we can't build, then you, what? (c'mon!)\nIf we can't build, then you will be destroyed\nNow Bumpy Knuckles has a title, title\nAnd Akrobatik, has a title, title (yeah!)\n\nIf we can't build, then you will be destroyed\nA to the K has a title, title\nYo, Freddie, Freddie Foxxx has a title, title (c'mon!)\nAnd Illmind has a title, title\nFat Beats has a title, title (buck, buck, buck, buck, buck, c'mon!)\nIf we can't build, then you will be destroyed (yo, c'mon)\n\n[Break - Akrobatik]\nAll my hardcore heads, middle fingers up (one time!)\nAll my hardcore heads, middle fingers up (c'mon!)\nIf you can't build, then you will be destroyed (yeah!)\nAll my hardcore heads, middle fingers up\nB-boys in the place, middle fingers up (yeah, what?)\nAll my hardcore heads, middle fingers up (what?)\nFreddie Foxxx, Akrobatik in the place, what?\nIf we can't build, then you will be destroyed\n\n[Outro - Akrobatik - talking]\nYeah, what up, what up\nUh, Big Ak and Bumpy Knuckles yo\nYo ass in fuckin trouble yo\nHuh, what? (yeah!)\nThe, the Blast Master has a title (yeah!)\nThe Blast Master has a title\nThink I forgot?\nIf we can't build, then you will be destroyed (yeah!)", "title": "If We Can’t Build", "album": "Absolute Value"}], "artist": "Akrobatik"}