{"artist": "King Los", "songs": [{"image": "https://images.genius.com/af979fd34aa3f95d652a83f4bdfdf39a.538x538x1.jpg", "title": "Anniversary", "year": null, "album": null, "lyrics": "[Hook]\nDo you know what today is?\nIt’s our anniversary, our anniversary\nDo you know what today is?\nIt’s our anniversary, our anniversary\n\n[Los]\nIf lies hurt, but the truth heals\nAnd 1+1 equals love then how does 2 feel\nMinus 1 thats so heart broken\nIts hard to divide a future unless its both arms open\nJus show trust through your actions\nI know its hard to say that ones that got over\nTook a fraction of your heart away\nI mean its bad enough that when problems multiply\nThen someone gets carried, it ain't adding up\nWhy when you say you dont want nobody you see somebody\nAnd when you say you dont need nobody you need somebody\nHard as the concrete but soft as a whisper\nThats the mystery of love in all this enigma\nIts like the farther you dive in the harder it hit cha\nNow the ones that say they love ya is arguing witcha\nAsk VAR and LARISA about them senseless rumors\nReal love ain't censored just have a sense of humor\nFunny what we remember from a kiss\nMet on october 30th, then september 25th\nIn the blink of an eye, in the midst of a minutes time\nShes officially mine, we Mr and Mrs fly\nNow its necklaces for Christmas, unlimited kisses\nAnd how eternally precious 1 minute of this is\n2 wishes that came true at 1 time\nSo I dont give my flower no flowers\nI give her sunshine\nAnd the rain too to wash away the bad days\nTo bring the sunshine back for all the sad days\nHope you followin your dreams till you livin em out\nIf I could provide you one thing it’d be infinite smiles\nSo smile baby, you be gone lately\nWhen you shine I shine, you motivate me\nSo waking up next to you feel like I never slept\nAnd laying down next to you make me think I could fly\nWe comin full circle now with every step\nAnd when I look into your eyes I think of the sky\nBest I ever had took away the worst of me\n1 year strong happy anniversary\n\nToday is the day that we bought is all together\nAnd I don’t want nobody but you baby\n\nDo you know what today is?\nIt’s our anniversary, our anniversary\nDo you know what today is?\nIt’s our anniversary, our anniversary"}]}