{"artist": "Westside Gunn", "songs": [{"year": "2018-06-22", "lyrics": "[Intro: Crimeapple]\nLa musica de Harry Fraud\nWoah, esto si es un peligro, woah\n\n[Verse 1: Crimeapple]\nI'm stuffing chavo in my pantalones\nMami nervous, 'fore I leave, she holler, \"Bendiciones\"\nThis just made my rate double like the fucking chorus (woah)\nHard to ignore this, dog, my aura never looking porous\nI said a prayer for every smoker twitching\n'Cause what good is faith when there's no intention? (Woah)\nI turned my dirty kitchen into pole position\nBrother betrayed me, I guess we going fishing (I guess)\nCondescending Fed reaching, look like John Turturro\nAnd I still counted sheep like the census bureau\nDemonic stallions with the fatty said I aughtta wife it\nInstead, it's Ubers, Lyfts, and taxis when I get the vice grip\nWhere the fuck was you when everything was looking frightening? (Huh?)\nI only had a bottom bitch who'd never burned the rices\nNow my ambition is indifference to any prices\nWhile maintaining recognition that my time is priceless (oh my)\nMade my soul comfy, found a new balance\nRather let karma kill you, I don't do malice (nah)\nFocused on the paper, put a pencil to it\nWallet getting chubby like Botero drew it (woah)\nMastering my craft, help me stack the cheese\nSo I stay away from rats who fold like the back of knees (woah)\nYou just make sure that the package clean\nOr meet a couple knuckleheads who all pack Febreze (woah)\n\n[Verse 2: Westside Gunn]\nAyo, the black Jesus speaking\nTurned one brick to two, fiends tweaking\nHigh tops from a Yeezy Season\nPlease believe I'm on a Yves St diet\nBagging raw, what's the science? Three of them just died\nIf they want it, let 'em buy it, up at Barney's, caused a riot\nJewelry on me, bullets flying, got my niggas in confinement\nTook a O for a [?], few wrinkles, get the iron\nKnow his momma house\nLet's fry it, should be bitching for the Bisons (grr)\nGrisel patches on the New Era\nSporting new Vera up in MOMA\nDrive-bys, money, blue Carreras\nYou can never sink my ship\nRhymes fish, my white bitch like to sniff off my dick\nMade a wish, free Sly, free Ike\nFree Irie, free Black, free Mike, free Cs, I barely sleep at night\n(Free my niggas) I keep it on me everyday, even when I pray yay\nBoom boom boom boom boom boom", "image": "https://images.genius.com/a8a5e42d4ec977626772d2df25f034c5.638x638x1.jpg", "album": "Supreme Blientele", "title": "Spanish Jesus"}]}