{"songs": [{"year": "2010-04-27", "lyrics": "[Intro]\nCheah, don't you cry, no\nPretty darling I said now, cry no\nPretty darling I said now, cry no\nPretty darling I said now\nLittle, baby, I don't, I don't, I don't, don't you cry\n\n[Break]\nPIMP Squad on deck\nPIMP Squad on deck\nPIMP Squad on deck\n\n[Hook]\nHey, hey, do you wanna be famous?\nEverywhere ya go, people know what ya name is\nEveryone ya know, tryin' to tell ya, ya changin'\nThey wanna taste that (fame), that (fame), that (fame), that (fame), that (fame)\n\n[Verse 1]\nFamous, everybody wanna be famous\nMost people wanna just taste it\nOther people try to just sneak in the VIP and chill with the big faces\nThat don't really see them changes, when the fame hit\nWhen I'm up on the stage they sing it but soon as I step off they hate it\nAnd I'm sayin', I really ain't with that complainin'\nJust look at the picture I'm paintin'\nYeah I pay my rent, vacation then\nTake trips all around the equator then\nCome back to the A, hit the stage again\nThen I go up in the booth, where they cage me in\nFeel regular but then I go insane again (fame)\nIf you witness the condition that my brain is in\nYou will see I'm in Hell where Satan is\nHardest thing to do is to maintain a friend\n'Cause everybody tryin' to get paid from it\nBut fuck it, this the entertainment bus', so let the games begin\nI mean let the flames begin\nBut hey, I'm just trained at this\nLie to everybody, then get paid from it, I'm famous\n\n[Hook]\nHey, hey, do you wanna be famous?\nEverywhere ya go, people know what ya name is\nEveryone ya know, tryin' to tell ya, ya changin'\nThey wanna taste that (fame), that (fame), that (fame), that (fame), that (fame)\n\n[Verse 2]\nPopular, everybody wanna be popular\nLittle kids just be watchin' us, through binoculars\nAnd then they go to school and copy us\nBut hey, I'm not knockin' ya but how can y'all not see it's obvious\n'Cause, cops just be plottin' on us and paparazzi be spottin' us\nPlus, everybody just wanna be, on MTV or BET\nOr, maybe season MVP or maybe even just Prom King or Queen\nBut, everybody can't be a G-O to the D\nAnd everybody can't be O to the B\nBut I don't know, maybe this is just how we supposed to be\nBut this is what'll happen to y'all\nYou can go crazy and beat up trucks\nThe tabloids sayin' that ya hooked on drugs\nYou cuttin' up your face, then sew it back up\nBut look, it's plain to see, ain't nothin' in this game gonna be changin' me\nI'm a always be, O to the B, me, me, I'm famous\n\n[Hook: B.o.B]\nHey, hey, do you wanna be famous?\nEverywhere ya go, people know what ya name is\nEveryone ya know, tryin' to tell ya, ya changin'\nThey wanna taste that (fame, fame, fame, fame, fame)\n\n[Bridge]\nEverywhere ya go they just wanna be stars\nEveryone ya know wanna drive fancy cars\nEveryone ya know wants you to buy out the bar\nThey wanna taste that (fame), that (fame), that (fame), that (fame), that (fame)\nEverywhere we go, everywhere we go now\nEverywhere we go, everywhere we go now\n\n[Hook]\nHey, hey, do you wanna be famous?\nEverywhere ya go, people know what ya name is\nEveryone ya know, tryin' to tell ya, ya changin'\nThey wanna taste that (fame, fame, fame, fame, fame)\nHey, hey, do you wanna be famous?\nEverywhere ya go, people know what ya name is\nEveryone ya know, tryin' to tell ya, ya changin'\nThey wanna taste that (fame, fame, fame, fame, fame)\n\n[Outro]\nHamSquad on deck\nHamSquad on deck\nHamSquad on deck\n(Fame, fame, fame, fame, fame)", "title": "Fame", "album": "B.o.B Presents: The Adventures of Bobby Ray", "image": "https://images.genius.com/ff4d9bb096ad39d2f1abc7313779642c.1000x1000x1.jpg"}], "artist": "B.o.B"}