{"songs": [{"title": "Electric Energy", "image": "https://images.genius.com/da56947cb42116f7c3b9f723d7df591a.470x470x1.jpg", "lyrics": "[Intro]\nElectric relax\nChemical attracts\nSearch for satisfacts\nElectric relax\nChemical attracts\nSearch\n\n[Verse 1]\nShe needed relief out on the floor\nDrove from Minnesota to watch in Chicago\nHe forgot her name five minutes ago\nChanged majors in college, you know\nShe could be anybody from out on the road\nHe trying to get out of here? You already know\nHe already know how to pick em\nChicks that didn't bring a whole lot of people with em\nAnd everyone else go home but she lingers\nShe wants to make it known she's not a groupie\nDidn't even pull out his room key\nHe smiled and said, \"I know, but we'll see\"\nThe longer they talk, the closer she stand\nCasually touching his shoulder and hand\nHe telling corny-ass jokes but she laughs\nIt was over before it began\nShe said that her ex-boyfriend was a fan\nShe bout to upgrade while getting back at him\n\n[Hook]\nHigh off the (energy)\nYour lips can lie but your eyes can't hide\nYou're so high off the (energy)\nShe say:\nDo you love me, baby? Do you love me?\nDo you love me, baby?\n\n[Verse 2]\nWhether it's a dive bar or packed coliseum\nSome amount of people paid money to see him\nSo ladies want to be with him, fellas want to be him\nLot of people never got that feeling\nSpotlight gleaming, audience screaming\nReally can't blame a poor girl for dreaming\nNormal is too big a load to carry\nAt least this boy is extra-ordinary\nSo screwing him makes her extraordinary\nAt least you're at the head of the line for headliner\nIf he could be mine even for that hour\nSomehow you'll return and might absorb that power\nShe's the winner of the prize\nMuse of the music, getting him inspired\nConvinced that he sings directly in your eyes\nAnd these fans don't know nothing\nHe leave the show, they adore him and love him\nBut tonight you're the woman that holds him when he's cumming\n\n[Hook 2]\nHigh off the (energy)\nYour lips can lie but your eyes can't hide\nYou're so high off the (energy)\nAnd then he say:\nDo you love me, baby? Do you love me?\nDo you love me, baby?\n\n[Verse 3]\nHe's talking about, All these bitches in the party wanna fuck me\nHe treats them the way he feels, which is ugly\nMisery hates itself and loves company\nSo thirsty for that feeling\nDesperately need to believe what they're hearing so\nTheir smiley face replace the mirror\nFeed that ego, let's just feel, though\nStage got to be extra tall cause he feels low\nLibido fill the holes in a beer so\nMake em scream, make em cream, make em bend\nMake him forget he's more naked than them\nIn the land of make-believe and pretend\nShe loves him up like a husband\nBut he got hundreds of these, it's disgusting\nSilly little boy, do you think that she doesn't?\nBuzzards need buzzards, these are not lovers\nTwo scared suckers masturbating on each other\nDon't forget to wear your rubbers\nWhen you're high off the..\n\n[Hook 3]\nHigh off the (energy)\nYour lips can lie but your eyes can't hide\nYou're so high off the (energy)\nAnd they say:\nDo you love me, baby? Do you love me?\nDo you love me, baby?\n\n[Intro]", "year": "2012-02-15", "album": "The Bite Marked Heart"}], "artist": "Brother Ali"}