{"songs": [{"album": null, "image": "https://images.genius.com/68262ccdcbffb87427d31b0d6085c2e3.400x400x1.jpg", "year": null, "title": "Blocka (feat. French Montana, Meek Mill & Young Dro)", "lyrics": "[Intro]\nMy youngin' got the chopper\nOnce he turn around it's that “blocka, blocka, blocka!”\nGo hit 'em with the chopper\nOnce he turn around it's that “blocka, blocka, blocka!”\n\n[Bridge]\nI know you heard me through your radio\nI know you heard me through your stereo\n100 chains on with my fitted\n'Bout to kill the game, nigga, here we go\nAnd I pull that on me\nAnd the Feds got a case, try to put that on me\nIf shorty got ass, go on, put that on me\nMilli in the bag, man, I put that on me\n\n[Hook]\nAnd my youngin got a chopper\nOnce he turn around it's that “blocka, blocka, blocka!”\nAnd my youngin got the choper\nOnce he turn around it's that “blocka, blocka, blocka!”\n\n[Verse 1]\nIf you want it with my shooter, then nigga, pull up then\nHe'll knock yoir ass off for a light 10\nYou a coward if you kill a nigga in the night then\nSay you gangsta, we'll kill a nigga in the light then\nDidn't wait 'til the police come, right then\nAnd if you don't run, it'll make you look right then\nGod say it's to kill, he right then\nWe all righteous, I'm the other righteous man\nRighteous killings – do it cool as a fan with it\nOkay, that is God's work, y'all niggas is playin' with it\nManslaughter a nigga, bare hands with it\nThat nigga a real pussy, I was in the can with him\nYoung Dro, not the averager – solid gold damager\nY'all niggas sleep, I wake 'em up like I'm Rabika\nI used to fuck with Keisha, now I'm fuckin' with Tabitha\nI'm in the kitchen, flippin' this cakes, no spatula\n\n[Bridge]\n\n[Hook]\n\n[Verse 2]\nI say money is the mission, we murder without permission\nKilos in the kitchen, the pot, stove in the kitchen\nMy niggas gettin' richer 'cause niggas know they position\nIf money talk then all you broke niggas should listen\nEverybody hatin' on me, it's like, who could you trust?\nAll these hoes out here scheming, it's like, who could you fuck?\nIn this Rolls I be leanin' 'em like who gives a fuck?\n'Bout these niggas talkin' reckless\nJust know that you can be touched\nWhen that money on the line, my youngins on the line\nI'll put this money on your heads\n'Cause all this money on my mind, nigga\nAnd you don't wanna see me shine\nNigga, time is money, so I put some money on my time, nigga\nI know you hear me on your radio\nFuck around, headshots'll spill that boy's Spaghetti-Os\nAnd all my niggas tell me though\nDreamchaser, Hustle Gang, nigga, you already know\n\n[Bridge]\n\n[Hook]\n\n[Verse 3]\nHey girl, my youngin want that chain\nHe run up with that thing\nEven if he don't let it bang, I bet you won't do a thing\nYou ain't ballin like I'm ballin, I guess you don't do your thing\nI'm a mill' a movie, man, broker deals, doin' things\nHustle Gang ma'fucka, all we do is get money\nI got 100 racks, you wanna do some shit for me?\nBut That crew on your back, Hustle Gang on your chest\nMake dope music but got other shit to do in the rear\nYou got a bitch, she see me gentle, I be usually fresh\nRetarded watch on my arm, stupid shit on my neck\nWe both fuck her, let's help her, go ask her who do it the best\nI pull this shit out her pussy, she still could feel it in her chest\nWho get most of the money? Who got all the respect?\nHead light, we get the best, let them fight for the rest\nI beat you all in the ride, if I'm flyin' in a jet\nIn my 'hood you need a chopper, might get by with a TEK\nYou hear me?\n\n[Bridge]\n\n[Hook]\n[Outro]"}], "artist": "T.I."}