{"songs": [{"title": "Zeros", "image": "https://images.genius.com/f4f3c6f692c6f2761ee246e4d88da1a0.500x500x1.jpg", "lyrics": "[Intro: brandUn DeShay]\nThe old me don't even know me\nIt's crazy\n\n[Verse 1: brandUn DeShay]\nIt was a good run while it lasted, old life, see you\nNew life, hurry in, I can't wait to meet you\nSay goodbye to my car, feel bad I gotta leave you\nBut face it, nobody looking cool in a Kia\nMe, I can't wait to see zeroes after the one\nI mean, damn, there's so many zeroes after the one\nNever late, but you'll see me with the latest\nI'ma get it in 'til I'm a synonym for greatness\nTo be crazy to think it's a possibility that I've fallen\nThe way that I'm stacking, I'm screaming out, \"All in!\"\nFor those who ain't watching, I told them all, \"Watch out\"\nAnd somehow, I still get no credit, drop out\nThrew my CD in the trash, I laugh\nNow my CD on blast, I laugh\nI really can't help but feel great\nIt is funny the ones that still hate still ain't\n\n[Chorus: brandUn DeShay]\nGood morning, good evening\nGood night, nice seeing you\nGoodbye, goodbye, sayonara\nGoodbye, goodbye, see you tomorrow\nGood morning, good evening (I'll be gone)\nGood night, nice seeing you (I'll be gone)\nGoodbye, goodbye, sayonara\nGoodbye, goodbye, see you tomorrow... maybe\n\n[Verse 2: brandUn DeShay]\nAdiós, amigos, from the grown-ups to niños\nThey gon' be screaming, \"DeShay!\" like it's the new lingo\nThe lingo, I'll bet, but I'm feeling like a zillion dollar check\n'Cause I'm the one, but I'm followed by bunch of zeroes\nHe goes only where no one has gone before\nI'ma cut at the blood clot, my nigga, I'm gonna sore it\nIf that went over your head, I told you I was gonna soar\nMy wings stretched, now tell me, what I look like, walking?\nGod taught me everything without talking\nAnd yet and still, I follow His advice like I'm stalking\nIt, but the bulk of it lies in what's underneath\nI'm constantly on crack like I live under cleats\nAt the point of no return, I ain't come with receipts\nI swear I heard it before like these niggas on repeat\nI swear I heard it before like these niggas on repeat\nY'all fly, huh? Well, bring the whole fleet for the fee\n\n[Chorus: brandUn DeShay]\nGood morning, good evening\nGood night, nice seeing you\nGoodbye, goodbye, sayonara\nGoodbye, goodbye, see you tomorrow\nGood morning, good evening (I'll be gone)\nGood night, nice seeing you (I'll be gone)\nGoodbye, goodbye, sayonara\nGoodbye, goodbye, see you tomorrow... maybe\n\n[Outro: brandUn DeShay]\n(I'll be gone, I'll be gone)\nGoodbye, goodbye\nGoodbye, goodbye, see you tomorrow... maybe\n(I'll be gone, I'll be gone)\nGoodbye, goodbye\nGoodbye, goodbye, see you tomorrow... maybe", "year": "2010-05-25", "album": "Volume: Three! To Get Ready"}], "artist": "Ace Hashimoto"}