{"songs": [{"image": "https://images.genius.com/8b85f0ed9200b8df277ffa6a0112e36e.1000x1000x1.png", "title": "Give U Dat", "album": "M.O.", "year": "2013-09-30", "lyrics": "[Intro: Nelly x Future]\nFuture Hendrix (hey)\nFreebandz\nWhat's popping?\n(I can tell the way you move that body, now)\nNelly, you sing it\nAll my niggas say \"ooh\"\n(A whole lot of that, they know not a bitch can copy that)\nI'm gon' make you say \"ooh\" (Take it all off and do that, now take it all off)\nTake it all off\nTake it all off\n\n[Verse 1: Nelly]\nNow tell me where you wanna be now\nI know you wanna be here (come on)\nBut I don't see it in your body language, baby\nI just wanna be clear\nSee, I've been spending time on that other shit\nI ain't tryna get lost (lost)\nBut the way you're moving that on me, girl\nTell me, what does that cost?\nI love that real shit that feel good\nGood head that feel good\nI'mma be all off in that womb\nAnd I'm hopin' to God that you feel good\nI'mma go fast or slow, on the bed or floor\nMama, I just wanna take you away\nLong hair, you don't care\nLovin' the fact that you all in my space\nThe way you lookin' at me, that's gon' get you that\nOoh and I put everything on it\nKeep talkin' that shit that'll get you that\n\n[Hook 1: Nelly x Future]\nGirl, I swear the way you move your body (turn up)\nPut that on my mama, you gon' get that\nAnd you know I've seen a whole lot of shit\nAin't no bitch out here can copy that (ain't no another bitch can copy that - go and take it all off)\nAnd you done fucked a few of my niggas\nBut I find myself still wanting that (hey)\nHey something's wrong with my mind\nI apologize for my thoughts (my thoughts)\nI've been thinkin' 'bout that\nLet me make you say \"ooh\"\n(A whole lot of that, ain't no another bitch that can copy that)\n(Take it all off and do that, you gotta take it all off)\nTake it all off\nTake it all off\n\n[Verse 2: Nelly]\nI apologize for my thoughts (thughts)\nDon't worry 'bout my ex (my ex)\nShe was giving me fights (fights)\nWhile you was givin' me sex\nI'll throw you up on that sink, run that fountain over them cheeks\nBend you over that tub, got you hot here wildin' out on me\nYou act like a lady, you fuck like a freak\nForever my lady, you'll be a freak for me (hey)\nI'm pulling all on your hair while you got your toes curling\nYour eyes rolling back in your head\nThat good sex got you so wet you got an ocean all in my bed (oh no)\nWhat you lookin' at? That's gon' get you that\nOoh and I'll put everything on it\nThat skirt right there gon' get you that\n\n[Hook 2: Nelly x Future]\nGirl, I swear the way you move your body (turn up)\nPut that on my mama, you gon' get that\nAnd you know I've seen a whole lot of shit\nAin't no bitch out here can copy that (ain't no another bitch can copy that - go and take it all off)\nAnd you done fucked a few of my niggas\nBut I find myself still wanting that (hey)\nHey something's wrong with my mind (my mind)\nI apologize for my thoughts (my thoughts)\nI've been thinkin' 'bout that (yeah)\nSo let me make you say \"ooh\"\n\n[Bridge: Future]\nDon't we look fly together?\nJust look at us\nDon't we fly in the place together?\nWe travel around this globe, girl, we international now\nAstronaut - the kid\nAin't been like this in a while (turn up)\nAye - this rockstar lifestyle (move it)\nI'mma share it all with ya (what up)\nI'mma ball it all with ya (what up)\nI'mma splurge it all with ya\nCome and get this presidential Rollie that I've got for ya\n\n[Hook 2: Nelly x Future]\nGirl, I swear the way you move your body (turn up)\nPut that on my mama, you gon' get that\nAnd you know I've seen a whole lot of shit\nAin't no bitch out here can copy that (ain't no another bitch can copy that - go and take it all off)\nAnd you done fucked a few of my niggas\nBut I find myself still wanting that (hey)\nHey something's wrong with my mind (my mind)\nI apologize for my thoughts (my thoughts)\nI've been thinkin' 'bout that (yeah)\nSo let me make you say \"ooh\" (you know what I'm sayin')\n(I'm the greatest)"}], "artist": "Nelly"}