{"artist": "C-Rayz Walz", "songs": [{"title": "Mark of the Beast", "album": "Year of the Beast", "year": "2005-05-17", "image": "https://images.genius.com/566d299c2471c83ab1595731e9242047.1000x1000x1.jpg", "lyrics": "C-Rayz Walz ft. Buddha Belly and Honest John - “Mark of the Beast”\n[Emcee(s): C-Rayz Walz]\n[Producer(s): C-Rayz Walz]\n[Bass: Honest John]\n[BeastBox: Buddha Belly]\n\n[Verse 1: C-Rayz Walz]\nI flow, but did you also know\nI go to the dojo to practice kicks?\nNonezeo, the hats and the snares throw fits\nCatch ‘em and rip—many to send—this is wildcat music\nKentucky-Ale-drinking got the dame thinking\n“Howdy do / How’d he do it?”  Fluid the session, the essence of\nMovement.  Leo in the Pride Lands, repping\n“Guns and Butter,” “Balance” the weapon.  Check it.  I’ma\n“Protect My Family”\nLiving on the corner.  Got a\nMean “Thug Melody” blessing the verse\nMy “’86” \"Spitamatics\" is curved (Word?)\nThe “Lineups” without the police\nSting your face, red-light-district your niece\nBut, on some ludicrous shit, I’ll spit ‘til the booth is a blip\nOff the Radar.  You aloof—to “Battle Me” is bloopers on clip\n“Elephant Guns”’ll lick through the roof of your six\nThat’s mainstream piss for my “We Live” kids\nYeah, yeah, yeah, yeah.  You already know.  You thinking\n“How?”  Wow.  That’s “Dead Buffalos”\nReal is fake.  The Church versus holy smoke\nAnd a “Seal Killa” told me to vote—can you relate?\nMy “Camouflage” is Ill like Bill.  We’re still clapping\nLast seen leaving the building with an Elvis sport jacket\nRapping and laughing at thought splashes.  Bubble your\nBrackets.  I’ll “3 Card Molly” you maggots\n“Body You” bastards, walk a mile in my shoes, burn while\nMy feet hurt, but my soul’s in tune\nRavipops is a learning sensation.  They say, “Don’t do\nAnything great if you can’t handle congratulations”\n\"Revelations\" made Moses disgruntled.  I'm humbled\nYour mother should have breast-pumped you three fucks, dude\nWhen insecure, secure what is envy or suffer\nThe hell of a shell that’s empty.  Came\nPrecise.  Etch A Sketch, your beats is sick.  We the\nMen from Risk with the Solar Panelist\nBuddha Belly on beatbox, John on bass, Rayz on\nSpit, then G’s automatic, usually stick\nLunch at Red Lobsters, Michelle got spliffs\nTell her agency, “Let’s go!”  Kentucky’s the shit\nMark of the Beast"}]}