{"artist": "E-40", "songs": [{"title": "Captain Save A Hoe", "image": "https://images.genius.com/7e927a69413b81f7132bfdd5eac1c8e1.500x464x1.jpg", "album": "The Mail Man", "year": "1993-09-28", "lyrics": "[Hook: E-40 and 'Hoes']\nUh-iz-I-iz-I-should I save her?\nI want to be saved!\n\n[Verse 1: B-Legit]\nIt's 1993 and niggas need to miss me be savin' these hoes\nYou know how these tricks be, be buyin' 'em clothes\nWanna taxi hoes on vogues with the beat\nAnd have 'em sittin' next to 'em in the front seat\nBut not B see I'm a hog up out the V\nAnd my motto, is fuck a ho and hit the throttle\nTo the smoke talkin' on my Okie doe\nWorld wide I got a clydes up in Tokyo\n\n[Verse 2: E-40]\nLook up in the sky it's a bird it's a plane\nWhat's that nigga's name?\nCaptain save a ho, mayne!\nMore faster than a speeding bullet\nTo put on his cape his card\nI pulled it fake the fake the funk the funk\nTo me that's not the way to do it\nCaptain muthafuckin' Save a Ho came to me\nFlexin just like a little ol' bitch\nAll up in front of my company\nHad to check his ass with an ear check thump and punk him\nTalkin' to him while I'm beatin' his ass\nPumpin' fear talkin' bout nigga you gone retrospect somethin here\n\n[Hook: E-40 and 'Hoes']\nUh-iz-I-iz-I-should I save her?\nI want to be saved!\n\n[Verse 3: D-Shot]\nMr. super trick Mr. super snitch\nYeah, you wanna kill me cuz I fucked ya bitch\nYou should've had your cape on tight that night\nCuz a nigga like the Shot sho plugs 'em right\nAnd now yo bitch is straight callin' me lovin' me\nOn the under for the porno star that I be\nAnd don't you come in my face with that trick shit\nYou better try some more shit\n\n[Verse 4: E-40]\nI got the gift to grab any bitch\nThat I want but I don't\nCuz bitches now a days will get you caught up in some funk\nOh no, I'm not tryin' to save you hoes 'n\nHow come when I was broke you wasn't brown nosin'?\nThe other day you see me smobbin' down Magazine\nWith some ol' nigga in your car lookin' at me mean\nI stopped in the middle of the street\nReached under seat to grab my heat\nMan that's the same motherfucker\nThat I got into it with at the club last week\n\n[Verse 5: B-Legit]\nMan them niggas can't fade\nThey bitch made\nAnd so they start\nBut niggas with no heart\nDon't want no part, to this\nNigga rollin' with the Funk Mobb\nAnd when it's funk\nThe pump will spit them double laws\nSo what you doin' when we roll through you hideout\nI let my mack get off and then I rides out\nWith your ass there smokin' like an incense\nYou savin' hoes nigga and that's bitch shit\n\n[Hook: E-40 and 'Hoes']\nAh is a, Ah is a, Should I save her?\nI want to be saved!\n\n[Verse 6: Suga-T]\nI'm crossin' up niggas and bitches\nAnd even snitches just for my riches\nCaptain Save A Ho\nI ain't got no problem with that ol shit\nI gives a damn as long as he's payin'\nIt ain't my fault because he's sprung off my land\nI'm takin GA checks, go to the bank Hank\nIf your breath stank, you get ganked main\nLong as a trick comes fallin' down\nThat gets me all the sets to put on my suit and clown\n\n[Verse 7: E-40]\nBut make that nigga take care your kids\nMake that nigga call your kids his\nMake that nigga get out there and work\nMake his ass buy you a Dooney & Burke\nIt's all part of that nigga take care of me\nPussy whipped nigga come save me\nBitches out there be on the look out\nFor Captain Save a Ho\nCuz he's savin hoes\n\n[Hook: E-40 and 'Hoes']\nUh-iz-I-iz-I-should I save her?\nI want to be saved!\nUh-iz-I-iz-I-should I save her?\nI want to be saved!\nUh-iz-I-iz-I-should I save her?\nI want to be saved!\nUh-iz-I-iz-I-should I save her?\nI want to be saved!\n\n[Outro]\nFuck that what they talkin' about\nI save a ho yeah\nYeah baby, what's up? you wanna get your nails done?\nCome on let's go down to Lee and Kim Nail's\nWe can get your nails done, get your hair done\nWhat about your kids? How many kids you got? Two?\nAh, that's cool, yeah we can go feed and clothe them kids\nWe can go down and get the hook up at Durant Square\nYeah baby I do anything for ya\nWant you phone cranked on, I can get it cranked on to my name\nMatter of fact I'll get you a cellular phone and a pager\nWe can get that package deal down there at Cellular One\nBaby I'm here for you I got you"}]}