{"artist": "Watsky", "songs": [{"year": "2011-08-01", "lyrics": "[Hook]\nI ain't afraid, I'm the man, I'm the great\nI laugh in the face of danger\nI'm on the edge so you best be prepared\nThere's something in the air, it's danger\nI never cared, lions, tigers and bears\nI ain't scared, you can bring that danger\nIf you want to survive, better stay on your side\nOr you're putting yourself in danger\n\n[Verse 1]\nI drive a hooptie, not a Humvee\nMy bed's hella comfy\nSometimes I get hella clumsy\nYou more He-Man, me more Gumby\nYou more Bun B, trill\nMe more One Tree Hill\nMe Will\nYou Uncle Phil\nI'm nothing but a punk with skills\nIf that's confusing, then I'd like to ask you humbly chill\nCause last I checked, it was a fucking free country still\nI'm so hungry. It's time for din din\nWe do our thing thing\nAll we do is win win win\nAnd then draw some\nBecause I fight with my friends, and my friends like to win and they're awesome\nAnd if you cross em\nWell then you crossed me\nAnd you better watch out\nCause if you watch me\nYou know I fight to the last for my fam and my friends are my fam so a friend is a Watsky\n\n[Verse 2]\nI never pack switch blade (Danger)\nBut in the middle of the night I run a black ops fridge raid\nJackpot, man, never play the good cop\nWhen I'm at the kitchen door negotiating push pops\nI just got here. watch your boy stay\nStepped in the building and I'm chilling in the foyer\nOy vey. man I'm colder than the South Pole\nI don't give a damn if it's a no-shoes household\nThis bonehead's in his PRO-Keds from outset\nThat's why I stay grounded like a three-prong outlet\nIt's how I pull off looking like a Boy Scout, yet\nI'm rocking sneakers that are cleaner than a moist towelette\nAnd yes, my rider calls for Grey Goose and Applejacks\nHow I rose so fast from the cabbage patch\nI use some four letter curses, and then I drop a triple word score that'll scrape you in a Scrabble match\n\n[Verse 3]\nHere comes lover lover, on some other ish\nQuick to blow up like a pufferfish\nThe toughest puppet with\nPurple plush stitched in my flesh\nSnuffaluffagus up in this bitch\nOn some raw rubber ducky shit\nAnd you muggles mean mugging\nBetter cut it quick\nChuck another diss, and then pucker lips\nKiss my voluptuous hips\nAnd then button it\nStopping fuckery's on my bucket list\nI like monsters under beds, But I'm a kitties and puppies man\nSlap that peppermint frap from a yuppie's hand\nDidn't clean my room. I puff the magic dragon\nSo go ahead and stuff me in the paddy wagon\nYou dilly-dallied while I called shots\nI'm not babyfaced, my beard's got bald spots\nFresh mind, mentos for my mental\nFuck the #2, I use a #1 pencil", "image": "https://images.genius.com/c29f84b2362a2e43218c9c9f8eb13126.500x500x1.jpg", "album": "A New Kind of Sexy", "title": "Danger"}]}