{"songs": [{"title": "Where I’m From", "lyrics": "[Intro]\nYo, OK, OK, Yeah nice, OK\nListen\nWhere I'm from\nWhere I'm from\nListen\n\n[Verse 1]\nWhere I'm from its not presidents, I'm trying to see the queen\nDifferent toilet same shit, they're fiending for the big cream\nScheming their dough to the ceiling, till the no longer breathing\nAnd they do shit to make us look heathen\nThe reason?\nBorn to a broken home, tears of my mother\nOnly those that know cos they've been there through all the hunger\nOthers judge us and snub us\nThey shouldn't\nGrowing up in my house, don't think you could of\nMummy hustling, no one ever did us no favours\nExcept the neighbours\nWe used to borrow sugar and some toilet paper\nEmbarrassing when its my turn to knock\nBut its cool, what don't kill you only make you stronger\nKnow they say I'm conscious my words are positive\nIts not that, to me its just the truth is obvious\nAnd rather than talking bollocks about who I'd be clapping\nI'd rather tell the truth about what actually happened\n\n[Interlude]\nYou know\nEvery bodies killing five hundred man in the booth\nThe roads are bad but\nIf as much man was dying in the streets as was dying in the booth\nThey'd be nobody left\nStop with dishonesty man\nAll my home-boys locked up, everybody who's lost a family member\nKeep your head up\nAin't' nothing sweet in the streets\nListen\n\n[Verse 2]\nHere in England now we got bloods and crips\nI'm ashamed and embarrassed to have to admit\nOur grandparents got chased cos they were black\nNow we kill each other for colours in the union jack\nShit\nThis is not the sates, no American dream\nJust a British nightmare with a similar theme\nSame scheme, same fiend, same end to the dream\nSame church, same hurt, same mother that screams\nWith the only difference being there's no opposites here\nNo Jigga no Simmons, no positives here\nIt is obvious we are not prospering here\nWhat's horrible? I don't no if it's possible here\nOur grandparents came here invited by our majesty\nTragically just to be treated like savages\nNo Blacks, No Irish and of course no dogs\nAnd if it ain't' cleaning toilets then of course no jobs\nWith all the Teddy boys attacking us and calling us wogs\nBoys in blue at it too, apparently that's not on?\nAnd here we are fifty years later, nothings improved\nIts like we've gone back a step, like we chasing our roots\nHere we are fifty years later nothings improved\nWe've gone back a step\nBut we ain't' chasing our roots\n\n[Interlude]\nYou know\nDon't know where you come from\nYou don't no where your going\nTeach the yout dem man\nValue of self, Understand?\nWhen your watching your TV\nLearning your history book\nIts not accurate\nTeach the yout dem\nListen, listen, Because...\n\n[Verse 3]\nIts just a bunch of lies that we perpetuate ourself\nBeing from the hood is not a definition of self\nCircumstances don't define you, you define you\nMy baby diamond shines so bright it'l blind you\nThat's why I'm everywhere, fronting where rappers would never dare\nNo bodyguards, trust me my people I'm never scared\nNot cos I think I'm hard, just that iv seen your vision\nA million thugs in prison would die for my position\nThey get there so frequent for various reasons\nWhen we're told we ain't shit we really believe it\nWhether by another brother, a father, a mother\nThe television, or the teachers, police or the judges\nIts covering the fear that they already no\nYou can only break a diamond with a piece of the same stone\nWhere strong beyond measure, ask your professor\nHow do you make a diamond? A billion years of pressure\nAnd a diamond is found where? At first within the rough\nSo no matter where were at there's a diamond inside of us\nForget repping the ends, what the ends do for you?\nYour worth so much more, If only you Knew, You Know?\n\n[Interlude]\nHold your head\nAll this ends rah, rah, rah, nonsense\nThat's exactly what it is just nonsense\nAll these rappers on TV talking shit about how much they bust their strap and Yah, Yah, Yah\nYou do not listen to them, their talking nonsense\nThey live in big nice houses\nThey got security, and bodyguards, and people to take care of them\nIts an illusion, you understand?\nAnd all the bitches, and the chains and the neck lasses in the video\nIts just bollocks man, That's nobody's reality\nWhen did the hood become so sweet?\nThat's no hood iv ever been in\nUnderstand? The hood I no is miserable\nThe hood I no everybody's trying to get out of\nSo why are all these rappers dying to get back in it? And dying to be rude-boys?\nWhen all the rude-boys are dying to be legitimate\nSo, Its just nonsense man, just be honest\nJust be yourself", "year": "2007-10-01", "album": "Freedom Lasso", "image": "https://images.genius.com/c8c06fa89db19b40c9c6483e9b394b40.360x360x1.jpg"}], "artist": "Akala"}