{"songs": [{"title": "Sovereign Master", "lyrics": "[Akala : Interlude]\nAkala\nSovereign Master\n2015\nMC shit, Science\nGet to training younguns, get to training\n\n[Akala]\nMy artillery's full to the brim\nWith a criminal syllable peel back skin\nIt's a sin, more than a loss or win\nIf you take on him I will break your kin\nWith the words i'm ashame him\nCos with the words i'm a shaman\nSpiritual mind elevation\nBack through time on the back of the rhyme\nShackles align through back of my spine\nCapturing rhyme all the facts in the line\nAnd the timing is frighting, i'm brighter than lightning\nNot a man, a character from a movie\nI chew through metal while my hand breaks Uzis\nWho's these floozies?\nClaiming they wanna slew me\nDo what you you gotta do G\nI quite like fighting i've made that clear\nTake your career and replace it with tears\nThe Shakespeare is here i take fear and peer\nInto the hearts of men and show you they're cowards\nBut I never allow em, i'm sending them flowers\nLike five man on earth that can rap with this shower\nCapture, empower, in fact i'm a tower\nMy roots go 10 miles down in the earth\nHow you gonna knock man down?\nSilly little clown, when you got a dig down first\nWho wants what with he kid i'm the best\nI don't mean it in jest like most rappers do\nDo yourself a favour look back through the albums\nMixtapes, and tell me who\nHas been so consistent with blistering speed\nResisting the system not captive to creed\nPut things over a person\nVerbally i'm worser than the most of the worst of em\nPut a hearse on em, see how it looks\nPut a verse on em, see if he shook\nWorse than a crook, see the words that i took from their language\nI mangle more man that banners starred spangled\nCos i'm a vandal\nYou look dumber than man wearing socks with their sandals\nSome man still do it tho, no shame\nUs man still slew it tho, no strain\nWho said you'll go through with no pain\nThey should have told you it is no gain\nThe A with the A with the A with the A\nAnd i stay every day every day every day\nCos i'm harder than Bane was, Fuck Batman!\nSome prick just defending the system\nYou all know my name cuz, we attack man\nGet moved along like blacks out of Brixton\nFact not fiction, practice my diction\nRip these pricks like zips when you'r zips (?)\nIf I catch you, stiff as a statue\nPain is too much for you to react to, so you just freeze\nI don't really mind, i'm pleased\nBetter than your talk just breeze, jheeze\nYou don't wanna ramp with these\nSiamese flows cos i'm stuck to the beat\nChief, you don't really know that's its peak\nThe flows so cold better hold your receipt\nAnd take that back back, when you sold crap crap\nWhen ya hit back back, akala is back back\nThe world so gully, they could all rap about books\nStill have the hood go bap bap, fam\nIt ain't that ive seen the strap stuff, i see the bigger picture of where we are trapped at\nA junction, a function, people are munching on our flesh\nCos were meat for the luncheon\nSo i punch them, ones that come with assumptions\nThat i won't rumble for lunches\nIm hungry, i'm starving, bones i am munching\nFuck crews im taking on countries\nWhy bring your rap to a nuclear war fight?\nGive it 2 sec, be dead like your hype\n10 years and ive been round the world twice\nWhy am i lying? like 10 times\nAnd i bend rhymes lines, to ascend minds\nAnd i'm 10 times guys that your friends hype\nYes im the best and im blessed ,so don't test\nWho ever questing whether knowledge is power, are you fucking deaf?", "year": "2015-03-30", "album": "Knowledge Is Power II", "image": "https://images.genius.com/7c518a58eebfd479e5ad2216b0cd1a85.1000x1000x1.jpg"}], "artist": "Akala"}