{"artist": "Professor Green", "songs": [{"album": "At Your Inconvenience", "title": "How Many Moons", "image": "https://images.rapgenius.com/77fac9cb635136345d2df6c14f88ad3b.1000x1000x1.jpg", "lyrics": "[Intro]\nHow many moons?\nHow many mornings?\nHow many moons?\nHow many mornings?\n\n[Link: Professor Green]\nHave I got left til ive no breath left to breathe?\nHow long's left for me?\nFor whatever the time, for the rest of mine\nI'm gonna spend time putting an end to my\nEnemies who wanna put an end to my shine\nWhy bother try offending me?\nIts off with the heads of these swines\nWhen I sign out you're gonna remember me\n\nRemember me? Don't nobody wanna send for me\nThe only time they mention me or speak or me disrespectfully is when they sleep\nI've been between a lot of legs of a body of a centipede\nPlease enemies be more courteous, save me the sweat and forget to breath\nLife could be easier I could ease it up\nInstead I look like someone tryna squeeze a dump\nAnd I haven't eatin in months so I need these MC's on the edge\nIll be the reason they jump off\nRemember the jump off\nWhen I come forth\nYou dont wanna be the MC I run towards\nI like my liquor like I'm straight I ain't no Dumbledore\nUntoward two sluts like I love and adore you\nBut this custom I come before\nAnd its cool if I can't get it up coz ive got a cucumber for you\nFuck the world ima stick it in mud\nAnd stingy wanna drink you can piss ina cup\nI leave women as livid as stunts\nSo run your lips ive been itching to give a chick a bit of a cunt punt\n\n[Hook]\n\nWhen I sign out you're gonna remember me\n\n[Verse 2: Professor Green]\nSanity I squandered it\nI think I've gone too far in darkness I'm wondering\nGhetts hes pissed he ain't on the list\nWell im pissed im not on the top of it\nDeep in thought conspiring\nGet the fireman\nCall my thought\nA firing frime(?)\nNot twiddling thumbs\nI'm playing the worlds smallest violin\nInconsiderate like I give a fuck how they feel\nKidnapping rappers and having them as microwave meals\nI know my meals ready when the microwave stops\nI'm a lot more Jack Nicholson than I am Michael J Fox\nThe creep that crept up on Pixie Lott.\nIn the baby grow\nI sat on her knee and told her to touch me inappropriately until my daisy grows\nI'm not a man of her man kind\nMechanical mad man\nI make Hannibal look more like an Annabel I'm an animal at night\n\n[Hook x2]", "year": null}]}