{"songs": [{"year": null, "image": "https://images.genius.com/89832a7bf265136f6424a7eb8cf3facb.300x300x1.jpg", "title": "The Gender Confusion Rap", "album": null, "lyrics": "There's girls who look like guys\nAnd they got the thighs that real girls have\nBut we're talking about eyes\nThey got Congenital Adrenal Hyperplasia\nIt's really (?) asthma\nJust like that, now I'm going to let you know what it's about\nSo here I'm going to tell you. Let's start it out\nWe got (?) they look like guys\nI told you before, you can't really see\nBecause I can tell you now, they don't look like...guys\nBecause\n\n.........\n\nToo much adrenal in your system you look like a guy\nMake little girls want to cry\nBut I tell you now, there's no hope for that\nBecause unfortunately we can't cure it\nThey can't get the anger out of their system\nAnd now there's going to be a huge\nMis...conception\nThat their going to be going through their life\nThinking that their a guy\nBut their going through a deadly crisis\nBecause now it's time to see who's going to get (?)\n\nSo let's see, (?) X chromosome\nGirls want to take it\nYou try to do the opposite, you're on your own\nBut nobody knows its going to be very controversial\nWhat are you going to get?\n94\nIt's always been a hit. Approved by the FDA\nBut here, now that's all I have to say\n\nBut now lets cover the next disorder\nCalled Turner's Syndrome\nWhen girls only have one X chro-mi-sum\nYou heard me right\nI rhymed that correctly\nNow you don't even say anything, because I did everything...blindly\nNow let's go on. We got Klinefelter's Syndrome\nWhere (?)\nThat's where there's no lie\nThere you see they got a weird thing between their thighs\nAnd I'm not going to stop there\nI did it, you all just stare\nPlease don't be rude. Don't stare at me\nWho do you think I am? Some kind of fantasy?\nNot I'm not like that. Don't say that at all!!\n\nSo let's go on to the last thing we have\nCalled (?) Syndrome\nSo bring on your insults. Something like that\nCause they look like a guy\nBut they're not. They're a girl\nYou see? I mean, this is very serious\nDon't think I'm delirious\nI'm not rapping for you to be your entertainment\nI'm telling you you could kill yourself and die in this world\nA bullshit thing. We got mean people that look like\nThey are different genders\nStuff like that. So we don't have to get fender benders\nSo we'll see who's right\nAnd now that's why I wanna end the rhyme\nWith me true fans in this world\nIt's called Compton...California\nWHOOOOO!!"}], "artist": "Big Mike"}