{"artist": "Willie D", "songs": [{"year": "1989-12-21", "lyrics": "* (Prince Johny 'C', Juke Box, DJ Ready Red) - original 'Geto Boys'\nThis song was reissued with a different lineup\n\n[ *phone conversation* ]\n[ Willie D ] Underground Master speaking\n[ Lil' J ] Yo D, what's up?\n[ Willie D ] Just chillin, man, what's up?\n[ Lil' J ] Give them Ghetto Boys a ring, man\nHold up now\n[ *dialing* ]\n[ Johny 'C' ] Geto Boys\n[ Lil' J ] Hey\n[ Johny 'C' ] What's up, J?\n[ Lil' J ] Yeah man, I got Willie D on the other end\n[ Johny 'C' ] What's up Will?\n[ Willie D ] What's up now, what's up, fellas?\n[ Johny 'C' ] Y'know\n[ Lil' J ] Say fellas\nI been kicking a few lyrics in the back of my mind, man\nAnd I'm tired of muthafuckas disrespecting us\nBecause we're black owned and won't sell out\n(Word)\nSo check this out\nWe need to get together\nAnd go to that other level of the game\nAnd do it like a G.O\n[ Johny 'C' ] Say no more, we're on the telephone\n[ Willie D ] We get them muthafuckas, man\n[ Lil' J ] Well, let's make em a offer they can't refuse\n\n[ Juke Box ]\nI'm back like a rebel making trouble\nI'm an assassin, kickin ass on the double\nNo muthafucka alive's gonna stop me\nSo fuck you and your goddamn posse\n[ Willie D ]\nIt's time to step on some muthafuckin toes\n(Nah, D) man, fuck them hoes!\nThe East Coast ain't playin our songs\nI wanna know what the hell's goin on\nGive me my card, radio sucker\nI'll kick your ass and take the muthafucka\nEverybody know New York is where it began\nSo let the ego shit end\n[ Prince Johny 'C' ]\nBlack radio is being disowned\nNot by the other race, but its own\nA lot of bullshit records make hits\nBecause the radio is all about politics\nPrince Johny 'C' is my identity\nWhoever you be (don't) (don't) (don't fuck with me)\nMy last go\nThe radio struck me with a low blow\nNow I'm doin it like a G.O\n\n(Go, go, go, go..)\n\n(Let's make em an offer they can't refuse)\n\n(You wanna go to war?\nWe'll take you to war, okay?)\n\n[ Willie D ]\nEverybody's coming with guns\nNiggas gettin pimped by Columbians\nThey put em on the streets like a bitch\nNiggas slangin but the Puerto-Rican gettin rich\nI never sold the mess\nBut if I did, it would be for my goddamn self\nCan you adjust to the wholesale bust\nBox, tell these muthafuckas what's up\n[ Juke Box ]\nWhen will you stupid muthafuckas learn\nIn this game one way or another you get burned\nYou end up behind bars\nOr lying on your back in a muthafuckin morgue\nAnd your gal'll find another nigga\nCause the low-life bitch ain't nothin but a gold-digger\nI'd fuck her but my money is a no-no\n(Why?) I'm a ho so I do it like a G.O\n\n(Go, go, go, go..)\n\n(Let's make em an offer they can't refuse)\n\n(You wanna go to war?\nWe'll take you to war, okay?)\n\n[ Prince Johny 'C' ]\nFucked up politics\nThose tie-wearin bitches can suck my dick\nThey try to ban my style of teachin\nBut freedom of speech allow me to keep speakin\nTo the people, about shit like racism\nIt's deep into the heart of the school system\nWhites get more funds from the state\nAnd this is why minorities learn so late\n[ Willie D ]\nSome of us make it to college\nAnd take a test to the highest degree with limited knowledge\nMost of us won't pass the bitch\nAnd those rotten-ass muthafuckas know this\nI'm not Malcolm X or Farrakhan\nAfter this one I guess I'll have to pack a gun\nSo if you wanna fuck this brother\nYou better be ready muthafucka\nOr you gonna have to G.O\n\n(Go, go, go, go..)\n\n(Let's make em an offer they can't refuse)\n\n(You wanna go to war?\nWe'll take you to war, okay?)\n\n[ Willie D ]\nWillie D is not a biggot and he won't be\nI just educate minds to reality\nThis ain't no muthafuckin 'back to Africa'\nTry to pull that shit, we'll have a massacre\n[ Juke Box ]\nOur ancestors were killed at will\nBought and sold like a used automobile\nWe fought back to exist\nNow we're killing one another, ain't that a bitch\n[ DJ Ready Red ]\nReady Red, I'm comin at ya\nI'm holdin my ground like a muthafuckin statue\nYou take nothin from me, so stop trippin\n'less you want to take a muthafuckin ass whippin\nBitch, muthafuck the KKK\nWearing dresses and shit, what the fuck is they, gay?\n[ Willie D ]\nA color blind society we'll never be\nUnless we agree (in harmony)\nTo do it like a G.O\n\n[ *phone conversation* ]\n[ Lil' J ]\nRap-a-Lot\n[ 'President of White Owned Records' ]\nHey J, this is the President of White Owned Records\nWe see you're still survivin but we want to ask you to keep your boys quiet\nIf you don't, we will\nOr here's another alternative\nWe take 95% of your company and you take 5 and we'll make you famous within 10 years\nIt would take you a lifetime by yourself\nBecause you know your people don't stick together\nWhat you say about that, boy?\n[ Lil' J ]\nMan, fuck you\n[ 'President of White Owned Records' ]\nI would advise you not to talk to me like that, boy\nJust who the hell you think you are anyway?\n[ Lil' J ]\nI'm Lil' muthafuckin J\nI ain'ts to be fucked with\nAnd if you wanna go to war\nI'll take you to war", "image": "https://images.genius.com/03c2b50829c5f112b3f64d1ceaa1bce1.700x700x1.jpg", "album": "Controversy", "title": "Do It Like It G.O."}]}