{"artist": "Benzino", "songs": [{"lyrics": "[Benzino]\nBenzino, unhh!\nThrow 'em up\nUp here in the 6-1-7\nRay Benzino\nYo, killa tactics\n\n[K.T.]\nYo, why y'all niggas wanna test me, I'm out your division\nI got more bars and hooks than Mike Tyson in prison\nListen, you ain't gangsta, killa\nShorty sure only boy you touched befo' is Vicks 44\nHoes should squeeze fern, spread like a sick germ\nHave niggas face down on the floor like they doin the kick worm\nThink something sweet with me, try me\nAnd watch how fast I rash on niggas like poison ivy\nCats claim they got guns, they scared to dunk\nI thump on a nigga back like I kick 'em between the trunk\nWhen Boston's in the house niggas head for the exit\nI put the toast in they mouth like it's breakfast\n\n[Prince]\nThese niggas hatin my guts cuz I'm raking in bucks\nHavin straight parties with nothin but bitches with C-cups\nModels with manicured hands, livin my feet up\nYo, let's speed up, I leave the week later, traitor\nI gotta spray ya axe up crooked, I'm doin you a favor\nLook at you ain't a playa so, you'll hate on me later\nI decorate ya clothes, puttin holes through ya paper\nReck those, respect the flows and catch kang-goes\nProfessionals tell me I'm the next to blow\nYeah pop, I already know, I'm just perfectin the flow\nI got bitches at my window, I get sex to go\nEven though I hate nosy hoes like I'ma go-star\n\n[Smoke]\nNiggas ask me, Smoke why ya go so hard?\nI'm tryin to get sucked off in the Benz Coup Drop\nTryin to have all my C'z niggas shoot for the stars\nMy nine stars spread bullets like grey poupon\nI'm tryin to ice on my wrist and on my arm\nWith the high beam shit so frigid it won't visit\nOr put that nigga Jake up out of business\nYou niggas know fast life, niggas blast nines and toss 'em in a bucket full of acid\nNow, if I don't leave a nigga and I see you cast up in the pod'\nTo his motherfucking mouth he ain't gotta have asthma\nI hold down blocks like Mutombo, and check with the muzzle\nGot niggas yellin \"break!\" runnin different ways\nLike them bitch-niggas was comin out a 'hugem\n\n[Chorus: Benzino]\nMy Boston niggas wanna ride\nMattapan niggas gonna ride\nRoxbury niggas wanna ride\nDo you wanna ride?\nTell me, do you wanna ride?\nSouth End niggas gonna ride [Throw 'em up]\nHyde Park niggas wanna ride [Hangmen 3!]\nJP niggas gonna ride\nDo you wanna ride? [Un-hunh]\nTell me, do you wanna ride? [What!]\n\n[Luv]\nThe blazin spot is here, take a shot wit me\nI prefer the grey guch short a Hennesey\nMy chicks pull out your door, go and buy the bar\nTellin you don't even ride you got your own car\nMy fellas, who ain't come through don't sweat us\nSome of ya girls is watchin and they probably get jealous\nWe rock the club all out, rock the bra\nComin through and throwin like Michael's glove\nI show ya love, only if ya down to get dirty\nMy niggas in the back, I don't think y'all heard me\nBring ya ass in the front, get crunk and corrupt\nGrind up on a chick that you know you wanna fuck\n\n[Weirdo]\nI've been known the toughest nigga, my pockets a size bigga\nInch taller, nigga, don't fuck with a true baller\nWe so harda, how do you think, we in Impalla?\nWe spendin on them drinkies, my remiss a bit louder\nStrong power, murder dungeons with promptness\nFuckin wit doe and twist ya cock to ya casket\nYa left on the scene, pockets ripped off ya jeans\nAll crunked up and lunked up, my attitudes mean\nYa know Minks wantin it, Franco Harris runnin it\n38 Mag, I thump on faggots comin wit\nMy hands, they chop grands, pop cannons\nSock drop dudes same spots that they standin\n\n[O.T.]\nIt's that bastard child, small frame, heavy waist\nWith that raspy crowd reck shop everyday\nNiggas test the blaze, bullets move steady pace\nGettin hot burns, still a few on your waist\nI got a fetish for cream mixed with ash and green\nEyes blood shot red when I pop on the scene\nI got a few niggas with me and they grills is mean\nDrunk pissy in the lobby, niggas shout in the Beam (Hello!)\nTimbaland's be fitted, Jeeps that tinted\nOn some 20's, like whoa, with the gleam all in it\nA nigga take it how they want it, son we in it to the finish\nRob Low and 'Zino, niggas ain't fuckin wit it\n\n[Chorus 4x]", "image": "https://images.genius.com/ab64bde2620df28863f2c6355a1da426.600x600x1.jpg", "year": null, "title": "Throw Them 3's (Boston Niggaz)", "album": "The Benzino Project"}]}