{"artist": "Phife Dawg", "songs": [{"album": "Ventilation: Da LP", "title": "Flawless", "image": "https://images.genius.com/7b15bd4cebb535f1f46449b1258fd434.500x500x1.jpg", "lyrics": "[Intro: Phife Dawg]\nOne time, yo\nYo, you know what?\nI might not always say the right thing\nBut I say what the fuck I feel\nOn the real\nWhat the deal\nKnawmean?\nWorld's greatest five-footer back up in yo shit\nCheck it\nLet me ask you\n\n[Verse 1]\nWho these cats, lookin' punanny-ish?\nFor those who don't understand, that's some vagina shit\nI think I'm lost, yo, tell me what you're dealin' with?\nNiggas' rhymes be watered down like porn star clitoris\nIt's so ridiculous, you're soundin' hideous\nTalkin' tough, but be dressin' on some wussy shit\nTight see-through shirt, on some hard nipple shit\nFake Versace shades while all up in the club and shit\nFake Rolex, it'll change the color of your arm and shit\nSports bras, halter tops, what the fuck is this?\nDudes be brought up just to sell some records? Shit\nThen wanna be voice of the streets, you see this bullshit?\nWait... if you gon' half-step in hip-hop, you need to stop\nThis here remains in the street, play puss, you're gettin' fucked\nGo 'head, play yourself with them ho-like hooks\nSing ballads if it's all about the Maxwell look\nMack make-up with a pair of Wallis thinkin' you're cute\nFubu suit with Steve Madden boots make me wanna puke\nPhat Farm shorts with a garter belt, lookin' like a whore\nOr a purple bandanna 'cause it matches your shaw?\nNow tell me, what you rhymin' for?\nThis shit is all about flows, fuck a fashion show\nHip-Hop 101, Professor Diggy, yo\nAnd if you want it laid back call Kenny Lattimore\nNo disrespect to these men, 'cause I like R&B\nBut right here in my class we gonna emcee\nIt's all about the zigga-zigga, yeah, the scratch 'n' cut\nGraffiti art, jammin' in the park, holdin' your nuts, motherfuckers\n\n[Hook]\nI am hip-hop, I walk hip-hop, I talk hip-hop\nI need hip-hop, I lust hip-hop, I love hip-hop\nB-Boy round the clock, doin' it non-stop\nFlawless!\nDiggy gon' hit you with the rawness\nPass me the mic and I'mma scorch it\nAnd when mi done with it, mi just toss it\nBut never force it\nMy shit is flawless\nMutty Ranks hit you with the rawness\nPass me the mic and I'mma scorch it\nAnd when mi done with it, mi just toss it\nBut never force it\n\n[Verse 2]\nPeep the Groove Attack ensemble, we about to fly high\nFuck majors, we independent like the 4th of July (Why?)\nI guess we didn't really share the same vision\nBut it was their decision\nThem fuckers just wouldn't listen\nBut now look who's bitchin'\nWhile Phifey cuts with precision\nIt's my ass they're kissin'\nDon't worry 'bout what I'm shippin'\nAs for Jive, I know they hate on how I blow up the spot\nHow quickly they forget what got they ass to the top\nWhat they figure, I bust my ass to feed they dirty-ass kids?\nGet the fuck out of here, fuck am I, Britney Spears?\nThese cats'll turn you against your brethren if you let 'em, and how\nIt's the reason me and my former partner don't talk now\nCommunication is the key, capital word be unity\nThese folks will guide you to your grave, then come and read the eulogy\nIndependent like Philly, majors can't do shit for me but suck mi toe\nGo find a MC with some half-assed flow\nBut I understand these styles, they just quickly endin' now\nForever wantin' to play games, but guess what, I'm not a child\nFor the new breed of MC's: learn to own your shit, gee\nStay black, keep it real, purchase at [Name]\nFuck a waiting to exhale, Malik is at once released\nWhile all you so-called CEO's and A&R's get impeached\nSay Fudge - you shoulda never let me off the damn leash\nHa-ha! Arrrf!\nNow break it down now\n\n[Hook]\nI am hip-hop, I sleep hip-hop, I want hip-hop\nI love hip-hop, I lust hip-hop, I need hip-hop\nB-Boy round the clock, doin it non-stop\nAnd I'm flawless\nDiggy gon' hit you with the rawness", "year": "2000-01-01"}]}