{"songs": [{"image": "https://images.genius.com/20598b801c3dafa38d796c0b2ae97899.1000x993x1.jpg", "lyrics": "[Intro]\n(Mac Dre):Rocc, she look kinda cool huh\nI like the look but what's in the purse mayne?\nThe look is cool mayne, but baby what's in the purse?\nThe look is cool...\n\n[Verse 1: Mac Dre]\nHe don't get out it cause he think he can't afford it\nI'ma play the bitch like a tape recorder, I make nacho\nI get cheese and chips she don't got dough? I'ma leave the bitch\nCause a bitch with no money can't give me no money, she always laughing but ain't a damn thing funny\nThe joke's on you baby, you're through baby pretty face and big booty just ain't gone do baby\nWhere I'm from? bitch you's a loser\nI'm a woozer? Nigga I'ma use her make the bitch run like she still in [?] and get thick faces\nI'm Mac Dre this the big ole pimp\nHe in the Benz behind the tint\n4 EV's 4 EP's playing BBD's going off three G's\n\n[Verse 2]\nI get money nigga, she get money bring it all to me\nStalking a [?] put miles on her feet yeah I know\nI'm this, I'm that I ain't shit but I'm only out to ball leave it all on that bitch on my whips\nOn my fits and on my chips we got big grip, big deals and big hits plus I spit big game\nGet up in your bitch brain convince her to get changed motherfucka it's a pimp thang\nThat's trill mayne I'm all about stacking a grill (while my hands are writing raps count cash and slapping a bitch)\nI'm up in this bitch when I do this, nigga I recruit chicks like the high school in a young bitch ear like a cutip\n\n[Hook]\nIn the skates or at the mall, I'm still collecting drawls whether darksin or red bones, fresh hair and painted toes\nWhen I leave they're on my phone, cause I'm all in their dome\nAnd my goal's to hook them all, to make my cash withdawls\n\n[Verse 3]\n[?] produced big body tours\nNow I peace like a cannon it's so heated\nDime piece she understand it so I feel I beat it\nDropped her off then skeet see I'm a young Mac\nManipulating young racks to get my chips, [?] to my lips tricks follow her here\nGet more cheese than [?] sit on cheese and whips [?] to get cheese\nCall me valvida mob is dangerous like a 7o with a heater\nSaid her name was [?] you don't need her non-profit organization let the whip fill feeder\nWith pimp shit I greet her campaign like I'm running for office\nCampaign cause you know who the boss is\nIt's genuine [?] Sidewayz spin the past winning all fast\nMoney off the track like their [?] these squares ain't eating\n\n[Verse 4]\nI've been on some whole other shit\nBut it's time to go I been first to get to moving on a nigga like he was a prison snitch\nScrubbing niggas off the map like some Ajax stuck a pitbull bitch watch out for this pimp attack\nI got to lace this track like a taylor lace a Mac\nExplaining how I make money fall out the buttcrack\nEyes glossed up from fucking with the ecstacy silly [?]\nBest to be dude always on your P's and Q's like Brotha Lynch mayne [?] refuse to lose\nBut in this game you guaranteed to get knocked and bruised\nBut stay pimping dude [?]\n\n[Verse 5]\nWell it's official I'm a factor in these streets (streets)\nWe jack niggas for beats and give a fuck about making enemies off Hennessey and Remy so I'm a goddamn fool\nCatch a bitch with a government check and I'ma cop that too\nTake the DF tattoo but it's not for dungeon families thats for [?] finest tell me do you understand me?\nI'm sour, never sweet like candy bitches tryna get at me cause of this pimping mentality [?] now they mad at me\nFor the shit that I did to this kid got her coming out that dig now we're doing it big\nWe stacking up chips to back niggas up off the dick cause they hating all on my status [?] to living lavish\nBut I still manage to remain savage avoid faggots got it snatching habits dangnabbit its cold mackin\nSnatch up for this fame if you lames can't feel me and dig deep off in your brain and put this thang to make you feel me\n\n[Hook x2]", "year": "2008-02-05", "album": "Starters In The Game", "title": "Cash Withdrawls"}], "artist": "Mac Dre"}