{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/156826eec8abcbfc5b1bc92593d06634.640x640x1.jpg", "title": "Day Job", "year": "2016-12-25", "album": "Jonah", "lyrics": "[Verse 1: KJ-52]\nI met this dude one night right up at the door\nSaid kind of rude \"who are you what you looking for?\"\nI said \"nobody it's the stage that I’m heading toward\nI’m on in 5 its about to rain bust a pour\nMy name’s on the page the same on the board\nCan I go in this way plus I’m on the tour\nI'm KJ I rhyme and plus do it for the Lord\"\nHe said \"not tonight\" and went and slammed up the door\nI’m like oh no everything’s a no go\nStanding in the rain my cell phone like no no\nScratching my brain like I'm stuck out my own show   \nWant to complain till a fan was like \"oh yo\"\nAnd then he rolled up began to walk\nSaid \"I been listening to you since you DC Talk\nCan you sign all the CD's that I got\nTobyMac your the best man you really rock!\"\n\nIf I had stayed at that flower shop\nI could’ve been a manager but now\nWhat you think about that, what you think about that?\nOh what am I to do\nProbably should’ve went right back to school\n\n[Chorus: Sean C. Johnson]\nJust like momma said oh just like momma said\nI should’ve never quit my day job\nI should’ve never quit my day job\nI should’ve never quit my day job\nI should’ve never quit my day job\n\n[Verse 2: KJ-52]\nSometimes I wonder what I'm rapping for\nFirst I’m Eminem now I'm Macklemore\nThey box you up they wanna stick you in a category\nI'm never stuck I dodge the bull like a matador\nStank eye walking in the door\nRap game Larry Bird but I’m in another sport\nI break ankles and I shatter boards\nAnd build a ladder to the God that I’m rapping for\nBut they never ever seem to get it tho\nSome say I'm tobyMac others thought I'm Mineo\nSome think I'm only wack others think I'm criminal\nStuck up in the middle like rap game little bro\nStanding here feeling like a jerk\nHolding a pose with a fan till my hands hurt\nCause her man can never make the cam work\nWhile they holding up another rappers fan shirt\nIf I was still a traffic cop\nCould be working homicide but now\n\nWhat you think about that what you think about that?\nI should’ve never quit my day job\nI should’ve never quit my day job\n\nNow straight off people think I’m straight odd\nCause I praise God and rapping is my day job\nI'm sitting on plane waiting just to take off\nDude trying to guess what I do but he way off\nFirst I'm a DJ now I'm just a drummer\nSays KJ-fifty-two, that's a funny number\nI been doing this like 20 summers\nI took the diss but I reminisce kind of wonder\nWhat if I never quit my day job?\nJust pulled a 9 to 5 trying to get my cake off\nWould the ones that you saved would’ve strayed off\nI'd rather struggle in the will of God then lay off\nHate all well you can say that I Straight soft\nLife is a game and I’m gunning for the playoffs\nSo I’m glad to say I never quit my day job\nAnd I’ll never be ashamed or try to play God\n\nIf I had stayed at that flower shop\nI could’ve been a manager but now\nWhat you think about that what you think about that?\nOh what am I to do\nProbably should’ve went right back to school\n\n[Chorus: Sean C. Johnson]\nJust like momma said oh just like momma said\nI should’ve never quit my day job\nI should’ve never quit my day job\nI should’ve never quit my day job\nI should’ve never quit my day job\n\n[Verse 3: Sean C. Johnson]\nHello Miss Johnson\nWill paper or plastic be ok\nOk\nYes, yes still working on the music thank you\nThank you for asking\nOk, I won't quit my day job, thank you ma'am\nYou need help with these to the car?\nNo? Ok, well you have a nice day, Miss Johnson, ok\nI hate this job"}]}