{"artist": "Young Thug", "songs": [{"year": "2019-05-19", "lyrics": "[Intro]\nYeah, yeah, oh yeah (Thugga)\n\n[Verse 1]\nI got big rocks like the ruby fox\nBig ol' cock like it's two of y'all\nWe the Red Sox nigga, who is y'all?\nThat ain't it nigga, who done lost?\nI can't lose a thing but my voice\nAnd that's my choice\nI drink that Act' all day, my throat is moist\nI fucked your bitch, she don't even know my voice\nShe fucked my crew, she say she didn't know them boys\nI hit momma behind a dumpster\nShe want that wood, she want that lumber, jack\nI fucked her good, she said it was like crack\nI knocked that pussy out the park, bat\nI knocked it out the park and she threw it back\nI can't see in the dark baby, who is that?\nShe like \"Baby don't worry, they them alley cats\"\n\n[Chorus]\nJump up out the pussy like a egg\nBack up in that pussy like [?]\nI want that Ac' and they drinking that red\nI pull up on a kid if he play with me, kid (I swear)\nI'm in a Belgian, Quinton (Belgian, Quinton)\nI wan' be loving Quinton (Loving, Quinton)\nI wan' be Balmain, Quinton (Balmain, Quinton)\nBaby, just bring back Quinton (Bring 'em back)\n\n[Verse 2]\nThat's my brother, (Rip) named Bennie\nReal name Quinton (Rip)\nYou gone, but we not forgettin' (Swear to God)\nYour son, he act like you, dog\nHe just shot up the fuckin' mall (Brrrrrt)\nHe just shot at my big dog (Real talk)\nHe just (He just what?)\nPut that dick inside a bitch like logs (Hee hee)\nFuck a hater name on a scratch paper (Swear)\nHo I laugh cause I might just cry later (Ha)\nFaceTime with Lyor, he in Barbados (Barbados)\nBeat that pussy down then turn to a caterer (Woah)\nLike, what you want? I got homies on the platter (Yeah)\nBeat that pussy up, kidnap her\nBlue hunnids like a book nigga, chapter (Woo woo)\nYeah, you know the slimes out of character (Slatt)\nFuckboy, (Slatt) fuckboy\n(Slatt) Fuckboy, yeah fuckboy (Hey)\n\n[Chorus]\nJump up out the pussy like a egg\nBack up in that pussy like [?]\nI want that Act' and they drinking that red\nI pull up on a kid if he play with me, kid (Skrrt)\nI'm in a Belgian, Quinton (Hey)\nI wan' be loving Quinton (Loving, woo)\nI wan' be Balmain, Quinton (Balmain, yeah)\nBaby, just bring back Quinton (Rip)\n\n[Outro]\nYeah, we make noise\nYeah yeah, we make noise\nYeah yeah, we want war\nWe want smoke\nYeah yeah, we make noise\nYeah yeah, we want noise\nHey, noise\nWe want smoke, we want noise\nWe want smoke, we want noise", "image": "https://images.genius.com/717461618e785def35d07de6484b7ad4.1000x1000x1.png", "album": null, "title": "Belgium"}]}