{"songs": [{"image": "https://images.genius.com/dbcd490793dbd440c50321b2ce1287ef.1000x1000x1.jpg", "title": "Outro", "album": "Perception", "year": "2017-08-02", "lyrics": "[Verse]\nI'm dedicated, the definition of dedication\nWrote this whole record while I was levitating\nSittin' in my room with the pen and paper, I'm innovative\nThey've been afraid of me since I was a second grader\nI'm the kid on the playground mama told you to never play with\nThere's levels of music—and I'm in the elevator\nGoing up to the top floor, look how we elevated\nWhat, you don't know the brand by now? You better get educated\nTake both of my arms, rip 'em out the sockets and separate 'em\nForgive me, yeah, I know I get animated\nDon't matter, I still write a better record than yours without a hesitation\nNever been more motivated\nJust look at all the minds I have opened and penetrated\nSee, I am the voice of all these kids that think things, but never say 'em\nThat's why they come to my shows wearing the NF hoodies and hats low like we're carrying weapons, ah!\nPut the controllers away, it's game over\nI promise I'm way colder\nThe fans keep saying that they're hungry for new music\nWell that's pretty convenient 'cause I just made a plate for 'em\nAnd I don't hear what none of y'all are saying\nI just sit at the keys feeling the music\nGot me thinking I'm Beethoven\nThe game needs a makeover\nIf you've been waiting, the wait's over\nYou ain't notice, y'all about to witness a takeover, I'm home!\nYeah, they waiting on me to match the\nEmotion that I had in the last one\nWhat if I don't, they gon' tell me that I'm losing my passion?\nIf I do, am I repeating my actions?\nYeah, look, \"How Could You Leave Us\" is massive\nThere ain't nothing I can write that'll match that\nMy biggest fear writing this record wasn't putting out trash\nIt was disappointing myself and the fanbase\nNow I want you to picture me:\nI'm in a hotel rapping, crying on the floor of the bathroom\nStaring in the mirror, my room, hands shaking playing \"How Could You Leave Us\" through the speakers on my iPhone\nTryna figure out if I'ma always feel the way that I feel or maybe someday I can learn to be happy\nOr maybe I can't be, 'cause if the music ain't emotional enough, are they gon' call me a has-been?\nPain's always been the root of my music\nIf I cut it off, how am I supposed to keep growing\nIf I let it go, won't my whole career be in ruins?\nThat's when I realized this whole conversation is stupid\nI never cared to impress people that don't even know me\nI just write what I feel, somehow it started a movement\nTrying to enjoy a career, but I don't know how to do it\nWhen I spend all of my time being afraid I'ma lose it!\nBut, then I figured out the reason they follow me\nThe reason why these fans surrounding me\nIt's not 'cause I'm a \"Rap God\"\nI don't need you people to bow to me\nAll they ever did was doubt on me, now everyone's proud of me\nAcknowledge me or not, you ain't ignoring the following\nI'm just teaching 'em something they couldn't learn in they colleges\nThis is for the kids feeling like they live at the bottom and every day of they lives, feels like it's darker than Halloween!\nYeah, you ain't alone out there, look around you—we got a lot of fans in here\nCouple hundred thousand, that's what we did last year\nListen to Intro III, trying to kill my fear\nThey'll get that in a minute\nWe about to shatter the critics\nI am a savage, admit it\nA lot of baggage I live in\nThat's why the passion is different\nReally don't care if they get it\nWe're only three records in it and this is just the beginning\nI'm home!\n\n[Outro]\nReal music"}], "artist": "NF"}