{"songs": [{"year": null, "album": null, "image": "https://s3.amazonaws.com/rapgenius/1362981577_sweet2b.jpg", "title": "Ring It", "lyrics": "(Forty Fonzarelli's answering machine)\nAight, what's really? You hit my lifer number\nThis Sick Wid It/Jive Records\nLeave your message at the beep\n\nHah! Mmmhmmm. Yeah, uhh... on my pager!\nWhat you say? Oh yeah. Kick that shit then nigga!\n\nHigher than a bird, off that herb, in the O-A-K\nOff on perv, parked on curb, rollin up a vay\nLicked it three times, laced it with the Alize\nAbout twomp a day, baby hit me frequent-lay!\nSneak, and Forty, from chocolate short-ay, we been\nAll prepared, cause my nights is no day, the broad say\nI last! Cause you six months\nBut I say, she pullin a gang of major stunts\n\nBust, bust niggas, consequences when you're doin the do\nFuck around and get caught up in a catch twenty-two\nIn the area! Dirt and dust\nWhere the yah! B.A. Plus\nBut ain't yo sista Suga-T? (Suga-T)\nAin't you the one that say Sprinkle Me (Sprinkle Me)\nI loves me some Forty-Ridah\nI seen you up in 2Pac's video poppin your collar\n\nI play this playa shit like Bugs Bunny\nAin't no cartoon figure nigga I makes money, ain't nuttin funny\nIf you're ever in some funk, call your potnah on the cell\nAnd leave one-eighty-seven, at the end of the number\nB-uh-Benzy on Washington, on the cellular phone\nYou could tell that the Easy Bay was his home\nMy people goin off like a high school build'\nAnd all my money in stacks, and all my pockets on swell\nM-uh-mobbin like a playa, but I'm still a G doe\nPager goin off like C-3PO\nTime for the Hurricane, E said word\nI put a nigga on his back, fuck what you heard\n\nIf it's major, hit me on my pager\nRang it, ring it, rang it, ring it\nRing my telephone, ring my telephone\nIf it's major, hit me on my pager\nRang it, ring it, rang it, ring it\nRing my telephone, ring my telephone\n\nI be so rebel-yalous\nWhen I'm talkin on my phone-telyalous\nYou can have my baitch, but I maintain\nI chop it up as a loss and charge it to the game\nShe said you must be playin some kind of phone tag\nCause erytime I hit you, you don't hit me back\nWhy is dat? Cause you're hella hard to get in contact with\nThought you thought, was killin big girl was crackin on some crabs\nSix o'clock, the girl said that's my crib be at the West plus\nDue to go, left me at home be leavin my ass up in the living room all alone\nAnd I be starvin rubbin my monkey fiendin for some Donkey Kong\nNow you're talkin, let's get the show on the road\nI know you're tired of barkin, you need to hop on my load\nSo we can stab out, strike rock and Arroyo Park\nAt the top of hill, so I can check your oil\n\nI said ah one to the two ah two to two three\nTell me why your baby momma keep on pagin me\nI didn't give the hoe the number, so why does she call\nShe says she wanna do me, and all of y'all\nBut I'm like that nigga on The Mack, I don't want the honey\nI want the money some of you niggas is funny style and meanwhile\nI'm sellin my piece to these tricks cause it's the paperchase\nLaced with game, see I'm livin in the hustlers dream\nCall up a player if it's major\nSpecially if it's scrilla nigga hit me on my pager\n\nIf it's major, hit me on my pager\nRang it, ring it, rang it, ring it\nRing my telephone, ring my telephone\nIf it's major, hit me on my pager\nRang it, ring it, rang it, ring it\nRing my telephone, ring my telephone\n\nRang it, baby gimme a call\nMy name you're screamin, how I be hittin them walls\nYou got me tinglin, how you be workin them drawers\nWith a kiss I make em all say this, yeah that's raw\nI glance your cut, bass we uhh, big cheeks\nWith a blast headin straight for the nut, big A&H\nGot some bitches all in the cut, it's that season\nDrop my number to the hoe to hit me up\n\nYo, you're nine-one-oneing me to death, what's all that fo'\nGot my Williams and fillin my pager and pager on the overflo'\nWhat's happenin with all that old bullshit\nIs it really all that damn serious\nYou're draining the hell out of my battery\nGot your partner thinkin curious\nCause in the Y-E-A A-R-E-A the game ain't constipated\nBuckin around in the Golden State where the game originated\nFools be scandalous they used to be squares be turnin vicious\nHit me on pager, hit me if it's major\n\nIf it's major, hit me on my pager\nRang it, ring it, rang it, ring it\nRing my telephone, ring my telephone\nIf it's major, hit me on my pager\nRang it, ring it, rang it, ring it\nRing my telephone, ring my telephone"}], "artist": "Keak da Sneak"}