{"artist": "Fat Joe", "songs": [{"year": null, "album": "Jealous Ones Still Envy (J.O.S.E. 2)", "image": "https://images.genius.com/4b84a410c9b855ea9a89253794bfc54b.500x500x1.jpg", "lyrics": "[Produced by Infamous and Laurent \"Slick\" Cohen]\n\n[Fat Joe]\nCoca!\nKrillz-mania\nBX, T.S. 'til I die muh'fuckersssss\nCRACK~! Ka-ka-ka-Crack-Crack-Crack, aowwww!\n\nYeah, wave hi at the bad guy\nAnd you can ice grill when I drive by\nSee if I be givin a fuck\nMy hands on the woodgrain, fat ass tucked\nHa ha, shit a nigga just came off tour\nMister Mister Rainman, I'm makin it pour\nI 'member when I used to have to play that hard\nApartment 5B, Forrest Projects y'all\nA nigga too fat, so I couldn't play ball\nSo I hit the strip, started flippin that raw\nMy pants would sag, now they callin me Crack\nUsed to love graffiti, so I made it my tag\nMe and Tone Montana we was bangin them hammers\nBefore New York niggas, ever wore bandanas\nGot so much money, a nigga would abuse it\nThen I left the streets alone for the love of the music\n\n[Hook: Cherlise]\nYou know I never dreamed that I could be perfect\nCause that's the only thing that I've ever been, ohh\nAnd when I look back on my life it's all worth it\nBecause I know I know my people believe me, I do it for love\n\n[Fat Joe]\nYeah, yo\nThey say Joe too selfish, he won't let us in the door\nI say shit I could have left Pun in front of that store\nCould have left Remy Ma ass in Castle Hill\nWhere every other day another nigga get killed\nThey say what's Cool without Dre?\nI say shit, what if them niggas never met Jose?\nHell 'Ve was a great DJ\nNow he produce Roc Boyz, headed for a Grammy\nWhat if I would have told Khaled to stop buggin me?\nHe'd probably never be President of that company\nShit you probably woulda never heard the movement\nI ain't gotta talk, I ain't gotta prove shit\nScott Storch is the best, they kept sleepin on him\nCause he's a white boy, he kept ghostbeatin for 'em\nDropped \"Lean Back,\" then that shit hit and guess what?\nI made the nigga rich cocksuckers!\n\n[Hook]\n\n[Fat Joe]\nI was never into girls, I was just into my music\nDropped so many hits, still them niggas just confuse it\nWent to my old school, gave 'em some computers\nAnd the niggas in the hood still be sayin I don't do shit\nBein they ain't got no love in they hearts\nI just moved to Miami, copped a crib and a yacht\nI bought my little daughter an equestrian park\nNow she's ridin horses, tell me that ain't hot\nSade, Luther Vandross\nStephanie Mills, El DeBarge\nI used to look at them like Gods\nNow tell me why a nigga wouldn't go hard?\nBye {?} boricua, why you hatin on me papi?\nIt's been sweet 16, still them haters can't stop me\nIn fact man I'm just like Rocky\nLordy we did it baby, you keep goin shopping\n\n[Hook]\n\n[Fat Joe - over Hook]\nYeah, man I did it for the music!\nI did it for the love\nHa! I mean Mother's Day I'm performin for your mother\nAnd your girl... can't even be with my family man\nYou know what? Be careful what you wish for\nJoe Crack's here to let you know the workin man is not a SUCKER\n9 to 5 man you get to go home and be wit'cha kids man\nI'm in Budapest somewhere\nI'm in Africa where the heat come, Crack bitch, aowww!", "title": "Music"}]}