{"songs": [{"image": "https://images.genius.com/c01be876bb0ee7895448636836d72230.1000x1000x1.jpg", "title": "Chiraq", "album": null, "year": "2014-04-08", "lyrics": "[Intro: Nicki Minaj]\nMmm, uhh\n\n[Verse 1: Nicki Minaj]\nAin't yellin' cut, when it's shootin' time\nSign up, it's recruitin' time\nBig wigs, with a suit and tie\nAnd them big things got two inside\nFuck wrong wit' these ho niggas?\nDon't do coke, I don't blow niggas\nI don't tell niggas, I show niggas\nAnd it's never less than like four niggas\n(Four-four) Four wings and some french fries\nHot sauce and ketchup nigga\nHe telling and he hiding\nBut real niggas still catch a nigga\nCop Raris? I don't test drive 'em\nHome theaters, can't Best Buy 'em\nThese niggas that I roll with\nDon't let a single thing get by 'em\nKing pins and them drug lords\nChi-Town, no gun laws\nBroke bitches that talk shit?\nNow them the bitches I stunt for\nMalcolm X daughter, came at me\nLookin' ass niggas ain't happy\nRolled out with some Latin Kings\nAnd some eses in 'em plain khakis\nSmack bitches, no smack cam\nClosed fists, no back hands\nPop pussy on a hand stand\nThey suckin' dick like it's band camp\nCall Webb and then call Nitty\nQueens niggas in, it's all hoodies\nKidnappin' and then rob niggas\nCall D-Roc for a biggie\nPussy ass little rap niggas\nI fucked with real trap niggas\nPop star, icon\nBut I send niggas, come snatch niggas\nI'm with EBK, you on EBT\nGot a black nine, call it BET\nSchool niggas, get a GED\nAnd I tease niggas, make em B-E-G\nGot a money fetish, I'ma fly to Venice\nGot a big house, I can play some tennis\nLil Herb, what's good?\nI'm a bad bitch and I fuck good\n\n[Hook: Lil Herb]\nKnow a couple niggas that's down to ride for a homicide\nWhen it's drama time\nRun up on a nigga with the llamas flyin'\nLeave his loved ones all traumatized\n1-50, I'm really with it\nI'll drop his ass and then forget it\nI'm the man 'round my side of town\nMight see a bitch and forget I hit it\n\n[Verse 2: Lil Herb]\nI'm a young nigga, I be gettin' money\nTake your bitch from you\nAnd these niggas don't get no respect\nI'ma stay 100 'til I'm six under\nMatter fact, I gotta keep it 150\nFor every nigga that's gon' come with me\nI'm on Roc Block with a new semi\nAnd a blue Bentley, it do 160\nSmoke a lot a of weed, like fuck kidneys\nPut a dutch in me, got a 40 on me\nI don't trust any, and if any nigga ever try to end me\nI'ma die shooting, prayin' God forgive me\nYou too busy hating, you can't get no paper\nWhy are y'all so silly? Straight killers\nI can call so many, I don't love no bitches\nBut my mom, my sister, my gun and Nicki\nI'm in Hollywood, came from Kingston Food\nShorties standing, in the streets with tools\nWhere I'm from we don't play no games\nAin't no April fools, you will make the news\nWhere I hang, we don't say no names\nIf you talk to cops, I stay away from you\nKeep your mouth shut in them investigations\nYou'll be out the station, in a day or two\nDedication and a little patience\nLead to domination on my way to greatness\nDon't put yourself up in a situation\nPuttin' my relations, in your conversations\nShoot a opposition, with no hesitation\nYou get my position, then you better take it\nKnow some young bulls from a while back\nTryna leave the game but they never made it\nI got old shit, killin' your shit\nOn a couple tracks I just never played it\nPussy nigga you don't want war\nI got old clips bitch I'm Baron Davis\nPussy nigga you don't want war\nI got old clips bitch I'm Baron Davis\n\n[Hook: Lil Herb]\nKnow a couple niggas that's down to ride for a homicide\nWhen it's drama time\nRun up on a nigga with the llamas flyin'\nLeave his loved ones all traumatized\nOne-fifty, I'm really with it\nI'll drop his ass and then forget it\nI'm the man 'round my side of town\nMight see a bitch and forget I hit it\n\n[Outro: Lil Herb & Nicki Minaj]\nGang, gang, gang shit man\nYou already know how I'm rocking man\nThis is G Herbo, shout out Nicki Minaj, you already know man\nSB just gave me the nine with the green beam\nJust give me the green light\nLetting niggas have it man\nWe pulling up anywhere wetting shit man\nGot 50s in them TECs, 50s in them MACs man\n30s in them Glocks, 17 shot Berettas, all that shit man\nSawed offs, pumps man what you want?\nHow you want it, where you want\nWhen you want it man, let's get it\nAnd I ride dolo from state to state\nEven when I ain't 150 man Chiraq all the way to Queens\nLet's get it\nUh-huh, I always got a trick up my sleeve\nI might give you a new trick every week\n'Til this album drop, I don't know\nI figured they want some more, I'ma give you some more\nAsk Webb if I wasn't taking them trips, with 'em nigga!\nChea!\n\n."}], "artist": "Nicki Minaj"}