{"artist": "Ice-T", "songs": [{"title": "Always Wanted to be a Ho", "lyrics": "[Intro]\nThis goes out to all you ladies out there\nA lot of you won't grow up to be lawyers or doctors\nBut you have a dream. And I think you should follow your dream\n\nWhen you was just a little girl, you used to love nice things\nPretty party dresses, candy and rings\nYou was your Momma's little angel, Daddy's little girl\nThey used to fix your hair up in pretty ribbons and curls\nYour sex drive was much deeper than the rest of the girls\nYou used to freak your boyfriends, take them 'round the world\nAs a teen, you didn't like school that much\nYour moms drank, your daddy likes to cuddle and touch\nToo much, so you hit the street looking for love\nAffection and devotion, met none of the above\nMet me in the club working your fake id\nLooked me in the face like a slave set free\nI said walk into my eyes baby, come with me\nI can show you things that you dream to see\nTake you off the street get you something to eat\nSomething nice to wear and a place to sleep\nMy name is Ice, I'm the nicest guy you're ever gonna meet\nTell me what you want, I'll make your life complete\nShe said, I always wanted to be a ho\nI always wanted to be a ho\n\nYou just had to find the player that was right for you\nNow you met the Ice baby, and your dreams came true\n\nThe first thing we're gonna do is buy yourself a new dress\nTake some pictures, put you in the LA Express\nTeach you how to walk in some high heeled shoes\nLet you strut your stuff by the House of Blues\nOr farther down Sunset where the tricks all cruise\n\"Are you my pimp?\"\nOh dear God don't say that\nI'm your manager, your boyfriend, you're agent, your mack\nNow I'm a do my hair baby, I'll be right back\nBecause we gotta look good when we hits the track\nNow your real name? \"Shirl\"\nYeah, we gotta change that\nI think I'll call you Apple, cause your ass is kinda fat\nHow old are you? \"16\"\nWell that's just right\nBut you're 18 if anybody asks tonight\nI'm a teach you how to get this long paper right\nCatch a trick, suck his dick, break his ass for life\nCause I love you, that's all you really need to know\nI'm 'bout to miss my hair appointment, girl I got to go\nShe said, I always wanted to be a ho\nI always wanted to be a ho\n\nYou just had to find the player that was right for you\nNow you met the Ice baby, and your dreams came true\n\n\"Now what if I meet a trick that got long cash?\"\nThat's when I call the crew with the black ski masks\nBut right now we'll only worry 'bout the basic stroll\nHooking up my Cadillac, and upping my gold\nA hundred for a full hit, 50 for a hand\nThrow in a blow job, they'll fuck off grands\nI may even put you where the real johns at\nSome call the strip club, I call the indoor track\nThey got lap dancers, table dancers, mad back rooms\nAnd you can double up your profit if you take them home\n\"I wanna be the best\"\nWell this game's the test\nG-string bikinis and silicone breasts\nSuckas break themselves just to sniff your nest\nAnd if you get tired, I got crystal meth\n\"I think I'm in love...\"\nBaby doll it's on\nYou were made for me baby, since the day you were born\n\nYou just had to find the player that was right for you\nNow you met the Ice baby, and your dreams came true\n\n[Outro]\nYeah baby, we gonna do a lot of beautiful things for each other\nYou know what I'm saying?\nWe gonna get me a new car\nWe gonna get me some better jewelry\nSome nicer rags, you know what I'm saying?\nWe gonna help each other out, you know what I'm saying?\nWe gonna get me a new pad, you know?\nMaybe get me a Rolex\nWe gonna do a lot of things for each other, it's gonna be beautiful\nMe and you\nI love you baby\nWe gonna put a whole lot of money in my pocket\nThat's what we gonna do. You are so cute in that dress\nThat's right\nDamn, go on\nGet your ass out there and do something right quick for a player\nYeah I love you, get your fucking ass out there\nI love you, get the fuck out.. aiite..", "image": "https://images.genius.com/64f26659fd999b48a36adf8773cb8eb0.1000x1000x1.jpg", "album": "The Seventh Deadly Sin", "year": null}]}