{"songs": [{"year": null, "image": "https://images.genius.com/3822cb40fdc4e377ac5a216437723dba.700x700x1.jpg", "title": "4 Da Ladies", "album": "Ruthless", "lyrics": "(Verse 1: Bizzy)\nA little something for the ladies, gettin that money by any means\nWho get with the player type, thuggish ruggish, from the hood with good genes\nWho kick it in high heals, plenty tank tops, camouflage, fatigues\nHer thongs clear to the vision, so you can see some good things\nStretch marks, body smoother then Marble floors in hamptons\nLampin large in a condominium or mini mansion\nSidekick mobile phone, three flip like kirk (?)\nI'm sorta religious, superstitious, but I ain't scared to flirt\nI'm from the dirt, root and soot. Came up on my own foot\nUsed to hang with the crooks. I keep a job in my books\nI took my chance with many girls, but still I look for a woman\nI like her crazy, sexy & cool. Waterfalls, good lookin\nI can remember back in school, being judged by chicks\nAnd soon I hooked up with the Bone Thugs. Suddenly I'm the shit\nAnd baby's mama drama, karma, dillemas and problems\nAnd now I'm single, ready to mingle, Holla, holla, holla, holla\n\n(Verse 2: Bizzy Bone)\nWomen who keep a pedicure, a manicure, Plus orchids\nKeepin their (? ), Take care of their son's, and their daughters\nWanted ta understand, From a woman who has a man\nHangin' on, (? ) another, Go home, \"baby girl scram\"\nAnd the love game eyes go blind, When you shine\nPlease, don't try to be something you ain't, \"Quit lying\"\nStill you're beautiful, The opportunity is around\nIf you take it, then you take it, If not \"don't make a sound\"\nAnd never set a brother up, Just so you're man can fight him\nEspecially, if he don't want you, And he fellin that hottie\nIt's stupid, when you fight for a woman, Who gonna leave you\nIt's been written, many women, Have torn down many kingdoms\nSeen (? ) go, seen'em run a game (? )\nFun and games and treason, Slug her thangs, when thay drinkin\nWhere the women at?, \"Stand up with out no (tails)\"\nI like a woman, When you're mans in jail\n\"You playin the field baby\""}], "artist": "Bizzy Bone"}