{"songs": [{"lyrics": "[Aesop Rock - Talking]\nSo you want to be a carpenter, do you?\nWell it takes more than a hammer, boy\nYou're gonna need blueprints and a will to build, and...\nStraighten your cap! you look like you've been through a war\nWipe that grin off your mug, you got a sturdy frame?\nSluggish posture just won't cut it\nYou're gonna need schooling, and, and, and take notes!\nAnd god if I catch you yawning again you're gonna regret ever asking for my help\nAnd dammit you gotta hustle, this is a slacker-free zone\nAnd, where's my pencil? Go get your hard-hat\nHere's a nickel, go get us a ruler and a saw and a drill and lots of graph paper...\n\nYo..\nI used to have a rope ladder but tattered were the rungs\nI strung it from the highest willow, trying to hug the sun\nThe seventh level buckled and I tumbled from the summit\nNow I'm back to re-climb and this time light my cigarette from it\nMy stitch in division/division warfare's numb enough to soak suddenly in a bullet bath and skip stones in the morning\nIs a flying color phantom tantrum explicable?\nSit and pull the petals off wild flower patches, magic happens!\nBehold, pity the lowlife parish?\nDoom City barracks left remorse coursed on a horse-drawn carriage by the torch of Polaris\nTo the badlands, where every bridge collapse right where the crowd stands\nWhere the witches are fireproof and every preacher's a madman\nFrigid be the appleseed demeanor towards the bay where the landshark Parliament swims\nWhen they pause to polish they fins\nThe better brains will preach the village through the city square\nTo the light, heavy and middle-weight integrate\nSlept with sticks and stones in my pillowcase\nOoh my born flight simulator picks barnacles off the tugboat belly\nLeft my spirit home in a shoebox in case I die\nGot a rugged smoke-green halo floatin' inches off the swamp\nHad that phase when the deviltry contacts a sparkle in my eye\nNow step back from the reservoir and let the settlers drink (Right!)\nSalvage all priorities and iron out all kinks (Okay!)\nMy house ain't made of bricks and straw but never has it crumbled (Why?)\nCause I stitched the brain's rigidity with symmetry\nCome visit me, it's fascinating\n\n[Aesop Rock- Talking]\nNow here's how its done, I'm only gonna show you once\nSo pay close attention, hear me now or hear me never\nGlue your little eyes to the diagram\nSee the plywood, the nails, the glue? You work every inch\nYour domain and you must treat it well\nKeep it clean or it'll swallow you whole\nWhere's the T-square, hand me the pliers\nNow dammit, oh, this will never do!\nYou have to want the castle, head Up, shoulders back\nBe the materials, know your limits only to break your limits\nAre you listening? God dammit boy, pay attention\n\n[Chorus]\nTry it again, little bit more juice this time\nTry it again, yeah, a little bit more elbow grease this time\nTry it again, concentrate, a little more focus this time\nYou can kick and scream and yell but damn I'm only tryin' to help\nTry it again, you're not doing it right, here now, y'all watch\nTry it again, stop sulking, I'm the example, for real, Watch\nTry it again, I'm bout to make it easy for you y'all, just Watch\nYou can kick and scream and yell but damn I'm only tryin' to help\n\nAs if it didn't sting enough\nThe hunt dispatched a pack of wild dog silhouettes\nAll sulking by the skyline, focused with a bonus hunger pain\nMy sincere addiction imbalance stems from a vintage grimace slap to the muck of\nAncestral branch camped on the vessels\nYes and I abide, the laws of the hidden desert survived\nAnd every peasant present teetered it on the crescent less deprived\nWith the exception of pleasant finale binges on the great endangered interests\nOf phantom brigades slaving to save that princess\nI double the negative (Double the negative), to no avail, no promised benefits\nJust delegates peddling pairs of negatives\nWith magnified magnanimous appearance sandy sinners in opinion shut\nNow what of the madness fragments?\nStagnant\nHow to make a vision sing while twigs cling to your pigeon wings\nFission militia, indent bent to split blood in hell's kitchen sink\nOrganize civility simpleton citizen mixers, then kiss the sky in unison\nSinister city-blistered corporate hooligans\nAll I really want's a nickel to feed my little pig\nRedefine big dig, three cheers to the product\nConsumer populace feed but never dreamed of the process\nOn a slanted advantage point saw the makeshift criminals date rape the hostage\nDream away the plain pain, yeah but it seeps through the cracks\nAnd drips from the ceiling and smells the rich scent of my tracks\nAll I ever really wanted was a jungle, and a jungle I got\nSee it ain't the vision it's the plot that makes me stop\n\nTry it again. I don't want to (Repeat 8x)\nI'm not even interested anymore\nTry it one more time", "title": "How to Be a Carpenter", "album": "Float", "image": "https://i.genius.com/097177ea52f6ad0147914b68157107a588f47fb2?url=http%3A%2F%2Fwww.mushrecords.com%2Falbum_art_front%2FMH202_D.jpg", "year": "2000-09-05"}], "artist": "Aesop Rock"}