{"songs": [{"lyrics": "[Intro]\nYeah, I mean like\nI gotta be like the pioneer to this shit, you know\nI was popping that Cristal\nWhen all y'all niggas thought it was beer and shit, you know\nWearing that platinum shit\nWhen all y'all chicks thought it was silver and shit\n(Imaginary playmates)\nI got to be the pioneer of this shit, man, bottom line\n(Imaginary playmates)\nI'm going to show you how to do it, check it\n\n[Verse 1]\nYo, I spit that other shit\nThat's a nice motherfucker shit\nThat Fed time follow me around, Deep Cover shit, nigga\nYou beer money, I'm all year money\nI'm \"Papi, you ain't got to count it, it's all there\" money\nI never change money 'cause niggas got strange money\nNARC'd up, marked up, fucked up in the game money\nI got bail money, double-XL money\nYou got flash now, but time will reveal money\nI spit the hottest shit, you need it I got it shit\nThat down-South, Master P, Bout It Bout It shit\nI got blood money, straight up thug money\nThat brown paper bag under your mattress drug money\nYou got show dough, little to no dough\nSell a bunch of records and you still owe dough\nI got 900 and 96 plus 4 mo' dough\nYou crazy, you fugazi, I'm loco with dough papo\n\n[Chorus: René & Angela sample]\nImaginary playmates\nImaginary playmates\nImaginary playmates\nImaginary playmates\n\n[Verse 2]\nAnd now you got these young cats acting like they slung caps\nAll in they dumb raps, talking about how they funds stack\nWhen I see them in the street, I don't see none of that\nDamn playboy, where the fuck is the hummer at?\nWhere is all the ice with all the platinum under that?\nThose ain't Rolex diamonds, what the fuck you done to that?\nY'all rapping-ass niggas, y'all funny to me\nYou're selling records being you, but still you wanna be me\nI guess for every buck you make it's like a hundred for me\nAnd still you running around thinking you got something on me\nBut I done did it\nAnd y'all want to take my flow, and run with it\nThat's cool, I was the first one with it\nOrigin-al, Jigga's the future, flow digit-al\nStill busting a gat when shit gets criti-cal\nSit it down, I don't want y'all to get it confused\nI rip it down, like I ain't got nothing to lose\n(Y'all get it now?)\n\n[Chorus: René & Angela sample]\nImaginary playmates\nImaginary playmates\nImaginary playmates\nImaginary playmates\n\n[Verse 3]\nGroupies I leave 'em all fucked; niggas, awe struck\nYour single was 99 cents, mines was 4 bucks\nLast year, when niggas thought it was all up\nBut this year I've done it again, Jigga! What the fuck?\nNigga stop whining, Jigga, still shining\nNiggas kept complaining so I copped more diamonds\nRock more Versace, ain't nothing sweet\nI still throw t'ree in your body, fleeing the party\nY'all can't go with me, nope, flow with me\nBet 50, not dollars either I brought some dough with me\nI flow like the 5 Series, in various areas\nAnd blow holes in your weak niggas theories\nIt's funny how one verse can fuck up the game\nYou bought a 4.0 you better get your change\nAin't no platinum in those Cartiers, switch your frames\nAin't no manicurist on board, then switch your plane\n\n[Chorus: René & Angela sample]\nImaginary playmates\nImaginary playmates\nImaginary playmates\nImaginary playmates\n\n[Outro]\nI mean, like, be truthful, man: how you think you gon' feel, right?\nYou pull up in your 4.0 with your bitch\nI pull up in the 4.6 with my bitch with the seat back\nBumping some other shit, you know, some OTHER shit\nYou'll probably hop on my dick right there, right in front of your bitch\nAsk me some stupid shit like\n\"Yo, yo dog, what’s the difference between a 4.0 and a 4.6?\"\nLike 30 to 40 grand, cocksucker, beat it! Haha\nYo, them shits even got leathers?", "title": "Imaginary Player", "image": "https://images.genius.com/5d943fdf8e012d844a1b587b79e29b3d.1000x1000x1.jpg", "year": "1997-11-04", "album": "In My Lifetime, Vol. 1"}], "artist": "JAY-Z"}