{"artist": "Petey Pablo", "songs": [{"album": "Carolina #1", "title": "Don’t Like Me", "image": "https://s3.amazonaws.com/rapgenius/1372159499_Petey.pablo.jpg", "lyrics": "Yeah!\nBaby you have no idea of the things going on in my mind\n\n[Hook]\nLet me tell you a couple things about me\nSo many things I can still tell you about me\nSo many motherfucking niggas wanna be just like me\nAnd the same motherfuckers I don't like don't like me\n\n[Verse 1]\nThey got me twisting up my words like I'm sipping on that syrup\nMy head keeps hurting because I'm constantly worrying about\nShit that ain't even worth it ; Life's too short to be worrying about\nShit you can't control so give it up to the lord\nAnd I've often been to church but I can't stay out of them clubs\nAnd I can't get back to the way I was because foes still talking about Suge\nAnd I need a little more love from the ones who are supposed to love me\nAnd the ones who are supposed to love me have a fucked up way of showing it\n\n[Hook]\n\n[Verse 2]\nSitting on that 5% and low-key and everything I'm in I own it\nI roll it and I smoke it ; I might do a little something if I got some\nYou ain't heard nothing ; You ain't want nothing\nAll the shit around here had been stepped on\nI'm a raw dog, you are home grown; Your shit [?] my rear long\nGet back from me before I break your arm\n[?] bacteria and clean your palms\nI don't know ya'll and I don't owe ya'll a motherfucking thing\nNigga, motherfuck ya'll\nTurn around {?] a pastor on me\nYea, hold up bro, do this for me, shock that up, scoop that up\nGive me seven more tracks and turn up my vocals for me\nShut your mouth.  Hush your lip.  Wanna be a pimp?  [?]\nSuck a dick.  Lick a clit.  Razorblades - cut your wrists\nSwollen up, chest big, steroids, you know it is\nHe said what?  Say it again.  She said what?  Say it again\nWho you with?  You with her?  He with you?  You with them?\nOh well!  Aw hell!  Fired up!  Ring the bell!\nLight a gun, [?] the shell, and my aim at [?]\nOne shot to the head, motherfucker, and you know he's dead\n\n[Hook]", "year": "2012-02-02"}]}