{"songs": [{"image": "https://images.genius.com/9703948ee40b2385b6c79a5f9eeffec3.700x700x1.jpg", "year": null, "lyrics": "Yeah, it's gettin' wild out here\nIt makes me wonder how a black man could ever raise a child out here\nYou know the old krumbsnatcha's in this land of decay\nSo why we killin' for the crumbs when there's so much at stake?\nWe're no longer suposed to be slaves\nI bet Harriet Tubman will be turnin' in her grave\nLike remind my soul\n\nOf the time we were great before the self hate\n\nMy elders all feel the same there's no bravery\nWe're supposed to fight for freedom not just the end of slavery\nAre we too selfish to even bless the kids with jewels\nSo our youth don't get played out for fools?\nWill they get program how to behave?\nMalcolm X must be turnin' in his grave\nLike remind my soul\n\nOf the time we were great before the self hate\nThe time we were great before the self hate (x3)\nThe time we were great\nWait, we still great, but\n\nI met up with this dread, said \"Peace, Respect\"\nHe said \"Respect? Me not seen that around here yet\nBlack man kill himself for limited amount of wealth\nAnd them disrespecting women so him disrespect himself\"\nI agree for what the dread had to get off of his chest\nBob Marley will be disturbed from his rest\nLike remind my soul\n\nOf the time we were great before the self hate\n\nCan't work a dead end 9 to 5 for what\nTo be another victim of social security cuts?\nI gotta cut myself from the chains and run free\nEmpower myself to be my own authority\nPeople die so I don't have to be a runaway slave\nNat Turner must be turnin' in his grave\nLike remind my soul\n\nOf the time we were great before the self hate\nThe time we were great before the self hate (x3)\nThe time we were great\nWait, we still great, but\n\nWe're taught to worship these rappers and athletes and actors\nMany who think they better and they walk right past ya\nIt's what you do off camera and off the court\nThat really makes you worthy of the people support\nBut some brothers get those millions and forget how to behave\nArther Ashe must be turnin' in his grave\nLike remind my soul\n\nOf the time we were great before the self hate\n\nWe crabs in a barrel, you ain't gettin out until I do first\nAnd that's why the guns burst\nWhatever happened to strength in numbers?\nSome of the greatest minds on the planet are among us\nBut so many start on strugglin' and never get saved\nMan, Martin must be turnin' in his grave\nLike remind my soul\n\nOf the time we were great before the self hate\nThe time we were great before the self hate (x3)\nThe time we were great\n\nRemind my soul\nOf the time we were great before the self hate yo\nYeah", "title": "Remind My Soul", "album": "Balance"}], "artist": "Akrobatik"}