{"artist": "Iggy Azalea", "songs": [{"title": "Drop That Sh*t", "lyrics": "[Intro]\n\n[Verse 1: Iggy Azalea]\nDrop it drop it drop it\nMy bitches yeah they drop it\nI see you on that pole work that shit\nI pay for college\nSupportin' you I rain on you now drop it like it's hottest\n\nBenji, Benji, Benjamin, my, that's the only topic\nRock, make it rock\nUh, girl bounce that ass, pop it girl, don't stop it\nIt's D.R.U.G.S. we got cash\nI wanna see that ass go\n\nSpeed it up now go slow, ass low, ass low money pile overflow\nDamn, baby got the fattest ass\nI ain't gay so problem is I'll have to pass\nMake it clap, so after I can take a bow\nHurricane and your stormin' up the place now\n\n[Hook]\n\n[Verse 2: Iggy Azalea]\nDrop it, drop it, drop it\nBitch I want it, bitch I want it\nHe throw ones, they don't want it\nI got racks'a hunnids, hunnids, uh\nBooly got the weed\nTreaty got the crees\nPeezy got a thousand fifties and Bugatti keys\nDo it with ease we drop it like\n\nAutumn leaves, we drop it and then we leave\nBroke bitch, please give me a stack of these\nCash money like Lil' Weeze\nJoey got them flockin'\nThey swinging all on my knees-us\n\nRight in your mouth, ho\nKeep talking\nI got something for your mouth, ho\nWhere's your man?\nI'll show him where his mouth go\nDrop that, bitches, listen to how the hook go\n\n[Hook]\n[?]\nYa know what it is [?]\n[?]\nYa know\n[?]\nI'm like\n\n[Verse 1: Problem]\nDamn, damn, damn, Iggy, Iggy!\nDo you see that ho?\nThat shit, that shit, that shit\nCan't do that on Problem's stripper pole\n\nThey'll try and climb it if the giant\nLittle Snicker Bar diamonds, twinkle, twinkle Big Dipper\nTo all you little stars, it's me, Problem\nProblem got some fun, got some change\nThrew someone's golfer swing\nClubs and hoes think I'mma put a hole in one for real\n\nDiamond [?] and brought drugs with me pills and that white girl\nAnd I don't mean Iggy\nI'm on a war path so the thing with me so you better run son\nAnd I don't mean Diggy\nIggy I know you just got to this light\nBut that bitch right there so bad you should be bi for one night (at least)\n\n[Hook]\n[?]\nD.R.U.G.S", "image": "https://images.genius.com/459ef20238779f2324bc2b056f84bcd3.1000x1000x1.png", "album": "Ignorant Art", "year": "2011-09-27"}]}