{"artist": "Willie the Kid", "songs": [{"year": "2014-02-01", "lyrics": "Ayo son check it out, man\nRemember that nigga with your boy?\nWith the work, with the bricks and all that man?\nHold on, with the 13 joint? With the 13K?\nNigga!\nHe got it bro, I seen, wanted the weight\nAlright, so lets get this team together\nFuck that, we need this bread nigga\nGo in there and bust these niggas\nHold up, call K, and Luke\nLet's get these niggas dog\nLet's go\nHey handle your business, the correct way though\nLet's knock the living daylights out these niggas\nAnd get this cake\nBring that fire back\n\n[Singing]\nWhenever a day goes by that I don't hear the sound of the hunter's gun\nWhenever a night goes by that I don't hear the sound of the siren scream\n\n[Verse 1 Willie the Kid]\nTaught him everything he knows from how to roll a blunt\nTo cook cocaine\nTo break his Glock down to pieces\nAbsentee father, his big brother, became his life's thesis\nA reference, wide-eyed\nHis mother consulted the reverend\nRevered in the hood amongst other adolescents\nMisguided\nOblivious to certain lessons\nHe don't give a fuck, turn that trap music back up\nPolo everything\nFuck school\nEducated on the corner\nDriven by the paper\nSpecialize in petty crime\nNickel and dimeing\nHe overheard his brother talking\nAbout some niggas on the north, niggas shining\nTrained to be a spot rusher\nIt's all verbal though\nIn actuality he never let his gun off\nRan off\nTold his little man about the plan\nTrying to beat his big brother to the chase\nJust to make him proud\nSipping Henny straight\nAll he smoke is loud\nHe's nervous\nHeaded to the other side of town\nHim and his man masked up, kicked the door down\nScreaming 'Where the money at? Nigga where the work at?'\nUnexperienced, when the shots flew, he caught two\nLaid dead, his friend shot, he pulled through\nMisguided, mistaking bullshit for treasure\nHis mother\nBlamed his older brother\nForever\nThe Guilt", "image": "https://images.rapgenius.com/7dcc65b2bfc0e0ec285f0b7abb4cb5a3.1000x625x1.png", "album": "The Living Daylights", "title": "The Guilt"}]}