{"songs": [{"title": "Haters", "album": "Shunny Pooh Presents - 3rd Coast Finest Vol. 1", "year": null, "image": "https://images.genius.com/98875ad8ae88542da3984136092a8f7b.500x500x1.jpg", "lyrics": "*Lil Flip Talkin*\n\n(Verse 1:Lil' Flip)\nI'ma lane switcha,I'ma young game spitta why you lookin\nAt my rims cause mine can't bigga but I ain't jigga I'm Lil' Flip\nYou know me baggets and precious cutts\nAll in my rolie I dont shop a police cause I'm top\nOf the line did you see how I made my bentley drop to the\nGround,I'ma codiene dranker thats all I sip\nAnd 2000 cars thats all I flip\nIf it ain't on chrome I can't sit in it\nIf it ain't a big body I can't fit in it\nDown south we all about are money\nDown south we get are piece made by johnny\nDown south we like to swang on glass\nIf you wanna sixteen you better bring my cash\nI'm a millionare for real and now you know\nMy bank account say 10000\n\n(T.C.)\nI'ma playa on 20's rider\nU.P.T resider bently off the show room\nFirst class driver everything I own gotta be paid out\nI bought a mansion in spain\nNext to bill gates house\nI love money large ammounts\nI never wrote a check the bank bounced\nWodey I'm use to livin lavish\nI gotta rolie on my wrist about forty karets\nI like to cruise so I bought me a yat\nI like baby's house so I bought the whole block\nWodey can't you see I get my shine on\nI done moved my colisium into the super dome ya heard me\n\n(Chorus: Big T.)\nWhy Ya'll Haters so Mad?\nI don't know why baby\nHummers and Jags\nWhy Ya'll Hatin the way ya'll do?\nWhy Ya'll Haters so Mad?\nI don't know why baby\nHummers and Jags\nCause we in Hummers and Jag\n\n(Derrick)\nI bought a Jag off the show floe\nWit no miles paid it out I can't stand notes\nWrote a check for 70 grand my shit paid for\nMy money legel I ain't worried bout the feds brah\n18 set for life dogg I'm livin gravy\nGirl thats big enough for me and you ain't it baby\nI got some shit around my wrist\nThat do nothin but sparkle\nMy clothes and my mansion they madeamara\nSo much Ice in my pinkey ring tellins horror\nAll my arms tattooed nigga C.M.R\nMoved mom's out the hood to washatona\nShe needed transportation so I bought a rover\nShe couldn't drive so I hired a mazada shofir\nTommorow night i'm goin to dinner wit your girl\nOprah,Oprah hoes see me in the club\nBe like that boy rich\nI don't take bathes in water moette and cris\nI got some shit around my wrist\nThat a blind the day\nHow many niggas you know sleepin in versachi beds\nMan that platinum 20 thousand dollars spreads\nMy nigga sold a trans am that was special made\n\n(Chorus)\n\n(Lil'Flip & T.C)\n(T.C)\nWe gon ball wit shunny pooh for the millinuem\nWe 18 live in condominum\n(Lil'Flip)\nWe ride on blades we ride on glass\nAnd we got t.v's inside our jags\n(T.C)\nWe in private jets we never on land\nWe ballin outta control ya understand\n(Lil'Flip)\nI stay in cloverland thats all I know\nAnd big head dollars thats all I hold\n(T.C)\nBig body on brauders thats all I know\n20 inch rims is all I roll\n(Lil'Flip)\nAnd my watch too cold\nYou know we actin bad shunny pooh\nNow I see why them haters mad\n\n(Chorus)\n\n*Derrick talkin till end*"}], "artist": "Lil Flip"}