{"artist": "9th Prince", "songs": [{"album": "Granddaddy Flow", "lyrics": "[Kung Fu samples]\n\"9th Prince, you want to kill us all?\"\n\"Show me where you to find the Princess and I'll spare you all\"\n\"Thank you, 9th Prince\"\n\"Hahaha, y'all must be dumb!\"\n{*sounds of swordfight*}\n\"Take that!\"\n\n[9th Prince]\nAiyo yo yo\nStamina of complete motivation leads a nation of killer's replacements\nGlocks, AK's, hand grenades\nStashed inside a fox hole but Kingdom's basement\nHenchmen of pro lynchmen, rhyme rankest lyrical lynchmen\nIn Now Born, raisin' Children of the Corn\nWe march as we hear the horns of Red Dawn\nI'm prepared, sharpen my machete 'til it's sharp like a thorn\nLyrical spawn, fuck a graveyard, I prepare you in ya lawn\nThere's a Law & Order in the world of manslaughter\nCamera recorder, got me on tape\nWith the microphone screamin' \"Rape!\"\nRadio stations across United Nations\nBlack, Chinese, Indians, plus Caucasians\nPick up the album, Revenge of the Iron Fingers invasions\nLyrical bloodshed, first copy picked up by the feds\nThey wanna investigate the metal plate in my head\nI'm cold invincible like an igloo\nBrainwaves bein' the shade of atomic missles\nThen transport thru ya physical explode thru ya mental\nThen beat fiends instrumentals, got the streets flood\n9th Prince, tune into FM and AM cuz I'm Cold Blooded\n\n[samples]\n\"Come against the consequence of the 9th Prince\" -] 9th Prince\n\"The fuckin' Prince, let's hear him\" - kung fu sample\n\"Come against the consequence of the 9th Prince\" -] 9th Prince\n\"We were just ambushed, I fear we might be dead\" - war movie sample\n\"Come against the consequence of the 9th Prince\" -] 9th Prince\n\n[Tommy Whispers]\nStapleton crime towers\nI hear you gotta be clean like takin' nine showers\nDivine powers, ultimate man\nHour glass runnin', dumbin' with a sword in my hand\nDrunken monk stance, run for ya Clan\nSwitch form and open up like doorman\nCold pore rain danglin', sounds of change\nIce bain frostbite, you costless\nCremated and get ya corpse lit\nSent out to orbit, spaceship\nTommy Whis' lace shit like eight kicks\nStirrin' flavor to this cake mix, we take shit\nFrom ya neck to ya bracelet, get a facelift\nThis ain't no safe strip\nSo be strollin' on their raps, holdin' bombs\nKamikaze strapped on to their arms\nWe move when the wind calms, slowly\nNo one can control me or hold me\nTony told me lay low and we can all play dough\nI'm throwin' blades like Kano\nShove this, one up ya anal\nNow, tell me who be liver than Whispers\nI chop all five of ya fingers\nI'm cold like the winter\nYa feel the breeze, nigga?\n\n[samples]\n\"Come against the consequence of the 9th Prince\" -] 9th Prince\n\"The 9th Prince uses his sword like an axe for hyper action\"\n\"Come against the consequence of the 9th Prince\" -] 9th Prince\n\n[Kryme Life]\nYo Kryme Life yo yo\nI hold my gun down like Chow-Yun Fat, when in combat\nLight the bitch niggas off the map, like Comet\nRighteous islamic gettin' nasty like trauma\nSpit out like a weak stomach, who want it?\nPoisonous virus, we soon cometh\nCold Blooded in the vain, post up under the heavy rain\nSoup-up with the signal ahead before the Chevy came\nFucked up what they did to my fam, I'm feelin' every pain\nYo it's hard on these streets, them after my weed\nBe my medicine, acknowledge the game like a veteran\nMixin' elements, writin' testaments\nSeven down for my next kin, establishment\nExtravagent, mind over matter masterin'\nDark-hearted African skatin' on ice like Kerrigan and still battlin'\nBring it to you with the strength of 18 Buddhas\nT.M.F. arch-style rush ya students\n\n[samples]\n\"Come against the consequence of the 9th Prince\" -] 9th Prince (x7)", "year": null, "title": "Cold Wind", "image": "https://images.genius.com/aee759b8fa2fa70e9bb2b738d3297e33.462x462x1.jpg"}]}