{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Verse 1]\nSomebody tell me who's that, what's that\nIt's the man with the silk drawers stuck up his buttcrack\nDon't even front and try to ask who is this\nCause my name rings more bells than a Jehovah Witness\nStronger than Listerine, moppin up rappers like Mr. Clean\nOh Lord, the Kane just hit the scene\nBooyaka bo buck, rappers have no luck\nCause when I come through, I'm catchin wreck, like a tow truck\nCause ain't no way in the world the Kane could ever, fade\nI'm stayin on top of this thing, in order for me to get, paid\nAnd anyone comin to me for a battle is gettin, slayed\nWhenever it comes to the lyrics I'm rappin I got it, made\nSo back up off me, cause yo' rap\nHave no hap' so slow dat and act like you know dat\nCause you can dream about bein this up to par\nBut not even Johnny Mathis can tell you what your chances are\nCompetition I'll drill em, and definitely outskill em\nTo make the long story short, I kill em\nCause I face em like Jason, bizarre\nAnd when I come through, it's like tchk tchk ahh\n\n[Chorus]\nCome on, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\nHeidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\nCome on, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\nCome on, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\n\n[Verse 2]\nGivin you mo', ready to go, kickin the flow, rippin the show\nComin to blow, check out a pro, look at the glow, act like you know\nLeft the lonely lonely through lyrics loose in me\nLeave the lowlife left lingerin lost like ???\nAnything you can imagine done to a microphone I did it\nRipped it, flipped it, hit it, split it, let it so dig it\nBut don't make me get ill, or chill, cause if I exercise my skill\nRappers'll hit the floor like Johnny Gill\nThe smoothest soloist, with this to exist to bliss\nAnd diss who risk to test this\nCause this ain't no game, I treat you like\nA picture of my ex-girl, and rip that ass out the frame\nI come pursuant, pursuant, pursuant, pursuant\nAnd step it to him, to him, to him, to him, to him\nI leave a rapper's career ruined, ruined, ruined, ruined\nAnd watch him fade like my voice is doin, doin, doin\nEase back when I attack\nYour poetry is wack so don't ask for no slack\nCause I'm tell you straight up, I'mma bring it son\nYou want +Poetic Justice+ go see John Singleton\nBecause a battle ain't no thing to me\nAnd I don't look nothin like Tarzan\nSo don't think you can swing with me\nJust let the Kane take control, I'd like to know\nIf you really ready for some super dynamite soul!\n\n[Chorus]\nThen come on, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\nUh-huh, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\nUh-huh, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\nCome on, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\n\n[Verse 3]\nSo what's this? A new attitude, you're tryin to act rude\nYou saw _Menace_ and now you in a gangsta mood\nWhat are you kiddin me? That's the heart of stupidity\nIf you wanna be a gangsta, join the mafia in Italy\nFakin and frontin on stage like you're hard\nI hope when you get to Detroit, the real thugs gon' pull your card\nFlashin guns like you got somethin to prove G\nWhat, you wanna be in the next John Singleton movie?\nYou're sayin that you're buckwhylin\nBut don't convince me, convince the brothers on the Island\nOtherwise just forget it, unless niggas that did ten years\nSay you a gangsta, I ain't wit it\n\"Yo, I raped his mother, yo, I shot and killed him\"\nIs that what you wanna get across to the children?\nI guess you're not gonna be happy til it's for real\nFour year old kids, doin drivebys on Big Wheels\nOr maybe you wanna see it be more fatal\nLike Kindergarten kids, tryin to cook crack with Play-Doh\nNow I don't mean to take the fun out the jam\nI just want some to understand about the gun in the hand\nWe gotta show our people how to live equal\nPeace out, I'm catchin folks on the sequel\n\n[Chorus]\nIt go, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\nUh-huh, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\nCome on, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!\nCome on, heidi heidi heidi ho\nAnd yo I got the funky flow\nSo let yourself go!", "image": "https://images.genius.com/c57181cdaaeb4f7bcf3a5a0f89a83315.1000x1000x1.jpg", "year": "1994-09-13", "title": "Let Yourself Go", "album": "Daddy’s Home"}]}