{"artist": "Angie Martinez", "songs": [{"title": "Ladies & Gents (feat. Snoop Doggy Dogg)", "image": "https://images.genius.com/439f66679a994188cae23c6858565d8a.438x438x1.jpg", "album": null, "lyrics": "Featuring snoop doog\n\n(pa-ra-ra-ra)..\n(pa-ra-ra-ra).. geah\n(pa-ra-ra-ra).. lets get it goin' now\n(pa-ra-ra-ra).. snoop dogg, uhh\n(pa-ra-ra-ra).. angie\n(pa-ra-ra-ra).. all my ladies and my gents\n(pa-ra-ra-ra).. all my players and my pimps\n(pa-ra-ra-ra).. uhh, uhh yo..\n(pa-ra-ra-ra).. snoop dogg!... yo, uhh\n\n[snoop dogg]\nLadies and gents, players and pimps - gather up\nWe gon' be poppin' in the bitch until you had enough\nGlad at us, mad at us, look at these competitors (c'mon, c'mon)\nI set 'em up (uhh, uhh), wet 'em up; angie's chillin' (shut up!)\nGet 'em up off they seat\nIn the lbc - we throw partys and let the ladies in for free\nWe get the dpg.. on yo' radio station for the y2g\nUp close and personal, west coast professional (professional!)\nNigga what'chu reppin' for? dogg what'chu got yo' weapon for?\nBitch nigga get the steppin', smo' (get the steppin')\nYou besta' back up off'a me\nI break you up (break you up), wake you up (wake you up)\nShake you up (shake you up), and take you up (uhh)\nOn top'a the world, baby girl (girl)\nBig dogg yes y'all in this bi (holla)\nI keep it pi for all the people (people), mami's wit' the fine punani's\nI'm in the projects, on deck\nBaby come find me, and gimmie what I gotta get\nI know you feel me now I want you feel this dick\nSee that's gangsta' shit (gangsta' style)\nIt taste like e and j brandy sweet, like candy\nBaby said she wanna be down wit' a nigga brandy\nAw fuck wit' yo' man then..\n\n[Chorus: snoop dogg]\nLadies and gents, players and pimps - gather up\nWe gon' be poppin' in this bitch until you had enough\nGlad at us, mad at us, look at these competitors\nI set 'em up, wet 'em up; angie's chillin' (shut up!)\nGet 'em up off they seat\nIn the nyc - we throw partys and let the ladies in for free\nWe get the dpg.. on yo' radio station for the y2g..\n\n[angie martinez]\nIt's the big bamboo rollin' (rollin')\nPrada purse swollen (swollen)\nBen franklin foldin', we here to get it goin'\n'bout to bust in the party wit' my people (wit' my people)\nFlyin' out west side in my zito (zito!)\nAnd I'm sittin' on chrome, status well known\nFrom a small lot in brooklyn, I buy this side chrome (okay!)\nIf you wit' me let me hear ya (aight, aight!)\nAnd if you lift it and you feelin' (aight, aight!)\nCozmos when I toastin'\nCrackin' jokes wit' my girls, clown roastin' (how high? )\nFake ballers in the spot high postin'\nGet out my air, can't you see my lows are frozen? (we!)\nYou see niggas be partyin', checkin' out my body and\nGet out outta hand I gotta quarter terror squadians\nOr do-double-g'll come and get'cha\nGet the picture (who is ya), they'll flip ya (f'real)\n\n[Chorus] - 2x\nEast side.. (aight).. is gettin'.. (aight, aight)\nWest side.. (aight).. is gettin'.. (aight, aight)\nNorth side.. (aight).. is gettin'.. (aight, aight)\nDown south.. (aight).. they gettin'.. (aight, aight)\nSnoop dogg.. (aight).. is gettin'.. (aight, aight)\nAngie.. (aight).. is gettin'.. (aight, aight)\nEverybody.. (aight).. is gettin'.. (aight, aight)\nWe gettin.. (aight).. y'all gettin'.. (aight, aight)\n\n(pa-ra-ra-ra).. {*repeat 18x*}", "year": null}]}