{"songs": [{"image": "https://images.genius.com/b3d34ea442eef932a71e2da425174dd8.600x600x1.jpg", "title": "Make it to the top (Freestyle)", "album": "Street Villans Vol. 1", "year": "2003-01-01", "lyrics": "{Verse}\nYou gotta lot of respect to earn sonny\nYou ain't me yet, you wack you use us like burnt money\nYou like a womans cunt, with syphillis around you\nPut on your swimming trunks, so i can drown you\nWhen i flip at you all starring odd\nThis violence is beautyfull like a roach, crawling on the floor\nYou insult me you'll be screaming out help me\nI'll helping ya dap, like smoking sigarets when you both unhealthy\nShout out to the thugsnation, to all our opposition\nWe're bringing competition like waterbugs racing\nYou can't step to me kid shame on you!\nYou're stumbled and crumbled, like theres a flame on you\nYa flesh burns up like (?), kicking the brutal truth\nTorture your ears like harmonica's\nChainsaw in the fatto, its like slaughtering cattle\nWhen ordering in battle, i'm morbid like a shadow\nPeople jacking me off in a curse, you can't diss me\nI dont take you seriously, like female officers\nYour raps are like fabricsoffiners\nSo i'm forced to acid, morphine casket caughing\nYou end up with a wrecked face\nAfter you'll bucked up with a Glock\nYou need to rock a neckbrace for sucking so much cock\nPropriating with a nun under my bed, negotiating with me\nIs like always having a gun to your head\nPoisoning you, spiking ya mail, you urkel lookin bitches\nStitches will circel your skull like a wheel\nYour style is old like a rotted titty\nEvery sentence you say get mad attention a lot of pitty\nDuring any riot involvement i dominate the scene\nLike a clock ticking in a quiet appartment\nSwinging (?), my movies are associated with death\nCause i'm a funeral director\n\n{Outro}\nImma make it to the top, swinging at you chop, chop\nTill you motherfucking drop blue bitch...\n\nYou're.. faggot!\n\nYou will die..\n\nWe kill you..\n\nYou mother... fucker..\n\nWe blast you.. in your face.."}], "artist": "Necro"}