{"songs": [{"title": "4DALUV", "lyrics": "AKIR ft. YG - “4DALUV”\n[Emcee(s): AKIR and YG]\n[Producer(s): [?]]\n\n[Intro: AKIR and YG]\nAKIR: Yeah, this goes out to all my emcees out there keeping it real.  But when you get a record deal, it seems like keeping it real might even be keeping it wrong.  In this fucked up world we live in.  Yo\nYG: Whoo!  Come on.  One Enterprise on the rise.  They don’t understand, man.  These niggas don’t even know.  AKIR and YG.  Yeah, it’s classics, baby.  Yeah, yeah\n\n[Hook: AKIR]\nI do it for the love, man.  Not for the fame\nNot for the chicks, the whips, or the change\nNot for the two-ways to flip or the Range.  Yeah\nI want to get paid, but I do it for the stage\nI do it for the love, man.  Not for the fame\nNot for the chips, the six, or the name\nNot for the video flicks or accolades.  Yeah\nI want to get paid, but I do it for the stage\n\n[Verse 1: YG]\nHeartbeat of\nThe streets—feel the energy—it’s therapeutic\nEverybody got to hustle, but I’m used to it\nSleepwalking through the system, now we all victims\nOf greed, money, and lust.  What happened to us?\nOnce a family that stuck together.  Torn apart ‘cause\nNowadays, it’s all about the cheddar, the chrome, twenty-inch\nRims, the Lex, Beemer, the Benz, [?]\nWhen will it end, man?  Live from the block, you see them\nNiggas making ends, selling poison to their neighbors\nAnd friends, doing well, moving up the chain.  They got\nFly whips and things, a house on the hill, but still\nSell poison in the block, still trying to kill\n\n[Hook: AKIR]\nI do it for the love, man.  Not for the fame\nNot for the chicks, the whips, or the change\nNot for the two-ways to flip or the Range.  Yeah\nI want to get paid, but I do it for the stage\nI do it for the love, man.  Not for the fame\nNot for the chips, the six, or the name\nNot for the video flicks or accolades.  Yeah\nI want to get paid, but I do it for the stage\n\n[Verse 2: AKIR]\nAin’t shit gon’ change except my chains\nForgets my chain, never gets those chains\nRespect my age and accept my wage through the\nRoads we’ve paved.  No, we won’t be slaves\nHelp my homie so we won’t be slinging.  For your\nOwn peace, say what’s real, for Pete’s sakes\nRoll grass while in the dirt to see snakes.  Don’t\nHold back, say what you feel like handshake.  From the\nDef Jam, whenever you can, have you read, man?\nThere’s no limit to the gifted mind.  You master\nYour P’s and Q’s.  Boy, you’re bad and it’s big news\nFellows rock to your tunes, chicks roll J’s, mimic-\n-ing the words that you say ‘cause it play all day\nRadio airplay, windows, and hallways\nIt’s time that we rocked ‘til the time stopped.  Live\nFrom the block, it’s hot like rock on a wild block\nSo don’t stop the art just ‘cause you climbed the chart\nReach inside the part that’s deep inside your heart\nMake a beat that made you hungry to eat, that made you\nExcited, ignited while you out on the street, that made you\nScared to rip, that made you proud to spit a blessing\nSent to all the people.  Your God’s giving gift\n\n[Interlude 1: AKIR and YG]\nAKIR: Your God’s giving gift.  Yeah.  To all my emcees out there\nYG: Yeah, yeah, yeah, yeah, yeah, yeah, ayyo\n\n[Hook: AKIR]\nI do it for the love, man.  Not for the fame\nNot for the chicks, the whips, or the change\nNot for the two-ways to flip or the Range.  Yeah\nI want to get paid, but I do it for the stage\nI do it for the love, man.  Not for the fame\nNot for the chips, the six, or the name\nNot for the video flicks or accolades.  Yeah\nI want to get paid, but I do it for the stage", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}