{"artist": "Watsky", "songs": [{"year": "2012-06-10", "lyrics": "The first time I ate avocado was so amazing that I came\n\nAnd that was the first time that I came so the only thing I could compare it to is the taste of avocado. Almost the same\n\nThe first time I got high, I ran into my friend’s bedroom and I hung onto each corner of the mattress because I knew that I would be flung into space if I didn’t hold tight\n\nTwo years before that I went to my first concert. I was high all night. And the first time someone clapped for me on stage I floated three inches off the pavement walking home\n\nOnly one girl has ever really wrapped my stomach into pretzels. She didn’t give me butterflies. She gave me pterodactyls\nI’m talking terrible internal bruising and the first time I kissed her was like the first time I saw fireworks, which was like the sky first kissing me in the eyeballs\n\nIn high school the self-defense counselor taught us that to defend ourselves against a rapist, by sticking a thumb into the corner of his eye socket and popping it out like a grape\nBabe, for the chance to be with you, I would pop my own eyeballs out and say, \"Here. I only have eyes for you.\"\nSo everywhere you went you’d carry me around in your pocket and every time you pulled out a handful of loose change I’d get to wink at you and a thousand miles away you would think of how charming I am— me— weaving blindly through LA traffic. You— in some bullshit other place\n\nBut you shouldn’t leave first times until the end of summer\nBecause you went off to college, years passed, and I realized I was the only one calling anymore\nAnd that first kiss hardened into the last. My love : retarded, preserved, a pterodactyl in a tar pit, the music over before it started, a lost guitar pick\nI’ve stopped trying to match it, searching for that magical attachment\n\nBecause marriages are not fucking Disney\nBad marriages are sandcastles\nGood marriages are McDonald’s hamburgers\nYou can leave a good marriage on a plate in the sun for fifty years and it stays pretty much the same\n\nThey key, I hear, is to fight routine— to make the smallest moments gleam and mean something\n\nAnd if you ever feel yourself fading, face paint your old and aging creased-up cheeks gold-plated with a jar of first-time and if you need a youthful spruce-up just grab a tube of that newb juice and lube up and if you’re hurting just rub the good stuff where you’re burning\n\nBut a word of warning\nThe first time tends to make the bad times worse\nThere’s the rub\nIt doesn’t make things better, just louder\nIt amplifies a murmur ... er-er\nGreat is greater. Greater is greaterer. And broke ...is broker. And bone... is boner\nIt’s not a perfect formula\n\nBut the first time that I kissed you, the door of your crappy Civic already half-open, you said \"I’m glad you did that.\"\nAnd I have a feeling that, for you, it wasn’t a first-time\nIt was a \"this one time.\"\nBut I will remember that moment for the rest of my life, even if I have to arm wrestle Alzheimer's for it\n\nAnd if I ever get a chance to kiss you again, you know, a second time, I'm gonna stick my tongue out and lick you right across your face. Because I’ve already kissed you. But I never licked you\nAnd you’ll say, \"Ugh. Why did you do that?\" And I’ll say, \"Hey sexy. Did someone slap you across the face with a banana slug or is that a big shiny trail of first-time on your cheek. Maybe we can go back to my place and gets some first-time on the sheets.\"\n\nIt’s worth it\nAfter all, there’s nothing like the first time\nThe first time’s always perfect", "image": "https://images.genius.com/15b416d55e0958076696e8b871573bd9.500x500x1.jpg", "album": "Nothing Like the First Time", "title": "Nothing Like The First Time"}]}