{"songs": [{"lyrics": "[Intro]\n\nYeah\nYo, what up?\nThis is Aceyalone\nWhat's happening?\nYo\nLet me tell you a story real quick about one of my partners\nAbout this cat I know\nOne of my homeboys, and we just gonna call him Junior\n\n[Verse 1: Aceyalone]\n\nYeah, Junior got some money just for being a good kid\nHe sealed it up and never even opened up the lid\nGirls gave him candy cause he treated him nice\nHe took it home and chopped it up, and doubled up the price\nMiss Thomas at the parent's conference said we honest\nShe was astonished at his confidence and what he accomplished\nHe respected his elders, but he knew who he liked\nHe listened before he talked, and he never would fight\nIt's like, everybody knew him or they wanted to know him\nAnd anytime they did something for him, they felt that they owed him\nHe was learning a life game that no one would show him\nHe had more than an idea of where he was going\nHe grew into a young man and gained some trust\nAnd he had a knack for pleasing people, and that was a plus\nAny situation he was in, he would adjust\nHe never cussed, and he never fussed what he discussed\n\nYeah, that's what I'm talking about\nWe was the same age, but I still looked up to him because we had this thing together\nSome people just got that knack, and you can't do nothing about it\nBut he ended up being a victim of circumstance because he's on the rise and, you know, he's gotta battle against the odds\nAnd my man had such a good demeanor\nHe was smart, man\nAnd he was a hustler\nAnd he had his [? ] up\nAnd he had a natural ability to bring people together\nAnd which people he brought together\n\n[Chorus]\n\nJunior had it good\nJunior had it good\nJunior had it good\nJunior had it good\n\n[Verse 2: Aceyalone]\n\nBy the time he turned 26, he was intense\nHe was becoming a young prince with a whole lot of sense\nNot only could he make money hustling white\nHe had a little bit of everything to get you some height\nThey made cash with him so nobody wanted to hit him\nBut they'd get him if they had to get him, get rid of him quick\nBut why kill off the goose if you're making the grip\nAnd why kill off the captain if you run a good ship?\nSome people are strong\nSome people are weak\nOther are smart, but still don't got a stomach for the streets\nBut Junior had a different angle, he was an angel\nThe Calypso changed, though, the game could tango\n'Cause he can't tango or dance with wolves or waltz with a rattlesnake\nWhat would it prove?\nThey started salting up his program, hoping he'd lose\nBut he stayed cool, and he stayed steady, making moves\n\nYeah, okay meanwhile, Junior's off doing his thing, and living up to his full potential\nBut the haters, and I don't even want to call them that cause they're worse than that\nBut he's become a victim of the monster\nYou know, the machine, the revolving door\nIt's them that's got versus them that can't get, and ain't gonna never get\n\n[Chorus]\n\n[Verse 3: Aceyalone]\n\nMan, four years later, Junior got him a nice stack\nCompared to what he used to have, now he's got twice that\nWhen beef is at his door, he decided to ice that\nNow knowing more and more, he was caught in a mice trap\nHe wanted to fight back\nBut who could he tell?\nThe lesser of the two evils would just put him in a cell\nEverybody around knew that Junior was frail\nBut he didn't need muscles to make it, all he needed was a scale\nA hundred and twenty-thousand in cold hard cash\nA stash at gun blast that don't even ask\nYou get beat by the only one thing that can beat you\nDefeat you, cheat you, the streets will eat you\nJealousy and envy make a person deceitful\nThen you add greed to it, combination is lethal\n\nWell it's a short life knowing that it won't be a sequel\nSometimes bad things just happen to good people\n\nYeah. So they killed him\nThey murdered him in cold blood\nHe died face-down in front of an empty safe\nAnd for the fools that did this, I hope you rot in hell\nI hope you live in hell\nFor my nigga, Junior\nRest in peace\n\n[Chorus]", "title": "Junior", "album": "Magnificent City", "image": "https://images.genius.com/d377dd352876664b03799298f4325e48.600x600x1.jpg", "year": null}], "artist": "Aceyalone"}