{"songs": [{"album": "Prisoner of Conscious", "image": "https://images.genius.com/70850ebf7e5891df63851f2a86ecec08.936x936x1.jpg", "year": "2013-05-07", "title": "Hamster Wheel", "lyrics": "[Intro (Spoken)]\nI see ya, Yeah I see ya\nSee, I'm lookin right at you, I eye-contact you\nYou see me, and I'mma be me, Uh\nFirst, I'm sayin Hi, then I'm wavin Bye-bye\nWe get in, we get in\nGirl, you're so fly, you're so fly\n\n[Verse 1]\nYo, these swallows is horny as Charlie Parker\nBe cutting em cause I'm studying these birds like ornithology\nFollow em when they tweeting, holler instead of speaking\nGive it a name, she played the wicked games every weekend\nBroke up with a dude for almost ending her life\nCame over for the closure, ended up spending the night\nGot cozy in this apartment, wine bottles started popping\nPut scratches up on his back, they questioning where he got them\nForgot it was her, she Freddy, her fingers was like machetes\nThe fucking was so steady, she shredded him like confetti\nConfronted him 'bout every single chick, shes like \"enough already,\"\nI need to be with someone else, this stuff is so petty\nShe was reacting to things he did in the past\nThis nigga was no saint, he couldn’t say no to ass\nHer behavior so rash, she gave up all her power\nHe put her out on the street, nowhere to live, nowhere to shower\nHow she gonna make it through the night?\nHow she's so accepting of her station in life?\n\n[Hook]\nShe always carrying a baby with her\nHer spitting image just like looking at her baby pictures\nHer fate is sealed cause she dependent on a man for real\nHow she running these streets but always standing still?\nShe need to get up off the hamster wheel\nShe need to get up off the hamster wheel\nHow she running the streets but still standing still?\nShe need to get up off the hamster wheel\nShe need to get up off the hamster wheel\n\n[Verse 2]\nBattery in the back, popping up with the coppertop\nPopular with the ass of the Hottentot\nNiggas whooping and hollering at Andromeda when she passing the barber shop\nOnly job that's an option McDonalds or telemarketer\nHard for her making ends come together, this ain't the Beatles\nShe needing some anesthesia like she going under needles\nShe doing so much cutting, its a wonder she bleeding\nThe money was so seductive, no wonder she ain't leaving\nFirst time she felt like a woman was when a dude screamed\n\"Nice ass!\" out the car window driving past\nNobody showed her how to live so all she do is dream\nThey call her Rocky cause her makeup is like a mask\n[Find] scars permanently lodged on her frontal lobe\nBehind bars for credit card schemes she pulled a month ago\nFirst she getting high, now we waving bye-bye\nShe's waiting out her station just the same\nAs she's waiting at the station late at night for a train that never came\n\n[Hook]"}], "artist": "Talib Kweli"}