{"songs": [{"title": "Maangamizi", "lyrics": "[Hook] x2\nHow many lives have we lost to the Maangamizi\nIt's way bigger than the pain that I place on the CD\nIf I told you all the truth would you really believe me?\nIt's the Maangamizi, It's the Maangamizi\n\n[Verse 1]\nMaangamizi, meaning African hellacaust\nBecause we paid a hell of a cost\nAnd don't really know what was lost\nAnd the process ain't ever stopped\nSince black civilization dropped\nThrough internal greed and external plot\nSame ones that taught the Ancient Greeks\nGreece and Rome helped to bring to their knees\nThen Islam spread across Northern Africa\nWith slavery and massacres\nToo many hurt, refused to convert\nSpread South and West and people dispersed\nChristianity is not alone in using\nRace and religion for power to expand\nDesert caravans took slaves across Sand\nWhere they staged a revolt of the Zanj\nEnemies always invented mythologies\nCurse of ham, so-called prophecy\nAfter the migration\nThere was some reinstatement of autonomous nations\nThen floating on the waves of the seas\nCame a plague, a genocidal disease\nWith arms and heads, they looked like men\nReally they were just dogs on two legs\nWhen they first came some of our people said \"Go!\"\nMost welcomed them into our homes\nWe didn't know they had hearts of stone\nFrozen by Western Europe's cold\nAlso, there were scumbags among us\nWilling to work for white conquerors honours\nAnd with that collaboration\nBegan the largest forced migration\nIn the history of nations\n\n[Hook] x2\n\n[Verse 2]\nHow many millions dead at the bottom of the ocean?\nThrown overboard like property stolen\nOr jumped overboard rather than be sold on\nA mother with her baby in arms, hold on\nWhat awaited was not just enslavement\nBut a genocidal impulse craving\nThey committed unspeakable abuses\nTo make a nigga from an African human\nTook a woman ready to give birth\nTied her limbs to four posts held firm\nIn a main square made every slave watch\nCovered her in raw meat\nLet off a pack of dogs\nIf anyone watching, even a relative\nMade a sound, kill them for the hell of it\nThis was every day, not the exception\nThe science of gynaecology was perfected\nOn black women, no anaesthetic\nThey said a nigga bitch couldn't feel pain, pathetic\nHang a man from a tree cut off his penis\nForce people to eat their own faeces\nPut people in zoos, in a cage\nChimpanzee, black human, ape\nAnd it was upon this here atrocity\nEurope became the dominant economy\nNow they play games, pretend it's about names\nIt's a scheme for unequal trade\nImagine the largest companies today\nIf all of their employees got no pay\nFor all of the centuries profit was made\nBlack skin was always branded slave\nEven the child of the masters rape\nCould be killed or sold because black blood in her veins\nBut the ancestors fought back, got free\nProbably have not heard of Jean-Jacque Dessalines\nProbably don't know the Haitian revolution\nCaused the French to sell half of America\nNor know the role that Africans played\nIn the Civil War for that same America\nIf you ain't heard of Nanny of the Maroons or Bogle\nYou probably believe what they told you\nBut if they set Africans free\nBecause all of a sudden they grow a conscience\nTell me this\nWhy were the slave masters given compensation\nAnd those that suffered not given a thing?\nWhy did they then invade Africa?\nAnd make Africans slaves in their home?\nWith the Belgians killing 10 million\nSouls in the Congo alone\nWhy then Jim Crow\nWhy Apartheid?\nWhy did Black Wall Street burn that night?\nWhy collaborators will work for such evil\nWilling to be tools against their own people?\nWhy Africom?\nImperialism for the new age\nBut with a brown face on it\nThat's right imperialism for the new age\nBut with a brown face on it\n\n[Hook] x2\n\n[Verse 3]\nSome will try their best to justify this torture\nBy asking you who the slaves were brought from\nAs if we do not know, tell them \"Get the hell out\nEvery genocide ever has had sell outs\"\nAnd the largest wars of humans\nWere fought between the people of Western Europe\nSo by your rationale it's cool to kill Frenchman\nThey killed Germans that look like them\nAbsurd right? But when your skin is white\nDifferent set of rules you can abide by\nDark suffering is not humanized\nNo surprise, we still see ourselves through their eyes\nDarkies became legally human\nDuring the course of our parents life\nAnd the freedoms we have only occurred\nCos our ancestors spilled their blood to the earth\nThey changed that much? Are you so sure?\nThe world's darker people still the most poor?\nSo it's our task to put an end to this\nEven those like me with our heritage mixed\nIf a knife is in your back 9 inches\nAnd it's only been pulled out six\nWhen the wound starts healing\nAnd we stop bleeding and bleaching\nCan it begin to fix?\nWhen the plague of self hate\nIs no longer a weight so great\nPush you to kill one another\nWhen we put a stop to false charity\nThat gives with one hand and bombs with the other\nWhen the IMF and World Bank, along with their puppets\nNo longer strangle our nations\nWhen the invaders don't have military bases\nIn so many places\nWhen the jail cells are not packed with black backs\nAnd the gats and the crack are no longer factors\nWhen we celebrate true self-determination\nNot a few token bit part actors\nWhen the truth is told and there is\nThe dignity to remember the dead\nBecause as long as they are distorting the past\nIt means they have the intention of doing it again\n\n[Hook] x2", "year": null, "album": " The Thieves Banquet", "image": "https://images.genius.com/acaf5708a18660f33365d7d63e4937b7.500x500x1.jpg"}], "artist": "Akala"}