{"songs": [{"title": "Only Life I Know", "image": "https://images.genius.com/34496ea878c12c3ca7f7791350eef29a.899x899x1.jpg", "lyrics": "[Hook]\n(It's my life)\nYeah, the only one that I'll ever know\nFeeling extra low\nPlease let me go\nOh Lord, no\n(It's my life)\nYeah, the only that I'll ever know\nAnd it stressed me so\nOh God, bless me soul\nOh Lord\n\n[Verse 1]\nWhether it's the projects or a trailer park mess\nRaggedy the apartment complex\nWith a stressed out single mom sitting on the steps\nWaiting on the mailman, looking for a check\nBoys on the corner, pushing out the chest\nQuesting for anything that resembles respect\nYoung girls swinging their hair with every step\nLooking for affection, settling for sex\nBodies decorated with tattoos and chains\nTrying to put armor between you and pain\nWood grain steering wheel, the bass bang\nBut not enough to drown out the hatred in your brain\nThe only out is smoking out\nGet lean, get wet, get meth, get tore down\nCause who the hell would want to stick around?\nPut me in a haze, I ain't never coming out\n\n[Hook]\n\n[Verse 2]\nThey just wanna get you in the system, stick you into prison\nList you in the military ship you to the desert\nGigs don't exist for you to make a decent living\nBut we got three illegal wars that you can pick from\nKeep stressing morals and personal decisions\nTell me what's moral about these conditions\nWho decided you don't got enough to teach children?\nState spending billions, on stadiums and prisons\nHow many routes can folks really choose?\nWhen you're oppressed only three lead to you\nFirst one is follow the rules and stay in school\nBe the square dude, that society approves\nGet a little job or a shitty appartment\nSub-prime mortgage in a failing house market\nThe after your life dedication and hardship\nYou died just as poor as you was when you started\nFuck that, what's up with the second option?\nYou could always hit the corner and try to get it popping\nGet fast guap when you're out dropping and clocking\nBut, chances are that you'll probably die violent\nThe best hope that you got is getting locked\nAnd end up with a job in a prison metal shop\nThey ain't paying nothing but three hots and a cot -- shit\nDon't you know that's the biggest hustle they got?\nOr door three you can get on that welfare\nBut they ain't trying to help, they'll put you in hell there\nGive you just enough so you're not gonna starve\nAnd constantly harass you while you're looking for a job\nDo luck up and someone that got you to punch a clock\nAnd they found about it and your check is getting docked\nCan't win for losing, dehumanizing\nYou'll never get caught up, you caught up in a cycle\n\n[Hook]", "year": "2012-09-18", "album": "Mourning in America and Dreaming in Color"}], "artist": "Brother Ali"}