{"songs": [{"image": "https://images.genius.com/cae72672d0f5e0b565e0576b7e5be55b.676x676x1.jpg", "lyrics": "[Automated Voice]\nThank you for your interest in Revival, the number one slightly invasive treatment for Atrox Rithimis. You only get one shot to beat AR. Don't miss your chance with Revival. Please hold to speak with a patient care representative.\n\nWhile you wait, here's some additional information:\nYou should discuss the potential benefits and risks of Revival with your doctor or clergyman. Revival is a non-injectable medication given through the ear canal and is not intended for anal use. Revival is a non-narcotic medication intended for daily use that can be taken with or without food.\n\nTell your doctor about all health conditions, including if you:\n\nHave a history of confusion or poor judgment\nAre allergic to tympanic stimulators\nAre pregnant or nursing\nRevival does not cause serious side effects including:\n\nFleem's syndrome\nMild to disfiguring acne\nBrain problems\nMale pattern baldness, most commonly in women\nRage\nDecreased appetite\nIncreased appetite\nSeasonal affective disorder\nLoose gums\nGluten sensitivity\nToothpain\nTight glutes\nGeneral feeling of head trauma\nSoftening of fingernails\nDramatically increased hair growth\nSudden nut allergies\nRinging in your mouth\nand Light-leggedness\nThank you for continuing to hold. We give you some serious fucking credit for sticking with us. Tell your doctor right away if you have any of the following symptoms:\n\nFever, sweats or chills\nMuscle ache\nCough\nShortness of breath\nBlood and phlegm\nWeight loss\nWarm, red, or painful skin or sores on your body\nDiarrhea or stomach pain\nBurning when you urinate\nChills when you urinate\nUrinating more often than normal\nFeeling very tired or night sleeping\nRevival does not cause you side effects but if you have them you should definitely seek medical attention.", "album": null, "year": "2017-10-25", "title": "1-833-2GET-REV (REVIVAL Voicemail)"}], "artist": "Eminem"}