{"songs": [{"year": "1993-06-02", "image": "https://images.genius.com/9703d795ec6c8c350b9674639f3fa5b8.500x500x1.jpg", "title": "I’m An Ugly Nigga (So What?)", "album": "All Samples Cleared", "lyrics": "[Intro]\nHey hey hey, know what I heard?\nBeauty's only skin deep, ugly is to the bone\n\n[Verse 1]\nBack in the days, I'm not gonna lie\nThey used to say I'm ugly, a hurting guy\nThey would crack on my lips, and my powder\nSaying I look like yuck without the house or ?Wig Howard?\n]From junior high to high school they thought I was retarded\nJust because the way I looked, they said I farted\nI was very very sad and you wonder why\nBecause my looks and my gear wasn't ultra fly\nI wouldn't even attempt to ask a girl out\nCause she get around her friends and began to shout\"\n\"Guess who asked me out to the movies girlfriend\nIt was Mark, I told him if the world would end\"\nBut my parents told me beauty's only skin deep\nIf that's true then why do girls think that I'm a creep?\nI even joined the football team to get some recognition\nBut that didn't spark the key in a girl's ignition\nThey said I'm so ugly I give Anican a headache\nAw man, that is the icing on the cake!\nSo I kick this to all the girls from houses to huts\nI don't care what you think, cause you all are nuts\n\n[Hook]\nI'm an ugly nigga, so what?\nIf you don't like the way I look, you can kiss my butt\nI'm an ugly nigga, so what? So what? Ewwwww (Repeat 2x)\n\n[Verse 2]\nI'm a tell you story that's really bugged\nAbout a guy with a Benz and he's dealing drugs\nIn the begining before he got his riches\nHe was so ugly, he gave me the itches\nI mean, if you see him, you think I might be kooky\nBut homeboy looked like, um, God-zooky\nI used to crack and joke and say he looked like a star\nAnd everybody laughed when I said \"Mon-star\"\nI can't laugh now because it's a new decade\nMy guzu-friend got the girls and got it made\nI guess having jewels, having money, having a vehicle\nMakes you sexy, handsome, gorgeous, and adorable\nWhen you're spending money, giving girls what they want\nBehind your back they talk about you say you're ugly and you front\nWhy do you go to bed with someone that you don't like\nJust because they got a nice car like Reverend Ike\nIt would be wrong if he heard what you're thinking\nThinking that he look like, um, Stinking Jenkins\nBut let me tell you a secret, he has ESP\nAnd this is what he whispered in my ear to me\n\n[Hook]\nI'm an ugly nigga, so what?\nJust because I got loot, that's why you give me the butt?\nI'm an ugly nigga, so what? So what? (Repeat 2x)\nLet me tell you how poor I was\n\n[Verse 3]\nDome to the doo, and doo to the dome\nFor the dome I go to school and for the doo I use a comb\nNow people always ask how are these things known\nCause the dome does the doing for things that are done at home\nThat's why I keep a pick in my nappy fro\nAnd for lunch I eat Ragu with my sloppy joe\nBut at night I be starving, like Messy Marvin\nI get cheap and go settle for the White Castle bargain\nThey offer me a lot in the army\nBut I'd rather get it second hand from the Salvation Army\nCause times are getting harder than boot camp\nMan I'm so poor I need to print my face on a food stamp\nSo if my hooptie breaks down, I just have to suffer\nAnd tell Minekie \"I'm not gonna pay a lot for this muffler!\"\nSo I keep clear thoughts as the weeks run\nBut even on the beaches, they call me a beach bum\nSomething ain't right with me, and that really frightens me\nCause nowadays girls don't even like to sprighten me\nSome say I'm embarassing, but I got some comparison\nLike if I was on TV, I would be Oscar Madison\nIs there another like me? Only God knows\nMan I should even rap in church cause I wear holy clothes\nBut for now I'm just going to do the strut\nAnd this is what I say to girls from houses to huts\n\n[Hook]\nI'm an ugly nigga, so what?\nJust because I'm poor, that's why you won't give me the butt?\nI'm an ugly nigga, so what? So what? (Repeat 2x)"}], "artist": "Biz Markie"}