{"songs": [{"year": "2017-10-20", "image": "https://images.genius.com/6c76287c99243b235be1e891c5ea9bc1.1000x1000x1.jpg", "title": "Aux Cord", "album": "4eva Is a Mighty Long Time", "lyrics": "[Intro]\nYeah, just pass the aux cord man\nYeah, just pass the aux cord\nHeh, yeah yeah\n\n[Verse 1: Big K.R.I.T.]\nI'm just tryna play that fly shit, Sly Family Stone ride shit\nEven if you don't smoke, get high shit\nLaid back like this that, this that, this that vibe\nFinally got off work like this that, this that ride\nTo vacation, across 110th Street was blazing\nFor the motherless children that related to Mahalia\nI know, you tired of that you can't feel it in your heart\nLet the music be your secret lover like Atlantic Starr\nNew Birth, Wildflower was that jamming shit by far\nAnd Eddie Kendricks' voice will have you singing in your car\nI know, I know, I know Marvin played at your home\nBut that's the reason why your parents had to get it on\nThat's the reason why you're probably here anyway\nDon't fret, you can play that bullshit any day\nBut, I'm just saying it's a whole catalog\nOf analog, the warmer sounds you've ever saw\nPass the aux cord\n\n[Chorus: Big K.R.I.T.]\nYou ain't jamming, you ain't jamming\nJust pass the aux cord\nYou ain't jamming, you ain't jamming\nJust pass the aux cord\nYou ain't jamming, you ain't jamming\nJust pass the aux cord\nYou ain't jamming, you ain't jamming\nJust pass the aux cord\n\n[Verse 2: Big K.R.I.T.]\nInstant Vintage, might as well, that Raphael Saadiq, yeah\nVoodoo moved your soul, Cruisin' was made for L-U-V-ing\nBadu food for thought, eat out her Appletree and\nJill Scott forever golden, R.I.P. B.B. King\nPrince and MJ that we played, barbecue to death\nSummer shine, summertime, Will Smith and Jazzy Jeff\nWillie Hutch scored the mack while Foxy Brown was slept\nBilly Paul, Me and Ms. Jones, I always knew she crept\nBarry White, Love Unlimited for the Soul Brothers\nOhio players and heat wave for the Cole Brothers\nFunkadelic, Minnie Riper through the speakers\nBill Withers, Johnnie Taylor, cheaper just to keep her\nDavid Ruffin and The Temptations\nChristmas time, Silent Night, Gladys Midnight Train kept the Pips waitin'\nI'm saying, we can go and chill on that other shit\nAnd join the Parliament, mothership\nWith this aux chord\n\n[Outro: Nikki Greer]\nMusic on another level\nLet this eargasm take you to Heaven\nAnd get you high\nWaking me up\nYou're taking me higher, ohh\nYou're waking me up\nYou're taking me higher, ohh\nKeep waking me up"}], "artist": "Big K.R.I.T."}