{"songs": [{"image": "https://images.genius.com/88ec3c681c282bee52d73da4d8bfcde9.512x512x1.jpg", "lyrics": "[Chorus]\nBaby girl, you need to go to sleep\nI haven't made love to your mom for 3 weeks\nYou're my princess, I'll build you a castle\nBut first stop acting like a asshole\nGo to sleep!\n\n[Verse 1]\nMy precious little daughter, (yeah) you are just something sweet\nI'm tryna make love to your mom so go the fuck to sleep\nYou stayed up crying every night for like a fucking week\nThe only thing that I can do is hold you, smoke a blunt, and drink\nSo one, two, three to the four, dad loves you\nI'm gonna pay your college tuition\nAnd make every dream that you ever had come true\nWhen you're sixteen I'm gonna buy you a car\nYou'll be beautiful in it\nBut please, for the love of God\nCan your mom and I have two or three minutes alone\nWithout the stressful crying\nThe next door neighbors probably gonna call the cops\nAnd accuse your pops of domestic violence\nMost of the time I want to kiss you\nYou're soft\nBut right now I feel like ripping you off\n\n[Pre-Chorus]\nSo lie down and go to sleep\nMy sweet little daughter\nYour mom and I are trying to make love tonight\nI said go to motherfucking sleep\nMy sweet little daughter\nSo Mom and I can [pause] tonight\n\n[Chorus]\nBaby girl, you need to go to sleep\nI haven't made love to your mom for 3 weeks\nYou're my princess, I'll build you a castle\nBut first stop acting like a asshole\nGo to sleep!\n\n[Verse 2]\nLittle girl\nYou, your mom, and your brother\nAre the only things that I truly care about in this world\nAnd I don't really wanna be rude but listen\nMe and your mom had a god damn relationship that was wonderful and perfect\nYears before you existed\nSo what? You're here a couple months\nAnd you cry a couple times\nAnd you think you get to cock block dad while he's at his physical prime\nIs you out of your goddamn mind\nApparently you don't understand that your fucking parents need a little romance therapy\nA little no pants therapy\nI wanna put you in your crib but I'm scared to leave\nIf I leave then the [? 1:59]\nDon't you understand that all this crying is the exact reason\nYour mom and I got in a huge argument the other night at Costco's\nShe was like “would you stop eating all those goddamn free samples\nYou're 10 pounds overweight already”\nAnd you just sat in the grocery cart and didn't defend me\nI buy you all these diapers\nWhy you acting like I'm rich\nYou always hating on your daddy\nWhy you acting like a-\nNo, no, no, no\nI'd never call you that, you know that\nI love you to death, I'm just saying\nSometimes you gotta let me and Mom do our thing\n\n[Chorus]\nBaby girl, you need to go to sleep\nI haven't made love to your mom for 3 weeks\nYou're my princess, I'll build you a castle\nBut first stop acting like a asshole\nGo to sleep!", "year": null, "album": "Congratulations", "title": "Go To Sleep"}], "artist": "Mac Lethal"}