{"artist": "PnB Rock", "songs": [{"album": "GTTM: Goin Thru The Motions", "title": "Playa No More", "image": "https://images.genius.com/508d41683a250338fcaa8d4138d451d4.600x600x1.jpg", "lyrics": "[Intro: PnB Rock + A Boogie Wit Da Hoodie]\nPlaya no more\nI don't wanna be a playa no more\nI don't wanna be a playa no more\n'Cause I don't wanna be a playa\n\n[Verse 1: A Boogie Wit Da Hoodie]\nI don't wan' be a playa with you\nGirl, I don't understand what you\nWant, but I'm tryna make plans with you\nSouth Beach, don't bring sand with you\nSouth Beach, I hope you don't bring sand with you\nOut to eat, every menu, I'll explain it to you\nWhat you mean, you ain't eatin'? I ain't playin' with you\nI'm just sayin', I'm the mothafuckin' man, nigga\nLouis checkers on my sweatshirt\nTry to draw this, I'm an artist, you a sketcher\nOn my grown shit, I get nauseous tryna sweat her\nI'm the coldest, I recorded this in a sweater\n\n[Chorus: PnB Rock]\nWhy you playin', shawty? I could put you on, yeah\nI know I got all of these girls up in my phone, yeah\nBut on the real, you the only one I want, yeah\n'Cause I don't wanna be a playa no more\nWhy you playin', shawty? I could put you on, yeah\nI know I got all of these girls up in my phone, yeah\nBut on the real, you the only one I want, yeah\n'Cause I don't wanna be a playa no more\n\n[Verse 2: PnB Rock]\nShawty, I don't wanna play them games no more\nUsed to be a dog, I ain't the same no more, no\nI ain't tryna be forgettin' names no more, no\nI swear I ain't dodgin' Cupid's aim no more\nSo, shawty, what's up with you?\nAin't gotta tell you, you already know I fuck with you\nPretty face, pretty smile, I'm in love with you\nSike, no, but maybe I can fall in love with you\nYeah, maybe, baby, me plus you can be an item\nAll them bitches I be just hittin', don't really like 'em\nI'ma keep it up with you, bitches, I just one night 'em\nBut with you it's all the way different, I'm tryna wife you, girl\n\n[Chorus: PnB Rock]\nWhy you playin', shawty? I could put you on, yeah\nI know I got all of these girls up in my phone, yeah\nBut on the real, you the only one I want, yeah\n'Cause I don't wanna be a playa no more\nWhy you playin', shawty? I could put you on, yeah\nI know I got all of these girls up in my phone, yeah\nBut on the real, you the only one I want, yeah\n'Cause I don't wanna be a playa no more\n\n[Verse 3: Quavo]\nBaby girl I hope the time is right\nTime's right\nShe said, \"Quavo I hope your mind is right\nI hope your mind is right\"\nChristian Loub', she gon' bleed tonight, yeah\nPlease tell me I ain't bleedin' right\nWhen she leave I hope she need a ride\nThen we pull up to the bando (SKRRR!)\nI'm the one she call on (BRRRR)\nI gotta leave my dogs alone (damn)\nYou can't give an old dog a new bone\nIn other words, baby girl, I'm comin' on home\n\n[Bridge: Quavo]\nGirl, you know we shine like diamonds in the sky\nI don't wanna be a playa no more, no I can't lie\n\n[Chorus: PnB Rock]\nWhy you playin', shawty? I could put you on, yeah\nI know I got all of these girls up in my phone, yeah\nBut on the real, you the only one I want, yeah\n'Cause I don't wanna be a playa no more\nWhy you playin', shawty? I could put you on, yeah\nI know I got all of these girls up in my phone, yeah\nBut on the real, you the only one I want, yeah\n'Cause I don't wanna be a playa no more", "year": "2016-12-01"}]}