{"songs": [{"title": "Go Fly a Kite", "image": "https://images.genius.com/c629cda714d1a967ac9eda7824c367df.600x600x1.jpg", "lyrics": "[Hook: brandUn DeShay (sample)]\nI wanna be the best that I can be (we are kites in the sky, we can fly)\nRight, right, right, right? (we can fly, we can fly, we can fly)\nWith God on my side, there's nothing that I can't see (we are kites in the sky, we can fly)\nRight, right, right, right? (we can fly, we can fly, we can fly)\nIt was promised to me there's nothing that I can't be (we are kites in the sky, we can fly)\nRight, right, right, right? (we can fly, we can fly, we can fly)\nSo until I become the best, baby, I can't flee (we are kites in the sky, we can fly)\nNah, uh-uh, nah, uh (we can fly, we can fly, we can fly)\n\n[Verse 1: brandUn DeShay]\nI told everybody don't doubt me\nNow anybody still sleeping on me gonna have nightmares about me\nThey told me I'm no Jada, they said I wouldn't make it\nI told them my flow was medicine, said they wouldn't take it\nI gave them the cold flow and still they wasn't shaking\nNiggas had hooded coats, I knew that they was faking\nA bunch of Clay Aikens\nBut I got my kite in the sky, flying high like the new Ben Franklin\nBut, I'm frankly yours\nI'm the moon and the sky if you try to shoot for\nLike... ready, aim, fire\nBang, dang, every dream is assembly required\nBut I got a mind like [?], uh\nIf I build it then they will come, my day will come\nCause I can see colors in my music\nI hope you see color when I use it\n\n[Hook: Casey Veggies (sample)]\nI wanna be the best that I can be (we are kites in the sky, we can fly)\nRight, right, right, right? (we can fly, we can fly, we can fly)\nWith God on my side, there's nothing that I can't see (we are kites in the sky, we can fly)\nRight, right, right, right? (we can fly, we can fly, we can fly)\nIt was promised to me that there was nothing I can't be (we are kites in the sky, we can fly)\nRight, right, right, right? (we can fly, we can fly, we can fly)\nSo until I become the best, I guess I can't leave (we are kites in the sky, we can fly)\nNah, nah, nah, nah (we can fly, we can fly, we can fly)\n\n[Verse 2: Casey Veggies]\nMy future bright while you haters flying kites\nI'm stomping in my Nikes\nWith my shades on\nFresh from the start until the day gone\nVeggies just welcome haters back like that Mase song\nI'm living in a fantasy, just flying off the canopy\nTaking everything because there's nothing that they handed me\nI'm ill, I feel what's real\nAnd it's a cold life, just chill\nJust freeze, just think\nThings happen in half-seconds, so don't blink\nWe tagging the world up, we need mo' green\nMo' ink, mo' bars, mo' shows, mo' cars\nLouie hanging, oh God, more haters, more \"nah\"s\nMore songs, good job, man we so odd\nI pray that I live, homie, my faith in God\nA few kisses at the bottom and more dates on the top\nThe more they hear my music and the more they on my jock\nAnd time is money and it cost more than a watch, like\n\n[Hook: Casey Veggies (sample)]\n\n[Outro: brandUn DeShay (sample)]\n(We are kites in the sky, we can fly) brandUn DeShay\n(We can fly, we can fly, we can fly) Casey Veggies\n(We are kites in the sky, we can fly) It's incredible [?] right now\n(We can fly, we can fly, we can fly) You know?\n(We are kites in the sky, we can fly) We are kites in the sky\n(We can fly, we can fly, we can fly) We are kites in the sky\n(We are kites in the sky, we can fly) We are so blessed\n(We can fly, we can fly, we can fly) We out\n(We are kites in the sky, we can fly\nWe can fly, we can fly, we can fly\nWe are kites in the sky, we can fly\nWe can fly, we can fly, we can fly)", "year": "2008-08-26", "album": "Volume: One! For the Money"}], "artist": "Ace Hashimoto"}