{"artist": "Wrekonize", "songs": [{"lyrics": "[Intro]\nYeah, I know you\nYou from that, you from that group, right?\nI've seen y'all going all around the country and shit\nY'all got it poppin' right now, shit\nHow does it feel to blow up, man?\nYou got that easy money, shit\n\n[Verse 1: Wrekonize]\nLemme get my grind on I been moving like a cyclone\nThrough the years keep my rhyme strong\nAll to eat and keep the motherfucking lights on\nWhat your problem is shit we got jobs\nWill saying that they just high profile\nSpeaking to eat and keeping the street\nUnder your feet whenever kids\nAre trying to beef cause they got no style\nI see you touring the show making the thickest of women get low\nMust be the shit so motherfucking legit\nTo get a grip from the hip exit get the dough\nShit I got boo coo fees to relieve\nI ain't free still gotta pay taxes\nStill gotta meet Uncle Sam's demand\nAnd god damn still hide a couple stacks under the mattress\nWhat you think this is?\nYou really think I got balls in the lotto\nYou think I got a money tree full of leaves\nAnd I bleed out green got a cellar full of bottles?\nThis is life ain't it? Money come money go cause it quite tainted\nAll nuttin' but a thing cause it ain't really\n\n[Hook]\nNo such thing as easy money\nI don't care what they say\nNo such thing as easy money\nI don't care what they say\nNo such thing as easy money\nStill I spend it away\nLet 'em hate, easy money\nI don't care what they say\nThere's no such thing as easy\n\n[Verse 2: Wrekonize]\nMoney will come and go quicker than the air that's gets up into your lungs\nBreathing heavier than normal and it's steady for months\nMy lady just wanna see me more than a second for once\nIt's a fucked up game full of pain huh we all working through the process\nMy conditioning's conditioned cause I'm steady on a mission\nFor the better life and getting all these objects obsessed\nWhat a life, we all paying a price to be bathed in the light\nI been wanting to know if you feeling alien tonight\nCause I never really seem to feel that safe in the sights\nWall Street fucks with they suit and the tie\nGetting bread but to get it they be losing they pride\nAlways kept cool even when they ruin my tide\nI've always envied those who just came out to shoot at the sky\nI been hustling since I was old enough to get a buck\nAnd live up to the meaning of a dollar\nGot a job pushing shopping carts and taking bullshit\nFrom a jacked up douche in a collar\nHuh I was 15 acting like the money would be better\nFor the status of my karma\nBut nothing's easy and I keep telling my momma\n\n[Hook]\n\n[Verse 3: Bun B]\nSee everybody wanna be the man\nWith the master plan that's on the top\nThey want the cars, want the clothes\nWant the broads and the bottles to pop\nBut when ya sittin' out on the throne\nLaid back chillin' being the king\nWith the watch and the chain and the pinky ring\nYou better watch your back for all the hate it bring\nSee everybody goon love yo ass\nWhen you broke as a joke and you not a threat\nBut soon as you get that bread and you start turning heads\nWatch how jealous they get\nWhen your status is elevated\nYou kind of made it and you get some change\nIf they don't get what they think they suppose to get\nThen motherfuckers start acting strange\nPointing fingers, talking down\nActing funny when you come around\nNext thing you know you the talk of the town\nUse to have a smile, now you got a frown\nYou ain't know that's the price of fame\nAnd that's what it cost to be in this game\nYou better be built for it or stay in your lane, mayne\n\n[Hook]", "title": "Easy Money", "year": "2013-06-25", "album": "The War Within", "image": "https://images.genius.com/e384fbb42e445fb209514af1582b2973.440x440x1.jpg"}]}