{"artist": "Capital STEEZ", "songs": [{"title": "Vibe Ratings", "album": "AmeriKKKan Korruption", "year": "2012-04-07", "image": "https://images.genius.com/6172be389a954926184790991e7ca0ff.500x500x1.jpg", "lyrics": "[Produced by Ant of Atmosphere]\n\n[Verse]\nNo interruptions, stereos pumping from the dungeon\nComin' live from Flatbush Junction and making it hard to function\nBreaking down your sound systems and governmental corruption\nSo, step aside pumpkin quit jumping to assumptions\nThe illest cats to ever rap, we spittin crack on beats and claps\nSalvations? Ain't 'nything, I make that up for simple tracks\nCan you resist the fact that we're about to bring it back?\nThen spring in action, write until your motherfuckin' pencils crack\nShit, I'm here all night, I wanna hear it, then embarrass you, here on sight\nAnd don't expect to be saved without a hero in sight\nCause my microphone is hotter than a heroin pipe\nSomethin' like the finest piff, maybe even some white to sniff\nIt ain't a cat nap, but I'm sure it'll have you lying stiff\nTry it, kids! Vicodins and Flintstones vitamins!\nGet stoned, get home, and lie about your righteousness!\nNah I'm serious, in fact I seen God today\nWe had a deep discussion over Marvin Gaye and Chardonnay\nA bird caught my attention, I chased her and she got away\nNow I'm left with pennies and I had to learn the harder way\nThat's a fowl shot and I ain't even get to score\nJust memories that always end in me gettin'\nBut that's the past, I don't ponder on it anymore\nRepresents a metaphor of me closing a mental door\nAu revoir Simone, sad songs when I'm alone\nAnd nowaday my heart beats to this metronome\nAnd my heart's beat is waiting for a recollective poem\nAnd a calm rhythm that resembles home, I'm gone\n\n[Outro]\nThey say sound is vibration and it got my mind shaking\nCan you feel it vibrating?\nI call it vibe ratings\nThey say sound is vibration and it got my mind shaking\nCan you feel it vibrating?\nI call it vibe ratings"}]}