{"songs": [{"year": null, "album": "Kardi Gras Vol. 1: The Clash", "image": "https://images.genius.com/fc8095744814616ac0f10409c5c72099.640x640x1.jpg", "title": "Hope", "lyrics": "[Spoken Intro]\nTo all of the song system\nAnd all the players send a representative right now(now)\nSo we can start the war\n\n[Song Intro]\nWhat if my time comes before it's time\nSo much so that I can't finish my life?\n\n[Verse 1: Kardinal Offishall]\nI was writing this sitting on a German airline\nI paid thirty euros for my air time\nJust got news Barrack won again\nWhile he saying his speech somebody got shot again\nOn twitter we vex, they still calling us niggas\nBut an hour later we screaming \"sho(u)ts to my niggas\"\nLOL SMH ETC a red rogue does not make it with VIP (no!)\nVision of leaders with real legacy\nReality will just lead you to drink remmy (huh)\nThe same city that they president came from\nHas multiple homicides possibly with the same gun\nBeing black outweighs the fame\nWhen you fit the description you know it outweighs the name (huh)\nLast seen in a white car wearing all black\nArrest everybody because we are all strapped\nI met folks who never left the east coast\nUnemployed but ironically eat the most\nIt's not a trap if you've never seen outside the cage\nYou don't know my story if you've only seen a page\nI guess it's hard to go back to your inner self\nWhen outside influences increase your wealth\nI've seen humble cats change 'fore my very eyes\nIt's like even in a dialogue, wear a disguise\nThere's still a lot of malcolms in the neighborhood\nTroubled by their exes cause the sex was good\nCoupled children together but they live very alone\nNo DNA in Jaggers but fathers were rolling stones\nMy father deviated from most of what he was shown\nTried to correct it so I would inherit stolen thrones\nI see the roses but i'm greeted with the hidden thorns\nWatching the heavens rain still trying to weather the storm\nThey say that it gets the darkest 'fore the brightest light\nBoth my hands are tied but i'm preppin' for the fight\nI'm spending time alone, praying, sending God a kite\nMomma told me don't worry but the prize is out of my sight\nI'm starting to notice others living in dimming lights\nThe trumpets blaring in the distance, I welcome the night\nWhen I close my eyes, all hope is realized\nI hope when I part my lashes, they materialize\nI'm getting by on a dollar and a dream\nWhen the government taxes that, try to intervene\n\n[Chorus]\nWhat if my time comes before it's time\nSo much so that I can't finish my life?\nWhat if my stars collide moons ago? (what if what if)\nSo now I'm a reflection in your eyes\nIs there really a heaven for someone like me?\nWill you help me get there?\nIs there really a heaven for someone like me?\nWill you help me?\n\n[Verse 2: Kardinal Offishall]\nI feel like I was born to say more than feelin' you win on bright lights and good whores\nFor those who ain't never left they shores and feel bound to the mindset of struggle in poor (hey yo)\nNever take no, never say can't, never think not, never only have one plan, never listen to your man, never listen to your girl\nNobody was born two at a time to this world yo(no)\nLive your life for the first time with every breath that you breathin'\nA few million dollars ain't enough for me even\nI gotta make so much bread that my kid's kids good when I'm dead\nI speak gifted like Andy with occurrences\nOratory dietitian, every word nourishes\nEvery prince flourishes before he claims king\nThis is my raspberry beret for the win\n\n[Chorus]\n\n[Spoken Word]\nYou don't know me, but as the dance goes on you're gonna know 'bout me\nSo my team set up(set up)"}], "artist": "Kardinal Offishall"}