{"artist": "Yukmouth", "songs": [{"album": "Godzilla", "image": "https://images.genius.com/06ce9a2ae3e7a9474fcfc10e00a00df9.500x494x1.jpg", "year": null, "lyrics": "[Yukmouth]\nHaha... I can't believe you niggas\nYou can't be serious\nYou really thought since 'Pac died the West coast fell the fuck off, huh?\nYou thought since Dre ain't made a album, we flopped?\nFuck that shit nigga!\nRap-A-Lot for life nigga!\nYukmouth nigga!\nWest Coast don nigga!\nWhat's wit it punk?!\nIt's nuthin to a boss nigga!\nWe been ridin on dubb's that spin nigga!\nWe been poppin bottles, nigga, since 'Pac was alive nigga\nThe West Coast is back you faggot ass fucks!\n\n[Verse 1]\nI'm from the West Coast and never-ever crip-walk\nI'm like the Bird Man, platinum grill, big cross\nAn I'm tryin to sell a few mill like Kris Kross\nI'm ultra cocky, tell a chicken get lost\nDiss the boss an get ya lips ripped off\nI let clips off\nYa whole click soft\nWhat you know about a hundred on a wrist watch\nTwenty on ya chicks watch\nLoungin Gucci flip flops\nAnd I bang in the club like Rick Rock\nYuk show you how to rock that real thug hip-hop\nThey ride lo-lo's\nYukmouth flip drops\nOff the floor every year is a whip hop\nMenage-a-trios all year if ya chick jock\nWith ten karats in my ear like big shot\nGodzilla get the scrilla like Chris Rock\nAn I'ma bring the West back when my shit drop\n\n[Chorus - Benjilino]\nTo roll around on 24's\nWit plenty millions in a vouge\nEverything a nigga want..\nIt's nothin 2 a boss!\nSo much ice a nigga froze\nCustom rides wit 310's\nUntil I die it's all West coast\nIt's nothin big to a boss!\n\n[Verse 2]\nYeah... if you gon' do it, do it right\nI'm in the blue and white\nRally striped Vipe leavin Peanuts wit a crew of dykes\nTuesday night I got my game together\nI'm dangerous fella\nMy rims spin like plane propellers\nAn I'm down wit Prince James forever\nRap-A-Lot fo' lia (life)\nYukmouth, Scarface an Tela\nAnd ya'll know Yuk is off the meter\nFor all you non-believers\nI spark the heater\nI'm what you call a block leader\nWhy you hatin?\nI roll through ya radio station wit Gary Payton\nIn a franchise Lac outside on cherry Dayton's\nAn rock the new blue Burberry\nMake every nation feel the thug vibration, uh\nMy cars talk back like Michael Knight\nI got a hunderd on a Roy Jones and Tyson fight\nYou wanna roll wit baller, well tonight's ya night\nI rock ice cause the price is right\nStep it up hater. Yeah\n\n[Chorus]\nTo roll around on 24's\nWit plenty millions in a vouge\nEverything a nigga want..\nIt's nothin 2 a boss!\nSo much ice a nigga froze\nCustom rides wit 310's\nUntil I die it's all West coast\nIt's nothin big to a boss!\n\n[Verse 3]\nEvery day I'm poppin a bottle, and poppin a tag\nFourty G's in a Gucci bag, I'm coppin a Jag\nTwo-hundred G's in a Louie bag, I'm coppin a pad\nWit the dragon shaped tool in the bag\nWhat you know about that?!\nWhat you know about chronic an Hypnotic\nCoppin Lamborghini's from 310 an Simbalic\nDrop stretch Hummers, twenty-four inch rims on it\n??? skin interior wit the suede trim on it, wait!\nI came in the game wit mobsta tales\nI hit Mr. Chow's for meals, crack lobster tails\nAt the mall wit a model who only buys Chanelle\nYou wish I fell, but I prevail, Yukmouth is ill\nI rock the 'Wheels of Fortune' like Pat Sajack\nIn a black Maybach\nI'm tryin to bring the Bay back\nIn a A's throw back and a A's hat\nYuk a beast, and bleach couldn't fade that!\nWhat?!\n\n[Chorus]\nTo roll around on 24's\nWit plenty millions in a vouge\nEverything a nigga want..\nIt's nothin 2 a boss!\nSo much ice a nigga froze\nCustom rides wit 310's\nUntil I die it's all West coast\nIt's nothin big to a boss!", "title": "Nothin 2 a Bo$$"}]}