{"artist": "Boondox", "songs": [{"album": "Krimson Creek", "title": "Country Life", "year": "2008-05-13", "lyrics": "(Country life)\n\n[Verse 1]\nFront porch livin' swiggin' whiskey and mescaline\nSwingin' fly swatters catchin' trails from that Ketamine\nWe on some other level, country like a motherfucker\nAsk the way I'm living, shit, they ain't no other motherfucker\nGive me mosquitoes and a moonlit night\nGive me a red dirt road and I'll be doin' alright\nSittin' down by the river bottom by the grist mill\nDouble fistin' Evan Williams steady climbin' Heaven's Hill\nThis is what it's all about I couldn't ask for nothing better\nMe, myself? I'm high fucked up and light as a feather\nI hear them crickets chirpin', I think I'll lay back and listen\nI got a line off in the water but I ain't thinkin' about fishin'\n\n[Hook]\nThis that country life\nThis is the life for me\nLiquor, cars and tittie bars\nThis is the life for me\nCountry till I die\nThis is the life for me\nLiquor, cars and tittie bars\nThis is the life for me\n\n[Verse 2]\nI like them bitches talk that dirty south slang\nI like them bitches, they be walkin' shake that dirty south thang\nThey be them hoes up on that cornbread chicken and collard greens\nHam hockin bitches, sweet potatoes and red beans\nWhere'd you get an ass like that?\nPissed off in that baby fat\nSuckin' on a Dr Pepper, shorts all in her booty crack\nThey come up speakin' slow like \"how are you?\"\nAlways sassy, kinda nasty and with somethin' to prove yeah\nY'all know them ones from Kentucky and Alabama\nThem swamp livin' Cajun bitches straight out Louisiana\nThe Carolinas, Georgia, Florida even Mississippi\nCountry girls with fat 'ole asses\nActually, let me see them titties\n\n[Hook]\n\n[Verse 3]\nRusty cars off in the yard, bitches, booze and tittie bars\nThat's the way we livin', drink our liquor straight up out the jar\nRollin' wood, we blowin' smoke, poppin' pills until we choke\n180 proof to wash it down and that's all she wrote\nAnd if it kills me, bury me in red clay\nAnd let it all be catered by the Ol' Country Buffet\nPass the whiskey bottle and drink it like you're full grown\nAnd let the bitches dancin' fuckin' naked on my tombstone\n\n[Hook]\n[x2]", "image": "https://images.genius.com/880085d49aff9217e77dc1187f030306.500x500x1.jpg"}]}