{"songs": [{"album": "No Mercy", "image": "https://images.genius.com/f55abc725080eb05147e45ce3cd406a8.1000x1000x1.jpg", "year": "2010-12-07", "title": "Amazing", "lyrics": "[Hook: Pharrell & (T.I.)]\nMm, mm, what?\nSkateboard P'll make your face fall off\n(Serve a bitch straight D) And make her face fall off (okay)\nNiggas come through and make your face fall off\nWhat the fuck you gon' do? Make your face fall off\nBaby boy it's amazin', so amazin', so amazin'\nAmazin', so amazin', baby baby\nAmazin', so amazin', amaz-amazin'\nAmazin', so amazin', baby baby\nSkateboard P make your face fall off\n(I serve a bitch straight D) And make your face fall off (uh-huh)\nNiggas come through and make your face fall off\nNigga what you finna do when your face fall off?\nBaby boy it's amazin', so amazin', so amazin'\nAmazin', so amazin', baby baby\nAmazin', so amazin', so amazin'\nAmazin', so amazin', baby baby\n\n[Verse 1: T.I.]\nIt's automatic got a baller habit, smokin aces what you facin'\nWhen you hatin, ain't no rehabilitation\nFor that monkey on my back, hundred-thousand-dollar stack\nYa ain't heard, used to serve Firebird like a Pontiac\nRewind me back, ay you know where they used to find me at?\nIn the back, sacks full of somethin for insomniacs\nDope boy, trap nigga in my past life\nNow I just serve rap nigga plenty act right\nYou know where we at, right here, like yeah\nIn the club on the furniture, fuck do I care\nTell the club owner here, Rosé, Remy bottle please\nGot a carload of bravado, ain't nobody hot as me\nI don't bend, I don't break, I go in, I don't play\nTell your friend that the game can begin if she stay\nI pass out cake like your birthday bitch\nIf you kiss both of those, lick that, take this\n\n[Hook]\n\n[Verse 2: T.I.]\nAy, a dopeboy with the swag of a pimp nigga\nExcept one thing, I'm paid more than them nigga\nYou see a bitch can't afford this life\nHave to fuck a ballplayer and a mayor every night\nMaybe twice, late at night we, be in white tees\nMe and Skateboard P, no Nike's\nJust a pair of Margiela, get a broad tell her\nRain dance for this paper, better get her umbrella\nYeah, had guns like an arms dealer\nDream team lawyers, he ain't never been a dumb nigga\nNigga, this your girl, better come get her\nTurn her to a dick monster, nut muncher\nSperm rag, cum dumpster, left amongst her\nBitches in the past, pretty titties, plenty ass\nThey just drink up what we give 'em, take shots without any glass\nFuck her in the face 'til it fall off or 'til she gag, gag, gag\n\n[Hook]\n\n[Verse 3: Pharrell]\nAnd it don't stop\nA lot of niggas out there think that they could do what we do\nBe my guest, go and front for the people\nBut just like a storefront they gon' see through\nThat you sweet like bubblegum and they gon' eat you\nHow you blowin up? Nigga they chewin you\nAnd when you hit rock bottom they shoo'in you\nLike \"Ooh, you eww, get away!\"\nNot you? yeah right, okay\nDon't listen to these guys, these niggas full of lies\nCut 'em open and they cover up the floor, you surprised?\nEvery time they talk about what they gon' get\nThey been lookin at my blog knife and forkin my shit\nWhile I'm tryin to get the new G-5 with the kit\nWith the bed in the back, cause my son hate to sit\nAnd all that dark blue shit, y'all niggas been had\nMy diamond's rainbow like they registered for GLAAD\nEvery aspect, whether plane, boat or pad\nTote a brightness like your chain 'pose to have\nGot it from Lorraine so you know that they straight\nPlus the Audemar twins, I guess my wrist couldn't wait\nTo tell ya\n\n[Hook]"}], "artist": "T.I."}