{"songs": [{"year": null, "image": "https://images.genius.com/ba8646c3560f422ca6b3ac1ef03abf8f.220x220x1.jpg", "title": "Heavyweights", "album": "Violator: The Album", "lyrics": "[Fat Joe]\nYeah (y'all niggas is crazy)\nDon Carta' bomb harder (we makin a BOMB mayne)\nTerror Squad, what, what? (aiyyo, uh, ye-yo, Terror Squad)\nDon Carta' bomb harder (Suave House) what the fuck?\nViolator, Violator!  Yeah, uhh, yo..\n\nNo heart, that's why them other niggas foul\nEight hit me in the cell, said to meet him in the A.T.L\nAt 12 up in the Gentelman's Club\nWhere you ain't fuckin nothin less you givin up dubs\nFeelin the love, from tha killers and thugs\nPlayers and pimps, ladies and gents, swift in the butt\nNot givin a fuck, that's the life I live\nTrife like this, blow you up wit yo wife and kids\nI dislike my bitch, but I still gotta deal wit her\n16 shot meal getter, that's why I'm still wit her\nFor real nigga, you couldn't possibly lock with me\nMy squad be bringin more \"Havoc\" than \"Prodigy\"\nAin't no stoppin me, I got killers that'll pop for me\nRun up in my stash and give that ass more beef than broccoli\nWith no apology, yo blocks'll be my property\nCop a seat and watch the Terror Squad prophecy\n\nChorus: Eightball, Big Punisher\n\n(This is for the heavyweights)\n[8]\tMake no mistakes\nThirty six O's is my favorite kind of cake\n(This is for the heavyweights)\nWe runnin from jail\nStackin that mail, tippin the scale\n(This is for the heavyweights)\n[Pun]\tAiyyo we live large, big cars, 3-D ice\nI'm so big, niggas see me twice\n(This is for the heavyweights)\nWe three guys, that don't play those games\nYou got beef with us, nigga say our names\n(This is for the heavyweights)\nAiyyo we live large, big cars, 3-D ice\nI'm so big, niggas see me twice\n(This is for the heavyweights)\nWe three guys, that don't play those games\nYou got beef with us, nigga say our names\n\n[Eightball]\nYeah, yeah\nTake it to the next level, Joe, Crack and Big Ball\nBlaze up the hay, one two, mic check y'all\nAll been warned, this heavyweight combination\nConnected in the disclosed location\nSo niggas won't be runnin up and make me have to slug at, above that\nPart of yo' body where your bulletproof hug at\nRugrat, you better find some mo' kids to play with\nThree titanic niggas, we ain't got to say shit\nOur way shit, do some real make em pay shit\nThem niggas wit me that don't rap, them the one's that spray shit\nPop pop, with the chop chop, out the drop top\nDrip drip, goes a nigga blood, til his heart stop\nHard times made a nigga write a lot of hard rhymes\nHard lines from my mind took Eightball big time\nWith Fat Joe and Big Pun\nI guarantee don't none of y'all tricks want NONE\n\nChorus: Big Punisher\n\n(This is for the heavyweights)\n[Pun]\tAiyyo we live large, big cars, 3-D ice\nI'm so big, niggas see me twice\n(This is for the heavyweights)\nWe three guys, that don't play those games\nYou got beef with us, nigga say our names\n(This is for the heavyweights)\nAiyyo we live large, big cars, 3-D ice\nI'm so big, niggas see me twice\n(This is for the heavyweights)\nWe three guys, that don't play those games\nYou got beef with us, nigga say our names\n(This is for the heavyweights..)\n\n[Big Pun]\nYo, aiyyo fuck you!  Fuck your whole crew for breathin\nFuck your mother, your father, your kids - for no reason\nI don't give a fuck if you da wildest nigga on earth\nIt's one planet and I'm the fattest motherfucker in the universe\nYou worse than a motherfuckin snake in the grass\nFake for the cash, wait til you pass ??, shake and you crash\nYou pay for yo' acts, and all the mistakes you made in yo' past\nHope you get raped in yo' ass while you, takin a bath\nUP NORTH - you wouldn't last a day and a half\nI'll bet my weight and my stack, a razor will slash, yo' face and yo' ass\nBefore you can say, \"Take me at last, I'm ready for death\"\nNow you just heavnely strapped\nA cherry with lips, a fairy or bitch, you barely exist..\n.. you motherfuckers ready for this?\nGrab your crucifix, tell god I'm coming for your juicy lips\nYou'se a bitch, don't let me run up in yo crib with the ruthlessness\nBruising shit enough to hurt and pain I'll bring\nYou got beef with Pun, nigga say my name\nI don't play those games, you picked the wrong nigga to fuck with\nPunk bitch, that's why yo' mother suck dick!\nWhat...\n\nChorus: Big Punisher\n\n(This is for the heavyweights)\nAiyyo we live large, big cars, 3-D ice\nI'm so big, niggas see me twice\n(This is for the heavyweights)\nWe three guys, that don't play those games\nYou got beef with us, nigga say our names\n(This is for the heavyweights)\nAiyyo we live large, big cars, 3-D ice\nI'm so big, niggas see me twice\n(This is for the heavyweights)\nWe three guys, that don't play those games\nYou got beef with us, nigga say our names\n(This is for the heavyweights)"}], "artist": "Big Pun"}