{"songs": [{"album": null, "year": "2011-06-18", "title": "Cheer Up", "image": "https://images.rapgenius.com/f6811066809222ba1c4e91396b277c0e.500x500x1.jpg", "lyrics": "[Hook]\nEven through the joy I feel the pain\nEven in the sun I feel the rain\nEven when I’m high I feel the lows\nLike that's all I know\nAnd Lord knows I can't complain\nBut even when I do it feels the same\nI’m getting high just to fight the lows\nCause that's all I know\n\n[Verse 1]\nYeah, school girl, cool girl\nYou dressing sexy and your mama is a cougar\nSo she let you do the grown folks thang\nLet you hang with them boys and they play you like a fool, girl\nYou got your new hair, it look so good\nYou write the same nigga's name in your notebook\nYou know the same one from class, the one you let smash\nNow you see him 'round school and he won't look\nNow girl you is fine, ain't no doubt about it\nBut why else you think he hit it and forgot about it?\nIt's cause your mind don't match what your ass got\nBut cheer up, you gotta be your own mascot\nYou see you're lookin' for a man like you need somebody\nGet your ass off of Twitter, you could be somebody\nA doctor, a rock star, baby live life\nBut you rather wet up all your pillows all night thinking...\n\n[Hook]\nEven through the joy I feel the pain\nEven in the sun I feel the rain\nEven when I’m high I feel the lows\nLike that's all I know\nAnd Lord knows I can't complain\nBut even when I do it feels the same\nI’m getting high just to fight the lows\nCause that's all I know\nThat's all I know, that's all I know\nThat's all I know, that's all I...\n\n[Bridge]\nHey cheer up!\nEy lil' mama, cheer up!\nYou got your whole life to live, ey why you wanna tear up?\nDon’t let them lil' boy come but do some when they try push up\nHey, hey\n\n[Verse 2]\nYeah, I wake up in the morning and I ask myself\nIs life worth living, should I blast myself?\nDon't even wanna get out the bed\nI got the Glock to my head, feel I rather be dead\nHey, am I hopeless? Raised with rats and roaches\nNever liked them teachers, couldn't stand my coaches\nAsk \"what's the matter?\" but you can't relate\nLiving the life that you hate but you can't escape\nFeel like I’m stuck here, that's why I don't give a fuck here\nThere's no luck here, nobody to trust here\nMy own mother, yeah I love her\nBut things I heard as a child under my covers\nLeft me with scars, it was hard to see her suffer\nDarkened my heart and I don't know if I’ll recover\nI'm going under and as I'm headed out the front door\nShe said she proud of me and I wonder what for?\nAnd once more\n\n[Hook]\nEven through the joy I feel the pain\nEven in the sun I feel the rain\nEven when I’m high I feel the lows\nLike that's all I know\nAnd Lord knows I can't complain\nBut even when I do it feels the same\nI’m getting high just to fight the lows\nCause that's all I know\nThat's all I know, that's all I know\nThat's all I know, that's all I...\n\n[Bridge]\nHey cheer up!\nEy lil' mama, cheer up!\nYou got your whole life to live, ey why you wanna tear up?\nDon’t let them lil' boy come but do some when they try push up\nHey, hey"}], "artist": "J. Cole"}