{"artist": "Cam’ron", "songs": [{"title": "Curtis (50 Cent Diss)", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Verse 1]\nThe truck or the Lambi, Cam be stuffed in some candy\nThis ain't a label Curtis I'm fuckin with family\nSee my squad done waited right behind them bars that's gated\nHopped out the casket bastard, reincarnated\nYep, so have a seat, this gon' be a masterpiece\nI have to beef, he look like a gorilla, with rabbit teeth\nBugs monkey, act hard, with a crack god, that mack broads\nThat video ain't Queens, it's your backyard(Connecticut)\nCurtis, it's messin' with your head bad\nYou that mad but dag that's security with red flags?\nYou bangin' five shootin' rocks and signs my way\nFine play I keep it neutral but my family's nine, trey\nSoo woo, my A-alikes, that stay to fight, from day to night\nWhen I smack the Lighty brothers Dave and Mike\nHuh, believe me ho, you can't be me though\nJimmy ain't the President, he the C.E.O\nZeek is the President It's evident he'll cock and spray\nSantana underboss, I sign off like Dr. Dre\nI fuck with Zoe Pound too what up? Sak Pase?\nGrab the coco my cock, so zozo rockaway\nI extended the clip, never be friends with you pricks\nShout to a real Queens dude, you know Kenneth McGriff\nHe ran from police, you run with police\nYou ain't from Southside, you 'bout to get ya mouth wired\n\n[Hook]\nCurtis!!! (Rewind it DJ)\nCurtis!!! (You ain't 50, 50 Cent from B.K.)\nCurtis!!! (Yep, he deserve to be nervous)\nCurtis!!! (Damn, show some courtesy Curtis)\nCurtis!!! (Uh! Rewind it DJ)\nCurtis!!! (You ain't 50, 50 Cent from B.K.)\nCurtis!!! (Yep, he deserve to be nervous)\nCurtis!!! (Damn, show some courtesy Curtis)\n\n[Verse 2]\nAiyyo, check the tail girls break they neck and nails\nJust for me to sex they tail but let's talk record sales\nJuelz eight hundred, Jim fo' hundred\nI copped more cribs, more cars, got more blunted\nYeah I rocked The Roc so stop it, doc you coppertop\nMy niggas watch 'em ball, your dudes I watched 'em flop\nYep, so beware, dog I'm tryin' to be clear\nBanks bricked, Mobb bricked, Buck ain't been out for three, years\nLet me be fair, I hop up off a sweet Leer\nRight to Lennox ain't no sand, but I'm on my beach chair (What up Hov)\nThese are not tales, and dog we not frail\nYou don't club in New York you party out in Scottsdale\nHuh, I can't be clowned, beef dog, God damn we down\nHow you livin'? You live in Tyson's hand me down\nPlus you can't be found I'll have you taped, gagged, and bound\nAsk around, I never liked the circus so I clap a clown\n\n[Hook]\n\n[Outro]\nAiyyo man, thanks for all the shoutouts, for my dudes\nYou keep shoutin 'em I love it baby them my brothers\nI ain't hear you say Banks name in a minute\nTalkin' 'bout Koch a graveyard you just signed off for Prodigy to go there\nAiyyo P he a sucker, get away from that dude B\nYou ain't got no swag with buck teeth\nYou know how you ain't got no swag?\nWhoever let you sign off on them G-Unit tank tops is stupid just like yo dumb ass!!!\nThem is brassiere tops, whoever wore that outside was a homo, gay ass nigga!!!\nAiyyo stop callin' my probation officer to, why you talkin' 'bout my probation?\nYou tryin' to get me locked up Curtis?!\nAiyyo Curtis you really tryin' to get me up?\nYou said somethin' about my probation on your song\nNext thing I know my probation officer call me today said he need to see me\nAiyyo if I go to jail, Curtis put me in jail!!!!\nIt's crazy I gotta go report to probation, next Thursday\nI ain't supposed to report for three weeks\nI gotta go Thursday and he mention my probation\nAiyyo let me get off this mic now cause I know how you get down, rat ass nigga!!!\nThat's true story that's not even a joke I'm dead serious...Probation"}]}