{"artist": "Andy Mineo", "songs": [{"title": "1988 REMAKE 2_Nottz_42North.wav", "album": "Work in Progress", "year": "2019-07-12", "image": "https://images.genius.com/84c0be88cffb31af8331e2f1ab01f75c.1000x1000x1.jpg", "lyrics": "[Chorus 1]\nTime, you just keep going\nAnd one day you're going on without me\nTime, you just keep going\nAnd one day you're going on without me\nTime, you just keep going\nAnd one day you are going on without me\nTime, time, time, where you going? Come back\n\n[Verse 1]\nEvery coin got two sides, every sword got two edges\nLife begin as one ends, how will I be remembered? Mortal men\nThere's something 'bout 30 make ya contemplate the journey\nYa heard me? (Uh)\nI told my momma, \"Can't believe I'm gettin' older, wish that I could stop it\" (Huh)\nShe like, \"What's ya other option?\nYou either in the grave or you get another year\nSo blow these candles out, we just happy that you here\"\nI found a picture of me back in college\nMy skin was a little tighter, body was more brolic\nMy baby face got a new wrinkle up on it by my eyelid\nTold myself it must of been from all this smiling\nLife, no one survives it\nAs much as we want to control it, it just throw surprises\nWhen I was younger all I heard was, \"You got potential\"\nBut I don't hear that no more, I hear, \"The rent due\" (Uh)\nAnd every birthday is bittersweet, it mean our time is shorter\nBefore I see the Lord, I want to get some things in order\n29, this the victory lap\nMy fellows gather 'round, we just opened my gold plaque\nThought I'd feel more excited, but really I'm kinda sad\nCan I do it again or are my greatest days in my past?\n\n[Chorus 2]\nTime, you just keep going\nAnd one day you're going on without me\nTime, come back, ayy, YERR\n\n[Verse 2]\nI don't want to do this when I'm 48\nWell, I could, but, look, I ain't cool as Jay\nAnd I ain't cool as 'Ye\nI'm kinda cool with grey\nSo when the salt and pepper look come, I'm ready for that day\nI don't want to stretch before I play ball or go bald\nOr lose strength today worrying 'bout tomorrow\nI had this moment, I was walking through the park\nSaw a boy playing catch, a woman walking her dog\nI thought, in a hundred years none of us'll be here\nReplaced by new people that probably never cared you existed\nJust living they life, minding they business\nNo matter how famous you get, they still forget ya\n\n[Break]\nRemember the time the Beatles said that they more famous than Jesus?\nI still think it's funny\nSome people didn't know who Paul McCartney was 'til he made a song with Yeezus, but\nMillions still gather on Sunday\nPreach\n\n[Verse 3]\nLife is less of a line, more like a circle\nWe can't wait to grow up, then pray for the reversal\nOr pay for the reversal\nAlong the way I learn to enjoy it while you have it and forgive whoever hurt you 'cause\nIn the end if you don't get healed, you get revenge\nAnd even though it feels sweet, you never really win\nIt's hard to sleep, lay in bed and have peace when\nYou became the very thing you hated just to get even (Uh)\nSo tell me what you believe in\nIt's nothing that you say, it's what you're doing everyday\n29 years of life, look what I became (Momma)\n'Cause I'm a little less eager to prove something, more confident in who I am\nIt doesn't make for good TV, but make me a better man\n\n[Chorus 1]\nTime, you just keep going\nAnd one day you're going on without me\nTime, you just keep going\nAnd one day you're going on without me\nTime, you just keep going\nAnd one day you are going on without me\nTime, time, time, come back\n\n[Outro]\nHappy birthday, dear Andy\nHappy birthday to you\nYay!\nAlright\nOkay, alright, here we go, alright\nMake it a good one!\nYay\nI had to think about it\nI'm in here"}]}