{"artist": "Casey Veggies", "songs": [{"title": "Said She Like Me", "album": null, "year": null, "image": "https://images.genius.com/32b2573b26965a28ec11e81e389c7812.664x664x1.jpg", "lyrics": "[Verse 1 - Casey Veggies]\nGive me a reason why you think\nThe money ain't coming in\nI run and spend like it's right before the bar close\nA lot of niggas see me up in them bar clothes\nIt's summertime, but I'm still cooler than ?\nWhy hoes threaten on me like I ain't shit?\nTelling me they're single and the shit that they ain't with\nWhen they hit the crib, they couldn't picture this painting\nRunning around shirt off, I got girls fainting\nYeah! I got that shit that you want though, don't front though\nCause I'm on my job and I make it look fun, yo\nI run through haters like akimbo plush tho\nThis young nigga at lunch, we eat a rapper for lunch though\nI'm the nigga in the city, yeah, the reason you come for\nDon't go no further than them Inglewood ? though\nStay over on Melrose where they sell clothes\nWhile I be in the city sticking up like Velcro\n\n[Hook]\nSaid she like me and she like her mom\n\n[Verse 2 - Casey Veggies]\nI told y'all 9 times I was the best nigga\nThat's why you see these lames jockin my fresh figures\nGirls send the best pictures, pose for the cameo\nCaveman flow, we're something like Neanderthals\nI give it raw, you don't give at all, young nigga ball\nIt's going down, she hear my sound to take it off\nI'm the Veggie man, that's why they eat it up\nI'm getting veggies man, my money's stacking up\nHaters backing up, them shows shutting down\nOn stage we tear it up, and now I spread it round\nThese rappers say they got flow, I got mines too\nThey walking by I zap em up: swine flu\n\n[Hook]\n\n[Verse 3 - Casey Veggies]\nGirl, there's like 3 of you and\nI'm too much homie\nI don't introduce myself cause they already know me\nDamn! Tell me you know somebody better, or\nA young nigga like me that's gonna get cheddar\nI destroy competition then jam, Vendetta\nOnly kid in the alphabet ? need letters\nThe new Hefner, new sweats are way better\nI'm trying to buy it out and throw stacks like Mayweather"}]}