{"artist": "ProfJam", "songs": [{"album": "The Big Banger Theory", "title": "Drogas & Bottles", "image": "https://images.genius.com/6e843e4b8e7baf935ba4489f21fb0bfc.496x490x1.jpg", "lyrics": "[Hugo Phoenixxx]\nSmoke some, drink some [x8]\n\nCall of duty, pro evolution\nConsola ligada, entretidos ma nigga, com bolas e balas\nCom drogas e bottles, com drogas e bottles\nCom drogas e bottles, com drogas e bottles...\n\nCom tropas e damas, com tropas e damas\nMeus doggs todos com planos q envolvem catotas e mamas\nTchillo com drogas e bottles, tchillo com drogas e bottles\nCom drogas e bottles, tchillo com drogas e bottles...\n\n\nVida tá fodida xixolina, penso enquanto qum gajo kissa a guima\nDá pa ver qe toma vitaminas..tem um corpo tipo a trina\nO que é qe ela tá fazer comigo, eu não tenho money sou broke\nPensamentos antes de xegar à terra do alcol um gajo lá ri com bros\n\nNo dramas, atitude é i can obama, deixa os bradas tão fixe com escamas\nDigo faixas pa clips são várias, vai correr tudo fixe na estrada, do sucesso\nNada me para nem uma redlight, dum semaforo ou memu da espada dum jedi\nÉ escusado perguntar quando é qa minha fé cai, tipo alguem no inicio dum episodio csi\n\nMó profjam se vieres cá traz bombay, naah sam não qero tar na stone age\n.só qero a uva tinto ou rozay, fuck qem diz qe misturar drinks não convem\n.don simon grants cachaça goldstrike\nProblemas serem relevantes, thats that shit a i dont like (bang bang)\n\nO qe acontece em vegas fica em vegas e quando há bebida o hugo fica em vegas\n.não devia espigar qu meu negro big c tem mooves tipo o jagger\nDança kuduro depois vai sleppar, negros a andarem aos zig zags\nVim da nave onde o xzey tá, e é só de jeito qe encontro peace cá\n\nCall of duty, pro evolution\nConsola ligada, entretidos ma nigga, com bolas e balas\nCom drogas e bottles, com drogas e bottles\nCom drogas e bottles, com drogas e bottles...\n\nCom tropas e damas, com tropas e damas\nMeus doggs todos com planos q envolvem catotas e mamas\nTchillo com drogas e bottles, tchillo com drogas e bottles\nCom drogas e bottles, tchillo com drogas e bottles...\n\nDrogas e bottles e bottles com drugs\nMeus tropas safaram umas collie wee budz\nAgora tamos todos a dar pa thugs\nSem crips na cara pq os olhos são blood\nNigga enche o meu cup! nao tenho pressa, só pressure...\nBrinda aí: good luck! e não te percas, faz essa!\nTá tudo chapado, é claro que eu so paro qd nao conseguir andar\nApenas voar....\nTá tudo encostado, noutro estado onde só há o presente, o passado e o futuro no mm lado!\nO momento no seu estado mais puro, imaculado..\nEntao puxa mais uma grade, senta-te ao meu lado, vamos falar um bocado..\nEq eu tou sempre ligado, cabeça só descansa qd o ar fica pesado..\nÉ claro q tou a exagerar mas o fumo faz me esquecer a liiiife\nÉ claro q tou a exagerar mas o fumo lembra me o q é a liiiife\nA vida é espirito e físico, nao vivas só num!\nNao sou o tipico q'imite homem comum\nCria o teu rumo, nao sejas mais um\nAcende a tua luz como um vagalume\nAcende a tua luz como um vagalume\nAcende a tua luz como um vagalume\nAcende a tua luz como um vagalume\nAcende a tua luz como um vagalume\nVida nao tem sentido obrigatorio\nPor isso nao julgues ninguém\nA vida é um observatório para o infinito e mais além nigga\nAcende a tua luz como um vagalume\nAcende a tua luz como um vagalume\nAcende a tua luz como um vagalume\nAcende a tua luz como um vagalume!", "year": "2014-06-06"}]}