{"songs": [{"year": "1994-01-01", "album": "Ass, Gas, Or Cash (No One Rides for Free)", "image": "https://images.genius.com/82ea5b0841bddad3be771a5b1b5f1817.600x596x1.jpg", "title": "Into You", "lyrics": "[Intro]\n{Door bell rings}\nMs. Parker: Oh, hi Darryl\nK-Dee: How you doing Ms. Parker?\nMs. Parker: Fine...Ricky's not here\nK-Dee: Oh...can I talk to you for a minute?\nMs. Parker: Well...oh, alright. Come on in\n\n[Verse One]\nGod damn, ma'am\nCan I take a bite of the ham-hock?\nMy cock is like a rock\nYour son is like my brother\nAnd with your wrinkled pussy you can be my lover\nAnd I'll smother that shit like a biscuit\nAnd have you sprung with the head of my dilznic\nWon't treat you like a hoe on Figueroa\nIt's K-Dee the American Gigolo\nAnd a nigga know you like what I write\nUsed to spend the night just to see you in tights\nWorking out to that bitch Jane Fonda\nMs. Parker may I call you Yolanda?\nCause you can see, I'm all grown up\nAnd I got this player shit all sewn up\nYou five years from the 5-0, I'm twenty fo'\nAnd I thought you should know\n\n[Hook] {x2}\nI'm into you now, into you now\nInto you now, into you my black baby\n\n[Verse Two]\nYou're buck wild like a horse\nDivorce\nAnd wanna get back in the mix of course\nAn old ass freak, trying to play chic\nDon't worry about your son cause we can sneak\nTo the mozzy\nTo the wozzy\nCan I help you with those groceries?\nI love the way you cook\nI love the way you look\nI'm hooked, I feel like a crook\nOr a cat burglar\nPussy murderer\nLook at look at her\nShe's what I prefer\nI can picture you\nWith a dick or two\nIn your mouth\nYou're from the south\nYou like it the old fashion way\nBut Ms. Parker please\nHands and knees\nSo I can squeeze\nThese\nT.I.T.S\nWe'z out\nI already got the room key\nTo the cozy spot that's hot where you can do me\nTo see you naked is a dream come true\nSo bring your ass over, oooh\n\n[Hook]\n\n[Verse Three]\nIt was on and I wrecked it\nBut to tell you the truth it wasn't what I expected\nA little too loose from all that abuse from your ex\nNo more sex\nI think I had enough, but we can be friends and stuff\nGirl, I know it's rough\nAnd we can have dinner\nBut you gotta stop blowing up my pager like the World Trade Center\nEnter The Dragon, I thinking 'bout tagging\nYour daughter, she's younger\nAnd she hungers\nFor a father figure\nMy nuts are bigger than any other nigga\nShe let dick her\nI think you should know\nI think you a hoe\nAnd, I think I better go\nI hope you are stronger\nBut to tell you the truth I'm no longer\n\n[Hook]\n\n[Outro: K-Dee talking]\nGet the fuck out my face. I can't fade you no more. You're too old for me. I can't even fuck with you. Well peep...is your daughter home? Well tell  her to come down stairs. Yeah. Well look...give her my pager number and tell her to page me. Yeah. Tell Ricky I came by"}], "artist": "K-Dee"}