{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/2df76f5be8e481c4a5e06d60a13adbe0.662x566x1.jpg", "title": "Cuidado", "year": "2013-12-21", "album": "Not O.K.", "lyrics": "[Sample]\n[?] la [?]\n[?] del amor\n[?] la [?]\nCuidado por favor\n\n[Verse 1: Kool A.D.]\nPeep the sensualidad of my ambiance\nGravitas from the top to the Adidas\nAy, try to photocopy the photograph\nYou don't know the half\nDon't go the path if you don't know the math\nSometimes I sniff powders and fold my soul in half\nAnd laugh as I sip from the golden flask\nAnd lamp in a stolen Pathfinder sipping grass\nTrying to reach behind the ass and touch that vagina\nYo, my bad, I'm clowning, son\nTake problems and drown them in rum\nHa, yeah, plus ginger ale\nKool so Singer, too big to fail\nOceanic, I'm Shamu, the killer whale\nMarine World Africa, splash splash I'm a dolphin\nBig and 'Pac mixed in a cauldron with Leonard Maltin\nIt nonstop, it don't halt, man\nFuck with 3 Women like I'm Robert Altman\nWrote this on a train on a iPhone\nJust like I was Rick Ross or something\nOh my god, dude, I'm totally fucking awesome\nYo I do it for the kids who are awesome too\nBroly gnarly\nBroly, broly, broly, gnarly\nRadical, radical\nGo Niners and Raiders too\nFuck one-liners, I do mo-liners and haters you\nBetter watch the fuck out\nYou're really stupid, you're suckers and you fucking suck, and you suck, man\nI'd fucking punch you in the face and fight you\nI don't like you-nah wait, yo\nBut hush the records go gold yo, I'm so Midas\nShout to Run-D.M.C. and Emmanuel Jal\nThe kid lamping at some annual ball all cleaned up\nOr at the mall all leaned up\nWatch this here, I'm all creamed up\nWhatever, yo\nI was born to write a hook but I don't feel like it, yo\nI'm so Murphy Lee\nY'all know my government\nGuido puppet wunderkind\nKiefer fucking Sutherland, 24\nI'm Eddie Murphy, 48 and plenty more\nCatch me at the penny store\nBuying art supplies\n3 or 4 stacks for my pictures so far\nSometimes the art lies, but the numbers don't\nLike they under oath\nShout to mom and poppa, your son's a GOAT\nThe acronym\nAsk the kid\nAny question\nAny question, take a crack at him\nYo, listen to his answers and laugh at them\nLike jokes\nI got a Sixth Sense, yo, I see white folks\nI got a sick sense of humor like white jokes\nWhen I kick it with rich bitches I sniff nice coke\n\n[Sample] [laughing] Oh, but seriously...\n\n[Kool A.D.]\nAmaze 88 otra vez, otra vez\nAmaze 88, Kool A.D., best rapper, check it out, yo yo yo\n\n[Verse 2: Kool A.D.]\nYo, bruise blood, come out to show them\nLadies love Kool\nChris Dorner on the corner\nNat Turner with a burner\nThe up-turner\nThe upsetter\nThe up-getter\nTan man from the land of the chuck weather\nChicken heads cluck and just slide off the duck feathers\nNut the fuck up, get your bucks better\nOr do whatever, whatever\nGive fucks? Never that\nHate mail senders never get a letter back\nSouls get snatched like rats by clever cats\nPut it on the trap and you might not ever get the cheddar back\nYou want me on the track? You better get a stack\nOr 2 or 3 or 4 or more\nMost of these rappers is whack but I ain't mad at you or me or your boring ass team\nOr whatever, yo\nGive a fuck? Never that\nGet cream, or whatever\nWe all dream of a better type of scheme and scene\nAnd so we scheme on the measures to get us there\nDo you, they might look at you funny, but let them snare\nI mean, stare\nA snare is a drum\nForgive me, I'm dumb\nYo, tell them sit down in a chair\nAnd drink some rum\nAnd get them some\nCause even if they looked they wouldn't see you cause basically you're never there\nOr better yet, tell them get a beer\nOr better than that, some Everclear\nAnd shed a tear\nPay for a better year\nThe go-getters of yesteryear\nOften are not better here\nIn the present\nKool A.D.,\nKick it presently\nFor all of you to see\nLook at me\n\n[Outro: Kool A.D.]\nYes yes, and you don't stop\nYes yes, and you don't stop\nAmaze 88 on the little rap hip-hop beats that you're listening to\nYo"}]}