{"songs": [{"image": "https://images.genius.com/b7bcbd18f4df90fee8a1067f0b2b3a7b.1000x1000x1.jpg", "title": "Statement", "album": "Therapy Session", "year": "2016-04-22", "lyrics": "[Verse]\nI'm boss with it, authentic, all y'all frauds better\nQuit with the trash talk before you get tossed in it\nY'all tripping, bar ripping, y'all sipping too much, write 'till the palms dripping\nLost in it, thoughts different, you don't want no drama? Then don't get involved in it\nI'm in a whole different head space, you making money? Well that's great\nI got no interest in talking to people that I know are two-faced, too fake, get outta my face, woo!\nWhat are you doing in my lane? There's already too many rappers\nI'm sick of the traffic and I ain't got no brakes\nI already passed you, you don’t like what I’m doing, who asked you?\nYou got into music 'cause you think it’s fun, man I’m doing this 'cause I have to\nIt’s real music, chills to it, feel through it, real stupid\nSkills truest, quit moving, woo!\nIf I say something, I will do it, yeah\nI used to dream of these moments\nI'm living 'em now\nLook up to heaven like, \"Mom, are you proud?\"\nI'm on the way to New Zealand, I'm up in the clouds, dang\nI mean who woulda known this, who woulda known this\nThis industry never told me I was welcome\nI went to the house with a bat and I broke in\nThen told 'em that I would be back\nI flatline, all of your whack rhymes, that's mine\nMight get away from it, boy, MM LP—I'm the bad guy, last time\nI have been taking it easy, the game's mine, fame why?\nI don't care about none of that, I'm just sick of the trash lines\nI grew up on Eminem, now look where the game's at\nLame raps, Hollywood fame acts, I'm sick of the same trash\nI got no blunt in my mouth but give me a beat, I'ma blaze that, woo!\nGive me a beat, I'ma blaze that, you and me ain't in the same class\nYou and me ain't on the same row, music has always been my home\nI used to call up some people that won't call me back, now they blowing up my phone, woo!\nAin't it funny how that works? Mad perks, killing the record\nGot blood on my black shirt, I'm jealous in love with the music, don't ever come near her!\nI ain't from around here, how you let me run it down here?\nIf that isn't bothering none of you rappers then what are y'all doing out here?\nThat was like music to my ears, might never make it, I don't care\nDrake, I love what you doing, but call up the game and tell 'em that I'm here, yeah!\nI like that, might snap, I laugh, y'all better surrender and get out your white flags\nAnd cancel your flight plans, your career isn't taking off\nYou sound like a hype man hit you with the mic stand\nAnd they ask what the hype's about, come and find out, I mean, where is you clowns at?\nI been training, pen game is insane, I'm done playing\nThis music is ground breaking, lung shaking, done waiting\nY'all taking my patience, quit faking, y'all hating, it's crazy!\nI mean, you know what my name is, Rhyme Slayer, stop Nathan, woo!"}], "artist": "NF"}