{"songs": [{"title": "Hoe", "lyrics": "[Hook]\nYo, if she's got bare man up on that line\nIf she stays out in the clubs all night\nIf she takes dizz and the lines of the white\nIf she lets man take turns like a bike\nStop dat, drop dat, she's that hoe\nShe's on a loose ting, she can't roll\nBare man, bare guys on that phone\nMandem soak that, make that moan\nIf she's got bare man up on that line\nIf she stays out in the clubs all night\nIf she takes dizz and the lines of the white\nIf she lets man take turns like a bike\nStop dat, drop dat, she's that hoe\nShe's on a loose ting, she can't roll\nBare man, bare guys on that phone\nMandem soak that, make that moan\n\n[Verse]\nI'm like United five years ago\nOr I'm like Fernando in a red kit\nMCs wanna test this, get dead quick\nHit a man with the voltage and electric\nWeigh up the food by the metric\n120 on the M-way, Scalextric\nIf you really think you're gonna win, do a bet quick\nGot flows to make your mandem press quit\nWhy? Cuh us man are monsters\nYeah, you niggas some plonkers\nI had the strip on smash like conkers\nBait plugs free up the Zs like Bonkaz\nIf you try and flex and you're not on the radar\nNo long ting, man ah get rinsed like\nRepresent so it's not what you think\nFront mode, man are chewed, attitude stinks\nIn beef, I go in like wet play\nViolate and I'll dip man on a next day\nI don't wanna turn shit to a movie\nLike Link Up, SB or Press Play\nNo licence, that's a next case\n[?] move, that's a next case\nBuss champs, if it runs out, get a next case\nMy phone drops? Peak, next case\nPunch man straight in the chest plate\nYou'll need a doctor's and an X ray\nGo call your homeboy and SA\nNeck inna ankle something like SA\nGot fans online tryna holla man\nLike \"you're hard\" and I'm like \"ah yes mate\"\nCompliments calm and cool\nBut that's not paying for the food or the estate\nI'm tired of these broke arse grime MCs\nWho talk like they're one of the new school leaders\nYou just float in the scene like lilos\nRumble rapids and loved up beavers\nIf I catch man in his Air One beaters\nHe'll be like \"help me\", tryna run metres\nYou don't wanna get bored up and left\nOutside Rinse FM, that's not fair on Geeneus\nYeah, yo, yo\nI don't wanna start no war when I'm round\nSpray with my mates, touring around\nShanks in the basement, bores in the ground\nTunes in the ends, recording around\nBig up Capo, man had to run with his sound\nReal quick, us man the talk of the town\nLike Ice Kid, man'll get buss like rounds\nAJ, I put the A in active\nTold Ets pass me the wap and I wapped him\nMan didn't really want beef, he was acting\nHad a couple mates round me, never backed him\nGot a couple models, it's irie\nThink you can check it and wanted to come try me?\nHoes getting covered in webbing, I turn Spidey\nNiggas tryna come with the jab like man's tiny\nYou see the twinkle, twinkle\nMan better duck-duck-goose with the shank snake\nAJ, you've got a lot of violent bars\nCause I'm always around violence, yeah\nI'll buy mum trainers she won't wear\nToo much food, yeah, and I won't share\nWe were broke and the times looked better\nNow I've got a vendetta for my enemies here", "year": "2015-08-28", "album": "Complex presents #GrimeTimeWarp Vol. 1", "image": "https://images.genius.com/4f0baa512ad93e7f33619c71c0ea2832.500x500x1.jpg"}], "artist": "AJ Tracey"}