{"songs": [{"album": "Trouble Man: Heavy Is the Head", "image": "https://images.genius.com/6c270013a37f81fa5c7f0606f8824d12.300x300x1.png", "year": "2012-12-18", "title": "Can You Learn", "lyrics": "[Produced by Mr. Jonz, Jamezz Bonn, and DJ Montay]\n\n[Intro: R. Kelly]\nHey, I got a question for the ladies out there\nYeah, cause there's a few things that I would like to know\nBefore I fuck with you\n\n[Hook: R. Kelly]\nOh, baby could you learn\nCould you learn to love a trouble man?\nOh, baby could you learn\nCould you learn to love a trouble man?\n\n[Verse 1: T.I.]\nYou sure you wanna roll with me? I'm a complicated man\nLive my life close to the edge, it ain't near safe to stand\nI'm Trouble Man, always into something\nNumb to the consequences, guess it's coming if it's coming\nBut so much shit they say that I can't do because I'm famous\nGuess I should live in a bubble like these other entertainers\nThe danger's so enticing to me, I don't even notice it\nGuess I get away or get arrested before it's over with\nPrison sentenced every year, got everybody after me\nReaper on my heels, I'm just praying he don't catch a G\nImagine me and you, somewhere happy with a few hundred mills\nSill I could go to jail for some years\nCause I push it to the limit, the danger's so exciting\nI'm loving every minute, girl this life ain't nothing like it\nAnd you only live once so as long as I'm alive\nI'll be living on the edge\nShawty, sure you wanna ride?\n\n[Hook: R. Kelly]\nOh, baby could you learn\nCould you learn to love a troubled man?\nOh, baby could you learn\nCould you learn to love a troubled man?\n\n[Verse 2: T.I.]\nYeah, hey, hey and they say if the drugs ain't the death of me\nThe lifestyle will be!\nLaw keep arresting me, sucker wanna kill me\nStill we're in the fast lane, grind break, next speed\nA million dollar sports car, smoking on the best weed\nFist fights in night clubs for rap beefs\nShootings, retaliations, yeah, it's that deed!\nI guess they just got to catch me when they catch me\nCause I'm putting it in they life if they attempt to disrespect me\nEspecially since I know they say what go around come around\nThat's why when we go around I keep a gun around\nThe bullshit, there be none around here\nBut I got a secret though, I wanna change, I swear!\nBut suckers won't let me and feds still sweat me\nSo I'm looking for the worst to have you praying for the best\nThink you can help me if they get me?\nCould you handle shit for me?\nThink about it!\nIs your body shorty, answer this for me\n\n[Hook: R.Kelly]\nOh, baby (exactly)\nCould you learn?\n(Think you could learn to love a nigga like me?)\nCould you learn to love a troubled man\n(I know what I need) yeah! (and it's worth it, you know)\nYeah, yeah, baby could you love?\n(Just think about it for a second)\nCould you learn to love a troubled man, yeah?\n(I mean could you find me near?)\nI deserve you!\n\nGirl, would you give me a number?\nIf I had an OK car, not much money\n9 to 5 with a future on me, oh\nTell me, would you ever fuck with a brother like me?\n(If I did time in my life, time, time in my life\nTime, time in my life)\nTell me, would you give your sex to me?\nI really want to know\n(If I was fighting in the club, fighting in the club\nFight, fighting in the club, fighting in the club)\nHey lady,could you learn\nLearn to love a troubled man?\n\n[Outro: T.I]\nHey, hey, hey baby\nCould you learn (tell me could you learn?)\nCould you learn to love a troubled man?\n(I mean if you knew he was really\nReally a good-hearted person, man\nDo you think you could put up the bullshit to the outside, man?\nI mean if you saw the good qualities within, man\nCould you, could you ignore all the bullshit that they are saying?\nI'm a product of my environment\nI can only act as good as life allows me to act\nYou know what I'm saying so\nWhat I need is a good influence like you\nYou know what I'm saying?\nThink you can find me, Lord?"}], "artist": "T.I."}