{"artist": "Pacewon", "songs": [{"album": "Won", "title": "It’s Yours", "image": "https://images.genius.com/51988e399d7fd0c27dc7bf9671e91b51.600x600x1.jpg", "lyrics": "[Pace] Yo, huh? .. What?\n[Jean] It's your/it's your/it's your - it's yours!\n\n[Pacewon]\nYou have now entered the realm of the Pacewon zone\nWhere the rudebwoys rule and the pussies run home\nOr the shots that ring out, or the ass I done beat\nNiggas don't wanna bring out the bad side of me\nI rolled on your set, you poets need practice\nMC's like rugs; I walk on these rappers\nHuh - heads or tails, I flip pennies\nUptown buyin hydro with counterfeit twenties\nSoldier, take control of\nYour body and your mind like yoga, play you like poker\nBlack like Roker; cops press charges\nBut my lawyer get me over - more blunts to roll up\n\n[Hook: Wyclef Jean]\nThe streets ain't safe at night (it ain't safe)\nThe gangs come out at night (they come out)\nStick-up kids get robbed tonight (you get robbed)\nThe innocent get raped at night (innocent get raped)\nEven on Halloween; when the fiends\nCome out with paper bags and tight jeans\nAskin for credit? You can forget it!\nNorth, South, East, West! ... Yo, put 'em up, put 'em up, put 'em up\nIt's your/it's your/it's your - it's yours!\n\n[Pacewon]\nPacewon in a rush ta, bust off loads\nReally with drugs, sendin +Thugs+ to the \"Crossroads\"\nGoin to war with my four-fifth and more clips\nThan the ghetto got poor kids, welfare and orphans\nTop seeded; pissed like a boxer\nWhen his nose start bleedin, movin on heathens\nLockin up BM's - me Zee and Ra three\nImmortal rap beings, don't catch feelings\nMr. Perfect, cause a disturbance\nLike the Rodney King verdict\nViolent like your father when he drunk off bourbon\nMoney sex and burners\nBefore you walk the streets make sure you got insurance\n\n[Hook]\n\n[Pacewon]\nHey-a, praise-the, Pa-cer\nI-got, fatter bags of raps than your local 2-for-5 spot\nWanna bust me but can't cause you Krusty\nLike a clown from the Simpsons..\nKids like you go up in flames like instant, better stay distant\nCash your chips in, or die like Richard Nixon\nDeep don't sleep as much as I need to\nPacewon I stick to my guns like M.O.P. do\nRap ciphers, graffiti, lighters\nFeel the packed pistols, love the Outsidaz\nThe streets is on fire, rawness, flawless\nKickin chumps dead in the chest like Chuck Norris\nShoot at the beast, Crooked I to East Orange\nWe ready to rock, my block the hardcorest\nMoney and sex, drugs you better learn this\nBefore you walk the streets make sure you got insurance\n\n[Hook]\n\n[Wyclef] It's yours!\nIt's your/it's your/it's your - it's yours!\n[Wyclef] It's yours!\nIt's your/it's your/it's your - it's yours!\n[Wyclef] It's yours!\nIt's your/it's your/it's your - it's yours!\n\n[Hook] - to fade", "year": null}]}