{"songs": [{"album": "The FREEbeehive Mixtapes", "image": "https://images.genius.com/8b3166989f7c5557bb3c0ed4b38efe8a.350x350x1.jpg", "year": null, "title": "For the Kids", "lyrics": "[Verse 1 : Tablo]\nLife is a mystery in all shapes, sizes and angles\nFrom crop circles to Bermuda triangles\nThe fate of the world is shaky like bike handles\nIn the final hour, even some demons die angels\nWhat's true is true isn't what you think it is\nWhen the real world is a bad dream like incubus\nTriple X, triple Z, it's the same damn thing\nYou get fucked if your eyes are closed when the alarm rings\n\n[Verse 2 : MYK]\nSing, passin' the mic back and forth, forth and back\nBroke emcees, choke emcees who can't afford to rap\nOr choose to stay hungry, imma stay hungry\nFree-fall, bounce back like it was a bungee\nI snap back like a slingshot\nBring hotness, yes, no stress cleanin' up this mess\nIn this hiphop-ness I found my niche\nLet that b**ch breathe\n\n[Hook]\nRemember rap when it used to be fun as hell?\nRemember rap like it was with Big Pun and L?\nRemember rap when it used to be fun as hell?\nRemember rap like it was with Big Pun and L?\nRemember rap when it used to be fun as hell?\nRemember rap like it was with Big Pun and L?\nRemember rap when it used to be fun as hell?\nRemember rap like it was with Big Pun and L?\n\n[Verse 3 : Tablo]\nWho cares about East or West or the dirty South\nWhen you've got no diamonds in your dirty mouth?\nIt's a burning house, hip hop goin' poof\nNo wonder everybody wants to raise the roof\nI see proof everyday that seekin' heaven is bleak\nI see proof everyday like Eminem in his sleep\nThe devil is deep water, kid, and nobody is stoppin' ya\nSlip a toe in, in you go like slavia\n\n[Verse 4 : MYK]\nSilly rap sessions, thoughtless wordplay\nHip hop nerds stay poem sketchin'\nA coloring book for the philosophers\nI lost a verse, and this is its half-assed rendition\nI spit rhymes just to pass the time\nAnd if life is just a brainstorm, then I'm a mastermind\nAlways last in line, cause I don't care enough\nBut when my time comes, best believe that I tear shit up\n\n[Hook]\nThis is for you kids who don't wanna be a businessman\nThis is for you kids who don't have a damn business plan\nThis is for you kids who don't wanna be a businessman\nThis is for you kids who don't have a damn business plan\n\n[Verse 5 : MYK]\nLet me see two in the sky, guy, one for the living\nStay fly, high, one for the music in 'I'\nTwo for the good life\nKeep the champagne sittin' in the freezer\nOn the block of that cool ice\nStay nice, eskimo cool flow\nI say why you gotta be testin' a dude yo?\nStop guessin' at clues, you'll be destined to lose\nYeah we fresh when we move and we blessed in the booth"}], "artist": "Tablo"}