{"artist": "King Los", "songs": [{"image": "https://images.genius.com/4d9c32a9b90541ce4c0c3d143d56f7c9.1000x1000x1.jpg", "title": "Calm Dat", "year": "2017-12-25", "album": "Moor Bars", "lyrics": "[Hook]\nCalm that--calm that--calm that shit down, boy!\nI do this just for kicks now, boy!\nYou out here sounding like a bitch now, boy!\nWho you playing with? I’m rich now, boy!\nI’m the king watch them bow down, boy!\nI send the world to the town now, boy!\nI got no time to be playing with you, boy!\nYou think you’re fucking with me? I’m like, boy!\n\n[Verse 1]\nOkay, I got rap in a headlock\nLike a head-wrap on dreadlocks\nMy bars tend to be perfect tens\nYour bars tend to be Red Sox\nAll that probably went over your head\nLike Vince Carter dunking on a nigga in the paint\nLike putting paint on a dunk like Blake Griffin\nLike y’all niggas nice but this is way different, like\nAbracadabra you rappers gonna disappear\nLike rabbits in a hat, now these rappers they just appear\nThis type of magic will get you scared\nSaying I ain’t got it no more, like nigga where?\nYou’ll get that magic shit and not got it no more shit\nSometime next year like y’all got an award shit\nY’all gotta know bull-shit when you hear it though\nJust like you gotta feel God when you near it though\nYou don’t put down like me\nYou sound like a nigga that sound like me\nYou don’t rock the crown like me\nYou ain't the melanated felon meditating and elevating from the ground like me\nYou ain’t really cool, y’all niggas follow too many rules\nY’all niggas ‘bout to make me buy yellow cheese bus\nJust to school y’all niggas, lil boy!\n\n[Hook]\nCalm that--calm that--calm that shit down, boy!\nI do this just for kicks now, boy!\nYou out here sounding like a bitch now, boy!\nWho you playing with? I’m rich now, boy!\nI’m the king watch them bow down, boy!\nI send the world to the town now, boy!\nI got no time to be playing with you, boy!\nYou think you’re fucking with me? I’m like, boy!\n\n[Verse 2]\nUgh, if I’m offended, no defensive option\nDon’t land in my yard with all that fence hopping\nNiggas been watching with pads and pen jottin'\nI’m nice off the brain with this shit like Ben Carson\nBut nigga…..(fuck Ben Carson, coon-ass nigga)\nI know that you niggas get intimidated\nI know how you niggas get intimidated\nI can imagine how you niggas might just get intimidated\nI can imagine how you niggas might get intimidated\nI can imagine how you niggas might get intimidated\nI can imagine how you niggas might get intimidated\nI can imagine how you niggas might get intimidated\n(Yeah, that's the one right there)\nAll you niggas get eliminated\nAll you niggas get eliminated\nAll you niggas get eliminated\nSweet as lemonade I made it\nSweet as lemonade as made in a minute time\n...\nHold up I got it\nAll you niggas get eliminated\nSweet as lemonade and got made in a minutes time\nSo is that minute made? I made this in a minute\nMany men gon’ get played, I ain’t in my prime\nGet rich or die trying is a lot of shit you spit I’m not buying\nAnd I ain’t fully generated\nI can imagine how you niggas might get intimidated\nI’m in a vacant place that don't even exist\nI innovated, all you niggas how the fuck do you persist\nHow the fuck do you exist? We should knuckle up with fist\nYou may weather the storm but you ain’t punching like this I know\nYour favorite rapper is my favorite too\nThat nigga practice all my favorite moves\nI’m dancing in the booth I think I’m cool\nI’m smart and handsome yeah I think I’m smooth\nI don’t listen to your raps or your interviews\nTake Whoopi Goldberg and Jimmy Iovine\nYou ain’t even Interscope for being in my View\nAnd for the record, I’ve been in my groove\nI’ve been on tracks since Cd’s was cool\nYou a leech nigga, don’t bleed the culture\nDon’t think I don’t see, I don’t feed the vultures\nYou don't want me on that ass you know better\nYou sweat Los like yeah you used to sweat Lo sweaters\nYou chase down bitches that a nigga would duck\nAnd give 'em your bucks and say the most ridiculous stuff\nAnd give raps you're like\n[Reverse] I don't chase pussy, pussy chase\nShut the fuck up, pussy 'fore we chase you\nMake you exposed to the world, that you don't live that shit that you writing\nYou a pussy and you like pussy, mm nigga you diking\nI'm the most diabolical down to the hair, follicle\nRare, molecule, incomparable model\nTearing flesh off a hollow point, you point at me I follow you\nYou follow my point, I body you\nThen make you momma point at the body too\nIdentify you, so how do you\nIdentify with yourself, if I was you\nI would be me, but I'm me and you're not you\nIf I see me and you meeting in the future\nAnd I see you in me, nigga I'ma shoot ya\n'Cause I, kill myself with this rhetoric\nThis the kind of shit I know you motherfuckers never get\nTell your ghostwriters they should tighten up\nYour last year wasn't mmm quite nice enough\nI make 'em turn up the volume\nBitch, this ain't even my album\nYou rappers been taking Big L's\nI see where you get your style from\nPardon my Pun, but these MC-s know that they better run\nYou diggin' me bro-bro, no Diggy, no JoJo\nBut I run this house and you niggas my sons, bitch, I'm the one\nNot the two, wonder what Biggie and Pac would do\nI'm stuck in this era and bitch I'm embarrassed, I do a song with them and not, with you\nI'm glad everybody is learning I'm not mad\nI woke up and kiss my son on the cheek and I'm not sad\nI been studying the last four years about the science\nI been non-religious, anti-church and non-compliant\nBefore niggas even applied it, niggas even decided\nThat we was giants and got invaded by all these pirates\nI do not subscribe to the doctrines they jotted\nI do not comply if a doctor prescribe it\nWrong one to mess with, I'm way to invested\nI do not ingest it if it is a hybrid\nCows are hybrids, pigs are hybrids, wheat is hybrids\nDamn near everything you eat is hybrids\nBroccoli is hybrids, don't be embarrassed\nCarrots hybrids, everytime you eat meat\nThere is parasites inside it\nHow could you compare our sight, you need a pair of sights to sight it\nI don't wanna hear I'm riding a nigga wave\nI kill that nigga dead and climb in that nigga grave\nTo finish the conversation, administer complication\nYour ministers complicated, he's killing the congregation\nT.D. fakes got Creflo Dollar desires\nHe never gon' save the people, he's lying about the Messiah\nMost ya'll scared of the Son, because they tell a motherfucker that they gon' burn in an eternal fire\nIt’s fire inside you, It’s fire inside your heart\nWhen you want something, apply the fire and spark\nIn the beginning when God created light, that mean he had to bring the fire out of the dark\nSo when you're in the dark just know that's where it come from\nYou are you and that is nothing to run from\nAnd bitch I got something, for anybody that want some\nLove all y'all lil' niggas man you my son sons\nBlack man God cause the black woman God first\nWhen you break down hue man that's a dark earth\nNow look at the portal from what y'all birthed\nAnd why is she the one that y'all cursed\n'Cause y'all niggas so selfish\nEverybody love momma but won't nobody help her\nMy bad couldn't help it, I just said it 'cause I felt it\nTell the preacher he can put this in his fucking book and sell it\nI guess I started something now\nI'm coming for you niggas now\nDon’t Christ think that shit to get you destroyed?\nI don't use a pen got them niggas like , boy!\n\n[Hook]\nCalm that--calm that--calm that shit down, boy!\nI do this just for keeps now, boy!\nYou out here sounding like a bitch now, boy!\nWho you playing with? I’m rich now, boy!\nI’m the king watch them bow down, boy!\nI send the world to the town now, boy!\nI got no time to be playing with you, boy!\nYou think you’re fucking with me? I’m like, boy!"}]}