{"artist": "A$AP Rocky", "songs": [{"title": "Gunz N Butter", "image": "https://images.genius.com/4876a6b7156bddc938b7378720ad2502.440x440x1.jpg", "album": "TESTING", "lyrics": "[Intro: A$AP Rocky]\nSwingin' burning tires leave a third degree\nAnd I heard there's bouncin' niggas hatin' wanna murder me\nThey gon' have to take me straight to Satan 'cause I'm blessin' this\nI feel distressed, then feel no stress, I built this trust\nThey won't come murder me, Hercules\n\n[Verse 1: A$AP Rocky & Juicy J]\nMama warned me pop was on me as a shorty\n(Shut the fuck up!)\nGet-gettin' guap before when I was fourteen\nGlock was forty kick-kick\nBox ya jaw for plottin' on me hot bologna grits with\nProblems copper hoppin' on me cheese from government-ment (What that mean?)\nPrada on me, choppers on me, croc' on Mauri kicks-kicks (Word)\nGod was for me, locks was on me\nBlew up ever since then (Okay, okay)\nGrew up ever since then, screwed up ever since then\nTwo cups ever since then (Kill 'em Flacko)\nNah, big homie, took my time but now, big homie\nHomies outta line, big homie\nMoney outta pocket, homie, all these niggas pockets, homie\nChopper let 'em live, I was only six, when I crept up in the crib\nFound a Sig, what I did, what I did\nCock it homie, now it's in my p-pocket homie\nI-I got r-rocket on me, dare you nigga, tr-try me, homie\nFor the love of spread, Mommas butter bread\nMan, I prolly should be dead, was it 'cause of what I said?\nWhat I-\n\n[Bridge: A$AP Rocky & Project Pat]\nDesi, FN, Ruger, Draco\nEuros, pounds and dollars, pesos\nMoney, hoes and power, Draco\nViolence, rifle, shotguns, Draco\n\"Now can't a nigga see I ain't got no time for games\nI'm on this Hennessey and I'm quick to shoot dat thang\nBut fuck dat, one of my young niggas'll take the charge\nI'm stackin' loot, muthafuck lookin' behind some bars\"\n\n[Interlude: Hector Delgado]\nRocky, Rocky\nHold on, one second, bro\nHa, Rocky, it's Hector, bro\nRocky this is Hector, bro\nWe gotta hold on, one second, bro\nThere's an issue goin' on back here\n\n[Verse 2: A$AP Rocky]\nGrandma was a Catholic, and mama was a Christian (Woo)\nMy papa turned to Muslim when he spent some time in prison \n(No cappin')\nNo Jehovah Witnesses where I'm from, kinda different (Woo)\nThey don't leave no witnesses so folks just mind they business\nThese days I just practice all the good from all religion\nSo plead the fifth amendment or you're gonna be the victim\nSo get up off my YKK, the President a a-hole (Fuck off)\nPrayin' for a JFK, all we got was KKK\nAKA AK that you target\nNot from Target but from Walmart, then it's a-ok\nFuck them boys no KY with this SK leave them DOA\nAR in the ER it's the state of mind of every state\nSay your grace you better pray\nGuns with the butter, guns for my brother\nCame from the gutter, cocaine in the buttocks\nRazor box cutter, blade under gumma\nGang in the Hummer, skate wit' your mother\n\n[Refrain: Project Pat]\nThe fact of the matter she blow out the frizzame\nI keep me some powder so I'm gettin' brizzain\nThe fact of the matter she blow out the frizzame\nI keep me some powder so I'm gettin' brizzain\nThe fact of the matter she blow out the frizzame\nI keep me some powder so I'm gettin' brizzain\nThe fact of the matter she blow out the frizzame\nI keep me some powder so I'm gettin' brizzain\n\n[Outro: Juicy J]\nWhat's really butter?\nThe gun or the butter?\nYou hear me?\nYou understand what I'm sayin'?\nWhat's really butter?\nWhat's really butter?\nWhat's really butter?\nGuns, you can get that butter all day", "year": "2018-05-25"}]}