{"artist": "Cam’ron", "songs": [{"title": "1st of The Month", "album": null, "year": null, "image": "https://images.genius.com/83958b1224d915f25d5975f15a39c0ef.420x420x1.png", "lyrics": "[Verse 1 - Jim Jones]\nAyo my Dip Set Taliban, we are not a crew\nWe're more like a movement, more like in tune with\nThe moon and the stars\nSome say I'll soon be doomed for them bars\nBut I could be caught - pissy clubs\nSaloons and some bars\nIndustry think that they grooming a star - nah\nI'm more like a thug misproving the odds\nRun around my city all crazy\nWith my goons in some cars\n\n[Bridge - Cam'ron]\nI tell 'em\nWake up, wake up\nGotta go get that cake up, break up\nDivide that payroll, ayo\nGo get that yayo, yayo\nKilla, paper, holla at Pedro\nOn the 8-0 and wait for my son, the lay low\nBa' bro\n\n[Cam'ron]\nWhen I beef, names will be said, tool will be spread\nTwo in your head, body be bagged, eulogy read\nDog in the news will get read\nCause what I deal with is usually feds\nOn the first\n\n[Hook]\nAyo, ayo, ayo, ayo\nIt's the first of the month\nYayo yayo! Yayo yayo!\nIt's the first of the month\n\n[Verse 2 - Juelz Santana]\nNow I'm the type of dude\nPost up, sell drugs on your property\nStone cold hustler, ain't no fucking denying me\nI sell drugs in varieties: You want it? I got it\nYou see it, you like it\nWe count it, you buy it from me\nI'm what the people call a \"menace to the public society\"\nFuck 'em I'm riding, my gun on the side of me\nFuck it, I'm driving, I'm puffing, high as can be\nI'm speeding, I'm weaving\nI'm bugging, my eye on the street\nCam signed to the Roc, it's time that we eat\nHarlem's back, this time it's for keeps\nYou rolling or not?\nThe Takeover's now, y'all focused or not?\nWe been ready it's just that our promotion was not\nBut I can't blame no one for this, I'm all right with that\nCan't be racist cause I sell too much white for that\nSo I decided I'mma milk these crackers\nFor all their milk and crackers\nUntil I'm rich and these mills don't matter\nYou niggas follow my plot?\nIf not, swallow these shots, Santana swallow your block\nI run with enforcers, big dudes and bosses\nBlack, British and Walter, the phone call will cost ya'\nKeep rolling in them caravans acting\nWe got big trucks with chrome Taliban action\nSend one up to Jabar, my nigga maxed in\nT-Money's home and he's never going back in\n\n[Hook]\n\n[Verse 3 - Cam'ron]\nAiyo, I swear to God, you think I had a violin the way I fiddle triggers\nHow you older than me and still a little nigga?\nOn the first, I hate these chickens\nGet their check, hair, nails done\nSteak and chicken for the fridge\nAnd their kids fly.. I ain't open, friend\nOn the 11th, you gonna be broke again\nWord to Jehova man, hoes in they shoes\nBarking like a Doberman\nComing to see Cam for some coke again\n\n[Jim Jones]\nShit, it's the first of the month\nYo, I'm the first on the block for the cycle\nA rock that is first like shoots from a rifle\nSee they tainted our image\nIt's fucked up how the game painted our image\nThey say we dangerous people\nWhy? Because we sell caine to the people\nThat don't be the reason I be aiming this eagle, my aims to get equal\nThe first and fifteenth's got some restraints on my people"}]}