{"songs": [{"image": "https://images.genius.com/69cf4c78ad6de640a15b236339d3d879.599x604x1.jpg", "title": "Juice Back (Remix)", "album": "Price City", "year": "2015-11-20", "lyrics": "[Pre-hook: Nasty C & Davido]\nMan man man you should hate yourself (I see ya)\nLook into a mirror, nigga rate yourself (I see me)\nLook at the shit that we doing\nMotivate yourself (One hunnid)\nBrace yourself\n\n[Hook: Nasty C & Davido]\nI done got my motherfucking juice back\nI done got my motherfucking juice back\nI got my juice, I done got my juice back\nI done got my motherfucking juice back\nMotherfucking juice, juice, juice, juice, juice, juice, juice\n(Okay juice)\n\n[Verse 1: Davido]\nHey where my juice at?\nWhen I got robbed where were you at?\nGun cocked to my face like \"Where my jewels at?\"\nMade a couple calls and got my juice back\nYes I got the, yes I got the juice like woah\nLooking for a young mamacita\nThat gon' make that booty move like woah\nBad bitch in designer, yeah she Gucci head to toe\nI hit it once again now she don't wanna let me go\nAnd she already know\nSay, I got the juice, got the juice\nI'll make it juicy for you\nYes you can come with a friend (Nigga)\nI'll make it juicy for two (Nigga)\nMe no give no attention to no hater\nNigga you less and I'm greater\nI’m on time and you late\nNasty C you made it\n\n[Pre-hook: Nasty C & Davido]\nMan man man you should hate yourself (I see ya)\nLook into a mirror, nigga rate yourself\nLook at the shit that we doing\nMotivate yourself (One hunnid)\nBrace yourself\n\n[Hook: Nasty C & Davido]\nI done got my motherfucking juice back\nI done got my motherfucking juice back\nI got my juice, I done got my juice back\nI done got my motherfucking juice back\nMotherfucking juice, juice, juice, juice, juice, juice, juice\n(Okay juice)\n\n[Verse 2: Cassper Nyovest]\nAllow me to reintroduce myself my name is-\nFuck that, I ain't got tell you what my name is\nBy now you motherfuckers should know me\nI did so much with my career that\nEven my peers treat me like an OG\nAnd the OG's throw me subtweets\nI just laugh at it cause trust me\nI'm like Bieber now, you can't touch me\nYou wanted relevance?\nYou should've asked me\nIsn't this the greatest story that you ever seen?\nDammit!\nDid you ever ever think you could see\nA SA rapper who could buy a Lamborghini?\nDammit!\nAnd ever come from Mafikeng?\nAll I ever needed was a canvas\nA couple gold bottles and a bad bitch\nThey can't stand it but how the hell I ain't gon rap about money?\nWhen I'm rapping bout my life, and it so happens that I am rich (Whoo!)\nI mean these niggas were hella distant (Were hella distant)\nUntil they heard that MTN gave me 7 figures (Ay, ay)\nNow I'm stunting at the backseat of a Rolls Royce like \"Hello Kitty\"\nO ba botse ka ntwana ya kasi\nMy crib is always full I brought the ghetto with me\nAnd this shit ain't never gon change\nThese niggas forever gon hate, cause I'm telecom paid\nLadies love me but the fellas gon hate\nHao ka sheba fela kom kyk\nKe ba tshela bombay\nThey say I don't spit so I won't quit\nI'm in my zone kid, I'm so focused\nI made millions but I want more bitch\nAnd I'mma stay filling up the dome\n'Til you niggas bow, bow, bow\n\n[Verse 3: Nasty C]\nBow down to Davido and bow down to Cassper\nHeard em say stars are aligned\nBut they both had their time\nAnd you know that I'm tryna surpass 'em\nFred Merc told me your favorite rappers have heard of me\nBut a lot of these niggas won't get a verse from me\nI feel bad for being the one to school these niggas\nWhen my friends are tryna get in a university\nBut still I made 'em fall like the fees did\nFeeling like I'm talking to my daughters and nieces\nOne of my industry niggas called me this evening\nTold me keep my head above the water and breathe in\nHe wasn't too happy bout who I got on the remix\nBut he was on the remix before he got on the remix\nHe replied to the emails before I got on the frequencies\nSo I plotted the pieces before he had all the enemies\nMan, I need a lot of head again\nMy mind's getting heavy even I wasn't ready\nMan my come-up was a run up\nLook at all things I did\nIt started with a mixtape that I dropped in February\nAnd I'm too scared to even tell you what's next\nI'm handpicking women out the general section\nBut I don't save them, no ain't got no S on my chest\nI got a triple styrofoam with a medical mess\nAll my enemies are amateurs\nMy role model broke his character\nAnd all my exes wrote me letters bruh\nAnd I was chilling with Scoop the other day\nIf you knew what he had to say about you, you wouldn't be rapping bruh\nDavido gon have to take this back to Naija for me\nDon't have to tell you why your favorite rapper's hiding from me\nI keep the weed stashed in a different kind of luggage\nAnd tell my guy to tip the pilot for me, I got the juice\n\n[Hook: Nasty C]\nI done got my motherfucking juice back\nI done got my motherfucking juice back\nI got my juice, I done got my juice back\nI done got my motherfucking juice back\nMotherfucking juice, juice, juice, juice, juice, juice, juice\n(Okay juice)"}], "artist": "Nasty C"}