{"artist": "IDK", "songs": [{"title": "No Shoes On the Rug, Leave Them At the Door", "lyrics": "[Intro]\n(You have 10 minutes remaining on this call)\nYou, know, no evil, no flaws, your evil on pause\nMy evil don't go, go, go\nI, leave, my shoes at the door, no mud on the floor\nUnless my mama ain't home, home, home\nI, clean, after myself when I flaw, I leave no messes at all\nI hope she don't leave her keys on the shelf\nAnd come back to see the mess on her floor\nAnd see my shoes on her rug\nWhen they should be at the door, door, door\n\n[Verse 1]\nI was supposed to be a doctor or somethin'\nHonor roll like my auntie and cousins\nBut instead, I was a robber or somethin'\n'Til they caught me red handed like my arm in the oven\n\"Goddamn Jay, do you do anything right?\"\n\"Goddamn Jay, you could barely read or write\"\n\"Goddamn Jay, you never ever get good grades\"\n\"Goddamn Jay, you could barely pass fifth grade\"\nThat's what my momma would say\nAnd it would eat at my mind, I used to think all the time\n\"If I could be a good boy, she'd probably love me a lot\"\nThe only time I felt loved was when I went down the block\nAcross the street from the house, just down the street from the shop\nThat's where the bad boys hung, your momma said don't go\nBut I would go anyway, that's where I felt at home (felt home, felt home, felt home)\n(5 minutes remaining)\n\n[Chorus]\nNo wonder my life went down, down, down\nDown, down, down, down\nDown, down, down, down, down, down\nNo wonder my life went down, down, down\nDown, down, down, down\nDown, down, down, down, down, down, down\n\n[Bridge]\nDid you go around the block by the shop? (No)\nWas that you with the boys throwing rocks? (No)\nWas that your friend on the news that I saw? (No)\nWas that your name spray painted on the wall? (No)\nDid you go around the block by the shop? (No)\nWas that you with the boys throwing rocks? (No)\nWas that your friend on the news that I saw? (No)\nWas that your name spray painted on the wall? (No)\n\n[Verse 2]\n(One minute remaining)\nWe gettin' it and we gon' make it\nAnd they gon' hate it and I'm his favorite\nI can't deny it, I'm a straight rider\nBut when we get together be electric slidin', grandma\nBumping in my headphones\nOn the way to school on a school bus\nWhere the cool ones, usually the \"act a fool\" ones\nAnd the new ones, usually the ones they pick on\nThat was me, the whole class used to laugh at me\nThey use to say \"get away from Jay, he an African\nAnd everybody knows that them Africans stink\"\nA booty scratcher that never scratched on my ass differently\nThan a regular human with itchy cheeks\nGot me like \"fuck this elementary\nAnd if I had a knife, I'd probably cut this elementary\nMy grades been fucked since the first grade\nAnd that ain't 'bout to change so your honor roll will never mention me\nAnd momma ain't never gon' love me\"\nThe reason why she come home after work and never hug me\nThat's the shit that'll make your life feel forever ugly\nSo I covered up my face with this ski mask\nBet the hoes gon' love me with my ski mask\nBut when my ass got caught, everybody went ghost\nBut the one that I used to think hated me the most\nI love you momma\n\n[Bridge 2]\n(30 seconds remaining)\nDid you need a couple dollars on your books? (Yeah)\nDo you have enough covers on your bunk? (Yeah)\nDo your cell mates give you any problems?\nIf they do, what's the jailhouse number? I'ma call 'em (no)\nDo you understand what I was tryna say? (Yeah)\nOh now you understand what I was tryna say (yeah)\nBut even though you make me mad and never listen\nYou my baby and I'm still gon lo-\n\n[Outro]\n(This call has ended, goodbye.)", "image": "https://images.genius.com/362b37d757b597e3bf2bce15e7e93eef.630x630x1.jpg", "album": "IWASVERYBAD", "year": "2017-10-13"}]}