{"artist": "WC", "songs": [{"year": null, "lyrics": "(Talking)\nHere's a story\nAbout a bitch\nAbout a bitch I once fucked wit\nNow I want ya'll to listen real close\nShit's a trip\nPeep game\n\nUsed to have a bitch that was true to life to me\nDamn near a wife to me\nThe bitch was just right for me\nStood by my side\nUsed to help me wit my hustle\nDown to pack straps and a cap if we had a tustle\nI used to trust her wit my riches\nI be in the kitchen cookin chickens\nWhile she be washin dishes\n150,000 in the attic\nPager blowin up all night, my bitch never gave a nigga static\nI used to make her mad enough to kill\nLipstick on the front of my draws, man my bitch was real\nCuz she never stole nothin\nGaffled by the FED's 3 4 times and never told nothin\nBut wait\nMy bitch is gettin distant on me\nNo more back rubs and kisses\nWhat's happenin wit my little misses\nToo sleepy for the sex play\nNow what's really going on the same shit the next day\nDamn I know she wouldn't fuck around\nStill I taps all my phones and records every fuckin sound\nConversations wit her homegirl but nothin major\nI duplicates the cap code to her pager\nNow I recieves every beat\nCuz I'll be damned if my bitch goin be playin me cheap\n\n(Chorus)\nCall it what you want but I gotta know\nIf my bitch fucks around then my bitch gots to go (Repeat 2x)\n\nWeek and a half flies by and now I\nCan't trust my bitch doin shit\nTrack her through the mall, the cleaners, and the nail shop\nThe grocery store, and the health food spot\nDub you trippin I say to myself\n'Is she all that?\nI'm on my bitch ass like I'm lo jack'\nJust hold that\nI don't really like when she be callin her best friend\nPull up on the lot in a black Benz\nI could smell it homie\nIt's goin down\nThese bitches bout to flirt wit some niggas and clown\nFollowed they ass to the Mo-Mo\nOh no\nDamn this shit's for real\nNow just imagine how a nigga feal\nCuz I been livin wit a ho\nAnd worse than that a muthafucka didn't know\nShe got's to go\nI hit the chronic cuz\nI'm on a mission\nI'm havin visions\nOf two dead bitches missin Christmas\nI can't take it no more\nI cocks my strap ?takes flight?\nAnd kick the fuckin hinges off the door\nI skimmed the room with the infared\nAnd finds my bitch and her best friend naked in the water bed\n\n(Chorus)\n\nNow I'm confused\nI puts my heat down\nMouth open like a muthafucka takes a seat now (?we's now?)\nHow long you been fuckin her?\nI ain't know yo ass was on cock\nGot me thinkin bout ? ?\nShe said I trust her like you trust me\nIf you trust we\nThen us three could be livin in harmony\nI get's to thinkin bout the pussy and the riches\nFuck it I guess I got two down bitches\n\n(Chorus)\n\n(Talking)\nHa yeah\nTell ya about these little stank ass scrags\nAin't shit\nI got two of em now\nFuck em\nOne for this braid right here\nOne for this braid right here\nGotta lick this middle one\nFuck ya'll\nWC CJ Mac", "image": "https://images.genius.com/e3cb3b767a7c4236e1df057692fb01b0.402x400x1.jpg", "album": "The Shadiest One", "title": "Call It What You Want"}]}