{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/ac60efef8cca00a893f65b5ddd7347d1.640x640x1.jpg", "title": "I’m Guilty", "year": null, "album": "It’s Pronounced “Five Two”", "lyrics": "INTRO:\nAll rise. Case number seven-seven-seven-five-two\nDefendant KJ-52 verses the Son of God in murder one\nHow do you plead?\nGuilty as charged\nDo you promise to tell the truth, the whole truth, and nothing but the truth?\nI do\nThen go ahead\n\nVERSE 1:\nI solemnly swear to tell the truth, the whole truth, and nothing but the truth now, so help me God\nWhat I testify and what I'm speaking of is an eye witness account of an experience of a kindof love\nI confess now to what it was\nI was guilty of making the very Son of God now shed His blood, and\nI was guilty of the reason now why He was hung, and\nI'm guilty for every evil thing not that I have done\nI'm guilty for it all, I can't blame no one\nI'm filthy with what caused the death of the Son\nIt kills me to think I was the one who shed His blood\nI still think of the way He died now and how it was\nIt feels me with pain inside, I feel like throwing up\nI can't escape, I can't lie, I didn't make it up\nI was the one who took the life of the Holy One\nThis is the first time I've confessed now to what I've done\n\nCHORUS 1:\nI'm guilty, guilty\nThat's right, I'm guilty\nGod forgive me, I'm guilty\nYou know what? I'm guilty!\n\nVERSE 2:\nYeah that's right, I did it\nRight out in the open for all to see it, and\nI never hid it, I got to admit it\nThey took the whip, ripped His back wide open and split it\nI heard Him cry every time they pulled it back and hit it\nI wondered why He was silent now, I didn't get it\nI watched Him die while He cried out \"It is finished\"\nThought nobody would find out about the the crime I've committed\nI tried to hide out, it's too late, that's right I did this\nIt's my time now, my own eyes have been a witness to my crime\nNow I'm speechless and I'm defenseless\nCan anybody find out it's obvious that this is my final time\nNow I've finally come to my senses\nI'm a climb down and take whatever I'm sentenced\nI know why there's no way now that I could miss this\nI opened my eyes, now I see Him just for who He is\nThis my guilt is mine now, it's so obvious that...\n\nCHORUS 2:\nI'm guilty\nGod forgive me, I'm guilty!\nI'm guilty\nThat's right, I'm guilty\nSo help me\n\nVERSE 3:\nI'm just another person, I'm just another man\nI was the one that hurt Him, I finally understand\nNow I know that for certain I caused the nails to land\nThat left Him dead and murdered, pierced in feet and hands\nSo now you've heard it, I testified and took the stand\nNo other way I could word it, this is my confession and\nI never lied or purgured, I told just the best I can but\nI was the one that cursed Him, I was the trigger man\nThe page is turning and I've now just confessed to this\nI didn't kill Christ, but it was just my sin that did\nNow I've confessed to the crime, I don't deserve to live\nI'm ready to do my time. All that I can say is...\n\nCHORUS 3:\nI'm guilty\nGod forgive me, I'm guilty!\nI don't deserve to live, I'm guilty!\nTake me away, I'm guilty\nI'm guilty!\n\nOUTRO:\nCase number seven-seven-seven-five-two\nKJ-52 verses the Son of God in murder one\nThe court has found you guilty as charged\nHowever, after further review of the case\nThe prosecution has dropped the charges\nYou're free to go"}]}