{"artist": "A$ton Matthews", "songs": [{"title": "Phantom of the Opera", "image": "https://images.genius.com/52f4ae5fcc91fe43baf5c62eb7522720.500x500x1.jpg", "album": "Chapovelli", "lyrics": "[Chorus x2]\nLiver of the chop, to living el chapo\nPullin up in, the Phantom of the Opera\nWhite on white, coca cocaine\nAll up in su casa, the Phantom of the Opera\n\n[1st Verse]\nBoy where you been? Who you been around?\nYeah - cause all that talkin' nigga get around\nYeah - talkin' tough until I turn em down\nChin checking eyes across the floor when you see me now\nWhat's the difference between me and you?\nWell - got the killers, got the bitches too\nWell - it's some niggas that's some bitches too\nWell - got they bitches fuckin' bitches too\nWell - Yeah - I guess I'm pimpin' on the low huh\nIf she bend it over better get it off the floor huh\nI make her split it wit my woes huh\nStickin' to the code huh, this is how it goes down\nNow my name rang through the door\nGangbang, chain hang, dope slang get it low\nKick in the door or we jumpin' through the window like a car crash Boys turnin' pussy like a Kardash-\nOkay, okay, puro kilos from my oye\nCocaine for the cold face, no problem, no mercy, just a closed case\nFlawless - 3rd eye seeing all this\nPistols poppin' bodies droppin' early August\nLord forgive me for my sins\nYou shed blood on the cross to cover all this\n\n[Chorus x2]\n\n[Bridge - \"OKAY! You wanna play rough? Fuckin' cockroaches\"]\n\n[2nd Verse]\nFace on top of faces, bitches back to back\nCommas after commas, zeros after that\nMoney and the power, pussy and respect\nDancing wit the devil, flirting with the tech\nLook me in my eyes tell me what you see\nGod I call upon pray he level me\nLost up in my mind someone let me free\nFinger on the trigger should I let em breathe?\nShould I let em breathe?\nWs wit a big ol' letter P\nWhat I'm yellin' before I do my shit\nBag it, sell it, then I move that shit\nYou lookin' at a product of the G code\nCaprice's and them Regal's with them kilos\nCatch you slippin' man we need those\nMando end up on a white tee or candle\nWe let em go according to how the cash flow\nGotta make it through them corners before you pass go\nAll summer, all winter do it right\nSeen them fiends catch the fever in the night till they had to hit the needle wit the light\nThen it's off to neverland\nPower with the powder, sniff it off your skin\nLost up in the lust seduced up in your sin\nTaking one of mine, I gotta send em ten\nThe cycle never end\nComin for my soul fuck it let 'em in\nThe cycle never end\nThey comin' for my soul fuck it let 'em in\nFLAIR!", "year": "2017-09-13"}]}