{"artist": "Cappadonna", "songs": [{"title": "Can’t Stop the Pain (Bonus Track)", "album": null, "year": null, "image": "https://images.genius.com/2b22c53a3adc10d86f2da10edbb52114.272x272x1.jpg", "lyrics": "[Intro: Cappadonna]\nIt's always a struggle, yeah\nDon't care how you look at\nP.J.'s, you know how it get, dirty, dirty\nStraight up and down, whole Staten Island (uh-huh)\nSlums, still the same, dude... word\n\n[Cappadonna]\nFrom Park Hill to Jungle Nil', we fight like Navy SEAL\nDon't get killed, chicks can't run in them heals\nNiggas whippin' out guns, payin' them bills\nLife is a bitch, you best not snitch\nMuthafucka, this the real, always\nThe dope fiends, the crack stashed in the hallways\nStyle hold it down, tell Polite call Kane\nDon't never test this, we try'nna make all aids\nJust niggas down when we blaze, crime pays\nSurvival in the P.J.'s, or graffiti experts, M.C.'s and the D.J.'s\nBetter watch your back when flippin' them pies\nReal niggas be goin' down right in front of your eyes\nIf you on the block gettin' it, or a straight nine to five\nStill real, Homicide Hill, police circlin'\nNARCs got pictures of your grill, street turbulance\n\n[Chorus: Cappadonna]\nCuz everytime I close my eyes, I could feel the rain\nAnd everywhere I seem to go girl, can't stop the pain\nNo... can't stop the pain, no..\n\n[Cappadonna]\nUh... this one's for mamma\nNiggas be gettin' slumped in my projects, it's real violent\nCrackheads be on the steps, young bloods'll pop somethin'\nJust to get that rep, everyday it's like this\nDon't even come outside, if you ain't try'nna get no rich\nNiggas murk each other for a small amount of chips\nBloods fightin' other Bloods, there's no Crips where I live\nSomethin' gotta give, niggas bust one another\nTurn around and watch other kids, my hood's straight 7:30'in\nIt get buckwild and the blocks is still dirty\nCameras in the hall, bulletholes left in the wall\nLaundromats locked up, floods in the building\nThe front drain is stopped up, I've been in the hood\nEver since my pain popped up, but just in case\nOne of ya'll niggas forgot, look at your head nigga\nWhat's that little red dot? Got ya!\n\n[Chorus 2X]\n\n[Outro: Cappadonna]\nGive me the bread, heavy on the cheese\nUh... straight like that\nPopulation Click! What's the deal\nFMF, PGL, Osama Island\nAll my niggas in Crimestock, Sing-Sing, what's the deal?\nFar Rock' posse, Queens, Brooklyn, P-Lon\nThat's my word... dance with this!\nGet your guns together... takin' pictures.."}]}