{"songs": [{"title": "Fallin’ Down - Remix by Black Knight", "album": "Gravity: The Remix EP", "year": "2012-12-26", "image": "https://images.genius.com/f24e0fd1ec7be0f1b0e41757520471e0.1000x1000x1.jpg", "lyrics": "[Intro: Trip Lee]\n(Okay if your [?] fails after launch, go to the standby and it will not effect your boost pack\nGemini 4, it will by 1:40 on my mind and we are not reading you very clearly)\nIt's going down, down, down\nIt's going down, down, down\nHey, I know you think you the one, homie\nIt's going down, down, down\nIt's going down, down, down\nBut can’t nobody escape gravity\n(It's the Black Knight)\n\n[Verse 1: Trip Lee]\nIt's going down, down, down\nYes sir, it’s about to go down\nIt’s spiralin’ to the ground, but I don’t think it’s gon’ slow down\nThis fallen world is fallin’, this building’s ‘bout to blow down\nWe just goin’ in circles, we don’t get another go ‘round\nWhat happens when your life is leveled, bro?\nA storm is comin’, can’t nobody’s levees hold\nIt’s heavy, bro, but I gotta let you know\nIt’ll help you look beyond this world like a telescope\nYeah, stack your money in the air\n‘Til it’s rainin’ hund’eds all around your atmosphere\nYou can build a mansion sky high\n‘Til can’t nobody see the roof when they drive by\nBut death’ll hit you like a drive by\nAnd to that stuff you acquired you gotta say, “Bye, bye” (leggo, peace)\nI ain’t gon’ lie, you might go down in history\nEverything will go down eventually\nEverything is falling\n\n[Bridge: Ashton Jones]\n(Everything is falling down)\nMan down\nHope and pray and say I can’t turn (man down)\nHe will find you, this world will grind you down\n\n[Hook: Trip Lee & (Lecrae)]\nIt’s goin’ down\n(It's goin' down, I see the sky fallin’)\nIt’s goin’ down\n(It's goin' down, and ain’t no way to solve it)\nIt’s goin’ down\n(It's goin' down, I hear the Lord calling)\nIt's goin' down\nIt's goin' down\nIt's goin' down\n\n[Verse 2: Swoope]\nIt’s goin’ down, rather comin’ down wit’ it\nCold world, condition is sin, here is the illness\nIt’s sickenin’, affliction so erotic, sickness so hypnotic\nDesirin’ this virus even though we know it’s toxic\nGodless, hallowin’ the gods that is counterfeit\nWe live from ‘de party o’ ‘de dearly departed (leggo)\nThe darkness is flowing from my nostrils\nWe’re so psychotic, we still partyin’ like we not sick (leggo)\nYOLO, homie, so pour another glass\nRoll another one up, let’s put on another mask\nAnother bundle o’ cash, another shorty to bag\nSame thing everyday, groundhog under grass\nTurn the music up cause ya' don’t wanna hear the truth\n‘Bout the things I’m living for is dead and I’m the living proof (leggo)\nShoot, the sky’s fallin’, ain’t no need to panic\nUnless we party ‘til it cracks, seeing Jesus standin’ coming down\n\n[Bridge]\n\n[Hook]\n\n[Interlude: Lecrae]\nYou scared, I’m not\nThere’s a time for everything\nA time to be born and a time to die\nThere’s a time when the world as we know it will end\nWhen that is, I don’t know\nBut it is goin’ down\n\n[Verse 3: Lecrae]\nListen, it’s goin’ down, down, down holla’ “Mayday!”\nThem fiends looking for candy and them dealers got that pay day\nI seen them child soldiers; they was loading up some AK's\nAin’t playin’ Modern Warfare. Don't you know ain’t a war fair?\nScales never even, but they be triple beamin’\nThey keep them fiends fienin’, the Devil stay scheming\nAnd dreamers steady dreamin’, but ain’t no hope here\nAin’t no satisfaction in money, women, and clothes here\nOh yeah! Them Christians in Christian Audigier\nHey, can't some young men say the stuff we gotta say?\n‘Cause everything is fallen, it can happen any day\nYour world come tumbling down and ain’t no way to get away\nYou ain’t never gon’ say you ain’t hear it from Lecrae, crae\nIf I die before I wake I pray to the Lord your soul He'll take, take\nAll these drunken nights are empty like the bottles that we break\nAnd you can't get high enough to escape\nIt's going down!\n\n[Bridge]\n\n[Hook]\n\n(It's the Black Knight)\n\n[Outro: Trip Lee & {Lecrae}]\nIt's goin' down, down, down\n(I didn't see that coming)\nIt's goin' down, down, down\n(4, 4, 3, 2)\n{I see the sky fallin'}\nIt's goin' down, down, down\n{I see the sky fallin'}\nIt's goin' down, down, down\n{I see, I see the sky fallin'}\nIt's goin' down, down, down\n{I, I, I see the sky fallin'}\nIt's goin' down, down, down\n(Black Knight)\n(I have nothing to say)"}], "artist": "Lecrae"}