{"songs": [{"image": "https://images.genius.com/2cbec7b745c109ceb67758132235acd9.600x600x1.jpg", "year": "1998-11-17", "title": "3 Card Molly", "album": "40 Days & 40 Nightz", "lyrics": "[Intro: Ras Kass]\nWhat, yeah, yeah\nBlack John McClane, Harold the Menace, and the Waterproof\nWith my nigga Bud'da, on the track\nGolden State Warriors..\nEatin every rapper on the plate\nHuh, feel me\n\n[Verse 1: Ras Kass]\nI got three-oh-fo's in three-one-oh\nOn section eight, with multiple one-eighty-sevens\nSport a Marilyn Manson t-shirt when I die and go to heaven\nSmoke a beady, scrape my lungs, smoke the resin\nRemember the name Ras Kass-ciano\nGet to clownin y'all punk bitches, cause I'm a Mac, like Ronald\nI make Mac make money, and mack murder wack rappers\nMy Makaveli verse Bomb First, the Mac-11'll gat cha\nWhen I get at cha, the situation tenses\nFatality (Toasty!) before you ever reach your senses\nGot so-called riders, crashing into brick fences\nLike my name was Al Fayed so you die, like that white princess\nIf you lookin for sympathy, you better look\nBetween R and T, in the fucking dictionary\nSee the object of the game is to win, stack some ends, sippin Henn'\nWhip a Benz and leave it to your next of kin\n\n[Chorus: Rass Kas, Saafir & Xzibit]\nPick a card any card, I bet you can't pull it\nGolden State, number one with a bullet\nIt's three card molly\nWill they ever stop?\nProbably not\nPull your spine through your mouth and watch your body drop\nPick a card any card, I bet you can't pull it\nGolden State, number one with a bullet\nIt's three card molly\nWill they ever stop?\nProbably not\nPull your spine through your mouth and watch your body drop\n\n[Verse 2: Saafir]\nThe un-edited medic, on the cut, with a degree in metaphysics\nA doctor, with a lot of patients/patience\nAnd perseverance -- flows like an ocean liner\nThat sails/sales like a clearance, I'm bilingual\nFly like a flamingo, I'm a pitcha, everything I freak\nI heat like Al Pacino, you don't like me baby\nYou ain't happy, you need some Ecstasy\nNow you in my properties, but you have to pay my equity\nFor the lowest point in my character\nI'll reach the highest place in the house when I rock\nLike the Qu'ran, fuse hot, fluid with flavor like buillion cube\nBeen this way since I was fourteen\nAnd like this I been runnin shit without the use of Sportscreme\nRippin up tracks like immigrant Chinese, peep the game I lay\nI'm grim, I brim over my brow when I rip\nNever write rhymes with slim fingertips\nEach syllable you choose to use is light as a flower\nKeep tryin to go gold\nBut all you're gettin is a golden shower\n\n[Chorus: Rass Kas, Saafir & Xzibit]\nPick a card any card, I bet you can't pull it\nGolden State, number one with a bullet\nIt's three card molly\nWill they ever stop?\nProbably not\nPull your spine through your mouth and watch your body drop\nPick a card any card, I bet you can't pull it\nGolden State, number one with a bullet\nIt's three card molly\nWill they ever stop?\nProbably not\nPull your spine through your mouth and watch your body drop\n\n[Verse 3: Xzibit]\nLook, now if it wasn't for the West\nThese rap niggas wouldn't need a vest around they chest\nKeep bustin about where you rest, and what you own, and what you drive\nSo the day some niggas come for you I'm really not surprised\nMr. Black Bruce Willis, please don't kill us\nI show mercy like Kevorkian, like a scorpion\nWe sting you from behind and put it in you, so meet me at the venue\nPut you on the spot to put you on the menu\nFricasseed emcee, we be the ones that keep the pussy hot\nXzibit livin life, like a bull inside a china shop\nStrippin everything, see you ain't even got a dime to drop\nGo ahead and call the cops, you ain't said nathin\nJerry Spring-you out the studio, then Suge Knight you\nTo the parkin lot, niggas ain't ready for all this heat we got\nPicture yourself crushin Xzibit with your tough talk\nThat's like Christopher Reeves doing the crip walk\n\n[Chorus: Rass Kas, Saafir & Xzibit]\nPick a card any card, I bet you can't pull it\nGolden State, number one with a bullet\nIt's three card molly\nWill they ever stop?\nProbably not\nPull your spine through your mouth and watch your body drop\nPick a card any card, I bet you can't pull it\nGolden State, number one with a bullet\nIt's three card molly\nWill they ever stop?\nProbably not\nPull your spine through your mouth and watch your body drop"}], "artist": "Xzibit"}