{"songs": [{"title": "Heavenly Father", "lyrics": "[Intro: Talking]\nDamn man, erything was all good today...\nNow this muh'fucka wanna get behind me (woo! woo!), what the fuck\nHere we go again, same old shit\nI ain't goin this time! {heavenly father!} (yeeeeeeeaaaa!)\nSomeone gotta go man...I'm too fuckin' dirty (ayo, put that shit out nigga)\n\n[Verse 1]\nI was creepin, know I'm dirty as I wanna be\nEight 12's bumpin and tha police right in-front of me\nFeelin like \"Fuck it, man them hoes can't touch me\"\nHarass me, 'cuff me, but still can't bust me\nI don't say I'm lucky, I jus say don't trust me\nI'm all by myself, and I dare yall to rush me\nThe car smell like weed, and I can't find the spray\nPut my finger on the trigger, and let the window down anyway (Heeey!)\nSee when tha gangsta looked the Devil in his face\nDemons get to tellin' him that he can be erased\nIf mentally they guide us, then physically we strong\nIf every nigga learned to load a clip up on they own\nLick a shot (BUCK! BUCK!) Kill a cop (SO WHAT!?)\nThat's tha attitude we got (Yea, they got us fucked up!)\nI can teach tha whole world when it comes to survival shit\nIm God's best friend and I ain't read tha Bible yet\n\n[Insert]\nHeavenly Father! Creator of all things!\nI humble myself...as I bow to your throne\n\n[Verse 2]\nHe was not thinkin' when he made his move\nI don't know how many times I forgave this dude\nIf I played cool then they gon' come right back\nAnd if he take my life, I can't come right back\nI put my strap right there, whoeva close to me\nHe'll hit ya up, if ya run, put a hole in ya knee\nWalk him down, when I get to him turn his ass over\nAnd watch a man cry 'fore I gon' 'n' put it on ya\nI did it fo' a reason so He might forgive me\nBesides this nigga was even tryin to kill me\nResponsible for my actions I'm glad that I did it\nMy momma thinks it cool but my dad ain't wit it (DANG!)\nMy homies show me love 'cause they felt this feelin'\nThey tried to warn me but I done tried to help for him (my bad)\nAnd I ain't even thinkin' bout the time Im'a get\nI'm God's best friend and I ain't read the Bible yet\n\n[Insert]\nHeavenly Father! Creator of all things!\nI humble myself...as I bow to your throne\n\n[Young Buck]\nYou, gon eitha hafta riiide or you gon hafta die\nIts goin down toniiight, them shells about to fly\nWe come to take ya liiife, AND SEND HIM ON HIS WAY! (YO!/HEY!)\n{repeat}\n\n[Outro: talking]\nIt's not a game man\nI mean, I'm out here, I'm in these streets\nFuh'real!\nPick up the phone, accept penitentiary phone calls\nAll that\nNigga I keep the projects' lights on!\nYou gotta love me, nigga! (Yea!)\nAnd I ain't braggin', but I done donated more fuckin money to the school system\nThan ery' one of these country music superstars\nNigga, I am Cashville, Ten-A-Key\nHolla (Holla, holla, holla)", "album": null, "year": null, "image": "https://images.genius.com/787eb0fed4a05aa802dee3238c64431a.792x792x1.jpg"}], "artist": "Young Buck"}