{"artist": "Playboi Carti", "songs": [{"album": null, "title": "Autograph", "image": "https://images.genius.com/2464352e4c9d86516c4891b53ebc48a6.871x871x1.png", "lyrics": "[Verse]\n2 AM on the dot (Ooh, uh)\nSippin' on that Wock' (What?)\nSouth Fulton wit' the Glock (Huh, what?)\nSouth Fulton wit' the Glock (Uh, what?)\nSouth Fulton wit' the Glock (Ayy, what?)\nOn South Fulton wit' the Glock (Ooh, what?)\nOn South Fulton wit' the Glock (Ooh, what?)\nOn South Fulton wit' the Glock (Ooh)\nPull up in a spaceship\nThought that was your main bitch?\nBad bitch wanna fuck me, in my hair like dandruff\nCelebrate like banquet\nHuh, bad bit', uh\nSuck on me like, \"Damn, bitch\"\nQuick sand (Sand, what)\nBad bit', rubberbands (Ooh, ooh)\nTalk that (Ooh), poppin' tags (Ooh ooh)\nShopping bags (Ooh ooh), shopping spree (Ooh ooh)\nBad bit' (Huh, ooh), on the leash (Ooh ooh)\nWhat? Get that cash, show 'em how to ball\nI got money bags, money sittin' tall\nI be lookin' sad 'cause my money so long\nI got all these hoes, they trying to lick the dong (Huh)\nOh my god, Carti be a don\nCarti do the dance, Carti get it on (Huh)\nBitches wanna fuck, can't even get\nBitches- niggas saying I'm kin (Hey)\nNigga, I don't know that man (Ooh)\nNigga,that ain't my friend (Ooh)\nNigga, don't got them bands (Ooh)\nYoung Carti got bands (Ooh)\nThrow that cash up in the air then watch that money dance (Ooh)\nAll these bitches in my pants, saggin' up my pants (Ooh, huh)\nI'm in love, got a bus (Ooh)\nTaking Xannies (Huh), school bus (Ooh ooh)\nOh my God, who that is?\nWe so proud of him, ooh, yeah, we love that kid (Ooh, ooh)\nOh my God, I'm so leanin', I'm so lit (Ooh, what?)\nOh Pierre, he got so nutty in this bit' (Huh, huh)\nPass Pierre two hoes, nutted in that bit' (Who? What?)\nAll my niggas keep a stick, they in this bit' (Who? What?)\nCall that dad, say, \"I need some cash\" (What?)\nWe in Interscope, talking money bags (Uh, ooh)\nOh my God, bit', I need another bag (Ooh)\nI might pop the tag, might just pop this lead (Ooh, what?)\nI might pop the tag, might just cop some land (Huh, huh)\nI'm the fuckin' man, I'm the fuckin' man (Who, uh)\nI'm on South Fulton, riding in the 'Vette (Huh, who?)\nI'm on South Fulton, looking like a vet\nHuh, ooh, ooh, ooh, uh\n'Bout a check\n'Bout a check\n'Bout a check\nOh my God, Who that is?\nHe 'bout a check, I swear he 'bout a check\nLet me get your autograph, who you is?\nLet me get your autograph, who you is?\nWalk inside that mall, they say, \"Who that kid?\" (Huh, uh)\nWalk inside that mall, I just- that's all\nHuh, huh, 'bout that cash (Ooh, ooh)\nLot of cash (Woo), money bags (Huh, ooh)\nWho that kid (Huh, uh), who that man? (Uh, ooh)\nLet me get your autograph, I think you real dank\n-She tryna get a bag\nMy mama need the Birkin bag, I had to buy a bag\nAll these niggas lookin' sad, man, they lookin' mad\nI pop a lot of money bags, I got rubber bands, hold up\nUh, check it out\nWrist out\nPoke out\nShow out\nCheck it out\nCheck it out\nHold up\nOoh", "year": "2019-05-22"}]}