{"songs": [{"image": "https://images.genius.com/43337b48a7c24e79508404e83578e1c0.500x500x1.jpg", "lyrics": "(Where am I?\nI smell fire)\nWho got that fire\nFire?\nI don't smoke that brown\n(Fire)\nI want the bomb\nDon't like that shit\nI don't like that shit\n(Fire)\nI need fire, who got fire?\n(Fire)\nYo nucca\nIt's yo nucca\n(Fire)\nRoll somethin up\n(Smoke it)\n(Fire)\nRoll somethin up\n(Fire)\n\n[Verse 1: Mac Dre]\nI'm at the liquor sto' gettin' mo' blunts for the skunk\nHit the block in the Chev', I got thump in the trunk\nFeelin' good off the 'woods in the hood and I'm thizzin\nKinda 'noid, they always tryin' to take your boy back to prison\nThey hate to see a player employ his self\nThey hate to see a player enjoy his self\nBut I'm sidin', wanna ride? Then player, let's go\nI'm 29 with many rhymes and love XO\nI'm a hog, bust a broad with the words I serve\nEvery tape that I make, baby, learn the words\nYoung Mac Dre got the gift to gab\nHate a breezy who give heezy like she lickin' some zags\nI'm on the celly telly tryin to get some roper from Nelly\nNeed a derry smelly, finna go choke at the telly\nIt's on, finna blow a zone to the dome\nTone Capone got the bong and them bomb weed songs\n\n[Chorus (Repeat 2X): (Harm) & Big Lurch]\n(Fire)\nPuttin the smoke in the air\n(Fire)\nBlowin big type of player player\n(Fire)\nCheech and Chong on a spree\nBlowin it big, come smoke with me\n\n[Verse 2: Big Lurch]\nEveryday in the life of a G\nWe be triflin' and we enlighten the seed\nNiggas ain't likin' me\nThem pimped out gangsterism tactics\nBeen all on my gun like a blacksmith\nThe midget, belligerent actor, see the chiropractor\nBut I crack ya neck, back, spleen\nBlow you to smithereens for the things I done seen\nIn my everyday smokin-out ritual, regular routine\nWalkin' down the street with a gangsta limp in denim jeans\nSeein' some squaws and smile (bling-bling)\nI just wanna lean\nWhy don't I juggle up this dope beat\nThen jump in a five-point-O leavin' the block smoky\nWith the OG Mac Dre, Killa Kali parlay, parlay\nSmokin' a bounce of that bombay every day\n(Puttin' the smoke in the air, blowin' big type of player-player)\n\n[Chorus]\n\n[Verse 3: Mac Dre]\nI need narcotic, that gooey and stinky\nWhen I ain't got it, I'm moody and cranky\nWhat the dealy, what's really, bust down that Phillie\nWe can old school with a zag or blow bags in the billy\nIs you silly, never throw the doobie away\nWaste no dank when you're blowin' with Dre\nTryin' to cope with the stress so I blow big\nHow can a bulletproof vest protect my wig?\nSee, them cutthroat fools done changed the rules\nThe public got it twisted and we blame the news\nI got game for fools 'cause I hang with fools\nThat got game to use and maintain the rules\nKeep it real, dog, and represent what's right\nBe a real hog when you bless the mic\nSmoke big, live long and get yo' pringles\nYoung Lurch and Mac Dre makin' hit rap singles\n\n[Chorus 2X]", "year": "1999-09-28", "album": "Rapper Gone Bad", "title": "Fire"}], "artist": "Mac Dre"}