{"artist": "50 Cent", "songs": [{"album": "Power of the Dollar", "image": "https://images.genius.com/f29b6e681d1b1237ec06d01ab616992a.600x600x1.jpg", "title": "As the World Turns", "lyrics": "[Intro]\nMoney make a pimp, pimp hoes\nHustlers sell dope, thugs gun smoke, what?\nMoney make the world go round as the world turns\nMoney make the world go round as the world turns\n\n[Verse 1]\nNigga I need money to maintain, hustlin' ain't a game\nNigga go against the grain gon' get tore out the frame\nTVs in the Range, I'm into nice thangs\nI slang weed, cocaine and heroin\n50 Cent, that's my name, nigga I bring the pain\nYou thought shit stay the same, nigga shit gon' change\nPut a bullet in your brain, nigga at close range\nRun away with ya rollie, your rings and your motherfuckin chain\nAin't nothing funny mang, I'm about my money mang\nBitch get down on that track and get my money, I ain't playin\nBetter understan what I'm sayin what I'm sayin, I ain't playin\nI'll be in front of your crib, layin, with the Mac to start sprayin\nAny nigga that's in the game, for the fame, gotta be a lame\nCrackers'll put ya in chains, box'll drive you insane\nSun can't shine all the time, man it's gotta rain\nThat ho loose as hell, you betta crack the whip, mang\n\n[Hook]\nA pimp ain't a pimp with no mothafuckin' hoes\nA hustler ain't a hustler with no mothafuckin' dough\nA thug ain't a thug if his gun don't smoke\nA playa ain't a playa if his ass dead broke\n\n[Verse 2]\nI live life in the fast lane\nMan I ain't got nuttin to lose, everything to gain\nEither you with me or against me man ain't nuttin change\nNigga, you.. go against the grain, I'll make you.. walk with a cane\nNow nigga now who you gon' blame when shit ain't the same\nNigga nobody hears your name, you got down wit a gang\nO thirty-one blood, y'all niggas do your thang\nYou got two felonies, fuck it, go out with a bang\nY'all niggas wanna hang with niggas that filthy rich\nThey ain't even got to talk to take your bitch\nOne look was all it took, she seen the Benz-o\nShe seen them TVs and them big old rims, holmes\nAyo the bitch used to bring you dough, used to be your bottom ho\nNow your paper comin' slow, she feel like she had to go\nRoll with them rich niggas and ball with them ballers\nPolitic with the willies the real shot callers\n\n[Verse 3: Bun B]\nI got one life to live, follow that light that keeps on guidin me\nHaters tryin me, hoes is a-bidein me, media ride me\nKing of the Underground so the streets is steady hiding me\nRepresentin sure tasters, the yay' keep takin pride in me\nStreets Deciple slide-in me, status reports the badest\nYou caught walk in the black top wit fat rocks and had his newport\nI can't stay away like Too $hort, I gots to break a bastards back\nTore em up, get lem ready to port, put 'em on the master track\nI blast the facts the life in the grill, gorilla pimpin\nIf I have to mack ya wife then I will, it's me and 50 Cent\nMy nigga, live in trife, and thats real, talkin shit on us\nThats like pullin out a knife and dont kill, that's on the Trill\nI'm on for million wit your pit, in the clit that shit true\nI split through, your defences, so relentless, get you\nWithout you even knowing got you strippin and even hoeing\nYou don't wanna let the pro in the door, this what we showin\n\n[Hook]\n\n[50 Cent]\nIs your bitch your bitch or is your bitch mines?\nIs your bitch your bitch all the time?\nYou done got your paper, now it's time I get mines\nExcept the serve and everything'll be fine, bitch\n\n[Outro]\nRunnin from pimpin, bitch you need to run to some pimpin\nWit them cheap ass payless shoes you got on ho\nYou still ain't figured out what a ho supposed to look like\nLook at you motherfucka here, huh bitch?\nHow you gunna catch some dates lookin like that ho?\nBitch get off the sidewalk and into the street\nBitch the sidewalk is for pimpin bitch!", "year": null}]}