{"songs": [{"year": "2010-02-02", "image": "https://images.genius.com/b6f087aecb1233cc21f609a59e6df58c.1000x1000x1.jpg", "title": "Dreams", "album": "Queens Chronicle", "lyrics": "[Part 1]\nI only spit the rawness/ and the guns is enormous!/ Even/ with the heat on/ me I'm cooler than the […]!/ I'm what a don is,/ puffin' Cohibas,/ sippin' Sangria/ with a dumb Senorita/ and she got a/ tight body, yo/ and believe, I got the bodyguards/ with the hammer to body y'all!/ I'm gangster like De Niro, a hood fella,/ cap dealer,/ dope dealer,/ goal getter!/ Who realer?/ No nigga!/ Bounded like P, it's a dream, not reality!/ Gotta wake up before somebody/ come to body me!/ The gun in front my spot, the king in the hill,/ I know it's just a dream but it seems so real!/ But while I'm here, I'ma hold down the throne/ and the first nigga front, his head gets blown! Straight off from the boss shine [???],/ heat holder,/ and the dees rolled up, bustin' shots, then the dream is over!\n\n[Hook]\n„I see pies every time my eyes cl-idd-ose“ „I got dreams“ „It was all a dream“ „Startin' shit in my hood, I can't have it!“ „[So we were ...]“\n„I see pies every time my eyes cl-idd-ose“ „I got dreams“ „It was all a dream“ „Startin' shit in my hood, I can't have it!“ „Queensbridge and we don't play!“\n\n[Part 2]\nI was on the fast pace/ up in a rat race/ and a high speed car chase/ with niggas that car jack!/ Ride/Right, you get your homicide, bounce without a trace!/ The victim and the head, they left 'em here without his face/faith!/ You won't see a thing, all you hearin' is sirens!/\nAll you know, with the New York City boy be wary!/ And my words and my beats comin',/ knockin'/ through the stereo!/ Don't confuse me with the fake rappers on the radio!/ More talent, more style and plus I let the semi go,/ not the one stuntin', flashin' guns in the video!/ Live it/ more vivid,/ I don't need to be dramatized/drama-typed!/ Better say my name cause I'm not the one who let it ride!/ (Nigga!)\n\n[Hook]"}], "artist": "Big Noyd"}