{"songs": [{"lyrics": "[Hook] x2\nI can't get with that\nI gotta keep it thick, never miss, so I hit 'em like this\n\n[Verse 1]\nStraight to the track my lyrics is phat I rip it the fuck down\nMore than a fluke I'm regularly wreckin this shit so what now\nSo many brothers be bitin' they tongue to detect who I be\nWell check out the J check out the A check out the Y.... Z\nOriginal rap I'm makin it slap I'm hemmin it up like that\nStringin it, slangin it, swingin it fat, bring it back\nI be that nigga with a gat boom-clack\nDon't ever sweat it when I go, I zoom back\nBetter than ever, never better, you better, whatever\nI suggest some Ex-Lax and that'll get your shit together\nI give you a snotty nose from body blows\nNobody's safe at a party even Gotti goes adios\nI got-got-got Flav-flav-flav-flavor so save yours\nOne verse and it's a hearse I played and I slayed yours\nGet it, got it, ready to flip, I doubt it\nNo need to prolong, Jigga the man, gone!\nI'm out\n\n[Hook] x2\n\n[Verse 2]\nThe next nigga never get no rest you're livin' with stress\nCause just around the corner be the best nigga\nYou're fearin my clout if weed got you runnin' your mouth\nYou better blow that shit out\nThe Jigga's back you niggas are flat\nI'll amaze the way that Jay rap now how in the hell did he say that?\nYou diggin' me the epitome of rippin' it raw\nYou kiddin' me no nigga that rap gettin' bigger than me\nAlthough ya niggas are wettin' my style I'm still thristy\nAnd we all gotta fall off but you first G\nI'll be the last it'll be a cold day in hell\nBefore you see me Sauce and Jaz chillin with your wack ass\nWe break shit and harmony like Take 6\nWhile you niggas double pumped off the fake shit\nOur Roc-A-Fella never sell-a-out\nBrothers who don't have the heart you better tell your mouth nigga\n\n[Hook] x2\n\n[Verse 3]\nListen\nI don't kick it I punt it I'm so wicked you want it?\nMy tongue's just tired from lickin' my fingers and countin' up hundreds\nSo I bought a money machine and it goes\nA tat-tit-trrrrrrr-at-tit-trrrrrt-at-tit-tit-Git-Dough\nHow many styles I gotta kick to prove I'm def?\nI can even-kick my--rip that-shit-and catch a breath\nI'm nicer than a bitch, ask this nigga Dash\nNow he don't count cause I'm makin his ass rich\nThis nigga's nothin but the truth\nMany view Jay-Z as a threat to they loot.. fuck 'em\nMy shit is tight, can't slip, gotta grip\nLike a pit in a dog fight my shit is aight\nI ain't checkin' for you 'less you my peoples\nAnd just in case you didn't know peep the steelo\nIt goes one dime for your mind\nAnd two bone crushers for your spine\nCause none of ya game is rougher than mine\n\n[Hook] x2", "title": "I Can’t Get Wid Dat", "image": "https://images.genius.com/86f5aa1e7e0b1b26a2bcf964bae666f9.600x597x1.jpg", "year": "1994-01-01", "album": null}], "artist": "JAY-Z"}