{"artist": "360", "songs": [{"album": "Please Be Seated", "year": "2010-03-28", "title": "Do You Have A Dollar? (Coin Laundry)", "image": "https://images.genius.com/fcbf34bbaeea7510da3d3de60a3d77a6.720x720x1.jpg", "lyrics": "[Verse 1: 360]\nHi, could you spare some change?\nI've been living at these stairs for days\nDays like this I can barely take it\n'Cause people don't really seem to care today, shit\nAnd they're afraid 'cause I talk to myself\nI wish I didn't have to, I talk 'cause it helps\nAny time that it's silent and my mind's still\nI hear the screams from the people that I've killed\n\n[Chorus 1: Lisa Mitchell]\nDo you, do you\nDo you have a dollar? Do you have a dollar for me?\nHave you got a house on a hill and a bed for three?\nOh, do you have a story? Do you have a story for me?\nDo you know the one where we all live happily?\n\n[Verse 2: 360]\nTell me, what's it like for you to judge me?\nYou cross the road, does it frighten you to touch me?\nIt's funny that you can go from fighting for you country\nTo getting locked away for fighting 'cause you're hungry\nWhen I get money I get high 'cause I'm a junkie\nI never used to do it, but I like it 'cause it numbs me\nI've barely made four dollars\nBut I'd appreicate your help because I wanna escape\n\n[Chorus 2: Lisa Mitchell]\nDo you, do you\nDo you have a dollar? Do you have a dollar for me?\nMaybe just an hour or two and a pot of tea\nHave you got a memory? Have you got a memory for me?\nTell me 'bout the days when you were seventeen\n\n[Verse 3: 360]\nAyo, I take a lot of shit 'cause I need to\nIt helps me to forget it all, so gimme the needle\nAnd honestly I've killed a lot of innocent people\nSent by a country where that shit is illegal\nAnd if you kill in your country it's no way\nBut if you do it for you country it's suddenly okay\nI would end it, but I never follow it through\nSo maybe spare some money, just a dollar will do\nThank you\n\n[Chorus 2 (Extended): Lisa Mitchell]\nDo you, do you\nDo you have a dollar? Do you have a dollar for me?\nMaybe just an hour or two and a pot of tea\nHave you got a memory? Have you got a memory for me?\nTell me 'bout the days when you were seventeen\nDo you have a dollar? Do you have a dollar for me?\nMaybe just an hour or two and a pot of tea\nHave you got a memory? Have you got a memory for me?\nTell me 'bout the days when you were seventeen\n\n[Outro: Lisa Mitchell]\nDo you, do you\nDo you, do you"}]}