{"songs": [{"lyrics": "[Aceyalone]\nYeah! Woo-coo-oo-oo-oo-oo-ooh\nYeah! Ace One!\nYeah, and you know what I told you\nI don't do this for myself\nI do this strictly one hundred percent.. for you\n{*scratched in background: \"This one, for you and you and you\"*}\n\n[Hook]\nYeah, I do it all for you, I do it all for you\nI do it all for you, I do it all for you\n\nThey put me on the wrong world, yes they did\nStar on my forehead bless this kid\nThey threw me in headfirst, blind in the dark\nIn the alligator pit with the rest of the sharks\nAll I could think about was how they set me apart\nI never knew a killer whale who had so much bark\nThe heart of a lion, I'm sharp as a dart\nAnd it took me a long while to master the art\n{*scratched: \"This one, for you and you and you\"*}\nYou know why?\n\n[Hook]\n\n[Aceyalone]\nI'm Aceyalone, how can I be of service?\nWhat else do you need besides superb wordage?\nMan I stay heated like a burner from the furnace\nMy shoes always brown, same color as my shirt is\nI write authentic, always all in it\nOutside the law, raw, never fall timid\nAlways ahead of myself, pushing past the limit\nWe taught the world to freestyle now it's a epidemic\n\n{*scratched: \"This one, for you and you and you\"*}\nYeahhhh! Woo-coo-coo-coo-coo!\n\n[Hook]\n\n[Aceyalone]\nI walked the long mile just because I had to\nI'll be glad to add to the pile if I have to\nAin't a situation on earth that I can't adapt to\nI do what I got to, and a little of that too\nI am what I am but that ain't all I can be\nSpend a lifetime trying to big up the family\nI leave 'em with they eyes open wider than Bambi\nThey don't understand me, that's why they abandon me\n\n{*scratched: \"This one, for you and you and you\"*}\nYeah! Yes man!\n\n[Hook]\n\n[Aceyalone]\nI'm always on next and ready to bust it up\nWork hard, play hard, never a customer\nSkills stay hardy at the party for sustenance\nMan I'm on the grind, I'm a non-stop hustler\nI'll fight the fight that nobody will fight though\nSpite those fools that be trying to bite dope\nI'm like no other MC on the mi-cro\nI might go psycho, keeping it tight though\n\n{*scratched: \"This one, for you and you and you\"*}\nOne two! Yeah yeah, yeah yeah!\n\n[Hook]\n\n[Aceyalone]\nNo guts, no glory, it's the same ol' story for\nI'm out with my nightstick, cruising the corridor\nThey always wanna ask why you swinging that sword of yours\nBecause I'm a warrior, killing them more and more\nWho you gonna call when there's so many to choose from\nYou win some, lose some, now who wanna do some'\nA new somebody who be trying to prove some'\nNow I gotta move some, and give you a new sum\n\n{*scratched: \"This one, for you and you and you\"*}\nWoo-coo-coo-coo! Yeah-heah!\n\n[Hook]\n\n[Aceyalone]\nYeah I'll put a fire to the house that Jack built\nI rose from the grave for the people that crack killed\nMy name on my buckle when I'm wearing my black belt\nI gave you half the world now tell me how that felt\nCause anywhere you go, I'll be right behind you\nAnd if you don't know, then I gotta remind you\nHold on to your parachute and jump when it's time to\nCause I was designed to have the people to rhyme to\n\n{*scratched: \"This one, for you and you and you\"*}\nNo shit! Yeah-h-h, didn't you know?\n\n[Hook]", "title": "All for U", "album": "Magnificent City", "image": "https://images.genius.com/d377dd352876664b03799298f4325e48.600x600x1.jpg", "year": null}], "artist": "Aceyalone"}