{"songs": [{"year": "2016-11-04", "image": "https://images.genius.com/276f9ce7db4fdfcb8518ab6ab64cfd4a.500x500x1.jpg", "title": "Dump Nigga", "album": "H.O.G.", "lyrics": "[Intro]\nDump nigga, dump nigga, dump nigga, dump dump\nDump nigga, dump nigga, dump nigga, dump dump\nDump nigga, dump nigga, dump nigga, dump dump\nDump nigga, dump nigga, dump nigga, dump dump\n\n[Verse 1: Boogieman]\nNigga I'm dumpin' like a yopper, fully auto it's boogie bravo\nKilling everything around me, you niggas will surely follow\nYeah I spit it like a cobra, a seasoned misery soldier\nBoogie definitely doper, infectious when you get closer\nInfection is with the poker, I'm stickin' bitches, bend over\nYou love it and then it's over, no need to be seekin' closure\nI'm frequently off the dojer, it's hard to keep my composure\nHe's better when he ain't sober, I'm driving, baby, pull over (yeah)\nDamn right, I kill 'em when it's my turn\nAny disagreement: we gon' settle it on my terms\nI can call a couple niggas, make the block burn\nShow up with them dreezies, guranteed to make the block learn\n\n[Hook: Godemis]\nDump nigga, dump nigga, dump nigga, dump dump\nHowever you want it, whenever, wherever, for real\nDump nigga, dump nigga, dump nigga, dump dump\nForever we put it together, we better with skill\nDump nigga, dump nigga, dump nigga, dump dump\nGet on my level, reconsider, you think it's a drill?\nDump nigga, dump nigga, dump nigga, dump dump\nYou muh'fucka's poppin' too many pills\n\n[Verse 2: Big Scoob]\nBustin' like a Ruger, I'm a high powered shooter\nI'm surrounded by these yopper thangs, but I'll get down and knock it, man\nYeah, Scoobie do the foolie, and roolie moody gets groovy\nI don't need the whole drum, I'ma walk up on and do it\nBlame it on the liquor, I'm a full bottle sipper\nWhat's a fool to the limit? I'm a full throttle spitter\nWith the tricky hair trigger, ain't no love for that nigga\nI be killin' with the rhythm like I practice terrorism\nIn a battle I won't rattle, sittin' solo in the saddle\nNeed to slaughter all you caddle, got's to get them 40 titles\nYeah I'm pickin' on you feminines with metaphors and synonyms\nWe can switch it up, I gives a fuck, I really get it in\n\n[Hook: Godemis]\nDump nigga, dump nigga, dump nigga, dump dump\nHowever you want it, whenever, wherever, for real\nDump nigga, dump nigga, dump nigga, dump dump\nForever we put it together, we better with skill\nDump nigga, dump nigga, dump nigga, dump dump\nGet on my level, reconsider, you think it's a drill?\nDump nigga, dump nigga, dump nigga, dump dump\nYou muh'fucka's poppin' too many pills\n\n[Verse 3: JL]\nDump in, they can't stop, but to get it out may take a while\nNothin' they can say about this skill level, chop and lay 'em out\nMagazine, hundred round drum, nigga predict that outcome\nAutomatic when a mouth run, I'm a killer, keep it one-thousand\nIt's school time, my [?]\nScoob called, nigga I'm there\nGun's out when I bust with 'em, when I come get 'em it is unfair\nTwo time, nigga's fine dine, uncommon mind mind like Einstein\nFuck categories and labels, I'm not confined on a fine bind\nNo filter, I'm Monsterifik, Damn Fool, plus been the truth\nOff kilter, my grind terrific, can fool, chase in a loop\nAll nine identical, see stealth faces when I shoot\nNow squad's not bulletproof, leave shell cases in the booth\nHuh!\n\n[Hook: Godemis]\nDump nigga, dump nigga, dump nigga, dump dump\nHowever you want it, whenever, wherever, for real\nDump nigga, dump nigga, dump nigga, dump dump\nForever we put it together, we better with skill\nDump nigga, dump nigga, dump nigga, dump dump\nGet on my level, reconsider, you think it's a drill?\nDump nigga, dump nigga, dump nigga, dump dump\nYou muh'fucka's poppin' too many pills"}], "artist": "Big Scoob"}