{"songs": [{"year": null, "title": "Reason, Season, Lifetime", "image": "https://images.genius.com/957f0d0a594a246a123db431c7990d2a.1000x1000x1.jpg", "lyrics": "[Intro – Saigon]\nThank you\nTo everybody\nWho love somebody (damn…)\nWho miss somebody (talk to ‘em…)\n\n[Verse 1 – Saigon]\nI remember like it was yesterday, Jay\nBefore this Saigon buzz, before they was calling me S to the A\nYou would say I was the best to this day\nI be like, “Better then Nas.”  You say, “Nah, nigga, better then Jay”\nAnd I be like, “You bugging, cousin.”  Plus, you knew that I wasn’t\nThat was your way of encouraging the kid to keep shoving\nNo matter whatever the crime, you would do for the grime\nWould go as far as slinging dimes for some studio time (damn…)\nI still feel you here, even though that I know you not\nTold you I would blow, but I really wanted to show you.  I…\nI ain’t stay local, rock shows around the globe\nShot down a lot of folks who thought they was hot with they vocals\nI know I visit your grave not as much as I should\nBut it’s funny ‘cause it’s as much as I could—it’s harder than you think\nPray to God that you up in that bitch, slaying\nSend my love to Miss Mary Elizabeth, sing\n\n[Chorus – Jovan Dais]\nPeople come in and out of life everyday\nSo hang around for a while, for so many stay\nFor a reason, season, or a lifetime\nSaid, “It’s hard to let go but we got to”\n‘Cause baby they done what they got to\nThey either here for a reason, a season, or a lifetime\n\n[Verse 2 – Saigon]\nIf you got somebody you love that’s deceased\nWhether it’s your brother, your niece\nYour mother, your father, your uncle, the preach\nA close friend who was stuck in the streets\nSomeone you tried to pull out, but it seems that he just kept ducking your reach\nI’m hoping your heart’s touched with this beat\nStevie Wonder sees black babies playing, not lugging the heat\nThere’s a couple people I love to 6 feet\nMy grandmamma, my other brother was killed on them New Jerz streets\nMy friend Ali got struck with the train\nIt was hard to bury the Godbody, hardly nothing remained\nIf I seem him again, will I hear that laughter that left?\nOr is he still how he died with his head detached from his chest?\nDamn…  I can’t call it, fam.  Rest in peace to “Stuttering Stan”\nWe stuck together like peanut butter and jam\nThat was my motherfucking man\nHe would always give me the upper hand\nNow he laying under the land\n\n[Chorus x2 – Jovan Dais]\nPeople come in and out of life everyday\nSo hang around for a while, for so many stay\nFor a reason, season, or a lifetime\nSaid, “It’s hard to let go but we got to”\n‘Cause baby they done what they got to\nThey either here for a reason, a season, or a lifetime\n\n[Outro – Saigon]\nYeah man, it’s real.  Mike White.  Jeru.  Lester Grey.  Rest in peace.  Mary Elizabeth [?].  My grandma.  Everybody.  [?].  It’s real.  One hand in the air.  Life is very real, man.  Enjoy every day of your life, man.  We born to die in this muhfucka.  Word…", "album": "The Moral of the Story"}], "artist": "Saigon"}