{"artist": "Big Daddy Kane", "songs": [{"lyrics": "[Kane] Aiyyyyyyyyyyyyyyo!\n[Rick] \"For all of y'all..\"\n[Kane] Check it out, check\nAiyyo, we gonna send out to all the projects out there\n[Rick] \"For all of y'all..\"\n[Kane] Yknahmsayin? Like Roosevelt Projects, Marcy Projects\nWe gon' send it to Fort Greene, L.G\n[Rick] \"For all of y'all..\"\n[Kane] Better yet, all the projects in Brook', no\nAll the projects on the East Coast\n[Rick] \"For all of y'all..\"\n[Kane] Now when we come to Church Street South\nYknahmsayin? Canal Street there in Durham, North Carolina\n[Rick] \"For all of y'all..\"\n[Kane] Streets of Crooklyn, and all the great streets\nEveryone everywhere! Sounds like everywhere around the universe\n[Rick] \"For all of y'all..\"\n[Kane] Yknahmsayin? All the projects, yknahmsayin?\nWe sendin this out to everybody, this one here\n[Rick] \"For all of y'all..\"\n[Kane] Now do you understand me?\nWe gonna set it off one time, dig the flavor y'all\n[Rick] \"For all of y'all..\"\n[Kane] Ha hah hah!\n\n[Big Daddy Kane]\nLivin in the world of ghetto life\nShot with the gun, get you cut with the knife\nThat's the story yo, the way the peeps like to move\nNo fakin the funk, it's all about how to show and prove\nSome get to make it through life livin legal\nThe others gotta try to survive, doin the evil\nThat men do, peace to every hood that I been through\nI even got love for my homies in South Central\nBut to the East my brother, cause that's where I stay at\nRunnin through the streets like a stray cat\nLike that Good Times show it makes me go\nHmmmmmmmmmmmmmmm, hmmmmmmmmmm, hmmmmmmmmmmmmmmmmm\nUp in the projects, it gets no ILLER\nWith true gue-RILLAS, and stone cold KILLERS\nIt seems that every night, you get to hear the fireworks\nAs much as I hate, to see my people die or hurt\nIt's just a street mentality, a reality\nNeighborhood warfare, that brings home casualties\nAnd just because I moved out the residence\nIt don't mean that I can't represent\n\nChorus: Kane + \"Yeah! Yeah!\" -] chanted in back throughout\n\nSo to my peeps in the PJ's, throw your hands in the air\n[Rick] \"For all of y'all..\"\nLet me know you're out there\nTo my peeps in the PJ's, throw your hands in the air\n[Rick] \"For all of y'all..\"\nLet me know you're out there\nAnd to my peeps in the PJ's, throw your hands in the air\n[Rick] \"For all of y'all..\"\nAnd let me know you're out there\nAh to my peeps in the PJ's, throw your hands in the air\n[Rick] \"For all of y'all..\"\nAnd let me know you're out there\n\n[Big Daddy Kane]\nI'm runnin mob deep around the way\nIt's me and the crew, we're tryin to map out the day\nYo what's the haps on how we gettin snaps?\nAre we gonna shoot some cee-lo, or play a game of craps?\nMatter fact, Shane, ring the intercom\nAnd see if you can get ten dollars from my moms\nTell her to throw it out the window if she got it to spare\nCause the elevator's broke, and I ain't checkin for the stairs\nAnd do me a solid, run to the store shorty\nAnd pick me up some Olde E, but not a 40\nJust a two-two of brew will do, so I can knock it out fast\nTo make the coldness last\n\n[Scoob]\nAnd while you at man see where'd your friend go (word)\nHe shoulda been back a HOUR ago with the indo (yeah)\n\n[Big Daddy Kane]\nAnd meet us in the back park to get sparked\nSo I can be toasted by time it gets dark\nAiyyo Jay, I see that bulge in the back of your jeans\nHope that's the God U Now, know what I mean?\nCause if somebody brings the noise, I'mma make it a silent movie\nSo take the safety off the toolie\nCause I don't want no beef, NAHHHHH BABY\nThe only thing I wanna do is PARRRRRRLAY\nPeace and harmony is what I relate to\nBut damn man, drama's just in the nature\n\nChorus\n\n[Big Daddy Kane]\nI send this out to the homies in the hood\nThat stood by my side, to help a brother do good\nJust like SWV you was Right Here\nYeah yeah yeah yeah yeah we in there\nFrom all thugs that flex with all the muscle\nDown to the brothers, that got a swift hustle\nLike good golly Miss Three Card Molly, a neat trick\nWhere people get beat quick\nWanna see a sweet vic?\n\n[Card shark]\nJackety Jack, blackety black\nYou get nuttin back, and that's a fact\nThe sweetest game I ever seen\nAll you gotta do is find the red queen\nJust point to it, can anybody point to it?\nI play by the point of the finger of the hand\n\"The one in the middle! The one in the middle!\"\nThat's black, you get no money back!\n\n(Kane: Aww man! See, I told you!)", "image": "https://images.genius.com/c57181cdaaeb4f7bcf3a5a0f89a83315.1000x1000x1.jpg", "year": "1994-09-13", "title": "In the PJ’s", "album": "Daddy’s Home"}]}