{"artist": "Casey Veggies", "songs": [{"title": "PNCINTLOFWGKTA", "album": "Customized Greatly Vol. 3", "year": "2012-04-09", "image": "https://images.genius.com/28eb51ba21c0b473fc0f5f74d662ccb2.500x500x1.jpg", "lyrics": "[Verse 1: Casey Veggies]\nThis shit is schizo, tell a chick to get low\nYeah that was an insult, sorry for that info\nYoung killa' that be ridin' round, swag me out, wipe me down\nYour bitch is just like a frog and she just be hoppin' around\nWhole squad be pipin' it down, that Peas and Carrots, That OF\nGun fights with no vests, get merked off when I blow checks\nAin't talkin' grams but I'm on deck, they talkin' grams I'm focused\nThis flow sick, you know this, she rolled it like a mosh pit\nImagine that, I hardly kick them braggin raps\nBut right now my swag is a bad ho, magnet\nYou hesitant and I'm adamant, can't stop this, got the locksmith\nIn the door, on the scene, cash rules and I'm making cream like\n\n[Chorus: Tyler, The Creator]\nNiggas see the chains and the bitches and the gold\nThese niggas think it came with the fishes and a boat\nWell fuck the bullshit it's time to let these niggas know\nLet these niggas know, let these niggas know\n\n[Bridge: Casey Veggies]\nGetting money now nigga trust that\nFresh up out the plastic nigga fuck that\nY'all niggas talking shit but y'all won't bust back\nNah!\n\n[Verse 2: Domo Genesis]\nI'm high as my confidence, nigga sue me\nNiggas acting like they part of the action I'm in the movie\nLets get it crackin', young nigga with fashion, two piece Louis\nWith a hand full of hoochies tryna to stuff em in the hoopty\nYeah I'm bougie, but nigga fuck it do you and I do me\nWas frontin' like my new teeth and now they lookin like \"Who he?\"\nOops this Domo Genesis, Wolf Gang syndicate\nWolf Gang we in this bitch, thick like Brazilian bitches is\nListen kid, this is the part where I'm swearing we win\nMoney make the world go round I'm preparing to spin\nI swear I love LA but when it's ready to end\nI'm in New York tossing dimes like I'm Jeremy Lin\n\n[Chorus: Tyler, The Creator]\nNiggas see the chains and the bitches and the gold\nThese niggas think it came with the fishes and a boat\nWell fuck the bullshit it's time to let these niggas know\nLet these niggas know, let these niggas know\n\n[Bridge: Casey Veggies]\nGetting money now nigga trust that\nFresh up out the plastic nigga fuck that\nY'all niggas talking shit but y'all won't bust back\nNah!\n\n[Verse 3: Hodgy Beats]\nI'm a silent flexer oh, hybrid Lexus, low\nI bred measures, my hybrid's better\nSativa dominant, abolish kids with prominence\nDemolish and conquer shit, faggots wanna honor this\nI know you see the cars and the whips\nBroads and these bitches on my balls and my dick\nI'm here for the cash I ain't calling in sick\nNext time I pick up the phone, I'm calling in rich\nOne dollar, two dollar, three dollar, four\nOne nozzle, two models, three bottles pour\nI wake up in the morning like I missed the night before\nI know I love my life for sure\nYou know I fucked your wife, my whore\nI'm a fucking animal, that's one hell of a species\nI move you niggas out the way with my telekinesis\n\n[Chorus: Tyler, The Creator]\nNiggas see the chains and the bitches and the gold\nThese niggas think it came with the fishes and a boat\nWell fuck the bullshit it's time to let these niggas know\nLet these niggas know, let these niggas know\n\n[Bridge: Casey Veggies]\nGetting money now nigga trust that\nFresh up out the plastic nigga fuck that\nY'all niggas talking shit but y'all won't bust back\nNah!\n\n[Verse 4: Earl Sweatshirt]\nJive pants tattered kicks, Sunday sabbath-less\nLose-lose, .22 caps in that catchers mitt\nAnd daddy's absence was the reason why the swagger's this\nSimilar to abstinent ass and you ain't tappin' shit\nWho rap rancid as rats acid with four and a\nHalf rations of horse laxatives down the hatch again\nAnd dip fast as shit when all the cash cacklin'\nStanzas of them axes that him have to cut the chatter with\nHard as the wall of Clay Cassius that my back against\nHulk smash brackets that the masses try to stash him in\nHalf pans labyrinth, half black magic grip\nBlack flak jacket tap dancin' in a passion pit\nGolf Wang cut and stitch surgical\nLips slurpin' that lit purple, my bitch circular\nNot givin' shits like writers when its personal\nDisgurstin' as dick burpin' when its vertical\n\n[Outro: Tyler, The Creator]\nOh shit that's the end huh\nAww, un uh man, I like talking shit, I feel like P. Diddy!"}]}