{"artist": "ILL BILL", "songs": [{"title": "Porno Director", "lyrics": "[Intro]\nI will need two forms of ID for purposes to verify your age. Make sure you sign that model release. Because without that, I'm not gonna be able to use your image of you sucking my cock\nCheck it out!\n\n[Verse 1: ILL Bill]\nILL Bill, the rap Jules Jordan, call me the hip-hop Joey Silvera\nBrazilian bitches bang me, then let them blow me forever\nThe balls deep, but we all creeps, the pistol's popped\nLooking for beautiful girls like Christoph Clark\nI need an Evil Angel in my life, waterfront property\nMore goons with guns that go to war properly\nThe projects, the gutter, I grew up in poverty\nI'm rich now, Uncle Howie Records is a monopoly\nYour monstrosity roll with the dream associates\nMy team is the real deal, your team is a bunch of dicks\nWe top of the pie, rock it like (???)\nLocking It down, dropping it live and then rock it with pride\nI been around the world, partied with all types of girls\nFrom police woman and stripper with thousand pearls\nA whole boat-load of hoes done swallowed my pole\nBut only a porno bitch can throw me out of control\n\n[Chorus x2: Ill Bill, Sabac & Goretex]\nPussy and hard drugs, sawed-off shotguns, we God’s thugs\nGet my cock sucked by rock groupies and pop sluts\nWeird chicks, with big titties and pierced clits\nExotic dancers in love with us, the fuck you think?\n\n[Verse 2: Goretex]\nGoretex the young wizard, my life is like a porn set\nDrug blizzards, runaway bitches slump dead on my door step\nSugar momma's got a crush on Gore\nFisting their ass, twisting nipples, sucking my balls\nTapping the bush, medium rare was mush\nShe ain't happy unless she got pills and the arm in a tush\nSparking the kush, leaving off the strippers like it's welfare\nHip-hop, the ligaments, I'm killing shit (we in the mix)\nHaters obsessed, I'll be swerving the Benz\nMy chick's ass is so fucking fat, be hurting her legs\nTwenty eight cadavers, but I ain't heard from the feds\nUncle Howie opium den, we be repping on death\nStay baking, you american faggot like Clay Aiken\nCome back and you be dancing the raves like Ave's patients\nBelly up, we thugging and heavy, my goons ready\nYour skull's a deli, my guns turn your head to confetti\n\n[Chorus x2]\n\n[Verse 3: Sabac]\nI'm obscene\nEnter your nightmares, challenge your dreams\nNon-Phixion, we the most balanced of teams\nMy themes and thoughts so deep, man, it hurt when I spit\nSabacolypse, conscious lyricist perverted and sick\nConverted the wig of a nationalist\nI love them chicks on tour who like flashing their tits\nA passionate bitch who take it in the ass or what attached to wrist\nThem fast with the fist, a massacres of (???) and kids\nBlast at the pigs (blaow!) cause of what they do to the people\nI get my dick sucked while I read the Rulers of Evil\nI flew with the eagles, swam with the sharks\nDamage your heart, I break you down\nBuilt you up as I plan for the mosh\nStay armed with forty women that are psyched about porn\nPhone the biggest fucking orgy on the White House lawn\nForce the twins to join in, have the both them to blow me\n(???)\n\n[Chorus x2]", "image": "https://images.genius.com/fc526dae683e1f19f37ee02105da9a7c.1000x1000x1.jpg", "album": "What’s Wrong With Bill?", "year": "2004-05-04"}]}