{"songs": [{"year": null, "album": "Sneakacydal", "image": "https://images.genius.com/97c91dc80b88200e006057b75d60b40e.295x295x1.jpg", "title": "A.O.B. (All on a Bitch)", "lyrics": "[Verse 1: Keak Da Sneak]\nThis goes out to all you hoes who ain't got no get back\nIf you forget that, Wit my fist, I wouldn't hit that\nThe lench crack, Ass and tits wasn't lookin lovely\nEverytime I see the bitch, She's lookin ugly\nShe mugged me, Semi in belly, Lookin all stubby\nDrinkin bubbly, Lookin at her through car right, No she couldn't do nothin for me\nBad bitches only, Cause I'm a star, Everybody know me\nPlus I can be pushy, Bitches be fightin over me\nBut you though, You in the oooh, Ho\nYou couldn't make me a sandwich, I wouldn't let you tear my shoe, Ho\nYou just a ghetto bunny, Uh and bitch you hella funny\nScuff a nigga dick, Get the gooey shit, But you ain't gettin no money\nSome bitches wonder why they lonely\nCause if you ain't about no dough, I'mma be yo one and o and bitch you hella phony\n\n[Hook 4x: Keak Da Sneak/Agerman]\nFrom weedsacks to mo red bottles\n$150 case to buy me fits\nNigga it's all on a biatch\n\n[Verse 2: Agerman]\nFrom here to the go, GQ to my rear view hidin a rolex off that hen and bond\nGet off the freeway, Bart get Daryl through that tunnel headed for echelon\nBefore I stepped in, Parking lot pimpin\nWit $5 purse on the hand of my hand for thirst quenchin\nHaters beware, We attack like wild bears\nHo stare at a player, Kickers like Nike Air\nThe crowd up'll stare\nSecurity push me in the do', Cause I'm all in the dough, Popped in my collar like a snare\nRecognize the lil trick at the bar wit her square\nSwear she dope like she real, But she's fake like her hair\nWhile ya hatin movin ya mouth I'm makin moves wit my life\nYa kissin her all in her mouth, I'm face fuckin ya wife!\nIt's all on a bitch\n\n[Hook] 4x\n\n[Verse 3: Keak Da Sneak]\nI seen her in the club, Lookin all fitty\nBring that cheddar here, Wit it tryin to get some nigga to hit it\nShe need to quit it, Bitch you my bond, Why don't you go on and admit it?\nThat bus full of drunk-ass nigga somebody gon get it\nThat fast, Tell ya how much a nigga fiend for some ass\nShe got no class, And around licks, She got a rash\nThat's how many dicks her mouth don last\nThe ho is fast, Now she 22, Doin the crew\nNiggas call her ms. magoo\nMiss the goo, Cool cool aight cool, Cause she was a victim\nStraight come from it, Niggas love ya sister\nSome niggas go all out and let her\nTryin to turn a ho into a housewife, Don't wanna quit em\nYou spike biatch, It's wrong how you did em, did em\nSlipped up and called you another name\nSympathy'll cripple ya game\nThat's why it's all on a biatch, biatch\n\n[Agerman]\nAll on a motherfuckin bitch\nA.O.B. nigga\n\n[Hook] 4x\n\n[Outro: Agerman]\nHa ha ha, Yeah baby, I'm talkin to you\nDon't look around like you don't know who I'm talkin to\nIt's all on you, It's all on a bitch\nOh, Oh is that right? You wanna get my hair cut?\nOh, We can go right there on barren croff to jackie's\nI can get my shit cut for like $15\nIt's all ave, Oh oh, You wanna get me some Nike's Jordans on you?\nJordans on you? We can go right there to foot locker\nAnd it's my day to hook me up\nOh, That's right, I'm gon need a fit to go wit the shoes\nWe can go to old navy, It's all ave\nOh you know what? I'mma need a pager too\nAnd a Sprint PCS phone, Hook me up\nOh, It's all ave? Alright, Cool\nCool, We gon do this then baby\nYou know, I always wanted someone like you\nKeep on bein the way you bein\nAnd we gon be together for a long long time\nIt's all on a biatch"}], "artist": "Keak da Sneak"}