{"songs": [{"year": "1996-09-16", "image": "https://images.genius.com/df5993e7240948ae2aa2923976cfa558.597x597x1.jpg", "title": "Usual Suspect", "album": "Episodes of a Hustla", "lyrics": "[Big Noyd]\nYea, yea, yea, I didn forget about the Queensbridge mothafuckas\nRoll the Mobb Deep in this mothafucka, yea, yea\nMario drop the beat...yea, uh Rappin' Noyd\n'Bout ta destroy any man, woman, man, boy\nI don't give a FUCK, word is bond...\n\n[Hook*Big Noyd*]\n(check it out) Rough Neck, you soldeir suspect\nYou hear me boy, Recognize, Rappin' Noyd\nNow Destroy, nothing changed, blew you out the frame\nWas a small thing, I kept you shook\nCause you know my gat bang\n\nA usual suspect, a soldeir suspect\nYou hear me void, Recognize, Rappin' Noyd\nNow Destroy, nothing changed, I blew you out the frame\nWas a small thing, I kept you shook\nCuz you know my gat big\n\n[Big Noyd]\nMr. Untouchable, the unlovable, crimi-nul\nReppin' Queensborough, the rapper's back on another level\nMatter fact black, check the gat stats\nI keep access ta the max\nFor those who don't know, how ta act\nGet laid on they back, and its a fact\nYou bustin' me - Im bustin' back\nSo kid dance ta the track or analyze the rap\nBefore you get trashed-smacked-clapped and thats that\nIm strictly hardcore, even more than before\nWhen I was shooting up doors in Baltimore, try'na score\nNappy born hustla, the Hennessey guzala\nI been a-black-a-mothafucka\nDon't make me buck ya, the .9 pound I struck ya\n'9-6 you ask about this convict\nNiggas can't harm this, regardless\nNiggas claiming heartless, Easy for me ta tear\n'Par bitch, you don't want ta start this, Im lethal\nDon't make me jump up on the B.Q.E. and come n' see you\nYou best have your mothafuckin' people\nCuz when Im rollin' in the viga, strapped wit' my nigga\nWhen I see you, Im leavin' lead in ya liva\n\n[Hook*Big Noyd*]\nTo the Rough Neck, a soldeir suspect\nYou hear me void, Recognize, Rappin' Noyd\nNow Destroy, nothing changed, I blew you out the frame\nWas a small thing, I kept you shook\nCuz you know my gat big\n\nA usual suspect, a soldeir suspect\nYou hear me void, Recognize, Rappin' Noyd\nNow Destroy, nothing changed, I blew you out the frame\nWas a small thing, I kept you shook\nCuz you know my gat big\n\n[Big Noyd]\nNow one love ta the thugs on top\nPushin' rocks on the strip going out, bustin' slugs\nPumpin' rocks, do ya thing GOD\nWhoevers not involved get rid of 'em, finish 'em\nIm playing too close, snacks cut throat\nG-nota wrotes, use intellifent folks ta build blunts\nControl the .9, steady, ready - blow\nLet 'em know, dont be mad at me\nCuz you ain't as mad as me, you gradually grow hard\nAnd tear shit apart, shit I spark from the start, and regulate\nTakin' your body weight, I leave you critical\nThe .9's pitiful - blowing brains out\nEven aid they won't el' ver lift the stain out\nI blowing backs out, niggas ass out\nSo watch, what you doing\nIn them eyes you be screwing me wit'\nFuck around, lay around, make me empty my clip\nSay the non-sense, I got my click on the Do or Die, trip\nOnce I cock it, then I got this, now watch me lock it...\n...No Doubt Kid, now we out\n\n[Hook*Big Noyd*]\nTo the Rough Neck, you soldeir suspect\nYou hear me void, Recognize, Rappin' Noyd\nNow Destroy, nothing changed, blew you out the frame\nWas a small thing, I kept you shook\nCuz you know my gat big\n\nA usual suspect, a soldeir suspect\nYou hear me void, Recognize, Rappin' Noyd\nNow Destroy, nothing changed, I blew you out the frame\nWas a small thing, I kept you shook\nCuz you know my gat big\n\n[Big Noyd]\nDon't, take, it, personal\nIf it ain't about you, it dont apply - let it fly\nBut you guy, I gatta tear you up, from your asshole to your gut\nAnd if your click wanna flip, they gettin' bucked\nCuz my stealing, scab handeling is outstanding\nI be the thug bustin' slugs while yo tec jammin'!\nOne in the head, I can't stand it, but I gatta handle it though\nLeave you wet though, sweep the .44\nMake you take those and swallow those\nMy click a bunch of wild desperados\nStuck off the hydro, Hennessey rock hard\nWe got this shit lock all\nMy click strike back hard, an thats my word\nFuck around and have that ass in the sky\nWit' the birds, thats my word\nYou carry a gat, you think you that nigga please\nYou dont wanna feel none of these, hollow tips\nThat mack about ta spit, aw shit\nNoyd about ta get up on that buc-wild shit, the Infamous Mobb\n\n[Prodigy]\nThe most Infamous - Scarface - leave ya faceless\nGrip 'em, R.I.P. - but you still right here, wit' me\nG.O.D. part 3, Gotti on the mission\nH.A. - V.O.C., the clear vision\nT.Y. N.I.T.T. - Y. I dont know, But in due time\nAn tell Killer Bee - Gambino\nYo if we dont sell a million, we gonna stick chemical banks\nStraight up and down - this is how P. think\nKicko - long time no see, no doubt wit' outta doubt\nMoney long'll, knock 'em all the way out\nRappin' Noyd, jump the negro out for premises\nIller G, my eye-witness, eyes, hes got the dead on, lies\nA gradual lives a survive, we got diamonds - flooded up plenty\nPush GOD, civilized GOD - turn of the century shit\nWe can't take it, bless me wit' a high note, baby\nGOD brothers, Mic Check - crush something kid\n\n[Hook*Big Noyd*]\nTo the Rough Neck, a soldeir suspect\nYou hear me void, Recognize, Rappin' Noyd\nNow Destroy, nothing changed, I blew you out the frame\nWas a small thing, I kept you shook\nCuz you know my gat big\n\nA usual suspect, a soldeir suspect\nYou hear me void, Recognize, Rappin' Noyd\nNow Destroy, nothing changed, I blew you out the frame\nWas a small thing, I kept you shook\nCuz you know my gat big\n\nTo the Rough Neck, you soldeir suspect\nYou hear me void, Recognize, Rappin' Noyd\nNow Destroy, nothing changed, I blew you out the frame\nWas a small thing, I kept you shook\nCuz you know my gat big"}], "artist": "Big Noyd"}