{"songs": [{"image": "https://images.genius.com/dc8859718c8b912f6ac8d798eb3580c0.600x594x1.jpg", "lyrics": "(Khayree...)\n(What's up?)\n(...drop some dope on these fools.)\n\n[Verse 1]\nMy name is young Mac Mall, mayne, and this is my opinion\nAnd since I got your attention there's some shit I would like to mention\nFuck them punk ass rollers, them highway type of strollers\n'Cause they be wanting to bust them big fat caps in ghetto souljas\nI guess they wanna fold us, but see we won't just have that\nBecause I'm from the streets in '93 and playas bust back\nI might just be a dead man\nBecause I speak rebellion\nThey already did Malcolm X and Dr. King\nThere ain't no tellin'\nThe government they hatin me\nBut still I pack .380\nThat's why I won't put back\n'Cause Uncle Sam, he never paid me\nSoon as they try to fade, then today's their pay day\nI'm standing in the cuts fuckin' it up with my AK-\n47 ways them black brothas won't behave\nAnd since I'm stressed I'm on the quest to put them in their grave\nI'm trying to go to school but the system wasn't havin' me\nSome say it's technicality but this is just reality\nIn 1992 you know how crazy I was feelin'\n\n[Hook]\nMy name is young Mac Mall, mayne, and this is my opinion\nThis is my opinion[x4]\n\n(Aww man, Mac Mall why you comin' like that, mayne?\nYou know thats that shit, mayne, straight from the Crestside, mayne\nYou know they can't fuck with this, mayne; uhhh, that's that shit!)\n\n[Verse 2]\nMy name is young Mac Mall, mayne and this is my opinion\nI had to set up shop, but it ain't rocks that I be dealin'\nThe ghetto type of feelin', the drug money and killin'\nI speak in a playa style, it's gon' make me a million\nI'm tryna live very happily but fools be wantin' to cap on me\nThat's why up under my coat, it's something dope\nThen I be packin', G\nIt's gonna be a tragedy on your whole family\nSo call them punk police, them little old pussies can't even handle me\nYou might think I'm a criminal, but this is not subliminal\nI'm tryna spit that knowledge to my folks but you don't hear me though\nSome might think I rock gang fuss, but all I want is justice\nAnd my chance to get on the mike and spit game to these hustlas\nAnd if you like the realness\nYou might think this appealing\n\n[Hook]\nMy name is young Mac Mall, mayne, and this is my opinion\nThis is my opinion[x4]\n\n(Haha, yeah though nigga, that's that shit though\nYou mothafuckas need to hear the shit he spitting though\nBut you don't hear it though, you just some little old punk mothafuckas, mayne\nHe spitting that real Crestside Sawyer Street playa type shit, mayne\nMothafuckas. I don't give a fuck 'cause I'm hitting this shit mayne, haha, biatch, biatch, biatch!)\n\n[Verse 3]\n'Cause now I got my chance, to speak my opinion freely\nThey need to fit on blinders 'cause these fools don't want to see me\nI'm poppin' like a preemie, sometimes I wear a beanie\nIt's on like that told ya 'cause that doja got me dreamy\nWhen fools be pimpatratin', it's causin' me frustration\nAnd there's no hesitation in a snitch assassination\nMac Mall is just a youngsta, hustla, thugsta\nBut if you fiend for dope ass raps, fool I'mma plug ya\nAnd them mothafuckas, them brothas\nIs from another planet\nThey must don't understand it, how they take they life for granted\nSo tell me, can you really fuck with this young buck?\nI take you on a ride in the trunk tied up\nAnd with luck, maybe they can find ya, and sign ya\nOff as a loss 'cause you tossed of Carquinez\nBridge, and if you live, make dibs on the wood box\nI be kicking the Rasta shit and don't sport the dreadlocks\n\n'pinion, 'pinion, Mac Mall, mayne, and this is my opinion\nOpinion, opinion, my name is young Mac Mall, mayne, and this is my opinion\n\n(Uh, Mac Mall, man, that shit is so muthafuckin' vicious, mayne. You know that's that pimp shit, mayne. What's up, mayne? Could I be down with the muthafuckin' SES Faculty, mayne? Come on, man, take me to the Sawyer strip, mayne. I need some of that doja, mayne.)", "year": "1993-07-12", "album": "Illegal Business?", "title": "My Opinion"}], "artist": "Mac Mall"}