{"songs": [{"album": "Prenuptial Agreement", "year": "2010-01-12", "title": "Rockin wit the best", "image": "https://images.genius.com/120e77f1186060bdc73f0c721ba49267.1000x1000x1.jpg", "lyrics": "Thinkin' like the brain, finna take over the globe\nI run this, what nigga, you ain't know?\nFive foot four, what I'm a fuckin' a C.E.O\nGive my bitch good dick every morning like it's cereal\nYou nigga is starvin, y'all can hoola-hoop and cheerios\nMy paint wet, nigga drippin' like a jerry-curl\nSmoke a lil' bit of purple store a lil' bit of grill\nI be in my own world, countin' all this dope money\nFlyin' than a mothafucka, you don't hear a nigga tummy\n[?] yes I got it on me now\nReally, I'm the flyest mothafucka in your whole town\nI can pitch it off the mound, I can run a kickback\nCypress Village, West Oakland where I did it all that\nYes it comes the freshest\nThe rest of you niggas fall back\nPlus I keep a big strap where my draws at\nYou niggas poppin' too many pills\nY'all need to relax\nRockin with' me, you rockin' with the best\nPaint glare. So fresh\nThe rest of these niggas can't even dress\nThe rest of these niggas a hot mess\nRockin with' me, you rockin' with the best\nPaint glare. So fresh\nThe rest of these niggas a hot mess\nThe rest of these niggas can't even dress\n\nI be gettin' blown like a sack while the lights on\nI'm too prone to kicks, money, weed, and bitches\nSlide through, did a little rippers jigger\nCause' they ain't never see a nigga worth six figures\nMajor League, all-star, real hitter\nLittle jigger, guns way bigger\nTalk behind my mack, back down from no nigga\nPaper to the ceilin' all from drug dealin'\nBut I'm finna go and get a good deal, if God willin'\nCypress Village, chillin', livewire killin'\nFind me in the East in the high-roll building\nMe and the ghetto children, bitch I make power moves\nSo when you talkin' to a boss change yo' attitude\nIt's written all on your face\nI can see the rat in you\nYou the type of nigga can't hide the Jay Cat in you\nBut every time you see me, I'm on them big shoes\nRockin with' me, you rockin' with the best\nPaint glare. So fresh\nThe rest of these niggas can't even dress\nThe rest of these niggas a hot mess\nRockin with' me, you rockin' with the best\nPaint glare. So fresh\nThe rest of these niggas a hot mess\nThe rest of these niggas can't even dress\n\nHype for the bitches,.40 for the haters\nGot my dick in your bitch, smokers, nigga I'm the greatest\nI did a hundred thousand, yeah, nigga that's the latest\nGet it like ball-players, it's the West Oakland mayor\nNigga I was flippin' chickens all through High School\nLeave a nigga shirt red like he pyro\nKill a nigga career like 50 did Ja Rule\nI was at the table with a mothafuckin' razor blade\nBefore tapers, when niggas was wearin' fades\nBefore scrapers, before the Hyphy Movement\nThe dope game; nigga I was true to this\nSo who you with? I just need an ice pick\nBreak a corner off the brick, now I'm distributing it\nCall it Wayde money. Need a trash bag for this shit\nI'm finna blow, I'm just lookin' for the right look\nBut in the mean time, I'm gonna stay on some fly shit\nRockin with' me, you rockin' with the best\nPaint glare. So fresh\nThe rest of these niggas can't even dress\nThe rest of these niggas a hot mess\nRockin with' me, you rockin' with the best\nPaint glare. So fresh\nThe rest of these niggas a hot mess\nThe rest of these niggas can't even dress"}], "artist": "J. Stalin"}