{"songs": [{"year": null, "image": "https://images.genius.com/8979e195a075754dfc6965f7356b0293.700x700x1.jpg", "title": "Plastic Cups", "album": "Rapper’s Delight", "lyrics": "[Intro: Rapper Big Pooh]\nYeah! Rapper! Joe Scudda! Chaundon! Yo! Uh! Uh!\n\n[Verse 1: Rapper Big Pooh]\nYo, I flow liquid, Poobie been gifted\nWrote it in my manual watch how I shift it\nNo breaks, two takes at the max\nHeavy on facts got me cruisin at a slow speed\nHaters watch from afar and catch nose bleeds\nOr do some Big Syke shit like have your car keys\nA bad seed tryin to do good\nNiggas can't cause they too hood, I'm too nice!\nI'm steady rollin like two dice\nYou now starrin at a fresh slice, for my old man\nRapper tryin to touch old grams\nPut a couple on the stand keep my people out of prison\nThey praise me faithfully no religion\nI thank God everyday what's He's givin\nI'm livin, no glamourous life\nAin't nobody sayin, \"Yeah Rapper, you do that light!\"\nI do this right! You lookin at the sun\nOr you lookin at the one and the rest is flash lights\nSomebody tell these pussy niggas good night\nI'm like a pair of stretch jeans homey - extra tight!\nGet it right or get it right where you stand\nI say I'm on the mission my nigga I'm not playin!\nShoutout to Ronnie J what's up\n\n[Hook: in tune to J Dilla's \"Love Movin'\"]\nWe keep it ghet-to with the plastic cups\nI keep it ghet-to with the plastic cups\nReal ghet-to with the plastic cups\nWe keep it ghet-to with the plastic cups\nR.I.P. Dilla Dog nigga that's wassup!\n\n[Verse 2: Joe Scudda]\n(J-O) Aiyyo, dirty crib, dirty car, dirty clothes\nGot bent, spent nights with dirty hoes\nSmoke weed, eat food off a dirty dish\nMy P.O. said, \"Joe, you got dirty piss\"\nI'm nervous, a hundred and twenty hours of service\nFor the community, yo where's the immunity?\nBut it beats jail time, I can't do cell time\nMy man passed his test, how I failed mine?\nGood ass lawyers and the money to pay it\nFuck a bitch-ass court-appointed, the state coulda say it\nHe ain't pick up the phone, even left me a loan\nFuck I need you for?! I can do bad on my own\nGot me pickin up trash, my whole summer is gone\nSeventeen years old, man I\nShoulda been home\nInstead of out doin dumb shit, I wanna do fun shit\nGo to house parties with the cats that I run with\nGet drunk, smoke weed, party and pass out\nSleep in late instead of takin the trash out\nWorkin for free, I need to work with a fee\nThis community service shit just ain't workin for me\n\n[Hook: in tune to J Dilla's \"Love Movin'\"]\nUh, I keep it ghet-to with the plastic cups\nWe keep it ghet-to with the plastic cups\nReal ghet-to with the plastic cups\nR.I.P. Richard Pryor nigaa that's wassup!\n\n[Verse 3: Chaundon]\nUh - Bronx Bomber turned Carolina Hurricane\nWord is he's the next shit, yeah I heard the same\n{?} the beat, certified the murder game\nMost wanted MC, niggas know the name\nGhetto celeb, the broad on my arm\nBottle of Dom, light the block up then I'm gone\nChaundon! - The muh'fuckin voice of the street\nJ Dilla still wit us, ressurected through beats\nPoster boy the success, the face of B-X\nSoul of New York, won't expect anything less\nStill walk wit a Diddy Bop, through any city block\nFlash a smile to a pretty young thing that make her kitty hot\nPardon me y'all, I'm blessed with the charm\nSurrounded by chicks as if I'm on the Purdue farm\nI get it on! Make no mistake, there's only one\nChaundon, Boogie Down's in the house and I'm DONE!!\n\n[Rapper Big Pooh - Outro]\nI had a dream bout my man last night...\nAnd he said, my nigga Big Dho, that's wassup\nTo my man Jacee, that's wassup\nTo my main man Khrysis, that's wassup\nTo my nigga Don Cannon, that's wassup\nTo my man Phonte, that's wassup\nTo DJ Sense, that's wassup\nTo my nigga Chaundon, that's wassup\nTo DJ Drama, that's wassup\nTo my homegirl Jenise, that's wassup\nTo my man Joe Scudda, that's wassup\nTo my homeboy Ness, that's wassup\nTo my man Fat Dame, that's wassup, uh-ha!\nWillie the Kid, that's wassup\nTo my DJ Flash, that's\nWassup\nUh, DJ Jamad, that's wassup\nTo my man Ox Banger, that's wassup\nUh, Amanda Diva, that's wassup\nTo my man Bun B, that's wassup\nTo my nigga Rhymefest, that's wassup\nTo my man Bumpy Knuckles, that's wassup\nTo my man Premo, that's wassup\nTo my man Pete Rock, that's wassup\nTo my man Grapp Lover, that's wassup\nTo my main man Nottz, that's wassup\nYeah, we keep it ghet-to with the plastic cups\nWe keep it ghet-to with the plastic cups\nReal ghet-to with the plastic cups\nUh, yeah, that's wassup!"}], "artist": "Rapper Big Pooh"}