{"songs": [{"album": "Sickology 101", "image": "https://images.genius.com/081166dc5d132ad1d3549578cac249e0.1000x1000x1.jpg", "year": "2009-04-28", "title": "Blown Away", "lyrics": "[Intro: Tech N9ne]\nI know y'all don't see me on TV\nOr hear me on the radio\nBut you industry brats\nBetter check billboard and polestar\nBefore y'all get to cryin'\nAbout who get seniority at these shows\nEspecially when compared to me\nY'all ain't shit on stage\n\n[Hook]\nI hit the stage, grab the mic\nAnd blow 'em all away, I blow 'em all away\n(Superstars) But they know I blow 'em all away, hey\n\n[Verse 1: Tech N9ne]\nThe gig is over, the gig is over (Bitty bye-bye)\nThe gig is over, the gig is over when (Ayy, play)\nThe kid is older and gettin' colder (Many fly by)\nBut his will hold you, so listen closer to\nA-A-R-O-N, they dissin' and twistin' my name\nBecause Aaron is scarin' these glitz spittin' pricks in the game\nHit with this gift, everybody get a whiff of this script and it's pain\nGotta talk about the people with an attitude\nWho hiss me and slipped in my lane\nI've been wrecking crowds for a long second now\nGot 'em guessin' how Tech is blessed\nAnd yes, the best in-town rep\nI'm the real, I keep it trill and when I spit\nI ain't spillin' 'bout my million, it's the feeling that you get\nWith this underground headliner, mainstream ignored a bro\nAnd they be petty, so jealousy is sure to show\nBut they rich and got more to blow and every thing's affordable\nBut they gotta go before me because their stage show is horrible\n\n[Hook]\nI hit the stage, grab the mic\nAnd blow 'em all away, I blow 'em all away\n(I blow 'em all away, I blow 'em all away)\n(Superstars) But they know I blow 'em all away, hey\n(I blow 'em all away, I blow 'em all away)\nThey may be platinum, but they know\nI blow 'em all away, I blow 'em all away\n(I blow 'em all away, I blow 'em all away)\n(Superstars) But they know I blow 'em all away, hey\n(I blow 'em all away, I blow 'em all away)\n\nWhy you do me like that girl?\nYou know, I love your mama\n\n[Verse 2: Tech N9ne]\nI just wanted to have a bite with her or somethin'\nDidn't go get up on that show to fight with her or nothin'\nIt was Keyshia Cole, Eric Benét, Gorilla Zoe, Tech N9na and T.I\nBut Keyshia was actin' bia-bia\nWhy she actin' like a (What?), like a (What?)\nShe ain't know I grab the mic and light it (Up), light it (Up)\nShe say, \"She don't know me\"\nBut I'm the number one independent in the country\nMan, she the only one actin' funky\nAnd the people at the summer jam, they want me\nShe say, \"She ain't going on before somebody that's local\"\nAnd she went postal and loco, saying, \"her not closing, is a no-go\"\nDown talked me real low though\n'Bout how she got more doe and just did a TV promo\nNo show better than the MO bro with the S and M logo\nDamn baby, much success is sittin' in your favor\nSlam the N9na Tech before considerin' the data\nFans waited, so we went, so she'd get it for later\nBut Frankie said, \"Excuse my daughter, she's a bit of a hater\"\nDwamn!\n\n[Hook]\nI hit the stage, grab the mic\nAnd blow 'em all away, I blow 'em all away\n(I blow 'em all away, I blow 'em all away)\n(Superstars) But they know I blow 'em all away, hey\n(I blow 'em all away, I blow 'em all away)\nThey may be platinum, but they know\nI blow 'em all away, I blow 'em all away\n(I blow 'em all away, I blow 'em all away)\n(Superstars) But they know I blow 'em all away, hey\n(I blow 'em all away, I blow 'em all away)\n\n[Verse 3: Tech N9ne]\nAyy, ayy, check it, I understand seniority\nBut in this case, on this show, I'm a top priority\nIn Lawrence, you're minority and I'm the majority\nCheck it, I was young and broke\nBut I'd fetch it, if it was freshest\nShoveled snow for the Eric B. and Rakim record\nPromoters called us and said\n\"We got this show and want you to close us\"\nGhostface and Brother Ali rockin' with a band in 'Sota\nWe couldn't wait to see Rakim rock, but he never ever showed up\nHe swole up 'cause he didn't wanna go up before us\nMan, what's wrong with these people?\nThink that the world gotta kiss their asses\n500 capacity but you wanna get 200 passes\nThought it was about gouda, 40 Water told me\n\"N9na, get your cabbage, stay savage and ravage the average\"\nY'all better hope radio and video\nKeep me from slithering into they circle\nI'll change it, that's why they shivering\nRakim the god? He just missed the king's delivering\n'Cause they know they'll fall\nAnd I'll blow them all to smithereens\n\n[Hook]\nI hit the stage, grab the mic\nAnd blow 'em all away, I blow 'em all away\n(I blow 'em all away, I blow 'em all away)\n(Superstars) But they know I blow 'em all away, hey\n(I blow 'em all away, I blow 'em all away)\nThey may be platinum, but they know\nI blow 'em all away, I blow 'em all away\n(I blow 'em all away, I blow 'em all away)\n(Superstars) But they know I blow 'em all away, hey\n(I blow 'em all away, I blow 'em all away)\n\n[Outro: Tech N9ne]\nReal, real spill, yeah, baby girl\nI know I ain't the only one that know you could be bitchy\nYou know what I'm sizzlin'?\nOl' boy, I know I ain't the only one that know you could be bitchy\nDo your research before you down somebody else\nGet off your high horse\nKeyshia Cole, get off your high horse\nRakim, get off your high horse\nIndustry, get off your high horse\nYeah"}], "artist": "Tech N9ne"}