{"artist": "OG Kid Frost", "songs": [{"image": "https://images.genius.com/54f9deaabb5422c3c966f58fecec24c7.600x600x1.jpg", "title": "Ya Estuvo (That’s It)", "year": null, "album": "Hispanic Causing Panic", "lyrics": "[Produced by The Real Richie Rich & Will Roc]\n\nYa estuvo? You're stupid!\nYa estuvo, holmes - Ya estuvo!\nSo what do that mean?\nMan, I ain't got time to xplain that to you right now cause I'm running this one down for other latinos in the house\nHey look man, you gotta at-least tell me what ya estuvo mean, what do that mean?\nMan ya estuvo means that's it, that's all, it's all over for you, man\nYa estuvo!\"\n\nListen to the words and pay attention\nThere is no better style in the *corazon? that I mention\nSee I'm going up I'm gonna fly like a plane\nAnd you can't stop the plane or *action train?\nSee I have the power to provoke a opposition\nWho's waving up to battle me for this position\nYou're not gonna win, you're a sissy so let's do this\nMy mouth's like a gun that's gonna fill you full of bullets\nIf you're my adversary listen to what I'm saying\nI'm living positive not negative in any way and\nI'm loving what I'm doing\nCause I'm saying what I'm feeling\nEverything that I'm saying is a fact, it's all real\nI believe in my self that's why I'm here today\nNot everything was easy who said it'd be that way\nIf you don't change now - the harder it'll get\nIf you don't wanna listen to me\nYou'll suffer and thats it!\nYa Estuvo!\n\nOh, so it's like that? Yeah that's kinda dope.\"\nWell watch this, man I'm gonna bust this one on the switch move - for all the biolengual people in the house, ya'll know what time it is, uh!*Spanish of which meaning is halfly under my subconcious, and some parts I percieve\n\nYa estuvo huh? Ya estuvo?\nYeah, that's right Will, ya estuvo - that means that's it, it's all over\nOh, okay. Well do this then - take your next *8 bars?(lyrical rows?) to the south of the border, and serve it up in Spanish\nYeah, aight man, you bet\n\nSpanish of which meaning is halfly under my subconcious, and some parts I percieve\nAight hold it... Hold it... Hold it! That was fly - now bust it in English\n\nOne more time in English I'll tell ya this\nStraight from L.A. coming direct that is\nAnd no I don't lie because I'm honest and true\nYes my style of rappin' gets respect from you\nSee the guys think they're wise\nBut the women are always screaming\nAnd everybody's dancing\nNoone seems to be sitting\nYes that's what happens with the number one hit\nYou listen to the music and dance and that's it\nYA ESTUVO!\n\nHaha, yeah! Kid frost definately in effect - bringing you the funkiest sound for the 90's... Ha-haaaa, yeaahh!\nYa estuvo! That's it!"}]}