{"songs": [{"lyrics": "[Intro: Jay-Z & Too $hort]\nUh-huh\nThat's right\nIt was all good just a week ago\nUh-huh-uh, it was all good just a week ago\nLast week I had everything\nUh, uh-huh-uh, had this all good just a week ago\nI had the money.. had the cars, the bitches\nUh-huh, yeah, it was all good just a week ago\nAnd the jewelry..\nAnd then my motherfuckin' niggas started snitchin'\nUh-huh, uh uh, yo, yo\nBeatch!\n\n[Verse 1: Jay-Z]\nGrowin' up in the hood, just my dog and me\nWe used to hustle in the hood for all to see\nProblems; I called on him, he called on me\nWe wasn't quite partners, I hit him off my P\nLet him unlock doors off my keys\nYeah, we spoke, much more than cordially\nMan, he broke bread with me, my business spread swiftly\nThe Feds came to get me, we both fled quickly\nWasn't quick enough to jump over the hedges with me\nGot caught, and that's when our relationship strayed\nUsed to call me from the joint 'til he ran out of change\nAnd when he called collect and I heard his name\nI quickly accepted, but when I reached the phone\nHe's talkin' reckless, I can sense deceit in his tone\nI said: \"Damn, dog! What, nine weeks and you're home?\"\nHe said: \"Main man, you think shit's sweet 'cause you're home.\"\nI just sat, spat no more speech in the phone\nThem crackers up there bleachin' your dome, you're reachin'\nI said: \"The world don't stop, I got to keep..keep on.\"\nFrom there I sensed the beef was on\nI ran to the spy store to add some more features on my phone\nTo see if I had bugs and leeches on my phone\nCan't be too safe, ‘cause niggas is two-faced\nAnd they show the other side, when they catch a new case\nIt's on\n\n[Chorus: Too $hort + Jay-Z]\nIt was cool when you had hella weed to smoke\nAnd you bought a new home where you could keep the folks\nI don't see how this side of you could be provoked\nUh-huh, uh-huh, it was all good just a week ago\nFunny what seven days can change\nA stand up nigga, now you sit down to aim\nUsed to have a firm grip, now you dropping names\nIt was all good just a week ago\n\n[Verse 2: Jay-Z]\nLike I put the toast to your head and made you sell\nWe both came in this game, blind as hell\nI did a little better, had more clientele\nTold you put away some cheddar, now you cryin' for bail\nSeventeen and I'm holdin' on to around a mill'\nI could bail out, blow trial and come around on appeal\nHad niggas thinkin' I was from uptown for real\nI had so much hustle, plus I was down to ill\nLike a Brooklyn nigga, straight out of Brownsville\nDown and dirty, down to fight to round 30\nFreezin' on them corners, still holdin' my crack\nLookin' up and down the block, the fuck is the dough at?\nCame from flat broke to lettin' the dough stack\nYou tell them Feds I said: \"I'm never going back\"\nI'm from Marcy, and Marcy don't raise no rats\nYou know the consequences of your acts, you can't be serious\n\n[Chorus: Too $hort + Jay-Z]\nIt was cool when you had hella weed to smoke\nAnd you bought a new home where you could keep the folks\nI don't see how this side of you could be provoked\nUh-huh, uh-huh, it was all good just a week ago\nFunny what seven days can change\nA stand up nigga, now you sit down to aim\nUsed to have a firm grip, now you dropping names\nIt was all good just a week ago\n\n[Verse 3: Jay-Z]\nThe lawyer I retained you said you leakin' some things\nAll this after a week in the bing\nI'm mad at myself, 'cause I didn't spot the weakling\nI would've bet the house you wouldn't speak a thing\nNigga, this was the oath, to the top or broke\nEven pricked our finger, anything that got between us\nWe supposed to cock the ninas, what happened to that?\nInstead you copped out to a misdemeanor\nFuck it, the same thing make you laugh make you cry (that's right)\nThe same game that make you math could make you die\n(That's life) It's a dice game, and sometimes you crap\nWho would've thought you'd get popped one time and rat?\nNow you know that's bad when your sister is mad\nAnd your son gotta grow up, like, \"This is my dad?\"\nThe labeling of a snitch is a lifetime scar\nYou'll always be in jail, nigga, just minus the bars\n\n[Chorus: Too $hort + Jay-Z]\nIt was cool when you had hella weed to smoke\nAnd you bought a new home where you could keep the folks\nI don't see how this side of you could be provoked\nUh-huh, uh-huh, it was all good just a week ago\nFunny what seven days can change\nA stand up nigga, now you sit down to aim\nUsed to have a firm grip, now you dropping names\nIt was all good just a week ago\n\n[Outro: Too $hort]\nShit is crazy man\nAll these niggas out here snitchin'\nWe was one step away from takin' this crack money\nAnd recyclin' it through the ghettos\nAnd buildin' back up our own hoods\nNow all you niggas start snitchin' on each other\nI got partners doin' 15-20\nWouldn'ta been doin' SHIT\nIf you didn't snitch, beatch!\nIt's about time y'all check that shit out man\nIt ain't all good, shut your mouth\nJust watch the game\nAnd don't snitch\nWe'd sure go a lot whole further\nBelieve that baby\nJay-Z, Short Dawg's in the house mane\nYou know I got it\nGot it goin' on\nWe got the money\nAin't got nuthin' to do with crime baby\nBut I'm recognizin'\n\n[Jay-Z]\nYou rat bastard!", "title": "A Week Ago", "image": "https://images.genius.com/1f3b917b779cd80ad127e64f21d6010a.1000x1000x1.jpg", "year": "1998-09-29", "album": "Vol. 2… Hard Knock Life"}], "artist": "JAY-Z"}