{"artist": "Prince Paul", "songs": [{"album": "A Prince Among Thieves", "title": "Showdown", "image": "https://images.genius.com/230cf5d5c8017fd92d4ecaace8ad793b.500x500x1.jpg", "lyrics": "THE REV: Okay, son. I’m gonna get ya out. The captain owes me a favor. Plus, they had no search warrant. Just promise me I’ll see you in church on Sunday\n\nTARIQ: Okay, Reverend. Thank you\n\nTARIQ (NARRATION): Thank God the Reverend got me out. I only had a day ’til my meeting with the Wu, and I’m far from ready. So I decided to call him to get a few extra days to get my shit together\n\n[*dial tone, phone picks up*]\n\nWU-TANG RECEPTIONIST: Wu-Tang…\n\nTARIQ: This is Tariq. Let me speak to the god\n\nWTR: Let me see if he’s in. Please hold…\n\n[*hold music, phone picks up*]\n\n[*Tariq’s demo plays in background*]\n\nRZA: Tariq, what up, son?\n\nTARIQ: Peace, god. Yo, I just wanted to tell you something about tomorrow\n\nRZA: Yeah, yeah, yo, the man Tru is right here. He just came through, what, with his beats, you knahmsayin’, he made. It’s kinda fat what he got right here. Word, lyrics, yo— He got some lyrics right here. Yo, ‘Riq— Yo, ‘Riq, check it out— Yo— Believe I give your man the deal real quick, nah mean? Sign him up, blow him up, yo. You prolly gon’ do a joint on his album, on his LP or something. Blow up with him, nah mean?\n\nTARIQ: HIS album?\n\nRZA: Yeah, yaknahmsayin’, ‘Riq? ‘Cause, yo, right now, you know, at my label, I got room for one more motherfucking act. Got room for one more act. I know that you and your— you— you and your man, Tru, y’all boys, but I know you doing your own thing, you got some other things going, so, you know, I’ma sign your man Tru real quick. I know you’ll be cool with—\n\n[*Tariq hangs up*]\n\nTARIQ (NARRATION): That was definitely the last straw. Tru stole my record deal, got me busted… What the fuck? It was time to deal with Tru on his own level\n\n[*gun cocks*]\n\nTARIQ (NARRATION): So that night, I went to Tru’s house and waited. Until finally, he pulled up…\n\n[*car driving up, parking; door opening & shutting; footsteps, car locking*]\n\nTRU: Ayo, Tariq, what’s up, brother? What you doing here?\n\nTARIQ: What am I doing here? You know what the fuck I’m doing here! You set me up, bitch!\n\nTRU: Set you up? Man, you fuckin’ buggin’!\n\nTARIQ: Nah! Nah, Tru! You buggin’! The cops was at the hotel you told me to be at! Coincidence? I don’t know. Everybody seen my fuckin’ résumé. What’s going on with that? What’s up with using my fuckin’ beat to get that deal with the Wu? What’s— What the fuck is going on? I thought we was s’posed to be like brothers!\n\nTRU: Ayo, fuck you. Why you always gotta get the breaks, huh? Record deals, fly drug sales. Boy, I taught you the game! I taught you how to rhyme! You ain’t nothing without me! But fuckin’ Tariq gotta show his ass all the time. Gotta outdo me. Nah. Not anymore, bitch! Tomorrow, I sign that record contract, and if you lucky, I just might let your punk ass rhyme a sentence on that motherfucker\n\nTARIQ: You ain’t signing a fucking thing if me and this fucking .380 can help it!\n\n[*gun cocks*]\n\nTRU: Oh, you gon’ pull a gun out on me? You ain’t even know how to hold that bitch until I showed you. Oh, look. Now my neighbors looking!\n\nTARIQ: What? Neighbors? Wh— Where?\n\n[*Tru’s gun cocks*]\n\nTRU: Damn, you stupid! Now what you got? It’s either gon’ be me or you, bitch!", "year": "1999-02-23"}]}