{"artist": "50 Cent", "songs": [{"album": "War Angel LP", "image": "https://images.genius.com/ddcb110037c817943db4819e7ee6759a.600x600x1.jpg", "title": "C.R.E.A.M. 2009", "lyrics": "[Produced by Digga]\n\n[Intro]\nYou wanna smoke that? Go 'head, roll it, son\nI don't give a fuck, man, smoke that shit, man\nOr you can smoke crack if you wanna smoke crack\nI don't give a fuck what you wanna do, man\nDon't look to me to stop you, man\nYeah, I'm not gettin in the way\n\n[Hookt]\nCash rules, I keep a shooter 'round me\nQueens get the money, I have a nigga killed y'all (killed y'all)\nKill the hood, ask niggas 'bout me\nJesus, for the money, niggas'll go real hard (real hard)\n\n[Verse 1]\nYou are now under my hypnosis\nSummertime grind, come out with the toasters\nI return like an animal ferocious\nNew money breeds, new enemies, nigga you know this\nAnother mil', another nigga sick\nI got nothing but hard dick for your bitch to lick\nI box unorthodox, southpaw, outlaw, bricks of raw\nI'm out in the drought, I make the dope price soar\nShit cool 'til the mac out, run when it back out\nA nigga finna blackout, better pray that bitch jam\nIt's in God's hands, it's all God plan\nYou mean even when a nigga gettin smoked, goddamn\n\n[Hook]\n\n[Verse 2]\nI push my pen with passion, I'm the author of the struggle\nWhen pain is a head crack, the sign of the devil\nTrip' 6-6-6, I'm back on my bullshit\nSee clear through my third eye, it's gon' be a murder\nEvery summer, every winter, every spring\nYou think I'm bullshitting, I put that on everything\nThe shooting gon' stop right after the shit-talking\nI was selling crack while Mike was moonwalking\n20 off a pack, I stack, I can't call it\nI blast ya like NASA, Jack, you outta orbit\nI mean you outta order, you don't want me to send a nigga to you\nSo he could put some hot shit through you, do you?\n\n[Hook]\n\n[Interlude]\nYeah, I'm back, baby, I'm back\nNew shit, the drought over, new product\nYeah, man I can't fit in with these niggas, man\nI mean niggas got mohawks, they wearing skinny jeans, man\nI think these niggas is faggots, man, for real, man\nThey with the rainbow club, man\nYou think this shit is a fad? Come on, man\nI think it's more than that, man\nI think it's more than that\nSo if a nigga wear a dress you gon' put on a dress too?\nCome on, man\n\n[Hook]", "year": null}]}