{"songs": [{"year": "2016-12-09", "image": "https://images.genius.com/595a5c53c72195068baa3a2331acf4ef.1000x1000x1.jpg", "title": "24 Karat", "album": "Imperator", "lyrics": "Ah!\n\n[Part 1]\nIch mach' aus Rappern Stricher\nIhr kleinen Fische müsst beim Hai nun abdrücken wie'n Westernfilmstar\nSonst seht ihr 'ne Menge Finger an Handguntriggern\nUnd geht vor den Läufen in die Knie wie Wettkampfsprinter\nRufen alte Freunde an, dann steckt Geld dahinter\nAls wär'ns die Rembrandtbilder in meiner Penthousevilla\nGeht ihr weiter ghostwriten, ihr kleinen Quentin Millers\nIhr wirkt lächerlicher als Ben Stiller im Gangsterthriller\nIch lass' mir Oktopus servier'n, geh' deine Tochter penetrier'n\nPack' den Kanadacock aus, sie muss fast im Schockzustand krepier'n\nNur grad mit Ach und Krach den halben Cock zu inhalier'n\nKriegt die jammernd auf die Kette wie der Boss beim Juwelier\nWillst du Opfer Stress mit mir\nDann hast du 'n Sockenschuss, als ob ich dir per Glockschuss die Pantoffeln perforier'\nStoff wird importiert\nWenn Gs Kilos woll'n, dann muss ich die bestell'n wie mein Pitbull, den ich als Schlosswachhund dressier'\n\n[Hook]\nDie Platten sind aus Gold, die Magnum ist aus Gold\nMusste husteln für Erfolg, ich weiß nicht, was ihr von mir wollt\n24 Karat, 44er Colt\nSag Bescheid, wenn eine Kugel dein Hirn durchsieben soll\n24 Karat, 44er Colt\nSag Bescheid, wenn eine Kugel dein Hirn durchsieben soll\nDie Platten sind aus Gold, die Magnum ist aus Gold\n24 Karat, 44er Colt\n\n[Part 2]\nIch tick' Ecstasypille um Ecstasypille\nAn deine Freundin, die Jessi, und deine Ex, die Sybille\nEröffne dann zwecks Geldwäsche Wellnesssalons\nDenn ich tick' mega viel Es wie XXL-Restaurants\nPelzmäntel von bedrohten Raubkatzenbabys\nWie die Frau'n gaffen ist saukrasses Augapfeltraining\nIch bin kaulquappenähnlich, weil ich schwanzgesteuert bin\nGeb' Schlampenmäulern Pint und sie liegen in Krankenhäusern drin\nWeil ich bekannt in Deutschland bin für'n gewaltigen Powerpenis\nUnd Hoes vorm Ballern stets aufgedreht sind wie Schalldämpfer auf MGs, Bitch\nIhr könnt alle nach Hause geh'n, ich fahr' beim Drive-By vor mit Magnumpistol'n\nYeah, ich find' die Waffen spitze wie Steinzeitforscherarchäologen\nCrimetime, hohe Schadensprognosen\nEy, warum läuft der Shit hier nicht im Radio? Ich muss mal 'n 1LIVE-Moderator bedroh'n\nDein Weib stalkt mit Stasimethoden\nDas geht mir übelst auf die Eier als bekäm' ich 'nen Muay-Thai-Sportlerschlag in den Hoden\n\n[Hook]\nDie Platten sind aus Gold, die Magnum ist aus Gold\nMusste husteln für Erfolg, ich weiß nicht, was ihr von mir wollt\n24 Karat, 44er Colt\nSag Bescheid, wenn eine Kugel dein Hirn durchsieben soll\n24 Karat, 44er Colt\nSag Bescheid, wenn eine Kugel dein Hirn durchsieben soll\nDie Platten sind aus Gold, die Magnum ist aus Gold\n24 Karat, 44er Colt\n\n[Part 3]\nDu rufst „Jesus Christ“ wie'n Bibelkreis\nSiehst du mein Schloss, denn das Ding ist ein Riesenteil\nUnd die Inschrift „Der Boss ist immer siegesreich.“\nIst auf dem Marmorbogen zu seh'n wie'n Liebespfeil\nDu findest das „King“-Ding aufgesetzt wie bei Krönungszeremoni'n\nBis du mit bösen Prellungen stöhnend in Fötusstellung da liegst\nLöwenfell am Kamin, Königszepter, Massiv-\ngold, Antikholzmöbel, ich vögel' relativ viel\nUnd Bitches sagen: „Das' aber mal'n harter Bosscock.“\nWie hart genau? „Hart, so wie Ragnarr Loðbrók.“\nGenauer! „Na, hart wie'n Stahlbetonblock\nOder 'n Tag im Arbeitslager in Wladiwostok in Stalins Ostblock\nBoah, zufrieden?“ Ja, Bitch, zufrieden!\nIch park' den Q7 vor Versaceboutiquen\nWenn mein Gärtner mit dem Gartenschlauch die Dornenzweige sprengt\nUnd dabei Rosen zertrampelt, wird er vom Don entzwei gesprengt\n\n[Hook]\nDie Platten sind aus Gold, die Magnum ist aus Gold\nMusste husteln für Erfolg, ich weiß nicht, was ihr von mir wollt\n24 Karat, 44er Colt\nSag Bescheid, wenn eine Kugel dein Hirn durchsieben soll\n24 Karat, 44er Colt\nSag Bescheid, wenn eine Kugel dein Hirn durchsieben soll\nDie Platten sind aus Gold, die Magnum ist aus Gold\n24 Karat, 44er Colt"}], "artist": "Kollegah"}