{"artist": "Will Smith", "songs": [{"year": "2002-10-25", "lyrics": "[Will]\nI-I-I-I woke up this morning\nLooked at ya picture\nThink about when I'm a get wit'cha\nHit ya on the two-way simply to say I gotta see you today\nThey say love is a gamble and if so, I'm the Belagio I can't lose\nAnd I guess that make you the mirage\nWait you more exotic than that you like the Taj Mahal momma\nYou a treasure to me life with you is a pleasure to me\nAnd I'm a make sure no man ever measure to me\nLike Run and D you and me are together forever\nI got an interview to do (whoo)\nThen to the plane, that too (whoo)\nUh wear that black dress boo (whoo)\nThen close your eyes and open your heart and I'm a give you\n\nAll my love\nA thousand kisses from you is never to much\nAll my love\nNever too much never too much never too much\nUh huh uh huh\nAnd I just don't wanna stop\nNever too much mever too much\n\n[Jada]\nWoke up this morning to invite and couldn't wait to write you\nI licked your back and then kissed three little kids that look just like you\nLove is magic and it's plain and sometimes it just happens\nSaw your picture your so silly boy you keep my laughing\nWe've got a photo shoot can't concentrate my mind is roamin'\nBecause it's 4 o'clock and at 5:15 you are comin' home and\nYou know my heart you know my thoughts so ruffneck yet you're tender\nThe only person ever locked up safe was to surrender\n\nAll my love (yeah yeah yeah yeah yeah)\nA thousand kisses from you is never to much\nAll my love\nNever too much never too much never too much\nUh huh uh huh\nCause I just don't wanna stop\nNever too much mever too much\n\n[Will]\nThe way you walk wanna make me say\n(yeah yeah yeah yeah yeah yeah)\n[Jada]\nThe way you let me make you wanna make me say\n(yeah yeah yeah yeah yeah yeah)\n[Will]\nGirl the way you look wanna make me say\n(yeah yeah yeah yeah yeah yeah)\n[Jada]\nJust so you all wanna make me say\n(yeah yeah yeah yeah yeah yeah)\n\n[Will]\nYo yo me and more it's like a Picasso painted your aura\nIt's like Beehtoven composed your vocal tones\nWrote band inspired hand sculpted you the desire of man (uh)\nMichelangelo grieves inside you\nSeeds of my wildest dreams fertilized in your eyes\nYour compationate and your passion is how you ration it\nThat makes me swear you was trained how to take me there\nRarely I seen faith be fared\nWe got a stroke of grace\nRemember you was countin me out?\nIt's crazy we had times of doubt right?\nAnd since the dawn of time written history\nBetter men better poet than me\nHave tried to set verse to the love they knew\nDead to words judge what I do when I give you\n\nA thousand kisses from you is never to much\nAll my love\nNever too much never too much never too much\nUh huh uh huh\nAnd I just don't wanna stop\nNever too much mever too much\n\nBig Will\nLil' Jaden\nHa ha\n2002\nTra-Knox\nWhat?\nAll my love\nEverything I got baby\n\n[Jaden] Mommy I love you\n[Jada:] Aww I love you sweetie\n[Jaden] I love you too, all the way to the moon\n[Jada:] I love you to the moon\n[Jaden] Huh?", "image": "https://images.genius.com/76048d37e73e3e383749923c401de4f0.1000x1000x1.jpg", "album": "Born to Reign", "title": "1,000 Kisses"}]}