{"artist": "360", "songs": [{"album": "Stand the Fuck Up", "year": "2011-08-07", "title": "No Matter What I Do", "image": "https://images.genius.com/7f4fab59ada976865312c9a52f6510d0.471x472x1.png", "lyrics": "[Chorus: Robin Pecknold & 360]\nSunlight over me\nNo matter what I do\nSunlight over me\nNo matter what I do\nSunlight over me\nNo matter what I do\nSunlight over me\nNo matter what I do\nSunlight over me\nNo matter what I do\nYeah, 360\nSunlight over me\n40K balling, bitch!\nNo matter what I do\nI know I said \"We just got started\"\nSunlight over me\nBut fuck that shit, we haven't even begun\nNo matter what I do\nUh, I hope you're ready to stand the fuck up\nSunlight over me\nWhat's that? Shush cunt\nNo matter what I do\nThat's what I thought, shh\n\n[Verse 1: 360]\nYeah, I'm on another motherfuckin' level\nI'm sick of hearing all these others, yo, they're nothin' special\nI don't understand why these little fucks respect you\nWhat you sparking with? Why you lying, bitch?\nI'm seeing life and it's gonna be a massive high\nWhy? Because I'm sittin' on a satellite\nBye, and I am ready for the action\nGetting used to all the flashing lights, fuck being camera shy\nSo if you really think about it\nWe'd probably die without music, 360 can't live without\nIt's all expected to go and get a suit and tie\nThe way I see it, that is death or mental suicide\nWhere I come from, rappin' ain't a real job\nBut I have to do it, if I don't then I feel lost\nThey say invest in some real prospects\nBut we only live once though so really, what's the real cost?\n\n[Chorus: Robin Pecknold]\nSunlight over me\nNo matter what I do\nSunlight over me\nNo matter what I do\n\n[Verse 2: 360]\nI'm lookin' down on Earth from a massive height\nBecause I'm sittin' on a satellite\nAnd even if I never grab the mic\nI know that I'm alive so I'll always live a happy life\nWhat up people? I really hope you're feelin' good\nIt's been a fucking great day so you really should\nBut if anybody telling you to fuckin' quit\nEven to the fuckin' chicks tell 'em all to suck your dick\n\n[Hook: 360]\nOh-oh\nIf they wanna even talk they can go ahead and bring it on\nNo-oh\nIf they standing in my way, I don't care, I'ma kill 'em all\nI'ma kill 'em all\nI'ma kill 'em all\nI'ma kill 'em all\n\n[Verse 3: 360]\nYeah, I'm now working at building to make the flow more ether\nWe got no ceilings, but no floors either\nStaring at the sky, always seem to be countin' sheep\nBut every sheep just never seems to amount to sleep\nI'm in a room doin' lines of coke with a Dane chick\nWhile you're with your best mate fightin' over the same bitch\nI'm getting faded while drivin' slow in the Matrix\nAnd after every show, I'm flyin' home in a spaceship\n\n[Chorus: Robin Pecknold]\nSunlight over me\nNo matter what I do (I'm that fly)\nSunlight over me\nNo matter what I do\nSunlight over me\nNo matter what I do\nSunlight over me\nNo matter what I do\nSunlight over me\nNo matter what I do"}]}