{"artist": "Pharrell Williams", "songs": [{"album": "In My Mind", "title": "How Does it Feel?", "image": "https://images.genius.com/a7c7371c883ae1d1241073cd59f52564.1000x1000x1.jpg", "lyrics": "[Intro]\nYessir! Haha, lil' Skateboard P\nHey! Mr. Vener!\nUh-huh, yo, hola\n\n[Verse 1]\nBillionaire Club muchacho\nAssorted flavors in these helados\nInspire young minds, and stack my nachos\nWith the raw determination of a vato\nRun across the border with bricks in his poncho\nFace like a shot when it's bussin' by glocko\nPlanning these things 'til I die\nWhen the Holy Father hand me my wings, when I was young, yo\nThe teacher couldn't stand when we dreamed\nGiving me music like drugs in the hand of a fiend—and shoot it up\nSee me on the TV, the cuties, they wanna fuck\nBoth residential that's plush and couped it up\nGot more hits than a zip, who want it nuh?\nI can go back in time, you be Judge Ito\nWith my minute repeater, I know you're thinking \"neat-o!\"\nIt repeats the minutes, something like your TiVo\nBut it's three-hundred-thousand more with no remote\nJacob and Lorraine, I used to deal with Tito\nBut he clowned me and told me that my money's fritos\nNow the Enzo doors go up like a D-Lo\nRee-on, same song sung by my man Nigo\nSLR, when the doors go up it's like a fresh L jar\nNigga, we boss, he shall not get hot, he too frost\nYessir!\n\n[Chorus]\nMy nigga, close your eyes\nJust picture yourself just holdin' pies\nImplement a plan and you surely rise\nThis promised by the man that controlled the skies\nDon't you see? I know that shit so ill\nBetter yet, doggie, just tell me how ya feel\nHaha, how you feel, dawg?\nWe just picture thinkin', dreamin', schemin'\nBleedin', readin', all in the late night\nShakin', boilin', lacin', bakin'\nShapin', shavin', gotta get this cake right\nAs I serve it, you just burn it\nBreathe it, learn it, now watch you take flight\nNigga, how does it feel? Haha, yessir\n\n[Verse 2]\nNigga, you don't know me\nI'm part Howard Hughes, part horny, part holy\nFirst trick on the ramp is the rockin' rollie\nKeep one on my staff with a new pro chromey\nIt bequeaths me to mention that I've been bitten\nBut affords me to chuckle at what critics have written\nHe dresses insane, but his music admire\nAsk Anna Wintour from Vogue and Esquire\nAnd Vanity Fair; you like Kennedy here\nBut you should guess who's in the insanity chair\nNow it ain't about what I want\nStill thumbin' through my life like it's drugstore porn\nIt's one thing to say that you did it\nIt's one thing to lie about your digits\nIt's one thing to say that you live it\nIt's another for you fuckers to admit it\nBut I admit I got all this paper\nPlus the prettiest faces that's offered by nature\nI drive a cas'per, 'scuse me, Casper\nWanna meet 'em in my house, I got space like NASA\nBut it don't make me happier by itself, or sadder\nOr like my sister Stace when she lost her pappa\nOr Ben dad gettin' a stroke, and nothin' that Trapper\nJohn could do; it's ironic but true\nA man dies, baby born, it's fair as Peru\nIt's a simple clue between us and imposters\nWe hop in the air and don't care what it costs us\nNow I'm with N.E.R.D. with a pit full of moshers\nI guess you could say that we fly like saucers\nZappin' at niggas, we're classin' at vigor\nThe cash and crash whippers, the Thrasher mag gripper\nGo 'head and say it: \"You a rappin' ass nigga\"\nYessir!\n\n[Chorus]\nMy nigga, close your eyes\nJust picture yourself just holdin' pies\nImplement a plan and you surely rise\nThis promised by the man that controlled the skies\nDon't you see? I know that shit so ill\nBetter yet, doggie, just tell me how ya feel\nHaha, how you feel, dawg?\nWe just picture thinkin', dreamin', schemin'\nBleedin', readin', all in the late night\nShakin', boilin', lacin', bakin'\nShapin', shavin', gotta get this cake right\nAs I serve it, you just burn it\nBreathe it, learn it, now watch you take flight\nNigga, how does it feel? Haha, yessir\n\n[Outro]\nNigga, you don't know me", "year": "2006-07-25"}]}