{"artist": "ZICO", "songs": [{"year": null, "album": null, "title": "Well Done (English Translation)", "image": "https://images.genius.com/71568ed056b0fff411f3112a9c5aa8c4.1000x1000x1.jpg", "lyrics": "[ZICO]\nI only chased my dreams as if I was about to die\nThe finish line is nowhere in sight, since I'm never satisfied\nIt's the hard knock life, I'm still the type that\nPrefers to live a tight life than an easy one, huh\nOne by one, producers copy my character\nBut ZICO grew on experience not practice\n4 years of vicissitudes, ill luck and family affairs\nEven breathing feels like smoking, can you understand how that feels?\nGet over it and move on, I got over it all with my eyes wide open\nTo hold on to my family and to lead my friends\nI've got the swank of no other man\nMy spending is more like a reward than extravagance\nLetters look blurred if you look at them up close\nLikewise, you do not know what fix you are in\nIn an inner city where everything is solved by a button\nI do it on my own and my efforts pay off, Well done\n\n\n\n[Chorus]\nI’m doing it right\nEven this much is superb\nOnly the Strong Survive\nNothing to be ashamed of, dude\nAlthough I'm not mature yet, althought I'm not mature yet\nUh uh I make my mama proud\nAlthough I'm not mature yet, althought I'm not mature yet\nGo ahead you can't ignore it now\n\n\n\n[Ja Mezz]\nIn 2008, when Lee Hyori's U-Go-Girl was\nTopping the charts, Kim Sunghee started standing on his own\nVacuum machines, washing dishes, making money, not a single thing\nWas familiar when I started \"surviving here in Seoul\" project still a battlefield, fight without a knife\nThe method I learned to grasp all this: 1 dynamic mic\nPetty thoughts accumulate inside my head, My friends who have\nWorn Georgettes will understand, It's the hard knock life\nAnd time flies, faster than your dad's car\nWhat I inherited isn't a car key but the height 180\nEyesight 1.5 observation skills exceed others\nOpen minded expressions, like the Little Prince's box\nGuess what's inside? Money, fame, and bitches\nI wanted to know, too, so I came all the way\nHere to where I am now, Polo on, come through the door\nA triumphant general, let me hear cheers of victory when I pass Dongdaemun\nAnd the drumroll and a round of applause too\nI say to myself looking at the mirror backstage\nAll of this is not a dream, I will continue to\nGo forward but first of all, great job, Well done\n\n\n\n[Chorus]\n\n\n\n(\"All this stuff that makes me move just feels like a dream.\")\n\n\n\n[ZICO]\nEven on the accounting day I write songs\nGo to Seocho and bother Pop Time stay tuned\nSuccess gives me a sense of duty with no time for excitement\nThe boisterous empty wagons come with empty hands and go with empty hands\nBe positive, like what Osteen quoted, the power of positivity\nThe lower consonant is wrong, it's actually the power of money\nI learned the theory of power early, the sight of you living like a machine\nIs nowhere humane, why do you keep talking about my character?\nI've cleared my family's debts, look at\nMy grandmother's house in Ilsan, my uncle's gone but\n'god save Paulus' Mom's portrait\nOn my chest, if you want to look at me properly, put the cameras down\nI make words become reality! before rebuking others\nI strive to make the impossible become true if not turn famous and rich\nThey say if passion becomes excessive, it becomes harm\nThat's right, I make you sweat and fan yourselves\n\n\n\n[Chorus]\n\n\n\n\n\n\n(Note: some of the annotations are from Naver blogger '청류'(http://blog.naver.com/ksk98815/220274234894).)"}]}