{"songs": [{"title": "Victory Lap Remix", "lyrics": "Introduction [AKA & Tumi]\nHaa… Victory Lap Remix\nYou know we had to get the legends for this one right?\nAKA,Ivy League all day… Let’s go [AKA]\nT from the V papa…[Tumi]\nAnd ah… Ivy League papa… and ah [AKA]\nIt’s big T papa…[Tumi]\n\nVerse 1 [Tumi]\nYou don’t gotta clap for a legend\nYou shut the fuck up,homie standard attention\nSoon as my name is mentioned\nThey throw me a couple down,now that’s a grand entrance\nSo while you claim to have the title belt\nShit I take the bottom up and put me like suspenders\nWear these loafers out like Alpha Elken\nWith more lines in my head than the young Nelson\nAh… welcome the hardest letter peddler just stepped in,\nRespect him, no amount of that doing can help him\nHe first in, but the hunger get him second\nAnd besides he’s here to help the younger settle in\nT from the V I’m in my element… feature\nCause I felt the kid like avalanche\nY’all gonna remember this for the simple fact\nNewsflash \"you sunk boat victory laaaap!\"\nThey say I settle the score, war face like Helen of Troy\nWon’t break I got metal for bars, colgate flow fresher than yours\nWhole place go apeship applaud…\nBoom…\n\n[Hook]\nHow many rappers in world right now?\nHate it that none of them do it like I\nNever get enough never get enough\nNever too much V.I.C.T.O.R.Y\nHands up for my victory lap… hands up for my victory lap\n(Toast to the winners)\nHands up for my victory lap… hands up for my victory lap\n(if you know you a winner)\n\nVerse 2 [AKA]\nI got a brand new addiction\nStudio smelling like my grand mama kitchen\nCooking hits up,plenty space cooking biscuits\nBlack fists pump that twenty 76 shit\nJust another hit Ivy League designed\nI push the Benjamin's button,I’m ahead of my time\nI’m something like the teenage double H P\nWords carry weight,that’s a heavy sixteen\nThis is the land slide victory\nYou disfranchised through history\nCourse in my veins magistrate courts or the grave\nOnly way to get divorced from the game\nA thought for my enemies we don’t play fair\nSo pray for the day that we let them break bread\nAnd this ones up two fingers like Gandhi\nGet the haters enough rope and tell ‘em bhanjee\n\n[Hook]\n\nVerse 3 [HHP]\nNow pull aside for my victory lap\nO fetsa ho mpona me kill die plek\nA massacre by the mystery chap … my name Jabula\nSweetest taboo like the band sweet back\nMake the party bounce like a weak cheque\nI’m deep black I demand your respect\nI pack beef like the ghetto version of Big Mack\nMy seeds back I’m having my cheese snack\nJT bringing six to six back\nI rhyme lekker hence the boots are shaking it\nBad news to Jews like a pizza with bacon in\nNow done faking and leaving the sieve for saking it\nCrack open the glass this bird is for the taking now\nI’m baking like dough boy in heat wave\nI’m making the whole worlds to behave\nSo be brave DJ Zondi told ya\nA hit skyf killing namane like spoja\n\n[Hook]\n\nVerse 4 [Amu]\nYou made one error,you took me off the list\nOf the best to ever spit it on the microphone mechanics\nI’m the Grand Pa of rap,I get down and heads are sorted\nWhat? You running this game? No wonder rap is being aborted\nA rap vet,I’m selling fire to a dragon\nI made a profit gave it back to all these has-beens\nI took my back pack and traded it in for fashion\nI gotta look fresh for it the finish lines I’m passing\nMad sparks I’m addressing\nRepresent ikasi lakho boy time for action\nGet your hood up in arms like Christ of passion\nOr just grab a drink with the fruit of passion\nThey called me up to come do what I do best\nTo make sure rappers play safe like new sex\nIt’s the beginning of the ending,give me credit\nI’m demanding reprehension while I’m at it\nThe principal…\n\n[Hook]\nHands up for my victory lap… hands up for my victory lap\n(Toast to the winners)\nHands up for my victory lap… hands up for my victory lap\n(if you know you a winner)", "year": null, "album": "Altar Ego", "image": "https://images.genius.com/04dba2cb161f7bd426cc0ca9e52a2d54.1000x1000x1.jpg"}], "artist": "AKA"}