{"songs": [{"year": "2012-01-01", "image": "https://images.genius.com/283cd237d7c947223a80f65f3252599e.500x500x1.jpg", "title": "Light Leak$", "album": "Nehruvia", "lyrics": "[Verse 1: Bishop Nehru]\nI be teaching niggas lessons, they be investing in protection, trying to get weapons, so they can leave a young nigga breathless\nEat em up for breakfast people be talking reckless when they see I'm 15 and I'm on there daughters set list, bet this\nThem dudes fools thinking they crew blew cause they new too, 100 views on youtube\nI ain't even being cocky cause I'm new too but the difference is my new tunes is crucial\nUh I got fans out in germany, they word to me saying my flow burn to the 3rd degree\nOh you never heard of me. I'm killing shit with urgency. I certainly murder that special rapper you want to meet\nUh I been aiming for the top. where the rhyming never stop and the nines will never pop\nNo running from the cops cause the block in never hot and my mom is in a drop that her first born copped\nUh so yeah nigga how did that feel I'm mad I'll should pack pills when my tracks build\nNo bad pills and bad bills my pad chill my path will not conceal my last meal\nSo until Nehru it's ok to be and it's ok to see me in OKC watching KD's 3's in some KD 3's\nI'm finding out a way to please enemies without pleas\n\n[Hook: Kanye West Rant]\nI'm not just doing it for one week and going off and smoking some weed and going to the club and partying\nI'm delivering product on a whole new level. I'm like a machine I'm a robot. You cannot offend a robot\nYou know what I'm saying. Like mentally I'm so focused. There's nothing anyone could say or do to me to stop the music\nThe product I'm about to put out and at the end of the day. The talent will overcome anything\n\n[Verse 2: Bishop Nehru]\nI'm back and I'm cold, so grab a sweater and I'm repping PS like I'm adding on to a letter\nNiggas better learn to respect us. My rhymes and lining is clever you trying to shine it's whatever. I rise and grind and get cheddar\nI'm hoping that shit get better with life that is. I pray I see the day where I lay with wifey and kids\nMy reckless mouth will probably lead to bullets in my ribs. no fear I ain't scared my mind is highly prepared\nNo reason for me to stress it. I plan to be the best with. All the shit that I write and All the things that I been blessed with\nNobody else can test it. And I confess, I'm expecting shit to get a little hectic quick, but I ain't even sweating it\nCause when 16's leave the mouth of this sick teen\nI get green and get seas of big fees and I'm seeing the day where I'm on the big screen\nWith fans anywhere from they mid teens to sixty\n\n[Hook: Kanye West rant Part 2]\nI have the right to talk about what I want.I have a right to give my opinion\nCause I back everything up. Yall thought I was talking SH** when I first came out\nNow yall I see I back everything up. Back to back to back to back\nSo basically shut the F*** up. Stop talking to me. Do you want?\nI'm not coming on no, Do you want me to do music? Do you want me to not to do music?\nI want to do music. Cause I know people need my music"}], "artist": "Bishop Nehru"}