{"songs": [{"year": "2011-10-14", "album": "The Nebulizer", "image": "https://images.genius.com/108c1549cb9fa7e49685238b78f6936d.600x600x1.jpg", "title": "Party Like This Pt 2", "lyrics": "[Intro: Nebs & Kerser]\nThanks bruz\nYo, um\nAll right, if you're on LSD, you need to get the fuck out\n'Cause we're gonna spin you the fuck out\nYou in the V-neck – fuck out!\nGet the fuck out! Right in your face cunt\nAyo Kerser\n\n[Verse 1: Kerser]\nI'll fuck a fake in the face with the face of a fake\nThen I'm takin' away what they claim in this haze\nKerser one, you know the name, I got you readin' riches\nWhy I'm feedin' pimples, eatin' meat and missiles\nShut your mouth, I got it ready, you can say I've nearly cooked rap\nWe up in Campbelltown so just be careful who you look at\nPuffin' the chronic, ain't it fuckin' ironic?\nI see a muffin, I'm on it, I got her up on the bonnet\n\n[Verse 2: Nebs]\nYou cop a punch to the stomach, cough up your lunch and your vomit\nHonest rappers shit the gear like there's a gun and I cocked it\nI make ‘em leave you proper lone and start becomin' a Gothic\nNow they're on some emo shit, no more Muph & Plutonic\nI straight piss in your pocket, you need to summon the prophet\nYou need to run to Mohammed, you claim you're tough and you rob it\nBut you're the one that’s just dobbing, there's a bit of a problem\nYou're like thirty years of age and you get fucked up the covet\n\n[Verse 3: Kerser]\nI’m the lad that they talkin' 'bout in good ways and bad ways\nLook mate, it's mad ayy, I took 'way your sad face\nBattle rap shit, yeah I’m dyin' to be goin' at\nPromotors say it’s hard to find me an opponent, but\nAin’t this cunt sayin' that they raisin’ the bar?\nCall 'em out, duck and weave, I be suckin' the weed\nMy attitude stays mate, they ain’t nothin' to me\nYeah, I’m somethin' to see like I’m one off the beat\n\n[Verse 4: Nebs]\nAnd then you run to police because you runnin' from me\nPut the noose around your neck lad and jump from the tree\nIf hoes are constipated like a junkie on the gear\nWhen it comes to lovin' man, you love it in the rear\nIf you want a real show, I’m just a phone call away\nRight, we set 'em up on stage and I blow you all away\nIt's like I’m throwin' a grenade at the stage when I play\nYou knew the shit was hectic when I wrote it on the page, uh\n\n[Outro: Nebs & Kerser]\nYeah, warn 'em 'bout the soup\nUm, there's some soup in the kitchen\nUm, if it makes you feel drowsy or anything like that\nDon't drive a motor vehicle or operate any machinery\nAnd then fuck the clowns with the skinny jeans\nAnd now shit their pants and they're gone\nOh, yeah, another warning\nI put some Valium in the punch\nAnd fuck it, I'm just gon' say it\nIf anyone's got that mature porn, seventy plus shit\n[?] to it\nWe out\nBitches"}], "artist": "Kerser"}