{"songs": [{"album": "Friday Night Lights", "year": "2010-11-12", "title": "Enchanted", "image": "https://images.genius.com/ae722fa8fa10d75fe4b25dfeb4b8d8d6.1000x1000x1.jpg", "lyrics": "[Intro: J. Cole]\nYeah, this is where the\n\n[Verse 1: J. Cole]\nYeah, this is where the fathers ain't livin', at least not with us\nMight see em round the city and won’t even say wassup\nWhen niggas play tough, won't even smile in mirrors\nAnd we learn to fuck hoes off trial and error\nJust a small town nigga, big city hustle\nGlued to the TV, Jigga, Diddy, Russell\nThese were our heroes, strictly for them zeros\nFor that Robert De Niro, niggas reload on them kilos, uh\nDodgin them people, mad at myself 'cause\nI done seen some things that I’d rather not tell\nShawty smoke crack and her boyfriend too\nAnd sometimes he touch her daughter how them boyfriends do\nPull up to the club where my boys went too\nSee that yellow tape and the boys in blue\nA nigga on a stretcher and though I never met ya\nI'm thinkin' God bless ya, the city tryna get ya\n\n[Bridge: J Cole]\nMan, don’t let the city get ya\nFuck the horoscopes, know the ropes like a wrestler\nIf them bullets wet you bet your Momma need a tissue\nYour face on the front of our shirts, screamin', \"We miss ya!\"\n\n[Chorus: J. Cole]\nCome with me\nRun quick see, what do we have here now?\nDo you wanna ride or die?\nLa da-da-da, la la la la\nCome with me (La da-da-da, la la la la)\nRun quick see, what do we have here now?\nDo you wanna ride or die?\nLa da-da-da, la la la la\n\n[Verse 2: Omen]\nYeah, let's see God, I know you only do what's best for me\nBut is it cool if we negotiate my destiny?\nThey always tellin’ me it’s temporary\nThen why it's feelin' like a cemetery?\nMy dreams ain't got no obituaries\nMy city hurtin' and none of us well-equipped here\nYou heard me say I was ballin’, I probably meant tears\nI’m trying to get clear, I’m tryna quit fear\nWho wrote the scripts here?\nThese kids live their whole life just killing time\nRunning the race with no finish line\nThey tryna noose us with they ropes, but I'm finna climb\nI think my foolish pride might become my suicide\nBut I ain't tryna go, no, baby\nAnd through these lines and quotes you gotta find some hope\n'Cause I ain't dying, my words gon’ last forever\nYou can hold the treasure\nLook inside you can see a diamond in my mind\nI'm tired of seeing dope fiends wiping they nose clean\nIs my neighborhood just a smoke screen?\nI think I'm in the dungeon fam, I see low green\nSons raised by both queens but it's no kings\n\n[Chorus: J. Cole]\nCome with me\nRun quick see, what do we have here\nNow, do you wanna ride or die\nLa da-da-da, la la la la\nCome with me (La da-da-da, la la la la)\nRun quick see, what do we have here\nNow, do you wanna ride or die\nLa da-da-da, la la la la\n\n[Verse 3: J. Cole]\nIt seems like niggas either feel ya or they tryna kill ya\nI face the sky and hope that God ain't acting unfamiliar\nYou play whatever cards he deal no matter how peculiar\nThey tell me that it's God’s will, I’m asking \"God, will ya\nHeal a nigga from all this pain?\" Mama smokin' cocaine\nAs it rains out, am I to blame? Try to stay sane\nSo I came outside where they rock with them thangs out\nTo clear my mind, the same time they blew that boy brains out\nBut will it change? It's like niggas is free\nBut our minds still in the chains, brothers killing each other\nThe blood spill, it's a shame, will it ever slow up?\nA lot of niggas getting older, but they never grow up\nAnd do they sons like they fathers did and never show up\nDon’t even cry about it, just another episode of life\nWatch the whole season, nigga, no re-runs\nThe devil out here buying souls, nigga, no refunds\n\n[Bridge]\nMan, don’t let the city get ya\nFuck the horoscopes know the ropes like a wrestler\nIf them bullets wet ya bet ya momma need a tissue\nYour face on the front of our shirts screaming we miss ya\n\n[Outro]\nAnother day, another song\nA mother prays, another gone\nBut still we play like ain't nothing wrong\nLike ain't nothing wrong\n'Cause ain't nothing wrong\nIm not as fast, I’m not as tall\nBut before I pass, I gotta ball\nI gotta ball, I gotta ball\nNigga, I gotta ball"}], "artist": "J. Cole"}