{"songs": [{"year": null, "album": "Firestarter Vol. 1: Quest For Fire", "image": "https://images.genius.com/d1c3e48f7789c764dbfe19acbf9cb0b9.300x300x1.jpg", "title": "G’ Walkin’", "lyrics": "CHORUS [Glenn Lewis]\nIf everyone could see just how I see\nThey'd Function like a G'\nAnd walk that big walk in the streets\nIf everyone could see just how I see\nThey'd Function like a G'\nAnd walk that big walk in the streets, in the streets\n\n[Kardinal Offishall]\nMy God it's a beautiful day to just sit and enjoy blue skies\nAnd all the brothers in the streets gettin' high\nGive thanks for your life bcause Yo - things will change\nGhetto people suffering will soon in-herit the game\nThe last will come first and the first will come last\nAnd the good will take a seat in the holiest of mass\nAnd blast out the world sin, hard times we living in\nI am trying to do the best I can living with my breddrens\nThe world is filled with negative and positive\nNever judge a man what he is is what he is\nAnd I am an ill bro blessed with an ill flow\nWith an opportunity to rep the T-dot O\nAnd try to spread some of the blessings, lyrical dressings\nAnd I am guessing that your listening to what I am addressing\nEspecially since I'm rhymiing from my heart\nTrying to supress the craziness before it even starts\nYo every gun man has to have a soft spot\nEvery thug nigga has gotta have some heart\nIt's these things that I hold to be true\nSo I don't have to pray that they won't blast you\n\nCHORUS\n\n[Kardinall Offishall]\nYo! I was touched by the real the other day\nIf my pops was here he would tell me enjoy every single day\nAnd support your family cause blood comes first - for real\nNevermind about trying to sign a deal\nJust do what you gotta do and do it like the best\nEven when it seems that people C-Bn' for no reason\nDon't study the treason, function like a G'\nAnd with that, the world is ready steady f-ing with me\nAdmiring who I be, I take it as flattery\nI must exemplify just what it is to be an emcee\nI breathe in the tragedy\nAnd breathe out a song of hope\nFree from government, politics, lies, plus the Pope\nThe 5.0 sells dope, Police make nuff sales\nWe're taken out of the hood and locked up with no bail\nBut either way we get out and try to turn it around\nYou can't see it\nBut you feel it in the sound\nYou know dat!\n\nCHORUS X2\n\n[Kardinal Offishall]\nI'm not a reverend, a preacher, V.P. or teacher\nBut still I gotta reach, and none can impeach\nBut the most high spiritual, virtually physical\nHigher power more than capable to make miracle\nIn every black home, and in every jail cell\nAnd in everyone of us to let the righteous set sail\nAnd accept positioning, whether you a Christian, a Jew, or Muslim\nYo have faith in him!\nThe G's in the street know what I'm talking about\nThe man dem on the corner, surviving with no doubt\nThe kids in the park trying to keep things real\nYo who don't hear muss feel - you know that!\n\nCHORUS X3"}], "artist": "Kardinal Offishall"}