{"songs": [{"lyrics": "[Intro]\nWe'll have more news after this commercial word\n\n(And so it goes..)\nAt least I think was here asleep\nIs it possible? Conceivable?\nThat I sleepwalked out of my apartment and went berserk?\n\n[Verse]\nIn slid rhythm, fed a cycle bound by dilemma, debt, and vendetta\nEscaped briefly back to my apartment to park in front a fan\nAnd reminisce about the day I ran a mile with your heart in my hand\nContestants get the New York home game with real life shoot 'em up-action\nThug, vagrant, yuppie and art freak game piece all included\nI told this cat the Earth was flat, he walked 'till his beard grew\nLong enough to strangle himself for being stupid\nIt's bric-a-brac novelties, spliced with that six pack odyssey\nGodspeed, tequila worm future, be concerned\nMy feelers spread across the land reporting avalanche sightings\nWhile my introverted side is flying cadavers on kite strings\nI'm a never give, I'm juiced off projection\nI'm stubborn as a thousand born-agains avoiding questions\nFrom the alpha to the zed, I bait this data for my pledge\nTo bathe a traitor of the twice forgotten favors that he bled\nAnd not a creature stirred\nIt reeks of subway metal, bevel edged journalist chin-on-fist shenanigans\nRe-coin mayhem with bonuses, benefits and break room\nMummified mannequins with future clenched adamant\nAnd skeleton in cabinet\nThis amalgam circus got a ring of fire\nJust big enough to shove my purpose in the circle\nI'm known to dip dusk in a broken city curfew\nRelease the hounds\nTo see which one could track your trail and serve you, sucker\nI lay the law down upon its belly while my foot\nDug in between the 3rd and 4th disc yelling \"Break yo' self!\"\nI finally actualized data commission\nPast penny tip jar donation arrangement, but a far fetch from stability\nTook a hard pledge early on\nBlood donor to drum dozer, plowing the metronome, home\nBlown caddy-cornered to cockeyed sound booster\nSensationally seismograph\nStabbing away on stone tablet to sketch a grouchy future\nI drifted out the main spelunking unit with watered down\nSample of cancelled development, courtesy America\nLand of the freebase, home of the triplicate grill character\nMy sorta sideways tilt caught pinball blinker and citizens 1-x\nWeren't steadied for this leaning grievance with dilapidated winter jacket\nI rock a crooked lid piece and sweat a bit to make my wookie ends meet\nPacifist willing to step into a friend's beef if needed\nWing clipper out hierarchy\nPassionate while they whine on some \"Daddy's gonna kill Ralphie\" shit\nSuck the proverbial silver spoon 'till their parents quit apparently\nParasol spinning casually like\n\"I'm an artist, please don't laugh at me\"\nOK, time to buckle the fuck down\nSolder your wobbly system back to original form, pumpkin\nYou could catch the memoir in several dimensions\nThe joy-of-life logic don't employ the spite process\nHence your plight botches\n\nThis Be The Big\nF-l-a-s-h-f-l-o-o-d, Flashflood\n\n'possible' 'conceivable'\n'possible' 'conceivable'\n'possible' 'conceivable'\n'possible' 'conceivable'\n'possible' 'conceivable'\n'possible' 'conceivable'\n'that I Sleepwalked Out Of My Apartment And Went Berzerk'", "title": "Flashflood", "album": "Labor Days", "image": "https://images.genius.com/6a16cbbd76c264fec96a9675981e9556.1000x1000x1.jpg", "year": "2001-09-18"}], "artist": "Aesop Rock"}