{"artist": "YG", "songs": [{"image": "https://images.rapgenius.com/f0e87c61096c9d7c3a3a0b059e2bf29b.500x500x1.jpg", "year": "2014-12-06", "album": "Blame It On the Streets", "lyrics": "[Produced by DJ Mustard]\n\n[Verse]\nThis that Silicon Valley flow\nI got that sun dance vision, nigga you ain't know\nGot damn, I got album of the year, still\n3 plaques in, imagine how these wack rappers feel\nI've been killin' niggas all year\nBill, me and them white folk names got somethin' in common\nBills, I got 'em, I've been at rich houses, I've been to rich hills\nThe homie got that Tommy, know that's somethin' that he'll feel\nLook though, been really off the hook though\nMy fam straight, my homies got money on their books though\nLately my bitch been trippin' on me\nI'm like \"Bitch I'm in the studio, let me cook though!\"\nRJ killin' shit, my homies is killin' shit\nBut I'm tryna convince 'em to be on some drug dealin' shit\nI can't blame 'em cause their mamas, they don't give a shit\nSo I fronted them some work, told 'em nigga get rich\nGet rich, get rich, get rich\nMama I finally get it, hustle hard then get rich\nLately, I've been on some solo shit\nCortez, long socks, I've been on my cholo shit\nBitch you keep trippin', I'ma let bygones be bygones\nWalk up in the house with high nines, I'm like \"Hi mom!\"\nBut I'm right back on my nigga shit\nLike what, she fuckin' and suckin', she with the shit, let's flip this bitch\nLet's flip a pound, send it out of town, then bust it down\nAnd no respect for the hoes that wasn't fuckin', but fuckin' now\nBust it down, bust it down, bust it down\nYou can profit $3500 if you bust it down\nSend me the plan, I'ma figure how to execute\nMy management like \"Hold up YG!\", I'm like, \"I ain't waitin' on you!\"\nIt's that 2015 flow\nKill yourself if you ain't gettin' dough\nHold up; keep winning, keep winning, keep winning\nYou gotta speak it to existence, nigga, keep winning\nThey said Dre made a billion\nI'm like, \"Shit, I can do it if he did it!\"\nFuckin' on whats his name's baby mama\nHer pussy loose, her walls broke down, she ain't got no ceilings\nThey was like, \"YG you shouldn't go there!\"\nI said, \"Bitch, I think I'm Silkk the Shocker, I got no limits!\"\nFuck these niggas, they ain't livin' what they talkin' 'bout\nEven with a million dollars I'll still spark it out\nFuck these niggas, fuck these niggas, fuck these niggas\nThey wasn't shootin' with me in the gym so fuck these niggas\nI'm Ruff Rydin', where my dogs at?\nWhere them niggas that fuck them bitches on their paws at?\nNigga 2015\nOn the front porch sellin' 20 sacks for 15, nigga", "title": "2015 Flow"}]}