{"artist": "Vanilla Ice", "songs": [{"title": "Minutes of Power", "year": "1994-03-22", "lyrics": "[Verse 1]\nCrank it up, yo, and let me hear that system bump\nCuz with this here I gotta get over the hump\nAnd you know what that means (that means)\nKickin' out funky rhymes \"G\" (rhymes \"G\")\nI got the funky rhymes that'll please (that'll please)\nAnd my jams break overseas (overseas)\nSo when I come to town be prepared to be hyped up\nCuz when the mic's turned on I get psyched up (psyched up)\nThe V.I.P. gets it started with intro\nBustin' smooth moves on top of instrumental\nTurn up the beats in the Jeeps louder\nHere we go y'all - with minutes of power\n\nMinutes of power\n\n[Verse 2]\nMinutes of power\nWhen I step to the mic - bro\nVanilla Ice does it right\nAnd what I'm sayin' is - Yo!\nYa suckers frontin' what ya wantin' is for me to fade\nThought I was outta here fools\nI ain't goin' away\nBack with the track that will keep my bank fat\nHA! Vanilla's got the flavor for the funky format\nAnd if you're not givin' up the credit I seek\nVIP's in the house and they're ready to creep\nNow whatcha gonna do when my boys are on you?\nYou know a hard head makes for a soft shoe\nSo turn it up for the passengers - LOUDER!\nIt's Vanilla Killa with the Minutes of Power\n\n[Verse 3]\nWalk through the smoke on the stage\nAnd the girls scream\nIce gets 'em hot, then they melt like ice cream\nFlowin' with the swiftness\nKickin' it with the quickness\nFella's gettin jealous cause their girlies want a quick kiss\nWhen I'm rolllin' around in my 5.0 drop top\nTurning up the sounds\nCuz I wanna bump the hip hop\nPeople gettin' mad cuz they hear the big bass hit\nI turn it up more just to let cha know I won't quit\nIce has got it locked down and there's no stoppin' it\nWhen I hear a track like this\nYou know that I'll be rocking it\nSounds so sweet, it could never be sour\nHere we go y'all with the\nM.......minutes of power\n\n[Verse 4]\nNow's the time for the Ice to let a rhyme rip\nLoadin' up my lyrics with a 9 double M clip\nShootin' all enemies, you're not even a friend of me\nI ain't Spike Lee so I do the wrong thing, G\nSo down with Luther Campbell OH NO\nI don't think so\nTravel state to state an' and the Ice man rips shows\nSteppin' in my path an' you might get broken\nI got it goin' on an' you know I ain't jokin\nPower every hour an' the Ice keeps risin\nSellin' out arenas so don't look surprised\nWhen Vanilla shows up an' the place explodes\nAn' if ya missed it - catch the next episode!\nGather up your troops\nRush 'em to the record store\nAn' pick up the new LP from the Ice Man\nSo let the funk flow louder\nAnd let me hit cha - hit cha - hit cha\nWith the, with the\n\nMinutes (x3) Minutes of Power", "album": "Mind Blowin", "image": "https://images.genius.com/f7a76335917daad02db3cc269ea9667e.498x500x1.jpg"}]}