{"songs": [{"title": "Fire in the Booth", "lyrics": "[Verse 1: AJ Tracey]\nYo, listen, look\nWhat does MTP stand for?\nIt stands for mind your damn business\nKill off the scene, bare man are on my hitlist\nAny man tryna watch man, that's a witness\nCock back .44, kill off the witness\nGym don't work against guns\nIt's not fun\nI don't fear nobodies fitness\nI got a don with a strap near Ipswich\nI put grime back into that grime\nI spit about what I want and what I like\nAnd I'm born to trap\nTrap on the bus, trap in a car\nOn a quadbike, or a trike\nLike Chimz said I got a young 'ting and she's on 'tings\nBody bom 'ting with a tongue ring\nProbably have my food up in her Louis if I asked her\nAnd probably take that food to a brudda if her don rings\nAJ T fam I move like Sasuke\nI keep pulling down weights like back day\nYats mac Trace' but they didn’t wanna mac Ché\nOps chatty but I'm soon gonna catch day\nAnd ops chatting but I'm still gonna catch them\nGet a riddim and I start spitting like a Mac 10\nNot with the women that was chilling in the crack den\nI put a pack down then a pack went\nDid you hear AJ got shanked?\nDid you hear AJ don't write his own bars?\nHave you heard my man? He's wack\nHe spits the same flow every time he does a track\nHalf white, but he acts so black\nHe can't be active because his hair's in curls\nAnd he's stush because he don't follow back\nI heard he's got a small dick and he's never in the trap\nWell, I never got shanked, I do the shanking\nI write other man's bars and I get the thanks in\nI'm wack? PRS says otherwise\nOff of performances, man have got banks in\nI'm not black or white, I'm both\nAnd I've got curls, and I just do and that's life\nI don't follow back 'cause you're wet\nAnd girls hold my chest because they can't take the whole of the pipe\nThat's facts\nPK's back and he's got a black Mac\nAnd you know say that he's gonna tap that Mac\nMC's chat about man get splashed\nPull up on the set and let the skeng throw crashed\nYou could be a grime older in the scene if you're talking of madness skengs forget crash\nTreat the pussy like the decks man pulling on\nIf it gets mad I'm pulling that back\nMia Malkova—if you know what I'm on about, you're a loner\nHigh-level bars, high level like stoner\nLightweight guys can't drink a Corona\nNah, one Corona they're drunk\nOn one, man's spinning around all slumped\nThese lightweights they can never get pumped\nI'm too light skin, I could never get dumped\nStop chatting 'cause we got that pump\nBruddas are bound to get dumped\nPile up bodies all over that drum\nHear what I said, I ain't speaking in tongues\nHe's not real nah, he's an actor\nTook man's chick with the winning factor\nDone one line and that's still my style\n'Cause the hood girls strong like Cleopatra\n\n[Verse 2: AJ Tracey]\nWhite girl, Angelina Jolie\nSitting in the car, my 'dargies blow weed\nStart with a Q, then dance the Oz\nPeng 'ting off the 'ish she banged the whole G\nNah, nah, nah, can't step to my team\nTrinidad boy that's TNT\nI've seen a real skengman sitting on a porch\nShotgun and White T\nIt ain't nothing for a nigga to holla my uncle\nTell him come down with an OG\nWhen I say OG, I don't mean Jendor or Ruger or Little D, Blacks or P\nI mean the buck shot with a gats in his jeans that will fly too quick\nGats in his jeans\nCall up the squad, MTP, and tell them 'bout beef, family, it's peak\n\n[Refrain: Charlie Sloth & AJ Tracey]\nOi, man like AJ, though, ay!\nJust getting started, trust me, trust me\nYeah, run the next for me, Charlie\nAlright, let's go straight in, fam\n\n[Verse 2: AJ Tracey]\nYeah, something different for them\nClassic riddims, you feel me?\nHm, let me give them some realness\nYo'\nLook, they said AJ couldn't make it\nMy teachers said I couldn't make it\nMy year group said I couldn't make it\nMy old fam said I couldn't make it\nDid the 1Xtra, rah is he gonna make it?\n100k, Naila, is he gonna make it?\nGrabbed the blue tick, rah is he gonna make it?\nLinked with Mr Sloth rah is he gonna make it?\nJumped off the roads 'cause my Mum couldn't take it\nYour chain man, couldn't say I couldn't take it\nI get booked all over the world\nAnd my PRS shits on your Mum and Dad's pay slips\nI rep West, came in the game for the title\nAnd trust me darg I'm gonna take it\nThat lock holding me down, I'm gonna break it\nA stigma, just 'cause I'm brown, I'm gonna shake it\nSee I got a lot of negative bars 'cause I lived it\nBut see the violence? Man hate it\nI don't want to do no damage, I want vibes\nBut irk one of my guys my brudda, I'll take it\nTake it there like LD\nCame to the game alone with no help, b\nLearned that I should never watch, no face\nSo I only wanna look at myself just like selfies\nLike Zuu I want my family healthy\nTeam wealthy and my movement stealthy\nI got links in the South, in the Brick town\nBut you know I'm reppin the Western like LB\nWait, reppin' the Western like Haile\nCame through shots in the game just like Spike Lee\nYou can't sleep on me, I'm like petrol\nFull of Red Bull, the riddims they ignite me\nThey're like, AJ he's a right G\nTold the Queen 'cause of my flow to come knight me\nJoker, me don't want box so don't fight b\nDouble nine to the four I rep nineties\nWait, but I don't wear no Max 90's, 98's\n95's, Air 1's, studio give me the instru', I'll tear one\nBig man, hand me the mic and I'll air one\nRick Ross girls, might pair one\nNext one in the bed and we'll share one\nCame through all in the scene I shine bright\nMC's look at me go, I might flair one\nHulk Hogan, you're Ric Flair\nI was, cruising now I switch gears\nSee them nose covered in pink\nMy brothers made bare E, well E\nWrite but never eat rare grand mixer\nMixer, said just 'low all the beef\nYour flows tight, my delivery's clear\nI could make money, it's cool I'm gonna go clear\nIf I beef nigga, then dons my energy's shared\nIt is not that, saw Moncler I wanted so I copped that\nBare man are in it for themselves and I clocked that\nThem man are out there holding felines for their bredrin's bars\nDem man are all top cats\nMy boy Frenchie is hooked on the poison\nBut he ain't even worried about nothin'\nMan I popped that\nI like my liquor with a kick like Ong-Bak\nBad bitch using bare teeth, told her stop that\nAnd in the music biz, I'm new to this\nLifestyle's Ludacris\nGot my cousin in the US with the smoothest whip\nAnd if my hood gets bait, I'ma move to his\nI grab papers, but I don't do the quiz\nI got bruddas that can boom your wig\nI'm out here in the booth it's sick\nI used to chill in the flats just fiends, just spoons and shit\nMy mum used to grind for my school shoes\nNow I just step in exclusive kicks\nI tried out a ting on a student ting\nBut I'm a music kid and I'm new to this\n\n[Bridge: AJ Tracey]\nFeel me?\nLast one, we got one more for them man\n\n[Drake - Summer Sixteen]\n\n[Verse 3: AJ Tracey]\nSee I came too hard\nPendant bright like the top of the shard\nCame to the club with a couple bags cash\nIf I spend it then I'm gonna swipe my card\nForeplay niggas tryna bite man hard\nAllow it, I'm just tryna buy my yard\nCouple fast cars with a place in the sun\nAnd a home cinema I can hide my marge\nBut I'm having visions and I'm overly charged\nWhole gang waved like the water in Prague\nLeft hand on a full bottle of Courvoss\nAnd my right hand's chilling on a peng 'ting's arse\nPSG tracksuit cos' I got class\nTell them fiends they can save P's if they grab big bits\nCome and grab a Z or a half\nMy grip tight, loose grip on the glass\nEl Shaarawy man skip, then blast\nDon't even smoke but when the Am lands\nI'ma puff, then pass\nGot a grey yute that will lift his clart\nNo smoke then I let the pokies start\nI'm really on call\nGot T's like Uniqlo, green like Yoshi's car\nAJ T, I'm bosey boss\nI remember my nan said I was too loud\nNow she says that I'm way too fast\nFast with the girls and I'm fast in the dance\nShutdown shows like Windows\nThen I get paid in doss\nAJ from the lane, man have got wha-?\nAJ from the lane, man have got bars\nNo license still cranked in the car\nBig hand 'tings, fam no shanks in the car\nNow I'm in the back of the rave\nGyaldem tryna get a glance of my face\nTapping mates like I swear that's AJ from the Lane\nHow we gonna get a quick pic for the Insta\nHis team's looking like Inter\nFly like the wings on a plane\nWhat they say so clear like the bling on the chain\nShe was buff on the Insta\nWhat a shame she's a sham so I'm gonna make her sing for the pain, it's bubbly\nBrudda I'm an Ace of the Spades\nKing of the Lane and a Prince of the game\nMoney over everything\nI get to smoke weight\nDo you get me? It's crystal clear what I say\nGot a model from a magazine\nLittle sticker, whines too much but I'm never gonna lick her\nI ain't drunk in love and I'm never gonna lick her\n'Cause I got bare girls tyrna jump at the nigga\nOne love if you shouted\nWhen I was jugging one love if you shouted\nI always knew I had the gift of the gab\nSo I got my stack right I put my money where my mouth is", "year": "2016-02-27", "album": null, "image": "https://images.genius.com/2f7d66c78d0908a3359a20427eac15e1.330x220x1.jpg"}], "artist": "AJ Tracey"}