{"songs": [{"image": "https://images.genius.com/3dfcdaab94652abd75c7788fce09ed7f.398x400x1.jpg", "year": null, "lyrics": "\"Motherfuckin' Akrobatik\" \"Rip the shit up\" 3X\n\"Motherfuckin' Akrobatik\" \"Y'all know who this is\"\n\n[VERSE ONE]\nYou call it a prophecy prediction or psychic\nBut I know as long as I posess my skill I'm gonna mic it\nWhen my voice gets amplified\nThe crowd gets electrified\nPlus I got the average MC Petrified\nThe rest have died multiple deaths in they sleep\nDreamin 'bout facing the Akrobatik skills cause they too deep\nCritical depths of poor minds ?implode?\nRappers suffer from swolen glands and torn lymph nodes\nWhen in this mode I feel invincible\nBringing true talent instead of acting like Victoria Principle\nVery authentic Akrobatik's a pseudonym\nStudy my art like ninjas in judo gyms plus I bring\nIncredible phrases Hip Hop fiends are craving\nWhile other heads are mentally enslaving I'm engraving\nMy name in Hip Hop which real heads are craving\nReturning every year like I'm daylight saving\nYou could call it a prophecy, prediction or psychic\nBut I know as long as I posess my skill I'm gonna mic it\n\n[Hook]\nHip Hop\nA new era new year\nYou got beef let's end it rigt here\nSkills coming from all angles of the atmosphere\nDon't fear, Mr Akroba-atik is here, Yo\n\n\"Motherfucking Akrobatik\" \"In concert this year\"\n\"With all these rappers under pressure I know who this\"\n\n[VERSE TWO]\nYo I be the mic mutilator\nTaking rap to a greater standing\nWith every pugilistic flow another blow is landing\nNumerous rap factions have disbanded\nAs a result of lyrical skills that I've commanded\nMy Titanic flows they got your SS Minnows stranded\nIt ain't sex or money so you can't understand it or dig it\nCause you're just a fuckin' mental midget\nI choke your puny ?thesis? and shrink your record sales digits\nSqueezing with the strength of titanium\nThen I'm kidnpping your first sons and intellect training 'em\nBecause you lack the genes to put a decent brain in 'em\nYou'll only tell 'em 'bout hookers and methods of maintainin' 'em\nI tell them 'bout the keys to wisdom and how to be gaining them\nSo there's les asylums with niggas goin' insane in them\nWack flows - I rain on 'em sort of like a Pharoah\nWith jams that return every year like Christmas carols\nYou could call it a prophecy prediction or psychic\nBut I know as long as I posess my skill I'm gonna mic it\n\nCHORUS\n\n\"Motherfucking Akrobtik\" \"Bout to rip shit up\"\n\"Bring it to that ass raw\" \"Check it out\"\n\n[VERSE THREE]\nYo when it comes to the mic device\nNiggas on your block know Akro gets nice\nBringing niggas horror like Vincent Price\nAll over your dome like lice mad precise\nLeaving crowds Dizzy like Gillespie\nI'm leading Hip Hop's next generation fuck ?MC? break like Gretzky\nHard like slaphots while MC's throw crap shots\nHip Hop was not born in no damn crack spot\nBut niggas learn a new word and act absurd\nGot a lot of shephards with brainless herds, Word\nJust when it sounds simple comes the complex\nCan't understand, write it down, learn the context\nExtra! Extra! read it in the scriptures\nA thousand years ago and from now Ak rips ya\nCall it a prophecy prediction or a psychic\nBut I know as long as I posess my skill I'm gonna mic it\n\nCHORUS\n\n\"Motherfuckin' Akrobatik\" \"He can put these rappers under pressure\"\n\"Bring it to that ass raw\" \"Check it\"\n\"Bout to rip shit up\" 4X", "title": "Don’t Fear", "album": "The EP"}], "artist": "Akrobatik"}