{"artist": "Will Smith", "songs": [{"year": null, "lyrics": "[Intro: Jada Pinkett Smith]\n(Ooh, Ohh)\nHere I stand before you - brown\nColor of the mountains\nColossal as the earth\nWrapped so deliciously within my own joy and misery\nFeathers of my wings paralyzed by the distance of my mind\nHere I stand before you, the color of the night\nFrozen by the potential of me: an Afro Angel\n(Uh, uh, uh, uh, uh-uh-uh-uh!)\n\n[Verse 1]\nAfro Angel off your pedestal from perchin above\nYou on the prowl now, downtown, searchin' for love\nIn all the wrong places, outside your radio stations\nHopin' he with new hit single, is tryin' to mingle\nToday, he is me in your town, puttin' it down\nYou in the car with your friends, followin' my limo around\nPuttin' a bug in my boy's ear, your \"S\" is for free\nYou'll do anything for Omar or Phil, bring you to me\nAnd then me, hypnotized by the devil as well\nHold out my hand as an invitation into my hotel\nNo need to RSVP, place your hand in my palm\nAs all your girlfriends getting jealous\n\"Damn, she landed the bomb!\"\nWilling to trade your spirit for some crass, whack wage\nSomething small, something simple as a pass back stage\nBut now I lay me, down to creep\nAnd I... pray the Lord my soul to keep\n\n[Chorus]\nAfro Angel, born against the world\nYou don't have to sell your soul and throw away your pride\nAfro Angel, sent from heaven above\nNever forget that you are loved\nYou know that you are loved\n\n[Verse 2]\nLil Bobby got a gun now, age fifteen\nDestined to spend his life inside a cage it seems\nRage inside, pride, been denied respect\nHe can't take it though he gotta earn it\nBut he ain't learned that yet\nOut on the town, reckless abandon he's been bullied before\nBut now he straps, and no more\nAttitude high\nFlexin on every guy that walk by\nBut don't start pal\nCuz if the gun came from the whiz, Cowardly Lion, got heart now\nLet's pull it on a stranger\nAhh, fun for the crew\nSurprised when he realized\n\"Damn, dude got one too!\"\nSmile's upside down now, games ain't so cute\nBobby's a deer in a headlights\n\"Punk, drop it or I'll shoot\"\nThen like a sniper, cleanin' his rifle, Bobby disobeys his commands\nOne shot rings out (*gunshot*) then only the stranger stands\nCould of sworn Bobby's blood formed the shape of an angel's wings\nBut for what?\n\n[Chorus]\nAfro Angel, born against the world\nYou don't have to sell your soul and throw away your pride\nAfro Angel, sent from heaven above\nNever forget that you are loved\nYou know that you are loved\n\n[Verse 3]\nBack in high school, Tamika was the sweetest, the bomb\nHot to death, though in tenth grade a teenage mom\nKnocked up by some thug named Russ in the drug game\nBut had the cutest kid you ever seen\nThen all the pressure from her mom\nShe stepped to Russ\nTold him it's either them drugs or us\nEither them thugs or us\nThe ultimatum, either continue bein' a thug in the world\nOr start lovin' your girl\nHe said: \"God, bear me witness, no doubt, lovin' ya dear\nBut to go from $50 Gees a week to $30 Gees a year?\nThat ain't happenin'...\"\nI guess he wasn't that strong\nHe came back the next week, and the whole family was gone\nYo, they straight moved away, without as little as a word\nWell... needless to say, Russ was a little perturbed\nThen in a fury put the pressure on her girlfriend Shawn\nAnd like a clumsy chef she spilled the beans on where they had gone\nUpstate Schenectady\nTamika answered the door\nIt was the last person she expected to be\nThey just stared... he said: \"You love me for me?\nYou can do without the cars, vacations, and jewelry?\nDown with me? Period\nThrough life's stress and strife?\"\nShe said: \"Yeah\", he said: \"In that case\nWould you please be my wife?\"\nThen like a sign from the sky, the baby cried\nLike an angel sings\nI love y'all more than anything\n\n[Chorus]\nAfro Angel, born against the world\nYou don't have to sell your soul and throw away your pride\nAfro Angel, sent from heaven above\nNever forget that you are loved\nYou know that you are loved\n(Yeaahh, uhhh...)\nAfro Angel, born against the world\nYou don't have to sell your soul and throw away your pride\nAfro Angel, sent from heaven above\nNever forget that you are loved\nYou know that you are loved", "image": "https://images.genius.com/6d35ec81cf7a17dcc359661f467d19b0.899x899x1.jpg", "album": "Willennium", "title": "Afro Angel"}]}