{"songs": [{"image": "https://images.genius.com/b256017f3b831150266cf5131d761bfe.600x599x1.jpg", "title": "Encore ’07", "album": "Playtime is Over", "year": "2007-07-05", "lyrics": "[Intro]\nThank you\nThank you for comin' out tonight\nLadies and gentlemen\nI am the president of Dirty Money Records\n(What the hell are you waiting for?)\nNew York City\n\n[Verse 1]\nWho you know fresher than Nick? Riddle me that\nMami you itty bitty can't mirror me back\nEverybody gon' see where I'm lyrically at\nUsed to hate Nicki, now they givin' me dap\nI live and I learn,  but I wait my turn\nI'm always on the run, got weight to burn\nEase off the gas, then I make a turn\nThree off the pass, they don't play like her\nWhy I can't just be ill?\nWhy when they see me, bitches gotta to go \"Ew\"?\nWhy my lil' nigga, still gotta sell krills?\nWhy I'm this hot and still didn't get a deal?\nThe rain and the pain, I done paid my dues\nI'm ready for the game, I done laced my shoes\nEverything I say believe I'm gon' do\nCame out the coop, Petite Vuitton boots\n\n[Hook]\nCan I get an encore I know you want more\nI know you sick of all them girls, they such a bore\nBut it's my time I need y'all to roar\nIt's my time I need y'all to  roar\n(What the hell are you waiting for?)\nAfter me, there shall be no more\nIt's my time I need y'all to roar\n(What the hell are you waiting for?)\n\n[Verse 2]\nLook what you made me do, look what I made for you\nKnow when I paid my dues, that I would aim for you\nStraight from the streets of Queens and yet it seems\nThe only thing they know, is that I push a beam\nAll they see's a pretty face, how I ride the base\nSo I put my hoodie down just to hide my face\nThey don't see the tears I cry, the fears I hide\nTend to keep my cares inside, it's merely pride\nLike my grandmother, I wonder if she next to pop\nSaid the next time I seen her she would be in a box\nDamn she was right, she was dead right\nHow was I to know, that would be her last night?\nIf I could turn back the time\nDear God, somehow could you press rewind?\nWon't come when I call, but He just in time\nSo I come when He call, like I'm next in line\nWhen you got something good why the Devil gotta ruin it?\nGuess she never know, I be the best bitch doing it\n\n[Chester Bennington and Mike Shinoda of Linkin Park]\nTired of being what you want me to be\nFeeling so faithless, lost under the surface\nDon't know what you're expecting of me\nPut under the pressure of walking in your shoes\n(Caught in the undertow just caught in the undertow)\nEvery step that I take is another mistake to you\n(Caught in the undertow just caught in the undertow)\nAnd every second I waste is more than I can take\nI've become so numb I can't feel you there\nBecome so tired so much more aware\nI'm becoming this all I want to do\nIs be more like me and be less like you\nI've become so numb\n\n[Nicki Minaj]\nCan I get an encore\nI know you want more\n(I've become so numb)\nBut it's my time I need ya'll to roar\nIt's my time I need ya'll to roar"}], "artist": "Nicki Minaj"}