{"artist": "King Los", "songs": [{"image": "https://images.genius.com/a9bc5b4fe746b1be8d76a46edd25590e.500x500x1.jpg", "title": "Hard Time", "year": "2014-03-24", "album": "Zero Gravity 2", "lyrics": "[Intro: Kobe & Shanica Knowles]\nThey ain't never gave me shit\nThey ain't give me nothin' y'all (never gave me shit)\nThey ain't never gave me nothin\n\n[Verse 1: Los]\nWhat's up with your grind, nigga?\nMine insane\nI've got a insane mind, can't minus pain\nI've got a mind of pain, but never mind the pain\nBring the biscuit to a nigga like Mama Payne\nI've got a mind of gold\nNo minor goals\nI said mine in gold like I've been mining gold\nYou want yours in cash, I want mine in gold\nNever minus that, but never mind, just go\nI've got a diamond chain and got it lined in gold\nCuz all my lines is gold\nI align my goals\nI've got dope lines instead of lines of dope\nYeah it's dope I'm signed, I should of signed to Hov\nInstead of holding signs about why I'm broke\nWhile you riding by with your side eye\nBut every story got two sides like Popeye's\nYou chicken niggas\nI'm kickin' niggas in the ass, I'm stuntin'\nIn the Aston buggin'\nFlashin' back but I don't ask for nothin'\nSo don't ask for nothin'\nRumor has it I'm a hazard button\nHit the hazard button but I ain't flashing nothin'\nClass in session, it's a classic comin'\nI've got the class sick, watch what class you come in\nMatter of fact, I ain't ask you nothin'\nHands down, put your hands down\nIf you man up, I leave you man down\nThis a layup, catch you laying down\nLet the round play if you playing 'round\nWhat they sayin now with they funny ass?\nI don't bop, I do the money dance\nI light the sky, and you might be fly like a buddy pass\nWhat's up biatch!\n\n[Hook: Kobe & Shanica Knowles]\nThey ain't never gave me nothing but a hard time\nThey ain't never gave me shit (Never gave me shit)\nDon't give a fuck but I had to make it\nThey ain't give me nothing y'all\nBut yet they always trynna take it away from me (Never gave me shit)\nThey ain't never gave me nothing\n\n[Verse 2: Mark Battles]\nMe and bro Los had to break the silence\nPlease stay quiet, don't awake the giant\nWhat I've been through, you would hate to try it\nOne more word, you gon' make us riot\nQuit fakin' liar, it ain't safe for minors\nBeen had bars like the case was priors\nWent up a level, Imma take it higher\nDidn't mama say don't play with fire?\nIt's me (yeah)\nStart leaning like a ?\nGive me bread that's it\nGot Trojans for the flow\nAnd you couldn't win these like a red head chick\nYeah, yeah quick\nI'm splittin' the pot\nGet to the top with the intricate plot\nRidiculous jock, still will hit you and shock\nLike Oxiclean I get rid of your spot\nImma run through the stock\nGot bars like Willy Wonka, put you nerds in a box\nDeserve what I've got\nIf time was money, I earned every tock\nNew burgundy drop lettin' Curren$y knock\nHaters on emergency watch\n\n[Hook]\n\n[Verse 3: Los]\nHustle hard be a humble boss\nMy shoes tied, I pull strings to reverse your double cross\nKing, I keep it fly for the love of God\nGuess they're irritated to see I, with that double R\n'Sup subpar cats\nC-note cabbage\nHit a miss on the low, like Shaq free-throw average\nI mean, below average\nAin't hard to see those envy\nMy pockets full of that green, I call it eco-friendly\nDamn, look what I've built\nLook how I've got it, don't play me\nThese niggas can't fade me, these rookies get killed\nI bury you, don't worry your burial will be beautiful\nCookies and milk\nOh that there the Phantom, that bitch look like Hannah Montana\nThe outside be white but the inside be black\nNigga keep talkin' that shit, I'll be back\nWith that Brrrat!\nNot that Barack\nBut my presidential filled up with rocks\nStart from the bottom and build to the top\nI'm in the building, no filling my spot\nYou fill in the place\nI'm peeling my top\nI'm peeling off wheels on my ?\nNo feeling for I\nPosition my nigga got millions to plot\nHow you feelin' biatch?\n\n[Hook]"}]}