{"artist": "Half A Mill", "songs": [{"album": "Milíon", "lyrics": "[Intro: Noreaga]\nNeptunes\nMake it bounce quick, make it bounce quick\nMake 'em bounce shit, make it bounce quick, what\nNigga bounce shit, nigga bounce quick, what\nNigga bounce shit, nigga bounce quick, huh\nYo, I said fuck them niggas, fuck them niggas\nFuck them bitches, fuck them bitches\nFuck them niggas, fuck them niggas\nFuck them bitches, fuck them bitches\n\n[Noreaga]\nYo, bitches bought my album while ya faggots'll dub it\nI do three songs, shit'll just top your budget\nYou ain't got no money, like y'all big ass cream\nI just wild out, smash yo little small ass team\nI do twelve shows, probably get twelve for each\nThirty grand for a song, hundred thou' a lease\nThat I made off the books yo, right on the streets\nPut ya money up, kid, you wanna bet or what?\nI'm on a lil' label, prolly got more than the label\nI floss now, you could catch me on cable\nNeil Levine cut the checks, got a nigga real stable\nOlder bitches wanna fuck around and rock the cradle\nStick-up kids never wanna see me n shit\nShoot they ass, make 'em smoke a heemie n shit,\nN. O. R. E. , stay 'cyclopedi-ing shit\nGet right up on the news, like the media shit\n\n[Musolini]\nI'm a thug, B, under my rugby is where the snub be\nRan the streets like \"Nobody love me\"\nPlus, I was hungry\nGod don't like ugly?\nI must look foul,I thought God bless the child who hold his own\nCuz pass the chrome\nStuck up, it ain't important, just let it be shown\nGot up a few times, ran threw a few 'nines\nY'all cats gon do crimes, snitch sure you don't to time\nNiggas can't stop it, it's economics, you want points for profit\nBoo-head and cock it\nDon't put your hands in my pocket, homo thug\nComin out the closet, I'm straight from the projects\nLive from New York City, we ain't split Phillys\nYo what's the drilly, ya niggas got smacked silly\nYou too fragi-lly, live with the nine milly\nI got my crew with me, big like Pun, dig me\nYo, yo\n\nChorus [Half-A-Mil] - repeat 2X\n\nA party ain't a party till its thugged out\nThugged out, we in the club with the 'crys and rub-out\nA party ain't a party till its thugged out\nThugged out, you in the club, then get the fuck out\n\n[Kool G. Rap]\nYeah, yeah\nCorona thug, nigga, no love\nWe blow slugs, hit wit no gloves\nBuck, flow blood\nStick dick in ya hoe’s mug\nWe cold blood, holdin 44 snubs\nFoes get rubbed\nLeave ‘em cold enough for Eskimo Nose Rubs\nA thug handle theirs with TECs\nNiggas got chandeliers on the necks\nIts merry as that, fillin ?? on their backs\nNow they ??sass, get your meat wrapped\nNow its three less slugs that I'm seein', since you ain't been back\nWere now poppin the sixes, pop 'crys on the rocks with the ritzes\nHave bitches Glock-lock on ya crucifixes\nLeavin ya crew with fishes\nWent through your house and blew the misses\nGuess who this is, Murder incorp rap\nLeavin everything in New York, where\nYou rap with Half-A-Mil\nCock back and blast at will, snatch the fills\nLast of the real\nYou kill, bust ass for thrills\nThat's for real\nWith a clean get away\n\n[Half-A-Mil]\nBeware these thugs, beware these slugs, beware these heaters\nMy son robbed Run for his first pair of Adidas\nWe thugs forever. Don't believe us? Put up ya cheddar\nStreet sweeper bullets fill up ya sweater\nThis songs good, and getting better\nWe swallowed jewels, now we shittin treasure\nFollow the rules, now we rich forever\nStraight through the six, and better\nWe were slaves on the ship together\nNow we workin and getting dick sucked together\nHalf-A-Mill spitting g-noes, sailin the ski-boats\nTaken detours, sippin 'crys, blowin out weed smoke\nThe bitches got me 'round, send the product out of town\nThe streets of half a nigga, doin life up in the mountains\nPlayers and accountants, cash flowin from the fountains\nI'll thrill em later, chicks in the mountains, chicks surround me\nIts astounding, respected\nHalf-A-Mil thug protected, so say I'm drug connected\nThey murders were un-expected\n\nChorus 2X\n\n[Noreaga]-Outro\nFuck them niggas, fuck them niggas\nFuck them bitches, fuck them bitches\nFuck them niggas, fuck them niggas\nFuck them bitches\nAiyo\nFuck them niggas, fuck them niggas\nFuck them bitches, fuck them bitches\nFuck them niggas, fuck them niggas\nFuck them bitches", "title": "Thug Ones", "year": null, "image": "https://images.genius.com/39f902204b479511f147eaa218b638b0.600x600x1.jpg"}]}