{"songs": [{"image": "https://images.genius.com/0fd6cab3bc8154997af6d569b9ff9058.500x500x1.jpg", "year": "2012-10-19", "title": "A Situation", "album": "Squarians: Volume 1", "lyrics": "[Hook]:\nSituation, have myself some fun\nSituation, have myself some fun\nSituation, have myself some fun\nSituation, have myself some fun\n\n[Verse One] [Sez Batters]\nLyrics cooking in that kitchen, you don’t measure up\nI’m hot dog, the mustard's something you could never cut\nCatch up/ketchup motherfucker, you still on level 1\nThey tryna take shots like Ketel One\nTake it to the dome, niggas know this a breeze\nFlow is cold as some snow and some skis\nStiffer than a popo, sayin' \"Nigga freeze\"\nGot lines like the government, was handing free cheese\nShorty hit video record I’mma wreck her\nSay I pushed the right buttons, got her feeling special\nThat’s cuz I don’t control her\nScared to show her dueces like Noah\nRoses really speak, had to sink our friendship\nDidn’t have faith but now I’m doing big shit\nAll about my gravy, say she want my baby\nCuz I’m getting cheese like them crackers, I’m at the Ritz\nShe’s tryina make a..\n\n[Hook]:\nSituation, have myself some fun\nSituation, have myself some fun\nSituation, have myself some fun\nSituation, have myself some fun\n\n[Verse Two] [Freddie High]:\nBy back against the wall for assault brings the situation\nHit these tracks like stars for the ventilation\nI’m in the lane with a dime that I’m penetrating\nAnd her cat is real fat, yeah, Pappy Mason\nSo what you sayin? Who you playin? It’s that new shit\nAnd L7 be them dudes that I grew with\nBeen screaming \"king\" since that nigga named Bling\nFood for thought, then I eat plates clean\nThis shit is feeling right Spike, please Do The Right Thing\nSquares spend they whole life rootin' for the right team\nYeah, but I’m sure you niggas know already\nIt’s that time of the month cause the flow is heavy\nThe more I levy, they break, my flow cocky\nCause instantly I see my style copied, that’s not me\nWatch say it’s my time, A$ap Rocky\nChris Pine, I swear they can’t stop me\nY'all niggas gotta..\n\n[Hook]:\nSituation, have myself some fun\nSituation, have myself some fun\nLooks like I found me a..\nSituation, have myself some fun\nOnce in a lifetime baby, once in a lifetime\nSituation, have myself some fun\n\n[Verse Three] [XV]:\nSee I never like to party with girls\nEyes get starry\nAnd niggas try to throw shots after throwin shots of Baccardi\nIn a twist of fate like Jeff Hardy, now I got 'Raries\nLeavin they kid just to come in and drive the Ferrari\nYou ain’t thinking like me, ho you think like Steve Harvey\nKeep your nose about my business and your ass off my Atari\nThat’s what the OG’s taught me so tell my nana I’m sorry\nBut some wack bitches scarred me in the hotel lobby\nBaby face Vizzy, turn 50 bet they still card me\nAnd if I had one of your biddies bet she’d still call me\nWanna determine if that’s a lie, don’t call Maury\nJust check your girls Safari, history, bet she bookmark me\nNo, I used to front with those type hoes\nBut I said fuck it nigga I'll live my life though\nShe had a night robe, I had a nice robe\nShe had the lights low and I had the light bulb\nLooks like I found me a...\n\n[Hook]:\nSituation, have myself some fun\nSituation, have myself some fun\nSituation, have myself some fun\nSituation, have myself some fun\n\n[Outro] [XV talking]:\nWuddup yall?\nSquarians, that’s what I’m talkin to. I hope you all enjoying Volume 1 so far. Me and DJ Richie still in here. L7. You see, a lot of people, they get confused on what a Squarian is. You know, like being a Squarian ain’t about being a square. You know, so when niggas say that’s square, that ain’t squarian. That’s square, you know what I mean? It’s okay to be yourself, you know? And all we tryina do is promote living your life. That’s what being a Squarian is. About living your life. Love life, loyalty and living long like legends\nThat’s that L7, nigga"}], "artist": "XV"}