{"songs": [{"album": "You Can’t See Me", "image": "https://images.genius.com/557d437bf932b93b08ec3950a791448a.600x600x1.jpg", "year": "2005-05-10", "title": "Just Another Day", "lyrics": "[Hook: John Cena and Trademarc]\nThis is just another day in the life\nSeven flight connectors - past due bill collectors\nThis is just another day in the life\nMo' money mo' problems - and I ain't got money to solve 'em\nThis is just another day in the life\nGettin mobbed by fans - man nobody even knows who I am\nThis is just another day in the life\nThis is just another day... in my life\n\n[John Cena]\nEverybody askin me - what you really like?\nIs this really life? Do you really fight?\nDo you fear the mic, when there's millions watchin?\nAre you super rich now, how much grip you coppin?\nYou the new kid, now you gettin some shine\nWhen every vet sayin that it's not yo' time\nMy hustle is non-stop and it's not yo' grind\nPlus I hear very clear, I'm not so blind\nBeef I don't sweat it, sleep I don't get it\nI remember your face it's just your name I forget it\nThese days they melt together as one\nI got some plans to do shit that ain't never been done\nTake this game into battles that ain't never been won\nI ain't gon' walk through life, I think it's better to run\nAnd yeah I'm eatin right if you askin\nBut the size of my wallet that's reflection of passion\n\n[Hook]\n\n[Tha Trademarc]\nJust another face in the crowd, so to speak\nHuh, my electric was cut off last weak\nNo heat, no food, no money, no girls\nAnd if life's my oyster then I ain't found pearls\nMakin moves every day so the ends could meet\nNo gas money, so I use my legs and feet\nEverybody I meet man, they likely saw\nThat I be in the same clothes from the night before\nShoes so old you can call 'em retros\nMan I'm so damn broke, even my wallet echoes\nI got a dollar and change; man, I'm under the gun\nThat buck's the only thing keepin me from bein a bum\nThat's why I'm writin these words man, so I can get on\nSo I can realize bein poor was makin me strong\nAnd the only reason I can't rub pennies together\nIs cause I carry big bills, in genuine leather\n\n[Hook]\n\n[Cena] Shakin hands with some fans by the thousands\n[Marc] My place so poor, looks like public housin\n[Cena] Gettin the Porsche when I shoulda got the CL6\n[Marc] My ride broke down, I'mma kinda between whips\n[Cena] Face on the X-Box, you played the game lately?\n[Marc] Man I can't rent, I owe too much in late fees\n[Cena] Do I, charter a jet, or fly first class?\n[Marc] Do I take a cab? Bus seats hurt my ass\n[Cena] Pay my jeweler in cash, he don't take a check\n[Marc] The chain I rock, leaves a green mark on my neck\n[Cena] Do I get the filet steak or the shrimp & crab mix?\n[Marc] Do I get a number 3 or a number 6?\n[Cena] Get in the club V.I.P. man they lettin me slide\n[Marc] Man they bust me for dress code, I'm still outside\n[Cena] Everybody wanna be down, but I ain't got no friends\n[Marc] Man nobody's around, I ain't got no friends\n\n[Hook]"}], "artist": "John Cena & Tha Trademarc"}