{"songs": [{"album": "N9NA", "image": "https://images.genius.com/8ebb9cdb1a785ebf6dcf120453e6e9aa.1000x1000x1.png", "year": "2019-04-19", "title": "EF U (Easier for You)", "lyrics": "[Intro: Krizz Kaliko & Tech N9ne]\nDon't lay down, lay down\nDon't lay down yet\nDon't lay down, lay down\nDon't lay down yet\nThis is dedicated to the ones that are broken\nStay here with us\nYour time to shine is coming\nTrust\n\n[Verse 1: Tech N9ne]\nDo you know somebody in pain? I know somebody's\nAll fed up and off in the brain, heartbroken probably\nI been broke when life was not gleaming with hope and foggy\nBut I would never dump it on you, then later say sorry, ayy\nIt be the hardest when a loved one's life isn't starlit\nWhen they call you, they think the smartest way out of it is depart it\nYou tell 'em that shit retarded, and hate the call even started\nKnow they heart isn't guarded, not even your art is cathartic\nPlease think about your people, yo\nEase on about your ego, bro\nThat's about far as evil go\nYou don't really wanna fly like an eagle though\nBut in case you wanna know how sin taste\nI wanna try to help another, save a brother from a grim fate\nHow could you make friends break down and act like an ingrate\nSelfishness, that's what it is\nWhen all your family and friends just wanna see a brother live\nBut if you don't see the gutter through, you're gonna leave the others blue\nYou make it hard as fuck for us, but think it's easier for you\nDamn\n\n[Chorus: Krizz Kaliko]\nIt's easier for you, yeah\nTo take yourself away from things we all go through, yeah\nBut if you knew that it was killing me, yeah\nIt's killing me, would you?\nWould you still believe that it was easier to do? Yeah\nWorld ain't never been easy\nDon't lay down, lay down\nDon't lay down yet\nDon't lay down, lay down\nDon't lay down yet\n\n[Bridge: Jelly Roll]\nOnly the angels know the pain that you hold on to\nWhy would you leave me 'lone, just 'cause it's easy for you?\n\n[Verse 2: Jelly Roll]\nI know somebody that's stuck down on the bottom\nAnd he deals with his problems in ways that never solves 'em\nAnd I know how he feels inside\nTry to give him flowers while he's still alive\nI see demons in my sleep\nGot a teardrop falling down my cheek\nDon't lay down, homie, you can't leave me now\nI woke up in the middle of the night, I was drenched in a cold sweat, stressing\nI couldn't fall back asleep, so I picked up the phone and I sent you a message, and it said\nAfter everything that we've been through\nThrough the ups and downs, just know that I believe in you\nYou said you won't leave me, I know I'm a piece of you\nSo don't you make this hard on us just 'cause it's easier for you\n\n[Chorus: Krizz Kaliko]\nIt's easier for you, yeah\nTo take yourself away from things we all go through, yeah\nBut if you knew that it was killing me, yeah\nIt's killing me, would you?\nWould you still believe that it was easier to do? Yeah\nWorld ain't never been easy\nDon't lay down, lay down\nDon't lay down yet\nDon't lay down, lay down\nDon't lay down yet\n\n[Outro: Jelly Roll]\nYou\nIt's easier for you\nYou\nIt's easier for you"}], "artist": "Tech N9ne"}