{"songs": [{"year": null, "image": "https://images.genius.com/502994a09a730898aee4703439b6d8c7.750x750x1.jpg", "title": "Glass House", "album": null, "lyrics": "Feat. Curren$y, Wiz Khalifa\n\n[Chorus 2X: Big K.R.I.T.]\nDon't you want to rest that ass in this glass\nDon't, don't you want to rest that ass in this glass\nDon't, don't you want to rest that ass in this glass house\nIf you ain't sucking or fucking, get yo' ass out\n\n[Curren$y]\nUh, niggas got shows to get to and shit\nYeah, no time for fucking around\nIt's the Planes and the Taylor Gang, yeah\n\nDash digital, situation critical\nHate to make it so blatant baby, but I ain't playing\nMaybe you got me confused with one of them other dudes\nI ain't none of them, under they breath mumbling\nScared to tell them hoes what it is, you put yourself in that position\nI chill with all that baller fishing\nYou fucked around and you caught a shark\nCold heart, tear your feelings apart\nI'm more focussed on getting my rims powder-coated\nOne of the dopest, I'm Schedule 1, you just ibuprofen\nWhat is you smoking? Them bogus growings, they got you choking\nThe option's open, you can hide with them suckers\nOr ride low and get higher than a muh'fucker\n\n[Chorus 2X]\n[Wiz Khalifa]\nUh, straight stunting, sucker niggas, I take from 'em\nThey bitches that is, get up in the car with Wiz\nThey know they gon' bake something, ain't fronting\nSmoke it all, the eighth onion\nGet it twisted cause you see me on your computer screen\nThinking cause you got wireless you get as high as us\nBitches leaving they lame niggas to ride with us\nPlanes over everything, in the fly we trust\nJust by the smell it's obvious that my connect come from Cali\nI'm good long as the money piling up\nAll the while I'm just quick lane pimping, big Jane twisting\nWalking how I talk it, bitch that's Pittsburgh pimping\nYeah, bitch\n\n[Chorus 2X]\n[Big K.R.I.T.]\nYo, now I was candy coated, bending corners, fifth, fifth wheeling\nMade a killing with the bumper grill and chandelier ceiling\nPlush linen, is you fucking? Is you sucking? I was wondering\nCause if not, don't be pushing on my buttons in my cutlass\nUnless you cutting, bitch I'm just saying, I ain't tricking\nIs the reason that this porno flick playing, trunk shaking\nKnocking pictures off the wall, southern mating call\n808 mean no draws, you got friends, I fuck 'em all\nWhat you mean you ain't nasty? Why the fuck you came?\nJust imagine what you got to do to get up in my plane\nMississippi pimp, mouth piece frigid\nDolomite out of sight, show you're right, can you dig it shawty?\n\n[Chorus 2X]"}], "artist": "Big K.R.I.T."}