{"artist": "R.A. The Rugged Man", "songs": [{"album": null, "year": "2017-09-12", "lyrics": "[Intro: R.A. the Rugged Man]\nI said \"I could rap to anything- anything\"\nThey said \"Ugh, Taylor Swift new song, I hate that song\"\nI said \"Yeah, I like that song\nIt's- it's- it's cute, it's stupid, I like it\nUgh, look what you made me do\"\nSo I got to rap to this, I could fucking murder this\nMy daughter's in my arms, let's go, let's do it\n\n[Verse 1: R.A. the Rugged Man]\nYo, yo, the lowest of the trashiest, hookers want me\nBorn insecure rat soup eating honky\nWord to Dolemite fat kid with an overbite\nBefore I ever rode a bike I was born to hold a mic\nLike now you hear my baby in my arm and she cryin'\nShe won’t let daddy put her down when he rhymin'\nAight then, everything I say is frightenin'\nI scare everyone - feminists, gays, straight white men\nHome on the range - buffalo ran free\nLike the one-eyed Jay Clancy can’t see\nHard to smell her \"Barbarella\" Jane Fonda campy\nSneak in ya mama drawer sniffin' on her panty\nIt's intergalactic space molecular\nAronofsky, Mickey Rourke \"The Wrestler\"\nHeat the temperature - Otto Preminger\nThey hate the truth - they wanna kill the messenger\nCock on your forehead, balls on your chin chin\nRussian bitches pissin' on me at the Kremlin\nTrick a dick lick a trend, anything to fit in\nShit and piss I'mma dog, bitch Rin-tin-tin\nOffend women and feminine men\nWith thin skin been swimming in women in Richmond to Finland\nIt’s that rapper, he act tough\nThat rappity rap stuff\nDick slappin' and MAC sluts\nHit harder than Mack trucks\nWanna knife fight leave the white bread dead\nI’m not right in the head like I’m Right Said Fred\nSaid “I’m too sexy for my…”\nTighty whitey drawers and my shit stained underpants\nBass in your face base head drug advance\nYou ain’t hit it right - that’s why you can’t keep her\nNow your face is a bloodbath - you a damn bleeder\nI feed on you insects - I'm an anteater\nI smack up journalist like I’m Antifa\nAnd you talkin' your shit like your boxing is better\nGet ya ass knocked out like you Connor McGregor\nQuick flop drop get stopped from the pressure\nDropped like the charges - Doc Luke/Ke$ha\nWe turn on the news, oh Trump tweeted something\nAnother dumb thing, right or left one wing\nAs my dick bounce in the wind bitch let my nuts swing - sing\n\n[Chorus]\nOoh, look what you made me do\nLook what you made me do\nLook what you just made me do\nLook what you just made me do\n\n[Verse 2: R.A. the Rugged Man]\nYo, yo, Kanye get his head rocked with a headshot\nIf he jump on stage put him in a headlock\nAnd I’m yoking the joker and chokin' the swine\nFuck a confederate flag clothing line\n\"WAIT - this is not hip hop why is he doing this?\"\nYou stupid motherfuckers I do what the fuck I want\nI'mma give you shit for free like I’m Bernie in Vermont\nI'mma lyrical genius and I’m an idiot savant\nWell we grew up in poverty and we ruin your economy\nEnter the promised land like the book of Deuteronomy\nRooting for whose apology, shoot and lose your authority\nRuin your music nominee, do a duet with Amalie\nGun in the window like I’m Malcolm\nThis a throwaway rhyme, wait for the album\nJerry Lewis, Scorsese, King comedy\nRest in peace Dick Gregory, Mobb Deep Prodigy\n\n[Chorus]\nOoh, look what you made me do\nLook what you made me—\n\n[Outro: R.A. the Rugged Man]\nOh, shut the fuck up, I'm done with this stupid song\nCan't believe I did it, fuck you all", "title": "Look What You Made Me Do", "image": "https://images.genius.com/8fff7f98b3275b4fa6a6a43f01159e31.899x899x1.jpg"}]}