{"songs": [{"title": "Chemical Burn", "album": "NBA 2K17: Park After Dark - DJ Premier", "year": "2014-04-18", "image": "https://images.genius.com/49a4f3946e2757fcb0a0307a01c69c4b.719x719x1.jpg", "lyrics": "[Scratching]\n\"It's the Lady Of Rage\"\n\n[Verse]\nIt's time to set it off, bet it all, y'all know who the chick be\nOG with two puffs that look like Mickey\nThere ain't many\nIf at all any who can keep the cracking like me\nWith 'gnac and Henney\nSplatting plenty with Mac and semi-\nYou can't see me never, blind motherfucker Penny\nI'm a cut above the rest, you be that squeemish type\nThat tower in Italy?\nWhat I'ma leave 'em leaning like\nGot monumental potential on an instrumental when I flow through the demo\nSewed up needle and a thimble, weaving\nKim Kimbo\nEnter the Dragon, then spray that flame that's been rekindled\nHotter than the chemical burn\nI blaze\nGo against Rage, better give 'em an urn\nI don't give a fuck if you white, black or mulato\nAsian, American-native or Mexicano\nMano a mano, you don' stepped in some guano\nMess around, playboy, get found drowned in the grotto\nI come out cuttin' and scratchin' my fight game Serato\nMy fight game is Floyd like when he destroyed Cotto\nDumb bells, biting they thumbnails\nBut what one fails to realize is\nStill I rise\nStill I be fly\nStill I'ma fee-fi-fo-fum\nA giant for you new jacks in the land I come from\nSo, middle finger to my critics on the Internet\nDon't be upset cause I'ma vet and I'm not finished yet\nNever forget, I turn a booth into a casket\nThe questions that they askin', is Rage a bastard?\nYeah, I'ma dinosaur\nI'm a Tyrannosaur\nRix-Rex I dare you to come test\nHeifers want beef but shit you ain't that built\nI put carnations on that mad cow and make a pet milk\nYou don't know just how come, I spit tomahawks\nGeronimo, scalp 'em\nEx 'em out El Hadji Malik Shabazz, Malcolm\nLady of Rage, get outdone, by the one you can't out gun\nRelease the Kraken\nI'm a beast when I'm rapping\nExtraterrestrial, sapeo, sexual\nYou think this a game, like basketball trunks?\nWell, I'mma skip the crossover and go straight for the dunk\nI feel like Lisa, lets see, Lopez or Leslie\nNot Waterfalls or injuries can put out my spark\nI'm the flamethrower lead 'em out the darkness\nIt's the world premier, like the birth of Christopher Martin\n\n[Scratching]\nDJ DJ DJ Premier, (say what?!)\nPremier\nDJ DJ DJ Premier\nAha"}], "artist": "The Lady of Rage"}