{"artist": "Fashawn", "songs": [{"year": null, "album": "Higher Learning 2", "image": "https://images.genius.com/e483145f15089213e79bccc6be96eef8.500x500x1.jpg", "lyrics": "Can we get much higher? (So high)\nOh, oh, oh\nOh, oh, oh, oh\nOh, oh\n\n(DJ Ill Will)\n\nYeah yeah yeah yeah\n\nEnough with the sentimental shit\nI’m about to blow, nigga, keep the instrumental lit\nSuited in the Pendleton I came to unclog these rap, blogs\nCongrats hats off to Fashawn\nYou stupid?\nI though I told you muthafuckas\nThought speculation was over when it wasn’t in the kitchen, like\nYou don’t know what’s in the oven?\nI mean the shit is, fucking disgusting\nHow these lollipop sucker ass posing like they got it locked\nNever go outside the box rappers, try me not\nI’m off an OZ of GCK\nBeen moving at a slow speed for three days\nDon’t ever try and come to the West\n[Female voice: you ain’t never been to the West nigga?]\nWithout an extra lung, big gun, and a vest\nAllow me to introduce you to your death\nOpposite AK-47 F\nHa!\n\n(Talking: I’d like to welcome you to Sunday school, man. Grab a seat, put your bags down, and take notes nigga)\n\nCan we get much higher?\nOh, oh, oh\nOh, oh, oh, oh\nOh, oh\n\n(DJ Rockstar)\n\nThey sampling my style fashion a lou\nI hear it in they rhymes who perhaps just a few\nRappers need to get bruised and/or tooken back to school\nRewrite the rules or be just another mule nigga\nUh\nA prisoner a perfectionary sentence I’m sketching\nLike a window or exit escape your mental\nI become a prisoner of perception\nRoll up some indo\nListen for a second, it’s just info\nThis just in: I got a four eleven on a 187\nSomebody laying in heaven niggas ain't playing in C.A\nA lotta shit happening\nThinking about packing and moving to Minneapolis\nDamn\nWe from a culture of capitalists\nCutthroats and savages the utmost embarrassing\nFuck, a nigga might move out of the country\nIf you want me I’ll probably be in Somali sitting comfortably\nDig?\n[Talking: I want to go to Africa I haven’t been there yet we should hit Capetown or Johanasburg, word we ain’t been this high before - Sunday School man]", "title": "Higher (Remix)"}]}