{"songs": [{"image": "https://images.genius.com/09c414e9f279e7fb116729e9ec58e166.300x300x1.jpg", "title": "One For the Butcher Knife", "album": "Rare Demos and Freestyles Vol. 1", "year": null, "lyrics": "[Hook]\nOne for the butcher knife, two for the Glock!\n(You can't kill me, cause I'm already dead)\n\n[Necro]\nPeep my little friend his name is M-1-6\nI got the butcher, knife to cut your fuckin' heart out for kicks\nI'm on a killing spree, like a nigga named Manson\nRight around your grave kid, is where I'll be dancin';\nThe Cha-Cha, you tried to flex and I shot ya\nTen to the head, and now you're motherfuckin' brain dead\nMad Moony need mad clips\nI got more rubber in my Glock than artificial hips\nSo now you're dead kid\nCause you fuckin' bled kid\nEvery time I shot you in your motherfuckin' head kid\nWhen you call my suicidal hotline\nI'll tell you to blow your fuckin' brains out, with a TEC-9\nBlowin' off your lips is somethin' I promote\nSo light up an M-80 and shove it down your fuckin' throat\nThe rougher, the more you suffer, I'm the messiah\nMy rhymes are thicker, than the afro on Richard Pryor\nSo fuck, fuck fuck fuck\nIf you step to the corpse than your goin' to catch a buck\nYou stupid fuck\nCheck out the way the beat grooves\nThey call me horny; cause I fuck anything that moves\nMy fucked up rhymes are sure to offend ya\nSo I'll drive, over your body like the niggas from Toxic Avenger\nRip out your brain through your nose\nAnd when a girl comes over, I got a whole selection of dildos\nSo die motherfucker die\nAnd don't ask me why punks get bruised up like Soleil Moon Frye\nI rock a house party like Molile\nAnd I fucked a dead corpse to techno, cause I'm a necrophile\nSo if you're warm ca-ca, get with this\nIf not i'll bust out my dick, and piss in your esophagus\nI drank a blood donor's deposit\nNow Moony's out like a fagget that just came out of the fuckin' closet\n\n[Hook]\nOne for the butcher knife, two for the Glock!\n(You can't kill me, cause I'm already dead)\n\n[Goretex]\nCheck one, two, I got clout like a mortician\nI got more fresh body parts than Dahmer's kitchen\nA lime to a lemon, a lemon to a lime\nI rock a dead nigga skin every time I drop my rhyme\nThe storm troopers in death gear, that's how it flows\nNo one knows, I want your money and your clothes\nI stink like sex, I rob bitches welfare checks\nAnd I rob more cribs than Malcolm X\nYes it's the butcher with more Dick than Clark\nI love to bash bitches on the head in central park\nPosition, sicko, infamous junkie\nA tek-9 connected to my spine shows I'm funky\nThe fridge is filled with fresh killed body parts\nThe niggas who dissed me, the bitches who broke my heart\nNow I'm mista murder\nThe dildo inserter\nBaptized in blood I'm the celebate converter\nAin't misbehaven\nSick like Wes Craven\nI'll open your mom's legs, vagina's unshaven\nBitin' the heads off Glocks like Ozzy Osbourne\nDead celebrities, with the Children of the Corn\nThe butcher block Glock rock scream until you die\nGoretex put me in the chair till I fry\n\n[Hook]\nOne for the butcher knife, two for the Glock!\n(You can't kill me, cause I'm already dead)\n\n[Ill Bill]\nThe official distorted body parts chop-a-chops your body\nPiece by mothafuckin' piece\nThen I study the anatomical breakdown of the human physique\nThe blood suckin freaks speaks then you drop deceased\nNeed I say more? Maybe I do\nThese days I be grabbin' for my Glock whenever me and my crew\nStep into a nigga pullin' the trigger, this area\nTerritories all occupied by hysteria\nAnd it gets scarier by the minute\nCause I got niggas screamin' just like a bitch at the abortion clinic\nDamned if I do, damned if I don't\nI'll fuck a pregnant bitch up her ass after I slit her throat\nAnd throw her body off of the roof top\nChop chop, then drop pieces, dead celebrities releases\nThe mostess grossest, sicker than multiple sclerosis\nMumbo jumbo, even your brain's hopeless\nCause there's no hope when the camouflage is comin' at ya to gat ya\nFull face mask and Timb' boots to fracture\nYour fucking face takes my size twelve\nMr. Ill Bill is coming straight from hell\nTo fuck up a felon no turning back, my gat crack\nWith hollow tips my tek rips then flips my stack, a fuckin rap\nAfter the blood spoke I smoke another\nAfter I stab up your pops I fuck your mother\nYeah, I'll hit the fuckin' puss with my penis\nMore fractured a chump drop adidas when my meat hits\nBetween, butt cheeks, titties, and cock lips\nMy cock sticks gross\nAfter my jizm jumps that's all she wrote\nCause I'm fuckin detected from the puss to the rectum\nEye sockets to ear drums, the deviated septum\nThen pull out my cock and shoot the bitch with my Glock\nCollect my props, then Bill's out like acid rock\n\n[Hook]\nOne for the butcher knife, two for the Glock!\n(You can't kill me, cause I'm already dead)"}], "artist": "Necro"}