{"artist": "​iLoveMakonnen", "songs": [{"title": "21st Street (Remix)", "lyrics": "[Produced by DJ Spinz & Dun Deal]\n\n[Verse 1]\nOne time for my cut cause you know we stop, whoop\nPut $100,000 in ya ' favorite girl account\n14 carrots in ya' boy ear, 35 go for 40 over here\nShut up girl, you don't know our lingo\nI LOVE MAKONNEN turn a song to a single\nRace me at the party, hell no, we can't mingle\nMake the.. other flavors like Pringles\nSelling the dope we get risky, NYPD don't stop and frisk me\nKeep it OG and ya' bound to get plenty\nMothafuckas' mad cause we known in every city and\n\n[Hook]\nDowntown, on 21st street\nWe take it all around the town in 21st street\nMoney going up-town, money going downtown\nMoney going up-town, money going downtown\nMoney going up-town, money going downtown\nMoney going up, money going down\n\n[Verse 2]\nBallin' on hoes, you know I do\nHave racks over there on North Druid\nHate on me, for what? I don't know\nStraight on thee, the beef is a go\nI know what to do get whisky\nAll the time these fuckas' hatin on me.. Oh whoa, whoa\n36 nines, too high for a bike\nSlap your face twice 'till your eyes get it right\nOn me callin' the po' po'\nSaying he's bringing the nose dope\nWhen you know that tale is a mothafuckin' lie\nCause I'm the smartest guy in the FBI\nRated 2003 on the S.A.T and sold the fuckin' pound at the A.C.T\nAsk the pimps in your town if they know about me\nCause I'm something that the legends all inspired to be\nOn 21st street, I make my money downtown\n\n[Bridge]\nDowntown, down, down, downtown\nI make my money down, downtown on 21st street\nI'm taking it all around the town\n\n[Verse 3: Snoop Dogg]\nThis is the street where it all goes down\nAnd you gotta stand tall, keep your feet on the ground\nKnow, know, bow wow, new style, oh how?\nOn your fucking bitch, I spend a couple thou'\nAnd then you wonder how, I am so original\nPop twice then lean back, smooth like a criminal\nMy nig, these are not antonyms\nThese are mac bars based off Slim and 'em\nA couple pimps on that 21 Street keep that thang\nJust in case ya'll niggas want beef\nSlide stuff, dye stuff, go H.A.M\nI hit the corner in a '78, drop top Boham\nTop back, pop back, right where I was in the fast lane\nFuck a rain in the cup, put the pain in the blunt\nPut the pain in the blunt\nI'm hanging with my niggas, I don't really give a fuck\n21, nigga\n\n[Hook]\n\n[Interlude]\nFuck up off me nigga, fuck wrong with you nigga? This that mothafuckin' straight crack, this that mothafuckin' dead crack right here nigga. What you gone do, you tryna hit this? Or you just tryna' stay here in my goddamn face. Get fuck out my goddamn face\n\n[Outro]\nUh, skurrt, here nigga, hit this weed so you can skurrt\nHit the pound on the ounce and then skurrt\nAll the bitches coming outta town like, skurrt\nI LOVE MAKONNEN, where you at, I had to skurrt\nWhat? Hold up you got the pack? I'mma skurrt\nCome around your town with the sacks like skurrt\nMothafuckas' mad cause I'm back like skrr\nYou know if a fucka' try to sleep on us\nWalk yo' ass up like a line for yo' bus\nBoy don't miss that bus at ya' mothafuckin' school\nYo' ass stupid, you gone be a damn fool\nShoulda' stayed yo' ass in that goddamn house\nNow you kicked out, living like a fuckin' mouse\nI hit the gas on the pedal then skurrt\nDrop the top on bitches down the street and then skurrt\nLoving all the way I got the money like skurrt\nI don't give a fuck bitch you ain't a pretty, skurrt\nI only talk to girls that wear mini skirts\nDowntown on 21st Street", "image": "https://images.rapgenius.com/6a5a01ef4146eeedf7186c01da446717.500x500x1.jpg", "album": null, "year": "2015-01-29"}]}