{"songs": [{"year": "2018-02-09", "album": "Black Panther: The Album (Music from and Inspired By)", "image": "https://images.genius.com/b0ef6cfffeb8c493ca2344f8358e741a.960x960x1.jpg", "title": "Black Panther", "lyrics": "[Intro]\n(Why I go easy?)\n(Know why I go easy)\nWait\n\n[Chorus]\nKing of my city, king of my country, king of my homeland\nKing of the filthy, king of the fallen, we livin' again\nKing of the shooters, looters, boosters, and ghettos poppin'\nKing of the past, present, future, my ancestors watchin'\nKing of the culture, king of the soldiers, king of the bloodshed\nKing of the wisdom, king of the ocean, king of the respect\nKing of the optimistics and dreamers that go and get it\nKing of the winner's district and geniuses with conviction\nKing of the fighters, king of the fathers, king of the belated\nKing of the answer, king of the problem, king of the forsaken\nKing of the empathy, you resent me, king of remorse\nKing of my enemies, may they fall defeat, I rejoice\nKing of the skyscrapers, dodgin' haters, broke religion\n\n[Verse]\nNine faces, go against 'em, I erased 'em with precision\nI embrace them with collision, kings did it\nKing's vision, Black Panther, King Kendrick, all hail the king!\nI dropped a million tears\nI know several responsibilities put me here\nI don't pedal backwards, but I live old-fashioned\nThe lens that I'm lookin' through\nWon't prescribe me the right glasses, masses are now free\nAshes I'm dumpin' out, 'bout to spread all 'cross seas\nSisters and brothers in unison, not because of me\nBecause we don't glue with the opposition, we glue with peace\nBut still'd fuck up your organization if any beef\nWhat do you stand for?\nAre you a activist? What are your city plans for?\nAre you a accident? Are you just in the way?\nYour native tongue contradictin' what your body language say\nAre you a king or you jokin'? Are you a king or you posin'?\n\n[Outro]\nAre you a king or you smokin' bowl rocks to keep you open?\nBecause the king don't cry, king don't die\nKing don't lie, king give heart, king get by, king don't fall\nKingdom come, when I come, you know why\nKING! KING! KING! KING! KING!\nI am T'Challa"}], "artist": "Kendrick Lamar"}