{"artist": "Papoose", "songs": [{"album": "The Fourth Quarter Assassin", "title": "Change Gon’ Come (50 Shots)", "image": "https://images.genius.com/c48bb0ea83ca4ac25d68a3d1da2300c6.320x320x1.jpg", "lyrics": "[Intro]\nR.I.P. to Sean Bell\nR.I.P. to Kathryn Johnston\nR.I.P. to Amadou Diallo\nThe list goes on\nChange gon' come\n\n[Hook]\nIt's been too hard living but I'm afraid to die\nCause I don't know what's up there beyond the sky\nIt's been a long, a long time coming\nBut I know a change gonna come, oh yes it will\n\n(Change gon' come!)\n\n[Verse 1]\nNo justice, no peace\nAnother black man shot dead in the streets\nMake the whole hood feel sad, it's sadness\nBut we feel mad, it's madness\nMike Oliver said his gun jammed, he the main one\n12 year veteran and don't know how to use a gun, think we dumb?\nIf ya clips was loaded to the top\nAnd your gun jammed, how ya fire 31 shots?\nSay you shot at the man cause you thought he was strapped\nBut you killed a man cause you thought he was shooting back\nBlack America, what type of garbage is that?\nThe police academy arming these fools with gats\nIf your reason was you thought he carry a gun\nThat mean you killed him for nothing, cause he ain't have one\nI'm sick and tired of being sick and tired son\nHope change get here before the revolution come!\n\n[Hook]\nIt's been a long, a long time coming\nBut I know a change gonna come, oh yes it will\n\n(Change gon' come!)\n\n[Verse 2]\nPatrick Lynch is an asshole, he siding with the cops\nHe said they wasn't wrong for firin' all 'em shots\nHe said if they felt a threat they 'posed to pop\nAnd they should continue shooting until the threat stop\nThe nerve he got, another word said\nThey should continue shooting until Sean Bell was dead\nBloomberg spoke, but we expect him to\nHe said 50 shots was unacceptable\nAnd he said nobody know how to feel and be another race\nThey don't respect that, they call it haemoth disgrace\nPress conference in front of everybody\nHe responded faster than his predecessor Mayor Giuliani\nSome say he spoke it illogically\nHe got some better manners but let's see if we get some better policy\nDon't fall for it, it's all tricknology\nHope the change get here, before they try to body me\n\n[Hook]\nIt's been a long, a long time coming\nBut I know a change gonna come, oh yes it will\n\n(Change gon' come!)\n\n[Verse 3]\nThe law states a cop is not permitted to shoot at a moving car\nIt don't make a difference if it's coming straight at him, cause if they shoot the driver a 4000 pound car could cause more drama\nBut when I heard Charles Barron speak, I believe\nHe said, \"If we gotta bleed, then others gotta bleed\"\nFive cops placed on administrative leave\nBut they murdered a father, left behind two seeds\nWhy was the cops in the club, drinkin' a bottle?\nWhy was the 41 shots shot at Diallo?\nJohn Podhoretz from the New York Post\nWanna know why Bloomberg and Al Sharpton still close\nI read his article, he question it\nWhy was Bloomberg surrounded by African-Americans?\nI guess the loss of a life was a Mayg\nCalled Sharpton a race-hating-cop-hater\n\n[*50 shots*]\n*Bang Bang Bang Bang Bang Bang Bang Bang Bang Bang*\n*Bang Bang Bang Bang Bang Bang Bang Bang Bang Bang*\n*Bang Bang Bang Bang Bang Bang Bang Bang Bang Bang*\n*Bang Bang Bang Bang Bang Bang Bang Bang Bang Bang*\n*Bang Bang Bang Bang Bang Bang Bang Bang Bang Bang*", "year": "2006-01-01"}]}