{"songs": [{"image": "https://images.genius.com/ad4a1be6f18518362f9affae0015bd6a.500x500x1.jpg", "year": "2011-09-09", "title": "Batteries", "album": null, "lyrics": "Vizzy where your newer shit?\nI'm underground slime, Ninja Turtle sewer shit\nThat joint I dropped in April make them hoes kneel like O'Neal\nYou retired from that green, I'm getting more deals, so ill\nThe shit I spit out of these two lips\nGot me killing the game bring tulips\nAnd I'm throwing out papers like newsies\nSo these girls wanna hang like nooses\nAnd why waste aim on losers\nWhen I'm gunnin' for the top, Tom Cruisin'\nI John Hughes it, I John Holmes it, I go Hulk, and I go Hogan\nNow tell me how I don't kill shit\nWhen I stay bussing like field trips\nThe only time a nigga ever seen me\nIs when he was watching a flim clip\nAnd my old girl say I don't feel shit\nCause I won't stumble over her guilt trips\nMiss her period, saying \"I feel sick!\"\nShe cut that act out real quick\nAnd I'm on my Uncle Phil shit\nThrow out some jazz and get some cake\nYou think those little Nicki's gonna\nMake you fill up banks?\nI don't trust no one but God\nSay my prayers and give him thanks\nPorto-potties on the moon\nMan, I shit in outer space\n\n[Hook]\nSay I ain't gridin', say I ain't focused\nI say \"ok! I'm reloaded\"\nI see the top, that's where I'm going\nI'm like \"ok! I'm reloaded\"\n\nBitch, I'm reloaded\n\n[Verse 2: Trae Tha Truth]\nShots about to come, all I know is reload\nX-Men shit - you can tell 'em I'm in beast mode\nEverything blue, from the dash to the seats ho\nOff in traffic, sliding like I'm on grease road\nI'm on a full speed mission, ain't no brakes\nI'm trying to stay strong like I was on weights\nThey say this my last shot, no more takes\nI got (?) at slow rates\nMy ex-bitch tripped out, that's what she gets\nSaid I wouldn't be shit, I need a hit\nNow every time she turn on the TV\nI tell her watch close, see the money that a nigga get\nI got the streets on fire\nI'm looking at the top, I'm 'bout to take aim\nEven if I miss, I'll be back at it again\nAnd if I lose, I'll be back at it to win\nI been a fighter, never been a quitter\nThe world mine, told her I was on my way to get her\nLeave they face looking like they ate something bitter\n(?), ain't nobody finna enter\nSay XV, it's OK\nI loaded up, this A-K\nSomebody finna get it, I bet it ain't me\nSo it must be them - don't play\n\n[Hook] x2\n\n[Verse 3: XV]\nOK, I'm reloaded\nBatteries in my controller\nMake casualties out of my opponents\nAnd make money for the niggas I roll with\n'Til all my brothers is rich like the Jacksons, like the Jonas\nMaybachs I can’t afford, so 'til then I’m focused\nMaking my presence with this rapping so I purchase what I wish\nCause even with my curses, all these verses are a gift\nSaid I'll be shooting for the stars, so it ain't worthless if I miss\nBut if you playing to hit the clouds, so just come down with a bunch of regrets\nThrough all the doubters, the way I still put these words together\nGot me more connections than routers and surge protectors\nI'm what happens when awesome and awkward merge together\nI been killed the game, these lames expunged my murder record\nYou get comfy with that crown that you got\nAnd you'll get lapped to the top like a Mac out the box\nThey say \"We just wants some music. Is that asking a lot?\"\nI say \"OK. I'm reloaded,\" pull that mac out and pop\n\n[Hook] x2"}], "artist": "XV"}