{"songs": [{"image": "https://images.genius.com/589e2629cb104e3a61f8fdd99be704ce.500x500x1.jpg", "title": "Cashin’ Out (Freestyle)", "album": "Scorpio Season", "year": null, "lyrics": "[Intro]\nYea!\nCash out! You Know we had to put some Saint Louis on herre huh?\nOnly right\nNorthside, southside, (Where ya at?) Westside, East Saint (Where ya at?)\n(Where ya at?) U-Town\nWhere you at? (repeats until song starts)\nTURN IT UP!\n\n[Hook]\nI'm on Natural Bridge, coming down down with that Nina (With that Nina)\nIn a drop top, lambo in my wife beater (in my wife beater)\nI got a bad bitch named Keisha rolling that Keisha (Rolling That Keisha)\nAnd later on I got a few things I'm gon teach her (I'm gon teach her)\nGot a mansion round my wrist girl, and I'm cashin' out (I'm cashin' out)\nGot a V-12 in my whip mane and I'm mashin out (I'm mashing out)\nGot her legs wrapped round my waist mane, I'm smashin' out (I'm smashin' out)\nPut 'em up around my neck girl, and I'm eatin' out (I'm eatin out.)\n\n[Verse 1]\nYea, It's on (It's on)\nTell me what you want (What you want)\nIt's yo choice baby just tell me what you want (What you want)\nDon't worry bout it cause everybody in here grown (in here grown)\nWe turned up, turned Up-Up-Up like yo phone (Sheesh!)\nShorty got a body so bad make a nigga say (Sheesh!)\nI got a fully automatic when I cap, make a nigga say (Sheesh!)\nSt. Louis, all the weight that im makin'\nI got fat niggas talkin', slim niggas hatin'\nWanna be The Man, but I'm sorry that's taken BOY\n\n[Hook]\nI'm on Natural Bridge, coming down down with that Nina (With that Nina)\nIn a drop top, lambo in my wife beater (in my wife beater)\nI got a bad bitch named Keisha rolling that Keisha (Rolling That Keisha)\nAnd later on I got a few things I'm gon teach her (I'm gon teach her)\nGot a mansion round my wrist girl, and I'm cashin' out (I'm cashin' out)\nGot a V-12 in my whip mane and I'm mashin out (I'm mashing out)\nGot her legs wrapped round my waist mane, I'm smashin' out (I'm smashin' out)\nPut 'em up around my neck girl, and I'm eatin'out (I'm eatin out.)"}], "artist": "Nelly"}