{"songs": [{"year": "2016-08-28", "album": null, "image": "https://images.genius.com/f1044b69e4a7358f999ef8a9f7c4c6ef.300x300x1.jpg", "title": "Harambe (Remix)", "lyrics": "[Intro]\nEh, Knowledge, nigga\nPay attention one time\nLawd, eh, Knowledge, nigga\nLet's do it\n\n[Verse 1]\nGive me a second to think, I got a story to tell\nThe way a nigga excelled, I swear the lyrics compelled\nI put my life in every line, typewriter I is\nOh word little nigga, you don't like my shit?\nI ain't workin' with nobody 'less they pay a pretty penny\nEnvy and jealousy coming my way oh lord\nI'm the sickest composer\nMasterfully we have chosen to put ourself into the position to work with no rest\nI'm stretched to my limit, invested, I'm in it\nThe effort I'm giving, a Psalm of repetition\nI'm the definition of an independent man\nAnd my declaration's like a deposition\nWas indoctrinated to the way that I'm living\nI give a sentence of pure pain, it's definitely profane\nThese pitiful people [?] the process\nThey hate it till they see you making financial progress\nEvaded the nonsense, you're loving the contents\nAffecting your conscience, they're telling a tall tale\nI'm making a deep swell, I'm bumping some Maxwell\nAs soothing as Advil, I'm colder than Kool Herc\nI said it again, yeah let me maximize it\nNo surprise, they pry\nI pride myself on patience\nThe stars align, in time they'll see my greatness\nI sense a change, the scent is fucking fragrant\nThe vein in [?], I victimize with vengeance\nSo leave a comment if you feel offended\nI vent inside the verse with pure intentions\nI'm isolated, talking to myself\nAnd I'm pacing back and forth, I cannot help it\nI told the truth, my testament's anew\nI will not conform, refuse to be aloof\nI'm the loosest cannon, cock it back and shoot\nI'll impale the person you compare me to\nAs a [?] part the paragraph then share it\nCoherency is negligent, I change the flow, diversify to gentrify\nMy mind it works in ways that you'll never imagine\nI'm a literal problem with the realest of causes\nI'm a literary monster, my style's atrocious\nI ain't fucking with you niggas, I avoid the vultures\nReally spit it from my heart because I love the culture\nLord forgive me for my sins, you know I tried to repent\nI played the hand I was dealt, I never once complained\nSo when I write it and record it, I am grateful nigga\nIt's a blessing to have a talent and share it with some\nI never overlook it, that's distasteful\nI'm a risk taker and and an innovator\nFeel like I was conceived inside an incubator\nBut my glass house, they throw stones at it\nSo I never crack, I said we bouncing back\nI never leave my room, a hypochondriac\nI cannot trust a soul, I swear to god they fake\nAnd when you think they real, that's when they turn on you\nIt's a fucking disease\nYou wanna [?] at me?\nI do everything myself, look I have to focus\nI got things that I want and I will accomplish that\nI suggest you invest in some more intuition\nSo take all that in, let me breathe for a second\n\nThis nigga Sam said shout me out. Here's your shout out Sam, uh you're gaining weight, you're getting fat as fuck. You are now built like the Michelin Man, I don't know what the fuck happened to you\n\n[Verse 2]\nAnd I swear to god that I'll never change\nNo I'll stay the same till I fall off\nAnd them niggas said I was lame, I do this alone\nIt's motherfuck all y'all\nHad meetings at labels [?] records\nBut oh no I ain't get called back\nMy confidence took a shot, that shit left me jaded baby\nI can admit that\nI just can't fuck with you niggas, y'all lying on records\nYou niggas [?]\nI just hope you hear me lord\nCause I kept the faith my nigga believe me\nAnd I never asked for a lighter load, just a stronger spine\nGot a lot on my plate so I'm fucking blessed\nI would rather be busy and get no rest\nThe alternative never been interested\n[?] check from [Spotify?] my dividends\nIndependent my hustle, I get it in\nShit I feel like my daddy in '96\nStacking paper, working, screaming \"fuck a bitch!\"\nI've been plotting quietly, I'm secretive\nMan these snakes in the grass on that sneaky shit\n[?] and [?] I swear I do\nMan I'm high as fuck, I need a parachute\nBoy these pussy niggas bought a pair of shoes\nI've been saving money, no I never spend it\nI don't have an interest in the diamond pendant\nShit, I'm trying to help my parents pay the mortgage\nWhy you focused on things that you can't afford?\nIf that's your plan then you should abort it\nBought an ounce of holy water, sanctify ya\nI get no sleep, I might OD\nWhen it's OT, I revitalize\nBitch I feel like a [?] you'll never stop me\nRather have my feet hurting and not my pockets\nBoy the effort that I'm giving is Herculean\nFuck a comment, I'm constantly in the zone\nWhile I'm working, you procrastinating at home\nThat's it"}], "artist": "K.A.A.N."}