{"artist": "Immortal Technique", "songs": [{"title": "Open Your Eyes", "lyrics": "We're here because of you\nWe're here because you were there\n\nWe've arrived from every corner of the planet to this nation to seek the fulfillment of a promise of America. We were promised a better life in our home countries, where we were told that privatizing water and electricity will make things run more efficiently. Instead the quality remained almost the same and the price was increased until it became an unaffordable luxury. Some corporations are more efficient than government, but their motivation is not the health or the well-being of the people; it's only about profit. Everything else—their image, their human resources, their public relations—only exist to protect the reality behind it. Once upon a time we were told that nationalization would prevent growth by limiting competition, that our countries were nothing without the companies that invested in us, and so they privatized everything. Everything in our country was owned by people that had no connection to our culture, by those who never had our interests at heart. They didn't care about our survival or well-being—they just wanted to turn a profit by raping our land, by exploiting our people, our industry and our resources. They took everything we built and made it theirs, first by creating racism to justify slavery, building the capital for capitalism, and then when they gave us what they call liberty, everything we had was still owned by them. Our governments told us that socialism was the real enemy, and that we would have freedom, but the foreign powers and corporations were the ones with real freedom, the freedom to take all the wealth generated by our work and our land and gave us only a small percentage of the scraps from the table. Their lust for power and their greed drove them to betray not only us but themselves and the word of their own God\n\n(Open your eyes before you die)\n\nAnd while some used missionaries and donations to off-set this abuse, other countries and companies were blatant with their crimes, using war, disease, and sanctions that killed millions. They supported corrupt governments that were almost like the old slave masters in their oppression of the people, because their loyalty was to those who enabled them, and stored them and kept them in power. They became the bastard children of American industry, kleptocracy, governments of thievery. They protected the corporations and went to war against their own people to preserve those profits. The puppet rulers were given billions of US tax dollars to fund civil wars, right wing death squads, execute political dissidents, sympathetic clergy, and even overthrow democratically elected governments. And so the age of revolution began again. They painted it as godless terrorist versus the free world and the free market. But the free market has never been free, because the market does not regulate itself. It is manipulated like a puppet, and it survives because of its image. Destroy the image, and the enemy will die. Such is the same in the rap industry. But the major label super powers treat the underground like the Third World. When they need new assets, new artists to prostitute a side-ins, and put on a shelf to use their songs; when they needed new concepts, music and publishing to steal from the producers, they came to the underground, to the Third World. They took our culture, our property and our industry and our resources, even using our own people to help them exploit us. But behind the mask of efficiency, they claimed that we need them to succeed. They're no better than us. Their economic advertising was always a lie. A few got rich, but most were given an illusion of wealth, almost as if it was designed for failure. Opportunity comes at the price of the soul in the music, so remember what they are underneath the fancy architecture, glittering rented jewelry, the cars, the IMF loans, the seeds with suicide genes, 20-year contracts, and oil blood money. Build your defenses, my independent brothers and sisters. They’ll stop at nothing to get what they want. They paint the Third World underground as savage and backward. But the super powers are no less corrupt; they've just learned to disguise it better, ‘cause they fix elections too, they embezzle tax money, they go to war for resources, they fund terrorism for their own benefit. And when there's enough at stake, history's taught us that they'll even assassinate their own presidents\n\n(WAKE UP!)\n\n[Ronald Reagan recording]\nJust as the Columbia represents man's highest aspirations in the field of science, so too does the struggle of the Afghan people represent man's highest aspiration for freedom, and I am dedicating on behalf of the American people the March 22nd launch of the Columbia Space Shuttle to the people of Afghanistan", "image": "https://images.genius.com/cbb36cff0867b087bc47fcf98b7cd803.300x300x1.jpg", "album": "The 3rd World", "year": "2008-06-24"}]}