{"artist": "Drake", "songs": [{"year": "2017-03-18", "album": "More Life", "image": "https://images.genius.com/4672f8523e0fbf7f7848185256e946f4.1000x1000x1.jpg", "title": "Can’t Have Everything", "lyrics": "[Verse 1: Drake]\nUh, man, fresh up out the sand, February tan\nIt's The Boy but I'm still the man, come and get your mans\nI don't know, first you caught the hands, then you took the stand\nIt's a joke, but you say you real—I don't understand\nOn a yacht, me and all the dogs actin' like some dogs\nWe evolved, used to think vacation meant Niagara Falls\nSwear to God, shout to Buffalo, never duckin' low\nI don't stop, man, I'm stuck on go, always hug the road\nFuck a opp, make his body roll, yeah, a lot of those\nStarted out doin' college shows, Calipari flow\nThen I popped like you never seen\nWe with everything, I went off in the '16, give me '17\n\n[Chorus: Drake]\nWant a lot, can't have everything, can't have everything\nWant a lot, can't have everything but I want everything\n\n[Verse 2: Drake]\nBad attitude, tellin' who to calm down?\nTryna cool it all down, who's callin' my name?\nWho's involved now? Tell me who I gotta down\nI'll do a song now, man\nEven though there's way less to prove to y'all now, man\nEverything that went around is comin' back around\nY'all better hit the ground\nGoddamn, beef forever unfinished\nYeah, it's all open-ended, had me off for a minute\nHad you all since beginnin'\nDamn, I must be coachin', 'cause I'm not playin' with them\nCan you not see the difference?\nI mean, I keep the fuckin' lights on in the buildin'\nMan, my record deal should be 500 million, goddamn\n\n[Chorus: Drake]\nCan't have everything, can't have everything\nWant a lot, can't have everything but I want everything\n\n[Verse 3: Drake]\nFinally got my mind in a free state\nNiggas tried to serve me up a cheesesteak\nI gave them back a clean plate\nSame niggas preein' cause they hate to see the team straight\nSame niggas beakin', always duckin' my release dates\nThat's when the phone starts ringin' like, \"Are we straight?\"\nTwo-faced niggas back around with the three face\nDamn, ol' triple double, Russ face, watch with the bust face\nNever-met-the-plug-but-I-rap-about-the-plug face\nNever-met-myself, I-don't-remember-who-I-was face\nY'all fuckin' hilarious\nY'all really think y'all niggas teamin' up is scarin' us\nY'all niggas is arrogant, y'all sleep at the Sheraton\nAll that shit embarrassin'\nTell your big homie I'm all for goin' there again\nHe ain't even die and I ball with his inheritance\nAll that's in my account at the Bank of America\nAll that Drake hysteria\n6 side, East side, all that for my area\n\n[Outro: Sandi Graham]\nYou know, hun, I'm a bit concerned about this negative tone that I'm hearing in your voice these days. I can appreciate where your uncertainty stems from and you have reason to question your anxieties and how disillusioned you feel, as well as feeling skeptical about who you believe you can trust. But that attitude will just hold you back in this life, and you're going to continue to feel alienated. Give some thought to this, because I’m confident in you, and I know you can reach your desired destination and accomplish your goals much more quickly without this confrontation I'm hearing in your tone these days. When others go low, we go high."}]}