{"songs": [{"year": null, "title": "Damage 96 (Live on 09.3 WRIU)", "image": "https://images.genius.com/c91c4b7e3aa8a9503855d1070f1f85cd.640x640x1.jpg", "lyrics": "I'm all by myself sittin' thinkin' what the fuck happened?\nWhere the hell I go wrong, I'm tryin' to be strong\nBut when I flex my muscles cramp and tighten\nThey got my frightened\nAnd in a war\nThe kind I used to always win before\nBut now it's different\nVictories are hard to come by\nThere's early death for young guys\nBut everyone dies so they say, \"Hmmm\"\nBut I ain't no exception\nMy mortal force lost support, they're vulnerable with no protection\nI walk the tight rope, thinkin' that I'll be saved by a net if I fell, slipped\nAnd almost get sent to Hell\nI don't wanna pull no life threatening stunts\nWithout thinking it over more than once\nWhich is often\nChoose your coffin\nUnless you don't plan to die\nWhat kind of man am I?\nLearn your lessons and kill the questions\nI find an answer from within\nFuck the color of my skin, forget my freedom of religion\nEveryone knows our violent history from the books\nWe're war mongers, rapists, racists and culture crooks\nIt ain't no mystery\nBut it ain't all in black and white, society is littered with grays\nAnd I'm tryin' to gain some insight\nSome believe a species of another kind\nOn the other hand we got people who are acting like they color blind\nWhat's America?\nMelting pot or tossed salad?\nToss the ballot out your mouth by now of course it's invalid\nAnd don't make no difference\nIf anything it hurts our progress\nTake it to congress\nEverything's such a long process\nNothing's efficient\nI used to strive to towards being perfect\nBut there's so much worthlessness in this world it just ain't worth it\nI've come to this conclusion\nWe're livin' an illusion\nWe slaughter guys cause we can't Organize Konfusion\nResulting in a conspired genocide\nKinda makes me want to pick up my sword and put my pen aside\nTo do damage\nUh\nDamage\nUh", "album": "Still Sickly Business"}], "artist": "Sage Francis"}