{"artist": "Phife Dawg", "songs": [{"album": "Ventilation: Da LP", "title": "Miscellaneous", "image": "https://images.genius.com/7b15bd4cebb535f1f46449b1258fd434.500x500x1.jpg", "lyrics": "[Intro]\nMiscellaneous shit baby, meanin..\nI'll make you wanna..\n\n[Hook]\nRock to the joint, roll up a joint\nBust shots to the joint, Spike Lee to the joint\nBounce to the joint, screw to the joint\n(Say what?) Yeah, you know it's on point (uh huh)\nJust vibe to the joint, ride to the joint\nBump 'n grind to the joint, then skate to the joint\nNow slide to the joint, act wild with a joint\nHuh, once again it's on point, come on (here we go!)\n\n[Verse One: Phife Dawg]\nParty over here, fuck y'all over there\nDrinks on Malik, ya live once, I don't care\nLove the night life like Sonny love Cher\nBound to take a shorty home, put her ass in the air\nLook at Miss Thingy, I heard she type pissy\nOne that'll have simple ways, that'll block and get busy\nFat Joe, Pun said it's all about trizzies\nSpit the game in her ear, in the coatcheck chick\nHad to give it to her, came out, pull out my zipper\nNow I'm like \"WHOA\" cause her come my baby father\nShit money big, now I think I'm gonna need back up\nHe walked right next to me and smacked her ass up\nWHOO that's a close one, here let me bounce\nThird floor, gotta see who else is in the house\nUp north, reppin with these chicks from down South\nShorty sippin Hennesey, singin 'put it in your mouth'\n\n[Hook]\nRock to the joint, roll to the joint\nBust shots to the joint, Spike Lee to the joint\nBounce to the joint, screw to the joint\nUh, you know it's on point (no doubt)\nVibe to the joint, ride to the joint\nBump 'n grind to the joint, unwind to the joint\nSlide to the joint, act wild to the joint (yeah)\nYou know it's on point, c'mon!\n\n[Verse Two: Phife Dawg]\nOn towards chillin, now we at the after party\nCom' Sense, Mos Def, fuck it - everybody!\nFuck chillin at the tele, I'm scoopin me a hottie\nChillin load of girls, and those shorties lookin sloppy\nCame to the door, made the dancefloor wild\nShorties \"Sayin My Name\" like Destiny's Child (aah)\nSo I just smile, get em thirsty like 'ow'\nI know I'm type foul, trippy steady on a pile\nEyes wide open like a motherfuckin owl\nWho's this tig bitty chick with the Colgate smile?\nSaid her name was Tafy, with nose by to act me\nStraight from St. Louis, said she'd love to do me\nSmacked on her ass as if she worked at Big Skippy\nWanted to give my neck a hicky, but something 'bout her's tricky\nLooked at the bar, oh shit it couldn't be!\nThe J to the A to the N to the E\nYou don't understand? Ask EPMD!\nThinkin to myself, goddammit why me?\nThinkin to myself, goddammit why me?\nThinkin to myself, goddammit why me?\n\n[Hook]\nRock to the joint, roll to the joint\nBust shots to the joint, Spike Lee to the joint\nBounce to the joint, screw to the joint\nUh, you know it's on point (no doubt)\nNow vibe to the joint, ride to the joint\nBump 'n grind to the joint, unwind to the joint\nSlide to the joint, act wild to the joint\nYou know it's on point (no doubt, no doubt)\n\n[Outro]\nYou know it's on point (no doubt)\nYou know it's on point (no doubt)\nYou know it's on point (on point..)", "year": "2000-09-26"}]}