{"artist": "360", "songs": [{"album": "What You See Is What You Get", "year": "2008-03-22", "title": "How Good?", "image": "https://images.genius.com/b01a68880fdf408d16b94407da51e8b8.600x598x1.jpg", "lyrics": "[Intro:]\nKeeping time with the awesome view\nCause what you give (what you give)\nIs coming backing to you\n(how good)\nIt's 360\nI had to get my partner in crime on this one\nEverybody meet big lip Pez\nNow this is my lead single, so you know it's good\nHow good, six? Pretty good, mate you know check it\n\n[Verse 1: 360]\nFirst of all these days are full of cliche, peak game\nAll you dudes need change\nYou need to rearrange, switch up your game plan\nDress like me in the dark with your Ray Ban's\nAll your clothes should be name brand (Stuss!)\nAnd only go for girls with bleached hair and fake tan\n\n[Verse 2: Pez]\nNot me, I'm sipping liquor with vigour until I face plant\nWhile I'm in this same stance, that's right, eighth can\nYou know the type you see acting like a cave man\nWho hasn't got rhythm so he has to watch his mates dance\nI'll be out till they close the city\nYou know I'm representing Dipper in my clothes from Dimmy's\n\n[Verse 3: 360]\nYo, we think were top shit cause we're mates with the bouncer\nWe're walking straight through while it takes you an hour, ha-ha!\nWhere's the lynx, fuck taking a shower!\nThe girls are like cakes with their face full of powder\n\n[Hook:]\n(How good is your game?)\nHow good is your game? Just tell me (The game you play)\nForget following trends, we're not copying them\nNo way!\n(How good is your game?)\nHow good is your game? Just tell me. (The game you play)\nSo so\nIf you're a stereotype then get to steppin' aside\n\n[Verse 4: Pez]\nI understand why you look all sad\nCause all the emos that we know just need hope\nBut I'm sick of cats all wearing these fitted hats, cause that stickers whack mate, you need to get rid of that\n\n[Verse 5: 360]\nYo all that money that you spent wasn't worth it man!\nFuck fitted hats; me I'm more of a turban fan\nMy styles bummy, I shop around for worser brands\nBut fuck it up rockin' kicks that are worth a grand\n\n[Verse 6: Pez]\nYou know the circumstance, get a bourbon and try to work a girl by returning her a nervous glance\nShe thinks that I'm a surfie with a perfect tan\nSo I tell her listen we're not rappers we're an urban band\n\n[Verse 7: 360]\nYo we're the raver dudes flippin' out in purple pants\nChatting pig Latin for smoking on the herbal plants\nUck-fay, ou-yay! Monday, Tuesday!\nWhose your favourite rapper, guys?\nKanye, Lupe! Ha-ha, it's not even!\n\n[Hook:]\n(How good is your game?)\nHow good is your game? Just tell me (The game you play)\nForget following trends, we're not copying them\nNo way!\n(How good is your game?)\nHow good is your game? Just tell me. (The game you play)\nSo so\nIf you're a stereotype then get to steppin' aside\n\n[Verse 8: 360]\nI lose control when I groove to the beat\nI swing my torso without moving my feet\nAnd I like to nod my head if it's a suitable beat\nWith a nice smile showing off my beautiful cheeks\n\n[Verse 9: Pez]\nThis dude, he can move and it's truly unique but see I'd rather get down counting my steps out\nCause I don't dance or even think of it brother\nAt my shows the whole crowd are walking into each other\nI can't dance for shit\nI can't stand or sit but it's clearly understood I walk really fuckin' good\nSo just trust me, don't test my walk, the rest all talk shit but when they step on the floor they get smoked\n\n[Verse 10: 360]\nHey, you know he's doing the walk\nIt's no joke, yeah, so watch me do it some more\nAnd nowadays everybody's looking the same\nAsk yourself one thing; how good is your game?\n\n[Chorus]\nHow good is your game?\n(How good is your game? Just tell me.) The game you play\nForget following trends, we're not copying them. No way!\nHow good is your game?\n(How good is your game? Just tell me.) The game you play\nSo so\nIf you're a stereotype then get to steppin' aside\nHow good is your game? How good is your game?\nThe game you play\nHow good is your game? How good is your game?\nThe game you play\nHow good is your game?"}]}