{"songs": [{"year": "1999-10-26", "title": "Not Fa’ Nuthin’", "image": "https://images.genius.com/9841a200e7b94485d7e2a91b3dbd2520.700x700x1.jpg", "lyrics": "[Chino XL\nSaafir]\nYou locked down with no bail money to get yourself loose?\nNot fa' nuttin'\nThat's not what a thug would do\nUh-uh\nI hit you girl for free and that's alright wit' 'chu?\nNot fa' nuttin'!\nThat's not what a thug would do\nNope\nCaught slippin' wit' no heat inside your bubblegoose?\nNot fa' nuttin'\nThat's not what a thug would do\nUh-uh\nPretty skillianaire niggas about to spit it at 'chu?\nNot fa' nuthin', that's somethin' that a thug'd do!\n\n[Saafir]\nNot fa' nuttin'. I'll jump out that mild-mannered frame of glasses\nAnd start whuppin' your ass. It's the rap game killa masta\nKid who has a pool room with business and non-stop blastin' shit\nTore cagenin' in what your lungs' incased in\nNo comic book animation, just assassination\nAll you fake-ass nigs would kill a fasination\nCosmetic niggas would feel this villain plastic facement\nCall me Father Red, but for you, you think I'mma get a higher rankin'?\nYou fly cats is chickens, you featherless\nWhile you tryin' to get millions, I'm trainin' as a United States terrorist!\nDrombin' these bomb before your planes get off the ground\nBlowin' out the pilot and all flames that sound the same\nY'all niggas is B-12 bumped up wit' a pound of fame\nI'm thirty-two degrees below freezin' in the game\nBut some of you love, gettin' crossed in the pair of pliars\nI'mma call high yellow nigga keepin' hoes duckin' like a hair dryer\n\n[Chino XL\nSaafir]\nYou locked down with no bail money to get yourself loose?\nNot fa' nuttin'\nThat's not what a thug would do\nUh-uh\nI hit you girl for free and that's alright wit' 'chu?\nNot fa' nuttin'!\nThat's not what a thug would do\nNope\nCaught slippin' wit' no heat inside your bubblegoose?\nNot fa' nuttin'\nThat's not what a thug would do\nUh-uh\nPretty skillianaire niggas about to spit it at 'chu?\nNot fa' nuthin', that's somethin' that a thug'd do!\n\n[Chino XL]\nI kick that fly shit, my shit is New Jersey drive shit\nThat B.-I.-G. 'Ready To Die' shit, 2Pac 'All Eyez' shit\nThat classic hot shit, Jag in garage shit\nYou braggin', ain't got shit. Complainin' 'bout my shit\nPaChino's above average. Product of a mixed marriage\nI'm violent, you better be silent like the 'J' in spanish\nImmacurate, saw moons and stars and flames in back of it\nRap past the untalented. Dangerous, haters try to silence it\nCouldn't accomplish it. I'm bringin' the ruckus, I promise it\nMy skills are polished it. 'You wack, nigga.' I'm wack's opposite\nDrama's been poision pen venom bent up inside of your brain\nMy lyrical syringes for dope fiends to take my name in vein\nPhysical frame, the heron Frankie Lyman over-dosed on\nI'm strong, I make you look weaker than Usher wit' no shirt on\nI still attack tracks like two young-G raps\nThis industry's ill, it's a bunch of hyperchondriachs\nAnd I'mma smack ya face off ya face for bitin' rhymes\nLike I've more skills than you niggas if you practiced for three lifetimes\nLyrical hangtime. You wacker. Jump in the time machine\nAnd soft the vagina that half of these rappas came out of\n\n[Saafir\nChino XL]\nYou locked down with no bail money to get yourself loose?\nNot fa' nuthin'\nThat's not what a thug would do\nUh-uh\nI hit you girl for free and that's alright wit' 'chu?\nBut not fa' nuthin'\nThat's not what a thug would do\nUh-uh\nYou caught slippin' wit' no heat inside your bubblegoose?\nBut not fa' nuthin'\nThat's not what a thug would do. Pretty\nSkillianaire niggas about to spit it at 'chu?\nBut not fa' nuthin', that's somethin' that a thug'd do!\n\n[Chino XL\nSaafir]\nI shine like Bruce Willis's bald spot in the sun rays\nI'm a mad rappa, beat you like the editor of 'Blaze'!\nFor real cause Bill Clinton look like George Clinton cause he got\nFunked with Parliament, the Congress but I done funked all of it!\nSick tales from the male Mary Magdaline. Chino's so raveshing\nYou couldn't double X-L if you was the magazine\nThe black Nazerine, takin' charism. The hell in the battle\nYou mix with sugar and shit spice, you're not add ho!\nYou're gettin' sex pay-back from my lyrical syntex\nNigga, ya index finga wouldn't trigga a bottle of Windex\nAnd I forgot more lyrics then you will ever write. Tight wild like\nEddie Murphey gettin' caught with that transvestite on that night\nYou cats might get put to sleep like pills I be nodding on\nFoldin' niggas' Averexes while they still got 'em on!\nBuildin' underground side holes with lights dimmer than the ones in\nBiggie Smalls's hallways. Colder than a menthol lip that's\nHaulin' rap in the fall. My foot deep in the ass of\nNiggas that's Glock rhymin' me. I do to your future, dog\nI'm savage. That word is describin' me\n(\"Scribin' me. Scribin' me...\")\nChianardo DiCaprio been known to slap a ho\nWhat?\nI'm from that indian tribe called Nava-love-a-ho\nI'm ill when I'm behind the feline butt-crack\nThey say, 'How do you stay hard as hell?'\nIt's the barbell ring in my nutsac!\n\n[Chino XL\nSaafir]\nYou locked down with no bail money to get yourself loose?\nNot fa' nuttin'\nThat's not what a thug would do\nUh-uh\nI hit you girl for free and that's alright wit' 'chu?\nNot fa' nuttin'!\nThat's not what a thug would do\nNope\nCaught slippin' wit' no heat inside your bubblegoose?\nNot fa' nuttin'\nThat's not what a thug would do\nUh-uh\nPretty skillianaire niggas about to spit it at 'chu?\nNot fa' nuthin', that's somethin' that a thug'd do! (\"Uh-huh.\")", "album": "The Hit List"}], "artist": "Saafir"}