{"artist": "Apathy", "songs": [{"title": "Dear Lord", "image": "https://images.genius.com/073ac226410c8abcffb60094f9a7e61b.700x700x1.jpg", "album": "Honkey Kong", "lyrics": "[Intro]\nTime is running out for the planet Earth\nI didn’t choose to live\n\n[Verse 1: Eternia]\nDear Lord, remind my soul when I get older\nWhen fingers aching, feet are asking when this path is over\nWhen life is closer to the end than when I entered in it\nWhen 80′s babies are extinct and so my time is finished\nI wanna feel you, feel you like the love of kisses\nSkin of another breath tickles when they enter\nWanna know you like the man and woman in the Torah\nOne flesh living and loving each other like they’re supposed to\nWanna see you, every moment’s sacred, every second\nAnd my body is the vessel that your spirit climbs into\nDear Lord, I have so many questions I can ask you\nI wonder why you let me write my life into disaster\nI wonder why you let others suffer more than they have to\nIf Satan’s the one to blame then why’d you create the bastard?\nJust wondering, my curiosity I gained from it\nWas a gift from you since I was planted in mama’s stomach\n\n[Hook x2: Eternia]\nDear Lord, do you think that you can answer?\nI got a couple things on my mind to run past you\nSo if you don’t mind Lord can you hear me?\nAnd if you got the time, Lord can you hear me?\nDear Lord\n\n[Verse 2: Apathy]\nDear Lord, I’m trying not to hate you\nYou filled my father’s body full of poison and it’s painful\nCan’t you just cancel the cancerous candles at its wick\nHad to pick my dad to get sick? How sad is that shit?\nA billion better candidates, in fact I can make a list\nHow about a rapist or a racist or a Satanist?\nDear Lord, I’m fucked up in shambles\nI thought you weren’t supposed to give me more than I can handle\nAnd not to blasphemous but Lord I gotta ask this\nHow you let adults fuck children in their asses\nHow you let these evil motherfuckers rule the masses\nAnd jack the lower classes until the stock crashes\nI’m sick of evil getting over and me I’m trying to be a better man like I’m supposed to\nTrying to stay sober cause I’m running out of chauffeurs\nAnd rap’s my only way to sit and talk with Jehovah\n\n[Hook x2]\n\n[Verse 3: Diabolic]\nDear Lord, I need you, please communicate\nAcknowledge that you hear me clearly, I’ve been losing faith\nWas it Adam fucking Eve speaking to a snake\nOr did evolution through an ape create the human race?\nI need to know was it planned or do I choose my fate?\nAnd if I do I need insight on the path that you would take\nDear Lord it’s hard to sit and pray\nWhen drug dealers get to live as little kids are hit with strays\nGoddamn you, I swear if I could stand in your place\nThe gunman’s hammer would break and just jam in his face\nWhy are war games in your name? Is there a true religion?\nIs it Muslim, Jew, or Christian? Or is it superstition?\nI could use a vision, visit when I’m dreaming\nWhat’s the purpose? What’s the meaning of this life I’ve been leading?\nLet me know, do you even listen when I’m speaking?\nAnd will you intervene when I’m possessed by inner-demons?\n\n[Hook x2]", "year": null}]}