{"artist": "G Herbo", "songs": [{"title": "Ain’t Right", "album": "Ballin’ Like I’m Kobe", "year": "2015-09-29", "image": "https://images.genius.com/fce05223ccad3afd182baeaef351e35f.640x640x1.jpg", "lyrics": "[Intro: Lil Durk]\nI swear to God, know a lot of niggas fu as hell, hear me? And they so real I swear to God on my kids. I'mma let niggas know how I feel about them, you feel me?\n\n[Hook: Lil Durk]\nStarted with nigga when niggas ain't right\nRan real, lil nigga you ain't right\nAnd I hold my own when I keep my pole\nLil nigga I'm just that type\nWhere was you at when we starvin' at night?\nNo place to sleep at night\nAnd you claim you my brother you gettin exposed lil nigga\nNigga you just ain't right\nYou ain't right lil nigga, I'm see the fake in you\nGot plenty of snitches lil nigga ain't nobody making you\nWhere I'm from in my city lil nigga, it's easy to make the news\nYou ain't right lil nigga, you ain't right\nI know lil niggas ain't right, ain't right\n\n[Verse 1: Lil Herb]\nI don't put my trust in a nigga\nI don't fuck with niggas, I know they ain't real\n150 my niggas, I know they gone kill\nAiming slugs with my niggas we tryna suffer end\nNo choice but to deal\nAnd for me they gon' ride told me put down the steel\nG Herbo get you a deal\nThe harder you work it's so easy to get to them bills\nHouse on the hills, coupes on some shit on wheels\nHerbo I didn't grow up with a butler in LA with my Uncle Phil\nNo I was out of Chiraq posted up doin' drugs duckin' hollows\nI know how they feel\nIf you ain't front line with your niggas you know you ain't real\nThey steady keep slidin' on No Limit don't know how to chill\nThey steady keep slidin' on No Limit don't know how to chill\nLost so many niggas don't know how to feel\nYou niggas don't know how to feel\n\n[Hook: Lil Durk]\nStarted with nigga when niggas ain't right\nRan real, lil nigga you ain't right\nAnd I hold my own when I keep my pole\nLil nigga I'm just that tight\nWhere was you at when we starvin' at night?\nNo place to sleep at night\nAnd you claim you my brother you getting exposed\nNigga you just ain't right\nYou ain't right lil nigga, I see the fake in you\nGot plenty of snitches lil nigga ain't nobody making you\nWhere I'm from in my city lil nigga, it's easy to make the news\nYou ain't right lil nigga, you ain't right\nI know lil niggas ain't right, ain't right\n\n[Verse 2: Lil Herb]\nI don't fuck with you fuck niggas\nWhen you see me in the street don't say nothin' to me\nI ain't taking your word I know niggas ain't real\nBut that shit ain't mean nothin' to me\nAnd you know you weren't out here with me in the field\nSo damn right, ain't nothin' for free\nI got forty on me, I keep it on me\nDon't run up on me\nUsed to pop out the house, go to school with my gun up on me\n8 o'clock on the block with my hand in my pocket\nIt's already one up on me\nAnd you know how I'm rockin' ain't duckin' on action\nThem fuck niggas know where I be\nBut I can't trust a soul\nGotta watch out for niggas who know where I sleep\nSwear to God keep my gun right under my pillow\nDon't know til the pull, I don't sleep\nWicked shit, can’t control how I think\nAnd I been on the streets all my life\nAnd I seen my day one niggas die in front of me\nKill a fuck nigga right in-front of me\nWhen the cops question me I don’t know, I just blink\n\n[Hook: Lil Durk]\nStarted with nigga when niggas ain't right\nRan real, lil nigga you ain't right\nAnd I hold my own when I keep my pole\nLil nigga I'm just that type\nWhere was you at when we starvin' at night?\nNo place to sleep at night\nAnd you claim you my brother you getting exposed\nNigga you just ain't right\nYou ain't right lil nigga, I see the fake in you\nGot plenty of snitches lil nigga ain't nobody making you\nWhere I'm from in my city lil nigga, it's easy to make the news\nYou ain't right lil nigga, you ain't right I know lil niggas ain't right, ain't right"}]}