{"artist": "Pastor Troy", "songs": [{"album": "We Ready I Declare War", "title": "No More Play in G.A.", "image": "https://images.genius.com/930f08b82ebc035b1b8a9ab3661f78c0.640x640x1.jpg", "lyrics": "[Intro]\n(phone ringing)\nPastor Troy: Y'all watch this, watch this (laughs)\nGuy on phone: No Limit Studios\nPastor Troy: yea, yea, yea, can I speak to P?\nGuy on phone: P ain't here!\nPastor Troy: (chuckles) Hey yo, tell him that Pastor Troy and them Down South Georgia Boys said since everybody think they soldiers then what's up, we'll go to war...\n\n[Hook][4x]\nMy nigga fuck what ya say (We Ready!)\nAin't no more play in GA (We Ready!)\n\n[Verse 1]\nWhat's up? Big mouth, big talk, big game\nTeacher's pet, takin' names, pop the tec, takin' aim\nPlenty range, plenty shot\nPlenty change, plenty Glocks\nPackin heat and I'mma keep em' hot\nAnd I'mma take my cut right off the top\nCuz I'm not, nothing like\nAnyone, once on the mic\nWish you might, show ya right\nHave y'all thinking I'm Barry White\nIn the night, pack em' tight, call the fight, T.K.O\nWe got mo', you ain't know, numero uno\nKeep a O we burnin slow, we optimo, y'all swisher sweets\nAnd don't compete, I'm too unique, sit back be quiet when the Pastor preach\nI make the beat, you beat your meat, yeah punk you touch yourself\nIt be Pastor Troy, D.S.G.B, represent until my death\nAnd anyone else, that want us, you can trust, it ain't no fear\nYou can talk that in my ear, but it ain't shit, 'til you come down here\nAnd anyone else, that want us, you can trust, it ain't no fear\nYou can talk that in my ear, but it ain't shit, 'til you come down here\n\n[Hook 2x]\nMy nigga fuck what ya say (We Ready!)\nAin't no more play in GA (We Ready!)\nMy nigga fuck what ya say (We Ready!)\nAin't no more play in GA (We Ready!)\nMy nigga fuck what ya say (We Ready!)\nAin't no more play in GA (We Ready!)\nMy nigga fuck what ya say (We Ready!)\nMy nigga fuck what ya say (We Ready!)\n\nShit real\n\n[Verse 2]\nFake gold, fake soul, sold this, sold that\nStory grew old, old vogues, old lac\nBut I'm back, verse two, and you, know me\nAin't no, owe me, you die, slowly\nHoly, Bible, assault, rifle\nThou shalt, not kill, unless they make you feel\nLike they, superior, naw brah, who you wit'\nD.S.G.B. my clique, all the money that we can get\nIn the mix, gone and pick, I'm like Vicks Vapor Rub\nPinch a nick up out your dubb, who the fuck you think I was\nEnough of the talkin', talkin', what's up\nIf we actin up, you best be backin up\nBeen buck, re-up, red mouth, straighten me\nAll these niggas be hatin me, because we keep all the D\nO-P, add a E, O.P.P. we ain't down\nNone of my folks don't fuck around, quick to spit every round\nCome on clown, you so bad, you so raw, you so mean\nIn the car, looking mean, all you see, is the beam\nI'm the king, of the throne, still shown, every song\nPunks do not live too long, Pastor Troy and now it's on\n\n[Hook 2x]\n\nShit real\n\n[Verse 3]\nI make the ghetto my lobby, make they habit my hobby\nBought a little Arm & Hammer, cook it, sell then copy\nGot me watchin for coppers, all I want is to prosper\nNiggas clowning with me, don't know they claimin they \"G\"\nSo fuck T.V. cuz this real, just change your hand change the station\nWatch the story bout hatin', then another bout basing\nI'm taking risks to get it, but now I'm sick of this shit\nSo with these last couple dollars, we gone flip it legit\nI bought this beat machine, bout big as a calculator\nWho would have ever dreamed we hit the studio later\nIts like I owe them basers, for making me take this serious\nWasn't for the struggle cuz, you would not be hearing this\nIn the midst I'm frisked bout three times a day\nWhat I'm doing down here? Nigga this where I stay\nI just pray, that I relay, a message to some\nAnd let them know, goddamn, ain't no more play where I'm from\n\n[Hook 2x]\n\nNow shit's real", "year": null}]}