{"artist": "Ice-T", "songs": [{"title": "Escape from the Killing Fields", "lyrics": "Here we go, I'm movin' off death row\nYa gotta keep up hops, ya can't be slow\n‘Cause their towers are high, they got the high gats\nCheck the perimeters good, Read the maps\nIt's night, they might not see us\n‘Cause if they catch us out there, they'll bleed us\nShoot us, kill us, dump us in a dark ditch\nClean it up, call it a gang hit\nI gotta make my move, ‘cause I'm a renegade\nI recognize when mind techniques are being played\nIt's a plot they use to keep down another\nHere comes another brainwashed brother...\n\n\"Yo man, it sounds like you're selling out to me, ‘cause I'm from the ghetto; I lived in the ghetto all my life!\nWe ain't supposed to leave here! We're black! We're supposed to be poor!\"\n\nShut up! Do you know how dumb you sound?\nThat mentality's  what keeps my people down!\nNo one wants to live in an urban war\nYou live there cause your parents were poor\nThey live there because theirs were also\nGet yourself together, hit the gates bro!\n\nCHORUS\nYa gotta get out! Ya gotta get out! Why?\nYa gotta get out! Ya gotta get out! Why?\nYa gotta get out! Ya gotta get out! Why?\n‘Cause the fields are where you die!\nI escaped from the killing fields!\nI escaped from the killing fields!\n\nYou try to keep us running and running faster\nBut I ain't runnin' from ya; I'm runnin' at ya!\nAnd my posse's thick, about a mil strong\nToo late to make up now, cause it's on\nI'm the one that's got ya in constant fear\nI'm the nigga ya shoulda killed last year\nBut you played yourself: you let me gain wealth\nNow I can change the way the cards are dealt!\nI've schooled my homeboys, made 'em all understand\nThe tricks and twists inflicted on the Black man\nHow ya make me think to be down\nI gotta stay around\nDown in the motherfuckin' battleground\n\n\"We got the Puerto Ricans where we want 'em, we got the Mexicans and the Blacks where we want 'em... Well, shit, they're all Black! We gotta keep 'em together, the same way we got those fuckin' Indians!\"\n\nThere'll never be any good schools in the hood\nThere'll never be any cops that are any good!\nThe hospital is a great place to go to die\nReal estate's cheap, let me tell ya why\nThe man's got a sure fire system:\nA economic prison!\n\nCHORUS\n\nI escaped from the killing fields!", "image": "https://images.genius.com/8ba43671bb57813daf61c8431aebd0ea.1000x1000x1.jpg", "album": "O.G. Original Gangster", "year": null}]}