{"artist": "Kirko Bangz", "songs": [{"image": "https://images.genius.com/ce70d8117c83ff4322bbd7d5d9b122da.468x468x1.jpg", "title": "Holdin Slab", "year": null, "album": null, "lyrics": "[Intro]\n\n[Hook: Z-Ro]\nThrowing up a deuce and giving dap\nSomewhere down the Boulevard just Holdin' Slab\n\n[Verse 1: Kirko Bangz]\nSay, I'm so mothafuckin throwed\nYou already know\nKeep a bad bitch and she pouring up my fo'\nBut watch my mobile flows\nEverything I got, I got with my paper\nMy momma say she proud I'm in the skyscraper\nAnd she pray I get a seat up there with God later\nCuz all the things I do, I know I drive her crazy\nWhen I'm rolling in my slab, niggas know they can't compare\nWhy you tryna give me dap?\nYou don't know me like that\nAll these women on me. I just pass them to my homies\nUsed to want them damn Saucony's\nNow Saucony probably know me\nI'm steady coming down I can't believe it baby..\nAll these women in my city I done THESE lately\nI'd be lying if I said it wasn't me baby\nAnd if I said I ain't been feeling like a king lately\n\n[Hook]\n\n[Verse 2: Kirko Bangz]\nSay, all of these niggas they stuntin'\nThey know that they really can't do it like me\nAnd all of these women ain't know that these niggas\nGon' really be poppin' like me\nAnd I put it down for the niggas that's done\nAnd they barely got money to eat\nI'm showing my niggas I came from the same situation\nNow look at a G\nShowing and flossing these diamonds\nBut shit it ain't really about that\nBut shit when you tryna make listen to every lil' word\nLike you was a prophet\nAnd no ho, I will not pay for no pussy\nI promise you won't get a profit\nHard dick and a piece of that bubble mint\nThat's your profit\nYour bitch ain't better than my bitch. Your bitch ain't better than my bitch\nAnd if she is, I'll make my bitch go turn her into my bitch\nYour bitch ain't better than my bitch. Your bitch ain't better than my bitch\nAnd if she is me and my bitch gon' turn her into our bitch\nMan she used to trick them little niggas\nI laced her up. I put some pimp in her\nAnd now she tricking all the big niggas\n10K to go to dinner with her\n\n[Hook]\n\n[Verse 3: Z-Ro]\nUhhh\nDamn right I'm holdin' slab and throwing up the deuce\nNot talking two fingers either. Bitch, you see all this blue\nYa'll think I'm pimping cuz I receive money from prostitutes\nDoes that mean I'mma feed me family? Goddamn right that's what I got to do\nKing of the ghetto entertainment\nI'm the rapper plus the CEO\nSince 2009 it's been ten-thousand dollars to see me flow\nDamn near broke my back just to be here\nI make it look so easy though\nM.C. Gusto ass niggas take yo ass back to CB4\nWhy I get pulled over when I'm standing still?\nMr. Officer you know you can kiss my ass for real\nBitch, wipe your feet before you jump your ass in here\nI shop every 10 hours just bring you\nLeave all them bags in here\nAppetizers [?] smoke all day 'chout for the main meal\nYou is a bad motha- Shut yo mouth!\nNow that's what Joseph Quaine is\nThe phantom,let the roof down\nAnd the bentley,let the roof back\nI ball so long I've fallen and can't remember how to do that\n\n[Hook]"}]}