{"artist": "Vado", "songs": [{"title": "Tell Me", "year": null, "lyrics": "[Chorus: Talia Coles]\nTell Me, If you still care about me x2\n\n[Verse 1: Vado]\nYo\nLove, Im feeling It\nGame, Im selling it\nWe be Marvin and Gaye and Tammi Terrell'n it\nWe make beautiful music like ain't no tellin' it\nI tell you I love you, you don't give a fuck, celibate\nI could tell you mad, but play calm\nYou been around for this long so stay strong\nI don't know her, I never met her, you ain't wrong\nThen go and press her and tell her that I'm your bae huh\nIndecisive, Ima wife it\nGot me and mans checkin prices how to ice it\nI'm just sayin, you right miss I don't like this\nNo more night shifts, I made enough to be righteous\nI respect that, you hate it when you call\nNo answer n I text back\nYou made your hair blonde, I liked it as jet black, but forget that\nYou wanna ride with me? Just buckle up and sit back\n\n[Chorus]\n\n[Verse 2: Vado]\nYes, damn, what to do with you? You're so beautiful\nVery suitable, 6 inch on your Louie shoes\nLouis luggage is packed like where you moving to?\nI can smell the Chanel soon as you moving through\nDrake voice, you special\nOne niece no nephew, no kids a great choice\nLet me caress you, bless you, get your legs moist\nStare at the chandelier while we try not to make noise\nFew dates and my heart expand\nSex in the morning, make you late for your bar exam (damn)\nAs you dance for em, brown pants\nCigar hands, stars in demand, you got a man\n(Vado!) And that's me, Rothstein\nSafe deposit, the Rolls Royce is going streams\nWalking closets cause I don't argue, I toss things\nJury pearls, fur coats get off me\nYes!\n\n[Chorus]\n\n[Verse 3: Vado\nUh, I'm getting money dear, we above the law\nWhat you wanna hear? You love me? I love you more\nGet it clear, you trust me? I trust you more\nJust ask for it, don't be scared, that's what a hubby for\nFor sure, I'm riding to the end\nNo worries at all, I'm providing you with ends\nYou think cause ? keeps ? with your friends\nThat I cheat, you keep tryin to find the way I been\nLike I creep\nNot me...", "album": null, "image": "https://images.genius.com/e2d9824f3848684bc687e9cad8889c34.687x595x1.jpg"}]}