{"artist": "Wiz Khalifa", "songs": [{"year": "2012-10-16", "lyrics": "[Intro]\nYeah, yeah, yeah, yeah\nI'm all about the money\nYeah, yeah, yeah, yeah\nUh\n\n[Verse 1]\nStandin' on the couches blowin' on some ounces (On some ounces)\nShit from out the country can't even pronounce it (Pronounce it)\nAnother 100k I got that all from tourin' (All from tourin')\nThrow it in the air just to let 'em know I'm ballin' (Know I'm ballin')\nGet the hotel treat it like it's residential (Residential)\nClassic wit no diamonds in my presidential (Presidential)\nTake a look at me and you can tell I'm paid (Tell I'm paid)\nMakin' all these faces no Stevie J (Stevie J)\nSmokin' weed, my hoodie and my leather on (Leather on)\nI got a mill, just need some shit to bet it on (Bet it on)\nI got some tree to smoke so they gon' let us burn (Let us burn)\nThe waitress bringin' bottles I'm just yellin', \"Church!\" (Church)\nStandin' on the couches blowin' on some grass (On some grass)\nThese niggas talkin' shit, but hate'll never last (Never last)\nLook at my section, VIP we showin' class (Showin' class)\nKush in every joint Pierre Jouet in every glass (Every glass)\n\n[Hook]\nYou know I'm about that shit\nNiggas hatin' every day that's why they doubt that shit (That shit)\nIf we smokin' need a ounce of that shit\nAnd I never ever leave the crib without that shit\nYou know I'm about that shit\nNiggas hatin' every day that's why they doubt that shit (That shit)\nIf we smokin' need a ounce of that shit\nAnd I never ever leave the crib without that shit\n\n[Verse 2]\nUh\nYou know I'm about that ('Bout that)\nAin't never worried 'bout fallin' off cause I'ma bounce back (Bounce back)\nUh, where yo ounce at? (Ounce at)\nYou talkin' 'bout your fuckin' car, but where the house at? (House at)\nYea, I'm gettin cheese though (Cheese though)\nWalk up in the club they treat me like I'm Nino (Nino)\nUh, sippin' Moet (Moet)\nGot a couple cars that I ain't even drove yet (Drove yet)\nYea, where's the champagne? (Champagne)\nTold my jeweler put some diamonds in my damn ring (Damn ring)\nClub lookin' dry, I make it rain for 'em (Rain for 'em)\nFace another joint, call that a brainstorm (Brainstorm)\nTatted from my feet up, VIP we meet up (Meet up)\nGotta pour some liquor, gotta roll some weed up (Weed up)\nThen fill our face we get our plates and eat up (Plates and eat up)\nKeep bringin' ace this ain't a race\nBut if it was we'd be first place\n\n[Hook]\nYou know I'm about that shit\nNiggas hatin' every day that's why they doubt that shit\nIf we smokin' need a ounce of that shit\nAnd I never ever leave the crib without that shit\nYou know I'm about that shit\nNiggas hatin' every day that's why they doubt that shit\nIf we smokin' need a ounce of that shit\nAnd I never ever leave the crib without that shit\n\n[Outro]", "image": "https://images.genius.com/524cbcea9a8b116d7b930b02c2ee13fc.500x500x1.jpg", "album": "Cabin Fever 2", "title": "Bout That"}]}