{"artist": "Pras", "songs": [{"album": "Ghetto Supastar", "title": "Can’t Stop The Shining (Rip Rock pt. 2)", "image": "https://images.genius.com/cf6a65fdae367a2af61e2514cba1f7cf.500x500x1.jpg", "lyrics": "(Lenny Kravitz on heavy metal guitar riffs)\n\n[Free - Verse One]\nYour minutemen don't stand a chance inside mi casa\nEven with viagra disband god no may I say nada\nI used to be naive and dress fresh when I was small\nNow I line these niggas up against the wall and grab they balls!\nI like to hear the tone of their voice when it's high pitch!\nIt's the only way to separate the mens from the bitch!\nThe loyal from the snitch, I dig a ditch when they twitch!\nBring 'em to their knees no higher than my hem stitch\nYou trying to verbal me you bound to end up voice lift!\nYou wanna change your plea but now your ass is choiceless\nI illuminate the atmosphere a million watts strong\nBefore Free, like BC, your night was weeks long\nYou can't stop my shine, my state of being's too sublime\nToo refined, too omnipotent to be defined\nI've got a round and automatic for you mortals out of line\nSee I'm your worst nightmare, I'm striking in the daytime!  What?!\n\n[Hook]\nYou Can't Stop The Shining\nYou wanna stop the shining?\nCan't Stop The Shining\nYou Can't Stop The Shining\n\n[Pras - Verse Two]\nHey yo, My subject matters travels in three different states\nGas, liquid, solid - Decelerate your heart rate\nI duplicate the sound god makes when he farts in space\nMake you say (indecipherable)\nThem cats say I'm wicked\nThe way I just kick it\nThe man for the 150, too scientific\nFor you to come and get it\nWon't you just quit it?\nStop all the gimmick, bust it!\nHey yo, peep it!\nSuck the blood out of you diagnose you an anemic\nHundred miles runnin', hundred shots gunnin'\nHa I just got your catch, yeah you can keep runnin'\nThe impact of the rush will leave you decapitated\nNone reinstated\nYour style's been deflated\nYou won't quite make it, Dirty Cash just invaded -- yeah!\n\nI know you prayed for my downfall\nCurse all you cats who's down with Babylon\nYou Babylon I'll battle you unto the break of dawn\nOr better yet 'til we can identify flying aliens!\nWell I'll be smooth sailing, all you chameleons\nMortal beings, what?!  Pure earthlings--Yeah!\nTraveling through the bowels of Brooklyn blood as a halogen\nStanding on Flatbush hollering with my hooligans\nUnify my styles like the Russian in the Kremlin\nI'm platinum plus and you're silver sterling\n\n[Hook]\n\n[Canibus - Verse Three]\nYo, My power to weight ratio makes it capable\nFor me to carry hundred thousand pound boast radios\nFuckin' with the \"Can-I\", is like stepping on a\nLive land mine behind enemy lines\nMilitary paratroops with camouflage parachutes\nIn flight suits and boots landing  on your roof\nEliminate the target is the prime objective\nI create psychic walls harder than cement is\nNobody enters, nobody exits\nI wreck shit with methods, electric like the Pentagon's fences\nMC's with the hype-nitis disease are like crack fiends\nWith the hepatitis B vaccine\nNavy Seal team make a bitch scream\nMake 'em suck a dick dipped in vaginal cream\n'Cause you mothafuckas ain't worth the earth that you walk on\nYou ain't worth the paper plates prisoners eat pork on!\nMothafuckas!!!\nRip Rock part two!  Yeah-- So what the fuck you wanna do?\n\n[hook]", "year": "1998-10-27"}]}