{"songs": [{"year": "2011-09-24", "album": null, "image": "https://images.rapgenius.com/63b66e79c432062a207df3382762a929.590x369x1.jpg", "title": "Returning to somalia after 20 years(A Son Returns to the Agony of Somalia)", "lyrics": "K'Naan is a musician and poet.\n\nMOGADISHU, Somalia\n\nONE has to be careful about stories. Especially true ones. When a story is told the first time, it can find a place in the listener’s heart. If the same story is told over and over, it becomes less like a presence in that chest and more like an X-ray of it.\n\nThe beating heart of my story is this: I was born in Mogadishu, Somalia. I had a brief but beautiful childhood filled with poetry from renowned relatives. Then came a bloody end to it, a lesson in life as a Somali: death approaching from the distance, walking into our lives in an experienced stroll.\n\nAt 12 years old, I lost three of the boys I grew up with in one burst of machine-gun fire — one pull from the misinformed finger of a boy probably not much older than we were.\n\nBut I was also unusually lucky. The bullets hit everyone but me.\n\nLuck follows me through this story; so does my luckless homeland. A few harrowing months later, I found myself on the last commercial flight to leave Somalia before war closed in on the airport. And over the years, fortune turned me into Somalia’s loudest musical voice in the Western Hemisphere.\n\nMeanwhile, my country festered, declining more and more. When I went on a tour of 86 countries last year, I could not perform in the one that mattered most to me. And when my song “Wavin’ Flag” became the theme song for the World Cup that year, the kids back home were not allowed to listen to it on the airwaves. Whatever melodious beauty I found, living in the spotlight, my country produced an opposing harmony in shadows, and the world hardly noticed. But I could still hear it.\n\nAnd now this terrible year: The worst famine in decades pillages the flesh of the already wounded in Somalia. And the world’s collective humanitarian response has been a defeated shrug. If ever there was a best and worst time to return home, it was now.\n\nSo, 20 summers after I left as a child, I found myself on my way back to Somalia with some concerned friends and colleagues. I hoped that my presence would let me shine a light into this darkness. Maybe spare even one life, a life equal to mine, from indifferently wasting away. But I am no statesman, nor a soldier. Just a man made fortunate by the power of the spotlight. And to save someone’s life I am willing to spend some of that capricious currency called celebrity.\n\n\nWe had been told that Mogadishu was still among the most dangerous cities on the planet. So it was quiet on the 15-seat plane from Nairobi. We told nervous jokes at first, then looked to defuse the tension. The one book I had brought was Hemingway’s “A Moveable Feast.” I reached a chapter titled “Hunger Was Good Discipline” and stopped. That idea needed some contemplation. The very thing driving so many from their homes in Somalia was drawing me back there. I read on. Hemingway felt that paintings were more beautiful when he was “belly-empty, hollow-hungry.” But he was not speaking of the brutal and criminally organized hunger of East Africa. His hunger was beautiful. It made something of you. The one I was heading into only made ashes of you.\n\n\nBy now, the ride was bumpy. We were flying low, so I could see Baraawe and Merca, beauties of coastal towns that I had always dreamed of visiting. The pilot joked that he would try to fly low enough for my sightseeing, but high enough to avoid the rocket-propelled grenades.\n\nFOR miles along that coast, all you see are paint-like blue water, beautiful sand dunes eroding, and an abandoned effort to cap them with concrete. Everything about Somalia feels like abandonment. The buildings, the peace initiatives, the hopes and dreams of greatness for a nation.\n\nWith the ocean to our backs, our wheels touch down in Mogadishu, at the airport I left 20 years before to the surround-sound of heavy artillery pounding the devil’s rhythm. Now there is an eerie calm. We clear immigration, passing citizens with AK-47’s slung over their shoulders.\n\nIt’s not a small task to be safe in Mogadishu. So we keep our arrival a secret until after we ride from the airport to the city, a ride on which they say life expectancy is about 17 minutes if you don’t have the kind of security that has been arranged for me.\n\nOver breakfast at a “safe house,” I update my sense of taste with kidney and anjera (a bread), and a perfectly cooled grapefruit drink. Then we journey onto the city streets. It’s the most aesthetically contradictory place on earth — a paradise of paradox. The old Italian and locally inspired architecture is colored by American and Russian artillery paint. Everything stands proudly lopsided.\n\nAnd then come the makeshift camps set up for the many hungering displaced Somalis. They are the reason I am here. If my voice was an instrument, then I needed it to be an amplifier this time. If my light was true, then I needed it to show its face here, where it counts. Nothing I have ever sung will matter much if I can’t be the mouth of the silenced. But will the world have ears for them, too?\n\nI find the homeless Somalis’ arms open, waiting for the outside world and hoping for a second chance into its fenced heart. I meet a young woman watching over her dying mother, who has been struck by the bullet of famine. The daughter tells me about the journey to Mogadishu — a 200-mile trek across arid, parched land, with adults huddling around children to protect them first. This mother refused to eat her own food in order to feed abandoned children they had picked up along the way. And now she was dying because of that.\n\nThe final and most devastating stop for me was Banadir Hospital, where I was born. The doctors are like hostages of hopelessness, surrounded and outnumbered. Mothers hum lullabies holding the skeletal heads of their children. It seems eyes are the only ornament left of their beautiful faces; eyes like lanterns holding out a glimmer of faint hope. Volunteers are doing jobs they aren’t qualified for. The wards are over-crowded, mixing gun wound, malnutrition and cholera patients.\n\nDeath is in every corner of this place. It’s lying on the mattresses holding the tiny wrists of half-sleeping children. It’s near the exposed breasts of girls turned mothers too soon. It folds in the cots, all-knowing and silent; its mournful wind swells the black sheets. Here, each life ends sadly, too suddenly and casually to be memorialized.\n\nIn this somber and embittered forgotten place, at least they were happy to see I had come."}], "artist": "K’naan"}