{"songs": [{"album": "Tha Hoodlum’s Testimony", "image": "https://images.genius.com/21f8328a60b871beb6d36b965d4ab80c.370x370x1.jpg", "year": null, "title": "Straighten It Out", "lyrics": "Let's break it out all of this black-on-black, brown-on-brown, in every town\nBecause I'm sick of seeing my people's sketches scattered all over the ground\nSince these murders occur every single day, so put the gun away because I want\nTo live to see another day. A happy day. Where there's peace between\nNations, love within races and no division in the congregations. No more\nPimps and drug dealers on every corner. A homeless people struggling with no\nHomefreeze and they pump for quarters. I am talkin' about a world of peace\nWith no mo' closed caskets if you know rows like most of my homies that have\nBeen deceased. No more murderers, diseases, or suicides, it's time we all\nWake up and wipe the mucus from my sleepy eyes. And straighten things out\nLike a ruler 'cause nowadays, the cart we juggle is full of hate, killas, and\nRunaways. I'm sick of it, so I'll be the first brother to shout, let's\nStraighten it out 'cause together we can work it out\nChorus-\nLet's straighten it out, from the west side to the east side\nLet's straighten it out, from the north side to the south side\nLet's straighten it out, from the east side to the west side\nLet's straighten it out, from the south side to the north side\nI wish somebody would tell me why, we can't just straighten out all this mess\nAt times I think, my fat should be a bulletproof vest. Got all these homies\nClaiming south side, west side, east side, north side, Asian, Black, and Brown\nPride. It seems that there's no mo hope, my own people's send me their guns\nAnd try to push me the dope, I can't cope. But I gotta, why? Because I'm\nSick of all the shots ringing from the sixty-fo and hollas. Remember where we\nWas familia, where we could kick it and not worry about your own kind killin'\nYa'. Seems like all we care about is money and fame, drugs in the game, it's\nKillin' me softly like Lauren from the Fugees sang. Man, what's it gonna take\nFor us to grow up, before love is the only gang sign we throw up? 'Cause all\nOur peoples headin' straight for the morgue unless we put down the guns and\nStart to trust in the Lord, let's straighten it out!\nChorus\nI wonder what could make a man, hit a woman, wit' a ferious hand. Somebody\nTell me because I just don't seem to understand. And then we wonder why y'all\nKids is bangin' with none at home, it seems the parents is the one givin' they\nKids a trainin'. Beatin' em' down, with your fists and a buckle of a belt\nTo prideful to accept that you needed some serious help. So you kept strikin'\nLike thirsty bats straight out of Hell, but what you did was wrong, stop and\nListen to my song. It breaks my heart in two when I see the things you put\nThem through. Why do you do all the harmful things that you do? Spiritually\nGuided with decieve and rags on both your wives, not knowin' you was led by\nDemons when you made them cry. But you didn't quit till' they finally ran\nAway from home. Then your wife left you too, and now your sad and all alone\nJust thinkin' about everything your family could have been, so now your\nSqueezin' the trigger to leave this life of sin\nChorus\nChorus"}], "artist": "T-Bone"}