{"artist": "Andy Mineo", "songs": [{"title": "Hands High", "album": "Saturday Morning Car-Tunez", "year": "2012-06-28", "image": "https://images.genius.com/2f9cf695968b74ddbacf05e3de6499c3.300x300x1.jpg", "lyrics": "[Verse 1]\nCan I bust a rhyme?\nI'm a rapper, not your average, I come from another kind\nThe way I drop it, they wanna go use the John, number 2\nSee the signs of turning water to wine\nTook a trip to Kenya, then I saw the Maasai\nTook a trip S.A., I was chilling with lions\nThink I'm lyin, check my Twitter timeline\nYou're gonna be finding it chilling around some time November 29\nMy savior came, put his hands where they eyes couldn't see\nWith a touch he could heal the blind\nThen he coming back like a spine\nI'm seeing lies the enemy tryna sell me\nI tell him I'm not buyin' 'em\nAnd when I do, I be wylin'\nNot putting Christ in the center like Andrew Bynum\nDenying him, but now I'm relying on Him\nMy mind was the kind that inspired violence\nI swear I needed asylums\nFrom New York to Milan I be styling on 'em\nOG Baxter, harder than Margarito hands wrapped in plaster\nHold up let me ask ya, ask ya\nWho you chasing after?\nThe God that we rap about or just a rapper?\nThat's some wack stuff\nLike calling whoever you podcast your pastor\nGrowing pains feel better after\nWhile you going through 'em like \"how long they gonna last for? \"\nIf you wasn't chastised then I ask ya\nAre you a legitimate child of the master?\nYou want that? I think not\nSo get them hands high, let me see you rock!\n\n[Hook] (x2)\nThey put they hands in the sky\n(Be careful who you worship when you wave 'em at concerts)\nThey wave 'em from side to side, but please don't get it twisted\n\n[Verse 2]\nI wanna be in it but not of it\nWhen the record starts spinning the feeling it starts coming\nRemembering the days of my sin and even loved it\nBut now I think about what I did and I feel disgusted\nThis Busta Rhymes record that I'm busting\nIs a testament to what the Father did when I trusted Him\nDon't you hear how, everything is changing now?\nThe snares, the kicks, even my lifestyle\nIt don't sound like, anything I started with\nIt's transformed, metaphor in the art of it\nHip-hop is the culture I am apart of it\nBut I answer to the one that's in charge of it\nIf I offended you brother I hope you pardon it\nThe mission is to lead where they are, that's heart of it\nGod takes what the Devil intended for evil\nAnd use it for good of those that He call His people\nIf He redeemed you in your heart that's deceitful\nThen he can do it to a beat too\nAnd we could have beef on the methods\nAs long us we agree to reach peeps with the message\nThat he redeems people and beats\nI'm free from the sentence of death that I was in debt with\nI'm telling 'em\n\n[Hook] (x2)\n\n[Outro]\nAndy: What did you uh, what did you think about your son's mixtape mom?\nAndy's Mom: Uh, I like. There's a couple songs in there I like. I don't like the heavy rap ones, they're too noisy for me. But I like, there's a couple of them I like there, so\nAndy: Yea!?\nAndy's Mom: It's the same way when I go on Lecrae, holy cow! I don't know where I'm going now, I'm all mixed up. I do not know. I thought I was ?, but now I don't know\nAndy: Ok, I love you mom\nAndy's Mom: Hey, I love you too bunny\nAndy: Ok, I'll talk to you soon\nAndy's Mom: Ok bye...hey Andy, Andy!\nAndy: Yea\nAndy's Mom: Andy!\nAndy: Yea\nAndy's Mom: I met Lord. I got on the right road. I just thought I'd tell you\nAndy: Praise Him\nAndy's Mom: I love you babe\nAndy: Love you too mom\nAndy's Mom: Bye\nAndy: Alright, bye"}]}