{"songs": [{"year": "2008-09-09", "album": "Not 4 Sale", "image": "https://images.genius.com/f0a901d03b5db37284706922ef6d3d03.1000x1000x1.jpg", "title": "Bad Like We Bad", "lyrics": "[Tasha Rosez talking]\nReaching out to di people dem\nOunno seh dem got it\nDem have a clean heart and a firm meditation\nOunno have dat droppa sleep\nAnd dem a get back up later\nYo! Dat wi seh... hold on...\nWe nah hold back nuh talk\nNeed a work wi a work\nLive and direct pon a new case\nA so di ting go, a weh wi seh now...\n\n[Kardinal]\nYo...\nBeing twenty-one and alive is not an accomplishment\nWhere I come from yo that's a prerequisite\nEff etiquette check the T-Dot consulate\nAny bad talk outta ya mout y'affi cancel it\nNiggas wanted to be the king but they couldn't handle it\nToo busy tryna sell a ki and a gram for it\nGet a little success and they sell out they man for it\nMr. Kardinal's coming now cause the streets are in demand for it\nWeh dem man a feel like when the rappers are rappin again\nNiggas are tryna get that money and they scrappin again\nAll dem likkle punks who couldn't flow they trappin again\nOr they back to Burger King, or they back inna di pen\n(Aiyyo where di Ras yout'?) Light closing again\nIf you're looking for me I'm three hours from Michigan\nTalk like Goliath and black like Michelin\nAll hands dash dem up! Di Kardi on a mission an we...\n\n[Hook]\nBad like we bad like we bad-eh\nBuss up di place Brooklyn to Bagdad-eh\nMoney deya but we act like we ain't never had it\nRo' pass di handles t'war and let me get hardcore AIYYO!\n(A weh dem feel?) AYY - A weh dem feel like?\n(A weh ya feel?) EHH - A weh ya feel like?\n(A weh dem feel?) CHO - a weh dem feel like?\n(A weh ya feel?) EHH - A weh ya feel like?\n\n[Kardinal]\nYo!\nHello out there can anybody hear me?\nHere I am here I am! I know my ego will cheer me\nI'm five steps from insane one line from your girl\nI'm one hit away from destroying the whole world\nMy names Kardinal listen here, they want you to live in fear\nProgramming your brain like a PVR listen clear\nSome a dem a likkle queer, tell dem fi come outta here\nBad man nuh revere, press record Mr. Engineer!\nIn the air I will appear, a nuh nuttin yes mi dear\nKardinal is here to see ya jump around nuh shed a tear\nSome niggas are brigadiers - they better disappear\nI will call the cavalry and come runnin like cavalier\nWhatever ya overhear, listen wit a bigga ear\nSometime what ya heard is not di word it ain't nuttin sincere\nThis is a world premiere shout it from the auctioneer\nBlock - stop talk di ting deh pon cock! And yo we...\n\n[Hook]\nBad like we bad like we bad-eh\nBuss up di place Brooklyn to Bagdad-eh\nMoney deya but we act like we ain't never had it\nRo' pass di handles t'war and let me get hardcore AIYYO!\n(A weh dem feel?) AYY - A weh dem feel like?\n(A weh ya feel?) EHH - A weh ya feel like?\n(A weh dem feel?) CHO - a weh dem feel like?\n(A weh ya feel?) EHH - A weh ya feel like?\n\n[Repeat]\n\n[Tasha Rosez talking]\nYa mon a mi Tasha Rosez, Guns and Roses how ya mean\nWe deya! Live and direct pon a new case a so di ting go\nA weh wi seh now... all hands set its how ya mean\nKardinal Offishall to di world\nA bun wi a go bun dem pon dem chune ya yo\nCome wi a come fi dun out some a di fucka dem ya nah\nSome a di pussy dem weh di out a road a watch people\nBrrrraaa-business YO!!"}], "artist": "Kardinal Offishall"}