{"songs": [{"title": "Hold You", "lyrics": "AKIR ft. N.D.L. - “Hold You”\n[Emcee(s): N.D.L. and AKIR]\n[Producer(s): [?]]\n\n[Verse 1: N.D.L.]\n(Let me) hold you, never let go for nothing.  It’s only\nMe and you tonight.  Let me show you something and let me\n(Show you) Indeed, I’m slick ‘til death\nWhen I get in the zone, peep how thick it gets, and I\nPlan to stick with you ‘til death do us\nBut you know I gets to live now.  Let’s do this\nFlip you ‘round, grip you, strip you down\nSpit that real shit to you that gets you aroused\nGot you peaking from every single word that I’m speaking\nYou flirt with emcees when I’m rocking it this weekend\nPeeps is watching, crowding around, and\nGetting loud and rowdy.  Got your mind in a cloud\nSo this is why and how we relate: you make my shit sound\nGreat, still my shorty from around the way.  No matter\nWhere we go, we still flow flawless\nLove, I’ma show you regardless\n\n[Hook: Sample from [?] - “[?]”]\nLet me\nHold you.  I want to hold you\nI want you in arms\nI never want to let you go\n(I’ll never let you go)\nShow you.  I want to show you\nAll the magic that\nI know you’ve never seen before\n(I know you’ve never seen before)\n\n[Verse 2: AKIR]\n(Let me hold you) near to me\nSo you can hear me clearly speak\nFrequently freaking frequencies.  You hear\nThat beat?  That’s our song—follow my lead\nGlisten in the spotlight, you the love of my life\nTransmitting my addiction ‘til the feeling is right\nI’m gripping you tight, never want to let you go\nReset the tone, listen to me, help me flow (Let me)\nWhere there’s a show (Show you), there’s no ho\nNo amount of dough.  No matter the clothes or where a nigga go\nYou John Blaze.  My dame is center stage, huh\nTaking me from minimum wage to front page\nTaught me to stack heated and give me feedback\nWhen I needed to lamp, I liked to get you amped, huh\nTired, your wire told me not to trip.  With no\nDelay, I said, “OK,” and pulled you close to my lips\n\n[Hook: Sample from [?] - “[?]”]\nLet me\nHold you.  I want to hold you\nI want you in arms\nI never want to let you go\n(I’ll never let you go)\nShow you.  I want to show you\nAll the magic that\nI know you’ve never seen before\n(I know you’ve never seen before)\n\n[Verse 3: AKIR]\n(Let me hold you) Romancing\nWe dance in the dark.  Take my hand while we jam\nTo a band in the park.  And I remember the start\nWhen melody was my heart.  Her jealousy broke us apart\nI continue my art form, more forewarning\nYour echo.  We’re young and petro.  I couldn’t let go\nYou got connections.  Shit is just electric to me\nAnd I love you for life.  You my M-I-C\n\n[Verse 4: N.D.L.]\n(Let me show you) my life’s supplied in what the hype’s about\nWe got ‘em sights, steal women when the lights is out\nI want to give it to you (All night)\nClose, reeling ‘em in, it’s (All right)\nSpit at men that’s seen it all: all types of brawls\n[?] around my piece.  We all dough\nCan’t wait to freak you.  It’s more than physical\nI just want to speak to you, keep it lyrical\n\n[Hook: Sample from [?] - “[?]”]\nLet me\nHold you.  I want to hold you\nI want you in arms\nI never want to let you go\n(I’ll never let you go)\nShow you.  I want to show you\nAll the magic that\nI know you’ve never seen before\n(I know you’ve never seen before)", "year": "2004-11-15", "album": "Street Edition Vol. 1 & 2", "image": "https://images.genius.com/509e7a4852ad536f53153265417b296d.600x600x1.jpg"}], "artist": "AKIR"}