{"artist": "E-40", "songs": [{"title": "Bust Yo Shit", "image": "https://images.genius.com/d661f756f8abeee43d155d5744efdb3b.500x498x1.jpg", "album": "The Best Of E-40 (Yesterday, Today & Tomorrow) ", "year": "2004-08-24", "lyrics": "[E-40]\nYou refreshed, don't want no static\nI stretch my blow like elastic, what you need tycoon?\nYaper or plastic, my back against the wall\nHubba rocks in my jaw, mouth full of spinach fetti\nFetch'n go-getters, hitters on my team on my squad\nReady to smash you niggas; ready to do our job\nIn the cut with them 16-year-olds that I recruit\nReady to bust a nigga shit, you better not hit dip or boot\nI spit, nothin but the best of the sloop\nThe soil, the gutter, the unrecouped\nI'm slick like this like I look (like I look)\nI ain't gotta touch it no mo', even though I used to cook\nThe book of sugar, the tragic magic, the plastic, the habit\n(Habit) The fiends gotta have it (gotta have it)\nMAYYYYYYN (MAYYYYN) is my favorite (is my favorite)\nNot from New England, but I pack a Patriot (Patriot)\n\n[Chorus: Rankin Scroo]\nAlright, yo!\nBwoy if ya run up, then ya get done up\nRun come test, I will bust your shit\nYo you betta splurt, before ya get 'urt\nBack up offa dis or I'm gon' bust your shit\nYo you don't be 'round me I could bust your shit\nTake my chip me I'm gon' bust your shit\nRun off your lip me I'm gon' bust your shit\nBust your shit, me I'm gon' bust your shit aiyyo\n\n[B-Legit]\nCheck it, yo yo, yeah, aiyyo\nI'm from the block where the lil' deuce cock back\nNo need to stop there, go 'head, go on and act like you act\nGloves be black, plus I feed bleed with mac\nOne or two stacks, put yo' head on no fix flat\nWith no getback, I get back to where the bricks at\nServe birds and from the curb serve Kit-Kat\nSplit that, feel that, and then I hit that\nBig back, whole bunches know I spent that\nI'm a boss on location, vacation for the whole unit\nHundred grand let 'em know I'm doin it\nHundred man's what I'm crewin it\nPut my foot with the ankle and the shoe in it\nYou can bust yo' guns but now I bust yo' lip\nAnd that's Click spit so don't you trip (HOEE!)\nWe stay high and we move zips\nAnd only cop Bents fully loaded when they come with the kits\n\n[Chorus]\n\n[E-40]\nBumpin your gums'll get your pumpkin put on display (on display)\nOff with his head he wasn't usin it anyway\nI told him to park his tongue but he kept on jaw-jackin and shit\nPillowtalkin and motormouthin and tryin to impress that bitch\nThinkin he bulletproof, just drunk a fifth of courage juice\nOutside of the party loose, with a empty bottle of Grey Goose\nMad dog'n and talkin loud, feelin his Wheaties and oats (oats)\nComin at a player sideways in front of my cutthroats\nI said, \"This nigga just high, give that nigga a pass\nDon't take that nigga life,\" but he kept on talkin trash\nI walked away and laughed (ha ha) but he knew he had it comin\nThat lil' nigga startin bustin, this lil' nigga started runnin\nRrrrrrrrah, rrrrrrrrah, left his ass leakin\nWith a hole in his chest and his head on the pavement gaspin for air bleedin\nAnd he cain't believe it, one night'll change your life forever\nDisrespect a pimp and I'ma bust yo' shit! Uhh\n\n[Chorus]\n\n[Rankin Scroo]\nYo, me spit the writ, me Sic'Wid It, me ready to bust your shit\nFit me fit yes me physical fit\nIn de mornin when me wake up get me rule pon' strip\nI am a true playa, me love the music\nFassi why ya me chew, you is a nitwit\nYou talk more shit den {?}\nIf ya keep on talkin y'all gon' get ya head split\nRun rudebwoy before me bust your shit, shi-di-di-dit\n\n[E-40]\nLet me explain to ya\nSee I've been analyzin the whole shit right\nI mean it's like\nIf a nigga get out of line a nigga bust your shit right?\nThat's real talk, e'rybody know that right?\nBut at the same time, you can't underestimate a motherfucker\nA nigga might just look a certain way\nA motherfucker might have a certain look that he got on his face\nYou can never underestimate, the regular motherfucker mayne\nCause you don't know who that nigga cousin is\nYou don't know who that nigga family is mayne\nA nigga'll bust yo' shit nigga, you just don't know this shit nigga\nAll they gotta do is give the word, y'knahmean?\nAll you old niggas, all you young niggas!\nYou don't know who these O.G. niggas is plugged with\nYou young niggas, and all the old and all the old niggas\nDon't know, who the young niggas is plugged with\nIt's motherfuckin, it's a motherfuckin uhh, ripple effect\nThis shit go 'round and 'round like a merry-go-round mayne\nYou hit this nigga, that nigga gon' hit you\nYou hit him, he gon' hit you\nHis family gon' hit you, his family gon' hit this family\nIt's gon' go on and on forever mayne\nThat's what bust a nigga shit is mayne\nBut we gon' tear this shit off mayne, y'knahmean?\nWe quick to step on a nigga toe, and say excuse me to the nigga\nAnd the nigga get quick to say, nigga I'ma kill you {*echoes*}"}]}