{"artist": "Iamsu!", "songs": [{"title": "Clothes, Shows, & Afros", "lyrics": "[Intro]\n(HBK, yea you know how we play)\n(And I can't quit all I know is gang gang)\n(Clothes Shows and Afros and they be screaming for the kid everywhere we go)\n\n[Verse 1]\nOn my way to a show, that means that I'm on my way to some O's\nAnd some commas, thats a promise\nIts quality I control\nOn the roll with the honor roll\nStraight A flow , 4.0 we on the goal\nMake every move calculated and precise\nMake a list, check it twice\nMaking sure every step is right\nFresh out of class, straight to the Airport\nThey ain't got no money what I care for?\nCharging my cell phone in the apple store\nBourgie girls get tossed like apple cores\nGet with the program Bro-ham, or get lost\nCause the gang is engaged for lift off\nOut of the Bay\nHater get out our way\nH-B-to the K\nNiggas know how we play\nI'm focused on a mission you drink and smoke everyday\nI tell them pay attention, and watch me I'll lead the way\n(Suzy)\n\n[Hook x2]\nClothes Shows and Afros\nAnd they be screaming for the kid everywhere we go\nSo don't ever get it twisted HBK we really live it\nEverything I got I give it (uhh)\n\n[Verse 2]\nBeen repping that Heart Break Gang\nYou niggas just know knowing the meaning\nAnd I'm staying loyal won't nothing come in between us\nBumping that Diplomat so that know that I really mean it\nWent from showing up late to class to being on TV\nBut i'm chilling, keep it real every time that you see me\nVery dedicated, hardly any free time\nCause free time leads to a decline\nYou see that bad one over there? yea she mine\nShe fine, and she got her own\nTalking bout her alone I could write a song\nAnd she sticking with the kid, right or wrong\nBut anyway, back to grind\nI'm on the move\nNo sleep, you losing precious snooze\nSo I conclude\nThere ain't nobody on our level\nOne foot in they ass, the other foot on the pedal\nWatch me gas on em\n\n[Hook]x2\n\n[Outro]\n(x2)\nClothes Shows and Afros\nAnd they be screaming for the kid everywhere we go\nSo don't ever get it twisted HBK we really live it\nEverything I got I give it (uhh)\n\n\n(HBK, Niggas know how we play)\n(And I can't quit all I know is gang shit)\n\n(HBK, Niggas know how we play)(haaah)\n(Clothes Shows and Afros) (uhh uhh uhh)", "image": "https://images.genius.com/519d4f25ce5c3a62fbac9bbac685ff7c.600x400x1.jpg", "album": "Kilt", "year": "2012-05-07"}]}