{"songs": [{"image": "https://images.genius.com/3b061185b8a017578796bbe35c4f5557.1000x1000x1.jpg", "title": "Bad Girls", "album": "Nate Dogg", "year": "2003-02-25", "lyrics": "[Redman]\nI react like a dog when ya move his food\nI'll turn your blocks upside down like Rubik's Cube\nI need a bad girl to make a nigga lose his cool\nBut in the heat of the battle she'll pull his tool\nI take 'em - skinny, dumb, blind, crippled and crazy\nOr even five-hundred pounds sweatin' gravy\nYou know, she cooks cover, not with Maybelline\nSo \"Next Friday\" she hunt you like Baby D\nI told her I'm not big, I'm tight with money\nTight nigga, stay shittin' with a diaper on me\nNiggas throw on your gators, I'm the type that's bummy\nStayin' around the hood keep me nice and hungry\nShe said \"I like your style\", I complimented\nHer ass like a garden, I gotta dig it\nNiggas better duck when baby squeeze\nBad girl, bad girl from L.A.P.D. nigga\n\n[Nate Dogg]\nI, I know that I shouldn't, I\nShouldn't buy into this lie\nI know that she got 2 or 3/4 guys\nI, I know that these girls all fly\nAnd they know that I'm that guy\nWho can make all these girls come alive\nWhy? Because I got my eye\nGot my eyes on them thighs\nAnd she got her eyes on this bad guy\n\n[Hook: Nate Dogg]\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\n\n[Nate Dogg]\nI, I got a nasty mind\nAnd she got a big behind\nI gotta make that bad girl mine\nWhy? She likes to play all night\nKnows how to move just right\nI better slow down before she pass me by\nTonight, I'mma show her tonight\nWon't let her go tonight\nLook at her shake it, my-my-my\n\n[Redman]\nEy yo Nate, that bad girl ain't Platinum, she a Diamond to me\nShe got a car door that open, ninety degrees\nOr how 'bout them women, that's outdoor 'til the mail come\nFirst of the month, they toes and nails done\nWorkin' three jobs just to feed her children\nAnd to fuck me on the beach at Hedonism\nShe smoke like I do, ride like I ride\nShe's that bad girl that'll ride 'til I die\nFool, nigga, say ya seen what?\nBad girls all gettin' stuck in here\nYo, bad girls, they gettin' stuck in here\nYo, these bad girls gettin' stuck in here\n\n[Hook: Nate Dogg]\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)\nBad Girls (bad, bad girls)"}], "artist": "Nate Dogg"}