{"songs": [{"image": "https://images.genius.com/0ff2d9b293e1c9fe502c99722eaeaa4b.497x500x1.jpg", "lyrics": "[Intro: Mac Dre]\n(\"Maybe someday she'll get run over or something.\")\nBy a tricycle!\n(\"That's what I pray for every night.\")\nAnd ten more bicycles!\n\nYeah, erry night\nI don't like the bitch\nI hate the bitch\nYa know, fuck the bitch\n\n[Verse 1: Mac Dre]\nNow before I start rapping, I must warn ya\nI just washed down two mushrooms with some orange juice\nI was thizzin' when I wrote this, forgive me if it goes astray\nIt's just one of the many dumb flows of Dre\nI'm tryna see G's, play these hoes like CD's\nOld school like the Bee Gees\nGive me green and some Wheaties\nYou don't want to see these, I don't give no freebies\nHoe, this dick cost, what you thought I fucked was ten ki's\nRemy, it's in me, bring me what you got\nThen baby maybe I'll love like my two Glocks\nI'm too hot, I do not, fuck with no havers\nI'm a Crestside cutthoat, cold toe-tagger\nA hoe capturer, then keep 'em in captivity\nYou ain't know about that niggity, Driggity, M-Diggity?\n\n[Hook: Smoov-E]\nI mob like Durango, seat tilted lay-low, boy\nI bring heat like one hot jalapeño\nI mob like Durango, seat tilted lay-low, boy\nI bring heat like one hot jalapeño\n\n[Verse 2: Smoov-E]\nSmoov with the groove, when I run right thru, and boy I just might pull it\nWith a all black hat, and a fat bomb sack, bring heat just like a bullet\nGot an all new fit and a brand new bitch\nTo girl, this dick's a no-no\nSo I picked up a bottle of Captain Morgan's, took her to the mo-mo\nI had to hit the cho-cho\nBoy, this ain't no hoe stroll\nBut in my town these girls get clowned like they first name was Bobo\nCan't shake E, or break E, stay around like a 12-day hickey\nGirl, it's tasty, like Lacey, took it all like a wide-mouth Mickey\n\n[Hook: Smoov-E]\nI mob like Durango, seat tilted lay-low, boy\nI bring heat like one hot jalapeño\nI mob like Durango, seat tilted lay-low, boy\nI bring heat like one hot jalapeño\n\n[Verse 3: Smoov E]\nThis game gets sticky, these hoes get tricky\nYa boy gets picky, ya see I hang with Nicky\nAnd cats like Mac Dre, we dress in khaki\nThat backup band bass, shows how much this rap pay\nWe kicks with Mary, Jane and Judy\nMy piece like Larry 'cause getting ass is my duty\nDon't trip or slip, just do my thang\nSmoov pimped out like a pinky ring\n\n[Hook: Smoov-E]\nI mob like Durango, seat tilted lay-low, boy\nI bring heat like one hot jalapeño\nI mob like Durango, seat tilted lay-low, boy\nI bring heat like one hot jalapeño\n\n[Outro: Mac Dre]\nSomething's got ta happen, something's definitely got to happen\nI hope she get ran the fuck over\nI never did like the bitch, I mean I never liked-ed the bitch\nY'all were the ones hooping an' hollering about the fucked up bitch\nFuck the bitch", "year": "2007-11-13", "album": "Pill Clinton", "title": "Handcuff Your Bitch"}], "artist": "Mac Dre"}