{"songs": [{"image": "https://images.genius.com/c4d8605dff947c8e53f29c6880512a28.645x645x1.jpg", "title": "LA", "album": "Brass Knuckles", "year": "2008-09-16", "lyrics": "[Intro: Snoop Dogg] + (Nelly)\nWest, Coast! (WOO!)\nWh-wh-wh-wh-what what what? (This this right here homie?)\nYeah, yeah, yeah (This shit right here? Straight West coastin!)\nW-W-W-W-West West Coast Coast Coast (uhh!)\nYeah (uhh) yes, yes (this Midwest nigga)\nNeff-U (on this West Coast shit)\nGo hard, go hard, go hard, go hard (check, uh)\n\n[Hook 2X: Nelly] + (Snoop)\nSwitch one, switch one (raise it up)\nSwitch two, switch two (make the back end up)\nSwitch three, switch three (work it side to side)\nAnd switch four (make it three-wheel ride)\nYou hurr me?\n\n[Nelly]\nYo.. yo, listen\nAy, yo, I just touched down at this LAX\nI'm lookin for these girls on this L.A. X\nTryin to find them niggas with that L.A. best\nDodgin them niggas with that L.A. stress\nSee I'm a visitor, I'm a L.A. guest\nI gotta be awurr of how they L.A. dress\nCause if it comes down I might get L.A. stretched\nI ain't tryin to be a trophy on no L.A. desk\nSome niggas walk up, tossin L.A. sets\nI guess that's 'sposed to be some type of L.A. test\nBetter watch the girls with the L.A. chest\nA lot of plastic in them L.A. breasts (haha-haha-ha)\nSee I - hit the Crenshaw where they L.A. stunt\nSeen a lot of six-fo's and L.A. trucks\nSeen a lot of girls with them L.A. butts\nA lot of niggas with them Dickies and Chucks - you feel me?\n\n[Hook]\n\n[Nelly]\nYo, yo\nAiyyo I spend a lot of time on this L.A. coast\nOut hurr tryin to do the L.A. most\nChauffeur-driven Phantom like a L.A. ghost\nIn the back with a drink, take a L.A. toast\nI spend a lot of time in Woodland Hills\nWith them models and actresses in them L.A. heels\nTo my lawyer's office for an L.A. deal\nCut the check for some L.A. meals\nSo now I'm off to Rodeo just to L.A. shop\nStill gettin dirty looks from some L.A. cops\nYou'd of thought since Rodney King, nigga, L.A. stopped\nThey burned the L.A.'s Watts (uh-uh)\nI send a lot of love to my L.A. brothers\nMy Latinos and my negroes in them L.A. colors\nMy blessings goes out to them L.A. mothers\nKnow that Nelly is a L.A. lover, ha ha\n\n[Hook]\n\n[Nate Dogg]\nGuess who just stepped in the place (the Midwest)\nIt's your O.G. homie, Nate (all day)\nMy homie Snoop and yep, Nelly (L.A.)\nAnd we all up in your face (all day)\nDifferent questions every day (the Midwest)\nI got the answer in my waist (all day)\nYeah they all got somethin to say (L.A.)\nFrom St. Louis to L.A. (all day)\n\n[Hook]\n\n[Outro: Snoop Dogg]\nWest, Coast\nWest, Coast!\nWest, Coast\nWest, Coast!\nHa ha! Ha ha! Yeah, yeah\nW-W-W-W-West West Coast Coast Coast\nL.A., L.A., L.A., L.A., L.A., L.A., ha ha!\nWh-wh-wh-wh-what what what y'all y'all?\nYeah, yeah"}], "artist": "Nelly"}