{"artist": "G-Dep", "songs": [{"title": "Special Delivery (remix)", "album": null, "year": null, "image": "https://images.genius.com/e809032be49dc1abed1b3b49bf50e014.620x400x1.jpg", "lyrics": "[Intro: Ghostface Killah]\nFuck the whole industry!!!!\nYou tried to get rid of me!!! Y'all must be kiddin me!!\nY'all must be kiddin me!!! Aiyyo fuck the whole industry!!!\nCome on!!! Staten Island! Come on! Hold me down!!!\n\n[Verse 1: Ghostface Killah]\nMonster cut truck balley shit\nChampagne spillin while we hittin every bump that my Denali hit\nOutfit is four thousand and better\nThe rhinestones in my flintstones look crazy in my sweater\nPah, it's not a big fairy tale that's my M.O\nFuck bitches on the rag with no problemo\nIceberg, rabbits, in the Foxhills Mall\nWhere I copped two more, brought four for RZA\nBad Boy thank you for this special delivery\nCatch me by the pool in my Tony Starks slippers\nWonder Woman armed, Ghost is intelligent\nMade 30 off of dust dime I was killin 'em\nDid cash on One-Sixteen I was feelin 'em\nThem days kept a crisp coke dollar bill on 'em\nI lived it out -- special delivery\nI spit it out -- special delivery\nI sniffed it out -- special delivery\n\n[Hook: P. Diddy]\n(I want that) Special delivery!!!\n(I need that) This is the remix, special delivery!!!\n(Can I have that?) Come on, special delivery!!!\n(Well give it to me) Bad Boy baby!!, special delivery!!!\n(I want that) We won't stop!!!, special delivery!!!\n(I need that) Yeah! G. Dep! Child of the Ghetto!!!\n(Can I have that?) As we proceed! AHHH!!\n(Well give it to me)\n\n[Verse 2: G. Dep]\nAiyyo! Aiyyo!\nSigned, sealed, delivered in just the nick of time\nRare, I'm a give it to 'em my design is rhyme in the ghettoist form\nShow power the child of the ghetto is born\nUh, feet first, preach give a speech I kick ya each verse\nGroove let the shit just spit now it's dirt\nDeath pressin ya and ya like a hustler on the first ya need work\nStand by the grand high exhaulted\nAt your door with a portrait of the raw shit\nPicture that while I spit anthrax\nOn your cd, tape, and wax so stand back\nYou don't really wanna jump the gun\nIn the airless flow with punctured lungs\nGo 'head and stand there and bump ya gums\nIf ya wan't the problem we can hurry up and come bury ya\nI'mma play the courier\n\n[Hook: P. Diddy]\nSpecial delivery!!!\n(I want that) Yeah come on, special delivery!!!\n(I need that) This is the remix, special delivery!!!\n(Can I have that?) Ha-ha ha-ha, special delivery!!!\n(Well give it to me) Come on come on!!! Special delivery!!!\n(I want that) Yeah yeah!!! Special delivery!!!\n(I need that) What what!!! Special delivery!!!\n(Can I have that?) Ladies and gentlemen, Keith Murray, ahh!!\n(Well give it to me)\n\n[Verse 3: Keith Murray]\nYo! This for my niggas dem special delivery\nBang ya head off to this, fuckin up your memory\nI'll shake your cradle and rock your boat\nBuck 50 your face and then butter your throat\nIt don't matter where you been or where you at\nI'm here now and I'm bangin, kid you softer than the Queen of England\nPhraseologist natural philosopher wordsmith\nAuthentical metaphorical lyricist\nSharp descriptive writer, kill a biter\nPanty raider, party exciter\nYo Murray what the deal - how ya feel?\nYeah I'm gutter what I utter got you timid hesitatin like a stutter\nOxymoron, don't be dumb\nI school niggas like the United Negro College Fund\nI see you plottin schemin tryin to snake\nAnd when you do I'm a give it to you special delivery\n\n[Hook: P. Diddy]\n(I want that) Special delivery!!!\n(I need that) This is the remix!!! Special delivery!!!\n(Can I have that?) Get wit me now come on special delivery!!!!\n(Well give it to me) Bad Boy baby!!! Special delivery!!!\n\nAy yo hold up a second......this is the remix\nSo let's bring back my man, Craig Mack\n\n[Verse 4: Craig Mack]\nAiyyo you must wanna be in the Guinness Book of World Records\nAs the dumbest motherfucker alive\nFigure you gon' survive\nYou couldn't move through my terrain, even in 4-wheel drive\nAnd I'm your highness, finest\nYou hungry? Try this, buy this, livest\nUh huh, I take my rap style real serious\nWhat you think it ain't...that serious?\nI bang clubs and streets it's gettin hot\nSee Mack won't stop until Mack's on top\nYoung black america my CD drop\nIn two thousand and two, to change hip-hop\nMost folks shake ya bones\nI'm talkin cyclones and \"Terrordomes\" like Mel Gib-son's\nMy heat will cook you bwoyy, whooped you bwoyy!\nMack came an shook you bwoyy, somma'bitches\n\n[P. Diddy]\nSomma'bitches!!!\n\n[Hook & Outro: P. Diddy]\n(I want that) Take that!!! Come on!!! Special delivery!!!\n(I need that) Special delivery!!!\n(Can I have that?) This is the remix!!!! Special delivery!!!\n(Well give it to me) G. Dep!!!! Special delivery!!!\n(I want that) Come on now!!! Special delivery!!!\n(I need that) Child of the ghetto!!! Special delivery!!!\n(Can I have that?) 1-1-5, Harlem's Finest!!! Special delivery!!!\n(Well give it to me) Yeah, special delivery!!!\n(I want that) Alumni baby! Special delivery!\n(I need that) B-R, special delivery!\n(Can I have that?) Ghostface, special delivery, Keith Murray!\n(Well give it to me) Craig Mack, special delivery!\n(I want that) I'm that boy they call Diddy, Bad Boy baby\n(I need that) Yeah! Special delivery!\n(Can I have that?) Special delivery\n(Well give it to me) Special delivery..."}]}