{"songs": [{"album": "Beef Soundtrack ", "image": "https://images.genius.com/0bd0fffa678fd9f4784768dce9e488ab.400x400x1.jpg", "year": "2003-10-07", "title": "Beef", "lyrics": "[Intro: Tech N9ne]\nBut the cattle had no idea when entering the slaughterhouse that they would never return, so they went while the others watched in the distance listening to the slaughtering of there own. So fear and stress sets in as the other groups approached the slaughterhouse led by the farmer. See, the farmer knew that the cattle had something valuable; something he wanted, so he attacked and the result of the attack was beef (beef)\nB-E-E-F: bitter emotions envy and fear - beef\nAin't nobody got no real beef with me, nigga what? Every time a motherfucker come along and do something. It's always another motherfucker that wanna come along and stop his ass. Ain't nothin' strong enough to stop fuckin' Tech N9ne, nigga. Ain't nothin'! Ain't nobody got no motherfuckin' beef with me, nigga fuck you!\n\n[Verse 1: Tech N9ne]\nBetter watch your language!\nNiggas jealous when the women feel us\nWe famous\nGettin' with us, ain't an option haters, send the killers, bring 'em\nStraight angus\nGrade A hater!\nHatin' niggas that change up\nYou don't wanna get banged up\nFucking around with them strangers\nIt better be about money ('bout money)\nAnd it bet' not be no bitch\nBetter go fish, I don't wanna hear all the lip\nAnd if he trippin' hit 'em with the four-fifth\nWanna take it there and it's so sad\nThinkin' he packin' a pair of the gonads\nWhat you got a little beef with me?\nWell I got a big fat meatloaf for your ass\nBow down haters, turn around niggas\nGo and clown if you like the way it sound - beef killers\nWait a minute, nigga, why you lookin' at me\nLike a motherfuckin' bald head when I got a head full of hair?\nEyeballs red with a stare, put a nigga dead in the air\nFuckin' a family believe it I'll take it there\nStuck in a wheelchair never gonna take\nAnother step again, a weapon and the specimen\nI left him in a mess and then I gotta\nGive a nigga the metal medicine and holler\nI ain't never gotta wipe my tears\nNever need a gang when I fight my fears\nIt stops right there and continues right here\n\n[Hook: Krizz Kaliko]\nIf you want beef, it's right here, here, yeah, yeah\n'Cause if it's on then it's on, if you want it come on\nIf you want beef, it's right here, here, yeah, yeah\nIf you want it come on, nigga just say what you want\nIf you want beef, it's right here, here, yeah, yeah\n'Cause if it's on then it's on, if you want it come on\nIf you want beef, it's right here, here, yeah, yeah\nIf you want it come on, nigga just say what you want\n\n[Verse 2: Krizz Kaliko]\nSee, ever since the beef I've been havin' these dreams\nOf killin' ya, triple beams is spillin' your blood\nOut your umbilical, I-I never been the killin' type\nBut gimme the gun and I might just pull it tonight\nI'm willin' to fight, but if you got a nine mill' I got another\nNine millimeter that'll get you like BLOW! (blow!)\nWhy you talkin' loud now?\nThought that when you was facing me I would gracefully bow out now\nCan get grim on this nigga (yeah!)\nCatch him comin' out the Peach Tree and stomp my Timbs on this nigga (yeah!)\nThat shit that you talkin' ain't nothin' but gum bumpin'\nBumpin' the gun pumpin'\nMost of you niggas don't want nothin', nah\nMe and my people, we done frontin'\nIn fact, if we take it from wax to the streets you done done it\nWant beef nigga? Better say that shit\n'Cause from around here, nigga, we don't play that shit\nDon't let part of your speech make you lose part of your teeth\nCause you ain't hardly hard to me if you want beef from me\n\n[Hook: Krizz Kaliko]\nIt's right here, here, yeah, yeah\n'Cause if it's on then it's on, if you want it come on\nIf you want beef, it's right here, here, yeah, yeah\nIf you want it come on, nigga just say what you want\nIf you want beef, it's right here, here, yeah, yeah\n'Cause if it's on then it's on, if you want it come on\nIf you want beef, it's right here, here, yeah, yeah\nIf you want it come on, nigga just say what you want\n\n[Verse 3: Tech N9ne]\nBeef is when a nigga run around town talkin'\nAbout you owe him a hundred Gs\nBeef is when a nigga tell somebody\nHe wanna get you when you hear about it overseas\nBeef is a nigga that's sinful\nDraw a wicked plan out with a stencil\nTell your homeboys falsified info\nAnd that's so he can turn them all against you\nHatin' on you, the bitches and niggas sayin' you wack\nWhen everything you got workin' is play in the back\nGo back to crack, go back to sprayin' the gat\n'Cause your bullshit rap don't stay on the rack\n7th Heaven gonna have to put the shit on auction\nCause the shit ain't poppin', nigga knew it was shockin'\nWhen you was sellin' CDs out of the trunk in Joplin\nAnd I was on tour fuckin' bitches in Oakland\nRegime Life nigga, fuck everybody else\nDeuce Click-Deuce Click\nDamage your body health\nSayin' nobody feel me, well nobody feel you\nPolice tryin' to tell me how to kill you\nWhen you feel you really wanna jump in the mildew\nAin't no tellin' what niggas with kids will do\nTravis O'Guin you know he got bills too\nWe ain't the ones trippin' nigga it's still you\nNever thought I would see the day that I would be speakin'\nAbout a nigga that I called my bro man\nBut then a nigga really got to thinkin'\nI gave 'em 25 thou of mine, Q gave 'em 50 for no damn reason\nSo the pub I gave you for 25, a hundred Gs, I say we even\n\n[Hook: Krizz Kaliko]\nIf you want beef, it's right here, here, yeah, yeah\n'Cause if it's on then it's on, if you want it come on\nIf you want beef, it's right here, here, yeah, yeah\nIf you want it come on, nigga just say what you want\nIf you want beef, it's right here, here, yeah, yeah\n'Cause if it's on then it's on, if you want it come on\nIf you want beef, it's right here, here, yeah, yeah\nIf you want it come on, nigga just say what you want\nIf you want beef, it's right here"}], "artist": "Tech N9ne"}