{"artist": "50 Cent", "songs": [{"album": "Before I Self Destruct", "image": "https://images.genius.com/eebe68987c98d3b1f9b4166f6ac4d3f7.1000x1000x1.jpg", "title": "I Got Swag", "lyrics": "[Produced by Dual Output]\n\n[Hook]\nI don't really think she want me back then, she want me now\nShe can play games all she wants, she cannot pretend, she like my style\nI got swag now, I got paper, I'm rolling in the dough, I'm caked up\nI got swag now, I got paper, I'm swimming in the dough, I'm caked up\n\n[Verse 1]\nI was a real bum now I'm really rich, kid\nI come through the hood in some really, really sick shit\nThe Rolls, the roof gone, your flows, they're lukewarm\nIt's why you're not me; nah-nah-nah-nah-nah\nShe like the kid, my lifestyle what she wanting\nBottle after bottle by the bar, I be stunting\nIt's Gucci this, Gucci that, Gucci hat\nBig doofy gat, hit you in your kufi hat\nYou know me, I told your ass in '03 \"Get Rich or Die\"\nG-5 I fly, write my name in the sky\nPick an island on the map, I been to it\nShorty wanna try anal, her friends do it\nWrists rocked up shining, flawless diamonds\nYou could hardly see the face on my Audemar time and\nOn that J.T. shit, me I'm bringing sexy back\nLouis belt wrapped around right where the TEC be at\n\n[Hook]\n\n[Verse 2]\nGetting paper's my objective, yup, now your chain gone\nOne false move and clap, now your brain's gone\nYou like me, you aight with me; me? I'm into me\nI destroy my enemies even if they're kin to me\nDo 'em like the Kennedy's, ching-ching that's mo' bread\nSay something slick out your mouth I'll come for your head\nShe likes me more than you can imagine\nBad bitch, look like she fell up out a pageant\nClosest I'mma get to heaven in this lifetime\nIs right below her waist in between her thighs\nCall her Pussycat, that's my nickname for her\nAnd I ain't got to buy shit or run game on her\nSee when I stunt she stunt, we stunt together\nOh, you don't like how that sound? Aw nigga whatever\nWe both rock Bugarri, both push Ferrari's\nI go so hard in the paint, I'm sorry\n\n[Hook]\n\n[Verse 3]\nYou want me? I want you - plug one? Plug two\nI'm infinitely special, girl\nThe Lord's gonna bless you if you do what I tell you to do\nYou want me? I want you - you want a Benz? I'll buy two\nYou should want me like you want success\nGirl, with us together we'll be better than the best\nWhy settle for less?\n\n[Hook]", "year": "2009-11-09"}]}