{"artist": "Willie D", "songs": [{"year": "1989-12-21", "lyrics": "[ 'welfare bitch' 1 ]\nGirl, your foodstamps ain't came yet\n[ 'welfare bitch' 2 ]\nGirl, you're late, I got my shit and traded it in for a leather skirt\n[ 'welfare bitch' 1 ]\nThem muthafuckas ain't send me my shit yet\nBut tomorrow I'm goin down there clown they muthafuckin ass\n[ 'welfare bitch' 2 ]\nI know that's right, girl...\n\n[Verse 1: Willie D]\nDee's about to cold get funky\nOn you welfare bitches around the country\nI don't give a damn if you like me or not\nBut this bullshit you're doin has got to stop\nYou're playin the government for a sucker\nWhat you don't know is they're hip to you muthafuckas\nDroppin babies one after another one\nJust to increase your funky-ass income\nWelfare bitch, welfare bitch if you could see\nFor this purpose, cause I believe\nThat a child should be born out of love\nDumb-ass bitch, you was only thinkin of\nThe money which is for the kid indeed\nBut you took it and satisfied your own damn needs\nYou ain't about shit, you only love uno\nOne of these days there ain't gonna be no\n\nWelfare\nYeah\nWelfare bitches\n\nWelfare\nYeah\n(Keep away from)\nWelfare bitches\n\n[Verse 2: Willie D]\nSit around gettin high and drunk\nWaitin on the muthafuckin' first of the month\nThey never looked for a j-o-b\nCause they're too busy watchin the soaps on ABC\nYou realize it's only make-believe\nBut yet when one died get shocked and grieve\nThink Scorpio or Lucy or the rest of the crew\nGive a fuck about a po' broke ho like you?\n\nWelfare\nYeah\n(Keep away from)\nWelfare bitches\n\n[Verse 3: Willie D]\nBitches, bitches, bitches, bitches\nWill trade foodstamps in a jet flash\nA $65 bill get you 50 in cash\nThey're the muthafuckas that's makin it hard\nFor the people who really need the government involved\nThey have their kids lookin a mess\nWhile they walk around sportin' Gucci and Guess\nYou say you love your kids, that's a goddamn lie\nI said it, you wanna know why?\nCause you'se a welfare bitch, a welfare bitch\nSo is your man\nHere's his muthafuckin' plan:\nHe don't have to work as long as he sees\nA welfare bitch that supports his needs\nHe get the three p's every goddamn day:\nPussy, pay, and a place to stay\nYou're a sorry muthafucka if you live this way\nYou need your ass whipped, that's what I say\nI ain't livin life with a dumb po' broke ho\nWillie the kid don't fuck with no\n\nWelfare\nYeah\n(Keep away from)\nWelfare bitches\n\n[Verse 4: Willie D]\nWelfare bitches can't do a muthafuckin' thang for me\nBut suck my dick, cause I don't want the pussy\nYou fuck em one time and the goddamn whores\nI'll get pregant and swear up and down that it's yours\nI got the money so you wanna get hit\nDon't tell me that you're pregnant cause I ain't claimin shit\nDon't try to play me cause I can't be pussy-whipped\nSo stay out my face and get off my dick\n\n(I tell you, mister\nI keeps me a welfare bitch\nHow ya think I got this Benz?\nI tell ya\nI keeps on zipped pockets\nYou can ask your mama there\nI always get the three p's\nShe give me the damn three p's every goddamn day\nBitch treat me better than she treat her kids\nYou know\nAnywhere in the Nickel\nDown the [Name], the Bottom\nAnd ask em do they know [Name]\nThey'll tell you\nYeah, he take a bitch to get the check\nI'm lyin?\nYou could ask your mama\nMaybe her son don't know\nI tell you this though\nI keeps on reptiles, leather, gold\nAnytime you see me I'm ridin\nCause your mama bought me a gas car\nYeah\nThink I'm lyin?\nAsk your daddy, he was there\nI pimped your father\nI could tell he's a ho\nHe a punk\nHa-ha\nI go down there and tell em I want this\nThen make sure your mama get it for me\nCause I'm the man down there\nYou can ask anybody who runs the welfare bitches in the Ward\nNot this, not that\nI'm the man!\nAnybody comin down here talkin bout where they from, what they do\nThey don't do a damn thing\nI do it all\nI keeps the bitches...)", "image": "https://images.genius.com/03c2b50829c5f112b3f64d1ceaa1bce1.700x700x1.jpg", "album": "Controversy", "title": "Welfare Bitches"}]}