{"artist": "Andy Mineo", "songs": [{"title": "Sword Fight", "album": "Str8 From The Underground", "year": "2013-03-08", "image": "https://images.genius.com/db0a8c784436f2477ec1292109524f3f.1000x1000x1.jpg", "lyrics": "[Verse 1: Andy Mineo]\nIf my life is but a vapor\nThen these words are just some molecules, jotted on paper\nNot even hot enough to savor\nMore importantly, I’m sorta geeked\n‘Cus up in my Scripture studies I’m stumped\nLike what is up with these verses?\nThey stuck in me brain\nNow I’m just waiting to take in the revelation\nI’m meditating to gain\nStaring off into space while I’m waitin’ up on the train\nPeople think I’m insane, cus I’m contemplating the saying\nHow could creator, come to creation, save his created, in the frame of a son?\nLeavin’ behind his fame, his glory, his place of reign\nWhere “Holy is the Lord” is what all of the angels sang praises unto his name\nAnd still he left it and came\nTo kick it with wicked sinners with mischief up in their veins\nWorthy of all worship, but still he served us\nAnd even washed the feet of the one that was to betray him… dang\nAnd my sin’s the reason He came\nTo drink the cup of the wrath of the Father in an exchange\nMy sins for his righteousness what a gain\nCus 2 Corinthians 5:21 he became... sin\nNow I don’t gotta taste the flames, walkin’ in the spirit\nIt got me flowin’ like David Blaine... yeah\nSo I’m praying without ceasing\n'Cus Satan ain’t Damon Wayans but he sure is a Major Payne\nLet’s go\n\n[Break: John Piper]\nYou never out grow your need for the Gospel. Don’t ever think of the Gospel as that’s the way you get saved. And then, you get strong by leaving it and doing something else. We are strengthened by God, through the Gospel, every day ‘til the day we drop\n\n[Verse 2: Andy Mineo]\nMy mind’s steady thinkin’\nDwellin’ upon the Christ while the time tickin’\nAs I’m inchin towards the wood pine finish\nBut dyin isn’t the end of it all\nMight seem a contradiction\nOnly to those who missing the aptitude for sublime vision\nCombine the boom bap with the rhyme precision\nBefore we proceed to speak about the truth, define fiction\nOutside the Divine Infinite Being we lack the distinction to accurately navigate morality’s system\nIf you’re thinkin that I’m trippin when I’m continually spittin\nAbout totally deprived sinners, we most go in it\nThe record ain't skippin but let me bring it back\nEvery man’s heart’s desparately wicked, I’m wicked\nYou don’t believe me? Take a second to kick it\nEvaluate your heart, lay it against the Scriptures\nEvery man sins, don’t gotta make a case for the stance\nMy conscience is my primary witness called to the stand, let’s go\n\n[Outro]\nCrushed bones and blood drippin off his face\nFramed on wood, now that's a picture of grace"}]}