{"artist": "Professor Green", "songs": [{"album": "M.O.T.H.", "title": "Boring", "image": "https://images.genius.com/72eee6a08042c30e82cf359ef3e9c628.1000x1000x1.jpg", "lyrics": "[Intro]\nYeah\nSo sick and tired of feeling sick and tired\nFeel like hanging up the headphones and walking away from the mic\nMy fucking record label tryna block me\nYou know that's not me\nWhen you know me to turn away from confrontation\nI need suttin' to bounce back from, ah\nTurn me up in my headphones\nI need more me, yeah\nAh\nYeah, yeah, louder, louder\nYeah, yeah, ah, mate\n\n[Verse 1]\nSlick Rick, I run this, you fuckwits can give my arse a kiss\nAnd anything that you do, I been done, or un-did\nI'm nothing to fuck with, give a clitoris a flick\nI've been through my fair share of crumpet\nCalm down, don't have a seizure, or a fit\nWhen have you ever know me to give a shit, you dumb shit?\nOut of place 'cause I'm very smart, I run shit\nRun into, don't run from, time's ticking, and I'm the bomb\nGoing off like I'm out of date, but got shelf life like I'm processed\nPro G, that's Pro Green, or progress, you know me\nI'm headfirst, I'm both feet, 'till I'm six deep, but I won't rest\nI'm yawnin', and fallin' asleep, because what you're recording's appalling\nBullshit about balling is boring\n\n[Chorus]\nBoring, boring, boring, boring, boring\nBoring, boring, boring, boring, boring\nBoring, boring, boring, boring, boring\nBoring, boring, boring, boring, boring\n\n[Verse 2]\nYou really wanna talk about cars (Boring)\nYou really wanna talk about yards (Boring)\nYou really wanna talk about cash (Boring)\nYou really wanna talk about period\nThey need a new leader, I'll lead the way\nWhile doing a little dance like Theresa May\nI don't really care about climate change\nI'm pale as fuck, I need the rays\nBring climate change, or rising the cost to live on a declining wage\nWhile I kick back in my big house, I watch the world burn with designer shades on\nWhich pair? I got hundreds, and more clothes than I can fit in my cupboards\nI don't want beef with Theresa either, I just wanna grow reefa like her husband\n\n[Chorus]\nBoring, boring, boring, boring, boring\nBoring, boring, boring, boring, boring\nBoring, boring, boring, boring, boring\nBoring, boring, boring, boring, boring\n\n[Outro]\nBoring, boring, boring, boring, boring\nBoring, boring, boring, boring, boring\nBoring, boring, boring, boring, boring\nBoring, boring, boring, boring, boring", "year": "2019-09-06"}]}