{"songs": [{"image": "https://images.genius.com/655b854c09fd20fcd932070d6fa0e912.640x640x1.jpg", "title": "Intro", "album": "Price City", "year": null, "lyrics": "[Hook]\nWait a minute\nHold up, brake pads\nSmoking on that loud\nAnd off that loud enough to break glass\nSmoke at registration\nProbably sober up at 8th class\nMiddle finger to my opposition and your hating ass\n\n[Verse 1]\nI say\nFuck what's in your pockets\nThat shit don't define me\nI am far from human, stupid Google can't describe me\nI'm probably the realest here\nBut y'all rap niggas ain't hearing that\nBut if you drop this here - you might fuck around and get an ear tan hoe\nWhere you heard that?\nNo nobody said it\nI'm the type of nigga get drove by the chemist\nSo angelic but the flow kinda hellish\nSo dope with the freestyle - low I can sell it\nAnd my hand on the mic like feel Jackson\nBeat it up now I feel like Blacksun\nFuck high school, I mean it fuck high school\nWith a gold chain on screaming, \"No Flex Zone\"\nI met a girl named Sam (girl named Sam)\nAnd I fell inlove with a girl named Sam\nYeah I had to rub it in like bird mans hands\nOne hunnid, high life, stay puffing, dry ice\nAnd if don't love it, they can die twice\nI've seen the afterlife\nI took a peek shit still don't change\nY'all still got a penis appetite\nBitch nigga, you ain't acting right\nYou ain't rapping right?\nAnd peer pressure almost had a young nigga straight blasting pipes\nYou gotta know which hand can't take the strife\nTo make a sacrifice\nMy nigga you can't practice life\nI'm Price City's Tommy Vercetti\nMy whole life rests in the palms of the fetish\nGrab it it out the hat, magic shit\nDab it out the ass for this rapping shit\nAnd then write a rhyme instead of studying for my exam shit\nDumb nigga, dumb nigga\n\n[Hook: Nasty C]\nI could be doccin and doccin or Rakim and paccin'\nHave 'em talkin' and talkin'\nHow I murder these records\nThis shit is just reckless\nCan't believe how they reckon\nThat I'm the shit of my era\nYou know!\n\n[Bridge]\nI keep it realer than anybody, my nigga you can ask anybody\nIf you see my footprints when the moon hits, I'm faded off that dumb shit\nYou know!"}], "artist": "Nasty C"}