{"artist": "Kilo Ali", "songs": [{"image": "https://images.genius.com/dae28a7d141c723b92db9597449e7cb5.300x300x1.jpg", "title": "Baby, Baby", "year": "1997-07-29", "album": "Organized Bass", "lyrics": "When I'm alone in my room\nI sit and stare at the wall\nBrother can't find no love at all\nI'm gonna find you girl someway, somehow\nI need you right now!\nSearch the world, but couldn't find that feeling\nCause your love is a one in a million\nCause I like the way that you (Touch me)\nAnd I like the way you (Fuck me)\nAnd you really make it (Worth my while)\nI said Woof, Woof, Woof, Woof, (Doggy style)\nCause you're on my mind, on my thoughts\nLet me see your body talk\nI'm makin love on a whole 'nother level\nHave you ever danced with the Devil?\nWhen I'm around you I feel like this\nA kiss is just a kiss\n\n(Chorus)\n(girl) Baby, baby!\n(kilo) Oh, work it on me\n(girl) Baby, bab!y\n(kilo) I need your L-O-V-E\n(girl) Baby, baby!\n(kilo) Baby, baby!\n(girl) Baby, baby!\n(kilo) And I want you to know that\n\nCause I'm a lover, niggas talk shit\nI wish them punks would get up off my dick\nCause they try me, and they push me\nI'm fuckin these niggas like pussy\nBut a nigga ain't gay\nI said uh UH UH, it's your birthday\nSame ho talk about I'm a busta\nYeah, I fucked her\nI rocked her world\nI Said she use to be, use to be my girl\nFor just one night, I said uh that face wa tight\nShe said I think I'm Stevie Wonder\nWell I'd like to thank your momma\nWhen I'm around you I feel like this\nA kiss is just a kiss\n\n(chorus)\n\nWell, you can blame it on the lover in me\nThe heavy weight cut of the champion Ali\nAnd in the hood I'm a menace\nHold on, sit down, let me talk, let me finish\nI get that ass\nKeep the camera rollin, I'm kinda fast\nGet all the girls, and I shock the world\nWhy'd Humpty Dumpty have to fall?\nCause he was freakin off the wall\nAnd it be like that\nWhen you be trying, to break that back\nI give my number to the ladies\nCause I would love to love you baby\nWhen I'm around you I feel like this\nA kiss is just a kiss\n\n(chorus) 2x"}]}