{"songs": [{"image": "https://images.genius.com/64efcd85041bcf1840a2b65a9ae4684a.1000x1000x1.jpg", "title": "The Search", "album": "The Search", "year": "2019-05-30", "lyrics": "[Verse]\n\"Hey, Nate, how's life?\"\nI don’t know, it's alright\nI've been dealin’ with some things like every human being\nAnd really didn't sleep much last night\n\"I'm sorry,\" that's fine\nI just think I need a little me time\nI just think I need a little free time\nLittle break from the shows and the bus rides, yeah\nLast year I had a breakdown\nThoughts tellin' me I'm lost gettin' too loud\nHad to see a therapist, then I found out\nSomethin' funny’s goin’ on up in my house\nYeah, I started thinkin' maybe I should move out\nYou know, pack my cart, take a new route\nClean up my yard, get the noose out\nHang up my heart, let it air out\nI’ve been searchin'\n\"What does that mean, Nate?\" I've been learning\nGrabbin' my keepsakes, leavin’ my burdens\nWell, I brought a few with me, I'm not perfect\nLookin' at the view, like this concerns me\nPickin' up the cues, right? I'm quite nervous\nHate it when I lose sight, life gets blurry\nAnd things might hurt me\nIt's prolly gonna be a long journey, but hey\nIt's worth it, though\nCold world out there, kids, grab your coats\nIt's been a minute, I know, now I'm back to roam\nLookin' for the antidote to crack the code\nPretty vivid; I admit it, I'm in classic mode\nDon't need pity given to me, but I can't condone\nTalkin' down to me, I'ma have to crack your nose for crackin' jokes\nI'm lookin' for the map to hope, you seen it?\nBeen makin' a whole lot of changes\nWrote a song about that, you should play it\nI get scared when I walk on these stages\nI look at the crowd and see so many faces, yeah\nThat's when I start to get anxious\nThat's when my thoughts can be dangerous\nThat's when I put on my makeup and drown in self-hatred\nForget what I'm saying, and—\nWhere'd the beat go?\nOh, ain't that somethin'?\nDrums came in, you ain't see that comin'\nHands on my head, can't tell me nothin'\nGot a taste of the fame, had to pump my stomach\nThrow it back up like I don't want it\nWipe my face, clean off my vomit\nOCD, tryna push my buttons\nI said don't touch it, now y'all done it\nI can be critical, never typical\nIntricate with every syllable, I'm a criminal\nIntimate, but never political, pretty visual\nEven if you hate it, I'll make it feel like you're in it, though\nYou call me what you wanna, but never call me forgettable\nLeave you deep in thought, I could never swim in the kiddie pool\nWay that I been thinkin' is cinematic, it's beautiful\nMan, I don't know if I'm makin' movies or music videos (Videos, videos)\nYeah, the sales can rise\nDoesn't mean much though when your health declines\nSee, we've all got somethin' that we trapped inside\nThat we try to suffocate, you know, hopin' it dies\nTry to hold it underwater but it always survives\nThen it comes up out of nowhere like an evil surprise\nThen it hovers over you to tell you millions of lies\nYou don't relate to that? Must not be as crazy as I am\nThe point I'm makin' is the mind is a powerful place\nAnd what you feed it can affect you in a powerful way\nIt's pretty cool, right? Yeah, but it's not always safe\nJust hang with me, this'll only take a moment, okay?\nJust think about it for a second, if you look at your face\nEvery day when you get up and think you'll never be great\nYou'll never be great—not because you're not, but the hate\nWill always find a way to cut you up and murder your faith (Woo)\nI've been developin', take a look at the benefits\nNothin' to meddle with, I can never be delicate\nAm I even relevant? That depends how you measure it\nTake a measurement, then bag it up and give me the evidence\nPretty evident; dependable can never be tentative\nI'm a gentleman, depending on if I think you're genuine\nPretty elegant, but not afraid to tell you to get a grip\nProper etiquette, I keep it to myself when I celebrate, ah\nIt's that time again\nBetter grab your balloons and invite your friends\nSeatbelts back on, yeah, strap 'em in\nLook at me, everybody, I'm smilin' big\nOn a road right now that I can't predict\nTell me \"Tone that down,\" but I can't resist\nY'all know that sound, better raise your fist\nThe search begins, I'm back, so enjoy the trip, huh"}], "artist": "NF"}