{"songs": [{"title": "Envy Me", "year": "2015-03-11", "album": "32 Zel/Planet Shrooms", "image": "https://images.genius.com/ff4709d394558e41c64e5733c1575b62.500x500x1.jpg", "lyrics": "[Hook: Denzel Curry]\nI'mma keep balling, 'til they envy me\n21 guns, for my enemies\nNiggas got some, ho ass tendencies\nCash out, I'm ballin', til they envy me\nMy enemies, motherfuck my enemies\nCause I'ma keep ballin', til they envy me\nMy enemies, motherfuck my enemies\nCause, I'ma keep ballin', til they envy me\n\n[Verse 1: Denzel Curry]\nUp in Carol City, me and Lotto in the charger, when we slide two deep (Two deep)\nCan't fuck with the south with a AK-forty-seven bumping T Double-D (Double D, nigga!)\nFirst forty-eight, gotta say it one time, R.I.P. my nigga Bizzle (Bizzle!...,,,bizzle)\nKick, drill, ravish of a nigga think he savage, turn him to a popsicle\nThat's \"Ice...COLD!\", and my last name ain't three-thousand (3000)\nBad ass bitch on my t.i.p. (Tip Harris), she wet, like an everlasting fountain\nStill a Hot Boy, ‘bout whatever like, Turk or Wayne, like a motherfuckin' Carter\nNiggas water whipping, in the hot damn kitchen, like a nigga Avatar, or Katara\nRemember that it's still fuck the other side, lurking all black, like that boy Plies\nSnapping, like a fat ho at the Popeye's when she don't get the thigh, the chicken, or the fries\nSo nigga what it be? I can turn my shirt to a ski, fuck feds, not even ice T\nWanna come and ice me, like it's New Jack City,shit looking grim - no Mandy, Billy\nCross the chopper line bitch, you better bow down to a nigga greater than yourself...trick\nFlow is immortal, so therefore I gorde, you do something of it for yourself...trick\nFrom the 'Tre deuce, got to keep a deuce deuce, like a nigga lurking in South Cen-TRU (South Central)\nBruh, if you bout that pressure cross that line, fuck nigga state your issue...\nMy nigga\n\n[Hook: Denzel Curry]\nI'mma keep balling, 'til they envy me\n21 guns, for my enemies\nNiggas got some, ho ass tendencies\nCash out, I'm ballin', til they envy me\nMy enemies, motherfuck my enemies\nCause I'ma keep ballin', til they envy me\nMy enemies, motherfuck my enemies\nCause, I'ma keep ballin', til they envy me\n\n[Verse 2: Denzel Curry]\nBehold these verses, the stars to the churches will all metamorph into seven\nI'm rocking about four types of polo, you peep that my style it must be Armageddon\nApocalypse stop, pop the clip, better bow down now it's all about power\nFantasy darker than Swishers, the wicked demented, get hit with the mystical shower\nNow that's dan-ger grab, on the ban-ger, take down the empire bruh\nIn the hood jits robbin', like Williams,let's hope that they'll never doubt fire\nNiggas be knocking no cabbage, no UPS person, so tell me what's up with the S?\nSlithery snakes, with they slithery tongues, salivating salvations with shit on your head\nYes, Curry gone mash on these cowards\nWith shells to they back like they bowser, spit fire -  no flower\nGet smoke, like the OG and sour then head up to Broward\nYou know when the bass turn up louder, 'bout loud as the dro, get to the door\nI'm shroomed out my mental, like Mario Bros\nI'm seeing the walls start to kaleidoscope, so I'm guessing that already means that I'm gone\nIt's quiet striking that, haters won't tell the truth in front of your face\nNot the same time, not the same place, so they hate from a greater distance far away\nYou see them in person look 'em in the eye, and they say that wasn't the case\nY'all can suck a dick in advance, like Rich Homie Quan, get the fuck out my face...bitch\n\n[Hook: Denzel Curry]\nI'mma keep balling, 'til they envy me\n21 guns, for my enemies\nNiggas got some, ho ass tendencies\nCash out, I'm ballin', til they envy me\nMy enemies, motherfuck my enemies\nCause I'ma keep ballin', til they envy me\nMy enemies, motherfuck my enemies\nCause, I'ma keep ballin', til they envy me\n\n[Outro: Sample]"}], "artist": "Denzel Curry"}