{"artist": "The Game", "songs": [{"title": "Bad Intentions (Purp & Patron)", "album": "Purp & Patron", "year": "2011-01-24", "image": "https://images.genius.com/2ac5b9e1da222cb025aa059f64716e53.500x500x1.jpg", "lyrics": "[Intro]\nHey, yo, let me get some more Patrón\nCherry Coke\nSome motherfuckin' Zig-Zags\n\n[Verse 1]\nBad intentions, nigga, fuckin' with the wrong one\nCall Dre, tell that nigga I'm on one\nAftermath, nigga, we blaze Cuban cigars\nAnd drive foreign cars, nigga we stars\nFuck bitches at our leisure\nStuff dick inside they throat 'til they have seizures\nHoes down, B's up\nRoll the trees up, Smokey Robinson\nGet high, start trippin', I like his jewelry, then I'm robbin' son\nFuck a platinum plaque, nigga hood with it\nBouncin' that Impala down the shore like, \"What's good with it?\"\nI'm a made man, I wear J's and\nI been around more rocks than a fuckin' caveman\nI done sold it and bagged it\nI done drove it and crashed it\nFucked my credit up smashin' the Aston\nF.Y.I., nigga, I got a magnum\nOnly time I been punked was by Ashton Kutcher\nI'm a motherfuckin' butcher\nLeave me around anything white and I'ma cook it\nI be all up in the kitchen, no need for an apron, playboy\nI'm a professional, I'm cakin', playboy\nThe last real D-boy in this rap shit\nChrome 24s with the fat lip, call them shits Ras Kass\nRasclart, you fuckin' with the bomb squad\nDismantle any MC for free, you been warned, god\nChurch, high power\nImpala sittin' clean like it took 5 showers\nNigga, I'm the G.A.M.E., so don't you tempt me\nYour chest'll be full and my clip'll be empty\nI'm simply one of the most raw niggas in this shit\nWhy you think that I got in this shit?\nPaid for my momma house, 'bout 700k\nCan't stop smokin' but I'm down to a blunt a day\nYay, I mean yayo\nOn the block, sun up, sun down, like where the day go?\nWe come through chargin', nigga, like San Diego\nSeventeen chargers, couple of 'em same color but the shit is ok though\n'Cause all my niggas on the payroll get caught slippin' and get a halo\nAnd I ain't talking 'bout the Xbox\nNiggas let the tech knock\nWelcome to the real-life Black Ops\nWhere it's still fuck the police, white or black cop\nAnd we ain't killin Jonny Law, nigga, give 'em an ass shot\nPut him on injured reserve\nTie my number twelves up and then I give him the bird, word\nThat's how I get down, all you rap niggas floppin'\nWho talkin' shit now? Only Drake and Yay worth coppin'\nI take a hiatus, spend a little time gamblin' in Vegas\nCome back to back runnin' faster than five Lakers\nSo motherfuck a hater and his family\nAbout to finish the R.E.D. album up in Miami\nLebron can't stand me, 'cause I got this Purp in my cup\n24s on the truck, Laker Game, nigga, what?\nBallin, Jim Jones voice, problem with the Byrd Gang?\nSee the chrome, boy, and my mother fuckin homeboys?\nBut I'm from Cali not to be confused with Khaled\nHe say that we the best but I'm the best, that's valid\nAnd before you try to say that that's a diss\nI was at Khaled's house two days ago,  bitch\nSippin' Long Island Iced Teas with a white bitch\nThat was just as bad as Ice-T's, but she's not the wifey\nThe wife be at home with the kids\nLook at them and see how a motherfucker live\n24 cars, 5 and a half cribs, I was spendin' money like goin' broke was the shit\nShit"}]}