{"artist": "A$AP Ferg", "songs": [{"title": "Psycho", "image": "https://images.genius.com/58b9521071cb4f1250d2cf9bf0e82e3b.1000x1000x1.jpg", "album": "Always Strive and Prosper", "lyrics": "[Intro: A$AP Ferg]\nUhh, yeah\nUhh, yeah\nUhh, it was all at the park, yeah\nCologne and liquor was his odor (Uhh, yeah)\nThe fragrance of a riding soldier (Uhh)\nODB was his persona\n(I've seen a lot of bullshit, go down at the park)\nOh, you want the power, don't ya?\n\n[Chorus: A$AP Ferg]\nI got an uncle and his name Psycho\nHe had a dance and they scream \"Go, Psycho!\"\nHe would dance, work out and fight yo' ass at the park\n(For the bills, for the hundred dollar bills)\nAnd he got two sisters preggo\nHe fucked the other one to get one jeal-o\nAnd he took both kids to the ghetto ass park\n(On the hill, shit'll get really real)\n\n[Verse 1: A$AP Ferg]\nHe used to have the braids with the cuts in his body\nMost thugged out, kept the hammer with his mami\nGrandma had the arthritis pain in her body\nKept the burner in the mattress, so her son don’t catch a body\nDanced and he danced, smoked crack with his posse\nFront flipped through a building window, land in the lobby\nHe was cut like Bruce Lee but he didn't know karate\nHe came home bloody screaming, \"Nobody can stop me!\nNobody can stop me, I'm the baddest survivor on this planet\nFifty niggas better kill me, nigga, 'cause I will do damage\nChecked outta the psych ward, I am nothing to manage\nMy life cut deep, nigga I'm nothing to bandage\"\n\n[Chorus: A$AP Ferg]\nI got an uncle and his name Psycho\nHe had a dance and they scream \"Go, Psycho!\"\nHe would dance, work out and fight yo' ass at the park\n(For the bills, for the hundred dollar bills)\nAnd he got two sisters preggo\nHe fucked the other one to get one jell-o\nAnd he took both kids to the ghetto ass park\n(On the hill, shit'll get really real)\n\n[Bridge: A$AP Ferg]\nWhere they be drinking forty ounces\nWith the brown paper bags for the ounces\nNo matter what day you found his ass at the park\nHungry Ham, fuck around and get killed\nWhen he got kicked out of his bitch crib\nAnd he had nowhere to li-zive\nAlways find his ass on the benches laying at the park\nAfter dark\n\n[Verse 2: A$AP Ferg]\nDon't get it confused Uncle Psych, I love you to death\nJust wanna get a couple of things off of my chest\nGrowing up, you always was buck-wilding with stress\nAnd though I'm older now, I don't know how to forget\nI used to wear your Timbs around the house when you left\nAnd if you had an open soda, I would finish the rest\nPretend I'm older, I like the liquor odor you left\nThen put your camouflage vest on like I'm holding a tec\nThen point it at the mirror like I'm holding your rep\nThrough that mirror wasn't me, but it was you I reflect\nWanted to be like you, jail tat on the chest\nWith the rugged cornrows and a stab on my neck\n\n[Outro: Uncle Psycho]\nI'll rob shit like that you know\nCause I'll rob anybody, I, I don't care\nIt was a 9 to 5 for me, you know\nIt was like a hobby to me, I was the gunman\nI was the dancer, entertainer, you know what I mean? I did it all\nLike I said I had a death wish, I'll rob anybody\nAy, hold up motherfucker, you see I'm talking, right?!", "year": "2016-04-22"}]}