{"songs": [{"album": "The Power of a Woman", "image": "https://images.genius.com/17e4b3762f8018fd779a43b805912aee.399x400x1.jpg", "year": null, "title": "Player", "lyrics": "[Intro: Dialogue]\nThe D.O.C- Hey yo Dre (Yeah, what's happening?)\nHave you ever met this female by the name of ah Tairrie B?\n\nDr. Dre- Yeah, yeah, I met her\n\nThe D.O.C- Peep this out, I seen her at a club last night, right? (Word) Smooth approach the female, right?\nWith the line from the D to the O to the C's mind. Tell her anything that comes from Doc is like ever lasting\n(Is that right?) But she still flaked on me\n\nDr.Dre- Yeah I posed the same girl. Man, she was like big ego tripping on to something, you know what I'm saying?\n\nEazy-E-Yeah I was stepped up to her. Man, she acted like she didn't know who I was\n(Now, ain't that a bitch.)\n\n[Verse 1: Tairrie B]\nWell, here's a low down\nComing at you Comptown, style\nRuthless and wild\nThat's shows and everywhere I go\nSo yo, for those who don't know\nWhat I mean when I call a man a player\nThat's what we call them here from LA\nAnd I'm not the type of girl to play no game\nI just call them like I see them by the real name\nSoop sucker, some male MCs\nIn full effect, I'm pulling all of these\nBut when I'm on the mic, you know I do things right\nI'm in house homeboys, so it's ladies night\nBoys come up to me and always acting in the hood\nTrying to play it off and always lose their cool\nThey drop to their knees, start to skis\nSaying please baby, please baby (baby, baby, please)\nBoys, don't beg (don't beg)\nI walk away, still not hanging on to my leg\nI tell him have a little pride, you looking a mess\nWhy would people catch a nothing, [?] so let's do this\nYou wonder why you weren't kisses\nBusted homeboy you've disk, cause you're a player\n\n[Hook]\nI'm a player. I'm a, I'm a player. I'm a, I'm a player\n(You're a player.)\nI'm a player. I'm a, I'm a player. I'm a, I'm a player\n\n(All my boys ah, you can go. I'll call you when I need you.)\n\n[Verse 2]\nWord to the brother and the mother too\nCause you say you want to take me out wining and dining\nI know what's on your mind and it's grinding\nI'm no toy, get your hands off my body, boy\nIt's not that type of party, you place or mine, is a played out lie\nTo quote this rhythm, you ain't that fine\nSo don't try to make a move when I sit on the couch\nI'll hit you where it hurts, so you will say ouch\nI'll kick you where it counts,if you try to pounce on me\nSo let me say as I pronounce the word player (sucka)\nIt's means fake or Casanova\nAnd I hope you know you ain't ever getting over\nTake your mean, pink, Caddy a purr\nWhat made you think I'm one of those girls\nWith a sugar daddy, honey I'm Tairrie B\nI make my money on the mic, it's simple to see\nThat all you ever think about is girls in the sack\nThe only thing you're going to get from me (tell'em to them T) is a smack\nI said damn today, my beeper keeps on buzzing\nMen are calling every hour, on the hour, by the dozen\nSo a piece of advice, that were [?]\nDon't try to talk to me when I'm rapping\nI'm busy, can't you see that I'm working\nKeep it up and I'll send you home chirping\nCause I take apart men, like I took a part Ken\nAnd barbie dolls back when I was ten\nThen it was kissed up, now I play real\nIt's like I'm talking to a boy\nYo I'm built, the clock keeps ticking, to tell you my time\nTwenty-four/seven, I'm kicking your rhythm\nMy nails are done, marcasite don't run\nI'm a ruthless bitch, but I ain't the one\nTo be played, just paid, a platinum fade\nIt's my trademark, my body's so hard\nIs what I use to abuse the groove, I choose\nSo tell me who's gonna flex\nI'm stepping and the weapon is sex\nKill that noise, I'll be next, if your a player\n\n[Hook]\nI'm a player. I'm a, I'm a player. I'm a, I'm a player\n(You're a player.)\nI'm a player. I'm a, I'm a player. I'm a, I'm a player\n\n[Verse 3]\nWell it's the end of the rhythm\nSo it's time to remind the men\nWell a lover or a friend\nNever dominant force\nA prominent source\nAnd as such\nWith a feminist touch\nToo much on the real tip\nA couple to eat with and take out men who trip\nCause it ain't about a man, a bank account, or a car\nIf you're live, I'll drive and will go far\nBut if you're not, you'll be caught in fat cold busted\nDriving maybe shot and taught what lusted\nI'm no stunt, keep the front from your posse\nI don't want,  [?] ten glossy\nSee I came, not to jest my name\nTo step to all you suckers, cause you all act the same\nI see you look my way, say you got played\nWhen you never got a date, not to mention a lay\nI've been stone cold swinging, bringing the verse\nAnd when the rhyming done, (bitch just did what)\nSo if I don't look like a real rapper to you, I use slang\nStep to this, cause I don't want to get the hang\nI'm Tairrie B, here's a subject at hand, I ain't a rapper\nAnd you ain't man, you're a player\n\n[Hook]\nI'm a player. I'm a, I'm a player. I'm a, I'm a player\n(You're a player.)\nI'm a player. I'm a, I'm a player. I'm a, I'm a player\n\n[Outro: Dialogue]\nThe D.O.C - Hey yo, man. Can you believe what she just said, you know what I'm saying? How can she...\n\nDr. Dre- Word, talking all that nonsense\n\nThe D.O.C- How can she call the T to the O to the C a player, man? Do I look like a player to you?\n\nEazy-E- Hell, no! You don't look like a god...\n\nTairrie B- Oh, and I suppose you're the one to talk, right baby?\nYo, I'm coming out of Comptown and I don't play that shit\nStraight up. (yeah)"}], "artist": "Tairrie B"}