{"songs": [{"title": "All Night", "album": "Finally Famous: The Mixtape", "year": "2007-11-24", "image": "https://images.genius.com/e4311df795cf4c9077ccbb609da0c55a.500x500x1.jpg", "lyrics": "[Intro: Big Sean]\nAll night, yeah\n\n[Verse 1: Mr Bentley]\nBatter up, forget the sign, here come the wind\nHe swing away, I knuckle up\nBeen in the clutch, he drive a stick\nNo not bat, you missed that, I'm not in fifth gear, switch\nSix Bent, chopped and screwed\nI ain't talking 'bout the beat, I'm talking 'bout my suit\nKeep four hand not like bi-fon-du\nWhen I move they telling me they loving my colours\nAll that talking 'bout the clothes, I'm talking about the under\nHuh, ground sonic kings I rap while pimped with a wease\nMy audemar maid bring me green tea\nTell foreign election girls, I massage her feet\nAnd she love me long time, my woman stay on her knees\nUse the head for prayer only, Bible to say thank you\nAnd now you know for sure that I'm not like you\nI'm not shallow, watch out, I just signed a tape\nYou can't catch a fish unless you got the right bait\nAnd though I have a stable with the best milkshakes\nThe booty pass, formaldehyde\nAbstinent like ebony in fashion league, why? We different\nYou complain that there's not enough metaphors\nI complain that there's not enough candy for us\nWe got different tastes, you get hot when you're not getting enough green\nUh, some more collard greens? I got enough pepper sauce\nYou hear things and let 'em go over your head\nI write 'em down and Google 'em before I go to bed\n'Nough said, pays the parallel park, rim brand, let the driver take a day, Big Sean got the big Benz instead\nYeah, and if you got all that, the result tab, points are factual, red\n\n[Hook: Big Sean]\nIt's on, roll up, post up\nHere come the pig seats and pose up\nAnd tell 'em that we going all night\nCause we know what you like\nBentley know what you like\nBig Sean know what you like\n88 know what you like\nSo tell 'em that we going all night, alright?\n\n[Verse 2: Big Sean]\nI miss Cherie Amore I see\nWon't you come be my Cherie Amore for me?\nOui oui, baby I can make it better for we\nShe got that baby phat fat, not Kimora Lee\nI used to be underground like the pipeline\nNow I'm everywhere like Wi-Fi\nSo long on to a Don Corleone\nWho was known to be known off performing his songs\nAnd that's honest, I'm from a place that's so unprotected\nNeed more than a condom\nBut now a nigga label mates with Common\nSo how them haters feel? Shit, no comment\nYou like Kanye? He cool with Hov\nOh, you don't like Hov? Well I know you like Beyoncé\nAin't looking for a wife but, maybe a fiancé\nThe man on my team from the D like Chauncey\nBillups babe, mhm, and we could leave\nI'm tryna beat like 88 keys\nHigh living like we smoke 88 trees\nHot shit baby, I might radiate heat\nExcuse me if I don't come all cordial\nI don't mean to put you through this whole ordeal\nBaby I'm more real\nComing from a city where the niggas keep it popping like Orville\n\n[Hook: Big Sean]\nIt's on, roll up, post up\nHere come the pig seats and pose up\nAnd tell 'em that we going all night\nCause we know what you like\nBentley know what you like\nBig Sean know what you like\n88 know what you like\nSo tell 'em that we going all night, alright?"}], "artist": "Big Sean"}