{"artist": "Rich Homie Quan", "songs": [{"lyrics": "[Produced by Goose]\n\n[Intro]\nHey man, you lil slick bitch. Oh, I know what's happenin', one thing about it, I saw you lil slick bitch. Ey man, where that money at?\n\n[Verse 1]\nHad to throw up inside that bitch when money money came up short\nDiamond (?) ring on my forehead, what the fuck take me for?\nMason Mar, money, what I do is take that bitch to (?)\nI mean (?) island\nThese niggas racial profilin'\nCause I got white and black diamonds\nAnd the Rollex my nigga, no (?)\nNew charges, stay tryin' to indict me\nBut I'm too player for that\nPlus I got a lawyer, pay it off my nigga\nYou tell me how player is that\n(?) me but I got a lot of hoes\nI'll teach a nigga how to play a bitch\nAnd I'm smokin' on somethin' everyday\nLike Popeye the sailor did\nCan't remember the last time I paid for a meal\nBut you know them bitches cater me\nGot the bitches in the kitchen cookin' dope\nWhip it up like slavery\nI ain't came to talk, came to fuck, what you think?\nWe gone lay in the bed\nShe from New York, fucked her good\nThen she asked me for a Jadakiss\nBaby girl suck this dick, make me feel it in your nose\nWe gone call you nasal necks\n(?) superman ass nigga, askin'\nWhy you savin' bitches?\nCrunk bitch pay attention\n\n[Hook]\nTo my moves\nMy every step, you don't know what I do\nYou don't know I keep paper on me like I'm in school\nThat's why my money be straight lunch too\n\n[Verse 2]\nYou can't beat us\nKey my people\nWe doin' shit your way\nYou call me Carlito\n(?) avenue\nTrisha, ya'll nigga never knew\nHeard they wanna kill me\nSo I piped up security and the car ridin' me nigga, bulletproof\nWho is you?\nWhen the tint on you can't see\nRoll down the window with the sticks out\nYou niggas like (?) shoe, most of ya'll flip flop\nYou clip clop\nYa'll niggas, ya'll a disgrace to music\nYa'll niggas ain't hip hop, we are\nThat's what we are, you get it?\nMoney up and down like a see-saw\n(?) standin' on a pivot\nSo much money in the attic young nigga filled up the whole ceilin'\nSo when it get hot nigga AC nah nigga I don't even feel it\nCause there's too much money in the ceilin'\nGet it? Too much money in the ceilin', nigga\n\n[Outro]\nToo much money in the ceilin', too much money in the ceilin'\nToo much money in the ceilin', too much money in the ceilin'\nPlus I got some more in the basement, more, more, more\nPlus I got some more in the basement, more, more, more", "title": "Carlito", "year": null, "image": "https://images.rapgenius.com/9aaa89a902d1d295411e0d36e70f6dd3.950x950x1.jpg", "album": null}]}