{"songs": [{"title": "Burn", "album": null, "year": null, "image": "https://images.genius.com/1db10915bf07ae763610bb53d1717887.1000x1000x1.jpg", "lyrics": "God (Yea)\nOh God, Boi, (Yea)\nG.O.O.D. (MMG, Nigga)\n\nChain all V.S. I ain't with the B.S\nCatch me in your city riding hard through the B.X\nSkinny nigga but I do it Large like a 3X\nThe last nigga tried to do me wrong umm he checked\nRight back to that money slinging O's in the P.Jects\nOr prolly catchin mileage while the pilot steer the P-Jet\nCause we next and we flex like\n\n90PX, working all night no breaks or a recess\nVroom vroom yeah I know my car sound like a T-Rex\nBitch, I'm 23 years old and I ain't riding in a Prius\nMy cousin finished school can't believe he graduated\nThrew him 20,000 dollars told his ass congratulations\nCause me, I wasn't made for that shit\nBut I could probably hire him and who all paid for his shit\nAnd to all the hoes that was dissin' I pray to God that you see me\nI'm on a yacht getting hella' high smoking good that seaweed\nBad bitch in her cha-cha grabbing on her chi-chi's\nMillion dollar deals on my email you mad as hell you ain't CC'ed\nChain all V.S. bitch you knows it's B.S. boy I run my city\n\nEnd of story, nigga P.S\nAll white Maybach Greenbay they packed\nY'all niggas was slackin' 'member the hard nights we trappin'\nAnd they say lifes a game of chess you can play checkers all on my jacket\nCause it's Damier and we bombs away on y'all big rappers\nI say yeah nigga I murder that Panamera inserted back\nNiggas say they want beef well where the fuck is my burger at?\nI got white was serving that I been to jail I ain't going back\nI alley oop your bitch off that backboard she throw it back\nI slam dunk in that pussy, Blake Griffin'd yo ho, nigga\nMaybach with Ricky Ross my chain rock like I know Jigga\nThats cause I do ho, shout out to my new ho\nThat pussy pink like Nuvo and I dog that Cujo\n\n[Chorus]\nNiggas wanna talk what they gon' say (gon' say)\nI hit the pedal til that motherfucker break (til it break)\nFreaky bitches love the money I make\nAnd to live like this you motherfuckers gotta pay\nSo let that shit burn\nLet that shit burn I'mma let that shit burn let that shit burn (burn, gasoline)\nThe roof on fire I'm only gettin' higher\n50 racks all in my pocket I want bottles I'mma let that shit burn\n\nBitch I had one shot and I ain't blow it\nRiding til the wheels fall off and they tow it\nI got green on top of green damn its looking like I grow it\nD-Town the hood behind me like a king cobra\n\nBurn bitch I let it burn bitch\nMy money straighter than a motherfucking perm bitch\nNo navigation you can see it is my turn chyea (swerv, swerv)\nShorty give me all that brain still ain't never learned shit\n\nOh that's your girl? Damn nigga you ain't learn shit\nShe naked in my studio I'm on that Howard Stern shit\nI swear that mac 10 is my barbell, Finally Famous the cartel\nHit your girl in my whip and now that pussy got the new car smell\nSame shit different day I ain't broke no more it's a different day\nDon't turn me down I got shit to say my purp strong like it's lifting weights\nIt's Sean Don sippin' Chandon I got a bad bitch with them pom pom's\nMy Rollie don't tick-tock your shit sound like a time bomb, boom, lil' bitch\n\n[Chorus]"}], "artist": "Big Sean"}