{"songs": [{"image": "https://images.genius.com/fce1e2b08952b1596484d7ea9ce00db2.1000x1000x1.jpg", "year": null, "title": "Concrete", "album": null, "lyrics": "[Shabaam Sahdeeq]\nUh-huh, yeah, yeah, yeah...\nAs the world turn, cash to earn, falonious burn\nWe Takin Ova, its our turn, where the moss burnin?\nClear the path, we get more ass than saddle seats\nSteal this wall like the Alamo, standoff cowboy style\nI draw first, y'all sweet like Starburst\nBit more than you can chew, handle it, street's scandalous\nDynasty met, no need to pretend, mix liquor, top shelf nigga\nWith the marvelous blend\nOh you think you the chief now? You know how we get down\nYou claim to spit rounds but are you hittin shit clown?\nYour aim is all off, I make your crew hit ground\nJump in your six nigga, its time to skirt off now\nYou in the wrong part of town trying to lay law down\nPlay hard now? My niggas gonna shut it all down\nYou cheap like First Down got beef like ground round\nWe move the crowd like a pound of the sweetest indo in town\nSahdeeq and X to the Z, y'all Dead in the Sea\nWe make ya face crack, like them Reebok runnin cats\nNiggas be like yo run it back, bitches be like yo that's phat!\nPut it down with my fam from across the map\n\nChorus: Shabaam Sahdeeq *2X*\nRhyme for rhyme believe me we raw with it\nCash gotta get it, bag a girl when we spit it\nOur team win it, drop gems for peops listenin\nPut your ears to the concrete, feel the buzz on the street\n\n[Xzibit]\nYo, yo, this is dedicated to the niggas that be hatin me\nBut never can face me, because they scared for their own safety\nReplace me? Mr. X to the Z\nIt's B.Y.O.B. cause all the pussy is free (pussy's free)\nAnd everything else is me and my niggas spreadin the wealth\nCross me I'll introduce you to the devil himself\nSee I'm the motherfuckin man layin over Japan\nComputer hack through your laptop\nThen leave your whole SoundScanned (what the fuck?!?)\nAnd watch you panick like the bitch you are\nI'm the mechanic with a pipe bomb that fits your car\nKa-boom, now I assume your homies wanna retalliate\nSet em straight with a thirty-eight, the wrong cat to violate\nSo watch Xzibit and Shabaam start to dilate\nAnihilate competition, some niggas got hard heads\nAnd just don't listen, they the ones you find missin\nBetter get on the right team and play your position\nSee I'm lost, scandalous, finest\nBlew your back out because your spineless\nI'm never makin music for the mindless\nCause I'm hard to the core, and I'll never go soft\nJust consider us the hitmen thats knockin you off\n\nChorus *1X*\n\n[Xzibit]\nYeah, yeah, See I'm ready to raise a ruckus\nTry to elevate you motherfuckers to the places where the law can't touch us\nWalk off on your own or with the aid of crutches\nAnyway you want it to happen I'm ready for action\nYou get shot up under my soles, call it Fatal Attraction\nBeat you niggas till you get it right, like Joe Jackson\nListen, we here to give the hardcore what they lookin for\nAt the same time pimp the game like a fucking whore\n\n[Shabaam Sahdeeq]\nIn this game here, we got swift handles\nDismantle your chalkboard strategy, check the replay\nHere you gets no shine we dimmin your light\nMake your heart pump *echoes* when my squad's in sight\nShorty got assets and a man that ask bets\nLost it all fuckin round with the dice, you ain't nice\nYou a sacrifice, guinea pig, you dig?\nRoast you, get a jokey smurf through the postal\n\nChorus *2X*"}], "artist": "Xzibit"}