{"artist": "B-Real", "songs": [{"album": "Bulworth: The Soundtrack ", "title": "Lunatics in the Grass", "lyrics": "Intro\n\nStraight from the Psycho Ward\nOnce again\n\nVerse One: B-Real\n\nPsycho from the ward, a warning, a fucking scandal\nLookin' around, paranoid devoid the funk banner\nIn the combat, the banana leaf control\nA sea, bring a pound of weed and get sold\nYou going crazy, can't understand\nWhy you never face me? Don't foil the plan!\nHead-to-head combat, I'm on that mission\nYou wishin' to disappear? Some mission is closin' near!\nSick-o!\nStrumming through the hall, yes y'all!\nHear the call to the D.A., fucking D-E-A\nThey all wanna raid my spot and take hits\nBut I'm breakin' that L.A. Law like Jimmy Sprits\nInsane, crazy in the head it's lead!\nI'm loco, 'til I'm dead, enough said!\nActions allowing the words to barrage in\nFrom having all the way down, to the depths of Hell\nYou hear me? Lunatic in the grass, lost\nYou a psycho, like my nigga Jack Frost?\n\nChorus\n\nLooney, lunatic turned sick\nPsycho, crazy in the head, I go\nCan't keep my head straight from the laws I break\nYou too, y'all twistin' up my mind state!\n\nVerse Two: Jacken\n\nFor those who really don't understand\nWhy we, going insane, just acting crazy!\nBuggin' now from, all the things I see\nAll tread bad and I meant in 3D\nWe be the psycho doers, turned killers\nOnly to survive all these street cop killers\nI'll tell ya now, nobody's everlasting\nEven if you try, but you laugh it won't be subtracting\nIt ain't no thing but mad\nYou better give it up, you steppin' to a psychopath\nGame over, I'm intoxicated, never sober\nWhen one steps up, I'm poisonous like a deadly cobra!\nThe only reason why I say this\nIs because y'all breakin' this (?) got me tripping\nOne can only maintain, for so long\n'Til all the screws in your head are loose and worn\nNow you're the (?) straight psycho remain nameless\nOnly known from crazy acts, making you famous\n\nVerse Three: B-Real\n\nI'm the locust pocus, tell me how you feel\nWhen I smoke that motherfucker coming for the kill!\nIf the criminal element, unfolding\nBut the reckoning, brings settling with the metal shit\nBreaking out the .45 sick, to get live\nIf you arrive, don't get nervous! You wanna surface\nSick, insane in the brain, I'm trippin'!\nI'm sippin' on the wine, it's all in the mind, flippin'\nWe dippin' now, you make me wanna shout\nTalk about, my mental state\nThink I need to rehabilitate\nWipe the slate, look inside your fate, can't wait\nBut don't you motherfuckers can't come in the gate!\nGet your ass on, you pass on, we blast on\nThe gats armed, shitted on the last one, c'mon!\nPsycho assassins smashing your membrane\nLunatics in the grass, feeding it to your vein!\n\nChorus X2", "image": "https://images.genius.com/cd196cd64024f62198546045ae85968d.640x640x1.jpg", "year": null}]}