{"artist": "AZ", "songs": [{"title": "Fire", "image": "https://images.genius.com/d13f06c0e66f01d56532a90d5f7d2283.300x300x1.jpg", "album": "Undeniable", "lyrics": "[Chorus: Dennis Edwards sample (AZ)]\nCan you tell me how much fire\n(Yeah, how much it gon' take, man)\nWill it take to get us higher?\n(How much I gotta spit to)\nStand up and fight, do it tonight\n(Make y'all understand that I am number one, daddy)\nWhat can you lose?\n\n[Verse 1]\nEgo-trippin', Clicquot sippin'\nBarely survived the RICO, I need no friction\nNearly died in that sleep hold, the heat so sickenin'\nIt's deep though but now I peep why the weak be snitchin'\nThey lonely, this here is for the big boys only\nThat never, count on they kins or depend on homies\nY'all know me worldwide, I'm a swirl inside\nA mix of Afro-American and Dominican pride, that's right\nReal for real, I'm still that deal\nStill, king of the hill, nigga, chilly chill\nStill, hot wheels, chicks in high heels\nFlicks and fly shit, I simply got skills\nThey callin, every hustler from the streets that's ballin'\nEvery freak that seek consolin', I'm here, yeah\nThere when they unaware, I appear\nLike the spook ya moms speak to in prayer\nNo tattered tears, it's tough love\nAn addict for wears, designer only\nI see through the kind that's phony, mama told me\n\n[Chorus: Dennis Edwards sample (AZ)]\nCan you tell me how much fire\n(Nigga, certified)\nWill it take to get us higher?\n(How much we need?)\nStand up and fight, do it tonight\n(I'm the truth, I ain't goin' nowhere, I told y'all crabs)\nWhat can you lose?\n\n[Verse 2]\nAhh, voices callin'\nOf course I'm all in, everything I own\nThey done cloned my zone, copied my whole tone to the microphone\nTo the way I take shots, I don't price Patrón\nI don't use no lime, I abuse no time\nLike a crossword puzzle, I confuse the mind\nIt's a all day hustle I choose to grind\nOn the move, only food I refuse is swine\nWater sign, so my soul just circle the globe\nBlue strobes on the Rove', I'ma surface in mode\nA stand-up dude, understand the rules\nUsed to think with a few hundred grand I'm smooth\nBut cool (but cool), I don't get upset\n'07, see me step it up on BDS\nAlready independent, I don't need the stress\nThere's no contentions putting CDs in CBS\nIt's the vengeance that allow focus to finish the job\nSo ferocious with this wine, I'ma toast to the God\n\n[Chorus: Dennis Edwards sample]\nCan you tell me how much fire\n(*wine pouring*)\nWill it take to get us higher?\nStand up and fight, do it tonight\nWhat can you lose?\n\n[Verse 3]\nIt's understandable, mechanical rights\nI'm an animal puffin' on botanical white\nCash cannibal, cake's in tangible sight\nSo everything's a goal, got that heavenly flow and uh\nLife is good just like it should\nLittle shaky but shit it's alright I'm hood\nLittle crazy but maybe that's because I could\nCame from the roots, got the stains on my boots\nLast of the livest, remains of the fruit\nTrained for my juice, rearranged, regrouped\nBeat up, rewind, refined, recouped\nDesign, I'm blind, I'm so the truth\n\n[Chorus: Dennis Edwards sample]\nCan you tell me how much fire\nWill it take to get us higher?\nStand up and fight, do it tonight\nWhat can you lose?", "year": null}]}