{"songs": [{"year": "2007-11-16", "image": "https://images.genius.com/1f9f4191522a2735ac0273b4bc4c6d19.1000x1000x1.jpg", "title": "Der Einzelkämpfer", "album": "Alphagene", "lyrics": "[Hook]\nUnd auch in den härtesten Zeiten kennt er keine Verzweiflung\nDenn er ist der Einzelkämpfer\nGibt bei Stress niemals auf, ballt fest seine Faust\nSein Schicksal ist vorbestimmt und er macht das Beste daraus\nUnd auch in den härtesten Zeiten, kennt er keine Verzweiflung\nDenn er ist der Einzelkämpfer!\nUnd er weiß nicht, was kommt und was das Leben ihm noch bringt\nDoch er weiß, er kämpft bis Gott seine Seele zu sich nimmt\n\n[Part 1]\nUnd er denkt: „Ey, verdammt ist dieses Leben 'ne Bitch!“\nWeil er im Elend sitzt und scheinbar jeder gegen ihn ist\nDoch er bleibt stehen und ist der, der die Faust ballt wie Fighter\nUnd auch falls nicht einer an ihn glaubt, macht er weiter\nAuch, wenn tausend Neider ihn klein kriegen wollen\nIhm sein Erfolg nicht gönnen, ihn bloß scheitern sehen wollen\nEr verteidigt sein Stolz mit aller Kraft bis zum Ende\nKeiner schaffts ihn zu bremsen, weil er gemacht ist zum Kämpfen\nUnd im Zweifelsfall allein gegen alle\nDer Weg ist steinig, doch kein Stein bringt ihn so einfach zum Fallen\nEs kommen Zeiten, wo mal das Geld nicht reicht\nDoch er verfällt nicht gleich in Selbstmitleid\nNein, denn es geht im Leben hoch und down\nUnd er steht vom Boden auf mit stets erhobenem Haupt\nGibt nie auf, denn Gott hilft dem wieder nach oben\nDer auch bei stärkstem Regen auf den Regenbogen vertraut!\n\n[Hook]\nUnd auch in den härtesten Zeiten kennt er keine Verzweiflung\nDenn er ist der Einzelkämpfer\nGibt bei Stress niemals auf, ballt fest seine Faust\nSein Schicksal ist vorbestimmt und er macht das Beste daraus\nUnd auch in den härtesten Zeiten, kennt er keine Verzweiflung\nDenn er ist der Einzelkämpfer!\nUnd er weiß nicht, was kommt und was das Leben ihm noch bringt\nDoch er weiß, er kämpft bis Gott seine Seele zu sich nimmt\n\n[Part 2]\nEs ist ermüdend, wenn bei Auftritten in Großstädten und Käffern\nHater kommen, die denken, „lass uns den mal totstechen mit Messern, diesen hochnäsigen Rapper“\nUnd so erinnert die Narbe ihn immer daran, dass er sein Auge mal fast verloren hätte\nUnd deshalb denkt er manchmal, „ey ich hör' einfach auf mit Rap\nDieser Neid und die Morddrohung, wozu brauch ich diesen Stress?\nMan kann eh kaum verdienen mit Rap\nIch geb dem Volk nur eben diesen Klassiker mit auf den Weg\nUnd dann bin ich auch schon wieder weg“\nAber dann besinnt er sich darauf, er ist der Mac\nKuckt in den Spiegel und schreit laut, „Jetzt erst Recht!“\nGeht raus schreit, „Wer will Stress?“\nDenn er gab noch nie auf, noch nicht mal damals, als es nur Schlägerein jeden Tag gab zu Haus und er verklagt wurde auf\nRiesige Geldsummen, wegen gefälschter Markenkleidung\nUnd 20 Mille verlor, nach 'nem Einbruch\nBei ihm daheim und er pleite war, aber weiter kämpfte\nNein! Nichts kriegt den Einzelkämpfer klein!\n\n[Hook]\nUnd auch in den härtesten Zeiten kennt er keine Verzweiflung\nDenn er ist der Einzelkämpfer\nGibt bei Stress niemals auf, ballt fest seine Faust\nSein Schicksal ist vorbestimmt und er macht das Beste daraus\nUnd auch in den härtesten Zeiten, kennt er keine Verzweiflung\nDenn er ist der Einzelkämpfer!\nUnd er weiß nicht, was kommt und was das Leben ihm noch bringt\nDoch er weiß, er kämpft bis Gott seine Seele zu sich nimmt"}], "artist": "Kollegah"}