{"songs": [{"title": "Gravity", "album": "Gravity", "year": "2012-09-04", "image": "https://images.genius.com/7d7edd1a68aefd9a3a73f1242a8ffa5b.1000x1000x1.jpg", "lyrics": "[Intro: Lecrae]\nIt’s Gravity\nKeeps pullin’ me down\nPullin' me down...\n\n[Verse 1: Lecrae]\nI pen songs for the perishin’ and parishioners\nThem hearers and them listeners, the home and the visitors\nThis is not a game, you can't tame or make it purty\nThey say the earth cursed, so our mouths stay dirty\nThere’s mud on the track, a slug in ya’ back\nPolice done pulled you over wit’ a gun in ya’ lap\nAnd you ain't got the power to make it through this parade\nThe workers can't keep the profit - everything here is vain\nMy job is oppressive, I strive for my blessings\nThe pastor so corrupt it's hard to ride with his message\nRiches destroy the owners, the government think they own us\nMy onus is to keep the police from ridin’ all up on us\nLeavin’ money to kids who spend it on getting’ blitz\nSay, what's the point of livin’ to give it up in the end\nThen again, all my sin has been pinned to the cross\nI know I'm free forever from this land of the lost\n\n[Hook: J.R.]\nYeah, every time I think I’m flying\nI’m just falling\nSo close to touching the sky\nBut gravity keeps pulling me back down\nBut I can’t stay here forever\nI want to go, ooh one day!\nI want to go\nSomewhere where there’s no gravity\nWhere there’s no gravity\n\n[Verse 2: Lecrae]\nSomebody told me there was no such thing as truth\nI said, “If that's the case then why should I believe you?”\nMurder, money, and mayhem, every place that I lay in\nMy problems follow suit, I'm tailor-made for this, ain't I?\nIt’s deep. You wanna go deep? I’ll take you deep\nReality is really just cheap\nYo’ eyes wide open apparently, but you sleep\nAnd everything you have in your hands you’ll never keep\nSo why hold on, I flow on to go on, before long I float on\nEternal life is what I'm thinkin’ I'mma bank my hope on\nBelieve me, easy is irrelevant\nThe devil want us burning for the hell of it\nElephants in the room say we can't talk about impending doom\nOr we gospel rappin’ or preaching people out of they shoes\nIt’s cool, I'll be that dude\nWe glued to our depravity\nUntil somebody free us from this gravity, fly!\nI want to go, one day\nI want to go, somewhere where there's no gravity\nWhere there's no gravity\n\n[Hook: J.R.]\nYeah, every time I think I’m flying\nI’m just falling\nSo close to touching the sky\nBut gravity keeps pulling me back down\nBut I can’t stay here forever"}], "artist": "Lecrae"}