{"songs": [{"image": "https://s3.amazonaws.com/rapgenius/necro.jpg", "title": "Morbid Shit", "album": null, "year": null, "lyrics": "Whatup you fuckin dirty bitches? Hookers, fuckin scumbags. You know I hate you\nCheck this shit\n\n(Necro)\nYo morbid shit that's the type of rap I kick\nLike gettin your head cracked with a brick like some bitch cuttin off your dick\nLike gettin all of your jewelry vicked\nLike a Pit Bull leavin your flesh ripped morbid shit\n\nI'm as morbid as it gets\nAnd if there's anybody more morbid then me he's probably dead\nYOu ask me why must I have to be so enthralled in bloody brawls\nGlory catastrophe and blasphemy\nThere's nothing I can do kid I pledge allegiance\nTo rappin hardcore 12 now my rhymes are infecting regions\nAll across the earth my verbal beatings are stabbing cretins\nLeaving your cerebrum bleeding stop breathing\nYour shit's soft quit rappin start clappin\nSlugs iny our skull when you're dead you'll drop your best album\nI got a fetish for shit that makes you vomit\nIt's economics 1 million cats buyin my shit\nMad evil people in the world seekin lethal\nButcher knife rap illegal rap from a sadistic cat with D skills\nDroppin gothic put the Glock clip inside the shit and pop it\nFor every cat thats locked kid\n\nYo morbid shit that's the type of rap I kick\nLike gettin your head cracked with a brick like some bitch cuttin off your dick\nLike gettin all of your jewelry vicked\nLike a Pit Bull leavin your flesh ripped morbid shit\n\nI outshine you by bein myself and I'm about to grind you\nInto pieces and start pleadin for help Jesus\nLookin for death it could be found behind you\nITs easy to help leavin ya held around your spine legions are felt\nAbout time you bleed for your wealth my persisting gore\nLeave you insecure for instance my raps please a whore Turning hip hop into all\nKeep your distance there's no more prep when bullets collide into your jaw\nThen you fall right to the floor\nI display charming grace beautiful garments laced\nJust to cater exotic taste\nAll a cover up for my verbal vomit in disgrace\nSAdistic verbatim demonic waste imbolical blades\n\nYo morbid shit that's the type of rap I kick\nLike gettin your head cracked with a brick like some bitch cuttin off your dick\nLike gettin all of your jewelry vicked\nLike a Pit Bull leavin your flesh ripped morbid shit\n\nPsycho+Logical fuckin bitces. Rapin your brain. Necro. Master of machal"}], "artist": "Necro"}