{"songs": [{"image": "https://images.genius.com/0e4edb30c1b17912ebe50117a2dead5a.640x640x1.jpg", "album": null, "title": "All We Know", "lyrics": "[Intro]\nI’m with the guys, I’m with the guys\nI’m with the guys, I’m with the guys\n\n[Chorus]\nI’m with the guys, I’m with the guys\nShout out to bros, let’s get that dough (let’s get it), that’s all we know\nShe got that loud, she movin’ wild, she love the vibe\nIf that’s your girl (if that’s your), then that’s your L (then that’s your), I wish you well\n\n[Verse 1]\nLong live the king (king), where have you been?\nWha? Me? Where ya been?\nAll around the world cause they pay me to sing\nNow I’m skrrtin’ 'round town in the waviest ting\n‘Member when I couldn’t cop nuttin' expensive?\nAnd did shows just to cover the expenses?\nNow I embrace these seats cah they looking all\nPearly white like they were made by a dentist, ha\nYou know the drill (oou), I been tourin’ since I made Trill (hey)\nI might have the biggest smile on my face but you’ll never know how I feel, ha\nSome of us learn it the hard way, had to search for the light in a dark place, ha\nAll these bitches come and go that’s why I roll with the... (skr, skr)\n\n[Chorus]\nRoll with the guys (roll with the guys), I’m with the guys\nShout out to bros, let’s get that dough, that’s all we know\nShe got that loud, she movin’ wild, she love the vibe\nIf that’s your girl, then that’s your L, I wish you well\n\n[Verse 2]\nThis bezel shines all through the nighttime, it’s gon’ be a dirty summer\nThat lizzy opens doors so keep your queen on lock\nShe’ll only let off at the right time\nShe’ll do the crime, on my momma’s life\nI was ‘bout to chop it, but there’s a time and a place\nShe wants to kiss but there’s money to chase\nShe lives in the Capital - so she Xtra\nSo you can imagine how many man try to finesse her\nDay after day she bad, wait ‘til she lands in LA, mad\nOh lord, all these bitches come and go that’s why I roll with the...\n\n[Chorus]\nRoll with the guys (roll with the guys), I’m with the guys\nShout out to bros, let’s get that dough, that’s all we know\nShe got that loud, she movin’ wild, she love the vibe\nIf that’s your girl, then that’s your L, I wish you well\n\n[Verse 3]\nWe all go through highs and lows (yeah), I guess this the life we chose (yeah)\nAnd I done kick down doors before, so if I were you I would stay on them toes\nIt’s only right, I ain’t gon’ lie-ie\nAnd she wanna roll with me-ee (uh uh ah)\nBut there’s a time and a place, pssh You should see what’s on her face\nShe wanted a ring but I married the game\nOne day I’ma get that crib in LA with a lake and a gate\nOne door leads to another\nYou can keep her to yourself it’s nada\nNow you know how\nAll these bitches come and go that’s why I roll with the...\n\n[Chorus]\nRoll with the guys, I’m with the guys\nShout out to bros, let’s get that dough, that’s all we know\nShe got that loud, she movin’ wild, she love the vibe\nIf that’s your girl, then that’s your L, then that’s your L boy\n\n[Outro]\nThen that’s your L boy\nThen that’s your L, then that’s your L\nRoll with the guys, with the\nThen that’s your L boy\nThen that’s your L, then that’s your L\nHey", "year": "2018-10-04"}], "artist": "Dappy"}