{"artist": "Cam’ron", "songs": [{"title": "He Tried to Play Me", "album": "Killa Season", "year": "2006-05-16", "image": "https://images.genius.com/82f464ee78c43b9e36f93d5d33f24db9.1000x1000x1.jpg", "lyrics": "[Hell Rell: Hook]\nHe tried to play me, shit got all crazy\nAnd things just wasn't the same\nSo I ran up on him, then pulled my Mac out\nAnd I blew out his brains\n\n[Cam'Ron: Verse 1]\nY'all wanted violence, we move in silence\nSilencer silence the guns\nI was the wildest, that was childish\nNow I stack my ones\nShinay was in love with her school, Rich wasn't liking his school\nShinay caught two in the ribs\nHe was a hustler, she's a customer\nNow he's off doing a bid\nT got shot with a shotgun on his block\nI wish it was all pretend\nNana getting high, hard enough getting by\nWhen is it all gonna end?\nMe I'm still holding on, the team still rollin' strong\nThe Ave. is down the street (down the street)\nBut I'm a street target, call me the meat market\nI stay around some beef\nThe block's still pumpin', isn't it something?\nNeedles, knives, and nines\nThere's no tomorrow, food getting borrowed\nWhat kind of life is mine? (Life is mine)\n\n[Hell Rell: Hook]\nHe tried to play me, shit got all crazy\nAnd things just wasn't the same\nSo I ran up on him, then pulled my Mac out\nAnd I blew out his brains\n\n[Cam'Ron: Verse 2]\nThey call me \"Patty Cake Patty Cake The Bakers Man\", I bubble bread (bread)\nBeef don't stop, who's this years knuckle head? (knuckle head)\nWe done scrapped and scuffled until our knuckles bled (bled)\nShot out in front of police, yelled \"Fuck a fed\"! (fuck the feds)\nI patrol on d low, popo know my steelo\nWho seen Killa cop? Niggas rolling C-Lo\nPump the peddle bike, nice chain, light chain\nFiends sniffin' white caine, needle, 40 and night train (that's Harlem)\nJust a hype lame, you don't love 'em like Dame (why?)\nThree years ago I would of robbed his dice game (true)\nLife's changed my snipe game's the right mayne (what's the difference?)\nOnly difference is I'll push you to that right lane (whip in traffic)\nGotta laugh yall that's just blue lightning (the Lambo)\nOr that white thing, you on the internet pricing (pricing?)\nI don't window shop, not, me and Jim go cop\nHop through the window, I- god damn them Bimbo's hot (hot)\nHot Dukes of Hazzard, they wanna do the limbo, lock\nNever had a Pinto OHC, first car a Benzo drop (Mercedes)\n\"Benz and Bops\", put between my hot wallet\nAnd my toaster, I really had a hot pocket\nAnd I'm saying this real clear, y'all can't chill here\nI know real thugs in wheelchairs, yeah yeah banged up and they still there\nParty pop more bottles than a nigga on two feet and some real gear\nIt's real here, real near, you feel fear, a meals real\nThey don't cry, if they do cry, homeboy it's a steel tear\nAnimals; Lions, Whales, Seals, Bears\nY'all fruits; cherries, grapes, stale pears\n\n[Cam'Ron: Bridge]\nThat's why niggas fuck with me\nAnd them ladies loving me, they all put they trust in me\nCause I flip that killa man\nThat's why niggas fuck with me\nAnd them ladies loving me, they all put they trust in me\nAnd my name is Killa Cam\n\n[Hell Rell: Hook]\nHe tried to play me, shit got all crazy\nAnd things just wasn't the same\nSo I ran up on him, then pulled my Mac out\nAnd I blew out his brains"}]}