{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/4b94adf039cd60481b11a123e817daec.662x566x1.jpg", "title": "Naughty by Nature", "year": "2014-03-21", "album": "WORD O.K.", "lyrics": "[INTRO]\nHeyo\nKool A.D., Kool A.D, best rapper in the world\nKool A.D., best rapper in the world\nYo yo yo yo yo\n\n[VERSE 1]\nHey yo, you, um, ever notice how I'm the best rapper and not you?\nCuz watch, kick the kid a little knock and I got you\nAll y'all can suck my ass, balls, and cock too\nBackseat rappin' ass fools eat sausages yo\nWho da best?\nPac, Nas and Big ain't no best\nI think that's what made no sense (that's right)\nI think I'm Mack Maine mackin' on dames\nIn Dame Dash's art gallery, I rock for art salaries\nBut really I'm only on the clock for heart's actually\nMy darts recharge batteries, a large and smart family\nMy Socrates philosophies be starrin' in Marvin biographies\nYour optometry couldn't see how my phonics be\nShout to Trackademicks\nPhrenology could not analyze my biology\nI scandalize sonically\nI vandalize prophecies that cannibalize sophistries of yesteryear\nAnd make all of those fallacies extra-clear\nAnd if you don't agree it, sit it out and give it an extra year\nCome back to it, see how I hold up\nMy dumb rap is stupid but see how I fold bucks\nIt's gun-clap music but I use it to get some gold ducats\nSome laugh, true, but I prove it in the cold hustle\nMy Cuban art is provin' the human heart is a cold, cold muscle\nMy flow free, like a corpuscle, look it up (look it up)\nWhen your street feet fail then book it up\nStreet meat stale then cook it up\nWhether snow, sleet, hail or whatever the weather\nYou better know me, player\nI'm the mayor, make it reign, blood\nLike Slayer\nInsane game blood, Like blayards\nAin't nobody play it like me, cuz\nSee cuz, my weed cuz? That's wholesale\nY'all tree retail\nMe I blow jars 'til I see trails\nMore bars than like 3 jails\nIncluding but not limited to cars and females\nShow me anybody who can go three quarters as hard\nAs my only sorta hard bars, I'll probably go \"nah\"\nYou couldn't afford balls as large\nI'm too Bay yo, like Charles in Charge (get it?)\nThat's Scott\nYou made a little rap track and sat back and thought that's hot?\nWell, that's not\nYou must have been off the crack rock\nI'm hot like the block that cops often call the crack spot\nYou like the opposite of hard, like \"that's soft\"\nDewey Cox lookin' ass dudes on catwalks\nMeanwhile the god chillin' like Bob Dylan\nFreedom is an odd feeling, but I'm not trippin'\nWheelin' and mobbin', weavin' and bobbin', stealin' and robbin'\nObviously, you can see that I'm a problem and that's beyond solvin'\nSo keep on walking, like Dionne War-wick\nI pee on a peon, 'til he want forfeit\nI'll V on more shit than your clique be on\nYour clique is beyond horseshit\nI'm free, y'all force it\nIf I had the time, might teach y'all courses\nTold you I'm a lime to a lemon, you're a peach like more than twice\nYour style ain't even sorta nice\nI don't condone or endorse it\nY'all ain't bout nothing like Jerry and George, quit\nYou know like the show, Sein-flield?\nMichael Richards make my fuckin' eyes bleed\nThanks to Mike Finito for making this beat\nI asked you send heat, and you sent like 14, like 2 years ago\nAnd all of them still slap\nEvery time I hear 'em I just wanna write real raps\nYou know, like tell 'em how you feel raps\nKill, kill, kill raps, Ill raps\nNah, nah\nWhat the fuck he too trill raps\nYour boy try to take a sip off the swill and he spill raps\nType to get jacked like Jill on a hill raps\nHillman graduate caps on the sill raps\nKick out the Jazz like Uncle Phil raps\nHungry like he never ate a meal raps\nSweatin' like he never popped a pill raps\nStop and chill raps, guys you got to feel that\nIf you don't, then fuck you\nFly like the paper I'm stuck to\nI'm making it, believe it and trust, dude\nMy quantity is proof, my quality is classy\nPositivity's cute, but negativity's sassy, you know\nPicture my mulatto ass rolling, Degrassi"}]}