{"artist": "60 Second Assassin", "songs": [{"title": "Clockz N’ Kingz", "album": "Remarkable Timing", "year": null, "lyrics": "[Hook 2X: 60 Second Assassin]\n60 Sec. in your gut, what, nigga, what\nIt's the last second, and who tares it up?\nThe fuck, nigga, what? Save all that bluff\nYou're on life support, and I'm the mack truck\n\n[60 Second Assassin]\nFrom the F.A. block to Putnam, until\nRockaway, Gladiator, I'm hard to kill\nFrom the Desert to Medina's how I'm gon' scar your grill\nSomebody, God is real, let him know God is real\nAmen, with rhymes that build, more\nGold in your steals, I'm too outspoken for real\nIt's summertime, I breathe in so deep I can smell a vine\nI'm all up in your gut, in this rhyme\n60 Sec. rap, stand the test of time\nI keeps it real in the grind\nAnd yet never in between my teeth with the swine\nTake a hook, chain it down, to shock it\n\n[12 O'Clock]\nIt's big 12 from the Cuffie Family\nShould he cop empty m's, thanks for having me\nI rock stages, any mic that's hand to me\nSo \"follow the leader\" like the Rakim said to me\nI'm in the club and these girls keep watching me\nIt's Brooklyn Zu, nigga, from the Wu-Tang Killa Beez (Huh, you did it homey)\nAnd all you dudes that be hating on this G\nI got the desert eas', pull it out and squeeze\nI'm from Putnam and Franklin, so nigga, please\nI bare arms like a shirt with the short sleaves\nI like it raw like on a plane with four ki's\nIt's 12 O'Clock with the O.G\n\n[Hook 2X]\n\n[Chi-King]\nAiyo, heavy lies the crown, my flow cold like Aspen\nMuay Thai elbow and jaws cracking\nSo you dissing? Homey, listen, yeah, you got the mic\nIt's the skills that you missing\nShoot your ass, push the learning in your walk\nYou can't talk and listen, so listen before you talk\nTime for new lessons, yo, time is of the essence\nCome correct first and leave the joking for the jesters\nBrooklyn bring it back, Sunz of Man well connected\n60 Second Assassin, Timbo King\nRoyal Family swing, this for the '09\n\n[Timbo King]\nThey call me Timbo of Jerusalem, the heat will rule again\nA G with a platoon of men, Bo King rule again\nNever was a war child, pops work it off the books\nYoung Brook, been a crook, moving with a felon look\nHistory and your orthodox, some straight off the blocks\nOf raw, pop two cops like 2Pac Shakur\nIt's real estate, coming from the realest state\nTraitors wanna infiltrate, hit 'em with the Glock and daggers\nStreet gothic, my pops was a fucking prophet\nHe told me to dig deep in the devil's pockets\nI'm in the loop, circles they form around me\nThey crown me and my county, sire, sire\nIt's Elo' amongst drug kingpins with kilos\nCrap shoot c-lo, they neighborhood casino\nCounter clockwise, count the troops, not the lies\nI see through your foolish attempts with closed eyes\nI'm Sitting Bull with a peace pipe, wanna pull?\nGot timberwolves dressed in all, sheep's wool\nFrom the blocks to the box, from the fingers to the tops\nLess is much more, but my need's a whole lot\nIt's throwblack clapper, you'se the brokeback rapper\nKing hustler trapper, the bitch nigga slapper\nBRAAAT!\n\n[Hook 2X]", "image": "https://images.genius.com/1d2892cda7088abed9797fd13ab159e5.500x500x1.jpg"}]}