{"songs": [{"lyrics": "[Verse 1]\nPussy rap, dental damn beaver trap\nThe thrill is gone, I’m here to bring the fever back\nTo the streets, pumping out the big whips\nTorpedo rhymes strong enough to sink ships\nTwo tone grip, Brother Mouzone shit\nBetter move on bitch, or else it's on, trick\nI'm en fuego, I ain't even in my zone yet\nI spit the shit to make your motherfuckin' dome sweat\nQueens-bred, no Packer but a cheesehead\nFat ass, fucking pussy until she’s dead\nSuede foot, looking like an Indian\nCuisine straight from the Caribbean\nLong jackets, made from an amphibian\nBag of money, split with my committee and\nBreak it down, vision on the dollars\nDip in the impalas, chilling with my scholars\n\n[Hook] (x2)\nGet it?\nI am not illiterate\nNot, not!\nNot even a little bit!\nStraight up, I make the music just for you!\nNothing, nothing like an idiot!\n\n[Verse 2]\nCall me John Bon Journo, hopping out the Volvo\nRatchet on the leg, dipping from the po-po!\nSince a youth I've been labeled as a loco\nI sell it but I never laced the nasal with the coco\nUrban hippie, muffle with the green thumbs\nSeven grams a purple to my neck'll leave my feet numb\nScoop a bitch, Portuguese sweet buns\nServe a dick like an elephant that's three tons\nHer pussy whistle like my father out the window\nRemind us that it's dinner time I’m lighting up the Indo\nAnd when I go inside I think I might just play Nintendo\nCall a Shortie from the heights have her play with my colembo\nUh, just let me catch my little breath an shit you won’t accept a kid\nCause your destiny is for deficit\nMe, you see I spit like epileptic shit\nThat's two options; it's either you fear me or you respect the kid\n\n[Hook] (x2)\n\n[Verse 3]\nMind like Watson, Fluent in the nuance\nVan Damme Bronson, Alligator shoe on\nSpin kick to the dick I'm eating dim sum\nRight up in the tea room\nYou don't want to rerun!\nMoon struck, splatter your platoon up\nHard times, drugs out the balloon\nBeauty like a butterfly, flying out cocoon\nUrban love and central village right by the lagoon\nUh, that’s my grandfather, add a little cream of tartar\nMake the grams harder\nNow your Shortie hold me tighter than the dance partner\nPull the viper out my pants on her\nHoney hit the tune I’ll let it dance on her\nLike a gypsy, hookers in Poughkeepsie\n7 homies with me everybody's smoking fifties\n990 add 2 that’s my shoes\nReflect light like sun shining at high noon!\n\n[Hook]", "title": "Cliff Notes", "album": "Starving on Reality", "image": "https://images.genius.com/c1ede5df22693a914ce708ed308bbad9.316x316x1.jpg", "year": "2011-11-22"}], "artist": "Action Bronson"}