{"songs": [{"title": "Afro Puffs", "album": "It’s On! Part 2", "year": "1994-07-26", "image": "https://images.genius.com/741fdf00f94b44363032dd0633c7873e.300x300x1.jpg", "lyrics": "[Hook: Lady of Rage & Snoop Dogg]\nI rock rough and stuff with my Afro Puffs (Rage!)\nRock on, wit cha bad self\nI rock rough and stuff with my Afro Puffs (Rage!)\nRock on, wit cha bad self\n\n[Verse 1: The Lady of Rage]\nI rock on with my bad self cause it's a must\nIt's the Lady Of Rage still kickin up dust\nSo umm, let me loosen up my bra strap\nAnd umm, let me boost ya with my raw rap\nCause I'mma break it down to the nitty-gritty one time\nWhen it comes to the lyrics I gets busy with mine\nBusy as a beaver, ya best believe-a\nThis grand diva's runnin shit with the speed of a cheetah, meet a\nLyrical murderer... I'm servin em like two scoops of chocolate\nCheck it how I rock it\nI'm the one that's throwin bolos, ya better roll a Rolo\nTo find out I'm the number one solo, uhh\nThe capital R-A now take it to the G-E\nI bring the things to light, but you still can't see me\nI flow like a monthly you can't cramp my style\nFor those that try to punk me here's a Pamprin child\nNo need to say mo', check the flow\nRage in effect once mo', so now ya know\n\n[Hook: Lady of Rage & Snoop Dogg]\nI rock rough and stuff with my Afro Puffs (Rage!)\nRock on, wit cha bad self\nI rock rough and stuff with my Afro Puffs (Rage!)\nRock on, wit cha bad self\n\n[Verse 2: The Lady of Rage]\nNow I'm hittin' MC's like Hadouken *Street Fighter sound*\nAin't no doubt about it I'm the undisputed\nSo what you uhh, wanna do is back on up\nI'll tap that butt, wax the cuts, pass the bucks\nSo put your money on the bread winner\nI kick lyrics so dope that the brothers call 'em head spinners\nI got the tongue that is outdone anyone\nFrom the rising to the setting of the sun\nOr the moon, I consume the room with doom\nWhen I hear the kick of a 808 bass ... POOM\nBOOM, BAM, God, DAYUMMMMMM!\nI'm hittin so hard you could say it's a grand, slam, dunk, punks\nGet broken off for chunk when they feel the funk\nOf the rhythm (fresh) that I give em\nLet it hit em, split em, did it now I'm rid of em, yeah\nI put that on my unborn kids\nRage in effect so you know how it is\n\n[Hook: Lady of Rage & Snoop Dogg]\nI rock rough and stuff with my Afro Puffs (Rage!)\nRock on, wit cha bad self\nI rock rough and stuff with my Afro Puffs (Rage!)\nRock on, wit cha bad self\n\n[Verse 3: The Lady of Rage]\nNow ever since my debut, I've continued to lay you\nFlat on your back from the raps that I spat, spit\nOhh shit, I'm the shit!\nYou can't get wit the Rage then tough tit-tie\nI pi-ty the fool, that gets\nWith the lyrical murderer cause my shit is rude (OOOH!)\nYou wanna get with the wickedness? With that\nBig bot-ty that's kickin it, rippin it apart like Jason\nYou'll be, chasin a dream like Freddy\nAre you ready for the cream de la creme?\nI'm steam pressurin those who ain't measurin up\nI keep competitors stuck\nIn the muck with they butt up, what chu wanna nut up\nLike cashew, don't you know that I will mash you? For real\nThat's the deal, I'm straight out of Farmville, VA\n(So what you gotta say?)\n\n[Hook: Lady of Rage & Snoop Dogg]\nI rock rough and stuff with my Afro Puffs (Rage!)\nRock on, wit cha bad self\nI rock rough and stuff with my Afro Puffs (Rage!)\nRock on, wit cha bad self\n\n[Interlude]\nHuhh\nI am the roughest, roughest, roughest (Say what? Say what?)\nI am the toughest, toughest, toughest (RAGE!)\nI am the roughest, roughest, roughest (Say what? Say what?)\nI am the toughest, toughest, toughest (RAGE!)\nI am the roughest, roughest, roughest (Say what? Say what?)\nI am the toughest, toughest, toughest (RAGE!)\nI am the roughest, roughest, roughest (Say what? Say what?)\nI am the toughest, toughest, toughest (RAGE!)\nGet with the uhh, roughest, roughest\nGet with the uhh, toughest, toughest (RAGE!)\nGet with the uhh, roughest, roughest (Yeah)\nGet with the uhh, toughest, toughest (RAGE!)\nGet with the uhh, wickedness, roughest\nI am the uhh, wickedness (RAGE!)\n\n[Outro: Snoop Dogg]\nYeah, one-nine-nine-fo'\nThe indo blow and the grass grow\nSnoop Doggy Dogg still don't love a ho\nBut you gotta give credit when credit is due\nWomen back down and bow down to my motherfuckin homegirl\nThe Lady of Rage\nShe rocks rough and stuff with the Afro Puffs\nHandcuffed and she busts\nAnd trick biatch, she's guaranteed to tear shit up\nY'know what I'm sayin?"}], "artist": "The Lady of Rage"}