{"songs": [{"year": "2016-06-29", "image": "https://images.genius.com/bbb7832dbb146fa12553e6378175b4bd.475x480x1.jpg", "title": "Alexandre III", "album": null, "lyrics": "[Intro]\nYeah Hoe ! Alexandre 3...\nQue la night, que la night, que la night...\nBig Lem'... BOOM\n\n[Couplet]\nComme si je portais le poids du monde sur mes épaules\nAutodidacte, jeune et fougueux qui rêvait de quitter l'école\nJ'ai refusé de servir de modèle ou d'icône, t'es tellement jaloux de mon succès que tu t'étouffes avec tes propres com's\nEn buvette sur le pont, Alexandre 3, le commissaire et tous ses collègues sentent l'alcool, je te brise le cœur, les morceaux s'recollent, suce les frères Lumière, sombre conne !\nSi la plume était une arme, je les aurais tous tués\nJ'cherche à produire une petite rentable, génération \"tant que j'ai des billets j'm'en tape\", télé-réalité de débile mental !\nC'est la Kalash Humaine qui rafale ton pare-brise, je retombe toujours sur la contrebasse, on sait qui gagne au bras-de-fer : amitié contre biz', naissent un peu comme un [XXX]\nEst-ce que les auditions s'contredisent ? La B.A.C fait sortir les poukis contre un blaz\nT'as du vice, on t'charcle avec un tournevis, l'être humain se méprise, il aime vivre sans glace !\nArabe, terroriste : pléonasme. Arrah, héroïne, litron d'frappe. Ah, je vois toujours la police à 6 du mat', j'ai percé dans l'pe-ra mais le passé me rattrape !\nEn buvette sur le pont, Alexandre 3, tu m'envoies des piques ? j't'enlève ta culotte. Les braconniers dans le Safari, je sers de proie : C'est maître Lemsi qui donne les leçons, toi tu notes !\nEn buvette sur le pont, Alexandre 3, viens pas gratter l'amitié on s'ressemble pas, la moitié du rap game a repris tous mes flows, mais comment dire... Ça sonne faux, ça m'ressemble pas !\nQue des rappeurs parodiques\nTremblement d'terter chaotique\nOn t'ouvre l'artère carotide\nOn rêve des chèques à Rothschild\nJ'suis cramé j'sais pas mentir\nLes poulets n'servent qu'à rôtir\nLes mecs les plus paros tirent\nJ'bande encore quand j'me retire !\nPour mes djellabas, mes boubous mes gitans comme Doudoum bang bang, happy birthday to you bitch, Islem est toujours debout, j'arrive doré sur un deux roues, dans le \"17\" on t'a Vrou-Vrou, bang bang, Happy birthday to you bitch, Islem est toujours debout !\nOn s'en bat les couilles de la vie, demande à mes bicows de Nanterre. J'aurai pas dû ressortir d'ma tanière, tu respectes plus ton dealer que ta mère, on cherche toujours une arme plus fiable, règlement de compte en période pluviale, vis-ser la haine, t'es sur la péniche, on encule la police fluviale !\nToi tu rêves de mourir jeune et riche mais tu vas te faire rafaler comme Mesrine, ta carrière ne vaut pas une seule de mes rimes, en vérité toi t'es juste un suppôt du diable\nEt juste parce qu'ils bousillent l'Hip-Hop, dois-je me pencher sur le cas d'ces pussy, bicow? Que la night, que la night, que la night, que la night ! YEAH HOE"}], "artist": "Hayce Lemsi"}