{"songs": [{"title": "Hot 1079 Philly: “Uptown” freestyle", "album": null, "year": "2014-10-29", "image": "https://images.rapgenius.com/97f1ab56f2ae1dbea971acfa2bff6ad7.1000x426x1.png", "lyrics": "(Beat is \"Uptown\" by Drake)\n[Freestyle starts at 3:20]\n\nWe could start with the rap\nFlowing like malls, like \"Oh, there's a Gap\"\nGo in my call-log dogs, wanna chat\nBig dogs\nMissed calls\n\nA lot of mother fuckers in the league know L\nAnd I just had brunch with Embiid and Noel\nAnd I just got fucked and sucked by a dumb slut\nUsually I like 'em Ivy league, oh well\n\nSummer camp, I've been going HAM\nYoung man with that chopper\nThat’s riflery, I like movies\nI'm going HAM for that Oscar\n\nI'm way far from their radar, like they know I'm coming, that's doppler\nThey're boring to me, that's opera\nI'm scoring beauties like soccer\n\nMe and Jonah Hill smoked, then we talk shit 'bout how the rest of y'all blow\nThen we take a dip up in his pool, pretty cool, not the pool, shit is hot, just the view from the spot, shit is hot, bunch of blonde bitches laughing all night\n\nMe and Busta Rhymes meet in Venice for a bite\nTalked some shit about the comedy scene\n\"That shit is so light\", he tell me\nCan't disagree, \"get it right\", he tell me\nI mean...\n\nI thought by now he could see that I'm witty\nDown in LA, I've been running the city\nAsk anybody in music and film, \"who got next in this bitch?\", and they all saying \"Dicky\"\n\nI just do it like there's nothing to it\nLife gettin' pretty sweet like I fondue it\nI'm killing bitches in my lane on some T Stewart\nAnd I've been scoring prevent yeah the dime blew it\n\nI'm the man, bro\nIon't really care what the fuck you think\nAnd my steak look rare, but I grub that pink\nAnd the grundle stink\nAnd I bump NSYNC\n\nDon't suck dick, but I blow that good\nDon't want shit, but a ho that would\nLemme hold that, ben and fold that\nGet a Kodak, cowboy, Jerry Jones that, lemme own that\n\nFuck that girl\nI got hair, never cut them curls\nAnd it's truth or dare, with a cute au pair\nGet a room to share, hit a boom Pat Burrell\n\nSpit that turd, that's that shit\nYo girl up on my dick\nI'm 'bout to sperm up on them hips\nDon't want to murder us a kid\nOh shit\nWhat you say?\nDon't you do this everyday?\nDon't you usually go with double meat when you eat Chipotle?\n\nDon't your crew lack someone black, but you want one to hang? No slave\nI heard your boo got so much back, she bangin' that Notre Dame clock\n\nI'm faded, tho\nFucking bitches you'd label undatable\nMissing birthdays, ay belated, bruh\n\nNaked out in San Fran on that roof top\nTan cans, no tube top\n\nI'm the mother fucking man, god damn, and these mother fucker bitches full of shit like zoo mops"}], "artist": "Lil Dicky"}