{"artist": "Canibus", "songs": [{"title": "Atlanta", "album": "My Name is Nobody", "year": null, "image": "https://images.genius.com/478f658d8d991509f0f55d07ed6e3df4.500x500x1.jpg", "lyrics": "[Canibus]\nI wake up in the morn', turn my PlayStation on\nJust bought that NFL Blitz and that Basket-Ball\nI read the Vibe and Source, to see what's going on\nI let my hair grow long, maybe braid it in the fall\nWhenever I get bored, I just jump in my car\nI go to Lennox Mall, and look for independent broads\nSometimes I get a nod, they treat me like a scrub\nI go down to the schools, maybe I get more love\nThree P.M. in the evening, I'm on the highway speeding\nMy front-left tires leaking, should have bought a new one last weekend\nI guess I wasn't thinking, up ahead break-lights was blinking\nFor more than thirty minutes I was stuck in gridlock prison\nThis traffic drives me crazy, going West on two-eighty\nFive bitch almost made me, crash into her Mercedes\nI'm glad I almost missed her, I pushed the clutch and shifted\nIt was a white lady, I'd rather hit a sister\nCause see, I know the system, it's easier to trick them\nI use my G to pimp them, then convince I'm the victim\nNah baby, you hit me, no I was in lane three\nYou need some contacts you can't see, no girl don't blame me\nDon't panic just be patient, give the bitch the wrong information\nShe'll probably never claim it, scared of high insurance payments\nI love my home Atlanta, I love my home Atlanta\nI love my home Atlanta, I love my home Atlanta\n\n[Canibus]\nThe land of pretty peaches, them girls with round features\nMake a nigga say, \"Good Jesus,\" them Georgia dime-pieces\nStarted off like, \"What's your name? Tell me, what's your age?\nYou got a man? Can we be friends?\"\nI'm glad you feel that way, come on and ride with me\nI take you to that Crunk bar where them sharks eat\nFive-star baby, bon-appetite\nI got that shrimp appetizer with that dog meat\nIf shorty want to creep, I bring her home with me\nJust bought some candles and that Carl Thomas CD\nBootleg that Jay-Z, stole that OutKast\nBeen have that Keith Sweat, I know how to make it last\nSmack that naked ass, she got a big butt\nI ain't in no rush, plus she likes it rough\nKinky stuff like, leather and handcuffs\nAnd them thangs you wrap around a man's you-know-what\nThat's why I love Atlanta, I can hardly stand-up\nI'm a heavy drinker, fix me a cup and sinker\nI always love Atlanta, that's why I love Atlanta\nI love my home Atlanta, I love my home Atlanta\n\n[Canibus]\nAs a young child I was so damn bad\nUsed to drive up the Ave with no tags\nNiggas couldn't see me, I was going so fast\nMost niggas catch whiplash and crash\nFace all chipped up from the glass\nRunning from the police hauling ass\nIf I get caught, I just give them some cash\nMost police give me dap and laugh\nOther ones pull up behind the flash\nTake a nightstick and tap the glass\nTell me, \"Turn the music down,\" it's on blast\nTurn the engine off cause I'm wasting gas\nTell them that I'm lost and I need a map\nLooking for a hotel to take a nap\nFreaknik, officer, I came for that\nIt was good last year that's why I'm back\nThat's when he tried to hit me\nHis big fist barely miss me\nI have my camera with me\nI think I'll sue the city\nI love this place Atlanta\nThat's why I love Atlanta\nI love my home Atlanta\nI love my home Atlanta"}]}