{"songs": [{"title": "Green Light", "album": "Love Songs 4 the Streets 2", "year": "2019-07-26", "image": "https://images.genius.com/93ad8e260c56b2fd9688409e9ccb1871.804x804x1.jpg", "lyrics": "[Intro]\nDY Krazy\nLet's get it\n\n[Verse 1]\nMan, give that boy this message (Let's get it), can't wait 'til foenem catch him (Yeah)\nKeep callin' me a rapper, I might be the one to stretch you (Might be the one to stretch you)\nHe claimin' that he gang, the only reason foenem loved him (Let's get it)\nI told him he a bitch, he ain't on shit, he nothin' special (What?)\nI just brought four Strikers (Strikers), foenem and them desperate (Let's go)\nBut I just took the keys 'cause foenem arguin' over Tesla\nWhy you think that he gon' ride for you? He gon' do what I tell him (Gang)\nI don't stop at red lights anyway, it's green light when they catch you (Yeah, yeah)\nGrab that TEC, nah, ayy (Let's get it), grab that MAC, ayy\nTalkin' behind my back, nah, nigga (Let's get it), he a rat, yeah\nTweakin' on that 'net, yeah, turn you to a pack, yeah\nTurn up in that 'Cat, yeah, that .40 Glock my gat, yeah (Brrah)\nVon pass that strap, yeah, take who chain? That's cap, yeah\nThat rap money in the trap, yeah, play with me, get clapped, yeah\nPussy (Bitch)\n\n[Interlude]\nHello?\nYeah, your bitch ass\nMan, you know what the fuck it is, man\nOTF and 300 y'all can't touch these, boy\nMan, get your bitch ass outta here, nigga\nYou know what the fuck it is with us, nigga\nYou a ho\n\n[Verse 2]\nYeah, so you tough, huh? (Let's go)\nYou ain't get enough, huh? Treat you like you Krump, huh? (Dope)\nOh, you think you turnt, huh? Come out cuts and dump some\nLike my cash in lump sums, niggas don't want these problems\nShe put coca on her gums, switches on our guns\nWe can't go for none', bitch, I put that on my son\nWhy you shoot him in his back? 'Cause that pussy tried to run\nGet your hand out your pocket 'cause I know it ain't no gun\n\n[Outro]\nAww, you turnt, huh? Aww, you geeked, huh?\nAww, you turnt, huh? Aww, you geeked, huh?\nAww, you turnt, huh? Aww, you geeked, huh?\nAww, you turnt, huh? Aww, you geeked, huh?\nAww, you turnt, huh? Aww, you geeked, huh?\nAww, you turnt, huh? Aww, you geeked, huh?\nAww, you turnt, huh? Aww, you geeked, huh?\nOh, you turnt, huh? Aww, you geeked, huh?"}], "artist": "Lil Durk"}