{"artist": "Problem", "songs": [{"album": "Selfish", "title": "Man Enough", "image": "https://images.genius.com/8165c0445cec284a3a939bed51fc0555.1000x1000x1.jpg", "lyrics": "[Intro]\nCan I ask you a question? (Yea)\nIs life fair? (Uh, uh)\nI knew it\n\n[Verse 1: Problem]\nLace up my shoes, kick game for the niggas that need it\nHella weeded, elevated, my mind needed to go\nHuh, let me give 'em some more\nTerrence, let's get 'em, what up [?]\nOne time for my nigga\nOne of the main reasons that I grind for the figures\nThe way I do, the way He'd done blessed me\nYou woulda think I done sneezed\nDown to my knees, I'm Jeez faster than [?]\n[?] 83s who woulda thought we woulda blow\nI still remember when a nigga wanted 'em smokes\nGot down over a pistol, shit became a [?]\n[?] *beep* [?] was me and him in the kitchen\nWe locked and he got me, it was heavy (fuck)\nHit it for the long haul, but I wasn't ready for them tactics\nThought he did me greezy as chap stick\nDid our thing then we talked, yea on some man shit\nResponsibility, I was never enhanced with\nYou here to hold it down nigga, that's it\nYou fucked it off, so you got to handle it\nA fake nigga woulda left it, but me I respected it\nEverything ain't 'bout [?], you [?] R.I.P. choose your recipe\n\n[Chorus: Problem & Rose Gold]\nI'm man enough to say that\nYea, yea\nAnd I'm man enough to say that\nYea, yea\n\n[Verse 2: Problem]\nI ain't been the same since my first child\nThe tears piled as I tried\n13 years later, last week, I just cried\nThinkin' about the future\nHow my daughter gonna think Kama Sutra the way\nBecause her father wasn't there to tell her what to say\nOr what to do\nAll she know is momma words\nAnd momma's words got daddy curved out the situation\nBroken calls, broken promises, litigations\nDone, fucked everything off\nYou still can't be, after the years of being blind, still can't see\nThat she using my daughter, to hurt me\nBut I ain't going nowhere, like true herpes\nOne thing about life, the truth don't leave\nAnd I know where I stand, no budging\nWho ready to face judgement?\n\n[Chorus: Problem & Rose Gold]\nI'm man enough to say that\nYea, yea\nAnd I'm man enough to say that\nYea, yea, yea\n\n[Verse 3: Problem]\nEveryday I'm out fighting with demons\nContradicting myself trying to find me a reason to keep going\nYea, I done made me a few dollars\nFuck some hoes, made a few cities holla\nBought a few cars, moved into a few casas\nBut every now and then, God grabbed me by the collar\nAnd let me know this ain't givin' to everybody\nYou been a petty potty on every nigga around\nBoy, realize you blessed\nNot many made was able to survive them tests\nYou know how many jealous I supplied with less?\nI know how when you and your name collide you stressed\nThat's why you keep shinin', you survived the best\nYou clean shit up, yea defied the mess\nFor those that ain't got it, you provide the rest\nLife's a bitch, so what you menage'd the rest\nI've seen you, so you don't dare detest\nMake a legacy, while you lived through flesh\nC'mon, my bad I'm bitching\n\n[Chorus: Problem & Rose Gold]\nI'm man enough to say that\nYea, yea\nAnd I'm man enough to say that\nYea, yea, yea", "year": "2017-11-03"}]}