{"songs": [{"title": "Homeward Bound", "lyrics": "[Verse 1]\nGotta go.  You know I stay up on my tippy toes\nFloatin’ like a Cadillac through Kaki-lak, dusty roads\nMoney’s low.  Niggas know good bills is high\nGotta ride.  Gotta fly—planning to\nPlus, I’m gonna kick it in Atlanta too\nJust to handle a few things\nDudes be protecting they blocks and never move kings\nI change my game like comebacks.  Sure, I’mma comeback\nBut right now, I had enough of that—I gotta make tracks\n\n[Hook]\nState to state, new city and town\nI been around, but I’m homeward bound\nA fast pace and I can’t slow down\nSolid ground.  I’ll be homeward bound\nState to state, new city and town\nI been around, but I’m homeward bound\nChange the place, switch my hustle around\nHold me down.  I’ll be homeward bound\n\n[Verse 2]\nYo, chip on my shoulder, city blocks on my back\nThe only way Akir know how to act\nI react to the scene and snatch up the green in between shit\nChecking on my queen, staying with terrific leans on a different ride\nSlide into the other side.  Fly from my mother’s side\nNice guy.  Slide from my pop’s side\nI move around a lot, never really had a spot\nBut learn to read characters and how to pick locks\nAkir—one-man band.  My home is where I land\nArms around my fam, eyes on a different scam ‘til it jam\nDamn, gotta scram ‘fore the man come\nI try to hit the can, son, ‘cause I’m too handsome\n\n[Hook]\nState to state, new city and town\nI been around, but I’m homeward bound\nA fast pace and I can’t slow down\nSolid ground.  I’ll be homeward bound\nState to state, new city and town\nI been around, but I’m homeward bound\nChange the place, switch my hustle around\nHold me down.  I’ll be homeward bound\n\n[Verse 3]\nYo, I travel like a veteran where… ever I settle and\nMaking money peddling, X-Game medaling\nFiending like Carol when the [?] end\nI’mma win regardless ‘cause I’m a nigga that’s plotting the hardest\nRap artist at eighteen.  College, I dropped out\nCrapped out the rap game, became a model scout\nGetting change for bagging dames\nNineteen, a producer\nAcid on computers, waitin’ tables just to get my loot up\nCash and credit card numbers—they was on a slumber\nQuit for the music.  That summer, nigga, I’m on the come-up\nGot a job telemarketing, still on the grind\nGotta put the manager, started selling ‘em double lines\nPaycheck, monthly bonus, and extra dough they throw us\nUntil we got busted down.  S’no wonder, disgusted, I’m out\nPromotions for different majors.  Second company\nTwenty-one, first client that’s really supplying papers\nOff-the-book cash.  Traveled and we had a blast\nThe web boom to the whole stock market crash\nGot a job doing car rentals.  It was instrumental\nShit, I had places to get to.  It didn’t pay enough\nTimes are tough, paper’s essential\nI knew there was more to offer\nPut on a suit.  In a month, cellphone and office\nBack and forth to record my album\nDropped the job, kept the cars, and pressed up a couple thousand wiling\nFrom the South to Manhattan Island\nA man’s prowess is important as his callouses—enormous, kid\nAnd now I rock shit.  Suburbs, back to the hood\nNew York’s my stomping ground, America’s my neighborhood", "year": "2006-03-20", "album": "Legacy", "image": "https://images.genius.com/ec568067b0f966b9ee18a0f87677e60e.1000x1000x1.jpg"}], "artist": "AKIR"}