{"songs": [{"year": "2019-04-20", "title": "Baby Choppa", "image": "https://images.genius.com/38af6f15c4c3af0551bde5b9ee778d6e.889x889x1.jpg", "lyrics": "[Intro]\nYeah, woah\nWoah, woah, woah, woah\nWoah, woah, woah, woah\nYo Pi'erre, you wanna come out here?\n(Woah, woah, woah, woah, woah)\n\n[Verse 1]\nFuneral home hanging off my hip, bitch nigga (21)\nArm barely longer than the clip, bitch nigga\nFace tatted but I'll still take your bitch, bitch nigga (on God)\nIf you want some smoke, I'm in the 6, bitch nigga (Zone 6)\nI be ballin', son (bitch), like I'm Iverson (yah)\nBrand new rifle, son (yah), tryna snipe his son (yah)\nSend the hitters down (yah), no time wrestlin' (yah)\nA pimp talking, huh? (yah) Nigga, I could fuck a nun (yah)\nYou niggas copy cat the gang but you can't be me (21)\nDon't try this at home, this is not TV (21)\nWe'll crash your supercar, nigga, Luigi (on God)\n.223 will get to kickin', nigga, Bruce Lee (21)\n\n[Pre-Chorus]\nAll y'all niggas just talk the shit\nAll my niggas really walk the shit\n4L Gang, we be chalkin' shit\nHe used to have the juice but he lost the shit\nYo Pi'erre, you wanna come out here?\n\n[Chorus]\nBaby choppa, baby choppa\nI just bought a baby choppa\nBaby choppa, baby choppa\nI just bought a baby choppa\nBaby choppa, baby choppa\nI just sent him to the doctor\nBaby choppa, baby choppa\nAll we tote is baby choppas\n\n[Verse 2]\nChopstick, nigga, that's all I tote (tote)\nOne shot, nigga, murder she wrote (murder she wrote)\nNothing like these rappers, I don't snort coke (nah)\nWhere I come from, we sell the dope (on God)\nWe don't buy it, dawg (21), don't you try it, dawg (21)\nKanye West, nigga, get your mouth wired, dawg (bitch)\n.223 will get to singing like a choir, dawg (lil' bitch)\nMy young niggas, they got murder for the hire, dawg\nFox 5 Gang what I claim, it's a way of life (21)\nHang around real jackboys, niggas took ya' ice (21)\nThink you hard 'cause you got a body? We'll take ya' stripes (21)\nBitch, I was a gangster way before I touched the fucking mic\nYo Pi'erre, you wanna come out here?\n\n[Pre-Chorus]\nAll y'all niggas just talk the shit\nAll my niggas really walk the shit\n4L Gang, we be chalkin' shit\nHe used to have the juice but he lost the shit\nYo Pi'erre, you wanna come out here?\n\n[Chorus]\nBaby choppa, baby choppa\nI just bought a baby choppa\nBaby choppa, baby choppa\nI just bought a baby choppa\nBaby choppa, baby choppa\nI just sent him to the doctor\nBaby choppa, baby choppa\nAll we tote is baby choppas", "album": null}], "artist": "21 Savage"}