{"songs": [{"image": "https://images.genius.com/ec460ab317d45b37a52a3fbfe238e5d8.304x304x1.jpg", "lyrics": "[Intro: King Just]\nYo! This is K.J., all day, every day\nAround your way, in your hallway\nPuffin' ganje, Hillside Scrambled eggs..\nLet's go... let's go... let's go..\nK.J. rhyme, all day, every day, let's go..\n\n[King Just]\nPrepare for a Battlestar Gallectica, this is Attica\nAmerica, home of the Chainsaw Massacre\nDracula, sink my teeth into this beat\nAnd sleep on corners where you drug dealers meet\nStay out of reach, but I keep arm distance\nWe can't hold him down, cuz I'm just too persistant\nListen, nitroglycerin, finish him\nKryptonite for all you fuckin' Supermen\nIt's him again, and I'm feelin' fine\nWatch where you walk, you might step on landmines\nTech nine crime, quote him line for line\nIntertwine with a mind like Albert Einstein\nOptimus prime, throw heat like the sun\nI got fees in this rap, why you think I'm on the run?\nAnd when it's all said and done, I'm handlin' my biz\nAll the kids around the world is gonna is, is\n\n[Chorus 4X: King Just w/ children]\nNobody rhymes like K.J. rhymes\nNobody, K.J. rhyme\n\n[King Just]\nNow which one of ya'll could do it like I?\nI guess you the reason they put \"pumpk\" in the pie\nQuicker sea fry, hang glide slide\nK.J. go way-way like pantry pie\nZebra Lounge crowd, yo, that's Lounge\nIf I ain't put it down by the ramp with 18 pound\nCherry jubilee, hang off roofs like D.P\nEver since Champ God robbed the fuckin' Mickey D's\nYa'll was scarred and needed reincarnation of jackpot\nStop frontin', cuz you got the hip hop Scott 'Rock\nFace lock the shot, we got the studio booked\nLook up your history, I'm still off the hook\nIt's Mark Twain, I'm rollin' like Oliver Twist\nBack now, to smackdown shit that you missed\nKiss where the sun don't shine, bottom line\nYa'll niggas better hope I don't get a deal and sign\n\n[Chorus 4X]\n\n[King Just]\nYou the Mick Dynamite or Mr. Excite\nYou've been rappin' for a long time but don't sound right\nNot quite as the hype that you recite\nMr. All-Day, I'll do it to your ass night\nOn sight, I smash anything you write\nWith K-9 teeth for niggas who bagpipe\nWalk to the light and bring your mic\nYou won't last one minute in a ten round fight\nThe Al-Qada type that'll snipe your windpipe\nSiege your general, and strip him of his stripes\nEither you men or mice, you gon' still pay the price\nYou either take my advice, or roll the dice\nReal life, still trife, walk with a gun\nTalk with a knife, double c.d., so you can buy me twice\nOn tight, and you just might take flight\nM.C.'s got left, why you think they not right\nHang glide like a kite, on the turnpike\nWith two bitches, that's some Dick Van Dyke\nPay-per-view satellite, there's a need to feed my appetite\nPick up your weight, cuz you ain't got the hype\nBattle me, your need an invite, black or white\nAnd I'll still drink a forty with ice\nI still smoke a leaf joint from Spike, ight?\nI'm the reason why Coca-Cola had to fuckin' remix the Sprite\nHe's nice, and taste like Chinese rice\nAnd from shit on the stick, he the pastry whites\nYou the Latter Day Saints, I'm the Poltergeist\nI'm the whole damn pie, nigga, you just a slice\nThis is a heist, I suggest you remove your ice\nBefore you be up in close and person over Christ\nGet on your Big Wheel bike and take a hike\nCuz around these parts, you not liked\nParasite, don't have me flex my mic\nI don't rock Air Force One's, I call it Air Strikes (*echoes*)\n\n[Chorus 4X]\n\n[Outro: children]\nWay!\nNo way!\nNo way!\nNo way!\nNo way!", "title": "K.J. Rhyme", "year": null, "album": null}], "artist": "U-God"}