{"artist": "C-Bo", "songs": [{"title": "357", "album": "Til My Casket Drops", "year": null, "image": "https://images.genius.com/dc4336c862301b0ea11cc46a1958acbe.500x500x1.jpg", "lyrics": "Verse 1-(C-Bo)\n\nMy first name is Smith, my last name is Wesson\nBut in yo hood I'm known as 357\nHave yo neighborhood punk quick to shoot a man\nAnd have Clark Kent thinkin' that he's superman\nWit six in the cylinders chambers\nI'm the cup of courage that got ya feelin' like the ultimate banger\nBut some fools misuse my abilities\nDoin' drive-by shootin' everythingthey see\nI'm quick to cap it in yo life if you tempt me\nPlayin' Russian Roulette but is the cylinder empty\nFully loaded fool, you shouldn't have been trippin\nThen you wouldn't be holdin' yo head in yo hands to keep yo brains from drippin\nI'm a lethal weapon registered in everythang\nUsed by the police, dope dealers an yo local gang\nI'm the hardest muthafucka alive, right in front of yo eyes\nKill any man wit the quickness now who the fuck am I?\n\n(Chorus)\n\nI'm Mr. Tre-five-seven, quick to peel a cap\nI'm yo friend to the end, you know I got yo back\nI'm known to every trigga finga so everytime you squeeze\nI'm kick out so much heat I'm bringin he-man to his knees\nI'm Mr. Tre-five-seven, fool you know me I'm the reason why yo punk ass got locked up for that murder beef\nCuz after all I'm only a gun, an a gun ain't got no love\nRemember that when you fill me up wit them hollow point slugs\n\nVerse 2-(C-BO)\n\nMr. Tre-five-seven, I send that ass to heaven\nQuick to murder muthafuckaz, an quick to pull 211's\nI turn a big bad nigga into a cowardly lion\nAn if he's thinkin about jackin, boy I'll keep his ass from tryin\nSee I don't give a fuck, pull the trigga an I'll buck\nWhen you rollin wit tre-five, fool, whoever steps is suicide\nI never been a snitch, but if you do some crazy shit\nYou best to have a handkerchief to wipe the finger prints off yo grip\nCuz if you down I'm down, fool, it ain't no half-steppin\nI'm a leathal weapon, just point me in his direction\nAn ain't no tellin who I'll hit so you niggas better run\nI'm Mr. Tre-five-seven, that's any kind of killaz gun\n\n(chorus)\n\nVerse 3-(C-BO)\n\nNo one can hang, I'm the downest on this earth\nNo regrets, no sorrows, no remorse when I burst\nI hang on the side of your task force an the waist of yo neighborhood killaz\nMight catch me up under the seat, or ridin in the lap of yo dope dealaz\nI'm known to robbin banks, jewelry stores, an 7-11's\nSome use me for protection, an some use me for 1-8-7's\nIt's best to call the police if you think you see me comin'\nBut whatever you don't run cuz you might tempt me to start gunnin\nI kill at will, quick to spill guts when I bust\nAn when a habit drops, you muthafuckaz can't touch\nMo deadlier than a pitbull, when you locked up in my sight\nSo stay up outta my path, an beware because I bite\n\n(chorus)"}]}