{"songs": [{"title": "#LetterOfRecognition", "album": null, "year": "2013-10-08", "image": "https://images.genius.com/4fff53f85a4f6704ecb471ac0c617cfe.446x446x1.jpg", "lyrics": "LETTER OF RECOGNITION\n\nMS\nLAURYN\nHILL\n\nLetter Of Recognition-\n\nFirstly, I want to thank everyone who wrote letters and sent packages and books. Because of you there was not one day that I didn't receive mail while I was away. I appreciated that. Also, know that many of your letters not only touched me but continued to confirm for me what I already knew but needed to hear again: that sincere expression has a serious purpose. If one of you had been touched, picked up, encouraged, prevented from succumbing to some measure of social or Spiritual decline, then it was worth it. Folks, walk strong, seek light and Universal correction in all things. Know that man-made concerns and Universal concerns are not always in agreement. Obviously, strive to please God. Thank you again and again.\n\nIn Love and Freedom,\nMs. Lauryn Hill\n@mslaurynhill\n__________________________________________________________________\nMs. Hill would like to thank the following people for their words of encouragement and support:\n\nJessica Lucas, Victoria, BC; Debbie J. Duncan, AL; Bessie Williams, Henderson, NC; King Solemon Kamali, Santa Clara, CA; Jahi, Oakland, CA; Candice Hughes, Las Vegas, NV; Cherisse Pittman, Alpine, AL; Joshua Curry, Benton, AR; Ana Rodriguez, Cranston, RI; Dr. Marcus Anthony Hunter, New Haven, CT; Naty Marrufo, Seaside, CA; Re Grace, Lake Forest, CA; Carter Grant, New York, NY; David Cruz, Hartford, CT; Terryl Lee Elder, Jr., Ansonia, CT; Sundiata Sadiq, Ossining, NY; Daisy, Tannersville, PA; Jerald Miller, New York, NY; Sister Souljah, New York, NY; Heidi Salcedo, Bethel, CT; Devon Young, Newark, NJ; Ralph Mitchell/Carthage Financial Group, Quincy, MA; Patrick Lanary, New York, NY; Tomeka Ramocan, Burlington, NJ; Birk Paluzzi, Elmwood Park, IL; Ms. Kirema Colbert, Hartford, CT; Derek Singletary, Astoria, NY; Steven Marcus, North Hollywood, CA; Rashad Hawkins, Alpharetta, GA; Diane L. Martin, Philadelphia, PA; Shareen Arroyo, Charlotte, NC; Mr. Daniel Aguilar, Brownsville, TX; Nadisha Postell, Bronx, NY; Claudia Bruno, Los Gatos, CA; Ms. Mamie Scott, Reading, PA; Maurad Ouazine, France; Robert D. Boyd, Maricopa, AZ; Aframerican Bookstore, Omaha, NE; Dr. Cynthia Chapman; Latisia Phillip, Virginia Beach, VA; Carl Williams, Roxbury, MA; Gerald Ludwig, Regensburg, Germany; Renee Manley, Northampton, MA; Steve Nickerson, Los Angeles, CA; Maisha Yearwood, Los Angeles, CA; Sister Nubia, Detroit, MI; Tywanda Auld, Philadelphia, PA; Sister Souljah (again), New York, NY; J.R. Castaner, New York, NY; Brenda Davis, New York, NY; John Forte’, New York, NY; Darrel Muhammad, Orangeburg, SC; Barbara Mirza, Santa Monica, CA; Patrice Tucker, Oxon Hill, MD; Haakeem Quddus, Philadelphia, PA; Casonya O’Neil, Aiken, SC; Sarah Bullard, Orlando, FL; Karen Mason, Atlanta, GA; Caroline Curran, Troy, NY; Carletta Hagins, Tampa, FL; Donelle R. Boose, Washington, DC; Reverend Frank Masso, CT; Mr. Breaux, San Jose, CA; Julia Beverly, Atlanta, GA; Shelondra Yvonne Peavy, Houston, TX; Sharon Garrett, Little Rock, AR; Tony Delgado, West Lafayette, IN; Kim ‘Soulful’ Woods, Dacula, GA; Andre Robertson, Brooklyn, NY; Jade Forest, Atlanta, GA, Ainslee Johnson, Cleveland, OH; Tom Bair, Ozone Park, NY; Ruth Brinkley, Brooklyn, NY; Dominique, Brooklyn, NY; Assary, New York, NY; Ms. Loretta Stinson, Newnan, GA; Melanie Clarke, Mt. Vernon, NY; Rondress T. Sharks, Orlando, FL; Jimmie Pierre, New Orleans, LA; Takeyah Young, Sunrise, FL; Jahi, Oakland, CA; Stacy LaDonna, Bartlett, TN; Carl Williams, Roxbury, MA; Angelina S. (Lux Prosa); Dorrian Bridges, Ft. Pierce, FL; Darlene and Caleb Fant, South Orange, NJ; Chris Danny, Rutherford, NJ; Dominique Jean-Louis, New York, NY; Ebony Epps, Bridgeport, CT; Ms. Kawanna Lyons, New Orleans, LA; Polk, Lakeville, MN; Maurad Ouazine, France (again); N. Cerise Hall, Atlanta, GA; Ayana Soyini, New York, NY; Maisha Yearwoon, Los Angeles, CA (again); Danell Alston, Washington, DC; Empress Jahleah Selassie-Aird, Newnan, GA; E. Hewong, Henderson, NV; Lance Christopher, Keene Savoy, IL; Tiffany Pollard, Atlanta, GA; Mr. Michael Taylor, Petersburg, VA; Tess Foley Kochowicz, Monroe, CT; Diane L. Martin, Philadelphia, PA; Ms. Mary Mackey, Limerick, Eire; Hannah Bleier, Roscoe, NY; Ms. Debbie J. Duncan, Eutaw, AL; RBC Ministries, Grand Rapids, MI; Joe Benjamin, Bristol, CT; Syneeda Penland, Dacula, GA; Jeremy Shea Wilson, Natchitoches, LA; Diane L. Martin, Philadelphia, PA (again); Toyia Halman, Chicago, IL; Abby A. Gonzalez, Paterson, NJ; Monesha Gethers, Fresno, CA; Wendy Ann-Clarke, Toronto, ON Canada; King Solomon, PA; Douglas Moore Sr., Belleville, NJ; Marissa Gomez, Corona, CA; Malik Abdul-Aziz, North Hollywood, CA; Davonne Breedlove, Opa-Locka, FL; Paul Major, Orleans, VT; Rosenita Delva, West Palm Beach, FL; Anna Michelle Dorn-Hogan, Madison, WI; Monroe Mallory, Cleveland, OH; Angel Redmond, Leicester, NC; Angela Taylor, Friendswood, TX; Niamh Cahill Co., Laois, Ireland; Greg Pabst, Baltimore, MD; Kris Love, Fresno, TX; Angela Baltimore, Little Rock, AR, Laretta Majors, Hollywood, FL; Jade Tamara Pat Watson, Ilford, Essex; Kyrstal Roberts, St. Petersburg, FL; Briauna Trammell, Salisbury, MD; Tammi Martin-Davis, Philadelphia, PA; Chivonne Lawson, Stone Mountain, GA; Woodley Lamousnery, Stamford, CT; Issa E*; Amanda Armas, Las Vegas, NV; Shelondra Yvonne Peavy, Houston, TX; Camille Watkin, Columbia, MD; Greg Torwalt, Humboldt, SK, Canada; Trey Cousins, Hamden, CT; Angela J. Baldwin, Mt. Pleasant, SC; Alvin Burleson Jr., Renton, WA; Cynthia Ongottaud, Congo/France; Hope Leon, Los Angeles, CA; Khalilah Abdularahim, Hamden, CT; Moira Pattinson, Edinburgh, Scotland; Brittany Blackman, Brooklyn, NY; Ms. Mary Mackey, Limerick, Eire (again); Dianthia Simon, Los Angeles, CA; Mrs. Latasha Drax, Lakeland, FL; Tonia Ogun, London, UK; Trish L’Oreal Winslow, Sandy Springs, GA; Jasmine White-Killins, Plano, TX; Joi (with an Eye) Walthamstow, London UK; Heidi Salcedo, Bethel, CT; Ms. Jaleesa Bartley, Durham, NC; Jezebel Sheba Rose, Swanee, GA; Veronica Malone, Petersburg, VA; Michael Browne, Bladensburg, MD; Mr. Thomas E. Moore, San Quentin, CA; Shepherdess Angela/The Prayer Box Community, Mountain Home, AR; Carter Grant, New York, NY (again); Shaunda C. Turner, Fairlawn, NJ; Tatiana Williams, Los Angeles, CA; Lisa Marie Betancourt, Riverside, CA; Jezebel Sheba Rose, Swanee, GA (again); Mayah Dyson, Manassas, VA; McCall Brister, Mt. Juliet, TN; Carl Williams, Roxbury, MA (again); Emilienne Gray, Roselle, NJ; Ms. Darlene Fant and Family, South Orange, NJ; Ayanna L. Benton, Stamford, CT; Karla ‘Kae’ Thomas, Parkville, MD; Matthew Akins, Hyattsville, MD; Debbie J. Duncan; Eutaw, AL; Schimeka K. Galloway, Brooklyn, NY; Joshua Curry, Benton, AR (again); The Prayer Box Community, Mountain Home, AR (again); Ms. Vanessa D. May, Sylmar, CA; Jakia Handy, Los Angeles, CA; Maisha Yearwood, Los Angeles, CA; Suzette Williams, Teaneck, NJ; Destini Jammeh, Kent, WA; Ms. Sha’Rita McClurkin, Trotwood, OH; Tina Blumenberg-Williams, Portage, IN; Mr. Ryan Jordan, Wethersfield, CT; Kristen Bettencourt, Boston, MA; Timothy Stephens, Desoto, TX; Yvette Walker, Opa-Locka, FL; Maurad Oazine, France (again); Mitchell R. Weinhandl, Calgary, AB Canada; Tajh Abdulsamad, Alpharetta, GA; Yusef Trice, Chicago, IL; Mike Williams G., Barringten, MA; Ainslee Johnson, Cleveland, OH; Maisha Yearwood, Los Angeles, CA (again); Hakim ‘Hak’ Bell, West Orange, NJ; Piper Patron, Laughlin, WV; Sydney Atkinson, Austin, TX; Bill Wright and Carroll Jrdn, Washington, DC; Candice Latrice, Denver, CO; Lavonia Jenkins, Philadelphia, PA; Carter Grant, New York, NY (again); Keka Robinson, Emeryville, CA; Emmanuel Schaeffer, France; Dr. Andrea P. Lowe, La Place, LA; Keith Swan, Levittown, PA; Carl Williams, Roxbury, MA (again); Destiny Lewis, Kissimmee, FL; Lisa S. Ridgle, Hawthorne, CA; Charles ‘Duce’ Castaneda, Aurora, CO; Sheila Moore Haddad, Cookeville, TN; Anna Michelle Dorn-Hogan, Madison, WI; Phillip C. Hogan, Sr., Portage, WI; Eden, Greg and Nicole Duncan-Smith, Brooklyn, NY; Remond Wright, Opa Locka, FL; Sonia K., Brooklyn, NY; Colleen Garza, Vallejo, CA; ‘Pretty’ Nicki, East Hartford, CT; Lana DiCostanzo, Savannah, GA; Teresa Lomax, Temple Hills, MD; Lasana M. Sekou/House of Nehesi Publishers, St. Martin, Caribbean; Carter Grant, New York, NY (again); Toni Grant, Brooklyn, NY; Lia Anderson, Lauderhill, FL; MJW, Washington, DC; Mrs. Jolie Willis, Austin, TX; Maisha Yearwood, Los Angeles, CA (again); Dylan Hunziker, Naperville, IL; DeJuan Bland, Detroit, MI; James Devlin-Braswell, Atlanta, GA; K. S. Young, Wixon, MI; Nerdy LLC, Chicago, IL; Irvens Andre, Lithonia, GA; Diane L. Martin, Philadelphia, PA (again); Deborah Jane ‘Cleopatra’ Burke & The Strange Fruit Team, Los Angeles, CA; Joyce Poitier, SC; Michael Green, Fair Bluff, NC; Verlinda Bluestone; Salt Lake City, Utah; Dericka Kalee Yah Ysrayl, Glen Carbon, IL; Temel ‘Mel’ Sinclair, Sanford, NC; Kierra Poe, Cedar Rapids, IA; David Cruz, Hartford, CT (again); Apostle Charles and Prophetess Wanda Logan, Spartanburg, SC; Ms. Mary Mackey Co., Limerick, Eire (again); Evita Colon, Shippensburg, PA; Olivia S. McClenton, Perth Amboy, NJ; Debbie J. Duncan, Eutaw, AL (again); Carl Willimas, Roxbury, MA; O’Leatha Harris, Bowling Green, KY; Karl Fields, Richton Park, IL; Brandon Laster, Calumet City, IL; Kara DJ, Whitehouse Station, NJ; Nathaniel Mitchiner, Newark, NJ; Ainslee Johnson, Cleveland, OH; Patrick/The Bookstore Columbia, SC; Luney Marcello, Charlotte, NC; Maisha Yearwood, Los Angeles, CA; Maurad, France (again); Jamillah Hatim, Richardson, TX; Brian Bowers; Nazarene Englewood, CO; Shawntavia Day, Cleveland, OH; Joseph Rodriguez, Pueblo, CO; Elizabeth Gerald Flossmoor; Mitchell Thomeycroft, England, UK; Eva Jennings, Philadelphia, PA; David Cruz, Hartford, CT (again); Lloyd Aldridge Jr., Hartford, CT; Raquel Falesbork, Brooklyn, NY; Caprice Lamor, Irvington, NJ; Tomeka Ramocan, Burlington, NJ (again); Danielle Broussard, Houston, TX; Stephanie Black, New York, NY; Stacy LaDonna, Bartlett, TN; Naoisha Postell Bronx, NY; Garrard McClendon, Ph.D, Chicago State University; Debbie J. Duncan, Eutaw, AL (again); Siewa Dewar, Mississauga, ON, Canada; Tammy Kiliona, Vallejo, CA; Diane L. Martin, Philadelphia, PA (again); Leile Akahloun, Johannesburg, South Africa; Selim Tadjiae, France; Ms. Bintou Kone’, Toulouse, France; Erin Chester, VA; Maurad, France (again); Izetta Autumn Mobley, Washington, DC; Chelsea Hargrove, Clermont, FL; Tammi Diggs, Kannapolis, NC; Carl Williams, Roxbury, MA (by way of Tellinn, Estonia); UJ, Wheaton, IL; Reverend Frank Masso/Bible Prophecy Ministry, Stratford, CT; Ariel Cavaseno. Bayside, NY; Ms. Darlene Fant and Family, South Orange, NJ; Yvette Walker, Opa-Locka, FL; Laurel Forrest, Georgetown, SC; Robert Martin, Newark, NJ; Bun Linaeus, South East London, UK; Shawn Thwaites, Martinsville, VA; Kazi Odinga, Philadelphia, PA; Debbie J. Duncan, Eutaw, AL (again); Jack Splash, Miami, FL; Ms. Erica ‘Sun Blossom Kente’ River-Pinket, Burgaw, NC; Alexis F. King; Stephanie Eze, Denmark; Atiya Judson-Saunders, Stamford, CT; Jeremy Wilson, Natchitoches, LA; Danyea Brown, Marietta, GA; Theresa Bella Mosley, Cincinnati, OH; Shaconda Magwood, Atlanta, GA; Orlando Lopez, Glen Cove, NY; Petra Almic’, Croatia; LaToya Turner, St. Louis, MO; Senece Dunlop, Erie, PA; Jade A. Mcfarland, Swartara, PA; J. Sanders, Austin, Texas; Jari Tyrel Smith, Landover, MD; Maurad, France (again); Nakia Tuh Smyrna, GA (and also Tonia, Derek, Tiffany, Nakia, Mike, Cherisse, Elena); GaBrilla Ballard, Needham, MA; Ms. Mary Mackey Co. Limerick, Erie (again); Diane L. Martin, Philadelphia, PA; Joyce Swain, West Orange, NJ; Tauheedah Shukriyyah, Elkins Park, PA; Rena ‘Antonia Perdu’, Rochester, NY; Jean Simpson, Kissimmee, FL; SPC Monique Brown, APO, AE; Michael Smith, Brooklyn, NY; Josh Lynch, Elkgrove, CA; Paula Shepherd, Houston, TX; Cherisse Pitman, Alpine, AL; Ruby LeGinel, Dover, DE; Ruby Raynor, Philadelphia, PA; Angela Taylor, Friendswood, TX (again); Simae S., Cincinnati, OH; Deborah Moher, New York, NY; Deborah Jane and the Strange Fruit Production team, Los Angeles, CA; Angela Taylor, Friendswood, TX (again); Jermaine Morris, Pomona, CA; Rosi Reed, Sherman Oaks, CA; Paul Major, Orleans, VT (again); Dianthia Simon, Los Angeles, CA; Diane L. Martin, Philadelphia, PA (again); Angela M. Wyatt, Charleston, SC; Akajou McDaniel, Los Angeles, CA, Diane L. Martin, Philadelphia, PA (again); Audrey R. Clarke, Lanham, MD; Nubia Polk, Detroit, MI; Jeffery Russell; Maurad, France; Jessica Hall, Troy, AL; Amanda Torres, Roslindale, MA; Scott and Niamh Corcoran, Scarborough WA, Australia; Christina ‘Euphrates’ Jones, Atlanta, GA; Darrick Smith, Stockton, CA; Hannah Smith, Brownsville, TN; Thomas F. Henley, Houston, TX; Debbie J. Duncan, Eutaw, AL (again); D. Sana Pate, Houston, TX; Melanie Clarke, Mt. Vernon, NY; Crystal Guidry, Stockton, CA; Jason Reese, Columbus, OH; Rachel Ritchie and Family, Mississauga, ONT; Mr. James Brooker III, Raleigh, NC; Mr. James Brooker III, Raleigh, NC (again); Maisha Yearwood, Los Angeles, CA (again); Mary Mackey Limerick, Ireland; Inslee Johnson, Cleveland, OH; Reina Noguchi Kitakatsuragi-gun, Nara, JAPAN; Naoisha Postell, Bronx, NY; Nene Gomez, Bakersfield, CA; Samantha Moore; Brian and Juliana Oliver, Sebastopol, CA; Anzania Carter, Dunwoody, GA; Maurice Lunsford, Atlanta, GA; Shavaughn Barnes, Detroit, MI; The Streets Don’t Love You Back Store, Maricopa, AZ; Brandon Jackson, Addison, TX *beautiful poetry; Daria Dorsett Nassau, Bahamas; Maisha Yearwood writing from NYC (again); Carl Williams, Roxbury, MA by way of Klaipeda, Poland; Monica Knox, McDonough, GA; Naoisha Postell, Bronx, NY (again); Paul Major, Brownington, VT; Nicole McNair, Plymouth, NC; Reba Bell East, Stroudsburg, PA; Shavaughn Barnes, Detroit, MI; Tyleshia Anderson, Oroville, CA; Luke Lambert Woking, Surrey; Diane L. Martin, Philadelphia, PA (again); Tara Michael, Scranton, PA; Greg Brantley, Indian Orchard, MA*; Scott A. Sloan, Gainsville, FL; Carl Williams, Roxbury, MA by way of Berlin, Germany; Camidroel; Maarten and Charlotte; Debbie J. Duncan Eutaw, Al (again); Keka Robinson, Emenjville, CA; Maisha Yearwood from NYC, NY (again); Ms. Darlene Fant, South Orange, NJ; Mark Bowers, Newark, NJ; Jerald Miller, New York, NY; Mr. James Booker III, Raleigh, NC (again); Ceet, Philadelphia, PA; Shawntavia Day, Cleveland, OH (again); Wilda McGugan, Barnigat, NJ; Douglas Moore Jr., Belleville, NJ; Tara Michel, Dickerson City, PA (again); Maurad Ouazine, France (again); Deshaires ‘Maty’ Mathilde, Paris, France; Eric Crume, Las Vegas, NV; John A. Pristell aka R. Logical Allah, Doraville, GA; Lisa Miller Autry, Desoto, TX; Maurad, France (again); Yolanda A. Orozco, Yakima, WA; John A. Pristell aka R. Logical Allah Doraville, GA (again); Ondrae ‘Drae Divyne’ Walker, Lexington, KY; Nikia Barber-Clark, Irvington, NJ *ETP!; Ian Luther, Southhampton, England, UK; Weusi Baraka, Victory Gardens, NJ, Sarai Memphis, TN; Ms. Vanetta Grant, Brooklyn, NY; Eric Gayles, Greensborough, NC *; Tannika Charrae Myers, Philadelphia, PA*; Miriam Banks Farrakhan, Union, NJ; Debbie J. Duncan, Eutaw, AL (again); Diane L. Martin, Philadelphia, PA (again); Maisha Yearwood writing from NYC (again); Bria Bromell. New Haven, CT; Analisa Ruiz, Houston, TX; Maurad Ouazine, France (again); Christopher Chizer, Houston, TX; Inez Bonilla, Old Bridge, NJ *; DeWayne ‘Haru’ Hendrix, Atlanta, GA; Lingaire Njie, Baltimore, MD; Jamillah Salahuddin; Brooklyn, NY; Tonja Ayers, Detroit, MI; Princess Shipley, Miami, FL; Lauren Halsey, New Haven, CT; Uno Selfe, Tonawanda, NY; Natasha Wright, Nassau, Bahamas; Ryan Josey, Miami, FL; Roconia Price, Manassas, VA; Pink Renee Norbrega, S. Spring, PA; Jimmie Pierre, New Orleans, LA; Justin Blake, Brooklyn, NY; Mr. Antoine Mikell, Hagan, GA; Mikel Irisarri, La Rioja, Spain; Sheronah Dawson, West Point, GA; Kelli ‘Shrimp 40’ Handrich, Brunswick, GA; Brittani Marie ‘Georgie’ George, Charlotte, NC (beautiful drawing); Roconia Price, Manassas, VA (again); Maurad Ouazine, France (again); Maisha Yearwood, Los Angeles, CA (again); Tershema Jackson, Pine Bluff, AR; Mr. Lyle Hickman, Scotch Plains, NJ; Hannah M. Smith, Brownsville, TN (again); Maisha Yearwood, Los Angeles, CA (again); Devon Young, Newark, NJ (again); Ms. Debbie J. Duncan, Eutaw, AL (again); Roconia Price, Manassas, VA (again); Minister Beverly Spears, Hudson, NC; Stephanie, Los Angeles, CA; Pat Reid, Footscray, VIC Australia; Sil Van Der Woerd, The Netherlands; Unknown, Atlanta, GA; Latasha Burnard, Duluth, GA; Ms.Tara Michel Watkins, Dickson City, PA (5 letters); Jazmine Green, South River, NJ; Sister Wilda McGugan, Barnegat, NJ; Johnnie Dent Jr., Cleveland, OH; Stacy LaDonna Bartlett, TN and the Fugees Online Forum (again); Starasia ‘Star’ Daniel, Duluth, GA; Nick Gilchrist, Wagram, NC; Raheem Robinson, Irvington, NJ *no panic room!; Aunt Rafeekah Sabur, Newark, NJ; Private ‘Sonny’ Harrelson B. Watson; Melanie Clarke, Mt. Vernon, NY; Jessica Lee, Canton, OH; Preston McPherson, Atlanta, GA; Claudia Bruno, Los Gatos, CA (again); Candice R. Pittman and Sister G.F., Heights, OH; Sabela Gomez Diaz Galicia, Spain; Ms. Tara Michel Watkins, Dickson City, PA (again); Shelondra Peavy, Houston, TX; Nadia Barrera, San Juan Capistrano, CA; Debbie J. Duncan, Eutaw, AL (again); Malik Allah, Atlanta, GA; Jasmine D. Sayles,  Buies Creek, NC; Laurynn Navarro, Brooklyn, NY; Maurad Ouazine, France (again); Simon Dasher, New York, NY; James Booker III, Raleigh, NC; Ms. Tara Watkins, Dickson City, PA (again); Amelia Alleman Carmichael, New Haven, CT; Deborah Jane and the Strange Fruit Team, Van Nuys, CA (again); Diane L. Martin,  Philadelphia, PA (again); Keith D. Moore, Shomari, LFL, N. Langley, Rashaan Langley, and Troy Frost, Cheshire, CT; Mama G, Conshohocken, PA; John McGuire, O’Brien, FL; Diane L. Martin, Philadelphia, PA (again); Dianthia Simon, Los Angeles, CA (again); Ms. Darlene Fant, South Orange, NJ (again); Michael Green, Fair Bluff, NC; Monita Lawing,  Concord, NC, Shelondra Peavy, Houston, TX (again), Okenzie Nwoka,  Iowa City, IA; Allen DeWane Harris, Duncanville, TX; Rashad Hawkins,  Alpharetta, GA (again); Jerroid Thomas, Washington DC; Tiffany Renee ‘Twin’ Johnson, Chicago, IL; Diane L. Martin, Philadelphia, PA (again); Paul ‘PV’ Major, Brownington, VT (again); Maisha Yearwood, Los Angeles, CA (again); Mercedes, Sacramento, CA; Angela Taylor, Friends Wood, TX (again); Ms. Tara Watkins, Dickson City, PA (again); Barbara Brown-Rivera, Miami, FL; Matthew Akins, Hyattsville, MD; Terrence Calvert, Madison, TN"}], "artist": "Lauryn Hill"}