{"artist": "Killah Priest", "songs": [{"image": "https://images.genius.com/5c86057760df363ce4e120da6447495e.500x500x1.jpg", "title": "Do the Damn Thing (Remix)", "year": null, "album": "Black August: Revisited", "lyrics": "[Intro: Killah Priest (Ol' Dirty Bastard)]\n(It's the hot shit, nigga!)\nYou know this beat is crazy, right (Hahaha, come on!)\nThis the beat right here, yo (hahaha)\nThey gonna love this when they hear this, g (come on)\n(Yeah, Dirt McGirt and Killah Priest, hahaha)\n\n[Hook: Killah Priest]\nA lot of these rappers r indecisive\nThat come into the game like y'all the nicest\nBut anyway get rich get brain\nGet off the wall and do the damn thing\nGet off the floor and do the damn thing\nGet off the floor and do the damn thing\n\n[Killah Priest]\nSilly rappers when will y'all learn\nU play with fire and U will get burned cause now\nI've been low lately waiting my turn\nTurn off my radio cause I'm not concerned with y'all\nWeak rhymes same topics\nThis one for the street for the projects\nFor my G's with the weed in the apartments (uh)\nFor my dogs in the law hit with charges (Killah Priest)\nFuk them cause I luv y'all regardless\nFor my chicks in the whips dancing braless\nHair done nice face looking flawless\nI got the thing bust off lead objects\nY'all cats r lame no threat it's a promise (blaze)\nName your favorite rapper well he's fake\nAnd U fake that's why U fuk with his tape\nI'll take that thing and just bust in your face (come on, come on)\n\n[Hook : Killah Priest (Ol' Dirty Bastard)]\nA lot of these rappers are indecisive (come on! come on!)\nThey come into the game like y'all the nicest (come on! come on!)\nBut anyway get rich get brain (come on! come on!)\nGet off the wall and do the damn thing (come on! come on!)\nGet off the floor and do the damn thing (come on! come on!)\nGet off the floor and do the damn thing (come on! come on!)\n\n[Ol' Dirty Bastard]\nOHHHHHHHHHHHHHHHHHHHHHHH!!!!!!\nI'm on the streets ringo, spendin' the spingo\nEazy-E lingo, you doin' the tango, the vet don't wear Kangol\nI dare pump my shit out the club, actin' strange, yo\nSmack y'all niggas in yo face, yo\nGot wiggas in the place, yo, by partyin' this muthafucka\nI'm the only round lookin' sucka\nI watch ya birds clucka, I'm free to ya tucka\nSo hold up, I'll play this muthafucka!\nI'm on the other side, sportin' the vibe\nI'm like college to this bitch asshole then vibe, slide!\nEnter tah, with ya asshole movin' like hah\nSo don't ever let the shit break ya soul\nWith the drunk shit I will take ya soul\nI move with mad heat and smoke you in ya head, man\nThis shit war, sign my tape man, take man\nI'll blast you in ya muthafucka face\nSmoke you in ya muthafuckin' face!\n\n[Hook]\n\n[Hook: Killah Priest]\nCause it's a new year besta come correct\nI ain't heard a style that I can't do yet\nI ain't hear a rapper that I can't move yet\nGet off the wall and do the damn thing\nGet on the floor and do the damn thing\n\n[Outro: Ol' Dirty Bastard]\nYeah, Killah Priest, nigga\nRecon Records, Ol' Dirty Bastard\nKnowhatimsayin? Ya'll DJ's better play this shit\nYouknowhatimsayin? Ya'll best to play this!\nYa'll know, I know where ya'll live!"}]}