{"songs": [{"title": "Facts", "lyrics": "[Intro]\nYeah, it's Dolph\nP.R.E., Paper Route the Empire\nAyee!\n\n[Verse 1]\nI heard my dawg got cancer, said I prayed for Boosie\nI can't wait 'till my boy come home, free my nigga Gucci\nI took one for the team and blew us up like Weezy (Tunechi!)\nMade a half a milli in the trenches bumpin' Jeezy\nA million dollars worth of cars, feel like I'm Baby, nigga\nSpend all this fucking money on ice like I'm crazy, nigga\nI just left San Francisco, smokin' flavors with Berner\nStill a work a bitch like I'm Ike Turner\nMy city is to me like Toronto is to Drake\nShout-out to Meek just cause I love to see young niggas get cake\nJust ask around this muthafucka, I'm the Jigga in my city\nI'm not sayin' they not good, I'm just sayin' I'm the realest\n\n[Hook]\nFacts\nYeah, young nigga blessed\nI feel like every day god put me through a test\nSince I was 17, I ain't been able to get no rest\nBill time comin' up and guess who pay the rent\n\n[Bridge]\nDamn, man, I miss my grandma and my Uncle Vick\nAll these fucking chains on like I'm Slick Rick\nI feel like Master P cause ain't nobody gave me shit\nRozay told me \"young nigga make sure you get your paper\"\nIf we ain't beefin' bout no skrilla, then I see you later\nAye, miss me with that fuck shit, man\nWe all about paper over here, let's go!\n\n[Verse 2]\nWhen I'm in LA, I'm only smokin' on that platinum\nWhen I'm in the Bay, I'm only smokin' on gelato\nWhen I'm in the A, I'm flexin' hard, might go tomorrow\nSmellin' like a pound of weed, we just walked in Wells Fargo\nAnd I fucked the manager last night and she swallowed\nOne thang bout me, I'm gon' stay fresh as fuck wherever I go\nTwo thangs bout me, them hoes always go wherever I go\n(It's Dolph!)\n\n[Hook]\nFacts\nYeah, young nigga blessed\nI feel like every day god put me through a test\nSince I was 17, I ain't been able to get no rest\nBill time comin' up and guess who pay the rent, uh!", "album": "King Of Memphis ", "year": "2016-02-18", "image": "https://images.genius.com/1589c69ebdac7664de45bd46c9a41d07.640x640x1.jpg"}], "artist": "Young Dolph"}