{"artist": "Astronautalis", "songs": [{"title": "The Wondersmith and His Sons", "image": "https://images.genius.com/258c327557c1b4953713d1522282eaf9.640x640x1.jpg", "album": "Pomegranate", "lyrics": "[Verse 1: Astronautalis]\nI am a soldier baby\nWho works just like a slave\nSweating through the pain of digging his foxhole that he know is just a grave\nYou trust me don't you baby?\nYou'd hand your life to me\nLet's walk along the wire and watch the muzzles flash like lightning\n\n[Chorus]\nA smile safe-crackers understand, is rendering this steady hand obsolete\nYou thought you caught my slight of hand, but you could never understand\nNo not me\n\n[Verse 2: Astronautalis]\nFather was a charming man with much hidden up his sleeve\nI wonder if this is what he planned when he taught his tricks to me\nThe youngest was a clever boy cracking calculus by three\nThe eldest was a practical and obsessively clean\nThen there was me:\n\nI was born a charming man with silver tongue, pearl teeth\nThis's never how it's 'sposed to end, we're promised all we dreamed\nThe envy of the Everyman our family seemed complete\nOur father was a charming man, our mother a serene\n\nBut now I'm on the run again - this hotel's home to me\nThey found the other skeleton face down in the stream\nThe youngest was still tucked in bed\nThat way they thought he was asleep\nThey moved the mirror from his mouth\nThe fog that should remain was not to be seen\nNot to be seen\n\nI am the doctor darling\nWho used to operate\nBut I couldn't stand the pain of healing\nOnly t'watch another woman waste away\nYou trust me don't you baby?\nYeah you'd hand your life to me\nLet's set this barn on fire\nAnd watch the flames eat up the roof beams\n\n[Chorus]\nA smile safe-crackers understand\nIs rendering this steady hand\nObsolete\nYou thought I must have broken in\nBut there's no crime in coming in\nThey hand me the key\n\n[Verse 3: Astronautilis]\nFloating on the wind again\nOn the tail of my quarry\nOn a woman weak for charming men\nWho's holding what I need\nShe'll leave her window cracked for me\nAnd I'll draft in like the breeze\nMy father was a charming man and I learned it all from he\n\nThe brother's born a wondersmith\nWe started as a team\nLike complimenting cogs and gears we built a head of steam\nThe tragic flaw of charming men\nIs exactly as it seems\nToo much grease\nCan break down a machine\n\nPour another round on me\nPour another round on me\nYou know I'm good for it\nYou know me\nYou know I'm good for it\nYou know my family\n\nI am a lover lady\nWho sees just what you dream\nI know you're going crazy living with him an' without me\nYou trust me don't you baby?\nYeah you'd hand your life to me\nLet's leave this life tonight\nAnd race the sunrise down the highway\n\n[Chorus]\nA smile safe-crackers understand\nIs rendering this steady hand\nObsolete\nThe charm and confidence of men\nCan jam the bullets in your gun\nAnd stop heartbeats", "year": "2008-09-23"}]}