{"songs": [{"year": "2004-03-27", "image": "https://images.genius.com/00b3f0fb7b1aa9167e2e0abcfb296420.818x818x1.jpg", "title": "Capture the Flag", "album": "The Chalice", "lyrics": "Billy woods - “Capture the Flag”\n[Emcee(s): billy woods]\n[Producer(s): 007 (AKA Bond)]\n\n[Verse 1: billy woods]\nGet rich or die lion, rather lie dying\nH. Rap with the iron firing.  As not for whom\nThe siren, it tolls for thee.  Sheriff, D.T., and the\nFucking deputy.  Tackle Feds and scale walls\nClose call, crawl, light up.  Fuck y’all, fucking waiting\nFor Babylon to fall.  Give me the damn ball.  New York State of\nRhyme, Chocolate City don’t shine, mo’ coal all mine\nAll-City grind.  Hearts and minds\nPulled over, swallowing dimes, I’m due time\nNot tonight.  Off-duty cop get rocked in the\nGulliver.  Snatch the Pulitzer, pull it, sir, billy\nBlur, shells burn like racial slurs, rabid\nRedux gliding on black like hockey pucks\nSkating from Caucasians, they got sticks, full\nClips.  Told you so like Hans Blix—now know why he\nSaying shit.  Save your spit, wasting Sali-\n-va on rims.  I’ll rap gasoline and tires\nANC necklace, put emcees in fires\nBitches jump in like Hindu funeral pyres, rap\nMacGyver detonate with copper wire, rusty pliers\nQuotables for survivors, Port Authority\nPumping dirty mags, snag duffle bag, hail a cab\nCapture the flag\n\n[Verse 2: billy woods]\nParliament’s Darwin, boxcutters carving a wig\nThis is America, everybody can’t eat.  Now\nNiggas under white sheets, bundles under passenger seats\nDirty again from peanuts, pig pen victory\nDefeat.  Live on your knees or die on your feet, get\nSome, get some, run through slums the harder they come\nFaster and making you run.  Jesse and Adolf\nBubblegum gangsters playing golf, catching fire\nCamouflage choir, Terror City Saudis\nWith Buck 50’s and niggas waving Old Glory\nCapture the flag, stay calm\nPut the money in the bag\nSuccumb or resist, survive\nOr live"}], "artist": "​billy woods"}