{"artist": "King Gordy", "songs": [{"image": "https://images.genius.com/bf3cd51d1b4525bcebf62727d8df4688.500x500x1.jpg", "title": "Pass Me a Lighter", "year": "2003-06-24", "album": "The Entity", "lyrics": "[Verse 1]\nI got to be bout the meanest ever\nYou defeat me never\nI was born dead!\nFat nigga with horns in his head\nCalls himself the east side King! He breathes lightning!\nYou can see electrical currents when he's rhyming\nSkin made of Teflon, he don't need no vest on\nHe proceeds to get blown, when he bleeds the shits chrome!\nHe ain't a human being. Wait till you see him\nHe's a true demon\nHe uses trees\nTo defecate on loose-leaf\nA ghetto legend came out the womb at 11\nWith the face of a felon, but a face like a meteor hit him\nA Detroit icon!\nWith a stomach made of pistols, eye of tiger, heart of lion\nThe ghetto messiah! It's on forever\n1877, more calm then ya!\nNever knew the east side, he would have to run\nCalm like a thief in the night with a mask and a gun\n\n[Hook]\nOhh... somebody pass me a lighter (Well)\nOh won't you please light this blunt up for me (Tell 'em why!)\nSo I can get high and start spittin the fire (Aw, Gordy!)\nLet these niggas know why they call you 'siah\n\n[Verse 2]\nLyrics comin with the strength of ten men\nNot even with titanium bones, I'll end them\nI'm stopping his men, now he's breathin slowly\nI hope he don't pee\nOn himself when I'm rhymin his legs and break one knee\nA verbal arsonist, my verse it too hot to spit\nBurning off all your skin, murder your ligaments\nWhy do they call me King? I ain't self proclaimed\nThese eyes saw a whole lot of niggas die cause they felt the flame\nThink I'm talkin just to hear my motherfucking self talk?\nI am to the east side what Biggie was to New York\nHope I'm lyrically uplifting ya when I'm dropping this\nStay humble, never arrogant. Just confident\nI just want Detroit to love me, oh I cry for you\nI looked out yelling your name, ready to die for you\nI just want to puff a blunt, oh just for you\nOh Detroit, I love you so (Oh! Well....)\n\n[Hook]\nOhh... somebody pass me a lighter\nOh won't you please light this blunt up for me. (Tell 'em why!)\nSo I can get high and start spittin the fire. (Aw, Gordy!)\nLet these niggas know why they call you 'siah\n\n[Verse 3]\nI got the scripture of a king, paint the perfect picture\nA worthless nigga\nPeseants, bow down to my presence\nWith these two braids sticking up\nIn case you were wondering \"Why in the fuck\nDoes he have the two braids sticking up?\"\nDrinkin gin outta a a tenth-century English cup\nFuck shootin - tou cross me, your head's bein cut (Off wit his head!)\nMy cape is from an African lion eye, from a sacred African tribe\nThey'll prasie me after I die!\nForty eight frames made from an elephant's tusk\nMotor gauges on like the president or something\nOld people lookin like, I know he said something\nBut go and let him do his thing\nHe's the east side's king\nPlease don't try to do it people, boy this guys out of it\nPlease don't try to do it people, oh this guys out of it!\nWell, don't try to interview him, oh this guys out of it!\nOnly thing he's gonna scream is (well, well, well, well)\n\n[Hook]\nOhh... somebody pass me a lighter\nOh won't you please light this blunt up for me (Tell 'em why!)\nSo I can get high and start spittin the fire (Aw, Gordy!)\nLet these niggas know why they call you 'siah"}]}