{"songs": [{"image": "https://images.genius.com/b7bcbd18f4df90fee8a1067f0b2b3a7b.1000x1000x1.jpg", "title": "Real", "album": "Therapy Session", "year": "2016-04-22", "lyrics": "[Intro]\nYeah, real music\nYagh! Yo\nTell me, what am I doin'?\nJust get in that, you get in that head space, y'know?\nTell me, what am I doin'?\nWoo!\n\n[Verse]\nWill somebody get the body bags? We gon' put the beats in 'em, nah\nPut the MCs in 'em, season 'em, put 'em on a beat with me, then I'm eatin' 'em\nGet away from the table, you rappers ain't hungry enough, you rappers ain't hungry like us\nThey talk about me like I'm here, they talk about you like you was, woo!\nThat nurse came into my room, she told me I'm sick in the head\nI'm in hip-hop's hospital bed, with a pad and a pen and a brace on my neck\nThey told me that I'm never leavin'—why? I am as ill as it gets\nAny rapper that say that they runnin' the game, I'ma come in they session and cut off they legs, woo!\nStrap a grenade to my head, pull out the pin, my music is mind-blowin'\nAin't nobody do it like I do it\nYou ain't ever been on my level, I got a problem with the way they keep on talkin', and actin' like everybody gonna get it, better sleep with your eyes open\nYou wanna know what I noticed?\nLook around at my fan base and they ready (I see you!)\nThat last album was heavy (I see you!)\nThat last album was gritty\nHow you gon' match that? Just let me–\nDo what I do best, you're better off playin' Russian roulette\nThan comin' in a booth with me 'cause I get a little bit intense—I'm like, \"Who's next?\"\nY'all better watch it, take a look at where the clock is\nIt's my time, this ladder of music that I climbed\nI took the machete, the game isn't ready, them rappers, they comin' up on me, I cut off the ladder, and I told 'em, \"Bye-bye\" (Bye-bye)\nWhat, you lookin' for a high-five? Nice try! (Woo!)\nDo not believe everything that you read on the Internet\nI do not know who your dentist is, but he should clean out your mouth, don't call me a sellout, that's something I've never been\nI've been through Hell all my life though, but I know what Heaven is\nFather, forgive me, for I am a sinner, but You gave me music as medicine, woo!\nAnd nobody want a problem when they get in my zone, better leave me be!\nI'm a mean MC, better feed me rappers or feed me beats, agh!\nFeed me both of 'em, they like, \"Nate, what's it like to be famous?\"\nHahahahahaha, umm, I'll let you know if I make it! (Yeah)\nI wonder what life would be like if I didn't stick out my neck\nTwo hundred dollars inside of my bank account, woo! I was livin' on that\nI need some money to pay for my rent, I need some money to pay for my gas\nI'm not complainin', I'm just bein' honest, I promise that I will not beg for respect, nah!\nI get so frustrated, take a look at what I've created\nTime is wasting, and I ain't waiting\nI'm a doctor with no job, me, I don't have no patience, I keep pacing–\nBack and forth, I keep racing\nYou ain't never been in my book and I got a problem with it, why? 'Cause you actin' like you read my pages\nI wreck these stages, real talk, better give me space 'cause I am chasing\nSomething they told me that I won't make it, agh!\nI'm not famous, I'm just Nathan (Woo!)\nAnd I wonder how the world gon' take this\nThey might hate it, but you know anything about me, you know that don't mean I'm changin'\n'Cause you know I'm real with it, don't care if you feelin' it, I'm feelin' it\nYou don't like it? Then deal with it\nAnd if God ain't real—real isn't\nUsed to wonder why I existed, I exist in the world that's real different\nAnd, \"What you gon' be when you grow up, Nate?\" I doubt they will get it\nMy life is a mess, better watch your step when you step in it, some of this brain is off-limits\nI'm off in a world you don't get, 'cause you ain't ever been in it\nIn ten minutes I still couldn't explain what's inside my brain, don't mess with it\nI've invested a lot of me inside these lines, I'm just protectin' 'em\nEverybody wanna hear the real version of life, then don't get so sensitive\nWhen I say something a little bit raw, I jot my thoughts and they call it \"negative\"\nYou wanna know where my heart is? I stand out 'cause I wear my garbage\nI work my hardest and every time I look into the mirror I don't forget about where I started, woo!\n\n[Outro]\nTell me, what am I doing here?\nTell me, what am I doing here?\nTell me, what am I, what am I doing? Mmm\nTell me, what am I doing here?\nI said, what am I doing here?\nTell me, what am I doing here, if\nI'm not being real, mmm"}], "artist": "NF"}