{"artist": "Fabolous", "songs": [{"year": null, "album": "There Is No Competition", "image": "https://images.genius.com/514810c2ba4e1b9f387deef8c54f63f5.320x320x1.jpg", "lyrics": "Just keeps callin me man\nJust keeps callin me\n\nIm hooked\n\nIm back to do the damn thing (x4)\n\nFeel like the ex champ back in the title fight\nThe young contenders are lookin at me in idol light\nFresh taper, waves lookin title tight\nYea I'm in the building, like a Corey Lidal flight\nI'm married to the streets, this is my recital right\nI got the Phantom drop dressed up bridal white\nHehe, you know them doors are suicidal right?\nSorta like they slit your wrists when I'm tryin to sit your miss\nNigga picture this, like a Kodak moment\nI'm off the bullshit, 'bout to go back on it\nAnd I ain't hard to find, bet ya Lojack on it\nCall it corn row roof, cause it go back don't it?\nI gotta get it now, ain't no pension plan rappin\nFuck bein friends, save me the hand dappin\nUnderstand captain, you'll be under land nappin\nIf you keep thinkin that it can't when it can happen\nAsk Scarface, faster than a car chase\nAt ya grandma's place, lettin AR's waste\nSports Coupe, not too much car space\nThe trunk look like Desperados guitar case\nIf you say a thing wrong, I won't let it string long\nAll I gotta do is push the button like ding-dong\nI don't play the back and forth game 'less it's ping-pong\nMike Tyson flow, so I ain't in the ring long\nNigga you ain't King Kong, thinkin that you bit shit\nYou gon have your man sick, someone sing his theme song\nMy nigga Freck plugged me in with this Beijing jawn\nSo hot, she play Alaskan with a string thong\nReal delicate, I just call her China Set\nFendi fur, Gucci gators, guess she like designer pets\nShe saw a few things, that get her vagina wet\nSF, G4, and it's not a niners jet\nBut check the body drop, baby boy shittin\nBut it's just sittin, so it's like I made a potty stop\nIt's like karate chops, we be breakin bricks down\nCocaine tour, I been through six towns\nOpen with crack as the openin act\nHeroin headliner, stage name China\n(What you call that?!) That's what you call a trap star\nI could get the kingpin charged for these rap bars\n\nThat's right nigga, we still do this shit\nMan on the street tip too man, we touch things\nKnah mean like the body shop we touch shit up man\nGet this shit movin man, it's Loso\nBig shout to that Street Fam, what it look like y'all?\nWhat's goin on Brooklyn?\nIt's your boy, I'm back man\nWe got Brooklyn lookin better than ever now man\nThese niggas can't fuck around man\nI'm back to do the damn thing", "title": "Back To Do The Damn Thing"}]}