{"artist": "88-Keys", "songs": [{"album": "The Death of Adam", "lyrics": "[Hook] (Kanye West)\n(Stay Up)\nStay-\n(VIAGRA!!)\nStay up\nStay up (Yeah)\nStay up (Kinda crazy, right?)\nStay up\n\n[Kanye West]\nWhat she got is so Niagara\nMake a young nigga straight need Viagra\nMake a old nigga give keys to Jaguar\nJust to keep from all the tease and laughter\nHer telling her homegirls that he couldn't stay up\nIn the restaurant with her voice way up\nPlease keep it discreet\nKeep the business out of the street\nShe said \"I would if he'll handle biz up in the sheets!\"\nPop off like a thang thang, he keep keep\nAnd every time that she bang bang, he skeet skeet\nAnd he so bullheaded tried to three-peat\nTry imagining something passionate\nBetween you, Cassie, and Kim Kardashian\nMaybe that'll work when you get to hit that ass again\nOr you can grab a Red Bull and sip that twice\nNow y'all can have sexy time, it's nice!!\n\n[Hook]\n\n[Kanye West]\nMan this is classic, call her National Geographic\nHer ass is African, but her eyes so Asian\nPlus the waist and, time's a-wastin'\nThis some good pussy, dog please don't waste it\nYou said \"Fuck that, man I'm gon' tape it!\"\nAnd came before you barely even got the tape in\nShe had the maid outfit, it's all on her apron\nI know a friend who got drunk and claim a fat bitch raped him\n\n[88 Keys]\nI heard that bitch hate men and she covers up her crotch\nBut she love to show her girls like Sanaa Lathan\nAnd she throwing passes like Troy Aikman\nAnd she really into twisting facts like false statements\nHe's into twisting backs by throwing his weight in\nBut she ain't waiting for him to rise to the occasion\nHe's like \"Be patient, this a contact sport\nSo you can save your pep talk, give me that oral support\"\nAnd stay up\n\n[Hook] (Kanye West & 88 Keys)\nStay up ([K]: She said you couldn't)\nStay up\nStay up ([K]: Way up)\nStay up ([K]: But why you don't)\nStay up\nStay up\nStay up\nStay up ([88]: I know you gotta)\nStay up ([K]: You know you gotta)\nStay- ([88]: I need that)\n(VIAGRA!!)\nStay up\nStay up ([88]: She told me \"Bitch\" stay up)\nStay up\nStay up", "image": "https://images.rapgenius.com/36bd6f7c9c038652449c033bb7088bd1.700x700x1.jpg", "year": null, "title": "Stay Up! (Viagra)"}]}