{"artist": "60 Second Assassin", "songs": [{"title": "Take Sword Pt. II", "album": "Afro Samurai Soundtrack Album", "year": "2006-01-30", "lyrics": "[Intro: \"Shaolin Vs. Wu-Tang\" sample (60 Second Assassin, True Master)]\n(Black Samurai)\n\"Take the sword\"\n\"The sword?\"\n\"Come on, give me the sword\"\n\"Huh?\"\n(Everybody let your head take control)\n\"Heh, you Wu-Tang are never gonna win\"\n\"My lord, don't be afraid of the Wu-Tang techniques\"\n(If you are natural)\n\"Take the sword!\"\n(Everybody let your head take control\n(If you are natural)\n\n[60 Second Assassin]\nBlack Samurai, land of the Wu\nTrue are these lyrics for a Mars bar\nBiochemical, fury! You get thrown in the maze\nOf court and jury, the psycopath, chief of the war cloud\nWarpath, whoopin' up his ass\nHold up his world like Atlas\nIn-car-nating, styles, you can call the death trials!\nDon't, but not flinch from the eyelines\nSick, the crack of the smile, I might play wild child\nEnter the stands of a bound, because you found\nYou should be, stripped of your gown\nMutilated, maned, shipped out, what the fuck, you don' tripped out\nMiscount, 60 Sec., account the amount\nYou seem to lost, your whereabout, there about\nA year to mount roundhouse, heavy second stakeout\nTry to break out, and get knocked about\nFifty-two blocks on the house, figured, no action and all mouth\nNow watch me put on this show like Paramount\nDisfigure your aura like sourcrout\nYou want beef? You want war, where we go to? The mountains\nHurt with rhymes that'll cripple you, beyond dispicable\nUncurable, once you exit in the realm of the fictional\nOr should I say death, cuz rhymes should of been kept\nChopping necks, Black Samurai...\nYeah, home of the ruckus, Black Samurai\n\n[True Master]\nYo, Black Samurai, I'm God, a man awakening in the night\nOut of darkness, I see a flicker of light\nLast is first, no, first is last\nLong believed in, I am a thought that came to pass\nI am a Black Man, as you are me\nI feel a change coming, I see things others do not see\nWe incourage each other with words that's bred\nAnd annoint the heads of the now mentally dead\nWe are heading home, the wicked soon'll be crushed\nI am air, I am flame, I am water, I am dust\nMy thoughts flicker, blow a moment, then catch a fire\nAs I elevate myself, higher and higher\nAn since knowledge of myself is truly known\nMy foundation is like that of the most solid stone\nI come forth by day with the new way\nA new way which is really the same as the old way\nCome and get going as I first became\nCuz father and son, one in the same\nKnow yourself, you will soon understand\nThat who you are indeed, is the original man\nBlack Samurai, we never die, the third eye\nShining bright in the light, ride through the night\nCheck it out\n\n[Outro: \"Shaolin Vs. Wu-Tang\" sample (60 Second Assassin, True Master)]\n\"Take the sword\"\n\"The sword?\"\n\"Come on, give me the sword\"\n\"Huh?\"\n(Everybody let your head take control)\n(If you are natural)\n\"Heh, you Wu-Tang are never gonna win\"\n\"My lord, don't be afraid of the Wu-Tang techniques\"\n\"Take the sword!\"", "image": "https://images.genius.com/934a82446b3da7846960f0df79197fa9.592x592x1.jpg"}]}