{"songs": [{"year": "2018-11-02", "image": "https://images.genius.com/fa9362e97de4bc062841d2e26b565fbd.1000x1000x1.jpg", "title": "Das erste Mal", "album": "Monument", "lyrics": "[Part 1: Kollegah]\nDas erste Mal mitten in der Nacht über den Freibad-Zaun\nDas erste Mal bis die Lunge brennt vor Polizei abhau'n\nDanach sich verstecken und im Schrank bei einem Homie sitzen\nUnd die Luft anhalten, denn im Gang hört man die Polizisten\nDas erste Mal ’ne Bitch, das erste Mal das erste Mal\nAn nix andres denken, doch vor den Jungs so tun, als wär's egal\nDas erste Mal fast Herzinfarkt wegen hoher Dosis\nErste Logiklektion: alle Frau'n verfluchen, weil sie Hoes sind\nJo, das erste Mal flow’n in der fucking Booth, das erste Mal am Mic\nMein erster Beef, erster Raptext, der erste Double-Rhyme\nDas erste Weed hol'n, das erste tsch-tsching in der Spielo\nDas erste Tor beim Fußball und sich fühl'n wie Ronaldinho\nIrgendwann das erste Kilo, das erste Mal geblasen kriegen\nDas erste Mal im Kampf verlieren und auf der Straße liegen\nDas erste Mal Blut abwischen, aufsteh'n und Rache schwör'n\nDas erste Mal zu hart schlagen und Knochen knacken hör'n\nDer erste Weed-Dunst, die erste Nase Speed und\nDas Gefühl, wenn der Körper grundlos Adrenalin pumpt\nIrgendwann der erste Tiefpunkt\nDas erste Mal checken, du brauchst 'nen Plan\nJo, sonst kommst du niemals raus aus dieser Siedlung\nDer erste Gig, erstes Mal live vor der Crowd\nErstes Mal realisier'n, Mann, du stehst live vor ’ner Crowd, ah\nOb ich vergebe? Nein! Ob ich vergesse? Nein!\nDein erstes Mal mich abzieh’n wird dein letztes sein\n\n[Hook: Kollegah]\nFür alles gibt's ein erstes Mal und die vergisst man nicht\nSo viele erste Male, Bruder, ich erinner’ mich\nInnerlich, weißt du, wer gemeint ist, Bruder, denk an mich\nWenn das Messer sticht, ich vergebe und vergesse nicht\nSag mir, Bruder, was hast du getan?\nSag mir, warum warst du Bastard nicht loyal? Ich vergesse nicht!\nWarum halt' ich die Waffe hier aus Stahl\nWarum zwingst du mich zum allerersten Mal? Ich vergesse nicht!\n\n[Part 2: 18 Karat]\nDas erste Mal mit vierzehn dreißig Mille durch ein'n Raub\nSo erlebte ich das erste Mal den kriminellen Rausch\nDas erste Mal die Achter an den Handgelenken spür'n\nDas erste Mal klopfen bei uns Amcas an die Tür\nDie erste Anklageschrift, die erste Observation\nSo kam’s das erste Mal dazu, die scheiß Cops zu bedroh'n\nIch erinner' mich ans erste Mal Kilos durch die Grenzen fahr'n\nDas erste Mal 'ne Nutte ficken ohne einen Cent zu zahl'n\nDer erste Zug vom Joint, dann die erste Nase Schnee\nEs dauerte nicht lange bis zum ersten AMG\nVon den ersten dreißigtausend bis zur ersten Million\nHeut kenn' ich jeden Kripo, denn ich merke mir Person'n\nDas erste Mal Verrat und das erste Mal vorm Richter steh'n\nDas erste Mal vier Jahre hinter Gittern geh'n\nOb ich vergebe? Nein! Ob ich vergesse? Nein!\nDein erster Versuch mich zu ficken wird dein allerletzter sein\n\n[Hook: 18 Karat]\nFür alles gibt's ein erstes Mal und die vergisst man nicht\nSo viele erste Male, Bruder, ich erinner' mich\nInnerlich, weißt du, wer gemeint ist, Bruder, denk an mich\nWenn das Messer sticht, ich vergebe und vergesse nicht\nSag mir, Bruder, was hast du getan?\nSag mir, warum warst du Bastard nicht loyal? Ich vergesse nicht!\nWarum halt' ich die Waffe hier aus Stahl\nWarum zwingst du mich zum allerersten Mal? Ich vergesse nicht!"}], "artist": "Kollegah"}