{"songs": [{"image": "https://images.genius.com/4b5dc0b0f7d6145dd6e1c7e962808c08.320x180x1.jpg", "year": "2010-08-06", "title": "Best Wishes", "album": null, "lyrics": "[Verse 1: XV]\nStep up now, tell me what your life like\nIs it worth something? What’s the price like?\nWhen I was still sleeping with the nightlight\nYou was out there living in the nightlife\nLike you ain’t have a kid in your hindsight\nI was coloring dad with my Lite-Brite\nJust hoping you were looking for a clock\nAnd one day, you’ll stop when you finally find time\nIt felt weird talking to my mom and I know she sees you in my eyes\nAnd she gon’ get mad if I try to ask:\nDo you know if my dad gonna stop by?\nThat play that you never saw, that ball that I never caught\nAll those years that we both have lost, man I hope you enjoy that all\n\n[Hook]\nI hope you bought the moon, I hope you reach the stars\nI hope you found the things that you already lost\nI hope you have it all, I hope you have it all\nI hope you have it all, I hope you have it all\nI hope you got to see everything you dreamed\nI hope you saw the things that you ain’t see in me\nI hope you have it all, I hope you have it all\nI hope you have it all, I hope you have it all, I hope you have it all\nI hope you live it, hope you get it, hope you got it\nI hope you find it, hope you see it, hope you watch it\nI hope you want it, hope you like it, hope you love it\nI hope you achieve it, hope you reach it, hope you touch it\n\n[Verse 2: XV]\nBlue skies, white setting, big rings, nice wedding\nNew guy, you can walk into Heaven\nMom is a teacher, dad is a reverend\nThe best high heels you can step in\nCloset so big, you can even fit a bed in\nMiddle school sweetheart, high school legend\nHotel suites so high, yellow ledges\nNo cable, dinner by the table\nDozens of roses whenever he’s able\nLove so deep, it’s fatal, is this the kind of thing that you wait for?\nWell I hope you are patient baby, wants and needs, it’ll make you crazy\nWants and needs, it’ll make you crazy, wants and needs, it’ll make you crazy\n\n[Hook]"}], "artist": "XV"}