{"artist": "KJ-52", "songs": [{"image": "https://images.genius.com/7b848bb2c03176f196fbd8167b10284f.1000x1000x1.jpg", "title": "Revenge of the Nerds", "year": null, "album": "Collaborations", "lyrics": "[Hook: Pigeon John]\nWould you please\nWould you dance with me\nMy darling would you please take a chance with me\nI see you over there with the jocks\nI see you over there with the rich boys\nSee you over there with all the pretty girls\nAnd I'm asking one thing...\n\n[Verse 1: KJ-52]\nBack in the day I used to rock the MC Hammer pants\nJump in the middle of the party bust the running man\nDoing the Roger Rabbit at the middle school dance\nGot my man next to the bleachers now that's where we stand\nWalk up to the girl like \"now will you dance with me?\"\nShe's like \"well listen you'll never ever have a chance with me\nI got a boyfriend and he's at like six foot three\n250 pounds and he could beat you up in his sleep\nAnd I'm like \"well really what's that got to do with me?\"\nI don't see him around here so why don't you just come with me\nI'll get you some fruit punch maybe some cookies\nI got the new Vanilla Ice tape how can you not love me?\nShe's like \"well first off all your pants is straight ugly\nYou can't dance and your personality just bug's me\nSo back up off me cause I really got's to let you know\nThat my boyfriend's right over there ohh I got to go\n\n[Hook]\n\n[Verse 2: Pigeon John]\nI grew up in Inglewood a little brown boy\nHad straight hair and I rocked corduroy\nWalked down Venice way in my own way\nWasn't very popular with the girls in 5th grade\nThey used to call me nerd\nThat was even if they used to call me at all\nAcross the school hall I put my head and thought\nWhat could I do to pursue and fought\nIn my own mind was a struggle of sorts\nSchool was a game and I was off court\nOn the bench and the coach wouldn't let me off once\nI sat in the corner of the yard like a dunce\nAnd all I ever wanted was the girl to have lunch\nMaybe in the cafeteria with some punch\nBut it didn't happen I didn't have heart\nCause I knew how it would end from the start and then I asked...\n\n[Hook]\n\n[Verse 3: KJ-52]\nWhen I was growing up it was hard to be happy\nKids knock the books out my hand and make fun of my acne (exactly)\nGive me a wedgie while they throw spitballs at me\nAnd stuff me in my own locker and laugh at me\n(ahhhh ha..) oh you think that's real funny\nCause I'm 5 foot with huge feet and I dress crummy\nAnd all the school bullies want to just take my lunch money\nC'mon man I only got a dollar twenty\nYa know ya life is just really sad man\nWhen you play dodge ball your picked as the last man\nAnd ya run as fast as ya can just like a mad man\nCause the football team wants to throw you in the trash can\nSo really will this madness ever end\nReally will the nerd ever get revenge?\nWill this girl call me back at around ten?\nWill you go out w/ me? I just want to be friends\n\n[Hook]\n\n[Verse 4: KJ-52]\nNow days I'm a little older plus a little bolder\nBut it seems like I just can't get over\nYou ever have a day where nothing goes right\nWell that just seems to be the story of my whole entire life\nSo anybody out there know what I mean?\nTo feel like your third string on a football team?\nAnd ya never ever gonna reach any of your dreams?\nAnd your only hope is making onion rings at burger king\nBut now a days a lot of things done changed\nSince Christ came into my life now and just rearranged\nThe way I look at myself son it ain't the same\nI drive in a whole 'nother lane going against the grain\nI know it might just seem a little strange\nThe fact remains I changed when I called on his name\nSo call me a nerd call me lame it don't matter to me\nSee all I need to know is that my wife will dance with me\n\n[Hook]"}]}