{"songs": [{"image": "https://images.genius.com/bff812621b4e5711800203b54676c8b5.626x640x1.jpg", "title": "My Rib", "album": "Nick Cannon", "year": null, "lyrics": "Uh can I ball?\nYeah can I ball?\nUh can I ball?\nThis is to every female that's ever been in my life\nFlesh of my flesh bone of my bone (I feel you playboy)\nDust to dust uh (for real)\n\n[Verse 1]\nMy rib, my wiz, my dip, my boo\nMy chick, my sugar, my shorty all you\nMy dove, my dogg, my love, my rock\nMy love for you, my love don't stop\nMy life, my dream, my wife, my queen\nMy essence, my coach, my playa, my team\nMy buddy, my baby, my lovey, my lady\nMy shelter, my helper, my pain, I felt you\nMy diamond, my gold, my Zion, my soul\nMy spirit, my flesh, my chest, you hold\nMy shield, my skill, my will be still\nMy youngin', my pumpkin, my sweetness, my somethin'\nMy dumpling, my daisy, my freak you crazy\nMy woman, my girl, my misses, my world\nMy breezy, she need me, believe me be easy\nMy kid, my bid, we live my rib\n\n[Hook 2x]\nYou are my rib and I can't deny\nCloser than my flesh and bone\nAnd my love we share is strong\n\n[Verse 2]\nYo style, yo smile, yo walk, yo mile\nYo dress, yo stress, you saving yo sex\nYou blessed, yo views, yo joys, yo boos\nYo eyes, yo moves, yo heart, no clues\nYo opinion, yo minion, over yo whole livin'\nYo home, yo givin, yo virtue, he hurt you\nYo wounds, you nurture, yo curfew, yo class\nYo curve, yo (whoa), yo glory, yo past\nYo story, yo stash, yo mercy, yo grace\nYo voice, yo face, yo pace, yo taste\nYo morals, yo goals, yo steps, yo toes\nYo sent, yo strength, yo friends, yo foes\nYo prayers, yo cares, yo tears, yo cheers\nFrom yours to my ears, yo crown, yo frown\nYo palms, yo moms, yo kid you give\nWe live, we did, me and you my rib uh\n\n[Hook 2x]\n\n[Verse 3]\nI hate you, I date you, I love you, I make you\nI miss you, I thank you, for you I'm grateful\nI need you, I am you, I stand you, I have to\nI had you, I left you, but I had to, I failed you\nI scared you, I dared you, compared you, I held you\nI kept you, I dissed you, I helped you, I felt you\nWhen I kiss you, I melt you, I see you, I saw you\nI hear you, I call you, no answer I get you\nForget you, forgot you, I lost you, I got you\nI trust you, I doubt you, I can't live without you\nI feel you, I kill you, I heal you, I steal you\nI stole you, I have you, I hold you, I know you\nI knew you, I owed you, I groomed you, I mold you\nI warn you, I scold you, how could I be so cold to you?\nI owe you my life, my soul I live, that's why I believe\nYou are my rib\n\n[Hook 2x]"}], "artist": "Nick Cannon"}