{"artist": "​​wifisfuneral", "songs": [{"year": "2019-09-03", "lyrics": "[Intro]\nYeah, ayy, yeah\nI'm in the lab, no pad, no pen\nJust a styrofoam cup I could pour a four in\n\n[Verse 1]\nUp in the studio, me and my drank\nDeezle on the beat and let me do my thang\nI'm thinkin' 'bout a certain, a certain somebody\nThat perfect somebody\nThat sexy purple body\nShe got service road curves and highway eyes\nThe road to her soul, just follow the road signs\nAnd holla if you hear me\nI love it when she's near me\nI hate when she's away and Satan'll see the day\nThat Hell freeze over before I let her go\nAnd let one of you bitch niggas get her, no, no, no, no\nYou don't know how to treat her\nYou don't know that I need ya\nBaby, do you know that I need ya? Ayy\n'Cause, baby, right now I feel like the whole world is against me\nEver since the death of Pimp C\n\n[Chorus]\nAyy, but me, I'm up in the studio, me and my drank\nMe and my drank, me and my drank\nI'm up in the studio, me and my drank\nMe and my drank, me and my drank\nOkay, you sit on 24's, I sip on 24's\nYou sit on 24's, I sip on 24's\nI drop a four up in a 20 ounce and call that 24's\nI dropped a four up in a 20 ounce and call that 24's\n\n[Verse 2]\nI'm ridin' out, leanin', never noddin' out\nMy girl trippin', damn, I gotta hear my momma mouth\nMy homeboys say I should slow down a little\nBut that shit I'm on make me slow down a lot\nYou bottle pop, I buy a bottled pop\nDrop some syrup in it, get out my Waffle House\nI live in Wayne's World, represent our South\nAnd this how we do it, do it in our South\nOne more ounce'd make me feel so great\nWait, now I can't feel my face\n\n[Chorus]\nI'm up in the studio, me and my drank\nMe and my drank, me and my drank\nI'm up in the studio, me and my drank\nMe and my drank, me and my drank\n\n[Bridge]\nWill somebody please-please double cup me?\nAnd, everybody, please-please don't judge me\nWill somebody please-please double cup me?\nAnd, everybody, please-please don't judge me\n\n[Chorus]\nUp in the studio, me and my drank\nMe and my drank, me and my drank\nUp in the studio, me and my drank\nMe and my drank, me and my drank\n\n[Outro]\nNow for all y'all who ain't heard of him\nMr. M.O.E, the Barr Baby was a southside living legend of 3rd Ward\nBone hard, street veteran\nIt all started way back in '93\nHigh school, he was a fool, he was only 18\nWith the dreams of becoming a ghetto superstar\nRolling in foreign cars through the streets of 3rd ward\nIt was all momma leave 'em with, a trace of M.O.E\nAnd promethazine and he the codeine fiend\nAnd his team was the coldest, every day they rolled thick\nNiggas and hoes on dick\n'Cause that's that screwed up clique\nThe Barr Baby, the Barr Baby, Barr Baby", "image": "https://images.genius.com/9f59655fb74efd658b9766a1804bf879.500x500x1.jpg", "album": null, "title": "Me & My Drank"}]}