{"artist": "King Chip", "songs": [{"image": "https://images.genius.com/deada0ff4e2dc2960604dcfeac9f702a.720x720x1.jpg", "title": "Fat Raps Remix", "year": null, "album": null, "lyrics": "Chuck Inglish:\nYeah\nAnd it's fallin off the side like back fat\nGivin girls rides to the crib not a rat trap\nCheese, peanut butter freeze raps\nI want all these snapped in his back in the day\nLike a tall tee tag\nI need that whip clean G\nWhat's the weather gon be?\nDrop top, no drips on this (supoustry  ?)\nSupposed to be headed downtown\nCarwash like (blal  ?)\nAnd my girl drive the chevy while I break this tree down\nRoll the window back up\nGood, turn it back up\nUgh, UGK\nDiamonds & Wood\nHold up, yea roll up\nThat's tight, that's right\nYou do this right, you might have the time of ya life\n\nDom Kennedy:\nComin from the westside but my fitted say Sox\nWhere you get banged on if you in it or not\nLookin like Cain cuz I watch Menace a lot\nAnd Im tryna fuck yo friend so is she with it or not?\nShout out to ATL cuz Im in Lennox a lot\nAnd I dont like lookin, I go in there to cop\nHouston High Rollers, I go in it a lot\nSpendin money with the strippers u go in there to watch\nBlowin on el\nSmellin like Chanel\nYou say you the man but dawg these bitches can't tell\nBut ladies love Dom cuz Im gettin that mail\nTo make it out my hood is like to make it out of jail\nPut the 10's up and start breakin out the 12's\nBet I have yo girlfriend shakin out her heels\nWe shakin all deals\nAnd chasin all meals\nIm poppin all over how you haters all feel?\n\nBig Sean:\nSmoke good\nFuck better\nCount money\nWhats better?\nThese lil niggas can't hang\nBig shit poppin bitch and big my first name\nIm a westsider, detroit player\nFuck around and i might bring back gators\nEveryday i leave the crib with no money\nAnd come back later with that muthafuckin paper\nFinally famous over erything thats just how i feel bitch\nThey trying to stop my shine\nThey yellin hit the kill switch\nWrong nigga to deal with\nLess you doing a deal with\nGrind hard, thats how i was built bitch\nWhoa there. Whoa there\nIm who everybody know here\nI come through in the club and get more money than promoters\nOh thats your girl? I see her at my show there\nI be off in the hood I bet you dont ever go there\nAyy so slow there boy\nDon't go there boy\nIts people you dont know there boy\nYoung nigga thats addicted to the Polaroids\nAnd i gave these niggas more lines than Corduroy\nAnd my bitches be gorgeous boy\nShowtime i hope you record em boy\nIm out here\n\nBoldy James:\nLets reel half of a brick nd\n\nBring it back to the kitchen\nSee the crack its fizzin\nThen bring it back when its finished\nJimbo put that on a dish\nAnd Chizzel will bag it and sell it\nThen Boldy factored a did\nTo know the cash that Im flippin\n6 gon get stashed in the ceilin\n6-O's in traffic Im pitchin this o\nThat one get split and broke to halves\nAnd this one his o\nAnd that one is his\nAnd this o im baggin and this one\nThis o the last\nThe nigga Ro is a crackilitician\nRollin in av cuz Im gettin dough in that slab\nCuz im gettin over, they mad\nI just grill a bow with my mag on my briches\nKno I'll blast if you tempt him\nBro you will crash in yo whip with holes in yo back cuz you hit\nGoin as fast as yo engine go when you smash in the strip smokin a bag wit yo bitch\nChokin, gaspin for breath holdin, grabbin yo chest from Boldy maggin that tech\nUnload it faster than Vick's concreture school craft to the the sick\nBomb as a brick\n\nAsher Roth:\nI be frustrated with the way that shit's been agin\nAnd Im about to take a break and get away on a vacation\nLike, maybe Malaysia to escape the meditation\nI'll just eat, pray and wait for my day of revelation or I'll\nTake peyote, roam the rivers of Nairobi\nChange my name to Navajo and live alone and only grow weed\nCuz this Naomi flowin show gets pretty lonely\nDont nobody ever know you\nEverybody call you homie\nMoany Moany they'll be sure to treat you phony\nAs soon as you hit your low they won't be pickin up the phone\nSee, Im moved to (Comie  ?) show these fools that I am home\nAnd when Im on the microphone all you wanna-be's can blow me\nSo, take this boner to the dome you little bo-peeps\nThat may be inapropy but Im certainly no sheep\nSee, I only lead in this game of entertainment\nRoth and Big Sean\nWe on\nFinally Famous\n\nChip Tha Ripper:\nYea, now roll 10 of 'em up\nFuck the rules we (anians  ?) pretzel bendin 'em up\nDont give a fuck\nWord to yo daddy leather sandals\nEither pay the light bill or light up them candles\nRegular white al\nCigarello no flavors\nBreak that bitch down and peel of the first layer\nSmooth\nLike a baby's ass\nMercedes pass\nThe ladies ask can they be next cuz im kickin they favorite raps\nLife is playin 2k and kickin raps all day by the lake\nSmokin truth till I collapse in broad day\nIm surfin\nRadical\nNarly\nFar out\nMy stoner chicks gather round soon as I break the jar out\nAy baby girl pass the blizz-ard\nYo woman chose me so I had to jizz her\nDont be sleepin or takin no cat naps\nWe leaders of the new school with these fat raps"}]}