{"artist": "KILLY", "songs": [{"image": "https://images.genius.com/d915da9f41b49bdab8b9a2521270400d.800x800x1.jpg", "title": "Pray For Me", "year": "2018-03-06", "album": "Surrender Your Soul", "lyrics": "[Chorus]\nLive as a king, die your head cut off\nDoves gon' sing when the shot sets off\nToo many prayin' on my downfall\nToo many prayin' on my downfall\nLive as a king, die your head cut off\nThe doves gon' sing when the shot sets off\nToo many prayin' on my downfall\nToo many prayin' on my downfall (yeah yeah yeah)\n\n[Verse]\nHop out the Viper, split the crowd like messiah (me)\nI rock designer, yeah, huh (what? yeah)\nMight cut her off like a tyrant\nKilly Don Dada (what? yeah yeah)\nCall the shots, say shut up (shut up, yeah)\nJewelry, water, huh, deep sea divin', yeah\nI just seen my future in the scroll (hey hey hey)\nPerkies and the cribs, he sold his soul (yeah)\nI can't sell somethin' I never owned (hey hey hey)\nThey wan' see my govy set in stone (what, yeah)\nIf I play that game I never lost (never lost)\nHold up (wait), Hellcat (foreign), burn the tires (skrrt)\nMask on, mask off, Michael Myers (yeah, hey hey)\nMight retire (what?), who's that, you a liar (yeah)\nWho's that? Killy just woke up in new bag (yeah)\nChain on me shine like a treasure chest\nWoke up, I said get a new bag (hey)\nI want the new Jag (Jag)\nGettin' money, it's evident\nSnakes in the grass and they venemous\nEither you prey or a predator\n\n[Chorus]\nLive as a king, die your head cut off\nThe doves gon' sing when the shot sets off\nToo many prayin' on my downfall\nToo many prayin' on my downfall\nI said pray for me or you prey to me\nI said pray for me or you prey to me\nI said pray for me or you prey to me\nI said pray for me or you prey to me\n\n[Outro]\n(What?) bumpin' these bills, call it tolerance (what?)\nAll of these rules, I'm intolerant (hey)\nThree pics, see me and start doggin' it\nHad to stop by and just talk to her (yeah yeah)\nThrowin' these bands like a tomahawk (yeah)\nNo open discussion, didn't talk a lot (talk)\nThey live for one night like a travel lodge (yeah)\nIgniting my city like Molotov (yeah yeah)"}]}