{"artist": "Kool A.D.", "songs": [{"image": "https://images.genius.com/da732ae2fff001033c5054aeffc0ef78.1000x1000x1.jpg", "title": "Dum Diary", "year": "2016-05-27", "album": "O.K. ", "lyrics": "I’m like Malcolm Gladwell, pseudoscientific\nMy cat swell hit it til the cat swell\nDid it like Nina did to Jacques Brel\nOr not quite but yo yo, yo yo yo\nAt least I’m not white right?\nNah, who cares, language is fatal but who’s scared?\nElevator to the top, I don’t do stairs\nSee me with Demi Moore, Afeni Shakur\nHey yo I’m lamping from Havana to Panama\nI got Remy to pour\nCheck your pores, why you sweating me for?\nYo, get out the kitchen, why you checking the recipe for?\nI step in the door and it smell like a medicine store\nAdvil, aspirin, Tylenol, Excedrin, more\nI’d be telling you more, but my melon is sore\nYo, whoa, no, my melanin’s sore\nWho you for?\nThe felon that’s poor or the people who be selling the war?\nWho you telling? Wait, no why you telling ‘em for?\nShut up, shut up, shut up, shut up\nNah, nah, really, shut up, no no, nah wait wait\nI’m Malcolm uhh, wait, umm, McLaren\nBasic bitches rocking what I’m wearing\nPanties drop like umm… K-Swiss stocks when I’m near it\nNo toast(?), I mean hot toast(?)\nWait, I forgot that line\nI don’t give a fuck about it anyway\nHey, check it out, I’m here to stay\nIn a major way, and we be getting paid in a major way\nCheck it out now, I’m on the block singing Guantanamera\nEt cetera, et cetera, et cetera, uh\nI eat ham, shit up on a track\nNice, big-hatted jews, uhh\nUsed to cop porno flicks from me in Crown Heights\nNot really though, haha, yo yo, Kool A.D. too silly yo\nHey, it’s raining, boo Iranian and you be playing but it’s not a game\nMy crew of orangutans in a redwood forest\nI’m James Franco on the cover of VMAN\nKool A.D. He-man, yes we can\nMy literary agent’s husband works for Fox or some shit\nI wouldn’t trust me a lot\nYo but trust me a little, I’m Malcolm Little, proud\nYoung riddle-me-this type\nBlack on white knife to fist fight\nI’m at the People’s Temple reaching for that purple stuff\nKool A.D., you can call me \"Kool Purple Stuff\"\nBrian Jones couldn’t massacre half as raw\nNah, my math is off\nCop me a calculator plus a spaceship, I’m blasting off\nDrunk on Youtube, Hasselhoff\nI’m signing autographs for German rap fans with flash cams taking snaps of my rap hands\nI’m ham-handedly grabbing the cash as fast as I can\nI don’t even know how long it’ll last, man\nThis too shall pass and that too shall pass and um\nThrowing your Tascam in the trash can\nRun your kicks, plus your 606\nYeah, run your gate, I mean, wait, your grapes\nPlus your 808s, that’s exactly, yo, 808s, right?\nYo, run your papes, your cape, your tape, your jape, your yape\nGive a fuck if you can’t feel me\nYou mad real, you can’t see me\nKool A.D. the Great Bandini\nMy fam need me, melanin help me tan easy\nLit it up in Japan, see me shit up on your sand\nI mean your bland CD, ya, that’s what it is, nah\nWait, nothing though, move land to land, it’s no accident\nMy brain's working\nTame jerks trying to box me and lock me like I’m James Kirkland\nI’m working, you lames hurting\nMy aim’s perfect, oh wait, nah, nah, nah not quite though\nBut yo at least I’m not white though, nah\nNo who cares, language is fatal but who’s scared\nAll around the world same song, brain gone like a Scarecrow\nWiz kid path narrow, fly like high like sparrow, young black pharaoh\nAhaha, yeah yeah yeah, young black teenagers, I got three pagers\nI don’t see haters, haters don’t see me\nI’m just a mp3, empty three b-e-e-r-s up into the gullet\n‘Cause fuck it I’m in the forest, I’m in the forest\nCall me George, I’m georgous, I mean I’m gorgeous\nThe human orchid, racks on racks stacked on backs of tortoise\nScorpio but still flourish like a Taurus\nMulti-seasonal see me in all meals\nA-do-do-da-da-ding-ding-ding\nA-do-do-da-da-ding-ding-ding\nEt cetera, et cetera, et cetera\nA-do-do-da-da-ding-ding-ding\nYa ya ya, Kool A.D. the reason all weasel demons fall\nNah I’m not a heathen I believe it all\nPlus I fuck a lot\nCheck, is you stupid? You in a sucka spot\nChest(?) mean best bean you’ve yet seen\nSince Big Pun, the kid drunk off one fifth to the one fifth\nRum kid dumb, run, cops got guns\nThey handling out bids\nI mean handing out bids to kids and steal they childhoods\nCall me bleeding heart but I’m wild good\nMoses’ mother upon the Nile stood\nBasket to casket the child could, Paco\nI mean, wait, Pacino, that’s it\n???? who’s mine? I claim it for the Vazquez clan\nEyes dryer than Damascus, rain-shadow effect\nThe bison painted on cave walls\nThe two dollar Wednesdays, they play ball\nOakland Coliseum, packing a BM(?), Pac in a BM(?)\nYeah, semen on the, uh, um, how you call it? Yeah, the areola\nIf you a player in a game this’ll hold ya\nA whole cold world that gets colder as you get older\nDrafted as a No Limit soldier\nCast the video, I mean, cast in the video for Master P and et cetera\nExcept I didn’t ask to hold the ball it just got passed to me, man\nHunters Point, nigga, I’m nasty V, but Alameda actually\nI’m Elian Gonzalez, I’m being honest\nMy politic too organic to understand it\nI oughta quit, maybe I oughta not\nThought a bit about it for a second, so probably not\nCold but sweet like an Otter Pop\nKnow a lot of tricks but nut(?) a lot\nSay hello to all the chicks up in the parking lot\nAha, used to spark a lot, in the parking lot\nYou could’ve called me Sir Sparkalot\nYeah, operation Peter man, I mean Peter Pan man child, exactly that\nMan, if my granddaddy could see his damn grandchild wonder what he would say and shit\nI know, I know, I talk a lot but it sounds like I ain’t saying shit\nI don’t how to feel about the game but I’m playing it\nThink I’m doing OK and shit, I’m saying shit\nSlightly ahead of the game, I’m not a lame\nI’m Too Short, Victor write a rhyme like a book report\nYeah, almost halal but I could be pork\nHey yo what’s good New York\nPeace to Mike Baker and Track though\nLove Alameda but that shit was wack though\nLight-skinned but still black though\nStill don’t know how to act though\nKnow how to stack dough\nReally I just go where the track go\nThen I just go where the stack go\nThen I just go where the cat go\nBrain in the whip titties out\nNational Geographical, yeah\nTest drive that ass out, nut up on her Lil’ Wayne T-shirt and pass out\nUsed to be under radars of haters and now they lash out\nGoing back to Oakland like the Raiders when my cash(?) stout\nBut I digress, where was I at, though?\nBlah blah blah blah blah blah blah blah\nYeah yeah yeah yeah blah blah blah blah blah\nI mean, uhh, stack dough, stack dough\nCheck it out, yo yo yo yo\nFools be like \"yo, how you do that, bro?\"\nI don’t even know it’s just natural\nBut actually that’s not even the question to ask though\nBut what’s the question to ask? You might ask though like I’m teaching a class\nNo, I’m just letting your ass know\nCollect a couple bills, sit still, watch the grass grow\nMan, just don’t let them snipe you on the tax though\nThey treat you like a child make them wipe you on the ass too\nYou could laugh, they could laugh too\nAnd who laughs last and who’s who?\nI don’t got a fool’s clue\nI’m a TV show, man, I’m Blue’s Clues\nIf you don’t get it then boo hoo\nSee me up on my paper like the Jews do\nUsed to paper hate, now I’m on the paper like a Papermate\nStay awake to the ways of the world cause shit is deep\nLike the cousin of sleep\nI’m bugging, I’m buzzing like every single day of the week\nI used to play in the streets\nTeatherball with a tennis ball for his shoelaces\nNaturally adapt to have more than two faces\nProbably even something like 42 faces\nAnd Biggie was mistaken for like 42 races\nBut, yo, that’s cool though, y’all know it’s Kool, yo\nKehinde Wiley in Israel singing fake blues\nPatricia Williams talks a good game, but who makes her shoes?\nDo we need shoes or should we grow callouses?\nAnd hold chalices of old golden Shabazz Palaces\nI mean, all go(?) to Shabazz Palaces, I fucked it up, my bad\nI don’t give a fuck, I’m so so wait, nah\nHow many malnourished Asian kids you fed today?\nIs Adderall covered by Medicaid?\nHow…umm, is….wait\nManny Pacquiao, welter or featherweight?\nIf I thought about it hard could I letitate? I mean, levitate?\nIs Criss Angel effeminate?\nJust answer, don’t hesitate\nDon’t got love? I guess you better hate\nBut study your mythology methodically and tally all the odds of every Odyssey, got it, b?\nYeah, I don’t even know though, what talks more than the dough though?\nMany righteous teachers go the way of the dodo\nParty at the crossroads is over, but yo yo\nParty at the crossroads is over, but yo yo\nParty at the crossroads is over, but yo yo\nYo yo yo yo yo yo\nAfter the party it’s the afterparty\nThe revolution probably won’t be sponsored by Bacardi\nBe gnarly, Gs sounding like lasagna when I puff the Bob Marley\nSee me eating, but starving\nA parvin(?), I mean a parmesan sandwich, I mean a Spartan\nThat’s exactly no aspersion, yeah\nAn art(arc?) or a curve in a chart upwards\nMy heart is a starfish, enough words\nStarman but I strut earth\nFuck first, love later, shrug haters off\nY’all think y’all swift, but y’all Taylor soft\nNah nah, wait nah wait but wait wait nah nah\nWait but nah nah OK OK OK yo\nI’m learning how to be a boss and paying the cost now now\nCall me pasta, I lay in the sauce now now now\nTell me basta, you saying to stop now now now\nAnd I’m, wait, probably will uh, ya OK\nI’m not a killer but some of y’all gotta be killed\nThis ain’t The Lottery, chill\nAnthropology still couldn’t analyze my pottery, still"}]}