{"artist": "Cashisclay", "songs": [{"title": "Bitte", "album": null, "year": "2013-03-20", "image": "https://images.genius.com/b8be0f24882672d19d10b8cb8386b943.1000x1000x1.jpg", "lyrics": "[Verse 1:]\n\nDenn in meinem Kopf sah es so aus als ob es eigentlich ganz einfach wär!\nAlleine schwer zu scheitern und Hilfe brauch ich von keinem mehr!\nUnd bleib ich erstmal ein Zeit so stehen wirds von alleine werden\nWer den bitte wer will mir erzählen ich werde einsam sterben?\nMeine Leute beleiben hinter mir jetzt ist die Hälfte weg\nMan redet hinterm Rücken doch reagiert nicht auf SMS\nDer Beste ist verletzt und wenn ich es einmal obejktiv betrachte\nMusste ich sie nicht küssen und musst ich keine Miesen machen!\nAber fängt das einmal an, dass sie sagen wir waren befreundet\nRutscht du in den Teufelskreis und denkst was würds mir grad bedeuten?\nWürde Vincent einmal nur von selber meine Nummer wählen\nMüsste ich nicht täglich weil keiner Zeit hat die Stunden zählen!\nSeit 100 Jahren unterwgs zum Ziel in das ich niemals wollte\nDeshalb lauf ich langsam und deshlab schlüpf ich in diese Rolle!\nMama ja es stimmt ich hab die Schule geschmissen\nUnd am Ende bleibt mir nicht mal ein gutes Gewissen!\n\n[Hook:]\n\nUnd bitte, bitte was muss ich einsehen?\nDas ist ein Brief an all die Tage die vorbei gehen\nUnd bitte, bitte wann macht mich Hass stark ?\nDas ist ein Brief an alle Nächte die ich wach lag\nDas ist ein Brief an Dich! Leben ich liebe dich!\nDu hast mich geschaffen aber Tim nein er sieht es nicht\nEr liebt dich nicht! Er trägt den Hass durch mich!\nIch soll dir sagen, er würde gerne erfahren was du bist\n\n[Verse :]\n\nDenn in meinem Herz hat es sich angefühlt als wär das Korrekt und der richtige Weg!\nBitte wann war ich stärker als jetzt? Denn ist es alles Grau um dich herum, dann stechen Farben ins Auge\nSie wachsen solang ich glauben, dass ich daran nicht glaube!\nUnd wenn der Zeitpunkt dann greif ich nach dem Schimmer und ich halt ihn Fest!\nIch hab jedes \"Ich liebe dich\" für immer unterm Hals versteckt\nIch hasse das zu sagen das das alles nicht für ewig bleibt!\nDoch weiß das jede sekunde kann die letzte meines Lebens sein!\nIch kämpf doch nur um Anerkennung Bruder und ich kämpf für dich!\nUnd Schatz ich ebne dir den weg und Mia für dich kämpf ich nicht!\nDu kennst mich nicht! Du lächerliches Miststück! Du bestimmst mich nicht mehr!\nIch weine keine einzige scheiß träne dir hinter her!\nUnd irgendwann wird mich Musik aus diesem Leben holen!\nIch muss hier weg! Den meinen kleine Schwester weint am Telefon!\nUnd Nina ja es stimmt was mit Christine war jeder blick in den Spiegel zeigt es ein Leben lang\nIch hoffe nur das du mir vergeben kannst!\n\n[Hook]\n\n[Verse 3:]\n\nUnd heute male ich den Teufel an die Wand !\nUnd auf´s Neue sag ich jedem, der es hören will alles was ich bereue!\nDeine Treue Gchatz ist unverstädnlich!\nDu siehst einen guten Mensch hinter einer Maske lebt ! Doch nicht mal meine Mutter kennt mich!\nUnvergänglich bleibt das deine Augen mich vergessen lassen!\nWas geb ich zurück ? Ich kann dir nicht mal was zu essen machen!\nNicht mal meine Wäsche waschen! Wenn der Monat sich dem Ende neigt!\nWer weiß wie weit das noch geht ? Mann! Lass deine Weste weiß!\nDu kennst das scheiß Leben, was ich habe wenn ich draußen bin!\nNicht im Ansatz! Und ich sag nicht´s, weil ich es selber nicht glauben will!\nMann! Ich bin kein Typ für im Unterricht die Hand heben!\nIch bin ein Typ für jeder Penner kann von meinem Pfand leben!\nEin Typ der aus dem Pascher fliegt, hab Fantasie, ein Kreativer Kopf doch ein Anti-Held landet nicht im Paradis!\nIst der Weg noch da? Oder ist alles aus? Mein eigener Herr! \"Und leben ist ein Kartenhaus!\n\n[Hook:]"}]}