{"artist": "Fashawn", "songs": [{"year": "2012-11-12", "album": "Champagne & Styrofoam Cups", "image": "https://images.genius.com/09dcf1a0e7f7a1c4eac047d2fc35bd69.500x500x1.jpg", "lyrics": "[Hook: Fashawn]\nDo what I gotta do to eat\nTaking nothing from no one and standing on my own feet\nI tried, but I can’t swallow my pride\n(I’m just a man)\nHomie, my only enemy is time\nI’m living like I’m ready to die\nThinking about grabbing this 9 cause I’m just a man!\n\n[Verse One: Fashawn]\nOh, I’ll be eating lunch with whites like Condoleezza Rice\nGot em saying Mr Laver you’re right, say what you like\nGotta love me even though I was born ugly\nCursed by the sins of Adam got me living like a savage\nAt the same time lavish, grew up to be an addict for fashion\nGood hash, sheesh and fat asses\nThe ones with class though\nFuck them cause Fash knows\nSTO is because of the cash flow\nCan’t keep a visa, but I keep me some hash rolled\nNever gave a fuck, been the same since the tadpole\nSuch an asshole! Really, is that so?\nSwawty I move fast, and don’t try to act slow\nAsk if you ain’t knowing I'm the princw of the city\nKnow every broad, every nigga wanna be in my video\nCome on, man!\nGuess I’m just a mother fucking man!\nFeel like I’m fighting with time, you couldn’t understand\nThat’s the difference!\n\n[Hook]\nDo what I gotta do to eat\nTaking nothing from no one and standing on my own feet\nI tried, but I can’t swallow my pride\n(I’m just a man)\nHomie, my only enemy is time\nI’m living like I’m ready to die\nThinking about grabbing this 9 cause I’m just a man!\n\n[Verse Two: Fashawn]\nPlease forgive me but I bleed just like you\nStack cheese, smoke weed just like you count cheese\nWhy you niggas count Zs I’m psycho!\nNow that I think about it I’m like no body\nLove Shawties live fast and drive slow\nChain on throats looking like his eyes closed\nHardly ever smiles and he stay on his iPhone in grind mode\nWondering where did the time go\nPassports stamped up, feeling like a champ, what?\nFuck you niggas say, they ain’t left the USA\nWoods when I’m in LA, woods when I’m in the bay\nOC beats when I’m over seas\nThey love me cause they know I’m the truth\nIn any live show, I probably tore off the roof\nJust wanna make it to Heaven while I stay in the sky\nWanna play, be the same till the day that I die\nWalking around with dead white men in my pocket\nLincolns, Jacksons, Franklins, Washingtons\nI’m balling!\n\n[Hook]\nDo what I gotta do to eat\nTaking nothing from no one and standing on my own feet\nI tried, but I can’t swallow my pride\n(I’m just a man)\nHomie, my only enemy is time\nI’m living like I’m ready to die\nThinking about grabbing this 9 cause I’m just a man!", "title": "Just A Man"}]}