{"artist": "Andy Mineo", "songs": [{"title": "Anything But Country (break beat_no trap version).mp3", "album": "Work in Progress", "year": "2019-05-31", "image": "https://images.genius.com/c7df29d78aa1c9a7c2a0929c453ffde7.1000x1000x1.jpg", "lyrics": "[Verse 1]\nLook, as a kid I just wanted to fit in\nSo I did whatever the crowd did\nAnd one day I asked this girl at school\nThat I thought was cute, \"Ayy, what you listening to?\"\nShe said, \"I like everything, you know. Everything except country.\"\n\"Me too.\"\nAnd I ain't never gave it a shot, but they said it was wack, so I figured it's true\nFast forward twenty years later\nYou might catch me bumping Kenny Rogers in the player\nI got a little older, formed my own opinion\nStopped letting other people do my own thinking\nSometimes I wonder how many things I've passed by\nAnd even passed judgement 'fore I gave it a try\nSo I keep an open mind, no exceptions\nMan, I'm going country, I hope you get the message, yeah (Uh)\n\n[Pre-Chorus]\nI know you heard this before: Rap is for the gangsters\nCountry's for the cowboys, R&B is for the ladies, not true\nIf you don't know me, uh, you can't judge me, uh\nThey gon' love me when I pull up to this party\n\n[Chorus]\nBumping country (Haha)\nOoh-ooh-ooh\nWhy don't you give it a try? You might like country\nOoh-ooh-ooh\nWhy don't you give it a try? You might like country\nOoh-ooh-ooh (Yeah)\nI think you might like you some country (Yeah)\nOoh-ooh-ooh\nWhat if you end up liking?\n\n[Verse 2]\nWell, I grew up in a home\nWhere my father wasn't in the home\nSo once in a while, I'd visit on the weekend\nMy Italian side, and that's when I'd see him\nCapiche? (Ha)\nI remember speaking in detail\nBut only got football and females\nA girlfriend? He asked if I had one\nAnd if so, never bring home a Black one\n\"It must something wrong with them\"\nWell, that's what I thought back then\nI wonder what his parents taught him\nThe irony is the closest thing I had to a dad was a black man\nThey say don't judge a book by its cover, and never judge a man by his skin\nAnd never judge a song by its genre\nOur hearts are the monsters that we should really fight against\nBut it seems like–\n\n[Pre-Chorus]\nI know you heard this before: Rap is for the gangsters\nCountry's for the cowboys, R&B is for the ladies, not true\nIf you don't know me, uh, you can't judge me, uh\nThey gon' love me when I pull up to this party\n\n[Chorus]\nBumping country\nOoh-ooh-ooh\nWhy don't you give it a try? You might like country\nOoh-ooh-ooh\nWhy don't you give it a try? You might like country\nOoh-ooh-ooh\nI think you might like you some country\nOoh-ooh-ooh\nWhat if you end up liking?\n\n[Outro]\nYou might see me bumping Kenny Rogers in the player"}]}