{"artist": "Fat Joe", "songs": [{"year": "2005-06-14", "album": "The Darkside Vol. 1", "image": "https://images.genius.com/a346ed5d5bb8736594a9565557319edf.1000x1000x1.jpg", "lyrics": "[Intro: R. Kelly]\n(I don't know how we made it..)\nJanuary boy, Crack..\n\n[Verse 1: Fat Joe]\nYo, it was all a dream, couldn't save B.I.G. and Pac\nRight in broad day watch the fiends bodies drop\nAnd at night you gotta turn your TV volume up\n'Cause the cop sirens blast up and down my block\nShit ain't been the same is what you hear on my block\nBunch of old school gangstas telling tales on my block\nCame home tatted tears in a plan to get paid\nYou put it in a pot said a prayer and it came\nWhat can make you smile'll be the thing to bring you pain\nIs what my daddy told my momma going through her labor pains\nIs what my momma told me as the cops took me away\nEazy-E said \"fuck 'em\", yeah I feel the same way\nAnother dead body is just another homicide\nBut niggas trying to kill us, why we call it Darkside\nThe streets is, ruthless, even sold to my own blood\nNo love, just a youngin' trying to blow up\n\n[Chorus: R. Kelly]\nSo tell me how did we, how did we, how did we get here?\nFrom the middle of no where\nCame up out these streets we made it, yeah\nSo tell me how did we, how did we, how did we get here?\nFrom the middle of no where, somebody tell me, how?\n\n[Verse 2: Fat Joe]\nMe and my niggas taking pictures trying to freeze time\nJus' some lil' niggas doing shit we can't rewind\nKnow what I'm saying?\nShit is real, fuck what y'all thought\nToo many niggas getting killed on the ball court\nThey was chasing hoop dreams and I was busting sawed offs\nAnd if your jewels gleamed, I would take 'em all off\nExtend my organization, the crib swarming with agents\nMoms crying, we pacing like lions in cages\nMob giants turned into some clients with cases\nSome niggas made statements\nSome niggas made the papers, damn\nWhat part of the game is that?\nI mean to hustle all my life, but I do love rap\nThey got my knees straighten, put the battery in my back\nThis is around the same time Calderon got clapped\nHe told me put my life in music, \"Joey, broaden your dreams\nYou can do it, look at Finesse, it ain't as hard as it seems\"\n\n[Chorus: R. Kelly]\nSo tell me how did we, how did we, how did we get here?\nFrom the middle of no where\nCame up out these streets we made it, yeah\nSo tell me how did we, how did we, how did we get here?\nFrom the middle of no where, somebody tell me, how?\n\n[Verse 3: Fat Joe]\nAin't this nice I'm bigger than life\nIn a Jacuzzi smoking a Cohiba but this ain't a movie\nBefore I wasn't attractive now I pack the house with groupies\nRubbing shoulders with actors just imagine how would you be\nRocking the latest fashion, this is Juicy, all over again\n2010, its like B.I.G. is living through me\nChance (?) from crack to rap, now the paper's greater\nTrying to see me on that block, I'll see you haters later\nI'm so high, I defy gravity, nigga fuck a star, I'm a galaxy\nSo out of space they can't grab at me\nFeds ain't nabbing me, I'm all legit\nMy bankroll much thicker blame it all on the hits\nI started off with bricks, now I own offices\nWho would have thought I got all this from talking slick\nYeah, we went from day-breakers to tax payers\nIt was once all a dream, now the labels pay us\n\n[Chorus: R. Kelly]\nSo tell me how did we, how did we, how did we get here?\nFrom the middle of no where\nCame up out these streets we made it, yeah\nSo tell me how did we, how did we, how did we get here?\nFrom the middle of no where, somebody tell me, how?\n\n[Verse 4: R. Kelly]\nI was supposed to be dead\nI was in them streets real bad (real bad)\nDreams of houses in the hills, I was hustling just to make it real\nBut now I came up and I'm number one\nY'all know the story, mo' money mo' problems\nIn these streets live or die, and I lived, I don't know why\n\n[Chorus: R. Kelly]\nSo tell me how did we, how did we, how did we get here?\nFrom the middle of no where\nCame up out these streets we made it, yeah\nSo tell me how did we, how did we, how did we get here?\nFrom the middle of no where, somebody tell me, how?", "title": "How Did We Get Here"}]}