{"artist": "Ace Hood", "songs": [{"title": "Beast of the South", "album": "Body Bag 4", "year": "2016-11-07", "lyrics": "[Verse 1]\nOk I'm smoked out with my woes round\nAs we pour up shots of that Henn\nGot some real shit that you don't know about\nThat's been clouding up my head\nCut off old hoes, some fake friends a nigga occupied with these ends\nAnd a nigga comfortable in this Benz\nNo I'm not the same Antoine from back then\nMade some sacrifices, my family life I can't jeopardize what I built\nI ain't here to sympathize I got kids and I don't want them to worry about shit\nSo I'm in an overdrive, I'm going overtime a nigga Sammy Sosa with these hits\nSeven years in it bitch I been a menace the flow that they spitting the one I invented\nWho got a problem just holler I got 'em\nMy foot on the throttle with this I'm a chemist\nThis that Lil Wayne when he got out of prison\nThis is that shit make you switch your religion\nThis is that hot as the stove in the kitchen a bomb in the lobby Osama Bin Laddie they can not deny me my flow went to potty\nThat shit is a hommy the beat is a body\n2016 imma pull up the Bentley then pull up the Chevy then whip out the 'Rarri\nMe and my team came to fuck up the party then snatch all the women and walk out the party\nI'm on that nonchalant Kanye shrug, these niggas they will never learn\nY'all working every fucking nerve, these niggas got the fuckin' nerve\nDon't compare me to these fuckin' nerds, same shit in each and every verse\nBlah-blah, telling all lies I just really need to find a fuck first\nI am charged up, get your bars up\nYou a sweet square like a Starburst\nI can hear my people saying \"get 'em, get 'em\"\nNiggas tried to dent me thats a fender bender, wooh\n\n[Break]\nNigga! Beast of the South! Nigga! Beast of the South! Nigga!\n\n[Verse 2]\nScreaming Hood Nation they ain't fucking with us\nI'm the hottest nigga in the South living\nThis that free tape, Happy Thanksgiving\nBoy this shit is only God given\nFuck the waiting 'cause the time ticking\nDo it better than the last did it\nNow or never I got heavy metal in that Double R call it rose petals\nNiggas know better who to play with, I determine what the wave is\nBetter tell 'em what my name is\nAww, look at what the game did\nPay attention it expose friends, niggas hanging by a clothes pin\nFucked all up what pride did, need to cut out all that nonsense\nMoney the root of the evil, you got it you stunting like Evil Knievel\nHope you remember me like I'm the Beatles", "image": "https://images.genius.com/ace1932d41cd9e16d92a58575b455414.640x640x1.png"}]}