{"songs": [{"year": "2004-02-10", "album": "The College Dropout", "image": "https://images.genius.com/0bffd93463afe53e7f651f72bedfc78b.1000x1000x1.jpg", "title": "Breathe In Breathe Out", "lyrics": "[Chorus: Ludacris]\nYeah, breathe in, breathe out\nIf ya iced up, pull ya sleeves out\nPush a big truck, pull ya keys out\nGirls go wild and pull ya D's out\nBreathe in, breathe out\nLet them hoes fight, pull her weave out\nIf a nigga act up, pull a Desert E's out\nWhen I pull the piece out niggas like \"Peace out!\"\n\n[Verse 1: Kanye West]\nGolly, more of that bullshit ice rap\nI got to 'pologize to Mos and Kweli (probably)\nBut is it cool to rap about gold\nIf I told the world I copped it from Ghana and Mali? (Mali!)\nFirst nigga with a Benz and a backpack\nIce chain, Carti lens, and a knapsack\nAlways said if I rapped I'd say somethin' significant\nBut now I'm rappin' 'bout money, hoes, and rims again\nAnd it's still about the Benjamins\nBig faced hundreds and whatever other synonyms\nStrippers named Cinnamon, more chips than Pentium\n\"What'cha gon' buy next?\" Whatever new trend it is\nI'm tryin' to spend my stacks, and I'm so broke\nI look back like \"Damn, was I on crack?\"\nI mean, twelve platinum chains, was I on that?\nWhat the hell was wrong with me dog?\nSing along with me y'all\n\n[Chorus: Ludacris]\nYeah, breathe in, breathe out\nIf ya iced up, pull ya sleeves out\nPush a big truck, pull ya keys out\nGirls go wild and pull ya D's out\nBreathe in, breathe out\nLet them hoes fight, pull her weave out\nIf a nigga act up, pull a Desert E's out\nWhen I pull the piece out niggas like \"Peace out!\"\n\n[Verse 2: Kanye West]\nNow even though I went to college\nAnd dropped out of school quick\nI always had a Ph.D: a pretty huge dick\nLadies tired of gettin' ripped off by guys like this\nAnd givin' head is like a whale that's usin' a toothpick\nWell, I'm in the club for a limited time\nAct now and get some action for a $free.99\nLater on, I might charge for ménage\nHeard her man was the boss of the floss\nBut she still want to toss me the drawers\nAnd it ain't gon' cost me because she my caddy\nCuz she grabbed my golf balls in the club\nAnd I'm still actin' calm den-a-muhh, she asked\n\"Can you drive me in the hundreds where my Altima was?\"\nWhile we drive she tellin' me 'bout problems with her man\nBaby, I fully understand, let me help you with a plan\nWhile he trickin' off, don't get no rich nigga\nGive me some head, that'll really piss him off\n\n[Chorus: Ludacris]\nYeah, breathe in, breathe out\nIf ya iced up, pull ya sleeves out\nPush a big truck, pull ya keys out\nGirls go wild and pull ya D's out\nBreathe in, breathe out\nLet them hoes fight, pull her weave out\nIf a nigga act up, pull a Desert E's out\nWhen I pull the piece out niggas like \"Peace out!\"\n\n[Verse 3: Kanye West]\nI blow past low-class niggas with no cash\nIn the four dash six, bitch you can go ask\nSo when I go fast popo just laugh\nRight until I run out of gas or 'til I go crash\nWhatever comes first I'm prepared for the worst\nWhatever comes second I'll be there with my weapon\nPullin' up in the Lexuses, one on both hand\nSo I guess them GSes was ambidextrous\nCoulda sworn her breasteses was sendin' me messages\n\"K I need a free hand mammogram\nI got weed, drink, and a Handicam\nAll of which is legal in Amsterdam\"\nSo say my name like Candyman\nAnd I'ma come and fix you up like the handyman\nBut if you don't need a fix, girl you gotta leave\nYou can't take that all at one time ya gotta breathe\n\n[Chorus: Ludacris]\nYeah, breathe in, breathe out\nIf ya iced up, pull ya sleeves out\nPush a big truck, pull ya keys out\nGirls go wild and pull ya D's out\nBreathe in, breathe out\nLet them hoes fight, pull her weave out\nIf a nigga act up, pull a Desert E's out\nWhen I pull the piece out niggas like \"Peace out!\"\n\n[Outro]\n\"And you say Chi city?\" scratched repeatedly"}], "artist": "Kanye West"}