{"songs": [{"year": null, "album": null, "image": "https://s3.amazonaws.com/rapgenius/1362981577_sweet2b.jpg", "title": "T-Shirt, Blue Jeans & Nike’s", "lyrics": "(feat. E-40)\n\n[Keak Da Sneak]\nMy family roll thick like syrup and milkshakes\nTransporting weight from the south to the golden state\nSwingin' figure 8's, burnin rubber its hypo\nIn the middle of the intersection, tryin to start up a side-show\nMy mind go in other places cats dont speak on\nDa Raw and uncut, for you niggas to tweak on\nI flip on suckas as they come out rappin\nSo imagine whats gon' happen when I catch you in traffic\nWho sell the most records in the bay(You?)\nIndepentent label(You?) No video and radio play? (You?)\nIts been 86 murders since the start of 2002\nWhen niggas bang turfs for the work\nNot that red and blue, and every single block is a street\nWhen niggas hold it down cause you know we gotta eat\nThey call me Keak Sneak, but my real name is Kunta-Kentay B-O-W-E-N\n\n[Chorus: x2]\nMy nigga told me dont be scared, cause I'ma run the streets\nJust like t-shirt, blue jeans, and Nikes\nCoke white t-shirt, blue jeans, and Nikes\nStay strapped with the 45, I wish a nigga would try\n\n[E-40]\nStyle so unique and Exquisite\nGift-ta-Gabbit, I spit it\nI'm off this Gungie my ninja\nI'm so damn twisted from smokin so much turtle I'm spliffed\nWent to court the other day\nSo I wassa perkin early in the mornin, yawnin off\nThis HIGH SPEED CHASE SHIT! Damn near caught a case wit it\nHit the gas, Skeet Skirt, drivin fast, Skeet Skirt\nIn the slow lane, seein stars, goin against the grain\nSlappin this shit, THAT'll FUCK WIT YA BRAIN BOY!\nThis is ya brain on thug(on thug) mode I suppose\nPlenty hoes, Panty hose, 5 times sittin on vogues\n24 inch toes, robbers, lookin out for the hella-kizz-noppers\nWe ain't proper, I'm off the main\nI represent heavy on the grizz 9, Intergame (Intergame)\n\n[Chorus]\n[Keak Da Sneak]\nI'm in the dope-fiend rental, tryin to paint the town\nFour speed honda civic and I'm breakin it down (Breakin it down)\nOne head light plus I'm ridin spare\nThermometer say a hundred, I'm takin him there\nIt was me and Bra Heff, Ridin and smokin\nSide of the Oakland, livin it up, cause the 8 frame broken\nCoke white t-shirt, blue jeans, and Air Max\nCame up Highstreet, stopped on Fairfax\nHit the liquor store, gotta get me a Remy\nCopped some light from Lil' O, forgot the tank on empty\nSo I hit E-1-4 gimmie 10 on fo'\nA box of Philly titans, and a short box of dem 'Ports\nMore for me, if a nigga dont smoke\nAnd I knock the baddest hoes when I ain't on hundred spokes\nGimme head, lemme poke, I know her nigga, but she ain't feelin him\n\n[Chorus]"}], "artist": "Keak da Sneak"}