{"songs": [{"year": "2012-04-10", "image": "https://images.genius.com/bdb1ca23b418b0572caba92910aaa741.600x600x1.jpg", "title": "Headband", "album": "History Will Absolve Me", "lyrics": "[Verse 1]\nStanley Crouch\nRun 'em out of town, Ray Handley, armchair quarterback\nScored on the couch, slouched off sour dumb out Dexter Manley\nTook the words out my mouth; purple diesel, cotton candy\nBurning Down The House\nNew Wave\nMax B acapellas over shoegaze\nWell played, all I can say is touche\nBlue Dream, Yellowcake, Black Haze\nPen game equivalent to Thomas Paine\nPen name the ambievalent Mark Twain\nIntelligent Gucci Mane\nScholarship student, financial aid reduction made 3.5 the ideal unit\nFace disguised, '72 Olympics in Munich\nBaader Meinhof Complex, she likes it rough, slightly abusive\nBut taken in context, you playing the tune, she's behind the music\nRecords is Ruthless\nDave Checketts, I left MSG toothless\nTold the croupier, check it, I ain't stupid\nUniversal Music Group waitin' on Wayne to go acoustic\nKids meals, yalls chairs is boosted\nFuck a flip, I told my whiteboy, just loop it.\n\n[Instrumental Interlude]\n\n[Verse 2]\nApplication folded. Take position and hold it\nDig a hole when the grounds at it coldest\n100 dead Bolsheviks in a pit, froze stiff\nGlaciers of ice, alaskan fish, deadliest catch, type to stowaway on slave ships\nCrustaceans in Barrels\nNegroes in a slum\nThe cattle get funnelled to the barrel of a gun\nDid his time like Papillon, came out squinting at the sun, winking at the nun\nLife like a remake of The Harder They Come\nI want mine here, now, tonight!\nCorner the market, name your price\nHe's ripping me off but the shit is flight\nWorkers of the World unite for that extra vacation day, 6% pay hike\nDon't bother to ask, you know he hatin'\nEating bacon in the middle of The Great Satan, piously pagan\nMemory loss, call me Reagan\nI'll call you Al\nFree enterprise is why we standing here, I don't need another pal\nTryin' to get me up in the hoosegow, off that such and such\nH.R. Pufnstuf\nFamiliar voice in your head telling you to just give up\nCharged off that Cali\nMarion Butts\nUseless aggression like a cruise missile hitting a mud hut\nVillagers stuck, between that proverbial\nIf they ain't kill you, then this side'll prolly murder you"}], "artist": "​billy woods"}